namespace off {
	constexpr auto GNames = 0x6927e00;
	constexpr auto GObjects = 0x6623a18;
	constexpr auto GWorld = 0x6914c5f;
	constexpr auto ObjectsXorValue = 0x7a2f;
}
struct UCloudStorageBase {
	TArray<FString> LocalCloudFiles; // 0x40
	char bSuppressDelegateCalls : 1; // 0x50
};

struct UAnimNotifyState_ParticleColliderTimed {
	TMap<FName, UImpactEffectConfig*> Events; // 0xb8
};

struct UClingComponent {
	FMulticastInlineDelegate OnStateChanged; // 0x178
	FClingConfig ClingConfig; // 0x188
	FClingMoveTickData MoveTickData; // 0x2f0
	EZombieAttachLocationType AttachedLocationType; // 0x314
	EZombieAttachLocationType AttachToLocationType; // 0x315
	bool bIsSwiveling; // 0x316
	bool bClingMoving; // 0x317
	UAnimMontage* CurrentActiveMontage; // 0x318
	FName PoleAttachedCollisionProfileName; // 0x360
};

struct UFloatingPawnMovement {
	float MaxSpeed; // 0x170
	float Acceleration; // 0x174
	float Deceleration; // 0x178
	float TurningBoost; // 0x17c
	char bPositionCorrected : 1; // 0x180
};

struct URoundAnalyticsComponent {
	TArray<TWeakObjectPtr<AGobiPlayerState>> LateJoinersAwaitingProfileLoad; // 0x160
};

struct ATraumaKitBase {
	USceneComponent* SceneRoot; // 0x2a0
	UStaticMeshComponent* StaticMeshComponent; // 0x2a8
	UBoxComponent* UseTriggerVolumeComponent; // 0x2b0
	UAnimContextLocatorComponent* AnimContextLocatorComponent; // 0x2b8
	UPingableComponent* PingableComponent; // 0x2c0
	UStaticMeshComponent* StaticMeshTemp1Component; // 0x2c8
	UStaticMeshComponent* StaticMeshTemp2Component; // 0x2d0
	UUsableComponent* UsableComponent; // 0x2d8
	UUsableHighlightComponent* UsableHighlightComponent; // 0x2e0
	UItemAudioComponent* ItemAudioComponent; // 0x2e8
	FText CostText; // 0x2f0
	FText UsableCurrencyCostTextMsg; // 0x308
	FText ChargeText; // 0x320
	FName HeroCardCompareName; // 0x338
	int32_t FreeChargesPerDifficulty[0x6]; // 0x340
	int32_t CurrencyChargeCost; // 0x358
	float ChanceOfSpawning; // 0x35c
	float HealthHealAmt; // 0x360
	float TraumaHealAmt; // 0x364
	int32_t StrikesHealAmt; // 0x368
	TArray<UGameplayEffect*> ApplyEffectsToTarget; // 0x370
	bool bIsEnabled; // 0x380
	int32_t CurrentChargeCnt; // 0x384
};

struct UNavigationSystemModuleConfig {
	char bStrictlyStatic : 1; // 0x58
	char bCreateOnClient : 1; // 0x58
	char bAutoSpawnMissingNavData : 1; // 0x58
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x58
};

struct UMovieScenePrimitiveMaterialSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe8
};

struct UAchievementsPanelUserWidget {
	TMap<EAchievementCategory, FText> CategoriesToText; // 0x458
};

struct ULootSpawnConfigAsset {
	TArray<float> AttachmentCountWeights; // 0x38
	TArray<FLootSpawnConfig> SpawnConfigs; // 0x48
};

struct AEffectActor {
	UAkComponent* AkComponent; // 0x2a0
	TArray<FImpactDecalDefinition> Decals; // 0x2a8
	TArray<UParticleSystem*> BaseEmitters; // 0x2b8
	FVector2D LifetimeMinMax; // 0x2c8
	float EmitterFadeOutTime; // 0x2d0
	float DestroyDelay; // 0x2d4
	UAkAudioEvent* AudioAOELoop; // 0x2e0
	UAkAudioEvent* AudioAOELoopStop; // 0x2e8
	float AudioCheckRadius; // 0x2f0
	int8_t AudioCheckCountThreshold; // 0x2f4
	FReplicatedEffectActorInfo ReplicatedEffectActorInfo; // 0x32c
};

struct UEnvQueryTest_WallCling_Dot {
	UEnvQueryContext* LineFrom; // 0x208
	UEnvQueryContext* LineTo; // 0x210
	EEnvTestDot TestMode; // 0x218
	bool bAbsoluteValue; // 0x219
};

struct ALevelResetCoordinator {
	TArray<ULevelStreamingDynamic*> LevelsToReset; // 0x2c0
};

struct UInterpTrackInstParticleReplay {
	float LastUpdatePosition; // 0x30
};

struct UMatchmaking {
	UGobiWebServices* GobiWebServices; // 0x30
	UMatchmakingPoolManager* MatchmakingPoolManager; // 0x38
	UOnlineSessions* OnlineSessions; // 0x40
	TArray<FTaskTimerConfig> TimerConfigs; // 0x60
	double GameServerAutoConnectTime; // 0xa98
	double GameServerWaitForFirstPartySessionTime; // 0xaa0
	TArray<FMatchmakingUIBucket> UIBuckets; // 0xaa8
	TArray<FMatchmakingUIAtuinEnvironment> UIAtuinEnvironments; // 0xab8
	TArray<UMatchmakingLocalUserSlot*> LocalUserSlots; // 0xac8
	double WaitForJoinersToLeaveDuration; // 0xcf0
	double PacketRelayGracePeriod; // 0xdd0
	double StartupReconnectGracePeriod; // 0xe08
	double ReconnectSettingsUpdateInterval; // 0xe10
	FMulticastInlineDelegate OnPoolJoined; // 0xfe8
	FMulticastInlineDelegate OnPoolLeft; // 0xff8
	FMulticastInlineDelegate OnPoolServerAllocated; // 0x1008
};

struct UParticleModuleAccelerationBase {
	char bAlwaysInWorldSpace : 1; // 0x38
};

struct UGameCoachListUserWidget {
	TMap<TWeakObjectPtr<UGameCoachLesson>, AWaypoint*> GameCoachWaypoints; // 0x458
	TMap<UGameCoachLesson*, FLessonNotificationData> NotificationLessons; // 0x4a8
};

struct USpectatorPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x188
};

struct UEnvQueryNode {
	int32_t VerNum; // 0x30
};

struct UCanvasPanelSlot {
	FAnchorData LayoutData; // 0x40
	bool bAutoSize; // 0x68
	bool bAutoWidth; // 0x69
	bool bAutoHeight; // 0x6a
	int32_t ZOrder; // 0x6c
};

struct AC4Placement {
	UStaticMeshComponent* StaticMeshComponent; // 0x2a0
	UUsableComponent* UsableComponent; // 0x2a8
	UBoxComponent* UsableTriggerComponent; // 0x2b0
	UAkComponent* AkComponent; // 0x2b8
	UPointLightComponent* PointLightComponent; // 0x2c0
	UGameCoachLessonsComponent* GameCoachLessonsComponent; // 0x2c8
	USceneComponent* AlignComponent; // 0x2d0
	UAnimMontage* UseMontage3P; // 0x2d8
	UMaterialInterface* PlaceableMaterial; // 0x2e0
	UMaterialInterface* C4PlacedMaterial; // 0x2e8
	UAkAudioEvent* AKEC4Activated; // 0x2f0
	UAkAudioEvent* AKEC4ActiveChirp; // 0x2f8
	float PointLightMaxIntensity; // 0x300
	float PointLightMinIntensity; // 0x304
	float FirstFlashChirpDelay; // 0x308
	float InitialFlashChirpDelay; // 0x30c
	int32_t InitialFlashChirpCountMax; // 0x310
	float FlashChirpDelay; // 0x314
};

struct UParticleModuleVectorFieldRotationRate {
	FVector RotationRate; // 0x38
};

struct UParticleModuleLocationWorldOffset_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x88
};

struct UCampaignRunData {
	ECampaignRoundResult LastRoundResult; // 0x30
	bool bNeedsCardDraw; // 0x34
	uint64_t GameplayCardManagerSeed; // 0x38
	TArray<FActiveGameplayCard> StaticDirectorCards; // 0x40
	TArray<FActiveGameplayCard> DynamicDirectorCards; // 0x50
	TArray<FCampaignPlayerSlotData> CampaignPlayerSlotData; // 0x60
};

struct UWander_Special_SpawnPlacementCondition_C {
	FAISpawnEval_InViewOfSafeRoom InViewOfSafeRoom; // 0x78
};

struct UMaterialExpressionConstant3Vector {
	FLinearColor Constant; // 0x48
};

struct UComboButtonWidgetStyle {
	FComboButtonStyle ComboButtonStyle; // 0x38
};

struct UGlobalAnalyticsManager {
	UMatchmakingAnalytics* MatchmakingAnalytics; // 0x90
	UPcHwAnalytics* PcHwAnalyticsComponent; // 0x98
	UProfileDeltaAnalytics* ProfileDeltaAnalytics; // 0xa0
	USurveyPopup* SurveyPopup; // 0xa8
};

struct UNiagaraDataInterfaceColorCurve {
	FRichCurve RedCurve; // 0x60
	FRichCurve GreenCurve; // 0xe0
	FRichCurve BlueCurve; // 0x160
	FRichCurve AlphaCurve; // 0x1e0
};

struct UAnimEvalSet_FallOverStart_C {
	FGameplayEval_RandomChance RandomChance; // 0x1b8
};

struct UHealthBarComponent {
	bool bEnabled; // 0xf8
	FText DisplayName; // 0x100
	bool bEnableHealthbarOnlyForTaggedLocalPlayer; // 0x118
	bool bDisplayHealthbarWhenTeammatesDoDamage; // 0x119
	float ClearOwnerTime; // 0x11c
};

struct UPlayerAnalyticsSettings {
	TArray<FString> PreviouslySentEntitlements; // 0x98
};

struct USubmixEffectSubmixEQPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0x80
};

struct UPlayerInput {
	TArray<FKeyBind> DebugExecBindings; // 0x128
	TArray<FName> InvertedAxis; // 0x168
};

struct UCompressedImageSequenceProtocol {
	int32_t CompressionQuality; // 0xe0
};

struct UParticleModuleSubUVMovie {
	char bUseEmitterTime : 1; // 0x78
	FRawDistributionFloat FrameRate; // 0x80
	int32_t StartingFrame; // 0xb0
};

struct UGameplayTagsDeveloperSettings {
	FString DeveloperConfigName; // 0x30
};

struct UCameraModifier_DamageScreenEffect {
	TArray<FDamageThreshold> DamageThresholds; // 0x630
};

struct UApplyGameModeTagMod {
	FGameplayTagContainer TagsToApply; // 0xd0
};

struct UEnvQueryGenerator_Composite {
	TArray<UEnvQueryGenerator*> Generators; // 0x58
	char bAllowDifferentItemTypes : 1; // 0x68
	char bHasMatchingItemType : 1; // 0x68
	UEnvQueryItemType* ForcedItemType; // 0x70
};

struct UGameCoachPluginSettings {
	UGameCoach* GameCoachClass; // 0x40
	TArray<UGameCoachLesson*> TipLessons; // 0x48
	int32_t NumTipsPerLevel; // 0x58
};

struct UMaterialExpressionSpeedTree {
	FExpressionInput GeometryInput; // 0x48
	FExpressionInput WindInput; // 0x5c
	FExpressionInput LODInput; // 0x70
	FExpressionInput ExtraBendWS; // 0x84
	ESpeedTreeGeometryType GeometryType; // 0x98
	ESpeedTreeWindType WindType; // 0x99
	ESpeedTreeLODType LODType; // 0x9a
	float BillboardThreshold; // 0x9c
	bool bAccurateWindVelocities; // 0xa0
};

struct AAkReverbVolume {
	char bEnabled : 1; // 0x318
	UAkAuxBus* AuxBus; // 0x320
	FString AuxBusName; // 0x328
	float SendLevel; // 0x338
	float FadeRate; // 0x33c
	float Priority; // 0x340
	UAkLateReverbComponent* LateReverbComponent; // 0x348
};

struct ULevelStreamingMod {
	FName LevelStreamingKeyToAdd; // 0xd0
};

struct AWaterVolume {
	TArray<AGobiCharacter*> Characters; // 0x2f8
	UWaterVolumeDef* Definition; // 0x3a8
	UWaterSurface* Surface; // 0x3b0
	bool bSurfaceHeightModifiable; // 0x410
	float WaterSurfaceZ; // 0x414
};

struct UNavMovementComponent {
	FNavAgentProperties NavAgentProps; // 0x128
	float FixedPathBrakingDistance; // 0x158
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x15c
	char bUseAccelerationForPaths : 1; // 0x15c
	char bUseFixedBrakingDistanceForPaths : 1; // 0x15c
	FMovementProperties MovementState; // 0x15d
	UObject* PathFollowingComp; // 0x160
};

struct UParticleModuleLifetime {
	FRawDistributionFloat Lifetime; // 0x38
};

struct UInAppPurchaseRestoreCallbackProxy2 {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UExponentialHeightFogComponent {
	float FogDensity; // 0x230
	float FogHeightFalloff; // 0x234
	FExponentialHeightFogData SecondFogData; // 0x238
	FLinearColor FogInscatteringColor; // 0x244
	UTextureCube* InscatteringColorCubemap; // 0x258
	float InscatteringColorCubemapAngle; // 0x260
	FLinearColor InscatteringTextureTint; // 0x264
	float FullyDirectionalInscatteringColorDistance; // 0x274
	float NonDirectionalInscatteringColorDistance; // 0x278
	float DirectionalInscatteringExponent; // 0x27c
	float DirectionalInscatteringStartDistance; // 0x280
	FLinearColor DirectionalInscatteringColor; // 0x284
	float FogMaxOpacity; // 0x294
	float StartDistance; // 0x298
	float FogCutoffDistance; // 0x29c
	bool bEnableVolumetricFog; // 0x2a0
	float VolumetricFogScatteringDistribution; // 0x2a4
	FColor VolumetricFogAlbedo; // 0x2a8
	FLinearColor VolumetricFogEmissive; // 0x2ac
	float VolumetricFogExtinctionScale; // 0x2bc
	float VolumetricFogDistance; // 0x2c0
	float VolumetricFogStaticLightingScatteringIntensity; // 0x2c4
	bool bOverrideLightColorsWithFogInscatteringColors; // 0x2c8
};

struct UInstantInventoryUpgradeMod {
	FGameplayTagQuery TagQuery; // 0xd0
};

struct ULegalScreen_WBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x558
	UWidgetAnimation* EpilepsyWarningFadeOut; // 0x560
	UWidgetAnimation* EpilepsyWarningDelay10s; // 0x568
	UWidgetAnimation* LegalFadeOut; // 0x570
	UWidgetAnimation* LegalFadeIn; // 0x578
	UWidgetAnimation* LogoFadeOut; // 0x580
	UWidgetAnimation* LogoFadeIn; // 0x588
	UVerticalBox* LegalPanel; // 0x590
	UShaderBuildProgress_WBP_C* ShaderBuildProgress_WBP; // 0x598
	FMulticastInlineDelegate OnAnimationsFinished; // 0x5a0
	bool bWaitOnAssets; // 0x5b0
	bool bShaderCompilationEnabled; // 0x5b1
	bool bSkipLegalScreen; // 0x5b2
};

struct UShrubEmitterNode {
	FShrubEmitterInfo ShrubInfo; // 0x70
};

struct UNiagaraDataInterfaceVector2DCurve {
	FRichCurve XCurve; // 0x60
	FRichCurve YCurve; // 0xe0
};

struct UFixedFrameRateCustomTimeStep {
	FFrameRate FixedFrameRate; // 0x30
};

struct UAISenseConfig_Blueprint {
	UAISense_Blueprint* Implementation; // 0x50
};

struct UPawnAction_Move {
	AActor* GoalActor; // 0xa0
	FVector GoalLocation; // 0xa8
	float AcceptableRadius; // 0xb4
	UNavigationQueryFilter* FilterClass; // 0xb8
	char bAllowStrafe : 1; // 0xc0
	char bFinishOnOverlap : 1; // 0xc0
	char bUsePathfinding : 1; // 0xc0
	char bAllowPartialPath : 1; // 0xc0
	char bProjectGoalToNavigation : 1; // 0xc0
	char bUpdatePathToGoal : 1; // 0xc0
	char bAbortChildActionOnPathChange : 1; // 0xc0
};

struct UItemFilterUserWidget {
	FMulticastInlineDelegate OnFilterChanged; // 0x458
	TArray<EItemFilter> Filters; // 0x468
	EItemFilter DefaultFilter; // 0x478
};

struct UMovieSceneEventTrack {
	char bFireEventsWhenForwards : 1; // 0x60
	char bFireEventsWhenBackwards : 1; // 0x60
	EFireEventsAtPosition EventPosition; // 0x64
	TArray<FMovieSceneObjectBindingID> EventReceivers; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UOnSaferoomStateChangeTrigger {
	float TimerInterval; // 0x58
	float InSaferoomDelay; // 0x5c
	float InitialEndingSaferoomDelay; // 0x60
	FVector2D SaferoonWaitingDelayMinMax; // 0x64
	float InjuredChance; // 0x6c
	TWeakObjectPtr<ASafeRoom> StartingSaferoom; // 0x70
};

struct UProjectileImpactEmitterComponent {
	FName GameplayEffectEmitterComponentTag; // 0xe8
	bool bEmitOnFirstImpactOnly; // 0xf0
};

struct UAIDataProvider_TuningData {
	FName ParamName; // 0x30
	float FloatValue; // 0x38
	int32_t IntValue; // 0x3c
	bool BoolValue; // 0x40
	FGameplayTagContainer TagsValue; // 0x48
	FGameplayTagQuery TagQueryValue; // 0x68
	UObject* UObjectValue; // 0xb0
};

struct UMaterialExpressionRayTracingQualitySwitch {
	FExpressionInput Normal; // 0x48
	FExpressionInput RayTraced; // 0x5c
};

struct UAkWwiseTree {
	FMulticastInlineDelegate OnSelectionChanged; // 0x148
	FMulticastInlineDelegate OnItemDragged; // 0x158
};

struct UCharacterMusicInfo {
	AActor* ClassFilter; // 0x38
	UAkAudioEvent* CharacterMusicStart; // 0x40
	UAkAudioEvent* CharacterMusicStop; // 0x48
	float MusicDelayDueToDeath; // 0x50
	FString DistanceRTPCName; // 0x58
	EMusicEventType SupportedCharacterEvents; // 0x68
	float EngagedDistance; // 0x6c
	float MaxDistance; // 0x70
	FName PassiveMusicState; // 0x74
	FName DistantMusicState; // 0x7c
	bool bWantsBeatSync; // 0x84
	FName StateGroup; // 0x88
	FGameplayTag CharacterTag; // 0x90
	TMap<FGameplayTag, FCharacterMusicStateConfig> TagToStateMapping; // 0x98
	FCharacterMusicStateConfig ActiveCharacterMusicState; // 0xf0
	TWeakObjectPtr<AActor> ClosestCharacter; // 0x12c
};

struct UGameplayAction_BotAttack {
	float DefaultAtkRange; // 0x210
	float DefaultEnemyRadius; // 0x214
	UAnimContext_Actor* EnemyContext; // 0x218
	UGameplayEvaluatorSet* FilterSet; // 0x220
	UGameplayEffect* CooldownEffectOnSecondaryAtk; // 0x228
	FGameplayTag BotAtkSecondaryCooldownTag; // 0x230
};

struct ABirdSite {
	int32_t PerchVisibility; // 0x2a0
	bool bAllowHorizontalBirdMovement; // 0x2c8
	bool bEnableTrigger; // 0x2c9
	bool bTriggersAllBirdSites; // 0x2ca
	FGamePropertyFloat ChanceToHorde; // 0x2d0
	FGamePropertyFloat ChanceToAlert; // 0x308
	bool bHordeRetriggerable; // 0x340
	bool bAlertRetriggerable; // 0x341
	FGameplayTagContainer TriggerOmenTags; // 0x348
	float HordeAlertDelay; // 0x368
	int32_t MinBirdsToHordeAndAlert; // 0x36c
	float TrackedCharactersUpdateRate; // 0x370
	float CrouchedTriggerRadius; // 0x374
	FVector2D TakeOffDistance; // 0x378
	FVector2D TakeOffPitch; // 0x380
	FVector2D TakeOffYaw; // 0x388
	EBirdFacing BirdFacing; // 0x390
	bool bBirdsVisibleInInvalidCell; // 0x391
	bool bSnapSplinePointsToGround; // 0x392
	float SnapSearchUp; // 0x394
	float SnapSearchDown; // 0x398
	bool AlertsTriggerAll; // 0x39c
	USplineComponent* SplineComponent; // 0x3a0
	UAkComponent* AkComponent; // 0x3a8
	UPingableComponent* PingableComponent; // 0x3b0
	UBoxComponent* PingableVolume; // 0x3b8
	FGameplayTag HordeCue; // 0x3c0
	FVector2D HordeCueDistance; // 0x3c8
	FVector2D HordeCueHeight; // 0x3d0
	UAkAudioEvent* AKEIdleLoop; // 0x3d8
	UAkAudioEvent* AKEIdleLoopStop; // 0x3e0
	UAkAudioEvent* AKEFlyAway; // 0x3e8
	float MaxDistanceSurprised; // 0x3f0
	ABirdSystem* BirdSystem; // 0x468
};

struct UGameplayAction_BotIdle {
	UGameplayEvaluatorSet* FilterSet; // 0x210
	float MaxIdleTime; // 0x218
	float MaxIdleTimeNoPlayers; // 0x21c
	bool bFocusWatch; // 0x220
	FFocusWatch FocusWatch; // 0x224
	float TeammateObjectiveDistThreshold; // 0x268
	float TeammateObjectiveUpdateFreq; // 0x26c
};

struct UCheckBoxWidgetStyle {
	FCheckBoxStyle CheckBoxStyle; // 0x38
};

struct AAudioMaterialOverride {
	float Priority; // 0x318
	EPhysicalSurface Surface; // 0x31c
	FString SpecialSurface; // 0x320
};

struct UEnvQueryGenerator_NavmeshBordersCentroids {
	UNavigationQueryFilter* NavigationFilter; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x60
	FAIDataProviderFloatValue SpaceBetween; // 0x98
	bool bPlaceOnBorders; // 0xd0
	bool bPlaceCentroids; // 0xd1
	UEnvQueryContext* Querier; // 0xd8
	bool bPlaceAtQuerierLocation; // 0xe0
	UEnvQueryContext* GenerateAround; // 0xe8
};

struct UBTService_Hag {
	FBlackboardKeySelector HagStateBBKey; // 0x78
	FBlackboardKeySelector PrevHagStateBBKey; // 0xa0
};

struct UOmenConfigAsset {
	FGameplayTagQuery OmenQuery; // 0x38
	float Range; // 0x80
	EStencilChannel HighlightChannel; // 0x84
	FGameplayTag ScreenEffectTag; // 0x88
	float ScreenEffectDuration; // 0x90
	float ScreenEffectCooldown; // 0x94
	FDataTableRowHandle Dialogue; // 0x98
	float DialogueCooldown; // 0xb8
	TArray<FOmenConfig> Overrides; // 0xc0
};

struct UBrushStampIndicator {
	float BrushRadius; // 0x40
	float BrushFalloff; // 0x44
	FVector BrushPosition; // 0x48
	FVector BrushNormal; // 0x54
	bool bDrawIndicatorLines; // 0x60
	bool bDrawRadiusCircle; // 0x61
	bool bDrawFalloffCircle; // 0x62
	int32_t SampleStepCount; // 0x64
	FLinearColor LineColor; // 0x68
	float LineThickness; // 0x78
	bool bDepthTested; // 0x7c
	bool bDrawSecondaryLines; // 0x7d
	float SecondaryLineThickness; // 0x80
	FLinearColor SecondaryLineColor; // 0x84
	UPrimitiveComponent* AttachedComponent; // 0x98
};

struct UAnimEvalSet_Light_Damage_DeathReaction_C {
	FGameplayEval_DamageAmount DamageAmountComparison; // 0xc0
	FGameplayEval_DamageRange DamageAmountRange; // 0x158
	FGameplayEval_DamageType DamageType; // 0x220
	FGameplayEval_DamageBone DamageBone; // 0x2e0
	FGameplayEval_Distance DistanceToDamageSource; // 0x340
	FGameplayEval_Health AvatarHealth; // 0x410
	FGameplayEval_GameplayTags AvatarTags; // 0x468
	FGameplayEval_SpeedRange AvatarSpeed; // 0x500
};

struct ULeaderboardScreen {
	TArray<ULeaderboardListItem*> ListItems; // 0x598
};

struct ASceneCapture2D {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x2b0
};

struct UGameplayEffectEmitterComponent {
	bool bStartActive; // 0xe8
	FGameplayEffectContext EffectContext; // 0x100
	FGameplayEffectsEmitterTestConfig Config; // 0x180
	UAkComponent* AkComponent; // 0x1d0
	bool bUseShapeComponent; // 0x1d8
	float TickInterval; // 0x1dc
	FEffectEmitterSphere CollisionSphere; // 0x1e0
	FName ShapeComponentTag; // 0x1ec
	FGameplayTag ShapeComponentGameplayTag; // 0x1f4
	FGameplayTag EffectSourceLocationComponentTag; // 0x1fc
	bool bEmitOnlyOnce; // 0x204
	bool bRemoveEffectOnEndOverlap; // 0x205
	bool bRemoveEffectOnStop; // 0x206
	bool bRemoveActiveEffectOnTestFail; // 0x207
	bool bRefreshActiveEffectOnTestPass; // 0x208
	bool bRequiresLineOfSight; // 0x209
	bool bRequiresDotProductCheck; // 0x20a
	float MinTargetDotProduct; // 0x20c
	FGameplayTagQuery OverlapTagQuery; // 0x210
	bool bIgnoreOwnerOverlaps; // 0x258
	FName LineOfSightTargetComponentTag; // 0x25c
	bool bUseTargetEyePosForLoS; // 0x264
	float TraceStartForwardOffset; // 0x268
	UGameplayEffect* EffectClass; // 0x2a8
	UGameplayEffect* OwnerEffectClass; // 0x2b0
	FParticleSet ParticleSet; // 0x2c0
	UAkAudioEvent* StartAkEvent; // 0x340
	UAkAudioEvent* StopAkEvent; // 0x348
	UShapeComponent* ShapeComponent; // 0x350
};

struct UTRSPerfSubsystem {
	UTRSPerfOverall* PerfOverall; // 0x40
};

struct UAISenseConfig_Damage {
	UAISense_Damage* Implementation; // 0x50
};

struct UAkLinuxInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
	FAkTRSPerPlatformSettings TRSSettings; // 0xf8
};

struct UDatasmithCineCameraComponentTemplate {
	FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings; // 0x38
	FDatasmithCameraLensSettingsTemplate LensSettings; // 0x40
	FDatasmithCameraFocusSettingsTemplate FocusSettings; // 0x44
	float CurrentFocalLength; // 0x4c
	float CurrentAperture; // 0x50
	FDatasmithPostProcessSettingsTemplate PostProcessSettings; // 0x60
};

struct ATriggerBase {
	UShapeComponent* CollisionComponent; // 0x2a0
};

struct UAnimNotify_SharedSoundEnemy {
	ESharedEnemyAnimSound EnemySound; // 0x50
	float ChanceToPlayIfLocal; // 0x54
	float ChanceToPlayIfRemote; // 0x58
};

struct USplineMeshMergeComponent {
	FName StaticMeshToReplaceTag; // 0xe8
};

struct UNavLocationComponent {
	FVector NavmeshQueryExtent; // 0x4b8
};

struct UMovieSceneBuiltInEasingFunction {
	EMovieSceneBuiltInEasing Type; // 0x38
};

struct UDatasmithDeltaGenSceneImportData {
	bool bMergeNodes; // 0x50
	bool bOptimizeDuplicatedNodes; // 0x51
	bool bRemoveInvisibleNodes; // 0x52
	bool bSimplifyNodeHierarchy; // 0x53
	bool bImportVar; // 0x54
	FString VarPath; // 0x58
	bool bImportPos; // 0x68
	FString PosPath; // 0x70
	bool bImportTml; // 0x80
	FString TmlPath; // 0x88
};

struct UParticleModuleColor_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb8
};

struct UFacialAnimationPluginSettings {
	FFilePath LipsyncCommandlineTool; // 0x40
	FDirectoryPath VoiceAudioFolder; // 0x50
	TSoftObjectPtr<UDataTable> LocalizationTable; // 0x60
};

struct ALevelVisibilityVolume {
	bool bAddNewLevelsAsVisibile; // 0x370
	TMap<FName, bool> VisibleLevels; // 0x378
	bool bAffectsSectorsAndPortalsTypes; // 0x3c8
};

struct UGameplayEvalSet_LadderIsReady_C {
	FGameplayEval_NavArea IsLadder; // 0x78
	FGameplayEval_IsNavLinkNext IsNavLinkNext; // 0xe8
	FGameplayEval_IsAvatarFacing IsAvatarFacing; // 0x130
	FGameplayEval_Distance IsAtLadder; // 0x188
	FGameplayEval_LadderIsReady LadderIsReady; // 0x258
};

struct UEnvQueryGenerator_Perception {
	UEnvQueryContext* SearchCenter; // 0x58
};

struct UFTUESettings {
	FMulticastInlineDelegate OnTutorialChanged; // 0x88
	TArray<FName> TutorialPopups; // 0xa8
	TArray<FName> BakedMessageSlugs; // 0xb8
	TArray<FName> DynamicMessageSlugs; // 0xc8
	bool bHasAcceptedEULA; // 0xd8
	bool bHasSetStartupOptions; // 0xd9
	bool bHasSeenVoiceRecordingWarning; // 0xda
	bool bHasCompletedTutorialLevels; // 0xdb
	bool bHasSeenCrossplayWarning; // 0xdc
	bool bHasSeenHardwareToast; // 0xdd
	bool bHasSeenPvPDisconnectWarning; // 0xde
	char CompletedTutorials[0x19]; // 0xdf
};

struct UShaderPlatformQualitySettings {
	FMaterialQualityOverrides QualityOverrides[0x3]; // 0x30
};

struct UMaterialExpressionSobol {
	FExpressionInput Cell; // 0x48
	FExpressionInput Index; // 0x5c
	FExpressionInput Seed; // 0x70
	uint32_t ConstIndex; // 0x84
	FVector2D ConstSeed; // 0x88
};

struct ALevelSequenceSmartActor {
	AActor* ProxyActorToReplace; // 0x460
};

struct UTransformGizmo {
	UTransformProxy* ActiveTarget; // 0x48
	bool bSnapToWorldGrid; // 0x50
	bool bUseContextCoordinateSystem; // 0x51
	EToolContextCoordinateSystem CurrentCoordinateSystem; // 0x54
	TArray<UPrimitiveComponent*> ActiveComponents; // 0xf0
	TArray<UPrimitiveComponent*> NonuniformScaleComponents; // 0x100
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x110
	UGizmoConstantFrameAxisSource* CameraAxisSource; // 0x130
	UGizmoComponentAxisSource* AxisXSource; // 0x138
	UGizmoComponentAxisSource* AxisYSource; // 0x140
	UGizmoComponentAxisSource* AxisZSource; // 0x148
	UGizmoComponentAxisSource* UnitAxisXSource; // 0x150
	UGizmoComponentAxisSource* UnitAxisYSource; // 0x158
	UGizmoComponentAxisSource* UnitAxisZSource; // 0x160
	UGizmoTransformChangeStateTarget* StateTarget; // 0x168
	UGizmoScaledTransformSource* ScaledTransformSource; // 0x170
};

struct UTexture2DDynamic {
	EPixelFormat Format; // 0xc8
};

struct UTimecodeProvider {
	float FrameDelay; // 0x30
};

struct ACommon_AICharacterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x13a8
	UBoxComponent* AimAssist_Head; // 0x13b0
	UZombieFacialAnimationComponent* ZombieFacialAnimation; // 0x13b8
	UWeakSpotsComponent* WeakSpots; // 0x13c0
	UStumbleDamageAccumulatorComponent* StumbleDamageAccumulator; // 0x13c8
	UCapsuleComponent* Melee; // 0x13d0
	UMutilationComponent* Mutilation; // 0x13d8
	UStandardBoneMap_BP_C* StandardBoneMap_BP; // 0x13e0
	UEnemyAudioComponent_BP_C* EnemyAudioComponent_BP; // 0x13e8
	UPingableComponent* Pingable; // 0x13f0
};

struct UHeroHighlightComponent {
	FGameplayTagContainer ImpairedHighlightTags; // 0x148
	FName VisibilityBone; // 0x168
	UHeroLifeStateComponent* HeroLifeStateComponent; // 0x170
	bool bHeroHighlightEnabled; // 0x178
	FGameplayTagQuery DeadHighlightItemTagQuery; // 0x180
};

struct UAnimCurveCompressionSettings {
	UAnimCurveCompressionCodec* Codec; // 0x30
};

struct USkinnedDamageTextureComponent {
	USkinnedMeshComponent* SkeletalMesh; // 0xe8
	UTextureRenderTarget2D* DamageTexture; // 0xf0
	uint32_t TextureSize; // 0xf8
	float DamageScalar; // 0xfc
	float DamageInfluenceArea; // 0x100
	uint32_t UVSetToUse; // 0x104
	float InnerGradient; // 0x108
	float OutterGradient; // 0x10c
	bool bUseNormalsForNegativeValues; // 0x110
};

struct ULifeStateZombieGhost {
	TArray<FGhostMaterial> GhostMaterials; // 0xa8
};

struct UPlatformCallouts_WBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x458
	UHorizontalBox* PrimaryCallouts; // 0x460
	UHorizontalBox* RootPanel; // 0x468
	UHorizontalBox* SecondaryCallouts; // 0x470
	TMap<FName, UPlatformCalloutButtonUserWidget*> WidgetsByAction; // 0x478
	float ChildSpacing; // 0x4c8
};

struct UCameraAnimInst {
	UCameraAnim* CamAnim; // 0x30
	UInterpGroupInst* InterpGroupInst; // 0x38
	float PlayRate; // 0x58
	UInterpTrackMove* MoveTrack; // 0x70
	UInterpTrackInstMove* MoveInst; // 0x78
	ECameraAnimPlaySpace PlaySpace; // 0x80
};

struct USoundAttenuation {
	FSoundAttenuationSettings Attenuation; // 0x30
};

struct UGameplayCue_Audio_OneShot {
	ESharedSurvivorAnimSound SoundLookup; // 0x30
	bool bPrepSurface; // 0x31
	bool bShouldFollow; // 0x32
	bool bStopOnDestroy; // 0x33
	bool bFPOnly; // 0x34
};

struct UDialogueEvalSet_Surrounded_C {
	FGameplayEval_NearbyCharacters NearbyCharacters; // 0x78
};

struct UAkIOSInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkAudioSession AudioSession; // 0x98
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa8
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xd0
	FAkTRSPerPlatformSettings TRSSettings; // 0x104
};

struct ULevelSequencePlayer {
	FMulticastInlineDelegate OnCameraCut; // 0x890
};

struct UEnvQueryTest_TimeInActiveAreaSet {
	bool bZeroIfNotVisible; // 0x208
};

struct UMountedGunAnimInstance {
	FRotator DesiredRotation; // 0x2b8
	float DesiredBarrelRotation; // 0x2c4
	float BarrelRotationRate; // 0x2c8
	float BarrelRotationFalloffRate; // 0x2cc
	float GunRotationInterpSpeed; // 0x2d0
};

struct UEnvQueryTest_DirectnessDistance {
	UEnvQueryContext* DirectnessTo; // 0x208
	UEnvQueryContext* DirectnessFrom; // 0x210
	float DistanceRadius; // 0x218
};

struct UARTrackedGeometry {
	FGuid UniqueId; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UMovieSceneByteSection {
	FMovieSceneByteChannel ByteCurve; // 0xe8
};

struct UInterpTrackInstFloatParticleParam {
	float ResetFloat; // 0x30
};

struct UStereoLayerShapeCylinder {
	float Radius; // 0x30
	float OverlayArc; // 0x34
	int32_t Height; // 0x38
};

struct AFogVolume {
	FLinearColor FogColor; // 0x2a0
	float MinVolumeFog; // 0x2b0
	float FogNoiseScale; // 0x2b4
	FVector FogNoisePan; // 0x2b8
	float FogNoisePanSpeed; // 0x2c4
	bool bGenerateGroundFog; // 0x2c8
	float GroundFogHeight; // 0x2cc
	float GroundFogAO; // 0x2d0
	float HeightmapPixelDistance; // 0x2d4
	UMaterialInstanceDynamic* DynamicFogMaterial; // 0x2e0
	UTexture2D* GroundHeightmap; // 0x2e8
};

struct UMovieScene3DAttachSection {
	FName AttachSocketName; // 0x110
	FName AttachComponentName; // 0x118
	EAttachmentRule AttachmentLocationRule; // 0x120
	EAttachmentRule AttachmentRotationRule; // 0x121
	EAttachmentRule AttachmentScaleRule; // 0x122
	EDetachmentRule DetachmentLocationRule; // 0x123
	EDetachmentRule DetachmentRotationRule; // 0x124
	EDetachmentRule DetachmentScaleRule; // 0x125
};

struct UMovieScene3DConstraintTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x60
};

struct UAnimNotify_SpawnDecal {
	UAnimContext_Rotation* TraceDirectionContext; // 0x40
	ECollisionChannel TraceChannel; // 0x48
	float TraceLength; // 0x4c
	FName TraceStartPosBoneName; // 0x50
	float ImpactDirectionAngle; // 0x58
	UDecalDefinition* DecalDefinitionAsset; // 0x60
};

struct URadialForceComponent {
	float Radius; // 0x230
	ERadialImpulseFalloff Falloff; // 0x234
	float ImpulseStrength; // 0x238
	char bImpulseVelChange : 1; // 0x23c
	char bIgnoreOwningActor : 1; // 0x23c
	float ForceStrength; // 0x240
	float DestructibleDamage; // 0x244
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x248
};

struct AGobiSwitchActor {
	FMulticastInlineDelegate SwitchedOn; // 0x2a0
	USceneComponent* SceneRoot; // 0x2b0
	UBoxComponent* UsableVolume; // 0x2b8
	UStaticMeshComponent* UsableMesh; // 0x2c0
	UWaypointSpawnerComponent* WaypointSpawner; // 0x2c8
	UUsableComponent* Usable; // 0x2d0
	UAkComponent* AKComp; // 0x2d8
	UMaterialInterface* MeshMaterial; // 0x2e0
	UMaterialInterface* HologramMeshMaterial; // 0x2e8
	UAkAudioEvent* ActivationSound; // 0x2f0
	UAkAudioEvent* ActivationLoop; // 0x2f8
	UAkAudioEvent* ActivationLoopStop; // 0x300
};

struct ACommon_DismemberedPieceSkel_BP_C {
	USkeletalMeshComponent* SkeletalMesh; // 0x2a0
	USceneComponent* DefaultSceneRoot; // 0x2a8
};

struct UConversationQueue {
	TArray<FQueuedConversation> ConversationQueue; // 0x58
};

struct UHagComponent {
	FGameplayTag HagStateTags[0x5]; // 0x100
	float TimeToInvestigate; // 0x128
	float AlertBerserkDistance; // 0x12c
	FGameplayTagQuery FleeTags; // 0x138
	UBlackboardData* BlackboardAsset; // 0x180
	FBlackboardKeySelector EnemyBBKey; // 0x188
	FBlackboardKeySelector MadAnimPlayedBBKey; // 0x1b0
	FDifficultyBool AllowHordeByDifficulty; // 0x1d8
	AGobiCharacter* HagOwner; // 0x2d0
	AHeroCharacter* BerserkTarget; // 0x2d8
	EHagState CurrentHagState; // 0x2e0
	EHagState PreviousHagState; // 0x2e1
};

struct UBTTask_TriggerAction {
	FAIDataProviderGameplayTagContainerValue GameplayTags; // 0x78
	EGameplayActionMatchingTagType MatchingTagType; // 0xc8
	FAIDataProviderGameplayTagQueryContainerValue MatchingTagQuery; // 0xd0
};

struct ULevelVariantSets {
	UObject* DirectorClass; // 0x30
	TArray<UVariantSet*> VariantSets; // 0x38
};

struct UParticleModuleAttractorLine {
	FVector EndPoint0; // 0x38
	FVector EndPoint1; // 0x44
	FRawDistributionFloat Range; // 0x50
	FRawDistributionFloat Strength; // 0x80
};

struct UGameplayEffectApplyPingEffects {
	FGameplayTagQuery PingTargetQuery; // 0x250
	FGameplayTagQuery CancelTagsQuery; // 0x298
	TArray<UGameplayEffect*> EffectClasses; // 0x2e0
};

struct UAISubsystem {
	UAISystem* AISystem; // 0x38
};

struct UTimeSynchronizationSource {
	bool bUseForSynchronization; // 0x30
	int32_t FrameOffset; // 0x34
};

struct UParticleModuleLocationPrimitiveSphere_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xe8
};

struct AGameSession {
	int32_t MaxSpectators; // 0x2a0
	int32_t MaxPlayers; // 0x2a4
	int32_t MaxPartySize; // 0x2a8
	char MaxSplitscreensPerConnection; // 0x2ac
	bool bRequiresPushToTalk; // 0x2ad
	FName SessionName; // 0x2b0
};

struct UTitanStage1TentacleComponent {
	FMulticastInlineDelegate OnTentaclePainRoarStart; // 0xe8
	FMulticastInlineDelegate OnTentaclePainRoarEnd; // 0xf8
	ETitanStage1TentacleState State; // 0x108
	ETitanStage1TentacleFlinchState FlinchState; // 0x114
	TWeakObjectPtr<AActor> TargetActor; // 0x148
	ETitanTentacleId ID; // 0x150
	TArray<UAnimSequence*> EmergeAnimSequenceVariants; // 0x158
	int8_t EmergeAnimSequenceIndex; // 0x170
	TArray<UAnimSequence*> RetractAnimSequenceVariants; // 0x178
	int8_t RetractAnimSequenceIndex; // 0x190
	TArray<UAnimSequence*> IdleAnimSequenceVariants; // 0x198
	int8_t IdleAnimSequenceIndex; // 0x1b0
	TArray<UAnimSequence*> WoundedIdleAnimSequenceVariants; // 0x1b8
	int8_t WoundedIdleAnimSequenceIndex; // 0x1d0
	UBlendSpace1D* SlapAttackWindUpEnterBlendSpace; // 0x1d8
	UBlendSpace1D* SlapAttackWindUpLoopBlendSpace; // 0x1e0
	UBlendSpace1D* SlapAttackWindUpStumbleBlendSpace; // 0x1e8
	UBlendSpace1D* SlapAttackEnterBlendSpace; // 0x1f0
	UBlendSpace1D* SlapAttackGroundLoopBlendSpace; // 0x1f8
	UBlendSpace1D* SlapAttackRecoverBlendSpace; // 0x200
	TArray<UAnimSequence*> PainRoarAnimSequenceVariants; // 0x208
	int8_t PainRoarAnimSequenceIndex; // 0x220
	UAnimSequence* AcidSprayAttackEnterAnimSequence; // 0x228
	UAnimSequence* AcidSprayAttackLoopAnimSequence; // 0x230
	UAnimSequence* AcidSprayAttackExitAnimSequence; // 0x238
	UAnimSequence* AcidSprayAttackWindUpEnterAnimSequence; // 0x240
	UAnimSequence* AcidSprayAttackWindUpLoopAnimSequence; // 0x248
	float EmergeSeconds; // 0x250
	float RetractSeconds; // 0x254
	float SlapAttackWindUpSeconds; // 0x258
	float SlapAttackWindUpStumbleSeconds; // 0x25c
	float SlapAttackSeconds; // 0x260
	float SlapAttackRecoverSeconds; // 0x264
	float SlapAttackGroundLoopSeconds; // 0x268
	float SlapAttackAOEDelaySeconds; // 0x26c
	float AcidSprayAttackWindUpSeconds; // 0x270
	float AcidSprayAttackLoopSeconds; // 0x274
	float MaxAttackDistance; // 0x278
	float MaxAttackDistanceBelow; // 0x27c
	FGameplayTag AttackVolumeTag; // 0x280
	TArray<UGameplayEffect*> SlapAttackGameplayEffects; // 0x288
	TWeakObjectPtr<AActor> EmergeActor; // 0x298
	UAnimSequence* EmergeSKMAnimSequence; // 0x2a0
	TArray<UAnimSequence*> WindUpFlinchVariants; // 0x2a8
	TArray<UAnimSequence*> GroundLoopFlinchVariants; // 0x2b8
	int8_t WindUpFlinchIndex; // 0x2d0
	int8_t GroundLoopFlinchIndex; // 0x2d1
	FVector2D FlinchCooldownMinMax; // 0x2d8
	float WindUpAccumulatedDamageForStumble; // 0x2e0
	TArray<FGameplayTag> SlapAttackAOEEmitterTags; // 0x2e8
	FName TentacleEndBoneName; // 0x2f8
	TArray<FZOffsetForRange> ZOffsetForRangeArray; // 0x338
	float RiseRate; // 0x348
	UThreatComponent* ThreatComp; // 0x358
	int32_t AllowThreat[0x10]; // 0x360
};

struct UARSaveWorldAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x58
	FMulticastInlineDelegate OnFailed; // 0x68
};

struct UImage {
	FSlateBrush Brush; // 0x148
	FDelegate BrushDelegate; // 0x1d8
	FSlateColor ColorAndOpacity; // 0x1e8
	FDelegate ColorAndOpacityDelegate; // 0x218
	bool bFlipForRightToLeftFlowDirection; // 0x228
	FDelegate OnMouseButtonDownEvent; // 0x22c
};

struct UAnimNotify_PlayMontageNotify {
	FName NotifyName; // 0x40
};

struct UInGameScreen {
	bool bCloseWhenHeroDisabled; // 0x558
	bool bCloseWhenHeroNotAlive; // 0x559
};

struct AAkSpatialAudioVolume {
	UAkSurfaceReflectorSetComponent* SurfaceReflectorSet; // 0x318
	UAkLateReverbComponent* LateReverb; // 0x320
	UAkRoomComponent* Room; // 0x328
};

struct UAnimEvalSet_Shared_Melee_C {
	FGameplayEval_Distance DistanceToEnemy; // 0xc0
	FGameplayEval_Distance DistanceZToEnemy; // 0x190
	FGameplayEval_Angle AngleToEnemy; // 0x260
	FAnimEval_MontageLastPlayed HasPlayedRecently; // 0x2c0
	FGameplayEval_RandomChance RandomChance; // 0x310
	FGameplayEval_Dismembered CheckDismembered; // 0x360
	FGameplayEval_Speed EnemySpeed; // 0x3b8
	FGameplayEval_Random RandomScore; // 0x418
	FGameplayEval_GameplayTags AvatarTags; // 0x460
};

struct ANavLinkProxy {
	TArray<FNavigationLink> PointLinks; // 0x2b0
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x2c0
	UNavLinkCustomComponent* SmartLinkComp; // 0x2d0
	bool bSmartLinkIsRelevant; // 0x2d8
	FMulticastInlineDelegate OnSmartLinkReached; // 0x2e0
};

struct UPartyPlayerCardUserWidget {
	FPartyPlayer Player; // 0x460
	bool bIsEnemy; // 0x570
	bool bIsInGroup; // 0x571
	bool bIsGroupLeader; // 0x572
	bool bIsPlayingGobi; // 0x573
	bool bShowGroupMarker; // 0x574
	bool bIsEmpty; // 0x575
	bool bCharacterNameVisible; // 0x576
	EPartyScreenTab PartyScreenTab; // 0x577
	FSlateColor StatusNormalColor; // 0x578
	FSlateColor StatusNotInGameColor; // 0x5a8
	FSlateColor StatusInPartyColor; // 0x5d8
};

struct URuntimeVirtualTexture {
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x30
	bool bCompressTextures; // 0x31
	bool bEnable; // 0x32
	bool bClearTextures; // 0x33
	bool bSinglePhysicalSpace; // 0x34
	bool bPrivateSpace; // 0x35
	bool bEnableScalability; // 0x36
	int32_t Size; // 0x38
	int32_t TileCount; // 0x3c
	int32_t TileSize; // 0x40
	int32_t TileBorderSize; // 0x44
	int32_t StreamLowMips; // 0x48
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x50
	bool bEnableCompressCrunch; // 0x58
	int32_t RemoveLowMips; // 0x5c
};

struct UARTrackedImage {
	UARCandidateImage* DetectedImage; // 0xe8
	FVector2D EstimatedSize; // 0xf0
};

struct UParticleModuleVelocityOverLifetime {
	FRawDistributionVector VelOverLife; // 0x40
	char Absolute : 1; // 0x88
};

struct UBTService_Brute {
	FBlackboardKeySelector BruteStateBBKey; // 0x78
	FBlackboardKeySelector PrevBruteStateBBKey; // 0xa0
};

struct ACineCameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x830
};

struct UAnimEvalSet_Shared_DestructibleAttackLink_C {
	FGameplayEval_Distance Distance To Destructible; // 0xc0
	FGameplayEval_Distance Z DistanceTo Destructible; // 0x190
	FAnimEval_MontageLastPlayed PlayedRecently; // 0x260
	FGameplayEval_BlockedByPawn BlockedByPawn; // 0x2b0
};

struct UHealthHitMarkerComponent {
	FGameplayTagQuery DamageTagQuery; // 0xe8
	FGameplayTagQuery DamageSourceTagQuery; // 0x130
	float MaxRecentDamageInfoAge; // 0x178
	UHealthComponent* HealthComponent; // 0x180
	AGobiGameStateBase* GobiGameState; // 0x188
};

struct ULandscapeComponent {
	int32_t SectionBaseX; // 0x4b0
	int32_t SectionBaseY; // 0x4b4
	int32_t ComponentSizeQuads; // 0x4b8
	int32_t SubsectionSizeQuads; // 0x4bc
	int32_t NumSubsections; // 0x4c0
	UMaterialInterface* OverrideMaterial; // 0x4c8
	UMaterialInterface* OverrideHoleMaterial; // 0x4d0
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x4d8
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x4e8
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x4f8
	TArray<int8_t> LODIndexToMaterialIndex; // 0x508
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x518
	UTexture2D* XYOffsetmapTexture; // 0x528
	FVector4 WeightmapScaleBias; // 0x530
	float WeightmapSubsectionOffset; // 0x540
	FVector4 HeightmapScaleBias; // 0x550
	FBox CachedLocalBox; // 0x560
	LazyObjectProperty CollisionComponent; // 0x57c
	UTexture2D* HeightmapTexture; // 0x598
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x5a0
	TArray<UTexture2D*> WeightmapTextures; // 0x5b0
	FGuid MapBuildDataId; // 0x5c0
	TArray<FGuid> IrrelevantLights; // 0x5d0
	int32_t CollisionMipLevel; // 0x5e0
	int32_t SimpleCollisionMipLevel; // 0x5e4
	float NegativeZBoundsExtension; // 0x5e8
	float PositiveZBoundsExtension; // 0x5ec
	float StaticLightingResolution; // 0x5f0
	int32_t ForcedLOD; // 0x5f4
	int32_t LODBias; // 0x5f8
	FGuid StateId; // 0x5fc
	FGuid BakedTextureMaterialGuid; // 0x60c
	UTexture2D* GIBakedBaseColorTexture; // 0x620
	char MobileBlendableLayerMask; // 0x628
	UMaterialInterface* MobileMaterialInterface; // 0x630
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x638
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x648
};

struct UAnimContext_NavLinkContextLoc {
	ENavLinkContextLocations DesiredContextLocation; // 0x70
};

struct UDefibrillatorComponent {
	FMulticastInlineDelegate OnDefibSucceeded; // 0x160
	FMulticastInlineDelegate OnDefibFailed; // 0x170
	FDefibillatorMoveTickData MoveTickData; // 0x1d8
	float MaxTargetDistance; // 0x1e8
	float MinAngleToTarget; // 0x1ec
	FGameplayTagContainer OwningPlayerBlockingTags; // 0x1f0
	FGameplayTagContainer OwningPlayerAppliedTags; // 0x210
	FGameplayTagQuery DefibTargetTagQuery; // 0x230
	float RequiredUseTime; // 0x278
	UAnimMontage* FirstPersonMontage; // 0x280
	UAnimMontage* ThirdPersonMontage; // 0x288
	TArray<UMontageSet*> TargetMontageSets; // 0x290
	float TargetAnimationTime; // 0x2a0
	FText OwningPlayerProgressBarText; // 0x2a8
	FText TargetProgressBarText; // 0x2c0
	TArray<UGameplayEffect*> ReviveEffects; // 0x2d8
	UAkAudioEvent* AKEOnBeginUse; // 0x2e8
	UAkAudioEvent* AKEOnEndUse; // 0x2f0
	UAkAudioEvent* AKEOnSuccessfulUse; // 0x2f8
};

struct ASocialSpaceGameState {
	FMulticastInlineDelegate OnSocialSpaceMatchStarted; // 0x578
	FMulticastInlineDelegate OnSocialSpaceMatchEnded; // 0x588
	UGameplayCueManager* GameplayCueManager; // 0x5a0
};

struct USoundNodeDoppler {
	float DopplerIntensity; // 0x60
	bool bUseSmoothing; // 0x64
	float SmoothingInterpSpeed; // 0x68
};

struct ATRSSplineAudioSource {
	UAkComponent* SoundSource; // 0x2a0
	USplineComponent* SoundSpline; // 0x2a8
	bool bAudioPlayOnStart; // 0x2b0
	bool bDrawDebugSphere; // 0x2b1
	ESplineMovementMode MoveType; // 0x2b2
	float SplineRate; // 0x2b4
};

struct UAISystemBase {
	FSoftClassPath AISystemClassName; // 0x30
	FName AISystemModuleName; // 0x48
	bool bInstantiateAISystemOnClient; // 0x58
};

struct UAnimNotify_EvalBranch {
	TArray<FEvalBranchData> BranchData; // 0x40
};

struct AAISpawnActor_BP_C {
	USceneComponent* Scene; // 0x590
	UBillboardComponent* Billboard; // 0x598
	UArrowComponent* Arrow; // 0x5a0
	UNavLocationComponent* NavLocation; // 0x5a8
};

struct UAxisAngleGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x50
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x60
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x70
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x80
	bool bInInteraction; // 0x90
	FVector RotationOrigin; // 0x94
	FVector RotationAxis; // 0xa0
	FVector RotationPlaneX; // 0xac
	FVector RotationPlaneY; // 0xb8
	FVector InteractionStartPoint; // 0xc4
	FVector InteractionCurPoint; // 0xd0
	float InteractionStartAngle; // 0xdc
	float InteractionCurAngle; // 0xe0
};

struct UAnimationSharingManager {
	TArray<USkeleton*> Skeletons; // 0x30
	TArray<UAnimSharingInstance*> PerSkeletonData; // 0x40
};

struct UGobiWatermarkSettings {
	FMargin LegalTextPadding; // 0x40
	FMargin DateTextPadding; // 0x50
	FMargin PartnerDetailsTextPadding; // 0x60
	FTextBlockStyle TextStyle; // 0x70
};

struct UMovieScene2DTransformSection {
	FMovieScene2DTransformMask TransformMask; // 0xe8
	FMovieSceneFloatChannel Translation[0x2]; // 0xf0
	FMovieSceneFloatChannel Rotation; // 0x230
	FMovieSceneFloatChannel Scale[0x2]; // 0x2d0
	FMovieSceneFloatChannel Shear[0x2]; // 0x410
};

struct UMultiLineEditableTextBox {
	FText Text; // 0x168
	FText HintText; // 0x180
	FDelegate HintTextDelegate; // 0x198
	FEditableTextBoxStyle WidgetStyle; // 0x1a8
	FTextBlockStyle TextStyle; // 0xa28
	bool bIsReadOnly; // 0xcc8
	bool AllowContextMenu; // 0xcc9
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xcca
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xccb
	USlateWidgetStyleAsset* Style; // 0xcd0
	FSlateFontInfo Font; // 0xcd8
	FLinearColor ForegroundColor; // 0xd38
	FLinearColor BackgroundColor; // 0xd48
	FLinearColor ReadOnlyForegroundColor; // 0xd58
	FMulticastInlineDelegate OnTextChanged; // 0xd68
	FMulticastInlineDelegate OnTextCommitted; // 0xd78
};

struct UParticleModuleSize_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USlateVectorArtData {
	TArray<FSlateMeshVertex> VertexData; // 0x30
	TArray<uint32_t> IndexData; // 0x40
	UMaterialInterface* Material; // 0x50
	FVector2D ExtentMin; // 0x58
	FVector2D ExtentMax; // 0x60
};

struct UGameplayAction_Snitch {
	float GatherRadius; // 0x2e8
	float GatherRadiusGrowthAmount; // 0x2ec
	float MaxGatherRadius; // 0x2f0
	TArray<UGameplayEffect*> AlertToEnemyEffects; // 0x2f8
	float SnitchDuration; // 0x308
	FGameplayTagQuery GatherBlockingTags; // 0x318
	AAISmartActor* GatherToSmartActorClass; // 0x360
	FGameplayTag SnitchedAndFinishedTag; // 0x378
};

struct UHeroMovementComponent {
	FHarpoonData Harpoon; // 0xe8c
	AActor* NextHarpoonSource; // 0xec0
	FMovementForceData MovementForceData; // 0xed0
	FMovementForceData PendingMovementForceData; // 0xf10
	FMoveToTargetData MoveToTargetData; // 0xf50
	FMovementSpeedConfig MovementSpeedConfig; // 0x1510
	float MaxIncapSpeed; // 0x15f8
	UInventoryComponent* Inventory; // 0x1600
	AHeroCharacter* OwningHero; // 0x1608
	FGameplayTagQuery BlockingKnockbackTags; // 0x1610
	FMovementForcePhysConfig KnockbackPhysConfig; // 0x1658
	FMovementForcePhysConfig MeleeMovementForcePhysConfig; // 0x1664
	float AlertRadiusCrouch; // 0x167c
	float AlertRadiusWalk; // 0x1680
	float AlertRadiusSprint; // 0x1684
	float AlertLoudnessCrouch; // 0x1688
	float AlertLoudnessWalk; // 0x168c
	float AlertLoudnessSprint; // 0x1690
	float MinTimeBetweenCrouchInputToggle; // 0x1694
	float DelayBetweenAlerts; // 0x16a8
	float DefaultPrimaryInputThreshold; // 0x16ac
};

struct AAudioController {
	TArray<UAkAudioBank*> SharedBanks; // 0x2a0
	TArray<UAkAudioBank*> MapSpecificBanks; // 0x2b0
	UAkAudioBank* PVPBank; // 0x2c0
	UAkSimpleComponent* AkSimpleComp; // 0x2c8
	UAudioStateComponent* AudioStateMonitor; // 0x2d0
	UCardListenerComponent* ModListener; // 0x2d8
	UAkAudioEvent* DemoPausedSound; // 0x2e0
	UAkAudioEvent* DemoUnpausedSound; // 0x2e8
	FName MapMusicIdentifier; // 0x2f0
	FDataTableRowHandle SafeRoomMusicRow; // 0x2f8
	UAkAudioBank* AtmosphereBank; // 0x318
	UAkAudioEvent* AtmosphereStart; // 0x320
	UAkAudioEvent* AtmosphereStop; // 0x328
	UAkAudioEvent* RainEvent; // 0x330
	float StartingPresentationValue; // 0x338
};

struct UGameplayEffectLadderMovementModeComponent {
	FGamePropertyFloatMod AscendSpeedMod; // 0x240
	FGamePropertyFloatMod DescendSpeedMod; // 0x250
};

struct UAnimContext_ClosestCharacter {
	FGameplayTagQuery CharacterTags; // 0x150
	int32_t MinCloseCharacters; // 0x198
	float MaxCharacterDistance; // 0x19c
};

struct UInteractiveCar {
	float LootDoorUseTime; // 0xe8
	float DoorPartialOpenAlpha; // 0xec
	UCurveFloat* DoorOpenCurve; // 0xf0
	UCurveFloat* DoorCloseCurve; // 0xf8
	float CarDamageDialogueMaxRange; // 0x100
	float CarAlarmDialogueMaxRange; // 0x104
	bool bInvulnerable; // 0x108
	FGameplayTag OnFirePingableTag; // 0x10c
	FGameplayTag OnFireLifeStateTag; // 0x114
	FGameplayTag DestroyedLifeStateTag; // 0x11c
	FGameplayTagContainer CrushedDamageTypes; // 0x128
	UAkAudioEvent* Crushed; // 0x148
	float AlarmChance; // 0x150
	float AlarmDelay; // 0x154
	float AlarmDuration; // 0x158
	float AlarmDamageActivationRange; // 0x15c
	FGameplayTagContainer AlarmOmenTags; // 0x160
	UCurveFloat* AlarmVfxIdleCurve; // 0x180
	UCurveFloat* AlarmVfxActiveCurve; // 0x188
	float AlarmLightIntensityIdle; // 0x190
	float AlarmLightIntensityActive; // 0x194
	TArray<FInteractiveCarAlarmMaterialParams> AlarmMaterialParams; // 0x198
	UAkAudioEvent* AlarmLightClick; // 0x1a8
	TMap<UAkAudioEvent*, UAkAudioEvent*> AlarmLoops; // 0x1b0
	FGameplayTag HordeStartCue; // 0x200
	UMeshComponent* BodyMeshComponent; // 0x208
	UMeshComponent* DestroyedBodyMeshComponent; // 0x210
	UMeshComponent* GasCapMeshComponent; // 0x218
	UHealthComponent* HealthComponent; // 0x220
	UAkComponent* AudioComponent; // 0x228
	UAlertComponent* AlertComponent; // 0x230
	UPingableComponent* PingableComponent; // 0x238
	TArray<ULightComponent*> Lights; // 0x240
	TArray<EInteractiveCarDoorState> DoorStates; // 0x250
	TArray<EInteractiveCarWindowState> WindowStates; // 0x270
	UAkAudioEvent* AlarmLoop; // 0x330
	UAkAudioEvent* AlarmLoopStop; // 0x338
	bool bHasAlarm; // 0x340
	bool bAlarmUsed; // 0x341
};

struct UItemObservableComponent {
	FItemObservableToolTipOverride TooltipOverride; // 0x550
	int32_t SimpleCollisionFlags; // 0x5b0
	FVector BoxExtents; // 0x5b4
	TArray<FItemObservableState> ObservableStates; // 0x5c0
};

struct UStumbleComponent {
	bool bPlayerControlledOnly; // 0xe8
	FStumbleConfig StumbleConfig; // 0xf0
};

struct UInterpTrackFloatParticleParam {
	FName ParamName; // 0x98
};

struct ACableActor {
	UCableComponent* CableComponent; // 0x2a0
};

struct USoundfieldEndpointSubmix {
	FName SoundfieldEndpointType; // 0x40
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x48
	USoundfieldEndpointSettingsBase* EndpointSettings; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x58
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x60
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x68
};

struct USoundClass {
	FSoundClassProperties Properties; // 0x30
	TArray<USoundClass*> ChildClasses; // 0x88
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0x98
	FSoundModulation Modulation; // 0xa8
	USoundClass* ParentClass; // 0xb8
};

struct UTextureRenderTargetCube {
	int32_t SizeX; // 0xc8
	FLinearColor ClearColor; // 0xcc
	EPixelFormat OverrideFormat; // 0xdc
	char bHDR : 1; // 0xdd
	char bForceLinearGamma : 1; // 0xdd
};

struct UAnimNotify_AOEEmitter {
	FGameplayTag AOEEmitterTag; // 0x40
};

struct UNiagaraDataInterfaceChaosDestruction {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x38
	EDataSourceTypeEnum DataSourceType; // 0x88
	int32_t DataProcessFrequency; // 0x8c
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90
	bool DoSpawn; // 0x94
	FVector2D SpawnMultiplierMinMax; // 0x98
	float SpawnChance; // 0xa0
	FVector2D ImpulseToSpawnMinMax; // 0xa4
	FVector2D SpeedToSpawnMinMax; // 0xac
	FVector2D MassToSpawnMinMax; // 0xb4
	FVector2D ExtentMinToSpawnMinMax; // 0xbc
	FVector2D ExtentMaxToSpawnMinMax; // 0xc4
	FVector2D VolumeToSpawnMinMax; // 0xcc
	FVector2D SolverTimeToSpawnMinMax; // 0xd4
	int32_t SurfaceTypeToSpawn; // 0xdc
	ELocationFilteringModeEnum LocationFilteringMode; // 0xe0
	ELocationXToSpawnEnum LocationXToSpawn; // 0xe1
	FVector2D LocationXToSpawnMinMax; // 0xe4
	ELocationYToSpawnEnum LocationYToSpawn; // 0xec
	FVector2D LocationYToSpawnMinMax; // 0xf0
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf8
	FVector2D LocationZToSpawnMinMax; // 0xfc
	EDataSortTypeEnum DataSortingType; // 0x104
	bool bGetExternalCollisionData; // 0x105
	bool DoSpatialHash; // 0x106
	FVector SpatialHashVolumeMin; // 0x108
	FVector SpatialHashVolumeMax; // 0x114
	FVector SpatialHashVolumeCellSize; // 0x120
	int32_t MaxDataPerCell; // 0x12c
	bool bApplyMaterialsFilter; // 0x130
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138
	bool bGetExternalBreakingData; // 0x188
	bool bGetExternalTrailingData; // 0x189
	FVector2D RandomPositionMagnitudeMinMax; // 0x18c
	float InheritedVelocityMultiplier; // 0x194
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198
	FVector2D RandomVelocityMagnitudeMinMax; // 0x19c
	float SpreadAngleMax; // 0x1a4
	FVector VelocityOffsetMin; // 0x1a8
	FVector VelocityOffsetMax; // 0x1b4
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0
	float MaxLatency; // 0x1c8
	EDebugTypeEnum DebugType; // 0x1cc
	int32_t LastSpawnedPointID; // 0x1d0
	float LastSpawnTime; // 0x1d4
	float SolverTime; // 0x1e8
	float TimeStampOfLastProcessedData; // 0x1ec
};

struct UScaleBox {
	EStretch Stretch; // 0x160
	EStretchDirection StretchDirection; // 0x161
	float UserSpecifiedScale; // 0x164
	bool IgnoreInheritedScale; // 0x168
};

struct UAnimEvalSet_FPMantle_C {
	FGameplayEval_MantleHeight MantleHeight; // 0xc0
};

struct USoundNodeBranch {
	FName BoolParameterName; // 0x60
};

struct UParticleModuleRotation {
	FRawDistributionFloat StartRotation; // 0x38
};

struct UPhysicalMaterialMask {
	int32_t UVChannelIndex; // 0x30
	TextureAddress AddressX; // 0x34
	TextureAddress AddressY; // 0x35
};

struct AChallengeGameState {
	UChallengeMonitorComponent* ChallengeMonitorComponent; // 0x6a8
};

struct UMantleComponent {
	FMulticastInlineDelegate OnMantleStateChanged; // 0x130
	FMantleMontageConfig Config; // 0x270
	bool bActivateOnJump; // 0x348
	bool bActivateOnMovement; // 0x349
	bool bActivateOnMovementWhileFalling; // 0x34a
	float ActivationFallSpeedMin; // 0x34c
	float ActivationFallSpeedMax; // 0x350
	FGameplayTagContainer BlockingTags; // 0x358
	float MinDetectionHeight; // 0x378
	float MaxDetectionHeight; // 0x37c
	float MaxHorizontalDistance; // 0x380
	float MaxLedgeExtrusion; // 0x384
	float OpeningTestStepHeight; // 0x388
	float LandDistance; // 0x38c
	float RestrictSurfaceInclineWhenHeightBelow; // 0x390
	float SurfaceInclineRestriction; // 0x394
	float RelaxedSurfaceInclineRestriction; // 0x398
	bool bCalculateMantleDepth; // 0x39c
	float MaxDepthCalculationSize; // 0x3a0
	float GroundCheckDistance; // 0x3a4
	float MinMantleHeightFromGround; // 0x3a8
	float WallHitRequiredAngle; // 0x3ac
	bool bUseMovementDirectionForWallDetection; // 0x3b0
	bool bUseWallNormalAsMantleDirection; // 0x3b1
	FMantleProceduralClimbParameters DefaultClimbParameters; // 0x3b4
	bool bMoveToWall; // 0x3c0
	float MoveToWallTime; // 0x3c4
	float ClimbTimeout; // 0x3c8
	bool bAutoCrouch; // 0x3cc
	float SnapToWallYawRotationOnHeightAbove; // 0x3d0
	TArray<FMantleClimbHeightConfig> ClimbParametersHeightOverrides; // 0x3d8
	UMontageSet* MontageSet; // 0x3e8
	UMontageSet* LeapMontageSet; // 0x3f0
	FGameplayTagContainer ItemSwappingTags; // 0x3f8
	float MaxMoveSpeedOnMontageEnd; // 0x418
	bool bClearZVelocityOnMontageEnd; // 0x41c
};

struct UNiagaraDataInterfaceCurlNoise {
	uint32_t Seed; // 0x38
};

struct UEnvQueryGenerator_AISpawners {
	UEnvQueryContext* SearchCenter; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x60
	FAIDataProviderGameplayTagQueryContainerValue TagQuery; // 0x98
	FAIDataProviderGameplayTagQueryContainerValue SecondaryTagQuery; // 0x110
};

struct UParticleModuleBeamTarget {
	Beam2SourceTargetMethod TargetMethod; // 0x38
	FName TargetName; // 0x3c
	FRawDistributionVector Target; // 0x48
	char bTargetAbsolute : 1; // 0x90
	char bLockTarget : 1; // 0x90
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x94
	FRawDistributionVector TargetTangent; // 0x98
	char bLockTargetTangent : 1; // 0xe0
	FRawDistributionFloat TargetStrength; // 0xe8
	char bLockTargetStength : 1; // 0x118
	float LockRadius; // 0x11c
};

struct USteamNetConnection {
	bool bIsPassthrough; // 0x1ad8
};

struct UParticleSystemComponent {
	UParticleSystem* Template; // 0x4b0
	TArray<UMaterialInterface*> EmitterMaterials; // 0x4b8
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x4c8
	char bResetOnDetach : 1; // 0x4d9
	char bUpdateOnDedicatedServer : 1; // 0x4d9
	char bAllowRecycling : 1; // 0x4d9
	char bAutoManageAttachment : 1; // 0x4d9
	char bAutoAttachWeldSimulatedBodies : 1; // 0x4d9
	char bWarmingUp : 1; // 0x4da
	char bOverrideLODMethod : 1; // 0x4da
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x4da
	ParticleSystemLODMethod LODMethod; // 0x4e5
	EParticleSignificanceLevel RequiredSignificance; // 0x4e6
	TArray<FParticleSysParam> InstanceParameters; // 0x4e8
	FMulticastInlineDelegate OnParticleSpawn; // 0x4f8
	FMulticastInlineDelegate OnParticleBurst; // 0x508
	FMulticastInlineDelegate OnParticleDeath; // 0x518
	FMulticastInlineDelegate OnParticleCollide; // 0x528
	bool bOldPositionValid; // 0x550
	FVector OldPosition; // 0x554
	FVector PartSysVelocity; // 0x560
	float WarmupTime; // 0x56c
	float WarmupTickRate; // 0x570
	float SecondsBeforeInactive; // 0x578
	float MaxTimeBeforeForceUpdateTransform; // 0x580
	TArray<UParticleSystemReplay*> ReplayClips; // 0x5a0
	float CustomTimeDilation; // 0x5b8
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x610
	FName AutoAttachSocketName; // 0x618
	EAttachmentRule AutoAttachLocationRule; // 0x620
	EAttachmentRule AutoAttachRotationRule; // 0x621
	EAttachmentRule AutoAttachScaleRule; // 0x622
	FMulticastInlineDelegate OnSystemFinished; // 0x650
};

struct UInterpTrackAkAudioRTPC {
	FString Param; // 0x98
	char bPlayOnReverse : 1; // 0xa8
	char bContinueRTPCOnMatineeEnd : 1; // 0xa8
};

struct UProjectileThrowComponent {
	FMulticastInlineDelegate OnThrowEnded; // 0x1e0
	FProjectileThrowTickData MoveTickData; // 0x1f0
	bool bUsesTuningDataTable; // 0x218
	FName TuningDataIdentifier; // 0x21c
	FProjectileThrowTuning ProjectileThrowTuning; // 0x228
	FProjectileThrowConfig ThrowConfig; // 0x2a8
	uint16_t ReplicatedSpawnProjectileCount; // 0x5f8
	FReplicatedThrowInfo ReplicatedThrow; // 0x5fc
	AActor* ThrowTarget; // 0x618
};

struct UAnimEvalSet_ItemStance_C {
	FGameplayEval_SelectedItemAnimationStance ItemStance; // 0xc0
};

struct UBoxComponent {
	FVector BoxExtent; // 0x4c8
	float LineThickness; // 0x4d4
};

struct UMutilationHitReactionConfig {
	TArray<UMutilationHitReactionSet*> HitReactionSets; // 0x38
};

struct ULightComponent {
	float Temperature; // 0x260
	float MaxDrawDistance; // 0x264
	float MaxDistanceFadeRange; // 0x268
	char bUseTemperature : 1; // 0x26c
	int32_t ShadowMapChannel; // 0x270
	float MinRoughness; // 0x278
	float SpecularScale; // 0x27c
	float ShadowResolutionScale; // 0x280
	float ShadowBias; // 0x284
	float ShadowSlopeBias; // 0x288
	float ShadowSharpen; // 0x28c
	float ContactShadowLength; // 0x290
	char ContactShadowLengthInWS : 1; // 0x294
	float MoirePatternAdjustment; // 0x298
	int32_t ContactShadowStepCount; // 0x29c
	int32_t ContactShadowDitherSwitch; // 0x2a0
	float ContactShadowDitherAdjustment; // 0x2a4
	int32_t ContactShadowDitherFrameMod; // 0x2a8
	int32_t ContactShadowDistanceCurveMode; // 0x2ac
	char InverseSquaredFalloff : 1; // 0x2b0
	char CastTranslucentShadows : 1; // 0x2b0
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x2b0
	char bAffectDynamicIndirectLighting : 1; // 0x2b0
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x2b0
	char bAllowLightingSubsystemControl : 1; // 0x2b0
	FLightingChannels LightingChannels; // 0x2b4
	FShadowChannels ShadowChannels; // 0x2b5
	float ShadowOpacity; // 0x2b8
	UMaterialInterface* LightFunctionMaterial; // 0x2c0
	FVector LightFunctionScale; // 0x2c8
	UTextureLightProfile* IESTexture; // 0x2d8
	char bUseIESBrightness : 1; // 0x2e0
	float IESBrightnessScale; // 0x2e4
	float LightFunctionFadeDistance; // 0x2e8
	float DisabledBrightness; // 0x2ec
	char bEnableLightShaftBloom : 1; // 0x2f0
	float BloomScale; // 0x2f4
	float BloomThreshold; // 0x2f8
	float BloomMaxBrightness; // 0x2fc
	FColor BloomTint; // 0x300
	bool bUseRayTracedDistanceFieldShadows; // 0x304
	float RayStartOffsetDepthScale; // 0x308
	float Hardness; // 0x30c
	char bOwnerNoSee : 1; // 0x310
	char bOnlyOwnerSee : 1; // 0x310
	bool bCanBeVisCulled; // 0x311
};

struct UMaterialExpressionOneMinus {
	FExpressionInput Input; // 0x48
};

struct UMovieSceneParameterSection {
	TArray<FBoolParameterNameAndCurve> BoolParameterNamesAndCurves; // 0xe8
	TArray<FScalarParameterNameAndCurve> ScalarParameterNamesAndCurves; // 0xf8
	TArray<FVector2DParameterNameAndCurves> Vector2DParameterNamesAndCurves; // 0x108
	TArray<FVectorParameterNameAndCurves> VectorParameterNamesAndCurves; // 0x118
	TArray<FColorParameterNameAndCurves> ColorParameterNamesAndCurves; // 0x128
	TArray<FTransformParameterNameAndCurves> TransformParameterNamesAndCurves; // 0x138
};

struct UInteractiveToolManager {
	UInteractiveTool* ActiveLeftTool; // 0x38
	UInteractiveTool* ActiveRightTool; // 0x40
	TMap<FString, UInteractiveToolBuilder*> ToolBuilders; // 0x98
};

struct UGeometryCacheCodecRaw {
	int32_t DummyProperty; // 0x40
};

struct UAnimNotify_SetLeapDestination {
	UAnimContext_LeapComponent* Leap; // 0x40
	UAnimContext_Transform* Destination; // 0x48
};

struct USoundCue {
	char bPrimeOnLoad : 1; // 0x168
	USoundNode* FirstNode; // 0x170
	float VolumeMultiplier; // 0x178
	float PitchMultiplier; // 0x17c
	FSoundAttenuationSettings AttenuationOverrides; // 0x180
	float SubtitlePriority; // 0x520
	char bOverrideAttenuation : 1; // 0x528
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x528
	int32_t CookedQualityIndex; // 0x52c
	char bHasPlayWhenSilent : 1; // 0x530
};

struct UGameplayCue_BulletImpact {
	UImpactEffectConfig* ImpactTable; // 0x30
	bool bThirdPersonOnly; // 0x38
	bool bGetCharacterMeshImpactResultFromHitResult; // 0x39
	bool bOverrideImpactDirectionWithInstigatorForward; // 0x3a
};

struct ARoomVolume {
	uint32_t Type; // 0x2d8
};

struct UMovieSceneEventSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct UParticleSystemReplay {
	int32_t ClipIDNumber; // 0x30
};

struct UInputKeySelector {
	FButtonStyle WidgetStyle; // 0x148
	FTextBlockStyle TextStyle; // 0x3e0
	FInputChord SelectedKey; // 0x680
	FSlateFontInfo Font; // 0x6a0
	FMargin Margin; // 0x700
	FLinearColor ColorAndOpacity; // 0x710
	FText KeySelectionText; // 0x720
	FText NoKeySpecifiedText; // 0x738
	bool bAllowModifierKeys; // 0x750
	bool bAllowGamepadKeys; // 0x751
	TArray<FKey> EscapeKeys; // 0x758
	FMulticastInlineDelegate OnKeySelected; // 0x768
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x778
};

struct UEnvQueryContext_PerceivedActors {
	FAISenseAffiliationFilter Affiliation; // 0x30
	FGameplayTagQuery TagQueryToMatch; // 0x38
};

struct UPlatformCalloutImageUserWidget {
	UTexture2D* PCTextureOverride; // 0x458
};

struct UAnimComposite {
	FAnimTrack AnimationTrack; // 0xc0
};

struct AAkAcousticPortal {
	AkAcousticPortalState InitialState; // 0x348
	float ObstructionRefreshInterval; // 0x34c
	ECollisionChannel ObstructionCollisionChannel; // 0x350
};

struct UOptionDefaultsDeveloperSettings {
	float VoiceVolume; // 0x40
	float MicBoost; // 0x44
	float MicThreshold; // 0x48
	bool bVOIPSideChainEnabled; // 0x4c
	bool bSuppressAudioOnFocusLost; // 0x4d
	FName MixProfileName; // 0x50
	bool bStaminaBreathEnabled; // 0x58
	TSoftObjectPtr<UDataTable> GPUSettingsTable; // 0x60
};

struct UAnimSingleNodeInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UClipReloadComponent {
	FReplicatedReloadData ReplicatedReloadData; // 0x258
	float ReloadLength; // 0x260
	float ReloadAnimationLength; // 0x264
	float ReloadAddTime; // 0x268
	bool bAutoReloadWhenEmpty; // 0x26c
	UAnimMontage* ReloadMontageFP; // 0x270
	UAnimMontage* ReloadMontage3P; // 0x278
	FGameplayTag AppliedTag; // 0x280
	FGameplayTagContainer BlockingTags; // 0x288
	FGameplayTagContainer InterruptingTags; // 0x2a8
	FGameplayTagContainer CancellingTags; // 0x2c8
	UAkAudioEvent* BackgroundReloadAKE; // 0x2e8
};

struct UParticleModuleOrientationAxisLock {
	EParticleAxisLock LockAxisFlags; // 0x38
};

struct UPostRoundScreen {
	TArray<FPostRoundPanelInfo> PanelInfoArray; // 0x558
};

struct UGobiNavLinkComponent {
	FNavLinkGenerator NavGenerationData; // 0x4d0
	uint32_t CustomUserID; // 0x580
	TArray<FNavLinkOffset> RelativeLinkOffsets; // 0x588
	UNavArea* EnabledNavAreaClass; // 0x598
	UNavArea* BeginPlayNavAreaClass; // 0x5b8
	bool bEnableBeginPlayNavAreaClass; // 0x5c0
	float HighClimbDistance; // 0x5c4
	TArray<FVector> ContextLocations; // 0x5c8
	TArray<float> ContextDistances; // 0x5d8
	float ErrorTolerance; // 0x5e8
};

struct UMaterialExpressionNoise {
	FExpressionInput Position; // 0x48
	FExpressionInput FilterWidth; // 0x5c
	float Scale; // 0x70
	int32_t Quality; // 0x74
	ENoiseFunction NoiseFunction; // 0x78
	char bTurbulence : 1; // 0x7c
	int32_t Levels; // 0x80
	float OutputMin; // 0x84
	float OutputMax; // 0x88
	float LevelScale; // 0x8c
	char bTiling : 1; // 0x90
	uint32_t RepeatSize; // 0x94
};

struct UCardFan {
	FMulticastInlineDelegate OnShowExpandedCard; // 0x160
	FMulticastInlineDelegate OnUserScrolled; // 0x170
	UUserWidget* CardWidgetClass; // 0x180
	FScrollBarStyle ScrollBarStyle; // 0x188
	ESlateVisibility ScrollBarVisibility; // 0x6a0
	EConsumeMouseWheel ConsumeMouseWheel; // 0x6a1
	FVector2D ScrollbarThickness; // 0x6a4
	FMargin ScrollbarPadding; // 0x6ac
	bool bAlwaysShowScrollbar; // 0x6bc
	bool bAlwaysShowScrollbarTrack; // 0x6bd
	bool bScrollBarHasSizeWhenNotInUse; // 0x6be
	bool bAllowOverscroll; // 0x6bf
	bool bAnimateWheelScrolling; // 0x6c0
	bool bHandleNavigation; // 0x6c1
	EDescendantScrollDestination NavigationDestination; // 0x6c2
	float NavigationScrollPadding; // 0x6c4
	FKey ClickDragKey; // 0x6c8
	bool bAllowClickDragScrolling; // 0x6e0
	float WheelScrollMultiplier; // 0x6e4
	float ScrollAnimationSpeed; // 0x6e8
	float MinChildSize; // 0x6ec
	float ChildSpacing; // 0x6f0
	UUserWidget* ExpandedCardWidget; // 0x708
};

struct UGPEvalSet_FilterNavLink {
	TArray<UNavArea*> AllowedNavAreas; // 0x78
	FGameplayEval_Distance MaxStartRangeEval; // 0x88
	FGameplayEval_NavArea AllowedNavAreaEval; // 0x158
};

struct USoundGroups {
	TArray<FSoundGroup> SoundGroupProfiles; // 0x30
};

struct UPawnActionsComponent {
	APawn* ControlledPawn; // 0xe8
	TArray<FPawnActionStack> ActionStacks; // 0xf0
	TArray<FPawnActionEvent> ActionEvents; // 0x100
	UPawnAction* CurrentAction; // 0x110
};

struct UMaterialExpressionRotateAboutAxis {
	FExpressionInput NormalizedRotationAxis; // 0x48
	FExpressionInput RotationAngle; // 0x5c
	FExpressionInput PivotPoint; // 0x70
	FExpressionInput Position; // 0x84
	float Period; // 0x98
};

struct UNiagaraDataInterfaceGrid2D {
	int32_t NumCellsX; // 0xd8
	int32_t NumCellsY; // 0xdc
	int32_t NumCellsMaxAxis; // 0xe0
	int32_t NumAttributes; // 0xe4
	bool SetGridFromMaxAxis; // 0xe8
	FVector2D WorldBBoxSize; // 0xec
};

struct UGameDirectorSeamlessTravelData {
	float TimeSinceLastHorde; // 0x30
};

struct AGobiSplineMeshActor {
	USplineComponent* EditableSpline; // 0x2a0
	TArray<USplineMeshComponent*> GeneratedSubObjects; // 0x2a8
	TArray<UTextRenderComponent*> PointNumbers; // 0x2b8
	bool bFinalized; // 0x2c8
	bool bUseCollisionProfile; // 0x2c9
	FName CollisionProfile; // 0x2cc
	ECollisionChannel CollisionChannelToUse; // 0x2d4
	ECollisionEnabled CollisionEnabled; // 0x2d5
	ESplineMeshMode SplineMeshMode; // 0x2d6
	ESplineMeshAxis ForwardAxis; // 0x2d7
	float Padding; // 0x2d8
	UStaticMesh* Mesh; // 0x2e0
	bool bCastShadows; // 0x2e8
	int8_t ForceLOD; // 0x2e9
	bool bLockCurrentMeshArray; // 0x2ea
	bool bContiguous; // 0x2eb
	TArray<FSplineMeshElement> AvailableMeshes; // 0x2f0
	bool bSequential; // 0x300
	bool bPreventAdjancency; // 0x301
	FVector GlobalScale; // 0x304
	FVector CachedGlobalScale; // 0x310
	TArray<FPerInstanceData> PerInstanceData; // 0x320
	TArray<FVector> PerInstanceRotation; // 0x330
	bool bUseCapMeshes; // 0x340
	FCapData CapMeshes; // 0x348
	bool bDrawOnlySpline; // 0x368
	bool bShowDebugMaterials; // 0x369
	TArray<UMaterialInterface*> DebugMaterials; // 0x370
	bool bDrawDebugNumbers; // 0x380
	FDebugNumbersPrefs DebugNumbersPrefs; // 0x384
	TArray<FSplineMeshElement> MeshesToUse; // 0x390
	TArray<float> Distances; // 0x3a0
	TArray<UMaterialInterface*> DebugMaterialsToUse; // 0x3b0
	TArray<FSplineMeshElement> MeshesCache; // 0x3c0
};

struct UBTService_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UDamageStatTracker {
	FMulticastInlineDelegate OnIncrementKillStat; // 0x40
	FGameplayTagQuery SnitcherTagsQuery; // 0x50
	AGobiCharacter* CurrentCharacter; // 0x98
};

struct UAkAudioBank {
	bool IsDialogueBank; // 0x30
	bool IsCacheManaged; // 0x31
	TArray<FString> MemberEvents; // 0x38
};

struct UGameplayEffectRecoilComponent {
	FGamePropertyFloatMod RecoilYawScaleMod; // 0x250
	FGamePropertyFloatMod RecoilPitchScaleMod; // 0x260
	FGamePropertyFloatMod RecoilMinRequiredYawScaleMod; // 0x270
	FGamePropertyFloatMod RecoilMinRequiredPitchScaleMod; // 0x280
	FGamePropertyFloatMod GunKickYawScaleMod; // 0x290
	FGamePropertyFloatMod GunKickPitchScaleMod; // 0x2a0
	FGamePropertyFloatMod GunKickRollScaleMod; // 0x2b0
	FGamePropertyFloatMod GunKickMaxAngleScaleMod; // 0x2c0
	FGamePropertyFloatMod PushbackInitialOffsetScaleMod; // 0x2d0
	FGamePropertyFloatMod PushbackStabilizedOffsetScaleMod; // 0x2e0
};

struct UZombieMeshConfigMod {
	FSkeletalMeshConfigMod MeshConfigMod; // 0xd0
};

struct UMaterialExpressionLandscapeLayerSwitch {
	FExpressionInput LayerUsed; // 0x48
	FExpressionInput LayerNotUsed; // 0x5c
	FName ParameterName; // 0x70
	char PreviewUsed : 1; // 0x78
	FGuid ExpressionGUID; // 0x7c
};

struct UShadowMapTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0xf0
};

struct UDocHealOtherLesson_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4e8
};

struct USourceEffectChorusPreset {
	FSourceEffectChorusSettings Settings; // 0x88
};

struct ULogoutCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UChargeComponent {
	FMulticastInlineDelegate OnChargeEnded; // 0x1e0
	FMulticastInlineDelegate OnChargeBreakPressed; // 0x1f0
	int32_t ChargePushingCount; // 0x200
	FHitResult StumbleImpact; // 0x334
	FChargeMoveTickData MoveTickData; // 0x3bc
	UAnimMontage* CurrentActiveMontage; // 0x3e0
	UGameplayEvaluatorSet* FilterSet; // 0x3e8
	TArray<UAnimMontage*> AccelerateMontages; // 0x3f0
	TArray<UAnimMontage*> DecelerateMontages; // 0x400
	TArray<UAnimMontage*> CharacterImpactMontages; // 0x410
	TArray<UAnimMontage*> ImpactStumbleMontages; // 0x420
	TArray<FName> DisableMovementInputScalars; // 0x430
	bool bStumbleOnWorldImpacts; // 0x440
	bool bDeflectOnWorldImpacts; // 0x441
	bool bPlayerCancelsChargeWhenFalling; // 0x442
	float MinTimeBeforeChargeButtonCancels; // 0x444
	bool bUsesBreakButton; // 0x448
	float MinTimeBeforeBackButtonCancels; // 0x44c
	float BreakDeceleration; // 0x450
	bool bAIStopAtCliffs; // 0x454
	bool bAICancelsChargeWhenFalling; // 0x455
	UImpactEffectConfig* StumbleImpactTable; // 0x458
	FGameplayTagContainer AppliedTags; // 0x460
	FGameplayTagContainer RampUpTags; // 0x480
	FGameplayTagContainer DeceleratingTags; // 0x4a0
	FGameplayTagQuery CancelTags; // 0x4c0
	FGameplayTagQuery AccelerateMontageTagQuery; // 0x508
	FGameplayTagQuery BlockingTags; // 0x550
	FGameplayTagQuery BlockingTargetTags; // 0x598
	FGameplayTagQuery InterruptChargeCharacterTags; // 0x5e0
	FGameplayTag ChargeCollisionTag; // 0x628
	FGameplayTagQuery BlockingChargeImpactMontageTags; // 0x630
	TArray<UGameplayEffect*> ChargingEffects; // 0x678
	TArray<UGameplayEffect*> ChargeCollisionEffects; // 0x688
	TArray<UGameplayEffect*> ImpactStumbleEffects; // 0x698
	TArray<FEnemyAudioEvent> AudioStartEvents; // 0x6a8
	TArray<FEnemyAudioEvent> AudioStopEvents; // 0x6b8
	float ChargePushMinTime; // 0x6c8
	float MaxChargePathAngle; // 0x6cc
	float MaxNavLinkClimbHeight; // 0x6d4
	float TraceAheadDistance; // 0x6d8
	float TraceAheadNavMeshDistance; // 0x6dc
	FGameplayTag ImpactExplosionComponentTag; // 0x6e0
	FChargeTuning ChargeTuning; // 0x6e8
};

struct UAnimContext_DamageSource {
	UAnimContext_DamageInfo* DamageInfo; // 0x70
};

struct UAudioStateComponent {
	FMulticastInlineDelegate OnUIActivated; // 0xe8
	FMulticastInlineDelegate OnIncapStateChanged; // 0xf8
	FMulticastInlineDelegate OnResetMission; // 0x108
	FMulticastInlineDelegate OnMissionSuccess; // 0x118
	FMulticastInlineDelegate OnCampaignEnded; // 0x128
	FMulticastInlineDelegate OnLoadingNextMission; // 0x138
	UAkAudioEvent* AKERiddenSaferoomOpen; // 0x148
	bool bIsFullscreen; // 0x150
	bool bIsMoviePlaying; // 0x151
	bool bIsInGameCinematicPlaying; // 0x152
	bool bIsLoadingIntoNextMission; // 0x153
};

struct UBTService_ChaserRunEQS {
	FBlackboardKeySelector WallClingBlackboardKey; // 0x190
};

struct UEditableGameplayTagQueryExpression_AllExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x30
};

struct UMeleeGameCoachLesson {
	UGameplayContext_NearbyCharacters* NearbyCharactersContext; // 0x460
};

struct AVendorNPC {
	bool bDisableNags; // 0x2a0
	float DelayForAttract; // 0x2a4
	FVector2D DialogueAmbientRate; // 0x2a8
	FVector2D DialogueNagRate; // 0x2b0
	bool bIsSaferoomVendor; // 0x2b8
	bool bEndingSaferoom; // 0x2b9
	float FocusTrackingUpdateRate; // 0x2bc
	USceneComponent* DefaultRootComponent; // 0x2c0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x2c8
	UAkSkeletalComponent* AudioEmitterComponent; // 0x2d0
	UGobiDialogueComponent* DialogueComponent; // 0x2d8
	ULiteCharacterAudioComponent* AudioComponent; // 0x2e0
	UFacialAnimationComponent* FacialAnimationComponent; // 0x2e8
	FDataTableRowHandle VoiceRowHandle; // 0x2f0
	UBoxComponent* NagBoxComponent; // 0x310
	EVendorAnimBehaviorState State; // 0x338
};

struct UNiagaraDataInterfaceNeighborGrid3D {
	uint32_t MaxNeighborsPerVoxel; // 0xf8
};

struct UPlayDeathReactionComponent {
	TArray<UMontageSet*> MontageSets; // 0xe8
	FGameplayTag DieToRagdollTag; // 0xf8
	UAnimMontage* ReplicatedDeathReactionMontage; // 0x140
};

struct UARGetCandidateObjectAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x58
	FMulticastInlineDelegate OnFailed; // 0x68
};

struct UGizmoAxisScaleParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x50
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x60
	float ScaleMultiplier; // 0x70
	float Parameter; // 0x74
	FGizmoFloatParameterChange LastChange; // 0x78
	FVector CurScaleAxis; // 0x80
	FVector CurScaleOrigin; // 0x8c
	FTransform InitialTransform; // 0xa0
};

struct UDistributionFloatUniformCurve {
	FInterpCurveVector2D ConstantCurve; // 0x40
};

struct UDemoNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x858
	float CheckpointSaveMaxMSPerFrame; // 0xc6c
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xca0
	bool bIsLocalReplay; // 0xd00
	TArray<APlayerController*> SpectatorControllers; // 0xd08
};

struct UNestBoilComponent {
	UAkAudioEvent* DamageSound; // 0x180
};

struct UMaterialExpressionConstant {
	float R; // 0x48
};

struct UAnimEvaluator_HitBone {
	FName HitBoneBelow; // 0x50
	UAnimContext_HitResult* Hit; // 0x58
};

struct UGameplayEffectDamageFilter {
	UDamageFilter* OutgoingDamageFilter; // 0x248
	UDamageFilter* IncomingDamageFilter; // 0x250
	FGamePropertyFloatMod WeakSpotDamageMultiplierMod; // 0x258
	FGamePropertyFloatMod OutgoingFriendlyFireScaleMod; // 0x268
};

struct UBorder {
	EHorizontalAlignment HorizontalAlignment; // 0x160
	EVerticalAlignment VerticalAlignment; // 0x161
	FSlateColor ContentColorAndOpacity; // 0x168
	FDelegate ContentColorAndOpacityDelegate; // 0x198
	FMargin Padding; // 0x1a8
	FSlateBrush Background; // 0x1b8
	FDelegate BackgroundDelegate; // 0x248
	FSlateColor BrushColor; // 0x258
	FDelegate BrushColorDelegate; // 0x288
	FVector2D DesiredSizeScale; // 0x298
	bool bFlipForRightToLeftFlowDirection; // 0x2a0
	FDelegate OnMouseButtonDownEvent; // 0x2a4
	FDelegate OnMouseButtonUpEvent; // 0x2b4
	FDelegate OnMouseMoveEvent; // 0x2c4
	FDelegate OnMouseDoubleClickEvent; // 0x2d4
};

struct UHeroLOSVolumeComponent {
	TArray<FVector> LOSVolumeExtents; // 0x4b0
	TArray<FVector> LOSTestPositions; // 0x4c0
};

struct UUniformInteger {
	int32_t Magnitude; // 0xe8
};

struct UMovieSceneLevelVisibilityTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct ULifeStateFakeDead {
	FName AutoRagdollFromBoneName; // 0xa8
	FName DeadCapsuleCollisionProfile; // 0xb0
	TArray<FGameplayTag> TurnOffCollisionOnComponents; // 0xb8
	float HealthResetPct; // 0xc8
	bool bShouldRagdoll; // 0xcc
	int32_t MaxFakeDeathCount; // 0xd0
	bool bOnFinalDeathBecomeInvulnerable; // 0xd4
	FGameplayTagContainer RemovedTags; // 0xd8
	FGameplayTagContainer FinalDeathAppliedTags; // 0xf8
};

struct UAnimNotifyState_SetTags {
	FGameplayTagContainer Tags; // 0x38
	bool bApplyToAnimatingActor; // 0x58
	UAnimContext_Actor* Actor; // 0x60
	UAnimContext_GameplayTags* ActorTags; // 0x68
};

struct UNavRedirectorComponent {
	UGobiNavLinkComponent* NavLink; // 0xe8
	UGobiNavModifierComponent* NavMod; // 0xf0
};

struct UGameplayAction {
	FGameplayTagContainer ActionTags; // 0x30
	FGameplayTagContainer CancelActionsWithTag; // 0x50
	FGameplayTagContainer BlockActionsWithTag; // 0x70
	FGameplayTagQuery BlockActionsThatMatch; // 0x90
	FGameplayTagQuery RunningActionTagRequirements; // 0xd8
	FGameplayTagContainer ActivationOwnedTags; // 0x120
	FGameplayTagQuery ActivatingActorTagRequirements; // 0x140
	UGameplayEffect* CooldownEffect; // 0x188
	UGameplayEffect* CooldownEffectOnSuccess; // 0x190
	UGameplayEffect* CooldownEffectOnFailed; // 0x198
	TArray<UGameplayEffect*> ActivationEffects; // 0x1a0
	char Priority; // 0x1b0
	bool bDisableSteeringBehavior; // 0x1b1
	USteeringBehavior* SteeringBehaviorOverride; // 0x1b8
	USteeringControl* SteeringControlOverride; // 0x1c0
	AActor* ActivatingActor; // 0x1e0
	AGobiCharacter* ActivatingCharacter; // 0x1e8
};

struct UFP_HeroLoco_Base_ABP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x370
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x398
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3c0
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x438
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x468
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x510
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x538
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x560
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x588
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x5b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x5d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x600
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x628
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x650
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x678
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x6a0
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x718
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x748
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7f0
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x868
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x898
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x910
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x940
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x968
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x9e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xa10
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa88
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xab8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xb68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb98
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc10
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xc40
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xcf0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xd20
	FWeaponAnimState WeaponAnimState; // 0xdd0
	FHeroAnimStateFP HeroAnimState; // 0xe14
	FWeaponAnimsFP FirstPersonAnimations; // 0xe40
	float MinWalkStartSpeed; // 0xe80
	FGobiAnimationState GobiAnimState; // 0xe84
	FLadderAnimStateFP LadderState; // 0xedc
};

struct AGobiPlayerController {
	UPlayerSpraysComponent* PlayerSprays; // 0x7f0
	UPlayerWaypointsComponent* PlayerWaypoints; // 0x7f8
	FMulticastInlineDelegate OnBeginPlayingState; // 0x810
	FMulticastInlineDelegate OnEndPlayingState; // 0x820
	FMulticastInlineDelegate OnBeginSpectatingState; // 0x830
	FMulticastInlineDelegate OnEndSpectatingState; // 0x840
	UScreenFXComponent* ScreenFXComponent; // 0x850
	FSyncedClientPlayerControllerCVars SyncedClientCVars; // 0x85c
	UTriggerEffectsHandler* TriggerEffectsHandler; // 0x870
	AActor* CheatBoomClass; // 0x878
	AActor* CheatMolotovClass; // 0x880
	UTriggerEffectsHandler* TriggerEffectsHandlerClass; // 0x888
};

struct UDamageFilterComponent {
	UDamageFilter* InitialOutgoingDamageFilterClass; // 0xe8
};

struct UAnimNotifyState_TitanStage3TailThrashModeDisable {
	ETitanStage3TailThrashMode ThrashMode; // 0x38
};

struct USignInTask {
	UGobiWebServices* GobiWebServices; // 0x50
	UGobiWBP1* GobiWBP1; // 0x58
	UGobiGameInstance* GameInstance; // 0x60
	TArray<FSignInTaskDependency> Dependencies; // 0x68
};

struct ABaseball_Bat_BP_C {
	UItemAnimationDataComponent* ItemAnimationData; // 0x4e0
	UTraceMeleeComponent* MeleeAttack; // 0x4e8
};

struct UBTService_Health {
	FBlackboardKeySelector HealthBBKey; // 0x78
	UEnum* HealthLabelEnum; // 0xa0
	TArray<FHealthRange> HealthRanges; // 0xa8
};

struct UFTUETutorialScreen {
	TSoftObjectPtr<UTexture2D> BGTexture; // 0x5d8
};

struct USynthSamplePlayer {
	USoundWave* SoundWave; // 0x710
	FMulticastInlineDelegate OnSampleLoaded; // 0x718
	FMulticastInlineDelegate OnSamplePlaybackProgress; // 0x728
};

struct UMovieScenePropertyTrack {
	UMovieSceneSection* SectionToKey; // 0x60
	FName PropertyName; // 0x68
	FString PropertyPath; // 0x70
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UMaterialExpressionArcsineFast {
	FExpressionInput Input; // 0x48
};

struct UListView {
	EOrientation Orientation; // 0x320
	ESelectionMode SelectionMode; // 0x321
	EConsumeMouseWheel ConsumeMouseWheel; // 0x322
	bool bClearSelectionOnClick; // 0x323
	bool bIsFocusable; // 0x324
	float EntrySpacing; // 0x328
	bool bReturnFocusToSelection; // 0x32c
	TArray<UObject*> ListItems; // 0x330
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x350
	FMulticastInlineDelegate BP_OnItemClicked; // 0x360
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x370
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x380
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x390
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x3a0
};

struct UTestMovieSceneTrack {
	bool bHighPassFilter; // 0x60
	TArray<UMovieSceneSection*> SectionArray; // 0x68
};

struct UHitMarkerComponent {
	FMulticastInlineDelegate OnHitMarkerRequested; // 0xe8
	FGameplayTagQuery RequiredVictimTags; // 0xf8
};

struct UMasterAudioSubmixCaptureProtocol {
	FString Filename; // 0x60
};

struct ASpawnLocalityVolume {
	float DefaultWeight; // 0x2d8
	FGameplayTagQuery TagRequirements; // 0x2e0
	TArray<FSpawnLocalityCharacterSet> CharacterSets; // 0x328
};

struct UWmfMediaSettings {
	bool AllowNonStandardCodecs; // 0x30
	bool LowLatency; // 0x31
	bool NativeAudioOut; // 0x32
	bool HardwareAcceleratedVideoDecoding; // 0x33
};

struct UAnimEvaluator {
	bool bDrawDebug; // 0x30
	float Weight; // 0x34
	EEvalType EvalType; // 0x38
	bool bInvertTest; // 0x39
	int32_t ID; // 0x3c
};

struct UGizmoLocalVec2ParameterSource {
	FVector2D Value; // 0x50
	FGizmoVec2ParameterChange LastChange; // 0x58
};

struct UVerticalBoxSlot {
	FSlateChildSize Size; // 0x40
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x60
	EVerticalAlignment VerticalAlignment; // 0x61
};

struct UNavCollisionBase {
	char bIsDynamicObstacle : 1; // 0x30
};

struct UAkSwitchInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettings CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
	FAkTRSPerPlatformSettings TRSSettings; // 0xf0
};

struct UDistributionVectorParameterBase {
	FName ParameterName; // 0x58
	FVector MinInput; // 0x60
	FVector MaxInput; // 0x6c
	FVector MinOutput; // 0x78
	FVector MaxOutput; // 0x84
	DistributionParamMode ParamModes[0x3]; // 0x90
};

struct UAudioCaptureComponent {
	int32_t JitterLatencyFrames; // 0x710
};

struct UGobiPlayerChallengeComponent {
	FMulticastInlineDelegate OnPlayerChallengeRankUpdated; // 0xe8
	FGobiPlayerChallengeRank ChallengeRank; // 0x100
};

struct UEnvQueryGenerator_BlueprintBase {
	FText GeneratorsActionDescription; // 0x58
	UEnvQueryContext* Context; // 0x70
	UEnvQueryItemType* GeneratedItemType; // 0x78
};

struct UParticleModuleMeshMaterial {
	TArray<UMaterialInterface*> MeshMaterials; // 0x38
};

struct UNiagaraDataInterfaceSkeletalMesh {
	AActor* Source; // 0x38
	FNiagaraUserParameterBinding MeshUserParameter; // 0x40
	USkeletalMeshComponent* SourceComponent; // 0x68
	ENDISkeletalMesh_SkinningMode SkinningMode; // 0x70
	TArray<FName> SamplingRegions; // 0x78
	int32_t WholeMeshLOD; // 0x88
	TArray<FName> FilteredBones; // 0x90
	TArray<FName> FilteredSockets; // 0xa0
	FName ExcludeBoneName; // 0xb0
	char bExcludeBone : 1; // 0xb8
};

struct UPostProcessComponent {
	FPostProcessSettings Settings; // 0x240
	float Priority; // 0x7a0
	float BlendRadius; // 0x7a4
	float BlendWeight; // 0x7a8
	char bEnabled : 1; // 0x7ac
	char bUnbound : 1; // 0x7ac
};

struct ALevelSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x2b0
	ULevelSequencePlayer* SequencePlayer; // 0x2c8
	FSoftObjectPath LevelSequence; // 0x2d0
	TArray<AActor*> AdditionalEventReceivers; // 0x2e8
	FLevelSequenceCameraSettings CameraSettings; // 0x2f8
	ULevelSequenceBurnInOptions* BurnInOptions; // 0x300
	UMovieSceneBindingOverrides* BindingOverrides; // 0x308
	char bAutoPlay : 1; // 0x310
	char bOverrideInstanceData : 1; // 0x310
	char bReplicatePlayback : 1; // 0x310
	UObject* DefaultInstanceData; // 0x318
	ULevelSequenceBurnIn* BurnInInstance; // 0x320
	bool bShowBurnin; // 0x328
};

struct UNavLinkComponent {
	TArray<FNavigationLink> Links; // 0x4b8
};

struct UAnimEvalSet_Shared_DestructibleAttack_C {
	FGameplayEval_Distance Distance To Destructible; // 0xc0
	FGameplayEval_Distance Z DistanceTo Destructible; // 0x190
	FAnimEval_MontageLastPlayed PlayedRecently; // 0x260
	FGameplayEval_BlockedByPawn BlockedByPawn; // 0x2b0
};

struct UMapSelectUserWidget {
	FMulticastInlineDelegate OnMapSelected; // 0x458
	FMulticastInlineDelegate OnMapFocused; // 0x468
	TSet<UGobiUserWidget*> HeaderWidgets; // 0x478
	TSet<UMatchmakingSettingEntryUserWidget*> MapWidgets; // 0x4c8
};

struct UEnvQueryTest_IsCurrentEnemy {
	FAIDataProviderFloatValue StickyTimeDP; // 0x208
};

struct UBossPositionTrigger {
	float TestInterval; // 0x40
	float WarningNameCooldown; // 0x44
	float SpottedByEnemyCooldown; // 0x4c
	TSoftClassPtr<UObject> CommonFilterClass; // 0x58
	TMap<TSoftClassPtr<UObject>, FBossReqsData> BossReqsMapData; // 0x80
	FGameplayTag FleeTag; // 0xd0
	float DelayForBossFlee; // 0xd8
	float BossFleeCooldown; // 0xdc
};

struct UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0xd8
	FGuid ExpressionGUID; // 0xe0
	FName Group; // 0xf0
};

struct USoundNodeModulator {
	float PitchMin; // 0x60
	float PitchMax; // 0x64
	float VolumeMin; // 0x68
	float VolumeMax; // 0x6c
};

struct UAkWindowsInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkWindowsAdvancedInitializationSettings AdvancedSettings; // 0xc0
	FAkTRSPerPlatformSettings TRSSettings; // 0x100
};

struct UInterpTrackInstAkAudioEvent {
	float LastUpdatePosition; // 0x30
};

struct UForceFeedbackComponent {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x230
	char bAutoDestroy : 1; // 0x238
	char bStopWhenOwnerDestroyed : 1; // 0x238
	char bLooping : 1; // 0x238
	char bIgnoreTimeDilation : 1; // 0x238
	char bOverrideAttenuation : 1; // 0x238
	float IntensityMultiplier; // 0x23c
	UForceFeedbackAttenuation* AttenuationSettings; // 0x240
	FForceFeedbackAttenuationSettings AttenuationOverrides; // 0x248
	FMulticastInlineDelegate OnForceFeedbackFinished; // 0x2f8
};

struct UCaravanSelectPanelUserWidget {
	TArray<FCaravanInstance> LastKnownCaravans; // 0x458
};

struct UGameplayEffectTriggerHorde {
	FString HordeLabel; // 0x238
};

struct UGobiWebServices {
	UWebServiceMatchmakingAPI* WebServiceMatchmakingAPI; // 0x30
	UWebServiceSessionAPI* WebServiceSessionAPI; // 0x38
	UWebServiceAgoraHydraLeaderboards* AgoraLeaderboardsClient; // 0x40
	UWebServiceAgoraHydraCommerce* AgoraCommerceClient; // 0x48
	UWebServiceAgoraHydraAuthAPI* WebServiceAgoraHydraAuthAPI; // 0x50
	UWebServiceAgoraHydraSSC* AgoraSSCClient; // 0x58
};

struct UWeaponTracer {
	UParticleSystem* ParticleSystem; // 0x38
	float FadeDuration; // 0x40
	UMaterialInterface* Material; // 0x48
};

struct UNetDriver {
	FString NetConnectionClassName; // 0x38
	FString ReplicationDriverClassName; // 0x48
	int32_t MaxDownloadSize; // 0x58
	char bClampListenServerTickRate : 1; // 0x5c
	int32_t NetServerMaxTickRate; // 0x60
	int32_t MaxNetTickRate; // 0x64
	int32_t MaxInternetClientRate; // 0x68
	int32_t MaxClientRate; // 0x6c
	float ServerTravelPause; // 0x70
	float SpawnPrioritySeconds; // 0x74
	float RelevantTimeout; // 0x78
	float KeepAliveTime; // 0x7c
	float InitialConnectTimeout; // 0x80
	float ConnectionTimeout; // 0x84
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x88
	bool bNoTimeouts; // 0x8c
	bool bNeverApplyNetworkEmulationSettings; // 0x8d
	UNetConnection* ServerConnection; // 0x90
	TArray<UNetConnection*> ClientConnections; // 0x98
	int32_t RecentlyDisconnectedTrackingTime; // 0x108
	UWorld* World; // 0x148
	UPackage* WorldPackage; // 0x150
	UObject* NetConnectionClass; // 0x178
	UObject* ReplicationDriverClass; // 0x180
	FName NetDriverName; // 0x198
	TArray<FChannelDefinition> ChannelDefinitions; // 0x1a0
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1b0
	TArray<UChannel*> ActorChannelPool; // 0x200
	float Time; // 0x218
	UReplicationDriver* ReplicationDriver; // 0x700
};

struct UOnPlayerStaminaStateChangedTrigger {
	TArray<FCharacterStaminaInfo> AllCharacterStaminaInfo; // 0x50
	float TickTimerInterval; // 0x60
};

struct USteeringBehavior_Pursue {
	UAnimContext_Actor* TargetActor; // 0x58
	bool bIgnoreZ; // 0x60
};

struct APlayerTrackingAudioVolume {
	UAkComponent* SoundSource; // 0x318
	bool bAudioPlayOnStart; // 0x320
	bool bDrawDebugSphere; // 0x321
};

struct UWrapBoxSlot {
	FMargin Padding; // 0x40
	bool bFillEmptySpace; // 0x50
	float FillSpanWhenLessThan; // 0x54
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct USpacer {
	FVector2D Size; // 0x148
};

struct UZombieCancelChannelHintUserWidget {
	FGameplayTagQuery VisibilityTagQuery; // 0x458
};

struct UMovieSceneMaterialTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UAvoidanceManager {
	float DefaultTimeToLive; // 0x38
	float LockTimeAfterAvoid; // 0x3c
	float LockTimeAfterClean; // 0x40
	float DeltaTimeToPredict; // 0x44
	float ArtificialRadiusExpansion; // 0x48
	float TestHeightDifference; // 0x4c
	float HeightCheckMargin; // 0x50
};

struct UInterpTrackInstSlomo {
	float OldTimeDilation; // 0x30
};

struct UBTService_GobiRunEQS {
	bool bRequiresBlackboardCondition; // 0x138
	EBasicKeyOperation BlackboardCondition; // 0x139
	FGameplayTagQuery TagRequirements; // 0x140
	bool bAllowsAnyObject; // 0x188
};

struct UNPCHealthDamagedTrigger {
	FGameplayTag BulletDamageTypeTag; // 0x50
	float ChanceForFriendlyFire; // 0x58
	float ReactionCooldown; // 0x5c
};

struct URelationshipSettings {
	TMap<FString, FRelationshipOutgoingFriendInvite> OutgoingFriendInvites; // 0x98
	TMap<FString, FRelationshipIncomingFriendInvite> IncomingFriendInvites; // 0xe8
};

struct UVectorFieldAnimated {
	UTexture2D* Texture; // 0x50
	EVectorFieldConstructionOp ConstructionOp; // 0x58
	int32_t VolumeSizeX; // 0x5c
	int32_t VolumeSizeY; // 0x60
	int32_t VolumeSizeZ; // 0x64
	int32_t SubImagesX; // 0x68
	int32_t SubImagesY; // 0x6c
	int32_t FrameCount; // 0x70
	float FramesPerSecond; // 0x74
	char bLoop : 1; // 0x78
	UVectorFieldStatic* NoiseField; // 0x80
	float NoiseScale; // 0x88
	float NoiseMax; // 0x8c
};

struct URespawnActorComponent {
	FRespawnPayload Payload; // 0xf0
};

struct UEdGraphNode {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40
	int32_t NodePosX; // 0x50
	int32_t NodePosY; // 0x54
	int32_t NodeWidth; // 0x58
	int32_t NodeHeight; // 0x5c
	ENodeAdvancedPins AdvancedPinDisplay; // 0x60
	ENodeEnabledState EnabledState; // 0x61
	char bDisplayAsDisabled : 1; // 0x63
	char bUserSetEnabledState : 1; // 0x63
	char bIsNodeEnabled : 1; // 0x63
	char bHasCompilerMessage : 1; // 0x63
	FString NodeComment; // 0x68
	int32_t ErrorType; // 0x78
	FString ErrorMsg; // 0x80
	FGuid NodeGuid; // 0x90
};

struct UBaseMediaSource {
	FName PlayerName; // 0x88
};

struct UAnimEvalSet_Shared_DeathReaction_BoneArray_C {
	FGameplayEval_Angle AvatarHitDirection; // 0xc0
	FGameplayEval_DamageType DamageType; // 0x120
	FGameplayEval_HitReactionBone DamageBone; // 0x1e0
	FGameplayEval_Distance DistanceToDamageSource; // 0x290
	FGameplayEval_Health AvatarHealth; // 0x360
	FGameplayEval_RandomChance RandomChance; // 0x3b8
	FGameplayEval_HasContext HasTarget; // 0x408
	FGameplayEval_GameplayTags AvatarTags; // 0x458
};

struct UWorldComposition {
	TArray<ULevelStreaming*> TilesStreaming; // 0x50
	double TilesStreamingTimeThreshold; // 0x60
	bool bLoadAllTilesDuringCinematic; // 0x68
	bool bRebaseOriginIn3DSpace; // 0x69
	float RebaseOriginDistance; // 0x6c
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch {
	FGameplayTagContainer Tags; // 0x30
};

struct USubmixEffectFlexiverbPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0x80
};

struct UOverlaySlot {
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct ACommonArmored_AICharacterBP_C {
	UArmorComponent* Armor; // 0x13f8
};

struct UAnimNotify_TRSEvent {
	FName EventName; // 0x40
};

struct UHUDScreen {
	FMulticastInlineDelegate OnHealingStart; // 0x558
	FMulticastInlineDelegate OnHealingEnd; // 0x568
	UAkAudioEvent* MissionStartEvent; // 0x578
	UAkAudioEvent* MissionEndEvent; // 0x580
	UAkAudioEvent* ObjectiveStartEvent; // 0x588
	UAkAudioEvent* ObjectiveEndEvent; // 0x590
	FMulticastInlineDelegate OnCommWheelVisibilityChanged; // 0x598
	TArray<FCenterBannerMessage> CenterBannerMessages; // 0x5a8
	TArray<FDamageNumberInfo> DamageNumberInfos; // 0x5b8
	UPanelWidget* CenteredPanel; // 0x6c8
};

struct UGranularSynth {
	USoundWave* GranulatedSoundWave; // 0x710
};

struct UGameCoachSubsystem {
	UGameCoach* GameCoach; // 0x38
};

struct UEnvQueryTest_DistanceMapBasic {
	UEnvQueryContext* DistanceMapSource; // 0x208
	FNavAgentSelector DistanceMapNavMesh; // 0x210
	EEnvItemStatus ItemsWithNoDistanceShould; // 0x214
};

struct UInterestingMomentComponent {
	AGameplayAnalyticsManager* GameplayAnalyticsManager; // 0xe8
};

struct UOnlineSessionClient {
	bool bIsFromInvite; // 0x1e0
	bool bHandlingDisconnect; // 0x1e1
};

struct UOnlineSettings {
	EMatchmakingVoicePreference VoicePreference; // 0x99
	bool bCrossPlayEnabled; // 0x9a
	EGroupInvitePrivacy GroupInvitePrivacy; // 0x9b
	TArray<FString> ActiveMatches; // 0xa0
};

struct UGameplayTask {
	FName InstanceName; // 0x38
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x42
	UGameplayTask* ChildTask; // 0x68
};

struct UEnvQueryTest_Voronoi {
	UEnvQueryContext* RegionSource; // 0x208
	UEnvQueryContext* SampleSources; // 0x210
};

struct UMaterialExpressionClamp {
	FExpressionInput Input; // 0x48
	FExpressionInput Min; // 0x5c
	FExpressionInput Max; // 0x70
	EClampMode ClampMode; // 0x84
	float MinDefault; // 0x88
	float MaxDefault; // 0x8c
};

struct UVendorScreen {
	UVendorSubcategoryUserWidget* ItemSubcategoryWidget; // 0x588
	TArray<FCategoryGroup> CategoryGroups; // 0x590
	TArray<FVendorStockItem> LastSeenVendorStock; // 0x5f0
	FSlateSound ErrorSound; // 0x600
	TSoftObjectPtr<UInventoryComponent> InventoryComponent; // 0x618
};

struct UGizmoArrowComponent {
	FVector Direction; // 0x4d0
	float Gap; // 0x4dc
	float Length; // 0x4e0
	float Thickness; // 0x4e4
};

struct UGizmoCircleComponent {
	FVector Normal; // 0x4d0
	float Radius; // 0x4dc
	float Thickness; // 0x4e0
	int32_t NumSides; // 0x4e4
	bool bViewAligned; // 0x4e8
	bool bOnlyAllowFrontFacingHits; // 0x4e9
};

struct UVFXCorpseManager {
	FMulticastInlineDelegate OnFadeNearby; // 0x58
};

struct APopupPromptVolume {
	FText PopupTitle; // 0x328
	FText PopupMessage; // 0x340
	EPopupButtonCombo ButtonCombo; // 0x358
};

struct AAISpawnActor_Sleeper_Wall_BP_C {
	UHeroLOSVolumeComponent* HeroLOSVolume; // 0x5b0
};

struct ATRSPortal {
	bool bDisableAfterDistance; // 0x3b0
	float MaxDistance; // 0x3b4
	bool bEnabled; // 0x3b8
	bool bIncludeOutdoorSectors; // 0x3b9
	bool bExclusiveOutdoorSectors; // 0x3ba
};

struct UAnimNotify_SS_Human_C {
	SharedSurvivorAnimSound_Enum HumanSound_1; // 0x58
};

struct UCardPaginatorUserWidget {
	FMulticastInlineDelegate OnDragDrop; // 0x458
	FMulticastInlineDelegate OnCardFocused; // 0x468
	FMulticastInlineDelegate OnCardUnfocused; // 0x478
	UTextBlock* PageText; // 0x488
	UGobiTextBlock* PagesText; // 0x490
	UWrapBox* CardWrapBox; // 0x498
	UGobiUserWidget* PrevPageButton; // 0x4a0
	UGobiUserWidget* NextPageButton; // 0x4a8
	int32_t CARDS_PER_PAGE; // 0x4b0
	USelectableGameplayCardUserWidget* CardClass; // 0x4b8
	FText NoCardsMessage; // 0x4c0
};

struct UParticleModuleLocationPrimitiveSphere {
	FRawDistributionFloat StartRadius; // 0xb8
};

struct USceneCaptureComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x230
	ESceneCaptureSource CaptureSource; // 0x231
	char bCaptureEveryFrame : 1; // 0x232
	char bCaptureOnMovement : 1; // 0x232
	bool bAlwaysPersistRenderingState; // 0x233
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x238
	TArray<AActor*> HiddenActors; // 0x248
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x258
	TArray<AActor*> ShowOnlyActors; // 0x268
	float LODDistanceFactor; // 0x278
	float MaxViewDistanceOverride; // 0x27c
	int32_t CaptureSortPriority; // 0x280
	bool bUseRayTracingIfEnabled; // 0x284
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x288
	FString ProfilingEventName; // 0x2a8
};

struct UAnimNotifyState_AttackWindow {
	FGameplayTag AttackVolumeTag; // 0x38
	TArray<UGameplayEffect*> AttackGameplayEffects; // 0x40
	bool bResetOverlaps; // 0x50
	bool bUpdateOverlaps; // 0x51
	bool bOverrideAttackVolumeCollision; // 0x52
	FCollisionProfileName AttackVolumeCollisionProfile; // 0x54
};

struct UMatchmakingPoolManager {
	TArray<FMatchmakingPoolConfig> PoolConfigs; // 0x30
	UGobiWebServices* GobiWebServices; // 0x40
	float SequenceMessagesTimeout; // 0x60
	float SequenceSessionJoinTimeout; // 0x64
};

struct UInterpTrackAkAudioEvent {
	TArray<FAkAudioEventTrackKey> Events; // 0x98
	char bContinueEventOnMatineeEnd : 1; // 0xa8
};

struct UAISense_TRSHearing {
	TArray<FAITRSNoiseEvent> NoiseEvents; // 0x88
	float SpeedOfSoundSq; // 0x98
};

struct UAudioInteractableComponent {
	UAkAudioEvent* AudioToPlay; // 0x230
	bool bCanBeDamaged; // 0x238
	bool bCanBeUsed; // 0x239
	FText DefaultPromptText; // 0x240
	float Cooldown; // 0x258
	UHealthComponent* HealthComponent; // 0x260
	UUsableComponent* UsableComponent; // 0x268
};

struct UMaterialExpressionClearCoatNormalCustomOutput {
	FExpressionInput Input; // 0x48
};

struct UCardListenerComponent {
	TArray<FCardRequestToCueData> CardRequestToTagMapping; // 0xe8
	int32_t RequestCounter; // 0xf8
	int32_t RequestIndex; // 0xfc
};

struct UAmmoDragPayload {
	EAmmoType AmmoType; // 0x38
	int32_t NumToDrop; // 0x3c
};

struct UProceduralSnapToGroundComponent {
	EProceduralBuildPhase ProceduralPhase; // 0xf1
	float TraceZOffset; // 0xf4
	float TraceDistance; // 0xf8
	FCollisionProfileName TraceProfileName; // 0xfc
};

struct UProjectileSimple {
	float MaxLifetime; // 0x94
	float CollisionRadius; // 0x98
	ECollisionChannel CollisionChannel; // 0x9c
	float CharacterCollisionRadius; // 0xa0
	FGameplayTagQuery ContinueMovingIfHitActorWithTags; // 0xa8
	UImpactEffectConfig* ImpactEffectConfig; // 0xf0
	bool bSpawnImpactDeferred; // 0xf8
	bool bAlsoImpactGroundIfImpactedCharacter; // 0xf9
	float GroundTraceDownDistance; // 0xfc
	bool bApplyDamage; // 0x100
	float DamageAmount; // 0x104
	UGobiDamageType* DamageType; // 0x108
};

struct UDatasmithSpotLightComponentTemplate {
	float InnerConeAngle; // 0x38
	float OuterConeAngle; // 0x3c
};

struct UNiagaraScript {
	ENiagaraScriptUsage Usage; // 0x30
	int32_t UsageIndex; // 0x34
	FGuid UsageId; // 0x38
	FNiagaraParameterStore RapidIterationParameters; // 0x48
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0x100
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x1d8
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x1e8
	FNiagaraVMExecutableData CachedScriptVM; // 0x3e0
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x508
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x518
};

struct UMediaComponent {
	UMediaTexture* MediaTexture; // 0xe8
	UMediaPlayer* MediaPlayer; // 0xf0
};

struct ANavMeshBoundsVolume {
	FNavAgentSelector SupportedAgents; // 0x2d8
};

struct UGeometryCollectionComponent {
	AChaosSolverActor* ChaosSolverActor; // 0x530
	UGeometryCollection* RestCollection; // 0x618
	TArray<AFieldSystemActor*> InitializationFields; // 0x620
	bool Simulating; // 0x630
	EObjectStateTypeEnum ObjectType; // 0x638
	bool EnableClustering; // 0x639
	int32_t ClusterGroupIndex; // 0x63c
	int32_t MaxClusterLevel; // 0x640
	TArray<float> DamageThreshold; // 0x648
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x658
	int32_t CollisionGroup; // 0x65c
	float CollisionSampleFraction; // 0x660
	float LinearEtherDrag; // 0x664
	float AngularEtherDrag; // 0x668
	UChaosPhysicalMaterial* PhysicalMaterial; // 0x670
	EInitialVelocityTypeEnum InitialVelocityType; // 0x678
	FVector InitialLinearVelocity; // 0x67c
	FVector InitialAngularVelocity; // 0x688
	FGeomComponentCacheParameters CacheParameters; // 0x698
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsStateChange; // 0x6e8
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsLoadingStateChange; // 0x6f8
	FMulticastInlineDelegate OnChaosBreakEvent; // 0x720
	float DesiredCacheTime; // 0x730
	bool CachePlayback; // 0x734
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x738
	bool bNotifyBreaks; // 0x748
	bool bNotifyCollisions; // 0x749
	UBodySetup* DummyBodySetup; // 0x928
};

struct UGizmoScaledTransformSource {
	TScriptInterface<IGizmoTransformSource> ChildTransformSource; // 0x50
};

struct UEnvQueryTest_EnemyDamageAttackable {
	FAIDataProviderIntValue MaxAttackFailures; // 0x2a0
	bool bUseAttackTime; // 0x2d8
	FAIDataProviderFloatValue MaxTimeSinceAttackFailure; // 0x2e0
	bool bUseAttackDistance; // 0x318
	FAIDataProviderBoolValue UseAttackLocation; // 0x320
	FAIDataProviderFloatValue MinDistanceSinceAttackFailure; // 0x358
	FAIDataProviderFloatValue MaxDistance; // 0x390
};

struct AProfileCamera {
	bool TeleportPlayerWhenViewedFromHere; // 0x2a0
};

struct UGameplayAction_TraversalSteer {
	TArray<FTraversalSteeringConfig> SteeringConfigs; // 0x210
	float ArrivalDistance; // 0x220
};

struct USteeringBehavior {
	EChildBehaviorMode ChildBehaviorMode; // 0x38
	TArray<FSteeringBehaviorChild> ChildBehaviors; // 0x40
	bool bNormalizeChildWeights; // 0x50
};

struct UBlueprintCore {
	UObject* SkeletonGeneratedClass; // 0x30
	UObject* GeneratedClass; // 0x38
	bool bLegacyNeedToPurgeSkelRefs; // 0x40
	FGuid BlueprintGuid; // 0x44
};

struct UPlaneFalloff {
	float Magnitude; // 0xe8
	float MinRange; // 0xec
	float MaxRange; // 0xf0
	float Default; // 0xf4
	float Distance; // 0xf8
	FVector Position; // 0xfc
	FVector Normal; // 0x108
	EFieldFalloffType Falloff; // 0x114
};

struct UEditableTextBox {
	FText Text; // 0x148
	FDelegate TextDelegate; // 0x160
	FEditableTextBoxStyle WidgetStyle; // 0x170
	USlateWidgetStyleAsset* Style; // 0x9f0
	FText HintText; // 0x9f8
	FDelegate HintTextDelegate; // 0xa10
	FSlateFontInfo Font; // 0xa20
	FLinearColor ForegroundColor; // 0xa80
	FLinearColor BackgroundColor; // 0xa90
	FLinearColor ReadOnlyForegroundColor; // 0xaa0
	bool IsReadOnly; // 0xab0
	bool IsPassword; // 0xab1
	float MinimumDesiredWidth; // 0xab4
	FMargin Padding; // 0xab8
	bool IsCaretMovedWhenGainFocus; // 0xac8
	bool SelectAllTextWhenFocused; // 0xac9
	bool RevertTextOnEscape; // 0xaca
	bool ClearKeyboardFocusOnCommit; // 0xacb
	bool SelectAllTextOnCommit; // 0xacc
	bool AllowContextMenu; // 0xacd
	EVirtualKeyboardType KeyboardType; // 0xace
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xacf
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xad0
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xad1
	ETextJustify Justification; // 0xad2
	FShapedTextOptions ShapedTextOptions; // 0xad3
	FMulticastInlineDelegate OnTextChanged; // 0xad8
	FMulticastInlineDelegate OnTextCommitted; // 0xae8
};

struct UHUDMissionObjectiveTipsUserWidget {
	UHUDMissionObjectiveTipUserWidget* ObjectiveTipClass; // 0x458
};

struct USoundBase {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x100
	float MaxDistance; // 0x104
	float TotalSamples; // 0x108
	float Priority; // 0x10c
	USoundAttenuation* AttenuationSettings; // 0x110
	FSoundModulation Modulation; // 0x118
	USoundSubmixBase* SoundSubmixObject; // 0x128
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x130
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x140
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x148
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x158
};

struct UParticleModuleRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UBTTask_RegisterAttackAttempt {
	FBlackboardKeySelector EnemyBBKey; // 0x78
};

struct UDemoTimeline {
	FSlateBrush BackgroundBrush; // 0x148
	FDelegate BackgroundBrushDelegate; // 0x1d8
	FSlateBrush IndicatorBrush; // 0x1e8
	FDelegate IndicatorBrushDelegate; // 0x278
};

struct UCrowdFollowingComponent {
	UCharacterMovementComponent* CharacterMovement; // 0x298
	FVector CrowdAgentMoveDirection; // 0x2a0
};

struct UVendorSaleMod {
	FVendorSaleParams SaleParams; // 0xd0
};

struct UOptionsTextSpinnerWidget {
	TMap<int32_t, FString> TTSValueOverrides; // 0x468
};

struct UBlackboardKeyType_Class {
	UObject* BaseClass; // 0x38
};

struct UGobiUserWidget {
	FMulticastInlineDelegate OnHovered; // 0x2d8
	FMulticastInlineDelegate OnUnhovered; // 0x2e8
	FMulticastInlineDelegate OnPressed; // 0x2f8
	FMulticastInlineDelegate OnReleased; // 0x308
	FMulticastInlineDelegate OnClicked; // 0x318
	FMulticastInlineDelegate OnRightClicked; // 0x328
	FMulticastInlineDelegate OnDoubleClicked; // 0x338
	bool bListenForCultureChange; // 0x348
	bool bIgnoreTrapFocus; // 0x349
	bool bListenForInputDeviceChange; // 0x34a
	TMap<EIconPlatform, UAkAudioEvent*> TTSFocusAudioEvents; // 0x350
	UAkAudioEvent* TTSFocusStopAudioEvent; // 0x3a0
	bool bTTSFocusPlayDuringPreSignIn; // 0x3a8
	FString TTSFocusMessage; // 0x3b8
	bool bIsTTSQueued; // 0x3c8
	FSlateSound PressedSound; // 0x3d0
	FSlateSound ClickedSound; // 0x3e8
	FSlateSound HoveredSound; // 0x400
	bool bIsHoverEnabled; // 0x418
	bool bIsClickEnabled; // 0x419
	bool bIsMouseClickEnabled; // 0x41a
	bool bIsRightClickEnabled; // 0x41b
	bool bIsGamepadClickEnabled; // 0x41c
	bool bIsKeyboardClickEnabled; // 0x41d
	FName KeyboardClickActionOverride; // 0x420
	FName GamepadClickActionOverride; // 0x428
	FKey DragDropKey; // 0x430
	bool bIsHovered; // 0x448
	bool bIsPressed; // 0x449
	bool bIsRightPressed; // 0x44a
};

struct UCardDrawScreen {
	UAkAudioEvent* DefaultCardClickedSound; // 0x558
	UAkAudioEvent* LightCardClickedSound; // 0x560
	UAkAudioEvent* MediumCardClickedSound; // 0x568
	UAkAudioEvent* HeavyCardClickedSound; // 0x570
	UAkAudioEvent* WildCardClickedSound; // 0x578
	float CardFlipDelay; // 0x580
	TArray<FDataTableRowHandle> PreviousDrawnCards; // 0x588
	FDataTableRowHandle LastCardPlayed; // 0x598
	TArray<FDataTableRowHandle> CardsWaitingForServerResponse; // 0x5b8
	TWeakObjectPtr<UGameplayCardManager> CardManager; // 0x5c8
};

struct APVPHoldoutGameMode {
	float ReadyToWaitMinTime; // 0x5a8
	int32_t ReadyToWaitMinTicks; // 0x5b0
	FPVPHoldoutSupplyPointsConfig SupplyPointsConfig; // 0x5bc
	TArray<FTeamImbalanceEffects> HeroAdvantageEffects; // 0x5d8
	TArray<FTeamImbalanceEffects> ZombieAdvantageEffects; // 0x5e8
	TArray<FTeamImbalanceEffects> HeroDisadvantageEffects; // 0x5f8
	TArray<FTeamImbalanceEffects> ZombieDisadvantageEffects; // 0x608
};

struct UMovieSceneGeometryCacheSection {
	FMovieSceneGeometryCacheParams Params; // 0xe8
};

struct UDialogueWave {
	char bMature : 1; // 0x30
	char bOverride_SubtitleOverride : 1; // 0x30
	FString SpokenText; // 0x38
	FString SubtitleOverride; // 0x48
	TArray<FDialogueContextMapping> ContextMappings; // 0x58
	FGuid LocalizationGUID; // 0x68
};

struct UMaterialExpressionScalarParameter {
	float DefaultValue; // 0x60
	bool bUseCustomPrimitiveData; // 0x64
	char PrimitiveDataIndex; // 0x65
};

struct UAnimNotify_SpawnImpactEffect {
	bool bUseRotationContext; // 0x40
	UAnimContext_Rotation* TraceDirectionContext; // 0x48
	EAnimNotifySpawnImpactTraceDirection TraceDirection; // 0x50
	ECollisionChannel TraceChannel; // 0x51
	float TraceLength; // 0x54
	FName TraceStartPosBoneName; // 0x58
	EAnimNotifySpawnImpactDirectionOverride DirectionOverride; // 0x60
	float DirectionOverrideYawOffset; // 0x64
	UImpactEffectConfig* ImpactEffectConfig; // 0x68
	FGameplayTagContainer BlockingTags; // 0x70
};

struct UItemFinder_Mod {
	float EntropyChance; // 0xd0
	float ChancePerKill; // 0xd4
	FGameplayTagContainer ItemTags; // 0xd8
	FGameplayTagQuery DamageTypeTagQuery; // 0xf8
	FGameplayTagQuery TargetTagQuery; // 0x140
	bool bTargetMustBeCharacter; // 0x188
};

struct UGlobalAssetLoader {
	TArray<FGlobalAssetLoaderAsset> ConfigAssets; // 0x38
	TArray<TSoftObjectPtr<UObject>> WeaponTableClasses; // 0x48
	TArray<UAssetTable*> GeneratedAssetTables; // 0x58
	TArray<UAssetTable*> RequestedAssetTables; // 0x68
	TArray<UObject*> LoadedObjects; // 0x78
	TArray<UObject*> AppLaunchUIAssets; // 0x88
};

struct UGameMapsSettings {
	FString LocalMapOptions; // 0x30
	FSoftObjectPath TransitionMap; // 0x40
	bool bUseSplitscreen; // 0x58
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x59
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x5a
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x5b
	bool bOffsetPlayerGamepadIds; // 0x5c
	FSoftClassPath GameInstanceClass; // 0x60
	FSoftObjectPath GameDefaultMap; // 0x78
	FSoftObjectPath ServerDefaultMap; // 0x90
	FSoftClassPath GlobalDefaultGameMode; // 0xa8
	FSoftClassPath GlobalDefaultServerGameMode; // 0xc0
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd8
	TArray<FGameModeName> GameModeClassAliases; // 0xe8
};

struct AMapMetrics {
	bool bRebuildMetrics; // 0x2a0
	UMapMetricsDataAsset* MapMetricsData; // 0x2a8
};

struct UAnimNotify_RattleTrigger {
	FName Bone; // 0x40
	float Radius; // 0x48
	float SpeedModifier; // 0x4c
};

struct UAnimNotify_SS_Enemy_C {
	SharedEnemyAnimSound_Enum EnemySound_1; // 0x60
};

struct ULifeStateHeroLedgeHang {
	float HelpInteractionTime; // 0xa8
	FName UsableComponentTag; // 0xac
	float TwoArmsHangHealthPct; // 0xb4
	float OneArmsHangHealthPct; // 0xb8
	UAnimMontage* FallDeathMontage; // 0xd0
};

struct UMapSpatialInfoComponent {
	TArray<char> SerializedCellInfo; // 0x4c8
	float GoldenPathLength; // 0x548
	bool bRestrictToNavPlacementVolumes; // 0x54c
	float DistanceFromNavPlacementVolumes; // 0x550
	float VisibilityMaxDistanceForward; // 0x554
	float VisibilityMaxDistanceBackward; // 0x558
	float NearbyDistance; // 0x55c
	float MaxAudibleDistance; // 0x560
	bool bGenerateMergedCells; // 0x564
	bool bGenerateGoldenPathDistances; // 0x565
	bool bGenerateVisibility; // 0x566
	FName GenerationBoundsTag; // 0x568
	bool bRestrictMergedCellsBasedOnVisibility; // 0x570
	int32_t MaxMergeTestVisMismatches; // 0x574
	bool bGenerateDebugMergeTestVisInfo; // 0x578
	bool bGenerateDebugNonVisibleAreaInfo; // 0x579
	bool bGenerateNearbyCells; // 0x57a
	bool bGenerateAudibleCells; // 0x57b
	bool bGenerateWallsOnlyAtTestActor; // 0x57c
	bool bGenerateWallsNorth; // 0x57d
	bool bGenerateWallsEast; // 0x57e
	bool bGenerateWallsSouth; // 0x57f
	bool bGenerateWallsWest; // 0x580
	bool bDrawOnlyIfSelected; // 0x581
	bool bDrawBehindWalls; // 0x582
	bool bDrawConnections; // 0x583
	bool bDrawLinkToGenerationVolumes; // 0x584
	bool bDrawVisibilityLocations; // 0x585
	bool bDrawInViewFromSafeRoom; // 0x586
	bool bDrawWalls; // 0x587
	bool bDrawWallSources; // 0x588
	bool bDrawWallTestPoints; // 0x589
	ECollisionChannel MovementChannel; // 0x58a
	ECollisionChannel VisiblityChannel; // 0x58b
	TArray<AActor*> TraceActorBaseClassesToIgnore; // 0x590
	TArray<FName> CollisionProfileNamesToIgnore; // 0x5a0
	TArray<FName> TraceActorTagsToIgnore; // 0x5b0
	EMapSpatialInfoDrawType DrawType; // 0x5c0
	TArray<AActor*> NavMeshSpawnActorClasses; // 0x610
	TArray<char> SerializedSonicProperties; // 0x620
	bool EnableSonicPropertyGeneration; // 0x640
	FString SonicFootprintReport; // 0x648
	float SonicPropertiesSize; // 0x658
	float MaxTotalSonicPathlength; // 0x65c
	float GoldenPathCullingDistance; // 0x660
	float MaxObstructionToExclude; // 0x664
	bool EnableMirrorReduction; // 0x668
};

struct UMovieSceneFloatSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct UGameplayEffectParticleInstant {
	UParticleSystem* ParticleSystem; // 0x238
};

struct URendererSettings {
	char bMobileDisableVertexFog : 1; // 0x40
	int32_t MaxMobileCascades; // 0x44
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x48
	char bMobileUseLegacyShadingModel : 1; // 0x4c
	char bMobileAllowDitheredLODTransition : 1; // 0x4c
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x4c
	char bMobileVirtualTextures : 1; // 0x4c
	char bDiscardUnusedQualityLevels : 1; // 0x4c
	char bOcclusionCulling : 1; // 0x4c
	float MinScreenRadiusForLights; // 0x50
	float MinScreenRadiusForEarlyZPass; // 0x54
	float MinScreenRadiusForCSMdepth; // 0x58
	char bPrecomputedVisibilityWarning : 1; // 0x5c
	char bTextureStreaming : 1; // 0x5c
	char bUseDXT5NormalMaps : 1; // 0x5c
	char bUseDX11Formats : 1; // 0x5c
	char bVirtualTextures : 1; // 0x5c
	char bVirtualTexturedLightmaps : 1; // 0x5c
	uint32_t VirtualTextureTileSize; // 0x60
	uint32_t VirtualTextureTileBorderSize; // 0x64
	uint32_t VirtualTextureFeedbackFactor; // 0x68
	char bVirtualTextureEnableCompressZlib : 1; // 0x6c
	char bVirtualTextureEnableCompressCrunch : 1; // 0x6c
	char bClearCoatEnableSecondNormal : 1; // 0x6c
	char bAnisotropicBRDF : 1; // 0x6c
	int32_t ReflectionCaptureResolution; // 0x70
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x74
	char bForwardShading : 1; // 0x74
	char bVertexFoggingForOpaque : 1; // 0x74
	char bAllowStaticLighting : 1; // 0x74
	char bUseNormalMapsForStaticLighting : 1; // 0x74
	char bGenerateMeshDistanceFields : 1; // 0x74
	char bEightBitMeshDistanceFields : 1; // 0x74
	char bGenerateLandscapeGIData : 1; // 0x74
	char bCompressMeshDistanceFields : 1; // 0x75
	float TessellationAdaptivePixelsPerTriangle; // 0x78
	char bSeparateTranslucency : 1; // 0x7c
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x80
	FVector TranslucentSortAxis; // 0x84
	ECustomDepthStencil CustomDepthStencil; // 0x90
	char bCustomDepthTaaJitter : 1; // 0x94
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x98
	FString NGXAppId; // 0xa0
	char bDefaultFeatureBloom : 1; // 0xb0
	char bDefaultFeatureAmbientOcclusion : 1; // 0xb0
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0xb0
	char bDefaultFeatureAutoExposure : 1; // 0xb0
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0xb4
	float DefaultFeatureAutoExposureBias; // 0xb8
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xbc
	char bUsePreExposure : 1; // 0xbc
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xbc
	char bDefaultFeatureMotionBlur : 1; // 0xbc
	char bDefaultFeatureLensFlare : 1; // 0xbc
	char bTemporalUpsampling : 1; // 0xbc
	char bSSGI : 1; // 0xbc
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xc0
	ELightUnits DefaultLightUnits; // 0xc1
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xc2
	char bRenderUnbuiltPreviewLightsInGame : 1; // 0xc4
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xc4
	char bStencilForLODDither : 1; // 0xc4
	EEarlyZPass EarlyZPass; // 0xc8
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xcc
	char bDBuffer : 1; // 0xcc
	EClearSceneOptions ClearSceneMethod; // 0xd0
	char bBasePassOutputsVelocity : 1; // 0xd4
	char bVertexDeformationOutputsVelocity : 1; // 0xd4
	char bSelectiveBasePassOutputs : 1; // 0xd4
	char bDefaultParticleCutouts : 1; // 0xd4
	int32_t GPUSimulationTextureSizeX; // 0xd8
	int32_t GPUSimulationTextureSizeY; // 0xdc
	char bGlobalClipPlane : 1; // 0xe0
	EGBufferFormat GBufferFormat; // 0xe4
	char bUseGPUMorphTargets : 1; // 0xe8
	char bNvidiaAftermathEnabled : 1; // 0xe8
	char bMultiView : 1; // 0xe8
	char bMobilePostProcessing : 1; // 0xe8
	char bMobileMultiView : 1; // 0xe8
	char bMobileUseHWsRGBEncoding : 1; // 0xe8
	char bRoundRobinOcclusion : 1; // 0xe8
	char bODSCapture : 1; // 0xe8
	char bMeshStreaming : 1; // 0xe9
	float WireframeCullThreshold; // 0xec
	char bEnableRayTracing : 1; // 0xf0
	char bEnableRayTracingTextureLOD : 1; // 0xf0
	char bSupportStationarySkylight : 1; // 0xf0
	char bSupportLowQualityLightmaps : 1; // 0xf0
	char bSupportPointLightWholeSceneShadows : 1; // 0xf0
	char bSupportAtmosphericFog : 1; // 0xf0
	char bSupportSkyAtmosphere : 1; // 0xf0
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xf0
	char bSupportSkinCacheShaders : 1; // 0xf1
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xf4
	float SkinCacheSceneMemoryLimitInMB; // 0xf8
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xfc
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xfc
	char bMobileAllowDistanceFieldShadows : 1; // 0xfc
	char bMobileAllowMovableDirectionalLights : 1; // 0xfc
	uint32_t MobileNumDynamicPointLights; // 0x100
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0x104
	char bMobileAllowMovableSpotlights : 1; // 0x104
	char bSupport16BitBoneIndex : 1; // 0x104
	char bGPUSkinLimit2BoneInfluences : 1; // 0x104
	char bSupportDepthOnlyIndexBuffers : 1; // 0x104
	char bSupportReversedIndexBuffers : 1; // 0x104
	char bSupportMaterialLayers : 1; // 0x104
	char bLPV : 1; // 0x104
	char bSupportAlphaToCoverage : 1; // 0x105
	float TRSMobileLuminance; // 0x108
	char bEnableNonCSMProjectedWholeSceneShadows : 1; // 0x10c
};

struct UGameplayContext_NextUsable {
	UAnimContext_NavLinkLocation* BaseNavLink; // 0x90
	FGameplayTagContainer UsableTags; // 0x98
	bool bSkipActivatableUsables; // 0xb8
	float SearchDist; // 0xbc
};

struct UGobiLoadingScreenDataSet {
	TSoftObjectPtr<UTexture2D> LoadingImage; // 0x38
	TSoftObjectPtr<UTexture2D> ShowDemoLoadingImage; // 0x60
};

struct UReplicatedMontageComponent {
	TArray<FName> IgnoreRootMotionSlots; // 0x130
	FReplicatedMontageData RepData; // 0x1b8
	UAnimInstance* AnimInstance; // 0x1e8
	AGobiCharacter* GobiCharacter; // 0x280
	UGobiCharacterMovementComponent* Movement; // 0x288
	TArray<UAnimMontage*> SerializableMontages; // 0x290
	UPlayDeathReactionComponent* PlayDeathReactionComponent; // 0x2a0
};

struct UTipEvaluatorSet_BP_C {
	FGobiGameCoachEval_CanShowTip CanShowTip; // 0x78
};

struct UMaterialExpressionTextureProperty {
	FExpressionInput TextureObject; // 0x48
	EMaterialExposedTextureProperty Property; // 0x5c
};

struct UInputAxisDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x30
};

struct UAssetTableOrganizer {
	TMap<FString, UAssetTable*> AssetLists; // 0x38
};

struct ALevelBounds {
	UBoxComponent* BoxComponent; // 0x2a0
	bool bAutoUpdateBounds; // 0x2a8
};

struct UAnimNotify_GobiMusicEvent {
	FDataTableRowHandle EventHandle; // 0x40
};

struct UCombineComponent {
	ECombineState CombineState; // 0xe8
	FMulticastInlineDelegate OnCombineStarted; // 0x158
	FMulticastInlineDelegate OnCombineStopped; // 0x168
	UUsableComponent* Usable; // 0x178
	TArray<FCornstalk> CornStalks; // 0x180
	FName CornStalkTag; // 0x190
	FName CornSplineTag; // 0x198
	UInstancedStaticMeshComponent* InstanceClass; // 0x1a0
	FName InstanceClassTag; // 0x1a8
	TArray<FName> BladeSocketLocationNames; // 0x1b0
	TArray<FVector> BladeSocketLocations; // 0x1c0
	TArray<ABirdSite*> BirdSites; // 0x1d0
	FName BirdSiteTag; // 0x1e0
	float BirdLaunchDistance; // 0x1e8
	UGobiNavModifierComponent* GobiNavModifierStart; // 0x1f0
	FName GobiNavModifierStartTag; // 0x1f8
	UGobiNavModifierComponent* GobiNavModifierEnd; // 0x200
	FName GobiNavModifierEndTag; // 0x208
	UNavArea* NavAreaDisabled; // 0x210
	UNavArea* NavAreaGobiDefault; // 0x218
	TArray<UStaticMeshComponent*> Blades; // 0x220
	FName BladesTag; // 0x230
	TArray<APlaceableAudioJostle*> CornAudioJostles; // 0x238
	FName CornAudioJostleTag; // 0x248
	float MinCombineDistanceToAudioJostle; // 0x250
	UAkComponent* AkVehicle; // 0x258
	FName AkVehicleTag; // 0x260
	UAkComponent* AkBlades; // 0x268
	FName AkBladesTag; // 0x270
	UItemAkBankComponent* ItemAkBank; // 0x278
	FName ItemAkBankTag; // 0x280
	UAkAudioEvent* CombineEngineStart; // 0x288
	UAkAudioEvent* CombineEngineLoop; // 0x290
	UAkAudioEvent* CombineEngineExplode; // 0x298
	UAkAudioEvent* CombineEngineDeath; // 0x2a0
	UAkAudioEvent* CombineEngineCrash; // 0x2a8
	UAkAudioEvent* BladesLoop; // 0x2b0
	UAkAudioEvent* BladesLoopStop; // 0x2b8
	UAkAudioEvent* PlantShred; // 0x2c0
	UAkAudioEvent* BodyShred; // 0x2c8
	float BodyHitAudioDelayTime; // 0x2d0
	float PlantHitAudioDelayTime; // 0x2d4
	UCurveFloat* CombineIgnitionCurve; // 0x2d8
	float StartCountdown; // 0x2e0
	float CombineIgnitionUpdateRate; // 0x2e4
	TArray<USpotLightComponent*> Spotlights; // 0x2e8
	FName SpotlightTag; // 0x2f8
	float MaxIntensity; // 0x300
	UParticleSystemComponent* CombineSmokeParticle; // 0x308
	FName CombineSmokeParticleTag; // 0x310
	UParticleSystemComponent* CornShuckGroup; // 0x318
	FName CornShuckGroupTag; // 0x320
	TArray<UParticleSystemComponent*> CombineWheelParticles; // 0x328
	FName CombineWheelsTag; // 0x338
	TArray<UStaticMeshComponent*> WheelMeshes; // 0x340
	FName WheelMeshTag; // 0x350
	UParticleSystem* CornShuck; // 0x358
	float PlantHitVFXDelayTime; // 0x360
	float WheelParticleDelayTime; // 0x364
	UParticleSystemComponent* CornSpray; // 0x368
	FName CornSprayTag; // 0x370
	UParticleSystemComponent* CombineBloodVFX; // 0x378
	FName CombineBloodVFXTag; // 0x380
	TArray<UBoxComponent*> PushbackVolumes; // 0x388
	FName PushbackVolumeTag; // 0x398
	float PushbackVolumeDamage; // 0x3a0
	float PushbackVolumeDamageEnableDelay; // 0x3a4
	UGobiDamageType* CombinePushbackDamageType; // 0x3a8
	EPhysicalSurface PhysicalSurfaceForDamage; // 0x3b0
	UBoxComponent* BladeCornBox; // 0x3b8
	FName BladeCornBoxTag; // 0x3c0
	AActor* CornStalkClass; // 0x3c8
	TArray<EObjectTypeQuery> QueryTypes; // 0x3d0
	float MoveCombineCountdown; // 0x3e0
	float MaxTravelZ; // 0x3e4
	float SuspensionLinearInterpSpeed; // 0x3e8
	float SuspensionAngularInterpSpeed; // 0x3ec
	USplineComponent* Spline; // 0x3f0
	FName SplineTag; // 0x3f8
	UStaticMeshComponent* CombineMesh; // 0x400
	FName CombineMeshTag; // 0x408
	float BladeMovementRate; // 0x410
	UChildActorComponent* ChildActorComponentClass; // 0x418
	FName ChildActorComponentTag; // 0x420
	bool bIsCombineMoving; // 0x428
	float CombineDamageAmount; // 0x42c
	float CombineDamageCooldown; // 0x430
	UGobiDamageType* CombineDamageType; // 0x438
	float CombineDistanceCheck; // 0x440
	float CombineBloodDeactiveCountdown; // 0x444
	FName CleanupKillVolumeTag; // 0x448
	float CleanupKillVolumeDelay; // 0x450
	UBoxComponent* CleanupKillVolume; // 0x458
};

struct ACutsceneCoordinator {
	FDataTableRowHandle CutsceneDefinitionRowHandle; // 0x2a0
	FMulticastInlineDelegate OnIntroFadeOut; // 0x2c0
	FMulticastInlineDelegate OnCutsceneSetup; // 0x2d0
	FMulticastInlineDelegate OnPlaySequence; // 0x2e0
	FMulticastInlineDelegate OnCutsceneCleanup; // 0x2f0
	FMulticastInlineDelegate OnPhaseChanged; // 0x300
	ECutsceneControl ControlState; // 0x310
	ULevelSequence* LevelSequence; // 0x318
	ALevelSequenceActor* LevelSequenceActor; // 0x320
	ULevelSequencePlayer* LevelSequencePlayer; // 0x328
	UPlayerCutsceneSynchronizationComponent* LocalSynchronizationComponent; // 0x330
	TArray<UObject*> PreloadedAssets; // 0x338
};

struct UGameplayEffectSetTags {
	FGameplayTagContainer Tags; // 0x250
	int32_t CountDelta; // 0x270
};

struct UGobiMediaSubtitleHelperSubsystem {
	UDataTable* SubtitleTimingTable; // 0x40
};

struct ALevelSequenceScenarioActorBase {
	USceneComponent* SceneRoot; // 0x2a0
	UTextRenderComponent* TextRender; // 0x2a8
	bool bIsEnabled; // 0x2b0
	bool bForceSequenceActorDespawn; // 0x2b1
	FGameplayTagQuery ForceDespawnOfCharactersThatMatch; // 0x2b8
	bool bOnlyOnePlayerIsRequiredToStart; // 0x300
	bool bTriggerWhenAllPlayersAreOutOfTriggerVolume; // 0x301
	ATriggerVolume* StartSequenceTriggerVolume; // 0x308
	AGobiCharacter* SequenceCharacterClass; // 0x310
	bool bSequenceActorIsUnkillable; // 0x318
	FGameplayTagContainer TagsToAddToSpawnedCharacter; // 0x320
	FGameplayTagContainer InPlaySequenceActorTagContainer; // 0x340
	ACharacterSpawnActor* CharacterSpawnActor; // 0x360
	ALevelSequenceActor* LevelSequenceActor; // 0x368
	AAISmartActor* HighPrioritySmartActor; // 0x370
	ALevelSequenceScenarioActorBase* OnRecycledEnableLSSAB; // 0x378
	ALevelSequenceScenarioActorBase* OnCompletedActivateLinkedLSSAB; // 0x380
	TArray<ALevelSequenceScenarioActorBase*> GetSavedHealthFromTheseLSSABs; // 0x388
	float OnCompletedLinkDelayTime; // 0x398
	FMulticastInlineDelegate OnSpawnSequenceCharacter; // 0x3a0
	bool bSequenceActorsKilled; // 0x3bc
	bool bSequenceActorIsActing; // 0x3bd
	ULevelSequenceScenarioComponent* LevelSequenceScenario; // 0x3c0
};

struct UEnvQueryGenerator_Usables {
	UEnvQueryContext* SearchCenter; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x60
};

struct UGizmoComponentHitTarget {
	UPrimitiveComponent* Component; // 0x38
};

struct ASpotLight {
	USpotLightComponent* SpotLightComponent; // 0x2b0
};

struct ABaseMeleeWeapon_BP_C {
	UStaticMeshComponent* BaseStaticMesh_3P; // 0x4d0
	UFPRigSkeletalMeshComponent* BaseMesh_1P; // 0x4d8
};

struct UBTDecorator_Cooldown {
	FAIDataProviderFloatValue CooldownTime; // 0x70
};

struct ABotController {
	FInventoryLoadout BaseLoadout; // 0x448
	FMulticastInlineDelegate OnGoToLocReached; // 0x480
	FMulticastInlineDelegate OnGoToLocSeqCompleted; // 0x490
	FMulticastInlineDelegate OnBotConfigChangedEvent; // 0x4a0
	FMulticastInlineDelegate OnBotSwarmedEvent; // 0x4b0
	FMulticastInlineDelegate OnCombatEvent; // 0x4c0
	float CombatExitDelay; // 0x4d0
	float CombatEndGroupUpDelay; // 0x4d4
	float HordeEndGroupUpDelay; // 0x4d8
	float InitFailTimer; // 0x4dc
	FGobiWorldProbeManager GobiWorldProbeMgr; // 0x4e0
	FBotAwarenessSystem AwarenessSystem; // 0x558
	FBotItemSystem ItemSystem; // 0x858
	FBotInventorySystem InventorySystem; // 0x960
	FBotInteractSystem InteractSystem; // 0xb18
	FTetherSystem TetherSystem; // 0xe20
	FBotPingSystem PingSystem; // 0xf40
	FBotCombatSystem CombatSystem; // 0x11d0
	FBotTeamInfo TeamInfo; // 0x1738
	FBotThreatList ThreatList; // 0x1c68
	AGobiCharacter* OwnerGobiChar; // 0x1cb8
	AHeroCharacter* OwnerHeroChar; // 0x1cc0
	FGameplayTag BotTypeBotTag; // 0x1cc8
	FGameplayTag BotTypeNPCTag; // 0x1cd0
	FGameplayTag BotBehaviorNoCombatTag; // 0x1cd8
	FGameplayTag BotBehaviorNoWanderTag; // 0x1ce0
	FGameplayTag BotItemUseCooldownTag; // 0x1ce8
	FGameplayTagContainer AttackTags; // 0x1cf0
	float ThreatDistScore; // 0x1d10
	float EyePosHeight; // 0x1d14
	FGameplayTagContainer DbgDisableActionsTags; // 0x1d18
	FGameplayTagContainer DbgDisableAttacksTags; // 0x1d38
	FGameplayTagContainer DbgDisableMovementTags; // 0x1d58
	FGameplayTagContainer DisableMovementTags; // 0x1d80
	UEnvQuery* Wander_EQS; // 0x1da0
	UEnvQuery* ThreatEQS; // 0x1da8
	UEnvQuery* AttackLocEQS; // 0x1db0
	UAIDistanceRanges* AttackDistanceRanges; // 0x1db8
	FGameplayTag BotInteractIgnoreTag; // 0x1dc0
	FGameplayTag BotInteractIgnoreAlwaysTag; // 0x1dc8
	FGameplayTag BotItemPickupLimitTag; // 0x1dd0
	FGameplayTagQuery TargetMeleeOnlyTagQuery; // 0x1dd8
	FGameplayTagQuery TargetMeleePreferredTagQuery; // 0x1e20
	FGameplayTagQuery TargetRangedOnlyTagQuery; // 0x1e68
	float ItemPickupSearchDist; // 0x1eb0
	FGameplayTagQuery EnvironSenseAllowedTagQuery; // 0x1eb8
	FGameplayTagQuery ThreatPingTagQuery; // 0x1f00
	float UsableSearchDist; // 0x2040
	float InteractNavToDist; // 0x2044
	float InteractActivateDist; // 0x2048
	float TeammateFollowTetherDist; // 0x204c
	UBotPlaystyleConfigCollection* DefaultBotPlaystyleConfigSet; // 0x2060
	FDataTableRowHandle BotSharedConfigRowHandle; // 0x2898
	UPlayerStatsComponent* StatsComponent; // 0x2918
	bool bIsCombatAllowed; // 0x299b
	bool bIsWanderAllowed; // 0x299c
	bool bReturnToCombatStartLoc; // 0x299d
	bool bAutoHideWeapons; // 0x299e
};

struct UGameplayEvalSet_Jump_C {
	FGameplayEval_NavArea IsJump; // 0x78
	FGameplayEval_IsNavLinkNext IsNavLinkNext; // 0xe8
	FGameplayEval_Distance IsAtJump; // 0x130
};

struct AMolotov_FirePool_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	UGameplayEffectEmitterComponent* GameplayEffectEmitter; // 0x2d8
	USphereComponent* GameplayEffectRadius; // 0x2e0
	USceneComponent* DefaultSceneRoot; // 0x2e8
	TArray<UParticleSystem*> ParticleSets; // 0x2f0
	UParticleSystemComponent* SpawnedParticleSet; // 0x300
	UAkComponent* MolotovFireAkComp; // 0x308
};

struct AGameplayEffectEmitterActor {
	UGameplayEffectEmitterComponent* EmitterComponent; // 0x2a0
	USceneComponent* DefaultRootComponent; // 0x2a8
	UBoxComponent* EmitterVolume; // 0x2b0
	UStaticMeshComponent* MeshComponent; // 0x2b8
	bool bStartActive; // 0x2c0
};

struct UNameplateManagerUserWidget {
	float ADSOpacity; // 0x458
	float IncapOffset; // 0x45c
	FGameplayTagQuery AutoCollapseTagQuery; // 0x460
	TMap<TWeakObjectPtr<APlayerSlot>, UNameplateUserWidget*> Nameplates; // 0x4a8
};

struct UNavigationSystemV1 {
	ANavigationData* MainNavData; // 0x30
	ANavigationData* AbstractNavData; // 0x38
	FName DefaultAgentName; // 0x40
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x48
	char bAutoCreateNavigationData : 1; // 0x70
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x70
	char bAllowClientSideNavigation : 1; // 0x70
	char bShouldDiscardSubLevelNavData : 1; // 0x70
	char bTickWhilePaused : 1; // 0x70
	char bSupportRebuilding : 1; // 0x70
	char bInitialBuildingLocked : 1; // 0x70
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x71
	ENavDataGatheringModeConfig DataGatheringMode; // 0x74
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x78
	float ActiveTilesUpdateInterval; // 0x7c
	TArray<FNavDataConfig> SupportedAgents; // 0x80
	FNavAgentSelector SupportedAgentsMask; // 0x90
	TArray<ANavigationData*> NavDataSet; // 0x98
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa8
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc8
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd8
	FNavigationSystemRunMode OperationMode; // 0x1c4
	float DirtyAreasUpdateFreq; // 0x51c
};

struct UAnimNotify_PlayParticleEffect {
	UParticleSystem* PSTemplate; // 0x40
	FVector LocationOffset; // 0x48
	FRotator RotationOffset; // 0x54
	FVector Scale; // 0x60
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UTierStarsUserWidget {
	UMaterialInstanceDynamic* StarMaterialInstance; // 0x458
};

struct ASphereReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x2a8
};

struct UBTTask_TriggerHorde {
	FString TriggerReason; // 0x78
};

struct UDeathGasSpawnComponent {
	FMulticastInlineDelegate OnDeathGasSpawnEnded; // 0x1e0
	FName SpawnMontagesName; // 0x1f0
	TArray<UAnimMontage*> SpawnMontages; // 0x1f8
	FGameplayTagContainer AppliedTags; // 0x208
	FGameplayTagQuery ActivatingActorTagRequirements; // 0x228
	FDeathGasSpawnTuning DeathGasSpawnTuning; // 0x270
	ADeathGasActor* DeathGasClass; // 0x290
	TArray<UGameplayEffect*> AppliedGameplayEffects; // 0x298
	FDeathGasSpawnMoveTickData MoveTickData; // 0x2c0
};

struct UBreakpoint {
	char bEnabled : 1; // 0x30
	UEdGraphNode* Node; // 0x38
	char bStepOnce : 1; // 0x40
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x40
	char bStepOnce_RemoveAfterHit : 1; // 0x40
};

struct USteeringBehavior_Distance {
	UAnimContext_Distance* DistanceContextClass; // 0x58
	FFloatRange DistanceRange; // 0x60
	USteeringBehavior* MinDistSteeringBehaviorOld; // 0x70
	USteeringBehavior* MaxDistSteeringBehaviorOld; // 0x78
	USteeringBehavior* MinDistSteeringBehavior; // 0x80
	USteeringBehavior* MaxDistSteeringBehavior; // 0x88
};

struct UParticleModuleSizeScaleBySpeed {
	FVector2D SpeedScale; // 0x38
	FVector2D MaxScale; // 0x40
};

struct UBlendProfile {
	USkeleton* OwningSkeleton; // 0x38
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x40
};

struct UGameplayEffectMoveSpeedScale {
	FCustomDataProviderFloat BaseSpeedMod; // 0x238
	float AdditionalSpeedModPerStack; // 0x240
};

struct UDistributionFloatConstant {
	float Constant; // 0x40
};

struct AProfilePhysicsCaster {
	int32_t NumCasts; // 0x2a0
	EPhysicsCasterType CasterType; // 0x2a4
	EPhysicsCasterPosition CasterStart; // 0x2a5
	EPhysicsCasterPosition CasterEnd; // 0x2a6
	bool bTraceComplex; // 0x2a7
	EPhysicsCasterTraceType TraceType; // 0x2a8
	ECollisionChannel Channel; // 0x2a9
	FName TraceTypeProfileName; // 0x2ac
	bool bTraceHitOnly; // 0x2b4
	bool bGetMaterial; // 0x2b5
	float InitialDelay; // 0x2b8
	UStaticMeshComponent* UserBounds; // 0x2c0
};

struct USoundCollectionAssetAnimPreview {
	USoundCollectionAsset* SCAHumanAnimPreview; // 0x38
	USoundCollectionAsset* SCAEnemyAnimPreview; // 0x40
};

struct APlayerCharacter {
	FMulticastInlineDelegate OnPlayerCharacterSlotChanged; // 0x1330
	bool bApplyControllerYawRotationRate; // 0x1368
	float ControllerYawRotationRate; // 0x136c
	float ControllerYawRotationRateStartDistance; // 0x1370
	float ControllerYawRotationRateStopDistance; // 0x1374
	APlayerSlot* OccupiedPlayerSlot; // 0x1378
	float CrouchTransitionTime; // 0x1394
	FCameraViewModifier CrouchViewModifier; // 0x13a0
	FGameplayTagQuery CanJumpTagQuery; // 0x13e8
};

struct UGameplayEffectItemCycleComponent {
	FGamePropertyFloatMod WeaponSwapSpeedScaleMod; // 0x250
	TArray<UGameplayEffect*> PowerSwapEffects; // 0x260
	TArray<UGameplayEffect*> PowerSwapPlayerEffects; // 0x270
};

struct AAudioJostleProceduralBuilder {
	TArray<UEmitterNodeBase*> UnmappedEmitterInfo; // 0x2a8
};

struct UBTTask_MoveDirectlyToward {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb8
	char bProjectVectorGoalToNavigation : 1; // 0xb8
	char bUpdatedDeprecatedProperties : 1; // 0xb8
};

struct USpinBox {
	float Value; // 0x148
	FDelegate ValueDelegate; // 0x14c
	FSpinBoxStyle WidgetStyle; // 0x160
	USlateWidgetStyleAsset* Style; // 0x478
	int32_t MinFractionalDigits; // 0x480
	int32_t MaxFractionalDigits; // 0x484
	bool bAlwaysUsesDeltaSnap; // 0x488
	float Delta; // 0x48c
	float SliderExponent; // 0x490
	FSlateFontInfo Font; // 0x498
	ETextJustify Justification; // 0x4f8
	float MinDesiredWidth; // 0x4fc
	bool ClearKeyboardFocusOnCommit; // 0x500
	bool SelectAllTextOnCommit; // 0x501
	bool bIsFocusedOnHover; // 0x502
	FSlateColor ForegroundColor; // 0x508
	FMulticastInlineDelegate OnValueChanged; // 0x538
	FMulticastInlineDelegate OnValueCommitted; // 0x548
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x558
	FMulticastInlineDelegate OnEndSliderMovement; // 0x568
	char bOverride_MinValue : 1; // 0x578
	char bOverride_MaxValue : 1; // 0x578
	char bOverride_MinSliderValue : 1; // 0x578
	char bOverride_MaxSliderValue : 1; // 0x578
	float MinValue; // 0x57c
	float MaxValue; // 0x580
	float MinSliderValue; // 0x584
	float MaxSliderValue; // 0x588
};

struct UTRSOnlineEntitlementsEOSSettings {
	TArray<FString> EntitlementIds; // 0x40
};

struct UAIDataProvider_QueryParams {
	FName ParamName; // 0x30
	float FloatValue; // 0x38
	int32_t IntValue; // 0x3c
	bool BoolValue; // 0x40
	FGameplayTagContainer TagsValue; // 0x48
	FGameplayTagQuery TagQueryValue; // 0x68
	UObject* ObjectValue; // 0xb0
};

struct UInterpTrackInstColorProp {
	FColor ResetColor; // 0x60
};

struct UGameplayContext_HeroIsInCombat {
	FDamageInfo LastDamageReceived; // 0x68
	FDamageInfo LastDamageInflicted; // 0x128
};

struct UItemBaseComponent {
	UHeroMovementComponent* OwnerMovementComponent; // 0x140
	FText UsePrompt; // 0x148
};

struct UBTTask_FinishWithResult {
	EBTNodeResult Result; // 0x78
};

struct APlaceableAudioJostle {
	EJostleMode JostleType; // 0x2a0
	FShrubEmitterInfo ShrubBehavior; // 0x2a8
	FBumpEmitterInfo BumpBehavior; // 0x2d0
	FRattleEmitterInfo RattleBehavior; // 0x300
	bool bAutoEnable; // 0x340
	bool bIsEnabled; // 0x341
	UEmitterNodeBase* Node; // 0x348
};

struct UDatasmithVREDSceneImportData {
	bool bMergeNodes; // 0x50
	bool bOptimizeDuplicatedNodes; // 0x51
	bool bImportMats; // 0x52
	FString MatsPath; // 0x58
	bool bImportVar; // 0x68
	bool bCleanVar; // 0x69
	FString VarPath; // 0x70
	bool bImportLightInfo; // 0x80
	FString LightInfoPath; // 0x88
	bool bImportClipInfo; // 0x98
	FString ClipInfoPath; // 0xa0
};

struct UPropertyValue {
	TArray<TFieldPath<FProperty>> Properties; // 0x90
	TArray<int32_t> PropertyIndices; // 0xa0
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xb0
	FString FullDisplayString; // 0xc0
	FName PropertySetterName; // 0xd0
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd8
	bool bHasRecordedData; // 0x128
	UObject* LeafPropertyClass; // 0x130
	TArray<char> ValueBytes; // 0x140
	EPropertyValueCategory PropCategory; // 0x150
};

struct UAutomationTestSettings {
	TArray<FString> EngineTestModules; // 0x30
	TArray<FString> EditorTestModules; // 0x40
	FSoftObjectPath AutomationTestmap; // 0x50
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x68
	TArray<FSoftObjectPath> AssetsToOpen; // 0x78
	FBuildPromotionTestSettings BuildPromotionTest; // 0x88
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x278
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2a8
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2b8
	TArray<FString> TestLevelFolders; // 0x2e8
	TArray<FExternalToolDefinition> ExternalTools; // 0x2f8
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x308
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x318
	FIntPoint DefaultScreenshotResolution; // 0x328
};

struct UWeaponAttachmentComponent {
	FMulticastInlineDelegate OnAttachmentsChanged; // 0x160
	FMulticastInlineDelegate OnAttachmentAdded; // 0x170
	FMulticastInlineDelegate OnAttachmentRemoved; // 0x180
	TArray<FDataTableRowHandle> PendingAttachmentApplications; // 0x1c0
	TArray<FDataTableRowHandle> PendingAttachmentRemovals; // 0x1d0
	TArray<FDataTableRowHandle> AppliedAttachments; // 0x1e0
	TArray<FDataTableRowHandle> AppliedAttachments_Client; // 0x1f0
	FGameplayTagContainer UnsupportedAttachments; // 0x200
	TArray<FGameplayTagContainer> AttachmentSlots; // 0x220
	UAttachmentMeshConfigurations* DefaultMeshConfigurations; // 0x230
	TArray<FWeaponAttachmentMeshConfig> MeshConfigurationOverrides; // 0x238
};

struct UMapBuildDataRegistry {
	ELightingBuildQuality LevelLightingQuality; // 0x30
};

struct UMovieSceneMarginSection {
	FMovieSceneFloatChannel TopCurve; // 0xe8
	FMovieSceneFloatChannel LeftCurve; // 0x188
	FMovieSceneFloatChannel RightCurve; // 0x228
	FMovieSceneFloatChannel BottomCurve; // 0x2c8
};

struct UAnimEvalSet_FixedScore_C {
	FGameplayEval_FixedScore FixedScore; // 0xc0
};

struct URendererOverrideSettings {
	char bSupportAllShaderPermutations : 1; // 0x40
	char bForceRecomputeTangents : 1; // 0x40
};

struct UGameplayContext_AIStimulus {
	UAnimContext_Actor* StimuliSourceActor; // 0x90
};

struct ACameraRig_Crane {
	float CranePitch; // 0x2a0
	float CraneYaw; // 0x2a4
	float CraneArmLength; // 0x2a8
	bool bLockMountPitch; // 0x2ac
	bool bLockMountYaw; // 0x2ad
	USceneComponent* TransformComponent; // 0x2b0
	USceneComponent* CraneYawControl; // 0x2b8
	USceneComponent* CranePitchControl; // 0x2c0
	USceneComponent* CraneCameraMount; // 0x2c8
};

struct UAISenseEvent_Damage {
	FAIDamageEvent Event; // 0x30
};

struct UInputAxisKeyDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x30
};

struct UParticleModuleTypeDataBeam2 {
	EBeam2Method BeamMethod; // 0x38
	int32_t TextureTile; // 0x3c
	float TextureTileDistance; // 0x40
	int32_t Sheets; // 0x44
	int32_t MaxBeamCount; // 0x48
	float Speed; // 0x4c
	int32_t InterpolationPoints; // 0x50
	char bAlwaysOn : 1; // 0x54
	int32_t UpVectorStepSize; // 0x58
	FName BranchParentName; // 0x5c
	FRawDistributionFloat Distance; // 0x68
	EBeamTaperMethod TaperMethod; // 0x98
	FRawDistributionFloat TaperFactor; // 0xa0
	FRawDistributionFloat TaperScale; // 0xd0
	char RenderGeometry : 1; // 0x100
	char RenderDirectLine : 1; // 0x100
	char RenderLines : 1; // 0x100
	char RenderTessellation : 1; // 0x100
};

struct ULifeStateRescueFromRespawn {
	TWeakObjectPtr<ARescuePlayerStart> CurrentRescueStart; // 0xb4
	TMap<ERescueSpawnPointType, UAnimMontage*> InNeedOfRescueMontages; // 0xc0
	TMap<ERescueSpawnPointType, UAnimMontage*> RescuedMontages; // 0x110
	bool bApplyCameraSocketOffset; // 0x160
	FVector CameraSocketOffset; // 0x164
	bool bApplyCameraTargetArmLength; // 0x17c
	float CameraTargetArmLength; // 0x180
	bool bApplyViewYawLimit; // 0x188
	float ViewYawLimit; // 0x18c
	bool bApplyViewPitchLimit; // 0x190
	FVector2D ViewPitchLimit; // 0x194
};

struct UTireType {
	float FrictionScale; // 0x38
};

struct UAnimContext_PawnProximity {
	UAnimContext_Transform* QueryOrigin; // 0x50
	UAnimContext_Transform* QueryBorder; // 0x58
	float QueryRadius; // 0x60
	AGobiCharacter* PawnFilterClass; // 0x68
	FGameplayTagQuery TagQueryFilter; // 0x70
	FGameplayTagContainer BlockingGameplayTags; // 0xb8
};

struct UGameplayContext_NearbyCharacters {
	FGameplayTagQuery CharacterTags; // 0x50
	float MinDistance; // 0x98
	float MaxDistance; // 0x9c
	bool bCheckViewAngle; // 0xa0
	float ViewAngle; // 0xa4
};

struct UAudioZombieManagerSystem {
	FName ManagerName; // 0x30
	bool bPushZombieCallouts; // 0x38
	bool bPushNumThreateningZombies; // 0x39
	bool bPushMaxThreat; // 0x3a
	bool bPushCumulativeThreat; // 0x3b
	FName NumThreateningZombiesRTPCName; // 0x3c
	FName MaxThreatRTPCName; // 0x44
	FName CumulativeThreatRTPCName; // 0x4c
	float PVPCollapsePhaseMultiplier; // 0x54
	FGameplayTagQuery RegistrationQuery; // 0x58
	float FrayRadius; // 0xa0
	float MinRadiusMultiplier; // 0xa4
	float CalloutRadius; // 0xa8
	float MaxRadius; // 0xac
	float MaxRadiusMultiplier; // 0xb0
	float FromBehindMultiplier; // 0xb4
	float MutedMultiplier; // 0xb8
	bool bUpdatePreferenceOnManagedCharacter; // 0xbc
	float PreferenceMinDeltaBeforeUpdate; // 0xc0
	TMap<FGameplayTag, float> TagMultipliers; // 0xc8
	FColor DebugColor; // 0x118
	bool bTextRenderer; // 0x11c
	float DebugTextSize; // 0x120
};

struct UAkPS4InitializationSettings {
	FAkCommonInitializationSettings CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkPS4AdvancedInitializationSettings AdvancedSettings; // 0xb8
	FAkTRSPerPlatformSettings TRSSettings; // 0xf8
};

struct ULifeStateHealth {
	TArray<FLifeStateTransitionRuleHealth> EnterRules; // 0xa8
	TArray<FLifeStateTransitionRuleHealth> ExitRules; // 0xb8
};

struct UMaterialExpressionTemporalSobol {
	FExpressionInput Index; // 0x48
	FExpressionInput Seed; // 0x5c
	uint32_t ConstIndex; // 0x70
	FVector2D ConstSeed; // 0x74
};

struct UParticleModuleLocationPrimitiveCylinder {
	char RadialVelocity : 1; // 0xb8
	FRawDistributionFloat StartRadius; // 0xc0
	FRawDistributionFloat StartHeight; // 0xf0
	CylinderHeightAxis HeightAxis; // 0x120
};

struct UInterpTrackInstAkAudioRTPC {
	float LastUpdatePosition; // 0x30
};

struct UMaterialExpressionShaderStageSwitch {
	FExpressionInput PixelShader; // 0x48
	FExpressionInput VertexShader; // 0x5c
};

struct UWaterSimulation {
	FIntVector GridSize; // 0x38
	UCanvasRenderTarget2D* SimGrid; // 0x48
	UCanvasRenderTarget2D* SimGridT; // 0x50
	UCanvasRenderTarget2D* SimColorGrid; // 0x58
	UCanvasRenderTarget2D* SimColorGridT; // 0x60
	FVector GridWorldSize; // 0x68
	UTexture2D* Ground; // 0x78
	FVector GroundOrigin; // 0x80
	FVector2D GroundSize; // 0x8c
	float GroundScale; // 0x94
	UTexture2D* ForceTexture; // 0x98
	float ForceTextureScale; // 0xa0
	float Speed; // 0xa4
	int32_t SimulationSteps; // 0xa8
	float Viscosity; // 0xac
	float WaterLineHeight; // 0xb0
	float WaterLineAttenuation; // 0xb4
	float WaterColorRChannelAtten; // 0xb8
	float WaterColorGChannelAtten; // 0xbc
	float WaterColorBChannelAtten; // 0xc0
	float WaterDynamicFoamAtten; // 0xc4
	float WaterDynamicFoamGeneration; // 0xc8
	WaterForceChannelType ForceResponseChannel; // 0xcc
	FVector VolumeCenterLocation; // 0xd0
	FVector OldVolumeCenterLocation; // 0xdc
	FVector PlayerSurfaceLocation; // 0xe8
	FVector EffectiveGridWorldSize; // 0xf4
	FString LastName; // 0x100
	UTexture2D* CachedGround; // 0x110
	float Time; // 0x118
};

struct ADatasmithSceneActor {
	UDatasmithScene* Scene; // 0x2a0
	TMap<FName, TSoftObjectPtr<AActor>> RelatedActors; // 0x2a8
};

struct UOnlinePIESettings {
	bool bOnlinePIEEnabled; // 0x40
	TArray<FPIELoginSettingsInternal> Logins; // 0x48
};

struct UReticleComponent {
	AGobiReticle* ReticleClass; // 0x100
	FGameplayTagQuery ShowReticleTagQuery; // 0x108
	bool bLocalPlayerOnly; // 0x150
};

struct UParticleModuleBeamModifier {
	BeamModifierType ModifierType; // 0x38
	FBeamModifierOptions PositionOptions; // 0x3c
	FRawDistributionVector Position; // 0x40
	FBeamModifierOptions TangentOptions; // 0x88
	FRawDistributionVector Tangent; // 0x90
	char bAbsoluteTangent : 1; // 0xd8
	FBeamModifierOptions StrengthOptions; // 0xdc
	FRawDistributionFloat Strength; // 0xe0
};

struct USoundNodeParamCrossFade {
	FName ParamName; // 0x70
};

struct UEnvQueryTest_PounceTrace {
	UEnvQueryContext* Context; // 0x208
	FAIDataProviderFloatValue ItemHeightOffset; // 0x210
	FAIDataProviderFloatValue ContextHeightOffset; // 0x248
	FAIDataProviderFloatValue TraceHalfHeightOffset; // 0x280
};

struct UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x30
	FDynamicPropertyPath SourcePath; // 0x38
	FName DestinationProperty; // 0x60
};

struct UGameNetworkManagerSettings {
	int32_t MinDynamicBandwidth; // 0x30
	int32_t MaxDynamicBandwidth; // 0x34
	int32_t TotalNetBandwidth; // 0x38
	int32_t BadPingThreshold; // 0x3c
	char bIsStandbyCheckingEnabled : 1; // 0x40
	float StandbyRxCheatTime; // 0x44
	float StandbyTxCheatTime; // 0x48
	float PercentMissingForRxStandby; // 0x4c
	float PercentMissingForTxStandby; // 0x50
	float PercentForBadPing; // 0x54
	float JoinInProgressStandbyWaitTime; // 0x58
};

struct UGameplayAction_LeapAttack {
	UAnimMontage* TellMontage; // 0x210
	float TellDuration; // 0x218
};

struct UZombieGhostComponent {
	float UpdateCanSpawnInterval; // 0xf8
	float MinSpawnDistance2DFromHeroes; // 0xfc
	float MinSpawnDistanceZFromHeroes; // 0x100
	float MinTeleportDistanceFromHeroes; // 0x104
	float MinSecondsUnseenToTeleport; // 0x108
	float MinSecondsUndamagedToTeleport; // 0x10c
	UAnimMontage* SpawnInMontage; // 0x110
	TArray<TSoftClassPtr<UObject>> FortificationsThatCollide; // 0x118
	TArray<FName> LOSCheckBoneNames; // 0x128
	TArray<UGameplayEffect*> CanSpawnEffects; // 0x138
	UAkAudioEvent* AKESpawnError; // 0x148
	ECanSpawnResult CanSpawnResult; // 0x150
	ECanSpawnResult CanTeleportResult; // 0x151
};

struct UZombieMutationNodeUserWidget {
	FDataTableRowHandle ZombieCardRowHandle; // 0x458
	bool bPurchased; // 0x478
	bool bPrereqsSatisfied; // 0x479
	bool bOwningPlayerCanAfford; // 0x47a
	bool bOwningPlayerCanSpendOn; // 0x47b
};

struct UGizmoLineHandleComponent {
	FVector Normal; // 0x4d0
	float HandleSize; // 0x4dc
	float Thickness; // 0x4e0
	FVector Direction; // 0x4e4
	float Length; // 0x4f0
	bool bImageScale; // 0x4f4
};

struct UDistributionFloatParameterBase {
	FName ParameterName; // 0x48
	float MinInput; // 0x50
	float MaxInput; // 0x54
	float MinOutput; // 0x58
	float MaxOutput; // 0x5c
	DistributionParamMode ParamMode; // 0x60
};

struct UAkActivatedPlugins {
	TMap<FString, FAkPluginList> Platforms; // 0x30
};

struct AFOVManager {
	TMap<ULocalPlayer*, FPlayerFOVState> PlayerFOVStates; // 0x2b8
	TArray<TScriptInterface<ICustomProjectionInterface>> ActiveFirstPersonMeshes; // 0x310
};

struct UGameplayAction_HagIdle {
	float CalmInvestigateDuration; // 0x210
	TArray<UAnimMontage*> IdleMontages; // 0x218
	TArray<UGameplayEffect*> CalmInvestigateEffectsToRemove; // 0x228
};

struct UAkItemProperties {
	FMulticastInlineDelegate OnSelectionChanged; // 0x148
	FMulticastInlineDelegate OnPropertyDragged; // 0x158
};

struct UVoipOverlayGridUserWidget {
	UPanelWidget* EntryGridPanel; // 0x460
};

struct ALODActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x2a0
	TMap<UMaterialInterface*, UInstancedStaticMeshComponent*> ImpostersStaticMeshComponents; // 0x2a8
	UHLODProxy* Proxy; // 0x2f8
	FName Key; // 0x300
	float LODDrawDistance; // 0x308
	int32_t LODLevel; // 0x30c
	TArray<AActor*> SubActors; // 0x310
	char CachedNumHLODLevels; // 0x320
};

struct UZombiePopupMutationUserWidget {
	UHorizontalBox* MutationPointsHBox; // 0x458
	UImage* LeftBar; // 0x460
	UImage* RightBar; // 0x468
	UTextBlock* CompletedText; // 0x470
	UTextBlock* LevelText; // 0x478
	UTextBlock* MutationDescriptionText; // 0x480
	UTextBlock* MutationPointsText; // 0x488
	FSlateColor CompleteColor; // 0x490
	FSlateColor IncompleteColor; // 0x4c0
};

struct UGizmoConstantFrameAxisSource {
	FVector Origin; // 0x38
	FVector Direction; // 0x44
	FVector TangentX; // 0x50
	FVector TangentY; // 0x5c
};

struct UShaderBuildProgress_WBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x458
	UCircularThrobber* CircularThrobber_73; // 0x460
	UProgressBar* CompilationProgress; // 0x468
	UVerticalBox* OuterVBox; // 0x470
	UBaseTextBlock_C* ProgressText; // 0x478
	int32_t MaxRemainingToCompile; // 0x480
	bool bShaderCompilationEnabled; // 0x484
};

struct UTimelineTemplate {
	float TimelineLength; // 0x30
	ETimelineLengthMode LengthMode; // 0x34
	char bAutoPlay : 1; // 0x35
	char bLoop : 1; // 0x35
	char bReplicated : 1; // 0x35
	char bIgnoreTimeDilation : 1; // 0x35
	TArray<FTTEventTrack> EventTracks; // 0x38
	TArray<FTTFloatTrack> FloatTracks; // 0x48
	TArray<FTTVectorTrack> VectorTracks; // 0x58
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x68
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x78
	FGuid TimelineGuid; // 0x88
	FName VariableName; // 0x98
	FName DirectionPropertyName; // 0xa0
	FName UpdateFunctionName; // 0xa8
	FName FinishedFunctionName; // 0xb0
};

struct UAchievementTrackerComponent {
	FMulticastInlineDelegate OnAchievementCompleted; // 0xe8
	TArray<UAchievement*> AllAchievements; // 0x148
	TArray<UAchievement*> ActiveAchievements; // 0x158
	TArray<UAchievement*> AchievementClasses; // 0x168
	UAchievement* PartyUpAchievementClass; // 0x190
	UAchievement* TestRewardAchievementClass; // 0x198
};

struct USynth2DSlider {
	float ValueX; // 0x148
	float ValueY; // 0x14c
	FDelegate ValueXDelegate; // 0x150
	FDelegate ValueYDelegate; // 0x160
	FSynth2DSliderStyle WidgetStyle; // 0x170
	FLinearColor SliderHandleColor; // 0x450
	bool IndentHandle; // 0x460
	bool Locked; // 0x461
	float StepSize; // 0x464
	bool IsFocusable; // 0x468
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x470
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x480
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x490
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4a0
	FMulticastInlineDelegate OnValueChangedX; // 0x4b0
	FMulticastInlineDelegate OnValueChangedY; // 0x4c0
};

struct AExponentialHeightFog {
	UExponentialHeightFogComponent* Component; // 0x2a0
	char bEnabled : 1; // 0x2a8
};

struct UDecalComponent {
	UMaterialInterface* DecalMaterial; // 0x230
	int32_t SortOrder; // 0x280
	float FadeScreenSize; // 0x284
	float FadeStartDelay; // 0x288
	float FadeDuration; // 0x28c
	float FadeInDuration; // 0x290
	float FadeInStartDelay; // 0x294
	char bDestroyOwnerAfterFade : 1; // 0x298
	FVector DecalSize; // 0x29c
};

struct UInterpTrackParticleReplay {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0x78
};

struct UAnimEvalSet_Shared_DeathReaction_Survivor_C {
	FGameplayEval_IsHeroPreviousLifeState PreviousLifeState; // 0x4a0
	FGameplayEval_GameplayTags IsCrouched; // 0x4f0
};

struct UBTDecorator_ConeCheck {
	float ConeHalfAngle; // 0x70
	FBlackboardKeySelector ConeOrigin; // 0x78
	FBlackboardKeySelector ConeDirection; // 0xa0
	FBlackboardKeySelector Observed; // 0xc8
};

struct UAIDataProvider_Random {
	float Min; // 0xb8
	float Max; // 0xbc
	char bInteger : 1; // 0xc0
};

struct UDistributionFloat {
	char bCanBeBaked : 1; // 0x38
	char bBakedDataSuccesfully : 1; // 0x38
};

struct UHorizontalBox {
	float ChildSpacing; // 0x170
};

struct UProgressBar {
	FProgressBarStyle WidgetStyle; // 0x148
	USlateWidgetStyleAsset* Style; // 0x300
	USlateBrushAsset* BackgroundImage; // 0x308
	USlateBrushAsset* FillImage; // 0x310
	USlateBrushAsset* MarqueeImage; // 0x318
	float Percent; // 0x320
	EProgressBarFillType BarFillType; // 0x324
	bool bIsMarquee; // 0x325
	FVector2D BorderPadding; // 0x328
	FDelegate PercentDelegate; // 0x330
	FSlateColor FillColorAndOpacity; // 0x340
	FDelegate FillColorAndOpacityDelegate; // 0x370
};

struct UMutilationSubsystem {
	TArray<FMutilationQualityCache> QualityCache; // 0x100
};

struct UCardTooltipUserWidget {
	UWidget* HostWidget; // 0x458
	FDataTableRowHandle HostCardRowHandle; // 0x460
	UPerkDetailsEntryUserWidget* PerkEntryClass; // 0x480
	float PerkDescWrapWidth; // 0x488
};

struct UTextPropertyTestObject {
	FText DefaultedText; // 0x30
	FText UndefaultedText; // 0x48
	FText TransientText; // 0x60
};

struct APlayerSlot {
	FSlotIndex SlotIdx; // 0x2a0
	FString ReservedPlayerId; // 0x2a8
	bool bReserved; // 0x2b8
	bool bAllowBots; // 0x2b9
	EGobiTeam Team; // 0x2ba
	bool bHasReceivedInitialSpawn; // 0x2bb
	bool bHasChosenLoadout; // 0x2bc
	bool bNeedsQuickPlayCharacterTransfer; // 0x2bd
	int32_t CharacterTransferOwedDraws; // 0x2c0
	float TimeSpentDead; // 0x2c4
	bool bIsCurrentlyAlive; // 0x2c8
	FDataTableRowHandle CurrentHeroRowHandle; // 0x2d0
	FCharacterCustomizationSet CurrentCustomizationSet; // 0x310
	TArray<FPostRoundSummaryStatValue> CachedPostRoundBonuses; // 0x398
	FRespawnSnapshot_Hero HeroRespawnSnapshot; // 0x3a8
	bool bHasEverBeenAlive; // 0x581
	FMulticastInlineDelegate OnSlotSelectedCharacterChanged; // 0x588
	FMulticastInlineDelegate OnOwningPlayerChanged; // 0x598
	FMulticastInlineDelegate OnControllingPlayerChanged; // 0x5a8
	FMulticastInlineDelegate OnAssignedPawnChanged; // 0x5b8
	FMulticastInlineDelegate OnPlayerNameChanged; // 0x5c8
	APawn* AssignedPawn; // 0x658
	AGobiPlayerState* OwningPlayer; // 0x660
	AGobiPlayerState* ControllingPlayer; // 0x668
	FPlayerLoadout PlayerLoadout; // 0x670
	FRespawnSnapshot_Hero SaferoomSnapshot; // 0x718
};

struct UParticleModuleLocationBoneSocket {
	ELocationBoneSocketSource SourceType; // 0x38
	FVector UniversalOffset; // 0x3c
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x48
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x58
	char bUpdatePositionEachFrame : 1; // 0x5c
	char bOrientMeshEmitters : 1; // 0x5c
	char bInheritBoneVelocity : 1; // 0x5c
	float InheritVelocityScale; // 0x60
	FName SkelMeshActorParamName; // 0x64
	int32_t NumPreSelectedIndices; // 0x6c
};

struct UAkMarkerCallbackInfo {
	int32_t Identifier; // 0x40
	int32_t Position; // 0x44
	FString Label; // 0x48
};

struct UEdGraphNode_Documentation {
	FString Link; // 0xa0
	FString Excerpt; // 0xb0
};

struct UMaterialExpressionMaterialProxyReplace {
	FExpressionInput Realtime; // 0x48
	FExpressionInput MaterialProxy; // 0x5c
};

struct UPhysicsAsset {
	TArray<int32_t> BoundsBodies; // 0x38
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x48
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x58
	FSolverIterations SolverIterations; // 0x68
	char bNotForDedicatedServer : 1; // 0x80
	UThumbnailInfo* ThumbnailInfo; // 0x128
	TArray<UBodySetup*> BodySetup; // 0x130
};

struct UBTDecorator_DataBindingIsValid {
	FAIDataProviderUObjectValue UObjectDataProvider; // 0x70
};

struct UPlayerMoveSpeedMod {
	FCustomDataProviderFloat Speed; // 0xd0
};

struct UChannel {
	UNetConnection* Connection; // 0x30
};

struct UAtmosphericFogComponent {
	float SunMultiplier; // 0x230
	float FogMultiplier; // 0x234
	float DensityMultiplier; // 0x238
	float DensityOffset; // 0x23c
	float DistanceScale; // 0x240
	float AltitudeScale; // 0x244
	float DistanceOffset; // 0x248
	float GroundOffset; // 0x24c
	float StartDistance; // 0x250
	float SunDiscScale; // 0x254
	float DefaultBrightness; // 0x258
	FColor DefaultLightColor; // 0x25c
	char bDisableSunDisk : 1; // 0x260
	char bAtmosphereAffectsSunIlluminance : 1; // 0x260
	char bDisableGroundScattering : 1; // 0x260
	FAtmospherePrecomputeParameters PrecomputeParams; // 0x264
	UTexture2D* TransmittanceTexture; // 0x290
	UTexture2D* IrradianceTexture; // 0x298
};

struct UAnimNotifyState_RepickMontage {
	bool bAllowRepickOfSelf; // 0x38
};

struct ADebugCameraController {
	char bShowSelectedInfo : 1; // 0x628
	char bIsFrozenRendering : 1; // 0x628
	char bIsOrbitingSelectedActor : 1; // 0x628
	char bOrbitPivotUseCenter : 1; // 0x628
	char bEnableBufferVisualization : 1; // 0x628
	char bEnableBufferVisualizationFullMode : 1; // 0x628
	char bIsBufferVisualizationInputSetup : 1; // 0x628
	char bLastDisplayEnabled : 1; // 0x628
	UDrawFrustumComponent* DrawFrustum; // 0x630
	AActor* SelectedActor; // 0x638
	UPrimitiveComponent* SelectedComponent; // 0x640
	FHitResult SelectedHitPoint; // 0x648
	APlayerController* OriginalControllerRef; // 0x6d0
	UPlayer* OriginalPlayer; // 0x6d8
	float SpeedScale; // 0x6e0
	float InitialMaxSpeed; // 0x6e4
	float InitialAccel; // 0x6e8
	float InitialDecel; // 0x6ec
};

struct UAnimSet {
	char bAnimRotationOnly : 1; // 0x30
	TArray<FName> TrackBoneNames; // 0x38
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x48
	TArray<char> BoneUseAnimTranslation; // 0x58
	TArray<char> ForceUseMeshTranslation; // 0x68
	TArray<FName> UseTranslationBoneNames; // 0x78
	TArray<FName> ForceMeshTranslationBoneNames; // 0x88
	FName PreviewSkelMeshName; // 0x98
	FName BestRatioSkelMeshName; // 0xa0
};

struct ULightComponentBase {
	FGuid LightGuid; // 0x230
	float Brightness; // 0x240
	float Intensity; // 0x244
	FColor LightColor; // 0x248
	char bAffectsWorld : 1; // 0x24c
	char CastShadows : 1; // 0x24c
	char CastStaticShadows : 1; // 0x24c
	char CastDynamicShadows : 1; // 0x24c
	char bAffectTranslucentLighting : 1; // 0x24c
	char bTransmission : 1; // 0x24c
	char bCastVolumetricShadow : 1; // 0x24c
	char bCastDeepShadow : 1; // 0x24c
	char bCastRaytracedShadow : 1; // 0x24d
	char bAffectReflection : 1; // 0x24d
	char bAffectGlobalIllumination : 1; // 0x24d
	float IndirectLightingIntensity; // 0x250
	float VolumetricScatteringIntensity; // 0x254
	int32_t SamplesPerPixel; // 0x258
};

struct UPlacementComponent {
	AActor* ActorClass; // 0xf0
	EProceduralBuildPhase ProceduralPhase; // 0xf8
	bool bGenerateRandomSeed; // 0xf9
	int32_t RandomSeed; // 0xfc
	EPlacementOffsetMode OffsetMode; // 0x100
	FVector Translation; // 0x104
	FRotator Rotation; // 0x110
	FVector MinTranslation; // 0x11c
	FVector MaxTranslation; // 0x128
	FRotator MinRotation; // 0x134
	FRotator MaxRotation; // 0x140
};

struct UPostRoundChallengeObjectiveUserWidget {
	FGobiCountAnim PointCountAnim; // 0x468
	FGobiCountAnim DiffCountAnim; // 0x490
};

struct USupplyPointsUserWidget {
	int32_t SupplyPoints; // 0x458
};

struct UPlatformInputIcons {
	TMap<FKey, FInputIcons> Keys; // 0x30
};

struct ASurfaceTypeDebugActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x2a0
	UTextRenderComponent* TextRendererComponent; // 0x2a8
	USceneComponent* InternalRootComponent; // 0x2b0
	FGameplayTag ImpactGameplayTag; // 0x2b8
};

struct UNiagaraEmitter {
	bool bLocalSpace; // 0x30
	bool bDeterminism; // 0x31
	int32_t RandomSeed; // 0x34
	EParticleAllocationMode AllocationMode; // 0x38
	int32_t PreAllocationCount; // 0x3c
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x40
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x68
	FNiagaraEmitterScriptProperties EmitterSpawnScriptProps; // 0x90
	FNiagaraEmitterScriptProperties EmitterUpdateScriptProps; // 0xb8
	ENiagaraSimTarget SimTarget; // 0xe0
	FBox FixedBounds; // 0xe4
	int32_t MinDetailLevel; // 0x100
	int32_t MaxDetailLevel; // 0x104
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0x108
	FNiagaraPlatformSet Platforms; // 0x120
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0x140
	char bInterpolatedSpawning : 1; // 0x150
	char bFixedBounds : 1; // 0x150
	char bUseMinDetailLevel : 1; // 0x150
	char bUseMaxDetailLevel : 1; // 0x150
	char bOverrideGlobalSpawnCountScale : 1; // 0x150
	char bRequiresPersistentIDs : 1; // 0x150
	float MaxDeltaTimePerTick; // 0x154
	uint32_t DefaultShaderStageIndex; // 0x158
	uint32_t MaxUpdateIterations; // 0x15c
	TSet<uint32_t> SpawnStages; // 0x160
	char bSimulationStagesEnabled : 1; // 0x1b0
	char bDeprecatedShaderStagesEnabled : 1; // 0x1b0
	char bLimitDeltaTime : 1; // 0x1b0
	FString UniqueEmitterName; // 0x1b8
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x1c8
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x1d8
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1e8
	UNiagaraScript* GPUComputeScript; // 0x1f8
	TArray<FName> SharedEventGeneratorIds; // 0x200
};

struct UGobiLocalPlayer {
	FMulticastInlineDelegate OnSettingsInitialized; // 0x260
	UPlayerSettingsGame* PlayerSettings; // 0x2e0
	UGameCoachSettings* GameCoachSettings; // 0x2e8
	UFTUESettings* FTUESettings; // 0x2f0
	UPlayerProfileSettings* PlayerProfileSettings; // 0x2f8
	UOnlineSettings* OnlineSettings; // 0x300
	URelationshipSettings* RelationshipSettings; // 0x308
	UPlayerAnalyticsSettings* PlayerAnalyticsSettings; // 0x310
};

struct UFXSystemAsset {
	uint32_t MaxPoolSize; // 0x30
};

struct UGeometryCache {
	TArray<UMaterialInterface*> Materials; // 0x38
	TArray<UGeometryCacheTrack*> Tracks; // 0x48
	int32_t StartFrame; // 0x68
	int32_t EndFrame; // 0x6c
};

struct UStumbleOthersComponent {
	float StumbleFrequency; // 0x150
	float MinDistance; // 0x154
	float AngleThreshold; // 0x158
	float FrontImpactAngle; // 0x15c
	float FrontAngle; // 0x160
	FGameplayTagQuery TagRequirements; // 0x168
	FGameplayTagQuery TargetTagRequirements; // 0x1b0
	TArray<UGameplayEffect*> ApplyEffects; // 0x1f8
};

struct UGizmoComponentWorldTransformSource {
	USceneComponent* Component; // 0x50
	bool bModifyComponentOnTransform; // 0x58
};

struct UGameplayEvalSet_Shared_Melee_Filter_C {
	FGameplayEval_Distance DistanceToEnemy; // 0xc0
	FGameplayEval_Distance DistanceZToEnemy; // 0x190
	FGameplayEval_Angle AngleToEnemy; // 0x260
	FGameplayEval_NavBlocked NavBlocked; // 0x2c0
	FGameplayEval_GameplayTags AvatarTags; // 0x318
	FGameplayEval_GameplayTags EnemyTags; // 0x3b0
	FGameplayEval_Speed EnemySpeed; // 0x448
	FGameplayEval_BlockedByPawn BlockedByPawn; // 0x4a8
	FGameplayEval_HasVisibility VisibilityToEnemy; // 0x510
};

struct ULightmassPortalComponent {
	UBoxComponent* PreviewBox; // 0x230
};

struct UNestsComponent {
	bool bHasFinishedSetup; // 0xe8
	TArray<FClusterBoils> HiddenNestClusterBoils; // 0xf0
	bool bIsNestDead; // 0x100
	TArray<FClusterBoils> VisibleNestClusterBoils; // 0x108
	int32_t HordeTriggeredCount; // 0x118
	AActor* WaypointLessonActorClass; // 0x140
	float WaypointLessonActorZoffset; // 0x148
	TArray<AActor*> SpawnedBoils; // 0x150
	FMulticastInlineDelegate OnBoilShrink; // 0x160
	FMulticastInlineDelegate OnClusterDestroyed; // 0x170
	FMulticastInlineDelegate OnNestDestroyed; // 0x180
	FMulticastInlineDelegate OnPlayedCards; // 0x190
	bool bAllowScenarioToAffectNest; // 0x1a0
	bool bClusterDeathDropsLoot; // 0x1a1
	bool bClusterDeathAddsCards; // 0x1a2
	bool bNestDeathDropsLoot; // 0x1a3
	bool bNestDeathAddsCards; // 0x1a4
	AActor* BoilsToSpawn; // 0x1a8
	AActor* NestBoilToSpawn; // 0x1b0
	int32_t TotalOfClustersVisible; // 0x1b8
	int32_t NumberOfClusterDestroyed; // 0x1bc
	FGameplayTag ClusterTag; // 0x1c0
	FGameplayTag NestBoilBaseTag; // 0x1c8
	FGameplayTag NestBaseTag; // 0x1d0
	int32_t NumberOfArmsforEasyDifficulty; // 0x1d8
	int32_t NumberOfArmsforNormalDifficulty; // 0x1dc
	int32_t NumberOfArmsforHardDifficulty; // 0x1e0
	int32_t NumberOfArmsforLegendaryDifficulty; // 0x1e4
	AAISpawnActorVolume* AISpawnActorVolume; // 0x1e8
	TArray<AAISpawnActorVolume*> SpawnedAISpawnActorVolumes; // 0x1f0
	FVector AISpawnActorVolumeScale; // 0x200
	FGameplayTag HordeBlockTag; // 0x20c
	FGameplayTagContainer ClusterLootTag; // 0x218
	FGameplayTagContainer DisallowedClusterLootTag; // 0x238
	FGameplayTagContainer NestLootTag; // 0x258
	FGameplayTagContainer DisallowedNestLootTag; // 0x278
	USceneComponent* NestLootSpawn; // 0x298
	FName NestLootSpawnTag; // 0x2a0
	float ClusterTransformZOffset; // 0x2a8
	float ClusterTransformZGroundOffset; // 0x2ac
	FVector NavBoundsExtents; // 0x2b0
	UParticleSystem* FliesParticle; // 0x2c0
	float ClusterParticleOffset; // 0x2c8
	UParticleSystem* ClusterExplodeParticle; // 0x2d0
	UParticleSystem* NestPodExplosion; // 0x2d8
	TArray<UAkComponent*> ClustersAkComponents; // 0x2e0
	TArray<USplineComponent*> VisibleSplines; // 0x2f0
	FName AKBasePodTag; // 0x300
	FName AkTentacleTag; // 0x308
	FName HordeRoarLocationTag; // 0x310
	FName NearBasePodTag; // 0x318
	UAkAudioEvent* NestIdleAudio; // 0x320
	UAkAudioEvent* TentacleIdleAudio; // 0x328
	UAkAudioEvent* TentacleIdleStopAudio; // 0x330
	float TentacleLocationUpdateRate; // 0x338
	UAkAudioEvent* NestHurtAudio; // 0x340
	UAkAudioEvent* ClusterDestroyedAudio; // 0x348
	UAkAudioEvent* NestSmallIdleAudio; // 0x350
	UAkAudioEvent* BoilsDestoryedAudio; // 0x358
	UAkAudioEvent* BoilsShrinkAudioEvent; // 0x360
	UAkAudioEvent* BoilsGrowAudioEvent; // 0x368
	UAkAudioEvent* NestPodDeathAudioEvent; // 0x370
	UAkAudioEvent* NestPodExplosionAudioEvent; // 0x378
	float DialogueDelay; // 0x380
	FDataTableRowHandle LastClusterAliveDialogueTable; // 0x388
	FDataTableRowHandle TwoClusterAliveDialogueTable; // 0x3a8
	TArray<FDataTableRowHandle> ThreePlusClusterAliveDialogueTableArray; // 0x3c8
	FDataTableRowHandle HordeDialogueTable; // 0x3d8
	FGameplayTag HordeTag; // 0x3f8
	FDataTableRowHandle NestDefeatedDialogueTable; // 0x400
	FDataTableRowHandle NestEncounterDialogueTable; // 0x420
	FDataTableRowHandle NestEncounterHint1DialogueTable; // 0x440
	FDataTableRowHandle NestEncounterHint2DialogueTable; // 0x460
	float Hint1CountdownTimer; // 0x480
	float Hint2CountdownTimer; // 0x484
	float ExcitationRadius; // 0x488
	float SpeedOfPropagation; // 0x48c
	float LifeSpanWhenDestroyed; // 0x490
	UAkComponent* AKBasePod; // 0x498
	UAkComponent* AKTentacle; // 0x4a0
	UBillboardComponent* HordeRoarLocation; // 0x4a8
	UBoxComponent* NearBasePodBox; // 0x4b0
	TArray<FDataTableRowHandle> ActiveCardsInPlay; // 0x4b8
	TArray<FNestChallengeCards> EasyDifficultyCardsArray; // 0x4c8
	TArray<FNestChallengeCards> NormalDifficultyCardsArray; // 0x4d8
	TArray<FNestChallengeCards> HardDifficultyCardsArray; // 0x4e8
	TArray<FNestChallengeCards> LegendaryDifficultyCardsArray; // 0x4f8
	TArray<int32_t> NumOfCardDraws; // 0x508
	FDifficultyInt ScenarioDifficultyCardDraw; // 0x518
	FString ClusterDestroyedText; // 0x530
	FString NestDestroyedText; // 0x540
};

struct ABandwidthTestActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x2a0
};

struct USubmixEffectReverbFastPreset {
	FSubmixEffectReverbFastSettings Settings; // 0xa8
};

struct UInteractiveCarMod {
	FGamePropertyFloatMod DestroyableChance; // 0xd8
};

struct UVendorAnimInstance {
	EVendorAnimBehaviorState CurrentBehaviorState; // 0x2b8
	UAnimSequence* LonelyAnim; // 0x2c0
	UAnimSequence* NagAnim; // 0x2c8
	UAnimSequence* InteractAnim; // 0x2d0
	UAnimSequence* InteractToLonelyAnim; // 0x2d8
	UAnimSequence* LonelyToNagAnim; // 0x2e0
	UAnimSequence* NagToLonelyAnim; // 0x2e8
	UAnimSequence* NagToInteractAnim; // 0x2f0
	FLookAtInfo LookAtInfo; // 0x2f8
};

struct UNiagaraPreviewAxis_InterpParamLinearColor {
	FLinearColor Min; // 0x40
	FLinearColor Max; // 0x50
};

struct UInputActionDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x30
};

struct UMatchmakingLocalUserSlot {
	UGobiWebServices* GobiWebServices; // 0x30
	UMatchmaking* Matchmaking; // 0x38
	UOnlineSessions* OnlineSessions; // 0x40
	UGobiWBP1* GobiWBP1; // 0x48
	UGameInstance* GameInstance; // 0x50
	TArray<FTaskTimerConfig> TimerConfigs; // 0x58
	FSignInTasks SignInTasks; // 0x298
	UVivoxListener* VivoxListener; // 0x310
	UBroadcastMessageManager* BroadcastMessageManager; // 0x318
};

struct UAudioJostleSystemPluginSettings {
	UAudioJostleBehaviors* AudioJostleBehaviorsClass; // 0x40
	float GridSize; // 0x48
	FAudioJostleQualitySettings HighQualitySettings; // 0x4c
	FAudioJostleQualitySettings LowQualitySettings; // 0x58
};

struct UMaterialExpressionLandscapeLayerCoords {
	ETerrainCoordMappingType MappingType; // 0x48
	ELandscapeCustomizedCoordType CustomUVType; // 0x49
	float MappingScale; // 0x4c
	float MappingRotation; // 0x50
	float MappingPanU; // 0x54
	float MappingPanV; // 0x58
};

struct ALandscapeStreamingProxy {
	LazyObjectProperty LandscapeActor; // 0x5c0
};

struct UInstancedStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x5c0
	int32_t NumCustomDataFloats; // 0x5d0
	TArray<float> PerInstanceSMCustomData; // 0x5d8
	int32_t InstancingRandomSeed; // 0x5e8
	int32_t InstanceStartCullDistance; // 0x5ec
	int32_t InstanceEndCullDistance; // 0x5f0
	TArray<int32_t> InstanceReorderTable; // 0x5f8
	int32_t NumPendingLightmaps; // 0x664
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x668
};

struct UInventoryLesson_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x460
};

struct UEndpoints {
	int32_t AtuinVersion; // 0x30
	TArray<FWebServiceEndpoint> ClientEndpoints; // 0x38
	TArray<FWebServiceEndpoint> DediEndpoints; // 0x48
};

struct UTextBlock {
	FText Text; // 0x168
	FDelegate TextDelegate; // 0x180
	FSlateColor ColorAndOpacity; // 0x190
	FDelegate ColorAndOpacityDelegate; // 0x1c0
	FSlateFontInfo Font; // 0x1d0
	FSlateBrush StrikeBrush; // 0x230
	FVector2D ShadowOffset; // 0x2c0
	FLinearColor ShadowColorAndOpacity; // 0x2c8
	FDelegate ShadowColorAndOpacityDelegate; // 0x2d8
	float MinDesiredWidth; // 0x2e8
	bool bWrapWithInvalidationPanel; // 0x2ec
	bool bAutoWrapText; // 0x2ed
	bool bForceUppercase; // 0x2ee
	int32_t Kerning; // 0x2f0
	bool bSimpleTextMode; // 0x2f4
};

struct UBTComposite_SimpleParallelEx {
	EBTParallelExMode ParallelMode; // 0x98
};

struct UApplyEffectItemComponent {
	FMulticastInlineDelegate OnItemApplied; // 0x160
	FMulticastInlineDelegate OnItemCancelled; // 0x170
	EEffectApplicationItemState CurrentState; // 0x180
	AActor* TargetActor; // 0x188
	UPrimitiveComponent* HitComponent; // 0x198
	AGobiCharacter* VisualTargetCharacter; // 0x1a0
	bool bWillExpendAmmoOnUse; // 0x1a8
	float RequiredUseLength; // 0x28c
	float FinishUseStateLength; // 0x290
	bool bRequireButtonHeld; // 0x294
	bool bActivateWithoutValidTarget; // 0x295
	bool bExpendAmmoWithoutValidTarget; // 0x296
	bool bSelectPreviousWeaponAfterUse; // 0x297
	bool bCancelUseOnKnockback; // 0x298
	bool bRequireSelection; // 0x299
	float ChanceToExpendAmmoOnUse; // 0x29c
	bool bCanUseWhileFalling; // 0x2a0
	bool bWaitForPrimaryRelease; // 0x2a1
	TSoftClassPtr<UObject> UsableClassForUsableTimeScale; // 0x2b0
	float MovementScale; // 0x2d8
	FName MovementScaleLabel; // 0x2dc
	bool bApplyMovementScaleToTargetPlayer; // 0x2e4
	bool bScaleAnimationLengthToUseLength; // 0x2e5
	UAnimMontage* UseMontageFP; // 0x2e8
	UAnimMontage* UseMontage3P; // 0x2f0
	UAnimMontage* EndUseMontageFP; // 0x2f8
	UAnimMontage* EndUseMontage3P; // 0x300
	UAnimMontage* AltUseMontageFP; // 0x308
	UAnimMontage* AltUseMontage3P; // 0x310
	UAnimMontage* EndAltUseMontageFP; // 0x318
	UAnimMontage* EndAltUseMontage3P; // 0x320
	bool bRemoveAppliedTagsBeforeApplyingSuccessfulEffects; // 0x328
	bool bRemoveTargetAppliedEffectsUponEndUse; // 0x329
	FGameplayTagContainer AppliedTags; // 0x330
	FGameplayTagContainer BlockingTags; // 0x350
	FGameplayTagQuery ContinuousTagQuery; // 0x370
	FGameplayTagContainer TargetAppliedTags; // 0x3b8
	FGameplayTagQuery InitialTargetTagQuery; // 0x3d8
	FGameplayTagQuery ContinuousTargetTagQuery; // 0x420
	FGameplayTag BeginUseCue; // 0x468
	FGameplayTag SuccessfulUseCue; // 0x470
	FGameplayTag UnsuccessfulUseCue; // 0x478
	FText ProgressBarText; // 0x480
	FText TargetProgressBarText; // 0x498
	FText TargetSelfProgressBarText; // 0x4b0
	bool bShowProgressbar; // 0x4c8
	bool bAllowAltUseTargetting; // 0x4c9
	float MaxAltUseTargetDistance; // 0x4cc
	float MaxAltUseTargetDistanceWhenUsing; // 0x4d0
	float MinAngleToTarget; // 0x4d4
	TArray<UGameplayEffect*> OnSuccessGameplayEffects; // 0x4d8
	TArray<UGameplayEffect*> OnTargetUseGameplayEffects; // 0x4e8
	TArray<UGameplayEffect*> OnOwnerUseGameplayEffects; // 0x4f8
	TArray<UGameplayEffect*> OnHeldGameplayEffects; // 0x508
	FName TriggeredEventName; // 0x518
};

struct UEnvQueryGenerator_Spiral {
	FAIDataProviderFloatValue InnerRadius; // 0x88
	FAIDataProviderFloatValue OuterRadius; // 0xc0
	FAIDataProviderIntValue NumberOfLoops; // 0xf8
	FAIDataProviderFloatValue SpaceBetweenLoops; // 0x130
	FAIDataProviderFloatValue SpaceBetweenPoints; // 0x168
	UEnvQueryContext* Center; // 0x1a0
};

struct URadioButton {
	FRadioButtonStyle WidgetStyle; // 0x160
	bool bIsChecked; // 0x568
	bool bIsContentInside; // 0x569
	EHorizontalAlignment HorizontalAlignment; // 0x56a
	bool IsFocusable; // 0x56b
	bool bIsFocusedOnHover; // 0x56c
	FName RadioButtonGroup; // 0x570
	FMulticastInlineDelegate OnCheckStateChanged; // 0x578
	FMulticastInlineDelegate OnClicked; // 0x588
	FMulticastInlineDelegate OnHovered; // 0x598
	FMulticastInlineDelegate OnUnhovered; // 0x5a8
	FMulticastInlineDelegate OnPressed; // 0x5b8
	FMulticastInlineDelegate OnReleased; // 0x5c8
	EButtonClickMethod ClickMethod; // 0x5d8
};

struct UPushToTalkComponent {
	UInputComponent* InputComponent; // 0xe8
};

struct UGobiGameCoachLesson {
	AActor* LastUpdateTarget; // 0xe0
	UGameplayTagsComponent* TargetGameplayTagsComponentCached; // 0xe8
	UGobiLocalPlayer* GobiLocalPlayer; // 0xf0
	AGobiCharacter* TargetCharacter; // 0xf8
	bool bListenForPawnChanges; // 0x100
	bool bAllowAllTRSEvents; // 0x101
	FMulticastInlineDelegate OnExtraInfo; // 0x108
	FMulticastInlineDelegate OnShowWaypoint; // 0x118
	FMulticastInlineDelegate OnSetWaypointText; // 0x128
	EGobiTeam Team; // 0x138
	FGameplayTagQuery LocalPlayerTags; // 0x140
	FGameplayTagQuery TargetTags; // 0x188
	FGameplayTagQuery LocalPlayerInventoryItemTagQuery; // 0x1d0
	TArray<UGobiGameCoachEvaluatorSet*> LocalPlayerTeachableEvalSets; // 0x218
	TArray<UGobiGameCoachEvaluatorSet*> TargetTeachableEvalSets; // 0x228
	FDataTableRowHandle ActiveMissionObjective; // 0x238
	bool bMainMenu; // 0x258
	bool bSocialSpace; // 0x259
	bool bPvP; // 0x25a
	bool bCoop; // 0x25b
	EMissionDifficulty LowestCoopDifficulty; // 0x25c
	EMissionDifficulty HighestCoopDifficulty; // 0x25d
	bool bShowDemo2020; // 0x25e
	FGameplayTagQuery TeachingSuccessLocalPlayerTags; // 0x260
	FGameplayTagQuery TeachingSuccessTargetTags; // 0x2a8
	TArray<UGobiGameCoachEvaluatorSet*> TeachingSuccessLocalPlayerEvalSets; // 0x2f0
	TArray<UGobiGameCoachEvaluatorSet*> TeachingSuccessTargetEvalSets; // 0x300
	TArray<FName> TeachingSuccessTRSEventNames; // 0x310
	FGameplayTagQuery TeachingFailureLocalPlayerTags; // 0x320
	FGameplayTagQuery TeachingFailureTargetTags; // 0x368
	TArray<UGobiGameCoachEvaluatorSet*> TeachingFailureLocalPlayerEvalSets; // 0x3b0
	bool bFailIfEvalSetFails; // 0x3c0
	TArray<UGobiGameCoachEvaluatorSet*> TeachingFailureTargetEvalSets; // 0x3c8
	UTexture2D* NotificationIcon; // 0x3d8
	FText NotificationText; // 0x3e0
	FText NotificationGamepadText; // 0x3f8
	bool bNotificationOutputTTS; // 0x410
	UTexture2D* WaypointIcon; // 0x418
	FText WaypointTitle; // 0x420
	FText WaypointText; // 0x438
	EEquipmentSlot HighlightEquipSlot; // 0x450
	bool bShowInGameOnly; // 0x451
	bool bHideForPotentialUsableTarget; // 0x452
	bool bHideForAltUseTarget; // 0x453
	UAkAudioEvent* DisplayOverrideSound; // 0x458
};

struct UTweenManagerComponent {
	TArray<UTweenContainer*> mTweenContainers; // 0xe8
};

struct ASafeRoomVendor {
	FMatchStartedCondition MatchStartedCondition; // 0x2a0
};

struct UPartyBeaconState {
	FName SessionName; // 0x30
	int32_t NumConsumedReservations; // 0x38
	int32_t MaxReservations; // 0x3c
	int32_t NumTeams; // 0x40
	int32_t NumPlayersPerTeam; // 0x44
	FName TeamAssignmentMethod; // 0x48
	int32_t ReservedHostTeamNum; // 0x50
	int32_t ForceTeamNum; // 0x54
	bool bRestrictCrossConsole; // 0x58
	bool bEnableRemovalRequests; // 0x59
	TArray<FPartyReservation> Reservations; // 0x60
};

struct USceneCaptureComponentCube {
	UTextureRenderTargetCube* TextureTarget; // 0x2c8
	bool bCaptureRotation; // 0x2d0
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2d8
	UTextureRenderTargetCube* TextureTargetRight; // 0x2e0
	UTextureRenderTarget2D* TextureTargetODS; // 0x2e8
	float IPD; // 0x2f0
};

struct UCutsceneAudioSinkSubsystem {
	TMap<TWeakObjectPtr<UMediaPlayer>, UAudioSinkSystem*> MediaPlayerPairs; // 0x48
};

struct UEnvQueryTest_DistanceAlongGoldenPathDelta {
	UEnvQueryContext* HeroContext; // 0x208
};

struct ULootSpawnCountMod {
	FLootSpawnCountModifier SpawnCountModifier; // 0xd0
};

struct UGameplayAction_Death {
	FGameplayTagQuery DieToRagdollQuery; // 0x2e8
};

struct UAnimContext_ActorSocket {
	FName Socket; // 0x90
	bool bFailIfSocketNotFound; // 0x98
};

struct UItemAmmoMod {
	FGameplayTag RequiredAssociatedItemTag; // 0xd0
	int32_t Count; // 0xd8
};

struct UGobiPlayerProfileComponent {
	bool bPlayerProfileServiceHealthy; // 0x18a
};

struct UTextLayoutWidget {
	FShapedTextOptions ShapedTextOptions; // 0x148
	ETextJustify Justification; // 0x14b
	ETextWrappingPolicy WrappingPolicy; // 0x14c
	char AutoWrapText : 1; // 0x14d
	float WrapTextAt; // 0x150
	FMargin Margin; // 0x154
	float LineHeightPercentage; // 0x164
};

struct UChatBoxUserWidget {
	UAkAudioEvent* PlayerJoinedGroupAudio; // 0x458
};

struct USphereReflectionCaptureComponent {
	float InfluenceRadius; // 0x2a8
	float CaptureDistanceScale; // 0x2ac
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x2b0
};

struct ASwapTeamVolume {
	USceneComponent* RejectionTeleportLocation; // 0x360
};

struct USourceEffectEQPreset {
	FSourceEffectEQSettings Settings; // 0x80
};

struct UNiagaraComponent {
	UNiagaraSystem* Asset; // 0x4b0
	ENiagaraTickBehavior TickBehavior; // 0x4b8
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x4c0
	char bForceSolo : 1; // 0x5c8
	char bAutoDestroy : 1; // 0x5f4
	char bRenderingEnabled : 1; // 0x5f4
	char bAutoManageAttachment : 1; // 0x5f4
	char bAutoAttachWeldSimulatedBodies : 1; // 0x5f4
	float MaxTimeBeforeForceUpdateTransform; // 0x5f8
	FMulticastInlineDelegate OnSystemFinished; // 0x600
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x610
	FName AutoAttachSocketName; // 0x618
	EAttachmentRule AutoAttachLocationRule; // 0x620
	EAttachmentRule AutoAttachRotationRule; // 0x621
	EAttachmentRule AutoAttachScaleRule; // 0x622
};

struct UAnimNotifyState_TimedNiagaraEffect {
	UNiagaraSystem* Template; // 0x38
	FName SocketName; // 0x40
	FVector LocationOffset; // 0x48
	FRotator RotationOffset; // 0x54
	bool bDestroyAtEnd; // 0x60
};

struct UOptionsBindingTextLabelUserWidget {
	TArray<FOptionsBindingTextLabelInputType> InputList; // 0x458
	bool bShowIcon; // 0x468
	float CalloutIconHeight; // 0x46c
	TArray<UDataTable*> HumanAxisDataTableList; // 0x470
	TArray<UDataTable*> ZombieAxisDataTableList; // 0x480
	TArray<UDataTable*> HumanActionsDataTableList; // 0x490
	TArray<UDataTable*> ZombieActionsDataTableList; // 0x4a0
};

struct UGameplayTagsTrait {
	FGameplayTagContainer Tags; // 0x30
	float RandomChance; // 0x50
};

struct UAnimNotifyState_SetBoneVis {
	TArray<FAnimNotify_BoneVisDef> BoneVisibilityChanges; // 0x38
};

struct UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderFloatValue GridSize; // 0x88
	FAIDataProviderFloatValue SpaceBetween; // 0xc0
	UEnvQueryContext* GenerateAround; // 0xf8
};

struct UAnimEvalSet_ClimbTop_C {
	FGameplayEval_ReachedClimbLocation DistanceToTopStart; // 0xc0
	FGameplayEval_Distance TopDistance; // 0x110
	FGameplayEval_Distance ClimbDownDistance; // 0x1e0
	FGameplayEval_RandomChance RandomChance; // 0x2b0
};

struct UAnimContext_RandomOnce {
	TMap<FName, float> RandomValues; // 0x50
};

struct UGameplayTask_SpawnActor {
	FMulticastInlineDelegate Success; // 0x70
	FMulticastInlineDelegate DidNotSpawn; // 0x80
	AActor* ClassToSpawn; // 0xa8
};

struct UMaterialExpressionArctangent2Fast {
	FExpressionInput Y; // 0x48
	FExpressionInput X; // 0x5c
};

struct UMovieSceneNiagaraParameterTrack {
	FNiagaraVariable Parameter; // 0x70
};

struct UGizmoTransformChangeStateTarget {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x58
};

struct UES_DangerClose_C {
	FGameplayEval_NearbyCharacters NearbyCharacters; // 0x78
};

struct UClothPhysicalMeshDataNv_Legacy {
	TArray<float> MaxDistances; // 0xe8
	TArray<float> BackstopDistances; // 0xf8
	TArray<float> BackstopRadiuses; // 0x108
	TArray<float> AnimDriveMultipliers; // 0x118
};

struct UPlanarReflectionComponent {
	UBoxComponent* PreviewBox; // 0x2c8
	float NormalDistortionStrength; // 0x2d0
	float PrefilterRoughness; // 0x2d4
	float PrefilterRoughnessDistance; // 0x2d8
	int32_t ScreenPercentage; // 0x2dc
	float ExtraFOV; // 0x2e0
	float DistanceFromPlaneFadeStart; // 0x2e4
	float DistanceFromPlaneFadeEnd; // 0x2e8
	float DistanceFromPlaneFadeoutStart; // 0x2ec
	float DistanceFromPlaneFadeoutEnd; // 0x2f0
	float AngleFromPlaneFadeStart; // 0x2f4
	float AngleFromPlaneFadeEnd; // 0x2f8
	bool bShowPreviewPlane; // 0x2fc
	bool bRenderSceneTwoSided; // 0x2fd
};

struct USoundNodeRandom {
	TArray<float> Weights; // 0x60
	TArray<bool> HasBeenUsed; // 0x70
	int32_t NumRandomUsed; // 0x80
	int32_t PreselectAtLevelLoad; // 0x84
	char bShouldExcludeFromBranchCulling : 1; // 0x88
	char bSoundCueExcludedFromBranchCulling : 1; // 0x88
	char bRandomizeWithoutReplacement : 1; // 0x88
};

struct UCardDrawOverviewUserWidget {
	FCardAnim SourceToCenter; // 0x480
	FCardAnim CenterToDest; // 0x4a0
	FCardAnim SourceShrink; // 0x4c0
	FCardAnim DestExpand; // 0x4e0
};

struct UMaterialExpressionFloor {
	FExpressionInput Input; // 0x48
};

struct UBTService {
	float Interval; // 0x68
	float RandomDeviation; // 0x6c
	char bCallTickOnSearchStart : 1; // 0x70
	char bRestartTimerOnEachActivation : 1; // 0x70
};

struct UBlackboardComponent {
	UBrainComponent* BrainComp; // 0xe8
	UBlackboardData* DefaultBlackboardAsset; // 0xf0
	UBlackboardData* BlackboardAsset; // 0xf8
	TArray<UBlackboardKeyType*> KeyInstances; // 0x120
};

struct UTimedActivationComponent {
	bool bStartCountdownOnBeginPlay; // 0xe8
	float Countdown; // 0xec
	UAkAudioEvent* CountdownIntervalSound; // 0xf0
	float LongestIntervalDelay; // 0xf8
	float ShortestIntervalDelay; // 0xfc
	float CountdownPctForShortestInterval; // 0x100
	float CountdownPctForLongestInterval; // 0x104
	FMulticastInlineDelegate OnCountdownFinished; // 0x108
};

struct UTeamRelationshipMap {
	TArray<FTeamRelationship> Relationships; // 0x30
};

struct UBTDecorator_ClearBlackboardKey {
	char bOnlyClearOnSuccess : 1; // 0x98
};

struct UThreatMod_SafeRoom {
	float ChangeRate; // 0x40
};

struct UAnimNotifyState_Trail {
	UParticleSystem* PSTemplate; // 0x38
	FName FirstSocketName; // 0x40
	FName SecondSocketName; // 0x48
	ETrailWidthMode WidthScaleMode; // 0x50
	FName WidthScaleCurve; // 0x54
	char bRecycleSpawnedSystems : 1; // 0x5c
	FName OverrideComponentTag; // 0x60
};

struct USoundNodeDistanceCrossFade {
	TArray<FDistanceDatum> CrossFadeInput; // 0x60
};

struct UAnimContext_Trace {
	UAnimContext_Transform* TraceStart; // 0x50
	UAnimContext_Transform* TraceEnd; // 0x58
	float TraceStartForwardOffset; // 0x60
	float TraceEndForwardOffset; // 0x64
	ECollisionChannel TraceChannel; // 0x68
	bool bUseCustomTraceChannel; // 0x69
	FName CustomTraceChannel; // 0x6c
	bool bTraceBothDirections; // 0x74
	bool bDoSweep; // 0x75
	float Radius; // 0x78
	float HalfHeight; // 0x7c
};

struct UAnimNotify_SharedSoundHuman {
	ESharedSurvivorAnimSound HumanSound; // 0x50
	bool PlayIfLocal; // 0x51
	bool PlayIfRemote; // 0x52
};

struct AAudioVolume {
	float Priority; // 0x2d8
	char bEnabled : 1; // 0x2dc
	FReverbSettings Settings; // 0x2e0
	FInteriorSettings AmbientZoneSettings; // 0x300
};

struct UEnvQueryTest_DeltaMap {
	UEnvQueryContext* DeltaMapSource; // 0x208
	FNavAgentSelector DeltaMapNavMesh; // 0x210
	EEnvItemStatus ItemsWithNoDeltaShould; // 0x214
};

struct UFontFace {
	FString SourceFilename; // 0x38
	EFontHinting Hinting; // 0x48
	EFontLoadingPolicy LoadingPolicy; // 0x49
	EFontLayoutMethod LayoutMethod; // 0x4a
};

struct UOnlineEngineInterfaceImpl {
	TMap<FName, FName> MappedUniqueNetIdTypes; // 0x30
	TArray<FName> CompatibleUniqueNetIdTypes; // 0x80
	FName VoiceSubsystemNameOverride; // 0x90
};

struct APartyBeaconClient {
	FString DestSessionId; // 0x360
	FPartyReservation PendingReservation; // 0x370
	EClientRequestType RequestType; // 0x3c0
	bool bPendingReservationSent; // 0x3c1
	bool bCancelReservation; // 0x3c2
};

struct UTeamPositionTrigger {
	float TestInterval; // 0x40
	float TakeLeadSeparationDistance; // 0x44
	float TakeLeadMaxDistFromGoldenPath; // 0x48
	float TeamClusterDistance; // 0x4c
	float SeparatedFromTeamDistance; // 0x50
};

struct UGobiEnemyDamageComponent {
	UBlackboardData* BlackboardAsset; // 0xe8
	FBlackboardKeySelector EnemyBBKey; // 0xf0
	AGobiCharacter* CharacterOwner; // 0x118
	TMap<AGobiCharacter*, FGobiEnemyDamage> EnemyDamage; // 0x120
	AGobiCharacter* CurrentEnemy; // 0x170
	UBlackboardComponent* BlackboardComp; // 0x180
};

struct ULootScenario {
	TSoftClassPtr<UObject> ScenarioClass; // 0x38
	bool bStartWithScenario; // 0x60
	bool bStopWithScenario; // 0x61
	bool bAutoSpawnItems; // 0x62
	bool bRemoveUnusedItems; // 0x63
	float SpawnDistanceThreshold; // 0x64
	TArray<FLootScenarioItemMaintenance> ItemsToMaintain; // 0x68
};

struct UThrowableComponent {
	FMulticastInlineDelegate OnItemThrown; // 0x160
	bool bActivationPressed; // 0x170
	AActor* Projectile; // 0x1e0
	FThrowableStateConfig PullBackStateConfig; // 0x1e8
	FThrowableStateConfig PullBackLoopStateConfig; // 0x210
	FThrowableStateConfig ThrowingStateConfig; // 0x238
	float ThrowTime; // 0x260
	FVector LaunchVelocity; // 0x264
	bool bDelayThrowUntilNextTick; // 0x270
	bool bUseImpulse; // 0x271
	bool bUseImpulseScalarOverride; // 0x272
	float ImpulseScalarOverride; // 0x274
	FGameplayTagContainer AppliedTags; // 0x278
	FGameplayTagQuery InitialTagQuery; // 0x298
	FGameplayTagQuery ContinuousTagQuery; // 0x2e0
	AActor* TargetingReticleActor; // 0x328
	float TargetingReticlePredictTime; // 0x330
	int32_t RequiredAmmo; // 0x334
	FName HiddenBoneOnThrow; // 0x338
	FVector SpawnPositionOffset; // 0x340
	FRotator SpawnRotationOffset; // 0x34c
};

struct USourceEffectMidSideSpreaderPreset {
	FSourceEffectMidSideSpreaderSettings Settings; // 0x7c
};

struct UPathFollowingComponent {
	UNavMovementComponent* MovementComp; // 0x120
	ANavigationData* MyNavData; // 0x130
};

struct UBTTask_MoveTo {
	float AcceptableRadius; // 0xa0
	UNavigationQueryFilter* FilterClass; // 0xa8
	float ObservedBlackboardValueTolerance; // 0xb0
	char bObserveBlackboardValue : 1; // 0xb4
	char bAllowStrafe : 1; // 0xb4
	char bAllowPartialPath : 1; // 0xb4
	char bTrackMovingGoal : 1; // 0xb4
	char bProjectGoalLocation : 1; // 0xb4
	char bReachTestIncludesAgentRadius : 1; // 0xb4
	char bReachTestIncludesGoalRadius : 1; // 0xb4
	char bStopOnOverlap : 1; // 0xb4
	char bStopOnOverlapNeedsUpdate : 1; // 0xb5
};

struct UBTTask_SetTagCooldown {
	FGameplayTag CooldownTag; // 0x78
	bool bAddToExistingDuration; // 0x80
	float CooldownDuration; // 0x84
};

struct UBumpEmitterNode {
	FBumpEmitterInfo BumpInfo; // 0x70
};

struct UConsoleSettings {
	int32_t MaxScrollbackSize; // 0x30
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x38
	TArray<FString> AutoCompleteMapPaths; // 0x48
	float BackgroundOpacityPercentage; // 0x58
	bool bOrderTopToBottom; // 0x5c
	bool bDisplayHelpInAutoComplete; // 0x5d
	FColor InputColor; // 0x60
	FColor HistoryColor; // 0x64
	FColor AutoCompleteCommandColor; // 0x68
	FColor AutoCompleteCVarColor; // 0x6c
	FColor AutoCompleteFadedColor; // 0x70
};

struct UChaosSolverSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x48
};

struct UGameplayEffectCameraShake {
	bool bPlayAsWorldCameraShake; // 0x238
	float InnerRadius; // 0x23c
	float OuterRadius; // 0x240
	FVector EpicenterOffset; // 0x244
	bool bUseBoneLocationAsEpicenter; // 0x250
	FName EpicenterBone; // 0x254
	float Falloff; // 0x25c
	bool bOrientShakeTowardsEpicenter; // 0x260
	bool bLocalPlayerOnly; // 0x261
	UCameraShake* Shake; // 0x268
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x270
	bool bForceFeedbackIsLooping; // 0x278
};

struct UBTTaskNode {
	TArray<UBTService*> Services; // 0x60
	char bIgnoreRestartSelf : 1; // 0x70
};

struct UGameplayAction_BotLadderTraversal {
	UGameplayEvaluatorSet* FilterSet; // 0x210
	bool bDisabled; // 0x218
	UAnimContext_Transform* DesiredDestContext; // 0x220
	float DestDistConstraint; // 0x228
	FGameplayTagContainer RemoveTags; // 0x230
	FVector SearchExtents; // 0x250
};

struct UEndMatchCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UActorToComponentConverter {
	bool bUpdate; // 0x38
	AActor* ActorClass; // 0x40
};

struct UMovieSceneAudioTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x60
};

struct UGameplayEffectWeakspot {
	FWeakSpotAttachment AppliedWeakspot; // 0x240
	FGamePropertyFloatMod WeakSpotMaxHealthMod; // 0x420
};

struct UHeroAudioComponent {
	int32_t TempTestFootsteps; // 0x308
	UAkAudioEvent* WetStep; // 0x310
	float WetStepMinDuration; // 0x318
	float WetStepMaxDuration; // 0x31c
	float LowHealthPercentage; // 0x320
	FDataTableRowHandle IncappedRowHandle; // 0x328
	FDataTableRowHandle RevivedRowHandle; // 0x348
	FDataTableRowHandle FullHealthReachedRowHandle; // 0x368
	FDataTableRowHandle LowHealthReachedRowHandle; // 0x388
	TArray<USoundCollectionAsset*> PossibleSoundCollections; // 0x3a8
	TArray<FAudioDamageTypeEvent> AudioDamageTypeEvents; // 0x3c0
	FGameplayTag DefaultDamageType; // 0x3d0
	TWeakObjectPtr<AAudioController> AudioController; // 0x3d8
	UAkAudioEvent* LadderGrabHardAudioEvent; // 0x3e0
	UAkAudioEvent* LadderGrabSoftAudioEvent; // 0x3e8
	UAkAudioEvent* LadderDismountAudioEvent; // 0x3f0
	float SpeedRTPCRequiredForLadderGrabHard; // 0x3f8
	float LadderMvmtThresholdScalar; // 0x3fc
	UCurveFloat* FootstepThresholdCurve; // 0x400
	float MaxSpeedForFootsteps; // 0x408
	float FoleyDuckingScalar; // 0x40c
	float FoleyDuckReleaseTimeScale; // 0x410
	float PlayerMaxSpeedSquared; // 0x414
	float PivotThresholdSquared; // 0x418
	float PivotScuffAudioCooldown; // 0x41c
	FVector2D ItemMvmtFoleyMinMaxDelay; // 0x420
	TMap<AItem*, UAkAudioEvent*> ItemMovementFoleyMap; // 0x428
	TMap<FName, float> MovementFoleyDelayMap; // 0x478
	TMap<FName, float> ItemMovementFoleyDelayMap; // 0x4c8
	UDataTable* WeaponAnimDataTable; // 0x518
	bool bIsMovementDisabled; // 0x520
	bool bIsSprinting; // 0x521
	bool bIsCrouching; // 0x522
	bool bIsADSing; // 0x523
	UAkAudioEvent* GreedMvmtAudioEvent; // 0x528
	int32_t GreedMaxRTPCValue; // 0x530
	UAkAudioEvent* ReviveFromIncapLocalAudioEvent; // 0x5a0
	UAkAudioEvent* ReviveFromIncapWorldAudioEvent; // 0x5a8
	UAkAudioEvent* UtilityStopAllAudioEvent; // 0x5b0
	UAkAudioEvent* PlayerDeathAudioEvent; // 0x5b8
	UAkAudioEvent* PlayerDeath2DAudioEvent; // 0x5c0
	UAkAudioEvent* OverhealAudioEvent; // 0x5e8
	UAkAudioEvent* BodyfallSwtAudioEvent; // 0x5f0
	UAkAudioEvent* HeartbeatLoopAudioEvent; // 0x5f8
	UAkAudioEvent* HeartbeatLoopStopAudioEvent; // 0x600
	float HeartbeatUpdateRate; // 0x608
	float HeartbeatCooldown; // 0x60c
	float HeartbeatHealthRatioMultiplier; // 0x610
	float HeartbeatRTPCDivider; // 0x614
	float LowHealthTime; // 0x618
	UAkAudioEvent* HitMarkerAudioEvent; // 0x640
	UAkAudioEvent* HitMarkerFriendlyAudioEvent; // 0x648
	FGameplayTagContainer HitMarkerDamageTypeTagContainer; // 0x650
	UAkAudioEvent* HitMarkerArmorAudioEvent; // 0x670
	UAkAudioEvent* HitMarkerMeleeArmorAudioEvent; // 0x678
	UAkAudioEvent* HitMarkerArmorDestroyedAudioEvent; // 0x680
	FGameplayTagContainer KevlarArmoredTagContainer; // 0x688
	UAkAudioEvent* HitMarkerKevlarAudioEvent; // 0x6a8
	UAkAudioEvent* HeadPopMinorAudioEvent; // 0x6b0
	UAkAudioEvent* HeadshotAudioEvent; // 0x6b8
	UAkAudioEvent* PVPRiddenDeathAudioEvent; // 0x6c0
	UAkAudioEvent* FlashlightOnAudioEvent; // 0x6c8
	UAkAudioEvent* FlashlightOffAudioEvent; // 0x6d0
	UAkAudioEvent* CurrencyEarnedAudioEvent; // 0x6d8
	TMap<FString, UAkAudioEvent*> AdditionalCurrencyAKE; // 0x6e0
};

struct UMaterialExpressionStaticBoolParameter {
	char DefaultValue : 1; // 0x60
};

struct UAsyncActionLoadPrimaryAssetClassList {
	FMulticastInlineDelegate Completed; // 0x80
};

struct UTitanMouthComponent {
	TArray<AActor*> Tongues; // 0x128
	TArray<UTitanTongueComponent*> TongueComponents; // 0x138
	UAnimMontage* GrabTellMontage; // 0x148
	UAnimMontage* GrabMontage; // 0x150
	UAnimMontage* PullMontage; // 0x158
	UAnimMontage* BiteMontage; // 0x160
	UAnimMontage* AllTonguesDestroyedMontage; // 0x168
	UAnimMontage* MouthWeakSpotDestroyedMontage; // 0x170
	TArray<AActor*> TongueClasses; // 0x178
	FName TongueAttachSocket; // 0x188
};

struct UGameplayAction_Spawn {
	bool bSortMontagesAlphabetically; // 0x210
	TArray<UAnimMontage*> SpawnMontages; // 0x218
	TArray<UMontageSet*> MontageSets; // 0x228
	TArray<UAnimMontage*> ExitSpawnMontages; // 0x238
	TMap<UAnimMontage*, UAnimSequence*> SupplementalPreSpawnSequences; // 0x248
	TArray<UMontageSet*> ExitMontageSets; // 0x298
	FGameplayTagContainer TriggerExitTags; // 0x2a8
	bool bExitOnEnemyChanged; // 0x2c8
	float EnemyChangedExitDelayTime; // 0x2cc
	bool bExitOnAlerted; // 0x2d0
	float AlertedExitDelayTime; // 0x2d4
	bool bSpawnHidden; // 0x2d8
	FVector PreSpawnLocationOffset; // 0x2dc
	UParticleSystem* PreSpawnEmitter; // 0x2e8
	UGameplayEffect* SpawnActorPostSpawnGE; // 0x2f0
	UGameplayEffect* SpawnActorPostSpawnHordingGE; // 0x2f8
	UGameplayEffect* SpawnActorPostSpawnWanderingGE; // 0x300
	float MaxSpawnDelay; // 0x308
	bool bExitMontageDelayAsRange; // 0x30c
	float ExitMontageDelayTime; // 0x310
	bool bDisablePhysicalizeDeathAnimation; // 0x314
	bool bSetLandMovementMode; // 0x315
	EMovementMode LandMovementMode; // 0x316
	FName SpawnCollisionProfileName; // 0x318
};

struct UAnimMetaData_MontageSync {
	UAnimMontage* Montage; // 0x30
	UGameplayContext_ActorComponent* SyncTargetContext; // 0x38
	bool bSyncStops; // 0x40
};

struct UNPCBanterDialogueTrigger {
	UDataTable* NPCBanterDataTable; // 0x58
	float MaxConversationDistance; // 0x60
	FVector2D TimerInterval; // 0x64
	float BackupBanterStartTimer; // 0x6c
};

struct USkeletalMeshSimplificationSettings {
	FName SkeletalMeshReductionModuleName; // 0x40
};

struct USharedSoundManager {
	FSharedSoundQualitySettings HighQualitySettings; // 0x30
	FSharedSoundQualitySettings LowQualitySettings; // 0x44
	TSet<FName> VocalizationSharedSoundFilter; // 0x58
	TSet<FName> FootstepSharedSoundFilter; // 0xa8
	TSet<FName> LowPrioritySharedSoundFilter; // 0xf8
};

struct AZombieWallAttachLocation {
	UBillboardComponent* BadLocatorSpriteComponent; // 0x2c8
	FVector2D VerticalDistanceRange; // 0x2d0
	FVector2D HorizontalDistanceRange; // 0x2d8
	FMulticastInlineDelegate OnSetLocationVisible; // 0x2e0
	FMulticastInlineDelegate OnSetLocationFocused; // 0x2f0
	EZombieAttachLocationType LocationType; // 0x300
	FGameplayTag PrimitiveComponentTag; // 0x304
	bool bIgnorePrimitiveOffset; // 0x30c
	UPrimitiveComponent* Primitive; // 0x310
	USplineComponent* Spline; // 0x318
	UStaticMeshComponent* VisualizationMesh; // 0x320
	UNavLocationComponent* NavLocationComponent; // 0x328
};

struct UEnvelopeFollowerListener {
	FMulticastInlineDelegate OnEnvelopeFollowerUpdate; // 0xe8
};

struct UEnvQueryTest {
	int32_t TestOrder; // 0x38
	EEnvTestPurpose TestPurpose; // 0x3c
	FString TestComment; // 0x40
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x50
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x51
	EEnvTestFilterType FilterType; // 0x52
	FAIDataProviderBoolValue BoolValue; // 0x58
	FAIDataProviderFloatValue FloatValueMin; // 0x90
	FAIDataProviderFloatValue FloatValueMax; // 0xc8
	EEnvTestScoreEquation ScoringEquation; // 0x101
	EEnvQueryTestClamping ClampMinType; // 0x102
	EEnvQueryTestClamping ClampMaxType; // 0x103
	EEQSNormalizationType NormalizationType; // 0x104
	FAIDataProviderFloatValue ScoreClampMin; // 0x108
	FAIDataProviderFloatValue ScoreClampMax; // 0x140
	EEnvQueryTestClampBehavior ScoreClampBehavior; // 0x178
	FAIDataProviderFloatValue ScoringFactor; // 0x180
	FAIDataProviderFloatValue ReferenceValue; // 0x1b8
	bool bDefineReferenceValue; // 0x1f0
	char bWorkOnFloatValues : 1; // 0x200
};

struct UGeometryCacheTrackStreamable {
	UGeometryCacheCodecBase* Codec; // 0x60
	float StartSampleTime; // 0xd0
};

struct APhysicsVolume {
	float TerminalVelocity; // 0x2d8
	int32_t Priority; // 0x2dc
	float FluidFriction; // 0x2e0
	char bWaterVolume : 1; // 0x2e4
	char bPhysicsOnContact : 1; // 0x2e4
};

struct UNetDriverEOS {
	bool bIsPassthrough; // 0x7d0
	bool bIsUsingP2PSockets; // 0x7d1
};

struct UFlashBangReceiverComponent {
	TWeakObjectPtr<APlayerCharacter> OwnerPlayer; // 0xec
	FGameplayTag FlashbangGameplayTag; // 0xf8
	TWeakObjectPtr<UGameplayTagsComponent> GameplayTagsComponent; // 0x100
	UMaterialInterface* FlashbangMaterial; // 0x118
	FLinearColor FlashColor; // 0x120
	UCurveFloat* FlashIntensityCurve; // 0x130
	UCurveFloat* AfterImageIntensityCurve; // 0x138
	float AfterImageScalePerSec; // 0x140
	TWeakObjectPtr<UMaterialInstanceDynamic> PostProcessMaterialInstance; // 0x144
	UFramebufferCopy* FramebufferCopy; // 0x150
};

struct UMaterialExpressionAtmosphericFogColor {
	FExpressionInput WorldPosition; // 0x48
};

struct UMaterialExpressionQualitySwitch {
	FExpressionInput Default; // 0x48
	FExpressionInput Inputs[0x3]; // 0x5c
};

struct UDefaultLevelSequenceInstanceData {
	AActor* TransformOriginActor; // 0x38
	FTransform TransformOrigin; // 0x40
};

struct UOnGameplayTagChangedTrigger {
	FGameplayTagContainer PinnedTagContainer; // 0x60
	FGameplayTagContainer PinnedByEnemyTagContainer; // 0x80
	float PinnedCalloutInterval; // 0xa4
	float ChanceForPinnedCallout; // 0xa8
	int32_t MaxStruggleBeforePinnedCallout; // 0xac
	FGameplayTagContainer PukedTagContainer; // 0xb8
	float PukedCalloutDelay; // 0xd8
	FGameplayTagContainer SqueezedTagContainer; // 0xe0
	float SqueezedCalloutInterval; // 0x100
	FGameplayTagContainer EatenTagContainer; // 0x108
	float DelayBeforeHagEating; // 0x12c
	FGameplayTagContainer OutOfSafezoneTagContainer; // 0x130
	float OutOfSafezoneCoughInterval; // 0x150
};

struct UAnimEvalSet_Shared_Alert_Attacked_C {
	FGameplayEval_Angle AngleToEnemy; // 0xc0
	FGameplayEval_DamageType DamageType; // 0x120
	FGameplayEval_RandomChance RandomChance; // 0x1e0
};

struct ABaseWeapon_BP_C {
	UTuningDataComponent* TuningData; // 0x4a8
	UItemAkBankComponent* ItemAkBank; // 0x4b0
	UItemCycleComponent* ItemCycle; // 0x4b8
	UWeaponMovementSpeedComponent* WeaponMovementSpeed; // 0x4c0
	UAkAudioEvent* MovementFoley; // 0x4c8
};

struct UDrenchComponent {
	bool bEnabled; // 0x1fc
	float FadeTime; // 0x200
	float HalfLife; // 0x204
	float MaxStrength; // 0x208
	float ScaleCurrentStrength; // 0x20c
	float ScaleIncomingStrength; // 0x210
	float EaseOutPower; // 0x214
	float MinDecayStrength; // 0x218
	float ReplacePct; // 0x21c
	float DecayDelay; // 0x220
	float UpdateDelta; // 0x224
	TMap<FGameplayTag, UMeshMaterialParamSet*> DrenchParams; // 0x228
	FDrenchReplicatedData IncomingDrench; // 0x278
};

struct UAkAndroidInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAndroidAdvancedInitializationSettings AdvancedSettings; // 0xc0
	FAkTRSPerPlatformSettings TRSSettings; // 0x100
};

struct AOnlineBeaconClient {
	AOnlineBeaconHostObject* BeaconOwner; // 0x2d0
	UNetConnection* BeaconConnection; // 0x2d8
	EBeaconConnectionState ConnectionState; // 0x2e0
};

struct ACameraShakeSourceActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x2a0
};

struct ASleeper_Projectile_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x798
	USphereComponent* AimAssistSphere; // 0x7a0
	UAimAssistTargetComponent* AimAssistTarget; // 0x7a8
	USphereComponent* CollisionHero; // 0x7b0
	UThreatComponent* Threat; // 0x7b8
	ASleeper_HeroGrappled_ScenarioActor_C* ScenarioActor; // 0x7c0
	bool TargetSnared; // 0x7c8
	AGobiCharacter* TargetCharacter; // 0x7d0
	UGameplayEffect* FriendlyFireImmunityGE; // 0x7d8
};

struct UAnimNotify_Detach {
	UAnimContext_Enemy* EnemyContextClass; // 0x40
};

struct UCurveFloat {
	FRichCurve FloatCurve; // 0x38
	bool bIsEventCurve; // 0xb8
};

struct UBTTask_NavigateTo {
	FAIDataProviderFloatValue AcceptableRadius; // 0xa0
	UNavigationQueryFilter* FilterClass; // 0xd8
	float ObservedBlackboardValueTolerance; // 0xe0
	char bAllowStrafe : 1; // 0xe4
	char bAllowPartialPath : 1; // 0xe4
	char bStopOnOverlap : 1; // 0xe4
	char bResetVelocityOnAbort : 1; // 0xe4
	char bObserveBlackboardValue : 1; // 0xe4
	bool bFailOnBetterClaim; // 0xe8
	bool bPursueTarget; // 0xe9
	FVector2D PursueTargetUpdateRate; // 0xec
	FAIDataProviderUObjectValue SteeringBehaviorDataProvider; // 0xf8
	FAIDataProviderUObjectValue SteeringControlDataProvider; // 0x130
};

struct ADrawbridge {
	USceneComponent* InternalRootComponent; // 0x2a0
	UStaticMeshComponent* BridgeStaticMeshComp; // 0x2a8
	UStaticMeshComponent* PulleyStaticMeshComp; // 0x2b0
	UStaticMeshComponent* PulleyRopeStaticMeshComp; // 0x2b8
	USkeletalMeshComponent* CrankSkeletalMeshComp; // 0x2c0
	UCableComponent* CrankPulleyCableComp; // 0x2c8
	UCableComponent* CrankBridgeCableComp; // 0x2d0
	USceneComponent* CableBridgeAttachPoint; // 0x2d8
	USceneComponent* CableCrankAttachPoint; // 0x2e0
	USceneComponent* CrankLocation; // 0x2e8
	UParticleSystemComponent* RopeParticleSystemComp; // 0x2f0
	UParticleSystemComponent* BridgeImpactParticleSystemComp; // 0x2f8
	UUsableComponent* UsableComponent; // 0x300
	UBoxComponent* UsableTriggerComponent; // 0x308
	UUsableHighlightComponent* UsableHighlightComp; // 0x310
	UGameplayEffectsComponent* GameplayEffectsComp; // 0x318
	UItemAkBankComponent* ItemAkBankComponent; // 0x320
	UAkComponent* PulleyAKComponent; // 0x328
	UAkComponent* CrankAKComponent; // 0x330
	UAkComponent* BridgeAKComponent; // 0x338
	UBoxComponent* StartLessonTriggerBox; // 0x340
	UGameCoachLessonsComponent* GameCoachLessonsComponent; // 0x348
	FMulticastInlineDelegate OnBridgeFullyLowered; // 0x350
	UAnimMontage* UseMontage3P; // 0x360
	FString TriggerHordeReason; // 0x368
	AActor* GobiNavModifierActor; // 0x378
	AAISpawnActorVolume* SpawnActorVolume; // 0x380
	FGameplayTag HordeBlockingTag; // 0x388
	float StartingBridgePitch; // 0x390
	float EndingBridgePitch; // 0x394
	float RopeBreakPct; // 0x398
	float RotationProgressMultiplier; // 0x39c
	float PulleyMultiplier; // 0x3a0
	float BridgeFallSpeedIncrease; // 0x3a4
	float MaxBridgeFallSpeed; // 0x3a8
	float MaxBridgeToolkitFallSpeed; // 0x3ac
	FWalkableSlopeOverride BridgeLoweredWalkableSlopeOverride; // 0x3b0
	TSet<TWeakObjectPtr<AActor>> ActorsToDestroyWhenLowered; // 0x3c0
	TArray<UMaterialInterface*> LoweredCrankMaterials; // 0x410
	float LessonDelay; // 0x420
	FGameplayTagContainer HighlightGameplayTagContainer; // 0x428
	FName CableScalarParameterName; // 0x448
	float CrankBridgeCableMultiplier; // 0x450
	float CrankPulleyCableMultiplier; // 0x454
	bool bHideCableWhenBridgeFalls; // 0x458
	bool bDetachFromEnd; // 0x459
	bool bShouldEnableCableCollision; // 0x45a
	float DeactivateCableCollisionCooldown; // 0x45c
	UAkAudioEvent* AKEPulleyLoop; // 0x460
	UAkAudioEvent* AKEPulleyLoopStop; // 0x468
	UAkAudioEvent* AKEHandleLoop; // 0x470
	UAkAudioEvent* AKEHandleLoopStop; // 0x478
	UAkAudioEvent* AKEBridgeCreakLoop; // 0x480
	UAkAudioEvent* AKEBridgeCreakLoopStop; // 0x488
	UAkAudioEvent* AKEBridgeSquealLoop; // 0x490
	UAkAudioEvent* AKEBridgeSquealLoopStop; // 0x498
	UAkAudioEvent* AKEBridgeSquealFall; // 0x4a0
	UAkAudioEvent* AKEBridgeImpact; // 0x4a8
	UAkAudioEvent* AKEToolkitBridgeImpact; // 0x4b0
	FGameplayTag TriggerHordeCue; // 0x4b8
	float BridgeMovementPct; // 0x4c0
};

struct UGobiSpectatorMovementComponent {
	USpringArmComponent* SpringArmComponent; // 0x190
	float GamepadLookHorzRate; // 0x1b8
	float GamepadLookVertRate; // 0x1bc
	float MouseLookHorzScale; // 0x1c0
	float MouseLookVertScale; // 0x1c4
	bool bAllowFirstPerson; // 0x1c8
	float AutoFollowPitchOffset; // 0x1cc
	float AutoFollowDelaySeconds; // 0x1d0
	float AutoFollowFadeoutSeconds; // 0x1d4
};

struct UDatasmithCineCameraActorTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x38
};

struct UBlackboardKeyType_String {
	FString StringValue; // 0x38
};

struct UGameplayEffectWeightedRandomItem {
	FGameplayTagContainer SupportedTags; // 0x238
	FGameplayTagContainer DisallowedTags; // 0x258
	bool bAddAttachments; // 0x278
	FGameplayTagContainer DisallowedAttachments; // 0x280
	int32_t MinAttachments; // 0x2a0
	int32_t MaxAttachments; // 0x2a4
};

struct UPoseAsset {
	FPoseDataContainer PoseContainer; // 0x88
	bool bAdditivePose; // 0x118
	int32_t BasePoseIndex; // 0x11c
	FName RetargetSource; // 0x120
};

struct UParticleModuleLocationSkelVertSurface {
	ELocationSkelVertSurfaceSource SourceType; // 0x38
	FVector UniversalOffset; // 0x3c
	char bUpdatePositionEachFrame : 1; // 0x48
	char bOrientMeshEmitters : 1; // 0x48
	char bInheritBoneVelocity : 1; // 0x48
	float InheritVelocityScale; // 0x4c
	FName SkelMeshActorParamName; // 0x50
	TArray<FName> ValidAssociatedBones; // 0x58
	char bEnforceNormalCheck : 1; // 0x68
	FVector NormalToCompare; // 0x6c
	float NormalCheckToleranceDegrees; // 0x78
	float NormalCheckTolerance; // 0x7c
	TArray<int32_t> ValidMaterialIndices; // 0x80
	char bInheritVertexColor : 1; // 0x90
	char bInheritUV : 1; // 0x90
	uint32_t InheritUVChannel; // 0x94
};

struct UGameplayTagsRndSelectionTrait {
	TArray<FGameplayTagSet> TagSets; // 0x30
	bool bAddAllTagSets; // 0x40
	float RandomChance; // 0x44
};

struct USubmixEffectReverbPreset {
	FSubmixEffectReverbSettings Settings; // 0xa4
};

struct UAITypePointCosts {
	TArray<FAITypeCost> Costs; // 0x38
};

struct UInheritableComponentHandler {
	TArray<FComponentOverrideRecord> Records; // 0x30
	TArray<UActorComponent*> UnnecessaryComponents; // 0x40
};

struct UNavLinkDefinition {
	TArray<FNavigationLink> Links; // 0x30
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x40
};

struct UMaterialParameterCollectionInstance {
	UMaterialParameterCollection* Collection; // 0x38
};

struct UEnvQueryTest_Project {
	FEnvTraceData ProjectionData; // 0x208
};

struct UTitanTongueComponent {
	ETitanTongueState State; // 0xe8
	AActor* TargetActor; // 0x140
	float PullSecs; // 0x148
	float GrabRange; // 0x14c
	float PullNearDist; // 0x150
	float PullFarDist; // 0x154
	TArray<UGameplayEffect*> GrabbedEffects; // 0x158
	float GrabSecs; // 0x168
	UBlendSpace1D* GrabBlendSpace; // 0x170
	float MissSecs; // 0x178
	UBlendSpace1D* MissBlendSpace; // 0x180
	UBlendSpace1D* PullBlendSpace; // 0x188
	UBlendSpace1D* ReleaseBlendSpace; // 0x190
	UAnimSequence* BiteAnimSequence; // 0x198
	UAnimSequence* EatAnimSequence; // 0x1a0
	FGameplayTag AttachComponentTag; // 0x1a8
	FName AttachBone; // 0x1b0
};

struct UDialogueEvaluatorTrigger {
	UGobiDialogueEvaluatorSet* EvalSet; // 0x50
	float TestInterval; // 0x58
	FName OnPassedEventName; // 0x5c
	FName OnContinueEventName; // 0x64
	FName OnFailedEventName; // 0x6c
	bool OwningCharacterAsEventTarget; // 0x74
	UGobiDialogueEvaluatorSet* ActiveEvalSet; // 0x78
};

struct UNiagaraRibbonRendererProperties {
	UMaterialInterface* Material; // 0x58
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x60
	ENiagaraRibbonFacingMode FacingMode; // 0x88
	float UV0TilingDistance; // 0x8c
	FVector2D UV0Scale; // 0x90
	FVector2D UV0Offset; // 0x98
	ENiagaraRibbonAgeOffsetMode UV0AgeOffsetMode; // 0xa0
	float UV1TilingDistance; // 0xa4
	FVector2D UV1Scale; // 0xa8
	FVector2D UV1Offset; // 0xb0
	ENiagaraRibbonAgeOffsetMode UV1AgeOffsetMode; // 0xb8
	ENiagaraRibbonDrawDirection DrawDirection; // 0xb9
	float CurveTension; // 0xbc
	ENiagaraRibbonTessellationMode TessellationMode; // 0xc0
	int32_t TessellationFactor; // 0xc4
	bool bUseConstantFactor; // 0xc8
	float TessellationAngle; // 0xcc
	bool bScreenSpaceTessellation; // 0xd0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xd8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x150
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x1c8
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x240
	FNiagaraVariableAttributeBinding RibbonTwistBinding; // 0x2b8
	FNiagaraVariableAttributeBinding RibbonWidthBinding; // 0x330
	FNiagaraVariableAttributeBinding RibbonFacingBinding; // 0x3a8
	FNiagaraVariableAttributeBinding RibbonIdBinding; // 0x420
	FNiagaraVariableAttributeBinding RibbonLinkOrderBinding; // 0x498
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x510
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x588
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x600
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x678
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x6f0
};

struct UDialogueSubsystem {
	UDialogueSystem* DialogueSystem; // 0x38
};

struct ABarbedWire_Planted {
	UGameplayEffectsComponent* GameplayEffectsComponent; // 0x2a0
	USceneComponent* InternalRootComponent; // 0x2a8
	UStaticMeshComponent* StaticMeshComponent; // 0x2b0
	UBoxComponent* BoxComponent; // 0x2b8
	UGameplayEffectEmitterComponent* GameplayEffectEmitterComponent; // 0x2c0
	UHealthComponent* HealthComponent; // 0x2c8
	UItemAudioComponent* ItemAudioComponent; // 0x2d0
	bool bShouldSpread; // 0x2d8
	float SpreadDistance; // 0x2dc
	FVector TraceOffset; // 0x2e0
	ECollisionChannel TraceChannel; // 0x2ec
};

struct UGobiPerformanceMetricTestController {
	AActor* CurrentActor; // 0x68
};

struct UTitanStage3TailComponent {
	ETitanStage3TailState State; // 0x100
	ETitanStage3TailThrashMode CurrentThrashMode; // 0x101
	FGameplayTag AttackVolumeTag; // 0x104
	TArray<UGameplayEffect*> ThrashGameplayEffects; // 0x110
	UAnimSequence* ThrashLeftAnimSequence; // 0x120
	UAnimSequence* ThrashRightAnimSequence; // 0x128
};

struct UMaterialExpressionArccosineFast {
	FExpressionInput Input; // 0x48
};

struct UChallengeObjectiveDamageDealtData {
	FGameplayTagQuery DamageTypeQuery; // 0x70
	int32_t IgnoreDamageContextFlags; // 0xb8
};

struct ASocialSpacePlayerController {
	FMulticastInlineDelegate OnSignedIn; // 0x8a0
	FMulticastInlineDelegate OnSignedOut; // 0x8b0
};

struct UNavigationQueryFilter {
	TArray<FNavigationFilterArea> Areas; // 0x30
	FNavigationFilterFlags IncludeFlags; // 0x40
	FNavigationFilterFlags ExcludeFlags; // 0x44
};

struct ASleeper {
	USceneComponent* SceneRoot; // 0x2a0
	USkeletalMeshComponent* PodMeshComponent; // 0x2a8
	USceneComponent* ProjectileSpawnLocation; // 0x2b0
	USphereComponent* SensorySphereComponent; // 0x2b8
	UPingableComponent* PingableComponent; // 0x2c0
	UHealthComponent* HealthComponent; // 0x2c8
	UGameplayEffectsComponent* GameplayEffectsComponent; // 0x2d0
	UGameplayTagsComponent* GameplayTagsComponent; // 0x2d8
	UThreatComponent* ThreatComponent; // 0x2e0
	float AggroTimeDelay; // 0x2e8
	float AttackAimConeAngleDegrees; // 0x2ec
	ASleeperProjectile* ProjectileClass; // 0x2f0
	float ProjectileSpeed; // 0x2f8
	float PredictiveAimingScalar; // 0x2fc
	float MinTargetLocationChangeForPredicitveAiming; // 0x300
	FGameplayTagQuery TargetValidTagQuery; // 0x308
	UParticleSystem* DeathVFX; // 0x350
	UAkAudioEvent* IdleLoopAudioEvent; // 0x358
	UAkAudioEvent* IdleLoopStopAudioEvent; // 0x360
	UAkAudioEvent* ReleaseAudioEvent; // 0x368
	UAkAudioEvent* IdleVOXAudioEvent; // 0x370
	FVector2D IdleVOXRate; // 0x378
	float ProjectileSpawnOffset; // 0x380
	FDataTableRowHandle SleeperBurstMusicStinger; // 0x388
	FMulticastInlineDelegate OnLaunch; // 0x3a8
	bool bLaunched; // 0x3b8
	ASleeperProjectile* LiveProjectile; // 0x3c0
	TWeakObjectPtr<AGobiCharacter> AttackTarget; // 0x3fc
};

struct UGameplayEffectAdjustContinues {
	EAdjustContinuesMode Mode; // 0x238
	int32_t Adjustment; // 0x23c
};

struct UInventoryComponent {
	TMap<EEquipmentSlot, float> LastConsumableActivations; // 0x130
	FMulticastInlineDelegate OnAddRemoveItemServer; // 0x180
	FMulticastInlineDelegate OnDroppedItem; // 0x190
	FMulticastInlineDelegate OnSelectedItemChanged; // 0x1a0
	FMulticastInlineDelegate OnUtilityItemApplied; // 0x1b0
	FMulticastInlineDelegate OnCurrencyChanged; // 0x1c0
	FMulticastInlineDelegate OnCurrencyChangedDetailed; // 0x1d0
	FMulticastInlineDelegate OnAdjustCurrency; // 0x1f8
	FMulticastInlineDelegate OnItemUseFailed; // 0x208
	FMulticastInlineDelegate OnConsumableSlotSelected; // 0x218
	FMulticastInlineDelegate EquipmentSlotChanged; // 0x228
	EEquipmentSlot InputSelectedSlot; // 0x300
	TArray<AItem*> EquipmentSlots; // 0x308
	int32_t PostRoundBonusCurrency; // 0x318
	int32_t Currency; // 0x31c
	TWeakObjectPtr<APlayerState> LootingPlayerState; // 0x320
	AItemPickup* DeathItemContainer; // 0x328
	TArray<EEquipmentSlot> SelectableEquipmentSlots; // 0x330
	TArray<FDataTableRowHandle> PerkItems; // 0x340
	FGameplayTagContainer ItemsDisabledTags; // 0x350
	FGameplayTagContainer ItemsDisabledInstantTags; // 0x378
	FGameplayTagContainer PrimaryWeaponDisabledTags; // 0x398
	FGameplayTagContainer SecondaryWeaponDisabledTags; // 0x3b8
	FGameplayTag IsOnLadderTag; // 0x3d8
	AItem* SelectedItemActor; // 0x3e0
	AItem* MoveTickSelectedActor; // 0x3e8
	UGameplayTagsComponent* GameplayTagsComponent; // 0x3f0
	ULifeStateComponent* LifeStateComponent; // 0x3f8
	UGobiPlayerMovementComponent* GobiPlayerMovementComponent; // 0x400
	APawn* OwnerPawn; // 0x408
	FAmmoReserve AmmoReserves[0x7]; // 0x410
	AItem* ServerSelectionActor; // 0xb48
	char ServerSelectionParity; // 0xb51
	UAkAudioEvent* LowAmmoEffectAudioCue; // 0xba8
	FGameplayTag LowAmmoEffectScreenEffectCue; // 0xbb0
	TArray<FCurrencyReward> CurrencyRewardEntries; // 0xbb8
};

struct URichTextBlockImageDecorator {
	UDataTable* ImageSet; // 0x30
};

struct UAkLuminInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
	FAkTRSPerPlatformSettings TRSSettings; // 0xf8
};

struct UParticleModuleMeshRotationRate {
	FRawDistributionVector StartRotationRate; // 0x38
};

struct UNiagaraPreviewAxis_InterpParamVector4 {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct UTextBlockWidgetStyle {
	FTextBlockStyle TextBlockStyle; // 0x38
};

struct UGizmoBaseComponent {
	FLinearColor Color; // 0x4b0
	float HoverSizeMultiplier; // 0x4c0
	float PixelHitDistanceThreshold; // 0x4c4
};

struct UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnPlay; // 0x410
	FMulticastInlineDelegate OnPlayReverse; // 0x420
	FMulticastInlineDelegate OnStop; // 0x430
	FMulticastInlineDelegate OnPause; // 0x440
	FMulticastInlineDelegate OnFinished; // 0x450
	EMovieScenePlayerStatus Status; // 0x460
	char bReversePlayback : 1; // 0x464
	UMovieSceneSequence* Sequence; // 0x468
	FFrameNumber StartTime; // 0x470
	int32_t DurationFrames; // 0x474
	int32_t CurrentNumLoops; // 0x478
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x490
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x4a8
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x830
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x840
};

struct UGameplayCardTravelSubsystem {
	FGameplayCardTravelData TravelData; // 0x38
};

struct USoundSubmixWithParentBase {
	USoundSubmixBase* ParentSubmix; // 0x40
};

struct UMaterialExpressionParticleSubUV {
	char bBlend : 1; // 0xd8
};

struct UParticleModuleEventGenerator {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x38
};

struct UVariantObjectBinding {
	FString CachedActorLabel; // 0x30
	FSoftObjectPath ObjectPtr; // 0x40
	LazyObjectProperty LazyObjectPtr; // 0x58
	TArray<UPropertyValue*> CapturedProperties; // 0x78
	TArray<FFunctionCaller> FunctionCallers; // 0x88
};

struct UHealthPipUserWidget {
	UMaterialInstanceDynamic* MaterialInstance; // 0x458
	float Health; // 0x460
	float HealingHealth; // 0x464
	float TempHealth; // 0x468
	float MaxHealth; // 0x46c
	float CurWidth; // 0x470
	FName HealthBaxMaxDamageMaterialName; // 0x474
	FName HealthBaxMaxDamageColorGroup; // 0x47c
	FName HealthBaxTraumaMaterialName; // 0x484
	FName HealthBaxTraumaColorGroup; // 0x48c
};

struct UCurveLinearColorAtlas {
	uint32_t TextureSize; // 0xf0
	TArray<UCurveLinearColor*> GradientCurves; // 0xf8
};

struct ULodClipboardContent {
	FRawLodInfo LODInfo; // 0x30
};

struct UEnvQueryContext_ScenarioData {
	FGameplayTag ScenarioTag; // 0x30
};

struct AGameDirectorDebugger {
	TArray<FHeroContext> HeroSpawnContexts; // 0x2a0
	bool bAllHerosPreparing; // 0x2b0
	float GameIntensity; // 0x2b4
	float GameIntensityRate; // 0x2b8
	uint32_t GameThreatLevel; // 0x2bc
	int32_t TotalAICount; // 0x2c0
	int32_t TotalAggroAICount; // 0x2c4
	int32_t TotalPointBudget; // 0x2c8
	int32_t NumPlayersOnNav; // 0x2cc
	int32_t NumNavmeshes; // 0x2d0
	int32_t NumPlayersOnObjectiveDMap; // 0x2d4
	bool bHasValidObjective; // 0x2d8
	int32_t NumSpawnersByPlayers; // 0x2dc
	TArray<FName> ActiveScenarios; // 0x2e0
	TArray<FString> ActiveScenarioDetails; // 0x2f0
	TArray<float> ActiveScenarioSpawnerSuccessRate; // 0x300
	TArray<FName> DormantScenarios; // 0x310
	TArray<FAISpawnActorDebugInfo> SpawnActorDebug; // 0x320
	float RecycleDistance; // 0x330
	float DistanceAdvancedAfterHorde; // 0x334
	float CurrentObjectiveDistance; // 0x338
	float ObjectiveSearchDistance; // 0x33c
	FVector ObjectiveLocation; // 0x340
	EPacingPhase PacingPhase; // 0x34c
	FName PhaseHolder; // 0x350
	float RemainingPhaseTime; // 0x358
	uint32_t HeroSpawnIdx; // 0x35c
	TArray<FVector> GreySpawners; // 0x360
	TArray<FVector> RedSpawners; // 0x370
	TArray<FVector> GreenSpawners; // 0x380
	TArray<FVector> CyanSpawners; // 0x390
	TArray<FVector> OrangeSpawners; // 0x3a0
	TArray<FVector> YellowSpawners; // 0x3b0
};

struct UAssetManager {
	TArray<UObject*> ObjectReferenceList; // 0x2c8
	bool bIsGlobalAsyncScanEnvironment; // 0x2d8
	bool bShouldGuessTypeAndName; // 0x2d9
	bool bShouldUseSynchronousLoad; // 0x2da
	bool bIsLoadingFromPakFiles; // 0x2db
	bool bShouldAcquireMissingChunksOnLoad; // 0x2dc
	bool bOnlyCookProductionAssets; // 0x2dd
	bool bIsBulkScanning; // 0x2de
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2df
	bool bIsManagementDatabaseCurrent; // 0x2e0
	bool bUpdateManagementDatabaseAfterScan; // 0x2e1
	bool bIncludeOnlyOnDiskAssets; // 0x2e2
	int32_t NumberOfSpawnedNotifications; // 0x2e4
};

struct UGobiCameraShake {
	UCurveFloat* OscillationBlendCurve; // 0x168
};

struct UInteractiveGizmo {
	UInputBehaviorSet* InputBehaviors; // 0x38
};

struct UAIScriptingComponent {
	FMulticastInlineDelegate OnSenseUnWatched; // 0xe8
	FMulticastInlineDelegate OnSensedWhizBy; // 0xf8
	FMulticastInlineDelegate OnAlertedChanged; // 0x108
	FMulticastInlineDelegate OnEnemyChanged; // 0x118
	FMulticastInlineDelegate OnHideFromHordesChanged; // 0x128
	AActor* CachedEnemy; // 0x138
	UBlackboardData* BlackboardAsset; // 0x140
	FBlackboardKeySelector AlertToLocationBBKey; // 0x148
	FBlackboardKeySelector PseudoAlertToLocationBBKey; // 0x170
	FBlackboardKeySelector RetreatLocationBBKey; // 0x198
	FBlackboardKeySelector AmbushLocationBBKey; // 0x1c0
	FBlackboardKeySelector WanderLocationBBKey; // 0x1e8
	FBlackboardKeySelector IsHordingBBKey; // 0x210
	FBlackboardKeySelector EnemyBBKey; // 0x238
	FBlackboardKeySelector HighPrioritySmartActorBBKey; // 0x260
	FBlackboardKeySelector LowPrioritySmartActorBBKey; // 0x288
	FBlackboardKeySelector ReachInSmartActorBBKey; // 0x2b0
	FBlackboardKeySelector WallClingActorBBKey; // 0x2d8
	FBlackboardKeySelector CanTriggerAttackBBKey; // 0x300
	FBlackboardKeySelector CanTriggerAttackIgnoreEnabledBBKey; // 0x328
	FBlackboardKeySelector IsDeadBBKey; // 0x350
	FBlackboardKeySelector HealthBBKey; // 0x378
	FBlackboardKeySelector ScriptSplineBBKey; // 0x3a0
	FBlackboardKeySelector HideFromHordesBBKey; // 0x3c8
	FBlackboardKeySelector ShouldHideBBKey; // 0x3f0
	FBlackboardKeySelector AttackLocationBBKey; // 0x418
	FVector DefaultExtents; // 0x440
};

struct APVPClassicGameMode {
	float ZombieRelocateOnDistanceFromHeroes; // 0x5a8
	int32_t MaxDistancePointsToObjective; // 0x5ac
	float ExpGrowthFactor; // 0x5b0
	float BonusScoreForRemainingCapable; // 0x5b4
	FGameplayTagQuery HasBeenIncapacitatedQuery; // 0x5b8
	float DistanceTraveledUpdateInterval; // 0x600
};

struct UAISense_Touch {
	TArray<FAITouchEvent> RegisteredEvents; // 0x88
};

struct UMessagePopupUserWidget {
	TSoftClassPtr<UObject> ButtonClass; // 0x498
};

struct ASleeper_AICharacterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1330
	UHealthBarComponent* HealthBar; // 0x1338
	UInfectedHighlightComponent* InfectedHighlight; // 0x1340
	UEnemyAudioComponent_BP_C* EnemyAudioComponent_BP; // 0x1348
	AItemPickupBase_BP_C* LootContainer; // 0x1350
	AActor* LootContainerClass; // 0x1358
	float AttackRadius; // 0x1360
	float ThreatReactThresholdTime; // 0x1364
	AActor* SleeperPod; // 0x1368
	bool IsActiveSleeper; // 0x1370
	float InactiveMaxHealth; // 0x1374
	UThreatComponent* ThreatComponent; // 0x1378
	ASleeper_HeroGrappled_ScenarioActor_C* ScenarioActor; // 0x1380
	int32_t NewVar_1; // 0x1388
	FVector SpawnOffset; // 0x138c
};

struct UMovieSceneGeometryCollectionSection {
	FMovieSceneGeometryCollectionParams Params; // 0xe8
};

struct UPreviewMeshCollection {
	USkeleton* Skeleton; // 0x40
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x48
};

struct UMicroManagerSubsystem {
	TMap<UMicroManager*, UMicroManager*> ManagerMap; // 0x38
};

struct ULevelStreamingDynamic {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
	char bReloadOnSoftReset : 1; // 0x14c
	char bDefaultSpawnLevel : 1; // 0x14c
};

struct ACameraRig_Rail {
	float CurrentPositionOnRail; // 0x2a0
	bool bLockOrientationToRail; // 0x2a4
	USceneComponent* TransformComponent; // 0x2a8
	USplineComponent* RailSplineComponent; // 0x2b0
	USceneComponent* RailCameraMount; // 0x2b8
};

struct UBlackboardKeyType_Object {
	UObject* BaseClass; // 0x38
};

struct UInterpTrackEvent {
	TArray<FEventTrackKey> EventTrack; // 0x78
	char bFireEventsWhenForwards : 1; // 0x88
	char bFireEventsWhenBackwards : 1; // 0x88
	char bFireEventsWhenJumpingForwards : 1; // 0x88
	char bUseCustomEventName : 1; // 0x88
};

struct USkeletalMeshLODSettings {
	FPerPlatformInt MinLOD; // 0x38
	FPerPlatformBool DisableBelowMinLodStripping; // 0x3c
	FPerPlatformBool bSupportLODStreaming; // 0x3d
	FPerPlatformInt MaxNumStreamedLODs; // 0x40
	FPerPlatformInt MaxNumOptionalLODs; // 0x44
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x48
};

struct AHero_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x16d0
	UCameraViewModifierComponent* CameraViewModifier; // 0x16d8
	UModifyViewComponent* ModifyView; // 0x16e0
	UDrench_Component_Hero_BP_C* Drench; // 0x16e8
	USkeletalMeshComponent* ThirdPersonLegsMesh; // 0x16f0
	USkeletalMeshComponent* ThirdPersonHeadMesh; // 0x16f8
	UAttachableComponent* Attachable; // 0x1700
	UTRSEventTrigger_BP_C* TRSEventTrigger_BP; // 0x1708
	UFlashlightPoseComponent* FlashlightPose1; // 0x1710
	UHeroDialogue_BP_C* HeroDialogue_BP; // 0x1718
	UStumbleComponent* Stumble; // 0x1720
	UGrappleComponent* Grapple; // 0x1728
	UHeroFacialAnimationComponent* HeroFacialAnimation; // 0x1730
	UPhysicalAnimationComponent* PhysicalAnimation; // 0x1738
	UHeroGameCoachLessons_BP_C* HeroGameCoachLessons; // 0x1740
	UHealthHitMarkerComponent* HealthHitMarker; // 0x1748
	UDamageFilterComponent* DamageFilterComponent; // 0x1750
	UKillHandlerComponent* KillHandler; // 0x1758
	UFlashBangReceiver_BP_C* FlashBangReceiver_BP; // 0x1760
	UMountedWeaponInteractComponent* MountedWeaponInteract; // 0x1768
	UPingableComponent* Pingable; // 0x1770
	UFlashlightPoseComponent* FlashlightPose; // 0x1778
	UHeroHighlight_BP_C* HeroHighlight_BP; // 0x1780
	UMantleComponent* Mantle; // 0x1788
	UGameplayContextComponent* GameplayContext; // 0x1790
	USceneComponent* CameraRoot; // 0x1798
	UCameraComponent* ThirdPersonCamera; // 0x17a0
	UCameraComponent* FirstPersonCamera; // 0x17a8
	UFPRigSkeletalMeshComponent* FirstPersonArms; // 0x17b0
	USpringArmComponent* FirstPersonSpringArm; // 0x17b8
	USpringArmComponent* ThirdPersonSpringArm; // 0x17c0
	UPlayerStaminaComponent* PlayerStamina; // 0x17c8
	UPlayerSprintComponent* PlayerSprint; // 0x17d0
	UPlayerAimAssistComponent* PlayerAimAssist; // 0x17d8
	UMoveIgnoreActorsComponent* MoveIgnoreActors; // 0x17e0
	UIncapUsable_BP_C* IncapUsable_BP; // 0x17e8
	UPerkComponent* PerkComponent; // 0x17f0
	UPlayHitReactionComponent* PlayHitReaction; // 0x17f8
	UCapsuleComponent* Player_Damage_Capsule; // 0x1800
	UHealthComponent* Health; // 0x1808
	UHeroLightComponent* FlashlightManager; // 0x1810
	ULedgeHangUsable_BP_C* LedgeHangUsable_BP; // 0x1818
	UPlayerMovementDebugComponent* PlayerMovementDebug; // 0x1820
	UHeroLifeStateComponent_BP_C* HeroLifeStateComponent_BP; // 0x1828
	USpotLightComponent* GrappleSpotLight; // 0x1830
	UDistanceMapSourceComponent* DistanceMapSource; // 0x1838
	UCapsuleComponent* IncapUseVolume; // 0x1840
	UHeroUseComponent* HeroUse; // 0x1848
	UGameplayEffectsComponent* GameplayEffects; // 0x1850
	UHitMarkerComponent* HitMarker; // 0x1858
	UHeroAudioComponent_BP_C* HeroAudioComponent_BP; // 0x1860
	UPlayerViewComponent* HeroView; // 0x1868
	UInventoryComponent* Inventory; // 0x1870
	FMulticastInlineDelegate Callback_OnJumped; // 0x1878
	FMulticastInlineDelegate Callback_OnLanded; // 0x1888
	float AlertCommons_Radius; // 0x1898
};

struct UParticleModuleKillBox {
	FRawDistributionVector LowerLeftCorner; // 0x38
	FRawDistributionVector UpperRightCorner; // 0x80
	char bAbsolute : 1; // 0xc8
	char bKillInside : 1; // 0xc8
	char bAxisAlignedAndFixedSize : 1; // 0xc8
};

struct UAnimEvalSet_Climb {
	FGameplayEval_IsNavLinkNext IsNavLinkNext; // 0xc0
	FAnimEval_Climb ClimbLinkEval; // 0x108
	float MaxStartingDistance; // 0x170
	float ClimbUp; // 0x174
	float TopDistance; // 0x178
	float ClimbDown; // 0x17c
	TArray<UNavArea*> ClimbNavAreas; // 0x180
	bool bNeedsClearPathToLinkStart; // 0x190
};

struct UBTService_TeamSensor {
	FGameplayTagQuery AllowSensorTagQuery; // 0x78
	FGameplayTagQuery TeammateTagQuery; // 0xc0
	FBlackboardKeySelector TeammateTargetBBKey; // 0x108
	FBlackboardKeySelector TeammateDistBBKey; // 0x130
	FBlackboardKeySelector ShouldTeamTeleportBBKey; // 0x158
	FBlackboardKeySelector TeamCentroidBBKey; // 0x180
};

struct UEnvQueryTest_NotAggroOrOld {
	float OldThreshold; // 0x208
};

struct UPrespawnComponent {
	FPreSpawnInfo PreSpawnInfo; // 0xf0
	AActor* PreSpawnActorClass; // 0x140
	USkeletalMeshComponent* PreSpawnSKMComp; // 0x148
};

struct UBTDecorator_CanEnterBruteState {
	EBruteState State; // 0x70
	float FlowControlDelay; // 0x74
};

struct UVendorSubcategoryUserWidget {
	FMulticastInlineDelegate OnItemFocusReceived; // 0x458
	FMulticastInlineDelegate OnItemFocusLost; // 0x468
	FMulticastInlineDelegate OnItemClicked; // 0x478
};

struct UHagAnimInstance {
	FHagAnimState HagAnimState; // 0x7f8
};

struct UGameplayContextComponent {
	TArray<UGameplayContext*> Contexts; // 0xe8
	FRepContextLocation RepContextLocation; // 0x148
	FRepContextRotation RepContextRotation; // 0x160
	TArray<UGameplayContext*> InitialContexts; // 0x178
};

struct UProjectileSprayComponent {
	FMulticastInlineDelegate OnSprayEnded; // 0x1d8
	FProjectileSprayConfig SprayConfig; // 0x1e8
	FProjectileSprayMoveTickData MoveTickData; // 0x328
	TArray<UProjectileSimple*> Projectiles; // 0x338
	FVector SprayTarget; // 0x3d4
};

struct UTestMovieSceneSequence {
	UMovieScene* MovieScene; // 0x350
};

struct UWaterRipplerComponent {
	UWaterRipplerDef* RipplerDefinition; // 0x230
	AWaterVolume* WaterVolume; // 0x238
	FWaterRipplerRuntime RuntimeData; // 0x240
};

struct UEnvQueryTest_EnemyClaim {
	FAIDataProviderIntValue InitialEnemyMaxDP; // 0x208
	FAIDataProviderFloatValue ClaimRadiusDP; // 0x240
};

struct UParticleModuleAcceleration {
	FRawDistributionVector Acceleration; // 0x40
	char bApplyOwnerScale : 1; // 0x88
};

struct UActivitySubsystem {
	bool bEnabledForPlatform; // 0x38
};

struct UBTService_BlueprintBase {
	AAIController* AIOwner; // 0x78
	AActor* ActorOwner; // 0x80
	char bShowPropertyDetails : 1; // 0x98
	char bShowEventDetails : 1; // 0x98
};

struct ANavigationObjectBase {
	UCapsuleComponent* CapsuleComponent; // 0x2a8
	UBillboardComponent* GoodSprite; // 0x2b0
	UBillboardComponent* BadSprite; // 0x2b8
	char bIsPIEPlayerStart : 1; // 0x2c0
};

struct ABirdSystem {
	bool bBirdSystemEnabled; // 0x2a8
	bool bNetworked; // 0x2a9
	bool bControlledByMicroManager; // 0x2aa
	uint32_t SupportedGameModes; // 0x2ac
	int32_t BirdCount; // 0x2b0
	FVector2D InitialLocation; // 0x2b4
	FVector2D HoverRadius; // 0x2bc
	int32_t CircleCount; // 0x2c4
	int32_t SplinePointCount; // 0x2c8
	float SplineRadius; // 0x2cc
	bool bLandSameSiteAllowed; // 0x2d0
	EBirdAfterInitialFlight InitialFlightOption; // 0x2d1
	TArray<ABird*> ActorTypes; // 0x2d8
	TArray<ABirdSite*> Sites; // 0x2e8
	ABirdSite* StartSite; // 0x398
	TArray<ABird*> BirdActors; // 0x3a0
	TArray<USplineComponent*> Splines; // 0x3b0
	TArray<int8_t> BirdSpawns; // 0x3c0
	TArray<FBirdInfo> BirdInfos; // 0x3d0
};

struct UGameplayAction_BotInteractUse {
	UUsableComponent* UsableComponentClass; // 0x210
	UAnimContext_Actor* InteractContext; // 0x218
	UGameplayEvaluatorSet* FilterSet; // 0x220
};

struct UTweenVector {
	FMulticastInlineDelegate OnTweenStart; // 0xb0
	FMulticastInlineDelegate OnTweenUpdate; // 0xc0
	FMulticastInlineDelegate OnTweenEnd; // 0xd0
	FMulticastInlineDelegate OnTweenActorHit; // 0xe0
	FMulticastInlineDelegate OnTweenActorBeginOverlap; // 0xf0
	FMulticastInlineDelegate OnTweenPrimitiveComponentHit; // 0x100
	FMulticastInlineDelegate OnTweenPrimitiveComponentBeginOverlap; // 0x110
};

struct ABaseGun_Static_BP_C {
	UStaticMeshComponent* SightMesh_3P; // 0x508
	UStaticMeshComponent* BarrelMesh_3P; // 0x510
	UStaticMeshComponent* BaseStaticMesh_3P; // 0x518
};

struct UDebugCameraControllerSettings {
	TArray<FDebugCameraControllerSettingsViewModeIndex> CycleViewModes; // 0x40
};

struct UMaterialExpressionStaticBool {
	char Value : 1; // 0x48
};

struct UBot_DeathReaction_GA_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x210
};

struct UParticleModuleCollision {
	FRawDistributionVector DampingFactor; // 0x38
	FRawDistributionVector DampingFactorRotation; // 0x80
	FRawDistributionFloat MaxCollisions; // 0xc8
	EParticleCollisionComplete CollisionCompletionOption; // 0xf8
	TArray<EObjectTypeQuery> CollisionTypes; // 0x100
	char bApplyPhysics : 1; // 0x118
	char bIgnoreTriggerVolumes : 1; // 0x118
	FRawDistributionFloat ParticleMass; // 0x120
	float DirScalar; // 0x150
	char bPawnsDoNotDecrementCount : 1; // 0x154
	char bOnlyVerticalNormalsDecrementCount : 1; // 0x154
	float VerticalFudgeFactor; // 0x158
	FRawDistributionFloat DelayAmount; // 0x160
	char bDropDetail : 1; // 0x190
	char bCollideOnlyIfVisible : 1; // 0x190
	char bUnstickInitialHits : 1; // 0x190
	char bIgnoreSourceActor : 1; // 0x190
	float MaxCollisionDistance; // 0x194
};

struct UAkXSXInitializationSettings {
	FAkCommonInitializationSettings CommonSettings; // 0x30
	FAkXSXApuHeapInitializationSettings ApuHeapSettings; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkXSXAdvancedInitializationSettings AdvancedSettings; // 0xc0
	FAkTRSPerPlatformSettings TRSSettings; // 0xfc
};

struct UDialogueResponseSet {
	TMap<FName, FDialogueResponse> Responses; // 0x38
};

struct UEditableTextBoxWidgetStyle {
	FEditableTextBoxStyle EditableTextBoxStyle; // 0x38
};

struct UTextureRenderTarget {
	float TargetGamma; // 0xc0
};

struct UParticleModuleRotationRateMultiplyLife {
	FRawDistributionFloat LifeMultiplier; // 0x38
};

struct UGameplayEffectReloadComponent {
	FGamePropertyFloatMod ReloadSpeedScaleMod; // 0x250
	TArray<UGameplayEffect*> PowerReloadEffects; // 0x260
	TArray<UGameplayEffect*> PowerReloadPlayerEffects; // 0x270
};

struct ULightmappedSurfaceCollection {
	UModel* SourceModel; // 0x30
	TArray<int32_t> Surfaces; // 0x38
};

struct UInterpGroup {
	TArray<UInterpTrack*> InterpTracks; // 0x38
	FName GroupName; // 0x48
	FColor GroupColor; // 0x50
	char bCollapsed : 1; // 0x54
	char bVisible : 1; // 0x54
	char bIsFolder : 1; // 0x54
	char bIsParented : 1; // 0x54
	char bIsSelected : 1; // 0x54
};

struct UTRSAudioDebugger {
	UWorld* World; // 0x30
};

struct UGameplayAction_SmartActor {
	UPlayMontageAndWaitProxy* PlayAndWaitProxy; // 0x218
	UAnimMontage* ChosenMontage; // 0x220
	TArray<UAnimMontage*> Montages; // 0x228
	bool bDeactivateOnBlendOut; // 0x238
	FVector2D PlayRateRange; // 0x23c
	UGameplayEffect* SmartActorCooldownEffect; // 0x248
};

struct UWallGrabTrait {
	FWallGrabConfig Config; // 0x30
	UWallGrabComponent* WallGrabComponentClass; // 0x188
};

struct UGameplayEffectAudio {
	TArray<UAkAudioEvent*> StartAkAudioEvents; // 0x238
	TArray<UAkAudioEvent*> StopAkAudioEvents; // 0x248
	bool bLocallyControlledOnly; // 0x258
	bool bPostAtLocation; // 0x259
};

struct USignInScreen {
	FMulticastInlineDelegate OnPlayerSignedIn; // 0x560
	FSignInFailedPopupData MatchmakingFailedPopupData; // 0x570
	UAkAudioEvent* RoboSignInKBMAudio; // 0x5e8
	UAkAudioEvent* RoboSignInPSAudio; // 0x5f0
	UAkAudioEvent* RoboSignInSteamContAudio; // 0x5f8
	UAkAudioEvent* RoboSignInSwitchAudio; // 0x600
	UAkAudioEvent* RoboSignInXboxAudio; // 0x608
	UAkAudioEvent* RoboSignInStopAudio; // 0x610
	UMatchmaking* Matchmaking; // 0x640
};

struct UAISenseConfig_Sight {
	UAISense_Sight* Implementation; // 0x50
	float SightRadius; // 0x58
	float LoseSightRadius; // 0x5c
	float PeripheralVisionAngleDegrees; // 0x60
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x64
	float AutoSuccessRangeFromLastSeenLocation; // 0x68
};

struct UBTTask_RunBehaviorDynamic {
	FGameplayTag InjectionTag; // 0x78
	UBehaviorTree* DefaultBehaviorAsset; // 0x80
	UBehaviorTree* BehaviorAsset; // 0x88
};

struct UGizmoLocalFloatParameterSource {
	float Value; // 0x50
	FGizmoFloatParameterChange LastChange; // 0x54
};

struct USkeletalBodySetup {
	bool bSkipScaleFromAnimation; // 0x258
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x260
};

struct ATemplateSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x2a8
	UTemplateSequencePlayer* SequencePlayer; // 0x2c0
	FSoftObjectPath TemplateSequence; // 0x2c8
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x2e0
};

struct UMaterialExpressionMaterialFunctionCall {
	UMaterialFunctionInterface* MaterialFunction; // 0x48
	FMaterialParameterInfo FunctionParameterInfo; // 0x50
};

struct ACableFerry {
	EFerryState CurrentFerryState; // 0x2a0
	AGobiGameStateBase* GobiGameState; // 0x2c8
	USceneComponent* DefaultSceneRoot; // 0x2d0
	UStaticMeshComponent* Ferry; // 0x2d8
	UStaticMeshComponent* FerryMotor; // 0x2e0
	UCableComponent* FerryMotorCable1; // 0x2e8
	UCableComponent* FerryMotorCable2; // 0x2f0
	USceneComponent* IntactFerryRoot; // 0x2f8
	USceneComponent* BrokenFerryRoot; // 0x300
	UBoxComponent* UsableVolume; // 0x308
	UBoxComponent* DamageVolume; // 0x310
	UBoxComponent* PushbackVolume; // 0x318
	UBoxComponent* KnockbackVolume; // 0x320
	TArray<UBoxComponent*> ZombieBlockVolumes; // 0x328
	UBoxComponent* PlayerCheckerVolume; // 0x338
	UBoxComponent* NavModifierVolume; // 0x340
	USplineComponent* FerryTravelSpline; // 0x348
	UUsableComponent* UsableComp; // 0x350
	UUsableComponent* NotUsableComp; // 0x358
	UHealthComponent* HealthComp; // 0x360
	UGobiNavModifierComponent* GobiNavModifierComp; // 0x368
	UUsableHighlightComponent* UsableHighlightComp; // 0x370
	UGameplayEffectsComponent* GameplayEffectsComp; // 0x378
	TArray<UStaticMeshComponent*> IntactFerry; // 0x380
	TArray<UStaticMeshComponent*> IntactFerryMotor; // 0x390
	TArray<UStaticMeshComponent*> BrokenFerry; // 0x3a0
	TArray<UStaticMeshComponent*> BrokenFerryMotor; // 0x3b0
	TArray<AHeroCharacter*> PlayersInVolume; // 0x3c0
	TArray<FName> HeroAttachmentLocations; // 0x3d0
	TArray<FName> FerryHitLocations; // 0x3e0
	AActor* ThreatActorClassForBigObjects; // 0x3f0
	TArray<AActor*> SpawnThreatActors; // 0x3f8
	FGameplayTag FerrySceneComponentTag; // 0x408
	bool bRequiresAllPlayersForUse; // 0x410
	float PushbackDelay; // 0x414
	float PushbackCooldown; // 0x418
	float PushbackHeroDamage; // 0x41c
	float PushbackZombieDamage; // 0x420
	float IncapCameraCollisionDisableTime; // 0x424
	bool bKillPlayerIncappedByFerry; // 0x428
	float KnockbackImpulseStrength; // 0x42c
	float KnockbackDuration; // 0x430
	float KnockbackGravityScalar; // 0x434
	UGobiDamageType* PushbackDamageType; // 0x438
	EPhysicalSurface PushbackDamagePhysicalSurface; // 0x440
	TMap<AGobiCharacter*, float> PushbackTargets; // 0x448
	FGameplayTagQuery SpeedAdjustTargetQuery; // 0x498
	FGameplayTagContainer SpeedAdjustTagsToRemove; // 0x4e0
	FGameplayTagContainer SpeedAdjustTagsToAdd; // 0x500
};

struct UGlobalAssetLoaderV2 {
	UDataTable* GlobalAssetTable; // 0x30
	TArray<UAssetTable*> RequestedAssetTables; // 0x38
	TArray<UAssetTable*> LoadedAssetTables; // 0x48
};

struct UVisibilityNavMapQueryFilter {
	float VisibilityCountInfluence; // 0x50
	float PartialVisibilityScalar; // 0x54
};

struct ADefaultPawn {
	float BaseTurnRate; // 0x2f8
	float BaseLookUpRate; // 0x2fc
	UPawnMovementComponent* MovementComponent; // 0x300
	USphereComponent* CollisionComponent; // 0x308
	UStaticMeshComponent* MeshComponent; // 0x310
	char bAddDefaultMovementBindings : 1; // 0x318
};

struct UAISenseEvent_TRSHearing {
	FAITRSNoiseEvent Event; // 0x30
};

struct UGameplayTasksComponent {
	char bIsNetDirty : 1; // 0xf4
	TArray<UGameplayTask*> SimulatedTasks; // 0xf8
	TArray<UGameplayTask*> TaskPriorityQueue; // 0x108
	TArray<UGameplayTask*> TickingTasks; // 0x128
	TArray<UGameplayTask*> KnownTasks; // 0x138
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x148
};

struct UAnimEvalSet_ItemStanceHitDirection_C {
	FGameplayEval_SelectedItemAnimationStance ItemStance; // 0xc0
	FGameplayEval_Angle HitDirection; // 0x110
};

struct UColorBlindOutlineHighlightData {
	TMap<EColorBlindMode, FHighlightPalette> OutlinePalettes; // 0x38
};

struct UCommon_LocoBase_ABP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x370
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x398
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x410
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x440
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x4b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x4e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x510
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x538
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x560
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x588
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x5b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x5d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_18; // 0x688
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_16; // 0x818
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_19; // 0x8a0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_17; // 0x940
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_15; // 0xad0
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_18; // 0xb58
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_16; // 0xbf8
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_14; // 0xd88
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_17; // 0xe10
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_15; // 0xeb0
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_13; // 0x1040
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_16; // 0x10c8
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x1168
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_14; // 0x1198
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_12; // 0x1328
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_13; // 0x13b0
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_11; // 0x1540
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_12; // 0x15c8
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_10; // 0x1758
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_11; // 0x17e0
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_9; // 0x1970
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_15; // 0x19f8
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_14; // 0x1a98
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_13; // 0x1b38
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x1bd8
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_12; // 0x1c88
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1d28
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_28; // 0x1d58
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_27; // 0x1dc8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_26; // 0x1e38
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_25; // 0x1ea8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x1f18
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_24; // 0x1fc8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_23; // 0x2038
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_22; // 0x20a8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_21; // 0x2118
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x2188
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_20; // 0x2238
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_19; // 0x22a8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_18; // 0x2318
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_17; // 0x2388
	FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_4; // 0x23f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x24c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x25a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x2690
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x2778
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x2860
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x2948
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x2a30
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x2b18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x2c00
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x2ce8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x2dd0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x2eb8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x2fa0
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x3050
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x3080
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_11; // 0x3210
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x32b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x32d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x3300
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x3378
	FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_3; // 0x33a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x3470
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x34e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x3560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x35d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x3650
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x36c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x3740
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x37b8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x37e8
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3898
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x38c8
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x3978
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x39a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x39d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x39f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3a20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3a48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x3a70
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x3a98
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x3b48
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_8; // 0x3cd8
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_10; // 0x3d60
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x3e00
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_7; // 0x3f90
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_9; // 0x4018
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x40b8
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_6; // 0x4248
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_8; // 0x42d0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x4370
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_5; // 0x4500
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_7; // 0x4588
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x4628
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x4658
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_4; // 0x47e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x4870
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_3; // 0x4a00
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x4a88
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching_2; // 0x4c18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x4ca0
	FAnimNode_DistanceMatching AnimGraphNode_DistanceMatching; // 0x4e30
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x4eb8
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x4f58
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x4ff8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x5098
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x5148
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x51e8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_16; // 0x5218
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_15; // 0x5288
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_14; // 0x52f8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_13; // 0x5368
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_12; // 0x53d8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_11; // 0x5448
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_10; // 0x54b8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_9; // 0x5528
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_8; // 0x5598
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_7; // 0x5608
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_6; // 0x5678
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_5; // 0x56e8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_4; // 0x5758
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_3; // 0x57c8
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping_2; // 0x5838
	FAnimNode_OrientationWarping AnimGraphNode_OrientationWarping; // 0x58a8
	FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag_2; // 0x5918
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x59e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x5ac8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x5bb0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x5c98
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x5d80
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x5e30
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x5f18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x6000
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x60e8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x61d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x6280
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x6368
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x6450
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x6538
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x6620
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x66d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x67b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x68a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6988
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x6a70
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x6b20
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x6b50
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x6ce0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x6d80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x6da8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x6dd0
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x6e48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x6e78
	FAnimNode_BlendListByGameplayTag AnimGraphNode_BlendListByGameplayTag; // 0x6ef0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x6fb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x7030
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x70a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x7120
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x7198
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x7210
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x7288
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x72b8
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x7368
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x7398
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x7448
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x7478
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7528
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x75e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x7608
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x7630
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x7658
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x7680
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x76a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x76d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x76f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x7720
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x7798
	FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x77c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x7868
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x7888
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x78a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x79b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7a50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x7ac8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x7b40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x7b70
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x7be8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7c18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7c40
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x7cb8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7d80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7db0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x7e28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7e58
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x7e80
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x7eb0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7f60
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7f80
	FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x7fa0
	FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x8090
	FLocoTurnInPlace TurnInPlaceState; // 0x8180
	FLocomotionPrediction LocoPredictState; // 0x8230
	FAnimDirectionRange ForwardDirection; // 0x8298
	FAnimDirectionRange RightDirection; // 0x82b4
	FAnimDirectionRange LeftDirection; // 0x82d0
	FAnimDirectionRange BackwardDirection; // 0x82ec
	FAnimLocomotionData LocomotionData; // 0x8308
	FGobiAnimationState AnimationState; // 0x8348
	FAnimState3P AnimState3P; // 0x83a0
	FLocomotionPrediction LocoPredict; // 0x83a8
	FLocoLeaning Leaning; // 0x8410
	float LocoBlendTime; // 0x841c
	float LocoSpeedsBlendTime; // 0x8420
	float ClimbWallOffset; // 0x8424
	float AttackAimAlpha; // 0x8428
	float LocoCounterYaw; // 0x842c
};

struct UChildActorComponent {
	AActor* ChildActorClass; // 0x230
	AActor* ChildActor; // 0x238
	AActor* ChildActorTemplate; // 0x240
};

struct UCharacterDialogueComponent {
	TWeakObjectPtr<AGobiCharacter> OwnerCharacter; // 0x228
	FGameplayTagContainer DialogueDisabledTags; // 0x238
};

struct AItemPickup_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4f8
	UGameplayTagsComponent* GameplayTags; // 0x500
	UBillboardComponent* GlintLocation; // 0x508
	UItemAudioComponent* ItemAudio; // 0x510
	UPingableComponent* Pingable; // 0x518
	FMulticastInlineDelegate OnPickedUp; // 0x520
	UParticleSystemComponent* ItemGlintParticle; // 0x530
	bool bAutoPositionObservable; // 0x538
};

struct UIntSerialization {
	uint16_t UnsignedInt16Variable; // 0x30
	uint32_t UnsignedInt32Variable; // 0x34
	uint64_t UnsignedInt64Variable; // 0x38
	int8_t SignedInt8Variable; // 0x40
	int16_t SignedInt16Variable; // 0x42
	int64_t SignedInt64Variable; // 0x48
	char UnsignedInt8Variable; // 0x50
	int32_t SignedInt32Variable; // 0x54
};

struct UVideoCaptureProtocol {
	bool bUseCompression; // 0x70
	float CompressionQuality; // 0x74
};

struct UAnimContext_Angle {
	UAnimContext_Transform* AngleFrom; // 0x60
	bool InvertAngleFrom; // 0x68
	UAnimContext_Transform* AngleTo; // 0x70
	bool InvertAngleTo; // 0x78
};

struct USteeringBehavior_MeleeCircle {
	float AttackDistance; // 0x58
	float SlowdownDistance; // 0x5c
	float EnemyFrontConeDeg; // 0x60
	float StrafeSpeed; // 0x64
};

struct UParticleModuleVelocity {
	FRawDistributionVector StartVelocity; // 0x40
	FRawDistributionFloat StartVelocityRadial; // 0x88
};

struct UNiagaraSettings {
	TArray<FSoftObjectPath> AdditionalParameterTypes; // 0x40
	TArray<FSoftObjectPath> AdditionalPayloadTypes; // 0x50
	TArray<FSoftObjectPath> AdditionalParameterEnums; // 0x60
	FSoftObjectPath DefaultEffectType; // 0x70
	TArray<FText> QualityLevels; // 0x88
	UNiagaraEffectType* DefaultEffectTypePtr; // 0x98
};

struct UCameraViewModifierComponent {
	UCameraModifier_InterpolateFOV* CameraModifierClass; // 0x100
};

struct UGameplayEffectPathMoveScale {
	FGameplayTag Tag; // 0x238
};

struct UAsyncActionLoadPrimaryAssetClass {
	FMulticastInlineDelegate Completed; // 0x80
};

struct AMolotovProjectile {
	float MaxExplodeAngleDegrees; // 0x660
	int32_t MaximumBounces; // 0x664
	float AcceptableCharacterImpactZOffset; // 0x668
	TArray<UGameplayEffect*> AboveImpactZOffsetEffects; // 0x670
	FGameplayTagQuery CharacterTagQueryToAllowAOE; // 0x680
	FGameplayEffectsEmitterTestConfig AOEGameplayEffects; // 0x6c8
	AActor* InitialFlameToSpawn; // 0x718
	UAkAudioEvent* BounceAudioEvent; // 0x720
	int32_t NumberOfBouncesAccrued; // 0x72c
};

struct UMissionOverviewScreen {
	TSoftObjectPtr<UTexture2D> FallbackImage; // 0x558
	UDataTable* TipTable; // 0x580
};

struct UParticleSpawnDef {
	TArray<FGobiParticleParam> Params; // 0x38
	TArray<FImpactEmitterSet> EmitterSets; // 0x48
	TArray<FImpactSourceEmitterSet> SourceItemEmitterSets; // 0x58
};

struct UAIDataProvider_BehaviorParams {
	FName ParamName; // 0x30
	float FloatValue; // 0x38
	int32_t IntValue; // 0x3c
	bool BoolValue; // 0x40
	FGameplayTagContainer TagsValue; // 0x48
	FGameplayTagQuery TagQueryValue; // 0x68
	FAITraceData TraceDataValue; // 0xb0
	UObject* UObjectValue; // 0xc8
};

struct UServerStatusComponent {
	FServerStatus ServerStatus; // 0xe8
};

struct UMaterialExpressionDecalMipmapLevel {
	FExpressionInput TextureSize; // 0x48
	float ConstWidth; // 0x5c
	float ConstHeight; // 0x60
};

struct UInAppPurchaseCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UDedicatedServerManager {
	double NoMatchmakingTimingOutDelay; // 0xf0
	UWebServiceFortDediAPI* FortDediAPI; // 0xf8
	UGobiWebServices* GobiWebServices; // 0x100
	UMatchmakingPoolManager* MatchmakingPoolManager; // 0x108
	TArray<FTaskTimerConfig> TimerConfigs; // 0x150
	double WaitForConnectionsTime; // 0x948
	double UnloadDelay; // 0x950
	double WaitForPendingSessionParticipantsDuration; // 0xa28
	double RequestedShutdownEmptyServerTimeout; // 0xa38
};

struct UParticleModuleSubUV {
	USubUVAnimation* Animation; // 0x38
	FRawDistributionFloat SubImageIndex; // 0x40
	char bUseRealTime : 1; // 0x70
};

struct UButton {
	USlateWidgetStyleAsset* Style; // 0x160
	FButtonStyle WidgetStyle; // 0x168
	FSlateColor ColorAndOpacity; // 0x400
	FSlateColor BackgroundColor; // 0x430
	EButtonClickMethod ClickMethod; // 0x460
	EButtonTouchMethod TouchMethod; // 0x461
	EButtonPressMethod PressMethod; // 0x462
	bool IsFocusable; // 0x463
	bool bIsFocusedOnHover; // 0x464
	FMulticastInlineDelegate OnClicked; // 0x468
	FMulticastInlineDelegate OnPressed; // 0x478
	FMulticastInlineDelegate OnReleased; // 0x488
	FMulticastInlineDelegate OnHovered; // 0x498
	FMulticastInlineDelegate OnUnhovered; // 0x4a8
};

struct UAkAuxBus {
	UAkAudioBank* RequiredBank; // 0x30
};

struct UGameplayContext_ActorComponent {
	FGameplayTag ComponentTag; // 0x58
	bool bIncludeParentTags; // 0x60
};

struct UWaypointDataSet {
	UAkAudioEvent* SurvivorPingCreatedSound; // 0x38
	UAkAudioEvent* ZombiePingCreatedSound; // 0x40
	TMap<EPingType, UTexture2D*> PingIcons; // 0x48
	UTexture2D* WideItemPingBackground; // 0x98
	UTexture2D* WideItemPingBorder; // 0xa0
	UTexture2D* SquareItemPingBackground; // 0xa8
	UTexture2D* SquareItemPingBorder; // 0xb0
};

struct UJukeboxMusicComponent {
	bool bAutoLoadNextSong; // 0xe8
	UJukeboxMusicPlaylist* Playlist; // 0xf0
	UAkAudioEvent* AKEStartTrack; // 0xf8
	UAkAudioEvent* AKEStopTrack; // 0x100
	FName MusicScenarioName; // 0x108
	bool bInvokeMusicState; // 0x110
	FMulticastInlineDelegate OnNewTrackSelected; // 0x118
	int32_t TimescaleRampTimeMs; // 0x128
	TWeakObjectPtr<UAkComponent> AkComponent; // 0x12c
	int32_t TrackNumber; // 0x134
	EJukeboxMusicState State; // 0x138
	int32_t CurrentTrackStartTimeStamp; // 0x13c
};

struct UMaterialExpressionArctangent {
	FExpressionInput Input; // 0x48
};

struct UBTTask_GameplayTaskBase {
	char bWaitForGameplayTask : 1; // 0x78
};

struct UAudioCurveSourceComponent {
	FName CurveSourceBindingName; // 0x828
	float CurveSyncOffset; // 0x830
};

struct UMovieSceneCameraAnimTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x60
};

struct UClothLODDataCommon_Legacy {
	UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData; // 0x30
	FClothPhysicalMeshData ClothPhysicalMeshData; // 0x38
	FClothCollisionData CollisionData; // 0x130
};

struct AGameStateBase {
	AGameModeBase* GameModeClass; // 0x2a0
	AGameModeBase* AuthorityGameMode; // 0x2a8
	ASpectatorPawn* SpectatorClass; // 0x2b0
	TArray<APlayerState*> PlayerArray; // 0x2b8
	bool bReplicatedHasBegunPlay; // 0x2c8
	float ReplicatedWorldTimeSeconds; // 0x2cc
	float ServerWorldTimeSecondsDelta; // 0x2d0
	float ServerWorldTimeSecondsUpdateFrequency; // 0x2d4
};

struct UMaterialExpressionTransform {
	FExpressionInput Input; // 0x48
	EMaterialVectorCoordTransformSource TransformSourceType; // 0x5c
	EMaterialVectorCoordTransform TransformType; // 0x5d
};

struct ULightMapVirtualTexture2D {
	TArray<int8_t> TypeToLayer; // 0xf0
};

struct UGameplayAction_BotMantleTraversal {
	UGameplayEvaluatorSet* FilterSet; // 0x210
	bool bDisabled; // 0x218
	UAnimContext_Transform* DesiredDestContext; // 0x220
	FVector ArriveExtent; // 0x228
};

struct USubmixEffectFilterPreset {
	FSubmixEffectFilterSettings Settings; // 0x7c
};

struct UEnvQueryGenerator_SingleActor {
	UEnvQueryContext* ActorContext; // 0x58
};

struct UParticleModuleMeshRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UPhysicalAnimationComponent {
	float StrengthMultiplyer; // 0xe8
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xf0
};

struct UAttachmentMeshConfigurations {
	TArray<FWeaponAttachmentMeshConfig> MeshConfigurations; // 0x38
};

struct UAIAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct USourceEffectPannerPreset {
	FSourceEffectPannerSettings Settings; // 0x78
};

struct UStreamMediaSource {
	FString StreamUrl; // 0x90
};

struct ALMG02_BP_C {
	UADSComponent* ADS; // 0x520
	UFireModeSingleTraceComponent* FireModeSingleTrace; // 0x528
	UBulletPenetrationComponent* BulletPenetration; // 0x530
	UClipAmmoComponent* ClipAmmo; // 0x538
	URecoilComponent* Recoil; // 0x540
	UClipReloadComponent* ClipReload; // 0x548
	USpreadComponent* Spread; // 0x550
	UItemAnimationDataComponent* ItemAnimationData; // 0x558
};

struct ULandscapeInfo {
	LazyObjectProperty LandscapeActor; // 0x30
	FGuid LandscapeGuid; // 0x4c
	int32_t ComponentSizeQuads; // 0x5c
	int32_t SubsectionSizeQuads; // 0x60
	int32_t ComponentNumSubsections; // 0x64
	FVector DrawScale; // 0x68
	TMap<FIntPoint, ULandscapeComponent*> XYtoComponentMap; // 0x78
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x118
};

struct USceneComponent {
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xf0
	USceneComponent* AttachParent; // 0xf8
	FName AttachSocketName; // 0x100
	TArray<USceneComponent*> AttachChildren; // 0x108
	TArray<USceneComponent*> ClientAttachedChildren; // 0x118
	FVector RelativeLocation; // 0x154
	FRotator RelativeRotation; // 0x160
	FVector RelativeScale3D; // 0x16c
	FVector ComponentVelocity; // 0x178
	char bComponentToWorldUpdated : 1; // 0x184
	char bAbsoluteLocation : 1; // 0x184
	char bAbsoluteRotation : 1; // 0x184
	char bAbsoluteScale : 1; // 0x184
	char bVisible : 1; // 0x184
	char bShouldBeAttached : 1; // 0x184
	char bShouldSnapLocationWhenAttached : 1; // 0x184
	char bShouldSnapRotationWhenAttached : 1; // 0x185
	char bShouldUpdatePhysicsVolume : 1; // 0x185
	char bHiddenInGame : 1; // 0x185
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x185
	char bUseAttachParentBound : 1; // 0x185
	EComponentMobility Mobility; // 0x187
	char bAssetDecidesDetailMode : 1; // 0x188
	EDetailMode ComponentDetailMode; // 0x189
	FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x18a
};

struct UTitanTentacleComponent {
	ETitanTentacleState State; // 0xe8
	AActor* TargetActor; // 0x160
	float AttackAngle; // 0x168
	ETitanTentacleId ID; // 0x16c
	FGameplayTag AttackVolumeTag; // 0x170
	TArray<UGameplayEffect*> SmashGameplayEffects; // 0x178
	TArray<UGameplayEffect*> SwipeGameplayEffects; // 0x188
};

struct AIntervalGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x2a0
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x2a8
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x2b0
};

struct UTutorialPopupUserWidget {
	float ButtonDelayTime; // 0x478
};

struct UActorSequenceComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xe8
	UActorSequence* Sequence; // 0x100
	UActorSequencePlayer* SequencePlayer; // 0x108
};

struct UGizmoWorldAxisSource {
	FVector Origin; // 0x38
	int32_t AxisIndex; // 0x44
};

struct UEnvQueryTest_GoldenPathDistance {
	EGoldenPathDistanceMode Mode; // 0x208
};

struct UDistributionVectorUniformCurve {
	FInterpCurveTwoVectors ConstantCurve; // 0x40
	char bLockAxes1 : 1; // 0x58
	char bLockAxes2 : 1; // 0x58
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x5c
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x5e
	char bUseExtremes : 1; // 0x64
};

struct UAnimEvalSet_Shared_Traversal_2D_C {
	FGameplayEval_Distance Distance2D NavLinkStartToEnd; // 0xc0
	FGameplayEval_NavArea NavArea; // 0x190
	FGameplayEval_RandomChance RandomChance; // 0x200
	FGameplayEval_Distance DistanceToNavLinkStart; // 0x250
};

struct ATitan_AcidBloodPool_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UBoxComponent* Box; // 0x340
	UGameplayEffectEmitterComponent* GameplayEffectEmitter; // 0x348
};

struct UParticleModuleAttractorPointGravity {
	FVector Position; // 0x38
	float Radius; // 0x44
	UDistributionFloat* Strength; // 0x48
	FRawDistributionFloat StrengthRaw; // 0x50
};

struct ULeapMovementModeComponent {
	float MaxLeapDuration; // 0x130
	float LeapSlideableDuration; // 0x134
	float MinLeapImpactDotToStepUp; // 0x138
	float MinLeapImpactDotToSlide; // 0x13c
	bool bAttemptToStepUpOnBlockingHit; // 0x140
};

struct UGameplayMod {
	bool bApplyOnlyToOwner; // 0x30
	FGameplayTagQuery ApplyTagQuery; // 0x38
	FGameplayTagQuery FirstApplicationTagQuery; // 0x80
	bool bInstanced; // 0xc8
	bool bApplyOnClients; // 0xc9
	bool bApplyToSingleplayerOnly; // 0xca
	int32_t SupportedPhases; // 0xcc
};

struct UMaterialExpressionSubtract {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x5c
	float ConstA; // 0x70
	float ConstB; // 0x74
};

struct USpectatorBeaconState {
	FName SessionName; // 0x30
	int32_t NumConsumedReservations; // 0x38
	int32_t MaxReservations; // 0x3c
	bool bRestrictCrossConsole; // 0x40
	TArray<FSpectatorReservation> Reservations; // 0x48
};

struct USoundCollectionAsset {
	UEnum* UserDefinedEnum; // 0x38
	ESharedSoundCollectionMode SoundCollectionMode; // 0x40
	TMap<FName, FSharedSoundBehavior> Sounds; // 0x48
};

struct UMovieSceneParticleSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe8
};

struct ULevelSequenceBurnIn {
	FLevelSequencePlayerSnapshot FrameInformation; // 0x2d8
	ALevelSequenceActor* LevelSequenceActor; // 0x390
};

struct UAnimNotify_MotionCorrectionGoal {
	bool bDrawDebug; // 0x40
	FMotionCorrectionGoal CorrectionGoal; // 0x48
};

struct ALevelStreamingVolume {
	TArray<FName> StreamingLevelNames; // 0x2d8
	char bEditorPreVisOnly : 1; // 0x2e8
	char bDisabled : 1; // 0x2e8
	EStreamingVolumeUsage StreamingUsage; // 0x2ec
};

struct UVirtualTexturePoolConfig {
	int32_t DefaultSizeInMegabyte; // 0x30
	TArray<FVirtualTextureSpacePoolConfig> Pools; // 0x38
};

struct UMaterial {
	UPhysicalMaterial* PhysMaterial; // 0x90
	UPhysicalMaterialMask* PhysMaterialMask; // 0x98
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0xa0
	FScalarMaterialInput Metallic; // 0xe0
	FScalarMaterialInput Specular; // 0xf4
	FScalarMaterialInput Anisotropy; // 0x108
	FVectorMaterialInput Normal; // 0x11c
	FVectorMaterialInput Tangent; // 0x130
	FColorMaterialInput EmissiveColor; // 0x144
	EMaterialDomain MaterialDomain; // 0x158
	EBlendMode BlendMode; // 0x159
	EDecalBlendMode DecalBlendMode; // 0x15a
	EMaterialDecalResponse MaterialDecalResponse; // 0x15b
	EMaterialShadingModel ShadingModel; // 0x15c
	char bCastDynamicShadowAsMasked : 1; // 0x15d
	FMaterialShadingModelField ShadingModels; // 0x15e
	float OpacityMaskClipValue; // 0x160
	FVectorMaterialInput WorldPositionOffset; // 0x164
	FScalarMaterialInput Refraction; // 0x178
	FMaterialAttributesInput MaterialAttributes; // 0x18c
	FScalarMaterialInput PixelDepthOffset; // 0x1a4
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b8
	char bEnableSeparateTranslucency : 1; // 0x1cc
	char bEnableResponsiveAA : 1; // 0x1cc
	char bScreenSpaceReflections : 1; // 0x1cc
	char bContactShadows : 1; // 0x1cc
	char TwoSided : 1; // 0x1cc
	char DitheredLODTransition : 1; // 0x1cc
	char DitherOpacityMask : 1; // 0x1cc
	char bAllowNegativeEmissiveColor : 1; // 0x1cc
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1cd
	char bEnableMobileSeparateTranslucency : 1; // 0x1ce
	int32_t NumCustomizedUVs; // 0x1d0
	float TranslucencyDirectionalLightingIntensity; // 0x1d4
	char TranslucentCustomDepthWritesEveryPixel : 1; // 0x1d8
	float TranslucentShadowDensityScale; // 0x1dc
	float TranslucentSelfShadowDensityScale; // 0x1e0
	float TranslucentSelfShadowSecondDensityScale; // 0x1e4
	float TranslucentSelfShadowSecondOpacity; // 0x1e8
	float TranslucentBackscatteringExponent; // 0x1ec
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1f0
	float TranslucentShadowStartOffset; // 0x200
	char bDisableDepthTest : 1; // 0x204
	char bWriteOnlyAlpha : 1; // 0x204
	char bGenerateSphericalParticleNormals : 1; // 0x204
	char bTangentSpaceNormal : 1; // 0x204
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x204
	char bBlockGI : 1; // 0x204
	char bUsedAsSpecialEngineMaterial : 1; // 0x204
	char bUsedWithSkeletalMesh : 1; // 0x204
	char bUsedWithEditorCompositing : 1; // 0x205
	char bUsedWithParticleSprites : 1; // 0x205
	char bUsedWithBeamTrails : 1; // 0x205
	char bUsedWithMeshParticles : 1; // 0x205
	char bUsedWithNiagaraSprites : 1; // 0x205
	char bUsedWithNiagaraRibbons : 1; // 0x205
	char bUsedWithNiagaraMeshParticles : 1; // 0x205
	char bUsedWithGeometryCache : 1; // 0x205
	char bUsedWithStaticLighting : 1; // 0x206
	char bUsedWithMorphTargets : 1; // 0x206
	char bUsedWithSplineMeshes : 1; // 0x206
	char bUsedWithInstancedStaticMeshes : 1; // 0x206
	char bUsedWithGeometryCollections : 1; // 0x206
	char bUsesDistortion : 1; // 0x206
	char bUsedWithClothing : 1; // 0x206
	char bUsedWithWater : 1; // 0x208
	char bUsedWithHairStrands : 1; // 0x208
	char bUsedWithLidarPointCloud : 1; // 0x208
	char bUsedWithUI : 1; // 0x20c
	char bAutomaticallySetUsageInEditor : 1; // 0x20c
	char bFullyRough : 1; // 0x20c
	char bUseFullPrecision : 1; // 0x20c
	char bUseLightmapDirectionality : 1; // 0x20c
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x210
	char bUseHQForwardReflections : 1; // 0x214
	char bUsePlanarForwardReflections : 1; // 0x214
	char bNormalCurvatureToRoughness : 1; // 0x214
	EMaterialTessellationMode D3D11TessellationMode; // 0x215
	char bEnableCrackFreeDisplacement : 1; // 0x216
	char bEnableAdaptiveTessellation : 1; // 0x216
	char AllowTranslucentCustomDepthWrites : 1; // 0x216
	char Wireframe : 1; // 0x216
	EMaterialShadingRate ShadingRate; // 0x217
	char bCanMaskedBeAssumedOpaque : 1; // 0x218
	char bIsMasked : 1; // 0x218
	char bIsPreviewMaterial : 1; // 0x218
	char bIsFunctionPreviewMaterial : 1; // 0x218
	char bUseMaterialAttributes : 1; // 0x218
	char bCastRayTracedShadows : 1; // 0x218
	char bUseTranslucencyVertexFog : 1; // 0x218
	char bIsSky : 1; // 0x218
	char bComputeFogPerPixel : 1; // 0x219
	char bOutputTranslucentVelocity : 1; // 0x219
	char bAllowDevelopmentShaderCompile : 1; // 0x219
	char bIsMaterialEditorStatsMaterial : 1; // 0x219
	EBlendableLocation BlendableLocation; // 0x21a
	char BlendableOutputAlpha : 1; // 0x21b
	char bEnableStencilTest : 1; // 0x21b
	EMaterialStencilCompare StencilCompare; // 0x21c
	char StencilRefValue; // 0x21d
	ERefractionMode RefractionMode; // 0x21e
	int32_t BlendablePriority; // 0x220
	char bIsBlendable : 1; // 0x224
	uint32_t UsageFlagWarnings; // 0x228
	float RefractionDepthBias; // 0x22c
	FGuid StateId; // 0x230
	float MaxDisplacement; // 0x240
	FMaterialCachedExpressionData CachedExpressionData; // 0x2d0
};

struct UUserDefinedEnum {
	TMap<FName, FText> DisplayNameMap; // 0x68
};

struct UCurveVector {
	FRichCurve FloatCurves[0x3]; // 0x38
};

struct UMissionOverviewFooterUserWidget {
	UMissionOverviewMapChainUserWidget* MapChainUserWidget; // 0x458
};

struct USaferoomCurrencyMod {
	int32_t CurrencyGrantedPerSaferoom; // 0xe0
	FString AdjustCurrencyCause; // 0xe8
};

struct UParticleModuleVectorFieldScale {
	UDistributionFloat* VectorFieldScale; // 0x38
	FRawDistributionFloat VectorFieldScaleRaw; // 0x40
};

struct USkeletalMeshPieceTrait {
	TArray<FMeshesConfig> MeshPieces; // 0x30
	FGameplayTag SkelMeshMasterGameplayTag; // 0x40
	bool bStartHidden; // 0x48
	bool bCastShadow; // 0x49
	bool bRelativeTransform; // 0x4a
	FTransform RelativeTransform; // 0x50
};

struct USourceEffectFoldbackDistortionPreset {
	FSourceEffectFoldbackDistortionSettings Settings; // 0x7c
};

struct UActorPlacementSpec {
	AActor* ActorClass; // 0x30
	int32_t SegmentStartIndex; // 0x38
	int32_t SegmentEndIndex; // 0x3c
	float DistanceInterval; // 0x40
	float OffsetFromStart; // 0x44
	bool InheritSplineRotation; // 0x48
	bool bInheritSplineYawRotation; // 0x49
	ESplineActorOffsetMode OffsetMode; // 0x4a
	FVector Translation; // 0x4c
	FRotator Rotation; // 0x58
	FVector MinTranslation; // 0x64
	FVector MaxTranslation; // 0x70
	FRotator MinRotation; // 0x7c
	FRotator MaxRotation; // 0x88
	TArray<AActor*> PlacedActors; // 0x98
};

struct UGameplayAction_LeapTraversal {
	UGameplayContext_LeapShortcut* LeapShortcutContext; // 0x2e8
};

struct UDirectorCardWeightsConverter {
	bool bUpdate; // 0x38
};

struct UGameplayEffectHeroUseComponent {
	TSoftClassPtr<UObject> ApplicableUsableClass; // 0x240
	FGamePropertyFloatMod UsableTimeScaleMod; // 0x268
	int32_t MaxUseCount; // 0x278
	float Cooldown; // 0x27c
};

struct APassageSpawner {
	UObject* SyncedClass; // 0x2a0
	TArray<UObject*> PrecachedClasses; // 0x2a8
	uint32_t AllowedTypes; // 0x2b8
	TMap<EGameModeClassification, FAllowedTypes> AllowedTypesOverride; // 0x2c0
	bool bMirrored; // 0x310
	TSoftClassPtr<UObject> PassageClasses[0x4]; // 0x318
	TSoftClassPtr<UObject> SpecialClasses[0x2]; // 0x3b8
	TSoftClassPtr<UObject> PassageClassesMirrored[0x4]; // 0x408
	TSoftClassPtr<UObject> SpecialClassesMirrored[0x2]; // 0x4a8
	EAlarmMode AlarmMode; // 0x4f8
	TMap<EGameModeClassification, EAlarmMode> AlarmModeOverride; // 0x500
	bool bCastStaticShadow; // 0x550
	bool bAkAudioPortalEnabled; // 0x551
	TArray<FDoorAlarmAudio> AlarmAudioEvents; // 0x558
	APassageSpawner* SyncedPassageSpawner; // 0x568
	UGobiNavLinkComponent* NavLinkComponent; // 0x570
	UGobiNavModifierComponent* NavModifierComponent; // 0x578
	UAkAcousticPortalComponent* AkAcousticPortalComponent; // 0x580
	AActor* SpawnedPassage; // 0x588
	FMulticastInlineDelegate OnPassageSpawned; // 0x590
};

struct UTitanTongueAnimInstance {
	UTitanTongueComponent* TitanTongueComponent; // 0x2c0
	bool bIdle; // 0x2c8
	bool bGrabbing; // 0x2c9
	float GrabPlayRate; // 0x2cc
	bool bMissing; // 0x2d0
	float MissPlayRate; // 0x2d4
	bool bPulling; // 0x2d8
	float PullPlayRate; // 0x2dc
	bool bHolding; // 0x2e0
	bool bBiting; // 0x2e1
	bool bReleasing; // 0x2e2
	bool bEating; // 0x2e3
	float TargetDist; // 0x2e4
};

struct AWaterSurfaceMesh {
	AWaterVolume* WaterVolume; // 0x2b0
};

struct UAssetExportTask {
	UObject* Object; // 0x30
	UExporter* Exporter; // 0x38
	FString Filename; // 0x40
	bool bSelected; // 0x50
	bool bReplaceIdentical; // 0x51
	bool bPrompt; // 0x52
	bool bAutomated; // 0x53
	bool bUseFileArchive; // 0x54
	bool bWriteEmptyFiles; // 0x55
	TArray<UObject*> IgnoreObjectList; // 0x58
	UObject* Options; // 0x68
	TArray<FString> Errors; // 0x70
};

struct AGobiWorldSettings {
	bool bOnlineInventoryEnabled; // 0x430
	bool bSignInInputProcessing; // 0x431
	bool bMainMenu; // 0x432
	bool bSharedScreen; // 0x433
	bool bSupportsBots; // 0x434
	bool bNeedsCommonZombieMeshMerge; // 0x435
	FDataTableRowHandle Chapter; // 0x438
	TArray<FAutoStartMapMission> AutoStartMapMissions; // 0x458
	TSoftObjectPtr<UWorld> CharacterLineupLevel; // 0x468
	bool bSectorsAndPortalsEnabled; // 0x490
	int32_t FoliageSectorsAndPortalsMode; // 0x494
	bool bAllowLODDistanceScaling; // 0x498
	int32_t PoolSizeAdjustment; // 0x49c
};

struct UWaypointUserWidget {
	float ADSOpacity; // 0x2d8
	float ArrowOffsetFromIcon; // 0x2e4
};

struct UAsyncTaskDownloadImage {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFail; // 0x48
};

struct UCaravanProgressScreen {
	bool bWaitingOnRequest; // 0x564
};

struct ULayer {
	FName LayerName; // 0x30
	char bIsVisible : 1; // 0x38
	TArray<FLayerActorStats> ActorStats; // 0x40
};

struct UStaticCaravans {
	FStaticCaravan TutorialCaravan; // 0x38
	TArray<FStaticCaravanChain> CaravanChains; // 0x68
};

struct UCardFilterUserWidget {
	FMulticastInlineDelegate OnFilterChanged; // 0x458
	TArray<ECardFilter> Filters; // 0x468
	ECardFilter DefaultFilter; // 0x478
};

struct UNavigationPath {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x30
	TArray<FVector> PathPoints; // 0x40
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x50
};

struct UNiagaraPreviewAxis_InterpParamVector {
	FVector Min; // 0x40
	FVector Max; // 0x4c
};

struct UAnimEvalSet_Shared_Idle_C {
	FGameplayEval_Random Random; // 0xc0
	FAnimEval_MontageLastPlayed HasPlayedRecently; // 0x108
};

struct UAnimNotify_PlaySound {
	USoundBase* Sound; // 0x40
	float VolumeMultiplier; // 0x48
	float PitchMultiplier; // 0x4c
	char bFollow : 1; // 0x50
	FName AttachName; // 0x54
};

struct UNiagaraDataInterfaceVolumeTexture {
	UVolumeTexture* Texture; // 0x38
};

struct UIpNetDriver {
	char LogPortUnreach : 1; // 0x760
	char AllowPlayerPortUnreach : 1; // 0x760
	uint32_t MaxPortCountToTry; // 0x764
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x774
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x778
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x77c
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x780
	double MaxSecondsInReceive; // 0x788
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x790
	float ResolutionConnectionTimeout; // 0x794
};

struct UBrushComponent {
	UModel* Brush; // 0x4b0
	UBodySetup* BrushBodySetup; // 0x4b8
};

struct UHapticFeedbackEffect_Buffer {
	TArray<char> Amplitudes; // 0x30
	int32_t SampleRate; // 0x40
};

struct UAnimEvalSet_DefibReation_C {
	FGameplayEval_ReviveSource ReviveSource; // 0xc0
};

struct UGameplayAction_Traversal {
	bool bSortMontagesAlphabetically; // 0x210
	TArray<UAnimMontage*> TraversalMontages; // 0x218
	TArray<UMontageSet*> MontageSets; // 0x228
	FName TraversalCollisionProfileName; // 0x238
	TArray<UGameplayEffect*> ReapplyEffectsOnTraversalSuccess; // 0x240
	TArray<UAnimSequenceBase*> TraversalFlyRequesters; // 0x250
	TArray<UAnimNotifyState_EvalChainMontage*> EvalChains; // 0x260
	FVector2D PlayRateRange; // 0x270
	TArray<FQueuedEffect> QueuedEffectsToReapply; // 0x278
};

struct UBTDecorator_CanTriggerAction {
	FGameplayTagQuery ActionTagQuery; // 0x70
	FAIDataProviderGameplayTagQueryContainerValue ActionTags; // 0xb8
	bool bTestIsEnabledForActor; // 0x130
	bool bDisableOnSuccess; // 0x131
	float FlowControlDelay; // 0x134
};

struct UVariantSet {
	FText DisplayText; // 0x30
	bool bExpanded; // 0x60
	TArray<UVariant*> Variants; // 0x68
};

struct UHUDEquipmentEntryUserWidget {
	bool bIsLowAmmo; // 0x4a8
};

struct UItemAudioComponent {
	bool bDebug; // 0xe8
	bool bStopAttractOnBeginUse; // 0xe9
	bool bStopAttractOnEndUse; // 0xea
	float MinSpeedForBounceAudio; // 0xec
	float MaxSpeedForRollAudio; // 0xf0
	float BounceCooldown; // 0xf4
	UAkAudioEvent* AKESpawn; // 0x100
	UAkAudioEvent* AKEAttractLoop; // 0x108
	UAkAudioEvent* AKEAttractLoopStop; // 0x110
	UAkAudioEvent* AKEInteractStart; // 0x118
	UAkAudioEvent* AKEInteractEnd; // 0x120
	UAkAudioEvent* AKEInteractSuccess; // 0x128
	UAkAudioEvent* AKESpawnedFromKill; // 0x130
};

struct UMaterialExpressionShadingModel {
	EMaterialShadingModel ShadingModel; // 0x48
};

struct UGameplayAction_TriggerHorde {
	FDifficultyBool IsAllowedByDifficulty; // 0x210
};

struct UGameplayTask_WaitDelay {
	FMulticastInlineDelegate OnFinish; // 0x70
};

struct UMantleSpeedMod {
	FCustomDataProviderFloat MantleSpeed; // 0xd0
};

struct USkinnedMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x528
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x530
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x538
	UPhysicsAsset* PhysicsAssetOverride; // 0x640
	int32_t ForcedLodModel; // 0x648
	int32_t MinLodModel; // 0x64c
	int32_t IndividualLodBias; // 0x650
	float StreamingDistanceMultiplier; // 0x65c
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x668
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x69c
	char bOverrideMinLod : 1; // 0x69e
	char bUseBoundsFromMasterPoseComponent : 1; // 0x69e
	char bForceWireframe : 1; // 0x69e
	char bDisplayBones : 1; // 0x69e
	char bDisableMorphTarget : 1; // 0x69e
	char bHideSkin : 1; // 0x69e
	char bPerBoneMotionBlur : 1; // 0x69f
	char bComponentUseFixedSkelBounds : 1; // 0x69f
	char bUseFixedBoundsOverrideMinMax : 1; // 0x69f
	FVector FixedBoundsOverrideMin; // 0x6a0
	FVector FixedBoundsOverrideMax; // 0x6ac
	char bUsePhysicsAssetToCalcBounds : 1; // 0x6b8
	char bConsiderAllBodiesForBounds : 1; // 0x6b8
	char bSyncAttachParentLOD : 1; // 0x6b8
	char bCanHighlightSelectedSections : 1; // 0x6b8
	char bRecentlyRendered : 1; // 0x6b8
	char bCastCapsuleDirectShadow : 1; // 0x6b8
	char bCastCapsuleIndirectShadow : 1; // 0x6b8
	char bCPUSkinning : 1; // 0x6b8
	char bEnableUpdateRateOptimizations : 1; // 0x6b9
	char bServerIgnoresUpdateRateOptimizationFrameSkip : 1; // 0x6b9
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x6b9
	char bRenderStatic : 1; // 0x6b9
	char bIgnoreMasterPoseComponentLOD : 1; // 0x6b9
	bool bStopTickingWhenNoLongerAnimating; // 0x6ba
	float StopTickingWhenNoLongerAnimatingTime; // 0x6bc
	char bCachedLocalBoundsUpToDate : 1; // 0x6c0
	char bForceMeshObjectUpdate : 1; // 0x6cc
	float CapsuleIndirectShadowMinVisibility; // 0x6d0
	FBoxSphereBounds CachedLocalSpaceBounds; // 0x6e8
};

struct UMovieSceneFadeSection {
	FLinearColor FadeColor; // 0x188
	char bFadeAudio : 1; // 0x198
};

struct UGameplayAction_BotAttackRanged {
	float FullAutoTimeMult; // 0x400
};

struct AARSkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x2b0
};

struct ADecalActor {
	UDecalComponent* Decal; // 0x2a0
};

struct UCommandlet {
	FString HelpDescription; // 0x30
	FString HelpUsage; // 0x40
	FString HelpWebLink; // 0x50
	TArray<FString> HelpParamNames; // 0x60
	TArray<FString> HelpParamDescriptions; // 0x70
	char IsServer : 1; // 0x80
	char IsClient : 1; // 0x80
	char IsEditor : 1; // 0x80
	char LogToConsole : 1; // 0x80
	char ShowErrorCount : 1; // 0x80
	char ShowProgress : 1; // 0x80
};

struct UParticleModuleVectorFieldRotation {
	FVector MinInitialRotation; // 0x38
	FVector MaxInitialRotation; // 0x44
};

struct UBlueprintGeneratedClass {
	int32_t NumReplicatedProperties; // 0x260
	char bHasNativizedParent : 1; // 0x264
	char bHasCookedComponentInstancingData : 1; // 0x264
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x268
	TArray<UActorComponent*> ComponentTemplates; // 0x278
	TArray<UTimelineTemplate*> Timelines; // 0x288
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x298
	USimpleConstructionScript* SimpleConstructionScript; // 0x2a8
	UInheritableComponentHandler* InheritableComponentHandler; // 0x2b0
	UStructProperty* UberGraphFramePointerProperty; // 0x2b8
	UFunction* UberGraphFunction; // 0x2c8
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2d0
};

struct UBTDecorator_Loop {
	int32_t NumLoops; // 0x70
	bool bInfiniteLoop; // 0x74
	float InfiniteLoopTimeoutTime; // 0x78
};

struct UAsyncAssetSet {
	TArray<UObject*> LoadedObjects; // 0x90
};

struct UGobiSlider {
	UAkAudioEvent* DefaultClickSound; // 0x5b0
};

struct UAISpawnActorVariantsConfig {
	TArray<FAISpawnActorVariantDefinition> Variants; // 0x38
};

struct UGameplayAction_ReachIn {
	float DistanceToActivate; // 0x210
	float DistanceToPlayReachIn; // 0x214
	float LoopTime; // 0x218
	float ThrowSpeed; // 0x21c
	FGameplayTag SkeletalMeshTag; // 0x220
	UAnimContext_ReachInSmartActor* ReachInSmartActorContext; // 0x228
	USteeringBehavior* SmartActorSteeringBehavior; // 0x230
	TArray<UGameplayEffect*> SuccessfulGrabEffects; // 0x238
	TArray<UGameplayEffect*> SuccessfulGrabTargetEffects; // 0x248
	TArray<UGameplayEffect*> GrabReleasedEffects; // 0x258
	UGameplayEffect* SmartActorCooldown; // 0x268
	FGameplayTagQuery BlockingTagQuery; // 0x270
	UMontageSet* ReachInMontageSet; // 0x2b8
	UMontageSet* ReachInLoopMontageSet; // 0x2c0
	UMontageSet* ReachInLoopEndMontageSet; // 0x2c8
	UMontageSet* ReachInGrabMontageSet; // 0x2d0
	TMap<FName, FReachInSweepVolumeInfo> NotifyVolumeInfoMap; // 0x2d8
};

struct UTitanStage3TentacleComponent {
	ETitanStage3TentacleState State; // 0xe8
	int32_t CurrentAttackZoneId; // 0x13c
	ETitanTentacleId ID; // 0x140
	FGameplayTag SprayComponentTag; // 0x144
	TArray<FTitanStage3AcidSprayAttackZone> AcidSprayAttackZones; // 0x150
	FName PathRootBone; // 0x160
	UAnimSequence* DeathAnimSequence; // 0x168
};

struct UInterpTrackInstVisibility {
	EVisibilityTrackAction Action; // 0x30
	float LastUpdatePosition; // 0x34
};

struct UInterpTrackToggle {
	TArray<FToggleTrackKey> ToggleTrack; // 0x78
	char bActivateSystemEachUpdate : 1; // 0x88
	char bActivateWithJustAttachedFlag : 1; // 0x88
	char bFireEventsWhenForwards : 1; // 0x88
	char bFireEventsWhenBackwards : 1; // 0x88
	char bFireEventsWhenJumpingForwards : 1; // 0x88
};

struct AGobiPlayerControllerBase {
	FMulticastInlineDelegate OnLastInputDeviceChanged; // 0x628
	FMulticastInlineDelegate OnInputDisabled; // 0x650
	FMulticastInlineDelegate OnInputEnabled; // 0x660
	FMulticastInlineDelegate OnChatMessageReceived; // 0x6c8
	FMulticastInlineDelegate OnSystemMessageReceived; // 0x6e8
	UGobiPlayerInput* GobiPlayerInput; // 0x6f8
	UBugReporterComponent* BugReporter; // 0x708
	UMaterialInstance* WatermarkMaterial; // 0x710
	UCanvasRenderTarget2D* WatermarkRenderTarget; // 0x718
	UMaterialInterface* WatermarkMaterialClass; // 0x720
	UFont* WatermarkFont; // 0x728
	UUIScreenManager* UIScreenManagerClass; // 0x730
	UUIScreenManager* UIScreenManager; // 0x738
	UGlobalSafeZoneUserWidget* GlobalSafeZoneWidget; // 0x740
	UPushToTalkComponent* PushToTalkComponent; // 0x748
	UVoiceTalkersComponent* VoiceTalkersComponent; // 0x750
	UTRSSubtitleComponent* SubtitleComponent; // 0x758
	UGobiPlayerProfileComponent* GobiPlayerProfileComponent; // 0x760
	UPlayerStatsComponent* PlayerStatsComponent; // 0x768
	UGobiPlayerChallengeComponent* GobiPlayerChallengeComponent; // 0x770
};

struct UDrawFrustumComponent {
	FColor FrustumColor; // 0x4b0
	float FrustumAngle; // 0x4b4
	float FrustumAspectRatio; // 0x4b8
	float FrustumStartDist; // 0x4bc
	float FrustumEndDist; // 0x4c0
	UTexture* Texture; // 0x4c8
};

struct UPlayerLevelStreamingComponent {
	int32_t NumLoadedLevels; // 0x100
};

struct USoundfieldSubmix {
	FName SoundfieldEncodingFormat; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x50
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x58
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x68
};

struct UGameplayEffectHeroIncapReviveBonus {
	FGamePropertyFloatMod IncapReviveHealingMod; // 0x240
};

struct ULifeStateAlive {
	float StartInjuredHealthPct; // 0xa8
	float StartCriticalHealthPct; // 0xac
	FName CriticalHealthMoveInputScaleLabel; // 0xb0
	float CriticalHealthMoveInputScale; // 0xb8
	EHealthState HealthState; // 0xbc
	FGameplayTag CriticallyInjuredScreenFXTag; // 0xc0
	bool bRevertCollisionProfileOnEnter; // 0xc8
	FName AliveCapsuleCollisionProfile; // 0xcc
	FGameplayTag HealthStateTags[0x4]; // 0xd4
};

struct UAchievementQueryCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UDatasmithImportOptions {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x30
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x31
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x32
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x33
	EDatasmithImportActorPolicy LightImportPolicy; // 0x34
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x35
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x36
	EDatasmithImportMaterialQuality MaterialQuality; // 0x37
	FDatasmithImportBaseOptions BaseOptions; // 0x3c
	FDatasmithReimportOptions ReimportOptions; // 0x50
	FString Filename; // 0x58
	FString FilePath; // 0x68
};

struct UGameplayEffectHeal {
	bool bAutoHealOutOfCriticalState; // 0x244
	float InstantHealing; // 0x248
	float InstantPermanentHealing; // 0x24c
	float RecurringHealing; // 0x250
	float RecurringPermanentHealing; // 0x254
	float RecurringHealingFrequency; // 0x258
	float MinHealAmount; // 0x25c
	bool bStackTemporaryHealth; // 0x260
	float TemporaryHealth; // 0x264
	FTemporaryHealthParams TemporaryHealthParams; // 0x268
	bool bUseHealingScaleMods; // 0x280
	bool bSourcePawnPerkCriticalHeal; // 0x281
	TArray<UGameplayEffect*> CritHealGameplayEffects; // 0x288
};

struct UMovieSceneParticleParameterTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UFogMod {
	char bOverride_HeightFogStartDistance : 1; // 0xd0
	char bOverride_HeightFogInscatteringColor : 1; // 0xd0
	char bOverride_VolumeFogAlbedo : 1; // 0xd0
	char bOverride_MinVolumeFog : 1; // 0xd0
	char bOverride_VolumeFogNoiseScale : 1; // 0xd0
	char bOverride_VolumeFogNoisePan : 1; // 0xd0
	char bOverride_VolumeFogNoisePanSpeed : 1; // 0xd0
	char bOverride_VolumeGroundFogHeight : 1; // 0xd0
	char bOverride_VolumeGroundFogAO : 1; // 0xd1
	float HeightFogStartDistance; // 0xd4
	FLinearColor HeightFogInscatteringColor; // 0xd8
	char bUseSecondFog : 1; // 0xe8
	float SecondFogDensity; // 0xec
	float SecondFogHeightFalloff; // 0xf0
	float SecondFogHeightOffset; // 0xf4
	FLinearColor VolumeFogAlbedo; // 0xf8
	float MinVolumeFog; // 0x108
	UCurveFloat* MinVolumeFogOverTime; // 0x110
	float VolumeFogNoiseScale; // 0x118
	FVector VolumeFogNoisePan; // 0x11c
	float VolumeFogNoisePanSpeed; // 0x128
	float VolumeGroundFogHeight; // 0x12c
	float VolumeGroundFogAO; // 0x130
};

struct UMaterialExpressionStaticSwitchParameter {
	FExpressionInput A; // 0x68
	FExpressionInput B; // 0x7c
};

struct UParticleEmitter {
	FName EmitterName; // 0x30
	int32_t SubUVDataOffset; // 0x38
	EEmitterRenderMode EmitterRenderMode; // 0x3c
	EParticleSignificanceLevel SignificanceLevel; // 0x3d
	char bUseLegacySpawningBehavior : 1; // 0x3f
	char ConvertedModules : 1; // 0x3f
	char bIsSoloing : 1; // 0x3f
	char bCookedOut : 1; // 0x3f
	char bDisabledLODsKeepEmitterAlive : 1; // 0x3f
	char bDisableWhenInsignficant : 1; // 0x40
	TArray<UParticleLODLevel*> LODLevels; // 0x48
	int32_t PeakActiveParticles; // 0x58
	int32_t InitialAllocationCount; // 0x5c
	float QualityLevelSpawnRateScale; // 0x60
	uint32_t DetailModeBitmask; // 0x64
};

struct UCullingField {
	UFieldNodeBase* Culling; // 0xe8
	UFieldNodeBase* Field; // 0xf0
	EFieldCullingOperationType Operation; // 0xf8
};

struct ULifeStateBase {
	FGameplayTagContainer AppliedTags; // 0x50
	TArray<UGameplayEffect*> AppliedGameplayEffects; // 0x70
	TArray<UGameplayEffect*> ExitGameplayEffects; // 0x80
	TArray<TWeakObjectPtr<UGameplayEffect>> ActiveEffects; // 0x98
};

struct UParticleColliderComponent {
	TMap<FName, UImpactEffectConfig*> Events; // 0xe8
	bool bMaterialNormalParam; // 0x138
	bool bMaterialLocationParam; // 0x139
};

struct UInteractiveToolsContext {
	UInputRouter* InputRouter; // 0x60
	UInteractiveToolManager* ToolManager; // 0x68
	UInteractiveGizmoManager* GizmoManager; // 0x70
	TSoftClassPtr<UObject> ToolManagerClass; // 0x78
};

struct UGobiSafeZone {
	bool PadLeft; // 0x160
	bool PadRight; // 0x161
	bool PadTop; // 0x162
	bool PadBottom; // 0x163
};

struct UTRSSubtitleComponent {
	UUserWidget* SubtitleWidget; // 0xe8
};

struct UEngineMessage {
	FString FailedPlaceMessage; // 0x30
	FString MaxedOutMessage; // 0x40
	FString EnteredMessage; // 0x50
	FString LeftMessage; // 0x60
	FString GlobalNameChange; // 0x70
	FString SpecEnteredMessage; // 0x80
	FString NewPlayerMessage; // 0x90
	FString NewSpecMessage; // 0xa0
};

struct UNavModifierComponent {
	UNavArea* AreaClass; // 0x118
	FVector FailsafeExtent; // 0x120
	char bIncludeAgentHeight : 1; // 0x12c
};

struct UNiagaraSimulationStageBase {
	UNiagaraScript* Script; // 0x30
	FName SimulationStageName; // 0x38
};

struct UBTDecorator_HasBlackboardTimeoutExpired {
	float Offset; // 0x98
};

struct UAnimEvalSet_Rubble_DeathReaction_C {
	FGameplayEval_Health AvatarHealth; // 0xc0
	FGameplayEval_GameplayTags AvatarTags; // 0x118
};

struct UWidgetSwitcherSlot {
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct ADialogueBankManger {
	TArray<FName> RequiredSpeakerBanks; // 0x2b8
	TArray<FName> RequiredConversationBanks; // 0x2c8
};

struct ASleeperNest_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x418
	UCapsuleComponent* PlayerBlockerCapsule; // 0x420
	UInfectedHighlightComponent* InfectedHighlight; // 0x428
	UAkComponent* AkComponent; // 0x430
	UItemAkBankComponent* ItemAkBank; // 0x438
	UAimAssistTargetComponent* AimAssistTarget; // 0x440
	bool HasChosenSpawnLocation; // 0x448
};

struct UButtonStyleAsset {
	FButtonStyle ButtonStyle; // 0x30
};

struct AZombieCharacter {
	FMulticastInlineDelegate OnLockedInSafeRoom; // 0x1430
	FMulticastInlineDelegate OutOfRangeStateChanged; // 0x1440
	bool bLockedInSafeRoom; // 0x1450
	bool bInSafeRoom; // 0x1451
	bool bOutOfRange; // 0x1452
	UZombieGhostComponent* ZombieGhostComponent; // 0x1458
	FZombieUIData ZombieUIData; // 0x14a0
	float FloatingReticleInterpolationSpeed; // 0x15c0
	float DamageInflictedMutationPoints; // 0x15c4
	int32_t KillInflictedMutationPoints; // 0x15c8
	int32_t IncapInflictedMutationPoints; // 0x15cc
	TArray<float> ZombieAdvantageMutationGainScalar; // 0x15d0
	TArray<float> ZombieDisdvantageMutationGainScalar; // 0x15e0
};

struct UInterpTrackMove {
	FInterpCurveVector PosTrack; // 0x78
	FInterpCurveVector EulerTrack; // 0x90
	FInterpLookupTrack LookupTrack; // 0xa8
	FName LookAtGroupName; // 0xb8
	float LinCurveTension; // 0xc0
	float AngCurveTension; // 0xc4
	char bUseQuatInterpolation : 1; // 0xc8
	char bShowArrowAtKeys : 1; // 0xc8
	char bDisableMovement : 1; // 0xc8
	char bShowTranslationOnCurveEd : 1; // 0xc8
	char bShowRotationOnCurveEd : 1; // 0xc8
	char bHide3DTrack : 1; // 0xc8
	EInterpTrackMoveRotMode RotMode; // 0xcc
};

struct UEnvQueryContext_Character {
	AGobiCharacter* CharacterClass; // 0x30
};

struct UBTDecorator_SetBlackboardKey {
	FBlackboardKeySet KeySet; // 0x70
};

struct UDeviceProfileManager {
	TArray<UObject*> Profiles; // 0x30
};

struct UVoiceRoutingComponent {
	UMatchmaking* Matchmaking; // 0xe8
};

struct UPawnAction_Sequence {
	TArray<UPawnAction*> ActionSequence; // 0xa0
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xb0
	UPawnAction* RecentActionCopy; // 0xb8
};

struct UHitMarkerUserWidget {
	UWidgetAnimation* Show; // 0x4c8
	UTexture2D* ArmorHitTexture; // 0x4d0
	UTexture2D* ArmorBrokenTexture; // 0x4d8
	float LineThickness; // 0x4e0
	float ExtendedLength; // 0x4e4
	float ShortLength; // 0x4e8
	FSlateColor GeneralDamageColor; // 0x4f0
	FSlateColor FriendlyFireColor; // 0x520
	FSlateColor HitArmorColor; // 0x550
	FSlateColor DestroyedArmorColor; // 0x580
	FSlateColor HitWeakSpotColor; // 0x5b0
	FSlateColor DestroyedWeakSpotColor; // 0x5e0
	FSlateColor KilledColor; // 0x610
};

struct UPawnNoiseEmitterComponent {
	char bAIPerceptionSystemCompatibilityMode : 1; // 0xe8
	FVector LastRemoteNoisePosition; // 0xec
	float NoiseLifetime; // 0xf8
	float LastRemoteNoiseVolume; // 0xfc
	float LastRemoteNoiseTime; // 0x100
	float LastLocalNoiseVolume; // 0x104
	float LastLocalNoiseTime; // 0x108
};

struct UMaterialExpressionComponentMask {
	FExpressionInput Input; // 0x48
	char R : 1; // 0x5c
	char G : 1; // 0x5c
	char B : 1; // 0x5c
	char A : 1; // 0x5c
};

struct UMovieSceneVectorTrack {
	int32_t NumChannelsUsed; // 0x90
};

struct UAISeparationGroups {
	TArray<FAISeparationGroup> Groups; // 0x38
};

struct UWrapBox {
	FVector2D InnerSlotPadding; // 0x160
	float WrapWidth; // 0x168
	bool bExplicitWrapWidth; // 0x16c
};

struct UEnvQueryTest_VoronoiDepth {
	UEnvQueryContext* RegionSource; // 0x208
	UEnvQueryContext* SampleSources; // 0x210
};

struct UVendorComponent {
	TArray<FVendorStockItem> VendorStock; // 0xe8
	TArray<FRolledVendorStockItemParams> RandomItemStockParams; // 0xf8
