// Created by BlueFire1337
// Updated 2022-01-20
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x1ce2098;
	constexpr auto GObjects = 0x1ce2a10;
	constexpr auto UEngine = 0x1ceff68;
}

struct UDistributionFloat : UComponent {
	FPointer VfTable_FCurveEdInterface; // 0x70
	uint32_t bCanBeBaked : 1; // 0x78
	uint32_t bIsDirty : 1; // 0x78
};

struct UActorFactoryFracturedStaticMesh : UActorFactory {
	ObjectProperty FracturedStaticMesh; // 0x9c
	FVector DrawScale3D; // 0xa4
};

struct UActorFactoryVehicle : UActorFactory {
	AVehicle* VehicleClass; // 0x9c
};

struct UParticleModuleAccelerationBase : UParticleModule {
	uint32_t bAlwaysInWorldSpace : 1; // 0x68
};

struct UCombatExplosion : UGameExplosion {
	float MinDamage; // 0x148
	float FullDamageRadius; // 0x14c
	float AmbientExploDamageRadius; // 0x150
	FDecalData DecalData; // 0x154
	float DecalTraceDistance; // 0x184
	ObjectProperty RadialuBlurMaterial; // 0x188
	float RadialBlurFallOffExponent; // 0x190
	float RadialBlurScale; // 0x194
	uint32_t ForceHitNormalCheckForDecal : 1; // 0x198
	uint32_t bIgnoreBlock : 1; // 0x198
	uint32_t bIgnoreBlockForCamShake : 1; // 0x198
	uint32_t bIgnoreCamShake : 1; // 0x198
	uint32_t IsPlantExplosion : 1; // 0x198
	TArray<FExplosionDamageAdjustment> DamageAdjustmentList; // 0x19c
	float DamageRatioForInstigator; // 0x1ac
	float CheckOffSet; // 0x1b0
	FRotator AddParticleSpawnRotation; // 0x1b4
};

struct AFracturedStaticMeshPart : AFracturedStaticMeshActor {
	float DestroyPartRadiusFactor; // 0x2d8
	ObjectProperty BaseFracturedMeshActor; // 0x2dc
	uint32_t bHasBeenRecycled : 1; // 0x2e4
	uint32_t bChangeRBChannelWhenAsleep : 1; // 0x2e4
	uint32_t bCompositeThatExplodesOnImpact : 1; // 0x2e4
	float LastSpawnTime; // 0x2e8
	int32_t PartPoolIndex; // 0x2ec
	float FracPartGravScale; // 0x2f0
	ERBCollisionChannel AsleepRBChannel; // 0x2f4
	FVector OldVelocity; // 0x2f8
	float CurrentVibrationLevel; // 0x304
	float LastImpactSoundTime; // 0x308
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x7c
};

struct UParticleModuleColor : UParticleModuleColorBase {
	FRawDistributionVector StartColor; // 0x68
	FRawDistributionFloat StartAlpha; // 0x8c
	uint32_t bClampAlpha : 1; // 0xb0
};

struct ADynamicPylon : APylon {
	uint32_t bMoving : 1; // 0x454
};

struct USeqCond_SwitchObject : USeqCond_SwitchBase {
	TArray<FSwitchObjectCase> SupportedValues; // 0xec
};

struct AAISpawnPoint : ANavigationPoint {
	EAITeamInfo TeamIndex; // 0x33c
	FColor TeamColor[0x3]; // 0x340
};

struct UMcpUserManager : UMcpUserManagerBase {
	TArray<FMcpUserStatus> UserStatuses; // 0xb8
	FString RegisterUserMcpUrl; // 0xc8
	FString RegisterUserEmailUrl; // 0xd8
	FString RegisterUserFacebookUrl; // 0xe8
	FString QueryUserUrl; // 0xf8
	FString QueryUsersUrl; // 0x108
	FString DeleteUserUrl; // 0x118
	TArray<FRegisterUserRequest> RegisterUserRequests; // 0x128
	TArray<ObjectProperty> QueryUsersRequests; // 0x138
	TArray<ObjectProperty> DeleteUserRequests; // 0x148
};

struct UCombatDataTableRefShopCategory : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t IndexType; // 0x80
	FString ShopCodename; // 0x84
	int32_t ServiceType; // 0x94
	int32_t SubCategoryType; // 0x98
	int32_t DisplaynameID; // 0x9c
};

struct UUIDataProvider_SettingsArray : UUIDataProvider {
	ObjectProperty Settings; // 0x70
	int32_t SettingsId; // 0x78
	FName SettingsName; // 0x7c
	FString ColumnHeaderText; // 0x84
	TArray<FIdToStringMapping> Values; // 0x94
};

struct UCombatFrontEnd_UserInfo : UCombatFrontEnd_Object {
	TArray<int32_t> MainTabIDList; // 0xd0
	FSubTabInfo SubTabList[0x9]; // 0xe0
	FCompetitionStringIDInfo _CompetitionStringIDInfo[0x3]; // 0x1b8
	FRecordInfo _RecordInfo[0xd]; // 0x1f4
	ObjectProperty UserInfoTran; // 0x3c8
	ObjectProperty MissionList; // 0x3d0
};

struct USeqAct_Log : USequenceAction {
	uint32_t bOutputToScreen : 1; // 0x108
	uint32_t bIncludeObjComment : 1; // 0x108
	float TargetDuration; // 0x10c
	FVector TargetOffset; // 0x110
	FString LogMessage; // 0x11c
};

struct USplineAudioComponent : UAudioComponent {
	float ListenerScopeRadius; // 0x2a0
	int32_t ClosestPointOnSplineIndex; // 0x2a4
	TArray<FInterpPointOnSpline> Points; // 0x2a8
};

struct UOnlinePlaylistProvider : UUIResourceDataProvider {
	int32_t PlaylistId; // 0x94
	TArray<FName> PlaylistGameTypeNames; // 0x98
	FString DisplayName; // 0xa8
	int32_t Priority; // 0xb8
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct AVolumePathNode : APathNode {
	float StartingRadius; // 0x33c
	float StartingHeight; // 0x340
};

struct UAnimNotify_Kismet : UAnimNotify {
	FName NotifyName; // 0x60
};

struct UDrawConeComponent : UPrimitiveComponent {
	FColor ConeColor; // 0x250
	float ConeRadius; // 0x254
	float ConeAngle; // 0x258
	int32_t ConeSides; // 0x25c
};

struct USeqAct_Switch : USequenceAction {
	int32_t LinkCount; // 0x108
	int32_t IncrementAmount; // 0x10c
	uint32_t bLooping : 1; // 0x110
	uint32_t bAutoDisableLinks : 1; // 0x110
	TArray<int32_t> Indices; // 0x114
};

struct UUIDataStore_DynamicResource : UUIDataStore {
	ObjectProperty ProfileProvider; // 0x98
	ObjectProperty GameResourceDataStore; // 0xa0
	TArray<FDynamicResourceProviderDefinition> ResourceProviderDefinitions; // 0xa8
	FMultiMap_Mirror ResourceProviders; // 0xb8
};

struct AFluidInfluenceActor : AActor {
	ComponentProperty FlowDirection; // 0x244
	ComponentProperty Sprite; // 0x24c
	ComponentProperty InfluenceComponent; // 0x254
	uint32_t bActive : 1; // 0x25c
	uint32_t bToggled : 1; // 0x25c
};

struct UCombatFrontEnd_CharacterInfo : UCombatFrontEnd_Scene {
	ObjectProperty TabList[0x4]; // 0xd0
};

struct ANxGenericForceFieldBox : ANxGenericForceField {
	ComponentProperty RenderComponent; // 0x338
	FVector BoxExtent; // 0x340
};

struct UCombatDataTableRefPingGroupBindRegion : UCombatDataTableType {
	int32_t Index; // 0x6c
	int32_t ServiceRegionID; // 0x70
	int32_t PingGroupID; // 0x74
};

struct ACombatProjectile : AProjectile {
	uint32_t bSuppressAudio : 1; // 0x2a0
	uint32_t bAutoStartInFlightAudio : 1; // 0x2a0
	uint32_t bIgnoreInstigatorCollision : 1; // 0x2a0
	uint32_t bAddBaseVelocity : 1; // 0x2a0
	uint32_t bThrowSound : 1; // 0x2a0
	uint32_t bRegisterIndicator : 1; // 0x2a0
	uint32_t bInitRotation : 1; // 0x2a0
	uint32_t bDeactivateTrailWhenStopped : 1; // 0x2a0
	uint32_t bUseZeroExtentCollision : 1; // 0x2a0
	uint32_t bStopSimulation : 1; // 0x2a0
	uint32_t BounceOnAPawn : 1; // 0x2a0
	uint32_t bWaitForEffects : 1; // 0x2a0
	uint32_t bIgnoreEventChangedInstigator : 1; // 0x2a0
	uint32_t bIgnoreCamShake : 1; // 0x2a0
	uint32_t bIgnoreBlockForCamShake : 1; // 0x2a0
	ComponentProperty InFlightSound; // 0x2a4
	ObjectProperty InFlightSoundTemplate; // 0x2ac
	ObjectProperty TrailTemplate; // 0x2b4
	ComponentProperty TrailPSC; // 0x2bc
	ComponentProperty ProjLightEnvironment; // 0x2c4
	float ExploCameraEffectRadius; // 0x2cc
	float TossZ; // 0x2d0
	float TossUpDegree; // 0x2d4
	float GravityScale; // 0x2d8
	float IndicatorPriority; // 0x2dc
	float GrenadeIndicatorsUpdateCycle; // 0x2e0
	float GrenadeIndicatorsLastUpdateTime; // 0x2e4
	float RegisterIndicatorDelayTime; // 0x2e8
	float SimFixedFPS; // 0x2ec
	float SimFixedTimeStep; // 0x2f0
	float SimInternalAdvanceTime; // 0x2f4
	int32_t WeaponIndex; // 0x2f8
	FVector InitialLocation; // 0x2fc
	FRotator InitialRotation; // 0x308
	FVector InitialVelocity; // 0x314
	char NotifyMovement; // 0x320
	EExplosionEffectType ExplosionEffectType; // 0x321
	FVector LastHitNormal; // 0x324
	ComponentProperty Mesh; // 0x330
	ComponentProperty SkeletalMeshComp; // 0x338
	ComponentProperty StaticMeshComp; // 0x340
	FMeshPart ProjSkeletalMeshParts; // 0x348
	FStaticMeshPart ProjStaticMeshParts; // 0x364
	ObjectProperty ProjSkeletalPhysicsAsset; // 0x370
	TArray<FExplosionDamageAdjustment> DamageAdjustmentList; // 0x378
	float DamageRatioForInstigator; // 0x388
	float AIModeDamageRate; // 0x38c
};

struct USeqAct_SetInt : USeqAct_SetSequenceVariable {
	int32_t Target; // 0x108
	TArray<int32_t> Value; // 0x10c
};

struct UCombatFrontEnd_Sort : UCombatFrontEnd_Object {
	FSortInfo InvenSortList[0x5]; // 0xd0
	FSortInfo ShopSortList[0x5]; // 0xf8
	int32_t CurrentSceneType; // 0x120
	int32_t SelectSortID; // 0x124
	uint32_t bAllSelect : 1; // 0x128
	TArray<int32_t> FilterIDList; // 0x12c
};

struct UOnlineSubsystemCommonImpl : UOnlineSubsystem {
	FPointer VoiceEngine; // 0x1bc
	int32_t MaxLocalTalkers; // 0x1c4
	int32_t MaxRemoteTalkers; // 0x1c8
	uint32_t bIsUsingSpeechRecognition : 1; // 0x1cc
	ObjectProperty GameInterfaceImpl; // 0x1d0
	ObjectProperty AuthInterfaceImpl; // 0x1d8
};

struct UCoverMeshComponent : UStaticMeshComponent {
	TArray<FCoverMeshes> Meshes; // 0x2f4
	FVector LocationOffset; // 0x304
	ObjectProperty AutoAdjustOn; // 0x310
	ObjectProperty AutoAdjustOff; // 0x318
	ObjectProperty Disabled; // 0x320
	uint32_t bShowWhenNotSelected : 1; // 0x328
};

struct UCombatAnimNodeSeq_Offset : UAnimNodeSequence {
	uint32_t bUseOffset : 1; // 0x158
	float StartOffset; // 0x15c
	FName AlternativeAnimSeqName; // 0x160
	ObjectProperty Weapon; // 0x168
};

struct USeqAct_CombatPlayRandomBoxScene : USequenceAction {
	int32_t RandomBoxGrade; // 0x108
};

struct UCombatDataTableRefDefine : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString DefineName; // 0x70
	E_VALUE_TYPE ValueType; // 0x80
	FString Value; // 0x84
};

struct UShadowMap2D : UObject {
	ObjectProperty Texture; // 0x60
	FVector2D CoordinateScale; // 0x68
	FVector2D CoordinateBias; // 0x70
	FGuid LightGuid; // 0x78
	uint32_t bIsShadowFactorTexture : 1; // 0x88
	ComponentProperty Component; // 0x8c
	int32_t InstanceIndex; // 0x94
};

struct UCombatAnimNodeSeqWeap : UCombatAnimNodeSequence {
	FName DefaultAnim; // 0x16c
	FName DualPistolAnim; // 0x174
	FName SinglePistolAnim; // 0x17c
	FName ShoulderRocketAnim; // 0x184
	FName StingerAnim; // 0x18c
};

struct UPBRuleNodeSize : UPBRuleNodeBase {
	EProcBuildingAxis SizeAxis; // 0x70
	float DecisionSize; // 0x74
	uint32_t bUseTopLevelScopeSize : 1; // 0x78
};

struct UParticleModuleMeshRotation : UParticleModuleRotationBase {
	FRawDistributionVector StartRotation; // 0x68
	uint32_t bInheritParent : 1; // 0x8c
};

struct ACombatIngameVoteManager : AReplicationInfo {
	int32_t CurrentVoteType; // 0x244
	int32_t VoteMaxTime; // 0x248
	int32_t VoteMaxCoolTime; // 0x24c
	int32_t VoteCanRound; // 0x250
	int32_t VoteRemainTime; // 0x254
	int32_t VoteCoolTime; // 0x258
	int32_t VoteStartUserCount; // 0x25c
	int32_t TeamIndex; // 0x260
	ObjectProperty CurrentVoteClass; // 0x264
};

struct UCombatVoiceInterfaceVivox : UObject {
	FString KeyString; // 0x60
	FString PlayerName; // 0x70
	FString VivoxAccountName; // 0x80
	FString VivoxAccountUri; // 0x90
	FString VivoxEchoChannelUri; // 0xa0
	FString VivoxTestChannelUri; // 0xb0
	FString VivoxTeamChannelUri; // 0xc0
	TArray<FString> VivoxAccountNames; // 0xd0
	uint32_t bCombineLogin : 1; // 0xe0
	uint32_t bIsConnected : 1; // 0xe0
	uint32_t bIsLoggedIn : 1; // 0xe0
	uint32_t bIsChannelJoined : 1; // 0xe0
	int32_t SerialNumber; // 0xe4
	ObjectProperty CPC; // 0xe8
	float RefuseVoiceMeterEnergy; // 0xf0
	float CurrentRefuseVoiceMeterEnergy; // 0xf4
	TArray<FDelayedCallbackFunctionData> DelayedCallbackFunctions; // 0xf8
	float DelayedCallbackFunctionsCheckTimerDelta; // 0x108
	float DelayedCallbackFunctionsCheckCycle; // 0x10c
	FString OSInputDeviceName; // 0x110
	FString APPInputDeviceName; // 0x120
	TArray<FString> InputDeviceNameList; // 0x130
};

struct UGFxAction_SetVariable : USequenceAction {
	ObjectProperty Movie; // 0x108
	FString Variable; // 0x110
};

struct UPBRuleNodeTransform : UPBRuleNodeBase {
	ComponentProperty Translation; // 0x70
	ComponentProperty Rotation; // 0x78
	ComponentProperty Scale; // 0x80
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x60
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxisAndAngle; // 0xb0
	FExpressionInput PositionOnAxis; // 0xe4
	FExpressionInput Position; // 0x118
};

struct AMaterialInstanceTimeVaryingActor : AActor {
	ObjectProperty MatInst; // 0x244
};

struct USeqAct_Interp : USeqAct_Latent {
	TMap<None, None> SavedActorTransforms; // 0x120
	TMap<None, None> SavedActorVisibilities; // 0x168
	float PlayRate; // 0x1b0
	float Position; // 0x1b4
	float ForceStartPosition; // 0x1b8
	uint32_t bIsPlaying : 1; // 0x1bc
	uint32_t bPaused : 1; // 0x1bc
	uint32_t bIsBeingEdited : 1; // 0x1bc
	uint32_t bLooping : 1; // 0x1bc
	uint32_t bRewindOnPlay : 1; // 0x1bc
	uint32_t bNoResetOnRewind : 1; // 0x1bc
	uint32_t bRewindIfAlreadyPlaying : 1; // 0x1bc
	uint32_t bReversePlayback : 1; // 0x1bc
	uint32_t bInterpForPathBuilding : 1; // 0x1bc
	uint32_t bForceStartPos : 1; // 0x1bc
	uint32_t bDisableRadioFilter : 1; // 0x1bc
	uint32_t bClientSideOnly : 1; // 0x1bc
	uint32_t bSkipUpdateIfNotVisible : 1; // 0x1bc
	uint32_t bIsSkippable : 1; // 0x1bc
	uint32_t bShouldShowGore : 1; // 0x1bc
	TArray<ObjectProperty> LinkedCover; // 0x1c0
	ObjectProperty InterpData; // 0x1d0
	TArray<ObjectProperty> GroupInst; // 0x1d8
	AMatineeActor* ReplicatedActorClass; // 0x1e8
	ObjectProperty ReplicatedActor; // 0x1f0
	int32_t PreferredSplitScreenNum; // 0x1f8
	TArray<FCameraCutInfo> CameraCuts; // 0x1fc
	float TerminationTime; // 0x20c
	FRenderingPerformanceOverrides RenderingOverrides; // 0x210
	char ConstantCameraAnim; // 0x214
	float ConstantCameraAnimRate; // 0x218
};

struct UInterpTrackFloatBase : UInterpTrack {
	FInterpCurveFloat FloatTrack; // 0xa0
	float CurveTension; // 0xb4
};

struct UCCSBTMelee : UCCSBTScriptBehavior {
	float BlendInTime; // 0xd4
	float BlendOutTime; // 0xd8
	FName MeleeBlendName; // 0xdc
	FName MeleeSequenceName; // 0xe4
	ObjectProperty MeleeBlend; // 0xec
	ObjectProperty MeleeSequence; // 0xf4
};

struct UCBGunMuzzleFlashLight : UCombatExplosionLight {
	TArray<FLightValues> RedTeamTimeShift; // 0x26c
	TArray<FLightValues> BlueTeamTimeShift; // 0x27c
};

struct UCombatHUD_MarkerContainer : UCombatHUDEntity_Base {
	ObjectProperty AttachLayerMC; // 0xc0
	TArray<FMarkerObjectData> Markers; // 0xc8
	TArray<FPendingMarkerData> PendingMarkerList; // 0xd8
};

struct ULensFlareComponent : UPrimitiveComponent {
	ObjectProperty Template; // 0x250
	ComponentProperty PreviewInnerCone; // 0x258
	ComponentProperty PreviewOuterCone; // 0x260
	ComponentProperty PreviewRadius; // 0x268
	uint32_t bAutoActivate : 1; // 0x270
	uint32_t bIsActive : 1; // 0x270
	uint32_t bHasTranslucency : 1; // 0x270
	uint32_t bHasUnlitTranslucency : 1; // 0x270
	uint32_t bHasUnlitDistortion : 1; // 0x270
	uint32_t bUsesSceneColor : 1; // 0x270
	uint32_t bHasSeparateTranslucency : 1; // 0x270
	uint32_t bUseTrueConeCalculation : 1; // 0x270
	uint32_t bVisibleForMobile : 1; // 0x270
	uint32_t bForceRendering : 1; // 0x270
	float OuterCone; // 0x274
	float InnerCone; // 0x278
	float ConeFudgeFactor; // 0x27c
	float Radius; // 0x280
	float MinStrength; // 0x284
	FLinearColor SourceColor; // 0x288
	TArray<FLensFlareElementMaterials> Materials; // 0x298
	FPointer ReleaseResourcesFence; // 0x2a8
	float NextTraceTime; // 0x2b0
};

struct UExporter : UObject {
	TArray<FString> FormatExtension; // 0x68
	TArray<FString> FormatDescription; // 0x78
};

struct UAnimSequence : UObject {
	FName SequenceName; // 0x60
	TArray<FAnimNotifyEvent> Notifies; // 0x68
	TArray<ObjectProperty> MetaData; // 0x78
	TArray<FSkelControlModifier> BoneControlModifiers; // 0x88
	float SequenceLength; // 0x98
	int32_t NumFrames; // 0x9c
	float RateScale; // 0xa0
	float TargetLength; // 0xa4
	uint32_t bNoLoopingInterpolation : 1; // 0xa8
	uint32_t ShowMeshFlippedInEditor : 1; // 0xa8
	uint32_t bIsAdditive : 1; // 0xa8
	uint32_t bAdditiveBuiltLooping : 1; // 0xa8
	uint32_t bDoNotOverrideCompression : 1; // 0xa8
	uint32_t bHasBeenUsed : 1; // 0xa8
	uint32_t bWasCompressedWithoutTranslations : 1; // 0xa8
	uint32_t bRotationOnly : 1; // 0xa8
	TArray<FRawAnimSequenceTrack> RawAnimData; // 0xac
	TArray<FRawAnimSequenceTrack> RawAnimationData; // 0xbc
	TArray<FTranslationTrack> TranslationData; // 0xcc
	TArray<FRotationTrack> RotationData; // 0xdc
	TArray<FCurveTrack> CurveData; // 0xec
	AnimationCompressionFormat TranslationCompressionFormat; // 0xfc
	AnimationCompressionFormat RotationCompressionFormat; // 0xfd
	AnimationKeyFormat KeyEncodingFormat; // 0xfe
	TArray<int32_t> CompressedTrackOffsets; // 0x100
	TArray<char> CompressedByteStream; // 0x110
	FPointer TranslationCodec; // 0x120
	FPointer RotationCodec; // 0x128
	TArray<FBoneAtom> AdditiveRefPose; // 0x130
	TArray<FRawAnimSequenceTrack> AdditiveBasePose; // 0x140
	int32_t EncodingPkgVersion; // 0x150
	float UseScore; // 0x154
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x60
	int32_t SubUVDataOffset; // 0x68
	EEmitterRenderMode EmitterRenderMode; // 0x6c
	TArray<ObjectProperty> LODLevels; // 0x70
	uint32_t ConvertedModules : 1; // 0x80
	uint32_t bCollapsed : 1; // 0x80
	uint32_t bIsSoloing : 1; // 0x80
	uint32_t bCookedOut : 1; // 0x80
	int32_t PeakActiveParticles; // 0x84
	int32_t InitialAllocationCount; // 0x88
	TArray<float> MediumDetailSpawnRateScale; // 0x8c
};

struct UNxForceFieldComponent : UPrimitiveComponent {
	ObjectProperty Shape; // 0x250
	ComponentProperty DrawComponent; // 0x258
	int32_t ExcludeChannel; // 0x260
	uint32_t bForceActive : 1; // 0x264
	uint32_t bDestroyWhenInactive : 1; // 0x264
	FRBCollisionChannelContainer CollideWithChannels; // 0x268
	float Duration; // 0x26c
	FPointer ForceField; // 0x270
	TArray<FPointer> ConvexMeshes; // 0x278
	TArray<FPointer> ExclusionShapes; // 0x288
	TArray<FPointer> ExclusionShapePoses; // 0x298
	int32_t SceneIndex; // 0x2a8
	float ElapsedTime; // 0x2ac
	ComponentProperty RenderComponent; // 0x2b0
	FPointer RBPhysScene; // 0x2b8
};

struct USeqAct_SetCameraTarget : USequenceAction {
	ObjectProperty CameraTarget; // 0x108
	FViewTargetTransitionParams TransitionParams; // 0x110
};

struct UMicroTransactionBase : UPlatformInterfaceBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x80
	FString LastError; // 0x90
	FString LastErrorSolution; // 0xa0
};

struct UCombatDataTableRefRematchOption : UCombatDataTableType {
	FString CodeName; // 0x6c
	int32_t StartableMinUser; // 0x7c
	int32_t GroupMinUser; // 0x80
	uint32_t AutoBalance : 1; // 0x84
	int32_t CountdownWaitSec; // 0x88
};

struct AGamePlayEvent_Kill : AActor {
	int32_t KillPacketCount; // 0x244
	FTakeDamageData SavedTakeDamageData; // 0x248
	float LastKillTimeResetTime; // 0x2c0
	int32_t LongShotCondition; // 0x2c4
	float AssistCondition; // 0x2c8
	float DangerousKillCondition; // 0x2cc
	float RescueConditionTime; // 0x2d0
	float RescueCondition; // 0x2d4
	int32_t MultiKillConditon; // 0x2d8
	int32_t ComeBackCondition; // 0x2dc
	int32_t EnemyKillCondition; // 0x2e0
	float TeamRevengeCondition; // 0x2e4
	int32_t ConsecutiveAssistCondition; // 0x2e8
	int32_t ConsecutiveKillCondition; // 0x2ec
	TArray<FKillTableDataType> TableDataList; // 0x2f0
	TArray<FTableInfoContainer> TableInfoList; // 0x300
	TArray<FName> RegisteredStates; // 0x310
	uint32_t bSuicide : 1; // 0x320
	TArray<int32_t> OtherPlayerRewardMask; // 0x324
	char ProcessingStateIndex; // 0x334
	TMap<None, None> Achievement; // 0x338
	FString CurrentMissionNameOfVictim; // 0x380
	ObjectProperty VictimPawn; // 0x390
	ObjectProperty KillerPawn; // 0x398
	ObjectProperty VictimCombatPawn; // 0x3a0
	ObjectProperty KillerCombatPawn; // 0x3a8
	ObjectProperty VictimController; // 0x3b0
	ObjectProperty KillerController; // 0x3b8
	ObjectProperty KillerPRI; // 0x3c0
	ObjectProperty VictimPRI; // 0x3c8
	ObjectProperty VictimCombatPRI; // 0x3d0
	ObjectProperty KillerCombatPRI; // 0x3d8
};

struct UCombatHUD_GOContainer : UCombatHUDEntity_Base {
	TArray<ObjectProperty> Components; // 0xc0
	int32_t Count; // 0xd0
	int32_t LastGOLocalMessageID; // 0xd4
};

struct UCombatDataTableRefItemUnLockRecipe : UCombatDataTableType {
	FString ItemCodeName; // 0x6c
	FString KeyCodeName; // 0x7c
	FString OutPutItemCodeName; // 0x8c
};

struct UMaterialExpressionStaticComponentMaskParameter : UMaterialExpressionParameter {
	FExpressionInput Input; // 0xd0
	uint32_t DefaultR : 1; // 0x104
	uint32_t DefaultG : 1; // 0x104
	uint32_t DefaultB : 1; // 0x104
	uint32_t DefaultA : 1; // 0x104
	FPointer InstanceOverride; // 0x108
};

struct ANxTornadoForceField : ANxForceField {
	float RadialStrength; // 0x298
	float RotationalStrength; // 0x29c
	float LiftStrength; // 0x2a0
	float ForceRadius; // 0x2a4
	float ForceTopRadius; // 0x2a8
	float LiftFalloffHeight; // 0x2ac
	float EscapeVelocity; // 0x2b0
	float ForceHeight; // 0x2b4
	float HeightOffset; // 0x2b8
	uint32_t BSpecialRadialForceMode : 1; // 0x2bc
	FPointer Kernel; // 0x2c0
};

struct UCombatOnlineMetaphors : UObject {
	float BUFF_ADDMAINAMMO_MIN; // 0x60
	float BUFF_ADDMAINAMMO_MAX; // 0x64
	float BUFF_ADDSUBAMMO_MIN; // 0x68
	float BUFF_ADDSUBAMMO_MAX; // 0x6c
	float BUFF_RELOADING_RATE_MIN; // 0x70
	float BUFF_RELOADING_RATE_MAX; // 0x74
	float BUFF_WEAPONCHANGE_RATE_MIN; // 0x78
	float BUFF_WEAPONCHANGE_RATE_MAX; // 0x7c
	float BUFF_MAXAUTOCUREHEALTH_MIN; // 0x80
	float BUFF_MAXAUTOCUREHEALTH_MAX; // 0x84
	float BUFF_HEALTHCURE_RATE_MIN; // 0x88
	float BUFF_HEALTHCURE_RATE_MAX; // 0x8c
	float BUFF_CROUCHSPEED_RATE_MIN; // 0x90
	float BUFF_CROUCHSPEED_RATE_MAX; // 0x94
	float BUFF_FPSSPEED_RATE_MIN; // 0x98
	float BUFF_FPSSPEED_RATE_MAX; // 0x9c
	float BUFF_ACCELATION_RATE_MIN; // 0xa0
	float BUFF_ACCELATION_RATE_MAX; // 0xa4
	float BUFF_RUNSPEED_RATE_MIN; // 0xa8
	float BUFF_RUNSPEED_RATE_MAX; // 0xac
	float BUFF_SPRINTSPEED_RATE_MIN; // 0xb0
	float BUFF_SPRINTSPEED_RATE_MAX; // 0xb4
	float BUFF_DETAILEDRADAR_DISTANCE_MIN; // 0xb8
	float BUFF_DETAILEDRADAR_DISTANCE_MAX; // 0xbc
	float BUFF_RADAR_RANGE_MIN; // 0xc0
	float BUFF_RADAR_RANGE_MAX; // 0xc4
	float BUFF_GUNATTACK_RATE_MIN; // 0xc8
	float BUFF_GUNATTACK_RATE_MAX; // 0xcc
	float BUFF_GUNGUARD_RATE_MIN; // 0xd0
	float BUFF_GUNGUARD_RATE_MAX; // 0xd4
	float BUFF_MELEEATTACK_RATE_MIN; // 0xd8
	float BUFF_MELEEATTACK_RATE_MAX; // 0xdc
	float BUFF_MELEEGUARD_RATE_MIN; // 0xe0
	float BUFF_MELEEGUARD_RATE_MAX; // 0xe4
	float BUFF_EXPLOSIVEATTACK_RATE_MIN; // 0xe8
	float BUFF_EXPLOSIVEATTACK_RATE_MAX; // 0xec
	float BUFF_EXPLOSIVEGUARD_RATE_MIN; // 0xf0
	float BUFF_EXPLOSIVEGUARD_RATE_MAX; // 0xf4
};

struct UCombatAnimBlendByDeath : UCombatAnimBlendBase {
	ObjectProperty Owner; // 0x144
	uint32_t bIsDeadOld : 1; // 0x14c
	float UndeadTime; // 0x150
	float NoAnimTheshold; // 0x154
};

struct ACombatAmmoPickupFactory : ACombatWeaponPickupFactory {
	int32_t MainAmmoRate; // 0x44c
	int32_t SubAmmoRate; // 0x450
	int32_t GrenadeRate_A; // 0x454
	int32_t GrenadeRate_B; // 0x458
	int32_t GrenadeRate_C; // 0x45c
};

struct UCombatFrontEnd_Login : UCombatFrontEnd_Scene {
	int32_t IDLabelID; // 0xd0
	int32_t PWLabelID; // 0xd4
	int32_t CheckBoxLabelID; // 0xd8
	int32_t OKBtnLabelID; // 0xdc
	int32_t CancelBtnLabelID; // 0xe0
	int32_t AccountBtnLabelID; // 0xe4
	int32_t OptionBtnLabelID; // 0xe8
	int32_t ExitBtnLabelID; // 0xec
	uint32_t bNeedLocalize : 1; // 0xf0
	uint32_t bSaveUserInfo : 1; // 0xf0
	FString loginID; // 0xf4
	FString userPW; // 0x104
	int32_t FailedLoginCount; // 0x114
	ObjectProperty StatusTF; // 0x118
};

struct UGripActionNode_MoveRightAndLeft : UCombatAIActionNodeBase {
	uint32_t bIsWalking : 1; // 0xf4
	float DirChangeTime; // 0xf8
};

struct UProcBuildingRuleset : UObject {
	ObjectProperty RootRule; // 0x60
	uint32_t bBeingEdited : 1; // 0x68
	uint32_t bEnableInteriorTexture : 1; // 0x68
	uint32_t bLODOnlyRoof : 1; // 0x68
	uint32_t bPickRandomSwatch : 1; // 0x68
	ObjectProperty DefaultRoofMaterial; // 0x6c
	ObjectProperty DefaultFloorMaterial; // 0x74
	ObjectProperty DefaultNonRectWallMaterial; // 0x7c
	float RoofZOffset; // 0x84
	float NotRoofZOffset; // 0x88
	float FloorZOffset; // 0x8c
	float NotFloorZOffset; // 0x90
	float RoofPolyInset; // 0x94
	float FloorPolyInset; // 0x98
	float BuildingLODSpecular; // 0x9c
	float RoofEdgeScopeRaise; // 0xa0
	ObjectProperty LODCubemap; // 0xa4
	ObjectProperty InteriorTexture; // 0xac
	TArray<FPBVariationInfo> Variations; // 0xb4
	TArray<FPBParamSwatch> ParamSwatches; // 0xc4
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x68
	EParticleSourceSelectionMethod SelectionMethod; // 0x69
	FName SourceName; // 0x6c
	FRawDistributionFloat SourceStrength; // 0x74
	uint32_t bLockSourceStength : 1; // 0x98
	uint32_t bInheritRotation : 1; // 0x98
	int32_t SourceOffsetCount; // 0x9c
	TArray<FVector> SourceOffsetDefaults; // 0xa0
};

struct UCombatDialog : UCombatCommon_Base {
	ObjectProperty OKBtn; // 0xac
	ObjectProperty CancelBtn; // 0xb4
	DelegateProperty OKBtnDelegate; // 0xbc
	DelegateProperty CancelBtnDelegate; // 0xcc
};

struct ACombatTutorialGameReplicationInfo : ACombatAIGameReplicationInfo {
	TArray<ObjectProperty> Bombsites; // 0x400
	TArray<ObjectProperty> Bombs; // 0x410
	int32_t TotalBombsites; // 0x420
	int32_t TotalBombs; // 0x424
	WordProperty PlantedBombSettingTime; // 0x428
};

struct UGameCrowdAgentBehavior : UObject {
	ECrowdBehaviorEvent MyEventType; // 0x60
	ECrowdBehaviorEvent ViralBehaviorEvent; // 0x61
	float DurationOfBehavior; // 0x64
	float TimeUntilStopBehavior; // 0x68
	uint32_t bIdleBehavior : 1; // 0x6c
	uint32_t bFaceActionTargetFirst : 1; // 0x6c
	uint32_t bIsViralBehavior : 1; // 0x6c
	uint32_t bPassOnIsViralBehaviorFlag : 1; // 0x6c
	ObjectProperty ActionTarget; // 0x70
	float MaxPlayerDistance; // 0x78
	float ViralRadius; // 0x7c
	float DurationBeforeBecomesViral; // 0x80
	float TimeToBecomeViral; // 0x84
	float DurationOfViralBehaviorPropagation; // 0x88
	float TimeToStopPropagatingViralBehavior; // 0x8c
	ObjectProperty MyAgent; // 0x90
	FColor DebugBehaviorColor; // 0x98
};

struct USeqAct_SetCRandEXP : USequenceAction {
	int32_t CR; // 0x108
	int32_t Exp; // 0x10c
};

struct UUIDataStore_OnlineGameSearch : UUIDataStore_Remote {
	FName SearchResultsName; // 0x98
	ObjectProperty OnlineSub; // 0xa0
	TScriptInterface<Class> GameInterface; // 0xa8
	TArray<FGameSearchCfg> GameSearchCfgList; // 0xb8
	int32_t SelectedIndex; // 0xc8
	int32_t ActiveSearchIndex; // 0xcc
};

struct UUIResourceCombinationProvider : UUIDataProvider {
	ObjectProperty StaticDataProvider; // 0x70
	ObjectProperty ProfileProvider; // 0x78
};

struct UUISceneClient : UUIRoot {
	FPointer VfTable_FExec; // 0x70
	FPointer RenderViewport; // 0x78
	FIntPoint MousePosition; // 0x80
	ObjectProperty DataStoreManager; // 0x88
	FMatrix CanvasToScreen; // 0x90
	FMatrix InvCanvasToScreen; // 0xd0
	ObjectProperty UIScenePostProcess; // 0x110
	uint32_t bEnablePostProcess : 1; // 0x118
};

struct UCombatFPMuzzleFlashLight : UPointLightComponent {
	uint32_t bInitialized : 1; // 0x240
	float Lifetime; // 0x244
	int32_t TimeShiftIndex; // 0x248
	TArray<FLightValues> TimeShift; // 0x24c
	DelegateProperty __OnLightFinished__Delegate; // 0x25c
};

struct ACombatPlayerControllerBase : AGamePlayerController {
	float AirSpeed; // 0x750
	ObjectProperty CBHUD; // 0x754
	ObjectProperty UIDataStore_PendingDialogMessage; // 0x75c
	ObjectProperty UIDataStore_ETC; // 0x764
	ObjectProperty CombatPRI; // 0x76c
	uint32_t bAimAssistEnabled : 1; // 0x774
	uint32_t bMeleeAssistEnabled : 1; // 0x774
	uint32_t bIsLocalPC : 1; // 0x774
	uint32_t bIgnoreWeaponInput : 1; // 0x774
	uint32_t bIgnoreInput : 1; // 0x774
	uint32_t bScreenShotRequest : 1; // 0x774
	ObjectProperty CameraAnimPlayer; // 0x778
	ObjectProperty CurrentCameraAnimInstant; // 0x780
	FPostProcessSettings CamOverridePostProcess; // 0x788
	float ZoomFOVRatio; // 0x8ec
	ObjectProperty CombatCheatManager; // 0x8f0
	float CurrentInputExpireTime; // 0x8f8
	int32_t MaxWallHackCaptureCounter; // 0x8fc
	int32_t CurrentWallHackCaptureCounter; // 0x900
	char LastHackType; // 0x904
	char GRADE; // 0x905
};

struct USeqAct_CombatMeshTransform : USequenceAction {
	ObjectProperty Original; // 0x108
	ObjectProperty NewMesh; // 0x110
};

struct UOnlineImageDownloaderWeb : UObject {
	TArray<FOnlineImageDownload> DownloadImages; // 0x60
	int32_t MaxSimultaneousDownloads; // 0x70
	DelegateProperty __OnOnlineImageDownloaded__Delegate; // 0x74
};

struct UCombatAIActionBase : UObject {
	uint32_t bUseScriptTick : 1; // 0x60
	BTExecutionResult LastExecuteResult; // 0x64
	ObjectProperty Bot; // 0x68
	FName DebugName; // 0x70
};

struct ACombatProj_SpecialGrenade : ACombatProj_Grenade {
	float Lifetime; // 0x3f4
};

struct USeqVar_RandomFloat : USeqVar_Float {
	float Min; // 0xa4
	float Max; // 0xa8
};

struct UCombatStatisticsTransaction : UObject {
	ObjectProperty MissionList; // 0x60
	FMatchResultData ResultData; // 0x68
	FGrainInfoData UI_GrainData; // 0xa8
	TMap<None, None> Quest_InfoMap; // 0xc4
	FMatchResultMapInfoData MatchResultMap_InfoData; // 0x10c
	ObjectProperty CombatDBManager; // 0x124
	FString CachedClanName[0x2]; // 0x12c
	int32_t CachedClanID[0x2]; // 0x14c
	int32_t AttendID; // 0x154
	uint32_t bNeedPlayStampAnimation : 1; // 0x158
	uint32_t bNeedForceGotoEventScene : 1; // 0x158
	char InternetCafe_Benefit; // 0x15c
	int32_t DisperseRematchReason; // 0x160
};

struct UCombatAIDecisionComponent : UActorComponent {
	uint32_t bTriggered : 1; // 0x88
};

struct UUIDataStore_OnlineGameSettings : UUIDataStore_Settings {
	TArray<FGameSettingsCfg> GameSettingsCfgList; // 0x98
	UUIDataProvider_Settings* SettingsProviderClass; // 0xa8
	int32_t SelectedIndex; // 0xb0
};

struct ACombatArmsRacePRI : ACombatPlayerReplicationInfo {
	int32_t WeaponLevel; // 0x520
	int32_t KillPoint; // 0x524
	int32_t TotalKillPoint; // 0x528
	uint32_t bTopUser : 1; // 0x52c
	uint32_t oldTopUser : 1; // 0x52c
};

struct UAnimNodeBlendList : UAnimNodeBlendBase {
	TArray<float> TargetWeight; // 0x100
	float BlendTimeToGo; // 0x110
	int32_t ActiveChildIndex; // 0x114
	uint32_t bPlayActiveChild : 1; // 0x118
	uint32_t bForceChildFullWeightWhenBecomingRelevant : 1; // 0x118
	uint32_t bSkipBlendWhenNotRendered : 1; // 0x118
	float SliderPosition; // 0x11c
};

struct UCombatDamageType : UDamageType {
	FPointer VfTable_IInterface_CombatWeaponType; // 0x90
	uint32_t bCausesBlood : 1; // 0x98
	uint32_t bSimplifiedAnimDeath : 1; // 0x98
	uint32_t bCausesBloodSplatterDecals : 1; // 0x98
	uint32_t bFriendlyFire : 1; // 0x98
	uint32_t bIgnoreReward : 1; // 0x98
	uint32_t bPlacedWorld : 1; // 0x98
	uint32_t bDamagedBySkill : 1; // 0x98
	uint32_t bDamagedByPlayer : 1; // 0x98
	ObjectProperty DeathTimeDilationAnim; // 0x9c
	float SimplifiedMomentumFactor; // 0xa4
	float SimplifiedDeathUpkick; // 0xa8
	FName DeathStatsName; // 0xac
	FName SuicideStatsName; // 0xb4
	FString DeathString; // 0xbc
	FString FemaleSuicide; // 0xcc
	FString MaleSuicide; // 0xdc
	float TeammateDamageRate; // 0xec
	float SelfDamageRate; // 0xf0
	WEAPON_TYPES WeaponType; // 0xf4
	ECombatDamageType DamageType; // 0xf5
	char DamageAnimIndex; // 0xf6
	char SubIndex; // 0xf7
	FString WeaponStatType; // 0xf8
	TArray<FName> WeaponTypeName; // 0x108
};

struct UCombatSkill_UAVPatrol : UCombatActiveSkill {
	float PatrolTime; // 0xc8
	float FlightHeight; // 0xcc
	ObjectProperty UAV; // 0xd0
	FString UAV_ClassName; // 0xd8
};

struct AController : AActor {
	FPointer VfTable_IInterface_NavigationHandle; // 0x244
	ObjectProperty Pawn; // 0x24c
	ObjectProperty PlayerReplicationInfo; // 0x254
	int32_t PlayerNum; // 0x25c
	ObjectProperty NextController; // 0x260
	uint32_t bIsPlayer : 1; // 0x268
	uint32_t bGodMode : 1; // 0x268
	uint32_t bSoaking : 1; // 0x268
	uint32_t bSlowerZAcquire : 1; // 0x268
	uint32_t bNotifyPostLanded : 1; // 0x268
	uint32_t bNotifyApex : 1; // 0x268
	uint32_t bOverrideSearchStart : 1; // 0x268
	uint32_t bAdvancedTactics : 1; // 0x268
	uint32_t bCanDoSpecial : 1; // 0x268
	uint32_t bAdjusting : 1; // 0x268
	uint32_t bPreparingMove : 1; // 0x268
	uint32_t bForceStrafe : 1; // 0x268
	uint32_t bLOSflag : 1; // 0x268
	uint32_t bSkipExtraLOSChecks : 1; // 0x268
	uint32_t bNotifyFallingHitWall : 1; // 0x268
	uint32_t bEarlyOutOfSighTestsForSameType : 1; // 0x268
	uint32_t bPreciseDestination : 1; // 0x268
	uint32_t bSeeFriendly : 1; // 0x268
	uint32_t bUsingPathLanes : 1; // 0x268
	char bFire; // 0x26c
	char bAltFire; // 0x26d
	float MinHitWall; // 0x270
	UNavigationHandle* NavigationHandleClass; // 0x274
	ObjectProperty NavigationHandle; // 0x27c
	FVector OverrideSearchStart; // 0x284
	float MoveTimer; // 0x290
	ObjectProperty MoveTarget; // 0x294
	FBasedPosition DestinationPosition; // 0x29c
	FBasedPosition FocalPosition; // 0x2d4
	ObjectProperty Focus; // 0x30c
	ObjectProperty GoalList[0x4]; // 0x314
	FBasedPosition AdjustPosition; // 0x334
	ObjectProperty StartSpot; // 0x36c
	TArray<ObjectProperty> RouteCache; // 0x374
	ObjectProperty CurrentPath; // 0x384
	ObjectProperty NextRoutePath; // 0x38c
	FVector CurrentPathDir; // 0x394
	ObjectProperty RouteGoal; // 0x3a0
	float RouteDist; // 0x3a8
	float LastRouteFind; // 0x3ac
	ObjectProperty PendingMover; // 0x3b0
	ObjectProperty FailedMoveTarget; // 0x3b8
	int32_t MoveFailureCount; // 0x3c0
	float GroundPitchTime; // 0x3c4
	ObjectProperty ShotTarget; // 0x3c8
	ObjectProperty LastFailedReach; // 0x3d0
	float FailedReachTime; // 0x3d8
	FVector FailedReachLocation; // 0x3dc
	float SightCounter; // 0x3e8
	float SightCounterInterval; // 0x3ec
	float InUseNodeCostMultiplier; // 0x3f0
	int32_t HighJumpNodeCostModifier; // 0x3f4
	float MaxMoveTowardPawnTargetTime; // 0x3f8
	ObjectProperty Enemy; // 0x3fc
	TArray<FVisiblePortalInfo> VisiblePortals; // 0x404
	float LaneOffset; // 0x414
	FRotator OldBasedRotation; // 0x418
	FVector NavMeshPath_SearchExtent_Modifier; // 0x424
};

struct UTimeDilationAnim : UObject {
	ObjectProperty TimeDilationInterpGroup; // 0x60
	float AnimLength; // 0x68
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x60
	ObjectProperty PhysMaterial; // 0x68
	float Hardness; // 0x70
	uint32_t bNoWeightBlend : 1; // 0x74
};

struct USequenceVariable : USequenceObject {
	FName VarName; // 0x98
};

struct UPBRuleNodeWindowWall : UPBRuleNodeBase {
	float CellMaxSizeX; // 0x70
	float CellMaxSizeZ; // 0x74
	float WindowSizeX; // 0x78
	float WindowSizeZ; // 0x7c
	float WindowPosX; // 0x80
	float WindowPosZ; // 0x84
	uint32_t bScaleWindowWithCell : 1; // 0x88
	float YOffset; // 0x8c
	ObjectProperty Material; // 0x90
};

struct ACombatWeapAttachMeshActor : ASkeletalMeshActorMAT {
	ACombatWeapon* WeaponClass; // 0x2b4
	TArray<FMeshPart> SubPartList; // 0x2bc
	TArray<ComponentProperty> SubPartCompList; // 0x2cc
	uint32_t bShowSilence : 1; // 0x2dc
	uint32_t bShowLaserSite : 1; // 0x2dc
	uint32_t bUseFirstWeaponMesh : 1; // 0x2dc
	ComponentProperty LaserSitePSC; // 0x2e0
};

struct USeqEvent_MobileMotion : USeqEvent_MobileBase {
	float Roll; // 0x128
	float Pitch; // 0x12c
	float Yaw; // 0x130
	float DeltaRoll; // 0x134
	float DeltaPitch; // 0x138
	float DeltaYaw; // 0x13c
};

struct UCombatLocalPlayer : ULocalPlayer {
	eCombatPostProcess CurrentCombatPostProcess; // 0x434
	FPostProcessSettings MotionBlurPPSettings; // 0x438
	FPostProcessSettings ExposedPPSettings; // 0x59c
	FPostProcessSettings FlashbangPPSettings; // 0x700
	FPostProcessSettings WarmupPPSettings; // 0x864
	FPostProcessSettings CountdownPPSettings; // 0x9c8
	FPostProcessSettings RoundPPSettings; // 0xb2c
	FPostProcessSettings RoundOverPPSettings; // 0xc90
	FPostProcessSettings MatchOverPPSettings; // 0xdf4
	uint32_t bEnableMotionBlur : 1; // 0xf58
	uint32_t FullMotionBlur : 1; // 0xf58
	uint32_t MatrialOverlap : 1; // 0xf58
	float RunMaxVelocity; // 0xf5c
	float RunMotionBlurAmount; // 0xf60
	float RunMotionBlurSoftEdge; // 0xf64
	float RunCamRotationThreshold; // 0xf68
	float RunCamTranslationThreshold; // 0xf6c
	float RunInterpolationDuration; // 0xf70
	float ExposedBlendInTime; // 0xf74
	float ExposedDuration; // 0xf78
	float ExposedBlendOutTime; // 0xf7c
	float ExposedInterpolationDuration; // 0xf80
	float ExposedDesaturation; // 0xf84
	FVector ExposedHighLights; // 0xf88
	FVector ExposedMidTones; // 0xf94
	FVector ExposedShadows; // 0xfa0
	float FlashbangBlendInTime; // 0xfac
	float FlashbangDuration; // 0xfb0
	float FlashbangBlendOutTime; // 0xfb4
	float FlashbangInterpolationDuration; // 0xfb8
	float FlashbangDesaturation; // 0xfbc
	FVector FlashbangHighLights; // 0xfc0
	FVector FlashbangMidTones; // 0xfcc
	FVector FlashbangShadows; // 0xfd8
	float BlendTotalTime; // 0xfe4
	float CurrentBlendTime; // 0xfe8
	ObjectProperty MatFlashbang; // 0xfec
	ObjectProperty texCaptureFlashbang; // 0xff4
	float WarmupBlendInTime; // 0xffc
	float WarmupDuration; // 0x1000
	float WarmupBlendOutTime; // 0x1004
	float WarmupInterpolationDuration; // 0x1008
	float WarmupDesaturation; // 0x100c
	FVector WarmupHighLights; // 0x1010
	FVector WarmupMidTones; // 0x101c
	FVector WarmupShadows; // 0x1028
	float CountdownBlendInTime; // 0x1034
	float CountdownDuration; // 0x1038
	float CountdownBlendOutTime; // 0x103c
	float CountdownInterpolationDuration; // 0x1040
	float CountdownDesaturation; // 0x1044
	FVector CountdownHighLights; // 0x1048
	FVector CountdownMidTones; // 0x1054
	FVector CountdownShadows; // 0x1060
	float RoundBlendInTime; // 0x106c
	float RoundDuration; // 0x1070
	float RoundBlendOutTime; // 0x1074
	float RoundInterpolationDuration; // 0x1078
	float RoundDesaturation; // 0x107c
	FVector RoundHighLights; // 0x1080
	FVector RoundMidTones; // 0x108c
	FVector RoundShadows; // 0x1098
	float RoundOverBlendInTime; // 0x10a4
	float RoundOverDuration; // 0x10a8
	float RoundOverBlendOutTime; // 0x10ac
	float RoundOverInterpolationDuration; // 0x10b0
	float RoundOverDesaturation; // 0x10b4
	FVector RoundOverHighLights; // 0x10b8
	FVector RoundOverMidTones; // 0x10c4
	FVector RoundOverShadows; // 0x10d0
	float MatchOverBlendInTime; // 0x10dc
	float MatchOverDuration; // 0x10e0
	float MatchOverBlendOutTime; // 0x10e4
	float MatchOverInterpolationDuration; // 0x10e8
	float MatchOverDesaturation; // 0x10ec
	FVector MatchOverHighLights; // 0x10f0
	FVector MatchOverMidTones; // 0x10fc
	FVector MatchOverShadows; // 0x1108
	float FPMaxVelocity; // 0x1114
	float FPMotionBlurAmount; // 0x1118
	float FPMotionBlurSoftEdge; // 0x111c
	float FPCamRotationThreshold; // 0x1120
	float FPCamTranslationThreshold; // 0x1124
	float FPInterpolationDuration; // 0x1128
	TArray<FAdvancedColorSenseStruct> AdvancedColorSense; // 0x112c
};

struct UCCSBTMoveIntoBestCover : UCCSBTMoveIntoCover {
	float IdealShootingDistance; // 0xc4
	uint32_t ExcludeCurrentCover : 1; // 0xc8
};

struct UCombatHUD_OccupiedArea : UCombatHUD_GameObject {
	ObjectProperty AreaVolume; // 0x1b0
};

struct USpeedTree : UObject {
	uint32_t bLegacySpeedTree : 1; // 0x60
	FPointer SRH; // 0x64
	float LeafStaticShadowOpacity; // 0x6c
	ObjectProperty Branch1Material; // 0x70
	ObjectProperty Branch2Material; // 0x78
	ObjectProperty FrondMaterial; // 0x80
	ObjectProperty LeafCardMaterial; // 0x88
	ObjectProperty LeafMeshMaterial; // 0x90
	ObjectProperty BillboardMaterial; // 0x98
	float WindStrength; // 0xa0
	FVector WindDirection; // 0xa4
};

struct UCombatAIActionNode_SelectTarget : UCombatAIActionNodeBase {
	float VisibleWeight; // 0xf4
	float DistanceWeight; // 0xf8
	float OrientWeight; // 0xfc
	float RecentlyDamagedWeight; // 0x100
	TArray<FSClassAgroScore> ClassAgroScores; // 0x104
};

struct AWaterVolume : APhysicsVolume {
	ObjectProperty EntrySound; // 0x2d0
	AActor* EntryActor; // 0x2d8
	ObjectProperty ExitSound; // 0x2e0
	AActor* ExitActor; // 0x2e8
};

struct UGripActionNode_Shoot : UCombatAIActionNodeBase {
	ECurAITarget CurAITarget; // 0xf4
	int32_t FireCountPerBurst; // 0xf8
	int32_t BurstCount; // 0xfc
	float DelayBetweenBursts; // 0x100
	int32_t CurBurstCount; // 0x104
	float LastBurstTime; // 0x108
};

struct UMCPBase : UMcpServiceBase {
	FPointer VfTable_FTickableObject; // 0x78
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x74
};

struct USceneCaptureReflectComponent : USceneCaptureComponent {
	ObjectProperty TextureTarget; // 0xd0
	float ScaleFOV; // 0xd8
};

struct UCombatDataTableRefCrosshair : UCombatDataTableType {
	int32_t Id; // 0x6c
	uint32_t DotOnly : 1; // 0x70
	uint32_t UseCenterDot : 1; // 0x70
	char BasicCrosshairType; // 0x74
	char Thickness; // 0x75
};

struct UGFxAction_OpenMovie : USequenceAction {
	ObjectProperty Movie; // 0x108
	UGFxMoviePlayer* MoviePlayerClass; // 0x110
	ObjectProperty MoviePlayer; // 0x118
	uint32_t bTakeFocus : 1; // 0x120
	uint32_t bCaptureInput : 1; // 0x120
	uint32_t bStartPaused : 1; // 0x120
	uint32_t bEnableGammaCorrection : 1; // 0x120
	uint32_t bDisplayWithHudOff : 1; // 0x120
	GFxRenderTextureMode RenderTextureMode; // 0x124
	ObjectProperty RenderTexture; // 0x128
	TArray<FName> CaptureKeys; // 0x130
	TArray<FName> FocusIgnoreKeys; // 0x140
};

struct ACombatPlayerReplicationInfoBase : APlayerReplicationInfo {
	ObjectProperty CachedPawn; // 0x324
	ObjectProperty KillerForOutline; // 0x32c
	uint32_t bIsLive : 1; // 0x334
	uint32_t bClientExposedByLocalPlayer : 1; // 0x334
	uint32_t bClientExposedByUAV : 1; // 0x334
	FBasePlayerStateForHUDInfo BasePlayerStateForHUDList[0x5]; // 0x338
	FCurrentPlayerStateForHUDInfo CurrentHUDPlayerStateList[0x5]; // 0x374
	int32_t KillerOutlineManagedID; // 0x39c
	ObjectProperty KillerCachedPawn; // 0x3a0
};

struct UPointLightComponent : ULightComponent {
	float ShadowRadiusMultiplier; // 0x1a8
	float Radius; // 0x1ac
	float FalloffExponent; // 0x1b0
	float ShadowFalloffExponent; // 0x1b4
	float MinShadowFalloffRadius; // 0x1b8
	FMatrix CachedParentToWorld; // 0x1c0
	FVector Translation; // 0x200
	FPlane ShadowPlane; // 0x210
	ComponentProperty PreviewLightRadius; // 0x220
	FLightmassPointLightSettings LightmassSettings; // 0x228
	ComponentProperty PreviewLightSourceRadius; // 0x238
};

struct USeqEvent_LOS : USequenceEvent {
	float ScreenCenterDistance; // 0x128
	float TriggerDistance; // 0x12c
	uint32_t bCheckForObstructions : 1; // 0x130
};

struct USVehicleSimCar : USVehicleSimBase {
	float ChassisTorqueScale; // 0xc0
	FInterpCurveFloat MaxSteerAngleCurve; // 0xc4
	float SteerSpeed; // 0xd8
	float ReverseThrottle; // 0xdc
	float EngineBrakeFactor; // 0xe0
	float MaxBrakeTorque; // 0xe4
	float StopThreshold; // 0xe8
	uint32_t bIsDriving : 1; // 0xec
	float ActualSteering; // 0xf0
	float TimeSinceThrottle; // 0xf4
};

struct ULocalPlayer : UPlayer {
	FPointer VfTable_FObserverInterface; // 0x8c
	int32_t ControllerId; // 0x94
	ObjectProperty ViewportClient; // 0x98
	FVector2D Origin; // 0xa0
	FVector2D Size; // 0xa8
	ObjectProperty PlayerPostProcess; // 0xb0
	TArray<ObjectProperty> PlayerPostProcessChains; // 0xb8
	uint32_t bForceDefaultPostProcessChain : 1; // 0xc8
	uint32_t bWantToResetToMapDefaultPP : 1; // 0xc8
	uint32_t bSentSplitJoin : 1; // 0xc8
	uint32_t bPendingServerAuth : 1; // 0xc8
	FPointer ViewState; // 0xcc
	FPointer ViewState2; // 0xd4
	FSynchronizedActorVisibilityHistory ActorVisibilityHistory; // 0xdc
	FVector LastViewLocation; // 0xec
	FCurrentPostProcessVolumeInfo CurrentPPInfo; // 0xf8
	FCurrentPostProcessVolumeInfo LevelPPInfo; // 0x26c
	TArray<FPostProcessSettingsOverride> ActivePPOverrides; // 0x3e0
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x3f0
	FString LastMap; // 0x3f4
	ObjectProperty TagContext; // 0x404
	TScriptInterface<Class> CachedAuthInt; // 0x40c
	float ServerAuthTimestamp; // 0x41c
	int32_t ServerAuthTimeout; // 0x420
	int32_t ServerAuthRetryCount; // 0x424
	int32_t MaxServerAuthRetryCount; // 0x428
	FUniqueNetId ServerAuthUID; // 0x42c
};

struct UCombatAnimNodeSeqHitDirection : UCombatAnimNodeSequence {
	FName DefaultAnim; // 0x16c
	FName LeftAnim; // 0x174
	FName RightAnim; // 0x17c
	FName FrontAnim; // 0x184
	FName BackAnim; // 0x18c
	FName FrontLeftAnim; // 0x194
	FName FrontRightAnim; // 0x19c
	FName BackLeftAnim; // 0x1a4
	FName BackRightAnim; // 0x1ac
	char RandomFactor; // 0x1b4
	EDirectionalSeqMode DirMode; // 0x1b5
	char LastDirIdx; // 0x1b6
	float FrontHitThreshold; // 0x1b8
	float DirAngle; // 0x1bc
	float SliderPosition; // 0x1c0
	ObjectProperty OwnerPawn; // 0x1c4
};

struct UCombatDataTableRefTierSeason : UCombatDataTableType {
	FString ModeCodeName; // 0x6c
	FString TierCodeName; // 0x7c
	int32_t SeasonStringID; // 0x8c
	FString SeasonNumber; // 0x90
};

struct AMutator : AInfo {
	ObjectProperty NextMutator; // 0x244
	TArray<FString> GroupNames; // 0x24c
	uint32_t bUserAdded : 1; // 0x25c
};

struct AApexDestructibleActor : AActor {
	ComponentProperty LightEnvironment; // 0x244
	uint32_t bFractureMaterialOverride : 1; // 0x24c
	TArray<ObjectProperty> FractureMaterials; // 0x250
	ComponentProperty StaticDestructibleComponent; // 0x260
	int32_t LOD; // 0x268
	TArray<char> VisibilityFactors; // 0x26c
	TArray<ObjectProperty> FractureSounds; // 0x27c
	TArray<ObjectProperty> FractureParticleEffects; // 0x28c
};

struct UCCSBTSimpleFlee : UCCSBTScriptBehavior {
	float FleeDistance; // 0xd4
	FVector CachedEnemyPosition; // 0xd8
	FVector CachedPawnPosition; // 0xe4
	uint32_t CachedResult : 1; // 0xf0
	float CachedMaxDist2D; // 0xf4
	ObjectProperty MoveToHandle; // 0xf8
};

struct UCombatHUD_CharacterInfo : UCombatHUDEntity_Base {
	int32_t LastHealth; // 0xc0
	int32_t LastHealthMax; // 0xc4
	FString LastRankName; // 0xc8
	FString LastRankIconPath; // 0xd8
	int32_t LastPositionType; // 0xe8
};

struct UMaterialExpressionFontSample : UMaterialExpression {
	ObjectProperty Font; // 0xb0
	int32_t FontTexturePage; // 0xb8
};

struct UPBRuleNodeSplit : UPBRuleNodeBase {
	EProcBuildingAxis SplitAxis; // 0x70
	TArray<FRBSplitInfo> SplitSetup; // 0x74
};

struct UCombatHUD_ChampionshipSpectatedPlayerInfo : UCombatHUDEntity_Base {
	FString LastPlayerName; // 0xc0
};

struct USeqAct_AttachToEvent : USequenceAction {
	uint32_t bPreferController : 1; // 0x108
};

struct UCombatDynamicDecal : UDecalComponent {
	ObjectProperty MITV_Decal; // 0x3d0
	ObjectProperty MIC_Decal; // 0x3d8
	float Lifetime; // 0x3e0
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x68
	uint32_t bAbsolute : 1; // 0x8c
	uint32_t bFloor : 1; // 0x8c
	uint32_t bApplyPSysScale : 1; // 0x8c
};

struct USeqVar_Vector : USequenceVariable {
	FVector VectValue; // 0xa0
};

struct UParticleModuleUberRainSplashA : UParticleModuleUberBase {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartRotation; // 0xc0
	uint32_t bInheritParent : 1; // 0xe4
	uint32_t MultiplyX : 1; // 0xe4
	uint32_t MultiplyY : 1; // 0xe4
	uint32_t MultiplyZ : 1; // 0xe4
	FRawDistributionVector LifeMultiplier; // 0xe8
	FRawDistributionVector ColorOverLife; // 0x10c
	FRawDistributionFloat AlphaOverLife; // 0x130
};

struct USeqAct_CastToInt : USeqAct_SetSequenceVariable {
	uint32_t bTruncate : 1; // 0x108
	float Value; // 0x10c
	int32_t IntResult; // 0x110
};

struct ACombatCubeMapBoxVolume : AVolume {
	FBoxSphereBounds BrushBounds; // 0x280
	FVector BoxMin; // 0x29c
	FVector BoxMax; // 0x2a8
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x7c
	float Max; // 0x80
};

struct UParticleModuleTypeDataMesh : UParticleModuleTypeDataBase {
	ObjectProperty Mesh; // 0x68
	uint32_t CastShadows : 1; // 0x70
	uint32_t DoCollisions : 1; // 0x70
	uint32_t bAllowMotionBlur : 1; // 0x70
	uint32_t bOverrideMaterial : 1; // 0x70
	uint32_t bCameraFacing : 1; // 0x70
	uint32_t bApplyParticleRotationAsSpin : 1; // 0x70
	EMeshScreenAlignment MeshAlignment; // 0x74
	EParticleAxisLock AxisLockOption; // 0x75
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x76
	EMeshCameraFacingOptions CameraFacingOption; // 0x77
	float Pitch; // 0x78
	float Roll; // 0x7c
	float Yaw; // 0x80
};

struct UCCSBTOrientTowardTarget : UGripBTNode {
	ECCSAlertnessState Alertness; // 0xbc
};

struct ACombatLCTFGame : ACombatPVPGame {
	float EnableTouchTime; // 0x788
	FCarriedObjectBounsInfo CarriedObjectBouns; // 0x78c
	TArray<char> AddedFlagPointID; // 0x794
};

struct UGFxInteraction : UInteraction {
	FPointer VfTable_FCallbackEventDevice; // 0xb0
	uint32_t bFakeMobileTouches : 1; // 0xb8
};

struct UCombatCommunityTransaction : UObject {
	ESessionState MySessionState; // 0x60
	uint32_t bMyAFKState : 1; // 0x64
	uint32_t bInMaintenanceScene : 1; // 0x64
	uint32_t bNeedChangeClanPassword : 1; // 0x64
	uint32_t bMessengerVisible : 1; // 0x64
	uint32_t bIsGMChatPenalty : 1; // 0x64
	TMap<None, None> MessengerMap; // 0x68
	int32_t Count_SuggestionList; // 0xb0
	int32_t Count_FriendList; // 0xb4
	int32_t Count_BlockList; // 0xb8
	int32_t ClanID; // 0xbc
	FString ClanName; // 0xc0
	int32_t ClanPoint; // 0xd0
	int32_t ClanLevel; // 0xd4
	FString ClanLevelColor; // 0xd8
	int32_t ClanTotalPoint; // 0xe8
	int32_t ClanMaxMember; // 0xec
	FClanMatchData ClanMatchRecord; // 0xf0
	TMap<None, None> ClanNameMap; // 0x118
	TArray<FClanMatchRecordData> ClanRankMatchRecordDataList; // 0x160
	TArray<FClanMatchRecordData> ClanAMatchRecordDataList; // 0x170
	TArray<FClanMatchRecordData> ClanBMatchRecordDataList; // 0x180
	TArray<FClanMatchRecordData> ClanAllMatchRecordDataList; // 0x190
	int32_t Count_ClanList; // 0x1a0
	WordProperty EmblemID; // 0x1a4
	int32_t ClanColorID; // 0x1a8
	FTimeData ClanRegistrationTime; // 0x1ac
	WordProperty RegionID; // 0x1b4
	int32_t ClanRankPoint; // 0x1b8
	int32_t MyRankPoint; // 0x1bc
	int32_t PrevSeasonRankingPoint; // 0x1c0
	int32_t PrevSeasonRankingTier; // 0x1c4
	TMap<None, None> ClanJoinMemberMap; // 0x1c8
	TArray<FString> LastWhisperList; // 0x210
	WordProperty CCardID; // 0x220
	TMap<None, None> ScrNoticeInfoMap; // 0x224
	float PenaltySec; // 0x26c
};

struct UCombatAIAction_Sleep : UCombatAIActionBase {
	ObjectProperty ActionNode; // 0x78
};

struct UAnimNodeBlendByBase : UAnimNodeBlendList {
	EBaseBlendType Type; // 0x120
	FName ActorTag; // 0x124
	AActor* ActorClass; // 0x12c
	float BlendTime; // 0x134
	ObjectProperty CachedBase; // 0x138
};

struct UUIPropertyDataProvider : UUIDataProvider {
	TArray<UProperty*> ComplexPropertyTypes; // 0x70
	DelegateProperty __CanSupportComplexPropertyType__Delegate; // 0x80
};

struct UCombatFrontEnd_CharacterInfo_BattleTab : UCombatFrontEnd_CharacterInfo_TabBase {
	TArray<int32_t> BattleTabList; // 0x68
};

struct ACombatExplosionActor : AGameExplosionActor {
	ObjectProperty ActiveTimeDilationAnim; // 0x2bc
	ComponentProperty ExplosionParticleComponent; // 0x2c4
	FRotator ExplosionParticleSystemRotation; // 0x2cc
	uint32_t ShowDebugLines : 1; // 0x2d8
};

struct USwatTurnReachSpec : UForcedReachSpec {
	char SpecDirection; // 0xc8
};

struct USceneCaptureComponent : UActorComponent {
	uint32_t bEnabled : 1; // 0x88
	uint32_t bEnablePostProcess : 1; // 0x88
	uint32_t bEnableFog : 1; // 0x88
	uint32_t bUseMainScenePostProcessSettings : 1; // 0x88
	uint32_t bSkipUpdateIfTextureUsersOccluded : 1; // 0x88
	uint32_t bSkipUpdateIfOwnerOccluded : 1; // 0x88
	uint32_t bSkipRenderingDepthPrepass : 1; // 0x88
	FColor ClearColor; // 0x8c
	ESceneCaptureViewMode ViewMode; // 0x90
	int32_t SceneLOD; // 0x94
	float FrameRate; // 0x98
	ObjectProperty PostProcess; // 0x9c
	float MaxUpdateDist; // 0xa4
	float MaxViewDistanceOverride; // 0xa8
	float MaxStreamingUpdateDist; // 0xac
	FPointer CaptureInfo; // 0xb0
	FPointer ViewState; // 0xb8
	TArray<FPointer> PostProcessProxies; // 0xc0
};

struct ULevel : ULevelBase {
	float LightmapTotalSize; // 0x1d8
	float ShadowmapTotalSize; // 0x1dc
};

struct ACombatTDMGameBase : ACombatPVPGame {
	WordProperty SuddenDeathTime; // 0x788
};

struct USeqAct_Gate : USequenceAction {
	uint32_t bOpen : 1; // 0x108
	int32_t AutoCloseCount; // 0x10c
	int32_t CurrentCloseCount; // 0x110
};

struct UCombatHUD_VoiceChatTalking : UCombatHUDEntity_Base {
	TArray<FString> CurrentTalkingUsers; // 0xc0
};

struct UPhysicsLODVerticalEmitter : UObject {
	int32_t ParticlePercentage; // 0x60
};

struct ASVehicle : AVehicle {
	ComponentProperty SimObj; // 0x5d8
	TArray<ComponentProperty> Wheels; // 0x5e0
	FVector COMOffset; // 0x5f0
	FVector InertiaTensorMultiplier; // 0x5fc
	uint32_t bStayUpright : 1; // 0x608
	uint32_t bUseSuspensionAxis : 1; // 0x608
	uint32_t bUpdateWheelShapes : 1; // 0x608
	uint32_t bVehicleOnGround : 1; // 0x608
	uint32_t bVehicleOnWater : 1; // 0x608
	uint32_t bIsInverted : 1; // 0x608
	uint32_t bChassisTouchingGround : 1; // 0x608
	uint32_t bWasChassisTouchingGroundLastTick : 1; // 0x608
	uint32_t bCanFlip : 1; // 0x608
	uint32_t bFlipRight : 1; // 0x608
	uint32_t bIsUprighting : 1; // 0x608
	uint32_t bOutputHandbrake : 1; // 0x608
	uint32_t bHoldingDownHandbrake : 1; // 0x608
	float StayUprightRollResistAngle; // 0x60c
	float StayUprightPitchResistAngle; // 0x610
	float StayUprightStiffness; // 0x614
	float StayUprightDamping; // 0x618
	ObjectProperty StayUprightConstraintSetup; // 0x61c
	ObjectProperty StayUprightConstraintInstance; // 0x624
	float HeavySuspensionShiftPercent; // 0x62c
	float MaxSpeed; // 0x630
	float MaxAngularVelocity; // 0x634
	float TimeOffGround; // 0x638
	float UprightLiftStrength; // 0x63c
	float UprightTorqueStrength; // 0x640
	float UprightTime; // 0x644
	float UprightStartTime; // 0x648
	ComponentProperty EngineSound; // 0x64c
	ComponentProperty SquealSound; // 0x654
	ObjectProperty CollisionSound; // 0x65c
	ObjectProperty EnterVehicleSound; // 0x664
	ObjectProperty ExitVehicleSound; // 0x66c
	float CollisionIntervalSecs; // 0x674
	float SquealThreshold; // 0x678
	float SquealLatThreshold; // 0x67c
	float LatAngleVolumeMult; // 0x680
	float EngineStartOffsetSecs; // 0x684
	float EngineStopOffsetSecs; // 0x688
	float LastCollisionSoundTime; // 0x68c
	float OutputBrake; // 0x690
	float OutputGas; // 0x694
	float OutputSteering; // 0x698
	float OutputRise; // 0x69c
	float ForwardVel; // 0x6a0
	int32_t NumPoweredWheels; // 0x6a4
	FVector BaseOffset; // 0x6a8
	float CamDist; // 0x6b4
	int32_t DriverViewPitch; // 0x6b8
	int32_t DriverViewYaw; // 0x6bc
	FVehicleState VState; // 0x6c0
	float AngErrorAccumulator; // 0x710
	float RadialImpulseScaling; // 0x714
};

struct UCombatDataTableRefARaceEquip : UCombatDataTableType {
	int32_t DataLoadType; // 0x6c
	FString GroupCodeName; // 0x70
	FString PrimaryWeapon; // 0x80
	FString SubWeapon; // 0x90
	FString MeleeWeapon; // 0xa0
	FString ETCWeapon; // 0xb0
	FString ChipA; // 0xc0
};

struct UScriptViewportClient : UObject {
	FPointer VfTable_FViewportClient; // 0x60
};

struct UNavMeshGoalFilter_MinPathDistance : UNavMeshGoal_Filter {
	int32_t MinDistancePathShouldBe; // 0x6c
};

struct UParticleModuleMaterialByParameter : UParticleModuleMaterialBase {
	TArray<FName> MaterialParameters; // 0x68
	TArray<ObjectProperty> DefaultMaterials; // 0x78
};

struct USeqCond_CompareBool : USequenceCondition {
	uint32_t bResult : 1; // 0xec
};

struct USoundNodeAttenuation : USoundNode {
	uint32_t bAttenuate : 1; // 0x74
	uint32_t bSpatialize : 1; // 0x74
	uint32_t bAttenuateWithLPF : 1; // 0x74
	float dBAttenuationAtMax; // 0x78
	float OmniRadius; // 0x7c
	SoundDistanceModel DistanceAlgorithm; // 0x80
	ESoundDistanceCalc DistanceType; // 0x81
	float RadiusMin; // 0x84
	float RadiusMax; // 0x88
	float LPFRadiusMin; // 0x8c
	float LPFRadiusMax; // 0x90
};

struct ULandscapeHeightfieldCollisionComponent : UPrimitiveComponent {
	FUntypedBulkData_Mirror CollisionHeightData; // 0x250
	TArray<FName> ComponentLayers; // 0x290
	FUntypedBulkData_Mirror DominantLayerData; // 0x2a0
	int32_t SectionBaseX; // 0x2e0
	int32_t SectionBaseY; // 0x2e4
	int32_t CollisionSizeQuads; // 0x2e8
	float CollisionScale; // 0x2ec
	TArray<char> CollisionQuadFlags; // 0x2f0
	TArray<ObjectProperty> PhysicalMaterials; // 0x300
	FPointer RBHeightfield; // 0x310
	FBoxSphereBounds CachedBoxSphereBounds; // 0x318
	uint32_t bIncludeHoles : 1; // 0x334
	uint32_t bHeightFieldDataHasHole : 1; // 0x334
};

struct UCombatAIAction_Roamming : UCombatAIActionBase {
	ObjectProperty ActionNode; // 0x78
	ObjectProperty Goal; // 0x80
	ObjectProperty NextActor; // 0x88
};

struct UCombatHUD_Hostage : UCombatHUD_GameObject {
	ObjectProperty Target; // 0x1b0
	ObjectProperty HPStateBarMC; // 0x1b8
	ObjectProperty HPMC; // 0x1c0
	int32_t LastDisplayHealth; // 0x1c8
	uint32_t LastGodMode : 1; // 0x1cc
};

struct UCombatFrontEnd_MainLobby : UCombatFrontEnd_Scene {
	FButtonInfo SortButtonList[0x7]; // 0xd0
	FButtonInfo RoomButtonList[0x5]; // 0x15c
	ObjectProperty LobbyTran; // 0x1c0
	ObjectProperty MatchMemberClass; // 0x1c8
	int32_t SelectMatchRoomNumber; // 0x1d0
	int32_t EnterMatchRoomNumber; // 0x1d4
};

struct UGripCondNode_TargetExistence : UGripConditionNode {
	ECurAITarget CurAITarget; // 0xec
	uint32_t bNegative : 1; // 0xf0
};

struct ACameraLocationPoint : AActor {
	float CameraActorFOV; // 0x244
	FPostProcessSettings CameraActorOverridePostProcess; // 0x248
};

struct UPath_AvoidInEscapableNodes : UPathConstraint {
	int32_t Radius; // 0x6c
	int32_t Height; // 0x70
	int32_t MaxFallSpeed; // 0x74
	int32_t MoveFlags; // 0x78
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x68
	FRawDistributionFloat Range; // 0x70
	uint32_t bStrengthByDistance : 1; // 0x94
	uint32_t bAffectBaseVelocity : 1; // 0x94
	uint32_t bRenewSource : 1; // 0x94
	uint32_t bInheritSourceVel : 1; // 0x94
	FRawDistributionFloat Strength; // 0x98
	EAttractorParticleSelectionMethod SelectionMethod; // 0xbc
	int32_t LastSelIndex; // 0xc0
};

struct ANxGenericForceFieldBrush : AVolume {
	int32_t ExcludeChannel; // 0x280
	FRBCollisionChannelContainer CollideWithChannels; // 0x284
	ERBCollisionChannel RBChannel; // 0x288
	FFB_ForceFieldCoordinates Coordinates; // 0x289
	FVector Constant; // 0x28c
	FVector PositionMultiplierX; // 0x298
	FVector PositionMultiplierY; // 0x2a4
	FVector PositionMultiplierZ; // 0x2b0
	FVector PositionTarget; // 0x2bc
	FVector VelocityMultiplierX; // 0x2c8
	FVector VelocityMultiplierY; // 0x2d4
	FVector VelocityMultiplierZ; // 0x2e0
	FVector VelocityTarget; // 0x2ec
	FVector Noise; // 0x2f8
	FVector FalloffLinear; // 0x304
	FVector FalloffQuadratic; // 0x310
	float TorusRadius; // 0x31c
	FPointer ForceField; // 0x320
	TArray<FPointer> ConvexMeshes; // 0x328
	TArray<FPointer> ExclusionShapes; // 0x338
	TArray<FPointer> ExclusionShapePoses; // 0x348
	FPointer LinearKernel; // 0x358
};

struct ACombatBotReplicationInfo : ACombatPlayerReplicationInfoBase {
	int32_t SpawnerID; // 0x3a8
	int32_t Cost; // 0x3ac
	int32_t BotGroupID; // 0x3b0
	int32_t BotID; // 0x3b4
};

struct ANxForceFieldRadial : ANxForceField {
	ObjectProperty Shape; // 0x298
	ComponentProperty DrawComponent; // 0x2a0
	float ForceStrength; // 0x2a8
	float ForceRadius; // 0x2ac
	float SelfRotationStrength; // 0x2b0
	ERadialImpulseFalloff ForceFalloff; // 0x2b4
	FPointer Kernel; // 0x2b8
};

struct ACombatGame : ACombatGameFrame {
	UCombatGameMessage* CombatGameMessageClass; // 0x4c0
	UCombatLocalMessage* CombatErrorMessageClass; // 0x4c8
	UCombatStatStorageBase* CombatStatStorageClass; // 0x4d0
	ACombatPlayerReplicationInfoBase* BotReplicationInfoClass; // 0x4d8
	UCombatGameScore* CombatGameScoreClass; // 0x4e0
	char ModeDifficulty; // 0x4e8
	ERoundResultReason RoundResultReason; // 0x4e9
	char RankSystemID; // 0x4ea
	char BindRegion; // 0x4eb
	EMatchType e_MatchType; // 0x4ec
	ObjectProperty SentinelManager; // 0x4f0
	uint32_t bUseSentinel : 1; // 0x4f8
	uint32_t bCheckForceGameOver : 1; // 0x4f8
	uint32_t bSupportsRespawn : 1; // 0x4f8
	uint32_t bCountDown : 1; // 0x4f8
	uint32_t bDirtyRoundOverCheck : 1; // 0x4f8
	uint32_t bCanBeBaseForPawns : 1; // 0x4f8
	uint32_t bIsWarmupHolding : 1; // 0x4f8
	uint32_t bUseClassSystem : 1; // 0x4f8
	uint32_t bInitPSListInGroup : 1; // 0x4f8
	uint32_t bCanTeamChange : 1; // 0x4f8
	uint32_t bIsBlockingJoin : 1; // 0x4f8
	uint32_t bUseParachuteRespawn : 1; // 0x4f8
	uint32_t bForfeitedMatch : 1; // 0x4f8
	uint32_t bSkipSkillLicense : 1; // 0x4f8
	uint32_t bOpenNewMatch : 1; // 0x4f8
	uint32_t bDemoRec : 1; // 0x4f8
	uint32_t bInfiniteWeaponReload : 1; // 0x4f8
	TArray<ACombatPlayerStart*> PlayerStartClass; // 0x4fc
	TArray<FString> PlayerStartClassPath; // 0x50c
	FString SavePortal; // 0x51c
	TArray<int32_t> ReadiedPlayerList; // 0x52c
	int32_t GoalRound; // 0x53c
	int32_t GoalMission; // 0x540
	WordProperty TimeLimitSec; // 0x544
	int32_t InitCR; // 0x548
	float DefaultInvulnerableTime; // 0x54c
	TArray<float> RespawnDelay; // 0x550
	float DroppedWeaponLifeSpan; // 0x560
	float ReasonMsgWaitTime; // 0x564
	float WinnerMsgWaitTime; // 0x568
	float RestartWait; // 0x56c
	float MatchEndWait; // 0x570
	float MatchWarmingupTime; // 0x574
	float CompetitiveMatchWarmingupTime; // 0x578
	float CompetitiveMatchWarmingupMinimumTime; // 0x57c
	float TempSecTime; // 0x580
	ObjectProperty CBLog; // 0x584
	int32_t GameLogID; // 0x58c
	TArray<FInactiveStatInfo> InactiveStatArray; // 0x590
	TArray<FForbiddenWeapon> ForbiddenWeaponList; // 0x5a0
	TArray<EWeaponGroup> ForbiddenEWeaponGroup; // 0x5b0
	TArray<RISSlot> ForbiddenRISList; // 0x5c0
	float HealthModifier; // 0x5d0
	int32_t BotSpawnCount; // 0x5d4
	int32_t ClassSelectCondition; // 0x5d8
	TArray<ObjectProperty> PendingPlayers; // 0x5dc
	TArray<ObjectProperty> CombatPCs; // 0x5ec
	ObjectProperty CBGRI; // 0x5fc
	TArray<ObjectProperty> PSListInGroup; // 0x604
	ObjectProperty CombatDBManager; // 0x614
	int32_t MapID; // 0x61c
	int32_t ModeID; // 0x620
	float TeamChangeMsgWaitTime; // 0x624
	TArray<FClientConnectionInfo> ClientConnections; // 0x628
	float JoinBlockConditionTime; // 0x638
	float JoinBlockConditionScore; // 0x63c
	float BlockJoinCheckTime; // 0x640
	FString GameModeGuideStr; // 0x644
	float LastTestMessageTime; // 0x654
	TArray<FString> PengindTestMessageList; // 0x658
	int32_t StartedMemberCount; // 0x668
	TArray<FString> SavePRIStatModeList; // 0x66c
};

struct ACBWeaponAttachment_ParachuteBase : ACBWeaponAttachment_ETC {
	float TranslationOffset; // 0x424
};

struct AGamePawn : APawn {
	uint32_t bLastHitWasHeadShot : 1; // 0x558
	uint32_t bRespondToExplosions : 1; // 0x558
};

struct UCombatStatDataStore : UObject {
	FName EventType; // 0x60
	int32_t OldRank; // 0x68
	int32_t newRank; // 0x6c
	int32_t ScoringTableIndex; // 0x70
	UDamageType* DamageType; // 0x74
	ObjectProperty Weapon; // 0x7c
	float RespawnTime; // 0x84
	int32_t WeaponID; // 0x88
	eStatType_HitPart HitPart; // 0x8c
	float LoginTime; // 0x90
	float MatchStartTime; // 0x94
	FStatSaveCondition SaveCondition; // 0x98
	ObjectProperty PRI; // 0x9c
	uint32_t bDesertion : 1; // 0xa4
	uint32_t bWinner : 1; // 0xa4
	float SavedPlayTime; // 0xa8
	float SavedRespawnTime; // 0xac
};

struct UMcpServiceConfig : UObject {
	FString Protocol; // 0x60
	FString Domain; // 0x70
	FString TitleId; // 0x80
	FString AppKey; // 0x90
	FString AppSecret; // 0xa0
};

struct USeqEvent_TakeDamage : USequenceEvent {
	float MinDamageAmount; // 0x128
	float DamageThreshold; // 0x12c
	TArray<UDamageType*> DamageTypes; // 0x130
	TArray<UDamageType*> IgnoreDamageTypes; // 0x140
	float CurrentDamage; // 0x150
	uint32_t bResetDamageOnToggle : 1; // 0x154
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	FPointer FloatProp; // 0x70
	float ResetFloat; // 0x78
	FPointer DistributionProp; // 0x7c
};

struct USeqAct_AccessObjectList : USeqAct_SetSequenceVariable {
	ObjectProperty OutputObject; // 0x108
	int32_t ObjectIndex; // 0x110
};

struct UMobileMenuObject : UObject {
	uint32_t bHasBeenInitialized : 1; // 0x60
	uint32_t bRelativeLeft : 1; // 0x60
	uint32_t bRelativeTop : 1; // 0x60
	uint32_t bRelativeWidth : 1; // 0x60
	uint32_t bRelativeHeight : 1; // 0x60
	uint32_t bApplyGlobalScaleLeft : 1; // 0x60
	uint32_t bApplyGlobalScaleTop : 1; // 0x60
	uint32_t bApplyGlobalScaleWidth : 1; // 0x60
	uint32_t bApplyGlobalScaleHeight : 1; // 0x60
	uint32_t bHeightRelativeToWidth : 1; // 0x60
	uint32_t bXOffsetIsActual : 1; // 0x60
	uint32_t bYOffsetIsActual : 1; // 0x60
	uint32_t bIsActive : 1; // 0x60
	uint32_t bIsHidden : 1; // 0x60
	uint32_t bIsTouched : 1; // 0x60
	uint32_t bIsHighlighted : 1; // 0x60
	uint32_t bTellSceneBeforeRendering : 1; // 0x60
	float Left; // 0x64
	float Top; // 0x68
	float Width; // 0x6c
	float Height; // 0x70
	float InitialLeft; // 0x74
	float InitialTop; // 0x78
	float InitialWidth; // 0x7c
	float InitialHeight; // 0x80
	float AuthoredGlobalScale; // 0x84
	float TopLeeway; // 0x88
	float BottomLeeway; // 0x8c
	float LeftLeeway; // 0x90
	float RightLeeway; // 0x94
	float XOffset; // 0x98
	float YOffset; // 0x9c
	FString Tag; // 0xa0
	ObjectProperty InputOwner; // 0xb0
	float Opacity; // 0xb8
	ObjectProperty OwnerScene; // 0xbc
	FString RelativeToTag; // 0xc4
	ObjectProperty RelativeTo; // 0xd4
};

struct USceneCapture2DComponent : USceneCaptureComponent {
	ObjectProperty TextureTarget; // 0xd0
	float FieldOfView; // 0xd8
	float NearPlane; // 0xdc
	float FarPlane; // 0xe0
	uint32_t bUpdateMatrices : 1; // 0xe4
	FMatrix ViewMatrix; // 0xf0
	FMatrix ProjMatrix; // 0x130
};

struct USeqAct_ControlMovieTexture : USequenceAction {
	ObjectProperty MovieTexture; // 0x108
};

struct UCombatDataTableRefSteamItem : UCombatDataTableType {
	FString ITEM_CODE_NAME; // 0x6c
};

struct USeqAct_GameCrowdPopulationManagerToggle : USequenceAction {
	float WarmupPopulationPct; // 0x108
	ObjectProperty CrowdAgentList; // 0x10c
	uint32_t bClearOldArchetypes : 1; // 0x114
	uint32_t bEnableCrowdLightEnvironment : 1; // 0x114
	uint32_t bCastShadows : 1; // 0x114
	uint32_t bFillPotentialSpawnPoints : 1; // 0x114
	uint32_t bForceObstacleChecking : 1; // 0x114
	uint32_t bForceNavMeshPathing : 1; // 0x114
	uint32_t bIndividualSpawner : 1; // 0x114
	int32_t MaxAgents; // 0x118
	float SpawnRate; // 0x11c
	FLightingChannelContainer AgentLightingChannel; // 0x120
	float MaxSpawnDist; // 0x124
	float MinBehindSpawnDist; // 0x128
	TArray<ObjectProperty> PotentialSpawnPoints; // 0x12c
	float AgentWarmupTime; // 0x13c
	int32_t NumAgentsToTickPerFrame; // 0x140
	TArray<ObjectProperty> LastSpawnedList; // 0x144
};

struct UPartyBeaconHost : UPartyBeacon {
	TArray<FClientBeaconConnection> Clients; // 0x98
	int32_t NumTeams; // 0xa8
	int32_t NumPlayersPerTeam; // 0xac
	int32_t NumReservations; // 0xb0
	int32_t NumConsumedReservations; // 0xb4
	TArray<FPartyReservation> Reservations; // 0xb8
	FName OnlineSessionName; // 0xc8
	int32_t ConnectionBacklog; // 0xd0
	int32_t ForceTeamNum; // 0xd4
	int32_t ReservedHostTeamNum; // 0xd8
	uint32_t bBestFitTeamAssignment : 1; // 0xdc
	EPartyBeaconHostState BeaconState; // 0xe0
	DelegateProperty __OnReservationChange__Delegate; // 0xe4
	DelegateProperty __OnReservationsFull__Delegate; // 0xf4
	DelegateProperty __OnClientCancellationReceived__Delegate; // 0x104
};

struct UCombatDataTableRefRandomBoxCost : UCombatDataTableType {
	FString ItemCodeName; // 0x6c
	int32_t BoxResourceIndex; // 0x7c
	uint32_t bChangeScene : 1; // 0x80
};

struct UInterpTrackInstColorProp : UInterpTrackInstProperty {
	FPointer ColorProp; // 0x70
	FColor ResetColor; // 0x78
};

struct UOnlineStatsRead : UOnlineStats {
	int32_t ViewId; // 0x70
	int32_t SortColumnId; // 0x74
	TArray<int32_t> ColumnIds; // 0x78
	int32_t TotalRowsInView; // 0x88
	TArray<FOnlineStatsRow> Rows; // 0x8c
	TArray<FColumnMetaData> ColumnMappings; // 0x9c
	FString ViewName; // 0xac
	int32_t TitleId; // 0xbc
};

struct UCombatHUD_Preset : UCombatHUD_PresetSelectScene {
	FString DescriptionStr; // 0xc0
	ObjectProperty DescriptionMC; // 0xd0
};

struct UCombatCameraThirdPersonCameraMode_Dead : UCombatCameraThirdPersonCameraMode_default {
	FName TargetBoneName; // 0x268
	float DistanceFromTarget; // 0x270
	float CamHeightOffset; // 0x274
	float MaxCamPitchLimit; // 0x278
	uint32_t bFollowKillerPawn : 1; // 0x27c
	uint32_t bDrawDebug : 1; // 0x27c
	float FollowKillerPawnDelayTime; // 0x280
	float FollowKillerPawnDuration; // 0x284
	float KillerPawnHeightOffset; // 0x288
	float DeathCamRotInterpSpeed; // 0x28c
	float DeathCamInterpolationTime; // 0x290
	float DeathCamInterpolationExp; // 0x294
	ObjectProperty DeadCamAnim; // 0x298
	float DeadCamAnimBlendInTime; // 0x2a0
	float DeadCamAnimBlendOutTime; // 0x2a4
	FVector DeathCamStartLocation; // 0x2a8
	FVector DeathCamEndLocation; // 0x2b4
	FRotator DeathCamRotation; // 0x2c0
	float ActiveTimeSeconds; // 0x2cc
	int32_t UnrealMaxCamPitchLimit; // 0x2d0
};

struct USeqAct_SetMatInstScalarParam : USequenceAction {
	ObjectProperty MatInst; // 0x108
	FName ParamName; // 0x110
	float ScalarValue; // 0x118
};

struct UParticleModuleColorScaleOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorScaleOverLife; // 0x68
	FRawDistributionFloat AlphaScaleOverLife; // 0x8c
	uint32_t bEmitterTime : 1; // 0xb0
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x68
	uint32_t EnableX : 1; // 0x8c
	uint32_t EnableY : 1; // 0x8c
	uint32_t EnableZ : 1; // 0x8c
};

struct ACombatWaveBotController : ACombatBotController_GuyBase {
	float LastJumpOverWallTime; // 0x5e8
};

struct UCombatAnimNotify_HideBone : UAnimNotify {
	FName TargetBoneName; // 0x60
	uint32_t bHideBone : 1; // 0x68
	float NotifyDuration; // 0x6c
};

struct USeqAct_Latent : USequenceAction {
	TArray<ObjectProperty> LatentActors; // 0x108
	uint32_t bAborted : 1; // 0x118
	float LatentActivationTime; // 0x11c
};

struct UCombatDataRefAttend : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t Day; // 0x80
	FString RewardTableCodeName; // 0x84
};

struct UParticleModuleTypeDataTrail : UParticleModuleTypeDataBase {
	uint32_t RenderGeometry : 1; // 0x68
	uint32_t RenderLines : 1; // 0x68
	uint32_t RenderTessellation : 1; // 0x68
	uint32_t Tapered : 1; // 0x68
	uint32_t SpawnByDistance : 1; // 0x68
	int32_t TessellationFactor; // 0x6c
	FRawDistributionFloat Tension; // 0x70
	FVector SpawnDistance; // 0x94
};

struct UCombatFrontEnd_ClanJoinPopup : UCombatFrontEnd_Object {
	uint32_t bNeedInitClanPasswordLabel : 1; // 0xd0
	int32_t nClanID; // 0xd4
	ClanPopupMode PopupMode; // 0xd8
};

struct UAnimationCompressionAlgorithm_PerTrackCompression : UAnimationCompressionAlgorithm_RemoveLinearKeys {
	float MaxZeroingThreshold; // 0x94
	float MaxPosDiffBitwise; // 0x98
	float MaxAngleDiffBitwise; // 0x9c
	TArray<AnimationCompressionFormat> AllowedRotationFormats; // 0xa0
	TArray<AnimationCompressionFormat> AllowedTranslationFormats; // 0xb0
	uint32_t bResampleAnimation : 1; // 0xc0
	uint32_t bUseAdaptiveError : 1; // 0xc0
	uint32_t bUseOverrideForEndEffectors : 1; // 0xc0
	uint32_t bUseAdaptiveError2 : 1; // 0xc0
	float ResampledFramerate; // 0xc4
	int32_t MinKeysForResampling; // 0xc8
	int32_t TrackHeightBias; // 0xcc
	float ParentingDivisor; // 0xd0
	float ParentingDivisorExponent; // 0xd4
	float RotationErrorSourceRatio; // 0xd8
	float TranslationErrorSourceRatio; // 0xdc
	float MaxErrorPerTrackRatio; // 0xe0
	float PerturbationProbeSize; // 0xe4
	FPointer PerReductionCachedData; // 0xe8
};

struct UGameExplosionContent : UObject {
	uint32_t bAutoControllerVibration : 1; // 0x60
	uint32_t bOrientCameraShakeTowardsEpicenter : 1; // 0x60
	ObjectProperty ExplosionSound; // 0x64
	ObjectProperty CamShake; // 0x6c
	ObjectProperty CamShake_Left; // 0x74
	ObjectProperty CamShake_Right; // 0x7c
	ObjectProperty CamShake_Rear; // 0x84
	float CamShakeInnerRadius; // 0x8c
	float CamShakeOuterRadius; // 0x90
	float CamShakeFalloff; // 0x94
	AEmitterCameraLensEffectBase* CameraLensEffect; // 0x98
	float CameraLensEffectRadius; // 0xa0
	ComponentProperty ExploLight; // 0xa4
	float ExploLightFadeOutTime; // 0xac
	ComponentProperty ExploRadialBlur; // 0xb0
	float ExploRadialBlurFadeOutTime; // 0xb8
	float ExploRadialBlurMaxBlur; // 0xbc
	ObjectProperty ParticleEmitterTemplate; // 0xc0
	ObjectProperty FogVolumeArchetype; // 0xc8
};

struct UUIDataProvider_OnlinePlayerStorageArray : UUIDataProvider {
	ObjectProperty PlayerStorage; // 0x70
	int32_t PlayerStorageId; // 0x78
	FString ColumnHeaderText; // 0x7c
	TArray<FName> Values; // 0x8c
};

struct USVehicleSimTank : USVehicleSimCar {
	float LeftTrackVel; // 0xf8
	float RightTrackVel; // 0xfc
	float LeftTrackTorque; // 0x100
	float RightTrackTorque; // 0x104
	float MaxEngineTorque; // 0x108
	float EngineDamping; // 0x10c
	float InsideTrackTorqueFactor; // 0x110
	float SteeringLatStiffnessFactor; // 0x114
	float TurnInPlaceThrottle; // 0x118
	float TurnMaxGripReduction; // 0x11c
	float TurnGripScaleRate; // 0x120
	uint32_t bTurnInPlaceOnSteer : 1; // 0x124
};

struct UCombatDataTableRefCubeBox : UCombatDataTableType {
	FString CubeCodeName; // 0x6c
	int32_t GiveType; // 0x7c
	int32_t ValueMin; // 0x80
	int32_t ValueMax; // 0x84
	FString OutputCodeName; // 0x88
	int32_t JackpotValue; // 0x98
	int32_t OutputGrade; // 0x9c
	int32_t EffectType; // 0xa0
	int32_t FrameType; // 0xa4
	int32_t TagType; // 0xa8
};

struct AZoneInfo : AInfo {
	float KillZ; // 0x244
	float SoftKill; // 0x248
	UKillZDamageType* KillZDamageType; // 0x24c
	uint32_t bSoftKillZ : 1; // 0x254
};

struct UCombatDataTableRefRank : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t RankName; // 0x80
	FString BigIconName; // 0x84
	FString SmallIconName; // 0x94
	int32_t ImageID_Big; // 0xa4
	int32_t ImageID_Small; // 0xa8
};

struct USkelControl_TwistBone : USkelControlBase {
	FName SourceBoneName; // 0xd0
	float TwistAngleScale; // 0xd8
};

struct ANxTornadoForceFieldCapsule : ANxTornadoForceField {
	ComponentProperty RenderComponent; // 0x2c8
};

struct USpeedTreeActorFactory : UActorFactory {
	ObjectProperty SpeedTree; // 0x9c
};

struct UDownloadableContentManager : UObject {
	TArray<FPointer> DLCConfigCacheChanges; // 0x60
	TArray<FString> InstalledDLC; // 0x70
	FMap_Mirror NonPackageFilePathMap; // 0x80
	TArray<UObject*> ClassesToReload; // 0xc8
	TArray<ObjectProperty> ObjectsToReload; // 0xd8
	TArray<FString> QueuedFullyLoadPackageInis; // 0xe8
	ObjectProperty GameEngine; // 0xf8
	DelegateProperty __OnRefreshComplete__Delegate; // 0x100
};

struct ULightEnvironmentComponent : UActorComponent {
	uint32_t bEnabled : 1; // 0x88
	uint32_t bForceNonCompositeDynamicLights : 1; // 0x88
	uint32_t bAllowDynamicShadowsOnTranslucency : 1; // 0x88
	uint32_t bAllowPreShadow : 1; // 0x88
	uint32_t bTranslucencyShadowed : 1; // 0x88
	float DominantShadowFactor; // 0x8c
	ComponentProperty AffectingDominantLight; // 0x90
	TArray<ComponentProperty> AffectedComponents; // 0x98
};

struct UCBCharInfo : UObject {
	TArray<FCharacterInfo> Characters; // 0x60
	TArray<UCBFamilyInfo*> Families; // 0x70
	float LOD1DisplayFactor; // 0x80
	float LOD2DisplayFactor; // 0x84
	float LOD3DisplayFactor; // 0x88
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t PosX; // 0xb0
	int32_t PosY; // 0xb4
	int32_t SizeX; // 0xb8
	int32_t SizeY; // 0xbc
	FString Text; // 0xc0
};

struct UGameCrowdBehavior_RunFromPanic : UGameCrowdAgentBehavior {
	ObjectProperty PanicFocus; // 0x9c
};

struct UActorComponent : UComponent {
	FPointer Scene; // 0x70
	ObjectProperty Owner; // 0x78
	uint32_t bAttached : 1; // 0x80
	uint32_t bTickInEditor : 1; // 0x80
	uint32_t bNeedsReattach : 1; // 0x80
	uint32_t bNeedsUpdateTransform : 1; // 0x80
	ETickingGroup TickGroup; // 0x84
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<ObjectProperty> OverrideVisibleActors; // 0x280
	TArray<ObjectProperty> OverrideInvisibleActors; // 0x290
};

struct UTexture : USurface {
	uint32_t SRGB : 1; // 0x60
	uint32_t RGBE : 1; // 0x60
	uint32_t bIsSourceArtUncompressed : 1; // 0x60
	uint32_t CompressionNoAlpha : 1; // 0x60
	uint32_t CompressionNone : 1; // 0x60
	uint32_t CompressionNoMipmaps : 1; // 0x60
	uint32_t CompressionFullDynamicRange : 1; // 0x60
	uint32_t DeferCompression : 1; // 0x60
	uint32_t NeverStream : 1; // 0x60
	uint32_t bDitherMipMapAlpha : 1; // 0x60
	uint32_t bPreserveBorderR : 1; // 0x60
	uint32_t bPreserveBorderG : 1; // 0x60
	uint32_t bPreserveBorderB : 1; // 0x60
	uint32_t bPreserveBorderA : 1; // 0x60
	uint32_t bNoTiling : 1; // 0x60
	uint32_t bForcePVRTC4 : 1; // 0x60
	uint32_t bAsyncResourceReleaseHasBeenStarted : 1; // 0x60
	uint32_t bUseCinematicMipLevels : 1; // 0x60
	uint32_t IsMipmappedSourceArt : 1; // 0x60
	float UnpackMin[0x4]; // 0x64
	float UnpackMax[0x4]; // 0x74
	FUntypedBulkData_Mirror SourceArt; // 0x84
	TextureCompressionSettings CompressionSettings; // 0xc4
	TextureFilter Filter; // 0xc5
	TextureGroup LODGroup; // 0xc6
	TextureGroup CachedLODGroup; // 0xc7
	TextureMipGenSettings MipGenSettings; // 0xc8
	ETextureFilterEdgeType TextureFilterEdgeType; // 0xc9
	int32_t LODBias; // 0xcc
	int32_t CachedCombinedLODBias; // 0xd0
	int32_t NumCinematicMipLevels; // 0xd4
	FPointer Resource; // 0xd8
	float AdjustBrightness; // 0xe0
	float AdjustBrightnessCurve; // 0xe4
	float AdjustVibrance; // 0xe8
	float AdjustSaturation; // 0xec
	float AdjustRGBCurve; // 0xf0
	float AdjustHue; // 0xf4
	int32_t InternalFormatLODBias; // 0xf8
	float BrightnessStep; // 0xfc
	int32_t ApplyFilteringMip; // 0x100
	float FilterAngle; // 0x104
	float MipFilterAnglePerLevelScale; // 0x108
	float FilterEdgeWidth; // 0x10c
	int32_t NumSourceArtMips; // 0x110
	int32_t SourceArtWidth; // 0x114
	int32_t SourceArtHeight; // 0x118
};

struct UAnimNodeBlendPerBone : UAnimNodeBlend {
	uint32_t bForceLocalSpaceBlend : 1; // 0x110
	TArray<FName> BranchStartBoneName; // 0x114
	TArray<float> Child2PerBoneWeight; // 0x124
	TArray<char> LocalToCompReqBones; // 0x134
};

struct UCBUIDataStore_TacticalGear : UUIDataStore_Settings {
	TArray<FUITacticalGearStruct> UITacticalGearList; // 0x98
};

struct UPBRuleNodeRepeat : UPBRuleNodeBase {
	EProcBuildingAxis RepeatAxis; // 0x70
	float RepeatMaxSize; // 0x74
};

struct UCombatHUD_BattleLog : UCombatHUDEntity_Base {
	uint32_t bDisplayed : 1; // 0xc0
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct UDistributionFloatParameterBase : UDistributionFloatConstant {
	FName ParameterName; // 0x80
	float MinInput; // 0x88
	float MaxInput; // 0x8c
	float MinOutput; // 0x90
	float MaxOutput; // 0x94
	DistributionParamMode ParamMode; // 0x98
};

struct UNavMeshGoalFilter_OutOfViewFrom : UNavMeshGoal_Filter {
	FPointer GoalPoly; // 0x6c
	FVector OutOfViewLocation; // 0x74
};

struct USeqAct_SetBool : USeqAct_SetSequenceVariable {
	uint32_t DefaultValue : 1; // 0x108
};

struct ALiftCenter : ANavigationPoint {
	ObjectProperty MyLift; // 0x33c
	float MaxDist2D; // 0x344
	FVector LiftOffset; // 0x348
	uint32_t bJumpLift : 1; // 0x354
	float CollisionHeight; // 0x358
	ObjectProperty LiftTrigger; // 0x35c
};

struct AAccessControl : AInfo {
	TArray<FString> IPPolicies; // 0x244
	TArray<FUniqueNetId> BannedIDs; // 0x254
	FString IPBanned; // 0x264
	FString WrongPassword; // 0x274
	FString NeedPassword; // 0x284
	FString SessionBanned; // 0x294
	FString KickedMsg; // 0x2a4
	FString DefaultKickReason; // 0x2b4
	FString IdleKickReason; // 0x2c4
	AAdmin* AdminClass; // 0x2d4
	FString AdminPassword; // 0x2dc
	FString GamePassword; // 0x2ec
	FString ACDisplayText[0x3]; // 0x2fc
	FString ACDescText[0x3]; // 0x32c
	uint32_t bDontAddDefaultAdmin : 1; // 0x35c
	uint32_t bAuthenticateClients : 1; // 0x35c
	uint32_t bAuthenticateServer : 1; // 0x35c
	uint32_t bAuthenticateListenHost : 1; // 0x35c
	uint32_t bAuthDelegatesRegistered : 1; // 0x35c
	uint32_t bPendingListenAuth : 1; // 0x35c
	int32_t MaxAuthRetryCount; // 0x360
	int32_t AuthRetryDelay; // 0x364
	ObjectProperty OnlineSub; // 0x368
	TScriptInterface<Class> CachedAuthInt; // 0x370
	TArray<FPendingClientAuth> ClientsPendingAuth; // 0x380
	TArray<FServerAuthRetry> ServerAuthRetries; // 0x390
	int32_t ListenAuthTicketUID; // 0x3a0
	int32_t ListenAuthRetryCount; // 0x3a4
};

struct UCombatDataTableRefDrop : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	FString RefPickupCodeName[0x5]; // 0x80
	int32_t DropRate[0x5]; // 0xd0
};

struct UParticleModuleRequired : UParticleModule {
	ObjectProperty Material; // 0x68
	EParticleScreenAlignment ScreenAlignment; // 0x70
	EParticleSortMode SortMode; // 0x71
	EParticleBurstMethod ParticleBurstMethod; // 0x72
	EParticleSubUVInterpMethod InterpolationMethod; // 0x73
	EScalePivotType ScalePivotType; // 0x74
	EEmitterNormalsMode EmitterNormalsMode; // 0x75
	uint32_t bAllowImageFlipping : 1; // 0x78
	uint32_t bSquareImageFlipping : 1; // 0x78
	uint32_t bUseLocalSpace : 1; // 0x78
	uint32_t bKillOnDeactivate : 1; // 0x78
	uint32_t bKillOnCompleted : 1; // 0x78
	uint32_t bRequiresSorting : 1; // 0x78
	uint32_t bUseLegacyEmitterTime : 1; // 0x78
	uint32_t bEnableNearParticleCulling : 1; // 0x78
	uint32_t bEnableFarParticleCulling : 1; // 0x78
	uint32_t bEmitterDurationUseRange : 1; // 0x78
	uint32_t bDurationRecalcEachLoop : 1; // 0x78
	uint32_t bEmitterDelayUseRange : 1; // 0x78
	uint32_t bDelayFirstLoopOnly : 1; // 0x78
	uint32_t bScaleUV : 1; // 0x78
	uint32_t bDirectUV : 1; // 0x78
	uint32_t bOverrideSystemMacroUV : 1; // 0x78
	uint32_t bUseMaxDrawCount : 1; // 0x78
	uint32_t bOrbitModuleAffectsVelocityAlignment : 1; // 0x78
	float NearCullDistance; // 0x7c
	float NearFadeDistance; // 0x80
	float FarFadeDistance; // 0x84
	float FarCullDistance; // 0x88
	float EmitterDuration; // 0x8c
	float EmitterDurationLow; // 0x90
	int32_t EmitterLoops; // 0x94
	FRawDistributionFloat SpawnRate; // 0x98
	TArray<FParticleBurst> BurstList; // 0xbc
	float EmitterDelay; // 0xcc
	float EmitterDelayLow; // 0xd0
	int32_t SubImages_Horizontal; // 0xd4
	int32_t SubImages_Vertical; // 0xd8
	float RandomImageTime; // 0xdc
	int32_t RandomImageChanges; // 0xe0
	FVector MacroUVPosition; // 0xe4
	float MacroUVRadius; // 0xf0
	int32_t MaxDrawCount; // 0xf4
	float DownsampleThresholdScreenFraction; // 0xf8
	FVector NormalsSphereCenter; // 0xfc
	FVector NormalsCylinderDirection; // 0x108
};

struct UCombatAnimNodeCopyBoneTranslation : UAnimNodeBlendBase {
	ObjectProperty CachedAimNode; // 0x100
	FName OldAimProfileName; // 0x108
	TArray<FBoneCopyInfo> DefaultBoneCopyArray; // 0x110
	TArray<FBoneCopyInfo> DualWieldBoneCopyArray; // 0x120
	TArray<FBoneCopyInfo> ActiveBoneCopyArray; // 0x130
	TArray<char> RequiredBones; // 0x140
};

struct UCombatAudioChannelSystem : UObject {
	TMap<None, None> ChannelMap; // 0x60
	TArray<FChannelData> Channels; // 0xa8
};

struct AEmitter : AActor {
	ComponentProperty ParticleSystemComponent; // 0x244
	ComponentProperty LightEnvironment; // 0x24c
	uint32_t bDestroyOnSystemFinish : 1; // 0x254
	uint32_t bPostUpdateTickGroup : 1; // 0x254
	uint32_t bClientSideOnly : 1; // 0x254
	uint32_t bCurrentlyActive : 1; // 0x254
};

struct UAnimNodeRandom : UAnimNodeBlendList {
	TArray<FRandomAnimInfo> RandomInfo; // 0x120
	ObjectProperty PlayingSeqNode; // 0x130
	int32_t PendingChildIndex; // 0x138
	uint32_t bPickedPendingChildIndex : 1; // 0x13c
};

struct UMorphNodeWeight : UMorphNodeWeightBase {
	float NodeWeight; // 0x84
};

struct AAmbientSoundSimpleToggleable : AAmbientSoundSimple {
	uint32_t bCurrentlyPlaying : 1; // 0x270
	uint32_t bFadeOnToggle : 1; // 0x270
	uint32_t bIgnoreAutoPlay : 1; // 0x270
	float FadeInDuration; // 0x274
	float FadeInVolumeLevel; // 0x278
	float FadeOutDuration; // 0x27c
	float FadeOutVolumeLevel; // 0x280
};

struct UCombatDataTableRefClanExp : UCombatDataTableType {
	int32_t Level; // 0x6c
	int32_t GoalExp; // 0x70
	FString LevelColor; // 0x74
	FString BoosterCodeName; // 0x84
};

struct UNavMeshGoal_ClosestActorInList : UNavMeshPathGoalEvaluator {
	TArray<FBiasedGoalActor> GoalList; // 0x7c
	FMultiMap_Mirror PolyToGoalActorMap; // 0x8c
	FPointer CachedAnchorPoly; // 0xd4
};

struct UAnimNodeBlendByProperty : UAnimNodeBlendList {
	FName PropertyName; // 0x120
	uint32_t bUseOwnersBase : 1; // 0x128
	uint32_t bForceUpdate : 1; // 0x128
	uint32_t bUseSpecificBlendTimes : 1; // 0x128
	uint32_t bSynchronizeNodesInEditor : 1; // 0x128
	FName CachedPropertyName; // 0x12c
	FPointer CachedFloatProperty; // 0x134
	FPointer CachedBoolProperty; // 0x13c
	FPointer CachedByteProperty; // 0x144
	ObjectProperty CachedOwner; // 0x14c
	float BlendTime; // 0x154
	float FloatPropMin; // 0x158
	float FloatPropMax; // 0x15c
	float BlendToChild1Time; // 0x160
	float BlendToChild2Time; // 0x164
};

struct ACombatAIGame : ACombatPVEGame {
	int32_t PlayerLifeCount; // 0x784
	int32_t PlayerMaxLifeCount; // 0x788
	int32_t RespawnWaitTime; // 0x78c
	Team BOT_TEAM; // 0x790
	Team PLAYER_TEAM; // 0x791
	ObjectProperty CurrentSequence; // 0x794
	int32_t WaveStartTime; // 0x79c
	int32_t PlayerHealthForNoLife; // 0x7a0
};

struct ACombatProj_Decoy : ACombatProj_SpecialGrenade {
	float RadarExposeRange; // 0x3f8
	ComponentProperty EnemyAttachPSC; // 0x3fc
	ComponentProperty FriendlyAttachPSC; // 0x404
};

struct UCombatFrontEnd_ClausePopup : UCombatFrontEnd_Object {
	FString URL; // 0xd0
};

struct ACombatAIGameReplicationInfo : ACBGameReplicationInfo {
	ObjectProperty MissionActor; // 0x380
	int32_t WaveCount; // 0x388
	int32_t WaveStartTime; // 0x38c
	int32_t PlayTime; // 0x390
	int32_t CurrentWaveRemainBotCount; // 0x394
	FSAimRocket RepAimRocket; // 0x398
	TArray<ObjectProperty> SeqAct_ProjAttackArray; // 0x3d4
	uint32_t bInitProjAttackSequence : 1; // 0x3e4
	EAIRewardRank RewardRank; // 0x3e8
	int32_t ValidComboTime; // 0x3ec
	TArray<ObjectProperty> ComboList; // 0x3f0
};

struct UCombatFrontEnd_ItemSellPopup : UCombatFrontEnd_Object {
	FInvenItemInfo SellItemInfo; // 0xd0
	TArray<int32_t> SellSlotList; // 0x108
};

struct UCCSBTShoot : UGripBTNode {
	int32_t FireBurstPerShot; // 0xbc
	float DelayBetweenBursts; // 0xc0
};

struct UMobileMenuImage : UMobileMenuObject {
	ObjectProperty Image; // 0xdc
	MenuImageDrawStyle ImageDrawStyle; // 0xe4
	FUVCoords ImageUVs; // 0xe8
	FLinearColor ImageColor; // 0xfc
};

struct USeqAct_MobileAddInputZones : USequenceAction {
	FName ZoneName; // 0x108
	ObjectProperty NewZone; // 0x110
};

struct UCombatDataTableRefStat : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t StatName; // 0x80
	int32_t StatDesc; // 0x84
	int32_t RecordType; // 0x88
	char GameSetTableKey; // 0x8c
	char DataSetTableKey; // 0x8d
	char ConstValueKey; // 0x8e
	WordProperty Event; // 0x90
	FString RefModeCodeName; // 0x94
	FString RefMapCodeName; // 0xa4
	FString RefStatGroupCodeName; // 0xb4
	FString RefItemCodeName; // 0xc4
	FString RefRankCodeName; // 0xd4
	FString RefScoringCodeName; // 0xe4
};

struct UCombatPracticePlayerInput : UCombatPlayerInput {
	TArray<FKeyBind> PracticeKeyBindings; // 0x3f8
};

struct UApexDynamicComponent : UApexComponentBase {
	FPointer ComponentDynamicResources; // 0x27c
};

struct USeqVar_Float : USequenceVariable {
	float FloatValue; // 0xa0
};

struct UOnlineGameInterfaceImpl : UObject {
	ObjectProperty OwningSubsystem; // 0x60
	ObjectProperty GameSettings; // 0x68
	ObjectProperty GameSearch; // 0x70
	TArray<DelegateProperty> CreateOnlineGameCompleteDelegates; // 0x78
	TArray<DelegateProperty> UpdateOnlineGameCompleteDelegates; // 0x88
	TArray<DelegateProperty> DestroyOnlineGameCompleteDelegates; // 0x98
	TArray<DelegateProperty> JoinOnlineGameCompleteDelegates; // 0xa8
	TArray<DelegateProperty> MigrateOnlineGameCompleteDelegates; // 0xb8
	TArray<DelegateProperty> JoinMigratedOnlineGameCompleteDelegates; // 0xc8
	TArray<DelegateProperty> RecalculateSkillRatingCompleteDelegates; // 0xd8
	TArray<DelegateProperty> StartOnlineGameCompleteDelegates; // 0xe8
	TArray<DelegateProperty> EndOnlineGameCompleteDelegates; // 0xf8
	TArray<DelegateProperty> FindOnlineGamesCompleteDelegates; // 0x108
	TArray<DelegateProperty> CancelFindOnlineGamesCompleteDelegates; // 0x118
	ELanBeaconState LanBeaconState; // 0x128
	char LanNonce[0x8]; // 0x129
	int32_t LanAnnouncePort; // 0x134
	int32_t LanGameUniqueId; // 0x138
	int32_t LanPacketPlatformMask; // 0x13c
	float LanQueryTimeLeft; // 0x140
	float LanQueryTimeout; // 0x144
	FPointer LanBeacon; // 0x148
	FPointer SessionInfo; // 0x150
	DelegateProperty __OnFindOnlineGamesComplete__Delegate; // 0x158
	DelegateProperty __OnCreateOnlineGameComplete__Delegate; // 0x168
	DelegateProperty __OnUpdateOnlineGameComplete__Delegate; // 0x178
	DelegateProperty __OnDestroyOnlineGameComplete__Delegate; // 0x188
	DelegateProperty __OnCancelFindOnlineGamesComplete__Delegate; // 0x198
	DelegateProperty __OnJoinOnlineGameComplete__Delegate; // 0x1a8
	DelegateProperty __OnRegisterPlayerComplete__Delegate; // 0x1b8
	DelegateProperty __OnUnregisterPlayerComplete__Delegate; // 0x1c8
	DelegateProperty __OnStartOnlineGameComplete__Delegate; // 0x1d8
	DelegateProperty __OnEndOnlineGameComplete__Delegate; // 0x1e8
	DelegateProperty __OnArbitrationRegistrationComplete__Delegate; // 0x1f8
	DelegateProperty __OnGameInviteAccepted__Delegate; // 0x208
	DelegateProperty __OnRecalculateSkillRatingComplete__Delegate; // 0x218
	DelegateProperty __OnMigrateOnlineGameComplete__Delegate; // 0x228
	DelegateProperty __OnJoinMigratedOnlineGameComplete__Delegate; // 0x238
	DelegateProperty __OnQosStatusChanged__Delegate; // 0x248
};

struct USeqEvent_RemoteEvent : USequenceEvent {
	FName EventName; // 0x128
	uint32_t bStatusIsOk : 1; // 0x130
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0xb0
	FExpressionInput Min; // 0xe4
	FExpressionInput Max; // 0x118
};

struct UCommandlet : UObject {
	FString HelpDescription; // 0x60
	FString HelpUsage; // 0x70
	FString HelpWebLink; // 0x80
	TArray<FString> HelpParamNames; // 0x90
	TArray<FString> HelpParamDescriptions; // 0xa0
	uint32_t IsServer : 1; // 0xb0
	uint32_t IsClient : 1; // 0xb0
	uint32_t IsEditor : 1; // 0xb0
	uint32_t LogToConsole : 1; // 0xb0
	uint32_t ShowErrorCount : 1; // 0xb0
};

struct UWebRequest : UObject {
	FString RemoteAddr; // 0x60
	FString URI; // 0x70
	FString UserName; // 0x80
	FString Password; // 0x90
	int32_t ContentLength; // 0xa0
	FString ContentType; // 0xa4
	ERequestType RequestType; // 0xb4
	FMap_Mirror HeaderMap; // 0xb8
	FMap_Mirror VariableMap; // 0x100
};

struct AStaticMeshActor : AStaticMeshActorBase {
	ComponentProperty StaticMeshComponent; // 0x244
	uint32_t bDisableAutoBaseOnProcBuilding : 1; // 0x24c
	uint32_t bProxy : 1; // 0x24c
	uint32_t bHiddenByProxy : 1; // 0x24c
	uint32_t OldCastShadow : 1; // 0x24c
	uint32_t OldAcceptsLights : 1; // 0x24c
};

struct UPath_TowardPoint : UPathConstraint {
	FVector GoalPoint; // 0x6c
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0xb0
};

struct UCameraModifier_CameraShake : UCameraModifier {
	TArray<FCameraShakeInstance> ActiveShakes; // 0x80
	float SplitScreenShakeScale; // 0x90
};

struct UCombatWeaponRISBase_Aiming : UCombatWeaponRISBase_SkeletalmeshComponent {
	TArray<float> WorldFOVMagnification; // 0xc44
	TArray<float> OverrideForegroundFOV; // 0xc54
	TArray<float> OverrideWeaponBobRatio; // 0xc64
	TArray<float> OverrideWeaponLagRatio; // 0xc74
	TArray<float> OverrideWeaponZoomDuration; // 0xc84
	TArray<float> OverrideWeaponFOVDelayRatio; // 0xc94
	TArray<float> OverrideZoomRotLagRatio; // 0xca4
	float OverrideWeaponFOVInterpSpeed; // 0xcb4
	TArray<FVector> OverrideViewOffset; // 0xcb8
	TArray<float> OverrideBobDamping; // 0xcc8
	TArray<float> OverrideBobDampingZ; // 0xcd8
	TArray<float> OverrideZoomAnimBlendTimes; // 0xce8
	TArray<FHideBoneDataByScreenPos> OverrideHideBoneDataByScreenPos; // 0xcf8
};

struct UCombatGameEventBase : UObject {
	DelegateProperty __OnGetReward__Delegate; // 0x60
};

struct UCombatAnimNotify_HideBoneForAttachedMesh : UCombatAnimNotify_HideBone {
	FName AttachedBoneName; // 0x70
	FName AttachedSocketName; // 0x78
};

struct ACombatProj_ExplosiveBase : ACombatProjectile {
	uint32_t bAutoDestroyOnExplosion : 1; // 0x390
	uint32_t bHasExploded : 1; // 0x390
	uint32_t bAttachExplosionToHitMover : 1; // 0x390
	uint32_t IsCollideTeammatePawn : 1; // 0x390
	uint32_t IgniteWhenToss : 1; // 0x390
	float MinDamage; // 0x394
	float FullDamageRadius; // 0x398
	float DamageFalloffExp; // 0x39c
	ObjectProperty ExplosionTemplate; // 0x3a0
	ObjectProperty GrenadeBounceSound; // 0x3a8
	char TeamNum; // 0x3b0
	EObjectGradeType ObjectGrade; // 0x3b1
	float TimeBeforeBeep; // 0x3b4
	float TimeAfterBeep; // 0x3b8
	int32_t MaxBounceCountToArm; // 0x3bc
	int32_t BounceCount; // 0x3c0
	float VelocityDampingFactor; // 0x3c4
	float StopSimulatingVelocitySqrThreshhold; // 0x3c8
	float Bounciness; // 0x3cc
	ComponentProperty BouncedComp; // 0x3d0
	int32_t BP; // 0x3d8
	AGameExplosionActor* ExplosionActorClass; // 0x3dc
};

struct ACombatLCTFFlagPoint : ANavigationPoint {
	Team OwnerTeam; // 0x33c
	EFlagPointType PointType; // 0x33d
	char SpawnID; // 0x33e
	char PointID; // 0x33f
	int32_t MaxHoistedCount; // 0x340
	ComponentProperty Mesh; // 0x344
	ComponentProperty StaticMeshComp; // 0x34c
	ObjectProperty FlagPointStaticMesh; // 0x354
	int32_t AreaNameID; // 0x35c
	int32_t MissionGoalArrayIndex; // 0x360
	uint32_t IsStayFlag : 1; // 0x364
	TArray<int32_t> HoistedID; // 0x368
};

struct UCombatFrontEnd_BaseShop : UCombatFrontEnd_Maintenance {
	ObjectProperty ItemListClass; // 0xe4
	ObjectProperty ItemDetailinfoClass; // 0xec
	int32_t SelectedMainTab; // 0xf4
	int32_t SelectedSubTab; // 0xf8
	int32_t SelectedInfoTab; // 0xfc
	int32_t SelectedInfoTabType; // 0x100
	int32_t CashUnit; // 0x104
	int32_t priceID; // 0x108
	FString CurrentCodeName; // 0x10c
	FString CurrentSearchtext; // 0x11c
	char CurrentPresetTab; // 0x12c
	int32_t CurrentClothItemRefIndex; // 0x130
	int32_t CurrentSelectedItemID; // 0x134
	int32_t AutoSelectItemID; // 0x138
	int32_t AutoSelectMainTab; // 0x13c
	uint32_t bSortRepurchaseItems : 1; // 0x140
	uint32_t bSelectedHotItem : 1; // 0x140
	uint32_t bSelectedNewItem : 1; // 0x140
	uint32_t bSelectedCashItem : 1; // 0x140
	uint32_t bMoveShop : 1; // 0x140
	FString ShopCodename; // 0x144
	TArray<FShopTabStruct> MainTabInfo; // 0x154
	FShopTabStruct SubTabAllInfo; // 0x164
	TArray<FShopTabStruct> SubTabWeaponInfo; // 0x18c
	TArray<FShopTabStruct> SubTabCharInfo; // 0x19c
	TArray<FShopTabStruct> SubTabItemInfo; // 0x1ac
	TArray<FShopTabStruct> SubTabPackageInfo; // 0x1bc
	FInfoTabStruct ItemTabInfo[0x3]; // 0x1cc
};

struct ACombatWeaponBase_Melee : ACombatWeapon {
	FMeleeAttackFactor MeleeFactors[0x2]; // 0x1ec8
	uint32_t bHitPawn : 1; // 0x1f28
	uint32_t bHitWorldActor : 1; // 0x1f28
	uint32_t bContinousAttack : 1; // 0x1f28
	int32_t LastAttackIndex; // 0x1f2c
	TArray<ObjectProperty> VictimsSaveList; // 0x1f30
	int32_t ArcSectIndex; // 0x1f40
};

struct UCombatBusterGameScore : UCombatGameScore {
	float BusterDamageScoreRatio; // 0x60
	float BusterDamageMissionScoreRatio; // 0x64
	float BusterDamageCRRatio; // 0x68
	float BusterDamageRankExpRatio; // 0x6c
};

struct UCombatFrontEnd_Exit : UCombatFrontEnd_Object {
	int32_t ShowRewardRank; // 0xd0
	DelegateProperty __CallSetMission__Delegate; // 0xd4
};

struct UMaterialExpressionFontSampleParameter : UMaterialExpressionFontSample {
	FName ParameterName; // 0xbc
	FGuid ExpressionGUID; // 0xc4
	FName Group; // 0xd4
};

struct ADynamicSMActor : AActor {
	ComponentProperty StaticMeshComponent; // 0x244
	ComponentProperty LightEnvironment; // 0x24c
	ObjectProperty ReplicatedMesh; // 0x254
	ObjectProperty ReplicatedMaterial0; // 0x25c
	ObjectProperty ReplicatedMaterial1; // 0x264
	uint32_t bForceStaticDecals : 1; // 0x26c
	uint32_t bPawnCanBaseOn : 1; // 0x26c
	uint32_t bSafeBaseIfAsleep : 1; // 0x26c
	FVector ReplicatedMeshTranslation; // 0x270
	FRotator ReplicatedMeshRotation; // 0x27c
	FVector ReplicatedMeshScale3D; // 0x288
};

struct UCombatHUD_NoticePosition : UCombatHUDEntity_Base {
	EUIGameStatus CurrentStatus; // 0xc0
	uint32_t bTryShowNoticeposition : 1; // 0xc4
	float LastUpdateTime; // 0xc8
};

struct UCombatPracticeGameMovie : UCombatTeamGameMovie {
	ObjectProperty PracticeGameHelpMC; // 0xad0
	ObjectProperty PracticeGameRoundStatusMC; // 0xad8
	ObjectProperty PracticeGameMessage; // 0xae0
};

struct UInterpTrackHeadTracking : UInterpTrack {
	TArray<FHeadTrackingKey> HeadTrackingTrack; // 0xa0
	TArray<FName> TrackControllerName; // 0xb0
	float LookAtActorRadius; // 0xc0
	uint32_t bDisableBeyondLimit : 1; // 0xc4
	uint32_t bLookAtPawns : 1; // 0xc4
	float MaxLookAtTime; // 0xc8
	float MinLookAtTime; // 0xcc
	float MaxInterestTime; // 0xd0
	TArray<AActor*> ActorClassesToLookAt; // 0xd4
	TArray<FName> TargetBoneNames; // 0xe4
};

struct USeqVar_Int : USequenceVariable {
	int32_t IntValue; // 0xa0
};

struct ACBInventoryManager : AInventoryManager {
	uint32_t bInfiniteAmmo : 1; // 0x270
	ObjectProperty PreviousWeapon; // 0x274
};

struct USeqCond_CompareInt : USequenceCondition {
	int32_t ValueA; // 0xec
	int32_t ValueB; // 0xf0
};

struct USkeletalMeshComponent : UMeshComponent {
	ObjectProperty SkeletalMesh; // 0x260
	ComponentProperty AttachedToSkelComponent; // 0x268
	ObjectProperty AnimTreeTemplate; // 0x270
	ObjectProperty Animations; // 0x278
	TArray<ObjectProperty> AnimTickArray; // 0x280
	TArray<ObjectProperty> AnimAlwaysTickArray; // 0x290
	TArray<int32_t> AnimTickRelevancyArray; // 0x2a0
	TArray<float> AnimTickWeightsArray; // 0x2b0
	TArray<ObjectProperty> SkelControlTickArray; // 0x2c0
	ObjectProperty PhysicsAsset; // 0x2d0
	ObjectProperty PhysicsAssetInstance; // 0x2d8
	FPointer ApexClothing; // 0x2e0
	float PhysicsWeight; // 0x2e8
	float GlobalAnimRateScale; // 0x2ec
	float StreamingDistanceMultiplier; // 0x2f0
	FPointer MeshObject; // 0x2f4
	FColor WireframeColor; // 0x2fc
	TArray<FBoneAtom> SpaceBases; // 0x300
	TArray<FBoneAtom> LocalAtoms; // 0x310
	TArray<FBoneAtom> CachedLocalAtoms; // 0x320
	TArray<FBoneAtom> CachedSpaceBases; // 0x330
	int32_t LowUpdateFrameRate; // 0x340
	TArray<char> RequiredBones; // 0x344
	TArray<char> ComposeOrderedRequiredBones; // 0x354
	ComponentProperty ParentAnimComponent; // 0x364
	TArray<int32_t> ParentBoneMap; // 0x36c
	TArray<ObjectProperty> AnimSets; // 0x37c
	TArray<ObjectProperty> TemporarySavedAnimSets; // 0x38c
	TArray<ObjectProperty> MorphSets; // 0x39c
	TArray<FActiveMorph> ActiveMorphs; // 0x3ac
	TArray<FActiveMorph> ActiveCurveMorphs; // 0x3bc
	TMap<None, None> MorphTargetIndexMap; // 0x3cc
	TArray<FAttachment> Attachments; // 0x414
	TArray<char> SkelControlIndex; // 0x424
	TArray<char> PostPhysSkelControlIndex; // 0x434
	int32_t ForcedLodModel; // 0x444
	int32_t MinLodModel; // 0x448
	int32_t PredictedLODLevel; // 0x44c
	int32_t OldPredictedLODLevel; // 0x450
	float AnimationLODDistanceFactor; // 0x454
	int32_t AnimationLODFrameRate; // 0x458
	float MaxDistanceFactor; // 0x45c
	TArray<char> MaterialSet; // 0x460
	int32_t bForceWireframe; // 0x470
	int32_t bForceRefpose; // 0x474
	int32_t bOldForceRefPose; // 0x478
	uint32_t bNoSkeletonUpdate : 1; // 0x47c
	int32_t bDisplayBones; // 0x480
	int32_t bShowPrePhysBones; // 0x484
	int32_t bHideSkin; // 0x488
	int32_t bForceRawOffset; // 0x48c
	int32_t bIgnoreControllers; // 0x490
	int32_t bTransformFromAnimParent; // 0x494
	int32_t TickTag; // 0x498
	int32_t InitTag; // 0x49c
	int32_t CachedAtomsTag; // 0x4a0
	int32_t bUseSingleBodyPhysics; // 0x4a4
	int32_t bRequiredBonesUpToDate; // 0x4a8
	float MinDistFactorForKinematicUpdate; // 0x4ac
	int32_t FramesPhysicsAsleep; // 0x4b0
	int32_t SkipRateForTickAnimNodesAndGetBoneAtoms; // 0x4b4
	uint32_t bSkipTickAnimNodes : 1; // 0x4b8
	uint32_t bSkipGetBoneAtoms : 1; // 0x4b8
	uint32_t bInterpolateBoneAtoms : 1; // 0x4b8
	uint32_t bHasValidBodies : 1; // 0x4b8
	uint32_t bSkipAllUpdateWhenPhysicsAsleep : 1; // 0x4b8
	uint32_t bComponentUseFixedSkelBounds : 1; // 0x4b8
	uint32_t bUseBoundsFromParentAnimComponent : 1; // 0x4b8
	uint32_t bConsiderAllBodiesForBounds : 1; // 0x4b8
	uint32_t bUpdateSkelWhenNotRendered : 1; // 0x4b8
	uint32_t bIgnoreControllersWhenNotRendered : 1; // 0x4b8
	uint32_t bTickAnimNodesWhenNotRendered : 1; // 0x4b8
	uint32_t bNotUpdatingKinematicDueToDistance : 1; // 0x4b8
	uint32_t bForceDiscardRootMotion : 1; // 0x4b8
	uint32_t bNotifyRootMotionProcessed : 1; // 0x4b8
	uint32_t bRootMotionModeChangeNotify : 1; // 0x4b8
	uint32_t bRootMotionExtractedNotify : 1; // 0x4b8
	uint32_t bProcessingRootMotion : 1; // 0x4b8
	uint32_t bDisableFaceFXMaterialInstanceCreation : 1; // 0x4b8
	uint32_t bDisableFaceFX : 1; // 0x4b8
	uint32_t bAnimTreeInitialised : 1; // 0x4b8
	uint32_t bForceMeshObjectUpdate : 1; // 0x4b8
	uint32_t bHasPhysicsAssetInstance : 1; // 0x4b8
	uint32_t bUpdateKinematicBonesFromAnimation : 1; // 0x4b8
	uint32_t bUpdateJointsFromAnimation : 1; // 0x4b8
	uint32_t bSkelCompFixed : 1; // 0x4b8
	uint32_t bHasHadPhysicsBlendedIn : 1; // 0x4b8
	uint32_t bForceUpdateAttachmentsInTick : 1; // 0x4b8
	uint32_t bEnableFullAnimWeightBodies : 1; // 0x4b8
	uint32_t bPerBoneVolumeEffects : 1; // 0x4b8
	uint32_t bPerBoneMotionBlur : 1; // 0x4b8
	uint32_t bSyncActorLocationToRootRigidBody : 1; // 0x4b8
	uint32_t bUseRawData : 1; // 0x4b8
	uint32_t bDisableWarningWhenAnimNotFound : 1; // 0x4bc
	uint32_t bOverrideAttachmentOwnerVisibility : 1; // 0x4bc
	uint32_t bNeedsToDeleteHitMask : 1; // 0x4bc
	uint32_t bPauseAnims : 1; // 0x4bc
	uint32_t bChartDistanceFactor : 1; // 0x4bc
	uint32_t bEnableLineCheckWithBounds : 1; // 0x4bc
	uint32_t bCanHighlightSelectedSections : 1; // 0x4bc
	uint32_t bUpdateMorphWhenParentAnimComponentExists : 1; // 0x4bc
	FVector LineCheckBoundsScale; // 0x4c0
	uint32_t bEnableClothSimulation : 1; // 0x4cc
	uint32_t bDisableClothCollision : 1; // 0x4cc
	uint32_t bClothFrozen : 1; // 0x4cc
	uint32_t bAutoFreezeClothWhenNotRendered : 1; // 0x4cc
	uint32_t bClothAwakeOnStartup : 1; // 0x4cc
	uint32_t bClothBaseVelClamp : 1; // 0x4cc
	uint32_t bClothBaseVelInterp : 1; // 0x4cc
	uint32_t bAttachClothVertsToBaseBody : 1; // 0x4cc
	uint32_t bIsClothOnStaticObject : 1; // 0x4cc
	uint32_t bUpdatedFixedClothVerts : 1; // 0x4cc
	uint32_t bClothPositionalDampening : 1; // 0x4cc
	uint32_t bClothWindRelativeToOwner : 1; // 0x4cc
	uint32_t bRecentlyRendered : 1; // 0x4cc
	uint32_t bCacheAnimSequenceNodes : 1; // 0x4cc
	uint32_t bNeedsInstanceWeightUpdate : 1; // 0x4cc
	uint32_t bAlwaysUseInstanceWeights : 1; // 0x4cc
	uint32_t bUpdateComposeSkeletonPasses : 1; // 0x4cc
	uint32_t bValidTemporarySavedAnimSets : 1; // 0x4cc
	TArray<FBonePair> InstanceVertexWeightBones; // 0x4d0
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x4e0
	FVector FrozenLocalToWorldPos; // 0x4f0
	FRotator FrozenLocalToWorldRot; // 0x4fc
	FVector ClothExternalForce; // 0x508
	FVector ClothWind; // 0x514
	FVector ClothBaseVelClampRange; // 0x520
	float ClothBlendWeight; // 0x52c
	float ClothDynamicBlendWeight; // 0x530
	float ClothBlendMinDistanceFactor; // 0x534
	float ClothBlendMaxDistanceFactor; // 0x538
	FVector MinPosDampRange; // 0x53c
	FVector MaxPosDampRange; // 0x548
	FVector MinPosDampScale; // 0x554
	FVector MaxPosDampScale; // 0x560
	FPointer ClothSim; // 0x56c
	int32_t SceneIndex; // 0x574
	TArray<FVector> ClothMeshPosData; // 0x578
	TArray<FVector> ClothMeshNormalData; // 0x588
	TArray<int32_t> ClothMeshIndexData; // 0x598
	int32_t NumClothMeshVerts; // 0x5a8
	int32_t NumClothMeshIndices; // 0x5ac
	TArray<int32_t> ClothMeshParentData; // 0x5b0
	int32_t NumClothMeshParentIndices; // 0x5c0
	TArray<FVector> ClothMeshWeldedPosData; // 0x5c4
	TArray<FVector> ClothMeshWeldedNormalData; // 0x5d4
	TArray<int32_t> ClothMeshWeldedIndexData; // 0x5e4
	int32_t ClothDirtyBufferFlag; // 0x5f4
	ERBCollisionChannel ClothRBChannel; // 0x5f8
	FRBCollisionChannelContainer ClothRBCollideWithChannels; // 0x5fc
	float ClothForceScale; // 0x600
	float ClothImpulseScale; // 0x604
	float ClothAttachmentTearFactor; // 0x608
	uint32_t bClothUseCompartment : 1; // 0x60c
	float MinDistanceForClothReset; // 0x610
	FVector LastClothLocation; // 0x614
	ERBCollisionChannel ApexClothingRBChannel; // 0x620
	FRBCollisionChannelContainer ApexClothingRBCollideWithChannels; // 0x624
	ERBCollisionChannel ApexClothingCollisionRBChannel; // 0x628
	uint32_t bAutoFreezeApexClothingWhenNotRendered : 1; // 0x62c
	uint32_t bLocalSpaceWind : 1; // 0x62c
	FVector WindVelocity; // 0x630
	float WindVelocityBlendTime; // 0x63c
	uint32_t bSkipInitClothing : 1; // 0x640
	FPointer SoftBodySim; // 0x644
	int32_t SoftBodySceneIndex; // 0x64c
	uint32_t bEnableSoftBodySimulation : 1; // 0x650
	TArray<FVector> SoftBodyTetraPosData; // 0x654
	TArray<int32_t> SoftBodyTetraIndexData; // 0x664
	int32_t NumSoftBodyTetraVerts; // 0x674
	int32_t NumSoftBodyTetraIndices; // 0x678
	float SoftBodyImpulseScale; // 0x67c
	uint32_t bSoftBodyFrozen : 1; // 0x680
	uint32_t bAutoFreezeSoftBodyWhenNotRendered : 1; // 0x680
	uint32_t bSoftBodyAwakeOnStartup : 1; // 0x680
	uint32_t bSoftBodyUseCompartment : 1; // 0x680
	ERBCollisionChannel SoftBodyRBChannel; // 0x684
	FRBCollisionChannelContainer SoftBodyRBCollideWithChannels; // 0x688
	FPointer SoftBodyASVPlane; // 0x68c
	ObjectProperty LimitMaterial; // 0x694
	FBoneAtom RootMotionDelta; // 0x6a0
	FVector RootMotionVelocity; // 0x6c0
	FVector RootBoneTranslation; // 0x6cc
	FVector RootMotionAccelScale; // 0x6d8
	ERootMotionMode RootMotionMode; // 0x6e4
	ERootMotionMode PreviousRMM; // 0x6e5
	ERootMotionMode PendingRMM; // 0x6e6
	ERootMotionMode OldPendingRMM; // 0x6e7
	int32_t bRMMOneFrameDelay; // 0x6e8
	ERootMotionRotationMode RootMotionRotationMode; // 0x6ec
	EAnimRotationOnly AnimRotationOnly; // 0x6ed
	EFaceFXBlendMode FaceFXBlendMode; // 0x6ee
	FPointer FaceFXActorInstance; // 0x6f0
	ComponentProperty CachedFaceFXAudioComp; // 0x6f8
	TArray<char> BoneVisibilityStates; // 0x700
	FBoneAtom LocalToWorldBoneAtom; // 0x710
	float ProgressiveDrawingFraction; // 0x730
	char CustomSortAlternateIndexMode; // 0x734
	char MaxMipMapOffset; // 0x735
	char NumberOfAsyncLoadingMaterial; // 0x736
	TArray<FName> MorphTargetsQueried; // 0x738
	TArray<ComponentProperty> PoolSMComponents; // 0x748
	uint32_t bUseTickOptimization : 1; // 0x758
	uint32_t bAsyncLoadingForMaterial : 1; // 0x758
	int32_t TickCount; // 0x75c
	int32_t LastDropRate; // 0x760
	float LastDropRateChange; // 0x764
	float AccumulatedDroppedDeltaTime; // 0x768
	float ComponentDroppedDeltaTime; // 0x76c
};

struct USeqAct_GameInfo : USequenceAction {
	TArray<ObjectProperty> Instigator; // 0x108
};

struct UCombatSkelCtrl_Spring : USkelControlSingleBone {
	uint32_t bInitialized : 1; // 0x100
	ObjectProperty OwnerPawn; // 0x104
	FName AttachedBoneName; // 0x10c
	ObjectProperty BodyInstance; // 0x114
	FRotator MaxAngle; // 0x11c
	FRotator MinAngle; // 0x128
	float Falloff; // 0x134
	float SpringStiffness; // 0x138
	float AVModifier; // 0x13c
	FRotator CurrentAngle; // 0x140
	float RandomPortion; // 0x14c
	FVector LastHitMomentum; // 0x150
	float LastHitTime; // 0x15c
	float MomentumPortion; // 0x160
};

struct USeqAct_ToggleOutLine : USeqAct_Toggle {
	FColor OutlineColor; // 0x108
	char OutlineWidth; // 0x10c
	char OutlineMinWidth; // 0x10d
	EBlendMode OutlineBlendMode; // 0x10e
	char StencilID; // 0x10f
	float OutLineColorIntense; // 0x110
	float OutLineIntenseCycleTime; // 0x114
	float OutLineCullDistance; // 0x118
	float OutlineWidthMaxDistance; // 0x11c
	uint32_t DrawOnlyHidden : 1; // 0x120
	uint32_t DisableDepthTest : 1; // 0x120
	uint32_t EnableDepthWriteOutline : 1; // 0x120
	ObjectProperty OutlineMaterialOverride; // 0x124
};

struct UCombatSkelCtrl_Recoil : UGameSkelCtrl_Recoil {
	uint32_t TestRecoil : 1; // 0x14c
	int32_t GunIndex; // 0x150
	TArray<FRecoilProfileData> RecoilArray; // 0x154
};

struct UCombatDataTableRefGear : UCombatDataTableType {
	int32_t Index; // 0x6c
	int32_t Cost; // 0x70
	int32_t NameID; // 0x74
	int32_t TooltipDescID; // 0x78
	FString IconName; // 0x7c
	FString ScriptFile; // 0x8c
};

struct UCombatFrontEnd_Community : UCombatFrontEnd_Object {
	FMessengerListStruct MessengerListInfos[0x6]; // 0xd0
	int32_t MessengerPopupLabelIDList[0x9]; // 0x160
	FString UserName_FriendWith; // 0x184
	FString UserName_AddBlackList; // 0x194
	int32_t UserID_BreakFriend; // 0x1a4
	FString UserName_ClanInvite; // 0x1a8
	int32_t Banish_UserID; // 0x1b8
	int32_t Invite_ClanID; // 0x1bc
	EMessengerStateType MessengerState; // 0x1c0
	uint32_t bDisplayedNoList : 1; // 0x1c4
	uint32_t bDisplayedUserInfoTooltip : 1; // 0x1c4
	FUserInfoTooltipInfo CurrentUserInfoTooltipInfo; // 0x1c8
	TArray<FPopupItemInfo> Items_FriendsRequestsPopup; // 0x240
	TArray<FPopupItemInfo> Items_MyFriendsPopup; // 0x250
	TArray<FPopupItemInfo> Items_ClanPopup; // 0x260
	TArray<FPopupItemInfo> Items_BlockedUsersPopup; // 0x270
	FString NoFriendLabel; // 0x280
	FString NoClanLabel; // 0x290
	FString NoClanMemberLabel; // 0x2a0
};

struct UCombatFrontEnd_Event : UCombatFrontEnd_Scene {
	int32_t CurrentViewTabIndex; // 0xd0
	TArray<FEventTabStruct> EventTabList; // 0xd4
	ObjectProperty TabList[0xa]; // 0xe4
};

struct UParticleModuleVelocityOverLifetime : UParticleModuleVelocityBase {
	FRawDistributionVector VelOverLife; // 0x6c
	uint32_t Absolute : 1; // 0x90
};

struct UTextureFlipBook : UTexture2D {
	FPointer VfTable_FTickableObject; // 0x214
	float TimeIntoMovie; // 0x21c
	float TimeSinceLastFrame; // 0x220
	float HorizontalScale; // 0x224
	float VerticalScale; // 0x228
	uint32_t bPaused : 1; // 0x22c
	uint32_t bStopped : 1; // 0x22c
	uint32_t bLooping : 1; // 0x22c
	uint32_t bAutoPlay : 1; // 0x22c
	int32_t HorizontalImages; // 0x230
	int32_t VerticalImages; // 0x234
	TextureFlipBookMethod FBMethod; // 0x238
	float FrameRate; // 0x23c
	float FrameTime; // 0x240
	int32_t CurrentRow; // 0x244
	int32_t CurrentColumn; // 0x248
	float RenderOffsetU; // 0x24c
	float RenderOffsetV; // 0x250
	FPointer ReleaseResourcesFence; // 0x254
};

struct UInterpTrackFaceFX : UInterpTrack {
	TArray<ObjectProperty> FaceFXAnimSets; // 0xa0
	TArray<FFaceFXTrackKey> FaceFXSeqs; // 0xb0
	ObjectProperty CachedActorFXAsset; // 0xc0
	TArray<FFaceFXSoundCueKey> FaceFXSoundCueKeys; // 0xc8
};

struct USeqAct_PlaySound : USeqAct_Latent {
	ObjectProperty PlaySound; // 0x120
	float ExtraDelay; // 0x128
	uint32_t bDelayReached : 1; // 0x12c
	uint32_t bSuppressSubtitles : 1; // 0x12c
	uint32_t bStopped : 1; // 0x12c
	float SoundDuration; // 0x130
	float FadeInTime; // 0x134
	float FadeOutTime; // 0x138
	float VolumeMultiplier; // 0x13c
	float PitchMultiplier; // 0x140
	float BeforeEndTime; // 0x144
};

struct UCombatHUD_ObserverRevivalWeapon : UCombatHUDEntity_Base {
	char LastReservedPreset; // 0xc0
	FString TitleMessage; // 0xc4
	FString PresetKeyName[0x3]; // 0xd4
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	FRawDistributionFloat SubImageIndex; // 0x68
	uint32_t bUseRealTime : 1; // 0x8c
};

struct USeqAct_SetMatInstVectorParam : USequenceAction {
	ObjectProperty MatInst; // 0x108
	FName ParamName; // 0x110
	FLinearColor VectorValue; // 0x118
};

struct ACombatDroppedEvolvePoint_Supply : ACombatDroppedEvolvePoint {
	int32_t PointMin; // 0x350
	int32_t PointMax; // 0x354
	int32_t SupplyGrade; // 0x358
};

struct USeqAct_ToggleHidden : USeqAct_Toggle {
	uint32_t bToggleBasedActors : 1; // 0x108
	TArray<AActor*> IgnoreBasedClasses; // 0x10c
};

struct USplineComponent : UPrimitiveComponent {
	FInterpCurveVector SplineInfo; // 0x250
	float SplineCurviness; // 0x264
	FColor SplineColor; // 0x268
	float SplineDrawRes; // 0x26c
	float SplineArrowSize; // 0x270
	uint32_t bSplineDisabled : 1; // 0x274
	FInterpCurveFloat SplineReparamTable; // 0x278
};

struct UCombatHUD_ObserverHelp : UCombatHUDEntity_Base {
	uint32_t bInitKeyData : 1; // 0xc0
};

struct UNavMeshGoal_OutOfViewFrom : UNavMeshPathGoalEvaluator {
	FPointer GoalPoly; // 0x7c
	FVector OutOfViewLocation; // 0x84
	uint32_t bShowDebug : 1; // 0x90
};

struct UCombatAnimNotify_AttachStaticMesh : UAnimNotify {
	FName SocketName; // 0x60
	FName TargetBoneName; // 0x68
	ObjectProperty StaticMesh; // 0x70
	ObjectProperty CurrStaticMesh; // 0x78
	int32_t TargetBoneIndex; // 0x80
	FMatrix SocketMatrix; // 0x90
};

struct UInterpTrackParticleReplay : UInterpTrack {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0xa0
	uint32_t bIsCapturingReplay : 1; // 0xb0
};

struct AKeypoint : AActor {
	ComponentProperty SpriteComp; // 0x244
};

struct AMaterialInstanceActor : AActor {
	ObjectProperty MatInst; // 0x244
};

struct UMaterialExpressionDynamicParameter : UMaterialExpression {
	TArray<FString> ParamNames; // 0xb0
};

struct UForceFeedbackManager : UObject {
	uint32_t bAllowsForceFeedback : 1; // 0x60
	uint32_t bIsPaused : 1; // 0x60
	ObjectProperty FFWaveform; // 0x64
	int32_t CurrentSample; // 0x6c
	float ElapsedTime; // 0x70
	float ScaleAllWaveformsBy; // 0x74
	ObjectProperty WaveformInstigator; // 0x78
};

struct UDynamicLightEnvironmentComponent : ULightEnvironmentComponent {
	FPointer State; // 0xa8
	float InvisibleUpdateTime; // 0xb0
	float MinTimeBetweenFullUpdates; // 0xb4
	float VelocityUpdateTimeScale; // 0xb8
	float ShadowInterpolationSpeed; // 0xbc
	int32_t NumVolumeVisibilitySamples; // 0xc0
	float LightingBoundsScale; // 0xc4
	FLinearColor AmbientShadowColor; // 0xc8
	FVector AmbientShadowSourceDirection; // 0xd8
	FLinearColor AmbientGlow; // 0xe4
	float AmbientGlowCycleTime; // 0xf4
	float LightDistance; // 0xf8
	float ShadowDistance; // 0xfc
	uint32_t bCastShadows : 1; // 0x100
	uint32_t bCompositeShadowsFromDynamicLights : 1; // 0x100
	uint32_t bForceCompositeAllLights : 1; // 0x100
	uint32_t bAffectedBySmallDynamicLights : 1; // 0x100
	uint32_t bUseBooleanEnvironmentShadowing : 1; // 0x100
	uint32_t bShadowFromEnvironment : 1; // 0x100
	uint32_t bDynamic : 1; // 0x100
	uint32_t bSynthesizeDirectionalLight : 1; // 0x100
	uint32_t bSynthesizeSHLight : 1; // 0x100
	uint32_t bRequiresNonLatentUpdates : 1; // 0x100
	uint32_t bTraceFromClosestBoundsPoint : 1; // 0x100
	uint32_t bIsCharacterLightEnvironment : 1; // 0x100
	uint32_t bIsFirstPersonLightEnvironment : 1; // 0x100
	uint32_t bOverrideOwnerLightingChannels : 1; // 0x100
	uint32_t bAlwaysInfluencedByDominantDirectionalLight : 1; // 0x100
	float ModShadowFadeoutTime; // 0x104
	float ModShadowFadeoutExponent; // 0x108
	FLinearColor MaxModulatedShadowColor; // 0x10c
	float DominantShadowTransitionStartDistance; // 0x11c
	float DominantShadowTransitionEndDistance; // 0x120
	float MinShadowAngle; // 0x124
	EDynamicLightEnvironmentBoundsMethod BoundsMethod; // 0x128
	FBoxSphereBounds OverriddenBounds; // 0x12c
	FLightingChannelContainer OverriddenLightingChannels; // 0x148
	TArray<ComponentProperty> OverriddenLightComponents; // 0x14c
	float IndirectLightingIntense; // 0x15c
	float MinimumLightingIntense; // 0x160
	float MinimumIndirectLightingIntense; // 0x164
};

struct UMobileMenuScene : UObject {
	FString MenuName; // 0x60
	TArray<ObjectProperty> MenuObjects; // 0x70
	ObjectProperty SceneCaptionFont; // 0x80
	ObjectProperty InputOwner; // 0x88
	uint32_t bSceneDoesNotRequireInput : 1; // 0x90
	uint32_t bRelativeLeft : 1; // 0x90
	uint32_t bRelativeTop : 1; // 0x90
	uint32_t bRelativeWidth : 1; // 0x90
	uint32_t bRelativeHeight : 1; // 0x90
	uint32_t bApplyGlobalScaleLeft : 1; // 0x90
	uint32_t bApplyGlobalScaleTop : 1; // 0x90
	uint32_t bApplyGlobalScaleWidth : 1; // 0x90
	uint32_t bApplyGlobalScaleHeight : 1; // 0x90
	char TouchpadIndex; // 0x94
	float Left; // 0x98
	float Top; // 0x9c
	float Width; // 0xa0
	float Height; // 0xa4
	float InitialLeft; // 0xa8
	float InitialTop; // 0xac
	float InitialWidth; // 0xb0
	float InitialHeight; // 0xb4
	float AuthoredGlobalScale; // 0xb8
	float Opacity; // 0xbc
	ObjectProperty UITouchSound; // 0xc0
	ObjectProperty UIUnTouchSound; // 0xc8
};

struct USeqAct_CombatTutorial_HelpOn : USequenceAction {
	int32_t HelpTitle; // 0x108
	int32_t HelpDesc; // 0x10c
	FString GBACommandToSkip; // 0x110
};

struct UAnimNotify_PlayFaceFXAnim : UAnimNotify_Scripted {
	ObjectProperty FaceFXAnimSetRef; // 0x60
	FString GroupName; // 0x68
	FString AnimName; // 0x78
	ObjectProperty SoundCueToPlay; // 0x88
	uint32_t bOverridePlayingAnim : 1; // 0x90
	float PlayFrequency; // 0x94
};

struct UCombatDataRefDecorationParticle : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString DecalParticle; // 0x70
};

struct UCombatFrontEnd_Exchange : UCombatFrontEnd_Object {
	uint32_t bNeedCheckFocusBack : 1; // 0xd0
	FString PriceIconImage; // 0xd4
	int32_t BuyMoneyType; // 0xe4
	int32_t BuySelectIndex; // 0xe8
	int32_t LastRequestMin; // 0xec
	int32_t PublisherCash; // 0xf0
	TArray<int32_t> BulletSaleList; // 0xf4
};

struct ACombatWeapon_Plant : ACombatWeapon_Skill_Weapon {
	uint32_t bMartyrdom : 1; // 0x1ee8
};

struct UShadowMapTexture2D : UTexture2D {
	int32_t ShadowmapFlags; // 0x214
};

struct APlayerReplicationInfo : AReplicationInfo {
	float Score; // 0x244
	WordProperty Deaths; // 0x248
	char Ping; // 0x24a
	ETTSSpeaker TTSSpeaker; // 0x24b
	char RealPing; // 0x24c
	int32_t NumLives; // 0x250
	FString PlayerName; // 0x254
	FString OldName; // 0x264
	int32_t PlayerID; // 0x274
	ObjectProperty Team; // 0x278
	uint32_t bAdmin : 1; // 0x280
	uint32_t bIsSpectator : 1; // 0x280
	uint32_t bOnlySpectator : 1; // 0x280
	uint32_t bWaitingPlayer : 1; // 0x280
	uint32_t bReadyToPlay : 1; // 0x280
	uint32_t bOutOfLives : 1; // 0x280
	uint32_t bBot : 1; // 0x280
	uint32_t bHasBeenWelcomed : 1; // 0x280
	uint32_t bIsInactive : 1; // 0x280
	uint32_t bFromPreviousLevel : 1; // 0x280
	int32_t StartTime; // 0x284
	FString StringSpectating; // 0x288
	FString StringUnknown; // 0x298
	int32_t Kills; // 0x2a8
	UGameMessage* GameMessageClass; // 0x2ac
	float ExactPing; // 0x2b4
	float ExactRealPing; // 0x2b8
	FString SavedNetworkAddress; // 0x2bc
	FUniqueNetId UniqueId; // 0x2cc
	FUniqueNetId SteamId; // 0x2d4
	FName SessionName; // 0x2dc
	FAutomatedTestingDatum AutomatedTestingData; // 0x2e4
	int32_t StatConnectionCounts; // 0x2ec
	int32_t StatPingTotals; // 0x2f0
	int32_t StatPingMin; // 0x2f4
	int32_t StatPingMax; // 0x2f8
	int32_t StatPKLTotal; // 0x2fc
	int32_t StatPKLMin; // 0x300
	int32_t StatPKLMax; // 0x304
	int32_t StatMaxInBPS; // 0x308
	int32_t StatAvgInBPS; // 0x30c
	int32_t StatMaxOutBPS; // 0x310
	int32_t StatAvgOutBPS; // 0x314
	int32_t RecoilSetCount; // 0x318
	ObjectProperty Avatar; // 0x31c
};

struct UGameplayEventsWriterBase : UGameplayEvents {
	ObjectProperty Game; // 0x1c0
};

struct USeqAct_SetApexClothingParam : USequenceAction {
	uint32_t bEnableApexClothingSimulation : 1; // 0x108
};

struct ACombatGamePlayerCamera : AGamePlayerCamera {
	uint32_t bDOFUpdated : 1; // 0x620
	uint32_t bAdjustDOF : 1; // 0x620
	uint32_t bSetRotateCamPosition : 1; // 0x620
	float DOF_InterpolationDuration; // 0x624
	float DOF_BlurKernelSize; // 0x628
	float DOF_FalloffExponent; // 0x62c
	float DOF_FocusDistance; // 0x630
	float DOF_FocusInnerRadius; // 0x634
	EFocusType DOF_FocusType; // 0x638
	float DOF_MaxFarBlurAmount; // 0x63c
	float DOF_MaxNearBlurAmount; // 0x640
	FVector DOFTraceExtent; // 0x644
	float DOFDistanceInterpSpeed; // 0x650
	float LastDOFRadius; // 0x654
	float LastDOFDistance; // 0x658
	float DOF_RadiusFalloff; // 0x65c
	FVector2D DOF_RadiusRange; // 0x660
	FVector2D DOF_RadiusDistRange; // 0x668
	FVector RotateCamPostion; // 0x670
	FRotator RotateCamRotation; // 0x67c
	FVector RotateCamViewPoint; // 0x688
	int32_t RotateCamYaw; // 0x694
	int32_t RotateCamYawDelta; // 0x698
	float UnitRotateCamDistance; // 0x69c
	float RotateCamDistance; // 0x6a0
	float RotateCamTraceRange; // 0x6a4
};

struct AFluidSurfaceActor : AActor {
	ComponentProperty FluidComponent; // 0x244
	ObjectProperty ProjectileEntryEffect; // 0x24c
};

struct UPathGoalEvaluator : UObject {
	ObjectProperty NextEvaluator; // 0x60
	ObjectProperty GeneratedGoal; // 0x68
	int32_t MaxPathVisits; // 0x70
	int32_t CacheIdx; // 0x74
};

struct USeqVar_RandomInt : USeqVar_Int {
	int32_t Min; // 0xa4
	int32_t Max; // 0xa8
};

struct UCombatDataTableRefModeGroupBindMode : UCombatDataTableType {
	FString ModeCodeName; // 0x6c
	FString ModeGroupCodename; // 0x7c
	int32_t BetaVersion; // 0x8c
};

struct UMaterialExpression : UObject {
	int32_t EditorX; // 0x60
	int32_t EditorY; // 0x64
	uint32_t bRealtimePreview : 1; // 0x68
	uint32_t bNeedToUpdatePreview : 1; // 0x68
	uint32_t bIsParameterExpression : 1; // 0x68
	uint32_t bShowOutputNameOnPin : 1; // 0x68
	uint32_t bHidePreviewWindow : 1; // 0x68
	uint32_t bShowInputs : 1; // 0x68
	uint32_t bShowOutputs : 1; // 0x68
	uint32_t bUsedByStaticParameterSet : 1; // 0x68
	ObjectProperty Material; // 0x6c
	ObjectProperty Function; // 0x74
	FString Desc; // 0x7c
	FColor BorderColor; // 0x8c
	TArray<FName> MenuCategories; // 0x90
	TArray<FExpressionOutput> Outputs; // 0xa0
};

struct USeqVar_ObjectVolume : USeqVar_Object {
	float LastUpdateTime; // 0xc4
	TArray<ObjectProperty> ContainedObjects; // 0xc8
	TArray<UObject*> ExcludeClassList; // 0xd8
	uint32_t bCollidingOnly : 1; // 0xe8
};

struct UCombatHUD_KickUserSelect : UCombatHUDEntity_Base {
	TArray<FBlockAndReportLabelSettingInfo> BlockAndReportLabelSettingInfos; // 0xc0
	int32_t ReportPlayerID; // 0xd0
};

struct UAnimObject : UObject {
	ComponentProperty SkelComponent; // 0x60
};

struct UParticleModuleTypeDataMeshPhysX : UParticleModuleTypeDataMesh {
	ObjectProperty PhysXParSys; // 0x84
	EPhysXMeshRotationMethod PhysXRotationMethod; // 0x8c
	float FluidRotationCoefficient; // 0x90
	FPhysXEmitterVerticalLodProperties VerticalLod; // 0x94
	float ZOffset; // 0xa4
};

struct UParticleModuleSubUVDirect : UParticleModuleSubUVBase {
	FRawDistributionVector SubUVPosition; // 0x68
	FRawDistributionVector SubUVSize; // 0x8c
};

struct UNavMeshGoal_WithinDistanceEnvelope : UNavMeshPathGoalEvaluator {
	float MaxDistance; // 0x7c
	float MinDistance; // 0x80
	float MinTraversalDist; // 0x84
	FVector EnvelopeTestPoint; // 0x88
};

struct ACombatBombsiteVolume : AVolume {
	FString BombsiteName; // 0x280
	EObjectIconType MapIconType; // 0x290
	ObjectProperty SiteEffect; // 0x294
	float SiteEffectSizeRatio; // 0x29c
	int32_t PlantedBombID; // 0x2a0
};

struct ANxCylindricalForceFieldCapsule : ANxCylindricalForceField {
	ComponentProperty RenderComponent; // 0x2c8
};

struct UCombatGFxMoviePlayer : UGFxMoviePlayer {
	ObjectProperty CBTableDepot; // 0x1e4
	ObjectProperty OSS; // 0x1ec
	ObjectProperty ChannelTran; // 0x1f4
	ObjectProperty LobbyChatTran; // 0x1fc
	ObjectProperty CTran; // 0x204
	ObjectProperty ITran; // 0x20c
	ObjectProperty STran; // 0x214
	ObjectProperty LTran; // 0x21c
	ObjectProperty CommuTran; // 0x224
	ObjectProperty ClanTran; // 0x22c
	ObjectProperty MailTran; // 0x234
	ObjectProperty AwaitTran; // 0x23c
	ObjectProperty RandomBoxTran; // 0x244
	ObjectProperty GameOptionTran; // 0x24c
	ObjectProperty UserInfoTran; // 0x254
	ObjectProperty MainContainer; // 0x25c
	ObjectProperty CommandMC; // 0x264
	ObjectProperty SystemCounterMC; // 0x26c
	ObjectProperty NoticeMC; // 0x274
	FString MoviePath; // 0x27c
	ObjectProperty myHUD; // 0x28c
	FString IconImageHeadPath; // 0x294
	FString EmptyImageName; // 0x2a4
	FString PreLoadPackagePath; // 0x2b4
	ObjectProperty DialogManager; // 0x2c4
	ObjectProperty ChatManager; // 0x2cc
	UCombatChatManager* ChatManagerClass; // 0x2d4
	ObjectProperty OptionClass; // 0x2dc
	ObjectProperty OverImmersionGuardClass; // 0x2e4
	ObjectProperty VoiceChatOptionClass; // 0x2ec
	uint32_t bIsChatFocus : 1; // 0x2f4
	TArray<FURLInfo> URLList; // 0x2f8
};

struct USeqEvent_HudRenderImage : USeqEvent_HudRender {
	FLinearColor DisplayColor; // 0x140
	FVector DisplayLocation; // 0x150
	ObjectProperty DisplayTexture; // 0x15c
	float XL; // 0x164
	float YL; // 0x168
	float U; // 0x16c
	float V; // 0x170
	float UL; // 0x174
	float VL; // 0x178
};

struct UUIDataProvider_OnlineFriendMessages : UUIDataProvider_OnlinePlayerDataBase {
	TArray<FOnlineFriendMessage> Messages; // 0x74
	FString SendingPlayerNameCol; // 0x84
	FString bIsFriendInviteCol; // 0x94
	FString bWasAcceptedCol; // 0xa4
	FString bWasDeniedCol; // 0xb4
	FString MessageCol; // 0xc4
	FString LastInviteFrom; // 0xd4
};

struct USeqEvent_ParticleEvent : USequenceEvent {
	EParticleEventOutputType EventType; // 0x128
	FVector EventPosition; // 0x12c
	float EventEmitterTime; // 0x138
	FVector EventVelocity; // 0x13c
	float EventParticleTime; // 0x148
	FVector EventNormal; // 0x14c
	uint32_t UseRelfectedImpactVector : 1; // 0x158
};

struct UCombatGameTableDepot : UObject {
	ObjectProperty LocalizedTextTable; // 0x60
	ObjectProperty LocalizedChatCommandDataTable; // 0x68
	TArray<ObjectProperty> refTable; // 0x70
	TMap<None, None> MapCodeNameMap; // 0x80
	TMap<None, None> ModeCodeNameMap; // 0xc8
	TMap<None, None> ModeGroupCodeNameMap; // 0x110
	TMap<None, None> MissionCodeNameMap; // 0x158
	TMap<None, None> InitItemCodeNameMap; // 0x1a0
	TMap<None, None> ItemCodeNameMap; // 0x1e8
	TMap<None, None> ShopCodeNameMap; // 0x230
	TMap<None, None> ShopCategoryTabMap; // 0x278
	TMap<None, None> ShopCategoryCodeNameMap; // 0x2c0
	TMap<None, None> ShopItemCodeNameMap; // 0x308
	TMap<None, None> ShopItemGroupMap; // 0x350
	TMap<None, None> ShopItemShortcutMap; // 0x398
	TMap<None, None> AchievementCodeNameMap; // 0x3e0
	TMap<None, None> GameScoringCodeNameMap; // 0x428
	TMap<None, None> StatCodeNameMap; // 0x470
	TMap<None, None> PickupCodeNameMap; // 0x4b8
	TMap<None, None> DropCodeNameMap; // 0x500
	TMap<None, None> GroupSkillCodeNameMap; // 0x548
	TMap<None, None> SkillLicenseCodeNameMap; // 0x590
	TMap<None, None> RankCodeNameMap; // 0x5d8
	TMap<None, None> ModeOptionCodeNameMap; // 0x620
	TMap<None, None> ItemDetailinfoMap; // 0x668
	TMap<None, None> ItemClassNameMap; // 0x6b0
	TMap<None, None> ItemAttachmentWeaponNameMap; // 0x6f8
	TMap<None, None> CallingCardNameMap; // 0x740
	TMap<None, None> ShopSellItemMap; // 0x788
	TMap<None, None> EmblemNameMap; // 0x7d0
	TMap<None, None> QuestNameMap; // 0x818
	TMap<None, None> HelpTabCodeNameMap; // 0x860
	TMap<None, None> HelpDetailInfoCodeNameMap; // 0x8a8
	TMap<None, None> StatWeaponGroupNameMap; // 0x8f0
	TMap<None, None> SystemImageMap; // 0x938
	TMap<None, None> BoostCodeNameMap; // 0x980
	TMap<None, None> ShopItemPriceMap; // 0x9c8
	TMap<None, None> RewardCodeNameMap; // 0xa10
	TMap<None, None> ModeGuideCodeNameMap; // 0xa58
	TMap<None, None> FrontEndModeMap; // 0xaa0
	TMap<None, None> ModeTipCodeNameMap; // 0xae8
	TMap<None, None> BGMNameMap; // 0xb30
	TMap<None, None> AttendCodeNameMap; // 0xb78
	TMap<None, None> DefineCodeNameMap; // 0xbc0
	TMap<None, None> KillComboCodeNameMap; // 0xc08
	TMap<None, None> AIRewardRankCodeNameMap; // 0xc50
	TMap<None, None> TypeDefineDataMap; // 0xc98
	TMap<None, None> RandomBoxCubeCodeNameMap; // 0xce0
	TMap<None, None> RematchOptionCodeNameMap; // 0xd28
	TMap<None, None> GameChannelMap; // 0xd70
	TMap<None, None> GameChannelPropertyMap; // 0xdb8
	TMap<None, None> SystemTextColorMap; // 0xe00
	TMap<None, None> LimitSaleMap; // 0xe48
	TMap<None, None> SteamItemMap; // 0xe90
	TMap<None, None> TierMap; // 0xed8
	TMap<None, None> TierSeasonMap; // 0xf20
	TMap<None, None> PenaltyMap; // 0xf68
	TMap<None, None> PenaltyBindMap; // 0xfb0
	TMap<None, None> FormulaMap; // 0xff8
	TMap<None, None> QuestShortcutMap; // 0x1040
	TMap<None, None> ExchangeCashMap; // 0x1088
	TMap<None, None> TodayGameMap; // 0x10d0
	TMap<None, None> TodayGameBindModeMap; // 0x1118
	TMap<None, None> CompetitivePenaltyMap; // 0x1160
	int32_t MaxRank; // 0x11a8
	uint32_t bFinishedLoadAllTables : 1; // 0x11ac
	TMap<None, None> ItemUnLockRecipeMap; // 0x11b0
	TMap<None, None> CompetitiveBindModeSeasonMap; // 0x11f8
	TMap<None, None> CompetitiveSeasonMap; // 0x1240
	TMap<None, None> PingGroupMap; // 0x1288
	TMap<None, None> PingGroupRegionMap; // 0x12d0
	TMap<None, None> NationTableMap; // 0x1318
	TMap<None, None> SupportUserGroupMap; // 0x1360
	TMap<None, None> PeriodAttendRewardMap; // 0x13a8
	TMap<None, None> MatchMakingRatingMap; // 0x13f0
	TMap<None, None> MatchMakingOptionMap; // 0x1438
	TMap<None, None> MarkerOptionMap; // 0x1480
	TMap<None, None> ARaceEquipMap; // 0x14c8
	TMap<None, None> ShopRotationMap; // 0x1510
	TMap<None, None> EvolveModeEquipMap; // 0x1558
	TMap<None, None> EvolveModeOptionMap; // 0x15a0
	TMap<None, None> ExtendPeriodBindMap; // 0x15e8
	TMap<None, None> SeasonPassMap; // 0x1630
	TMap<None, None> ClanColorMap; // 0x1678
	TMap<None, None> ClanMarkMap; // 0x16c0
	TMap<None, None> ItemOptionMap; // 0x1708
	TMap<None, None> ItemOptionBindMap; // 0x1750
	TMap<None, None> ClanTierEmblemMap; // 0x1798
	TArray<FDataTableInfo> DataTableList; // 0x17e0
	TArray<RefTableType> UnnecessaryDataTableListOnDedi; // 0x17f0
	TArray<FName> StatTableEventKeyList; // 0x1800
};

struct ACombatPawn_SentryGun : ACombatPawn_AttackSkillActor {
	uint32_t Reloading : 1; // 0x1274
	FName ReloadAnim; // 0x1278
	ObjectProperty BaseControl; // 0x1280
};

struct ULevelStreamingDistance : ULevelStreaming {
	FVector Origin; // 0x100
	float MaxDistance; // 0x10c
};

struct UFaceFXAnimSet : UObject {
	FPointer InternalFaceFXAnimSet; // 0x60
	TArray<char> RawFaceFXAnimSetBytes; // 0x68
	TArray<char> RawFaceFXMiniSessionBytes; // 0x78
	int32_t NumLoadErrors; // 0x88
};

struct UCombatRescueGameMovie : UCombatTeamGameMovie {
	ObjectProperty HostageContainer; // 0xad0
	uint32_t bUpdate : 1; // 0xad8
	ObjectProperty HostageStateMovie; // 0xadc
	ObjectProperty RepairTimeBarMC; // 0xae4
};

struct AKActor : ADynamicSMActor {
	uint32_t bDamageAppliesImpulse : 1; // 0x294
	uint32_t bWakeOnLevelStart : 1; // 0x294
	uint32_t bCurrentSlide : 1; // 0x294
	uint32_t bSlideActive : 1; // 0x294
	uint32_t bEnableStayUprightSpring : 1; // 0x294
	uint32_t bLimitMaxPhysicsVelocity : 1; // 0x294
	uint32_t bNeedsRBStateReplication : 1; // 0x294
	uint32_t bDisableClientSidePawnInteractions : 1; // 0x294
	ComponentProperty ImpactEffectComponent; // 0x298
	ComponentProperty ImpactSoundComponent; // 0x2a0
	ComponentProperty ImpactSoundComponent2; // 0x2a8
	float LastImpactTime; // 0x2b0
	FPhysEffectInfo ImpactEffectInfo; // 0x2b4
	ComponentProperty SlideEffectComponent; // 0x2cc
	ComponentProperty SlideSoundComponent; // 0x2d4
	float LastSlideTime; // 0x2dc
	FPhysEffectInfo SlideEffectInfo; // 0x2e0
	float StayUprightTorqueFactor; // 0x2f8
	float StayUprightMaxTorque; // 0x2fc
	float MaxPhysicsVelocity; // 0x300
	FRigidBodyState RBState; // 0x310
	float AngErrorAccumulator; // 0x350
	FVector ReplicatedDrawScale3D; // 0x354
	FVector InitialLocation; // 0x360
	FRotator InitialRotation; // 0x36c
};

struct UCombatFrontEnd_Channel : UCombatFrontEnd_Scene {
	FButtonInfo ButtonList[0x3]; // 0xd0
	int32_t BoosterList[0x2]; // 0x10c
	ObjectProperty ChannelTran; // 0x114
	int32_t SelectChannelIndex; // 0x11c
	TArray<FOnlineBannerInfo> BannerImgDownloadData; // 0x120
	TArray<FBannerInfo> BannerImgURL; // 0x130
	int32_t BannerDurationTime; // 0x140
};

struct UCombatGameViewportClient : UGameViewportClient {
	FString HintLocFileName; // 0x1a0
	TArray<F__ASPECT> ScreenResList; // 0x1b0
	uint32_t bShowReflectionsOnly : 1; // 0x1c0
	uint32_t bShowSpawnGroupIndex : 1; // 0x1c0
	TArray<FColor> BitMapForScreenShot; // 0x1c4
	TArray<FName> FlushkeyInputNames; // 0x1d4
};

struct ALiftExit : ANavigationPoint {
	ObjectProperty MyLiftCenter; // 0x33c
	uint32_t bExitOnly : 1; // 0x344
};

struct ACombatPlayerStart : APlayerStart {
	FVector StartVelocityInTheAir; // 0x34c
	uint32_t bPlaceInTheAir : 1; // 0x358
	uint32_t bUseFirstSpawn : 1; // 0x358
	char AreaIndex; // 0x35c
	ComponentProperty TeamSpriteComponent; // 0x360
	ComponentProperty InTheAirSpriteComponent; // 0x368
	ComponentProperty InTheAirArrowComponent; // 0x370
	FVector FloorLocation; // 0x378
};

struct USeqAct_SetParticleSysParam : USequenceAction {
	TArray<FParticleSysParam> InstanceParameters; // 0x108
	uint32_t bOverrideScalar : 1; // 0x118
	float ScalarValue; // 0x11c
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x94
};

struct ACombatRescueGameHUD : ACombatTeamGameHUD {
	uint32_t bStateNameDirty : 1; // 0x62c
	uint32_t bMovePositionDirty : 1; // 0x62c
};

struct USeqAct_RemoveState : USequenceAction {
	FString StateName; // 0x108
};

struct UParticleModuleTypeDataBeam : UParticleModuleTypeDataBase {
	EBeamMethod BeamMethod; // 0x68
	EBeamEndPointMethod EndPointMethod; // 0x69
	FRawDistributionFloat Distance; // 0x6c
	FRawDistributionVector EndPoint; // 0x90
	int32_t TessellationFactor; // 0xb4
	FRawDistributionFloat EmitterStrength; // 0xb8
	FRawDistributionFloat TargetStrength; // 0xdc
	FRawDistributionVector EndPointDirection; // 0x100
	int32_t TextureTile; // 0x124
	uint32_t RenderGeometry : 1; // 0x128
	uint32_t RenderDirectLine : 1; // 0x128
	uint32_t RenderLines : 1; // 0x128
	uint32_t RenderTessellation : 1; // 0x128
};

struct UGameThirdPersonCamera : UGameCameraBase {
	float WorstLocBlockedPct; // 0x6c
	float WorstLocPenetrationExtentScale; // 0x70
	float PenetrationBlendOutTime; // 0x74
	float PenetrationBlendInTime; // 0x78
	float PenetrationBlockedPct; // 0x7c
	float PenetrationExtentScale; // 0x80
	FVector LastActualOriginOffset; // 0x84
	FVector LastActualCameraOrigin; // 0x90
	FRotator LastActualCameraOriginRot; // 0x9c
	float OriginOffsetInterpSpeed; // 0xa8
	FVector LastViewOffset; // 0xac
	float LastCamFOV; // 0xb8
	FVector LastIdealCameraOrigin; // 0xbc
	FRotator LastIdealCameraOriginRot; // 0xc8
	ObjectProperty ThirdPersonCamDefault; // 0xd4
	UGameThirdPersonCameraMode* ThirdPersonCamDefaultClass; // 0xdc
	ObjectProperty CurrentCamMode; // 0xe4
	float LastHeightAdjustment; // 0xec
	float LastPitchAdjustment; // 0xf0
	float LastYawAdjustment; // 0xf4
	float LeftoverPitchAdjustment; // 0xf8
	float Focus_BackOffStrength; // 0xfc
	float Focus_StepHeightAdjustment; // 0x100
	int32_t Focus_MaxTries; // 0x104
	float Focus_FastAdjustKickInTime; // 0x108
	float LastFocusChangeTime; // 0x10c
	FVector ActualFocusPointWorldLoc; // 0x110
	FVector LastFocusPointLoc; // 0x11c
	FCamFocusPointParams FocusPoint; // 0x128
	uint32_t bFocusPointSet : 1; // 0x160
	uint32_t bFocusPointSuccessful : 1; // 0x160
	uint32_t bDoingACameraTurn : 1; // 0x160
	uint32_t bTurnAlignTargetWhenFinished : 1; // 0x160
	uint32_t bDrawDebug : 1; // 0x160
	uint32_t bDoingDirectLook : 1; // 0x160
	uint32_t bDebugChangedCameraMode : 1; // 0x160
	uint32_t bDoSeamlessPivotTransition : 1; // 0x160
	float TurnCurTime; // 0x164
	int32_t TurnStartAngle; // 0x168
	int32_t TurnEndAngle; // 0x16c
	float TurnTotalTime; // 0x170
	float TurnDelay; // 0x174
	int32_t LastPostCamTurnYaw; // 0x178
	int32_t DirectLookYaw; // 0x17c
	float DirectLookInterpSpeed; // 0x180
	float WorstLocInterpSpeed; // 0x184
	FVector LastWorstLocationLocal; // 0x188
	FVector LastWorstLocation; // 0x194
	FVector LastPreModifierCameraLoc; // 0x1a0
	FRotator LastPreModifierCameraRot; // 0x1ac
	TArray<FPenetrationAvoidanceFeeler> PenetrationAvoidanceFeelers; // 0x1b8
	FVector LastOffsetAdjustment; // 0x1c8
};

struct UInterpTrackMove : UInterpTrack {
	FInterpCurveVector PosTrack; // 0xa0
	FInterpCurveVector EulerTrack; // 0xb4
	FInterpLookupTrack LookupTrack; // 0xc8
	FName LookAtGroupName; // 0xd8
	float LinCurveTension; // 0xe0
	float AngCurveTension; // 0xe4
	uint32_t bUseQuatInterpolation : 1; // 0xe8
	uint32_t bShowArrowAtKeys : 1; // 0xe8
	uint32_t bDisableMovement : 1; // 0xe8
	uint32_t bShowTranslationOnCurveEd : 1; // 0xe8
	uint32_t bShowRotationOnCurveEd : 1; // 0xe8
	uint32_t bHide3DTrack : 1; // 0xe8
	EInterpTrackMoveFrame MoveFrame; // 0xec
	EInterpTrackMoveRotMode RotMode; // 0xed
};

struct ACombatMapPoint : AActor {
	EObjectIconType iconType; // 0x244
	int32_t DesStringID; // 0x248
	int32_t Priority; // 0x24c
	FName MapPointName; // 0x250
};

struct UGripBTInterface : UObject {
	float DeltaTime; // 0x60
	float Time; // 0x64
	ObjectProperty Blackboard; // 0x68
	ObjectProperty ActionFramework; // 0x70
};

struct AKActorSpawnable : AKActor {
	uint32_t bRecycleScaleToZero : 1; // 0x378
	uint32_t bScalingToZero : 1; // 0x378
};

struct UPartyBeacon : UObject {
	FPointer VfTable_FTickableObject; // 0x60
	int32_t PartyBeaconPort; // 0x68
	FPointer Socket; // 0x6c
	uint32_t bIsInTick : 1; // 0x74
	uint32_t bWantsDeferredDestroy : 1; // 0x74
	uint32_t bShouldTick : 1; // 0x74
	float HeartbeatTimeout; // 0x78
	float ElapsedHeartbeatTime; // 0x7c
	FName BeaconName; // 0x80
	DelegateProperty __OnDestroyComplete__Delegate; // 0x88
};

struct UTerrainWeightMapTexture : UTexture2D {
	ObjectProperty ParentTerrain; // 0x214
	TArray<FPointer> WeightedMaterials; // 0x21c
};

struct UNavMeshGoal_At : UNavMeshPathGoalEvaluator {
	FVector Goal; // 0x7c
	float GoalDist; // 0x88
	uint32_t bKeepPartial : 1; // 0x8c
	uint32_t bWeightPartialByDist : 1; // 0x8c
	uint32_t bGoalInSamePolyAsAnchor : 1; // 0x8c
	float PartialDistSq; // 0x90
	FPointer GoalPoly; // 0x94
	FPointer PartialGoal; // 0x9c
};

struct UAnimNodeSynch : UAnimNodeBlendBase {
	TArray<FSynchGroup> Groups; // 0x100
};

struct UCombatDataTableRefClanAttendanceReward : UCombatDataTableType {
	int32_t Idx; // 0x6c
	int32_t ClanLevel; // 0x70
	FClanAttendRewardData AttendReward[0x2]; // 0x74
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x60
	ComponentProperty PlayAudioComp; // 0x64
};

struct ACombatDemGameReplicationInfo : ACBGameReplicationInfo {
	TArray<ObjectProperty> Bombsites; // 0x380
	TArray<ObjectProperty> Bombs; // 0x390
	int32_t TotalBombsites; // 0x3a0
	int32_t TotalBombs; // 0x3a4
	WordProperty PlantedBombSettingTime; // 0x3a8
};

struct ACombatDroppedSupplies_MediKit : ACombatDroppedSupplies {
	int32_t HealRate; // 0x35c
};

struct ACombatAssasinGame : ACombatPVPGame {
	uint32_t bVIPMove : 1; // 0x788
	uint32_t bVIPalive : 1; // 0x788
	EGamePhase GameStatus; // 0x78c
	WordProperty EVACRemainTime; // 0x78e
};

struct UMcpUserCloudFileDownload : UMcpServiceBase {
	FString EnumerateCloudFilesUrl; // 0x78
	FString ReadCloudFileUrl; // 0x88
	FString WriteCloudFileUrl; // 0x98
	FString DeleteCloudFileUrl; // 0xa8
	TArray<FMcpUserCloudFilesEntry> UserCloudFileRequests; // 0xb8
	TArray<DelegateProperty> EnumerateUserFilesCompleteDelegates; // 0xc8
	TArray<DelegateProperty> ReadUserFileCompleteDelegates; // 0xd8
	TArray<DelegateProperty> WriteUserFileCompleteDelegates; // 0xe8
	TArray<DelegateProperty> DeleteUserFileCompleteDelegates; // 0xf8
	DelegateProperty __OnEnumerateUserFilesComplete__Delegate; // 0x108
	DelegateProperty __OnReadUserFileComplete__Delegate; // 0x118
	DelegateProperty __OnWriteUserFileComplete__Delegate; // 0x128
	DelegateProperty __OnDeleteUserFileComplete__Delegate; // 0x138
};

struct UGripBTComment : UGripBTNode {
	uint32_t bMoveNodesInBox : 1; // 0xbc
	uint32_t bWrapped : 1; // 0xbc
	uint32_t bLimitFontSize : 1; // 0xbc
	uint32_t bDrawBox : 1; // 0xbc
	uint32_t bFilled : 1; // 0xbc
	int32_t SizeX; // 0xc0
	int32_t SizeY; // 0xc4
	int32_t BorderWidth; // 0xc8
	FColor BorderColor; // 0xcc
	FColor FillColor; // 0xd0
};

struct AStaticMeshCollectionActor : AStaticMeshActorBase {
	TArray<ComponentProperty> StaticMeshComponents; // 0x244
	int32_t MaxStaticMeshComponents; // 0x254
};

struct USoundCue : UObject {
	FName SoundClass; // 0x60
	ESoundClassName SoundClassName; // 0x68
	uint32_t bDebug : 1; // 0x6c
	ObjectProperty FirstNode; // 0x70
	TMap<None, None> EditorData; // 0x78
	float MaxAudibleDistance; // 0xc0
	float VolumeMultiplier; // 0xc4
	float PitchMultiplier; // 0xc8
	float Duration; // 0xcc
	ObjectProperty FaceFXAnimSetRef; // 0xd0
	FString FaceFXGroupName; // 0xd8
	FString FaceFXAnimName; // 0xe8
	int32_t MaxConcurrentPlayCount; // 0xf8
	int32_t CurrentPlayCount; // 0xfc
	FName SoundGroup; // 0x100
};

struct USeqAct_GetVectorComponents : USequenceAction {
	FVector InVector; // 0x108
	float X; // 0x114
	float Y; // 0x118
	float Z; // 0x11c
};

struct USequenceObject : UObject {
	int32_t ObjInstanceVersion; // 0x60
	ObjectProperty ParentSequence; // 0x64
	FString ObjName; // 0x6c
	FString ObjComment; // 0x7c
	uint32_t bDeletable : 1; // 0x8c
	uint32_t bDrawFirst : 1; // 0x8c
	uint32_t bDrawLast : 1; // 0x8c
	uint32_t bOutputObjCommentToScreen : 1; // 0x8c
	uint32_t bSuppressAutoComment : 1; // 0x8c
	int32_t DrawWidth; // 0x90
	int32_t DrawHeight; // 0x94
};

struct ACombatSplineActor : ASplineActor {
	uint32_t bSpawnPoint : 1; // 0x2ac
	uint32_t bMovementOnly : 1; // 0x2ac
	uint32_t bFixedTrack : 1; // 0x2ac
	uint32_t bSkipDestroy : 1; // 0x2ac
	uint32_t bAddedSplineActorList : 1; // 0x2ac
	float MovementSpeedModifier; // 0x2b0
	float WaitingPeriod; // 0x2b4
	FColor DefaultPointColor; // 0x2b8
	FColor WaitingPointColor; // 0x2bc
	FColor MovementPointColor; // 0x2c0
	char TeamIndex; // 0x2c4
	ESplineSpeedType MovementSpeedType; // 0x2c5
	ESplineActorType SPawnActorType; // 0x2c6
	ComponentProperty SpriteComp; // 0x2c8
	ComponentProperty SphereComp; // 0x2d0
};

struct ACombatOccupiedAreaData : AReplicationInfo {
	int32_t TotalOccupierNum; // 0x244
	float UpdateOccupationTime; // 0x248
	int32_t OccupationScore; // 0x24c
	ObjectProperty Target; // 0x250
	ObjectProperty Team; // 0x258
};

struct UMobileInputZone : UObject {
	EZoneType Type; // 0x60
	char TouchpadIndex; // 0x61
	EZoneState State; // 0x62
	EZoneSlideType SlideType; // 0x63
	FString Caption; // 0x64
	FName InputKey; // 0x74
	FName HorizontalInputKey; // 0x7c
	FName TapInputKey; // 0x84
	FName DoubleTapInputKey; // 0x8c
	float VertMultiplier; // 0x94
	float HorizMultiplier; // 0x98
	float Acceleration; // 0x9c
	float Smoothing; // 0xa0
	float EscapeVelocityStrength; // 0xa4
	uint32_t bScalePawnMovement : 1; // 0xa8
	uint32_t bRelativeX : 1; // 0xa8
	uint32_t bRelativeY : 1; // 0xa8
	uint32_t bRelativeSizeX : 1; // 0xa8
	uint32_t bRelativeSizeY : 1; // 0xa8
	uint32_t bActiveSizeYFromX : 1; // 0xa8
	uint32_t bSizeYFromSizeX : 1; // 0xa8
	uint32_t bApplyGlobalScaleToActiveSizes : 1; // 0xa8
	uint32_t bCenterX : 1; // 0xa8
	uint32_t bCenterY : 1; // 0xa8
	uint32_t bIsInvisible : 1; // 0xa8
	uint32_t bQuickDoubleTap : 1; // 0xa8
	uint32_t bCenterOnEvent : 1; // 0xa8
	uint32_t bSliderHasTrack : 1; // 0xa8
	uint32_t bFloatingTiltZone : 1; // 0xa8
	uint32_t bUseGentleTransitions : 1; // 0xa8
	uint32_t bAllowFirstDeltaForTrackballZone : 1; // 0xa8
	uint32_t bRenderGuides : 1; // 0xa8
	uint32_t bIsDoubleTapAndHold : 1; // 0xa8
	float X; // 0xac
	float Y; // 0xb0
	float SizeX; // 0xb4
	float SizeY; // 0xb8
	float ActiveSizeX; // 0xbc
	float ActiveSizeY; // 0xc0
	float InitialX; // 0xc4
	float InitialY; // 0xc8
	float InitialSizeX; // 0xcc
	float InitialSizeY; // 0xd0
	float InitialActiveSizeX; // 0xd4
	float InitialActiveSizeY; // 0xd8
	float AuthoredGlobalScale; // 0xdc
	float Border; // 0xe0
	float ResetCenterAfterInactivityTime; // 0xe4
	float TapDistanceConstraint; // 0xe8
	float ActivateTime; // 0xec
	float DeactivateTime; // 0xf0
	FColor RenderColor; // 0xf4
	float InactiveAlpha; // 0xf8
	float CaptionXAdjustment; // 0xfc
	float CaptionYAdjustment; // 0x100
	ObjectProperty OverrideTexture1; // 0x104
	FString OverrideTexture1Name; // 0x10c
	FTextureUVs OverrideUVs1; // 0x11c
	ObjectProperty OverrideTexture2; // 0x12c
	FString OverrideTexture2Name; // 0x134
	FTextureUVs OverrideUVs2; // 0x144
	FVector2D InitialLocation; // 0x154
	FVector2D CurrentLocation; // 0x15c
	FVector2D CurrentCenter; // 0x164
	FVector2D InitialCenter; // 0x16c
	FVector2D PreviousLocations[0x6]; // 0x174
	float PreviousMoveDeltaTimes[0x6]; // 0x1a4
	int32_t PreviousLocationCount; // 0x1bc
	float LastTouchTime; // 0x1c0
	float TimeSinceLastTapRepeat; // 0x1c4
	float AnimatingFadeOpacity; // 0x1c8
	ObjectProperty InputOwner; // 0x1cc
	float TransitionTime; // 0x1d4
	FVector2D EscapeVelocity; // 0x1d8
	TArray<ObjectProperty> MobileSeqEventHandlers; // 0x1e0
	FVector2D LastAxisValues; // 0x1f0
	float TotalActiveTime; // 0x1f8
	float LastWentActiveTime; // 0x1fc
	DelegateProperty __OnProcessInputDelegate__Delegate; // 0x200
	DelegateProperty __OnTapDelegate__Delegate; // 0x210
	DelegateProperty __OnDoubleTapDelegate__Delegate; // 0x220
	DelegateProperty __OnProcessSlide__Delegate; // 0x230
	DelegateProperty __OnPreDrawZone__Delegate; // 0x240
	DelegateProperty __OnPostDrawZone__Delegate; // 0x250
};

struct ACombatVisBlocker : AActor {
	ComponentProperty CC; // 0x244
	TArray<ObjectProperty> InVolumePawnList; // 0x24c
};

struct ACombatWeaponPickupFactory_MeleeMode : ACombatWeaponPickupFactory {
	uint32_t bDropWeaponOnDeath : 1; // 0x44c
	uint32_t bRespawnDelaying : 1; // 0x44c
	float RespawnDelayedTime; // 0x450
};

struct UInterpTrack : UObject {
	FPointer VfTable_FInterpEdInputInterface; // 0x60
	FPointer CurveEdVTable; // 0x68
	TArray<ObjectProperty> SubTracks; // 0x70
	UInterpTrackInst* TrackInstClass; // 0x80
	ETrackActiveCondition ActiveCondition; // 0x88
	FString TrackTitle; // 0x8c
	uint32_t bOnePerGroup : 1; // 0x9c
	uint32_t bDirGroupOnly : 1; // 0x9c
	uint32_t bDisableTrack : 1; // 0x9c
	uint32_t bIsAnimControlTrack : 1; // 0x9c
	uint32_t bSubTrackOnly : 1; // 0x9c
	uint32_t bVisible : 1; // 0x9c
	uint32_t bIsSelected : 1; // 0x9c
	uint32_t bIsRecording : 1; // 0x9c
	uint32_t bIsCollapsed : 1; // 0x9c
};

struct UCombatDataTableRefSystemTextColor : UCombatDataTableType {
	int32_t GRADE; // 0x6c
	FString TextColor; // 0x70
};

struct UCombatHandGripController : USkelControlSingleBone {
	FName WeaponBoneName; // 0x100
	FName WeaponBoneName_Left; // 0x108
	FName GripSocketName; // 0x110
};

struct UAnimNotify_Sound : UAnimNotify {
	ObjectProperty SoundCue; // 0x60
	TArray<ObjectProperty> SoundCueList; // 0x68
	TArray<FName> SoundGroupList; // 0x78
	uint32_t bFollowActor : 1; // 0x88
	uint32_t bIgnoreIfActorHidden : 1; // 0x88
	uint32_t bPlaySoundcueByActor : 1; // 0x88
	FName BoneName; // 0x8c
	float PercentToPlay; // 0x94
	float VolumeMultiplier; // 0x98
	float PitchMultiplier; // 0x9c
};

struct ACombatLCTFFlagActor : AActor {
	uint32_t bIsActive : 1; // 0x244
	uint32_t SetTeamMax : 1; // 0x244
	uint32_t bFlagReusable : 1; // 0x244
	uint32_t HeldShowPositionSameTeam : 1; // 0x244
	uint32_t HeldShowPositionOtherTeam : 1; // 0x244
	uint32_t DroppedTeamReset : 1; // 0x244
	uint32_t DroppedCanPickOtherTeam : 1; // 0x244
	uint32_t DroppedPickToSpawnOtherTeam : 1; // 0x244
	uint32_t DroppedShowPositionSameTeam : 1; // 0x244
	uint32_t DroppedShowPositionOtherTeam : 1; // 0x244
	uint32_t bTouchFlag : 1; // 0x244
	int32_t LCTFActorIndex; // 0x248
	Team OwnerTeam; // 0x24c
	Team OriginalTeam; // 0x24d
	char SpawnID; // 0x24e
	char HoistedID; // 0x24f
	FName AttachmentSocket; // 0x250
	float AttachScale; // 0x258
	ComponentProperty SkelMesh; // 0x25c
	ComponentProperty LightEnvironment; // 0x264
	float DroppedBackTime; // 0x26c
	ComponentProperty PSC; // 0x270
	ObjectProperty HomeBase; // 0x278
	ObjectProperty HoistedPoint; // 0x280
	FName StateName; // 0x288
	int32_t missionArrayIndex; // 0x290
	float SkelScale; // 0x294
	ObjectProperty HeldPRI; // 0x298
};

struct UCombatAnim_TurnInPlace_Player : UAnimNodeSequenceBlendBase {
	TArray<FTIP_Transition> TIP_Transitions; // 0x168
	float TransitionBlendTime; // 0x178
	int32_t ActiveChildIndex; // 0x17c
	float BlendTimeToGo; // 0x180
};

struct UInterpTrackInstVisibility : UInterpTrackInst {
	EVisibilityTrackAction Action; // 0x60
	float LastUpdatePosition; // 0x64
};

struct UOnlineTitleFileDownloadBase : UMCPBase {
	TArray<DelegateProperty> ReadTitleFileCompleteDelegates; // 0x80
	TArray<DelegateProperty> RequestTitleFileListCompleteDelegates; // 0x90
	FString BaseUrl; // 0xa0
	FString RequestFileListURL; // 0xb0
	FString RequestFileURL; // 0xc0
	float TimeOut; // 0xd0
	TArray<FFileNameToURLMapping> FilesToUrls; // 0xd4
	DelegateProperty __OnReadTitleFileComplete__Delegate; // 0xe4
	DelegateProperty __OnRequestTitleFileListComplete__Delegate; // 0xf4
};

struct USkelControlFootPlacement : USkelControlLimb {
	float FootOffset; // 0x128
	EAxis FootUpAxis; // 0x12c
	FRotator FootRotOffset; // 0x130
	uint32_t bInvertFootUpAxis : 1; // 0x13c
	uint32_t bOrientFootToGround : 1; // 0x13c
	uint32_t bOnlyEnableForUpAdjustment : 1; // 0x13c
	float MaxUpAdjustment; // 0x140
	float MaxDownAdjustment; // 0x144
	float MaxFootOrientAdjust; // 0x148
};

struct ACameraActor : AActor {
	uint32_t bConstrainAspectRatio : 1; // 0x244
	uint32_t bCamOverridePostProcess : 1; // 0x244
	float AspectRatio; // 0x248
	float FOVAngle; // 0x24c
	float CamOverridePostProcessAlpha; // 0x250
	FPostProcessSettings CamOverridePostProcess; // 0x254
	ComponentProperty DrawFrustum; // 0x3b8
	ComponentProperty MeshComp; // 0x3c0
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x3c8
};

struct UAnalyticEventsBase : UPlatformInterfaceBase {
	uint32_t bSessionInProgress : 1; // 0x80
};

struct UCombatWeaponRISBase_LaserPoint : UCombatWeaponRISBase_SkeletalmeshComponent {
	FLinearColor TeamColor[0x2]; // 0xc44
	FName FirstPersonBoneName; // 0xc64
	FName TeamColorParameterName; // 0xc6c
	ComponentProperty ThirdPersonPSC; // 0xc74
	ObjectProperty ThirdPersonPSCTemplate; // 0xc7c
	FName ThirdPersonSocketName; // 0xc84
	FName ParticleLengthParameterName; // 0xc8c
	float ParticleLengthUpdateDelay; // 0xc94
	ObjectProperty LaserSightOnSnd; // 0xc98
	ObjectProperty LaserSightOffSnd; // 0xca0
	ObjectProperty LaserPointMI; // 0xca8
	float LastParticleLengthUpdateTime; // 0xcb0
};

struct ATerrain : AInfo {
	TArray<FTerrainHeight> Heights; // 0x244
	TArray<FTerrainInfoData> InfoData; // 0x254
	TArray<FTerrainLayer> Layers; // 0x264
	int32_t NormalMapLayer; // 0x274
	TArray<FTerrainDecoLayer> DecoLayers; // 0x278
	TArray<FAlphaMap> AlphaMaps; // 0x288
	TArray<ComponentProperty> TerrainComponents; // 0x298
	int32_t NumSectionsX; // 0x2a8
	int32_t NumSectionsY; // 0x2ac
	TArray<FTerrainWeightedMaterial> WeightedMaterials; // 0x2b0
	TArray<ObjectProperty> WeightedTextureMaps; // 0x2c0
	int32_t MaxTesselationLevel; // 0x2d0
	int32_t MinTessellationLevel; // 0x2d4
	float TesselationDistanceScale; // 0x2d8
	float TessellationCheckDistance; // 0x2dc
	int32_t CollisionTesselationLevel; // 0x2e0
	FCachedTerrainMaterialArray CachedTerrainMaterials[0x2]; // 0x2e4
	int32_t NumVerticesX; // 0x304
	int32_t NumVerticesY; // 0x308
	int32_t NumPatchesX; // 0x30c
	int32_t NumPatchesY; // 0x310
	int32_t MaxComponentSize; // 0x314
	int32_t StaticLightingResolution; // 0x318
	uint32_t bIsOverridingLightResolution : 1; // 0x31c
	uint32_t bBilinearFilterLightmapGeneration : 1; // 0x31c
	uint32_t bCastShadow : 1; // 0x31c
	uint32_t bForceDirectLightMap : 1; // 0x31c
	uint32_t bCastDynamicShadow : 1; // 0x31c
	uint32_t bEnableSpecular : 1; // 0x31c
	uint32_t bBlockRigidBody : 1; // 0x31c
	uint32_t bAllowRigidBodyUnderneath : 1; // 0x31c
	uint32_t bAcceptsDynamicLights : 1; // 0x31c
	uint32_t bMorphingEnabled : 1; // 0x31c
	uint32_t bMorphingGradientsEnabled : 1; // 0x31c
	uint32_t bLocked : 1; // 0x31c
	uint32_t bHeightmapLocked : 1; // 0x31c
	uint32_t bShowingCollision : 1; // 0x31c
	uint32_t bUseWorldOriginTextureUVs : 1; // 0x31c
	uint32_t bShowWireframe : 1; // 0x31c
	ObjectProperty TerrainPhysMaterialOverride; // 0x320
	FLightingChannelContainer LightingChannels; // 0x328
	FLightmassPrimitiveSettings LightmassSettings; // 0x32c
	FPointer ReleaseResourcesFence; // 0x348
	int32_t EditorTessellationLevel; // 0x350
	TArray<FSelectedTerrainVertex> SelectedVertices; // 0x354
	FColor WireframeColor; // 0x364
};

struct APrefabInstance : AActor {
	ObjectProperty TemplatePrefab; // 0x244
	int32_t TemplateVersion; // 0x24c
	TMap<None, None> ArchetypeToInstanceMap; // 0x250
	ObjectProperty SequenceInstance; // 0x298
	int32_t PI_PackageVersion; // 0x2a0
	int32_t PI_LicenseePackageVersion; // 0x2a4
	TArray<char> PI_Bytes; // 0x2a8
	TArray<ObjectProperty> PI_CompleteObjects; // 0x2b8
	TArray<ObjectProperty> PI_ReferencedObjects; // 0x2c8
	TArray<FString> PI_SavedNames; // 0x2d8
	TMap<None, None> PI_ObjectMap; // 0x2e8
};

struct USoundNodeDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x74
};

struct UCCSAFMoveToActor : UGripAFActionHandle {
	ObjectProperty Target; // 0x64
	ECCSMovementType MovementType; // 0x6c
	ECCSAlertnessState Alertness; // 0x6d
};

struct UMaterialExpressionFlipBookSample : UMaterialExpressionTextureSample {
	int32_t CoordinateIndex; // 0x120
};

struct UCombatHUD_Base : UGFxObject {
	ObjectProperty Owner; // 0xa0
	FString FontHTMLString; // 0xa8
	uint32_t bIsDisplayed : 1; // 0xb8
	uint32_t bOn : 1; // 0xb8
	uint32_t bMiniHUDMode : 1; // 0xb8
};

struct UMeshBeacon : UObject {
	FPointer VfTable_FTickableObject; // 0x60
	int32_t MeshBeaconPort; // 0x68
	FPointer Socket; // 0x6c
	uint32_t bIsInTick : 1; // 0x74
	uint32_t bWantsDeferredDestroy : 1; // 0x74
	uint32_t bShouldTick : 1; // 0x74
	float HeartbeatTimeout; // 0x78
	float ElapsedHeartbeatTime; // 0x7c
	FName BeaconName; // 0x80
	int32_t SocketSendBufferSize; // 0x88
	int32_t SocketReceiveBufferSize; // 0x8c
	int32_t MaxBandwidthTestBufferSize; // 0x90
	int32_t MinBandwidthTestBufferSize; // 0x94
	float MaxBandwidthTestSendTime; // 0x98
	float MaxBandwidthTestReceiveTime; // 0x9c
	int32_t MaxBandwidthHistoryEntries; // 0xa0
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x68
};

struct UCombatHUD_HitDamageBoard : UCombatHUDEntity_Base {
	TArray<ObjectProperty> BoardList; // 0xc0
	TArray<ObjectProperty> BoardList_DamageTF; // 0xd0
};

struct UCombatDataTableRefReward : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t ShowItemImage; // 0x80
	int32_t RewardGameMoney; // 0x84
	TArray<FRewardData> RewardDataList; // 0x88
	FString MailFormCodename; // 0x98
	int32_t Medal; // 0xa8
	int32_t BSCoin; // 0xac
	int32_t MCoin; // 0xb0
	int32_t GCoin; // 0xb4
	int32_t WinCoin; // 0xb8
	int32_t BattlePassExp; // 0xbc
};

struct UGamePlayEvent_Action : UObject {
	TArray<FActionTableDataType> TableDataList; // 0x60
	TArray<FTableInfoType> TableInfoList; // 0x70
	TArray<FName> ActionTargetList; // 0x80
	TArray<FName> EventTypeList; // 0x90
	TArray<int32_t> RegisteredActions; // 0xa0
};

struct UCombatDataTableType : UObject {
	int32_t EntryIndex; // 0x60
	ObjectProperty DataTable; // 0x64
};

struct USkelControlLimb : USkelControlBase {
	FVector EffectorLocation; // 0xd0
	EBoneControlSpace EffectorLocationSpace; // 0xdc
	EBoneControlSpace JointTargetLocationSpace; // 0xdd
	EBoneControlSpace JointOffsetSpace; // 0xde
	EAxis BoneAxis; // 0xdf
	EAxis JointAxis; // 0xe0
	FName EffectorSpaceBoneName; // 0xe4
	FVector JointTargetLocation; // 0xec
	FName JointTargetSpaceBoneName; // 0xf8
	FVector JointOffset; // 0x100
	FName JointOffsetBoneName; // 0x10c
	uint32_t bInvertBoneAxis : 1; // 0x114
	uint32_t bInvertJointAxis : 1; // 0x114
	uint32_t bRotateJoint : 1; // 0x114
	uint32_t bMaintainEffectorRelRot : 1; // 0x114
	uint32_t bTakeRotationFromEffectorSpace : 1; // 0x114
	uint32_t bAllowStretching : 1; // 0x114
	FVector2D StretchLimits; // 0x118
	FName StretchRollBoneName; // 0x120
};

struct UCameraShake : UObject {
	uint32_t bSingleInstance : 1; // 0x60
	uint32_t bRandomAnimSegment : 1; // 0x60
	float OscillationDuration; // 0x64
	float OscillationBlendInTime; // 0x68
	float OscillationBlendOutTime; // 0x6c
	FROscillator RotOscillation; // 0x70
	FVOscillator LocOscillation; // 0x94
	FFOscillator FOVOscillation; // 0xb8
	ObjectProperty Anim; // 0xc4
	float AnimPlayRate; // 0xcc
	float AnimScale; // 0xd0
	float AnimBlendInTime; // 0xd4
	float AnimBlendOutTime; // 0xd8
	float RandomAnimSegmentDuration; // 0xdc
};

struct UCCSBTScriptCover : UCCSBTScriptBehavior {
	ObjectProperty CurrHandle; // 0xd4
	ObjectProperty EnterHandle; // 0xdc
	ObjectProperty GetOutHandle; // 0xe4
	ObjectProperty FireHandle; // 0xec
	ObjectProperty ExitHandle; // 0xf4
	FCCSCoverData Cover; // 0xfc
	ScriptCoverState CoverState; // 0x124
};

struct UCCSAFIdle : UGripAFActionHandle {
	ECCSAlertnessState Alertness; // 0x64
};

struct APlayerCollectorGame : AGameInfo {
	int32_t NumberOfClientsToWaitFor; // 0x4c0
	FString URLToLoad; // 0x4c4
};

struct UActorFactoryArchetype : UActorFactory {
	ObjectProperty ArchetypeActor; // 0x9c
};

struct UKismetBookMark : UBookMark2D {
	FString BookMarkSequencePathName; // 0x6c
};

struct UPBRuleNodeBase : UObject {
	TArray<FPBRuleLink> NextRules; // 0x60
};

struct UCombatSteamAchivementManager : UObject {
	TArray<FSteamAchievementData> SteamAchievements; // 0x60
};

struct UParticleModuleTrailSpawn : UParticleModuleTrailBase {
	ComponentProperty SpawnDistanceMap; // 0x68
	float MinSpawnVelocity; // 0x70
};

struct UGripAFActionHandle : UObject {
	int32_t Handle; // 0x60
};

struct UUIDataProvider_OnlineFriends : UUIDataProvider_OnlinePlayerDataBase {
	TArray<FOnlineFriend> FriendsList; // 0x74
	FString NickNameCol; // 0x84
	FString PresenceInfoCol; // 0x94
	FString FriendStateCol; // 0xa4
	FString bIsOnlineCol; // 0xb4
	FString bIsPlayingCol; // 0xc4
	FString bIsPlayingThisGameCol; // 0xd4
	FString bIsJoinableCol; // 0xe4
	FString bHasVoiceSupportCol; // 0xf4
	FString bHaveInvitedCol; // 0x104
	FString bHasInvitedYouCol; // 0x114
	FString OfflineText; // 0x124
	FString OnlineText; // 0x134
	FString AwayText; // 0x144
	FString BusyText; // 0x154
};

struct UCombatDataTableRefShopTab : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString MainTab; // 0x70
	FString SubTab; // 0x80
};

struct UOutlineManager : UObject {
	TArray<FOutlineProperty> OutlinePropertyList; // 0x60
	TArray<FOutlineProperty> ForegroundOutlinePropertyList; // 0x70
	TArray<FOutlineMaterialVectorParam> OutlineMaterialParamList; // 0x80
	TArray<FOutlineRegisterCondition> OutlineRegisterConditionList; // 0x90
	ObjectProperty CombatPC; // 0xa0
	TArray<FOutlineMangedInfo> ManagedInfoList; // 0xa8
	TArray<FOutlineMangedInfo> ManagedInfoListBot; // 0xb8
	TArray<FGlobalOutlineEvent> GlobalOutlineEventList; // 0xc8
	TMap<None, None> OutlineConditionIndexMap; // 0xd8
};

struct UPhysXParticleSystem : UObject {
	int32_t MaxParticles; // 0x60
	int32_t ParticleSpawnReserve; // 0x64
	ERBCollisionChannel RBChannel; // 0x68
	ESimulationMethod SimulationMethod; // 0x69
	EPacketSizeMultiplier PacketSizeMultiplier; // 0x6a
	FRBCollisionChannelContainer RBCollideWithChannels; // 0x6c
	float CollisionDistance; // 0x70
	float RestitutionWithStaticShapes; // 0x74
	float RestitutionWithDynamicShapes; // 0x78
	float FrictionWithStaticShapes; // 0x7c
	float FrictionWithDynamicShapes; // 0x80
	float StaticFrictionWithStaticShapes; // 0x84
	float StaticFrictionWithDynamicShapes; // 0x88
	uint32_t bDynamicCollision : 1; // 0x8c
	uint32_t bDisableGravity : 1; // 0x8c
	uint32_t bStaticCollision : 1; // 0x8c
	uint32_t bTwoWayCollision : 1; // 0x8c
	uint32_t bDestroy : 1; // 0x8c
	uint32_t bSyncFailed : 1; // 0x8c
	uint32_t bIsInGame : 1; // 0x8c
	float MaxMotionDistance; // 0x90
	float Damping; // 0x94
	FVector ExternalAcceleration; // 0x98
	float RestParticleDistance; // 0xa4
	float RestDensity; // 0xa8
	float KernelRadiusMultiplier; // 0xac
	float Stiffness; // 0xb0
	float Viscosity; // 0xb4
	float CollisionResponseCoefficient; // 0xb8
	FPointer CascadeScene; // 0xbc
	FPointer PSys; // 0xc4
};

struct ATriggerStreamingLevel : ATrigger {
	TArray<FLevelStreamingData> Levels; // 0x254
};

struct UDistributionFloatUniformCurve : UDistributionFloat {
	FInterpCurveVector2D ConstantCurve; // 0x7c
};

struct UMaterialExpressionCustomTexture : UMaterialExpression {
	ObjectProperty Texture; // 0xb0
};

struct UCombatDataTableRefMatchMaking : UCombatDataTableType {
	int32_t Id; // 0x6c
	int32_t MaxUser; // 0x70
	int32_t StartableMinUser; // 0x74
	FString SupportGroupCodeName; // 0x78
	uint32_t ReturnBackPlayedGame : 1; // 0x88
	int32_t RatingLowLock; // 0x8c
	int32_t RatingHighLock; // 0x90
	int32_t SearchTimeOut; // 0x94
	int32_t RefusePrevMatch; // 0x98
	int32_t RefuseCommunityGroupMatchup; // 0x9c
	int32_t TeamGroupLimit; // 0xa0
	FString OptionCodename; // 0xa4
	FString RematchOptionCodeName; // 0xb4
	int32_t PingID; // 0xc4
};

struct ULocalMessage : UObject {
	uint32_t bIsSpecial : 1; // 0x60
	uint32_t bIsUnique : 1; // 0x60
	uint32_t bIsPartiallyUnique : 1; // 0x60
	uint32_t bIsConsoleMessage : 1; // 0x60
	uint32_t bBeep : 1; // 0x60
	uint32_t bCountInstances : 1; // 0x60
	float Lifetime; // 0x64
	FColor DrawColor; // 0x68
	float PosY; // 0x6c
	int32_t FontSize; // 0x70
};

struct UCombatInstanceItemManager : UObject {
	UCombatInstanceItem* InstanceItemList[0x4]; // 0x60
	UCombatAccessory_Base* AccessoryItemInfo; // 0x80
};

struct UClient : UObject {
	float MinDesiredFrameRate; // 0x68
	float DisplayGamma; // 0x6c
	float InitialButtonRepeatDelay; // 0x70
	float ButtonRepeatDelay; // 0x74
};

struct ADynamicAnchor : ANavigationPoint {
	ObjectProperty CurrentUser; // 0x33c
};

struct ATcpLink : AInternetLink {
	ELinkState LinkState; // 0x268
	FIpAddr RemoteAddr; // 0x26c
	ATcpLink* AcceptClass; // 0x274
	TArray<char> SendFIFO; // 0x27c
	FString RecvBuf; // 0x28c
};

struct UCanvas : UObject {
	ObjectProperty Font; // 0x60
	float OrgX; // 0x68
	float OrgY; // 0x6c
	float ClipX; // 0x70
	float ClipY; // 0x74
	float CurX; // 0x78
	float CurY; // 0x7c
	float CurZ; // 0x80
	float CurYL; // 0x84
	FColor DrawColor; // 0x88
	uint32_t bCenter : 1; // 0x8c
	uint32_t bNoSmooth : 1; // 0x8c
	int32_t SizeX; // 0x90
	int32_t SizeY; // 0x94
	FPointer Canvas; // 0x98
	FPointer SceneView; // 0xa0
	FPlane ColorModulate; // 0xb0
	ObjectProperty DefaultTexture; // 0xc0
};

struct UCombatHUD_BombsitesContainer : UCombatHUD_GOContainer {
	float GoMsgUpdateTime; // 0xd8
};

struct UMcpClashMobManager : UMcpClashMobBase {
	FString ChallengeListUrl; // 0xe8
	FString ChallengeStatusUrl; // 0xf8
	FString ChallengeMultiStatusUrl; // 0x108
	FString AcceptChallengeUrl; // 0x118
	FString UpdateChallengeProgressUrl; // 0x128
	FString UpdateRewardProgressUrl; // 0x138
	ObjectProperty HTTPRequestChallengeList; // 0x148
	TArray<FMcpChallengeUserRequest> ChallengeUserRequests; // 0x150
	TArray<FMcpClashMobChallengeEvent> ChallengeEvents; // 0x160
	TArray<FMcpClashMobChallengeUserStatus> ChallengeUserStatus; // 0x170
	FMcpClashMobChallengeUserStatus TempChallengeUserStatus; // 0x180
	TArray<FMcpClashMobChallengeUserStatus> TempChallengeUserStatusArray; // 0x1fc
	TScriptInterface<Class> FileCache; // 0x20c
	ObjectProperty FileDownloader; // 0x21c
};

struct ATriggeredPath : ANavigationPoint {
	uint32_t bOpen : 1; // 0x33c
	ObjectProperty MyTrigger; // 0x340
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0xb0
};

struct UGripAction_MoveToward : UCombatAIActionBase {
	ObjectProperty ActionNode; // 0x78
};

struct UCombatHUD_MarkerObject : UCombatHUD_GameObject {
	ObjectProperty Container; // 0x1b0
	int32_t MarkerID; // 0x1b8
	float MaxLifeTime; // 0x1bc
	float RemainLifeTime; // 0x1c0
	int32_t CurrentAlpha; // 0x1c4
	FVector WorldLocation; // 0x1c8
};

struct USeqAct_RangeSwitch : USequenceAction {
	TArray<FSwitchRange> Ranges; // 0x108
};

struct UPhysicsAsset : UObject {
	TArray<ObjectProperty> BodySetup; // 0x60
	FMap_Mirror BodySetupIndexMap; // 0x70
	TArray<int32_t> BoundsBodies; // 0xb8
	TArray<ObjectProperty> ConstraintSetup; // 0xc8
	ObjectProperty DefaultInstance; // 0xd8
};

struct UHTTPDownload : UDownload {
	FString RedirectToURL; // 0x74
	uint32_t UseCompression : 1; // 0x84
	FString ProxyServerHost; // 0xaa4
	int32_t ProxyServerPort; // 0xab4
	uint32_t MaxRedirection : 1; // 0xab8
	float ConnectionTimeout; // 0xabc
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FPointer VectorProp; // 0x70
	FVector ResetVector; // 0x78
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0xb0
	FExpressionInput Exponent; // 0xe4
};

struct UCombatDataTableRefWeaponGroup : UCombatDataTableType {
	int32_t Id; // 0x6c
	FString GroupName; // 0x70
};

struct USeqAct_SubtractInt : USeqAct_SetSequenceVariable {
	int32_t ValueA; // 0x108
	int32_t ValueB; // 0x10c
	float FloatResult; // 0x110
	int32_t IntResult; // 0x114
};

struct UParticleLightEnvironmentComponent : UDynamicLightEnvironmentComponent {
	int32_t ReferenceCount; // 0x168
	int32_t NumPooledReuses; // 0x16c
	ObjectProperty SharedInstigator; // 0x170
	ObjectProperty SharedParticleSystem; // 0x178
	uint32_t bAllowDLESharing : 1; // 0x180
};

struct UColorGradingEffect : UPostProcessEffect {
	FLUTBlender PreviousLUTBlender; // 0x88
};

struct UCombatHUD_ObserverInfo : UCombatHUDEntity_Base {
	int32_t LastHealth; // 0xc0
	int32_t LastAmmoCount; // 0xc4
	int32_t LastMagazineCount; // 0xc8
	int32_t LastGrenadeA; // 0xcc
	int32_t LastGrenadeB; // 0xd0
	FString LastWeaponName; // 0xd4
	uint32_t LastHasBomb : 1; // 0xe4
	uint32_t LastShowBullet : 1; // 0xe4
	int32_t LastLevel; // 0xe8
	int32_t LastTierPoint; // 0xec
	int32_t LastCCardID; // 0xf0
	FString LastLevelImgPath; // 0xf4
	FString LastTierImgSmallPath; // 0x104
	FString LastCCardPath; // 0x114
	int32_t LastKillCount; // 0x124
};

struct UCombatItemTransaction : UObject {
	TArray<FInventoryItemInfo> InventoryItemInfos; // 0x60
	TArray<FEquipItemInfo> EquipItemInfos; // 0x70
	TArray<FEquipItemInfo> SimulatedEquipItemInfos; // 0x80
	TArray<FEquipItemInfo> SendEuipItemInfos; // 0x90
	TArray<FEquipItemInfo> UnchangedEquipItemInfos; // 0xa0
	TArray<FShopItemInfo> OriShopItemInfos; // 0xb0
	TArray<FShopItemInfo> ShopItemInfos; // 0xc0
	TArray<int32_t> ServiceOffShopItemList; // 0xd0
	TArray<FExpiredItem> ExpiredItems; // 0xe0
	TArray<FRepurchaseItem> SelectedRepurchaseItems; // 0xf0
	uint32_t bShopItemsSorting : 1; // 0x100
	uint32_t bExpiredEquipItem : 1; // 0x100
	TArray<FS_BaseItemInfo> BaseItemList; // 0x104
	TArray<FString> DefaultPresetName; // 0x114
	int32_t SendActiveItemInventorySlotIndex; // 0x124
	TArray<FFilterInfo> FilterList; // 0x128
	TArray<FBoosterItem> BoosterItemList; // 0x138
	char SelectedGearSetIndex; // 0x148
	TArray<ObjectProperty> ItemBuyAfterList; // 0x14c
	int32_t PendingSlotID; // 0x15c
	TArray<FCallingCardInfo> CallingCardInfoList; // 0x160
	FRandomBoxGainResultInfo RandomBoxGainResult; // 0x170
	FRandomBoxShopItemInfo ReservedOpenRandomBoxShopItem; // 0x184
	FUseLockedItemInfo UseLockedItem; // 0x190
	FSendConsumeItemInfo CurSendConsumeItemInfo; // 0x1c0
	TMap<None, None> BuyLimitSaleItems; // 0x1c8
	TMap<None, None> BulletSaleTimeDate; // 0x210
	TArray<ObjectProperty> InitActiveRefItemList; // 0x258
	TMap<None, None> LimitBuyItemMap; // 0x268
	TArray<FSeasonPassData> SeasonPassArray; // 0x2b0
	int32_t CurrentSeasonPassSeason; // 0x2c0
	TMap<None, None> TuningMap; // 0x2c4
};

struct UGripBTClearState : UGripBTNode {
	FString StateName; // 0xbc
};

struct ACombatCheatPawn : ACombatGuy_NPC {
	char CheatPawnTeamNum; // 0x11f0
	int32_t SpawnNumber; // 0x11f4
	FString SpawnName; // 0x11f8
};

struct UCombatDataTableRefExp : UCombatDataTableType {
	int32_t Level; // 0x6c
	int32_t GoalExp; // 0x70
	FString SmallImage; // 0x74
	int32_t ImageID_Small; // 0x84
	FString BigImage; // 0x88
	int32_t ImageID_Big; // 0x98
	int32_t LevelNameID; // 0x9c
	FString LevelUpTopImage; // 0xa0
	int32_t ImageID_LevelUpTop; // 0xb0
	FString LevelUpBottomImage; // 0xb4
	int32_t ImageID_LevelUpBottom; // 0xc4
	FString RewardCodename; // 0xc8
	int32_t ImageID_RewardCode; // 0xd8
};

struct UChildConnection : UNetConnection {
	ObjectProperty Parent; // 0xb0ac
};

struct USeqEvent_HudRenderText : USeqEvent_HudRender {
	ObjectProperty DisplayFont; // 0x140
	FColor DisplayColor; // 0x148
	FVector DisplayLocation; // 0x14c
	FString DisplayText; // 0x158
	ETextDrawMethod TextDrawMethod; // 0x168
};

struct ADecalActorBase : AActor {
	FPointer VfTable_IEditorLinkSelectionInterface; // 0x244
	ComponentProperty Decal; // 0x24c
};

struct USequenceOp : USequenceObject {
	uint32_t bIsActivated : 1; // 0x98
	uint32_t bIsCurrentDebuggerOp : 1; // 0x98
	uint32_t bActive : 1; // 0x98
	uint32_t bLatentExecution : 1; // 0x98
	uint32_t bAutoActivateOutputLinks : 1; // 0x98
	uint32_t bHaveMovingVarConnector : 1; // 0x98
	uint32_t bHaveMovingInputConnector : 1; // 0x98
	uint32_t bHaveMovingOutputConnector : 1; // 0x98
	uint32_t bPendingVarConnectorRecalc : 1; // 0x98
	uint32_t bPendingInputConnectorRecalc : 1; // 0x98
	uint32_t bPendingOutputConnectorRecalc : 1; // 0x98
	uint32_t bIsBreakpointSet : 1; // 0x98
	uint32_t bIsHiddenBreakpointSet : 1; // 0x98
	TArray<FSeqOpInputLink> InputLinks; // 0x9c
	TArray<FSeqOpOutputLink> OutputLinks; // 0xac
	TArray<FSeqVarLink> VariableLinks; // 0xbc
	TArray<FSeqEventLink> EventLinks; // 0xcc
	int32_t PlayerIndex; // 0xdc
	char GamepadID; // 0xe0
	int32_t ActivateCount; // 0xe4
	int32_t SearchTag; // 0xe8
};

struct USequenceEvent : USequenceOp {
	TArray<ObjectProperty> DuplicateEvts; // 0xec
	ObjectProperty Originator; // 0xfc
	ObjectProperty Instigator; // 0x104
	float ActivationTime; // 0x10c
	int32_t TriggerCount; // 0x110
	int32_t MaxTriggerCount; // 0x114
	float ReTriggerDelay; // 0x118
	uint32_t bEnabled : 1; // 0x11c
	uint32_t bPlayerOnly : 1; // 0x11c
	uint32_t bRegistered : 1; // 0x11c
	uint32_t bClientSideOnly : 1; // 0x11c
	char Priority; // 0x120
	int32_t MaxWidth; // 0x124
};

struct UTerrainLayerSetup : UObject {
	TArray<FTerrainFilteredMaterial> Materials; // 0x60
};

struct UCombatCharacterTransaction : UObject {
	TMap<None, None> PlayerCompetitionPointInfo; // 0x60
	uint32_t NeedBackToCompetitionGame : 1; // 0xa8
	FCharacterTransactionData PlayerData; // 0xac
	TArray<FRecordRecentlyPlayed> TempMyRecordRecentlyPlayed; // 0x1cc
	TArray<FRecordRecentlyPlayedList> MyRecordRecentlyPlayedList; // 0x1dc
	char MAX_RECORD_RECENTLY_PLAYED; // 0x1ec
	FLevelExpData UI_LevelData; // 0x1f0
	int32_t UI_Money; // 0x1f8
	TArray<FMatchOnOffInfo> PlayerPageMatchOnOffInfoList; // 0x1fc
	TArray<FMatchOnOffInfo> MyPageMatchOnOffInfoList; // 0x20c
	TArray<FMatchOnOffInfo> ClanPageMatchOnOffInfoList; // 0x21c
	TArray<int32_t> CurrentCompetitiveModeList; // 0x22c
	TArray<FRandomBoxOpenData> RandomBoxOpenList; // 0x23c
	TArray<int32_t> QueuedReservedPeriodAttendIdx; // 0x24c
};

struct AGameAIController : AAIController {
	ObjectProperty CommandList; // 0x454
	uint32_t bHasRunawayCommandList : 1; // 0x45c
	uint32_t bAILogging : 1; // 0x45c
	uint32_t bAILogToWindow : 1; // 0x45c
	uint32_t bFlushAILogEachLine : 1; // 0x45c
	uint32_t bMapBasedLogName : 1; // 0x45c
	uint32_t bAIDrawDebug : 1; // 0x45c
	uint32_t bAIBroken : 1; // 0x45c
	ObjectProperty AILogFile; // 0x460
	float DebugTextMaxLen; // 0x468
	TArray<FAICmdHistoryItem> CommandHistory; // 0x46c
	int32_t CommandHistoryNum; // 0x47c
	TArray<FName> AILogFilter; // 0x480
	FString DemoActionString; // 0x490
};

struct UInterpTrackVectorMaterialParam : UInterpTrackVectorBase {
	TArray<FMaterialReferenceList> Materials; // 0xb8
	ObjectProperty Material; // 0xc8
	FName ParamName; // 0xd0
	uint32_t bNeedsMaterialRefsUpdate : 1; // 0xd8
};

struct UAnimNodeScalePlayRate : UAnimNodeBlendBase {
	float ScaleByValue; // 0x100
};

struct UCombatInGameBattleLog : UObject {
	TArray<FbattleLog> BattleLogData; // 0x60
	TArray<FDisplayTable> OtherPlayersTables; // 0x70
	FDisplayTable MyTable; // 0x80
	FString LocalPlayerName; // 0xb0
	int32_t KillerIndex; // 0xc0
	TArray<FString> SupportedGameNames; // 0xc4
	uint32_t bActive : 1; // 0xd4
	ObjectProperty BattleLogMC; // 0xd8
	ObjectProperty LocalPC; // 0xe0
	float DisplayTableSettingDelayTime; // 0xe8
};

struct UMcpUserManagerBase : UMcpServiceBase {
	FString McpUserManagerClassName; // 0x78
	DelegateProperty __OnRegisterUserComplete__Delegate; // 0x88
	DelegateProperty __OnQueryUsersComplete__Delegate; // 0x98
	DelegateProperty __OnDeleteUserComplete__Delegate; // 0xa8
};

struct UInteractiveFoliageComponent : UStaticMeshComponent {
	FPointer FoliageSceneProxy; // 0x2f4
};

struct USceneCapture2DHitMaskComponent : USceneCaptureComponent {
	ObjectProperty TextureTarget; // 0xd0
	ComponentProperty SkeletalMeshComp; // 0xd8
	int32_t MaterialIndex; // 0xe0
	int32_t ForceLOD; // 0xe4
	int32_t HitMaskCullDistance; // 0xe8
	float FadingStartTimeSinceHit; // 0xec
	float FadingPercentage; // 0xf0
	float FadingDurationTime; // 0xf4
	float FadingIntervalTime; // 0xf8
};

struct UCombatAnimNodeSequence : UAnimNodeSequence {
	uint32_t bAutoStart : 1; // 0x158
	uint32_t bLoopLastSequence : 1; // 0x158
	TArray<FName> SeqStack; // 0x15c
};

struct ACombatGuyBase : ACombatPawn {
	float Client_DistanceOfCorsshairTargetForUI; // 0x111c
	float CheckTargetedForUI_DotMin; // 0x1120
	float CheckTargetedForUI_DotMax; // 0x1124
};

struct UGripActionNode_Sleep : UCombatAIActionNodeBase {
	float Duration; // 0xf4
	float StartTimeSeconds; // 0xf8
};

struct USavedMove : UObject {
	ObjectProperty NextMove; // 0x60
	float TimeStamp; // 0x68
	float Delta; // 0x6c
	uint32_t bRun : 1; // 0x70
	uint32_t bDuck : 1; // 0x70
	uint32_t bPressedJump : 1; // 0x70
	uint32_t bDoubleJump : 1; // 0x70
	uint32_t bPreciseDestination : 1; // 0x70
	uint32_t bForceRMVelocity : 1; // 0x70
	uint32_t bForceMaxAccel : 1; // 0x70
	uint32_t bRootMotionFromInterpCurve : 1; // 0x70
	EDoubleClickDir DoubleClickMove; // 0x74
	EPhysics SavedPhysics; // 0x75
	ERootMotionMode RootMotionMode; // 0x76
	FVector StartLocation; // 0x78
	FVector StartRelativeLocation; // 0x84
	FVector StartVelocity; // 0x90
	FVector StartFloor; // 0x9c
	FVector SavedLocation; // 0xa8
	FVector SavedVelocity; // 0xb4
	FVector SavedRelativeLocation; // 0xc0
	FVector RMVelocity; // 0xcc
	FVector Acceleration; // 0xd8
	FRotator Rotation; // 0xe4
	ObjectProperty StartBase; // 0xf0
	ObjectProperty EndBase; // 0xf8
	float CustomTimeDilation; // 0x100
	float AccelDotThreshold; // 0x104
	float RootMotionInterpCurrentTime; // 0x108
	FVector RootMotionInterpCurveLastValue; // 0x10c
};

struct UFailedConnect : ULocalMessage {
	FString FailMessage[0x4]; // 0x74
};

struct UCombatDataTableRefQuest : UCombatDataTableType {
	int32_t Index; // 0x6c
	int32_t QuestNameID; // 0x70
	int32_t QuestObjectiveID; // 0x74
	int32_t QuestDescriptionID; // 0x78
	FString ShortCutCodeName; // 0x7c
	int32_t TotalCount; // 0x8c
	int32_t TotalCountType; // 0x90
	int32_t TotalStep; // 0x94
	int32_t MissionProgressStringID; // 0x98
	char QuestGroup; // 0x9c
	char QuestType; // 0x9d
	int32_t OpenPublisher; // 0xa0
	uint32_t ShowGauge : 1; // 0xa4
	int32_t QuestTab; // 0xa8
	int32_t ReturnUserType; // 0xac
	TArray<FStepByStepRewardType> StepByStepReward; // 0xb0
};

struct ANxCylindricalForceField : ANxForceField {
	float RadialStrength; // 0x298
	float RotationalStrength; // 0x29c
	float LiftStrength; // 0x2a0
	float ForceRadius; // 0x2a4
	float ForceTopRadius; // 0x2a8
	float LiftFalloffHeight; // 0x2ac
	float EscapeVelocity; // 0x2b0
	float ForceHeight; // 0x2b4
	float HeightOffset; // 0x2b8
	uint32_t UseSpecialRadialForce : 1; // 0x2bc
	FPointer Kernel; // 0x2c0
};

struct UMcpServiceBase : UObject {
	FString McpConfigClassName; // 0x60
	ObjectProperty McpConfig; // 0x70
};

struct UCombatLCTFMovie : UCombatTeamGameMovie {
	ObjectProperty CTFContainer; // 0xad0
	ObjectProperty CTFMovie; // 0xad8
	uint32_t bUpdate : 1; // 0xae0
	uint32_t bUpdateFlagGet : 1; // 0xae0
	int32_t LastTeamMission[0x2]; // 0xae4
};

struct UCombatDataTableRefInitItem : UCombatDataTableType {
	FString CodeName; // 0x6c
	int32_t bActive; // 0x7c
	int32_t PresetEquip[0x3]; // 0x80
};

struct ACombatAI_TDMBase : ACombatBotController_GuyBase {
	uint32_t bThrowedGrenadeCount : 1; // 0x5e8
	ObjectProperty AIPawn_TDMBase; // 0x5ec
	ObjectProperty AIGame_TDMBase; // 0x5f4
	int32_t UsableAIBeaconIndex; // 0x5fc
};

struct UCCSBTCombatSwitchWeapon : UGripBTScriptBehavior {
	EWeaponGroup WeaponSlotIndex; // 0xcc
	ObjectProperty bc; // 0xd0
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0xb0
	EMaterialPositionTransformSource TransformSourceType; // 0xe4
	EMaterialPositionTransform TransformType; // 0xe5
};

struct AWebConnection : ATcpLink {
	ObjectProperty WebServer; // 0x29c
	FString ReceivedData; // 0x2a4
	ObjectProperty Request; // 0x2b4
	ObjectProperty Response; // 0x2bc
	ObjectProperty Application; // 0x2c4
	uint32_t bDelayCleanup : 1; // 0x2cc
	int32_t RawBytesExpecting; // 0x2d0
	int32_t MaxValueLength; // 0x2d4
	int32_t MaxLineLength; // 0x2d8
	int32_t ConnID; // 0x2dc
};

struct ACombatDemolitionPC : ACombatPC {
	TArray<ObjectProperty> TriggerUsedList; // 0xbe4
	FSExactLocationInfo PawnExactLocation; // 0xbf4
};

struct UMaterialExpressionVectorParameter : UMaterialExpressionParameter {
	FLinearColor DefaultValue; // 0xd0
};

struct UCombatDataTableRefQuestShortcut : UCombatDataTableType {
	FString CodeName; // 0x6c
	FString ChannelCodeName; // 0x7c
	FString ModeGroupCodename; // 0x8c
	int32_t OpenWorld; // 0x9c
};

struct UPBRuleNodeVariation : UPBRuleNodeBase {
	uint32_t bVariationOfScopeOnLeft : 1; // 0x70
};

struct UActorFactoryAmbientSoundSimple : UActorFactory {
	ObjectProperty SoundNodeWave; // 0x9c
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x68
	FRawDistributionVector UpperRightCorner; // 0x8c
	uint32_t bAbsolute : 1; // 0xb0
	uint32_t bKillInside : 1; // 0xb0
	uint32_t bAxisAlignedAndFixedSize : 1; // 0xb0
};

struct UPlatformInterfaceBase : UObject {
	TArray<FDelegateArray> AllDelegates; // 0x60
	DelegateProperty __PlatformInterfaceDelegate__Delegate; // 0x70
};

struct UCombatAnimBlendBase : UAnimNodeBlendList {
	float BlendTime; // 0x120
	TArray<float> ChildBlendTimes; // 0x124
	TArray<AlphaBlendType> ChildBlendType; // 0x134
};

struct UCombatHUD_ExitContainer : UCombatHUD_GOContainer {
	ObjectProperty MapPointActor; // 0xd8
};

struct USeqAct_Destroy : USequenceAction {
	uint32_t bDestroyBasedActors : 1; // 0x108
	TArray<AActor*> IgnoreBasedClasses; // 0x10c
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x68
	float DistributeOverNPoints; // 0x8c
	float DistributeThreshold; // 0x90
};

struct USeqAct_Trace : USequenceAction {
	uint32_t bTraceActors : 1; // 0x108
	uint32_t bTraceWorld : 1; // 0x108
	FVector TraceExtent; // 0x10c
	FVector StartOffset; // 0x118
	FVector EndOffset; // 0x124
	ObjectProperty HitObject; // 0x130
	float Distance; // 0x138
	FVector HitLocation; // 0x13c
};

struct ACombatEvolveGunPRI : ACombatPlayerReplicationInfo {
	int32_t CurrentPoint; // 0x520
	int32_t CurrentWeaponIndex; // 0x524
	int32_t CurrentGrade; // 0x528
	int32_t AllEvolvePoint; // 0x52c
	int32_t LastAllEvolvePoint; // 0x530
};

struct ACombatBombardActor : AActor {
	float BombardDelay; // 0x244
	int32_t BombardNum; // 0x248
	int32_t PerBombNum; // 0x24c
	ACombatProjectile* PClass; // 0x250
	int32_t CurBombardNum; // 0x258
	float BombardX; // 0x25c
	float BombardY; // 0x260
	float BombardHeight; // 0x264
	float StartDelay; // 0x268
	float PreDelay; // 0x26c
	float AddedHeight; // 0x270
	ComponentProperty Mesh; // 0x274
	ObjectProperty BombardSound; // 0x27c
	ObjectProperty WarnigSound; // 0x284
	ObjectProperty AirWhipSound; // 0x28c
	int32_t LocalizedMSGIndex; // 0x294
	ObjectProperty DustTemplate; // 0x298
	ComponentProperty DustPSC; // 0x2a0
	ComponentProperty LockOnPSC; // 0x2a8
	float StartDustDelay; // 0x2b0
	uint32_t bShowLockOnEffectOnSameTeam : 1; // 0x2b4
	uint32_t AlreadyExcute : 1; // 0x2b4
	char CallerTeam; // 0x2b8
	int32_t WeaponIndex; // 0x2bc
	FName EventName; // 0x2c0
};

struct USeqAct_CombatTutorial_QuestOn : USequenceAction {
	FString QuestID; // 0x108
	int32_t QuestTextIdx; // 0x118
	int32_t QuestCompletedTextIdx; // 0x11c
};

struct UCombatAnimBlendPerBone_Multi : UAnimNodeBlendPerBone {
	TArray<FBlendInfo> BlendInfoArr; // 0x144
	ObjectProperty Owner; // 0x154
	int32_t ActiveChildIndex; // 0x15c
	int32_t LastActiveChild; // 0x160
	float SliderPosition; // 0x164
};

struct AGameCrowdReplicationActor : AActor {
	ObjectProperty Spawner; // 0x244
	uint32_t bSpawningActive : 1; // 0x24c
	int32_t DestroyAllCount; // 0x250
};

struct UParticleModuleUberLTISIVCL : UParticleModuleUberBase {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartVelocity; // 0xc0
	FRawDistributionFloat StartVelocityRadial; // 0xe4
	FRawDistributionVector ColorOverLife; // 0x108
	FRawDistributionFloat AlphaOverLife; // 0x12c
};

struct UCombatGameEngine : UGameEngine {
	UOnlineSubsystem* OnlineSubsystemDedicatedSvrClass; // 0xb98
	ObjectProperty TableDepot; // 0xba0
	UCombatGameTableDepot* ServerTableDepotClass; // 0xba8
	UCombatGameTableDepot* ClientTableDepotClass; // 0xbb0
	ObjectProperty BGMPlayer; // 0xbb8
	TArray<FString> SuppressList; // 0xbc0
	TArray<FSYSTEMSETTING_DATA> ChangedInGameSystemSetting; // 0xbd0
	TArray<FSYSTEMSETTING_DATA> CacheInGameSystemSetting; // 0xbe0
	uint32_t IsFrontEndScene : 1; // 0xbf0
	TArray<FWorldCube> WorldCubeList; // 0xbf4
	ObjectProperty PendingLevelPackage; // 0xc04
	ObjectProperty PendingLevelLinkerLoad; // 0xc0c
	ObjectProperty PendingLevelWorld; // 0xc14
	float DefaultMapLoadingDelay; // 0xc1c
	ObjectProperty AE; // 0xc20
	int32_t UpdateEnterFrameTime; // 0xc28
	int32_t GDIBrushCounter; // 0xc2c
	int32_t GDIDCCounter; // 0xc30
	int32_t GDIFontCounter; // 0xc34
	float ObjectPoolTimerDelta; // 0xc38
	ObjectProperty Vivox; // 0xc3c
	ObjectProperty VoiceChatUsers; // 0xc44
	ObjectProperty BannerManager; // 0xc4c
};

struct UCombatHUD_ExitObject : UCombatHUD_GameObject {
	char iconType; // 0x1b0
	EVIPIconType LastVIPIconType; // 0x1b1
	int32_t LastVIPHealthPercent; // 0x1b4
};

struct APlayerController : AController {
	ObjectProperty Player; // 0x430
	ObjectProperty PlayerCamera; // 0x438
	ACamera* CameraClass; // 0x440
	uint32_t bFrozen : 1; // 0x448
	uint32_t bPressedJump : 1; // 0x448
	uint32_t bDoubleJump : 1; // 0x448
	uint32_t bUpdatePosition : 1; // 0x448
	uint32_t bUpdating : 1; // 0x448
	uint32_t bNeverSwitchOnPickup : 1; // 0x448
	uint32_t bCheatFlying : 1; // 0x448
	uint32_t bCameraPositionLocked : 1; // 0x448
	uint32_t bShortConnectTimeOut : 1; // 0x448
	uint32_t bPendingDestroy : 1; // 0x448
	uint32_t bWasSpeedHack : 1; // 0x448
	uint32_t bWasSaturated : 1; // 0x448
	uint32_t bAimingHelp : 1; // 0x448
	uint32_t bCameraCut : 1; // 0x448
	uint32_t bClientSimulatingViewTarget : 1; // 0x448
	uint32_t bHasVoiceHandshakeCompleted : 1; // 0x448
	uint32_t bCinematicMode : 1; // 0x448
	uint32_t bInteractiveMode : 1; // 0x448
	uint32_t bCinemaDisableInputMove : 1; // 0x448
	uint32_t bCinemaDisableInputLook : 1; // 0x448
	uint32_t bRenderHUDFullScreen : 1; // 0x448
	uint32_t bIgnoreNetworkMessages : 1; // 0x448
	uint32_t bShowKismetDrawText : 1; // 0x448
	uint32_t bReplicateAllPawns : 1; // 0x448
	uint32_t bIsUsingStreamingVolumes : 1; // 0x448
	uint32_t bIsExternalUIOpen : 1; // 0x448
	uint32_t bIsControllerConnected : 1; // 0x448
	uint32_t bCheckSoundOcclusion : 1; // 0x448
	uint32_t bDebugCameraAnims : 1; // 0x448
	uint32_t bBlockCameraAnimsFromOverridingPostProcess : 1; // 0x448
	uint32_t bLogHearSoundOverflow : 1; // 0x448
	uint32_t bCheckRelevancyThroughPortals : 1; // 0x448
	uint32_t bDebugClientAdjustPosition : 1; // 0x44c
	float MaxResponseTime; // 0x450
	float WaitDelay; // 0x454
	ObjectProperty AcknowledgedPawn; // 0x458
	EDoubleClickDir DoubleClickDir; // 0x460
	char bIgnoreMoveInput; // 0x461
	char bIgnoreLookInput; // 0x462
	char bRun; // 0x463
	char bDuck; // 0x464
	char NetPlayerIndex; // 0x465
	ObjectProperty ViewTarget; // 0x468
	ObjectProperty RealViewTarget; // 0x470
	ObjectProperty ControllingDirTrackInst; // 0x478
	float FOVAngle; // 0x480
	float DesiredFOV; // 0x484
	float DefaultFOV; // 0x488
	float LODDistanceFactor; // 0x48c
	FRotator TargetViewRotation; // 0x490
	float TargetEyeHeight; // 0x49c
	FRotator BlendedTargetViewRotation; // 0x4a0
	ObjectProperty myHUD; // 0x4ac
	ObjectProperty mySecondaryHUD; // 0x4b4
	USavedMove* SavedMoveClass; // 0x4bc
	ObjectProperty SavedMoves; // 0x4c4
	ObjectProperty FreeMoves; // 0x4cc
	ObjectProperty PendingMove; // 0x4d4
	FVector LastAckedAccel; // 0x4dc
	float CurrentTimeStamp; // 0x4e8
	float LastUpdateTime; // 0x4ec
	float ServerTimeStamp; // 0x4f0
	float TimeMargin; // 0x4f4
	float ClientUpdateTime; // 0x4f8
	float MaxTimeMargin; // 0x4fc
	float LastActiveTime; // 0x500
	int32_t ClientCap; // 0x504
	float DynamicPingThreshold; // 0x508
	float LastPingUpdate; // 0x50c
	float LastRealPingUpdate; // 0x510
	float LastSpeedHackLog; // 0x514
	float MAXPOSITIONERRORSQUARED; // 0x518
	float MAXNEARZEROVELOCITYSQUARED; // 0x51c
	FClientAdjustment PendingAdjustment; // 0x520
	int32_t GroundPitch; // 0x558
	ObjectProperty CheatManager; // 0x55c
	ACheatManager* CheatClass; // 0x564
	ObjectProperty PlayerInput; // 0x56c
	UPlayerInput* InputClass; // 0x574
	FVector FailedPathStart; // 0x57c
	ComponentProperty CylinderComponent; // 0x588
	FString ForceFeedbackManagerClassName; // 0x590
	ObjectProperty ForceFeedbackManager; // 0x5a0
	TArray<ObjectProperty> Interactions; // 0x5a8
	TArray<FUniqueNetId> VoiceMuteList; // 0x5b8
	TArray<FUniqueNetId> GameplayVoiceMuteList; // 0x5c8
	TArray<FUniqueNetId> VoicePacketFilter; // 0x5d8
	TArray<FConnectedPeerInfo> ConnectedPeers; // 0x5e8
	TArray<FUniqueNetId> BestNextHostPeers; // 0x5f8
	ObjectProperty MigratedSearchToJoin; // 0x608
	ObjectProperty OnlineSub; // 0x610
	TScriptInterface<Class> VoiceInterface; // 0x618
	ObjectProperty OnlinePlayerData; // 0x628
	float InteractDistance; // 0x630
	FName DelayedJoinSessionName; // 0x634
	TArray<FInputMatchRequest> InputRequests; // 0x63c
	float LastBroadcastTime; // 0x64c
	FString LastBroadcastString[0x4]; // 0x650
	TArray<FName> PendingMapChangeLevelNames; // 0x690
	ObjectProperty MyCoverReplicator; // 0x6a0
	TArray<FDebugTextInfo> DebugTextList; // 0x6a8
	float SpectatorCameraSpeed; // 0x6b8
	ObjectProperty PendingSwapConnection; // 0x6bc
	float MinRespawnDelay; // 0x6c4
	int32_t MaxConcurrentHearSounds; // 0x6c8
	TArray<ComponentProperty> HearSoundActiveComponents; // 0x6cc
	TArray<ComponentProperty> HearSoundPoolComponents; // 0x6dc
	TArray<ObjectProperty> HiddenActors; // 0x6ec
	float LastSpectatorStateSynchTime; // 0x6fc
	TArray<FSingleChannelSound> SingleChannelSounds; // 0x700
	DelegateProperty __OnMissingPeersUnregistered__Delegate; // 0x710
	DelegateProperty __CanUnpause__Delegate; // 0x720
	DelegateProperty __InputMatchDelegate__Delegate; // 0x730
};

struct UInterpTrackSound : UInterpTrackVectorBase {
	TArray<FSoundTrackKey> Sounds; // 0xb8
	uint32_t bPlayOnReverse : 1; // 0xc8
	uint32_t bContinueSoundOnMatineeEnd : 1; // 0xc8
	uint32_t bSuppressSubtitles : 1; // 0xc8
	uint32_t bTreatAsDialogue : 1; // 0xc8
};

struct UInterpTrackLinearColorBase : UInterpTrack {
	FInterpCurveLinearColor LinearColorTrack; // 0xa0
	float CurveTension; // 0xb4
};

struct ACombatProj_Grenade : ACombatProj_ExplosiveBase {
	uint32_t IsStickyBomb : 1; // 0x3e4
	uint32_t bShoutWarning : 1; // 0x3e4
	float WarningDistance; // 0x3e8
	float ForWardAdditionalTossRate; // 0x3ec
	float BackWardAdditionalTossRate; // 0x3f0
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	float Exponent; // 0xb0
	FExpressionInput Normal; // 0xb4
};

struct UMobileMenuBarItem : UObject {
	int32_t Width; // 0x60
	int32_t Height; // 0x64
	FVector2D VpPos; // 0x68
};

struct ACombatGroupStart : ACombatPlayerStart {
	uint32_t bPlayer : 1; // 0x384
	int32_t GroupID; // 0x388
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	uint32_t bPersistFade : 1; // 0xb8
};

struct USeqAct_ActorFactory : USeqAct_Latent {
	uint32_t bEnabled : 1; // 0x120
	uint32_t bIsSpawning : 1; // 0x120
	uint32_t bCheckSpawnCollision : 1; // 0x120
	ObjectProperty Factory; // 0x124
	EPointSelection PointSelection; // 0x12c
	TArray<ObjectProperty> SpawnPoints; // 0x130
	TArray<FVector> SpawnLocations; // 0x140
	TArray<FVector> SpawnOrientations; // 0x150
	int32_t SpawnCount; // 0x160
	float SpawnDelay; // 0x164
	int32_t LastSpawnIdx; // 0x168
	int32_t CurrentSpawnIdx; // 0x16c
	int32_t SpawnedCount; // 0x170
	float RemainingDelay; // 0x174
};

struct USimpleSplineNonLoopAudioComponent : USimpleSplineAudioComponent {
	float DelayMin; // 0x2f0
	float DelayMax; // 0x2f4
	float PitchMin; // 0x2f8
	float PitchMax; // 0x2fc
	float VolumeMin; // 0x300
	float VolumeMax; // 0x304
	int32_t CurrentSlotIndex; // 0x308
	float UsedVolumeModulation; // 0x30c
	float UsedPitchModulation; // 0x310
	float NextSoundTime; // 0x314
};

struct UAnimNotify_PawnMaterialParam : UAnimNotify_Scripted {
	TArray<FScalarParameterInterpStruct> ScalarParameterInterpArray; // 0x60
};

struct UCombatDataTableRefDecomposition : UCombatDataTableType {
	int32_t DecompositionType; // 0x6c
	int32_t TypeTime; // 0x70
	int32_t Type1; // 0x74
	int32_t Type2; // 0x78
	int32_t Type3; // 0x7c
	int32_t Type4; // 0x80
	int32_t DefaultTP; // 0x84
	int32_t TPMultiply; // 0x88
	int32_t OptionConefficient; // 0x8c
	int32_t OptionPlus; // 0x90
};

struct USeqAct_SetVector : USeqAct_SetSequenceVariable {
	FVector DefaultValue; // 0x108
};

struct USeqAct_WaitForLevelsVisible : USeqAct_Latent {
	TArray<FName> LevelNames; // 0x120
	uint32_t bShouldBlockOnLoad : 1; // 0x130
};

struct UGameCrowdGroup : UObject {
	TArray<ObjectProperty> Members; // 0x60
};

struct USeqAct_ProjectileFactory : USeqAct_ActorFactory {
	ObjectProperty PSTemplate; // 0x178
	FName SocketName; // 0x180
	FName BoneName; // 0x188
};

struct UCombatImpactLight : UPointLightComponent {
	float StartBrightness; // 0x240
	float Lifetime; // 0x244
	float PassedTime; // 0x248
	DelegateProperty __OnLightFinished__Delegate; // 0x24c
};

struct ASceneCaptureCubeMapActor : ASceneCaptureActor {
	ComponentProperty StaticMesh; // 0x24c
	ObjectProperty CubeMaterialInst; // 0x254
};

struct UInterpTrackFloatMaterialParam : UInterpTrackFloatBase {
	TArray<FMaterialReferenceList> Materials; // 0xb8
	ObjectProperty Material; // 0xc8
	FName ParamName; // 0xd0
	uint32_t bNeedsMaterialRefsUpdate : 1; // 0xd8
};

struct ANxRadialForceField : ANxForceField {
	ComponentProperty RenderComponent; // 0x298
	float ForceStrength; // 0x2a0
	float ForceRadius; // 0x2a4
	ERadialImpulseFalloff ForceFalloff; // 0x2a8
	FPointer LinearKernel; // 0x2ac
};

struct UGameSkelCtrl_Recoil : USkelControlBase {
	uint32_t bBoneSpaceRecoil : 1; // 0xd0
	uint32_t bPlayRecoil : 1; // 0xd0
	uint32_t bOldPlayRecoil : 1; // 0xd0
	uint32_t bApplyControl : 1; // 0xd0
	FRecoilDef Recoil; // 0xd4
	FVector2D Aim; // 0x144
};

struct UActorFactoryAmbientSound : UActorFactory {
	ObjectProperty AmbientSoundCue; // 0x9c
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x60
	TArray<FParticleSystemReplayFrame> Frames; // 0x64
};

struct UForceFieldShapeBox : UForceFieldShape {
	ComponentProperty Shape; // 0x60
};

struct UPartyBeaconClient : UPartyBeacon {
	FOnlineGameSearchResult HostPendingRequest; // 0x98
	FPartyReservation PendingRequest; // 0xa8
	EPartyBeaconClientState ClientBeaconState; // 0xc4
	EPartyBeaconClientRequest ClientBeaconRequestType; // 0xc5
	float ReservationRequestTimeout; // 0xc8
	float ReservationRequestElapsedTime; // 0xcc
	FString ResolverClassName; // 0xd0
	UClientBeaconAddressResolver* ResolverClass; // 0xe0
	ObjectProperty Resolver; // 0xe8
	DelegateProperty __OnReservationRequestComplete__Delegate; // 0xf0
	DelegateProperty __OnReservationCountUpdated__Delegate; // 0x100
	DelegateProperty __OnTravelRequestReceived__Delegate; // 0x110
	DelegateProperty __OnHostIsReady__Delegate; // 0x120
	DelegateProperty __OnHostHasCancelled__Delegate; // 0x130
};

struct UParticleModuleAttractorBoneSocket : UParticleModuleAttractorBase {
	EBoneSocketAttractorFalloffType FalloffType; // 0x68
	ELocationBoneSocketDestination DestinationType; // 0x69
	ELocationBoneSocketDestSelectionMethod SelectionMethod; // 0x6a
	uint32_t bParticleLifeRelative : 1; // 0x6c
	uint32_t bAttractAlongLengthOfBone : 1; // 0x6c
	FRawDistributionFloat FalloffExponent; // 0x70
	FRawDistributionFloat Range; // 0x94
	FRawDistributionFloat Strength; // 0xb8
	FRawDistributionFloat CollisionRadius; // 0xdc
	FRawDistributionFloat DragCoefficient; // 0x100
	FRawDistributionFloat DragRadius; // 0x124
	FVector UniversalOffset; // 0x148
	TArray<FAttractLocationBoneSocketInfo> SourceLocations; // 0x154
	FName SkelMeshActorParamName; // 0x164
};

struct UCombatAnimBlendByZoom : UAnimNodeBlendPerBone {
	ObjectProperty Owner; // 0x144
	float BlendTimeToZoom; // 0x14c
	float BlendTimeToNormal; // 0x150
	EZoomState LastZoomState; // 0x154
};

struct ACombatHUD : AHUD {
	UCombatGFxMoviePlayer* MovieClass; // 0x564
	ObjectProperty Movie; // 0x56c
	UCombatHUDSoundGroup* HUDSoundGroupClass; // 0x574
	ObjectProperty HUDSoundGroup; // 0x57c
	uint32_t bDrawPauser : 1; // 0x584
	uint32_t bTick : 1; // 0x584
	uint32_t bDebugAI : 1; // 0x584
	uint32_t bShowServerTime : 1; // 0x584
	FString ChangeListVersion; // 0x588
	ObjectProperty AudioChannelSystem; // 0x598
	TArray<FServerTimePositionInfoStruct> ServerTimePositionInfo; // 0x5a0
	int32_t ServerTimePosition; // 0x5b0
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x68
	uint32_t Scale : 1; // 0x8c
};

struct UUIDataStore_MenuItems : UUIDataStore_GameResource {
	FName CurrentGameSettingsTag; // 0xf0
	FMultiMap_Mirror OptionProviders; // 0xf8
	TArray<ObjectProperty> DynamicProviders; // 0x140
};

struct UAnimNode_MultiBlendPerBone : UAnimNodeBlendBase {
	ObjectProperty PawnOwner; // 0x100
	TArray<FPerBoneMaskInfo> MaskList; // 0x108
	EBlendType RotationBlendType; // 0x118
};

struct USeqAct_ParticleEventGenerator : USequenceAction {
	uint32_t bEnabled : 1; // 0x108
	uint32_t bUseEmitterLocation : 1; // 0x108
	ObjectProperty Instigator; // 0x10c
	TArray<FString> EventNames; // 0x114
	float EventTime; // 0x124
	FVector EventLocation; // 0x128
	FVector EventDirection; // 0x134
	FVector EventVelocity; // 0x140
	FVector EventNormal; // 0x14c
};

struct APortalTeleporter : ASceneCapturePortalActor {
	ObjectProperty SisterPortal; // 0x25c
	int32_t TextureResolutionX; // 0x264
	int32_t TextureResolutionY; // 0x268
	ObjectProperty MyMarker; // 0x26c
	uint32_t bMovablePortal : 1; // 0x274
	uint32_t bAlwaysTeleportNonPawns : 1; // 0x274
	uint32_t bCanTeleportVehicles : 1; // 0x274
};

struct ACombatAIGameRadarCore : ACombatRadarCore {
	UObject* BotClass; // 0x46c
};

struct UCombatHUD_Bombsite : UCombatHUD_GameObject {
	ObjectProperty BombsiteObject; // 0x1b0
};

struct USoundNodeConcatenator : USoundNode {
	TArray<float> InputVolume; // 0x74
};

struct UCombatDataTableRefTypeDefine : UCombatDataTableType {
	int32_t CodeID; // 0x6c
	char BUY_AFTER; // 0x70
	FString BUY_UC_FILE; // 0x74
	int32_t String_ID; // 0x84
	FString CODE_NAME; // 0x88
};

struct UCombatDataTableRefPingGroup : UCombatDataTableType {
	int32_t GroupID; // 0x6c
	int32_t PingUpper; // 0x70
};

struct UCombatFrontEnd_ChangePropernounPopup : UCombatFrontEnd_Object {
	char PopupMode; // 0xd0
	TArray<FSendTextInfo> SendTextList; // 0xd4
	FString SendText; // 0xe4
};

struct UCombatDataTableRefExtendPeriodBind : UCombatDataTableType {
	FString ItemCodeName; // 0x6c
	FString PeriodCode; // 0x7c
	int32_t TotalProb; // 0x8c
	int32_t Type; // 0x90
};

struct UNavMeshGoal_PolyEncompassesAI : UNavMeshPathGoalEvaluator {
	FVector OverrideExtentToCheck; // 0x7c
};

struct UCombatAnim_AimOffset : UAnimNodeAimOffset {
	ObjectProperty CombatPawnOwner; // 0x160
	uint32_t bOnlyUpdateIn360Aiming : 1; // 0x168
	uint32_t bTurnOffWhenReloadingWeapon : 1; // 0x168
	uint32_t bOnlyUpdateOnBecomeRelevant : 1; // 0x168
	uint32_t bDoingWeaponReloadInterp : 1; // 0x168
	float ReloadingBlendTime; // 0x16c
	float ReloadingBlendTimeToGo; // 0x170
	FVector2D LastAimOffset; // 0x174
	FVector2D LastPostProcessedAimOffset; // 0x17c
	float TurnAroundTimeToGo; // 0x184
	float TurnAroundBlendTime; // 0x188
};

struct USoundNodeWave : USoundNode {
	int32_t CompressionQuality; // 0x74
	uint32_t bForceRealTimeDecompression : 1; // 0x78
	uint32_t bLoopingSound : 1; // 0x78
	uint32_t bDynamicResource : 1; // 0x78
	uint32_t bUseTTS : 1; // 0x78
	uint32_t bProcedural : 1; // 0x78
	uint32_t bMature : 1; // 0x78
	uint32_t bManualWordWrap : 1; // 0x78
	uint32_t bSingleLine : 1; // 0x78
	ETTSSpeaker TTSSpeaker; // 0x7c
	EDecompressionType DecompressionType; // 0x7d
	EDetailMode MobileDetailMode; // 0x7e
	FString SpokenText; // 0x80
	float Volume; // 0x90
	float Pitch; // 0x94
	float Duration; // 0x98
	int32_t NumChannels; // 0x9c
	int32_t SampleRate; // 0xa0
	FUntypedBulkData_Mirror RawData; // 0xa4
	FPointer VorbisDecompressor; // 0xe4
	FPointer RawPCMData; // 0xec
	int32_t RawPCMDataSize; // 0xf4
	FUntypedBulkData_Mirror CompressedPCData; // 0xf8
	FUntypedBulkData_Mirror CompressedXbox360Data; // 0x138
	FUntypedBulkData_Mirror CompressedPS3Data; // 0x178
	FUntypedBulkData_Mirror CompressedWiiUData; // 0x1b8
	FUntypedBulkData_Mirror CompressedIPhoneData; // 0x1f8
	FUntypedBulkData_Mirror CompressedFlashData; // 0x238
	int32_t ResourceID; // 0x278
	int32_t ResourceSize; // 0x27c
	FPointer ResourceData; // 0x280
	TArray<FSubtitleCue> Subtitles; // 0x288
	TArray<FLocalizedSubtitle> LocalizedSubtitles; // 0x298
};

struct UUISoundTheme : UObject {
	TArray<FSoundEventMapping> SoundEventBindings; // 0x60
};

struct UCombatFlocking : UObject {
	float Apply_Distance; // 0x60
	float Cohesion_Force; // 0x64
	float Alignment_Force; // 0x68
	float Separation_Force; // 0x6c
	float Separation_MaxDistance; // 0x70
	float Avoidance_Force; // 0x74
	float Avoidance_MaxDistance; // 0x78
	float Target_Weight; // 0x7c
};

struct ACombatChampionshipObserverPC : ACombatPC {
	FWatchingPlayerData WatchingPlayerInfo; // 0xbe4
	uint32_t bShowObserverTeamColor : 1; // 0xbec
	ObjectProperty ChampionshipManager; // 0xbf0
};

struct UCombatSkelCtrl_CantileverBeam : USkelControlLookAt {
	FVector WorldSpaceGoal; // 0x16c
	FVector InitialWorldSpaceGoalOffset; // 0x178
	FVector Velocity; // 0x184
	float SpringStiffness; // 0x190
	float SpringDamping; // 0x194
	float PercentBeamVelocityTransfer; // 0x198
	DelegateProperty __EntireBeamVelocity__Delegate; // 0x19c
};

struct UAnimNodeAimOffset : UAnimNodeBlendBase {
	FVector2D Aim; // 0x100
	FVector2D AngleOffset; // 0x108
	uint32_t bForceAimDir : 1; // 0x110
	uint32_t bBakeFromAnimations : 1; // 0x110
	uint32_t bPassThroughWhenNotRendered : 1; // 0x110
	uint32_t bSynchronizeNodesInEditor : 1; // 0x110
	int32_t PassThroughAtOrAboveLOD; // 0x114
	EAnimAimDir ForcedAimDir; // 0x118
	TArray<char> RequiredBones; // 0x11c
	TArray<char> AimCpntIndexLUT; // 0x12c
	ObjectProperty TemplateNode; // 0x13c
	TArray<FAimOffsetProfile> Profiles; // 0x144
	int32_t CurrentProfileIndex; // 0x154
	FName RefPoseForBake; // 0x158
};

struct UCCSBTCombatChangeBTTree : UGripBTScriptBehavior {
	ObjectProperty bc; // 0xcc
	ObjectProperty NewBTTree; // 0xd4
};

struct UCombatAnimBlendByDamage : UAnimNodeBlendPerBone {
	ObjectProperty Owner; // 0x144
	float DamageAnimBlendOutTime; // 0x14c
	float DamageAnimBlendInTime; // 0x150
	float MinDamageAnimDuration; // 0x154
	float DamageAnimLength; // 0x158
	float ElapsedDamageAnimTime; // 0x15c
};

struct UTextureRenderTarget2D : UTextureRenderTarget {
	int32_t SizeX; // 0x124
	int32_t SizeY; // 0x128
	EPixelFormat Format; // 0x12c
	TextureAddress AddressX; // 0x12d
	TextureAddress AddressY; // 0x12e
	FLinearColor ClearColor; // 0x130
	uint32_t bForceLinearGamma : 1; // 0x140
};

struct UOnlineProfileSettings : UOnlinePlayerStorage {
	TArray<int32_t> ProfileSettingIds; // 0xa4
	TArray<FOnlineProfileSetting> DefaultSettings; // 0xb4
	TArray<FIdToStringMapping> OwnerMappings; // 0xc4
};

struct UCombatDataTableRefServiceRegion : UCombatDataTableType {
	int32_t Id; // 0x6c
	FString CodeName; // 0x70
	FString URL; // 0x80
	int32_t Port; // 0x90
	int32_t RegionNameID; // 0x94
};

struct ACombatRescuePC : ACombatPC {
	char SpawnAreaIndex; // 0xbe4
	uint32_t bIsRepair : 1; // 0xbe8
	uint32_t bIsReporting : 1; // 0xbe8
};

struct UAnimationCompressionAlgorithm_RemoveEverySecondKey : UAnimationCompressionAlgorithm {
	int32_t MinKeys; // 0x78
	uint32_t bStartAtSecondKey : 1; // 0x7c
};

struct UCombatDataTableRefAIRewardRank : UCombatDataTableType {
	FString ModeCodeName; // 0x6c
	char GRADE; // 0x7c
	int32_t Object_Min; // 0x80
	int32_t Object_Max; // 0x84
};

struct USeqEvent_MobileSwipe : USeqEvent_MobileRawInput {
	float Tolerance; // 0x13c
	float MinDistance; // 0x140
	FVector2D InitialTouch; // 0x144
	TArray<ObjectProperty> TouchedActors; // 0x14c
	float TraceDistance; // 0x15c
};

struct UUIDataStore : UUIDataProvider {
	FName Tag; // 0x70
	TArray<DelegateProperty> RefreshSubscriberNotifies; // 0x78
	DelegateProperty __OnDataStoreValueUpdated__Delegate; // 0x88
};

struct UCCSAFGetOutCover : UGripAFActionHandle {
	ObjectProperty CoverLink; // 0x64
	ObjectProperty Target; // 0x6c
};

struct UCombatDataTableRefClanMark : UCombatDataTableType {
	int32_t Idx; // 0x6c
	int32_t ClanTier; // 0x70
	int32_t NameString; // 0x74
};

struct UCombatHUD_IFFObject : UCombatHUDComponent_Base {
	ObjectProperty Container; // 0xbc
	ObjectProperty BombMC; // 0xc4
	ObjectProperty RadioMC; // 0xcc
	ObjectProperty KillerMC; // 0xd4
	ObjectProperty RankIconMC; // 0xdc
	ObjectProperty HPMC; // 0xe4
	ObjectProperty AggroMC; // 0xec
	ObjectProperty FriendlyNameMC; // 0xf4
	ObjectProperty EnemyNameMC; // 0xfc
	ObjectProperty FlashIconMC; // 0x104
	uint32_t bIsDisplayRadio : 1; // 0x10c
	uint32_t bIsDisplayKiller : 1; // 0x10c
	uint32_t bFlashIconVisible : 1; // 0x10c
	uint32_t bCurrentIFFEnemy : 1; // 0x10c
	FString LastRankIcon; // 0x110
	FString LastClanName; // 0x120
	FString LastClanColor; // 0x130
	int32_t LastRankIconImageID; // 0x140
	int32_t LastClanColorID; // 0x144
	float MinLocatorScale; // 0x148
	float MaxLocatorScale; // 0x14c
	float DistanceForMinScale; // 0x150
	float LocatorScale; // 0x154
	int32_t LastLocatorScale; // 0x158
	FIFFInfo CurrentIFFInfo; // 0x15c
	float IFFUpdateTime; // 0x1b8
};

struct UObject {
	FPointer VfTableObject; // 0x0
	FPointer HashNext; // 0x8
	FQWord ObjectFlags; // 0x10
	FPointer HashOuterNext; // 0x18
	FPointer StateFrame; // 0x20
	ObjectProperty Linker; // 0x28
	FPointer LinkerIndex; // 0x30
	int32_t ObjectInternalInteger; // 0x38
	int32_t NetIndex; // 0x3c
	ObjectProperty Outer; // 0x40
	FName Name; // 0x48
	UObject* Class; // 0x50
	ObjectProperty ObjectArchetype; // 0x58
};

struct UUIDataStore_InputAlias : UUIDataStore_StringBase {
	TArray<FUIDataStoreInputAlias> InputAliases; // 0x98
	TMap<None, None> InputAliasLookupMap; // 0xa8
};

struct ACombatRepairingArea : AActor {
	ComponentProperty Mesh; // 0x244
};

struct UCombatFrontEnd_Event_AttendanceCheckTab : UCombatFrontEnd_Event_TabBase {
	TArray<FRewardItemStruct> RewardItemList; // 0x6c
};

struct UMcpClashMobBase : UMcpServiceBase {
	FString McpClashMobClassName; // 0x78
	DelegateProperty __OnQueryChallengeListComplete__Delegate; // 0x88
	DelegateProperty __OnDownloadChallengeFileComplete__Delegate; // 0x98
	DelegateProperty __OnAcceptChallengeComplete__Delegate; // 0xa8
	DelegateProperty __OnQueryChallengeUserStatusComplete__Delegate; // 0xb8
	DelegateProperty __OnUpdateChallengeUserProgressComplete__Delegate; // 0xc8
	DelegateProperty __OnUpdateChallengeUserRewardComplete__Delegate; // 0xd8
};

struct ACBWeaponAttachment : AActor {
	ComponentProperty Mesh; // 0x244
	TArray<FMeshPart> MeshParts; // 0x24c
	ObjectProperty PhysicsAsset; // 0x25c
	float BoundsScaleForHolster; // 0x264
	float DefaultBoundsScale; // 0x268
	uint32_t bAlwaysShowTheHolster : 1; // 0x26c
	uint32_t UseGripIK : 1; // 0x26c
	uint32_t bExistLauncherGripSocket : 1; // 0x26c
	uint32_t bCalculateGripOffset : 1; // 0x26c
	uint32_t bInitWeaponMesh : 1; // 0x26c
	FName ExtraEffectSocket; // 0x270
	ComponentProperty MuzzleFlashPSC; // 0x278
	ObjectProperty MuzzleFlashPSCTemplate; // 0x280
	ObjectProperty MuzzleFlashPSCSilencerTemplate; // 0x288
	ComponentProperty ExtraPSC; // 0x290
	ObjectProperty ExtraPSCTemplate; // 0x298
	ObjectProperty TracerPSCTemplate; // 0x2a0
	ObjectProperty TracerPSCTemplate3rd; // 0x2a8
	UCombatExplosionLight* MuzzleFlashLightClass; // 0x2b0
	UCombatExplosionLight* MuzzleLowDetailFlashLightClass; // 0x2b8
	ComponentProperty MuzzleFlashLight; // 0x2c0
	float MuzzleFlashDuration; // 0x2c8
	FName AttachmentSocket; // 0x2cc
	FName AttachmentSocket_Inven; // 0x2d4
	ObjectProperty BulletWhip; // 0x2dc
	float BulletWhipRadius; // 0x2e4
	float BulletWhipAdditionalHeight; // 0x2e8
	float MaxImpactEffectDistance; // 0x2ec
	float MaxFireEffectDistance; // 0x2f0
	float MaxDecalRangeSq; // 0x2f4
	int32_t SpawnTracerPerNum; // 0x2f8
	int32_t SpawnTracerPerNumForFP; // 0x2fc
	FName WeapAimProfileName[0x2]; // 0x300
	ObjectProperty CustomAnim; // 0x310
	FString WeaponMasterAnimSet[0x2]; // 0x318
	FString WeaponSubAnimSet[0x2]; // 0x338
	FString AttachmentAnimSet[0x2]; // 0x358
	FName HandGripSocket[0x2]; // 0x378
	FName LauncherGripSocket[0x2]; // 0x388
	FString InvenAnimSeq; // 0x398
	float InvenAnimChances[0x3]; // 0x3a8
	WeapFireAnimType FireAnimType; // 0x3b4
	EGender HoldersGender; // 0x3b5
	char bPendingToLoadAsyncAnimSet; // 0x3b6
	TArray<FAnimNotifyObjectData> AnimNotifyData; // 0x3b8
	float CharacterAnimSetBlendTime; // 0x3c8
	float LastAnimSetBlendTime; // 0x3cc
	ComponentProperty PSC_ShellEject; // 0x3d0
	int32_t RecoilIndex; // 0x3d8
	TArray<FHideBoneDataByWeaponState> HideBoneDataByWeapState; // 0x3dc
	TArray<FName> CachedHideBoneData; // 0x3ec
	FName HolsterSocketName; // 0x3fc
	FName HolsterBoneName; // 0x404
	ObjectProperty OwnerWeapon; // 0x40c
	ObjectProperty IronSightTMNodeRear; // 0x414
	ObjectProperty IronSightTMNodeFront; // 0x41c
};

struct UMaterialInstance : UMaterialInterface {
	ObjectProperty PhysMaterial; // 0x214
	ObjectProperty Parent; // 0x21c
	ObjectProperty PhysMaterialMask; // 0x224
	int32_t PhysMaterialMaskUVChannel; // 0x22c
	ObjectProperty BlackPhysicalMaterial; // 0x230
	ObjectProperty WhitePhysicalMaterial; // 0x238
	uint32_t bHasStaticPermutationResource : 1; // 0x240
	uint32_t bStaticPermutationDirty : 1; // 0x240
	uint32_t ReentrantFlag : 1; // 0x240
	uint32_t bNeedsMaterialFlattening : 1; // 0x240
	FPointer StaticParameters[0x2]; // 0x244
	FPointer StaticPermutationResources[0x2]; // 0x254
	FPointer Resources[0x3]; // 0x264
	TArray<ObjectProperty> ReferencedTextures; // 0x27c
	FGuid ParentLightingGuid; // 0x28c
};

struct USeqAct_CastToFloat : USeqAct_SetSequenceVariable {
	int32_t Value; // 0x108
	float FloatResult; // 0x10c
};

struct UUIDataStore_GameState : UUIDataStore {
	DelegateProperty __OnRefreshDataFieldValue__Delegate; // 0x98
};

struct USeqAct_CombatTeamCert : USequenceAction {
	Team TeamIndex; // 0x108
	uint32_t IsAI : 1; // 0x10c
	uint32_t IgnoreTeam : 1; // 0x10c
	int32_t MaxCount; // 0x110
	int32_t CurrentCount; // 0x114
};

struct UParticleModulePhysicsVolumes : UParticleModuleWorldForcesBase {
	FRawDistributionFloat GlobalInfluence; // 0x68
	EParticleLevelInfluenceType LevelInfluenceType; // 0x8c
};

struct ALadder : ANavigationPoint {
	ObjectProperty MyLadder; // 0x33c
	ObjectProperty LadderList; // 0x344
};

struct AKActorFromStatic : AKActor {
	ObjectProperty MyStaticMeshActor; // 0x378
	float MaxImpulseSpeed; // 0x380
};

struct UCombatDataTableRefModeGuide : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t Type; // 0x80
	int32_t ModeNameText; // 0x84
	int32_t ModeHighlightText; // 0x88
	int32_t AttackTitleText; // 0x8c
	int32_t DefenseTitleText; // 0x90
	int32_t AttackDetailText; // 0x94
	int32_t DefenseDetailText; // 0x98
	FString ImageName; // 0x9c
	int32_t ImageID; // 0xac
	int32_t WeaponText[0x3]; // 0xb0
	FString ModeCodeName; // 0xbc
};

struct UCombatDataTableRefShopValue : UCombatDataTableType {
	int32_t Index; // 0x6c
	int32_t RentalID; // 0x70
	int32_t ValueType; // 0x74
	int32_t ValueRange[0x5]; // 0x78
	int32_t PriceType; // 0x8c
	int32_t ItemPrice[0x5]; // 0x90
	int32_t Mainprice; // 0xa4
	int32_t SalePrice[0x5]; // 0xa8
	int32_t AddPriceType; // 0xbc
	int32_t AddPrice[0x5]; // 0xc0
	FTimeData SellStart; // 0xd4
	FTimeData SellEnd; // 0xdc
	FString AddReplaceItem; // 0xe4
	FString MailFormCodename; // 0xf4
};

struct ACombatPawn : APawn {
	float CustomGravityScaling; // 0x558
	uint32_t bUseBotWeaponMovement : 1; // 0x55c
	uint32_t bAllowDiagonalLadderClimb : 1; // 0x55c
	uint32_t bCheckVelocityLotation : 1; // 0x55c
	uint32_t bInitSavedLocation : 1; // 0x55c
	uint32_t bRotationFollowsVelocity : 1; // 0x55c
	uint32_t bUpdateEyeheight : 1; // 0x55c
	uint32_t bApplyInstanceItem : 1; // 0x55c
	uint32_t PowerBullet_Buff : 1; // 0x55c
	uint32_t bIsBlockedByPawnCollision : 1; // 0x55c
	uint32_t bIsInvulnerable : 1; // 0x55c
	uint32_t bJustLanded : 1; // 0x55c
	uint32_t bLandRecovery : 1; // 0x55c
	uint32_t bCanDisplayIconInTacticalMap : 1; // 0x55c
	uint32_t bIgnorePitch : 1; // 0x55c
	uint32_t DoDeathAnimPhysBlend : 1; // 0x55c
	uint32_t bPlayDamageAnim : 1; // 0x55c
	uint32_t IsMoving : 1; // 0x55c
	uint32_t bIsLocalPawn : 1; // 0x55c
	uint32_t bIsCheatPawn : 1; // 0x55c
	uint32_t bCheckPhysWalkingLedges : 1; // 0x55c
	uint32_t bWeaponImpactAttenuate : 1; // 0x55c
	uint32_t bSaveSkill : 1; // 0x55c
	uint32_t bLeftFootDown : 1; // 0x55c
	uint32_t bRespawnAction : 1; // 0x55c
	uint32_t IgnoreKillZ : 1; // 0x55c
	uint32_t DeathCertificate : 1; // 0x55c
	uint32_t WasCrouchedOnDeath : 1; // 0x55c
	uint32_t bStuckHandsOnDeath : 1; // 0x55c
	uint32_t bPotentialWallSmash : 1; // 0x55c
	uint32_t bFinishedPrePlayDyingCheck : 1; // 0x55c
	uint32_t IgnoreAimoffset : 1; // 0x55c
	uint32_t UpdateHandGripPos : 1; // 0x55c
	uint32_t bDirtyWeaponAmmo : 1; // 0x560
	uint32_t bGodMode : 1; // 0x560
	uint32_t bProcessFellOutOfWorld : 1; // 0x560
	uint32_t OnParachute : 1; // 0x560
	uint32_t bNeedToUpdateSkelpose : 1; // 0x560
	uint32_t bAIIgnoreAimDir : 1; // 0x560
	uint32_t bIgnoreDamagedDecelerationRatio : 1; // 0x560
	uint32_t bCanStaminaRecover : 1; // 0x560
	uint32_t bBlockCrouch : 1; // 0x560
	uint32_t bSetForceSpamGrade : 1; // 0x560
	uint32_t bOnFlashInability : 1; // 0x560
	ObjectProperty CachedPRI; // 0x564
	FVector DyingLocation; // 0x56c
	float FlyingAirSpeed; // 0x578
	ELadderClimbType LadderClimbType; // 0x57c
	EPawnBuffState PawnBuffState; // 0x57d
	char AccessoryEnableSlot[0x6]; // 0x57e
	EIFFDisplayType IFFDisplayType; // 0x584
	char RecoilCount; // 0x585
	EVelocityState VelocityState; // 0x586
	ERotationStep RotationYaw; // 0x587
	EHand IKHand; // 0x588
	char CombatPawnTeamNum; // 0x589
	char PenetrateBeforeHit; // 0x58a
	char CrouchSpamGrade; // 0x58b
	float LadderStrafingSpeed; // 0x58c
	float StrafeAllowDegreeOnLadder; // 0x590
	float StrafeAllowValueOnLadder; // 0x594
	float AttachingDegreeOnLadder; // 0x598
	float AttachingValueOnLadder; // 0x59c
	float AllowedClimbUpDegreeOnLadder; // 0x5a0
	float AllowedClimbUpValueOnLadder; // 0x5a4
	float AllowedClimbDownDegreeOnLadder; // 0x5a8
	float AllowedClimbDownValueOnLadder; // 0x5ac
	float VelocityReduceRatioForLanding; // 0x5b0
	float VelocityReduceRatioOnWalkingJump; // 0x5b4
	ObjectProperty DialogObj; // 0x5b8
	FVector PrevLocation; // 0x5c0
	FCBTakeHitInfo LastTakeHitInfo; // 0x5cc
	FCBTakeHitInfo LastTakeHitInfoByLocalPlayer; // 0x614
	FVector MeshTranslationOffset; // 0x65c
	FVector2D MeshTranslationIntegralOffset; // 0x668
	FVector FixedMeshTranslationOffset; // 0x670
	float CrouchTranslationOffset; // 0x67c
	float CrouchStartTime; // 0x680
	float CrouchLength; // 0x684
	float MeshTranslationKpAmt; // 0x688
	float MeshTranslationKiAmt; // 0x68c
	float MeshTranslationFallingSpeed; // 0x690
	float MeshTranslationZSpeed; // 0x694
	FVector CombatSavedLocation; // 0x698
	float OldZ; // 0x6a4
	float TossWeaponSpeed; // 0x6a8
	float TossSwappedWeaponSpeed; // 0x6ac
	ObjectProperty RootRotControl; // 0x6b0
	ObjectProperty AimNode; // 0x6b8
	ObjectProperty CrouchNode; // 0x6c0
	TArray<ObjectProperty> RecoilNodes; // 0x6c8
	ObjectProperty LookAtCtrl; // 0x6d8
	ObjectProperty MyCombatWeapon; // 0x6e0
	TArray<ObjectProperty> PassiveWeaponList; // 0x6e8
	TArray<ObjectProperty> MyGrenadeWeapon; // 0x6f8
	TArray<ObjectProperty> MyPrimaryWeapon; // 0x708
	float SlopeBoostFriction; // 0x718
	FVector2D CurrentSkelAim; // 0x71c
	float BackwardSpeedPct; // 0x724
	float StandardGroundSpeed; // 0x728
	float AddMainAmmo_Buff; // 0x72c
	float AddSubAmmo_Buff; // 0x730
	float AddMainMagazineAmmo_Buff; // 0x734
	float AddSubMagazineAmmo_Buff; // 0x738
	float MaxMainMagazineAmmo_Buff; // 0x73c
	float MaxSubMagazineAmmo_Buff; // 0x740
	float ReloadingRate_Buff; // 0x744
	float WeaponChangeRate_Buff; // 0x748
	float MaxHealthRate_Buff; // 0x74c
	float HealthCureRate_Buff; // 0x750
	float MaxAutoCureHealthModifier_Buff; // 0x754
	float GroundCrouchSpeedRate_Buff; // 0x758
	float GroundAccelationRate_Buff; // 0x75c
	float GroundRunSpeedRate_Buff; // 0x760
	float GroundWalkingSpeedRate_Buff; // 0x764
	float DetailedRadarDistance_Buff; // 0x768
	float RadarRange_Buff; // 0x76c
	float GunAttackRate_Buff; // 0x770
	float GunGuardRate_Buff; // 0x774
	float MeleeAttackRate_Buff; // 0x778
	float MeleeGuardRate_Buff; // 0x77c
	float ExplosiveAttackRate_Buff; // 0x780
	float ExplosiveGuardRate_Buff; // 0x784
	int32_t AddGrenade_Buff; // 0x788
	float InstanceItem_GroundCrouchSpeedRate_Buff; // 0x78c
	float InstanceItem_GroundAccelationRate_Buff; // 0x790
	float InstanceItem_GroundRunSpeedRate_Buff; // 0x794
	float InstanceItem_GroundWalkingSpeedRate_Buff; // 0x798
	FArmorPointStruct AP_Buff[0x12]; // 0x79c
	int32_t APForExplosion_Buff; // 0xa6c
	float ShortenRespawnDelay_Buff; // 0xa70
	float DamagedAccelerationRatio_Buff; // 0xa74
	float GunAttackRateForAI; // 0xa78
	float MeleeAttackRateForAI; // 0xa7c
	float GrenadeAttackRateForAI; // 0xa80
	int32_t IgnoreCheckExpose; // 0xa84
	float RepFootStepSoundMultiplier; // 0xa88
	UCBPawnSoundGroup* SoundGroupClass; // 0xa8c
	UCBFamilyInfo* CurrCharClassInfo; // 0xa94
	UCombatInstanceItem_ArmorBase* CurrInstanceItemClassInfo; // 0xa9c
	ComponentProperty Left_Armor; // 0xaa4
	ComponentProperty Right_Armor; // 0xaac
	UCombatAccessory_Base* AccessoryClassInfo[0x6]; // 0xab4
	ComponentProperty AccessorySkeletalMeshComp[0x6]; // 0xae4
	float DefaultMeshScale; // 0xb14
	FName FamiliInfoType; // 0xb18
	UCombatVoiceBase* RadioVoiceClass; // 0xb20
	ComponentProperty LightEnvironment; // 0xb28
	float Bob; // 0xb30
	float Bob_Y; // 0xb34
	float Bob_Y_Freq; // 0xb38
	float BobSeperationFactor; // 0xb3c
	float AppliedBob; // 0xb40
	float bobtime; // 0xb44
	FVector WalkBob; // 0xb48
	float CameraScale; // 0xb54
	float CurrentCameraScale; // 0xb58
	float CameraScaleMin; // 0xb5c
	float CameraScaleMax; // 0xb60
	float CameraZOffset; // 0xb64
	ObjectProperty FullBodyAnimSlot; // 0xb68
	ObjectProperty TopHalfAnimSlot; // 0xb70
	ObjectProperty TopHalfParentNode; // 0xb78
	ObjectProperty PhysAssetForDeath; // 0xb80
	FVector CamOffset; // 0xb88
	float HeroCameraScale; // 0xb94
	int32_t HeroCameraPitch; // 0xb98
	int32_t HealthGaugeStep; // 0xb9c
	TArray<FCameraShakeRotationFactor> CameraShake_DecreaseByDepense; // 0xba0
	TArray<int32_t> HitRangeForCameraShake; // 0xbb0
	FCameraShakeRotationFactor CameraShakeMinRange; // 0xbc0
	FCameraShakeRotationFactor CameraShakeMaxRange; // 0xbc8
	float CameraShakeSpeed; // 0xbd0
	float CameraShakeRecoverSpeed; // 0xbd4
	float CameraShakeRandom; // 0xbd8
	FRotator CameraShakeOffset; // 0xbdc
	FRotator AutoCorrectCameraShakeOffset; // 0xbe8
	FRotator DeltaCameraShake; // 0xbf4
	float MaxFootstepDistSq; // 0xc00
	float MaxJumpSoundDistSq; // 0xc04
	float NoLandedSoundVelZSize; // 0xc08
	float MaxDistForBloodSplatter; // 0xc0c
	float CrounchEyeHeight; // 0xc10
	float DeathRagdollTime; // 0xc14
	FVectorWithFlag CompressedLastImpactLocation; // 0xc18
	ObjectProperty TurnInPlaceNode; // 0xc28
	float ViewTargetRotationInterpolationSpeed; // 0xc30
	int32_t InterpolatedRemoteViewPitch; // 0xc34
	float YawInterpolationSpeed; // 0xc38
	int32_t InterpolatedYaw; // 0xc3c
	float EyeHeightInterpolationSpeed; // 0xc40
	float InterpolatedEyeHeight; // 0xc44
	float AimAssistDamageMultiplier; // 0xc48
	float MeleeAssistDamageMultiplier; // 0xc4c
	float LastAimRotationTime; // 0xc50
	FRotator LastAimRotation; // 0xc54
	FVectorWithFlag VelocityWithIsMoving; // 0xc60
	float VelocityMutiplyRatioToCollideOtherPawn; // 0xc70
	float SlideFriction; // 0xc74
	ComponentProperty WeaponImpactUndampedSound; // 0xc78
	ComponentProperty WeaponImpactUndampedVoice; // 0xc80
	float PhysicCorpses; // 0xc88
	float SpawnProtectionAmbientCycleTime; // 0xc8c
	FLinearColor SpawnProtectionAmbientGlow; // 0xc90
	ComponentProperty GetterPickupEffectComp; // 0xca0
	ComponentProperty PawnCollision; // 0xca8
	ObjectProperty ActiveTimeDilationAnim; // 0xcb0
	TArray<ObjectProperty> DyingExplosionActorsForTimeDilation; // 0xcb8
	int32_t ViewTargetRotation; // 0xcc8
	ObjectProperty CBInvManager; // 0xccc
	ComponentProperty ShadowDecal; // 0xcd4
	float BelowFeetCheckDistance; // 0xcdc
	float BelowFeetCheckDistanceSq; // 0xce0
	FPhysMaterialBelowFeet LastPhysMatBelowFeet; // 0xce4
	FName FootDownBoneName[0x2]; // 0xcf8
	FVector FootExtent; // 0xd08
	float CurrentTerminalVelocity; // 0xd14
	float LeftDeathAnimTime; // 0xd18
	float ReachedGoalSplineTime; // 0xd1c
	ObjectProperty IFFObject; // 0xd20
	int32_t LocalHitBodyIndex; // 0xd28
	FVector LocalHitDir; // 0xd2c
	FName LastHitBone; // 0xd38
	float WallSmashMod; // 0xd40
	float MomentumEff; // 0xd44
	FVector OnDeathVelocity; // 0xd48
	float RagdollPushEff; // 0xd54
	FName RagdollPushBone; // 0xd58
	float RagdollUpKick; // 0xd60
	float NoRagdollVelocity; // 0xd64
	float WallSmashDist; // 0xd68
	float RagdollTraceStartOffset; // 0xd6c
	ObjectProperty HandGripIKNode[0x2]; // 0xd70
	float BanzaiImpulse; // 0xd80
	int32_t WallCheckSpreadYaw; // 0xd84
	float RollBob; // 0xd88
	FArmorPointStruct AmmorPoint[0x12]; // 0xd8c
	int32_t AmmorPointForExplosion; // 0x105c
	int32_t AmmorItemGrade; // 0x1060
	TArray<FImpulseData> PhysBodyImpulseMap; // 0x1064
	FVector StoredHandGrip; // 0x1074
	float fReplicatedCustomTimeD; // 0x1080
	int32_t CriticalDamagePitch; // 0x1084
	float LastApplyFamilyInfoTime; // 0x1088
	ObjectProperty ChaFXUpperItem; // 0x108c
	ObjectProperty ChaFXFootItem; // 0x1094
	ObjectProperty TrophySkillObject; // 0x109c
	ObjectProperty SentryGunSkillObject; // 0x10a4
	float AdditionalDamagedDecelerationRatio; // 0x10ac
	float MaxDamagedDecelerationRatio; // 0x10b0
	TArray<FCrouchSpamValue> CrouchValue; // 0x10b4
	float CrouchStamina; // 0x10c4
	float CrouchStaminaMax; // 0x10c8
	float CrouchStaminaRecoverForSec; // 0x10cc
	float CrouchStaminaUseValue; // 0x10d0
	float CrouchStaminaHoldTime; // 0x10d4
	float CrouchSpamGradeZeroRange; // 0x10d8
	float CrouchSpamGradeOneRange; // 0x10dc
	float CrouchSpamGradeTwoRange; // 0x10e0
	float CrouchSpamGradeThreeRange; // 0x10e4
	int32_t ForceSpamGradeLevel; // 0x10e8
	FFlashEffectRepStruct FlashEffectInfo; // 0x10ec
	FFlashEffectRepStruct CurrentFlashEffectInfo; // 0x10f4
	float FlashEffectSyncDeltaTime; // 0x10fc
	float FlashEffectSyncDelay; // 0x1100
	float FlashEffectMaxTime; // 0x1104
	float FlashEffectStartTime; // 0x1108
	DelegateProperty __OnDetachDroppedWeapon__Delegate; // 0x110c
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct AGameCrowdAgentSkeletal : AGameCrowdAgent {
	ComponentProperty SkeletalMeshComponent; // 0x4c4
	ObjectProperty SpeedBlendNode; // 0x4cc
	ObjectProperty FullBodySlot; // 0x4d4
	ObjectProperty ActionSeqNode; // 0x4dc
	ObjectProperty WalkSeqNode; // 0x4e4
	ObjectProperty RunSeqNode; // 0x4ec
	ObjectProperty AgentTree; // 0x4f4
	TArray<FName> WalkAnimNames; // 0x4fc
	TArray<FName> RunAnimNames; // 0x50c
	TArray<FName> IdleAnimNames; // 0x51c
	TArray<FName> DeathAnimNames; // 0x52c
	float SpeedBlendStart; // 0x53c
	float SpeedBlendEnd; // 0x540
	float AnimVelRate; // 0x544
	float MaxSpeedBlendChangeSpeed; // 0x548
	FName MoveSyncGroupName; // 0x54c
	TArray<FGameCrowdAttachmentList> Attachments; // 0x554
	float MaxTargetAcquireTime; // 0x564
	uint32_t bUseRootMotionVelocity : 1; // 0x568
	uint32_t bAllowSkeletonUpdateChangeBasedOnTickResult : 1; // 0x568
	uint32_t bTickWhenNotVisible : 1; // 0x568
	uint32_t bIsPlayingIdleAnimation : 1; // 0x568
	uint32_t bIsPlayingDeathAnimation : 1; // 0x568
	uint32_t bIsPlayingImportantAnimation : 1; // 0x568
	uint32_t bAnimateThisTick : 1; // 0x568
	float NotVisibleDisableTickTime; // 0x56c
	float MaxAnimationDistance; // 0x570
	float MaxAnimationDistanceSq; // 0x574
};

struct ACombatWavePawnBase : ACombatGuy_NPC {
	FPointer VfTable_Iinterface_WavePawn; // 0x11f0
	FWavePawnData WavePawnData; // 0x11f8
};

struct UExponentialHeightFogComponent : UActorComponent {
	uint32_t bEnabled : 1; // 0x88
	uint32_t Low : 1; // 0x88
	uint32_t Medium : 1; // 0x88
	uint32_t High : 1; // 0x88
	float FogHeight; // 0x8c
	float FogDensity; // 0x90
	float FogHeightFalloff; // 0x94
	float FogMaxOpacity; // 0x98
	float StartDistance; // 0x9c
	float LightTerminatorAngle; // 0xa0
	float OppositeLightBrightness; // 0xa4
	FColor OppositeLightColor; // 0xa8
	float LightInscatteringBrightness; // 0xac
	FColor LightInscatteringColor; // 0xb0
	EDetailMode DetailMode; // 0xb4
};

struct UMaterialExpressionTextureSampleParameterNormal : UMaterialExpressionTextureSampleParameter {
	FPointer InstanceOverride; // 0x140
};

struct UCombatDataTableRefSeasonInfo : UCombatDataTableType {
	FString Category; // 0x6c
	int32_t Season; // 0x7c
	FTimeData StartTime; // 0x80
	FTimeData EndTime; // 0x88
};

struct UGameCrowd_ListOfAgents : UObject {
	TArray<FAgentArchetypeInfo> ListOfAgents; // 0x60
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x74
	float PitchMax; // 0x78
	float VolumeMin; // 0x7c
	float VolumeMax; // 0x80
	FRawDistributionFloat PitchModulation; // 0x84
	FRawDistributionFloat VolumeModulation; // 0xa8
};

struct USeqVar_String : USequenceVariable {
	FString StrValue; // 0xa0
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat StartRotation; // 0x68
};

struct UCombatDataTableRefModeTip : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	FString Reference; // 0x80
	int32_t StringID_MIN; // 0x90
	int32_t StringID_MAX; // 0x94
};

struct UCombatDataTableRefItemOptionBind : UCombatDataTableType {
	FString OPTypeCode; // 0x6c
	int32_t OptionType; // 0x7c
	int32_t ValueMin; // 0x80
	int32_t ValueMax; // 0x84
	int32_t RandomValue; // 0x88
	int32_t SpecialValue1; // 0x8c
	int32_t SpecialValue2; // 0x90
	int32_t StringID; // 0x94
	FString UIIcon; // 0x98
};

struct UMobileMenuElement : UObject {
	FVector2D VpPos; // 0x60
	FVector2D VpSize; // 0x68
	uint32_t bIsVisible : 1; // 0x70
	uint32_t bIsActive : 1; // 0x70
};

struct UCombatHUDEntity_Base : UCombatHUD_Base {
	EActivateType LastActivateType; // 0xbc
};

struct UGripActionFramework : UObject {
	FPointer NativeFramework; // 0x60
};

struct USoundNodeWaveStreaming : USoundNodeWave {
	TArray<char> QueuedAudio; // 0x2a8
	float InactiveDuration; // 0x2b8
};

struct UCombatRadioSystem : UObject {
	TArray<FKeyBindingInfo> RadioKeyBindings; // 0x60
	uint32_t bIsBlockingRadioKey : 1; // 0x70
	uint32_t bIsRadioKeyBinding : 1; // 0x70
	uint32_t bSelectingSuccess : 1; // 0x70
	int32_t RadioKeyBlockTime; // 0x74
	int32_t AutoHideTime; // 0x78
	ObjectProperty UIObject; // 0x7c
	ObjectProperty MarkerMenuUIObject; // 0x84
	ObjectProperty OwnerPC; // 0x8c
	RadioKeyType LastSelectTabIndex; // 0x94
};

struct UCombatHUD_CTFPointArea : UCombatHUD_GameObject {
	ObjectProperty AreaVolume; // 0x1b0
	ObjectProperty flag; // 0x1b8
	int32_t TargetIndex; // 0x1c0
	uint32_t IsArea : 1; // 0x1c4
};

struct ACombatWaitingServer : ACombatGameFrame {
	int32_t InitializeDelayTime; // 0x4c0
};

struct UCombatDataTableRefItemOption : UCombatDataTableType {
	FString OPCode; // 0x6c
	int32_t OPSlot; // 0x7c
	FString OPTypeCode; // 0x80
	int32_t OPTP; // 0x90
	FString OPItemCode; // 0x94
	int32_t OPItemCount; // 0xa4
	int32_t OPRetryType; // 0xa8
	int32_t OPRetryValue; // 0xac
	int32_t OPRetryValue2; // 0xb0
};

struct USeqAct_PlayMusicTrack : USequenceAction {
	FMusicTrackStruct MusicTrack; // 0x108
};

struct USeqAct_SetVelocity : USequenceAction {
	FVector VelocityDir; // 0x108
	float VelocityMag; // 0x114
	uint32_t bVelocityRelativeToActorRotation : 1; // 0x118
};

struct UGameCrowdBehavior_WaitInQueue : UGameCrowdAgentBehavior {
	uint32_t bStoppingBehavior : 1; // 0x9c
	ObjectProperty QueuePosition; // 0xa0
};

struct UGameplayEventsReader : UGameplayEvents {
	TArray<ObjectProperty> RegisteredHandlers; // 0x1c0
};

struct APylon : ANavigationPoint {
	FPointer VfTable_IEditorLinkSelectionInterface; // 0x33c
	FPointer VfTable_IInterface_NavigationHandle; // 0x344
	FPointer NavMeshPtr; // 0x34c
	FPointer ObstacleMesh; // 0x354
	FPointer DynamicObstacleMesh; // 0x35c
	FPointer WorkingSetPtr; // 0x364
	FPointer PathObjectsThatAffectThisPylon; // 0x36c
	TArray<FVector> NextPassSeedList; // 0x374
	FOctreeElementId OctreeId; // 0x384
	FPointer OctreeIWasAddedTo; // 0x390
	ObjectProperty NextPylon; // 0x398
	TArray<ObjectProperty> ExpansionVolumes; // 0x3a0
	float ExpansionRadius; // 0x3b0
	float MaxExpansionRadius; // 0x3b4
	ComponentProperty PylonRadiusPreview; // 0x3b8
	uint32_t bImportedMesh : 1; // 0x3c0
	uint32_t bUseExpansionSphereOverride : 1; // 0x3c0
	uint32_t bNeedsCostCheck : 1; // 0x3c0
	uint32_t bPylonInHighLevelPath : 1; // 0x3c0
	uint32_t bUseRecast : 1; // 0x3c0
	uint32_t bAllowRecastGenerator : 1; // 0x3c0
	uint32_t bDrawEdgePolys : 1; // 0x3c0
	uint32_t bDrawPolyBounds : 1; // 0x3c0
	uint32_t bRenderInShowPaths : 1; // 0x3c0
	uint32_t bDrawWalkableSurface : 1; // 0x3c0
	uint32_t bDrawObstacleSurface : 1; // 0x3c0
	uint32_t bSolidObstaclesInGame : 1; // 0x3c0
	uint32_t bBuildThisPylon : 1; // 0x3c0
	uint32_t bDisabled : 1; // 0x3c0
	uint32_t bForceObstacleMeshCollision : 1; // 0x3c0
	FVector ExpansionSphereCenter; // 0x3c4
	ComponentProperty RenderingComp; // 0x3d0
	ComponentProperty BrokenSprite; // 0x3d8
	TArray<ObjectProperty> ImposterPylons; // 0x3e0
	TArray<ObjectProperty> OnBuild_DisableCollisionForThese; // 0x3f0
	TArray<ObjectProperty> OnBuild_EnableCollisionForThese; // 0x400
	float MaxPolyHeight_Optional; // 0x410
	char NavMeshGenerator; // 0x414
	TArray<FKAggregateGeom> VoxelFilterBounds; // 0x418
	TArray<FMatrix> VoxelFilterTM; // 0x428
	int32_t DebugEdgeCount; // 0x438
	FVector DebugPathExtent; // 0x43c
	FVector DebugPathStartLocation; // 0x448
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0xb0
	FExpressionInput Height; // 0xe4
	FExpressionInput HeightRatioInput; // 0x118
	float HeightRatio; // 0x14c
	float ReferencePlane; // 0x150
};

struct UParticleModuleSpawn : UParticleModuleSpawnBase {
	FRawDistributionFloat Rate; // 0x6c
	FRawDistributionFloat RateScale; // 0x90
	EParticleBurstMethod ParticleBurstMethod; // 0xb4
	TArray<FParticleBurst> BurstList; // 0xb8
};

struct USeqEvent_Console : USequenceEvent {
	FName ConsoleEventName; // 0x128
	FString EventDesc; // 0x130
};

struct ACombatWeapon_Supplies : ACombatWeapon_Skill_Weapon {
	UCombatSkill_Supplies* SuppliesSKillClass; // 0x1ee8
	EDroppedSuppliesType DropType; // 0x1ef0
};

struct UPathConstraint : UObject {
	int32_t CacheIdx; // 0x60
	ObjectProperty NextConstraint; // 0x64
};

struct UTexture2D : UTexture {
	FIndirectArray_Mirror Mips; // 0x11c
	FIndirectArray_Mirror CachedPVRTCMips; // 0x12c
	FIndirectArray_Mirror CachedATITCMips; // 0x13c
	int32_t CachedFlashMipsMaxResolution; // 0x14c
	FUntypedBulkData_Mirror CachedFlashMips; // 0x150
	int32_t SizeX; // 0x190
	int32_t SizeY; // 0x194
	int32_t OriginalSizeX; // 0x198
	int32_t OriginalSizeY; // 0x19c
	EPixelFormat Format; // 0x1a0
	TextureAddress AddressX; // 0x1a1
	TextureAddress AddressY; // 0x1a2
	uint32_t bIsStreamable : 1; // 0x1a4
	uint32_t bHasCancelationPending : 1; // 0x1a4
	uint32_t bHasBeenLoadedFromPersistentArchive : 1; // 0x1a4
	uint32_t bForceMiplevelsToBeResident : 1; // 0x1a4
	uint32_t bGlobalForceMipLevelsToBeResident : 1; // 0x1a4
	uint32_t bIsCompositingSource : 1; // 0x1a4
	uint32_t bHasBeenPaintedInEditor : 1; // 0x1a4
	float ForceMipLevelsToBeResidentTimestamp; // 0x1a8
	FName TextureFileCacheName; // 0x1ac
	FGuid TextureFileCacheGuid; // 0x1b4
	int32_t RequestedMips; // 0x1c4
	int32_t ResidentMips; // 0x1c8
	int32_t MipsToRemoveOnCompress; // 0x1cc
	FThreadSafeCounter PendingMipChangeRequestStatus; // 0x1d0
	TArray<char> SystemMemoryData; // 0x1d4
	FTextureLinkedListMirror StreamableTexturesLink; // 0x1e4
	int32_t StreamingIndex; // 0x1fc
	int32_t MipTailBaseIdx; // 0x200
	FPointer ResourceMem; // 0x204
	int32_t FirstResourceMemMip; // 0x20c
	float Timer; // 0x210
};

struct AUIDisplayPoint : AActor {
	FString NameText; // 0x244
};

struct UTitleFileDownloadCache : UMCPBase {
	TArray<FTitleFileCacheEntry> TitleFiles; // 0x80
	TArray<DelegateProperty> LoadCompleteDelegates; // 0x90
	TArray<DelegateProperty> SaveCompleteDelegates; // 0xa0
	DelegateProperty __OnLoadTitleFileComplete__Delegate; // 0xb0
	DelegateProperty __OnSaveTitleFileComplete__Delegate; // 0xc0
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct USeqAct_LevelVisibility : USeqAct_Latent {
	ObjectProperty Level; // 0x120
	FName LevelName; // 0x128
	uint32_t bStatusIsOk : 1; // 0x130
};

struct UGripActionNode_Crouch : UCombatAIActionNodeBase {
	uint32_t SavedCanCrouch : 1; // 0xf4
};

struct USVehicleSimBase : UActorComponent {
	float WheelSuspensionStiffness; // 0x88
	float WheelSuspensionDamping; // 0x8c
	float WheelSuspensionBias; // 0x90
	float WheelLongExtremumSlip; // 0x94
	float WheelLongExtremumValue; // 0x98
	float WheelLongAsymptoteSlip; // 0x9c
	float WheelLongAsymptoteValue; // 0xa0
	float WheelLatExtremumSlip; // 0xa4
	float WheelLatExtremumValue; // 0xa8
	float WheelLatAsymptoteSlip; // 0xac
	float WheelLatAsymptoteValue; // 0xb0
	float WheelInertia; // 0xb4
	uint32_t bWheelSpeedOverride : 1; // 0xb8
	uint32_t bClampedFrictionModel : 1; // 0xb8
	uint32_t bAutoDrive : 1; // 0xb8
	float AutoDriveSteer; // 0xbc
};

struct USeqAct_CombatTutorial_HideBombIconsOnHUD : USequenceAction {
	uint32_t HideBombs : 1; // 0x108
	uint32_t HideBombSites : 1; // 0x108
};

struct AGamePlayerController : APlayerController {
	uint32_t bWarnCrowdMembers : 1; // 0x740
	uint32_t bDebugCrowdAwareness : 1; // 0x740
	uint32_t bIsWarmupPaused : 1; // 0x740
	float AgentAwareRadius; // 0x744
	FName CurrentSoundMode; // 0x748
};

struct UCombatHUD_Aim : UCombatHUDEntity_Base {
	ObjectProperty HitMarkMC; // 0xc0
	ObjectProperty BasicCrosshair_TopMC; // 0xc8
	ObjectProperty BasicCrosshair_LeftMC; // 0xd0
	ObjectProperty BasicCrosshair_BottomMC; // 0xd8
	ObjectProperty BasicCrosshair_RightMC; // 0xe0
	ObjectProperty BasicCrosshair_Dot; // 0xe8
	ObjectProperty BasicCrosshair_Circle; // 0xf0
	ObjectProperty GLCrosshairMC; // 0xf8
	ObjectProperty RLCrosshairMC; // 0x100
	int32_t LastCrosshairType; // 0x108
	int32_t LastCrosshairRadius; // 0x10c
	int32_t LastCrosshairLengthRate; // 0x110
	uint32_t bIsDisplayed_Basic : 1; // 0x114
	uint32_t bIsDisplayed_Dot : 1; // 0x114
	uint32_t bIsDisplayed_Circle : 1; // 0x114
	uint32_t bIsDisplayed_GL : 1; // 0x114
	uint32_t bIsDisplayed_RL : 1; // 0x114
	uint32_t bIsReloadingDisplayed : 1; // 0x114
	uint32_t bIsLaserSightDisplayed : 1; // 0x114
	uint32_t JustInitiated : 1; // 0x114
	FBasicCrosshairSetting BasicCHSetting; // 0x118
};

struct ULightFunction : UObject {
	ObjectProperty SourceMaterial; // 0x60
	FVector Scale; // 0x68
	float DisabledBrightness; // 0x74
};

struct UCombatAnimBlend_SimpleJump : UCombatAnimBlendBase {
	ObjectProperty OwnerPawn; // 0x144
};

struct UParticleModuleCollisionActor : UParticleModuleCollision {
	TArray<FName> ActorsToCollideWith; // 0x140
	uint32_t bCheckPawnCollisions : 1; // 0x150
};

struct USeqAct_MissionEvent : USeqAct_GameInfo {
	FName EventName; // 0x118
	uint32_t bValidMatchInProgress : 1; // 0x120
	float fReservedProperty; // 0x124
	int32_t iReservedProperty; // 0x128
};

struct ULineBatchComponent : UPrimitiveComponent {
	FPointer FPrimitiveDrawInterfaceVfTable; // 0x250
	FPointer FPrimitiveDrawInterfaceView; // 0x258
	TArray<FPointer> BatchedLines; // 0x260
	TArray<FPointer> BatchedPoints; // 0x270
	float DefaultLifeTime; // 0x280
};

struct USeqAct_PlayCameraAnim : USequenceAction {
	ObjectProperty CameraAnim; // 0x108
	uint32_t bLoop : 1; // 0x110
	uint32_t bRandomStartTime : 1; // 0x110
	float BlendInTime; // 0x114
	float BlendOutTime; // 0x118
	float Rate; // 0x11c
	float IntensityScale; // 0x120
	ECameraAnimPlaySpace PlaySpace; // 0x124
	ObjectProperty UserDefinedSpaceActor; // 0x128
};

struct UWebResponse : UObject {
	TArray<FString> Headers; // 0x60
	FMap_Mirror ReplacementMap; // 0x70
	FString IncludePath; // 0xb8
	FString CharSet; // 0xc8
	ObjectProperty Connection; // 0xd8
	uint32_t bSentText : 1; // 0xe0
	uint32_t bSentResponse : 1; // 0xe0
};

struct UCombatDataTableRefPenaltyBind : UCombatDataTableType {
	FString Penalty; // 0x6c
	FString ModeGroup; // 0x7c
};

struct UMaterialExpressionConstantClamp : UMaterialExpression {
	FExpressionInput Input; // 0xb0
	float Min; // 0xe4
	float Max; // 0xe8
};

struct UMantleReachSpec : UForcedReachSpec {
	uint32_t bClimbUp : 1; // 0xc8
};

struct USeqAct_CombatTutorial_PointAI : USequenceAction {
	ObjectProperty AIPawn; // 0x108
};

struct UCombatRewardDataBase : UObject {
	ObjectProperty Owner; // 0x60
	TArray<FRelatedKillDataInfo> RelatedKillData; // 0x68
	TMap<None, None> RecordData; // 0x78
	TArray<int32_t> KillMarkHistory; // 0xc0
	TArray<FTableInfoType> PendingTableInfoList; // 0xd0
	TMap<None, None> Map_WeaponID_DBID; // 0xe0
	TMap<None, None> Map_WeaponID_InitialKillCount; // 0x128
	TMap<None, None> Map_WeaponID_CurrentGameKillCount; // 0x170
};

struct USeqVar_Bool : USequenceVariable {
	int32_t bValue; // 0xa0
};

struct UDistributionVectorConstant : UDistributionVector {
	FVector Constant; // 0x7c
	uint32_t bLockAxes : 1; // 0x88
	EDistributionVectorLockFlags LockedAxes; // 0x8c
};

struct UNavMeshPathGoalEvaluator : UObject {
	ObjectProperty NextEvaluator; // 0x60
	int32_t MaxPathVisits; // 0x68
	uint32_t bAlwaysCallEvaluateGoal : 1; // 0x6c
	uint32_t bDoPartialAStar : 1; // 0x6c
	int32_t NumNodesThrownOut; // 0x70
	int32_t NumNodesProcessed; // 0x74
	int32_t MaxOpenListSize; // 0x78
};

struct ALensFlareSource : AActor {
	ComponentProperty LensFlareComp; // 0x244
	uint32_t bCurrentlyActive : 1; // 0x24c
};

struct AActor : UObject {
	TArray<ComponentProperty> Components; // 0x60
	TArray<ComponentProperty> AllComponents; // 0x70
	FVector Location; // 0x80
	FRotator Rotation; // 0x8c
	float DrawScale; // 0x98
	FVector DrawScale3D; // 0x9c
	FVector PrePivot; // 0xa8
	FRenderCommandFence DetachFence; // 0xb4
	float CustomTimeDilation; // 0xb8
	EPhysics Physics; // 0xbc
	ENetRole RemoteRole; // 0xbd
	ENetRole Role; // 0xbe
	ECollisionType CollisionType; // 0xbf
	ECollisionType ReplicatedCollisionType; // 0xc0
	ETickingGroup TickGroup; // 0xc1
	ObjectProperty Owner; // 0xc4
	ObjectProperty Base; // 0xcc
	TArray<FTimerData> Timers; // 0xd4
	uint32_t bStatic : 1; // 0xe4
	uint32_t bHidden : 1; // 0xe4
	uint32_t bNoDelete : 1; // 0xe4
	uint32_t bDeleteMe : 1; // 0xe4
	uint32_t bTicked : 1; // 0xe4
	uint32_t bOnlyOwnerSee : 1; // 0xe4
	uint32_t bTickIsDisabled : 1; // 0xe4
	uint32_t bWorldGeometry : 1; // 0xe4
	uint32_t bIgnoreRigidBodyPawns : 1; // 0xe4
	uint32_t bOrientOnSlope : 1; // 0xe4
	uint32_t bIgnoreEncroachers : 1; // 0xe4
	uint32_t bPushedByEncroachers : 1; // 0xe4
	uint32_t bDestroyedByInterpActor : 1; // 0xe4
	uint32_t bRouteBeginPlayEvenIfStatic : 1; // 0xe4
	uint32_t bIsMoving : 1; // 0xe4
	uint32_t bAlwaysEncroachCheck : 1; // 0xe4
	uint32_t bHasAlternateTargetLocation : 1; // 0xe4
	uint32_t bCanStepUpOn : 1; // 0xe4
	uint32_t bNetTemporary : 1; // 0xe4
	uint32_t bOnlyRelevantToOwner : 1; // 0xe4
	uint32_t bNetDirty : 1; // 0xe4
	uint32_t bAlwaysRelevant : 1; // 0xe4
	uint32_t bReplicateInstigator : 1; // 0xe4
	uint32_t bReplicateMovement : 1; // 0xe4
	uint32_t bReplicateCollision : 1; // 0xe4
	uint32_t bReplicateHidden : 1; // 0xe4
	uint32_t bReplicateVelocity : 1; // 0xe4
	uint32_t bReplicateRotation : 1; // 0xe4
	uint32_t bSkipActorPropertyReplication : 1; // 0xe4
	uint32_t bUpdateSimulatedPosition : 1; // 0xe4
	uint32_t bTearOff : 1; // 0xe4
	uint32_t bOnlyDirtyReplication : 1; // 0xe4
	uint32_t bAllowFluidSurfaceInteraction : 1; // 0xe8
	uint32_t bDemoRecording : 1; // 0xe8
	uint32_t bDemoOwner : 1; // 0xe8
	uint32_t bForceDemoRelevant : 1; // 0xe8
	uint32_t bNetInitialRotation : 1; // 0xe8
	uint32_t bReplicateRigidBodyLocation : 1; // 0xe8
	uint32_t bKillDuringLevelTransition : 1; // 0xe8
	uint32_t bExchangedRoles : 1; // 0xe8
	uint32_t bConsiderAllStaticMeshComponentsForStreaming : 1; // 0xe8
	uint32_t bDebug : 1; // 0xe8
	uint32_t bPostRenderIfNotVisible : 1; // 0xe8
	uint32_t bUseHighNetUpdateFrequency : 1; // 0xe8
	uint32_t bForceNetUpdate : 1; // 0xe8
	uint32_t bPendingNetUpdate : 1; // 0xe8
	uint32_t bHardAttach : 1; // 0xe8
	uint32_t bIgnoreBaseRotation : 1; // 0xe8
	uint32_t bShadowParented : 1; // 0xe8
	uint32_t bSkipAttachedMoves : 1; // 0xe8
	uint32_t bCanBeAdheredTo : 1; // 0xe8
	uint32_t bCanBeFrictionedTo : 1; // 0xe8
	uint32_t bHurtEntry : 1; // 0xe8
	uint32_t bGameRelevant : 1; // 0xe8
	uint32_t bMovable : 1; // 0xe8
	uint32_t bDestroyInPainVolume : 1; // 0xe8
	uint32_t bCanBeDamaged : 1; // 0xe8
	uint32_t bShouldBaseAtStartup : 1; // 0xe8
	uint32_t bPendingDelete : 1; // 0xe8
	uint32_t bCanTeleport : 1; // 0xe8
	uint32_t bAlwaysTick : 1; // 0xe8
	uint32_t bBlocksNavigation : 1; // 0xe8
	uint32_t BlockRigidBody : 1; // 0xe8
	uint32_t bCollideWhenPlacing : 1; // 0xe8
	uint32_t bCollideActors : 1; // 0xec
	uint32_t bCollideWorld : 1; // 0xec
	uint32_t bCollideComplex : 1; // 0xec
	uint32_t bBlockActors : 1; // 0xec
	uint32_t bProjTarget : 1; // 0xec
	uint32_t bBlocksTeleport : 1; // 0xec
	uint32_t bMoveIgnoresDestruction : 1; // 0xec
	uint32_t bProjectileMoveSingleBlocking : 1; // 0xec
	uint32_t bNoEncroachCheck : 1; // 0xec
	uint32_t bCollideAsEncroacher : 1; // 0xec
	uint32_t bPhysRigidBodyOutOfWorldCheck : 1; // 0xec
	uint32_t bComponentOutsideWorld : 1; // 0xec
	uint32_t bForceOctreeSNFilter : 1; // 0xec
	uint32_t bForceOctreeMNFilter : 1; // 0xec
	uint32_t bRigidBodyWasAwake : 1; // 0xec
	uint32_t bCallRigidBodyWakeEvents : 1; // 0xec
	uint32_t bBounce : 1; // 0xec
	uint32_t bJustTeleported : 1; // 0xec
	uint32_t bEnableMobileTouch : 1; // 0xec
	uint32_t bNetInitial : 1; // 0xec
	uint32_t bNetOwner : 1; // 0xec
	uint32_t bHiddenEd : 1; // 0xec
	uint32_t bEditable : 1; // 0xec
	uint32_t bHiddenEdGroup : 1; // 0xec
	uint32_t bHiddenEdLayer : 1; // 0xec
	uint32_t bHiddenEdCustom : 1; // 0xec
	uint32_t bHiddenEdTemporary : 1; // 0xec
	uint32_t bHiddenEdLevel : 1; // 0xec
	uint32_t bHiddenEdScene : 1; // 0xec
	uint32_t bEdShouldSnap : 1; // 0xec
	uint32_t bTempEditor : 1; // 0xec
	uint32_t bPathColliding : 1; // 0xec
	uint32_t bPathTemp : 1; // 0xf0
	uint32_t bScriptInitialized : 1; // 0xf0
	uint32_t bLockLocation : 1; // 0xf0
	uint32_t bForceAllowKismetModification : 1; // 0xf0
	uint32_t bDebugEffectIsRelevant : 1; // 0xf0
	int32_t SkelMeshCompTickTag; // 0xf4
	int32_t NetTag; // 0xf8
	float NetUpdateTime; // 0xfc
	float NetUpdateFrequency; // 0x100
	float InvNetUpdateFrequency; // 0x104
	float HighNetUpdateFrequency; // 0x108
	float NetPriority; // 0x10c
	float LastNetUpdateTime; // 0x110
	float TimeSinceLastTick; // 0x114
	ObjectProperty Instigator; // 0x118
	ObjectProperty WorldInfo; // 0x120
	float LifeSpan; // 0x128
	float CreationTime; // 0x12c
	float LastRenderTime; // 0x130
	FName Tag; // 0x134
	FName InitialState; // 0x13c
	FName Layer; // 0x144
	FName Group; // 0x14c
	FQWord HiddenEditorViews; // 0x154
	TArray<ObjectProperty> Touching; // 0x15c
	TArray<ObjectProperty> Children; // 0x16c
	float LatentFloat; // 0x17c
	ObjectProperty LatentSeqNode; // 0x180
	ObjectProperty PhysicsVolume; // 0x188
	FVector Velocity; // 0x190
	FVector Acceleration; // 0x19c
	FVector AngularVelocity; // 0x1a8
	ComponentProperty BaseSkelComponent; // 0x1b4
	FName BaseBoneName; // 0x1bc
	TArray<ObjectProperty> Attached; // 0x1c4
	FVector RelativeLocation; // 0x1d4
	FRotator RelativeRotation; // 0x1e0
	ComponentProperty CollisionComponent; // 0x1ec
	int32_t OverlapTag; // 0x1f4
	FRotator RotationRate; // 0x1f8
	ObjectProperty PendingTouch; // 0x204
	ULocalMessage* MessageClass; // 0x20c
	TArray<USequenceEvent*> SupportedEvents; // 0x214
	TArray<ObjectProperty> GeneratedEvents; // 0x224
	TArray<ObjectProperty> LatentActions; // 0x234
};

struct UMaterialExpressionFluidNormal : UMaterialExpression {
	FExpressionInput Coordinates; // 0xb0
};

struct USkelControlSingleBone : USkelControlBase {
	uint32_t bApplyTranslation : 1; // 0xd0
	uint32_t bApplyRotation : 1; // 0xd0
	uint32_t bAddTranslation : 1; // 0xd0
	uint32_t bAddRotation : 1; // 0xd0
	uint32_t bRemoveMeshRotation : 1; // 0xd0
	FVector BoneTranslation; // 0xd4
	EBoneControlSpace BoneTranslationSpace; // 0xe0
	EBoneControlSpace BoneRotationSpace; // 0xe1
	FName TranslationSpaceBoneName; // 0xe4
	FRotator BoneRotation; // 0xec
	FName RotationSpaceBoneName; // 0xf8
};

struct URB_ConstraintInstance : UObject {
	ObjectProperty Owner; // 0x60
	ComponentProperty OwnerComponent; // 0x68
	int32_t ConstraintIndex; // 0x70
	int32_t SceneIndex; // 0x74
	uint32_t bInHardware : 1; // 0x78
	uint32_t bLinearXPositionDrive : 1; // 0x78
	uint32_t bLinearXVelocityDrive : 1; // 0x78
	uint32_t bLinearYPositionDrive : 1; // 0x78
	uint32_t bLinearYVelocityDrive : 1; // 0x78
	uint32_t bLinearZPositionDrive : 1; // 0x78
	uint32_t bLinearZVelocityDrive : 1; // 0x78
	uint32_t bSwingPositionDrive : 1; // 0x78
	uint32_t bSwingVelocityDrive : 1; // 0x78
	uint32_t bTwistPositionDrive : 1; // 0x78
	uint32_t bTwistVelocityDrive : 1; // 0x78
	uint32_t bAngularSlerpDrive : 1; // 0x78
	uint32_t bTerminated : 1; // 0x78
	FPointer ConstraintData; // 0x7c
	FVector LinearPositionTarget; // 0x84
	FVector LinearVelocityTarget; // 0x90
	float LinearDriveSpring; // 0x9c
	float LinearDriveDamping; // 0xa0
	float LinearDriveForceLimit; // 0xa4
	FQuat AngularPositionTarget; // 0xb0
	FVector AngularVelocityTarget; // 0xc0
	float AngularDriveSpring; // 0xcc
	float AngularDriveDamping; // 0xd0
	float AngularDriveForceLimit; // 0xd4
	FPointer DummyKinActor; // 0xd8
};

struct UAnimNodeFrame : UAnimObject {
	int32_t SizeX; // 0x68
	int32_t SizeY; // 0x6c
	int32_t BorderWidth; // 0x70
	uint32_t bDrawBox : 1; // 0x74
	uint32_t bFilled : 1; // 0x74
	uint32_t bTileFill : 1; // 0x74
	FColor BorderColor; // 0x78
	FColor FillColor; // 0x7c
};

struct UMultiFont : UFont {
	TArray<float> ResolutionTestTable; // 0x1a0
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x68
	ELocationEmitterSelectionMethod SelectionMethod; // 0x70
	uint32_t InheritSourceVelocity : 1; // 0x74
	uint32_t bInheritSourceRotation : 1; // 0x74
	float InheritSourceVelocityScale; // 0x78
	float InheritSourceRotationScale; // 0x7c
};

struct ACombatDroppedWeapon : ACombatDroppedBase {
	uint32_t bUseMeshInterpolation : 1; // 0x320
	uint32_t bClearRemainAmmo : 1; // 0x320
	uint32_t bShowPickupWeaponUI : 1; // 0x320
	ObjectProperty Weapon; // 0x324
	ObjectProperty KillerPRI; // 0x32c
	WordProperty RemainAmmoCount; // 0x334
	char RemainSubAmmoCount; // 0x336
	char RemainSubMagazineAmmo; // 0x337
	WordProperty RemainMagazineAmmo; // 0x338
};

struct ADebugCameraController : AGamePlayerController {
	FName PrimaryKey; // 0x750
	FName SecondaryKey; // 0x758
	FName UnselectKey; // 0x760
	uint32_t bShowSelectedInfo : 1; // 0x768
	uint32_t bDrawDebugText : 1; // 0x768
	uint32_t bIsFrozenRendering : 1; // 0x768
	AHUD* HUDClass; // 0x76c
	ObjectProperty OriginalControllerRef; // 0x774
	ObjectProperty OriginalPlayer; // 0x77c
	ComponentProperty DrawFrustum; // 0x784
	ObjectProperty SelectedActor; // 0x78c
	ComponentProperty SelectedComponent; // 0x794
};

struct UCombatHUD_TutorialLeveObject : UCombatHUD_GameObject {
	ObjectProperty TargetObject; // 0x1b0
	TArray<FString> IconFrameLabels; // 0x1b8
};

struct UCombatLocaizedChatCommandData : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString StringVal_INT; // 0x70
	FString StringVal_LOCAL; // 0x80
};

struct URB_Spring : UActorComponent {
	ComponentProperty Component1; // 0x88
	FName BoneName1; // 0x90
	ComponentProperty Component2; // 0x98
	FName BoneName2; // 0xa0
	int32_t SceneIndex; // 0xa8
	uint32_t bInHardware : 1; // 0xac
	uint32_t bEnableForceMassRatio : 1; // 0xac
	FPointer SpringData; // 0xb0
	float TimeSinceActivation; // 0xb8
	float MinBodyMass; // 0xbc
	float SpringSaturateDist; // 0xc0
	float SpringMaxForce; // 0xc4
	float MaxForceMassRatio; // 0xc8
	FInterpCurveFloat SpringMaxForceTimeScale; // 0xcc
	float DampSaturateVel; // 0xe0
	float DampMaxForce; // 0xe4
};

struct UActorFactoryActor : UActorFactory {
	AActor* ActorClass; // 0x9c
};

struct AEmitterCameraLensEffectBase : AEmitter {
	ObjectProperty PS_CameraEffect; // 0x258
	ObjectProperty PS_CameraEffectNonExtremeContent; // 0x260
	float BaseFOV; // 0x268
	float DistFromCamera; // 0x26c
	uint32_t bAllowMultipleInstances : 1; // 0x270
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x274
	ObjectProperty BaseCamera; // 0x284
	ESceneDepthPriorityGroup DepthGroup; // 0x28c
};

struct USeqAct_SetDOFParams : USeqAct_Latent {
	float FalloffExponent; // 0x120
	float BlurKernelSize; // 0x124
	float MaxNearBlurAmount; // 0x128
	float MinBlurAmount; // 0x12c
	float MaxFarBlurAmount; // 0x130
	float FocusInnerRadius; // 0x134
	float FocusDistance; // 0x138
	FVector FocusPosition; // 0x13c
	float InterpolateSeconds; // 0x148
	float InterpolateElapsed; // 0x14c
	float OldFalloffExponent; // 0x150
	float OldBlurKernelSize; // 0x154
	float OldMaxNearBlurAmount; // 0x158
	float OldMinBlurAmount; // 0x15c
	float OldMaxFarBlurAmount; // 0x160
	float OldFocusInnerRadius; // 0x164
	float OldFocusDistance; // 0x168
	FVector OldFocusPosition; // 0x16c
};

struct UPath_TowardGoal : UPathConstraint {
	ObjectProperty GoalActor; // 0x6c
};

struct USceneCaptureCubeMapComponent : USceneCaptureComponent {
	ObjectProperty TextureTarget; // 0xd0
	float NearPlane; // 0xd8
	float FarPlane; // 0xdc
	FVector WorldLocation; // 0xe0
};

struct UDrawSphereComponent : UPrimitiveComponent {
	FColor SphereColor; // 0x250
	ObjectProperty SphereMaterial; // 0x254
	float SphereRadius; // 0x25c
	int32_t SphereSides; // 0x260
	uint32_t bDrawWireSphere : 1; // 0x264
	uint32_t bDrawLitSphere : 1; // 0x264
	uint32_t bDrawOnlyIfSelected : 1; // 0x264
};

struct UActorFactoryDynamicSM : UActorFactory {
	ObjectProperty StaticMesh; // 0x9c
	FVector DrawScale3D; // 0xa4
	uint32_t bNoEncroachCheck : 1; // 0xb0
	uint32_t bNotifyRigidBodyCollision : 1; // 0xb0
	uint32_t bBlockRigidBody : 1; // 0xb0
	uint32_t bUseCompartment : 1; // 0xb0
	uint32_t bCastDynamicShadow : 1; // 0xb0
	ECollisionType CollisionType; // 0xb4
};

struct ACombatWeapon_ETC : ACombatWeapon {
	FCameraAnimData AttachedCameraAnim; // 0x1ec8
};

struct ULensFlare : UObject {
	FLensFlareElement SourceElement; // 0x60
	ObjectProperty SourceMesh; // 0x1f8
	ESceneDepthPriorityGroup SourceDPG; // 0x200
	ESceneDepthPriorityGroup ReflectionsDPG; // 0x201
	TArray<FLensFlareElement> Reflections; // 0x204
	float OuterCone; // 0x214
	float InnerCone; // 0x218
	float ConeFudgeFactor; // 0x21c
	float Radius; // 0x220
	uint32_t bUseTrueConeCalculation : 1; // 0x224
	uint32_t bUseFixedRelativeBoundingBox : 1; // 0x224
	uint32_t bRenderDebugLines : 1; // 0x224
	uint32_t ThumbnailImageOutOfDate : 1; // 0x224
	float MinStrength; // 0x228
	FRawDistributionFloat ScreenPercentageMap; // 0x22c
	FBox FixedRelativeBoundingBox; // 0x250
	ObjectProperty CurveEdSetup; // 0x26c
	int32_t ReflectionCount; // 0x274
	FRotator ThumbnailAngle; // 0x278
	float ThumbnailDistance; // 0x284
	ObjectProperty ThumbnailImage; // 0x288
};

struct ACBGameReplicationInfo : AGameReplicationInfo {
	FName InitGameStatus; // 0x2a8
	int32_t CountDownTime; // 0x2b0
	int32_t LastCountDownTime; // 0x2b4
	int32_t GoalRound; // 0x2b8
	int32_t GoalMission; // 0x2bc
	int32_t CurrentRound; // 0x2c0
	int32_t ModeID; // 0x2c4
	char RankSystemID; // 0x2c8
	char SpawnGroupIndex; // 0x2c9
	char BindRegion; // 0x2ca
	ObjectProperty PCOwner; // 0x2cc
	uint32_t bIsSuddenDeath : 1; // 0x2d4
	uint32_t UseRigidBodyForInformation : 1; // 0x2d4
	uint32_t bIsChampionship : 1; // 0x2d4
	uint32_t bUseParachuteRespawn : 1; // 0x2d4
	uint32_t bSkipSkillLicense : 1; // 0x2d4
	uint32_t bSupportPickUpItem : 1; // 0x2d4
	TArray<ObjectProperty> DecoyActors; // 0x2d8
	ObjectProperty ResourcePool; // 0x2e8
	ACombatGame* CombatGameClass; // 0x2f0
	FMissionActorInfo TeamMissionActor[0x2]; // 0x2f8
	FMissionActorInfo NeutralMissionActor; // 0x318
	TArray<ObjectProperty> PlayerPRIArray; // 0x328
	ObjectProperty ChampionshipManager; // 0x338
	ObjectProperty CombatSMManager; // 0x340
	FName CurrentGameClassShortName; // 0x348
	ObjectProperty GamePlayKillEvent; // 0x350
	ObjectProperty GamePlayActionEvent; // 0x358
	TArray<ObjectProperty> PickupItemActors; // 0x360
	int32_t TotalPickupItemsCount; // 0x370
	int32_t SeqAct_CombatDelayTime; // 0x374
	int32_t CompetitiveWarmingUpReamainTime; // 0x378
	int32_t RandomRecoilSeed; // 0x37c
};

struct UCombatFrontEnd_BuyItem : UCombatFrontEnd_Object {
	ObjectProperty RefItem; // 0xd0
	ObjectProperty refShopItem; // 0xd8
	ObjectProperty RefItemDetailinfo; // 0xe0
	int32_t PriceType; // 0xe8
	int32_t priceID; // 0xec
	int32_t BuyItemSlotIndex; // 0xf0
	char SelectPresetTab; // 0xf4
	char RecvType; // 0xf5
	int32_t PresetLabelIDList[0x3]; // 0xf8
	FAddoninfo AddOnInfoList[0xa]; // 0x104
	Fabilityinfo AbilityInfoList[0x7]; // 0x17c
};

struct ACCSController : AAIController {
	ObjectProperty BehaviorTreeTemplate; // 0x454
	ObjectProperty ScriptNodeCache; // 0x45c
	ObjectProperty BTInterface; // 0x464
	FPointer Brain; // 0x46c
	FPointer MeatPuppet; // 0x474
	FCCSSystemConfigData SystemConfig; // 0x47c
	TArray<ETargetSelectionConfig> TargetSelection; // 0x4a8
	TScriptInterface<Class> CCSPawn; // 0x4b8
	ObjectProperty SecondaryNavigationHandle; // 0x4c8
	int32_t FireBurstCount; // 0x4d0
	ObjectProperty AimingFocus; // 0x4d4
	FRotator AimingRot; // 0x4dc
	char CCSTeam; // 0x4e8
	ETargetSelectionConfig TargetType; // 0x4e9
	char PathFindErrCount; // 0x4ea
	ComponentProperty DebugVizComponent; // 0x4ec
	TArray<ObjectProperty> NoiseMakers; // 0x4f4
	FSMoveTowardState paramMoveTowardState; // 0x504
	uint32_t bPauseBTWhenScriptedMove : 1; // 0x51c
	FVector PathFindDestPosition; // 0x520
	ObjectProperty PathFindPrevPathActor; // 0x52c
};

struct UNavigationHandle : UObject {
	ObjectProperty AnchorPylon; // 0x60
	FPointer AnchorPoly; // 0x68
	FPathStore PathCache; // 0x70
	FPointer BestUnfinishedPathPoint; // 0x80
	FPointer CurrentEdge; // 0x88
	FPointer SubGoal_DestPoly; // 0x90
	FBasedPosition FinalDestination; // 0x98
	uint32_t bSkipRouteCacheUpdates : 1; // 0xd0
	uint32_t bUseORforEvaluateGoal : 1; // 0xd0
	uint32_t bDebugConstraintsAndGoalEvals : 1; // 0xd0
	uint32_t bUltraVerbosePathDebugging : 1; // 0xd0
	uint32_t bVisualPathDebugging : 1; // 0xd0
	uint32_t bDebug_Breadcrumbs : 1; // 0xd0
	ObjectProperty PathConstraintList; // 0xd4
	ObjectProperty PathGoalList; // 0xdc
	FNavMeshPathParams CachedPathParams; // 0xe4
	EPathFindingError LastPathError; // 0x118
	float LastPathFailTime; // 0x11c
	FVector Breadcrumbs[0xa]; // 0x120
	int32_t BreadCrumbMostRecentIdx; // 0x198
	float BreadCrumbDistanceInterval; // 0x19c
};

struct USeqAct_GiveInventory : USequenceAction {
	TArray<AInventory*> InventoryList; // 0x108
	uint32_t bClearExisting : 1; // 0x118
	uint32_t bForceReplace : 1; // 0x118
};

struct ACombatBusterHUD : ACombatTeamGameHUD {
	float BusterActorDamageStateDelay; // 0x62c
	int32_t BusterDamageScoreLocalizedID; // 0x630
};

struct UMaterialExpressionSceneDepth : UMaterialExpression {
	FExpressionInput Coordinates; // 0xb0
	uint32_t bNormalize : 1; // 0xe4
};

struct UNavMeshPath_WithinTraversalDist : UNavMeshPathConstraint {
	float MaxTraversalDist; // 0x78
	uint32_t bSoft : 1; // 0x7c
	float SoftStartPenalty; // 0x80
};

struct USoundNodeOscillator : USoundNode {
	uint32_t bModulateVolume : 1; // 0x74
	uint32_t bModulatePitch : 1; // 0x74
	float AmplitudeMin; // 0x78
	float AmplitudeMax; // 0x7c
	float FrequencyMin; // 0x80
	float FrequencyMax; // 0x84
	float OffsetMin; // 0x88
	float OffsetMax; // 0x8c
	float CenterMin; // 0x90
	float CenterMax; // 0x94
	FRawDistributionFloat Amplitude; // 0x98
	FRawDistributionFloat Frequency; // 0xbc
	FRawDistributionFloat Offset; // 0xe0
	FRawDistributionFloat Center; // 0x104
};

struct UCombatMatchroomClanMatching : UCombatMatchroomAutoMatchingBase {
	int32_t TeamRankingPoint; // 0x7c
};

struct UMaterialExpressionQualitySwitch : UMaterialExpression {
	FExpressionInput High; // 0xb0
	FExpressionInput Low; // 0xe4
};

struct UCombatDataTableRefPickup : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	int32_t MainAmmoRate; // 0x80
	int32_t SubAmmoRate; // 0x84
	int32_t GrenadeRate_A; // 0x88
	int32_t GrenadeRate_B; // 0x8c
	int32_t GrenadeRate_C; // 0x90
	int32_t CureHealthRate; // 0x94
	FString ScriptFileName; // 0x98
	int32_t StringID; // 0xa8
};

struct UCombatItemFXBase : UObject {
	FSItemFX ItemFX[0x2]; // 0x60
};

struct UMcpIdMappingBase : UMcpServiceBase {
	FString McpIdMappingClassName; // 0x78
	DelegateProperty __OnAddMappingComplete__Delegate; // 0x88
	DelegateProperty __OnQueryMappingsComplete__Delegate; // 0x98
};

struct UInterpTrackFloatProp : UInterpTrackFloatBase {
	FName PropertyName; // 0xb8
};

struct UCombatAnimNotify_MaterialParam : UAnimNotify {
	FAnimNotifyScalarParameter ScalarConstantParam; // 0x60
	FAnimNotifyVectorParameter VectorConstantParam; // 0x70
	FTextureParameterValue TextureConstantParam; // 0x98
	TArray<FMICParam> SavedMICParam; // 0xb8
	float AnimStartTime; // 0xc8
	float NotifyDuration; // 0xcc
};

struct ACombatPickupFactory : APickupFactory {
	ComponentProperty BaseMesh; // 0x368
	ComponentProperty LightEnvironment; // 0x370
	uint32_t bCheckTeam : 1; // 0x378
	uint32_t bUpdatingPickup : 1; // 0x378
	uint32_t bFloatingPickup : 1; // 0x378
	uint32_t bRotatingPickup : 1; // 0x378
	uint32_t bForceDelayedSpawn : 1; // 0x378
	uint32_t bDelayedSpawn : 1; // 0x378
	uint32_t bForceRespawn : 1; // 0x378
	Team TeamIndex; // 0x37c
	ObjectProperty RespawnSound; // 0x380
	ObjectProperty PickupSound; // 0x388
	ObjectProperty EnemyPickupSound; // 0x390
	float BobTimer; // 0x398
	float BobOffset; // 0x39c
	float BobSpeed; // 0x3a0
	float BobBaseOffset; // 0x3a4
	float YawRotationRate; // 0x3a8
	ComponentProperty SpinningParticleEffects; // 0x3ac
	ObjectProperty SpinningParticleTemplate; // 0x3b4
	float RespawnTime; // 0x3bc
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0xa0
	float CurveTension; // 0xb4
};

struct UCombatBusterMovie : UCombatTeamGameMovie {
	ObjectProperty BusterContainer; // 0xad0
	ObjectProperty BusterMovie; // 0xad8
	uint32_t bUpdate : 1; // 0xae0
};

struct UCombatDataTableRefMap : UCombatDataTableType {
	int32_t Index; // 0x6c
	FString CodeName; // 0x70
	FString Filename; // 0x80
	int32_t DisplayName; // 0x90
	MATCHROOM_MAP_OPTION_SIZE MapSize; // 0x94
	int32_t DescAi; // 0x98
	int32_t ImageID_DisplayThumbnail; // 0x9c
	int32_t ImageID_Title; // 0xa0
	int32_t ImageID_Loading; // 0xa4
	int32_t ImageID_Minimap; // 0xa8
	int32_t ImageID_BGThumbnail; // 0xac
};

struct UCombatDataTableRefEvolveEquip : UCombatDataTableType {
	FString GroupCodeName; // 0x6c
	FString PrimaryWeapon; // 0x7c
	FString SubWeapon; // 0x8c
	FString MeleeWeapon; // 0x9c
	FString ETCWeapon; // 0xac
	FString ChipA; // 0xbc
};

struct ACombatPC : ACombatPlayerControllerBase {
	FName CameraActorTag; // 0x908
	FName CameraStyle; // 0x910
	float SprayUseDelay; // 0x918
	float SprayDistance; // 0x91c
	int32_t SprayCount; // 0x920
	float SprayLifeSpan; // 0x924
	ObjectProperty SpraySound_Fail; // 0x928
	TArray<ObjectProperty> SprayDecalActors; // 0x930
	int32_t SprayLastUseIndex; // 0x940
	float SprayLastUseTime; // 0x944
	uint32_t bSprayPreview : 1; // 0x948
	uint32_t bNoCrosshair : 1; // 0x948
	uint32_t bInitializedPresetList : 1; // 0x948
	uint32_t bKeepSpectatingCamMode : 1; // 0x948
	uint32_t bReadyForFlashbang : 1; // 0x948
	uint32_t bCaptureFlashbang : 1; // 0x948
	uint32_t bLastSendCrouched : 1; // 0x948
	uint32_t bLastSendMoving : 1; // 0x948
	uint32_t bCanDisplayHitInfomation : 1; // 0x948
	uint32_t bCanDisplayGainAward : 1; // 0x948
	uint32_t bCanDisplayScoring : 1; // 0x948
	uint32_t bCanDisplayPreset : 1; // 0x948
	uint32_t bQuickPresetChange : 1; // 0x948
	uint32_t BeDamaged : 1; // 0x948
	uint32_t UISoundPlaying : 1; // 0x948
	uint32_t bForceRestart : 1; // 0x948
	uint32_t bHideTeamIFF : 1; // 0x948
	uint32_t bVivoxSet : 1; // 0x948
	ObjectProperty SprayPreviewDecalActor; // 0x94c
	float SprayPreviewDelay; // 0x954
	float SprayLastPreviewTime; // 0x958
	int32_t CachedSprayID; // 0x95c
	float NetworkDisconnectCheckTime; // 0x960
	float NetworkDisconnectAllowTime; // 0x964
	float HighPingShootAllowTime; // 0x968
	float HighPingShootMaxTime; // 0x96c
	int32_t HighPingValue; // 0x970
	float HighPingDetectTime; // 0x974
	int32_t LocalPresetList_First[0x9]; // 0x978
	int32_t LocalPresetList_Sec[0x9]; // 0x99c
	int32_t LocalPresetList_Third[0x9]; // 0x9c0
	char CurrentPreset; // 0x9e4
	char ReservedPreset; // 0x9e5
	EPhysics LastSendPhysics; // 0x9e6
	EMouseSensMode CurrentMouseSensMode; // 0x9e7
	char LockedPresetSceneCount; // 0x9e8
	char LockedPresetSceneCountMax; // 0x9e9
	PLAYERSTART_TYPE PlayerStartType; // 0x9ea
	char LogoutReason; // 0x9eb
	float LastPresetPressTime; // 0x9ec
	float PresetInputDelay; // 0x9f0
	ObjectProperty EntryPostProcessChain; // 0x9f4
	TArray<ObjectProperty> OldPostProcessChain; // 0x9fc
	ObjectProperty CBLocalPlayer; // 0xa0c
	float CheckSpectatorDelay; // 0xa14
	FName DefaultSpectatingCamMode; // 0xa18
	FName SavedSpectatingCamMode; // 0xa20
	ObjectProperty StatStorage; // 0xa28
	ObjectProperty CombatLogData; // 0xa30
	float NetMoveDeltaWhenNotMoved; // 0xa38
	FRotator LastSentRotation; // 0xa3c
	float InputExpireTime; // 0xa48
	ObjectProperty CombatPawn; // 0xa4c
	int32_t DropClaymoreCount; // 0xa54
	ObjectProperty DroppedWeapon; // 0xa58
	ObjectProperty DroppedSupplies[0x2]; // 0xa60
	TArray<ObjectProperty> DropClaymoreList; // 0xa70
	ObjectProperty PresetManager; // 0xa80
	ObjectProperty presetUI; // 0xa88
	ObjectProperty myCombatTeamGameHUD; // 0xa90
	ObjectProperty KillerIFFObject; // 0xa98
	int32_t AdjustPositionCounter; // 0xaa0
	int32_t AdjustPositionUpdateCounter; // 0xaa4
	float SpectatingMouseSens; // 0xaa8
	ObjectProperty CurrentMinimapActor; // 0xaac
	float LastClientOnlineTime; // 0xab4
	float LastInvalidNetworkTime; // 0xab8
	TArray<FDisplayPawnInfo> AliveDisplayPawnList; // 0xabc
	TArray<FDisplayPawnInfo> DeadDisplayPawnList; // 0xacc
	int32_t CriticalDamageamount; // 0xadc
	TArray<ObjectProperty> UAVActorList; // 0xae0
	TArray<ObjectProperty> SentrygunList; // 0xaf0
	TArray<ObjectProperty> TrophyturretList; // 0xb00
	ObjectProperty OutlineManager; // 0xb10
	TArray<FGlobalOutlineEvent> GlobalOutlineEventList; // 0xb18
	float CheckViewTargetLookAtDuration; // 0xb28
	ObjectProperty LockedPresetScene; // 0xb2c
	FName LockedPresetSceneState; // 0xb34
	ObjectProperty DeployedSkillActors[0x2]; // 0xb3c
	TArray<char> Redeploying; // 0xb4c
	ObjectProperty spawnPointUI; // 0xb5c
	ObjectProperty InGameBattleLog; // 0xb64
	int32_t AdvancedColorIndex; // 0xb6c
	float CheckMouseSensStartTime; // 0xb70
	float CheckMouseSensLoopDelay; // 0xb74
	float CheckMouseSensEndTime; // 0xb78
	FString LoginTokenPartA; // 0xb7c
	FString LoginTokenPartB; // 0xb8c
	FString JoinTokenPartA; // 0xb9c
	FString JoinTokenPartB; // 0xbac
	TArray<FPresetSlotState> PresetSlotStateArray; // 0xbbc
	FCombatPC_RestoreGameKillData RestoreKillData; // 0xbcc
};

struct ACombatWeapon_Shotgun_Base : ACombatWeapon {
	int32_t TransientShotgunDamage; // 0x1ec8
};

struct UPBRuleNodeAlternate : UPBRuleNodeBase {
	EProcBuildingAxis RepeatAxis; // 0x70
	float ASize; // 0x74
	float BMaxSize; // 0x78
	uint32_t bInvertPatternOrder : 1; // 0x7c
	uint32_t bEqualSizeAB : 1; // 0x7c
};

struct AComBatPC_AIGame : ACombatPC {
	ObjectProperty AIAggroMeSound; // 0xbe4
	ObjectProperty AIAggroMeReleaseSound; // 0xbec
};

struct UCombatGameThirdPersonCamera : UGameThirdPersonCamera {
	ObjectProperty ThirdPersonCamDead; // 0x1d4
	UGameThirdPersonCameraMode* ThirdPersonCamDeadClass; // 0x1dc
	ObjectProperty ThirdPersonCamSpectator; // 0x1e4
	UGameThirdPersonCameraMode* ThirdPersonCamSpectatorClass; // 0x1ec
	ObjectProperty LocalPC; // 0x1f4
};

struct USeqAct_MITV_Activate : USequenceAction {
	float DurationOfMITV; // 0x108
};

struct UDamageType : UObject {
	uint32_t bArmorStops : 1; // 0x60
	uint32_t bCausedByWorld : 1; // 0x60
	uint32_t bExtraMomentumZ : 1; // 0x60
	uint32_t bCausesFracture : 1; // 0x60
	uint32_t bRadialDamageVelChange : 1; // 0x60
	float KDamageImpulse; // 0x64
	float KDeathVel; // 0x68
	float KDeathUpKick; // 0x6c
	float RadialDamageImpulse; // 0x70
	float VehicleDamageScaling; // 0x74
	float VehicleMomentumScaling; // 0x78
	ObjectProperty DamagedFFWaveform; // 0x7c
	ObjectProperty KilledFFWaveform; // 0x84
	float FracturedMeshDamage; // 0x8c
};

struct UDecalComponent : UPrimitiveComponent {
	ObjectProperty DecalMaterial; // 0x250
	float Width; // 0x258
	float Height; // 0x25c
	float TileX; // 0x260
	float TileY; // 0x264
	float OffsetX; // 0x268
	float OffsetY; // 0x26c
	float DecalRotation; // 0x270
	float FieldOfView; // 0x274
	float NearPlane; // 0x278
	float FarPlane; // 0x27c
	FVector Location; // 0x280
	FRotator Orientation; // 0x28c
	FVector HitLocation; // 0x298
	FVector HitNormal; // 0x2a4
	FVector HitTangent; // 0x2b0
	FVector HitBinormal; // 0x2bc
	uint32_t bNoClip : 1; // 0x2c8
	uint32_t bStaticDecal : 1; // 0x2c8
	uint32_t bProjectOnBackfaces : 1; // 0x2c8
	uint32_t bProjectOnHidden : 1; // 0x2c8
	uint32_t bProjectOnBSP : 1; // 0x2c8
	uint32_t bProjectOnStaticMeshes : 1; // 0x2c8
	uint32_t bProjectOnSkeletalMeshes : 1; // 0x2c8
	uint32_t bProjectOnTerrain : 1; // 0x2c8
	uint32_t bFlipBackfaceDirection : 1; // 0x2c8
	uint32_t bMovableDecal : 1; // 0x2c8
	uint32_t bHasBeenAttached : 1; // 0x2c8
	uint32_t bDecalMaterialSetAtRunTime : 1; // 0x2c8
	uint32_t bUseForShadow : 1; // 0x2c8
	uint32_t bForceAllowedlInGame : 1; // 0x2c8
	ComponentProperty HitComponent; // 0x2cc
	FName HitBone; // 0x2d4
	int32_t HitNodeIndex; // 0x2dc
	int32_t HitLevelIndex; // 0x2e0
	int32_t FracturedStaticMeshComponentIndex; // 0x2e4
	TArray<int32_t> HitNodeIndices; // 0x2e8
	TArray<FDecalReceiver> DecalReceivers; // 0x2f8
	TArray<FPointer> StaticReceivers; // 0x308
	FPointer ReleaseResourcesFence; // 0x318
	TArray<FPlane> Planes; // 0x320
	float DepthBias; // 0x330
	float SlopeScaleDepthBias; // 0x334
	int32_t SortOrder; // 0x338
	float BackfaceAngle; // 0x33c
	FVector2D BlendRange; // 0x340
	float StreamingDistanceMultiplier; // 0x348
	EDecalTransform DecalTransform; // 0x34c
	EFilterMode FilterMode; // 0x34d
	TArray<ObjectProperty> Filter; // 0x350
	TArray<ComponentProperty> ReceiverImages; // 0x360
	FVector ParentRelativeLocation; // 0x370
	FRotator ParentRelativeOrientation; // 0x37c
	FMatrix ParentRelLocRotMatrix; // 0x390
};

struct UCCSAFMoveTo : UGripAFActionHandle {
	FVector Target; // 0x64
	ECCSMovementType MovementType; // 0x70
	ECCSAlertnessState Alertness; // 0x71
};

struct UPrefab : UObject {
	int32_t PrefabVersion; // 0x60
	TArray<ObjectProperty> PrefabArchetypes; // 0x64
	TArray<ObjectProperty> RemovedArchetypes; // 0x74
	ObjectProperty PrefabSequence; // 0x84
};

struct UCombatFrontEndBannerManager : UObject {
	float ImageDurationTime; // 0x60
	float ImageLastTime; // 0x64
	int32_t NumberOfImages; // 0x68
	uint32_t bIsReady : 1; // 0x6c
	int32_t BannerTextureWidth; // 0x70
	int32_t BannerTextureHeight; // 0x74
	TArray<FOnlineBannerInfo> OnlineBannerInfos; // 0x78
	FDisplayBannerInfo DisplayBannerInfos[0x2]; // 0x88
};

struct ANavMeshObstacle : AActor {
	FPointer VfTable_IInterface_NavMeshPathObstacle; // 0x244
	uint32_t bEnabled : 1; // 0x24c
	uint32_t bPreserveInternalGeo : 1; // 0x24c
};

struct AFrameworkGame : AGameInfo {
	TArray<FRequiredMobileInputConfig> RequiredMobileInputConfigs; // 0x4c0
};

struct UHttpRequestWindowsMcp : UHttpRequestWindows {
	FString AppID; // 0xa0
	FString AppSecret; // 0xb0
};

struct UParticleModuleMeshRotation_Seeded : UParticleModuleMeshRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x90
};

struct UCombatAnimBlendBySlotActive : UAnimNodeBlendPerBone {
	ObjectProperty ChildSlot; // 0x144
};

struct USeqAct_LevelStreaming : USeqAct_LevelStreamingBase {
	ObjectProperty Level; // 0x124
	FName LevelName; // 0x12c
	uint32_t bStatusIsOk : 1; // 0x134
};

struct UParticleModuleLocationPrimitiveSphere : UParticleModuleLocationPrimitiveBase {
	FRawDistributionFloat StartRadius; // 0xb4
};

struct UGameExplosion : UObject {
	uint32_t bDirectionalExplosion : 1; // 0x60
	uint32_t bIgnoreInstigator : 1; // 0x60
	uint32_t bAllowTeammateCringes : 1; // 0x60
	uint32_t bFullDamageToAttachee : 1; // 0x60
	uint32_t bAttachExplosionEmitterToAttachee : 1; // 0x60
	uint32_t bPerformRadialBlurRelevanceCheck : 1; // 0x60
	uint32_t bCausesFracture : 1; // 0x60
	uint32_t bAllowPerMaterialFX : 1; // 0x60
	uint32_t bParticleSystemIsBeingOverriddenDontUsePhysMatVersion : 1; // 0x60
	uint32_t bSkipDefaultPhysMatParticleSystem : 1; // 0x60
	uint32_t bUseMapSpecificValues : 1; // 0x60
	uint32_t bUseOverlapCheck : 1; // 0x60
	uint32_t bOrientCameraShakeTowardsEpicenter : 1; // 0x60
	uint32_t bAutoControllerVibration : 1; // 0x60
	float DirectionalExplosionAngleDeg; // 0x64
	float DamageDelay; // 0x68
	float Damage; // 0x6c
	float DamageRadius; // 0x70
	float DamageFalloffExponent; // 0x74
	ObjectProperty ActorToIgnoreForDamage; // 0x78
	AActor* ActorClassToIgnoreForDamage; // 0x80
	AActor* ActorClassToIgnoreForKnockdownsAndCringes; // 0x88
	UDamageType* MyDamageType; // 0x90
	float KnockDownRadius; // 0x98
	float KnockDownStrength; // 0x9c
	float CringeRadius; // 0xa0
	FVector2D CringeDuration; // 0xa4
	float MomentumTransferScale; // 0xac
	ObjectProperty ParticleEmitterTemplate; // 0xb0
	float ExplosionEmitterScale; // 0xb8
	ObjectProperty HitActor; // 0xbc
	FVector HitLocation; // 0xc4
	FVector HitNormal; // 0xd0
	ObjectProperty ExplosionSound; // 0xdc
	ObjectProperty ExplosionSoundHurtSomeone; // 0xe4
	ComponentProperty ExploLight; // 0xec
	float ExploLightFadeOutTime; // 0xf4
	ComponentProperty ExploRadialBlur; // 0xf8
	float ExploRadialBlurFadeOutTime; // 0x100
	float ExploRadialBlurMaxBlur; // 0x104
	float FractureMeshRadius; // 0x108
	float FracturePartVel; // 0x10c
	ObjectProperty CamShake; // 0x110
	ObjectProperty CamShake_Left; // 0x118
	ObjectProperty CamShake_Right; // 0x120
	ObjectProperty CamShake_Rear; // 0x128
	float CamShakeInnerRadius; // 0x130
	float CamShakeOuterRadius; // 0x134
	float CamShakeFalloff; // 0x138
	AEmitterCameraLensEffectBase* CameraLensEffect; // 0x13c
	float CameraLensEffectRadius; // 0x144
};

struct AGameInfo : AInfo {
	uint32_t bRestartLevel : 1; // 0x244
	uint32_t bPauseable : 1; // 0x244
	uint32_t bTeamGame : 1; // 0x244
	uint32_t bGameEnded : 1; // 0x244
	uint32_t bOverTime : 1; // 0x244
	uint32_t bDelayedStart : 1; // 0x244
	uint32_t bWaitingToStartMatch : 1; // 0x244
	uint32_t bChangeLevels : 1; // 0x244
	uint32_t bAlreadyChanged : 1; // 0x244
	uint32_t bAdminCanPause : 1; // 0x244
	uint32_t bGameRestarted : 1; // 0x244
	uint32_t bLevelChange : 1; // 0x244
	uint32_t bKickLiveIdlers : 1; // 0x244
	uint32_t bUsingArbitration : 1; // 0x244
	uint32_t bHasArbitratedHandshakeBegun : 1; // 0x244
	uint32_t bNeedsEndGameHandshake : 1; // 0x244
	uint32_t bIsEndGameHandshakeComplete : 1; // 0x244
	uint32_t bHasEndGameHandshakeBegun : 1; // 0x244
	uint32_t bFixedPlayerStart : 1; // 0x244
	uint32_t bDoFearCostFallOff : 1; // 0x244
	uint32_t bUseSeamlessTravel : 1; // 0x244
	uint32_t bHasNetworkError : 1; // 0x244
	uint32_t bRequiresPushToTalk : 1; // 0x244
	uint32_t bIsStandbyCheckingEnabled : 1; // 0x244
	uint32_t bIsStandbyCheckingOn : 1; // 0x244
	uint32_t bHasStandbyCheatTriggered : 1; // 0x244
	FString SubLevelPostFix; // 0x248
	FString CauseEventCommand; // 0x258
	FString BugLocString; // 0x268
	FString BugRotString; // 0x278
	TArray<ObjectProperty> PendingArbitrationPCs; // 0x288
	TArray<ObjectProperty> ArbitrationPCs; // 0x298
	float ArbitrationHandshakeTimeout; // 0x2a8
	float GameDifficulty; // 0x2ac
	int32_t GoreLevel; // 0x2b0
	float GameSpeed; // 0x2b4
	int32_t MaxBotSpawnPerTick; // 0x2b8
	int32_t CurBotSpawnNumber; // 0x2bc
	APawn* DefaultPawnClass; // 0x2c0
	AHUD* HUDType; // 0x2c8
	AHUD* SecondaryHUDType; // 0x2d0
	int32_t MaxSpectators; // 0x2d8
	int32_t MaxSpectatorsAllowed; // 0x2dc
	int32_t NumSpectators; // 0x2e0
	int32_t MaxPlayers; // 0x2e4
	int32_t MaxPlayersAllowed; // 0x2e8
	int32_t NumPlayers; // 0x2ec
	int32_t NumBots; // 0x2f0
	int32_t NumTravellingPlayers; // 0x2f4
	int32_t CurrentID; // 0x2f8
	FString DefaultPlayerName; // 0x2fc
	FString GameName; // 0x30c
	float FearCostFallOff; // 0x31c
	int32_t GoalScore; // 0x320
	int32_t MaxLives; // 0x324
	int32_t TimeLimit; // 0x328
	ULocalMessage* DeathMessageClass; // 0x32c
	UGameMessage* GameMessageClass; // 0x334
	ObjectProperty BaseMutator; // 0x33c
	AAccessControl* AccessControlClass; // 0x344
	ObjectProperty AccessControl; // 0x34c
	ABroadcastHandler* BroadcastHandlerClass; // 0x354
	ObjectProperty BroadcastHandler; // 0x35c
	AAutoTestManager* AutoTestManagerClass; // 0x364
	ObjectProperty MyAutoTestManager; // 0x36c
	APlayerController* PlayerControllerClass; // 0x374
	APlayerReplicationInfo* PlayerReplicationInfoClass; // 0x37c
	AGameReplicationInfo* GameReplicationInfoClass; // 0x384
	ObjectProperty GameReplicationInfo; // 0x38c
	ObjectProperty PopulationManager; // 0x394
	ACrowdPopulationManagerBase* PopulationManagerClass; // 0x39c
	FString GripAIManagerClassPath; // 0x3a4
	ObjectProperty GripAIManagerHolder; // 0x3b4
	float MaxIdleTime; // 0x3bc
	float MaxTimeMargin; // 0x3c0
	float TimeMarginSlack; // 0x3c4
	float MinTimeMargin; // 0x3c8
	TArray<ObjectProperty> InactivePRIArray; // 0x3cc
	TArray<DelegateProperty> Pausers; // 0x3dc
	ObjectProperty OnlineSub; // 0x3ec
	TScriptInterface<Class> GameInterface; // 0x3f4
	UOnlineStatsWrite* OnlineStatsWriteClass; // 0x404
	int32_t LeaderboardId; // 0x40c
	int32_t ArbitratedLeaderboardId; // 0x410
	ObjectProperty CoverReplicatorBase; // 0x414
	UOnlineGameSettings* OnlineGameSettingsClass; // 0x41c
	FString ServerOptions; // 0x424
	int32_t AdjustedNetSpeed; // 0x434
	float LastNetSpeedUpdateTime; // 0x438
	int32_t TotalNetBandwidth; // 0x43c
	int32_t MinDynamicBandwidth; // 0x440
	int32_t MaxDynamicBandwidth; // 0x444
	float StandbyRxCheatTime; // 0x448
	float StandbyTxCheatTime; // 0x44c
	int32_t BadPingThreshold; // 0x450
	float PercentMissingForRxStandby; // 0x454
	float PercentMissingForTxStandby; // 0x458
	float PercentForBadPing; // 0x45c
	float JoinInProgressStandbyWaitTime; // 0x460
	ObjectProperty StreamingPauseIcon; // 0x464
	TArray<FGameClassShortName> GameInfoClassAliases; // 0x46c
	FString DefaultGameType; // 0x47c
	TArray<FGameTypePrefix> DefaultMapPrefixes; // 0x48c
	TArray<FGameTypePrefix> CustomMapPrefixes; // 0x49c
	int32_t AnimTreePoolSize; // 0x4ac
	DelegateProperty __CanUnpause__Delegate; // 0x4b0
};

struct ANxTornadoAngularForceFieldCapsule : ANxTornadoAngularForceField {
	ComponentProperty RenderComponent; // 0x2cc
};

struct UCombatAnimNotify_MITVParam : UAnimNotify {
	uint32_t bOverride_AutoActiveAll : 1; // 0x60
	uint32_t bAutoActivateAll : 1; // 0x60
	uint32_t bApplyPlayRate : 1; // 0x60
	TArray<FAnimNotifyMITVScalarParam> ScalarParam; // 0x64
	TArray<FAnimNotifyMITVVectorParam> VectorParam; // 0x74
	TArray<FAnimNotifyMITVLinearColorParam> LinearColorParam; // 0x84
	TArray<FAnimNotifyMITVTextureParam> TextureParam; // 0x94
	TArray<FMITVParam> SavedMITVParam; // 0xa4
	float AnimStartTime; // 0xb4
	float NotifyDuration; // 0xb8
};

struct APlayerStart : ANavigationPoint {
	uint32_t bEnabled : 1; // 0x33c
	uint32_t bPrimaryStart : 1; // 0x33c
	uint32_t bBestStart : 1; // 0x33c
	int32_t TeamIndex; // 0x340
	int32_t Score; // 0x344
	int32_t SelectionIndex; // 0x348
};

struct UMorphNodePose : UMorphNodeBase {
	ObjectProperty Target; // 0x74
	FName MorphName; // 0x7c
	float Weight; // 0x84
};

struct ASpeedTreeActor : AActor {
	ComponentProperty SpeedTreeComponent; // 0x244
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x68
	uint32_t bSpawnTimeOnly : 1; // 0x8c
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x90
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x74
	float DelayMax; // 0x78
	FRawDistributionFloat DelayDuration; // 0x7c
};

struct UMaterialExpressionCeil : UMaterialExpression {
	FExpressionInput Input; // 0xb0
};

struct USeqAct_CombatGameOver : USequenceAction {
	Team Winner; // 0x108
	ERoundResultReason Reason; // 0x109
};

struct UCombatDataTableRefRoomName : UCombatDataTableType {
	int32_t Code; // 0x6c
	int32_t DisplayID; // 0x70
};

struct UCombatHUDSoundGroup : UObject {
	ObjectProperty GameOverQuestion; // 0x60
	ObjectProperty Target; // 0x68
};

struct UDrawCapsuleComponent : UPrimitiveComponent {
	FColor CapsuleColor; // 0x250
	ObjectProperty CapsuleMaterial; // 0x254
	float CapsuleHeight; // 0x25c
	float CapsuleRadius; // 0x260
	uint32_t bDrawWireCapsule : 1; // 0x264
	uint32_t bDrawLitCapsule : 1; // 0x264
	uint32_t bDrawOnlyIfSelected : 1; // 0x264
};

struct ARB_Thruster : ARigidBodyBase {
	uint32_t bThrustEnabled : 1; // 0x244
	float ThrustStrength; // 0x248
};

struct URB_RadialImpulseComponent : UPrimitiveComponent {
	ERadialImpulseFalloff ImpulseFalloff; // 0x250
	float ImpulseStrength; // 0x254
	float ImpulseRadius; // 0x258
	uint32_t bVelChange : 1; // 0x25c
	uint32_t bCauseFracture : 1; // 0x25c
	ComponentProperty PreviewSphere; // 0x260
};

struct UCombatDataTableRefMatchMakingOption : UCombatDataTableType {
	FString CodeName; // 0x6c
	int32_t ServiceRegionID; // 0x7c
	FString PingCodeName; // 0x80
	FString RatingCodeName; // 0x90
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x94
};

struct ACombatVolumetricsActor : AActor {
	ObjectProperty VolumetricsMI; // 0x244
	ObjectProperty ParentVolumetricsMat; // 0x24c
	ComponentProperty StaticMeshComponent; // 0x254
	FColor EffectColor; // 0x25c
	float Distance; // 0x260
	float FalloffExponent; // 0x264
	float Opacity; // 0x268
};

struct UInterpGroupAI : UInterpGroup {
	FName StageMarkGroup; // 0x98
	uint32_t SnapToRootBoneLocationWhenFinished : 1; // 0xa0
	uint32_t bNoEncroachmentCheck : 1; // 0xa0
	uint32_t bDisableWorldCollision : 1; // 0xa0
	uint32_t bIgnoreLegacyHeightAdjust : 1; // 0xa0
	uint32_t bRecreatePreviewPawn : 1; // 0xa0
	uint32_t bRefreshStageMarkGroup : 1; // 0xa0
};

struct UParticleModuleColor_Seeded : UParticleModuleColor {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb4
};

struct UCCSActorFactory : UActorFactory {
	ACCSController* ControllerClass; // 0x9c
	ObjectProperty BehaviorTree; // 0xa4
	APawn* PawnClass; // 0xac
	FString PawnName; // 0xb4
	FCCSSystemConfigData Config; // 0xc4
	uint32_t bGiveDefaultInventory : 1; // 0xf0
	TArray<AInventory*> InventoryList; // 0xf4
	int32_t TeamIndex; // 0x104
};

struct USeqAct_FinishSequence : USequenceAction {
	FString OutputLabel; // 0x108
};

struct UCombatDataTableRefCompetitiveSeason : UCombatDataTableType {
	FString SeasonCodeName; // 0x6c
	FString ModeGroupCodename; // 0x7c
};

struct UCombatDataTableRefShopSellItem : UCombatDataTableType {
	int32_t TimeCondition; // 0x6c
	int32_t OverlapCondition; // 0x70
	int32_t MoneyType; // 0x74
	int32_t SellCost; // 0x78
	FString CodeName; // 0x7c
};

struct UCombatSkelCtrl_Hinge : USkelControlSingleBone {
	uint32_t bInitialized : 1; // 0x100
	ObjectProperty OwnerPawn; // 0x104
	FName AttachedBoneName; // 0x10c
	ObjectProperty BodyInstance; // 0x114
	float MaxAngle; // 0x11c
	EAxis PivotAxis; // 0x120
	float AVModifier; // 0x124
	float CurrentAngle; // 0x128
	float SpringStiffness; // 0x12c
};

struct UTextureMovie : UTexture {
	int32_t SizeX; // 0x11c
	int32_t SizeY; // 0x120
	EPixelFormat Format; // 0x124
	TextureAddress AddressX; // 0x125
	TextureAddress AddressY; // 0x126
	EMovieStreamSource MovieStreamSource; // 0x127
	UCodecMovie* DecoderClass; // 0x128
	ObjectProperty Decoder; // 0x130
	uint32_t Paused : 1; // 0x138
	uint32_t Stopped : 1; // 0x138
	uint32_t Looping : 1; // 0x138
	uint32_t ResetOnLastFrame : 1; // 0x138
	uint32_t AutoPlay : 1; // 0x138
	FUntypedBulkData_Mirror Data; // 0x13c
	FPointer ReleaseCodecFence; // 0x17c
};

struct UPBRuleNodeEdgeAngle : UPBRuleNodeBase {
	EProcBuildingEdge Edge; // 0x70
	TArray<FRBEdgeAngleInfo> Angles; // 0x74
};

struct ACombatSEIGameReplicationInfo : ACBGameReplicationInfo {
	TArray<ObjectProperty> OccupiedAreas; // 0x380
	int32_t TotalOccupiedAreaNum; // 0x390
};

struct USeqEvent_TouchInput : USequenceEvent {
	uint32_t bTrapInput : 1; // 0x128
	int32_t AllowedPlayerIndex; // 0x12c
	int32_t AllowedTouchIndex; // 0x130
	int32_t AllowedTouchpadIndex; // 0x134
};

struct UOnlineEventsInterfaceMcp : UMCPBase {
	TArray<FEventUploadConfig> EventUploadConfigs; // 0x80
	TArray<FPointer> MCPEventPostObjects; // 0x90
	TArray<EEventUploadType> DisabledUploadTypes; // 0xa0
	uint32_t bBinaryStats : 1; // 0xb0
};

struct UCombatDataTableRefCompetitiveBindMode : UCombatDataTableType {
	FString SeasonCodeName; // 0x6c
	FString ModeCodeName; // 0x7c
	FString SeasonGroup; // 0x8c
	uint32_t SeasonHistory : 1; // 0x9c
	uint32_t IsRegularMode : 1; // 0x9c
	FTimeData ModeStart; // 0xa0
	FTimeData ModeEnd; // 0xa8
	int32_t PlacementMatchCount; // 0xb0
	int32_t DefaultTierPoint; // 0xb4
};

struct UParticleModuleSizeMultiplyVelocity : UParticleModuleSizeBase {
	FRawDistributionVector VelocityMultiplier; // 0x68
	uint32_t MultiplyX : 1; // 0x8c
	uint32_t MultiplyY : 1; // 0x8c
	uint32_t MultiplyZ : 1; // 0x8c
	FVector CapMaxSize; // 0x90
	FVector CapMinSize; // 0x9c
};

struct UWindowsClient : UClient {
	UAudioDevice* AudioDeviceClass; // 0x1e4
	int32_t AllowJoystickInput; // 0x21c
};

struct UPrimitiveComponentFactory : UObject {
	uint32_t CollideActors : 1; // 0x60
	uint32_t BlockActors : 1; // 0x60
	uint32_t BlockZeroExtent : 1; // 0x60
	uint32_t BlockNonZeroExtent : 1; // 0x60
	uint32_t BlockRigidBody : 1; // 0x60
	uint32_t HiddenGame : 1; // 0x60
	uint32_t HiddenEditor : 1; // 0x60
	uint32_t CastShadow : 1; // 0x60
};

struct UCombatFrontEnd_SpecialGoodsInfoPopup : UCombatFrontEnd_Object {
	DelegateProperty __SpecialGoodsSort__Delegate; // 0xd0
};

struct UBookMark : UObject {
	FVector Location; // 0x60
	FRotator Rotation; // 0x6c
	TArray<FString> HiddenLevels; // 0x78
};

struct UCombatPassiveSkill : UCombatSkill {
	float MaxHealthRate_Buff; // 0x80
	float MaxAutoCureHealthModifier_Buff; // 0x84
	float HealthCureRate_Buff; // 0x88
	float AddMainAmmo_Buff; // 0x8c
	float AddSubAmmo_Buff; // 0x90
	float AddMainMagazineAmmo_Buff; // 0x94
	float AddSubMagazineAmmo_Buff; // 0x98
	float MaxMainMagazineAmmo_Buff; // 0x9c
	float MaxSubMagazineAmmo_Buff; // 0xa0
	float WeaponReloadSpeedRate_Buff; // 0xa4
	float WeaponChangeRate_Buff; // 0xa8
	float GroundCrouchSpeedRate_Buff; // 0xac
	float GroundWalkingSpeedRate_Buff; // 0xb0
	float GroundRunSpeedRate_Buff; // 0xb4
	float GroundAccelationRate_Buff; // 0xb8
	float GunAttackRate_Buff; // 0xbc
	float MeleeAttackRate_Buff; // 0xc0
	float ExplosiveAttackRate_Buff; // 0xc4
	float GunGuardRate_Buff; // 0xc8
	float MeleeGuardRate_Buff; // 0xcc
	float ExplosiveGuardRate_Buff; // 0xd0
	float DetailedRadarDistance_Buff; // 0xd4
	float RadarRange_Buff; // 0xd8
	int32_t AddGrenade_Buff; // 0xdc
};

struct UNetConnection : UPlayer {
	TArray<ObjectProperty> Children; // 0xb080
};

struct UActorFactorySkeletalMesh : UActorFactory {
	ObjectProperty SkeletalMesh; // 0x9c
	ObjectProperty AnimSet; // 0xa4
	FName AnimSequenceName; // 0xac
};

struct ACombatRescueGameBase : ACombatPVPGame {
	WordProperty LastMissionTime; // 0x788
};

struct UApexStaticDestructibleComponent : UApexStaticComponent {
	float SleepEnergyThreshold; // 0x27c
	float SleepDamping; // 0x280
	FPointer ApexDestructibleActor; // 0x284
	FPointer ApexDestructiblePreview; // 0x28c
	uint32_t bIsThumbnailComponent : 1; // 0x294
};

struct UCombatDemolitionMovie : UCombatTeamGameMovie {
	ObjectProperty BombContainer; // 0xad0
	int32_t BombsiteCount; // 0xad8
	int32_t BombCount; // 0xadc
	uint32_t bUpdateEquippedBomb : 1; // 0xae0
	uint32_t bUpdateEquippedBombSite : 1; // 0xae0
	uint32_t bIsDisplayedBombLimitTime : 1; // 0xae0
	uint32_t bStartSpectDefuseUI : 1; // 0xae0
	int32_t LastBombDefuseTimeCount; // 0xae4
};

struct UParticleModuleUberRainDrops : UParticleModuleUberBase {
	float LifetimeMin; // 0x78
	float LifetimeMax; // 0x7c
	FVector StartSizeMin; // 0x80
	FVector StartSizeMax; // 0x8c
	FVector StartVelocityMin; // 0x98
	FVector StartVelocityMax; // 0xa4
	float StartVelocityRadialMin; // 0xb0
	float StartVelocityRadialMax; // 0xb4
	FVector ColorOverLife; // 0xb8
	float AlphaOverLife; // 0xc4
	uint32_t bIsUsingCylinder : 1; // 0xc8
	uint32_t bPositive_X : 1; // 0xc8
	uint32_t bPositive_Y : 1; // 0xc8
	uint32_t bPositive_Z : 1; // 0xc8
	uint32_t bNegative_X : 1; // 0xc8
	uint32_t bNegative_Y : 1; // 0xc8
	uint32_t bNegative_Z : 1; // 0xc8
	uint32_t bSurfaceOnly : 1; // 0xc8
	uint32_t bVelocity : 1; // 0xc8
	uint32_t bRadialVelocity : 1; // 0xc8
	float PC_VelocityScale; // 0xcc
	FVector PC_StartLocation; // 0xd0
	float PC_StartRadius; // 0xdc
	float PC_StartHeight; // 0xe0
	CylinderHeightAxis PC_HeightAxis; // 0xe4
	FVector StartLocationMin; // 0xe8
	FVector StartLocationMax; // 0xf4
};

struct UCombatHUD_TacticalMapAndScoreboard : UCombatHUDEntity_Base {
	ObjectProperty Radar_LPIconMC; // 0xc0
	ObjectProperty CompassMC; // 0xc8
	ObjectProperty TopDepthIconContainerMC; // 0xd0
	ObjectProperty FriendlyIconContainerMC; // 0xd8
	ObjectProperty EnemyIconContainerMC; // 0xe0
	ObjectProperty ObjectIconContainerMC; // 0xe8
	ObjectProperty NameplateContainerMC; // 0xf0
	int32_t NameplateLocDelta_X; // 0xf8
	int32_t NameplateLocDelta_Y; // 0xfc
	int32_t ChampionshipObserverNameplateLocDelta_X; // 0x100
	int32_t ChampionshipObserverNameplateLocDelta_Y; // 0x104
	ObjectProperty MapMC; // 0x108
	FMatrix IconMatrix; // 0x110
	FIconData IconDatas[0x6]; // 0x150
	FNameplateData NameplateIconDatas; // 0x270
	uint32_t bIgnoreMinimap : 1; // 0x2a0
	uint32_t bIgnoreWholeMap : 1; // 0x2a0
	uint32_t bIgnoreScoreboard : 1; // 0x2a0
	EScoreboardType scoreboardType; // 0x2a4
	FString LastModeName; // 0x2a8
	DelegateProperty __OnUpdateTacticalMap__Delegate; // 0x2b8
};

struct UParticleSystemComponent : UPrimitiveComponent {
	ObjectProperty Template; // 0x250
	uint32_t bForceUnlitParticle : 1; // 0x258
	uint32_t bAutoActivate : 1; // 0x258
	uint32_t bWasCompleted : 1; // 0x258
	uint32_t bSuppressSpawning : 1; // 0x258
	uint32_t bWasDeactivated : 1; // 0x258
	uint32_t bResetOnDetach : 1; // 0x258
	uint32_t bUpdateOnDedicatedServer : 1; // 0x258
	uint32_t bJustAttached : 1; // 0x258
	uint32_t bIsActive : 1; // 0x258
	uint32_t bHasBeenActivated : 1; // 0x258
	uint32_t bWarmingUp : 1; // 0x258
	uint32_t bIsCachedInPool : 1; // 0x258
	uint32_t bOverrideLODMethod : 1; // 0x258
	uint32_t bSkipUpdateDynamicDataDuringTick : 1; // 0x258
	uint32_t bSkipBoundsUpdate : 1; // 0x258
	uint32_t bUpdateComponentInTick : 1; // 0x258
	uint32_t bDeferredBeamUpdate : 1; // 0x258
	uint32_t bForcedInActive : 1; // 0x258
	uint32_t bIsWarmingUp : 1; // 0x258
	uint32_t bIsViewRelevanceDirty : 1; // 0x258
	uint32_t bRecacheViewRelevance : 1; // 0x258
	uint32_t bLODUpdatePending : 1; // 0x258
	uint32_t bSkipSpawnCountCheck : 1; // 0x258
	UParticleLightEnvironmentComponent* LightEnvironmentClass; // 0x25c
	ObjectProperty LightEnvironmentSharedInstigator; // 0x264
	int32_t MaxLightEnvironmentPooledReuses; // 0x26c
	TArray<FPointer> EmitterInstances; // 0x270
	TArray<ComponentProperty> SMComponents; // 0x280
	TArray<ObjectProperty> SMMaterialInterfaces; // 0x290
	TArray<ComponentProperty> SkelMeshComponents; // 0x2a0
	TArray<FViewParticleEmitterInstanceMotionBlurInfo> ViewMBInfoArray; // 0x2b0
	TArray<FParticleSysParam> InstanceParameters; // 0x2c0
	FVector OldPosition; // 0x2d0
	FVector PartSysVelocity; // 0x2dc
	float WarmupTime; // 0x2e8
	float WarmupTickRate; // 0x2ec
	int32_t LODLevel; // 0x2f0
	float SecondsBeforeInactive; // 0x2f4
	float TimeSinceLastForceUpdateTransform; // 0x2f8
	float MaxTimeBeforeForceUpdateTransform; // 0x2fc
	float AccumTickTime; // 0x300
	ParticleSystemLODMethod LODMethod; // 0x304
	ParticleReplayState ReplayState; // 0x305
	int32_t CurrentUpdateFixedLOD; // 0x308
	TArray<FMaterialViewRelevance> CachedViewRelevanceFlags; // 0x30c
	TArray<ObjectProperty> ReplayClips; // 0x31c
	int32_t ReplayClipIDNumber; // 0x32c
	int32_t ReplayFrameIndex; // 0x330
	float AccumLODDistanceCheckTime; // 0x334
	TArray<FParticleEventSpawnData> SpawnEvents; // 0x338
	TArray<FParticleEventDeathData> DeathEvents; // 0x348
	TArray<FParticleEventCollideData> CollisionEvents; // 0x358
	TArray<FParticleEventKismetData> KismetEvents; // 0x368
	TArray<FParticleEventAttractorCollideData> AttractorCollisionEvents; // 0x378
	FPointer ReleaseResourcesFence; // 0x388
	float CustomTimeDilation; // 0x390
	float EmitterDelay; // 0x394
	ComponentProperty RadialBlurComp; // 0x398
	DelegateProperty __OnSystemFinished__Delegate; // 0x3a0
};

struct UPhysicsAssetInstance : UObject {
	ObjectProperty Owner; // 0x60
	int32_t RootBodyIndex; // 0x68
	TArray<ObjectProperty> Bodies; // 0x6c
	TArray<ObjectProperty> Constraints; // 0x7c
	FMap_Mirror CollisionDisableTable; // 0x8c
	float LinearSpringScale; // 0xd4
	float LinearDampingScale; // 0xd8
	float LinearForceLimitScale; // 0xdc
	float AngularSpringScale; // 0xe0
	float AngularDampingScale; // 0xe4
	float AngularForceLimitScale; // 0xe8
	uint32_t bInitBodies : 1; // 0xec
};

struct UCombatServerRewardData : UCombatRewardDataBase {
	int32_t AssistInLife; // 0x1b8
	float LastMultiKillTime; // 0x1bc
	char MultiKillCount; // 0x1c0
	TArray<FDamagePerPlayer> DamagePerPlayers; // 0x1c4
	int32_t ConsecutiveDeathCount; // 0x1d4
	float LastDeathTime; // 0x1d8
	int32_t BestKillCount; // 0x1dc
	int32_t LastLifeKillCount; // 0x1e0
	ObjectProperty TeamRevengeTarget; // 0x1e4
	ObjectProperty RevengeTarget; // 0x1ec
};

struct ADecalManager : AActor {
	ComponentProperty DecalTemplate; // 0x244
	TArray<ComponentProperty> PoolDecals; // 0x24c
	int32_t MaxActiveDecals; // 0x25c
	float DecalLifeSpan; // 0x260
	float DecalDepthBias; // 0x264
	FVector2D DecalBlendRange; // 0x268
	TArray<FActiveDecalInfo> ActiveDecals; // 0x270
};

struct UApexComponentBase : UMeshComponent {
	FPointer ComponentBaseResources; // 0x260
	FRenderCommandFence_Mirror ReleaseResourcesFence; // 0x268
	ObjectProperty Asset; // 0x26c
	FColor WireframeColor; // 0x274
	uint32_t bAssetChanged : 1; // 0x278
};

struct USeqAct_IsInObjectList : USequenceAction {
	uint32_t bCheckForAllObjects : 1; // 0x108
	uint32_t bObjectFound : 1; // 0x108
};

struct UParticleModuleTypeDataTrail2 : UParticleModuleTypeDataBase {
	int32_t TessellationFactor; // 0x68
	float TessellationFactorDistance; // 0x6c
	float TessellationStrength; // 0x70
	int32_t TextureTile; // 0x74
	int32_t Sheets; // 0x78
	int32_t MaxTrailCount; // 0x7c
	int32_t MaxParticleInTrailCount; // 0x80
	uint32_t bClipSourceSegement : 1; // 0x84
	uint32_t bClearTangents : 1; // 0x84
	uint32_t RenderGeometry : 1; // 0x84
	uint32_t RenderDirectLine : 1; // 0x84
	uint32_t RenderLines : 1; // 0x84
	uint32_t RenderTessellation : 1; // 0x84
};

struct UUIGameInfoSummary : UUIResourceDataProvider {
	FString ClassName; // 0x94
	FString GameAcronym; // 0xa4
	FString MapPrefix; // 0xb4
	uint32_t bIsTeamGame : 1; // 0xc4
	uint32_t bIsDisabled : 1; // 0xc4
	FString GameSettingsClassName; // 0xc8
	FString GameName; // 0xd8
	FString Description; // 0xe8
};

struct UMaterialExpressionTextureSample : UMaterialExpression {
	ObjectProperty Texture; // 0xb0
	FExpressionInput Coordinates; // 0xb8
	FExpressionInput TextureObject; // 0xec
};

struct UParticleModuleTypeDataRibbon : UParticleModuleTypeDataBase {
	int32_t MaxTessellationBetweenParticles; // 0x68
	int32_t SheetsPerTrail; // 0x6c
	int32_t MaxTrailCount; // 0x70
	int32_t MaxParticleInTrailCount; // 0x74
	uint32_t bDeadTrailsOnDeactivate : 1; // 0x78
	uint32_t bDeadTrailsOnSourceLoss : 1; // 0x78
	uint32_t bClipSourceSegement : 1; // 0x78
	uint32_t bEnablePreviousTangentRecalculation : 1; // 0x78
	uint32_t bTangentRecalculationEveryFrame : 1; // 0x78
	uint32_t bSpawnInitialParticle : 1; // 0x78
	uint32_t bRenderGeometry : 1; // 0x78
	uint32_t bRenderSpawnPoints : 1; // 0x78
	uint32_t bRenderTangents : 1; // 0x78
	uint32_t bRenderTessellation : 1; // 0x78
	uint32_t bEnableTangentDiffInterpScale : 1; // 0x78
	ETrailsRenderAxisOption RenderAxis; // 0x7c
	float TangentSpawningScalar; // 0x80
	float TilingDistance; // 0x84
	float DistanceTessellationStepSize; // 0x88
	float TangentTessellationScalar; // 0x8c
};

struct UGripBTScriptNodeCache : UObject {
	TArray<ObjectProperty> ScriptNodes; // 0x60
};

struct UCombatDataTableRefCompetitivePenalty : UCombatDataTableType {
	FString ModeGroupCodename; // 0x6c
	int32_t AcceptPoint; // 0x7c
	int32_t AcceptAlertTime; // 0x80
	int32_t AcceptTime; // 0x84
	int32_t AcceptInterval; // 0x88
	int32_t DecreasePoint; // 0x8c
};

struct UOnlineGameSettings : USettings {
	int32_t NumPublicConnections; // 0xa0
	int32_t NumPrivateConnections; // 0xa4
	int32_t NumOpenPublicConnections; // 0xa8
	int32_t NumOpenPrivateConnections; // 0xac
	FQWord ServerNonce; // 0xb0
	uint32_t bShouldAdvertise : 1; // 0xb8
	uint32_t bIsLanMatch : 1; // 0xb8
	uint32_t bUsesStats : 1; // 0xb8
	uint32_t bAllowJoinInProgress : 1; // 0xb8
	uint32_t bAllowInvites : 1; // 0xb8
	uint32_t bUsesPresence : 1; // 0xb8
	uint32_t bAllowJoinViaPresence : 1; // 0xb8
	uint32_t bAllowJoinViaPresenceFriendsOnly : 1; // 0xb8
	uint32_t bUsesArbitration : 1; // 0xb8
	uint32_t bAntiCheatProtected : 1; // 0xb8
	uint32_t bWasFromInvite : 1; // 0xb8
	uint32_t bIsDedicated : 1; // 0xb8
	uint32_t bHasSkillUpdateInProgress : 1; // 0xb8
	uint32_t bShouldShrinkArbitratedSessions : 1; // 0xb8
	FString OwningPlayerName; // 0xbc
	FUniqueNetId OwningPlayerId; // 0xcc
	int32_t PingInMs; // 0xd4
	float MatchQuality; // 0xd8
	EOnlineGameState GameState; // 0xdc
	int32_t BuildUniqueId; // 0xe0
};

struct UUIDataProvider_OnlinePlayerStorage : UUIDataProvider_OnlinePlayerDataBase {
	ObjectProperty Profile; // 0x74
	FName ProviderName; // 0x7c
	uint32_t bWasErrorLastRead : 1; // 0x84
	uint32_t bIsExternalUIOpen : 1; // 0x84
	uint32_t bNeedsDeferredRefresh : 1; // 0x84
	TArray<FPlayerStorageArrayProvider> PlayerStorageArrayProviders; // 0x88
	int32_t DeviceStorageSizeNeeded; // 0x98
};

struct ACombatLCTFModePRI : ACombatPlayerReplicationInfo {
	ObjectProperty CTFFlag; // 0x520
	int32_t TakeCount; // 0x528
	int32_t TakeFlagSpawnID; // 0x52c
	TArray<FLimitAddScoreCountStruct> AddScoreCountList; // 0x530
	uint32_t bHaveCTFFlag : 1; // 0x540
	uint32_t bFirstExtortion : 1; // 0x540
	WordProperty TotalCTFScore; // 0x544
};

struct UParticleModuleRadialBlur : UParticleModuleLocationPrimitiveBase {
	ObjectProperty OpacityMaterial; // 0xb4
	FRawDistributionFloat BlurScale; // 0xbc
	FRawDistributionFloat BlurFalloffExponent; // 0xe0
	FRawDistributionFloat BlurOpacity; // 0x104
	float MaxCullDistance; // 0x128
	float DistanceFalloffExponent; // 0x12c
};

struct UCombatFrontEnd_CallingCardPage : UCombatFrontEnd_Object {
	FFrontEndButtonStruct CallingCardButtonInfo[0x2]; // 0xd0
	FFrontEndButtonStruct CallingCardTabInfo[0x2]; // 0x100
	TArray<FCallingCardInfo> CallingCardInfoList; // 0x130
	char SHOW_CALLINGCARD_COUNT; // 0x140
	int32_t selectID; // 0x144
};

struct UMaterialExpressionTextureSampleParameterEnvCube : UMaterialExpressionTextureSampleParameterCubeLOD {
	EEnvCubeType BoundingType; // 0x178
};

struct AInternetLink : AInfo {
	ELinkMode LinkMode; // 0x244
	ELineMode InLineMode; // 0x245
	ELineMode OutLineMode; // 0x246
	EReceiveMode ReceiveMode; // 0x247
	FPointer Socket; // 0x248
	int32_t Port; // 0x250
	FPointer RemoteSocket; // 0x254
	FPointer PrivateResolveInfo; // 0x25c
	int32_t DataPending; // 0x264
};

struct APhysicsVolume : AVolume {
	FVector ZoneVelocity; // 0x280
	uint32_t bVelocityAffectsWalking : 1; // 0x28c
	uint32_t bPainCausing : 1; // 0x28c
	uint32_t bAIShouldIgnorePain : 1; // 0x28c
	uint32_t bEntryPain : 1; // 0x28c
	uint32_t BACKUP_bPainCausing : 1; // 0x28c
	uint32_t bDestructive : 1; // 0x28c
	uint32_t bNoInventory : 1; // 0x28c
	uint32_t bMoveProjectiles : 1; // 0x28c
	uint32_t bBounceVelocity : 1; // 0x28c
	uint32_t bNeutralZone : 1; // 0x28c
	uint32_t bCrowdAgentsPlayDeathAnim : 1; // 0x28c
	uint32_t bPhysicsOnContact : 1; // 0x28c
	uint32_t bWaterVolume : 1; // 0x28c
	float GroundFriction; // 0x290
	float TerminalVelocity; // 0x294
	float DamagePerSec; // 0x298
	UDamageType* DamageType; // 0x29c
	int32_t Priority; // 0x2a4
	float FluidFriction; // 0x2a8
	float PainInterval; // 0x2ac
	float RigidBodyDamping; // 0x2b0
	float MaxDampingForce; // 0x2b4
	ObjectProperty PainTimer; // 0x2b8
	ObjectProperty DamageInstigator; // 0x2c0
	ObjectProperty NextPhysicsVolume; // 0x2c8
};

struct USeqCond_IncrementFloat : USequenceCondition {
	float IncrementAmount; // 0xec
	float ValueA; // 0xf0
	float ValueB; // 0xf4
};

struct UInterpTrackInstFaceFX : UInterpTrackInst {
	uint32_t bFirstUpdate : 1; // 0x60
	float LastUpdatePosition; // 0x64
};

struct ACombatGuy_NPC : ACombatGuyBase {
	FPointer VfTable_ICCSPawn; // 0x1128
	float MaxAccelRate; // 0x1130
	float MaxAirSpeed; // 0x1134
	float MaxGroundSpeed; // 0x1138
	float MeshScale; // 0x113c
	FString PrimaryWeapon; // 0x1140
	FString SecondaryWeapon; // 0x1150
	FString MeleeWeapon; // 0x1160
	ECCSMovementType MovementType; // 0x1170
	ECCSAlertnessState AlertnessState; // 0x1171
	ECCSCoverPose WantedCoverPose; // 0x1172
	ECCSCoverPose CurrentCoverPose; // 0x1173
	uint32_t bShouldCover : 1; // 0x1174
	uint32_t bInCover : 1; // 0x1174
	uint32_t ThrowRecheck : 1; // 0x1174
	uint32_t bIsReplicateCurTargetName : 1; // 0x1174
	float CoverPct; // 0x1178
	float CoverPoseBlendTimeOverride; // 0x117c
	FVector2D AimPitchRange; // 0x1180
	FVector2D AimYawRange; // 0x1188
	float FollowAimingYawInterpSpeed; // 0x1190
	float TurnToTargetYawInterpSpeed; // 0x1194
	float DefaultRotationYawRate; // 0x1198
	ObjectProperty LookAtCtrl2; // 0x119c
	ObjectProperty LookAtMount; // 0x11a4
	ObjectProperty LookAtMount2; // 0x11ac
	ObjectProperty AITarget; // 0x11b4
	int32_t AINameStringIndex; // 0x11bc
	ObjectProperty AmbientSoundCue; // 0x11c0
	ComponentProperty AmbientSoundComponent; // 0x11c8
	FString RepCurTargetName; // 0x11d0
	FString OldCurTargetName; // 0x11e0
};

struct UMobilePlayerInput : UPlayerInput {
	FTouchData Touches[0x5]; // 0x2ec
	ObjectProperty InteractiveObject; // 0x47c
	FDouble InteractiveObjectLastTime; // 0x484
	TArray<FMobileInputGroup> MobileInputGroups; // 0x48c
	int32_t CurrentMobileGroup; // 0x49c
	TArray<ObjectProperty> MobileInputZones; // 0x4a0
	TArray<FMobileInputZoneClassMap> MobileInputZoneClasses; // 0x4b0
	float MobilePitch; // 0x4c0
	float MobilePitchCenter; // 0x4c4
	float MobilePitchMultiplier; // 0x4c8
	float MobileYaw; // 0x4cc
	float MobileYawCenter; // 0x4d0
	float MobileYawMultiplier; // 0x4d4
	float MobilePitchDeadzoneSize; // 0x4d8
	float MobileYawDeadzoneSize; // 0x4dc
	float MobileDoubleTapTime; // 0x4e0
	float MobileMinHoldForTap; // 0x4e4
	float MobileTapRepeatTime; // 0x4e8
	uint32_t bAllowTouchesInCinematic : 1; // 0x4ec
	uint32_t bDisableTouchInput : 1; // 0x4ec
	uint32_t bAbsoluteTouchLocations : 1; // 0x4ec
	uint32_t bFakeMobileTouches : 1; // 0x4ec
	uint32_t bDisableSceneRender : 1; // 0x4ec
	float ZoneTimeout; // 0x4f0
	TArray<ObjectProperty> MobileMenuStack; // 0x4f4
	FString NativeDebugString; // 0x504
	float MobileInactiveTime; // 0x514
	TArray<ObjectProperty> MobileSeqEventHandlers; // 0x518
	TArray<ObjectProperty> MobileRawInputSeqEventHandlers; // 0x528
	FVector2D MobileViewportOffset; // 0x538
	FVector2D MobileViewportSize; // 0x540
	DelegateProperty __OnTouchNotHandledInMenu__Delegate; // 0x548
	DelegateProperty __OnPreviewTouch__Delegate; // 0x558
	DelegateProperty __OnInputTouch__Delegate; // 0x568
};

struct UAnimTree : UAnimNodeBlendBase {
	ObjectProperty AnimTreeTemplate; // 0x100
	uint32_t bEnablePooling : 1; // 0x108
	uint32_t bUseSavedPose : 1; // 0x108
	uint32_t bBeingEdited : 1; // 0x108
	uint32_t bParentNodeArrayBuilt : 1; // 0x108
	uint32_t bRebuildAnimTickArray : 1; // 0x108
	TArray<FAnimGroup> AnimGroups; // 0x10c
	TArray<FName> PrioritizedSkelBranches; // 0x11c
	TArray<FName> ComposePrePassBoneNames; // 0x12c
	TArray<FName> ComposePostPassBoneNames; // 0x13c
	TArray<ObjectProperty> RootMorphNodes; // 0x14c
	TArray<FSkelControlListHead> SkelControlLists; // 0x15c
	TArray<FBoneAtom> SavedPose; // 0x16c
	TArray<ObjectProperty> AnimTickArray; // 0x17c
	float ElapsedBlendTime; // 0x18c
	float AnimsetsBlendTime; // 0x190
};

struct UFluidSurfaceComponent : UPrimitiveComponent {
	ObjectProperty FluidMaterial; // 0x250
	int32_t LightMapResolution; // 0x258
	FLightmassPrimitiveSettings LightmassSettings; // 0x25c
	uint32_t EnableSimulation : 1; // 0x278
	uint32_t EnableDetail : 1; // 0x278
	uint32_t bTiling : 1; // 0x278
	uint32_t bPause : 1; // 0x278
	uint32_t bShowSimulationNormals : 1; // 0x278
	uint32_t bShowSimulationPosition : 1; // 0x278
	uint32_t bShowDetailNormals : 1; // 0x278
	uint32_t bShowDetailPosition : 1; // 0x278
	uint32_t bShowFluidSimulation : 1; // 0x278
	uint32_t bShowFluidDetail : 1; // 0x278
	uint32_t bTestRipple : 1; // 0x278
	uint32_t bTestRippleCenterOnDetail : 1; // 0x278
	int32_t SimulationQuadsX; // 0x27c
	int32_t SimulationQuadsY; // 0x280
	float GridSpacing; // 0x284
	float GridSpacingLowRes; // 0x288
	ObjectProperty TargetSimulation; // 0x28c
	float GPUTessellationFactor; // 0x294
	float FluidDamping; // 0x298
	float FluidTravelSpeed; // 0x29c
	float FluidHeightScale; // 0x2a0
	float FluidUpdateRate; // 0x2a4
	float ForceImpact; // 0x2a8
	float ForceContinuous; // 0x2ac
	float LightingContrast; // 0x2b0
	ObjectProperty TargetDetail; // 0x2b4
	float DeactivationDistance; // 0x2bc
	int32_t DetailResolution; // 0x2c0
	float DetailSize; // 0x2c4
	float DetailDamping; // 0x2c8
	float DetailTravelSpeed; // 0x2cc
	float DetailTransfer; // 0x2d0
	float DetailHeightScale; // 0x2d4
	float DetailUpdateRate; // 0x2d8
	float NormalLength; // 0x2dc
	float TestRippleSpeed; // 0x2e0
	float TestRippleFrequency; // 0x2e4
	float TestRippleRadius; // 0x2e8
	float FluidWidth; // 0x2ec
	float FluidHeight; // 0x2f0
	float TestRippleTime; // 0x2f4
	float TestRippleAngle; // 0x2f8
	float DeactivationTimer; // 0x2fc
	float ViewDistance; // 0x300
	FVector SimulationPosition; // 0x304
	FVector DetailPosition; // 0x310
	TArray<char> ClampMap; // 0x31c
	TArray<ObjectProperty> ShadowMaps; // 0x32c
	FLightMapRef LightMap; // 0x33c
	FPointer FluidSimulation; // 0x344
};

struct ACombatPendingPC : APlayerController {
	uint32_t bUpdateWorldCam : 1; // 0x740
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	ObjectProperty PSTemplate; // 0x60
	uint32_t bIsExtremeContent : 1; // 0x68
	uint32_t bAttach : 1; // 0x68
	uint32_t bPreview : 1; // 0x68
	uint32_t bSkipIfOwnerIsHidden : 1; // 0x68
	ObjectProperty PSNonExtremeContentTemplate; // 0x6c
	FName SocketName; // 0x74
	FName BoneName; // 0x7c
	FName BoneSocketModuleActorName; // 0x84
};

struct UCombatSkill : UObject {
	ESkillType Skilltype; // 0x60
	char SkillGroup; // 0x61
	ObjectProperty SkillOwner; // 0x64
	FString SkillCodeName; // 0x6c
	int32_t refIndex; // 0x7c
};

struct UCombatFrontEnd_Storage : UCombatFrontEnd_Scene {
	TArray<FLabelInfo> LabelList; // 0xd0
	FButtonInfo ButtonList[0x9]; // 0xe0
	FMoneyInfo MoneyList[0x6]; // 0x224
	ObjectProperty MailTran; // 0x2e4
	int32_t TabType; // 0x2ec
	int32_t ShowPageNum; // 0x2f0
	int32_t TotalPage; // 0x2f4
	int32_t selectID; // 0x2f8
	int32_t MaxCheckCount; // 0x2fc
	uint32_t bAllCheck : 1; // 0x300
	uint32_t bShowReceiveFailedDialog : 1; // 0x300
	TArray<int32_t> CheckList; // 0x304
