// Created by BlueFire1337
// Updated 2021-11-22
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x54c6cc0;
	constexpr auto GObjects = 0x54df468;
	constexpr auto GWorld = 0x5618fc0;
}

struct ALandscapeMeshProxyActor : AActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x228
};

struct USourceEffectEQPreset : USoundEffectSourcePreset {
	FSourceEffectEQSettings Settings; // 0xa0
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xb0
};

struct USoundSubmixWithParentBase : USoundSubmixBase {
	USoundSubmixBase* ParentSubmix; // 0x38
};

struct UTigerClientRewardTrackChallenges : UObject {
	TArray<FTigerItemId> RewardIds; // 0x28
	int32_t RewardHighlightIndex; // 0x38
	UTigerPersistentPlayerState* PersistentPlayerState; // 0x40
};

struct UTigerCameraPreset : UObject {
	float FOV; // 0x28
	float SpringArmLength; // 0x2c
	FVector CameraOffset; // 0x30
	FVector TargetOffset; // 0x3c
	UCurveFloat* TransitionCurveIn; // 0x48
	UCurveFloat* TransitionCurveOutOverride; // 0x50
	UCurveFloat* RotatePawnTransition; // 0x58
	float SidewaysCameraMirrorTime; // 0x60
	FVector CameraLagSpeed; // 0x64
	FVector CameraLagMaxDistance; // 0x70
	float CameraRotationLagSpeed; // 0x7c
	float CameraSensitivityModifier; // 0x80
	bool bUseCameraSensitivtyModifierDuringFade; // 0x84
	UTigerCameraBehavior* CameraBehavior; // 0x88
	UMatineeCameraShake* CameraShakeBehaviour; // 0x90
	bool bShortenSpringArmWhenLookingUp; // 0x98
	float ViewPitchMax; // 0x9c
	float ArmLengthInterpSpeed; // 0xa0
};

struct UTigerJudgeSwingData : UDataAsset {
	TMap<FName, FTigerJudgeSwingCollisionInfo> SwingCollisionInfos; // 0x30
};

struct UMaterialExpressionGIReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct UTigerMacroExperienceAsset : UDataAsset {
	TMap<ETigerPlayerEvent, int32_t> EventMacroExperience; // 0x30
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UAnimationSettings : UDeveloperSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct UMaterialExpressionLandscapeLayerSample : UMaterialExpression {
	FName ParameterName; // 0x40
	float PreviewWeight; // 0x48
	FGuid ExpressionGUID; // 0x4c
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UTigerAiMoveAsyncTask : UBTTask_BlackboardBase {
	float AcceptableRadiusSq; // 0x98
	float ObservedBlackboardValueToleranceSq; // 0x9c
};

struct ATBP_BuffPostProcess_BlindingBeauty_C : ATBP_BuffPostProcess_Master_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UCurveFloat* FlashCurve; // 0x270
};

struct UTigerGeneralUserSettings : UObject {
	UAkAudioEvent* EnableAtmosMixEvent; // 0x28
	UAkAudioEvent* EnableHeadphonesEvent; // 0x30
	FMulticastInlineDelegate OnQualityOptionChanged; // 0x38
	FMulticastInlineDelegate OnDisplaySettingsApplied; // 0x48
	FMulticastInlineDelegate OnGraphicsSettingsApplied; // 0x58
	FMulticastInlineDelegate OnLanguageTextSettingChanged; // 0x68
	FTigerStreamerModeSettings UserStreamerModeSettings; // 0x80
	FTigerStreamerModeSettings DefaultStreamerModeSettings; // 0x8c
	FTigerAudioSettings UserAudioSettings; // 0x98
	FTigerAudioSettings DefaultAudioSettings; // 0xe8
	FTigerLanguageSettings UserLanguageSettings; // 0x138
	FTigerLanguageSettings DefaultLanguageSettings; // 0x160
	FTigerGameplaySettings UserGameplaySettings; // 0x188
	FTigerGameplaySettings DefaultGameplaySettings; // 0x190
	TArray<FString> AvailableAudioLanguages; // 0x198
	TMap<FString, FString> LanguageDisplayName; // 0x1a8
	FTigerDisplaySettings TempDisplaySettings; // 0x208
	FTigerDisplaySettings UserDisplaySettings; // 0x230
	FTigerDisplaySettings DefaultDisplaySettings; // 0x258
	FTigerGraphicsSettings TempGraphicsSettings; // 0x2b8
	FTigerGraphicsSettings UserGraphicsSettings; // 0x304
	FTigerGraphicsSettings DefaultGraphicsSettings; // 0x350
	FTigerGraphicsSettingsPS5 TempGraphicsSettingsPS5; // 0x39c
	FTigerGraphicsSettingsPS5 UserGraphicsSettingsPS5; // 0x3ac
	FTigerGraphicsSettingsPS5 DefaultGraphicsSettingsPS5; // 0x3bc
};

struct UTBP_WallJumpEffect_C : UTigerCharacterEffect {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
};

struct UTBP_FlowBoot_C : UTigerGameFlowStateBoot {
	FPointerToUberGraphFrame UberGraphFrame; // 0x80
	UTBP_UI_FirstTimeArchetypeSelection_C* FirstTimeArchetypeSelectionUI; // 0x88
	bool bIsFirstBlackScreenLaunch; // 0x90
	UTBP_UI_TitleScreen_C* TitleScreenUI; // 0x98
	UObject* ElysiumRef; // 0xa0
	UTBP_UI_InvalidGameClient_C* InvalidClientUI; // 0xa8
	UTigerPsoCacheUI* PsoCacheUI; // 0xb0
};

struct UParticleModuleLocationBoneSocket : UParticleModuleLocationBase {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x5c
	int32_t NumPreSelectedIndices; // 0x64
};

struct UTigerRangedWeaponComponent : UActorComponent {
	FMulticastInlineDelegate OnShowCrosshairAmmoState; // 0xb0
	FMulticastInlineDelegate OnReloadStart; // 0xc0
	FMulticastInlineDelegate OnReloadFinished; // 0xd0
	FMulticastInlineDelegate OnReloadAborted; // 0xe0
	FMulticastInlineDelegate OnBurstCompleted; // 0xf0
	FMulticastInlineDelegate OnLowAmmo; // 0x100
	FMulticastInlineDelegate OnRangedWeaponEquipped; // 0x110
	FMulticastInlineDelegate OnAimChanged; // 0x120
	UTigerBodyPartProjectileDamageModifiersAsset* BodyPartDamageModifiersAsset; // 0x130
	ATigerPlayer* TigerPlayer; // 0x148
	UDataTable* RangedWeaponsDatatable; // 0x150
	UStaticMesh* ImpactHelperMesh; // 0x158
	UAkAudioEvent* GotHitEvent; // 0x160
	UAkAudioEvent* FireModeSwitchEvent; // 0x168
	UTigerRangedWeapon* EquippedWeaponType; // 0x170
	UAnimMontage* LastFireAnimationMontage; // 0x178
	FTimerHandle ReloadWeaponTimerHandle; // 0x1e0
	bool bIsFiring; // 0x1ea
	bool bWantsToFire; // 0x1eb
	bool bIsAiming; // 0x1ec
	UStaticMeshComponent* ImpactHelperMeshComp; // 0x210
	float CoolDownOutOfAmmoAudioEvent; // 0x244
	UTigerAICoordinator* AICoordinator; // 0x270
	TMap<ATigerProjectile*, UTigerProjectilePool*> ProjectilePoolMap; // 0x278
};

struct UTBP_BeardColorCustomization_Master_C : UTigerCharacterBeardColorCustomization {
	FPointerToUberGraphFrame UberGraphFrame; // 0x148
};

struct UTigerAiCheckCanDiablerize : UBTDecorator {
	bool bConditionInvertedOnTick; // 0x68
};

struct ATigerHavenCapturePoint : AActor {
	FText PointActivatedText; // 0x228
	float HavenMarkerHeightOffset; // 0x240
	ATigerHaven* AssignedHaven; // 0x248
	bool bRevealedEveryone; // 0x2cc
};

struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	char bAllowDifferentItemTypes : 1; // 0x60
	char bHasMatchingItemType : 1; // 0x60
	UEnvQueryItemType* ForcedItemType; // 0x68
};

struct UActorSequenceComponent : UActorComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct ATigerShockwaveWall : AActor {
	UBoxComponent* EffectBoxComponent; // 0x230
	FTigerShockwaveWallData ShockwaveData; // 0x238
	FVector TargetLocation; // 0x298
	TWeakObjectPtr<ATigerPlayer> TigerInstigator; // 0x2a4
	float CurrentLifetime; // 0x2ac
	int32_t PowerLevel; // 0x2b0
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UTigerActiveDisciplineConfig : UTigerDisciplineConfigBase {
	int32_t MaxLevel; // 0xe8
	FText CooldownText; // 0xf0
	FText CooldownSuffix; // 0x108
	int32_t MaxCharges; // 0x120
	TArray<float> RechargeTimes; // 0x128
	TArray<float> CooldownTimes; // 0x138
	bool bShouldRotateTowardsCameraOnActivation; // 0x148
	bool bShouldRotateTowardsCameraOnRelease; // 0x149
	float MovementMultiplier; // 0x14c
	float GravityMultiplier; // 0x150
	float PrimaryAINoiseEventRange; // 0x154
	float SecondaryAINoiseEventRange; // 0x158
};

struct UAkGroupValue : UAkAudioType {
	TArray<TSoftObjectPtr<UAkMediaAsset>> MediaDependencies; // 0x40
	uint32_t GroupShortID; // 0x50
};

struct ATigerSharkDeathTriggerVolume : ATriggerVolume {
	AActor* Shark; // 0x260
	FRotator SharkRotation; // 0x268
	FVector SharkSpawnLocationOffset; // 0x274
	float KillDelay; // 0x280
	TArray<ATigerCharacter*> SavedVictims; // 0x288
};

struct ATigerAICAP : ATigerAICAPBase {
	TArray<UTigerAICommandBase*> Commands; // 0x258
};

struct UAISense_Touch : UAISense {
	TArray<FAITouchEvent> RegisteredEvents; // 0x80
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UTigerMasqueradeConsequenceMapMarkerSyncInstance : UTigerMasqueradeConsequenceSyncInstance {
	UUserWidget* MapMarkerClass; // 0x58
	UTigerMapMarkerProxy* MapMarkerProxy; // 0x60
};

struct ATBP_Katana_Reflector_C : ATigerWeaponAbilityReflectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x228
	USceneComponent* Null; // 0x230
	USceneComponent* Scene; // 0x238
	UStaticMeshComponent* StaticMesh; // 0x240
	USceneComponent* Null3; // 0x248
	USceneComponent* Null2; // 0x250
	AActor* ReflectedProjectile; // 0x258
	float Start_time2; // 0x260
	UNiagaraComponent* niagaravar; // 0x268
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct UTigerSafeZoneSettings : UDeveloperSettings {
	FVector2D SafeZoneRelativeScreenSpaceDimensions; // 0x38
	float UIZoneAspectRatio; // 0x40
};

struct UTigerBuffStunBaton : UTigerBuff {
	float StunBonusDamage; // 0x248
	float ChargeGainedOnHit; // 0x24c
	float ChargeGainedPerUpdate; // 0x250
	float PassiveChargeRate; // 0x254
	bool bRegisterMultipleHitsOnChargeUp; // 0x258
	bool bRegisterMultipleHitsOnStun; // 0x259
	UTigerBuffInstance* TBPInstanceBuff; // 0x260
};

struct UGizmoAxisIntervalParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoFloatParameterSource> FloatParameterSource; // 0x48
	float MinParameter; // 0x58
	float MaxParameter; // 0x5c
};

struct UTBP_RangedWeapon_Shotgun_Master_C : UTBP_RangedWeapon_Master_C {
	FVector SpreadOfCurrentShot_1; // 0x204
	int32_t ShotIndex; // 0x210
};

struct UTBP_EyewearCustomization_Master_C : UTigerCharacterEyewearCustomization {
	TMap<ENUM_PiercingNames, bool> VisiblePiercingsFilter; // 0x170
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UTigerDisciplineScouts : UTigerDisciplineAnimTriggered {
	UTigerFamiliarScoutPassive* Server_PassiveComponent; // 0xf0
	ATigerFamiliarScout* Server_SpawnedFamiliar; // 0xf8
	UTigerScoutsConfig* Config; // 0x100
};

struct UReflectionCaptureComponent : USceneComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct UTigerAnimNotifyState_OverrideCanInteractInDodge : UAnimNotifyState {
	UTigerMeleeWeapon* RequiredWeapon; // 0x30
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraShakePlaySpace PlaySpace; // 0x78
};

struct UMaterialExpressionSpeedTree : UMaterialExpression {
	FExpressionInput GeometryInput; // 0x40
	FExpressionInput WindInput; // 0x54
	FExpressionInput LODInput; // 0x68
	FExpressionInput ExtraBendWS; // 0x7c
	ESpeedTreeGeometryType GeometryType; // 0x90
	ESpeedTreeWindType WindType; // 0x91
	ESpeedTreeLODType LODType; // 0x92
	float BillboardThreshold; // 0x94
	bool bAccurateWindVelocities; // 0x98
};

struct UTigerBuffInAirMomentumLoss : UTigerBuff {
	float MinimumHorizontalSpeed; // 0x248
	float TimeToDecelerate; // 0x24c
};

struct UTigerDisciplineTeleport : UTigerDisciplineBase {
	UTigerTeleportConfig* Config; // 0x78
};

struct UTigerWheelWidget : UTigerMenuWidget {
	float LockCameraForGamepadAfterUseTime; // 0x290
	bool bShouldSetMouseLocation; // 0x294
	UTigerWheelInterfaceWidget* Interface; // 0x298
};

struct UTigerClientSeasonalRewardTier : UObject {
	TArray<FTigerItemId> FreeRewardIds; // 0x28
	TArray<FTigerItemId> PremiumRewardIds; // 0x38
};

struct UTBP_UI_Gradient_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Gradient_image; // 0x268
	UMaterialInstanceDynamic* Gradient_Material_Instance; // 0x270
	bool Is Horizontal; // 0x278
	float GradientMultiplier; // 0x27c
	float GradientRotation; // 0x280
	UTexture2D* Horizontal_Gradient_Texture; // 0x288
	float Gradient Scale; // 0x290
};

struct USoundEffectSourcePresetChain : UObject {
	TArray<FSourceEffectChainEntry> Chain; // 0x28
	char bPlayEffectChainTails : 1; // 0x38
};

struct UTigerDisciplineComponent : UActorComponent {
	UTigerDisciplineConfigs* DisciplineConfigs; // 0xb0
	USoundBase* DisciplineFailSound; // 0xb8
	FMulticastInlineDelegate OnDisciplineUsedDelegate; // 0xc0
	FMulticastInlineDelegate OnActivatedDisciplineDelegate; // 0xd0
	FMulticastInlineDelegate OnDeactivatedDisciplineDelegate; // 0xe0
	FMulticastInlineDelegate OnDisciplineUnlocked; // 0xf0
	FTigerScouterCharacterData ScouterCharacterData; // 0x100
	UTigerBuffShackles* PrimaryShacklesBuff; // 0x130
	UTigerBuff* SecondaryShacklesBuff; // 0x138
	float WeaponRarityDamageMultipliers[0x5]; // 0x140
	ATigerPlayer* Player; // 0x158
	TMap<ETigerDisciplinesEnum, UTigerDisciplineBase*> Disciplines; // 0x1e8
};

struct UInteractiveToolPropertySet : UObject {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct UTBP_ContextualHelp_Tutorial_SwapWeapons_Gamepad_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x9c
	FSubmixEffectDelaySettings DynamicSettings; // 0xa8
};

struct UInterpTrackInstEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UTigerGrimoireLandingUi : UTigerWidget {
	TArray<UTigerGrimoireEntry*> CachedUnlockedEntries; // 0x290
	TArray<UTigerGrimoireEntry*> CachedReadEntries; // 0x2a0
	FTigerSuggestedArticlesData CachedSuggestedArticlesData; // 0x2b0
};

struct AAkAcousticPortal : AVolume {
	UAkPortalComponent* Portal; // 0x260
	AkAcousticPortalState InitialState; // 0x268
	bool bRequiresStateMigration; // 0x269
};

struct UMovieSceneSubTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UUserInterfaceSettings : UDeveloperSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	TMap<EMouseCursor, FHardwareCursorReference> HardwareCursors; // 0x40
	TMap<EMouseCursor, FSoftClassPath> SoftwareCursors; // 0x90
	FSoftClassPath DefaultCursor; // 0xe0
	FSoftClassPath TextEditBeamCursor; // 0xf8
	FSoftClassPath CrosshairsCursor; // 0x110
	FSoftClassPath HandCursor; // 0x128
	FSoftClassPath GrabHandCursor; // 0x140
	FSoftClassPath GrabHandClosedCursor; // 0x158
	FSoftClassPath SlashedCircleCursor; // 0x170
	float ApplicationScale; // 0x188
	EUIScalingRule UIScaleRule; // 0x18c
	FSoftClassPath CustomScalingRuleClass; // 0x190
	FRuntimeFloatCurve UIScaleCurve; // 0x1a8
	bool bAllowHighDPIInGameMode; // 0x230
	FIntPoint DesignScreenSize; // 0x234
	bool bLoadWidgetsOnDedicatedServer; // 0x23c
	TArray<UObject*> CursorClasses; // 0x240
	UObject* CustomScalingRuleClassInstance; // 0x250
	UDPICustomScalingRule* CustomScalingRule; // 0x258
};

struct UWidgetSwitcher : UPanelWidget {
	int32_t ActiveWidgetIndex; // 0x120
};

struct UBTDecorator_TagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb0
	char bProjectVectorGoalToNavigation : 1; // 0xb0
	char bUpdatedDeprecatedProperties : 1; // 0xb0
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct UModelComponent : UPrimitiveComponent {
	UBodySetup* ModelBodySetup; // 0x468
};

struct UMaterialExpressionLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x48
	float DelayMax; // 0x4c
};

struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UTigerAiGiveOrderToSquad : UBTTaskNode {
	ETigerNpcSquadOrder OrderToGive; // 0x70
};

struct UParticleModuleMeshRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionVector StartRotationRate; // 0x30
};

struct UTigerAnimNotify_Footstep : UAnimNotify {
	bool bIsLeftFoot; // 0x38
	float FootstepDuration; // 0x3c
};

struct UDistributionFloatConstantCurve : UDistributionFloat {
	FInterpCurveFloat ConstantCurve; // 0x38
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle ButtonStyle; // 0x30
};

struct UScrollBox : UPanelWidget {
	FScrollBoxStyle WidgetStyle; // 0x120
	FScrollBarStyle WidgetBarStyle; // 0x348
	USlateWidgetStyleAsset* Style; // 0x818
	USlateWidgetStyleAsset* BarStyle; // 0x820
	EOrientation Orientation; // 0x828
	ESlateVisibility ScrollBarVisibility; // 0x829
	EConsumeMouseWheel ConsumeMouseWheel; // 0x82a
	FVector2D ScrollbarThickness; // 0x82c
	FMargin ScrollbarPadding; // 0x834
	bool AlwaysShowScrollbar; // 0x844
	bool AlwaysShowScrollbarTrack; // 0x845
	bool AllowOverscroll; // 0x846
	bool bAnimateWheelScrolling; // 0x847
	EDescendantScrollDestination NavigationDestination; // 0x848
	float NavigationScrollPadding; // 0x84c
	EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x850
	bool bAllowRightClickDragScrolling; // 0x851
	float WheelScrollMultiplier; // 0x854
	FMulticastInlineDelegate OnUserScrolled; // 0x858
};

struct UMasterAudioSubmixCaptureProtocol : UMovieSceneAudioCaptureProtocolBase {
	FString Filename; // 0x58
};

struct UIpNetDriver : UNetDriver {
	char LogPortUnreach : 1; // 0x748
	char AllowPlayerPortUnreach : 1; // 0x748
	uint32_t MaxPortCountToTry; // 0x74c
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x75c
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x760
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x764
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x768
	double MaxSecondsInReceive; // 0x770
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x778
	float ResolutionConnectionTimeout; // 0x77c
};

struct UTigerDialogueCondition_SeasonLevel : UTigerDialogueCondition {
	int32_t RequiredSeasonLevel; // 0x30
	ETigerDialogueEqualitySpecifier SeasonEquality; // 0x34
};

struct UMovieSceneEntitySystem : UObject {
	UMovieSceneEntitySystemLinker* Linker; // 0x28
};

struct UTigerAnimationSetCollection : UObject {
	UTigerAnimationSet* ResultSet; // 0x28
	TArray<UTigerAnimationSet*> AnimationSets; // 0x30
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x48
	float LoopEnd; // 0x4c
	float DurationAfterLoop; // 0x50
	int32_t LoopCount; // 0x54
	char bLoopIndefinitely : 1; // 0x58
	char bLoop : 1; // 0x58
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x60
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x68
	FRuntimeFloatCurve VolumeCurve; // 0x70
	FRuntimeFloatCurve PitchCurve; // 0xf8
	float PitchMin; // 0x180
	float PitchMax; // 0x184
	float VolumeMin; // 0x188
	float VolumeMax; // 0x18c
};

struct UTigerHealthBarUI : UUserWidget {
	FMulticastInlineDelegate OnHealthChanged; // 0x260
	ATigerCharacter* TigerCharacterOwner; // 0x270
	UMaterialInstanceDynamic* HealthBarMaterial; // 0x278
	float LostHealthDelay; // 0x280
	float LostHealthBarSpeed; // 0x284
	float HealthAmountPerBar; // 0x288
	float WidthBetweenSegments; // 0x28c
	float LostHealthPercentage; // 0x290
	float DefaultHealthAmount; // 0x2a4
};

struct ATigerLootBoxSpawner : ATigerLootSpawner {
	ATigerLootBox* LootBoxClass; // 0x268
	int32_t MinimumNumberOfItems; // 0x270
	int32_t MaximumNumberOfItems; // 0x274
	ETigerTelemetryItemSourceID TelemetryIDSource; // 0x27c
};

struct UGameplayTasksComponent : UActorComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x110
};

struct UAnimSingleNodeInstance : UAnimInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UTigerJudgeCombatState : UTigerJudgeBaseState {
	TArray<UTigerJudgeBaseAttackState*> AttackTypes; // 0x60
	TArray<UTigerJudgeBaseAttackState*> AvailableAttacks; // 0x70
	float TimeWithoutSeeingBloodhuntedPlayers; // 0x80
};

struct UGizmoLocalFloatParameterSource : UGizmoBaseFloatParameterSource {
	float Value; // 0x48
	FGizmoFloatParameterChange LastChange; // 0x4c
};

struct UABP_VMP_VEN_F_HAIR_13_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x300
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x760
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xba0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0xfe0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1420
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1860
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x1cc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2100
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3200
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct USoundNodeSwitch : USoundNode {
	FName IntParameterName; // 0x48
};

struct UTigerGameSingleton : UObject {
	TMap<UAnimSequence*, UAnimMontage*> GeneratedMontages; // 0x28
};

struct UMovieSceneMediaSection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLooping; // 0xf0
	FFrameNumber StartFrameOffset; // 0xf4
	UMediaTexture* MediaTexture; // 0xf8
	UMediaSoundComponent* MediaSoundComponent; // 0x100
	bool bUseExternalMediaPlayer; // 0x108
	UMediaPlayer* ExternalMediaPlayer; // 0x110
};

struct UFixedFrameRateCustomTimeStep : UEngineCustomTimeStep {
	FFrameRate FixedFrameRate; // 0x28
};

struct UTigerAiTargetOutOfBounds : UBTDecorator {
	FBlackboardKeySelector IsTargetOutOfBoundsKey; // 0x68
	FBlackboardKeySelector HasPathToTargetKey; // 0x90
	FBlackboardKeySelector IsPathOutOfBoundsKey; // 0xb8
};

struct UTigerInventoryComponent : UActorComponent {
	int32_t MaxItemsPerCategory; // 0xb0
	int32_t AmmoStackDistance; // 0xb4
	int32_t MaxConsumables; // 0xb8
	FSharkRandomDeviation DropItemLaunchSpeed; // 0xbc
	char SlotColumnCount; // 0xc4
	ATigerPlayer* Player; // 0x108
	UTigerItemAsset* UnarmedItemAsset; // 0x110
	FTigerInventoryWeapon Weapons[0x4]; // 0x118
	FTigerItemData Items[0xc]; // 0x138
	TArray<UTigerAmmoAsset*> AmmoPickupItems; // 0x1f8
	TArray<FTigerInventorySlotContent> Slots; // 0x208
	FTigerItemData Artifact; // 0x2b8
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct UNiagaraDataInterfaceLandscape : UNiagaraDataInterface {
	AActor* SourceLandscape; // 0x38
};

struct UTBP_ContextualHelp_Diablerie_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct ATBP_Trap_C : ATigerTrap {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	USpotLightComponent* TrapLightBottom; // 0x330
	USceneComponent* IconLocation; // 0x338
	USceneComponent* IconRoot; // 0x340
	USpotLightComponent* TrapLightTop; // 0x348
	UMaterialInstanceDynamic* Dyn material; // 0x350
	UCurveFloat* Curve; // 0x358
	UTigerTrapsConfig* TrapConfig; // 0x360
	UTigerInWorldWidget* InWorldWidget; // 0x368
};

struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x78
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	bool bLockPreviousCamera; // 0xf0
	FGuid CameraGuid; // 0xf4
	FMovieSceneObjectBindingID CameraBindingID; // 0x104
	FTransform InitialCameraCutTransform; // 0x120
	bool bHasInitialCameraCutTransform; // 0x150
};

struct ATBP_BlindingBeauty_C : ATigerBlindingBeautyEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UPostProcessComponent* PostProcess; // 0x240
	USphereComponent* Sphere; // 0x248
	USceneComponent* DefaultSceneRoot; // 0x250
	float UpdateAnticipationVisibility_NewTrack_0_F0F03A1D44C8206BF3C18B8D5DDCCB03; // 0x258
	ETimelineDirection UpdateAnticipationVisibility__Direction_F0F03A1D44C8206BF3C18B8D5DDCCB03; // 0x25c
	UTimelineComponent* UpdateAnticipationVisibility; // 0x260
	float Timeline_0_NewTrack_0_975FED8B458A734F1FB99DAE89CB25E3; // 0x268
	ETimelineDirection Timeline_0__Direction_975FED8B458A734F1FB99DAE89CB25E3; // 0x26c
	UTimelineComponent* Timeline_1; // 0x270
	float GlowCurve_NewTrack_0_50A9B99C47A6E2549D5E76977AAB52D1; // 0x278
	ETimelineDirection GlowCurve__Direction_50A9B99C47A6E2549D5E76977AAB52D1; // 0x27c
	UTimelineComponent* GlowCurve; // 0x280
	FVector AreaSize; // 0x288
	bool IsInDash; // 0x294
	UParticleSystemComponent* NewVar_1; // 0x298
	bool AnticipationPhase; // 0x2a0
};

struct UEnvQueryOption : UObject {
	UEnvQueryGenerator* Generator; // 0x28
	TArray<UEnvQueryTest*> Tests; // 0x30
};

struct UTigerChallengeDiablerize : UTigerChallenge {
	FTigerChallengeRequirementClan TargetRequiredClan; // 0xb0
};

struct UParticleModuleOrbitBase : UParticleModule {
	char bUseEmitterTime : 1; // 0x30
};

struct UGetGeoLocationAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct ATigerAIController : ATigerAiBaseController {
	FName LureTargetKeyName; // 0x3b0
	FName CurrentMasqueradeTargetKeyName; // 0x3b8
	FName TargetPositionKeyName; // 0x3c0
	FName MasqueradeBreachTargetKey; // 0x3c8
	FName BehaviorIsActiveKeyName; // 0x3d0
	FName SpawnPointKeyName; // 0x3d8
	FName ActiveCAPKeyName; // 0x3e0
	UBehaviorTree* LureBehaviorTree; // 0x3e8
	UBehaviorTree* BloodDrainedBehaviorTree; // 0x3f0
	UBehaviorTree* EmptyBehaviorTree; // 0x3f8
	UTigerFearValueAsset* FearValueAsset; // 0x400
	float OutOfCombatHealthRegenerationDelay; // 0x408
	float OutOfCombatHealthRegenerationTickInterval; // 0x40c
	float OutOfCombatTickHealthPercentage; // 0x410
	float TimeWhenEnteredBloodDrainedState; // 0x414
	float CheckForPlayerWeaponsInterval; // 0x418
	float CheckForPlayerWeaponsDeviation; // 0x41c
	float BaseThreatRadiusForEquippedRanged; // 0x420
	float BaseThreatRadiusForEquippedMelee; // 0x424
	float FearValue; // 0x428
	float MaxFearValue; // 0x42c
	float MinCrouchDistanceFromPlayer; // 0x430
	float ChanceToFleeWhenEnteringThreatenedState; // 0x434
	UTigerNpcMovementRestrictionBoundsData* MovementRestrictionBoundsData; // 0x468
	UTigerNpcMovementRestrictionBoundsData* TargetMovementRestrictionBoundsData; // 0x470
};

struct UInterpTrackInstParticleReplay : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UMovieScenePrimitiveMaterialSection : UMovieSceneSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe8
};

struct UTigerGrimoireSeasonData : UDataAsset {
	int32_t SeasonId; // 0x30
	FDateTime StartDate; // 0x38
	FDateTime EndDate; // 0x40
	TArray<UTigerGrimoireEntry*> Entries; // 0x48
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
	FMulticastInlineDelegate OnPawnControllerChangedDelegates; // 0x78
};

struct UParticleModuleSpawn : UParticleModuleSpawnBase {
	FRawDistributionFloat Rate; // 0x38
	FRawDistributionFloat RateScale; // 0x68
	EParticleBurstMethod ParticleBurstMethod; // 0x98
	TArray<FParticleBurst> BurstList; // 0xa0
	FRawDistributionFloat BurstScale; // 0xb0
	char bApplyGlobalSpawnRateScale : 1; // 0xe0
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct UPostEventAtLocationAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
};

struct UTigerAIPlayerMoveToTask : UBTTask_MoveTo {
	UTigerAIPlayerClimbIfPossibleTask* ClimbTask; // 0xb8
	UTigerAIPlayerSlideIfPossibleTask* SlideTask; // 0xc0
	UTigerAIPlayerWallGrindTask* WallGrindTask; // 0xc8
	float CheckStuckDelay; // 0xd0
	float CheckClimbTaskTransitionsDelay; // 0xd8
	float CheckSlideTaskTransitionsDelay; // 0xe0
	float JumpGapTransitionsDelay; // 0xe8
	ATigerLocalAIControllerBase* LocalAIController; // 0xf0
	ATigerPlayer* CurrentTigerPlayer; // 0xf8
};

struct UTigerClientRewardTrackMasteryChallenges : UTigerClientRewardTrackChallenges {
	TArray<FTigerChallengeInstanceID> ChallengeInstanceIDs; // 0x48
	TArray<FTigerItemId> RewardIdForSpecificChallenge; // 0x58
};

struct UTigerGrimoireDialogueWrapper : UObject {
	UTigerNpcDialogueList* DialogueList; // 0x28
	FString DialogueKey; // 0x30
};

struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> QueryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct UGizmoPlaneScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct UMovieSceneCameraAnimTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x80
};

struct UTigerSocialUI : UTigerSceneBackgroundUI {
	UTigerSocialSubscreenUI* CurrentSubscreen; // 0x3b0
};

struct UTBP_ContextualHelp_DownedRedGas_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct ULevelActorContainer : UObject {
	TArray<AActor*> Actors; // 0x28
};

struct UTBP_UI_LoginQueueSection_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTBP_UI_Button_CTA_C* Button_CTA_Retry; // 0x268
	UTigerStyledRichTextBlock* EstimatedWaitTimeValue; // 0x270
	UTBP_UI_TextButton_C* TBP_UI_TextButton_ExitGame; // 0x278
	UTigerStyledRichTextBlock* TigerStyledRichTextBlock_91; // 0x280
	UVerticalBox* WaitingPanel; // 0x288
	FMulticastInlineDelegate ExitGame; // 0x290
	float EstimatedWaitTimeSeconds; // 0x2a0
	FTimerHandle UpdateWaitTimeTimerHandle; // 0x2a8
	FMulticastInlineDelegate Retry; // 0x2b0
	float EstimatedWaitTimeSetAtRealTimeSeconds; // 0x2c0
};

struct APlanarReflection : ASceneCapture {
	UPlanarReflectionComponent* PlanarReflectionComponent; // 0x238
	bool bShowPreviewPlane; // 0x240
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xde0
	float ServerFlushLogInterval; // 0xde4
	UGameInstance* GameInstance; // 0xde8
};

struct UAIPerceptionSystem : UAISubsystem {
	TArray<UAISense*> Senses; // 0x88
	float PerceptionAgingRate; // 0x98
};

struct UVolumetricCloudComponent : USceneComponent {
	float LayerBottomAltitude; // 0x1f8
	float LayerHeight; // 0x1fc
	float TracingStartMaxDistance; // 0x200
	float TracingMaxDistance; // 0x204
	float PlanetRadius; // 0x208
	FColor GroundAlbedo; // 0x20c
	UMaterialInterface* Material; // 0x210
	char bUsePerSampleAtmosphericLightTransmittance : 1; // 0x218
	float SkyLightCloudBottomOcclusion; // 0x21c
	float ViewSampleCountScale; // 0x220
	float ReflectionSampleCountScale; // 0x224
	float ShadowViewSampleCountScale; // 0x228
	float ShadowReflectionSampleCountScale; // 0x22c
	float ShadowTracingDistance; // 0x230
};

struct ATigerKindredCharmEffectActor : AActor {
	float KindredCharmPercent; // 0x228
};

struct UTigerPreMatchPaperDollComponent : UActorComponent {
	TMap<FName, ATigerPaperDoll*> PaperDollByTagNames; // 0xb0
	TMap<ATigerPaperDoll*, FTigerPaperDollHighlightComponents> PaperDollHighlightComponents; // 0x100
};

struct UMovieSceneSequence : UMovieSceneSignedObject {
	UMovieSceneCompiledData* CompiledData; // 0x50
	EMovieSceneCompletionMode DefaultCompletionMode; // 0x58
	bool bParentContextsAreSignificant; // 0x59
	bool bPlayableDirectly; // 0x5a
	EMovieSceneSequenceFlags SequenceFlags; // 0x5b
};

struct UTigerTraversalStateAirDashConfig : UTigerTraversalStateConfigBase {
	bool bResetOnWallJump; // 0x50
	float JumpVerticalVelocity; // 0x54
	float PostJumpClimbInteractionDelay; // 0x58
	float JumpCoolDownTime; // 0x5c
	bool bPreventFallingSlide; // 0x60
	bool bResetAimGlideOnDoubleJump; // 0x61
};

struct UTBP_ContextualHelp_Tutorial_Slide_Gamepad_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UPlayMontageCallbackProxy : UObject {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct UForceFeedbackComponent : USceneComponent {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x1f8
	char bAutoDestroy : 1; // 0x200
	char bStopWhenOwnerDestroyed : 1; // 0x200
	char bLooping : 1; // 0x200
	char bIgnoreTimeDilation : 1; // 0x200
	char bOverrideAttenuation : 1; // 0x200
	float IntensityMultiplier; // 0x204
	UForceFeedbackAttenuation* AttenuationSettings; // 0x208
	FForceFeedbackAttenuationSettings AttenuationOverrides; // 0x210
	FMulticastInlineDelegate OnForceFeedbackFinished; // 0x2c0
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct UAISenseConfig_Hearing : UAISenseConfig {
	UAISense_Hearing* Implementation; // 0x48
	float HearingRange; // 0x50
	float LoSHearingRange; // 0x54
	char bUseLoSHearing : 1; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
};

struct UTigerFearValueAsset : UDataAsset {
	TMap<ETigerAIMasqueradeState, float> FearValueThresholds; // 0x30
};

struct UTigerRepositionConfig : UTigerActiveDisciplineConfig {
	ATigerRepositionTracer* TracerActor; // 0x160
	UTigerBuffReposition* RewindBuff; // 0x168
	float RewindTimeSeconds; // 0x170
	float SampleRate; // 0x174
	float RewindSpeed; // 0x178
	float RewindPlaybackTimeMin; // 0x17c
	float RewindPlaybackTimeMax; // 0x180
};

struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x288
	float BaseLookUpRate; // 0x28c
	UPawnMovementComponent* MovementComponent; // 0x290
	USphereComponent* CollisionComponent; // 0x298
	UStaticMeshComponent* MeshComponent; // 0x2a0
	char bAddDefaultMovementBindings : 1; // 0x2a8
};

struct UTigerDisciplineProjectionDash : UTigerDisciplineAnimTriggered {
	FVector DashStartLocation; // 0xf0
	FVector DashEnterLocation; // 0xfc
	FVector DashExitLocation; // 0x108
	FVector DashEndLocation; // 0x114
	UTigerProjectionDashConfig* Config; // 0x120
	ATigerProjectionDashProjectile* SpawnedProjection; // 0x128
	AActor* TargetIndicator; // 0x148
};

struct UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct USharkRenderingSettings : UDeveloperSettings {
	int32_t CustomPrimitiveFloatDataNameMapping[0x3a]; // 0x38
	int32_t CustomPrimitiveVector2DataNameMapping[0x13]; // 0x120
	int32_t CustomPrimitiveVector3DataNameMapping[0x19]; // 0x16c
	int32_t CustomPrimitiveVector4DataNameMapping[0x9]; // 0x1d0
};

struct UMovieSceneEasingExternalCurve : UObject {
	UCurveFloat* Curve; // 0x30
};

struct ATigerScreenshotMapBuilder : AActor {
	ATigerPlayerController* PlayerController; // 0x228
	UCameraComponent* CameraComponent; // 0x230
};

struct ATigerAISpawner : ATigerNPCSpawningBase {
	UTigerNPCAsset* NPCAsset; // 0x260
};

struct UToIntegerField : UFieldNodeInt {
	UFieldNodeFloat* FloatField; // 0xb0
};

struct ATigerWorldMarker : AActor {
	UUserWidget* MarkerClass; // 0x228
	bool bAutoCreateMapMarker; // 0x230
	bool bWaitForMapData; // 0x231
	UTigerMapMarkerProxy* MapMarkerProxy; // 0x238
	USceneComponent* MarkerRoot; // 0x240
};

struct ATigerSingleItemSpawner : ATigerLootSpawner {
	ETigerTelemetryItemSourceID TelemetryIDSource; // 0x268
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xf0
};

struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	UPawnAction* Action; // 0x70
};

struct ATBP_VFX_BloodDecal_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x228
	UStaticMeshComponent* StaticMesh; // 0x230
	USceneComponent* DefaultSceneRoot; // 0x238
	float FadeInTimeline_AlphaScaleTrack_588AF71A4B6DB400A9724382318A5E98; // 0x240
	ETimelineDirection FadeInTimeline__Direction_588AF71A4B6DB400A9724382318A5E98; // 0x244
	UTimelineComponent* FadeInTimeline; // 0x248
	float FadeOutTimeline_AlphaScaleTrack_FADD48494D9CA4FF7946218963114C70; // 0x250
	ETimelineDirection FadeOutTimeline__Direction_FADD48494D9CA4FF7946218963114C70; // 0x254
	UTimelineComponent* FadeOutTimeline; // 0x258
};

struct ATigerPlayerCameraManager : APlayerCameraManager {
	float MinSpringArmLengthWhenLookingUp; // 0x27c0
	float BaseTurnRate; // 0x27c4
	float BaseLookUpRate; // 0x27c8
	UTigerCameraPreset* CameraPresetsAdditive[0x4]; // 0x27d0
	UMatineeCameraShake* AdditiveCameraShakeInstances[0x4]; // 0x27f0
	UMatineeCameraShake* CurrentPresetShakeBehaviour; // 0x2810
	UTigerFullscreenFXManager* FullscreenFXManager; // 0x2818
	UCurveFloat* RecoilResetCurve; // 0x2820
	UCurveFloat* RecoilResetSpeedCurve; // 0x2828
	float TimeBeforeRecoilReset; // 0x2830
	UCurveFloat* VerticalRecoilCurve; // 0x2838
	UCurveFloat* HorizontalRecoilCurve; // 0x2840
	ATigerPlayer* TigerPlayer; // 0x2848
	ATigerBloodVeinPawn* BloodVeinPawn; // 0x2850
	ATigerPlayerController* TigerPlayerController; // 0x2858
	UCurveFloat* DefaultTransitionCurve; // 0x2868
	UTigerCameraPreset* CameraPresetOverride; // 0x2870
	UTigerCameraPreset* CameraPresetIndoorOverride; // 0x2878
	UTigerSpringArmComponent* CurrentSpringArm; // 0x2880
	UTigerCameraBehavior* CurrentCameraBehavior; // 0x2888
	UTigerCameraPreset* PreviousCameraPreset; // 0x2890
	TArray<UTigerCameraBehavior*> CachedCameraBehaviors; // 0x28d0
	TArray<UTigerAdditiveCameraBehavior*> AdditiveCameraBehaviors; // 0x28e0
};

struct UTigerBufferedAction : UObject {
	ATigerPlayerController* OwnerPlayerController; // 0x28
	UTigerActionBuffer* OwnerActionBuffer; // 0x30
};

struct UTigerBloodTrackPreset : UDataAsset {
	FTigerBloodTrack BloodTrack; // 0x30
};

struct UTigerCharacterMeshManager : UActorComponent {
	TArray<FTigerStaticMeshData> StaticMeshes; // 0xb0
	TArray<FTigerPoseableMeshData> PoseableMeshes; // 0xc0
	FTigerCharacterMeshData Mesh[0xb]; // 0xd0
	UStaticPiercingPhysics* StaticPiercingPhysics; // 0x1d8
};

struct UMediaTimeStampInfo : UObject {
	FTimespan Time; // 0x28
	int64_t SequenceIndex; // 0x30
};

struct ATBP_BootGameMode_C : ATigerBootGameMode {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	USceneComponent* DefaultSceneRoot; // 0x2f8
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UTigerSpawnMechanicBattleRoyaleMapSelection : UTigerSpawnMechanicBattleRoyaleBase {
	TArray<FTigerDesiredSpawnLocation> DesiredSpawnLocations; // 0x50
};

struct ATigerEntityHelicopter : AActor {
	UAkAudioEvent* PreparingToFireSound; // 0x228
	UAkAudioEvent* TargetEnteredSpotlightSound; // 0x230
	UAkAudioEvent* TargetLeftSpotlightSound; // 0x238
	ATigerProjectile* ProjectileClass; // 0x240
	UTigerRangedWeapon* WeaponType; // 0x248
	UTigerRangedWeapon* Weapon; // 0x250
	UDataTable* RangedWeaponsDatatable; // 0x258
	TWeakObjectPtr<ATigerPlayer> TargetedPlayer; // 0x268
	USceneComponent* LineOfSightStart; // 0x270
	FVector_NetQuantize10 SpotlightEndTarget; // 0x284
	USceneComponent* SceneRoot; // 0x290
	UChildActorComponent* HelicopterChildActor; // 0x298
	float SpotlightMovementSpeed; // 0x2a0
	float TargetSpottedDelayBeforeFiring; // 0x2b8
};

struct UTigerAiShouldUseDisciplineBase : UBTDecorator {
	float LowHealthPercentage; // 0x68
	ATigerLocalAIController* LocalAIController; // 0x70
	ATigerPlayerController* LocalAiPlayerController; // 0x78
	ATigerPlayer* AiTigerPlayer; // 0x80
	UTigerDisciplineComponent* DisciplineComponent; // 0x88
	ATigerCharacter* AiTigerCharacter; // 0x90
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct ATigerDamageTriggerVolume : ATriggerVolume {
	float DamagePerSecond; // 0x260
	bool bOnlyDamageKindred; // 0x264
	bool bDoNotDamageDowned; // 0x265
	float DamageRate; // 0x268
	bool bEnableDamage; // 0x26c
	TArray<FDamageTriggerOverlapData> OverlappingCharacters; // 0x270
};

struct UAnimNotify_PlayNiagaraEffect : UAnimNotify {
	UNiagaraSystem* Template; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	bool bAbsoluteScale; // 0x64
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UMaterialExpressionParticleSubUV : UMaterialExpressionTextureSample {
	char bBlend : 1; // 0x60
};

struct UTBP_UI_Discipline_ProjectionDash_WorldMarker_C : UTBP_UI_InWorldIconBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x320
	UWidgetAnimation* OffScreenState; // 0x328
	UWidgetAnimation* DownArrow_FadeOut; // 0x330
	UWidgetAnimation* FadeOutAnimation; // 0x338
	UWidgetAnimation* FadeInAnimation; // 0x340
	UWidgetAnimation* DownArrow_Movement; // 0x348
	UTextBlock* DistanceText; // 0x350
	UImage* DownArrowImage; // 0x358
	UImage* IconWidget; // 0x360
	UCanvasPanel* RootCanvas; // 0x368
	UTigerDisciplineProjectionDash* ProjectionDashDiscipline; // 0x370
	FWidgetTransform OnScreenRootTransform; // 0x378
};

struct UTBP_RejuvenatingVoice_C : UTigerDisciplineRejuvenatingVoice {
	FPointerToUberGraphFrame UberGraphFrame; // 0x138
	float HealRadius; // 0x140
};

struct UTigerUser : UObject {
	FString DISPLAYNAME; // 0x28
	FTigerPersistentPlayerID ID; // 0x38
};

struct UTBP_ContextualHelp_RangedWeapon_FireMode_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UTBP_Buff_KindredCharm_Npc_C : UTigerBuffKindredCharm {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
};

struct UTigerChallengeTypeDatabase : UObject {
	bool bFirstDailyChallengeIsPersistent; // 0x28
	TArray<UTigerChallengeCollection*> SeasonalChallengeCollections; // 0x30
	TArray<UTigerChallengeCollection*> DailyChallengeCollections; // 0x40
	TArray<UTigerChallengeCollection*> MasteryChallengeCollections; // 0x50
};

struct UTigerDisciplineMetaData : UAnimMetaData {
	ETigerDisciplinesEnum DisicplineType; // 0x28
	bool bAllowRotationLerp; // 0x29
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x80
	FAIDataProviderFloatValue ConeDegrees; // 0xb8
	FAIDataProviderFloatValue AngleStep; // 0xf0
	FAIDataProviderFloatValue Range; // 0x128
	UEnvQueryContext* CenterActor; // 0x160
	char bIncludeContextLocation : 1; // 0x168
};

struct UPlanePositionGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoVec2ParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bFlipX; // 0x89
	bool bFlipY; // 0x8a
	bool bInInteraction; // 0x8b
	FVector InteractionOrigin; // 0x8c
	FVector InteractionNormal; // 0x98
	FVector InteractionAxisX; // 0xa4
	FVector InteractionAxisY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	FVector2D InteractionStartParameter; // 0xd4
	FVector2D InteractionCurParameter; // 0xdc
	FVector2D ParameterSigns; // 0xe4
};

struct ATigerNPCPointSpawner : ATigerNPCSpawningBase {
	TArray<FTigerNPCSpawningPoint> SpawningPoints; // 0x260
	int32_t MaxNPCsToSpawn; // 0x270
	int32_t MinNPCsToSpawn; // 0x274
	int32_t MaxNPCsToSpawnGroup; // 0x278
	int32_t MinNPCsToSpawnGroup; // 0x27c
};

struct UMatineeCameraShake : UCameraShakeBase {
	float OscillationDuration; // 0x98
	float OscillationBlendInTime; // 0x9c
	float OscillationBlendOutTime; // 0xa0
	FROscillator RotOscillation; // 0xa4
	FVOscillator LocOscillation; // 0xc8
	FFOscillator FOVOscillation; // 0xec
	float AnimPlayRate; // 0xf8
	float AnimScale; // 0xfc
	float AnimBlendInTime; // 0x100
	float AnimBlendOutTime; // 0x104
	float RandomAnimSegmentDuration; // 0x108
	UCameraAnim* Anim; // 0x110
	char bRandomAnimSegment : 1; // 0x118
	float OscillatorTimeRemaining; // 0x11c
	UCameraAnimInst* AnimInst; // 0x120
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UTBP_UI_MapMarker_C : UTigerMapMarkerWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
};

struct UTBP_UI_Crosshair_Burst_C : UTBP_UI_BaseRangedCrosshair_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x380
};

struct ATigerSpectatorPawn : ASpectatorPawn {
	UTigerSpringArmComponent* SpringArm; // 0x2b0
	FMulticastInlineDelegate OnSpectateeChanged; // 0x2b8
	FMulticastInlineDelegate OnEnoughStreamingDoneToSpectate; // 0x2c8
	ATigerPlayerState* CurrentSpectatee; // 0x2d8
	TWeakObjectPtr<ATigerPlayer> CurrentSpectateePlayer; // 0x2e0
	bool bIsWaitingForStreaming; // 0x2e8
	float LastSpectateeSwitchTime; // 0x2ec
	float MaxLoadingScreenTime; // 0x2f0
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct UTigerLoadingScreenAsset : UObject {
	TSoftObjectPtr<UAkAudioEvent> StartAudioEvent; // 0x28
	TSoftClassPtr<UObject> LoadingScreenWidget; // 0x50
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct UABP_VMP_TOR_M_HAIR_03_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2f0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x730
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0xb70
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xfb0
	FAnimNode_Root AnimGraphNode_Root; // 0x13f0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1420
};

struct AAtmosphericFog : AInfo {
	UAtmosphericFogComponent* AtmosphericFogComponent; // 0x228
};

struct UNiagaraEventReceiverEmitterAction_SpawnParticles : UNiagaraEventReceiverEmitterAction {
	uint32_t NumParticles; // 0x28
};

struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	float CloseSightRadius; // 0x5c
	float CloseLoseSightRadius; // 0x60
	float ClosePeripheralVisionAngleDegrees; // 0x64
	float HeightDifference; // 0x68
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x6c
	float AutoSuccessRangeFromLastSeenLocation; // 0x70
	float PointOfViewBackwardOffset; // 0x74
	float NearClippingRadius; // 0x78
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	FGuid ObjectGuid; // 0x88
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UTigerBuffMeleeChargeInstance : UTigerBuffInstance {
	UTigerBuffMeleeCharge* MeleeChargeBuff; // 0x88
	ATigerPlayer* Player; // 0x90
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat LifeTime; // 0x30
};

struct UTigerConsumableInventoryItemBase : UTigerInventoryItemBase {
	int32_t Count; // 0x110
};

struct UGizmoTransformChangeStateTarget : UObject {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x50
};

struct UTBP_UI_LicenseAgreement_Popup_C : UTigerLicenseAgreementPopup {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FulFixAnimation; // 0x268
	UWidgetAnimation* ShowAgreeButton; // 0x270
	UWidgetAnimation* ReadArrowFlash; // 0x278
	UTBP_UI_MenuButton_C* AgreeButton; // 0x280
	UTBP_UI_MenuButton_C* CancelButton; // 0x288
	UImage* Image_144; // 0x290
	UTigerStyledRichTextBlock* License_Text; // 0x298
	UOverlay* ReadArrowContainer; // 0x2a0
	UImage* ReadArrowShadow; // 0x2a8
	UScrollBox* ScrollBox_1; // 0x2b0
	UTBP_UI_Divider_C* TBP_UI_Divider; // 0x2b8
	UTBP_UI_Divider_C* TBP_UI_Divider_2; // 0x2c0
	UTBP_UI_Popup_Base_C* TBP_UI_Popup_Base; // 0x2c8
	UTBP_UI_Scrollbox_C* TBP_UI_Scrollbox; // 0x2d0
	UTigerStyledRichTextBlock* Title_Text; // 0x2d8
	FMulticastInlineDelegate OnDecisionMade; // 0x2e0
	bool Agreed; // 0x2f0
	bool ScrolledFinished; // 0x2f1
	FString Subtitle_TextFormatting; // 0x2f8
	FString Subheader_TextFormatting; // 0x308
	FString UL_TextFormatting; // 0x318
	FString Bold_TextFormating; // 0x328
	FString EL_TextFormatting; // 0x338
};

struct UABP_VMP_TOR_F_HAIR_07_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x300
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0xb80
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0xfc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x1400
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1840
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x1860
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x20e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2520
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2540
};

struct UTigerCharacterBeardColorCustomization : UTigerCharacterPartOfHeadCustomization {
	FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110
};

struct UTBP_UI_InputPrompt_Keyboard_C : UTigerInputPrompt {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UTigerStyledRichTextBlock* PostFixTextBlock; // 0x2f0
	UTigerStyledRichTextBlock* PrefixTextBlock; // 0x2f8
	UTBP_UI_KeyboardIcon_C* TBP_UI_KeyboardIcon; // 0x300
	bool bHasValidIcon; // 0x308
	FSlateFontInfo FontInfo; // 0x310
	FMargin CustomPadding; // 0x368
	FDataTableRowHandle Font; // 0x378
};

struct UTireType : UDataAsset {
	float FrictionScale; // 0x30
};

struct USourceEffectDynamicsProcessorPreset : USoundEffectSourcePreset {
	FSourceEffectDynamicsProcessorSettings Settings; // 0xb8
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x1f8
	char bSupportsDepth : 1; // 0x1f8
	char bNoAlphaChannel : 1; // 0x1f8
	UTexture* Texture; // 0x200
	UTexture* LeftTexture; // 0x208
	char bQuadPreserveTextureRatio : 1; // 0x210
	FVector2D QuadSize; // 0x214
	FBox2D UVRect; // 0x21c
	float CylinderRadius; // 0x230
	float CylinderOverlayArc; // 0x234
	int32_t CylinderHeight; // 0x238
	FEquirectProps EquirectProps; // 0x23c
	EStereoLayerType StereoLayerType; // 0x284
	EStereoLayerShape StereoLayerShape; // 0x285
	UStereoLayerShape* Shape; // 0x288
	int32_t Priority; // 0x290
};

struct UClothLODDataCommon_Legacy : UObject {
	UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData; // 0x28
	FClothPhysicalMeshData ClothPhysicalMeshData; // 0x30
	FClothCollisionData CollisionData; // 0x128
};

struct USubmixEffectFlexiverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0xa0
};

struct UTigerAnimNotify_PlayCharEffect : UAnimNotify {
	UTigerCharacterEffect* Effect; // 0x38
	FName SocketToUse; // 0x40
};

struct UTigerPlayerMasqueradeComponent : UActorComponent {
	FMulticastInlineDelegate OnBloodHuntStateChanged; // 0xb0
	FMulticastInlineDelegate OnBloodHuntStateUpdated; // 0xc0
	TArray<UTigerMasqueradeConsequence*> PossibleMasqueradeConsequences; // 0xd0
	TArray<UTigerMasqueradeConsequenceSyncInstance*> SyncedMasqueradeConsequenceInstances; // 0xe0
	FMulticastInlineDelegate OnMasqueradeConsequenceInstancedAdded; // 0xf0
	FMulticastInlineDelegate OnMasqueradeConsequenceInstancedRemoved; // 0x100
	uint32_t ConsequenceBroadcastSlotCount; // 0x110
	TArray<UTigerMasqueradeConsequence*> ActiveConsequences; // 0x118
	TArray<FTigerConsequenceData> ReplicatedConsequences; // 0x128
};

struct UMediaPlaylist : UObject {
	TArray<UMediaSource*> Items; // 0x28
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x228
	FGuid LandscapeGuid; // 0x230
	FIntPoint LandscapeSectionOffset; // 0x240
	int32_t MaxLODLevel; // 0x248
	float LODDistanceFactor; // 0x24c
	ELandscapeLODFalloff LODFalloff; // 0x250
	float ComponentScreenSizeToUseSubSections; // 0x254
	float LOD0ScreenSize; // 0x258
	float LOD0DistributionSetting; // 0x25c
	float LODDistributionSetting; // 0x260
	float TessellationComponentScreenSize; // 0x264
	bool UseTessellationComponentScreenSizeFalloff; // 0x268
	float TessellationComponentScreenSizeFalloff; // 0x26c
	int32_t OccluderGeometryLOD; // 0x270
	int32_t StaticLightingLOD; // 0x274
	UPhysicalMaterial* DefaultPhysMaterial; // 0x278
	float StreamingDistanceMultiplier; // 0x280
	UMaterialInterface* LandscapeMaterial; // 0x288
	UMaterialInterface* LandscapeHoleMaterial; // 0x2b0
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b8
	bool bMeshHoles; // 0x2c8
	char MeshHolesMaxLod; // 0x2c9
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2d0
	int32_t VirtualTextureNumLods; // 0x2e0
	int32_t VirtualTextureLodBias; // 0x2e4
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e8
	float NegativeZBoundsExtension; // 0x2ec
	float PositiveZBoundsExtension; // 0x2f0
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f8
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x308
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x318
	bool bHasLandscapeGrass; // 0x38c
	float StaticLightingResolution; // 0x390
	char CastShadow : 1; // 0x394
	char bCastDynamicShadow : 1; // 0x394
	char bCastStaticShadow : 1; // 0x394
	char bCastFarShadow : 1; // 0x398
	char bCastHiddenShadow : 1; // 0x39c
	char bCastShadowAsTwoSided : 1; // 0x3a0
	char bAffectDistanceFieldLighting : 1; // 0x3a4
	FLightingChannels LightingChannels; // 0x3a5
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a8
	char bRenderCustomDepth : 1; // 0x3a8
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3ac
	int32_t CustomDepthStencilValue; // 0x3b0
	float LDMaxDrawDistance; // 0x3b4
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b8
	int32_t CollisionMipLevel; // 0x3d0
	int32_t SimpleCollisionMipLevel; // 0x3d4
	float CollisionThickness; // 0x3d8
	FBodyInstance BodyInstance; // 0x3e0
	char bGenerateOverlapEvents : 1; // 0x538
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x538
	int32_t ComponentSizeQuads; // 0x53c
	int32_t SubsectionSizeQuads; // 0x540
	int32_t NumSubsections; // 0x544
	char bUsedForNavigation : 1; // 0x548
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x548
	bool bUseDynamicMaterialInstance; // 0x54c
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x54d
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x54e
	bool bHasLayersContent; // 0x54f
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x550
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct ATBP_VFX_GroundSlam_Impact_C : AActor {
	UParticleSystemComponent* Impact Particle; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
};

struct UMaterialExpressionStep : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bIsDirty : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UEnvQueryTest_Distance : UEnvQueryTest {
	EEnvTestDistance TestMode; // 0x1f8
	UEnvQueryContext* DistanceTo; // 0x200
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UTigerBuffThorns : UTigerBuffDOT {
	float HealInterval; // 0x258
	float HealPercentage; // 0x25c
	UTigerCharacterEffect* HealEffect; // 0x260
	UAkAudioEvent* DOTTriggerEvent; // 0x268
};

struct UTigerDisciplineFlowerOfDeath : UTigerDisciplineBase {
	UTigerFlowerOfDeathConfig* Config; // 0x78
};

struct UTigerTraversalClimbState : UTigerTraversalBaseFiniteState {
	UTigerTraversalStateClimbingConfig* ClimbingConfig; // 0x40
};

struct UTBP_UI_Line_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Left; // 0x268
	UImage* Middle; // 0x270
	UImage* Right; // 0x278
	USizeBox* SizeContainer; // 0x280
	UTexture2D* LeftTexture; // 0x288
	UTexture2D* RightTexture; // 0x290
	UTexture2D* Texture; // 0x298
	FVector2D MarginPixels; // 0x2a0
	float OverrideMiddleWidth; // 0x2a8
	float OverrideMiddleHeight; // 0x2ac
	bool FlipRight; // 0x2b0
	bool FlipLeft; // 0x2b1
};

struct UTBP_LoadingScreen_Simple_C : UTigerLoadingScreenAsset {
	TSoftObjectPtr<UTBP_LoadingToolTip_C> Tooltips; // 0x78
	TSoftObjectPtr<UMaterialInterface> BackgroundMaterial; // 0xa0
};

struct AServerStatReplicator : AInfo {
	bool bUpdateStatNet; // 0x228
	bool bOverwriteClientStats; // 0x229
	uint32_t Channels; // 0x22c
	uint32_t InRate; // 0x230
	uint32_t OutRate; // 0x234
	uint32_t MaxPacketOverhead; // 0x23c
	uint32_t InRateClientMax; // 0x240
	uint32_t InRateClientMin; // 0x244
	uint32_t InRateClientAvg; // 0x248
	uint32_t InPacketsClientMax; // 0x24c
	uint32_t InPacketsClientMin; // 0x250
	uint32_t InPacketsClientAvg; // 0x254
	uint32_t OutRateClientMax; // 0x258
	uint32_t OutRateClientMin; // 0x25c
	uint32_t OutRateClientAvg; // 0x260
	uint32_t OutPacketsClientMax; // 0x264
	uint32_t OutPacketsClientMin; // 0x268
	uint32_t OutPacketsClientAvg; // 0x26c
	uint32_t NetNumClients; // 0x270
	uint32_t InPackets; // 0x274
	uint32_t OutPackets; // 0x278
	uint32_t InBunches; // 0x27c
	uint32_t OutBunches; // 0x280
	uint32_t OutLoss; // 0x284
	uint32_t InLoss; // 0x288
	uint32_t VoiceBytesSent; // 0x28c
	uint32_t VoiceBytesRecv; // 0x290
	uint32_t VoicePacketsSent; // 0x294
	uint32_t VoicePacketsRecv; // 0x298
	uint32_t PercentInVoice; // 0x29c
	uint32_t PercentOutVoice; // 0x2a0
	uint32_t NumActorChannels; // 0x2a4
	uint32_t NumConsideredActors; // 0x2a8
	uint32_t PrioritizedActors; // 0x2ac
	uint32_t NumRelevantActors; // 0x2b0
	uint32_t NumRelevantDeletedActors; // 0x2b4
	uint32_t NumReplicatedActorAttempts; // 0x2b8
	uint32_t NumReplicatedActors; // 0x2bc
	uint32_t NumActors; // 0x2c0
	uint32_t NumNetActors; // 0x2c4
	uint32_t NumDormantActors; // 0x2c8
	uint32_t NumInitiallyDormantActors; // 0x2cc
	uint32_t NumNetGUIDsAckd; // 0x2d0
	uint32_t NumNetGUIDsPending; // 0x2d4
	uint32_t NumNetGUIDsUnAckd; // 0x2d8
	uint32_t ObjPathBytes; // 0x2dc
	uint32_t NetGUIDOutRate; // 0x2e0
	uint32_t NetGUIDInRate; // 0x2e4
	uint32_t NetSaturated; // 0x2e8
};

struct UABP_Ranged_Weapon_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x3a8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x500
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x658
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x680
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x6a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x800
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x828
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x930
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xa88
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0xab0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xbb8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xbd8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xbf8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_57; // 0xd00
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_56; // 0xd50
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_55; // 0xda0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0xdf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0xe90
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0xf30
	FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0xf60
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1010
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_54; // 0x1118
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_53; // 0x1168
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x11b8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_52; // 0x1258
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_51; // 0x12a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x12f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x1398
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1438
	FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x1468
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x1518
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x15b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1710
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_50; // 0x1738
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_49; // 0x1788
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x17d8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_48; // 0x1878
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_47; // 0x18c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x1918
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x19b8
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1a58
	FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x1a88
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1b38
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1b80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x1bc8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x1bf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1d48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x1d70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1ec8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x1ef0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x2048
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_46; // 0x2070
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x20c0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x20f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x21a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x22f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2320
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_45; // 0x23e0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_44; // 0x2430
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_43; // 0x2480
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_42; // 0x24d0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_41; // 0x2520
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x2570
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x2610
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x26b0
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2750
	FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x2780
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_40; // 0x2830
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_39; // 0x2880
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x28d0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_38; // 0x2970
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_37; // 0x29c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x2a10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x2ab0
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2b50
	FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x2b80
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_36; // 0x2c30
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_35; // 0x2c80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x2cd0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_34; // 0x2d70
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33; // 0x2dc0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x2e10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x2eb0
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2f50
	FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x2f80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x3030
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x3188
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_32; // 0x31b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_31; // 0x3200
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x3250
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_30; // 0x32f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3340
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x33e0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_29; // 0x3480
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x34d0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x3500
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x35b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x3708
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x3730
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x37d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x3818
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3840
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x3900
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3a58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x3aa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3ac8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_28; // 0x3af0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_27; // 0x3b40
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x3b90
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26; // 0x3c30
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_25; // 0x3c80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x3cd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x3d70
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x3e10
	FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x3e40
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x3ef0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x4048
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24; // 0x4070
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23; // 0x40c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x4110
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22; // 0x41b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21; // 0x4200
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x4250
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x42f0
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x4390
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x43c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x4470
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x45c8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20; // 0x45f0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19; // 0x4640
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4690
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x4730
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x4780
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x47d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x4870
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x4910
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x4940
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x49f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x4b48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x4b70
	FAnimNode_Slot AnimGraphNode_Slot; // 0x4c10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x4c58
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x4c80
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x4cd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x4d20
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x4dc0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x4e10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x4e60
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x4f00
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4fa0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x4fd0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x5080
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x51d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x5200
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5228
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5330
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5350
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x5370
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x54c8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x5518
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5568
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x5608
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x5658
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x56a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x5748
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x57e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x5818
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x58c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5a20
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x5a48
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x5a98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x5ae8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x5b88
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x5bd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x5c28
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x5cc8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x5d68
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x5d98
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x5e48
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x5e98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5ee8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x5f88
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x5fd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x6028
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x60c8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6168
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6198
	ENUM_RangedWeaponCategories CurrentRangedWeapon; // 0x6248
	bool IsAimingWeapon; // 0x6249
	bool IsHipFiring; // 0x624a
	float FireWeaponBlendInTime; // 0x624c
	bool IsCrouching; // 0x6250
	bool HipOrAimFiring; // 0x6251
	FVector RootJointOffset; // 0x6254
	FVector LeftHandIKOffset; // 0x6260
	float IsPlayingAsFemaleFloat; // 0x626c
	bool IsMovingOnGround; // 0x6270
	TArray<ENUM_RangedWeaponCategories> ShouldOffsetLeftElbow; // 0x6278
	float ShouldUseLeftElbowOffsetAlpha; // 0x6288
	FVector LeftElbowOffset; // 0x628c
	bool WallJumpIsAvailable; // 0x6298
	TMap<ENUM_RangedWeaponCategories, FVector> RootJointOffsetMap; // 0x62a0
	TMap<ENUM_RangedWeaponCategories, FVector> LeftHandOffsetMap; // 0x62f0
	float WeaponScaleAlpha; // 0x6340
	FVector WeaponScaleVector; // 0x6344
	ETigerGender BodyType; // 0x6350
	TMap<ENUM_RangedWeaponCategories, float> WeaponScaleMap; // 0x6358
	bool IsPlayingAsFemaleBool; // 0x63a8
	bool IsSecondaryWeapon; // 0x63a9
	UABP_Player_C* Anim Instance; // 0x63b0
	float AimSweepFloat; // 0x63b8
	ATigerPlayer* Player; // 0x63c0
	bool Is in Reload; // 0x63c8
	FRotator MagazineRotationAmount; // 0x63cc
	bool RotatingMagazine; // 0x63d8
	float Alpha; // 0x63dc
	bool Is Sprinting; // 0x63e0
};

struct UAnimNotifyState_Trail : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	ETrailWidthMode WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	char bRecycleSpawnedSystems : 1; // 0x54
};

struct UTBP_ContextualHelp_Tutorial_Climb_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UTBP_Buff_BlindingBeauty_C : UTigerBuffBlindingBeauty {
	FPointerToUberGraphFrame UberGraphFrame; // 0x250
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct ATigerMusicVolume : AVolume {
	UTigerMusicAsset* MusicAsset; // 0x260
};

struct UGizmoAxisScaleParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	float Parameter; // 0x6c
	FGizmoFloatParameterChange LastChange; // 0x70
	FVector CurScaleAxis; // 0x78
	FVector CurScaleOrigin; // 0x84
	FTransform InitialTransform; // 0x90
};

struct UMaterialExpressionShadingPathSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct UTigerPingBase : UDataAsset {
	int32_t MaxConcurrentPings; // 0x30
	bool bBecomesPermanentOnInterest; // 0x34
	bool bInstanceSupportsHover; // 0x35
	float LifeTimeInSeconds; // 0x38
	float MaxDistance; // 0x3c
	float MaxActorDistanceFromMarker; // 0x40
	UTigerPingWorldInstanceUI* WidgetClass; // 0x48
	TArray<UTigerPingBase*> ExclusiveWithPingClasses; // 0x50
	UTexture2D* Icon; // 0x60
	UTexture2D* InterestedResponseIcon; // 0x68
	UTexture2D* NotInterestedResponseIcon; // 0x70
	FText Name; // 0x78
	FText Description; // 0x90
	FText InterestedResponse; // 0xa8
	FText NotInterestedResponse; // 0xc0
	UAkAudioEvent* NotificationAudioEvent; // 0xd8
	UAkAudioEvent* VoiceAudioEvent; // 0xe0
	bool bCanBeInCluster; // 0xe8
};

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x288
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x290
};

struct ATigerLocalAIController : ATigerLocalAIControllerBase {
	float FleeMaxDistanceSquared; // 0x498
	float FacingConeHalfAngle; // 0x49c
	float MinimumAcceptableHeadshotDamageMultiplier; // 0x4a0
	float HeadshotChance; // 0x4a4
	TArray<UTigerBuff*> BuffsOnSelfToIgnoreTargetsList; // 0x4a8
	TArray<UTigerBuff*> BuffsOnTargetsToIgnoreList; // 0x4b8
	ATigerPlayerState* TigerPlayerState; // 0x4d0
};

struct UInterpTrackParticleReplay : UInterpTrack {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0x70
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x228
	FName MatineeControllerName; // 0x230
	float PlayRate; // 0x238
	char bPlayOnLevelLoad : 1; // 0x23c
	char bForceStartPos : 1; // 0x23c
	float ForceStartPosition; // 0x240
	char bLooping : 1; // 0x244
	char bRewindOnPlay : 1; // 0x244
	char bNoResetOnRewind : 1; // 0x244
	char bRewindIfAlreadyPlaying : 1; // 0x244
	char bDisableRadioFilter : 1; // 0x244
	char bClientSideOnly : 1; // 0x244
	char bSkipUpdateIfNotVisible : 1; // 0x244
	char bIsSkippable : 1; // 0x244
	int32_t PreferredSplitScreenNum; // 0x248
	char bDisableMovementInput : 1; // 0x24c
	char bDisableLookAtInput : 1; // 0x24c
	char bHidePlayer : 1; // 0x24c
	char bHideHud : 1; // 0x24c
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x250
	char bShouldShowGore : 1; // 0x260
	TArray<UInterpGroupInst*> GroupInst; // 0x268
	TArray<FCameraCutInfo> CameraCuts; // 0x278
	char bIsPlaying : 1; // 0x288
	char bReversePlayback : 1; // 0x288
	char bPaused : 1; // 0x288
	char bPendingStop : 1; // 0x288
	float InterpPosition; // 0x28c
	char ReplicationForceIsPlaying; // 0x294
	FMulticastInlineDelegate OnPlay; // 0x298
	FMulticastInlineDelegate OnStop; // 0x2a8
	FMulticastInlineDelegate OnPause; // 0x2b8
};

struct UWidgetTree : UObject {
	UWidget* RootWidget; // 0x28
};

struct UTigerGameFlowStateBoot : UTigerGameFlowState {
	FMulticastInlineDelegate OnLaunchTutorial; // 0x40
	FMulticastInlineDelegate OnEnterElysiumFirstTime; // 0x50
	FMulticastInlineDelegate OnEnterElysium; // 0x60
	FMulticastInlineDelegate OnPreloadingDone; // 0x70
};

struct UMovieSceneObjectPropertySection : UMovieSceneSection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe8
};

struct UTigerNearbySoundCueComponent : UActorComponent {
	float DistanceToPlaySoundOnSquared; // 0xb0
	float DistanceToStopSoundOnSquared; // 0xb4
	UAkAudioEvent* PlayEvent; // 0xb8
	UAkAudioEvent* StopEvent; // 0xc0
	bool bDisableOcclusion; // 0xc8
	ATigerCharacter* CharacterOwner; // 0xd0
	UAkComponent* AkComponent; // 0xd8
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct UPaperFlipbookComponent : UMeshComponent {
	UPaperFlipbook* SourceFlipbook; // 0x478
	UMaterialInterface* Material; // 0x480
	float PlayRate; // 0x488
	char bLooping : 1; // 0x48c
	char bReversePlayback : 1; // 0x48c
	char bPlaying : 1; // 0x48c
	float AccumulatedTime; // 0x490
	int32_t CachedFrameIndex; // 0x494
	FLinearColor SpriteColor; // 0x498
	UBodySetup* CachedBodySetup; // 0x4a8
	FMulticastInlineDelegate OnFinishedPlaying; // 0x4b0
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x478
	EWidgetTimingPolicy TimingPolicy; // 0x479
	UUserWidget* WidgetClass; // 0x480
	FIntPoint DrawSize; // 0x488
	bool bManuallyRedraw; // 0x490
	bool bRedrawRequested; // 0x491
	float RedrawTime; // 0x494
	FIntPoint CurrentDrawSize; // 0x4a0
	bool bDrawAtDesiredSize; // 0x4a8
	FVector2D Pivot; // 0x4ac
	bool bReceiveHardwareInput; // 0x4b4
	bool bWindowFocusable; // 0x4b5
	EWindowVisibility WindowVisibility; // 0x4b6
	bool bApplyGammaCorrection; // 0x4b7
	ULocalPlayer* OwnerPlayer; // 0x4b8
	FLinearColor BackgroundColor; // 0x4c0
	FLinearColor TintColorAndOpacity; // 0x4d0
	float OpacityFromTexture; // 0x4e0
	EWidgetBlendMode BlendMode; // 0x4e4
	bool bIsTwoSided; // 0x4e5
	bool TickWhenOffscreen; // 0x4e6
	UBodySetup* BodySetup; // 0x4e8
	UMaterialInterface* TranslucentMaterial; // 0x4f0
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4f8
	UMaterialInterface* OpaqueMaterial; // 0x500
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x508
	UMaterialInterface* MaskedMaterial; // 0x510
	UMaterialInterface* MaskedMaterial_OneSided; // 0x518
	UTextureRenderTarget2D* RenderTarget; // 0x520
	UMaterialInstanceDynamic* MaterialInstance; // 0x528
	bool bAddedToScreen; // 0x530
	bool bEditTimeUsable; // 0x531
	FName SharedLayerName; // 0x534
	int32_t LayerZOrder; // 0x53c
	EWidgetGeometryMode GeometryMode; // 0x540
	float CylinderArcAngle; // 0x544
	ETickMode TickMode; // 0x548
	UUserWidget* Widget; // 0x570
};

struct UTigerMasterChallengesConfigAsset : UDataAsset {
	FTigerMasteryChallengesConfig Config; // 0x30
};

struct UTigerPassiveEnragedConfig : UTigerPassiveConfig {
	UAnimMontage* ActivationMontage; // 0x118
	ATigerEnragedEffectActor* EffectActor; // 0x120
	float EffectActorDestructionDelay; // 0x128
	UTigerBuff* OnHitBuff; // 0x130
	float DisciplineDamageMultiplier; // 0x138
	float RegenSpeed; // 0x13c
	float RegenDelay; // 0x140
	float HealthPercentThreshold; // 0x144
	bool bUseBaseHealthPercent; // 0x148
	bool bDamageMultiplierOneTimeUse; // 0x149
};

struct UAkSurfaceReflectorSetComponent : UAkAcousticTextureSetComponent {
	char bEnableSurfaceReflectors : 1; // 0x210
	TArray<FAkPoly> AcousticPolys; // 0x218
	char bEnableDiffraction : 1; // 0x228
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x228
	AActor* AssociatedRoom; // 0x230
};

struct UConnectionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UGizmoLocalVec2ParameterSource : UGizmoBaseVec2ParameterSource {
	FVector2D Value; // 0x48
	FGizmoVec2ParameterChange LastChange; // 0x50
};

struct UTigerDisciplineShockwavePunch : UTigerDisciplineAnimTriggered {
	UTigerShockwavePunchConfig* DisciplineConfig; // 0x110
	UAnimMontage* PickedMontage; // 0x118
};

struct UTigerGameModeLoadingScreens : UDataAsset {
	TMap<TSoftClassPtr<UObject>, UTigerLoadingScreenAsset*> LoadingScreenAssets; // 0x30
};

struct UTigerWeaponMetaData_C : UAnimMetaData {
	bool ShouldUseWeaponAO; // 0x28
};

struct UTigerHUDSettings : USharkLocalDeveloperSettings {
	ETigerDamageNumberAmount DamageNumberAmountSetting; // 0x38
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USubsurfaceProfile : UObject {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UMovieSceneLevelVisibilityTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UTBP_UI_GetDevTicketSection_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTBP_UI_Button_CTA_C* Button_CTA_SignInButton; // 0x268
	UTigerStyledRichTextBlock* DevelopmentLogInText; // 0x270
	UTBP_UI_Divider_C* TBP_UI_Divider_2; // 0x278
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_Development; // 0x280
	UTBP_UI_TextButton_C* TBP_UI_TextButton_ExitGame; // 0x288
	FMulticastInlineDelegate SignIn; // 0x290
	FMulticastInlineDelegate ExitGame; // 0x2a0
};

struct UTigerInteractionControllerComponent : UActorComponent {
	FMulticastInlineDelegate OnTargetInteractionChanged; // 0xb0
	float DiablerizeDotProductCutOff; // 0xc0
	float HeldInputInteractionTime; // 0xc4
	float InteractionLineTraceLength; // 0xc8
	float InteractionLineTraceThickness; // 0xcc
	bool AllowAutomaticPickUpBehindPlayer; // 0xd0
	float AutoPickUpCoolDown; // 0xd4
	FVector AutoPickUpBoxVolumeExtents; // 0xd8
	ATigerPlayerController* TigerPC; // 0xe8
	ATigerPlayer* TigerPlayerPawn; // 0xf0
	TWeakObjectPtr<ATigerCharacter> TargetCharacter; // 0x108
	TWeakObjectPtr<ATigerCharacter> TrainerTarget; // 0x110
	TWeakObjectPtr<ATigerItemWorldRepresentation> InteractionItem; // 0x118
	TWeakObjectPtr<ATigerItemWorldRepresentation> LastAutoPickupItem; // 0x120
	TWeakObjectPtr<ATigerInteractiveObject> TargetInteractiveObject; // 0x128
	ATigerBaseNPC* PotentialFeedingTarget; // 0x130
	TArray<FOverlapResult> TriggerVolumeOverlaps; // 0x148
	TArray<FHitResult> InteractionSweepResults; // 0x168
	TArray<FHitResult> InteractionTraceResults; // 0x188
	TArray<FOverlapResult> AutoPickUpInteractionOverlaps; // 0x1a8
	TWeakObjectPtr<ATigerBaseNPC> CachedVendor; // 0x1c8
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct UTBP_VanishBuff_Master_C : UTigerBuffVanish {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UTBP_ContextualHelp_Consumable_InputReminderOnPickup_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; // 0x38
	bool bRequireCurrentFrameData; // 0x3c
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UDefaultLevelSequenceInstanceData : UObject {
	AActor* TransformOriginActor; // 0x30
	FTransform TransformOrigin; // 0x40
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x478
	int32_t MapHeight; // 0x47c
	int32_t TileWidth; // 0x480
	int32_t TileHeight; // 0x484
	UPaperTileSet* DefaultLayerTileSet; // 0x488
	UMaterialInterface* Material; // 0x490
	TArray<UPaperTileLayer*> TileLayers; // 0x498
	FLinearColor TileMapColor; // 0x4a8
	int32_t UseSingleLayerIndex; // 0x4b8
	bool bUseSingleLayer; // 0x4bc
	UPaperTileMap* TileMap; // 0x4c0
};

struct UTBP_WallClimbEffect_C : UTigerCharacterEffect {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
};

struct UTigerPromotionalUI : UTigerMenuWidget {
	bool bIsPreviewWidget; // 0x2a0
	int32_t ZValue; // 0x2a4
	TSoftObjectPtr<UTexture2D> FirstTimeWelcomeTexturePath; // 0x2a8
	FText FirstTimeWelcomeTitleText; // 0x2d0
	FText FirstTimeWelcomeDescriptionText; // 0x2e8
};

struct UTigerTelemetryDataDefinitions : UObject {
	ETigerPowerKitType ArchetypeDefinitions; // 0x28
	ETigerClan ClanDefinitions; // 0x29
	ETigerTelemetryDamageCauser DamageSourceIdentifiers; // 0x2a
	ETigerTelemetryExpSource ExperienceSources; // 0x2b
	ETigerTelemetryDamageType DamageTypes; // 0x2c
	ETigerDisciplinesEnum Disciplines; // 0x2d
	ETigerTelemetryMatchmackingCancelReason MatchmakingCancelReasons; // 0x2e
	ETigerTelemetryCauseOfPingRemoval CauseOfPingRemoval; // 0x2f
	ETigerTelemetryDeviceType DeviceTypes; // 0x30
	ETigerTelemetryPlatformType PlatformTypes; // 0x31
	ETigerTelemetryMapIds MapIds; // 0x32
	ETigerTelemetryRankedMode RankedModes; // 0x33
	ETigerTelemetryGameplayMode GameplayModes; // 0x34
	ETigerTelemetryChallengeType ChallengeTypes; // 0x35
	ETigerTelemetryItemSourceID TelemetrySourceID; // 0x36
	ETigerTelemetryBattlepassType BattlepassTypes; // 0x37
	ETigerTelemetryHardCurrencyRecieveMethod HardCurrencyReceiveMethod; // 0x38
	ETigerTelemetryNetworkType NetworkTypes; // 0x39
	ETigerTelemetryNetworkIpType NetworkIPType; // 0x3a
	ETigerTelemetryAceRebirthType RebirthType; // 0x3b
	ETigerTelemetryMetaItemSourceType MetaItemSourceType; // 0x3c
	ETigerTelemetryAceDeathType DeathType; // 0x40
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x198
	TArray<FString> ActorGuidStrings; // 0x218
};

struct UTigerDsBackendAgent : UObject {
	FString DsAgentType; // 0x28
	float HeartbeatIntervalSeconds; // 0x38
};

struct UTigerUtilityPowerHSenseComponent : UActorComponent {
	FMulticastInlineDelegate OnHeightenedSensesUsed; // 0xb0
	TArray<FTigerNPCMasqueradeStateMessage> NPCMasqueradeStates; // 0xc0
	TArray<AActor*> ActiveHeightenedSenseObjects; // 0xd0
	float HeightenedSensesDirectLosExtent; // 0xe0
	float HeightenedSensesIndirectLosExtent; // 0xe4
	float MaxFadeInTimer; // 0xe8
	float MaxFadeOutTimer; // 0xec
	float PulseDuration; // 0xf0
	float CooldownTimeAfterActivation; // 0xf4
	float MovementMultiplierWhenActive; // 0xf8
	float CurrentFadeInTimer; // 0xfc
	float CurrentFadeOutTimer; // 0x100
	float CooldownEndTime; // 0x104
	float PulseTimeLeft; // 0x108
	UAkAudioEvent* FailedUseAudioEvent; // 0x110
	int32_t CancellingActions; // 0x118
	bool ActivateHeightenedSensesStartupFinished; // 0x11c
	bool DeactivateHeightenedSensesStartupFinished; // 0x11d
	bool bShouldStopSprintingWhenActive; // 0x11e
	bool bShouldPulse; // 0x11f
	bool bIsHeightenedSensesActive; // 0x120
	TArray<FTigerDisableHSenseTarget> DisabledHeightenedSensesActors; // 0x128
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct ULevelVariantSets : UObject {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct UEditableGeometryCollectionAdapter : UEditableMeshAdapter {
	UGeometryCollection* GeometryCollection; // 0x28
	UGeometryCollection* OriginalGeometryCollection; // 0x30
	int32_t GeometryCollectionLODIndex; // 0x38
};

struct UCurveLinearColorAtlas : UTexture2D {
	uint32_t TextureSize; // 0x110
	TArray<UCurveLinearColor*> GradientCurves; // 0x118
};

struct UBTDecorator_DoesPathExist : UBTDecorator {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct UTBP_AnimMetaData_WeaponIK_C : UAnimMetaData {
	ENUM_WeaponIKOverride LeftHandIK_Enum; // 0x28
	ENUM_WeaponIKOverride RightHandIK_Enum; // 0x29
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x2d0
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct ATigerTrap : AActor {
	FMulticastInlineDelegate OnTriggered; // 0x230
	USceneComponent* Root; // 0x240
	UStaticMeshComponent* TrapMesh; // 0x248
	UBoxComponent* ShootingVolume; // 0x250
	USphereComponent* TriggerVolume; // 0x258
	USphereComponent* ExplosionVolume; // 0x260
	USphereComponent* GasVolume; // 0x268
	UParticleSystemComponent* ArmedParticle; // 0x270
	UParticleSystemComponent* AreaParticle; // 0x278
	UParticleSystemComponent* ExplosionParticle; // 0x280
	UParticleSystemComponent* GasParticle; // 0x288
	UTigerTrapsConfig* Config; // 0x290
	UTigerTrapsConfig* RawConfig; // 0x298
	UTigerBuff* GasBuff; // 0x2a0
	UDecalComponent* Decal; // 0x2a8
	FTigerPersistentPlayerID OwnerPersistentId; // 0x2b0
	int32_t PowerLevel; // 0x2cc
	bool bIsPlaced; // 0x2d0
	bool bIsArmed; // 0x2d1
	bool bTriggered; // 0x2d3
	FVector ForwardDirection; // 0x2e8
	FVector Velocity; // 0x2f4
	UMaterialInstanceDynamic* TrapMaterialInstance; // 0x318
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x228
};

struct UTigerArchetypeSelectElysiumUI : UTigerSceneBackgroundUI {
	TArray<FTigerPersistentPlayerCharacter> PlayerCharacters; // 0x3b0
	FTigerItemId AdditionalCharacterSlotItem; // 0x3c0
	char NumCharacterSlots; // 0x3c8
};

struct AReflectionCapture : AActor {
	UReflectionCaptureComponent* CaptureComponent; // 0x228
};

struct UTigerConsumableAsset : UTigerItemAsset {
	UAnimMontage* Montage; // 0x128
	bool bCanBeUsedWhileMoving; // 0x130
	float UseTime; // 0x134
	int32_t MaxStack; // 0x138
	UAkAudioEvent* BeginUseAudioEvent; // 0x140
	UAkAudioEvent* UseSuccessfulAudioEvent; // 0x148
	UAkAudioEvent* UseFailedAudioEvent; // 0x150
	UTigerCharacterEffect* SuccessfulUseCharacterEffect; // 0x158
	ATigerBuffPostProcess* BeginUsePostProcess; // 0x160
	ATigerBuffPostProcess* SuccessfulBuffPostProcess; // 0x168
};

struct UTigerBuffDOT : UTigerBuff {
	UDamageType* DamageType; // 0x248
	float DamagePerTick; // 0x250
	bool bPlayHitAnimation; // 0x254
	bool bSpawnBloodDecals; // 0x255
};

struct UTigerPingControllerComponent : UActorComponent {
	FMulticastInlineDelegate OnPingUsedInTutorial; // 0xb0
	float MaxTraceLength; // 0xc0
	float WheelHoldTime; // 0xc4
	float DoublePressTimeout; // 0xc8
	float PingHeightOffset; // 0xcc
	float PingSpamPreventionTime; // 0xd0
	ATigerPlayerController* OwningController; // 0xd8
	UTigerPingCoordinator* PingCoordinator; // 0xe0
	UTigerInWorldIconController* WorldIconController; // 0xe8
	TArray<FTigerPingWrapper> ActivePings; // 0xf0
	TArray<FTigerPingWrapper> ReusablePings; // 0x100
	TArray<UTigerPingClientData*> UnresolvedActors; // 0x110
	UTigerPingSetupAsset* PingSetup; // 0x120
	TSoftObjectPtr<UTigerPingSetupAsset> SoftPingSetupPtr; // 0x128
	bool bEnablePingsInTutorial; // 0x239
	float HitItemSphereRadius; // 0x23c
	float VehicleHitForwardDot; // 0x240
};

struct UClothPhysicalMeshDataNv_Legacy : UClothPhysicalMeshDataBase_Legacy {
	TArray<float> MaxDistances; // 0xe0
	TArray<float> BackstopDistances; // 0xf0
	TArray<float> BackstopRadiuses; // 0x100
	TArray<float> AnimDriveMultipliers; // 0x110
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bInInteraction; // 0x88
	FVector RotationOrigin; // 0x8c
	FVector RotationAxis; // 0x98
	FVector RotationPlaneX; // 0xa4
	FVector RotationPlaneY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	float InteractionStartAngle; // 0xd4
	float InteractionCurAngle; // 0xd8
};

struct UInterpTrackInstAkAudioEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UInterpTrackToggle : UInterpTrack {
	TArray<FToggleTrackKey> ToggleTrack; // 0x70
	char bActivateSystemEachUpdate : 1; // 0x80
	char bActivateWithJustAttachedFlag : 1; // 0x80
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UNiagaraSystem : UFXSystemAsset {
	bool bDumpDebugSystemInfo; // 0x30
	bool bDumpDebugEmitterInfo; // 0x31
	bool bRequireCurrentFrameData; // 0x32
	char bFixedBounds : 1; // 0x34
	UNiagaraEffectType* EffectType; // 0x38
	bool bOverrideScalabilitySettings; // 0x40
	TArray<FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x48
	FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x58
	TArray<FNiagaraEmitterHandle> EmitterHandles; // 0x68
	TArray<UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x78
	UNiagaraScript* SystemSpawnScript; // 0x88
	UNiagaraScript* SystemUpdateScript; // 0x90
	FNiagaraSystemCompiledData SystemCompiledData; // 0xa8
	FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x2c0
	FBox FixedBounds; // 0x388
	bool bAutoDeactivate; // 0x3a4
	float WarmupTime; // 0x3a8
	int32_t WarmupTickCount; // 0x3ac
	float WarmupTickDelta; // 0x3b0
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x3b4
	TArray<FName> UserDINamesReadInSystemScripts; // 0x3b8
};

struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UTigerAiShouldReloadDecorator : UBTDecorator {
	bool bBaseUponFullAmmoPercentage; // 0x68
	float ReloadAmmoPercentage; // 0x6c
};

struct UTigerDisciplineStun : UTigerDisciplineBase {
	UTigerStunConfig* Config; // 0x78
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1f8
	int32_t VirtualUserIndex; // 0x218
	int32_t PointerIndex; // 0x21c
	ECollisionChannel TraceChannel; // 0x220
	float InteractionDistance; // 0x224
	EWidgetInteractionSource InteractionSource; // 0x228
	bool bEnableHitTesting; // 0x229
	bool bShowDebug; // 0x22a
	float DebugSphereLineThickness; // 0x22c
	float DebugLineThickness; // 0x230
	FLinearColor DebugColor; // 0x234
	FHitResult CustomHitResult; // 0x2c0
	FVector2D LocalHitLocation; // 0x34c
	FVector2D LastLocalHitLocation; // 0x354
	UWidgetComponent* HoveredWidgetComponent; // 0x360
	FHitResult LastHitResult; // 0x368
	bool bIsHoveredWidgetInteractable; // 0x3f4
	bool bIsHoveredWidgetFocusable; // 0x3f5
	bool bIsHoveredWidgetHitTestVisible; // 0x3f6
};

struct UListViewBase : UWidget {
	UUserWidget* EntryWidgetClass; // 0x108
	float WheelScrollMultiplier; // 0x110
	bool bEnableScrollAnimation; // 0x114
	bool bEnableFixedLineOffset; // 0x115
	float FixedLineScrollOffset; // 0x118
	FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120
	FMulticastInlineDelegate BP_OnEntryReleased; // 0x130
	FUserWidgetPool EntryWidgetPool; // 0x140
};

struct UTigerRichTextBlockDecorator : UObject {
	bool bReveal; // 0x28
	int32_t RevealedIndex; // 0x2c
};

struct ULandscapeHeightfieldCollisionComponent : UPrimitiveComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x450
	int32_t SectionBaseX; // 0x460
	int32_t SectionBaseY; // 0x464
	int32_t CollisionSizeQuads; // 0x468
	float CollisionScale; // 0x46c
	int32_t SimpleCollisionSizeQuads; // 0x470
	TArray<char> CollisionQuadFlags; // 0x478
	FGuid HeightfieldGuid; // 0x488
	FBox CachedLocalBox; // 0x498
	LazyObjectProperty RenderComponent; // 0x4b4
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x4e0
};

struct UTBP_AnimMetaData_StartIsActive_C : UAnimMetaData {
	ENUM_WeaponIKOverride LeftHandIK_Enum; // 0x28
	ENUM_WeaponIKOverride RightHandIK_Enum; // 0x29
};

struct UAkAssetDataSwitchContainerData : UObject {
	TSoftObjectPtr<UAkGroupValue> GroupValue; // 0x28
	UAkGroupValue* DefaultGroupValue; // 0x50
	TArray<UAkMediaAsset*> MediaList; // 0x58
	TArray<UAkAssetDataSwitchContainerData*> Children; // 0x68
};

struct UAkLateReverbComponent : USceneComponent {
	char bEnable : 1; // 0x1f8
	float SendLevel; // 0x1fc
	float FadeRate; // 0x200
	float Priority; // 0x204
	bool AutoAssignAuxBus; // 0x208
	UAkAuxBus* AuxBus; // 0x210
	FString AuxBusName; // 0x218
	UAkAuxBus* AuxBusManual; // 0x230
};

struct ATigerPlayerState : APlayerState {
	bool bGhostModeOnInit; // 0x328
	bool bIsGroupLeader; // 0x329
	UTigerGroupStateComponent* GroupStateComponent; // 0x330
	UTigerPlayerMasqueradeComponent* PlayerMasqueradeComponent; // 0x338
	bool bIsGroupFull; // 0x340
	UTigerPersistentPlayerState* PersistentPlayerState; // 0x348
	FMulticastInlineDelegate OnGroupChangedDelegate; // 0x350
	FMulticastInlineDelegate OnGroupFullnessChangedDelegate; // 0x360
	FMulticastInlineDelegate OnNameChangedDelegate; // 0x370
	FMulticastInlineDelegate OnApperanceChanged; // 0x380
	FMulticastInlineDelegate OnPlayerCardLoaded; // 0x390
	ETigerPowerKitType ArchetypeType; // 0x3a0
	ETigerGroupingMode GROUPINGMODE; // 0x3a1
	FMulticastInlineDelegate OnPawnChanged; // 0x3a8
	FMulticastInlineDelegate OnArchetypeChanged; // 0x3b8
	FMulticastInlineDelegate OnSeasonLevelChanged; // 0x3c8
	UTigerCollectibleProgressCache* CollectibleProgressCache; // 0x3d8
	FTigerGroupId GroupID; // 0x3e0
	int32_t CurrentSpectatorCount; // 0x3f0
	int32_t CurrentSeasonLevel; // 0x3f4
	FTigerCharacterAppearance CharacterAppearance; // 0x3f8
	bool bHasLoadedAppearance; // 0x478
	FTigerPersistentPlayerCardData PlayerCardData; // 0x47c
	bool bHasLoadedPlayerCard; // 0x4a8
	TWeakObjectPtr<APawn> OwningPawn; // 0x52c
	ATigerPlayerAppearanceCache* AppearanceCache; // 0x538
	AActor* Killer; // 0x540
	bool bIsVoipInputDeviceEnabled; // 0x555
};

struct UTigerBuffUnseenPresence : UTigerBuff {
	UTigerBuffUnseenPresenceInstance* BuffInstanceClass; // 0x248
	UAkAudioEvent* NearbySound; // 0x250
	float NearbySoundPlayDistanceSquared; // 0x258
};

struct UMonoWaveTableSynthPreset : UObject {
	FString PresetName; // 0x28
	char bLockKeyframesToGridBool : 1; // 0x38
	int32_t LockKeyframesToGrid; // 0x3c
	int32_t WaveTableResolution; // 0x40
	TArray<FRuntimeFloatCurve> WaveTable; // 0x48
	char bNormalizeWaveTables : 1; // 0x58
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4e0
};

struct UTigerPassionConfig : UTigerActiveDisciplineConfig {
	float ProjectileMinLengthScale; // 0x160
	float ProjectileMaxLengthScale; // 0x164
	float ProjectileMinWidthScale; // 0x168
	float ProjectileMaxWidthScale; // 0x16c
	float ProjectileMinHeightScale; // 0x170
	float ProjectileMaxHeightScale; // 0x174
	float ProjectileMinSpeed; // 0x178
	float ProjectileMaxSpeed; // 0x17c
	float ProjectileMinRange; // 0x180
	float ProjectileMaxRange; // 0x184
	float PanicMinDuration; // 0x188
	float PanicMaxDuration; // 0x18c
	float ApathyMinDuration; // 0x190
	float ApathyMaxDuration; // 0x194
	float ApathyStartSlowMultiplier; // 0x198
	float ApathyEndSlowMultiplier; // 0x19c
	float WrathMinDuration; // 0x1a0
	float WrathMaxDuration; // 0x1a4
	float WrathMinAdditionalDamageMultiplier; // 0x1a8
	float WrathMaxAdditionalDamageMultiplier; // 0x1ac
	UAnimMontage* ChooseEffectAnimation; // 0x1b0
	UAnimMontage* ChargeEffectAnimation; // 0x1b8
	UAnimMontage* ReleaseEffectAnimation; // 0x1c0
	TMap<ETigerPassionEffect, UTigerBuff*> EffectBuffs; // 0x1c8
	TMap<ETigerPassionEffect, UParticleSystem*> ProjectileParticles; // 0x218
	ATigerPassionProjectile* ProjectileActor; // 0x268
	float TimeBetweenEffectChange; // 0x270
	float ChooseEffectTimeOut; // 0x274
	float MaxChargeTime; // 0x278
	float UsageCooldown; // 0x27c
};

struct UABP_VMP_VEN_M_HAIR_06_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x300
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0xb80
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xfe0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x1420
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1860
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1ca0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x20e0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x2100
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x3200
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3640
};

struct UMaterialExpressionMaterialAttributeLayers : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
	FMaterialAttributesInput Input; // 0x58
	FMaterialLayersFunctions DefaultLayers; // 0x70
	TArray<UMaterialExpressionMaterialFunctionCall*> LayerCallers; // 0xb0
	int32_t NumActiveLayerCallers; // 0xc0
	TArray<UMaterialExpressionMaterialFunctionCall*> BlendCallers; // 0xc8
	int32_t NumActiveBlendCallers; // 0xd8
	bool bIsLayerGraphBuilt; // 0xdc
};

struct UABP_VMP_NOS_F_HAIR_03_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2e8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x310
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x750
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0xb90
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xfd0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x1410
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1850
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1c90
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x20d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2510
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x3200
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3640
};

struct UAnimNotifyState_TimedNiagaraEffect : UAnimNotifyState {
	UNiagaraSystem* Template; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UTBP_UI_WinScreen_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Victory_VFX; // 0x268
	UWidgetAnimation* Victory_FadeOut; // 0x270
	UWidgetAnimation* Victory_FadeIn; // 0x278
	UTigerRichTextBlock* AnarchsText; // 0x280
	UImage* Bottom_Curve_Left; // 0x288
	UImage* Bottom_Curve_Right; // 0x290
	UCanvasPanel* CanvasPanel_Win; // 0x298
	UImage* Dot_Left; // 0x2a0
	UImage* Dot_Left_GLOW; // 0x2a8
	UImage* Dot_Right; // 0x2b0
	UImage* Dot_Right_GLOW; // 0x2b8
	UImage* Flashbang_01; // 0x2c0
	UImage* Flashbang_02; // 0x2c8
	UImage* Inner_Arch_Left; // 0x2d0
	UImage* Inner_Arch_Right; // 0x2d8
	UImage* Left_StandardArrow; // 0x2e0
	UImage* Lower_Diamond; // 0x2e8
	UImage* Middle_LowerArrow; // 0x2f0
	UImage* Middle_StandardArrow; // 0x2f8
	UImage* Right_StandardArrow; // 0x300
	UImage* Side_Arrow_Left; // 0x308
	UImage* Side_Arrow_Right; // 0x310
	UTBP_UI_HorizontalFadeSlot_C* TBP_UI_HorizontalFadeSlot; // 0x318
	UImage* Top_Arch; // 0x320
	UImage* Top_Arrow; // 0x328
	UImage* Top_Curve_Left; // 0x330
	UImage* Top_Curve_Right; // 0x338
	UImage* Top_StandardArrow; // 0x340
	UTigerRichTextBlock* VictoryText; // 0x348
	UImage* Win_Flash_VFX; // 0x350
	UImage* Win_VFX; // 0x358
	float Timer; // 0x360
};

struct UTigerPresenceSubsystem : UGameInstanceSubsystem {
	FMulticastInlineDelegate OnPlayerPresenceChange; // 0x30
	FMulticastInlineDelegate OnPlayersPresenceChange; // 0x40
	UTigerPresenceService* PresenceService; // 0x50
	int32_t HeartbeatIntervalInSeconds; // 0x58
};

struct UTigerHealingBuffInstance : UTigerBuffInstance {
	UTigerHealingBuff* BuffConfig; // 0x88
};

struct UTigerAnimNotify_Ragdoll : UAnimNotify {
	FName RagdollOnlyBelowBone; // 0x38
	bool bIncludeNamedBone; // 0x40
	float VelocityScale; // 0x44
};

struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	FEnvTraceData ProjectionData; // 0x50
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x1f8
	FVector SocketOffset; // 0x1fc
	FVector TargetOffset; // 0x208
	float ProbeSize; // 0x214
	ECollisionChannel ProbeChannel; // 0x218
	char bDoCollisionTest : 1; // 0x21c
	char bUsePawnControlRotation : 1; // 0x21c
	char bInheritPitch : 1; // 0x21c
	char bInheritYaw : 1; // 0x21c
	char bInheritRoll : 1; // 0x21c
	char bEnableCameraLag : 1; // 0x21c
	char bEnableCameraRotationLag : 1; // 0x21c
	char bUseCameraLagSubstepping : 1; // 0x21c
	char bDrawDebugLagMarkers : 1; // 0x21d
	float CameraLagSpeed; // 0x220
	float CameraRotationLagSpeed; // 0x224
	float CameraLagMaxTimeStep; // 0x228
	float CameraLagMaxDistance; // 0x22c
};

struct UTigerSpawnMechanicRandomPlayerStart : UTigerSpawnMechanic {
	ATigerGameMode* GameMode; // 0x28
	TArray<AActor*> AllPlayerStarts; // 0x30
	TArray<AActor*> UnusedPlayerStarts; // 0x40
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct UAISense : UObject {
	float DefaultExpirationAge; // 0x28
	EAISenseNotifyType NotifyType; // 0x2c
	char bWantsNewPawnNotification : 1; // 0x30
	char bAutoRegisterAllPawnsAsSources : 1; // 0x30
	UAIPerceptionSystem* PerceptionSystemInstance; // 0x38
};

struct ATigerItemWorldRepresentation : AActor {
	UTigerCompassMarkerWidget* CompassMarker; // 0x230
	UTigerItemAsset* ItemType; // 0x240
	UDataTable* RangedWeaponsDatatable; // 0x248
	int32_t ItemCount; // 0x268
	UStaticMeshComponent* Mesh; // 0x270
	ATigerItemCluster* ItemCluster; // 0x278
	ATigerLootSpawner* LootSpawner; // 0x280
	uint32_t ItemClusterUID; // 0x288
	ETigerTelemetryItemSourceID ItemSourceID; // 0x28c
};

struct UTBP_UI_BloodHuntMarker_C : UTBP_UI_MapMarker_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UWidgetAnimation* PulseAnim_Beat; // 0x2c0
	UWidgetAnimation* PulseAnim; // 0x2c8
	UWidgetAnimation* BloodDot; // 0x2d0
	UImage* BloodHuntImage; // 0x2d8
	UImage* Image_57; // 0x2e0
	UImage* Pulse; // 0x2e8
};

struct UPaperTileSet : UObject {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct UMovieSceneCameraShakeSourceShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x80
};

struct UTBP_ContextualHelp_Consumable_Cancel_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FMulticastInlineDelegate OnDrop; // 0x58
	FMulticastInlineDelegate OnDragCancelled; // 0x68
	FMulticastInlineDelegate OnDragged; // 0x78
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UTigerBloodPotencyVisualizationConfig : UDataAsset {
	TArray<UMaterialInstance*> HeartMeshMaterialTarget; // 0x30
	TSoftObjectPtr<UNiagaraSystem> NiagaraPath; // 0x40
	UParticleSystem* ParticleSystem; // 0x68
	FName ParticleSystemAttachmentSocket; // 0x70
	bool bParticleSystemAbsoluteRotation; // 0x78
};

struct ULocalizedOverlays : UOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct UBoxFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	FTransform Transform; // 0xc0
	EFieldFalloffType Falloff; // 0xf0
};

struct UTigerTraversalStateWallJumpConfig : UTigerTraversalStateConfigBase {
	FTigerWallJumpBlendBundle DefaultWallJumpBlendBundle; // 0x50
	FTigerWallJumpBlendBundle WallJumpBlendBundleFromClimb; // 0x60
	FVector WallJumpColliderOffset; // 0x70
	float PostJumpClimbInteractionDelay; // 0x7c
	float JumpCoolDownTime; // 0x80
	float WallJumpSphereColliderRadius; // 0x84
	float SecondaryWallSweepRadius; // 0x88
	float MaximumHorizontalJumpVelocity; // 0x8c
	float MinimumHorizontalJumpVelocity; // 0x90
	float WallJumpZVelocity; // 0x94
	float WallJumpInputDirectionCutOffAngle; // 0x98
	float MaxWallJumpStateDuration; // 0x9c
	float WallJumpDownwardWallNormalCutOffAngle; // 0xa0
	float WallJumpRequiredHalfAngleFromWallWhenHoldingForward; // 0xa4
	float WallJumpDeadzoneHalfAngle; // 0xa8
	float WallJumpMaxAllowedHalfAngleBeforeClamping; // 0xac
	bool bShouldCapNumberOfWallJumpsFromSimilarWalls; // 0xb0
	float ConsecutiveWallJumpNormalLikenessThreshold; // 0xb4
	float WallJumpDelayTime; // 0xb8
	float WallJumpDownwardSpeedGainInSeconds; // 0xbc
	float WallJumpSlideSpeedScale; // 0xc0
	float WallJumpMinimumWallSlideSpeed; // 0xc4
	float WallJumpMaximumWallSlideSpeed; // 0xc8
	float WallJumpForwardHalfAngleAnimationCutOff; // 0xcc
	ETigerWallJumpInputOption WallJumpInputOption; // 0xd0
	char MaximumNumberOfWallJumpsFromSimilarWall; // 0xd1
	char NumberOfWallJumpsToRestoreOnDoubleJump; // 0xd2
	bool bShouldApplyDownwardForceDuringWallJumpDelay; // 0xd3
	bool AdjustWallJumpSlideSpeedOnInputAngle; // 0xd4
	bool bShouldValidateDownwardAngleOfHitResult; // 0xd5
	UCurveFloat* WallJumpDelaySpeedCurve; // 0xd8
};

struct UTBP_UI_MapPingMarker_C : UTBP_UI_MapMarker_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UCanvasPanel* RootCanvas; // 0x2c0
	UTBP_UI_PingInstanceBase_C* TBP_UI_PingInstanceBase; // 0x2c8
	UTigerPingWorldInstanceUI* PingWidget; // 0x2d0
	UTigerInWorldIconController* InWorldController; // 0x2d8
	bool bShouldDisplayCancelNotification; // 0x2e0
};

struct APawn : AActor {
	char bUseControllerRotationPitch : 1; // 0x230
	char bUseControllerRotationYaw : 1; // 0x230
	char bUseControllerRotationRoll : 1; // 0x230
	char bCanAffectNavigationGeneration : 1; // 0x230
	float BaseEyeHeight; // 0x234
	EAutoReceiveInput AutoPossessPlayer; // 0x238
	EAutoPossessAI AutoPossessAI; // 0x239
	char RemoteViewPitch; // 0x23a
	AController* AIControllerClass; // 0x240
	APlayerState* PlayerState; // 0x248
	AController* LastHitBy; // 0x258
	AController* Controller; // 0x260
	FVector ControlInputVector; // 0x26c
	FVector LastControlInputVector; // 0x278
};

struct UTigerEntityCombatComponent : UActorComponent {
	float TimeBeforeAttackingNewPlayer; // 0xb0
	float ClosestAllowedDistanceToBeSprinting; // 0xb4
	float SprintingCooldownDuration; // 0xb8
	float MaxLaserLength; // 0xbc
	float MaxAngleFromOriginalWeapon; // 0xc0
	float LaserInterpolateSpeed; // 0xc4
	float LaserInterpolateRuberbandSpeedMultiplier; // 0xc8
	FName MaterialScaleName; // 0xcc
	FName MaterialFadeLaserName; // 0xd4
	bool bHideLaserDuringReload; // 0xdc
	float NotInCombatFadedLaserLength; // 0xe0
	float ReloadingFadedLaserLength; // 0xe4
	ATigerNPC* NpcOwner; // 0xe8
	UStaticMeshComponent* LaserPointer; // 0x100
	UParticleSystemComponent* LaserPointerOriginGlowParticleSystem; // 0x108
};

struct AArchVisCharacter : ACharacter {
	FString LookUpAxisName; // 0x4b8
	FString LookUpAtRateAxisName; // 0x4c8
	FString TurnAxisName; // 0x4d8
	FString TurnAtRateAxisName; // 0x4e8
	FString MoveForwardAxisName; // 0x4f8
	FString MoveRightAxisName; // 0x508
	float MouseSensitivityScale_Pitch; // 0x518
	float MouseSensitivityScale_Yaw; // 0x51c
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UTigerNosferatuPassiveBestialConfig : UTigerPassiveConfig {
	ATigerBestialTrailVisualizer* TrailVisualizationActor; // 0x118
	UTigerTrackedBuff* TrackedBuffType; // 0x120
	float RevealDistanceSquared; // 0x128
	float LoseDistanceSquared; // 0x12c
	TArray<float> RevealHealthThreshold; // 0x130
	float TrackingTimeSeconds; // 0x140
	bool bEnableTrackingFeedback; // 0x144
};

struct UAkPS4InitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x88
	FAkPS4AdvancedInitializationSettings AdvancedSettings; // 0xb0
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	char bPersistFade : 1; // 0x90
	char bFadeAudio : 1; // 0x90
	FLinearColor FadeColor; // 0x94
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	ESceneTextureId SceneTextureId; // 0x54
	bool bFiltered; // 0x55
};

struct UAnimInstance : UObject {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct UShMidasPaymentSettings : UDeveloperSettings {
	FString IdcInfo; // 0x38
	FString OfferId; // 0x48
	FString ZoneId; // 0x58
	FString GoodsZoneId; // 0x68
	FString PaymentChannel; // 0x78
	FString ProvideType; // 0x88
	bool MidasLogEnabled; // 0x98
};

struct USkeletalBodySetup : UBodySetup {
	bool bSkipScaleFromAnimation; // 0x2a0
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x2a8
};

struct USharkAccounts : UObject {
	UShAccountSettings* Settings; // 0x90
};

struct UTigerInputPresetDataAsset : UDataAsset {
	TMap<FName, FTigerInputPresetData> InputPresets; // 0x30
};

struct ATigerProjectionDashProjectile : AActor {
	float MovementSpeed; // 0x228
	float Duration; // 0x22c
	FVector TargetPosition; // 0x230
	FVector StartingPosition; // 0x23c
	FVector LastValidPosition; // 0x254
	USphereComponent* SphereCollider; // 0x268
	UTigerBuff* ThornsBuff; // 0x270
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct UTigerPreloadedNiagaraSystems : UDataAsset {
	FMulticastInlineDelegate OnLoadedAllAssetsEvent; // 0x30
	TArray<TSoftObjectPtr<UNiagaraSystem>> Systems; // 0x40
};

struct UTigerThrallMapData : UDataAsset {
	UTexture2D* Map; // 0x30
};

struct USourceEffectBitCrusherPreset : USoundEffectSourcePreset {
	FSourceEffectBitCrusherSettings Settings; // 0xc0
};

struct UVariant : UObject {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct UUniformInteger : UFieldNodeInt {
	int32_t Magnitude; // 0xb0
};

struct UMaterialExpressionMultiply : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x80
	ENiagaraRendererSourceDataMode SourceMode; // 0x88
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x90
	ENiagaraSpriteAlignment Alignment; // 0xb0
	ENiagaraSpriteFacingMode FacingMode; // 0xb1
	FVector2D PivotInUVSpace; // 0xb4
	ENiagaraSortMode SortMode; // 0xbc
	FVector2D SubImageSize; // 0xc0
	char bSubImageBlend : 1; // 0xc8
	char bRemoveHMDRollInVR : 1; // 0xc8
	char bSortOnlyWhenTranslucent : 1; // 0xc8
	char bGpuLowLatencyTranslucency : 1; // 0xc8
	float MinFacingCameraBlendDistance; // 0xcc
	float MaxFacingCameraBlendDistance; // 0xd0
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x248
	FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x2a0
	FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x2f8
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x400
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x458
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4b0
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x508
	FNiagaraVariableAttributeBinding UVScaleBinding; // 0x560
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x5b8
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x610
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x668
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x6c0
	TArray<FNiagaraMaterialAttributeBinding> MaterialParameterBindings; // 0x718
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct ATigerAiPermanentCap : ATigerAiSpawningCap {
	TArray<UTigerAICommandBase*> Commands; // 0x290
	ETigerCivilianEmotionalState EmotionalState; // 0x2a0
	FName CapContextBase; // 0x2a4
	int32_t CapContextStartingIndex; // 0x2ac
	UTigerNPCAsset* NpcAssetToSpawn; // 0x2b0
	int32_t LoopingStartIndex; // 0x2b8
	TWeakObjectPtr<ATigerNPC> PermanentNpc; // 0x2bc
};

struct UTigerDisciplineBase : UObject {
	ATigerCharacter* Owner; // 0x28
	UTigerDisciplineComponent* DisciplineComponent; // 0x30
	UTigerActiveDisciplineConfig* BaseConfig; // 0x38
	int32_t PowerLevel; // 0x58
	float AIUseDuration; // 0x64
	float AIMinCooldownDuration; // 0x68
	float AIMaxCooldownDuration; // 0x6c
};

struct UTigerAnimNotifyState_CancelReactionIfThreatened : UAnimNotifyState {
	ETigerAIAnimationMode StateToCancelFor; // 0x30
};

struct UTigerFriend : UObject {
	FMulticastInlineDelegate OnOnlineStatusChanged; // 0x28
	FMulticastInlineDelegate OnLocationChanged; // 0x38
	FString DISPLAYNAME; // 0x48
	FTigerPersistentPlayerID PlayerId; // 0x58
	FSharkUserId SharkmobUserId; // 0x68
	FString PlatformUesrId; // 0x78
	FString Location; // 0x90
};

struct ATigerWorldCompositionGrid : AActor {
	FMulticastInlineDelegate OnCellStartedLoadingEvent; // 0x228
	FMulticastInlineDelegate OnCellFinishedLoadingEvent; // 0x238
	FMulticastInlineDelegate OnCellStartedUnloadingEvent; // 0x248
	FMulticastInlineDelegate OnCellFinishedUnloadingEvent; // 0x258
	FMulticastInlineDelegate OnPrespawnStreamingFinishedEvent; // 0x268
	ETigerWorldCompositionGridLayout Layout; // 0x278
	FVector GridExtent; // 0x27c
	int32_t LevelDepth; // 0x288
	float CellTriggerSizeBias; // 0x28c
	TArray<TSoftObjectPtr<UWorld>> BlackListedLevels; // 0x290
	TArray<TSoftObjectPtr<UWorld>> AdditionalLevels; // 0x2a0
	TArray<TSoftObjectPtr<UWorld>> AlwaysLoadedLevels; // 0x2b0
	UTigerWorldCompositionCellComponent* RootCellComponent; // 0x2c0
	TArray<UTigerWorldCompositionCellComponent*> LoadingCells; // 0x2c8
	TArray<UTigerWorldCompositionCellComponent*> LoadedCells; // 0x2d8
	TArray<UTigerWorldCompositionCellComponent*> UnloadingCells; // 0x2e8
	TArray<FTigerRecentlyStreamedCellEntries> RecentlyLoadedCells; // 0x2f8
	TArray<FTigerRecentlyStreamedCellEntries> RecentlyUnloadedCells; // 0x308
	TArray<FTigerStreamingPlayer> StreamingPlayers; // 0x318
};

struct UTigerContextualHelp : UObject {
	float LifeTimeInSeconds; // 0x28
	FText HeaderText; // 0x30
	FText DescriptionText; // 0x48
	FName InputAction; // 0x60
	bool bShouldHideOnInput; // 0x68
	TSoftObjectPtr<UTexture2D> Icon; // 0x70
	int32_t MatchesPlayedLimit; // 0x98
	bool bWantsToShow; // 0x9c
	float CooldownInSeconds; // 0xa0
	ETigerContextualHelpType ContextualHelpType; // 0xa4
	ETigerContextualHelpShouldShowInGameMode ShouldShowInGameMode; // 0xa5
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UARPlaneGeometry : UARTrackedGeometry {
	EARPlaneOrientation Orientation; // 0xf8
	FVector Center; // 0xfc
	FVector Extent; // 0x108
	TArray<FVector> BoundaryPolygon; // 0x118
	UARPlaneGeometry* SubsumedBy; // 0x128
};

struct UTssSDKSettings : UDeveloperSettings {
	uint32_t GameID; // 0x38
	FString AuthToken; // 0x40
};

struct UTigerDisciplineVanish : UTigerDisciplineBase {
	UTigerVanishConfig* Config; // 0x78
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x468
	float CapsuleRadius; // 0x46c
};

struct UNetReplicationGraphConnection : UReplicationConnectionDriver {
	UNetConnection* NetConnection; // 0x28
	AReplicationGraphDebugActor* DebugActor; // 0x170
	TArray<FLastLocationGatherInfo> LastGatherLocations; // 0x188
	TArray<UReplicationGraphNode*> ConnectionGraphNodes; // 0x1a0
	UReplicationGraphNode_TearOff_ForConnection* TearOffNode; // 0x1b0
};

struct APaperSpriteActor : AActor {
	UPaperSpriteComponent* RenderComponent; // 0x228
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UTigerCharacterCardShapeCustomization : UTigerPlayerCardCustomization {
	TSoftObjectPtr<UTexture2D> CardShapeMask; // 0x110
};

struct UTigerVanishConfig : UTigerActiveDisciplineConfig {
	TArray<UTigerBuff*> VanishBuff; // 0x160
	FText MovementSpeedText; // 0x170
	FText MovementSpeedSuffix; // 0x188
};

struct UMovieScenePropertySystem : UMovieSceneEntitySystem {
	UMovieScenePropertyInstantiatorSystem* InstantiatorSystem; // 0x40
};

struct UMenuAnchor : UContentWidget {
	UUserWidget* MenuClass; // 0x120
	FDelegate OnGetMenuContentEvent; // 0x128
	FDelegate OnGetUserMenuContentEvent; // 0x138
	EMenuPlacement Placement; // 0x148
	bool bFitInWindow; // 0x149
	bool ShouldDeferPaintingAfterWindowContent; // 0x14a
	bool UseApplicationMenuStack; // 0x14b
	FMulticastInlineDelegate OnMenuOpenChanged; // 0x150
};

struct ATigerDoor : ATigerInteractiveObject {
	UStaticMeshComponent* DoorMesh; // 0x280
	ATigerPlayer* InteractingPlayer; // 0x288
};

struct UMaterialExpressionVolumetricAdvancedMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput PhaseG; // 0x40
	FExpressionInput PhaseG2; // 0x54
	FExpressionInput PhaseBlend; // 0x68
	FExpressionInput MultiScatteringContribution; // 0x7c
	FExpressionInput MultiScatteringOcclusion; // 0x90
	FExpressionInput MultiScatteringEccentricity; // 0xa4
	FExpressionInput ConservativeDensity; // 0xb8
	float ConstPhaseG; // 0xcc
	float ConstPhaseG2; // 0xd0
	float ConstPhaseBlend; // 0xd4
	bool PerSamplePhaseEvaluation; // 0xd8
	uint32_t MultiScatteringApproximationOctaveCount; // 0xdc
	float ConstMultiScatteringContribution; // 0xe0
	float ConstMultiScatteringOcclusion; // 0xe4
	float ConstMultiScatteringEccentricity; // 0xe8
	bool bGroundContribution; // 0xec
	bool bGrayScaleMaterial; // 0xed
	bool bRayMarchVolumeShadow; // 0xee
};

struct UTigerBuffMeleeChargeAttackInstance : UTigerBuffInstance {
	UTigerBuffMeleeChargeAttack* MeleeChargeAttackBuff; // 0x88
	ATigerPlayer* Player; // 0x90
	UParticleSystemComponent* ActiveAttackParticles; // 0x98
};

struct UTigerLinearColorSetAsset : UDataAsset {
	TMap<FName, FLinearColor> ColorSets; // 0x30
	TMap<FName, float> ScalarParameters; // 0x80
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0x88
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xc8
	UEnum* StateEnum; // 0xe8
	AActor* SharingActor; // 0xf0
};

struct UTigerCharacterEyebrowCustomization : UTigerCharacterPartOfHeadCustomization {
	FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110
};

struct UTigerDisciplineParticleStrategy : UTigerParticleStrategyPostSpawn {
	FLinearColor StandardColorOverride; // 0x28
	FLinearColor EnemyColorOverride; // 0x38
	ETigerDisciplineParticleStrategyColorModes ColorOverrideMode; // 0x48
	FName ColorParameterName; // 0x4c
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UTigerHitVerificationSettings : UDeveloperSettings {
	bool bEnableVerification; // 0x38
	float MaxEndPointDistance; // 0x3c
	float MaxStartingPointDistance; // 0x40
	float SkipSimulatePathDistanceSquared; // 0x44
	float MaxAngleDeviationFromPredictedPath; // 0x48
	float MaxDistanceFromProjectilePath; // 0x4c
	int32_t MinPathCountForLOSSubdivideCheck; // 0x50
	int32_t MinPathCountForComplexLOSCheck; // 0x54
	int32_t MaxComplexLOSChecks; // 0x58
};

struct UTigerPingMarkerProxy : UTigerMapMarkerProxy {
	UTigerPingClientData* PingData; // 0x68
};

struct UTBP_ContextualHelp_Tutorial_Slide_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UTigerTraversalLedgeGrabState : UTigerTraversalBaseFiniteState {
	UTigerTraversalStateLedgeGrabConfig* LedgeGrabConfig; // 0x40
};

struct UTigerAiPlayerMainStateService : UBTService {
	ATigerLocalAIController* LocalAIController; // 0x78
	ATigerPlayer* AiPlayer; // 0x80
	ATigerCharacter* TargetCharacter; // 0x88
	UTigerInventoryComponent* LocalAiInventory; // 0x90
	ATigerCharacter* CharacterFromWhichFleeing; // 0x98
	float FleeAttackDistance; // 0xd0
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UGeometryCacheTrack_FlipbookAnimation : UGeometryCacheTrack {
	uint32_t NumMeshSamples; // 0x58
};

struct UTigerCustomBlendSpaceListClan : UTigerCustomBlendSpaceList {
	UBlendSpace* BlendSpaces[0x4]; // 0x28
};

struct USequenceCameraShakeSequencePlayer : UObject {
	UObject* BoundObjectOverride; // 0x480
	UMovieSceneSequence* Sequence; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x490
};

struct UTigerAnimNotifyState_AbortAnimationOnInput : UAnimNotifyState {
	float BlendOutTime; // 0x30
	bool bShouldAbortOnMovement; // 0x34
	bool bShouldAbortOnHeldBlock; // 0x35
};

struct UTBP_ContextualHelp_Ammo_Reserves_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UAkMarkerCallbackInfo : UAkEventCallbackInfo {
	int32_t Identifier; // 0x38
	int32_t Position; // 0x3c
	FString Label; // 0x40
};

struct ATigerProjectile : AActor {
	USphereComponent* CollisionComp; // 0x228
	UProjectileMovementComponent* ProjectileMovement; // 0x230
	UParticleSystemComponent* BulletTrail; // 0x238
	UStaticMeshComponent* ProjectileMesh; // 0x240
	UTigerRangedWeapon* RangedWeaponType; // 0x248
	EHitAudio HitAudioEnum; // 0x258
	bool bDoProjectileCollision; // 0x259
	bool bIsKilled; // 0x25a
	bool bWillBeReflected; // 0x25b
	bool bIsReflected; // 0x25c
	bool bWasHeadShot; // 0x25d
	bool bIsPooled; // 0x25e
	UTigerProjectilePool* HomeProjectilePool; // 0x260
	UNiagaraComponent* TraceNiagaraComponent; // 0x268
	TArray<FTigerRangedHitInfo> PiercedCharacters; // 0x2a0
	TArray<ATigerCharacter*> HitCharacters; // 0x2b0
};

struct UTigerTraversalJumpState : UTigerTraversalBaseFiniteState {
	UTigerTraversalStateJumpConfig* JumpConfig; // 0x40
};

struct UABP_Civilian_C : UTigerNpcAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x430
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x438
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x4f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x520
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x548
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x5c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x5f8
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x678
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x6a8
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x728
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x758
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x808
	FTigerFilteredLayeredBlend TigerAnimGraphNode_FilteredLayeredBlending; // 0x8a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x970
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x998
	FTigerAnimNode_RandomPlayer TigerAnimGraphNode_RandomPlayer; // 0x9e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa78
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xaa0
	FAnimNode_Root AnimGraphNode_Root; // 0xbf8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xc28
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0xcf0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xed0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x10b0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x10d0
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x10f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1138
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1160
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x12b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1358
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1380
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1400
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1448
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x15a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x15e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1740
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1768
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x18c0
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x18e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1930
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1958
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1980
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x19a8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x19d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1ad8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1b58
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x1b78
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1b98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1bc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1c88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1d08
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1d88
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1db8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1e78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1ef8
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1f78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1fa8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1fd0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1ff8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2020
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2048
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2070
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2098
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x20c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x20e8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x2168
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x2188
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x21a8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x22b0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x23b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x24c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x25c8
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x26d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2700
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2780
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x27a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x27c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x28c8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x29d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x2ad8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x2be0
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2ce8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2d18
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2d98
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2db8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x2dd8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x2ee0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x2fe8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x30f0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x31f8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x3300
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3330
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3350
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x3370
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x3478
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x3580
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x3688
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3790
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3898
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3918
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3948
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x39c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x39f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3a98
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x3b18
	FAnimNode_Slot AnimGraphNode_Slot; // 0x3ba8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3bf0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x3c20
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3cd0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3d00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x3db0
	bool bIsDedicatedServer; // 0x3dd8
	FVector LeftFootstepPosition; // 0x3ddc
	float LeftFootstepTime; // 0x3de8
	float RightFootstepTime; // 0x3dec
	FVector RightFootstepPosition; // 0x3df0
	FRotator CharacterRotation; // 0x3dfc
	float YawDelta; // 0x3e08
	float DeltaX; // 0x3e0c
	float YawDeltaSmooth; // 0x3e10
	bool IsBeingFeedOn; // 0x3e14
	bool IsRecovering; // 0x3e15
	bool FullyRecoverd; // 0x3e16
	bool InContextIdle; // 0x3e17
	FName CachedContextBasedIdle; // 0x3e18
	bool IsHoldingProp; // 0x3e20
	FName FaceAnimSlotName_00; // 0x3e24
	FName FaceAnimSlotName_01; // 0x3e2c
	FName FaceAnimSlotName_02; // 0x3e34
	FName FaceAnimSlotName_03; // 0x3e3c
	FRotator LookAtSpineRotator; // 0x3e44
	FRotator LookAtHeadRotator; // 0x3e50
	float LookAtVertical; // 0x3e5c
	float LookAtHorizontal; // 0x3e60
	float LookAtHorizontalSlow; // 0x3e64
	float AimYawDelta; // 0x3e68
	float Speed_Smooth; // 0x3e6c
	TArray<UAnimMontage*> React Montage; // 0x3e70
};

struct UTigerBuildingWallStreamingSettings : USharkLocalDeveloperSettings {
	int32_t WallsToStreamPerFrame; // 0x38
	bool bLoggingEnabled; // 0x3c
};

struct UTigerDisciplinePassion : UTigerDisciplineBase {
	UTigerPassionConfig* Config; // 0x78
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UTigerUtilityPowerLureComponent : UTigerUtilityPowerBaseComponent {
	float TimeToLure; // 0xe8
	UAnimMontage* LureAnimation; // 0xf0
	USoundBase* LureWhistleSound; // 0xf8
	float ClientFeedbackUpdateTickInterval; // 0x100
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UARTrackableNotifyComponent : UActorComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x110
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130
	FMulticastInlineDelegate OnAddTrackedImage; // 0x140
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160
	FMulticastInlineDelegate OnAddTrackedFace; // 0x170
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f0
};

struct UTigerCharacterTattooCustomization : UTigerInventoryItemBase {
	FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110
};

struct UClickDragInputBehavior : UAnyButtonInputBehavior {
	bool bUpdateModifiersDuringDrag; // 0x120
};

struct UTigerResurrectComponent : UActorComponent {
	int32_t TokenCount; // 0xb0
	ATigerPlayer* MyPawnToResurrect; // 0xc8
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x450
	int32_t SectionBaseY; // 0x454
	int32_t ComponentSizeQuads; // 0x458
	int32_t SubsectionSizeQuads; // 0x45c
	int32_t NumSubsections; // 0x460
	UMaterialInterface* OverrideMaterial; // 0x468
	UMaterialInterface* OverrideHoleMaterial; // 0x470
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x478
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x488
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x498
	TArray<int8_t> LODIndexToMaterialIndex; // 0x4a8
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4b8
	UTexture2D* XYOffsetmapTexture; // 0x4c8
	FVector4 WeightmapScaleBias; // 0x4d0
	float WeightmapSubsectionOffset; // 0x4e0
	FVector4 HeightmapScaleBias; // 0x4f0
	FBox CachedLocalBox; // 0x500
	LazyObjectProperty CollisionComponent; // 0x51c
	UTexture2D* HeightmapTexture; // 0x538
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x540
	TArray<UTexture2D*> WeightmapTextures; // 0x550
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x560
	FGuid MapBuildDataId; // 0x568
	TArray<FGuid> IrrelevantLights; // 0x578
	int32_t CollisionMipLevel; // 0x588
	int32_t SimpleCollisionMipLevel; // 0x58c
	float NegativeZBoundsExtension; // 0x590
	float PositiveZBoundsExtension; // 0x594
	float StaticLightingResolution; // 0x598
	int32_t ForcedLOD; // 0x59c
	int32_t LODBias; // 0x5a0
	FGuid StateId; // 0x5a4
	FGuid BakedTextureMaterialGuid; // 0x5b4
	UTexture2D* GIBakedBaseColorTexture; // 0x5c8
	char MobileBlendableLayerMask; // 0x5d0
	UMaterialInterface* MobileMaterialInterface; // 0x5d8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5e0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5f0
};

struct UNiagaraDataInterfaceNeighborGrid3D : UNiagaraDataInterfaceGrid3D {
	uint32_t MaxNeighborsPerCell; // 0x100
};

struct UTigerConsumablesComponent : UActorComponent {
	FMulticastInlineDelegate OnUseConsumableFinished; // 0xb0
	FMulticastInlineDelegate OnUseConsumableStarted; // 0xc0
	FMulticastInlineDelegate OnUseConsumableCancelled; // 0xd0
	FMulticastInlineDelegate OnUseConsumablePrevented; // 0xe0
	UAnimMontage* FallbackUseMontage; // 0xf0
	UTigerConsumableAsset* QuickUseConsumable; // 0xf8
	UTigerBuff* MovableBuffClass; // 0x100
	int32_t CancelConsumableUseOnTraversalAction; // 0x108
	ATigerPlayer* Player; // 0x110
	UAnimMontage* CurrentMontage; // 0x118
	UTigerConsumableAsset* CurrentConsumable; // 0x120
	UTigerConsumableAsset* QuickConsumables[0x6]; // 0x128
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x40
	FGuid ExpressionGUID; // 0x50
};

struct UTigerPersistentPlayerState : UActorComponent {
	FMulticastInlineDelegate OnDailyChallengesInitializedEvent; // 0xd8
	FMulticastInlineDelegate OnRewardsLoaded; // 0xe8
	FMulticastInlineDelegate OnClientTransactionalPlayerDataChangedEvent; // 0xf8
	FMulticastInlineDelegate OnClientPlayerInventoryChanged; // 0x108
	FMulticastInlineDelegate OnSelectedCharacterChanged; // 0x118
	FMulticastInlineDelegate OnChallengeProgressUpdated; // 0x128
	FMulticastInlineDelegate OnSeasonLevelGained; // 0x180
	UTigerThrallSystem* PlayerThrallSystem; // 0x190
	UTigerCollectibleSystem* PlayerCollectibleSystem; // 0x198
	UObject* ServerCallbacks; // 0x1b0
	FSharkUserId SharkmobUserId; // 0x1d8
	FTigerPersistentPlayerID PersistentPlayerID; // 0x1e8
	EShAccountChannel AccountChannel; // 0x1f8
	TArray<FTigerPersistentPlayerCharacter> CachedPlayerCharacters; // 0x350
	TMap<FString, UTigerQuestline*> ActiveQuests; // 0x360
	TMap<FString, UTigerQuestline*> CompletedQuests; // 0x3b0
	TMap<FTigerChallengeTypeID, UTigerChallenge*> DailyChallenges; // 0x4b0
	TMap<FTigerChallengeInstanceID, UTigerChallenge*> SeasonalChallenges; // 0x500
	TMap<FTigerChallengeInstanceID, int32_t> PendingWeeklyChallengeUpdates; // 0x550
	TMap<FTigerChallengeInstanceID, UTigerChallenge*> MasteryChallenges; // 0x5a0
};

struct ATBP_ProjectionDashProjectile_C : ATigerProjectionDashProjectile {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	USceneComponent* IconRoot; // 0x288
	UParticleSystemComponent* Trail; // 0x290
	float Size; // 0x298
	bool Archetype; // 0x29c
	int32_t ProjectionDashSirenAkEventID; // 0x2a0
	int32_t ProjectionDashLoopAkEventID; // 0x2a4
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x140
	char bReverseAsBrake : 1; // 0x140
	char bUseRVOAvoidance : 1; // 0x140
	char bRawHandbrakeInput : 1; // 0x140
	char bRawGearUpInput : 1; // 0x140
	char bRawGearDownInput : 1; // 0x140
	char bWasAvoidanceUpdated : 1; // 0x144
	float Mass; // 0x148
	TArray<FWheelSetup> WheelSetups; // 0x150
	float DragCoefficient; // 0x160
	float ChassisWidth; // 0x164
	float ChassisHeight; // 0x168
	float DragArea; // 0x16c
	float EstimatedMaxEngineSpeed; // 0x170
	float MaxEngineRPM; // 0x174
	float DebugDragMagnitude; // 0x178
	FVector InertiaTensorScale; // 0x17c
	float MinNormalizedTireLoad; // 0x188
	float MinNormalizedTireLoadFiltered; // 0x18c
	float MaxNormalizedTireLoad; // 0x190
	float MaxNormalizedTireLoadFiltered; // 0x194
	float ThresholdLongitudinalSpeed; // 0x198
	int32_t LowForwardSpeedSubStepCount; // 0x19c
	int32_t HighForwardSpeedSubStepCount; // 0x1a0
	TArray<UVehicleWheel*> Wheels; // 0x1a8
	float RVOAvoidanceRadius; // 0x1d0
	float RVOAvoidanceHeight; // 0x1d4
	float AvoidanceConsiderationRadius; // 0x1d8
	float RVOSteeringStep; // 0x1dc
	float RVOThrottleStep; // 0x1e0
	int32_t AvoidanceUID; // 0x1e4
	FNavAvoidanceMask AvoidanceGroup; // 0x1e8
	FNavAvoidanceMask GroupsToAvoid; // 0x1ec
	FNavAvoidanceMask GroupsToIgnore; // 0x1f0
	float AvoidanceWeight; // 0x1f4
	FVector PendingLaunchVelocity; // 0x1f8
	FReplicatedVehicleState ReplicatedState; // 0x204
	float RawSteeringInput; // 0x21c
	float RawThrottleInput; // 0x220
	float RawBrakeInput; // 0x224
	float SteeringInput; // 0x228
	float ThrottleInput; // 0x22c
	float BrakeInput; // 0x230
	float HandbrakeInput; // 0x234
	float IdleBrakeInput; // 0x238
	float StopThreshold; // 0x23c
	float WrongDirectionThreshold; // 0x240
	FVehicleInputRate ThrottleInputRate; // 0x244
	FVehicleInputRate BrakeInputRate; // 0x24c
	FVehicleInputRate HandbrakeInputRate; // 0x254
	FVehicleInputRate SteeringInputRate; // 0x25c
	AController* OverrideController; // 0x288
};

struct UBoxComponent : UShapeComponent {
	FVector BoxExtent; // 0x468
	float LineThickness; // 0x474
};

struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	ENDIStaticMesh_SourceMode SourceMode; // 0x38
	UStaticMesh* DefaultMesh; // 0x40
	AActor* Source; // 0x48
	UStaticMeshComponent* SourceComponent; // 0x50
	FNDIStaticMeshSectionFilter SectionFilter; // 0x58
	bool bUsePhysicsBodyVelocity; // 0x68
	TArray<FName> FilteredSockets; // 0x70
};

struct USoundNodeParamCrossFade : USoundNodeDistanceCrossFade {
	FName ParamName; // 0x58
};

struct ATigerSplatmap : AActor {
	UMaterialParameterCollection* SplatmapParameterCollection; // 0x228
	UTextureRenderTarget2D* SplatTextureRenderTarget; // 0x230
	UMaterial* SplatmapCellReadMaterial; // 0x238
	UMaterialInstanceDynamic* SplatmapCellReadMaterialInstance; // 0x240
	float BoundsSize; // 0x248
	UTigerSplatmapGenerationSettings* CurrentGenerationSettings; // 0x250
	TArray<TWeakObjectPtr<ATigerSplatmapCell>> SplatmapCells; // 0x258
	USceneComponent* Root; // 0x268
	AActor* CellOwner; // 0x270
	float TickInterval; // 0x278
	float MinRerenderDistance; // 0x27c
};

struct UDatasmithCineCameraComponentTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings; // 0x30
	FDatasmithCameraLensSettingsTemplate LensSettings; // 0x38
	FDatasmithCameraFocusSettingsTemplate FocusSettings; // 0x3c
	float CurrentFocalLength; // 0x44
	float CurrentAperture; // 0x48
	FDatasmithPostProcessSettingsTemplate PostProcessSettings; // 0x50
};

struct UTigerCrosshairWidget : UTigerWidget {
	ETargetInteraction PreviousInteraction; // 0x280
	UObject* PreviousInteractionObject; // 0x288
	TWeakObjectPtr<ATigerCharacter> PreviousInteractionCharacter; // 0x290
	UTigerInventoryComponent* Inventory; // 0x298
	UMaterialInstanceDynamic* ProgressBarMaterial; // 0x2a0
	UCanvasPanel* RootPanel; // 0x2a8
	ATigerPlayer* TigerPlayer; // 0x2b0
	UTigerWeaponCrosshairWidget* CurrentWeaponCrosshair; // 0x2b8
	TArray<UTigerWeaponCrosshairWidget*> PreviousWeaponCrosshairs; // 0x2c0
	float ProgressValue; // 0x2d0
	ETigerUIColor CurrentProgressBarColor; // 0x2d4
};

struct ATBP_BuffPostProcess_Master_C : ATigerBuffPostProcess {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UCurveFloat* VisibilityCurve; // 0x240
	float CurrentDuration; // 0x248
	float TotalDuration; // 0x24c
	float CurrentHideDuration; // 0x250
	float TotalHideDuration; // 0x254
	int32_t CurrentlyShownID; // 0x258
	float AdditionalDuration; // 0x25c
	bool UseHideDuration; // 0x260
};

struct UTigerBuffVanishInstance : UTigerBuffInstance {
	UTigerBuffVanish* VanishBuff; // 0x88
	ATigerPlayer* Player; // 0x90
};

struct ATigerBloodVeinBranch : AActor {
	FMulticastInlineDelegate OnReachedEndOfBloodVeinBranch; // 0x228
	UStaticMesh* VeinSplineMesh; // 0x238
	ATigerBloodVeinPawn* ControllingPawn; // 0x240
	USceneComponent* CurrentPlayerSpot; // 0x248
	float LandSoundEventTimeOffset; // 0x250
	float SplineMeshDistance; // 0x254
	float SplineScale; // 0x258
	TArray<USplineMeshComponent*> GeneratedSplineMeshes; // 0x260
	UTigerBloodVeinBranchMovementComponent* MovementComponent; // 0x270
};

struct AAkSpotReflector : AActor {
	UAkAuxBus* EarlyReflectionAuxBus; // 0x228
	FString EarlyReflectionAuxBusName; // 0x230
	UAkAcousticTexture* AcousticTexture; // 0x240
	float DistanceScalingFactor; // 0x248
	float Level; // 0x24c
};

struct UInterpTrackInstBoolProp : UInterpTrackInstProperty {
	bool ResetBool; // 0x60
};

struct USkyAtmosphereComponent : USceneComponent {
	ESkyAtmosphereTransformMode TransformMode; // 0x1f8
	float BottomRadius; // 0x1fc
	FColor GroundAlbedo; // 0x200
	float AtmosphereHeight; // 0x204
	float MultiScatteringFactor; // 0x208
	float TraceSampleCountScale; // 0x20c
	float RayleighScatteringScale; // 0x210
	FLinearColor RayleighScattering; // 0x214
	float RayleighExponentialDistribution; // 0x224
	float MieScatteringScale; // 0x228
	FLinearColor MieScattering; // 0x22c
	float MieAbsorptionScale; // 0x23c
	FLinearColor MieAbsorption; // 0x240
	float MieAnisotropy; // 0x250
	float MieExponentialDistribution; // 0x254
	float OtherAbsorptionScale; // 0x258
	FLinearColor OtherAbsorption; // 0x25c
	FTentDistribution OtherTentDistribution; // 0x26c
	FLinearColor SkyLuminanceFactor; // 0x278
	float AerialPespectiveViewDistanceScale; // 0x288
	float HeightFogContribution; // 0x28c
	float TransmittanceMinLightElevationAngle; // 0x290
	float AerialPerspectiveStartDepth; // 0x294
	FGuid bStaticLightingBuiltGUID; // 0x2bc
};

struct UTigerRejuvenatingVoiceConfig : UTigerDisciplineAnimTriggeredConfig {
	UAnimMontage* DownedMontage; // 0x170
	UAnimMontage* DownedCancelMontage; // 0x178
	UAnimMontage* DownedInterruptMontage; // 0x180
	UAnimMontage* CancelMontage; // 0x188
	UAnimMontage* InterruptMontage; // 0x190
	UTigerBuff* HealingBuff; // 0x198
	float ReceivedDamageThreshold; // 0x1a0
	float CasterHealRange; // 0x1a4
	float ProjectionHealRange; // 0x1a8
	float ProjectionHealMultiplier; // 0x1ac
	float FirstHealMultiplier; // 0x1b0
	float SelfHealFlat; // 0x1b4
	float SelfHealPercent; // 0x1b8
	float TeamHealFlat; // 0x1bc
	float TeamHealPercent; // 0x1c0
	float HealTickRate; // 0x1c4
	bool bOnlyHealRecentDamage; // 0x1c8
	bool bRecentDamageVisibleForGroup; // 0x1c9
	bool bShouldGlideWhenActive; // 0x1ca
};

struct UDeviceProfileManager : UObject {
	TArray<UObject*> Profiles; // 0x28
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UTigerHeatmapCollector : UObject {
	TMap<ATigerCharacter*, FTigerCampingData> CampingData; // 0xe8
	FTimerHandle CharacterMovementTimerHandle; // 0x138
};

struct UTigerCharacterHeadConfiguration : UTigerCharacterPartOfHeadCustomization {
	FTigerLodSplitMesh SplitMesh; // 0x110
	TSoftObjectPtr<UPoseAsset> FacePostAsset; // 0x188
	TSoftObjectPtr<UAnimSequence> FacePoseSourceAnimation; // 0x1b0
	TArray<TSoftObjectPtr<UMaterialInterface>> BodySkinMaterials; // 0x1d8
	TArray<TSoftClassPtr<UObject>> SkinTones; // 0x1e8
	FName HeadgearMaleSocket; // 0x1f8
	FName HeadgearFemaleSocket; // 0x200
	FName HeadgearOffsetSocketName; // 0x208
	FName HeadgearOffsetLocator; // 0x210
	FTigerCharacterHeadHeadgearOffset HeadgearOffset; // 0x218
	FName EyewearSocket; // 0x230
	TSoftObjectPtr<USkeletalMesh> Mesh; // 0x238
};

struct UTigerFindSessionAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailed; // 0x40
};

struct UTigerPassiveKindredCharmLogic : UTigerPassiveComponent {
	UTigerPassiveKindredCharmConfig* Config; // 0xc0
	ATigerPlayer* Player; // 0xc8
	ATigerKindredCharmEffectActor* EffectActorR; // 0xd0
	ATigerKindredCharmEffectActor* EffectActorL; // 0xd8
};

struct AChaosSolverActor : AActor {
	FChaosSolverConfiguration Properties; // 0x228
	float TimeStepMultiplier; // 0x290
	int32_t CollisionIterations; // 0x294
	int32_t PushOutIterations; // 0x298
	int32_t PushOutPairIterations; // 0x29c
	float ClusterConnectionFactor; // 0x2a0
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x2a4
	bool DoGenerateCollisionData; // 0x2a5
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2a8
	bool DoGenerateBreakingData; // 0x2b8
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x2bc
	bool DoGenerateTrailingData; // 0x2cc
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x2d0
	float MassScale; // 0x2e0
	bool bGenerateContactGraph; // 0x2e4
	bool bHasFloor; // 0x2e5
	float FloorHeight; // 0x2e8
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x2ec
	UBillboardComponent* SpriteComponent; // 0x2f0
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x310
};

struct UCompressedImageSequenceProtocol : UImageSequenceProtocol {
	int32_t CompressionQuality; // 0xd8
};

struct UTBP_UI_Tutorial_IntroText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOutSimpleText; // 0x268
	UWidgetAnimation* FadeOutLoreText; // 0x270
	UWidgetAnimation* FadeInSimpleText; // 0x278
	UWidgetAnimation* FadeInLoreText; // 0x280
	UWidgetAnimation* FadeOutScreen; // 0x288
	UWidgetAnimation* FadeInScreen; // 0x290
	UImage* Background; // 0x298
	UCanvasPanel* IntroScreen; // 0x2a0
	UCanvasPanel* LoreBox; // 0x2a8
	UTigerStyledRichTextBlock* LoreParagraphText; // 0x2b0
	UTigerStyledRichTextBlock* LoreSubheaderText; // 0x2b8
	UTigerStyledRichTextBlock* LoreTitleText; // 0x2c0
	UCanvasPanel* SimpleBox; // 0x2c8
	UTigerStyledRichTextBlock* SimpleText; // 0x2d0
	bool FadeOutSimpleBox; // 0x2d8
	bool FadeOutLoreBox; // 0x2d9
	FMulticastInlineDelegate OnIntroComplete; // 0x2e0
};

struct UTigerAnimNotify_NiagaraEffect : UAnimNotify {
	FSoftObjectPath NiagaraPath; // 0x38
	UNiagaraSystem* CachedNiagaraEffect; // 0x50
	FName AttachPointName; // 0x58
	FVector EffectLocation; // 0x60
	FRotator EffectRotation; // 0x6c
	EAttachLocation AttachLocationRule; // 0x78
	bool bOnlySpawnOnLocalPlayer; // 0x79
};

struct UTBP_UI_HorizontalArchetypeSelector_C : UTigerHorizontalArchetypeSelectorUI {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	UHorizontalBox* RootHorizontalBox; // 0x290
	FMulticastInlineDelegate OnArchetypeSelected; // 0x298
	TMap<ETigerPowerKitType, TScriptInterface<II_ArchetypeSelectButton_C>> ArchetypeButtons; // 0x2a8
	bool UsePragueVisuals; // 0x2f8
};

struct UTBP_ContextualHelp_Tutorial_EndEntity_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UTigerBuffAnarchHuntingKnifeStackInstance : UTigerBuffInstance {
	ATigerPlayer* Player; // 0x88
};

struct UActorComponent : UObject {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	int32_t UCSSerializationIndex; // 0x84
	char bNetAddressable : 1; // 0x88
	char bReplicates : 1; // 0x88
	char bAutoActivate : 1; // 0x89
	char bIsActive : 1; // 0x8a
	char bEditableWhenInherited : 1; // 0x8a
	char bCanEverAffectNavigation : 1; // 0x8a
	char bIsEditorOnly : 1; // 0x8a
	EComponentCreationMethod CreationMethod; // 0x8c
	FMulticastSparseDelegate OnComponentActivated; // 0x8d
	FMulticastSparseDelegate OnComponentDeactivated; // 0x8e
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UPreviewMeshCollection : UDataAsset {
	USkeleton* Skeleton; // 0x38
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x40
};

struct UTigerWeaponCycleStyle : UObject {
	int32_t WeaponSlotsToCycle; // 0x28
	FText UiName; // 0x30
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct UMaterialExpressionRound : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	FSourceEffectChorusSettings Settings; // 0x108
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UBlendSpace1D : UBlendSpaceBase {
	bool bScaleAnimation; // 0x148
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x278
	FName PreviousMatchState; // 0x280
	int32_t ElapsedTime; // 0x288
};

struct UTigerDisplacementConfig : UTigerDisciplineAnimTriggeredConfig {
	bool bShowDebugInfo; // 0x170
	float AttackingRange; // 0x174
	float AttackingRadius; // 0x178
	float PlayerTargetMultiplier; // 0x17c
	float MeleeAreaMultiplier; // 0x180
	UCurveFloat* AimAxisValueCurve; // 0x188
	UCurveFloat* DistanceFromUseValueCurve; // 0x190
	float Damage; // 0x198
	float BackgroundFindTargetInterval; // 0x19c
	float PlayerToScoutedTargetDotProductCutoff; // 0x1a0
	USoundBase* ActivationSound; // 0x1a8
	UTigerBuffDOT* DOTToApply; // 0x1b0
	UTigerBuff* BuffToApplyOnCasterWhenTeleporting; // 0x1b8
	UTigerWidget* TargetMarkerWidgetClass; // 0x1c0
	UAnimMontage* AirMontage; // 0x1c8
	bool bInterruptClimbOnTarget; // 0x1d0
};

struct UMaterialExpressionSubtract : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct ATigerStatisticsGatherer : AActor {
	TMap<FString, float> AnimationSequences; // 0x228
	float ProcessingCullDistance; // 0x278
	int32_t MaxComponentProcessingCountPerFrame; // 0x27c
	bool bVisualizeProcessedComponents; // 0x280
};

struct UTigerGuardBreakConfig : UTigerActiveDisciplineConfig {
	float DashDistance; // 0x160
	float StartupTime; // 0x164
	float DashTime; // 0x168
	float StrikeDelay; // 0x16c
	float StrikeDuration; // 0x170
	float OnHitDamage; // 0x174
	float BlockedOnHitDamage; // 0x178
	UTigerBuff* OnHitDebuff; // 0x180
	FVector HitBoxSize; // 0x188
	bool DrawDebugInfo; // 0x194
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x58
};

struct UTigerTitleErrorUI : UTigerWidget {
	UTigerOnlineError* OnlineError; // 0x280
	bool bIsOpen; // 0x288
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UParticleModuleTypeDataBeam2 : UParticleModuleTypeDataBase {
	EBeam2Method BeamMethod; // 0x30
	int32_t TextureTile; // 0x34
	float TextureTileDistance; // 0x38
	int32_t Sheets; // 0x3c
	int32_t MaxBeamCount; // 0x40
	float Speed; // 0x44
	int32_t InterpolationPoints; // 0x48
	char bAlwaysOn : 1; // 0x4c
	int32_t UpVectorStepSize; // 0x50
	FName BranchParentName; // 0x54
	FRawDistributionFloat Distance; // 0x60
	EBeamTaperMethod TaperMethod; // 0x90
	FRawDistributionFloat TaperFactor; // 0x98
	FRawDistributionFloat TaperScale; // 0xc8
	char RenderGeometry : 1; // 0xf8
	char RenderDirectLine : 1; // 0xf8
	char RenderLines : 1; // 0xf8
	char RenderTessellation : 1; // 0xf8
};

struct UTigerMeleeWeapon : UTigerWeapon {
	UCurveFloat* HorizontalFlinchCurve; // 0xa8
	UCurveFloat* VerticalFlinchCurve; // 0xb0
	float DamageMultiplier; // 0xb8
	float RootMotionAttacksStopDistance; // 0xbc
	float RootMotionAttacksStopDistanceAboveOrBelow; // 0xc0
	bool bIsUnarmedWeapon; // 0xc4
	UTigerMeleeAimAssistBehavior* AimAssistBehavior; // 0xc8
	float AimAssistPredictionTime; // 0xd0
	TArray<FTigerMeleeAttack> Attacks; // 0xd8
	FName HeavyAttackChargeUpMontageName; // 0xe8
	ETigerDisciplinesEnum WeaponAbility; // 0xf0
	UAkAudioEvent* HitAkEvent; // 0xf8
	UAkAudioEvent* HeavyHitAkEvent; // 0x100
	UParticleSystem* HitEffect; // 0x108
	AActor* HitEffectClass; // 0x110
	UForceFeedbackEffect* TargetHitForceFeedback; // 0x118
	UForceFeedbackEffect* AttackBlockedForceFeedback; // 0x120
	UForceFeedbackEffect* SuccesfullyBlockedForceFeedback; // 0x128
	FName BlockBlendSpaceName; // 0x130
	UAkAudioEvent* BlockStanceActivatedAkEvent; // 0x138
	float StartBlockingTransitionTime; // 0x140
	float BlockMovementMultiplier; // 0x144
	float BlockStunTime; // 0x148
	float DiminishingReturnBlockStunMultiplierReduction; // 0x14c
	UAkAudioEvent* BlockHitAkEvent; // 0x150
	UParticleSystem* BlockEffect; // 0x158
	FName BlockHitMontageName; // 0x160
	FName BlockKnockbackMontageName; // 0x168
	float BlockImpulseStrength; // 0x170
	float BlockMoveDistance; // 0x174
	float BlockMoveDuration; // 0x178
	float BlockMoveExitVelocityScale; // 0x17c
	float BlockAttackDamageMultiplier; // 0x180
	float BlockHeavyAttackDamageMultiplier; // 0x184
	UTigerMeleeWeaponTrailConfig* WeaponTrailConfigClass; // 0x188
	float MasqueradeNoiseEventRadius; // 0x190
	ETigerMeleeWeaponIdentifier MeleeWeaponIdentifier; // 0x194
};

struct ATigerTutorialTrainer : ATigerCharacter {
	FMulticastInlineDelegate OnReviveEnded; // 0x790
	FMulticastInlineDelegate OnTutorialTrainerDowned; // 0x7a0
	FMulticastInlineDelegate OnTutorialTrainerDiablerized; // 0x7b0
	FTutorialTrainerDiablerizeData DiablerizeData; // 0x7c0
	FTutorialTrainerReviveData ReviveData; // 0x7e0
	float HealthOnEnteringDownedState; // 0x7f8
	float DiablerizeOffsetDistance; // 0x7fc
	float MaxDownedTime; // 0x800
	float RemainingDownedTime; // 0x804
	bool bShouldBeFriendlyWithPlayer; // 0x808
	bool bCanBeDiablerized; // 0x809
	bool bWantsToShoot; // 0x80a
	bool bIsDowned; // 0x80b
	bool bIsInvulnerableWhenDowned; // 0x80c
	ATigerCharacter* CurrentlyAimedAtCharacter; // 0x810
	UTigerNPCVisualAsset* VisualAsset; // 0x818
	UTigerNPCFacePoseMap* HeadMeshsPoseAssetsClass; // 0x820
	UTigerPhysicalInteractionAnimationAsset* DiablerizeAnimationSetAsset; // 0x828
	float TimeInEnterState; // 0x830
	float TimeInDrainState; // 0x834
	float TimeInLeaveState; // 0x838
	FName DownedMontageNames[0x4]; // 0x83c
	FName StaticEntryToDownedMontageName; // 0x85c
	FName InterruptSectionName; // 0x864
	FName EndSectionName; // 0x86c
	FName DodgeOnGroundBlendSpaceName; // 0x874
	FName DodgeInAirBlendSpaceName; // 0x87c
	FName DiablerizeAnimationName; // 0x884
	FName GetDiablerizedAnimationName; // 0x88c
	FName ExitDownedStateAnimationName; // 0x894
	UAnimMontage* CurrentTrainerDiablerizeMontage; // 0x8a8
	UAnimMontage* CurrentPlayerDiablerizeMontage; // 0x8b0
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x228
};

struct UFoliageType_InstancedStaticMesh : UFoliageType {
	UStaticMesh* Mesh; // 0x3a8
	TArray<UMaterialInterface*> OverrideMaterials; // 0x3b0
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x3c0
};

struct UAudioCurveSourceComponent : UAudioComponent {
	FName CurveSourceBindingName; // 0x868
	float CurveSyncOffset; // 0x870
};

struct UParticleModuleTypeDataMesh : UParticleModuleTypeDataBase {
	UStaticMesh* Mesh; // 0x30
	float LODSizeScale; // 0x40
	char bUseStaticMeshLODs : 1; // 0x44
	char CastShadows : 1; // 0x44
	char DoCollisions : 1; // 0x44
	EMeshScreenAlignment MeshAlignment; // 0x45
	char bOverrideMaterial : 1; // 0x46
	char bOverrideDefaultMotionBlurSettings : 1; // 0x46
	char bEnableMotionBlur : 1; // 0x46
	FRawDistributionVector RollPitchYawRange; // 0x48
	EParticleAxisLock AxisLockOption; // 0x90
	char bCameraFacing : 1; // 0x91
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x92
	EMeshCameraFacingOptions CameraFacingOption; // 0x93
	char bApplyParticleRotationAsSpin : 1; // 0x94
	char bFaceCameraDirectionRatherThanPosition : 1; // 0x94
	char bCollisionsConsiderPartilceSize : 1; // 0x94
};

struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	TArray<int32_t> SortedInstances; // 0x598
	int32_t NumBuiltInstances; // 0x5a8
	FBox BuiltInstanceBounds; // 0x5b0
	FBox UnbuiltInstanceBounds; // 0x5cc
	TArray<FBox> UnbuiltInstanceBoundsList; // 0x5e8
	char bEnableDensityScaling : 1; // 0x5f8
	int32_t OcclusionLayerNumNodes; // 0x600
	FBoxSphereBounds CacheMeshExtendedBounds; // 0x604
	bool bDisableCollision; // 0x620
	int32_t InstanceCountToRender; // 0x624
};

struct UTigerAnimNotify_PlayVoEvent : UAnimNotify {
	FTigerNpcVoCategory VoCategory; // 0x38
};

struct UMaterialBillboardComponent : UPrimitiveComponent {
	TArray<FMaterialSpriteElement> Elements; // 0x450
};

struct UTBP_UI_FindGameFailedMenu_C : UTigerMenuWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x290
	UTBP_UI_BasicMenu_C* TBP_UI_BasicMenu; // 0x298
	UTBP_UI_MenuButton_C* TBP_UI_MenuButton; // 0x2a0
	UTBP_UI_MenuButton_C* TBP_UI_MenuButton_C_1; // 0x2a8
	UThrobber* Throbber_1; // 0x2b0
	UTBP_TigerGameInstance_C* GameInstanceRef; // 0x2b8
	TArray<FBlueprintSessionResult> FoundSessions; // 0x2c0
	bool SessionFound?; // 0x2d0
	FBlueprintSessionResult AvailableSession; // 0x2d8
	bool SearchButtonEnabled?; // 0x3e0
	ESlateVisibility ThrobberVisibility; // 0x3e1
	ESlateVisibility ButtonVisibility; // 0x3e2
};

struct UGizmoPlaneTranslationParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	FVector2D Parameter; // 0xb0
	FGizmoVec2ParameterChange LastChange; // 0xb8
	FVector CurTranslationOrigin; // 0xc8
	FVector CurTranslationNormal; // 0xd4
	FVector CurTranslationAxisX; // 0xe0
	FVector CurTranslationAxisY; // 0xec
	FTransform InitialTransform; // 0x100
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UTBP_ANS_UseVDM_C : UAnimNotifyState {
	int32_t Type; // 0x30
	ETigerDetachMethod DetachMethod; // 0x34
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x228
	char bDestroyOnSystemFinish : 1; // 0x230
	char bPostUpdateTickGroup : 1; // 0x230
	char bCurrentlyActive : 1; // 0x230
	FMulticastInlineDelegate OnParticleSpawn; // 0x238
	FMulticastInlineDelegate OnParticleBurst; // 0x248
	FMulticastInlineDelegate OnParticleDeath; // 0x258
	FMulticastInlineDelegate OnParticleCollide; // 0x268
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct UTigerMeleeAimAssistBehavior : UObject {
	float AimAssistMinRadius; // 0x28
	float AimAssistMaxRadius; // 0x2c
	float MaxTargetHeightDiff; // 0x30
	float DebugDrawTime; // 0x34
	bool bPredictCandidateLocationsBeforeEvaluation; // 0x38
	ATigerCharacter* TigerOwner; // 0x40
	UTigerMeleeWeapon* EquippedWeapon; // 0x48
	FVector TigerOwnerLocation; // 0x50
	TWeakObjectPtr<ATigerCharacter> FinalTargetCharacter; // 0x5c
	FTigerMeleeWeaponAttackIdentifier FinalAttackIdentifier; // 0x64
	float AimAssistMinRadiusSquared; // 0x68
	float AimAssistMaxRadiusSquared; // 0x6c
	float AimAssistTravelTime; // 0x70
};

struct UTigerPromptCollectionWidget : UTigerWidget {
	UTigerSimpleTextPrompt* MasqueradeBreachedPrompt; // 0x280
	UTigerSimpleTextPrompt* MasqueradeBreachedByNpcKillPrompt; // 0x288
	UTigerSimpleTextPrompt* MasqueradeBreachedByNpcFeedingPrompt; // 0x290
	UTigerSimpleTextPrompt* MasqueradeRestoredPrompt; // 0x298
	UTigerSimpleTextPrompt* IntroPrompt; // 0x2a0
	UTigerSimpleTextPrompt* FirstGasPrompt; // 0x2a8
	UTigerSimpleTextPrompt* SubsequentGasPrompt; // 0x2b0
	UTigerSimpleTextPrompt* GasStartedMovingPrompt; // 0x2b8
	UTigerSimpleTextPrompt* JudgeSpawnedPrompt; // 0x2c0
	UTigerSimpleTextPrompt* JudgeSlainPrompt; // 0x2c8
	UTigerSimpleTextPrompt* SupplyDropPrompt; // 0x2d0
	UTigerSimpleTextPrompt* SuperHighPotentNearbyPrompt; // 0x2d8
	UTigerSimpleTextPrompt* LevelUpPrompt; // 0x2e0
	UTigerSimpleTextPrompt* GameModeInteractionPrompt; // 0x2e8
	UTigerSimpleTextPrompt* EliminatedPlayerPrompt; // 0x2f0
	UTigerSimpleTextPrompt* DownedPlayerPrompt; // 0x2f8
	UTigerEnteringNewAreaPrompt* EnteringNewAreaPrompt; // 0x300
	UTigerSimpleTextPrompt* ArtifactPickedUpPrompt; // 0x308
	TArray<FTigerQueuedTextPrompt> TextPromptQueue; // 0x310
	TArray<FTigerQueuedTextPromptPriorityEntry> Prompts; // 0x320
};

struct UDatasmithActorTemplate : UDatasmithObjectTemplate {
	TSet<FName> Layers; // 0x30
	TSet<FName> Tags; // 0x80
};

struct UEnvQuery : UDataAsset {
	FName QueryName; // 0x30
	TArray<UEnvQueryOption*> Options; // 0x38
};

struct UGeometryCacheComponent : UMeshComponent {
	UGeometryCache* GeometryCache; // 0x478
	bool bRunning; // 0x480
	bool bLooping; // 0x481
	float StartTimeOffset; // 0x484
	float PlayBackSpeed; // 0x488
	int32_t NumTracks; // 0x48c
	float ElapsedTime; // 0x490
	float Duration; // 0x4c4
	bool bManualTick; // 0x4c8
};

struct UPhysicalMaterialMask : UObject {
	int32_t UVChannelIndex; // 0x28
	TextureAddress AddressX; // 0x2c
	TextureAddress AddressY; // 0x2d
};

struct UTigerAIPetStoreValidMasterPos : UBTTaskNode {
	FBlackboardKeySelector MasterPlayer; // 0x70
};

struct UTBP_PiercingSetCustomization_Master_C : UTigerCharacterPiercingSetCustomization {
	TMap<ENUM_PiercingNames, UStaticMesh*> Piercings; // 0x110
	TArray<UTBP_PoseableMesh_Master_C*> PoseablePiercings; // 0x160
};

struct UTexture2DArray : UTexture {
	TextureAddress AddressX; // 0x140
	TextureAddress AddressY; // 0x141
	TextureAddress AddressZ; // 0x142
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct ATigerMatchGameState : ATigerGameState {
	FMulticastInlineDelegate OnPreMatchStateChanged; // 0x320
	FMulticastInlineDelegate OnMatchStateChanged; // 0x330
	FMulticastInlineDelegate OnNumberOfPlayersAttachedToBloodVeinUpdated; // 0x340
	FMulticastInlineDelegate HighTierLootLocationsChanged; // 0x350
	float NextWaveRevealGameTime; // 0x360
	float MatchTimePassed; // 0x364
	float ReplicatedMatchTimePassed; // 0x368
	int32_t NumPlayersAlive; // 0x36c
	int32_t NumGroupsAlive; // 0x370
	int32_t GroupSize; // 0x374
	int32_t NumPlayersConnected; // 0x378
	int32_t RandomizedWeatherValue; // 0x37c
	FTigerPreMatchStateInfo PreMatchState; // 0x380
	ETigerMatchState TigerMatchState; // 0x388
	EMatchBalanceMode BalanceMode; // 0x389
	FTigerMatchSettingsVariationElectedConfig MatchSettingsVariationElectedConfig; // 0x38c
	ATigerWorldMarker* EntityCheckpointMarkerClass; // 0x3b8
	char NumberOfPawnsAttachedToBloodVein; // 0x3c0
	FMulticastInlineDelegate OnSpawnMechanicReceived; // 0x3c8
	FMulticastInlineDelegate OnGameModeVariationsReceived; // 0x3d8
	UTigerSpawnMechanic* SpawnMechanicClass; // 0x3e8
	TArray<TSoftClassPtr<UObject>> ActiveHighTierLootGroups; // 0x3f0
	FText JudgeSlainText; // 0x400
	ETigerMatchType MatchType; // 0x418
	TArray<FVector2D> EntityCheckpointLocations; // 0x420
	TArray<ATigerWorldMarker*> EntityCheckpointMarkers; // 0x430
	bool bGameModeVariationSet; // 0x454
};

struct UInterpCurveEdSetup : UObject {
	TArray<FCurveEdTab> Tabs; // 0x28
	int32_t ActiveTab; // 0x38
};

struct UTileView : UListView {
	float EntryHeight; // 0x368
	float EntryWidth; // 0x36c
	EListItemAlignment TileAlignment; // 0x370
	bool bWrapHorizontalNavigation; // 0x371
};

struct UTigerOnlineStatusSubsystem : UGameInstanceSubsystem {
	UTigerOnlineStatusMessages* OnlineStatusMessages; // 0x40
};

struct UTigerInventoryItemPack : UTigerConsumableInventoryItemBase {
	FTigerItemId ItemId; // 0x118
};

struct UBTTask_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98
	UNavigationQueryFilter* FilterClass; // 0xa0
	float ObservedBlackboardValueTolerance; // 0xa8
	char bObserveBlackboardValue : 1; // 0xac
	char bAllowStrafe : 1; // 0xac
	char bAllowPartialPath : 1; // 0xac
	char bTrackMovingGoal : 1; // 0xac
	char bProjectGoalLocation : 1; // 0xac
	char bReachTestIncludesAgentRadius : 1; // 0xac
	char bReachTestIncludesGoalRadius : 1; // 0xac
	char bStopOnOverlap : 1; // 0xac
	char bStopOnOverlapNeedsUpdate : 1; // 0xad
};

struct UTBP_ContextualHelp_Tutorial_Inventory_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UAnimBoneCompressionSettings : UObject {
	TArray<UAnimBoneCompressionCodec*> Codecs; // 0x28
};

struct UCommandlet : UObject {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
	char ShowProgress : 1; // 0x78
};

struct UInputRouter : UObject {
	bool bAutoInvalidateOnHover; // 0x28
	bool bAutoInvalidateOnCapture; // 0x29
	UInputBehaviorSet* ActiveInputBehaviors; // 0x38
};

struct UGameSessionSettings : UObject {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UTBP_UI_PromotionalPopup_C : UTigerPromotionalUI {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	UWidgetAnimation* FadeOut; // 0x308
	UTBP_UI_MenuButton_C* CloseButton; // 0x310
	UImage* CloseImage; // 0x318
	UButton* CornerCloseButton; // 0x320
	UTigerStyledRichTextBlock* DescriptionWidget; // 0x328
	UTBP_UI_MenuButton_C* GoToStoreButton; // 0x330
	UTigerStyledRichTextBlock* HeaderWidget; // 0x338
	UImage* Image_104; // 0x340
	UImage* PromoImageWidget; // 0x348
	UTBP_UI_Divider_C* TBP_UI_Divider; // 0x350
	UTBP_UI_Divider_C* TBP_UI_Divider_2; // 0x358
	UTBP_UI_Gradient_C* TBP_UI_Gradient; // 0x360
	FString EF_TextFormatting; // 0x368
	FString Bold_TextFormating; // 0x378
	FString UL_TextFormatting; // 0x388
	FString Subtitle_TextFormatting; // 0x398
	FString Subheader_TextFormatting; // 0x3a8
	FText BR_TextFormatting; // 0x3b8
};

struct UTigerMasqueradeActionResponse : UObject {
	float MinFearScaleDistance; // 0x28
	float MinFearScaleValue; // 0x2c
	float MinMasqueradeScaleDistance; // 0x30
	float MinMasqueradeScaleValue; // 0x34
	bool bIsDummy; // 0x38
};

struct UNetAnalyticsAggregatorConfig : UObject {
	TArray<FNetAnalyticsDataConfig> NetAnalyticsData; // 0x28
};

struct UEnvQueryGenerator_Donut : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue InnerRadius; // 0x80
	FAIDataProviderFloatValue OuterRadius; // 0xb8
	FAIDataProviderIntValue NumberOfRings; // 0xf0
	FAIDataProviderIntValue PointsPerRing; // 0x128
	FEnvDirection ArcDirection; // 0x160
	FAIDataProviderFloatValue ArcAngle; // 0x180
	bool bUseSpiralPattern; // 0x1b8
	UEnvQueryContext* Center; // 0x1c0
	char bDefineArc : 1; // 0x1c8
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UTigerDisciplineReposition : UTigerDisciplineBase {
	UTigerRepositionConfig* Config; // 0x78
};

struct UTigerWorldCompositionSettings : UDeveloperSettings {
	FDirectoryPath StreamedLevelDirectory; // 0x38
	ETigerWorldCompositionProxyMode ProxyGenerationMode; // 0x48
	int32_t ActorSortingCellSizeIncrementCount; // 0x4c
	float ActorSortingCellSizeIncrementAmount; // 0x50
	FMeshMergingSettings ProxyMeshMergeSettings; // 0x54
	bool bDoSecondProxyGenStage; // 0xf4
	FMeshProxySettings ProxySettings; // 0xf8
	FMeshBuildSettings LodBuildSettings; // 0x1a0
	TArray<FPerPlatformFloat> LodScreenSizes; // 0x1d0
	bool bEnableLodDitheringOnProxyMeshes; // 0x1e0
	float ProxySizeRequirement; // 0x1e4
	bool bForceLoadAllCellLevels; // 0x1e8
	bool bBlockOnLoad; // 0x1e9
	bool bEnablePreSpawnLoading; // 0x1ea
	bool bTriggerGarbageCollectionOnUnload; // 0x1eb
	TArray<TSoftClassPtr<UObject>> ProxyTypeBlacklistSoft; // 0x1f0
	TArray<TSoftClassPtr<UObject>> StreamingTypeBlacklistSoft; // 0x200
	TArray<TSoftClassPtr<UObject>> LevelClusterBlacklistSoft; // 0x210
	TSoftObjectPtr<UMaterialInterface> DebugVisualizationMaterialNotInFilter; // 0x220
};

struct UABP_VMP_BRU_M_HAIR_12_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2f8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x320
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x760
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x780
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xbc0
};

struct UTBP_GroupMemberMapMarkerWidget_C : UTBP_UI_MapMarker_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UImage* PlayerImage; // 0x2c0
};

struct UTBP_UI_PingResponse_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* InAnimation; // 0x268
	UImage* WrapperImage; // 0x270
	FMulticastInlineDelegate OnAnimationDone; // 0x278
	bool bIsShown; // 0x288
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct UTigerNPCFacePoseMap : UObject {
	TArray<FTigerFacePoseData> HeadMeshsPoseAssets; // 0x28
};

struct UTigerBlueprintLootLocationComponent : UActorComponent {
	UTigerLootLocationConfiguration* Configuration; // 0xb0
	char GameTypeFilter; // 0xb8
};

struct ATigerBuildingSystemDepricated : ATigerBuildingSystem {
	UHierarchicalInstancedStaticMeshComponent* Front_00; // 0x290
	UHierarchicalInstancedStaticMeshComponent* Front_01; // 0x298
	UHierarchicalInstancedStaticMeshComponent* Front_02; // 0x2a0
	UHierarchicalInstancedStaticMeshComponent* Front_03; // 0x2a8
	UHierarchicalInstancedStaticMeshComponent* Front_04; // 0x2b0
	UHierarchicalInstancedStaticMeshComponent* Front_05; // 0x2b8
	UHierarchicalInstancedStaticMeshComponent* Front_06; // 0x2c0
	UHierarchicalInstancedStaticMeshComponent* Front_07; // 0x2c8
	UHierarchicalInstancedStaticMeshComponent* Left_00; // 0x2d0
	UHierarchicalInstancedStaticMeshComponent* Left_01; // 0x2d8
	UHierarchicalInstancedStaticMeshComponent* Left_02; // 0x2e0
	UHierarchicalInstancedStaticMeshComponent* Left_03; // 0x2e8
	UHierarchicalInstancedStaticMeshComponent* Left_04; // 0x2f0
	UHierarchicalInstancedStaticMeshComponent* Left_05; // 0x2f8
	UHierarchicalInstancedStaticMeshComponent* Left_06; // 0x300
	UHierarchicalInstancedStaticMeshComponent* Left_07; // 0x308
	UHierarchicalInstancedStaticMeshComponent* Back_00; // 0x310
	UHierarchicalInstancedStaticMeshComponent* Back_01; // 0x318
	UHierarchicalInstancedStaticMeshComponent* Back_02; // 0x320
	UHierarchicalInstancedStaticMeshComponent* Back_03; // 0x328
	UHierarchicalInstancedStaticMeshComponent* Back_04; // 0x330
	UHierarchicalInstancedStaticMeshComponent* Back_05; // 0x338
	UHierarchicalInstancedStaticMeshComponent* Back_06; // 0x340
	UHierarchicalInstancedStaticMeshComponent* Back_07; // 0x348
	UHierarchicalInstancedStaticMeshComponent* Right_00; // 0x350
	UHierarchicalInstancedStaticMeshComponent* Right_01; // 0x358
	UHierarchicalInstancedStaticMeshComponent* Right_02; // 0x360
	UHierarchicalInstancedStaticMeshComponent* Right_03; // 0x368
	UHierarchicalInstancedStaticMeshComponent* Right_04; // 0x370
	UHierarchicalInstancedStaticMeshComponent* Right_05; // 0x378
	UHierarchicalInstancedStaticMeshComponent* Right_06; // 0x380
	UHierarchicalInstancedStaticMeshComponent* Right_07; // 0x388
	UStaticMeshComponent* CornerFL_00; // 0x390
	UStaticMeshComponent* CornerFL_01; // 0x398
	UStaticMeshComponent* CornerFL_02; // 0x3a0
	UStaticMeshComponent* CornerFL_03; // 0x3a8
	UStaticMeshComponent* CornerFL_04; // 0x3b0
	UStaticMeshComponent* CornerFL_05; // 0x3b8
	UStaticMeshComponent* CornerFL_06; // 0x3c0
	UStaticMeshComponent* CornerFL_07; // 0x3c8
	UStaticMeshComponent* CornerLB_00; // 0x3d0
	UStaticMeshComponent* CornerLB_01; // 0x3d8
	UStaticMeshComponent* CornerLB_02; // 0x3e0
	UStaticMeshComponent* CornerLB_03; // 0x3e8
	UStaticMeshComponent* CornerLB_04; // 0x3f0
	UStaticMeshComponent* CornerLB_05; // 0x3f8
	UStaticMeshComponent* CornerLB_06; // 0x400
	UStaticMeshComponent* CornerLB_07; // 0x408
	UStaticMeshComponent* CornerBR_00; // 0x410
	UStaticMeshComponent* CornerBR_01; // 0x418
	UStaticMeshComponent* CornerBR_02; // 0x420
	UStaticMeshComponent* CornerBR_03; // 0x428
	UStaticMeshComponent* CornerBR_04; // 0x430
	UStaticMeshComponent* CornerBR_05; // 0x438
	UStaticMeshComponent* CornerBR_06; // 0x440
	UStaticMeshComponent* CornerBR_07; // 0x448
	UStaticMeshComponent* CornerRF_00; // 0x450
	UStaticMeshComponent* CornerRF_01; // 0x458
	UStaticMeshComponent* CornerRF_02; // 0x460
	UStaticMeshComponent* CornerRF_03; // 0x468
	UStaticMeshComponent* CornerRF_04; // 0x470
	UStaticMeshComponent* CornerRF_05; // 0x478
	UStaticMeshComponent* CornerRF_06; // 0x480
	UStaticMeshComponent* CornerRF_07; // 0x488
};

struct UTigerDialogueCondition_Quest : UTigerDialogueCondition {
	ETigerDialogueQuestRequirementSpecifier Requirement; // 0x30
	FTigerQuestIdentifier questIdToCheck; // 0x38
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance : UMaterialExpression {
	int32_t LightIndex; // 0x40
	FExpressionInput WorldPosition; // 0x44
};

struct UMaterialExpressionTangentOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x68
};

struct UMaterialParameterCollectionInstance : UObject {
	UMaterialParameterCollection* Collection; // 0x30
};

struct AExponentialHeightFog : AInfo {
	UExponentialHeightFogComponent* Component; // 0x228
	char bEnabled : 1; // 0x230
};

struct UMaterialExpressionDesaturation : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Fraction; // 0x54
	FLinearColor LuminanceFactors; // 0x68
};

struct UMovieSceneLevelVisibilitySection : UMovieSceneSection {
	ELevelVisibility Visibility; // 0xf0
	TArray<FName> LevelNames; // 0xf8
};

struct UParticleModuleBeamTarget : UParticleModuleBeamBase {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x88
	char bLockTarget : 1; // 0x88
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x8c
	FRawDistributionVector TargetTangent; // 0x90
	char bLockTargetTangent : 1; // 0xd8
	FRawDistributionFloat TargetStrength; // 0xe0
	char bLockTargetStength : 1; // 0x110
	float LockRadius; // 0x114
};

struct UUserDefinedCaptureProtocol : UMovieSceneImageCaptureProtocolBase {
	UWorld* World; // 0x58
};

struct UTigerDialogueCondition_Clan : UTigerDialogueCondition {
	ETigerDialogueClanRequirementSpecifier ClanEquality; // 0x30
	ETigerClan ClanRequirement; // 0x31
};

struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x230
	float MaxDrawDistance; // 0x234
	float MaxDistanceFadeRange; // 0x238
	char bUseTemperature : 1; // 0x23c
	int32_t ShadowMapChannel; // 0x240
	float MinRoughness; // 0x248
	float SpecularScale; // 0x24c
	float ShadowResolutionScale; // 0x250
	float ShadowBias; // 0x254
	float ShadowSlopeBias; // 0x258
	float ShadowSharpen; // 0x25c
	float ContactShadowLength; // 0x260
	char ContactShadowLengthInWS : 1; // 0x264
	char InverseSquaredFalloff : 1; // 0x264
	char CastTranslucentShadows : 1; // 0x264
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x264
	char bAffectDynamicIndirectLighting : 1; // 0x264
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x264
	FLightingChannels LightingChannels; // 0x268
	UMaterialInterface* LightFunctionMaterial; // 0x270
	FVector LightFunctionScale; // 0x278
	UTextureLightProfile* IESTexture; // 0x288
	char bUseIESBrightness : 1; // 0x290
	float IESBrightnessScale; // 0x294
	float LightFunctionFadeDistance; // 0x298
	float DisabledBrightness; // 0x29c
	char bEnableLightShaftBloom : 1; // 0x2a0
	float BloomScale; // 0x2a4
	float BloomThreshold; // 0x2a8
	float BloomMaxBrightness; // 0x2ac
	FColor BloomTint; // 0x2b0
	bool bUseRayTracedDistanceFieldShadows; // 0x2b4
	float RayStartOffsetDepthScale; // 0x2b8
};

struct UMaterialExpressionRuntimeVirtualTextureSample : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	FExpressionInput WorldPosition; // 0x54
	FExpressionInput MipValue; // 0x68
	URuntimeVirtualTexture* VirtualTexture; // 0x80
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x88
	bool bSinglePhysicalSpace; // 0x89
	bool bAdaptive; // 0x8a
	ERuntimeVirtualTextureMipValueMode MipValueMode; // 0x8b
	ERuntimeVirtualTextureTextureAddressMode TextureAddressMode; // 0x8c
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	int32_t UsageIndex; // 0x2c
	FGuid UsageId; // 0x30
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1b8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x298
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2a8
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UABP_VMP_TOR_F_HAIR_02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x2d0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x710
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0xb50
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xf90
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfb0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0xfd0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x1410
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x1850
	FAnimNode_Root AnimGraphNode_Root; // 0x1c90
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1cc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x2100
};

struct UUdpMessagingSettings : UObject {
	bool EnabledByDefault; // 0x28
	bool EnableTransport; // 0x29
	bool bAutoRepair; // 0x2a
	bool bStopServiceWhenAppDeactivates; // 0x2b
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	EUdpMessageFormat MessageFormat; // 0x50
	char MulticastTimeToLive; // 0x51
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UTBP_UI_StyledComboBoxRow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_1; // 0x268
	UTigerStyledRichTextBlock* TextBlock; // 0x270
	bool IsSelected; // 0x278
	UTBP_UI_StyledComboBox_C* ParentBox; // 0x280
};

struct UInputAxisKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x28
};

struct UDatasmithPointLightComponentTemplate : UDatasmithObjectTemplate {
	ELightUnits IntensityUnits; // 0x30
	float SourceRadius; // 0x34
	float SourceLength; // 0x38
	float AttenuationRadius; // 0x3c
};

struct USoundConcurrency : UObject {
	FSoundConcurrencySettings Concurrency; // 0x28
};

struct UTigerAnimNotify_AddProps : UAnimNotify {
	ATigerPropDummy* PropDummyClass; // 0x38
	TArray<FName> PropsToSpawn; // 0x40
};

struct UTigerThrowingAxeConfig : UTigerDisciplineAnimTriggeredConfig {
	UAnimMontage* StartAimingPoseMontage; // 0x170
	UAnimMontage* ReadyAxeMontage; // 0x178
	bool bDebugInfiniteAxes; // 0x180
	bool bDebugDrawPredictedProjectilePath; // 0x181
	FName CastAnimationName; // 0x184
	AActor* ThrowingAxeProjectile; // 0x190
	UTigerItemAsset* AxeItem; // 0x198
	FName AxeSpawnSocket; // 0x1a0
	float ForwardOffset; // 0x1a8
	FRotator AxeSpawnRotationOffset; // 0x1ac
	float ProjectileDamage; // 0x1b8
	float ProjectileStartSpeed; // 0x1bc
	float ProjectileMaxSpeed; // 0x1c0
	float ProjectileMassInKg; // 0x1c4
	FRotator ProjectileRotationPerSecond; // 0x1c8
	float ProjectileGravityScale; // 0x1d4
	float MovementMultiplierAimState; // 0x1d8
};

struct UTigerCharacterIconCustomization : UTigerPlayerCardCustomization {
	TSoftObjectPtr<UTexture2D> CharacterIcon; // 0x110
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	UObject* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
	UEdGraphPin_Deprecated* ParentPin; // 0x108
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x228
};

struct UTBP_UI_TextButton_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* PressedAnimation; // 0x268
	UButton* Button; // 0x270
	UTigerStyledRichTextBlock* CustomText; // 0x278
	FMulticastInlineDelegate OnClicked; // 0x280
	FMulticastInlineDelegate OnHovered; // 0x290
	FMulticastInlineDelegate OnUnhovered; // 0x2a0
	FText Text; // 0x2b0
	FDataTableRowHandle TextNeutralStyle; // 0x2c8
	FDataTableRowHandle TextHoveredStyle; // 0x2d8
	bool IsPressed; // 0x2e8
	float TextNeutralOpacity; // 0x2ec
	float TextHoveredOpacity; // 0x2f0
	bool bIsHovered; // 0x2f4
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct URuntimeVirtualTextureComponent : USceneComponent {
	TSoftObjectPtr<AActor> BoundsAlignActor; // 0x1f8
	bool bSetBoundsButton; // 0x220
	bool bSnapBoundsToLandscape; // 0x221
	URuntimeVirtualTexture* VirtualTexture; // 0x228
	bool bEnableScalability; // 0x230
	uint32_t ScalabilityGroup; // 0x234
	bool bHidePrimitives; // 0x238
	UVirtualTextureBuilder* StreamingTexture; // 0x240
	int32_t StreamLowMips; // 0x248
	bool bBuildStreamingMipsButton; // 0x24c
	bool bEnableCompressCrunch; // 0x24d
	bool bUseStreamingLowMipsInEditor; // 0x24e
	bool bBuildDebugStreamingMips; // 0x24f
};

struct UTigerStaticMeshUserData : UAssetUserData {
	ETigerStaticMeshType StaticMeshType; // 0x28
	bool bIsClimbable; // 0x29
	bool bIsWallJumpable; // 0x2a
	bool bFadeWhenNearToCamera; // 0x2b
	bool bForceHorizontalVelocityOnFallingImpact; // 0x2c
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UABP_VMP_VEN_M_HAIR_09_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x300
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x760
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xba0
};

struct UInterpTrackLinearColorProp : UInterpTrackLinearColorBase {
	FName PropertyName; // 0x90
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UParticleModuleTypeDataRibbon : UParticleModuleTypeDataBase {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct ATigerJudge : ATigerBaseNPC {
	UTigerJudgeShieldComponent* JudgeShieldComponent; // 0x988
	UTigerJudgeSwordComponent* JudgeSwordComponent; // 0x990
	UTigerExperienceEvent* FeedEvent; // 0x998
	UTigerWorldMarkerComponent* WorldMarkerComponent; // 0x9a0
	UTigerJudgeBaseState* CurrentJudgeState; // 0x9a8
	ATigerPlayer* FeedingPlayer; // 0x9b8
	ATigerEntityJudgeHelicopter* HelicopterClass; // 0x9c0
	TWeakObjectPtr<ATigerEntityJudgeHelicopter> Helicopter; // 0x9c8
	FTigerJudgeRotationSettings CurrentRotationSettings; // 0x9d0
	ATigerPlayer* CurrentPrimaryTarget; // 0x9d8
	float DamageCauserCutoffDistanceSq; // 0x9e0
	FTigerTimedAnimationTriggerWrapper AnimationTriggerWrapper; // 0x9e8
	TArray<FTigerJudgePlayerDamage> PlayerDamageCollection; // 0xa00
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x228
	UPrimitiveComponent* TranslateY; // 0x230
	UPrimitiveComponent* TranslateZ; // 0x238
	UPrimitiveComponent* TranslateYZ; // 0x240
	UPrimitiveComponent* TranslateXZ; // 0x248
	UPrimitiveComponent* TranslateXY; // 0x250
	UPrimitiveComponent* RotateX; // 0x258
	UPrimitiveComponent* RotateY; // 0x260
	UPrimitiveComponent* RotateZ; // 0x268
	UPrimitiveComponent* UniformScale; // 0x270
	UPrimitiveComponent* AxisScaleX; // 0x278
	UPrimitiveComponent* AxisScaleY; // 0x280
	UPrimitiveComponent* AxisScaleZ; // 0x288
	UPrimitiveComponent* PlaneScaleYZ; // 0x290
	UPrimitiveComponent* PlaneScaleXZ; // 0x298
	UPrimitiveComponent* PlaneScaleXY; // 0x2a0
};

struct UTigerAIPlayerTravelBloodVeinTask : UBTTask_BlackboardBase {
	UCurveFloat* JumpProbabilityDistribution; // 0x98
	ETigerJumpDistribution JumpDistributionType; // 0xa8
};

struct UFontImportOptions : UObject {
	FFontImportOptionsData Data; // 0x28
};

struct UAISense_Prediction : UAISense {
	TArray<FAIPredictionEvent> RegisteredEvents; // 0x80
};

struct UTigerCollectibleGrimoireEntrySet : UDataAsset {
	TArray<UTigerGrimoireEntry*> Set; // 0x30
};

struct UTigerCollectibleSystem : UActorComponent {
	UTigerExperienceEvent* CollectiblePickupExpEvent; // 0xb0
	UTigerItemAsset* GenericCollectibleItemAsset; // 0xb8
};

struct UTigerContextualHelpComponent : UActorComponent {
	ATigerPlayerController* TigerPlayerController; // 0xb0
	UTigerContextualHelpUI* ContextualHelpUI; // 0xb8
	TArray<FTigerCurrentContextualHelp> ActiveContextualHelps; // 0xc0
	TArray<UTigerContextualHelp*> ContextualHelpCandidates; // 0xd0
	TArray<TSoftClassPtr<UObject>> ContextualHelpTypes; // 0xe0
	float CooldownTime; // 0xf0
	float MinimumDisplayTime; // 0xf4
};

struct UTBP_UI_PingLocation_C : UTBP_UI_PingInstance_Inner_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d8
	UWidgetAnimation* Outline_Pulse_Anim; // 0x2e0
	UWidgetAnimation* OnLocPingAnim; // 0x2e8
	UImage* BG_Dot_Border; // 0x2f0
	UImage* BG_Dot_Dark; // 0x2f8
	UImage* DiamondBG; // 0x300
	UImage* DiamondBG_Animated; // 0x308
	UImage* DiamondBG_Animated_Pulse; // 0x310
};

struct UHudSettings : UObject {
	char bShowHUD : 1; // 0x28
	TArray<FName> DebugDisplay; // 0x30
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct USoundCue : USoundBase {
	char bPrimeOnLoad : 1; // 0x1b8
	USoundNode* FirstNode; // 0x1c0
	float VolumeMultiplier; // 0x1c8
	float PitchMultiplier; // 0x1cc
	FSoundAttenuationSettings AttenuationOverrides; // 0x1d0
	float SubtitlePriority; // 0x570
	char bOverrideAttenuation : 1; // 0x578
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x578
	int32_t CookedQualityIndex; // 0x57c
	char bHasPlayWhenSilent : 1; // 0x580
};

struct UTigerBuffClanReducesCooldownInstance : UTigerBuffInstance {
	UTigerBuffClanReducesCooldown* ClanReduceCooldownBuff; // 0x88
	ATigerPlayer* Player; // 0x90
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct UTigerTransitionWidget : UUserWidget {
	float AnimationDelay; // 0x260
	float AnimationSpeed; // 0x264
	FMulticastInlineDelegate OnTransitionStarted; // 0x268
	FMulticastInlineDelegate OnTransitionFinished; // 0x278
	float Progress; // 0x288
	UMaterialInstanceDynamic* EffectMaterialInstance; // 0x290
};

struct UABP_VMP_BRU_M_HAIR_13_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x2d0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x710
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0xb50
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0xf90
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x13d0
	FAnimNode_Root AnimGraphNode_Root; // 0x1810
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x1840
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1c80
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x20c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2500
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2520
};

struct UBTDecorator_BlueprintBase : UBTDecorator {
	AAIController* AIOwner; // 0x68
	AActor* ActorOwner; // 0x70
	TArray<FName> ObservedKeyNames; // 0x78
	char bShowPropertyDetails : 1; // 0x98
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0x98
	char bIsObservingBB : 1; // 0x98
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct UAkAudioType : UObject {
	uint32_t ShortID; // 0x28
	TArray<UObject*> UserData; // 0x30
};

struct UTigerDisciplineTankyCharge : UTigerDisciplineBase {
	TArray<AActor*> PreviouslyHitCharacters; // 0x78
	FVector TargetLocation; // 0x88
};

struct ASceneCapture2D : ASceneCapture {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x238
};

struct UTigerMusicAsset : UDataAsset {
	USoundCue* SoundCue; // 0x30
};

struct UParticleModuleMeshRotationRate_Seeded : UParticleModuleMeshRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	FBodyInstance BodyInstance; // 0x158
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x2b0
	FLightingChannels LightingChannels; // 0x2b1
	char bRenderCustomDepth : 1; // 0x2b4
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x2b8
	int32_t CustomDepthStencilValue; // 0x2bc
	int32_t TranslucencySortPriority; // 0x2c0
	float CollisionRadius; // 0x2c4
	float ShadeRadius; // 0x2c8
	int32_t NumSteps; // 0x2cc
	float InitialSeedDensity; // 0x2d0
	float AverageSpreadDistance; // 0x2d4
	float SpreadVariance; // 0x2d8
	int32_t SeedsPerStep; // 0x2dc
	int32_t DistributionSeed; // 0x2e0
	float MaxInitialSeedOffset; // 0x2e4
	bool bCanGrowInShade; // 0x2e8
	bool bSpawnsInShade; // 0x2e9
	float MaxInitialAge; // 0x2ec
	float MaxAge; // 0x2f0
	float OverlapPriority; // 0x2f4
	FFloatInterval ProceduralScale; // 0x2f8
	FRuntimeFloatCurve ScaleCurve; // 0x300
	int32_t ChangeCount; // 0x388
	char ReapplyDensity : 1; // 0x38c
	char ReapplyRadius : 1; // 0x38c
	char ReapplyAlignToNormal : 1; // 0x38c
	char ReapplyRandomYaw : 1; // 0x38c
	char ReapplyScaling : 1; // 0x38c
	char ReapplyScaleX : 1; // 0x38c
	char ReapplyScaleY : 1; // 0x38c
	char ReapplyScaleZ : 1; // 0x38c
	char ReapplyRandomPitchAngle : 1; // 0x38d
	char ReapplyGroundSlope : 1; // 0x38d
	char ReapplyHeight : 1; // 0x38d
	char ReapplyLandscapeLayers : 1; // 0x38d
	char ReapplyZOffset : 1; // 0x38d
	char ReapplyCollisionWithWorld : 1; // 0x38d
	char ReapplyVertexColorMask : 1; // 0x38d
	char bEnableDensityScaling : 1; // 0x38d
	char bEnableDiscardOnLoad : 1; // 0x38e
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x390
	int32_t VirtualTextureCullMips; // 0x3a0
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x3a4
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct ATigerAiSplinePathHub : AActor {
	TArray<FTigerAISplinePathConnection> SplineConnections; // 0x228
	float ConnectionRadius; // 0x238
};

struct USoundNodeGroupControl : USoundNode {
	TArray<int32_t> GroupSizes; // 0x48
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UEnvelopeFollowerListener : UActorComponent {
	FMulticastInlineDelegate OnEnvelopeFollowerUpdate; // 0xb0
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UABP_VMP_NOS_M_HAIR_03_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x300
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x760
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xba0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0xfe0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1420
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1860
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x1cc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2100
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3200
};

struct UTigerCharacterHairStyleCustomization : UTigerCharacterPartOfHeadCustomization {
	FTigerCharacterCustomizationParameters AdditionalParameters; // 0x110
	FTigerLodSplitMesh SplitMesh; // 0x148
	UAnimInstance* Animation; // 0x1c0
	FName SocketAttachments[0x2]; // 0x1c8
	TSoftObjectPtr<USkeletalMesh> Mesh; // 0x1d8
};

struct UNiagaraDataInterfaceRenderTarget2DArray : UNiagaraDataInterfaceRWBase {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x108
};

struct UAkCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x4b8
	FDelegate CheckedStateDelegate; // 0x4bc
	FCheckBoxStyle WidgetStyle; // 0x4d0
	EHorizontalAlignment HorizontalAlignment; // 0xa50
	bool IsFocusable; // 0xa51
	FAkBoolPropertyToControl ThePropertyToControl; // 0xa58
	FAkWwiseItemToControl ItemToControl; // 0xa68
	FMulticastInlineDelegate AkOnCheckStateChanged; // 0xaa8
	FMulticastInlineDelegate OnItemDropped; // 0xab8
	FMulticastInlineDelegate OnPropertyDropped; // 0xac8
};

struct UTigerAiDisciplineTaskBase : UBTTask_BlackboardBase {
	ATigerLocalAIController* LocalAIController; // 0x98
	ATigerCharacter* AiTigerCharacter; // 0xa0
	UTigerDisciplineComponent* DisciplineComponent; // 0xa8
	UTigerDisciplineBase* CurrentDisciplineBase; // 0xb0
};

struct UTigerTeleportConfig : UTigerActiveDisciplineConfig {
	float TeleportDistance; // 0x160
};

struct UTigerJudgeShieldComponent : USkeletalMeshComponent {
	FVector DeflectEffectOffset; // 0xee0
	UParticleSystem* DeflectEffect; // 0xef0
	UAkAudioEvent* DeflectSound; // 0xef8
	float BlockingHalfAngle; // 0xf00
};

struct UTigerMapGameData : UObject {
	FMulticastInlineDelegate OnMapMarkerAdded; // 0x28
	FMulticastInlineDelegate OnMapMarkerRemoved; // 0x38
	TArray<UTigerMapMarkerProxy*> MapMarkerProxies; // 0x48
	UTigerMapInfoDataAsset* MapInfoAsset; // 0x58
};

struct UMaterialExpression : UObject {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UAkCallbackInfo : UObject {
	UAkComponent* AkComponent; // 0x28
};

struct APaperTileMapActor : AActor {
	UPaperTileMapComponent* RenderComponent; // 0x228
};

struct UTigerBuffThornsInstance : UTigerBuffDOTInstance {
	UTigerBuffThorns* ThornsBuff; // 0x98
};

struct UAkXboxOneGDKInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXboxOneGDKApuHeapInitializationSettings ApuHeapSettings; // 0x88
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkXboxOneGDKAdvancedInitializationSettings AdvancedSettings; // 0xb8
};

struct UTigerAIFireAtActorTask : UBTTask_BlackboardBase {
	FBlackboardKeySelector TargetToShootActorKey; // 0x98
	FBlackboardKeySelector CanShootKey; // 0xc0
};

struct UTigerAISenseConfig_Masquerade : UAISenseConfig {
	UTigerAISense_Masquerade* Implementation; // 0x48
};

struct AAkReverbVolume : AVolume {
	char bEnabled : 1; // 0x260
	UAkAuxBus* AuxBus; // 0x268
	FString AuxBusName; // 0x270
	float SendLevel; // 0x280
	float FadeRate; // 0x284
	float Priority; // 0x288
	UAkLateReverbComponent* LateReverbComponent; // 0x290
};

struct UTigerChallengeHitBullets : UTigerChallenge {
	FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb0
};

struct ATigerRat : ATigerInteractiveObject {
	FVector LocalHandOffset; // 0x288
	FRotator LocalHandRotation; // 0x294
	UAnimMontage* Montage; // 0x2a0
	TWeakObjectPtr<ATigerPlayerController> CurrentInteractingPlayerController; // 0x2a8
	float FeedTickTime; // 0x2b0
	float FeedHealthAmount; // 0x2b4
	float MoveSpeed; // 0x2b8
	float RotationSpeed; // 0x2bc
	float MaxWaitTime; // 0x2c0
	float MinWaitTime; // 0x2c4
	USkeletalMeshComponent* RatMesh; // 0x2c8
	bool bShouldMove; // 0x2d0
	UAkAudioEvent* PickUpSqueekEvent; // 0x2d8
	bool bIsEaten; // 0x308
};

struct ATigerEntityJudgeHelicopter : ATigerEntityHelicopter {
	ATigerJudge* Judge; // 0x2e0
	float DesiredForwardOffsetFromJudge; // 0x2f0
	float DesiredHeight; // 0x2f4
	float MaxSpeed; // 0x2f8
	float MaxTargetDistance2DFromJudge; // 0x2fc
	float MinimumTargetHeight; // 0x300
	float MinimumHeightOverJudge; // 0x304
	float LoseTargetTime; // 0x308
	FTimerHandle KillSelfHandle; // 0x310
	ETigerJudgeHelicopterSpotlightState CurrentSpotlightState; // 0x318
};

struct UInterpTrackInstAkAudioRTPC : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct UTigerAIPlayerSlideIfPossibleTask : UBTTaskNode {
	float MinimumSlideDistanceSqrd; // 0x70
	ATigerLocalAIController* LocalAIController; // 0x78
	ATigerPlayerController* PlayerController; // 0x80
	ATigerPlayer* CurrentPawn; // 0x88
	UTigerCharacterMovementComponent* PlayerMovementComponent; // 0x90
	UTigerTraversalSlideState* SlideState; // 0x98
};

struct ATigerLootBox : ATigerInteractiveObject {
	ATigerItemWorldRepresentation* PickupItemClass; // 0x288
	UAkAudioEvent* StartInteractSound; // 0x290
	UAkAudioEvent* StopInteractSound; // 0x298
	ETigerItemRarity CurrentHighestRarity; // 0x2a0
	TArray<FTigerItemData> ItemList; // 0x2a8
	bool bWasSpawnedOnPlayerDeath; // 0x2b8
	bool bHasBeenPreviouslyOpened; // 0x2b9
	TWeakObjectPtr<ATigerPlayerController> CurrentInteractingPlayerController; // 0x2bc
	UBoxComponent* CancelInteractionVolume; // 0x2c8
	ETigerTelemetryItemSourceID TelemetrySourceID; // 0x2e8
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t Row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t Column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct UTBP_UI_InputMenuPrompt_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTBP_UI_InputPrompt_Gamepad_C* InputPrompt_Gamepad; // 0x268
	UTBP_UI_InputPrompt_Keyboard_C* InputPrompt_Keyboard; // 0x270
	UTBP_UI_TransitionMenuButton_C* TransitionMenuButton; // 0x278
	FText PrefixText; // 0x280
	FText PostfixTest; // 0x298
	FName InputAction; // 0x2b0
	bool bListenForInput; // 0x2b8
	FMulticastInlineDelegate OnInputPressed; // 0x2c0
};

struct UMovieScene3DAttachSection : UMovieScene3DConstraintSection {
	FName AttachSocketName; // 0x118
	FName AttachComponentName; // 0x120
	EAttachmentRule AttachmentLocationRule; // 0x128
	EAttachmentRule AttachmentRotationRule; // 0x129
	EAttachmentRule AttachmentScaleRule; // 0x12a
	EDetachmentRule DetachmentLocationRule; // 0x12b
	EDetachmentRule DetachmentRotationRule; // 0x12c
	EDetachmentRule DetachmentScaleRule; // 0x12d
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e8
	FSpectatorReservation PendingReservation; // 0x2f8
	ESpectatorClientRequestType RequestType; // 0x370
	bool bPendingReservationSent; // 0x371
	bool bCancelReservation; // 0x372
};

struct UGenlockedTimecodeProvider : UTimecodeProvider {
	bool bUseGenlockToCount; // 0x30
};

struct UTBP_UI_MaskedCardBorder_C : UTigerDeferredGroupRetainerBox {
	FPointerToUberGraphFrame UberGraphFrame; // 0x150
	float InitialCornerRadius; // 0x158
	float InitialBorderWidth; // 0x15c
	FLinearColor InitialBorderColor; // 0x160
	UTexture2D* InitialWeatheringTexture; // 0x170
	float InitialWeatheringOpacity; // 0x178
	float InitialWeatheringWidth; // 0x17c
	float InitialWeatheringFadeWidth; // 0x180
	float InitialWeatheringScale; // 0x184
	FVector2D InitialWeatheringOffset; // 0x188
	bool bRandomizeInitialWeatheringOffset; // 0x190
};

struct UTigerDisciplineIncitePain : UTigerDisciplineAnimTriggered {
	UTigerIncitePainConfig* Config; // 0xf0
};

struct UTigerHighTierLootComponent : UActorComponent {
	TSoftClassPtr<UObject> HighTierLootGroup; // 0xb0
};

struct UMaterialExpressionRotator : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct UTigerOnlineStatusMessages : UObject {
	FText DefaultMessage; // 0x28
	FText DefaultAccountMessage; // 0x40
	FText DefaultSystemMessage; // 0x58
	FText DefaultServerMessage; // 0x70
	TArray<FTigerOnlineStatusMessageEntry> Messages; // 0x88
	TMap<ETigerOnlineErrorCategory, FText> ErrorCategoryTitles; // 0x98
};

struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UTigerAnimNotifyState_LockOwner : UAnimNotifyState {
	bool bStopActiveMovement; // 0x30
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x450
	FInterpCurveVector SplineInfo; // 0x4c0
	FInterpCurveQuat SplineRotInfo; // 0x4d8
	FInterpCurveVector SplineScaleInfo; // 0x4f0
	FInterpCurveFloat SplineReparamTable; // 0x508
	bool bAllowSplineEditingPerInstance; // 0x520
	int32_t ReparamStepsPerSegment; // 0x524
	float Duration; // 0x528
	bool bStationaryEndpoints; // 0x52c
	bool bSplineHasBeenEdited; // 0x52d
	bool bModifiedByConstructionScript; // 0x52e
	bool bInputSplinePointsToConstructionScript; // 0x52f
	bool bDrawDebug; // 0x530
	bool bClosedLoop; // 0x531
	bool bLoopPositionOverride; // 0x532
	float LoopPosition; // 0x534
	FVector DefaultUpVector; // 0x538
};

struct UARLifeCycleComponent : USceneComponent {
	FMulticastInlineDelegate OnARActorSpawnedDelegate; // 0x1f8
	FMulticastInlineDelegate OnARActorToBeDestroyedDelegate; // 0x208
};

struct UTigerDisciplineEarthshock : UTigerDisciplineBase {
	FEarthshockUseDataNetworked EarthshockUseData; // 0x78
	UTigerEarthshockConfig* EarthshockConfig; // 0xb0
};

struct UPostEventAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
};

struct UNiagaraEmitter : UObject {
	bool bLocalSpace; // 0x28
	bool bDeterminism; // 0x29
	int32_t RandomSeed; // 0x2c
	EParticleAllocationMode AllocationMode; // 0x30
	int32_t PreAllocationCount; // 0x34
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x38
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x60
	ENiagaraSimTarget SimTarget; // 0x88
	FBox FixedBounds; // 0x8c
	int32_t MinDetailLevel; // 0xa8
	int32_t MaxDetailLevel; // 0xac
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0xb0
	FNiagaraPlatformSet Platforms; // 0xc8
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0xf8
	char bInterpolatedSpawning : 1; // 0x108
	char bFixedBounds : 1; // 0x108
	char bUseMinDetailLevel : 1; // 0x108
	char bUseMaxDetailLevel : 1; // 0x108
	char bOverrideGlobalSpawnCountScale : 1; // 0x108
	char bRequiresPersistentIDs : 1; // 0x108
	char bCombineEventSpawn : 1; // 0x108
	float MaxDeltaTimePerTick; // 0x10c
	uint32_t DefaultShaderStageIndex; // 0x110
	uint32_t MaxUpdateIterations; // 0x114
	TSet<uint32_t> SpawnStages; // 0x118
	char bSimulationStagesEnabled : 1; // 0x168
	char bDeprecatedShaderStagesEnabled : 1; // 0x168
	char bLimitDeltaTime : 1; // 0x168
	FString UniqueEmitterName; // 0x170
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x180
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x190
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1a0
	UNiagaraScript* GPUComputeScript; // 0x1b0
	TArray<FName> SharedEventGeneratorIds; // 0x1b8
};

struct ANiagaraActor : AActor {
	UNiagaraComponent* NiagaraComponent; // 0x228
	char bDestroyOnSystemFinish : 1; // 0x230
};

struct UTigerChallengeDealDamage : UTigerChallenge {
	bool bNeedsToDamagePlayer; // 0xb0
	FTigerChallengeRequirementWeaponType RequiredWeaponConstraint; // 0xb8
};

struct UTigerUIColorSet : UDataAsset {
	FLinearColor ColorArray[0x24]; // 0x30
};

struct UTigerSpectateCameraBehavior : UTigerActiveCameraBehavior {
	float FollowCameraDelay; // 0x128
	float CameraFollowSpeedMultiplier; // 0x12c
	float ConstantAddedCameraFollowSpeed; // 0x130
	float NewFollowPointOffsetMultiplier; // 0x134
	ATigerSpectatorPawn* SpectatorPawn; // 0x138
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x5a0
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x228
	float CraneYaw; // 0x22c
	float CraneArmLength; // 0x230
	bool bLockMountPitch; // 0x234
	bool bLockMountYaw; // 0x235
	USceneComponent* TransformComponent; // 0x238
	USceneComponent* CraneYawControl; // 0x240
	USceneComponent* CranePitchControl; // 0x248
	USceneComponent* CraneCameraMount; // 0x250
};

struct UTBP_ContextualHelp_Tutorial_ArchetypePower_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct USourceEffectPhaserPreset : USoundEffectSourcePreset {
	FSourceEffectPhaserSettings Settings; // 0xa0
};

struct UTBP_ContextualHelp_RangedWeapon_SwitchWeaponInputReminder_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UAkGameObject : USceneComponent {
	UAkAudioEvent* AkAudioEvent; // 0x1f8
	FString EventName; // 0x200
};

struct UTigerTraversalStateWallGrindConfig : UTigerTraversalStateConfigBase {
	FVector ColliderOffset; // 0x50
	float SphereColliderRadius; // 0x5c
	float WallGrindCancelInputHalfAngle; // 0x60
	float WallGrindCancelInputDelayTime; // 0x64
	float WallGrindVelocityRemapDeadZone; // 0x68
	float WallGrindMaxHorizontalSpeed; // 0x6c
	float WallGrindBufferDistance; // 0x70
	float WallGrindBufferAdjustmentSpeed; // 0x74
	float RequiredSuccessfulSimulationTime; // 0x78
	float MinRequiredAngleBetweenStartingNormalAndPathDir; // 0x7c
	float WallGrindPossibleStartAngleThreshold; // 0x80
	float WallGrindSimulationSharpAngleThreshold; // 0x84
	int8_t NumberofSimulationChecksPerSecond; // 0x88
	UCurveFloat* WallGrindFallVelocitySpeedUp; // 0x90
	UCurveFloat* WallGrindFallVelocitySlowDown; // 0x98
	UCurveFloat* WallGrindStartingHorizontalSpeedMultipler; // 0xa0
	bool bOnlyAdjustFallSpeedWhenFallingTooFast; // 0xa8
	bool bShouldBlockWallGrindingWhenHoldingCancelInput; // 0xa9
	bool bShouldClampHorizontalSpeed; // 0xaa
	bool bWallGrindShouldBufferDistanceToWall; // 0xab
	bool bValidateWallgrindByCheckingPathAverageToWall; // 0xac
	bool bDrawOutWallNormalsUsedInAWallGrind; // 0xad
};

struct UParticleModuleLight_Seeded : UParticleModuleLight {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct UTBP_Ping_Civilian_C : UTBP_PingBase_C {
	UAkAudioEvent* civilianPingVO; // 0x128
	FText civilianPingText; // 0x130
	UTexture2D* civilianPingIcon; // 0x148
	UTigerBloodResonanceAsset* BloodAsset_Choleric; // 0x150
	UTigerBloodResonanceAsset* BloodAsset_Melancholic; // 0x158
	UTigerBloodResonanceAsset* BloodAsset_Phlegmatic; // 0x160
	UTigerBloodResonanceAsset* BloodAsset_Sanguine; // 0x168
};

struct UCircularThrobber : UWidget {
	int32_t NumberOfPieces; // 0x108
	float Period; // 0x10c
	float Radius; // 0x110
	USlateBrushAsset* PieceImage; // 0x118
	FSlateBrush Image; // 0x120
	bool bEnableRadius; // 0x1a8
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct UTigerDialogueCondition_FinishedCertainGame : UTigerDialogueCondition {
	ETigerGroupingMode ModeFinished; // 0x30
};

struct UMaterialExpressionTextureSampleParameterSubUV : UMaterialExpressionTextureSampleParameter2D {
	char bBlend : 1; // 0x80
};

struct USharkOnlineSettings : UDeveloperSettings {
	FString OnlineServicesEnv; // 0x38
	float MaximumRetryDelaySeconds; // 0x48
	FString AccountRecoverUriProd; // 0x50
	FString AccountRecoverUriUat; // 0x60
	FString AccountRecoverUriDev; // 0x70
	int32_t MinimumAccountCreationAge; // 0x80
	int32_t PartyMaintenancePollIntervalSeconds; // 0x84
};

struct UTBP_UI_ConfirmMenu_C : UTigerWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UTBP_UI_InputMenuPrompt_C* ConfirmWidget; // 0x288
	UTBP_UI_InputMenuPrompt_C* DeclineWidget; // 0x290
	UTigerStyledRichTextBlock* InnerCountdownWidget; // 0x298
	UTigerStyledRichTextBlock* InnerTitleWidget; // 0x2a0
	UTBP_UI_FullScreen_PopUp_Base_C* PopUpWidget; // 0x2a8
	FMulticastInlineDelegate Confirm; // 0x2b0
	FMulticastInlineDelegate Decline; // 0x2c0
	FText AcceptText; // 0x2d0
	FText DeclineText; // 0x2e8
	UAkAudioEvent* ConfirmAudioEvent; // 0x300
	UAkAudioEvent* DeclineAudioEvent; // 0x308
	FText QuestionText; // 0x310
	bool bFadeOut; // 0x328
	FMulticastInlineDelegate CountdownFinished; // 0x330
	int32_t CountdownTime; // 0x340
	bool ContinueCountdown; // 0x344
};

struct UOnsetNRTSettings : UAudioSynesthesiaNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct UTBP_ContextualHelp_Tutorial_HSense_C : UTBP_ContextualHelpBase_C {
	float RetriggerTime; // 0xf0
	FTimerHandle DelayTimer; // 0xf8
};

struct UTigerHealingConsumableAsset : UTigerConsumableAsset {
	float HealAmount; // 0x170
};

struct UTigerRangedModItemAsset : UTigerItemAsset {
	TArray<UTigerRangedWeaponModModifier*> ModEffects; // 0x128
	int32_t ModEquipPriority; // 0x138
	ERangedWeaponModType ModType; // 0x13c
};

struct UReplicationGraphNode_AlwaysRelevant : UReplicationGraphNode {
	UReplicationGraphNode* ChildNode; // 0x50
};

struct UABP_VMP_VEN_M_HAIR_05_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x300
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x760
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0xba0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0xfe0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x1420
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x1860
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x1cc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2100
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x3200
};

struct UTigerWeapon : UObject {
	UMaterialInterface* RarityMaterial; // 0x30
	ETigerItemRarity Rarity; // 0x38
	USkeletalMesh* SkeletalMesh; // 0x40
	USkeletalMesh* OffhandSkeletalMesh; // 0x48
	UAnimInstance* AnimClass; // 0x50
	UTigerWeaponCrosshairWidget* Crosshair; // 0x58
	UTexture2D* HUDIcon; // 0x60
	UCurveFloat* RarityDamageMultiplierCurve; // 0x68
	FName WeaponUnequipAnimation; // 0x70
	FName WeaponEquipAnimation; // 0x78
	FName PrimaryAttachPoint; // 0x80
	FName SecondaryAttachPoint; // 0x88
	float FearValueMultiplier; // 0x90
	float FearDistanceMultiplier; // 0x94
	bool bIsDualWeapon; // 0x98
	uint64_t PersistentTelemetryID; // 0xa0
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct USubmixEffectDynamicsProcessorPreset : USoundEffectSubmixPreset {
	FSubmixEffectDynamicsProcessorSettings Settings; // 0xe0
};

struct USlateAccessibleWidgetData : UObject {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	FDelegate AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	FDelegate AccessibleSummaryTextDelegate; // 0x70
};

struct UTigerFriendSubsystem : UGameInstanceSubsystem {
	TArray<UTigerFriend*> Friends; // 0x30
	TArray<UTigerFriendInvite*> Invites; // 0x40
	ETigerOnlineServiceStatus ServiceStatus; // 0x50
	UTigerPresenceSubsystem* PresenceSubsystem; // 0x130
	FString FriendSubsystemType; // 0x148
	UTigerFriendSubsystemImpl* Impl; // 0x158
};

struct UABP_VMP_NOS_M_HAIR_02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x318
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x340
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x780
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0xbc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x1000
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x1440
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1880
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1cc0
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x28
	bool bEnableTerrainSplineEditing; // 0x29
	bool bResizeSpriteDataToMatchTextures; // 0x2a
};

struct UTigerQueueForLogin : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate ReadyForLogin; // 0x30
	FMulticastInlineDelegate WaitTimeUpdated; // 0x40
	FMulticastInlineDelegate Error; // 0x50
	UTigerLoginQueueService* LoginQueueService; // 0x68
};

struct UChildConnection : UNetConnection {
	UNetConnection* Parent; // 0x1af0
};

struct UTigerUtilityPowerRoar : UTigerUtilityPowerBaseComponent {
	float DurationAIAreAffected; // 0xe8
	float ConeEffectLength; // 0xec
	float SphereEffectRadius; // 0xf0
	float ConeWidthAngle; // 0xf4
	float Cooldown; // 0xf8
	UAnimMontage* RoarStaggerAnimation; // 0x100
	UAnimMontage* RoarAnimation; // 0x108
	UAkAudioEvent* RoarSoundEvent; // 0x110
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UMaterialExpressionSceneDepthWithoutWater : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FVector2D ConstInput; // 0x58
	float FallbackDepth; // 0x60
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UTigerAIThreateningTargetService : UBTService {
	FBlackboardKeySelector ThreatPosition; // 0x70
	FBlackboardKeySelector CurrentThreatTarget; // 0x98
	FBlackboardKeySelector SuggestedNonObstructedPosition; // 0xc0
	FBlackboardKeySelector bIsAllowedToChaseKey; // 0xe8
	FBlackboardKeySelector bCanShoot; // 0x110
	bool bUseAttackPermissions; // 0x138
	bool bShowDebugFeatures; // 0x139
};

struct UTigerBloodPotencyComponent : UActorComponent {
	float BloodTypeWeights[0x4]; // 0xb0
	bool bEnableBloodTypeEffects; // 0xc0
	UTigerBloodPotencyVisualizationConfig* CurrentHeightenedSensesConfig; // 0xc8
	UTigerBloodPotencyVisualizationConfig* CurrentInWorldConfig; // 0xd0
	UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfiguration[0x4]; // 0xd8
	UTigerBloodPotencyVisualizationConfig* HeightenedSensesVisualConfigurationByBloodType[0x4]; // 0xf8
	UTigerBloodPotencyVisualizationConfig* InWorldVisualConfiguration[0x4]; // 0x118
	UTigerBloodPotencyVisualizationConfig* InWorldVisualConfigurationByBloodType[0x4]; // 0x138
	FName HeartMeshMaximumVisibilityDistanceName; // 0x158
	TArray<UMaterialInstance*> HsMeshPreviousMaterials; // 0x160
	TArray<UMaterialInstance*> HsMeshTargetMaterials; // 0x170
	TArray<UMaterialInstanceDynamic*> HsMeshCurrentMaterials; // 0x180
	USkeletalMeshComponent* HsSkeletalMeshComponent; // 0x190
	UParticleSystemComponent* HsParticleSystemComponent; // 0x198
	UNiagaraComponent* HsNiagaraComponent; // 0x1a0
	TArray<UMaterialInstance*> InWorldMeshPreviousMaterials; // 0x1a8
	TArray<UMaterialInstance*> InWorldMeshTargetMaterials; // 0x1b8
	TArray<UMaterialInstanceDynamic*> InWorldMeshCurrentMaterials; // 0x1c8
	USkeletalMeshComponent* InWorldSkeletalMeshComponent; // 0x1d8
	UParticleSystemComponent* InWorldParticleSystemComponent; // 0x1e0
	UNiagaraComponent* InWorldNiagaraComponent; // 0x1e8
	ATigerBaseNPC* NpcOwner; // 0x1f0
	float MaterialInterpolationDuration; // 0x208
};

struct ATigerNPCSpawningBase : AActor {
	ATigerAISplinePath* AISplinePath; // 0x228
	FName SpawningGroup; // 0x230
	int32_t SpawnAmount; // 0x238
	FGuid SpawningSubGroupId; // 0x23c
	float Prio; // 0x24c
	bool bShouldBeManuallyActivated; // 0x250
	FName MovementGroup; // 0x254
};

struct UGameplayTagsSettings : UGameplayTagsList {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool FastReplication; // 0x4a
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct UTigerGameGCClusterSubSystem : UGameInstanceSubsystem {
	TArray<AActor*> CurrentActorsToProcess; // 0x38
};

struct UTigerDialogueCondition_Outfit : UTigerDialogueCondition {
	ETigerDialogueOutfitRequirementSpecifier OutfitRequirement; // 0x30
	ETigerClan Clan; // 0x31
	ETigerGender Gender; // 0x32
	FString OutfitAssetName; // 0x38
};

struct UTigerBattlepassItem : UTigerInventoryItemBase {
	int32_t SeasonId; // 0x110
};

struct UCameraShakeBase : UObject {
	bool bSingleInstance; // 0x28
	float ShakeScale; // 0x2c
	APlayerCameraManager* CameraManager; // 0x30
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
	UMatineeCameraShake* ShakeClass; // 0x108
	float PlayScale; // 0x110
	ECameraShakePlaySpace PlaySpace; // 0x114
	FRotator UserDefinedPlaySpace; // 0x118
};

struct UTigerPassiveComponent : UActorComponent {
	ATigerPlayer* PlayerOwner; // 0xb0
	UTigerWidget* PassiveWidget; // 0xb8
};

struct AVolumetricLightmapDensityVolume : AVolume {
	FInt32Interval AllowedMipLevelRange; // 0x260
};

struct UARQRCodeComponent : UARComponent {
	FARQRCodeUpdatePayload ReplicatedPayload; // 0x280
};

struct USoundNodeQualityLevel : USoundNode {
	int32_t CookedQualityLevelIndex; // 0x48
};

struct UTigerCollectibleItemAsset : UTigerItemAsset {
	UTigerCollectibleData* Collectible; // 0x128
};

struct UTigerPassiveAdrenalineRushConfig : UTigerPassiveConfig {
	UTigerBuffAdrenalineRush* OnEnemyWithinRadiusBuff; // 0x118
	float RadiusInUnits; // 0x120
};

struct UDatasmithAssetUserData : UAssetUserData {
	TMap<FName, FString> MetaData; // 0x28
};

struct UNiagaraDataInterfaceArrayInt32 : UNiagaraDataInterfaceArray {
	TArray<int32_t> IntData; // 0x50
};

struct ATBP_SpectatorPawn_C : ATigerSpectatorPawn {
	FPointerToUberGraphFrame UberGraphFrame; // 0x308
	USceneComponent* Listener Component; // 0x310
	UCameraComponent* Camera; // 0x318
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct ATigerEnragedEffectActor : AActor {
	bool bIsActive; // 0x228
	bool bHasDamageBuff; // 0x229
	bool bIsRegenerating; // 0x22a
};

struct UWrapBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	bool bFillEmptySpace; // 0x48
	float FillSpanWhenLessThan; // 0x4c
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UMaterialExpressionArctangentFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UTigerChallengeTopPlayer : UTigerChallenge {
	int32_t TopPlacementRequirement; // 0xb0
};

struct UTigerMajestyBuff : UTigerBuff {
	float NPCDuration; // 0x248
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct UTigerPlayerGroup : UObject {
	TArray<TWeakObjectPtr<ATigerPlayerState>> Members; // 0x58
	TArray<TWeakObjectPtr<ATigerPlayerState>> Invitations; // 0x78
	UTigerPingCoordinator* PingCoordinator; // 0x88
};

struct UTigerWeaponAnimInstance : UAnimInstance {
	bool bShowWeaponTrails; // 0x2b8
};

struct ATigerPlayerGrid : AActor {
	TArray<FTigerPlayerGridCell> Cells; // 0x228
	FVector2D GridSize; // 0x238
	int32_t GridRows; // 0x240
	int32_t GridColumns; // 0x244
	int32_t CellDirectNeighborsToCheck; // 0x248
	UBoxComponent* GridBoxComponent; // 0x250
	bool bShowGrid; // 0x258
};

struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextBoxStyle EditableTextBoxStyle; // 0x30
};

struct ANavMeshBoundsVolume : AVolume {
	FNavAgentSelector SupportedAgents; // 0x260
};

struct UTBP_UI_HostMenu_C : UTigerMenuWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x290
	UButton* BackButton; // 0x298
	UButton* LaunchButton; // 0x2a0
	UEditableTextBox* UserServerName; // 0x2a8
	UTBP_TigerGameInstance_C* GameInstanceRef; // 0x2b0
	FText ServerNameText; // 0x2b8
	bool LaunchIsEnabled?; // 0x2d0
};

struct URichTextBlockImageDecorator : URichTextBlockDecorator {
	UDataTable* ImageSet; // 0x28
};

struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct UChaosClothSharedSimConfig : UClothSharedConfigCommon {
	int32_t IterationCount; // 0x28
	int32_t SubdivisionCount; // 0x2c
	float SelfCollisionThickness; // 0x30
	float CollisionThickness; // 0x34
	bool bUseDampingOverride; // 0x38
	float Damping; // 0x3c
	bool bUseGravityOverride; // 0x40
	float GravityScale; // 0x44
	FVector Gravity; // 0x48
	bool bUseLocalSpaceSimulation; // 0x54
	bool bUseXPBDConstraints; // 0x55
};

struct UTigerDisciplinesUi : UTigerWidget {
	UTigerDisciplineComponent* DisciplineComponent; // 0x280
	UTigerFeedingComponent* FeedingComponent; // 0x288
	UTigerDisciplineBase* DisciplineForSlot[0x3]; // 0x290
	ETigerDisciplinesEnum DisciplineTypeForSlot[0x3]; // 0x2a8
};

struct UTBP_UI_RegistrationSection_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTBP_UI_Button_CTA_C* Button_CTA_RegisterButton; // 0x268
	UVerticalBox* CountrySpecificExtras; // 0x270
	UTigerStyledRichTextBlock* DateofBirth_Text; // 0x278
	UTBP_UI_AdvancedTextBox_C* EmailBoxRegistration; // 0x280
	UTBP_UI_CheckboxWithClickabelText_C* KoreaCheckbox1; // 0x288
	UTBP_UI_CheckboxWithClickabelText_C* KoreaCheckbox2; // 0x290
	UTBP_UI_CheckboxWithClickabelText_C* KoreaCheckbox3; // 0x298
	UTBP_UI_CheckboxWithClickabelText_C* KoreaCheckbox4; // 0x2a0
	UTBP_UI_AdvancedTextBox_C* PasswordBoxRegistration; // 0x2a8
	UTigerStyledRichTextBlock* Regitster_Text; // 0x2b0
	UTBP_UI_AdvancedTextBox_C* RepeatPasswordBoxRegistration; // 0x2b8
	UTBP_UI_Divider_C* TBP_UI_Divider; // 0x2c0
	UTBP_UI_Divider_C* TBP_UI_Divider_6; // 0x2c8
	UTBP_UI_Loading_Throbber_C* TBP_UI_Loading_Throbber_Email; // 0x2d0
	UTBP_UI_Loading_Throbber_C* TBP_UI_Loading_Throbber_Registration; // 0x2d8
	UTBP_UI_Loading_Throbber_C* TBP_UI_Loading_Throbber_Username; // 0x2e0
	UTBP_UI_CheckboxWithClickabelText_C* TBP_UI_Registration_Checkbox_Newsletter; // 0x2e8
	UTBP_UI_CheckboxWithClickabelText_C* TBP_UI_Registration_Checkbox_PrivacyPolicy; // 0x2f0
	UTBP_UI_CheckboxWithClickabelText_C* TBP_UI_Registration_Checkbox_TermsOfService; // 0x2f8
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_Agreement; // 0x300
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_Country; // 0x308
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_Date; // 0x310
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_EmailRegistration; // 0x318
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_KoreaExtras_2; // 0x320
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_KoreaExtras_3; // 0x328
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_KoreaExtras_4; // 0x330
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_KoreaExtras_5; // 0x338
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_PasswordRegistration; // 0x340
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_Register; // 0x348
	UTBP_UI_SmallErrorMessage_C* TBP_UI_SmallErrorMessage_UsernameRegistration; // 0x350
	UTBP_UI_StyledComboBox_C* TBP_UI_StyledComboBox_Country; // 0x358
	UTBP_UI_StyledComboBox_C* TBP_UI_StyledComboBox_Day; // 0x360
	UTBP_UI_StyledComboBox_C* TBP_UI_StyledComboBox_Month; // 0x368
	UTBP_UI_StyledComboBox_C* TBP_UI_StyledComboBox_Year; // 0x370
	UTBP_UI_TextButton_C* TBP_UI_TextButton_ExitGame; // 0x378
	UTBP_UI_TextButton_C* TBP_UI_TextButton_SignIn; // 0x380
	UTBP_UI_TOS_PP_Popup_C* TBP_UI_TOS_PP_Popup; // 0x388
	UTBP_UI_AdvancedTextBox_C* UsernameBoxRegistration; // 0x390
	FMulticastInlineDelegate CreateAccount; // 0x398
	FMulticastInlineDelegate Back; // 0x3a8
	bool bYearSelected; // 0x3b8
	bool bMonthSelected; // 0x3b9
	bool bCountrySelected; // 0x3ba
	bool bDaySelected; // 0x3bb
	TArray<FText> Countries; // 0x3c0
	int32_t RegionId; // 0x3d0
	FText EmailUserChangeRevision; // 0x3d8
	FText UsernameUserChangeRevision; // 0x3f0
	bool bUsernameAvailable; // 0x408
	bool bEmailAvailable; // 0x409
	bool bPasswordEnteredCorrectly; // 0x40a
	bool bDateEnteredCorrectly; // 0x40b
	TMap<FString, bool> CachedEmailResponses; // 0x410
	TMap<FString, bool> CachedUsernameResponses; // 0x460
	UTBP_UI_LoginScreen_C* LoginScreen; // 0x4b0
	TMap<FString, int32_t> CountryDropDownKeyIndices; // 0x4b8
	int32_t CurrentKeyIndex; // 0x508
	FMulticastInlineDelegate ExitGame; // 0x510
	bool bTermsOfServiceAccepted; // 0x520
	bool bPrivacyPolicyAccepted; // 0x521
	bool bNewsletterAccepted; // 0x522
	bool bKoreaCheckbox1Accepted; // 0x523
	bool bKoreaCheckbox2Accepted; // 0x524
	bool bKoreaCheckbox3Accepted; // 0x525
	bool bKoreaCheckbox4Accepted; // 0x526
	FString Subheader_TextFormatting; // 0x528
	FString Subtitle_TextFormatting; // 0x538
	FString UL_TextFormatting; // 0x548
	FString Bold_TextFormating; // 0x558
	FString EL_TextFormatting; // 0x568
	FTimerHandle TimeoutTimerHandle; // 0x578
	bool bCountrySelectedKorea; // 0x580
	TMap<FString, int32_t> CachedUsernameResponsesProfanity; // 0x588
	FTimerHandle UsernameTimeoutTimerHandle; // 0x5d8
};

struct UTigerPostMatchScreenUI : UTigerLoadingScreenUI {
	FMulticastInlineDelegate OnReadyToTravel; // 0x298
};

struct UMaterialExpressionArctangent2 : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct URetainerBox : UContentWidget {
	bool bRetainRender; // 0x120
	bool RenderOnInvalidation; // 0x121
	bool RenderOnPhase; // 0x122
	int32_t Phase; // 0x124
	int32_t PhaseCount; // 0x128
	UMaterialInterface* EffectMaterial; // 0x130
	FName TextureParameter; // 0x138
};

struct UNiagaraSettings : UDeveloperSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UTigerAnimNotifyState_DamageImmunity : UAnimNotifyState {
	TArray<UDamageType*> ImmunityTo; // 0x30
};

struct UTigerColorSetAsset : UDataAsset {
	TMap<FName, FColor> ColorSets; // 0x30
	TMap<FName, float> ScalarParameters; // 0x80
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb0
	float LOSHearingThreshold; // 0xb4
	float SightRadius; // 0xb8
	float SensingInterval; // 0xbc
	float HearingMaxSoundAge; // 0xc0
	char bEnableSensingUpdates : 1; // 0xc4
	char bOnlySensePlayers : 1; // 0xc4
	char bSeePawns : 1; // 0xc4
	char bHearNoises : 1; // 0xc4
	FMulticastInlineDelegate OnSeePawn; // 0xd0
	FMulticastInlineDelegate OnHearNoise; // 0xe0
	float PeripheralVisionAngle; // 0xf0
	float PeripheralVisionCosine; // 0xf4
};

struct UTigerAiMovementBudgetAsset : UDataAsset {
	TMap<FName, FTigerAiMovementBudget> MovementBudgets; // 0x30
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UTigerAIWithinMovementBoundsServices : UBTService {
	FBlackboardKeySelector TargetLocationKey; // 0x70
};

struct UMaterialExpressionLogarithm2 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UTigerBalconyVolumeDefaultValues : UDataAsset {
	TArray<FTigerBuildingSystemBalconyVolumeDefaults> DefaultBalconyVolumeSets; // 0x30
};

struct ATigerBloodVein : AActor {
	FMulticastInlineDelegate OnEndOfVeinReached; // 0x228
	USplineComponent* Spline; // 0x238
	USceneComponent* CurrentPlayerSpot; // 0x240
	float EarliestDisconnectPoint; // 0x248
	float LatestDisconnectPoint; // 0x24c
	float VeinMovementSpeed; // 0x250
	bool bIsVeinActive; // 0x254
	ATigerHolyIncense* HolyIncense; // 0x258
	float StartSynchronizedTime; // 0x26c
};

struct UFileMediaSource : UBaseMediaSource {
	FString FilePath; // 0x88
	bool PrecacheFile; // 0x98
};

struct UTigerJoinSessionAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailed; // 0x40
};

struct UAsyncActionChangePrimaryAssetBundles : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UTigerTraversalWallGrindState : UTigerTraversalBaseFiniteState {
	UTigerTraversalStateWallGrindConfig* WallGrindConfig; // 0x140
};

struct UNiagaraParameterCollectionInstance : UObject {
	UNiagaraParameterCollection* Collection; // 0x28
	TArray<FNiagaraVariable> OverridenParameters; // 0x30
	FNiagaraParameterStore ParameterStorage; // 0x40
};

struct UNiagaraDataInterfaceArray : UNiagaraDataInterface {
	int32_t MaxElements; // 0x40
};

struct UTexture2DDynamic : UTexture {
	EPixelFormat Format; // 0xf0
};

struct ATigerActivatedObject : ATigerRebuildableActor {
	UStaticMeshComponent* BaseMesh; // 0x240
	UAkAudioEvent* ActivationAudioEvent; // 0x248
	bool bActivationAudioShouldPlay; // 0x250
	bool bTriggerOnlyOnPlayers; // 0x251
	bool bUseAudioActivationRadius; // 0x252
	float ActivationRadius; // 0x254
	float AudioFadeOutDuration; // 0x258
	TWeakObjectPtr<UShapeComponent> WeakCharacterTrigger; // 0x25c
};

struct UTigerLocalThrallMissionData : UObject {
	FMulticastInlineDelegate OnMissionProgression; // 0x28
	FMulticastInlineDelegate OnMissionComplete; // 0x38
	UTigerThrallMission* BaseMissionData; // 0x48
	UTigerThrallSystem* ThrallSystem; // 0x50
	FTigerPersistentMissionData PersistentMissionData; // 0x58
};

struct UWorld : UObject {
	ULevel* PersistentLevel; // 0x30
	UNetDriver* NetDriver; // 0x38
	ULineBatchComponent* LineBatcher; // 0x40
	ULineBatchComponent* PersistentLineBatcher; // 0x48
	ULineBatchComponent* ForegroundLineBatcher; // 0x50
	AGameNetworkManager* NetworkManager; // 0x58
	UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60
	TArray<UObject*> ExtraReferencedObjects; // 0x68
	TArray<UObject*> PerModuleDataObjects; // 0x78
	TArray<ULevelStreaming*> StreamingLevels; // 0x88
	FStreamingLevelsToConsider StreamingLevelsToConsider; // 0x98
	FString StreamingLevelsPrefix; // 0xc0
	ULevel* CurrentLevelPendingVisibility; // 0xd0
	ULevel* CurrentLevelPendingInvisibility; // 0xd8
	UDemoNetDriver* DemoNetDriver; // 0xe0
	AParticleEventManager* MyParticleEventManager; // 0xe8
	APhysicsVolume* DefaultPhysicsVolume; // 0xf0
	char bAreConstraintsDirty : 1; // 0x10e
	UNavigationSystemBase* NavigationSystem; // 0x110
	AGameModeBase* AuthorityGameMode; // 0x118
	AGameStateBase* GameState; // 0x120
	UAISystemBase* AISystem; // 0x128
	UAvoidanceManager* AvoidanceManager; // 0x130
	TArray<ULevel*> Levels; // 0x138
	TArray<FLevelCollection> LevelCollections; // 0x148
	UGameInstance* OwningGameInstance; // 0x180
	TArray<UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x188
	UCanvas* CanvasForRenderingToTarget; // 0x198
	UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x1a0
	TSet<UActorComponent*> ComponentsThatNeedPreEndOfFrameSync; // 0x1f8
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x248
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x258
	UWorldComposition* WorldComposition; // 0x5d8
	FWorldPSCPool PSCPool; // 0x698
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0x118
	TWeakObjectPtr<UWorld> World; // 0x128
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x130
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
};

struct UTigerBuffHealthRegenBase : UTigerBuff {
	float HealthToHeal; // 0x248
};

struct UTigerGameSettings : USharkLocalDeveloperSettings {
	FSoftObjectPath QuestCollection; // 0x38
	bool bEnableNpcSpawning; // 0x50
	float NpcLocationCorrectionInterval; // 0x54
	float ItemClusterSize; // 0x58
	float ItemClusterExtraReplicationRange; // 0x5c
	int32_t BuildingSystemVersion; // 0x60
	int32_t RoofSystemVersion; // 0x64
	int32_t RoofSystemFreeTransformableVersion; // 0x68
	FVector SideVolumeExtents; // 0x6c
	float BelowSideMargin; // 0x78
	float BelowDepthMargin; // 0x7c
	float BelowVolumeHeight; // 0x80
	float ShallowBalconyDepth; // 0x84
	bool bEnableApartments; // 0x88
	ATigerBuildingWallPreviewer* BuildingWallPreviewerClass; // 0x90
	bool bEnableStatisticsGathering; // 0x98
	bool bEnableLandingPage; // 0x99
	bool bEnableIntro; // 0x9a
	FSoftObjectPath TutorialLevel; // 0xa0
	FSoftObjectPath TransferFromMatchLevel; // 0xb8
	TSoftClassPtr<UObject> CustomizationOptions; // 0xd0
	TSoftClassPtr<UObject> ItemsDatabase; // 0xf8
	TSoftClassPtr<UObject> GrimoireTree; // 0x120
	TSoftClassPtr<UObject> GrimoireSeasonDatabase; // 0x148
	TSoftObjectPtr<UTigerGrimoireEntry> TrainingVideoGrimoireEntry; // 0x170
	TSoftClassPtr<UObject> ChallengeDatabase; // 0x198
	FSoftObjectPath MasteryChallenges; // 0x1c0
	FString PromotionalPopupConfigUrl; // 0x1d8
	TSoftObjectPtr<UMaterial> AssetStatusDoNotUseMaterial; // 0x1e8
	bool bLogNetworkMovementFlagsOnServer; // 0x210
	FRotator SavedPlayerRotation; // 0x214
	FVector SavedPlayerLocation; // 0x220
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UAkAssetData : UObject {
	uint32_t CachedHash; // 0x28
};

struct UTigerJudgeSwordComponent : UStaticMeshComponent {
	UParticleSystem* CharacterHitEffect; // 0x4e0
	UAkAudioEvent* CharacterHitSound; // 0x4e8
};

struct ATigerSplatmapCell : AActor {
	UTexture2D* TextureResource; // 0x228
	UMaterialInterface* DrawMaterial; // 0x230
	float BoundsSize; // 0x238
};

struct UUMGSequencePlayer : UObject {
	UWidgetAnimation* Animation; // 0x410
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x420
};

struct UWidgetBlueprintGeneratedClass : UBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x328
	char bClassRequiresNativeTick : 1; // 0x330
	TArray<FDelegateRuntimeBinding> Bindings; // 0x338
	TArray<UWidgetAnimation*> Animations; // 0x348
	TArray<FName> NamedSlots; // 0x358
};

struct UModularSynthComponent : USynthComponent {
	int32_t VoiceCount; // 0x6c0
};

struct UInteractiveGizmo : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x30
};

struct UTigerDisciplineConfigs : UObject {
	TMap<ETigerDisciplinesEnum, UTigerActiveDisciplineConfig*> Configs; // 0x28
};

struct ASkyAtmosphere : AInfo {
	USkyAtmosphereComponent* SkyAtmosphereComponent; // 0x228
};

struct ATigerEmptyActorWithChild : AActor {
	UChildActorComponent* ChildActorComponent; // 0x228
};

struct USoundNodeRandom : USoundNode {
	TArray<float> Weights; // 0x48
	TArray<bool> HasBeenUsed; // 0x58
	int32_t NumRandomUsed; // 0x68
	int32_t PreselectAtLevelLoad; // 0x6c
	char bShouldExcludeFromBranchCulling : 1; // 0x70
	char bSoundCueExcludedFromBranchCulling : 1; // 0x70
	char bRandomizeWithoutReplacement : 1; // 0x70
};

struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x30
	int32_t EventId; // 0x34
};

struct UTigerGrimoireUi : UTigerSceneBackgroundUI {
	bool bNotificationIdsSetup; // 0x3b0
	ATigerModelViewerItem* GrimoireItem; // 0x3b8
	ATigerGrimoireCard* GrimoireCard; // 0x3c0
	AActor* ModelCam; // 0x3c8
	AActor* CloseModelCam; // 0x3d0
	FName ItemRotationNodeTag; // 0x3d8
	FName CloseViewerCamName; // 0x3e0
	FName ViewerCamName; // 0x3e8
	FName ExaminablePropsLevelName; // 0x3f0
	AActor* ItemRotationNode; // 0x3f8
	FName LightingSubLevelName; // 0x400
};

struct USoundNodeConcatenator : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x230
};

struct USourceEffectFilterPreset : USoundEffectSourcePreset {
	FSourceEffectFilterSettings Settings; // 0xb0
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UTextureRenderTargetVolume : UTextureRenderTarget {
	int32_t SizeX; // 0xf0
	int32_t SizeY; // 0xf4
	int32_t SizeZ; // 0xf8
	FLinearColor ClearColor; // 0xfc
	EPixelFormat OverrideFormat; // 0x10c
	char bHDR : 1; // 0x10d
	char bForceLinearGamma : 1; // 0x10d
};

struct UTigerAiPlayerDiablerizeTask : UBTTask_BlackboardBase {
	float MaximumDiablerizeDistance; // 0x98
};

struct UTigerRevivingStatusUI : UTigerWidget {
	FText RegeneratingStatusText; // 0x280
	FText DiablerizingStatusText; // 0x298
	FText BeingRevivedStatusText; // 0x2b0
	ETigerPhysicalInteraction PhysicalInteractionStatus; // 0x2c8
	bool bShouldUpdateTimer; // 0x2c9
	float TimeLeft; // 0x2cc
	float PercentageLeft; // 0x2d0
	bool ShowPrompt; // 0x2dc
};

struct UEnvQueryTest_Dot : UEnvQueryTest {
	FEnvDirection LineA; // 0x1f8
	FEnvDirection LineB; // 0x218
	EEnvTestDot TestMode; // 0x238
	bool bAbsoluteValue; // 0x239
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x78
	FMovieScenePropertyBinding PropertyBinding; // 0x80
	TArray<UMovieSceneSection*> Sections; // 0x98
};

struct UABP_PoseableMesh_F_C : UTigerCharacterPoseableMeshAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	FAnimNode_Root AnimGraphNode_Root; // 0x318
	FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x348
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x358
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x378
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x480
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	FPerPlatformFloat ScreenCullSize; // 0xd8
	TArray<FSkeletalMaterial> Materials; // 0xe0
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xf0
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0x100
	FPerPlatformInt MinLOD; // 0x160
	FPerPlatformBool DisableBelowMinLodStripping; // 0x164
	EAxis SkelMirrorAxis; // 0x165
	EAxis SkelMirrorFlipAxis; // 0x166
	char bUseFullPrecisionUVs : 1; // 0x167
	char bUseHighPrecisionTangentBasis : 1; // 0x167
	char bHasBeenSimplified : 1; // 0x167
	char bHasVertexColors : 1; // 0x167
	char bEnablePerPolyCollision : 1; // 0x167
	UBodySetup* BodySetup; // 0x168
	UPhysicsAsset* PhysicsAsset; // 0x170
	UPhysicsAsset* ShadowPhysicsAsset; // 0x178
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x180
	TArray<UMorphTarget*> MorphTargets; // 0x190
	UAnimInstance* PostProcessAnimBlueprint; // 0x318
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x320
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x330
	TArray<UAssetUserData*> AssetUserData; // 0x360
	TArray<USkeletalMeshSocket*> Sockets; // 0x370
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x390
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct UTBP_BestialTrailPart_SplineMesh_C : UTigerBestialTrailPart {
	FPointerToUberGraphFrame UberGraphFrame; // 0x580
	ATigerBestialTrailVisualizer* Visualizer; // 0x588
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xb0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xb8
};

struct UTBP_UI_Text_C : UTigerTextWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UTextBlock* TextWidget; // 0x288
	FText Text; // 0x290
	int32_t Size; // 0x2a8
};

struct UTigerPassiveVentrueOneLogic : UTigerPassiveComponent {
	UTigerPassiveVentrueOneConfig* Config; // 0xc0
	ATigerPlayer* Player; // 0xc8
	USphereComponent* RadiusComponent; // 0xd0
	TArray<ATigerCharacter*> CharactersInShockwaveRange; // 0xd8
};

struct UMovieSceneEntitySystemLinker : UObject {
	FMovieSceneEntitySystemGraph SystemGraph; // 0x238
};

struct UArrowComponent : UPrimitiveComponent {
	FColor ArrowColor; // 0x450
	float ArrowSize; // 0x454
	float ArrowLength; // 0x458
	float ScreenSize; // 0x45c
	char bIsScreenSizeScaled : 1; // 0x460
	char bTreatAsASprite : 1; // 0x460
};

struct UMaterialExpressionCosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UDatasmithFBXSceneImportData : UDatasmithSceneImportData {
	bool bGenerateLightmapUVs; // 0x28
	FString TexturesDir; // 0x30
	char IntermediateSerialization; // 0x40
	bool bColorizeMaterials; // 0x41
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UTigerDisciplineCharm : UTigerDisciplineAnimTriggered {
	UTigerCharmConfig* Config; // 0x108
};

struct UTigerOnlineSettings : UDeveloperSettings {
	bool bResetPlayerDataInEditor; // 0x38
	FString OnlineServicesBaseUrlDev; // 0x40
	FString OnlineServicesBaseUrlUatRelease; // 0x50
	FString OnlineServicesBaseUrlUatMain; // 0x60
	FString OnlineServicesBaseUrlUatPs5; // 0x70
	FString OnlineServicesBaseUrlUatStaging; // 0x80
	FString OnlineServicesBaseUrlProd; // 0x90
	FString OnlineServicesBaseUrlLocal; // 0xa0
	FString OnlineServicesPushBaseUrlDev; // 0xb0
	FString OnlineServicesPushBaseUrlUatRelease; // 0xc0
	FString OnlineServicesPushBaseUrlUatMain; // 0xd0
	FString OnlineServicesPushBaseUrlUatPs5; // 0xe0
	FString OnlineServicesPushBaseUrlUatStaging; // 0xf0
	FString OnlineServicesPushBaseUrlProd; // 0x100
	FString OnlineServicesPushBaseUrlLocal; // 0x110
	FString CdnBaseUrlDev; // 0x120
	FString CdnBaseUrlUat; // 0x130
	FString CdnBaseUrlProd; // 0x140
	FString PlayerDataServiceUri; // 0x150
	FString SessionServiceUri; // 0x160
	FString PushServiceUri; // 0x170
	FString PartyServiceUri; // 0x180
	FString FriendServiceUri; // 0x190
	FString PresenceServiceUri; // 0x1a0
	FString LoginQueueServiceUri; // 0x1b0
	FString StoreServiceUri; // 0x1c0
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UMovieScene3DTransformSection : UMovieSceneSection {
	FMovieSceneTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x3]; // 0xf8
	FMovieSceneFloatChannel Rotation[0x3]; // 0x2d8
	FMovieSceneFloatChannel Scale[0x3]; // 0x4b8
	FMovieSceneFloatChannel ManualWeight; // 0x698
	bool bUseQuaternionInterpolation; // 0x738
};

struct UGizmoAxisTranslationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Parameter; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurTranslationAxis; // 0xbc
	FVector CurTranslationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct UMovieSceneVectorSection : UMovieSceneSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe8
	int32_t ChannelsUsed; // 0x368
};

struct USkyLightComponent : ULightComponentBase {
	bool bRealTimeCapture; // 0x230
	ESkyLightSourceType SourceType; // 0x231
	UTextureCube* Cubemap; // 0x238
	float SourceCubemapAngle; // 0x240
	int32_t CubemapResolution; // 0x244
	float SkyDistanceThreshold; // 0x248
	bool bCaptureEmissiveOnly; // 0x24c
	bool bLowerHemisphereIsBlack; // 0x24d
	FLinearColor LowerHemisphereColor; // 0x250
	float OcclusionMaxDistance; // 0x260
	float Contrast; // 0x264
	float OcclusionExponent; // 0x268
	float MinOcclusion; // 0x26c
	FColor OcclusionTint; // 0x270
	char bCloudAmbientOcclusion : 1; // 0x274
	float CloudAmbientOcclusionStrength; // 0x278
	float CloudAmbientOcclusionExtent; // 0x27c
	float CloudAmbientOcclusionMapResolutionScale; // 0x280
	float CloudAmbientOcclusionApertureScale; // 0x284
	EOcclusionCombineMode OcclusionCombineMode; // 0x288
	UTextureCube* BlendDestinationCubemap; // 0x348
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x840
	float CheckpointSaveMaxMSPerFrame; // 0x9ec
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xa10
	bool bIsLocalReplay; // 0xa20
	TArray<APlayerController*> SpectatorControllers; // 0xa28
};

struct ATigerShacklesMine : AActor {
	UTigerBuff* ThornsBuff; // 0x228
	UTigerBuff* ShacklesBuff; // 0x230
	USceneComponent* Root; // 0x238
	USceneComponent* IndicatorAnchor; // 0x240
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UMaterialExpressionDeriveNormalZ : UMaterialExpression {
	FExpressionInput InXY; // 0x40
};

struct UReplicationGraphNode_GridCell : UReplicationGraphNode_ActorList {
	UReplicationGraphNode* DynamicNode; // 0x140
	UReplicationGraphNode_DormancyNode* DormancyNode; // 0x148
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x228
};

struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct UMaterialExpressionAppendVector : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UBTComposite_SimpleParallel : UBTCompositeNode {
	EBTParallelMode FinishMode; // 0x90
};

struct UShOnlineServerSettings : UDeveloperSettings {
	FString ServerSecretDev; // 0x38
	FString ServerSecretUat; // 0x48
	FString ServerSecretProd; // 0x58
	FString ServerSecretLocal; // 0x68
};

struct UEnvQueryTest_Trace : UEnvQueryTest {
	FEnvTraceData TraceData; // 0x1f8
	FAIDataProviderBoolValue TraceFromContext; // 0x228
	FAIDataProviderFloatValue ItemHeightOffset; // 0x260
	FAIDataProviderFloatValue ContextHeightOffset; // 0x298
	UEnvQueryContext* Context; // 0x2d0
};

struct UARGetCandidateObjectAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UFieldSystemMetaDataIteration : UFieldSystemMetaData {
	int32_t Iterations; // 0xb0
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UParticleModuleEventReceiverKillParticles : UParticleModuleEventReceiverBase {
	char bStopSpawning : 1; // 0x40
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct ATigerLootContainer : ATigerInteractiveObject {
	bool bDoorIsOpen; // 0x288
	UTigerBlueprintLootComponent* LootSpawnerComponent; // 0x290
};

struct UTigerNpcAccuracyComponent : UActorComponent {
	float TimeToReachMaxAccuracy; // 0xb0
	float TimeToReachMaxInaccuracy; // 0xb4
	float MaxAccuracyConeRadius; // 0xb8
	float MinAccuracyConeRadius; // 0xbc
	float AccuracyDistance; // 0xc0
	float MovingTargetAccuracyPenaltyPercentage; // 0xc4
	float MinSwooshByAccuracyConeRadius; // 0xc8
	float MaxSwooshByAccuracyConeRadius; // 0xcc
	float MinSwooshByAccuracyDistance; // 0xd0
	bool bShouldKeepAccuracyWhenSwitchingToTargetsAlly; // 0xd4
	bool bShouldDebugDraw; // 0xd5
	bool bShouldMissEveryBurst; // 0xd6
	ATigerNPC* Owner; // 0xe0
};

struct UParticleModuleSize : UParticleModuleSizeBase {
	FRawDistributionVector StartSize; // 0x30
};

struct UTBP_ContextualHelp_TeammateRevive_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UTigerAiPlayerUseWeapon : UBTTaskNode {
	ATigerLocalAIControllerBase* LocalAIController; // 0x80
	ATigerPlayerController* PlayerController; // 0x88
};

struct UTigerSpawnMechanicBloodVein : UTigerSpawnMechanic {
	ATigerBloodVein* StartBloodVein; // 0x28
};

struct UARObjectComponent : UARComponent {
	FARObjectUpdatePayload ReplicatedPayload; // 0x280
};

struct UABP_VMP_BRU_F_HAIR_07_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2e8
	FAnimNode_Root AnimGraphNode_Root; // 0x308
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x340
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x780
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xbc0
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x3c
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x48
	char bAutoCreateNavigationData : 1; // 0x70
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x70
	char bAllowClientSideNavigation : 1; // 0x70
	char bShouldDiscardSubLevelNavData : 1; // 0x70
	char bTickWhilePaused : 1; // 0x70
	char bSupportRebuilding : 1; // 0x70
	char bInitialBuildingLocked : 1; // 0x70
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x71
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x71
	float ActiveTilesUpdateInterval; // 0x74
	ENavDataGatheringModeConfig DataGatheringMode; // 0x78
	float DirtyAreaWarningSizeThreshold; // 0x7c
	TArray<FNavDataConfig> SupportedAgents; // 0x80
	FNavAgentSelector SupportedAgentsMask; // 0x90
	TArray<ANavigationData*> NavDataSet; // 0x98
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa8
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc8
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd8
	FNavigationSystemRunMode OperationMode; // 0x1c4
	float DirtyAreasUpdateFreq; // 0x1604
};

struct UTBP_UI_LoadingScreen_Simple_C : UTigerLoadingScreenUI {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	UWidgetAnimation* MoveText; // 0x2a0
	UWidgetAnimation* FadeOutAnimation; // 0x2a8
	UWidgetAnimation* FadeInAnimation; // 0x2b0
	UImage* BackgroundWidget; // 0x2b8
	UTigerStyledRichTextBlock* DestinationText; // 0x2c0
	UImage* Image_119; // 0x2c8
	UTextBlock* LoadingScreenWarning; // 0x2d0
	UTextBlock* MovingTextAnim; // 0x2d8
	UCanvasPanel* RootLayout; // 0x2e0
	UTBP_UI_Divider_C* TBP_UI_Divider; // 0x2e8
	UTBP_UI_Gradient_C* TBP_UI_Gradient; // 0x2f0
	UTBP_UI_Loading_Throbber_C* TBP_UI_Loading_Throbber; // 0x2f8
	UTextBlock* TickMovingText; // 0x300
	UTigerSafeZoneWidget* TigerSafeZoneWidget_9; // 0x308
	UTigerStyledRichTextBlock* TipDescriptionText; // 0x310
	UTigerStyledRichTextBlock* TipTitleText; // 0x318
	int32_t PlayngId; // 0x320
	float DebugPingPongSign; // 0x324
	UTBP_LoadingToolTip_C* LoadingTipsAsset; // 0x328
	int32_t LastLoadingTipUpdatedTime; // 0x330
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xf0
};

struct UGameMapsSettings : UObject {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct UMaterialExpressionWorldPosition : UMaterialExpression {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x40
};

struct UAnimSet : UObject {
	char bAnimRotationOnly : 1; // 0x28
	TArray<FName> TrackBoneNames; // 0x30
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x40
	TArray<char> BoneUseAnimTranslation; // 0x50
	TArray<char> ForceUseMeshTranslation; // 0x60
	TArray<FName> UseTranslationBoneNames; // 0x70
	TArray<FName> ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98
};

struct UGameplayTask : UObject {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct USoundWave : USoundBase {
	int32_t CompressionQuality; // 0x1b8
	int32_t StreamingPriority; // 0x1bc
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x1c0
	ESoundGroup SoundGroup; // 0x1c2
	char bLooping : 1; // 0x1c3
	char bStreaming : 1; // 0x1c3
	char bSeekableStreaming : 1; // 0x1c3
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x1c4
	char bMature : 1; // 0x1c5
	char bManualWordWrap : 1; // 0x1c5
	char bSingleLine : 1; // 0x1c6
	char bIsAmbisonics : 1; // 0x1c6
	TArray<float> FrequenciesToAnalyze; // 0x1c8
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x1d8
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x1e8
	int32_t InitialChunkSize; // 0x1f8
	FString SpokenText; // 0x240
	float SubtitlePriority; // 0x250
	float Volume; // 0x254
	float Pitch; // 0x258
	int32_t NumChannels; // 0x25c
	int32_t SampleRate; // 0x260
	TArray<FSubtitleCue> Subtitles; // 0x270
	UCurveTable* Curves; // 0x280
	UCurveTable* InternalCurves; // 0x288
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	FPerPlatformFloat ScreenSizeCullingDefaultSize; // 0x58
	char bTextureStreaming : 1; // 0x5c
	char bUseDXT5NormalMaps : 1; // 0x5c
	char bVirtualTextures : 1; // 0x5c
	char bVirtualTexturedLightmaps : 1; // 0x5c
	uint32_t VirtualTextureTileSize; // 0x60
	uint32_t VirtualTextureTileBorderSize; // 0x64
	uint32_t VirtualTextureFeedbackFactor; // 0x68
	char bVirtualTextureEnableCompressZlib : 1; // 0x6c
	char bVirtualTextureEnableCompressCrunch : 1; // 0x6c
	char bClearCoatEnableSecondNormal : 1; // 0x6c
	int32_t ReflectionCaptureResolution; // 0x70
	char bReflectionCaptureCompression : 1; // 0x74
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x74
	char bForwardShading : 1; // 0x74
	char bVertexFoggingForOpaque : 1; // 0x74
	char bAllowStaticLighting : 1; // 0x74
	char bAllowPrecomputedShadows : 1; // 0x74
	char bUseNormalMapsForStaticLighting : 1; // 0x74
	char bGenerateMeshDistanceFields : 1; // 0x74
	char bEightBitMeshDistanceFields : 1; // 0x75
	char bGenerateLandscapeGIData : 1; // 0x75
	char bCompressMeshDistanceFields : 1; // 0x75
	float TessellationAdaptivePixelsPerTriangle; // 0x78
	char bSeparateTranslucency : 1; // 0x7c
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x80
	FVector TranslucentSortAxis; // 0x84
	ECustomDepthStencil CustomDepthStencil; // 0x90
	char bCustomDepthTaaJitter : 1; // 0x94
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x98
	char bDefaultFeatureBloom : 1; // 0x9c
	char bDefaultFeatureAmbientOcclusion : 1; // 0x9c
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x9c
	char bDefaultFeatureAutoExposure : 1; // 0x9c
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0xa0
	float DefaultFeatureAutoExposureBias; // 0xa4
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa8
	char bUsePreExposure : 1; // 0xa8
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa8
	char bDefaultFeatureMotionBlur : 1; // 0xa8
	char bDefaultFeatureLensFlare : 1; // 0xa8
	char bTemporalUpsampling : 1; // 0xa8
	char bSSGI : 1; // 0xa8
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xac
	ELightUnits DefaultLightUnits; // 0xad
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xae
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xb0
	char bStencilForLODDither : 1; // 0xb0
	EEarlyZPass EarlyZPass; // 0xb4
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb8
	char bDBuffer : 1; // 0xb8
	EClearSceneOptions ClearSceneMethod; // 0xbc
	char bBasePassOutputsVelocity : 1; // 0xc0
	char bVertexDeformationOutputsVelocity : 1; // 0xc0
	char bSelectiveBasePassOutputs : 1; // 0xc0
	char bDefaultParticleCutouts : 1; // 0xc0
	int32_t GPUSimulationTextureSizeX; // 0xc4
	int32_t GPUSimulationTextureSizeY; // 0xc8
	char bGlobalClipPlane : 1; // 0xcc
	EGBufferFormat GBufferFormat; // 0xd0
	char bUseGPUMorphTargets : 1; // 0xd4
	char bNvidiaAftermathEnabled : 1; // 0xd4
	char bMultiView : 1; // 0xd4
	char bMobilePostProcessing : 1; // 0xd4
	char bMobileMultiView : 1; // 0xd4
	char bMobileUseHWsRGBEncoding : 1; // 0xd4
	char bRoundRobinOcclusion : 1; // 0xd4
	char bODSCapture : 1; // 0xd4
	char bMeshStreaming : 1; // 0xd5
	float WireframeCullThreshold; // 0xd8
	char bEnableRayTracing : 1; // 0xdc
	char bEnableRayTracingTextureLOD : 1; // 0xdc
	char bSupportStationarySkylight : 1; // 0xdc
	char bSupportLowQualityLightmaps : 1; // 0xdc
	char bSupportPointLightWholeSceneShadows : 1; // 0xdc
	char bSupportAtmosphericFog : 1; // 0xdc
	char bSupportSkyAtmosphere : 1; // 0xdc
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xdc
	char bSupportSkinCacheShaders : 1; // 0xdd
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xe0
	float SkinCacheSceneMemoryLimitInMB; // 0xe4
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe8
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe8
	char bMobileAllowDistanceFieldShadows : 1; // 0xe8
	char bMobileAllowMovableDirectionalLights : 1; // 0xe8
	uint32_t MobileNumDynamicPointLights; // 0xec
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xf0
	char bMobileAllowMovableSpotlights : 1; // 0xf0
	char bMobileAllowMovableSpotlightShadows : 1; // 0xf0
	char bSupport16BitBoneIndex : 1; // 0xf0
	char bGPUSkinLimit2BoneInfluences : 1; // 0xf0
	char bSupportDepthOnlyIndexBuffers : 1; // 0xf0
	char bSupportReversedIndexBuffers : 1; // 0xf0
	char bLPV : 1; // 0xf0
	char bMobileAmbientOcclusion : 1; // 0xf1
	char bUseUnlimitedBoneInfluences : 1; // 0xf1
	int32_t UnlimitedBonInfluencesThreshold; // 0xf4
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf8
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0xf9
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0xfa
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0x100
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x118
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x130
};

struct ULevelStreaming : UObject {
	TSoftObjectPtr<UWorld> WorldAsset; // 0x28
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	int32_t LevelLODIndex; // 0xb4
	int32_t StreamingPriority; // 0xb8
	char bShouldBeVisible : 1; // 0xbe
	char bShouldBeLoaded : 1; // 0xbe
	char bLocked : 1; // 0xbe
	char bIsStatic : 1; // 0xbf
	char bShouldBlockOnLoad : 1; // 0xbf
	char bShouldBlockOnUnload : 1; // 0xbf
	char bDisableDistanceStreaming : 1; // 0xbf
	char bDrawOnLevelStatusMap : 1; // 0xbf
	FLinearColor LevelColor; // 0xc0
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	FMulticastInlineDelegate OnLevelLoaded; // 0xe8
	FMulticastInlineDelegate OnLevelUnloaded; // 0xf8
	FMulticastInlineDelegate OnLevelShown; // 0x108
	FMulticastInlineDelegate OnLevelHidden; // 0x118
	ULevel* LoadedLevel; // 0x128
	ULevel* PendingUnloadLevel; // 0x130
};

struct UBookMark2D : UBookmarkBase {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UTBP_UI_LoginScreen_C : UTigerMenuWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x290
	UWidgetAnimation* FadeOut; // 0x298
	UWidgetAnimation* FadeIn; // 0x2a0
	UImage* BlackFade; // 0x2a8
	UTextBlock* ErrorMessage; // 0x2b0
	UTBP_UI_LicenseAgreement_Popup_C* ExportGateDeniedPopup; // 0x2b8
	UTBP_UI_LicenseAgreement_Popup_C* ExportGatePopup; // 0x2c0
	UTBP_UI_GetDevTicketSection_C* GetDevTicketSection; // 0x2c8
	UTBP_UI_LoginQueueSection_C* LoginQueueSection; // 0x2d0
	UTBP_UI_LoginSection_C* LoginSection; // 0x2d8
	UTBP_UI_RegistrationSection_C* RegistrationSection; // 0x2e0
	UWidgetSwitcher* SectionSwitcher; // 0x2e8
	UWidgetSwitcher* StatusSwitcher; // 0x2f0
	UTBP_UI_Loading_Throbber_C* TBP_UI_Loading_Throbber; // 0x2f8
	UTigerSafeZoneWidget* TigerSafeZoneWidget_1; // 0x300
	UImage* Vein1; // 0x308
	UImage* Vein2; // 0x310
	UImage* Vein3; // 0x318
	UTBP_UI_VerificationSection_C* VerificationSection; // 0x320
	USizeBox* WorkThrobber; // 0x328
	FMulticastInlineDelegate LoginSucceeded; // 0x330
	FMulticastInlineDelegate OnValidVersionDispatch; // 0x340
	FMulticastInlineDelegate OnInvalidVersionDispatch; // 0x350
	FTigerLoginQueueToken LoginQueueToken; // 0x360
	FText AccountLicenseAgreementTitle; // 0x370
	FText AccountLicenseAgreementText; // 0x388
	bool EnableLicenseAgreement; // 0x3a0
	TMap<int32_t, int32_t> ThirdPartyErrorsBoxMapping; // 0x3a8
	TMap<int32_t, FText> ThirdPartyErrorCodes; // 0x3f8
	int32_t ErrorBoxIndex; // 0x448
	FText AccountExportGateTitle; // 0x450
	FText AccountExportGateText; // 0x468
	FString Subheader_TextFormatting; // 0x480
	FString Subtitle_TextFormatting; // 0x490
	FString UL_TextFormatting; // 0x4a0
	FString Bold_TextFormating; // 0x4b0
	FString EL_TextFormatting; // 0x4c0
};

struct ATBP_ShockwaveWallTrail_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x228
	UParticleSystemComponent* ParticleSystem trail; // 0x230
	USceneComponent* DefaultSceneRoot; // 0x238
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UAkSettings : UObject {
	char MaxSimultaneousReverbVolumes; // 0x28
	FFilePath WwiseProjectPath; // 0x30
	FDirectoryPath WwiseSoundDataFolder; // 0x40
	bool bAutoConnectToWAAPI; // 0x50
	ECollisionChannel DefaultOcclusionCollisionChannel; // 0x51
	ECollisionChannel DefaultFitToGeometryCollisionChannel; // 0x52
	TMap<TSoftObjectPtr<UPhysicalMaterial>, FAkGeometrySurfacePropertiesToMap> AkGeometryMap; // 0x58
	float GlobalDecayAbsorption; // 0xa8
	TSoftObjectPtr<UAkAuxBus> DefaultReverbAuxBus; // 0xb0
	TMap<float, TSoftObjectPtr<UAkAuxBus>> EnvironmentDecayAuxBusMap; // 0xd8
	FString HFDampingName; // 0x128
	FString DecayEstimateName; // 0x138
	FString TimeToFirstReflectionName; // 0x148
	TSoftObjectPtr<UAkRtpc> HFDampingRTPC; // 0x158
	TSoftObjectPtr<UAkRtpc> DecayEstimateRTPC; // 0x180
	TSoftObjectPtr<UAkRtpc> TimeToFirstReflectionRTPC; // 0x1a8
	TMap<FGuid, FAkAcousticTextureParams> AcousticTextureParamsMap; // 0x1d0
	bool SplitSwitchContainerMedia; // 0x220
	bool SplitMediaPerFolder; // 0x221
	bool UseEventBasedPackaging; // 0x222
	bool EnableAutomaticAssetSynchronization; // 0x223
	FString CommandletCommitMessage; // 0x228
	TMap<FString, FString> UnrealCultureToWwiseCulture; // 0x238
	bool AskedToUseNewAssetManagement; // 0x288
	bool bEnableMultiCoreRendering; // 0x289
	bool MigratedEnableMultiCoreRendering; // 0x28a
	bool FixupRedirectorsDuringMigration; // 0x28b
	FDirectoryPath WwiseWindowsInstallationPath; // 0x290
	FFilePath WwiseMacInstallationPath; // 0x2a0
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UChildActorComponent : USceneComponent {
	AActor* ChildActorClass; // 0x1f8
	AActor* ChildActor; // 0x200
	AActor* ChildActorTemplate; // 0x208
};

struct ATigerRatSpawnpoint : AActor {
	int32_t NumRatsToSpawn; // 0x228
};

struct UTBP_ContextualHelp_Downed_C : UTBP_ContextualHelpBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UDatasmithMaterialInstanceTemplate : UDatasmithObjectTemplate {
	TSoftObjectPtr<UMaterialInterface> ParentMaterial; // 0x30
	TMap<FName, float> ScalarParameterValues; // 0x58
	TMap<FName, FLinearColor> VectorParameterValues; // 0xa8
	TMap<FName, TSoftObjectPtr<UTexture>> TextureParameterValues; // 0xf8
	FDatasmithStaticParameterSetTemplate StaticParameters; // 0x148
};

struct ULandscapeSplineSegment : UObject {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct UNiagaraDataInterfaceRenderTarget2D : UNiagaraDataInterfaceRWBase {
	FIntPoint Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe0
	char bOverrideFormat : 1; // 0xe1
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x108
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x2]; // 0xf8
	FMovieSceneFloatChannel Rotation; // 0x238
	FMovieSceneFloatChannel Scale[0x2]; // 0x2d8
	FMovieSceneFloatChannel Shear[0x2]; // 0x418
};

struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; // 0x38
};

struct UAsyncActionHandleSaveGame : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
	USaveGame* SaveGameObject; // 0x60
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct UABP_VMP_BRU_F_HAIR_02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_19; // 0x300
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_18; // 0x740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_17; // 0xb80
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xfc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_16; // 0xfe0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_15; // 0x1420
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_14; // 0x1860
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x20e0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2520
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x2540
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x2980
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x2dc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x3200
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x3640
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x3a80
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x3ec0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x4300
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x4740
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x4b80
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x4fc0
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UPhysicalMaterial : UObject {
	float Friction; // 0x28
	float StaticFriction; // 0x2c
	EFrictionCombineMode FrictionCombineMode; // 0x30
	bool bOverrideFrictionCombineMode; // 0x31
	float Restitution; // 0x34
	EFrictionCombineMode RestitutionCombineMode; // 0x38
	bool bOverrideRestitutionCombineMode; // 0x39
	float Density; // 0x3c
	float SleepLinearVelocityThreshold; // 0x40
	float SleepAngularVelocityThreshold; // 0x44
	int32_t SleepCounterThreshold; // 0x48
	float RaiseMassToPower; // 0x4c
	float DestructibleDamageThresholdScale; // 0x50
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x58
	EPhysicalSurface SurfaceType; // 0x60
};

struct UNetworkSettings : UDeveloperSettings {
	char bVerifyPeer : 1; // 0x38
	char bEnableMultiplayerWorldOriginRebasing : 1; // 0x38
	int32_t MaxRepArraySize; // 0x3c
	int32_t MaxRepArrayMemory; // 0x40
	TArray<FNetworkEmulationProfileDescription> NetworkEmulationProfiles; // 0x48
};

struct UTigerSplatmapPaintingSettings : UObject {
	TWeakObjectPtr<UTexture2D> Stamp; // 0x28
	TArray<bool> Channels; // 0x30
	float Opacity; // 0x40
	float StampWorldSize; // 0x44
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UTigerCustomBlendSpace1DListClan : UTigerCustomBlendSpace1DList {
	UBlendSpace1D* BlendSpaces[0x4]; // 0x28
};

struct UTigerAsyncChooseNextWaypoint : UBTTaskNode {
	FBlackboardKeySelector Index; // 0x70
	FBlackboardKeySelector Waypoint; // 0x98
	FBlackboardKeySelector bWaypointDirectionIsForward; // 0xc0
};

struct UTBP_UI_PingIcon_C : UTBP_UI_PingInstance_Inner_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d8
	UWidgetAnimation* OnPingAnim; // 0x2e0
	UImage* BG_Dot_Border; // 0x2e8
	UImage* BG_Dot_Dark; // 0x2f0
	UOverlay* Icon_Overlay; // 0x2f8
	UImage* IconWidget; // 0x300
	UImage* IconWidget_Animated; // 0x308
	FVector2D ImageSizeMultiplier; // 0x310
};

struct UTBP_UI_PingMapTooltip_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ShowTooltip; // 0x268
	UWidgetAnimation* FadeIn; // 0x270
	UCanvasPanel* OnScreen; // 0x278
	UTigerStyledRichTextBlock* OnScreenMeterText; // 0x280
	UTigerStyledRichTextBlock* OnScreenTextBlock; // 0x288
	USizeBox* ScreenTextSizeBox; // 0x290
	UCanvasPanel* TextContainer; // 0x298
	UTBP_UI_InputPromptCombined_C* ToolTip; // 0x2a0
};

