// Created by BlueFire1337
// Updated 2022-01-27
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x6627dc0;
	constexpr auto GObjects = 0x6664120;
	constexpr auto GWorld = 0x67aa5c0;
}

struct APaperCharacter : ACharacter {
	UPaperFlipbookComponent* Sprite; // 0x4b8
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x48
};

struct UCTHomeProgressionWidget : UCTUserWidget {
	URichTextBlock* LevelText; // 0x2f0
	URichTextBlock* LevelProgressionText; // 0x2f8
	URichTextBlock* ToLevelText; // 0x300
	UCTLevelIconWidget* LeveliconWidgetHomeRewards; // 0x308
	UTextBlock* PlayerName; // 0x310
	float LevelPercentage; // 0x318
	UTextBlock* NextRewardsText; // 0x320
	UPanelWidget* NextRewardsPanel; // 0x328
	UCTNavigationWidget* NextRewardsButton; // 0x330
	UCTRewardWidget* RewardWidgetClass; // 0x338
	UScaleBox* ScaleBoxWidgetClass; // 0x340
	FMargin RewardCellMargin; // 0x348
};

struct URendererOverrideSettings : UDeveloperSettings {
	char bSupportAllShaderPermutations : 1; // 0x38
	char bForceRecomputeTangents : 1; // 0x38
};

struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	char bPositionCorrected : 1; // 0x148
};

struct ULandscapeInfo : UObject {
	LazyObjectProperty LandscapeActor; // 0x28
	FGuid LandscapeGuid; // 0x44
	int32_t ComponentSizeQuads; // 0x54
	int32_t SubsectionSizeQuads; // 0x58
	int32_t ComponentNumSubsections; // 0x5c
	FVector DrawScale; // 0x60
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x110
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x1a0
};

struct UWaveScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
	float Wavelength; // 0xc0
	float Period; // 0xc4
	EWaveFunctionType Function; // 0xc8
	EFieldFalloffType Falloff; // 0xc9
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UGeometryCollection : UObject {
	bool EnableClustering; // 0x30
	int32_t ClusterGroupIndex; // 0x34
	int32_t MaxClusterLevel; // 0x38
	TArray<float> DamageThreshold; // 0x40
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x50
	TArray<FGeometryCollectionSource> GeometrySource; // 0x58
	TArray<UMaterialInterface*> Materials; // 0x68
	ECollisionTypeEnum CollisionType; // 0x78
	EImplicitTypeEnum ImplicitType; // 0x79
	int32_t MinLevelSetResolution; // 0x7c
	int32_t MaxLevelSetResolution; // 0x80
	int32_t MinClusterLevelSetResolution; // 0x84
	int32_t MaxClusterLevelSetResolution; // 0x88
	float CollisionObjectReductionPercentage; // 0x8c
	bool bMassAsDensity; // 0x90
	float Mass; // 0x94
	float MinimumMassClamp; // 0x98
	float CollisionParticlesFraction; // 0x9c
	int32_t MaximumCollisionParticles; // 0xa0
	TArray<FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0xa8
	bool EnableRemovePiecesOnFracture; // 0xb8
	TArray<UMaterialInterface*> RemoveOnFractureMaterials; // 0xc0
	FGuid PersistentGuid; // 0xd0
	FGuid StateGuid; // 0xe0
	int32_t BoneSelectedMaterialIndex; // 0xf0
};

struct UInterpTrackSound : UInterpTrackVectorBase {
	TArray<FSoundTrackKey> Sounds; // 0x90
	char bPlayOnReverse : 1; // 0xa0
	char bContinueSoundOnMatineeEnd : 1; // 0xa0
	char bSuppressSubtitles : 1; // 0xa0
	char bTreatAsDialogue : 1; // 0xa0
	char bAttach : 1; // 0xa0
};

struct UParticleModuleSpawnPerUnit : UParticleModuleSpawnBase {
	float UnitScalar; // 0x38
	float MovementTolerance; // 0x3c
	FRawDistributionFloat SpawnPerUnit; // 0x40
	float MaxFrameDistance; // 0x70
	char bIgnoreSpawnRateWhenMoving : 1; // 0x74
	char bIgnoreMovementAlongX : 1; // 0x74
	char bIgnoreMovementAlongY : 1; // 0x74
	char bIgnoreMovementAlongZ : 1; // 0x74
};

struct UCTAddFriendsWidget : UCTSocialTabWidget {
	UCTSocialSearchWidget* SearchWidget; // 0x318
};

struct UCTEndMatchSummaryController : UCTIngameWidgetController {
	float SectionDurationAfterSkip; // 0x98
};

struct UCTShopDetailPageWidget : UCTShopPurchasePageWidget {
	UImage* BackgroundImage; // 0x480
	UImage* HoverImage; // 0x488
	UImage* HoverFullScreenImage; // 0x490
	UImage* HoverObjectRender; // 0x498
	UImage* FullScreenHoverObjectRender; // 0x4a0
	UCanvasPanel* HoverTextItemCanvas; // 0x4a8
	UCTTextItemWidget* TagLineItemWidgetClass; // 0x4b0
	UCTTextItemWidget* TitleItemWidgetClass; // 0x4b8
	URichTextBlock* ItemName; // 0x4c0
	URichTextBlock* ItemRarity; // 0x4c8
	URichTextBlock* ItemType; // 0x4d0
	UCTAutoScrollBox* ItemDescription; // 0x4d8
	UCTNavigationScrollBox* ItemsScrollbox; // 0x4e0
	UPanelWidget* TextItemsCanvas; // 0x4e8
	UPanelWidget* MiscItemsCanvas; // 0x4f0
	UCTRichTextBlock* SinglePlayerTitle; // 0x4f8
	UCTRichTextBlock* SingleTagLine; // 0x500
	UImage* SingleTagLineClass; // 0x508
	UWidget* SingleTagLineClassPanel; // 0x510
	UScaleBox* WallPaperSingleScaleBox; // 0x518
	UScaleBox* PlayerIconSingleScaleBox; // 0x520
	UScaleBox* PlayerTitleSingleScaleBox; // 0x528
	UScaleBox* TagLineSingleScaleBox; // 0x530
	UImage* SingleWallPaper; // 0x538
	UImage* SinglePlayerIcon; // 0x540
};

struct UVOIPTalker : UActorComponent {
	FVoiceSettings Settings; // 0xb0
};

struct UCollectionGamepadDefaultCursorWidgetBP_C : UCTCollectionGamepadCursorWidget {
	UImage* Image; // 0x318
	UImage* ProgressBarBackground; // 0x320
};

struct UModeFilterCell_C : UCTModeFilterCell {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4b0
	UWidgetAnimation* HideDescriptionAnimation; // 0x4b8
	UWidgetAnimation* ShowDescriptionAnimation; // 0x4c0
	UCTButton* BindButton; // 0x4c8
	USpacer* ComfortSpacer; // 0x4d0
	UImage* HoverImage; // 0x4d8
	UImage* ModeBG; // 0x4e0
};

struct UCT2DMarkerComponent : USceneComponent {
	float BaseScale; // 0x248
	UCurveFloat* ScaleCurveFromDistance; // 0x250
	UCT3DMarkerWidget* WidgetClass; // 0x258
	float CirclesRadii; // 0x260
	FVector2D CirclesOffsetFromCenter; // 0x264
	UCurveFloat* ZOffsetFromDistance; // 0x270
	int32_t ZOrder; // 0x278
	UCurveFloat* OpacityCurveFromDistance; // 0x280
	bool DisplayWhenOffscreen; // 0x288
	bool IsPinMarker; // 0x289
	float LifeTime; // 0x28c
	float LifeTimeFadeOutTriggerTime; // 0x290
	UCT3DMarkerWidget* WidgetInstance; // 0x2a0
	float SpawnTimestamp; // 0x2a8
	bool bDisplayWhenOnscreen; // 0x2ad
	bool bClampOffscreenLocation; // 0x2ae
};

struct UTimeSynchronizationSource : UObject {
	bool bUseForSynchronization; // 0x28
	int32_t FrameOffset; // 0x2c
};

struct UCTRavagerRushFeedbackComponent : USceneComponent {
	UNiagaraSystem* RushingParticles; // 0x1f8
	UNiagaraSystem* ImpactParticles_Self; // 0x200
	UParticleSystem* ImpactParticles_World; // 0x208
	float HitParticlesOffset; // 0x210
	UMaterialInterface* HitPostProcess; // 0x218
	UCurveFloat* HitPostProcStrengthOverTime; // 0x220
	USoundBase* RushLoop; // 0x228
	USoundBase* ImpactSound; // 0x230
	USoundBase* TriggerSound_Self; // 0x238
	USoundBase* TriggerSound_Others; // 0x240
	UAudioComponent* RushAC; // 0x248
	UNiagaraComponent* RushPSC; // 0x250
	UAudioComponent* RushCastAC; // 0x258
	UMaterialInstanceDynamic* HitCameraPPMaterial; // 0x260
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x68
};

struct UNavLinkCustomComponent : UNavRelevantComponent {
	uint32_t NavLinkUserId; // 0xe8
	UNavArea* EnabledAreaClass; // 0xf0
	UNavArea* DisabledAreaClass; // 0xf8
	FNavAgentSelector SupportedAgents; // 0x100
	FVector LinkRelativeStart; // 0x104
	FVector LinkRelativeEnd; // 0x110
	ENavLinkDirection LinkDirection; // 0x11c
	char bLinkEnabled : 1; // 0x120
	char bNotifyWhenEnabled : 1; // 0x120
	char bNotifyWhenDisabled : 1; // 0x120
	char bCreateBoxObstacle : 1; // 0x120
	FVector ObstacleOffset; // 0x124
	FVector ObstacleExtent; // 0x130
	UNavArea* ObstacleAreaClass; // 0x140
	float BroadcastRadius; // 0x148
	float BroadcastInterval; // 0x14c
	ECollisionChannel BroadcastChannel; // 0x150
};

struct UCarouselStrikethroughPriceWidge_C : UCTStrikethroughPriceShopWidget {
	UImage* Image_254; // 0x418
};

struct UGameSessionSettings : UObject {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x90
};

struct UCTPackageTypeReward : UCTLootReward {
	ECTPackageType PackageType; // 0x68
};

struct UCTTutorial2DMarkerComponent : UCT2DMarkerComponent {
	ECTSnapObjectType SnapObjectType; // 0x2b8
	float DetectionWidgetOffsetFactor; // 0x2bc
	FVector2D WidgetPositionOffset; // 0x2c0
};

struct UDatasmithCineCameraActorTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x30
};

struct UCameraShakeBase : UObject {
	bool bSingleInstance; // 0x28
	float ShakeScale; // 0x2c
	UCameraShakePattern* RootShakePattern; // 0x30
	APlayerCameraManager* CameraManager; // 0x38
};

struct ABP_H03_DisplaySet_C : ABP_DefaultRiderCustoDisplaySet_C {
	USpotLightComponent* Li_H03_AddLight_Face; // 0x4e8
	USpotLightComponent* Li_H03_AddLight_Shield; // 0x4f0
};

struct USoundNodeConcatenator : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct UOwned_Interactible_CollectionDragonCellWidgetBP_C : UCTDefaultDragonCellWidget {
	UImage* Background; // 0x518
	UImage* Background_2; // 0x520
	UCTButton* CellButton; // 0x528
	UImage* DiscoveredImage; // 0x530
	UImage* Frame; // 0x538
	UImage* OwnedImage; // 0x540
};

struct UTextRenderComponent : UPrimitiveComponent {
	FText Text; // 0x450
	UMaterialInterface* TextMaterial; // 0x468
	UFont* Font; // 0x470
	EHorizTextAligment HorizontalAlignment; // 0x478
	EVerticalTextAligment VerticalAlignment; // 0x479
	FColor TextRenderColor; // 0x47c
	float XScale; // 0x480
	float YScale; // 0x484
	float WorldSize; // 0x488
	float InvDefaultSize; // 0x48c
	float HorizSpacingAdjust; // 0x490
	float VertSpacingAdjust; // 0x494
	char bAlwaysRenderAsText : 1; // 0x498
};

struct UDebugCameraControllerSettings : UDeveloperSettings {
	TArray<FDebugCameraControllerSettingsViewModeIndex> CycleViewModes; // 0x38
};

struct UCTGameInstance : UGameInstance {
	UCTTechnicalEvents* TechnicalEvents; // 0x1d0
	UCTCheatDetector* CheatDetector; // 0x1e8
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FVector ResetVector; // 0x58
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UDistributionFloatParameterBase : UDistributionFloatConstant {
	FName ParameterName; // 0x40
	float MinInput; // 0x48
	float MaxInput; // 0x4c
	float MinOutput; // 0x50
	float MaxOutput; // 0x54
	DistributionParamMode ParamMode; // 0x58
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UNiagaraDataInterfaceArray : UNiagaraDataInterface {
	int32_t MaxElements; // 0x40
};

struct UCTSortTypeWidget : UCTUserWidget {
	UTextBlock* TypeName; // 0x2f0
};

struct UPaperSprite : UObject {
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FVector2D BakedSourceUV; // 0x48
	FVector2D BakedSourceDimension; // 0x50
	UTexture2D* BakedSourceTexture; // 0x58
	UMaterialInterface* DefaultMaterial; // 0x60
	UMaterialInterface* AlternateMaterial; // 0x68
	TArray<FPaperSpriteSocket> Sockets; // 0x70
	ESpriteCollisionMode SpriteCollisionDomain; // 0x80
	float PixelsPerUnrealUnit; // 0x84
	UBodySetup* BodySetup; // 0x88
	int32_t AlternateMaterialSplitIndex; // 0x90
	TArray<FVector4> BakedRenderData; // 0x98
};

struct UCTSingleMeshPropDataAsset : UCTPropDataAsset {
	EPropType PropType; // 0x30
	bool bIsSlotB; // 0x31
	AACTFancyProp* FancyWeapon; // 0x38
	TSoftObjectPtr<UStaticMesh> Mesh; // 0x40
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0xa0
	char bFireEventsWhenBackwards : 1; // 0xa0
	EFireEventsAtPosition EventPosition; // 0xa4
	TArray<UMovieSceneSection*> Sections; // 0xa8
};

struct UForceFeedbackAttenuation : UObject {
	FForceFeedbackAttenuationSettings Attenuation; // 0x28
};

struct ULinkAccountPopupWidget_C : UCTLinkAccountPopupWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d0
	UImage* ButtonsSeparator; // 0x3d8
	UImage* ButtonsSeparator_2; // 0x3e0
	UDefaultRichTextBlock_C* DefaultRichTextBlock; // 0x3e8
	UDefaultRichTextBlock_C* DefaultRichTextBlock_2; // 0x3f0
	UDefaultRichTextBlock_C* DefaultRichTextBlock_191; // 0x3f8
	UImage* Image; // 0x400
	UImage* TitleSeparator; // 0x408
};

struct AGameNetworkManager : AInfo {
	float BadPacketLossThreshold; // 0x220
	float SeverePacketLossThreshold; // 0x224
	int32_t BadPingThreshold; // 0x228
	int32_t SeverePingThreshold; // 0x22c
	int32_t AdjustedNetSpeed; // 0x230
	float LastNetSpeedUpdateTime; // 0x234
	int32_t TotalNetBandwidth; // 0x238
	int32_t MinDynamicBandwidth; // 0x23c
	int32_t MaxDynamicBandwidth; // 0x240
	char bIsStandbyCheckingEnabled : 1; // 0x244
	char bHasStandbyCheatTriggered : 1; // 0x244
	float StandbyRxCheatTime; // 0x248
	float StandbyTxCheatTime; // 0x24c
	float PercentMissingForRxStandby; // 0x250
	float PercentMissingForTxStandby; // 0x254
	float PercentForBadPing; // 0x258
	float JoinInProgressStandbyWaitTime; // 0x25c
	float MoveRepSize; // 0x260
	float MAXPOSITIONERRORSQUARED; // 0x264
	float MAXNEARZEROVELOCITYSQUARED; // 0x268
	float CLIENTADJUSTUPDATECOST; // 0x26c
	float MAXCLIENTUPDATEINTERVAL; // 0x270
	float MaxClientForcedUpdateDuration; // 0x274
	float ServerForcedUpdateHitchThreshold; // 0x278
	float ServerForcedUpdateHitchCooldown; // 0x27c
	float MaxMoveDeltaTime; // 0x280
	float MaxClientSmoothingDeltaTime; // 0x284
	float ClientNetSendMoveDeltaTime; // 0x288
	float ClientNetSendMoveDeltaTimeThrottled; // 0x28c
	float ClientNetSendMoveDeltaTimeStationary; // 0x290
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x294
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x298
	bool ClientAuthorativePosition; // 0x29c
	float ClientErrorUpdateRateLimit; // 0x2a0
	float ClientNetCamUpdateDeltaTime; // 0x2a4
	float ClientNetCamUpdatePositionLimit; // 0x2a8
	bool bMovementTimeDiscrepancyDetection; // 0x2ac
	bool bMovementTimeDiscrepancyResolution; // 0x2ad
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x2b0
	float MovementTimeDiscrepancyMinTimeMargin; // 0x2b4
	float MovementTimeDiscrepancyResolutionRate; // 0x2b8
	float MovementTimeDiscrepancyDriftAllowance; // 0x2bc
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2c0
	bool bUseDistanceBasedRelevancy; // 0x2c1
};

struct UCTOptionsMotionBlurCtrl : UCTOptionsParameterSliderCtrl {
	float AdjustmentMultiplier; // 0x118
};

struct UCTAchievementInProgress : UObject {
	int32_t AchievementID; // 0x28
	FName AchievementName; // 0x2c
};

struct UCTTargetLockWidget : UCTAnimatedWidget {
	UWidgetAnimation* MultiLockAnimation; // 0x2f8
};

struct UCTTooltipEntryWidget : UUserWidget {
	UCTControllerIconWidget* ControllerIcon; // 0x268
	URichTextBlock* ValidateText; // 0x270
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	bool bDisplayHelpInAutoComplete; // 0x55
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UPlayFabExperimentationAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x158
	UPlayFabJsonObject* RequestJsonObj; // 0x160
	UPlayFabJsonObject* ResponseJsonObj; // 0x168
};

struct UCTWidgetController : UObject {
	UCTUserWidget* Widget; // 0x28
	FString FromPath; // 0x30
	bool bIsPartOfSmartDisplay; // 0x89
	ESlateVisibility ShowVisibilityValue; // 0x8a
	ESlateVisibility HideVisibilityValue; // 0x8b
};

struct UCTEndMatchSummaryLevelProgress : UCTEndMatchProgressWidgetBase {
	UWidgetAnimation* StepAnimation; // 0x320
	UWidgetAnimation* LevelupFxAnimation; // 0x328
	UWidgetAnimation* AppearingAnimationWithoutEgg; // 0x330
	UWidgetAnimation* AppearingAnimationWithEgg; // 0x338
	UWidgetAnimation* ReachEndCursorFxAnim; // 0x340
	UTextBlock* LevelNumber; // 0x348
	UTextBlock* ToLevelText; // 0x350
	UTextBlock* ToLevel; // 0x358
	UCTLevelIconWidget* LeveliconWidget; // 0x360
	UTextBlock* NextRewardsText; // 0x368
	UPanelWidget* NextRewardsPanel; // 0x370
	UPanelWidget* LevelUpRewards; // 0x378
	UTextBlock* NextLevelRewardsText; // 0x380
	UCTEndMatchNextRewardsWidget* NextRewardsWidget; // 0x388
};

struct UWindowTitleBarArea : UContentWidget {
	bool bWindowButtonsEnabled; // 0x120
	bool bDoubleClickTogglesFullscreen; // 0x121
};

struct UCTLockedQuestWidget : UCTUserWidget {
	UCTRichTextBlock* LockDelay; // 0x2f0
};

struct UCTSocialRequestsSubsystem : UCTMainMenuSubsystem {
	UCTFriendRequestsModule* FriendRequestsModule; // 0x30
	UCTGroupRequestsModule* GroupRequestsModule; // 0x38
};

struct UCTSoundClassData : UDataAsset {
	TArray<FCTSoundClass> SoundClasses; // 0x30
};

struct UCTUIBlockerWidget : UCTUserWidget {
	UImage* BlockingBackground; // 0x2f0
	bool bEnabledOnStartup; // 0x2f8
};

struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	FName ParameterName; // 0x60
	FGuid ExpressionGUID; // 0x68
	FName Group; // 0x78
};

struct UProfileWidget_C : UCTProfileWidget {
	UCanvasPanel* EditionPanel; // 0x440
	UGetDiscordCodeButtonWidget_C* GetDiscordCodeButtonWidget; // 0x448
	UImage* Image_73; // 0x450
	UImage* Image_177; // 0x458
	UImage* Image_247; // 0x460
	USendAGiftCodeButtonWidget_C* SendACodeButtonWidget; // 0x468
};

struct UCTBlindFeedbackComponent : UActorComponent {
	UMaterialInterface* MalusCameraPostProcess; // 0xb0
	UMaterialInterface* BonusCameraPostProcess; // 0xb8
	USoundMix* SmokedSoundMix; // 0xc0
	UMaterialInstanceDynamic* CameraPPMaterial; // 0xc8
	UCameraComponent* TargetCameraComp; // 0xd0
};

struct UNiagaraPrecompileContainer : UObject {
	TArray<UNiagaraScript*> Scripts; // 0x28
	UNiagaraSystem* System; // 0x38
};

struct UCTCustomizationItemWidget : UCTCustomizationSubWidget {
	UCTNavigationScrollBox* ItemScrollBox; // 0x328
	URichTextBlock* ItemDetailName; // 0x330
	URichTextBlock* ItemDetailDescription; // 0x338
	UCanvasPanel* ItemDetailCanvas; // 0x340
	URichTextBlock* ItemDetailRarity; // 0x348
	UScaleBox* EliteScaleBox; // 0x350
	UScaleBox* EliteLockScaleBox; // 0x358
	URichTextBlock* PartText; // 0x360
	int32_t CurrentRow; // 0x368
	bool NeedUpdateScrollingStatus; // 0x36c
};

struct UCTNemesisHUDFrame : UCTUserWidget {
	UCanvasPanel* NemesisCanvas; // 0x2f0
	UCanvasPanel* BestVictimCanvas; // 0x2f8
	UImage* NemesisRightBevel; // 0x300
	UImage* NemesisLeftBevel; // 0x308
	UImage* NemesisFrame; // 0x310
};

struct ALevelStreamingVolume : AVolume {
	TArray<FName> StreamingLevelNames; // 0x258
	char bEditorPreVisOnly : 1; // 0x268
	char bDisabled : 1; // 0x268
	EStreamingVolumeUsage StreamingUsage; // 0x26c
};

struct AARSkyLight : ASkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x230
};

struct UHoudiniParameterMultiParm : UHoudiniParameter {
	bool bIsShown; // 0x108
	int32_t Value; // 0x10c
	FString TemplateName; // 0x110
	int32_t MultiparmValue; // 0x120
	uint32_t MultiParmInstanceNum; // 0x124
	uint32_t MultiParmInstanceLength; // 0x128
	uint32_t MultiParmInstanceCount; // 0x12c
	uint32_t InstanceStartOffset; // 0x130
	TArray<EHoudiniMultiParmModificationType> MultiParmInstanceLastModifyArray; // 0x138
	int32_t DefaultInstanceCount; // 0x148
};

struct UCTSocialWidget : UCTNavigationPageMainMenu {
	UCTNavigationWidget* BackButton; // 0x328
};

struct USoundNodeWavePlayer : USoundNodeAssetReferencer {
	TSoftObjectPtr<USoundWave> SoundWaveAssetPtr; // 0x48
	USoundWave* SoundWave; // 0x70
	char bLooping : 1; // 0x80
};

struct UCTFilterCellWidget : UCTNavigationWidget {
	UTextBlock* Caption; // 0x458
	UCTButton* ButtonRoot; // 0x460
	FSlateColor ColorTextDefault; // 0x468
	FSlateColor ColorTextSelected; // 0x490
};

struct UNiagaraDataInterfaceAudioPlayer : UNiagaraDataInterface {
	USoundBase* SoundToPlay; // 0x38
	USoundAttenuation* Attenuation; // 0x40
	USoundConcurrency* Concurrency; // 0x48
	TArray<FName> ParameterNames; // 0x50
	bool bLimitPlaysPerTick; // 0x60
	int32_t MaxPlaysPerTick; // 0x64
	bool bStopWhenComponentIsDestroyed; // 0x68
};

struct ACTTreasureGameState : ACTGameState {
	int32_t scoreDifferenceForWinningState; // 0x680
	int32_t minimumTimeForClosedMatchStateInSeconds; // 0x684
	int32_t RoundCount; // 0x688
	float GameResultDuration; // 0x68c
	float GameDuration; // 0x690
	FTeamScoreBoard ScoreBoard; // 0x698
	int32_t LastLeaderTeam; // 0x6a8
	bool bIsMatchOver; // 0x6ac
	int32_t iCurrentRound; // 0x6b0
	bool bDidReceiveRoundStart; // 0x6b4
	TArray<float> RoundTeamScores; // 0x6b8
	float EndGameJewelValue; // 0x6c8
	int32_t EndGameJewelHolder; // 0x6cc
	ACTPoolManager* TreasurePoolManager; // 0x6d0
	TArray<ACTTreasureBank*> Banks; // 0x6d8
	TArray<ACTAntiBankingPickup*> AntiBankingPickups; // 0x6e8
	TArray<ACTJewel*> JewelPickups; // 0x6f8
	TArray<ACTUnstableCharge*> UnstableChargePickups; // 0x708
	TArray<AActor*> AntibankingRespawnVolumes; // 0x718
	ACTTreasure* TreasureType; // 0x728
	UCurveFloat* TreasureHolderTargetThresh; // 0x730
};

struct ACTBaseNPCActor : AActor {
	UCTDamageDealerComponent* DamageComp; // 0x228
	UCTHealthComponent* HealthComp; // 0x230
	UCTFilterConfigComponent* FilterConfigComp; // 0x238
	int32_t TeamId; // 0x240
};

struct UCTButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
	UCTNavigationWidget* OwnerWidget; // 0x428
};

struct UCTCollectionHousesDataAsset : UDataAsset {
	TMap<ECharacClassType, FCTHousesData> AvailableHousesData; // 0x30
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct UInteractiveTool : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x48
	TArray<UObject*> ToolPropertyObjects; // 0x50
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x220
	FName MatineeControllerName; // 0x228
	float PlayRate; // 0x230
	char bPlayOnLevelLoad : 1; // 0x234
	char bForceStartPos : 1; // 0x234
	float ForceStartPosition; // 0x238
	char bLooping : 1; // 0x23c
	char bRewindOnPlay : 1; // 0x23c
	char bNoResetOnRewind : 1; // 0x23c
	char bRewindIfAlreadyPlaying : 1; // 0x23c
	char bDisableRadioFilter : 1; // 0x23c
	char bClientSideOnly : 1; // 0x23c
	char bSkipUpdateIfNotVisible : 1; // 0x23c
	char bIsSkippable : 1; // 0x23c
	int32_t PreferredSplitScreenNum; // 0x240
	char bDisableMovementInput : 1; // 0x244
	char bDisableLookAtInput : 1; // 0x244
	char bHidePlayer : 1; // 0x244
	char bHideHud : 1; // 0x244
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x248
	char bShouldShowGore : 1; // 0x258
	TArray<UInterpGroupInst*> GroupInst; // 0x260
	TArray<FCameraCutInfo> CameraCuts; // 0x270
	char bIsPlaying : 1; // 0x280
	char bReversePlayback : 1; // 0x280
	char bPaused : 1; // 0x280
	char bPendingStop : 1; // 0x280
	float InterpPosition; // 0x284
	char ReplicationForceIsPlaying; // 0x28c
	FMulticastInlineDelegate OnPlay; // 0x290
	FMulticastInlineDelegate OnStop; // 0x2a0
	FMulticastInlineDelegate OnPause; // 0x2b0
};

struct UGizmoBoxComponent : UGizmoBaseComponent {
	FVector Origin; // 0x470
	FQuat Rotation; // 0x480
	FVector Dimensions; // 0x490
	float LineThickness; // 0x49c
	bool bRemoveHiddenLines; // 0x4a0
	bool bEnableAxisFlip; // 0x4a1
};

struct ABP_InfiniteBoostPowerUp_C : ACTInfiniteBoostPowerUp {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a8
	UPointLightComponent* Li_PowerUpBoost_State_Full; // 0x2b0
	UStaticMeshComponent* Power_Up_Boost; // 0x2b8
	UCTFakeVolumetricLightComponent* FakeVolumetric_PowerUpBoost; // 0x2c0
	UStaticMeshComponent* PlaceholderBillboard; // 0x2c8
	int32_t Sort Transculency Priority; // 0x2d0
	UMaterialInstanceDynamic* Mid; // 0x2d8
	FLinearColor Color; // 0x2e0
	bool bIsDedicatedServer; // 0x2f0
	float Light Radius; // 0x2f4
};

struct UABP_H02_Head01_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x4d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd20
	FVector WorldWind; // 0xd40
	bool HairPhysics; // 0xd4c
};

struct UABP_DB_CommonIdle_C : UCTBabyDragonAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	FAnimNode_Root AnimGraphNode_Root; // 0x308
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x338
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x360
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x388
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x400
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x428
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x450
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x478
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x4c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x4f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x518
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x598
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_5; // 0x618
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x6b8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x738
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x768
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x7e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x868
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_4; // 0x8e8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x988
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x9b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xa38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xab8
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0xb38
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xbd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xc08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xc88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xd08
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0xd88
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xe28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xe58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xe80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xea8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xed0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xf50
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xfd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1070
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x10f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1120
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x11a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x11d0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x11f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x12a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x12f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1390
	bool Scenario2; // 0x1410
	bool Scenario3; // 0x1411
	bool PlayBreaker; // 0x1412
	float RandBreakerTime; // 0x1414
	FFloatRange RandBreakerRange; // 0x1418
	UAnimSequenceBase* Anim_Adult; // 0x1428
	UAnimSequenceBase* Anim_Hatching; // 0x1430
	UAnimSequenceBase* Anim_Idle1; // 0x1438
	UAnimSequenceBase* Anim_Idle2; // 0x1440
	UAnimSequenceBase* Anim_Idle3; // 0x1448
	UAnimSequenceBase* Anim_Idle1_Break1; // 0x1450
	UAnimSequenceBase* Anim_Idle2_Break1; // 0x1458
	UAnimSequenceBase* Anim_Idle3_Break1; // 0x1460
	UAnimSequenceBase* Anim_s1_Anim1; // 0x1468
	UAnimSequenceBase* Anim_s1_Anim2; // 0x1470
	UAnimSequenceBase* Anim_s1_Anim3; // 0x1478
	UAnimSequenceBase* Anim_s2_Anim1; // 0x1480
	UAnimSequenceBase* Anim_s2_Anim2; // 0x1488
	UAnimSequenceBase* Anim_s2_Anim3; // 0x1490
	UAnimSequenceBase* Anim_s3_Anim1; // 0x1498
	UAnimSequenceBase* Anim_s3_Anim2; // 0x14a0
	UAnimSequenceBase* Anim_s3_Anim3; // 0x14a8
	bool LastIdle; // 0x14b0
};

struct UInfoPopup_OptionsResetToDefaults_C : UCTInfoPopupWidget {
	UImage* Image; // 0x380
};

struct UConsole : UObject {
	ULocalPlayer* ConsoleTargetPlayer; // 0x38
	UTexture2D* DefaultTexture_Black; // 0x40
	UTexture2D* DefaultTexture_White; // 0x48
	TArray<FString> HistoryBuffer; // 0x68
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UHoudiniInputActor : UHoudiniInputObject {
	TArray<UHoudiniInputSceneComponent*> ActorComponents; // 0xa8
	TSet<TSoftObjectPtr<UObject>> ActorSceneComponents; // 0xb8
	int32_t LastUpdateNumComponentsAdded; // 0x108
	int32_t LastUpdateNumComponentsRemoved; // 0x10c
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UCollectionMapPoint_Discovered_Selected_Pressed_C : UCTCollectionMapPointStateWidget {
	UImage* Image_97; // 0x2f0
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UCTMapsDataBase : UDataAsset {
	TArray<FMapsDatas> Maps; // 0x30
	TArray<FGameModeDatas> GameModes; // 0x40
};

struct UABP_D01_Leash01_C : UCTLeashAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	FAnimNode_Root AnimGraphNode_Root; // 0x2f8
	char CurrentLeashMode; // 0x328
	bool bPawn; // 0x329
	UAnimSequenceBase* LeashPose; // 0x330
	bool bBlend; // 0x338
};

struct UShopExclusiveDailyPackageWidget_C : UCTExclusiveShopPackageWidget {
	UWidgetAnimation* CannotBuyAnimation; // 0x690
	UWidgetAnimation* BuyAnimation; // 0x698
	UImage* ButtonFrameImage_2; // 0x6a0
	UImage* ItemImage; // 0x6a8
};

struct UInfoPopup_IDLE_C : UCTDisconnectPopupWidget {
	UImage* Image; // 0x3d0
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x28
	bool bEnableTerrainSplineEditing; // 0x29
	bool bResizeSpriteDataToMatchTextures; // 0x2a
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0xe0
	FVector FailsafeExtent; // 0xe8
	char bIncludeAgentHeight : 1; // 0xf4
};

struct UMaterialExpressionLandscapeLayerWeight : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Layer; // 0x54
	FName ParameterName; // 0x68
	float PreviewWeight; // 0x70
	FVector ConstBase; // 0x74
	FGuid ExpressionGUID; // 0x80
};

struct UABP_D02_Leash01_C : UCTLeashAnimInstance {
	FAnimNode_Root AnimGraphNode_Root; // 0x2f0
	char CurrentLeashAnimMode; // 0x320
	bool bPawn; // 0x321
	bool bBlend; // 0x322
	UAnimSequenceBase* LeashPose; // 0x328
};

struct UABP_D03_Harness03_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UMaterialExpressionAntialiasedTextureMask : UMaterialExpressionTextureSampleParameter2D {
	float Threshold; // 0x80
	ETextureColorChannel Channel; // 0x84
};

struct UBTNode : UObject {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UPopcornFXAttributeSamplerSkinnedMesh : UPopcornFXAttributeSampler {
	AActor* TargetActor; // 0x200
	FName SkinnedMeshComponentName; // 0x208
	EPopcornFXMeshSamplingMode MeshSamplingMode; // 0x210
	EPopcornFXColorChannel DensityColorChannel; // 0x211
	char bPauseSkinning : 1; // 0x214
	char bSkinPositions : 1; // 0x214
	char bSkinNormals : 1; // 0x214
	char bSkinTangents : 1; // 0x214
	char bBuildColors : 1; // 0x214
	char bBuildUVs : 1; // 0x214
	char bComputeVelocities : 1; // 0x214
	char bBuildClothData : 1; // 0x214
	EPopcornFXSkinnedTransforms Transforms; // 0x218
	char bApplyScale : 1; // 0x21c
	char bUseRelativeTransform : 1; // 0x21c
	char bUseSkinnedMeshTransforms : 1; // 0x21c
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x90
};

struct UInterpTrackInstVisibility : UInterpTrackInst {
	EVisibilityTrackAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UAkWwiseTreeSelector : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct ACTBeastPawn : APawn {
	UCTWeapon* WeaponNone; // 0x308
	UCTWeaponFireball* WeaponFireball; // 0x310
	UCTWeaponFireballAuto* WeaponFireballAuto; // 0x318
	UCTWeaponBattleBerserkFireball* WeaponBattleBerserkFireball; // 0x320
	UCTWeaponRocket* WeaponRocket; // 0x328
	UCTWeaponLure* WeaponLure; // 0x330
	UCTWeaponInvisibility* WeaponInvisibility; // 0x338
	UCTWeaponDeathMist* WeaponDeathMist; // 0x340
	UCTWeaponBurstFire* WeaponBurstFire; // 0x348
	UCTWeaponFlamethrower* WeaponFlamethrower; // 0x350
	UCTWeaponMine* WeaponMine; // 0x358
	UCTWeaponBlast* WeaponBlast; // 0x360
	UCTWeaponMegaSpear* WeaponMegaSpear; // 0x368
	UCTWeaponSmokeBomb* WeaponSmokeBomb; // 0x370
	UCTWeaponStickyMine* WeaponStickyMine; // 0x378
	UCTWeaponMediKit* WeaponMediKit; // 0x380
	UCTWeaponShockwave* WeaponShockwave; // 0x388
	bool bWasTrailingWater; // 0x390
	FVector RightHandPosition; // 0x394
	FVector LeftHandPosition; // 0x3a0
	bool bForceCameraFocus; // 0x3ac
	UCTMoveComponent* MoveBPClass; // 0x3b0
	FTrailFXSettings TrackingTrailSettings; // 0x3b8
	float FreezeDeathTimer; // 0x3e8
	float PreviousShieldHP; // 0x3ec
	bool GainShieldIsPlaying; // 0x3f0
	UCurveFloat* ShieldActivationCurve; // 0x3f8
	UCurveFloat* LightShieldIntensityCurve; // 0x400
	UCurveFloat* ShieldDamageCurve; // 0x408
	UCurveFloat* LightShieldDamageIntensityCurve; // 0x410
	UPointLightComponent* LightShield; // 0x418
	UPointLightComponent* LightShieldFront; // 0x420
	UPointLightComponent* LightBackFlameThrowerNoShadow; // 0x428
	UPointLightComponent* LightBackFlameThrower; // 0x430
	UPointLightComponent* LightInvisibility; // 0x438
	UPointLightComponent* LiMouthLight; // 0x440
	UCTStrikerPredator* StrikerPredatorComp; // 0x450
	ACTBlockingVolume* CurrentBlockingVolume; // 0x458
	int32_t ShadowMaxDistance; // 0x470
	int32_t RiderVisibilityDistance; // 0x474
	int32_t OptimizeAnimUpdateRateDistance; // 0x478
	bool bForceTickGroupForParallelAnim; // 0x47c
	ETickingGroup ForcedTickGroup; // 0x47d
	float RenderTimeToleranceAnimOptim; // 0x480
	ACTDragonRider* DragonRiderClass; // 0x490
	ACTDragonRider* DragonRider; // 0x498
	float AutoRespawnTime; // 0x4a4
	UStaticMeshComponent* CollisionMesh; // 0x4b8
	UCTBeastComponent* BeastMesh; // 0x4c0
	UCTBeastComponent* BodyMesh; // 0x4c8
	USkeletalMeshComponent* UpperBodyMesh; // 0x4d0
	USkeletalMeshComponent* TorsoMesh; // 0x4d8
	USkeletalMeshComponent* TailMesh; // 0x4e0
	USkeletalMeshComponent* HarnessMesh; // 0x4e8
	USkeletalMeshComponent* HelmetMesh; // 0x4f0
	UStaticMeshComponent* ShieldMesh; // 0x4f8
	USkeletalMeshComponent* FXDragonMesh; // 0x500
	UCTLeashMeshComponent* LeashMeshComponent; // 0x508
	UCTLanternComponent* LanternComponent; // 0x510
	UCTBeastPositionComponent* BeastPositionComp; // 0x528
	UCTAbilityManagerComponent* AbilityManagerComp; // 0x530
	UCTMoveComponent* MoveComp; // 0x538
	UCTBeastFX* BeastFXComponent; // 0x540
	UChildActorComponent* MovingDebugScaleComp; // 0x548
	UCTAIVisionComponent* VisionComp; // 0x550
	UCTPawnInputArbiter* PawnInputArbiter; // 0x558
	ACTMountVehicleCamera* MountVehicleCameraClass; // 0x560
	ACTFlyCamera* FlyCameraClass; // 0x568
	ACTFlyCamera* FlyCameraDebugClass; // 0x570
	ACTFreeLookCamera* FreeLookCameraClass; // 0x578
	ACTFreeRoamPawn* FreeRoamPawnClass; // 0x580
	ACTDeathCamera* DeathCameraClass; // 0x588
	ACTCameraManager* CameraManagerClass; // 0x590
	ACTFlyCamera* FlyCamera; // 0x598
	ACTMountVehicleCamera* MountVehicleCamera; // 0x5a0
	ACTFlyCamera* FlyCameraDebug; // 0x5a8
	ACTDeathCamera* DeathCamera; // 0x5b0
	ACTCameraManager* CameraManager; // 0x5b8
	UCTHUDWidget* HUDWidgetClass; // 0x5c0
	UCTHUDWidget* HUDWidget; // 0x5c8
	UCTTargetLockComponent* TargetLockComp; // 0x5d0
	UCTPlayerAudioManagerComponent* PlayerAudioManagerComp; // 0x5d8
	USoundBase* AllyChieftainDashSound; // 0x5e8
	float MinTimeBetweenHandledHit; // 0x5f0
	float RootMotionScale; // 0x5f4
	float DeathTime; // 0x5f8
	float DeathCameraBlendTime; // 0x5fc
	UAudioComponent* BoostAC; // 0x600
	UAudioComponent* WindAC; // 0x608
	UAudioComponent* BerserkAC; // 0x610
	UAudioComponent* MegaSpearAC; // 0x618
	UAudioComponent* BerserkBeginAC; // 0x628
	UAudioComponent* StaminaRefillAC; // 0x630
	AVolume* OutOfBoundVolume; // 0x640
	UCTWeaponShield* ShieldComp2; // 0x650
	UPhysicsAsset* BeastRagdoll; // 0x658
	UPhysicsAsset* RiderRagdoll; // 0x660
	bool bIsRagdoll; // 0x668
	bool bRagdollActivated; // 0x669
	FTimerHandle FreezeDeathTimerHandle; // 0x670
	bool bIsLocal; // 0x678
	bool bIsShieldActive; // 0x679
	FLinearColor ShieldActivationColor; // 0x67c
	FLinearColor ExtraFieryShieldColor; // 0x68c
	FLinearColor ExtraWindguardShieldColor; // 0x69c
	float FinalShieldActivationTime; // 0x6ac
	float FinalShieldActivationTimer; // 0x6b0
	float FinalShieldIntensityTimer; // 0x6b4
	float FinalShieldDamageTimer; // 0x6b8
	float FinalShieldFXValue; // 0x6bc
	float BerserkIntensityTimer; // 0x6c0
	float ShieldActivationTimer; // 0x6c4
	float ShieldDamageTimer; // 0x6c8
	float ShieldIntensityTimer; // 0x6cc
	FVector Position; // 0x6d0
	TArray<UCTWeapon*> WeaponList; // 0x6e0
	UCTHealthComponent* HealthComp; // 0x6f0
	UCTDamageDealerComponent* DamageComp; // 0x6f8
	UCTEnergyComponent* EnergyComp; // 0x700
	UCTOpponentUIComponent* OpponentUIComp; // 0x708
	UCTCustomizationComponent* CustomizationComp; // 0x710
	UCTBlastDamageFeedbackComponent* BlastFeedbackComp; // 0x718
	UCTBlindFeedbackComponent* BlindFeedbackComp; // 0x720
	UCTLowHealthFeedbackComponent* LowHealthFeedbackComp; // 0x728
	UCTOutOfBoundsFeedbackComponent* OutOfBoundsFeedbackComp; // 0x730
	float fTimeToDieOutOfBounds; // 0x738
	UCTFrozenComponent* FrozenComp; // 0x740
	bool DebugBurn; // 0x748
	bool DebugBerserk; // 0x749
	bool DebugOptimize; // 0x74a
	bool bBackCameraPressed; // 0x74b
	int32_t MeshTeamId; // 0x74c
	UCTDragonAnimInstance* BeastAnimInstance; // 0x750
	UCTRiderAnimInstance* DragonRiderAnimInstance; // 0x758
	float BoostConsumption; // 0x760
	float SuperBoostDuration; // 0x764
	float SuperBoostConsumption; // 0x768
	bool bMegaWeaponActivated; // 0x774
	AActor* KillingSpearActor; // 0x778
	FMulticastInlineDelegate PlayerDiedEvent; // 0x780
	FMulticastInlineDelegate PlayerDamagedEvent; // 0x790
	FMulticastInlineDelegate OnBoostStartDelegate; // 0x7a0
	FMulticastInlineDelegate OnSuperBoostStartDelegate; // 0x7b0
	FMulticastInlineDelegate OnSuccessfulSuperBoostDelegate; // 0x7c0
	FMulticastInlineDelegate OnBoostStopDelegate; // 0x7d0
	FMulticastInlineDelegate OnSuperBoostStopDelegate; // 0x7e0
	FMulticastInlineDelegate OnSuicideDelegate; // 0x7f0
	FMulticastInlineDelegate OnWeatherVolumeOverlapDelegate; // 0x800
	FMulticastInlineDelegate OnFireballDodgeDelegate; // 0x810
	FMulticastInlineDelegate OnFireballHitEnviroDelegate; // 0x820
	FMulticastInlineDelegate OnEnterAirColumnEvent; // 0x830
	FMulticastInlineDelegate OnSuperBoostStartFailed; // 0x840
	bool bIsDedicatedOptimized; // 0x850
	FCTBeastSnapshot NetworkSnapshot; // 0x860
	bool bInvisibilityFXActive; // 0x8b0
	bool bInvisibilityActive; // 0x8b1
	UPopcornFXEmitterComponent* LeftWingAirTrail; // 0x958
	UPopcornFXEmitterComponent* RightWingAirTrail; // 0x960
	UPopcornFXEffect* EtherealAsset; // 0x968
	TArray<FEtherealFX> EtherealFXs; // 0x970
	bool bDied; // 0x980
	EWeaponType LastHitWeapon; // 0x981
	bool bMoveThroughWalls; // 0x982
	bool bIsFlying; // 0x983
	bool bCanLureStrikerAbility; // 0x984
	bool bHaveLure; // 0x985
	bool bDebugCamera; // 0x986
	bool bPowerBoostEnabled; // 0x987
	float RequestStopPowerBoost; // 0x988
	bool bWantBoost; // 0x98c
	UParticleSystem* BurningDragonFX; // 0x9b0
	UPopcornFXEmitterComponent* ShieldImpactFireball; // 0x9b8
	UPopcornFXEmitterComponent* ImpactFireball; // 0x9c0
	UPopcornFXEmitterComponent* PKFXLeurreInit; // 0x9c8
	UPopcornFXEmitterComponent* PKFXLeurreAspiration; // 0x9d0
	UParticleSystem* BountyEndFX; // 0x9d8
	UParticleSystemComponent* BountyEndFXComp; // 0x9e0
	UParticleSystem* InfiniteBoostFX; // 0x9e8
	UParticleSystemComponent* InfiniteBoostFXComp; // 0x9f0
	UParticleSystem* MegaBoostFX; // 0x9f8
	FCTPlayerId DashingChieftainPlayerID; // 0xa00
	float BurningTime; // 0xa20
	UCTLevelSequence* DebugIdleSequence; // 0xa70
	UCTLevelSequence* DebugTakeOffSequence; // 0xa78
	UCTUserWidget* FontAssetPerformanceTestWidget; // 0xa80
	UCTLevelSequenceInstance* TakeOffSeqInstance; // 0xa88
	UCTLevelSequenceInstance* IdleSeqInstance; // 0xa90
	UCTLevelSequenceInstance* CurrentSequence; // 0xa98
	UPopcornFXEffect* ShieldExplosionFX; // 0xaa0
	float LocalExplosionDistance; // 0xaa8
	float DeathRTCDelay; // 0xaac
	bool bStartPressed; // 0xd58
	bool bHiddenUntilIdle; // 0xd59
	TArray<FActionBindings> ActionBindings; // 0xd60
};

struct UCTNavButtonWithLocalizedText : UCTNavigationWidget {
	FCTLocalizationData LocalizationText; // 0x440
	UCTRichTextBlock* TextInside; // 0x460
};

struct UDragonSagaLiveEventWidget_C : UCTCommunityLiveEventWidget {
	UButtonStatesHolderWidget_C* ButtonStatesHolderWidget; // 0x648
	UImage* Image_107; // 0x650
	UImage* Image_134; // 0x658
	UImage* Image_283; // 0x660
	UImage* Mockup; // 0x668
	UImage* Ornement; // 0x670
};

struct UInfoPopup_LogoutConfirm_C : UCTInfoPopupWidget {
	UImage* Image; // 0x380
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x140
	char bReverseAsBrake : 1; // 0x140
	char bUseRVOAvoidance : 1; // 0x140
	char bRawHandbrakeInput : 1; // 0x140
	char bRawGearUpInput : 1; // 0x140
	char bRawGearDownInput : 1; // 0x140
	char bWasAvoidanceUpdated : 1; // 0x144
	float Mass; // 0x148
	TArray<FWheelSetup> WheelSetups; // 0x150
	float DragCoefficient; // 0x160
	float ChassisWidth; // 0x164
	float ChassisHeight; // 0x168
	float DragArea; // 0x16c
	float EstimatedMaxEngineSpeed; // 0x170
	float MaxEngineRPM; // 0x174
	float DebugDragMagnitude; // 0x178
	FVector InertiaTensorScale; // 0x17c
	float MinNormalizedTireLoad; // 0x188
	float MinNormalizedTireLoadFiltered; // 0x18c
	float MaxNormalizedTireLoad; // 0x190
	float MaxNormalizedTireLoadFiltered; // 0x194
	float ThresholdLongitudinalSpeed; // 0x198
	int32_t LowForwardSpeedSubStepCount; // 0x19c
	int32_t HighForwardSpeedSubStepCount; // 0x1a0
	TArray<UVehicleWheel*> Wheels; // 0x1a8
	float RVOAvoidanceRadius; // 0x1d0
	float RVOAvoidanceHeight; // 0x1d4
	float AvoidanceConsiderationRadius; // 0x1d8
	float RVOSteeringStep; // 0x1dc
	float RVOThrottleStep; // 0x1e0
	int32_t AvoidanceUID; // 0x1e4
	FNavAvoidanceMask AvoidanceGroup; // 0x1e8
	FNavAvoidanceMask GroupsToAvoid; // 0x1ec
	FNavAvoidanceMask GroupsToIgnore; // 0x1f0
	float AvoidanceWeight; // 0x1f4
	FVector PendingLaunchVelocity; // 0x1f8
	FReplicatedVehicleState ReplicatedState; // 0x204
	float RawSteeringInput; // 0x21c
	float RawThrottleInput; // 0x220
	float RawBrakeInput; // 0x224
	float SteeringInput; // 0x228
	float ThrottleInput; // 0x22c
	float BrakeInput; // 0x230
	float HandbrakeInput; // 0x234
	float IdleBrakeInput; // 0x238
	float StopThreshold; // 0x23c
	float WrongDirectionThreshold; // 0x240
	FVehicleInputRate ThrottleInputRate; // 0x244
	FVehicleInputRate BrakeInputRate; // 0x24c
	FVehicleInputRate HandbrakeInputRate; // 0x254
	FVehicleInputRate SteeringInputRate; // 0x25c
	AController* OverrideController; // 0x288
};

struct UCollectionMapPoint_Owned_Unselected_Pressed_C : UCTCollectionMapPointStateWidget {
	UImage* NewPointImage; // 0x2f0
};

struct UCTDiscoveryNotificationCell : UCTUserWidget {
	UPanelWidget* AdvancementPanel; // 0x2f0
	UTextBlock* RarityText; // 0x2f8
	UTextBlock* DragonNameText; // 0x300
	UPanelWidget* DiscoveryPanel; // 0x308
	UTextBlock* DiscoveryRarityText; // 0x310
	UTextBlock* ProgressionText; // 0x318
	UImage* ProgressionGauge; // 0x320
	UImage* RarityLine; // 0x328
	UImage* DragonIcon; // 0x330
	float FillingDuration; // 0x338
};

struct UNiagaraDataInterfaceGrid2D : UNiagaraDataInterfaceRWBase {
	int32_t NumCellsX; // 0xd8
	int32_t NumCellsY; // 0xdc
	int32_t NumCellsMaxAxis; // 0xe0
	int32_t NumAttributes; // 0xe4
	bool SetGridFromMaxAxis; // 0xe8
	FVector2D WorldBBoxSize; // 0xec
};

struct UGeometryCache : UObject {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
	int32_t StartFrame; // 0x60
	int32_t EndFrame; // 0x64
	uint64_t Hash; // 0x68
};

struct UCTWeaponStickyMine : UCTWeapon {
	int32_t StarSpawnMineCount; // 0x158
	float StarSpawnPhaseDeg; // 0x15c
	float StarSpawnStrength; // 0x160
	float StarSpawnPitchDeg; // 0x164
	float StarSpawnTotalAngle; // 0x168
};

struct UCTShieldPropDataAsset : UCTPropDataAsset {
	TSoftObjectPtr<UStaticMesh> Mesh; // 0x30
};

struct UForceLockWidget_C : UCTForceLockWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	UImage* Circle; // 0x318
};

struct UFrameNavigationButtonWidget_C : UCTNavigationWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x440
	UCTButton* ClickArea; // 0x448
	UCTButton* Visual; // 0x450
	FButtonStyle Hovered; // 0x458
	FButtonStyle Base; // 0x6d0
	FButtonStyle Pressed; // 0x948
};

struct UInfoPopup_FTUEDefault_YesNo_C : UCTFTUEPopupWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x390
	UWidgetAnimation* HideAnimation; // 0x398
	UWidgetAnimation* ShowAnimation; // 0x3a0
	UImage* BlackBG; // 0x3a8
	UImage* PopupBackground; // 0x3b0
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct USoundNodeGroupControl : USoundNode {
	TArray<int32_t> GroupSizes; // 0x48
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	ESceneTextureId SceneTextureId; // 0x54
	bool bFiltered; // 0x55
};

struct UObjectReferencer : UObject {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct UCTCollectionDataAsset : UDataAsset {
	UCTCollectionHousesDataAsset* HousesData; // 0x30
	UCTCollectionDragonsDataAsset* DragonsData; // 0x38
	UCTCollectionMapDataAsset* MapData; // 0x40
	UCTCollectionUIDataAsset* UIData; // 0x48
};

struct ULandscapeMeshProxyComponent : UStaticMeshComponent {
	FGuid LandscapeGuid; // 0x4e0
	TArray<FIntPoint> ProxyComponentBases; // 0x4f0
	int8_t ProxyLOD; // 0x500
};

struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve Curve; // 0x70
};

struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	FSubmixEffectFilterSettings Settings; // 0x9c
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct UAkMusicSyncCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x30
	FAkSegmentInfo SegmentInfo; // 0x34
	EAkCallbackType MusicSyncType; // 0x58
	FString UserCueName; // 0x60
};

struct UCTTabMainMenuController : UCTWidgetWithTabController {
	UCTTabMainMenuWidget* MainMenuWidgetClass; // 0xa8
	UCTCustoMasterTabController* CustoMasterTabControllerClass; // 0xb0
	UCTShopMasterTabController* ShopMasterTabControllerClass; // 0xb8
	UCTPlayMasterTabController* PlayTabControllerClass; // 0xc0
	UCTHomeTabController* HomeTabControllerClass; // 0xc8
	UCTCollectionMasterTabController* CollectionMasterTabControllerClass; // 0xd0
	UCTPlayerProfileTabController* PlayerProfileTabControllerClass; // 0xd8
	UCTOptionsController* OptionsControllerClass; // 0xe0
	UCTCreditsController* CreditsControllerClass; // 0xe8
	UCTGroupStatusController* GroupStatusControllerClass; // 0xf0
	UCTLeaderboardTabController* LeaderboardTabControllerClass; // 0xf8
	UCTSocialController* SocialControllerClass; // 0x100
	UCTUserProfileController* UserProfileControllerClass; // 0x108
	UCTShopPurchasePageController* ShopPurchasePageControllerClass; // 0x110
	UCTShopDetailPageController* ShopDetailPageControllerClass; // 0x118
	UCTShopItemPurchasePageController* ShopItemPurchasePageControllerClass; // 0x120
	UCTShopPurchasePageWidget* ShopPurchaseWidgetClass; // 0x128
	UCTShopItemPurchasePageWidget* ShopItemPurchaseWidgetClass; // 0x130
	UCTShopDetailPageWidget* ShopDetailWidgetClass; // 0x138
	UCTContextMenuController* ContextMenuControllerClass; // 0x140
	TArray<FName> MainMenulLevels; // 0x148
	FCTPackagePurchaseDetails LastPurchaseDetails; // 0x158
	TArray<UCTWidgetController*> WidgetStack; // 0x198
	UCTCustoMasterTabController* CustoMasterTab; // 0x1b0
	UCTShopMasterTabController* ShopMasterTab; // 0x1b8
	UCTCollectionMasterTabController* CollectionMasterTab; // 0x1c0
	UCTPlayMasterTabController* PlayMasterTab; // 0x1c8
	UCTHomeTabController* HomeTab; // 0x1d0
	UCTPlayerProfileTabController* PlayerProfileTab; // 0x1d8
	UCTLeaderboardTabController* LeaderboardTabs; // 0x1e0
	UCTOptionsController* OptionsTab; // 0x1e8
	UCTCreditsController* CreditsTab; // 0x1f0
	UCTSocialController* SocialTab; // 0x1f8
	UCTUserProfileController* UserProfileController; // 0x200
	UCTGroupStatusController* GroupStatusController; // 0x208
	UCTShopPurchasePageController* ShopPurchasePage; // 0x210
	UCTShopPurchasePageController* ShopItemPurchasePage; // 0x218
	UCTShopDetailPageController* ShopDetailPage; // 0x220
	UCTContextMenuController* ContextMenuController; // 0x228
	bool IsNotificationDeeplinkingEnabled; // 0x230
	UCTVeteranDiscountManager* VeteranDiscountManager; // 0x238
	ECharacClassType CurrentMenuClass; // 0x240
};

struct UGameMapsSettings : UObject {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct AControlPointMeshActor : AActor {
	UControlPointMeshComponent* ControlPointMeshComponent; // 0x220
};

struct UInviteButton_C : UCTNavigationWidget {
	UDefaultRichTextBlock_C* ButtonText; // 0x440
	UCTButton* InviteButton; // 0x448
	UImage* SearchImage; // 0x450
};

struct UMaterialExpressionShadowReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Shadow; // 0x54
};

struct UMaterialExpressionDDY : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UInterpFilter : UObject {
	FString Caption; // 0x28
};

struct UCreditsWidget_C : UCTCreditsWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b8
	UImage* Background; // 0x3c0
	UImage* Black; // 0x3c8
	UControllerIcon_C* ControllerIcon; // 0x3d0
	UControllerIcon_C* ControllerIcon_2; // 0x3d8
	UControllerIcon_C* ControllerIcon_3; // 0x3e0
	UCreditsChapterWidget_C* CreditsChapterWidget; // 0x3e8
	UCreditsChapterWidget_C* CreditsChapterWidget_2; // 0x3f0
	UCreditsChapterWidget_C* CreditsChapterWidget_3; // 0x3f8
	UImage* Image_219; // 0x400
	UImage* logo; // 0x408
	bool EnableAutoScrolling; // 0x410
	ScrollingMode ScrollingMode; // 0x411
	float ScrollingSpeed; // 0x414
	int32_t DirectionValue; // 0x418
	bool DelayOnceFlag; // 0x41c
	bool ResetScrollOnLeave; // 0x41d
	bool IsDown; // 0x41e
	bool IsSuspended; // 0x41f
	float ManualScrollingDelay; // 0x420
	bool IsScrolledOnce; // 0x424
	float StickAnalogInputError; // 0x428
	float UserScrollInputValue; // 0x42c
	bool IsUserInputScrolling; // 0x430
	float GamepadStickScrollingSpeed; // 0x434
	float DelayBeforeFirstScrolling(Seconds); // 0x438
	bool AutoscrollSuspendedState; // 0x43c
	float DelayTime; // 0x440
	bool IsWasAutoscrollingStopedByUser; // 0x444
};

struct UMaterialExpressionSpeedTree : UMaterialExpression {
	FExpressionInput GeometryInput; // 0x40
	FExpressionInput WindInput; // 0x54
	FExpressionInput LODInput; // 0x68
	FExpressionInput ExtraBendWS; // 0x7c
	ESpeedTreeGeometryType GeometryType; // 0x90
	ESpeedTreeWindType WindType; // 0x91
	ESpeedTreeLODType LODType; // 0x92
	float BillboardThreshold; // 0x94
	bool bAccurateWindVelocities; // 0x98
};

struct UAISystemBase : UObject {
	FSoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50
};

struct UMaterialExpressionCollectionParameter : UMaterialExpression {
	UMaterialParameterCollection* Collection; // 0x40
	FName ParameterName; // 0x48
	FGuid ParameterId; // 0x50
};

struct UAudioCaptureComponent : USynthComponent {
	int32_t JitterLatencyFrames; // 0x6c0
};

struct ACTFireball : ACTProjectileSpawn {
	USphereComponent* SphereComp; // 0x298
	UParticleSystemComponent* ParticleSystem; // 0x2a0
	UPointLightComponent* LightComponent; // 0x2a8
	UCTFireballMovementComponent* ProjectileMovement; // 0x2b0
	ACTBeastPawn* LostTargetPlayer; // 0x2b8
	float ExplosionScale; // 0x2e0
	float TimeToLoseTarget; // 0x2e4
	float FrontAccelerationCst; // 0x2e8
	float TimeWaitForAccelerateCst; // 0x2ec
	float MaxSpeedCst; // 0x2f0
	float MaxAngleTrajectoryCst; // 0x2f4
	float AddedSpeedBadCst; // 0x2f8
	float AddedSpeedGoodCst; // 0x2fc
	float FOVTargetBadCst; // 0x300
	float FOVTargetGoodCst; // 0x304
	float TurnRadiusBadCst; // 0x308
	float TurnRadiusGoodCst; // 0x30c
	float AnticipedTimeCst; // 0x310
	bool Lurable; // 0x314
	bool bExplodeAtUnlock; // 0x315
	float ExplodeUnlockAOE; // 0x318
};

struct UCTPropStampModifierDataAsset : UCTPropModifierDataAsset {
	FCustomizationExportData Data; // 0x30
};

struct UCTLeaderBoardLocalPlayerWidget : UCTLeaderBoardCell {
	UTextBlock* MmrTitle; // 0x480
	UTextBlock* RankTitle; // 0x488
	UCTButton* RankButton; // 0x490
	UTextBlock* RankButtonText; // 0x498
	FSlateBrush NoRankingImageBrush; // 0x4a0
	UTextBlock* NoRankingText; // 0x528
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xe8
	FFrameNumber StartFrameOffset; // 0xf0
	float StartOffset; // 0xf4
	float AudioStartTime; // 0xf8
	float AudioDilationFactor; // 0xfc
	float AudioVolume; // 0x100
	FMovieSceneFloatChannel SoundVolume; // 0x108
	FMovieSceneFloatChannel PitchMultiplier; // 0x1a8
	FMovieSceneActorReferenceData AttachActorData; // 0x248
	bool bLooping; // 0x2f8
	bool bSuppressSubtitles; // 0x2f9
	bool bOverrideAttenuation; // 0x2fa
	USoundAttenuation* AttenuationSettings; // 0x300
	FDelegate OnQueueSubtitles; // 0x308
	FMulticastInlineDelegate OnAudioFinished; // 0x318
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x328
};

struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct ULocationSecretDragonCellWidget_C : UCTCollectionDragonCellWidget {
	UCTButton* CellButton; // 0x510
	UImage* Frame; // 0x518
};

struct UCTAnimatedNavigationScrollBox : UCTNavigationScrollBox {
	UCTUserWidget* MainHolder; // 0x8c8
};

struct UCTNavEditBox : UCTNavigationWidget {
	FNavEditBoxOptions Options; // 0x4b8
	FEditBoxInheritedOptions InheritedOptions; // 0x4e0
	UCTEditableTextBox* EditBox; // 0x4e8
};

struct UParticleModuleColorScaleOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct UGizmoTransformChangeStateTarget : UObject {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x50
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x220
};

struct ABP_PurchaseCloseUpRenderer_C : ACTCloseUpObjectRenderer {
	UCTFakeVolumetricLightComponent* Li_BackGroundHalo; // 0x2e0
	UStaticMeshComponent* H01_Shield03_Mesh; // 0x2e8
	USpotLightComponent* Li_Fill; // 0x2f0
	USpotLightComponent* Li_Key; // 0x2f8
};

struct UCollectionClassInfoWidgetBP_C : UCTCollectionClassInfoWidget {
	UImage* HouseNameBackground; // 0x300
	UImage* HouseNameBackground_2; // 0x308
};

struct UABP_D02_BodyL02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UCTTransitionWidget : UCTUserWidget {
	UImage* Background; // 0x2f0
};

struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	FSourceEffectWaveShaperSettings Settings; // 0x98
};

struct UMaterialExpressionTransform : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialVectorCoordTransformSource TransformSourceType; // 0x54
	EMaterialVectorCoordTransform TransformType; // 0x55
};

struct UCTWidgetSpreadAnimation : UCTWidgetMovingAnimation {
	FVector2D SpreadDestination; // 0xa0
};

struct UCTEndMatchNextRewardsWidget : UCTUserWidget {
	UHorizontalBox* NextRewardsPanel; // 0x2f0
	UTextBlock* NextLevelRewardsText; // 0x2f8
	UTextBlock* NextRewardsText; // 0x300
};

struct ABP_TabMainMenuGameState_C : ACTGameStateBase {
	USceneComponent* DefaultSceneRoot; // 0x2b0
};

struct UMaterialExpressionLightmassReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput Lightmass; // 0x54
};

struct UPopcornFXSceneComponent : UPrimitiveComponent {
	FName SceneName; // 0x450
	char bEnableUpdate : 1; // 0x458
	char bEnableRender : 1; // 0x458
	EPopcornFXSceneBBMode BoundingBoxMode; // 0x45c
	FBox FixedRelativeBoundingBox; // 0x460
	FPopcornFXSimulationSettings SimulationSettingsOverride; // 0x47c
	FPopcornFXRenderSettings RenderSettingsOverride; // 0x48c
	EPopcornFXHeavyDebugMode HeavyDebugMode; // 0x4a0
	char bRender_FreezeBillboardingMatrix : 1; // 0x4a4
	char bRender_OverrideColorByDrawCall : 1; // 0x4a4
	int32_t Render_OverrideDebugColorCount; // 0x4a8
	UMaterialInterface* Render_OverrideAllMaterial; // 0x4b0
};

struct USynthKnob : UWidget {
	float Value; // 0x108
	float StepSize; // 0x10c
	float MouseSpeed; // 0x110
	float MouseFineTuneSpeed; // 0x114
	char ShowTooltipInfo : 1; // 0x118
	FText ParameterName; // 0x120
	FText ParameterUnits; // 0x138
	FDelegate ValueDelegate; // 0x150
	FSynthKnobStyle WidgetStyle; // 0x160
	bool Locked; // 0x398
	bool IsFocusable; // 0x399
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x3a0
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x3b0
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x3c0
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x3d0
	FMulticastInlineDelegate OnValueChanged; // 0x3e0
};

struct UMockDataMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f8
	bool ScanWorld; // 0x208
	bool RequestNormals; // 0x209
	bool RequestVertexConfidence; // 0x20a
	EMeshTrackerVertexColorMode VertexColorMode; // 0x20b
	TArray<FColor> BlockVertexColors; // 0x210
	FLinearColor VertexColorFromConfidenceZero; // 0x220
	FLinearColor VertexColorFromConfidenceOne; // 0x230
	float UpdateInterval; // 0x240
	UMRMeshComponent* MRMesh; // 0x248
};

struct UNiagaraDataInterface2DArrayTexture : UNiagaraDataInterface {
	UTexture2DArray* Texture; // 0x38
};

struct ULandscapeSplineControlPoint : UObject {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	float Width; // 0x40
	float LayerWidthRatio; // 0x44
	float SideFalloff; // 0x48
	float LeftSideFalloffFactor; // 0x4c
	float RightSideFalloffFactor; // 0x50
	float LeftSideLayerFalloffFactor; // 0x54
	float RightSideLayerFalloffFactor; // 0x58
	float EndFalloff; // 0x5c
	TArray<FLandscapeSplineConnection> ConnectedSegments; // 0x60
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	UControlPointMeshComponent* LocalMeshComponent; // 0xa0
};

struct UNotificationWithImageButton_C : UCTNotificationWithImageButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x498
	USizeBox* ControllerIconSizeBox; // 0x4a0
	UCTButton* CTButton_91; // 0x4a8
	UImage* Image; // 0x4b0
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UActorSequenceComponent : UActorComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct UMissionsEventDetailsPopupWidget_C : UCTMissionsLiveEventPopupWidget {
	UImage* BlackBG; // 0x388
	UDefaultRichTextBlock_C* DescriptionTitle; // 0x390
	UDragonFeastMission_C* DragonFestLine_LiveEvent; // 0x398
	UDragonFeastMission_C* DragonFestLine_LiveEvent_2; // 0x3a0
	UDragonFeastMission_C* DragonFestLine_LiveEvent_3; // 0x3a8
	UDragonFeastMission_C* DragonFestLine_LiveEvent_4; // 0x3b0
	UDragonFeastMission_C* DragonFestLine_LiveEvent_5; // 0x3b8
	UImage* Frame; // 0x3c0
	UImage* FrameBackground; // 0x3c8
	UImage* FrameBlocks; // 0x3d0
	UImage* Image_134; // 0x3d8
	UImage* Image_143; // 0x3e0
	UCTRetainerBox* Mask; // 0x3e8
	UImage* Mockup; // 0x3f0
	UImage* ModeTitleBG; // 0x3f8
	UImage* Ornement; // 0x400
	UImage* Ornement_2; // 0x408
	UImage* Ornement_3; // 0x410
	UDefaultRichTextBlock_C* ProgressionTitle; // 0x418
	UDefaultRichTextBlock_C* ProgressionTitle_2; // 0x420
	UImage* RewardImage; // 0x428
	UImage* RewardOrnement; // 0x430
	UDefaultRichTextBlock_C* RewardsTitle; // 0x438
	UDefaultRichTextBlock_C* RewardTitle; // 0x440
};

struct UNiagaraPreviewAxis_InterpParamBase : UNiagaraPreviewAxis {
	FName Param; // 0x28
	int32_t Count; // 0x30
};

struct UTabBarMenuButtonWidget_C : UCTNavigationTabBarButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x478
	FText ButtonTextValue; // 0x480
	UCTButton* ButtonRoot; // 0x498
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4e0
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	ENavDataGatheringModeConfig DataGatheringMode; // 0x70
	float DirtyAreaWarningSizeThreshold; // 0x74
	TArray<FNavDataConfig> SupportedAgents; // 0x78
	FNavAgentSelector SupportedAgentsMask; // 0x88
	TArray<ANavigationData*> NavDataSet; // 0x90
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa0
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc0
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd0
	FNavigationSystemRunMode OperationMode; // 0x1bc
	float DirtyAreasUpdateFreq; // 0x15bc
};

struct UPlayerLifeGaugeWidget_C : UCTPlayerLifeGaugeWidget {
	UCanvasPanel* CanvasPanel_1; // 0x478
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct UClothingAssetCommon : UClothingAssetBase {
	UPhysicsAsset* PhysicsAsset; // 0x48
	TMap<FName, UClothConfigBase*> ClothConfigs; // 0x50
	TArray<FClothLODDataCommon> LODData; // 0xa0
	TArray<int32_t> LodMap; // 0xb0
	TArray<FName> UsedBoneNames; // 0xc0
	TArray<int32_t> UsedBoneIndices; // 0xd0
	int32_t ReferenceBoneIndex; // 0xe0
	UClothingAssetCustomData* customData; // 0xe8
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct UCTPlayerLifeGaugeWidget : UCTLifeGaugeWidget {
	float LifeValue; // 0x334
	float TotalShieldValue; // 0x338
	float LastHitTime; // 0x33c
	float LifeGaugeFastSmoothSpeed; // 0x340
	float LifeGaugeSlowerSmoothSpeed; // 0x344
	float LifeGaugeSlowSmoothSpeed; // 0x348
	float LifeGaugeSlowForceUpdateSmoothSpeed; // 0x34c
	float LifeBlinkFrequency; // 0x350
	FLinearColor LifeBlinkColor; // 0x354
	FName FastTotalScalarName; // 0x364
	FName SlowHPScalarName; // 0x36c
	FName SlowTotalShieldScalarName; // 0x374
	FName SlowExtraShieldScalarName; // 0x37c
	FName SlowerTotalScalarName; // 0x384
	float TargetLockIntensity; // 0x38c
	float TargetInFTRange; // 0x390
	float TargetThickness; // 0x394
	UMaterialInterface* EnemyMaterial; // 0x398
	UMaterialInterface* AllyMaterial; // 0x3a0
	TArray<FCTShieldInfo> ShieldValues; // 0x3a8
	ACTBeastPawn* pLocalPlayerPawn; // 0x3b8
	ACTBeastPawn* pTargetPlayerPawn; // 0x3c0
	UCTHealthComponent* HealthComp; // 0x3c8
	ACTPlayerState* MyPS; // 0x3d0
	FCTShieldInfo WindguardShieldInfo; // 0x3d8
	FCTShieldInfo FieryShieldInfo; // 0x3e0
	FVector2D UnselectedSelectedGaugeThicknesses; // 0x3e8
	float FlamethrowerGaugeThicknessMultiplier; // 0x3f0
	FPawnDetection PawnDetection; // 0x3f4
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0xe8
	ANavigationData* MyNavData; // 0xf8
};

struct UCollectionLocationTab_C : UCTLocationTabWidget {
	UImage* DescriptionBG; // 0x560
	UImage* FilterBG; // 0x568
	UImage* FooterFrame; // 0x570
	UGenericOrnement_C* GenericOrnement; // 0x578
	UGenericOrnement_C* GenericOrnement_137; // 0x580
	UGenericOrnement_C* GenericOrnement_206; // 0x588
	UImage* Image_97; // 0x590
	ULocationCell_C* LocationCell; // 0x598
	ULocationTabArrowWidget_C* LocationTabArrowWidget_194; // 0x5a0
	UImage* Mockup; // 0x5a8
	UImage* Ornement; // 0x5b0
};

struct UCTHomeLiveEventWidgetController : UCTWidgetController {
	UCTPlayEarnHomeController* PlayEarnHomeControllerClass; // 0x90
	UCTMissionsEventHomeController* MissionsHomeControllerClass; // 0x98
	UCTCommunityEventHomeCtrl* CommunityEventHomeCtrlClass; // 0xa0
	UCTXpBoostEventHomeCtrl* XpBoostEventHomeCtrlClass; // 0xa8
	TMap<ECTLiveEventType, UCTLiveEventWidgetController*> HomeLiveEventControllers; // 0xb0
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct UReverbEffect : UObject {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UOptionsParameterShortcutWidget_C : UCTOptionsParameterShortcutWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x528
	UCTButton* BGButton; // 0x530
	UHorizontalBox* HorizontalBox_324; // 0x538
	UImage* ImageNormal; // 0x540
	UImage* ImagePressed; // 0x548
};

struct UCTEggXpProgressController : UCTXpDistributionProgressCtrl {
	float MinFillTimePerEgg; // 0x110
};

struct UIntroNavigationWidget_C : UNavMenuButtonWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4f0
	UCTButton* ChildButton; // 0x4f8
	FSlateFontInfo DefaultFont; // 0x500
	FSlateFontInfo HoverFont; // 0x558
	FSlateColor HoverTextColor; // 0x5b0
	FSlateColor DefaultTextColor; // 0x5d8
	FButtonStyle ButtonStyle; // 0x600
};

struct UCTNamedCellsContainerWidget : UCTUserWidget {
	UGridPanel* CellsContainer; // 0x2f0
	UTextBlock* TitleText; // 0x2f8
};

struct UUserWidget : UWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMulticastInlineDelegate OnVisibilityChanged; // 0x168
	FMargin Padding; // 0x190
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a0
	UUMGSequenceTickManager* AnimationTickManager; // 0x1b0
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct UInterpTrackMove : UInterpTrack {
	FInterpCurveVector PosTrack; // 0x70
	FInterpCurveVector EulerTrack; // 0x88
	FInterpLookupTrack LookupTrack; // 0xa0
	FName LookAtGroupName; // 0xb0
	float LinCurveTension; // 0xb8
	float AngCurveTension; // 0xbc
	char bUseQuatInterpolation : 1; // 0xc0
	char bShowArrowAtKeys : 1; // 0xc0
	char bDisableMovement : 1; // 0xc0
	char bShowTranslationOnCurveEd : 1; // 0xc0
	char bShowRotationOnCurveEd : 1; // 0xc0
	char bHide3DTrack : 1; // 0xc0
	EInterpTrackMoveRotMode RotMode; // 0xc4
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMovieSceneCameraShakeSourceShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x98
};

struct UBTDecorator_Cooldown : UBTDecorator {
	float CoolDownTime; // 0x68
};

struct UNiagaraDataInterfaceTexture : UNiagaraDataInterface {
	UTexture* Texture; // 0x38
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UCTLevelSequenceInstance : UCTRTCInstanceBase {
	FMulticastInlineDelegate OnSequenceEnd; // 0x48
	FMulticastInlineDelegate OnSequenceCameraSmoothOutStart; // 0x58
	ACTBeastPawn* BeastPawn; // 0x68
	UCTLevelSequence* Asset; // 0x70
	FTimerHandle TimerHandle; // 0x78
};

struct UCTPlayTabGameModeSwitchWidget : UCTPlayTabNewButtonWidget {
	UCTSwitchWidget* SWITCH; // 0xb00
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x38
	float Max; // 0x3c
};

struct ACTSubLevelManager : AActor {
	USphereComponent* SphereCollision; // 0x220
	FString Scenette; // 0x228
	ULevelStreamingDynamic* ScenetteLevel; // 0x238
};

struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28
};

struct UMovieSceneObjectPropertySection : UMovieSceneSection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe8
};

struct UParticleModuleAccelerationConstant : UParticleModuleAccelerationBase {
	FVector Acceleration; // 0x38
};

struct UHoudiniStaticMesh : UObject {
	bool bHasNormals; // 0x28
	bool bHasTangents; // 0x29
	bool bHasColors; // 0x2a
	uint32_t NumUVLayers; // 0x2c
	bool bHasPerFaceMaterials; // 0x30
	TArray<FVector> VertexPositions; // 0x38
	TArray<FIntVector> TriangleIndices; // 0x48
	TArray<FColor> VertexInstanceColors; // 0x58
	TArray<FVector> VertexInstanceNormals; // 0x68
	TArray<FVector> VertexInstanceUTangents; // 0x78
	TArray<FVector> VertexInstanceVTangents; // 0x88
	TArray<FVector2D> VertexInstanceUVs; // 0x98
	TArray<int32_t> MaterialIDsPerTriangle; // 0xa8
	TArray<FStaticMaterial> StaticMaterials; // 0xb8
};

struct UAkXSXInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXSXApuHeapInitializationSettings ApuHeapSettings; // 0x88
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkXSXAdvancedInitializationSettings AdvancedSettings; // 0xb8
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xc0
};

struct UPositivePopupButton_C : UCTCustomizableNavigationButton {
	UImage* Image_71; // 0x6d0
};

struct UCTArmamentController : UObject {
	ACTBeastPawn* OwnerPawn; // 0x28
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct UMaterialExpressionSamplePhysicsVectorField : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
	EFieldVectorType FieldTarget; // 0x54
};

struct UAkAssetBase : UAkAudioType {
	UAkAssetPlatformData* PlatformAssetData; // 0x40
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x478
	int32_t MapHeight; // 0x47c
	int32_t TileWidth; // 0x480
	int32_t TileHeight; // 0x484
	UPaperTileSet* DefaultLayerTileSet; // 0x488
	UMaterialInterface* Material; // 0x490
	TArray<UPaperTileLayer*> TileLayers; // 0x498
	FLinearColor TileMapColor; // 0x4a8
	int32_t UseSingleLayerIndex; // 0x4b8
	bool bUseSingleLayer; // 0x4bc
	UPaperTileMap* TileMap; // 0x4c0
};

struct ACTHeroRTC : AActor {
	USkeletalMeshComponent* PosingMesh; // 0x228
	USkeletalMeshComponent* HeadMesh; // 0x230
	USkeletalMeshComponent* UpperBodyMesh; // 0x238
	USkeletalMeshComponent* LowerBodyMesh; // 0x240
	USkeletalMeshComponent* CapeMesh; // 0x248
	UStaticMeshComponent* ShieldMesh; // 0x250
	UStaticMeshComponent* QuiverMesh; // 0x258
	UStaticMeshComponent* QuiverEmptyMesh; // 0x260
	UStaticMeshComponent* WeaponHandLeftMesh; // 0x268
	UStaticMeshComponent* WeaponHandRightMesh; // 0x270
	USceneComponent* WindRootComponent; // 0x278
	USceneComponent* WindSocketComponent; // 0x280
	AWindDirectionalSource* WindActor; // 0x288
	UCTCustomizationComponent* CustomizationComponent; // 0x290
};

struct UCTLocationDragonCellStateSecret : UCTLocationDragonCellState {
	UCTCollectionDragonCellWidget* Widget; // 0x30
};

struct UCameraAnim : UObject {
	UInterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	FBox BoundingBox; // 0x34
	char bRelativeToInitialTransform : 1; // 0x50
	char bRelativeToInitialFOV : 1; // 0x50
	float BaseFOV; // 0x54
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5c0
};

struct UCTMoneyShopPopupWidget : UCTInfoPopupWidget {
	UWidget* BetaRealMoneyPurchasePrevented; // 0x378
	UCTShopSmoothPriceWidget* SoftChestWidget; // 0x380
	UCTShopSmoothPriceWidget* HardChestWidget; // 0x388
};

struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FSpinBoxStyle SpinBoxStyle; // 0x30
};

struct UChaosGameplayEventDispatcher : UChaosEventListenerComponent {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct UCTHatchingLevelText : UCTUserWidget {
	FLinearColor ActiveTextColor; // 0x2f0
	FLinearColor UnactiveTextColor; // 0x300
	bool bActive; // 0x310
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UCTNavigationPageMainMenu : UCTNavigationPage {
	bool bShowGearButton; // 0x308
	bool bHideMainMenuTabBar; // 0x309
	bool bHideMainMenuPersistent; // 0x30a
};

struct UABP_H03_LowerParts01_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FVector NewVar_1; // 0x4d0
};

struct UUIFireballAmmoSlotWidget_C : UCTAmmoSlotWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	UWidgetAnimation* GainFeedback; // 0x308
	UImage* GainAnimImage; // 0x310
	UImage* Image_76; // 0x318
};

struct UBP_MoveComponent_C : UCTMoveComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1460
	FVector HitWorldNormal; // 0x1468
	FVector HitWorldHorizontalNormal; // 0x1474
	FVector HitBeastWorldForward; // 0x1480
	FVector HitBeastWorldHorizontalForward; // 0x148c
};

struct UMagicLeapSettings : UObject {
	bool bEnableZI; // 0x28
	bool bUseVulkanForZI; // 0x29
	bool bUseMLAudioForZI; // 0x2a
};

struct UOptionsSectionTitleMouse_C : UCTOptionsSectionTitleWidget {
	UHorizontalBox* LabelsHolder; // 0x2f0
	UImage* OptionsSplitter_4; // 0x2f8
	UDefaultRichTextBlock_C* Settings; // 0x300
	UDefaultRichTextBlock_C* SOCIAL; // 0x308
};

struct UPop_ROOKRules_C : UCTGameModeRulesWidget {
	UDefaultTextBlock_C* DefaultTextBlock; // 0x380
	UDefaultTextBlock_C* DefaultTextBlock_181; // 0x388
	UDefaultTextBlock_C* DefaultTextBlock_300; // 0x390
	UImage* Image; // 0x398
	UImage* Image_2; // 0x3a0
	UImage* Image_3; // 0x3a8
	UImage* Image_4; // 0x3b0
	UImage* Image_95; // 0x3b8
	UImage* Image_458; // 0x3c0
	UImage* Image_562; // 0x3c8
	UImage* LargeTexture; // 0x3d0
};

struct UCTPlayerAccountData : USaveGame {
	int32_t SaveVersion; // 0x28
	FCTPlayerAccount PlayerAccount; // 0x30
};

struct UCTCommunityLiveEventWidget : UCTHomeSingleLiveEventWidget {
	UCTCommunityEventProgressWidget* EventProgressBar; // 0x628
	URichTextBlock* CommunityProgressTxt; // 0x630
	UProgressBar* CommunityGoalProgress; // 0x638
	UCTEventProgressEntryWidget* ProgressMarkerClass; // 0x640
};

struct UHoudiniParameterFloat : UHoudiniParameter {
	TArray<float> Values; // 0x108
	TArray<float> DefaultValues; // 0x118
	FString Unit; // 0x128
	bool bNoSwap; // 0x138
	bool bHasMin; // 0x139
	bool bHasMax; // 0x13a
	bool bHasUIMin; // 0x13b
	bool bHasUIMax; // 0x13c
	bool bIsLogarithmic; // 0x13d
	float Min; // 0x140
	float Max; // 0x144
	float UIMin; // 0x148
	float UIMax; // 0x14c
	bool bIsChildOfRamp; // 0x150
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UCTPlayerLiveNotif : UObject {
	FString NotifID; // 0x28
	int32_t DateUTC; // 0x38
	FString EventId; // 0x40
	FString EventTxtID; // 0x50
	FString RewardId; // 0x60
	bool MarkForDelete; // 0x70
};

struct UCTDiscordWidget : UCTSendACodeWidget {
	UPanelWidget* DiscordButtonsBox; // 0x370
	UCTDiscordCodeLine* DiscordCodeLineClass; // 0x378
};

struct UInGameAdManager : UPlatformInterfaceBase {
	char bShouldPauseWhileAdOpen : 1; // 0x38
	TArray<FDelegate> ClickedBannerDelegates; // 0x40
	TArray<FDelegate> ClosedAdDelegates; // 0x50
};

struct ATA_BP_FireFX6_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UParticleSystemComponent* FX_FirePropagation_roof; // 0x228
	float Timeline_0_MainFlameLocation_C6092E73453689A89D052B9A4DFD6785; // 0x230
	float Timeline_0_FlamePulseVel_C6092E73453689A89D052B9A4DFD6785; // 0x234
	float Timeline_0_FlamePulseSize_C6092E73453689A89D052B9A4DFD6785; // 0x238
	float Timeline_0_SmokeSize_C6092E73453689A89D052B9A4DFD6785; // 0x23c
	float Timeline_0_SmokeVel_C6092E73453689A89D052B9A4DFD6785; // 0x240
	float Timeline_0_MainFlameSize_C6092E73453689A89D052B9A4DFD6785; // 0x244
	ETimelineDirection Timeline_0__Direction_C6092E73453689A89D052B9A4DFD6785; // 0x248
	UTimelineComponent* Timeline_1; // 0x250
	FVector MainFlameSizeBegin; // 0x258
	FVector MainFlameSizeEnd; // 0x264
	FVector SmokeVelBegin; // 0x270
	FVector SmokeVelEnd; // 0x27c
	FVector SmokeSizeBegin; // 0x288
	FVector SmokeSizeEnd; // 0x294
	FVector FlamePulseSizeBegin; // 0x2a0
	FVector FlamePulseSizeEnd; // 0x2ac
	FVector FlamePulseVelBegin; // 0x2b8
	FVector FlamePulseVelEnd; // 0x2c4
	FVector MainFlameLocBegin; // 0x2d0
	FVector MainFlameLocEnd; // 0x2dc
};

struct UCTPodiumWidget : UCTUserWidget {
	UCanvasPanel* P1Panel; // 0x2f0
	URichTextBlock* P1Name; // 0x2f8
	URichTextBlock* P1Title; // 0x300
	FLinearColor P1Tint; // 0x308
	UImage* P1LogoImage; // 0x318
	UCanvasPanel* TaglinePanel; // 0x320
	URichTextBlock* TaglineText; // 0x328
	UImage* TagLineFrame; // 0x330
	TArray<UImage*> TaglineImagesArray; // 0x338
	UCanvasPanel* P2Panel; // 0x348
	URichTextBlock* P2Name; // 0x350
	URichTextBlock* P2Title; // 0x358
	FLinearColor P2Tint; // 0x360
	UImage* P2LogoImage; // 0x370
	UCanvasPanel* P3Panel; // 0x378
	URichTextBlock* P3Name; // 0x380
	URichTextBlock* P3Title; // 0x388
	FLinearColor P3Tint; // 0x390
	UImage* P3LogoImage; // 0x3a0
	UCanvasPanel* P4Panel; // 0x3a8
	URichTextBlock* P4Name; // 0x3b0
	URichTextBlock* P4Title; // 0x3b8
	FLinearColor P4Tint; // 0x3c0
	UCanvasPanel* P5Panel; // 0x3d0
	URichTextBlock* P5Name; // 0x3d8
	URichTextBlock* P5Title; // 0x3e0
	FLinearColor P5Tint; // 0x3e8
	UCanvasPanel* P6Panel; // 0x3f8
	URichTextBlock* P6Name; // 0x400
	URichTextBlock* P6Title; // 0x408
	FLinearColor P6Tint; // 0x410
	URichTextBlock* WinnerTeamText; // 0x420
	URichTextBlock* DrawText; // 0x428
	URichTextBlock* WinnerPlayerText; // 0x430
	UImage* WinnerLogoImage; // 0x438
	UPanelWidget* WinnerBannerPanel; // 0x440
	UImage* DrawBannerImage; // 0x448
	UPanelWidget* PlayerBannerPanel; // 0x450
	UImage* PlayerIcon; // 0x458
	UCTDiscoveryNotificationWidget* DiscoveryNotificationWidget; // 0x460
};

struct UUserProfileWidget_C : UCTUserProfileWidget {
	UImage* BlackTransparentBG; // 0x340
	UImage* BottomArrowDecor; // 0x348
	UDefaultRichTextBlock_C* PlayerStatisticsText; // 0x350
	UImage* TopArrowDecor; // 0x358
};

struct UNiagaraSystem : UFXSystemAsset {
	bool bDumpDebugSystemInfo; // 0x30
	bool bDumpDebugEmitterInfo; // 0x31
	bool bRequireCurrentFrameData; // 0x33
	char bFixedBounds : 1; // 0x34
	UNiagaraEffectType* EffectType; // 0x38
	bool bOverrideScalabilitySettings; // 0x40
	TArray<FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x48
	FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x58
	TArray<FNiagaraEmitterHandle> EmitterHandles; // 0x68
	TArray<UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x78
	UNiagaraScript* SystemSpawnScript; // 0x88
	UNiagaraScript* SystemUpdateScript; // 0x90
	FNiagaraSystemCompiledData SystemCompiledData; // 0xa8
	FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x2c0
	FBox FixedBounds; // 0x388
	bool bAutoDeactivate; // 0x3a4
	float WarmupTime; // 0x3a8
	int32_t WarmupTickCount; // 0x3ac
	float WarmupTickDelta; // 0x3b0
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x3b4
	bool bNeedsGPUContextInitForDataInterfaces; // 0x3b5
	TArray<FName> UserDINamesReadInSystemScripts; // 0x3b8
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct UMovieSceneParameterSection : UMovieSceneSection {
	TArray<FBoolParameterNameAndCurve> BoolParameterNamesAndCurves; // 0xe8
	TArray<FScalarParameterNameAndCurve> ScalarParameterNamesAndCurves; // 0xf8
	TArray<FVector2DParameterNameAndCurves> Vector2DParameterNamesAndCurves; // 0x108
	TArray<FVectorParameterNameAndCurves> VectorParameterNamesAndCurves; // 0x118
	TArray<FColorParameterNameAndCurves> ColorParameterNamesAndCurves; // 0x128
	TArray<FTransformParameterNameAndCurves> TransformParameterNamesAndCurves; // 0x138
};

struct UCTInGameOptionsController : UCTOptionsController {
	UCTOptionsWidget* OptionsInGameWidgetClass; // 0x108
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x148
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x220
	TMap<UObject*, ULevelVariantSetsFunctionDirector*> DirectorInstances; // 0x238
};

struct ACTFreeRoamPawn : ASpectatorPawn {
	ACTBeastPawn* OriginBeast; // 0x2a8
};

struct UCTLocationDragonCellWidget : UCTNavigationWidget {
	UWidget* Owned; // 0x448
	UCTDefaultDragonCellWidget* DragonCell; // 0x450
	UWidget* Discovered; // 0x458
	UCTDefaultDragonCellWidget* DiscoveredCell; // 0x460
	UWidget* Secret; // 0x468
	UCTCollectionDragonCellWidget* SecretCell; // 0x470
	UWidget* Upcoming; // 0x478
	UCTCollectionDragonCellWidget* UpcomingCell; // 0x480
	UCTCollectionDragonCellWidget* DummyCell; // 0x488
	UWidgetSwitcher* ViewSwitcher; // 0x490
	UCTButtonStatesHolderWidget* ButtonStatesHolderWidget; // 0x498
	UCTLocationDragonCellState* CellState; // 0x4a0
};

struct UCTMissionsLiveEventQuestWidget : UCTLiveEventQuestWidget {
	UCTRewardWidget* RewardImage; // 0x388
};

struct UCTOptionsParameterSwitchCtrl : UCTOptionsParameterController {
	bool DefaultValue; // 0xd8
	UCTOptionsParameterSwitchWidget* ParameterWidgetClass; // 0xe0
};

struct UCTSocialUserIconWidget : UCTUserWidget {
	UTextBlock* IconText; // 0x2f0
	UImage* IconImage; // 0x2f8
};

struct USubmixEffectFlexiverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0xa0
};

struct ACTWeatherActor : AActor {
	USceneComponent* WeatherParticlesHolder; // 0x220
	UParticleSystemComponent* WeatherParticles; // 0x228
	float ParticlesFront; // 0x230
	float ParticlesUp; // 0x234
	bool bUseSpeedFactor; // 0x238
	float MaxSpeedFactor; // 0x23c
	bool bWeatherParticlesEnabled; // 0x240
};

struct UBTDecorator_DoesPathExist : UBTDecorator {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UABP_Menu_D01_C : UABP_Menu_D_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb08
};

struct UCTWeaponHUDWidget : UCTUserWidget {
	UCTWeapon* Weapon; // 0x2f0
	float WeaponHP; // 0x2f8
	FLinearColor HitFeedbackColor; // 0x2fc
	float CurrentFuelRatio; // 0x30c
	float CurrentAmmo; // 0x310
	bool bHaveTarget; // 0x314
	UCanvasPanel* CanvasMaster; // 0x318
	UCanvasPanel* CanvasDefault; // 0x320
	UCanvasPanel* CanvasDisabled; // 0x328
};

struct ABP_H02_Spear07_Molten_C : AACTFancyProp {
	UNiagaraComponent* FX_Fire_Spear_H02_07_3; // 0x228
	UNiagaraComponent* FX_Fire_Spear_H02_07_2; // 0x230
	UPointLightComponent* Li_Blade_3; // 0x238
	UStaticMeshComponent* Li_FakeVol_Blade_3; // 0x240
	UPointLightComponent* Li_Blade_2; // 0x248
	UStaticMeshComponent* Li_FakeVol_Blade_2; // 0x250
};

struct ABP_TeampoweredBillboard_C : AActor {
	UStaticMeshComponent* StaticMesh; // 0x220
	UCTBillboardComponent* CTBillboard; // 0x228
};

struct UPlayerIndicatorWidget_C : UCTPlayerIndicatorWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x5a0
	UWidgetAnimation* OnRevealed; // 0x5a8
	UWidgetAnimation* InvisRevealSelf; // 0x5b0
	UWidgetAnimation* OnInvisRevealed; // 0x5b8
	UWidgetAnimation* OnDamage; // 0x5c0
	UWidgetAnimation* PrePingAnim; // 0x5c8
	UWidgetAnimation* PingLoop; // 0x5d0
	UWidgetAnimation* StartPingAnim; // 0x5d8
	UWidgetAnimation* NotifTarget; // 0x5e0
	UWidgetAnimation* BrokenShieldAnimation2; // 0x5e8
	UWidgetAnimation* ShieldHitAnimation; // 0x5f0
	UWidgetAnimation* ShieldOutAnimation; // 0x5f8
	UWidgetAnimation* ShieldInAnimation; // 0x600
	UImage* Brok_L_2; // 0x608
	UImage* Brok_L_3; // 0x610
	UImage* Brok_L_4; // 0x618
	UImage* Brok_L_5; // 0x620
	UImage* Brok_R_2; // 0x628
	UImage* Brok_R_3; // 0x630
	UImage* Brok_R_4; // 0x638
	UImage* Brok_R_5; // 0x640
	UImage* FTLockAnim; // 0x648
	UImage* Gauge; // 0x650
	UImage* HPCountImage; // 0x658
	UImage* InvisRevealAnim; // 0x660
	UImage* InvisRevealAnimImage; // 0x668
	UVerticalBox* MainVBox; // 0x670
	UHorizontalBox* NameBox; // 0x678
	UCanvasPanel* PingedCanvas; // 0x680
	UCanvasPanel* PingingCanvas; // 0x688
	UImage* SpearFrame_2; // 0x690
	UImage* TargetNotifCircle; // 0x698
	UMaterialInstanceDynamic* BerserkIconMaterialInstance; // 0x6a0
	bool InPingAnimation; // 0x6a8
	int32_t ID; // 0x6ac
};

struct UCTFrozenComponent : UActorComponent {
	UCurveFloat* TargetYawSpeedMalusCurve; // 0xc0
	UCurveFloat* YawSpeedReactivityMalusCurve; // 0xc8
	UCurveFloat* TargetPitchSpeedMalusCurve; // 0xd0
	UCurveFloat* PitchSpeedReactivityMalusCurve; // 0xd8
	UCurveFloat* MalusDurationCurve; // 0xe0
	UCurveFloat* WeakMalusDurationCurve; // 0xe8
	TArray<EWeaponType> StopIcedDamageTypes; // 0xf0
	UParticleSystem* IcedParticles; // 0x100
	float VisualFreezeFadeDuration; // 0x108
	UParticleSystemComponent* IcedParticlesComponent; // 0x110
	USoundBase* IcedSoundLoop; // 0x118
	UAudioComponent* IcedSoundLoopComponent; // 0x120
	TArray<UMaterialInstanceDynamic*> BodyMaterials; // 0x128
};

struct UCTLevelIconWidget : UCTUserWidget {
	UTextBlock* LevelText; // 0x2f0
	UImage* LevelImage; // 0x2f8
};

struct UHomeChestDetailPageWidget_C : UCTChestDetailPageWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWidgetAnimation* Hide; // 0x348
	UWidgetAnimation* Show; // 0x350
	UImage* BG; // 0x358
	UChestDetailIconWidget_C* ChestDetailIconWidget; // 0x360
	UChestDetailIconWidget_C* ChestDetailIconWidget_2; // 0x368
	UChestDetailIconWidget_C* ChestDetailIconWidget_3; // 0x370
	UChestDetailIconWidget_C* ChestDetailIconWidget_4; // 0x378
	UChestDetailIconWidget_C* ChestDetailIconWidget_5; // 0x380
	UChestDetailIconWidget_C* ChestDetailIconWidget_6; // 0x388
	UCTNavigationLayer* CTChestDetailedNavigationLayer; // 0x390
	UImage* Image_602; // 0x398
	UCanvasPanel* TitlePanel; // 0x3a0
};

struct UVariantObjectBinding : UObject {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct UCTTeamDeathmatchScoreHUDWidget : UCTGameModeScoreHUDWidget {
	TArray<UTextBlock*> ScoreTeam; // 0x2f8
	UImage* SuddenDeathScoreboard; // 0x308
	UCTBountyWidget* BountyWidget; // 0x310
	UImage* Coat0; // 0x318
	UImage* ScoreBG0; // 0x320
	UImage* Coat1; // 0x328
	UImage* ScoreBG1; // 0x330
	UImage* Coat2; // 0x338
	UImage* ScoreBG2; // 0x340
	URichTextBlock* BlueScorePlayerName; // 0x348
	URichTextBlock* RedScorePlayerName; // 0x350
	URichTextBlock* BlueScoreAmount; // 0x358
	URichTextBlock* RedScoreAmount; // 0x360
	UImage* ScoreboardImage; // 0x368
	TArray<UImage*> Coats; // 0x370
	TArray<UImage*> ScoreBGs; // 0x380
};

struct UCT3DMarkerWidget : UCTUserWidget {
	UTextBlock* NameText; // 0x2f0
	UCanvasPanel* ArrowPanel; // 0x2f8
	UImage* PinImage; // 0x300
	UImage* SpawnAnimSprite; // 0x308
	bool InScreen; // 0x310
	UCanvasPanel* RootCanvas; // 0x318
	float PinOffset; // 0x320
	int8_t SpawnAnimLoops; // 0x324
};

struct UCTDragonDescriptionWidget : UCTUserWidget {
	UCTRichTextBlock* DragonName; // 0x308
	UCTRichTextBlock* DragonLocation; // 0x310
	UCTRichTextBlock* FirstAppearanceSeason; // 0x318
	UCTAutoScrollBox* DescriptionTextAutoScrollBox; // 0x320
	UTextBlock* ProgressionText; // 0x328
	UImage* RarityIndicator; // 0x330
	UImage* ProgressionGauge; // 0x338
	UCTDragonOverviewButton* DragonOverviewButton; // 0x340
	USizeBox* OwningHolder; // 0x348
	USizeBox* DiscoveredHolder; // 0x350
	UScaleBox* DragonCellHolder; // 0x358
	UWidget* LocationMainHolder; // 0x360
	TArray<FKey> ShowDragonShortcuts; // 0x368
};

struct UCTDiscordCodeLine : UCTNavigationWidget {
	UTextBlock* PackNameText; // 0x458
	UEditableText* CodeText; // 0x460
	UCTBreadcrumbWidget* BreadcrumbWidget; // 0x468
	FString BreadcrumbPathChunk; // 0x470
};

struct UCTSocialDataAsset : UDataAsset {
	TSoftObjectPtr<UTexture2D> InvalidLevelTexture; // 0x30
	TSoftObjectPtr<UTexture2D> InvalidRankTexture; // 0x58
	UCTFriendsDataAsset* FriendsDB; // 0x80
};

struct UInterpTrackToggle : UInterpTrack {
	TArray<FToggleTrackKey> ToggleTrack; // 0x70
	char bActivateSystemEachUpdate : 1; // 0x80
	char bActivateWithJustAttachedFlag : 1; // 0x80
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	char bProxyIsJumpForceApplied : 1; // 0x330
	char bPressedJump : 1; // 0x330
	char bClientUpdating : 1; // 0x330
	char bClientWasFalling : 1; // 0x330
	char bClientResimulateRootMotion : 1; // 0x330
	char bClientResimulateRootMotionSources : 1; // 0x330
	char bSimGravityDisabled : 1; // 0x330
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331
	char bServerMoveIgnoreRootMotion : 1; // 0x331
	char bWasJumping : 1; // 0x331
	float JumpKeyHoldTime; // 0x334
	float JumpForceTimeRemaining; // 0x338
	float ProxyJumpForceStartedTime; // 0x33c
	float JumpMaxHoldTime; // 0x340
	int32_t JumpMaxCount; // 0x344
	int32_t JumpCurrentCount; // 0x348
	int32_t JumpCurrentCountPreJump; // 0x34c
	FMulticastInlineDelegate OnReachedJumpApex; // 0x358
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x378
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x388
	FRootMotionSourceGroup SavedRootMotion; // 0x398
	FRootMotionMovementParams ClientRootMotionParams; // 0x3d0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410
	FRepRootMotionMontage RepRootMotion; // 0x420
};

struct UBTTask_RunBehavior : UBTTaskNode {
	UBehaviorTree* BehaviorAsset; // 0x70
};

struct UMaterialExpressionLandscapeVisibilityMask : UMaterialExpression {
	FGuid ExpressionGUID; // 0x40
};

struct UABP_H03_Cape02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UCurrencyButton_C : UCTNavigationWidget {
	UCTButton* ChildButton; // 0x440
};

struct UScrollingItemsSubTabWidget_C : UCTItemsSubTabWidget {
	UUniformGridPanel* ButtonsContainer; // 0x450
	UImage* Image_189; // 0x458
	UScrollBox* ScrollBox_149; // 0x460
	UShopItemsNavigationButton_C* ShopItemsNavigationButton; // 0x468
	UShopItemsNavigationButton_C* ShopItemsNavigationButton_130; // 0x470
	UShopItemsNavigationButton_C* ShopItemsNavigationButton_210; // 0x478
	UShopItemsNavigationButton_C* ShopItemsNavigationButton_297; // 0x480
};

struct ULiveLinkInstance : UAnimInstance {
	ULiveLinkRetargetAsset* CurrentRetargetAsset; // 0x2b8
};

struct UCTPlayerWidgetAccessory : UCTUserWidget {
	ACTBeastPawn* pTargetPawn; // 0x2f0
	EPlayerWidgetAttachType AttachPolicy; // 0x2f9
};

struct UCTPortraitWidget : UCTUserWidget {
	UCanvasPanel* Portrait; // 0x2f0
	UCanvasPanel* EmptyPortrait; // 0x2f8
	UImage* RenderTexture; // 0x300
	UCanvasPanel* RootPanel; // 0x308
	UImage* CardStroke; // 0x310
	UImage* CardSelect; // 0x318
	UImage* EmptyStroke; // 0x320
	UImage* PlayerShadow; // 0x328
	UImage* EmptyBackground; // 0x330
	UTextBlock* WaitingForPlayerText; // 0x338
	UImage* PlayerClassIcon; // 0x340
	UImage* PlayerIcon; // 0x348
	UCanvasPanel* LevelingBox; // 0x350
	UCTRankIconWidget* RankWidget; // 0x358
	UCanvasPanel* AbilitiesPanel; // 0x360
	UImage* AbilitieIcon; // 0x368
	UTextBlock* AbilitieText; // 0x370
	UCanvasPanel* WaitingPlayerPanel; // 0x378
	UTextBlock* PlayerName; // 0x380
	UCanvasPanel* BoosterBlock; // 0x388
	UTextBlock* BoosterValue; // 0x390
	UTextBlock* BoosterText; // 0x398
	UImage* BoosterGoldIcon; // 0x3a0
	UImage* BoosterGrayIcon; // 0x3a8
	FLinearColor BoosterOnColor; // 0x3b0
	FLinearColor BoosterOffColor; // 0x3c0
	UMaterial* NoClassSelectedMaterial; // 0x3d0
	UMaterialInstanceDynamic* NoClassDynMaterial; // 0x3d8
	int32_t DesiredTeamIdColor; // 0x3e0
	UMaterialInstanceDynamic* RenderMaterial; // 0x3e8
};

struct ACTTutorialGameMode : ACTGameModeBase {
	TArray<FPlayerTeam> Teams; // 0x3c8
	bool bHideAirColumnsOnStart; // 0x3d8
	bool bDisableBoostRefillsOnStart; // 0x3d9
	bool bHideShieldsOnStart; // 0x3da
	bool bHideWindBlessingsOnStart; // 0x3db
};

struct UCTValidateTooltip : UCTUserWidget {
	FMargin ToolTipPadding; // 0x300
	UWidget* MainCanvasPanel; // 0x310
	UHorizontalBox* TooltipsHolder; // 0x318
	TArray<FKeyToolTipData> Tooltips; // 0x320
	UUserWidget* ToolTipEntryWidgetClass; // 0x330
	ETooltipVisibilityMode VisibilityMode; // 0x338
};

struct UABP_D03_Tail03_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FSlateColor ColorAndOpacity; // 0x150
	FDelegate ColorAndOpacityDelegate; // 0x178
	FSlateFontInfo Font; // 0x188
	FSlateBrush StrikeBrush; // 0x1e0
	FVector2D ShadowOffset; // 0x268
	FLinearColor ShadowColorAndOpacity; // 0x270
	FDelegate ShadowColorAndOpacityDelegate; // 0x280
	float MinDesiredWidth; // 0x290
	bool bWrapWithInvalidationPanel; // 0x294
	bool bAutoWrapText; // 0x295
	ETextTransformPolicy TextTransformPolicy; // 0x296
	bool bSimpleTextMode; // 0x297
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UFriendsInvitationSectionWidget_C : UCTFriendsInvitationSectionWidget {
	UImage* Arrow; // 0x318
	UImage* Separator; // 0x320
};

struct ACTBattleGameMode : ACTGameModeBase {
	TArray<FPlayerTeam> Teams; // 0x3c8
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x90
	FMovieScenePropertyBinding PropertyBinding; // 0x98
	TArray<UMovieSceneSection*> Sections; // 0xb0
};

struct ABP_Chest_Piedestal_C : ATickInEditorActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UPointLightComponent* Li_Rune_Side_Piedestal_7; // 0x228
	UPointLightComponent* Li_Rune_Side_Piedestal_6; // 0x230
	UPointLightComponent* Li_Rune_Side_Piedestal_5; // 0x238
	UPointLightComponent* Li_Rune_Side_Piedestal_4; // 0x240
	UPointLightComponent* Li_Rune_Side_Piedestal_3; // 0x248
	UPointLightComponent* Li_Rune_Side_Piedestal_2; // 0x250
	UPointLightComponent* Li_Rune_Side_Chest; // 0x258
	UPointLightComponent* Li_Rune_Front_Chest; // 0x260
	UStaticMeshComponent* ST_ENV_ARC_CPT_AncientPedestal01_A; // 0x268
	UMaterialInstanceDynamic* MID_Rune; // 0x270
	FLinearColor Emissive_Color; // 0x278
	float Emissive_Mask_Contrast; // 0x288
	float Emissive_Intensity; // 0x28c
	float Emissive_Mask_Position; // 0x290
	FLinearColor Rune Color; // 0x294
	float Light_Rune_Side_Piedestal_Intensity; // 0x2a4
};

struct UCTDragonOverviewController : UCTShowroomControllerBase {
	TArray<FName> PermanentStreamLevels; // 0x1b8
	FCTDragonOverviewStateAdultData AdultData; // 0x1c8
	FCTDragonOverviewStateEggData EggData; // 0x1f0
	FCTDragonOverviewStateBabyData BabyData; // 0x210
	ECTDragonOverviewType DefaultOverviewType; // 0x240
	UCTDragonOverviewWidget* DragonOverviewWidget; // 0x248
	UCTCharacClassesData* CharacterClassDB; // 0x250
	UCTPackageDB* PackageDB; // 0x258
	UCTDragonOverviewStateBase* CurrentState; // 0x260
	TMap<ECTDragonOverviewType, UCTDragonOverviewStateButton*> StateButtons; // 0x268
};

struct UCTFireballHitWorkshop : UCTAISpawningWorkshop {
	int32_t FireBallsToHit; // 0x1d0
};

struct ACTRookiePlayerState : ACTPlayerState {
	bool HasPrematch; // 0x4e8
};

struct UCTStateIconBehaviour : UObject {
	float CurrentPercentage; // 0x28
	int32_t Munition; // 0x2c
	FString AdditionalText; // 0x30
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct UCTOptionsAxisShortcutController : UCTOptionsParameterShortcutCtrl {
	bool IsPositiveDirection; // 0x190
};

struct UCullingField : UFieldNodeBase {
	UFieldNodeBase* Culling; // 0xb0
	UFieldNodeBase* Field; // 0xb8
	EFieldCullingOperationType Operation; // 0xc0
};

struct UCTSocialController : UCTWidgetWithTabController {
	UCTFriendsController* FriendsControllerClass; // 0xa0
	UCTGroupController* GroupControllerClass; // 0xa8
	UCTAddFriendsController* AddFriendsControllerClass; // 0xb0
	UCTFriendsController* FriendsTab; // 0xb8
	UCTGroupController* GroupTab; // 0xc0
	UCTAddFriendsController* AddFriendsTab; // 0xc8
	UCTSocialWidget* SocialWidget; // 0xd0
};

struct ULevelCapture : UMovieSceneCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct UMaterialExpressionMultiply : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
};

struct UGizmoLineHandleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x470
	float HandleSize; // 0x47c
	float Thickness; // 0x480
	FVector Direction; // 0x484
	float Length; // 0x490
	bool bImageScale; // 0x494
};

struct ABP_H04_DisplaySet_C : ABP_DefaultRiderCustoDisplaySet_C {
	USpotLightComponent* Li_H03_AddLight_Face; // 0x4e8
	USpotLightComponent* Li_H03_AddLight_Shield; // 0x4f0
};

struct UAnimNotify_CustomNiagara_C : UAnimNotify {
	UNiagaraSystem* NiagaraSystem; // 0x38
	FTransform Offset; // 0x40
	bool bAttached; // 0x70
	FName Socket; // 0x74
	TMap<FName, float> FloatParameters; // 0x80
	TMap<FName, bool> BoolParameters; // 0xd0
};

struct UShopRessourceNavigationButton_C : UCTResourceShopButtonWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x478
	UWidgetAnimation* CannotBuyAnimation; // 0x480
	UWidgetAnimation* BuyAnimation; // 0x488
	UImage* ButtonSelectorImage; // 0x490
	UCTButton* ShopButton; // 0x498
};

struct UShopExclusiveEventPackageWidget_C : UCTExclusiveShopPackageWidget {
	UWidgetAnimation* CannotBuyAnimation; // 0x690
	UWidgetAnimation* BuyAnimation; // 0x698
	UImage* ButtonFrameImage; // 0x6a0
	UImage* Image_90; // 0x6a8
	UImage* Image_117; // 0x6b0
	UImage* ItemImage; // 0x6b8
};

struct ABP_DartTrapArrow_C : ACTDartTrapArrow {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
};

struct UControllerIcon_C : UCTControllerIconWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UCTKeyIcon* Icon; // 0x340
};

struct UBaseMediaSource : UMediaSource {
	FName PlayerName; // 0x80
};

struct UCTKeyToIconPlatformDataAsset : UDataAsset {
	TMap<FKey, FSlateBrush> Data; // 0x30
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xf0
	FMovieSceneFloatChannel LeftCurve; // 0x190
	FMovieSceneFloatChannel RightCurve; // 0x230
	FMovieSceneFloatChannel BottomCurve; // 0x2d0
};

struct UMovieSceneSequence : UMovieSceneSignedObject {
	UMovieSceneCompiledData* CompiledData; // 0x50
	EMovieSceneCompletionMode DefaultCompletionMode; // 0x58
	bool bParentContextsAreSignificant; // 0x59
	bool bPlayableDirectly; // 0x5a
	EMovieSceneSequenceFlags SequenceFlags; // 0x5b
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x450
	char bEnableMaterialParameterCaching : 1; // 0x470
};

struct UABP_D03_TreasureDragon_C : UCTTreasureDragonAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	FAnimNode_Root AnimGraphNode_Root; // 0x2f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x328
	FVector2D BlendSpaceFixed; // 0x410
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UInputKeySelector : UWidget {
	FButtonStyle WidgetStyle; // 0x108
	FTextBlockStyle TextStyle; // 0x380
	FInputChord SelectedKey; // 0x5f0
	FSlateFontInfo Font; // 0x610
	FMargin Margin; // 0x668
	FLinearColor ColorAndOpacity; // 0x678
	FText KeySelectionText; // 0x688
	FText NoKeySpecifiedText; // 0x6a0
	bool bAllowModifierKeys; // 0x6b8
	bool bAllowGamepadKeys; // 0x6b9
	TArray<FKey> EscapeKeys; // 0x6c0
	FMulticastInlineDelegate OnKeySelected; // 0x6d0
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6e0
};

struct UHoudiniInputHoudiniAsset : UHoudiniInputObject {
	int32_t AssetOutputIndex; // 0xa8
};

struct UCTBlastDamageFeedbackComponent : UActorComponent {
	UCTMoveComponent* TargetMoveComp; // 0xb0
	UCameraComponent* TargetCameraComp; // 0xb8
	UMaterialInstanceDynamic* CameraPPMaterial; // 0xc0
	FBlastFeedbackData BlastData; // 0xc8
	FBlastFeedbackData RavagerRushData; // 0x110
	FBlastFeedbackData ShockwaveData; // 0x158
	bool BlastAfterImpulse; // 0x1a0
};

struct UCTCreditsParagraphWidget : UCTUserWidget {
	UTextBlock* Title; // 0x2f0
	UVerticalBox* RecordsContainer; // 0x2f8
};

struct UCTBoosterActivationWidget : UCTNavigationPage {
	ECTTextureFormat ImageFormat; // 0x308
	UImage* ItemImage; // 0x310
	URichTextBlock* Acquired; // 0x318
	UTextBlock* Activated; // 0x320
	UTextBlock* NameText; // 0x328
	UTextBlock* DescriptionText; // 0x330
	URichTextBlock* FullDescriptionText2; // 0x338
	UCTNavigationWidget* BackButton; // 0x340
	UCTBoosterMoreItemWidget* More; // 0x348
	UWidget* HoverWidget; // 0x350
	UWidget* MoreWidget; // 0x358
	UWidget* RightPanel; // 0x360
	UWidget* ActiveBoosterPanel; // 0x368
	UWidget* ActiveBoosterWidget; // 0x370
	UTextBlock* ActivatedBooster; // 0x378
	URichTextBlock* ActiveRemainingText; // 0x380
	UCTActivateBoosterButton* ActivateButton; // 0x388
	UCTNavigationWidget* DisabledActivateButton; // 0x390
	UCTRichTextBlock* ActivateBooster; // 0x398
};

struct UCTWeaponFireballHUDWidget : UCTWeaponHUDWidget {
	UCTAmmoSlotWidget* AmmoImageClass; // 0x330
	UPanelWidget* AmmoBox; // 0x338
	UImage* CrosshairR; // 0x340
	UImage* CrosshairL; // 0x348
	UWidget* AmmoPannel; // 0x350
	UWidget* InfiniteSign; // 0x358
	TArray<FCrosshairSet> CrosshairSets; // 0x360
	EFireballCrosshairType CurrentCrosshairType; // 0x370
	FLinearColor MinCrosshairColor; // 0x388
	FLinearColor MaxCrosshairColor; // 0x398
};

struct UCTWeaponMine : UCTWeapon {
	int32_t MaxAliveMines; // 0x158
};

struct UPhysicalMaterialMask : UObject {
	int32_t UVChannelIndex; // 0x28
	TextureAddress AddressX; // 0x2c
	TextureAddress AddressY; // 0x2d
};

struct UCTPlayTabNewButtonWidget : UCTNavigationWidget {
	FString BreadcrumbPathChunk; // 0x458
	FString LocalizedTitle; // 0x468
	EPlayerCountForGameMode PlayerCount; // 0x478
	EHoverAnimation HoverAnimation; // 0x479
	FString LocalizedDescription; // 0x480
	FSlateBrush OutlineBrush; // 0x490
	FSlateBrush BackgroundBrush; // 0x518
	FSlateBrush ButtonDescriptionBrush; // 0x5a0
	FSlateBrush ButtonDescriptionBrushHover; // 0x628
	FSlateBrush ButtonDescriptionBrushPressed; // 0x6b0
	FSlateBrush ButtonCloseDescriptionBrush; // 0x738
	FSlateBrush ButtonCloseDescriptionBrushHover; // 0x7c0
	FSlateBrush ButtonCloseDescriptionBrushPressed; // 0x848
	TArray<UCTModeIcon*> ModeIcons; // 0x8d0
	EStretch BackgroundStretch; // 0x8e0
	UPanelWidget* ModeIconsContainer; // 0x8e8
	UPanelWidget* SecondaryModeIconsContainer; // 0x8f0
	UCTModeIcon* ModeIconsClass; // 0x8f8
	TArray<ECTMatchType> MatchTypeIcons; // 0x900
	FSlateBrush IconBrush; // 0x910
	FSlateBrush IconDisabledBrush; // 0x998
	bool ShowCrownWidget; // 0xa20
	UCanvasPanel* DeactivableCanvas; // 0xa28
	UCTRichTextBlock* ButtonTitle; // 0xa30
	UTextBlock* ButtonPlayerCountText; // 0xa38
	UCTRichTextBlock* ButtonDescription; // 0xa40
	UCTRichTextBlock* ButtonDescriptionTitle; // 0xa48
	UCTRichTextBlock* LockedButtonText; // 0xa50
	UImage* ButtonOutline; // 0xa58
	UCanvasPanel* BackgroundCanvas; // 0xa60
	UCanvasPanel* ContentCanvas; // 0xa68
	UCanvasPanel* DescriptionCanvas; // 0xa70
	UImage* BackgroundImage; // 0xa78
	UWidget* PlayButtonBorder; // 0xa80
	UScaleBox* BackgroundScaleBox; // 0xa88
	UCTButton* MainButton; // 0xa90
	UCTButton* DescriptionButton; // 0xa98
	UCTDynamicSquadIcon* CrownWidget; // 0xaa0
	UWidget* BreadcrumbContainer; // 0xaa8
	UWidgetAnimation* HoverAnimation_Zoom; // 0xab0
	UWidgetAnimation* HoverAnimation_ZoomSmall; // 0xab8
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x678
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x688
	FGuid GenerationGuid; // 0x698
};

struct UABP_H03_Cape05_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UCTLocationTabController : UCTCollectionSubTabController {
	UCTItemDB* ItemDB; // 0xa8
	UCTCharacClassesData* CharacterClassDB; // 0xb0
	UCTLocationDataAsset* LocationItemDB; // 0xb8
	UCTPackageDB* PackageDB; // 0xc0
	bool bFetchAllAvailableFilterLocationValues; // 0xc8
	TArray<EPWCollectionSource> LocationFilterSpecificValues; // 0xd0
	bool bFetchAllAvailableFilterClassValues; // 0xe0
	TArray<ECharacClassType> ClassFilterSpecificValues; // 0xe8
	bool bFetchAllAvailableFilterKnowledgeValues; // 0xf8
	TArray<ECollectionDragonStatus> KnowledgeFilterSpecificValues; // 0x100
	UCTLocationTabWidget* LocationTabWidget; // 0x110
	UCTFilterWidgetController* FilterWidgetControllerClass; // 0x118
	int32_t MinDragonCellsItemToShow; // 0x120
	UCTFilterWidgetController* LocationFilterController; // 0x128
	UCTFilterWidgetController* ClassFilterController; // 0x130
	UCTFilterWidgetController* KnowledgeFilterController; // 0x138
	TArray<FCTCollectionDragonItemData> DragonItems; // 0x140
	UCTNavigationWidget* CurrentSelectedDragonCell; // 0x150
	TMap<UCTFilterWidgetController*, FCTFilterPredicate> ActiveFilters; // 0x158
};

struct UGetDiscordCodeButtonWidget_C : UCTDiscordButtonWidget {
	UBreadcrumbWidget_C* BreadcrumbWidget; // 0x650
	UCTButton* CTButton_338; // 0x658
};

struct ACTDartTrap : ACTBaseNPCActor {
	float HealthInitValue; // 0x288
	int32_t CTPlayerId; // 0x28c
	USphereComponent* MineRoot; // 0x290
	UStaticMeshComponent* TriggerZoneComp; // 0x298
	UStaticMeshComponent* MineMeshComp; // 0x2a0
	UCTProjectileComponent* ProjectileComponent; // 0x2a8
	FPawnDetection PawnDetection; // 0x2b0
	FDartTrapSettings DartTrapSettings; // 0x328
	FLinearColor FriendlyColor; // 0x350
	FLinearColor OpponentColor; // 0x360
	FLinearColor TriggeredBlinkColor; // 0x370
	UParticleSystem* FallingPS; // 0x380
	UParticleSystemComponent* FallingPSComp; // 0x388
	USoundBase* ThrowSound; // 0x390
	USoundBase* AnchorSound; // 0x398
	USoundBase* TriggerSound; // 0x3a0
	UCTOpponentUIComponent* OpponentUIComp; // 0x3a8
	int32_t CurrentAmmo; // 0x3e8
};

struct UShopTabButton_C : UTabBarMenuButtonWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4a0
	UCTButton* ChildButton; // 0x4a8
	UTextBlock* ChildButtonText; // 0x4b0
	UImage* Image_128; // 0x4b8
	FLinearColor OpenBackgroundColor; // 0x4c0
	FLinearColor DefaultBackgroundColor; // 0x4d0
};

struct UNiagaraRendererProperties : UNiagaraMergeable {
	FNiagaraPlatformSet Platforms; // 0x28
	int32_t SortOrderHint; // 0x58
	ENiagaraRendererMotionVectorSetting MotionVectorSetting; // 0x5c
	bool bIsEnabled; // 0x60
	bool bMotionBlurEnabled; // 0x61
};

struct UCollectionMapPoint_Upcoming_Unselected_Pressed_C : UCTCollectionMapPointStateWidget {
	UImage* NewPointImage; // 0x2f0
};

struct UCTGameModeDB : UDataAsset {
	TArray<FGameModeData> GameModeData; // 0x30
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct UCTEndMatchQuestXPAndCurrWdgt : UCTEndMatchQuestWidget {
	URichTextBlock* XPValueText; // 0x368
	URichTextBlock* CurrencyValueText; // 0x370
};

struct ACTMenuCharacter : AActor {
	USkeletalMeshComponent* PosingMesh; // 0x228
	USkeletalMeshComponent* PoseModel; // 0x230
	USkeletalMeshComponent* Helmet; // 0x238
	USkeletalMeshComponent* UpperBody; // 0x240
	USkeletalMeshComponent* LowerBody; // 0x248
	USkeletalMeshComponent* Hands; // 0x250
	USkeletalMeshComponent* Accessory; // 0x258
	USkeletalMeshComponent* Horns; // 0x260
	USkeletalMeshComponent* Cape; // 0x268
	USkeletalMeshComponent* Body; // 0x270
	USkeletalMeshComponent* Head; // 0x278
	USkeletalMeshComponent* Torso; // 0x280
	USkeletalMeshComponent* Tail; // 0x288
	USkeletalMeshComponent* Harness; // 0x290
	UCTLeashMeshComponent* LeashMeshComponent; // 0x298
	UStaticMeshComponent* ShieldMesh; // 0x2a0
	UStaticMeshComponent* QuiverMesh; // 0x2a8
	UStaticMeshComponent* QuiverEmptyMesh; // 0x2b0
	UStaticMeshComponent* WeaponHandLeftMesh; // 0x2b8
	UStaticMeshComponent* WeaponHandRightMesh; // 0x2c0
	USkeletalMeshComponent* FXMesh; // 0x2c8
	EIdleState IdleState; // 0x2d0
	UCTCustomizationComponent* CustomizationComp; // 0x2d8
	UCTMorphControllerComponent* MorphcontrollerComponent; // 0x2e0
};

struct UNiagaraDataInterfaceMeshRendererInfo : UNiagaraDataInterface {
	UNiagaraMeshRendererProperties* MeshRenderer; // 0x38
};

struct UCTGenericCanvasCarouselWidget : UCTCanvasCarouselPackageWidget {
	bool ForwardSwap; // 0x358
	float SwapPeriod; // 0x35c
	float TimeFromLastSwap; // 0x360
	UCTCarouselShopPackageWidget* CarouselBackground; // 0x368
	UCTGenericCanvasCarouselFrame* CarouselFrame; // 0x370
};

struct UCTEndMatchProgressWidgetBase : UCTUserWidget {
	UProgressBar* XPGauge; // 0x2f0
	UProgressBar* XPGaugeStep; // 0x2f8
	UTextBlock* IndicatedXpTxt; // 0x300
	UScaleBox* GlowImage; // 0x308
	UCTFullLengthSlider* GaugeCursorFX; // 0x310
	float IndicationAnimationSpeed; // 0x318
};

struct UCTNotificationWithButtonAndImage : UCTNotificationWithImageButton {
	UCTNotificationSmallButtonWidget* ButtonOne; // 0x498
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1f8
	int32_t VirtualUserIndex; // 0x218
	int32_t PointerIndex; // 0x21c
	ECollisionChannel TraceChannel; // 0x220
	float InteractionDistance; // 0x224
	EWidgetInteractionSource InteractionSource; // 0x228
	bool bEnableHitTesting; // 0x229
	bool bShowDebug; // 0x22a
	float DebugSphereLineThickness; // 0x22c
	float DebugLineThickness; // 0x230
	FLinearColor DebugColor; // 0x234
	FHitResult CustomHitResult; // 0x2c0
	FVector2D LocalHitLocation; // 0x348
	FVector2D LastLocalHitLocation; // 0x350
	UWidgetComponent* HoveredWidgetComponent; // 0x358
	FHitResult LastHitResult; // 0x360
	bool bIsHoveredWidgetInteractable; // 0x3e8
	bool bIsHoveredWidgetFocusable; // 0x3e9
	bool bIsHoveredWidgetHitTestVisible; // 0x3ea
};

struct UPostProcessComponent : USceneComponent {
	FPostProcessSettings Settings; // 0x200
	float Priority; // 0x760
	float BlendRadius; // 0x764
	float BlendWeight; // 0x768
	char bEnabled : 1; // 0x76c
	char bUnbound : 1; // 0x76c
};

struct UMagicLeapARPinSaveGame : USaveGame {
	FGuid PinnedID; // 0x28
	FTransform ComponentWorldTransform; // 0x40
	FTransform PinTransform; // 0x70
	bool bShouldPinActor; // 0xa0
};

struct UCTPlayerAccountManager : UGameInstanceSubsystem {
	ESaveGameStatus Status; // 0x878
};

struct UCTRavagerAimHelper : UCTPlayerWidgetAccessory {
	UImage* RushImage; // 0x300
	UCTScalableKeyIcon* KeyIcon; // 0x308
	UCanvasPanel* ContainerCanvas; // 0x310
	AActor* pTargetActor; // 0x318
	FVector2D ActorAttachedAlignment; // 0x320
	FVector2D ActorAttachedPosition; // 0x328
	FAnchors ActorAttachedAnchors; // 0x330
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct UCTMouseControlFeedbackWidget : UCTUserWidget {
	UImage* MouseFeedbackImage; // 0x2f0
	FVector2D CurrentDirection; // 0x2f8
	float SmoothFactor; // 0x300
};

struct UCTOptionsLinkTabController : UCTWidgetController {
	FString PasswordCharacterWhenSet; // 0x90
	FString PasswordCharacterWhenNotSet; // 0xa0
	int32_t PasswordCharactersCount; // 0xb0
};

struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UCTNetSpawnerComponent : UActorComponent {
	int32_t MyCTPlayerId; // 0xd0
	TArray<FCTComSpawnerTypeContainer> TabSpawnerCom; // 0xd8
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UReplaySubsystem : UGameInstanceSubsystem {
	bool bLoadDefaultMapOnStop; // 0x30
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct ULevellingNextRewardProfileWidget_C : UCTRewardWidget {
	UImage* BackgroundImage; // 0x340
};

struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct USynthComponentMoto : USynthComponent {
	UMotoSynthPreset* MotoSynthPreset; // 0x6c0
	float RPM; // 0x6c8
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct ACTProjectile : AActor {
	bool bLocallyDodged; // 0x220
	UCTDamageDealerComponent* DamageComp; // 0x228
	bool bExploded; // 0x230
};

struct UCTQuestCompletedNotification : UCTNotificationButton {
	UCTQuestWidget* OtherQuest; // 0x488
	UCTQuestWidget* DailyQuest; // 0x490
	UCTQuestWidget* NestQuest; // 0x498
};

struct UABP_H02_Head10_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x510
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x5d0
};

struct UMainMenuTabButton_C : UTabBarMenuButtonWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4a0
	UHorizontalBox* BackgroundHighlighted; // 0x4a8
	UHorizontalBox* BackgroundHover; // 0x4b0
	UHorizontalBox* BackgroundPressed; // 0x4b8
	UBreadcrumbWidget_C* BreadcrumbWidget; // 0x4c0
	UCTButton* ChildButton; // 0x4c8
	UImage* LeftTextureImage_Hover; // 0x4d0
	UImage* LeftTextureImage_Pressed; // 0x4d8
	UImage* MiddleTextureImage_Hover; // 0x4e0
	UImage* MiddleTextureImage_Pressed; // 0x4e8
	UImage* RightTextureImage_Hover; // 0x4f0
	UImage* RightTextureImage_Pressed; // 0x4f8
	USimpleNotificationBadge_C* SimpleNotificationBadge; // 0x500
	FSlateFontInfo DefaultFont; // 0x508
	FSlateFontInfo OngletSelectFont; // 0x560
	FSlateColor HoverTextColor; // 0x5b8
	FSlateColor DefaultTextColor; // 0x5e0
	FButtonStyle ButtonStyle; // 0x608
	FLinearColor DefaultBackgroundColor; // 0x880
	FLinearColor OpenBackgroundColor; // 0x890
	FFontParameterValue FontOver; // 0x8a0
	FSlateColor TextColorHover; // 0x8d0
	FSlateColor TextColorUnhover; // 0x8f8
	bool NotificationBadge; // 0x920
	FSlateBrush HighlightedHoverBrushLeft; // 0x928
	FSlateBrush HighlightedHoverBrushMiddle; // 0x9b0
	FSlateBrush HighlightedHoverBrushRight; // 0xa38
	FSlateBrush HighlightedPressedBrushLeft; // 0xac0
	FSlateBrush HighlightedPressedBrushMiddle; // 0xb48
	FSlateBrush HighlightedPressedBrushRight; // 0xbd0
	FSlateBrush DefaultHoverBrushLeft; // 0xc58
	FSlateBrush DefaultHoverBrushMiddle; // 0xce0
	FSlateBrush DefaultHoverBrushRight; // 0xd68
	FSlateBrush DefaultPressedBrushLeft; // 0xdf0
	FSlateBrush DefaultPressedBrushMiddle; // 0xe78
	FSlateBrush DefaultPressedBrushRight; // 0xf00
};

struct UPlayerProfileTabBar_C : UCTPlayerProfileNavigationTabBar {
	UControllerIcon_C* ControllerIcon_Next_2; // 0x370
	UControllerIcon_C* ControllerIcon_Previous_2; // 0x378
	UImage* Image_3; // 0x380
	UImage* Image_4; // 0x388
	UImage* Image_24; // 0x390
	UImage* Image_81; // 0x398
	UImage* Image_92; // 0x3a0
	UImage* Image_122; // 0x3a8
	UMainMenuTabButton_C* MainMenuTabButton; // 0x3b0
};

struct USocialEditBoxWidget_C : UCTNavEditBox {
	UCTButton* HighlightButton; // 0x510
	FButtonStyle NewVar_1; // 0x518
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x220
};

struct UVectorFieldComponent : UPrimitiveComponent {
	UVectorField* VectorField; // 0x450
	float Intensity; // 0x458
	float Tightness; // 0x45c
	char bPreviewVectorField : 1; // 0x460
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UCTShopItemDB : UDataAsset {
	TArray<FShopItem> Items; // 0x30
	TArray<FShopResourceItem> Resources; // 0x40
	TArray<FShopClassItem> Classes; // 0x50
	TArray<FEggItem> Eggs; // 0x60
	UCTBodyPartDBs* BodyParts; // 0x70
	TArray<FString> DefaultItemUID; // 0x78
	TArray<FString> DefaultEggsUID; // 0x88
	TArray<FString> Titles; // 0x98
	TArray<FShopResourceItem> PlayerProfileTextures; // 0xa8
};

struct UGizmoTransformProxyTransformSource : UGizmoBaseTransformSource {
	UTransformProxy* Proxy; // 0x48
};

struct UHoudiniAssetBlueprintComponent : UHoudiniAssetComponent {
	bool FauxBPProperty; // 0x8e0
	bool bHoudiniAssetChanged; // 0x8e1
	bool bUpdatedFromTemplate; // 0x8e2
	bool bIsInBlueprintEditor; // 0x8e3
	bool bCanDeleteHoudiniNodes; // 0x8e4
	bool bHasRegisteredComponentTemplate; // 0x8e5
	TMap<FHoudiniOutputObjectIdentifier, FGuid> CachedOutputNodes; // 0x8f0
	TMap<FGuid, FGuid> CachedInputNodes; // 0x940
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct UMaterialExpressionArcsineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x258
	TArray<AActor*> OverrideInvisibleActors; // 0x268
	TArray<FName> OverrideInvisibleLevels; // 0x278
};

struct UCTCameraSpectatingToolsManager : UGameInstanceSubsystem {
	ACTBeastPawn* Beast; // 0x38
	ACTFreeLookCamera* FreeLookCamera; // 0x40
	ACTFreeRoamPawn* FreeRoamPawn; // 0x48
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UCTPlayerNameHintHolderWidget : UCTHintHolderWidget {
	float MinCenterWidth; // 0x320
	float MaxCenterWidth; // 0x324
	float ErrorCenterWidth; // 0x328
	USizeBox* CenterBGSizeController; // 0x330
};

struct UCTWindBlessingsWorkshop : UCTTutorialWorkShop {
	int32_t WindBlessingsToPass; // 0x19c
	TArray<ACTInfiniteBoostPowerUp*> WindBlessings; // 0x1a0
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x258
};

struct UMaterialExpressionHairColor : UMaterialExpression {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct UABP_D03_Harness04_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UCTDragonOverviewStateEgg : UCTDragonOverviewStateBase {
	ACameraActor* ShowroomCamera; // 0x80
	ACTEggGenerator* EggGenerator; // 0x88
	ACTEggModel* EggModelOverview; // 0x90
};

struct UDatasmithLightComponentTemplate : UDatasmithObjectTemplate {
	char bVisible : 1; // 0x30
	char CastShadows : 1; // 0x34
	char bUseTemperature : 1; // 0x34
	char bUseIESBrightness : 1; // 0x34
	float Intensity; // 0x38
	float Temperature; // 0x3c
	float IESBrightnessScale; // 0x40
	FLinearColor LightColor; // 0x44
	UMaterialInterface* LightFunctionMaterial; // 0x58
	UTextureLightProfile* IESTexture; // 0x60
};

struct UCTMaterialModifierDataAsset : UCTBodyPartModifierDataAsset {
	TArray<FMaterialOverride> Overrides; // 0x30
};

struct UGameplayTasksComponent : UActorComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x110
};

struct UCTProgressionManager : UGameInstanceSubsystem {
	FTimerHandle TmpTimerHandle; // 0x30
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct UAsyncTask_LoadXRDeviceVisComponent : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnModelLoaded; // 0x30
	FMulticastInlineDelegate OnLoadFailure; // 0x40
	UPrimitiveComponent* SpawnedComponent; // 0x58
};

struct UHomeBoosterItemButtonWidget_C : UCTNavigationWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x440
	UCTButton* CTButton_49; // 0x448
	UShopButtonBorder_C* ShopButtonBorder; // 0x450
};

struct UCTInvalidateOnDisplayCanvasPanel : UCanvasPanel {
	bool bInvalidateOnChangeVisibility; // 0x130
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UMovieSceneSlomoSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UModeLinkButton_C : UCTModeLinkButtonWidget {
	UCTButton* ModeLinkButton; // 0x448
};

struct UOptionsSectionTitleControls_C : UCTOptionsSectionTitleWidget {
	UDefaultRichTextBlock_C* controls; // 0x2f0
	UHorizontalBox* LabelsHolder; // 0x2f8
	UImage* OptionsSplitter_4; // 0x300
	UDefaultRichTextBlock_C* Settings; // 0x308
};

struct UGroupInvitationSectionWidget_C : UCTGroupInvitationSectionWidget {
	UImage* Arrow; // 0x318
	UImage* Separator; // 0x320
};

struct UMaterialExpressionSceneDepthWithoutWater : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FVector2D ConstInput; // 0x58
	float FallbackDepth; // 0x60
};

struct UNavigationSystemConfig : UObject {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct ULocationDummyDragonCellWidget_C : UCTCollectionDragonCellWidget {
	UImage* Background; // 0x510
	UCTButton* CellButton; // 0x518
	UImage* Frame; // 0x520
};

struct UDatasmithPostProcessVolumeTemplate : UDatasmithObjectTemplate {
	FDatasmithPostProcessSettingsTemplate Settings; // 0x30
	char bEnabled : 1; // 0x70
	char bUnbound : 1; // 0x70
};

struct UPopcornFXMesh : UPopcornFXFile {
	UStaticMesh* StaticMesh; // 0x90
	USkeletalMesh* SkeletalMesh; // 0x98
};

struct UMaterialExpressionSceneColor : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput OffsetFraction; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UCTEndMatchSummaryRankBegin : UCTEndMatchSummaryRankStateWidget {
	UCTEndMatchSummaryRankNone* NoneStateWidget; // 0x2f8
	UCTEndMatchSummaryRankProgress* ProgressStateWidget; // 0x300
	UWidgetAnimation* SwitchAnimation; // 0x308
};

struct UMaterialExpressionVectorNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	EVectorNoiseFunction NoiseFunction; // 0x54
	int32_t Quality; // 0x58
	char bTiling : 1; // 0x5c
	uint32_t TileSize; // 0x60
};

struct UVersusCellWidget_C : UCTLoadingVersusCellWidget {
	UImage* Frame; // 0x318
	UImage* Frame_2; // 0x320
	UImage* Image_2485; // 0x328
	UTextBlock* Vs; // 0x330
};

struct UTexture : UStreamableRenderAsset {
	FGuid LightingGuid; // 0x68
	int32_t LODBias; // 0x78
	TextureCompressionSettings CompressionSettings; // 0x7c
	TextureFilter Filter; // 0x7d
	ETextureMipLoadOptions MipLoadOptions; // 0x7e
	TextureGroup LODGroup; // 0x7f
	FPerPlatformFloat Downscale; // 0x80
	ETextureDownscaleOptions DownscaleOptions; // 0x84
	char sRGB : 1; // 0x85
	char bNoTiling : 1; // 0x85
	char VirtualTextureStreaming : 1; // 0x85
	char CompressionYCoCg : 1; // 0x85
	char bNotOfflineProcessed : 1; // 0x85
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x85
	TArray<UAssetUserData*> AssetUserData; // 0x88
};

struct UInfoPopup_FTUESections_Back_C : UCTFTUESectionsPopupWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b0
	UWidgetAnimation* HideAnimation; // 0x3b8
	UWidgetAnimation* ShowAnimation; // 0x3c0
	UImage* BlackBG; // 0x3c8
	UFTUESectionWidget_HeaderVersion_C* FTUESectionWidget_HeaderVersion; // 0x3d0
	UFTUESectionWidget_HeaderVersion_C* FTUESectionWidget_HeaderVersion_2; // 0x3d8
	UImage* PopupBackground; // 0x3e0
};

struct UCTEndMatchSectionBoostersCtrl : UCTEndMatchSummarySectionController {
	UCTEndMatchSectionBoostersWdgt* BoostersWidget; // 0x138
};

struct UCTGameEventLogLineWidget : UCTUserWidget {
	UTextBlock* PrimaryLogText; // 0x2f0
	URichTextBlock* SecondaryLogText; // 0x2f8
	UCanvasPanel* LogCanvas; // 0x300
	UImage* AdditionalImage; // 0x308
	EGameEventLogType LogType; // 0x310
	float LastTimeDisplayed; // 0x314
	int32_t OrderIndex; // 0x318
	float LogLineSize; // 0x31c
	TMap<EGameEventLogType, UMaterialInterface*> AdditionalImages; // 0x320
};

struct ABP_PurchaseCloseUpRendererForSpear_C : ACTCloseUpSpearRenderer {
	UCTFakeVolumetricLightComponent* Li_BackGroundHalo; // 0x2e0
	USpotLightComponent* Li_Key; // 0x2e8
	USpotLightComponent* Li_Fill; // 0x2f0
};

struct ULeaderboardTabBar_C : UCTNavigationTabBar {
	UControllerIcon_C* ControllerIcon_Next_2; // 0x370
	UControllerIcon_C* ControllerIcon_Previous_2; // 0x378
	UImage* Image_3; // 0x380
	UImage* Image_4; // 0x388
	UImage* Image_24; // 0x390
	UImage* Image_81; // 0x398
	UImage* Image_92; // 0x3a0
	UImage* Image_122; // 0x3a8
	UMainMenuTabButton_C* MainMenuTabButton; // 0x3b0
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct UBTDecorator_BlackboardBase : UBTDecorator {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UCTCollectionMapTopUIWidget : UCTUserWidget {
	UCTCollectionClassInfoWidget* ClassInfo; // 0x308
	UCTDragonInfoWidget* DragonInfo; // 0x310
	UCTDragonDescriptionWidget* DragonDescription; // 0x318
	UCTDragonsListWidget* DragonsList; // 0x320
	UCanvasPanel* DragonsListArea; // 0x328
	UCTNavigationWidget* BackButton; // 0x330
	UCTNavigationWidget* FakeButton; // 0x338
	UCTValidateTooltip* ValidateTooltip; // 0x340
};

struct UCTShopPackageWidget : UCTUserWidget {
	ECTTextureFormat ImageFormat; // 0x2f0
	UCTTextItemWidget* TagLineTextWidget; // 0x2f8
	UCTTextItemWidget* TitleTextWidget; // 0x300
	UCTImageItemWidget* WallPaperWidget; // 0x308
	UCTImageItemWidget* PlayerIconWidget; // 0x310
	EShopButtonStateEnum CurrentState; // 0x318
	FString ShopPackageUID; // 0x320
	bool bOffered; // 0x330
	URichTextBlock* NameText; // 0x338
	URichTextBlock* DescriptionText; // 0x340
	URichTextBlock* BonusText; // 0x348
	UPanelWidget* GemsWidget; // 0x350
	URichTextBlock* QuantityText; // 0x358
	UPanelWidget* QuantityPanel; // 0x360
	UCTShopAcquiredWidget* ShopAcquiredWidget; // 0x368
	UCTShopActivatedWidget* ShopActivatedWidget; // 0x370
	UCTShopBannerWidget* SaleWidget; // 0x378
	UCTShopBannerWidget* FreeWidget; // 0x380
	UCTShopBannerWidget* LastChanceWidget; // 0x388
	UPanelWidget* GoldWidget; // 0x390
	FSlateBrush DefaultEuroBackground; // 0x398
	FSlateBrush DisabledEuroBackground; // 0x420
	UPanelWidget* EurosWidget; // 0x4a8
	UImage* EuroBackground; // 0x4b0
	UPanelWidget* ClaimPanelWidget; // 0x4b8
	UCTUserWidget* OwnedWidget; // 0x4c0
	UCTShopPriceWidget* GoldPriceWidget; // 0x4c8
	UCTShopPriceWidget* GemPriceWidget; // 0x4d0
	UCTShopPriceWidget* EuroPriceWidget; // 0x4d8
	UCTShopPriceWidget* ClaimWidget; // 0x4e0
	UCTShopPriceWidget* OldGoldPriceWidget; // 0x4e8
	UCTShopPriceWidget* OldGemPriceWidget; // 0x4f0
	UCTShopPriceWidget* OldEuroPriceWidget; // 0x4f8
	UCTShopPriceWidget* EarnedGoldPriceWidget; // 0x500
	UCTShopPriceWidget* EarnedGemPriceWidget; // 0x508
	URichTextBlock* RarityText; // 0x510
	UImage* ObjectRender; // 0x518
	UImage* FullScreenObjectRender; // 0x520
	UImage* Image; // 0x528
	UImage* SquareImage; // 0x530
	FSlateBrush BlazonBrush; // 0x538
	UImage* ClassIconImage; // 0x5c0
	UPanelWidget* TextItemsCanvas; // 0x5c8
	UPanelWidget* MiscItemsCanvas; // 0x5d0
	UVerticalBox* BundlePlayerTitleVerticalBox; // 0x5d8
	UVerticalBox* BundleTagLineVerticalBox; // 0x5e0
	UVerticalBox* BundleWallPaperVerticalBox; // 0x5e8
	UWidget* BundlePlayerIconCanvas; // 0x5f0
	UCTRichTextBlock* SinglePlayerTitle; // 0x5f8
	UCTRichTextBlock* SingleTagLine; // 0x600
	UImage* SingleTagLineClass; // 0x608
	UWidget* SingleTagLineClassPanel; // 0x610
	UScaleBox* WallPaperSingleScaleBox; // 0x618
	UScaleBox* WallPaperBundleScaleBox; // 0x620
	UScaleBox* PlayerIconSingleScaleBox; // 0x628
	UScaleBox* PlayerIconBundleScaleBox; // 0x630
	UScaleBox* PlayerTitleSingleScaleBox; // 0x638
	UScaleBox* PlayerTitleBundleScaleBox; // 0x640
	UScaleBox* TagLineSingleScaleBox; // 0x648
	UScaleBox* TagLineBundleScaleBox; // 0x650
	UImage* SingleWallPaper; // 0x658
	UImage* SinglePlayerIcon; // 0x660
};

struct UCTOptionsParamMultiswitchWidget : UCTOptionsParameterWidget {
	FMulticastInlineDelegate SelectedMultiswitchOption; // 0x4b8
	UCTNavigationWidget* ButtonClass; // 0x4c8
	FButtonStyle ChosenButtonStyle; // 0x4d0
	FButtonStyle UnchosenButtonStyle; // 0x748
	FMargin ButtonsPadding; // 0x9c0
	UHorizontalBox* ButtonHorizontalBox; // 0x9d0
};

struct USubsurfaceProfile : UObject {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UGroupPrivacyButtonWidget_C : UCTGroupPrivacyButtonWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x440
	USizeBox* ArrowIconHolder_1; // 0x448
	USizeBox* ArrowIconHolder_2; // 0x450
	UDefaultRichTextBlock_C* ButtonTextPrivate; // 0x458
	UDefaultRichTextBlock_C* ButtonTextPublic; // 0x460
	UControllerIcon_C* ControllerIcon; // 0x468
	UControllerIcon_C* ControllerIcon_2; // 0x470
	USizeBox* ControllerIconHolder_1; // 0x478
	USizeBox* ControllerIconHolder_2; // 0x480
	UImage* Image; // 0x488
	UImage* Image_575; // 0x490
	UImage* LockedIcon; // 0x498
	UCTButton* PrivacyButton; // 0x4a0
	UCanvasPanel* PrivateHolder; // 0x4a8
	UCanvasPanel* PublicHolder; // 0x4b0
	UImage* UnlockedIcon; // 0x4b8
	FButtonStyle FakeStyle; // 0x4c0
	FButtonStyle OtherFakeStyle; // 0x738
	bool HideControllerIconAnyway; // 0x9b0
	FButtonStyle ButtonStyleNormal; // 0x9b8
	FButtonStyle ButtonStyleHovered; // 0xc30
	FButtonStyle ButtonStylePressed; // 0xea8
	FWidgetTransform ButtonRenderTransformNormal; // 0x1120
	FWidgetTransform ButtonRenderTransformHovered; // 0x113c
	FWidgetTransform ButtonRenderTransformPressed; // 0x1158
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct UCTEndMatchSummaryEggButton : UCTNavigationWidget {
	float Duration; // 0x440
	float RemainingTime; // 0x444
	UCTControllerIconWidget* AnimImage; // 0x448
	UCTControllerIconWidget* ButtonImage; // 0x450
	UImage* TimerImage; // 0x458
	UCanvasPanel* TimerAndPadPanel; // 0x460
};

struct UBetaRealMoneyPurchasePrevented_C : UCTUserWidget {
	UDefaultTextBlock_C* DefaultTextBlock; // 0x2f0
	UImage* Image_46; // 0x2f8
	UImage* Image_117; // 0x300
};

struct UBP_SecondaryLightComponent_C : UPointLightComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	TArray<FSkeletalMaterial> Materials; // 0xd8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xe8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xf8
	FPerPlatformInt MinLOD; // 0x158
	FPerPlatformBool DisableBelowMinLodStripping; // 0x15c
	EAxis SkelMirrorAxis; // 0x15d
	EAxis SkelMirrorFlipAxis; // 0x15e
	char bUseFullPrecisionUVs : 1; // 0x15f
	char bUseHighPrecisionTangentBasis : 1; // 0x15f
	char bHasBeenSimplified : 1; // 0x15f
	char bHasVertexColors : 1; // 0x15f
	char bEnablePerPolyCollision : 1; // 0x15f
	UBodySetup* BodySetup; // 0x160
	UPhysicsAsset* PhysicsAsset; // 0x168
	UPhysicsAsset* ShadowPhysicsAsset; // 0x170
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x178
	char bSupportRayTracing : 1; // 0x188
	TArray<UMorphTarget*> MorphTargets; // 0x190
	UAnimInstance* PostProcessAnimBlueprint; // 0x318
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x320
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x330
	TArray<UAssetUserData*> AssetUserData; // 0x360
	TArray<USkeletalMeshSocket*> Sockets; // 0x370
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x390
};

struct UCTTreasureDragonSpawner : UObject {
	TArray<FCTDragonSpawnInfos> SpawnHistory; // 0x28
};

struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0xf0
	float MaxSpeed; // 0xf4
	char bRotationFollowsVelocity : 1; // 0xf8
	char bRotationRemainsVertical : 1; // 0xf8
	char bShouldBounce : 1; // 0xf8
	char bInitialVelocityInLocalSpace : 1; // 0xf8
	char bForceSubStepping : 1; // 0xf8
	char bSimulationEnabled : 1; // 0xf8
	char bSweepCollision : 1; // 0xf8
	char bIsHomingProjectile : 1; // 0xf8
	char bBounceAngleAffectsFriction : 1; // 0xf9
	char bIsSliding : 1; // 0xf9
	char bInterpMovement : 1; // 0xf9
	char bInterpRotation : 1; // 0xf9
	float PreviousHitTime; // 0xfc
	FVector PreviousHitNormal; // 0x100
	float ProjectileGravityScale; // 0x10c
	float Buoyancy; // 0x110
	float Bounciness; // 0x114
	float Friction; // 0x118
	float BounceVelocityStopSimulatingThreshold; // 0x11c
	float MinFrictionFraction; // 0x120
	FMulticastInlineDelegate OnProjectileBounce; // 0x128
	FMulticastInlineDelegate OnProjectileStop; // 0x138
	float HomingAccelerationMagnitude; // 0x148
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x14c
	float MaxSimulationTimeStep; // 0x154
	int32_t MaxSimulationIterations; // 0x158
	int32_t BounceAdditionalIterations; // 0x15c
	float InterpLocationTime; // 0x160
	float InterpRotationTime; // 0x164
	float InterpLocationMaxLagDistance; // 0x168
	float InterpLocationSnapToTargetDistance; // 0x16c
};

struct UDestroySessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct ACTFunctionDebugger : AActor {
	TMap<FString, UCTFunctionDebug*> Functions; // 0x228
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UCTEventProgressEntryWidget : UCTUserWidget {
	UImage* LinkImageLeft; // 0x2f0
	UImage* LinkImageRight; // 0x2f8
	UImage* SlotImage; // 0x300
	USizeBox* LinkImageRightSizeBox; // 0x308
	USizeBox* LinkImageLeftSizeBox; // 0x310
	USizeBox* SlotSizeBox; // 0x318
	FSlateBrush LinkBrush; // 0x320
	FSlateBrush EndLinkBrush; // 0x3a8
	float EndLinkWidth; // 0x430
	FVector2D SlotSize; // 0x434
	TMap<ECTLiveEventProgressSlotState, FCTEventGaugeSlotData> GaugeStateDatas; // 0x440
};

struct USlider : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	float MinValue; // 0x11c
	float MaxValue; // 0x120
	FSliderStyle WidgetStyle; // 0x128
	EOrientation Orientation; // 0x468
	FLinearColor SliderBarColor; // 0x46c
	FLinearColor SliderHandleColor; // 0x47c
	bool IndentHandle; // 0x48c
	bool Locked; // 0x48d
	bool MouseUsesStep; // 0x48e
	bool RequiresControllerLock; // 0x48f
	float StepSize; // 0x490
	bool IsFocusable; // 0x494
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x498
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x4a8
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x4b8
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4c8
	FMulticastInlineDelegate OnValueChanged; // 0x4d8
};

struct UEnvQueryTest_Project : UEnvQueryTest {
	FEnvTraceData ProjectionData; // 0x1f8
};

struct UCTAdditionalLevelList : UDataAsset {
	TArray<FAdditionalLevel> AdditionalLevels; // 0x30
};

struct UFindTurnBasedMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UCollectionMapPoint_NotDiscovered_Selected_Hovered_C : UCTCollectionMapPointStateWidget {
	UImage* Image_97; // 0x2f0
};

struct ABP_FakeVolumetricSphereLight_C : ACTFakeVolumetricTickInEditor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
};

struct UGenlockedFixedRateCustomTimeStep : UGenlockedCustomTimeStep {
	FFrameRate FrameRate; // 0x28
};

struct UARTrackedImage : UARTrackedGeometry {
	UARCandidateImage* DetectedImage; // 0xf8
	FVector2D EstimatedSize; // 0x100
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct UCTClassHousesController : UCTWidgetController {
	UCTClassHouseWidget* DefaultHouseWidgetClass; // 0xa8
	UCTClassHouseController* DefaultHouseControllerClass; // 0xb0
	TArray<UCTClassHouseController*> Houses; // 0xb8
};

struct UMaterialExpressionLogarithm10 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UPlayFabAuthenticationContext : UObject {
	FString ClientSessionTicket; // 0x28
	FString EntityToken; // 0x38
	FString DeveloperSecretKey; // 0x48
	FString PlayFabId; // 0x58
};

struct UCTCrossedWidgetsVisualChanger : UCTUserWidget {
	TArray<UWidget*> IntersectingWidgets; // 0x2f0
	TArray<UWidget*> IntersectedWidgets; // 0x300
	ECTCrossedWidgetsLocation Location; // 0x360
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct UAnimNotify_PlaySound : UAnimNotify {
	USoundBase* Sound; // 0x38
	float VolumeMultiplier; // 0x40
	float PitchMultiplier; // 0x44
	char bFollow : 1; // 0x48
	FName AttachName; // 0x4c
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UCTCustomSettings : UObject {
	bool bActivateNPC; // 0x28
	bool bAllowDummyText; // 0x29
	bool bAutostartPIE; // 0x2a
	bool DebugFast; // 0x2b
	bool bEnableTrailsInAirColumn; // 0x2c
	FSoftObjectPath DefaultSoundBank; // 0x30
	bool bUsePlayfab; // 0x48
	FString PlayfabAccount; // 0x50
	TArray<FString> PlayfabOtherAccount; // 0x60
};

struct UCTEndMatchSummaryEgg : UCTEndMatchSummary {
	float LevelUpAnimationSpeed; // 0x338
	float EggFilledAnimationSpeed; // 0x33c
	float LevelProgressAppearingSpeed; // 0x340
	float EggProgressAppearingSpeed; // 0x344
	UTextBlock* AdditionnalXP; // 0x358
	UProgressBar* XPGauge; // 0x360
	UTextBlock* XpTotalTitle; // 0x368
	UProgressBar* XPBonusGaugeHatching; // 0x370
	UTextBlock* EggLevelTxt; // 0x378
	UTextBlock* LevelTxt; // 0x380
	UImage* HatchingBigEgg; // 0x388
	UCTEndMatchSummaryLevelProgress* LevelProgressWidget; // 0x390
	UCTEggProgressWidget* EggProgressWidget; // 0x398
	UCTRewardWidget* RewardWidgetClass; // 0x3a0
	UCTRewardWidget* LevelUpRewardWidgetClass; // 0x3a8
	UCTEndMatchSummaryEggButton* SkipButton; // 0x3b0
	UCTWidgetSpreadAnimation* Animation; // 0x3b8
	UButton* DebugCommitScoreButton; // 0x3d8
	UButton* DebugAddLevelButton; // 0x3e0
	UWidgetAnimation* LevelProgressAppearingIfNoEgg; // 0x3e8
	UWidgetAnimation* LevelUpFadeInOutAnim; // 0x3f0
	UWidgetAnimation* LevelProgressAppearing; // 0x3f8
	UWidgetAnimation* EggProgressAppearing; // 0x400
	UWidgetAnimation* HatchingEventBoostAnim; // 0x408
	UCTEndMatchLevelUpWidget* LevelUpWidget; // 0x410
	UEditableTextBox* ScoreToBeAdded; // 0x418
	UEditableTextBox* LevelToGoTo; // 0x420
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct ACTPingZoneVolume : AVolume {
	FCTPingZoneInfo PingZoneInfo; // 0x258
};

struct ACTPoolManager : AActor {
	int32_t InitAllocatedActorCount; // 0x220
	int32_t AllocatedActorCount; // 0x224
	AActor* ActorType; // 0x228
	TArray<AActor*> ActorArray; // 0x230
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UCTRichTextBlockInvalidation : URichTextBlock {
	bool bNeedsPrepassEveryTick; // 0x678
};

struct UPlayMasterTab_C : UCTPlayMasterTabWidget {
	UImage* BackgroundImage; // 0x300
	UMultiplayerTab_C* MultiplayerTab; // 0x308
	UPlayTabTabBar_C* PlayTabTabBar; // 0x310
	UTutorialsTab_C* TutorialsTab; // 0x318
};

struct ULevelSequenceDirector : UObject {
	ULevelSequencePlayer* Player; // 0x28
	int32_t SubSequenceID; // 0x30
	int32_t MovieScenePlayerIndex; // 0x34
};

struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	FBlackboardKeySelector ActorToCheck; // 0x68
	EGameplayContainerMatchType TagsToMatch; // 0x90
	FGameplayTagContainer GameplayTags; // 0x98
	FString CachedDescription; // 0xb8
};

struct ULTSLoadingScreenWidget_C : UCTLoadingScreenWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	UWidgetAnimation* LoadingAnim; // 0x3a0
	UWidgetAnimation* NewAnimation_2; // 0x3a8
	UImage* Image_132; // 0x3b0
	UImage* Loading_Sword; // 0x3b8
	UImage* Logo_Cercle; // 0x3c0
	UTextBlock* MapNameText; // 0x3c8
	UTextBlock* ModeText; // 0x3d0
	UImage* TipsFrame; // 0x3d8
	UImage* Torch; // 0x3e0
};

struct UBackButtonCommon_C : UBackButton_C {
	FSlateFontInfo DefaultFont_1; // 0x8a0
	FSlateFontInfo HoverFont_1; // 0x8f8
	FSlateColor HoverTextColor_1; // 0x950
	FSlateColor DefaultTextColor_1; // 0x978
	FButtonStyle ButtonStyle_1; // 0x9a0
};

struct URadialForceComponent : USceneComponent {
	float Radius; // 0x1f8
	ERadialImpulseFalloff Falloff; // 0x1fc
	float ImpulseStrength; // 0x200
	char bImpulseVelChange : 1; // 0x204
	char bIgnoreOwningActor : 1; // 0x204
	float ForceStrength; // 0x208
	float DestructibleDamage; // 0x20c
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x210
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct UInAppPurchaseCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct UMissileAlertWidget_C : UCTMissileDetectionWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x370
	UWidgetAnimation* HitWall; // 0x378
	UWidgetAnimation* Spawn; // 0x380
	UWidgetAnimation* ENdure; // 0x388
	UWidgetAnimation* Deflect; // 0x390
};

struct UMediaPlaylist : UObject {
	TArray<UMediaSource*> Items; // 0x28
};

struct UCTLoadingScreenWidget : UCTNavigationPage {
	UCTLodingTipsDB* TipsDB; // 0x308
	UCTTeamsDataAsset* TeamsDataAsset; // 0x310
	UCTLoadingVersusCellWidget* VersusCellClass; // 0x318
	UImage* Background; // 0x338
	UTextBlock* TipTextBlock; // 0x340
	UWidget* OrnementTitle; // 0x348
	UWidget* ModeTitleFrame; // 0x350
	UTextBlock* LoadingText; // 0x358
	UCTNavigationWidget* LoadingNextTipWidget; // 0x360
	UWidgetAnimation* FadeInOuttipText; // 0x368
	UPanelWidget* FreeForAllPanel; // 0x370
	UHorizontalBox* VersusHorizontalBox; // 0x378
	TArray<FCTLoadingTip> ArrayOfAvailableTips; // 0x388
};

struct ACTLureEnergySphere : AActor {
	float SuccessDestroyDuration; // 0x220
	float FailDuration; // 0x224
	float DistanceToTouch; // 0x228
	UCurveFloat* TravelTimeFromDistance; // 0x230
	UCurveFloat* TravelInterpFromTime; // 0x238
	float RefilledEnergy; // 0x240
	FVector TargetOffset; // 0x244
	UParticleSystemComponent* ParticleComp; // 0x278
	USceneComponent* LureSphereRoot; // 0x280
};

struct UPlaneReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadiusScale; // 0x270
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UUniformGridPanel : UPanelWidget {
	FMargin SlotPadding; // 0x120
	float MinDesiredSlotWidth; // 0x130
	float MinDesiredSlotHeight; // 0x134
};

struct UCTCustomizableNavigationButton : UCTNavigationWidget {
	UDataTable* TextStyleSet; // 0x440
	FButtonStyle WidgetStyle; // 0x448
	URichTextBlock* Text; // 0x6c0
	UCTButton* BindButton; // 0x6c8
};

struct ULoadingNextTipWidget_C : UCTNavigationWidget {
	UTextBlock* NextTip; // 0x440
	UScalableKeyIcon_C* ScalableKeyIcon; // 0x448
};

struct UPlayFabLocalizationAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x98
	UPlayFabJsonObject* RequestJsonObj; // 0xa0
	UPlayFabJsonObject* ResponseJsonObj; // 0xa8
};

struct UAnimNotifyState_TimedParticleEffect : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UCTLimitedCountUsersSectionWidget : UCTCountingUsersSectionWidget {
	UTextBlock* LimitText; // 0x320
	UVerticalBox* LowestHolder; // 0x328
};

struct UShowLoginUICallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UCTMapHolderWidget : UCTUserWidget {
	UCTCollectionMapWidget* Map; // 0x350
	UCTMovableAreaBox* MapArea; // 0x358
	UCanvasPanel* GamepadCursorArea; // 0x360
	UCTCollectionMapTopUIWidget* TopUI; // 0x368
	FVector2D DefaultPosition; // 0x370
	float MapMovingSpeed; // 0x378
	FVector2D MapFocusPoint; // 0x388
	float CloseToNewPositionTolerance; // 0x394
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct UCTLeaderboardFriendButton : UCTNavigationWidget {
	UImage* On; // 0x440
	UTextBlock* Title; // 0x448
};

struct ACTPostProcessVolume : ACTPostProcessVolumeBase {
	FPPVDirectionalLightOverride DirectionalOverride; // 0x7d0
	FPPVSkyLightOverride SkyLightOverride; // 0x828
	TArray<FPPVPointLightOverride> PointLightOverrides; // 0x850
	TArray<FPPVSpotLightOverride> SpotLightOverrides; // 0x860
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct ULiveLinkPreset : UObject {
	TArray<FLiveLinkSourcePreset> Sources; // 0x28
	TArray<FLiveLinkSubjectPreset> Subjects; // 0x38
};

struct UInterpTrackInstEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UNiagaraDataInterfaceNeighborGrid3D : UNiagaraDataInterfaceGrid3D {
	uint32_t MaxNeighborsPerCell; // 0x100
};

struct UImgMediaSettings : UObject {
	FFrameRate DefaultFrameRate; // 0x28
	float CacheBehindPercentage; // 0x30
	float CacheSizeGB; // 0x34
	int32_t CacheThreads; // 0x38
	int32_t CacheThreadStackSizeKB; // 0x3c
	float GlobalCacheSizeGB; // 0x40
	bool UseGlobalCache; // 0x44
	uint32_t ExrDecoderThreads; // 0x48
	FString DefaultProxy; // 0x50
	bool UseDefaultProxy; // 0x60
};

struct UCTFilterWidget : UCTUserWidget {
	UCTFilterCellWidget* FilterCellWidgetClass; // 0x2f0
	UGridPanel* ItemsContainer; // 0x2f8
};

struct UCTNetProjectileCom : UCTNetSpawnerBaseCom {
	ACTProjectileSpawn* pProjectileActor; // 0xe0
};

struct UExtendableNegativePopupButton_C : UCTExtendableNavigationButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4e0
	UImage* Image_71; // 0x4e8
};

struct UCTPlayerProfileTabController : UCTWidgetWithTabController {
	UCTProfileController* ProfileTab; // 0xa0
	UCTLevelInfoController* LevelInfo; // 0xa8
	UCTPlayerProfileTabWidget* PlayerProfileWidgetClass; // 0xb0
	UCTWidgetController* ProfileTabControllerClass; // 0xb8
	UCTLevelInfoController* LevelInfoControllerClass; // 0xc0
	ACameraActor* HomeCamera; // 0xc8
	FName DragonStartBaseName; // 0xd0
	FName RiderStartBaseName; // 0xd8
	FCTCharacterSet CharacterSet; // 0xe0
	FCTDisplaySetManager DisplaySetManager; // 0x120
};

struct UABP_H02_Head08_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x4d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd20
};

struct UHUDWidget_C : UCTHUDWidget {
	UAttackedFeedbackWidget_C* AttackedFeedbackWidget; // 0x4c0
	UScalableKeyIcon_C* BoostScalableKeyIcon; // 0x4c8
	UCanvasPanel* CenterCanvas; // 0x4d0
	UImage* CercleLockAnim; // 0x4d8
	UScalableKeyIcon_C* FlameScalableKeyIcon; // 0x4e0
	UHitMarkerWidget_C* HitMarkerWidget; // 0x4e8
	UMissileAimCenterWidget_C* MissileAimCenterWidget; // 0x4f0
	UStateIconBoxWidget_C* StateIconBoxWidget; // 0x4f8
	UCanvasPanel* WeaponCanvas; // 0x500
	UPrimaryDataAsset* GaugeMPC; // 0x508
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct ULevelActorContainer : UObject {
	TArray<AActor*> Actors; // 0x28
};

struct USafeZone : UContentWidget {
	bool PadLeft; // 0x120
	bool PadRight; // 0x121
	bool PadTop; // 0x122
	bool PadBottom; // 0x123
};

struct UCTCollectionDragonsDataAsset : UDataAsset {
	TMap<FName, FCTCollectionDragonItemData> AllDragons; // 0x48
	TMap<FName, FCTCollectionDragonItemData> AvailableDragons; // 0x98
};

struct UCTRiderAnimInstance : UCTAnimInstance {
	bool Initialized; // 0x2d4
	float SmoothRatio; // 0x2d8
	float PitchSmoothRatio; // 0x2dc
	float RollSmoothRatio; // 0x2e0
	float YawSmoothRatio; // 0x2e4
	TArray<FCTBoneInData> BoneDataArray; // 0x2e8
	bool bCanRide; // 0x2f8
	bool bIsFlying; // 0x2f9
	bool bIsDead; // 0x2fa
	FVector2D CurrentAimDirection; // 0x2fc
	FVector2D WantedAimDirection; // 0x304
	float SpeedRatio; // 0x30c
	float TurnSpeed; // 0x310
	float Pitch; // 0x314
	bool bWeaponOut; // 0x318
	bool bShieldOut; // 0x319
	bool bSpearOut; // 0x31a
	bool bCapeRTC; // 0x31b
	bool bSmokeOut; // 0x31c
	bool bUseChieftainDash; // 0x31d
	ERiderSpearAnimMode CurrentSpearAnimMode; // 0x31e
	float WallHitSeverity; // 0x320
	EWallHitEnum WallHitEnum; // 0x324
	EStrikeHitEnum StrikeHitEnum; // 0x325
	bool NeedImpact; // 0x326
	EWeaponType WeaponType; // 0x327
	bool bShouldFire; // 0x328
	bool bShouldPrepareFire; // 0x329
	bool bShouldBoost; // 0x32a
	bool bDidBoostThisFrame; // 0x32b
	bool bDidBoostPreviousFrame; // 0x32c
	bool bIsBraking; // 0x32d
	bool bWasBrakingPreviousFrame; // 0x32e
	bool bIsBrakingPure; // 0x32f
	float BrakingTimer; // 0x330
	bool bIsSliding; // 0x334
	bool bIsAscending; // 0x335
	bool bIsBerserk; // 0x336
	bool bIsHoldingFlag; // 0x337
	ACTBeastPawn* BeastOwner; // 0x338
	bool bSuperBoost; // 0x340
};

struct AAkAcousticPortal : AVolume {
	AkAcousticPortalState InitialState; // 0x258
	float ObstructionRefreshInterval; // 0x25c
	ECollisionChannel ObstructionCollisionChannel; // 0x260
};

struct URecentPlayerUserWidget_C : UCTInviteUserWidget {
	UImage* AfterAvatarDecor; // 0x330
	UImage* ButtonBG; // 0x338
	FString OfflineStatusLocalization; // 0x340
	FString OnlineStatusLocalization; // 0x350
	FString InMenuStatusLocalization; // 0x360
	FString InGameStatusLocalization; // 0x370
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x858
	float CheckpointSaveMaxMSPerFrame; // 0xa04
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xa28
	bool bIsLocalReplay; // 0xa38
	TArray<APlayerController*> SpectatorControllers; // 0xa40
};

struct UMaterialExpressionArctangent2Fast : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct UCTButtonStatesHolderWidget : UCTUserWidget {
	UCTButton* ExternalButton; // 0x2f0
	TMap<ECTUIButtonState, FCTButtonStateData> AvailableButtonStates; // 0x2f8
	UImage* CurrentImage; // 0x348
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct UCTLevelInfoWidget : UCTNavigationPageMainMenu {
	UCTNavigationWidget* BackButton; // 0x310
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x90
	FVector GoalLocation; // 0x98
	float AcceptableRadius; // 0xa4
	UNavigationQueryFilter* FilterClass; // 0xa8
	char bAllowStrafe : 1; // 0xb0
	char bFinishOnOverlap : 1; // 0xb0
	char bUsePathfinding : 1; // 0xb0
	char bAllowPartialPath : 1; // 0xb0
	char bProjectGoalToNavigation : 1; // 0xb0
	char bUpdatePathToGoal : 1; // 0xb0
	char bAbortChildActionOnPathChange : 1; // 0xb0
};

struct UCTBoosterMoreItemWidget : UCTUserWidget {
	UCTNavigationWidget* Button; // 0x2f0
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x90
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
	UPawnAction* RecentActionCopy; // 0xa8
};

struct UCTDailyQuestsWidget : UCTQuestsWidget {
	UPanelWidget* LevelBox; // 0x360
	URichTextBlock* Points; // 0x368
	UTextBlock* Delay; // 0x370
	UWidget* ChestBox; // 0x378
	UWidget* NoChestBox; // 0x380
	UImage* ChestBackground; // 0x388
	UPanelWidget* DaysBox; // 0x390
	UImage* DailyMissionIndication; // 0x398
	UHorizontalBox* KeyPerDayHolder; // 0x3a0
	USpacer* TitleSpacer; // 0x3a8
	USpacer* KeyPerDaySpacer; // 0x3b0
	TArray<FSlateBrush> ChestBg; // 0x3b8
};

struct UMaterialExpressionSmoothStep : UMaterialExpression {
	FExpressionInput Min; // 0x40
	FExpressionInput Max; // 0x54
	FExpressionInput Value; // 0x68
	float ConstMin; // 0x7c
	float ConstMax; // 0x80
	float ConstValue; // 0x84
};

struct ULandscapeGrassType : UObject {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct USceneCaptureComponent : USceneComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x1f8
	ESceneCaptureSource CaptureSource; // 0x1f9
	char bCaptureEveryFrame : 1; // 0x1fa
	char bCaptureOnMovement : 1; // 0x1fa
	bool bAlwaysPersistRenderingState; // 0x1fb
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x200
	TArray<AActor*> HiddenActors; // 0x210
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x220
	TArray<AActor*> ShowOnlyActors; // 0x230
	float LODDistanceFactor; // 0x240
	float MaxViewDistanceOverride; // 0x244
	int32_t CaptureSortPriority; // 0x248
	bool bUseRayTracingIfEnabled; // 0x24c
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x250
	FString ProfilingEventName; // 0x290
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xc0
};

struct UHoudiniMeshSplitInstancerComponent : USceneComponent {
	TArray<UStaticMeshComponent*> Instances; // 0x1f8
	TArray<UMaterialInterface*> OverrideMaterials; // 0x208
	UStaticMesh* InstancedMesh; // 0x218
};

struct UMaterialInstance : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x90
	UMaterialInterface* Parent; // 0xd0
	char bHasStaticPermutationResource : 1; // 0xd8
	char bOverrideSubsurfaceProfile : 1; // 0xd8
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xe0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xf0
	TArray<FTextureParameterValue> TextureParameterValues; // 0x100
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x110
	TArray<FFontParameterValue> FontParameterValues; // 0x120
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x130
	FStaticParameterSet StaticParameters; // 0x148
	FMaterialCachedParameters CachedLayerParameters; // 0x188
	TArray<UObject*> CachedReferencedTextures; // 0x2d8
};

struct URadialIntMask : UFieldNodeInt {
	float Radius; // 0xb0
	FVector Position; // 0xb4
	int32_t InteriorValue; // 0xc0
	int32_t ExteriorValue; // 0xc4
	ESetMaskConditionType SetMaskCondition; // 0xc8
};

struct ACTPlayerController : ACTBasePlayerController {
	UCTGlobalHUDWidget* GlobalHUD; // 0x588
	bool bGlobalHUDWidgetManaged; // 0x590
	UCTInGameOptionsController* InGameOptionsControllerClass; // 0x5a8
	UCTInGameOptionsController* InGameOptionsController; // 0x5b0
	ACTBeastPawn* FollowedBeast; // 0x5d0
	ECharacClassType InitialCharacClassType; // 0x5d8
	EAbility InitialGadget; // 0x5d9
	int32_t GameModeRuleMaxDisplay; // 0x5dc
	UCTCustomizedRTCInstance* pWarmUpInstance; // 0x5f0
	UCTLevelSequenceInstance* pIntroInstance; // 0x5f8
	UCTCustomizedRTCInstance* pPodiumInstance; // 0x600
	UCTCustomizedRTCInstance* pVictoryInstance; // 0x608
	APawn* PreviousPawn; // 0x610
	ACTMenuCharacter* LobbyDragonRider; // 0x618
	ACTMenuCharacter* LobbyDragon; // 0x620
	UCTGlobalHUDWidget* GlobalHUDClass; // 0x628
	UCTPortraitGenerator* PortraitGeneratorClass; // 0x630
	UCTPortraitGenerator* PortraitGenerator; // 0x638
	ACameraActor* SkyCaptureCamera; // 0x648
	UCTCustomizationTask* PreloadCustomizationTask; // 0x650
	TMap<FString, ECharacClassType> PreloadCustoTask; // 0x658
};

struct ABP_DragonRider_C : ACTDragonRider {
	UPointLightComponent* Light_Spear; // 0x318
	UPopcornFXEmitterComponent* SpearFXEmitter; // 0x320
	USceneComponent* Mouth; // 0x328
	UPostProcessComponent* TeamPowerPostProcess; // 0x330
	float TML_LightSpearFadeOut_LightIntensity_Up_EDE31CA544F428F0AC5422B1575BEF47; // 0x338
	ETimelineDirection TML_LightSpearFadeOut__Direction_EDE31CA544F428F0AC5422B1575BEF47; // 0x33c
	UTimelineComponent* TML_LightSpearFadeOut; // 0x340
	float TML_LightSpearFadeIn_LightIntensity_Up_0F50DFC644838384E840AE9B1E094640; // 0x348
	ETimelineDirection TML_LightSpearFadeIn__Direction_0F50DFC644838384E840AE9B1E094640; // 0x34c
	UTimelineComponent* TML_LightSpearFadeIn; // 0x350
	bool IsLocal; // 0x358
	FRandomStream RandomStream; // 0x35c
	TArray<UMaterialInterface*> RiderMaterials; // 0x368
	TArray<UMaterialInstanceDynamic*> InvisibleMaterials; // 0x378
	int32_t CurrentMaterialindex; // 0x388
	FVector WindForBones; // 0x38c
	bool Temp_bool_Variable; // 0x398
	float Temp_float_Variable; // 0x39c
	float Temp_float_Variable_2; // 0x3a0
	int32_t Temp_int_Array_Index_Variable; // 0x3a4
	int32_t Temp_int_Loop_Counter_Variable; // 0x3a8
	int32_t Temp_int_Array_Index_Variable_2; // 0x3ac
	float K2Node_Event__Deltatime; // 0x3b0
	int32_t Temp_int_Variable; // 0x3b4
	bool K2Node_Event__bInvisible; // 0x3b8
	TArray<USceneComponent*> CallFunc_GetChildrenComponents_Children; // 0x3c0
	USceneComponent* CallFunc_Array_Get_Item; // 0x3d0
	UMeshComponent* K2Node_DynamicCast_AsMesh_Component; // 0x3d8
	bool K2Node_DynamicCast_bSuccess; // 0x3e0
	TArray<UMaterialInterface*> CallFunc_GetMaterials_ReturnValue; // 0x3e8
	UMaterialInstanceDynamic* CallFunc_Array_Get_Item_2; // 0x3f8
	UMaterialInterface* CallFunc_Array_Get_Item_3; // 0x400
	int32_t Temp_int_Loop_Counter_Variable_2; // 0x408
	bool K2Node_Event__Active; // 0x40c
	bool K2Node_Event__HandSpear; // 0x40d
	bool K2Node_Event__DragonSpear; // 0x40e
	float K2Node_Select_Default; // 0x410
};

struct UAnimComposite : UAnimCompositeBase {
	FAnimTrack AnimationTrack; // 0xa8
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x270
	FName PreviousMatchState; // 0x278
	int32_t ElapsedTime; // 0x280
};

struct UCTBannerCustomizationTask : UCTCustomizationTask {
	UStaticMeshComponent* StaticMeshComponent; // 0x48
	UCTPropStampModifierDataAsset* Modifier; // 0x50
	FSoftObjectPath MeshSoftPath; // 0x58
	FSoftObjectPath MaterialSoftPath; // 0x70
	UCTCustomizationTask* ModifierTask; // 0x88
};

struct UUMGSequenceTickManager : UObject {
	TSet<TWeakObjectPtr<UUserWidget>> WeakUserWidgets; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x78
};

struct UCTEggSourcePointPopupWidget : UCTFTUEPopupWidget {
	UMediaSource* Video; // 0x388
	UMediaPlayer* MediaPlayer; // 0x390
	UImage* VideoImage; // 0x398
};

struct UDatasmithStaticMeshComponentTemplate : UDatasmithObjectTemplate {
	UStaticMesh* StaticMesh; // 0x30
	TArray<UMaterialInterface*> OverrideMaterials; // 0x38
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct UCTInfoPopupController : UCTWidgetController {
	UCTValidateTooltip* ToolTipWidget; // 0xa8
	TArray<FKeyToolTipData> Tooltips; // 0xb0
};

struct ABP_DefaultDragonCustoDisplaySet_C : ACTCustoDisplaySet {
	UCameraComponent* Egg_Camera_Shop; // 0x3f0
	USceneComponent* ClassCusto_Transform_Shop; // 0x3f8
	UCameraComponent* Dragon_Body_Shop; // 0x400
	UCameraComponent* ClassCustoCamera_Shop; // 0x408
	USceneComponent* Dragon_Body_Transform_Shop; // 0x410
	USceneComponent* EggModel_Transform; // 0x418
	USceneComponent* Harness_Transform_Shop; // 0x420
	USceneComponent* UserProfileCharacterTransform; // 0x428
	USceneComponent* Tail_Transform_Shop; // 0x430
	UCameraComponent* DefaultCamera_Shop; // 0x438
	USceneComponent* Dragon_Part_Default_Shop; // 0x440
	USceneComponent* Helmet_Rotation_Axis; // 0x448
	USceneComponent* Harness_Rotation_Axis; // 0x450
	USceneComponent* Tail_Rotation_Axis; // 0x458
	USceneComponent* Torso_Rotation_Axis; // 0x460
	USceneComponent* ProfileCharacterTransform; // 0x468
	USceneComponent* Helmet_Transform; // 0x470
	USceneComponent* Harness_Transform; // 0x478
	USceneComponent* Tail_Transform; // 0x480
	USceneComponent* Torso_Transform; // 0x488
	UCameraComponent* Helmet_Camera; // 0x490
	UCameraComponent* Harsness_Camera; // 0x498
	UCameraComponent* Tail_Camera; // 0x4a0
	UCameraComponent* Torso_Camera; // 0x4a8
	UCameraComponent* Body_Camera; // 0x4b0
	USceneComponent* Dragon_Part_Transform; // 0x4b8
	USceneComponent* ClassChoice_Transform; // 0x4c0
	USceneComponent* ClassDefault_Transform; // 0x4c8
};

struct UNiagaraDataInterfaceLandscape : UNiagaraDataInterface {
	AActor* SourceLandscape; // 0x38
	ENDILandscape_SourceMode SourceMode; // 0x40
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0x48
};

struct UCompositeCameraShakePattern : UCameraShakePattern {
	TArray<UCameraShakePattern*> ChildPatterns; // 0x28
};

struct UABP_H02_Head02_Menu_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x4d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd20
	FVector WorldWind; // 0xd40
	float Lerp; // 0xd4c
	bool HairPhysics; // 0xd50
};

struct UABP_H02_Head01_Menu_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4f0
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x510
	FVector WorldWind; // 0xd40
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UShopAcquiredWidget1_C : UCTShopAcquiredWidget {
	UImage* Image_63; // 0x300
	UImage* Image_171; // 0x308
};

struct UInfoPopup_UserProfileBackendErrorWidget_C : UCTInfoPopupWidget {
	UImage* Image; // 0x380
};

struct UNewsPopupWidget_C : UCTNewsPopupWidget {
	UImage* BlackScreen; // 0x360
	UCanvasPanel* Canvas; // 0x368
	UControllerIcon_C* ControllerIconBack; // 0x370
	UControllerIcon_C* ControllerIconNext; // 0x378
	UDefaultValidateTooltip_C* DefaultValidateTooltip; // 0x380
	UImage* Image_458; // 0x388
};

struct UCTHatchingTabController : UCTWidgetController {
	ACameraActor* HatchingCamera; // 0xc0
	FName HatchingLevelName; // 0xc8
	ACTEggGenerator* EggGenerator; // 0xe0
	bool IsFilling; // 0x100
	bool IsFading; // 0x101
};

struct USoundNodeDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct UConstantQNRTSettings : UAudioSynesthesiaNRTSettings {
	float StartingFrequency; // 0x28
	int32_t NumBands; // 0x2c
	float NumBandsPerOctave; // 0x30
	float AnalysisPeriod; // 0x34
	bool bDownmixToMono; // 0x38
	EConstantQFFTSizeEnum FFTSize; // 0x39
	EFFTWindowType WindowType; // 0x3a
	EAudioSpectrumType SpectrumType; // 0x3b
	float BandWidthStretch; // 0x3c
	EConstantQNormalizationEnum CQTNormalization; // 0x40
	float NoiseFloorDb; // 0x44
};

struct UCTAudioSkeletalMeshComponent : USkeletalMeshComponent {
	FComponentReference AudioComponent; // 0xec8
	UCTSoundBankDataAsset* SoundBank; // 0xef0
};

struct UCTLiveEventWidget : UCTNavigationWidget {
	UCTPlayerLiveEvent* pLiveEvent; // 0x460
	UCTButton* LiveEventButton; // 0x468
	URichTextBlock* EventTitle; // 0x470
	URichTextBlock* RemainingEventDurationText; // 0x478
};

struct UGizmoLocalVec2ParameterSource : UGizmoBaseVec2ParameterSource {
	FVector2D Value; // 0x48
	FGizmoVec2ParameterChange LastChange; // 0x50
};

struct ATA_BP_FireFX_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UParticleSystemComponent* FX_FirePropagation_roof; // 0x228
	float Timeline_0_FlamePulseVel_AF6523BA44876F2DBBABD5837EDBC479; // 0x230
	float Timeline_0_FlamePulseSize_AF6523BA44876F2DBBABD5837EDBC479; // 0x234
	float Timeline_0_SmokeSize_AF6523BA44876F2DBBABD5837EDBC479; // 0x238
	float Timeline_0_SmokeVel_AF6523BA44876F2DBBABD5837EDBC479; // 0x23c
	float Timeline_0_MainFlameSize_AF6523BA44876F2DBBABD5837EDBC479; // 0x240
	ETimelineDirection Timeline_0__Direction_AF6523BA44876F2DBBABD5837EDBC479; // 0x244
	UTimelineComponent* Timeline_1; // 0x248
	FVector MainFlameSizeBegin; // 0x250
	FVector MainFlameSizeEnd; // 0x25c
	FVector SmokeVelBegin; // 0x268
	FVector SmokeVelEnd; // 0x274
	FVector SmokeSizeBegin; // 0x280
	FVector SmokeSizeEnd; // 0x28c
	FVector FlamePulseSizeBegin; // 0x298
	FVector FlamePulseSizeEnd; // 0x2a4
	FVector FlamePulseVelBegin; // 0x2b0
	FVector FlamePulseVelEnd; // 0x2bc
};

struct UOptionsMouseControlTypeWidget_C : UCTOptionsDropDownHFWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4f8
	UCTButton* BGButton; // 0x500
	UHorizontalBox* HorizontalBox_324; // 0x508
	UImage* ImageNormal; // 0x510
	UImage* ImagePressed; // 0x518
	bool IsComboBoxHovered; // 0x520
	FTableRowStyle MouseDropDownStyle; // 0x528
	FTableRowStyle GamePadDropDownStyle; // 0xcf0
};

struct UExpandedDailyContracts_C : UCTDailyQuestsExpand {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3a8
	UControllerIcon_C* ControllerIcon_3; // 0x3b0
	UDailyContracts_C* DailyContracts_2; // 0x3b8
	UDailyQuestChest_C* DailyQuestChest; // 0x3c0
	UDailyQuestChest_C* DailyQuestChest_104; // 0x3c8
	UDailyQuestChest_C* DailyQuestChest_233; // 0x3d0
	UDailyQuestChest_C* DailyQuestChest_341; // 0x3d8
	UDefaultRichTextBlock_C* DefaultRichTextBlock_3; // 0x3e0
	UDefaultTextBlock_C* DefaultTextBlock; // 0x3e8
	UCustomizableStretchableNavButton_C* ExpandedDailyButtonOcclusion; // 0x3f0
	UImage* Image; // 0x3f8
	UImage* Image_86; // 0x400
	UImage* Image_144; // 0x408
	UImage* Image_164; // 0x410
	UImage* Image_215; // 0x418
	UImage* Image_290; // 0x420
	UVerticalBox* QuestPanel; // 0x428
	UDefaultRichTextBlock_C* Subtitle; // 0x430
	UDefaultRichTextBlock_C* Title; // 0x438
	UDefaultRichTextBlock_C* YourChest; // 0x440
};

struct ASkyAtmosphere : AInfo {
	USkyAtmosphereComponent* SkyAtmosphereComponent; // 0x220
};

struct UHatchingMissionLineLevelIndicator_C : UUserWidget {
	UImage* Background; // 0x260
	URichTextBlock* LevelText; // 0x268
	UImage* LockImage; // 0x270
	bool Locked; // 0x278
};

struct UMovieSceneTakeSettings : UObject {
	FString HoursName; // 0x28
	FString MinutesName; // 0x38
	FString SecondsName; // 0x48
	FString FramesName; // 0x58
	FString SubFramesName; // 0x68
	FString SlateName; // 0x78
};

struct UCTHUDWidget : UCTUserWidget {
	FVector2D MissileDistanceToDragonMinMax; // 0x2f0
	FVector2D MissileRelDistanceToCenterMinMax; // 0x2f8
	float TargetDamageVignetteAlpha; // 0x300
	float PawnDetectionDistanceFromCenterRatio; // 0x304
	float LoadingRatio; // 0x30c
	FLinearColor LockedColor; // 0x310
	FVector2D PlayerDetectionScaleMapIn; // 0x320
	FVector2D PlayerDetectionScaleMapOut; // 0x328
	FLinearColor HitFeedbackColor; // 0x330
	float VignetteFadeSpeed; // 0x340
	UCTMissileDetectionWidget* MissileAlertWidgetClass; // 0x348
	UCTMissileDetectionWidget* MissileDeniedWidgetClass; // 0x350
	UCTMissileDetectionWidget* MissileEnduredWidgetClass; // 0x358
	UCTDetectionWidget* PawnDetectionWidgetClass; // 0x360
	TArray<UCTMissileDetectionWidget*> MissileAlertWidgets; // 0x368
	TArray<FAnimationMissileWidget> MissileDeniedWidgets; // 0x378
	TArray<FAnimationMissileWidget> MissileEnduredWidgets; // 0x388
	TArray<UCTDetectionWidget*> PawnDetectionWidgets; // 0x398
	TArray<UCTDetectionWidget*> AIPawnDetectionWidgets; // 0x3a8
	ESlateVisibility BurningVisibility; // 0x3b8
	UCTBattleShuffleWidget* BattleShuffleWidget; // 0x3c0
	UCTMouseControlFeedbackWidget* MouseFeedbackWidget; // 0x3c8
	UImage* DamageVignette; // 0x3d0
	UCTHealthBar* HealthBarWidget; // 0x418
	UCTStaminaBar* StaminaBarWidget; // 0x420
	float DurationBeforeOpponentMarkerHide; // 0x428
	UPanelWidget* ButtonsRightDown; // 0x430
	UCTGadgetButtonWidget* GadgetButtonWidget; // 0x438
	UCTGadgetButtonWidget* AbilityButtonWidget; // 0x440
	UWidget* BattleShuffleButtonCanvas; // 0x448
	UWidget* FireBallButtonCanvas; // 0x450
	UCTFireballActionWidget* FireballActionButtonWidget; // 0x458
	UWidget* FlameThrowerButtonCanvas; // 0x460
	UCTFlamethrowerActionWidget* FlamethrowerActionButton; // 0x468
	UWidget* BoostButtonCanvas; // 0x470
	UCTBoostActionWidget* BoostActionWidget; // 0x478
	UCanvasPanel* RootCanvas; // 0x490
	UCTCustomizationTabController* DebugCustomizationTabController; // 0x498
	UCTCustoMasterTabWidget* DebugCustoMasterTabWidget; // 0x4a0
	UCTUserWidget* FontAssetPerformanceTestClass; // 0x4a8
	UCTCustoMasterTabWidget* DebugCustoMasterTabWidgetClass; // 0x4b0
	FVector2D DetectionWidgetFadingRange; // 0x4b8
};

struct ACTTreasurePlayerState : ACTPlayerState {
	float CollectedTreasure; // 0x518
	UNiagaraSystem* GoldPickConfirmParticles; // 0x520
	USoundBase* PickupSound; // 0x528
	bool TreasureHolderTarget; // 0x530
};

struct APhysicsThruster : ARigidBodyBase {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x220
};

struct UBTComposite_SimpleParallel : UBTCompositeNode {
	EBTParallelMode FinishMode; // 0x90
};

struct UCollectionMapPoint_Upcoming_Selected_Pressed_C : UCTCollectionMapPointStateWidget {
	UImage* Image_97; // 0x2f0
};

struct UAkAudioEventData : UAkAssetDataSwitchContainer {
	float MaxAttenuationRadius; // 0xb8
	bool IsInfinite; // 0xbc
	float MinimumDuration; // 0xc0
	float MaximumDuration; // 0xc4
	TMap<FString, UAkAssetDataSwitchContainer*> LocalizedMedia; // 0xc8
	TSet<UAkAudioEvent*> PostedEvents; // 0x118
	TSet<UAkAuxBus*> UserDefinedSends; // 0x168
	TSet<UAkTrigger*> PostedTriggers; // 0x1b8
	TSet<UAkGroupValue*> GroupValues; // 0x208
};

struct UDragonOverviewStateButton_C : UCTDragonOverviewStateButton {
	UCTButton* BabyButton; // 0x4a8
	UCTButton* Dragonbutton; // 0x4b0
	UCTButton* EggButton; // 0x4b8
};

struct UCTModeFilterCell : UCTNavigationWidget {
	bool bActivated; // 0x440
	ECTMatchType MatchType; // 0x441
	UTextBlock* ModeDescription; // 0x448
	UTextBlock* ModeTitle; // 0x450
	UImage* ModeImage; // 0x458
	UImage* ModeOrnement; // 0x460
	UImage* ModeCheckImage; // 0x468
	UCTGameUserSettings* UserSettings; // 0x470
	bool bListenToUserSettings; // 0x478
	bool bWaitingForShowAnimation; // 0x479
	UVerticalBox* TextContainer; // 0x480
	float ShowAnimationTime; // 0x488
	UTexture2D* ModeCheckOffTexture; // 0x490
	UTexture2D* ModeCheckOnTexture; // 0x498
	UTexture2D* OrnementOffTexture; // 0x4a0
	UTexture2D* OrnementOnTexture; // 0x4a8
};

struct UCTCharacGadgetSelectionWidget1 : UCTUserWidget {
	URichTextBlock* ClassTitleText; // 0x2f0
	URichTextBlock* ClassDescriptionText; // 0x2f8
	int32_t MaxGadgetNameLength; // 0x300
	UImage* ClassIcon; // 0x308
	FLinearColor SpecialAbilityColor; // 0x310
	FLinearColor GadgetColor; // 0x320
	URichTextBlock* SpecialAbilityTitleText; // 0x330
	URichTextBlock* SpecialAbilityDescriptionText; // 0x338
	UImage* SpecialAbilityIcon; // 0x340
	URichTextBlock* Gadget1TitleText; // 0x348
	URichTextBlock* Gadget1DescriptionText; // 0x350
	UImage* Gadget1Icon; // 0x358
	URichTextBlock* Gadget2TitleText; // 0x360
	URichTextBlock* Gadget2DescriptionText; // 0x368
	UImage* Gadget2Icon; // 0x370
	UImage* SmallClassIcon; // 0x378
	URichTextBlock* NameText; // 0x380
	UImage* ItemImage; // 0x388
	UWidget* TimerScaleBox; // 0x390
	UCTGameRulesWidget* GameRulesButton; // 0x398
	UCTCharacGadgetDescButtonWidget1* DescriptionWidgetClass; // 0x3a0
};

struct ACTSpecialCollisionMesh : AActor {
	UBoxComponent* Collider; // 0x220
	bool BlockMine; // 0x228
};

struct USourceEffectSimpleDelayPreset : USoundEffectSourcePreset {
	FSourceEffectSimpleDelaySettings Settings; // 0xa8
};

struct UShowroomButton_C : UCTShowroomButton {
	UControllerIcon_C* ControllerIcon; // 0x448
	UCTButton* CTButton_1; // 0x450
};

struct UInfoPopup_FTUESkipTuto_C : UCTFTUEPopupWidget {
	UImage* Image; // 0x390
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UCTAbilityShuffle : UCTAbility {
	float BerserkAvailabilityTime; // 0xdc
	float SpearAvailabilityTime; // 0xe0
};

struct UABP_H02_Head03_Menu_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x318
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x338
};

struct UVariant : UObject {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xc0
};

struct UCTScoreLogBoxWidget : UCTLogBoxWidget {
	int32_t MaximumLow; // 0x308
	int32_t CurrentDisplayedLines; // 0x30c
	TArray<UCTScoreLogBoxLineWidget*> ScoreLogLines; // 0x310
};

struct ULiveLinkCurveRemapSettings : ULiveLinkSourceSettings {
	FLiveLinkCurveConversionSettings CurveConversionSettings; // 0xa0
};

struct UAnimCompress_PerTrackCompression : UAnimCompress_RemoveLinearKeys {
	float MaxZeroingThreshold; // 0x60
	float MaxPosDiffBitwise; // 0x64
	float MaxAngleDiffBitwise; // 0x68
	float MaxScaleDiffBitwise; // 0x6c
	TArray<AnimationCompressionFormat> AllowedRotationFormats; // 0x70
	TArray<AnimationCompressionFormat> AllowedTranslationFormats; // 0x80
	TArray<AnimationCompressionFormat> AllowedScaleFormats; // 0x90
	char bResampleAnimation : 1; // 0xa0
	float ResampledFramerate; // 0xa4
	int32_t MinKeysForResampling; // 0xa8
	char bUseAdaptiveError : 1; // 0xac
	char bUseOverrideForEndEffectors : 1; // 0xac
	int32_t TrackHeightBias; // 0xb0
	float ParentingDivisor; // 0xb4
	float ParentingDivisorExponent; // 0xb8
	char bUseAdaptiveError2 : 1; // 0xbc
	float RotationErrorSourceRatio; // 0xc0
	float TranslationErrorSourceRatio; // 0xc4
	float ScaleErrorSourceRatio; // 0xc8
	float MaxErrorPerTrackRatio; // 0xcc
	float PerturbationProbeSize; // 0xd0
};

struct UGameplayTagsSettings : UGameplayTagsList {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool ClearInvalidTags; // 0x4a
	bool FastReplication; // 0x4b
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct URightTriggerVisualizer_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UProgressBar* ProgressBar_46; // 0x268
	UTextBlock* TextBlock_55; // 0x270
	float Percent; // 0x278
};

struct UGroupSectionWidget_C : UCTGroupSectionWidget {
	UImage* Arrow; // 0x340
	UImage* Separator; // 0x348
	UImage* SquadIcon; // 0x350
};

struct UTexture2D : UTexture {
	int32_t LevelIndex; // 0x178
	int32_t FirstResourceMemMip; // 0x17c
	char bTemporarilyDisableStreaming : 1; // 0x180
	TextureAddress AddressX; // 0x181
	TextureAddress AddressY; // 0x182
	FIntPoint ImportedSize; // 0x184
};

struct UCTMissionsEventHomeController : UCTLiveEventWithDetailsCtrl {
	UCTMissionsLiveEventPlayNowCtrl* PlayNowWidgetControllerClass; // 0xa8
	UCTMissionsLiveEventPlayNowCtrl* PlayNowWidgetController; // 0xb0
};

struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x220
	FColor BrushColor; // 0x224
	int32_t PolyFlags; // 0x228
	char bColored : 1; // 0x22c
	char bSolidWhenSelected : 1; // 0x22c
	char bPlaceableFromClassBrowser : 1; // 0x22c
	char bNotForClientOrServer : 1; // 0x22c
	UModel* Brush; // 0x230
	UBrushComponent* BrushComponent; // 0x238
	char bInManipulation : 1; // 0x240
	TArray<FGeomSelection> SavedSelections; // 0x248
};

struct UExporter : UObject {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int32_t PreferredFormatIndex; // 0x58
	int32_t TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
	UAssetExportTask* ExportTask; // 0x68
};

struct UCTXPBoostLiveEvent : UCTPlayerLiveEvent {
	ECTXPBoostSubType SubType; // 0x60
	int32_t Ratio; // 0x64
};

struct UNoGroupMembersWidget_C : UCTUserWidget {
	UImage* ButtonBG; // 0x2f0
	UDefaultRichTextBlock_C* Description; // 0x2f8
};

struct ASwitchActor : AActor {
	USceneComponent* SceneComponent; // 0x238
	int32_t LastSelectedOption; // 0x240
};

struct UPlayFabMultiplayerAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x458
	UPlayFabJsonObject* RequestJsonObj; // 0x460
	UPlayFabJsonObject* ResponseJsonObj; // 0x468
};

struct UDragonDescriptionWidgetBP_C : UCTDragonDescriptionWidget {
	UImage* Arrow; // 0x378
	UImage* Arrow_2; // 0x380
	UImage* BackgroundImage; // 0x388
	UDefaultShadowWidget_C* DefaultShadowWidget; // 0x390
	UDiscoveredFrameBP_C* DiscoveredFrameBP; // 0x398
	UDefaultRichTextBlock_C* FirstAppearanceText; // 0x3a0
	UDefaultRichTextBlock_C* LocationText; // 0x3a8
	UOwnedFrameBP_C* OwnedFrameBP; // 0x3b0
	UOwned_Static_CollectionDragonCellWidgetBP_C* TestCell; // 0x3b8
};

struct UStreamMediaSource : UBaseMediaSource {
	FString StreamUrl; // 0x88
};

struct UCTEndMatchCommunityWidget : UCTUserWidget {
	UProgressBar* EventProgress; // 0x2f0
	URichTextBlock* ProgressTxt; // 0x2f8
};

struct UCTPlayerMirrorIndicatorWidget : UCTIndicatorWidget {
	UTextBlock* Name; // 0x3b0
};

struct UARBasicLightEstimate : UARLightEstimate {
	float AmbientIntensityLumens; // 0x28
	float AmbientColorTemperatureKelvin; // 0x2c
	FLinearColor AmbientColor; // 0x30
};

struct ACTPowerUp : AActor {
	USceneComponent* RootComp; // 0x228
	USphereComponent* CollisionComp; // 0x230
	UCTFilterConfigComponent* FilterConfigComp; // 0x238
	FMulticastInlineDelegate PowerUpCollectedEvent; // 0x240
	EBEDCollectibleType ItemType; // 0x250
	float RespawnDelay; // 0x254
	float MarkerRelativeHeight; // 0x258
	TArray<ACTBeastPawn*> PawnsInside; // 0x260
	bool bCollectable; // 0x270
	float LastCollectedTime; // 0x274
};

struct UCTTutorialPodiumWidget : UCTPodiumWidget {
	UCTFFLobbyButtonWidget* RetryButton; // 0x468
	UCTFFLobbyButtonWidget* ExitButton; // 0x470
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x2d0
	char bStopAILogicOnUnposses : 1; // 0x2d0
	char bLOSflag : 1; // 0x2d0
	char bSkipExtraLOSChecks : 1; // 0x2d0
	char bAllowStrafe : 1; // 0x2d0
	char bWantsPlayerState : 1; // 0x2d0
	char bSetControlRotationFromPawnOrientation : 1; // 0x2d0
	UPathFollowingComponent* PathFollowingComponent; // 0x2d8
	UBrainComponent* BrainComponent; // 0x2e0
	UAIPerceptionComponent* PerceptionComponent; // 0x2e8
	UPawnActionsComponent* ActionsComp; // 0x2f0
	UBlackboardComponent* Blackboard; // 0x2f8
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x300
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x308
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x310
};

struct UMaterialFunctionInstance : UMaterialFunctionInterface {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct UMovieSceneSkeletalAnimationTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
	bool bUseLegacySectionIndexBlend; // 0xa8
	FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams; // 0xb0
	bool bBlendFirstChildOfRoot; // 0xe0
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct UFoliageType_Actor : UFoliageType {
	AActor* ActorClass; // 0x3b0
	bool bShouldAttachToBaseComponent; // 0x3b8
};

struct USocialWidget_C : UCTSocialWidget {
	UAddFriendsWidget_C* AddFriendsWidget; // 0x330
	UImage* Background; // 0x338
	UFriendsWidget_C* FriendsWidget; // 0x340
	UGroupWidget_C* GroupWidget; // 0x348
	USocialTabBar_C* SocialTabBar_73; // 0x350
};

struct UNotificationsButton_C : UCTNotificationButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x488
	USizeBox* ControllerIconSizeBox; // 0x490
	UCTButton* CTButton_91; // 0x498
	UTextBlock* TextBlock_54; // 0x4a0
};

struct ACameraShakeSourceActor : AActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x220
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UAnimationAsset : UObject {
	USkeleton* Skeleton; // 0x38
	TArray<UAnimMetaData*> MetaData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x468
	float CapsuleRadius; // 0x46c
};

struct UMicroTransactionBase : UPlatformInterfaceBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x38
	FString LastError; // 0x48
	FString LastErrorSolution; // 0x58
};

struct UCustomizationClassWidget_C : UCTCustomizationClassWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x418
	UWidgetAnimation* PowerAndRageToGadgets; // 0x420
	UImage* Image; // 0x428
	UImage* Image_2; // 0x430
	UImage* Image_3; // 0x438
	UImage* Image_5; // 0x440
	UImage* Image_7; // 0x448
	UImage* Image_90; // 0x450
	UImage* Image_151; // 0x458
	UImage* Image_165; // 0x460
	UImage* Image_176; // 0x468
	UImage* Image_642; // 0x470
	URichTextBlock* PassiveLegend; // 0x478
	URichTextBlock* PassiveLegend_2; // 0x480
	URichTextBlock* PassiveLegend_3; // 0x488
	URichTextBlock* PassiveLegend_4; // 0x490
	URichTextBlock* RageLegend; // 0x498
};

struct UCTBerserkSettingsDB : UDataAsset {
	TArray<FBerserkTypeSettings> BerserkTypeSettings; // 0x30
};

struct UCTCustomInputConfig : UObject {
	TArray<FCTInputActionKeyMapping> ActionMappings; // 0x28
	TArray<FCTInputAxisKeyMapping> AxisMappings; // 0x38
};

struct ACTGoldProvider : ACTItemProvider {
	UPointLightComponent* LightTreasureDragon; // 0x430
	UCTGoldProviderAnimInstance* AnimInstance; // 0x438
	UCurveFloat* RespawnDelayByGameTime; // 0x440
	UCurveFloat* ProvidedGoldByGameTime; // 0x448
	int32_t GoldBonusOnDeath; // 0x450
	bool bIsBoss; // 0x454
	UPopcornFXEmitterComponent* PKFX_GoldDustBody; // 0x458
	UPopcornFXEmitterComponent* PKFX_GoldDustTrail; // 0x460
	UPopcornFXEmitterComponent* PKFX_GoldDustLeftWing; // 0x468
	UPopcornFXEmitterComponent* PKFX_GoldDustRightWing; // 0x470
	USkeletalMeshComponent* PKFX_Mesh; // 0x478
	float DustBodyGlowOpacityMax; // 0x480
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x340
	float LightFalloffExponent; // 0x344
	float SourceRadius; // 0x348
	float SoftSourceRadius; // 0x34c
	float SourceLength; // 0x350
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UCTResourceShopTabWidget : UCTScrollingShopTabWidget {
	UPanelWidget* DefaultPanel; // 0x420
	UPanelWidget* FullDefaultPanel; // 0x428
	UPanelWidget* FullStarterPackPanel; // 0x430
	UPanelWidget* StarterPackPanel; // 0x438
	UTextBlock* DefaultSectionTitle; // 0x440
	UTextBlock* StarterPackSectionTitle; // 0x448
	UCTNavigationScrollBox* ContentScrollBox; // 0x450
	UCTVeteranDiscountWidget* VeteranDiscountWidget; // 0x458
};

struct UJoinSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UCTItemButtonWidget : UCTNavigationWidget {
	FSlateBrush ItemBrush; // 0x440
	ECTMiscellanousShopSection Section; // 0x4c8
};

struct UCTStrikerPredator : UActorComponent {
	TArray<UCTStrikerPrey*> Preys; // 0xb0
	UMaterialInstanceDynamic* CameraPPMaterial; // 0xc0
	UCameraComponent* PPCameraTarget; // 0xc8
};

struct UEnvelopeFollowerListener : UActorComponent {
	FMulticastInlineDelegate OnEnvelopeFollowerUpdate; // 0xb0
};

struct UAREnvironmentCaptureProbe : UARTrackedGeometry {
	FVector Extent; // 0xf8
	UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture; // 0x108
};

struct UPlayButton_C : UNavMenuButtonWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4f0
	UCTButton* ChildButton; // 0x4f8
	UTextBlock* ChildButtonText; // 0x500
	FSlateFontInfo DefaultFont; // 0x508
	FSlateFontInfo HoverFont; // 0x560
	FSlateColor HoverTextColor; // 0x5b8
	FSlateColor DefaultTextColor; // 0x5e0
	FButtonStyle ButtonStyle; // 0x608
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char CastShadow : 1; // 0x38c
	char bCastDynamicShadow : 1; // 0x38c
	char bCastStaticShadow : 1; // 0x38c
	char bCastFarShadow : 1; // 0x390
	char bCastHiddenShadow : 1; // 0x394
	char bCastShadowAsTwoSided : 1; // 0x398
	char bAffectDistanceFieldLighting : 1; // 0x39c
	FLightingChannels LightingChannels; // 0x39d
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a0
	char bRenderCustomDepth : 1; // 0x3a0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3a4
	int32_t CustomDepthStencilValue; // 0x3a8
	float LDMaxDrawDistance; // 0x3ac
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b0
	int32_t CollisionMipLevel; // 0x3c8
	int32_t SimpleCollisionMipLevel; // 0x3cc
	float CollisionThickness; // 0x3d0
	FBodyInstance BodyInstance; // 0x3d8
	char bGenerateOverlapEvents : 1; // 0x530
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x530
	int32_t ComponentSizeQuads; // 0x534
	int32_t SubsectionSizeQuads; // 0x538
	int32_t NumSubsections; // 0x53c
	char bUsedForNavigation : 1; // 0x540
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x540
	bool bUseDynamicMaterialInstance; // 0x544
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x545
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x546
	bool bHasLayersContent; // 0x547
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x548
};

struct UHatchingNegativeButton_C : UCTCustomizableNavigationButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x6d0
};

struct ACTCaptureTheFlagGameMode : ACTGameModeBase {
	ACTFlagToCapture* FlagClass; // 0x3d0
	TArray<TWeakObjectPtr<ACTFlagToCaptureSpawner>> FlagSpawnerArray; // 0x3d8
	ACTFlagToCapture* Flag; // 0x3e8
	TArray<FPlayerTeam> Teams; // 0x3f0
	float fTimeFromLastDamage; // 0x400
	int32_t LastFlagSpawnerID; // 0x404
	float BonusFlagDistMin; // 0x408
	float BonusFlagDistMax; // 0x40c
	float BonusFlagValue; // 0x410
	float dotFlagMin; // 0x414
};

struct UMaterialExpressionPerInstanceCustomData : UMaterialExpression {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct UCTEggPopupWidget : UCTInfoPopupWidget {
	UImage* EggImage; // 0x378
	UImage* ClassIcon; // 0x380
	URichTextBlock* ClassText; // 0x388
	URichTextBlock* SubMessageText; // 0x390
	URichTextBlock* DescriptionText; // 0x398
	UCTNavigationWidget* CloseAndEquipButton; // 0x3a0
	UCTDiscoveryNotificationWidget* DiscoveryNotificationWidget; // 0x3a8
};

struct UParticleModuleAccelerationDragScaleOverLife : UParticleModuleAccelerationBase {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct URotatingMovementComponent : UMovementComponent {
	FRotator RotationRate; // 0xf0
	FVector PivotTranslation; // 0xfc
	char bRotationInLocalSpace : 1; // 0x108
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct ULuminApplicationLifecycleComponent : UApplicationLifecycleComponent {
	FMulticastInlineDelegate DeviceHasReactivatedDelegate; // 0x140
	FMulticastInlineDelegate DeviceWillEnterRealityModeDelegate; // 0x150
	FMulticastInlineDelegate DeviceWillGoInStandbyDelegate; // 0x160
	FMulticastInlineDelegate FocusLostDelegate; // 0x170
	FMulticastInlineDelegate FocusGainedDelegate; // 0x180
};

struct UABP_D03_Helmet04_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct USkeletalMeshSimplificationSettings : UDeveloperSettings {
	FName SkeletalMeshReductionModuleName; // 0x38
};

struct UPlatformEventsComponent : UActorComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct UCTNotificationWithImageButton : UCTNotificationButton {
	UCTExtendedRichTextBlock* NotificationTextBlock; // 0x488
	UImage* NotificationImage; // 0x490
};

struct UCTMissionsLiveEventPopupWidget : UCTLiveEventInfoPopupWidget {
	FVector2D SecondColumnQuestNudge; // 0x358
	FMargin QuestPadding; // 0x360
	UGridPanel* EventQuestsHolder; // 0x370
	UCTMissionsLiveEventPlayNowWidget* PlayButton; // 0x378
	UCTNavigationWidget* OverviewButton; // 0x380
};

struct UCTMissileCenterAimVisualizer : UCTUserWidget {
	UImage* MissileAimCircle; // 0x2f0
	FVector2D vRelDistBounds; // 0x2f8
};

struct UMaterialExpressionSphericalParticleOpacity : UMaterialExpression {
	FExpressionInput Density; // 0x40
	float ConstantDensity; // 0x54
};

struct UPlayFabAuthenticationAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa8
	UPlayFabJsonObject* RequestJsonObj; // 0xb0
	UPlayFabJsonObject* ResponseJsonObj; // 0xb8
};

struct UCTCustomizationSetPartTask : UCTCustomizationTask {
	USkeletalMeshComponent* TargetComponent; // 0x48
	FCharacterPart Part; // 0x50
	FCTPlayerSetup PlayerSetup; // 0x90
	TArray<UCTBodyPartModifierDataAsset*> PartModifiers; // 0x100
	UCTCompoundCustomizationTask* ModifiersTask; // 0x110
};

struct UCTEditProfileInfoPopupButtonWidget : UCTCustomizableNavigationButton {
	FString BreadcrumbPathChunk; // 0x6e8
	bool bEditionPopupOpen; // 0x6f8
};

struct UPopcornFXAttributeSamplerCurve : UPopcornFXAttributeSampler {
	EAttributeSamplerCurveDimension CurveDimension; // 0x200
	char bIsDoubleCurve : 1; // 0x204
	UCurveFloat* Curve1D; // 0x208
	UCurveFloat* SecondCurve1D; // 0x210
	UCurveVector* Curve3D; // 0x218
	UCurveVector* SecondCurve3D; // 0x220
	UCurveLinearColor* Curve4D; // 0x228
	UCurveLinearColor* SecondCurve4D; // 0x230
};

struct UCTConquestHUDWidget : UCTUserWidget {
	UImage* LocalZoneImage; // 0x2f0
	UImage* LocalPawnImage; // 0x2f8
	UTextBlock* LocalPawnText; // 0x300
	UPanelWidget* LocalPawnBox; // 0x308
	UImage* EnemyZoneImage; // 0x310
	UImage* EnemyPawnImage; // 0x318
	UTextBlock* EnemyPawnText; // 0x320
	UPanelWidget* EnemyPawnBox; // 0x328
	UImage* ZoneImage; // 0x330
};

struct UCTLTSRescueDeathMeter : UCTUserWidget {
	UImage* MeterImage; // 0x2f0
	UImage* SkullImage; // 0x2f8
};

struct UPlanarReflectionComponent : USceneCaptureComponent {
	UBoxComponent* PreviewBox; // 0x2b0
	float NormalDistortionStrength; // 0x2b8
	float PrefilterRoughness; // 0x2bc
	float PrefilterRoughnessDistance; // 0x2c0
	int32_t ScreenPercentage; // 0x2c4
	float ExtraFOV; // 0x2c8
	float DistanceFromPlaneFadeStart; // 0x2cc
	float DistanceFromPlaneFadeEnd; // 0x2d0
	float DistanceFromPlaneFadeoutStart; // 0x2d4
	float DistanceFromPlaneFadeoutEnd; // 0x2d8
	float AngleFromPlaneFadeStart; // 0x2dc
	float AngleFromPlaneFadeEnd; // 0x2e0
	bool bShowPreviewPlane; // 0x2e4
	bool bRenderSceneTwoSided; // 0x2e5
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UCTAutoScrollBox : UCTUserWidget {
	UScrollBox* ScrollBox; // 0x2f8
	URichTextBlock* Text; // 0x300
	UDataTable* TextStyleSet; // 0x308
	float WaitingTime; // 0x310
	float ScrollSpeed; // 0x314
	float Margin; // 0x318
	EAutoScrollTypeEnum ScrollType; // 0x31c
};

struct ACTMegaSpearRack : AActor {
	UCTCollectableComponent2D* CollectableComponent; // 0x220
	UCapsuleComponent* CollisionComp; // 0x228
	UStaticMeshComponent* RingMeshComp; // 0x230
	USceneComponent* MarkerRoot; // 0x238
	UCT2DMarkerComponent* MarkerComponent; // 0x240
	float Overlap3DMarkersFadeDistance; // 0x248
	float UIMarkerOpacity; // 0x24c
	bool IsMarkerVisible; // 0x250
	USceneComponent* AdditionalContentComp; // 0x258
	EItemProviderTrigger Trigger; // 0x260
	char NumFragTriggerSpawn; // 0x261
	int32_t TimeTriggerSpawn; // 0x264
	bool bInfiniteSpear; // 0x268
	UCTMegaSpearHUDWidget* MegaSpearHUDWidgetClass; // 0x270
	UCTMegaSpearHUDWidget* MegaSpearHUDWidget; // 0x278
	UParticleSystemComponent* LightPillar; // 0x280
	ACTBeastPawn* CurrentSpearHolder; // 0x290
};

struct UCTMissionsLiveEventPlayNowWidget : UCTNavigationWidget {
	UTextBlock* PlayNowText; // 0x440
	UTextBlock* ErrorText; // 0x448
};

struct UCTRescueCellWidget : UCTUserWidget {
	UImage* CellImage; // 0x2f0
};

struct UCTOptionsMouseSensVerticalCtrl : UCTOptionsParameterSliderCtrl {
	UCTMouseSettingsConfig* MouseSettingsConfig; // 0x118
};

struct UCTRenownProgressionWidget : UCTUserWidget {
	float LevelPercentage; // 0x2f0
	UCTRenownCellWidget* RenownCellWidgetClass; // 0x2f8
	TArray<UCTRenownCellWidget*> RenownCells; // 0x300
	UPanelWidget* RenownCellsContainer; // 0x310
	UCTRenownGaugeWidget* RenownGaugeWidget; // 0x318
};

struct UInterpTrackFloatBase : UInterpTrack {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UCTSocialUserController : UCTWidgetController {
	UCTSocialUserWidget* WidgetClass; // 0xc0
	UCTSocialUserWidget* SocialUserWidget; // 0xc8
};

struct UCTResourceShopPopupButton : UCTPinableShopPackageButtonWidget {
	bool bPurchaseInProgress; // 0x480
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct UCTCharAbilityWorkshop : UCTAISpawningWorkshop {
	UCTAbilityStriker* StrikerAbility; // 0x1d0
	float CooldownReductionOnMiss; // 0x1dc
};

struct UCTScrollingShopTabController : UCTShopTabController {
	int32_t MaxButtonsOnScreen; // 0xc8
	int32_t CurrentFirstButtonIndex; // 0xcc
	float ButtonsSize; // 0xd0
};

struct UNoFriendsWidget_C : UCTUserWidget {
	UImage* ButtonBG; // 0x2f0
	UDefaultRichTextBlock_C* Description; // 0x2f8
};

struct UABP_MegaSpearBands_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x318
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x340
	FVector FakeWind; // 0xb70
};

struct UCTLocalSaveGame : USaveGame {
	int32_t SaveVersion; // 0x28
	FCTLocalSaveContent Content; // 0x30
};

struct ATA_BP_FlamethrowerDecal_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UDecalComponent* Decal; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
	float Timeline_0_DecalScale_10454B304C657300F17C189C1A71CEBD; // 0x238
	float Timeline_0_DissolveFire_10454B304C657300F17C189C1A71CEBD; // 0x23c
	float Timeline_0_DissolveAmber_10454B304C657300F17C189C1A71CEBD; // 0x240
	float Timeline_0_Fire_10454B304C657300F17C189C1A71CEBD; // 0x244
	ETimelineDirection Timeline_0__Direction_10454B304C657300F17C189C1A71CEBD; // 0x248
	UTimelineComponent* Timeline_1; // 0x250
	FVector Decal StartScale; // 0x258
	FVector Decal EndScale; // 0x264
};

struct UCTStrikethroughPriceShopWidget : UCTUserWidget {
	URichTextBlock* Price; // 0x2f0
	UWidget* CurrencyWidget; // 0x2f8
	UImage* CurrencyImage; // 0x300
	FSlateBrush SoftCurrency; // 0x308
	FSlateBrush HardCurrency; // 0x390
};

struct UOptionsSectionTitleAudio_C : UCTOptionsSectionTitleWidget {
	UDefaultRichTextBlock_C* Audio; // 0x2f0
	UHorizontalBox* LabelsHolder; // 0x2f8
	UImage* OptionsSplitter_4; // 0x300
	UDefaultRichTextBlock_C* Settings; // 0x308
};

struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28
	uint32_t PoolPrimeSize; // 0x2c
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct UOodleNetworkTrainerCommandlet : UCommandlet {
	bool bCompressionTest; // 0x80
	int32_t HashTableSize; // 0x84
	int32_t DictionarySize; // 0x88
	int32_t DictionaryTrials; // 0x8c
	int32_t TrialRandomness; // 0x90
	int32_t TrialGenerations; // 0x94
	bool bNoTrials; // 0x98
};

struct UCTMegaWeaponHUDMessage : UCTUserWidget {
	UTextBlock* MegaWeaponRichText; // 0x2f0
};

struct UPostEventAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
};

struct UPlayFabDataAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xf8
	UPlayFabJsonObject* RequestJsonObj; // 0x100
	UPlayFabJsonObject* ResponseJsonObj; // 0x108
};

struct UCTMissionsLiveEventPlayNowCtrl : UCTWidgetController {
	UCTMissionsLiveEventPlayNowWidget* PlayNowWidget; // 0xa0
	UCTPlayerLiveEvent* LiveEvent; // 0xa8
};

struct UEditableGeometryCollectionAdapter : UEditableMeshAdapter {
	UGeometryCollection* GeometryCollection; // 0x28
	UGeometryCollection* OriginalGeometryCollection; // 0x30
	int32_t GeometryCollectionLODIndex; // 0x38
};

struct UMovieSceneSignedObject : UObject {
	FGuid Signature; // 0x28
};

struct UOnlineEngineInterfaceImpl : UOnlineEngineInterface {
	TMap<FName, FName> MappedUniqueNetIdTypes; // 0x28
	TArray<FName> CompatibleUniqueNetIdTypes; // 0x78
	FName VoiceSubsystemNameOverride; // 0x88
};

struct USourceEffectEnvelopeFollowerPreset : USoundEffectSourcePreset {
	FSourceEffectEnvelopeFollowerSettings Settings; // 0x9c
};

struct UCTCollectionMapTopUIController : UCTWidgetController {
	UCTCollectionClassInfoController* ClassInfoClass; // 0x110
	UCTCollectionClassInfoController* ClassInfo; // 0x118
	UCTDragonDescriptionController* DragonsDescriptionClass; // 0x120
	UCTDragonDescriptionController* DragonsDescription; // 0x128
	UCTDragonsListController* DragonsListClass; // 0x130
	UCTDragonsListController* DragonsList; // 0x138
	UCTCollectionMapTopUIWidget* TopUIWidget; // 0x140
};

struct UMaterialExpressionNamedRerouteUsage : UMaterialExpressionNamedRerouteBase {
	UMaterialExpressionNamedRerouteDeclaration* Declaration; // 0x40
	FGuid DeclarationGuid; // 0x48
};

struct UPopcornFXAttributeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x98
};

struct UCTMovAreaInputCollection_Gamepad : UCTMovableAreaInput_Gamepad {
	float StopMovementConsideredDelay; // 0x130
};

struct UCTNetRDVComponent : UActorComponent {
	TArray<FCTRDV> TabRDV; // 0xc0
	int32_t MyCTPlayerId; // 0xd0
};

struct UInterpTrackInstAkAudioEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct ABP_ShowroomCamera_C : ACTCamera {
	UCineCameraComponent* CineCamera; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x80
	float LpvBiasMultiplier; // 0x84
	TArray<FStaticMaterial> StaticMaterials; // 0x88
	float LightmapUVDensity; // 0x98
	int32_t LightMapResolution; // 0x9c
	int32_t LightMapCoordinateIndex; // 0xa0
	float DistanceFieldSelfShadowBias; // 0xa4
	UBodySetup* BodySetup; // 0xa8
	int32_t LODForCollision; // 0xb0
	char bGenerateMeshDistanceField : 1; // 0xb4
	char bStripComplexCollisionForConsole : 1; // 0xb4
	char bHasNavigationData : 1; // 0xb4
	char bSupportUniformlyDistributedSampling : 1; // 0xb4
	char bSupportPhysicalMaterialMasks : 1; // 0xb4
	char bSupportRayTracing : 1; // 0xb4
	char bIsBuiltAtRuntime : 1; // 0xb4
	char bAllowCPUAccess : 1; // 0xb5
	char bSupportGpuUniformlyDistributedSampling : 1; // 0xb5
	TArray<UStaticMeshSocket*> Sockets; // 0xd8
	FVector PositiveBoundsExtension; // 0xf8
	FVector NegativeBoundsExtension; // 0x104
	FBoxSphereBounds ExtendedBounds; // 0x110
	int32_t ElementToIgnoreForTexFactor; // 0x12c
	TArray<UAssetUserData*> AssetUserData; // 0x130
	UObject* EditableMesh; // 0x140
	UNavCollisionBase* NavCollision; // 0x148
};

struct UNiagaraDataInterfacePlatformSet : UNiagaraDataInterface {
	FNiagaraPlatformSet Platforms; // 0x38
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UCTChiefDashPlayerWidgetAccessory : UCTPlayerWidgetAccessory {
	UImage* ChargeDistanceSprite; // 0x300
	UImage* ProtectedIndicator; // 0x308
	FVector2D ProtectedIndicatorOffset_PIndicator; // 0x310
	FVector2D ProtectedIndicatorOffset_PDetection; // 0x318
};

struct UFontFace : UObject {
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42
};

struct UCTFTUESectionWidget : UCTUserWidget {
	URichTextBlock* SectionTextBlock; // 0x2f0
	UImage* SectionIcon; // 0x2f8
};

struct UCTNetRDVTool : UActorComponent {
	TArray<FCTNetRDVSignal> TabSignals; // 0xb0
};

struct UCTMatchMakingBannerWidget : UCTUserWidget {
	UCTTextBlock* MatchMakingJoiningText; // 0x2f0
	UCTTextBlock* MatchMakingProhibitedText; // 0x2f8
	UCTXpBoostIndicatorEventWidget* BoostXpEventIndicator; // 0x300
	UWidget* CancelCanvas; // 0x308
	UCTNavigationWidget* CancelButton; // 0x310
};

struct UCTEndMatchRowQuestController : UCTEndMatchRowController {
	UCTEndMatchQuestWidget* QuestWidget; // 0x150
	UCTQuestsManager* QuestsManager; // 0x158
	FName InstanceId; // 0x160
	FName QuestID; // 0x168
	float FillDuration; // 0x170
	float UpdateValueDuration; // 0x174
};

struct UAudioSettings : UDeveloperSettings {
	FSoftObjectPath DefaultSoundClassName; // 0x38
	FSoftObjectPath DefaultMediaSoundClassName; // 0x50
	FSoftObjectPath DefaultSoundConcurrencyName; // 0x68
	FSoftObjectPath DefaultBaseSoundMix; // 0x80
	FSoftObjectPath VoiPSoundClass; // 0x98
	FSoftObjectPath MasterSubmix; // 0xb0
	FSoftObjectPath BaseDefaultSubmix; // 0xc8
	FSoftObjectPath ReverbSubmix; // 0xe0
	FSoftObjectPath EQSubmix; // 0xf8
	EVoiceSampleRate VoiPSampleRate; // 0x110
	float DefaultReverbSendLevel; // 0x114
	int32_t MaximumConcurrentStreams; // 0x118
	float GlobalMinPitchScale; // 0x11c
	float GlobalMaxPitchScale; // 0x120
	TArray<FAudioQualitySettings> QualityLevels; // 0x128
	char bAllowPlayWhenSilent : 1; // 0x138
	char bDisableMasterEQ : 1; // 0x138
	char bAllowCenterChannel3DPanning : 1; // 0x138
	uint32_t NumStoppingSources; // 0x13c
	EPanningMethod PanningMethod; // 0x140
	EMonoChannelUpmixMethod MonoChannelUpmixMethod; // 0x141
	FString DialogueFilenameFormat; // 0x148
	TArray<FSoundDebugEntry> DebugSounds; // 0x158
	TArray<FDefaultAudioBusSettings> DefaultAudioBuses; // 0x168
	USoundClass* DefaultSoundClass; // 0x178
	USoundClass* DefaultMediaSoundClass; // 0x180
	USoundConcurrency* DefaultSoundConcurrency; // 0x188
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct UCTShopMasterTabWidget : UCTUserWidget {
	UCTShopLoadingWidget* MainMenuTabLoadingWidget; // 0x2f0
	float EndLoadDelay; // 0x2f8
	UCanvasPanel* VeteranDiscountCanvas; // 0x300
	UCanvasPanel* NonVeteranDiscountCanvas; // 0x308
	UCTVeteranDiscountWidget* VeteranDiscountWidget; // 0x310
	UCTDiscountWidget* NonVeteranDiscountWidget; // 0x318
};

struct UWeaponDatabase : UDataAsset {
	TArray<FWeaponDatas> Weapons; // 0x30
};

struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	FScrollBarStyle ScrollBarStyle; // 0x30
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x230
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UToFloatField : UFieldNodeFloat {
	UFieldNodeInt* IntField; // 0xb0
};

struct UCTItemsSubTabController : UCTScrollingShopTabController {
	ECTMiscellanousShopSection Section; // 0xd8
};

struct UCTAirColumnsWorkshop : UCTTutorialWorkShop {
	int32_t AirColumnsToPass; // 0x19c
};

struct AACTFancyProp : AActor {
	UStaticMeshComponent* RootMesh; // 0x220
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x220
};

struct UCTClassStatsWidget : UCTUserWidget {
	UCanvasPanel* ClassCanvasHolder; // 0x2f0
	URichTextBlock* ClassNameText; // 0x2f8
	URichTextBlock* HoursOfUseText; // 0x300
	UProgressBar* ProgressBar; // 0x308
	UImage* BarClassImage; // 0x310
};

struct ACTMegaSpear : ACTProjectileSpawn {
	UCTProjectileComponent* ProjectileComponent; // 0x270
	FMegaSpearSettings MegaSpearSettings; // 0x278
	UParticleSystem* MegaSpearFX; // 0x288
	UParticleSystemComponent* MegaSpearFXComp; // 0x290
	UStaticMeshComponent* AdditionalContentComp; // 0x298
	float DestroyTime; // 0x2a0
	float FallingTime; // 0x2a4
	USphereComponent* ColSphereSpearComp; // 0x2b0
	AActor* CurrentTarget; // 0x2b8
	float Speed; // 0x2c0
	USoundBase* LoopSound; // 0x2d8
	USoundBase* ImpactSound; // 0x2e0
	UAudioComponent* AudioComponent; // 0x2e8
	UAkComponent* WwiseComponent; // 0x2f0
};

struct UCTMouseSettingsConfig : UObject {
	float MouseSensitivityX; // 0x28
	float MouseSensitivityY; // 0x2c
	EMouseControlType MouseControlType; // 0x30
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x598
};

struct UCTLinkedArmamentController : UCTArmamentController {
	TMap<EArmamentType, UCTLinkedArmament*> Armaments; // 0x50
	UCTLinkedArmament* MainArmament; // 0xa0
};

struct UStaminaBarWidget_C : UCTStaminaBar {
	FPointerToUberGraphFrame UberGraphFrame; // 0x320
	UWidgetAnimation* OnInfiniteBoostUse; // 0x328
	UImage* HorizontalShine; // 0x330
	UImage* LeftSide; // 0x338
	UImage* PLACEHOLDER_InfBoostAnimation; // 0x340
	UImage* RightSide; // 0x348
	UStaminaSlotWidget_C* StaminaSlotWidget1; // 0x350
	UStaminaSlotWidget_C* StaminaSlotWidget2; // 0x358
	UStaminaSlotWidget_C* StaminaSlotWidget3; // 0x360
	UStaminaSlotWidget_C* StaminaSlotWidget4; // 0x368
	UImage* WaveL; // 0x370
	UImage* WaveR; // 0x378
	UMaterialInstanceDynamic* Stamina Bar Material Instance; // 0x380
	TArray<UImage*> StaminaWidget; // 0x388
	float OldStaminaValue; // 0x398
};

struct UAkGroupValue : UAkAudioType {
	uint32_t GroupShortID; // 0x40
};

struct ABP_SmokeBomb_C : ACTSmokeBomb {
	USceneComponent* Scene; // 0x3c0
};

struct UCustomizeNavigationButton_C : UCTCustomizeButtonWidget {
	UWidgetAnimation* BuyAnimation; // 0x4d0
	UImage* InUseImage; // 0x4d8
	UImage* ItemImage; // 0x4e0
	URichTextBlock* ItemName; // 0x4e8
	UCTButton* ShopButton; // 0x4f0
};

struct UABP_H04_Head01_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct ABP_FlameController_C : ACTFXFlameController {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	USceneComponent* FXSocket; // 0x240
	USceneComponent* DefaultSceneRoot; // 0x248
	ABP_Flamethrower_C* FlameThrowerFX; // 0x250
	FMulticastInlineDelegate OnHit; // 0x258
	float LastSpawnTime; // 0x268
	TArray<AActor*> FXListRoof; // 0x270
};

struct UMineIndicatorWidget_C : UCTMineIndicatorWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f8
	UWidgetAnimation* AnimSuccess; // 0x300
	UWidgetAnimation* AnimFail; // 0x308
	UWidgetAnimation* AnimShow; // 0x310
	UWidgetAnimation* GreenToRed; // 0x318
	UImage* AnchoringIndicator; // 0x320
	UImage* Baton_BD; // 0x328
	UImage* Baton_BG; // 0x330
	UImage* Baton_HD; // 0x338
	UImage* Baton_HG; // 0x340
	UCanvasPanel* Canvas; // 0x348
};

struct UCTOptionsMouseSensHorizontalCtrl : UCTOptionsParameterSliderCtrl {
	UCTMouseSettingsConfig* MouseSettingsConfig; // 0x118
};

struct UMovementComponent : UActorComponent {
	USceneComponent* UpdatedComponent; // 0xb0
	UPrimitiveComponent* UpdatedPrimitive; // 0xb8
	FVector Velocity; // 0xc4
	FVector PlaneConstraintNormal; // 0xd0
	FVector PlaneConstraintOrigin; // 0xdc
	char bUpdateOnlyIfRendered : 1; // 0xe8
	char bAutoUpdateTickRegistration : 1; // 0xe8
	char bTickBeforeOwner : 1; // 0xe8
	char bAutoRegisterUpdatedComponent : 1; // 0xe8
	char bConstrainToPlane : 1; // 0xe8
	char bSnapToPlaneAtStart : 1; // 0xe8
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xe8
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb
};

struct UNiagaraDataInterfaceArrayFloat : UNiagaraDataInterfaceArray {
	TArray<float> FloatData; // 0x50
};

struct UButtonStyleAsset : UObject {
	FButtonStyle ButtonStyle; // 0x28
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UABP_D02_CopyPose_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	EGainParamMode GainMode; // 0x68
	float OutputVolume; // 0x6c
	float WetLevel; // 0x70
	float DryLevel; // 0x74
	FSoundModulationDestinationSettings OutputVolumeModulation; // 0x78
	FSoundModulationDestinationSettings WetLevelModulation; // 0x88
	FSoundModulationDestinationSettings DryLevelModulation; // 0x98
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0xa8
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UNiagaraComponentPool : UObject {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UPop_CTFRules_C : UCTGameModeRulesWidget {
	UDefaultTextBlock_C* DefaultTextBlock; // 0x380
	UDefaultTextBlock_C* DefaultTextBlock_181; // 0x388
	UDefaultTextBlock_C* DefaultTextBlock_300; // 0x390
	UImage* Image; // 0x398
	UImage* Image_2; // 0x3a0
	UImage* Image_3; // 0x3a8
	UImage* Image_4; // 0x3b0
	UImage* Image_95; // 0x3b8
	UImage* Image_458; // 0x3c0
	UImage* Image_562; // 0x3c8
	UImage* LargeTexture; // 0x3d0
};

struct ACTGameState : ACTGameStateBase {
	float DefaultGameDuration; // 0x2b8
	bool bShieldAtStart; // 0x2bc
	bool bSuddenDeathWithoutTimer; // 0x2bd
	bool bLobbyOnHold; // 0x2be
	TSoftClassPtr<UObject> UIComponentClass; // 0x2c0
	UCTBattleEventComponent* BattleEvent; // 0x2e8
	UCTBattleEventLoggerComponent* BattleEventLogger; // 0x2f0
	UCTBattleEventScoringComponent* BattleEventScoring; // 0x2f8
	UCTBattleEventHUDComponent* BattleEventHUD; // 0x300
	FCTNemesisData NemesisData; // 0x308
	UCTAbilityManagerComponent* AbilityManagerClass; // 0x330
	UCTLanternComponent* LanternComponentClass; // 0x338
	UScoringDatabase* ScoringDatabase; // 0x340
	UBigMessagesDatabase* BigMessagesDatabase; // 0x348
	UCTWidgetsDataBase* WidgetsDataBase; // 0x350
	UCTBerserkSettingsDB* BerserkSettingsDataBase; // 0x358
	TArray<UTexture2D*> ScoreBoardImages; // 0x360
	bool bDoesShowSpecialActionOnScoreboard; // 0x370
	ACTFragMarkerObject* FragMarkerClass; // 0x378
	TArray<FDragonXPSpawnerInfos> DragonXPSpawnerInfos; // 0x380
	TArray<TWeakObjectPtr<ACTDragonXPPickup>> DragonXPSpawnerArray; // 0x390
	int32_t iWarmUpHeroPlayerID; // 0x3a0
	TArray<AVolume*> OOBVolumes; // 0x3a8
	TArray<ACTPingZoneVolume*> PingZoneVolumes; // 0x3b8
	EPodiumMode PodiumMode; // 0x3c8
	int32_t PodiumPlayerCount; // 0x3cc
	UWeaponDatabase* WeaponDatabaseClass; // 0x3d0
	UWeaponDatabase* WeaponDatabase; // 0x3d8
	UCTWallHitDB* WallHitClass; // 0x3e0
	UCTWallHitDB* WallHitDB; // 0x3e8
	float DefaultPlayerHealth; // 0x3f0
	UCTLevelSequence* IntroRTC; // 0x3f8
	ACTNetComMgr* NetComMgr; // 0x400
	TArray<FCTPlayerInfos> TabPlayerInfos; // 0x408
	FCTMatchInfo MatchInfo; // 0x418
	TArray<AActor*> TabLockable; // 0x440
	float LocalTimeInStatus; // 0x450
	float ServerEnterStatusTime; // 0x454
	int32_t ServerEnterGamePlayEPOCH; // 0x458
	int32_t ServerEndGamePlayEPOCH; // 0x45c
	ACTCamera* SpectatorCamera; // 0x460
	EGameStatus GameStatus; // 0x469
	float TimeDisplayingEndMatchSummary; // 0x46c
	float GameStartTime; // 0x470
	float GameResultStartTime; // 0x474
	int32_t GameRandomSeed; // 0x478
	UCTTeamsDataAsset* TeamsDataAsset; // 0x480
	UCTTeamsColorDataAsset* TeamsColorDataAsset; // 0x488
	TArray<TWeakObjectPtr<ACTShieldRack>> ShieldRackArray; // 0x598
	TArray<TWeakObjectPtr<ACTInfiniteBoostPowerUp>> InfiniteBoostArray; // 0x5a8
	TArray<ACTCaptureZone*> CaptureZones; // 0x5b8
	UCTGameStateUIManagerComponent* UIComponent; // 0x5c8
	EGameResultMode PrevGameResult; // 0x608
	EGameResultMode CurGameResult; // 0x609
	float LobbyStartServerTime; // 0x60c
	float LobbyEndServerTime; // 0x610
	float ExtraLobbyDurationPerMissingPlayer; // 0x614
	float TotalLobbyDuration; // 0x618
	float MaxLobbyDuration; // 0x61c
	float ClosureTimeBeforeLobbyEnds; // 0x620
	float CharacChoiceEndTimeBeforeLobbyEnds; // 0x624
	TArray<ACTAIBeastPawn*> AIPawns; // 0x628
	TArray<ACTItemProvider*> ItemProviders; // 0x638
	UCTWidgetsHighlightingAsset* WidgetsHighlightingAsset; // 0x648
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	bool bLockPreviousCamera; // 0xf0
	FGuid CameraGuid; // 0xf4
	FMovieSceneObjectBindingID CameraBindingID; // 0x104
	FTransform InitialCameraCutTransform; // 0x120
	bool bHasInitialCameraCutTransform; // 0x150
};

struct UCTNavigationLayer : UCanvasPanel {
	FMulticastInlineDelegate OnNavigationInput; // 0x130
	FMulticastInlineDelegate OnNavigationKeyDown; // 0x140
	FMulticastInlineDelegate OnKeyDown; // 0x150
	FMulticastInlineDelegate OnPreviewKeyDown; // 0x160
	FMulticastInlineDelegate OnKeyUp; // 0x170
	FMulticastInlineDelegate OnAnalogValueChanged; // 0x180
	FMulticastInlineDelegate OnMouseButtonDown; // 0x190
	FMulticastInlineDelegate OnMouseButtonDoubleClick; // 0x1a0
	FMulticastInlineDelegate OnMouseButtonUp; // 0x1b0
	FMulticastInlineDelegate OnMouseMove; // 0x1c0
	FMulticastInlineDelegate OnMouseEnter; // 0x1d0
	FMulticastInlineDelegate OnMouseLeave; // 0x1e0
	TArray<UCTNavigationWidget*> NavigationWidgets; // 0x208
	UCTNavigationWidget* DefaultWidget; // 0x218
	UCTNavigationWidget* LastFocusedWidget; // 0x220
	bool bIsPushed; // 0x228
	bool bIsActive; // 0x229
	bool bIsEditionMode; // 0x22a
	int32_t Priority; // 0x22c
	bool bIsAffectedByTimeDilation; // 0x230
};

struct UChaosClothConfig : UClothConfigCommon {
	EClothMassMode MassMode; // 0x28
	float UniformMass; // 0x2c
	float TotalMass; // 0x30
	float Density; // 0x34
	float MinPerParticleMass; // 0x38
	float EdgeStiffness; // 0x3c
	float BendingStiffness; // 0x40
	bool bUseBendingElements; // 0x44
	float AreaStiffness; // 0x48
	float VolumeStiffness; // 0x4c
	FChaosClothWeightedValue TetherStiffness; // 0x50
	float LimitScale; // 0x58
	bool bUseGeodesicDistance; // 0x5c
	float ShapeTargetStiffness; // 0x60
	float CollisionThickness; // 0x64
	float FrictionCoefficient; // 0x68
	bool bUseCCD; // 0x6c
	bool bUseSelfCollisions; // 0x6d
	float SelfCollisionThickness; // 0x70
	bool bUseLegacyBackstop; // 0x74
	float DampingCoefficient; // 0x78
	bool bUsePointBasedWindModel; // 0x7c
	float DragCoefficient; // 0x80
	float LiftCoefficient; // 0x84
	bool bUseGravityOverride; // 0x88
	float GravityScale; // 0x8c
	FVector Gravity; // 0x90
	FChaosClothWeightedValue AnimDriveStiffness; // 0x9c
	FChaosClothWeightedValue AnimDriveDamping; // 0xa4
	FVector LinearVelocityScale; // 0xac
	float AngularVelocityScale; // 0xb8
	float FictitiousAngularScale; // 0xbc
	bool bUseTetrahedralConstraints; // 0xc0
	bool bUseThinShellVolumeConstraints; // 0xc1
	bool bUseContinuousCollisionDetection; // 0xc2
};

struct UHoudiniAssetComponent : UPrimitiveComponent {
	UHoudiniAsset* HoudiniAsset; // 0x458
	bool bCookOnParameterChange; // 0x460
	bool bUploadTransformsToHoudiniEngine; // 0x461
	bool bCookOnTransformChange; // 0x462
	bool bCookOnAssetInputCook; // 0x463
	bool bOutputless; // 0x464
	bool bOutputTemplateGeos; // 0x465
	bool bUseOutputNodes; // 0x466
	FDirectoryPath TemporaryCookFolder; // 0x468
	FDirectoryPath BakeFolder; // 0x478
	EHoudiniStaticMeshMethod StaticMeshMethod; // 0x488
	FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties; // 0x490
	FMeshBuildSettings StaticMeshBuildSettings; // 0x638
	bool bOverrideGlobalProxyStaticMeshSettings; // 0x668
	bool bEnableProxyStaticMeshOverride; // 0x669
	bool bEnableProxyStaticMeshRefinementByTimerOverride; // 0x66a
	float ProxyMeshAutoRefineTimeoutSecondsOverride; // 0x66c
	bool bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x670
	bool bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x671
	int32_t AssetId; // 0x674
	TArray<int32_t> NodeIdsToCook; // 0x678
	TSet<UHoudiniAssetComponent*> DownstreamHoudiniAssets; // 0x688
	FGuid ComponentGUID; // 0x6d8
	FGuid HapiGUID; // 0x6e8
	FString HapiAssetName; // 0x6f8
	EHoudiniAssetState AssetState; // 0x708
	EHoudiniAssetState DebugLastAssetState; // 0x709
	EHoudiniAssetStateResult AssetStateResult; // 0x70a
	uint32_t SubAssetIndex; // 0x70c
	int32_t AssetCookCount; // 0x710
	bool bHasBeenLoaded; // 0x714
	bool bHasBeenDuplicated; // 0x715
	bool bPendingDelete; // 0x716
	bool bRecookRequested; // 0x717
	bool bRebuildRequested; // 0x718
	bool bEnableCooking; // 0x719
	bool bForceNeedUpdate; // 0x71a
	bool bLastCookSuccess; // 0x71b
	bool bParameterDefinitionUpdateNeeded; // 0x71c
	bool bBlueprintStructureModified; // 0x71d
	bool bBlueprintModified; // 0x71e
	TArray<UHoudiniParameter*> Parameters; // 0x720
	TArray<UHoudiniInput*> Inputs; // 0x730
	TArray<UHoudiniOutput*> Outputs; // 0x740
	TArray<FHoudiniBakedOutput> BakedOutputs; // 0x750
	TArray<TWeakObjectPtr<AActor>> UntrackedOutputs; // 0x760
	TArray<UHoudiniHandleComponent*> HandleComponents; // 0x770
	bool bHasComponentTransformChanged; // 0x780
	bool bFullyLoaded; // 0x781
	UHoudiniPDGAssetLink* PDGAssetLink; // 0x788
	FTimerHandle RefineMeshesTimer; // 0x790
	bool bNoProxyMeshNextCookRequested; // 0x7b0
	TMap<UObject*, int32_t> InputPresets; // 0x7b8
	bool bBakeAfterNextCook; // 0x808
	bool bCachedIsPreview; // 0x868
	double LastTickTime; // 0x878
};

struct ACTGameStateBase : AGameStateBase {
	TArray<EPopupType> PopupTypes; // 0x270
	UCTRenownDataAsset* RenownDataBase; // 0x280
	UCTRankDataAsset* RankDataBase; // 0x288
	UCTPingDataBase* PingDataBase; // 0x290
	UCTAbilitiesDataBase* AbilitiesDatabaseClass; // 0x298
	UCTAbilitiesDataBase* AbilitiesDataBase; // 0x2a0
	UCTGameEvents* GameEvents; // 0x2a8
};

struct UCTNewsDB : UDataAsset {
	FCTNews ErrorNews; // 0x48
	bool bIsDownloadingNews; // 0xd0
	TArray<FCTNews> NewsArray; // 0xd8
	TArray<FCTNews> DownloadBuffer; // 0xe8
	UDataTable* ImportDatatable; // 0xf8
	FString BaseURL; // 0x100
	FString JsonFile; // 0x110
	bool bRequireEventsUpdate; // 0x120
};

struct UCTShakeComponent : USceneComponent {
	float AmplitudeFactor; // 0x1f8
	float Period; // 0x1fc
	float PositionAmplitude; // 0x200
	float RotationAmplitude; // 0x204
	float RollAmplitude; // 0x208
	float Phase; // 0x20c
};

struct UCTArmament : UObject {
	ACTBeastPawn* OwnerPawn; // 0x28
};

struct UInterpToMovementComponent : UMovementComponent {
	float Duration; // 0xf0
	char bPauseOnImpact : 1; // 0xf4
	bool bSweep; // 0xf8
	ETeleportType TeleportType; // 0xf9
	EInterpToBehaviourType BehaviourType; // 0xfa
	bool bCheckIfStillInWorld; // 0xfb
	char bForceSubStepping : 1; // 0xfc
	FMulticastInlineDelegate OnInterpToReverse; // 0x100
	FMulticastInlineDelegate OnInterpToStop; // 0x110
	FMulticastInlineDelegate OnWaitBeginDelegate; // 0x120
	FMulticastInlineDelegate OnWaitEndDelegate; // 0x130
	FMulticastInlineDelegate OnResetDelegate; // 0x140
	float MaxSimulationTimeStep; // 0x150
	int32_t MaxSimulationIterations; // 0x154
	TArray<FInterpControlPoint> ControlPoints; // 0x158
};

struct UHoudiniParameterButtonStrip : UHoudiniParameter {
	int32_t Count; // 0x108
	TArray<FString> Labels; // 0x110
	TArray<int32_t> Values; // 0x120
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UCTExtendedRichTextBlock : URichTextBlock {
	bool bEnableOptimalWrapInScaleBox; // 0x690
	FCTOptimalWrapInScaleBox WrapInScaleBox; // 0x694
};

struct UMaterialExpressionMaterialAttributeLayers : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
	FMaterialAttributesInput Input; // 0x58
	FMaterialLayersFunctions DefaultLayers; // 0x70
	TArray<UMaterialExpressionMaterialFunctionCall*> LayerCallers; // 0xb0
	int32_t NumActiveLayerCallers; // 0xc0
	TArray<UMaterialExpressionMaterialFunctionCall*> BlendCallers; // 0xc8
	int32_t NumActiveBlendCallers; // 0xd8
	bool bIsLayerGraphBuilt; // 0xdc
};

struct UCTHomeBoosterButton : UCTNavigationWidget {
	URichTextBlock* BoosterNameText; // 0x458
	URichTextBlock* RemainingTimeText; // 0x460
	UImage* ActiveBoosterImage; // 0x468
	UCTShopActivatedWidget* ShopActivatedWidget; // 0x470
	UWidget* TextsBox; // 0x478
	UCTBreadcrumbWidget* BreadcrumbWidget; // 0x480
	FString BreadcrumbPathChunk; // 0x488
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x40
};

struct UCTWeaponBurstFire : UCTWeapon {
	bool bLinkedToAbility; // 0x148
	int32_t NumberOfShots; // 0x14c
	float TimeBetweenShots; // 0x150
	AActor* CurrentTarget; // 0x158
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct UGizmoBaseComponent : UPrimitiveComponent {
	FLinearColor Color; // 0x450
	float HoverSizeMultiplier; // 0x460
	float PixelHitDistanceThreshold; // 0x464
};

struct UABP_DB02_BaseMesh_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UMovieSceneEvaluationHookSystem : UMovieSceneEntitySystem {
	TMap<FMovieSceneEvaluationInstanceKey, FMovieSceneEvaluationHookEventContainer> PendingEventsByRootInstance; // 0x40
};

struct UAkMacInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UHoudiniParameterOperatorPath : UHoudiniParameter {
	TWeakObjectPtr<UHoudiniInput> HoudiniInput; // 0x108
};

struct UCTStartScreenWidget : UCTUserWidget {
	UWidget* TextWidget; // 0x2f0
	bool bFirstAnimation; // 0x2f8
	UPanelWidget* UpOrnementScaleBox; // 0x300
	UImage* Blazon; // 0x308
	UWidget* CoatCanvas; // 0x310
	FSlateBrush BlazonBrush; // 0x318
	float RemainingTime; // 0x3a0
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb0
	float LOSHearingThreshold; // 0xb4
	float SightRadius; // 0xb8
	float SensingInterval; // 0xbc
	float HearingMaxSoundAge; // 0xc0
	char bEnableSensingUpdates : 1; // 0xc4
	char bOnlySensePlayers : 1; // 0xc4
	char bSeePawns : 1; // 0xc4
	char bHearNoises : 1; // 0xc4
	FMulticastInlineDelegate OnSeePawn; // 0xd0
	FMulticastInlineDelegate OnHearNoise; // 0xe0
	float PeripheralVisionAngle; // 0xf0
	float PeripheralVisionCosine; // 0xf4
};

struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct UCTFoundersThanksPopupWidget : UCTInfoPopupWidget {
	URichTextBlock* Title; // 0x388
	URichTextBlock* Content; // 0x390
};

struct UCTProfileWidget : UCTUserWidget {
	UCTPlayerProfileInfoWidget* ProfileInfo; // 0x2f0
	UCTPlayerProgressionInfoWidget* PlayerProgressionInfo; // 0x2f8
	UImage* ClassIcon; // 0x300
	URichTextBlock* MainClassText; // 0x308
	URichTextBlock* TaglineText; // 0x310
	UImage* TaglineImage; // 0x318
	UCTCustomizableNavigationButton* EditProfileButton; // 0x320
	UPanelWidget* GiftKeyPanel; // 0x328
	UCTNavigationScrollBox* GiftKeyScroll; // 0x330
	UVerticalBox* GiftKeyBox; // 0x338
	UPanelWidget* DiscordKeyPanel; // 0x340
	UCTNavigationScrollBox* DiscordKeyScroll; // 0x348
	UVerticalBox* DiscordKeyBox; // 0x350
	UCTLevelIconWidget* LeveliconWidget; // 0x358
	UCTSendACodeButtonWidget* SendAGiftCodeButtonClass; // 0x360
	UCTSendACodeButtonWidget* SendADiscordCodeButtonClass; // 0x368
	float LevelPercentage; // 0x370
	FSlateBrush PlayerProfileTextureBrush; // 0x378
	UCTExtendableNavigationButton* LevelInfoButton; // 0x400
	UPanelWidget* TaglineContainer; // 0x408
	int32_t DiscordRoleCount; // 0x410
	int32_t GiftKeyCount; // 0x414
	UCTEditProfileInfoPopupButtonWidget* IconEditionButton; // 0x418
	UCTEditProfileInfoPopupButtonWidget* WallpaperEditionButton; // 0x420
	UCTEditProfileInfoPopupButtonWidget* TitleEditionButton; // 0x428
	UCTEditProfileInfoPopupButtonWidget* FanionEditionButton; // 0x430
	UCTProfileStatsWidget* StatsWidget; // 0x438
};

struct ACTBlastTrap : ACTLockableNPCActor {
	USceneComponent* RootComp; // 0x2d8
	USphereComponent* CollisionComponent; // 0x2e0
	UStaticMeshComponent* MeshComponent; // 0x2e8
	UCTShockwave* ShockwaveComp; // 0x2f0
	UNiagaraComponent* IdleParticles; // 0x2f8
	float RespawnTime; // 0x300
	UNiagaraSystem* ExplosionParticles; // 0x308
	USoundBase* ExplosionSound; // 0x310
	bool bIsMaster; // 0x318
	float LastDeathTimestamp; // 0x31c
};

struct UCTNewsWidget : UCTNavigationWidget {
	UCTNewsSkipButtonWidget* SkipButtonClass; // 0x440
	UCTCanvasCarouselNewsWidget* Carousel; // 0x448
	UWidget* OrnementScaleBox; // 0x450
	URichTextBlock* Title; // 0x458
	URichTextBlock* Subtitle; // 0x460
	URichTextBlock* Content; // 0x468
	UPanelWidget* SkipButtonsBox; // 0x470
	UWidget* SkipButtonsLinker; // 0x478
};

struct UEnvQueryGenerator_Donut : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue InnerRadius; // 0x80
	FAIDataProviderFloatValue OuterRadius; // 0xb8
	FAIDataProviderIntValue NumberOfRings; // 0xf0
	FAIDataProviderIntValue PointsPerRing; // 0x128
	FEnvDirection ArcDirection; // 0x160
	FAIDataProviderFloatValue ArcAngle; // 0x180
	bool bUseSpiralPattern; // 0x1b8
	UEnvQueryContext* Center; // 0x1c0
	char bDefineArc : 1; // 0x1c8
};

struct UGeneralProjectSettings : UObject {
	FString CompanyName; // 0x28
	FString CompanyDistinguishedName; // 0x38
	FString CopyrightNotice; // 0x48
	FString Description; // 0x58
	FString Homepage; // 0x68
	FString LicensingTerms; // 0x78
	FString PrivacyPolicy; // 0x88
	FGuid ProjectID; // 0x98
	FString ProjectName; // 0xa8
	FString ProjectVersion; // 0xb8
	FString SupportContact; // 0xc8
	FText ProjectDisplayedTitle; // 0xd8
	FText ProjectDebugTitleInfo; // 0xf0
	bool bShouldWindowPreserveAspectRatio; // 0x108
	bool bUseBorderlessWindow; // 0x109
	bool bStartInVR; // 0x10a
	bool bAllowWindowResize; // 0x10b
	bool bAllowClose; // 0x10c
	bool bAllowMaximize; // 0x10d
	bool bAllowMinimize; // 0x10e
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ABP_Tent_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* ST_ENV_GEN_Tent01_A; // 0x228
	float Timeline_0_Dissolve_Timing_D6D2B3B54D342E3DCC9380B131692F52; // 0x230
	ETimelineDirection Timeline_0__Direction_D6D2B3B54D342E3DCC9380B131692F52; // 0x234
	UTimelineComponent* Timeline_1; // 0x238
};

struct UCTShopItemsPackageButtonWidget : UCTShopPackageButtonWidget {
	UCTBreadcrumbWidget* BreadcrumbWidget; // 0x478
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UShopDetailPageWidget_C : UCTShopDetailPageWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x548
	UWidgetAnimation* FailureAnimation; // 0x550
	UWidgetAnimation* InitAnimation; // 0x558
	UWidgetAnimation* StopWaitAnimation; // 0x560
	UWidgetAnimation* StartWaitAnimation; // 0x568
	UWidgetAnimation* SuccessAnimation; // 0x570
	UWidgetAnimation* WaitAnimation; // 0x578
	UCanvasPanel* Canvas_Loading; // 0x580
	UDefaultValidateTooltip_C* DefaultValidateTooltip; // 0x588
	UImage* Image_2; // 0x590
	UImage* Image_3; // 0x598
	UImage* Image_4; // 0x5a0
	UImage* Image_7; // 0x5a8
	UImage* Image_96; // 0x5b0
	UImage* Image_132; // 0x5b8
	UImage* Image_162; // 0x5c0
	UImage* Image_218; // 0x5c8
	UImage* Image_411; // 0x5d0
	UImage* Image_435; // 0x5d8
	UImage* Img_LoadingAnim; // 0x5e0
	UImage* Img_LoadingBG; // 0x5e8
	UHorizontalBox* ItemTopHBox; // 0x5f0
	UVerticalBox* ItemVBox; // 0x5f8
	UImage* ScreenFrame_2; // 0x600
	UShopDetailButtonWidget_C* ShopDetailButtonWidget; // 0x608
	UShopDetailButtonWidget_C* ShopDetailButtonWidget_2; // 0x610
	UShopDetailButtonWidget_C* ShopDetailButtonWidget_106; // 0x618
	UShopDetailButtonWidget_C* ShopDetailButtonWidget_253; // 0x620
	UImage* SuccessImage; // 0x628
};

struct ATA_BP_FireFX4_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UParticleSystemComponent* FX_FirePropagation_roof; // 0x228
	float Timeline_0_EmberVelocity_17FBD0214BDDD8643CFBD08580EC3393; // 0x230
	float Timeline_0_EmberSize_17FBD0214BDDD8643CFBD08580EC3393; // 0x234
	float Timeline_0_MainFlameLocation_17FBD0214BDDD8643CFBD08580EC3393; // 0x238
	float Timeline_0_FlamePulseVel_17FBD0214BDDD8643CFBD08580EC3393; // 0x23c
	float Timeline_0_FlamePulseSize_17FBD0214BDDD8643CFBD08580EC3393; // 0x240
	float Timeline_0_SmokeSize_17FBD0214BDDD8643CFBD08580EC3393; // 0x244
	float Timeline_0_SmokeVel_17FBD0214BDDD8643CFBD08580EC3393; // 0x248
	float Timeline_0_MainFlameSize_17FBD0214BDDD8643CFBD08580EC3393; // 0x24c
	ETimelineDirection Timeline_0__Direction_17FBD0214BDDD8643CFBD08580EC3393; // 0x250
	UTimelineComponent* Timeline_1; // 0x258
	FVector MainFlameSizeBegin; // 0x260
	FVector MainFlameSizeEnd; // 0x26c
	FVector SmokeVelBegin; // 0x278
	FVector SmokeVelEnd; // 0x284
	FVector SmokeSizeBegin; // 0x290
	FVector SmokeSizeEnd; // 0x29c
	FVector FlamePulseSizeBegin; // 0x2a8
	FVector FlamePulseSizeEnd; // 0x2b4
	FVector FlamePulseVelBegin; // 0x2c0
	FVector FlamePulseVelEnd; // 0x2cc
	FVector MainFlameLocBegin; // 0x2d8
	FVector MainFlameLocEnd; // 0x2e4
	FVector EmberSize; // 0x2f0
	FVector EmberVelocity; // 0x2fc
};

struct UCollectionMasterTab_C : UCTCollectionMasterTabWidget {
	UCollectionClassTab_C* CollectionClassTab; // 0x2f0
	UCollectionLocationTab_C* CollectionLocationTab; // 0x2f8
	UCollectionTabBar_C* CollectionTabBar; // 0x300
};

struct UWaitingServerBlockerWidget_C : UCTUIBlockerWidget {
	UImage* LoadingWidget; // 0x300
};

struct UStaminaSlotWidget_C : UCTStaminaSlotWidget {
	UImage* StaminaSlotBackground; // 0x398
	UImage* StaminaSlotOverlay; // 0x3a0
	UImage* UNUSED_SlotRef; // 0x3a8
};

struct UCTSocialSearchController : UCTWidgetController {
	int32_t MinCharacters; // 0x90
	int32_t MaxCharacters; // 0x94
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UPawnAction_Repeat : UPawnAction {
	UPawnAction* ActionToRepeat; // 0x90
	UPawnAction* RecentActionCopy; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct ADatasmithImportedSequencesActor : AActor {
	TArray<ULevelSequence*> ImportedSequences; // 0x220
};

struct UCTGameEndWidget : UCTUserWidget {
	int32_t MaxDisplayTime; // 0x2f0
	float DisplayTime; // 0x2f4
};

struct UMaterialExpressionSobol : UMaterialExpression {
	FExpressionInput Cell; // 0x40
	FExpressionInput Index; // 0x54
	FExpressionInput Seed; // 0x68
	uint32_t ConstIndex; // 0x7c
	FVector2D ConstSeed; // 0x80
};

struct UPhysicsSettingsCore : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableShapeSharing; // 0x50
	bool bEnablePCM; // 0x51
	bool bEnableStabilization; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	bool bDefaultHasComplexCollision; // 0x55
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	float ContactOffsetMultiplier; // 0x68
	float MinContactOffset; // 0x6c
	float MaxContactOffset; // 0x70
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x74
	ECollisionTraceFlag DefaultShapeComplexity; // 0x75
	FChaosSolverConfiguration SolverOptions; // 0x78
};

struct URewardItemNotif_C : UCTEventRewardNotifWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4a0
	USizeBox* ControllerIconSizeBox; // 0x4a8
	UCTButton* CTButton_91; // 0x4b0
	UImage* Image; // 0x4b8
};

struct UHapticFeedbackEffect_Curve : UHapticFeedbackEffect_Base {
	FHapticFeedbackDetails_Curve HapticDetails; // 0x28
};

struct UABP_D03_Torso04_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct ACTTutorialGameState : ACTGameState {
	UCTTutorialWorkshopDB* WorkshopDB; // 0x670
	TArray<UCTTutorialWorkShop*> Workshops; // 0x678
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct USocialStatusSeparatorWidget_C : UCTUserWidget {
	URichTextBlock* Symbol; // 0x2f0
};

struct UBasicPurchaseCarouselWidget_C : UCTPurchaseCanvasCarouselWidget {
	UWidgetAnimation* CurrentToPrevious; // 0x358
	UWidgetAnimation* CurrentToNext; // 0x360
	UBasicPurchaseCarouselCell_C* BasicPurchaseCarouselCell; // 0x368
	UBasicPurchaseCarouselCell_C* BasicPurchaseCarouselCell_2; // 0x370
	UBasicPurchaseCarouselCell_C* BasicPurchaseCarouselCell_3; // 0x378
	UImage* ButtonBackgroundImage; // 0x380
	UCanvasPanel* CurrentCanvas; // 0x388
	UCanvasPanel* NextPanel; // 0x390
	UCanvasPanel* PreviousPanel; // 0x398
	UCanvasPanel* StaticCurrentCanvas; // 0x3a0
	UCanvasPanel* StaticNextPanel; // 0x3a8
	UCanvasPanel* StaticPreviousPanel; // 0x3b0
};

struct UModeIconBig_C : UCTModeIcon {
	UImage* BackgroundImage; // 0x418
};

struct UScrollingShopRessourcesTab_C : UCTResourceShopTabWidget {
	UFeaturedCarouselButtonWidget_C* FeaturedCarouselButtonWidget; // 0x460
	UGenericOrnement_C* GenericOrnement; // 0x468
	UGenericOrnement_C* GenericOrnement_2; // 0x470
	UShopRessourceNavigationButton_C* ShopRessourceNavigationButton; // 0x478
	UShopRessourceNavigationButton_C* ShopRessourceNavigationButton_2; // 0x480
	UShopRessourceNavigationButton_C* ShopRessourceNavigationButton_3; // 0x488
	UShopRessourceNavigationButton_C* ShopRessourceNavigationButton_112; // 0x490
};

struct UBaseBrushTool : UMeshSurfacePointTool {
	UBrushBaseProperties* BrushProperties; // 0xc0
	bool bInBrushStroke; // 0xc8
	float WorldToLocalScale; // 0xcc
	FBrushStampData LastBrushStamp; // 0xd0
	TSoftClassPtr<UObject> PropertyClass; // 0x188
	UBrushStampIndicator* BrushStampIndicator; // 0x1b0
};

struct ABP_UserProfileBanner_Wall_C : ACTFanionPropMesh {
	UStaticMeshComponent* Flag_Support; // 0x260
};

struct UOptionsParameterButton_C : UNavMenuButtonWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4f0
	UCTButton* ChildButton; // 0x4f8
	UImage* Image_153; // 0x500
	FSlateFontInfo DefaultFont; // 0x508
	FSlateFontInfo HoverFont; // 0x560
	FSlateColor HoverTextColor; // 0x5b8
	FSlateColor DefaultTextColor; // 0x5e0
	FButtonStyle ButtonStyle; // 0x608
};

struct UTutorialButton_C : UCTTutorialVideoButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x390
	UTutorialChapterButton_C* TutorialChapterButton; // 0x398
	UTutorialChapterButton_C* TutorialChapterButton_2; // 0x3a0
	UTutorialChapterButton_C* TutorialChapterButton_207; // 0x3a8
	UTutorialChapterButton_C* TutorialChapterButton_354; // 0x3b0
	bool IsInProcessOfCollapse; // 0x3b8
	bool IsInProcessOfUncollapse; // 0x3b9
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UTutorialChapterSelectorWidget_C : UCTTutorialChapterSelectorWidget {
	UImage* ChapterTextsBg; // 0x488
	UTutorialChapterCheckBox_C* TutorialChapterCheckBox; // 0x490
	UTutorialChapterCheckBox_C* TutorialChapterCheckBox_594; // 0x498
	UTutorialChapterCheckBox_C* TutorialChapterCheckBox_702; // 0x4a0
	UTutorialChapterCheckBox_C* TutorialChapterCheckBox_1064; // 0x4a8
};

struct UClassHousesWidgetBP_C : UCTClassHousesWidget {
	UClassHouseWidgetBP_C* ClassHouseWidgetBP; // 0x308
	UClassHouseWidgetBP_C* ClassHouseWidgetBP_2; // 0x310
	UClassHouseWidgetBP_C* ClassHouseWidgetBP_3; // 0x318
	UClassHouseWidgetBP_C* ClassHouseWidgetBP_4; // 0x320
	UClassHouseWidgetBP_C* ClassHouseWidgetBP_5; // 0x328
	USpaceBetweenHouses_C* SpaceBetweenHouses; // 0x330
	USpaceBetweenHouses_C* SpaceBetweenHouses_2; // 0x338
	USpaceBetweenHouses_C* SpaceBetweenHouses_3; // 0x340
	USpaceBetweenHouses_C* SpaceBetweenHouses_4; // 0x348
};

struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	ENiagaraSystemSpawnSectionStartBehavior SectionStartBehavior; // 0xe8
	ENiagaraSystemSpawnSectionEvaluateBehavior SectionEvaluateBehavior; // 0xec
	ENiagaraSystemSpawnSectionEndBehavior SectionEndBehavior; // 0xf0
	ENiagaraAgeUpdateMode AgeUpdateMode; // 0xf4
};

struct UCTCountingUsersSectionWidget : UCTUsersSectionWidget {
	UTextBlock* CounterText; // 0x310
};

struct UCTProfileController : UCTWidgetController {
	bool bEditable; // 0x90
};

struct UCollectionMapPoint_Discovered_Unselected_Normal_C : UCTCollectionMapPointStateWidget {
	UImage* NewPointImage; // 0x2f0
};

struct UCreditsChapterWidget_C : UCTCreditsChapterWidget {
	UCreditsParagraphWidget_C* CreditsParagraphWidget; // 0x308
	UCreditsParagraphWidget_C* CreditsParagraphWidget_2; // 0x310
	UCreditsParagraphWidget_C* CreditsParagraphWidget_3; // 0x318
	UImage* Mockup; // 0x320
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct UCTAnimatedSwitchWidget : UCTNavigationWidget {
	UCTRichTextBlock* SwitchOnText; // 0x440
	UCTRichTextBlock* SwitchOffText; // 0x448
	UCanvasPanel* SwitchPanel; // 0x450
	UCTNavigationWidget* SwitchInvisibleButton; // 0x458
	UImage* SwitchButtonImage; // 0x460
	float SwitchTargetPositionX; // 0x478
	float SwitchAnimationSpeed; // 0x47c
	float SwitchFailedAnimationSpeed; // 0x480
	FLinearColor SwitchOffTextEnabledColor; // 0x484
	FLinearColor SwitchOffTextDisabledColor; // 0x494
	FLinearColor SwitchOnTextEnabledColor; // 0x4a4
	FLinearColor SwitchOnTextDisabledColor; // 0x4b4
	FSlateBrush SwitchONBrush; // 0x4c8
	FSlateBrush SwitchOFFBrush; // 0x550
	FSlateBrush SwitchLockedBrush; // 0x5d8
};

struct UCTNavigationScrollBoxAnimationHolder : UCTAnimationHolder {
	UCTNavigationScrollBox* ScrollBox; // 0x30
};

struct UMovieSceneLiveLinkSubSection : UObject {
	FLiveLinkSubSectionData SubSectionData; // 0x28
	ULiveLinkRole* SubjectRole; // 0x38
};

struct UCTDailyChestReward : UCTUserWidget {
	UCTRichTextBlock* RewardName; // 0x2f0
	UCTRichTextBlock* RewardProbability; // 0x2f8
};

struct UCTLevellingDB : UCTImportedDataAsset {
	float DefaultScoreToXPRatio; // 0x38
	int32_t RookieEndLevel; // 0x3c
	int32_t RookieSkipPropositionLevel; // 0x40
	int32_t SpecialEventMinLevel; // 0x44
	int32_t PlayRankedMinLevel; // 0x48
	float DefaultXPThreshold; // 0x4c
	int32_t MaxRenown; // 0x50
	int32_t RequiredLevelToReachNextRenown; // 0x54
	TArray<FCTLevellingData> ManagedDB; // 0x58
	UDataTable* ImportedDB; // 0x68
};

struct UCTRedeemACodeWidget : UCTNavigationPage {
	UCTExtendableNavigationButton* CloseButton; // 0x308
	UCTExtendableNavigationButton* CancelButton; // 0x310
	UCTExtendableNavigationButton* RedeemButton; // 0x318
	UWidget* ButtonBox; // 0x320
	UWidget* Canvas_Loading; // 0x328
	UCTNavEditBox* TextField; // 0x330
	UCTTextBlock* ResultText; // 0x338
	UPanelWidget* TextCanvas; // 0x340
	UCTValidateTooltip* ToolTip; // 0x348
	FString LastEditedText; // 0x350
	FTimerHandle TimerHandle; // 0x360
	FString GiftPackID; // 0x368
	FString PlayerId; // 0x378
	TArray<FKeyToolTipData> DefaultTooltips; // 0x398
	TArray<FKeyToolTipData> TooltipsWhenEditing; // 0x3a8
};

struct UCTRewardWidget : UCTUserWidget {
	int32_t MaxNameTextLen; // 0x2f0
	UTextBlock* RewardText; // 0x2f8
	UCTAutoScrollBox* RewardScrollingText; // 0x300
	UTextBlock* RarityText; // 0x308
	UImage* RarityImage; // 0x310
	FString RewardTextPolice; // 0x318
	UImage* RewardImage; // 0x328
	UImage* GemsRewardImage; // 0x330
	FVector2D RewardImageSize; // 0x338
};

struct UDatasmithImportOptions : UDatasmithOptionsBase {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x28
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x29
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x2a
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x2b
	EDatasmithImportActorPolicy LightImportPolicy; // 0x2c
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x2d
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x2e
	EDatasmithImportMaterialQuality MaterialQuality; // 0x2f
	FDatasmithImportBaseOptions BaseOptions; // 0x30
	FDatasmithReimportOptions ReimportOptions; // 0x44
	FString Filename; // 0x48
	FString FilePath; // 0x58
};

struct UABP_D03_BodyL02_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UUniformInteger : UFieldNodeInt {
	int32_t Magnitude; // 0xb0
};

struct UCTOutOfBoundsFeedbackComponent : UActorComponent {
	USoundMix* OutOfBoundsSoundMix; // 0xb0
	UMaterialInterface* OutOfBoundsPostProcess; // 0xb8
	UCameraComponent* PPCameraTarget; // 0xc0
	float FadeInModifier; // 0xc8
	float fFadeOutTime; // 0xcc
	UMaterialInstanceDynamic* CameraPPMaterial; // 0xd0
	EOutOfBoundsFeedbackEnum CurrentOutofBoundsFeedback; // 0xd8
};

struct USocialUserButton_C : UCTSocialUserButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x458
	UCTButton* MainButton; // 0x460
	FButtonStyle NormalStateStyle; // 0x468
	FButtonStyle FocusedStateStyle; // 0x6e0
	FButtonStyle PressedStateStyle; // 0x958
	FWidgetTransform NormalRenderTransform; // 0xbd0
	FWidgetTransform FocusedRenderTransform; // 0xbec
	FWidgetTransform PressedRenderTransform; // 0xc08
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UProfileInfoWidget_C : UCTPlayerProfileInfoWidget {
	UImage* iconFrame; // 0x378
	UImage* Image; // 0x380
	UImage* Image_393; // 0x388
	UImage* Image_500; // 0x390
};

struct UCTRevertMoveCompPhysicsLayer : UCTCameraLayer {
	UCurveFloat* BlendCurve; // 0x68
};

struct UInfoPopup_EditPlayerFanionWidget_C : UCTEditIDPopupWidget {
	UImage* BackgroundImage; // 0x3c0
	UEditPlayerFanionButton_C* EditPlayerFanionButton; // 0x3c8
	UEditPlayerFanionButton_C* EditPlayerFanionButton_2; // 0x3d0
	UEditPlayerFanionButton_C* EditPlayerFanionButton_3; // 0x3d8
	UEditPlayerFanionButton_C* EditPlayerFanionButton_4; // 0x3e0
	UEditPlayerFanionButton_C* EditPlayerFanionButton_5; // 0x3e8
	UEditPlayerFanionButton_C* EditPlayerFanionButton_6; // 0x3f0
	UEditPlayerFanionButton_C* EditPlayerFanionButton_7; // 0x3f8
	UImage* Image_52; // 0x400
	UImage* Image_145; // 0x408
};

struct ULevelStreamingDynamic : ULevelStreaming {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct APaperTileMapActor : AActor {
	UPaperTileMapComponent* RenderComponent; // 0x220
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x2c8
};

struct UCTClassCustomizeButtonWidget : UCTCustomizeButtonWidget {
	UImage* ClassIcon; // 0x4d0
	FString BreadcrumbPathChunk; // 0x4d8
};

struct ULeaderboardFlushCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	UVectorField* Field; // 0x38
	bool bTileX; // 0x40
	bool bTileY; // 0x41
	bool bTileZ; // 0x42
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UABP_DB03_Body01_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UWmfMediaSettings : UObject {
	bool AllowNonStandardCodecs; // 0x28
	bool LowLatency; // 0x29
	bool NativeAudioOut; // 0x2a
	bool HardwareAcceleratedVideoDecoding; // 0x2b
};

struct UParticleModuleLocationSkelVertSurface : UParticleModuleLocationBase {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct UPop_TDMRules_C : UCTGameModeRulesWidget {
	UDefaultTextBlock_C* DefaultTextBlock; // 0x380
	UDefaultTextBlock_C* DefaultTextBlock_181; // 0x388
	UDefaultTextBlock_C* DefaultTextBlock_300; // 0x390
	UImage* Image; // 0x398
	UImage* Image_2; // 0x3a0
	UImage* Image_3; // 0x3a8
	UImage* Image_4; // 0x3b0
	UImage* Image_95; // 0x3b8
	UImage* Image_458; // 0x3c0
	UImage* Image_562; // 0x3c8
	UImage* LargeTexture; // 0x3d0
};

struct ADatasmithAreaLightActor : AActor {
	EComponentMobility Mobility; // 0x220
	EDatasmithAreaLightActorType LightType; // 0x221
	EDatasmithAreaLightActorShape LightShape; // 0x222
	FVector2D Dimensions; // 0x224
	float Intensity; // 0x22c
	ELightUnits IntensityUnits; // 0x230
	FLinearColor Color; // 0x234
	float Temperature; // 0x244
	UTextureLightProfile* IESTexture; // 0x248
	bool bUseIESBrightness; // 0x250
	float IESBrightnessScale; // 0x254
	FRotator Rotation; // 0x258
	float SourceRadius; // 0x264
	float SourceLength; // 0x268
	float AttenuationRadius; // 0x26c
	float SpotlightInnerAngle; // 0x270
	float SpotlightOuterAngle; // 0x274
};

struct UCTEndMatchSummarySectionController : UCTWidgetController {
	TArray<UCTEndMatchRowController*> RowControllers; // 0xb8
	UCTEndMatchSectionWidget* SectionWidget; // 0xc8
	UCTEndMatchRowTextController* TotalRowController; // 0xd0
	TArray<UCTEndMatchRowController*> TrackingRows; // 0xd8
};

struct UCTPreloadingDatabase : UDataAsset {
	TArray<FPreloadingAssetSet> PreloadingSets; // 0x30
};

struct UCodeEditableText_C : UCTNavEditBox {
	UCTButton* HighlightButton; // 0x510
};

struct UMissionLine_C : UCTQuestWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x378
};

struct UMaterialExpressionFontSample : UMaterialExpression {
	UFont* Font; // 0x40
	int32_t FontTexturePage; // 0x48
};

struct UMaterialExpressionLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x30
};

struct UActorSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x68
};

struct UCTLocalSaveManager : UGameInstanceSubsystem {
	ECTLocalSaveStatus Status; // 0x60
	bool bEmptySave; // 0x61
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xb0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xb8
};

struct UDragonInfoWidgetBP_C : UCTDragonInfoWidget {
	UImage* BottomFadeOut; // 0x328
	UButtonStatesHolderWidget_C* ButtonStatesHolderWidget; // 0x330
	UCTButton* HouseButton; // 0x338
	UImage* HouseFrame; // 0x340
	UDefaultRichTextBlock_C* OwnedText; // 0x348
	UImage* OwnImage; // 0x350
	UImage* TopFadeOut; // 0x358
	UImage* TransparentBlackBG; // 0x360
};

struct USoloTabWidget_C : UCTUserWidget {
	UPlayButton_C* PlayButton; // 0x2f0
	UPlayButton_C* PlayButton_102; // 0x2f8
};

struct UCTPropMaterialModifier : UCTPropModifierDataAsset {
	TArray<FMaterialOverride> Overrides; // 0x30
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UCTShopPurchasePageWidget : UCTNavigationPage {
	bool bCloseOnButtonPressed; // 0x308
	UCTShopPurchasePageController* Controller; // 0x310
	UGridPanel* ButtonsContainer; // 0x318
	UCTShopSmoothPriceWidget* SoftChestWidget; // 0x320
	UCTShopSmoothPriceWidget* HardChestWidget; // 0x328
	UCTPriceShopButtonWidget* SoftButtonWidget; // 0x330
	UCTPriceShopButtonWidget* HardButtonWidget; // 0x338
	UCTPriceShopButtonWidget* EuroButtonWidget; // 0x340
	UCTShopItemActivateButtonWidget* ActivateButtonWidget; // 0x348
	UCTCustomizableNavigationButton* DetailButton; // 0x350
	UCTNavigationWidget* CloseButton; // 0x358
	UCTCustomizableNavigationButton* RightButton; // 0x360
	UCTCustomizableNavigationButton* LeftButton; // 0x368
	UCTNavigationWidget* EquipButton; // 0x370
	UCTNavigationWidget* PurchaseButtonClass; // 0x378
	UCTCanvasCarouselPackageWidget* Carousel; // 0x380
	UCanvasPanel* ClassIconCanvas; // 0x388
	UImage* ClassIcon; // 0x390
	URichTextBlock* NameText; // 0x398
	URichTextBlock* ClassText; // 0x3a0
	URichTextBlock* RarityText; // 0x3a8
	UScaleBox* DescriptionScaleBox; // 0x3b0
	UScaleBox* FullDescriptionScaleBox; // 0x3b8
	URichTextBlock* DescriptionText; // 0x3c0
	URichTextBlock* FullDescriptionText; // 0x3c8
	URichTextBlock* AlternativeDescriptionText; // 0x3d0
	URichTextBlock* AlternativeFullDescriptionText; // 0x3d8
	URichTextBlock* ContentText; // 0x3e0
	UScrollBox* ContentScroll; // 0x3e8
	URichTextBlock* TypeText; // 0x3f0
	URichTextBlock* QuantityText; // 0x3f8
	URichTextBlock* ActivationText; // 0x400
	URichTextBlock* ActivationTimeText; // 0x408
	URichTextBlock* SuccessTextBlock; // 0x410
	UCTShopActivatedWidget* ShopActivatedWidget; // 0x418
	UCTShopAcquiredWidget* ShopAcquiredWidget; // 0x420
	UCTShopPackageEarnedWidget* EarnedWidget; // 0x428
	UWidget* SuccessButtonsBox; // 0x430
	UVerticalBox* BuyButtonsBox; // 0x438
	UPanelWidget* LoadingImageBox; // 0x440
	UWidget* DefaultSetup; // 0x448
	UWidget* AlternativeSetup; // 0x450
	UWidget* BetaRealMoneyPurchasePrevented; // 0x458
	UWidget* ClaimPackPanel; // 0x460
	UTextBlock* ClaimPackTitle; // 0x468
	AActor* ItemRecordingActor; // 0x470
	UCTDiscoveryNotificationWidget* DiscoveryNotificationWidget; // 0x478
};

struct UCustomizationItemButton_C : UCTCustomizeButtonWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4d0
	UBreadcrumbWidget_C* BreadcrumbWidget; // 0x4d8
	UShopButtonBorder_C* ButtonSelectorImage; // 0x4e0
	UImage* EliteImage; // 0x4e8
	UImage* EliteImage_2; // 0x4f0
	UImage* Image_189; // 0x4f8
	UImage* Image_775; // 0x500
	UCTButton* ShopButton; // 0x508
};

struct UNewsCarouselWidget_C : UCTCanvasCarouselNewsWidget {
	UWidgetAnimation* OnHover; // 0x348
	UWidgetAnimation* CurrentToPrevious; // 0x350
	UWidgetAnimation* CurrentToNext; // 0x358
	UCanvasPanel* CurrentCanvas; // 0x360
	UImage* FrameImageLeft; // 0x368
	UImage* FrameImageRight; // 0x370
	UNewsCarouselCell_C* NewsCarouselCell; // 0x378
	UNewsCarouselCell_C* NewsCarouselCell_2; // 0x380
	UNewsCarouselCell_C* NewsCarouselCell_3; // 0x388
	UNewsCarouselCell_C* NewsCarouselCell_4; // 0x390
	UNewsCarouselCell_C* NewsCarouselCell_5; // 0x398
	UNewsCarouselCell_C* NewsCarouselCell_6; // 0x3a0
	UCanvasPanel* NextPanel; // 0x3a8
	UCanvasPanel* PreviousPanel; // 0x3b0
	UCanvasPanel* StaticCurrentCanvas; // 0x3b8
	UCanvasPanel* StaticNextPanel; // 0x3c0
	UCanvasPanel* StaticPreviousPanel; // 0x3c8
};

struct UHomeLevellingNextRewardLevelingWidget_C : UCTRewardWidget {
	UImage* BackgroundImage; // 0x340
};

struct UABP_BodyParts_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x2f8
};

struct UStreamableRenderAsset : UObject {
	double ForceMipLevelsToBeResidentTimestamp; // 0x40
	int32_t NumCinematicMipLevels; // 0x48
	int32_t StreamingIndex; // 0x4c
	int32_t CachedCombinedLODBias; // 0x50
	char NeverStream : 1; // 0x54
	char bGlobalForceMipLevelsToBeResident : 1; // 0x54
	char bHasStreamingUpdatePending : 1; // 0x54
	char bForceMiplevelsToBeResident : 1; // 0x54
	char bIgnoreStreamingMipBias : 1; // 0x54
	char bUseCinematicMipLevels : 1; // 0x54
};

struct UFont : UObject {
	EFontCacheType FontCacheType; // 0x30
	TArray<FFontCharacter> Characters; // 0x38
	TArray<UTexture2D*> Textures; // 0x48
	int32_t IsRemapped; // 0x58
	float EmScale; // 0x5c
	float Ascent; // 0x60
	float Descent; // 0x64
	float Leading; // 0x68
	int32_t Kerning; // 0x6c
	FFontImportOptionsData ImportOptions; // 0x70
	int32_t NumCharacters; // 0x120
	TArray<int32_t> MaxCharHeight; // 0x128
	float ScalingFactor; // 0x138
	int32_t LegacyFontSize; // 0x13c
	FName LegacyFontName; // 0x140
	FCompositeFont CompositeFont; // 0x148
};

struct UParticleModuleMeshRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionVector LifeMultiplier; // 0x30
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UCTShopPackageButtonWidget : UCTShopButtonWidget {
	bool bInfinitelyPurchasable; // 0x440
	UCTShopPackageWidget* ShopPackageWidget; // 0x448
	FString ShopPackageUID; // 0x450
};

struct UCTAllyTargetWidget : UCTUserWidget {
	FLinearColor NotInRangeColor; // 0x2f0
	UImage* ChargeDistanceSprite; // 0x300
	UImage* ProtectedIndicator; // 0x308
	UCanvasPanel* ScaleCanvas; // 0x310
	UCanvasPanel* InScreenCanvas; // 0x318
	UCanvasPanel* OutScreenCanvas; // 0x320
	FCTPlayerId CTPlayerId; // 0x328
	float LifeRatio; // 0x338
};

struct UCTDefaultDragonCellController : UCTDragonCellController {
	TMap<ECollectionDragonStatus, float> DragonStatusOpacities; // 0xf8
	UCTDefaultDragonCellWidget* DefaultDragonCellWidget; // 0x148
};

struct UCTCTFGameResultWidget1 : UCTGameResultWidget {
	UWidget* RoundChipBox; // 0x3d0
	UWidget* RoundOrnement; // 0x3d8
};

struct UCTGroupController : UCTSortableSocialTabController {
	UCTGroupPrivacyController* PrivacyControllerClass; // 0xe0
	UCTGroupPrivacyController* PrivacyController; // 0xe8
	UCTGroupWidget* GroupWidget; // 0xf0
};

struct UCTLeavePenaltyPopupController : UCTInfoPopupController {
	FString TitleNamespaceKey; // 0xc0
	FString TitleKey; // 0xd0
	FString SubTitleNamespaceKey; // 0xe0
	FString SubTitleMessageKey; // 0xf0
	FString DefeatPenaltyNamespaceKey; // 0x100
	FString DefeatPenaltyMessageKey; // 0x110
	FString TimePenaltyNamespaceKey; // 0x120
	FString TimePenaltyMessageKey; // 0x130
};

struct UCTControllerOnlyCanvasPanel : UCanvasPanel {
	bool bShouldCollapse; // 0x130
	bool bDebugPadEnabled; // 0x131
};

struct UCTUserWidget : UUserWidget {
	FCTUIShakePulse ShakeOrPulseFeature; // 0x260
	UCTGameStateUIManagerComponent* CTManager; // 0x2c8
	TArray<UCTAnimationTimerHandle*> AnimationTimerHandles; // 0x2d0
	UCTNavigationLayer* CachedLayer; // 0x2e0
	bool bInvalidateOnChangeVisibility; // 0x2e9
};

struct ACTStickyMine : ACTMineSpawn {
	float HealthInitValue; // 0x2a0
	USphereComponent* MineRoot; // 0x2a8
	UStaticMeshComponent* TriggerZoneComp; // 0x2b0
	UStaticMeshComponent* MineMeshComp; // 0x2b8
	UPopcornFXEmitterComponent* FXMine; // 0x2c0
	UCTProjectileComponent* ProjectileComponent; // 0x2c8
	EStickyMineState MineState; // 0x2d0
	FStickyMineSettings StickyMineSettings; // 0x2d8
	FStickyMineFXParams AllyFXParams; // 0x318
	FStickyMineFXParams OpponentFXParams; // 0x350
	FLinearColor TriggeredBlinkColor; // 0x388
	UParticleSystem* FallingPS; // 0x398
	UParticleSystemComponent* FallingPSComp; // 0x3a0
	USoundBase* ThrowSound; // 0x3a8
	USoundBase* AnchorSound; // 0x3b0
	USoundBase* TriggerSound; // 0x3b8
	UParticleSystem* ExplosionPS; // 0x3c0
	USoundBase* ExplosionSound; // 0x3c8
	UNiagaraSystem* RageTrailPS; // 0x3d0
	UNiagaraComponent* RageTrailPSComp; // 0x3d8
	UCTOpponentUIComponent* OpponentUIComp; // 0x3e0
	FVector LastLocation; // 0x3e8
	FPawnDetection PawnDetection; // 0x42c
	float BaseLightIntensity; // 0x498
	float InterpSpeedLocation; // 0x49c
	float InterpSpeedIntensity; // 0x4a0
	float DirDist; // 0x4a4
	UPointLightComponent* MineLight; // 0x4a8
};

struct UGameplayTask_SpawnActor : UGameplayTask {
	FMulticastInlineDelegate Success; // 0x68
	FMulticastInlineDelegate DidNotSpawn; // 0x78
	AActor* ClassToSpawn; // 0xa0
};

struct USkeleton : UObject {
	TArray<FBoneNode> BoneTree; // 0x38
	TArray<FTransform> RefLocalPoses; // 0x48
	FGuid VirtualBoneGuid; // 0x170
	TArray<FVirtualBone> VirtualBones; // 0x180
	TArray<USkeletalMeshSocket*> Sockets; // 0x190
	FSmartNameContainer SmartNames; // 0x1f0
	TArray<UBlendProfile*> BlendProfiles; // 0x270
	TArray<FAnimSlotGroup> SlotGroups; // 0x280
	TArray<UAssetUserData*> AssetUserData; // 0x380
};

struct AHUD : AActor {
	APlayerController* PlayerOwner; // 0x220
	char bLostFocusPaused : 1; // 0x228
	char bShowHUD : 1; // 0x228
	char bShowDebugInfo : 1; // 0x228
	int32_t CurrentTargetIndex; // 0x22c
	char bShowHitBoxDebugInfo : 1; // 0x230
	char bShowOverlays : 1; // 0x230
	char bEnableDebugTextShadow : 1; // 0x230
	TArray<AActor*> PostRenderedActors; // 0x238
	TArray<FName> DebugDisplay; // 0x250
	TArray<FName> ToggledDebugCategories; // 0x260
	UCanvas* Canvas; // 0x270
	UCanvas* DebugCanvas; // 0x278
	TArray<FDebugTextInfo> DebugTextList; // 0x280
	AActor* ShowDebugTargetDesiredClass; // 0x290
	AActor* ShowDebugTargetActor; // 0x298
};

struct UCTHostMatchUpdater : UObject {
	UCTHostMatchLoginManager* LoginManager; // 0x30
};

struct UCTCollectionMapDataAsset : UDataAsset {
	TMap<ECollectionDragonStatus, FCTMapPointStateWidgetClasses> MapPointStateWidgetClasses; // 0x30
};

struct UBTDecorator : UBTAuxiliaryNode {
	char bInverseCondition : 1; // 0x60
	EBTFlowAbortMode FlowAbortMode; // 0x64
};

struct ABP_UserProfileBanner_Floor_C : ACTFanionPropMesh {
	UStaticMeshComponent* Flag_Support; // 0x260
	UStaticMeshComponent* ST_ENV_Land_CliffDebris01_A; // 0x268
};

struct UCTAlreadyLoggedInErrorPopupCtrl : UCTInfoPopupController {
	UCTAccountLinkingErrorPopupWidget* AccountLinkingErrorPopupWidget; // 0xc0
};

struct UMagicLeapHeadTrackingNotificationsComponent : UVRNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x140
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x150
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x160
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x170
};

struct UOptionsControlsTab_C : UCTOptionsSubTabWidget {
	UVerticalBox* Container_13; // 0x2f8
	UCTAnimatedNavigationScrollBox* ParametersScrollBox; // 0x300
};

struct UQuartzClockHandle : UObject {
	UQuartzSubsystem* QuartzSubsystem; // 0x168
	UWorld* WorldPtr; // 0x188
};

struct UShopExclusiveDailyNavigationButton_C : UCTExclusiveShopButtonWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x478
	UWidgetAnimation* CannotBuyAnimation; // 0x480
	UWidgetAnimation* BuyAnimation; // 0x488
	UImage* ButtonSelectorImage; // 0x490
	UCTButton* ShopButton; // 0x498
};

struct UCTCustomizationClassWidget : UCTCustomizationSubWidget {
	FLinearColor SpecialAbilityColor; // 0x328
	FLinearColor GadgetColor; // 0x338
	FLinearColor PassiveColor; // 0x348
	FLinearColor RageColor; // 0x358
	float AnimationTime; // 0x368
	URichTextBlock* ClassDescriptionText; // 0x378
	UPanelWidget* GadgetsPanel; // 0x380
	UPanelWidget* PowerAndRagePanel; // 0x388
	URichTextBlock* SpecialAbilityTitleText; // 0x390
	URichTextBlock* SpecialAbilityDescriptionText; // 0x398
	UImage* SpecialAbilityIcon; // 0x3a0
	URichTextBlock* PassiveTitleText; // 0x3a8
	URichTextBlock* PassiveDescriptionText; // 0x3b0
	UImage* PassiveIcon; // 0x3b8
	URichTextBlock* RageTitleText; // 0x3c0
	URichTextBlock* RageDescriptionText; // 0x3c8
	UImage* RageIcon; // 0x3d0
	URichTextBlock* Gadget1TitleText; // 0x3d8
	URichTextBlock* Gadget1DescriptionText; // 0x3e0
	UImage* Gadget1Icon; // 0x3e8
	URichTextBlock* Gadget2TitleText; // 0x3f0
	URichTextBlock* Gadget2DescriptionText; // 0x3f8
	UImage* Gadget2Icon; // 0x400
	UCTSkipButtonWidget* PassivePowerRageButton; // 0x408
	UCTSkipButtonWidget* GadgetButton; // 0x410
};

struct UAnimatedSwitch_C : UCTAnimatedSwitchWidget {
	UImage* SwitchBG; // 0x668
	UCanvasPanel* SwitchCanvas; // 0x670
};

struct UNiagaraBaselineController_Basic : UNiagaraBaselineController {
	int32_t NumInstances; // 0x68
	TArray<UNiagaraComponent*> SpawnedComponents; // 0x70
};

struct UNiagaraDataInterfaceGrid3DCollection : UNiagaraDataInterfaceGrid3D {
	int32_t NumAttributes; // 0x100
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0x108
	ENiagaraGpuBufferFormat OverrideBufferFormat; // 0x128
	char bOverrideFormat : 1; // 0x129
};

struct UPhysicsConstraintTemplate : UObject {
	FConstraintInstance DefaultInstance; // 0x28
	TArray<FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1f0
	FConstraintProfileProperties DefaultProfile; // 0x200
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct UCTEndMatchSummaryRank : UCTEndMatchSummary {
	UWidgetSwitcher* VersionSwitcher; // 0x338
	UTextBlock* MainRankTitleText; // 0x340
	float TimeShowStatisticInfo; // 0x348
	float TimeDelayShowProgressAnimation; // 0x34c
};

struct UPlaneFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector Position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct UCTIndicatorWidget : UCTUserWidget {
	FString PlayerName; // 0x2f0
	FLinearColor PlayerColor; // 0x300
	bool bIsFriend; // 0x310
	bool bDisplayShield; // 0x311
	bool bIsLifeVisible; // 0x312
	bool bIsOccluded; // 0x313
	bool bIsOnScreen; // 0x314
	bool bIsOccludedBySmoke; // 0x315
	bool bRevealed; // 0x316
	bool bDetected; // 0x317
	float RelDistanceFromMaxDetection; // 0x318
	UWidgetAnimation* HideAnimation; // 0x320
	ESlateVisibility LifeBarVisibility; // 0x328
	USpacer* AdjustmentSpacer; // 0x330
	UCanvasPanel* CircleCanvas; // 0x338
	UImage* GaugeLife; // 0x340
	UCanvasPanel* NameCanvas; // 0x348
	UCTLifeGaugeWidget* LifeGaugeWidget; // 0x350
	UCanvasPanel* AccessoryContainer; // 0x358
	UCTScalableKeyIcon* FlameThrowerKeyIcon; // 0x360
	bool bPinged; // 0x368
	UCTProximityIndicator* ProximityIndicator; // 0x370
	bool bLifeGaugeWidgetIsValid; // 0x378
	UWidgetAnimation* OnFlamethrowerHit_Anim; // 0x380
	float DurationBeforeFTEffectHide; // 0x3a0
	float FTEffectSpeed; // 0x3a4
};

struct UCTShockwave : USceneComponent {
	float ShockWaveRadius; // 0x1f8
	float ShockwaveDuration; // 0x1fc
	float WarmupDuration; // 0x200
	bool DebugShockwave; // 0x204
	UParticleSystem* PlaceholderFX; // 0x208
	bool AffectPlayers; // 0x210
	bool TriggerShockwaveEvent; // 0x211
	TArray<ACTBeastPawn*> AffectedPawns; // 0x228
};

struct ACTCameraManager : ACameraActor {
	FTransform SmoothBeastTransform; // 0x7c0
	float DefaultInterpolationDuration; // 0x7f0
	UCurveFloat* InterpolationCurve; // 0x7f8
	ECameraBlend BlendType; // 0x800
	TMap<ECameraState, UCTCameraSettingBase*> SettingsMap; // 0x808
	float InputSumDuration; // 0x858
	float BoostTimer; // 0x85c
	USceneComponent* TargetComponent; // 0x870
	USpringArmComponent* ArmComponent; // 0x878
	ACTBeastPawn* BeastPawn; // 0x880
	ECameraState eCurrentState; // 0x888
	TArray<UCTCameraState*> StatesArray; // 0x890
	FVector2D LSInputSum; // 0x8a0
	FVector2D RSInput; // 0x8a8
	FVector2D RSInputSum; // 0x8b0
	float TimeFromLastPulse; // 0x8b8
	float PulseDuration; // 0x8bc
	float PulseIntensity; // 0x8c0
	TArray<UCTCameraLayer*> LayersArray; // 0x9b8
	UCameraShakeBase* pSailShake; // 0x9c8
	UCameraShakeBase* pPulseShake; // 0x9d0
	UCameraShakeBase* pSpeedShake; // 0x9d8
	UMaterial* PostProcessMaterial; // 0xa08
	UMaterialInstanceDynamic* PostProcessMaterialInstance; // 0xa10
	FWeightedBlendable PostProcessWeightedMaterial; // 0xa18
	UParticleSystemComponent* SpeedFX; // 0xa28
	UCTCameraSettingBase* DefaultRSCam; // 0xa30
	UCTCameraSetting* OldRSCam; // 0xa38
	float LSInputSumToleranceFromDefaultState; // 0xa40
	float LSInputToleranceFromDefaultState; // 0xa44
	float RSInputToleranceFromRightStickState; // 0xa48
	float RealSpeedRatioToleranceFromDefaultState; // 0xa4c
	float LSInputToleranceFromDiveState; // 0xa50
	float LSInputToleranceFromUpStruggleState; // 0xa54
	float CollisionScoreToleranceFromCollisionState; // 0xa58
	float RealSpeedRatioToleranceFromCollisionState; // 0xa5c
	float RSInputSqrdToleranceToRightStickState; // 0xa60
	float CollisionScoreToleranceToCollisionState; // 0xa64
	float RealSpeedRatioToleranceToCollisionState; // 0xa68
	float MinSpeedRatioToEnableSpeedFX; // 0xa6c
};

struct UCTForceFeedbackDataAsset : UDataAsset {
	TMap<ECTForceFeedbackId, FCTForceFeedbackData> Data; // 0x30
};

struct UMaterialInterface : UObject {
	USubsurfaceProfile* SubsurfaceProfile; // 0x38
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x50
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct UCTProfileStatsWidget : UCTUserWidget {
	bool bIsBlackBackgroundVisible; // 0x2f0
	float BackgroundHeightOffset; // 0x2f4
	UTextBlock* SeasonText; // 0x2f8
	URichTextBlock* KillText; // 0x300
	URichTextBlock* DeathText; // 0x308
	URichTextBlock* KDRatioValueText; // 0x310
	URichTextBlock* KDRatioText; // 0x318
	UScaleBox* KDScaleBox; // 0x320
	URichTextBlock* WinText; // 0x328
	URichTextBlock* LoseText; // 0x330
	URichTextBlock* WLRatioValueText; // 0x338
	URichTextBlock* WLRatioText; // 0x340
	UScaleBox* WLScaleBox; // 0x348
	float MaxRatioTextLen; // 0x350
	UVerticalBox* ClassesStatsHolder; // 0x358
	UCTClassStatsWidget* ClassStatsWidgetClass; // 0x360
	UImage* StatsBackground; // 0x368
	UCanvasPanel* StatsPanel; // 0x370
	USizeBox* SizeBoxSeason; // 0x378
	USizeBox* SizeBoxCommonStats; // 0x380
};

struct UCTSocialUserStatusWidget : UCTUserWidget {
	FSocialStatusData StatusData; // 0x2f0
	UCTRichTextBlock* Status; // 0x348
	UCTUserWidget* Separator; // 0x350
	UCTRichTextBlock* Explanation; // 0x358
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	FGuid UsageId; // 0x2c
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1c8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x2b8
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2c8
};

struct ACTDestructibleActor : AActor {
	UCTHealthComponent* HealthComp; // 0x220
	UStaticMeshComponent* DestructibleActorMesh; // 0x228
	UWidgetComponent* LockWidgetComp; // 0x230
	int32_t TeamId; // 0x238
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTextureEnableAutoImport : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char bReflectionCaptureCompression : 1; // 0x6c
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6d
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	EFixedFoveationLevels HMDFixedFoveationLevel; // 0x88
	ECustomDepthStencil CustomDepthStencil; // 0x89
	char bCustomDepthTaaJitter : 1; // 0x8c
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x90
	char bDefaultFeatureBloom : 1; // 0x94
	char bDefaultFeatureAmbientOcclusion : 1; // 0x94
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x94
	char bDefaultFeatureAutoExposure : 1; // 0x94
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x98
	float DefaultFeatureAutoExposureBias; // 0x9c
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa0
	char bUsePreExposure : 1; // 0xa0
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa0
	char bDefaultFeatureMotionBlur : 1; // 0xa0
	char bDefaultFeatureLensFlare : 1; // 0xa0
	char bTemporalUpsampling : 1; // 0xa0
	char bSSGI : 1; // 0xa0
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa4
	ELightUnits DefaultLightUnits; // 0xa5
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xa6
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xa8
	char bStencilForLODDither : 1; // 0xa8
	EEarlyZPass EarlyZPass; // 0xac
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb0
	char bDBuffer : 1; // 0xb0
	EClearSceneOptions ClearSceneMethod; // 0xb4
	char bBasePassOutputsVelocity : 1; // 0xb8
	char bVertexDeformationOutputsVelocity : 1; // 0xb8
	char bSelectiveBasePassOutputs : 1; // 0xb8
	char bDefaultParticleCutouts : 1; // 0xb8
	int32_t GPUSimulationTextureSizeX; // 0xbc
	int32_t GPUSimulationTextureSizeY; // 0xc0
	char bGlobalClipPlane : 1; // 0xc4
	EGBufferFormat GBufferFormat; // 0xc8
	char bUseGPUMorphTargets : 1; // 0xcc
	char bNvidiaAftermathEnabled : 1; // 0xcc
	char bMultiView : 1; // 0xcc
	char bMobilePostProcessing : 1; // 0xcc
	char bMobileMultiView : 1; // 0xcc
	char bMobileUseHWsRGBEncoding : 1; // 0xcc
	char bRoundRobinOcclusion : 1; // 0xcc
	char bODSCapture : 1; // 0xcc
	char bMeshStreaming : 1; // 0xcd
	float WireframeCullThreshold; // 0xd0
	char bEnableRayTracing : 1; // 0xd4
	char bEnableRayTracingTextureLOD : 1; // 0xd4
	char bSupportStationarySkylight : 1; // 0xd4
	char bSupportLowQualityLightmaps : 1; // 0xd4
	char bSupportPointLightWholeSceneShadows : 1; // 0xd4
	char bSupportAtmosphericFog : 1; // 0xd4
	char bSupportSkyAtmosphere : 1; // 0xd4
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xd4
	char bSupportSkinCacheShaders : 1; // 0xd5
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xd8
	float SkinCacheSceneMemoryLimitInMB; // 0xdc
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe0
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe0
	char bMobileAllowDistanceFieldShadows : 1; // 0xe0
	char bMobileAllowMovableDirectionalLights : 1; // 0xe0
	uint32_t MobileNumDynamicPointLights; // 0xe4
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xe8
	char bMobileAllowMovableSpotlights : 1; // 0xe8
	char bMobileAllowMovableSpotlightShadows : 1; // 0xe8
	char bSupport16BitBoneIndex : 1; // 0xe8
	char bGPUSkinLimit2BoneInfluences : 1; // 0xe8
	char bSupportDepthOnlyIndexBuffers : 1; // 0xe8
	char bSupportReversedIndexBuffers : 1; // 0xe8
	char bLPV : 1; // 0xe8
	char bMobileAmbientOcclusion : 1; // 0xe9
	char bUseUnlimitedBoneInfluences : 1; // 0xe9
	int32_t UnlimitedBonInfluencesThreshold; // 0xec
	FPerPlatformInt MaxSkinBones; // 0xf0
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf4
	char bMobileSupportsGen4TAA : 1; // 0xf8
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0xfc
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0xfd
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0x100
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x118
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x130
};

struct UMagicLeapARPinComponent : USceneComponent {
	FString ObjectUID; // 0x1f8
	int32_t UserIndex; // 0x208
	EMagicLeapAutoPinType AutoPinType; // 0x20c
	bool bShouldPinActor; // 0x20d
	UMagicLeapARPinSaveGame* PinDataClass; // 0x210
	TSet<EMagicLeapARPinType> SearchPinTypes; // 0x218
	USphereComponent* SearchVolume; // 0x268
	FMulticastInlineDelegate OnPersistentEntityPinned; // 0x270
	FMulticastInlineDelegate OnPersistentEntityPinLost; // 0x280
	FMulticastInlineDelegate OnPinDataLoadAttemptCompleted; // 0x290
	FGuid PinnedCFUID; // 0x2a0
	USceneComponent* PinnedSceneComponent; // 0x2b0
	UMagicLeapARPinSaveGame* PinData; // 0x2b8
};

struct UCTGameStateUIManagerComponent : UActorComponent {
	UCTWidgetsDataBase* WidgetsDataBase; // 0xb0
	UCTNavigationPage* DefaultLayerClass; // 0xb8
	UCTIngameMenuWidget* IngameMenuWidgetClass; // 0xc0
	UCTTransitionWidget* TransitionWidgetClass; // 0xc8
	UCTLobbyWidget* ReadyWidgetClass; // 0xd0
	UCTLobbyBoardHUDWidgetBase* LobbyBoardHUDWidgetClass; // 0xd8
	UCTUserWidget* SpectatorHUDWidgetClass; // 0xe0
	UCTPlayerSpectatorCameraWidget* PlayerSpectatorCameraWidgetClass; // 0xe8
	UCTScoreBoardHUDWidget* ScoreBoardHUDWidgetClass; // 0xf0
	UCTCharacClassSelectionWidget1* CharacClassSelectionWidgetClass; // 0xf8
	UCTCharacGadgetSelectionWidget1* CharacGadgetSelectionWidgetClass; // 0x100
	UCTCharacClassTimerAndBoard* CharacTimerAndBoardWidgetClass; // 0x108
	UCTWarmUpWidget* WarmUpWidgetClass; // 0x110
	UCTUserWidget* IntroRTCWidgetClass; // 0x118
	UCTPortraitScreen* PortraitScreenClass; // 0x120
	UCTStartScreenWidget* StartScreenWidgetClass; // 0x128
	UCTSuddenDeathHUDWidget* SuddenDeathHUDClass; // 0x130
	UCTScoreBoardHUDWidget* SuddenDeathWaitClass; // 0x138
	UCTEndMatchSummary* EndMatchSummaryEggWidgetClass; // 0x140
	UCTEndMatchSummaryXPAndQuestsWdgt* EndMatchSummaryXPAndQuestsWidgetClass; // 0x148
	UCTEndMatchSummary* EndMatchSummaryRankProgressWidgetClass; // 0x150
	UCTLoadingScreenWidget* DebugLoadingScreenWidgetClass; // 0x158
	UCTLoadingScreenWidget* LoadingScreenWidgetClass; // 0x160
	UCTScoreNumberFeedback* ScoreNumberWidgetClass; // 0x168
	UCTPodiumWidget* PodiumWidgetClass; // 0x170
	UCTTransitionSettings* TransitionSettings; // 0x178
	FCTUIShakePulse ShakeOrPulseFeature; // 0x180
	float ScoreBoardDuration; // 0x268
	float EndMatchXPAndQuestsAdditionalDuration; // 0x26c
	float EndMatchXPAndQuestsDefaultDuration; // 0x270
	float EndMatchSummaryEggDuration; // 0x274
	float EndMatchSummaryRankDuration; // 0x278
	float LoobyRevealPortraitDuration; // 0x27c
	float PortraitVersusDuration; // 0x280
	TArray<FCTUITrack> Tracks; // 0x288
	TArray<UCTNavigationPage*> AllLayersArray; // 0x298
	TArray<UCTUserWidget*> AllWidgetsArray; // 0x2a8
	TArray<UCTIngameWidgetController*> Controllers; // 0x2b8
	TArray<UCTUITransition*> AllTransitionsArray; // 0x2c8
	TArray<EGameStateUIWidgetType> WidgetsToHide; // 0x2d8
	TArray<EGameStateUIWidgetType> WidgetsToShow; // 0x2e8
	TArray<EGameStateUIWidgetType> FakeShownWidgets; // 0x2f8
	TArray<ECTTransitionConsumableEvent> TransitionEvents; // 0x308
	bool bScoreBoardRequested; // 0x318
