// Created by BlueFire1337
// Updated 2021-12-08
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x660f0d0;
	constexpr auto GObjects = 0x6617630;
	constexpr auto GWorld = 0x670f290;
}

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x40
	UNavArea* Agent1Area; // 0x48
	UNavArea* Agent2Area; // 0x50
	UNavArea* Agent3Area; // 0x58
	UNavArea* Agent4Area; // 0x60
	UNavArea* Agent5Area; // 0x68
	UNavArea* Agent6Area; // 0x70
	UNavArea* Agent7Area; // 0x78
	UNavArea* Agent8Area; // 0x80
	UNavArea* Agent9Area; // 0x88
	UNavArea* Agent10Area; // 0x90
	UNavArea* Agent11Area; // 0x98
	UNavArea* Agent12Area; // 0xa0
	UNavArea* Agent13Area; // 0xa8
	UNavArea* Agent14Area; // 0xb0
	UNavArea* Agent15Area; // 0xb8
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x8d0
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UAISense_Prediction : UAISense {
	TArray<FAIPredictionEvent> RegisteredEvents; // 0x120
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct AArchVisCharacter : ACharacter {
	FString LookUpAxisName; // 0x7f0
	FString LookUpAtRateAxisName; // 0x800
	FString TurnAxisName; // 0x810
	FString TurnAtRateAxisName; // 0x820
	FString MoveForwardAxisName; // 0x830
	FString MoveRightAxisName; // 0x840
	float MouseSensitivityScale_Pitch; // 0x850
	float MouseSensitivityScale_Yaw; // 0x854
};

struct USlateDataSheet : UObject {
	UTexture2D* DataTexture; // 0x28
};

struct UMovieScene3DAttachSection : UMovieScene3DConstraintSection {
	FName AttachSocketName; // 0xd8
	FName AttachComponentName; // 0xe0
	char bConstrainTx : 1; // 0xe8
	char bConstrainTy : 1; // 0xe8
	char bConstrainTz : 1; // 0xe8
	char bConstrainRx : 1; // 0xe8
	char bConstrainRy : 1; // 0xe8
	char bConstrainRz : 1; // 0xe8
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x110
	UGraniteTexture* GraniteTexture; // 0x118
};

struct UMovieSceneNameableTrack : UMovieSceneTrack {
	FMovieSceneTrackEvalOptions EvalOptions; // 0xb0
};

struct UConanBehaviorTreeComponent : UBehaviorTreeComponent {
	TArray<UBTNode*> NodeInstances; // 0x178
};

struct ULoadGuildsCallProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UFeatResultRecipeInfoView : URootWidget {
	URecipeItem* m_Item; // 0x318
};

struct ANavigationData : AActor {
	UPrimitiveComponent* RenderingComp; // 0x3d0
	FNavDataConfig NavDataConfig; // 0x3d8
	char bEnableDrawing : 1; // 0x428
	char bForceRebuildOnLoad : 1; // 0x428
	char bCanBeMainNavData : 1; // 0x428
	char bCanSpawnOnRebuild : 1; // 0x428
	char bRebuildAtRuntime : 1; // 0x428
	ERuntimeGenerationType RuntimeGeneration; // 0x42c
	float ObservedPathsTickInterval; // 0x430
	uint32_t DataVersion; // 0x434
	TArray<FSupportedAreaData> SupportedAreas; // 0x508
};

struct UConanAdaptiveSystemComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xa8
	char bIsClientOnly : 1; // 0xa8
	char bNetAddressable : 1; // 0xa8
	char bAllowAnyoneToDestroyMe : 1; // 0xa8
	char bCreatedByConstructionScript : 1; // 0xa8
	char bInstanceComponent : 1; // 0xa8
	char bAutoActivate : 1; // 0xa8
	char bIsActive : 1; // 0xa8
	char bEditableWhenInherited : 1; // 0xa8
	char bCanEverAffectNavigation : 1; // 0xa8
	char bIsEditorOnly : 1; // 0xa8
	EComponentCreationMethod CreationMethod; // 0xb1
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xc0
	FScriptMulticastDelegate OnComponentActivated; // 0xd0
	FScriptMulticastDelegate OnComponentDeactivated; // 0xe0
};

struct UW_RatingWidget_C : URatingWidgetBase {
	ERatingCategory RatingCategory; // 0x338
	bool CanBeChanged; // 0x339
};

struct UConanCheatManager : UCheatManager {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct UIconGridBase : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UCharacterMovementComponent : UPawnMovementComponent {
	ACharacter* CharacterOwner; // 0x1a0
	float GravityScale; // 0x1a8
	float MaxStepHeight; // 0x1ac
	float JumpZVelocity; // 0x1b0
	float JumpOffJumpZFactor; // 0x1b4
	float WalkableFloorAngle; // 0x1bc
	float WalkableFloorZ; // 0x1c0
	EMovementMode MovementMode; // 0x1c4
	char CustomMovementMode; // 0x1c5
	bool bIsSwimmingOnSurface; // 0x1c6
	float GroundFriction; // 0x1f0
	float MaxWalkSpeed; // 0x1f4
	float MaxWalkSpeedCrouched; // 0x1f8
	float MaxSwimSpeed; // 0x1fc
	float MaxFlySpeed; // 0x200
	float MaxCustomMovementSpeed; // 0x204
	float MaxClimbSpeed; // 0x208
	float MaxAcceleration; // 0x20c
	float MaxDepthDefiningSurfaceSwimming; // 0x210
	float TargetDepthWhenSurfaceSwimming; // 0x214
	float TimeToReachTargetDepth; // 0x218
	float MaxAllowedStabilizingVelocity; // 0x21c
	bool bIsCollidingWhileSwimming; // 0x220
	bool bIsWading; // 0x221
	bool bDisableBuoyancy; // 0x222
	float BrakingFrictionFactor; // 0x224
	float BrakingFriction; // 0x228
	char bUseSeparateBrakingFriction : 1; // 0x22c
	float BrakingDecelerationWalking; // 0x230
	float BrakingDecelerationFalling; // 0x234
	float BrakingDecelerationSwimming; // 0x238
	float BrakingDecelerationFlying; // 0x23c
	float AirControl; // 0x240
	float AirControlBoostMultiplier; // 0x244
	float AirControlBoostVelocityThreshold; // 0x248
	float FallingLateralFriction; // 0x24c
	float CrouchedHalfHeight; // 0x250
	float Buoyancy; // 0x254
	float PerchRadiusThreshold; // 0x258
	float PerchAdditionalHeight; // 0x25c
	FRotator RotationRate; // 0x260
	char bUseControllerDesiredRotation : 1; // 0x26c
	char bOrientRotationToMovement : 1; // 0x26c
	bool bAllowPhysicsRotationDuringRootMotion; // 0x270
	char bMovementInProgress : 1; // 0x274
	char bEnableScopedMovementUpdates : 1; // 0x274
	char bForceMaxAccel : 1; // 0x274
	char bRunPhysicsWithNoController : 1; // 0x274
	char bForceNextFloorCheck : 1; // 0x274
	char bShrinkProxyCapsule : 1; // 0x274
	char bCanWalkOffLedges : 1; // 0x274
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x274
	char bDeferUpdateMoveComponent : 1; // 0x274
	USceneComponent* DeferredUpdatedMoveComponent; // 0x278
	float MaxOutOfWaterStepHeight; // 0x280
	float OutofWaterZ; // 0x284
	float Mass; // 0x288
	bool bEnablePhysicsInteraction; // 0x28c
	bool bTouchForceScaledToMass; // 0x28d
	bool bPushForceScaledToMass; // 0x28e
	bool bPushForceUsingZOffset; // 0x28f
	bool bScalePushForceToVelocity; // 0x290
	float StandingDownwardForceScale; // 0x294
	float InitialPushForceFactor; // 0x298
	float PushForceFactor; // 0x29c
	float PushForcePointZOffsetFactor; // 0x2a0
	float TouchForceFactor; // 0x2a4
	float MinTouchForce; // 0x2a8
	float MaxTouchForce; // 0x2ac
	float RepulsionForce; // 0x2b0
	char bForceBraking : 1; // 0x2b4
	float CrouchedSpeedMultiplier; // 0x2b8
	float UpperImpactNormalScale; // 0x2bc
	FVector Acceleration; // 0x2c0
	FVector LastUpdateLocation; // 0x2cc
	FQuat LastUpdateRotation; // 0x2e0
	FVector LastUpdateVelocity; // 0x2f0
	float ServerLastTransformUpdateTimeStamp; // 0x2fc
	FVector PendingImpulseToApply; // 0x300
	FVector PendingForceToApply; // 0x30c
	float AnalogInputModifier; // 0x318
	float MaxSimulationTimeStep; // 0x324
	int32_t MaxSimulationIterations; // 0x328
	float MaxDepenetrationWithGeometry; // 0x32c
	float MaxDepenetrationWithGeometryAsProxy; // 0x330
	float MaxDepenetrationWithPawn; // 0x334
	float MaxDepenetrationWithPawnAsProxy; // 0x338
	float NetworkSimulatedSmoothLocationTime; // 0x33c
	float NetworkSimulatedSmoothLocationZTime; // 0x340
	float NetworkSimulatedSmoothRotationTime; // 0x344
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x348
	float ListenServerNetworkSimulatedSmoothLocationZTime; // 0x34c
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x350
	float NetworkMaxSmoothUpdateDistance; // 0x354
	float NetworkNoSmoothUpdateDistance; // 0x358
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x35c
	float LedgeCheckThreshold; // 0x360
	float JumpOutOfWaterPitch; // 0x364
	FFindFloorResult CurrentFloor; // 0x368
	EMovementMode DefaultLandMovementMode; // 0x400
	EMovementMode DefaultWaterMovementMode; // 0x401
	float NetMoveDeltaMultiplier; // 0x404
	FScriptMulticastDelegate SignalOnSurfaceTypeChanged; // 0x408
	EPhysicalSurface lastSurface; // 0x418
	EMovementMode GroundMovementMode; // 0x419
	char bMaintainHorizontalGroundVelocity : 1; // 0x41c
	char bImpartBaseVelocityX : 1; // 0x41c
	char bImpartBaseVelocityY : 1; // 0x41c
	char bImpartBaseVelocityZ : 1; // 0x41c
	char bImpartBaseAngularVelocity : 1; // 0x41c
	char bJustTeleported : 1; // 0x41c
	char bNetworkUpdateReceived : 1; // 0x41c
	char bNetworkMovementModeChanged : 1; // 0x41c
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x41c
	char bNotifyApex : 1; // 0x41c
	char bCheatFlying : 1; // 0x41c
	char bWantsToCrouch : 1; // 0x41c
	char bCrouchMaintainsBaseLocation : 1; // 0x41c
	char bIgnoreBaseRotation : 1; // 0x41c
	char bFastAttachedMove : 1; // 0x41c
	char bAlwaysCheckFloor : 1; // 0x41c
	char bUseFlatBaseForFloorChecks : 1; // 0x41c
	char bPerformingJumpOff : 1; // 0x41c
	char bWantsToLeaveNavWalking : 1; // 0x41c
	char bUseRVOAvoidance : 1; // 0x41c
	char bRequestedMoveUseAcceleration : 1; // 0x41c
	char bWantsToClimb : 1; // 0x41c
	char bHasRequestedVelocity : 1; // 0x41c
	char bRequestedMoveWithMaxSpeed : 1; // 0x41c
	char bWasAvoidanceUpdated : 1; // 0x41c
	char bProjectNavMeshWalking : 1; // 0x41c
	char bSwitchToWalkingIfNoNavData : 1; // 0x41c
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x41c
	char bForceSweepWhenNavWalking : 1; // 0x41c
	char bAssumeServerIsNavWalkingInSimulateMovement : 1; // 0x420
	float AvoidanceConsiderationRadius; // 0x438
	FVector RequestedVelocity; // 0x43c
	int32_t AvoidanceUID; // 0x448
	FNavAvoidanceMask AvoidanceGroup; // 0x44c
	FNavAvoidanceMask GroupsToAvoid; // 0x450
	FNavAvoidanceMask GroupsToIgnore; // 0x454
	float AvoidanceWeight; // 0x458
	FVector PendingLaunchVelocity; // 0x45c
	float NavMeshProjectionInterval; // 0x508
	float NavMeshProjectionTimer; // 0x50c
	float NavMeshProjectionInterpSpeed; // 0x510
	float NavMeshProjectionHeightScaleUp; // 0x514
	float NavMeshProjectionHeightScaleDown; // 0x518
	float NavWalkingFloorDistTolerance; // 0x51c
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x520
	float MinTimeBetweenTimeStampResets; // 0x588
	FRootMotionSourceGroup CurrentRootMotion; // 0x590
	FRootMotionMovementParams RootMotionParams; // 0x720
	FVector AnimRootMotionVelocity; // 0x760
	bool bWasSimulatingRootMotion; // 0x76c
};

struct UParticleModuleBeamBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x38
	float DelayMax; // 0x3c
};

struct URandomBuildingGeneratorProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate BuildingCreated; // 0x28
	FScriptMulticastDelegate BuildingFailed; // 0x38
	FScriptMulticastDelegate BuildingProgressUpdate; // 0x48
	bool DoneLoadingClasses; // 0xc0
	FVector SpawnLocation; // 0xc4
	FRotator spawnRotation; // 0xd0
	float spawnRadius; // 0xdc
	ESocketDistanceSortMethod sortMethod; // 0xe0
	int32_t NumFoundations; // 0xe4
	int32_t NumOtherPieces; // 0xe8
	int32_t NumRemainingFoundations; // 0xec
	int32_t NumRemainingOtherPieces; // 0xf0
	FString ListOfIDsToBuildWith; // 0xf8
	TArray<UObject*> m_FoundationClasses; // 0x108
	TArray<UObject*> m_BuildingClasses; // 0x118
	UObject* m_FoundationClass; // 0x128
	ABuildingBase* m_CreatedBuildingMaster; // 0x130
	float m_LastUpdateEventTime; // 0x138
	float m_LastAddedPieceTime; // 0x13c
	UObject* m_LastBuildingClassUsed; // 0x140
	UObject* m_CurrentBuildingClass; // 0x148
	TArray<FPotentialBuildGhost> m_DistanceSortedQueuedPotentialGhosts; // 0x150
	UInstancedBuildingComponent* m_AwaitingPhysicsStateComponent; // 0x198
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct ASpectatorPawn : ADefaultPawn {
	float BaseTurnRate; // 0x430
	float BaseLookUpRate; // 0x434
	UPawnMovementComponent* MovementComponent; // 0x438
	USphereComponent* CollisionComponent; // 0x440
	UStaticMeshComponent* MeshComponent; // 0x448
	char bAddDefaultMovementBindings : 1; // 0x450
};

struct UConanGameInstance : UDWGameInstance {
	float OnlineSessionCreationTimeout; // 0x158
	bool m_ShowLoadingScreens; // 0x1e0
	AServerSettings* ServerSettings; // 0x880
	FScriptMulticastDelegate SignalServerConnectionFailure; // 0x8a0
	FScriptMulticastDelegate SignalOtherConnectionFalure; // 0x8b0
	FScriptMulticastDelegate SignalGamepadChanged; // 0x8c0
	FScriptMulticastDelegate SignalLiveConnectionLost; // 0x8d0
	FScriptMulticastDelegate SignalLiveConnectionRestored; // 0x8e0
	FScriptMulticastDelegate SignalTrailStatusChanged; // 0x8f0
	FScriptMulticastDelegate SignalClientStateChanged; // 0x900
	bool m_GameStartedOffline; // 0x910
	bool m_ActiveUserIsGuestAccount; // 0x911
	UConanTicker* Ticker; // 0x918
	UConsoleSettingsHelper* m_ConsoleSettingsHelper; // 0x998
	UGUIModuleController* m_GUIModuleController; // 0x9a0
	UClass* m_SettingsBPClass; // 0xaa8
	FString m_NextMapName; // 0xac8
	UFrameRateReporter* m_BenchmarkFrameRateReporter; // 0xaf8
	UShowLoginUICallbackProxy* m_ShowLoginUIProxy; // 0xc40
	UConanOnlineEventsLibrary* m_OnlineEventsLibrary; // 0xc50
	UInGameJoinOrInvite* m_InGameJoinOrInvite; // 0xc58
	UInviteControllerParing* m_InviteParing; // 0xc60
	TArray<UMessageBoxWidget*> ErrorMessageBoxStack; // 0xc90
	TArray<UGraniteTileSet*> PreloadedGraniteTilesets; // 0xd10
	FScriptMulticastDelegate ActiveDeviceProfileChanged; // 0xd98
	UDataTable* m_SpawnProfessionTable; // 0xda8
	UDataTable* m_SpawnThrallTierTable; // 0xdb0
};

struct ADWPlayerController : APlayerController {
	UPlayer* Player; // 0x438
	APawn* AcknowledgedPawn; // 0x448
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x450
	AHUD* MyHUD; // 0x460
	APlayerCameraManager* PlayerCameraManager; // 0x468
	APlayerCameraManager* PlayerCameraManagerClass; // 0x470
	bool bAutoManageActiveCameraTarget; // 0x478
	FRotator TargetViewRotation; // 0x47c
	float SmoothTargetViewRotationSpeed; // 0x494
	TArray<AActor*> HiddenActors; // 0x498
	float LastSpectatorStateSynchTime; // 0x4a8
	FVector LastSpectatorSyncLocation; // 0x4ac
	FRotator LastSpectatorSyncRotation; // 0x4b8
	int32_t ClientCap; // 0x4c4
	UCheatManager* CheatManager; // 0x4c8
	UCheatManager* CheatClass; // 0x4d0
	UPlayerInput* PlayerInput; // 0x4d8
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x4e0
	char bPlayerIsWaiting : 1; // 0x580
	char NetPlayerIndex; // 0x584
	UNetConnection* PendingSwapConnection; // 0x588
	UNetConnection* NetConnection; // 0x590
	float InputYawScale; // 0x5a8
	float InputPitchScale; // 0x5ac
	float InputRollScale; // 0x5b0
	char bShowMouseCursor : 1; // 0x5b4
	char bEnableClickEvents : 1; // 0x5b4
	char bEnableTouchEvents : 1; // 0x5b4
	char bEnableMouseOverEvents : 1; // 0x5b4
	char bEnableTouchOverEvents : 1; // 0x5b4
	char bForceFeedbackEnabled : 1; // 0x5b4
	char bKeepPawnAliveOnControllerDeath : 1; // 0x5b4
	TArray<FKey> ClickEventKeys; // 0x5b8
	EMouseCursor DefaultMouseCursor; // 0x5c8
	EMouseCursor CurrentMouseCursor; // 0x5c9
	ECollisionChannel DefaultClickTraceChannel; // 0x5ca
	ECollisionChannel CurrentClickTraceChannel; // 0x5cb
	float HitResultTraceDistance; // 0x5cc
	UInputComponent* InactiveStateInputComponent; // 0x650
	UTouchInterface* CurrentTouchInterface; // 0x670
	ASpectatorPawn* SpectatorPawn; // 0x6b8
	FVector SpawnLocation; // 0x6c0
	bool bIsLocalPlayerController; // 0x6d0
	uint16_t SeamlessTravelCount; // 0x6d2
	uint16_t LastCompletedSeamlessTravelCount; // 0x6d4
};

struct UStreamingProxyUntyped : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnLoaded; // 0x28
	TArray<FStringAssetReference> Assets; // 0x40
};

struct UAIResource_Logic : UGameplayTaskResource {
	int32_t ManualResourceID; // 0x28
	uint8_t AutoResourceID; // 0x2c
	char bManuallySetID : 1; // 0x30
};

struct AGeneratedMeshAreaLight : ASpotLight {
	USpotLightComponent* SpotLightComponent; // 0x3e0
};

struct UAISenseConfig_Prediction : UAISenseConfig {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UInteractableFoliageBase : UFoliageInstancedStaticMeshComponent {
	UDestructibleMesh* DestructibleMesh; // 0x9e0
	FScriptMulticastDelegate OnInstanceTakePointDamage; // 0xa00
	FScriptMulticastDelegate OnInstanceTakeRadialDamage; // 0xa10
	UDestructibleMesh* DestructibleMeshPtr; // 0xa20
};

struct UParticleModuleVectorFieldRotationRate : UParticleModuleVectorFieldBase {
	FVector RotationRate; // 0x30
};

struct UAsyncTaskQueryPurchases : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnSucceeded; // 0x28
	FScriptMulticastDelegate OnFailed; // 0x38
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct AFunctionalTestGameMode : AGameModeBase {
	FString OptionsString; // 0x3d0
	AGameSession* GameSessionClass; // 0x3e0
	AGameStateBase* GameStateClass; // 0x3e8
	APlayerController* PlayerControllerClass; // 0x3f0
	APlayerState* PlayerStateClass; // 0x3f8
	AHUD* HUDClass; // 0x400
	APawn* DefaultPawnClass; // 0x408
	ASpectatorPawn* SpectatorClass; // 0x410
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x418
	AGameSession* GameSession; // 0x420
	AGameStateBase* GameState; // 0x428
	FText DefaultPlayerName; // 0x430
	char bUseSeamlessTravel : 1; // 0x448
	char bStartPlayersAsSpectators : 1; // 0x448
	char bPauseable : 1; // 0x448
};

struct UHorizontalBox : UPanelWidget {
	TArray<UPanelSlot*> Slots; // 0x118
};

struct UChatWindow : UWindowRoot {
	UUserWidget* ChatLineClass; // 0x398
	FColor SystemMessageColor; // 0x3a0
	FColor GlobalMessageColor; // 0x3a4
	FColor LocalMessageColor; // 0x3a8
	FColor GuildMessageColor; // 0x3ac
	FColor MeMessageColor; // 0x3b0
	FColor GeneratedMessageColor; // 0x3b4
};

struct AAtmosphericFog : AInfo {
	UAtmosphericFogComponent* AtmosphericFogComponent; // 0x3d0
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	FLinearColor Constant; // 0x60
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x70
	FColorMaterialInput DiffuseColor; // 0x78
	FColorMaterialInput SpecularColor; // 0xb8
	FColorMaterialInput BaseColor; // 0xf8
	FScalarMaterialInput Metallic; // 0x138
	FScalarMaterialInput Specular; // 0x178
	FScalarMaterialInput Roughness; // 0x1b8
	FVectorMaterialInput Normal; // 0x1f8
	FColorMaterialInput EmissiveColor; // 0x240
	FScalarMaterialInput Opacity; // 0x280
	FScalarMaterialInput OpacityMask; // 0x2c0
	EMaterialDomain MaterialDomain; // 0x300
	EBlendMode BlendMode; // 0x301
	EDecalBlendMode DecalBlendMode; // 0x302
	EMaterialDecalResponse MaterialDecalResponse; // 0x303
	EMaterialShadingModel ShadingModel; // 0x304
	float OpacityMaskClipValue; // 0x308
	FVectorMaterialInput WorldPositionOffset; // 0x310
	FVectorMaterialInput WorldDisplacement; // 0x358
	FScalarMaterialInput TessellationMultiplier; // 0x3a0
	FColorMaterialInput SubsurfaceColor; // 0x3e0
	FScalarMaterialInput ClearCoat; // 0x420
	FScalarMaterialInput ClearCoatRoughness; // 0x460
	FScalarMaterialInput AmbientOcclusion; // 0x4a0
	FScalarMaterialInput Refraction; // 0x4e0
	FVector2MaterialInput CustomizedUVs[0x8]; // 0x520
	FMaterialAttributesInput MaterialAttributes; // 0x760
	FScalarMaterialInput PixelDepthOffset; // 0x7a0
	char bEnableSeparateTranslucency : 1; // 0x7e0
	char bEnableMobileSeparateTranslucency : 1; // 0x7e0
	char bEnableResponsiveAA : 1; // 0x7e0
	char bScreenSpaceReflections : 1; // 0x7e0
	char TwoSided : 1; // 0x7e0
	char DitheredLODTransition : 1; // 0x7e0
	char DitherOpacityMask : 1; // 0x7e0
	char bAllowNegativeEmissiveColor : 1; // 0x7e0
	int32_t NumCustomizedUVs; // 0x7e4
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x7e8
	float TranslucencyDirectionalLightingIntensity; // 0x7ec
	char AllowTranslucentCustomDepthWrites : 1; // 0x7f0
	float TranslucentShadowDensityScale; // 0x7f4
	float TranslucentSelfShadowDensityScale; // 0x7f8
	float TranslucentSelfShadowSecondDensityScale; // 0x7fc
	float TranslucentSelfShadowSecondOpacity; // 0x800
	float TranslucentBackscatteringExponent; // 0x804
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x808
	float TranslucentShadowStartOffset; // 0x818
	char bDisableDepthTest : 1; // 0x81c
	char bGenerateSphericalParticleNormals : 1; // 0x81c
	char bTangentSpaceNormal : 1; // 0x81c
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x81c
	char bBlockGI : 1; // 0x81c
	char bUsedAsSpecialEngineMaterial : 1; // 0x81c
	char bUsedWithSkeletalMesh : 1; // 0x81c
	char bUsedWithEditorCompositing : 1; // 0x81c
	char bUsedWithParticleSprites : 1; // 0x81c
	char bUsedWithBeamTrails : 1; // 0x81c
	char bUsedWithMeshParticles : 1; // 0x81c
	char bUsedWithStaticLighting : 1; // 0x81c
	char bUsedWithMorphTargets : 1; // 0x81c
	char bUsedWithSplineMeshes : 1; // 0x81c
	char bUsedWithInstancedStaticMeshes : 1; // 0x81c
	char bUsesDistortion : 1; // 0x81c
	char bUsedWithClothing : 1; // 0x81c
	char bUsedWithUI : 1; // 0x81c
	char bAutomaticallySetUsageInEditor : 1; // 0x81c
	char bFullyRough : 1; // 0x81c
	char bUseFullPrecision : 1; // 0x81c
	char bUseLightmapDirectionality : 1; // 0x81c
	char bUseHQForwardReflections : 1; // 0x81c
	char bUsePlanarForwardReflections : 1; // 0x81c
	char bNormalCurvatureToRoughness : 1; // 0x81c
	EMaterialTessellationMode D3D11TessellationMode; // 0x820
	char bEnableCrackFreeDisplacement : 1; // 0x824
	char bEnableAdaptiveTessellation : 1; // 0x824
	float MaxDisplacement; // 0x828
	char Wireframe : 1; // 0x82c
	char bOutputVelocityOnBasePass : 1; // 0x82c
	int32_t EditorX; // 0x830
	int32_t EditorY; // 0x834
	int32_t EditorPitch; // 0x838
	int32_t EditorYaw; // 0x83c
	TArray<UMaterialExpression*> Expressions; // 0x840
	TArray<FMaterialFunctionInfo> MaterialFunctionInfos; // 0x850
	TArray<FMaterialParameterCollectionInfo> MaterialParameterCollectionInfos; // 0x860
	char bCanMaskedBeAssumedOpaque : 1; // 0x870
	char bIsMasked : 1; // 0x870
	char bIsPreviewMaterial : 1; // 0x870
	char bUseMaterialAttributes : 1; // 0x870
	char bUseTranslucencyVertexFog : 1; // 0x870
	char bComputeFogPerPixel : 1; // 0x870
	char bAllowDevelopmentShaderCompile : 1; // 0x870
	char bIsMaterialEditorStatsMaterial : 1; // 0x870
	uint32_t UsageFlagWarnings; // 0x874
	EBlendableLocation BlendableLocation; // 0x878
	int32_t BlendablePriority; // 0x87c
	bool BlendableOutputAlpha; // 0x880
	ERefractionMode RefractionMode; // 0x881
	float RefractionDepthBias; // 0x884
	FGuid StateId; // 0x888
	TArray<UGraniteTexture*> ExpressionGraniteTextureReferences; // 0x900
	TArray<UTexture*> ExpressionTextureReferences; // 0x988
};

struct APaperFlipbookActor : AActor {
	UPaperFlipbookComponent* RenderComponent; // 0x3d0
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x140
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UMovieSceneBindingOverrides : UObject {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x30
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xc8
	UCameraShake* ShakeClass; // 0xe8
	float PlayScale; // 0xf0
	ECameraAnimPlaySpace PlaySpace; // 0xf4
	FRotator UserDefinedPlaySpace; // 0xf8
};

struct UPawnActionsComponent : UActorComponent {
	APawn* ControlledPawn; // 0xf8
	TArray<FPawnActionStack> ActionStacks; // 0x100
	TArray<FPawnActionEvent> ActionEvents; // 0x110
	UPawnAction* CurrentAction; // 0x120
};

struct UGUIModuleController_Activate_CallProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnActivate; // 0x28
	FScriptMulticastDelegate OnNotActivated; // 0x38
	FScriptMulticastDelegate OnBeginLoad; // 0x48
	UGUIModuleController* GUIModuleController; // 0x58
};

struct UDistributionVectorConstant : UDistributionVector {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct UEnvQuery : UDataAsset {
	FName QueryName; // 0x28
	TArray<UEnvQueryOption*> Options; // 0x30
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UWidgetBlueprintGeneratedClass : UBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x358
	bool bAllowTemplate; // 0x360
	TArray<FDelegateRuntimeBinding> Bindings; // 0x368
	TArray<UWidgetAnimation*> Animations; // 0x378
	TArray<FName> NamedSlots; // 0x388
	bool bValidTemplate; // 0x398
	bool bTemplateInitialized; // 0x399
	bool bCookedTemplate; // 0x39a
	UUserWidget* TemplateAsset; // 0x3a0
	UUserWidget* Template; // 0x3c0
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UExporter : UObject {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int32_t PreferredFormatIndex; // 0x58
	int32_t TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
};

struct UParticleModuleSizeScaleBySpeed : UParticleModuleSizeBase {
	FVector2D SpeedScale; // 0x30
	FVector2D MaxScale; // 0x38
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xf8
	TArray<UAISense*> RegisterAsSourceForSenses; // 0x100
};

struct USoundNodeGroupControl : USoundNode {
	TArray<int32_t> GroupSizes; // 0x38
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x478
};

struct UBlackboardKeyType_Class : UBlackboardKeyType {
	UObject* BaseClass; // 0x30
};

struct UEnvQueryOption : UObject {
	UEnvQueryGenerator* Generator; // 0x28
	TArray<UEnvQueryTest*> Tests; // 0x30
};

struct UContentWidget : UPanelWidget {
	TArray<UPanelSlot*> Slots; // 0x118
};

struct UMenuAnchor : UContentWidget {
	UUserWidget* MenuClass; // 0x130
	DelegateProperty OnGetMenuContentEvent; // 0x138
	EMenuPlacement Placement; // 0x148
	bool ShouldDeferPaintingAfterWindowContent; // 0x149
	bool UseApplicationMenuStack; // 0x14a
	FScriptMulticastDelegate OnMenuOpenChanged; // 0x150
};

struct UDistributionVectorParticleParameter : UDistributionVectorParameterBase {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct USkeletalBodySetup : UBodySetup {
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x398
};

struct AAvatarCharacter : AConanCharacter {
	FText AvatarName; // 0x16e8
	AConanCharacter* m_Summoner; // 0x1700
	bool m_AvatarTimerStarted; // 0x170c
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x520
	FPartyReservation PendingReservation; // 0x530
	EClientRequestType RequestType; // 0x560
	bool bPendingReservationSent; // 0x561
	bool bCancelReservation; // 0x562
};

struct USlider : UWidget {
	float Value; // 0x118
	DelegateProperty ValueDelegate; // 0x120
	FSliderStyle WidgetStyle; // 0x130
	EOrientation Orientation; // 0x380
	FLinearColor SliderBarColor; // 0x384
	FLinearColor SliderHandleColor; // 0x394
	bool IndentHandle; // 0x3a4
	bool Locked; // 0x3a5
	float StepSize; // 0x3a8
	bool IsFocusable; // 0x3ac
	FScriptMulticastDelegate OnMouseCaptureBegin; // 0x3b0
	FScriptMulticastDelegate OnMouseCaptureEnd; // 0x3c0
	FScriptMulticastDelegate OnControllerCaptureBegin; // 0x3d0
	FScriptMulticastDelegate OnControllerCaptureEnd; // 0x3e0
	FScriptMulticastDelegate OnValueChanged; // 0x3f0
};

struct UStreamMediaSource : UBaseMediaSource {
	FString StreamUrl; // 0x38
};

struct UCommandlet : UObject {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
};

struct AConanSandboxLevelScriptActor : AConanLevelScriptActor {
	char bInputEnabled : 1; // 0x3d0
};

struct ASuspendableActor : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UVisibilityBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x40
};

struct UInterpTrack : UObject {
	TArray<UInterpTrack*> SubTracks; // 0x38
	UInterpTrackInst* TrackInstClass; // 0x48
	ETrackActiveCondition ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	char bOnePerGroup : 1; // 0x68
	char bDirGroupOnly : 1; // 0x68
	char bDisableTrack : 1; // 0x68
	char bIsSelected : 1; // 0x68
	char bIsAnimControlTrack : 1; // 0x68
	char bSubTrackOnly : 1; // 0x68
	char bVisible : 1; // 0x68
	char bIsRecording : 1; // 0x68
};

struct UParticleModuleMeshRotation_Seeded : UParticleModuleMeshRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x88
};

struct USettingsGamepadPresetBase : USubSettingsMaster {
	UTexture2D* TextureControllerPS4; // 0x328
	UTexture2D* TextureControllerXBOX; // 0x348
	UDataTable* m_PresetTable; // 0x390
	UDataTable* m_LabelsTable; // 0x398
};

struct UGuildInviteBase : UWindowRoot {
	UUserWidget* ListEntryClass; // 0x3e0
	UUniqueID* m_GuildId; // 0x410
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x3d0
	FName MatineeControllerName; // 0x3d8
	float PlayRate; // 0x3e0
	char bPlayOnLevelLoad : 1; // 0x3e4
	char bForceStartPos : 1; // 0x3e4
	float ForceStartPosition; // 0x3e8
	char bLooping : 1; // 0x3ec
	char bRewindOnPlay : 1; // 0x3ec
	char bNoResetOnRewind : 1; // 0x3ec
	char bRewindIfAlreadyPlaying : 1; // 0x3ec
	char bDisableRadioFilter : 1; // 0x3ec
	char bClientSideOnly : 1; // 0x3ec
	char bSkipUpdateIfNotVisible : 1; // 0x3ec
	char bIsSkippable : 1; // 0x3ec
	int32_t PreferredSplitScreenNum; // 0x3f0
	char bDisableMovementInput : 1; // 0x3f4
	char bDisableLookAtInput : 1; // 0x3f4
	char bHidePlayer : 1; // 0x3f4
	char bHideHud : 1; // 0x3f4
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x3f8
	char bShouldShowGore : 1; // 0x408
	TArray<UInterpGroupInst*> GroupInst; // 0x410
	TArray<FCameraCutInfo> CameraCuts; // 0x420
	char bIsPlaying : 1; // 0x430
	char bReversePlayback : 1; // 0x430
	char bPaused : 1; // 0x430
	char bPendingStop : 1; // 0x430
	float InterpPosition; // 0x434
	char ReplicationForceIsPlaying; // 0x43c
	FScriptMulticastDelegate OnPlay; // 0x440
	FScriptMulticastDelegate OnStop; // 0x450
	FScriptMulticastDelegate OnPause; // 0x460
};

struct UVoiceChatWindow : UWindowRoot {
	UUserWidget* ChatLineClass; // 0x398
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x148
	DelegateProperty TextDelegate; // 0x160
	FSlateFontInfo Font; // 0x170
	FLinearColor Color; // 0x1d8
	TArray<URichTextBlockDecorator*> Decorators; // 0x1e8
};

struct UGameplayTagsManager : UObject {
	TArray<FGameplayTagSource> TagSources; // 0xa8
	TArray<UDataTable*> GameplayTagTables; // 0x120
};

struct UMaterialExpressionParticleRelativeTime : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x300
	FVector SocketOffset; // 0x304
	FVector TargetOffset; // 0x310
	float ProbeSize; // 0x31c
	ECollisionChannel ProbeChannel; // 0x320
	char bDoCollisionTest : 1; // 0x324
	char bUsePawnControlRotation : 1; // 0x324
	char bInheritPitch : 1; // 0x324
	char bInheritYaw : 1; // 0x324
	char bInheritRoll : 1; // 0x324
	char bEnableCameraLag : 1; // 0x324
	char bEnableCameraRotationLag : 1; // 0x324
	char bUseCameraLagSubstepping : 1; // 0x324
	char bDrawDebugLagMarkers : 1; // 0x324
	float CameraLagSpeed; // 0x328
	float CameraRotationLagSpeed; // 0x32c
	float CameraLagMaxTimeStep; // 0x330
	float CameraLagMaxDistance; // 0x334
};

struct UGameplayTickGroupScheduler : UActorComponent {
	AGameplayScheduler* Scheduler; // 0xf8
};

struct UApplyRadialDamageWithFalloffProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnComplete; // 0x28
	TArray<AActor*> IgnoreActors; // 0x60
	AActor* DamageCauser; // 0x70
	AController* InstigatedByController; // 0x78
	TMap<AActor*, FHitList> OverlapComponentMap; // 0xa0
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct UCollisionStaticMeshComponent : UStaticMeshComponent {
	int32_t ForcedLodModel; // 0x7c8
	int32_t PreviousLODLevel; // 0x7cc
	UStaticMesh* StaticMesh; // 0x7d0
	int32_t MinLOD; // 0x7d8
	int32_t SubDivisionStepSize; // 0x7dc
	char bOverrideMinLOD : 1; // 0x7e0
	char bOverrideNavigationExport : 1; // 0x7e0
	char bForceNavigationObstacle : 1; // 0x7e0
	char bDisallowMeshPaintPerInstance : 1; // 0x7e0
	char bUseDefaultCollision : 1; // 0x7e0
	char bUseSubDivisions : 1; // 0x7e0
	char bIgnoreInstanceForTextureStreaming : 1; // 0x7e0
	char bOverrideLightMapRes : 1; // 0x7e0
	char bCastDistanceFieldIndirectShadow : 1; // 0x7e0
	int32_t OverriddenLightMapRes; // 0x7e4
	float DistanceFieldIndirectShadowMinVisibility; // 0x7e8
	float StreamingDistanceMultiplier; // 0x7ec
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x7f0
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x800
	FLightmassPrimitiveSettings LightmassSettings; // 0x810
};

struct AConanPlayerState : APlayerState {
	FString MasterAccountId; // 0x468
};

struct URadialMenuSegment : URootWidget {
	UTexture2D* m_IconTexture; // 0x348
	UTexture2D* m_StartCapTexture; // 0x350
	UTexture2D* m_EndCapTexture; // 0x358
};

struct UEditableTextBox : UWidget {
	FText Text; // 0x118
	DelegateProperty TextDelegate; // 0x130
	FEditableTextBoxStyle WidgetStyle; // 0x140
	USlateWidgetStyleAsset* Style; // 0x9b0
	FText HintText; // 0x9b8
	DelegateProperty HintTextDelegate; // 0x9d0
	FSlateFontInfo Font; // 0x9e0
	FLinearColor ForegroundColor; // 0xa48
	FLinearColor BackgroundColor; // 0xa58
	FLinearColor ReadOnlyForegroundColor; // 0xa68
	bool IsReadOnly; // 0xa78
	bool IsPassword; // 0xa79
	float MinimumDesiredWidth; // 0xa7c
	FMargin Padding; // 0xa80
	bool IsCaretMovedWhenGainFocus; // 0xa90
	bool SelectAllTextWhenFocused; // 0xa91
	bool RevertTextOnEscape; // 0xa92
	bool ClearKeyboardFocusOnCommit; // 0xa93
	bool SelectAllTextOnCommit; // 0xa94
	bool AllowContextMenu; // 0xa95
	EVirtualKeyboardType KeyboardType; // 0xa96
	FShapedTextOptions ShapedTextOptions; // 0xa98
	FScriptMulticastDelegate OnTextChanged; // 0xaa0
	FScriptMulticastDelegate OnTextCommitted; // 0xab0
	FScriptMulticastDelegate OnFocusReceived; // 0xac0
};

struct UDmgTypeBP_Environmental_C : UDamageType {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UMaterialExpressionCameraPositionWS : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UPetAttributeEntryView : URootWidget {
	FSlateBrush Icon; // 0x318
	FText Label; // 0x3a8
	ECharIntStatID AttributeID; // 0x3c0
};

struct UGameplayTask_ClaimResource : UGameplayTask {
	FName InstanceName; // 0x30
	UGameplayTask* ChildTask; // 0x60
};

struct UMaterialExpressionParticleMotionBlurFade : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct USettingsKeyBindingsBase : USubSettingsMaster {
	UUserWidget* m_CategoryClass; // 0x3a0
	UDataTable* m_CategoriesTable; // 0x3a8
};

struct UPreviewMeshCollection : UDataAsset {
	USkeleton* Skeleton; // 0x28
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x30
};

struct UPaperTileSet : UObject {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	FIntMargin BorderMargin; // 0x38
	FIntPoint PerTileSpacing; // 0x48
	FIntPoint DrawingOffset; // 0x50
	int32_t WidthInTiles; // 0x58
	int32_t HeightInTiles; // 0x5c
	int32_t AllocatedWidth; // 0x60
	int32_t AllocatedHeight; // 0x64
	TArray<FPaperTileMetadata> PerTileData; // 0x68
	TArray<FPaperTileSetTerrain> Terrains; // 0x78
	int32_t TileWidth; // 0x88
	int32_t TileHeight; // 0x8c
	int32_t Margin; // 0x90
	int32_t Spacing; // 0x94
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UW_Settings_Server_C : USettingsServerBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xab0
	UW_EditableLabeledSlider_C* AnimalPenCraftingTimeMultiplier; // 0xab8
	UW_TabButton_C* B_Abandonment; // 0xac0
	UW_TabButton_C* B_Chat; // 0xac8
	UW_ButtonCustom_C* B_ClearAdminPassword; // 0xad0
	UW_ButtonCustom_C* B_ClearServerpassword; // 0xad8
	UW_TabButton_C* B_Combat; // 0xae0
	UW_TabButton_C* B_Crafting; // 0xae8
	UW_TabButton_C* B_DayAndNight; // 0xaf0
	UW_TabButton_C* B_General; // 0xaf8
	UW_TabButton_C* B_Harvesting; // 0xb00
	UW_ButtonCustom_C* B_MakeMeAdmin; // 0xb08
	UW_TabButton_C* B_PetAndHunger; // 0xb10
	UW_TabButton_C* B_Progression; // 0xb18
	UW_TabButton_C* B_Purge; // 0xb20
	UW_TabButton_C* B_RegionalAccessControl; // 0xb28
	UW_TabButton_C* B_Siptah; // 0xb30
	UW_TabButton_C* B_Survival; // 0xb38
	UWidgetSwitcher* CategorySwitcher; // 0xb40
	UW_ButtonNormal_C* CB_AllowBuilding; // 0xb48
	UW_ButtonNormal_C* CB_AllowFamilySharedAccount; // 0xb50
	UW_ButtonNormal_C* CB_AvatarsDisabled; // 0xb58
	UW_ButtonNormal_C* CB_CanDamagePlayerStructures; // 0xb60
	UW_ButtonNormal_C* CB_ChatHasGlobal; // 0xb68
	UW_ButtonNormal_C* CB_ContainersIgnoreOwnership; // 0xb70
	UW_ButtonNormal_C* CB_DisableBuildingAbandonment; // 0xb78
	UW_ButtonNormal_C* CB_DisableBuildingDuringTimeRestrictedPVP; // 0xb80
	UW_ButtonNormal_C* CB_DisableLandclaimNotifications; // 0xb88
	UW_ButtonNormal_C* CB_DisableThrallDecay; // 0xb90
	UW_ButtonNormal_C* CB_DropEquipmentOnDeath; // 0xb98
	UW_ButtonNormal_C* CB_DynamicBuildingDamage; // 0xba0
	UW_ButtonNormal_C* CB_ElderThingsEnabled; // 0xba8
	UW_ButtonNormal_C* CB_EnableAutoFacingOnAttack; // 0xbb0
	UW_ButtonNormal_C* CB_EnableCatchUpTime; // 0xbb8
	UW_ButtonNormal_C* CB_EnableClanMarkers; // 0xbc0
	UW_ButtonNormal_C* CB_EnablePurge; // 0xbc8
	UW_ButtonNormal_C* CB_EnableSandStorm; // 0xbd0
	UW_ButtonNormal_C* CB_EnableStorm; // 0xbd8
	UW_ButtonNormal_C* CB_EnableTargetLock; // 0xbe0
	UW_ButtonNormal_C* CB_EnableWhitelist; // 0xbe8
	UW_ButtonNormal_C* CB_EverybodyCanLootCorpse; // 0xbf0
	UW_ButtonNormal_C* CB_IsBattlEyeEnabled; // 0xbf8
	UW_ButtonNormal_C* CB_IsLoadErrorsFatal; // 0xc00
	UW_ButtonNormal_C* CB_LogoutCharactersRemainInTheWorld; // 0xc08
	UW_ButtonNormal_C* CB_NoOwnership; // 0xc10
	UW_ButtonNormal_C* CB_PurgeRestrictToTime; // 0xc18
	UW_ButtonNormal_C* CB_PVPBuildingDamageFridayEnabled; // 0xc20
	UW_ButtonNormal_C* CB_PVPBuildingDamageMondayEnabled; // 0xc28
	UW_ButtonNormal_C* CB_PVPBuildingDamageSaturdayEnabled; // 0xc30
	UW_ButtonNormal_C* CB_PVPBuildingDamageSundayEnabled; // 0xc38
	UW_ButtonNormal_C* CB_PVPBuildingDamageThursdayEnabled; // 0xc40
	UW_ButtonNormal_C* CB_PVPBuildingDamageTuesdayEnabled; // 0xc48
	UW_ButtonNormal_C* CB_PVPBuildingDamageWednesdayEnabled; // 0xc50
	UW_ButtonNormal_C* CB_PVPEnabled; // 0xc58
	UW_ButtonNormal_C* CB_PVPFridayEnabled; // 0xc60
	UW_ButtonNormal_C* CB_PVPMondayEnabled; // 0xc68
	UW_ButtonNormal_C* CB_PVPRestrictToTime; // 0xc70
	UW_ButtonNormal_C* CB_PVPSaturdayEnabled; // 0xc78
	UW_ButtonNormal_C* CB_PVPSundayEnabled; // 0xc80
	UW_ButtonNormal_C* CB_PVPThursdayEnabled; // 0xc88
	UW_ButtonNormal_C* CB_PVPTuesdayEnabled; // 0xc90
	UW_ButtonNormal_C* CB_PVPWednesdayEnabled; // 0xc98
	UW_ButtonNormal_C* CB_RegionAllowAfrica; // 0xca0
	UW_ButtonNormal_C* CB_RegionAllowAsia; // 0xca8
	UW_ButtonNormal_C* CB_RegionAllowCentralEurope; // 0xcb0
	UW_ButtonNormal_C* CB_RegionAllowEasternEurope; // 0xcb8
	UW_ButtonNormal_C* CB_RegionAllowNorthAmerica; // 0xcc0
	UW_ButtonNormal_C* CB_RegionAllowOceania; // 0xcc8
	UW_ButtonNormal_C* CB_RegionAllowSouthAmerica; // 0xcd0
	UW_ButtonNormal_C* CB_RegionAllowWesternEurope; // 0xcd8
	UW_ButtonNormal_C* CB_SiegeElderThingMapMarkers; // 0xce0
	UW_ButtonNormal_C* CB_SiegeElderThingsEnabled; // 0xce8
	UW_ButtonNormal_C* CB_StormBuildingAllowed; // 0xcf0
	UW_ButtonNormal_C* CB_StormBuildingDamageEnabled; // 0xcf8
	UW_ButtonNormal_C* CB_StormMapBlocker; // 0xd00
	UW_ButtonNormal_C* CB_TimeRestrictAvatarSummoning; // 0xd08
	UW_ButtonNormal_C* CB_TimeRestrictPVPBuildingDamage; // 0xd10
	UW_FCComboBoxString_C* CBS_Community; // 0xd18
	UW_FCComboBoxString_C* CBS_EventLogCauserPrivacy; // 0xd20
	UW_FCComboBoxString_C* CBS_MapName; // 0xd28
	UW_FCComboBoxString_C* CBS_MaxNudity; // 0xd30
	UW_FCComboBoxString_C* CBS_ServerVoiceChat; // 0xd38
	UGridPanel* DifficultyPresets; // 0xd40
	UW_FCEditableTextBlock_C* ETXT_AdminPW; // 0xd48
	UW_FCMultiLineEditableTextBox_C* ETXT_MOTD; // 0xd50
	UW_FCEditableTextBlock_C* ETXT_RegionBlockList; // 0xd58
	UW_FCEditableTextBlock_C* ETXT_ServerPW; // 0xd60
	UW_EditableLabeledSlider_C* FeedBoxRangeMultiplier; // 0xd68
	UGridPanel* GRID_Abandonment; // 0xd70
	UGridPanel* GRID_CHAT; // 0xd78
	UGridPanel* Grid_Combat; // 0xd80
	UGridPanel* GRID_Crafting; // 0xd88
	UGridPanel* Grid_DAY_NIGHT_Cycle; // 0xd90
	UGridPanel* Grid_GENERAL; // 0xd98
	UGridPanel* Grid_HARVESTING; // 0xda0
	UGridPanel* Grid_Progression; // 0xda8
	UGridPanel* GRID_PurgeOptions; // 0xdb0
	UGridPanel* Grid_PurgeTimeRestriction; // 0xdb8
	UGridPanel* Grid_PVPbuildingDamage; // 0xdc0
	UGridPanel* Grid_PVPtime-restrict; // 0xdc8
	UGridPanel* Grid_REGIONAL_ACCESS_CONTROL; // 0xdd0
	UGridPanel* Grid_RestrictAvatarSummoningTime; // 0xdd8
	UGridPanel* Grid_SURVIVAL; // 0xde0
	UGridPanel* GridPanel_4; // 0xde8
	UImage* Image_1; // 0xdf0
	UImage* Image_2; // 0xdf8
	UImage* Image_10; // 0xe00
	UImage* Image_12; // 0xe08
	UOverlay* MapNameContainer; // 0xe10
	UOverlay* MapNameLabel; // 0xe18
	UOverlay* Overlay_24; // 0xe20
	UOverlay* Overlay_60; // 0xe28
	UW_EditableLabeledSlider_C* S_AltarModuleActiveTimeMultiplier; // 0xe30
	UW_EditableLabeledSlider_C* S_AmbientElderThingRespawnRate; // 0xe38
	UW_EditableLabeledSlider_C* S_AvatarLifeTime; // 0xe40
	UW_EditableLabeledSlider_C* S_BuildingDamageMultiplier; // 0xe48
	UW_EditableLabeledSlider_C* S_BuildingDecayTimeMultiplier; // 0xe50
	UW_EditableLabeledSlider_C* S_ChatLocalRadius; // 0xe58
	UW_EditableLabeledSlider_C* S_ChatMaxMessageLength; // 0xe60
	UW_EditableLabeledSlider_C* S_ClanMaxSize; // 0xe68
	UW_EditableLabeledSlider_C* S_ClanPurgeTrigger; // 0xe70
	UW_EditableLabeledSlider_C* S_ClanScoreUpateFrequency; // 0xe78
	UW_EditableLabeledSlider_C* S_ClientCatchUpTime; // 0xe80
	UW_EditableLabeledSlider_C* S_CoopTetheringLimit; // 0xe88
	UW_EditableLabeledSlider_C* S_CraftingCostMultiplier; // 0xe90
	UW_EditableLabeledSlider_C* S_DawnDuskTimeSpeedScale; // 0xe98
	UW_EditableLabeledSlider_C* S_DayCycleSpeedScale; // 0xea0
	UW_EditableLabeledSlider_C* S_DayTimeSpeedScale; // 0xea8
	UW_EditableLabeledSlider_C* S_DurabilityMultiplier; // 0xeb0
	UW_EditableLabeledSlider_C* S_DynamicBuildingDamagePeriod; // 0xeb8
	UW_EditableLabeledSlider_C* S_ElderThingsIdleLifespan; // 0xec0
	UW_EditableLabeledSlider_C* S_ElderThingSiegeBuildingSizeMultiplier; // 0xec8
	UW_EditableLabeledSlider_C* S_ElderThingSiegeDamageMultiplier; // 0xed0
	UW_EditableLabeledSlider_C* S_ElderThingSpawnRate; // 0xed8
	UW_EditableLabeledSlider_C* S_FriendlyFireDamageMultiplier; // 0xee0
	UW_EditableLabeledSlider_C* S_FuelBurnTimeMultiplier; // 0xee8
	UW_EditableLabeledSlider_C* S_HarvestAmountMultiplier; // 0xef0
	UW_EditableLabeledSlider_C* S_InitialPurgeDelay; // 0xef8
	UW_EditableLabeledSlider_C* S_ItemConvertionMultiplier; // 0xf00
	UW_EditableLabeledSlider_C* S_ItemSpoilRateScale; // 0xf08
	UW_EditableLabeledSlider_C* S_LandClaimRadiusMultiplier; // 0xf10
	UW_EditableLabeledSlider_C* S_MaxAmbientElderThings; // 0xf18
	UW_EditableLabeledSlider_C* S_MaxAmbushElderThings; // 0xf20
	UW_EditableLabeledSlider_C* S_MaxSiegeElderThings; // 0xf28
	UW_EditableLabeledSlider_C* S_MinimumBuildingSizeToBeSieged; // 0xf30
	UW_EditableLabeledSlider_C* S_MinimumStormDamageBuildingPieces; // 0xf38
	UW_EditableLabeledSlider_C* S_MinPurgeOnlinePlayers; // 0xf40
	UW_EditableLabeledSlider_C* S_NightTimeSpeedScale; // 0xf48
	UW_EditableLabeledSlider_C* S_NPCDamageMultiplier; // 0xf50
	UW_EditableLabeledSlider_C* S_NPCDamageTakenMultiplier; // 0xf58
	UW_EditableLabeledSlider_C* S_NPCRespawnMultiplier; // 0xf60
	UW_EditableLabeledSlider_C* S_PlayerActiveHungerMultiplier; // 0xf68
	UW_EditableLabeledSlider_C* S_PlayerActiveThirstMultiplier; // 0xf70
	UW_EditableLabeledSlider_C* S_PlayerCorruptionGainMultiplier; // 0xf78
	UW_EditableLabeledSlider_C* S_PlayerDamageMultiplier; // 0xf80
	UW_EditableLabeledSlider_C* S_PlayerDamageTakenMultiplier; // 0xf88
	UW_EditableLabeledSlider_C* S_PlayerIdleHungerMultiplier; // 0xf90
	UW_EditableLabeledSlider_C* S_PlayerIdleThirstMultiplier; // 0xf98
	UW_EditableLabeledSlider_C* S_PlayerXPCraftMultiplier; // 0xfa0
	UW_EditableLabeledSlider_C* S_PlayerXPHarvestMultiplier; // 0xfa8
	UW_EditableLabeledSlider_C* S_PlayerXPKillMultiplier; // 0xfb0
	UW_EditableLabeledSlider_C* S_PlayerXPRateMultiplier; // 0xfb8
	UW_EditableLabeledSlider_C* S_PlayerXPTimeMultiplier; // 0xfc0
	UW_EditableLabeledSlider_C* S_PurgeDelay; // 0xfc8
	UW_EditableLabeledSlider_C* S_PurgeDuration; // 0xfd0
	UW_EditableLabeledSlider_C* S_PurgeLevel; // 0xfd8
	UW_EditableLabeledSlider_C* S_PurgePreparationTime; // 0xfe0
	UW_EditableLabeledSlider_C* S_ResourceRespawnSpeedMultiplier; // 0xfe8
	UW_EditableLabeledSlider_C* S_SiegeElderThingRespawnRate; // 0xff0
	UW_EditableLabeledSlider_C* S_StaminaCostMultiplier; // 0xff8
	UW_EditableLabeledSlider_C* S_StormAccumulationTime; // 0x1000
	UW_EditableLabeledSlider_C* S_StormBuildingDamageMultiplier; // 0x1008
	UW_EditableLabeledSlider_C* S_StormBuildingDamageRateMultiplier; // 0x1010
	UW_EditableLabeledSlider_C* S_StormCooldown; // 0x1018
	UW_EditableLabeledSlider_C* S_StormDissipationTime; // 0x1020
	UW_EditableLabeledSlider_C* S_StormDuration; // 0x1028
	UW_EditableLabeledSlider_C* S_StormEnduranceDrainMultiplier; // 0x1030
	UW_EditableLabeledSlider_C* S_StormMinimumOnlinePlayers; // 0x1038
	UW_EditableLabeledSlider_C* S_SurgeDespawnTimer; // 0x1040
	UW_EditableLabeledSlider_C* S_SurgeSacrificeRequirementMultiplier; // 0x1048
	UW_EditableLabeledSlider_C* S_ThrallConversionMultiplier; // 0x1050
	UW_EditableLabeledSlider_C* S_ThrallCorruptionRemovalMultiplier; // 0x1058
	UW_EditableLabeledSlider_C* S_ThrallDamageToNPCsMultiplier; // 0x1060
	UW_EditableLabeledSlider_C* S_ThrallDamageToPlayersMultiplier; // 0x1068
	UW_EditableLabeledSlider_C* S_ThrallDecayTime; // 0x1070
	UW_EditableLabeledSlider_C* S_UnconsciousTimeSeconds; // 0x1078
	UW_EditableLabeledSlider_C* S_VaultRefreshDeviation; // 0x1080
	UW_EditableLabeledSlider_C* S_VaultRefreshTime; // 0x1088
	UW_EditableLabeledSlider_C* S_VocalVisibilityDurationInMinutes; // 0x1090
	UScrollBox* SB_MainScrollBox; // 0x1098
	UBorder* SideMenu; // 0x10a0
	UGridPanel* StormGridPanel; // 0x10a8
	UTextBlock* TextBlock_4; // 0x10b0
	UTextBlock* TextBlock_37; // 0x10b8
	UW_TimeInputBox_C* TIME_AvatarSummoningRestrictionWeekdayEnd; // 0x10c0
	UW_TimeInputBox_C* TIME_AvatarSummoningRestrictionWeekdayStart; // 0x10c8
	UW_TimeInputBox_C* TIME_AvatarSummoningRestrictionWeekendEnd; // 0x10d0
	UW_TimeInputBox_C* TIME_AvatarSummoningRestrictionWeekendStart; // 0x10d8
	UW_TimeInputBox_C* TIME_PurgeRestrictionWeekdayEnd; // 0x10e0
	UW_TimeInputBox_C* TIME_PurgeRestrictionWeekdayStart; // 0x10e8
	UW_TimeInputBox_C* TIME_PurgeRestrictionWeekendEnd; // 0x10f0
	UW_TimeInputBox_C* TIME_PurgeRestrictionWeekendStart; // 0x10f8
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionFridayEnd; // 0x1100
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionFridayStart; // 0x1108
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionMondayEnd; // 0x1110
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionMondayStart; // 0x1118
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionSaturdayEnd; // 0x1120
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionSaturdayStart; // 0x1128
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionSundayEnd; // 0x1130
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionSundayStart; // 0x1138
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionThursdayEnd; // 0x1140
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionThursdayStart; // 0x1148
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionTuesdayEnd; // 0x1150
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionTuesdayStart; // 0x1158
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionWednesdayEnd; // 0x1160
	UW_TimeInputBox_C* TIME_PVPBuildingDamageRestrictionWednesdayStart; // 0x1168
	UW_TimeInputBox_C* TIME_PVPRestrictionFridayEnd; // 0x1170
	UW_TimeInputBox_C* TIME_PVPRestrictionFridayStart; // 0x1178
	UW_TimeInputBox_C* TIME_PVPRestrictionMondayEnd; // 0x1180
	UW_TimeInputBox_C* TIME_PVPRestrictionMondayStart; // 0x1188
	UW_TimeInputBox_C* TIME_PVPRestrictionSaturdayEnd; // 0x1190
	UW_TimeInputBox_C* TIME_PVPRestrictionSaturdayStart; // 0x1198
	UW_TimeInputBox_C* TIME_PVPRestrictionSundayEnd; // 0x11a0
	UW_TimeInputBox_C* TIME_PVPRestrictionSundayStart; // 0x11a8
	UW_TimeInputBox_C* TIME_PVPRestrictionThursdayEnd; // 0x11b0
	UW_TimeInputBox_C* TIME_PVPRestrictionThursdayStart; // 0x11b8
	UW_TimeInputBox_C* TIME_PVPRestrictionTuesdayEnd; // 0x11c0
	UW_TimeInputBox_C* TIME_PVPRestrictionTuesdayStart; // 0x11c8
	UW_TimeInputBox_C* TIME_PVPRestrictionWednesdayEnd; // 0x11d0
	UW_TimeInputBox_C* TIME_PVPRestrictionWednesdayStart; // 0x11d8
	UW_TimeInputBox_C* TIME_StormWeekdayEnd; // 0x11e0
	UW_TimeInputBox_C* TIME_StormWeekdayStart; // 0x11e8
	UW_TimeInputBox_C* TIME_StormWeekendEnd; // 0x11f0
	UW_TimeInputBox_C* TIME_StormWeekendStart; // 0x11f8
	UTextBlock* TXT_AvatarLifeTime; // 0x1200
	UTextBlock* TXT_CategoryAbandonment; // 0x1208
	UTextBlock* TXT_CategoryChat; // 0x1210
	UTextBlock* TXT_CategoryCombat; // 0x1218
	UTextBlock* TXT_CategoryCrafting; // 0x1220
	UTextBlock* TXT_CategoryDayNightCycle; // 0x1228
	UTextBlock* TXT_CategoryGeneral; // 0x1230
	UTextBlock* TXT_CategoryHarvesting; // 0x1238
	UTextBlock* TXT_CategoryPresets; // 0x1240
	UTextBlock* TXT_CategoryProgression; // 0x1248
	UTextBlock* TXT_CategoryRegionAccessControl; // 0x1250
	UTextBlock* TXT_CategorySurvival; // 0x1258
	UTextBlock* TXT_CoopTetheringLimit; // 0x1260
	UTextBlock* TXT_IsBattlEyeEnabled; // 0x1268
	UTextBlock* TXT_MapName; // 0x1270
	UTextBlock* TXT_MaxNudity; // 0x1278
	UTextBlock* TXT_PurgeTitle; // 0x1280
	UTextBlock* TXT_ServerLocalTime; // 0x1288
	UW_ServerSettingsPresets_C* W_ServerSettingsPresets; // 0x1290
	UW_TooltipOverlay_C* W_TooltipOverlay; // 0x1298
	UW_TooltipOverlay_C* W_TooltipOverlay_1; // 0x12a0
	UW_TooltipOverlay_C* W_TooltipOverlay_2; // 0x12a8
	UW_TooltipOverlay_C* W_TooltipOverlay_3; // 0x12b0
	UW_TooltipOverlay_C* W_TooltipOverlay_4; // 0x12b8
	UW_TooltipOverlay_C* W_TooltipOverlay_5; // 0x12c0
	UW_TooltipOverlay_C* W_TooltipOverlay_6; // 0x12c8
	UW_TooltipOverlay_C* W_TooltipOverlay_7; // 0x12d0
	UW_TooltipOverlay_C* W_TooltipOverlay_8; // 0x12d8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_15; // 0x12e0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_69; // 0x12e8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_70; // 0x12f0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_71; // 0x12f8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_80; // 0x1300
	UW_TooltipOverlay_C* W_TooltipOverlay_C_81; // 0x1308
	UW_TooltipOverlay_C* W_TooltipOverlay_C_82; // 0x1310
	UW_TooltipOverlay_C* W_TooltipOverlay_C_83; // 0x1318
	UW_TooltipOverlay_C* W_TooltipOverlay_C_84; // 0x1320
	UW_TooltipOverlay_C* W_TooltipOverlay_C_85; // 0x1328
	UW_TooltipOverlay_C* W_TooltipOverlay_C_86; // 0x1330
	UW_TooltipOverlay_C* W_TooltipOverlay_C_87; // 0x1338
	UW_TooltipOverlay_C* W_TooltipOverlay_C_88; // 0x1340
	UW_TooltipOverlay_C* W_TooltipOverlay_C_89; // 0x1348
	UW_TooltipOverlay_C* W_TooltipOverlay_C_90; // 0x1350
	UW_TooltipOverlay_C* W_TooltipOverlay_C_92; // 0x1358
	UW_TooltipOverlay_C* W_TooltipOverlay_C_94; // 0x1360
	UW_TooltipOverlay_C* W_TooltipOverlay_C_95; // 0x1368
	UW_TooltipOverlay_C* W_TooltipOverlay_C_96; // 0x1370
	UW_TooltipOverlay_C* W_TooltipOverlay_C_97; // 0x1378
	UW_TooltipOverlay_C* W_TooltipOverlay_C_98; // 0x1380
	UW_TooltipOverlay_C* W_TooltipOverlay_C_99; // 0x1388
	UW_TooltipOverlay_C* W_TooltipOverlay_C_100; // 0x1390
	UW_TooltipOverlay_C* W_TooltipOverlay_C_101; // 0x1398
	UW_TooltipOverlay_C* W_TooltipOverlay_C_102; // 0x13a0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_103; // 0x13a8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_104; // 0x13b0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_105; // 0x13b8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_106; // 0x13c0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_107; // 0x13c8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_108; // 0x13d0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_109; // 0x13d8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_110; // 0x13e0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_111; // 0x13e8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_113; // 0x13f0
	UW_TooltipOverlay_C* W_TooltipOverlay_C_114; // 0x13f8
	UW_TooltipOverlay_C* W_TooltipOverlay_C_115; // 0x1400
	TArray<FString> CommunityOptions; // 0x1408
	TArray<FString> RegionOpstions; // 0x1418
	TArray<FString> nudityOptions; // 0x1428
	FString ServerDayName; // 0x1438
	TScriptInterface<BlueprintGeneratedClass> W_HostLocalParent; // 0x1448
	UFCButton* SelectedCategory; // 0x1458
	TArray<UWidget*> VisibleWidgets; // 0x1460
};

struct UParticleModuleColorBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct ULocalPlayerNameCallProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
};

struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	char FocusPriority; // 0x98
};

struct APlayerController : AController {
	UPlayer* Player; // 0x438
	APawn* AcknowledgedPawn; // 0x448
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x450
	AHUD* MyHUD; // 0x460
	APlayerCameraManager* PlayerCameraManager; // 0x468
	APlayerCameraManager* PlayerCameraManagerClass; // 0x470
	bool bAutoManageActiveCameraTarget; // 0x478
	FRotator TargetViewRotation; // 0x47c
	float SmoothTargetViewRotationSpeed; // 0x494
	TArray<AActor*> HiddenActors; // 0x498
	float LastSpectatorStateSynchTime; // 0x4a8
	FVector LastSpectatorSyncLocation; // 0x4ac
	FRotator LastSpectatorSyncRotation; // 0x4b8
	int32_t ClientCap; // 0x4c4
	UCheatManager* CheatManager; // 0x4c8
	UCheatManager* CheatClass; // 0x4d0
	UPlayerInput* PlayerInput; // 0x4d8
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x4e0
	char bPlayerIsWaiting : 1; // 0x580
	char NetPlayerIndex; // 0x584
	UNetConnection* PendingSwapConnection; // 0x588
	UNetConnection* NetConnection; // 0x590
	float InputYawScale; // 0x5a8
	float InputPitchScale; // 0x5ac
	float InputRollScale; // 0x5b0
	char bShowMouseCursor : 1; // 0x5b4
	char bEnableClickEvents : 1; // 0x5b4
	char bEnableTouchEvents : 1; // 0x5b4
	char bEnableMouseOverEvents : 1; // 0x5b4
	char bEnableTouchOverEvents : 1; // 0x5b4
	char bForceFeedbackEnabled : 1; // 0x5b4
	char bKeepPawnAliveOnControllerDeath : 1; // 0x5b4
	TArray<FKey> ClickEventKeys; // 0x5b8
	EMouseCursor DefaultMouseCursor; // 0x5c8
	EMouseCursor CurrentMouseCursor; // 0x5c9
	ECollisionChannel DefaultClickTraceChannel; // 0x5ca
	ECollisionChannel CurrentClickTraceChannel; // 0x5cb
	float HitResultTraceDistance; // 0x5cc
	UInputComponent* InactiveStateInputComponent; // 0x650
	UTouchInterface* CurrentTouchInterface; // 0x670
	ASpectatorPawn* SpectatorPawn; // 0x6b8
	FVector SpawnLocation; // 0x6c0
	bool bIsLocalPlayerController; // 0x6d0
	uint16_t SeamlessTravelCount; // 0x6d2
	uint16_t LastCompletedSeamlessTravelCount; // 0x6d4
};

struct UCableComponent : UMeshComponent {
	bool bAttachStart; // 0x7c8
	bool bAttachEnd; // 0x7c9
	FComponentReference AttachEndTo; // 0x7d0
	FName AttachEndToSocketName; // 0x7e8
	FVector EndLocation; // 0x7f0
	float CableLength; // 0x7fc
	int32_t NumSegments; // 0x800
	float SubstepTime; // 0x804
	int32_t SolverIterations; // 0x808
	bool bEnableStiffness; // 0x80c
	bool bEnableCollision; // 0x80d
	float CollisionFriction; // 0x810
	FVector CableForce; // 0x814
	float CableGravityScale; // 0x820
	float CableWidth; // 0x824
	int32_t NumSides; // 0x828
	float TileMaterial; // 0x82c
};

struct AStaticWaypoint : AActor {
	AStaticWaypoint* NextWaypoint; // 0x3d0
	USceneComponent* Root; // 0x3d8
};

struct UHostLocalBase : UWindowRoot {
	bool m_MapLocked; // 0x398
	UTexture2D* TextureExiledCivilized; // 0x3a0
	UTexture2D* TextureExiledDecadent; // 0x3c0
	UTexture2D* TextureExiledBarbaric; // 0x3e0
	UTexture2D* TextureSiptahCivilized; // 0x400
	UTexture2D* TextureSiptahDecadent; // 0x420
	UTexture2D* TextureSiptahBarbaric; // 0x440
	AServerSettings* ServerSettingsClass; // 0x508
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x6c8
};

struct UDemoPendingNetGame : UPendingNetGame {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0xd0
	FVector GoalLocation; // 0xd8
	float AcceptableRadius; // 0xe4
	UNavigationQueryFilter* FilterClass; // 0xe8
	char bAllowStrafe : 1; // 0xf0
	char bFinishOnOverlap : 1; // 0xf0
	char bUsePathfinding : 1; // 0xf0
	char bAllowPartialPath : 1; // 0xf0
	char bProjectGoalToNavigation : 1; // 0xf0
	char bUpdatePathToGoal : 1; // 0xf0
	char bAbortChildActionOnPathChange : 1; // 0xf0
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x6e0
	float CapsuleRadius; // 0x6e4
	float CapsuleHeight; // 0x6e8
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	float ResetFloat; // 0x40
};

struct UBattleStandardZoneComponent : UBoxComponent {
	FScriptMulticastDelegate OnSetBattleZoneVisualization; // 0x6f0
	float NearbyZoneVisualizationRadius; // 0x700
	TArray<AConanCharacter*> m_RegisteredCharacters; // 0x708
	TArray<UBattleStandardZoneComponent*> m_VisualizedComponents; // 0x718
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UMaterialExpressionDistanceToNearestSurface : UMaterialExpression {
	FExpressionInput Position; // 0x60
};

struct UAnimCompress_LeastDestructive : UAnimCompress {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UParticleModuleCollisionBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x70
};

struct UAISense_Damage : UAISense {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x120
};

struct UMouseBlockWindowBase : UWindowRoot {
	USoundBase* dropItemSound; // 0x398
};

struct UPlayFabCloudScriptAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x150
	UPlayFabJsonObject* RequestJsonObj; // 0x158
	UPlayFabJsonObject* ResponseJsonObj; // 0x160
};

struct USmokeTestCommandlet : UCommandlet {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x80
	FAIDataProviderFloatValue FloatValueMax; // 0xb0
	EEnvTestScoreEquation ScoringEquation; // 0xe1
	EEnvQueryTestClamping ClampMinType; // 0xe2
	EEnvQueryTestClamping ClampMaxType; // 0xe3
	EEQSNormalizationType NormalizationType; // 0xe4
	FAIDataProviderFloatValue ScoreClampMin; // 0xe8
	FAIDataProviderFloatValue ScoreClampMax; // 0x118
	FAIDataProviderFloatValue ScoringFactor; // 0x148
	FAIDataProviderFloatValue ReferenceValue; // 0x178
	bool bDefineReferenceValue; // 0x1a8
	char bWorkOnFloatValues : 1; // 0x1b8
};

struct ACharacterCreationActorBase : AActor {
	FScriptMulticastDelegate OnCharacterSelected; // 0x3d0
	USpotLightComponent* m_Spotlight; // 0x3e0
	UAudioComponent* m_Voice; // 0x3e8
	float MaxIntensity; // 0x3f0
	float DefaultIntensity; // 0x3f4
	USkeletalMeshComponent* m_MeshComponents[0xa]; // 0x460
	USkeletalMeshComponent* m_CharacterBase; // 0x4b0
};

struct USoundNodeWavePlayer : USoundNodeAssetReferencer {
	USoundWave* SoundWaveAssetPtr; // 0x38
	USoundWave* SoundWave; // 0x58
	char bLooping : 1; // 0x60
};

struct UMaterialInstance : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x70
	UMaterialInterface* Parent; // 0x78
	char bHasStaticPermutationResource : 1; // 0x80
	char bOverrideSubsurfaceProfile : 1; // 0x80
	TArray<FFontParameterValue> FontParameterValues; // 0x88
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x98
	TArray<FTextureParameterValue> TextureParameterValues; // 0xa8
	TArray<FGraniteTextureParameterValue> GraniteTextureParameterValues; // 0xb8
	TArray<FString> GraniteErrors; // 0xc8
	TArray<FVectorParameterValue> VectorParameterValues; // 0xd8
	bool bOverrideBaseProperties; // 0xe8
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xec
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	TArray<FPartyReservation> Reservations; // 0x50
};

struct ULocationServicesImpl : UObject {
	FScriptMulticastDelegate OnLocationChanged; // 0x28
};

struct ABP_ServerSettings_C : AServerSettings {
	FPointerToUberGraphFrame UberGraphFrame; // 0x930
	float PlayerWaterMultiplier; // 0x938
	float PlayerIdleThirstMultiplier; // 0x93c
	float PlayerActiveThirstMultiplier; // 0x940
	float PlayerOfflineThirstMultiplier; // 0x944
	float PlayerIdleHungerMultiplier; // 0x948
	float PlayerActiveHungerMultiplier; // 0x94c
	float PlayerOfflineHungerMultiplier; // 0x950
	float ShieldDurabilityMultiplier; // 0x954
	float PlayerKnockbackMultiplier; // 0x958
	float NPCKnockbackMultiplier; // 0x95c
	float StructureDamageMultiplier; // 0x960
	float StructureHealthMultiplier; // 0x964
	float NPCRespawnMultiplier; // 0x968
	float NPCHealthMultiplier; // 0x96c
	float PlayerDamageMultiplier; // 0x970
	float PlayerDamageTakenMultiplier; // 0x974
	float MinionDamageMultiplier; // 0x978
	float MinionDamageTakenMultiplier; // 0x97c
	float NPCDamageMultiplier; // 0x980
	float NPCDamageTakenMultiplier; // 0x984
	float PlayerEncumbranceMultiplier; // 0x988
	float PlayerEncumbrancePenaltyMultiplier; // 0x98c
	float PlayerMovementSpeedScale; // 0x990
	float PlayerStaminaCostSprintMultiplier; // 0x994
	float PlayerSprintSpeedScale; // 0x998
	float PlayerStaminaCostMultiplier; // 0x99c
	float PlayerHealthRegenSpeedScale; // 0x9a0
	float PlayerXPRateMultiplier; // 0x9a4
	float PlayerXPKillMultiplier; // 0x9a8
	float PlayerXPHarvestMultiplier; // 0x9ac
	float PlayerXPCraftMultiplier; // 0x9b0
	float PlayerXPTimeMultiplier; // 0x9b4
	bool DogsOfTheDesertSpawnWithDogs; // 0x9b8
	bool CrossDesertOnce; // 0x9b9
	float WeaponEffectBoundsShorteningFraction; // 0x9bc
	int32_t OldVersion; // 0x9c0
	int32_t NewVersion; // 0x9c4
	float ThrallExclusionRadius; // 0x9c8
	float MaxAggroRange; // 0x9cc
	float FriendlyFireDamageMultiplier; // 0x9d0
	bool CampsIgnoreLandclaim; // 0x9d4
	float AvatarDomeDurationMultiplier; // 0x9d8
	float AvatarDomeDamageMultiplier; // 0x9dc
	float DodgeStaminaCost; // 0x9e0
	float NPCMaxSpawnCapMultiplier; // 0x9e4
	float AttackRotationMultiplier; // 0x9e8
	bool EnableThrallHungerSystem; // 0x9ec
	float PlayerMovementAccelerationMultiplier; // 0x9f0
	float SigilDamageMultiplier; // 0x9f4
	float SigilPercentageToKeep; // 0x9f8
	float SigilPercentageToDrop; // 0x9fc
	float WildSurgeDuration; // 0xa00
	float BlockStaminaMitigationMultiplier; // 0xa04
	float BlockHealthMitigationMultiplier; // 0xa08
	float DodgeInvulnerabilityDuration; // 0xa0c
	float StaminaLightArmorNoLoadRegenMultiplier; // 0xa10
	float StaminaLightArmorLightLoadRegenMultiplier; // 0xa14
	float StaminaLightArmorMediumLoadRegenMultiplier; // 0xa18
	float StaminaLightArmorHeavyLoadRegenMultiplier; // 0xa1c
	float StaminaLightArmorOverLoadRegenMultiplier; // 0xa20
	float StaminaMediumArmorNoLoadRegenMultiplier; // 0xa24
	float StaminaMediumArmorLightLoadRegenMultiplier; // 0xa28
	float StaminaMediumArmorMediumLoadRegenMultiplier; // 0xa2c
	float StaminaMediumArmorHeavyLoadRegenMultiplier; // 0xa30
	float StaminaMediumArmorOverLoadRegenMultiplier; // 0xa34
	float StaminaHeavyArmorNoLoadRegenMultiplier; // 0xa38
	float StaminaHeavyArmorLightLoadRegenMultiplier; // 0xa3c
	float StaminaHeavyArmorMediumLoadRegenMultiplier; // 0xa40
	float StaminaHeavyArmorHeavyLoadRegenMultiplier; // 0xa44
	float StaminaHeavyArmorOverLoadRegenMultiplier; // 0xa48
	bool CampCleanupDestroyFullBuilding; // 0xa4c
};

struct UInterpToMovementComponent : UMovementComponent {
	float Duration; // 0x150
	char bPauseOnImpact : 1; // 0x154
	EInterpToBehaviourType BehaviourType; // 0x158
	char bForceSubStepping : 1; // 0x15c
	FScriptMulticastDelegate OnInterpToReverse; // 0x160
	FScriptMulticastDelegate OnInterpToStop; // 0x170
	FScriptMulticastDelegate OnWaitBeginDelegate; // 0x180
	FScriptMulticastDelegate OnWaitEndDelegate; // 0x190
	FScriptMulticastDelegate OnResetDelegate; // 0x1a0
	float MaxSimulationTimeStep; // 0x1b0
	int32_t MaxSimulationIterations; // 0x1b4
	TArray<FInterpControlPoint> ControlPoints; // 0x1b8
};

struct USceneCaptureComponentSand : USceneCaptureComponentImprints {
	UTextureRenderTarget2D* FluidColourMap; // 0x460
	UTextureRenderTarget2D* FluidNormalMap; // 0x468
	UTexture* ForcesTexture; // 0x470
	float ForcesTextureTiling; // 0x478
	float VorticityAmount; // 0x47c
	float ColourDecay; // 0x480
	float DensityDecay; // 0x484
	float VelocityDecay; // 0x488
	char Wrapping : 1; // 0x48c
	char OutputNormals : 1; // 0x48c
	char OutputColour : 1; // 0x48c
	char UseUniqueTextureSet : 1; // 0x48c
	FVector2D WindA; // 0x490
	FVector2D WindB; // 0x498
	FColor InjectionColourA; // 0x4a0
	float ColourScaleA; // 0x4a4
	FColor InjectionColourB; // 0x4a8
	float ColourScaleB; // 0x4ac
	float PressureScaleA; // 0x4b0
	float PressureScaleB; // 0x4b4
	float WindScale; // 0x4b8
	float WindGustFactorA; // 0x4bc
	float WindGustFactorB; // 0x4c0
};

struct UNiagaraEffect : UObject {
	TArray<UNiagaraEmitterProperties*> EmitterProps; // 0x28
};

struct USubSettingsMaster : URootWidget {
	bool ShowRestoreDefaults; // 0x318
	bool ShowClearKeyBinding; // 0x319
	bool ShowScroll; // 0x31a
	bool IsDirty; // 0x31b
};

struct UTextLayoutWidget : UWidget {
	FShapedTextOptions ShapedTextOptions; // 0x118
	ETextJustify Justification; // 0x120
	bool AutoWrapText; // 0x121
	float WrapTextAt; // 0x124
	ETextWrappingPolicy WrappingPolicy; // 0x128
	FMargin Margin; // 0x12c
	float LineHeightPercentage; // 0x13c
	int32_t MaxCharacterLimit; // 0x140
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x3d0
};

struct ATriggerSphere : ATriggerBase {
	UShapeComponent* CollisionComponent; // 0x3d0
	UBillboardComponent* SpriteComponent; // 0x3d8
};

struct UBTComposite_Selector : UBTCompositeNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
};

struct UHapticFeedbackEffect_Curve : UHapticFeedbackEffect_Base {
	FHapticFeedbackDetails_Curve HapticDetails; // 0x28
};

struct UParticleModuleMeshRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionVector LifeMultiplier; // 0x30
};

struct UBookMark : UObject {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct USessionInviteGame : UWindowRoot {
	UFriendsGame* FriendsWindowBase; // 0x398
	USessionInviteEntry* EntryViewClass; // 0x3a0
	int32_t NumReceivedSessionInvites; // 0x3a8
	int32_t NumSentSessionInvites; // 0x3ac
};

struct UAnimInstance : UObject {
	float DeltaTime; // 0x28
	USkeleton* CurrentSkeleton; // 0x30
	ERootMotionMode RootMotionMode; // 0x38
	bool bRunUpdatesInWorkerThreads; // 0x39
	bool bCanUseParallelUpdateAnimation; // 0x3a
	bool bUseMultiThreadedAnimationUpdate; // 0x3b
	bool bWarnAboutBlueprintUsage; // 0x3c
	FScriptMulticastDelegate OnMontageBlendingOut; // 0x40
	FScriptMulticastDelegate OnMontageStarted; // 0x50
	FScriptMulticastDelegate OnMontageEnded; // 0x60
	FScriptMulticastDelegate OnAllMontageInstancesEnded; // 0x70
	bool bQueueMontageEvents; // 0xe0
	FAnimNotifyQueue NotifyQueue; // 0x110
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x180
};

struct UAnimBlueprint : UBlueprint {
	USkeleton* TargetSkeleton; // 0x198
	TArray<FAnimGroupInfo> Groups; // 0x1a0
	bool bUseMultiThreadedAnimationUpdate; // 0x1b0
	bool bWarnAboutBlueprintUsage; // 0x1b1
};

struct UTextureRenderTargetCube : UTextureRenderTarget {
	int32_t SizeX; // 0xd0
	FLinearColor ClearColor; // 0xd4
	EPixelFormat OverrideFormat; // 0xe4
	char bHDR : 1; // 0xe8
	char bForceLinearGamma : 1; // 0xe8
};

struct UEnemyHealthBar : URootWidget {
	FSlateBrush BorderBoss; // 0x318
	FSlateBrush BorderUniqueThrall; // 0x3a8
};

struct AStaticSpawnPoint : AActor {
	USceneComponent* Root; // 0x3d8
	UNpcSpawnerComponent* OwningSpawnerComponent; // 0x3e0
	UAILODComponent* OptionalAiLodComp; // 0x3e8
};

struct ANPCRegistry : AActor {
	TArray<TScriptInterface<Class>> m_ActiveSpawners; // 0x3d0
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x460
	char bDelayedStart : 1; // 0x468
	int32_t NumSpectators; // 0x46c
	int32_t NumPlayers; // 0x470
	int32_t NumBots; // 0x474
	float MinRespawnDelay; // 0x478
	int32_t NumTravellingPlayers; // 0x47c
	ULocalMessage* EngineMessageClass; // 0x480
	TArray<APlayerState*> InactivePlayerArray; // 0x488
	float InactivePlayerStateLifeSpan; // 0x498
	bool bHandleDedicatedServerReplays; // 0x49c
};

struct APreCullTrianglesVolume : AVolume {
	EBrushType BrushType; // 0x3d0
	FColor BrushColor; // 0x3d4
	int32_t PolyFlags; // 0x3d8
	char bColored : 1; // 0x3dc
	char bSolidWhenSelected : 1; // 0x3dc
	char bPlaceableFromClassBrowser : 1; // 0x3dc
	char bNotForClientOrServer : 1; // 0x3dc
	UModel* Brush; // 0x3e0
	UBrushComponent* BrushComponent; // 0x3e8
	char bInManipulation : 1; // 0x3f0
	TArray<FGeomSelection> SavedSelections; // 0x3f8
};

struct UAnimCompress : UObject {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xf8
	float LOSHearingThreshold; // 0xfc
	float SightRadius; // 0x100
	float SensingInterval; // 0x104
	float HearingMaxSoundAge; // 0x108
	char bEnableSensingUpdates : 1; // 0x10c
	char bOnlySensePlayers : 1; // 0x10c
	char bSeePawns : 1; // 0x10c
	char bHearNoises : 1; // 0x10c
	FScriptMulticastDelegate OnSeePawn; // 0x118
	FScriptMulticastDelegate OnHearNoise; // 0x128
	float PeripheralVisionAngle; // 0x138
	float PeripheralVisionCosine; // 0x13c
};

struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	FProgressBarStyle ProgressBarStyle; // 0x30
};

struct UHotkeyIconPlatforms_C : UHotkeyIconPlatforms {
	TArray<FHotkeyIconPlatform> Platforms; // 0x28
};

struct UBaseMediaSource : UMediaSource {
	FName playerName; // 0x30
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct UCraftingGUIBase : UWindowRoot {
	UExternalInventoryView* ChestInventoryViewClass; // 0x398
	UCraftingStationInventoryView* CraftingStationInventoryViewClass; // 0x3a0
	UCraftingStationInventoryView* DismantlingStationInventoryViewClass; // 0x3a8
	UAnimalPenInventoryView* AnimalPenInventoryViewClass; // 0x3b0
	USiegeWeaponInventoryView* SiegeWeaponInventoryViewClass; // 0x3b8
	UPaperdollPanel* PaperDollViewClass; // 0x3c0
	UUserWidget* PlayerInventoryViewClass; // 0x3c8
	UExternalInventoryView* NPCBackpackInventoryViewClass; // 0x3d0
	UPetInventoryView* PetInventoryViewClass; // 0x3d8
	UCraftingManagerGUI* CraftingPanelClass; // 0x3e0
	UPaperdollPanel* NPCPaperDollViewClass; // 0x3e8
	UPaperdollPanel* PetPaperDollViewClass; // 0x3f0
	UFeedingTrayPanel* FeedingTrayPanelClass; // 0x3f8
	FMargin CarouselModePadding; // 0x400
	URootWidget* m_CurrentCenterPanel; // 0x468
	URootWidget* m_CurrentRightPanel; // 0x470
};

struct UHighlightsOpenGroupAsync : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UMaterialExpressionViewSize : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UTwitterIntegrationBase : UPlatformInterfaceBase {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UMaterialExpressionSphericalParticleOpacity : UMaterialExpression {
	FExpressionInput Density; // 0x60
	float ConstantDensity; // 0x98
};

struct UBTDecorator_BlackboardBase : UBTDecorator {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UUserWidget : UWidget {
	FLinearColor ColorAndOpacity; // 0x120
	DelegateProperty ColorAndOpacityDelegate; // 0x130
	FSlateColor ForegroundColor; // 0x140
	DelegateProperty ForegroundColorDelegate; // 0x168
	FMargin Padding; // 0x178
	bool bSupportsKeyboardFocus; // 0x188
	bool bIsFocusable; // 0x189
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x190
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1a0
	bool bStopAction; // 0x1b0
	int32_t Priority; // 0x1b4
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1b8
	FMargin SafeZonePadding; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	char bCanEverTick : 1; // 0x1e0
	char bCanEverPaint : 1; // 0x1e0
	char bCookedWidgetTree : 1; // 0x1e0
	UInputComponent* InputComponent; // 0x1e8
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct USimpleWheeledVehicleMovementComponent : UWheeledVehicleMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x198
	TArray<FWheelSetup> WheelSetups; // 0x1a0
	float Mass; // 0x1b0
	float DragCoefficient; // 0x1b4
	float ChassisWidth; // 0x1b8
	float ChassisHeight; // 0x1bc
	bool bReverseAsBrake; // 0x1c0
	float DragArea; // 0x1c4
	float EstimatedMaxEngineSpeed; // 0x1c8
	float MaxEngineRPM; // 0x1cc
	float DebugDragMagnitude; // 0x1d0
	FVector InertiaTensorScale; // 0x1d4
	float MinNormalizedTireLoad; // 0x1e0
	float MinNormalizedTireLoadFiltered; // 0x1e4
	float MaxNormalizedTireLoad; // 0x1e8
	float MaxNormalizedTireLoadFiltered; // 0x1ec
	float ThresholdLongitudinalSpeed; // 0x1f0
	int32_t LowForwardSpeedSubStepCount; // 0x1f4
	int32_t HighForwardSpeedSubStepCount; // 0x1f8
	TArray<UVehicleWheel*> Wheels; // 0x200
	char bUseRVOAvoidance : 1; // 0x228
	float RVOAvoidanceRadius; // 0x22c
	float RVOAvoidanceHeight; // 0x230
	float AvoidanceConsiderationRadius; // 0x234
	float RVOSteeringStep; // 0x238
	float RVOThrottleStep; // 0x23c
	int32_t AvoidanceUID; // 0x240
	FNavAvoidanceMask AvoidanceGroup; // 0x244
	FNavAvoidanceMask GroupsToAvoid; // 0x248
	FNavAvoidanceMask GroupsToIgnore; // 0x24c
	float AvoidanceWeight; // 0x250
	FVector PendingLaunchVelocity; // 0x254
	FReplicatedVehicleState ReplicatedState; // 0x260
	float RawSteeringInput; // 0x278
	float RawThrottleInput; // 0x27c
	float RawBrakeInput; // 0x280
	char bRawHandbrakeInput : 1; // 0x284
	char bRawGearUpInput : 1; // 0x284
	char bRawGearDownInput : 1; // 0x284
	float SteeringInput; // 0x288
	float ThrottleInput; // 0x28c
	float BrakeInput; // 0x290
	float HandbrakeInput; // 0x294
	float IdleBrakeInput; // 0x298
	float StopThreshold; // 0x29c
	float WrongDirectionThreshold; // 0x2a0
	FVehicleInputRate ThrottleInputRate; // 0x2a4
	FVehicleInputRate BrakeInputRate; // 0x2ac
	FVehicleInputRate HandbrakeInputRate; // 0x2b4
	FVehicleInputRate SteeringInputRate; // 0x2bc
	char bWasAvoidanceUpdated : 1; // 0x2c4
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x98
};

struct UInventoryGridViewBase : URootWidget {
	UInventoryGridSlotViewBase* GridSlotViewClass; // 0x318
	UInventoryIconViewBase* ItemViewClass; // 0x320
	UTooltipWidget* ItemTooltipViewClass; // 0x328
	UStackSplitValueDialog* StackSplitDialogClass; // 0x330
	FLinearColor ItemViewClassEnabledColor; // 0x338
	FLinearColor ItemViewClassDisabledColor; // 0x348
	UItemInventory* inventory; // 0x358
	int32_t ColumnCount; // 0x360
	int32_t RowCount; // 0x364
	float IconSlotSize; // 0x368
	FMargin IconSlotPadding; // 0x36c
	FMargin IconSpacing; // 0x37c
	FMargin IconSlotSpacing; // 0x38c
	EOrientation Orientation; // 0x39c
	bool EnableScrollBar; // 0x39d
	bool SizeToFitVertically; // 0x39e
	bool SizeToFitHorizontally; // 0x39f
	bool ExpandingGrid; // 0x3a0
	bool m_HideEmptySlots; // 0x3a1
	bool ShowItemProgress; // 0x3a2
	bool AllowItemDrag; // 0x3a3
	bool AllowItemDrop; // 0x3a4
	FSlateSound ItemsCombinedSound; // 0x3a8
	USoundBase* HoveredSound; // 0x3c0
	DelegateProperty DelegateGetItemTooltip; // 0x3e0
	DelegateProperty DelegateFilterItem; // 0x3f0
	DelegateProperty DelegateDimItem; // 0x400
	DelegateProperty DelegateShowGlowItem; // 0x410
	DelegateProperty DelegateCompareItems; // 0x420
	FScriptMulticastDelegate SignalItemAdded; // 0x660
	FScriptMulticastDelegate SignalItemRemoved; // 0x670
	UInventoryGridViewBase* m_InventoryOnLeft; // 0x6b8
	UInventoryGridViewBase* m_InventoryOnRight; // 0x6c0
	UInventoryGridViewBase* m_InventoryOnTop; // 0x6c8
	UInventoryGridViewBase* m_InventoryOnDown; // 0x6d0
	UStackSplitValueDialog* m_SplitStackDialog; // 0x6d8
	UItemInventoryClientMonitor* m_InventoryMonitor; // 0x6e0
	UObjectPool* m_ItemIconViewPool; // 0x6e8
	UObjectPool* m_GridSlotViewPool; // 0x6f0
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UInventoryViewBase : URootWidget {
	UItemInventory* inventory; // 0x358
	USoundBase* SplitStackSound; // 0x360
	int32_t ColumnCount; // 0x380
	int32_t RowCount; // 0x384
	float FilterButtonSpacing; // 0x388
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x1d0
	int32_t MinQueriesPerTimeSliceCheck; // 0x1d4
	double MaxTimeSlicePerTick; // 0x1d8
	float HighImportanceQueryDistanceThreshold; // 0x1e0
	float MaxQueryImportance; // 0x1e8
	float SightLimitQueryImportance; // 0x1ec
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat range; // 0x38
	char bStrengthByDistance : 1; // 0x70
	FRawDistributionFloat Strength; // 0x78
	char bAffectBaseVelocity : 1; // 0xb0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xb4
	char bRenewSource : 1; // 0xb8
	char bInheritSourceVel : 1; // 0xb8
	int32_t LastSelIndex; // 0xbc
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x70
	FExpressionInput TextureObject; // 0xa8
	FExpressionInput MipValue; // 0xe0
	FExpressionInput CoordinatesDX; // 0x118
	FExpressionInput CoordinatesDY; // 0x150
	ETextureMipValueMode MipValueMode; // 0x188
	ESamplerSourceMode SamplerSource; // 0x189
	uint32_t ConstCoordinate; // 0x18c
	int32_t ConstMipValue; // 0x190
};

struct UAnimCompositeBase : UAnimSequenceBase {
	TArray<FAnimNotifyEvent> Notifies; // 0x78
	float SequenceLength; // 0x88
	float RateScale; // 0x8c
	FRawCurveTracks RawCurveData; // 0x90
};

struct USceneCaptureComponentImprints : USceneCaptureComponent {
	UTextureRenderTarget2D* TextureTarget; // 0x3e0
	ETextureTargetOutput TextureTargetOutput; // 0x3e8
	UTextureRenderTarget2D* ReferenceHeightMap; // 0x3f0
	UTextureRenderTarget2D* ImprintsMap; // 0x3f8
	UMaterialParameterCollection* MaterialParams; // 0x400
	FName MaterialParameterName; // 0x408
	FName MaterialParameterName2; // 0x410
	FName MaterialParameterName3; // 0x418
	float CameraHeightOffset; // 0x420
	float ImprintHeight; // 0x424
	float ImprintFade; // 0x42c
	TArray<FImprintQualitySettings> QualitySettings; // 0x430
	UTexture* MaskTexture; // 0x440
	FVector2D MaskResolution; // 0x448
	FVector2D MaskUVOffset; // 0x450
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UGridPanel : UPanelWidget {
	TArray<float> ColumnFill; // 0x130
	TArray<float> RowFill; // 0x140
};

struct UPlayFabEventsAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa0
	UPlayFabJsonObject* RequestJsonObj; // 0xa8
	UPlayFabJsonObject* ResponseJsonObj; // 0xb0
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UW_HUD_FriendsNotificationEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x240
	UWidgetAnimation* Anim_Fade; // 0x248
	UWidgetAnimation* Anim_SlideIn; // 0x250
	UTextBlock* Message; // 0x258
	UNamedSlot* OtherWidget; // 0x260
	float SlideProgress; // 0x268
	FText ID; // 0x270
};

struct UInterpTrackColorScale : UInterpTrackVectorBase {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x7c8
	int32_t PreviousLODLevel; // 0x7cc
	UStaticMesh* StaticMesh; // 0x7d0
	int32_t MinLOD; // 0x7d8
	int32_t SubDivisionStepSize; // 0x7dc
	char bOverrideMinLOD : 1; // 0x7e0
	char bOverrideNavigationExport : 1; // 0x7e0
	char bForceNavigationObstacle : 1; // 0x7e0
	char bDisallowMeshPaintPerInstance : 1; // 0x7e0
	char bUseDefaultCollision : 1; // 0x7e0
	char bUseSubDivisions : 1; // 0x7e0
	char bIgnoreInstanceForTextureStreaming : 1; // 0x7e0
	char bOverrideLightMapRes : 1; // 0x7e0
	char bCastDistanceFieldIndirectShadow : 1; // 0x7e0
	int32_t OverriddenLightMapRes; // 0x7e4
	float DistanceFieldIndirectShadowMinVisibility; // 0x7e8
	float StreamingDistanceMultiplier; // 0x7ec
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x7f0
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x800
	FLightmassPrimitiveSettings LightmassSettings; // 0x810
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x60
};

struct USoundNode : UObject {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UThrallInfoComponent : UActorComponent {
	FThrallInfo ThrallInfo; // 0xf8
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat range; // 0x48
	FRawDistributionFloat Strength; // 0x80
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x640
};

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FStringAssetReference TinyFontName; // 0x38
	UFont* SmallFont; // 0x48
	FStringAssetReference SmallFontName; // 0x50
	UFont* MediumFont; // 0x60
	FStringAssetReference MediumFontName; // 0x68
	UFont* LargeFont; // 0x78
	FStringAssetReference LargeFontName; // 0x80
	UFont* SubtitleFont; // 0x90
	FStringAssetReference SubtitleFontName; // 0x98
	TArray<UFont*> AdditionalFonts; // 0xa8
	TArray<FString> AdditionalFontNames; // 0xc0
	UConsole* ConsoleClass; // 0xd0
	FStringClassReference ConsoleClassName; // 0xd8
	UGameViewportClient* GameViewportClientClass; // 0xe8
	FStringClassReference GameViewportClientClassName; // 0xf0
	ULocalPlayer* LocalPlayerClass; // 0x100
	FStringClassReference LocalPlayerClassName; // 0x108
	AWorldSettings* WorldSettingsClass; // 0x118
	FStringClassReference WorldSettingsClassName; // 0x120
	FStringClassReference NavigationSystemClassName; // 0x130
	UNavigationSystem* NavigationSystemClass; // 0x140
	FStringClassReference AvoidanceManagerClassName; // 0x148
	UAvoidanceManager* AvoidanceManagerClass; // 0x158
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x160
	FStringClassReference PhysicsCollisionHandlerClassName; // 0x168
	FStringClassReference GameUserSettingsClassName; // 0x178
	UGameUserSettings* GameUserSettingsClass; // 0x188
	FStringClassReference AIControllerClassName; // 0x190
	UGameUserSettings* GameUserSettings; // 0x1a0
	ALevelScriptActor* LevelScriptActorClass; // 0x1a8
	FStringClassReference LevelScriptActorClassName; // 0x1b0
	FStringClassReference DefaultBlueprintBaseClassName; // 0x1c0
	FStringClassReference GameSingletonClassName; // 0x1d0
	UObject* GameSingleton; // 0x1e0
	FString PlayOnConsoleSaveDir; // 0x1e8
	UTexture2D* DefaultTexture; // 0x1f8
	FStringAssetReference DefaultTextureName; // 0x200
	UTexture* DefaultDiffuseTexture; // 0x210
	FStringAssetReference DefaultDiffuseTextureName; // 0x218
	UTexture2D* DefaultBSPVertexTexture; // 0x228
	FStringAssetReference DefaultBSPVertexTextureName; // 0x230
	UTexture2D* HighFrequencyNoiseTexture; // 0x240
	FStringAssetReference HighFrequencyNoiseTextureName; // 0x248
	UTexture2D* DefaultBokehTexture; // 0x258
	FStringAssetReference DefaultBokehTextureName; // 0x260
	UMaterial* WireframeMaterial; // 0x270
	FString WireframeMaterialName; // 0x278
	UMaterial* DebugMeshMaterial; // 0x288
	FStringAssetReference DebugMeshMaterialName; // 0x290
	UMaterial* LevelColorationLitMaterial; // 0x2a0
	FString LevelColorationLitMaterialName; // 0x2a8
	UMaterial* LevelColorationUnlitMaterial; // 0x2b8
	FString LevelColorationUnlitMaterialName; // 0x2c0
	UMaterial* LightingTexelDensityMaterial; // 0x2d0
	FString LightingTexelDensityName; // 0x2d8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x2e8
	FString ShadedLevelColorationLitMaterialName; // 0x2f0
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x300
	FString ShadedLevelColorationUnlitMaterialName; // 0x308
	UMaterial* RemoveSurfaceMaterial; // 0x318
	FStringAssetReference RemoveSurfaceMaterialName; // 0x320
	UMaterial* VertexColorMaterial; // 0x330
	FString VertexColorMaterialName; // 0x338
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x348
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x350
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x360
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x368
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x378
	FString VertexColorViewModeMaterialName_RedOnly; // 0x380
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x390
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x398
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x3a8
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x3b0
	UMaterial* ConstraintLimitMaterial; // 0x3c0
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x3c8
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x3d0
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x3d8
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x3e0
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x3e8
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x3f0
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x3f8
	UMaterial* InvalidLightmapSettingsMaterial; // 0x400
	FStringAssetReference InvalidLightmapSettingsMaterialName; // 0x408
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x418
	FStringAssetReference PreviewShadowsIndicatorMaterialName; // 0x420
	UMaterial* ArrowMaterial; // 0x430
	FStringAssetReference ArrowMaterialName; // 0x438
	FLinearColor LightingOnlyBrightness; // 0x448
	TArray<FLinearColor> ShaderComplexityColors; // 0x458
	TArray<FLinearColor> QuadComplexityColors; // 0x468
	TArray<FLinearColor> LightComplexityColors; // 0x478
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x488
	TArray<FLinearColor> LODColorationColors; // 0x498
	TArray<FLinearColor> HLODColorationColors; // 0x4a8
	TArray<FLinearColor> StreamingAccuracyColors; // 0x4b8
	float MaxPixelShaderAdditiveComplexityCount; // 0x4c8
	float MaxES2PixelShaderAdditiveComplexityCount; // 0x4cc
	float MinLightMapDensity; // 0x4d0
	float IdealLightMapDensity; // 0x4d4
	float MaxLightMapDensity; // 0x4d8
	char bRenderLightMapDensityGrayscale : 1; // 0x4dc
	float RenderLightMapDensityGrayscaleScale; // 0x4e0
	float RenderLightMapDensityColorScale; // 0x4e4
	FLinearColor LightMapDensityVertexMappedColor; // 0x4e8
	FLinearColor LightMapDensitySelectedColor; // 0x4f8
	TArray<FStatColorMapping> StatColorMappings; // 0x508
	UPhysicalMaterial* DefaultPhysMaterial; // 0x518
	FStringAssetReference DefaultPhysMaterialName; // 0x520
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x530
	TArray<FClassRedirect> ActiveClassRedirects; // 0x540
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x550
	TArray<FStructRedirect> ActiveStructRedirects; // 0x560
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x570
	FStringAssetReference PreIntegratedSkinBRDFTextureName; // 0x578
	UTexture2D* MiniFontTexture; // 0x588
	FStringAssetReference MiniFontTextureName; // 0x590
	UTexture* WeightMapPlaceholderTexture; // 0x5a0
	FStringAssetReference WeightMapPlaceholderTextureName; // 0x5a8
	UTexture2D* LightMapDensityTexture; // 0x5b8
	FStringAssetReference LightMapDensityTextureName; // 0x5c0
	UGameViewportClient* GameViewport; // 0x5d8
	TArray<FString> DeferredCommands; // 0x5e0
	int32_t TickCycles; // 0x5f0
	int32_t GameCycles; // 0x5f4
	int32_t ClientCycles; // 0x5f8
	float NearClipPlane; // 0x5fc
	char bHardwareSurveyEnabled : 1; // 0x600
	char bSubtitlesEnabled : 1; // 0x600
	char bSubtitlesForcedOff : 1; // 0x600
	int32_t MaximumLoopIterationCount; // 0x604
	char bCanBlueprintsTickByDefault : 1; // 0x608
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x608
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x608
	char bEnableEditorPSysRealtimeLOD : 1; // 0x608
	char bSmoothFrameRate : 1; // 0x608
	char bUseFixedFrameRate : 1; // 0x608
	float FixedFrameRate; // 0x60c
	FFloatRange SmoothedFrameRateRange; // 0x610
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x620
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x624
	char bShouldGenerateLowQualityLightmaps : 1; // 0x628
	FColor C_WorldBox; // 0x62c
	FColor C_BrushWire; // 0x630
	FColor C_AddWire; // 0x634
	FColor C_SubtractWire; // 0x638
	FColor C_SemiSolidWire; // 0x63c
	FColor C_NonSolidWire; // 0x640
	FColor C_WireBackground; // 0x644
	FColor C_ScaleBoxHi; // 0x648
	FColor C_VolumeCollision; // 0x64c
	FColor C_BSPCollision; // 0x650
	FColor C_OrthoBackground; // 0x654
	FColor C_Volume; // 0x658
	FColor C_BrushShape; // 0x65c
	float StreamingDistanceFactor; // 0x660
	ETransitionType TransitionType; // 0x664
	FString TransitionDescription; // 0x668
	FString TransitionGameMode; // 0x678
	float MeshLODRange; // 0x688
	char bAllowMatureLanguage : 1; // 0x68c
	float CameraRotationThreshold; // 0x690
	float CameraTranslationThreshold; // 0x694
	float PrimitiveProbablyVisibleTime; // 0x698
	float MaxOcclusionPixelsFraction; // 0x69c
	char bPauseOnLossOfFocus : 1; // 0x6a0
	int32_t MaxParticleResize; // 0x6a4
	int32_t MaxParticleResizeWarn; // 0x6a8
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x6b0
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0x6c0
	float NetClientTicksPerSecond; // 0x6dc
	float DisplayGamma; // 0x6e0
	float MinDesiredFrameRate; // 0x6e4
	FLinearColor DefaultSelectedMaterialColor; // 0x6e8
	FLinearColor SelectedMaterialColor; // 0x6f8
	FLinearColor SelectionOutlineColor; // 0x708
	FLinearColor SubduedSelectionOutlineColor; // 0x718
	FLinearColor SelectedMaterialColorOverride; // 0x728
	bool bIsOverridingSelectedColor; // 0x738
	char bEnableOnScreenDebugMessages : 1; // 0x750
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x750
	char bSuppressMapWarnings : 1; // 0x750
	char bDisableAILogging : 1; // 0x750
	uint32_t bEnableVisualLogRecordingOnStart; // 0x754
	int32_t ScreenSaverInhibitorSemaphore; // 0x75c
	char bLockReadOnlyLevels : 1; // 0x760
	FString ParticleEventManagerClassPath; // 0x768
	float SelectionHighlightIntensity; // 0x788
	float SelectionMeshSectionHighlightIntensity; // 0x78c
	float BSPSelectionHighlightIntensity; // 0x790
	float HoverHighlightIntensity; // 0x794
	float SelectionHighlightIntensityBillboards; // 0x798
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf0
	TArray<FString> ServerActors; // 0xc00
	TArray<FString> RuntimeServerActors; // 0xc10
	char bStartedLoadMapMovie : 1; // 0xc20
	int32_t NextWorldContextHandle; // 0xc38
	TArray<UObject*> KeepAliveAdditionalComponentClasses; // 0xd00
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x60
	FExpressionInput Height; // 0x98
	FExpressionInput HeightRatioInput; // 0xd0
	float HeightRatio; // 0x108
	float ReferencePlane; // 0x10c
	uint32_t ConstCoordinate; // 0x110
};

struct UHoudiniHandleComponent : USceneComponent {
	EHoudiniHandleType HandleType; // 0x3b0
};

struct UParticleModuleLocationDirect : UParticleModuleLocationBase {
	FRawDistributionVector Location; // 0x30
	FRawDistributionVector LocationOffset; // 0x80
	FRawDistributionVector ScaleFactor; // 0xd0
	FRawDistributionVector Direction; // 0x120
};

struct UNiagaraEmitterProperties : UObject {
	FString EmitterName; // 0x28
	bool bIsEnabled; // 0x38
	float SpawnRate; // 0x3c
	UMaterial* Material; // 0x40
	EEmitterRenderModuleType RenderModuleType; // 0x48
	float StartTime; // 0x4c
	float EndTime; // 0x50
	UNiagaraEffectRendererProperties* RendererProperties; // 0x58
	int32_t NumLoops; // 0x60
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x68
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0xc0
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UDistributionVectorUniformCurve : UDistributionVector {
	FInterpCurveTwoVectors ConstantCurve; // 0x38
	char bLockAxes1 : 1; // 0x50
	char bLockAxes2 : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x56
	char bUseExtremes : 1; // 0x5c
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x50
};

struct UConanPathFollowingComponent : UPathFollowingComponent {
	float PathWidth; // 0x3a8
	float BreakAngle; // 0x3ac
	float AccelerationFactor; // 0x3b0
	float AccelerationMinSpeed; // 0x3b4
	float NavMeshSearchExtent; // 0x3b8
	float AvoidanceMaxTimeHorizonSeconds; // 0x3bc
	float AvoidanceMinTimeHorizonSeconds; // 0x3c0
	float AvoidanceMinDistance; // 0x3c4
	float AvoidanceSearchRadius; // 0x3c8
	float InitialAvoidanceYawSearchRange; // 0x3cc
	float AvoidanceMinSpeed; // 0x3d0
	float SecondsUntilFullAvoidanceYawSearchRange; // 0x3d4
	char AvoidPlayerCharacters : 1; // 0x3d8
	TArray<FPredictedObstacle> PredictedObstacles; // 0x3e0
	FPolarUtilityVector YawAngleWeights; // 0x3f0
	TArray<AActor*> m_CandidateObstacles; // 0x4b0
};

struct AVolume : ABrush {
	EBrushType BrushType; // 0x3d0
	FColor BrushColor; // 0x3d4
	int32_t PolyFlags; // 0x3d8
	char bColored : 1; // 0x3dc
	char bSolidWhenSelected : 1; // 0x3dc
	char bPlaceableFromClassBrowser : 1; // 0x3dc
	char bNotForClientOrServer : 1; // 0x3dc
	UModel* Brush; // 0x3e0
	UBrushComponent* BrushComponent; // 0x3e8
	char bInManipulation : 1; // 0x3f0
	TArray<FGeomSelection> SavedSelections; // 0x3f8
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x38
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x3d0
	FGuid LandscapeGuid; // 0x3d8
	FIntPoint LandscapeSectionOffset; // 0x3e8
	int32_t MaxLodLevel; // 0x3f0
	float LODDistanceFactor; // 0x3f4
	ELandscapeLODFalloff LODFalloff; // 0x3f8
	int32_t StaticLightingLOD; // 0x3fc
	UPhysicalMaterial* DefaultPhysMaterial; // 0x400
	float StreamingDistanceMultiplier; // 0x408
	UMaterialInterface* LandscapeMaterial; // 0x410
	UMaterialInterface* LandscapeHoleMaterial; // 0x418
	float NegativeZBoundsExtension; // 0x420
	float PositiveZBoundsExtension; // 0x424
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x428
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x438
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x448
	bool bHasLandscapeGrass; // 0x4b8
	float StaticLightingResolution; // 0x4bc
	char bCastStaticShadow : 1; // 0x4c0
	char bCastShadowAsTwoSided : 1; // 0x4c0
	char bCastFarShadow : 1; // 0x4c0
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x4c0
	FLightmassPrimitiveSettings LightmassSettings; // 0x4c4
	int32_t CollisionMipLevel; // 0x4dc
	int32_t SimpleCollisionMipLevel; // 0x4e0
	float CollisionThickness; // 0x4e4
	FBodyInstance BodyInstance; // 0x4f0
	char bGenerateOverlapEvents : 1; // 0x720
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x720
	int32_t ComponentSizeQuads; // 0x724
	int32_t SubsectionSizeQuads; // 0x728
	int32_t NumSubsections; // 0x72c
	char bUsedForNavigation : 1; // 0x730
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x734
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x735
};

struct UParticleModuleLocationBoneSocket : UParticleModuleLocationBase {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x60
	int32_t NumPreSelectedIndices; // 0x68
};

struct ALightmassPortal : AActor {
	ULightmassPortalComponent* PortalComponent; // 0x3d0
};

struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> QueryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct ACableActor : AActor {
	UCableComponent* CableComponent; // 0x3d0
};

struct UMaterialExpressionDecalDerivative : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UAISenseConfig_Team : UAISenseConfig {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression {
	FExpressionInput TextureSize; // 0x60
	float ConstWidth; // 0x98
	float ConstHeight; // 0x9c
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UMaterialExpressionBlackBody : UMaterialExpression {
	FExpressionInput Temp; // 0x60
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x78
	char bUsePSysLocation : 1; // 0x78
	char bInheritVelocity : 1; // 0x78
	FRawDistributionVector InheritVelocityScale; // 0x80
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xd0
	char bBanPhysicalMaterials : 1; // 0xe0
};

struct APlayerState : AInfo {
	float score; // 0x3d0
	char Ping; // 0x3d4
	FString playerName; // 0x3d8
	int32_t PlayerId; // 0x3f8
	char bIsSpectator : 1; // 0x3fc
	char bOnlySpectator : 1; // 0x3fc
	char bIsABot : 1; // 0x3fc
	char bIsInactive : 1; // 0x3fc
	char bFromPreviousLevel : 1; // 0x3fc
	int32_t StartTime; // 0x400
	ULocalMessage* EngineMessageClass; // 0x408
	FString SavedNetworkAddress; // 0x418
	FUniqueNetIdRepl UniqueID; // 0x428
};

struct UPlaceableInfoBase : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMap; // 0x60
	TArray<UChannel*> OpenChannels; // 0x68
	TArray<AActor*> SentTemporaries; // 0x78
	AActor* ViewTarget; // 0x88
	AActor* OwningActor; // 0x90
	int32_t MaxPacket; // 0x98
	char InternalAck : 1; // 0x9c
	TArray<UObject*> AsyncLoadedObjects; // 0xa0
	FUniqueNetIdRepl PlayerId; // 0x170
	double LastReceiveTime; // 0x200
	TMap<AActor*, UActorChannel*> ActorChannels; // 0x334e0
	TArray<UChannel*> ChannelsToTick; // 0x33730
};

struct ULevelScriptBlueprint : UBlueprint {
	char bRecompileOnLoad : 1; // 0x50
	UObject* ParentClass; // 0x58
	UObject* PRIVATE_InnermostPreviousCDO; // 0x60
	char bHasBeenRegenerated : 1; // 0x68
	char bIsRegeneratingOnLoad : 1; // 0x68
	USimpleConstructionScript* SimpleConstructionScript; // 0x70
	TArray<UActorComponent*> ComponentTemplates; // 0x78
	TArray<UTimelineTemplate*> Timelines; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
	EBlueprintType BlueprintType; // 0xa0
	int32_t BlueprintSystemVersion; // 0xa4
	bool bNativize; // 0x190
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x60
	EMaterialPositionTransformSource TransformSourceType; // 0x98
	EMaterialPositionTransformSource TransformType; // 0x99
};

struct ALobbyBeaconState : AInfo {
	int32_t MaxPlayers; // 0x3d0
	ALobbyBeaconPlayerState* LobbyBeaconPlayerStateClass; // 0x3d8
	bool bLobbyStarted; // 0x3e8
	float WaitForPlayersTimeRemaining; // 0x3ec
	FLobbyPlayerStateInfoArray Players; // 0x3f0
};

struct AConanGameMode : ADWGameMode {
	USpawnTableComponent* SpawnTableSystem; // 0x630
	bool m_DatabaseOK; // 0x638
	bool RunInsideCollisionCheckOnLoad; // 0x639
	APurgeVolume* PurgeVolumeClass; // 0x640
	ASharedDebugInfo* SharedDebugInfoClass; // 0x648
	UConanProjectileRegistry* ConanProjectileRegistry; // 0x690
	TArray<FString> CountryBlackList; // 0x6b8
	bool BlockVPNConnections; // 0x6c8
	uint32_t MaxPeriodicBackupsToKeep; // 0x6cc
	float PeriodicBackupInterval; // 0x6d0
	int32_t MaxUpgradeBackupstoKeep; // 0x6d4
	UFrameRateReporter* m_ServerFrameRateReporter; // 0x6d8
	float CorpsesHarvestTimeLockSeconds; // 0x8ac
	FTimerHandle m_TickServerPopulationTimer; // 0x8d0
	FTimerHandle m_VerifyAttributesTimer; // 0x8d8
	FTimerHandle m_GetServerRatingRetryTimer; // 0x8e0
	URatingServerRequestConnection* m_RatingServerConnection; // 0x8e8
	FTimerHandle m_GuildMemberCountReportTimer; // 0x8f0
	FTimerHandle m_GuildThrallCountReportTimer; // 0x8f8
	FTimerHandle m_AttributeDistributionReportTimer; // 0x900
	FTimerHandle m_ServerMergeExportTimer; // 0x908
	TArray<ABuildingBase*> m_BuildingsBeingRecorded; // 0x9e0
	TMap<int32_t, UObject*> m_BuildingRecordingPieceTypesIdToClass; // 0x9f0
	TMap<UObject*, int32_t> m_BuildingRecordingPieceTypesClassToId; // 0xa40
	TSet<ABuildingBase*> m_BuildingsNeedingReplicationRebuild; // 0xb38
	TMap<int64_t, ULoadCharacterCallProxy*> m_LoadOfflineCharacterCallbacks; // 0xb88
	TMap<int64_t, ULoadInventoryCallProxy*> m_LoadOfflineInventoryCallbacks; // 0xbd8
	TArray<UUniqueID*> m_LoadOfflineInventoryActiveUIDs; // 0xc28
	TSet<APlaceableBase*> m_PlaceablesForValidation; // 0xcd8
	TArray<APlaceableBase*> m_PlaceablesForStabilityCheck; // 0xd28
	TSet<ABuildingBase*> m_BuildingsForValidation; // 0xd38
	TSet<ABuildingBase*> m_AllMasterBuildings; // 0xdd8
	UDbTransfer* DbTransfer; // 0xe28
};

struct UMaterialExpressionMakeMaterialAttributes : UMaterialExpression {
	FExpressionInput BaseColor; // 0x60
	FExpressionInput Metallic; // 0x98
	FExpressionInput Specular; // 0xd0
	FExpressionInput Roughness; // 0x108
	FExpressionInput EmissiveColor; // 0x140
	FExpressionInput Opacity; // 0x178
	FExpressionInput OpacityMask; // 0x1b0
	FExpressionInput Normal; // 0x1e8
	FExpressionInput WorldPositionOffset; // 0x220
	FExpressionInput WorldDisplacement; // 0x258
	FExpressionInput TessellationMultiplier; // 0x290
	FExpressionInput SubsurfaceColor; // 0x2c8
	FExpressionInput ClearCoat; // 0x300
	FExpressionInput ClearCoatRoughness; // 0x338
	FExpressionInput AmbientOcclusion; // 0x370
	FExpressionInput Refraction; // 0x3a8
	FExpressionInput CustomizedUVs[0x8]; // 0x3e0
	FExpressionInput PixelDepthOffset; // 0x5a0
};

struct UTexture2D : UTexture {
	int32_t RequestedMips; // 0xc8
	int32_t ResidentMips; // 0xcc
	int32_t StreamingIndex; // 0xd0
	int32_t LevelIndex; // 0xd4
	int32_t FirstResourceMemMip; // 0xd8
	FIntPoint ImportedSize; // 0xdc
	double ForceMipLevelsToBeResidentTimestamp; // 0xe8
	char bTemporarilyDisableStreaming : 1; // 0xf0
	char bIsStreamable : 1; // 0xf0
	char bHasStreamingUpdatePending : 1; // 0xf0
	char bHasCancelationPending : 1; // 0xf0
	char bForceMiplevelsToBeResident : 1; // 0xf0
	char bIgnoreStreamingMipBias : 1; // 0xf0
	char bGlobalForceMipLevelsToBeResident : 1; // 0xf0
	TextureAddress AddressX; // 0xf4
	TextureAddress AddressY; // 0xf5
};

struct UCircularThrobber : UWidget {
	int32_t NumberOfPieces; // 0x118
	float Period; // 0x11c
	float Radius; // 0x120
	USlateBrushAsset* PieceImage; // 0x128
	FSlateBrush Image; // 0x130
	bool bEnableRadius; // 0x1c0
};

struct UInterpTrackFloatAnimBPParam : UInterpTrackFloatBase {
	UObject* AnimBlueprintClass; // 0x90
	UAnimInstance* AnimClass; // 0x98
	FName ParamName; // 0xa0
};

struct URichTextBlockDecorator : UObject {
	bool bReveal; // 0x28
	int32_t RevealedIndex; // 0x2c
};

struct UServerInfoBase : URootWidget {
	FBlueprintSessionResult m_Session; // 0x318
	bool m_IsBattlEyeEnabled; // 0x3f8
	bool m_ServerTransferEnabled; // 0x3f9
	FServerModList m_ServerModList; // 0x400
	bool m_IsValid; // 0x418
	USoundBase* HoveredSound; // 0x420
	FScriptMulticastDelegate SignalServerEntrySelected; // 0x450
	FScriptMulticastDelegate SignalServerListDeselected; // 0x460
	FScriptMulticastDelegate SignalServerEntryInvoked; // 0x470
};

struct UBuildingMasterActorComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xa8
	char bIsClientOnly : 1; // 0xa8
	char bNetAddressable : 1; // 0xa8
	char bAllowAnyoneToDestroyMe : 1; // 0xa8
	char bCreatedByConstructionScript : 1; // 0xa8
	char bInstanceComponent : 1; // 0xa8
	char bAutoActivate : 1; // 0xa8
	char bIsActive : 1; // 0xa8
	char bEditableWhenInherited : 1; // 0xa8
	char bCanEverAffectNavigation : 1; // 0xa8
	char bIsEditorOnly : 1; // 0xa8
	EComponentCreationMethod CreationMethod; // 0xb1
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xc0
	FScriptMulticastDelegate OnComponentActivated; // 0xd0
	FScriptMulticastDelegate OnComponentDeactivated; // 0xe0
};

struct UCameraModifier_CameraShake : UCameraModifier {
	TArray<UCameraShake*> ActiveShakes; // 0x48
	float SplitScreenShakeScale; // 0x58
};

struct UMaterialExpressionDecalLifetimeOpacity : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UNavLinkRenderingComponent : UPrimitiveComponent {
	float MinDrawDistance; // 0x308
	float LDMaxDrawDistance; // 0x30c
	float CachedMaxDrawDistance; // 0x310
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x314
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x315
	char bAlwaysCreatePhysicsState : 1; // 0x318
	char bGenerateOverlapEvents : 1; // 0x318
	char bForceGenerateOverlapEvents : 1; // 0x318
	char bMultiBodyOverlap : 1; // 0x318
	char bCheckAsyncSceneOnMove : 1; // 0x318
	char bTraceComplexOnMove : 1; // 0x318
	char bReturnMaterialOnMove : 1; // 0x318
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x318
	char bAllowCullDistanceVolume : 1; // 0x318
	char bHasMotionBlurVelocityMeshes : 1; // 0x318
	char bVisibleInReflectionCaptures : 1; // 0x318
	char bRenderInMainPass : 1; // 0x318
	char bRenderInMono : 1; // 0x318
	char bReceivesDecals : 1; // 0x318
	char bOwnerNoSee : 1; // 0x318
	char bOnlyOwnerSee : 1; // 0x318
	char bTreatAsBackgroundForOcclusion : 1; // 0x318
	char bHeightOutputReferenceSand : 1; // 0x318
	char bHeightOutputReferenceWater : 1; // 0x318
	char bHeightOutputIgnoreSand : 1; // 0x318
	char bHeightOutputIgnoreWater : 1; // 0x318
	char bCullFromDistantShadowCascades : 1; // 0x318
	char bUseAsOccluder : 1; // 0x318
	char bSelectable : 1; // 0x318
	char bForceMipStreaming : 1; // 0x318
	char bHasPerInstanceHitProxies : 1; // 0x318
	char CastShadow : 1; // 0x318
	char bAffectDynamicIndirectLighting : 1; // 0x318
	char bAffectDistanceFieldLighting : 1; // 0x318
	char bCastDynamicShadow : 1; // 0x318
	char bCastStaticShadow : 1; // 0x318
	char bCastVolumetricTranslucentShadow : 1; // 0x318
	char bSelfShadowOnly : 1; // 0x31c
	char bCastFarShadow : 1; // 0x31c
	char bCastInsetShadow : 1; // 0x31c
	char bCastCinematicShadow : 1; // 0x31c
	char bCastHiddenShadow : 1; // 0x31c
	char bCastShadowAsTwoSided : 1; // 0x31c
	char bLightAsIfStatic : 1; // 0x31c
	char bLightAttachmentsAsGroup : 1; // 0x31c
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x31c
	char bSingleSampleShadowFromStationaryLights : 1; // 0x31c
	char bIgnoreRadialImpulse : 1; // 0x31c
	char bIgnoreRadialForce : 1; // 0x31c
	char AlwaysLoadOnClient : 1; // 0x31c
	char AlwaysLoadOnServer : 1; // 0x31c
	char bUseEditorCompositing : 1; // 0x31c
	char bRenderCustomDepth : 1; // 0x31c
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x320
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x321
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x323
	FLightingChannels LightingChannels; // 0x324
	int32_t CustomDepthStencilValue; // 0x328
	int32_t TranslucencySortPriority; // 0x32c
	int32_t VisibilityId; // 0x330
	float LpvBiasMultiplier; // 0x338
	FBodyInstance BodyInstance; // 0x340
	float BoundsScale; // 0x574
	float LastSubmitTime; // 0x578
	float LastRenderTime; // 0x57c
	float LastRenderTimeOnScreen; // 0x580
	TArray<AActor*> MoveIgnoreActors; // 0x588
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x598
	FScriptMulticastDelegate OnComponentHit; // 0x5b8
	FScriptMulticastDelegate OnComponentBeginOverlap; // 0x5c8
	FScriptMulticastDelegate OnComponentEndOverlap; // 0x5d8
	FScriptMulticastDelegate OnComponentWake; // 0x5e8
	FScriptMulticastDelegate OnComponentSleep; // 0x5f8
	FScriptMulticastDelegate OnBeginCursorOver; // 0x608
	FScriptMulticastDelegate OnEndCursorOver; // 0x618
	FScriptMulticastDelegate OnClicked; // 0x628
	FScriptMulticastDelegate OnReleased; // 0x638
	UPrimitiveComponent* LODParentPrimitive; // 0x660
	FPrimitiveComponentPostPhysicsTickFunction PostPhysicsComponentTick; // 0x668
};

struct UMovieSceneVisibilityTrack : UMovieSceneBoolTrack {
	FName PropertyName; // 0xb8
	FString PropertyPath; // 0xc0
	TArray<UMovieSceneSection*> Sections; // 0xd0
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UParticleModuleOrbitBase : UParticleModule {
	char bUseEmitterTime : 1; // 0x30
};

struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	FString EnumName; // 0x30
	UEnum* EnumType; // 0x40
};

struct UParticleModuleParameterBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UMovieSceneByteSection : UMovieSceneSection {
	FIntegralCurve ByteCurve; // 0xd0
};

struct UMaterialInterface : UObject {
	USubsurfaceProfile* SubsurfaceProfile; // 0x30
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x40
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x58
};

struct UParticleModulePivotOffset : UParticleModuleLocationBase {
	FVector2D PivotOffset; // 0x30
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UBTCompositeNode : UBTNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
};

struct UMapData : UBlueprintFunctionLibrary {
	TMap<FString, FMapDataRow> m_MapData; // 0x28
	UDataTable* m_MapDataTable; // 0x78
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x90
	char bNRScaleEmitterTime : 1; // 0xc8
	FRawDistributionVector NoiseSpeed; // 0xd0
	char bSmooth : 1; // 0x120
	float NoiseLockRadius; // 0x124
	char bNoiseLock : 1; // 0x128
	char bOscillate : 1; // 0x128
	float NoiseLockTime; // 0x12c
	float NoiseTension; // 0x130
	char bUseNoiseTangents : 1; // 0x134
	FRawDistributionFloat NoiseTangentStrength; // 0x138
	int32_t NoiseTessellation; // 0x170
	char bTargetNoise : 1; // 0x174
	float FrequencyDistance; // 0x178
	char bApplyNoiseScale : 1; // 0x17c
	FRawDistributionFloat NoiseScale; // 0x180
};

struct UNavigationQueryFilter : UObject {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x60
};

struct URejoinCheck : UObject {
	ERejoinStatus LastKnownStatus; // 0x28
	bool bRejoinAfterCheck; // 0x29
	bool bAttemptingRejoin; // 0x2a
};

struct APhasedAutomationActorBase : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UGameSessionSettings : UObject {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UDialogueVoice : UObject {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UChildActorComponent : USceneComponent {
	AActor* ChildActorClass; // 0x300
	AActor* ChildActor; // 0x308
	AActor* ChildActorTemplate; // 0x310
};

struct UEmoteItem : UGameItem {
	FScriptMulticastDelegate SignalIntStatChanged; // 0x30
	FScriptMulticastDelegate SignalFloatStatChanged; // 0x40
	FScriptMulticastDelegate SignalEnableStateChanged; // 0x50
	FScriptMulticastDelegate SignalForceUnequip; // 0x60
	FScriptMulticastDelegate SignalIconChanged; // 0x70
	FScriptMulticastDelegate SignalIconLayersChanged; // 0x80
	FScriptMulticastDelegate SignalColorChanged; // 0x90
	FScriptMulticastDelegate SignalBorderChanged; // 0xa0
	FScriptMulticastDelegate SignalVisualMeshLoaded; // 0xb0
	FScriptMulticastDelegate SignalRepairCompleted; // 0xc0
	FScriptMulticastDelegate SignalVisualObjectClassLoaded; // 0xd0
	TArray<FGameItemStatModification> StatModifications; // 0xe0
	UDestructibleMesh* ActualDestructibleMesh; // 0x100
	AInventoryItemBase* VisualActor; // 0x108
	AActor* OwnerActor; // 0x110
	float RepairPercentPerTick; // 0x118
	int32_t m_MapMarkerIconID; // 0x11c
	int32_t templateID; // 0x120
	UTexture2D* m_ActualIcon; // 0x130
	TArray<UTexture2D*> m_ActualLayeredIcons; // 0x138
	UTexture2D* m_BorderIcon; // 0x148
	UObject* VisualObjectClass; // 0x200
	UItemInventory* m_OwnerInventory; // 0x208
	bool m_IsEnabled; // 0x244
	bool CanUseWhileClimbing; // 0x246
	EGameItemType TypeID; // 0x247
};

struct UPaperdollIconSlot : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UActorSequencePlayer : UMovieSceneSequencePlayer {
	FScriptMulticastDelegate OnPlay; // 0x380
	FScriptMulticastDelegate OnStop; // 0x390
	FScriptMulticastDelegate OnPause; // 0x3a0
	char bIsPlaying : 1; // 0x3b0
	char bReversePlayback : 1; // 0x3b0
	char bPendingFirstUpdate : 1; // 0x3b0
	UMovieSceneSequence* Sequence; // 0x3b8
	float TimeCursorPosition; // 0x3c0
	float StartTime; // 0x3c4
	float EndTime; // 0x3c8
	int32_t CurrentNumLoops; // 0x3cc
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x3e0
};

struct ACameraBlockingVolume : AVolume {
	EBrushType BrushType; // 0x3d0
	FColor BrushColor; // 0x3d4
	int32_t PolyFlags; // 0x3d8
	char bColored : 1; // 0x3dc
	char bSolidWhenSelected : 1; // 0x3dc
	char bPlaceableFromClassBrowser : 1; // 0x3dc
	char bNotForClientOrServer : 1; // 0x3dc
	UModel* Brush; // 0x3e0
	UBrushComponent* BrushComponent; // 0x3e8
	char bInManipulation : 1; // 0x3f0
	TArray<FGeomSelection> SavedSelections; // 0x3f8
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x28
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x38
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x48
	char bUseAsyncScene : 1; // 0x58
	TArray<UBodySetup*> BodySetup; // 0x100
};

struct UBuildingItem : UGameItem {
	UObject* BuildingObjectClass; // 0x248
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FIntegralCurve ActorGuidIndexCurve; // 0xd0
	TArray<FString> ActorGuidStrings; // 0x150
};

struct UAddGuildMemberCallProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UEditorStyleSettings : UObject {
	FLinearColor SelectionColor; // 0x28
	FLinearColor PressedSelectionColor; // 0x38
	FLinearColor InactiveSelectionColor; // 0x48
	FLinearColor KeyboardFocusColor; // 0x58
	EColorVisionDeficiency ColorVisionDeficiencyPreviewType; // 0x68
	char bUseSmallToolBarIcons : 1; // 0x6c
	char bUseGrid : 1; // 0x6c
	FLinearColor RegularColor; // 0x70
	FLinearColor RuleColor; // 0x80
	FLinearColor CenterColor; // 0x90
	uint32_t GridSnapSize; // 0xa0
	char bEnableWindowAnimations : 1; // 0xa4
	char bShowFriendlyNames : 1; // 0xa4
	char bExpandConfigurationMenus : 1; // 0xa4
	char bShowProjectMenus : 1; // 0xa4
	char bShowLaunchMenus : 1; // 0xa4
	FLinearColor LogBackgroundColor; // 0xa8
	FLinearColor LogSelectionBackgroundColor; // 0xb8
	FLinearColor LogNormalColor; // 0xc8
	FLinearColor LogCommandColor; // 0xd8
	FLinearColor LogWarningColor; // 0xe8
	FLinearColor LogErrorColor; // 0xf8
	char bShowAllAdvancedDetails : 1; // 0x108
	int32_t LogFontSize; // 0x10c
	ELogTimes LogTimestampMode; // 0x110
	bool bPromoteOutputLogWarningsDuringPIE; // 0x111
	EAssetEditorOpenLocation AssetEditorOpenLocation; // 0x112
};

struct UMaterialExpressionRound : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0xc8
	FName TrackName; // 0xd8
};

struct ARigidBodyBase : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UParticleModuleSourceMovement : UParticleModuleLocationBase {
	FRawDistributionVector SourceMovementScale; // 0x30
};

struct USignTextInputBase : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct AConanCharacter : ACharacter {
	bool NPCWasSpawnedByAPlayer; // 0x818
	bool BlockIdleFidgets; // 0x820
	bool NPCAttacksBuildings; // 0x821
	FScriptMulticastDelegate OnCharacterNameChanged; // 0x910
	FScriptMulticastDelegate OnCharacterSpawnTableIDset; // 0x990
	UAttributeSystem* AttributeSystem; // 0x9a0
	bool PreferCurrentWeaponWhenSwapping; // 0x9a8
	bool bThrallAsyncLoadDone; // 0x9c8
	FScriptMulticastDelegate OnSecondTick; // 0x9d0
	AActor* m_InteractingActor; // 0x9e0
	bool WeaponChangeDisabled; // 0x9f0
	bool FreezeAllItems; // 0x9f1
	bool m_IsReparing; // 0x9f2
	bool HasTimeCatchedUp; // 0x9f3
	int32_t FeatVersion; // 0x9f4
	UObject* m_CurrentTarget; // 0x9f8
	int32_t m_CurrentSubTargetIndex; // 0xa00
	UUniqueID* CharacterUniqueID; // 0xa08
	UUniqueID* CharacterGuildID; // 0xa10
	UUniqueID* CharacterIDOverride; // 0xa18
	int64_t m_LastEnteredLandClaimOwnerId; // 0xa20
	FName SourceSpawnTable; // 0xa28
	TMap<WeaponArcheTypes, FComboPresetTableRow> ComboPresetsMap; // 0xa30
	bool isAlive; // 0xa80
	FDateTime lastTimeOnline; // 0xa88
	int32_t community; // 0xa90
	bool IsAggressive; // 0xa94
	bool IsThrall; // 0xa95
	bool IsPet; // 0xa96
	bool IsDialogNPC; // 0xa97
	float MinEmoteTime; // 0xa98
	float MaxEmoteTime; // 0xa9c
	float EmoteChance; // 0xaa0
	bool HasCombatTarget; // 0xaa4
	float WaypointAcceptanceRange; // 0xaa8
	FVector CombatTargetLocation; // 0xab8
	UEmoteController* EmoteController; // 0xac8
	UTargetDistributionComponent* TargetingComponent; // 0xad0
	UAvoidanceComponent* AvoidanceComponent; // 0xad8
	FDateTime LastFollowerRescueTimestamp; // 0xaf0
	int32_t WalkSpeed; // 0xaf8
	int32_t RunSpeed; // 0xafc
	FTimespan MaxKnockbackChainTime; // 0xb00
	FTimespan KnockbackImmunityPeriod; // 0xb08
	bool IsInStunBreakWindow; // 0xb10
	float CurrentRotationMultiplier; // 0xb14
	float SteeringRotationRate; // 0xb18
	float DefaultRotationRate; // 0xb1c
	float DoubleJumpTimeoutTime; // 0xb20
	bool isDoubleJumpTimoutTimerActive; // 0xb24
	bool HasDoubleJumped; // 0xb25
	EPhysicalSurface currentSurfaceType; // 0xb26
	FHitResult CachedHitResultForGroundSurface; // 0xb28
	bool bShouldUseDirectionalMovement; // 0xbb0
	FScriptMulticastDelegate OnActionStart; // 0xbb8
	FScriptMulticastDelegate OnActionEnd; // 0xbc8
	bool SprintNoCost; // 0xbf0
	bool SenseDetection; // 0xbf1
	bool PlayerInvisibility; // 0xbf2
	bool IsDemiGod; // 0xbf3
	FScriptMulticastDelegate OnCharacterStateChanged; // 0xbf8
	float AdditionalInteractionExtent; // 0xc80
	AConanCharacter* LastDamageCauserCharacter; // 0xc88
	float DisengagementDistance; // 0xc90
	float EngagementDistance; // 0xc94
	FScriptMulticastDelegate SignalClientOnDamageTaken; // 0xc98
	FScriptMulticastDelegate SignalOnKilled; // 0xca8
	TArray<AConanCharacter*> CarriedPeople; // 0xeb0
	float BeingCarriedWeight; // 0xec0
	bool EnableFloorTilt; // 0xec4
	bool EnableTiltRoll; // 0xecc
	float TiltAdjust; // 0xed0
	float MaxTiltPitch; // 0xed4
	float MaxTiltRoll; // 0xed8
	bool bRootMotionAutoFreeze; // 0xedc
	FScriptMulticastDelegate OnRootMotionAutoFrozen; // 0xee0
	int32_t ClimbingBlockingVolumeCount; // 0xef0
	FCharacterIKCollection CharacterIKCollection; // 0xf00
	bool ReplicatedHangingFromCeiling; // 0x1190
	bool ReplicatedIsInSlidingMode; // 0x1191
	bool NavMeshIgnoreComponentUpdate; // 0x1192
	bool NavMeshIgnoreChildComponentUpdate; // 0x1193
	FScriptMulticastDelegate OnCharacterPossessedOnClient; // 0x1198
	float LastCryForHelp; // 0x11a8
	bool AllowCryForHelp; // 0x11ac
	bool AllowTargetSpottedCry; // 0x11ad
	float CryForHelpRange; // 0x11b0
	float TargetSpottedCryRange; // 0x11b4
	float AdditionalFollowingDistance; // 0x11b8
	FScriptMulticastDelegate SignalCharacterIsBuilding; // 0x11c0
	FScriptMulticastDelegate SignalCharacterIsBuildingThrall; // 0x11d0
	FScriptMulticastDelegate SignalMountReplicated; // 0x11e0
	float SecondTickRate; // 0x11f0
	bool m_CreatedFromCharacterCreation; // 0x11f4
	bool WasKilledByItself; // 0x11f5
	bool HungerEnabled; // 0x11f6
	bool ThirstEnabled; // 0x11f7
	FScriptMulticastDelegate OnCharacterMoved; // 0x11f8
	FScriptMulticastDelegate OnMountStaggered; // 0x1208
	float HeightToSaddle; // 0x1218
	FRotator MountCameraOrientation; // 0x121c
	bool IsMount; // 0x1228
	int64_t MountedNPCID; // 0x1230
	bool IsSpeaking; // 0x1280
	FScriptMulticastDelegate OnCharacterOverridePvPChanged; // 0x1300
	UConanTetheringController* m_TetheringController; // 0x1310
	TSet<TWeakObjectPtr<AConanPlayerController>> ForcedNetRelevantObservers; // 0x1318
	EAIEngagementBehavior EngagementBehavior; // 0x1368
	EAIFollowerTacticType FollowerTactic; // 0x1369
	TSet<UObject*> m_PendingStreams; // 0x1378
	FText m_CharacterBio; // 0x13c8
	EBiographyAccess m_AllowedBioAccess; // 0x13e0
	EBiographySharing m_AllowedBioSharing; // 0x13e1
	bool CharacterLayoutSanitized; // 0x13e2
	ECharacterState m_CharacterState; // 0x1438
	FText m_KillerName; // 0x1450
	FUniqueNetIdRepl m_KillerId; // 0x1468
	UStatHolder* m_StatHolder; // 0x1480
	AConanGameState* m_GameState; // 0x1488
	UHungerSystem* m_HungerSystem; // 0x1490
	FEnduranceData m_EnduranceData; // 0x14b0
	UActorPersistenceComponent* m_ActorPersistence; // 0x14c0
	UEmoteInventory* m_EmoteInventory; // 0x14c8
	UBuildSystemComponent* m_BuildSystem; // 0x14d0
	FText m_CharacterName; // 0x14d8
	EGUIControlMode m_GUIControlMode; // 0x14f8
	char m_OverridePvP : 1; // 0x1510
	char m_BlockGuildInvites : 1; // 0x1510
	UMessageBoxWidget* m_BattleStandardDialog; // 0x1518
	float SprintStaminacost; // 0x1698
	float SwimStaminacost; // 0x169c
	float MaxLoadingInvulnerabilityTime; // 0x16c0
	float LoadingInvulnerabilityGraceTime; // 0x16c4
	bool IsLoadingInvulnerable; // 0x16c8
	bool IsCombatConcussiveRegenInterrupted; // 0x16c9
	float CombatConcussiveRegen; // 0x16cc
	float CombatConcussiveAccumulation; // 0x16d0
	float CombatStaminaRegenMod; // 0x16d4
	bool IsCombatPossessed; // 0x16d8
	UPerkSystemComponent* PerkSystemComponent; // 0x16e0
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraAnimPlaySpace PlaySpace; // 0x78
};

struct UW_FCComboBoxString_C : UFCComboBoxString {
	UComboBoxString* ComboBox; // 0x3d0
};

struct UWindowTitleBarArea : UContentWidget {
	bool bDoubleClickTogglesFullscreen; // 0x130
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x68
	char bFloor : 1; // 0x68
	char bApplyPSysScale : 1; // 0x68
};

struct UParticleModuleVelocityOverLifetime : UParticleModuleVelocityBase {
	FRawDistributionVector VelOverLife; // 0x38
	char Absolute : 1; // 0x88
};

struct UConanAITask_Move : UAITask_MoveTo {
	FScriptMulticastDelegate OnRequestFailed; // 0x70
	FScriptMulticastDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UMaterialExpressionLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x98
	FExpressionInput Alpha; // 0xd0
	float ConstA; // 0x108
	float ConstB; // 0x10c
	float ConstAlpha; // 0x110
};

struct UPaperFlipbookComponent : UMeshComponent {
	UPaperFlipbook* SourceFlipbook; // 0x7c8
	UMaterialInterface* Material; // 0x7d0
	float PlayRate; // 0x7d8
	char bLooping : 1; // 0x7dc
	char bReversePlayback : 1; // 0x7dc
	char bPlaying : 1; // 0x7dc
	float AccumulatedTime; // 0x7e0
	int32_t CachedFrameIndex; // 0x7e4
	FLinearColor SpriteColor; // 0x7e8
	UBodySetup* CachedBodySetup; // 0x7f8
	FScriptMulticastDelegate OnFinishedPlaying; // 0x800
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct USoundWaveVoiceChat : USoundWaveProcedural {
	int32_t CompressionQuality; // 0x90
	char bLooping : 1; // 0x94
	char bStreaming : 1; // 0x94
	int32_t StreamingPriority; // 0x98
	char bMature : 1; // 0x9c
	char bManualWordWrap : 1; // 0x9c
	char bSingleLine : 1; // 0x9c
	char bVirtualizeWhenSilent : 1; // 0x9c
	ESoundGroup SoundGroup; // 0xa0
	FString SpokenText; // 0xa8
	float SubtitlePriority; // 0xb8
	float Volume; // 0xbc
	float Pitch; // 0xc0
	int32_t NumChannels; // 0xc4
	int32_t SampleRate; // 0xc8
	int32_t RawPCMDataSize; // 0xcc
	TArray<FSubtitleCue> Subtitles; // 0xd0
	TArray<FLocalizedSubtitle> LocalizedSubtitles; // 0xe0
	UCurveTable* Curves; // 0xf0
	UCurveTable* InternalCurves; // 0xf8
};

struct UBlendSpaceBase : UAnimationAsset {
	bool bRotationBlendInMeshSpace; // 0x80
	float AnimLength; // 0x84
	TArray<FPerBoneInterpolation> PerBoneBlend; // 0x88
	FInterpolationParameter InterpolationParam[0x3]; // 0x98
	float TargetWeightInterpolationSpeedPerSec; // 0xb0
	ENotifyTriggerMode NotifyTriggerMode; // 0xb4
	int32_t SampleIndexWithMarkers; // 0xb8
	TArray<FBlendSample> SampleData; // 0xc0
	TArray<FEditorElement> GridSamples; // 0xd0
	FBlendParameter BlendParameters[0x3]; // 0xe0
};

struct UGeometryCache : UObject {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
};

struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; // 0x90
	float FloatValue; // 0x94
	FString StringValue; // 0x98
	FString CachedDescription; // 0xa8
	char OperationType; // 0xb8
	EBTBlackboardRestart NotifyObserver; // 0xb9
};

struct UInputVectorAxisDelegateBinding : UInputAxisKeyDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x28
};

struct USceneComponent : UActorComponent {
	USceneComponent* AttachParent; // 0xf8
	TArray<USceneComponent*> AttachChildren; // 0x100
	TSet<USceneComponent*> ClientAttachedChildren; // 0x110
	FName AttachSocketName; // 0x160
	char bWorldToComponentUpdated : 1; // 0x168
	char bAbsoluteLocation : 1; // 0x168
	char bAbsoluteRotation : 1; // 0x168
	char bAbsoluteScale : 1; // 0x168
	char bVisible : 1; // 0x168
	char bHiddenInGame : 1; // 0x168
	char bShouldUpdatePhysicsVolume : 1; // 0x168
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x168
	char bUseAttachParentBound : 1; // 0x168
	char bShouldDisregardChildComponentsForNavigationUpdates : 1; // 0x168
	char bShouldDisregardAttachedActorsForNavigationUpdates : 1; // 0x168
	EComponentMobility Mobility; // 0x16d
	EDetailMode DetailMode; // 0x16e
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0x170
	FVector RelativeLocation; // 0x1f0
	FRotator RelativeRotation; // 0x1fc
	FVector RelativeScale3D; // 0x230
	FVector ComponentVelocity; // 0x258
	FScriptMulticastDelegate PhysicsVolumeChangedDelegate; // 0x268
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	char Attached : 1; // 0x70
	FName SocketName; // 0x78
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	int32_t ForcedLodModel; // 0x7c8
	int32_t PreviousLODLevel; // 0x7cc
	UStaticMesh* StaticMesh; // 0x7d0
	int32_t MinLOD; // 0x7d8
	int32_t SubDivisionStepSize; // 0x7dc
	char bOverrideMinLOD : 1; // 0x7e0
	char bOverrideNavigationExport : 1; // 0x7e0
	char bForceNavigationObstacle : 1; // 0x7e0
	char bDisallowMeshPaintPerInstance : 1; // 0x7e0
	char bUseDefaultCollision : 1; // 0x7e0
	char bUseSubDivisions : 1; // 0x7e0
	char bIgnoreInstanceForTextureStreaming : 1; // 0x7e0
	char bOverrideLightMapRes : 1; // 0x7e0
	char bCastDistanceFieldIndirectShadow : 1; // 0x7e0
	int32_t OverriddenLightMapRes; // 0x7e4
	float DistanceFieldIndirectShadowMinVisibility; // 0x7e8
	float StreamingDistanceMultiplier; // 0x7ec
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x7f0
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x800
	FLightmassPrimitiveSettings LightmassSettings; // 0x810
};

struct UMaterialExpressionArcsineFast : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UWidgetNavigation : UObject {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x40
	FWidgetNavigationData Left; // 0x58
	FWidgetNavigationData Right; // 0x70
	FWidgetNavigationData Next; // 0x88
	FWidgetNavigationData Previous; // 0xa0
};

struct UPlayFabDataAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xf0
	UPlayFabJsonObject* RequestJsonObj; // 0xf8
	UPlayFabJsonObject* ResponseJsonObj; // 0x100
};

struct UPieRenderWidget : UCustomRenderWidget {
	UTexture2D* Texture; // 0x128
	FLinearColor ColorAndOpacity; // 0x130
	float StartAngle; // 0x140
	float AngleSpan; // 0x144
	float InnerRadius; // 0x148
	float OuterRadius; // 0x14c
};

struct UW_FCMultiLineEditableTextBox_C : UFCEditableMultiLineText {
	UMultiLineEditableText* mMultiLineEditableText; // 0x680
};

struct UAdminPanelBase : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct USubmixEffectSubmixEQPreset : USoundEffectSubmixPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0x40
};

struct UUtilityMatrix : UObject {
	FBoxBounds Bounds; // 0x28
	float UnitsPerCell; // 0x40
};

struct USoundSubmix : UObject {
	TArray<USoundSubmix*> ChildSubmixes; // 0x28
	USoundSubmix* ParentSubmix; // 0x38
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x40
	float OutputWetLevel; // 0x50
};

struct UAISense : UObject {
	float DefaultExpirationAge; // 0x28
	EAISenseNotifyType notifyType; // 0x2c
	char bWantsNewPawnNotification : 1; // 0x30
	char bAutoRegisterAllPawnsAsSources : 1; // 0x30
	UAIPerceptionSystem* PerceptionSystemInstance; // 0x38
};

struct UMaterialExpressionTextureProperty : UMaterialExpression {
	FExpressionInput TextureObject; // 0x60
	EMaterialExposedTextureProperty Property; // 0x98
};

struct UPlayFabExperimentationAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x110
	UPlayFabJsonObject* RequestJsonObj; // 0x118
	UPlayFabJsonObject* ResponseJsonObj; // 0x120
};

struct UMaterialExpressionTwoSidedSign : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UGameItem : UObject {
	FScriptMulticastDelegate SignalIntStatChanged; // 0x30
	FScriptMulticastDelegate SignalFloatStatChanged; // 0x40
	FScriptMulticastDelegate SignalEnableStateChanged; // 0x50
	FScriptMulticastDelegate SignalForceUnequip; // 0x60
	FScriptMulticastDelegate SignalIconChanged; // 0x70
	FScriptMulticastDelegate SignalIconLayersChanged; // 0x80
	FScriptMulticastDelegate SignalColorChanged; // 0x90
	FScriptMulticastDelegate SignalBorderChanged; // 0xa0
	FScriptMulticastDelegate SignalVisualMeshLoaded; // 0xb0
	FScriptMulticastDelegate SignalRepairCompleted; // 0xc0
	FScriptMulticastDelegate SignalVisualObjectClassLoaded; // 0xd0
	TArray<FGameItemStatModification> StatModifications; // 0xe0
	UDestructibleMesh* ActualDestructibleMesh; // 0x100
	AInventoryItemBase* VisualActor; // 0x108
	AActor* OwnerActor; // 0x110
	float RepairPercentPerTick; // 0x118
	int32_t m_MapMarkerIconID; // 0x11c
	int32_t templateID; // 0x120
	UTexture2D* m_ActualIcon; // 0x130
	TArray<UTexture2D*> m_ActualLayeredIcons; // 0x138
	UTexture2D* m_BorderIcon; // 0x148
	UObject* VisualObjectClass; // 0x200
	UItemInventory* m_OwnerInventory; // 0x208
	bool m_IsEnabled; // 0x244
	bool CanUseWhileClimbing; // 0x246
	EGameItemType TypeID; // 0x247
};

struct UPaperTerrainMaterial : UDataAsset {
	TArray<FPaperTerrainMaterialRule> Rules; // 0x28
	UPaperSprite* InteriorFill; // 0x38
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0x100
	char bIgnoreTimeDilation : 1; // 0x1e0
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ACacheModule : AActor {
	TMap<UObject*, float> CachedItems; // 0x3d0
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0x940
	TArray<FFractureEffect> FractureEffects; // 0x948
	bool bEnableHardSleeping; // 0x958
	float LargeChunkThreshold; // 0x95c
	FScriptMulticastDelegate OnComponentFracture; // 0x970
};

struct UNavArea_Doorway : UNavArea {
	float DefaultCost; // 0x28
	float FixedAreaEnteringCost; // 0x2c
	FColor DrawColor; // 0x30
	FNavAgentSelector SupportedAgents; // 0x34
	char bSupportsAgent0 : 1; // 0x38
	char bSupportsAgent1 : 1; // 0x38
	char bSupportsAgent2 : 1; // 0x38
	char bSupportsAgent3 : 1; // 0x38
	char bSupportsAgent4 : 1; // 0x38
	char bSupportsAgent5 : 1; // 0x38
	char bSupportsAgent6 : 1; // 0x38
	char bSupportsAgent7 : 1; // 0x38
	char bSupportsAgent8 : 1; // 0x38
	char bSupportsAgent9 : 1; // 0x38
	char bSupportsAgent10 : 1; // 0x38
	char bSupportsAgent11 : 1; // 0x38
	char bSupportsAgent12 : 1; // 0x38
	char bSupportsAgent13 : 1; // 0x38
	char bSupportsAgent14 : 1; // 0x38
	char bSupportsAgent15 : 1; // 0x38
};

struct UAISense_Blueprint : UAISense {
	UUserDefinedStruct* ListenerDataType; // 0x120
	TArray<UAIPerceptionComponent*> ListenerContainer; // 0x128
	TArray<UAISenseEvent*> UnprocessedEvents; // 0x138
};

struct UPlayFabClientAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa80
	UPlayFabJsonObject* RequestJsonObj; // 0xa88
	UPlayFabJsonObject* ResponseJsonObj; // 0xa90
};

struct USkeleton : UObject {
	TArray<FBoneNode> BoneTree; // 0x28
	TArray<FTransform> RefLocalPoses; // 0x38
	FGuid VirtualBoneGuid; // 0x158
	TArray<FVirtualBone> VirtualBones; // 0x168
	TArray<FSkeletonToMeshLinkup> LinkupCache; // 0x178
	TArray<USkeletalMeshSocket*> Sockets; // 0x188
	FSmartNameContainer SmartNames; // 0x1e8
	TArray<UBlendProfile*> BlendProfiles; // 0x250
	TArray<FAnimSlotGroup> SlotGroups; // 0x260
};

struct UW_SessionInviteEntry_C : USessionInviteEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x490
	UHorizontalBox* ActionsBox; // 0x498
	UW_ButtonCustom_C* B_AcceptSessionInvite; // 0x4a0
	UW_ButtonCustom_C* B_BlockFriend; // 0x4a8
	UW_ButtonCustom_C* B_DeclineSessionInvite; // 0x4b0
	UW_ButtonCustom_C* B_RevokeSessionInvite; // 0x4b8
	UBorder* Container; // 0x4c0
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x148
	FText HintText; // 0x160
	DelegateProperty HintTextDelegate; // 0x178
	FEditableTextBoxStyle WidgetStyle; // 0x188
	FTextBlockStyle TextStyle; // 0x9f8
	bool AllowContextMenu; // 0xc00
	USlateWidgetStyleAsset* Style; // 0xc08
	FSlateFontInfo Font; // 0xc10
	FLinearColor ForegroundColor; // 0xc78
	FLinearColor BackgroundColor; // 0xc88
	FLinearColor ReadOnlyForegroundColor; // 0xc98
	FScriptMulticastDelegate OnTextChanged; // 0xca8
	FScriptMulticastDelegate OnTextCommitted; // 0xcb8
	bool IsReadOnly; // 0xcc8
};

struct UMovieSceneFolder : UObject {
	FName FolderName; // 0x28
	TArray<UMovieSceneFolder*> ChildFolders; // 0x30
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x40
	TArray<FString> ChildObjectBindingStrings; // 0x50
};

struct UMaterialExpressionCustomOutput : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UMaterialExpressionMaterialProxyReplace : UMaterialExpression {
	FExpressionInput realTime; // 0x60
	FExpressionInput MaterialProxy; // 0x98
};

struct UConanIpConnection : UIpConnection {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMap; // 0x60
	TArray<UChannel*> OpenChannels; // 0x68
	TArray<AActor*> SentTemporaries; // 0x78
	AActor* ViewTarget; // 0x88
	AActor* OwningActor; // 0x90
	int32_t MaxPacket; // 0x98
	char InternalAck : 1; // 0x9c
	TArray<UObject*> AsyncLoadedObjects; // 0xa0
	FUniqueNetIdRepl PlayerId; // 0x170
	double LastReceiveTime; // 0x200
	TMap<AActor*, UActorChannel*> ActorChannels; // 0x334e0
	TArray<UChannel*> ChannelsToTick; // 0x33730
};

struct UW_ButtonLarge_C : UW_FCButton_C {
	UNamedSlot* ButtonOverlay; // 0xc28
	UNamedSlot* CheckboxOverlay; // 0xc30
	UW_HotkeyIcon_C* HotkeyIcon; // 0xc38
	UMenuAnchor* MenuAnchor; // 0xc40
};

struct UParticleModuleOrientationBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UTableViewBase : UWidget {
	bool bIsVariable; // 0x28
	bool bCreatedByConstructionScript; // 0x29
	UPanelSlot* Slot; // 0x30
	bool bIsEnabled; // 0x38
	DelegateProperty bIsEnabledDelegate; // 0x40
	FText ToolTipText; // 0x50
	DelegateProperty ToolTipTextDelegate; // 0x68
	UWidget* TooltipWidget; // 0x78
	DelegateProperty ToolTipWidgetDelegate; // 0x80
	ESlateVisibility Visiblity; // 0x90
	ESlateVisibility Visibility; // 0x91
	DelegateProperty VisibilityDelegate; // 0x98
	char bOverride_Cursor : 1; // 0xa8
	EMouseCursor Cursor; // 0xac
	bool bIsVolatile; // 0xad
	FWidgetTransform RenderTransform; // 0xb0
	FVector2D RenderTransformPivot; // 0xcc
	UWidgetNavigation* Navigation; // 0xd8
	TArray<UPropertyBinding*> NativeBindings; // 0x108
};

struct UPeerConnectionNetConnection : UIpConnection {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMap; // 0x60
	TArray<UChannel*> OpenChannels; // 0x68
	TArray<AActor*> SentTemporaries; // 0x78
	AActor* ViewTarget; // 0x88
	AActor* OwningActor; // 0x90
	int32_t MaxPacket; // 0x98
	char InternalAck : 1; // 0x9c
	TArray<UObject*> AsyncLoadedObjects; // 0xa0
	FUniqueNetIdRepl PlayerId; // 0x170
	double LastReceiveTime; // 0x200
	TMap<AActor*, UActorChannel*> ActorChannels; // 0x334e0
	TArray<UChannel*> ChannelsToTick; // 0x33730
};

struct UMovieSceneSlomoTrack : UMovieSceneFloatTrack {
	FName PropertyName; // 0xb8
	FString PropertyPath; // 0xc0
	TArray<UMovieSceneSection*> Sections; // 0xd0
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x88
};

struct UPlayerSurveyDialog : UWindowRoot {
	FText SurveyTitle; // 0x398
	FText SurveyMessage; // 0x3b0
	FString SurveyBaseURL; // 0x3c8
	UMessageBoxWidget* MessageBox; // 0x3d8
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x6c0
};

struct UMaterialExpressionScreenPosition : UMaterialExpression {
	EMaterialExpressionScreenPositionMapping mapping; // 0x60
};

struct UW_DiscoveryFIFOMessageView_C : UFIFOMessageView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x358
	UWidgetAnimation* FadeInOut; // 0x360
	UImage* ASSIGNED_IN_CODE__fifo_blood_3; // 0x368
	UImage* ASSIGNED_IN_CODE__fifo_blood_4; // 0x370
	UTextBlock* Header; // 0x378
	UMultiLineEditableTextBox* Text; // 0x380
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct UFCButton : URootWidget {
	FText Label; // 0x318
	ETextJustify LabelJustification; // 0x330
	FName KeyShortcutName; // 0x338
	FName GamepadKeyShortcutName; // 0x340
	FKey GamepadIconKey; // 0x348
	bool ShowOnlyGamepadIcon; // 0x360
	FFCButtonStyle Style; // 0x368
	bool IsCheckable; // 0xa28
	bool ToggleWhenClicked; // 0xa29
	EFCButtonToggleAction ToggleAction; // 0xa2a
	bool IsChecked; // 0xa2b
	FSlateFontInfo LabelFont; // 0xa30
	FSlateColor HoveredFontColor; // 0xa98
	FSlateColor PressedFontColor; // 0xac0
	FSlateColor PressedHoveredFontColor; // 0xae8
	FSlateColor FontColor; // 0xb10
	FScriptMulticastDelegate SignalClicked; // 0xb50
	FScriptMulticastDelegate SignalPressed; // 0xb60
	FScriptMulticastDelegate SignalReleased; // 0xb70
	FScriptMulticastDelegate SignalToggled; // 0xb80
	FScriptMulticastDelegate SignalMouseEnter; // 0xb90
	FScriptMulticastDelegate SignalMouseLeave; // 0xba0
	UMenuAnchor* m_MenuAnchor; // 0xbe0
	TArray<UFCButton*> m_SubButtons; // 0xc00
};

struct UPhysicsHandleComponent : UActorComponent {
	UPrimitiveComponent* GrabbedComponent; // 0xf8
	char bSoftAngularConstraint : 1; // 0x10c
	char bSoftLinearConstraint : 1; // 0x10c
	char bInterpolateTarget : 1; // 0x10c
	float LinearDamping; // 0x110
	float LinearStiffness; // 0x114
	float AngularDamping; // 0x118
	float AngularStiffness; // 0x11c
	float InterpolationSpeed; // 0x180
};

struct USubtitleEntryView : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UParticleModuleAcceleration : UParticleModuleAccelerationBase {
	FRawDistributionVector Acceleration; // 0x38
	char bApplyOwnerScale : 1; // 0x88
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x3d0
};

struct UMaterialExpressionTextureCoordinate : UMaterialExpression {
	int32_t CoordinateIndex; // 0x60
	float UTiling; // 0x64
	float VTiling; // 0x68
	char UnMirrorU : 1; // 0x6c
	char UnMirrorV : 1; // 0x6c
};

struct UParticleModuleSubUVBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xc8
	float StartOffset; // 0xd0
	float AudioStartTime; // 0xd4
	float AudioDilationFactor; // 0xd8
	float AudioVolume; // 0xdc
	FRichCurve SoundVolume; // 0xe0
	FRichCurve PitchMultiplier; // 0x150
	bool bSuppressSubtitles; // 0x1c0
};

struct URconCommandObject : UObject {
	FName RconCommandName; // 0x28
	FString RconHelpString; // 0x30
};

struct ULandscapeHeightfieldCollisionComponent : UPrimitiveComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x6c0
	int32_t SectionBaseX; // 0x6d0
	int32_t SectionBaseY; // 0x6d4
	int32_t CollisionSizeQuads; // 0x6d8
	float CollisionScale; // 0x6dc
	int32_t SimpleCollisionSizeQuads; // 0x6e0
	TArray<char> CollisionQuadFlags; // 0x6e8
	FGuid HeightfieldGuid; // 0x6f8
	FBox CachedLocalBox; // 0x708
	ULandscapeComponent* RenderComponent; // 0x724
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x750
};

struct UDemoNetConnection : UNetConnection {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMap; // 0x60
	TArray<UChannel*> OpenChannels; // 0x68
	TArray<AActor*> SentTemporaries; // 0x78
	AActor* ViewTarget; // 0x88
	AActor* OwningActor; // 0x90
	int32_t MaxPacket; // 0x98
	char InternalAck : 1; // 0x9c
	TArray<UObject*> AsyncLoadedObjects; // 0xa0
	FUniqueNetIdRepl PlayerId; // 0x170
	double LastReceiveTime; // 0x200
	TMap<AActor*, UActorChannel*> ActorChannels; // 0x334e0
	TArray<UChannel*> ChannelsToTick; // 0x33730
};

struct ULightmappedSurfaceCollection : UObject {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UMaterialExpressionArccosine : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FRichCurve FloatCurve; // 0xd0
};

struct UTextPropertyTestObject : UObject {
	FText DefaultedText; // 0x28
	FText UndefaultedText; // 0x40
	FText TransientText; // 0x58
};

struct APlaneReflectionCapture : AReflectionCapture {
	UReflectionCaptureComponent* CaptureComponent; // 0x3d0
};

struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	FGameplayTagQuery TagQueryToMatch; // 0x1c0
	bool bUpdatedToUseQuery; // 0x208
	EGameplayContainerMatchType TagsToMatch; // 0x209
	FGameplayTagContainer GameplayTags; // 0x210
};

struct UMaterialExpressionStaticBool : UMaterialExpression {
	char Value : 1; // 0x60
};

struct UAnimNotifyState : UObject {
	bool bDefaultTriggerOnDedicatedServer; // 0x28
};

struct UAISense_Hearing : UAISense {
	TArray<FAINoiseEvent> NoiseEvents; // 0x120
	float SpeedOfSoundSq; // 0x130
};

struct USceneCaptureComponentWater : USceneCaptureComponentImprints {
	UTextureRenderTarget2D* FluidNormalMap; // 0x460
	UTexture* FlowTexture; // 0x468
	float FlowTextureTiling; // 0x470
	float VorticityAmount; // 0x474
	float ColourDecay; // 0x478
	float DensityDecay; // 0x47c
	float VelocityDecay; // 0x480
	char Wrapping : 1; // 0x484
	char OutputNormals : 1; // 0x484
	char UseUniqueTextureSet : 1; // 0x484
	FVector2D WindA; // 0x488
	FVector2D WindB; // 0x490
	FColor InjectionColourA; // 0x498
	float ColourScaleA; // 0x49c
	FColor InjectionColourB; // 0x4a0
	float ColourScaleB; // 0x4a4
	float PressureScaleA; // 0x4a8
	float PressureScaleB; // 0x4ac
	float WindScale; // 0x4b0
	float WindGustFactorA; // 0x4b4
	float WindGustFactorB; // 0x4b8
};

struct UBTDecorator_BlueprintBase : UBTDecorator {
	AAIController* AIOwner; // 0x68
	AActor* ActorOwner; // 0x70
	TArray<FName> ObservedKeyNames; // 0x78
	char bShowPropertyDetails : 1; // 0x98
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0x98
	char bIsObservingBB : 1; // 0x98
};

struct UFuncTestRenderingComponent : UPrimitiveComponent {
	float MinDrawDistance; // 0x308
	float LDMaxDrawDistance; // 0x30c
	float CachedMaxDrawDistance; // 0x310
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x314
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x315
	char bAlwaysCreatePhysicsState : 1; // 0x318
	char bGenerateOverlapEvents : 1; // 0x318
	char bForceGenerateOverlapEvents : 1; // 0x318
	char bMultiBodyOverlap : 1; // 0x318
	char bCheckAsyncSceneOnMove : 1; // 0x318
	char bTraceComplexOnMove : 1; // 0x318
	char bReturnMaterialOnMove : 1; // 0x318
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x318
	char bAllowCullDistanceVolume : 1; // 0x318
	char bHasMotionBlurVelocityMeshes : 1; // 0x318
	char bVisibleInReflectionCaptures : 1; // 0x318
	char bRenderInMainPass : 1; // 0x318
	char bRenderInMono : 1; // 0x318
	char bReceivesDecals : 1; // 0x318
	char bOwnerNoSee : 1; // 0x318
	char bOnlyOwnerSee : 1; // 0x318
	char bTreatAsBackgroundForOcclusion : 1; // 0x318
	char bHeightOutputReferenceSand : 1; // 0x318
	char bHeightOutputReferenceWater : 1; // 0x318
	char bHeightOutputIgnoreSand : 1; // 0x318
	char bHeightOutputIgnoreWater : 1; // 0x318
	char bCullFromDistantShadowCascades : 1; // 0x318
	char bUseAsOccluder : 1; // 0x318
	char bSelectable : 1; // 0x318
	char bForceMipStreaming : 1; // 0x318
	char bHasPerInstanceHitProxies : 1; // 0x318
	char CastShadow : 1; // 0x318
	char bAffectDynamicIndirectLighting : 1; // 0x318
	char bAffectDistanceFieldLighting : 1; // 0x318
	char bCastDynamicShadow : 1; // 0x318
	char bCastStaticShadow : 1; // 0x318
	char bCastVolumetricTranslucentShadow : 1; // 0x318
	char bSelfShadowOnly : 1; // 0x31c
	char bCastFarShadow : 1; // 0x31c
	char bCastInsetShadow : 1; // 0x31c
	char bCastCinematicShadow : 1; // 0x31c
	char bCastHiddenShadow : 1; // 0x31c
	char bCastShadowAsTwoSided : 1; // 0x31c
	char bLightAsIfStatic : 1; // 0x31c
	char bLightAttachmentsAsGroup : 1; // 0x31c
	char bReceiveCombinedCSMAndStaticShadowsFromStationaryLights : 1; // 0x31c
	char bSingleSampleShadowFromStationaryLights : 1; // 0x31c
	char bIgnoreRadialImpulse : 1; // 0x31c
	char bIgnoreRadialForce : 1; // 0x31c
	char AlwaysLoadOnClient : 1; // 0x31c
	char AlwaysLoadOnServer : 1; // 0x31c
	char bUseEditorCompositing : 1; // 0x31c
	char bRenderCustomDepth : 1; // 0x31c
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x320
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x321
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x323
	FLightingChannels LightingChannels; // 0x324
	int32_t CustomDepthStencilValue; // 0x328
	int32_t TranslucencySortPriority; // 0x32c
	int32_t VisibilityId; // 0x330
	float LpvBiasMultiplier; // 0x338
	FBodyInstance BodyInstance; // 0x340
	float BoundsScale; // 0x574
	float LastSubmitTime; // 0x578
	float LastRenderTime; // 0x57c
	float LastRenderTimeOnScreen; // 0x580
	TArray<AActor*> MoveIgnoreActors; // 0x588
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x598
	FScriptMulticastDelegate OnComponentHit; // 0x5b8
	FScriptMulticastDelegate OnComponentBeginOverlap; // 0x5c8
	FScriptMulticastDelegate OnComponentEndOverlap; // 0x5d8
	FScriptMulticastDelegate OnComponentWake; // 0x5e8
	FScriptMulticastDelegate OnComponentSleep; // 0x5f8
	FScriptMulticastDelegate OnBeginCursorOver; // 0x608
	FScriptMulticastDelegate OnEndCursorOver; // 0x618
	FScriptMulticastDelegate OnClicked; // 0x628
	FScriptMulticastDelegate OnReleased; // 0x638
	UPrimitiveComponent* LODParentPrimitive; // 0x660
	FPrimitiveComponentPostPhysicsTickFunction PostPhysicsComponentTick; // 0x668
};

struct UListView : UTableViewBase {
	float ItemHeight; // 0x118
	TArray<UObject*> Items; // 0x120
	ESelectionMode SelectionMode; // 0x130
	DelegateProperty OnGenerateRowEvent; // 0x138
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FScriptMulticastDelegate OnCanvasRenderTargetUpdate; // 0xf8
	TWeakObjectPtr<UWorld> World; // 0x108
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x110
};

struct UNiagaraSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x2d8
};

struct UBuildingStressTesterProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate BuildingStressTestAborted; // 0x28
	bool DoneLoadingClasses; // 0xa0
	FVector SpawnLocation; // 0xa4
	FRotator spawnRotation; // 0xb0
	float spawnRadius; // 0xbc
	ESocketDistanceSortMethod sortMethod; // 0xc0
	int32_t NumFoundations; // 0xc4
	int32_t NumOtherPieces; // 0xc8
	bool DestroyAtSameTime; // 0xcc
	FString ListOfIDsToBuildWith; // 0xd0
	URandomBuildingGeneratorProxy* m_FoundationBuilder; // 0xe0
	URandomBuildingGeneratorProxy* m_RandomBuilder; // 0xe8
	bool m_HasAborted; // 0xf0
	bool m_IsBuilding; // 0xf1
};

struct UStreamingSettings : UDeveloperSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	float AsyncIOBandwidthLimit; // 0x48
	char UseBackgroundLevelStreaming : 1; // 0x4c
	char AsyncLoadingUseFullTimeLimit : 1; // 0x4c
	float AsyncLoadingTimeLimit; // 0x50
	float PriorityAsyncLoadingExtraTime; // 0x54
	float LevelStreamingActorsUpdateTimeLimit; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UScaleBox : UContentWidget {
	EStretch Stretch; // 0x130
	EStretchDirection StretchDirection; // 0x131
	float UserSpecifiedScale; // 0x134
	bool IgnoreInheritedScale; // 0x138
	FScriptMulticastDelegate OnDesiredSizeChanged; // 0x140
};

struct URecastNavMeshDataChunk : UNavigationDataChunk {
	FName NavigationDataName; // 0x28
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0xd0
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xe0
	UPawnAction* RecentActionCopy; // 0xe8
};

struct USkeletalMeshReductionSettings : UObject {
	TArray<FSkeletalMeshLODGroupSettings> Settings; // 0x28
};

struct USoundNodeDialoguePlayer : USoundNode {
	FDialogueWaveParameter DialogueWaveParameter; // 0x38
	char bLooping : 1; // 0x58
};

struct UStatHolder : UPersistenceComponent {
	FScriptMulticastDelegate SignalIntStatChanged; // 0x168
	FScriptMulticastDelegate SignalFloatStatChanged; // 0x178
	FStatArrayInt32 m_IntStatArray; // 0x188
	FStatArrayFloat m_FloatStatArray; // 0x258
	TArray<UIntStatChangeSignalNode*> m_IntStatChangeNodeList; // 0x3b8
	TArray<UFloatStatChangeSignalNode*> m_FloatStatChangeNodeList; // 0x3c8
};

struct UMaterialExpressionFontSampleParameter : UMaterialExpressionFontSample {
	FName ParameterName; // 0x70
	FGuid ExpressionGUID; // 0x78
	FName Group; // 0x88
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x38
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x60
	ESceneTextureId SceneTextureId; // 0x98
	bool bClampUVs; // 0x99
	bool bFiltered; // 0x9a
};

struct UFeatWindow : UWindowRoot {
	UFeatResultRecipeInfoView* FeatResultRecipeInfoViewClass; // 0x398
	UFeatGroupView* FeatGroupViewClass; // 0x3a0
	USoundBase* UpgradeSound; // 0x3a8
	float ResultListItemSpacing; // 0x3c8
	float RecipeListPageScrollOffset; // 0x3cc
	FLinearColor BackgroundColorNotPurchaseable; // 0x3d0
	FLinearColor BackgroundColorPurchaseable; // 0x3e0
	FLinearColor BackgroundColorPurchased; // 0x3f0
	FLinearColor FrameColorIsBlocking; // 0x400
	FLinearColor FrameColorIsUnlocking; // 0x410
	UTexture2D* BorderOpen; // 0x420
	UTexture2D* BorderNotPurchaseable; // 0x428
	UTexture2D* BorderPurchaseable; // 0x430
	TArray<UFeatGroupView*> m_FeatGroupViews; // 0x4e8
	TArray<FFeatGroupNode> m_FeatGroups; // 0x4f8
	TArray<FFeatGroupNode> m_CornerStoneGroups; // 0x508
	TArray<UFeatResultRecipeInfoView*> m_RewardList; // 0x518
	UItemInventory* m_DependencyInventory; // 0x528
	UItemInventory* m_FeatsInventory; // 0x530
	UObjectPool* m_FeatsItemIconPool; // 0x538
	UObjectPool* m_FeatsItemSlotPool; // 0x540
	TArray<UFeatItem*> m_FeatList; // 0x548
};

struct UMaterialExpressionPixelDepth : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UMaterialExpressionDesaturation : UMaterialExpression {
	FExpressionInput Input; // 0x60
	FExpressionInput Fraction; // 0x98
	FLinearColor LuminanceFactors; // 0xd0
};

struct UKeyBindingsKeyBase : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct USoundEffectLowPassFilterPreset : USoundEffectSourcePreset {
	FSoundEffectLowPassFilterSettings Settings; // 0x40
};

struct UChestInventoryGUI : UWindowRoot {
	UItemInventory* m_ChestInventory; // 0x3a8
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UMovieSceneCinematicShotTrack : UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> Sections; // 0xb8
};

struct UTextBlock : UTextLayoutWidget {
	FText Text; // 0x148
	DelegateProperty TextDelegate; // 0x160
	FSlateColor ColorAndOpacity; // 0x170
	DelegateProperty ColorAndOpacityDelegate; // 0x198
	FSlateFontInfo Font; // 0x1a8
	FVector2D ShadowOffset; // 0x210
	FLinearColor ShadowColorAndOpacity; // 0x218
	DelegateProperty ShadowColorAndOpacityDelegate; // 0x228
	float MinDesiredWidth; // 0x238
	bool bWrapWithInvalidationPanel; // 0x23c
};

struct AMountInput : AActor {
	AConanCharacter* Player; // 0x3d0
	float MaxForwardAngle; // 0x3d8
	float MaxLeanTurnAngle; // 0x3dc
	float MaxSteepTurnAngle; // 0x3e0
	float MinSteerBackAngle; // 0x3e4
	float MinStraightBackAngle; // 0x3e8
	float SteepTurnAccelRateFactor; // 0x3ec
	float TimeBeforeReleasingJoystickCounts; // 0x3f0
	bool IsDismounting; // 0x3f4
	bool IsInputDisabled; // 0x3f5
	bool EnableAutorun; // 0x3f6
	bool IsInSteepTurn; // 0x3f7
	EToggleInput CurrentToggleInput; // 0x3f8
	bool Debug_Break; // 0x3f9
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x68
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct APostProcessVolume : AVolume {
	FPostProcessSettings Settings; // 0x410
	float Priority; // 0x8e0
	float BlendRadius; // 0x8e4
	float BlendWeight; // 0x8e8
	char bEnabled : 1; // 0x8ec
	char bUnbound : 1; // 0x8ec
};

struct UReflectionCaptureComponent : USceneComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x300
	EReflectionSourceType ReflectionSourceType; // 0x308
	UTextureCube* Cubemap; // 0x310
	float SourceCubemapAngle; // 0x318
	float Brightness; // 0x31c
	FVector CaptureOffset; // 0x320
	FGuid StateId; // 0x350
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x38
	FSoundAttenuationSettings AttenuationOverrides; // 0x40
	char bOverrideAttenuation : 1; // 0x158
};

struct USettingsServerBase : USubSettingsMaster {
	bool m_CoopTetheringLimitIsPlayerModifiable; // 0x328
	float MaxPasswordLength; // 0x32c
	UFCButton* m_LastSelectedCatButton; // 0x330
};

struct UStatIntArray : UObject {
	FName Key; // 0x28
	TArray<FStatIntEntry> Stats; // 0x30
};

struct USoundNodeMature : USoundNode {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UInterpTrackSlomo : UInterpTrackFloatBase {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UPlayFabRuntimeSettings : UObject {
	FString ProductionEnvironmentURL; // 0x28
	FString TitleId; // 0x38
	FString DeveloperSecretKey; // 0x48
};

struct UW_TooltipOverlay_C : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UPlayFabAuthenticationContext : UObject {
	FString ClientSessionTicket; // 0x28
	FString EntityToken; // 0x38
	FString DeveloperSecretKey; // 0x48
	FString PlayFabId; // 0x58
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x3e0
};

struct UWorld : UObject {
	ULevel* PersistentLevel; // 0x30
	UNetDriver* NetDriver; // 0x38
	ULineBatchComponent* LineBatcher; // 0x40
	ULineBatchComponent* PersistentLineBatcher; // 0x48
	ULineBatchComponent* ForegroundLineBatcher; // 0x50
	AGameNetworkManager* NetworkManager; // 0x58
	UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60
	TArray<UObject*> ExtraReferencedObjects; // 0x68
	TArray<UObject*> PerModuleDataObjects; // 0x78
	TArray<ULevelStreaming*> StreamingLevels; // 0x88
	FString StreamingLevelsPrefix; // 0x98
	ULevel* CurrentLevelPendingVisibility; // 0xa8
	ULevel* CurrentLevelPendingInvisibility; // 0xb0
	UDemoNetDriver* DemoNetDriver; // 0xb8
	AParticleEventManager* MyParticleEventManager; // 0xc0
	APhysicsVolume* DefaultPhysicsVolume; // 0xc8
	UNavigationSystem* NavigationSystem; // 0xe8
	AGameModeBase* AuthorityGameMode; // 0xf0
	AGameStateBase* GameState; // 0xf8
	UAISystemBase* AISystem; // 0x100
	UAvoidanceManager* AvoidanceManager; // 0x108
	TArray<ULevel*> Levels; // 0x110
	TArray<FLevelCollection> LevelCollections; // 0x120
	ULevel* CurrentLevel; // 0x138
	UGameInstance* OwningGameInstance; // 0x140
	TArray<UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x148
	UCanvas* CanvasForRenderingToTarget; // 0x158
	UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x160
	UWorldComposition* WorldComposition; // 0x938
	char bAreConstraintsDirty : 1; // 0x988
};

struct UCharacterRecustomizationBase : UWindowRoot {
	bool CanRandomize; // 0x398
};

struct UW_Friends_FriendList_C : UFriendListGame {
	UW_NavigatableVerticalBox_C* FriendListEntryList; // 0x3c8
};

struct UUICharacterDisplay : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UInterpCurveEdSetup : UObject {
	TArray<FCurveEdTab> Tabs; // 0x28
	int32_t ActiveTab; // 0x38
};

struct UNavFilter_AIControllerDefault : UNavigationQueryFilter {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UWindDirectionalSourceComponent : USceneComponent {
	float Strength; // 0x300
	float Speed; // 0x304
	float MinGustAmount; // 0x308
	float MaxGustAmount; // 0x30c
	float Radius; // 0x310
	char bPointWind : 1; // 0x314
};

struct UEdGraph : UObject {
	UEdGraphSchema* Schema; // 0x28
	TArray<UEdGraphNode*> Nodes; // 0x30
	char bEditable : 1; // 0x40
	char bAllowDeletion : 1; // 0x40
	char bAllowRenaming : 1; // 0x40
};

struct UFeatItem : UGameItem {
	bool ShowInFeatWindow; // 0x248
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x6c0
	FInterpCurveVector SplineInfo; // 0x720
	FInterpCurveQuat SplineRotInfo; // 0x738
	FInterpCurveVector SplineScaleInfo; // 0x750
	FInterpCurveFloat SplineReparamTable; // 0x768
	bool bAllowSplineEditingPerInstance; // 0x780
	int32_t ReparamStepsPerSegment; // 0x784
	float Duration; // 0x788
	bool bStationaryEndpoints; // 0x78c
	bool bSplineHasBeenEdited; // 0x78d
	bool bModifiedByConstructionScript; // 0x78e
	bool bInputSplinePointsToConstructionScript; // 0x78f
	bool bDrawDebug; // 0x790
	bool bClosedLoop; // 0x791
	bool bLoopPositionOverride; // 0x792
	float LoopPosition; // 0x794
	FVector DefaultUpVector; // 0x798
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x3d0
	FColor BrushColor; // 0x3d4
	int32_t PolyFlags; // 0x3d8
	char bColored : 1; // 0x3dc
	char bSolidWhenSelected : 1; // 0x3dc
	char bPlaceableFromClassBrowser : 1; // 0x3dc
	char bNotForClientOrServer : 1; // 0x3dc
	UModel* Brush; // 0x3e0
	UBrushComponent* BrushComponent; // 0x3e8
	char bInManipulation : 1; // 0x3f0
	TArray<FGeomSelection> SavedSelections; // 0x3f8
};

struct UInterpTrackInstSlomo : UInterpTrackInst {
	float OldTimeDilation; // 0x28
};

struct UThrallRecipeItem : URecipeItem {
	UThrallItem* SourceThrallItem; // 0x2c0
	int32_t SourceThrallItemIndex; // 0x2c8
	EInventoryType SourceThrallInventoryType; // 0x2cc
	FText Name; // 0x2d0
	UTexture2D* Icon; // 0x2e8
};

struct UBoneMaskFilter : UObject {
	TArray<FInputBlendPose> BlendPoses; // 0x28
};

struct UNavArea_Default : UNavArea {
	float DefaultCost; // 0x28
	float FixedAreaEnteringCost; // 0x2c
	FColor DrawColor; // 0x30
	FNavAgentSelector SupportedAgents; // 0x34
	char bSupportsAgent0 : 1; // 0x38
	char bSupportsAgent1 : 1; // 0x38
	char bSupportsAgent2 : 1; // 0x38
	char bSupportsAgent3 : 1; // 0x38
	char bSupportsAgent4 : 1; // 0x38
	char bSupportsAgent5 : 1; // 0x38
	char bSupportsAgent6 : 1; // 0x38
	char bSupportsAgent7 : 1; // 0x38
	char bSupportsAgent8 : 1; // 0x38
	char bSupportsAgent9 : 1; // 0x38
	char bSupportsAgent10 : 1; // 0x38
	char bSupportsAgent11 : 1; // 0x38
	char bSupportsAgent12 : 1; // 0x38
	char bSupportsAgent13 : 1; // 0x38
	char bSupportsAgent14 : 1; // 0x38
	char bSupportsAgent15 : 1; // 0x38
};

struct ADWLevelScriptActor : ALevelScriptActor {
	char bInputEnabled : 1; // 0x3d0
};

struct ANavigationGraphNode : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UCanvas : UObject {
	float OrgX; // 0x28
	float OrgY; // 0x2c
	float ClipX; // 0x30
	float ClipY; // 0x34
	FColor DrawColor; // 0x38
	char bCenterX : 1; // 0x3c
	char bCenterY : 1; // 0x3c
	char bNoSmooth : 1; // 0x3c
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FPlane ColorModulate; // 0x50
	UTexture2D* DefaultTexture; // 0x60
	UTexture2D* GradientTexture0; // 0x68
	UReporterGraph* ReporterGraph; // 0x70
};

struct UGetUserUniqueIDCallProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FRichCurve TopCurve; // 0xd0
	FRichCurve LeftCurve; // 0x140
	FRichCurve RightCurve; // 0x1b0
	FRichCurve BottomCurve; // 0x220
};

struct UPlayFabMatchmakerAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xd0
	UPlayFabJsonObject* RequestJsonObj; // 0xd8
	UPlayFabJsonObject* ResponseJsonObj; // 0xe0
};

struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UMaterialExpressionLandscapeVisibilityMask : UMaterialExpression {
	FGuid ExpressionGUID; // 0x60
};

struct UMovieSceneByteTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xe0
};

struct UFollowersViewBase : UWindowRoot {
	UFollowersBoardBase* m_FollowersBoard; // 0x398
	UFCButton* m_RefreshWindow; // 0x3a0
	UFCButton* m_UntrackAll; // 0x3a8
	UWidget* m_BottomContainer; // 0x3b0
};

struct UQuickLootPanel : URootWidget {
	bool m_HasOwnership; // 0x318
	USoundBase* LootOneSound; // 0x320
	USoundBase* LootAllSound; // 0x340
	AActor* m_Actor; // 0x360
};

struct UServerRentalServerSetupBase : UWindowRoot {
	FScriptMulticastDelegate OnShowPopup; // 0x398
	FScriptMulticastDelegate OnRecievedAllData; // 0x3a8
	FScriptMulticastDelegate OnSetupClosing; // 0x3c0
	UServerRentalRequestConnection* m_ServerRentalRequestConnection; // 0x3d0
	EServerRentalSetupType m_SetupType; // 0x3d8
};

struct UFIFOWindow : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x60
	int32_t SizeY; // 0x64
	FString Text; // 0x68
	FLinearColor CommentColor; // 0x78
};

struct UItemTemperatureBar : URootWidget {
	int32_t NumBars; // 0x370
	UTexture2D* ColdIcon; // 0x378
	UTexture2D* ColdBar; // 0x398
	UTexture2D* HeatIcon; // 0x3b8
	UTexture2D* HeatBar; // 0x3d8
	UTexture2D* EmptyBar; // 0x3f8
	UGameItem* m_GameItem; // 0x420
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct ATriggerBase : AActor {
	UShapeComponent* CollisionComponent; // 0x3d0
	UBillboardComponent* SpriteComponent; // 0x3d8
};

struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct UPaperSprite : UObject {
	FVector2D SourceUV; // 0x38
	FVector2D SourceDimension; // 0x40
	UTexture2D* SourceTexture; // 0x48
	TArray<UTexture*> AdditionalSourceTextures; // 0x50
	FVector2D BakedSourceUV; // 0x60
	FVector2D BakedSourceDimension; // 0x68
	UTexture2D* BakedSourceTexture; // 0x70
	UMaterialInterface* DefaultMaterial; // 0x78
	UMaterialInterface* AlternateMaterial; // 0x80
	TArray<FPaperSpriteSocket> Sockets; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x98
	float PixelsPerUnrealUnit; // 0x9c
	UBodySetup* BodySetup; // 0xa0
	int32_t AlternateMaterialSplitIndex; // 0xa8
	TArray<FVector4> BakedRenderData; // 0xb0
};

struct UGraniteTextureCube : UGraniteTexture {
	float StreamingBias; // 0x28
	UGraniteTileSet* TileSet; // 0x30
	FString StreamingTexture; // 0x38
	float LODBias; // 0x48
	FGraniteLightmapFlags lightMapFlags; // 0x4c
	FString GTSFileName; // 0xf0
	FGuid Guid; // 0x100
};

struct UImprintReceiverComponent : USceneComponent {
	int32_t QualityLevel; // 0x300
	TArray<UStaticMesh*> QualityLevelMeshes; // 0x308
	TArray<UMaterial*> QualityLevelMaterials; // 0x318
	FName MaskTextureParameterName; // 0x328
	FName MaskParamsParameterName; // 0x330
	UStaticMeshComponent* Meshes[0x9]; // 0x338
};

struct UReverbEffect : UObject {
	float Density; // 0x28
	float Diffusion; // 0x2c
	float Gain; // 0x30
	float GainHF; // 0x34
	float DecayTime; // 0x38
	float DecayHFRatio; // 0x3c
	float ReflectionsGain; // 0x40
	float ReflectionsDelay; // 0x44
	float LateGain; // 0x48
	float LateDelay; // 0x4c
	float AirAbsorptionGainHF; // 0x50
	float RoomRolloffFactor; // 0x54
};

struct UPlayerMarkerDialog : UWindowRoot {
	TArray<UTexture2D*> Icons; // 0x398
};

struct USpinBox : UWidget {
	float Value; // 0x118
	DelegateProperty ValueDelegate; // 0x120
	FSpinBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x440
	float Delta; // 0x448
	float SliderExponent; // 0x44c
	FSlateFontInfo Font; // 0x450
	float MinDesiredWidth; // 0x4b8
	bool ClearKeyboardFocusOnCommit; // 0x4bc
	bool SelectAllTextOnCommit; // 0x4bd
	FSlateColor ForegroundColor; // 0x4c0
	FScriptMulticastDelegate OnValueChanged; // 0x4e8
	FScriptMulticastDelegate OnValueCommitted; // 0x4f8
	FScriptMulticastDelegate OnBeginSliderMovement; // 0x508
	FScriptMulticastDelegate OnEndSliderMovement; // 0x518
	char bOverride_MinValue : 1; // 0x528
	char bOverride_MaxValue : 1; // 0x528
	char bOverride_MinSliderValue : 1; // 0x528
	char bOverride_MaxSliderValue : 1; // 0x528
	float MinValue; // 0x52c
	float MaxValue; // 0x530
	float MinSliderValue; // 0x534
	float MaxSliderValue; // 0x538
};

struct AStaticMeshActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x3d0
	bool bStaticMeshReplicateMovement; // 0x3d8
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x3d9
};

struct UParticleSystemComponent : UPrimitiveComponent {
	UParticleSystem* Template; // 0x6c0
	TArray<UMaterialInterface*> EmitterMaterials; // 0x6c8
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x6d8
	char bResetOnDetach : 1; // 0x6e8
	char bUpdateOnDedicatedServer : 1; // 0x6e8
	char bAllowRecycling : 1; // 0x6e8
	char bAutoManageAttachment : 1; // 0x6e8
	EParticleSignificanceLevel RequiredSignificance; // 0x6ec
	TArray<FParticleSysParam> InstanceParameters; // 0x6f8
	FScriptMulticastDelegate OnParticleSpawn; // 0x708
	FScriptMulticastDelegate OnParticleBurst; // 0x718
	FScriptMulticastDelegate OnParticleDeath; // 0x728
	FScriptMulticastDelegate OnParticleCollide; // 0x738
	FVector OldPosition; // 0x748
	FVector PartSysVelocity; // 0x754
	float WarmupTime; // 0x760
	float WarmupTickRate; // 0x764
	char bWarmingUp : 1; // 0x768
	float SecondsBeforeInactive; // 0x774
	float MaxTimeBeforeForceUpdateTransform; // 0x780
	char bOverrideLODMethod : 1; // 0x788
	ParticleSystemLODMethod LODMethod; // 0x78c
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x790
	TArray<UParticleSystemReplay*> ReplayClips; // 0x7b0
	float CustomTimeDilation; // 0x820
	FScriptMulticastDelegate OnSystemFinished; // 0x828
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x838
	FName AutoAttachSocketName; // 0x840
	EAttachLocation AutoAttachLocationType; // 0x848
	EAttachmentRule AutoAttachLocationRule; // 0x849
	EAttachmentRule AutoAttachRotationRule; // 0x84a
	EAttachmentRule AutoAttachScaleRule; // 0x84b
};

struct APaperTileMapActor : AActor {
	UPaperTileMapComponent* RenderComponent; // 0x3d0
};

struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x828
	int32_t InstancingRandomSeed; // 0x838
	int32_t InstanceStartCullDistance; // 0x83c
	int32_t InstanceEndCullDistance; // 0x840
	TArray<int32_t> InstanceReorderTable; // 0x848
	TArray<int32_t> RemovedInstances; // 0x858
	UPhysicsSerializer* PhysicsSerializer; // 0x898
	int32_t NumPendingLightmaps; // 0x8b4
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x8b8
};

struct UFrameRateReporter : UFrameRateTracker {
	FString ScopeName; // 0x50
	bool Compact; // 0x60
	EDebugLevel DebugLevel; // 0x61
};

struct UEditableGameplayTagQueryExpression_NoExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UCameraShake : UObject {
	char bSingleInstance : 1; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	FROscillator RotOscillation; // 0x38
	FVOscillator LocOscillation; // 0x5c
	FFOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	UCameraAnim* anim; // 0xa0
	char bRandomAnimSegment : 1; // 0xa8
	APlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	UCameraAnimInst* AnimInst; // 0x150
};

struct UKeyBindingsCommandBase : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UHarvestFoliage : UInteractableFoliageBase {
	AHarvestFoliageSystem* HarvestSystem; // 0xb80
};

struct UMaterialExpressionCustom : UMaterialExpression {
	FString code; // 0x60
	ECustomMaterialOutputType OutputType; // 0x70
	FString Description; // 0x78
	TArray<FCustomInput> Inputs; // 0x88
};

struct UParticleModuleRotationBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UPS4GraniteSettings : UObject {
	TArray<FGraniteCpuCache> CPUCaches; // 0x30
	TArray<FGraniteGpuCache> GPUCaches; // 0x40
	int32_t MaximumTileDataUpload; // 0x50
	int32_t MaximumResolves; // 0x54
	int32_t GpuMemorySizeInMegabyte; // 0x58
	int32_t CpuMemorySizeInMegabyte; // 0x5c
	char bAdvanced : 1; // 0x60
	float ReservedRatio; // 0x64
};

struct UGamemodeHintsBase : UWindowRoot {
	UDataTable* LabelsTable; // 0x398
	TMap<EGamemode, FModeMappings> ActionMappings; // 0x3a0
	float CombatHintsResetTime; // 0x3f0
};

struct UEnvQueryManager : UObject {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0x98
	TArray<UEnvQueryContext*> LocalContexts; // 0xa8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xb8
	double MaxAllowedTestingTime; // 0x120
	bool bTestQueriesUsingBreadth; // 0x128
	int32_t QueryCountWarningThreshold; // 0x12c
	double QueryCountWarningInterval; // 0x130
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0xb8
};

struct UMaterialExpressionGetMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x60
	TArray<FGuid> AttributeGetTypes; // 0xa0
};

struct UConanCharacterComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xa8
	char bIsClientOnly : 1; // 0xa8
	char bNetAddressable : 1; // 0xa8
	char bAllowAnyoneToDestroyMe : 1; // 0xa8
	char bCreatedByConstructionScript : 1; // 0xa8
	char bInstanceComponent : 1; // 0xa8
	char bAutoActivate : 1; // 0xa8
	char bIsActive : 1; // 0xa8
	char bEditableWhenInherited : 1; // 0xa8
	char bCanEverAffectNavigation : 1; // 0xa8
	char bIsEditorOnly : 1; // 0xa8
	EComponentCreationMethod CreationMethod; // 0xb1
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xc0
	FScriptMulticastDelegate OnComponentActivated; // 0xd0
	FScriptMulticastDelegate OnComponentDeactivated; // 0xe0
};

struct UInterpData : UObject {
	float InterpLength; // 0x28
	float PathBuildTime; // 0x2c
	TArray<UInterpGroup*> InterpGroups; // 0x30
	UInterpCurveEdSetup* CurveEdSetup; // 0x40
	float EdSectionStart; // 0x48
	float EdSectionEnd; // 0x4c
	char bShouldBakeAndPrune : 1; // 0x50
	UInterpGroupDirector* CachedDirectorGroup; // 0x58
	TArray<FName> AllEventNames; // 0x60
};

struct UAISense_NewSight : UAISense {
	int32_t MaxTracesPerTick; // 0x248
	float HighImportanceQueryDistanceThreshold; // 0x24c
	float MaxQueryImportance; // 0x254
	float SightLimitQueryImportance; // 0x258
};

struct ABuildableBase : AActor {
	int32_t SourceItemTemplateID; // 0x3e8
	bool IsABrush; // 0x3ec
	bool CanBypassBuildingBlockerVolumes; // 0x3ed
	bool IsSnappedToSocket; // 0x3ee
	bool RequiresForcedGhostRefresh; // 0x3ef
	ABuildableBase* m_PlacementHelper; // 0x3f0
	UBuildingSocketComponent* BuildSockets; // 0x3f8
	TArray<EBuildingSocketType> TargetSocketTypes; // 0x400
	int32_t MaxHealth; // 0x410
	int32_t CurrentHealth; // 0x414
	int32_t AffectedByDamageTiers; // 0x418
	float ClaimRadiusBuilding; // 0x41c
	float ClaimRadiusFoliage; // 0x420
	bool EnforceLandclaim; // 0x424
	FVector ClaimLocation; // 0x428
	int32_t templateID; // 0x434
	AConanWorldSettings* ConanWorldSettings; // 0x438
	UUniqueID* OwnerUniqueID; // 0x440
	FScriptMulticastDelegate SignalBuildableNameChanged; // 0x448
	ABuildableBase* m_MasterBuildable; // 0x458
	int32_t BuildingPieceScore; // 0x470
	int32_t BuildingScore; // 0x474
	TArray<FSocketlessConnection> m_SocketlessConnections; // 0x478
	bool bIsStabilityLostDelayed; // 0x488
	bool m_IsStaticBuildable; // 0x489
	bool DecayDisabled; // 0x48c
	int32_t DecayState; // 0x490
	float DecayTimestamp; // 0x498
	FScriptMulticastDelegate SignalReceivedOwnerUniqueID; // 0x4a0
	TArray<FBuildableHealthEntry> m_HealthPool; // 0x4b0
	TArray<FHitResult> LastCanBePlacedOverlapResults; // 0x4c0
	TArray<ESocketConfiguration> ValidSocketRotations; // 0x4d0
	int32_t TargetSocketTypesMask; // 0x4e0
	FUniqueNetIdRepl m_OwnerId; // 0x4e8
	FText m_OwnerName; // 0x500
	FText m_BuildableName; // 0x518
	UAILODComponent* m_AILODComponent; // 0x530
};

struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x6e8
	char bIsFrozenRendering : 1; // 0x6e8
	UDrawFrustumComponent* DrawFrustum; // 0x6f0
	float SpeedScale; // 0x718
	float InitialMaxSpeed; // 0x71c
	float InitialAccel; // 0x720
	float InitialDecel; // 0x724
};

struct ALootContainer : AActor {
	UUniqueID* SpawnerID; // 0x3e0
	UUniqueID* ContainerOwnerID; // 0x3e8
	bool bDecayed; // 0x3f0
	UItemInventoryClientMonitor* m_InventoryMonitor; // 0x3f8
	UItemInventory* m_Inventory; // 0x400
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UMovieSceneSlomoSection : UMovieSceneFloatSection {
	FRichCurve FloatCurve; // 0xd0
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x38
};

struct UItemInfoPopup : UWindowRoot {
	float PressSpeed; // 0x398
	UItemStatView* ItemStatViewClass; // 0x3a0
	UMaterialInstance* TextureBlendMatInst; // 0x3a8
};

struct UThrallItem : UGameItem {
	FCharacterLayout ThrallCharLayout; // 0x248
	TArray<int32_t> EquipmentTemplateIDs; // 0x380
	TArray<int32_t> BackpackTemplateIDs; // 0x390
	FThrallInfo ThrallInfo; // 0x3a0
	FScriptMulticastDelegate SignalReceivedCharacterLayout; // 0x420
	UDataTable* m_ThrallTable; // 0x430
	bool m_bHasRequestedCharLayout; // 0x438
};

struct USoundMix : UObject {
	char bApplyEQ : 1; // 0x28
	float EQPriority; // 0x2c
	FAudioEQEffect EQSettings; // 0x30
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x68
	float InitialDelay; // 0x78
	float FadeInTime; // 0x7c
	float Duration; // 0x80
	float FadeOutTime; // 0x84
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x88
};

struct UStringEnumFixedListDataprovider : UStringEnumDataprovider {
	TArray<FName> m_Entries; // 0x30
};

struct UInterpGroupDirector : UInterpGroup {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct UAISystemBase : UObject {
	FStringClassReference AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x38
	bool bInstantiateAISystemOnClient; // 0x40
};

struct USoundWave : USoundBase {
	int32_t CompressionQuality; // 0x90
	char bLooping : 1; // 0x94
	char bStreaming : 1; // 0x94
	int32_t StreamingPriority; // 0x98
	char bMature : 1; // 0x9c
	char bManualWordWrap : 1; // 0x9c
	char bSingleLine : 1; // 0x9c
	char bVirtualizeWhenSilent : 1; // 0x9c
	ESoundGroup SoundGroup; // 0xa0
	FString SpokenText; // 0xa8
	float SubtitlePriority; // 0xb8
	float Volume; // 0xbc
	float Pitch; // 0xc0
	int32_t NumChannels; // 0xc4
	int32_t SampleRate; // 0xc8
	int32_t RawPCMDataSize; // 0xcc
	TArray<FSubtitleCue> Subtitles; // 0xd0
	TArray<FLocalizedSubtitle> LocalizedSubtitles; // 0xe0
	UCurveTable* Curves; // 0xf0
	UCurveTable* InternalCurves; // 0xf8
};

struct UDialogue : UDataAsset {
	bool DisplayIdleSplines; // 0x28
	FText Name; // 0x30
	TArray<FDialogueNode> Data; // 0x48
	int32_t NextNodeId; // 0x58
};

struct UPhysicsSettings : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableAsyncScene; // 0x50
	bool bEnableShapeSharing; // 0x51
	bool bEnablePCM; // 0x52
	bool bForceMultithread; // 0x53
	bool bWarnMissingLocks; // 0x54
	bool bEnable2DPhysics; // 0x55
	ESettingsLockedAxis LockedAxis; // 0x56
	ESettingsDOF DefaultDegreesOfFreedom; // 0x57
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	float ContactOffsetMultiplier; // 0x68
	float MinContactOffset; // 0x6c
	float MaxContactOffset; // 0x70
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x74
	ECollisionTraceFlag DefaultShapeComplexity; // 0x75
	bool bDefaultHasComplexCollision; // 0x76
	bool bSuppressFaceRemapTable; // 0x77
	bool bSupportUVFromHitResults; // 0x78
	bool bDisableActiveActors; // 0x79
	bool bDisableCCD; // 0x7a
	float MaxPhysicsDeltaTime; // 0x7c
	bool bSubstepping; // 0x80
	bool bSubsteppingAsync; // 0x81
	float MaxSubstepDeltaTime; // 0x84
	int32_t MaxSubsteps; // 0x88
	float SyncSceneSmoothingFactor; // 0x8c
	float AsyncSceneSmoothingFactor; // 0x90
	float InitialAverageFrameRate; // 0x94
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x98
};

struct UEndUserSettings : UObject {
	bool bSendAnonymousUsageDataToEpic; // 0x30
	bool bSendMeanTimeBetweenFailureDataToEpic; // 0x31
	bool bAllowUserIdInUsageData; // 0x32
};

struct ULogoutCallbackProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x300
	float OrthoWidth; // 0x304
	float OrthoNearClipPlane; // 0x308
	float OrthoFarClipPlane; // 0x30c
	float AspectRatio; // 0x310
	char bConstrainAspectRatio : 1; // 0x314
	char bUseFieldOfViewForLOD : 1; // 0x314
	char bLockToHmd : 1; // 0x314
	char bUsePawnControlRotation : 1; // 0x314
	ECameraProjectionMode ProjectionMode; // 0x318
	float PostProcessBlendWeight; // 0x31c
	FPostProcessSettings PostProcessSettings; // 0x320
	char bUseControllerViewRotation : 1; // 0x848
};

struct UW_InputBox_C : UInputBoxWidget {
	UW_ButtonLarge_C* B_Cancel; // 0x3e0
	UW_ButtonLarge_C* B_OK; // 0x3e8
	UW_FCEditableTextBlock_C* ETXT_Input; // 0x3f0
	UImage* Image_1; // 0x3f8
	UTextBlock* TXT_Description; // 0x400
};

struct UMaterialExpressionTransform : UMaterialExpression {
	FExpressionInput Input; // 0x60
	EMaterialVectorCoordTransformSource TransformSourceType; // 0x98
	EMaterialVectorCoordTransform TransformType; // 0x99
};

struct UMaterialExpressionGraniteStreamTextures : UMaterialExpressionGraniteBakeBase {
	FExpressionInput Originals[0x4]; // 0x1b0
	FExpressionInput SizeInput; // 0x290
	char bUseBaked : 1; // 0x2c8
	char bIsBakeDirty : 1; // 0x2c8
	uint64_t ShaderGraphHash[0x4]; // 0x2d0
	uint64_t UniformExpressionHash[0x4]; // 0x2f0
	uint64_t BakedShaderGraphHash[0x4]; // 0x310
	uint64_t BakedUniformExpressionHash[0x4]; // 0x330
	char bAlwaysUseMaxSize : 1; // 0x350
	FIntPoint Size; // 0x354
	EGraniteBakerTilingMethod Tiling; // 0x35c
	FGraniteBakerLayerLayout LayerPreset; // 0x360
	int32_t IndexList[0x4]; // 0x3d8
	TArray<UMaterialExpressionMaterialFunctionCall*> BakeCallStack; // 0x3e8
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x28
	TArray<FNode> Nodes; // 0x38
};

struct UAnimMontage : UAnimCompositeBase {
	FAlphaBlend BlendIn; // 0xa0
	float BlendInTime; // 0xd8
	FAlphaBlend BlendOut; // 0xe0
	float BlendOutTime; // 0x118
	float BlendOutTriggerTime; // 0x11c
	FName SyncGroup; // 0x120
	int32_t SyncSlotIndex; // 0x128
	FMarkerSyncData MarkerData; // 0x130
	TArray<FCompositeSection> CompositeSections; // 0x150
	TArray<FSlotAnimationTrack> SlotAnimTracks; // 0x160
	TArray<FBranchingPoint> BranchingPoints; // 0x170
	bool bEnableRootMotionTranslation; // 0x180
	bool bEnableRootMotionRotation; // 0x181
	ERootMotionRootLock RootMotionRootLock; // 0x182
	TArray<FBranchingPointMarker> BranchingPointMarkers; // 0x188
	TArray<int32_t> BranchingPointStateNotifyIndices; // 0x198
};

struct ANavMeshBoundsVolume : AVolume {
	FNavAgentSelector SupportedAgents; // 0x408
};

struct ASoundStage : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	FSlateChildSize Size; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UChatroom : UObject {
	FString CurrentChatRoomId; // 0x28
	int32_t MaxChatRoomRetries; // 0x38
	int32_t NumChatRoomRetries; // 0x3c
};

struct UFCComboBoxString : URootWidget {
	FScriptMulticastDelegate OnSelectionChanged; // 0x318
	USoundBase* PressedSound; // 0x328
	USoundBase* HoveredSound; // 0x348
	UComboBoxString* m_ComboBox; // 0x368
};

struct UDestructibleFractureSettings : UObject {
	int32_t CellSiteCount; // 0x28
	FFractureMaterial FractureMaterialDesc; // 0x2c
	int32_t RandomSeed; // 0x50
	TArray<FVector> VoronoiSites; // 0x58
	int32_t OriginalSubmeshCount; // 0x68
	TArray<UMaterialInterface*> Materials; // 0x70
	TArray<FDestructibleChunkParameters> ChunkParameters; // 0x80
};

struct UParticleModuleLightBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct USign3DText : URootWidget {
	FScriptMulticastDelegate SignalSignNeedsRedraw; // 0x318
};

struct UPoseableMeshComponent : USkinnedMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x7c8
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x7d0
	char bUseBoundsFromMasterPoseComponent : 1; // 0x82c
	UPhysicsAsset* PhysicsAssetOverride; // 0x850
	int32_t ForcedLodModel; // 0x858
	int32_t MinLodModel; // 0x85c
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x870
	float StreamingDistanceMultiplier; // 0x880
	FColor WireframeColor; // 0x884
	char bForceWireframe : 1; // 0x888
	char bDisplayBones : 1; // 0x888
	char bDisableMorphTarget : 1; // 0x888
	char bHideSkin : 1; // 0x888
	char bPerBoneMotionBlur : 1; // 0x8a0
	char bComponentUseFixedSkelBounds : 1; // 0x8a0
	char bConsiderAllBodiesForBounds : 1; // 0x8a0
	EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0x8a4
	char bForceMeshObjectUpdate : 1; // 0x8a8
	char bCanHighlightSelectedSections : 1; // 0x8a8
	char bRecentlyRendered : 1; // 0x8a8
	char CustomSortAlternateIndexMode; // 0x8ac
	char bCastCapsuleDirectShadow : 1; // 0x8b0
	char bCastCapsuleIndirectShadow : 1; // 0x8b0
	float CapsuleIndirectShadowMinVisibility; // 0x8b4
	char bCPUSkinning : 1; // 0x8b8
	FBoxSphereBounds CachedLocalBounds; // 0x8cc
	bool bCachedLocalBoundsUpToDate; // 0x8e8
	bool bEnableUpdateRateOptimizations; // 0x8e9
	bool bDisplayDebugUpdateRateOptimizations; // 0x8ea
};

struct UGuildMembersBase : UCharacterListBase {
	UListMenu* m_GuildContextMenu; // 0x360
};

struct UChannel : UObject {
	UNetConnection* Connection; // 0x28
};

struct URecipeLookup : UTableAccessor {
	UDataTable* table; // 0x28
};

struct UAITask_LockLogic : UAITask {
	AAIController* OwnerController; // 0x68
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x300
	char bSupportsDepth : 1; // 0x300
	char bNoAlphaChannel : 1; // 0x300
	UTexture* Texture; // 0x308
	UTexture* LeftTexture; // 0x310
	char bQuadPreserveTextureRatio : 1; // 0x318
	FVector2D QuadSize; // 0x31c
	FBox2D UVRect; // 0x324
	float CylinderRadius; // 0x338
	float CylinderOverlayArc; // 0x33c
	int32_t CylinderHeight; // 0x340
	EStereoLayerType StereoLayerType; // 0x344
	EStereoLayerShape StereoLayerShape; // 0x345
	int32_t Priority; // 0x348
};

struct UEmoteInventory : UItemInventory {
	FScriptMulticastDelegate SignalEmoteLearned; // 0x348
};

struct UAvfMediaSettings : UObject {
	bool NativeAudioOut; // 0x28
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x28
	bool bEnableTerrainSplineEditing; // 0x29
	bool bResizeSpriteDataToMatchTextures; // 0x2a
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct AGameNetworkManager : AInfo {
	int32_t AdjustedNetSpeed; // 0x3d0
	float LastNetSpeedUpdateTime; // 0x3d4
	int32_t TotalNetBandwidth; // 0x3d8
	int32_t MinDynamicBandwidth; // 0x3dc
	int32_t MaxDynamicBandwidth; // 0x3e0
	char bIsStandbyCheckingEnabled : 1; // 0x3e4
	char bHasStandbyCheatTriggered : 1; // 0x3e4
	float StandbyRxCheatTime; // 0x3e8
	float StandbyTxCheatTime; // 0x3ec
	int32_t BadPingThreshold; // 0x3f0
	float PercentMissingForRxStandby; // 0x3f4
	float PercentMissingForTxStandby; // 0x3f8
	float PercentForBadPing; // 0x3fc
	float JoinInProgressStandbyWaitTime; // 0x400
	float MoveRepSize; // 0x404
	float MAXPOSITIONERRORSQUARED; // 0x408
	float MAXLENIENTPOSITIONERRORSQUARED; // 0x40c
	float MAXNEARZEROVELOCITYSQUARED; // 0x410
	float CLIENTADJUSTUPDATECOST; // 0x414
	float MAXCLIENTUPDATEINTERVAL; // 0x418
	float MaxMoveDeltaTime; // 0x41c
	bool ClientAuthorativePosition; // 0x420
	float ClientErrorUpdateRateLimit; // 0x424
	bool bMovementTimeDiscrepancyDetection; // 0x428
	bool bMovementTimeDiscrepancyResolution; // 0x429
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x42c
	float MovementTimeDiscrepancyMinTimeMargin; // 0x430
	float MovementTimeDiscrepancyResolutionRate; // 0x434
	float MovementTimeDiscrepancyDriftAllowance; // 0x438
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x43c
	bool bUseDistanceBasedRelevancy; // 0x43d
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x40
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x60
	char R : 1; // 0x98
	char G : 1; // 0x98
	char B : 1; // 0x98
	char A : 1; // 0x98
};

struct UShortcutBarBase : UWindowRoot {
	UShortcutBarInventory* m_ShortcutInventory; // 0x398
	UItemInventory* m_BackpackInventory; // 0x3a0
	UCraftingQueue* m_CharacterCratfingQ; // 0x3a8
	TArray<FVisualData> VisualDataPreload; // 0x400
};

struct UMovieScene : UMovieSceneSignedObject {
	TArray<FMovieSceneSpawnable> Spawnables; // 0xb0
	TArray<FMovieScenePossessable> Possessables; // 0xc0
	TArray<FMovieSceneBinding> ObjectBindings; // 0xd0
	TArray<UMovieSceneTrack*> MasterTracks; // 0xe0
	UMovieSceneTrack* CameraCutTrack; // 0xf0
	FFloatRange SelectionRange; // 0xf8
	FFloatRange PlaybackRange; // 0x108
	bool bForceFixedFrameIntervalPlayback; // 0x118
	float FixedFrameInterval; // 0x11c
	float InTime; // 0x120
	float OutTime; // 0x124
	float StartTime; // 0x128
	float EndTime; // 0x12c
};

struct UAINavigationComponent : UActorComponent {
	float TileGenerationRadius; // 0xf8
	float TileRemovalRadius; // 0xfc
	FName NavDataConfigName; // 0x100
	float npcLOD0NavmeshTileGenerationRadius; // 0x108
	float npcLOD0NavmeshTileRemovalRadius; // 0x10c
	float npcLOD1NavmeshTileGenerationRadius; // 0x110
	float npcLOD1NavmeshTileRemovalRadius; // 0x114
	float npcLOD2NavmeshTileGenerationRadius; // 0x118
	float npcLOD2NavmeshTileRemovalRadius; // 0x11c
	float npcLOD3NavmeshTileGenerationRadius; // 0x120
	float npcLOD3NavmeshTileRemovalRadius; // 0x124
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x60
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct UGUIModuleController : UObject {
	FScriptMulticastDelegate SignalMouseEnabled; // 0x28
	FScriptMulticastDelegate SignalGUIControlModeChanged; // 0x38
	FScriptMulticastDelegate SignalGamepadKeyDown; // 0x48
	FScriptMulticastDelegate SignalKeyBindingsChanged; // 0x58
	FScriptMulticastDelegate SignalUserInactive; // 0x68
	FScriptMulticastDelegate SignalResetGamepadOverlay; // 0x78
	TArray<UWindowRoot*> m_WindowList; // 0x90
	UWindowRoot* m_MouseBlockWindow; // 0xa0
	UWindowRoot* m_HotkeyHelpOverlay; // 0xa8
	TArray<UGUIModule*> m_Modules; // 0xb0
	TArray<UEscapeStackNode*> m_EscapeStack; // 0xc0
	UDataTable* m_GUIModuleTable; // 0xd0
	URootWidget* m_KeyNavSelectedWidget; // 0xe0
	TArray<UMessageBoxWidget*> m_LoadingScreenMessageBoxes; // 0x170
	AConanPlayerController* m_PlayerController; // 0x1a8
	UInputComponent* m_InputComponent; // 0x1b0
};

struct AConanHeightmapLevelScriptActor : AConanLevelScriptActor {
	char bInputEnabled : 1; // 0x3d0
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xe0
};

struct UInterpTrackInstParticleReplay : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UW_BlitzButton_C : UFCBloodBlitzButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0xcd0
	UWidgetAnimation* Anim_Blood; // 0xcd8
	UWidgetAnimation* Anim_Fade; // 0xce0
	UImage* ASSIGNED_IN_CODE__Icon; // 0xce8
	UImage* Button; // 0xcf0
	UTextBlock* CommunityLabel; // 0xcf8
	FText Description; // 0xd00
	FScriptMulticastDelegate SignalDescription; // 0xd18
};

struct UW_PatchNotesEntryView_C : UPatchNotesEntryView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x378
	UWidgetAnimation* Deselect; // 0x380
	UWidgetAnimation* Select; // 0x388
	UBorder* Border_1; // 0x390
	FSlateBrush Temp_OldHighlight; // 0x398
};

struct UStaticMesh : UObject {
	int32_t MinLOD; // 0x40
	bool bUseConsoleMinLODOverride; // 0x44
	int32_t ConsoleMinLODOverride; // 0x48
	TArray<UMaterialInterface*> Materials; // 0x50
	TArray<FStaticMaterial> StaticMaterials; // 0x60
	float LightmapUVDensity; // 0x70
	int32_t LightMapResolution; // 0x74
	int32_t LightMapCoordinateIndex; // 0x78
	char bGenerateMeshDistanceField : 1; // 0x7c
	UBodySetup* BodySetup; // 0x80
	int32_t LODForCollision; // 0x88
	char bStripComplexCollisionForConsole : 1; // 0x8c
	char bHasNavigationData : 1; // 0x8c
	char bLODsShareStaticLighting : 1; // 0x8c
	float LpvBiasMultiplier; // 0x90
	bool bAllowCPUAccess; // 0x94
	TArray<UStaticMeshSocket*> Sockets; // 0xc8
	FVector PositiveBoundsExtension; // 0xe8
	FVector NegativeBoundsExtension; // 0xf4
	FBoxSphereBounds ExtendedBounds; // 0x100
	int32_t ElementToIgnoreForTexFactor; // 0x11c
	TArray<UAssetUserData*> AssetUserData; // 0x120
	UNavCollision* NavCollision; // 0x130
};

struct UMaterialExpressionSpeedTree : UMaterialExpression {
	ESpeedTreeGeometryType GeometryType; // 0x60
	ESpeedTreeWindType WindType; // 0x61
	ESpeedTreeLODType LODType; // 0x62
	float BillboardThreshold; // 0x64
	bool bAccurateWindVelocities; // 0x68
};

struct ALobbyBeaconPlayerState : AInfo {
	FText DisplayName; // 0x3d0
	FUniqueNetIdRepl UniqueID; // 0x3e8
	FUniqueNetIdRepl PartyOwnerUniqueId; // 0x400
	bool bInLobby; // 0x418
	AOnlineBeaconClient* ClientActor; // 0x420
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x3d8
};

struct UConanCharacterPersistenceComponent : UCharacterPersistenceComponent {
	bool SaveOnSpawn; // 0xf8
	float SaveFrequency; // 0xfc
	bool SkipSaving; // 0x100
	UUniqueID* UID; // 0x108
	FScriptMulticastDelegate OnSignalDataLoaded; // 0x110
	FScriptMulticastDelegate OnSignalPreSave; // 0x120
	bool m_bWasLoadedFromDB; // 0x130
};

struct AFunctionalAITest : AFunctionalTest {
	TArray<FAITestSpawnSet> SpawnSets; // 0x500
	float SpawnLocationRandomizationRange; // 0x510
	TArray<APawn*> SpawnedPawns; // 0x518
	TArray<FPendingDelayedSpawn> PendingDelayedSpawns; // 0x528
	FScriptMulticastDelegate OnAISpawned; // 0x550
	FScriptMulticastDelegate OnAllAISPawned; // 0x560
	char bWaitForNavMesh : 1; // 0x570
};

struct UPerkSystemComponent : UActorComponent {
	float CombatStaminaRegenModifier; // 0xf8
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	FGuid CameraGuid; // 0xc8
};

struct UDialogueWave : UObject {
	char bMature : 1; // 0x28
	char bOverride_SubtitleOverride : 1; // 0x28
	FString SpokenText; // 0x30
	FString SubtitleOverride; // 0x40
	TArray<FDialogueContextMapping> ContextMappings; // 0x50
	FGuid LocalizationGUID; // 0x60
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0xb8
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	UDestructibleMesh* DestructibleMesh; // 0x9e0
	FScriptMulticastDelegate OnInstanceTakePointDamage; // 0xa00
	FScriptMulticastDelegate OnInstanceTakeRadialDamage; // 0xa10
	UDestructibleMesh* DestructibleMeshPtr; // 0xa20
};

struct UMapMarkerItem : UGameItem {
	UTexture2D* Icon; // 0x248
};

struct ULightPropagationVolumeBlendable : UObject {
	FLightPropagationVolumeSettings Settings; // 0x30
	float BlendWeight; // 0x68
};

struct UPlayFabServerAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x8c0
	UPlayFabJsonObject* RequestJsonObj; // 0x8c8
	UPlayFabJsonObject* ResponseJsonObj; // 0x8d0
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x3e0
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x3f0
	UNavLinkCustomComponent* SmartLinkComp; // 0x400
	bool bSmartLinkIsRelevant; // 0x408
	FScriptMulticastDelegate OnSmartLinkReached; // 0x410
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0x128
	FVector FailsafeExtent; // 0x130
};

struct ASpatialHashSystem : AInfo {
	float UpdateInterval; // 0x3d0
	TMap<uint32_t, FSpatialObjectSet> Components; // 0x3e0
	TMap<USceneComponent*, float> ComponentMaxRadius; // 0x430
};

struct UMaterialExpressionOneMinus : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UAsyncLineTraceByChannelProxy : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnCompletion; // 0x28
};

struct UNavRelevantComponent : UActorComponent {
	char bAttachToOwnersRoot : 1; // 0x11c
	UObject* CachedNavParent; // 0x120
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct UChestInventoryView : UExternalInventoryView {
	bool CanItemBeDropedOn; // 0x318
	FScriptMulticastDelegate SignalCouldNotDrop; // 0x320
	DelegateProperty DelegateGetTargetInventory; // 0x330
	AActor* m_Actor; // 0x370
	UItemInventory* m_Inventory; // 0x378
	UItemInventory* m_TargetInventory; // 0x380
};

struct UCurveLinearColor : UCurveBase {
	FRichCurve FloatCurves[0x4]; // 0x30
};

struct UBTTask_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98
	UNavigationQueryFilter* FilterClass; // 0xa0
	float ObservedBlackboardValueTolerance; // 0xa8
	char bObserveBlackboardValue : 1; // 0xac
	char bAllowStrafe : 1; // 0xac
	char bAllowPartialPath : 1; // 0xac
	char bTrackMovingGoal : 1; // 0xac
	char bProjectGoalLocation : 1; // 0xac
	char bStopOnOverlap : 1; // 0xac
};

struct ALandClaim : AActor {
	int32_t CellSize; // 0x3d0
	TMap<uint32_t, FLandClaimCellData> Cells; // 0x3d8
	ClaimChannel Channel; // 0x428
	float RadiusCoefficient; // 0x42c
	int32_t ScaledCellSize; // 0x430
	bool NoOwnership; // 0x434
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
};

struct UConanOnlineEventsLibrary : UObject {
	UDataTable* m_richPresenceTextTable; // 0xf8
};

struct UMovieScene3DTransformSection : UMovieSceneSection {
	FRichCurve Translation[0x3]; // 0xd0
	FRichCurve Rotation[0x3]; // 0x220
	FRichCurve Scale[0x3]; // 0x370
};

struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	char bUseParametrizedRadius : 1; // 0xc8
	char bUseNavAgentGoalLocation : 1; // 0xc8
};

struct UFCEditableTextBox : UFCEditableTextBase {
	FText Text; // 0x338
	bool RequiresCommunicationPrivileges; // 0x350
	DelegateProperty TextDelegate; // 0x358
	FText KeyboardTitle; // 0x368
	FText KeyboardDescription; // 0x380
	EVirtualKeyboardLayout KeyboardLayout; // 0x398
	FEditableTextBoxStyle WidgetStyle; // 0x3a0
	FText HintText; // 0xc10
	DelegateProperty HintTextDelegate; // 0xc28
	bool IsReadOnly; // 0xc38
	bool IsPassword; // 0xc39
	float MinimumDesiredWidth; // 0xc3c
	int32_t TextMaxLength; // 0xc40
	float TextMaxSize; // 0xc44
	bool IsCaretMovedWhenGainFocus; // 0xc48
	bool SelectAllTextWhenFocused; // 0xc49
	bool RevertTextOnEscape; // 0xc4a
	bool ClearKeyboardFocusOnCommit; // 0xc4b
	bool SelectAllTextOnCommit; // 0xc4c
	bool AllowContextMenu; // 0xc4d
	FShapedTextOptions ShapedTextOptions; // 0xc50
	USoundBase* PressedSound; // 0xc58
	USoundBase* HoveredSound; // 0xc78
	FScriptMulticastDelegate OnTextChanged; // 0xc98
	FScriptMulticastDelegate OnTextCommitted; // 0xca8
	FScriptMulticastDelegate OnMaxLengthExceeded; // 0xcb8
	FScriptMulticastDelegate SignalActivated; // 0xcc8
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x30
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x38
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0x220
	ANavigationData* MyNavData; // 0x230
};

struct UFeedingTrayPanel : URootWidget {
	UFeedingTrayEntryView* EntryViewClass; // 0x318
	AActor* m_TrayActor; // 0x348
};

struct ABasePlayerState_C : AConanPlayerState {
	FPointerToUberGraphFrame UberGraphFrame; // 0x560
	USceneComponent* DefaultSceneRoot; // 0x568
	FScriptMulticastDelegate CharacterCreationLoaded; // 0x570
	UW_MainMenu_MainMenu_C* MainMenu; // 0x580
	UW_ServerList_C* ServerList; // 0x588
	int32_t PlayerIndex; // 0x590
	float ServerSettingDurabilityModifier; // 0x594
	FText PreparingWorld; // 0x598
	AActor* CharacterCreationActor; // 0x5b0
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x98
};

struct URadialMenu : URootWidget {
	float AnimTime; // 0x318
	float AnimFullRadiusThreshold; // 0x31c
	float StartAngle; // 0x320
	bool CenterAroundStart; // 0x324
	float InnerRadius; // 0x328
	float OuterRadius; // 0x32c
	float IconCenterRadius; // 0x330
	FVector2D StartCapOffset; // 0x334
	FVector2D EndCapOffset; // 0x33c
	FVector2D StartCapScale; // 0x344
	FVector2D EndCapScale; // 0x34c
	float SegmentSpacing; // 0x354
	float SelectedScale; // 0x358
	float HoverScale; // 0x35c
	URadialMenuSegment* SegmentViewClass; // 0x360
	UTexture2D* SegmentTextureUnselected; // 0x368
	UTexture2D* SegmentTextureSelected; // 0x370
	UTexture2D* SegmentTextureHovered; // 0x378
	UTexture2D* StartCapTextureUnselected; // 0x380
	UTexture2D* StartCapTextureSelected; // 0x388
	UTexture2D* StartCapTextureHovered; // 0x390
	UTexture2D* EndCapTextureUnselected; // 0x398
	UTexture2D* EndCapTextureSelected; // 0x3a0
	UTexture2D* EndCapTextureHovered; // 0x3a8
	float InputAxisDeadZone; // 0x3b0
	FSlateSound PressedSlateSound; // 0x3b8
	FSlateSound HoveredSlateSound; // 0x3d0
	FScriptMulticastDelegate SignalEntryClicked; // 0x3e8
	FScriptMulticastDelegate SignalEntryHighlighted; // 0x3f8
	FScriptMulticastDelegate SignalFadingDone; // 0x408
	bool EnableLeftGamepadStick; // 0x418
	bool bShouldActivateOnEscape; // 0x419
	UInputComponent* m_InputComponent; // 0x420
	URadialMenuEntry* m_CurrentSubMenu; // 0x4c0
	TArray<URadialMenuEntry*> m_RootEntries; // 0x4c8
	UInputComponent* m_ShortcutsInputComponent; // 0x4e0
};

struct UBTDecorator_ForceSuccess : UBTDecorator {
	char bInverseCondition : 1; // 0x60
	EBTFlowAbortMode FlowAbortMode; // 0x64
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x38
	float LoopEnd; // 0x3c
	float DurationAfterLoop; // 0x40
	int32_t LoopCount; // 0x44
	char bLoopIndefinitely : 1; // 0x48
	char bLoop : 1; // 0x48
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x50
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x58
	FRuntimeFloatCurve VolumeCurve; // 0x60
	FRuntimeFloatCurve PitchCurve; // 0xd8
	float PitchMin; // 0x150
	float PitchMax; // 0x154
	float VolumeMin; // 0x158
	float VolumeMax; // 0x15c
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct AEnergyReceiverRegistry : AActor {
	TArray<UEnergyReceiverComponent*> EnergyListeners; // 0x3d0
};

struct UCharacterUploadBase : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct UBookMark2D : UObject {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct USkippableMovieBase : UWindowRoot {
	FScriptMulticastDelegate SignalMovieFinished; // 0x398
	UConanAudioComponent* m_MediaSound; // 0x3a8
	UMediaPlayer* m_MediaPlayer; // 0x3c8
};

struct UBuildingBoundsComponent : USceneComponent {
	USceneComponent* AttachParent; // 0xf8
	TArray<USceneComponent*> AttachChildren; // 0x100
	TSet<USceneComponent*> ClientAttachedChildren; // 0x110
	FName AttachSocketName; // 0x160
	char bWorldToComponentUpdated : 1; // 0x168
	char bAbsoluteLocation : 1; // 0x168
	char bAbsoluteRotation : 1; // 0x168
	char bAbsoluteScale : 1; // 0x168
	char bVisible : 1; // 0x168
	char bHiddenInGame : 1; // 0x168
	char bShouldUpdatePhysicsVolume : 1; // 0x168
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x168
	char bUseAttachParentBound : 1; // 0x168
	char bShouldDisregardChildComponentsForNavigationUpdates : 1; // 0x168
	char bShouldDisregardAttachedActorsForNavigationUpdates : 1; // 0x168
	EComponentMobility Mobility; // 0x16d
	EDetailMode DetailMode; // 0x16e
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0x170
	FVector RelativeLocation; // 0x1f0
	FRotator RelativeRotation; // 0x1fc
	FVector RelativeScale3D; // 0x230
	FVector ComponentVelocity; // 0x258
	FScriptMulticastDelegate PhysicsVolumeChangedDelegate; // 0x268
};

struct UBTComposite_Sequence : UBTCompositeNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
};

struct UHoudiniInstancedActorComponent : USceneComponent {
	UObject* InstancedAsset; // 0x300
	TArray<AActor*> Instances; // 0x308
};

struct UActorSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x2d8
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x2e0
};

struct UW_KeyBindings_Commands_C : UKeyBindingsCommandBase {
	UTextBlock* Category; // 0x3d0
	UW_Keybindings_Command_C* Five; // 0x3d8
	UW_Keybindings_Command_C* Four; // 0x3e0
	UW_Keybindings_Command_C* One; // 0x3e8
	UW_Keybindings_Command_C* Three; // 0x3f0
	UW_Keybindings_Command_C* Two; // 0x3f8
};

struct UW_ServerInfo_C : UServerInfoBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x528
	UWidgetAnimation* Anim_FavoriteAdded; // 0x530
	UButton* B_SelectThis; // 0x538
	UBorder* Border_2; // 0x540
	UBorder* Brd_ActiveIndicator; // 0x548
	UImage* I_Battleye; // 0x550
	UImage* I_Favorite; // 0x558
	UImage* I_Password; // 0x560
	UImage* I_Upload; // 0x568
	UTextBlock* T_Age; // 0x570
	UTextBlock* T_CombatMode; // 0x578
	UTextBlock* T_Level; // 0x580
	UTextBlock* T_Map; // 0x588
	UTextBlock* T_Name; // 0x590
	UTextBlock* T_Ping; // 0x598
	UTextBlock* T_Players; // 0x5a0
	UTextBlock* T_Region; // 0x5a8
	UTextBlock* TextBlock_1; // 0x5b0
	FButtonStyle ValidStyle; // 0x5b8
	FButtonStyle InvalidStyle; // 0x860
};

struct UTextBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x40
};

struct UEmoteController : UActorComponent {
	ECharacterEmotes CurrentEmote; // 0xf8
	UAnimMontage* CurrentEmoteAnimMontage; // 0x100
	int32_t CurrentEmoteFlags; // 0x108
	FScriptMulticastDelegate SignalEmoteStarted; // 0x110
	int32_t m_ReplicatedEmote; // 0x120
};

struct UImageCaptureSettings : UFrameGrabberProtocolSettings {
	int32_t CompressionQuality; // 0x30
};

struct UUniformGridPanel : UPanelWidget {
	FMargin SlotPadding; // 0x130
	float MinDesiredSlotWidth; // 0x140
	float MinDesiredSlotHeight; // 0x144
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x7c8
	UMaterialInterface* MaterialOverride; // 0x7d0
	FLinearColor SpriteColor; // 0x7d8
};

struct UW_RadialShortcutBar_C : URadialShortcutBar {
	UImage* Image_1; // 0x408
	UInventoryGridSlotView_C* InventoryGridSlotView; // 0x410
	UW_RadialSBItemInfoPanel_C* ItemInfoPanel; // 0x418
	UInventoryIconView_C* ItemToMoveIconView; // 0x420
	UW_RadialMenu_C* menu; // 0x428
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct AWorldSettings : AInfo {
	char bEnableWorldBoundsChecks : 1; // 0x3d8
	char bEnableNavigationSystem : 1; // 0x3d8
	char bEnableAISystem : 1; // 0x3d8
	char bEnableWorldComposition : 1; // 0x3d8
	char bUseClientSideLevelStreamingVolumes : 1; // 0x3d8
	char bEnableWorldOriginRebasing : 1; // 0x3d8
	char bWorldGravitySet : 1; // 0x3d8
	char bGlobalGravitySet : 1; // 0x3d8
	float KillZ; // 0x3dc
	UDamageType* KillZDamageType; // 0x3e0
	float WorldGravityZ; // 0x3e8
	float GlobalGravityZ; // 0x3ec
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x3f0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x3f8
	AGameModeBase* DefaultGameMode; // 0x400
	AGameNetworkManager* GameNetworkManagerClass; // 0x408
	UWorldComposition* WorldCompositionClass; // 0x410
	int32_t PackedLightAndShadowMapTextureSize; // 0x418
	char bMinimizeBSPSections : 1; // 0x41c
	FVector DefaultColorScale; // 0x420
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x42c
	float GlobalDistanceFieldViewDistance; // 0x430
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x434
	char bPrecomputeVisibility : 1; // 0x438
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x438
	int32_t VisibilityCellSize; // 0x43c
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x440
	char bForceNoPrecomputedLighting : 1; // 0x444
	FLightmassWorldInfoSettings LightmassSettings; // 0x448
	FReverbSettings DefaultReverbSettings; // 0x490
	FInteriorSettings DefaultAmbientZoneSettings; // 0x4a8
	USoundMix* DefaultBaseSoundMix; // 0x4d0
	float WorldToMeters; // 0x4d8
	float MonoCullingDistance; // 0x4dc
	UBookMark* BookMarks[0xa]; // 0x4e0
	float TimeDilation; // 0x530
	float MatineeTimeDilation; // 0x534
	float DemoPlayTimeDilation; // 0x538
	float MinGlobalTimeDilation; // 0x53c
	float MaxGlobalTimeDilation; // 0x540
	float MinUndilatedFrameTime; // 0x544
	float MaxUndilatedFrameTime; // 0x548
	APlayerState* Pauser; // 0x550
	char bHighPriorityLoading : 1; // 0x558
	char bHighPriorityLoadingLocal : 1; // 0x558
	TArray<FNetViewer> ReplicationViewers; // 0x560
	TArray<UAssetUserData*> AssetUserData; // 0x570
};

struct UImage : UWidget {
	USlateBrushAsset* Image; // 0x118
	FSlateBrush Brush; // 0x120
	DelegateProperty BrushDelegate; // 0x1b0
	FLinearColor ColorAndOpacity; // 0x1c0
	DelegateProperty ColorAndOpacityDelegate; // 0x1d0
	DelegateProperty OnMouseButtonDownEvent; // 0x1e0
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UCircularProgressbar : URootWidget {
	float progress; // 0x318
	float SegmentSpacing; // 0x31c
	float StartAngle; // 0x320
	float AngleSpan; // 0x324
	float InnerRadius; // 0x328
	float OuterRadius; // 0x32c
	FSlateBrush IconBrush; // 0x330
	FLinearColor IconColorAndOpacity; // 0x3c0
	UTexture2D* TextureEmpty; // 0x3d0
	FLinearColor ColorAndOpacityEmpty; // 0x3d8
	TArray<FCircularProgressbarSegment> Segments; // 0x3e8
};

struct UFCBloodBlitzButton : UFCButton {
	UTexture2D* StonePlateTexture; // 0xc20
	UTexture2D* StonePlateHoverTexture; // 0xc28
	UTexture2D* TextureIcon; // 0xc30
	UTexture2D* TextureBlood1; // 0xc50
	UTexture2D* TextureBlood2; // 0xc70
	UTexture2D* TextureBlood3; // 0xc90
	UTexture2D* TextureBlood4; // 0xcb0
};

struct ALODActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x3d0
	TArray<AActor*> SubActors; // 0x3d8
	float LODDrawDistance; // 0x3e8
	int32_t LodLevel; // 0x3ec
	TArray<UObject*> SubObjects; // 0x3f0
};

struct UW_KeyBindings_Entry_C : UKeyBindingsEntryBase {
	UTextBlock* ActionMapping; // 0x460
	UW_ButtonNormal_C* B_ClearFirst; // 0x468
	UW_ButtonNormal_C* B_ClearSecond; // 0x470
	UW_ButtonNormal_C* B_ResetFirst; // 0x478
	UW_ButtonNormal_C* B_ResetSecond; // 0x480
	UW_KeyBindings_Button_C* FirstButton; // 0x488
	UW_KeyBindings_Button_C* SecondButton; // 0x490
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct UW_MessageBox_C : UMessageBoxWidget {
	UW_ButtonLarge_C* B_Cancel; // 0x458
	UW_ButtonLarge_C* B_No; // 0x460
	UW_ButtonLarge_C* B_OK; // 0x468
	UW_ButtonLarge_C* B_Yes; // 0x470
	UHorizontalBox* ButtonContainer; // 0x478
	UImage* Image_1; // 0x480
	UW_TooltipOverlay_C* KeyNavAnchor; // 0x488
	UW_FCMultiLineEditableTextBox_C* T_Message; // 0x490
	UThrobber* Throbber_Waiting; // 0x498
};

struct UMaterialExpressionSquareRoot : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UShaderPlatformQualitySettings : UObject {
	FMaterialQualityOverrides QualityOverrides[0x3]; // 0x28
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FScriptMulticastDelegate OnDrop; // 0x58
	FScriptMulticastDelegate OnDragCancelled; // 0x68
	FScriptMulticastDelegate OnDragged; // 0x78
};

struct USettingsEventDispatchers : UObject {
	FScriptMulticastDelegate OnNudityChanged; // 0x28
	FScriptMulticastDelegate OnSignVisibilityChanged; // 0x38
	FScriptMulticastDelegate OnEnableClanMarkesChanged; // 0x48
	FScriptMulticastDelegate OnOwnVoiceIndicatorChanged; // 0x58
	FScriptMulticastDelegate OnOtherVoiceIndicatorChanged; // 0x68
	FScriptMulticastDelegate OnShowHUDBuffsChanged; // 0x78
	FScriptMulticastDelegate OnHUDBuffScaleChanged; // 0x88
	FScriptMulticastDelegate OnHUDShowBarValuesChanged; // 0x98
	FScriptMulticastDelegate OnShowHealthValueThrallsChanged; // 0xa8
	FScriptMulticastDelegate OnShowHealthValueNPCsChanged; // 0xb8
	FScriptMulticastDelegate OnAlwaysShowHealthBarsChanged; // 0xc8
	FScriptMulticastDelegate OnDifferentBarColorClanMembersChanged; // 0xd8
};

struct UFriendListEntry : URootWidget {
	float m_GrayOutTextValue; // 0x46c
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x88
};

struct UDLCEntryViewBase : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x390
	UBoxComponent* PreviewInfluenceBox; // 0x398
	UBoxComponent* PreviewCaptureBox; // 0x3a0
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct USoundNodeSwitch : USoundNode {
	FName IntParameterName; // 0x38
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UFeatGroupView : URootWidget {
	UItemInventory* m_GroupInventory; // 0x338
};

struct UW_SubtitleEntryView_C : USubtitleEntryView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	UTextBlock* textView; // 0x330
};

struct UPaperTerrainComponent : UPrimitiveComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x6c0
	bool bClosedSpline; // 0x6c8
	bool bFilledSpline; // 0x6c9
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x6d0
	int32_t RandomSeed; // 0x6d8
	float SegmentOverlapAmount; // 0x6dc
	FLinearColor TerrainColor; // 0x6e0
	int32_t ReparamStepsPerSegment; // 0x6f0
	ESpriteCollisionMode SpriteCollisionDomain; // 0x6f4
	float CollisionThickness; // 0x6f8
	UBodySetup* CachedBodySetup; // 0x700
};

struct UBillboardComponent : UPrimitiveComponent {
	UTexture2D* Sprite; // 0x6c0
	char bIsScreenSizeScaled : 1; // 0x6c8
	float ScreenSize; // 0x6cc
	float U; // 0x6d0
	float UL; // 0x6d4
	float V; // 0x6d8
	float VL; // 0x6dc
};

struct UColorBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x40
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x28
	USoundSubmix* SoundSubmixObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bIgnoreFocus : 1; // 0x38
	USoundConcurrency* SoundConcurrencySettings; // 0x40
	FSoundConcurrencySettings ConcurrencyOverrides; // 0x48
	EMaxConcurrentResolutionRule MaxConcurrentResolutionRule; // 0x58
	int32_t MaxConcurrentPlayCount; // 0x5c
	float Duration; // 0x60
	USoundAttenuation* AttenuationSettings; // 0x68
	float Priority; // 0x70
	TArray<USoundEffectSourcePreset*> SourceEffectChain; // 0x78
	float DefaultMasterReverbSendAmount; // 0x88
};

struct AConanCritterAIController : AConanBasicAIController {
	float FleeRange; // 0x568
	float MaxRoamingRange; // 0x56c
	bool CanRoam; // 0x570
	bool PurgeShouldReturnHome; // 0x571
	UObject* BehaviorParameters; // 0x578
	float CheckIfOffNavmeshInterval; // 0x580
	float TotalTimeToCheckIfOffNavmesh; // 0x584
	bool bIsPatroling; // 0x588
	AConanCharacter* FleeActor; // 0x5b8
	bool bIsSuiciding; // 0x600
	UNavigationQueryFilter* DefaultNavQueryFilterObject; // 0x618
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x60
	EMaterialSamplerType SamplerType; // 0x68
	char IsDefaultMeshpaintTexture : 1; // 0x6c
};

struct UShortcutIconBase : URootWidget {
	FScriptMulticastDelegate KeyNavOnSelectedEvent; // 0x240
	TWeakObjectPtr<URootWidget> KeyNavLeft; // 0x250
	TWeakObjectPtr<URootWidget> KeyNavRight; // 0x258
	TWeakObjectPtr<URootWidget> KeyNavAbove; // 0x260
	TWeakObjectPtr<URootWidget> KeyNavBelow; // 0x268
	TWeakObjectPtr<URootWidget> KeyNavTab; // 0x270
	TWeakObjectPtr<URootWidget> KeyNavChildLeft; // 0x278
	TWeakObjectPtr<URootWidget> KeyNavChildRight; // 0x280
	TWeakObjectPtr<URootWidget> KeyNavChildAbove; // 0x288
	TWeakObjectPtr<URootWidget> KeyNavChildBelow; // 0x290
	TWeakObjectPtr<URootWidget> KeyNavChildTab; // 0x298
	TWeakObjectPtr<URootWidget> KeyNavChildren; // 0x2a0
	UTooltipWidget* TooltipWidgetClass; // 0x2a8
	UKeyNavIndicator* KeyNavIndicatorClass; // 0x2b0
	FLinearColor PositiveFeedbackColor; // 0x2b8
	FLinearColor NegativeFeedbackColor; // 0x2c8
	FLinearColor NeutralFeedbackColor; // 0x2d8
	bool KeyNavFocusOnClick; // 0x2e8
	bool KeyNavAutoSetBack; // 0x2e9
	UWindowRoot* m_Window; // 0x2f0
	TWeakObjectPtr<URootWidget> m_Parent; // 0x2f8
	UKeyNavIndicator* m_KeyNavIndicator; // 0x300
};

struct ULevelStreamingPersistent : ULevelStreaming {
	FName PackageName; // 0x28
	UWorld* WorldAsset; // 0x30
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	char bShouldBeVisibleInEditor : 1; // 0xb0
	char bLocked : 1; // 0xb0
	char bShouldBeLoaded : 1; // 0xb0
	char bShouldBeVisible : 1; // 0xb0
	char bIsStatic : 1; // 0xb0
	char bShouldBlockOnLoad : 1; // 0xb0
	int32_t LevelLODIndex; // 0xb4
	char bDisableDistanceStreaming : 1; // 0xb8
	char bDrawOnLevelStatusMap : 1; // 0xb8
	FColor DrawColor; // 0xbc
	FLinearColor LevelColor; // 0xc0
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	TArray<FString> Keywords; // 0xe8
	FScriptMulticastDelegate OnLevelLoaded; // 0xf8
	FScriptMulticastDelegate OnLevelUnloaded; // 0x108
	FScriptMulticastDelegate OnLevelShown; // 0x118
	FScriptMulticastDelegate OnLevelHidden; // 0x128
	ULevel* LoadedLevel; // 0x138
	ULevel* PendingUnloadLevel; // 0x140
};

struct ULayer : UObject {
	FName LayerName; // 0x28
	char bIsVisible : 1; // 0x30
	TArray<FLayerActorStats> ActorStats; // 0x38
};

struct UPostProcessComponent : USceneComponent {
	FPostProcessSettings Settings; // 0x310
	float Priority; // 0x7e0
	float BlendRadius; // 0x7e4
	float BlendWeight; // 0x7e8
	char bEnabled : 1; // 0x7ec
	char bUnbound : 1; // 0x7ec
};

struct UMaterialExpressionNoise : UMaterialExpression {
	FExpressionInput Position; // 0x60
	FExpressionInput FilterWidth; // 0x98
	float Scale; // 0xd0
	int32_t quality; // 0xd4
	ENoiseFunction NoiseFunction; // 0xd8
	char bTurbulence : 1; // 0xdc
	int32_t Levels; // 0xe0
	float OutputMin; // 0xe4
	float OutputMax; // 0xe8
	float LevelScale; // 0xec
	char bTiling : 1; // 0xf0
	uint32_t RepeatSize; // 0xf4
};

struct UConanCharacterMovementComponent : UCharacterMovementComponent {
	float DoubleJumpZVelocity; // 0x7a8
	FFindFloorResult CurrentWall; // 0x7b0
	float ClimbDirection; // 0x848
	UDamageType* ClimbingDamageClass; // 0x850
	float ClimbingDamageCooldown; // 0x858
	float SlidingPassiveFriction; // 0x85c
	float SlidingActiveFriction; // 0x860
	bool IsInSlidingMode; // 0x864
	bool HangingFromCeiling; // 0x865
	float MaxReachUpHeight; // 0x868
	bool HoldToClimb; // 0x86c
	float HoldingClimbButtonTime; // 0x870
	bool DirectionalFromBP; // 0x875
	FScriptMulticastDelegate SignalClimbingFromCeilingChanged; // 0x878
	FScriptMulticastDelegate SignalEdgeTransitionTriggered; // 0x888
	FScriptMulticastDelegate SignalKnockbackRagdollingStart; // 0x898
	float ServerKnockbackFloorTraceDist; // 0x8a8
	float ClientKnockbackFloorTraceDist; // 0x8ac
	float KnockbackAnimationMaxDuration; // 0x8b0
	float KnockdownSlideSqrVelocityThreshold; // 0x8b4
	float KnockdownSlideFrictionFactor; // 0x8b8
	FScriptMulticastDelegate SignalCanGetUpFromKnockback; // 0x8c0
	bool CanGetUpFromKnockback; // 0x8d0
	float KnockbackEndMinDelay; // 0x8d4
	float KnockbackDuration; // 0x8d8
	bool FallOnKnockbackEnd; // 0x8dc
	bool KnockbackAllowRagdolling; // 0x8dd
	bool UseSteering; // 0x8de
	EKnockbackStage m_KnockbackStage; // 0x8df
	float MovementDetectionThreshold; // 0x8e0
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xd0
	FString AutogeneratedDefaultValue; // 0xe0
	UObject* DefaultObject; // 0xf0
	FText DefaultTextValue; // 0xf8
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0x110
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0x120
	UEdGraphPin_Deprecated* ParentPin; // 0x130
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x138
};

struct UGUIModule : UObject {
	FName ModuleName; // 0x28
	FName ToggleActionName; // 0x30
	FSlateSound ToggleActionSound; // 0x38
	bool bForceHideShortcutBar; // 0x50
	bool CloseOnShortcutRelease; // 0x51
	bool CloseOnESC; // 0x52
	bool CloseOnEndPlay; // 0x53
	bool PreloadOnStartup; // 0x54
	bool NonBlockingLoad; // 0x55
	bool IsPersistent; // 0x56
	bool m_ShowWhenDead; // 0x57
	bool MustBeBasePlayerChar; // 0x58
	EGUIModuleCategory Category; // 0x59
	UClass* WidgetClass; // 0x60
	UWindowRoot* RootWidget; // 0x80
	bool IsFullscreen; // 0x88
	bool DisableShortcutWhenPlayerInputBlocked; // 0x89
	bool TieToBasePlayerCharInput; // 0x8a
	FScriptMulticastDelegate SignalActivated; // 0x90
	FScriptMulticastDelegate OnActivate; // 0xa0
	FScriptMulticastDelegate OnBeginLoad; // 0xb0
	UGUIModuleController* m_ModuleController; // 0xc0
};

struct UMapMarkerView : URootWidget {
	UImage* MapMarkerImage; // 0x328
	int32_t mapMarkerId; // 0x330
	FVector WorldLocation; // 0x334
	FVector2D Location2D; // 0x340
};

struct UPasswordDialogBase : UWindowRoot {
	FScriptMulticastDelegate SignalBack; // 0x398
	FScriptMulticastDelegate SignalOk; // 0x3a8
	FBlueprintSessionResult m_Session; // 0x430
};

struct UInterpGroupCamera : UInterpGroup {
	UCameraAnim* CameraAnimInst; // 0x50
	float CompressTolerance; // 0x58
};

struct UPaperdollPanel : URootWidget {
	UEquipmentInventory* m_EquipmentInventory; // 0x318
	UItemInventoryClientMonitor* m_InventoryMonitor; // 0x320
	AConanCharacter* m_CharacterToInspect; // 0x328
};

struct UPatchNotesEntryView : URootWidget {
	FLinearColor TextColorDate; // 0x318
	FLinearColor TextColorTitle; // 0x328
	FLinearColor TextColorNote; // 0x338
	UWidgetAnimation* AnimationSelected; // 0x348
	UWidgetAnimation* AnimationDeselected; // 0x350
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FRichCurve Translation[0x2]; // 0xd0
	FRichCurve Rotation; // 0x1b0
	FRichCurve Scale[0x2]; // 0x220
	FRichCurve Shear[0x2]; // 0x300
};

struct UInterpFilter : UObject {
	FString Caption; // 0x28
};

struct UPhysicalMaterial : UObject {
	float Friction; // 0x28
	EFrictionCombineMode FrictionCombineMode; // 0x2c
	bool bOverrideFrictionCombineMode; // 0x2d
	float Restitution; // 0x30
	EFrictionCombineMode RestitutionCombineMode; // 0x34
	bool bOverrideRestitutionCombineMode; // 0x35
	float Density; // 0x38
	float RaiseMassToPower; // 0x3c
	float DestructibleDamageThresholdScale; // 0x40
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x48
	EPhysicalSurface SurfaceType; // 0x50
	int32_t GatherMaterialTypeID; // 0x54
	int32_t SoundEmitterType; // 0x58
	bool CanBeClimbed; // 0x5c
	float ClimbingStaminaCostMultiplier; // 0x60
	float DamageToClimbingPlayer; // 0x64
	float DamageToTouchingCharacter; // 0x68
	float TireFrictionScale; // 0x6c
	TArray<FTireFrictionScalePair> TireFrictionScales; // 0x70
};

struct APaperSpriteActor : AActor {
	UPaperSpriteComponent* RenderComponent; // 0x3d0
};

struct UPurgeConfigData : UDataAsset {
	TArray<FName> CommunityDataTable; // 0x28
	int32_t SpawnCap; // 0x38
	int32_t SpawnLocationCap; // 0x3c
	float PurgeSpawnDistance; // 0x40
	float PurgeDuration; // 0x44
};

struct UServerStartupReport : UServerReport {
	FString MacAddress; // 0x50
	int32_t RevisionNumber; // 0x60
	int32_t SnapshotID; // 0x64
	int32_t QPort; // 0x68
	int32_t PlayerSlotCount; // 0x6c
	int32_t serverRegion; // 0x70
	int32_t serverType; // 0x74
	int32_t StartupTime; // 0x78
	FString ServerName; // 0x80
	FString ServerMapName; // 0x90
	FString Platform; // 0xa0
	int32_t IsOfficial; // 0xb0
};

struct USkyLightComponent : ULightComponentBase {
	ESkyLightSourceType SourceType; // 0x328
	UTextureCube* Cubemap; // 0x330
	float SourceCubemapAngle; // 0x338
	int32_t CubemapResolution; // 0x33c
	float SkyDistanceThreshold; // 0x340
	bool bLowerHemisphereIsBlack; // 0x344
	FLinearColor LowerHemisphereColor; // 0x348
	float OcclusionMaxDistance; // 0x358
	float Contrast; // 0x35c
	float MinOcclusion; // 0x360
	FColor OcclusionTint; // 0x364
	UTextureCube* BlendDestinationCubemap; // 0x418
};

struct UCraftingStationInventoryView : UExternalInventoryView {
	APlaceableBase* m_CraftingStation; // 0x388
	UCraftingQueue* m_CraftingQueue; // 0x390
	UItemInventory* m_DismantlerInventory; // 0x398
	UItemInventory* m_ArtisanThrallInventory; // 0x3a0
};

struct UServerRentalBase : UWindowRoot {
	UServerRentalServerDetails* m_CurrentExpandedServerDetails; // 0x398
	UServerRentalServerDetails* ServerRentalDetailClass; // 0x3a0
	UServerRentalRequestConnection* m_ServerRentalRequestConnection; // 0x3a8
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
	USCS_Node* RootNode; // 0x50
	TArray<USCS_Node*> ActorComponentNodes; // 0x58
};

struct UPickupFoliage : UInteractableFoliageBase {
	UDestructibleMesh* DestructibleMesh; // 0x9e0
	FScriptMulticastDelegate OnInstanceTakePointDamage; // 0xa00
	FScriptMulticastDelegate OnInstanceTakeRadialDamage; // 0xa10
	UDestructibleMesh* DestructibleMeshPtr; // 0xa20
};

struct UParticleModuleRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionFloat LifeMultiplier; // 0x30
};

struct UListEntryBase : UCharacterListEntryBase {
	UTexture2D* m_RankIconRecruit; // 0x390
	UTexture2D* m_RankIconMember; // 0x398
	UTexture2D* m_RankIconGuildMaster; // 0x3a0
	UTexture2D* m_RankIconOfficer; // 0x3a8
	UTexture2D* m_OnlineStatusIconOnline; // 0x3b0
	UTexture2D* m_OnlineStatusIconOffline; // 0x3b8
	UTextBlock* m_CharacterName; // 0x3c0
	UTextBlock* m_PlayerNickname; // 0x3c8
	UTextBlock* m_OnlineStatus; // 0x3d0
	UTextBlock* m_Level; // 0x3d8
	UTextBlock* m_Date; // 0x3e0
	UTextBlock* m_Event; // 0x3e8
	UImage* m_OnlineStatusIcon; // 0x3f0
	UImage* m_Rank; // 0x3f8
	FSlateColor m_OfflineColor; // 0x400
	FUniqueNetIdRepl m_PlayerNetId; // 0x430
	UUniqueID* m_GuildId; // 0x448
};

struct UFeedingTrayEntryView : URootWidget {
	AConanCharacter* m_Pet; // 0x328
	UThrallHungerSystemComponent* m_HungerSystem; // 0x330
};

struct USplineMeshComponent : UStaticMeshComponent {
	FSplineMeshParams SplineParams; // 0x830
	FVector SplineUpDir; // 0x888
	char bAllowSplineEditingPerInstance : 1; // 0x894
	char bSmoothInterpRollScale : 1; // 0x894
	ESplineMeshAxis ForwardAxis; // 0x898
	float SplineBoundaryMin; // 0x89c
	float SplineBoundaryMax; // 0x8a0
	UBodySetup* BodySetup; // 0x8a8
	FGuid CachedMeshBodySetupGuid; // 0x8b0
	char bMeshDirty : 1; // 0x8c0
};

struct UActorPersistenceComponent : UPersistenceComponent {
	bool SaveOnSpawn; // 0xf8
	float SaveFrequency; // 0xfc
	bool SkipSaving; // 0x100
	UUniqueID* UID; // 0x108
	FScriptMulticastDelegate OnSignalDataLoaded; // 0x110
	FScriptMulticastDelegate OnSignalPreSave; // 0x120
	bool m_bWasLoadedFromDB; // 0x130
};

struct UWebSocketConnection : UNetConnection {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMap; // 0x60
	TArray<UChannel*> OpenChannels; // 0x68
	TArray<AActor*> SentTemporaries; // 0x78
	AActor* ViewTarget; // 0x88
	AActor* OwningActor; // 0x90
	int32_t MaxPacket; // 0x98
	char InternalAck : 1; // 0x9c
	TArray<UObject*> AsyncLoadedObjects; // 0xa0
	FUniqueNetIdRepl PlayerId; // 0x170
	double LastReceiveTime; // 0x200
	TMap<AActor*, UActorChannel*> ActorChannels; // 0x334e0
	TArray<UChannel*> ChannelsToTick; // 0x33730
};

struct UFloatStatChangeSignalNode : UObject {
	FScriptMulticastDelegate SignalStatChanged; // 0x28
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x60
};

struct UHoudiniRuntimeSettings : UObject {
	EHoudiniRuntimeSettingsSessionType SessionType; // 0x28
	FString ServerHost; // 0x30
	int32_t ServerPort; // 0x40
	FString ServerPipeName; // 0x48
	bool bStartAutomaticServer; // 0x58
	float AutomaticServerTimeout; // 0x5c
	bool bShowMultiAssetDialog; // 0x60
	bool bEnableCooking; // 0x61
	bool bUploadTransformsToHoudiniEngine; // 0x62
	bool bTransformChangeTriggersCooks; // 0x63
	bool bDisplaySlateCookingNotifications; // 0x64
	bool bCookCurvesOnMouseRelease; // 0x65
	FText TemporaryCookFolder; // 0x68
	bool bTreatRampParametersAsMultiparms; // 0x80
	FString CollisionGroupNamePrefix; // 0x88
	FString RenderedCollisionGroupNamePrefix; // 0x98
	FString UCXCollisionGroupNamePrefix; // 0xa8
	FString UCXRenderedCollisionGroupNamePrefix; // 0xb8
	FString SimpleCollisionGroupNamePrefix; // 0xc8
	FString SimpleRenderedCollisionGroupNamePrefix; // 0xd8
	FString MarshallingAttributeMaterial; // 0xe8
	FString MarshallingAttributeMaterialHole; // 0xf8
	FString MarshallingAttributeInstanceOverride; // 0x108
	FString MarshallingAttributeFaceSmoothingMask; // 0x118
	FString MarshallingAttributeLightmapResolution; // 0x128
	FString MarshallingAttributeGeneratedMeshName; // 0x138
	FString MarshallingAttributeInputMeshName; // 0x148
	float MarshallingSplineResolution; // 0x158
	bool MarshallingLandscapesUseFullResolution; // 0x15c
	float GeneratedGeometryScaleFactor; // 0x160
	float TransformScaleFactor; // 0x164
	EHoudiniRuntimeSettingsAxisImport ImportAxis; // 0x168
	char bDoubleSidedGeometry : 1; // 0x16c
	UPhysicalMaterial* PhysMaterial; // 0x170
	ECollisionTraceFlag CollisionTraceFlag; // 0x178
	int32_t LightMapResolution; // 0x17c
	float LpvBiasMultiplier; // 0x180
	float GeneratedDistanceFieldResolutionScale; // 0x184
	FWalkableSlopeOverride WalkableSlopeOverride; // 0x188
	int32_t LightMapCoordinateIndex; // 0x198
	char bUseMaximumStreamingTexelRatio : 1; // 0x19c
	float StreamingDistanceMultiplier; // 0x1a0
	UFoliageType_InstancedStaticMesh* FoliageDefaultSettings; // 0x1a8
	TArray<UAssetUserData*> AssetUserData; // 0x1b0
	bool bUseFullPrecisionUVs; // 0x1c0
	int32_t SrcLightmapIndex; // 0x1c4
	int32_t DstLightmapIndex; // 0x1c8
	int32_t MinLightmapResolution; // 0x1cc
	bool bRemoveDegenerates; // 0x1d0
	EHoudiniRuntimeSettingsRecomputeFlag GenerateLightmapUVsFlag; // 0x1d1
	EHoudiniRuntimeSettingsRecomputeFlag RecomputeNormalsFlag; // 0x1d2
	EHoudiniRuntimeSettingsRecomputeFlag RecomputeTangentsFlag; // 0x1d3
	bool bUseMikkTSpace; // 0x1d4
	bool bUseCustomHoudiniLocation; // 0x1d5
	FDirectoryPath CustomHoudiniLocation; // 0x1d8
};

struct ADomeBase : AActor {
	float SavedRadius; // 0x3d8
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0xb8
	FGuid ObjectGuid; // 0xc8
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UBlueprintCore : UObject {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	bool bLegacyGeneratedClassIsAuthoritative; // 0x39
	FGuid BlueprintGuid; // 0x3c
};

struct UFCProgressbar : URootWidget {
	float progress; // 0x318
	TArray<FFCProgressbarSegment> Segments; // 0x320
	TArray<UProgressBar*> m_ProgressBars; // 0x338
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0x40
};

struct ANavigationObjectBase : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x3d8
	UBillboardComponent* GoodSprite; // 0x3e0
	UBillboardComponent* BadSprite; // 0x3e8
	char bIsPIEPlayerStart : 1; // 0x3f0
};

struct UW_LevelUpFIFOMessageView_C : UFIFOMessageView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x358
	UWidgetAnimation* FadeOut; // 0x360
	UWidgetAnimation* FadeIn; // 0x368
	UTextBlock* textView; // 0x370
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FIntegralCurve ParticleKeys; // 0xc8
};

struct ABuildableSpawner : AActor {
	FScriptMulticastDelegate SignalOnBuildingSpawned; // 0x3d0
	UClass* InstanceClass; // 0x3e0
	UUniqueID* BuildingID; // 0x408
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UOnlineSessionClient : UOnlineSession {
	bool bIsFromInvite; // 0x2b8
	bool bHandlingDisconnect; // 0x2b9
};

struct UParticleModuleTypeDataBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UMaterialExpressionParticleSize : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UDyeWindow : UWindowRoot {
	TWeakObjectPtr<UGameItem> DisplayedItem; // 0x398
	TArray<int32_t> DyeIndices; // 0x3a0
	TArray<int32_t> SavedDyeIndices; // 0x3b0
	int32_t SelectedTintChannel; // 0x3c0
};

struct UCharacterEncumbranceBar : URootWidget {
	AConanCharacter* Character; // 0x318
};

struct USlateSettings : UObject {
	bool bVirtualKeyboardSendsTextChanged; // 0x28
	bool bVirtualKeyboardDisplayOnFocus; // 0x29
	bool bExplicitCanvasChildZOrder; // 0x2a
};

struct UGraniteTileSet : UObject {
	FString GTSFileName; // 0x28
	float LODBias; // 0x38
	EGraniteTranscoderQuality TranscoderQuality; // 0x3c
	int32_t NumberOfMipsToPrefetch; // 0x40
	int32_t NumberOfMipsToPin; // 0x44
	uint32_t NumLayers; // 0x48
	uint32_t NumTextures; // 0x4c
	EGraniteGPUCacheGroup gpuCacheGroup; // 0x50
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate onSuccess; // 0x28
	FScriptMulticastDelegate onFailure; // 0x38
};

struct UInterpFilter_Classes : UInterpFilter {
	FString Caption; // 0x28
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x430
	UCharacterMovementComponent* CharacterMovement; // 0x438
	UCapsuleComponent* CapsuleComponent; // 0x440
	FBasedMovementInfo BasedMovement; // 0x448
	FBasedMovementInfo ReplicatedBasedMovement; // 0x478
	float AnimRootMotionTranslationScale; // 0x4a8
	FVector BaseTranslationOffset; // 0x4ac
	FQuat BaseRotationOffset; // 0x4c0
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x4d0
	char ReplicatedMovementMode; // 0x4d4
	bool bInBaseReplication; // 0x4d5
	float CrouchedEyeHeight; // 0x4d8
	char bIsCrouched : 1; // 0x4dc
	char bIsClimbing : 1; // 0x4dc
	char bPressedJump : 1; // 0x4dc
	char bClientUpdating : 1; // 0x4dc
	char bClientWasFalling : 1; // 0x4dc
	char bClientResimulateRootMotion : 1; // 0x4dc
	char bClientResimulateRootMotionSources : 1; // 0x4dc
	char bSimGravityDisabled : 1; // 0x4dc
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x4dc
	char bServerMoveIgnoreRootMotion : 1; // 0x4dc
	float JumpKeyHoldTime; // 0x4e0
	float JumpMaxHoldTime; // 0x4e4
	int32_t JumpMaxCount; // 0x4e8
	int32_t JumpCurrentCount; // 0x4ec
	char bWasJumping : 1; // 0x4f0
	FScriptMulticastDelegate OnReachedJumpApex; // 0x4f8
	FScriptMulticastDelegate MovementModeChangedDelegate; // 0x518
	FScriptMulticastDelegate OnCharacterMovementUpdated; // 0x528
	FRootMotionSourceGroup SavedRootMotion; // 0x538
	FRootMotionMovementParams ClientRootMotionParams; // 0x640
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x680
	FRepRootMotionMontage RepRootMotion; // 0x690
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x60
	float Period; // 0x98
};

struct AConanAmbientSound : AActor {
	UConanAudioComponent* AudioComponent; // 0x3d0
};

struct UVaultActorComponent : UActorComponent {
	FScriptMulticastDelegate OnVaultInitialized; // 0xf8
	FScriptMulticastDelegate OnExhaustedValueChanged; // 0x108
	FName vaultName; // 0x118
	bool bIsExhausted; // 0x120
	AVaultManager* vaultManagerPtr; // 0x128
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x60
};

struct UMovieSceneFadeSection : UMovieSceneFloatSection {
	FLinearColor FadeColor; // 0x140
	char bFadeAudio : 1; // 0x150
};

struct UIntSerialization : UObject {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	uint8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct USettingsBase : UWindowRoot {
	USoundBase* SettingsButtonSound; // 0x398
	USoundBase* ApplySettingsSound; // 0x3b8
	USoundBase* SettingsBackSound; // 0x3d8
	USoundBase* RestoreDefaultsSound; // 0x3f8
	UMessageBoxWidget* m_AccessWarning; // 0x470
	UMessageBoxWidget* m_WaitingForServer; // 0x478
	UInputComponent* m_DialogInputComponent; // 0x4b8
	FText m_RestoreDefaultText; // 0x4c0
	FText m_ClearKeyBinidngText; // 0x4d8
	FText m_ScrollText; // 0x4f0
	FText m_ApplyText; // 0x508
};

struct APlayerStart : ANavigationObjectBase {
	FName PlayerStartTag; // 0x3f8
};

struct UItemStatView : URootWidget {
	int32_t fontSize; // 0x318
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UMaterialExpressionPreSkinnedPosition : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4c
	char bShowOutputs : 1; // 0x4c
	TArray<FExpressionOutput> Outputs; // 0x50
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	ALandscape* LandscapeActor; // 0x800
};

struct UUserInterfaceSettings : UDeveloperSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	FStringClassReference DefaultCursor; // 0x40
	FStringClassReference TextEditBeamCursor; // 0x50
	FStringClassReference CrosshairsCursor; // 0x60
	FStringClassReference HandCursor; // 0x70
	FStringClassReference GrabHandCursor; // 0x80
	FStringClassReference GrabHandClosedCursor; // 0x90
	FStringClassReference SlashedCircleCursor; // 0xa0
	float ApplicationScale; // 0xb0
	EUIScalingRule UIScaleRule; // 0xb4
	FStringClassReference CustomScalingRuleClass; // 0xb8
	FRuntimeFloatCurve UIScaleCurve; // 0xc8
	bool bLoadWidgetsOnDedicatedServer; // 0x140
	TArray<UObject*> CursorClasses; // 0x148
	UObject* CustomScalingRuleClassInstance; // 0x158
	UDPICustomScalingRule* CustomScalingRule; // 0x160
};

struct UInterpTrackInstFloatParticleParam : UInterpTrackInst {
	float ResetFloat; // 0x28
};

struct UMapWithMarkerWidget : URootWidget {
	int32_t MinimumZoom; // 0x318
	int32_t ZoomSteps; // 0x31c
	float ZoomFactor; // 0x320
	UMapMarkerView* MapMarkerView; // 0x328
	UTexture2D* MapTexture; // 0x330
	UTexture2D* MapMaskBitmap; // 0x338
	UTexture2D* ThrallIcon; // 0x340
	FLinearColor IllegalPosTintColor; // 0x348
	FScriptMulticastDelegate SignalMarkerIsHovered; // 0x358
	FVector2D GamepadCursorOffset; // 0x38c
	FMapCoordinatesAndSpans m_MapCoordinateValues; // 0x394
	float FrictionMultiplier; // 0x3c4
	UScrollBox* m_HScrollBox; // 0x3c8
	UScrollBox* m_VScrollBox; // 0x3d0
	UOverlay* m_Overlay; // 0x3d8
	UOverlay* m_MasterOverlay; // 0x3e0
	USizeBox* m_MapSizeBox; // 0x3e8
	UImage* m_MapImage; // 0x3f0
	UImage* m_GamepadCursor; // 0x3f8
	TMap<int64_t, UMapMarkerView*> m_Markers; // 0x400
	TMap<int64_t, UMapMarkerView*> m_ThrallMarkers; // 0x450
	UPlayerMarkerDialog* m_PlayerMarkerDialog; // 0x4a0
	USizeBox* m_DebugEnergyMapSizeBox; // 0x4a8
	UImage* m_DebugEnergyMapImage; // 0x4b0
	FVector2D m_DebugImageTopLeft; // 0x4b8
	FVector2D m_DebugImageBottomRight; // 0x4c0
	DelegateProperty m_UpdatedDelegate; // 0x5b0
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xd98
	float ServerFlushLogInterval; // 0xd9c
	UGameInstance* GameInstance; // 0xda0
};

struct UNiagaraEffectRendererProperties : UObject {
	FName Dummy; // 0x28
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x38
	float PitchMax; // 0x3c
	float VolumeMin; // 0x40
	float VolumeMax; // 0x44
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x410
	FName PreviousMatchState; // 0x418
	int32_t ElapsedTime; // 0x420
};

struct UTwitchAuthBase : UWindowRoot {
	UCanvasPanel* MainCanvasPanel; // 0x398
	USizeBox* InGameAuthBox; // 0x3a0
	UVerticalBox* BarBox; // 0x3a8
	UVerticalBox* TokenAuthBox; // 0x3b0
	USizeBox* DisconnectBox; // 0x3b8
	UFCButton* B_CopyWebpage; // 0x3c0
	UFCButton* B_CopyDisconnectWebpage; // 0x3c8
	UFCButton* B_AuthAuto; // 0x3d0
	UFCButton* B_AuthToken; // 0x3d8
	UFCButton* B_Disconnect; // 0x3e0
	UFCButton* B_Cancel; // 0x3e8
	UFCRichTextBlock* T_LinkingWebpageText; // 0x3f0
	UFCEditableTextBox* T_Token; // 0x3f8
	UFCRichTextBlock* T_DisconnectWebpageText; // 0x400
	UTextBlock* T_UpperText; // 0x408
	UTextBlock* T_LowerText; // 0x410
};

struct ULandscapeSplineSegment : UObject {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct AInfo : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x80
	char bHidden : 1; // 0x84
	char bNetTemporary : 1; // 0x84
	char bNetStartup : 1; // 0x84
	char bOnlyRelevantToOwner : 1; // 0x84
	char bAlwaysRelevant : 1; // 0x84
	char bReplicateMovement : 1; // 0x84
	char bTearOff : 1; // 0x84
	char bExchangedRoles : 1; // 0x84
	char bPendingNetUpdate : 1; // 0x85
	char bNetLoadOnClient : 1; // 0x85
	char bNetUseOwnerRelevancy : 1; // 0x85
	char bBlockInput : 1; // 0x85
	char bAllowTickBeforeBeginPlay : 1; // 0x85
	char bActorEnableCollision : 1; // 0x86
	char bReplicates : 1; // 0x86
	char bLostRelevancy : 1; // 0x86
	FName NetDriverName; // 0x88
	char bCanBeInCluster : 1; // 0x90
	ENetRole RemoteRole; // 0x91
	AActor* Owner; // 0x98
	FRepMovement ReplicatedMovement; // 0xa0
	FRepAttachment AttachmentReplication; // 0xd8
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	EInputConsumeOptions InputConsumeOption; // 0x128
	float NetCullDistanceSquared; // 0x12c
	float ViewTargetNetCullDistanceSquared; // 0x130
	int32_t NetTag; // 0x134
	float NetUpdateTime; // 0x138
	float NetUpdateFrequency; // 0x13c
	float MinNetUpdateFrequency; // 0x140
	float NetPriority; // 0x144
	float LastNetUpdateTime; // 0x148
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14d
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	TArray<FName> Layers; // 0x198
	TWeakObjectPtr<AActor> ParentComponentActor; // 0x1a8
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x1b0
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x1b8
	char bUseExtendedRelevancyTimeout : 1; // 0x1b8
	char bActorSeamlessTraveled : 1; // 0x1b8
	char bIgnoresOriginShifting : 1; // 0x1b8
	char bEnableAutoLODGeneration : 1; // 0x1b8
	TArray<FName> Tags; // 0x1c0
	uint64_t HiddenEditorViews; // 0x1d0
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1d8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f8
	FScriptMulticastDelegate OnActorEndOverlap; // 0x208
	FScriptMulticastDelegate OnBeginCursorOver; // 0x218
	FScriptMulticastDelegate OnEndCursorOver; // 0x228
	FScriptMulticastDelegate OnClicked; // 0x238
	FScriptMulticastDelegate OnReleased; // 0x248
	FScriptMulticastDelegate OnInputTouchBegin; // 0x258
	FScriptMulticastDelegate OnInputTouchEnd; // 0x268
	FScriptMulticastDelegate OnInputTouchEnter; // 0x278
	FScriptMulticastDelegate OnInputTouchLeave; // 0x288
	FScriptMulticastDelegate OnActorHit; // 0x298
	FScriptMulticastDelegate OnDestroyed; // 0x2a8
	FScriptMulticastDelegate OnEndPlay; // 0x2b8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x3a8
	TArray<UActorComponent*> InstanceComponents; // 0x3b8
};

struct UW_Settings_Control_C : USettingsControlBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x388
	UTextBlock* Category; // 0x390
	UW_ButtonNormal_C* CB_MouseInvertY; // 0x398
	UW_ButtonNormal_C* CB_RightAxisInvertY; // 0x3a0
	UTextBlock* ControllerCategory; // 0x3a8
	UGridPanel* MouseSettings; // 0x3b0
	UW_EditableLabeledSlider_C* S_AimSensitivity; // 0x3b8
	UW_EditableLabeledSlider_C* S_LeftAxisDeadzone; // 0x3c0
	UW_EditableLabeledSlider_C* S_RightAxisAimSensitivity; // 0x3c8
	UW_EditableLabeledSlider_C* S_RightAxisDeadzone; // 0x3d0
	UW_EditableLabeledSlider_C* S_RightAxisSensitivity; // 0x3d8
	UW_EditableLabeledSlider_C* S_Sensitivity; // 0x3e0
};

struct UNpcDebugWindow : URootWidget {
	UTextBlock* SpawnNameValue; // 0x318
	UTextBlock* AiLodValue; // 0x320
	UTextBlock* BtInfoValue; // 0x328
	UTextBlock* BehaviourVal; // 0x330
	UTextBlock* TacticVal; // 0x338
	UTextBlock* TargetVal; // 0x340
	UTextBlock* DistanceVal; // 0x348
	UTextBlock* MoveTypeVal; // 0x350
	UTextBlock* BlackboardVal; // 0x358
	UBorder* SpawnNameBox; // 0x360
	UBorder* AiLodBox; // 0x368
	UBorder* BtInfoBox; // 0x370
	UBorder* BehaviourBox; // 0x378
	UBorder* TacticBox; // 0x380
	UBorder* TargetBox; // 0x388
	UBorder* DistanceBox; // 0x390
	UBorder* MoveTypeBox; // 0x398
	UBorder* BlackboardBox; // 0x3a0
};

struct UInputComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xa8
	char bIsClientOnly : 1; // 0xa8
	char bNetAddressable : 1; // 0xa8
	char bAllowAnyoneToDestroyMe : 1; // 0xa8
	char bCreatedByConstructionScript : 1; // 0xa8
	char bInstanceComponent : 1; // 0xa8
	char bAutoActivate : 1; // 0xa8
	char bIsActive : 1; // 0xa8
	char bEditableWhenInherited : 1; // 0xa8
	char bCanEverAffectNavigation : 1; // 0xa8
	char bIsEditorOnly : 1; // 0xa8
	EComponentCreationMethod CreationMethod; // 0xb1
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xc0
	FScriptMulticastDelegate OnComponentActivated; // 0xd0
	FScriptMulticastDelegate OnComponentDeactivated; // 0xe0
};

struct UMaterialFunction : UObject {
	FGuid StateId; // 0x28
	FString Description; // 0x38
	char bExposeToLibrary : 1; // 0x48
	TArray<UMaterialExpression*> FunctionExpressions; // 0x50
	char bReentrantFlag : 1; // 0x60
};

struct UParticleModuleEventReceiverKillParticles : UParticleModuleEventReceiverBase {
	char bStopSpawning : 1; // 0x40
};

struct UAnimSet : UObject {
	char bAnimRotationOnly : 1; // 0x28
	TArray<FName> TrackBoneNames; // 0x30
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x40
	TArray<char> BoneUseAnimTranslation; // 0x50
	TArray<char> ForceUseMeshTranslation; // 0x60
	TArray<FName> UseTranslationBoneNames; // 0x70
	TArray<FName> ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98
};

struct UAnimCompress_Automatic : UAnimCompress {
	float MaxEndEffectorError; // 0x40
	char bTryFixedBitwiseCompression : 1; // 0x44
	char bTryPerTrackBitwiseCompression : 1; // 0x44
	char bTryLinearKeyRemovalCompression : 1; // 0x44
	char bTryIntervalKeyRemoval : 1; // 0x44
	char bRunCurrentDefaultCompressor : 1; // 0x44
	char bAutoReplaceIfExistingErrorTooGreat : 1; // 0x44
	char bRaiseMaxErrorToExisting : 1; // 0x44
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x70
};

struct USoundNodeOscillator : USoundNode {
	char bModulateVolume : 1; // 0x38
	char bModulatePitch : 1; // 0x38
	float AmplitudeMin; // 0x3c
	float AmplitudeMax; // 0x40
	float FrequencyMin; // 0x44
	float FrequencyMax; // 0x48
	float OffsetMin; // 0x4c
	float OffsetMax; // 0x50
	float CenterMin; // 0x54
	float CenterMax; // 0x58
};

struct USoundClass : UObject {
	FSoundClassProperties Properties; // 0x28
	TArray<USoundClass*> ChildClasses; // 0x58
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0x68
	USoundClass* ParentClass; // 0x78
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UParticleModuleLifetimeBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x28
	char LODDuplicate : 1; // 0x28
	char bSupportsRandomSeed : 1; // 0x28
	char bRequiresLoopingNotification : 1; // 0x28
	char LODValidity; // 0x2c
};

struct UInterpTrackToggle : UInterpTrack {
	TArray<FToggleTrackKey> ToggleTrack; // 0x70
	char bActivateSystemEachUpdate : 1; // 0x80
	char bActivateWithJustAttachedFlag : 1; // 0x80
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UW_FriendListEntry_C : UFriendListEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x470
	UHorizontalBox* ActionsBox; // 0x478
	UW_ButtonCustom_C* B_BlockFriend; // 0x480
	UW_ButtonCustom_C* B_InviteToSession; // 0x488
	UW_ButtonCustom_C* B_RemoveFriend; // 0x490
	UBorder* Container; // 0x498
};

struct URateServerBase : UWindowRoot {
	URatingServerRequestConnection* m_ServerConnection; // 0x400
	UMessageBoxWidget* m_ErrorDialog; // 0x408
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct UUdpMessagingSettings : UObject {
	bool EnableTransport; // 0x28
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	char MulticastTimeToLive; // 0x50
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UOnlinePIESettings : UDeveloperSettings {
	bool bOnlinePIEEnabled; // 0x38
	TArray<FPIELoginSettingsInternal> Logins; // 0x40
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x7c8
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x7d0
	char bUseBoundsFromMasterPoseComponent : 1; // 0x82c
	UPhysicsAsset* PhysicsAssetOverride; // 0x850
	int32_t ForcedLodModel; // 0x858
	int32_t MinLodModel; // 0x85c
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x870
	float StreamingDistanceMultiplier; // 0x880
	FColor WireframeColor; // 0x884
	char bForceWireframe : 1; // 0x888
	char bDisplayBones : 1; // 0x888
	char bDisableMorphTarget : 1; // 0x888
	char bHideSkin : 1; // 0x888
	char bPerBoneMotionBlur : 1; // 0x8a0
	char bComponentUseFixedSkelBounds : 1; // 0x8a0
	char bConsiderAllBodiesForBounds : 1; // 0x8a0
	EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0x8a4
	char bForceMeshObjectUpdate : 1; // 0x8a8
	char bCanHighlightSelectedSections : 1; // 0x8a8
	char bRecentlyRendered : 1; // 0x8a8
	char CustomSortAlternateIndexMode; // 0x8ac
	char bCastCapsuleDirectShadow : 1; // 0x8b0
	char bCastCapsuleIndirectShadow : 1; // 0x8b0
	float CapsuleIndirectShadowMinVisibility; // 0x8b4
	char bCPUSkinning : 1; // 0x8b8
	FBoxSphereBounds CachedLocalBounds; // 0x8cc
	bool bCachedLocalBoundsUpToDate; // 0x8e8
	bool bEnableUpdateRateOptimizations; // 0x8e9
	bool bDisplayDebugUpdateRateOptimizations; // 0x8ea
};

struct USafeZoneSlot : UPanelSlot {
	bool bIsTitleSafe; // 0x38
	FMargin SafeAreaScale; // 0x3c
	EHorizontalAlignment HAlign; // 0x4c
	EVerticalAlignment VAlign; // 0x4d
	FMargin Padding; // 0x50
};

struct UW_ActionTutorial_C : UActionTutorial {
	UW_HotkeyIcon_C* Icon; // 0x3f0
	UTextBlock* PostText; // 0x3f8
	UTextBlock* PreText; // 0x400
};

struct UWidgetSwitcher : UPanelWidget {
	int32_t ActiveWidgetIndex; // 0x130
};

struct ACharacterLodSystem : AInfo {
	int32_t SimultaneousIK; // 0x3d0
	float IKLodUpdateInterval; // 0x3d4
	float IKRange; // 0x3d8
	int32_t SimultaneousHighQualityHair; // 0x3dc
	float HairLodUpdateInterval; // 0x3e0
	TArray<AActor*> IKActors; // 0x3f0
	TArray<UCharacterCustomizationComponent*> HighQualityHairComponents; // 0x408
	TMap<AActor*, FEmpty> m_EnabledClothSimActors; // 0x430
	TMap<AActor*, FEmpty> m_AllClothSimActors; // 0x480
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x3f0
	TArray<AOnlineBeaconClient*> ClientActors; // 0x3f8
};

struct UBaseVoiceTransmissionIndicator : UWindowRoot {
	bool CloseOnClick; // 0x318
	bool BlockPlayerInput; // 0x319
	FSlateSound OpeningSlateSound; // 0x320
	FSlateSound ClosingSlateSound; // 0x338
	FScriptMulticastDelegate SignalClosing; // 0x350
	FScriptMulticastDelegate SignalOpened; // 0x360
	TArray<FGamepadHotkeyHelp> m_WindowHotkeys; // 0x370
	UInputComponent* m_InputComponent; // 0x380
	UGUIModule* m_GUIModule; // 0x388
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xe0
};

struct UMaterialExpressionGraniteTextureObject : UMaterialExpressionGraniteTextureBase {
	UGraniteTexture* Texture; // 0x60
	int32_t PreviewLayer; // 0x68
};

struct UTemplateIdTableAccessor : UTableAccessor {
	UDataTable* table; // 0x28
};

struct UBlackboardKeyType_String : UBlackboardKeyType {
	FString StringValue; // 0x30
};

struct UW_Friends_FriendRequests_C : UFriendRequestGame {
	UW_NavigatableVerticalBox_C* FriendRequestEntryList; // 0x3c8
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x3d0
};

struct UW_NavigatableGridPanel_C : UNavigatableGridPanel {
	int32_t RowLength; // 0x3a8
	TArray<float> ColumnFill; // 0x3b0
	TArray<float> RowFill; // 0x3c0
};

struct UVerticalBox : UPanelWidget {
	TArray<UPanelSlot*> Slots; // 0x118
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x120
	FSlateBrush BorderBrush; // 0x250
	FSlateColor BorderColor; // 0x2e0
	bool bIsExpanded; // 0x308
	float MaxHeight; // 0x30c
	FMargin HeaderPadding; // 0x310
	FMargin AreaPadding; // 0x320
	FScriptMulticastDelegate OnExpansionChanged; // 0x330
	UWidget* HeaderContent; // 0x340
	UWidget* BodyContent; // 0x348
};

struct UParticleSystem : UObject {
	EParticleSystemUpdateMode SystemUpdateMode; // 0x28
	float UpdateTime_FPS; // 0x2c
	float UpdateTime_Delta; // 0x30
	float WarmupTime; // 0x34
	float WarmupTickRate; // 0x38
	TArray<UParticleEmitter*> Emitters; // 0x40
	UParticleSystemComponent* PreviewComponent; // 0x50
	UInterpCurveEdSetup* CurveEdSetup; // 0x58
	char bOrientZAxisTowardCamera : 1; // 0x60
	float LODDistanceCheckTime; // 0x64
	ParticleSystemLODMethod LODMethod; // 0x68
	TArray<float> LODDistances; // 0x70
	char bRegenerateLODDuplicate : 1; // 0x80
	TArray<FParticleSystemLOD> LODSettings; // 0x88
	char bUseFixedRelativeBoundingBox : 1; // 0x98
	FBox FixedRelativeBoundingBox; // 0x9c
	float SecondsBeforeInactive; // 0xb8
	char bShouldResetPeakCounts : 1; // 0xbc
	char bHasPhysics : 1; // 0xbc
	char bUseRealtimeThumbnail : 1; // 0xbc
	char ThumbnailImageOutOfDate : 1; // 0xbc
	float Delay; // 0xc0
	float DelayLow; // 0xc4
	char bUseDelayRange : 1; // 0xc8
	bool bAutoDeactivate; // 0xcc
	uint32_t MinTimeBetweenTicks; // 0xd0
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xd4
	float InsignificanceDelay; // 0xd8
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xdc
	FVector MacroUVPosition; // 0xe0
	float MacroUVRadius; // 0xec
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0xf0
	FBox CustomOcclusionBounds; // 0xf4
	TArray<FLODSoloTrack> SoloTracking; // 0x110
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0x120
};

struct UAIPerceptionComponent : UActorComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xf8
	UAISense* DominantSense; // 0x108
	AAIController* AIOwner; // 0x120
	FScriptMulticastDelegate OnPerceptionUpdated; // 0x1a8
	FScriptMulticastDelegate OnTargetPerceptionUpdated; // 0x1b8
};

struct UCheckBoxStyleAsset : UObject {
	FCheckBoxStyle CheckBoxStyle; // 0x28
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x98
	FExpressionInput AGreaterThanB; // 0xd0
	FExpressionInput AEqualsB; // 0x108
	FExpressionInput ALessThanB; // 0x140
	float EqualsThreshold; // 0x178
	float ConstB; // 0x17c
	float ConstAEqualsB; // 0x180
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x3d8
	UDrawFrustumComponent* DrawFrustum; // 0x3e0
};

