namespace off {
	constexpr auto GNames = 0x61a9b40;
	constexpr auto GObjects = 0x61c22d0;
	constexpr auto GWorld = 0x62f8800;
}
struct UCrowReplicationGraphSettings {
	TArray<FCrowReplicationRPCPolicyInfo> RPC_PolicySettingsList; // 0x38
	FCrowRepGraphSettings DefaultReplicationSettings; // 0x48
	TArray<FCrowRepGraphSettings> ReplicationSettingsList; // 0xb0
	bool OverrideReplicationSettings; // 0xc0
	uint32_t OverrideReplicationSettingsIndex; // 0xc4
	TArray<float> ScopeSightRateHalfFOVArray; // 0xc8
	TArray<float> ScopeSightRateDistanceDivider; // 0xd8
	bool ShowConnectionReplicationLog; // 0xe8
	bool ShowAlwaysRelevantReplicationLog; // 0xe9
	bool ShowPawnReplicationLog; // 0xea
	bool ShowGridReplicationLog; // 0xeb
	bool ShowPlayerStateReplicationLog; // 0xec
	uint32_t ReplicationSettingsIndex; // 0xf0
};

struct UDynamicMeshBrushTool {
	UPreviewMesh* PreviewMesh; // 0x1c0
};

struct UNiagaraDataInterfaceCamera {
	int32_t PlayerControllerIndex; // 0x38
	bool bRequireCurrentFrameData; // 0x3c
};

struct UCrowTabMenuWeaponCategoryWidget {
	UCrowCustomizeItemDescWidget* CustomizeItemDescWidget; // 0x380
};

struct UWB_Crosshair_Mh6_Flare_C {
	UImage* IMG_ZoomIn; // 0x460
	UImage* IMG_ZoomIn_5; // 0x468
};

struct ACrowWorldEventSupply {
	UStaticMeshComponent* StartPoint; // 0x370
	UStaticMeshComponent* EndPoint; // 0x378
	float MovingSpeed; // 0x380
	ACrowSupplyEventPlaneActor* TransportActor; // 0x388
	ACrowSupplyEventBoxActor* SupplyBoxActor; // 0x390
	float DelayTimeMin; // 0x398
	float DelayTimeMax; // 0x39c
	int32_t SupplyDropBoxCount; // 0x3a0
	float DropIntervalTimeMin; // 0x3a4
	float DropIntervalTimeMax; // 0x3a8
	TArray<int32_t> FixItemIndexArray; // 0x3b0
	ACrowSupplyEventPlaneActor* PlaneActor; // 0x3c0
};

struct UMaterialExpressionLandscapeGrassOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct UNiagaraComponentPool {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UAnimInstance {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct UWaterSplineComponent {
	FWaterSplineCurveDefaults WaterSplineDefaults; // 0x538
	FWaterSplineCurveDefaults PreviousWaterSplineDefaults; // 0x548
};

struct UUserDefinedStruct {
	EUserDefinedStructureStatus Status; // 0xc0
	FGuid Guid; // 0xc4
};

struct UCrowCloudScapeDataAsset {
	TArray<FCrowCloudScapeSetting> Settings; // 0x30
};

struct ACrowMeshDestructionActor {
	USceneComponent* SceneRoot; // 0x220
	UCrowWorldDestructionAUD* DestructionAUD; // 0x228
	UCrowChainExplosionDamageType* ChainExplosionDamageType; // 0x230
	ECrowWorldDestructionCause DestructionCause; // 0x240
	bool IsDedicatedServer; // 0x241
	USkeletalMeshComponent* SimulationSKC; // 0x248
	ADestructibleActor* DestructibleActor; // 0x250
	UDestructibleComponent* DestructibleComponent; // 0x258
	float DestroyTime; // 0x260
	FTimerHandle DestroyTimerHandle; // 0x268
	float ExplosionDamage; // 0x270
	float ExplosionDamageRadius; // 0x274
	float ExplosionDamageTime; // 0x278
	float HitGroundTime; // 0x27c
	int32_t HitGroundCount; // 0x280
	TArray<UFXSystemComponent*> FxComponents; // 0x288
	TArray<UFXSystemComponent*> FxComponentsAttached; // 0x298
	TArray<UPrimitiveComponent*> TemporalMeshes; // 0x2a8
};

struct UMovieSceneEventTriggerSection {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct UMovieScenePrimitiveMaterialSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe8
};

struct ACrowSupplyEventBoxActor {
	ACrowWorldIconActor* RewardIconActor; // 0x2c8
	UParticleSystemComponent* RewardSmokeEffect; // 0x2d0
	UCrowSimpleBuoyancyComponent* BuoyancyComponent; // 0x2d8
	int32_t DefaultItemIndex; // 0x2e0
	ACrowSupplyEventParachuteActor* ParachuteClass; // 0x2e8
	UAnimationAsset* ParachuteDownAni; // 0x2f0
	UAnimationAsset* ParachuteUpAni; // 0x2f8
	float DropHeight; // 0x300
	float MaxSpeed; // 0x304
	UParticleSystem* EffectSmoke; // 0x308
	FCrowGameIconDisplayInfo IconDisplayInfo; // 0x310
	UParticleSystemComponent* EffectSmokeComp; // 0x398
	ACrowSupplyEventParachuteActor* ParachuteActor; // 0x3a0
	ECrowSupplyEventState EventState; // 0x3a8
	char OwnerTeamID; // 0x3a9
	char SquadRewardIndex; // 0x3aa
};

struct AInteractiveFoliageActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	FVector TouchingActorEntryPosition; // 0x238
	FVector FoliageVelocity; // 0x244
	FVector FoliageForce; // 0x250
	FVector FoliagePosition; // 0x25c
	float FoliageDamageImpulseScale; // 0x268
	float FoliageTouchImpulseScale; // 0x26c
	float FoliageStiffness; // 0x270
	float FoliageStiffnessQuadratic; // 0x274
	float FoliageDamping; // 0x278
	float MaxDamageImpulse; // 0x27c
	float MaxTouchImpulse; // 0x280
	float MaxForce; // 0x284
	float Mass; // 0x288
};

struct ATemplateSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x228
	UTemplateSequencePlayer* SequencePlayer; // 0x240
	FSoftObjectPath TemplateSequence; // 0x248
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x260
};

struct ULocationServicesImpl {
	FMulticastInlineDelegate OnLocationChanged; // 0x28
};

struct UCrowSquadLoadoutWidget {
	UCrowCountdownWidget* WB_Objective_CountDown; // 0x368
	UCrowButton* BT_EscBack; // 0x370
	UCrowButton* BT_SelectComplete; // 0x378
	UHorizontalBox* HB_Weapon_Main; // 0x380
	UHorizontalBox* HB_Weapon_Sub; // 0x388
	UHorizontalBox* HB_Weapon_Melee; // 0x390
	UHorizontalBox* HB_Gadget_Throwable; // 0x398
	UHorizontalBox* HB_Gadget_Healkit; // 0x3a0
	TArray<UCrowSquadLoadoutSlotWeaponWidget*> WeaponMainWidgetArray; // 0x3a8
	TArray<UCrowSquadLoadoutSlotWeaponWidget*> WeaponSubWidgetArray; // 0x3b8
	TArray<UCrowSquadLoadoutSlotWeaponWidget*> WeaponMeleeWidgetArray; // 0x3c8
	TArray<UCrowSquadLoadoutSlotGadgetWidget*> GadgetThrowableWidgetArray; // 0x3d8
	TArray<UCrowSquadLoadoutSlotGadgetWidget*> GadgetHealkitWidgetArray; // 0x3e8
};

struct UCrowRankingDateInfoTableManager {
	TMap<uint32_t, FCrowRankingDateInfoTableRow> RankingDateInfoTable; // 0x28
};

struct UMultiTransformer {
	UInteractiveGizmoManager* GizmoManager; // 0x70
	UTransformGizmo* TransformGizmo; // 0xe0
	UTransformProxy* TransformProxy; // 0xe8
};

struct UParticleModuleSpawnPerUnit {
	float UnitScalar; // 0x38
	float MovementTolerance; // 0x3c
	FRawDistributionFloat SpawnPerUnit; // 0x40
	float MaxFrameDistance; // 0x70
	char bIgnoreSpawnRateWhenMoving : 1; // 0x74
	char bIgnoreMovementAlongX : 1; // 0x74
	char bIgnoreMovementAlongY : 1; // 0x74
	char bIgnoreMovementAlongZ : 1; // 0x74
};

struct UAmbisonicsEncodingSettings {
	int32_t AmbisonicsOrder; // 0x28
};

struct ACrowItemVehicleSkin {
	FCrowItemData ItemData; // 0x2b8
	FCrowVehicleSkinTableRow ItemTable; // 0x2e8
	TArray<UObject*> VehicleClassArray; // 0x4a0
};

struct UMeshSimplificationSettings {
	FName MeshReductionModuleName; // 0x38
};

struct UTextureLightProfile {
	float Brightness; // 0x100
	float TextureMultiplier; // 0x104
};

struct UCrowKeyGuideSlotWidget {
	URichTextBlock* RTBMessage; // 0x348
	UTextBlock* TBDescription; // 0x350
};

struct ACrowSafeBoxEventBox {
	USceneComponent* EffectNormal; // 0x388
	USkeletalMeshComponent* BoxMesh; // 0x390
};

struct UCrowScoreBoardConquestUserWidget {
	UWidgetSwitcher* WS_ScoreBoard; // 0x348
	UCrowButton* BT_EscBack; // 0x350
	UImage* IMG_AllyIcon; // 0x358
	UImage* IMG_EnemyIcon; // 0x360
	UCrowScoreInfoConquestUserSummary* WB_ConquestScoreAlly; // 0x368
	UCrowScoreInfoConquestUserSummary* WB_ConqestScoreEnemy; // 0x370
	FSlateBrush RedTeamImage; // 0x378
	FSlateBrush BlueTeamImage; // 0x400
	ACrowGameStateConquest* CrowGameStateConquest; // 0x488
	ACrowPlayerStateBase* LocalPlayerState; // 0x490
};

struct UFieldSystemMetaDataProcessingResolution {
	EFieldResolutionType ResolutionType; // 0xb0
};

struct UInterpTrackInstSlomo {
	float OldTimeDilation; // 0x28
};

struct UAkXboxOneInitializationSettings {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXboxOneApuHeapInitializationSettings ApuHeapSettings; // 0x88
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkXboxOneAdvancedInitializationSettings AdvancedSettings; // 0xb8
};

struct UOperatorField {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct AGroomActor {
	UGroomComponent* GroomComponent; // 0x220
};

struct USteamVRHQStereoLayerShape {
	bool bCurved; // 0x28
	bool bAntiAlias; // 0x29
	float AutoCurveMinDistance; // 0x2c
	float AutoCurveMaxDistance; // 0x30
};

struct UMaterialExpressionStaticBool {
	char Value : 1; // 0x40
};

struct UGeometryCacheTrack_FlipbookAnimation {
	uint32_t NumMeshSamples; // 0x58
};

struct UBTDecorator_ConeCheck {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector ConeDirection; // 0x98
	FBlackboardKeySelector Observed; // 0xc0
};

struct UCrowConquestAreaGaugeHQ {
	UPaperSprite* RedMyTeam; // 0x558
	UPaperSprite* RedEnemy; // 0x560
	UPaperSprite* BlueMyTeam; // 0x568
	UPaperSprite* BlueEnemy; // 0x570
	UImage* IMG_Icon; // 0x578
};

struct USourceEffectEnvelopeFollowerPreset {
	FSourceEffectEnvelopeFollowerSettings Settings; // 0x9c
};

struct UPlaneFalloff {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct UARSaveWorldAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UBP_MachineGunAnimInst_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x2f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x308
	FAnimNode_MachineGunHandler AnimGraphNode_MachineGun; // 0x328
	FAnimNode_Slot AnimGraphNode_Slot; // 0x418
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x460
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x480
};

struct UMaterialExpressionFresnel {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UDatasmithVREDSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct UCrowMultiSystemMessageBoxWidget {
	UCrowMultiSystemMessageWidget* WB_MultiSystemMessage_2; // 0x348
	UCrowMultiSystemMessageWidget* WB_MultiSystemMessage_3; // 0x350
	UCrowMultiSystemMessageWidget* WB_MultiSystemMessage_4; // 0x358
	TArray<UCrowMultiSystemMessageWidget*> MessageBoxArray; // 0x360
	float HideTime; // 0x370
};

struct UCrowWidgetConquestVehicleButton {
	UCrowToggleButton* BT_ConquestRespawn; // 0x348
	UImage* IMG_Icon; // 0x350
	UImage* IMG_Icon_2; // 0x358
	UCrowConquestAreaVehicleSpawner* TargetComponent; // 0x360
};

struct ULevelSequenceAnimSequenceLink {
	TArray<FLevelSequenceAnimSequenceLinkItem> AnimSequenceLinks; // 0x28
};

struct UCrowSocialWidget {
	UCrowTabMenuSocialWidget* WB_TabMenu_Social; // 0x348
	UWidgetSwitcher* WS_Social; // 0x350
	UCanvasPanel* CP_FriendList; // 0x358
	UWidgetSwitcher* WS_FriendList; // 0x360
	UGridPanel* GP_UserList_Friend; // 0x368
	UCanvasPanel* CP_RequestFriend; // 0x370
	UCanvasPanel* CP_GetRquest; // 0x378
	UTextBlock* TB_GetCount; // 0x380
	UWidgetSwitcher* WS_GetRequest; // 0x388
	UScrollBox* SB_GetRequest; // 0x390
	UCanvasPanel* CP_SendRquest; // 0x398
	UTextBlock* TB_SendCount; // 0x3a0
	UWidgetSwitcher* WS_SendRequest; // 0x3a8
	UScrollBox* SB_SendRequest; // 0x3b0
	UCanvasPanel* CP_Recent; // 0x3b8
	UWidgetSwitcher* WS_RecentList; // 0x3c0
	UGridPanel* GP_UserList_Recent; // 0x3c8
	UCanvasPanel* CP_SearchFriend; // 0x3d0
	UEditableTextBox* TB_TypingUserName; // 0x3d8
	UCrowButton* BT_Search; // 0x3e0
	UWidgetSwitcher* WS_SearchList; // 0x3e8
	UGridPanel* GP_UserList_Search; // 0x3f0
	UHorizontalBox* HB_Page; // 0x3f8
	UCrowButton* BT_Prev; // 0x400
	UCrowButton* BT_Next; // 0x408
	UTextBlock* TB_Page; // 0x410
	UCrowButton* BT_Prev_Search; // 0x418
	UCrowButton* BT_Next_Search; // 0x420
	UTextBlock* TB_Page_Search; // 0x428
	UCrowFriendSlotWidget* FriendSlotWidgetClass; // 0x430
	char SearchUserNameLegnthMin; // 0x438
	ESocialTabType CurrentTabType; // 0x439
	ACrowSceneLobby* SceneLobby; // 0x440
	uint32_t CurrentPage; // 0x448
	uint32_t PageMax; // 0x44c
};

struct ASwitchActor {
	USceneComponent* SceneComponent; // 0x238
	int32_t LastSelectedOption; // 0x240
};

struct ACrowWeaponRocketLauncher {
	UParticleSystem* BottomBlastEffect; // 0x1eb8
};

struct UMaterialParameterCollectionInstance {
	UMaterialParameterCollection* Collection; // 0x30
};

struct UViewAlignedPlaneBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
	float Depth; // 0x68
	EPlaneBrushSideMode WhichSide; // 0x6c
};

struct UCrowWeaponListItemBase {
	TArray<UWidget*> WeaponPanel; // 0x670
	ACrowWeaponBase* WeaponBase; // 0x680
	FCrowWeaponTableRow WeaponTable; // 0x690
	FCrowWeaponData WeaponData; // 0x18b0
	int32_t SlotIndex; // 0x1a18
	int32_t CurrAmmoCount; // 0x1a1c
	ECrowWeaponSubType WeaponSubType; // 0x1a20
	UWidgetSwitcher* WS_AmmoCount; // 0x1a28
	UCrowWidgetImage* IMG_Weapon; // 0x1a30
	UTextBlock* TB_RemainAmmo; // 0x1a38
	UTexture2D* WeaponIconImage; // 0x1a40
};

struct UCrowPlatformSteam {
	UTexture2D* DefaultTexture; // 0x80
	TMap<uint64_t, UTexture2D*> TexCache; // 0x88
};

struct UCrowVehicleMovementRotor {
	UCrowRotorConfigHeli* BodyConfig; // 0x190
	APawn* VehiclePawn; // 0x198
	UPrimitiveComponent* PhysicsBody; // 0x1a0
	FCrowRotorBodySetting PhysicsParam; // 0x1a8
	float IdleHoverForce; // 0x248
	float WorldOceanZ; // 0x24c
	float WorldAltitudeLimitZ; // 0x250
	int32_t RotorType; // 0x254
	float TorqueToAccel; // 0x258
	bool IsDirtyClientInput; // 0x25c
	FCrowMovementRotorValues ClientRawInput; // 0x260
	FCrowMovementRotorValues ReceivedInput; // 0x278
	FCrowMovementRotorValues CalculatedInput; // 0x290
	FCrowMovementRotorValues ForceAndTorque; // 0x2a8
	FCrowMovementRotorValues ForceAndTorqueCurrent; // 0x2c0
	FVector PhysicsBodyForward; // 0x3a0
	FVector PhysicsBodyRight; // 0x3ac
	FVector PhysicsBodyUp; // 0x3b8
	FVector PlanarForward; // 0x3c4
	FVector PlanarRight; // 0x3d0
	FVector PhysicsBodyVelocity; // 0x3dc
	FVector DirectionalVelocity; // 0x3e8
	FVector DragForce; // 0x3f4
	FVector IdleDampingForce; // 0x400
	float CurrentCollectiveForce; // 0x40c
	bool IsEngineStart; // 0x410
	FCrowMovementRotorValues DamagedEffectInput; // 0x414
	float DamagedEffectEnginePower; // 0x42c
	float DamagedInputFactor; // 0x430
};

struct UBakedTexture2DImageProperties {
	UTexture2D* SourceTexture; // 0x60
	int32_t UVLayer; // 0x68
};

struct UCrowTabGenderWidget {
	UCrowCustomizeCharacterDescWidget* CustomizeCharacterDescWidget; // 0x380
};

struct UMaterialShaderQualitySettings {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct ACrowWorldActor {
	USceneComponent* SceneRoot; // 0x220
	UCrowWorldAnimator* WorldAnimator; // 0x228
	ACrowWorldReplicationActor* ReplicationActor; // 0x230
	UCrowWorldLODUpdater* LODUpdater; // 0x238
	char UseActorDestruction : 1; // 0x240
	char UseWorldActorLOD : 1; // 0x240
	char DestroyedFlagInCluster : 1; // 0x240
	char DestroyedFlagInLandmark : 1; // 0x240
	char SkipItemDestroyedFlag : 1; // 0x240
	char InitializedLayoutItems : 1; // 0x240
	char InitializedLOD : 1; // 0x240
	char FullyDestroyed : 1; // 0x240
	int16_t ActorLayoutIndex; // 0x242
	uint32_t WorldActorIndex; // 0x244
	uint32_t SectorIndex; // 0x248
	uint32_t ClusterIndex; // 0x24c
	int16_t ActorDestructibleFlagLookupInSector; // 0x250
	int16_t ActorDestructibleFlagLookupInCluster; // 0x252
	int16_t ActorDestructibleFlagLookupInLandmark; // 0x254
	int16_t LayoutItemDestructibleFlagOrigin; // 0x256
	int16_t LayoutItemDynamicStateOrigin; // 0x258
	FCrowWorldActorLayoutItemLookups LayoutItemLookups; // 0x260
	TArray<FCrowWorldActorLayoutItemInstance> LayoutItemInstances; // 0x2a0
	FCrowWorldActorDestructionState ActorDestructionState; // 0x2b0
	TArray<FCrowWorldActorLODState> ActorLODStates; // 0x2d8
};

struct USphereComponent {
	float SphereRadius; // 0x458
};

struct UNiagaraSimulationStageGeneric {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct UGroupEdgeInsertionOperatorFactory {
	UGroupEdgeInsertionTool* Tool; // 0x30
};

struct UBaseKelvinletBrushOpProps {
	float Stiffness; // 0x60
	float Incompressiblity; // 0x64
	int32_t BrushSteps; // 0x68
};

struct ACrowWorldReplicationController {
	USceneComponent* SceneRoot; // 0x220
	APlayerController* PlayerController; // 0x228
	ACrowWorldReplicationActor* ReplicationActor; // 0x230
};

struct UPaperSpriteComponent {
	UPaperSprite* SourceSprite; // 0x468
	UMaterialInterface* MaterialOverride; // 0x470
	FLinearColor SpriteColor; // 0x478
};

struct UMaterialExpressionShadingModel {
	EMaterialShadingModel ShadingModel; // 0x40
};

struct UParticleModuleSize {
	FRawDistributionVector StartSize; // 0x30
};

struct UActorSequenceComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct USourceEffectStereoDelayPreset {
	FSourceEffectStereoDelaySettings Settings; // 0xb4
};

struct UGerstnerWaterWaves {
	UGerstnerWaterWaveGeneratorBase* GerstnerWaveGenerator; // 0x28
	TArray<FGerstnerWave> GerstnerWaves; // 0x30
	float MaxWaveHeight; // 0x40
};

struct UCrowScoreRankSlotModeWidget {
	UTextBlock* TB_Rank; // 0x350
	UTextBlock* TB_Class; // 0x358
	UTextBlock* TB_ID; // 0x360
	UTextBlock* TB_Score; // 0x368
	UTextBlock* TB_PlayTime; // 0x370
	UTextBlock* TB_PlayCount; // 0x378
	UTextBlock* TB_AverageScore; // 0x380
};

struct USoundNodeWavePlayer {
	TSoftObjectPtr<USoundWave> SoundWaveAssetPtr; // 0x48
	USoundWave* SoundWave; // 0x70
	char bLooping : 1; // 0x80
};

struct UTMG_CustomMesh {
	FCustomMeshProperties Properties; // 0x28
};

struct UCrowBattleMenuInput {
	APlayerController* PlayerController; // 0x140
};

struct UAkRoomComponent {
	char bEnable : 1; // 0x218
	UAkRoomComponent* NextLowerPriorityComponent; // 0x220
	float Priority; // 0x228
	float WallOcclusion; // 0x22c
	float AuxSendLevel; // 0x230
	bool AutoPost; // 0x234
};

struct UCrowVehicleCrosshairMh6Minigun {
	UImage* IMG_Overheating_Gauge; // 0x428
	UMaterialInstanceDynamic* ImgOverheatingGuageMaterial; // 0x430
	UCurveLinearColor* OverheatingCurve; // 0x438
	bool IsCooling; // 0x440
	UCrowWeaponInfoWidget* WeaponInfoWidget; // 0x448
};

struct ABP_CrowWeaponPartsLaserSight_Side_LPX8_C {
	UParticleSystemComponent* FX_Wp_LaserLight_M001; // 0x260
	UCrowLaserBeamComponent* CrowLaserBeam; // 0x268
	USkeletalMeshComponent* AK_LasersightSIDE; // 0x270
};

struct UCanvasRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0x108
	TWeakObjectPtr<UWorld> World; // 0x118
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x120
};

struct AUPSFormation_FromFormationPoints {
	TArray<UUPSFormationPointComponent*> FormationPointComponents; // 0x280
};

struct UInAppPurchaseComponent {
	FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb0
	FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc0
	FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd0
	FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe0
	FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf0
	FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x100
	FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x110
};

struct ANavigationTestingActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	UNavigationInvokerComponent* InvokerComponent; // 0x238
	char bActAsNavigationInvoker : 1; // 0x240
	FNavAgentProperties NavAgentProps; // 0x248
	FVector QueryingExtent; // 0x278
	ANavigationData* MyNavData; // 0x288
	FVector ProjectedLocation; // 0x290
	char bProjectedLocationValid : 1; // 0x29c
	char bSearchStart : 1; // 0x29c
	float CostLimitFactor; // 0x2a0
	float MinimumCostLimit; // 0x2a4
	char bBacktracking : 1; // 0x2a8
	char bUseHierarchicalPathfinding : 1; // 0x2a8
	char bGatherDetailedInfo : 1; // 0x2a8
	char bDrawDistanceToWall : 1; // 0x2a8
	char bShowNodePool : 1; // 0x2a8
	char bShowBestPath : 1; // 0x2a8
	char bShowDiffWithPreviousStep : 1; // 0x2a8
	char bShouldBeVisibleInGame : 1; // 0x2a8
	ENavCostDisplay CostDisplayMode; // 0x2ac
	FVector2D TextCanvasOffset; // 0x2b0
	char bPathExist : 1; // 0x2b8
	char bPathIsPartial : 1; // 0x2b8
	char bPathSearchOutOfNodes : 1; // 0x2b8
	float PathfindingTime; // 0x2bc
	float PathCost; // 0x2c0
	int32_t PathfindingSteps; // 0x2c4
	ANavigationTestingActor* OtherActor; // 0x2c8
	UNavigationQueryFilter* FilterClass; // 0x2d0
	int32_t ShowStepIndex; // 0x2d8
	float OffsetFromCornersDistance; // 0x2dc
};

struct UCrowFoliageParamSetting {
	FName MeshHeightParamName; // 0x28
	FName BendingPowerName; // 0x30
	FName MaxRotationParamName; // 0x38
	FName DynamicFoliageMaskName; // 0x40
	FName DynamicFoliageMaskSizeName; // 0x48
	FName AddSineName1; // 0x50
	FName AddSineName2; // 0x58
	TSet<FString> IgnoreContainKeywords; // 0x60
	TSet<FString> ValidParentMaterialNames; // 0xb0
	TArray<FCrowFoliageParam> GrassParams; // 0x100
	TArray<FCrowFoliageParam> BushParams; // 0x110
	TArray<FCrowFoliageParam> TreeParams; // 0x120
};

struct UCrowDotDamageComponent {
	FTimerHandle DestroyTimerHandle; // 0xb0
	FTimerHandle ActivateTimerHandle; // 0xb8
	TArray<FCrowDotDamageFxInfo> CrowDotDamageFxInfo; // 0xc0
	float ActivateDamageTimeSecond; // 0xd0
	float RunningTime; // 0xd4
	float Damage; // 0xd8
	bool bCreateFx; // 0xdc
	TArray<UParticleSystemComponent*> FXParticlesComps; // 0xe0
};

struct UMenuAnchor {
	UUserWidget* MenuClass; // 0x120
	FDelegate OnGetMenuContentEvent; // 0x128
	FDelegate OnGetUserMenuContentEvent; // 0x138
	EMenuPlacement Placement; // 0x148
	bool bFitInWindow; // 0x149
	bool ShouldDeferPaintingAfterWindowContent; // 0x14a
	bool UseApplicationMenuStack; // 0x14b
	FMulticastInlineDelegate OnMenuOpenChanged; // 0x150
};

struct UCrowPreviewActorComponent {
	AActor* TargetActor; // 0xb0
	TArray<UMeshComponent*> MeshCompArray; // 0xb8
};

struct UCrowRotorAnimInstance {
	FCrowRotorAnimInstanceProxy AnimInstanceProxy; // 0x2c0
	ACrowVehiclePawn* VehiclePawn; // 0xa30
};

struct USphereReflectionCaptureComponent {
	float InfluenceRadius; // 0x270
	float CaptureDistanceScale; // 0x274
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
};

struct UCurveLinearColor {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct UOffsetWeightMapSetProperties {
	float MinDistance; // 0x80
};

struct ACrowRandomBoxTriggerActor {
	UCrowRandomBoxWidget* BoxWidgetClass; // 0x220
	ULevelSequencePlayer* LevelSequencePlayer; // 0x228
	UCrowRandomBoxWidget* BoxWidget; // 0x230
	int32_t CurrMessageIndex; // 0x238
	bool IsTouch; // 0x23c
};

struct UUMGSequenceTickManager {
	TSet<TWeakObjectPtr<UUserWidget>> WeakUserWidgets; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x78
};

struct UGeometryCacheCodecRaw {
	int32_t DummyProperty; // 0x38
};

struct ACrowKitBomberProjectile {
	int32_t AmmoTableIndex; // 0x1840
	float Speed; // 0x1844
	FWeaponDamageSettings DamageSetting; // 0x1848
	UDamageType* DamegeType; // 0x1870
	UMatineeCameraShake* CameraShakeFP; // 0x1878
	UMatineeCameraShake* CameraShakeTP; // 0x1880
	FVector Dir; // 0x1888
	ACrowKitBomber* BomberActor; // 0x1898
	FVector TargetActorPos; // 0x18a0
};

struct AAmbientSound {
	UAudioComponent* AudioComponent; // 0x220
};

struct UMovieSceneSequence {
	UMovieSceneCompiledData* CompiledData; // 0x50
	EMovieSceneCompletionMode DefaultCompletionMode; // 0x58
	bool bParentContextsAreSignificant; // 0x59
	bool bPlayableDirectly; // 0x5a
	EMovieSceneSequenceFlags SequenceFlags; // 0x5b
};

struct UWB_HUD_M1Abrams_Crosshair_Machinegun_First_C {
	UImage* Image; // 0x438
	UImage* Image_372; // 0x440
	UImage* IMG_Box_CrossHair; // 0x448
	UImage* IMG_Crosshair_Gauge; // 0x450
	UImage* IMG_Crosshair_Gauge_Base; // 0x458
	UImage* IMG_Crosshair_Moving; // 0x460
	UImage* IMG_CrosshairFrame; // 0x468
	UImage* IMG_FPS_CMG_Down; // 0x470
	UImage* IMG_FPS_CMG_Down_3; // 0x478
	UImage* IMG_FPS_CMG_Left; // 0x480
	UImage* IMG_FPS_CMG_Left_3; // 0x488
	UImage* IMG_FPS_CMG_Right; // 0x490
	UImage* IMG_FPS_CMG_Right_3; // 0x498
	UImage* IMG_FPS_CMG_Up; // 0x4a0
	UImage* IMG_FPS_CMG_Up_3; // 0x4a8
	UImage* IMG_ZoomIn; // 0x4b0
	UImage* IMG_ZoomIn_2; // 0x4b8
	UImage* IMG_ZoomIn_3; // 0x4c0
	UImage* IMG_ZoomIn_4; // 0x4c8
	UImage* IMG_ZoomIn_5; // 0x4d0
	UImage* IMG_ZoomIn_6; // 0x4d8
};

struct UPlatformInterfaceBase {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UMovieSceneSection {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UBoundsCopyComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UM2_Browning_Boat_Back_Anim_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x318
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x328
	FAnimNode_Slot AnimGraphNode_Slot; // 0x348
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x390
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3b0
	FAnimNode_VehicleWeaponHandler AnimGraphNode_VehicleWeapon; // 0x3d0
};

struct UParticleModuleSubUVMovie {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UPaperTerrainComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x440
	bool bClosedSpline; // 0x448
	bool bFilledSpline; // 0x449
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x450
	int32_t RandomSeed; // 0x458
	float SegmentOverlapAmount; // 0x45c
	FLinearColor TerrainColor; // 0x460
	int32_t ReparamStepsPerSegment; // 0x470
	ESpriteCollisionMode SpriteCollisionDomain; // 0x474
	float CollisionThickness; // 0x478
	UBodySetup* CachedBodySetup; // 0x480
};

struct UTileView {
	float EntryHeight; // 0x368
	float EntryWidth; // 0x36c
	EListItemAlignment TileAlignment; // 0x370
	bool bWrapHorizontalNavigation; // 0x371
};

struct UBreakpoint {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UCrowPingIndicatorWidget {
	UCanvasPanel* CP_Root; // 0x348
	UCanvasPanel* CP_LocateArrow; // 0x350
	UCanvasPanel* CP_Ping; // 0x358
	UImage* IMG_LocateArrow; // 0x360
	UImage* IMG_Ping_Point; // 0x368
	UImage* IMG_Ping_BG; // 0x370
	UImage* IMG_Ping; // 0x378
	UImage* IMG_Ping_Active_2; // 0x380
	UImage* IMG_Ping_Active_3; // 0x388
	UTextBlock* TB_Distance; // 0x390
	UTextBlock* TB_Name; // 0x398
	UWidgetAnimation* AniWidgetActive; // 0x3a0
	ACrowPingBase* TargetActor; // 0x3a8
	UImage* ImgPingBG_Small; // 0x3b0
	UBorder* BorderPingItem_BG; // 0x3b8
	UImage* ImgPing_Item; // 0x3c0
	UBorder* BorderPingItem_Grade; // 0x3c8
};

struct ACrowProjectileTankSmoke {
	FVector VehicleVelocity; // 0x18d0
	UParticleSystem* SmokeEffect; // 0x18e0
	UAkAudioEvent* ExplosionSound; // 0x18e8
	AActor* ImpedimentsActorClass; // 0x18f0
};

struct ABP_CrowWeaponPartsLaserSight_C {
	UParticleSystemComponent* FX_Wp_LaserLight_M001; // 0x260
	UCrowLaserBeamComponent* CrowLaserBeam; // 0x268
	USkeletalMeshComponent* HG_Lasersight_SIDE; // 0x270
};

struct UParticleModuleColorOverLife {
	FRawDistributionVector ColorOverLife; // 0x30
	FRawDistributionFloat AlphaOverLife; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UInterpTrackInstLinearColorProp {
	FLinearColor ResetColor; // 0x58
};

struct UCrowScoreInfoDeathMatchListItem {
	UImage* IMG_BackGround; // 0x348
	UImage* IMG_SquadLeader; // 0x350
	UImage* IMG_LocalPlayer; // 0x358
	UImage* IMG_SideLineL; // 0x360
	UImage* IMG_SideLineR; // 0x368
	UHorizontalBox* HB_Contents; // 0x370
	UWidgetSwitcher* WS_Status; // 0x378
	UTextBlock* TB_PlayerRank; // 0x380
	UTextBlock* TB_PlayerName; // 0x388
	UTextBlock* TB_KillCount; // 0x390
	UTextBlock* TB_DeathCount; // 0x398
	FLinearColor LocalPlayerBackColor; // 0x3a0
	FLinearColor LocalPlayerTextColor; // 0x3b0
	FLinearColor DefaultBackColor; // 0x3c0
	FLinearColor DefaultTextColor; // 0x3d0
	float SquadListAlpha; // 0x3e0
};

struct UCrowLobbyProfileSeasonWidget {
	UCrowDropDownWidget* Dropdown_All; // 0x348
	UCrowDropDownWidget* Dropdown_Time; // 0x350
	UTextBlock* TB_Rank; // 0x358
	UTextBlock* TB_Level; // 0x360
	UTextBlock* TB_Kill; // 0x368
	UTextBlock* TB_Assist; // 0x370
	UTextBlock* TB_Death; // 0x378
	UTextBlock* TB_Faint; // 0x380
	UTextBlock* TB_TotalScore; // 0x388
	UTextBlock* TB_AverageScore; // 0x390
	UTextBlock* TB_WinLose; // 0x398
	UTextBlock* TB_PlayTime; // 0x3a0
};

struct AProceduralFoliageBlockingVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct UCrowInvenCenterPanelWidget {
	UTextBlock* TB_Item_Category; // 0x348
	UTextBlock* TB_WeaponName; // 0x350
	UTextBlock* TB_ItemDesc_Text; // 0x358
	UTextBlock* TB_Value_Amount; // 0x360
	UTextBlock* TB_Value_Split; // 0x368
	UTextBlock* TB_AmmoType; // 0x370
	UTextBlock* TB_CurrentAmmo; // 0x378
	UTextBlock* TB_ReaminAmmo; // 0x380
	UTextBlock* TB_MenuTitle; // 0x388
	UCrowWidgetImage* IMG_Weapon; // 0x390
	UCrowWidgetImage* IMG_Item; // 0x398
	UWidgetSwitcher* WS_ItemTypeAction; // 0x3a0
	UWidgetSwitcher* WS_WeaponType; // 0x3a8
	UWidgetSwitcher* WS_ItemIcon; // 0x3b0
	UCrowItemStatusDescWidget* WB_Item_Status_Desc0; // 0x3b8
	UCrowItemStatusDescWidget* WB_Item_Status_Desc1; // 0x3c0
	UCrowItemStatusDescWidget* WB_Item_Status_Desc2; // 0x3c8
	UCrowItemStatusDescWidget* WB_Item_Status_Desc3; // 0x3d0
	UCrowItemStatusDescWidget* WB_Item_Status_Desc4; // 0x3d8
	UCrowItemStatusDescWidget* WB_Item_Status_Desc5; // 0x3e0
	UCrowItemStatusDescWidget* WB_Item_Status_Desc6; // 0x3e8
	UUserWidget* WB_Item_DamageDrop; // 0x3f0
	UVerticalBox* VB_WeaponStat; // 0x3f8
	UVerticalBox* VB_AmmoType; // 0x400
	USlider* Slider_SplitSlider; // 0x408
	UHorizontalBox* HB_AmmoType; // 0x410
	UHorizontalBox* HB_BurstType; // 0x418
	UImage* IMG_Seperate; // 0x420
	UCanvasPanel* CP_ItemSplitInfo; // 0x428
	UTextBlock* TB_ReaminAmmoBar; // 0x430
	UTextBlock* TB_Descripction; // 0x438
	float MaxAmountValue; // 0x440
	bool IsDropMode; // 0x444
};

struct UCrowPlayMontageCallbackProxy {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct ULocalPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct ULogoutCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ACrowItemTableOverviewSMC {
	UStaticMeshComponent* Mesh; // 0x228
};

struct UMovementComponent {
	USceneComponent* UpdatedComponent; // 0xb0
	UPrimitiveComponent* UpdatedPrimitive; // 0xb8
	FVector Velocity; // 0xc4
	FVector PlaneConstraintNormal; // 0xd0
	FVector PlaneConstraintOrigin; // 0xdc
	char bUpdateOnlyIfRendered : 1; // 0xe8
	char bAutoUpdateTickRegistration : 1; // 0xe8
	char bTickBeforeOwner : 1; // 0xe8
	char bAutoRegisterUpdatedComponent : 1; // 0xe8
	char bConstrainToPlane : 1; // 0xe8
	char bSnapToPlaneAtStart : 1; // 0xe8
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xe8
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb
};

struct UFontImportOptions {
	FFontImportOptionsData Data; // 0x28
};

struct UWB_EnemyWatching_PlayerIndicator_C {
	UImage* Image; // 0x370
	UImage* Image_23; // 0x378
	UImage* IMG_LocateArrow; // 0x380
};

struct ACrowGameStateBombMission {
	TArray<FCrowScoreInfoBombMission> ScoreArray; // 0x410
	TArray<ACrowPlayerStartTDM*> RedTeamPlayerStartArray; // 0x420
	TArray<ACrowPlayerStartTDM*> BlueTeamPlayerStartArray; // 0x430
	ECrowGameRoundState CrowGameRoundState; // 0x440
	float RoundTimeSec; // 0x444
	char CurrentRoundCount; // 0x448
	char CurrentRoundTransitionCount; // 0x449
	bool bIsWinToTimeout; // 0x44a
	float FirstRoundWaitTimeSec; // 0x44c
	float RoundWaitTimeSec; // 0x450
	float RoundMatchTimeSec; // 0x454
	float RoundFinishTimeSec; // 0x458
	char TotalRoundCount; // 0x45c
	char RoundTransitionCount; // 0x45d
	float LoadoutTimeSec; // 0x460
	float CompositionCTimeSec; // 0x464
	char AttackerTeam; // 0x468
	float SpectatorModeWaitTimeSec; // 0x46c
	bool bIsAvailableLoadout; // 0x470
	char RedTeamWinCount; // 0x471
	char BlueTeamWinCount; // 0x472
	char RoundWinTeamID; // 0x473
	char UnearnedWinTeamID; // 0x474
	bool bIsPlantCompositionC; // 0x475
	int32_t PlantCompositionCPlayerId; // 0x478
	char TeamWinByPlantCompositionC; // 0x47c
	char TeamWinByDefuseCompositionC; // 0x47d
	ACrowPlayerStateBase* CompositionCHolderPlayer; // 0x480
	bool bIsSelectedCompositionCHolder; // 0x488
	TMap<char, FCrowTeamInfoBombMission> TeamInfoMap; // 0x490
	TMap<char, FCrowPlayerCountInfoBombMission> PlayerCountMap; // 0x4e0
	UCrowRemainTimeSync* RemainRoundTime; // 0x530
};

struct ACrowImpedimentsActor {
	UParticleSystemComponent* ImpedimentsParticleComp; // 0x220
};

struct UGroomHairGroupsPreview {
	TArray<FGroomHairGroupPreview> Groups; // 0x28
};

struct UCrowDynamicFoliageManager {
	FLinearColor ClearColor; // 0xb0
	float PixelSizePerMeter; // 0xc0
	float CaptureSize; // 0xc4
	UTextureRenderTarget2D* RenderTarget; // 0xc8
	UMaterialParameterCollection* CrowParamCollection; // 0xd0
	UCrowDynamicFoliageConfig* DynamicFoliageConfig; // 0xd8
	UCrowFoliageParamSetting* FoliageParamSetting; // 0xe0
	float MaskRotation; // 0xe8
	UCrowDynamicFoliageDrawComponent* DrawComponent; // 0xf0
	bool bNeedCleanup; // 0xf8
	int32_t FrameCount; // 0xfc
	TArray<int32_t> RemoveAffectorList; // 0x100
	TArray<TWeakObjectPtr<UCrowFoliageAffectorComponent>> AddAffectorList; // 0x110
	TMap<int32_t, TWeakObjectPtr<UCrowFoliageAffectorComponent>> MapFoliageAffector; // 0x120
};

struct ALandscapeMeshProxyActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x220
};

struct UVectorFieldStatic {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
};

struct UParticleModuleOrbit {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UBTTask_FinishWithResult {
	EBTNodeResult Result; // 0x70
};

struct UReflectionCaptureComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct UCrowReplayPlayerWidget {
	UUserWidget* BookMarkWidget; // 0x348
	FVector2D BookMarkSize; // 0x350
	UCrowButton* BT_Pause; // 0x358
	UCrowButton* BT_Play; // 0x360
	UCrowButton* BT_PlayRatePlus; // 0x368
	UCrowButton* BT_PlayRateMinus; // 0x370
	UCrowButton* BT_Next; // 0x378
	UCrowButton* BT_Prev; // 0x380
	UCrowButton* BT_BookMarkPlus; // 0x388
	UCrowButton* BT_BookMarkMinus; // 0x390
	UTextBlock* TB_Username; // 0x398
	UTextBlock* TB_Playrate; // 0x3a0
	UTextBlock* TB_CurrentGameTime; // 0x3a8
	UTextBlock* TB_MaxGameTime; // 0x3b0
	UCanvasPanel* CP_TrackBar; // 0x3b8
	UCanvasPanel* CP_HelpBar; // 0x3c0
	UCanvasPanel* CP_BookMarkArea; // 0x3c8
	UCanvasPanel* CP_PlayTime; // 0x3d0
	UWidgetSwitcher* WS_ViewMode; // 0x3d8
	UWidgetSwitcher* PlayPauseSwitcher; // 0x3e0
	USlider* SB_PlayScroll; // 0x3e8
	TWeakObjectPtr<ACrowPlayerControllerReplay> ReplayController; // 0x3f0
	UCrowBookMarkWidget* SelectedBookMark; // 0x3f8
};

struct UCrowVehiclePhysicalMaterial {
	float MaxEngineRPMForwardMultiply; // 0x80
	float MaxEngineRPMReverseMultiply; // 0x84
	float MaxEngineTorqueMultiply; // 0x88
	float WheelFrictionMultiply; // 0x8c
	UParticleSystem* ImpactFx; // 0x90
	bool IgnoreMetalFx; // 0x98
};

struct UCrowServerOnlyCharacterControll {
	ACrowCharacterPawn* CharacterOwner; // 0xb0
	FCrowServerOnlyCharacterInfo MoveTypeInfo; // 0xb8
	FCrowServerOnlyCharacterInfo MoveForwardInfo; // 0xd0
	FCrowServerOnlyCharacterInfo MoveRightInfo; // 0xe8
	FCrowServerOnlyCharacterInfo LookRightInfo; // 0x100
	FCrowServerOnlyCharacterInfo LookUpInfo; // 0x118
	FCrowServerOnlyCharacterInfo WeaponFire; // 0x130
};

struct UCrowSquadNotiTimerWidget {
	UTextBlock* TB_Timer; // 0x370
};

struct UEnvQueryGenerator_ProjectedPoints {
	FEnvTraceData ProjectionData; // 0x50
};

struct UWB_Vehicle_Warning_Heli_C {
	UWidgetAnimation* Ani_Damage_Orange; // 0x418
	UWidgetAnimation* Ani_Damage_Yellow; // 0x420
	UWidgetAnimation* NewAnimation; // 0x428
	UWidgetAnimation* Ani_MissileIncoming; // 0x430
	UWidgetAnimation* Ani_Damage_Red; // 0x438
	UImage* IMG_Base_BG; // 0x440
	UImage* IMG_BG; // 0x448
	UImage* IMG_IMG_Effect; // 0x450
	UImage* IMG_Missile; // 0x458
	UImage* IMG_Warning; // 0x460
};

struct UEnvQueryManager {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct UCrowObjectiveBoardWidget {
	UUserWidget* WB_Objective_WIdget; // 0x348
	UCrowSquadWidget* WB_SquadWidget; // 0x350
};

struct UMaterialExpressionPanner {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	FExpressionInput Speed; // 0x68
	float SpeedX; // 0x7c
	float SpeedY; // 0x80
	uint32_t ConstCoordinate; // 0x84
	bool bFractionalPart; // 0x88
};

struct ACrowAIZoneRewardBase {
	ACrowSupplyEventBoxActor* RewardSupplyBoxActor; // 0x220
	TArray<int32_t> FixItemIndexList; // 0x228
};

struct ULevel {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x258
	TArray<UAssetUserData*> AssetUserData; // 0x268
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x288
};

struct UHierarchicalLODSetup {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UClothingAssetBase {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct UDatasmithDeltaGenSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bRemoveInvisibleNodes; // 0x4a
	bool bSimplifyNodeHierarchy; // 0x4b
	bool bImportVar; // 0x4c
	FString VarPath; // 0x50
	bool bImportPos; // 0x60
	FString PosPath; // 0x68
	bool bImportTml; // 0x78
	FString TmlPath; // 0x80
};

struct AGameMode {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct ADatasmithSceneActor {
	UDatasmithScene* Scene; // 0x220
	TMap<FName, TSoftObjectPtr<AActor>> RelatedActors; // 0x228
};

struct UAkMarkerCallbackInfo {
	int32_t Identifier; // 0x38
	int32_t position; // 0x3c
	FString Label; // 0x40
};

struct UDrawPolyPathProperties {
	EDrawPolyPathOutputMode OutputType; // 0x60
	EDrawPolyPathWidthMode WidthMode; // 0x64
	float Width; // 0x68
	EDrawPolyPathHeightMode HeightMode; // 0x6c
	float Height; // 0x70
	float RampStartRatio; // 0x74
	bool bSnapToWorldGrid; // 0x78
};

struct UProgressBar {
	FProgressBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x2a8
	USlateBrushAsset* BackgroundImage; // 0x2b0
	USlateBrushAsset* FillImage; // 0x2b8
	USlateBrushAsset* MarqueeImage; // 0x2c0
	float Percent; // 0x2c8
	EProgressBarFillType BarFillType; // 0x2cc
	bool bIsMarquee; // 0x2cd
	FVector2D BorderPadding; // 0x2d0
	FDelegate PercentDelegate; // 0x2d8
	FLinearColor FillColorAndOpacity; // 0x2e8
	FDelegate FillColorAndOpacityDelegate; // 0x2f8
};

struct UCrowCharacterAnimTableManager {
	UDataTable* PrivateTP; // 0x28
	UDataTable* PrivateFP; // 0x30
	UDataTable* PrivateShoot; // 0x38
	UDataTable* PrivateReload; // 0x40
	UDataTable* ItemAction; // 0x48
	UDataTable* OnVehicle; // 0x50
	UDataTable* Common; // 0x58
	UDataTable* GroundPoseTable; // 0x60
	UDataTable* VehiclePoseTable; // 0x68
	UDataTable* GripPoseTable; // 0x70
	UDataTable* CommonAnimTable; // 0x78
};

struct ACrowSceneGame {
	ULevelStreamingDynamic* WeaponLoadOutLevel; // 0x940
	ACrowWeaponLoadoutObjectBider* WeaponLoadoutObjectBider; // 0x948
	ACrowWeaponLobby* IngameCustomWeapon; // 0x950
	ACrowWeaponLobby* TestCustomWeapon; // 0x958
	TArray<ASkyLight*> SkyLightArray; // 0x960
	FRotator DefaultCustomWeaponRotion; // 0x970
	FRotator DragStartCustomWeaponRotion; // 0x97c
	FVector2D DragStartScreenPosition; // 0x988
	ERotationMode WeaponRotationMode; // 0x990
	ELoadOutMode CurrentLoadOutMode; // 0x991
	int32_t SaveValueMapIndex; // 0x994
	int64_t SaveValueWeaponIndex; // 0x998
	int8_t SaveValueWeaponSlot; // 0x9a0
	int64_t SaveValueUserServerKey; // 0x9a8
	int32_t SaveValueAppearanceIndex[0x8]; // 0x9b0
	FString SaveNickName; // 0x9d0
	ECrowCharacterAppearanceType CurrentCameraAppearanceType; // 0x9e0
	AActor* CurrCamera; // 0x9e8
};

struct ABP_SkydivingPawn_C {
	UArrowComponent* Vel_Arrow_Z; // 0xac0
	UArrowComponent* Vel_Arrow_Y; // 0xac8
	UArrowComponent* Vel_Arrow_X; // 0xad0
	UCameraComponent* Camera; // 0xad8
	UCrowSpringArmComponent* CrowSpringArm; // 0xae0
	UArrowComponent* Vel_Arrow; // 0xae8
};

struct UShaderPlatformQualitySettings {
	FMaterialQualityOverrides QualityOverrides[0x4]; // 0x28
};

struct UFoliageType_Actor {
	AActor* ActorClass; // 0x3a8
	bool bShouldAttachToBaseComponent; // 0x3b0
};

struct UPlayer {
	APlayerController* PlayerController; // 0x30
	int32_t CurrentNetSpeed; // 0x38
	int32_t ConfiguredInternetSpeed; // 0x3c
	int32_t ConfiguredLanSpeed; // 0x40
};

struct UPaperFlipbook {
	float FramesPerSecond; // 0x28
	TArray<FPaperFlipbookKeyFrame> KeyFrames; // 0x30
	UMaterialInterface* DefaultMaterial; // 0x40
	EFlipbookCollisionMode CollisionSource; // 0x48
};

struct UDatasmithImportOptions {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x28
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x29
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x2a
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x2b
	EDatasmithImportActorPolicy LightImportPolicy; // 0x2c
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x2d
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x2e
	EDatasmithImportMaterialQuality MaterialQuality; // 0x2f
	FDatasmithImportBaseOptions BaseOptions; // 0x34
	FDatasmithReimportOptions ReimportOptions; // 0x48
	FString Filename; // 0x50
	FString FilePath; // 0x60
};

struct ACharacter {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	char bProxyIsJumpForceApplied : 1; // 0x330
	char bPressedJump : 1; // 0x330
	char bClientUpdating : 1; // 0x330
	char bClientWasFalling : 1; // 0x330
	char bClientResimulateRootMotion : 1; // 0x330
	char bClientResimulateRootMotionSources : 1; // 0x330
	char bSimGravityDisabled : 1; // 0x330
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331
	char bServerMoveIgnoreRootMotion : 1; // 0x331
	char bWasJumping : 1; // 0x331
	float JumpKeyHoldTime; // 0x334
	float JumpForceTimeRemaining; // 0x338
	float ProxyJumpForceStartedTime; // 0x33c
	float JumpMaxHoldTime; // 0x340
	int32_t JumpMaxCount; // 0x344
	int32_t JumpCurrentCount; // 0x348
	int32_t JumpCurrentCountPreJump; // 0x34c
	FMulticastInlineDelegate OnReachedJumpApex; // 0x358
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x378
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x388
	FRootMotionSourceGroup SavedRootMotion; // 0x398
	FRootMotionMovementParams ClientRootMotionParams; // 0x3d0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410
	FRepRootMotionMontage RepRootMotion; // 0x420
};

struct ACrowLobbyBinderSwitchActor {
	ELobbySceneMode SceneMode; // 0x220
	ECrowSampleCharacterCount CharacterCount; // 0x224
	FCrowSampleCharacterInfo SampleCharacterInfo; // 0x228
	FCrowSampleWeaponInfo LobbyWeaponInfo_Primary; // 0x240
	FCrowSampleWeaponInfo LobbyWeaponInfo_Secondary; // 0x258
	FCrowSampleWeaponInfo LobbyWeaponInfo_Melee; // 0x270
	FCrowSampleWeaponInfo LobbyWeaponInfo_Throw1; // 0x288
	FCrowSampleWeaponInfo LobbyWeaponInfo_Throw2; // 0x2a0
	FCrowSampleWeaponInfo SampleWeaponInfo; // 0x2b8
	USceneComponent* SwitchRoot; // 0x2d0
	UStaticMeshComponent* SphereMesh; // 0x2d8
	int32_t FrameCount; // 0x2e0
	APlayerController* InputPlayerController; // 0x2e8
	TMap<char, ACrowLobbyCharacterPawn*> MainCharacters; // 0x2f0
	TMap<char, ACrowWeaponLobby*> MainCharacterWeapons; // 0x340
	ACrowLobbyCharacterPawn* CustomCharacterPawn; // 0x390
	ACrowWeaponLobby* CustomCharacterWeapon; // 0x398
	ACrowWeaponLobby* LobbyWeapon; // 0x3a0
	TArray<ACrowWeaponLobby*> LobbySampleWeapons; // 0x3a8
};

struct UInterpToMovementComponent {
	float Duration; // 0xf0
	char bPauseOnImpact : 1; // 0xf4
	bool bSweep; // 0xf8
	ETeleportType TeleportType; // 0xf9
	EInterpToBehaviourType BehaviourType; // 0xfa
	bool bCheckIfStillInWorld; // 0xfb
	char bForceSubStepping : 1; // 0xfc
	FMulticastInlineDelegate OnInterpToReverse; // 0x100
	FMulticastInlineDelegate OnInterpToStop; // 0x110
	FMulticastInlineDelegate OnWaitBeginDelegate; // 0x120
	FMulticastInlineDelegate OnWaitEndDelegate; // 0x130
	FMulticastInlineDelegate OnResetDelegate; // 0x140
	float MaxSimulationTimeStep; // 0x150
	int32_t MaxSimulationIterations; // 0x154
	TArray<FInterpControlPoint> ControlPoints; // 0x158
};

struct UCrowVehicleCrosshairAbramCannon {
	UImage* IMG_Crosshair_Gauge_Base; // 0x428
	UImage* IMG_Crosshair_Gauge; // 0x430
	UTextBlock* AmmoTypeTextBlock; // 0x438
	UMaterialInstanceDynamic* ImgCrosshairGuageMaterial; // 0x440
	UCrowWeaponInfoWidget* WeaponInfoWidget; // 0x448
};

struct UMaterialExpressionRuntimeVirtualTextureOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UBTTask_Wait {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct UBTTask_GameplayTaskBase {
	char bWaitForGameplayTask : 1; // 0x70
};

struct UHudSettings {
	char bShowHUD : 1; // 0x28
	TArray<FName> DebugDisplay; // 0x30
};

struct UCrowWorldMapIconPing {
	bool VisibleWorldMap; // 0x1b0
	bool VisibleMiniMap; // 0x1b1
	bool VisibleRespawnMap; // 0x1b2
	ACrowPingBase* TargetPing; // 0x1b8
};

struct UDialogueVoice {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UAnimSingleNodeInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UCrowCustomizeEmotionRadialWidget {
	UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_1; // 0x3d0
	UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_2; // 0x3d8
	UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_3; // 0x3e0
	UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_4; // 0x3e8
	UCrowRadialMenuButtonWidget* WB_Customize_EmotionRadialMenu_5Button_5; // 0x3f0
	UImage* IMG_CircleSelect; // 0x3f8
	UCanvasPanel* CP_MouseTip; // 0x400
	UCanvasPanel* CP_HoverIcon; // 0x408
	ECrowCustomizeEmotionRadialState State; // 0x410
	UWidgetAnimation* RegistAnimation; // 0x418
};

struct UCrowVehicleHUDBase {
	ACrowVehiclePawn* VehiclePawn; // 0x348
	USizeBox* SB_Vehicle_Croshair; // 0x350
	USizeBox* SB_Buttom; // 0x358
	UCanvasPanel* CP_HUD_Vehicle; // 0x360
	UUserWidget* WB_LockOnAlert; // 0x368
	UCrowWeaponCrosshairBase* crosshairWidget; // 0x370
	UCrowWeaponCrosshairBase* SpecialCrosshairWidget; // 0x378
	UAkAudioEvent* LockOnStartEvent; // 0x380
	int32_t LockOnEventID; // 0x388
};

struct AUPSGroupMemberMovementPoint {
	UBillboardComponent* BillboardComponent; // 0x220
};

struct UCrowReplayListItemWidget {
	UCrowToggleButton* BT_ListSlot; // 0x348
	UImage* IMG_Lock; // 0x350
	UTextBlock* TB_Date; // 0x358
	UTextBlock* TB_MapMode; // 0x360
	UTextBlock* TB_TotalTime; // 0x368
	UTextBlock* TB_FileSize; // 0x370
	UTextBlock* TB_Version; // 0x378
	UTextBlock* TB_Usable; // 0x380
	UImage* IMG_Deselect; // 0x388
	UImage* IMG_Lock_Select; // 0x390
	UTextBlock* TB_Date_Select; // 0x398
	UTextBlock* TB_MapMode_Select; // 0x3a0
	UTextBlock* TB_TotalTime_Select; // 0x3a8
	UTextBlock* TB_FileSize_Select; // 0x3b0
	UTextBlock* TB_Version_Select; // 0x3b8
	UTextBlock* TB_Usable_Select; // 0x3c0
	UCrowReplayWidget* RootWidget; // 0x3c8
	UCrowReplayInfo* Info; // 0x3d0
};

struct UInterpTrackInstFloatMaterialParam {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UAvfMediaSettings {
	bool NativeAudioOut; // 0x28
};

struct UCrowReplayInfo {
	FString ReplayName; // 0x28
	FString FriendlyName; // 0x38
	FDateTime Timestamp; // 0x48
	int32_t LengthInMS; // 0x50
	int32_t SizeOfByte; // 0x54
	int32_t Version; // 0x58
	bool bLock; // 0x5c
	int32_t MapIndex; // 0x60
	uint64_t ServerKey; // 0x68
	FString MyPlayerName; // 0x70
	TArray<FString> MySquadList; // 0x80
	TArray<FTimespan> CheckPointList; // 0x90
};

struct UCrowSettingsDefaultConfig {
	TArray<FKeySlotCategoryInfo> KeySlotCategoryInfos; // 0x28
	TArray<FKeySlotCategoryInfo> KeySlotUICategoryInfos; // 0x38
	TArray<FActionKeySlot> ActionKeySlots; // 0x48
	TArray<FAxisKeySlot> AxisKeySlots; // 0x58
	TArray<FSettingItem> SettingItems; // 0x68
	TArray<FKey> FixedKeys; // 0x78
	TArray<FOptionExplanation> OptionExplanations; // 0x88
	TArray<FAxisNameToBehaviourName> AxisToBehaviourNames; // 0x98
	TArray<FIntPoint> AllowedResolutions; // 0xa8
};

struct UAISenseConfig_Hearing {
	UAISense_Hearing* Implementation; // 0x48
	float HearingRange; // 0x50
	float LoSHearingRange; // 0x54
	char bUseLoSHearing : 1; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
};

struct UButtonSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UCrowGRACWidget {
	FName HideAnimationName; // 0x358
	float DisplayTime; // 0x360
};

struct UOceanGenerator {
	TArray<UOceanBoxCollisionComponent*> CollisionBoxes; // 0x28
	TArray<UOceanCollisionComponent*> CollisionHullSets; // 0x38
};

struct UBTDecorator_BlueprintBase {
	AAIController* AIOwner; // 0x68
	AActor* ActorOwner; // 0x70
	TArray<FName> ObservedKeyNames; // 0x78
	char bShowPropertyDetails : 1; // 0x98
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0x98
	char bIsObservingBB : 1; // 0x98
};

struct AUPSGroupMovementAIController {
	FMulticastInlineDelegate OnAIStartMovementToLocationDelegate; // 0x328
	FMulticastInlineDelegate OnAIStartMovementToActorDelegate; // 0x338
};

struct UCrowWeaponManagerComponent {
	ACrowCharacterPawn* CharacterOwner; // 0xb0
	UCrowGameInvenComponent* GameInventory; // 0xb8
	bool IsPrewWeaponAiming; // 0xc0
	ACrowGameHUDBase* CrowInGameHUD; // 0xc8
};

struct UNavAreaMeta_SwitchByAgent {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UMaterialExpressionMaterialFunctionCall {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct ADefaultPawn {
	float BaseTurnRate; // 0x280
	float BaseLookUpRate; // 0x284
	UPawnMovementComponent* MovementComponent; // 0x288
	USphereComponent* CollisionComponent; // 0x290
	UStaticMeshComponent* MeshComponent; // 0x298
	char bAddDefaultMovementBindings : 1; // 0x2a0
};

struct UArrowComponent {
	FColor ArrowColor; // 0x440
	float ArrowSize; // 0x444
	float ArrowLength; // 0x448
	float ScreenSize; // 0x44c
	char bIsScreenSizeScaled : 1; // 0x450
	char bTreatAsASprite : 1; // 0x450
};

struct UCrowBoatsConfigEngine {
	bool Debug; // 0x28
	FName BodySocketName; // 0x2c
	float EngineSizeRadius; // 0x34
	float MinWaterDepthForEngine; // 0x38
	float SpeedMaxKmPH; // 0x3c
	float SpeedReverseMaxKmPH; // 0x40
	float SpeedIdleKmPH; // 0x44
	float BrakeStrength; // 0x48
	float AccelerationTime; // 0x4c
	float SteeringMultiply; // 0x50
	float SteeringRatioMax; // 0x54
	float SteeringSpeedMax; // 0x58
	FCrowVehicleInputSetting AccelerationInputSetting; // 0x5c
	FCrowVehicleInputSetting SteeringInputSetting; // 0x64
};

struct UMovieSceneSpawnTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	FGuid ObjectGuid; // 0x88
};

struct UNavArea {
	float DefaultCost; // 0x30
	float FixedAreaEnteringCost; // 0x34
	FColor DrawColor; // 0x38
	FNavAgentSelector SupportedAgents; // 0x3c
	char bSupportsAgent0 : 1; // 0x40
	char bSupportsAgent1 : 1; // 0x40
	char bSupportsAgent2 : 1; // 0x40
	char bSupportsAgent3 : 1; // 0x40
	char bSupportsAgent4 : 1; // 0x40
	char bSupportsAgent5 : 1; // 0x40
	char bSupportsAgent6 : 1; // 0x40
	char bSupportsAgent7 : 1; // 0x40
	char bSupportsAgent8 : 1; // 0x41
	char bSupportsAgent9 : 1; // 0x41
	char bSupportsAgent10 : 1; // 0x41
	char bSupportsAgent11 : 1; // 0x41
	char bSupportsAgent12 : 1; // 0x41
	char bSupportsAgent13 : 1; // 0x41
	char bSupportsAgent14 : 1; // 0x41
	char bSupportsAgent15 : 1; // 0x41
};

struct UPoseWatch {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct UWB_EnemyWatching_EnemyIndicator_C {
	UImage* IMG_LocateArrow; // 0x370
};

struct UAndroidPermissionCallbackProxy {
	FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate; // 0x28
};

struct UParticleModuleBeamSource {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UDatasmithDecalComponentTemplate {
	int32_t SortOrder; // 0x30
	FVector DecalSize; // 0x34
	UMaterialInterface* Material; // 0x40
};

struct AMagicLeapSharedWorldGameState {
	FMagicLeapSharedWorldSharedData SharedWorldData; // 0x290
	FMagicLeapSharedWorldAlignmentTransforms AlignmentTransforms; // 0x2a0
	FMulticastInlineDelegate OnSharedWorldDataUpdated; // 0x2b0
	FMulticastInlineDelegate OnAlignmentTransformsUpdated; // 0x2c0
};

struct USourceEffectFilterPreset {
	FSourceEffectFilterSettings Settings; // 0xb0
};

struct APaperGroupedSpriteActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct UAkMusicSyncCallbackInfo {
	int32_t PlayingID; // 0x30
	FAkSegmentInfo SegmentInfo; // 0x34
	EAkCallbackType MusicSyncType; // 0x58
	FString UserCueName; // 0x60
};

struct UInputAxisDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UNiagaraSimulationStageBase {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct UMovieSceneObjectPropertySection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe8
};

struct UMaterialExpressionSquareRoot {
	FExpressionInput Input; // 0x40
};

struct UAudioAnalyzerNRT {
	USoundWave* Sound; // 0x28
	float DurationInSeconds; // 0x30
};

struct UCrowHUDWeaponUnlockWidget {
	UTextBlock* TB_Level; // 0x348
	UTextBlock* TB_LevelUpMsg; // 0x350
	UTextBlock* TB_UnLockMsg; // 0x358
	UImage* IMG_Icon; // 0x360
	UWidgetAnimation* AniShowWeaponLevelUp; // 0x368
	UWidgetAnimation* AniShowWeaponUnlock; // 0x370
	UWidgetAnimation* AniHide; // 0x378
};

struct USynthKnob {
	float Value; // 0x108
	float StepSize; // 0x10c
	float MouseSpeed; // 0x110
	float MouseFineTuneSpeed; // 0x114
	char ShowTooltipInfo : 1; // 0x118
	FText ParameterName; // 0x120
	FText ParameterUnits; // 0x138
	FDelegate ValueDelegate; // 0x150
	FSynthKnobStyle WidgetStyle; // 0x160
	bool Locked; // 0x398
	bool IsFocusable; // 0x399
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x3a0
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x3b0
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x3c0
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x3d0
	FMulticastInlineDelegate OnValueChanged; // 0x3e0
};

struct UCrowVehicleHUDMh6 {
	UCanvasPanel* CP_FPView; // 0x390
	UCrowVehicleWidgetLevel* WB_Vehicle_Level; // 0x398
	TArray<UImage*> CrosshairImages; // 0x3a0
};

struct UNavLinkComponent {
	TArray<FNavigationLink> Links; // 0x448
};

struct UCrowdFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UNiagaraSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UInAppPurchaseCallbackProxy2 {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UParticleModuleTrailSource {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct ULeaderboardFlushCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UBTTask_RotateToFaceBBEntry {
	float Precision; // 0x98
};

struct UCrowBinderTargetBase {
	APawn* RootPawn; // 0x28
	UCrowBinderActorComponent* OwnerBinder; // 0x30
	int32_t BindingFlags; // 0x38
};

struct UCrowScoreInfoConquestUSItem {
	UImage* IMG_BackGround; // 0x348
	UImage* IMG_Class; // 0x350
	UImage* IMG_IsLocalPlayer; // 0x358
	UTextBlock* TB_NickName; // 0x360
	UTextBlock* TB_Score; // 0x368
	UTextBlock* TB_CurrentRanking; // 0x370
	UTextBlock* TB_EnemyDying; // 0x378
	UTextBlock* TB_Kill; // 0x380
	UTextBlock* TB_Death; // 0x388
	UTextBlock* TB_Latency; // 0x390
	UCanvasPanel* CP_Squad; // 0x398
	UImage* IMG_SquadColor; // 0x3a0
	UTextBlock* TB_SquadIndex; // 0x3a8
	UImage* IMG_SquadLeader; // 0x3b0
	FLinearColor LocalPlayerColor; // 0x3b8
	FLinearColor EvenCurrentRankingBackgroundColor; // 0x3c8
	FLinearColor OddCurrentRankingBackgroundColor; // 0x3d8
};

struct USceneCaptureComponent2D {
	ECameraProjectionMode ProjectionType; // 0x2b0
	float FOVAngle; // 0x2b4
	float OrthoWidth; // 0x2b8
	UTextureRenderTarget2D* TextureTarget; // 0x2c0
	ESceneCaptureCompositeMode CompositeMode; // 0x2c8
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x820
	char bOverride_CustomNearClippingPlane : 1; // 0x824
	float CustomNearClippingPlane; // 0x828
	bool bUseCustomProjectionMatrix; // 0x82c
	FMatrix CustomProjectionMatrix; // 0x830
	bool bEnableClipPlane; // 0x870
	FVector ClipPlaneBase; // 0x874
	FVector ClipPlaneNormal; // 0x880
	char bCameraCutThisFrame : 1; // 0x88c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x88c
	bool bDisableFlipCopyGLES; // 0x890
};

struct UCrowVehicleWidgetSeat {
	TArray<FCrowVehicleSeatCell> SeatCellInfos; // 0x358
	TArray<FCrowVehicleWidgetSeatIcon> SeatIcons; // 0x368
	TArray<UImage*> SeatIconImageList; // 0x378
	TArray<UCrowSeatSquadIconWidget*> SeatIconSquadWidgetList; // 0x388
};

struct UUPSAITask_AIRotateToTarget {
	FMulticastInlineDelegate OnRotationTaskFinished; // 0x68
	AAIController* AIC; // 0x78
	ACharacter* Character; // 0x80
	AActor* TargetActor; // 0x88
};

struct ANiagaraActor {
	UNiagaraComponent* NiagaraComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
};

struct UNiagaraPreviewAxis_InterpParamVector4 {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct ACLSCharacter {
	bool IsPressSprintKey; // 0x4c8
	AActor* CurrentLadder; // 0x4d0
	char bIsProned : 1; // 0x4d8
	char bIsSprinted : 1; // 0x4d8
	char bIsWalked : 1; // 0x4d8
	char bIsLookedFocus : 1; // 0x4d8
	char bRightShoulder : 1; // 0x4d8
	char bIsLookAround : 1; // 0x4d8
	char bUnresolvedReplication_IsProned : 1; // 0x4d8
	char bUnresolvedReplication_IsCrouched : 1; // 0x4d8
	char bUnresolvedReplication_IsSprint : 1; // 0x4d9
	char bUnresolvedReplication_IsWalk : 1; // 0x4d9
	char bUnresolvedReplication_IsLookFocus : 1; // 0x4d9
	float LookUpDownRate; // 0x4dc
	float LookLeftRightRate; // 0x4e0
	float LookDeltaSeconds; // 0x4e4
	float StandToCrouchAnimRate; // 0x4e8
	float StandToProneAnimRate; // 0x4ec
	float CrouchToStandAnimRate; // 0x4f0
	float CrouchToProneAnimRate; // 0x4f4
	float ProneToStandAnimRate; // 0x4f8
	float ProneToCrouchAnimRate; // 0x4fc
	char bUseProneLimitedArea : 1; // 0x500
	UCLSCharacterMovement* CachedCharacterMovement; // 0x508
	ECLSRotationMode AdjustClientRotationMode; // 0x510
	UTimelineComponent* VaultTimeline; // 0x518
	UCurveFloat* VaultTimelineCurve; // 0x520
	ECLSRotationMode RotationMode; // 0x528
	ECLSViewMode DesiredViewMode; // 0x529
	ECLSViewMode ViewMode; // 0x52a
	ECLSRotationMode DesiredRotationMode; // 0x52b
	ECLSMovementMode CurrentMovementMode; // 0x52c
	ECLSMovementMode PrevMovementMode; // 0x52d
	ECLSMovementAction MovementAction; // 0x52e
	ECLSWeaponAction WeaponAction; // 0x52f
	ECLSCommonAction CommonAction; // 0x530
	ECLSBattleStance BattleStance; // 0x531
	ECLSOverlayState OverlayState; // 0x532
	ECLSPeekState DesiredPeekState; // 0x533
	ECLSPeekState ActualPeekState; // 0x534
	bool bDesiredFiringState; // 0x535
	bool bActualFiringState; // 0x536
	ECLSLadderState LadderState; // 0x537
	FRotator LookingRotation; // 0x538
	FRotator LookAroundRotation; // 0x544
	FVector Acceleration; // 0x550
	bool bIsMoving; // 0x55c
	bool bHasMovementInput; // 0x55d
	FRotator LastVelocityRotation; // 0x560
	FRotator LastMovementInputRotation; // 0x56c
	float Speed; // 0x578
	float MovementInputAmount; // 0x57c
	float AimYawRate; // 0x580
	FVector SubRootOffset; // 0x584
	float CurrentSlopeAngle; // 0x590
	bool bUseArmLOverwrite; // 0x594
	FCLSCameraParameters CameraParameters; // 0x595
	FDataTableRowHandle MovementModel; // 0x598
	FCLSMovementSettingsData MovementData; // 0x5a8
	FRotator SmoothTargetRotation; // 0x6c8
	FRotator TurnTargetRotation; // 0x6d4
	FRotator InAirRotation; // 0x6e0
	float YawOffset; // 0x6ec
	bool bRotateOnChangingProne; // 0x6f0
	bool bPendingGroundRotate; // 0x6f1
	bool bIsKeepWalking; // 0x6f2
	FCLSVaultParams VaultParams; // 0x6f8
	FCLSComponentTransform VaultLedgeLS; // 0x720
	FTransform VaultTarget; // 0x840
	FTransform VaultActualStartOffset; // 0x870
	FTransform VaultAnimatedStartOffset; // 0x8a0
	FCLSVaultTraceSettings GroundedTraceSettings; // 0x8d0
	FCLSVaultTraceSettings FallingTraceSettings; // 0x8ec
	FVector RagdollLocation; // 0x908
	FVector RagdollVelocity; // 0x914
	bool bRagdollOnGround; // 0x920
	bool bRagdollFaceUp; // 0x921
	FVector PreviousVelocity; // 0x924
	float PreviousAimYaw; // 0x930
	float PreviousSlopeAngle; // 0x934
	FCLSCharacterBattleStanceTime BattleStanceTimeSetting; // 0x938
	UCurveVector* Vault1MCurve; // 0x948
	UCurveVector* Vault2MCurve; // 0x950
	FCLSVaultAsset Vault_2M_Default; // 0x958
	FCLSVaultAsset Vault_1M_Default; // 0x998
	FCLSVaultAsset Vault_1M_RH; // 0x9d8
	FCLSVaultAsset Vault_1M_LH; // 0xa18
	FCLSVaultAsset Vault_1M_2H; // 0xa58
	FCLSVaultAsset Vault_1M_Box; // 0xa98
	FCLSVaultAsset Vault_Low70; // 0xad8
	FCLSVaultAsset Vault_Low70_Melee; // 0xb18
	FCLSVaultAsset JumpOver_Low70; // 0xb58
	FCLSVaultAsset JumpOver_Low70_Melee; // 0xb98
	FCLSVaultAsset JumpOver_1M; // 0xbd8
	FCLSVaultAsset JumpOver_1M_Under; // 0xc18
	FCLSVaultAsset JumpOver_1M_Damage; // 0xc58
	FCLSVaultAsset JumpOver_1M_Dying; // 0xc98
	FCLSVaultAsset JumpOver_1M_Dead; // 0xcd8
	FCLSVaultAsset JumpOver_2M; // 0xd18
	FCLSVaultAsset JumpOver2M_Damage; // 0xd58
	FCLSVaultAsset JumpOver_2M_Under; // 0xd98
	FCLSVaultAsset JumpOver_2M_Dying; // 0xdd8
	FCLSVaultAsset JumpOver_2M_Dead; // 0xe18
	FCLSVaultAsset JumpOver_Window; // 0xe58
	FCLSVaultAsset JumpOver_Window_Under; // 0xe98
	FVector NotMovingPivotOffset; // 0xed8
	FVector WalkingPivotOffset; // 0xee4
	FVector RunningPivotOffset; // 0xef0
	FVector SprintingPivotOffset; // 0xefc
	FVector CrouchSprintingPivotOffset; // 0xf08
	float CrouchPivotOffsetZRatio; // 0xf14
	float PronePivotOffsetZRatio; // 0xf18
	FVector AddPronePivotOffset; // 0xf1c
	FVector WalkingPivotLerpSpeed; // 0xf28
	FVector RunningPivotLerpSpeed; // 0xf34
	FVector SprintingPivotLerpSpeed; // 0xf40
	FVector CrouchSprintingPivotLerpSpeed; // 0xf4c
	float WalkingAddFOV; // 0xf58
	float RunningAddFOV; // 0xf5c
	float SprintingAddFOV; // 0xf60
	float CrouchSprintingAddFOV; // 0xf64
	float WalkingAddFOVLerpSpeed; // 0xf68
	float RunningAddFOVLerpSpeed; // 0xf6c
	float SprintingAddFOVLerpSpeed; // 0xf70
	float CrouchSprintingAddFOVLerpSpeed; // 0xf74
	FVector DeadPivotOffset; // 0xf78
	float ShoulderViewChangedInterpolationSpeed; // 0xf84
	FVector FPStandingOffset; // 0xf88
	FVector FPCrouchingOffset; // 0xf94
	FVector PrePivot; // 0xfa0
	bool bShoulderViewChanged; // 0xfac
	float PrevPivotY; // 0xfb0
	FVector CurrentAdditionalFPCameraOffset; // 0xfb4
	bool IsJumping; // 0x10cc
	bool IsJumpOverVault; // 0x10cd
	ECLSVaultType CurrVaultType; // 0x10ce
	bool IsPlayingVault; // 0x10cf
	FVector PrevVaultPos; // 0x10d0
	float StartVaultPosition; // 0x10dc
	float PrevZValue; // 0x10e0
};

struct UMaterialExpressionSceneColor {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput OffsetFraction; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UUPSEnemyAction {
	FMulticastInlineDelegate OnActionFinishedDelegate; // 0x30
	ACharacter* Character; // 0x40
	TArray<UUPSEnemyActionScript*> EnemyActionScripts; // 0x50
	TArray<UUPSActionCondition*> ActionConditions; // 0x60
};

struct UMaterialExpressionAtmosphericFogColor {
	FExpressionInput WorldPosition; // 0x40
};

struct UCrowWorldLightProbeVolume {
	FVector LightForward; // 0x460
	FRotator LightRotation; // 0x46c
	FCrowWorldLightProbeSetting LightProbeSetting; // 0x478
	FCrowWorldLightProbeVolumeSetting LightProbeVolumeSetting; // 0x4c4
	TArray<FCrowWorldLightGroup> LightGroups; // 0x4e8
	TArray<UCrowWorldLightProbe*> LightProbes; // 0x4f8
};

struct UAkMacInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UCrowConquestMeteorShowerPoint {
	UBillboardComponent* Billboard; // 0x1f8
	float IconScale; // 0x200
};

struct UOverlaySlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UDeviceProfileManager {
	TArray<UObject*> Profiles; // 0x28
};

struct UUMGSequencePlayer {
	UWidgetAnimation* Animation; // 0x410
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x420
};

struct UInterpTrackInstAkAudioRTPC {
	float LastUpdatePosition; // 0x28
};

struct UCrowLobbyProfileMercenaryWidget {
	UCrowDropDownWidget* Dropdown_All; // 0x348
	UCrowDropDownWidget* Dropdown_Time; // 0x350
	UTextBlock* TB_Rank; // 0x358
	UTextBlock* TB_Grade; // 0x360
	UTextBlock* TB_Kill; // 0x368
	UTextBlock* TB_Assist; // 0x370
	UTextBlock* TB_Death; // 0x378
	UTextBlock* TB_Faint; // 0x380
	UTextBlock* TB_TotalScore; // 0x388
	UTextBlock* TB_AverageScore; // 0x390
	UTextBlock* TB_WinLose; // 0x398
	UTextBlock* TB_PlayTime; // 0x3a0
};

struct UCrowCharacterAliveIconWidget {
	UCanvasPanel* CP_DisconnectIcon; // 0x3c8
	UImage* IMG_Icon; // 0x3d0
	UTextBlock* TB_SquadNum; // 0x3d8
	ACrowPlayerStateBase* LocalPlayerState; // 0x3e0
	ACrowPlayerStateBase* TargetPlayerState; // 0x3e8
	ACrowCharacterPawn* CharacterPawn; // 0x3f0
};

struct UMovieSceneFolder {
	FName FolderName; // 0x28
	TArray<UMovieSceneFolder*> ChildFolders; // 0x30
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x40
	TArray<FString> ChildObjectBindingStrings; // 0x50
};

struct UDrawPolygonToolStandardProperties {
	EDrawPolygonDrawMode PolygonType; // 0x60
	EDrawPolygonOutputMode OutputMode; // 0x61
	float FeatureSizeRatio; // 0x64
	float ExtrudeHeight; // 0x68
	int32_t Steps; // 0x6c
	bool bAllowSelfIntersections; // 0x70
	bool bShowGizmo; // 0x71
};

struct UCrowVehicleFSM {
	FName VehicleName; // 0xb0
	ACrowVehiclePawn* VehiclePawn; // 0xb8
	ECrowVehicleState CurrentStateID; // 0xc0
	UCrowVehicleStateBase* CurrentState; // 0xc8
	TMap<ECrowVehicleState, UCrowVehicleStateBase*> StateMap; // 0xd0
	TMap<ECrowVehicleTask, UCrowVehicleTaskBase*> TaskMap; // 0x120
};

struct UCrowRotorTaskBase {
	UCrowRotorFSM* RotorFSM; // 0x38
};

struct UAISense {
	float DefaultExpirationAge; // 0x28
	EAISenseNotifyType NotifyType; // 0x2c
	char bWantsNewPawnNotification : 1; // 0x30
	char bAutoRegisterAllPawnsAsSources : 1; // 0x30
	UAIPerceptionSystem* PerceptionSystemInstance; // 0x38
};

struct ACrowWeaponMelee {
	FVector SavePos; // 0x1eb8
	FVector CurrPos; // 0x1ec4
	float SaveTime; // 0x1ed0
	float AddDeltaTime; // 0x1ed4
	TArray<FVector> TimeStack; // 0x1ed8
	bool HasCheck; // 0x1ee8
	FCrowWeaponTableRow OverrideWeaponTable; // 0x1ef0
	FCrowAmmoTableRow OverrideAmmoTable; // 0x3110
	FTimerHandle ThrowablePoseOnVehicleHandle; // 0x3338
};

struct ABP_SkydivingSkillPawn_C {
	UArrowComponent* Vel_Arrow_Z; // 0xac0
	UArrowComponent* Vel_Arrow_Y; // 0xac8
	UArrowComponent* Vel_Arrow_X; // 0xad0
	UCameraComponent* Camera; // 0xad8
	UCrowSpringArmComponent* CrowSpringArm; // 0xae0
	UArrowComponent* Vel_Arrow; // 0xae8
};

struct UMaterialExpressionSign {
	FExpressionInput Input; // 0x40
};

struct UInterpTrackInstVectorProp {
	FVector ResetVector; // 0x58
};

struct USceneComponent {
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xb8
	USceneComponent* AttachParent; // 0xc0
	FName AttachSocketName; // 0xc8
	TArray<USceneComponent*> AttachChildren; // 0xd0
	TArray<USceneComponent*> ClientAttachedChildren; // 0xe0
	FVector RelativeLocation; // 0x11c
	FRotator RelativeRotation; // 0x128
	FVector RelativeScale3D; // 0x134
	FVector ComponentVelocity; // 0x140
	char bComponentToWorldUpdated : 1; // 0x14c
	char bAbsoluteLocation : 1; // 0x14c
	char bAbsoluteRotation : 1; // 0x14c
	char bAbsoluteScale : 1; // 0x14c
	char bVisible : 1; // 0x14c
	char bShouldBeAttached : 1; // 0x14c
	char bShouldSnapLocationWhenAttached : 1; // 0x14c
	char bShouldSnapRotationWhenAttached : 1; // 0x14d
	char bShouldUpdatePhysicsVolume : 1; // 0x14d
	char bHiddenInGame : 1; // 0x14d
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x14d
	char bUseAttachParentBound : 1; // 0x14d
	EComponentMobility Mobility; // 0x14f
	EDetailMode DetailMode; // 0x150
	FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x151
};

struct UBTTask_RunBehavior {
	UBehaviorTree* BehaviorAsset; // 0x70
};

struct UUPSGroupMovementVisualizer {
	TMap<TWeakObjectPtr<AUPSMovementGroup>, bool> MovementGroups; // 0x38
};

struct ACrowDeathZoneVolume {
	float DefaultTimeToDieTimeSecond; // 0x258
	UUserWidget* DeathZoneWidgetClass; // 0x260
	APostProcessVolume* DeathZonePostProcessVolume; // 0x268
	UCrowDeathZoneWidget* DeathZoneWidget; // 0x270
	TArray<FCrowDeathZoneVolumeActor> EnterActors; // 0x278
};

struct URevolveBoundaryOperatorFactory {
	URevolveBoundaryTool* RevolveBoundaryTool; // 0x30
};

struct ULandscapeGrassType {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct UBoxReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UGarbageCollectionSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UCrowWeaponZoomDistWidget {
	UTextBlock* TB_Distance; // 0x370
};

struct UAnimNotify_PlayMontageNotify {
	FName NotifyName; // 0x38
};

struct UAnimNotify_PlayParticleEffect {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UPawnAction_Sequence {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct USubmixEffectSubmixEQPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0xa0
};

struct UDistributionFloatUniformCurve {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct ARectLight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct UDrawFrustumComponent {
	FColor FrustumColor; // 0x440
	float FrustumAngle; // 0x444
	float FrustumAspectRatio; // 0x448
	float FrustumStartDist; // 0x44c
	float FrustumEndDist; // 0x450
	UTexture* Texture; // 0x458
};

struct UCrowIndicatorViewInfoPing {
	UCrowPingIndicatorWidget* PingIndicatorWidget; // 0x198
};

struct ACrowPlayerStateSquadMatch {
	FCrowSquadBattleInfo SquadBattleInfo; // 0xb78
	uint32_t AssistCount; // 0xb80
	bool bIsReserveZombie; // 0xb84
	int32_t AttachedSpectatorCount; // 0xb88
	FCrowSquadMatchResultInfo SquadMatchResultInfo; // 0xb90
	ACrowMiningPointActor* OverlappedMiningPoint; // 0xbb0
	ACrowTargetTraceEffect* ChageZombieEffectComp; // 0xbb8
	TArray<FCrowSquadRewardInfo> RewardInfoArray; // 0xbc0
};

struct ACrowPlayerControllerReplay {
	UCrowWidgetBase* ReplayPlayerWidget; // 0xf20
	uint64_t CacheAttachedServerKey; // 0xf28
	char CacheTeamId; // 0xf30
};

struct UParticleModuleEventReceiverSpawn {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct ACrowGameHUD_BombMission {
	UUserWidget* MainBombMissionWidgetClass; // 0x5f0
	UCrowInGameLoadoutWidget* InGameLoadoutWidgetClass; // 0x5f8
	UCrowInGameLoadoutPopupWidget* InGameLoadoutPopupWidgetClass; // 0x600
	UUserWidget* ObjectiveBombMissionWidgetClass; // 0x608
	UUserWidget* ResultScoreBombMissionWidgetClass; // 0x610
	UUserWidget* StartMatchWidgetClass; // 0x618
	UUserWidget* PositionChangeWidgetClass; // 0x620
	UCrowHUDBombMissionWidget* MainBombMissionWidget; // 0x628
	UCrowInGameLoadoutWidget* InGameLoadoutWidget; // 0x630
	UCrowInGameLoadoutPopupWidget* InGameLoadoutPopupWidget; // 0x638
	UCrowObjectiveBombMissionWidget* ObjectiveBombMissionWidget; // 0x640
	UCrowBombMissionScoreBoardWidget* BombMissionScoreBoardWidget; // 0x648
	UCrowResultScoreBombMissionWidget* ResultScoreBombMissionWidget; // 0x650
	UCrowBMStartMatchWidget* StartMatchWidget; // 0x658
	UCrowBMPositionChangeWidget* PositionChangeWidget; // 0x660
	char PrevTeamID; // 0x668
	char PrevAttackerTeamID; // 0x669
	float DelayedShowPositionChangeWidgetTimeSec; // 0x66c
	FTimerHandle ShowPositionChangeWidgetHandle; // 0x670
	FTimerHandle ShowMatchPointWidgetHandle; // 0x678
	FTimerHandle PlayCountdownTimerHandle; // 0x680
	bool bIsBlockScreen; // 0x688
};

struct UCrowVehicleCrosshairTankSmoke {
	URichTextBlock* RTB_Smoke_Ready; // 0x428
	URichTextBlock* RTB_Smoke_Timer; // 0x430
	FString TimerTextKey; // 0x438
	FString ReadyTextKey; // 0x448
	UCrowStatusWidget* StatusWidget; // 0x458
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance {
	int32_t LightIndex; // 0x40
	FExpressionInput WorldPosition; // 0x44
};

struct UMagicLeapSettings {
	bool bEnableZI; // 0x28
	bool bUseVulkanForZI; // 0x29
	bool bUseMLAudioForZI; // 0x2a
};

struct ACameraRig_Crane {
	float CranePitch; // 0x220
	float CraneYaw; // 0x224
	float CraneArmLength; // 0x228
	bool bLockMountPitch; // 0x22c
	bool bLockMountYaw; // 0x22d
	USceneComponent* TransformComponent; // 0x230
	USceneComponent* CraneYawControl; // 0x238
	USceneComponent* CranePitchControl; // 0x240
	USceneComponent* CraneCameraMount; // 0x248
};

struct USpacer {
	FVector2D Size; // 0x108
};

struct UGameUserSettings {
	bool bUseVSync; // 0x28
	bool bUseDynamicResolution; // 0x29
	uint32_t ResolutionSizeX; // 0x80
	uint32_t ResolutionSizeY; // 0x84
	uint32_t LastUserConfirmedResolutionSizeX; // 0x88
	uint32_t LastUserConfirmedResolutionSizeY; // 0x8c
	int32_t WindowPosX; // 0x90
	int32_t WindowPosY; // 0x94
	int32_t FullscreenMode; // 0x98
	int32_t LastConfirmedFullscreenMode; // 0x9c
	int32_t PreferredFullscreenMode; // 0xa0
	uint32_t Version; // 0xa4
	int32_t AudioQualityLevel; // 0xa8
	int32_t LastConfirmedAudioQualityLevel; // 0xac
	float FrameRateLimit; // 0xb0
	int32_t DesiredScreenWidth; // 0xb8
	bool bUseDesiredScreenHeight; // 0xbc
	int32_t DesiredScreenHeight; // 0xc0
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xc4
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xc8
	float LastRecommendedScreenWidth; // 0xcc
	float LastRecommendedScreenHeight; // 0xd0
	float LastCPUBenchmarkResult; // 0xd4
	float LastGPUBenchmarkResult; // 0xd8
	TArray<float> LastCPUBenchmarkSteps; // 0xe0
	TArray<float> LastGPUBenchmarkSteps; // 0xf0
	float LastGPUBenchmarkMultiplier; // 0x100
	bool bUseHDRDisplayOutput; // 0x104
	int32_t HDRDisplayOutputNits; // 0x108
	FMulticastInlineDelegate OnGameUserSettingsUINeedsUpdate; // 0x110
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct UCrowInGameMissionAlarmWidget {
	UVerticalBox* VB_List; // 0x348
	UCrowInGameMissionAlarmItem* ComplateItem; // 0x350
	UCrowInGameMissionAlarmItem* CountingItem; // 0x358
};

struct UCrowZombieWaitingWidget {
	UTextBlock* TB_Timer; // 0x348
	UWidgetAnimation* AniShow; // 0x350
};

struct UMirrorToolProperties {
	EMirrorOperationMode OperationMode; // 0x60
	bool bCropAlongMirrorPlaneFirst; // 0x61
	bool bWeldVerticesOnMirrorPlane; // 0x62
	bool bAllowBowtieVertexCreation; // 0x63
	bool bSnapToWorldGrid; // 0x64
	EMirrorCtrlClickBehavior CtrlClickBehavior; // 0x65
	bool bButtonsOnlyChangeOrientation; // 0x66
	bool bShowPreview; // 0x67
	EMirrorSaveMode SaveMode; // 0x68
};

struct UMaterialExpressionComment {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UWidgetBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x328
	char bClassRequiresNativeTick : 1; // 0x330
	TArray<FDelegateRuntimeBinding> Bindings; // 0x338
	TArray<UWidgetAnimation*> Animations; // 0x348
	TArray<FName> NamedSlots; // 0x358
};

struct UBTDecorator_TagCooldown {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct USequenceCameraShakeSequencePlayer {
	UObject* BoundObjectOverride; // 0x480
	UMovieSceneSequence* Sequence; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x490
};

struct ACrowParachuteSupplyActor {
	UProjectileMovementComponent* MovementComp; // 0x220
	USkeletalMeshComponent* ParachuteMesh; // 0x228
	float MaxSpeed; // 0x230
	float DestroyRateSecond; // 0x234
	TWeakObjectPtr<AActor> AttachTargetActor; // 0x238
	FTimerHandle Timer_Destroy; // 0x240
	UAnimMontage* AnimMontage; // 0x248
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct APaperTerrainActor {
	USceneComponent* DummyRoot; // 0x220
	UPaperTerrainSplineComponent* SplineComponent; // 0x228
	UPaperTerrainComponent* RenderComponent; // 0x230
};

struct ULightPropagationVolumeBlendable {
	FLightPropagationVolumeSettings Settings; // 0x30
	float BlendWeight; // 0x70
};

struct UCrowMailPopupSlotWidget {
	UWidgetSwitcher* WS_SlotTitle; // 0x368
	UTextBlock* TB_Username; // 0x370
	UTextBlock* TB_RewardTitle; // 0x378
	UCrowWidgetImage* IMG_Reward; // 0x380
	UTextBlock* TB_RemainTime; // 0x388
	UTextBlock* TB_RewardName; // 0x390
	UWidgetSwitcher* WS_ButtonStatus; // 0x398
	UCrowButton* BT_Reward; // 0x3a0
	UCrowButton* BT_Delete; // 0x3a8
	int64_t MailNo; // 0x3b0
	char MailType; // 0x3b8
	FDateTime RewardEndDateTime; // 0x3c0
	bool bIsUpdateRemainTime; // 0x3c8
};

struct ACrowWorldOverviewActor {
	UStaticMeshComponent* SphereMesh; // 0x220
	bool AutoCollectSyncHub; // 0x228
	float SizeColumn; // 0x22c
	float SizeRow; // 0x230
	float RandomYaw; // 0x234
	float RandomScale; // 0x238
	int32_t CountInRow; // 0x23c
	int32_t RepeatWhole; // 0x240
	int32_t RepeatItem; // 0x244
	FCrowBuildingEditorPreview EditorPreview; // 0x248
	TArray<UBlueprint*> ActorAssets; // 0x250
	TArray<AActor*> ActorInstances; // 0x260
};

struct UChaosClothConfig {
	EClothMassMode MassMode; // 0x28
	float UniformMass; // 0x2c
	float TotalMass; // 0x30
	float Density; // 0x34
	float MinPerParticleMass; // 0x38
	float EdgeStiffness; // 0x3c
	float BendingStiffness; // 0x40
	bool bUseBendingElements; // 0x44
	float AreaStiffness; // 0x48
	float VolumeStiffness; // 0x4c
	float StrainLimitingStiffness; // 0x50
	float LimitScale; // 0x54
	EChaosClothTetherMode TetherMode; // 0x58
	bool bUseGeodesicDistance; // 0x59
	float ShapeTargetStiffness; // 0x5c
	float CollisionThickness; // 0x60
	float FrictionCoefficient; // 0x64
	bool bUseSelfCollisions; // 0x68
	float SelfCollisionThickness; // 0x6c
	bool bUseLegacyBackstop; // 0x70
	float DampingCoefficient; // 0x74
	bool bUsePointBasedWindModel; // 0x78
	float DragCoefficient; // 0x7c
	float LiftCoefficient; // 0x80
	bool bUseGravityOverride; // 0x84
	float GravityScale; // 0x88
	FVector Gravity; // 0x8c
	float AnimDriveSpringStiffness; // 0x98
	FVector LinearVelocityScale; // 0x9c
	float AngularVelocityScale; // 0xa8
	bool bUseTetrahedralConstraints; // 0xac
	bool bUseThinShellVolumeConstraints; // 0xad
	bool bUseContinuousCollisionDetection; // 0xae
};

struct UM2_Browning_Boat_Front_Anim_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x318
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x328
	FAnimNode_Slot AnimGraphNode_Slot; // 0x348
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x390
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3b0
	FAnimNode_VehicleWeaponHandler AnimGraphNode_VehicleWeapon; // 0x3d0
};

struct UConvertToPolygonsTool {
	UConvertToPolygonsToolProperties* Settings; // 0x88
	UPreviewMesh* PreviewMesh; // 0x90
};

struct UMaterialExpressionAdd {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMovieScenePropertyTrack {
	UMovieSceneSection* SectionToKey; // 0x78
	FMovieScenePropertyBinding PropertyBinding; // 0x80
	TArray<UMovieSceneSection*> Sections; // 0x98
};

struct UFieldSystemMetaDataIteration {
	int32_t Iterations; // 0xb0
};

struct UEnvQueryGenerator {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UGranularSynth {
	USoundWave* GranulatedSoundWave; // 0x6c0
};

struct UCrowCharacterHUD {
	FCrowCharacterHUDSetting HudSetting; // 0x260
};

struct UCrowLoadingWidget {
	UTextBlock* TB_MapName; // 0x348
	UTextBlock* TB_GameMode; // 0x350
	UTextBlock* TB_TipDesc; // 0x358
	UImage* IMG_LoadingIMG; // 0x360
	UImage* TipImage; // 0x368
	UImage* IMG_Loading_In; // 0x370
	UVerticalBox* VB_ModeDescList; // 0x378
	UWidgetAnimation* AniStart; // 0x380
	UUMGSequencePlayer* AniStartPlayer; // 0x388
};

struct UCameraShakeSourceComponent {
	ECameraShakeAttenuation Attenuation; // 0x1f8
	float InnerAttenuationRadius; // 0x1fc
	float OuterAttenuationRadius; // 0x200
	UCameraShakeBase* CameraShake; // 0x208
	bool bAutoStart; // 0x210
};

struct UParticleModuleLocationDirect {
	FRawDistributionVector Location; // 0x30
	FRawDistributionVector LocationOffset; // 0x78
	FRawDistributionVector ScaleFactor; // 0xc0
	FRawDistributionVector Direction; // 0x108
};

struct UCrowCharacterAnimInstBase {
	ECrowWeaponSubType CurrentWeaponType; // 0x2b8
	ECrowRotationMode RotationMode; // 0x2b9
	ECrowMovementMode CurrentMovementMode; // 0x2ba
	ECrowMovementMode PrevMovementMode; // 0x2bb
	ECrowCharacterAnimStance CurrentStance; // 0x2bc
	ECrowCharacterAnimStance TransitionStance; // 0x2bd
	ECrowCharacterBattleStance BattleStance; // 0x2be
	bool bIsMoving; // 0x2bf
	FVector Velocity; // 0x2c0
	FVector2D AimOffset; // 0x2cc
	float MoveDirection; // 0x2d4
	float GaitValue; // 0x2d8
	float PlayRateStand; // 0x2dc
	float PlayRateCrouch; // 0x2e0
	float PlayRateProne; // 0x2e4
	bool bIsTurnInPlace; // 0x2e8
	float StanceBlendingTime; // 0x2ec
	bool bIsWeaponRightHanded; // 0x2f0
	bool bIsProneMoving; // 0x2f1
	bool bIsOnInteract; // 0x2f2
};

struct UCrowWorldSplineDeformComponent {
	bool bLeftsideDeform; // 0xb0
	bool bRightsideDeform; // 0xb1
	UCrowWorldSplineComponent* CrowSplineComponent; // 0xb8
	bool bInitialized; // 0xc0
	TArray<FCrowLandscapeSplineInterpPoint> CachedPoints; // 0xc8
	int32_t CachedPointsFalloffTrace; // 0xd8
};

struct ULandscapeSplineSegment {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct UCrowBattleInventoryWidget {
	UCrowInventoryInputEventHandler* DragStartInputHandler; // 0x368
	UCrowInventoryInputEventHandler* DragEndInputHandler; // 0x370
	UCrowInvenItemSlot* DragStartWidget; // 0x378
	UCrowInvenItemSlot* DragEndWidget; // 0x380
	UCrowBackPackInfoWidget* WB_BackPackInfo; // 0x388
	UCrowLoadoutInfoWidget* WB_LoadoutInfo; // 0x390
	UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_2; // 0x398
	UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_3; // 0x3a0
	UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_4; // 0x3a8
	UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_5; // 0x3b0
	UCrowTutorialInventoryWidget* WB_Tutorial_Inventory_6; // 0x3b8
	UCrowInvenArmorInfoWidget* WB_InvenArmorInfo; // 0x3c0
	UCrowDropBoxWidget* WB_DropBox_L; // 0x3c8
	UCrowDropBoxWidget* WB_DropBox__R; // 0x3d0
	UButton* BTN_PIE_Exit; // 0x3d8
	TArray<UCrowTutorialInventoryWidget*> DiscriptionWidgetList; // 0x3e0
	TWeakObjectPtr<UCrowGameInvenComponent> CrowGameInvenComponent; // 0x3f0
	UCrowInventoryInputEventHandler* SelectDragWidget; // 0x3f8
};

struct UClothConfigNv {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	FVector LinearDrag; // 0x90
	FVector AngularDrag; // 0x9c
	FVector LinearInertiaScale; // 0xa8
	FVector AngularInertiaScale; // 0xb4
	FVector CentrifugalInertiaScale; // 0xc0
	float SolverFrequency; // 0xcc
	float StiffnessFrequency; // 0xd0
	float GravityScale; // 0xd4
	FVector GravityOverride; // 0xd8
	bool bUseGravityOverride; // 0xe4
	float TetherStiffness; // 0xe8
	float TetherLimit; // 0xec
	float CollisionThickness; // 0xf0
	float AnimDriveSpringStiffness; // 0xf4
	float AnimDriveDamperStiffness; // 0xf8
	EClothingWindMethod_Legacy WindMethod; // 0xfc
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x100
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x110
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x120
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x130
};

struct UCrowPartyWidget {
	UCrowFriendSlotWidget* WB_LocalPlayer; // 0x348
	UVerticalBox* VB_EmptySlot; // 0x350
	UVerticalBox* VB_PartySlot; // 0x358
	UCrowButton* BT_Close; // 0x360
	UCrowButton* BT_Promote; // 0x368
	UCrowButton* BT_CancelPromote; // 0x370
	UCrowButton* BT_ExitParty; // 0x378
	UCrowButton* BT_AddParty_2; // 0x380
	UCrowButton* BT_AddParty_3; // 0x388
	UCrowButton* BT_AddParty_4; // 0x390
	UCrowFriendSlotWidget* FriendSlotWidgetClass; // 0x398
	ACrowSceneLobby* SceneLobby; // 0x3a0
	bool PromoteMode; // 0x3a8
};

struct UGeometryCache {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
	int32_t StartFrame; // 0x60
	int32_t EndFrame; // 0x64
};

struct URestrictedGameplayTagsList {
	FString ConfigFileName; // 0x28
	TArray<FRestrictedGameplayTagTableRow> RestrictedGameplayTagList; // 0x38
};

struct UCrowFoliageAffectorComponent {
	bool bLoop; // 0x1f8
	FMulticastInlineDelegate OnTimeAnimationFinished; // 0x200
	bool bVolatileAffector; // 0x210
	bool bAlwaysRender; // 0x211
	bool bWindAffector; // 0x212
	bool bStartWithBeginPlay; // 0x213
	bool bChangeViewModeLocation; // 0x214
	FVector Location_FP; // 0x218
	FVector Location_TP; // 0x224
	UMaterialInterface* MI; // 0x230
	FCrowFoliageAffectByDistance AffectByDistance; // 0x238
	UCrowFoliageAffectorAnimData* AnimData; // 0x258
	bool IsVehicle; // 0x260
	TSet<ECrowVehicleState> BindVehicleState; // 0x268
	float ScaleMultiplier; // 0x2b8
	float PowerMultiplier; // 0x2bc
	UMaterialInstanceDynamic* MIDBrush; // 0x2c0
	UCrowRotorFSM* RotorFSM; // 0x2c8
	UCrowFoliageAffectorAnimData* AnimDataInstance; // 0x2d0
	FCrowFoliageAffectorDrawParam DrawParam; // 0x2d8
	bool bRegisted; // 0x310
	bool bNeedRegister; // 0x311
	FVector LocationByViewMode; // 0x314
	ECrowVehicleState CurrentVehicleState; // 0x320
};

struct UCrowUserExpTableManager {
	TMap<int32_t, FCrowUserExpTableRow> UserExpData; // 0x28
};

struct UCrowCustomCursorSpaceWidget {
	UCanvasPanel* CP_Root; // 0x348
	UCrowCustomCursorBase* CustomCursor; // 0x350
	UCanvasPanelSlot* CursorPanelSlot; // 0x358
};

struct UCrowTriggerCommandGaugeBar {
	UCrowProgressBarWidget* GaugeWidget; // 0x128
};

struct UOnsetNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct UBackgroundBlurSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UGeometryCacheTrack {
	float Duration; // 0x28
};

struct UCrowGameModWidget {
	UCrowSelectWorldButtonWidget* SelectWorldButtonWidgetClass; // 0x348
	UHorizontalBox* HB_ModeList; // 0x350
	UHorizontalBox* HB_MapList; // 0x358
	UTextBlock* TB_SelectModeName; // 0x360
	UTextBlock* TB_StageName; // 0x368
	UCrowButton* BT_Apply; // 0x370
	UCrowSelectModButtonWidget* WB_SelectModButton_SM; // 0x378
	UCrowSelectModButtonWidget* WB_SelectModButton_SO; // 0x380
	UCrowSelectModButtonWidget* WB_SelectModButton_TDE; // 0x388
	UCrowSelectModButtonWidget* WB_SelectModButton_TG; // 0x390
	ECrowGameMode CurrentGameMode; // 0x398
	uint32_t CurrentMapIndex; // 0x39c
	TArray<UCrowSelectModButtonWidget*> ModButtonWidgetArray; // 0x3a0
};

struct UCrowSquadInfo {
	char TeamID; // 0x34
	FString SquadKey; // 0x38
	FString SquadName; // 0x48
	TArray<FCrowSquadPlayer> PlayerArray; // 0x58
	int32_t PlayerCount; // 0x68
	uint32_t SquadPoint; // 0x6c
	ACrowMissionArea* WaitRespawnArea; // 0x70
	uint32_t TotalRetreivedMineral; // 0x78
	TArray<ECrowModPointIndex> UpdateModePointIndexArray; // 0x80
	TArray<FCrowPingData> PingDataArray; // 0x90
	TArray<FCrowSquadRewardInfo> RewardInfoArray; // 0xa0
};

struct UAnimNotify_CLSWeaponAction {
	ECLSWeaponAction WeaponAction; // 0x30
};

struct UCrowWorldSyncHubStatisticsComp {
	TArray<FCrowWorldSyncBuildingLink> CollectionBuildingLink; // 0xb0
	TArray<FCrowWorldSyncBuildingPropLink> CollectionBuildingPropLink; // 0xc0
	TArray<FCrowWorldSyncWorldPropLink> CollectionWorldPropLink; // 0xd0
};

struct USkeletalMeshSocket {
	FName SocketName; // 0x28
	FName BoneName; // 0x30
	FVector RelativeLocation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale; // 0x50
	bool bForceAlwaysAnimated; // 0x5c
};

struct UARTextureCameraDepth {
	EARDepthQuality DepthQuality; // 0xf8
	EARDepthAccuracy DepthAccuracy; // 0xf9
	bool bIsTemporallySmoothed; // 0xfa
};

struct UWidgetComponent {
	EWidgetSpace Space; // 0x468
	EWidgetTimingPolicy TimingPolicy; // 0x469
	UUserWidget* WidgetClass; // 0x470
	FIntPoint DrawSize; // 0x478
	bool bManuallyRedraw; // 0x480
	bool bRedrawRequested; // 0x481
	float RedrawTime; // 0x484
	FIntPoint CurrentDrawSize; // 0x490
	bool bDrawAtDesiredSize; // 0x498
	FVector2D Pivot; // 0x49c
	bool bReceiveHardwareInput; // 0x4a4
	bool bWindowFocusable; // 0x4a5
	EWindowVisibility WindowVisibility; // 0x4a6
	bool bApplyGammaCorrection; // 0x4a7
	ULocalPlayer* OwnerPlayer; // 0x4a8
	FLinearColor BackgroundColor; // 0x4b0
	FLinearColor TintColorAndOpacity; // 0x4c0
	float OpacityFromTexture; // 0x4d0
	EWidgetBlendMode BlendMode; // 0x4d4
	bool bIsTwoSided; // 0x4d5
	bool TickWhenOffscreen; // 0x4d6
	UBodySetup* BodySetup; // 0x4d8
	UMaterialInterface* TranslucentMaterial; // 0x4e0
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4e8
	UMaterialInterface* OpaqueMaterial; // 0x4f0
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x4f8
	UMaterialInterface* MaskedMaterial; // 0x500
	UMaterialInterface* MaskedMaterial_OneSided; // 0x508
	UTextureRenderTarget2D* RenderTarget; // 0x510
	UMaterialInstanceDynamic* MaterialInstance; // 0x518
	bool bAddedToScreen; // 0x520
	bool bEditTimeUsable; // 0x521
	FName SharedLayerName; // 0x524
	int32_t LayerZOrder; // 0x52c
	EWidgetGeometryMode GeometryMode; // 0x530
	float CylinderArcAngle; // 0x534
	ETickMode TickMode; // 0x538
	UUserWidget* Widget; // 0x560
};

struct AGameModeBase {
	FString OptionsString; // 0x220
	AGameSession* GameSessionClass; // 0x230
	AGameStateBase* GameStateClass; // 0x238
	APlayerController* PlayerControllerClass; // 0x240
	APlayerState* PlayerStateClass; // 0x248
	AHUD* HUDClass; // 0x250
	APawn* DefaultPawnClass; // 0x258
	ASpectatorPawn* SpectatorClass; // 0x260
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x268
	AServerStatReplicator* ServerStatReplicatorClass; // 0x270
	AGameSession* GameSession; // 0x278
	AGameStateBase* GameState; // 0x280
	AServerStatReplicator* ServerStatReplicator; // 0x288
	FText DefaultPlayerName; // 0x290
	char bUseSeamlessTravel : 1; // 0x2a8
	char bStartPlayersAsSpectators : 1; // 0x2a8
	char bPauseable : 1; // 0x2a8
};

struct AOnlineBeaconHost {
	int32_t ListenPort; // 0x250
	TArray<AOnlineBeaconClient*> ClientActors; // 0x258
};

struct UPaperGroupedSpriteComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x468
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x478
};

struct UTcpMessagingSettings {
	bool EnableTransport; // 0x28
	FString ListenEndpoint; // 0x30
	TArray<FString> ConnectToEndpoints; // 0x40
	int32_t ConnectionRetryDelay; // 0x50
	bool bStopServiceWhenAppDeactivates; // 0x54
};

struct UMaterialExpressionAbs {
	FExpressionInput Input; // 0x40
};

struct UCrowCharacterMainAnimBase {
	FCrowCharacterMontageDepends MontagesDepends; // 0x2f8
	UCrowCharacterAnimInstBase* MontagesOwner; // 0x348
	UAnimMontage* CachedTurnMontage; // 0x350
	ECrowCharacterHandIKType HandIKType; // 0x358
	FTransform LeftHandIKTransform; // 0x360
	ECrowCharacterVehicleAnimType VehicleType; // 0x390
	float ElapsedHandIK; // 0x394
	float AlphaHandIK; // 0x398
};

struct UTemplateSequence {
	UMovieScene* MovieScene; // 0x60
	TSoftClassPtr<UObject> BoundActorClass; // 0x68
	TSoftObjectPtr<AActor> BoundPreviewActor; // 0x90
	TMap<FGuid, FName> BoundActorComponents; // 0xb8
};

struct UWB_HUD_M1Abrams_Crosshair_Machinegun_Third_C {
	UImage* IMG_Crosshair_Gauge; // 0x438
	UImage* IMG_Crosshair_Gauge_Base; // 0x440
	UImage* IMG_Crosshair_Moving; // 0x448
	UImage* IMG_Crosshair_Point_2; // 0x450
	UImage* IMG_Crosshair_Spread; // 0x458
	UImage* IMG_Crosshair_Spread_2; // 0x460
};

struct UParticleModuleKillBox {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct UMaterialExpressionHairAttributes {
	char bUseTangentSpace : 1; // 0x40
};

struct ACrowSpectatorPawnBombMission {
	ACrowPlayerStateBombMission* AttachedPlayerStateBombMission; // 0x2f8
};

struct UCrowMainMedalManager {
	TMap<uint32_t, FCrowMainMedalInfos> MainMedalInfos; // 0x28
	TMap<uint32_t, FCrowMainMedalGroupInfo> MainMedalGroupInfos; // 0x78
	UCrowWidgetBase* ReqMedalGroupRewardWidget; // 0xc8
};

struct UWB_SettingsSlot_C {
	UImage* IMG_BG; // 0x530
	UImage* IMG_Blue00; // 0x538
	UWB_CrossHairPreset_C* WB_CrossHairPreset; // 0x540
};

struct UInGameAdManager {
	char bShouldPauseWhileAdOpen : 1; // 0x38
	TArray<FDelegate> ClickedBannerDelegates; // 0x40
	TArray<FDelegate> ClosedAdDelegates; // 0x50
};

struct UMovieSceneEntitySystem {
	UMovieSceneEntitySystemLinker* Linker; // 0x28
};

struct ACrowDebugSceneLoadActor {
	uint32_t LoadMapIndex; // 0x220
};

struct USubUVAnimation {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UNiagaraDataInterfaceVectorCurve {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
};

struct USoundNodeModulatorContinuous {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UCrowLoadingModeTextWidget {
	UTextBlock* TB_ModeDesc; // 0x260
};

struct UDatasmithAreaLightActorTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct UDisplaceMeshPerlinNoiseProperties {
	TArray<FPerlinLayerProperties> PerlinLayerProperties; // 0x60
};

struct UPawnMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct AArchVisCharacter {
	FString LookUpAxisName; // 0x4b8
	FString LookUpAtRateAxisName; // 0x4c8
	FString TurnAxisName; // 0x4d8
	FString TurnAtRateAxisName; // 0x4e8
	FString MoveForwardAxisName; // 0x4f8
	FString MoveRightAxisName; // 0x508
	float MouseSensitivityScale_Pitch; // 0x518
	float MouseSensitivityScale_Yaw; // 0x51c
};

struct ACrowCharacterBase {
	FCrowCharacterAppearance ReplicatedAppearance; // 0x10f0
	TArray<FCrowClothItemData> DefaultClothesList; // 0x10f8
	TArray<uint32_t> DefaultTattooIndexList; // 0x1108
	uint32_t DefaultResultMVPIndex; // 0x1118
	bool bIsHuman; // 0x111c
	FName PelvisBoneName; // 0x1120
	float ElapsedForceSyncRotation; // 0x1128
	char bIsWeaponFiring : 1; // 0x112c
	float PronedEyeHeight; // 0x1130
	UCrowCharacterMovement* CrowMovement; // 0x1138
	UCrowProneCapsuleComponent* ProneCollisionCapsuleComponent; // 0x1140
	UCrowClothActorComponent* TP_ClothComponent; // 0x1148
	FCrowCharacterAppearance CurrentAppearance; // 0x1150
	uint32_t CurrentTattooFaceIndex; // 0x1158
	uint32_t CurrentTattooArmIndex; // 0x115c
	UPhysicsAsset* CharacterPhysicsAsset; // 0x1160
	UPhysicsAsset* RagdollPhysicsAsset; // 0x1168
	UCrowLibraryMergeSKCTask* MergeMeshTask; // 0x1170
	USkeletalMesh* OptimizationWeaponMesh; // 0x1180
	USkeletalMesh* OptimizationCharacterMesh; // 0x1188
	USkeletalMesh* BackupNoOptimizationCharacterMesh; // 0x1190
	UMaterialInterface* BackupNoOptimizationCharacterMaterial; // 0x1198
	int32_t CacheMergedMeshIndex; // 0x11a0
	UObject* BackupAnimClass; // 0x11a8
};

struct UPrimaryAssetLabel {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct UCrowWeaponExpTableManager {
	TMap<int32_t, FCrowWeaponExpTableRow> WeaponExpData; // 0x28
};

struct UGameplayTagsDeveloperSettings {
	FString DeveloperConfigName; // 0x38
	FName FavoriteTagSource; // 0x48
};

struct UUdpMessagingSettings {
	bool EnabledByDefault; // 0x28
	bool EnableTransport; // 0x29
	bool bAutoRepair; // 0x2a
	bool bStopServiceWhenAppDeactivates; // 0x2b
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	EUdpMessageFormat MessageFormat; // 0x50
	char MulticastTimeToLive; // 0x51
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UNiagaraDataInterfaceRenderTarget2DArray {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x108
};

struct USoundMix {
	char bApplyEQ : 1; // 0x28
	float EQPriority; // 0x2c
	FAudioEQEffect EQSettings; // 0x30
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x70
	float InitialDelay; // 0x80
	float FadeInTime; // 0x84
	float Duration; // 0x88
	float FadeOutTime; // 0x8c
};

struct UCrowConquestHeavyBomberIcon {
	ACrowConquestHeavyBomberActor* HeavyBomberActor; // 0x3d8
};

struct UMaterialExpressionRayTracingQualitySwitch {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UParticleModuleVelocityInheritParent {
	FRawDistributionVector Scale; // 0x38
};

struct UMaterialExpressionReflectionVectorWS {
	FExpressionInput CustomWorldNormal; // 0x40
	char bNormalizeCustomWorldNormal : 1; // 0x54
};

struct UInterpTrackMoveAxis {
	EInterpMoveAxis MoveAxis; // 0x90
	FInterpLookupTrack LookupTrack; // 0x98
};

struct UVRNotificationsComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb0
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc0
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd0
	FMulticastInlineDelegate HMDLostDelegate; // 0xe0
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf0
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x100
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x110
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x120
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x130
};

struct UCollisionGeometryVisualizationProperties {
	float LineThickness; // 0x60
	bool bShowHidden; // 0x64
	FColor Color; // 0x68
};

struct UNiagaraDataInterfacePhysicsAsset {
	UPhysicsAsset* DefaultSource; // 0x38
	AActor* SourceActor; // 0x40
};

struct UMaterialExpressionAppendVector {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UProceduralFoliageTile {
	UProceduralFoliageSpawner* FoliageSpawner; // 0x28
	TArray<FProceduralFoliageInstance> InstancesArray; // 0xd0
};

struct UBaseMediaSource {
	FName PlayerName; // 0x80
};

struct ATriggerBase {
	UShapeComponent* CollisionComponent; // 0x220
};

struct AWaterBodyOcean {
	UOceanGenerator* OceanGenerator; // 0xdd0
	FVector CollisionExtents; // 0xdd8
	float HeightOffset; // 0xde4
};

struct UDataTable {
	UScriptStruct* RowStruct; // 0x28
	char bStripFromClientBuilds : 1; // 0x80
	char bIgnoreExtraFields : 1; // 0x80
	char bIgnoreMissingFields : 1; // 0x80
	FString ImportKeyField; // 0x88
};

struct UCameraModifier_CameraShake {
	TArray<FActiveCameraShakeInfo> ActiveShakes; // 0x48
	TMap<UCameraShakeBase*, FPooledCameraShakes> ExpiredPooledShakesMap; // 0x58
	float SplitScreenShakeScale; // 0xa8
};

struct UReplicationGraphNode_TearOff_ForConnection {
	TArray<FTearOffActorInfo> TearOffActors; // 0x50
};

struct UWidgetSwitcherSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UAkLuminInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UAkWwiseTree {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct UVehicleWheel {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UCrowProjectileISMC {
	UStaticMesh* StaticMeshAsset; // 0x578
	TArray<UMaterialInstance*> MaterialAssetOverrides; // 0x580
	TMap<uint32_t, int32_t> UIDtoIndexArray; // 0x590
	TArray<int32_t> IdleIndexArray; // 0x5e0
	TArray<USceneComponent*> ComponentArray; // 0x5f0
};

struct UCrowRespawnMapWidget {
	ACameraActor* RespawnCamera; // 0x368
	UCrowRespawnButton* RespawnButtonClass; // 0x370
	UCrowRespawnButton* RespawnButtonSmallClass; // 0x378
	bool SelectedSkydivingPoint; // 0x380
	UCrowWorldMap* WB_Map; // 0x388
	UCrowProgressBarWidget* WB_RespawnProgressBar; // 0x390
	UCrowRespawnSelectInfoWidget* WB_RespawnSelectInfo; // 0x398
	UTextBlock* TB_MessageTitle; // 0x3a0
	UTextBlock* TB_Message; // 0x3a8
	UCanvasPanel* CP_SelectPoint; // 0x3b0
	UCanvasPanel* CP_OutAreaAlram; // 0x3b8
	UCanvasPanel* CP_RespawnPoint; // 0x3c0
	UCrowButton* BT_FastRespawn; // 0x3c8
	UTextBlock* TB_FastRespawnPrice; // 0x3d0
	UTextBlock* TB_FastRespawnPriceDisable; // 0x3d8
	UTextBlock* TB_HaveBattleMoney; // 0x3e0
	UWidgetSwitcher* WS_FastRespawnButton; // 0x3e8
	UProgressBar* PB_FastRespawn; // 0x3f0
	UBorder* BD_FastRespawnDisable; // 0x3f8
	UImage* IMG_ImPossibleRespawnArea; // 0x400
	UTextBlock* TB_AlarmMessage; // 0x408
	UCrowInGameLoadoutPopupWidget* WB_Popup_Loadout_Ingame; // 0x410
	UCrowButton* BT_Loadout; // 0x418
	UCanvasPanel* CP_DiveRespawnAlarm; // 0x420
	UCanvasPanel* CP_SquadMatch; // 0x428
	UCanvasPanel* CP_Conquest; // 0x430
	UCanvasPanel* CP_FastRespawnRoot; // 0x438
	float RespawnDelaySeconds; // 0x440
	UWidgetAnimation* AnimShow; // 0x448
	UWidgetAnimation* AnimUnselectable; // 0x450
	UWidgetAnimation* AnimSelectPointActive; // 0x458
	UWidgetAnimation* AnimSelectFastActive; // 0x460
	UWidgetAnimation* AnimRespawnAlram; // 0x468
	FName AnimShowName; // 0x470
	FName AnimUnselectableName; // 0x478
	FName AnimSelectPointActiveName; // 0x480
	FName AnimSelectFastActiveName; // 0x488
	FName AnimRespawnAlramName; // 0x490
	float FastRespawnButtonNeedPressSecond; // 0x498
	float FastRespawnPressedSecond; // 0x49c
};

struct UCrowWidgetTrainingGroundResult {
	UCrowCountdownWidget* WB_Objective_CountDown; // 0x368
	UCrowButton* BT_ReturnLobby; // 0x370
};

struct UNiagaraMeshRendererProperties {
	UStaticMesh* ParticleMesh; // 0x80
	ENiagaraSortMode SortMode; // 0x88
	char bOverrideMaterials : 1; // 0x8c
	char bSortOnlyWhenTranslucent : 1; // 0x8c
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0x90
	FVector2D SubImageSize; // 0xa0
	char bSubImageBlend : 1; // 0xa8
	ENiagaraMeshFacingMode FacingMode; // 0xac
	char bLockedAxisEnable : 1; // 0xb0
	FVector LockedAxis; // 0xb4
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0xc0
	FVector PivotOffset; // 0xc4
	ENiagaraMeshPivotOffsetSpace PivotOffsetSpace; // 0xd0
	char bEnableFrustumCulling : 1; // 0xd4
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x248
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x2a0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x2f8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x400
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x458
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x4b0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x508
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x560
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x5b8
};

struct ULuminARSessionConfig {
	FMagicLeapPlanesQuery PlanesQuery; // 0x110
	int32_t MaxPlaneQueryResults; // 0x170
	int32_t MinPlaneArea; // 0x174
	bool bArbitraryOrientationPlaneDetection; // 0x178
	FVector PlaneSearchExtents; // 0x17c
	TArray<EMagicLeapPlaneQueryFlags> PlaneQueryFlags; // 0x188
	bool bDiscardZeroExtentPlanes; // 0x198
	bool bDefaultUseUnreliablePose; // 0x199
};

struct UTextureRenderTarget {
	float TargetGamma; // 0xd8
};

struct ACrowPlayerStateConquest {
	UCrowConquestSkillManager* SkillManager; // 0xb78
	ACrowConquestArea* CurrentConquestArea; // 0xb80
	FCrowConquestResultInfo ConquestResultInfo; // 0xb88
};

struct UBlackboardComponent {
	UBrainComponent* BrainComp; // 0xb0
	UBlackboardData* DefaultBlackboardAsset; // 0xb8
	UBlackboardData* BlackboardAsset; // 0xc0
	TArray<UBlackboardKeyType*> KeyInstances; // 0xe8
};

struct UPaperTileMap {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct ACableActor {
	UCableComponent* CableComponent; // 0x220
};

struct UBTTask_MakeNoise {
	float Loudnes; // 0x70
};

struct UDatasmithFBXSceneImportData {
	bool bGenerateLightmapUVs; // 0x28
	FString TexturesDir; // 0x30
	char IntermediateSerialization; // 0x40
	bool bColorizeMaterials; // 0x41
};

struct UCrowLibraryMergeSKCTask {
	UCrowSkeletalMeshMerge* SkeletalMeshMerge; // 0x28
	FSkeletalMeshMergeParams MergeParams; // 0x30
	USkeletalMesh* PoseOverride; // 0x90
	int32_t CacheMergedMeshIndex; // 0x98
	UWorld* World; // 0xa0
	USkeletalMesh* GeneratedSkeletalMesh; // 0xa8
};

struct UTextureRenderTargetVolume {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t SizeZ; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct UCrowWidgetDying {
	UTextBlock* TB_Message; // 0x348
	UCrowHealGauge* WB_HealGauge; // 0x350
	UBackgroundBlur* BG_Blur; // 0x358
	UImage* IMG_Vignette; // 0x360
	float MaxBlurValue; // 0x368
	FName NormalLoopAniName; // 0x36c
	FName StopBleedingAnimName; // 0x374
	FName FastBleedingAnimName; // 0x37c
	FName CallHelpAnimName; // 0x384
	UAkAudioEvent* HelpSoundEvent; // 0x390
	ECrowBleedingType PreBleedingType; // 0x398
};

struct UEnvQuery {
	FName QueryName; // 0x30
	TArray<UEnvQueryOption*> Options; // 0x38
};

struct UTestMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct UCrowWorldEditorCollectActorArray {
	TArray<AActor*> AllActors; // 0x28
};

struct UCrowMissionResultWidget {
	UTextBlock* TXT_MissionResult; // 0x348
	UWidgetAnimation* SuccessAnimation; // 0x350
	UWidgetAnimation* FadeAnimation; // 0x358
};

struct UCrowWorldIconWidgetContamination {
	UImage* IMG_AreaGoal; // 0x3d8
};

struct ULevelSequenceBurnIn {
	FLevelSequencePlayerSnapshot FrameInformation; // 0x260
	ALevelSequenceActor* LevelSequenceActor; // 0x318
};

struct UCrowSoundCrossFadeByDistance {
	float SpeedOfSound; // 0x48
	float DelayMax; // 0x4c
	float TestDistance; // 0x50
};

struct UCrowWorldAssetPointLight {
	UPointLightComponent* PointLightData; // 0x28
};

struct ACrowSoundStateVolume {
	ECrowSoundStateType SoundStateType; // 0x220
	TArray<UStaticMeshComponent*> SoundVolumes; // 0x228
};

struct UMaterialExpressionStep {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct UParticleModuleVectorFieldRotation {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UCrowVehicleDamageHandler {
	ACrowVehiclePawn* Vehicle; // 0xb0
	AActor* DestroyedVehicle; // 0xb8
	UCrowVehicleParam* VehicleParam; // 0xc0
	UCrowBattleStatus* BattleStatus; // 0xc8
	FCrowVehicleDamageSetup DamageSetup; // 0xd0
	FTimerHandle Timer_Burning; // 0x170
	float LastTakeHitTimeTimeout; // 0x178
	FCrowVehicleDamageEffect CurrentDamageEffect; // 0x180
	UDamageType* DamageType; // 0x1c0
	FTimerHandle EnginePowerDropEndTimerHandle; // 0x1c8
	FTimerHandle EnginePowerDropRecoverTimerHandle; // 0x1d0
	float EnginePowerDropRecoverTimeSecond; // 0x1d8
};

struct UWindDirectionalSourceComponent {
	float Strength; // 0x1f8
	float Speed; // 0x1fc
	float MinGustAmount; // 0x200
	float MaxGustAmount; // 0x204
	float Radius; // 0x208
	char bPointWind : 1; // 0x20c
};

struct UCrowGameResultTDMWidget {
	UTextBlock* TXT_Result; // 0x368
	UTextBlock* TXT_TimeResult; // 0x370
	UTextBlock* TXT_BlueScore; // 0x378
	UTextBlock* TXT_RedScore; // 0x380
	UWidgetSwitcher* WS_Status; // 0x388
	UCrowButton* WB_BT_Exit; // 0x390
	UWidgetAnimation* AniResultStart; // 0x398
	UWidgetAnimation* AniBlueTeamWin; // 0x3a0
	UWidgetAnimation* AniRedTeamWin; // 0x3a8
	UWidgetAnimation* AniDraw; // 0x3b0
};

struct ACrowWorldEventBase {
	UBoxComponent* Root; // 0x228
	USceneComponent* IconLocation; // 0x230
	bool Reactivation; // 0x238
	float LeftTimeAfterActivation; // 0x23c
	float TimeLimit; // 0x240
	FText EventActivationTitle; // 0x248
	FText EventActivationDescription; // 0x260
	TArray<FString> EventActivationDescriptionList; // 0x278
	FText BeforeObjectiveTitle; // 0x288
	FText BeforeObjective; // 0x2a0
	FText AfterObjectiveTitle; // 0x2b8
	FText AfterObjective; // 0x2d0
	bool DisplaySuccessUI; // 0x2e8
	FText SuccessText; // 0x2f0
	UObject* SuccessIcon; // 0x308
	bool DisplayFailUI; // 0x310
	FText FailText; // 0x318
	UObject* FailIcon; // 0x330
	FWorldEventInfo EventInfo; // 0x338
	TArray<AActor*> EventObjectiveActorArray; // 0x340
	ACrowWorldEventSetting* WorldEventSetting; // 0x350
};

struct USelfUnionMeshesToolProperties {
	bool bAttemptFixHoles; // 0x60
	bool bShowNewBoundaryEdges; // 0x61
	bool bTrimFlaps; // 0x62
	double WindingNumberThreshold; // 0x68
	bool bOnlyUseFirstMeshMaterials; // 0x70
};

struct AMatineeActorCameraAnim {
	UCameraAnim* CameraAnim; // 0x2c8
};

struct ACrowRaymarchActor {
	UMaterialInterface* MaterialInterface; // 0x230
	UMaterialInstanceDynamic* Mid; // 0x238
};

struct UEditableGameplayTagQueryExpression_AllExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UMovieSceneCapture {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct UCrowConqustVehicleDestroyer {
	ACrowVehiclePawn* VehiclePawn; // 0xb0
	ACrowGameStateConquest* GameStateConquest; // 0xb8
};

struct UCSGMeshesTool {
	UCSGMeshesToolProperties* CSGProperties; // 0xf0
	ULineSetComponent* DrawnLineSet; // 0x108
};

struct UOculusMR_Settings {
	EOculusMR_ClippingReference ClippingReference; // 0x28
	bool bUseTrackedCameraResolution; // 0x29
	int32_t WidthPerView; // 0x2c
	int32_t HeightPerView; // 0x30
	float CastingLatency; // 0x34
	FColor BackdropColor; // 0x38
	float HandPoseStateLatency; // 0x3c
	FColor ChromaKeyColor; // 0x40
	float ChromaKeySimilarity; // 0x44
	float ChromaKeySmoothRange; // 0x48
	float ChromaKeySpillRange; // 0x4c
	EOculusMR_PostProcessEffects ExternalCompositionPostProcessEffects; // 0x50
	bool bIsCasting; // 0x51
	EOculusMR_CompositionMethod CompositionMethod; // 0x52
	EOculusMR_CameraDeviceEnum CapturingCamera; // 0x53
};

struct UConstantQNRTSettings {
	float StartingFrequency; // 0x28
	int32_t NumBands; // 0x2c
	float NumBandsPerOctave; // 0x30
	float AnalysisPeriod; // 0x34
	bool bDownmixToMono; // 0x38
	EConstantQFFTSizeEnum FFTSize; // 0x39
	EFFTWindowType WindowType; // 0x3a
	EAudioSpectrumType SpectrumType; // 0x3b
	float BandWidthStretch; // 0x3c
	EConstantQNormalizationEnum CQTNormalization; // 0x40
	float NoiseFloorDb; // 0x44
};

struct UMockDataMeshTrackerComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f8
	bool ScanWorld; // 0x208
	bool RequestNormals; // 0x209
	bool RequestVertexConfidence; // 0x20a
	EMeshTrackerVertexColorMode VertexColorMode; // 0x20b
	TArray<FColor> BlockVertexColors; // 0x210
	FLinearColor VertexColorFromConfidenceZero; // 0x220
	FLinearColor VertexColorFromConfidenceOne; // 0x230
	float UpdateInterval; // 0x240
	UMRMeshComponent* MRMesh; // 0x248
};

struct ACrowItemWeaponParts {
	bool UseDefaultSettings; // 0x308
	ECrowItemType PartsType; // 0x309
	uint32_t PartsIndex; // 0x30c
	FCrowWeaponPartsTableRow ItemTable; // 0x318
};

struct UTextBlockWidgetStyle {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UCrowScoreInfoDeathMatchWidget {
	UCrowScoreInfoDeathMatchListItem* ScoreInfoListItem; // 0x368
	ACrowGameStateBase* CrowGameStateBase; // 0x370
	ACrowPlayerStateBase* LocalPlayerState; // 0x378
	UVerticalBox* VB_RedTeamList; // 0x380
	UImage* IMG_RedTeamIcon; // 0x388
	UTextBlock* TB_RedTeamName; // 0x390
	UTextBlock* TB_RedTeamScore; // 0x398
	UVerticalBox* VB_BlueTeamList; // 0x3a0
	UImage* IMG_BlueTeamIcon; // 0x3a8
	UTextBlock* TB_BlueTeamScore; // 0x3b0
	UTextBlock* TB_BlueTeamName; // 0x3b8
	UCrowObjectiveTimeWidget* TimeWidget; // 0x3c0
	TArray<FCrowScoreListItemData> RedTeamPlayerList; // 0x3c8
	TArray<FCrowScoreListItemData> BlueTeamPlayerList; // 0x3d8
};

struct UShadowMapTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x100
};

struct UBrushRemeshProperties {
	bool bEnableRemeshing; // 0x70
	int32_t TriangleSize; // 0x74
	int32_t PreserveDetail; // 0x78
};

struct UGameplayTask_WaitDelay {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UPaperTileMapComponent {
	int32_t MapWidth; // 0x468
	int32_t MapHeight; // 0x46c
	int32_t TileWidth; // 0x470
	int32_t TileHeight; // 0x474
	UPaperTileSet* DefaultLayerTileSet; // 0x478
	UMaterialInterface* Material; // 0x480
	TArray<UPaperTileLayer*> TileLayers; // 0x488
	FLinearColor TileMapColor; // 0x498
	int32_t UseSingleLayerIndex; // 0x4a8
	bool bUseSingleLayer; // 0x4ac
	UPaperTileMap* TileMap; // 0x4b0
};

struct UBasicReplicationGraph {
	UReplicationGraphNode_GridSpatialization2D* GridNode; // 0x498
	UReplicationGraphNode_ActorList* AlwaysRelevantNode; // 0x4a0
	TArray<FConnectionAlwaysRelevantNodePair> AlwaysRelevantForConnectionList; // 0x4a8
	TArray<AActor*> ActorsWithoutNetConnection; // 0x4b8
};

struct UParticleModuleParameterDynamic_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x48
};

struct UCrowClanNoticeWidget {
	UEditableText* ETB_NoticeInput; // 0x348
	UCrowButton* BT_Confirm; // 0x350
	UCrowButton* BT_Cancel; // 0x358
};

struct UBodySetup {
	FKAggregateGeom AggGeom; // 0x48
	char bAlwaysFullAnimWeight : 1; // 0xa0
	char bConsiderForBounds : 1; // 0xa0
	char bMeshCollideAll : 1; // 0xa0
	char bDoubleSidedGeometry : 1; // 0xa0
	char bGenerateNonMirroredCollision : 1; // 0xa0
	char bSharedCookedData : 1; // 0xa0
	char bGenerateMirroredCollision : 1; // 0xa0
	char bSupportUVsAndFaceRemap : 1; // 0xa0
	UPhysicalMaterial* PhysMaterial; // 0xa8
	FWalkableSlopeOverride WalkableSlopeOverride; // 0xb0
	FBodyInstance DefaultInstance; // 0x128
	FVector BuildScale3D; // 0x288
};

struct APlanarReflection {
	UPlanarReflectionComponent* PlanarReflectionComponent; // 0x230
	bool bShowPreviewPlane; // 0x238
};

struct UCrowHUDWidgetFullScreenBottom {
	UCrowWeaponZoomWidget* WB_ScopeZoomWidget; // 0x348
	UCrowDamageEffectWidget* WB_DamageEffect; // 0x350
	UCrowDamageIndicatorWidget* WB_DamageIndicator; // 0x358
	UCanvasPanel* CP_ZetaHUD; // 0x360
	UCanvasPanel* CP_ZombieHUD; // 0x368
	UCrowZombieHealWidget* WB_ZombieHeal; // 0x370
};

struct USynthComponentMonoWaveTable {
	FMulticastInlineDelegate OnTableAltered; // 0x6c0
	FMulticastInlineDelegate OnNumTablesChanged; // 0x6d0
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x6e0
};

struct UCrowUAVSupportTargetIcon {
	UImage* IMG_Effect; // 0x3d8
};

struct USoundNodeBranch {
	FName BoolParameterName; // 0x48
};

struct UCrowWheeledStateBase {
	UCrowWheeledFSM* WheeledFSM; // 0x48
};

struct UPolyEditSetUVProperties {
	bool bShowMaterial; // 0x60
};

struct UAnimSharingStateInstance {
	UAnimSequence* AnimationToPlay; // 0x2b8
	float PermutationTimeOffset; // 0x2c0
	float PlayRate; // 0x2c4
	bool bStateBool; // 0x2c8
	UAnimSharingInstance* Instance; // 0x2d0
};

struct UInAppPurchaseRestoreCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UCrowVoiceChatTableManager {
	TMap<ECrowVoiceChannel, FCrowVoiceChatChannelTableRow> VoiceChatChannelList; // 0x28
};

struct ACrowSpectatorPawnBase {
	ACrowPlayerStateBase* AttachedPlayerState; // 0x2a8
	ACrowGameHUDBase* GameHUDBase; // 0x2b0
	APawn* LastViewTarget; // 0x2b8
	ACrowSpectatorIconActor* LocalBodyIconActor; // 0x2c0
	ACrowSpectatorIconActor* KillerIconActor; // 0x2c8
	bool bIsFreeView; // 0x2d0
	bool bIsBoardVehicle; // 0x2d1
	int8_t VehicleSeatIndex; // 0x2d2
	bool bIsSkydiving; // 0x2d3
	char CameraMode; // 0x2d4
	bool bIsLockToggleView; // 0x2d5
	FVector2D ViewPitchMinMax; // 0x2d8
	uint64_t WaitAttachedServerKey; // 0x2e0
	bool bIsWaitAttachedPawnToReplicated; // 0x2e8
	float WaitAttachedPawnRate; // 0x2ec
};

struct UParticleModuleKillHeight {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UMaterialFunctionInterface {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UCrowCustomInvitePopupWidget {
	UCrowButton* BT_Close; // 0x348
	UScrollBox* SB_FriendsList; // 0x350
	UCrowFriendSlotWidget* FriendSlotWidgetClass; // 0x358
};

struct UGameMapsSettings {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct UDistributionFloatConstantCurve {
	FInterpCurveFloat ConstantCurve; // 0x38
};

struct UNavRelevantComponent {
	char bAttachToOwnersRoot : 1; // 0xd4
	UObject* CachedNavParent; // 0xd8
};

struct UVirtualTextureBuilder {
	UVirtualTexture2D* Texture; // 0x28
	uint64_t BuildHash; // 0x30
};

struct UMaterialExpressionTangent {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UProceduralCylinderToolProperties {
	float Radius; // 0x70
	float Height; // 0x74
	int32_t RadialSlices; // 0x78
	int32_t HeightSubdivisions; // 0x7c
};

struct UCrowKillFeedIconTableManager {
	TMap<ECrowDamageCauser, UPaperSprite*> KillFeedIconTable; // 0x28
};

struct UBTService_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UCrowKitBomberIconWidget {
	UImage* IMG_Icon; // 0x348
	ACrowKitBomber* BomberActor; // 0x350
};

struct UCrowParachuteStatusWidget {
	UCanvasPanel* CP_Root; // 0x348
	UTextBlock* TB_Count; // 0x350
	URichTextBlock* RTB_BindedKey; // 0x358
	uint32_t PrevCount; // 0x360
};

struct UConnectionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UCrowHUDWidgetDefault {
	UCrowStatusWidget* WB_StatusWidget; // 0x348
	UCrowToastMessageWidget* WB_ToastMessage; // 0x350
	UCrowCompassInfoWIdget* WB_CompassInfo; // 0x358
	UCrowKillFeedWidget* WB_KillfeedWidget; // 0x360
	UCrowProgressBarWidget* WB_InteractionProgress; // 0x368
	UCrowTutorialInfoWidget* WB_TutorialInfo_01; // 0x370
	UCrowTutorialInfoWidget* WB_TutorialInfo; // 0x378
	UCrowTutorialInfoWidget* WB_TutorialInfo_02; // 0x380
	UCrowTutorialInfoWidget* WB_TutorialDoor; // 0x388
	UCrowMedalInfoWidget* WB_MedalInfo; // 0x390
	UCrowMinimapInfoWidget* WB_Minimap; // 0x398
	UCrowHealWidget* WB_HealWidget; // 0x3a0
	UCrowHitMarkerWidget* WB_HitMarker; // 0x3a8
	UCrowPlayerWeaponListWidget* WB_Weapon_List_Player; // 0x3b0
	UCrowToolTipPingWidget* WB_ToolTip_Ping; // 0x3b8
	UCrowInteractionProgressCircleWidget* WB_InteractionProgress_Circle; // 0x3c0
	UCrowZeroingWidget* WB_zeroing; // 0x3c8
	UCrowInGameMissionAlarmWidget* WB_InGameMissionAlarm; // 0x3d0
	UCrowFPSWidget* WB_CrowHUD_FPS; // 0x3d8
	UCrowGuideMessageWidget* WB_Tutorial_Heal_Bottom; // 0x3e0
	UCrowHUDWeaponUnlockWidget* WB_HUD_WeaponUnlock; // 0x3e8
	UCrowGasMaskStatusWidget* WB_StatusGasMask; // 0x3f0
	UCrowParachuteStatusWidget* WB_StatusParachute; // 0x3f8
	UCrowSupplyGainMessage* WB_DeathMatch_Obtain; // 0x400
	UWidgetAnimation* HideAnimation; // 0x408
	UCrowObjectiveWidget* WB_Objective_Mod; // 0x410
	UCrowObjectiveBombMissionWidget* WB_Objective_BombMission; // 0x418
	ACrowCharacterPawn* CrowCharacterPawn; // 0x420
	TMap<AActor*, UCrowIndicatorInfo*> Indicators; // 0x428
	TArray<FCrowWeaponEventInfo> WeaponUIEventInfoQueue; // 0x478
};

struct UNiagaraEffectType {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	UNiagaraSignificanceHandler* SignificanceHandler; // 0x30
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct UInAppPurchaseQueryCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UReplicationGraphNode_AlwaysRelevant_ForConnection {
	TArray<FAlwaysRelevantActorInfo> PastRelevantActors; // 0x110
};

struct UCrowWorldLODSetting {
	FMeshProxySettings ActorLODMeshSetting; // 0x28
	FName MeshLODGroupName; // 0xd0
	TArray<float> MeshLODScreenSizeArray; // 0xd8
};

struct UMovieSceneTrackInstanceSystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UMaterialExpressionShadowReplace {
	FExpressionInput Default; // 0x40
	FExpressionInput Shadow; // 0x54
};

struct UMagicLeapARPinComponent {
	FString ObjectUID; // 0x1f8
	int32_t UserIndex; // 0x208
	EMagicLeapAutoPinType AutoPinType; // 0x20c
	bool bShouldPinActor; // 0x20d
	UMagicLeapARPinSaveGame* PinDataClass; // 0x210
	TSet<EMagicLeapARPinType> SearchPinTypes; // 0x218
	USphereComponent* SearchVolume; // 0x268
	FMulticastInlineDelegate OnPersistentEntityPinned; // 0x270
	FMulticastInlineDelegate OnPersistentEntityPinLost; // 0x280
	FMulticastInlineDelegate OnPinDataLoadAttemptCompleted; // 0x290
	FGuid PinnedCFUID; // 0x2a0
	USceneComponent* PinnedSceneComponent; // 0x2b0
	UMagicLeapARPinSaveGame* PinData; // 0x2b8
};

struct UBTService {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct USourceEffectEQPreset {
	FSourceEffectEQSettings Settings; // 0xa0
};

struct UCrowWorldSplineHavestComponent {
	float HavestDistance; // 0xc0
	TArray<UStaticMesh*> VariationMeshes; // 0xc8
};

struct UMaterialExpressionInverseLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UCrowColorTableManager {
	TMap<FString, FCrowColorTableRow> ColorData; // 0x28
};

struct ULandscapeComponent {
	int32_t SectionBaseX; // 0x440
	int32_t SectionBaseY; // 0x444
	int32_t ComponentSizeQuads; // 0x448
	int32_t SubsectionSizeQuads; // 0x44c
	int32_t NumSubsections; // 0x450
	UMaterialInterface* OverrideMaterial; // 0x458
	UMaterialInterface* OverrideHoleMaterial; // 0x460
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x468
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x478
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x488
	TArray<int8_t> LODIndexToMaterialIndex; // 0x498
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4a8
	UTexture2D* XYOffsetmapTexture; // 0x4b8
	FVector4 WeightmapScaleBias; // 0x4c0
	float WeightmapSubsectionOffset; // 0x4d0
	FVector4 HeightmapScaleBias; // 0x4e0
	FBox CachedLocalBox; // 0x4f0
	LazyObjectProperty CollisionComponent; // 0x50c
	UTexture2D* HeightmapTexture; // 0x528
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x530
	TArray<UTexture2D*> WeightmapTextures; // 0x540
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x550
	FGuid MapBuildDataId; // 0x558
	TArray<FGuid> IrrelevantLights; // 0x568
	int32_t CollisionMipLevel; // 0x578
	int32_t SimpleCollisionMipLevel; // 0x57c
	float NegativeZBoundsExtension; // 0x580
	float PositiveZBoundsExtension; // 0x584
	float StaticLightingResolution; // 0x588
	int32_t ForcedLOD; // 0x58c
	int32_t LODBias; // 0x590
	FGuid StateId; // 0x594
	FGuid BakedTextureMaterialGuid; // 0x5a4
	UTexture2D* GIBakedBaseColorTexture; // 0x5b8
	char MobileBlendableLayerMask; // 0x5c0
	UMaterialInterface* MobileMaterialInterface; // 0x5c8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5d0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5e0
};

struct USlateBrushAsset {
	FSlateBrush Brush; // 0x28
};

struct UGeometryCacheCodecBase {
	TArray<int32_t> TopologyRanges; // 0x28
};

struct UCrowCharacterSubAnimBase {
	bool bIsPeekLeft; // 0x2f8
	bool bIsPeekRight; // 0x2f9
	bool bUseMotionlessOnAim; // 0x2fa
	bool bIsHandlingWeapon; // 0x2fb
};

struct UARComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct ACrowMapZoneMarker {
	FCrowGameIconDisplayInfo MapZoneMarkerIcon; // 0x220
	FText ZoneName; // 0x2a8
};

struct UCrowWorldDestroyer {
	AActor* MeteorRTMask; // 0xb0
	UTextureRenderTarget2D* RenderTargetTexture; // 0xb8
};

struct ACameraRig_Rail {
	float CurrentPositionOnRail; // 0x220
	bool bLockOrientationToRail; // 0x224
	USceneComponent* TransformComponent; // 0x228
	USplineComponent* RailSplineComponent; // 0x230
	USceneComponent* RailCameraMount; // 0x238
};

struct ULandscapeHeightfieldCollisionComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x440
	int32_t SectionBaseX; // 0x450
	int32_t SectionBaseY; // 0x454
	int32_t CollisionSizeQuads; // 0x458
	float CollisionScale; // 0x45c
	int32_t SimpleCollisionSizeQuads; // 0x460
	TArray<char> CollisionQuadFlags; // 0x468
	FGuid HeightfieldGuid; // 0x478
	FBox CachedLocalBox; // 0x488
	LazyObjectProperty RenderComponent; // 0x4a4
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x4d0
};

struct UGeometryCollectionCache {
	FRecordedTransformTrack RecordedData; // 0x28
	UGeometryCollection* SupportedCollection; // 0x38
	FGuid CompatibleCollectionState; // 0x40
};

struct UCrowCharacterSkydivingComponent {
	ECrowSkydivingState State; // 0xb0
	ECrowSkydivingAnimState AnimState; // 0xb1
	ACrowSkydivingPawn* SkydivingPawnClass; // 0xb8
	ACrowSkydivingPawn* ParachuteSkillClass; // 0xc0
	ACrowSkydivingPawn* SkydivingPawn; // 0xc8
	bool bIsReadyToSkydiving; // 0xd0
	char ParachuteSkillCount; // 0xd1
	FTimerHandle AltitudeTimerHandle; // 0xd8
	float ParachuteSpreadHeight; // 0xe0
	float ParachuteSpreadCheckOffsetX; // 0xe4
	float ParachuteSpreadCheckOffsetZ; // 0xe8
	float ParachuteSpreadCheckDist; // 0xec
	FVector ParachuteSpreadCheckBoxHalfSize; // 0xf0
	FName ParachuteSkillKeyName; // 0xfc
	bool bReadyToUseParachuteSkill; // 0x104
	bool bUseDebugAltitude; // 0x105
	ACrowCharacterPawn* CharacterPawn; // 0x108
};

struct UCrowCharacterSubAnimOnGround {
	FCrowCharacterAimOffsetDepends AimOffsetDepends; // 0x300
	FCrowCharacterMontageDepends MontagesDepends; // 0x350
	float LerpedGaitValue; // 0x3a0
	float SprintBlendSpeed; // 0x3a4
};

struct UCrowGameModDetailWidget {
	UCrowSelectModButtonWidget* SelectModButtonWidgetClass; // 0x348
	UCrowMapSelectButtonWidget* MapSelectButtonWidgetClass; // 0x350
	UCanvasPanel* CP_Gamemod_QuickplaySetting; // 0x358
	UVerticalBox* VB_QuickModList; // 0x360
	UScrollBox* SCB_QuickMapList; // 0x368
	UTextBlock* TB_QuickMODName; // 0x370
	UTextBlock* TB_QuickMapName; // 0x378
	UTextBlock* TB_QuickMapDescription; // 0x380
	UCrowButton* BT_QuickDefault; // 0x388
	UCrowButton* BT_QuickApply; // 0x390
	UCanvasPanel* CP_Gamemod_Setting; // 0x398
	UImage* IMG_GameMod; // 0x3a0
	UTextBlock* TB_LeftModName; // 0x3a8
	UTextBlock* TB_LeftModDescription; // 0x3b0
	UScrollBox* SCB_MapList; // 0x3b8
	UTextBlock* TB_MODName; // 0x3c0
	UTextBlock* TB_MapName; // 0x3c8
	UTextBlock* TB_MapDescription; // 0x3d0
	UCrowButton* BT_Apply; // 0x3d8
	UCanvasPanel* CP_Gamemod_Select; // 0x3e0
	UCrowSelectModButtonBigWidget* WB_ModQuickMatch_button; // 0x3e8
	UCrowSelectModButtonBigWidget* WB_ModSquadMatch_button; // 0x3f0
	UCrowSelectModButtonBigWidget* WB_ModConquestMatch_button; // 0x3f8
	UCrowSelectModButtonBigWidget* WB_ModCustomMatch_button; // 0x400
	UCrowSelectModButtonBigWidget* WB_ModTraining_button; // 0x408
	UCrowCustomWaitingRoomWidget* WB_CustomWaitingRoom; // 0x410
	ECrowGameMode SelectedGameMode; // 0x418
	uint32_t SelectedMapIndex; // 0x41c
	ECrowGameMode SelectedQuickGameMode; // 0x420
	TArray<FCrowMatchInfo> SelectedQuickMatchInfos; // 0x428
	TArray<UCrowSelectModButtonBigWidget*> ModButtonBigWidgetArray; // 0x438
};

struct USmoothMeshTool {
	USmoothMeshToolProperties* SmoothProperties; // 0x400
	UIterativeSmoothProperties* IterativeProperties; // 0x408
	UDiffusionSmoothProperties* DiffusionProperties; // 0x410
	UImplicitSmoothProperties* ImplicitProperties; // 0x418
	USmoothWeightMapSetProperties* WeightMapProperties; // 0x420
};

struct ASceneCapture2D {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x230
};

struct UCrowInvenItemSlot {
	bool IsShowMouseDesc; // 0x348
	ACrowItemBase* ItemData; // 0x350
	FCrowWeaponPartsTableRow WeaponPartsTableRow; // 0x358
	UCrowItemInfoWidget* ItemInfoWidget; // 0x650
	UUserWidget* ItemToolTipWidget; // 0x658
};

struct UCrowMiningPointIcon {
	UTextBlock* TB_Time; // 0x3c8
	float DisplayTimeMinDistance; // 0x3d0
	float DisplayTimeMaxDistance; // 0x3d4
};

struct ULuminRuntimeSettings {
	FString PackageName; // 0x28
	FString ApplicationDisplayName; // 0x38
	ELuminFrameTimingHint FrameTimingHint; // 0x48
	bool bProtectedContent; // 0x49
	bool bManualCallToAppReady; // 0x4a
	bool bUseMobileRendering; // 0x4b
	bool bUseVulkan; // 0x4c
	FFilePath Certificate; // 0x50
	FDirectoryPath IconModelPath; // 0x60
	FDirectoryPath IconPortalPath; // 0x70
	FLocalizedIconInfos LocalizedIconInfos; // 0x80
	int32_t VersionCode; // 0x90
	int32_t MinimumAPILevel; // 0x94
	TArray<ELuminPrivilege> AppPrivileges; // 0x98
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8
	FString SpatializationPlugin; // 0xc8
	FString ReverbPlugin; // 0xd8
	FString OcclusionPlugin; // 0xe8
	int32_t SoundCueCookQualityIndex; // 0xf8
	bool bRemoveDebugInfo; // 0xfc
	FDirectoryPath VulkanValidationLayerLibs; // 0x100
	bool bFrameVignette; // 0x110
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118
};

struct ACrowConquestHeavyBomberActor {
	float StartDelayMin; // 0x220
	float StartDelayMax; // 0x224
	float AttackRadius; // 0x228
	char AttackCount; // 0x22c
	FWeaponDamageSettings Damage; // 0x230
	UDamageType* DamegeType; // 0x258
	float AttackDelayMin; // 0x260
	float AttackDelayMax; // 0x264
	UParticleSystem* ExplosionEffect; // 0x268
	UAkAudioEvent* FlyBySound; // 0x270
	UAkAudioEvent* ExplosionSound; // 0x278
	UAkAudioEvent* WarningFriendlySound; // 0x280
	UAkAudioEvent* WarningEnemySound; // 0x288
	UAkAudioEvent* AttackStartSound; // 0x290
	UAkAudioEvent* AttackEndSound; // 0x298
	UMatineeCameraShake* CameraShake; // 0x2a0
	float CameraShakeMinDistance; // 0x2a8
	float CameraShakeMaxDistance; // 0x2ac
	FCrowGameIconDisplayInfo IconDisplayInfo; // 0x2b0
	ECrowConquestHeavyBomberState CurrentState; // 0x338
	char OwnerTeamID; // 0x339
	uint64_t OwnerServerKey; // 0x340
	ACrowPlayerControllerBase* OwnerController; // 0x348
	TArray<FCrowHeavyBomberInfo> FireInfoArray; // 0x350
	TArray<FCrowHeavyBomberInfo> FlyByInfoArray; // 0x360
};

struct UCrowHealWidget {
	UCrowHealGauge* WB_HealGauge; // 0x348
	UCanvasPanel* CP_Message; // 0x350
	UImage* IMG_Box1; // 0x358
	UImage* IMG_Box2; // 0x360
	UTextBlock* TB_Message; // 0x368
};

struct UButton {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
};

struct UScrollBar {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct UCrowCustomizeEmotionDescWidget {
	UCrowTabOutfitWidget* WB_Customize_TopMenu; // 0x348
	UHorizontalBox* HB_CustomizeEmotion_Shop_Button; // 0x350
	UCrowButton* BT_AddShoppingBag; // 0x358
	UCrowButton* BT_Buy; // 0x360
	UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x368
	ECrowCustomizeEmotionDescState State; // 0x370
	UCrowWidgetToggleButton* CategoryEmotionWidget; // 0x378
	UCrowWidgetToggleButton* CategoryResultMVPWidget; // 0x380
	UCrowCustomizeEmotionListWidget* EmotionListWidget; // 0x388
	UCrowCustomizeEmotionRadialWidget* EmotionRadialWidget; // 0x390
	UCrowCustomizeEmotionListWidget* ResultMVPListWidget; // 0x398
	UCrowCustomizeEmotionSlotWidget* SelectedSlotWidget; // 0x3a0
	ACrowSceneLobby* SceneLobby; // 0x3a8
	ACrowLobbyCharacterPawn* LobbyCharacterPawn; // 0x3b0
	TArray<ASkeletalMeshActor*> SkeletalMeshActors; // 0x3b8
	FTimerHandle EndPlayMontageTimerHandle; // 0x3c8
	FCrowCustomizeEmotionListInfo EmotionListInfo; // 0x3d8
	FCrowCustomizeEmotionListInfo ResultMVPListInfo; // 0x400
	UAnimMontage* CurrentAnimMontage; // 0x428
	bool IsOwnList; // 0x430
};

struct UClothLODDataCommon_Legacy {
	UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData; // 0x28
	FClothPhysicalMeshData ClothPhysicalMeshData; // 0x30
	FClothCollisionData CollisionData; // 0x128
};

struct ANavigationObjectBase {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UBillboardComponent* GoodSprite; // 0x230
	UBillboardComponent* BadSprite; // 0x238
	char bIsPIEPlayerStart : 1; // 0x240
};

struct UEnvQueryTest {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct USoundNodeDistanceCrossFade {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct ACrowEscapePointActor {
	UBoxComponent* BoxComponent; // 0x220
	USceneComponent* IconLocation; // 0x228
	UStaticMeshComponent* SmokeMesh; // 0x230
	USceneComponent* SmokeEffectLocation; // 0x238
	UParticleSystem* SmokeEffect; // 0x240
	UParticleSystem* DustEffect; // 0x248
	UAkAudioEvent* SmokeSoundLoop; // 0x250
	UAkAudioEvent* SmokeSoundEnd; // 0x258
	bool bEmergency; // 0x260
	ACrowEscapeHeliPawn* EscapeVehicleClass; // 0x268
	float SpawnVehicleTime; // 0x270
	float VehicleWaitTime; // 0x274
	float MoveVehicleTime; // 0x278
	FCrowGameIconDisplayInfo IconCalled; // 0x280
	FCrowGameIconDisplayInfo IconComplete; // 0x308
	ECrowEscapePointState CurrentState; // 0x390
	uint16_t PointID; // 0x392
	ACrowEscapeHeliPawn* EscapeHeliPawn; // 0x398
	char CallTeam; // 0x3a0
	USplineComponent* SplineBeginComp; // 0x3a8
	USplineComponent* SplineEndComp; // 0x3b0
	UParticleSystemComponent* SmokeEffectComponent; // 0x3b8
	UParticleSystemComponent* DustEffectComponent; // 0x3c0
};

struct UCrowLobbyLoadoutListWidget {
	UCrowButton* BT_NameChange; // 0x380
};

struct UCrowWorldOcclusion {
	char IsGridOcclusionEnabled : 1; // 0x28
	char IsVisibleGridInitialized : 1; // 0x28
	char IsPersistentLevelInitialized : 1; // 0x28
	UWorld* World; // 0x30
	UCrowWorldMapConfig* MapConfig; // 0x38
	APlayerController* PlayerController; // 0x40
	float UpdateDelay; // 0x48
	FVector ControllerLocation; // 0x4c
	TMap<ULevelStreaming*, FCrowWorldLevelStreamData> ActiveStreamingLevels; // 0x58
	FCrowWorldGrid GridOcclusion; // 0xa8
	uint32_t CurrentGridIndex; // 0xc0
	FBox CurrentGridBox; // 0xc4
	TSet<uint32_t> VisibleGridIndexes; // 0xe0
	TArray<ULevelStreaming*> LoadedLevelsCached; // 0x130
};

struct UWrapBox {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	float WrapSize; // 0x12c
	bool bExplicitWrapWidth; // 0x130
	bool bExplicitWrapSize; // 0x131
	EOrientation Orientation; // 0x132
};

struct UPhysicsConstraintComponent {
	AActor* ConstraintActor1; // 0x1f8
	FConstrainComponentPropName ComponentName1; // 0x200
	AActor* ConstraintActor2; // 0x208
	FConstrainComponentPropName ComponentName2; // 0x210
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x228
	FMulticastInlineDelegate OnConstraintBroken; // 0x230
	FConstraintInstance ConstraintInstance; // 0x240
};

struct UCrowPlayerIndicatorOutside {
	UCrowPlayerIndicatorOutSideItem* IndicatorItemClass; // 0x348
	TArray<ACrowCharacterPawn*> ArrayOutsidePlayerPawns; // 0x350
	TArray<UCrowPlayerIndicatorOutSideItem*> ArrayOutSideIndicators; // 0x360
};

struct ACrowItemCurrencyBase {
	FCrowCurrencyTableRow ItemTable; // 0x318
	bool UseDefaultSettings; // 0x4c8
	ECrowItemType CurrencyType; // 0x4c9
	uint32_t ItemIndex; // 0x4cc
	uint32_t ItemCount; // 0x4d0
};

struct UCrowLedgeComponent {
	ECrowLedgeVaultType VaultType; // 0x468
	ECrowLedgeTraceType TraceType; // 0x469
};

struct UCrowLobbySlotNameChangeWidget {
	UTextBlock* TB_CurrentSlotname; // 0x368
	UEditableTextBox* TB_Slotname_Text; // 0x370
	UCrowButton* BT_Ok; // 0x378
	UCrowButton* BT_Cancel; // 0x380
	ECrowLobbySlotType LobbySlotType; // 0x388
	int32_t TargetSlotIndex; // 0x38c
};

struct UCrowRadialMenuButtonWidget {
	UCanvasPanel* CP_Contents; // 0x348
	UCrowButton* Radial_BTN; // 0x350
	UImage* IMG_SelectRadial_BTN; // 0x358
	UImage* IMG_ItemBG; // 0x360
	UImage* IMG_ItemIcon; // 0x368
	UTextBlock* TB_Item_Name; // 0x370
	UTextBlock* TB_Item_Amount; // 0x378
	float IconAngle; // 0x3b0
	float ActivateAngleMin; // 0x3b4
	float ActivateAngleMax; // 0x3b8
	bool HideAmount; // 0x3bc
	int32_t SprayIndex; // 0x3c0
};

struct UCrowRankingScheduleTableManager {
	TMap<uint32_t, FCrowRankingScheduleTableRow> RankingScheduleTable; // 0x28
};

struct UInterpTrackInstSound {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UParticleModuleMeshRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UClothPhysicalMeshDataBase_Legacy {
	TArray<FVector> Vertices; // 0x28
	TArray<FVector> Normals; // 0x38
	TArray<uint32_t> Indices; // 0x48
	TArray<float> InverseMasses; // 0x58
	TArray<FClothVertBoneData> BoneData; // 0x68
	int32_t NumFixedVerts; // 0x78
	int32_t MaxBoneWeights; // 0x7c
	TArray<uint32_t> SelfCollisionIndices; // 0x80
};

struct UCrowCustomAppearanceListWidget {
	UGridPanel* GD_ItemList; // 0x348
	UBorder* BD_SubTitle_Color; // 0x350
	UGridPanel* GD_ColorItemList; // 0x358
	UScrollBox* SCB_Itemlist; // 0x360
	UImage* IMG_Line; // 0x368
	UTextBlock* TB_Title; // 0x370
	UHorizontalBox* HB_Appearance_SaveBT; // 0x378
	UCrowButton* WB_BT_APPLY; // 0x380
	UCrowButton* WB_BT_RESET; // 0x388
	UCrowCustomizeOutfitSlotWidget* CustomizeOutfitSlotWidgetClass; // 0x390
	UCrowItemSlotMiniWidget* CrowItemSlotMiniWidgetClass; // 0x398
	ACrowSceneLobby* SceneLobby; // 0x3a0
	UCrowCategorySlotBigWidget* CurrentCategorySlotWidget; // 0x3a8
	bool IsOwnList; // 0x3b0
	ECrowTattooType CurrTattooType; // 0x3b1
};

struct UCrowItemSlotWidget {
	UImage* IMG_Selected; // 0x348
	UImage* IMG_Equiped; // 0x350
	UCrowButton* BT_Customize_List_Slot; // 0x358
	UTextBlock* TB_ItemName; // 0x360
	UTextBlock* TB_Status; // 0x368
	UImage* IMG_Armory_Bg; // 0x370
	UCanvasPanel* CP_Lock_Armory; // 0x378
	UCanvasPanel* CP_Cost; // 0x380
	UTextBlock* TB_Label_Money; // 0x388
	UWidgetSwitcher* WS_IconIMG; // 0x390
	UImage* IMG_IconIMG_Weapon; // 0x398
	UImage* IMG_IcomIMG_Parts; // 0x3a0
	UCanvasPanel* CP_Lock; // 0x3a8
	UImage* IMG_Lock; // 0x3b0
	UTextBlock* TB_LockLv; // 0x3b8
	UImage* IMG_New; // 0x3c0
	UHorizontalBox* HB_WeaponInfo; // 0x3c8
	UTextBlock* TB_WeaponLV; // 0x3d0
	UCrowProgressBar* PB_WeaponLV; // 0x3d8
	UTextBlock* TBItemName_Sel; // 0x420
	bool Selected; // 0x428
	bool Equiped; // 0x429
	bool UnEquipBtn; // 0x42a
	bool useDeselect; // 0x42b
	bool Locked; // 0x42c
	int32_t SlotValue; // 0x430
	int32_t IntValue; // 0x434
	FCrowWeaponPartsTableRow CurrentWeaponPartsTable; // 0x438
	FCrowWeaponTableRow CurrentWeaponTable; // 0x730
	FCrowWeaponData CurrentWeaponData; // 0x1950
	FCrowWeaponAccData CurrentWeaponAccData; // 0x1ab8
	ECrowItemSlotWSType CurrentItemSlotWSType; // 0x1b68
};

struct UCrowScoreRankSlotData {
	int32_t Index; // 0x28
};

struct UPawnAction {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct ABandwidthTestActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x220
};

struct UInterpTrackInstAnimControl {
	float LastUpdatePosition; // 0x28
};

struct USignificanceManager {
	FSoftClassPath SignificanceManagerClassName; // 0x108
};

struct ASpectatorBeaconHost {
	USpectatorBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct UMaterialExpressionRotator {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct USubmixEffectReverbPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UCrowWidgetCircleGauge {
	FSlateBrush BackBrush; // 0x378
	FSlateBrush GaugeBrush; // 0x400
	UMaterialInterface* GaugeMaterial; // 0x488
	float Value; // 0x490
	UMaterialInstanceDynamic* DynamicMaterial; // 0x498
	UImage* IMG_Gauge; // 0x4a0
};

struct UCrowSettingsSlotKeyBindingWidget {
	UWidgetSwitcher* WS_KeyBinding_First; // 0x348
	UImage* IMG_SavedKeyBindingIcon_First; // 0x350
	UImage* IMG_ChangeKeyBindingIcon_First; // 0x358
	UCrowButton* BT_KeyBinding_First; // 0x360
	UWidgetSwitcher* WS_KeyBinding_Second; // 0x368
	UCrowButton* BT_KeyBinding_Second; // 0x370
	UImage* IMG_SavedKeyBindingIcon_Second; // 0x378
	UImage* IMG_ChangeKeyBindingIcon_Second; // 0x380
	UImage* IMG_SavedKeyBindingIcon_First_C1; // 0x388
	UImage* IMG_SavedKeyBindingIcon_First_C2; // 0x390
	UImage* IMG_ChangeKeyBindingIcon_First_C1; // 0x398
	UImage* IMG_ChangeKeyBindingIcon_First_C2; // 0x3a0
	UImage* IMG_SavedKeyBindingIcon_Second_C1; // 0x3a8
	UImage* IMG_SavedKeyBindingIcon_Second_C2; // 0x3b0
	UImage* IMG_ChangeKeyBindingIcon_Second_C1; // 0x3b8
	UImage* IMG_ChangeKeyBindingIcon_Second_C2; // 0x3c0
	UImage* IMG_Combination_Mark; // 0x3c8
	TArray<UImage*> SavedKeyBindingIcons; // 0x3d0
	TArray<UImage*> ChangeKeyBindingIcons; // 0x3e0
	TArray<UImage*> CombinationSavedKeyBindingIcons; // 0x3f0
	TArray<UImage*> CombinationChangKeyBindingIcons; // 0x400
	TArray<FActionKeySlot> ActionSlots; // 0x410
	TArray<FAxisKeySlot> AxisSlots; // 0x420
	bool bIsEditingMode; // 0x430
	bool bIsAxisSlot; // 0x431
	UCrowSettingsSlotWidget* OwnerSlot; // 0x438
};

struct UWB_HUD_M1Abrams_Crosshair_Smoke_TP_C {
	UImage* IMG_ZoomIn_2; // 0x460
	UImage* IMG_ZoomIn_4; // 0x468
};

struct UCrowWeaponPartsUnlockTableManager {
	TMap<int32_t, FCrowWeaponPartsUnlockTableRow> UnlockWeaponPartsData; // 0x28
};

struct UWB_HUD_M1Abrams_Crosshair_Tusk_Third_C {
	UBorder* b_Crosshair; // 0x438
	UImage* ImageCenter; // 0x440
	UImage* ImageCenterBorder; // 0x448
	UImage* ImageDown; // 0x450
	UImage* ImageDownBorder; // 0x458
	UImage* ImageLeft; // 0x460
	UImage* ImageLeftBorder; // 0x468
	UImage* ImageRight; // 0x470
	UImage* ImageRightBorder; // 0x478
	UImage* ImageUp; // 0x480
	UImage* ImageUpBorder; // 0x488
	UImage* IMG_Box_CrossHair; // 0x490
};

struct UARTrackableNotifyComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x110
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130
	FMulticastInlineDelegate OnAddTrackedImage; // 0x140
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160
	FMulticastInlineDelegate OnAddTrackedFace; // 0x170
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f0
};

struct UMyPluginObject {
	FMyPluginStruct MyStruct; // 0x28
};

struct UARCandidateImage {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct USourceEffectBitCrusherPreset {
	FSourceEffectBitCrusherSettings Settings; // 0xc0
};

struct UParticleModuleCollisionGPU {
	FRawDistributionFloat Resilience; // 0x30
	FRawDistributionFloat ResilienceScaleOverLife; // 0x60
	float Friction; // 0x90
	float RandomSpread; // 0x94
	float RandomDistribution; // 0x98
	float RadiusScale; // 0x9c
	float RadiusBias; // 0xa0
	EParticleCollisionResponse Response; // 0xa4
	EParticleCollisionMode CollisionMode; // 0xa5
};

struct UCrowDebugLogger {
	TArray<ACrowCharacterPawn*> CharArray; // 0x30
	TArray<ACrowVehiclePawn*> VehicleArray; // 0x40
	TArray<ACrowWeaponBase*> WeaponArray; // 0x50
	TSet<ACrowItemBase*> ItemArray; // 0x60
	TSet<ACrowPickupInventory*> InventoryArray; // 0xb0
};

struct UAnimSequenceLevelSequenceLink {
	FGuid SkelTrackGuid; // 0x28
	FSoftObjectPath PathToLevelSequence; // 0x38
};

struct UCrowBoatsSimEngine {
	int32_t EngineIndex; // 0x1f8
	USkeletalMeshComponent* BodyMesh; // 0x200
	UCrowBoatsConfigEngine* EngineConfig; // 0x208
	UCrowBoatsConfigBody* BodyConfig; // 0x210
	UCrowVehicleOceanTracker* OceanTracker; // 0x218
	FTransform InitialTransform; // 0x220
	FVector SubstepLocation; // 0x250
	FVector SubstepLinearForce; // 0x25c
	FVector SubstepAngularForce; // 0x268
	FCrowVehicleInputValue AccelerationInput; // 0x274
	float TargetAccelerationInput; // 0x27c
	FCrowVehicleInputValue SteeringInput; // 0x280
	float TargetSteeringInput; // 0x288
	float DebugEngineDepthRatio; // 0x28c
};

struct UNoiseField {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct UBTDecorator_CompareBBEntries {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UListViewBase {
	UUserWidget* EntryWidgetClass; // 0x108
	float WheelScrollMultiplier; // 0x110
	bool bEnableScrollAnimation; // 0x114
	bool bEnableFixedLineOffset; // 0x115
	float FixedLineScrollOffset; // 0x118
	FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120
	FMulticastInlineDelegate BP_OnEntryReleased; // 0x130
	FUserWidgetPool EntryWidgetPool; // 0x140
};

struct UEnvQueryTest_Pathfinding {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UBTTask_CrowFindRandomPatrol {
	float PatrolRadius; // 0x98
};

struct UOceanCollisionComponent {
	UBodySetup* CachedBodySetup; // 0x440
};

struct UCrowWebEventManager {
	UCrowHttpDownloader* HttpDownloader; // 0x28
};

struct UMaterialExpressionDivide {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UCrowCustomWaitingRoomWidget {
	UCrowCustomWaitingRoomSlotWidget* CustomWaitingRoomSlotClass; // 0x348
	UCrowCustomUserSlotWidget* CustomUserSlotWidgetClass; // 0x350
	float RoomListRefreshTime; // 0x358
	uint32_t MinUser; // 0x35c
	uint32_t TeamMinUser; // 0x360
	UWidgetSwitcher* WS_CustomMod; // 0x368
	UMultiLineEditableText* EDB_SearchCustomName; // 0x370
	UCrowButton* BT_Refresh; // 0x378
	UCrowSortButtonWidget* WB_Button_Sorting_Room; // 0x380
	UCrowSortButtonWidget* WB_Button_Sorting_Mode; // 0x388
	UCrowSortButtonWidget* WB_Button_Sorting_Map; // 0x390
	UCrowSortButtonWidget* WB_Button_Sorting_UserCount; // 0x398
	UCrowSortButtonWidget* WB_Button_Sorting_State; // 0x3a0
	UVerticalBox* VB_FilterState; // 0x3a8
	UVerticalBox* VB_FilterMode; // 0x3b0
	UVerticalBox* VB_FilterMaxUser; // 0x3b8
	UVerticalBox* VB_FilterRemainSlot; // 0x3c0
	UScrollBox* SB_SessionList; // 0x3c8
	UCrowButton* BT_Join; // 0x3d0
	UCrowButton* BT_Create; // 0x3d8
	UCrowButton* BT_WaitingRoomExit; // 0x3e0
	UCrowToggleButton* BT_Customfilter; // 0x3e8
	UCanvasPanel* CP_FilterPopup; // 0x3f0
	UCrowButton* BT_FilterCancel; // 0x3f8
	UCrowButton* BT_FilterOK; // 0x400
	UWidgetSwitcher* WS_SwitchMod; // 0x408
	UVerticalBox* VB_Ateam; // 0x410
	UVerticalBox* VB_Bteam; // 0x418
	UScrollBox* SB_SquadList; // 0x420
	UVerticalBox* VB_SquadList; // 0x428
	UCanvasPanel* CP_Spctating; // 0x430
	UGridPanel* GP_SpectatingList; // 0x438
	UCanvasPanel* CP_unassigned; // 0x440
	UGridPanel* GP_unassignedList; // 0x448
	UCrowButton* BT_Setting; // 0x450
	UCrowButton* BT_Invite; // 0x458
	UCrowButton* BT_Exit; // 0x460
	UCanvasPanel* CP_CustomListDesc; // 0x468
	UCrowWidgetImage* IMG_Map; // 0x470
	UTextBlock* TB_RoomName; // 0x478
	UTextBlock* TB_ModeName; // 0x480
	UTextBlock* TB_MapName; // 0x488
	UTextBlock* TB_RoomOnwer; // 0x490
	UTextBlock* TB_UserCount; // 0x498
	UTextBlock* TB_PlayTime; // 0x4a0
	UHorizontalBox* HB_WinPoint; // 0x4a8
	UTextBlock* TB_WinPoint; // 0x4b0
	UCrowCustomCreateRoomPopupWidget* WB_Custom_CreateSession_Popup; // 0x4b8
	UCrowCustomInvitePopupWidget* WB_CustomInvitePopup; // 0x4c0
	UCrowCustomPasswordPopupWidget* WB_CustomPasswordPopup; // 0x4c8
	UCrowButton* BT_Play; // 0x4d0
	ECrowCustomMode CurrentCustomMode; // 0x4d8
	FCrowCustomDisplayRoomInfo SelectedRoomInfo; // 0x4e0
	UCrowCustomUserSlotWidget* SelectedCustomUserSlot; // 0x528
	FTimerHandle RoomListTimerHandle; // 0x530
	uint64_t KickUserID; // 0x538
	TArray<UCrowSortButtonWidget*> SortButtonList; // 0x540
	FCrowCustomFilterInfo FilterInfo; // 0x550
	FCrowCustomFilterInfo FilterInfoTemp; // 0x55c
	TMap<char, UCrowCustomSquadSlotWidget*> CustomATeamSquadMap; // 0x568
	TMap<char, UCrowCustomSquadSlotWidget*> CustomBTeamSquadMap; // 0x5b8
	TMap<char, UCrowCustomSquadSlotWidget*> CustomSquadMap; // 0x608
	TMap<char, UCrowCustomUserSlotWidget*> CustomWatcherMap; // 0x658
	TMap<char, UCrowCustomUserSlotWidget*> CustomMisassignMap; // 0x6a8
	TArray<UCrowCustomFilterSlotWidge*> FilterSlotStateArray; // 0x6f8
	TArray<UCrowCustomFilterSlotWidge*> FilterSlotGameModeArray; // 0x708
	TArray<UCrowCustomFilterSlotWidge*> FilterSlotMaxUserArray; // 0x718
	TArray<UCrowCustomFilterSlotWidge*> FilterSlotReaminSlotArray; // 0x728
	FString SearchName; // 0x738
};

struct UCrowRotorFSM {
	FCrowRotorSpinSetup SpinSetup; // 0x170
	UDataTable* GroundFxDataTable; // 0x1a0
	USoundCue* EjectWarningAudioTamplate; // 0x1a8
	UAkAudioEvent* EjectCaution_W; // 0x1b0
	UCrowCameraPivotHeliComponent* CameraPivotTP; // 0x1b8
	float RotorSpinFactor; // 0x1c0
};

struct UWidgetAnimationDelegateBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct UCrowTCCompositionCDefuseHUD {
	UCrowTriggerCommandGaugeBar* TriggerCommandGaugeBar; // 0xc0
	UCrowTriggerControlComponent* TargetTriggerControlComponent; // 0xc8
};

struct UWidgetInteractionComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1f8
	int32_t VirtualUserIndex; // 0x218
	int32_t PointerIndex; // 0x21c
	ECollisionChannel TraceChannel; // 0x220
	float InteractionDistance; // 0x224
	EWidgetInteractionSource InteractionSource; // 0x228
	bool bEnableHitTesting; // 0x229
	bool bShowDebug; // 0x22a
	float DebugSphereLineThickness; // 0x22c
	float DebugLineThickness; // 0x230
	FLinearColor DebugColor; // 0x234
	FHitResult CustomHitResult; // 0x2c0
	FVector2D LocalHitLocation; // 0x34c
	FVector2D LastLocalHitLocation; // 0x354
	UWidgetComponent* HoveredWidgetComponent; // 0x360
	FHitResult LastHitResult; // 0x368
	bool bIsHoveredWidgetInteractable; // 0x3f4
	bool bIsHoveredWidgetFocusable; // 0x3f5
	bool bIsHoveredWidgetHitTestVisible; // 0x3f6
};

struct UDatasmithStaticMeshIFCImportData {
	FString SourceGlobalId; // 0x28
};

struct UPlatformEventsComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct UMaterialExpressionSetMaterialAttributes {
	TArray<FExpressionInput> Inputs; // 0x40
	TArray<FGuid> AttributeSetTypes; // 0x50
};

struct UCrowDeathZoneManager {
	float DeathZoneLifeTime; // 0xb0
	TMap<uint32_t, FCrowDeathZoneOverlapRef> DeathZoneOverlapRefMap; // 0xb8
	UCrowLocalPostProcessComponent* PostProcessComp; // 0x108
	UCrowDeathZoneWidget* DeathZoneWidget; // 0x110
	TArray<ACrowDeathZoneMesh*> DeathZoneArray; // 0x118
};

struct UPlayerInput {
	TArray<FKeyBind> DebugExecBindings; // 0x120
	TArray<FName> InvertedAxis; // 0x160
};

struct UMeshSelectionTool {
	UMeshSelectionToolProperties* SelectionProps; // 0x200
	UMeshSelectionEditActions* SelectionActions; // 0x208
	UMeshSelectionToolActionPropertySet* EditActions; // 0x210
	UMeshSelectionSet* Selection; // 0x218
	TArray<AActor*> SpawnedActors; // 0x220
};

struct UPolyEditOffsetProperties {
	bool bUseFaceNormals; // 0x60
};

struct ASkyLight {
	USkyLightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct UMaterialExpressionReroute {
	FExpressionInput Input; // 0x40
};

struct UNiagaraDataInterfaceExport {
	FNiagaraUserParameterBinding CallbackHandlerParameter; // 0x38
	ENDIExport_GPUAllocationMode GPUAllocationMode; // 0x58
	int32_t GPUAllocationFixedSize; // 0x5c
	float GPUAllocationPerParticleSize; // 0x60
};

struct UIterativeOffsetProperties {
	int32_t Steps; // 0x60
	bool bOffsetBoundaries; // 0x64
	float SmoothingPerStep; // 0x68
	bool bReprojectSmooth; // 0x6c
};

struct UMovieSceneEnumTrack {
	UEnum* Enum; // 0xb0
};

struct ACrowFxRandomActivator {
	UParticleSystem* ParticleFX; // 0x220
	bool StartPlay; // 0x228
	float StartPlayDelayTime; // 0x22c
	float TimeMin; // 0x230
	float TimeMax; // 0x234
	TArray<UAkAudioEvent*> LobbyAudioEvents; // 0x238
	TArray<UAkAudioEvent*> LobbyAudioStopEvents; // 0x248
	AActor* AudioTarget; // 0x258
	USphereComponent* SphereComponent; // 0x270
	UParticleSystemComponent* FxParticlesComp; // 0x278
};

struct UCrowPlayerIndicatorOutSideItem {
	USizeBox* SB_Indicator; // 0x348
	ACrowCharacterPawn* TargetPawn; // 0x350
};

struct UEnvQueryGenerator_Cone {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x80
	FAIDataProviderFloatValue ConeDegrees; // 0xb8
	FAIDataProviderFloatValue AngleStep; // 0xf0
	FAIDataProviderFloatValue Range; // 0x128
	UEnvQueryContext* CenterActor; // 0x160
	char bIncludeContextLocation : 1; // 0x168
};

struct ACrowSpectatorPawnCustomMode {
	bool bIsVisiblePlayerList; // 0x348
};

struct UCrowWorldMapLocationWidget {
	float GridSize; // 0x348
	TArray<FText> ArrayHorizonText; // 0x350
	TArray<FText> ArrayVerticalText; // 0x360
	UHorizontalBox* GridPanelX; // 0x378
	UVerticalBox* GridPanelY; // 0x380
	TArray<UCrowWorldMapLocationSlot*> HorizontalSlotList; // 0x388
	TArray<UCrowWorldMapLocationSlot*> VerticalSlotList; // 0x398
	UUserWidget* GridSlot; // 0x3a8
	UCanvasPanelSlot* PanelSlotX; // 0x3b0
	UCanvasPanelSlot* PanelSlotY; // 0x3b8
	FVector2D DefaultSlotPosX; // 0x3c0
	FVector2D DefaultSlotPosY; // 0x3c8
};

struct UTestMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct USkinnedMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x470
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x478
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x480
	TArray<FVertexOffsetUsage> VertexOffsetUsage; // 0x490
	UPhysicsAsset* PhysicsAssetOverride; // 0x598
	int32_t ForcedLodModel; // 0x5a0
	int32_t MinLodModel; // 0x5a4
	float StreamingDistanceMultiplier; // 0x5b0
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x5c0
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x5f4
	char bOverrideMinLod : 1; // 0x5f6
	char bUseBoundsFromMasterPoseComponent : 1; // 0x5f6
	char bForceWireframe : 1; // 0x5f6
	char bDisplayBones : 1; // 0x5f6
	char bDisableMorphTarget : 1; // 0x5f6
	char bHideSkin : 1; // 0x5f7
	char bPerBoneMotionBlur : 1; // 0x5f7
	char bComponentUseFixedSkelBounds : 1; // 0x5f7
	char bConsiderAllBodiesForBounds : 1; // 0x5f7
	char bSyncAttachParentLOD : 1; // 0x5f7
	char bCanHighlightSelectedSections : 1; // 0x5f7
	char bRecentlyRendered : 1; // 0x5f7
	char bCastCapsuleDirectShadow : 1; // 0x5f7
	char bCastCapsuleIndirectShadow : 1; // 0x5f8
	char bCPUSkinning : 1; // 0x5f8
	char bEnableUpdateRateOptimizations : 1; // 0x5f8
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x5f8
	char bRenderStatic : 1; // 0x5f8
	char bIgnoreMasterPoseComponentLOD : 1; // 0x5f8
	char bCachedLocalBoundsUpToDate : 1; // 0x5f9
	char bForceMeshObjectUpdate : 1; // 0x5f9
	float CapsuleIndirectShadowMinVisibility; // 0x5fc
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x610
	FMatrix CachedWorldToLocalTransform; // 0x630
};

struct UMaterialExpressionMaterialProxyReplace {
	FExpressionInput Realtime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct AMagicLeapARPinInfoActorBase {
	FGuid PinId; // 0x220
	bool bVisibilityOverride; // 0x230
};

struct ACrowRespawnPickupInventory {
	UParticleSystemComponent* EffectActive; // 0x2b8
	UAnimationAsset* AniClose; // 0x2c0
	UAnimationAsset* AniAjar; // 0x2c8
	UAnimationAsset* AniOpen; // 0x2d0
	UAnimationAsset* AniCloseToAjar; // 0x2d8
	UAnimationAsset* AniAjarToClose; // 0x2e0
	UAnimationAsset* AniAjarToOpen; // 0x2e8
	UAnimationAsset* AniOpenToClose; // 0x2f0
	UAkAudioEvent* SoundLoop; // 0x2f8
	UAkAudioEvent* SoundLoopEnd; // 0x300
};

struct UBTNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct ABP_CrowPickupInventory_C {
	USkeletalMeshComponent* CorpseBag1; // 0x2b8
};

struct USubsurfaceProfile {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UWB_A10Bombard_Worldmap_C {
	UWidgetAnimation* Ani_Striking; // 0x358
};

struct UAkSettingsPerUser {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x28
	FFilePath WwiseMacInstallationPath; // 0x38
	bool EnableAutomaticAssetSynchronization; // 0x48
	FString WaapiIPAddress; // 0x50
	uint32_t WaapiPort; // 0x60
	bool bAutoConnectToWAAPI; // 0x64
	bool AutoSyncSelection; // 0x65
	bool SuppressWwiseProjectPathWarnings; // 0x66
	bool SoundDataGenerationSkipLanguage; // 0x67
};

struct UBTTask_MoveTo {
	float AcceptableRadius; // 0x98
	UNavigationQueryFilter* FilterClass; // 0xa0
	float ObservedBlackboardValueTolerance; // 0xa8
	char bObserveBlackboardValue : 1; // 0xac
	char bAllowStrafe : 1; // 0xac
	char bAllowPartialPath : 1; // 0xac
	char bTrackMovingGoal : 1; // 0xac
	char bProjectGoalLocation : 1; // 0xac
	char bReachTestIncludesAgentRadius : 1; // 0xac
	char bReachTestIncludesGoalRadius : 1; // 0xac
	char bStopOnOverlap : 1; // 0xac
	char bStopOnOverlapNeedsUpdate : 1; // 0xad
};

struct UWB_BombMission_CompositionCArea_WorldMapIcon_C {
	UCrowWidgetImage* IMG_bombC4_2; // 0x348
};

struct ABP_C4_Ammo_C {
	USkeletalMeshComponent* SkeletalMesh; // 0x1960
};

struct USetCollisionGeometryToolProperties {
	ECollisionGeometryType GeometryType; // 0x60
	ESetCollisionGeometryInputMode InputMode; // 0x64
	bool bUseWorldSpace; // 0x68
	bool bRemoveContained; // 0x69
	bool bEnableMaxCount; // 0x6a
	int32_t MaxCount; // 0x6c
	float MinThickness; // 0x70
	bool bDetectBoxes; // 0x74
	bool bDetectSpheres; // 0x75
	bool bDetectCapsules; // 0x76
	bool bSimplifyHulls; // 0x77
	int32_t HullTargetFaceCount; // 0x78
	bool bSimplifyPolygons; // 0x7c
	float HullTolerance; // 0x80
	EProjectedHullAxis SweepAxis; // 0x84
	bool bAppendToExisting; // 0x88
	ECollisionGeometryMode SetCollisionType; // 0x8c
};

struct UVariant {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct USynth2DSlider {
	float ValueX; // 0x108
	float ValueY; // 0x10c
	FDelegate ValueXDelegate; // 0x110
	FDelegate ValueYDelegate; // 0x120
	FSynth2DSliderStyle WidgetStyle; // 0x130
	FLinearColor SliderHandleColor; // 0x3e8
	bool IndentHandle; // 0x3f8
	bool Locked; // 0x3f9
	float StepSize; // 0x3fc
	bool IsFocusable; // 0x400
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x408
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x418
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x428
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x438
	FMulticastInlineDelegate OnValueChangedX; // 0x448
	FMulticastInlineDelegate OnValueChangedY; // 0x458
};

struct UMaterialExpressionIf {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct AVolumetricLightmapDensityVolume {
	FInt32Interval AllowedMipLevelRange; // 0x258
};

struct UCrowBuildingHISMCDetailCache {
	TMap<UStaticMesh*, FCrowBuildingHISMCDetail> CachedDetails; // 0x28
};

struct UCrowLoadingManager {
	ULevelStreamingDynamic* WeaponLoadOutLevel; // 0x30
	FCrowSceneTableRow SceneData; // 0x38
};

struct UCrowWeaponSpreadComponent {
	ECrowMovementFlags LastMovementFlags; // 0xb0
	FWeaponSpreadInfo NormalSpreadInfo; // 0xb8
	FCrowLinearCurve NormalLinearCurve; // 0x168
	FWeaponSpreadInfo AimSpreadInfo; // 0x198
	FCrowLinearCurve AimLinearCurve; // 0x248
	ECrowWeaponState WeaponState; // 0x278
	FCrowWeaponPartsOptions PartsOptions; // 0x27c
};

struct UNiagaraDataInterfaceFieldSystem {
	UBlueprint* BlueprintSource; // 0x38
	AActor* SourceActor; // 0x40
	FIntVector FieldDimensions; // 0x48
	FVector MinBounds; // 0x54
	FVector MaxBounds; // 0x60
};

struct UCrowLaserBeamComponent {
	UStaticMeshComponent* LineMesh01; // 0x1f8
	UStaticMeshComponent* LineMesh02; // 0x200
	UMaterialInterface* LaserBeamMaterial; // 0x208
	UMaterialInterface* LaserBeamSmallDecal; // 0x210
	UMaterialInterface* LaserBeamBigDecal; // 0x218
	float LaserBeamMaxDistance; // 0x220
	float LaserBeamWidth; // 0x224
	float BigDecalMaxDistance; // 0x228
	FLinearColor LaserBeamColor; // 0x22c
	float LaserBeamThickness; // 0x23c
	float LaserBeamBright; // 0x240
	bool LaserBeamVisible; // 0x244
	UMaterialInstanceDynamic* MaterialDynamic; // 0x248
	UDecalComponent* SmallDecal; // 0x250
	UDecalComponent* BigDecal; // 0x258
	TArray<AActor*> IgnoreActorArray; // 0x260
};

struct UFieldSystemComponent {
	UFieldSystem* FieldSystem; // 0x440
	TArray<TSoftObjectPtr<AChaosSolverActor>> SupportedSolvers; // 0x458
};

struct UNiagaraDataInterfaceArrayQuat {
	TArray<FQuat> QuatData; // 0x50
};

struct ACrowSupplyEventPlaneActor {
	UBoxComponent* BoxComponent; // 0x220
	UProjectileMovementComponent* MovementComp; // 0x228
	FVector StartLocation; // 0x230
	FVector EndLocation; // 0x23c
	float Speed; // 0x248
	UAkAudioEvent* SoundFlight; // 0x250
};

struct UBlackboardKeyType_Object {
	UObject* BaseClass; // 0x30
};

struct ABP_CrowWeaponPartsLaserSight_HG002_C {
	UParticleSystemComponent* FX_Wp_LaserLight_M001; // 0x260
	UCrowLaserBeamComponent* CrowLaserBeam; // 0x268
	USkeletalMeshComponent* HG_Lasersight_DOWN; // 0x270
};

struct ABP_ClaymoreMine_Ammo_C {
	UCrowLaserBeamComponent* CrowLaserBeam_R; // 0x19e0
	UCrowLaserBeamComponent* CrowLaserBeam_L; // 0x19e8
	USphereComponent* Look; // 0x19f0
	USphereComponent* Enter; // 0x19f8
	UCrowTriggerComponent* CrowTrigger; // 0x1a00
	USkeletalMeshComponent* SkeletalMesh; // 0x1a08
};

struct ACrowItemTableOverviewSKC {
	USkeletalMeshComponent* Mesh; // 0x228
};

struct UPhysicsSpringComponent {
	float SpringStiffness; // 0x1f8
	float SpringDamping; // 0x1fc
	float SpringLengthAtRest; // 0x200
	float SpringRadius; // 0x204
	ECollisionChannel SpringChannel; // 0x208
	bool bIgnoreSelf; // 0x209
	float SpringCompression; // 0x20c
};

struct UCrowProgressBar {
	bool bIsVolatilityEffect; // 0x330
	bool bIsOnlyVisibleWhileProcessing; // 0x331
	bool bUseBackgroundColorWhenReachTheZero; // 0x332
	float IncreasePercentageEffectTimeSeconds; // 0x334
	float DecreasePercentageEffectTimeSeconds; // 0x338
	FLinearColor NormalColor; // 0x33c
	FLinearColor IncreaseVolatilityColor; // 0x34c
	FLinearColor DecreaseVolatilityColor; // 0x35c
	FLinearColor BackgroundColorWhenReachTheZero; // 0x36c
	bool bIsProcess; // 0x37c
	bool bIsIncrease; // 0x37d
	float VolatilityStartPercentage; // 0x380
	float VolatilityTargetPercentage; // 0x384
	float VolatilityStartTimeSeconds; // 0x388
	FLinearColor BackgroundColor; // 0x38c
};

struct UParticleModuleColorScaleOverLife {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct URevolveToolProperties {
	bool bConnectOpenProfileToAxis; // 0xb0
	bool bSnapToWorldGrid; // 0xb1
	FVector DrawPlaneOrigin; // 0xb4
	FRotator DrawPlaneOrientation; // 0xc0
	bool bEnableSnapping; // 0xcc
	bool bAllowedToEditDrawPlane; // 0xcd
};

struct UParticleModuleRequired {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct UCrowPrepareMatchSquadMatchWidget {
	UTextBlock* TB_Player; // 0x348
	UTextBlock* TB_PlayerCount; // 0x350
	ECrowMatchWidgetType WidgetType; // 0x364
};

struct UMaterialExpressionDesaturation {
	FExpressionInput Input; // 0x40
	FExpressionInput Fraction; // 0x54
	FLinearColor LuminanceFactors; // 0x68
};

struct UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x58
};

struct UCrowWheeledFSM {
	float EngineStartTime; // 0x170
	float ShutDownTime; // 0x174
	FCrowWheeledFxSetup FxSetup; // 0x178
};

struct UIpConnection {
	float SocketErrorDisconnectDelay; // 0x1b40
};

struct APlayerStart {
	FName PlayerStartTag; // 0x248
};

struct UMaterialExpressionLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct UCombineMeshesToolProperties {
	bool bIsDuplicateMode; // 0x60
	ECombineTargetType WriteOutputTo; // 0x64
	FString OutputName; // 0x68
	FString OutputAsset; // 0x78
};

struct UAudioCaptureComponent {
	int32_t JitterLatencyFrames; // 0x6c0
};

struct UCrowCharacterSKC {
	float ComponentTransformUpdateDelayMin; // 0xed0
	float ComponentTransformUpdateDelayMax; // 0xed4
	float ComponentTransformUpdateDistanceMin; // 0xed8
	FTransform CachedWorldTransform; // 0xee0
	FTransform RootBoneRelativeTransform; // 0xf10
	float TransformUpdateDelay; // 0xf40
};

struct ACrowPlayerStateBase {
	FString PlayerNickName; // 0x328
	FCrowTeamInfo TeamInfo; // 0x338
	ECrowPlayerState CurrentState; // 0x368
	uint32_t RevivalCount; // 0x36c
	uint32_t EnemyDyingCount; // 0x370
	uint32_t KillCount; // 0x374
	uint32_t DeathCount; // 0x378
	uint32_t ComboKillCount; // 0x37c
	uint32_t Level; // 0x380
	uint64_t UserExp; // 0x388
	uint32_t PreLevel; // 0x390
	uint64_t PreUserExp; // 0x398
	uint32_t SquadScore; // 0x3a0
	ECrowBleedingType BleedingType; // 0x3a4
	float AddedDyingSecond; // 0x3a8
	bool IsReviving; // 0x3ac
	bool bIsFirstRespawnSelected; // 0x3ad
	FCrowSaveGameServerExpInfo SaveGameServerExpInfo; // 0x3b0
	FCrowTakeExpInfo TakeExpInfo; // 0x408
	uint32_t TakeTotalExp; // 0x498
	uint32_t TotalScore; // 0x49c
	uint64_t ServerKey; // 0x4a0
	int8_t VehicleSeatIndex; // 0x4a8
	int32_t BattleMoneyCount; // 0x4ac
	bool bIsDisconnected; // 0x4b0
	ECrowSkydivingState SkydivingState; // 0x4b1
	float CurrentFilterDurability; // 0x4b4
	bool bGasMaskOn; // 0x4b8
	FTimerHandle FilterContaminateTimerHandle; // 0x4c0
	FCharacterHitInfo LastHitInfo; // 0x4c8
	UCrowGameInvenComponent* GameInventory; // 0x5f8
	TArray<FCrowWeaponData> DefaultWeaponArray; // 0x600
	TArray<FCrowItemData> DefaultEquipItemArray; // 0x610
	TArray<FCrowItemData> DefaultInvenItemArray; // 0x620
	UObject* PickupInventoryClass; // 0x630
	ACrowCharacterPawn* LastCharacterPawn; // 0x638
	APawn* LastReplicatedPawn; // 0x640
	UCrowSquadInfo* SquadInfo; // 0x648
	UCrowWidgetDying* DyingWidget; // 0x650
	FCharacterHitInfo DyingLastHitInfo; // 0x658
	UCrowIngameChatHandler* ChatHandler; // 0x788
	UCrowPassengerInventory* PassengerInventory; // 0x790
	FTimerHandle SpectatingWaitTimerHandle; // 0x798
	FTransform LastCharacterPawnTransform; // 0x7a0
	FCrowResultTopPlayerInfo BackupPlayerInfo; // 0x7d0
	UCrowIngameRecordManager* IngameRecordManager; // 0x978
	int32_t SquadNumber; // 0x980
	float FilterContaminationPerSecond; // 0x984
	float MaxFilterDurablility; // 0x988
	uint32_t SupplyTableIndex; // 0x998
	TMap<EVehicleIdentity, int32_t> DestroyVehicleInfoMap; // 0x9a0
	uint32_t KillVehicleWeaponCount; // 0x9f0
	FTimerHandle GodModeTimerHandle; // 0xa28
	ACrowPlayerControllerBase* OwnerPlayerController; // 0xa30
	TArray<ACrowPlayerStateBase*> ArrayKillPlayerState; // 0xa60
	ACrowPlayerStateBase* LastKillMePlayerState; // 0xa70
	AActor* KitBomberTargetActor; // 0xa78
	FVector KitBomberUsePos; // 0xa80
	FVector KitBomberTargetPos; // 0xa8c
	int32_t BombingTableIndex; // 0xa98
	UCrowWorldMapIcon* WorldMapIcon; // 0xaa0
	int32_t RemainSquadRespawnCount; // 0xaa8
	UCrowMissionSystemManager* MissionSystem; // 0xb18
	TMap<ECrowSupplyBoxType, float> SupplyBoxPublicLastUsingTimes; // 0xb20
	UCrowBattleStatus* BattleStatus; // 0xb70
};

struct UCrowTriggerCommandDrawOutline {
	UPrimitiveComponent* TargetPrimitive; // 0xc0
};

struct UMovieSceneLevelVisibilitySection {
	ELevelVisibility Visibility; // 0xf0
	TArray<FName> LevelNames; // 0xf8
};

struct UDatasmithPointLightComponentTemplate {
	ELightUnits IntensityUnits; // 0x30
	float SourceRadius; // 0x34
	float SourceLength; // 0x38
	float AttenuationRadius; // 0x3c
};

struct UCrowCustomFilterSlotWidge {
	UCrowToggleButton* BT_Toggle; // 0x348
	UTextBlock* TB_SlotName; // 0x350
	UTextBlock* TB_SelectedSlotName; // 0x358
	uint32_t SlotValue; // 0x370
	FText LabelName; // 0x378
};

struct UFixedPlaneBrushProperties {
	bool bPropertySetEnabled; // 0x60
	bool bShowGizmo; // 0x61
	bool bSnapToGrid; // 0x62
	FVector position; // 0x64
	FQuat Rotation; // 0x70
};

struct ASphereReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x228
};

struct UCrowHUDBombMissionWidget {
	UImage* IMGLoadout; // 0x348
	UImage* IMGBombPossession; // 0x350
	UTextBlock* TBTeamPosition; // 0x358
	UImage* IMGTeamPositionBG; // 0x360
	UCanvasPanel* CPLoadoutMessage; // 0x368
	UCrowBombMissionResultRoundWidget* ResultRoundWidget; // 0x370
	ACrowPlayerStateBombMission* PlayerStateBombMission; // 0x378
	FLinearColor RedTeamColor; // 0x380
	FLinearColor BlueTeamColor; // 0x390
	UTextBlock* TBStartMessage; // 0x3a0
	UWidgetAnimation* AniStartMessage; // 0x3a8
	UCrowStatusPlayerInfo* WB_StatusPlayerInfo_BoomMission; // 0x3b0
};

struct ALevelSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x230
	ULevelSequencePlayer* SequencePlayer; // 0x248
	FSoftObjectPath LevelSequence; // 0x250
	FLevelSequenceCameraSettings CameraSettings; // 0x268
	ULevelSequenceBurnInOptions* BurnInOptions; // 0x270
	UMovieSceneBindingOverrides* BindingOverrides; // 0x278
	char bAutoPlay : 1; // 0x280
	char bOverrideInstanceData : 1; // 0x280
	char bReplicatePlayback : 1; // 0x280
	UObject* DefaultInstanceData; // 0x288
	ULevelSequenceBurnIn* BurnInInstance; // 0x290
	bool bShowBurnin; // 0x298
};

struct UCrowStatusPlayerInfo {
	bool IsHidePlayerNum; // 0x348
	bool IsHidePlayerName; // 0x349
	float BaseSeriousWoundHPPercentage; // 0x34c
	FLinearColor NormalHPColor; // 0x350
	FLinearColor SeriousWoundHPColor; // 0x360
	UCanvasPanel* CP_PlayerName; // 0x370
	UCanvasPanel* CP_PlayerNum; // 0x378
	UCanvasPanel* CP_Dive; // 0x380
	UTextBlock* TB_NickName; // 0x388
	UTextBlock* TB_SquadNum; // 0x390
	UImage* IMG_SquadBack; // 0x398
	UImage* IMG_SquadLeader; // 0x3a0
	UImage* IMG_RankIcon; // 0x3a8
	UProgressBar* PB_NomalHPBar; // 0x3b0
	UCrowProgressBar* PB_DamagedHPBar; // 0x3b8
	UTextBlock* TB_Health; // 0x3c0
	UWidgetSwitcher* VoiceSwitcher; // 0x3c8
	UHorizontalBox* HB_UnderBar; // 0x3d0
	UCrowVivoxManager* VivoxManager; // 0x3e8
};

struct UNiagaraPreviewAxis_InterpParamLinearColor {
	FLinearColor Min; // 0x38
	FLinearColor Max; // 0x48
};

struct UMaterialExpressionGIReplace {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct UMaterialExpressionComponentMask {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UVoxelProperties {
	int32_t VoxelCount; // 0x60
	bool bAutoSimplify; // 0x64
	bool bRemoveInternalSurfaces; // 0x65
	double SimplifyMaxErrorFactor; // 0x68
	double CubeRootMinComponentVolume; // 0x70
};

struct UBTDecorator_CrowCooldown {
	bool ResetCooldownTimeOnInitialize; // 0x70
};

struct UDisplaceMeshSineWaveProperties {
	float SineWaveFrequency; // 0x60
	float SineWavePhaseShift; // 0x64
	FVector SineWaveDirection; // 0x68
};

struct UNiagaraDataInterfaceHairStrands {
	UGroomAsset* DefaultSource; // 0x38
	AActor* SourceActor; // 0x40
};

struct AAkSpotReflector {
	UAkAuxBus* EarlyReflectionAuxBus; // 0x220
	FString EarlyReflectionAuxBusName; // 0x228
	UAkAcousticTexture* AcousticTexture; // 0x238
	float DistanceScalingFactor; // 0x240
	float Level; // 0x244
};

struct ACLSPlayerCameraManager {
	USkeletalMeshComponent* CameraBehavior; // 0x27b0
	FTransform SmoothedPivotTarget; // 0x27c0
	FVector PivotLocation; // 0x27f0
	FVector TargetCameraLocation; // 0x27fc
	FRotator TargetCameraRotation; // 0x2808
	float SmoothedAddFOV; // 0x2814
	float PeekOffset; // 0x2818
	float PeekToNoneBlendTime; // 0x281c
	float NoneToPeekBlendTime; // 0x2820
	float CameraPeekWeight; // 0x2824
	ECLSPeekState PrePeekState; // 0x2828
	float PeekCameraInterpoationSpeed; // 0x282c
};

struct UCrowStatusSquadMatchWidget {
	UCanvasPanel* CP_Spectating; // 0x348
	UTextBlock* TB_SpectatorCount; // 0x350
	UTextBlock* TB_KillCount; // 0x358
	UTextBlock* TB_PlayerCount; // 0x360
};

struct UCrowKeyGuideWidget {
	FLinearColor BasicCategoryColor; // 0x368
	FLinearColor CombatCategoryColor; // 0x378
	FLinearColor ComunicationCategoryColor; // 0x388
	FLinearColor VehicleCategoryColor; // 0x398
};

struct UCrowObjectiveBombMissionWidget {
	UTexture2D* RedTeamBg; // 0x348
	UTexture2D* BlueTeamBg; // 0x350
	UTextBlock* TBRoundCount; // 0x358
	UTextBlock* TBEnemyTeamRoundCount; // 0x360
	UTextBlock* TBEnemyTeamPlayerCount; // 0x368
	UTextBlock* TBMyTeamRoundCount; // 0x370
	UTextBlock* TBMyTeamPlayerCount; // 0x378
	UImage* IMGEnemyTeamIconAttacker; // 0x380
	UImage* IMGEnemyTeamIconDefencer; // 0x388
	UImage* IMGMyTeamIconAttacker; // 0x390
	UImage* IMGMyTeamIconDefencer; // 0x398
	TArray<UImage*> IMGEnemyTeams; // 0x3a0
	TArray<UImage*> IMGEnemyTeamDeads; // 0x3b0
	TArray<UImage*> IMGMyTeams; // 0x3c0
	TArray<UImage*> IMGMyTeamDeads; // 0x3d0
	UImage* IMGEnemyTeamBg; // 0x3e0
	UImage* IMGMyTeamBG; // 0x3e8
	UImage* IMGBombInstall; // 0x3f0
	UImage* IMGBombInstallBG; // 0x3f8
	UWidgetAnimation* AniBombInstallAlarm; // 0x400
	UCrowObjectiveTimeWidget* TimerWidget; // 0x408
	ACrowGameStateBombMission* GameStateBombMission; // 0x410
	ECrowGameRoundState PrevGameRoundState; // 0x418
	char MAX_PLAYER_COUNT; // 0x419
};

struct UCrowdManager {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct AAudioVolume {
	float Priority; // 0x258
	char bEnabled : 1; // 0x25c
	FReverbSettings Settings; // 0x260
	FInteriorSettings AmbientZoneSettings; // 0x280
	TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings; // 0x2a8
	TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings; // 0x2b8
};

struct UMagicLeapHeadTrackingNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x140
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x150
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x160
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x170
};

struct UBTDecorator_IsAtLocation {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	FAIDistanceType GeometricDistanceType; // 0xd0
	char bUseParametrizedRadius : 1; // 0xd4
	char bUseNavAgentGoalLocation : 1; // 0xd4
	char bPathFindingBasedTest : 1; // 0xd4
};

struct ALevelScriptActor {
	char bInputEnabled : 1; // 0x220
};

struct ULiveLinkVirtualSubject {
	ULiveLinkRole* Role; // 0x30
	TArray<FLiveLinkSubjectName> Subjects; // 0x38
	TArray<ULiveLinkFrameTranslator*> FrameTranslators; // 0x48
};

struct UParticleModuleLocation {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct UCrowCustomizeWeaponAccSlotWidget {
	UImage* IMG_Selected; // 0x348
	UImage* IMG_Equiped; // 0x350
	UImage* IMG_Lock; // 0x358
	UImage* IMG_Icon; // 0x360
	UWidgetSwitcher* WS_Grade; // 0x368
	UCrowButton* BT_WeaponAccSlot; // 0x370
	UTextBlock* TB_Name; // 0x378
	UCanvasPanel* CP_Cost; // 0x380
	UTextBlock* TB_Label_Money; // 0x388
	bool Selected; // 0x3d0
	bool Equiped; // 0x3d1
	bool useDeselect; // 0x3d2
	bool Locked; // 0x3d3
	uint32_t AccIndex; // 0x3d4
	ECrowWeaponAccType AccType; // 0x3d8
	FCrowWeaponStickerInfo StickerInfo; // 0x3dc
	FCrowShopTableRow ShopTableData; // 0x3e8
};

struct UCrowMissionTabWidget {
	UCrowWidgetToggleButton* WB_MisstionTab_Daily; // 0x380
};

struct UCrowGameModeSettingsTableManager {
	TMap<ECrowGameMode, FCrowGameModeSettingsTableRow> TableMap; // 0x28
};

struct UCrowTriggerUIBase {
	ACrowCharacterPawn* CharacterOwner; // 0x28
};

struct UCrowWeaponPartsPrimarySight {
	FCrowWeaponPartsPrimarySightTableRow PartsTable; // 0x320
	FCrowWeaponPartsPrimarySightTableRow DefaultPartsData; // 0xe50
	UObject* AimMesh; // 0x1980
	UObject* AimLensMesh; // 0x1988
	UObject* DefaultMesh; // 0x1990
	UMeshComponent* DefaultMeshComponent; // 0x1998
	UCrowZeroingInfo* ZeroingInfo; // 0x19a0
};

struct ACrowWorldGridActor {
	USceneComponent* GridRoot; // 0x220
	UStaticMeshComponent* SphereMesh; // 0x228
	FCrowWorldGridZ WorldGrid; // 0x230
	FVector WorldOrigin; // 0x248
	int32_t CellSizeBits; // 0x254
	TSet<uint32_t> ResultIndexes; // 0x258
	TMap<int32_t, TWeakObjectPtr<UCrowWorldGridQueryComponent>> RegistedQueryComps; // 0x2a8
};

struct UWB_CrossHair_Landrover_Mount_C {
	UBorder* b_Crosshair; // 0x450
	UImage* ImageCenter; // 0x458
	UImage* ImageCenterBorder; // 0x460
	UImage* ImageDown; // 0x468
	UImage* ImageDownBorder; // 0x470
	UImage* ImageLeft; // 0x478
	UImage* ImageLeftBorder; // 0x480
	UImage* ImageRight; // 0x488
	UImage* ImageRightBorder; // 0x490
	UImage* ImageUp; // 0x498
	UImage* ImageUpBorder; // 0x4a0
};

struct USkeletalMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x690
	UAnimInstance* AnimClass; // 0x698
	UAnimInstance* AnimScriptInstance; // 0x6a0
	UAnimInstance* PostProcessAnimInstance; // 0x6a8
	FSingleAnimationPlayData AnimationData; // 0x6b0
	FVector RootBoneTranslation; // 0x6d8
	FVector LineCheckBoundsScale; // 0x6e4
	TArray<UAnimInstance*> LinkedInstances; // 0x720
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x730
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x740
	float GlobalAnimRateScale; // 0x8a0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8a4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8a5
	EAnimationMode AnimationMode; // 0x8a7
	char bDisablePostProcessBlueprint : 1; // 0x8a9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8a9
	char bHasValidBodies : 1; // 0x8a9
	char bBlendPhysics : 1; // 0x8a9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8a9
	char bUpdateJointsFromAnimation : 1; // 0x8a9
	char bDisableClothSimulation : 1; // 0x8aa
	char bDisableRigidBodyAnimNode : 1; // 0x8b0
	char bAllowAnimCurveEvaluation : 1; // 0x8b0
	char bDisableAnimCurves : 1; // 0x8b0
	char bCollideWithEnvironment : 1; // 0x8b0
	char bCollideWithAttachedChildren : 1; // 0x8b1
	char bLocalSpaceSimulation : 1; // 0x8b1
	char bResetAfterTeleport : 1; // 0x8b1
	char bDeferKinematicBoneUpdate : 1; // 0x8b1
	char bNoSkeletonUpdate : 1; // 0x8b1
	char bPauseAnims : 1; // 0x8b1
	char bUseRefPoseOnInitAnim : 1; // 0x8b1
	char bEnablePerPolyCollision : 1; // 0x8b2
	char bForceRefpose : 1; // 0x8b2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8b2
	char bIsAutonomousTickPose : 1; // 0x8b2
	char bOldForceRefPose : 1; // 0x8b2
	char bShowPrePhysBones : 1; // 0x8b2
	char bRequiredBonesUpToDate : 1; // 0x8b2
	char bAnimTreeInitialised : 1; // 0x8b2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8b3
	char bEnableLineCheckWithBounds : 1; // 0x8b3
	char bUseBendingElements : 1; // 0x8b3
	char bUseTetrahedralConstraints : 1; // 0x8b3
	char bUseThinShellVolumeConstraints : 1; // 0x8b3
	char bUseSelfCollisions : 1; // 0x8b3
	char bUseContinuousCollisionDetection : 1; // 0x8b3
	char bPropagateCurvesToSlaves : 1; // 0x8b3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8b4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8b4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8b4
	uint16_t CachedAnimCurveUidVersion; // 0x8b6
	EClothMassMode MassMode; // 0x8b8
	float UniformMass; // 0x8bc
	float TotalMass; // 0x8c0
	float Density; // 0x8c4
	float MinPerParticleMass; // 0x8c8
	float ClothBlendWeight; // 0x8cc
	float EdgeStiffness; // 0x8d0
	float BendingStiffness; // 0x8d4
	float AreaStiffness; // 0x8d8
	float VolumeStiffness; // 0x8dc
	float StrainLimitingStiffness; // 0x8e0
	float ShapeTargetStiffness; // 0x8e4
	bool bWaitForParallelClothTask; // 0x8e8
	TArray<FName> DisallowedAnimCurves; // 0x8f0
	UBodySetup* BodySetup; // 0x900
	FMulticastInlineDelegate OnConstraintBroken; // 0x910
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x920
	float TeleportDistanceThreshold; // 0x9f8
	float TeleportRotationThreshold; // 0x9fc
	uint32_t LastPoseTickFrame; // 0xa08
	UClothingSimulationInteractor* ClothingInteractor; // 0xa60
	FMulticastInlineDelegate OnAnimInitialized; // 0xb30
};

struct UDatasmithAssetUserData {
	TMap<FName, FString> MetaData; // 0x28
};

struct UMeshSelectionSet {
	TArray<int32_t> Vertices; // 0x40
	TArray<int32_t> Edges; // 0x50
	TArray<int32_t> Faces; // 0x60
	TArray<int32_t> Groups; // 0x70
};

struct UMovieSceneAkTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	char bIsAMasterTrack : 1; // 0x88
};

struct UPaperSprite {
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FVector2D BakedSourceUV; // 0x48
	FVector2D BakedSourceDimension; // 0x50
	UTexture2D* BakedSourceTexture; // 0x58
	UMaterialInterface* DefaultMaterial; // 0x60
	UMaterialInterface* AlternateMaterial; // 0x68
	TArray<FPaperSpriteSocket> Sockets; // 0x70
	ESpriteCollisionMode SpriteCollisionDomain; // 0x80
	float PixelsPerUnrealUnit; // 0x84
	UBodySetup* BodySetup; // 0x88
	int32_t AlternateMaterialSplitIndex; // 0x90
	TArray<FVector4> BakedRenderData; // 0x98
};

struct UCrowDamageIndicatorItemWidget {
	UCanvasPanel* CP_Root; // 0x348
};

struct UCrowDragItem {
	UImage* IMG_ItemIcon; // 0x348
};

struct UCrowWorldRemainSMC {
	int16_t RemainMeshIndex; // 0x4d0
	int16_t LayoutItemIndex; // 0x4d2
};

struct UAkGeometryComponent {
	AkMeshType MeshType; // 0x1f8
	int32_t LOD; // 0x1fc
	float WeldingThreshold; // 0x200
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride; // 0x208
	FAkGeometrySurfaceOverride CollisionMeshSurfaceOverride; // 0x258
	char bEnableDiffraction : 1; // 0x268
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x268
	AActor* AssociatedRoom; // 0x270
	FAkGeometryData GeometryData; // 0x288
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> PreviousStaticMeshSurfaceOverride; // 0x2d8
};

struct UCrowMissionQuickListItem {
	UTextBlock* TB_MissionTitle; // 0x348
	UTextBlock* TB_MissionCount; // 0x350
	UWidgetSwitcher* WS_IMG; // 0x358
	UImage* IMG_Reward00; // 0x360
	UImage* IMG_Reward01; // 0x368
	UImage* IMG_Reward02; // 0x370
	UImage* IMG_Reward03; // 0x378
	UImage* IMG_Reward04; // 0x380
};

struct USequenceCameraShake {
	UCameraAnimationSequence* Sequence; // 0x98
	float PlayRate; // 0xa0
	float Scale; // 0xa4
	float BlendInTime; // 0xa8
	float BlendOutTime; // 0xac
	float RandomSegmentDuration; // 0xb0
	bool bRandomSegment; // 0xb4
	USequenceCameraShakeSequencePlayer* Player; // 0xb8
	USequenceCameraShakeCameraStandIn* CameraStandIn; // 0xc0
};

struct UCrowCloudScapeComponent {
	bool bEnvCloud; // 0x1f8
	bool bNoCollision; // 0x1f9
	bool bMove; // 0x1fa
	bool bScale; // 0x1fb
	float MaxScaleZ; // 0x1fc
	float Density; // 0x200
	float CloudMoveTime; // 0x204
	float RotationRate; // 0x208
	UCurveFloat* ScaleAnimCurve; // 0x210
	UCurveFloat* MoveRateCurve; // 0x218
	UCurveFloat* DensityCurve; // 0x220
	UCurveFloat* HeightCurve; // 0x228
	UCrowCloudDamage* CloudDamageSetting; // 0x230
};

struct UCrowMiningScanEffectWidget {
	UImage* IMG_Scan_effect; // 0x3d8
	UWidgetAnimation* AniMiningScan; // 0x3e0
};

struct UCrowCustomCursorUAV {
	UCanvasPanel* CP_Area; // 0x350
};

struct UCrowLockonIndicator {
	ACrowCharacterPawn* OwnerPawn; // 0x348
	bool IsVehicle; // 0x350
	bool IsInDistance; // 0x351
	UCanvasPanel* CP_Main; // 0x358
	UCanvasPanel* CP_LockOn; // 0x360
	UCanvasPanel* CP_TargetBase; // 0x368
	UCanvasPanel* CP_NonTarget; // 0x370
	UImage* IMG_TargetingBase; // 0x378
	UImage* IMG_TargetingCross; // 0x380
	UImage* IMG_Base; // 0x388
	UImage* IMG_Base_LockOn; // 0x390
	AActor* TargetActor; // 0x398
	UUMGSequencePlayer* TargetingAni; // 0x3a0
	UUMGSequencePlayer* LockOnAni; // 0x3a8
	FGeometry ParentGeometry; // 0x3b0
	FVector2D DefaultSize; // 0x3e8
	UCanvasPanelSlot* PanelSlot; // 0x3f0
	float MinScale; // 0x3f8
	float MaxScale; // 0x3fc
	FLinearColor DefaultColor; // 0x400
};

struct UCrowCustomOutfitItemListWidget {
	UGridPanel* GD_ItemList; // 0x348
	UScrollBox* SCB_Itemlist; // 0x350
	UTextBlock* TB_Title; // 0x358
	UCrowClothItemDescWidget* WB_Function_Tooltip; // 0x360
	UCrowCustomizeOutfitSlotWidget* CustomizeOutfitSlotWidgetClass; // 0x368
	ACrowSceneLobby* SceneLobby; // 0x370
	UCrowCategorySlotSmallWidget* CurrentCategorySlotSmallWidget; // 0x378
	bool IsOwnMode; // 0x380
	UCrowCustomizeOutfitSlotWidget* ShopModeSelectItem; // 0x388
	float ItemSize; // 0x390
};

struct UMaterialExpressionParticleSubUV {
	char bBlend : 1; // 0x60
};

struct UStereoLayerShapeEquirect {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct ACrowConsoleInitializer {
	TArray<FString> ConsoleCommands; // 0x220
};

struct UEnvQueryTest_Distance {
	EEnvTestDistance TestMode; // 0x1f8
	UEnvQueryContext* DistanceTo; // 0x200
};

struct UCrowWeaponSubStateFireGatling {
	ACrowWeaponVehicle* WeaponVehicle; // 0x48
	UCrowWeaponAnimGatling* WeaponAnimGatlingComponent; // 0x50
	float FireDelay; // 0x58
	float PreHeating; // 0x5c
	float CurrentPreHeating; // 0x60
	float OverHeating; // 0x64
	float CurrentOverHeating; // 0x68
	float Cooling; // 0x6c
	float CurrentCooling; // 0x70
	float ApproachOverHeating; // 0x74
	bool bIsApproachOverHeating; // 0x78
	bool bIsCooling; // 0x79
	UCrowVehicleCrosshairBase* crosshairWidget; // 0x80
	float PrevTimeSeconds; // 0x88
	bool bIsFiring; // 0x8c
	bool bPlayFireAnimation; // 0x8d
	UAkComponent* AkComponent; // 0x90
};

struct UHapticFeedbackEffect_Buffer {
	TArray<char> Amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UTimelineTemplate {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	FName VariableName; // 0x90
	FName DirectionPropertyName; // 0x98
	FName UpdateFunctionName; // 0xa0
	FName FinishedFunctionName; // 0xa8
};

struct UCrowRadialMenuWidgetBase {
	UCanvasPanel* CP_RadialMenu; // 0x368
	UImage* IMG_Circle; // 0x370
	UImage* IMG_CircleArrow; // 0x378
	UImage* HoverIcon; // 0x380
	UTextBlock* HoverText; // 0x388
	TArray<FString> ItemTextIndexes; // 0x390
	UWidgetAnimation* AniWidgetShow; // 0x3a0
	bool InitializeRadialMenu; // 0x3a8
	int32_t SelectedIndex; // 0x3ac
	bool Hiding; // 0x3b0
	UCrowWidgetTweenAlpha* WidgetTweenAlpha; // 0x3b8
	TArray<UCrowRadialMenuButtonWidget*> Radial_MenuBTN_Array; // 0x3c0
};

struct ULODSyncComponent {
	int32_t NumLODs; // 0xb0
	int32_t ForcedLOD; // 0xb4
	TArray<FComponentSync> ComponentsToSync; // 0xb8
	TMap<FName, FLODMappingData> CustomLODMapping; // 0xc8
	int32_t CurrentLOD; // 0x118
	int32_t CurrentNumLODs; // 0x11c
	TArray<UPrimitiveComponent*> DriveComponents; // 0x120
	TArray<UPrimitiveComponent*> SubComponents; // 0x130
};

struct UInterpTrackAnimControl {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct UCrowWorldMapIconPS {
	ACrowPlayerStateBase* TargetPlayerState; // 0x1b0
};

struct ABp_CrowProjectileTank_C {
	UStaticMeshComponent* SM_G67; // 0x1840
};

struct UMaterialExpressionTextureCoordinate {
	int32_t CoordinateIndex; // 0x40
	float UTiling; // 0x44
	float VTiling; // 0x48
	char UnMirrorU : 1; // 0x4c
	char UnMirrorV : 1; // 0x4c
};

struct URig {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct UEditUVIslandsTool {
	UExistingMeshMaterialProperties* MaterialSettings; // 0xc8
	UMaterialInstanceDynamic* CheckerMaterial; // 0xd0
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0xd8
	UPolygonSelectionMechanic* SelectionMechanic; // 0xe0
	UMultiTransformer* MultiTransformer; // 0xf0
};

struct UCrowBomBardRouteWidget {
	UCanvasPanel* CP_route; // 0x348
	UBorder* BD_Zone; // 0x350
	UImage* IMG_Effect; // 0x358
};

struct UCrowCustomizeItemDescWidget {
	UCanvasPanel* CP_Lobby_MOD; // 0x348
	UTextBlock* TB_Item_Category; // 0x350
	UTextBlock* TB_AmmoType; // 0x358
	UTextBlock* TB_ItemName; // 0x360
	URichTextBlock* TB_ItemCompare; // 0x368
	UMultiLineEditableText* MLETB_ItemDesc; // 0x370
	UVerticalBox* VB_ItemName; // 0x378
	UHorizontalBox* HB_WeaponParts; // 0x380
	UHorizontalBox* HB_AmmoType; // 0x388
	UCanvasPanel* CP_WeaponStatus; // 0x390
	UCanvasPanel* CP_WeaponStat; // 0x398
	UVerticalBox* VB_WeaponInfo; // 0x3a0
	UVerticalBox* VB_WeaponProgress; // 0x3a8
	UTextBlock* TB_FireMode; // 0x3b0
	UHorizontalBox* HB_FireModeIcon; // 0x3b8
	UCrowWidgetImage* IMG_FireMode_Semiauto; // 0x3c0
	UCrowWidgetImage* IMG_FireMode_Burst; // 0x3c8
	UCrowWidgetImage* IMG_FireMode_auto; // 0x3d0
	UTextBlock* TB_Ammo; // 0x3d8
	UTextBlock* TB_AmmoCount; // 0x3e0
	UTextBlock* TB_Damage; // 0x3e8
	UProgressBar* PB_Damage; // 0x3f0
	UProgressBar* PB_Damage_Compare; // 0x3f8
	UTextBlock* TB_Accuracy; // 0x400
	UProgressBar* PB_Accuracy; // 0x408
	UProgressBar* PB_Accuracy_Compare; // 0x410
	UTextBlock* TB_Control; // 0x418
	UProgressBar* PB_Control; // 0x420
	UProgressBar* PB_Control_Compare; // 0x428
	UTextBlock* TB_FireSpeed; // 0x430
	UProgressBar* PB_FireSpeed; // 0x438
	UProgressBar* PB_FireSpeed_Compare; // 0x440
	UTextBlock* TB_Distance; // 0x448
	UProgressBar* PB_Distance; // 0x450
	UProgressBar* PB_Distance_Compare; // 0x458
	UTextBlock* TB_Reload; // 0x460
	UProgressBar* PB_Reload; // 0x468
	UProgressBar* PB_Reload_Compare; // 0x470
	UCrowButton* WB_BT_MOD; // 0x478
	UCrowButton* WB_BT_ARMORY; // 0x480
	UCrowButton* WB_BT_Back; // 0x488
	UCrowButton* WB_BT_Home; // 0x490
	UCrowButton* WB_BT_RESET; // 0x498
	UCrowButton* WB_BT_LevelJump; // 0x4a0
	UHorizontalBox* HB_Tutorial_Customize; // 0x4a8
	UCrowLobbyLoadoutListWidget* WB_Lobby_LoadoutList; // 0x4b0
	UCrowLobbyLoadoutWidget* WB_Lobby_Loadout; // 0x4b8
	UCrowWeaponPartsListWidget* WB_WeaponPartsList; // 0x4c0
	UCanvasPanel* CP_PartAdditionalEffect; // 0x4c8
	UVerticalBox* VB_Advantage; // 0x4d0
	UCrowTabMenuWeaponCategoryWidget* WB_TabMenuWeaponCategory; // 0x4d8
	UCrowTabMenuWeaponSettingWidget* WB_TabMenu_WeaponSetting; // 0x4e0
	UCrowCustomizeCategryBigWidget* WB_TabMenuWeaponPartsCategory; // 0x4e8
	UCrowCustomizeItemListWidget* WB_CustomizeItemlist; // 0x4f0
	UCrowCustomizeWeaponAccWidget* WB_Customize_WeaponAcc; // 0x4f8
	UCrowCustomizeWeaponNumSlotList* WB_Customize_WeaponAccNumberSlot; // 0x500
	UCrowLobbyShopMenuTabWidget* WB_TabMenu_WeaponCategory; // 0x508
	UHorizontalBox* HB_CustomizeWeapon_Shop_Button; // 0x510
	UCrowShoppingBagWidget* WB_Shop_Popup_ExclusivePurchase_Quick; // 0x518
	UCrowButton* BT_AddShoppingBag; // 0x520
	UCrowButton* BT_Buy; // 0x528
	UCrowWeaponLevelJumpPopupWidget* WB_WeaponLevelJumpPopup; // 0x530
	UCrowLobbySlotPurchasePopupWidget* WB_LobbySlotPurchasePopup; // 0x538
	FLinearColor NormalColor; // 0x540
	FLinearColor IncreaseColor; // 0x550
	FLinearColor DecreaseColor; // 0x560
	FCrowWeaponData CurrentWeaponData; // 0x570
	FCrowWeaponTableRow WeaponItemTable; // 0x6e0
	ACrowSceneLobby* SceneLobby; // 0x1900
	ACrowSceneGame* SceneGame; // 0x1908
	UCrowInventoryInputEventHandler* SelectDragWidget; // 0x1910
	float ProgressMaxValue; // 0x1918
	bool StatusMoved; // 0x191c
	bool IsCustomizeSticker; // 0x191d
	TArray<UTextBlock*> PartsOptionArray; // 0x1920
	bool IsWeaponCustomizeMode; // 0x1930
	UCrowCustomizeWeaponAccSlotWidget* CurrentWeaponAccSlotWidget; // 0x1938
};

struct UMaterialExpressionTextureProperty {
	FExpressionInput TextureObject; // 0x40
	EMaterialExposedTextureProperty Property; // 0x54
};

struct UMovieSceneCameraShakeSourceShakeTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x80
};

struct UCrowSimpleBuoyancyComponent {
	UPrimitiveComponent* TargetComponent; // 0xc0
	UPhysicalMaterial* WaterMaterial; // 0xc8
	float MinWaveMoveValue; // 0xd0
	float WaveMoveDecreaseRate; // 0xd4
};

struct UAIDataProvider_Random {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UCrowActorComponentBreakableMesh {
	UStaticMeshComponent* SM_Default; // 0x1f8
	UStaticMeshComponent* SM_Broken; // 0x200
	UStaticMeshComponent* SM_CustomDepth; // 0x208
};

struct UAlignObjectsTool {
	UAlignObjectsToolProperties* AlignProps; // 0x98
};

struct ACrowCollisionPreviewActor {
	USceneComponent* SceneComponent; // 0x220
	UBoxComponent* BoxComponent; // 0x228
	FText BuildText; // 0x230
	FText CancelText; // 0x248
	ACrowPlayerControllerBase* PlayerController; // 0x260
	ACrowPlayerStateBase* PlayerState; // 0x268
	ACrowCharacterPawn* CharacterPawn; // 0x270
	TArray<UMeshComponent*> MeshCompArray; // 0x278
};

struct AController {
	APlayerState* PlayerState; // 0x228
	FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x238
	FName StateName; // 0x248
	APawn* Pawn; // 0x250
	ACharacter* Character; // 0x260
	USceneComponent* TransformComponent; // 0x268
	FRotator ControlRotation; // 0x288
	char bAttachToPawn : 1; // 0x294
};

struct UTextPropertyTestObject {
	FText DefaultedText; // 0x28
	FText UndefaultedText; // 0x40
	FText TransientText; // 0x58
};

struct UCrowTriggerCommandNearFar {
	UStaticMeshComponent* Near; // 0xc0
	UStaticMeshComponent* Far; // 0xc8
};

struct UCrowBattleShape {
	AActor* OwnerActor; // 0x28
	UPrimitiveComponent* CenterComponent; // 0x30
};

struct UMaterialExpressionSine {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct USeamSculptTool {
	USeamSculptToolProperties* Settings; // 0x200
	UPreviewGeometry* PreviewGeom; // 0x208
};

struct UCrowCloudVisualizerComponent {
	UCrowCloudDrawComponent* CloudDrawComponent; // 0x150
	UMaterialInstanceDynamic* CloudScapeMID; // 0x158
	UMaterialInstanceDynamic* ReservedCloudScapeMID; // 0x160
	TArray<FCrowCloudVisualizeMesh> VisualizeMeshes; // 0x168
	TArray<FCrowCloudVisualizeParticle> VisualizeParticles; // 0x178
	bool bChangeMaterial; // 0x188
	bool bPlayerIsInside; // 0x189
	float TransitionWeight; // 0x18c
	FVector FirstLocation; // 0x190
	TMap<int32_t, FCrowCloudScapeMaterialParamName> MaterialParamNameInfo; // 0x1a0
};

struct UMaterialExpressionConstant2Vector {
	float R; // 0x40
	float G; // 0x44
};

struct UCrowMultiSystemMessageWidget {
	URichTextBlock* RTB_Message; // 0x348
	UCanvasPanel* CP_MessageBox; // 0x350
	UWidgetAnimation* Animation_Move_1; // 0x358
	UWidgetAnimation* Animation_Move_2; // 0x360
	UWidgetAnimation* Animation_Move_3; // 0x368
	UWidgetAnimation* Animation_Fade_Out_1; // 0x370
	UWidgetAnimation* Animation_Fade_Out_2; // 0x378
	UWidgetAnimation* Animation_Fade_Out_3; // 0x380
};

struct UCrowMissionAreaComponent {
	ACrowMissionArea* ParentArea; // 0x1f8
};

struct UCrowVehicleBoatEffectSetting {
	FName AttachSocketName; // 0x28
	float SurfaceOffsetZ; // 0x30
	UParticleSystem* FxDriving; // 0x38
	UParticleSystem* FxIdle; // 0x40
	float SpeedForwardMax; // 0x48
	float SpeedRightMax; // 0x4c
	FName ParamNameSpeedForward; // 0x50
	FName ParamNameSpeedRight; // 0x58
	bool UseVirtualTexture; // 0x60
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x68
	int8_t VirtualTextureLodBias; // 0x78
	int8_t VirtualTextureCullMips; // 0x79
	int8_t VirtualTextureMinCoverage; // 0x7a
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x7b
};

struct USlateVectorArtData {
	TArray<FSlateMeshVertex> VertexData; // 0x28
	TArray<uint32_t> IndexData; // 0x38
	UMaterialInterface* Material; // 0x48
	FVector2D ExtentMin; // 0x50
	FVector2D ExtentMax; // 0x58
};

struct UGizmoWorldAxisSource {
	FVector Origin; // 0x30
	int32_t AxisIndex; // 0x3c
};

struct UUPSMovementGroupsSettings {
	FColor LineBetweenGroupLeaderAndGroupActorColor; // 0x38
	FColor LineBetweenGroupMemberAndLeaderColor; // 0x3c
	float LineBetweenGroupLeaderAndGroupActorThickness; // 0x40
	float LineBetweenGroupMemberAndLeaderThickness; // 0x44
	FName GroupMovementPointBBName; // 0x48
};

struct UCrowSettingsSlotDropdownWidget {
	TArray<FString> SelectionDatas; // 0x348
	int32_t SelectedIndex; // 0x358
	UCrowSettingsSlotWidget* OwnerSlot; // 0x360
	UCrowSettingsSlotDropdownSlot* DropdownSlotClass; // 0x368
	float DropdownSlotHeight; // 0x370
	float DropdownSlotMaxHeight; // 0x374
	UCrowToggleButton* BT_Dropdown; // 0x378
	UTextBlock* TB_SelectedItem; // 0x380
	UCanvasPanel* CP_Dropdown; // 0x388
	UScrollBox* SB_Dropdown; // 0x390
	bool bNeedResize; // 0x398
};

struct UCrowToolTipPingWidget {
	UTextBlock* TB_OwnerName; // 0x348
	UScaleBox* SB_Cancel; // 0x350
	UScaleBox* SB_OK; // 0x358
	UScaleBox* SB_Icon; // 0x360
};

struct UCrowShopPackagePopupWidget {
	bool IsSendPacket; // 0x348
	UGridPanel* GP_ItemListPanel; // 0x350
	UCrowShopItemSlotWidget* WB_Shop_Itemslot_Wide; // 0x358
	UCrowButton* WB_BT_Change; // 0x360
	UCrowButton* WB_BT_EscBack; // 0x368
	UTextBlock* TB_ItemName; // 0x370
	UTextBlock* TB_ItemDesc; // 0x378
	UImage* IMG_SelectItemIcon; // 0x380
	UUserWidget* GridSlotItem; // 0x388
	FCrowShopTableRow ShopData; // 0x390
};

struct UNavModifierComponent {
	UNavArea* AreaClass; // 0xe0
	FVector FailsafeExtent; // 0xe8
	char bIncludeAgentHeight : 1; // 0xf4
};

struct UNavLinkDefinition {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct ACrowAICharacterSpawner {
	bool DisableSpawner; // 0x268
	FCrowAICharacterSpawnData SpawnData; // 0x270
	ECrowAISpawnerState SpawnerState; // 0x2b8
	FTimerHandle ProcessSpawnerTimerHandle; // 0x2c0
	ACrowAIZoneBase* AIZone; // 0x2c8
	float WaitTimeForSpawn; // 0x2d0
	uint32_t SpawnedAICharacterNum; // 0x2d4
	uint32_t DeadAICharacterNum; // 0x2d8
	TArray<ACrowAICharacterPawn*> SpawnedAICharacterPawnList; // 0x2e0
};

struct UHorizontalBoxSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UAITask_MoveTo {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct AHUD {
	APlayerController* PlayerOwner; // 0x220
	char bLostFocusPaused : 1; // 0x228
	char bShowHUD : 1; // 0x228
	char bShowDebugInfo : 1; // 0x228
	int32_t CurrentTargetIndex; // 0x22c
	char bShowHitBoxDebugInfo : 1; // 0x230
	char bShowOverlays : 1; // 0x230
	char bEnableDebugTextShadow : 1; // 0x230
	TArray<AActor*> PostRenderedActors; // 0x238
	TArray<FName> DebugDisplay; // 0x250
	TArray<FName> ToggledDebugCategories; // 0x260
	UCanvas* Canvas; // 0x270
	UCanvas* DebugCanvas; // 0x278
	TArray<FDebugTextInfo> DebugTextList; // 0x280
	AActor* ShowDebugTargetDesiredClass; // 0x290
	AActor* ShowDebugTargetActor; // 0x298
};

struct UCrowSpringArmComponent {
	char SpringArmId; // 0x280
	FName InheritYawBoneName; // 0x284
	bool UseLocalInheritYaw; // 0x28c
	bool UseDriverRotation; // 0x28d
	bool UseStabilizationPitch; // 0x28e
	float AmountStabilizationPitch; // 0x290
	float DriverRotationMaxPitch; // 0x294
	float DriverRotationMaxYaw; // 0x298
	float DriverRotationMaxRoll; // 0x29c
	bool UseTickGroupOverride; // 0x2a0
	ETickingGroup TickGroupOverride; // 0x2a1
	bool IgnoreAddedInput; // 0x2a2
	bool UseCameraRotationLagWeight; // 0x2a3
	float CameraRotationLagWeight; // 0x2a4
	FVector2D YawMinMax; // 0x2a8
	FVector2D PitchMinMax; // 0x2b0
	UCameraComponent* ChildCamera; // 0x2b8
	TArray<AActor*> SkipCollisionActorList; // 0x2c0
	USceneComponent* DefaultParent; // 0x2d0
	FName DefaultParentSocketName; // 0x2d8
	FTransform DefaultLocalTransform; // 0x2e0
	FTransform DefaultCameraLocalTransform; // 0x310
	FTransform DefaultRootWorldTransform; // 0x340
	FRotator AddedInputRotation; // 0x370
	FRotator RootMovedRotation; // 0x37c
	FRotator DriverRotation; // 0x388
	FRotator StabilizationRotation; // 0x394
};

struct UCrowTriggerComponent {
	FTriggerCheckDistance TriggerCheckDistance; // 0x1f8
	UCrowTriggerCommandBase* DefaultCommandDistance; // 0x220
	UCrowTriggerCommandBase* CommandDistance; // 0x228
	FTriggerCheckMouseOver TriggerCheckMouseOver; // 0x230
	UCrowTriggerCommandBase* DefaultCommandMouseOver; // 0x240
	UCrowTriggerCommandBase* CommandMouseOver; // 0x248
	FTriggerInput TriggerInput; // 0x250
	UCrowTriggerCommandBase* DefaultCommandInput; // 0x268
	FString WidgetMessage; // 0x270
	FText WidgetMessageText; // 0x280
	TArray<ETriggerMessageParamType> ParamTypes; // 0x298
	float MessageDisplayTime; // 0x2a8
	UCrowTriggerCommandBase* CommandInput; // 0x2b0
	bool ProgressDistanceEvent; // 0x2b8
	bool ProgressMouseOverEvent; // 0x2b9
	FTimerHandle PressInputTimerHandle; // 0x2c0
	FName CurrentOverlapID; // 0x2c8
	FName CurrentMouseOverID; // 0x2d0
	float TotalPressInputTime; // 0x2d8
};

struct USpotLightComponent {
	float InnerConeAngle; // 0x358
	float OuterConeAngle; // 0x35c
};

struct UWB_SettingsExplanation_C {
	UImage* IMG_InfomationBg; // 0x400
};

struct UNavMovementComponent {
	FNavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x124
	char bUseAccelerationForPaths : 1; // 0x124
	char bUseFixedBrakingDistanceForPaths : 1; // 0x124
	FMovementProperties MovementState; // 0x125
	UObject* PathFollowingComp; // 0x128
};

struct UM240B_AnimBlueprint_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x318
	FAnimNode_Slot AnimGraphNode_Slot; // 0x338
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x380
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3a0
	FAnimNode_VehicleWeaponHandler AnimGraphNode_VehicleWeapon_2; // 0x3c0
	FAnimNode_MeshSpaceRefPose AnimGraphNode_MeshRefPose; // 0x4c0
	FAnimNode_VehicleWeaponHandler AnimGraphNode_VehicleWeapon; // 0x4d0
};

struct UMaterialExpressionBumpOffset {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UCrowCustomizeItemListWidget {
	UScrollBox* SCB_Itemlist; // 0x348
	UTextBlock* TB_Title; // 0x350
	UCrowItemSlotWidget* ItemSlotWidgetClass; // 0x358
	ACrowSceneLobby* SceneLobby; // 0x360
	ACrowSceneGame* SceneGame; // 0x368
	UCrowCategorySlotBigWidget* CurrentCategorySlotBigWidget; // 0x370
	ECrowWeaponUIType CurrentWeaponUIType; // 0x378
	UCrowItemSlotWidget* SelectedWidgetItem; // 0x380
	bool NotSave; // 0x389
	bool IsShopMode; // 0x38a
	float ItemSize; // 0x38c
};

struct UWB_CuonExtractor_WorldMapIndicator_C {
	UWidgetAnimation* Ani_PingTargetLoop; // 0x378
	UImage* IMG_Effect; // 0x380
	UImage* IMG_Effect_3; // 0x388
	UImage* IMG_Effect_Glow; // 0x390
	UImage* IMG_Icon; // 0x398
	UImage* IMG_IconBg; // 0x3a0
	UImage* IMG_LocateArrow; // 0x3a8
	UImage* IMG_Ping; // 0x3b0
};

struct ULevelCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UParticleModuleLocationPrimitiveSphere {
	FRawDistributionFloat StartRadius; // 0xb0
};

struct ACrowPlayerControllerBase {
	bool bIsStartSpectating; // 0x571
	APawn* PawnBeforeSpectatingState; // 0x578
	bool bIsCharacterDesytroyWhenEndSpectating; // 0x580
	FCrowUserInfoBase ServerUserInfo; // 0x588
	bool bEnablePickingItem; // 0xdc1
	UCrowTriggerDisplay* TriggerDisplay; // 0xde0
	char bAllowGameActions : 1; // 0xdec
	UMaterialParameterCollection* WeaponFOVCollection; // 0xdf0
	TArray<uint32_t> EmotionIndexsInSlot; // 0xdf8
	UCrowPassenger* Passenger; // 0xe08
	AActor* BaseControlActor; // 0xe10
	FRotator BaseControlRotation; // 0xe18
	FVector2D BaseControlPitchMinMax; // 0xe24
	FVector2D BaseControlYawMinMax; // 0xe2c
	FRotator BaseControlAddedRotation; // 0xe34
	FRotator CharacterLookingRotation; // 0xe40
	FName PrevCharacterCamera; // 0xe4c
	APawn* RespawnTargetPawn; // 0xe58
	UCrowProjectileChecker* ProjectileChecker; // 0xe60
	ECrowCameraLimitMode CameraLimitMode; // 0xe68
	FVector LastDeathLocation; // 0xe84
	FRotator LastInputAxis; // 0xe90
	FString DoorTriggerMessage; // 0xea0
	bool bIsObserver; // 0xef2
};

struct UCrowVehicleFloodingEffectSetting {
	UParticleSystem* FxImmerge; // 0x28
	FName AttachSocketName_Bubble; // 0x30
	UParticleSystem* FxBubble; // 0x38
	FName AttachSocketName_DrivingForward; // 0x40
	FName AttachSocketName_DrivingBackward; // 0x48
	UParticleSystem* FxDriving; // 0x50
	UParticleSystem* FxGroundDust; // 0x58
	float SpeedForwardMax; // 0x60
	float SpeedRightMax; // 0x64
	FName ParamNameSpeedForward; // 0x68
	FName ParamNameSpeedRight; // 0x70
};

struct ACrowConquestMeteorPieceActor {
	FVector EndLocation; // 0x220
	float SmallMeteorSpeed; // 0x22c
	ECrowMMeteorPieceState MeteorState; // 0x230
	UBoxComponent* Root; // 0x240
	ACrowConquestMeteorSettings* MeteorSettingsActor; // 0x248
	ACrowTargetTraceEffect* SmallMeteorComp; // 0x250
	UParticleSystemComponent* GasComp; // 0x258
	float MeteorDistance; // 0x260
};

struct URotatingMovementComponent {
	FRotator RotationRate; // 0xf0
	FVector PivotTranslation; // 0xfc
	char bRotationInLocalSpace : 1; // 0x108
};

struct UCrowWeaponPartsMagazine {
	FCrowWeaponPartsMagazineTableRow PartsTable; // 0x320
	FCrowWeaponPartsMagazineTableRow DefaultPartsData; // 0x770
};

struct UGroomBindingAsset {
	UGroomAsset* Groom; // 0x28
	USkeletalMesh* SourceSkeletalMesh; // 0x30
	USkeletalMesh* TargetSkeletalMesh; // 0x38
	int32_t NumInterpolationPoints; // 0x40
	int32_t MatchingSection; // 0x44
	TArray<FGoomBindingGroupInfo> GroupInfos; // 0x48
};

struct UActorSequence {
	UMovieScene* MovieScene; // 0x60
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x68
};

struct ULandscapeLayerInfoObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UUPSAITask_ExecuteEnemyAction {
	FMulticastInlineDelegate OnEnemyActionFinishedDelegate; // 0x68
	UUPSEnemyAction* EnemyAction; // 0x78
	ACharacter* Character; // 0x80
};

struct UAnimCurveCompressionSettings {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct UStreamingSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UTetherGuideSplineComponent {
	UTetherGuideSplineMetadata* MetaData; // 0x568
};

struct UMaterialExpressionAntialiasedTextureMask {
	float Threshold; // 0x80
	ETextureColorChannel Channel; // 0x84
};

struct UMovieSceneWidgetMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x90
	FName TrackName; // 0xa0
};

struct UParticleModuleBeamModifier {
	BeamModifierType ModifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UParticleModuleTypeDataRibbon {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct USimpleDynamicMeshComponent {
	EDynamicMeshTangentCalcType TangentsType; // 0x4b0
	bool bInvalidateProxyOnChange; // 0x4b1
	bool bExplicitShowWireframe; // 0x4e8
	bool bDrawOnTop; // 0x530
};

struct UMagicLeapLightingTrackingComponent {
	bool UseGlobalAmbience; // 0xb0
	bool UseColorTemp; // 0xb1
};

struct ACrowDamageCauserActor {
	ECrowDamageCauser DamageCauser; // 0x220
	ECrowItemType ItemType; // 0x221
	uint16_t ItemIndex; // 0x222
	FString EffectKey; // 0x228
	AActor* OwnerActor; // 0x238
};

struct ULevelStreaming {
	TSoftObjectPtr<UWorld> WorldAsset; // 0x28
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	int32_t LevelLODIndex; // 0xb0
	int32_t StreamingPriority; // 0xb4
	char bShouldBeVisible : 1; // 0xba
	char bShouldBeLoaded : 1; // 0xba
	char bLocked : 1; // 0xba
	char bIsStatic : 1; // 0xba
	char bShouldBlockOnLoad : 1; // 0xba
	char bShouldBlockOnUnload : 1; // 0xbb
	char bDisableDistanceStreaming : 1; // 0xbb
	char bDrawOnLevelStatusMap : 1; // 0xbb
	FLinearColor LevelColor; // 0xbc
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	FMulticastInlineDelegate OnLevelLoaded; // 0xe8
	FMulticastInlineDelegate OnLevelUnloaded; // 0xf8
	FMulticastInlineDelegate OnLevelShown; // 0x108
	FMulticastInlineDelegate OnLevelHidden; // 0x118
	ULevel* LoadedLevel; // 0x128
	ULevel* PendingUnloadLevel; // 0x130
};

struct UAkCheckBox {
	ECheckBoxState CheckedState; // 0x4b8
	FDelegate CheckedStateDelegate; // 0x4bc
	FCheckBoxStyle WidgetStyle; // 0x4d0
	EHorizontalAlignment HorizontalAlignment; // 0xa50
	bool IsFocusable; // 0xa51
	FAkBoolPropertyToControl ThePropertyToControl; // 0xa58
	FAkWwiseItemToControl ItemToControl; // 0xa68
	FMulticastInlineDelegate AkOnCheckStateChanged; // 0xaa8
	FMulticastInlineDelegate OnItemDropped; // 0xab8
	FMulticastInlineDelegate OnPropertyDropped; // 0xac8
};

struct ACrowWorldPropActor {
	USceneComponent* PropRoot; // 0x228
	UStaticMeshComponent* MainMeshComponent; // 0x230
	bool bUtilityPole; // 0x238
	TArray<FCrowWorldPropSetting> PropSettings; // 0x240
	UCrowWorldDestructionAUD* DestructionAUD; // 0x250
};

struct UPolyEditInsetProperties {
	bool bReproject; // 0x60
	float Softness; // 0x64
	bool bBoundaryOnly; // 0x68
	float AreaScale; // 0x6c
};

struct ABP_Rocket_70mm_C {
	USkeletalMeshComponent* M4_Projectile_Root; // 0x1840
};

struct UOnsetNRT {
	UOnsetNRTSettings* Settings; // 0x78
};

struct UDialogueWave {
	char bMature : 1; // 0x28
	char bOverride_SubtitleOverride : 1; // 0x28
	FString SpokenText; // 0x30
	FString SubtitleOverride; // 0x40
	TArray<FDialogueContextMapping> ContextMappings; // 0x50
	FGuid LocalizationGUID; // 0x60
};

struct ULiveLinkSubjectSettings {
	TArray<ULiveLinkFramePreProcessor*> PreProcessors; // 0x28
	ULiveLinkFrameInterpolationProcessor* InterpolationProcessor; // 0x38
	TArray<ULiveLinkFrameTranslator*> Translators; // 0x40
	ULiveLinkRole* Role; // 0x50
	FFrameRate FrameRate; // 0x58
	bool bRebroadcastSubject; // 0x60
};

struct UCrowWorldSplineFenceComponent {
	bool bStairMode; // 0xc0
	bool bMeshSnap; // 0xc1
	TArray<UStaticMesh*> VariationMeshes; // 0xc8
};

struct UAnimNotify_PlayMontageNotifyWindow {
	FName NotifyName; // 0x30
};

struct UNiagaraDataInterfaceRenderTargetVolume {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTargetVolume*> ManagedRenderTargets; // 0x108
};

struct UDistributionFloatParameterBase {
	FName ParameterName; // 0x40
	float MinInput; // 0x48
	float MaxInput; // 0x4c
	float MinOutput; // 0x50
	float MaxOutput; // 0x54
	DistributionParamMode ParamMode; // 0x58
};

struct UPaperTileLayer {
	FText LayerName; // 0x28
	int32_t LayerWidth; // 0x40
	int32_t LayerHeight; // 0x44
	char bHiddenInGame : 1; // 0x48
	char bLayerCollides : 1; // 0x48
	char bOverrideCollisionThickness : 1; // 0x48
	char bOverrideCollisionOffset : 1; // 0x48
	float CollisionThicknessOverride; // 0x4c
	float CollisionOffsetOverride; // 0x50
	FLinearColor LayerColor; // 0x54
	int32_t AllocatedWidth; // 0x64
	int32_t AllocatedHeight; // 0x68
	TArray<FPaperTileInfo> AllocatedCells; // 0x70
	UPaperTileSet* TileSet; // 0x80
	TArray<int32_t> AllocatedGrid; // 0x88
};

struct UScaleBox {
	EStretch Stretch; // 0x120
	EStretchDirection StretchDirection; // 0x121
	float UserSpecifiedScale; // 0x124
	bool IgnoreInheritedScale; // 0x128
};

struct ACrowWorldEventSafeBox {
	TArray<ACrowSafeBoxEventActor*> SafeBoxList; // 0x370
	int32_t ActivationSafeBoxCount; // 0x380
	TArray<FCrowSafeBoxAreaInfo> SafeBoxAreaList; // 0x388
	FCrowGameIconDisplayInfo AreaDisplayInfo; // 0x398
	TArray<UCrowWorldMapIcon*> AreaIconArray; // 0x420
};

struct UEdgeLoopInsertionOperatorFactory {
	UEdgeLoopInsertionTool* Tool; // 0x30
};

struct UBTTask_MoveDirectlyToward {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb0
	char bProjectVectorGoalToNavigation : 1; // 0xb0
	char bUpdatedDeprecatedProperties : 1; // 0xb0
};

struct UCrowPingWidgetBase {
	AActor* PingTargetActor; // 0x348
	UCanvasPanel* CP_Ping; // 0x350
	UWidgetAnimation* AniPingTargetStart; // 0x358
	UWidgetAnimation* AniPingTargetLoop; // 0x360
	UWidgetAnimation* AniPingHoverLoop; // 0x368
};

struct UParticleModuleColor {
	FRawDistributionVector StartColor; // 0x30
	FRawDistributionFloat StartAlpha; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UCrowChatWidget {
	UCrowChatTyping* WB_CrowChatTyping; // 0x348
	UScrollBox* SCB_ChatList; // 0x350
	UVerticalBox* VB_ChatList; // 0x358
	UWidgetSwitcher* WS_ChatSatus; // 0x360
	UCanvasPanel* CP_ToolTip; // 0x368
	UCanvasPanel* CP_ChatBG; // 0x370
	UCrowButton* BT_StartTyping; // 0x378
	UCrowChatMessageItem* WB_CrowChatMessageItem; // 0x380
	UCrowChatMessageItem* ItemChatMsgItemWidgetClass; // 0x388
	float LastChatCheckSec; // 0x390
	float ChatListFadeOutSecond; // 0x394
	int32_t ChatListMAX; // 0x398
	FName HoverAnim; // 0x39c
};

struct ALODActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<UMaterialInterface*, UInstancedStaticMeshComponent*> ImpostersStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct ACrowPlayerStateBombMission {
	char PlantCompositionCCount; // 0xb78
	char DefuseCompositionCCount; // 0xb79
	bool bIsCompositionCHolder; // 0xb7a
	ECrowGameRoundState CrowGameRoundState; // 0xb7b
	bool bIsPossibleConstructCompositionC; // 0xb7c
	ACrowCompositionCVolume* CompositionCVolume; // 0xb80
};

struct ACrowAICharacterController {
	FCrowAICharacterData Setup_AICharacterData; // 0x350
	FCrowAICharacterParameter Setup_AICharacterParameter; // 0x3b0
	FCrowAIFireTargetData Setup_AIFireTargetData; // 0x3d0
	ACrowAICharacterPawn* AIPawn; // 0x3e8
	ACrowAICharacterSpawner* AISpawner; // 0x3f0
	FTimerHandle UpdateAIPerceptionTimerHandle; // 0x3f8
	bool bStartFire; // 0x400
};

struct ACrowBuildingActor {
	bool LockPropTransforms; // 0x228
	FCrowBuildingEditorPreview EditorPreview; // 0x229
	FCrowBuildingCustomLOD BuildingLOD; // 0x230
	bool IsMergingLODBody; // 0x2a8
	FCrowBuildingDemolitionSetting DemolitionSetting; // 0x2b0
	FCrowBuildingEditorLayout BuildingLayout; // 0x320
	TArray<FCrowBuildingDecalData> DecalDatas; // 0x370
	TArray<FCrowBuildingReflectionData> ReflectionDatas; // 0x380
	bool bIsIndestructible; // 0x390
	float MaxHealth; // 0x394
	float LightProbeRatioMultiplier; // 0x398
	bool bForceMoveToBldLevel; // 0x39c
	bool ClusterSyncActor; // 0x39d
	UCrowWorldDamageCheckerBase* DamageChecker; // 0x3a0
	UCrowWorldDestructionAUD* DestructionAUD; // 0x3a8
	FCrowBuildingVisualizer Visualizer; // 0x3b0
	FBoxSphereBounds BuildingBounds; // 0x408
	FBox BuildingBoundingBox; // 0x424
	bool IsUsingSyncHub; // 0x440
	ACrowWorldSyncHubActor* SyncHubActor; // 0x448
	int32_t PartsCount; // 0x450
	TArray<FCrowBuildingPartsState> RawPartsStates; // 0x458
	TArray<FCrowBuildingHISMCInfo> HISMCInfoArray; // 0x468
	bool HasCleanedUpForDestroy; // 0x478
	TArray<UDecalComponent*> AdditionalDecals; // 0x480
	USceneComponent* BuildRoot; // 0x490
	USceneComponent* PositionRoot; // 0x498
	UCrowBuildingModularBuilder* ModularBuilder; // 0x4a0
	UCrowSoundStateVolumeComponent* SoundStateVolumeComponent; // 0x4a8
};

struct UCrowSquadSummaryWidget {
	TArray<UCrowSquadSummarySlotWidget*> SquadSlotList; // 0x368
	UCrowSquadSummarySlotWidget* WB_SquadSummarySlot1; // 0x378
	UCrowSquadSummarySlotWidget* WB_SquadSummarySlot2; // 0x380
	UCrowSquadSummarySlotWidget* WB_SquadSummarySlot3; // 0x388
	UCrowSquadSummarySlotWidget* WB_SquadSummarySlot4; // 0x390
	UProgressBar* PB_ResourceCount; // 0x398
	UCrowButton* BT_Spectating; // 0x3a0
	UCrowButton* BT_Nexttolobby; // 0x3a8
	UTextBlock* TB_CurrencyCount; // 0x3b0
	UTextBlock* TB_TagetCurrency; // 0x3b8
};

struct UCrowWorldIconWidgetBase {
	UCanvasPanel* CP_Root; // 0x378
	UCanvasPanel* CP_LocateArrow; // 0x380
	UCanvasPanel* CP_AnchorRoot; // 0x388
	UCanvasPanel* CP_Icon; // 0x390
	UTextBlock* TB_Name; // 0x398
	UTextBlock* TB_Distance; // 0x3a0
	TArray<UWidget*> IconLOD; // 0x3a8
	AActor* TargetActor; // 0x3b8
};

struct UMRMeshComponent {
	UMaterialInterface* Material; // 0x450
	UMaterialInterface* WireframeMaterial; // 0x458
	bool bCreateMeshProxySections; // 0x460
	bool bUpdateNavMeshOnMeshUpdate; // 0x461
	bool bNeverCreateCollisionMesh; // 0x462
	UBodySetup* CachedBodySetup; // 0x468
	TArray<UBodySetup*> BodySetups; // 0x470
};

struct UMaterialExpressionSphericalParticleOpacity {
	FExpressionInput Density; // 0x40
	float ConstantDensity; // 0x54
};

struct UAkMediaAssetData {
	bool IsStreamed; // 0x28
	bool UseDeviceMemory; // 0x29
};

struct UCrowLocalBodyIconWidget {
	UCanvasPanel* CP_Root; // 0x348
	UCanvasPanel* CP_LocateArrow; // 0x350
	UCanvasPanel* CP_AnchorRoot; // 0x358
	UCanvasPanel* CP_Icon; // 0x360
	UTextBlock* TB_Distance; // 0x368
};

struct UNiagaraPreviewAxis_InterpParamBase {
	FName Param; // 0x28
	int32_t Count; // 0x30
};

struct UGetGeoLocationAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UJoinSessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UCrowSelectWorldButtonWidget {
	UImage* IMG_World; // 0x348
	UTextBlock* TB_WorldName; // 0x350
	UCrowToggleButton* CTB_WorldSelect; // 0x358
	UCanvasPanel* CP_Info; // 0x360
	UCanvasPanel* CP_Lock; // 0x368
	FCrowSceneTableRow SceneTableRow; // 0x380
};

struct UCrowSquadMatchRespawnWidget {
	USizeBox* SB_BT_RedeployMember00; // 0x368
	UTextBlock* TB_SquadNum; // 0x370
	UImage* IMG_SquadBack; // 0x378
	UTextBlock* TB_MenuTitle_12; // 0x380
	UTextBlock* TB_CoolTime_2; // 0x388
	UCrowButton* WB_BT_RedeployMember00; // 0x390
	USizeBox* SB_BT_RedeployMember01; // 0x398
	UTextBlock* TB_SquadNum_2; // 0x3a0
	UImage* IMG_SquadBack_2; // 0x3a8
	UTextBlock* TB_MenuTitle; // 0x3b0
	UTextBlock* TB_CoolTime_3; // 0x3b8
	UCrowButton* WB_BT_RedeployMember01; // 0x3c0
	USizeBox* SB_BT_RedeployMember02; // 0x3c8
	UTextBlock* TB_SquadNum_3; // 0x3d0
	UImage* IMG_SquadBack_3; // 0x3d8
	UTextBlock* TB_MenuTitle_2; // 0x3e0
	UTextBlock* TB_CoolTime_4; // 0x3e8
	UCrowButton* WB_BT_RedeployMember02; // 0x3f0
	UCanvasPanel* CP_MemberEmpty; // 0x3f8
	TArray<FCrowSquadMatchRespawnInfo> InfoArray; // 0x400
};

struct USoundCue {
	char bPrimeOnLoad : 1; // 0x1b8
	USoundNode* FirstNode; // 0x1c0
	float VolumeMultiplier; // 0x1c8
	float PitchMultiplier; // 0x1cc
	FSoundAttenuationSettings AttenuationOverrides; // 0x1d0
	float SubtitlePriority; // 0x570
	char bOverrideAttenuation : 1; // 0x578
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x578
	int32_t CookedQualityIndex; // 0x57c
	char bHasPlayWhenSilent : 1; // 0x580
};

struct ANiagaraPreviewGrid {
	UNiagaraSystem* System; // 0x220
	ENiagaraPreviewGridResetMode ResetMode; // 0x228
	UNiagaraPreviewAxis* PreviewAxisX; // 0x230
	UNiagaraPreviewAxis* PreviewAxisY; // 0x238
	ANiagaraPreviewBase* PreviewClass; // 0x240
	float SpacingX; // 0x248
	float SpacingY; // 0x24c
	int32_t NumX; // 0x250
	int32_t NumY; // 0x254
	TArray<UChildActorComponent*> PreviewComponents; // 0x258
};

struct UCrowVehicleMovementLandWheels {
	UCrowLandWheelsConfigEngine* EngineConfigClass; // 0x190
	UCrowLandWheelsConfigBody* BodyConfigClass; // 0x198
	FCrowLandWheelsEngineSetting EngineSetting; // 0x1a0
	TArray<FCrowLandWheelsSingleWheelState> WheelStates; // 0x280
	int32_t UpdateCacheIndex; // 0x290
	TMap<AActor*, FCrowLandWheelsSqueezeDamage> DamagesByWheel; // 0x298
	float LastDamageTime; // 0x2e8
};

struct UNiagaraPreviewAxis_InterpParamInt32 {
	int32_t Min; // 0x38
	int32_t Max; // 0x3c
};

struct UBTCompositeNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
	char bApplyDecoratorScope : 1; // 0x88
};

struct UMaterialExpressionNoise {
	FExpressionInput position; // 0x40
	FExpressionInput FilterWidth; // 0x54
	float Scale; // 0x68
	int32_t Quality; // 0x6c
	ENoiseFunction NoiseFunction; // 0x70
	char bTurbulence : 1; // 0x74
	int32_t Levels; // 0x78
	float OutputMin; // 0x7c
	float OutputMax; // 0x80
	float LevelScale; // 0x84
	char bTiling : 1; // 0x88
	uint32_t RepeatSize; // 0x8c
};

struct UCrowGameOpeningWidget {
	UTextBlock* Text_Title; // 0x348
	UTextBlock* Text_SubTitle; // 0x350
	UTextBlock* Text_Gamemode; // 0x358
};

struct UDrawPolyPathTool {
	UDrawPolyPathProperties* TransformProps; // 0xa0
	UDrawPolyPathExtrudeProperties* ExtrudeProperties; // 0xa8
	UNewMeshMaterialProperties* MaterialProperties; // 0xb0
	UConstructionPlaneMechanic* PlaneMechanic; // 0x140
	UPolyEditPreviewMesh* EditPreview; // 0x1e8
	UPlaneDistanceFromHitMechanic* ExtrudeHeightMechanic; // 0x1f0
	USpatialCurveDistanceMechanic* CurveDistMechanic; // 0x1f8
	UCollectSurfacePathMechanic* SurfacePathMechanic; // 0x200
};

struct UAISense_Team {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct UMovieSceneCameraCutTrack {
	bool bCanBlend; // 0x78
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UGizmoPlaneTranslationParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	FVector2D Parameter; // 0xb0
	FGizmoVec2ParameterChange LastChange; // 0xb8
	FVector CurTranslationOrigin; // 0xc8
	FVector CurTranslationNormal; // 0xd4
	FVector CurTranslationAxisX; // 0xe0
	FVector CurTranslationAxisY; // 0xec
	FTransform InitialTransform; // 0x100
};

struct UPolyEditCommonProperties {
	bool bShowWireframe; // 0x60
	bool bSelectEdgeLoops; // 0x61
	ELocalFrameMode LocalFrameMode; // 0x64
	bool bLockRotation; // 0x68
	bool bSnapToWorldGrid; // 0x69
};

struct UHoleFillTool {
	USmoothHoleFillProperties* SmoothHoleFillProperties; // 0x98
	UHoleFillToolProperties* Properties; // 0xa0
	UHoleFillToolActions* Actions; // 0xa8
	UHoleFillStatisticsProperties* Statistics; // 0xb0
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xb8
	UPolygonSelectionMechanic* SelectionMechanic; // 0xc0
};

struct UCrowLobbySlotToggleButton {
	UVerticalBox* VB_PurchaseStatus; // 0x5a8
	UImage* IMG_PurchaseIcon; // 0x5b0
	UWidgetSwitcher* WS_LockStatus; // 0x5b8
	UTextBlock* TB_Timer; // 0x5c0
	ECrowLobbySlotType LobbySlotType; // 0x5c8
	bool bLocked; // 0x5c9
	float DeltaTime; // 0x5cc
};

struct UCrowNoticeWebBrowser {
	UWidget* WB_Notice; // 0x348
	UCrowButton* BT_Exit; // 0x350
	UTextBlock* TB_Title; // 0x358
};

struct ULightComponent {
	float Temperature; // 0x228
	float MaxDrawDistance; // 0x22c
	float MaxDistanceFadeRange; // 0x230
	char bUseTemperature : 1; // 0x234
	int32_t ShadowMapChannel; // 0x238
	float MinRoughness; // 0x240
	float SpecularScale; // 0x244
	float ShadowResolutionScale; // 0x248
	float ShadowBias; // 0x24c
	float ShadowSlopeBias; // 0x250
	float ShadowSharpen; // 0x254
	float ContactShadowLength; // 0x258
	char ContactShadowLengthInWS : 1; // 0x25c
	char InverseSquaredFalloff : 1; // 0x25c
	char CastTranslucentShadows : 1; // 0x25c
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x25c
	char bAffectDynamicIndirectLighting : 1; // 0x25c
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x25c
	FLightingChannels LightingChannels; // 0x260
	UMaterialInterface* LightFunctionMaterial; // 0x268
	FVector LightFunctionScale; // 0x270
	UTextureLightProfile* IESTexture; // 0x280
	char bUseIESBrightness : 1; // 0x288
	float IESBrightnessScale; // 0x28c
	float LightFunctionFadeDistance; // 0x290
	float DisabledBrightness; // 0x294
	char bEnableLightShaftBloom : 1; // 0x298
	float BloomScale; // 0x29c
	float BloomThreshold; // 0x2a0
	float BloomMaxBrightness; // 0x2a4
	FColor BloomTint; // 0x2a8
	bool bUseRayTracedDistanceFieldShadows; // 0x2ac
	float RayStartOffsetDepthScale; // 0x2b0
};

struct ULocalizedOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct UMaterialExpressionFunctionOutput {
	FName OutputName; // 0x40
	FString Description; // 0x48
	int32_t SortPriority; // 0x58
	FExpressionInput A; // 0x5c
	char bLastPreviewed : 1; // 0x70
	FGuid ID; // 0x74
};

struct AUPSGroupMovementFormation {
	UArrowComponent* RootArrowComponent; // 0x220
	TSet<ACharacter*> CharactersInFormation; // 0x228
	ACharacter* LeaderCharacter; // 0x278
};

struct UEditableGeometryCollectionAdapter {
	UGeometryCollection* GeometryCollection; // 0x28
	UGeometryCollection* OriginalGeometryCollection; // 0x30
	int32_t GeometryCollectionLODIndex; // 0x38
};

struct UGizmoAxisIntervalParameterSource {
	TScriptInterface<IGizmoFloatParameterSource> FloatParameterSource; // 0x48
	float MinParameter; // 0x58
	float MaxParameter; // 0x5c
};

struct UDisplaceMeshTextureMapProperties {
	UTexture2D* DisplacementMap; // 0x60
};

struct UDynamicMeshSculptTool {
	USculptBrushProperties* BrushProperties; // 0xc0
	UBrushSculptProperties* SculptProperties; // 0xc8
	USculptMaxBrushProperties* SculptMaxBrushProperties; // 0xd0
	UKelvinBrushProperties* KelvinBrushProperties; // 0xd8
	UBrushRemeshProperties* RemeshProperties; // 0xe0
	UFixedPlaneBrushProperties* GizmoProperties; // 0xe8
	UMeshEditingViewProperties* ViewProperties; // 0xf0
	UBrushStampIndicator* BrushIndicator; // 0x130
	UMaterialInstanceDynamic* BrushIndicatorMaterial; // 0x138
	UPreviewMesh* BrushIndicatorMesh; // 0x140
	UOctreeDynamicMeshComponent* DynamicMeshComponent; // 0x148
	UMaterialInstanceDynamic* ActiveOverrideMaterial; // 0x150
	UTransformGizmo* PlaneTransformGizmo; // 0xc50
	UTransformProxy* PlaneTransformProxy; // 0xc58
};

struct UVertexBrushSculptProperties {
	EMeshVertexSculptBrushType PrimaryBrushType; // 0x60
	EMeshSculptFalloffType PrimaryFalloffType; // 0x61
	bool bFreezeTarget; // 0x62
	bool bSmoothErases; // 0x63
};

struct UMovieSceneCameraAnimTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x80
};

struct UCrowDOFComponent {
	bool IsActiveDOF; // 0xb0
	FCrowDOFSetting DOFSetting; // 0xc0
	UStaticMeshComponent* UnaffectedDOFMeshComp; // 0x640
	bool bInitialized; // 0x648
};

struct UCrowObjectiveConquestWidget {
	UPaperSprite* RedMyTeam; // 0x4b8
	UPaperSprite* RedEnemy; // 0x4c0
	UPaperSprite* BlueMyTeam; // 0x4c8
	UPaperSprite* BlueEnemy; // 0x4d0
	UCrowConquestGaugeNumber* ConquestGaugeNumberClass; // 0x4d8
	UTextBlock* TB_SubMessage; // 0x4e0
	UBorder* BD_SubMessage; // 0x4e8
	UCanvasPanel* CP_ConquestIconRoot; // 0x4f0
	UCanvasPanel* CP_OverLoadAlarm; // 0x4f8
	UTextBlock* TB_OverloadTimer; // 0x500
	UCanvasPanel* CP_OverLoadStart; // 0x508
	UCanvasPanel* CP_AllyTicket_Decrease; // 0x510
	UCanvasPanel* CP_EnemyTicket_Decrease; // 0x518
	UCanvasPanel* CP_AllyNumber; // 0x520
	UCanvasPanel* CP_EnemyNumber; // 0x528
	UCanvasPanel* CP_FastWidget_Ally; // 0x530
	UCanvasPanel* CP_FastWidget_Enemy; // 0x538
	UImage* IMG_AllyFast; // 0x540
	UImage* IMG_EnemyFast; // 0x548
	UCrowWidgetBase* WB_DiveActive_Ally_HUD; // 0x550
	UCrowWidgetBase* WB_DiveActive_Enemy_HUD; // 0x558
	UWidgetAnimation* AniMessageShow; // 0x560
	UWidgetAnimation* AniMessageHide; // 0x568
	UWidgetAnimation* AniAllyTicket_Decrease; // 0x570
	UWidgetAnimation* AniEnemyTicket_Decrease; // 0x578
	UWidgetAnimation* AniOverloadTimerShow; // 0x580
	UWidgetAnimation* AniOverloadTimerHide; // 0x588
	float SubMessageDisplayTime; // 0x590
	TArray<FText> SubMessageArray; // 0x598
};

struct UCrowRewardTableManager {
	TMap<uint32_t, FCrowRewardTableRow> RewardTable; // 0x70
	FString RewardLog; // 0xc0
};

struct AStaticMeshActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	bool bStaticMeshReplicateMovement; // 0x228
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229
};

struct UCrowScoreInfoConquestUserSummary {
	bool IsEnemy; // 0x348
	UCrowScoreInfoConquestUSItem* UserSummaryItem; // 0x350
	UScrollBox* SB_TeamSummary; // 0x358
	UImage* IMG_TeamColor; // 0x360
	TArray<UCrowScoreInfoConquestUSItem*> UserUIArray; // 0x368
};

struct AWaterBodyIsland {
	UWaterSplineComponent* SplineComp; // 0x228
};

struct ACrowPlayerStartTDM {
	ECrowTeam_RedBlue SpawnTeam; // 0x250
};

struct UCrowSpectatorCustomModeWidget {
	UTextBlock* TB_Squad; // 0x348
	UImage* IMG_Squad_Color; // 0x350
	UTextBlock* TB_KillCount; // 0x358
	UTextBlock* TB_PlayerName; // 0x360
	UImage* IMG_PrevIcon; // 0x368
	UImage* IMG_NextIcon; // 0x370
	UImage* IMG_ClosePlayerList; // 0x378
	UCrowSpectatorTargetListWidget* WB_SpectatorTargetList; // 0x380
	UCanvasPanel* CP_Watching; // 0x388
	ACrowPlayerStateBase* AttachedPlayerState; // 0x390
};

struct UCrowLibraryTime {
	TArray<FCrowTimeInfo> TimeInfoArray; // 0x30
};

struct UCrowBombMissionResultRoundWidget {
	UImage* IMGWinAttackerIcon; // 0x348
	UImage* IMGWinDefencerIcon; // 0x350
	UImage* IMGLoseAttackerIcon; // 0x358
	UImage* IMGLoseDefencerIcon; // 0x360
	UWidgetAnimation* AniShow; // 0x368
	UWidgetAnimation* AniWin; // 0x370
	UWidgetAnimation* AniLose; // 0x378
};

struct UPawnNoiseEmitterComponent {
	char bAIPerceptionSystemCompatibilityMode : 1; // 0xb0
	FVector LastRemoteNoisePosition; // 0xb4
	float NoiseLifetime; // 0xc0
	float LastRemoteNoiseVolume; // 0xc4
	float LastRemoteNoiseTime; // 0xc8
	float LastLocalNoiseVolume; // 0xcc
	float LastLocalNoiseTime; // 0xd0
};

struct UMaterialExpressionDeriveNormalZ {
	FExpressionInput InXY; // 0x40
};

struct UCrowWorldMapLocationSlot {
	bool bIsHorizontal; // 0x348
	UWidgetSwitcher* WS; // 0x350
	UImage* H_LeftSpacer; // 0x358
	UImage* H_RightSpacer; // 0x360
	UImage* V_LeftSpacer; // 0x368
	UImage* V_RightSpacer; // 0x370
	UTextBlock* TB_HLocation; // 0x378
	UTextBlock* TB_VLocation; // 0x380
};

struct UPostProcessComponent {
	FPostProcessSettings Settings; // 0x200
	float Priority; // 0x750
	float BlendRadius; // 0x754
	float BlendWeight; // 0x758
	char bEnabled : 1; // 0x75c
	char bUnbound : 1; // 0x75c
};

struct UAREnvironmentCaptureProbe {
	FVector Extent; // 0xf8
	UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture; // 0x108
};

struct UCrowWorldSyncHubConfig {
	FCrowWorldSyncDataSetting SyncDataSetting; // 0x28
	FCrowWorldGenerateSubLevelSetting EditorSubLevelSetting; // 0x40
	FCrowWorldGenerateHLODSetting EditorHLODSetting; // 0xa8
};

struct ULandscapeSplinesComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x440
	TArray<ULandscapeSplineSegment*> Segments; // 0x450
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x460
};

struct ACrowRocketLauncherTrail {
	UParticleSystem* TrailParticle; // 0x220
	UParticleSystemComponent* TrailParticleSystemComp; // 0x228
};

struct AGameStateBase {
	AGameModeBase* GameModeClass; // 0x220
	AGameModeBase* AuthorityGameMode; // 0x228
	ASpectatorPawn* SpectatorClass; // 0x230
	TArray<APlayerState*> PlayerArray; // 0x238
	bool bReplicatedHasBegunPlay; // 0x248
	float ReplicatedWorldTimeSeconds; // 0x24c
	float ServerWorldTimeSecondsDelta; // 0x250
	float ServerWorldTimeSecondsUpdateFrequency; // 0x254
};

struct UProceduralShapeToolProperties {
	bool bInstanceIfPossible; // 0x60
	EMakeMeshPolygroupMode PolygroupMode; // 0x61
	EMakeMeshPlacementType PlaceMode; // 0x62
	bool bSnapToGrid; // 0x63
	EMakeMeshPivotLocation PivotLocation; // 0x64
	float Rotation; // 0x68
	bool bAlignShapeToPlacementSurface; // 0x6c
};

struct UEndMatchCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UCrowItemInfoWidget {
	UCanvasPanel* CP_Main; // 0x350
	UCanvasPanel* CP_Desc; // 0x358
	UCanvasPanel* CP_EquipArmorInfo; // 0x360
	UWidgetSwitcher* WS_Title; // 0x368
	UImage* IMG_FirstKeyX; // 0x370
	UImage* IMG_SecondKeyX; // 0x378
	UTextBlock* TB_ItemCategory; // 0x380
	UTextBlock* TB_ItemName; // 0x388
	UTextBlock* TB_TitleText; // 0x390
	UTextBlock* TB_Amount; // 0x398
	UTextBlock* TB_FirstKey; // 0x3a0
	UTextBlock* TB_SecondKey; // 0x3a8
	UTextBlock* TB_ThirdKey; // 0x3b0
	UTextBlock* TB_PartsName; // 0x3b8
	UTextBlock* TB_HelpText; // 0x3c0
	UTextBlock* TB_Desc; // 0x3c8
	URichTextBlock* RTB_ItemGrade; // 0x3d0
	UImage* IMG_Bg_ItemGrade; // 0x3d8
	UImage* IMG_EquipPartsSlot_ItemGrade; // 0x3e0
	UCrowProgressBar* CPB_EquipProgressBar; // 0x3e8
	UHorizontalBox* HB_Equip; // 0x3f0
	UHorizontalBox* HB_Get; // 0x3f8
	UCanvasPanel* CP_MyWeapon; // 0x400
	USizeBox* SB_WeaponPartsInfo; // 0x408
	UCrowWeaponPartsListWidget* WB_WeaponPartsList; // 0x410
	UCrowWeaponPartsListWidget* WB_WeaponPartsList_Equip; // 0x418
	UCrowWidgetImage* IMG_Item; // 0x420
	UCrowWidgetImage* IMG_weapon00; // 0x428
	UCrowWidgetImage* IMG_weapon01; // 0x430
	UCrowWidgetImage* IMG_weapon02; // 0x438
	UCanvasPanel* CP_Helmet; // 0x440
	UCanvasPanel* CP_Armor; // 0x448
	UCanvasPanel* CP_ArmorInfo; // 0x450
	UCanvasPanel* CP_UseWeapon; // 0x458
	UProgressBar* PB_ArmorBar; // 0x460
	UProgressBar* PB_HelmetBar; // 0x468
	UTextBlock* TB_Armor; // 0x470
	UTextBlock* TB_Helmet; // 0x478
	UTextBlock* TB_CannotEquip; // 0x480
	UTextBlock* TB_ItemName_Equipped; // 0x488
	UTextBlock* TB_EquipWeaponCategory; // 0x490
	UCanvasPanel* CP_EquipParts; // 0x498
	UCanvasPanel* CP_EquipPartsSlot; // 0x4a0
	UCrowWidgetImage* IMG_PartsEquipWeapon; // 0x4a8
	UCrowWidgetImage* IMG_Parts_Equipped; // 0x4b0
	UCrowWidgetImage* IMG_Parts; // 0x4b8
	UImage* IMG_Arrow; // 0x4c0
	UWidgetSwitcher* WS_ItemGrade_Equip; // 0x4c8
	USizeBox* SB_WeaponPartsInfo_Equip; // 0x4d0
	UWidgetSwitcher* WS_ThirdKey; // 0x4d8
	UTextBlock* TB_EquipArmorPercent; // 0x4e0
	UProgressBar* PB_EquipArmorBar; // 0x4e8
	UWidgetSwitcher* WS_ItemGrade; // 0x4f0
	UWidgetSwitcher* WS_ItemGrade_Parts; // 0x4f8
	UWidgetSwitcher* WS_Status; // 0x500
	UWidgetSwitcher* WS_ItemDetail_Equipped; // 0x508
	UWidgetSwitcher* WS_DescKey; // 0x510
	UWidgetSwitcher* WS_FirstKey; // 0x518
	UWidgetSwitcher* WS_SecondKey; // 0x520
	UWidgetSwitcher* WS_ItemDetail; // 0x528
	UWidgetSwitcher* WS_ArmorGauge; // 0x530
	UCrowInputMappingWidget* RTB_FirstKey; // 0x538
	UCrowInputMappingWidget* RTB_SecondKey; // 0x540
	UCrowInputMappingWidget* RTB_DeskKey_Brief; // 0x548
	UCrowInputMappingWidget* RTB_DeskKey_Detail; // 0x550
	float EquipTime; // 0x558
	UImage* IMG_FirstKey; // 0x560
	UImage* IMG_SecondKey; // 0x568
	UPaperSprite* MouseLeftButton; // 0x570
	UPaperSprite* MouseWheelButton; // 0x578
	UPaperSprite* FKeySprite; // 0x580
	UPaperSprite* XKeySprite; // 0x588
	ACrowCharacterPawn* CrowCharacterPawn; // 0x590
	UCrowGameInvenComponent* InvenComp; // 0x598
	ACrowItemBase* TargetItem; // 0x5a0
	FText EquipText; // 0x5a8
	FText SecondText; // 0x5c0
	bool IsEquip; // 0x5d8
	bool IsGet; // 0x5d9
	bool IsEquipTimeComplete; // 0x5da
	UCrowInvenItemSlot* CurrentInvenItemSlot; // 0x5e0
	char PartsEquipSlot; // 0x5f3
	ACrowPickupInventory* CurrPickupInventory; // 0x5f8
	int32_t PickupInvenSlot; // 0x600
	TArray<UCrowWidgetImage*> CanEquipWeaponImages; // 0x608
};

struct UCrowTopBarDescWidget {
	UWidgetSwitcher* WS_TopBar_Desc; // 0x348
};

struct UDrawPolygonToolSnapProperties {
	bool bEnableSnapping; // 0x60
	bool bSnapToWorldGrid; // 0x61
	bool bSnapToVertices; // 0x62
	bool bSnapToEdges; // 0x63
	bool bSnapToAngles; // 0x64
	bool bSnapToLengths; // 0x65
	float SegmentLength; // 0x68
	bool bHitSceneObjects; // 0x6c
	float HitNormalOffset; // 0x70
};

struct UCrowWeaponPartItemWidget {
	UImage* IMG_Frame; // 0x670
	UCrowWidgetImage* IMG_PartsIcon; // 0x678
	UCrowDragDropWidgetBase* WB_CrowDragDropPanel; // 0x680
	UCrowInvenWeaponInfoWidget* WeaponInfoWidget; // 0x688
	ECrowWeaponPartsType PartsType; // 0x690
	bool IsDefaultParts; // 0x691
	FCrowItemData InvenData; // 0x698
};

struct UCrowWeaponStateBase {
	ACrowWeaponBase* WeaponBase; // 0x28
	ACrowCharacterPawn* CharacterOwner; // 0x30
};

struct UARTrackedPose {
	FARPose3D TrackedPose; // 0xf8
};

struct URendererOverrideSettings {
	char bSupportAllShaderPermutations : 1; // 0x38
	char bForceRecomputeTangents : 1; // 0x38
};

struct UAkAssetPlatformData {
	UAkAssetData* CurrentAssetData; // 0x28
};

struct UCrowRadialButtonConquestSkill {
	FLinearColor EnableTextColor; // 0x3c8
	FLinearColor DisableTextColor; // 0x3d8
	UImage* IMG_DisableBG; // 0x3e8
	UCanvasPanel* CP_CoolTimeContents; // 0x3f0
	UTextBlock* TB_CoolTime; // 0x3f8
};

struct UParticleModuleAccelerationDragScaleOverLife {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct UCrowWidgetIconToggleButton {
	UImage* IMG_Icon; // 0x5a8
	UImage* IMG_SelectIcon; // 0x5b0
	FSlateBrush ButtonIcon; // 0x5b8
	FSlateBrush ButtonSelectIcon; // 0x640
};

struct ACrowWorldPropLocator {
	float Radius; // 0x220
	int32_t RandomSeed; // 0x224
	int32_t DuplicateCount; // 0x228
	FCrowWorldPropLocatorSetting Setting; // 0x22c
	TArray<UObject*> PropAssets; // 0x248
	bool SkipRearrange; // 0x258
	USphereComponent* Sphere; // 0x260
	TArray<FCrowWorldPropLocatorItem> PropItems; // 0x268
};

struct UPhysicsThrusterComponent {
	float ThrustStrength; // 0x1f8
};

struct UCrowWorldTrigger {
	ACrowWorldActor* WorldActor; // 0x440
	UCrowWorldAnimator* WorldAnimator; // 0x448
	int16_t LayoutItemIndex; // 0x450
	ECrowWorldGeomType GeometryType; // 0x452
	ECrowWorldTriggerType TriggerType; // 0x453
	int8_t TriggerState; // 0x454
	UBodySetup* TriggerBodySetup; // 0x458
	FString LocalTextKey_Open; // 0x460
	FString LocalTextKey_Close; // 0x470
};

struct ABP_CrowCharacterPawn_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1b10
	UCrowFoliageAffectorComponent* CrowFoliageAffector; // 0x1b18
	UBoxComponent* Box_Trigger; // 0x1b20
	UBoxComponent* Box_Interaction; // 0x1b28
	UCrowTriggerComponent* CrowTrigger_Revive; // 0x1b30
};

struct UFloatingPawnMovement {
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	char bPositionCorrected : 1; // 0x148
};

struct ACrowMissionArea {
	UBoxComponent* Root; // 0x228
	USceneComponent* IconLocation; // 0x230
	UStaticMeshComponent* AreaRotation; // 0x238
	TArray<ECrowGameMode> EnableGameModes; // 0x240
	bool bIsEnableIndicatorPing; // 0x250
	float IndicatorPingLifeTime; // 0x254
	TMap<uint32_t, FCrowActorOverlapRef> ActorOverlapRefMap; // 0x258
	TArray<UShapeComponent*> CollisionShapeArray; // 0x2a8
	TArray<UCrowMissionAreaComponent*> ComponentArray; // 0x2b8
	UCrowMissionAreaRespawn* RespawnComponent; // 0x2c8
	uint32_t AreaID; // 0x2d0
};

struct UUniformVector {
	float Magnitude; // 0xb0
	FVector Direction; // 0xb4
};

struct UUPSEnemyPointActionComponent {
	ACharacter* CharacterOnPoint; // 0x1f8
	FGameplayTag PointTag; // 0x218
	UAnimSequenceBase* PreviewAnim; // 0x220
	float PreviewAnimStartTime; // 0x228
	float ArrowSize; // 0x22c
	float ArrowOffset; // 0x230
	float BillboardSize; // 0x234
	FRotator MeshRotationOffset; // 0x238
	bool bOverrideProjectSettingsMesh; // 0x244
	bool bOverrideProjectSettingsMaterial; // 0x245
	bool bOverrideProjectSettingsSprite; // 0x246
	USkeletalMesh* OverrideEnemyActionPointComponentMesh; // 0x248
	UMaterialInterface* OverrideEnemyActionPointComponentMeshMaterial; // 0x250
	UTexture2D* OverrideEnemyActionPointComponentBillboardSprite; // 0x258
};

struct UCrowClanUserSlotWidget {
	UCrowButton* BT_Slot_ClanUserList; // 0x348
	UWidgetSwitcher* WS_Slot_UserList; // 0x350
	UImage* IMG_Selected; // 0x358
	UWidgetSwitcher* WS_UserMark; // 0x360
	UImage* IMG_UserMark; // 0x368
	UImage* IMG_UserList_ClassMark; // 0x370
	UTextBlock* TB_UserList_Level; // 0x378
	UTextBlock* TB_UserList_Name; // 0x380
	UWidgetSwitcher* WS_OddSwitcher; // 0x388
	UWidgetSwitcher* WS_Online_Offline; // 0x390
	UTextBlock* TB_UserList_ClanPoint; // 0x398
	UTextBlock* TB_UserList_LastPlayTime; // 0x3a0
	UCanvasPanel* CP_Offline; // 0x3a8
	UCrowButton* WB_BT_Invited; // 0x3b0
	UImage* IMG_UserInvite_ClassMark; // 0x3b8
	UTextBlock* TB_UserInvite_Level; // 0x3c0
	UTextBlock* TB_UserInvite_Name; // 0x3c8
	UCrowButton* WB_BT_Cancel; // 0x3d0
	UImage* IMG_UserCancel_ClassMark; // 0x3d8
	UTextBlock* TB_UserCancel_Level; // 0x3e0
	UTextBlock* TB_UserCancel_Name; // 0x3e8
	UCrowButton* WB_BT_JoinSetOK; // 0x3f0
	UCrowButton* WB_BT_JoinSetCancel; // 0x3f8
	UImage* IMG_UserJoinSet_ClassMark; // 0x400
	UTextBlock* TB_UserJoinSet_Level; // 0x408
	UTextBlock* TB_UserJoinSet_Name; // 0x410
};

struct UBTTaskNode {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct UCrowCompassInfoWIdget {
	UMaterialInstance* CompassMaterialIns; // 0x348
	UMaterialInstanceDynamic* CompassMaterialInsDynamic; // 0x350
	UTextBlock* TB_CurrentAngle; // 0x358
	UImage* IMG_Compass; // 0x360
	UImage* IMG_EnemyFire_Left; // 0x368
	UImage* IMG_EnemyFire_Right; // 0x370
	URetainerBox* RetainerBox_EnemyFire; // 0x378
	UOverlay* Overlay_EnemyFire; // 0x380
	UUserWidget* EnemyFireMarker; // 0x388
	TArray<UCrowCompassEnemyFireMarker*> EnemyFireMarkerArray; // 0x390
};

struct UCrowChatMessageItem {
	UTextBlock* TB_ChatType; // 0x348
	URichTextBlock* TB_ChatMessage; // 0x350
	URichTextBlock* TB_ChatSystemMessage; // 0x358
	UCrowButton* BT_WisperChat; // 0x360
	UWidgetSwitcher* WS_ChatMessage; // 0x368
	FCrowChatData ChatData; // 0x370
};

struct UCrowImpactDamageControl {
	float HideObjectSecond; // 0xc0
	float MultiplyImpulse; // 0xc4
	float TireDestroyDistanceDriven; // 0xc8
	bool bIsTakeDamageImpulse; // 0xcc
	float TakeMultiplyImpactDamage; // 0xd0
	float MultiplyImpactDivideDamge; // 0xd4
	bool bIsTakeDamageUnderCharacter; // 0xd8
	float IgnoreOtherActorTakeDamage; // 0xdc
	TMap<FName, FST_BrokenBone> ArrayCanBrokenBones; // 0xe0
	TMap<FName, FST_DamageMaterial> ArrayDamageMaterials; // 0x130
	TMap<FName, FST_DamageWheel> ArrayCanBrokenWheel; // 0x180
	TArray<FName> IgnorePrimitiveNames; // 0x1d0
	UDamageType* DamageType; // 0x1e0
	USkeletalMeshComponent* BodySKC; // 0x1e8
	float BodyMass; // 0x1f0
	FTimerHandle TickTimerHandle; // 0x1f8
	TMap<int32_t, FST_PreImpactInfo> ImpactActorInfos; // 0x200
	TMap<FName, float> ImpactBoneInfos; // 0x250
	TMap<FName, float> BonesToHide; // 0x2a0
	float fImpactDivideDamage; // 0x2f0
	float LastSpawnImpactFxTime; // 0x2f4
};

struct AOnlineBeaconClient {
	AOnlineBeaconHostObject* BeaconOwner; // 0x250
	UNetConnection* BeaconConnection; // 0x258
	EBeaconConnectionState ConnectionState; // 0x260
};

struct UCrowRecordWeaponInfoWidget {
	UWidgetSwitcher* WSWeaponInfo; // 0x348
	UTextBlock* TBKill; // 0x350
	UTextBlock* TBHeadShot; // 0x358
	UTextBlock* TBFaint; // 0x360
	UTextBlock* TBLv; // 0x368
	UProgressBar* PBExp; // 0x370
	UTextBlock* TBExp; // 0x378
	UTextBlock* TBMaxExp; // 0x380
	UTextBlock* TBKill_2; // 0x388
	UTextBlock* TBFaint_2; // 0x390
	UTextBlock* TBUse_2; // 0x398
	UTextBlock* TBLv_2; // 0x3a0
	UProgressBar* PBExp_2; // 0x3a8
	UTextBlock* TBExp_2; // 0x3b0
	UTextBlock* TBMaxExp_2; // 0x3b8
	UTextBlock* TBUse_3; // 0x3c0
	UTextBlock* TBLv_3; // 0x3c8
	UProgressBar* PBExp_3; // 0x3d0
	UTextBlock* TBExp_3; // 0x3d8
	UTextBlock* TBMaxExp_3; // 0x3e0
	UTextBlock* TBFaint_4; // 0x3e8
	UTextBlock* TBAssi_4; // 0x3f0
	UTextBlock* TBLv_4; // 0x3f8
	UProgressBar* PBExp_4; // 0x400
	UTextBlock* TBExp_4; // 0x408
	UTextBlock* TBMaxExp_4; // 0x410
};

struct AChaosSolverActor {
	FChaosSolverConfiguration Properties; // 0x220
	float TimeStepMultiplier; // 0x288
	int32_t CollisionIterations; // 0x28c
	int32_t PushOutIterations; // 0x290
	int32_t PushOutPairIterations; // 0x294
	float ClusterConnectionFactor; // 0x298
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x29c
	bool DoGenerateCollisionData; // 0x29d
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2a0
	bool DoGenerateBreakingData; // 0x2b0
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x2b4
	bool DoGenerateTrailingData; // 0x2c4
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x2c8
	float MassScale; // 0x2d8
	bool bGenerateContactGraph; // 0x2dc
	bool bHasFloor; // 0x2dd
	float FloorHeight; // 0x2e0
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x2e4
	UBillboardComponent* SpriteComponent; // 0x2e8
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x308
};

struct UListView {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct UCrowESCMenuWidget {
	UCrowButton* BT_Continue; // 0x368
	UCrowButton* BT_Settings; // 0x370
	UCrowButton* BT_ReturnToLobby; // 0x378
	UCrowButton* BT_Quit; // 0x380
	UTextBlock* TB_Continue; // 0x388
	UTextBlock* TB_Settings; // 0x390
	UTextBlock* TB_ReturnToLobby; // 0x398
	UTextBlock* TB_Quit; // 0x3a0
};

struct UCrowRespawnButton {
	float ButtonSize; // 0x348
	UCrowToggleButton* BT_ConquestRespawn; // 0x350
	UCanvasPanel* CP_Root; // 0x358
	UCrowWidgetBase* ParentWidget; // 0x360
	UCrowWorldMapIcon* WorldMapIcon; // 0x368
	UCrowRespawnMapWidget* RespawnMapWidget; // 0x370
	AActor* TargetActor; // 0x378
};

struct UCrowWidgetPIEEntry {
	UEditableText* ET_IP; // 0x348
	UEditableText* ET_Port; // 0x350
	UButton* BTN_Connect; // 0x358
};

struct UAnimationDataSourceRegistry {
	TMap<FName, TWeakObjectPtr<UObject>> DataSources; // 0x28
};

struct UPhysicalMaterial {
	float Friction; // 0x28
	float StaticFriction; // 0x2c
	EFrictionCombineMode FrictionCombineMode; // 0x30
	bool bOverrideFrictionCombineMode; // 0x31
	float Restitution; // 0x34
	EFrictionCombineMode RestitutionCombineMode; // 0x38
	bool bOverrideRestitutionCombineMode; // 0x39
	float Density; // 0x3c
	float SleepLinearVelocityThreshold; // 0x40
	float SleepAngularVelocityThreshold; // 0x44
	int32_t SleepCounterThreshold; // 0x48
	float RaiseMassToPower; // 0x4c
	float DestructibleDamageThresholdScale; // 0x50
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x58
	EPhysicalSurface SurfaceType; // 0x60
};

struct UCrowLobbyLoadoutWidget {
	UCrowLoadoutWeaponInfoWidget* WB_Loadout_WeaponInfo_Primary_2; // 0x348
	UCrowLoadoutWeaponInfoWidget* WB_Loadout_WeaponInfo_Primary_3; // 0x350
	UCrowLoadoutWeaponSubInfoWidget* WB_Loadout_SubWeapon_Slot1; // 0x358
	UCrowLoadoutWeaponSubInfoWidget* WB_Loadout_SubWeapon_Slot2; // 0x360
	TArray<UCrowWeaponListItemBase*> WeaponWidgetList; // 0x368
};

struct USoundNodeGroupControl {
	TArray<int32_t> GroupSizes; // 0x48
};

struct UMaterialExpressionSpriteTextureSampler {
	bool bSampleAdditionalTextures; // 0x80
	int32_t AdditionalSlotIndex; // 0x84
	FText SlotDisplayName; // 0x88
};

struct UAudioImpulseResponse {
	TArray<float> ImpulseResponse; // 0x28
	int32_t NumChannels; // 0x38
	int32_t SampleRate; // 0x3c
	float NormalizationVolumeDb; // 0x40
	bool bTrueStereo; // 0x44
	TArray<float> IRData; // 0x48
};

struct UAnimationSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct UBlackboardKeyType_Enum {
	UEnum* EnumType; // 0x30
	FString enumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UCrowClanListSlotWidget {
	UCrowClanEmblemWidget* WB_Info_ClanEmblem; // 0x358
	UWidgetSwitcher* WS_Slot_ClanList; // 0x360
	UWidgetSwitcher* WS_JoinState; // 0x368
	UWidgetSwitcher* WS_ClanListSubType; // 0x370
	UCrowButton* WB_BT_JoinAccept; // 0x378
	UCrowButton* WB_BT_JoinAdmiss; // 0x380
	UTextBlock* TB_Join_ClanLevel; // 0x388
	UTextBlock* TB_Join_ClanName; // 0x390
	UTextBlock* TB_ContributionPoint; // 0x398
	UTextBlock* TB_Join_ClanMemberCurrent; // 0x3a0
	UTextBlock* TB_Join_ClanMemberMax; // 0x3a8
	UCrowButton* WB_BT_ReceptionAccept; // 0x3b0
	UCrowButton* WB_BT_ReceptionAdmiss; // 0x3b8
	UCrowButton* WB_BT_Cancel; // 0x3c0
	UTextBlock* TB_Reception_ClanLevel; // 0x3c8
	UTextBlock* TB_Reception_ClanName; // 0x3d0
	UTextBlock* TB_Sent_ClanLevel; // 0x3d8
	UTextBlock* TB_Sent_ClanName; // 0x3e0
	UTextBlock* TB_RankNum; // 0x3e8
	UTextBlock* TB_Rank_ClanLevel; // 0x3f0
	UTextBlock* TB_Ranking_ClanName; // 0x3f8
	UTextBlock* TB_Rank_ContributionPoint; // 0x400
	UCrowClanEmblemWidget* WB_Rank_ClanEmblem; // 0x408
	UWidgetSwitcher* WS_OddSwitcher; // 0x410
};

struct UCrowCustomSprayItemListWidget {
	UCrowCustomizeSpraySlotWidget* SpraySlotWidgetClass; // 0x350
	UGridPanel* GD_ItemList; // 0x358
	UCrowCustomizeEtcDescWidget* ParentWidget; // 0x360
	UCrowCustomizeSpraySlotWidget* CurrSelectSlot; // 0x368
};

struct ACrowProjectileMeshBase {
	UStaticMeshComponent* MeshRoot; // 0x17c8
};

struct UCrowLobbySlotPurchasePopupWidget {
	UCrowLobbySlotPurchaseItemWidget* PurchaseItemClass; // 0x348
	UTextBlock* TB_Title; // 0x350
	UTextBlock* TB_SlotName; // 0x358
	UVerticalBox* VB_ItemList; // 0x360
	UCrowButton* BT_Close; // 0x368
	ECrowLobbySlotType LobbySlotType; // 0x370
	int32_t TargetSlotIndex; // 0x374
	FText TargetName; // 0x378
};

struct UBTComposite_SimpleParallel {
	EBTParallelMode FinishMode; // 0x90
};

struct ACrowWorldSimulationActor {
	USceneComponent* SceneRoot; // 0x220
	USceneComponent* ImpactPoint; // 0x228
	char UseMassMultiply : 1; // 0x230
	float MassMultiply; // 0x234
	FCrowWorldDestructionFxHitGround FxHitGroundSetting; // 0x238
	TArray<UFXSystemComponent*> FxComponents; // 0x268
	FName CollisionProfileName; // 0x278
	FVector ImpactLocation; // 0x280
	FVector ImpactNormal; // 0x28c
	float ImpulseMagnitude; // 0x298
	float PendingTime; // 0x29c
	float DestroyTime; // 0x2a0
	float ElapsedTime; // 0x2a4
	int32_t CountHiddenSMC; // 0x2a8
	TArray<UStaticMeshComponent*> SMCList; // 0x2b0
	FTimerHandle DestroyTimerHandle; // 0x2c0
};

struct ACrowSkydivingPawn {
	ECrowSkydivingState SkydivingState; // 0x4b8
	ECrowSkydivingState LocalSkydivingState; // 0x4b9
	ECrowSkydivingAnimState SkydivingAnimState; // 0x4ba
	FName ParachuteSpreadKeyName; // 0x4bc
	FName LeftHandSocketName; // 0x4c4
	FName RightHandSocketName; // 0x4cc
	FName SpineSocketName; // 0x4d4
	float RecoverLookAroundSpeed; // 0x4dc
	float GodModeTime; // 0x4e0
	UMaterialInstance* BlurMaterialInst; // 0x4e8
	UMaterialInstanceDynamic* BlurMaterialInstDynamic; // 0x4f0
	float BlurMaxVelocityZ; // 0x4f8
	float BlurDistParam; // 0x4fc
	float DisapearTimeSecond; // 0x500
	ECrowSkydivingParachuteState ParachuteState; // 0x504
	uint32_t ParachuteSkinIndex; // 0x508
	FName ParachuteSocketName; // 0x50c
	bool bUseParachuteBoneTransform; // 0x514
	UAnimSequence* ParachuteAnimSpread; // 0x518
	UAnimSequence* ParachuteAnimFall; // 0x520
	UAnimSequence* ParachuteAnimLand; // 0x528
	uint32_t DefaultClothBackpackIndex; // 0x530
	UAkAudioEvent* FreeFallSound; // 0x538
	UAkAudioEvent* FreeFallSound_End; // 0x540
	UAkAudioEvent* ParachuteSound; // 0x548
	UAkAudioEvent* ParachuteSound_End; // 0x550
	UAkComponent* AkComponent; // 0x558
	bool bForceThirdCamera; // 0x560
	UMatineeCameraShake* FreeFallCameraShakeClass; // 0x568
	float ViewPitchDirectionValue; // 0x570
	float FreeFallAnimRollChangeValue; // 0x574
	float FreeFallAnimRollInSpeed; // 0x578
	float FreeFallAnimRollOutSpeed; // 0x57c
	float ReadyToSpreadParachuteHeight; // 0x580
	float ParachuteSpreadLimitZ; // 0x584
	float ReadyToLandLimitZ; // 0x588
	float ReadyToLandLimitZWood; // 0x58c
	float ParachuteApproachTime; // 0x590
	float MinViewPitchDirectionRate; // 0x594
	float ReadyToLandVelocityScale; // 0x598
	FString FreeFallDialogRowName; // 0x5a0
	FString ParachuteDialogRowName; // 0x5b0
	FVector AddedFarViewSocketOffset; // 0x5c0
	FCrowSkydivingSettingss NoneSettings; // 0x5d0
	FCrowSkydivingSettingss FreeFallSettings; // 0x668
	FCrowSkydivingSettingss ParachuteSpreadSettings; // 0x700
	FCrowSkydivingSettingss ParachuteSettings; // 0x798
	FCrowSkydivingSettingss ReadyToLandSettings; // 0x830
	FCrowSkydivingSettingss LandSettings; // 0x8c8
	float WalkLandSpeed; // 0x960
	float RollingLandSpeed; // 0x964
	UAnimMontage* WalkLandAnim; // 0x968
	UAnimMontage* RollingLandAnim; // 0x970
	float ForwardRate; // 0x978
	float RightRate; // 0x97c
	float DownRate; // 0x980
	float DefaultMinScaleValue; // 0x984
	float DefaultIdleScaleValue; // 0x988
	float ForwardMaxScaleValue; // 0x98c
	float InputYawScale; // 0x990
	float InputPitchScale; // 0x994
	float InputRollScale; // 0x998
	float AnimationAxisForwardValueScale; // 0x99c
	float AnimationAxisRightValueScale; // 0x9a0
	FVector TargetCameraSocketOffset; // 0x9a4
	FRotator CameraRotation; // 0x9b0
	UCameraShakeBase* FreeFallCameraShake; // 0x9c0
	float ViewPitchDirectionRate; // 0x9c8
	float ControlRotYawInterpValue; // 0x9cc
	float AnimationAxisForwardValue; // 0x9d0
	float AnimationAxisRightValue; // 0x9d4
	float AnimationAxisRollValue; // 0x9d8
	ACrowCharacterPawn* CharacterPawn; // 0x9e0
	UCrowSpringArmComponent* TPSpringArm; // 0x9e8
	float LandHeight; // 0x9f0
	float DistanceLandToMe; // 0x9f4
	float StateTimeSecond; // 0x9f8
	float CameraDirectingTimeSecond; // 0x9fc
	float GlobalTimeSecond; // 0xa00
	bool bLookAround; // 0xa04
	bool bRecoverLookAround; // 0xa05
	FRotator RecoverLookingRotation; // 0xa08
	bool bFarView; // 0xa14
	bool bUpdateCameraTransform; // 0xa15
	bool bIsReadyToParachuteSpread; // 0xa16
	bool bIsInitCharacterPawn; // 0xa17
	bool bIsReadyLocalCharacterSetting; // 0xa18
	bool bEquipDefaultClothBackpack; // 0xa19
	bool bRevertFirstCamera; // 0xa1a
	bool bOnWater; // 0xa1b
	float ApproachAlpha; // 0xa1c
	float PrevAxisForwardValue; // 0xa20
	char AxisForwardState; // 0xa24
	char AxisRightState; // 0xa25
	ACrowPlayerControllerBase* PC; // 0xa28
	ACrowPlayerStateBase* PS; // 0xa30
	bool bIsCameraBlendComplete; // 0xa40
	bool bIsChangeFreeFallSection; // 0xa41
	bool bIsChangeParachuteSection; // 0xa42
	bool bIsChangeLandSection; // 0xa43
	FVector ReadyToLandPos; // 0xa44
	float ReadyToLandSpeed; // 0xa50
	bool bIsSpectating; // 0xa54
	bool bUseLagSubstepping; // 0xa55
	float RotationLagSpeed; // 0xa58
	FRotator PrevControlRotation; // 0xa5c
	float LagMaxTimeStep; // 0xa68
	bool bIsCameraDirecting; // 0xa6c
	float SkydivingTargetArmLength; // 0xa70
	FRotator SkydivingCameraForward; // 0xa74
	FRotator SkydivingActorRotation; // 0xa80
	bool bCheckGSTSpreadParachute; // 0xa8f
	bool bCheckGSTReadToLand; // 0xa90
	bool bCheckGSTLand; // 0xa91
	bool bCheckGSTNone; // 0xa92
	bool bCheckHit; // 0xa93
	bool bUseSceneTableValue; // 0xa94
	ECrowSkydivingAnimState PlayLandAnimState; // 0xa95
	ECrowSkydivingState PlayCameraDirectionState; // 0xa96
	bool bIsPlayCameraDirection; // 0xa97
	UArrowComponent* VelArrow; // 0xa98
	UArrowComponent* VelArrowX; // 0xaa0
	UArrowComponent* VelArrowY; // 0xaa8
	UArrowComponent* VelArrowZ; // 0xab0
	bool bShowDebugSkydivingPawn; // 0xab8
	bool bDebugFreeFallCameraShake; // 0xab9
};

struct UCrowWorldSyncClientWorker {
	char bInitControllerRequested : 1; // 0x28
	char bEnabledVisualConfig : 1; // 0x28
	int32_t ClientFrameKey; // 0x2c
	UWorld* World; // 0x30
	APlayerController* PlayerController; // 0x38
	UCrowWorldMapConfig* MapConfig; // 0x40
	UCrowWorldDataCollectionAsset* WorldDataAsset; // 0x48
	ACrowWorldReplicationActor* ReplicationActor; // 0x50
	ACrowWorldReplicationController* ReplicationController; // 0x58
	FCrowWorldGrid SectorGrid; // 0x60
	UCrowWorldLODUpdater* LODUpdater; // 0x78
	UCrowWorldOcclusion* WorldOcclusion; // 0x80
	UCrowWorldFoliage* WorldFoliage; // 0x88
	UCrowWorldTerrainSetup* WorldTerrainSetup; // 0x90
	TArray<UFXSystemComponent*> FollowingFxComponents; // 0x98
	TArray<FCrowWorldMaterialParameterOverride> MPCBackups; // 0xa8
	TArray<FCrowWorldMaterialParameterOverride> MPCRestores; // 0xb8
	TMap<uint32_t, FCrowWorldSectorData> SectorDataAssets; // 0xc8
	TMap<uint32_t, FCrowWorldClusterData> ClusterDataAssets; // 0x118
	FCrowWorldLandmarkData LandmarkDataAsset; // 0x168
	TMap<UObject*, int32_t> AssetReferenceCounts; // 0x178
	FCrowWorldReplicationLandmark ActiveLandmarkData; // 0x1c8
	TMap<uint32_t, FCrowWorldClientCluster> ActiveClusters; // 0x1e0
	TMap<uint32_t, FCrowWorldClientSector> ActiveSectors; // 0x230
	TMap<uint32_t, ACrowWorldActor*> ActiveActors; // 0x280
	int32_t DebugFrameCount; // 0x2d0
	TArray<FCrowWorldReplicationCluster> ReceivedClusters; // 0x2d8
	TArray<FCrowWorldReplicationSector> ReceivedSectors; // 0x2e8
	TArray<FCrowWorldClientDropClusterIndex> ReceivedDropClusters; // 0x2f8
	TArray<FCrowWorldClientDropSectorIndex> ReceivedDropSectors; // 0x308
	TArray<ACrowWorldActor*> DropClusterActorQueue; // 0x318
	TArray<ACrowWorldActor*> DropSectorActorQueue; // 0x328
	uint32_t GeneratingSectorIndex; // 0x338
	TArray<FCrowWorldClientClusterActorKey> ClusterActorKeyArray; // 0x340
	int16_t GeneratingClusterActorKeyCursor; // 0x350
	int16_t GeneratingSectorActorCursor; // 0x352
	int16_t CollectAssetLayoutCursor; // 0x354
	FCrowWorldDestructionLink DestructionLink; // 0x358
};

struct UWB_SettingsSlotOnOff_C {
	UImage* IMG_BG; // 0x380
	UImage* IMG_Blue00; // 0x388
	UImage* IMG_Frame; // 0x390
	UImage* IMG_OffBG; // 0x398
	UImage* IMG_OnBG; // 0x3a0
};

struct USteamNetConnection {
	bool bIsPassthrough; // 0x1b90
};

struct UWB_SettingsSlotDropdown_C {
	UImage* Image_20; // 0x3a0
	UImage* IMG_Frame; // 0x3a8
	UImage* IMG_Icon_Arrow; // 0x3b0
	UImage* IMG_ListBg; // 0x3b8
};

struct AUPSPointActionMovementHandler {
	ACharacter* MovementCharacter; // 0x238
	UUPSEnemyPointActionComponent* PointActionComponent; // 0x240
};

struct UGroomCreateBindingOptions {
	USkeletalMesh* SourceSkeletalMesh; // 0x28
	USkeletalMesh* TargetSkeletalMesh; // 0x30
	int32_t NumInterpolationPoints; // 0x38
	int32_t MatchingSection; // 0x3c
};

struct UMaterialExpressionDotProduct {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UCrowShopMainWidget {
	UCrowShopItemSlotWidget* CategoryItemWidget; // 0x348
	UCrowShopItemSlotWidget* CategoryItemWideWidget; // 0x350
	UCrowShopPackagePopupWidget* ShopPackagePopupWidgetclass; // 0x358
	UCrowChangeNicknameWidget* ChangeNicnameWidgetClass; // 0x360
	UCrowRandomBoxInfoWidget* RandomBoxInfoWidgetClass; // 0x368
	float DesconstructEffectTime; // 0x370
	UCrowShopItemSlotWidget* CurrSelectSlotWidget; // 0x378
	UCrowWidgetToggleButton* WB_LobbyButton_HOTNEW; // 0x380
	UCrowWidgetToggleButton* WB_LobbyButton_Basic; // 0x388
	UCrowWidgetToggleButton* WB_LobbyButton_Package; // 0x390
	UCrowWidgetToggleButton* WB_LobbyButton_Battlepass; // 0x398
	UCrowWidgetToggleButton* WB_LobbyButton_Deconstrct; // 0x3a0
	UCanvasPanel* CP_HotandNew; // 0x3a8
	UCanvasPanel* CP_Normal_Package_Shop; // 0x3b0
	UCrowShopCategoryWidget* WB_ShopCategory; // 0x3b8
	UCrowShopSlotDropDownWidget* WB_Shop_SlotDropDown; // 0x3c0
	UCrowDeconstructWidget* WB_Shop_Deconstruct; // 0x3c8
	UCrowBattlePassWidget* WB_BattlePass; // 0x3d0
	UCrowButton* WB_BT_OwnList; // 0x3d8
	UCrowButton* WB_BT_EscBack; // 0x3e0
	UCrowWidgetToggleButton* WB_LobbyButton_OwnList; // 0x3e8
	UCanvasPanel* CP_Normal_Package_ShopInfo; // 0x3f0
	UCanvasPanel* CP_Normal_OwnList; // 0x3f8
	UGridPanel* GP_NormalShopList; // 0x400
	UGridPanel* GP_NormalOwnShopList; // 0x408
	UCrowShopPackagePopupWidget* WB_Shop_Popup_ExclusivePurchase_wide; // 0x410
	TArray<UCrowWidgetToggleButton*> ButtonList; // 0x418
	UCrowChangeNicknameWidget* WB_ChangeNicknameWidget; // 0x428
	UCrowRandomBoxInfoWidget* RandomBoxInfoWidget; // 0x430
	ECrowShopProductType CurrentProductType; // 0x438
	ECrowShopProductType PrevProductType; // 0x439
	ECrowShopProductSubType CurrentProductSubType; // 0x43a
	ECrowShopSortType CurrentSortType; // 0x43b
	UCrowBannerWidget* Banner1; // 0x440
	UCrowBannerWidget* Banner2; // 0x448
	UCrowBannerWidget* Banner3; // 0x450
	UCrowBannerWidget* Banner4; // 0x458
	UCrowBannerWidget* Banner5; // 0x460
	UCrowBannerWidget* Banner6; // 0x468
	TArray<UCrowBannerWidget*> BannerList; // 0x470
};

struct UClothingAssetCommon {
	UPhysicsAsset* PhysicsAsset; // 0x48
	TMap<FName, UClothConfigBase*> ClothConfigs; // 0x50
	UClothConfigBase* ClothSharedSimConfig; // 0xa0
	UClothConfigBase* ClothSimConfig; // 0xa8
	UClothConfigBase* ChaosClothSimConfig; // 0xb0
	TArray<UClothLODDataCommon_Legacy*> ClothLODData; // 0xb8
	TArray<FClothLODDataCommon> LODData; // 0xc8
	TArray<int32_t> LodMap; // 0xd8
	TArray<FName> UsedBoneNames; // 0xe8
	TArray<int32_t> UsedBoneIndices; // 0xf8
	int32_t ReferenceBoneIndex; // 0x108
	UClothingAssetCustomData* CustomData; // 0x110
	FClothConfig_Legacy ClothConfig; // 0x118
};

struct UPhysicsObjectToolPropertySet {
	FString ObjectName; // 0x60
	ECollisionGeometryMode CollisionType; // 0x70
	TArray<FPhysicsSphereData> Spheres; // 0x78
	TArray<FPhysicsBoxData> Boxes; // 0x88
	TArray<FPhysicsCapsuleData> Capsules; // 0x98
	TArray<FPhysicsConvexData> Convexes; // 0xa8
};

struct ACrowBuildingEditorChecker {
	USceneComponent* SceneRoot; // 0x220
	UTextRenderComponent* TextRender; // 0x228
	UStaticMeshComponent* CubeMesh; // 0x230
	bool HideInformation; // 0x238
	TArray<TWeakObjectPtr<AActor>> CollectedActors; // 0x240
	TArray<TWeakObjectPtr<AActor>> AddedActors; // 0x250
	TArray<TWeakObjectPtr<AActor>> MovedActors; // 0x260
	TArray<TWeakObjectPtr<AActor>> EditorRootActors; // 0x270
	TArray<TWeakObjectPtr<AActor>> EditorCheckerActors; // 0x280
	bool IsActivateChecker; // 0x290
};

struct USourceEffectRingModulationPreset {
	FSourceEffectRingModulationSettings Settings; // 0xb0
};

struct UCrowDeathZoneWidget {
	UTextBlock* TB_WarningTimer; // 0x348
	UTextBlock* TB_WarningAlarm; // 0x350
	UTextBlock* TB_WarningDesc; // 0x358
};

struct UWB_SettingsSlotSlider_C {
	UImage* Image_52; // 0x368
};

struct UAITask {
	AAIController* OwnerController; // 0x68
};

struct USubmixEffectStereoDelayPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct UARPoseComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UGameplayTask_SpawnActor {
	FMulticastInlineDelegate Success; // 0x68
	FMulticastInlineDelegate DidNotSpawn; // 0x78
	AActor* ClassToSpawn; // 0xa0
};

struct UMaterialExpressionRotateAboutAxis {
	FExpressionInput NormalizedRotationAxis; // 0x40
	FExpressionInput RotationAngle; // 0x54
	FExpressionInput PivotPoint; // 0x68
	FExpressionInput position; // 0x7c
	float Period; // 0x90
};

struct ADestructibleActor {
	UDestructibleComponent* DestructibleComponent; // 0x220
	FMulticastInlineDelegate OnActorFracture; // 0x228
};

struct UMovieScene {
	TArray<FMovieSceneSpawnable> Spawnables; // 0x50
	TArray<FMovieScenePossessable> Possessables; // 0x60
	TArray<FMovieSceneBinding> ObjectBindings; // 0x70
	TMap<FName, FMovieSceneObjectBindingIDs> BindingGroups; // 0x80
	TArray<UMovieSceneTrack*> MasterTracks; // 0xd0
	UMovieSceneTrack* CameraCutTrack; // 0xe0
	FMovieSceneFrameRange SelectionRange; // 0xe8
	FMovieSceneFrameRange PlaybackRange; // 0xf8
	FFrameRate TickResolution; // 0x108
	FFrameRate DisplayRate; // 0x110
	EMovieSceneEvaluationType EvaluationType; // 0x118
	EUpdateClockSource ClockSource; // 0x119
	FSoftObjectPath CustomClockSourcePath; // 0x120
	TArray<FMovieSceneMarkedFrame> MarkedFrames; // 0x138
};

struct UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct ADecalActor {
	UDecalComponent* Decal; // 0x220
};

struct UMovieSceneBuiltInEasingFunction {
	EMovieSceneBuiltInEasing Type; // 0x30
};

struct UDrawPolygonTool {
	UDrawPolygonToolStandardProperties* PolygonProperties; // 0x88
	UDrawPolygonToolSnapProperties* SnapProperties; // 0x90
	UNewMeshMaterialProperties* MaterialProperties; // 0x98
	UPreviewMesh* PreviewMesh; // 0x150
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
	UPlaneDistanceFromHitMechanic* HeightMechanic; // 0x540
};

struct UComboBox {
	TArray<UObject*> Items; // 0x108
	FDelegate OnGenerateWidgetEvent; // 0x118
	bool bIsFocusable; // 0x128
};

struct USoundSubmix {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	EGainParamMode GainMode; // 0x68
	float OutputVolume; // 0x6c
	float WetLevel; // 0x70
	float DryLevel; // 0x74
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x78
};

struct UOnAcceptHandleSourcesProperties {
	EHandleSourcesMethod OnToolAccept; // 0x60
};

struct UParticleModuleTypeDataMesh {
	UStaticMesh* Mesh; // 0x30
	float LODSizeScale; // 0x40
	char bUseStaticMeshLODs : 1; // 0x44
	char CastShadows : 1; // 0x44
	char DoCollisions : 1; // 0x44
	EMeshScreenAlignment MeshAlignment; // 0x45
	char bOverrideMaterial : 1; // 0x46
	char bOverrideDefaultMotionBlurSettings : 1; // 0x46
	char bEnableMotionBlur : 1; // 0x46
	FRawDistributionVector RollPitchYawRange; // 0x48
	EParticleAxisLock AxisLockOption; // 0x90
	char bCameraFacing : 1; // 0x91
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x92
	EMeshCameraFacingOptions CameraFacingOption; // 0x93
	char bApplyParticleRotationAsSpin : 1; // 0x94
	char bFaceCameraDirectionRatherThanPosition : 1; // 0x94
	char bCollisionsConsiderPartilceSize : 1; // 0x94
};

struct UMovieSceneCameraShakeSourceTriggerTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct ACrowEquipmentBase {
	bool bIsSelected; // 0x308
	bool bIsVisible; // 0x309
	char SlotIndex; // 0x30a
};

struct UCrowWorldLevelOfDetailAUD {
	ECrowWorldLODGroup CrowWorldLOD; // 0x28
	float OverrideCameraDistanceMax; // 0x2c
	char IgnoreCrowLightProbe : 1; // 0x30
	char ClientDecorationOnly : 1; // 0x30
	char AlwaysDisableCollision : 1; // 0x30
	char StaticWorldMesh : 1; // 0x30
	char WorldHLOD : 1; // 0x30
};

struct UParticleSystemWidget {
	UParticleSystem* ParticleSystemTemplate; // 0x108
	bool bAutoActivate; // 0x110
	bool bReactivate; // 0x111
	UUIParticleComponent* WorldParticleComponent; // 0x118
	AActor* WorldParticleActor; // 0x120
};

struct UCrowDistanceBasedFXManager {
	TMap<int64_t, FName> WeaponSubTypeNames; // 0x30
};

struct UMaterialExpressionQualitySwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct USceneCaptureComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x1f8
	ESceneCaptureSource CaptureSource; // 0x1f9
	char bCaptureEveryFrame : 1; // 0x1fa
	char bCaptureOnMovement : 1; // 0x1fa
	bool bAlwaysPersistRenderingState; // 0x1fb
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x200
	TArray<AActor*> HiddenActors; // 0x210
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x220
	TArray<AActor*> ShowOnlyActors; // 0x230
	float LODDistanceFactor; // 0x240
	float MaxViewDistanceOverride; // 0x244
	int32_t CaptureSortPriority; // 0x248
	bool bUseRayTracingIfEnabled; // 0x24c
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x250
	FString ProfilingEventName; // 0x290
};

struct UParticleModuleLocationWorldOffset_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UARSessionConfig {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct UEraseBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
};

struct ACrowGameStateTG {
	TArray<ACrowTGStealthSpawner*> ArrayBomberSpawner; // 0x410
	FTimerHandle StealthSpawnerTimer; // 0x420
	float BomberRespawnTime; // 0x428
};

struct ACrowLoadoutVolume {
	ECrowTeam_RedBlue TeamID; // 0x258
};

struct UCrowDamageEffect {
	TArray<FCrowDamageCameraShake> CameraShake; // 0x28
	float SmallBloodPercent; // 0x38
	float LargeBloodPercent; // 0x3c
	UCurveFloat* VignetteCurve; // 0x40
	UMatineeCameraShake* ContaminationAreaCameraShake; // 0x48
};

struct UCrowSettingsUserConfig {
	TArray<FActionKeySlot> ActionKeySlots; // 0x28
	TArray<FAxisKeySlot> AxisKeySlots; // 0x38
	TArray<FSettingUserConfigItem> Options; // 0x48
};

struct UCrowSpectatorSquadSlotWidget {
	UVerticalBox* VB_List; // 0x348
	UTextBlock* TB_SquadNumber; // 0x350
	UImage* IMG_SquadColor; // 0x358
	UCrowSpectatorPlayerSlotWidget* PlayerSlotWidgetClass; // 0x360
	TMap<uint64_t, UCrowSpectatorPlayerSlotWidget*> PlayerSlotMap; // 0x368
	FString SquadKey; // 0x3b8
	int32_t SquadNumber; // 0x3c8
	FLinearColor SquadColor; // 0x3cc
};

struct UPlaneCutTool {
	UPlaneCutToolProperties* BasicProperties; // 0x98
	UAcceptOutputProperties* AcceptProperties; // 0xa0
	FVector CutPlaneOrigin; // 0xa8
	FQuat CutPlaneOrientation; // 0xc0
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xd0
	TArray<UDynamicMeshReplacementChangeTarget*> MeshesToCut; // 0xe0
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
};

struct ACrowSwitchingActor {
	bool bSwitchOn; // 0x220
	TArray<TSoftObjectPtr<AActor>> SwitcingOnActors; // 0x228
	TArray<TSoftObjectPtr<AActor>> SwitcingOffActors; // 0x238
	UStaticMeshComponent* SphereMesh; // 0x248
};

struct UMovieSceneObjectPropertyTrack {
	UObject* PropertyClass; // 0xb0
};

struct UNiagaraDataInterfaceGrid3DCollection {
	int32_t NumAttributes; // 0x100
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0x108
	ENiagaraGpuBufferFormat BufferFormat; // 0x128
};

struct UBTService_CrowUpdateTargetState {
	FBlackboardKeySelector TargetInSight; // 0x98
};

struct UCrowBuildingDynamicPartsTableRef {
	TMap<FName, FCrowBuildingDynamicParts> PartsMap; // 0x28
};

struct UCrowObserverIndicatorWidget {
	UImage* IMG_SquadColor; // 0x3c8
	UTextBlock* TB_SquadNumber; // 0x3d0
	UProgressBar* PB_HealthPoint; // 0x3d8
	ACrowPlayerStateBase* LocalPlayerState; // 0x3e0
	ACrowPlayerStateBase* TargetPlayerState; // 0x3e8
	ACrowCharacterPawn* CharacterPawn; // 0x3f0
};

struct UCrowUserPopupWidget {
	UCrowWidgetImage* IMG_UserThumenail; // 0x348
	UCrowWidgetImage* IMG_Rank; // 0x350
	UTextBlock* TB_UserLevel; // 0x358
	UTextBlock* TB_Username; // 0x360
	UCrowButton* BT_Profile; // 0x368
	UCrowButton* BT_Invite; // 0x370
	UCrowButton* BT_Kick; // 0x378
	UCrowButton* BT_Promote; // 0x380
	UCrowButton* BT_RequestFriend; // 0x388
	UCrowButton* BT_DeleteFriend; // 0x390
	UCrowButton* BT_Wisper; // 0x398
	UCrowButton* BT_Join; // 0x3a0
	UCrowButton* BT_Report; // 0x3a8
	UCrowButton* BT_Close; // 0x3b0
	FCrowGamePlayUserPopupInfo CurrentPlayUserPopupInfo; // 0x3b8
	EFriendSlotType CurrentSlotType; // 0x3f0
	ACrowSceneLobby* SceneLobby; // 0x3f8
};

struct ACrowWeaponTablet {
	ECrowCameraMode BackupCameraMode; // 0x1ec0
};

struct ACrowWeaponTimeBombForBombMission {
	AActor* CompositionCClass; // 0x1ec0
	UCrowHealWidget* ProgressWidget; // 0x1ec8
	UCrowTriggerUIBase* CancelTrigger; // 0x1ed0
	bool bIsPlantCompositionC; // 0x1ed8
};

struct UMaterialExpressionLandscapeVisibilityMask {
	FGuid ExpressionGUID; // 0x40
};

struct UMoviePlayerSettings {
	bool bWaitForMoviesToComplete; // 0x28
	bool bMoviesAreSkippable; // 0x29
	TArray<FString> StartupMovies; // 0x30
};

struct ACrowLadderActor {
	UStaticMesh* LadderStair; // 0x228
	UBoxComponent* TriggerBox; // 0x230
	USceneComponent* Top; // 0x238
	USceneComponent* Bottom; // 0x240
	USceneComponent* TopEnter; // 0x248
	USceneComponent* BottomEnter; // 0x250
	USceneComponent* BottomExit; // 0x258
	UStaticMeshComponent* LadderBodyMeshComponent; // 0x260
	UCrowTriggerComponent* TopEnterTrigger; // 0x268
	bool bUseTopEnterTrigger; // 0x270
	int32_t StepCount; // 0x274
	float StepHeight; // 0x278
	int32_t TopExitStepNumberFromTop; // 0x27c
	float BottomAllowableEntryAngle; // 0x280
	float BottomAllowableEntryXYSize; // 0x284
	float BottomAllowableEntryHeight; // 0x288
};

struct AOculusMR_CastingCameraActor {
	UVRNotificationsComponent* VRNotificationComponent; // 0x238
	UTexture2D* CameraColorTexture; // 0x240
	UTexture2D* CameraDepthTexture; // 0x248
	UOculusMR_PlaneMeshComponent* PlaneMeshComponent; // 0x250
	UMaterial* ChromaKeyMaterial; // 0x258
	UMaterial* OpaqueColoredMaterial; // 0x260
	UMaterialInstanceDynamic* ChromaKeyMaterialInstance; // 0x268
	UMaterialInstanceDynamic* CameraFrameMaterialInstance; // 0x270
	UMaterialInstanceDynamic* BackdropMaterialInstance; // 0x278
	UTexture2D* DefaultTexture_White; // 0x280
	TArray<UTextureRenderTarget2D*> BackgroundRenderTargets; // 0x2d8
	ASceneCapture2D* ForegroundCaptureActor; // 0x2e8
	TArray<UTextureRenderTarget2D*> ForegroundRenderTargets; // 0x2f0
	TArray<double> PoseTimes; // 0x300
	UOculusMR_Settings* MRSettings; // 0x310
	UOculusMR_State* MRState; // 0x318
};

struct UCrowTutorialInfoWidget {
	URichTextBlock* RTB_Message; // 0x348
	UImage* IMG_BackGround; // 0x350
	FTimerHandle VisibleTimer; // 0x358
	FLinearColor BackgroundBlockColor; // 0x360
	FLinearColor BackgroundRedColor; // 0x370
};

struct UPropertyValue {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct ACrowLoadoutBoxActor {
	ACrowWorldIconActor* RewardIconActor; // 0x230
	UParticleSystemComponent* RewardSmokeEffect; // 0x238
	UBoxComponent* BoxComponent; // 0x240
	USceneComponent* IconLocation; // 0x248
	UCrowSimpleBuoyancyComponent* BuoyancyComponent; // 0x250
	ACrowSupplyEventParachuteActor* ParachuteClass; // 0x258
	UAnimationAsset* ParachuteDownAni; // 0x260
	UAnimationAsset* ParachuteUpAni; // 0x268
	float DropHeight; // 0x270
	float MaxSpeed; // 0x274
	uint32_t MaxSupplyCount; // 0x278
	UAkAudioEvent* UseSound; // 0x280
	float LifeTime; // 0x288
	float HP; // 0x28c
	UParticleSystem* DestroyEffect; // 0x290
	UAkAudioEvent* DestroySound; // 0x298
	FCrowGameIconDisplayInfo IconDisplayInfo; // 0x2a0
	char BoxTeam; // 0x328
	char SquadRewardIndex; // 0x329
	uint32_t RemainSupplyCount; // 0x32c
	float RemainLifeTime; // 0x330
	TArray<uint64_t> UsedPlayerArray; // 0x338
	ECrowLoadoutBoxState LoadoutBoxState; // 0x348
	ACrowSupplyEventParachuteActor* ParachuteActor; // 0x350
	float CurrentHP; // 0x358
	bool bUpdateIcon; // 0x35c
	FTimerHandle CheckLifeTimer; // 0x360
	bool bIsSpawned; // 0x368
	FVector LandLocation; // 0x36c
	bool bIsAttachedParachute; // 0x378
};

struct UCrowVehicleManager {
	TArray<AActor*> VehicleArray; // 0x28
	TArray<AActor*> VehicleImpedimentsArray; // 0x38
};

struct UTextBlock {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FSlateColor ColorAndOpacity; // 0x150
	FDelegate ColorAndOpacityDelegate; // 0x178
	FSlateFontInfo Font; // 0x188
	FSlateBrush StrikeBrush; // 0x1e0
	FVector2D ShadowOffset; // 0x268
	FLinearColor ShadowColorAndOpacity; // 0x270
	FDelegate ShadowColorAndOpacityDelegate; // 0x280
	float MinDesiredWidth; // 0x290
	bool bWrapWithInvalidationPanel; // 0x294
	bool bAutoWrapText; // 0x295
	ETextTransformPolicy TextTransformPolicy; // 0x296
	bool bSimpleTextMode; // 0x297
};

struct ACrowGameModeSquadMatch {
	ACrowBomberActor* StealthBomberClass; // 0x518
	ACrowSupplyAmmoActor* MorphineBoxClass; // 0x520
	ACrowLoadoutBoxActor* LoadoutBoxClass; // 0x528
	TArray<UCrowSquadInfo*> ResultArray; // 0x530
	TMap<FString, char> SquadTeamMap; // 0x540
};

struct UCrowWeaponSubStateBase {
	ACrowWeaponBase* WeaponBase; // 0x28
	ACrowCharacterPawn* CharacterOwner; // 0x30
};

struct ALuminAROrigin {
	UMRMeshComponent* MRMeshComponent; // 0x220
	UMaterialInterface* PlaneSurfaceMaterial; // 0x228
	UMaterialInterface* WireframeMaterial; // 0x230
};

struct UBTDecorator_Loop {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UCrowPassenger {
	ACrowPlayerControllerBase* PlayerController; // 0xc0
	ACrowVehiclePawn* VehiclePawn; // 0xc8
	APawn* PassengerPawn; // 0xd0
	int32_t ClientSeatIndex; // 0xd8
	UCrowPassengerManager* ClientPassengerManager; // 0xe0
	FName VehicleName; // 0xe8
	EVehicleIdentity VehicleIdentity; // 0xf0
	UCrowPassengerInput* PassengerInput; // 0xf8
	ECrowCameraMode DefaultCameraMode; // 0x100
	ECrowCameraMode CurrentCameraMode; // 0x101
	bool bIsChangedCameraModeAtAimView; // 0x102
	FTimerHandle WaitTimeWhenChangingSeatHandler; // 0x108
	ACrowVehiclePawn* LastVehiclePawn; // 0x110
	ACrowGameStateBase* GameState; // 0x118
};

struct UMaterialExpressionTextureBase {
	UTexture* Texture; // 0x40
};

struct UMaterialExpressionSubtract {
