// Created by BlueFire1337
// Updated 2022-01-25
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0xa19de40;
	constexpr auto GObjects = 0xa1e9c20;
	constexpr auto GWorld = 0xa36d8e0;
}

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x38
	FRawDistributionFloat SubImageIndex; // 0x40
	char bUseRealTime : 1; // 0x70
};

struct UBP_MainCursor_C : UCoreCursor {
	UImage* Image_80; // 0x268
};

struct UInterpGroupInst : UObject {
	UInterpGroup* Group; // 0x30
	AActor* GroupActor; // 0x38
	TArray<UInterpTrackInst*> TrackInst; // 0x40
};

struct UParticleModuleColorScaleOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat AlphaScaleOverLife; // 0x80
	char bEmitterTime : 1; // 0xb0
};

struct UAB_Menu_Slasher06_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2b0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x328
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x440
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
};

struct UBreathingSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isDead; // 0x4f0
	UAnimSequence* _breathing; // 0x4f8
};

struct UAISkill_InteractionTarget_DashAttack : UAISkill_InteractionTarget_Dash {
	float DashAttackUnderMaxRange; // 0x220
	float DashAttackUnderMaxHalfAngle; // 0x224
	EAttackType ExpectedAttackType; // 0x228
};

struct UOpenChestInteraction : USearchChestInteractionBase {
	FGameplayTag _camperSearchablePercentTag; // 0x700
	UAnimSequence* _successExitTimeAnimSequenceReference; // 0x710
	float _startTime; // 0x718
};

struct UBakeTransformTool : UMultiSelectionTool {
	UBakeTransformToolProperties* BasicProperties; // 0x98
};

struct UK26CooldownInteractionDefinition : UInteractionDefinition {
	FTunableStat _cooldownTime; // 0x5b0
};

struct UParticleModuleSizeScaleBySpeed : UParticleModuleSizeBase {
	FVector2D SpeedScale; // 0x38
	FVector2D MaxScale; // 0x40
};

struct UPlayerInput : UObject {
	TArray<FKeyBind> DebugExecBindings; // 0x128
	TArray<FInputActionKeyMapping> ActionMappings; // 0x148
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x158
	TArray<FName> InvertedAxis; // 0x168
};

struct UMagicLeapSettings : UObject {
	bool bEnableZI; // 0x30
	bool bUseVulkanForZI; // 0x31
	bool bUseMLAudioForZI; // 0x32
};

struct UArmIKSensorComponent : UActorComponent {
	USkeletalMeshComponent* _mesh; // 0xb8
	TMap<EArm, FArmIKSensorDatum> _arms; // 0xc0
	float _capsuleRadius; // 0x110
	float _capsuleHalfHeight; // 0x114
	float _traceLength; // 0x118
	UCameraComponent* _owningCamera; // 0x120
};

struct UPolyEditExtrudeProperties : UInteractiveToolPropertySet {
	EPolyEditExtrudeDirection Direction; // 0x58
};

struct UDoctorPowerAnimStateComponent : UActorComponent {
	EDoctorAbilityType _abilityType; // 0xb8
	EDoctorAbilityPhase _abilityPhase; // 0xb9
};

struct UUMGHudEditorVersionWidget : UUserWidget {
	UButton* VersionButton; // 0x260
	UUMGDragWidget_HudEditor* _onEditWidget; // 0x268
};

struct UUMGTallyScoreboardWidget : UUMGTallyListElementWidget {
	FMulticastInlineDelegate OnTallyScoreboardAddFriendEvent; // 0x310
	FMulticastInlineDelegate OnTallyScoreboardReportEvent; // 0x320
	FText LabelTextRank; // 0x330
	FText LabelTextScore; // 0x348
	FText LabelTextStatus; // 0x360
	UUMGTallyScoreboardPlayerInfoWidget* KillerWidget; // 0x378
	UUMGTallyScoreboardPlayerInfoWidget* FirstSurvivorWidget; // 0x380
	UUMGTallyScoreboardPlayerInfoWidget* SecondSurvivorWidget; // 0x388
	UUMGTallyScoreboardPlayerInfoWidget* ThirdSurvivorWidget; // 0x390
	UUMGTallyScoreboardPlayerInfoWidget* FourthSurvivorWidget; // 0x398
	TArray<UUMGTallyScoreboardPlayerInfoWidget*> SurvivorWidgets; // 0x3a0
};

struct UBrushRemeshProperties : URemeshProperties {
	bool bEnableRemeshing; // 0x68
	int32_t TriangleSize; // 0x6c
	int32_t PreserveDetail; // 0x70
};

struct UBloodEcho : UPerk {
	FGameplayTag _statusEffectDurationTag; // 0x3d0
	float _cooldownDuration[0x3]; // 0x3dc
};

struct UCamperMovementComponent : UDBDCharacterMovementComponent {
	float MaxCrawlSpeed; // 0x8f0
	float MaxRunSpeed; // 0x8f4
	FRotator _defaultRotationRate; // 0x8f8
	FRotator _rotationRateWhileCrawling; // 0x904
};

struct UK25ChainStrikeState_ShootControlledProjectile : UK25ChainStrikeBaseState {
	float _minimumThrottleTimeForInputServerCall; // 0xc8
	float _inputResetSpeed; // 0xcc
};

struct UGFxEngine : UObject {
	TArray<FGCReference> GCReferences; // 0x30
	int32_t RefCount; // 0x40
};

struct UFootGroundDetectorComponent : UBaseGroundDetectorComponent {
	FName _hipTransformName; // 0x1d0
	FVector _slopeStartOffset; // 0x1dc
	float _footLength; // 0x1e8
	float _traceRadius; // 0x1ec
	float _maxWalkableSlopeAngle; // 0x1f0
	UCharacterMovementComponent* _movementComp; // 0x1f8
};

struct AARSharedWorldGameState : AGameState {
	TArray<char> PreviewImageData; // 0x2a8
	TArray<char> ARWorldData; // 0x2b8
	int32_t PreviewImageBytesTotal; // 0x2c8
	int32_t ARWorldBytesTotal; // 0x2cc
	int32_t PreviewImageBytesDelivered; // 0x2d0
	int32_t ARWorldBytesDelivered; // 0x2d4
};

struct UBaseMediaSource : UMediaSource {
	FName playerName; // 0x88
};

struct UButtonStyleAsset : UObject {
	FButtonStyle ButtonStyle; // 0x30
};

struct UInterpTrackMoveAxis : UInterpTrackFloatBase {
	EInterpMoveAxis MoveAxis; // 0x98
	FInterpLookupTrack LookupTrack; // 0xa0
};

struct UMaterialExpressionBlackBody : UMaterialExpression {
	FExpressionInput TEMP; // 0x48
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x38
	USkeleton* TargetSkeleton; // 0x48
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x50
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x60
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xb0
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xc0
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xd0
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xf0
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x110
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x130
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x150
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x170
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x190
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1b0
	TArray<FName> SyncGroupNames; // 0x200
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x210
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x220
};

struct UDatasmithPointLightComponentTemplate : UDatasmithObjectTemplate {
	ELightUnits IntensityUnits; // 0x38
	float SourceRadius; // 0x3c
	float SourceLength; // 0x40
	float AttenuationRadius; // 0x44
};

struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterface {
	FString EmitterName; // 0x38
};

struct UDBDAggregateParticleSystemComponent : UParticleSystemComponent {
	float CullAngle; // 0x6a8
	float EndFadeDistance; // 0x6ac
	TSet<USceneComponent*> LocatorComponentCache; // 0x6b0
	bool PendingReset; // 0x700
};

struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	UVectorField* Field; // 0x38
	bool bTileX; // 0x40
	bool bTileY; // 0x41
	bool bTileZ; // 0x42
};

struct UGlyphNavMovementComponent : UNavMovementComponent {
	AActor* _glyphOwner; // 0x140
	UPathFollowingComponent* _pathFollowingComponent; // 0x148
	char bPositionCorrected : 1; // 0x150
	float _maxSpeed; // 0x154
	float _acceleration; // 0x158
	float _deceleration; // 0x15c
	float _brakingDeceleration; // 0x160
};

struct UPhaseWalkingComponent : UActorComponent {
	FMulticastInlineDelegate OnPhaseWalkInfoReceived; // 0xb8
	FMulticastInlineDelegate OnGameEndedVFX; // 0xc8
	FMulticastInlineDelegate TriggerSurvivorVisibilityVFX; // 0xd8
	FMulticastInlineDelegate TriggerKillerVisibilityVFX; // 0xe8
	FMulticastInlineDelegate OnMaxActivePhaseWalkCharges; // 0xf8
	AActor* _huskClass; // 0x108
	FTagStateBool _isActivePhaseWalking; // 0x110
	FTagStateBool _isPassivePhaseWalking; // 0x140
	bool _isInteractionPhaseWalking; // 0x170
	AActor* _husk; // 0x178
	FDBDBidirectionalTimer _activePhaseWalkCharges; // 0x180
	bool _survivorsAreVisible; // 0x1d0
	int32_t _passivePhaseWalkHusksCount; // 0x208
	FTunableStat _activePhaseWalkChargeGainRate; // 0x210
	FTunableStat _passivePhaseWalkDuration; // 0x290
	FDBDTunableRowHandle _passivePhaseWalkFirstCooldownDuration; // 0x310
	FTunableStat _passivePhaseWalkCooldownDurationMin; // 0x338
	FTunableStat _passivePhaseWalkCooldownDurationMax; // 0x3b8
	FTunableStat _activePhaseWalkMaxCharge; // 0x438
	FDBDTunableRowHandle _activePhaseWalkMaxAcceleration; // 0x4b8
	FDBDTunableRowHandle _defaultMaxAcceleration; // 0x4e0
};

struct UUMGTallyEmblemMarker : UMobileBaseUserWidget {
	UImage* QualityImage; // 0x300
	TMap<EEmblemQuality, FEmblemQualityImages> _qualityImages; // 0x308
};

struct ULuckyBreak : UPerk {
	float _activationTime[0x3]; // 0x3d0
};

struct UHexBloodFavor : UHexPerk {
	float _palletInRange[0x3]; // 0x440
	float _palletPulldownBlockTime[0x3]; // 0x44c
};

struct UExistingMeshMaterialProperties : UInteractiveToolPropertySet {
	ESetMeshMaterialMode MaterialMode; // 0x58
	float CheckerDensity; // 0x5c
	UMaterialInterface* OverrideMaterial; // 0x60
	UMaterialInstanceDynamic* CheckerMaterial; // 0x68
};

struct UActorSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x350
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x358
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x30
};

struct UDBDPersistentData : UObject {
	FGamePersistentData _gamePersistentData; // 0x30
	TArray<FString> _keepDataIDs; // 0x130
	TMap<FString, FPlayerPersistentData> _playerIdToPersistentDataMap; // 0x140
	FPlayerPersistentData _localPlayerPersistentData; // 0x190
	TArray<FCloudInventoryItem> _cloudInventory; // 0x930
};

struct UUMGAtlantaDailyRewardsScreen : UMobileBaseUserWidget {
	UUMGAtlantaDailyRewardsGrid* DailyRewardWidgetsGrid; // 0x310
	UCanvasPanel* ContinueButtonPanel; // 0x318
	UUMGPopupButton* ContinueButton; // 0x320
	UTextBlock* RemainingTimeTextBlock; // 0x328
	FSlateColor NormalColor; // 0x330
	FSlateColor WarningColor; // 0x358
};

struct UUMGRewardSlotTutorialPopupRewardWidget : UMobileBaseUserWidget {
	UTextBlock* RewardText; // 0x300
	UImage* RewardPicture; // 0x308
	UWidget* UnlockedPanel; // 0x310
	UWidget* MissedRewardPanel; // 0x318
	float RewardUnlockedTextOpacity; // 0x320
	float RewardToBeMissedTextOpacity; // 0x324
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x210
	int32_t VirtualUserIndex; // 0x230
	float PointerIndex; // 0x234
	ECollisionChannel TraceChannel; // 0x238
	float InteractionDistance; // 0x23c
	EWidgetInteractionSource InteractionSource; // 0x240
	bool bEnableHitTesting; // 0x241
	bool bShowDebug; // 0x242
	FLinearColor DebugColor; // 0x244
	FHitResult CustomHitResult; // 0x2d0
	FVector2D LocalHitLocation; // 0x360
	FVector2D LastLocalHitLocation; // 0x368
	UWidgetComponent* HoveredWidgetComponent; // 0x370
	FHitResult LastHitResult; // 0x378
	bool bIsHoveredWidgetInteractable; // 0x408
	bool bIsHoveredWidgetFocusable; // 0x409
	bool bIsHoveredWidgetHitTestVisible; // 0x40a
};

struct UUMGStorefrontCustomizationWidget : UUMGPromoPackItemWidget {
	UTextBlock* CustomizationQuantityText; // 0x468
	UCanvasPanel* CustomizationQuantityPanel; // 0x470
};

struct UBTService_BlueprintBase : UBTService {
	AAIController* AIOwner; // 0x78
	AActor* ActorOwner; // 0x80
	char bShowPropertyDetails : 1; // 0x98
	char bShowEventDetails : 1; // 0x98
};

struct UActorDetectorComponent : UActorComponent {
	FMulticastInlineDelegate OnActorDetected; // 0xb8
	TArray<UObject*> CollectedTypes; // 0xc8
	UPrimitiveComponent* _primitive; // 0xd8
};

struct UChargeTwinJumpInteraction : UChargeableInteractionDefinition {
	FDBDTunableRowHandle _chargeJumpMaxCharge; // 0x720
	FDBDTunableRowHandle _interactionViewPitchMax; // 0x748
	FDBDTunableRowHandle _interactionViewPitchMin; // 0x770
	FDBDTunableRowHandle _cancelCooldownTime; // 0x7c0
};

struct UInterpTrackInstSlomo : UInterpTrackInst {
	float OldTimeDilation; // 0x30
};

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x290
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x298
};

struct UUMGCustomizationItemBuyButton : UUMGCustomizationItemPriceWidget {
	UImage* CurrencyColorStripe; // 0x410
	TMap<ECurrencyType, FColor> _currencyStripeColors; // 0x418
	FLinearColor _disabledOpacity; // 0x468
	FLinearColor _enabledOpacity; // 0x478
};

struct UBP_Audio_KLR_Base_C : UKillerAudioHandlerComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb8
	UAkAudioBank* _killerAudioBank; // 0xc0
	UAkAudioEvent* _defaultAudioStatusStartEvent; // 0xc8
	UAkComponent* _audioComponent; // 0xd0
	bool _isInMenu; // 0xd8
	FName _audioCharacterName; // 0xdc
	UAkAudioEvent* _audioStartEvent; // 0xe8
};

struct UUMGReceivedFriendRequestListElement : UUMGBaseFriendListElement {
	URichTextBlock* FriendRequestStatusRichText; // 0x3c0
};

struct ULockerFakeEnterInteraction : UInteractionDefinition {
	float _lockerInteractionBlockTime; // 0x5b0
	ALocker* _owningLocker; // 0x5b8
	FDBDTunableRowHandle _fakeEnterLoudNoiseRange; // 0x5c0
};

struct UCoreScreenIndicatorWidget : UCoreBaseUserWidget {
	float InactiveTime; // 0x2d8
	FVector2D IndicatorPadding; // 0x2dc
	FVector2D DistanceClamping; // 0x2e4
	float MinDistanceRatio; // 0x2ec
	float MinDistanceAlpha; // 0x2f0
};

struct ULevelSequenceDirector : UObject {
	ULevelSequencePlayer* Player; // 0x30
};

struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x70
};

struct UUMGTallyEmblemWidget : UMobileBaseUserWidget {
	TMap<EEmblemQuality, UTexture2D*> _emblemBackgrounds; // 0x300
	UImage* BackgroundImage; // 0x350
	UImage* IconImage; // 0x358
};

struct ULocomotionSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isRecoveringWhileCrawling; // 0x4f0
	bool _isTenacityPerkActive; // 0x4f1
	float _wasStandingResetTime; // 0x4f4
	float _wasRunningResetTime; // 0x4f8
	float _wasCrouchingResetTime; // 0x4fc
	float _wasMovingResetTime; // 0x500
	bool _isIdle; // 0x504
	float _recentlyIdleCooldownTime; // 0x508
	float _recentlyNotIdleCooldownTime; // 0x50c
	bool _wasIdleRecently; // 0x510
	bool _idleInterupt; // 0x511
	bool _isAgainstSmallKiller; // 0x512
	bool _isMoving; // 0x513
	bool _wasRunning; // 0x514
	bool _isRunning; // 0x515
	bool _wasCrouching; // 0x516
	bool _isCrouching; // 0x517
	bool _wasStanding; // 0x518
	bool _isStanding; // 0x519
	bool _isCrawling; // 0x51a
	bool _isDead; // 0x51b
	float _walkAnimSpeed; // 0x51c
	float _walkAnimStartOffset; // 0x520
	float _walkAnimPlayRateMultiplier; // 0x524
	bool _wasLastDamageSourceDeepWounds; // 0x528
	bool _isStrafing; // 0x529
	bool _isUsingDeadHard; // 0x52a
	float _direction; // 0x52c
	bool _isUsingAimItem; // 0x530
	bool _isBeingCarried; // 0x531
	bool _isInDeathBed; // 0x532
	float _aimOffsetPitch; // 0x534
	bool _turn180Active; // 0x538
	bool _turningRight; // 0x539
	bool _start180Active; // 0x53a
	float _aimOffsetYawInterpolated; // 0x53c
	bool _allowLookAt; // 0x540
	bool _isDrasticAimOffsetYawChangeDetected; // 0x541
	float _aimOffsetYawClampValue; // 0x544
	float _maxParadiseWalkCycleOffSet; // 0x548
	float _minParadiseWalkPlayRateMultiplier; // 0x550
	float _turn180DetectionPrecision; // 0x558
	float _turn180DetectionDeadZone; // 0x55c
	float _turn180PrevVelocitiesCacheDuration; // 0x560
	float _minDurationBetweenTurn180Detection; // 0x564
	float _start180DetectionPrecision; // 0x568
	float _idleDurationFor180StartDetection; // 0x56c
	float _durationBeforeStart180Reset; // 0x570
};

struct UKillerConditionalSpeedCurveEffect : UStatusEffect {
	UCurveFloat* _speedCurve; // 0x350
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x48
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x60
	int32_t EnvelopeFollowerAttackTime; // 0x68
	int32_t EnvelopeFollowerReleaseTime; // 0x6c
	float OutputVolume; // 0x70
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x78
};

struct UAB_Menu_Slasher08_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x328
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x440
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
	UStaticMesh* Hatchet; // 0x648
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x230
};

struct UAkSwitchInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithCommSelection CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
};

struct UK24AnimInstance : UKillerAnimInstance {
	bool _isInPowerMode; // 0x5a8
	bool _isChargingPower; // 0x5a9
	bool _isK24PowerAttacking; // 0x5aa
	bool _isRequestingPowerAttack; // 0x5ab
	int32_t _powerLevel; // 0x5ac
};

struct UAnniversary2021EventComponent : URespawningEventComponent {
	UInteractionRespawnableTrigger* _interactionRespawnableTrigger; // 0xc8
	UTimedRespawnableTrigger* _timedRespawnableTrigger; // 0xd0
};

struct UARGetCandidateObjectAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x58
	FMulticastInlineDelegate OnFailed; // 0x68
};

struct UBlendSpace1D : UBlendSpaceBase {
	bool bScaleAnimation; // 0x150
};

struct UUMGPromoPackItemWidget : UUMGBaseButtonWidget {
	UCanvasPanel* SelectedPanel; // 0x430
	UCanvasPanel* BackgroundPanel; // 0x438
	UCanvasPanel* AmountPanel; // 0x440
};

struct UUMGFriendListTabWidget : UUMGFriendBaseTabListWidget {
	UUMGExpandableListWidget* SentInviteToParty; // 0x300
	UUMGExpandableListWidget* ConnectedFriendsExpandableList; // 0x308
	UUMGExpandableListWidget* DisconnectedFriendsExpandableList; // 0x310
};

struct UDemogorgonHuskAnimInstance : UAnimInstance {
	float _teleportDuration; // 0x270
	float _teleportExitPlayRate; // 0x274
	bool _isSlowerExit; // 0x278
	UAnimSequence* _huskPortalSlowerExit; // 0x280
	UAnimSequence* _huskPortalExit; // 0x288
	UAnimMontage* _demogorgonPortalExit; // 0x290
	UAnimMontage* _demogorgonPortalEntry; // 0x298
	APawn* _owningPawn; // 0x2a0
	TWeakObjectPtr<UPortalPlacerStateComponent> _demogorgonPortalPlacerState; // 0x2a8
};

struct AFoliageDensityContainer : AActor {
	TMap<FName, AFoliageActor*> _foliageActors; // 0x230
	TMap<FName, UFoliageDensityHISM*> _foliageHISMs; // 0x280
	UDBDMapFoliageDensityTunables* _mapFoliageDensityTunables; // 0x320
};

struct UDatasmithFBXSceneImportData : UDatasmithSceneImportData {
	bool bGenerateLightmapUVs; // 0x30
	FString TexturesDir; // 0x38
	char IntermediateSerialization; // 0x48
	bool bColorizeMaterials; // 0x49
};

struct UK26IsSurvivorInRangeOfAnyIdleCrow : UEventDrivenModifierCondition {
	FMulticastInlineDelegate OnIsTrueChanged; // 0xe8
};

struct UMediaPlayer : UObject {
	FMulticastInlineDelegate OnEndReached; // 0x30
	FMulticastInlineDelegate OnMediaClosed; // 0x40
	FMulticastInlineDelegate OnMediaOpened; // 0x50
	FMulticastInlineDelegate OnMediaOpenFailed; // 0x60
	FMulticastInlineDelegate OnPlaybackResumed; // 0x70
	FMulticastInlineDelegate OnPlaybackSuspended; // 0x80
	FMulticastInlineDelegate OnSeekCompleted; // 0x90
	FMulticastInlineDelegate OnTracksChanged; // 0xa0
	FTimespan CacheAhead; // 0xb0
	FTimespan CacheBehind; // 0xb8
	FTimespan CacheBehindGame; // 0xc0
	bool NativeAudioOut; // 0xc8
	bool PlayOnOpen; // 0xc9
	char Shuffle : 1; // 0xcc
	char Loop : 1; // 0xcc
	UMediaPlaylist* Playlist; // 0xd0
	int32_t PlaylistIndex; // 0xd8
	FTimespan TimeDelay; // 0xe0
	float HorizontalFieldOfView; // 0xe8
	float VerticalFieldOfView; // 0xec
	FRotator ViewRotation; // 0xf0
	FGuid PlayerGuid; // 0x128
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x2a0
	FVehicleDifferential4WData DifferentialSetup; // 0x340
	float AckermannAccuracy; // 0x35c
	FVehicleTransmissionData TransmissionSetup; // 0x360
	FRuntimeFloatCurve SteeringCurve; // 0x390
};

struct UVehicleAnimInstance : UAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0x970
};

struct ASearchable : AInteractable {
	float Weight; // 0x338
	EItemRarity ItemRarity; // 0x33c
	FMulticastInlineDelegate OnSearchedChanged; // 0x340
	USearchableSpawnPoint* _searchableSpawnPoint; // 0x350
	FName _itemIdToSpawn; // 0x358
	bool _hasBeenSearched; // 0x364
	ACollectable* _itemInsideSearchable; // 0x368
	TMap<ADBDPlayer*, char> _numberOfSearchesWhileOpenPerPlayer; // 0x370
};

struct UMagicLeapARPinSettings : UObject {
	float UpdateCheckFrequency; // 0x30
	FMagicLeapARPinState OnUpdatedEventTriggerDelta; // 0x34
};

struct UDisciplineEffect : UStatusEffect {
	float _deactivationDelay; // 0x350
};

struct AIntervalGizmoActor : AGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x230
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x238
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x240
};

struct UAB_Menu_Slasher10_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x328
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x440
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
};

struct UQosRegionManager : UObject {
	int32_t NumTestsPerRegion; // 0x30
	float PingTimeout; // 0x34
	TArray<FQosRegionInfo> RegionDefinitions; // 0x38
	TArray<FQosDatacenterInfo> DatacenterDefinitions; // 0x48
	FDateTime LastCheckTimestamp; // 0x58
	UQosEvaluator* Evaluator; // 0x60
	EQosCompletionResult QosEvalResult; // 0x68
	TArray<FRegionQosInstance> RegionOptions; // 0x70
	FString ForceRegionId; // 0x80
	bool bRegionForcedViaCommandline; // 0x90
	FString SelectedRegionId; // 0x98
};

struct UBloodOrbStateMonitorComponent : UActorComponent {
	FMulticastInlineDelegate OnBloodOrbAbsorbedCosmetic; // 0xb8
};

struct UCameraAnim : UObject {
	UInterpGroup* CameraInterpGroup; // 0x30
	float AnimLength; // 0x38
	FBox BoundingBox; // 0x3c
	char bRelativeToInitialTransform : 1; // 0x58
	char bRelativeToInitialFOV : 1; // 0x58
	float BaseFOV; // 0x5c
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5a0
};

struct UPoised : UPerk {
	float _activationTime[0x3]; // 0x3d0
};

struct UGeneratorToolboxRepairInteraction : UGeneratorRepairInteraction {
	FText _interactionTextWhenEmpty; // 0x758
	FDBDTunableRowHandle _repairSkillCheckDurationWhenEmpty; // 0x770
	FDBDTunableRowHandle _repairSkillCheckChanceWhenEmpty; // 0x798
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x50
};

struct UBlessedStatusEffect : UStatusEffect {
	UBlessedVignetteController* _vignetteControllerBlueprint; // 0x358
};

struct UAISubsystem : UObject {
	UAISystem* AISystem; // 0x38
};

struct UCheckBoxStyleAsset : UObject {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UAkLateReverbComponent : USceneComponent {
	char bEnable : 1; // 0x210
	UAkAuxBus* AuxBus; // 0x218
	FString AuxBusName; // 0x220
	float SendLevel; // 0x230
	float FadeRate; // 0x234
	float Priority; // 0x238
	UAkLateReverbComponent* NextLowerPriorityComponent; // 0x240
};

struct UTileBank : UObject {
	TArray<ATile*> _allTileBlueprints; // 0x120
};

struct UBlastMineTrapComponent : UActorComponent {
	bool _isTrapActive; // 0xb8
};

struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xc0
	char bProjectVectorGoalToNavigation : 1; // 0xc0
	char bUpdatedDeprecatedProperties : 1; // 0xc0
};

struct AK25UncontrolledProjectile : AK25Projectile {
	FMulticastInlineDelegate OnAcquiredChanged; // 0x438
	FDBDTunableRowHandle _minimumTimeBeforeProjectileLaunch; // 0x448
	FDBDTunableRowHandle _maximumTimeBeforeProjectileLaunch; // 0x470
	FDBDTunableRowHandle _projectileSpeed; // 0x498
	FDBDTunableRowHandle _projectileMaximumTravelDistance; // 0x4c0
	bool _isAcquiredFromPool; // 0x4e8
	ACamperPlayer* _targetSurvivor; // 0x520
};

struct UCamperHealthComponent : UActorComponent {
	FMulticastInlineDelegate OnHealedDelegate; // 0xb8
	FMulticastInlineDelegate OnInjuredBleedoutStarted; // 0xc8
	FMulticastInlineDelegate OnInjuredBleedoutEnded; // 0xd8
	FMulticastInlineDelegate OnInjuredBleedoutKO; // 0xe8
	FMulticastInlineDelegate OnDamageStateChanged; // 0x128
	FMulticastInlineDelegate OnDamageStateChangedCosmetic; // 0x138
	FDBDTunableRowHandle _bleedoutBaseDuration; // 0x148
	FTagStateBool _inInjuredBleedOut; // 0x170
	FDBDTimer _bleedOutTimer; // 0x1a0
	bool _canBleedout; // 0x1c8
	TArray<UInteractionDefinition*> _pauseInjuredBleedoutTimerInteractions; // 0x1d0
	int32_t _currentHealthStateCount; // 0x1e0
	int32_t _numHealthyHeals; // 0x1e8
	FDBDTimer _dyingTimer; // 0x1f0
	UChargeableComponent* _healFromDyingChargeable; // 0x220
	UChargeableComponent* _healFromInjuredChargeable; // 0x228
	UChargeableComponent* _mendChargeable; // 0x230
	ADBDPlayer* _injuredBleedoutInstigator; // 0x238
};

struct UDBDAggregateParticleLocatorComponent : UDBDLocatorComponent {
	UParticleSystem* Template; // 0x210
	UParticleSystemComponent* _particleComponent; // 0x218
};

struct UVaultableOutlineUpdateStrategy : USourceBasedOutlineUpdateStrategy {
	bool _canBeRevealedToLocalPlayer; // 0x130
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x80
};

struct URootContainer : UUIComponent {
	UUserWidget* RootWidgetClass; // 0xb8
	float UnfocusedOpacity; // 0xc0
	UUserWidget* _rootWidget; // 0xc8
};

struct UAkMediaAssetData : UObject {
	bool IsStreamed; // 0x30
	bool UseDeviceMemory; // 0x31
};

struct UDBDPrimaryDataAsset : UPrimaryDataAsset {
	FPrimaryAssetType AssetType; // 0x38
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UBTService_StateMonitor : UBTService {
	FBlackboardKeySelector BBIsIntroCompleted; // 0x78
	FBlackboardKeySelector BBDifficultyLevel; // 0xa8
};

struct ATormentAttackTrailPoint : ABaseTormentTrailPoint {
	FDBDTunableRowHandle _attackPointDelayToEnableCollision; // 0x360
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x230
	bool bAutoUpdateBounds; // 0x238
};

struct UVirtualKeyboardManager : UObject {
	UVirtualKeyboard* _virtualKeyboard; // 0x30
};

struct UGMAdaptiveShadowMapSource : UObject {
	UGMAdaptiveShadowMapAtlas* _atlas; // 0x30
	ULightComponent* _lightComponent; // 0x38
};

struct UParticleModuleEventReceiverKillParticles : UParticleModuleEventReceiverBase {
	char bStopSpawning : 1; // 0x48
};

struct UMagicLeapHeadTrackingNotificationsComponent : UVRNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x148
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x158
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x168
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x178
};

struct UDatasmithCineCameraActorTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x38
};

struct UMaterialExpression : UObject {
	UMaterial* Material; // 0x30
	UMaterialFunction* Function; // 0x38
	char bIsParameterExpression : 1; // 0x40
};

struct UMovieSceneAkTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
	char bIsAMasterTrack : 1; // 0x70
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb8
	float LOSHearingThreshold; // 0xbc
	float SightRadius; // 0xc0
	float SensingInterval; // 0xc4
	float HearingMaxSoundAge; // 0xc8
	char bEnableSensingUpdates : 1; // 0xcc
	char bOnlySensePlayers : 1; // 0xcc
	char bSeePawns : 1; // 0xcc
	char bHearNoises : 1; // 0xcc
	FMulticastInlineDelegate OnSeePawn; // 0xd8
	FMulticastInlineDelegate OnHearNoise; // 0xe8
	float PeripheralVisionAngle; // 0xf8
	float PeripheralVisionCosine; // 0xfc
};

struct AConjoinedTwinInteractable : APlayerInteractable {
	UChargeableComponent* _possessKillerChargeable; // 0x348
	UChargeableComponent* _chargeTwinJumpChargeable; // 0x350
	UChargeableComponent* _removeTwinChargeable; // 0x358
	UChargeableComponent* _destroyTwinChargeable; // 0x360
};

struct AAudioVolume : AVolume {
	float Priority; // 0x268
	char bEnabled : 1; // 0x26c
	FReverbSettings Settings; // 0x270
	FInteriorSettings AmbientZoneSettings; // 0x290
};

struct UPathStrategySelector : UObject {
	ADBDAIBTController* _aiOwner; // 0x38
	TArray<UPathStrategy*> _activePathStrategies; // 0x40
	TArray<UPathStrategy*> _nextPathStrategies; // 0x50
};

struct UDBDSpringArmComponent : USpringArmComponent {
	char bEnableComponentwiseCameraLag : 1; // 0x2a0
	FVector ComponenwiseCameraLagSpeed; // 0x2a4
	float TargetArmMinLength; // 0x2b0
	char bEnableDistanceCameraLag : 1; // 0x2b4
	float CameraDistanceLagSpeed; // 0x2b8
	char bDrawDebugTraceMarkers : 1; // 0x2c0
	TArray<TWeakObjectPtr<AActor>> ignoreActors; // 0x2c8
};

struct UPanelSlot : UVisual {
	UPanelWidget* Parent; // 0x30
	UWidget* Content; // 0x38
};

struct UAtlantaRoleSelectionScreen : UScreenBase {
	UUMGRoleSelectionScreen* _umgScreen; // 0x120
};

struct UMaterialExpressionReroute : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FVector ResetVector; // 0x60
};

struct UQosEvaluator : UObject {
	bool bInProgress; // 0x50
	bool bCancelOperation; // 0x51
	TArray<FDatacenterQosInstance> Datacenters; // 0x58
};

struct UWalesCypherParameters : UDataAsset {
	FString AUDIO_EVENT; // 0x38
	int32_t SLASHER_INDEX; // 0x48
	int32_t CAMPER_INDEX; // 0x4c
};

struct USurvivorAnimInstance : UBaseSurvivorAnimInstance {
	ACamperPlayer* CamperPlayer; // 0x4f0
	bool IsHooked; // 0x4f8
	bool IsSacrificeStruggling; // 0x4f9
	UAnimMontage* MontageMadnessTierUp; // 0x500
	TArray<UAnimCompositeBase*> ArrayCarryAttackMontage; // 0x508
	bool _isFrightScreaming; // 0x518
	bool IsBeingCarried; // 0x519
	bool IsBeingPutOnHook; // 0x51a
	bool isCrouched; // 0x51b
	ECamperGuidedAction GuidedAction; // 0x51c
	bool IsTrapped; // 0x51d
	bool IsCrawling; // 0x51e
	bool IsDead; // 0x51f
	float MaxSpeed; // 0x520
	bool IsInsideCloset; // 0x524
	float IsPlayingMadnessTierUpWeight; // 0x528
	bool IsBeingKilled; // 0x52c
	bool IsCarryAttackSucess; // 0x52d
	bool IsUsingAimItem; // 0x52e
	bool IsHoldingAimItem; // 0x52f
	bool AllowLookAt; // 0x530
	float DropStaggerTimeLeft; // 0x534
	float RightArmIKAlpha; // 0x538
	FTransform RightHandIKTransform; // 0x540
	bool Strafe; // 0x570
	bool IsInteracting; // 0x571
	bool Injured; // 0x572
	EInteractionAnimation interactionType; // 0x573
	EInteractionAnimation PreviousInteractionType; // 0x574
	bool IsSlasherInFPV; // 0x575
	float CarriedAlpha; // 0x578
	bool IsHoldingHandleItem; // 0x57c
	bool IsHoldingSmallItem; // 0x57d
	bool IsHoldingFirecracker; // 0x57e
	bool IsHoldingFlashbang; // 0x57f
	bool IsHoldingVaccine; // 0x580
	bool IsHoldingAnyItem; // 0x581
	bool IsHoldingLamentConfiguration; // 0x582
	bool IsHoldingFragileObject; // 0x583
	bool IsArmOverrideDisabled; // 0x584
	bool InAir; // 0x585
	float _walkAnimSpeed; // 0x588
	float Direction; // 0x58c
	float Pitch; // 0x590
	float Yaw; // 0x594
	FVector RightFootEffectorLocation; // 0x598
	FVector LeftFootEffectorLocation; // 0x5a4
	bool Idle; // 0x5b0
	float MyTime; // 0x5b4
	bool HasAnyMontagePlaying; // 0x5b8
	FName CurrentlyPlayerMontageId; // 0x5bc
	bool IsBeingCarriedByTheSpirit; // 0x5c8
	bool IsBeingCarriedByTheNightmare; // 0x5c9
	bool IsBeingCarriedByThePig; // 0x5ca
	bool IsBeingCarriedByTheHag; // 0x5cb
	bool IsBeingCarriedByTheLegion; // 0x5cc
	bool IsBeingCarriedByTheGhostFace; // 0x5cd
	bool IsUsingDeadHard; // 0x5ce
	bool IsPlayingWakeUpOther; // 0x5cf
	bool IsPlayingFreddyMori; // 0x5d0
	bool IsHealingKOCamper; // 0x5d1
	bool HasLinkInput; // 0x5d2
};

struct UParticleModuleLocationPrimitiveSphere_Seeded : UParticleModuleLocationPrimitiveSphere {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xe8
};

struct UHudPresenter : UPresenter {
	ADBDPlayer* _presentedCharacter; // 0xe0
	ADBDPlayer* _pendingCharacter; // 0xe8
	ADBDSpectator* _spectatorPawn; // 0xf0
};

struct UUMGBloodStoreArrayWidget : UMobileBaseUserWidget {
	UUMGBloodStoreRowWidget* FirstBloodStoreRowWidget; // 0x310
	UUMGBloodStoreRowWidget* SecondBloodStoreRowWidget; // 0x318
	UUMGBloodStoreRowWidget* ThirdBloodStoreRowWidget; // 0x320
	UUMGBloodStoreRowWidget* FourthBloodStoreRowWidget; // 0x328
	UUMGBloodStoreRowWidget* FifthBloodStoreRowWidget; // 0x330
};

struct USignificanceManager : UObject {
	FSoftClassPath SignificanceManagerClassName; // 0x110
};

struct UNatObjectRandomizer : UObjectRandomizer {
	TArray<FPotentialRandomizableSpawnerPool> PotentialRandomizableSpawnerPools; // 0x228
};

struct ADBDAIBTController : ADBDAIController {
	UBehaviorTree* BehaviorTree; // 0x5d8
	TArray<UAISkill*> BaseSkills; // 0x5e0
	TArray<UAISkill*> RoleSkills; // 0x5f0
	TArray<FAISkillPerk> PerkSkills; // 0x600
	bool ListenToAttackEvents; // 0x610
	UDBDAIPerceptionComponent* _dbdPerception; // 0x618
	UDBDBlackboardComponent* _dbdBlackboard; // 0x620
	UDBDPathFollowingComponent* _dbdPathFollowing; // 0x628
	UDBDBehaviorTreeComponent* _dbdBehaviorTree; // 0x630
	UDBDNavMeshExplorerComponent* _navMeshExplorer; // 0x638
	UDBDAIStateComponent* _aiState; // 0x640
	UDBDAIGoalComponent* _aiGoal; // 0x648
	TMap<FGameplayTag, UBehaviorTree*> _setDynamicSubtrees; // 0x660
	TArray<UAISkill*> _aiSkills; // 0x6b0
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x30
	ANavigationData* AbstractNavData; // 0x38
	FName DefaultAgentName; // 0x40
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x50
	char bAutoCreateNavigationData : 1; // 0x80
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x80
	char bAllowClientSideNavigation : 1; // 0x80
	char bShouldDiscardSubLevelNavData : 1; // 0x80
	char bTickWhilePaused : 1; // 0x80
	char bSupportRebuilding : 1; // 0x80
	char bInitialBuildingLocked : 1; // 0x80
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x81
	ENavDataGatheringModeConfig DataGatheringMode; // 0x84
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x88
	float ActiveTilesUpdateInterval; // 0x8c
	TArray<FNavDataConfig> SupportedAgents; // 0x90
	FNavAgentSelector SupportedAgentsMask; // 0xa0
	TArray<ANavigationData*> NavDataSet; // 0xa8
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xb8
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xd8
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xe8
	FNavigationSystemRunMode OperationMode; // 0x1e0
	float DirtyAreasUpdateFreq; // 0x53c
};

struct UActorClipperComponent : UActorComponent {
	USphereComponent* Shape; // 0xb8
	TMap<AActor*, FClippedActor> _clippedActors; // 0xc0
	TWeakObjectPtr<UPrimitiveCollection> _clippables; // 0x110
};

struct UWidget : UVisual {
	UPanelSlot* Slot; // 0x30
	FDelegate bIsEnabledDelegate; // 0x38
	FText ToolTipText; // 0x50
	FDelegate ToolTipTextDelegate; // 0x68
	UWidget* ToolTipWidget; // 0x80
	FDelegate ToolTipWidgetDelegate; // 0x88
	FDelegate VisibilityDelegate; // 0x9c
	FWidgetTransform RenderTransform; // 0xb0
	FVector2D RenderTransformPivot; // 0xcc
	char bIsVariable : 1; // 0xd4
	char bCreatedByConstructionScript : 1; // 0xd4
	char bIsEnabled : 1; // 0xd4
	char bOverride_Cursor : 1; // 0xd4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xd8
	char bIsVolatile : 1; // 0xe0
	EMouseCursor Cursor; // 0xe1
	EWidgetClipping Clipping; // 0xe2
	ESlateVisibility Visibility; // 0xe3
	float RenderOpacity; // 0xe4
	UWidgetNavigation* Navigation; // 0xe8
	EFlowDirectionPreference FlowDirectionPreference; // 0xf0
	TArray<UPropertyBinding*> NativeBindings; // 0x118
};

struct USaboteur : UPerk {
	float _cooldownDuration[0x3]; // 0x3d0
	float _revealHookDistance[0x3]; // 0x3dc
	TArray<UMeatHookOutlineUpdateStrategy*> _revealedMeatHooksOultineStrategy; // 0x3e8
};

struct ABaseVFX : AActor {
	bool _shouldLoadOnServer; // 0x230
};

struct UARTrackedObject : UARTrackedGeometry {
	UARCandidateObject* DetectedObject; // 0xf0
};

struct UAkHololensInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkHololensAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UAB_Menu_Slasher01_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2b0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2d0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x2f0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x750
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0xbb0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1010
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1470
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x18d0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x1970
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x19e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1a88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1b00
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1b78
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1bb0
	bool Role Selected; // 0x1c60
	bool Is Online; // 0x1c61
};

struct USharedAuthenticationMigrateComponent : UObject {
	UObject* _worldContextObject; // 0x30
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x48
};

struct ADBDInGameHud : ADBDBaseHud {
	UFont* _debugFontObj; // 0x330
	UCompetenceDebugger* _competenceDebugger; // 0x350
};

struct UOnlineEngineInterfaceImpl : UOnlineEngineInterface {
	FName VoiceSubsystemNameOverride; // 0x30
};

struct UMovieSceneSequencePlayer : UObject {
	FMulticastInlineDelegate OnPlay; // 0x410
	FMulticastInlineDelegate OnPlayReverse; // 0x420
	FMulticastInlineDelegate OnStop; // 0x430
	FMulticastInlineDelegate OnPause; // 0x440
	FMulticastInlineDelegate OnFinished; // 0x450
	EMovieScenePlayerStatus Status; // 0x460
	char bReversePlayback : 1; // 0x464
	UMovieSceneSequence* Sequence; // 0x468
	FFrameNumber StartTime; // 0x470
	int32_t DurationFrames; // 0x474
	int32_t CurrentNumLoops; // 0x478
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x490
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x4a8
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x830
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x840
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x150
	char bReverseAsBrake : 1; // 0x150
	char bUseRVOAvoidance : 1; // 0x150
	char bRawHandbrakeInput : 1; // 0x150
	char bRawGearUpInput : 1; // 0x150
	char bRawGearDownInput : 1; // 0x150
	char bWasAvoidanceUpdated : 1; // 0x154
	float Mass; // 0x158
	TArray<FWheelSetup> WheelSetups; // 0x160
	float DragCoefficient; // 0x170
	float ChassisWidth; // 0x174
	float ChassisHeight; // 0x178
	float DragArea; // 0x17c
	float EstimatedMaxEngineSpeed; // 0x180
	float MaxEngineRPM; // 0x184
	float DebugDragMagnitude; // 0x188
	FVector InertiaTensorScale; // 0x18c
	float MinNormalizedTireLoad; // 0x198
	float MinNormalizedTireLoadFiltered; // 0x19c
	float MaxNormalizedTireLoad; // 0x1a0
	float MaxNormalizedTireLoadFiltered; // 0x1a4
	float ThresholdLongitudinalSpeed; // 0x1a8
	int32_t LowForwardSpeedSubStepCount; // 0x1ac
	int32_t HighForwardSpeedSubStepCount; // 0x1b0
	TArray<UVehicleWheel*> Wheels; // 0x1b8
	float RVOAvoidanceRadius; // 0x1e0
	float RVOAvoidanceHeight; // 0x1e4
	float AvoidanceConsiderationRadius; // 0x1e8
	float RVOSteeringStep; // 0x1ec
	float RVOThrottleStep; // 0x1f0
	int32_t AvoidanceUID; // 0x1f4
	FNavAvoidanceMask AvoidanceGroup; // 0x1f8
	FNavAvoidanceMask GroupsToAvoid; // 0x1fc
	FNavAvoidanceMask GroupsToIgnore; // 0x200
	float AvoidanceWeight; // 0x204
	FVector PendingLaunchVelocity; // 0x208
	FReplicatedVehicleState ReplicatedState; // 0x214
	float RawSteeringInput; // 0x22c
	float RawThrottleInput; // 0x230
	float RawBrakeInput; // 0x234
	float SteeringInput; // 0x238
	float ThrottleInput; // 0x23c
	float BrakeInput; // 0x240
	float HandbrakeInput; // 0x244
	float IdleBrakeInput; // 0x248
	float StopThreshold; // 0x24c
	float WrongDirectionThreshold; // 0x250
	FVehicleInputRate ThrottleInputRate; // 0x254
	FVehicleInputRate BrakeInputRate; // 0x25c
	FVehicleInputRate HandbrakeInputRate; // 0x264
	FVehicleInputRate SteeringInputRate; // 0x26c
	AController* OverrideController; // 0x298
};

struct UTriplanarDecalComponent : USceneComponent {
	float MinHeight; // 0x210
	float Height; // 0x214
	float MaskIntensity; // 0x218
	UTexture2D* TopTexture; // 0x220
	UTexture2D* BottomTexture; // 0x228
	UTexture2D* MaskTexture; // 0x230
	EDetailMode MinQualitySetting; // 0x238
	UDecalComponent* _triPlanarDecal; // 0x240
	UObject* _triPlanarDecalClass; // 0x248
	UMaterial* _decalMaterial; // 0x250
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x68
	bool bLimitLODRangeForShadow; // 0x6c
	FBHVRPerDetailModeInt ShadowMinLOD; // 0x70
	FBHVRPerDetailModeInt ShadowMaxLOD; // 0x110
	float LpvBiasMultiplier; // 0x1b0
	TArray<FStaticMaterial> StaticMaterials; // 0x1b8
	float LightmapUVDensity; // 0x1c8
	int32_t LightMapResolution; // 0x1cc
	int32_t LightMapCoordinateIndex; // 0x1d0
	float DistanceFieldSelfShadowBias; // 0x1d4
	bool bOverrideComponentDetailMode; // 0x1d8
	EDetailMode DetailMode; // 0x1d9
	int32_t DetailModeBitMask; // 0x1dc
	bool bOverrideReceivesDecals; // 0x1e0
	bool bReceivesDecals; // 0x1e1
	ELightmapGenerationMode LightmapGenerationMode; // 0x1e2
	FPerPlatformFloat DefaultLDMaxDrawDistance; // 0x1e4
	UBodySetup* BodySetup; // 0x1e8
	int32_t LODForCollision; // 0x1f0
	char bGenerateMeshDistanceField : 1; // 0x1f4
	char bStripComplexCollisionForConsole : 1; // 0x1f4
	char bHasNavigationData : 1; // 0x1f4
	char bSupportUniformlyDistributedSampling : 1; // 0x1f4
	char bSupportPhysicalMaterialMasks : 1; // 0x1f4
	char bIsBuiltAtRuntime : 1; // 0x1f4
	EBatchingMode BatchingMode; // 0x1f5
	int32_t BatchingDiameter; // 0x1f8
	char bAllowCPUAccess : 1; // 0x1fc
	char bSupportGpuUniformlyDistributedSampling : 1; // 0x1fc
	TArray<UStaticMeshSocket*> Sockets; // 0x220
	FVector PositiveBoundsExtension; // 0x240
	FVector NegativeBoundsExtension; // 0x24c
	FBoxSphereBounds ExtendedBounds; // 0x258
	int32_t ElementToIgnoreForTexFactor; // 0x274
	TArray<UAssetUserData*> AssetUserData; // 0x278
	UObject* EditableMesh; // 0x290
	UNavCollisionBase* NavCollision; // 0x298
};

struct UUMGMenuEventsBanner : UUMGMenuBaseBanner {
	UImage* EventsIcon; // 0x470
	UTextBlock* FallbackTitle; // 0x478
};

struct UActivePhaseWalkInteraction : UChargeableInteractionDefinition {
	FTunableStat _fullyChargedSpeed; // 0x6d8
	UCurveFloat* _chargingSpeedCurve; // 0x758
	FDBDTunableRowHandle _phaseWalkPenaltyThreshold; // 0x760
	FDBDTunableRowHandle _phaseWalkPenaltyValue; // 0x788
	FTunableStat _activePhaseWalkChargeDuration; // 0x7b8
	UAnimMontage* _activePhaseWalkChargingMontage; // 0x838
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x38
	FName SourceName; // 0x3c
	FRawDistributionFloat SourceStrength; // 0x48
	char bLockSourceStength : 1; // 0x78
	int32_t SourceOffsetCount; // 0x7c
	TArray<FVector> SourceOffsetDefaults; // 0x80
	EParticleSourceSelectionMethod SelectionMethod; // 0x90
	char bInheritRotation : 1; // 0x94
};

struct UInputRouter : UObject {
	bool bAutoInvalidateOnHover; // 0x30
	bool bAutoInvalidateOnCapture; // 0x31
	UInputBehaviorSet* ActiveInputBehaviors; // 0x40
};

struct UDBDGameUserSettings : UGameUserSettings {
	TArray<FInputActionKeyMapping> ActionMappings; // 0x128
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x138
	FMulticastInlineDelegate OnSetCustomizedHudsTimestamp; // 0x148
	FString DeviceLoginTokenID; // 0x158
	int32_t ScalabilityLevel; // 0x168
	bool AutoScalabilitySet; // 0x16c
	bool AutoAdjust; // 0x16d
	int32_t ScreenResolution; // 0x170
	bool FullScreen; // 0x174
	int32_t MenuScaleFactor; // 0x178
	int32_t HudScaleFactor; // 0x17c
	int32_t SkillCheckScaleFactor; // 0x180
	bool LargeText; // 0x184
	bool HUDPlayerNamesVisibility; // 0x185
	bool HUDKillerHookCountVisibility; // 0x186
	bool HUDScoreEventsVisibility; // 0x187
	uint32_t FPSLimit; // 0x188
	int32_t MainVolume; // 0x18c
	bool MainVolumeOn; // 0x190
	int32_t MenuMusicVolume; // 0x194
	bool MenuMusicVolumeOn; // 0x198
	bool UseHeadphones; // 0x199
	bool MuteOnFocusLost; // 0x19a
	int32_t KillerCameraSensitivity; // 0x19c
	int32_t SurvivorCameraSensitivity; // 0x1a0
	int32_t KillerMouseSensitivity; // 0x1a4
	int32_t SurvivorMouseSensitivity; // 0x1a8
	int32_t KillerControllerSensitivity; // 0x1ac
	int32_t SurvivorControllerSensitivity; // 0x1b0
	bool AimAssist; // 0x1b4
	int32_t ControlType; // 0x1b8
	bool InvertY; // 0x1bc
	bool SurvivorInvertY; // 0x1bd
	bool KillerToggleInteractions; // 0x1be
	bool SurvivorToggleInteractions; // 0x1bf
	bool SprintToCancel; // 0x1c0
	FString Language; // 0x1c8
	bool LanguageIsDefinedByPlayer; // 0x1d8
	int32_t HighestWeightSeenNews; // 0x1dc
	FSharedAuthenticationTokenInformation SharedLoginInformation; // 0x1e0
	uint32_t LastPanelContextId; // 0x210
	bool ArchivesAutoPlayVoiceOver; // 0x214
	bool HasAcceptedCrossplayPopup; // 0x215
	bool HasAcceptedCrossProgressionPopup; // 0x216
	bool UseAtlantaCustomizedHuds; // 0x217
	bool UseAtlantaSurvivorQuickTurn; // 0x218
	bool UseAtlantaKillerQuickTurn; // 0x219
	TArray<FAtlantaCustomizedHudSettings> AtlantaCustomizedHuds; // 0x220
	bool ShowPortraitBorder; // 0x238
	FString PartyPrivacyState; // 0x240
	int32_t ColorBlindMode; // 0x298
	int32_t ColorBlindModeIntensity; // 0x29c
	bool BeginnerMode; // 0x2a0
	bool Subtitles; // 0x2a1
	int32_t SubtitlesBackgroundOpacity; // 0x2a4
	int32_t SubtitlesSize; // 0x2f0
};

struct UK26PowerChargePresentationPowerFadeComponent : UPresentationPowerFadeComponent {
	UK26AmmoHandlerComponent* _ammoHandler; // 0xb8
};

struct UBTDecorator_IsGameState : UBTDecorator_TickableBase {
	EArithmeticKeyOperation RemainingObjectiveOp; // 0x70
	int32_t NbRemainingObjectives; // 0x74
	EArithmeticKeyOperation SurvivorsLeftOp; // 0x78
	int32_t NbSurvivorsLeft; // 0x7c
};

struct AChaosSolverActor : AActor {
	float TimeStepMultiplier; // 0x230
	int32_t CollisionIterations; // 0x234
	int32_t PushOutIterations; // 0x238
	int32_t PushOutPairIterations; // 0x23c
	float ClusterConnectionFactor; // 0x240
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x244
	bool DoGenerateCollisionData; // 0x245
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x248
	bool DoGenerateBreakingData; // 0x258
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x25c
	bool DoGenerateTrailingData; // 0x26c
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x270
	bool bHasFloor; // 0x280
	float FloorHeight; // 0x284
	float MassScale; // 0x288
	bool bGenerateContactGraph; // 0x28c
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x28d
	UBillboardComponent* SpriteComponent; // 0x290
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x2b0
};

struct UPathStrategy : UObject {
	TArray<UPathBuilder*> DefaultPathBuilders; // 0x40
	float RefreshPartialPathDelay; // 0x50
	float StartNextBranchBuildDelay; // 0x54
	ADBDAIBTController* _aiOwner; // 0x58
	TArray<UPathBuilder*> _pathBuilders; // 0x60
};

struct UAkAudioType : UObject {
	uint32_t ShortID; // 0x30
	TArray<UObject*> UserData; // 0x38
};

struct USoundfieldEffectBase : UObject {
	USoundfieldEffectSettingsBase* Settings; // 0x30
};

struct UBTTask_ExtWait : UBTTask_Wait {
	FAITunableParameter WaitTimeInterval; // 0x80
	FAITunableParameter WaitRandomDeviation; // 0x90
};

struct UMovieSceneParticleTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> ParticleSections; // 0x60
};

struct UPowerButton : UMobileBaseUserWidget {
	UActionButton* Button; // 0x300
	UCanvasPanel* SwitchIcon; // 0x308
	UCanvasPanel* CountContainer; // 0x310
	UCanvasPanel* RadialProgressBarContainer; // 0x318
	UTextBlock* CountLabel; // 0x320
	UImage* TierImage; // 0x328
	UCanvasPanel* AddonsContainer; // 0x330
	UUMGInventoryItemButton* FirstAddonSlot; // 0x338
	UUMGInventoryItemButton* SecondAddonSlot; // 0x340
	UProgressBar* FillPowerChargeProgression; // 0x348
	float DisabledOpacity; // 0x350
	float EnabledOpacity; // 0x354
	bool EnabledLongPressed; // 0x358
	int32_t _itemCount; // 0x35c
};

struct UCoreButtonPromptWidget : UCoreBaseUserWidget {
	UAkAudioEvent* CursorOverSfx; // 0x2d8
	UAkAudioEvent* CursorPressSfx; // 0x2e0
	UAkAudioEvent* CursorReleaseSfx; // 0x2e8
	UCoreInputPromptTextWidget* _inputPromptText; // 0x2f0
	UTextBlock* _buttonTextField; // 0x2f8
	FMulticastInlineDelegate _buttonPromptTriggeredDelegate; // 0x300
};

struct UMontagePlayer : UActorComponent {
	FMulticastInlineDelegate OnMontageStarted; // 0xb8
	FMulticastInlineDelegate OnMontageEnded; // 0x110
	UDataTable* _animationMappingsTable; // 0x180
	UDataTable* _playerSpecificMappingsTable; // 0x188
	UAnimMontage* _currentlyPlayingMontage; // 0x190
	TArray<FMontageInstanceInfo> _activeMontagesInfo; // 0x1b0
	FName _outSectionName; // 0x1c0
	float _timeBeforeOut; // 0x1cc
	USkeletalMeshComponent* _skeletalMeshComponent; // 0x1d0
	TMap<UAnimMontage*, FName> _montageToNameMap; // 0x200
};

struct UWidgetBlueprintGeneratedClass : UBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x338
	char bAllowTemplate : 1; // 0x340
	char bAllowDynamicCreation : 1; // 0x340
	char bValidTemplate : 1; // 0x340
	char bTemplateInitialized : 1; // 0x340
	char bCookedTemplate : 1; // 0x340
	char bClassRequiresNativeTick : 1; // 0x340
	TArray<FDelegateRuntimeBinding> Bindings; // 0x348
	TArray<UWidgetAnimation*> Animations; // 0x358
	TArray<FName> NamedSlots; // 0x368
	TSoftObjectPtr<UUserWidget> TemplateAsset; // 0x378
	UUserWidget* Template; // 0x3a8
};

struct UDBDAtlantaStructuredData : UObject {
	TSoftClassPtr<UObject> AtlantaHeartbeatActor; // 0x30
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x38
	float DistributeOverNPoints; // 0x80
	float DistributeThreshold; // 0x84
};

struct UPaperTerrainComponent : UPrimitiveComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x428
	bool bClosedSpline; // 0x430
	bool bFilledSpline; // 0x431
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x438
	int32_t RandomSeed; // 0x440
	float SegmentOverlapAmount; // 0x444
	FLinearColor TerrainColor; // 0x448
	int32_t ReparamStepsPerSegment; // 0x458
	ESpriteCollisionMode SpriteCollisionDomain; // 0x45c
	float CollisionThickness; // 0x460
	UBodySetup* CachedBodySetup; // 0x468
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x40
	bool bAutoSize; // 0x68
	int32_t ZOrder; // 0x6c
};

struct UAnimSharingStateInstance : UAnimInstance {
	UAnimSequence* AnimationToPlay; // 0x270
	float PermutationTimeOffset; // 0x278
	float PlayRate; // 0x27c
	bool bStateBool; // 0x280
	UAnimSharingInstance* Instance; // 0x288
};

struct UPlayerLevelTooltipWidget : UBaseTooltipWidget {
	UUMGTooltipContentPlayerLevelWidget* PlayerLevelContent; // 0x338
};

struct AVideoThumbnailPlayer : AActor {
	UMediaPlayer* MediaPlayer; // 0x250
	UMediaSoundComponent* SoundComponent; // 0x258
	UUserWidget* VideoPlayerWidget; // 0x260
	UAudioComponent* _audioComponent; // 0x268
	TSoftObjectPtr<UMediaSource> _source; // 0x288
};

struct UAISkill_FindCollectable_Searchable : UAISkill_FindCollectable {
	float SearchIntervalAfterOpenSearchable; // 0x120
	float OpenSearchableRelevancyDuration; // 0x124
	ASearchable* _relevantSearchable; // 0x130
};

struct UGameEventTracker : UObject {
	FMulticastInlineDelegate OnGameplayEvent; // 0x30
	FMulticastInlineDelegate OnGameflowEvent; // 0x40
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x30
	char bScaleMomentumByMass : 1; // 0x30
	char bRadialDamageVelChange : 1; // 0x30
	float DamageImpulse; // 0x34
	float DestructibleImpulse; // 0x38
	float DestructibleDamageSpreadScale; // 0x3c
	float DamageFalloff; // 0x40
};

struct UBuildPatchManifest : UObject {
	char ManifestFileVersion; // 0x30
	bool bIsFileData; // 0x31
	uint32_t AppID; // 0x34
	FString AppName; // 0x38
	FString BuildVersion; // 0x48
	FString LaunchExe; // 0x58
	FString LaunchCommand; // 0x68
	TSet<FString> PrereqIds; // 0x78
	FString PrereqName; // 0xc8
	FString PrereqPath; // 0xd8
	FString PrereqArgs; // 0xe8
	TArray<FFileManifestData> FileManifestList; // 0xf8
	TArray<FChunkInfoData> ChunkList; // 0x108
	TArray<FCustomFieldData> CustomFields; // 0x118
};

struct AMagicLeapSharedWorldGameState : AGameState {
	FMagicLeapSharedWorldSharedData SharedWorldData; // 0x2a8
	FMagicLeapSharedWorldAlignmentTransforms AlignmentTransforms; // 0x2b8
	FMulticastInlineDelegate OnSharedWorldDataUpdated; // 0x2c8
	FMulticastInlineDelegate OnAlignmentTransformsUpdated; // 0x2d8
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x30
	int32_t NumConsumedReservations; // 0x3c
	int32_t MaxReservations; // 0x40
	bool bRestrictCrossConsole; // 0x44
	TArray<FSpectatorReservation> Reservations; // 0x48
};

struct UAB_Menu_Slasher18_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2b0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x350
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x468
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e0
	bool Role Selected; // 0x558
	bool Is Online; // 0x559
};

struct UUMGCharacterScrollingInfoWidget : UMobileBaseUserWidget {
	UUMGTeachablePerkButton* FirstTeachablePerk; // 0x300
	UUMGTeachablePerkButton* SecondTeachablePerk; // 0x308
	UUMGTeachablePerkButton* ThirdTeachablePerk; // 0x310
	UCanvasPanel* KillerInfoPanel; // 0x318
	UUMGInventoryItemButton* KillerPower; // 0x320
	UUMGHtmlRichText* CharacterBackstoryBox; // 0x328
	FText _killerPowerName; // 0x330
	FText _killerSpeedText; // 0x348
	FText _killerTerrorRadiusText; // 0x360
	FText _killerHeightText; // 0x378
	FText _perksTitle; // 0x390
	FText _teachablesTitle; // 0x3a8
	FText _powerTitle; // 0x3c0
	FText _attributesTitle; // 0x3d8
	UTextBlock* FirstTeachablePerkText; // 0x3f0
	UTextBlock* SecondTeachablePerkText; // 0x3f8
	UTextBlock* ThirdTeachablePerkText; // 0x400
	FText _backStoryTitle; // 0x408
	FMulticastInlineDelegate _onTeachableTooltipTriggeredEvent; // 0x440
	FMulticastInlineDelegate _onPowerButtonTooltipLongPressEvent; // 0x450
};

struct AK26PathPart : AActor {
	UStaticMeshComponent* _mesh; // 0x230
	UDBDOutlineComponent* _outlineComponent; // 0x238
	UNiagaraComponent* _visualEffectKiller; // 0x240
	UNiagaraComponent* _visualEffectSurvivor; // 0x248
	UK26PowerOutlineUpdateStrategy* _outlineUpdateStrategy; // 0x250
	USceneComponent* _rootComponent; // 0x258
	bool _isVisibleForSurvivor; // 0x260
	bool _isVisibleForKiller; // 0x261
};

struct ABP_Menu_Slasher16_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_16_C* BP_Audio_KLR_17; // 0x698
};

struct UParticleModuleRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionFloat StartRotationRate; // 0x38
};

struct URenderingFeaturesSequencer : UObject {
	ADBDAggregateCullDistanceVolumes* _aggregateCullDistanceVolumes; // 0x40
	UWorld* _world; // 0x48
};

struct UCurrencyProgressionTooltipWidget : UCoreBaseUserWidget {
	UDBDTextBlock* CurrencyTB; // 0x2d8
	UDBDTextBlock* CurrencyTitleTB; // 0x2e0
	UDBDRichTextBlock* CurrencyDescriptionRTB; // 0x2e8
	UDBDImage* TitleBgIMG; // 0x2f0
};

struct UUMGSettingSubscriptionStatus : UUserWidget {
	FText SubscriptionStatusText; // 0x260
	FText StatusText; // 0x278
	FText InactiveStatusText; // 0x290
	FText EndText; // 0x2a8
	UWidgetSwitcher* TypeSwitcher; // 0x2c0
	UHorizontalBox* ActiveWidget; // 0x2c8
	UOverlay* InactiveWidget; // 0x2d0
	UTextBlock* TitleText; // 0x2d8
	UTextBlock* DisplayName; // 0x2e0
	UTextBlock* Status; // 0x2e8
	UTextBlock* StatusInactive; // 0x2f0
	UTextBlock* End; // 0x2f8
	UTextBlock* EndDate; // 0x300
};

struct USourceEffectBitCrusherPreset : USoundEffectSourcePreset {
	FSourceEffectBitCrusherSettings Settings; // 0x78
};

struct UUMGMainMenuMonthlyPassButton : UMobileBaseUserWidget {
	UWidgetSwitcher* ButtonSwitcher; // 0x300
	UButton* ActiveButton; // 0x308
	UButton* NonActiveButton; // 0x310
	FText playerName; // 0x318
	UAkAudioEvent* OnClickSound; // 0x330
};

struct UTriggerTimerOnLacerationAlmostFullEffect : UStatusEffect {
	ULacerationComponent* _lacerationComponent; // 0x350
	float _duration; // 0x358
};

struct UAICharacterBehaviourInteractWithActorData : UAICharacterBehaviourData {
	AActor* TargetActor; // 0x30
	ECharacterMovementTypes characterMovementType; // 0x48
	bool usePathfinding; // 0x49
};

struct UPaperFlipbook : UObject {
	float FramesPerSecond; // 0x30
	TArray<FPaperFlipbookKeyFrame> KeyFrames; // 0x38
	UMaterialInterface* DefaultMaterial; // 0x48
	EFlipbookCollisionMode CollisionSource; // 0x50
};

struct UAnimSequenceBase : UAnimationAsset {
	TArray<FAnimNotifyEvent> Notifies; // 0x88
	float SequenceLength; // 0x98
	float RateScale; // 0x9c
	FRawCurveTracks RawCurveData; // 0xa0
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x48
	FGuid ExpressionGUID; // 0x58
};

struct UInterpTrackFloatProp : UInterpTrackFloatBase {
	FName PropertyName; // 0x98
};

struct UAssetLibrary : UObject {
	UObjectLibrary* _objectLibrary; // 0x38
	float SecondsDelayBetweenBatch; // 0xa4
};

struct UPrisonChainAddon : UItemAddon {
	FDBDTunableRowHandle _maxTensionCharge; // 0x298
	float _tensionChargeModifier; // 0x2c0
};

struct ABP_Menu_Slasher20_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_20_C* BP_Audio_KLR_21; // 0x698
};

struct ARespawnableInteractable : AInteractable {
	FMulticastInlineDelegate OnInteractionEnded; // 0x328
	FMulticastInlineDelegate OnIsInteractingChanged; // 0x338
	bool _isHidden; // 0x348
};

struct UImage : UWidget {
	FSlateBrush Brush; // 0x128
	FDelegate BrushDelegate; // 0x1b8
	FLinearColor ColorAndOpacity; // 0x1cc
	FDelegate ColorAndOpacityDelegate; // 0x1dc
	bool bFlipForRightToLeftFlowDirection; // 0x1f0
	FDelegate OnMouseButtonDownEvent; // 0x1f4
};

struct UReverbEffect : UObject {
	float Density; // 0x30
	float Diffusion; // 0x34
	float Gain; // 0x38
	float GainHF; // 0x3c
	float DecayTime; // 0x40
	float DecayHFRatio; // 0x44
	float ReflectionsGain; // 0x48
	float ReflectionsDelay; // 0x4c
	float LateGain; // 0x50
	float LateDelay; // 0x54
	float AirAbsorptionGainHF; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x48
	ESceneTextureId SceneTextureId; // 0x64
	bool bFiltered; // 0x65
};

struct UBP_Audio_KLR_01_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UAB_Menu_Slasher24_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x328
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3a0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x440
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4b8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
	bool _interrupt02; // 0x642
	int32_t _animSwitch; // 0x644
};

struct UAB_Menu_Camper_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x300
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x328
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x358
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x390
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x408
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x4a8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x520
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x558
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x648
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x6e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x720
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x7d0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x848
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x880
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x930
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x9d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xa48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xac0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb38
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xbb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xcb8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xce8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xd20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xd40
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xd70
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xd90
	FAnimNode_SpringBone AnimGraphNode_SpringBone; // 0x11f0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1328
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1360
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1390
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x13c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1478
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1518
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1548
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1600
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1630
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1740
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1760
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1780
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1840
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1900
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x19a0
	EItemHandPosition Hand Position; // 0x1a40
	int32_t SelectedIdleIndex; // 0x1a44
	bool Role Selected; // 0x1a48
	bool Dynamic_Override; // 0x1a49
	bool Override_nea; // 0x1a4a
	bool Override_Jane; // 0x1a4b
	bool _weaponRT_adjustment; // 0x1a4c
	bool MenuInterrupt; // 0x1a4d
	ADBDMenuPlayer* DBDMenuPlayer; // 0x1a50
	EItemHandPosition Hand Position_1; // 0x1a58
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2a8
	float FOVAngle; // 0x2ac
	float OrthoWidth; // 0x2b0
	UTextureRenderTarget2D* TextureTarget; // 0x2b8
	ESceneCaptureCompositeMode CompositeMode; // 0x2c0
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x810
	char bOverride_CustomNearClippingPlane : 1; // 0x814
	float CustomNearClippingPlane; // 0x818
	bool bUseCustomProjectionMatrix; // 0x81c
	FMatrix CustomProjectionMatrix; // 0x820
	bool bEnableClipPlane; // 0x860
	FVector ClipPlaneBase; // 0x864
	FVector ClipPlaneNormal; // 0x870
	char bCameraCutThisFrame : 1; // 0x87c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x87c
	bool bDisableFlipCopyGLES; // 0x880
};

struct UGameplayTask_TimeLimitedExecution : UGameplayTask {
	FMulticastInlineDelegate OnFinished; // 0x70
	FMulticastInlineDelegate OnTimeExpired; // 0x80
};

struct UBTTask_PlayAnimation : UBTTaskNode {
	UAnimationAsset* AnimationToPlay; // 0x78
	char bLooping : 1; // 0x80
	char bNonBlocking : 1; // 0x80
	UBehaviorTreeComponent* MyOwnerComp; // 0x88
	USkeletalMeshComponent* CachedSkelMesh; // 0x90
};

struct UBP_Audio_KLR_26_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
	UAkAudioEvent* AudioStatusStartMenuEvent; // 0xf8
};

struct UDefaultOutlineUpdateStrategy : UOutlineUpdateStrategy {
	FLinearColor _revealedColorToSurvivor; // 0xc0
	FLinearColor _revealedColorToKiller; // 0xd0
};

struct UResetBearTrapInteraction : UChargeableInteractionDefinition {
	FName _enterMontageIDForBeartrap; // 0x6d8
	FName _udpateMontageIDForBeartrap; // 0x6e4
	UAnimSequence* _updateSequenceForBeartrap; // 0x6f0
	FName _exitMontageForIDBeartrap; // 0x6f8
	FName _cancelExitMontage; // 0x704
};

struct UCircularThrobber : UWidget {
	int32_t NumberOfPieces; // 0x128
	float Period; // 0x12c
	float Radius; // 0x130
	USlateBrushAsset* PieceImage; // 0x138
	FSlateBrush Image; // 0x140
	bool bEnableRadius; // 0x1d0
};

struct ADBDBasePlayer : ACharacter {
	FMulticastInlineDelegate OnCustomizationChanged; // 0x4d0
	FGameplayTagContainer _semanticGameplayTags; // 0x4e0
	UBaseGroundDetectorComponent* _leftFootGroundDetector; // 0x500
	UBaseGroundDetectorComponent* _rightFootGroundDetector; // 0x508
	int32_t _characterIndex; // 0x518
};

struct UInteractiveGizmoManager : UObject {
	TArray<FActiveGizmo> ActiveGizmos; // 0x38
	TMap<FString, UInteractiveGizmoBuilder*> GizmoBuilders; // 0x60
};

struct ADBDMenuPlayer : ADBDBasePlayer {
	bool RoleSelected; // 0x588
	bool IsOnline; // 0x589
	FMulticastInlineDelegate OnItemEquipped; // 0x590
	TSoftObjectPtr<UMaterialInterface> DarkMaterial; // 0x5a0
	EItemHandPosition _handPosition; // 0x5d0
	USkeletalMeshComponent* ItemMesh; // 0x5d8
	UMaterialHelper* MaterialHelper; // 0x5e0
	FName _equippedItemName; // 0x5e8
};

struct AGameSession : AInfo {
	int32_t MaxSpectators; // 0x230
	int32_t MaxPlayers; // 0x234
	int32_t MaxPartySize; // 0x238
	char MaxSplitscreensPerConnection; // 0x23c
	bool bRequiresPushToTalk; // 0x23d
	FName SessionName; // 0x240
};

struct AAtlantaHeartbeatActor : AActor {
	bool IsHeartbeatShown; // 0x230
};

struct UK24CheatComponent : UActorComponent {
	AZombiesManagement* _zombieManagementClass; // 0xb8
	AZombiesManagement* _zombiesManagement; // 0xc0
};

struct UDBDEmblem_SurvivorUnbroken : UDBDEmblem {
	UCurveFloat* _pointsForTimeAlive; // 0x118
	UDBDRankDesignTunables* _rankTunablesClass; // 0x130
};

struct UBlightedSerumAddon : UItemAddon {
	ACollectable* _blightedSerumCollectable; // 0x298
	UBlightedSerumDashInteraction* _dashInteraction; // 0x2a0
	int32_t _theBlightExtraTokens; // 0x2a8
	int32_t _numberOfDashesPerEvent; // 0x2ac
};

struct UPositionPlaneGizmo : UInteractiveGizmo {
	UPreviewMesh* CenterBallShape; // 0x88
	UMaterialInstance* CenterBallMaterial; // 0x90
};

struct UBTService_FindInteractor_Camper : UBTService_FindInteractor {
	EFindInteractableCamperFilter StatusFilter; // 0x218
	FAITunableParameter AllyDangerStateGoalWeight; // 0x21c
	FAITunableParameter IncapacitatedAlliesGoalWeight; // 0x22c
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x90
	UPhysicalMaterialMask* PhysMaterialMask; // 0x98
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0xa0
	FScalarMaterialInput Metallic; // 0xe0
	FScalarMaterialInput Specular; // 0xfc
	FScalarMaterialInput Anisotropy; // 0x118
	FVectorMaterialInput Normal; // 0x134
	FVectorMaterialInput Tangent; // 0x150
	FColorMaterialInput EmissiveColor; // 0x16c
	EMaterialDomain MaterialDomain; // 0x188
	EBlendMode BlendMode; // 0x189
	EDecalBlendMode DecalBlendMode; // 0x18a
	int32_t CustomDecalBlendModeChannels; // 0x18c
	EMaterialDecalResponse MaterialDecalResponse; // 0x190
	char bIsDenseGeometryBHVR : 1; // 0x194
	EMaterialShadingModel ShadingModel; // 0x198
	char bCastDynamicShadowAsMasked : 1; // 0x199
	char CastMaskedMaterialShadow : 1; // 0x19c
	FMaterialShadingModelField ShadingModels; // 0x1a0
	float OpacityMaskClipValue; // 0x1a4
	FVectorMaterialInput WorldPositionOffset; // 0x1a8
	FScalarMaterialInput Refraction; // 0x1c4
	FMaterialAttributesInput MaterialAttributes; // 0x1e0
	FScalarMaterialInput PixelDepthOffset; // 0x200
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x21c
	char bEnableSeparateTranslucency : 1; // 0x238
	char bEnableResponsiveAA : 1; // 0x238
	char bScreenSpaceReflections : 1; // 0x238
	char bContactShadows : 1; // 0x238
	char TwoSided : 1; // 0x238
	char DitheredLODTransition : 1; // 0x238
	char DitherOpacityMask : 1; // 0x238
	char bAllowNegativeEmissiveColor : 1; // 0x238
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x239
	char bEnableMobileSeparateTranslucency : 1; // 0x23a
	int32_t NumCustomizedUVs; // 0x23c
	float TranslucencyDirectionalLightingIntensity; // 0x240
	float TranslucentShadowDensityScale; // 0x244
	float TranslucentSelfShadowDensityScale; // 0x248
	float TranslucentSelfShadowSecondDensityScale; // 0x24c
	float TranslucentSelfShadowSecondOpacity; // 0x250
	float TranslucentBackscatteringExponent; // 0x254
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x258
	float TranslucentShadowStartOffset; // 0x268
	char bDisableDepthTest : 1; // 0x26c
	char bRenderFragmentOnce : 1; // 0x270
	char bWriteOnlyAlpha : 1; // 0x274
	char bGenerateSphericalParticleNormals : 1; // 0x274
	char bTangentSpaceNormal : 1; // 0x274
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x274
	char bBlockGI : 1; // 0x274
	char bUsedAsSpecialEngineMaterial : 1; // 0x274
	char bUsedWithSkeletalMesh : 1; // 0x274
	char bUsedWithEditorCompositing : 1; // 0x274
	char bUsedWithParticleSprites : 1; // 0x275
	char bUsedWithBeamTrails : 1; // 0x275
	char bUsedWithMeshParticles : 1; // 0x275
	char bUsedWithNiagaraSprites : 1; // 0x275
	char bUsedWithNiagaraRibbons : 1; // 0x275
	char bUsedWithNiagaraMeshParticles : 1; // 0x275
	char bUsedWithGeometryCache : 1; // 0x275
	char bUsedWithStaticLighting : 1; // 0x275
	char bUsedWithMorphTargets : 1; // 0x276
	char bUsedWithSplineMeshes : 1; // 0x276
	char bUsedWithInstancedStaticMeshes : 1; // 0x276
	char bUsedWithGeometryCollections : 1; // 0x276
	char bUsesDistortion : 1; // 0x276
	char bUsedWithClothing : 1; // 0x276
	char bUsedWithWater : 1; // 0x278
	char bUsedWithHairStrands : 1; // 0x278
	char bUsedWithLidarPointCloud : 1; // 0x278
	char bUsedWithUI : 1; // 0x27c
	char bAutomaticallySetUsageInEditor : 1; // 0x27c
	char bFullyRough : 1; // 0x27c
	char bUseFullPrecision : 1; // 0x27c
	char bUseLightmapDirectionality : 1; // 0x27c
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x280
	char bUseHQForwardReflections : 1; // 0x284
	char bUsePlanarForwardReflections : 1; // 0x284
	char bNormalCurvatureToRoughness : 1; // 0x284
	EMaterialTessellationMode D3D11TessellationMode; // 0x285
	char bEnableCrackFreeDisplacement : 1; // 0x286
	char bEnableAdaptiveTessellation : 1; // 0x286
	char AllowTranslucentCustomDepthWrites : 1; // 0x286
	char Wireframe : 1; // 0x286
	EMaterialShadingRate ShadingRate; // 0x287
	char bCanMaskedBeAssumedOpaque : 1; // 0x288
	char bIsMasked : 1; // 0x288
	char bIsPreviewMaterial : 1; // 0x288
	char bIsFunctionPreviewMaterial : 1; // 0x288
	char bUseMaterialAttributes : 1; // 0x288
	char bCastRayTracedShadows : 1; // 0x288
	char bUseTranslucencyVertexFog : 1; // 0x288
	char bIsSky : 1; // 0x288
	char bUseTranslucencyVolumetricFog : 1; // 0x28c
	char bComputeFogPerPixel : 1; // 0x290
	char bOutputTranslucentVelocity : 1; // 0x290
	char bAllowDevelopmentShaderCompile : 1; // 0x290
	char bIsMaterialEditorStatsMaterial : 1; // 0x290
	EBlendableLocation BlendableLocation; // 0x291
	char BlendableOutputAlpha : 1; // 0x292
	char bEnableStencilTest : 1; // 0x292
	EMaterialStencilCompare StencilCompare; // 0x293
	char StencilRefValue; // 0x294
	ERefractionMode RefractionMode; // 0x295
	int32_t BlendablePriority; // 0x298
	char bIsBlendable : 1; // 0x29c
	uint32_t UsageFlagWarnings; // 0x2a0
	float RefractionDepthBias; // 0x2a4
	FGuid StateId; // 0x2a8
	float MaxDisplacement; // 0x2b8
	FMaterialCachedExpressionData CachedExpressionData; // 0x348
};

struct UScreenBase : UObject {
	bool isAnimationDone; // 0x30
	UGFxObject* ScreenObject; // 0x38
	UScreenController* _screenController; // 0x40
};

struct UUMGTallyEmblemProgressBar : UMobileBaseUserWidget {
	UProgressBar* ProgressBar; // 0x300
	UCanvasPanel* QualityContainer; // 0x308
	TSoftClassPtr<UObject> EmblemQualityClass; // 0x310
	FVector2D _emblemQualityAlignment; // 0x340
	TMap<EEmblemQuality, FSlateBrush> _qualityFillImages; // 0x348
};

struct UOpenHatchInteraction : UChargeableInteractionDefinition {
	float SnapToEscapeLocationDuration; // 0x6d8
	FAnimationMontageDescriptor InteractionStoppedMontage; // 0x6e0
	FAnimationMontageDescriptor InteractionSucceedMontage; // 0x700
};

struct UImgMediaSource : UBaseMediaSource {
	FFrameRate FrameRateOverride; // 0x98
	FString ProxyOverride; // 0xa0
	FDirectoryPath SequencePath; // 0xb0
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x30
	TArray<USCS_Node*> AllNodes; // 0x40
	USCS_Node* DefaultSceneRootNode; // 0x50
};

struct UBlightPowerStateAdjusting : UBlightPowerState {
	bool _adjustRotationOnCollision; // 0x180
	bool _bounceAwayFromCollision; // 0x181
	bool _allowNavigation; // 0x182
	bool _smashBreakables; // 0x183
	FDBDTunableRowHandle _maxDistanceForSurvivorFacing; // 0x188
};

struct USoundNodeDialoguePlayer : USoundNode {
	FDialogueWaveParameter DialogueWaveParameter; // 0x50
	char bLooping : 1; // 0x70
};

struct ULiveLinkSourceSettings : UObject {
	ELiveLinkSourceMode Mode; // 0x30
	FLiveLinkSourceBufferManagementSettings BufferSettings; // 0x38
	FString ConnectionString; // 0x88
	ULiveLinkSourceFactory* Factory; // 0x98
};

struct APumpkin : ASpecialBehaviourInteractable {
	FName _specialBehaviourId; // 0x330
	EPumpkinType _pumpkinType; // 0x33c
	UPumpkinInteraction* _pumpkinInteraction; // 0x340
	UPumpkinInteraction* _pumpkinInteractionKiller; // 0x348
	UChargeableComponent* _pumpkinInteractionChargeable; // 0x350
	UChargeableComponent* _pumpkinInteractionChargeableKiller; // 0x358
	UInteractor* _pumpkinInteractor; // 0x360
	UPrimitiveComponent* _pumpkinInteractionZone; // 0x368
	UDBDOutlineComponent* _outlineComponent; // 0x370
	USkeletalMeshComponent* _pumpkinSkeletalMesh; // 0x378
	FDBDTunableRowHandle _pumpkinInteractionSecondsToCharge; // 0x380
	FDBDTunableRowHandle _pumpkinInteractionSecondsToChargeKiller; // 0x3a8
	FLinearColor _auraColorWhileInteracting; // 0x3d0
	FDBDTunableRowHandle _pumpkinTreatChance; // 0x3e0
	FDBDTunableRowHandle _pumpkinTrickChance; // 0x408
	FDBDTunableRowHandle _pumpkinTreatDuration; // 0x430
	FDBDTunableRowHandle _pumpkinTrickDuration; // 0x458
	FDBDTunableRowHandle _pumpkinSpeedBoost; // 0x480
	FDBDTunableRowHandle _pumpkinSpeedDebuff; // 0x4a8
	UStatusEffect* _pumpkinStatusEffect; // 0x4d0
};

struct UUMGAtlantaMatchConfigPageScroll : UUMGGridPageScrollWidget {
	FCustomMatchTabConfig CharactersTabConfig; // 0x438
	FCustomMatchTabConfig InventoryTabConfig; // 0x478
	FCustomMatchTabConfig MapTabConfig; // 0x4b8
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x88
	FAIDataProviderFloatValue ConeDegrees; // 0xc8
	FAIDataProviderFloatValue AngleStep; // 0x108
	FAIDataProviderFloatValue Range; // 0x148
	UEnvQueryContext* CenterActor; // 0x188
	char bIncludeContextLocation : 1; // 0x190
};

struct UPortalSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isDestroyingPortal; // 0x530
	bool _isSpooked; // 0x531
	bool _hasSkillCheckFailed; // 0x532
};

struct UWidgetAnimation : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x350
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x358
	bool bLegacyFinishOnStop; // 0x368
	FString DisplayLabel; // 0x370
};

struct UForceFeedbackEffect : UObject {
	TArray<FForceFeedbackChannelDetails> ChannelDetails; // 0x30
	float Duration; // 0x40
};

struct UHasFlag : UEventDrivenModifierCondition {
	FGameplayTag _flag; // 0xe8
};

struct UOnlineMessagesContainerComponent : UActorComponent {
	TArray<FInboxMessageData> _messages; // 0xb8
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UAndroidPermissionCallbackProxy : UObject {
	FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate; // 0x30
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x38
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x40
};

struct UTutorialNotificationController : UObject {
	FMulticastInlineDelegate OnBlockingNotificationDismissedEvent; // 0x30
};

struct UAnimationWidget : UUserWidget {
	float _playRate; // 0x260
};

struct UPerkCollectionComponent : UActorComponent {
	TArray<UPerk*> _array; // 0xb8
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0xe8
	FVector FailsafeExtent; // 0xf0
	char bIncludeAgentHeight : 1; // 0xfc
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x30
};

struct UDeception : UPerk {
	float _noScratchMarksDuration[0x3]; // 0x3d0
	float _perkCooldownDuration[0x3]; // 0x3dc
	UStatusEffect* _statusEffect; // 0x3e8
	UManualIconStrategy* _iconStrategy; // 0x3f8
};

struct UTransformMeshesToolProperties : UInteractiveToolPropertySet {
	ETransformMeshesTransformMode TransformMode; // 0x58
	bool bSetPivot; // 0x59
	bool bEnableSnapDragging; // 0x5a
	ETransformMeshesSnapDragSource SnapDragSource; // 0x5b
	ETransformMeshesSnapDragRotationMode RotationMode; // 0x5c
};

struct ULoopBannerProvider : UObject {
	int32_t _currentLoopIndex; // 0x40
};

struct ADBDGeneratorDrivenReflectionCaptureActor : AGeneratorDrivenActor {
	UGenyReflectionCaptureComponent* genyReflectionCapture; // 0x258
};

struct UUMGAtlantaRitualsScreen : UMobileBaseUserWidget {
	UUMGAtlantaRitualTab* DailyTab; // 0x300
	UUMGAtlantaRitualTab* WeeklyTab; // 0x308
	FText _atlantaRitualTitle; // 0x310
	FText _endInLabel; // 0x328
	FText _dailyButtonLabel; // 0x340
	FText _weeklyButtonLabel; // 0x358
	FText _dailyRemainingTime; // 0x370
	FText _weeklyRemainingTime; // 0x388
};

struct UK25ChainStrikeInteraction : UChargeableInteractionDefinition {
	UFiniteStateMachine* _chainStrikeStateMachineclass; // 0x6d8
	float _repossessFadeOutTime; // 0x6e0
	FDBDTunableRowHandle _repossessFadeInTime; // 0x6e8
	UCurveFloat* _gatewayPossessionFovModifierCurve; // 0x710
	UCurveFloat* _controlledProjectilePossessionFovModifierCurve; // 0x718
	FDBDTunableRowHandle _chargeTimeAfterGatewayPlacementCancelled; // 0x720
	FDBDTunableRowHandle _chargeTimeAfterGatewayPossessionCancelled; // 0x748
	FDBDTunableRowHandle _chargeTimeAfterControlledChainShot; // 0x770
	FDBDTunableRowHandle _gatewayPossessionFovChangeDuration; // 0x798
	FDBDTunableRowHandle _gatewayPossessionCameraPanTime; // 0x7c0
	FDBDTunableRowHandle _controlledProjectilePossessionCameraPanTime; // 0x7e8
	FDBDTunableRowHandle _controlledProjectilePossessionFovTimeChangeDuration; // 0x810
	UFiniteStateMachine* _stateMachine; // 0x838
	bool _authority_shouldIncrementChargeableComponent; // 0x840
	EChainStrikeCameraViewTarget _chainStrikeCameraViewTarget; // 0x8a9
	bool _hasHitSurvivor; // 0x8aa
};

struct UAISense_PointOfInterest : UAISense {
	TArray<AActor*> _sources; // 0x90
};

struct ULightFunctionActorSpawner : UActorSpawner {
	UTexture* LightFunctionTexture; // 0x2c8
};

struct ULunarEventComponent : UActorComponent {
	int32_t _lanternCollectedCount; // 0xd0
	int32_t _additionalEventProgressCount; // 0xd4
};

struct UWindowTitleBarArea : UContentWidget {
	bool bWindowButtonsEnabled; // 0x140
	bool bDoubleClickTogglesFullscreen; // 0x141
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x30
	UAudioComponent* PlayAudioComp; // 0x38
};

struct AVolumetricLightmapDensityVolume : AVolume {
	FInt32Interval AllowedMipLevelRange; // 0x268
};

struct UAkSettingsPerUser : UObject {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x30
	FFilePath WwiseMacInstallationPath; // 0x40
	FString WaapiIPAddress; // 0x50
	uint32_t WaapiPort; // 0x60
	bool AutoSyncSelection; // 0x64
	bool SoundDataGenerationSkipLanguage; // 0x66
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate COMPLETED; // 0x80
};

struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	UStaticMesh* ParticleMesh; // 0x58
	ENiagaraSortMode SortMode; // 0x60
	char bOverrideMaterials : 1; // 0x64
	char bSortOnlyWhenTranslucent : 1; // 0x64
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0x68
	FVector2D SubImageSize; // 0x78
	char bSubImageBlend : 1; // 0x80
	ENiagaraMeshFacingMode FacingMode; // 0x84
	char bLockedAxisEnable : 1; // 0x88
	FVector LockedAxis; // 0x8c
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0x98
	FNiagaraVariableAttributeBinding PositionBinding; // 0xa0
	FNiagaraVariableAttributeBinding ColorBinding; // 0x130
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x1c0
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x250
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x2e0
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x370
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x400
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x490
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x520
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x5b0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x640
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x6d0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x760
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x7f0
};

struct UGeometryCacheTrack_FlipbookAnimation : UGeometryCacheTrack {
	uint32_t NumMeshSamples; // 0x60
};

struct UDidGameEventOccurred : UEventDrivenModifierCondition {
	FGameplayTag EventTag; // 0xe8
};

struct UFixedFrameRateCustomTimeStep : UEngineCustomTimeStep {
	FFrameRate FixedFrameRate; // 0x30
};

struct UUserDefinedImageCaptureProtocol : UUserDefinedCaptureProtocol {
	EDesiredImageFormat Format; // 0xe0
	bool bEnableCompression; // 0xe1
	int32_t CompressionQuality; // 0xe4
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x30
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x40
	TArray<FCollectionVectorParameter> VectorParameters; // 0x50
};

struct UMagicLeapLightingTrackingComponent : UActorComponent {
	bool UseGlobalAmbience; // 0xb8
	bool UseColorTemp; // 0xb9
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x268
	TArray<AActor*> OverrideInvisibleActors; // 0x278
	TArray<FName> OverrideInvisibleLevels; // 0x288
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x50
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x60
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x70
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x80
	bool bInInteraction; // 0x90
	FVector RotationOrigin; // 0x94
	FVector RotationAxis; // 0xa0
	FVector RotationPlaneX; // 0xac
	FVector RotationPlaneY; // 0xb8
	FVector InteractionStartPoint; // 0xc4
	FVector InteractionCurPoint; // 0xd0
	float InteractionStartAngle; // 0xdc
	float InteractionCurAngle; // 0xe0
};

struct USourceEffectPannerPreset : USoundEffectSourcePreset {
	FSourceEffectPannerSettings Settings; // 0x78
};

struct UMovieSceneSkeletalAnimationTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x60
	bool bUseLegacySectionIndexBlend; // 0x70
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x40
	FSoftClassPath AudioCaptureProtocolType; // 0x60
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x80
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x88
	FMovieSceneCaptureSettings Settings; // 0x90
	bool bUseSeparateProcess; // 0x100
	bool bCloseEditorWhenCaptureStarts; // 0x101
	FString AdditionalCommandLineArguments; // 0x108
	FString InheritedCommandLineArguments; // 0x118
};

struct ACharmAttacher : AActor {
	FMulticastInlineDelegate OnAttachedOnActor; // 0x230
	FMulticastInlineDelegate OnCharmAnimationTagsChanged; // 0x240
	USkeletalMeshComponent* _chain; // 0x250
	ACharm* _attachedCharm; // 0x258
};

struct UCoreCursor : UUserWidget {
	UScaleBox* CursorScaleBox; // 0x260
};

struct APartyBeaconHost : AOnlineBeaconHostObject {
	UPartyBeaconState* State; // 0x258
	bool bLogoutOnSessionTimeout; // 0x2c0
	float SessionTimeoutSecs; // 0x2c4
	float TravelSessionTimeoutSecs; // 0x2c8
};

struct UDBDRichPresenceSubsystem : UGameInstanceSubsystem {
	ERichPresenceUserType _userType; // 0x38
	ERichPresenceStatus _richPresenceStatus; // 0x39
	float _timerRate; // 0x3c
	float _timerDelay; // 0x40
	bool _isValidSetup; // 0x44
};

struct UDatasmithPostProcessVolumeTemplate : UDatasmithObjectTemplate {
	FDatasmithPostProcessSettingsTemplate Settings; // 0x40
	char bEnabled : 1; // 0x80
	char bUnbound : 1; // 0x80
};

struct UNiagaraDataInterfaceTexture : UNiagaraDataInterface {
	UTexture* Texture; // 0x38
};

struct UFrenzyComponent : UActorComponent {
	FMulticastInlineDelegate OnFrenzyStarted; // 0xb8
	FMulticastInlineDelegate OnFrenzyEnded; // 0xc8
	FMulticastInlineDelegate OnFrenzyEndedNoCooldown; // 0xd8
	FMulticastInlineDelegate OnInjuredBleedoutStartedDuringFrenzy; // 0xe8
	FMulticastInlineDelegate OnFrenzyReadyToStart; // 0xf8
	ASlasherPlayer* _slasher; // 0x178
	UInteractionDefinition* _cooldownInteraction; // 0x1a8
};

struct AFootSteps : AActor {
	float _raycastHalfAngle; // 0x234
	float _raycastZOffset; // 0x238
	float _raycastDistance; // 0x23c
	UMaterial* _material; // 0x240
	float _minimumDecalSize; // 0x248
	float _maximumDecalSize; // 0x24c
	float _projectionTickness; // 0x250
	float _visibilityMultiplierInterpSpeed; // 0x254
	UCurveFloat* _fadeCurve; // 0x258
	UCurveFloat* _veinsCurve; // 0x260
	FBHVRPerDetailModeInt _decalPoolSize; // 0x268
	FBHVRPerDetailModeFloat _recycleThresholdPercentage; // 0x308
	FBHVRPerDetailModeFloat _recycleDistancePercentage; // 0x3a8
	FBHVRPerDetailModeInt _maxOverlapping; // 0x448
	TMap<UDBDDecalComponent*, FFootStep> _footSteps; // 0x4e8
	UDecalSpawner* _decalSpawner; // 0x538
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction action; // 0x30
	float LastUpdatePosition; // 0x34
	char bSavedActiveState : 1; // 0x38
};

struct UCoreInputPromptTextWidget : UCoreBaseUserWidget {
	UCoreInputPromptWidget* InputPrompt; // 0x2d8
	UTextBlock* TextField; // 0x2e0
	FKey InputKey; // 0x2e8
	FText Text; // 0x308
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance : UMaterialExpression {
	int32_t LightIndex; // 0x48
	FExpressionInput WorldPosition; // 0x4c
};

struct UDreamPalletOutlineUpdateStrategy : UPalletOutlineUpdateStrategy {
	FLinearColor _revealedByMapColor; // 0x148
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2f8
	FPartyReservation PendingReservation; // 0x308
	EClientRequestType RequestType; // 0x358
	bool bPendingReservationSent; // 0x359
	bool bCancelReservation; // 0x35a
};

struct AGenerator : AInteractable {
	bool activated; // 0x338
	bool IsRepaired; // 0x339
	bool WasASMCachePreWarmTriggered; // 0x33a
	bool IsPlaySkillcheckAesthetic; // 0x33b
	bool ForceRevealToLocalPlayer; // 0x33c
	UCurveLinearColor* KillerOutlineFadeCurve; // 0x340
	float NativePercentComplete; // 0x348
	FMulticastInlineDelegate OnGeneratorRepaired; // 0x350
	FMulticastInlineDelegate OnGeneratorRepairedBySurvivor; // 0x360
	FMulticastInlineDelegate OnIsDamagedChanged; // 0x370
	bool FireLevelScoreEventOnFix; // 0x3b0
	TMap<FName, FTransform> _activatedTopLightsTransformMap; // 0x3b8
	UAIPerceptionStimuliSourceComponent* _perceptionStimuliComponent; // 0x408
	FGameplayTag _repairSemanticTag; // 0x434
	FDamageData _damageData; // 0x440
	bool _isBlocked; // 0x464
	bool _isBlockedFromCharging; // 0x465
	TSet<UObject*> _blockingSources; // 0x468
	UChargeableComponent* _generatorCharge; // 0x4b8
	TArray<FPlayerFloatTuple> _playerStartTimes; // 0x4c0
	bool _isAutoCompleted; // 0x4e8
	int32_t _overchargeLevel; // 0x4ec
	UCoopRepairTracker* _coopRepairTracker; // 0x4f0
	float _VFX_LightDistanceDefault; // 0x508
};

struct UCommandlet : UObject {
	FString HelpDescription; // 0x30
	FString HelpUsage; // 0x40
	FString HelpWebLink; // 0x50
	TArray<FString> HelpParamNames; // 0x60
	TArray<FString> HelpParamDescriptions; // 0x70
	char IsServer : 1; // 0x80
	char IsClient : 1; // 0x80
	char IsEditor : 1; // 0x80
	char LogToConsole : 1; // 0x80
	char ShowErrorCount : 1; // 0x80
	char ShowProgress : 1; // 0x80
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x3a8
	float SourceHeight; // 0x3ac
	float BarnDoorAngle; // 0x3b0
	float BarnDoorLength; // 0x3b4
	UTexture* SourceTexture; // 0x3b8
};

struct ALocker : AInteractable {
	FMulticastInlineDelegate OnSurvivorInLockerChanged; // 0x328
	float FastDoorActivationAudibleRange; // 0x338
	float NormalDoorActivationAudibleRange; // 0x33c
	UAnimationMontageSlave* _montageFollower; // 0x340
	UMontagePlayer* _montagePlayer; // 0x348
	ADBDPlayer* _playerOpeningLocker; // 0x350
	ACamperPlayer* _survivorInLocker; // 0x358
	UInteractor* _mainInteractor; // 0x360
	UPrimitiveComponent* _frontInteractionZone; // 0x368
	UInteractionDefinition* _searchEmpty; // 0x370
	UInteractionDefinition* _searchPlayer; // 0x378
	UChildActorComponent* _killerInteractionActor; // 0x380
	ULockerAnimInstance* _lockerAnimInstance; // 0x388
	FGameplayTagContainer _interactionExitClosetSemantics; // 0x390
	bool _preventAllInteractions; // 0x3f0
	bool _preventAllInteractionsLocally; // 0x3f1
};

struct UEdGraph : UObject {
	UEdGraphSchema* Schema; // 0x30
	TArray<UEdGraphNode*> Nodes; // 0x38
	char bEditable : 1; // 0x48
	char bAllowDeletion : 1; // 0x48
	char bAllowRenaming : 1; // 0x48
};

struct UPortalRadiusDetectorComponent : UActorComponent {
	TArray<ADemogorgonPortal*> Portals; // 0xb8
	TArray<ADBDPlayer*> _playersInsideRadius; // 0xc8
};

struct UDBDHud : UObject {
	TMap<FName, AStatusView*> _statusViews; // 0x30
};

struct ADemogorgonPortal : AInteractable {
	UPrimitiveComponent* _portalAreaCollider; // 0x328
	UChargeableComponent* _destroyChargeable; // 0x330
	UChargeableComponent* _teleportChargeable; // 0x338
	EDemogorgonPortalState _portalState; // 0x340
	UAkAudioEvent* _portalIdleSound; // 0x348
	UAkAudioEvent* _portalDestroyingStart; // 0x350
	UAkAudioEvent* _portalTeleportingSound; // 0x358
	UParticleSystem* _destroyParticleSystem; // 0x360
	float _destroyDuration; // 0x368
};

struct UUMGCharacterSelectionWidget : UMobileBaseUserWidget {
	FMulticastInlineDelegate OnCharacterSelected; // 0x300
	FMulticastInlineDelegate OnCharacterRoleButtonClicked; // 0x310
	FMulticastInlineDelegate OnCharacterInfoButtonClicked; // 0x320
	UUMGCharacterPageScrollWidget* CharacterPageScrollWidget; // 0x330
	UUMGCharacterSelectSubmenu* CharacterSelectSubMenu; // 0x338
	UUMGCharacterInfoWidget* CharacterInfoWidget; // 0x340
	UWidgetSwitcher* CharacterSwitcher; // 0x348
	bool _isKiller; // 0x350
};

struct UUMGMenuBaseBanner : UUMGBaseSideMainMenuButton {
	UImage* BannerImage; // 0x448
	UTextBlock* Title; // 0x450
	TScriptInterface<ISlateTextureAtlasInterface> DefaultBanner; // 0x458
};

struct ULuminARSessionConfig : UARSessionConfig {
	FMagicLeapPlanesQuery PlanesQuery; // 0xb0
	int32_t MaxPlaneQueryResults; // 0x110
	int32_t MinPlaneArea; // 0x114
	bool bArbitraryOrientationPlaneDetection; // 0x118
	FVector PlaneSearchExtents; // 0x11c
	TArray<EMagicLeapPlaneQueryFlags> PlaneQueryFlags; // 0x128
	bool bDiscardZeroExtentPlanes; // 0x138
	bool bDefaultUseUnreliablePose; // 0x139
};

struct UUMGSettingSettingsContextWidget : UUMGSettingContextWidget {
	bool MainVolumeOn; // 0x3a8
	float MainVolume; // 0x3ac
	bool MenuVolumeOn; // 0x3b0
	float MenuVolume; // 0x3b4
	bool IsLoggedIn; // 0x3b8
	bool IsEnableUserCenterWithLoggedOut; // 0x3b9
	bool IsLeaveTutorialButtonVisible; // 0x3ba
	bool IsAutoDeclineFriendRequestOn; // 0x3bb
};

struct UGizmoPlaneTranslationParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	FVector2D Parameter; // 0xb0
	FGizmoVec2ParameterChange LastChange; // 0xb8
	FVector CurTranslationOrigin; // 0xc8
	FVector CurTranslationNormal; // 0xd4
	FVector CurTranslationAxisX; // 0xe0
	FVector CurTranslationAxisY; // 0xec
	FTransform InitialTransform; // 0x100
};

struct ABearTrap : ABaseTrap {
	UBoxPlayerOverlapComponent* _interactionVolume; // 0x4d8
	UCapsulePlayerOverlapComponent* _trapPlayerDetectionZone; // 0x4e0
	UBoxComponent* _killerSafetyZoneComponent; // 0x4e8
	UDBDOutlineComponent* _outlineComponent; // 0x4f0
	UBearTrapOutlineUpdateStrategy* _outlineUpdateStrategy; // 0x4f8
	UMapActorComponent* _mapActorComponent; // 0x500
	USphereComponent* _mapActorCollision; // 0x508
	USphereComponent* _trapBlocker; // 0x510
	UMontagePlayer* _montagePlayer; // 0x518
	FMulticastInlineDelegate _onIsTrapSetChanged; // 0x520
	ADBDPlayer* _ownerPlayer; // 0x530
	UDBDNavModifierComponent* _dangerNavModifierComponent; // 0x538
	bool _isTrapperOutOfSafetyZone; // 0x540
	int32_t _maximumAttemptsForSelfUntrap; // 0x544
	int32_t _selfUntrapAttemptsRemaining; // 0x548
	UInteractor* _mainInteractor; // 0x550
	UInteractionDefinition* _trapSurvivor; // 0x558
	UInteractionDefinition* _trapKiller; // 0x560
	ADBDPlayer* _trappedPlayer; // 0x568
	UAnimationMontageSlave* _animationMontageSlave; // 0x5c8
};

struct UMeshInspectorProperties : UInteractiveToolPropertySet {
	bool bWireframe; // 0x58
	bool bBoundaryEdges; // 0x59
	bool bPolygonBorders; // 0x5a
	bool bUVSeams; // 0x5b
	bool bNormalSeams; // 0x5c
	bool bNormalVectors; // 0x5d
	bool bTangentVectors; // 0x5e
	float NormalLength; // 0x60
	float TangentLength; // 0x64
};

struct UHasGameplayTagEvaluatorCondition : UEvaluatorCondition {
	TArray<FGameplayTag> _gameplayTagList; // 0x48
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x70
};

struct ANavLinkProxy_Base : ANavLinkProxy {
	float WaitLinkOffset; // 0x280
	float MoveOnEndPointTimeLimit; // 0x284
	int32_t NbMaxLinkUsers; // 0x288
	TMap<ADBDPlayer*, FMoveLinkPlayerInfo> _players; // 0x290
	TArray<ADBDPlayer*> _linkUsedByPlayers; // 0x2e0
};

struct UDBDReflectionCaptureSpawnerComponent : USceneComponent {
	EReflectionSourceType ReflectionSourceType; // 0x210
	UTextureCube* Cubemap; // 0x218
	float SourceCubemapAngle; // 0x220
	float Brightness; // 0x224
	float ContributionFactor; // 0x228
	float IBLMultiplicator; // 0x22c
	bool bCanBeTinted; // 0x230
	FVector CaptureOffset; // 0x234
	TArray<AReflectionCapture*> SpawnedReflectionCaptures; // 0x248
	TArray<UReflectionCaptureComponent*> SpawnedReflectionCaptureComponents; // 0x258
};

struct ABP_Menu_Slasher14_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_14_C* BP_Audio_KLR_15; // 0x698
};

struct UMaterialInstanceConstant : UMaterialInstance {
	UPhysicalMaterialMask* PhysMaterialMask; // 0x410
};

struct ACullDistanceVolume : AVolume {
	TArray<FCullDistanceSizePair> CullDistances; // 0x268
	char bEnabled : 1; // 0x278
	char bUnbound : 1; // 0x278
};

struct ABP_Menu_Slasher19_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_19_C* BP_Audio_KLR_20; // 0x698
	USkeletalMeshComponent* HarpoonMesh; // 0x6a0
};

struct UHalloweenEventComponent : UActorComponent {
	USectionnedChargeableComponent* _toxinVialComponent; // 0xb8
};

struct USkillCheckPresenter : UHudPresenter {
	UUserWidget* SkillCheckWidgetClass; // 0x108
};

struct UFurtiveChase : UPerk {
	int32_t _maxTokensByLevel[0x3]; // 0x3d0
	float _terrorRadiusSuppressionPerToken; // 0x3dc
};

struct UDeathBedRescueInteraction : UChargeableInteractionDefinition {
	FDBDTunableRowHandle _loudNoiseRange; // 0x6e0
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x30
};

struct UAkXboxOneGDKInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x30
	FAkXboxOneGDKApuHeapInitializationSettings ApuHeapSettings; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkXboxOneGDKAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UEditNormalsTool : UMultiSelectionTool {
	UEditNormalsToolProperties* BasicProperties; // 0x98
	UEditNormalsAdvancedProperties* AdvancedProperties; // 0xa0
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xa8
};

struct UEvaluatorCondition : UObject {
	EConditionSubject _conditionSubject; // 0x30
};

struct UCoopRepairTracker : UObject {
	TArray<ADBDPlayer*> _coopRepairerHistory; // 0x30
};

struct UInGameAdManager : UPlatformInterfaceBase {
	char bShouldPauseWhileAdOpen : 1; // 0x40
	TArray<FDelegate> ClickedBannerDelegates; // 0x48
	TArray<FDelegate> ClosedAdDelegates; // 0x58
};

struct AK26CrowProjectile : AActor {
	FMulticastInlineDelegate OnCrowProjectileStateChanged; // 0x240
	FMulticastInlineDelegate OnIsBeingFlashlightedChanged; // 0x250
	FVector _originalFireLocation; // 0x260
	TMap<EK26ProjectileState, FK26ProjectileStateDetails> _projectileStateDetails; // 0x270
	FDBDTunableRowHandle _summonTime; // 0x2c0
	FTunableStat _detectionRadiusScaleX; // 0x2e8
	FTunableStat _detectionRadiusScaleY; // 0x368
	FTunableStat _detectionRadiusScaleZ; // 0x3e8
	FDBDTunableRowHandle _crowFireAuraVisibilityForSurvivorsTime; // 0x468
	FDBDTunableRowHandle _crowSummonAuraVisibilityForSurvivorsTime; // 0x490
	FDBDTunableRowHandle _detectionRadiusFromAbove; // 0x4b8
	FDBDTunableRowHandle _baseSpeed; // 0x4e0
	FDBDTunableRowHandle _selfDestructTimeOnDestroyed; // 0x508
	FDBDTunableRowHandle _requiredFlashlightTimeToDestroy; // 0x530
	FDBDTunableRowHandle _flashlightablePointScale; // 0x558
	FDBDTunableRowHandle _rangeToTriggerNearSurvivorSFX; // 0x580
	FDBDTunableRowHandle _flashlightDisableTime; // 0x5a8
	UCurveFloat* _onPathMovementSpeedModifierCurve; // 0x5d0
	UCurveFloat* _offPathMovementSpeedModifierCurve; // 0x5d8
	float _projectileOffPathCurveDuration; // 0x5e0
	TArray<FVector> _path; // 0x5e8
	int32_t _pooledPathIndex; // 0x5f8
	EK26ProjectileState _currentProjectileState; // 0x5fc
	UK26PowerOutlineUpdateStrategy* _outlineUpdateStrategy; // 0x600
	UK26PowerOutlineUpdateStrategy* _crowFlockOutlineUpdateStrategy; // 0x608
	UDBDOutlineComponent* _outlineComponent; // 0x610
	USplineComponent* _pathSplineComponent; // 0x618
	UStaticMeshComponent* _collisionStaticMeshComponent; // 0x620
	UStaticMeshComponent* _killerInstinctStaticMeshComponent; // 0x628
	USkeletalMeshComponent* _visualSkeletalMeshComponent; // 0x630
	USceneComponent* _rootComponent; // 0x638
	UFirecrackerEffectHandlerComponent* _firecrackerEffectHandlerComponent; // 0x640
	UFlashlightableComponent* _flashLightableComponent; // 0x648
	ULightBurnable* _lightBurnableComponent; // 0x650
	UDBDNavModifierComponent* _dangerNavModifierComponent; // 0x658
	USceneComponent* flashlightPointCenter; // 0x660
	USceneComponent* flashlightPointNorth; // 0x668
	USceneComponent* flashlightPointEast; // 0x670
	USceneComponent* flashlightPointSouth; // 0x678
	USceneComponent* flashlightPointWest; // 0x680
	FMulticastInlineDelegate _k26ProjectileStateChangeDelegate; // 0x688
	FMulticastInlineDelegate OnAcquiredChanged; // 0x698
	FVector _forwardDirection; // 0x6b8
	bool _isBeingFlashlighted; // 0x6c4
	float _lastFlashlightProgress; // 0x6c8
	float _lastTimeFlashlightValueIncreased; // 0x6cc
	float _fireTime; // 0x6d0
	float _currentDistanceAlongSpline; // 0x6d4
	float _offPathTime; // 0x6d8
	UK26PowerStatusHandlerComponent* _statusHandlerComponent; // 0x6e0
	UK26AmmoHandlerComponent* _ammoHandlerComponent; // 0x6e8
	UK26PathHandlerComponent* _pathHandlerComponent; // 0x6f0
	UChargeableComponent* _flashlightDestroyChargeable; // 0x6f8
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0xb0
	FGuid ExpressionGUID; // 0xbc
	FName Group; // 0xcc
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x30
};

struct UShapeAnimInstance : UKillerAnimInstance {
	bool _isTier3Active; // 0x5a8
	UEvilWithinComponent* _evilWithinComponent; // 0x5b0
};

struct AConjoinedTwin : ADBDPlayer {
	URangeToActorsTrackerComponent* _restrictedPossessionAreaTracker; // 0x10b8
	UTwinOutlineUpdateStrategy* _twinOutlineUpdateStrategy; // 0x10c0
	UAkComponent* _twinLullabyAudioComponent; // 0x10c8
	UKillerBlindingFXComponent* _twinBlindingFX; // 0x10d0
	UCustomizedAudioComponent* _customizedAudio; // 0x10d8
	UDBDAttackerComponent* _attackerComponent; // 0x10e0
	FDBDTunableRowHandle _maxWalkSpeed; // 0x10e8
	UHitValidatorComponent* _hitValidator; // 0x1110
	UHitValidatorConfigurator* _hitValidationConfigurator; // 0x1118
	FDBDTunableRowHandle _gravityScale; // 0x1120
	UAnimationMontageSlave* _animationFollower; // 0x1148
	FDBDTunableRowHandle _revealDurationOnAttached; // 0x1168
	UTwinFirstPersonViewComponent* _firstPersonViewComponent; // 0x1190
	UFlashlightableComponent* _eyesFlashlightable; // 0x1198
	UBlindFlashlightTargetFXComponent* _blindFlashlightTargetFXComponent; // 0x11a0
	UFirecrackerEffectHandlerComponent* _firecrackerEffectHandlerComponent; // 0x11a8
	FFastTimer _flashlightBlindEvasionScoreTimer; // 0x11b8
	FDBDTunableRowHandle _flashlightEvasionScoreCooldown; // 0x11e8
	UTwinPossessNegationEffectComponent* _twinPossessNegationEffectComponent; // 0x1210
};

struct UParticleModuleMeshRotationRate_Seeded : UParticleModuleMeshRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UInterpTrackVectorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x98
};

struct UActionButton : UMobileBaseUserWidget {
	FSlateBrush DefaultImage; // 0x300
	UImage* IconImage; // 0x390
	UImage* ToggleSmokeImage; // 0x398
	UButton* Button; // 0x3a0
	float DefaultOpacity; // 0x3a8
	float ToggledOpacity; // 0x3ac
	float DisabledOpacity; // 0x3b0
	FSlateBrush Normal; // 0x3b8
	FSlateBrush Toggled; // 0x448
	FSlateBrush Disabled; // 0x4d8
	EActionButtonState _currentState; // 0x568
	EActionButtonState _previousState; // 0x569
};

struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0x6d0
	TArray<FFractureEffect> FractureEffects; // 0x6d8
	bool bEnableHardSleeping; // 0x6e8
	float LargeChunkThreshold; // 0x6ec
	FMulticastInlineDelegate OnComponentFracture; // 0x700
};

struct UActivateOnEventTimedStatusEffect : UStatusEffect {
	FGameplayTagContainer _eventsToActivateOn; // 0x350
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb8
	UFieldNodeBase* RightField; // 0xc0
	UFieldNodeBase* LeftField; // 0xc8
	EFieldOperationType Operation; // 0xd0
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x210
	float Brightness; // 0x220
	float Intensity; // 0x224
	bool bStationaryLightWithStaticFallback; // 0x228
	FColor LightColor; // 0x22c
	float LightPriority; // 0x230
	char bAffectsWorld : 1; // 0x234
	char CastShadows : 1; // 0x234
	char CastStaticShadows : 1; // 0x234
	char CastDynamicShadows : 1; // 0x234
	char CastDynamicShadowsWithNewDefaultValue : 1; // 0x234
	EDetailMode DetailLevelBeforeCastShadows; // 0x238
	ELightingDetailMode DetailLevelBeforeCastDynamicShadows; // 0x23c
	int32_t CascadeShadowMapQualityReductionBHVR; // 0x240
	char bIgnoreDynamicObjectsInShadows : 1; // 0x244
	ELightingDetailMode DetailLevelThresholdBeforeIgnoringDynamicObjectsInShadows; // 0x248
	char bAffectTranslucentLighting : 1; // 0x24c
	char bTransmission : 1; // 0x24c
	char bCastVolumetricShadow : 1; // 0x24c
	char bCastDeepShadow : 1; // 0x24c
	char bCastRaytracedShadow : 1; // 0x24c
	char bAffectReflection : 1; // 0x24c
	char bAffectGlobalIllumination : 1; // 0x24c
	float IndirectLightingIntensity; // 0x250
	float VolumetricScatteringIntensity; // 0x254
	float AmbientOcclusionContribution; // 0x258
	int32_t SamplesPerPixel; // 0x25c
};

struct UInterpTrackInstProperty : UInterpTrackInst {
	TFieldPath<FProperty> InterpProperty; // 0x30
	UObject* PropertyOuterObjectInst; // 0x50
};

struct UNavigationScreenUMG : UNavigationScreen {
	UUMGLobbyScreen* _atlNavigationScreen; // 0x2b8
};

struct UDBDNavMeshExplorerComponent : UActorComponent {
	float ExploreAtAgentMoveDistance; // 0xb8
	float ExploreAtInterval; // 0xbc
	FAITunableParameter ExplorationBoxHalfExtent; // 0xc0
	int32_t FullyAutoExploredAtGameTime; // 0xd0
	UDBDPathFollowingComponent* _pathFollowingComponent; // 0xd8
};

struct UDateTimerUpdater : UObject {
	TMap<UDateTimeProvider*, FDateTimerArray> _timers; // 0x38
	TMap<UDateTimeProvider*, UDateTimeProvider*> _dateTimeProvider; // 0x88
};

struct UTranslucentOutlineRenderStrategy : UBaseOutlineRenderStrategy {
	TArray<UMaterialInterface*> _replacementMaterials; // 0x70
};

struct UPPAB_Legion_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2b0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x330
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x790
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xbf0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xc10
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc30
};

struct ALanternInteractable : AInteractable {
	FMulticastInlineDelegate OnLanternStateChanged; // 0x328
	FMulticastInlineDelegate OnLanternCollectedByPlayerCosmetic; // 0x338
	ALanternLightCollectable* _collectableClass; // 0x368
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x58
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x60
	FAIDataProviderFloatValue SearchRadius; // 0xa0
	UEnvQueryContext* SearchCenter; // 0xe0
};

struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x38
	char bIsDirty : 1; // 0x38
	char bBakedDataSuccesfully : 1; // 0x38
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x478
	UMaterialInterface* MaterialOverride; // 0x480
	FLinearColor SpriteColor; // 0x488
};

struct ASceneCapture2D : ASceneCapture {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x240
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x30
	UObject* Payload; // 0x40
	UWidget* DefaultDragVisual; // 0x48
	EDragPivot Pivot; // 0x50
	FVector2D Offset; // 0x54
	FMulticastInlineDelegate OnDrop; // 0x60
	FMulticastInlineDelegate OnDragCancelled; // 0x70
	FMulticastInlineDelegate OnDragged; // 0x80
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
	float ConstA; // 0x80
	float ConstB; // 0x84
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x30
	FColor PoseWatchColour; // 0x38
};

struct ADBDDebugGameMode : ADBDGameMode {
	TMap<ADBDPlayerController*, int32_t> LoadoutIndex; // 0x420
	TSet<ADBDPlayer*> PlayersWithItems; // 0x470
	TArray<FCamperLoadout> CamperPawnOverrides; // 0x4c0
	TArray<FSlasherLoadout> SlasherPawnOverrides; // 0x4d0
};

struct UMaterialExpressionOneMinus : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct UTricksterSuperModeComponent : UActorComponent {
	bool _isInSuperMode; // 0xb8
	bool _isSuperModeReady; // 0xb9
	bool _isInCooldown; // 0xba
	FDBDTunableRowHandle _chargesToAddOnKnifeHit; // 0xc8
	FDBDTunableRowHandle _superModeMaxCharge; // 0xf0
	FDBDTunableRowHandle _superModeReadyDepletionPerSecond; // 0x118
	FTunableStat _superModeActiveDuration; // 0x140
	FDBDTunableRowHandle _superModeCooldown; // 0x220
	FDBDTunableRowHandle _shouldDisableFlurryDuringCooldown; // 0x248
};

struct UInAppPurchaseCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UPolygonSelectionMechanic : UInteractionMechanic {
	UPolygonSelectionMechanicProperties* Properties; // 0x58
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x30
	UEdGraphNode* Node; // 0x38
	char bStepOnce : 1; // 0x40
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x40
	char bStepOnce_RemoveAfterHit : 1; // 0x40
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x398
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x3b0
};

struct UForThePeople : UPerk {
	float _brokenEffectDurations[0x3]; // 0x3dc
	FSecondaryInteractionProperties _secondaryActionProperties; // 0x3e8
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x268
};

struct UAkMarkerCallbackInfo : UAkEventCallbackInfo {
	int32_t Identifier; // 0x40
	int32_t Position; // 0x44
	FString label; // 0x48
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x48
	float MaxAngleDiff; // 0x4c
	float MaxScaleDiff; // 0x50
	float MaxEffectorDiff; // 0x54
	float MinEffectorDiff; // 0x58
	float EffectorDiffSocket; // 0x5c
	float ParentKeyScale; // 0x60
	char bRetarget : 1; // 0x64
	char bActuallyFilterLinearKeys : 1; // 0x64
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UHasObjectStateWithMaxDuration : UHasObjectState {
	float _maxDuration; // 0x150
};

struct UGunslingerAnimInstance : UKillerAnimInstance {
	bool _isAiming; // 0x5a8
	bool _isAimingWarmup; // 0x5a9
	bool _isAimingCooldown; // 0x5aa
	bool _isAimingReadyToShoot; // 0x5ab
	bool _isFiring; // 0x5ac
	bool _isInMissShotCooldown; // 0x5ad
	bool _isInSuccessShot; // 0x5ae
	bool _isLinked; // 0x5af
	bool _isReeling; // 0x5b0
	bool _isInGunState; // 0x5b1
	float _idleToAimAnimPlayrate; // 0x5b4
	float _aimToIdleAnimPlayrate; // 0x5b8
	float _fireAnimPlayRate; // 0x5bc
	float _missShotCooldownAnimPlayRate; // 0x5c0
	float _successShotAnimPlayRate; // 0x5c4
	UAnimSequence* _idleToAimAnim; // 0x5c8
	UAnimSequence* _aimToIdleAnim; // 0x5d0
	UAnimSequence* _fireAnim; // 0x5d8
	UAnimSequence* _missShotCooldownAnim; // 0x5e0
	UAnimSequence* _successShotAnim; // 0x5e8
	FDBDTunableRowHandle _idleToAimAnimDuration; // 0x5f0
	FDBDTunableRowHandle _aimToIdleAnimDuration; // 0x618
	FDBDTunableRowHandle _fireAnimDuration; // 0x640
	FTunableStat _missShotCooldownAnimDuration; // 0x668
	FDBDTunableRowHandle _successShotAnimDuration; // 0x6e8
};

struct UCharacterMovementComponent : UPawnMovementComponent {
	ACharacter* CharacterOwner; // 0x158
	float GravityScale; // 0x160
	float MaxStepHeight; // 0x164
	float JumpZVelocity; // 0x168
	float JumpOffJumpZFactor; // 0x16c
	float WalkableFloorAngle; // 0x170
	float WalkableFloorZ; // 0x174
	EMovementMode MovementMode; // 0x178
	char CustomMovementMode; // 0x179
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x17a
	float GroundFriction; // 0x17c
	float MaxWalkSpeed; // 0x19c
	float MaxWalkSpeedCrouched; // 0x1a0
	float MaxSwimSpeed; // 0x1a4
	float MaxFlySpeed; // 0x1a8
	float MaxCustomMovementSpeed; // 0x1ac
	float MaxAcceleration; // 0x1b0
	float MinAnalogWalkSpeed; // 0x1b4
	float BrakingFrictionFactor; // 0x1b8
	float BrakingFriction; // 0x1bc
	float BrakingSubStepTime; // 0x1c0
	float BrakingDecelerationWalking; // 0x1c4
	float BrakingDecelerationFalling; // 0x1c8
	float BrakingDecelerationSwimming; // 0x1cc
	float BrakingDecelerationFlying; // 0x1d0
	float AirControl; // 0x1d4
	float AirControlBoostMultiplier; // 0x1d8
	float AirControlBoostVelocityThreshold; // 0x1dc
	float FallingLateralFriction; // 0x1e0
	float CrouchedHalfHeight; // 0x1e4
	float Buoyancy; // 0x1e8
	float PerchRadiusThreshold; // 0x1ec
	float PerchAdditionalHeight; // 0x1f0
	FRotator RotationRate; // 0x1f4
	char bUseSeparateBrakingFriction : 1; // 0x200
	char bApplyGravityWhileJumping : 1; // 0x200
	char bUseControllerDesiredRotation : 1; // 0x200
	char bOrientRotationToMovement : 1; // 0x200
	char bSweepWhileNavWalking : 1; // 0x200
	char bMovementInProgress : 1; // 0x200
	char bEnableScopedMovementUpdates : 1; // 0x200
	char bEnableServerDualMoveScopedMovementUpdates : 1; // 0x201
	char bForceMaxAccel : 1; // 0x201
	char bRunPhysicsWithNoController : 1; // 0x201
	char bForceNextFloorCheck : 1; // 0x201
	char bShrinkProxyCapsule : 1; // 0x201
	char bCanWalkOffLedges : 1; // 0x201
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x201
	char bNetworkSkipProxyPredictionOnNetUpdate : 1; // 0x202
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1; // 0x202
	char bDeferUpdateMoveComponent : 1; // 0x202
	char bEnablePhysicsInteraction : 1; // 0x202
	char bTouchForceScaledToMass : 1; // 0x202
	char bPushForceScaledToMass : 1; // 0x202
	char bPushForceUsingZOffset : 1; // 0x202
	char bScalePushForceToVelocity : 1; // 0x203
	USceneComponent* DeferredUpdatedMoveComponent; // 0x208
	float MaxOutOfWaterStepHeight; // 0x210
	float OutofWaterZ; // 0x214
	float Mass; // 0x218
	float StandingDownwardForceScale; // 0x21c
	float InitialPushForceFactor; // 0x220
	float PushForceFactor; // 0x224
	float PushForcePointZOffsetFactor; // 0x228
	float TouchForceFactor; // 0x22c
	float MinTouchForce; // 0x230
	float MaxTouchForce; // 0x234
	float RepulsionForce; // 0x238
	FVector Acceleration; // 0x23c
	FQuat LastUpdateRotation; // 0x250
	FVector LastUpdateLocation; // 0x260
	FVector LastUpdateVelocity; // 0x26c
	float ServerLastTransformUpdateTimeStamp; // 0x278
	float ServerLastClientGoodMoveAckTime; // 0x27c
	float ServerLastClientAdjustmentTime; // 0x280
	FVector PendingImpulseToApply; // 0x284
	FVector PendingForceToApply; // 0x290
	float AnalogInputModifier; // 0x29c
	float MaxSimulationTimeStep; // 0x2ac
	int32_t MaxSimulationIterations; // 0x2b0
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x2b4
	float MaxDepenetrationWithGeometry; // 0x2b8
	float MaxDepenetrationWithGeometryAsProxy; // 0x2bc
	float MaxDepenetrationWithPawn; // 0x2c0
	float MaxDepenetrationWithPawnAsProxy; // 0x2c4
	float NetworkSimulatedSmoothLocationTime; // 0x2c8
	float NetworkSimulatedSmoothRotationTime; // 0x2cc
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2d0
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2d4
	float NetProxyShrinkRadius; // 0x2d8
	float NetProxyShrinkHalfHeight; // 0x2dc
	float NetworkMaxSmoothUpdateDistance; // 0x2e0
	float NetworkNoSmoothUpdateDistance; // 0x2e4
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2e8
	float NetworkMinTimeBetweenClientAdjustments; // 0x2ec
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2f0
	float NetworkLargeClientCorrectionDistance; // 0x2f4
	float LedgeCheckThreshold; // 0x2f8
	float JumpOutOfWaterPitch; // 0x2fc
	FFindFloorResult CurrentFloor; // 0x300
	EMovementMode DefaultLandMovementMode; // 0x39c
	EMovementMode DefaultWaterMovementMode; // 0x39d
	EMovementMode GroundMovementMode; // 0x39e
	char bMaintainHorizontalGroundVelocity : 1; // 0x39f
	char bImpartBaseVelocityX : 1; // 0x39f
	char bImpartBaseVelocityY : 1; // 0x39f
	char bImpartBaseVelocityZ : 1; // 0x39f
	char bImpartBaseAngularVelocity : 1; // 0x39f
	char bJustTeleported : 1; // 0x39f
	char bNetworkUpdateReceived : 1; // 0x39f
	char bNetworkMovementModeChanged : 1; // 0x39f
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x3a0
	char bServerAcceptClientAuthoritativePosition : 1; // 0x3a0
	char bNotifyApex : 1; // 0x3a0
	char bCheatFlying : 1; // 0x3a0
	char bWantsToCrouch : 1; // 0x3a0
	char bCrouchMaintainsBaseLocation : 1; // 0x3a0
	char bIgnoreBaseRotation : 1; // 0x3a0
	char bFastAttachedMove : 1; // 0x3a0
	char bAlwaysCheckFloor : 1; // 0x3a1
	char bUseFlatBaseForFloorChecks : 1; // 0x3a1
	char bPerformingJumpOff : 1; // 0x3a1
	char bWantsToLeaveNavWalking : 1; // 0x3a1
	char bUseRVOAvoidance : 1; // 0x3a1
	char bRequestedMoveUseAcceleration : 1; // 0x3a1
	char bWasSimulatingRootMotion : 1; // 0x3a1
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x3a2
	bool LockRootMotionRotationPitch; // 0x3a3
	bool LockRootMotionRotationYaw; // 0x3a4
	bool LockRootMotionRotationRoll; // 0x3a5
	char bHasRequestedVelocity : 1; // 0x3a6
	char bRequestedMoveWithMaxSpeed : 1; // 0x3a6
	char bWasAvoidanceUpdated : 1; // 0x3a6
	char bProjectNavMeshWalking : 1; // 0x3a6
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x3a6
	float AvoidanceConsiderationRadius; // 0x3b8
	FVector RequestedVelocity; // 0x3bc
	int32_t AvoidanceUID; // 0x3c8
	FNavAvoidanceMask AvoidanceGroup; // 0x3cc
	FNavAvoidanceMask GroupsToAvoid; // 0x3d0
	FNavAvoidanceMask GroupsToIgnore; // 0x3d4
	float AvoidanceWeight; // 0x3d8
	FVector PendingLaunchVelocity; // 0x3dc
	float NavMeshProjectionInterval; // 0x490
	float NavMeshProjectionTimer; // 0x494
	float NavMeshProjectionInterpSpeed; // 0x498
	float NavMeshProjectionHeightScaleUp; // 0x49c
	float NavMeshProjectionHeightScaleDown; // 0x4a0
	float NavWalkingFloorDistTolerance; // 0x4a4
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x4a8
	float MinTimeBetweenTimeStampResets; // 0x4f0
	FRootMotionSourceGroup CurrentRootMotion; // 0x4f8
	FRootMotionMovementParams RootMotionParams; // 0x5c0
	FVector AnimRootMotionVelocity; // 0x600
};

struct UDestroyBreakableDefinition : UInteractionDefinition {
	float _interactionTimePercentForDestroyEvent; // 0x5b0
	ABreakableBase* _breakable; // 0x5e0
};

struct USurvivorContaminationComponent : UActorComponent {
	FTagStateBool _isContaminated; // 0xd0
	UChargeableComponent* _injectSerumChargeable; // 0x100
	FDBDTunableRowHandle _injectSerumSecondsToCharge; // 0x108
	FTunableStat _contaminationHinderedSeconds; // 0x130
	FDBDTunableRowHandle _contaminationHinderedValue; // 0x1b0
	TArray<UInteractionDefinition*> _injectSerumInteractionsClasses; // 0x1e0
	TArray<UInteractionDefinition*> _injectSerumInteractions; // 0x1f0
};

struct UBackgroundBlur : UContentWidget {
	FMargin Padding; // 0x140
	EHorizontalAlignment HorizontalAlignment; // 0x150
	EVerticalAlignment VerticalAlignment; // 0x151
	bool bApplyAlphaToBlur; // 0x152
	float BlurStrength; // 0x154
	bool bOverrideAutoRadiusCalculation; // 0x158
	int32_t BlurRadius; // 0x15c
	FSlateBrush LowQualityFallbackBrush; // 0x160
};

struct UUMGAuthentificationProviderListWidget : UMobileBaseUserWidget {
	UHorizontalBox* GuestButtonContainer; // 0x300
};

struct UEditNormalsToolProperties : UInteractiveToolPropertySet {
	bool bRecomputeNormals; // 0x58
	ENormalCalculationMethod NormalCalculationMethod; // 0x59
	bool bFixInconsistentNormals; // 0x5a
	bool bInvertNormals; // 0x5b
	ESplitNormalMethod SplitNormalMethod; // 0x5c
	float SharpEdgeAngleThreshold; // 0x60
	bool bAllowSharpVertices; // 0x64
};

struct USoundNodeDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x50
};

struct ULandscapeMeshProxyComponent : UStaticMeshComponent {
	FGuid LandscapeGuid; // 0x4e8
	TArray<FIntPoint> ProxyComponentBases; // 0x4f8
	int8_t ProxyLOD; // 0x508
};

struct UBTTask_MoveTo : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0xa8
	UNavigationQueryFilter* FilterClass; // 0xb0
	float ObservedBlackboardValueTolerance; // 0xb8
	char bObserveBlackboardValue : 1; // 0xbc
	char bAllowStrafe : 1; // 0xbc
	char bAllowPartialPath : 1; // 0xbc
	char bTrackMovingGoal : 1; // 0xbc
	char bProjectGoalLocation : 1; // 0xbc
	char bReachTestIncludesAgentRadius : 1; // 0xbc
	char bReachTestIncludesGoalRadius : 1; // 0xbc
	char bStopOnOverlap : 1; // 0xbc
	char bStopOnOverlapNeedsUpdate : 1; // 0xbd
};

struct UGFxMoviePlayer : UObject {
	FString SwfAssetName; // 0x38
	UGFxObject* Root; // 0x48
	char bDisplayWithHudOff : 1; // 0x50
	char bEnableGammaCorrection : 1; // 0x50
	char bAllowInput : 1; // 0x50
	char bAllowFocus : 1; // 0x50
	char bCloseOnLevelChange : 1; // 0x50
	char bOnlyOwnerFocusable : 1; // 0x50
	char bDiscardNonOwnerInput : 1; // 0x50
	char bCaptureKeyboardInput : 1; // 0x50
	char bCaptureMouseInput : 1; // 0x51
	char bCaptureGamepadInput : 1; // 0x51
	char bCaptureTouchInput : 1; // 0x51
	char bIsSplitscreenLayoutModified : 1; // 0x51
	char bShowDefaultMouseCursor : 1; // 0x51
	char bBlurLesserMovies : 1; // 0x51
	char bHideLesserMovies : 1; // 0x51
	char bIsPriorityBlurred : 1; // 0x51
	char bIsPriorityHidden : 1; // 0x52
	char bIgnoreVisibilityEffect : 1; // 0x52
	char bIgnoreBlurEffect : 1; // 0x52
	char bRefreshed : 1; // 0x52
	char bPerformHitTest : 1; // 0x52
	GFxHitTestType HitTestType; // 0x54
	UTextureRenderTarget2D* RenderTexture; // 0x58
	UObject* ExternalInterface; // 0x60
	TArray<FKey> CaptureKeys; // 0x68
	TArray<FKey> FocusIgnoreKeys; // 0x78
	TArray<FExternalTexture> ExternalTextures; // 0x88
	EGFxRenderTextureMode RenderTextureMode; // 0x98
	char Priority; // 0x99
	TArray<FGFxWidgetBinding> WidgetBindings; // 0xa0
	int32_t SplitscreenLayoutYAdjust; // 0xb0
	FMulticastInlineDelegate OnFsCommand; // 0xb8
	FMulticastInlineDelegate OnStartCommand; // 0xc8
	FMulticastInlineDelegate OnCloseCommand; // 0xd8
	FMulticastInlineDelegate OnTickCommand; // 0xe8
	FMulticastInlineDelegate OnFocusGainedCommand; // 0xf8
	FMulticastInlineDelegate OnFocusLostCommand; // 0x108
	TArray<UGFxObject*> CachedMovieClipsArray; // 0x1d0
};

struct ANiagaraPreviewGrid : AActor {
	UNiagaraSystem* System; // 0x230
	ENiagaraPreviewGridResetMode ResetMode; // 0x238
	UNiagaraPreviewAxis* PreviewAxisX; // 0x240
	UNiagaraPreviewAxis* PreviewAxisY; // 0x248
	ANiagaraPreviewBase* PreviewClass; // 0x250
	float SpacingX; // 0x258
	float SpacingY; // 0x25c
	int32_t NumX; // 0x260
	int32_t NumY; // 0x264
	TArray<UChildActorComponent*> PreviewComponents; // 0x268
};

struct ADBDClientSyncer : AActor {
	TArray<FSpawnInfo> _actorsToSpawnLocally; // 0x230
	TArray<FSpawnInfo> _currentQueue; // 0x240
	UPaperTileMap* _tileMap; // 0x258
};

struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	char FocusPriority; // 0xa8
};

struct UAISkill_FindCollectable : UAISkill_FindInteractable {
	int32_t CollectUnderItemCount; // 0x118
	float CollectOverItemChargeRatio; // 0x11c
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x38
	bool bGenerateFullFrame; // 0x40
	bool bUseHighPerformanceClock; // 0x41
};

struct UBorder : UContentWidget {
	EHorizontalAlignment HorizontalAlignment; // 0x140
	EVerticalAlignment VerticalAlignment; // 0x141
	char bShowEffectWhenDisabled : 1; // 0x142
	FLinearColor ContentColorAndOpacity; // 0x144
	FDelegate ContentColorAndOpacityDelegate; // 0x154
	FMargin Padding; // 0x168
	FSlateBrush Background; // 0x178
	FDelegate BackgroundDelegate; // 0x208
	FLinearColor BrushColor; // 0x21c
	FDelegate BrushColorDelegate; // 0x22c
	FVector2D DesiredSizeScale; // 0x240
	bool bFlipForRightToLeftFlowDirection; // 0x248
	FDelegate OnMouseButtonDownEvent; // 0x24c
	FDelegate OnMouseButtonUpEvent; // 0x260
	FDelegate OnMouseMoveEvent; // 0x274
	FDelegate OnMouseDoubleClickEvent; // 0x288
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x430
};

struct AZombieAIController : AAIController {
	UBehaviorTree* _zombieBehaviorTree; // 0x358
	UAIPerceptionComponent* _aiPerceptionComponent; // 0x360
	TArray<ACamperPlayer*> _survivorInVision; // 0x370
	ACamperPlayer* _chaseTargetSurvivor; // 0x380
	FVector _goToLocation; // 0x388
	TArray<ACamperPlayer*> _survivorsInAttackDetector; // 0x3a0
	FDBDTunableRowHandle _zombieAttackHitTime; // 0x3b0
	FDBDTunableRowHandle _zombieAttackOpenTime; // 0x3d8
	FDBDTunableRowHandle _zombieAnimSpawnTime; // 0x400
	FDBDTunableRowHandle _zombieAnimDyingTime; // 0x428
	FTunableStat _zombieSightRadius; // 0x450
	FTunableStat _zombieLoseSightRadius; // 0x4d0
	FTunableStat _zombieVisionHalfAngle; // 0x550
	FDBDTunableRowHandle _zombieFallSmashTime; // 0x5d0
	FDBDTunableRowHandle _zombieAttackCooldownTime; // 0x5f8
};

struct ATimerGate : AGate {
	float _currentTime; // 0x248
};

struct UBlinkIndicatorController : UActorComponent {
	AActor* _indicatorClass; // 0xb8
	FGameplayTag _activationFlag; // 0xc0
	float _indicatorMinimumVelocity; // 0xcc
	float _indicatorVelocityEasingFactor; // 0xd0
	AActor* _indicator; // 0xd8
};

struct UOniCustomizationItemAnimInstance : UAnimInstance {
	bool _isInDemonMode; // 0x270
};

struct UGeometryCacheCodecBase : UObject {
	TArray<int32_t> TopologyRanges; // 0x30
};

struct UAnimNotifyState_Trail : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x38
	FName FirstSocketName; // 0x40
	FName SecondSocketName; // 0x4c
	ETrailWidthMode WidthScaleMode; // 0x58
	FName WidthScaleCurve; // 0x5c
	char bRecycleSpawnedSystems : 1; // 0x68
};

struct UCinematicManager : UObject {
	TArray<FCinematic> _cinematicQueue; // 0x48
};

struct UAnimNotifyState_TimedNiagaraEffect : UAnimNotifyState {
	UNiagaraSystem* Template; // 0x38
	FName SocketName; // 0x40
	FVector LocationOffset; // 0x4c
	FRotator RotationOffset; // 0x58
	bool bDestroyAtEnd; // 0x64
};

struct UBloodDecalEffect : UDataAsset {
	UCurveFloat* AnimationTimelineCurve; // 0x38
	UCurveFloat* DestroyTimelineCurve; // 0x40
	TArray<UTexture2D*> Textures; // 0x48
	TArray<UTexture2D*> Normals; // 0x58
	bool EnableVisualEffects; // 0x68
	UBloodDecalEffectIntensity* BloodDecalEffectIntensity; // 0x70
	float ColorInterpolationSpeed; // 0x78
	UMaterialInterface* DefalultDecalMaterial; // 0x80
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueId; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UFleeComponent : UActorComponent {
	AActor* _threat; // 0xb8
};

struct UThrillingTremors : UPerk {
	int32_t _cooldownByLevel[0x3]; // 0x3d0
	float _durationByLevel[0x3]; // 0x3dc
	bool _disableWhenSurvivorPutDownOrUnhooked; // 0x3e8
	FLinearColor _generatorAuraColorForKiller; // 0x3ec
	TArray<AGenerator*> _blockedGenerators; // 0x400
	TArray<AGenerator*> _revealedGenerators; // 0x410
};

struct UHillbillyChainsawAttack : UPounceAttack {
	FGameplayTag _chainsawHitGameEventTag; // 0x3d8
	FGameplayTag _chainsawAttemptGameEventTag; // 0x3e4
};

struct UCoreInteractionPromptsContainerWidget : UCoreBaseHudWidget {
	UDBDWrapBox* CenterContainerBox; // 0x300
	UDBDWrapBox* ContainerBox; // 0x308
	UCoreInteractionPromptWidget* InteractionPromptWidgetClass; // 0x310
	int32_t MaxDisplayedPrompts; // 0x318
	int32_t MaxDisplayedCenterPrompts; // 0x31c
	FMargin SlotMargin; // 0x320
	TArray<UCoreInteractionPromptWidget*> _promptWidgetPool; // 0x330
	TArray<UCoreInteractionPromptWidget*> _centerPromptWidgetPool; // 0x340
	TMap<FName, UCoreInteractionPromptWidget*> _displayedPromptsMap; // 0x350
};

struct UMultipleEventsBeforeResetEventQEEvaluator : UQuestEventEvaluatorBase {
	TArray<FGameplayTag> _gameEventsResettingProgress; // 0x90
};

struct UParticleModuleRotationRate_Seeded : UParticleModuleRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UUserDefinedCaptureProtocol : UMovieSceneImageCaptureProtocolBase {
	UWorld* World; // 0x60
};

struct UAkAssetPlatformData : UObject {
	UAkAssetData* CurrentAssetData; // 0x30
};

struct UNiagaraPrecompileContainer : UObject {
	TArray<UNiagaraScript*> Scripts; // 0x30
	UNiagaraSystem* System; // 0x40
};

struct APalletTracker : AActor {
	APallet* _procedurallySpawnedPallet; // 0x230
	APallet* _dreamPallet; // 0x238
	USceneComponent* _indicatorLocation; // 0x240
};

struct UTextureRenderTarget : UTexture {
	float TargetGamma; // 0xc0
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x30
};

struct UGhostStalkedComponent : UActorComponent {
	FMulticastInlineDelegate OnIsMarkedChanged; // 0xb8
	FMulticastInlineDelegate OnIsSpottingKillerChanged; // 0xc8
	FTagStateBool _isMarked; // 0xd8
	UStatusEffect* _ghostKillerInstinctEffect; // 0x110
	UTimerObject* _markTimer; // 0x150
	ASlasherPlayer* _killer; // 0x168
	UStalkedComponent* _stalkedComponent; // 0x170
};

struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0xf8
	float MaxSpeed; // 0xfc
	char bRotationFollowsVelocity : 1; // 0x100
	char bRotationRemainsVertical : 1; // 0x100
	char bShouldBounce : 1; // 0x100
	char bInitialVelocityInLocalSpace : 1; // 0x100
	char bForceSubStepping : 1; // 0x100
	char bSimulationEnabled : 1; // 0x100
	char bSweepCollision : 1; // 0x100
	char bIsHomingProjectile : 1; // 0x100
	char bBounceAngleAffectsFriction : 1; // 0x101
	char bIsSliding : 1; // 0x101
	char bInterpMovement : 1; // 0x101
	char bInterpRotation : 1; // 0x101
	float PreviousHitTime; // 0x104
	FVector PreviousHitNormal; // 0x108
	float ProjectileGravityScale; // 0x114
	float Buoyancy; // 0x118
	float Bounciness; // 0x11c
	float Friction; // 0x120
	float BounceVelocityStopSimulatingThreshold; // 0x124
	float MinFrictionFraction; // 0x128
	FMulticastInlineDelegate OnProjectileBounce; // 0x130
	FMulticastInlineDelegate OnProjectileStop; // 0x140
	float HomingAccelerationMagnitude; // 0x150
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x154
	float MaxSimulationTimeStep; // 0x15c
	int32_t MaxSimulationIterations; // 0x160
	int32_t BounceAdditionalIterations; // 0x164
	float InterpLocationTime; // 0x168
	float InterpRotationTime; // 0x16c
	float InterpLocationMaxLagDistance; // 0x170
	float InterpLocationSnapToTargetDistance; // 0x174
};

struct UBrushSculptProperties : UInteractiveToolPropertySet {
	bool bIsRemeshingEnabled; // 0x58
	EDynamicMeshSculptBrushType PrimaryBrushType; // 0x59
	float PrimaryBrushSpeed; // 0x5c
	bool bPreserveUVFlow; // 0x60
	bool bFreezeTarget; // 0x61
	float SmoothBrushSpeed; // 0x64
	bool bDetailPreservingSmooth; // 0x68
};

struct UNiagaraParameterCollection : UObject {
	FName Namespace; // 0x30
	TArray<FNiagaraVariable> Parameters; // 0x40
	UNiagaraParameterCollectionInstance* DefaultInstance; // 0x50
	FGuid CompileId; // 0x58
};

struct UUMGPromoPackPurchaseCurrencyButtonWidget : UUMGBaseCurrencyButtonWidget {
	UTextBlock* PercentageDiscountText; // 0x4d8
	UTextBlock* UndiscountedPrice; // 0x4e0
	UCanvasPanel* PercentageDiscountCanvas; // 0x4e8
	UOverlay* OverlayUndiscountedPrice; // 0x4f0
};

struct UBP_Audio_KLR_12_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UDifferentSurvivorsNearMeQEEvaluator : UQuestEventEvaluatorBase {
	TSet<ADBDPlayer*> _foundSurvivors; // 0x98
};

struct UThrowingKnivesHitSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _hitByKnifeTrigger; // 0x4f0
	bool _knifeHitCausedKOTrigger; // 0x4f1
	bool _knifeHitCausedDamageTrigger; // 0x4f2
	bool _useAlternateHitReactionState; // 0x4f3
	float _knifeHitAngle; // 0x4f4
	float _knifeHitStateHitAngle; // 0x4f8
	float _alternateKnifeHitStateHitAngle; // 0x4fc
};

struct URancor : UPerk {
	float _survivorRevealDuration; // 0x3d0
	float _killerRevealToObsessionDuration[0x3]; // 0x3d4
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x78
	float CurveTension; // 0x90
};

struct UContentScheduleManager : UObject {
	UObjectLibrary* _availableMapLibrary; // 0x138
};

struct AInteractable : AActor {
	UPrimitiveComponent* _singleZone; // 0x290
	bool _useSingleZone; // 0x298
	TArray<UInteractor*> _interactors; // 0x2a0
	UInteractableTransformOptimizer* _transformOptimizer; // 0x2b0
	TMap<UPrimitiveComponent*, FInteractionArray> _zoneToInteractions; // 0x2d8
};

struct UCustomizedSkeletalMesh : UActorComponent {
	USlaveAnimInstance* SlaveAnimInstanceClass; // 0xb8
	FMulticastInlineDelegate OnMeshSwitchBP; // 0xc0
	USkinnedMeshComponent* _meshOwner; // 0x100
	TSet<ECustomizationCategory> _ignoredItemCategories; // 0x110
	TArray<USkeletalMeshComponent*> Components; // 0x160
	TMap<ECustomizationCategory, USkeletalMeshComponent*> _categoryToComponents; // 0x170
	TArray<USkeletalMeshComponent*> Slaves; // 0x1c0
	TMap<ECustomizationCategory, AItemVfx*> _itemVfxs; // 0x1d0
	int32_t _characterIdOverride; // 0x2c0
};

struct UInfectedInteractableComponent : UActorComponent {
	UCurveFloat* VomitAlphaCurve; // 0xb8
	FName VomitAlphaParameterName; // 0xc0
	UTimelineComponent* _vomitAlphaTimeline; // 0xd0
};

struct UBTTask_InputPress : UBTTaskNode {
	EPawnInputPressTypes Input; // 0x78
	ETaskInputPressModes InputMode; // 0x79
	FAITunableParameter InputPressLoopInterval; // 0x7c
};

struct URBTSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isRemovingRBT; // 0x530
	bool _hasSkillCheckFailed; // 0x531
};

struct ANiagaraActor : AActor {
	UNiagaraComponent* NiagaraComponent; // 0x230
	char bDestroyOnSystemFinish : 1; // 0x238
};

struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	TArray<int32_t> SortedInstances; // 0x5a8
	int32_t NumBuiltInstances; // 0x5b8
	FBox BuiltInstanceBounds; // 0x5c0
	FBox UnbuiltInstanceBounds; // 0x5dc
	TArray<FBox> UnbuiltInstanceBoundsList; // 0x5f8
	char bEnableDensityScaling : 1; // 0x608
	int32_t OcclusionLayerNumNodes; // 0x610
	FBoxSphereBounds CacheMeshExtendedBounds; // 0x614
	bool bDisableCollision; // 0x630
	int32_t InstanceCountToRender; // 0x634
};

struct UFileMediaSource : UBaseMediaSource {
	FString FilePath; // 0x98
	bool PrecacheFile; // 0xa8
};

struct ULamentConfigurationPlayerAnalyticsComponent : UActorComponent {
	int32_t _analyticsCount; // 0xb8
	FLamentConfigurationPlayerPossessionData _possessionAnalytics; // 0xc0
};

struct UGeneratorTeleportInteraction : UChargeableInteractionDefinition {
	float OnBloodSpurtsAINoiseEventRange; // 0x6d8
	UTimerObject* _teleportCooldownTimer; // 0x6e0
	AGenerator* _selectedGenerator; // 0x728
	AGenerator* _locallySelectedGenerator; // 0x730
	FTransform _selectedTeleportLocation; // 0x740
	bool _isInteractionOngoing; // 0x770
	bool _teleportFailed; // 0x771
	float _bloodSpurtInterval; // 0x774
	float _collisionCheckCapsuleHalfHeight; // 0x778
	float _collisionCheckCapsuleRadius; // 0x77c
	FVector _collisionCheckLocationOffset; // 0x780
	float _capsuleTraceAngleIncrement; // 0x78c
	float _generatorTeleportMaxAngle; // 0x790
	float _downRaycastLength; // 0x794
};

struct UPushTwinOnLockerInteraction : UChargeableInteractionDefinition {
	UChargeableComponent* _pushTwinOnLockerChargeable; // 0x6d8
	FDBDTunableRowHandle _pushTwinOnLockerMaxCharge; // 0x6e0
};

struct UCamaraderie : UPerk {
	float _percentUseItem[0x3]; // 0x3dc
	float _pauseTimer[0x3]; // 0x3e8
	bool _needItemToTrigger; // 0x3f4
};

struct UCoreScreenIndicatorsContainerWidget : UCoreBaseHudWidget {
	float InactiveThreshold; // 0x2f8
	UCanvasPanel* Container; // 0x300
	UCoreScreenIndicatorWidget* ScreenIndicatorClass; // 0x308
	TMap<FString, UCoreScreenIndicatorWidget*> _screenIndicatorsMap; // 0x310
	TArray<UCoreScreenIndicatorWidget*> _screenIndicatorsPool; // 0x360
};

struct UEditPivotToolActionPropertySet : UInteractiveToolPropertySet {
	bool bUseWorldBox; // 0x60
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x270
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x278
	float BlendTime; // 0x280
	bool bBlendBool; // 0x284
};

struct UGridPathFollowingComponent : UPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x260
};

struct UBTDecorator_ExtCompareBBEntries : UBTDecorator_CompareBBEntries {
	float Tolerance; // 0xd8
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x40
};

struct UParticleModuleLocationDirect : UParticleModuleLocationBase {
	FRawDistributionVector Location; // 0x38
	FRawDistributionVector LocationOffset; // 0x80
	FRawDistributionVector ScaleFactor; // 0xc8
	FRawDistributionVector Direction; // 0x110
};

struct UMeshSelectionSet : USelectionSet {
	TArray<int32_t> Vertices; // 0x48
	TArray<int32_t> Edges; // 0x58
	TArray<int32_t> Faces; // 0x68
	TArray<int32_t> Groups; // 0x78
};

struct UUMGAtlantaRankUpPopup : UUMGGenericPopup {
	UUMGTallyRankBanner* RankBanner; // 0x3e8
	UHorizontalBox* RewardsContainer; // 0x3f0
	UCanvasPanel* RewardsSection; // 0x3f8
	TSoftClassPtr<UObject> RewardWidgetClass; // 0x400
};

struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; // 0x40
	float Max; // 0x44
};

struct UUMGCharacterFreeTicketWidget : UMobileBaseUserWidget {
	FMulticastInlineDelegate OnUseFreeTicketEvent; // 0x300
	UWidgetSwitcher* PanelSwitcher; // 0x310
	UVerticalBox* FreeTicketItemButtonBox; // 0x318
	TSoftClassPtr<UObject> _buttonClass; // 0x320
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0xa0
};

struct UInAppPurchaseComponent : UActorComponent {
	FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb8
	FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc8
	FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd8
	FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe8
	FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf8
	FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x108
	FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x118
};

struct UFSM_NotCondition : UFSM_Condition {
	UFSM_Condition* _condition; // 0x38
};

struct UUMGCharacterInfoScreen : UMobileBaseUserWidget {
	UCanvasPanel* ContentPanel; // 0x300
	TSoftClassPtr<UObject> SurvivorInfoWidgetClass; // 0x308
	TSoftClassPtr<UObject> KillerInfoWidgetClass; // 0x338
	UUMGPopupButton* ProgressionButton; // 0x368
	FMulticastInlineDelegate _onTeachableTooltipTriggeredLongPressEvent; // 0x370
	FMulticastInlineDelegate _onPowerItemTooltipTriggeredLongPressEvent; // 0x380
	FMulticastInlineDelegate _onProgressionButtonClickEvent; // 0x390
};

struct ULethalPursuer : UPerk {
	float _survivorRevealDuration[0x3]; // 0x3d0
};

struct UAddon_K22Power_19 : UOnEventBaseAddon {
	float _auraRevealedDuration; // 0x2a8
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x688
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x698
	FGuid GenerationGuid; // 0x6a8
};

struct UBTTask_Interact : UBTTaskNode {
	FBlackboardKeySelector BBInteractorObj; // 0x78
	EPawnInputPressTypes Input; // 0xa8
	float OnFailFocusCooldownDuration; // 0xac
	bool PropagateCooldownOnInteractable; // 0xb0
	float FailStartInteractTimeLimit; // 0xb4
};

struct UToIntegerField : UFieldNodeInt {
	UFieldNodeFloat* FloatField; // 0xb8
};

struct UTimerObject : UActorComponent {
	FReplicationTimerData _replicationData; // 0x118
};

struct ADatasmithAreaLightActor : AActor {
	EDatasmithAreaLightActorType LightType; // 0x230
	EDatasmithAreaLightActorShape LightShape; // 0x231
	FVector2D Dimensions; // 0x234
	float Intensity; // 0x23c
	ELightUnits IntensityUnits; // 0x240
	FLinearColor Color; // 0x244
	float Temperature; // 0x254
	UTextureLightProfile* IESTexture; // 0x258
	bool bUseIESBrightness; // 0x260
	float IESBrightnessScale; // 0x264
	FRotator Rotation; // 0x268
	float SourceRadius; // 0x274
	float SourceLength; // 0x278
	float AttenuationRadius; // 0x27c
	float SpotlightInnerAngle; // 0x280
	float SpotlightOuterAngle; // 0x284
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x30
	FVector RelativeLocation; // 0x3c
	FRotator RelativeRotation; // 0x48
	FVector RelativeScale; // 0x54
	FString Tag; // 0x60
};

struct UDialogueWave : UObject {
	char bMature : 1; // 0x30
	char bOverride_SubtitleOverride : 1; // 0x30
	FString SpokenText; // 0x38
	FString SubtitleOverride; // 0x48
	TArray<FDialogueContextMapping> ContextMappings; // 0x58
	FGuid LocalizationGUID; // 0x68
};

struct UUMGHudEditorScreen : UUserWidget {
	UUMGHudEditorLayoutWidget* _hudEditorLayoutWidget; // 0x260
	UUMGHudEditorVersionWidget* _versionSwapWidget; // 0x268
	TMap<EPlayerRole, UUMGHudEditorLayoutScreen*> _storedLayoutScreens; // 0x270
	UUMGHudEditorLayoutScreen* _currentLayoutScreen; // 0x2c0
	UAkAudioEvent* _onDropOverlapSound; // 0x2c8
};

struct UDBDNavEvadeLoopComponent : UActorComponent {
	FVector EvadeDoorExtent; // 0xb8
	float EvadeDoorFrontPointOffset; // 0xc4
	float EvadeDoorSideOffset; // 0xc8
	float SideBlockerOffset; // 0xcc
	float AutoSnapPointsUpHeight; // 0xd0
	float AutoSnapPointsDownHeight; // 0xd4
	ECollisionChannel AutoSnapCollisionChannel; // 0xd8
	UNavigationQueryFilter* EvadeLoopFilterClass; // 0xe0
	float MinSafetyLength; // 0xe8
	float MaxSafetyLength; // 0xec
	EAIEvadeLoopSides LimitToSide; // 0xf0
	bool DebugEditMode; // 0xf1
	bool DrawDebugFilter; // 0xf2
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x70
	FBlackboardKeySelector BlackboardKeyA; // 0x78
	FBlackboardKeySelector BlackboardKeyB; // 0xa8
};

struct UAISkill_InteractionUseItem : UAISkill_Interaction {
	ELoadoutItemType ItemType; // 0x170
};

struct ABP_AdaptiveShadowMapControllers_C : AActor {
	UGMAdaptiveShadowMapControllerComponent* GMAdaptiveShadowMapControllerSpotlights; // 0x230
	UGMAdaptiveShadowMapControllerComponent* GMAdaptiveShadowMapControllerDirectional; // 0x238
	USceneComponent* DefaultSceneRoot; // 0x240
};

struct ABP_Menu_Slasher04_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_04_C* BP_Audio_KLR_04; // 0x698
};

struct UDBDBoxReflectionCaptureSpawnerComponent : UDBDReflectionCaptureSpawnerComponent {
	FVector InfluenceBox; // 0x268
	float BoxTransitionDistance; // 0x274
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UCoreInteractionPromptActionWidget : UCoreBaseUserWidget {
	UCoreInputPromptWidget* InputPrompt; // 0x2d8
	UCoreInputPromptWidget* InputPrompt2; // 0x2e0
	UCoreInputPromptWidget* InputPrompt3; // 0x2e8
	UCoreInputPromptWidget* InputPrompt4; // 0x2f0
	FName IdleAnimationName; // 0x2f8
	FKey InputKey; // 0x308
	FKey InputKey2; // 0x328
	FKey InputKey3; // 0x348
	FKey InputKey4; // 0x368
};

struct UUMGBaseCurrencyButtonWidget : UUMGBaseButtonWidget {
	UImage* FXImage; // 0x430
	UImage* CurrencyColorImage; // 0x438
	UImage* CurrencyIcon; // 0x440
	UTextBlock* PriceText; // 0x448
	FSlateColor AffordableColor; // 0x450
	FSlateColor NotAffordableColor; // 0x478
	FLinearColor DisabledOpacity; // 0x4a0
	FLinearColor EnabledOpacity; // 0x4b0
};

struct UPositionLagCompensationComponent : UActorComponent {
	float _maxExtrapolationDurationInSeconds; // 0xb8
	float _maxInterpolationToServerMoveInSeconds; // 0xbc
};

struct UUMGAtlantaCalendarEventsTemplate : UUMGAtlantaBaseEventsTemplate {
	UUMGAtlantaDailyRewardsGrid* DailyRewardGrid; // 0x300
};

struct UVirtualTexturePoolConfig : UObject {
	int32_t DefaultSizeInMegabyte; // 0x30
	TArray<FVirtualTextureSpacePoolConfig> Pools; // 0x38
};

struct UItemTooltipWidget : UBaseTooltipWidget {
	UTextBlock* RarityLabel; // 0x338
	UUMGHtmlRichText* WarningText; // 0x340
	UImage* HeaderSmoke; // 0x348
	UImage* HeaderBackground; // 0x350
};

struct UUMGPlayerRankInfo : UMobileBaseUserWidget {
	UUMGTallyPipsContainer* PipsContainerWidget; // 0x300
	UUMGTallyRankFrame* RankFrameWidget; // 0x308
	UImage* Background; // 0x310
	UTextBlock* TitleLabel; // 0x318
	UTextBlock* RankLabel; // 0x320
	UTextBlock* pipLabel; // 0x328
	UCanvasPanel* HighlightContainer; // 0x330
	FLinearColor _survivorColorBackground; // 0x338
	FLinearColor _killerColorBackground; // 0x348
	float _disableOpacity; // 0x358
};

struct UFSM_State : UObject {
	FName _stateName; // 0x30
	bool _shouldTick; // 0x3c
	UFSM_State* _defaultChildStateClass; // 0x40
	TArray<UFSM_Transition*> _transitions; // 0x48
	UFiniteStateMachine* _stateMachine; // 0x58
	UFSM_State* _parentState; // 0x60
	UFSM_State* _currentChildState; // 0x68
	float _startTimestamp; // 0x70
};

struct ALamentConfiguration : ACollectable {
	USpherePlayerOverlapComponent* _interactable; // 0x508
	UInteractor* _collectableInteractor; // 0x510
	UK25CollectLamentConfigurationInteraction* _survivorCollectItemInteraction; // 0x518
	UK25CollectLamentConfigurationInteraction* _killerCollectItemInteraction; // 0x520
	UDBDOutlineComponent* _outlineComponent; // 0x528
	UMaterialHelper* _materialHelper; // 0x530
	ULamentConfigurationOutlineStrategy* _outlineStrategy; // 0x538
	ULamentConfigurationSpawnStrategy* _spawnStrategy; // 0x540
	ULamentConfigurationChainHuntComponent* _chainHuntComponent; // 0x548
	float _dotProductMinValue; // 0x550
	EAttachToSocketNameEnum _survivorAttachmentSocket; // 0x554
	EAttachToSocketNameEnum _killerAttachmentSocket; // 0x555
	UAnimationMontageSlave* _montageFollower; // 0x558
	UMontagePlayer* _montagePlayer; // 0x560
	AK25AnimationFollowerActor* _chainAnimationActorClass; // 0x568
	AK25LamentConfigurationTeleportIndicator* _lamentConfigurationTeleportIndicatorClass; // 0x570
	FName _chainAnimationFollowerAttachmentSocketName; // 0x578
	FAkObservedPlayerSoundLoop _possessionSoundLoop; // 0x588
	FDBDTunableRowHandle _respawnTimeAfterLamentConfigurationSolved; // 0x5c8
	FDBDTunableRowHandle _respawnTimeAfterKillerPickUp; // 0x5f0
	FDBDTunableRowHandle _respawnTimeAfterSurvivorFreeBySelf; // 0x618
	FDBDTunableRowHandle _respawnTimeAfterSurvivorFreeByAttack; // 0x640
	FDBDTunableRowHandle _numberChainsToLaunchUponKillerPickUpLamentConfiguration; // 0x668
	FDBDTunableRowHandle _hostageInteractionTime; // 0x690
	ELamentConfigurationState _localLamentConfigurationState; // 0x6b8
	ELamentConfigurationState _lamentconfigurationState; // 0x6b9
	AK25AnimationFollowerActor* _chainAnimationActor; // 0x6c0
	ACamperPlayer* _survivorHeldHostage; // 0x710
	float _solvedLamentConfigurationDropDistanceToCollectorCentimeters; // 0x740
	float _failedLamentConfigurationSolveDropDistanceToCollectorCentimeters; // 0x744
	bool _solved; // 0x748
	bool _releasedByAttack; // 0x749
	AK25LamentConfigurationTeleportIndicator* _lamentConfigurationTeleportIndicator; // 0x750
};

struct UResiliencePerk : UPerk {
	float _actionSpeed[0x3]; // 0x3d0
};

struct UAudioCurveSourceComponent : UAudioComponent {
	FName CurveSourceBindingName; // 0x800
	float CurveSyncOffset; // 0x80c
};

struct ABaseCamperCollectable : ACollectable {
	USpherePlayerOverlapComponent* _interactable; // 0x4d0
	UInteractor* _collectableInteractor; // 0x4d8
	UDropItemInteraction* _dropInteraction; // 0x4e0
	UCollectItemInteraction* _collectInteraction; // 0x4e8
	USphereComponent* _infectablePrimitive; // 0x4f0
	UDBDOutlineComponent* _outlineComponent; // 0x4f8
	UMaterialHelper* _materialHelper; // 0x500
	USurvivorCollectableOutlineUpdateStrategy* _survivorCollectableOutlineUpdateStrategy; // 0x508
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct UMaterialExpressionReflectionVectorWS : UMaterialExpression {
	FExpressionInput CustomWorldNormal; // 0x48
	char bNormalizeCustomWorldNormal : 1; // 0x64
};

struct UK25ChainStrikeState_OutOfBodyState : UK25ChainStrikeBaseState {
	FDBDTunableRowHandle _fovTimeChangeDuration; // 0xc8
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x48
	float Exponent; // 0x64
	FExpressionInput BaseReflectFractionIn; // 0x68
	float BaseReflectFraction; // 0x84
	FExpressionInput Normal; // 0x88
};

struct UZombieAttractedByGeneratorBTService : UBTService_BlueprintBase {
	float _genRepairingHearingRange; // 0xa0
};

struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FComboBoxStyle ComboBoxStyle; // 0x38
};

struct UDecalCollection : UObject {
	TArray<UDBDDecalComponent*> _decalComponentsArray; // 0x30
	TSet<UDBDDecalComponent*> _activeDecalComponents; // 0x40
	TSet<UDBDDecalComponent*> _inactiveDecalComponents; // 0x90
	TArray<bool> _DeltaZPool; // 0xe0
	TMap<UStaticMeshComponent*, int32_t> _deltaZMultipliers; // 0xf0
};

struct UBTTask_RunSkills : UBTTaskNode {
	FGameplayTag Context; // 0x78
};

struct UAddon_TheBlight_21 : UItemAddon {
	UStatusEffect* _forceKoStatusEffect; // 0x298
};

struct UPathStrategy_FleeLoop : UPathStrategy_Flee {
	TMap<EAIDifficultyLevel, FGameStateEvadeLoopStrategyMapContainer> GameStateFleeLoopStrategyTable; // 0xb8
	TMap<EAIFleeLoopStrategy, UPathBuilder_EvadeLoop*> FleeLoopStrategyPathBuilders; // 0x108
	float CanBranchUnderEndPathDistance; // 0x158
	TMap<EAIFleeLoopStrategy, FAIRoll> BranchRolls; // 0x160
	float RejectLoopBranchUnderEndPointsDistance; // 0x1b0
	float RejectBranchPointNearerHostileSourceDistance; // 0x1b4
	float RejectBranchUnderNavLinkDistance; // 0x1b8
	float AddDistanceToRequiredBranchEvadeGap; // 0x1bc
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x30
};

struct ULandscapeGrassType : UObject {
	TArray<FGrassVariety> GrassVarieties; // 0x30
	char bEnableDensityScaling : 1; // 0x40
	UStaticMesh* GrassMesh; // 0x48
	float GrassDensity; // 0x50
	float PlacementJitter; // 0x54
	int32_t StartCullDistance; // 0x58
	int32_t EndCullDistance; // 0x5c
	bool RandomRotation; // 0x60
	bool AlignToSurface; // 0x61
};

struct UDrawPolyPathTool : UInteractiveTool {
	UDrawPolyPathProperties* TransformProps; // 0xa8
	UDrawPolyPathExtrudeProperties* ExtrudeProperties; // 0xb0
	UNewMeshMaterialProperties* MaterialProperties; // 0xb8
	UConstructionPlaneMechanic* PlaneMechanic; // 0x140
	UPolyEditPreviewMesh* EditPreview; // 0x1e8
	UPlaneDistanceFromHitMechanic* ExtrudeHeightMechanic; // 0x1f0
	USpatialCurveDistanceMechanic* CurveDistMechanic; // 0x1f8
	UCollectSurfacePathMechanic* SurfacePathMechanic; // 0x200
};

struct UCoreSubtitlesWidget : UCoreBaseUserWidget {
	UDBDTextBlock* SubtitlesTB; // 0x2e0
	int32_t NumberOfCharacterPerLine; // 0x2e8
	float DurationPerLine; // 0x2ec
	bool KeepSingleCharacter; // 0x2f0
	TArray<FSubtitlesEntry> _entryQueue; // 0x2f8
	FTimerHandle _timerHandle; // 0x308
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x38
	FVector RelativeTranslation; // 0x40
	FRotator RelativeRotation; // 0x4c
	FVector RelativeScale3D; // 0x58
	float Intensity; // 0x64
	float Tightness; // 0x68
	char bIgnoreComponentTransform : 1; // 0x6c
	char bTileX : 1; // 0x6c
	char bTileY : 1; // 0x6c
	char bTileZ : 1; // 0x6c
	char bUseFixDT : 1; // 0x6c
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x160
};

struct UArrowComponent : UPrimitiveComponent {
	FColor ArrowColor; // 0x428
	float ArrowSize; // 0x42c
	float ScreenSize; // 0x430
	char bIsScreenSizeScaled : 1; // 0x434
	char bTreatAsASprite : 1; // 0x434
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x30
	bool bEnableTerrainSplineEditing; // 0x31
	bool bResizeSpriteDataToMatchTextures; // 0x32
};

struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
};

struct UAISkill_InteractionTarget_Throw : UAISkill_InteractionTarget {
	EAIThrowPredictionModes ThrowPredictionMode; // 0x220
	int32_t MaxAddPitchAngle; // 0x224
	EAIThrowProjectileModes ThrowProjectileMode; // 0x228
	FAITunableParameter HoldInputTimeRandDeviation; // 0x22c
	FAITunableParameter PitchAngleRandDeviation; // 0x23c
};

struct UWakerObjectAnimInstance : UAnimInstance {
	float _reappearTimerCooldown; // 0x270
	float _wakeUpCharge; // 0x274
	bool _chargeStarted; // 0x278
	bool _interactionComplete; // 0x279
	bool _outEnd; // 0x27a
	bool _reset; // 0x27b
	bool _inEnd; // 0x27c
	bool _wakerObjectStarted; // 0x27d
	bool _respawnEnd; // 0x27e
	bool _cancelEnd; // 0x27f
};

struct UBTDecorator_IsInteractionAvailable : UBTDecorator_TickableBase {
	TArray<FString> InteractionIds; // 0x70
	EIsInteractionAvailableOnFilter OnFilter; // 0x80
	bool FailIfAnotherOngoingInteraction; // 0x81
	bool FailIfNotPerformingInteraction; // 0x82
};

struct UTeleportToDemogorgonPortalInteraction : UChargeableInteractionDefinition {
	float _enterPortalPhaseDuration; // 0x6d8
	float _cancelTeleportingPhaseDuration; // 0x6dc
	UPortalTargetingComponent* _portalTargetingComponent; // 0x6e0
	UPortalPlacerStateComponent* _portalPlacerState; // 0x6e8
	ADemogorgonPortal* _startingPortal; // 0x6f0
	ADemogorgonPortal* _targetedPortal; // 0x6f8
	ADBDPlayer* _interactingPlayer; // 0x700
	AActor* _huskRef; // 0x768
	AActor* ClassToSpawnForHusk; // 0x770
};

struct UBlightPowerStateDash : UBlightPowerState {
	FTunableStat _vectorInterpToSpeed; // 0x188
	UCurveFloat* _noDashTimeLimitSpeedCurve; // 0x208
	UCurveFloat* _lookAngleToTurnRateCurveController; // 0x210
	UCurveFloat* _lookAngleToTurnRateCurveMouse; // 0x218
	UCurveFloat* _lookAngleToMaxTurnRateCurveMouse; // 0x220
};

struct UCamperDreamworldComponent : UCharacterDreamworldComponent {
	FMulticastInlineDelegate OnCamperTriggeredDreamTrap; // 0x108
	FSurvivorSleepiness _survivorSleepiness; // 0x118
	float _sleepinessProtectionRemainingDuration; // 0x120
	float _sleepGainPerSecond; // 0x124
	int32_t _wakeUpByOtherCount; // 0x12c
	bool _showKiller; // 0x130
	FFastTimer _killerGlimpseDurationTimer; // 0x138
	FFastTimer _killerGlimpseCooldownTimer; // 0x178
	float _glimpseMinDistance; // 0x1b8
	float _glimpseMaxDistance; // 0x1bc
	float _killerGlimpseCooldown; // 0x1c0
	float _killerGlimpseDuration; // 0x1c4
	int32_t _wakeUpBySkillCheckCount; // 0x1c8
	int32_t _fellAsleepCount; // 0x1cc
	bool _forcedAsleep; // 0x1d0
	AWakerObject* _linkedWaker; // 0x1d8
	bool _useScriptedKillerVisibility; // 0x1e0
	bool _showKillerInstantly; // 0x1e8
};

struct UPopupSequencer : UObject {
	UDBDGameInstance* _gameInstance; // 0x38
};

struct UAISkill_FindCollectable_LamentConfiguration : UAISkill_FindCollectable {
	FAITunableParameter StopChainHuntGoalWeight; // 0x120
	FAITunableParameter PreemptiveFindLamentGoalWeight; // 0x130
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x428
	UBodySetup* BrushBodySetup; // 0x430
};

struct UBlindableBaseComponent : UActorComponent {
	bool _isBlinded; // 0x148
	FTagStateBool _isBeingBlinded; // 0x150
	UChargeableComponent* _chargeableComponent; // 0x180
	TMap<AActor*, TScriptInterface<IBlindingEffectorInterface>> _blindingEffectors; // 0x188
};

struct UCharmSpawnerComponent : UActorComponent {
	FName SocketRootName; // 0xb8
	TArray<FCharmSlot> CharmSlots; // 0xc8
	FVector ScaleCharm; // 0xd8
	int32_t _forcedLOD; // 0xe4
};

struct APhysicsThruster : ARigidBodyBase {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x230
};

struct UEnvQueryTest_Dot : UEnvQueryTest {
	FEnvDirection LineA; // 0x238
	FEnvDirection LineB; // 0x258
	EEnvTestDot TestMode; // 0x278
	bool bAbsoluteValue; // 0x279
};

struct UPlayerOverlapHISMComponent : UHISMMaterialHelperComponent {
	int32_t _playerInfluenceRadius; // 0x6a8
	TArray<UMaterialInterface*> _playerOverlapOverrides; // 0x6b0
};

struct UBTDecorator_ExtTimeLimit : UBTDecorator_TimeLimit {
	FAITunableParameter MaxTimeLimit; // 0x80
	FBlackboardKeySelector BBFilterKey; // 0x90
	EBasicKeyOperation FilterOperation; // 0xc0
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	FString Text; // 0x50
	FLinearColor CommentColor; // 0x60
	int32_t FontSize; // 0x70
};

struct UCharacterSightableComponent : UActorComponent {
	FMulticastInlineDelegate OnHighestSightStatusChangedBP; // 0xe8
	TMap<TWeakObjectPtr<ACharacter>, FDelegateHandleWrapper> _sightDelegateHandles; // 0xf8
	TMap<TWeakObjectPtr<ACharacter>, ESightStatus> _sightersStatus; // 0x148
};

struct UEventOccurredBetweenQEEvaluator : UQuestEventEvaluatorBase {
	FGameplayTag _middleEvent; // 0xa0
	bool outerEventsDifferentTargets; // 0xac
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x268
	TArray<AOnlineBeaconClient*> ClientActors; // 0x270
};

struct UUMGPlayerNameInputPopup : UUMGGenericPopup {
	UEditableTextBox* NameInputTextBox; // 0x3e8
};

struct UPathStrategySelector_Flee : UPathStrategySelector {
	TMap<EAIFleePathStrategy, UPathStrategy*> FleePathStrategies; // 0x68
	TMap<EAIFleePathStrategy, UPathStrategy*> _activeFleePathStrategiesMap; // 0xc0
};

struct UOnEventSetTimerAddon : UOnEventBaseAddon {
	float _addonEffectTime; // 0x2a8
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x478
	int32_t MapHeight; // 0x47c
	int32_t TileWidth; // 0x480
	int32_t TileHeight; // 0x484
	UPaperTileSet* DefaultLayerTileSet; // 0x488
	UMaterialInterface* Material; // 0x490
	TArray<UPaperTileLayer*> TileLayers; // 0x498
	FLinearColor TileMapColor; // 0x4a8
	int32_t UseSingleLayerIndex; // 0x4b8
	bool bUseSingleLayer; // 0x4bc
	UPaperTileMap* TileMap; // 0x4c0
};

struct UGameplayTaskResource : UObject {
	int32_t ManualResourceID; // 0x30
	int8_t AutoResourceID; // 0x34
	char bManuallySetID : 1; // 0x38
};

struct URestrictedPlacementAreaDefaultStrategy : URestrictedPlacementAreaStrategy {
	AActor* RestrictedActor; // 0x70
};

struct AMockPoolableActor : AActor {
	UPoolableActorComponent* _poolable; // 0x230
};

struct UAB_Menu_Slasher15_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x328
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3a0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3c0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x3e0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x840
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0xca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x1100
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1560
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x19c0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x1a60
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1ad8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1b78
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1bb0
	bool Role Selected; // 0x1c60
	bool Is Online; // 0x1c61
};

struct USpiritHuskActivePhaseWalkAnimInstance : USpiritHuskAnimInstance {
	float _elapsedTimeSinceFakingRealKillerPose; // 0x280
	float _idleAnimationExplicitTime; // 0x284
	UAnimSequence* _idleAnimationSequence; // 0x290
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x240
};

struct UCollectSerumInCrateInteraction : UCollectItemInteraction {
	ASupplyCrateInteractable* _owningSupplyCrate; // 0x5d8
};

struct UGameplayTagsManager : UObject {
	TArray<FGameplayTagSource> TagSources; // 0xc8
	TArray<UDataTable*> GameplayTagTables; // 0x1b8
};

struct UPacketHandlerProfileConfig : UObject {
	TArray<FString> Components; // 0x30
};

struct UBTTask_ExtMoveTo : UBTTask_MoveTo {
	FBlackboardKeySelector BBStrafeFocus; // 0xc0
	EExtMoveToStrafeFocusOptions StrafeFocus; // 0xf0
	bool StrafeFocusPitch; // 0xf1
	float StrafeNearFocusModeUnderDistance; // 0xf4
	float IntermittentOnStrafeFocusInterval; // 0xf8
	float IntermittentOnStrafeFocusDeviation; // 0xfc
	float IntermittentOffStrafeFocusInterval; // 0x100
	float IntermittentOffStrafeFocusDeviation; // 0x104
	float EndMoveStrafeFocusPrecisionAngle; // 0x108
	bool StrafeFocusOwnerOnComponentBBKey; // 0x10c
	ECharacterMovementTypes ToGoalMovementMode; // 0x10d
	ECharacterMovementTypes NearGoalMovementMode; // 0x10e
	float NearGoalModeUnderDistance; // 0x110
	float NormalMoveUnderNavLinkDistance; // 0x114
	FBlackboardKeySelector BBIgnoreGroupAvoidance; // 0x118
	float RepathInterval; // 0x148
	bool UseAccelerationForPaths; // 0x14c
	float PathReachedPointRadius; // 0x150
	FName UseContextualAcceptableRadius; // 0x154
};

struct ABP_Menu_CamperFemale12_C : ABP_Menu_Base_Camper_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x670
};

struct UCoreRewardWidget : UCoreButtonWidget {
	UDBDImage* RewardIcon; // 0x398
};

struct UProceduralMeshComponent : UMeshComponent {
	bool bUseComplexAsSimpleCollision; // 0x480
	bool bUseAsyncCooking; // 0x481
	UBodySetup* ProcMeshBodySetup; // 0x488
	TArray<FProcMeshSection> ProcMeshSections; // 0x490
	TArray<FKConvexElem> CollisionConvexElems; // 0x4a0
	FBoxSphereBounds LocalBounds; // 0x4b0
	TArray<UBodySetup*> AsyncBodySetupQueue; // 0x4d0
};

struct UNetworkSettings : UDeveloperSettings {
	char bVerifyPeer : 1; // 0x48
	char bEnableMultiplayerWorldOriginRebasing : 1; // 0x48
	int32_t MaxRepArraySize; // 0x4c
	int32_t MaxRepArrayMemory; // 0x50
	TArray<FNetworkEmulationProfileDescription> NetworkEmulationProfiles; // 0x58
};

struct AGnome : ARespawnableInteractable {
	UGnomeInteraction* _gnomeInteraction; // 0x350
	UGnomeInteraction* _gnomeInteractionKiller; // 0x358
	UChargeableComponent* _gnomeInteractionChargeable; // 0x360
	UChargeableComponent* _gnomeInteractionChargeableKiller; // 0x368
	UInteractor* _gnomeInteractor; // 0x370
	UPrimitiveComponent* _gnomeInteractionZone; // 0x378
	UDBDOutlineComponent* _outlineComponent; // 0x380
	USkeletalMeshComponent* _gnomeSkeletalMesh; // 0x388
	FDBDTunableRowHandle _gnomeInteractionSecondsToCharge; // 0x390
	FDBDTunableRowHandle _gnomeInteractionSecondsToChargeKiller; // 0x3b8
	FLinearColor _auraColorWhileInteracting; // 0x3e0
};

struct UCoreButtonSelector : UCoreBaseUserWidget {
	FMulticastInlineDelegate OnSelectedDelegate; // 0x2d8
	FMulticastInlineDelegate OnSelectedAgainDelegate; // 0x2e8
	FMulticastInlineDelegate OnUnselectedDelegate; // 0x2f8
	TArray<UCoreSelectableButtonWidget*> _buttons; // 0x308
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UDBD_CrossDissolver : UActorComponent {
	TArray<UMaterialInterface*> NewMaterials; // 0xb8
	TArray<USkeletalMeshComponent*> BaseSkeletalMesh; // 0xc8
	TArray<USkeletalMeshComponent*> ClonedSkeletalMeshes; // 0xd8
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x48
	FExpressionInput RayTraced; // 0x64
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe8
	UAnimSequence* AnimSequence; // 0x1c0
	UAnimSequenceBase* Animation; // 0x1c8
	float StartOffset; // 0x1d0
	float EndOffset; // 0x1d4
	float PlayRate; // 0x1d8
	char bReverse : 1; // 0x1dc
	FName SlotName; // 0x1e0
};

struct ATutorialsUtilities : AActor {
	FMulticastInlineDelegate OnTutorialUIReady; // 0x230
};

struct UInputAxisKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x30
};

struct UFootstepsPerceptionComponent : UActorComponent {
	TArray<FGameplayTag> _allowFootstepsSeenPerkFlags; // 0xb8
	TArray<FGameplayTag> _disallowFootstepsSeenPerkFlags; // 0xc8
};

struct UDataTable : UObject {
	UScriptStruct* RowStruct; // 0x30
	char bStripFromClientBuilds : 1; // 0x88
	char bIgnoreExtraFields : 1; // 0x88
	char bIgnoreMissingFields : 1; // 0x88
	FString ImportKeyField; // 0x90
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x268
};

struct UMaterialExpressionSobol : UMaterialExpression {
	FExpressionInput Cell; // 0x48
	FExpressionInput Index; // 0x64
	FExpressionInput Seed; // 0x80
	uint32_t ConstIndex; // 0x9c
	FVector2D ConstSeed; // 0xa0
};

struct AOfferingSequenceAssets : AActor {
	TArray<FOfferingRevealDelays> OfferingRevealDelays; // 0x230
	TArray<AOfferingCard*> Cards; // 0x240
};

struct UProceduralShapeToolProperties : UInteractiveToolPropertySet {
	bool bInstanceIfPossible; // 0x58
	EMakeMeshShapeType Shape; // 0x5c
	float Width; // 0x60
	float Height; // 0x64
	float FeatureRadius; // 0x68
	int32_t Slices; // 0x6c
	int32_t Subdivisions; // 0x70
	EMakeMeshPolygroupMode PolygroupMode; // 0x74
	EMakeMeshPlacementType PlaceMode; // 0x75
	EMakeMeshPivotLocation PivotLocation; // 0x76
	float Rotation; // 0x78
	bool bAlignShapeToPlacementSurface; // 0x7c
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UMenuAnchor : UContentWidget {
	UUserWidget* MenuClass; // 0x140
	FDelegate OnGetMenuContentEvent; // 0x148
	EMenuPlacement Placement; // 0x15c
	bool bFitInWindow; // 0x15d
	bool ShouldDeferPaintingAfterWindowContent; // 0x15e
	bool UseApplicationMenuStack; // 0x15f
	FMulticastInlineDelegate OnMenuOpenChanged; // 0x160
};

struct UAkIOSInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkAudioSession AudioSession; // 0x98
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa8
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xd0
};

struct UOutlineUpdateStrategy : UActorComponent {
	UDBDOutlineComponent* _outlineComponent; // 0xb8
};

struct UPawnObserver : UUIComponent {
	APawn* _pawn; // 0xd8
};

struct UMaterialExpressionChannelMaskParameter : UMaterialExpressionVectorParameter {
	EChannelMaskParameterColor MaskChannel; // 0x80
	FExpressionInput Input; // 0x84
};

struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x60
	FRichCurve YCurve; // 0xe0
	FRichCurve ZCurve; // 0x160
};

struct UUMGAltantaRitual : UMobileBaseUserWidget {
	FText _claimText; // 0x300
	FText _claimedText; // 0x318
	FText _completedText; // 0x330
};

struct UUMGSubscriptionsPageScrollWidget : UUMGGridPageScrollWidget {
	TSoftClassPtr<UObject> SubscriptionPackButtonClass; // 0x438
	FVector2D ItemPadding; // 0x468
};

struct UUMGTallyPip : UMobileBaseUserWidget {
	UImage* Filling; // 0x300
};

struct UDrawPolygonToolSnapProperties : UInteractiveToolPropertySet {
	bool bEnableSnapping; // 0x58
	bool bSnapToWorldGrid; // 0x59
	bool bSnapToVertices; // 0x5a
	bool bSnapToEdges; // 0x5b
	bool bSnapToAngles; // 0x5c
	bool bSnapToLengths; // 0x5d
	float SegmentLength; // 0x60
	bool bHitSceneObjects; // 0x64
	float HitNormalOffset; // 0x68
};

struct UAISense_Damage : UAISense {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x90
};

struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	FVector Min; // 0x40
	FVector Max; // 0x4c
};

struct UBaseKillerWeaponAnimInstance : UAnimInstance {
	EAttackSubstate _attackState; // 0x270
	bool _isCarrying; // 0x271
	bool _isActive; // 0x272
	float _attackInPlayRate; // 0x274
	FAnimSequenceSelector _attackIn; // 0x278
	float _attackSwingPlayRate; // 0x290
	FAnimSequenceSelector _attackSwing; // 0x298
	float _attackMissPlayRate; // 0x2b0
	FAnimSequenceSelector _attackMiss; // 0x2b8
	float _attackHitPlayRate; // 0x2d0
	FAnimSequenceSelector _attackHit; // 0x2d8
	float _attackBounceOfWallPlayRate; // 0x2f0
	FAnimSequenceSelector _attackBounceOfWall; // 0x2f8
	bool _firstPersonView; // 0x320
};

struct UK25ControlledProjectileMovementComponent : UPhysicsBasedProjectileMovementComponent {
	FDBDTunableRowHandle _projectileBaseSpeed; // 0x260
	FDBDTunableRowHandle _baseProjectileMaximumDistance; // 0x288
	FDBDTunableRowHandle _projectileSpeedIncreaseTime; // 0x2b0
	FTunableStat _maximumTravelDistanceStat; // 0x2d8
	UCurveFloat* _projectileSpeedIncreaseMultiplier; // 0x358
	float _totaldistanceTravelled; // 0x360
};

struct UBlinkPowerEventDispatcher : UActorComponent {
	FMulticastInlineDelegate OnFinishPlaying; // 0xb8
	FMulticastInlineDelegate OnStartBlinkChargeEvent; // 0xc8
	FMulticastInlineDelegate OnUpdateBlinkChargeEvent; // 0xd8
	FMulticastInlineDelegate OnStopBlinkChargeEvent; // 0xe8
	FMulticastInlineDelegate OnEnterBlinkEvent; // 0xf8
	FMulticastInlineDelegate OnUpdateBlinkEvent; // 0x108
	FMulticastInlineDelegate OnExitBlinkEvent; // 0x118
	FMulticastInlineDelegate OnEnterChainBlinkEvent; // 0x128
	FMulticastInlineDelegate OnUpdateChainBlinkEvent; // 0x138
	FMulticastInlineDelegate OnExitChainBlinkEvent; // 0x148
	FMulticastInlineDelegate OnEnterCooldownEvent; // 0x158
	FMulticastInlineDelegate OnUpdateCooldownEvent; // 0x168
	FMulticastInlineDelegate OnExitCooldownEvent; // 0x178
	FMulticastInlineDelegate OnIsBlinkingChangedEvent; // 0x188
	FMulticastInlineDelegate OnIsChargingBlinkChangedEvent; // 0x198
	FMulticastInlineDelegate OnBlinkChargeFullEvent; // 0x1a8
	FMulticastInlineDelegate OnBlinkPowerStateChangedEvent; // 0x1b8
	FMulticastInlineDelegate OnBlinkChargesChangedEvent; // 0x1c8
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xe8
};

struct USnowmanAnimInstance : UAnimInstance {
	bool _isIdle; // 0x270
	bool _isBeingEntered; // 0x271
	bool _isControlled; // 0x272
	bool _isDestroyed; // 0x273
	bool _isBeingDestroyedDueToSurvivorRunExit; // 0x274
	bool _isBeingDestroyedDueToKillerAttackWhileControlled; // 0x275
	bool _isBeingDestroyedDueToKillerAttackWhileEmpty; // 0x276
	bool _isSurvivorUsingSnowmanMoving; // 0x277
	TWeakObjectPtr<ASnowman> _snowman; // 0x27c
	TWeakObjectPtr<ACamperPlayer> _survivorUsingSnowman; // 0x284
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x230
};

struct ALobbyBeaconState : AInfo {
	int32_t MaxPlayers; // 0x230
	ALobbyBeaconPlayerState* LobbyBeaconPlayerStateClass; // 0x238
	bool bLobbyStarted; // 0x248
	float WaitForPlayersTimeRemaining; // 0x24c
	FLobbyPlayerStateInfoArray Players; // 0x250
};

struct UGizmoTransformChangeStateTarget : UObject {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x58
};

struct UAkAudioEventData : UAkAssetDataSwitchContainer {
	float MaxAttenuationRadius; // 0xb8
	bool IsInfinite; // 0xbc
	float MinimumDuration; // 0xc0
	float MaximumDuration; // 0xc4
	TMap<FString, UAkAssetDataSwitchContainer*> LocalizedMedia; // 0xc8
	TSet<UAkAudioEvent*> PostedEvents; // 0x118
	TSet<UAkAuxBus*> UserDefinedSends; // 0x168
	TSet<UAkTrigger*> PostedTriggers; // 0x1b8
	TSet<UAkGroupValue*> GroupValues; // 0x208
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x30
	ADebugCameraController* DebugCameraControllerClass; // 0x38
};

struct AARSharedWorldGameMode : AgameMode {
	int32_t BufferSizePerChunk; // 0x328
};

struct UInterpTrackInstColorProp : UInterpTrackInstProperty {
	FColor ResetColor; // 0x60
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x30
	UAnimationSharingStateProcessor* StateProcessor; // 0xb0
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xf0
	UEnum* StateEnum; // 0x110
	AActor* SharingActor; // 0x118
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x48
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x58
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x68
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x78
	bool bOnlyCookProductionAssets; // 0x88
	bool bShouldManagerDetermineTypeAndName; // 0x89
	bool bShouldGuessTypeAndNameInEditor; // 0x8a
	bool bShouldAcquireMissingChunksOnLoad; // 0x8b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x90
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0xa0
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xb0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xc0
};

struct UMediaSoundComponent : USynthComponent {
	EMediaSoundChannels Channels; // 0x6f0
	bool DynamicRateAdjustment; // 0x6f4
	float RateAdjustmentFactor; // 0x6f8
	FFloatRange RateAdjustmentRange; // 0x6fc
	UMediaPlayer* MediaPlayer; // 0x710
};

struct ACamperPlayer : ADBDPlayer {
	FMulticastInlineDelegate OnHookedStateChanged; // 0x10d8
	FMulticastInlineDelegate OnGuidedStateChanged; // 0x10e8
	FMulticastInlineDelegate OnPickedUpDelegate; // 0x10f8
	FMulticastInlineDelegate OnPickedUpEndDelegate; // 0x1108
	FMulticastInlineDelegate OnHPSlotChanged; // 0x1118
	FMulticastInlineDelegate OnImmobilizeStateChanged; // 0x1168
	FMulticastInlineDelegate OnHookEscapeFailedCosmetic; // 0x11a8
	float InputMashCount; // 0x11b8
	float InputMashDecayTime; // 0x11bc
	FName ReverseBearTrapAttachSocket; // 0x11c0
	bool isBeingDissolved; // 0x11cc
	float FootprintAudibleRange; // 0x11d0
	UStalkedComponent* StalkedComponent; // 0x11d8
	float CameraResetToleranceYaw; // 0x11e0
	float CameraResetTolerancePitch; // 0x11e4
	float CameraRecenterOffsetYaw; // 0x11e8
	float CameraRecenterOffsetPitch; // 0x11ec
	EGender Gender; // 0x11f0
	UCurveFloat* DropStaggerDuration; // 0x11f8
	UCurveFloat* DropStaggerMaxSpeed; // 0x1200
	float TimeforDeathWhileCrawling; // 0x1208
	float TimeforDeathWhileHooked; // 0x120c
	float SecondsUntilFootprintTrigger; // 0x1210
	bool TriggerAfflictionHUDIntro; // 0x1214
	UCamperStillnessTrackerComponent* _stillnessTracker; // 0x12b0
	float PartiallyHiddenStillnessThreshold; // 0x12b8
	AActor* _escape; // 0x12c0
	AActor* _overlappingEscape; // 0x12c8
	USpherePlayerOverlapComponent* ProximityZone; // 0x12d0
	FDBDTimer _dropStaggerTimer; // 0x12f0
	UCapsuleComponent* SlashableZone; // 0x1318
	UCapsuleComponent* HookSlashableZone; // 0x1320
	UCamperSlashableComponent* _camperSlashable; // 0x1328
	UTerrorRadiusReceiverComponent* _terrorRadiusReceiverComponent; // 0x1330
	float CrouchCapsuleHalfHeight; // 0x1338
	float IKOffsetRightFoot; // 0x133c
	float IKOffsetLeftFoot; // 0x1340
	UDBDPawnSensingComponent* _camperSensor; // 0x1350
	USurviveTimerScoreEventComponent* _surviveTimerScoreComponent; // 0x1358
	TArray<ADBDPlayer*> _foundCampers; // 0x1378
	TArray<ADBDPlayer*> _potentialSaviors; // 0x1388
	UCamperHealthComponent* _healthComponent; // 0x13a0
	UChargeableComponent* _hpSlot01; // 0x13a8
	UChargeableComponent* _hpSlot02; // 0x13b0
	UChargeableComponent* _mendChargeable; // 0x13b8
	UBloodTrailSettings* _bloodTrailSettings; // 0x13c0
	UCamperBloodTrailComponent* _bloodTrailComponent; // 0x13c8
	UKillerInstinctComponent* _killerInstinctComponent; // 0x13d0
	UCameraAttachmentComponent* _cameraAttachment; // 0x13d8
	UCharmSpawnerComponent* _charmSpawnerComponent; // 0x13e0
	UHookableComponent* _hookableComponent; // 0x13e8
	UProtectionHitComponent* _protectionHitComponent; // 0x13f0
	UScreamComponent* _screamComponent; // 0x13f8
	UCharacterPositionRecorderComponent* _positionRecorder; // 0x1400
	bool _runInputPressed; // 0x14bc
	bool _trapIndicatorActive; // 0x14e0
	TWeakObjectPtr<ACamperPlayer> _revealedSurvivor; // 0x14e4
	UCamperEndGameComponent* _camperEndGameComponent; // 0x14f0
	UAkComponent* _noOcclusionAkComponent; // 0x14f8
	bool _isHealingKOCamper; // 0x1524
	bool _isSkillCheckFailed; // 0x1525
	bool _isBeingSacrificed; // 0x1526
	bool _isWiggleProgressionAllowed; // 0x1527
	UMoveComponentToComponent* _meshMover; // 0x15c8
	USurvivorHitSprintEffect* _sprintEffect; // 0x15d0
};

struct AOfferingSequenceManager : AActor {
	UDBDGameInstance* _gameInstance; // 0x230
	APlayerController* _localPlayerController; // 0x238
	UOfferingHandler* _offeringHandler; // 0x240
	AOfferingSequenceAssets* _sequenceAssets; // 0x248
	ADBDLobbyHud* _hud; // 0x250
	ACameraActor* _offeringCamera; // 0x258
};

struct UFSM_OrCondition : UFSM_Condition {
	TArray<UFSM_Condition*> _conditions; // 0x38
};

struct UEditorMeshVisualization : USceneComponent {
	TSoftObjectPtr<USkeletalMesh> MeshVisualization; // 0x210
	FTransform RelativeTransform; // 0x240
};

struct UMaterialExpressionStaticComponentMaskParameter : UMaterialExpressionParameter {
	FExpressionInput Input; // 0x68
	char DefaultR : 1; // 0x84
	char DefaultG : 1; // 0x84
	char DefaultB : 1; // 0x84
	char DefaultA : 1; // 0x84
};

struct AShopCameraManager : AInfo {
	TArray<FCharacterCameraTag> CatalogCharactersCamera; // 0x230
	TArray<FCharacterCameraTag> StoryCharactersCamera; // 0x240
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x48
	float MaxAngleDiff; // 0x4c
	float MaxScaleDiff; // 0x50
};

struct UTimeSynchronizableMediaSource : UBaseMediaSource {
	bool bUseTimeSynchronization; // 0x98
	int32_t FrameDelay; // 0x9c
	double TimeDelay; // 0xa0
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x60
	EVerticalAlignment VerticalAlignment; // 0x61
};

struct UChildActorComponent : USceneComponent {
	AActor* ChildActorClass; // 0x210
	AActor* ChildActor; // 0x218
	AActor* ChildActorTemplate; // 0x220
	bool bAlwaysRecreateOnRegister; // 0x228
	AActor* ChildActorMimic; // 0x230
};

struct URepairGeneratorSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	FVector _snapPosition; // 0x538
	int32_t _side; // 0x544
	int32_t _repairAnimIndex; // 0x548
	bool _isRepairingGenerator; // 0x558
	bool _rightFootDown; // 0x559
	int32_t _animSequenceVariationCount; // 0x55c
	bool _isVomiting; // 0x560
	bool _hasSkillCheckFailed; // 0x561
};

struct UTileView : UListView {
	float EntryHeight; // 0x388
	float EntryWidth; // 0x38c
	EListItemAlignment TileAlignment; // 0x390
	bool bWrapHorizontalNavigation; // 0x391
};

struct UBTTask_ExtMoveDirecltyToward : UBTTask_MoveDirectlyToward {
	ECharacterMovementTypes MovementMode; // 0xc8
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x38
	TArray<FNode> Nodes; // 0x48
};

struct UMaterialExpressionDepthFade : UMaterialExpression {
	FExpressionInput InOpacity; // 0x48
	FExpressionInput FadeDistance; // 0x64
	float OpacityDefault; // 0x80
	float FadeDistanceDefault; // 0x84
};

struct UMapActorDetectorComponent : UActorComponent {
	FMulticastInlineDelegate OnActorDetected; // 0xb8
	TArray<EMapActorCategory> CollectedCategories; // 0xc8
	UPrimitiveComponent* _primitive; // 0xd8
};

struct UBaseLockerInteraction : UInteractionDefinition {
	ALocker* _owningLocker; // 0x5b0
};

struct UDyingLight : UPerk {
	TArray<float> _actionSpeedPenaltyPerToken; // 0x3d0
	float _obsessionActionSpeedBonus; // 0x3e0
	FName _obsessionStatusEffectID; // 0x3e4
	FName _nonObsessionStatusEffectID; // 0x3f0
	TArray<UStatusEffect*> _survivorDebuffs; // 0x400
};

struct UMediaCapture : UObject {
	FMulticastInlineDelegate OnStateChanged; // 0x30
	UMediaOutput* MediaOutput; // 0x58
	UTextureRenderTarget2D* CapturingRenderTarget; // 0x80
};

struct UUMGBloodStoreItemPreviewWidget : UMobileBaseUserWidget {
	FText _itemName; // 0x330
	FText _itemDescription; // 0x348
	int32_t _itemPrice; // 0x360
	FText _refreshPrice; // 0x368
	FText _nodeStatusText; // 0x380
	FText _refreshTitle; // 0x398
	FText _itemSelectionTitle; // 0x3b0
	FText _itemSelectionText; // 0x3c8
	FText _purchaseTitle; // 0x3e0
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x30
	UPawnAction* ParentAction; // 0x38
	UPawnActionsComponent* OwnerComponent; // 0x40
	UObject* Instigator; // 0x48
	UBrainComponent* BrainComp; // 0x50
	char bAllowNewSameClassInstance : 1; // 0x88
	char bReplaceActiveSameClassInstance : 1; // 0x88
	char bShouldPauseMovement : 1; // 0x88
	char bAlwaysNotifyOnFinished : 1; // 0x88
};

struct UGunslingerCameraTargetingStrategy : UBaseCameraTargetingStrategy {
	FName _cameraSocketName; // 0x50
	FName _survivorHarpoonSocketName; // 0x5c
};

struct AK25Power : ACollectable {
	UChargeableComponent* _k25ChainStrikeInteractionChargeableComponent; // 0x4e8
	UChargeableComponent* _k25TeleportChargeableComponent; // 0x4f0
	TArray<FCustomKillerInstinctData> _customKillerInstinctDatas; // 0x4f8
	TArray<FName> _survivorStatusEffectID; // 0x508
	TArray<FName> _killerStatusEffectID; // 0x518
	UK25SurvivorChainAttachmentComponent* _survivorChainAttachmentComponentClass; // 0x528
	UK25SurvivorChainTargetterComponent* _survivorChainTargetterComponentClass; // 0x530
	AK25Gateway* _k25GatewayClass; // 0x538
	AK25ControlledProjectile* _controlledProjectileClass; // 0x540
	ALamentConfiguration* _lamentConfigurationClass; // 0x548
	AK25Husk* _k25HuskClass; // 0x550
	UK25KillerTeleportationPositionFinderComponent* _killerTeleportFinderComponentClass; // 0x558
	AK25AnimationFollowerActor* _chainAnimationActorClass; // 0x560
	TArray<UDataTable*> _chainAnimationMappingsTables; // 0x568
	AK25AnimationFollowerActor* _pillarAnimationActorClass; // 0x578
	UK25ProjectileLauncher* _k25ProjectileLauncher; // 0x580
	UAuthoritativeActorPoolComponent* _k25ProjectilePool; // 0x588
	UAuthoritativeActorPoolComponent* _k25ChainPool; // 0x590
	UPowerChargeComponent* _k25PowerChargeComponent; // 0x598
	UAuthoritativePoolProjectileProviderAdapter* _k25ProjectileProvider; // 0x5a0
	UK25PowerChargePresentationItemProgressComponent* _k25PowerPresentationItemProgressComponent; // 0x5a8
	AK25Gateway* _gateway; // 0x5b0
	AK25ControlledProjectile* _controlledProjectileInstance; // 0x5b8
	ALamentConfiguration* _lamentConfiguration; // 0x5c0
	AK25Husk* _k25Husk; // 0x5c8
	UK25ChainAttachmentReplicationComponent* _chainAttachmentReplicationComponent; // 0x5d0
	bool _isPowerCharged; // 0x620
};

struct UTwinHuskAnimInstance : UAnimInstance {
	bool _isDeadFromSurvivorBack; // 0x270
	APawn* _owningPawn; // 0x278
	UTwinHuskStateComponent* _twinHuskStateComponent; // 0x280
};

struct UKnivesLauncher : UKillerProjectileLauncher {
	FDBDTunableRowHandle _knifeSpawnOffset; // 0x180
	FDBDTunableRowHandle _knifeSpawnForwardOffset; // 0x1a8
	FDBDTunableRowHandle _launchSpeed; // 0x1d0
	FTunableStat _maxAmmoTunable; // 0x1f8
	bool _isInSuperModeThrow; // 0x280
};

struct UHellshireIronAddon : UItemAddon {
	float _undetectableDurationPostHarpoon; // 0x298
	UStatusEffect* _statusEffect; // 0x2a0
};

struct UCamperEndGameComponent : UActorComponent {
	AEndGameEntity* _endGameEntityClass; // 0x100
	float _delayBeforeSacrifice; // 0x10c
	bool _readyToBeSacrificed; // 0x110
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x2b8
	UBoxComponent* PreviewInfluenceBox; // 0x2c0
	UBoxComponent* PreviewCaptureBox; // 0x2c8
};

struct UAnimBlueprint : UBlueprint {
	USkeleton* TargetSkeleton; // 0xb0
	TArray<FAnimGroupInfo> Groups; // 0xb8
	bool bUseMultiThreadedAnimationUpdate; // 0xc8
	bool bWarnAboutBlueprintUsage; // 0xc9
};

struct UDatasmithSkyLightComponentTemplate : UDatasmithObjectTemplate {
	ESkyLightSourceType SourceType; // 0x38
	int32_t CubemapResolution; // 0x3c
	UTextureCube* Cubemap; // 0x40
};

struct UContextObserver : UUIComponent {
	EContextSection ObservedContextSection; // 0xb8
};

struct UGhostStealthComponent : UActorComponent {
	FMulticastInlineDelegate OnSuccessfulAttackInStealth; // 0xb8
	FMulticastInlineDelegate OnStealthStateChanged; // 0xc8
	FMulticastInlineDelegate OnIsStealthChanged; // 0xd8
	FMulticastInlineDelegate OnIsBeingSpotChanged; // 0xe8
	FMulticastInlineDelegate Local_OnStealthCancelledByPlayer; // 0xf8
	EGhostStealthState _stealthState; // 0x108
	UTimerObject* _cooldownTimer; // 0x148
	TMap<ACharacter*, TWeakObjectPtr<AScreenIndicatorWorldMarker>> _markers; // 0x150
	float _markerMaxAngleOffset; // 0x1b0
	bool _useKillerInstinctWhenSpotted; // 0x1b4
	UCharacterSightableComponent* _sightableComponent; // 0x1b8
	UStalkerComponent* _stalkerComponent; // 0x1c0
};

struct UUMGRichTextRewardItemDecorator : URichTextBlockDecorator {
	UDataTable* RewardSet; // 0x30
};

struct UUMGMonthlyPassRewardsPopup : UUMGGenericPopup {
	UTextBlock* SubscriptionLabel; // 0x3e8
	UTextBlock* TitleLabel; // 0x3f0
	UImage* SubscriptionIcon; // 0x3f8
	UTextBlock* RenewalDateLabel; // 0x400
	UHorizontalBox* RewardsContainer; // 0x408
	TSoftClassPtr<UObject> RewardWidgetClass; // 0x410
	FMargin _rewardsPadding; // 0x440
};

struct UArmDetectionFanComponent : UDetectionFanComponent {
	FName _shoulderBone; // 0x270
	FName _elbowBone; // 0x27c
	FName _handBone; // 0x288
	FName _indexBone; // 0x294
	FName _hipBone; // 0x2a0
};

struct UCoreTutorialPopupWidget : UCoreBaseHudWidget {
	UCoreInputSwitcherWidget* ProgressionInputSwitcher; // 0x2f8
	UAkAudioEvent* ClosePopupSfx; // 0x300
	FMulticastInlineDelegate _notifTutoConfirmButtonClickDelegate; // 0x308
};

struct UCDNPatchManager : UObject {
	FString InstallDirectory; // 0x30
	int32_t PakOrder; // 0x40
	FString PakMountPoint; // 0x48
	TWeakObjectPtr<UGameInstance> _gameInstance; // 0xa0
	UAtlantaPendingContent* _currentContentToInstall; // 0x198
	TArray<FString> _remainingManifestsToInstall; // 0x1a0
	TMap<FString, UAtlantaPendingContent*> _contentToInstall; // 0x1b0
	UAtlantaPendingContent* _MobilePendingContent; // 0x248
};

struct UInfectiousFright : UPerk {
	bool _revealPlayerInTerrorRadius; // 0x3d0
	char _perkActivationCount; // 0x3d1
	TArray<ACamperPlayer*> _revealedSurvivors; // 0x3d8
	ACamperPlayer* _targetSurvivor; // 0x3e8
};

struct UFSM_RefCondition : UFSM_Condition {
	UFSM_Condition* _refcondition; // 0x38
};

struct URuntimeVirtualTextureComponent : USceneComponent {
	URuntimeVirtualTexture* VirtualTexture; // 0x210
	bool bUseStreamingLowMipsInEditor; // 0x218
	AActor* BoundsSourceActor; // 0x220
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x70
	FSoftClassPath HotSpotManagerClassName; // 0x90
	float AcceptanceRadius; // 0xb0
	float PathfollowingRegularPathPointAcceptanceRadius; // 0xb4
	float PathfollowingNavLinkAcceptanceRadius; // 0xb8
	bool bFinishMoveOnGoalOverlap; // 0xbc
	bool bAcceptPartialPaths; // 0xbd
	bool bAllowStrafing; // 0xbe
	bool bEnableBTAITasks; // 0xbf
	bool bAllowControllersAsEQSQuerier; // 0xc0
	bool bEnableDebuggerPlugin; // 0xc1
	bool bForgetStaleActors; // 0xc2
	ECollisionChannel DefaultSightCollisionChannel; // 0xc3
	UBehaviorTreeManager* BehaviorTreeManager; // 0xc8
	UEnvQueryManager* EnvironmentQueryManager; // 0xd0
	UAIPerceptionSystem* PerceptionSystem; // 0xd8
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xe0
	UAIHotSpotManager* HotSpotManager; // 0xf0
	UNavLocalGridManager* NavLocalGrids; // 0xf8
};

struct URotatingMovementComponent : UMovementComponent {
	FRotator RotationRate; // 0xf8
	FVector PivotTranslation; // 0x104
	char bRotationInLocalSpace : 1; // 0x110
};

struct UMaterialExpressionMax : UMaterialExpression {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
	float ConstA; // 0x80
	float ConstB; // 0x84
};

struct UK25ChainStrike_IsPlayerPressingInputCondition : UFSM_Condition {
	EInputInteractionType _inputType; // 0x38
};

struct UCurveFloat : UCurveBase {
	FRichCurve FloatCurve; // 0x38
	bool bIsEventCurve; // 0xb8
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate COMPLETED; // 0x80
};

struct UMovieSceneBoolSection : UMovieSceneSection {
	bool defaultValue; // 0xe8
	FMovieSceneBoolChannel BoolCurve; // 0xf0
};

struct UEscapeDoorAnimInstance : USleepingAnimInstance {
	bool _isOpen; // 0x280
	bool _isOpenByKiller; // 0x281
};

struct ULightingFactory : UObject {
	ULightingData* _data; // 0x30
};

struct UParticleModuleCollision : UParticleModuleCollisionBase {
	FRawDistributionVector DampingFactor; // 0x38
	FRawDistributionVector DampingFactorRotation; // 0x80
	FRawDistributionFloat MaxCollisions; // 0xc8
	EParticleCollisionComplete CollisionCompletionOption; // 0xf8
	TArray<EObjectTypeQuery> CollisionTypes; // 0x100
	char bApplyPhysics : 1; // 0x118
	char bIgnoreTriggerVolumes : 1; // 0x118
	FRawDistributionFloat ParticleMass; // 0x120
	float DirScalar; // 0x150
	char bPawnsDoNotDecrementCount : 1; // 0x154
	char bOnlyVerticalNormalsDecrementCount : 1; // 0x154
	float VerticalFudgeFactor; // 0x158
	FRawDistributionFloat DelayAmount; // 0x160
	char bDropDetail : 1; // 0x190
	char bCollideOnlyIfVisible : 1; // 0x190
	char bIgnoreSourceActor : 1; // 0x190
	float MaxCollisionDistance; // 0x194
};

struct UMovieSceneColorSection : UMovieSceneSection {
	FMovieSceneFloatChannel RedCurve; // 0xe8
	FMovieSceneFloatChannel GreenCurve; // 0x188
	FMovieSceneFloatChannel BlueCurve; // 0x228
	FMovieSceneFloatChannel AlphaCurve; // 0x2c8
};

struct UAICharacterRepairGeneratorBehaviour : UAICharacterBehaviour {
	ADBDPlayer* _aiPlayer; // 0x68
	ADBDAIPlayerController* _aiPlayerController; // 0x70
	UInteractor* _targetInteractor; // 0x78
	UAICharacterRepairGeneratorBehaviourData* _characterRepairGeneratorData; // 0x80
};

struct UBTTask_SetTagCooldown : UBTTaskNode {
	FGameplayTag CooldownTag; // 0x78
	bool bAddToExistingDuration; // 0x84
	float CooldownDuration; // 0x88
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xf28
	float ServerFlushLogInterval; // 0xf2c
	UGameInstance* GameInstance; // 0xf30
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x238
};

struct UBTDecorator_Random : UBTDecorator_TickableBase {
	FAITunableParameter PercentageRatio; // 0x70
};

struct UForceFeedbackAttenuation : UObject {
	FForceFeedbackAttenuationSettings Attenuation; // 0x30
};

struct UUIController : UObject {
	UGFxObject* m_UIControllerObj; // 0x30
	UMobileBaseUserWidget* _atlantaLoadingWidget; // 0x38
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb8
	float TileRemovalRadius; // 0xbc
};

struct UDBDCullDistanceVolumeComponent : USceneComponent {
	TArray<FDBDCullDistanceSizePair> CullDistances; // 0x210
	FVector InfluenceBox; // 0x220
	bool Enabled; // 0x22c
	bool Unbound; // 0x22d
	UBoxComponent* _previewInfluenceBox; // 0x230
};

struct UFaceCorrectionSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isIdle; // 0x4f0
	bool _isFreddyMori; // 0x4f1
	bool _isInCloset; // 0x4f2
	bool _isEdgeCase; // 0x4f3
	bool _isInjured; // 0x4f4
	bool _isHealingOthers; // 0x4f5
	bool _isCrouched; // 0x4f6
};

struct UAddon_TheBlight_SoulChemical : UItemAddon {
	float _triggerDistance; // 0x298
	ESkillCheckCustomType _skillCheckType; // 0x29c
	FGameplayTagContainer _interactionSemantics; // 0x2a0
	FGameplayTagContainer _blightPowerStateTag; // 0x2c0
};

struct UIncreaseZombiesSpeedStatusEffect : UStatusEffect {
	float _zombieSpeedAdditive; // 0x350
};

struct USurvivorChainLinkableComponent : UChainLinkableComponent {
	FDBDTunableRowHandle _pullbackAngle; // 0x188
	FDBDTunableRowHandle _immobilizationDuration; // 0x1b8
	FGameplayTagContainer _linkableInteractionTags; // 0x1e0
	FGameplayTagContainer _cancelableInteractionTags; // 0x200
	USurvivorReelVelocityAdditiveStrategy* _velocityAdditiveStrategyClass; // 0x220
	FName _immobilizationEffectName; // 0x228
	FVector_NetQuantize10 _linkedMoveInput; // 0x238
	UStatusEffect* _immobilizationEffect; // 0x248
	USurvivorReelVelocityAdditiveStrategy* _velocityAdditiveStrategy; // 0x250
};

struct ABP_Menu_CamperMale13_C : ABP_Menu_Base_Camper_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x670
};

struct US28P01 : UPerk {
	float _auraRevealDuration[0x3]; // 0x3d0
	float _auraRevealRange[0x3]; // 0x3dc
	UChargeableComponent* _S28P01ChargeableComponent; // 0x3e8
	bool _isPerkActive; // 0x3f0
	bool _isInteractionOngoing; // 0x3f1
	ADBDPlayer* _playerOwner; // 0x3f8
};

struct UK22PowerChargePresentationItemProgressComponent : UPresentationItemProgressComponent {
	UPowerChargeComponent* _powerChargeComponent; // 0xb8
};

struct UMockDataMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x210
	bool ScanWorld; // 0x220
	bool RequestNormals; // 0x221
	bool RequestVertexConfidence; // 0x222
	EMeshTrackerVertexColorMode VertexColorMode; // 0x223
	TArray<FColor> BlockVertexColors; // 0x228
	FLinearColor VertexColorFromConfidenceZero; // 0x238
	FLinearColor VertexColorFromConfidenceOne; // 0x248
	float UpdateInterval; // 0x258
	UMRMeshComponent* MRMesh; // 0x260
};

struct UOpenSupplyCrateInteraction : UChargeableInteractionDefinition {
	ASupplyCrateInteractable* _owningSupplyCrate; // 0x6d8
	bool _interactionWasComplete; // 0x6e0
	UAnimSequence* _successExitTimeAnimSequenceReference; // 0x6e8
};

struct UActorSpawner : USceneComponent {
	EGameplayElementType Type; // 0x220
	TSoftClassPtr<UObject> Visualization; // 0x228
	bool ActivatedByDefault; // 0x258
	TArray<FActorSpawnerProperties> ActivatedSceneElement; // 0x260
	TArray<FActorSpawnerProperties> DeactivatedSceneElement; // 0x270
	float Weight; // 0x280
	int32_t SpawnCountMax; // 0x284
	int32_t SpawnPriorityTier; // 0x288
	FMulticastInlineDelegate OnAsyncActorSpawned; // 0x290
	bool WeightInfluenceable; // 0x2a8
	bool WeightInfluencer; // 0x2a9
	float Cost; // 0x2ac
	UObject* _toSpawn; // 0x2b0
	TWeakObjectPtr<AActor> _spawnedActorOnAuthority; // 0x2c0
};

struct UInteractionSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isAgainstSmallKiller; // 0x4f0
	bool _isInsideCloset; // 0x4f1
	bool _isEnteringCloset; // 0x4f2
	bool _isBeingCarried; // 0x4f3
	bool _isHooked; // 0x4f4
	bool _isSacrificeStruggling; // 0x4f5
	float _sacrificeStrugglePercent; // 0x4f8
	bool _selfUnhookFailed; // 0x4fc
	EInteractionAnimation _interactionAnimation; // 0x4fd
	FVector _snapPosition; // 0x500
	bool _isInteractingWithEscapeDoor; // 0x50c
};

struct UActivateByBlinkAttackTimedEffect : UStatusEffect {
	float _activationDuration; // 0x350
};

struct UActorVariationSpawner : USceneComponent {
	TSoftClassPtr<UObject> Visualization; // 0x210
	TArray<FActorVariationElements> Variations; // 0x240
	UObject* _toSpawn; // 0x258
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x48
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x38
};

struct UChaosGameplayEventDispatcher : UChaosEventListenerComponent {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1d0
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x220
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
	UCameraShake* ShakeClass; // 0x108
	float PlayScale; // 0x110
	ECameraAnimPlaySpace PlaySpace; // 0x114
	FRotator UserDefinedPlaySpace; // 0x118
};

struct UParticleSystemDistanceFaderComponent : UActorComponent {
	UParticleSystemComponent* ParticleSystemComponent; // 0xb8
	FName OpacityParameterName; // 0xc0
	float StartFadeDistance; // 0xcc
	float EndFadeDistance; // 0xd0
};

struct UHinderOnCrowAttachStatusEffect : UBaseLingeringStatusEffect {
	FGameplayTag _onCrowAttachStateTag; // 0x358
	FTunableStat _hinderOnIdleLingerTime; // 0x368
};

struct UTwinLockerBlockerComponent : UActorComponent {
	TArray<UInteractionDefinition*> _interactionClasses; // 0xb8
	TArray<UInteractionDefinition*> _interactionsToDisableOnLockerClasses; // 0xd8
};

struct UDatasmithDeltaGenSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x50
	bool bOptimizeDuplicatedNodes; // 0x51
	bool bRemoveInvisibleNodes; // 0x52
	bool bSimplifyNodeHierarchy; // 0x53
	bool bImportVar; // 0x54
	FString VarPath; // 0x58
	bool bImportPos; // 0x68
	FString PosPath; // 0x70
	bool bImportTml; // 0x80
	FString TmlPath; // 0x88
};

struct UAISkill_InteractionTarget_ShockTherapy : UAISkill_InteractionTarget {
	float TargetToEvadePointMaxDistance; // 0x220
	float CastShockTimeBuffer; // 0x224
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xc0
	UModel* Model; // 0xc8
	TArray<UModelComponent*> ModelComponents; // 0xd0
	ULevelActorContainer* ActorCluster; // 0xe0
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe8
	int32_t NumTextureStreamingDirtyResources; // 0xec
	ALevelScriptActor* LevelScriptActor; // 0xf0
	ANavigationObjectBase* NavListStart; // 0xf8
	ANavigationObjectBase* NavListEnd; // 0x100
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x108
	float LightmapTotalSize; // 0x118
	float ShadowmapTotalSize; // 0x11c
	TArray<FVector> StaticNavigableGeometry; // 0x120
	TArray<FGuid> StreamingTextureGuids; // 0x130
	FGuid LevelBuildDataId; // 0x1d8
	UMapBuildDataRegistry* MapBuildData; // 0x1e8
	FIntVector LightBuildLevelOffset; // 0x1f0
	char bIsLightingScenario : 1; // 0x1fc
	char bTextureStreamingRotationChanged : 1; // 0x1fc
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1fc
	char bIsVisible : 1; // 0x1fc
	AWorldSettings* WorldSettings; // 0x248
	TArray<UAssetUserData*> AssetUserData; // 0x258
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x278
};

struct UCompressedImageSequenceProtocol : UImageSequenceProtocol {
	int32_t CompressionQuality; // 0xe0
};

struct UGizmoWorldAxisSource : UObject {
	FVector Origin; // 0x38
	int32_t AxisIndex; // 0x44
};

struct ATimerGateDecrease : AActor {
	ATimerGate* TimerGate; // 0x230
};

struct UGraphNodeContextMenuContext : UObject {
	UBlueprint* Blueprint; // 0x30
	UEdGraph* Graph; // 0x38
	UEdGraphNode* Node; // 0x40
	bool bIsDebugging; // 0x50
};

struct UBloodOrbAbsorberComponent : UActorComponent {
	FMulticastInlineDelegate Authority_OnBloodOrbAbsorbed; // 0xb8
	FMulticastInlineDelegate OnIsAbsorbingChanged; // 0xc8
	FVector AbsorbLocationOffset; // 0xd8
	TArray<UBloodOrbDropperComponent*> _camperBloodOrbDropperComponents; // 0x100
};

struct USurveillancePerk : UPerk {
	float generatorRegressionStopRevealTime; // 0x3d0
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x30
	float ResetFloat; // 0x38
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x30
};

struct UBTTaskNode : UBTNode {
	TArray<UBTService*> Services; // 0x60
	char bIgnoreRestartSelf : 1; // 0x70
};

struct UEnvQueryTest_LineOfSight : UEnvQueryTest {
	UEnvQueryContext* QuerierContext; // 0x238
	UEnvQueryContext* ToContext; // 0x240
	FAIDataProviderFloatValue ItemHeightOffset; // 0x248
	FAIDataProviderBoolValue Invert; // 0x288
};

struct USabotageSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isSabotaging; // 0x530
	bool _hasSkillCheckFailed; // 0x531
};

struct UDemogorgonPounceInteraction : UChargeableInteractionDefinition {
	UChargedAttackStateComponent* _chargedAttackState; // 0x748
	ASlasherPlayer* _owningSlasher; // 0x750
};

struct UAB_Menu_Slasher25_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x300
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x328
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x350
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3a0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x418
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x450
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x500
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x578
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x638
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x6b0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x6e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x798
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x810
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x888
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x928
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x9c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xa00
	bool Role Selected; // 0xab0
	bool Is Online; // 0xab1
	bool _interrupt02; // 0xab2
	ABP_Menu_Slasher25_C* KillerBP; // 0xab8
	int32_t RandomInterupt; // 0xac0
	bool _IsLegendary; // 0xac4
	bool CancelInterrupt; // 0xac5
};

struct UThrowInteraction : UChargeableInteractionDefinition {
	UCurveFloat* _throwCancelledSpeedCurve; // 0x6d8
	float _throwCancellationExitTime; // 0x6e0
};

struct URangeToActorsTrackerComponent : UActorComponent {
	TArray<URangeToActorsTrackerStrategy*> _rangeTrackers; // 0xb8
};

struct UAB_K26_SW00_C : UK26CrowProjectileAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	FAnimNode_Root AnimGraphNode_Root; // 0x2b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x2f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x318
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x340
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x368
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x390
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x408
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x430
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x458
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x480
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x4a8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x520
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x558
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x608
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x680
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x6b8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x768
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x7e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x818
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x890
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x978
	bool NewVar_1; // 0x9c8
};

struct UImgMediaSettings : UObject {
	FFrameRate DefaultFrameRate; // 0x30
	float CacheBehindPercentage; // 0x38
	float CacheSizeGB; // 0x3c
	int32_t CacheThreads; // 0x40
	int32_t CacheThreadStackSizeKB; // 0x44
	float GlobalCacheSizeGB; // 0x48
	bool UseGlobalCache; // 0x4c
	uint32_t ExrDecoderThreads; // 0x50
	FString DefaultProxy; // 0x58
	bool UseDefaultProxy; // 0x68
};

struct UMaterialExpressionFunctionInput : UMaterialExpression {
	FExpressionInput Preview; // 0x48
	FName InputName; // 0x64
	FString Description; // 0x70
	FGuid ID; // 0x80
	EFunctionInputType inputType; // 0x90
	FVector4 PreviewValue; // 0xa0
	char bUsePreviewValueAsDefault : 1; // 0xb0
	int32_t SortPriority; // 0xb4
	char bCompilingFunctionPreview : 1; // 0xb8
};

struct UTextRenderComponent : UPrimitiveComponent {
	FText Text; // 0x428
	UMaterialInterface* TextMaterial; // 0x440
	UFont* Font; // 0x448
	EHorizTextAligment HorizontalAlignment; // 0x450
	EVerticalTextAligment VerticalAlignment; // 0x451
	FColor TextRenderColor; // 0x454
	float XScale; // 0x458
	float YScale; // 0x45c
	float WorldSize; // 0x460
	float InvDefaultSize; // 0x464
	float HorizSpacingAdjust; // 0x468
	float VertSpacingAdjust; // 0x46c
	char bAlwaysRenderAsText : 1; // 0x470
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x148
	UDataTable* TextStyleSet; // 0x160
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x168
	bool bOverrideDefaultStyle; // 0x178
	FTextBlockStyle DefaultTextStyleOverride; // 0x180
	float MinDesiredWidth; // 0x408
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x698
};

struct UMagicFountainOutlineUpdateStrategy : UOutlineUpdateStrategy {
	FLinearColor _outlineColor; // 0xc0
};

struct UUMGStreamVideoWidget : UMobileBaseUserWidget {
	UImage* VideoImage; // 0x300
	UButton* TapButton; // 0x308
	UUMGBaseButtonWidget* SkipButton; // 0x310
	float _timerShowSkipButton; // 0x328
};

struct USphereReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadius; // 0x2b8
	float CaptureDistanceScale; // 0x2bc
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x2c0
};

struct UBTDecorator_IsCamperState : UBTDecorator_TickableBase {
	FBlackboardKeySelector BBCamper; // 0x70
	ECamperDamageState damageState; // 0xa0
	EArithmeticKeyOperation DamageOp; // 0xa1
	ECamperImmobilizeState ImmobilizeState; // 0xa2
	EArithmeticKeyOperation ImmobilizeOp; // 0xa3
	EIsCamperStateOnFilter OnFilter; // 0xa4
	EArithmeticKeyOperation OnOthersFilterOp; // 0xa5
	int32_t NbOnOthersCampers; // 0xa8
};

struct UAB_S28_Book_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x300
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x378
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x3b0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x400
	EItemHandPosition Hand Position; // 0x4b0
	bool MenuInterrupt; // 0x4b1
};

struct UInteractiveGizmo : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x38
};

struct UBTDecorator_TagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x70
	float CooldownDuration; // 0x7c
	bool bAddToExistingDuration; // 0x80
	bool bActivatesCooldown; // 0x81
};

struct UGeneratorRepairInteraction : UChargeableInteractionDefinition {
	FDBDTunableRowHandle _penaltyPerRepairPlayerCount[0x3]; // 0x6d8
};

struct UInputMasher : UActorComponent {
	UInputComponent* _inputComponent; // 0xb8
};

struct UDBDCharacterMovementComponent : UCharacterMovementComponent {
	float ProjectedWallSlidingFactor; // 0x630
	float RandomInputFrontMultiplier; // 0x634
	float RandomInputSideMultiplier; // 0x638
	float RandomInputBackMultiplier; // 0x63c
	bool _forceUseDropStaggerFix; // 0x6d0
	UBaseCharacterVelocityAdditiveStrategy* _velocityAdditiveStrategy; // 0x890
	UBaseInputAccelerationConstraintStrategy* _inputAccelerationConstraintStrategy; // 0x898
	UBaseCharacterRotationStrategy* _rotationStrategy; // 0x8a0
	AActor* _lookAtTarget; // 0x8a8
};

struct UZombieBlindableComponent : UBlindableBaseComponent {
	UGameplayTagContainerComponent* _ownerObjectState; // 0x240
};

struct UBP_Audio_KLR_11_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UAutomaticLeanComponent : UActorComponent {
	FMulticastInlineDelegate OnLeanStateChanged; // 0xb8
	FMulticastInlineDelegate OnCanInitiateLeanChanged; // 0xc8
	FSocketOrBoneCache _cameraIdleLocation; // 0xd8
	FSocketOrBoneCache _cameraLeftLeanLocation; // 0x138
	FSocketOrBoneCache _cameraRightLeanLocation; // 0x198
	FSocketOrBoneCache _cameraCrouchLocation; // 0x1f8
	FSocketOrBoneCache _cameraCrouchLeftLeanLocation; // 0x258
	FSocketOrBoneCache _cameraCrouchRightLeanLocation; // 0x2b8
	float _middleSphereTraceLength; // 0x318
	float _sideSphereTraceLength; // 0x31c
	float _sphereTraceRadius; // 0x320
	float _standingTraceHeightOffset; // 0x324
	float _crouchingTraceHeightOffset; // 0x328
	float _sideTraceOffset; // 0x32c
	float _maxCameraDistance; // 0x330
	float _maxCameraAngle; // 0x334
	bool _debugMode; // 0x338
	ELeanState _leanState; // 0x339
};

struct UAddon_K22Power_20 : UOnEventBaseAddon {
	float _undetectableDuration; // 0x2a8
};

struct UDBDEasyAntiCheat : UObject {
	UDBDGameInstance* _gameInstance; // 0x48
	bool _connectedToServer; // 0x50
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x100
	float MaxDistance; // 0x104
	float TotalSamples; // 0x108
	float Priority; // 0x10c
	USoundAttenuation* AttenuationSettings; // 0x110
	FSoundModulation Modulation; // 0x118
	USoundSubmixBase* SoundSubmixObject; // 0x128
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x130
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x140
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x148
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x158
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb8
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xc0
};

struct USceneCaptureComponent : USceneComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x210
	ESceneCaptureSource CaptureSource; // 0x211
	char bCaptureEveryFrame : 1; // 0x212
	char bCaptureOnMovement : 1; // 0x212
	bool bAlwaysPersistRenderingState; // 0x213
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x218
	TArray<AActor*> HiddenActors; // 0x228
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x238
	TArray<AActor*> ShowOnlyActors; // 0x248
	float LODDistanceFactor; // 0x258
	float MaxViewDistanceOverride; // 0x25c
	int32_t CaptureSortPriority; // 0x260
	bool bUseRayTracingIfEnabled; // 0x264
	bool bIgnoreCullDistanceVolumes; // 0x265
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x268
	FString ProfilingEventName; // 0x288
};

struct ALandscapeMeshProxyActor : AActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x230
};

struct URemeshProperties : UMeshConstraintProperties {
	float SmoothingStrength; // 0x60
	bool bFlips; // 0x64
	bool bSplits; // 0x65
	bool bCollapses; // 0x66
};

struct UTestMovieSceneSubTrack : UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x70
};

struct UAddPrimitiveTool : USingleClickTool {
	UProceduralShapeToolProperties* ShapeSettings; // 0x98
	UNewMeshMaterialProperties* MaterialProperties; // 0xa0
	UPreviewMesh* PreviewMesh; // 0xa8
	ULastActorInfo* LastGenerated; // 0xb0
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x58
	FVector MinInput; // 0x64
	FVector MaxInput; // 0x70
	FVector MinOutput; // 0x7c
	FVector MaxOutput; // 0x88
	DistributionParamMode ParamModes[0x3]; // 0x94
};

struct ABP_Menu_Slasher06_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_06_C* BP_Audio_KLR_06; // 0x698
	UDBDPlayerPositionOffsetComponent* DBDPlayerPositionOffset; // 0x6a0
};

struct ULookAtTargetKillerSubAnimInstance : UBaseKillerAnimInstance {
	float _maxDistanceForTargetDetection; // 0x4f8
	FName _headSocket; // 0x4fc
	FName _rootSocket; // 0x508
	float _preferredMinLookAtTime; // 0x514
	float _distanceScoreFactor; // 0x518
	float _angleScoreFactor; // 0x51c
	float _sameTargetScoreFactor; // 0x520
	float _yawToTarget; // 0x524
	float _pitchToTarget; // 0x528
	bool _hasVisibleTarget; // 0x52c
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x68
	FBoxSphereBounds ImportedBounds; // 0x70
	FBoxSphereBounds ExtendedBounds; // 0x8c
	FVector PositiveBoundsExtension; // 0xa8
	FVector NegativeBoundsExtension; // 0xb4
	TArray<FSkeletalMaterial> Materials; // 0xc0
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xd0
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xe0
	FPerPlatformInt MinLOD; // 0x140
	FPerPlatformBool DisableBelowMinLodStripping; // 0x144
	EAxis SkelMirrorAxis; // 0x145
	EAxis SkelMirrorFlipAxis; // 0x146
	char bUseFullPrecisionUVs : 1; // 0x147
	char bUseHighPrecisionTangentBasis : 1; // 0x147
	char bHasBeenSimplified : 1; // 0x147
	char bHasVertexColors : 1; // 0x147
	char bEnablePerPolyCollision : 1; // 0x147
	UBodySetup* BodySetup; // 0x148
	UPhysicsAsset* PhysicsAsset; // 0x150
	UPhysicsAsset* ShadowPhysicsAsset; // 0x158
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x160
	TArray<UMorphTarget*> MorphTargets; // 0x170
	UAnimInstance* PostProcessAnimBlueprint; // 0x2f8
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x300
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x310
	TArray<UAssetUserData*> AssetUserData; // 0x340
	TArray<USkeletalMeshSocket*> Sockets; // 0x358
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x378
};

struct UActorDependency : UActorComponent {
	TArray<FDependency> Dependencies; // 0xb8
};

struct UGeneratorDreamworldComponent : UActorComponent {
	TArray<FName> _beamSocketsForBloodEffect; // 0xc0
};

struct UCoreInputPromptWidget : UCoreBaseUserWidget {
	FText _unfoundInputKeyText; // 0x2d8
	FKey _inputKey; // 0x2f0
	bool _isEnabled; // 0x310
};

struct UAREnvironmentCaptureProbeTexture : UTextureCube {
	EARTextureType TextureType; // 0x118
	float Timestamp; // 0x11c
	FGuid ExternalTextureGuid; // 0x120
	FVector2D Size; // 0x130
};

struct UDecalMaskedMaterialsList : UDataAsset {
	UStaticMesh* decalPlaneStaticMesh; // 0x38
	float decalPlaneExtent; // 0x40
	TMap<FName, UMaterialInterface*> decalMaskedMaterials; // 0x48
};

struct UMultiTransformer : UObject {
	UTransformGizmo* TransformGizmo; // 0xe0
	UTransformProxy* TransformProxy; // 0xe8
};

struct UAtlantaNavigationScreen : UScreenBase {
	UUMGAtlantaNavigationScreen* _umgScreen; // 0x120
};

struct ABP_Logo_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UMaterialHelper* MaterialHelper; // 0x238
	UStaticMeshComponent* Cube; // 0x240
	USceneComponent* DefaultSceneRoot; // 0x248
	float Timeline_0_Fade_E88DB81340E64A2D6C8133B1212395F5; // 0x250
	float Timeline_0_Timing_E88DB81340E64A2D6C8133B1212395F5; // 0x254
	ETimelineDirection Timeline_0__Direction_E88DB81340E64A2D6C8133B1212395F5; // 0x258
	UTimelineComponent* Timeline_1; // 0x260
	float Anim_Fade_89F4B59C42CBB8068E84979C128BB364; // 0x268
	float Anim_Timing_89F4B59C42CBB8068E84979C128BB364; // 0x26c
	ETimelineDirection Anim__Direction_89F4B59C42CBB8068E84979C128BB364; // 0x270
	UTimelineComponent* Anim; // 0x278
};

struct UDreamSnareTrapPlacementValidationStrategy : UDefaultObjectPlacementValidationStrategy {
	float NumberOfGroundTest; // 0xe0
	float TrapRadius; // 0xe4
	float MaxElevationDifferentialOnTrapEdge; // 0xe8
};

struct UTargetTriggeredEventRecentlyQEEvaluator : UQuestEventEvaluatorBase {
	FGameplayTag _gameEvent; // 0xe4
};

struct UMoviePlayerSettings : UObject {
	bool bWaitForMoviesToComplete; // 0x30
	bool bMoviesAreSkippable; // 0x31
	TArray<FString> StartupMovies; // 0x38
};

struct UOvercharge : UPerk {
	float _skillCheckFailurePenalty[0x3]; // 0x3d0
};

struct UBP_Audio_KLR_19_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UMovieSceneNiagaraParameterTrack : UMovieSceneNiagaraTrack {
	FNiagaraVariable Parameter; // 0x70
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x860
	float CheckpointSaveMaxMSPerFrame; // 0xc74
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xca8
	bool bIsLocalReplay; // 0xd08
	TArray<APlayerController*> SpectatorControllers; // 0xd10
};

struct UMaterialExpressionConstant2Vector : UMaterialExpression {
	float R; // 0x48
	float G; // 0x4c
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x128
};

struct UBP_Audio_KLR_14_C : UBP_Audio_KLR_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf0
};

struct UOverlayMenuScreenUMG : UOverlayMenuScreen {
	UUMGAtlantaSettingScreen* _atlOverlayMenuScreen; // 0x300
};

struct ALevelTransition_LightsEffects_C : ALevelScriptActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	float Fade_Out_Intensity_Multiplier__23A1AA444F5E07D5215601B3AED70035; // 0x240
	ETimelineDirection Fade_Out__Direction_23A1AA444F5E07D5215601B3AED70035; // 0x244
	UTimelineComponent* Fade Out; // 0x248
	TArray<float> Fog Densities; // 0x250
};

struct UMovieSceneCinematicShotSection : UMovieSceneSubSection {
	FString ShotDisplayName; // 0x160
	FText DisplayName; // 0x170
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x30
	bool bDontCreateShape; // 0x38
	bool bAutoAdjustCollisionSize; // 0x39
	FVector Offset; // 0x3c
	float ShapeRadius; // 0x48
	float ShapeWidth; // 0x4c
	float Mass; // 0x50
	float DampingRate; // 0x54
	float SteerAngle; // 0x58
	bool bAffectedByHandbrake; // 0x5c
	UTireType* TireType; // 0x60
	UTireConfig* TireConfig; // 0x68
	float LatStiffMaxLoad; // 0x70
	float LatStiffValue; // 0x74
	float LongStiffValue; // 0x78
	float SuspensionForceOffset; // 0x7c
	float SuspensionMaxRaise; // 0x80
	float SuspensionMaxDrop; // 0x84
	float SuspensionNaturalFrequency; // 0x88
	float SuspensionDampingRatio; // 0x8c
	EWheelSweepType SweepType; // 0x90
	float MaxBrakeTorque; // 0x94
	float MaxHandBrakeTorque; // 0x98
	UWheeledVehicleMovementComponent* VehicleSim; // 0xa0
	int32_t WheelIndex; // 0xa8
	float DebugLongSlip; // 0xac
	float DebugLatSlip; // 0xb0
	float DebugNormalizedTireLoad; // 0xb4
	float DebugWheelTorque; // 0xbc
	float DebugLongForce; // 0xc0
	float DebugLatForce; // 0xc4
	FVector Location; // 0xc8
	FVector OldLocation; // 0xd4
	FVector Velocity; // 0xe0
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x48
	char bOverride_Period : 1; // 0x48
	float Period; // 0x4c
};

struct UPreviewMeshCollection : UDataAsset {
	USkeleton* Skeleton; // 0x40
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x48
};

struct UCoreExampleWidget : UCoreBaseHudWidget {
	FString EditAnywhere; // 0x2f8
	FString EditDefaultsOnly; // 0x308
	FString EditInstanceOnly; // 0x318
	FString EditNoBlueprint; // 0x328
	FString EditDefaultsOnlyBlueprintReadOnly; // 0x338
	FString VisibleAnywhere; // 0x348
	FString VisibleDefaultsOnly; // 0x358
	FString VisibleInstanceOnly; // 0x368
	FMulticastInlineDelegate ExampleButtonClickDelegate; // 0x378
};

struct UChaseComponent : UActorComponent {
	FMulticastInlineDelegate OnChaseStarted; // 0xb8
	FMulticastInlineDelegate OnChaseEnded; // 0xc8
	FMulticastInlineDelegate OnAllChaseEnded; // 0xd8
	FMulticastInlineDelegate OnIsInChaseChanged; // 0xe8
	FTagStateBool _isInChase; // 0xf8
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x38
	ELocationEmitterSelectionMethod SelectionMethod; // 0x44
	char InheritSourceVelocity : 1; // 0x48
	float InheritSourceVelocityScale; // 0x4c
	char bInheritSourceRotation : 1; // 0x50
	float InheritSourceRotationScale; // 0x54
};

struct ADBDPlayerState : APlayerState {
	FMulticastInlineDelegate OnAIFinishedPlayingEvent; // 0x340
	FString MirrorsId; // 0x350
	FString ContentVersion; // 0x360
	EAIDifficultyLevel _difficultyLevel; // 0x370
	bool IsPlayerReady; // 0x371
	EPlayerRole GameRole; // 0x372
	URitualHandlerComponent* RitualHandler; // 0x378
	UDedicatedServerHandlerComponent* DedicatedServerHandler; // 0x380
	FCharacterStateData CamperData; // 0x388
	FCharacterStateData SlasherData; // 0x3a8
	FPlayerStateData PlayerData; // 0x3c8
	FEquippedPlayerCustomization PlayerCustomization; // 0x400
	FMulticastInlineDelegate OnPlayerGameplayEvent; // 0x428
	FMulticastInlineDelegate OnGameStateChanged; // 0x438
	FMulticastInlineDelegate OnPlayergameStateChanged; // 0x448
	TMap<FName, FAwardedScores> _awardedScoresByType; // 0x470
	FUserGameStats _cachedUserGameStats; // 0x4c0
	TArray<FOngoingScoreData> _ongoingScoreEvents; // 0x570
	FDBDRecentGameplayEvents _recentGameplayEvents; // 0x588
	bool _inParadise; // 0x5d9
	UGameplayNotificationManager* _gameplayNotificationManager; // 0x5e0
	UAchievementHandlerComponent* _achievementHandler; // 0x5e8
	UCharacterStatsHandlerComponent* _characterStatsHandler; // 0x5f0
	FString _platformAccountId; // 0x618
	int32_t _selectedCamperIndex; // 0x628
	int32_t _selectedSlasherIndex; // 0x62c
	EPlatformFlag _platform; // 0x72c
	EProviderFlag _provider; // 0x730
	bool _crossplayAllowed; // 0x734
	bool _offNetworkFlag; // 0x735
	bool _gameLevelLoaded; // 0x736
	bool _showPortraitBorder; // 0x768
	bool _hasActiveSubscription; // 0x76a
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x78
	bool bSetPivotMode; // 0x79
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UBTService_StateMonitor_Slasher : UBTService_StateMonitor {
	FBlackboardKeySelector BBIsCarrying; // 0xd8
};

struct USimpleSpawnEffectsOnAllSurvivorsAddon : USpawnEffectsOnAllSurvivorsBaseAddon {
	TArray<FSimpleSpawnEffectsOnAllSurvivorsAddonParams> _statusEffectsSpawnParams; // 0x2a8
};

struct AAkAmbientSound : AActor {
	UAkAudioEvent* AkAudioEvent; // 0x230
	UAkComponent* AkComponent; // 0x238
	bool StopWhenOwnerIsDestroyed; // 0x240
	bool AutoPost; // 0x241
};

struct UAsyncTask_LoadXRDeviceVisComponent : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnModelLoaded; // 0x38
	FMulticastInlineDelegate OnLoadFailure; // 0x48
	UPrimitiveComponent* SpawnedComponent; // 0x60
};

struct UMaterialExpressionBHVRCustomColorOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x48
};

struct UIridescentBrickAddon : UOnEventBaseAddon {
	UStatusEffect* _undetectableStatusEffect; // 0x2d0
};

struct UCannibalChainsawAttackObstructSubstate : UHillbillyChainsawAttackObstructSubstate {
	FTagStateBool _isInTantrum; // 0x128
};

struct UInAppPurchaseCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieSceneFolder : UObject {
	FName FolderName; // 0x30
	TArray<UMovieSceneFolder*> ChildFolders; // 0x40
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x50
	TArray<FString> ChildObjectBindingStrings; // 0x60
};

struct UGearhead : UPerk {
	float _perkActivationDuration[0x3]; // 0x3d0
	ESkillCheckType _skillCheckType; // 0x3dc
	bool _basicAttack; // 0x3dd
};

struct UGizmoArrowComponent : UGizmoBaseComponent {
	FVector Direction; // 0x448
	float Gap; // 0x454
	float Length; // 0x458
	float Thickness; // 0x45c
};

struct UChatroom : UObject {
	FString CurrentChatRoomId; // 0x30
	int32_t MaxChatRoomRetries; // 0x40
	int32_t NumChatRoomRetries; // 0x44
};

struct USculptMaxBrushProperties : UInteractiveToolPropertySet {
	float MaxHeight; // 0x58
	bool bFreezeCurrentHeight; // 0x5c
};

struct ANavLinkProxy_DirectMove : ANavLinkProxy_Base {
	TArray<FVector> CustomPathPoints; // 0x2f0
	float MoveToPathPointTimeLimit; // 0x300
	TMap<ADBDPlayer*, UNavMovePath*> _playersOnPath; // 0x308
};

struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	TSet<int32_t> OutputShaderStages; // 0x38
	TSet<int32_t> IterationShaderStages; // 0x88
};

struct UARPlaneGeometry : UARTrackedGeometry {
	EARPlaneOrientation Orientation; // 0xf0
	FVector Center; // 0xf4
	FVector Extent; // 0x100
	UARPlaneGeometry* SubsumedBy; // 0x120
};

struct AWakerObject : AInteractable {
	UCamperDreamworldComponent* _linkedCamperDreamworldComponent; // 0x330
	bool IsInteracting; // 0x338
	bool _chargeComplete; // 0x339
};

struct UGunslingerEffectsComponent : UActorComponent {
	FMulticastInlineDelegate OnIsAimingChanged; // 0xb8
	FMulticastInlineDelegate PlayOutOfAmmoSound; // 0xc8
	float _minimumTimeBetweenBroadcast; // 0xd8
	AHarpoonRifle* _rifle; // 0xe0
};

struct UAIMoveToInteractData : UAICharacterBehaviourData {
	AActor* _interactActor; // 0x30
	AActor* _targetPositionActor; // 0x38
	ECharacterMovementTypes _characterMovementTypes; // 0x40
};

struct UOutOfSightMeshRotator : UActorComponent {
	float _maxDistance; // 0xb8
	float _dotProductThreshold; // 0xbc
	ADBDPlayer* _locallyObservedPlayer; // 0xc0
	TArray<UMeshComponent*> _meshesToRotate; // 0xc8
	float _rotationOffset; // 0xd8
};

struct UBTTask_CopyBBEntry : UBTTaskNode {
	FBlackboardKeySelector BBFrom; // 0x78
	FBlackboardKeySelector BBTo; // 0xa8
	bool CopyOnlyValidKeyValue; // 0xd8
};

struct UFlashbang : UPerk {
	AGenerator* _generatorBeingRepaired; // 0x3d8
	float _generatorsRepairTargetProgression; // 0x3e0
	float _generatorRepairPercentToCraftFlashbang[0x3]; // 0x3e4
};

struct UAnimSingleNodeInstance : UAnimInstance {
	UAnimationAsset* CurrentAsset; // 0x270
	FDelegate PostEvaluateAnimEvent; // 0x278
};

struct ADBD_SoundEventSpawner : AActor {
	TArray<FDBD_SoundSpawnerData> AtlantaSoundDescriptor; // 0x230
	TArray<FDBD_SoundSpawnerData> SoundDescriptor; // 0x240
	TArray<AActor*> _loadedSoundAssets; // 0x258
};

struct UMeshAnalysisProperties : UInteractiveToolPropertySet {
	FString SurfaceArea; // 0x58
	FString Volume; // 0x68
};

struct USuperModeDeactivation : UInteractionDefinition {
	FDBDTunableRowHandle _deactivationDuration; // 0x5b0
};

struct UTestAnyActorPairQueryRangeIsTrue : UAnyActorPairQueryRangeIsTrue {
	UActorPairQueryEvaluatorComponent* _actorPairQueryEvaluatorComponent; // 0x100
};

struct UBloodOrbOverlapComponent : UActorComponent {
	int32_t _currentOverlappingOrbs; // 0xc0
};

struct UK26AmmoHandlerComponent : UActorComponent {
	FMulticastInlineDelegate OnCurrentAmmoStateChanged; // 0xc8
	FTagStateBool _isAmmoOnCooldown; // 0xd8
	FMulticastInlineDelegate _onMaxAmmoSet; // 0x108
	float _rechargeEndTime; // 0x118
	bool _isTunableInit; // 0x11c
	AActor* _projectileClass; // 0x120
	FTunableStat _expirationCooldownTime; // 0x128
	TArray<FDBDTunableRowHandle> _firedCooldownTimesPerCrow; // 0x1a8
	FTunableStat _cooldownReductionPerCrowFired; // 0x1b8
	FTunableStat _expirationTime; // 0x238
	FDBDTunableRowHandle _expirationWarningBufferTime; // 0x2b8
	FTunableStat _maxAmmo; // 0x2e0
	int32_t _currentAmmo; // 0x360
	EK26AmmoCooldownReason _lastCooldownReason; // 0x364
	EK26AmmoState _currentAmmoState; // 0x365
	UK26PathHandlerComponent* _pathHandler; // 0x368
	UK26PowerStatusHandlerComponent* _statusHandler; // 0x370
	UAuthoritativeActorPoolComponent* _authoritativeActorPoolComponent; // 0x378
	FTagStateBool _isOutOfAmmo; // 0x380
	float _fallbackFireCooldown; // 0x3b0
};

struct UBTService_ClearBBEntry : UBTService_OnRelevantBase {
	FBlackboardKeySelector BBToResetKey; // 0x80
};

struct URenjirosBloodyGlove : UItemAddon {
	float _revealTime; // 0x2a0
	TMap<ACamperPlayer*, UBloodOrbOverlapRevealToKiller*> _revealEffectPerCamper; // 0x2a8
};

struct UEventAfterOtherWithMinimumCustomValueQEEvaluator : UQuestEventEvaluatorBase {
	FGameplayTag _startEvent; // 0x90
};

struct USkeletalMeshSimplificationSettings : UDeveloperSettings {
	FName SkeletalMeshReductionModuleName; // 0x48
};

struct UBTDecorator_HasDynamicSubtree : UBTDecorator_TickableBase {
	FGameplayTag InjectTag; // 0x70
};

struct UGassedSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isGassed; // 0x4f0
};

struct UBrushStampIndicator : UInteractiveGizmo {
	float BrushRadius; // 0x40
	float BrushFalloff; // 0x44
	FVector BrushPosition; // 0x48
	FVector BrushNormal; // 0x54
	bool bDrawIndicatorLines; // 0x60
	bool bDrawRadiusCircle; // 0x61
	bool bDrawFalloffCircle; // 0x62
	int32_t SampleStepCount; // 0x64
	FLinearColor LineColor; // 0x68
	float LineThickness; // 0x78
	bool bDepthTested; // 0x7c
	bool bDrawSecondaryLines; // 0x7d
	float SecondaryLineThickness; // 0x80
	FLinearColor SecondaryLineColor; // 0x84
	UPrimitiveComponent* AttachedComponent; // 0x98
};

struct AGeneratorEntity : AActor {
	AGenerator* _associatedGenerator; // 0x230
	UMontagePlayer* _montagePlayer; // 0x238
};

struct UInteractableTransformOptimizer : UActorComponent {
	bool _optimizeTransformUpdate; // 0xb8
};

struct UExposerInteriorZoneComponent : UBoxComponent {
	TArray<USceneComponent*> ExposerSpawnPoints; // 0x450
};

struct UEnvQueryInstanceBlueprintWrapper : UObject {
	int32_t QueryID; // 0x38
	UEnvQueryItemType* ItemType; // 0x60
	int32_t OptionIndex; // 0x68
	FMulticastInlineDelegate OnQueryFinishedEvent; // 0x70
};

struct UAkInitBank : UAkAssetBase {
	TArray<FString> AvailableAudioCultures; // 0x60
	FString DefaultLanguage; // 0x70
};

struct UKillerRedStainUpdateStrategy : UActorComponent {
	UCurveFloat* _stealthRatioToRedStainIntensityCurve; // 0xb8
	FGameplayTagContainer _hideRedStainStateTags; // 0xc0
};

struct UAB_Menu_Slasher22_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x328
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3a0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x440
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4b8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
	int32_t _anim_switch; // 0x644
};

struct UScreenController : UObject {
	UDBDGameInstance* _gameInstance; // 0x30
	UGFxObject* _screenControllerObj; // 0x38
	UGFxMoviePlayer* _moviePlayer; // 0x40
	TMap<FString, UScreenBase*> _screenDictionary; // 0x48
	TMap<FString, EScreenType> _screenTypeDictionary; // 0x98
	TMap<UObject*, TWeakObjectPtr<UUserWidget>> _cachedUMGScreens; // 0xe8
};

struct UBaseGroundDetectorComponent : UActorComponent {
	FName _startTransformName; // 0x168
	ECollisionChannel _walkableCollisionChannel; // 0x174
	bool _traceComplex; // 0x175
	float _extraTraceDistance; // 0x178
	USkinnedMeshComponent* _skinnedMeshComponent; // 0x180
	FName _startSlopeTransformName; // 0x190
};

struct UBTService_FindInteractor : UBTService {
	FBlackboardKeySelector BBSearchAround; // 0x88
	float SearchInterval; // 0xb8
	float SearchHeightAmplifierActivationHeight; // 0xbc
	float SearchHeightAmplifier; // 0xc0
	UNavigationQueryFilter* FilterClass; // 0xc8
	bool RegisterAsDiscoveredWhenFound; // 0xd0
	FBlackboardKeySelector BBOnlyFromActor; // 0xd8
	TArray<FString> OnlyWithInteractorIDs; // 0x108
	float RejectIfTerrorIsCloserThanSelfMargin; // 0x118
	float RejectIfInTerrorRadius; // 0x11c
	bool RejectIfInPressureZone; // 0x120
	bool UseLastKnownPositionForTerrorRejects; // 0x121
	bool RejectIfWasInCooldownAndFocusedOnAnotherObject; // 0x122
	FName RejectCooldownContextName; // 0x124
	bool AbandonIfInChase; // 0x130
	bool RejectIfFocusedByOther; // 0x131
	bool RejectIfNotFocusedBySelf; // 0x132
	bool IgnoreFocusFilterInEndgameCollapse; // 0x133
	bool RejectIfNotInSight; // 0x134
	bool IgnoreSightFilterIfDiscovered; // 0x135
	bool IgnoreSightFilterIfInRange; // 0x136
	float RejectAboveRange; // 0x138
	bool IgnoreRangeFilterIfDiscovered; // 0x13c
	bool IgnoreRangeFilterIfInSight; // 0x13d
	FBlackboardKeySelector BBInteractLocation; // 0x140
	FBlackboardKeySelector BBInteractorObj; // 0x170
	FAITunableParameter CantInterruptGoalInteractionUnderRemainingTime; // 0x1a0
	FAITunableParameter GoalBasicWeight; // 0x1b0
	FAITunableParameter GoalWeightMaxDistance; // 0x1c0
	FAITunableParameter GoalWeightAtMinDistance; // 0x1d0
	FAITunableParameter GoalWeightAtEndgameStart; // 0x1e0
	FAITunableParameter GoalWeightAtEndgameEnd; // 0x1f0
	UInteractor* _goalInteractor; // 0x200
	ADBDAIBTController* _aiOwner; // 0x208
};

struct ADBDGameState : AGameState {
	FMulticastInlineDelegate OnEscapeDoorActivated; // 0x2c8
	FMulticastInlineDelegate OnLevelReadyToPlay; // 0x368
	FMulticastInlineDelegate OnIntroCompleted; // 0x378
	FMulticastInlineDelegate OnKillerIntroCompletePercentChanged; // 0x388
	FMulticastInlineDelegate OnLightingGenerated; // 0x398
	USpecialEventGameplaySpawnerComponent* _specialEventGameplaySpawnerComponent; // 0x3d8
	FMulticastInlineDelegate AuthorityOnAllPlayerLoaded; // 0x3e0
	FMulticastInlineDelegate OnActivatedGeneratorCountChangedDynamic; // 0x408
	FMulticastInlineDelegate OnSlasherSet; // 0x418
	FMulticastInlineDelegate OnObsessionChanged; // 0x440
	int32_t CamperDeadCount; // 0x450
	int32_t CamperInMeatLockerCount; // 0x454
	int32_t CamperEscaped; // 0x458
	int32_t WaitingForEscape; // 0x45c
	int32_t CamperCount; // 0x460
	bool LeaveSpectateRequested; // 0x464
	int32_t SecondsLeftInLobby; // 0x468
	ASlasherPlayer* Slasher; // 0x4a0
	URenderingFeaturesSequencer* _renderingSequencer; // 0x4a8
	int32_t _camperHookedInBasementCount; // 0x4c0
	bool _playersReadyToStart; // 0x4cc
	FBuiltLevelData _builtLevelData; // 0x4d0
	FOfferingData _levelOfferings; // 0x578
	AClipManager* _clipManager; // 0x590
	FGuid _sessionId; // 0x598
	FGuid _lobbyId; // 0x5a8
	int32_t _activatedGeneratorCount; // 0x5b8
	int32_t _requiredActivatedGeneratorCount; // 0x5bc
	bool _escapeDoorActivated; // 0x5c0
	bool _escapeDoorOpened; // 0x5c1
	bool _isHatchOpen; // 0x5c2
	bool _levelReadyToPlay; // 0x5c3
	bool _playerDistributionReady; // 0x5c4
	bool _usingWeakenedMechanic; // 0x5c5
	int32_t _survivorLeft; // 0x5c8
	TArray<AMeatHook*> _meatHooks; // 0x5d0
	TArray<ASearchable*> _searchables; // 0x5e0
	TArray<AGenerator*> _generators; // 0x5f0
	TArray<AEscapeDoor*> _escapeDoors; // 0x600
	TArray<AHatch*> _hatches; // 0x610
	TArray<AReverseBearTrapRemover*> _reverseBearTrapRemovers; // 0x620
	TArray<ABaseTrap*> _baseTraps; // 0x630
	TArray<APallet*> _pallets; // 0x640
	TArray<AWindow*> _windows; // 0x650
	TArray<ALocker*> _lockers; // 0x660
	TArray<ABreakableBase*> _breakableWalls; // 0x670
	TArray<ATotem*> _totems; // 0x680
	FBoxSphereBounds _mapBoxSphereBounds; // 0x690
	int32_t _camperEscapedThroughHatch; // 0x6c4
	ACamperPlayer* _obsessionTarget; // 0x6c8
	bool _cachedObsessionEscaped; // 0x6d0
	TArray<AInteractable*> _traps; // 0x6d8
	FGamePresetData _gamePresetData; // 0x6f0
	bool _gameLevelLoaded; // 0x778
	bool _gameLevelCreated; // 0x779
	bool _gameLevelEnded; // 0x77a
	EEndGameReason _gameEndedReason; // 0x77b
	UEndGameStateComponent* _endGameState; // 0x780
	UScourgeHookManagerComponent* _scourgeHookManager; // 0x788
	UActorPairQueryEvaluatorComponent* _actorPairQueryEvaluatorComponent; // 0x790
	UCharacterCollection* _characterCollection; // 0x7a0
	UCollectableCollection* _collectableCollection; // 0x7a8
	UServerTimeProviderComponent* _serverTimeProvider; // 0x7b0
	UInGameAssetPreloaderComponent* _inGameAssetPreloaderComponent; // 0x7b8
	FDateTime _matchStartTime; // 0x7e8
	bool _isServerDedicated; // 0x7f0
	int32_t _maxSurvivorCount; // 0x7f4
	FString _serverBuildVersion; // 0x7f8
};

struct UAkCallbackInfo : UObject {
	UAkComponent* AkComponent; // 0x30
};

struct URecommendationsGenerator : UObject {
	TWeakObjectPtr<Ushopmanager> _shopManager; // 0x30
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x38
	TMap<FString, URecommendationsFilter*> _filters; // 0x40
};

struct UMeshSpaceDeformerTool : UMeshSurfacePointTool {
	ENonlinearOperationType SelectedOperationType; // 0xc8
	float UpperBoundsInterval; // 0xcc
	float LowerBoundsInterval; // 0xd0
	float ModifierPercent; // 0xd4
	UGizmoTransformChangeStateTarget* StateTarget; // 0xd8
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xe8
	FVector GizmoCenter; // 0x110
	FQuat GizmoOrientation; // 0x120
	UIntervalGizmo* IntervalGizmo; // 0x130
	UTransformGizmo* TransformGizmo; // 0x138
	UTransformProxy* TransformProxy; // 0x140
	UGizmoLocalFloatParameterSource* UpIntervalSource; // 0x148
	UGizmoLocalFloatParameterSource* DownIntervalSource; // 0x150
	UGizmoLocalFloatParameterSource* ForwardIntervalSource; // 0x158
};

struct ACrownPillarInteractable : ARespawnableInteractable {
	FDBDTunableRowHandle _crownPillarInteractionSecondsToCharge; // 0x350
	FDBDTunableRowHandle _crownPillarInteractionSecondsToChargeKiller; // 0x378
	FDBDTunableRowHandle _offeringEnabledAuraVisibilityDistance; // 0x3a0
	UCrownPickupInteraction* _crownPillarInteraction; // 0x3c8
	UCrownPickupInteraction* _crownPillarInteractionKiller; // 0x3d0
	UChargeableComponent* _crownPillarInteractionChargeable; // 0x3d8
	UChargeableComponent* _crownPillarInteractionChargeableKiller; // 0x3e0
	UInteractor* _crownPillarInteractor; // 0x3e8
	UPrimitiveComponent* _crownPillarInteractionZone; // 0x3f0
	UStaticMeshComponent* _crownPillarStaticMesh; // 0x3f8
	UDBDOutlineComponent* _outlineComponent; // 0x400
	UNearTrackedActorComponent* _nearTrackedActorComponent; // 0x408
	UCrownPillarOutlineUpdateStrategy* _crownPillarOutlineUpdateStrategy; // 0x410
};

struct ATileBase01_C : ATile {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	USceneComponent* Breakables; // 0x350
	USceneComponent* GeneratorDrivenObjects; // 0x358
	USceneComponent* Audio; // 0x360
	USceneComponent* PullObjects; // 0x368
	UActorSpawner* BottomLeftSpawner; // 0x370
	UActorSpawner* TopLeftSpawner; // 0x378
	UActorSpawner* TopRightSpawner; // 0x380
	UActorSpawner* BottomRightSpawner; // 0x388
	USceneComponent* QuadrantSpawners; // 0x390
	UBoxComponent* EdgeObjectBlocker; // 0x398
	USceneComponent* VaultObjects; // 0x3a0
	USceneComponent* Crows; // 0x3a8
	USceneComponent* EdgeObjects; // 0x3b0
	USceneComponent* Lockers; // 0x3b8
	USceneComponent* HideGrass; // 0x3c0
	USceneComponent* Blockers; // 0x3c8
	USceneComponent* Gameplay; // 0x3d0
	USceneComponent* lights; // 0x3d8
	UChildActorComponent* BP_Effect_Mist04; // 0x3e0
	UChildActorComponent* BP_Effect_Mist03; // 0x3e8
	UChildActorComponent* BP_Effect_Mist02; // 0x3f0
	UChildActorComponent* BP_Effect_Mist01; // 0x3f8
	USceneComponent* Mist (BP_Effect_Mist); // 0x400
	USceneComponent* FX; // 0x408
	USceneComponent* Deco; // 0x410
	UActorSpawner* SearchableSpawner; // 0x418
	UActorSpawner* SmallMeatLockerSpawner; // 0x420
	UActorSpawner* HatchSpawner; // 0x428
	UArrowComponent* Arrow6; // 0x430
	UTileSpawnPoint* InteractableSpawn01; // 0x438
	UArrowComponent* Arrow7; // 0x440
	UActorSpawner* HexSpawner01; // 0x448
	UTileSpawnPoint* SurvivorItemSpawn01; // 0x450
	UArrowComponent* Arrow5; // 0x458
	UTileSpawnPoint* KillerItemSpawn01; // 0x460
	UArrowComponent* Arrow4; // 0x468
	UTileSpawnPoint* KillerSpawn01; // 0x470
	UArrowComponent* Arrow2; // 0x478
	UTileSpawnPoint* SurvivorSpawn04; // 0x480
	UArrowComponent* Arrow1; // 0x488
	UTileSpawnPoint* SurvivorSpawn03; // 0x490
	UArrowComponent* Arrow; // 0x498
	UTileSpawnPoint* SurvivorSpawn02; // 0x4a0
	UArrowComponent* Arrow3; // 0x4a8
	UTileSpawnPoint* SurvivorSpawn01; // 0x4b0
	USceneComponent* SpawnPoints; // 0x4b8
	USceneComponent* Root; // 0x4c0
	bool Initialized; // 0x4c8
	float TotalWeight; // 0x4cc
	float SelectedWeight; // 0x4d0
	UTileSpawnPoint* SelectedSpawnPoint; // 0x4d8
};

struct UMatchConfigTabsDataAsset : UPrimaryDataAsset {
	TMap<ECustomMatchTab, FMatchConfigTabData> Data; // 0x38
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x40
	FVector Min; // 0x4c
	char bLockAxes : 1; // 0x58
	EDistributionVectorLockFlags LockedAxes; // 0x5c
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x5d
	char bUseExtremes : 1; // 0x60
};

struct UBloodwebDistribution : UObject {
	UDBDDesignTunables* _designTunables; // 0x40
	UBloodwebTunables* _bloodwebTunables; // 0x48
};

struct UKillerBlindingFXComponent : UBlindingFXComponent {
	UAkAudioEvent* _blindedSound; // 0x120
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x48
};

struct UUMGCustomizationItemWidget : UMobileBaseUserWidget {
	UImage* RarityBackground; // 0x310
	UImage* PaintOverlay; // 0x318
	UImage* Icon; // 0x320
	UCanvasPanel* NewIndicator; // 0x328
	UCanvasPanel* OutfitIndicator; // 0x330
	UVerticalBox* PricesContainer; // 0x338
	UCanvasPanel* ItemSelectedBorder; // 0x340
	UCanvasPanel* EquippedContainer; // 0x348
	TSoftClassPtr<UObject> _customizationItemPriceWidgetClass; // 0x350
	TArray<UUMGCustomizationItemPriceWidget*> _priceWidgets; // 0x380
	int32_t _itemIndex; // 0x390
	FName _itemId; // 0x394
};

struct ATotem : AInteractable {
	FLinearColor _boonAuraRevealColor; // 0x348
	TArray<UTotemBoundPerk*> _boundPerks; // 0x358
	ETotemState _totemState; // 0x368
	FDBDTunableRowHandle _baseBoonTotemBlessingRange; // 0x370
	FDBDTunableRowHandle _baseBoonTotemAuraRevealRange; // 0x398
	UAIPerceptionStimuliSourceComponent* _perceptionStimuliComponent; // 0x3d0
	UBlockableComponent* _totemBlockableComponent; // 0x3d8
	ULocalPlayerTrackerComponent* _localPlayerTracker; // 0x3f0
	UActivatorComponent* _activatorComponent; // 0x3f8
	UGameplayTagContainerComponent* _objectState; // 0x400
	USceneComponent* _interactionsAttachPoint; // 0x408
	UTotemOutlineUpdateStrategy* _totemOutlineUpdateStrategy; // 0x410
	bool _canBeBoundToBoonPerk; // 0x448
};

struct UPharmacyPerk : UPerk {
	TArray<float> _searchSpeeds; // 0x3d0
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x38
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x40
};

struct APlanarReflection : ASceneCapture {
	UPlanarReflectionComponent* PlanarReflectionComponent; // 0x240
	bool bShowPreviewPlane; // 0x248
};

struct UItemModifier : UGameplayModifierContainer {
	FGameplayModifierData ModifierData; // 0x220
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x78
	FRawDistributionFloat FrameRate; // 0x80
	int32_t StartingFrame; // 0xb0
};

struct UAIMoveToPosition : UAICharacterBehaviour {
	UAIMoveToPositionData* _aiBehaviourData; // 0x58
	ADBDAIPlayerController* _aiController; // 0x60
};

struct USpawningEffectPerk : UPerk {
	FPerkLevelEffectArray _perkLevelEffects[0x3]; // 0x3d0
	FPlayerStatusEffectSpawnerHelper _effectSpawnerHelper; // 0x400
};

struct UStarstruck : UPerk {
	float _exposedEffectDuration[0x3]; // 0x3d0
	float _perkCooldownDuration[0x3]; // 0x3dc
	TMap<TWeakObjectPtr<ACamperPlayer>, TWeakObjectPtr<UStatusEffect>> _camperExposedEffects; // 0x3e8
};

struct UZanshinTactics : UPerk {
	float _cooldownDuration[0x3]; // 0x3d0
};

struct UBaseInstantBlinkInteraction : UInteractionDefinition {
	float _blinkTimePercentage; // 0x5b0
};

struct UUdpMessagingSettings : UObject {
	bool EnableTransport; // 0x30
	bool bAutoRepair; // 0x31
	bool bStopServiceWhenAppDeactivates; // 0x32
	FString UnicastEndpoint; // 0x38
	FString MulticastEndpoint; // 0x48
	EUdpMessageFormat MessageFormat; // 0x58
	char MulticastTimeToLive; // 0x59
	TArray<FString> StaticEndpoints; // 0x60
	bool EnableTunnel; // 0x70
	FString TunnelUnicastEndpoint; // 0x78
	FString TunnelMulticastEndpoint; // 0x88
	TArray<FString> RemoteTunnelEndpoints; // 0x98
};

struct UDemogorgonPortalPlacementValidationStrategy : UDefaultObjectPlacementValidationStrategy {
	UPortalPlacerStateComponent* _portalPlacerState; // 0xe0
	UChargedAttackStateComponent* _chargedAttackState; // 0xe8
	float _distanceForWorldCollisionDetection; // 0xf0
	float _numberOfGroundTest; // 0xf4
	float _portalEdgeTestRadius; // 0xf8
	float _maxElevationDifferentialOnPortalEdge; // 0xfc
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x428
	FInterpCurveVector SplineInfo; // 0x490
	FInterpCurveQuat SplineRotInfo; // 0x4a8
	FInterpCurveVector SplineScaleInfo; // 0x4c0
	FInterpCurveFloat SplineReparamTable; // 0x4d8
	bool bAllowSplineEditingPerInstance; // 0x4f0
	int32_t ReparamStepsPerSegment; // 0x4f4
	float Duration; // 0x4f8
	bool bStationaryEndpoints; // 0x4fc
	bool bSplineHasBeenEdited; // 0x4fd
	bool bModifiedByConstructionScript; // 0x4fe
	bool bInputSplinePointsToConstructionScript; // 0x4ff
	bool bDrawDebug; // 0x500
	bool bClosedLoop; // 0x501
	bool bLoopPositionOverride; // 0x502
	float LoopPosition; // 0x504
	FVector DefaultUpVector; // 0x508
};

struct APlayerController : AController {
	UPlayer* Player; // 0x2b0
	APawn* AcknowledgedPawn; // 0x2b8
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2c0
	AHUD* MyHUD; // 0x2c8
	APlayerCameraManager* PlayerCameraManager; // 0x2d0
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2d8
	bool bAutoManageActiveCameraTarget; // 0x2e0
	FRotator TargetViewRotation; // 0x2e4
	float SmoothTargetViewRotationSpeed; // 0x2fc
	TArray<AActor*> HiddenActors; // 0x308
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x318
	float LastSpectatorStateSynchTime; // 0x32c
	FVector LastSpectatorSyncLocation; // 0x330
	FRotator LastSpectatorSyncRotation; // 0x33c
	int32_t ClientCap; // 0x348
	UCheatManager* CheatManager; // 0x350
	UCheatManager* CheatClass; // 0x358
	UPlayerInput* PlayerInput; // 0x360
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x368
	char bPlayerIsWaiting : 1; // 0x3e8
	char NetPlayerIndex; // 0x3ec
	UNetConnection* PendingSwapConnection; // 0x428
	UNetConnection* NetConnection; // 0x430
	float InputYawScale; // 0x444
	float InputPitchScale; // 0x448
	float InputRollScale; // 0x44c
	char bShowMouseCursor : 1; // 0x450
	char bEnableClickEvents : 1; // 0x450
	char bEnableTouchEvents : 1; // 0x450
	char bEnableMouseOverEvents : 1; // 0x450
	char bEnableTouchOverEvents : 1; // 0x450
	char bForceFeedbackEnabled : 1; // 0x450
	float ForceFeedbackScale; // 0x454
	TArray<FKey> ClickEventKeys; // 0x458
	EMouseCursor DefaultMouseCursor; // 0x468
	EMouseCursor CurrentMouseCursor; // 0x469
	ECollisionChannel DefaultClickTraceChannel; // 0x46a
	ECollisionChannel CurrentClickTraceChannel; // 0x46b
	float HitResultTraceDistance; // 0x46c
	uint16_t SeamlessTravelCount; // 0x470
	uint16_t LastCompletedSeamlessTravelCount; // 0x472
	UInputComponent* InactiveStateInputComponent; // 0x4e8
	char bShouldPerformFullTickWhenPaused : 1; // 0x4f0
	UTouchInterface* CurrentTouchInterface; // 0x508
	ASpectatorPawn* SpectatorPawn; // 0x560
	bool bIsLocalPlayerController; // 0x56c
	FVector SpawnLocation; // 0x570
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x350
};

struct UDreamInducerComponent : UActorComponent {
	UActorComponent* _generatorDreamworldClass; // 0xb8
};

struct UBlinkPlayerComponent : UActorComponent {
	FTunableStat _maxBlinkDuration; // 0xd0
	FDBDTunableRowHandle _minBlinkDuration; // 0x150
	UCurveFloat* _blinkFOVCurve; // 0x178
};

struct UMatchboxAddon : UItemAddon {
	float _speedModifier; // 0x298
};

struct UStreetwiseEffect : UBaseLingeringStatusEffect {
	float _range; // 0x358
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x30
	int32_t SubImages_Horizontal; // 0x38
	int32_t SubImages_Vertical; // 0x3c
	ESubUVBoundingVertexCount BoundingMode; // 0x40
	EOpacitySourceMode OpacitySourceMode; // 0x41
	float AlphaThreshold; // 0x44
};

struct UTwinsSurvivorSubAnimInstance : UBaseSurvivorAnimInstance {
	bool _isRemovingTwin; // 0x4f0
};

struct UInheritableComponentHandler : UObject {
	TArray<FComponentOverrideRecord> Records; // 0x30
	TArray<UActorComponent*> UnnecessaryComponents; // 0x40
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> materialInstances; // 0x30
	TArray<float> ResetFloats; // 0x40
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x50
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x60
};

struct UFieldSystemMetaDataIteration : UFieldSystemMetaData {
	int32_t Iterations; // 0xb8
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxis; // 0x48
	FExpressionInput RotationAngle; // 0x64
	FExpressionInput PivotPoint; // 0x80
	FExpressionInput Position; // 0x9c
	float Period; // 0xb8
};

struct UGizmoComponentHitTarget : UObject {
	UPrimitiveComponent* Component; // 0x38
};

struct UZombieResurrector : UActorComponent {
	FDBDTunableRowHandle _powerLevelToSpawnZombie; // 0xd0
	TArray<AZombieCharacter*> _delayedSpawnZombies; // 0x108
};

struct UInputTouchDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x30
};

struct USlasherOutlineUpdateStrategy : UOutlineUpdateStrategy {
	FMulticastInlineDelegate OnRevealed; // 0xc0
	FLinearColor _nonRevealedColor; // 0xd0
	FLinearColor _revealedColor; // 0xe0
	FLinearColor _revealedColorForKiller; // 0xf0
};

struct UUMGRankBanner : UMobileBaseUserWidget {
	UUMGTallyRankFrame* RankFrameWidget; // 0x308
	UButton* TooltipButton; // 0x310
	UImage* HighlightImage; // 0x318
	UAkAudioEvent* OnLongPressSound; // 0x320
	FMulticastInlineDelegate _onLongPressRankTooltipEvent; // 0x328
};

struct UYellowGlyphComponent : UActorComponent {
	ADBDPlayer* _currentlyInteractingPlayer; // 0xb8
	float _skillCheckDuration; // 0xc4
	float _skillCheckZoneLength; // 0xc8
	float _skillCheckDelay; // 0xcc
	float _skillCheckAverageDistance; // 0xd0
	float _skillCheckDistanceVariance; // 0xd4
	int32_t _teleportDelay; // 0xd8
	TArray<UTileSpawnPoint*> _survivorSpawns; // 0x110
	TArray<AGlyph*> _allGlyphs; // 0x120
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x50
	UNetDriver* Driver; // 0x60
	UPackageMap* PackageMapClass; // 0x68
	UPackageMap* PackageMap; // 0x70
	TArray<UChannel*> OpenChannels; // 0x78
	TArray<AActor*> SentTemporaries; // 0x88
	AActor* ViewTarget; // 0x98
	AActor* OwningActor; // 0xa0
	int32_t MaxPacket; // 0xa8
	char InternalAck : 1; // 0xac
	FUniqueNetIdRepl playerID; // 0x168
	double LastReceiveTime; // 0x1d8
	TArray<UChannel*> ChannelsToTick; // 0x1518
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x230
};

struct UChargeableInteractionDefinition : UInteractionDefinition {
	FMulticastInlineDelegate SkillCheckResponseAestheticDelegate; // 0x5c8
	FMulticastInlineDelegate SkillCheckResponseAuthorityDelegate; // 0x5d8
	bool StopInteractionOnChargeComplete; // 0x5e8
	bool HasProgressivelyHarderSkillChecks; // 0x5e9
	float ProgressiveDifficultyModifier; // 0x5ec
	EChargeableInteractionBarType ProgressBarType; // 0x5f0
	TArray<float> ProgressPips; // 0x5f8
	bool HideProgressBar; // 0x608
	bool ShowItemIcon; // 0x609
	bool AtlantaIsCancellableWhileCharging; // 0x60a
	UChargeableComponent* _chargeableComponent; // 0x610
	float _tutorialChargeableMultiplier; // 0x618
	bool ShowSpeedProficiencyForMultipleInteractors; // 0x670
	FGameplayTagContainer _interactionSpecificActionSpeedTags; // 0x678
	FGameplayTagContainer _interactionSpecificActionSpeedMultiplicativeTags; // 0x698
	FGameplayTagContainer _interactionSpecificActionSpeedAdditiveTags; // 0x6b8
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x38
	int32_t LightMapCoordinateIndex; // 0x88
	int32_t LightMapResolution; // 0x8c
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x90
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0xa0
};

struct UBloodDecalEffectIntensity : UDataAsset {
	FColor IntensifyBloodColor; // 0x38
	FColor IntensifyBloodColor2; // 0x3c
	FColor IntensifyBloodColorEmissive; // 0x40
	float IntensifyBloodColorEmissiveMinimumIntensity; // 0x44
	float IntensifyBloodColorEmissiveMaximumIntensity; // 0x48
};

struct UAISkill_InteractionTeleportEthereal : UAISkill_InteractionTeleport {
	float TeleportPlanInterval; // 0x178
	float MaxTeleportAlignHalfAngle; // 0x17c
	float AbortNotWorkingTeleportDelay; // 0x180
	float AbortAddRunCooldownPenaltyTime; // 0x184
	AActor* _onStimulusInstigator; // 0x1a0
};

struct UAISkill_InteractionTarget_ThrowAntidote : UAISkill_InteractionTarget_Throw {
	float _minPathLengthForThrow; // 0x298
	float _minThrowDistance; // 0x29c
	float _cooldownTime; // 0x2a0
};

struct UCharacterPositionRecorderComponent : UActorComponent {
	float _cacheTimespan; // 0xb8
};

struct UPerk : UGameplayModifierContainer {
	FGameplayModifierData PerkLevelData[0x3]; // 0x280
	UBasePerkIconStrategy* PerkIconStrategyClass; // 0x340
	FMulticastInlineDelegate OnTokenCountChangedBP; // 0x348
	bool _isUsable; // 0x388
	bool BroadcastWhenApplicable; // 0x389
	bool BroadcastOnTimer; // 0x38a
	bool BroadcastCooldownTimer; // 0x38b
	bool BroadcastInactiveCooldownTimer; // 0x38c
	bool BroadcastAlways; // 0x38d
	UBasePerkIconStrategy* _perkIconStrategy; // 0x390
	FPerkInitializationData _perkInitializationData; // 0x398
	int32_t _tokenCount; // 0x3a4
	int32_t _maxTokenCount; // 0x3a8
	UTimerObject* _cooldownTimer; // 0x3b0
	UTimerObject* _hudIconTimer; // 0x3c0
};

struct UUMGLoadingScreenWidget : UMobileBaseUserWidget {
	UTextBlock* Description; // 0x300
	UImage* HintIcon; // 0x308
	UProgressBar* LoadingBar; // 0x310
	UPanelWidget* KillerPanel; // 0x318
	UPanelWidget* SurvivorPanel; // 0x320
	UTextBlock* Title; // 0x328
};

struct UBasePoolableActorComponent : UActorComponent {
	FMulticastInlineDelegate OnAcquiredChanged; // 0xc0
};

struct UChaosClothConfig : UClothConfigCommon {
	EClothMassMode MassMode; // 0x30
	float UniformMass; // 0x34
	float TotalMass; // 0x38
	float Density; // 0x3c
	float MinPerParticleMass; // 0x40
	float EdgeStiffness; // 0x44
	float BendingStiffness; // 0x48
	float AreaStiffness; // 0x4c
	float VolumeStiffness; // 0x50
	float StrainLimitingStiffness; // 0x54
	float LimitScale; // 0x58
	bool bUseGeodesicDistance; // 0x5c
	float ShapeTargetStiffness; // 0x60
	float CollisionThickness; // 0x64
	float FrictionCoefficient; // 0x68
	float DampingCoefficient; // 0x6c
	float DragCoefficient; // 0x70
	float AnimDriveSpringStiffness; // 0x74
	bool bUseBendingElements; // 0x78
	bool bUseTetrahedralConstraints; // 0x79
	bool bUseThinShellVolumeConstraints; // 0x7a
	bool bUseSelfCollisions; // 0x7b
	bool bUseContinuousCollisionDetection; // 0x7c
	FVector LinearVelocityScale; // 0x80
	float AngularVelocityScale; // 0x8c
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct UTouchInterface : UObject {
	TArray<FTouchInputControl> Controls; // 0x30
	float ActiveOpacity; // 0x40
	float InactiveOpacity; // 0x44
	float TimeUntilDeactive; // 0x48
	float TimeUntilReset; // 0x4c
	float ActivationDelay; // 0x50
	bool bPreventRecenter; // 0x54
	float StartupDelay; // 0x58
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0x98
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x88
	FAIDataProviderFloatValue SpaceBetween; // 0xc8
	FAIDataProviderIntValue NumberOfPoints; // 0x108
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x148
	FEnvDirection ArcDirection; // 0x150
	FAIDataProviderFloatValue ArcAngle; // 0x170
	float AngleRadians; // 0x1b0
	UEnvQueryContext* CircleCenter; // 0x1b8
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x1c0
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1c8
	FEnvTraceData TraceData; // 0x208
	char bDefineArc : 1; // 0x238
};

struct UInterpTrackInstAkAudioEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x30
};

struct UGranularSynth : USynthComponent {
	USoundWave* GranulatedSoundWave; // 0x6f0
};

struct UProceduralFoliageComponent : UActorComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xb8
	float TileOverlap; // 0xc0
	AVolume* SpawningVolume; // 0xc8
	FGuid ProceduralGuid; // 0xd0
};

struct UTimedRespawnableTrigger : URespawnableTrigger {
	URespawningEventComponent* _respawningEventComponent; // 0xb8
};

struct UPowerChargePresentationItemProgressComponent : UPresentationItemProgressComponent {
	UPowerChargeComponent* _powerChargeComponent; // 0xb8
	UPowerToggleComponent* _powerToggleComponent; // 0xc0
	float _chargeReadyThreshold; // 0xc8
};

struct ATormentMode : ACollectable {
	UChargeableComponent* _activateTormentModeCharge; // 0x548
	UPowerChargeComponent* _tormentModeCharge; // 0x550
	UPowerChargePresentationItemProgressComponent* _tormentModeChargePresentation; // 0x560
	UPowerToggleComponent* _powerToggleComponent; // 0x568
	UTormentTrailSpawnerComponent* _tormentTrailSpawnerComponent; // 0x570
	UTormentTrailPointCollectionComponent* _tormentTrailPointCollectionComponent; // 0x578
	UTormentTrailPointCollectionComponent* _restrictedTormentTrailPointCollectionComponent; // 0x580
	UAuthoritativeActorPoolComponent* _tormentTrailControllerPool; // 0x588
	UAuthoritativeActorPoolComponent* _tormentAttackTrailControllerPool; // 0x590
	UAuthoritativeActorPoolComponent* _restrictedTormentTrailControllerPool; // 0x598
	UAuthoritativeActorPoolComponent* _tormentTrailPointPool; // 0x5a0
	UAuthoritativeActorPoolComponent* _restrictedTormentTrailPointPool; // 0x5a8
	FDBDTunableRowHandle _activateTormentModeSecondsToCharge; // 0x5b0
	FDBDTunableRowHandle _tormentModeMaxCharge; // 0x5d8
	FTunableStat _tormentModeChargeRate; // 0x600
	FTunableStat _tormentModeDischargeRate; // 0x680
	FDBDTunableRowHandle _tormentModePauseChargeRate; // 0x700
	FDBDTunableRowHandle _tormentModeAttackConsumePower; // 0x728
	FDBDTunableRowHandle _tormentModeMinimumPercentToActivate; // 0x750
	FDBDTunableRowHandle _tormentModeMouseYawScale; // 0x778
	FDBDTunableRowHandle _tormentModeYawAdjustTime; // 0x7a0
	FDBDTunableRowHandle _tormentModeGamePadYawScale; // 0x7c8
	FDBDTunableRowHandle _tormentModeYawInputLimit; // 0x7f0
	FDBDTunableRowHandle _tormentModeNotMovingYawScaleMultiplier; // 0x818
	FDBDTunableRowHandle _tormentModeNotMovingYawAdjustTime; // 0x840
	FDBDTunableRowHandle _tormentModeWalkSpeed; // 0x868
	FDBDTunableRowHandle _normalWalkSpeed; // 0x890
	FDBDTunableRowHandle _tormentModeForcedPitch; // 0x8b8
	UAgonyComponent* _agonyComponentClass; // 0x8e0
	UTormentTrailDetectorComponent* _killerTormentTrailDetectorClass; // 0x8f8
	UTormentTrailDetectorComponent* _survivorTormentTrailDetectorClass; // 0x900
	UTormentModeCooldownInteraction* _tormentModeCooldownInteraction; // 0x908
	UCurveFloat* _tormentModeChargeSpeedCurve; // 0x910
	AMobileTormentTrailRenderer* _mobileTormentTrailRendererClass; // 0x918
};

struct UOffTheRecord : UPerk {
	float _activationDurationLevels[0x3]; // 0x3d0
};

struct UPaperTerrainMaterial : UDataAsset {
	TArray<FPaperTerrainMaterialRule> Rules; // 0x38
	UPaperSprite* InteriorFill; // 0x48
};

struct USoulGuard : UPerk {
	float _cooldownLevels[0x3]; // 0x3d0
	bool _recover; // 0x3dc
	float _enduranceEffectDuration[0x3]; // 0x3e0
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	bool bCanBlend; // 0x60
	TArray<UMovieSceneSection*> Sections; // 0x68
};

struct UUMGPurchaseSticker : UMobileBaseUserWidget {
	UTextBlock* TextDiscount; // 0x300
};

struct UPlaneCutTool : UMultiSelectionTool {
	UPlaneCutToolProperties* BasicProperties; // 0xa0
	UAcceptOutputProperties* AcceptProperties; // 0xa8
	FVector CutPlaneOrigin; // 0xb0
	FQuat CutPlaneOrientation; // 0xc0
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xd0
	TArray<UDynamicMeshReplacementChangeTarget*> MeshesToCut; // 0xe0
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
};

struct UChestAnimInstance : UAnimInstance {
	ASearchable* _owningChest; // 0x270
	bool _isOpen; // 0x278
	bool _isBeingPriedOpen; // 0x279
	UInteractionDefinition* _openChestInteraction; // 0x288
};

struct UGeneratorEntityAnimInstance : UAnimInstance {
	bool IsCorrupted; // 0x270
	bool IsCorrupted_End; // 0x271
	bool IsUncorrupted; // 0x272
	bool IsUncorrupted_End; // 0x273
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char defaultValue : 1; // 0x68
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat StartRotation; // 0x38
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x240
};

struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x38
	int32_t EventId; // 0x3c
};

struct UUMGQueueStatusIconWidget : UMobileBaseUserWidget {
	UImage* statusIndicator; // 0x300
	FLinearColor AcceptableColor; // 0x308
	FLinearColor ModerateColor; // 0x318
	FLinearColor LongColor; // 0x328
};

struct UBTDecorator_IsInteractorAvailable : UBTDecorator_TickableBase {
	FBlackboardKeySelector BBInteractorObj; // 0x70
};

struct UWidgetSwitcherSlot : UPanelSlot {
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UGizmoRectangleComponent : UGizmoBaseComponent {
	FVector DirectionX; // 0x448
	FVector DirectionY; // 0x454
	float OffsetX; // 0x460
	float OffsetY; // 0x464
	float LengthX; // 0x468
	float LengthY; // 0x46c
	float Thickness; // 0x470
	char SegmentFlags; // 0x474
};

struct UStillnessTrackerComponent : UActorComponent {
	float SpeedThreshold; // 0xb8
	float DistanceThreshold; // 0xbc
	float DistanceDecay; // 0xc0
	bool DecayWhileMoving; // 0xc4
	float StillnessThreshhold; // 0xc8
	float StillnessTimerLimit; // 0xcc
	float DecaySpeedMultiplier; // 0xd0
	TWeakObjectPtr<ADBDPlayer> _trackedPlayer; // 0xdc
};

struct UUMGControlTypeSelectionWidget : UMobileBaseUserWidget {
	UUMGControlTypeWidget* SnapOnJoystick; // 0x300
	UUMGControlTypeWidget* CameraFullScreen; // 0x308
	UTextBlock* TitleText; // 0x310
};

struct UAISenseConfig_Hearing : UAISenseConfig {
	UAISense_Hearing* Implementation; // 0x50
	float HearingRange; // 0x58
	float LoSHearingRange; // 0x5c
	char bUseLoSHearing : 1; // 0x60
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x64
};

struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UHLODProxy : UObject {
	TArray<FHLODProxyMesh> ProxyMeshes; // 0x30
};

struct UGizmoConstantFrameAxisSource : UObject {
	FVector Origin; // 0x38
	FVector Direction; // 0x44
	FVector TangentX; // 0x50
	FVector TangentY; // 0x5c
};

struct USceneComponent : UActorComponent {
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xc0
	USceneComponent* AttachParent; // 0xc8
	FName AttachSocketName; // 0xd0
	TArray<USceneComponent*> AttachChildren; // 0xe0
	TArray<USceneComponent*> ClientAttachedChildren; // 0xf0
	FVector RelativeLocation; // 0x134
	FRotator RelativeRotation; // 0x140
	FVector RelativeScale3D; // 0x14c
	FVector ComponentVelocity; // 0x158
	char bComponentToWorldUpdated : 1; // 0x164
	char bAbsoluteLocation : 1; // 0x164
	char bAbsoluteRotation : 1; // 0x164
	char bAbsoluteScale : 1; // 0x164
	char bVisible : 1; // 0x164
	char bShouldBeAttached : 1; // 0x164
	char bShouldSnapLocationWhenAttached : 1; // 0x165
	char bShouldSnapRotationWhenAttached : 1; // 0x165
	char bShouldUpdatePhysicsVolume : 1; // 0x165
	char bSkipComponentAndChildrenTransformUpdate : 1; // 0x165
	char bHiddenInGame : 1; // 0x165
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x165
	char bUseAttachParentBound : 1; // 0x165
	EComponentMobility Mobility; // 0x167
	EDetailMode DetailMode; // 0x168
	int32_t DetailModeBitMask; // 0x16c
	FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x170
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x1a0
	TArray<FString> ActorGuidStrings; // 0x220
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x280
	FName PreviousMatchState; // 0x28c
	int32_t ElapsedTime; // 0x298
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x3a8
	float LightFalloffExponent; // 0x3ac
	float SourceRadius; // 0x3b0
	float SoftSourceRadius; // 0x3b4
	float SourceLength; // 0x3b8
};

struct ATutorialLevel : ALevelScriptActor {
	bool _tutorialStarted; // 0x238
};

struct UDedicatedServerManager : UObject {
	TScriptInterface<IDedicatedServerStartupInitializerInterface> _startupInitializer; // 0x30
	UDBDGameInstance* _gameInstance; // 0x50
	UOnlineSystemHandler* _onlineSystemHandler; // 0x58
};

struct UFranklinsDemiseConsumedByEntityComponent : UActorComponent {
	UTimerObject* _consumeTimer; // 0xd0
	UStatusEffect* _camperStatus; // 0xe8
	ADBDPlayer* _previousOwner; // 0xf0
	ADBDPlayer* _originatingPerkOwner; // 0xf8
	UChargerComponent* _itemChargerComponent; // 0x100
};

struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	FSubmixEffectFilterSettings Settings; // 0x7c
};

struct UActorComponent : UObject {
	FActorComponentTickFunction PrimaryComponentTick; // 0x38
	TArray<FName> ComponentTags; // 0x68
	TArray<UAssetUserData*> AssetUserData; // 0x78
	int32_t UCSSerializationIndex; // 0x8c
	char bNetAddressable : 1; // 0x90
	char bReplicates : 1; // 0x90
	char bAutoActivate : 1; // 0x91
	char bIsActive : 1; // 0x92
	char bEditableWhenInherited : 1; // 0x92
	char bCanEverAffectNavigation : 1; // 0x92
	char bIsEditorOnly : 1; // 0x92
	EComponentCreationMethod CreationMethod; // 0x94
	FMulticastSparseDelegate OnComponentActivated; // 0x95
	FMulticastSparseDelegate OnComponentDeactivated; // 0x96
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x98
};

struct UCharacterXPManager : UObject {
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x48
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x50
	float SightRadius; // 0x58
	float LoseSightRadius; // 0x5c
	float PeripheralVisionAngleDegrees; // 0x60
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x64
	float AutoSuccessRangeFromLastSeenLocation; // 0x68
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x230
};

struct UEnvQuery : UDataAsset {
	FName QueryName; // 0x38
	TArray<UEnvQueryOption*> Options; // 0x48
};

struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue GridSize; // 0x88
	FAIDataProviderFloatValue SpaceBetween; // 0xc8
	UEnvQueryContext* GenerateAround; // 0x108
};

struct UBaseKillerAttackSubAnimInstance : UBasePlayerAttackSubAnimInstance {
	ASlasherPlayer* _owningKiller; // 0x5b0
};

struct UNavigationQueryFilter_Slasher : UNavigationQueryFilter_Player {
	TMap<FString, float> DefaultInteractionsTimeCost; // 0x70
	TMap<FString, float> FrenzyInteractionsTimeCost; // 0xc0
};

struct UDoesPerkHaveToken : UEventDrivenModifierCondition {
	TWeakObjectPtr<UPerk> _perk; // 0xe8
};

struct UMaterialExpressionLogarithm2 : UMaterialExpression {
	FExpressionInput X; // 0x48
};

struct AController : AActor {
	APlayerState* PlayerState; // 0x238
	FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x248
	FName StateName; // 0x258
	APawn* Pawn; // 0x268
	ACharacter* Character; // 0x278
	USceneComponent* TransformComponent; // 0x280
	FRotator ControlRotation; // 0x2a0
	char bAttachToPawn : 1; // 0x2ac
};

struct UParticleModuleMeshRotationRateOverLife : UParticleModuleRotationRateBase {
	FRawDistributionVector RotRate; // 0x38
	char bScaleRotRate : 1; // 0x80
};

struct UTimelineTemplate : UObject {
	float TimelineLength; // 0x30
	ETimelineLengthMode LengthMode; // 0x34
	char bAutoPlay : 1; // 0x35
	char bLoop : 1; // 0x35
	char bReplicated : 1; // 0x35
	char bIgnoreTimeDilation : 1; // 0x35
	float UpdateInterval; // 0x38
	TArray<FTTEventTrack> EventTracks; // 0x40
	TArray<FTTFloatTrack> FloatTracks; // 0x50
	TArray<FTTVectorTrack> VectorTracks; // 0x60
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x70
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x80
	FGuid TimelineGuid; // 0x90
	FName VariableName; // 0xa0
	FName DirectionPropertyName; // 0xac
	FName UpdateFunctionName; // 0xb8
	FName FinishedFunctionName; // 0xc4
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x38
	char bLabelAssetsInMyDirectory : 1; // 0x44
	char bIsRuntimeLabel : 1; // 0x44
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x48
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x58
	FCollectionReference AssetCollection; // 0x68
};

struct ULingeringStateTagStatusEffect : UBaseLingeringStatusEffect {
	FGameplayTag _ownerStateTag; // 0x358
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput value; // 0x48
};

struct UClickDragInputBehavior : UAnyButtonInputBehavior {
	bool bUpdateModifiersDuringDrag; // 0x120
};

struct ADBDAIPlayerController : ADBDAIController {
	TArray<UAICharacterBehaviour*> _currentBehaviours; // 0x5f0
};

struct USurvivorPlagueEffect : UStatusEffect {
	float _sicknessAmount; // 0x398
	float _sicknessCap; // 0x39c
	float _vomitSlowDuration; // 0x3a0
	float _vomitSlowAmount; // 0x3a4
	TArray<float> _sicknessThresholds; // 0x3a8
	bool _wasRecentlyHitByVomit; // 0x3b8
	TArray<FString> _nonNauseatingInteractions; // 0x3c0
	FTunableStat _sicknessGainPerSecondFromInfectedInteractable; // 0x3e8
	bool _debugMode; // 0x4f8
};

struct UMaterialExpressionLandscapeLayerSample : UMaterialExpression {
	FName ParameterName; // 0x48
	float PreviewWeight; // 0x54
	FGuid ExpressionGUID; // 0x58
};

struct UKillerOpenGate : UChargeableInteractionDefinition {
	FAnimationMontageDescriptor _openGateMontage; // 0x6d8
};

struct UTestPresenter : UPresenter {
	UUserWidget* TestWidgetClass; // 0xe0
};

struct UMaterialExpressionBreakMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x48
};

struct ABreakableBase : AInteractable {
	UBoxComponent* _breakableCollision; // 0x328
	EBreakableState _state; // 0x330
	UAkComponent* _akAudioBreakable; // 0x338
	UAkAudioEvent* _akAudioBreakEvent; // 0x340
	USceneComponent* _rootComponent; // 0x348
};

struct UTestMovieSceneTrack : UMovieSceneTrack {
	bool bHighPassFilter; // 0x60
	TArray<UMovieSceneSection*> SectionArray; // 0x68
};

struct UMovieSceneCameraAnimTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x60
};

struct UUMGPromoPackCharacterWidget : UUMGPromoPackItemWidget {
	UCanvasPanel* OwnedPanel; // 0x468
};

struct UAnimCollection : UDataAsset {
	TMap<FGameplayTag, UAnimSequence*> _taggedAnimSequences; // 0x38
	TMap<FGameplayTag, UBlendSpaceBase*> _taggedAnimBlendspaces; // 0x88
	TMap<FGameplayTag, FAnimSequenceSelector> _taggedAnimSelectors; // 0xd8
	UAnimCollection* _parent; // 0x128
	TArray<UAnimCollection*> _children; // 0x130
};

struct UNavigationQueryFilter_Camper : UNavigationQueryFilter_Player {
	float SlasherAreaBoundsLimit; // 0x70
	float SlasherAreaPenetrationCost; // 0x74
	float SlasherInSightCost; // 0x78
	float SlasherAreaExcludeUnderRange; // 0x7c
	float SlasherInExcludeAreaCost; // 0x80
};

struct USoundNodeLooping : USoundNode {
	int32_t LoopCount; // 0x50
	char bLoopIndefinitely : 1; // 0x54
};

struct UPaperGroupedSpriteComponent : UMeshComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x478
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x488
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x88
};

struct UMaterialExpressionWorldPosition : UMaterialExpression {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x48
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	FGuid CameraGuid; // 0xe8
	FMovieSceneObjectBindingID CameraBindingID; // 0xf8
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x428
	UNavAreaBase* AreaClass; // 0x430
	FColor ShapeColor; // 0x438
	char bDrawOnlyIfSelected : 1; // 0x43c
	char bShouldCollideWhenPlacing : 1; // 0x43c
	char bDynamicObstacle : 1; // 0x43c
};

struct UDownedByBasicAttack : UEventDrivenModifierCondition {
	bool _replicatedIsTrue; // 0xe8
};

struct UMeshSelectionToolProperties : UInteractiveToolPropertySet {
	EMeshSelectionToolPrimaryMode SelectionMode; // 0x58
	float AngleTolerance; // 0x5c
	bool bHitBackFaces; // 0x60
	bool bShowWireframe; // 0x61
	EMeshFacesColorMode FaceColorMode; // 0x64
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x40
	FGPUSpriteResourceData ResourceData; // 0x2c0
	float CameraMotionBlurAmount; // 0x420
	char bClearExistingParticlesOnInit : 1; // 0x424
};

struct USynthKnob : UWidget {
	float value; // 0x128
	float StepSize; // 0x12c
	float MouseSpeed; // 0x130
	float MouseFineTuneSpeed; // 0x134
	char ShowTooltipInfo : 1; // 0x138
	FText ParameterName; // 0x140
	FText ParameterUnits; // 0x158
	FDelegate ValueDelegate; // 0x170
	FSynthKnobStyle WidgetStyle; // 0x188
	bool locked; // 0x3e0
	bool IsFocusable; // 0x3e1
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x3e8
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x3f8
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x408
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x418
	FMulticastInlineDelegate OnValueChanged; // 0x428
};

struct UAuthoritativePoolProjectileProviderAdapter : UObject {
	UAuthoritativeActorPoolComponent* _pool; // 0x38
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x48
};

struct ULightingInterpolator : UObject {
	FMulticastInlineDelegate OnInterpolationDone; // 0x30
	ABaseSky* _targetLighting; // 0x78
};

struct UActivateSuperMode : UInteractionDefinition {
	FAnimationMontageDescriptor _activationMontage; // 0x5b8
	FDBDTunableRowHandle _activationDuration; // 0x5d8
	FDBDTunableRowHandle _confirmationChargeDuration; // 0x600
};

struct UUMGRewardPopupLayout : UMobileBaseUserWidget {
	UHorizontalBox* TopHorizontalBox; // 0x300
	UHorizontalBox* BottomHorizontalBox; // 0x308
	UUMGRewardSlotTutorialPopupRewardWidget* FirstCharacter; // 0x310
	UUMGRewardSlotTutorialPopupRewardWidget* SecondCharacter; // 0x318
	UUMGRewardSlotTutorialPopupRewardWidget* ThirdCharacter; // 0x320
	UUMGRewardSlotTutorialPopupRewardWidget* FourthCharacter; // 0x328
	UUMGRewardSlotTutorialPopupRewardWidget* FifthCharacter; // 0x330
	UUMGRewardSlotTutorialPopupRewardWidget* AuricCells; // 0x338
	UUMGRewardSlotTutorialPopupRewardWidget* IridescentShards; // 0x340
	UUMGRewardSlotTutorialPopupRewardWidget* BloodPoints; // 0x348
	FRewardLayoutWidgetToGenerate TopWidgetToGenerate; // 0x350
	FRewardLayoutWidgetToGenerate BottomWidgetToGenerate; // 0x3e0
};

struct AK26AttachedCrow : AActor {
	UFirecrackerEffectHandlerComponent* _firecrackerEffectHandlerComponent; // 0x260
	UFlashlightableComponent* _flashLightableComponent; // 0x268
	ULightBurnable* _lightBurnableComponent; // 0x270
	UChargeableComponent* _flashlightDestroyChargeable; // 0x278
	FDBDTunableRowHandle _requiredFlashlightTimeToDestroy; // 0x290
	FTunableStat _lingerTime; // 0x2b8
	FDBDTunableRowHandle _infectionDelay; // 0x338
	FDBDTunableRowHandle _infectRadius; // 0x360
	UK26PowerOutlineUpdateStrategy* _outlineUpdateStrategy; // 0x388
	UDBDOutlineComponent* _outlineComponent; // 0x390
	UStaticMeshComponent* _visualStaticMeshComponent; // 0x398
	USceneComponent* _rootComponent; // 0x3a0
	UK26PowerStatusHandlerComponent* _statusHandler; // 0x3a8
	bool _authority_isInfecting; // 0x3b0
	FK26AttachmentStatus _attachmentStatus; // 0x3b1
};

struct UK26CrowPlacementValidatorComponent : UActorComponent {
	UObjectPlacementValidationWithRestrictionStrategy* _objectPlacementValidationStrategyWithRestrictions; // 0xb8
};

struct AKillerAtlantaTutorialLevel : AAtlantaTutorialLevel {
	TWeakObjectPtr<ASlasherPlayer> LocallyControllerSlasherPlayer; // 0x328
	TWeakObjectPtr<ACamperPlayer> ChaseCamper; // 0x330
	TWeakObjectPtr<ACamperPlayer> BearTrapCamper; // 0x338
	TWeakObjectPtr<AGenerator> KickGenerator; // 0x340
	TWeakObjectPtr<AWindow> VaultWindow; // 0x348
	TWeakObjectPtr<AEscapeDoor> EscapeDoor; // 0x350
	TWeakObjectPtr<AHatch> Hatch; // 0x358
};

struct UParticleModuleLocationPrimitiveTriangle : UParticleModuleLocationBase {
	FRawDistributionVector StartOffset; // 0x38
	FRawDistributionFloat Height; // 0x80
	FRawDistributionFloat Angle; // 0xb0
	FRawDistributionFloat Thickness; // 0xe0
};

struct USurvivorWasRecentlyUnhookedEffect : UStatusEffect {
	FDBDTunableRowHandle _survivorWasRecentlyUnhookedDuration; // 0x350
};

struct UKatsumoriTalisman : UItemAddon {
	float _explosionRadius; // 0x2a8
	float _blockDuration; // 0x2ac
};

struct USelfUntrap : UChargeableInteractionDefinition {
	FDBDTunableRowHandle _trapImmunityDuration; // 0x6d8
	UAnimMontage* _untrapMontage; // 0x700
	FAnimationMontageDescriptor _successfulEscapeHealthy; // 0x708
	FAnimationMontageDescriptor _successfulEscapeInjured; // 0x728
	FAnimationMontageDescriptor _successfulEscapeCrawling; // 0x748
	FAnimationMontageDescriptor _failedEscape; // 0x768
	bool _canEscape; // 0x789
};

struct UPossessPlayer : UChargeableInteractionDefinition {
	FDBDTunableRowHandle _possessThePlayerMaxCharge; // 0x6d8
};

struct UTwinDestructionComponent : UActorComponent {
	AActor* _huskClass; // 0xe8
	FTransform _dyingTransform; // 0xf0
	bool _diedFromSurvivorRemovingTwin; // 0x138
	float _dyingFromSurvivorTranslation; // 0x190
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UBTDecorator_ExtIsBBEntryOfClass : UBTDecorator_IsBBEntryOfClass {
	bool InvertConditition; // 0xa8
};

struct ABP_Menu_Slasher18_C : ABP_Menu_BaseSlasher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UBP_Audio_KLR_18_C* BP_Audio_KLR_19; // 0x698
	USkeletalMeshComponent* rings; // 0x6a0
	UDemonModeMenuComponent* DemonModeMenu; // 0x6a8
	USkeletalMeshComponent* SKWS01_REF; // 0x6b0
	FLinearColor TML_DemonModeCusto_Color_4A028AF64D8C75B37ACB968AFFF999A6; // 0x6b8
	float TML_DemonModeCusto_Demon_Custo_Dissolve_4A028AF64D8C75B37ACB968AFFF999A6; // 0x6c8
	float TML_DemonModeCusto_Normal_Custo_Dissolve_4A028AF64D8C75B37ACB968AFFF999A6; // 0x6cc
	ETimelineDirection TML_DemonModeCusto__Direction_4A028AF64D8C75B37ACB968AFFF999A6; // 0x6d0
	UTimelineComponent* TML_DemonModeCusto; // 0x6d8
	float TML_KatanaDissolve_Dissolve_E350E1F74AF3386DE5C9E7A92E1CFCA4; // 0x6e0
	ETimelineDirection TML_KatanaDissolve__Direction_E350E1F74AF3386DE5C9E7A92E1CFCA4; // 0x6e4
	UTimelineComponent* TML_KatanaDissolve; // 0x6e8
	bool IsKatanaVisible; // 0x6f0
	TArray<USkeletalMeshComponent*> NormalModeCustoParts; // 0x6f8
	TArray<UParticleSystemComponent*> DemonModeVFX; // 0x708
	TArray<USkeletalMeshComponent*> DemonModeCustoParts; // 0x718
	TArray<FLinearColor> SKOniEmissiveDefault; // 0x728
	bool IsInDemonMode; // 0x738
	TArray<FLinearColor> SM_OniEmissiveDefault; // 0x740
	float MaxSwordDissolveValue; // 0x750
	float MinDissolvevalue; // 0x754
};

struct UUnhook : UChargeableInteractionDefinition {
	TArray<USceneComponent*> _snapPoints; // 0x6d8
	FDBDTunableRowHandle _unhookLoudNoiseRange; // 0x6e8
	ADBDPlayer* _unhookingPlayer; // 0x718
	float _hookedCharacterSnapTime; // 0x720
	ACamperPlayer* _playerBeingUnhooked; // 0x728
};

struct UUMGCloseTooltipWidget : UMobileBaseUserWidget {
	UButton* FullScreenButton; // 0x300
};

struct USourceEffectEQPreset : USoundEffectSourcePreset {
	FSourceEffectEQSettings Settings; // 0x80
};

struct UIsHighestLevelAndClosestOriginatingEffect : UGameplayModifierCondition {
	TArray<UStatusEffect*> _applicableEffects; // 0xd0
};

struct UNoiseField : UFieldNodeFloat {
	float MinRange; // 0xb8
	float MaxRange; // 0xbc
	FTransform Transform; // 0xc0
};

struct UShapePounceAttackOpenSubstate : UPounceAttackOpenSubstate {
	TArray<FDBDTunableRowHandle> _tierDurations; // 0x130
};

struct UChargerComponent : UActorComponent {
	FString ChargerComponentID; // 0xc0
	FMulticastInlineDelegate OnChargeStateChange; // 0xd0
	FMulticastInlineDelegate OnChargePercentChange; // 0xe0
	EEnergyTypeEnum EnergyType; // 0x108
	float _currentEnergyLevel; // 0x10c
	float _maxEnergyLevel; // 0x110
};

struct UUMGRitualClaimRewardButton : UUMGBaseButtonWidget {
	FMulticastInlineDelegate OnPressedAnimationCompleted; // 0x430
	UCanvasPanel* ClaimFxPanel; // 0x440
};

struct UPrimitivesRegistererComponent : UActorComponent {
	TArray<UPrimitiveComponent*> _primitives; // 0xb8
	TWeakObjectPtr<UPrimitiveCollection> _primitiveCollection; // 0xc8
};

struct UNearMeEvaluatorCondition : UEvaluatorCondition {
	bool _questOwnerCanBeSubjectOfEvent; // 0x4c
};

struct ADBDPlayerController : ADBDPlayerControllerBase {
	FMulticastInlineDelegate OnPawnLeavingGame; // 0x640
	FMulticastInlineDelegate OnLocallyObservedChanged; // 0x650
	ANetworkFenceActor* _theFence; // 0x6f8
	UDBDBaseInputHandler* _inputHandler; // 0x708
	APawn* _aiPawn; // 0x838
	EPlayerRole _controllerGameRole; // 0x848
};

struct UAutodidact : UPerk {
	int32_t _maxTokenCountPerLevel[0x3]; // 0x3d0
	float _progressionBonusPerToken; // 0x3dc
	float _initialSkillCheckProgressionPenalty; // 0x3e0
};

struct ATestMovableActor : AActor {
	UBoxComponent* BoxComponent; // 0x230
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x140
};

struct UUMGStatusEffectsWidget : UMobileBaseUserWidget {
	TSoftClassPtr<UObject> AtlantaStatusEffectIconClass; // 0x300
	UHorizontalBox* StatusEffectsBox; // 0x330
	TMap<FName, UUMGStatusEffectIcon*> _statusEffectsMap; // 0x338
};

struct UUMGAuthenticationProviderSelection : UUserWidget {
	bool _isAsia; // 0x260
};

struct UAB_Menu_Slasher05_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x328
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x418
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4b8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x558
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x590
	bool Role Selected; // 0x640
	bool Is Online; // 0x641
};

struct UItemAddon : UItemModifier {
	ACollectable* BaseItemType; // 0x280
	bool _needsSetup; // 0x288
	FItemAddonInitializationData _addonInitializationData; // 0x289
};

struct UMapActorComponent : UActorComponent {
	EMapActorCategory Category; // 0xb8
	UPrimitiveComponent* _mapActorCollider; // 0xc0
	bool _detectionEnabled; // 0xe0
};

struct UFieldSystemComponent : UPrimitiveComponent {
	UFieldSystem* FieldSystem; // 0x428
	TArray<TSoftObjectPtr<AChaosSolverActor>> SupportedSolvers; // 0x440
};

struct UUMGGenericPopup : UMobileBaseUserWidget {
	URichTextBlock* Title; // 0x300
	UUMGHtmlRichText* Message; // 0x308
	UImage* TitleBackground; // 0x310
	UImage* TitleSmoke; // 0x318
	UUMGPopupButton* RegressionPopupButton; // 0x320
	UUMGPopupButton* AlternativePopupButton; // 0x328
	UUMGPopupButton* ProgressionPopupButton; // 0x330
	FSlateColor ErrorTitleSmokeColor; // 0x338
	FSlateColor ErrorTitleBackgroundColor; // 0x360
	FSlateColor DefaultTitleSmokeColor; // 0x388
	FSlateColor DefaultTitleBackgroundColor; // 0x3b0
};

struct UOnlineHotfixManager : UObject {
	FString OssName; // 0x1e8
	FString HotfixManagerClassName; // 0x1f8
	FString DebugPrefix; // 0x208
	TArray<UObject*> AssetsHotfixedFromIniFiles; // 0x218
};

struct UAB_K24_SW00_Menu_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x300
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x328
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x350
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3a0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x418
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x450
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x500
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x578
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5b0
	bool _switchInterrupt2; // 0x660
	int32_t _animSwitch; // 0x664
};

struct UAtlantaHudDirectionalStick : UMobileBaseUserWidget {
	UCanvasPanel* JoystickAnimationPanel; // 0x300
	UCanvasPanel* ContainerToRotate; // 0x308
	UCanvasPanel* ArrowsContainer; // 0x310
	UImage* JoystickLockImage; // 0x318
	UImage* JoystickOn; // 0x320
	UCanvasPanel* AutoRunContainer; // 0x328
	bool _isMovementLockAnimationActive; // 0x330
};

struct AGameStateBase : AInfo {
	AGameModeBase* GameModeClass; // 0x230
	AGameModeBase* AuthorityGameMode; // 0x238
	ASpectatorPawn* SpectatorClass; // 0x240
	TArray<APlayerState*> PlayerArray; // 0x248
	bool bReplicatedHasBegunPlay; // 0x258
	float ReplicatedWorldTimeSeconds; // 0x25c
	float ServerWorldTimeSecondsDelta; // 0x260
	float ServerWorldTimeSecondsUpdateFrequency; // 0x264
};

struct UCorrectiveAction : UPerk {
	float _startingTokens[0x3]; // 0x3d0
	FName _statusEffectName; // 0x3dc
	FGameplayTagContainer _allowedInteractionSemanticsForToken; // 0x3e8
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x340
	USkeleton* TargetSkeleton; // 0x350
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x358
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x368
	TArray<FName> SyncGroupNames; // 0x438
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x448
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x458
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x4a8
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x558
};

struct UUniqueTargetIncrementQEEvaluator : UQuestEventEvaluatorBase {
	TSet<TWeakObjectPtr<AActor>> _targetList; // 0x90
};

struct UUVProjectionToolProperties : UInteractiveToolPropertySet {
	EUVProjectionMethod UVProjectionMethod; // 0x58
	FVector ProjectionPrimitiveScale; // 0x5c
	float CylinderProjectToTopOrBottomAngleThreshold; // 0x68
	FVector2D UVScale; // 0x6c
	FVector2D UVOffset; // 0x74
	bool bWorldSpaceUVScale; // 0x7c
};

struct UBloodOrbCollection : UActorComponent {
	TArray<ABloodOrb*> _bloodOrbs; // 0xb8
};

struct ADynamicGrass : AActor {
	UMaterialParameterCollection* _worldSettings; // 0x230
};

struct UMovieSceneAkAudioEventSection : UMovieSceneSection {
	UAkAudioEvent* Event; // 0x128
	bool RetriggerEvent; // 0x130
	int32_t ScrubTailLengthMs; // 0x134
	bool StopAtSectionEnd; // 0x138
	FString EventName; // 0x140
	float MaxSourceDuration; // 0x170
	FString MaxDurationSourceID; // 0x178
};

struct UUMGAtlantaMatchConfigScreen : UMobileBaseUserWidget {
	UUMGAtlantaMatchConfigPageScroll* MatchConfigPageScroll; // 0x300
	UHorizontalBox* TabsBox; // 0x308
	UVerticalBox* BotsTabsBox; // 0x310
	UUMGBaseButtonWidget* BackButton; // 0x318
	UTextBlock* MatchConfigTitle; // 0x320
	UTextBlock* InventoryTitle; // 0x328
	UTextBlock* SelectedTabTitle; // 0x330
	UMatchConfigTabsDataAsset* TabsDataAsset; // 0x338
	FSlateBrush SmallTabSeparation; // 0x340
	FSlateBrush BigTabSeparation; // 0x3d0
	float TabsVerticalPadding; // 0x460
	float TabsHorizontalPadding; // 0x464
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x60
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x30
	FString PinToolTip; // 0x40
	EEdGraphPinDirection Direction; // 0x50
	FEdGraphPinType PinType; // 0x58
	FString defaultValue; // 0xc8
	FString AutogeneratedDefaultValue; // 0xd8
	UObject* DefaultObject; // 0xe8
	FText DefaultTextValue; // 0xf0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0x108
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0x118
	UEdGraphPin_Deprecated* ParentPin; // 0x128
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x130
};

struct UAB_Menu_Slasher03_C : UBaseMenuAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x300
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x328
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x350
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3a0
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x418
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x450
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x500
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x578
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x5b0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x628
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x660
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x710
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x788
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x828
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8c8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x940
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x978
	bool Role Selected; // 0xa28
	bool Is Online; // 0xa29
	int32_t RandomInterrupt; // 0xa2c
};

struct ABandwidthTestActor : AActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x230
};

struct UAddon_TormentMode_18 : USpawnEffectsOnAllSurvivorsBaseAddon {
	float _obliviousDuration; // 0x2a8
};

struct UBloodTrailComponent : UActorComponent {
	UBloodTrailSettings* _bloodTrailSettings; // 0xb8
	TMap<UDBDDecalComponent*, FBloodDecal> _bloodDecals; // 0x140
	UBloodDecalEffect* _bloodDecalEffect; // 0x190
	UDecalSpawner* _decalSpawner; // 0x228
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x70
};

struct ULoadingImagesDataProvider : UObject {
	TMap<FName, FLoadingImages> _cachedLoadingImages; // 0x30
	UDynamicContentHolder* _owningDynamicContentHolder; // 0x80
};

struct UAICharacterEscapeCarriedData : UAICharacterBehaviourData {
	bool _preventWiggleSuccess; // 0x30
};

struct UButtonPressTracker : ULocalPlayerSubsystem {
	TWeakObjectPtr<UInputComponent> _trackedInputComponent; // 0x50
	TWeakObjectPtr<UPlayerInput> _playerInput; // 0x58
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb8
	FVector Position; // 0xbc
};

struct UAICharacterHideInLockerBehaviourData : UAICharacterBehaviourData {
	ECharacterMovementTypes characterMovementType; // 0x38
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x38
	char bApplyOwnerScale : 1; // 0x38
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x50
	bool bOptimizeDuplicatedNodes; // 0x51
	bool bImportMats; // 0x52
	FString MatsPath; // 0x58
	bool bImportVar; // 0x68
	bool bCleanVar; // 0x69
	FString VarPath; // 0x70
	bool bImportLightInfo; // 0x80
	FString LightInfoPath; // 0x88
	bool bImportClipInfo; // 0x98
	FString ClipInfoPath; // 0xa0
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2f8
	FSpectatorReservation PendingReservation; // 0x308
	ESpectatorClientRequestType RequestType; // 0x380
	bool bPendingReservationSent; // 0x381
	bool bCancelReservation; // 0x382
};

struct ULuminARCandidateImage : UARCandidateImage {
	bool bUseUnreliablePose; // 0x60
	bool bImageIsStationary; // 0x61
};

struct UMediaTexture : UTexture {
	TextureAddress AddressX; // 0xc0
	TextureAddress AddressY; // 0xc1
	bool AutoClear; // 0xc2
	FLinearColor ClearColor; // 0xc4
	bool EnableGenMips; // 0xd4
	char NumMips; // 0xd5
	UMediaPlayer* MediaPlayer; // 0xd8
};

struct UGameplayModifierContainer : UBaseModifierContainer {
	FModifierTickableConditionReplicatedData _tickableConditionsData; // 0x188
	TArray<FName> _tags; // 0x1a0
	bool UseApplyFunction; // 0x1b0
	bool BroadcastStatusView; // 0x1b1
	FName StatusViewID; // 0x1b4
	bool _autoInitializeOnBeginPlay; // 0x1c0
	bool _canOptimizeTickActivation; // 0x1c1
	UTimerObject* _activationTimer; // 0x210
};

struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x4e8
	int32_t NumCustomDataFloats; // 0x4f8
	TArray<float> PerInstanceSMCustomData; // 0x500
	int32_t InstancingRandomSeed; // 0x510
	int32_t InstanceStartCullDistance; // 0x514
	int32_t InstanceEndCullDistance; // 0x518
	TArray<int32_t> InstanceReorderTable; // 0x520
	int32_t NumPendingLightmaps; // 0x578
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x580
};

struct UCustomizationDescription : UDataAsset {
	TArray<FCustomizedMeshPart> Parts; // 0x38
};

struct ULightingHelper : UObject {
	ABaseSky* _levelLighting; // 0x30
	ABaseSky* _levelLightingFixed; // 0x38
	ABaseSky* _levelLightingSpawned; // 0x40
	ABaseSky* _levelLightingWithoutExposure; // 0x48
	AActor* _adaptiveShadowMapControllersActor; // 0x50
	ULightingInterpolator* _lightingInterpolator; // 0x58
	ULightingFactory* _lightingFactory; // 0x60
	UPostProcessComponent* _postProcessCache; // 0x68
	bool _bIsDreamworldActive; // 0x70
};

struct UUMGLevelBannerWidget : UMobileBaseUserWidget {
	UButton* TooltipButton; // 0x308
	UTextBlock* PlayerLevelText; // 0x310
	UTextBlock* PlayerDevotionText; // 0x318
	UTextBlock* PlayerCurrentExperienceText; // 0x320
	UTextBlock* PlayerNextLevelExperienceText; // 0x328
	UProgressBar* XPProgressBar; // 0x330
	UHorizontalBox* XPTextContainer; // 0x338
	UAkAudioEvent* OnLongPressSound; // 0x340
	UImage* TooltipHighlightPicture; // 0x348
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
};

struct UPerspectiveEffectActivator : UActorComponent {
	TMap<FName, FPerspectiveEffectData> _perspectiveEffects; // 0xc8
};

struct UMaterialExpressionSceneColor : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x48
	FExpressionInput Input; // 0x4c
	FExpressionInput OffsetFraction; // 0x68
	FVector2D ConstInput; // 0x84
};

struct UUMGShadersPrecompilingProgressionWidget : UMobileBaseUserWidget {
	UProgressBar* _progressBar; // 0x300
	UTextBlock* _progressionText; // 0x308
};

struct USpineChillPerk : UPerk {
	float _actionSpeed[0x3]; // 0x3d0
};

struct UAimableComponent : UActorComponent {
	TArray<AActor*> _occlusionIgnoredActors; // 0xc0
	float _maxAimDistance; // 0xd0
	UAimDirectionProvider* _aimDirectionProvider; // 0xd8
	bool _useOcclusion; // 0xe0
	float _aimPointLerpFactor; // 0xe4
	TArray<UAimPointProcessor*> _preOcclusionAimPointProcessors; // 0xe8
};

struct UDedicatedServerHandlerComponent : UActorComponent {
	FAtlantaRitualSet _atlantaRituals; // 0xb8
};

struct UAssetLibraryManager : UObject {
	UObject* _worldContextObject; // 0x40
	TMap<int32_t, UCharacterItemsAssetLibrary*> _characterItemsAssetLibrary; // 0x48
	UIniAssetLibrary* _globalAssetLibrary; // 0x98
	UMenuAssetLibrary* _menuAssetLibrary; // 0xa0
	UGameAssetLibrary* _gameAssetLibrary; // 0xa8
	UTutorialAssetLibrary* _tutorialAssetLibrary; // 0xb0
	Ushopmanager* _shopManager; // 0xc0
	TArray<FAssetLibraryLoader> _loadingList; // 0xd8
	int32_t CharacterItemsAssetLoadCountPerChunk; // 0xe8
	int32_t BlindPackAssetLoadCountPerChunk; // 0xec
	int32_t MenuAssetLoadCountPerChunk; // 0xf0
	int32_t GlobalAssetLoadCountPerChunk; // 0xf4
	int32_t GameAssetLoadCountPerChunk; // 0xf8
};

struct UAddon_K24_19 : UImposeStatusEffectOnEventAddon {
	AZombieEscapeDoorPointsActor* _zombieEscapeDoorPointsActor; // 0x2c0
};

struct UAddon_K22Power_9 : USpawnEffectsOnAllSurvivorsBaseAddon {
	float _increaseDestroyTwinTime; // 0x2a8
};

struct UPaperSprite : UObject {
	TArray<UTexture*> AdditionalSourceTextures; // 0x40
	FVector2D BakedSourceUV; // 0x50
	FVector2D BakedSourceDimension; // 0x58
	UTexture2D* BakedSourceTexture; // 0x60
	UMaterialInterface* DefaultMaterial; // 0x68
	UMaterialInterface* AlternateMaterial; // 0x70
	TArray<FPaperSpriteSocket> Sockets; // 0x78
	ESpriteCollisionMode SpriteCollisionDomain; // 0x88
	float PixelsPerUnrealUnit; // 0x8c
	UBodySetup* BodySetup; // 0x90
	int32_t AlternateMaterialSplitIndex; // 0x98
	TArray<FVector4> BakedRenderData; // 0xa0
};

struct UDisplayStandCurrencyRequesterComponent : UActorComponent {
	UObject* _menuCurrencyDisplayableClass; // 0xc0
};

struct UParticleModuleAcceleration : UParticleModuleAccelerationBase {
	FRawDistributionVector Acceleration; // 0x40
	char bApplyOwnerScale : 1; // 0x88
};

struct UAkAndroidInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAndroidAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UGeometryCacheTrackStreamable : UGeometryCacheTrack {
	UGeometryCacheCodecBase* Codec; // 0x60
	float StartSampleTime; // 0xd0
};

struct USocialParty : UObject {
	APartyBeaconClient* ReservationBeaconClientClass; // 0x60
	ASpectatorBeaconClient* SpectatorBeaconClientClass; // 0x68
	FUniqueNetIdRepl OwningLocalUserId; // 0x80
	FUniqueNetIdRepl CurrentLeaderId; // 0xa8
	TMap<FUniqueNetIdRepl, UPartyMember*> PartyMembersById; // 0xd0
	bool bEnableAutomaticPartyRejoin; // 0x120
	APartyBeaconClient* ReservationBeaconClient; // 0x1a0
	ASpectatorBeaconClient* SpectatorBeaconClient; // 0x1b8
};

struct UPalletPullUpInteraction : UChargeableInteractionDefinition {
	EPalletSide _side; // 0x6d8
	APallet* _owningPallet; // 0x6e0
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x48
};

struct AClipManager : AActor {
	TArray<UDBDClipRegionComponent*> _clippingZones; // 0x230
	TSet<UMeshComponent*> _meshComponents; // 0x240
	TArray<FMaterialOriginalState> _dissolvedMeshes; // 0x290
	TMap<UMaterialInterface*, UMaterialInterface*> _normal2dissolve; // 0x2a0
	TMap<UMaterialInterface*, UMaterialInterface*> _dissolve2normal; // 0x2f0
	UDataTable* _sphericalDissolveMaterials; // 0x340
};

struct UInterpTrackParticleReplay : UInterpTrack {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0x78
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x30
