// Created by BlueFire1337
// Updated 2022-02-01
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x4983f80;
	constexpr auto GObjects = 0x49c0530;
	constexpr auto GWorld = 0x4b06000;
}

struct UGridPathFollowingComponent : UPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x250
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UMaterialExpressionShadowReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Shadow; // 0x54
};

struct UTextureRenderTarget2D : UTextureRenderTarget {
	int32_t SizeX; // 0x180
	int32_t SizeY; // 0x184
	FLinearColor ClearColor; // 0x188
	TextureAddress AddressX; // 0x198
	TextureAddress AddressY; // 0x199
	char bForceLinearGamma : 1; // 0x19a
	char bHDR : 1; // 0x19a
	char bGPUSharedFlag : 1; // 0x19a
	ETextureRenderTargetFormat RenderTargetFormat; // 0x19b
	char bAutoGenerateMips : 1; // 0x19c
	TextureFilter MipsSamplerFilter; // 0x19d
	TextureAddress MipsAddressU; // 0x19e
	TextureAddress MipsAddressV; // 0x19f
	EPixelFormat OverrideFormat; // 0x1a0
};

struct USourceEffectEQPreset : USoundEffectSourcePreset {
	FSourceEffectEQSettings Settings; // 0xa0
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xf0
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UMovieSceneCameraShakeSourceTriggerTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x98
};

struct UMaterialExpressionSign : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct UAudioCurveSourceComponent : UAudioComponent {
	FName CurveSourceBindingName; // 0x868
	float CurveSyncOffset; // 0x870
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7b0
};

struct AStaticMeshActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	bool bStaticMeshReplicateMovement; // 0x228
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UWindowTitleBarAreaSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UClothingAssetBase : UObject {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UDefaultLevelSequenceInstanceData : UObject {
	AActor* TransformOriginActor; // 0x30
	FTransform TransformOrigin; // 0x40
};

struct At_Tool_C : ASFPSBaseItem {
	UBoxComponent* Trace; // 0x310
	UStaticMeshComponent* Mesh; // 0x318
};

struct UMediaSoundComponent : USynthComponent {
	EMediaSoundChannels Channels; // 0x6c0
	bool DynamicRateAdjustment; // 0x6c4
	float RateAdjustmentFactor; // 0x6c8
	FFloatRange RateAdjustmentRange; // 0x6cc
	UMediaPlayer* MediaPlayer; // 0x6e0
};

struct ULevelStreaming : UObject {
	TSoftObjectPtr<UWorld> WorldAsset; // 0x28
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	int32_t LevelLODIndex; // 0xb0
	int32_t StreamingPriority; // 0xb4
	char bShouldBeVisible : 1; // 0xba
	char bShouldBeLoaded : 1; // 0xba
	char bLocked : 1; // 0xba
	char bIsStatic : 1; // 0xba
	char bShouldBlockOnLoad : 1; // 0xba
	char bShouldBlockOnUnload : 1; // 0xbb
	char bDisableDistanceStreaming : 1; // 0xbb
	char bDrawOnLevelStatusMap : 1; // 0xbb
	FLinearColor LevelColor; // 0xbc
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	FMulticastInlineDelegate OnLevelLoaded; // 0xe8
	FMulticastInlineDelegate OnLevelUnloaded; // 0xf8
	FMulticastInlineDelegate OnLevelShown; // 0x108
	FMulticastInlineDelegate OnLevelHidden; // 0x118
	ULevel* LoadedLevel; // 0x128
	ULevel* PendingUnloadLevel; // 0x130
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ASFPSGameplayEventPoint : ASFPSGameplayPoint {
	TArray<FVector> RewardPointLocations; // 0x238
	float Radius; // 0x248
};

struct UFormMap_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* btnExit; // 0x270
	UButton* btnMain; // 0x278
	UButton* btnRespawn; // 0x280
	UImage* imgRespawn; // 0x288
	UTextBlock* lbExit; // 0x290
	UNamedSlot* nsHint; // 0x298
	USFPSUserWidget_MapElement* SelectedMapElement; // 0x2a0
	bool WheelUp; // 0x2a8
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct ASceneCapture2D : ASceneCapture {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x230
};

struct AProjectile_C : ASFPSProjectile {
	USceneComponent* DefaultSceneRoot; // 0x310
};

struct Aweapon_firearms_gun_c1911_C : At_FireArm_C {
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e0
	UStaticMeshComponent* MagazineFull; // 0x7e8
	UStaticMeshComponent* MagazineEmpty; // 0x7f0
};

struct USFPSPhysicalMaterial : UPhysicalMaterial {
	float EnergyDrain; // 0x80
	bool bDropWoodLogs; // 0x84
	ASFPSBaseItem* WoodLogsRef; // 0x88
	int32_t WoodLogsCount; // 0x90
	int32_t NeedAttackCountForWoodLogsDrop; // 0x94
	USFPSPhysMatSoundTable* PhysMaterialProp; // 0x98
	bool bWaterMaterial; // 0xa0
	float VehicleResists[0x7]; // 0xa4
	float VehicleDamage[0x7]; // 0xc0
};

struct ABMF_Workbench_01_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
};

struct USFPSActorLibrary : UObject {
	TArray<FSFPSActorLibraryGroupForSortedByName> GroupsSortedByName; // 0x28
	TArray<FSFPSActorLibraryGroup> Groups; // 0x38
};

struct UMovieSceneEntitySystemLinker : UObject {
	FMovieSceneEntitySystemGraph SystemGraph; // 0x298
};

struct UMenuAnchor : UContentWidget {
	UUserWidget* MenuClass; // 0x120
	FDelegate OnGetMenuContentEvent; // 0x128
	FDelegate OnGetUserMenuContentEvent; // 0x138
	EMenuPlacement Placement; // 0x148
	bool bFitInWindow; // 0x149
	bool ShouldDeferPaintingAfterWindowContent; // 0x14a
	bool UseApplicationMenuStack; // 0x14b
	FMulticastInlineDelegate OnMenuOpenChanged; // 0x150
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x478
	int32_t MapHeight; // 0x47c
	int32_t TileWidth; // 0x480
	int32_t TileHeight; // 0x484
	UPaperTileSet* DefaultLayerTileSet; // 0x488
	UMaterialInterface* Material; // 0x490
	TArray<UPaperTileLayer*> TileLayers; // 0x498
	FLinearColor TileMapColor; // 0x4a8
	int32_t UseSingleLayerIndex; // 0x4b8
	bool bUseSingleLayer; // 0x4bc
	UPaperTileMap* TileMap; // 0x4c0
};

struct UCableComponent : UMeshComponent {
	bool bAttachStart; // 0x478
	bool bAttachEnd; // 0x479
	FComponentReference AttachEndTo; // 0x480
	FName AttachEndToSocketName; // 0x4a8
	FVector EndLocation; // 0x4b0
	float CableLength; // 0x4bc
	int32_t NumSegments; // 0x4c0
	float SubstepTime; // 0x4c4
	int32_t SolverIterations; // 0x4c8
	bool bEnableStiffness; // 0x4cc
	bool bUseSubstepping; // 0x4cd
	bool bSkipCableUpdateWhenNotVisible; // 0x4ce
	bool bSkipCableUpdateWhenNotOwnerRecentlyRendered; // 0x4cf
	bool bEnableCollision; // 0x4d0
	float CollisionFriction; // 0x4d4
	FVector CableForce; // 0x4d8
	float CableGravityScale; // 0x4e4
	float CableWidth; // 0x4e8
	int32_t NumSides; // 0x4ec
	float TileMaterial; // 0x4f0
};

struct AUltra_Dynamic_Sky_BP_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* moon_plane; // 0x228
	UArrowComponent* Arrow; // 0x230
	UArrowComponent* Sun_Root; // 0x238
	UStaticMeshComponent* Ultra_Dynamic_Sky_Sphere; // 0x240
	USceneComponent* DefaultSceneRoot; // 0x248
	ADirectionalLight* Direction Light (Sun); // 0x250
	UMaterialInstanceDynamic* UDM_mat; // 0x258
	bool Refresh Settings; // 0x260
	float Cloud Speed; // 0x264
	float Cloud Density; // 0x268
	float Cloud Wisps Opacity; // 0x26c
	TArray<UCurveLinearColor*> Horizon Base Color Curve; // 0x270
	TArray<UCurveLinearColor*> Zenith Base Color Curve; // 0x280
	TArray<UCurveLinearColor*> Cloud Light Color Curve; // 0x290
	TArray<UCurveLinearColor*> Cloud Dark Color Curve; // 0x2a0
	float Time of Day; // 0x2b0
	TArray<UCurveLinearColor*> Sun Color Curve; // 0x2b8
	UCurveFloat* Shine Intensity Curve; // 0x2c8
	float Saturation; // 0x2d0
	UCurveLinearColor* Sun Cloudy Color Curve; // 0x2d8
	AExponentialHeightFog* Exponential Height Fog; // 0x2e0
	UCurveFloat* Stars Intensity Curve; // 0x2e8
	float Cloud Phase; // 0x2f0
	float Moon Scale; // 0x2f4
	float Moon Inclination; // 0x2f8
	float Moon Phase; // 0x2fc
	bool Automatically Set Advanced Settings using Time of Day; // 0x300
	float Stars Visibility; // 0x304
	float Moon Intensity; // 0x308
	float Moon Position; // 0x30c
	float Sun Angle; // 0x310
	FLinearColor Horizon Base Color; // 0x314
	FLinearColor Zenith Base Color; // 0x324
	FLinearColor Cloud Light Color; // 0x334
	FLinearColor Cloud Dark Color; // 0x344
	FLinearColor Sun Color; // 0x354
	float Cloud Shine Intensity; // 0x364
	FLinearColor Sun Light Color; // 0x368
	float Day Length; // 0x378
	UCurveFloat* Moon Position Curve; // 0x380
	bool Night Cycle; // 0x388
	bool Simulate Cloud Density Changes; // 0x389
	float Cloud Density Shift Frequency (min); // 0x38c
	float Cloud Density Shift Frequency (max); // 0x390
	float Cloud Density_target; // 0x394
	float Cloud Density Change (Smoothing); // 0x398
	float Cloud Opacity; // 0x39c
	float Overall Intensity; // 0x3a0
	float Sun Brightness; // 0x3a4
	FLinearColor Moon Color; // 0x3a8
	float Shine Variation; // 0x3b8
	float Sun Lighting Intensity; // 0x3bc
	UCurveFloat* Sun Highlight Radius_curve; // 0x3c0
	float Sun Highlight Radius; // 0x3c8
	bool First Day; // 0x3cc
	bool Simulate Moon Phase Changes; // 0x3cd
	float Stars_Intensity; // 0x3d0
	FLinearColor Stars_Color; // 0x3d4
	float Moon Orbit Offset; // 0x3e4
	FRotator Sun Rotation; // 0x3e8
	float Sun Radius; // 0x3f4
	UMaterialInstanceDynamic* Cloud Shadows MID; // 0x3f8
	bool Use Cloud Shadows; // 0x400
	float Cloud Shadows Scale; // 0x404
	float Cloud Shadows Intensity; // 0x408
	ADirectionalLight* Moon Light; // 0x410
	bool Manually Select Sun Color; // 0x418
	bool Automatically Set Moon Light Rotation; // 0x419
	bool Automatically Set Sun Light Rotation; // 0x41a
	float Moonlight Intensity; // 0x41c
	float Stars Speed; // 0x420
	float Sun Inclination; // 0x424
	float Sun Yaw; // 0x428
	float Moon Rotation; // 0x42c
	UTexture2D* Custom Moon Texture; // 0x430
	bool Use Custom Moon Texture; // 0x438
	ASkyLight* SkyLight; // 0x440
	bool Recapture Sky light periodically; // 0x448
	float Sky Light recapture period; // 0x44c
	UCurveFloat* Night Filter Curve; // 0x450
	float Night brightness; // 0x458
	float Moon Glow Intensity; // 0x45c
	UCurveFloat* Directional_Intensity_Curve; // 0x460
	float Sun_Light_Intensity; // 0x468
	float Aurora Intensity; // 0x46c
	float Aurora Speed; // 0x470
	bool Use Fast Skylight; // 0x474
	bool Use Auroras; // 0x475
	UTexture* Clouds Base Texture; // 0x478
	float Cloud Tiling; // 0x480
	float Cloud Direction; // 0x484
	bool One cloud layer; // 0x488
	float Cloud Height 1; // 0x48c
	float Cloud Height 2; // 0x490
	int32_t color_scheme; // 0x494
	UMaterialInstanceDynamic* Moon mat; // 0x498
	float Moon Angle; // 0x4a0
	APostProcessVolume* Postprocess Volume; // 0x4a8
	UMaterialInstanceDynamic* MIDFog; // 0x4b0
	UCurveLinearColor* Fog Color Curve; // 0x4b8
	bool UpdateTimeOfDay; // 0x4c0
	UCurveLinearColor* SkyLightColorCurve; // 0x4c8
};

struct UAnimationSharingSetup : UObject {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	FScrollBarStyle ScrollBarStyle; // 0x30
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UAnimBoneCompressionCodec : UObject {
	FString Description; // 0x28
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraShakePlaySpace PlaySpace; // 0x78
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x270
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x278
	APlayerCameraManager* BaseCamera; // 0x280
	FTransform RelativeTransform; // 0x290
	float BaseFOV; // 0x2c0
	char bAllowMultipleInstances : 1; // 0x2c4
	char bResetWhenRetriggered : 1; // 0x2c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x2c8
	float DistFromCamera; // 0x2d8
};

struct UMaterialExpressionSamplePhysicsVectorField : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
	EFieldVectorType FieldTarget; // 0x54
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct USFPSACMission : USFPSACGameplayEvent {
	TArray<USceneComponent*> RewardPoints; // 0x250
	TArray<ASFPSLootBox*> RewardLootBoxes; // 0x260
	ASFPSLootBox* RewardLootBoxClass; // 0x278
	TArray<FSFPSMissionVariant> Variants; // 0x280
	int32_t WaitTime; // 0x294
	int32_t CompletedTime; // 0x298
};

struct UCameraShakeBase : UObject {
	bool bSingleInstance; // 0x28
	float ShakeScale; // 0x2c
	UCameraShakePattern* RootShakePattern; // 0x30
	APlayerCameraManager* CameraManager; // 0x38
};

struct UBlackboardComponent : UActorComponent {
	UBrainComponent* BrainComp; // 0xb0
	UBlackboardData* DefaultBlackboardAsset; // 0xb8
	UBlackboardData* BlackboardAsset; // 0xc0
	TArray<UBlackboardKeyType*> KeyInstances; // 0xe8
};

struct AIntervalGizmoActor : AGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x220
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x228
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x230
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xc0
};

struct UConnectionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AActor : UObject {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bHidden : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bForceNetAddressable : 1; // 0x58
	char bExchangedRoles : 1; // 0x59
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bBlockInput : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5b
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x170
	FMulticastSparseDelegate OnTakeAnyDamage; // 0x180
	FMulticastSparseDelegate OnTakePointDamage; // 0x181
	FMulticastSparseDelegate OnTakeRadialDamage; // 0x182
	FMulticastSparseDelegate OnActorBeginOverlap; // 0x183
	FMulticastSparseDelegate OnActorEndOverlap; // 0x184
	FMulticastSparseDelegate OnBeginCursorOver; // 0x185
	FMulticastSparseDelegate OnEndCursorOver; // 0x186
	FMulticastSparseDelegate OnClicked; // 0x187
	FMulticastSparseDelegate OnReleased; // 0x188
	FMulticastSparseDelegate OnInputTouchBegin; // 0x189
	FMulticastSparseDelegate OnInputTouchEnd; // 0x18a
	FMulticastSparseDelegate OnInputTouchEnter; // 0x18b
	FMulticastSparseDelegate OnInputTouchLeave; // 0x18c
	FMulticastSparseDelegate OnActorHit; // 0x18d
	FMulticastSparseDelegate OnDestroyed; // 0x18e
	FMulticastSparseDelegate OnEndPlay; // 0x18f
	TArray<UActorComponent*> InstanceComponents; // 0x1f0
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x200
};

struct UConsole : UObject {
	ULocalPlayer* ConsoleTargetPlayer; // 0x38
	UTexture2D* DefaultTexture_Black; // 0x40
	UTexture2D* DefaultTexture_White; // 0x48
	TArray<FString> HistoryBuffer; // 0x68
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UGeometryCacheComponent : UMeshComponent {
	UGeometryCache* GeometryCache; // 0x478
	bool bRunning; // 0x480
	bool bLooping; // 0x481
	bool bExtrapolateFrames; // 0x482
	float StartTimeOffset; // 0x484
	float PlaybackSpeed; // 0x488
	float MotionVectorScale; // 0x48c
	int32_t NumTracks; // 0x490
	float ElapsedTime; // 0x494
	float Duration; // 0x4cc
	bool bManualTick; // 0x4d0
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x450
	UBodySetup* BrushBodySetup; // 0x458
};

struct ULevelSequenceAnimSequenceLink : UAssetUserData {
	TArray<FLevelSequenceAnimSequenceLinkItem> AnimSequenceLinks; // 0x28
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct AProjectileGrenade_C : ASFPSProjectileGrenade {
	UProjectileMovementComponent* ProjectileMovement; // 0x430
	UStaticMeshComponent* Mesh; // 0x438
};

struct Aweapon_firearms_gun_fiveseven_C : At_FireArm_C {
	UStaticMeshComponent* DeviceLeftMount; // 0x7e0
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e8
	UStaticMeshComponent* MagazineFull; // 0x7f0
	UStaticMeshComponent* MagazineEmpty; // 0x7f8
};

struct ABM_Floor_01_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UMaterialExpressionDepthFade : UMaterialExpression {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct UAutoDestroySubsystem : UTickableWorldSubsystem {
	TArray<AActor*> ActorsToPoll; // 0x40
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x80
	float LpvBiasMultiplier; // 0x84
	TArray<FStaticMaterial> StaticMaterials; // 0x88
	float LightmapUVDensity; // 0x98
	int32_t LightMapResolution; // 0x9c
	int32_t LightMapCoordinateIndex; // 0xa0
	float DistanceFieldSelfShadowBias; // 0xa4
	UBodySetup* BodySetup; // 0xa8
	int32_t LODForCollision; // 0xb0
	char bGenerateMeshDistanceField : 1; // 0xb4
	char bStripComplexCollisionForConsole : 1; // 0xb4
	char bHasNavigationData : 1; // 0xb4
	char bSupportUniformlyDistributedSampling : 1; // 0xb4
	char bSupportPhysicalMaterialMasks : 1; // 0xb4
	char bSupportRayTracing : 1; // 0xb4
	char bIsBuiltAtRuntime : 1; // 0xb4
	char bAllowCPUAccess : 1; // 0xb5
	char bSupportGpuUniformlyDistributedSampling : 1; // 0xb5
	TArray<UStaticMeshSocket*> Sockets; // 0xd8
	FVector PositiveBoundsExtension; // 0xf8
	FVector NegativeBoundsExtension; // 0x104
	FBoxSphereBounds ExtendedBounds; // 0x110
	int32_t ElementToIgnoreForTexFactor; // 0x12c
	TArray<UAssetUserData*> AssetUserData; // 0x130
	UObject* EditableMesh; // 0x140
	UNavCollisionBase* NavCollision; // 0x148
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x90
	FVector GoalLocation; // 0x98
	float AcceptableRadius; // 0xa4
	UNavigationQueryFilter* FilterClass; // 0xa8
	char bAllowStrafe : 1; // 0xb0
	char bFinishOnOverlap : 1; // 0xb0
	char bUsePathfinding : 1; // 0xb0
	char bAllowPartialPath : 1; // 0xb0
	char bProjectGoalToNavigation : 1; // 0xb0
	char bUpdatePathToGoal : 1; // 0xb0
	char bAbortChildActionOnPathChange : 1; // 0xb0
};

struct UQuartzClockHandle : UObject {
	UQuartzSubsystem* QuartzSubsystem; // 0x168
	UWorld* WorldPtr; // 0x188
};

struct ABMF_Sandbags_03_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision1; // 0x358
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x360
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x230
};

struct UGranularSynth : USynthComponent {
	USoundWave* GranulatedSoundWave; // 0x6c0
};

struct ULoudnessNRT : UAudioSynesthesiaNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UMaterialExpressionSubtract : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UCharacter_man_01_C : USFPSAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_162; // 0x3b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_251; // 0x548
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_290; // 0x5e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_289; // 0x610
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_288; // 0x638
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x660
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x7b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_287; // 0x868
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_286; // 0x890
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_285; // 0x8b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_161; // 0x8e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_250; // 0xa70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_66; // 0xb10
	FAnimNode_Fabrik AnimGraphNode_Fabrik_58; // 0xb30
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_66; // 0xcc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_284; // 0xce0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_249; // 0xd08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_283; // 0xda8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_282; // 0xdd0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_281; // 0xdf8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_280; // 0xe20
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_160; // 0xe48
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0xfd8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_159; // 0x1020
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_65; // 0x11b0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_57; // 0x11d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_65; // 0x1360
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_64; // 0x1380
	FAnimNode_Fabrik AnimGraphNode_Fabrik_56; // 0x13a0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_64; // 0x1530
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_279; // 0x1550
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_158; // 0x1578
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_248; // 0x1708
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_247; // 0x17a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_246; // 0x1848
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_157; // 0x18e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_245; // 0x1a78
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_156; // 0x1b18
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_244; // 0x1ca8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_243; // 0x1d48
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_155; // 0x1de8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_278; // 0x1f78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_277; // 0x1fa0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_154; // 0x1fc8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_96; // 0x2158
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_242; // 0x2220
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_276; // 0x22c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_275; // 0x22e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_274; // 0x2310
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_63; // 0x2338
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_63; // 0x2358
	FAnimNode_Fabrik AnimGraphNode_Fabrik_55; // 0x2380
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_241; // 0x2510
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_273; // 0x25b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_240; // 0x25d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_239; // 0x2678
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_238; // 0x2718
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_272; // 0x27b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_237; // 0x27e0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_62; // 0x2880
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_62; // 0x28a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_271; // 0x28c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_270; // 0x28e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_236; // 0x2910
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_269; // 0x29b0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_54; // 0x29e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x2b70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_268; // 0x2cc8
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x2cf0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x2d38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_267; // 0x2e90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_295; // 0x2eb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_294; // 0x2f38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_293; // 0x2fb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_292; // 0x3038
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_291; // 0x30b8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_15; // 0x3138
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_14; // 0x3208
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_266; // 0x32d8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_13; // 0x3300
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_265; // 0x33d0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_12; // 0x33f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_264; // 0x34c8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_11; // 0x34f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_263; // 0x35c0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_95; // 0x35e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_94; // 0x36b0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_93; // 0x3778
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_92; // 0x3840
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_91; // 0x3908
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_262; // 0x39d0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_153; // 0x39f8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_152; // 0x3b88
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x3d18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_261; // 0x3e70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_260; // 0x3e98
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_259; // 0x3ec0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_235; // 0x3ee8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_234; // 0x3f88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_258; // 0x4028
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_257; // 0x4050
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_151; // 0x4078
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_150; // 0x4208
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_149; // 0x4398
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_148; // 0x4528
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_147; // 0x46b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_256; // 0x4848
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_146; // 0x4870
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_233; // 0x4a00
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_232; // 0x4aa0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_231; // 0x4b40
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_145; // 0x4be0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_255; // 0x4d70
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_144; // 0x4d98
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_143; // 0x4f28
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_142; // 0x50b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_141; // 0x5248
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_140; // 0x53d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_139; // 0x5568
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_138; // 0x56f8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_137; // 0x5888
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_136; // 0x5a18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_135; // 0x5ba8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_230; // 0x5d38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_254; // 0x5dd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_229; // 0x5e00
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_228; // 0x5ea0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_253; // 0x5f40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_252; // 0x5f68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_290; // 0x5f90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_289; // 0x6010
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_90; // 0x6090
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_89; // 0x6158
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_251; // 0x6220
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_88; // 0x6248
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_288; // 0x6310
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_287; // 0x6390
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_87; // 0x6410
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_250; // 0x64d8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_86; // 0x6500
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_286; // 0x65c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_285; // 0x6648
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_284; // 0x66c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_283; // 0x6748
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_85; // 0x67c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_249; // 0x6890
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_84; // 0x68b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_83; // 0x6980
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_248; // 0x6a48
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_82; // 0x6a70
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_81; // 0x6b38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_247; // 0x6c00
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_80; // 0x6c28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_282; // 0x6cf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_281; // 0x6d70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_280; // 0x6df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_279; // 0x6e70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_227; // 0x6ef0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_226; // 0x6f90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_225; // 0x7030
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_224; // 0x70d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_223; // 0x7170
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_222; // 0x7210
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_221; // 0x72b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_220; // 0x7350
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_219; // 0x73f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_218; // 0x7490
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_217; // 0x7530
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_216; // 0x75d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_215; // 0x7670
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_214; // 0x7710
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_79; // 0x77b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_246; // 0x7878
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_78; // 0x78a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_77; // 0x7968
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_245; // 0x7a30
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_76; // 0x7a58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_278; // 0x7b20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_277; // 0x7ba0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_276; // 0x7c20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_275; // 0x7ca0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_51; // 0x7d20
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_61; // 0x7e28
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_61; // 0x7e48
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_50; // 0x7e68
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_49; // 0x7f70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_60; // 0x8078
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_60; // 0x8098
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_244; // 0x80b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_134; // 0x80e0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_133; // 0x8270
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x8400
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_274; // 0x84b0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_10; // 0x8530
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_273; // 0x8600
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_272; // 0x8680
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_9; // 0x8700
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_271; // 0x87d0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_8; // 0x8850
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_270; // 0x8920
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x89a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_243; // 0x8a70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_242; // 0x8a98
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_59; // 0x8ac0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_53; // 0x8ae0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_59; // 0x8c70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_241; // 0x8c90
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x8cb8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_58; // 0x8e10
	FAnimNode_Fabrik AnimGraphNode_Fabrik_52; // 0x8e30
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_58; // 0x8fc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_240; // 0x8fe0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_57; // 0x9008
	FAnimNode_Fabrik AnimGraphNode_Fabrik_51; // 0x9030
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_57; // 0x91c0
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x91e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_269; // 0x9228
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x92a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_239; // 0x9400
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_238; // 0x9428
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_237; // 0x9450
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_236; // 0x9478
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_132; // 0x94a0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_131; // 0x9630
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_130; // 0x97c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_235; // 0x9950
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_234; // 0x9978
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_56; // 0x99a0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_56; // 0x99c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_268; // 0x99e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_233; // 0x9a60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_232; // 0x9a88
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_55; // 0x9ab0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_50; // 0x9ad0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_55; // 0x9c60
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x9c80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_231; // 0x9d30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_267; // 0x9d58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_266; // 0x9dd8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_129; // 0x9e58
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_213; // 0x9fe8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_230; // 0xa088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_265; // 0xa0b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_229; // 0xa130
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_212; // 0xa158
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_228; // 0xa1f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_264; // 0xa220
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_211; // 0xa2a0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0xa340
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_227; // 0xa410
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_210; // 0xa438
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_226; // 0xa4d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_209; // 0xa500
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_225; // 0xa5a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_263; // 0xa5c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_224; // 0xa648
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_208; // 0xa670
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_223; // 0xa710
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_128; // 0xa738
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_207; // 0xa8c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_222; // 0xa968
	FAnimNode_Fabrik AnimGraphNode_Fabrik_49; // 0xa990
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_69; // 0xab20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_262; // 0xabe8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_48; // 0xac70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_54; // 0xae00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_54; // 0xae20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_221; // 0xae40
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_53; // 0xae68
	FAnimNode_Fabrik AnimGraphNode_Fabrik_47; // 0xae90
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_53; // 0xb020
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_206; // 0xb040
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_220; // 0xb0e0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_46; // 0xb110
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_52; // 0xb2a0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_52; // 0xb2c0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_68; // 0xb2e0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_51; // 0xb3a8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_45; // 0xb3d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_51; // 0xb560
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_67; // 0xb580
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_50; // 0xb648
	FAnimNode_Fabrik AnimGraphNode_Fabrik_44; // 0xb670
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_50; // 0xb800
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_49; // 0xb820
	FAnimNode_Fabrik AnimGraphNode_Fabrik_43; // 0xb840
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_49; // 0xb9d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_219; // 0xb9f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_205; // 0xba18
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_48; // 0xbab8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_42; // 0xbae0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_48; // 0xbc70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_218; // 0xbc90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_204; // 0xbcb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_203; // 0xbd58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_261; // 0xbdf8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_66; // 0xbe78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_217; // 0xbf40
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_47; // 0xbf68
	FAnimNode_Fabrik AnimGraphNode_Fabrik_41; // 0xbf90
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_47; // 0xc120
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_216; // 0xc140
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_202; // 0xc168
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_260; // 0xc208
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_215; // 0xc288
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_65; // 0xc2b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_64; // 0xc378
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_214; // 0xc440
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_201; // 0xc468
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_213; // 0xc508
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_46; // 0xc530
	FAnimNode_Fabrik AnimGraphNode_Fabrik_40; // 0xc550
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_46; // 0xc6e0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_75; // 0xc700
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_212; // 0xc7c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_259; // 0xc7f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_258; // 0xc870
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_74; // 0xc8f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_211; // 0xc9b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_200; // 0xc9e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_63; // 0xca80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_210; // 0xcb48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_257; // 0xcb70
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_62; // 0xcbf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_209; // 0xccb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_256; // 0xcce0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_61; // 0xcd60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_208; // 0xce28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_255; // 0xce50
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_45; // 0xced0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_45; // 0xcef0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_39; // 0xcf10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_199; // 0xd0a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_207; // 0xd140
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_254; // 0xd168
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_253; // 0xd1e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_73; // 0xd268
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_206; // 0xd330
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_72; // 0xd358
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_71; // 0xd420
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_205; // 0xd4e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_70; // 0xd510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_252; // 0xd5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_251; // 0xd658
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_204; // 0xd6d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_198; // 0xd700
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_203; // 0xd7a0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_60; // 0xd7c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_250; // 0xd890
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_249; // 0xd910
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_59; // 0xd990
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_202; // 0xda58
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_127; // 0xda80
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_44; // 0xdc10
	FAnimNode_Fabrik AnimGraphNode_Fabrik_38; // 0xdc30
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_44; // 0xddc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_201; // 0xdde0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_197; // 0xde08
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_43; // 0xdea8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_37; // 0xded0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_43; // 0xe060
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_200; // 0xe080
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_58; // 0xe0a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_248; // 0xe170
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_247; // 0xe1f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_199; // 0xe270
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_42; // 0xe298
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_42; // 0xe2b8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_36; // 0xe2e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_198; // 0xe470
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_196; // 0xe498
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_197; // 0xe538
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_57; // 0xe560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_246; // 0xe628
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_56; // 0xe6a8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_126; // 0xe770
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_196; // 0xe900
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_41; // 0xe928
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_40; // 0xe948
	FAnimNode_Fabrik AnimGraphNode_Fabrik_35; // 0xe970
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_41; // 0xeb00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_195; // 0xeb20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_195; // 0xeb48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_194; // 0xebe8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_194; // 0xec10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_193; // 0xecb0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_55; // 0xecd8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_54; // 0xeda0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_245; // 0xee68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_244; // 0xeee8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xef68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_192; // 0xf028
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_53; // 0xf050
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_39; // 0xf118
	FAnimNode_Fabrik AnimGraphNode_Fabrik_34; // 0xf140
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_40; // 0xf2d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_243; // 0xf2f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_191; // 0xf370
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_193; // 0xf398
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_52; // 0xf438
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_190; // 0xf500
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_192; // 0xf528
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_51; // 0xf5c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_189; // 0xf690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_242; // 0xf6b8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_50; // 0xf738
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_188; // 0xf800
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_241; // 0xf828
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_240; // 0xf8a8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_49; // 0xf928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_187; // 0xf9f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_48; // 0xfa18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_186; // 0xfae0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_239; // 0xfb08
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_125; // 0xfb88
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_124; // 0xfd18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_123; // 0xfea8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_122; // 0x10038
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_191; // 0x101c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_38; // 0x10268
	FAnimNode_Fabrik AnimGraphNode_Fabrik_33; // 0x10290
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_39; // 0x10420
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_185; // 0x10440
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_190; // 0x10468
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_37; // 0x10508
	FAnimNode_Fabrik AnimGraphNode_Fabrik_32; // 0x10530
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_38; // 0x106c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_184; // 0x106e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_189; // 0x10708
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_36; // 0x107a8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_31; // 0x107d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_37; // 0x10960
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_183; // 0x10980
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_188; // 0x109a8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_35; // 0x10a48
	FAnimNode_Fabrik AnimGraphNode_Fabrik_30; // 0x10a70
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_36; // 0x10c00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_182; // 0x10c20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_187; // 0x10c48
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_34; // 0x10ce8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_29; // 0x10d10
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_35; // 0x10ea0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_181; // 0x10ec0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_186; // 0x10ee8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_180; // 0x10f88
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33; // 0x10fb0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_28; // 0x10fd0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_34; // 0x11160
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_185; // 0x11180
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32; // 0x11220
	FAnimNode_Fabrik AnimGraphNode_Fabrik_27; // 0x11240
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33; // 0x113d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_179; // 0x113f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_184; // 0x11418
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_178; // 0x114b8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31; // 0x114e0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_26; // 0x11500
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32; // 0x11690
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_47; // 0x116b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_238; // 0x11778
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_183; // 0x117f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_177; // 0x11898
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_182; // 0x118c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_237; // 0x11960
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_46; // 0x119e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_176; // 0x11aa8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30; // 0x11ad0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31; // 0x11af0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_25; // 0x11b10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_181; // 0x11ca0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_175; // 0x11d40
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_121; // 0x11d68
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_120; // 0x11ef8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_119; // 0x12088
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_118; // 0x12218
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_117; // 0x123a8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_116; // 0x12538
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_115; // 0x126c8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_114; // 0x12858
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_45; // 0x129e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_174; // 0x12ab0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_236; // 0x12ad8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30; // 0x12b58
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_48; // 0x12b78
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_47; // 0x12c80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_46; // 0x12d88
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_45; // 0x12e90
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_44; // 0x12f98
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x130a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x131a8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_113; // 0x132b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_44; // 0x13440
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_235; // 0x13508
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_173; // 0x13588
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_172; // 0x135b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_171; // 0x135d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_112; // 0x13600
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_170; // 0x13790
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_111; // 0x137b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_169; // 0x13948
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_168; // 0x13970
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_167; // 0x13998
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_166; // 0x139c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_165; // 0x139e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_164; // 0x13a10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_163; // 0x13a38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_162; // 0x13a60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_161; // 0x13a88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_160; // 0x13ab0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_159; // 0x13ad8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_158; // 0x13b00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_157; // 0x13b28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_156; // 0x13b50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_155; // 0x13b78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_154; // 0x13ba0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_153; // 0x13bc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_152; // 0x13bf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_151; // 0x13c18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_110; // 0x13c40
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_109; // 0x13dd0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_108; // 0x13f60
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_69; // 0x140f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_150; // 0x141b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_68; // 0x141e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_234; // 0x142a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_233; // 0x14328
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_67; // 0x143a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_149; // 0x14470
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_66; // 0x14498
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_232; // 0x14560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_231; // 0x145e0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_65; // 0x14660
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_148; // 0x14728
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_64; // 0x14750
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_230; // 0x14818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_229; // 0x14898
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29; // 0x14918
	FAnimNode_Fabrik AnimGraphNode_Fabrik_24; // 0x14940
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29; // 0x14ad0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_107; // 0x14af0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_106; // 0x14c80
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_105; // 0x14e10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_180; // 0x14fa0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_179; // 0x15040
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_178; // 0x150e0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_104; // 0x15180
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_103; // 0x15310
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_102; // 0x154a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_147; // 0x15630
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_146; // 0x15658
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_145; // 0x15680
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_144; // 0x156a8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_43; // 0x156d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_143; // 0x15798
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_101; // 0x157c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_177; // 0x15950
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_142; // 0x159f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_228; // 0x15a18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_100; // 0x15a98
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_99; // 0x15c28
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_98; // 0x15db8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_176; // 0x15f48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_175; // 0x15fe8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_97; // 0x16088
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_96; // 0x16218
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_174; // 0x163a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_173; // 0x16448
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_95; // 0x164e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_94; // 0x16678
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_93; // 0x16808
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_141; // 0x16998
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_140; // 0x169c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_139; // 0x169e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_138; // 0x16a10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_172; // 0x16a38
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_92; // 0x16ad8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_91; // 0x16c68
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_90; // 0x16df8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_171; // 0x16f88
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_42; // 0x17028
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_137; // 0x170f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_227; // 0x17118
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_89; // 0x17198
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_88; // 0x17328
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_87; // 0x174b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_86; // 0x17648
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_85; // 0x177d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_84; // 0x17968
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_83; // 0x17af8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_82; // 0x17c88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_226; // 0x17e18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_81; // 0x17e98
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_41; // 0x18028
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_80; // 0x180f0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_79; // 0x18280
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_78; // 0x18410
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_77; // 0x185a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x18730
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_76; // 0x18838
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_75; // 0x189c8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x18b58
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_74; // 0x18c60
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_73; // 0x18df0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x18f80
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_72; // 0x19088
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_136; // 0x19218
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_225; // 0x19240
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_40; // 0x192c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_135; // 0x19388
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x193b0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x193f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_134; // 0x194b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_133; // 0x194e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x19508
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x195c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_170; // 0x196d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_169; // 0x19770
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_168; // 0x19810
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_132; // 0x198b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_131; // 0x198d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_130; // 0x19900
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_129; // 0x19928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_128; // 0x19950
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_127; // 0x19978
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_126; // 0x199a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_125; // 0x199c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_124; // 0x199f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_123; // 0x19a18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_122; // 0x19a40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_121; // 0x19a68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_120; // 0x19a90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_119; // 0x19ab8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_118; // 0x19ae0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_117; // 0x19b08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_116; // 0x19b30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_115; // 0x19b58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0x19b80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_167; // 0x19ba8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_71; // 0x19c48
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_70; // 0x19dd8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_69; // 0x19f68
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_68; // 0x1a0f8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_67; // 0x1a288
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_66; // 0x1a418
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_65; // 0x1a5a8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_64; // 0x1a738
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_63; // 0x1a8c8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_62; // 0x1aa58
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_61; // 0x1abe8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_60; // 0x1ad78
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_59; // 0x1af08
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_58; // 0x1b098
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_57; // 0x1b228
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_56; // 0x1b3b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_55; // 0x1b548
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_54; // 0x1b6d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_53; // 0x1b868
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x1b9f8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x1bb00
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_39; // 0x1bc08
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x1bcd0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x1bdd8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_38; // 0x1bee0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_179; // 0x1bfa8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_37; // 0x1c090
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_166; // 0x1c158
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_178; // 0x1c1f8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x1c2e0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x1c3b0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x1c4b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x1c5c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0x1c6c8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0x1c7d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0x1c8d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0x1c9e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_36; // 0x1cae8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_224; // 0x1cbb0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_52; // 0x1cc30
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_35; // 0x1cdc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_223; // 0x1ce88
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_51; // 0x1cf08
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_50; // 0x1d098
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_165; // 0x1d228
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_49; // 0x1d2c8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_48; // 0x1d458
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_47; // 0x1d5e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0x1d778
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_34; // 0x1d7a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0x1d868
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_222; // 0x1d890
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0x1d910
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_46; // 0x1da18
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_45; // 0x1dba8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_164; // 0x1dd38
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_44; // 0x1ddd8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_43; // 0x1df68
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_163; // 0x1e0f8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_42; // 0x1e198
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_41; // 0x1e328
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0x1e4b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0x1e4e0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_40; // 0x1e508
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_162; // 0x1e698
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_39; // 0x1e738
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0x1e8c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0x1e8f0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_38; // 0x1e918
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_37; // 0x1eaa8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_36; // 0x1ec38
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0x1edc8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0x1eed0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28; // 0x1efd8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28; // 0x1eff8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_161; // 0x1f018
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0x1f0b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0x1f0e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_160; // 0x1f108
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_35; // 0x1f1a8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_34; // 0x1f338
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_33; // 0x1f4c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27; // 0x1f590
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0x1f5b0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0x1f6b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x1f7c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x1f8c8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x1f9d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x1fad8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x1fbe0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27; // 0x1fce8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_159; // 0x1fd08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0x1fda8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_177; // 0x1fdd0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x1feb8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0x1ffc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0x1ffe8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x20010
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x20168
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_221; // 0x20218
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0x20298
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_32; // 0x202c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_158; // 0x20388
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0x20428
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_31; // 0x20450
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x20518
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_220; // 0x20620
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x206a0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_30; // 0x206c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_219; // 0x20790
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_157; // 0x20810
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x208b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_29; // 0x208d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_218; // 0x209a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x20a20
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_28; // 0x20a48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_156; // 0x20b10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x20bb0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_27; // 0x20bd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_217; // 0x20ca0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_216; // 0x20d20
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x20da0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x20de8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x20ea8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_155; // 0x20ed0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x20f70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x20f98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_215; // 0x20fc0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_26; // 0x21040
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x21108
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_154; // 0x21130
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_214; // 0x211d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_153; // 0x21250
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x212f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_25; // 0x21318
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_152; // 0x213e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24; // 0x21480
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x21548
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_213; // 0x21570
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_176; // 0x215f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23; // 0x216d8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22; // 0x217a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_175; // 0x21868
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26; // 0x21950
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26; // 0x21970
	FAnimNode_Fabrik AnimGraphNode_Fabrik_23; // 0x21990
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_212; // 0x21b20
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21; // 0x21ba0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_211; // 0x21c68
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_151; // 0x21ce8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_33; // 0x21d88
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_32; // 0x21f18
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x220a8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x221b0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x222b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x223c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x224c8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x225d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x226d8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25; // 0x227e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25; // 0x22800
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x22820
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x22928
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x22a30
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x22b38
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x22c40
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x22d48
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x22e50
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24; // 0x22f58
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24; // 0x22f78
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_31; // 0x22f98
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x23128
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20; // 0x23150
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x23218
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x232e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_150; // 0x23308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_210; // 0x233a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_209; // 0x23428
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x234a8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23; // 0x234d0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_22; // 0x234f0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23; // 0x23680
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22; // 0x236a0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_21; // 0x236c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22; // 0x23850
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x23870
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_149; // 0x23898
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_148; // 0x23938
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x239d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_30; // 0x23a00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x23b90
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_29; // 0x23bb8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_28; // 0x23d48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_147; // 0x23ed8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x23f78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x24040
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_208; // 0x24068
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21; // 0x240e8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_20; // 0x24110
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21; // 0x242a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_207; // 0x242c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x24340
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x24368
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x24430
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x244f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_146; // 0x24520
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_27; // 0x245c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_206; // 0x24750
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_145; // 0x247d0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x24870
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x24938
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_205; // 0x24960
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_26; // 0x249e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x24b70
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_25; // 0x24b98
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_24; // 0x24d28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x24eb8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0x24ee0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_19; // 0x24f00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0x25090
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0x250b0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_18; // 0x250d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0x25260
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x25280
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_144; // 0x252a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_143; // 0x25348
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x253e8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0x25410
	FAnimNode_Fabrik AnimGraphNode_Fabrik_17; // 0x25430
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0x255c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x255e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x25608
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x256d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x25798
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_142; // 0x257c0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_23; // 0x25860
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_204; // 0x259f0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_22; // 0x25a70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x25c00
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_21; // 0x25c28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x25db8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_20; // 0x25de0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0x25f70
	FAnimNode_Fabrik AnimGraphNode_Fabrik_16; // 0x25f90
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0x26120
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0x26140
	FAnimNode_Fabrik AnimGraphNode_Fabrik_15; // 0x26160
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0x262f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x26310
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_141; // 0x26338
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_140; // 0x263d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x26478
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x264a0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_14; // 0x264c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x26650
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_203; // 0x26670
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x266f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x26718
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x267e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x268a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_139; // 0x268d0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_19; // 0x26970
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x26b00
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_18; // 0x26b28
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_17; // 0x26cb8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x26e48
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_16; // 0x26e70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x27000
	FAnimNode_Fabrik AnimGraphNode_Fabrik_13; // 0x27020
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x271b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_138; // 0x271d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x27270
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x27298
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x272b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_202; // 0x272d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_201; // 0x27358
	FAnimNode_Fabrik AnimGraphNode_Fabrik_12; // 0x273e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x27570
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x27598
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x27660
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_137; // 0x27688
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_136; // 0x27728
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_200; // 0x277c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x27848
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x27870
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x27938
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_135; // 0x27960
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_15; // 0x27a00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x27b90
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_14; // 0x27bb8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_11; // 0x27d50
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x27ee0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x27f00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_199; // 0x27f20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x27fa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x27fc8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x27ff0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_10; // 0x28010
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x281a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_134; // 0x281c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x28260
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_133; // 0x28288
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x28328
	FAnimNode_Fabrik AnimGraphNode_Fabrik_9; // 0x28350
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x284e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x28500
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x28528
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x28550
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x28618
	FAnimNode_Slot AnimGraphNode_Slot; // 0x28770
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x287b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x287e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x28808
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x28830
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x28858
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x28880
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x288a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x288d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x288f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x28920
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x28948
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x28970
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x28998
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x289c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x289e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x28a10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x28a38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x28a60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x28a88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x28ab0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x28ad8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x28b00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x28b28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x28b50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x28b78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x28ba0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x28bc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x28bf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x28c18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x28c40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x28c68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x28c90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x28cb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x28ce0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x28d08
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x28d30
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x28d58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x28d80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x28da8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_174; // 0x28dd0
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x28eb8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x28ee8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_198; // 0x28f98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_197; // 0x29018
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x29098
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_196; // 0x290c8
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x29148
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_195; // 0x29178
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x291f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_194; // 0x29228
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x292a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_193; // 0x292d8
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x29358
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_192; // 0x29388
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x29408
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x29438
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_173; // 0x29508
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_172; // 0x295f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_191; // 0x296d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_190; // 0x29758
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x297d8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_171; // 0x298a8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x29990
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_170; // 0x29a60
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_169; // 0x29b48
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_168; // 0x29c30
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_167; // 0x29d18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_166; // 0x29e00
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_165; // 0x29ee8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_189; // 0x29fd0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x2a050
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_188; // 0x2a120
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x2a1a0
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2a250
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_63; // 0x2a280
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_164; // 0x2a348
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_163; // 0x2a430
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_132; // 0x2a518
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_162; // 0x2a5b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_62; // 0x2a6a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_161; // 0x2a768
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_160; // 0x2a850
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_131; // 0x2a938
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_159; // 0x2a9d8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_61; // 0x2aac0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_158; // 0x2ab88
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_157; // 0x2ac70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_130; // 0x2ad58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_156; // 0x2adf8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_60; // 0x2aee0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_155; // 0x2afa8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_154; // 0x2b090
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_129; // 0x2b178
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_153; // 0x2b218
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_59; // 0x2b300
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_152; // 0x2b3c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_151; // 0x2b4b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_128; // 0x2b598
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_150; // 0x2b638
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_58; // 0x2b720
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_149; // 0x2b7e8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_148; // 0x2b8d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_127; // 0x2b9b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_147; // 0x2ba58
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_57; // 0x2bb40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_146; // 0x2bc08
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_145; // 0x2bcf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_126; // 0x2bdd8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_144; // 0x2be78
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_56; // 0x2bf60
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_143; // 0x2c028
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_142; // 0x2c110
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_125; // 0x2c1f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_141; // 0x2c298
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_55; // 0x2c380
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_140; // 0x2c448
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_139; // 0x2c530
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_124; // 0x2c618
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_138; // 0x2c6b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_54; // 0x2c7a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_137; // 0x2c868
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_136; // 0x2c950
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_123; // 0x2ca38
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_135; // 0x2cad8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_53; // 0x2cbc0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_134; // 0x2cc88
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_133; // 0x2cd70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_122; // 0x2ce58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_132; // 0x2cef8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_52; // 0x2cfe0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_131; // 0x2d0a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_130; // 0x2d190
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_121; // 0x2d278
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_129; // 0x2d318
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_51; // 0x2d400
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_128; // 0x2d4c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_127; // 0x2d5b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_120; // 0x2d698
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_126; // 0x2d738
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_50; // 0x2d820
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_125; // 0x2d8e8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_124; // 0x2d9d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_119; // 0x2dab8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_123; // 0x2db58
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_49; // 0x2dc40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_122; // 0x2dd08
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_121; // 0x2ddf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_118; // 0x2ded8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_120; // 0x2df78
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_48; // 0x2e060
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_119; // 0x2e128
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_118; // 0x2e210
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_117; // 0x2e2f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_117; // 0x2e398
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_47; // 0x2e480
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_116; // 0x2e548
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_115; // 0x2e630
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_116; // 0x2e718
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_114; // 0x2e7b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_46; // 0x2e8a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_113; // 0x2e968
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_112; // 0x2ea50
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_115; // 0x2eb38
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_111; // 0x2ebd8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_45; // 0x2ecc0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_110; // 0x2ed88
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_109; // 0x2ee70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_114; // 0x2ef58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_108; // 0x2eff8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_44; // 0x2f0e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_107; // 0x2f1a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_106; // 0x2f290
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_113; // 0x2f378
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_105; // 0x2f418
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_43; // 0x2f500
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_104; // 0x2f5c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_103; // 0x2f6b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_112; // 0x2f798
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_102; // 0x2f838
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x2f920
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_42; // 0x2f9d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_101; // 0x2fa98
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_100; // 0x2fb80
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_99; // 0x2fc68
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_111; // 0x2fd50
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_98; // 0x2fdf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_110; // 0x2fed8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_97; // 0x2ff78
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_96; // 0x30060
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_109; // 0x30148
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_95; // 0x301e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_41; // 0x302d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_94; // 0x30398
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_93; // 0x30480
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_92; // 0x30568
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_91; // 0x30650
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_108; // 0x30738
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_107; // 0x307d8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_90; // 0x30878
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89; // 0x30960
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_88; // 0x30a48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_106; // 0x30b30
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_87; // 0x30bd0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_86; // 0x30cb8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_85; // 0x30da0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_105; // 0x30e88
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x30f28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_187; // 0x30f58
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_104; // 0x30fd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_186; // 0x31078
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_185; // 0x310f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_103; // 0x31178
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_184; // 0x31218
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_183; // 0x31298
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_102; // 0x31318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_182; // 0x313b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_181; // 0x31438
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_101; // 0x314b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_180; // 0x31558
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_179; // 0x315d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_100; // 0x31658
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_178; // 0x316f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_177; // 0x31778
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_99; // 0x317f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_176; // 0x31898
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_175; // 0x31918
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_98; // 0x31998
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_174; // 0x31a38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_173; // 0x31ab8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_97; // 0x31b38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_172; // 0x31bd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_171; // 0x31c58
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_96; // 0x31cd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_170; // 0x31d78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_169; // 0x31df8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_95; // 0x31e78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_168; // 0x31f18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_167; // 0x31f98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_94; // 0x32018
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_166; // 0x320b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_165; // 0x32138
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_93; // 0x321b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_164; // 0x32258
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_163; // 0x322d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_92; // 0x32358
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_162; // 0x323f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_161; // 0x32478
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_91; // 0x324f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_160; // 0x32598
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_159; // 0x32618
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_90; // 0x32698
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_158; // 0x32738
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_157; // 0x327b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_89; // 0x32838
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_156; // 0x328d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_155; // 0x32958
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88; // 0x329d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_154; // 0x32a78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_153; // 0x32af8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_87; // 0x32b78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_152; // 0x32c18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_151; // 0x32c98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_86; // 0x32d18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_150; // 0x32db8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_149; // 0x32e38
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85; // 0x32eb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_148; // 0x32f58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_147; // 0x32fd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_84; // 0x33058
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_146; // 0x330f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x33178
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_145; // 0x33228
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x332a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_144; // 0x33348
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_143; // 0x333c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x33448
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_142; // 0x334e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_141; // 0x33568
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_140; // 0x335e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_139; // 0x33668
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x336e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_138; // 0x33788
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137; // 0x33808
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x33888
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_136; // 0x33928
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_135; // 0x339a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x33a28
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x33ac8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_134; // 0x33af8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_133; // 0x33b78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_132; // 0x33bf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_131; // 0x33c78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_130; // 0x33cf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_129; // 0x33d78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_128; // 0x33df8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_127; // 0x33e78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_126; // 0x33ef8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_125; // 0x33f78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124; // 0x33ff8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123; // 0x34078
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122; // 0x340f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121; // 0x34178
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120; // 0x341f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119; // 0x34278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118; // 0x342f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117; // 0x34378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116; // 0x343f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115; // 0x34478
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114; // 0x344f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x34578
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113; // 0x34628
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112; // 0x346a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111; // 0x34728
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x347a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0x34848
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x348c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0x34968
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0x349e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0x34a68
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x34ae8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_84; // 0x34b18
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x34c00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0x34c30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0x34cb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x34d30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x34db0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x34e30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x34eb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x34f30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x34fb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x35030
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x350b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x35130
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x351b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x35230
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x352b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x35330
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x353b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x35430
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x354b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x35530
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x355b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x35630
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x356b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x35760
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x357e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x35860
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x358e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x35980
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x35a00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x35aa0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x35b20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x35ba0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x35c20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x35c50
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x35cd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x35d70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x35df0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0x35e70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x35f10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x35f90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0x36010
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x360b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x36130
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0x361b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x36250
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x362d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0x36350
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x363f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x36470
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0x364f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x36590
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x36610
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0x36690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x36730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x367b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0x36830
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x368d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x36950
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0x369d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x36a70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x36af0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0x36b70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x36c10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x36c90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0x36d10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x36db0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x36e30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0x36eb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x36f50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x36fd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0x37050
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x370f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x37170
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0x371f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x37290
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x37310
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0x37390
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x37430
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x374b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0x37530
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x375d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x37650
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0x376d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x37770
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x377f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0x37870
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x37910
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x37990
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0x37a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x37ab0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x37b30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0x37bb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x37c50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x37cd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0x37d50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x37df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x37e70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0x37ef0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x37f90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x38010
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0x38090
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x38130
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0x381b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x38250
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x382d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x38350
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x383d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0x38450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x384f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x38570
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x38610
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x38690
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x38710
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x387c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_83; // 0x387f0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_40; // 0x388d8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_82; // 0x389a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_81; // 0x38a88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0x38b70
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_80; // 0x38c10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_39; // 0x38cf8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_79; // 0x38dc0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_78; // 0x38ea8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x38f90
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_77; // 0x39030
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_38; // 0x39118
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_76; // 0x391e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_75; // 0x392c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x393b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_74; // 0x39450
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_37; // 0x39538
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_73; // 0x39600
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_72; // 0x396e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x397d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_71; // 0x39870
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_36; // 0x39958
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70; // 0x39a20
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_69; // 0x39b08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x39bf0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_68; // 0x39c90
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_35; // 0x39d78
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_67; // 0x39e40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_66; // 0x39f28
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x3a010
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_65; // 0x3a0b0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_34; // 0x3a198
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_64; // 0x3a260
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_63; // 0x3a348
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x3a430
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_62; // 0x3a4d0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_33; // 0x3a5b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_61; // 0x3a680
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_60; // 0x3a768
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x3a850
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_59; // 0x3a8f0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_32; // 0x3a9d8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_58; // 0x3aaa0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_57; // 0x3ab88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x3ac70
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_56; // 0x3ad10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_31; // 0x3adf8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_55; // 0x3aec0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_54; // 0x3afa8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x3b090
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_53; // 0x3b130
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_30; // 0x3b218
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_52; // 0x3b2e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_51; // 0x3b3c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x3b4b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50; // 0x3b550
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_29; // 0x3b638
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_49; // 0x3b700
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_48; // 0x3b7e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x3b8d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_47; // 0x3b970
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_28; // 0x3ba58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46; // 0x3bb20
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_45; // 0x3bc08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x3bcf0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_44; // 0x3bd90
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27; // 0x3be78
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_43; // 0x3bf40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_42; // 0x3c028
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x3c110
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_41; // 0x3c1b0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26; // 0x3c298
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_40; // 0x3c360
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_39; // 0x3c448
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x3c530
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_38; // 0x3c5d0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25; // 0x3c6b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37; // 0x3c780
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36; // 0x3c868
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x3c950
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x3c9f0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x3cad8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x3cba0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x3cc88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x3cd70
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x3ce10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x3cef8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x3cfc0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x3d0a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x3d190
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x3d230
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x3d318
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x3d3e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x3d4c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3d5b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x3d650
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0x3d738
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x3d800
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x3d8e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x3d9d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x3da70
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0x3db58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x3dc20
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x3dd08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x3ddf0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x3de90
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0x3df78
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x3e040
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x3e128
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x3e210
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x3e2b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x3e350
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x3e438
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3e520
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x3e5c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x3e6a8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x3e790
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x3e840
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x3e928
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x3ea10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x3eab0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x3eb50
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x3ec38
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x3ed20
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x3edc0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x3eea8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x3ef90
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x3f030
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x3f118
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x3f1e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x3f2c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x3f3b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x3f498
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x3f580
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x3f648
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3f730
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x3f818
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3f8b8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3f8e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x3f998
	FAnimNode_Root AnimGraphNode_Root; // 0x3f9c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x3f9f0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_13; // 0x3fa70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x3fc00
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_12; // 0x3fc28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x3fdb8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x3fde0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x3fe08
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x3fe30
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x3fe50
	FAnimNode_Fabrik AnimGraphNode_Fabrik_8; // 0x3fe70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x40000
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x40080
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x40120
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x40148
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x401e8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x40210
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x402d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x40300
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x40328
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x403a8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x403d0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x40498
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x40560
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x40588
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x40628
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x406c8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x406f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x407b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x40880
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x408a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x40948
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x409c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x40a48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x40ac8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x40b48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x40b70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x40b98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x40c38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x40cd8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x40d00
	FAnimNode_Fabrik AnimGraphNode_Fabrik_7; // 0x40d20
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x40eb0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x40ed0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x40ef8
	FAnimNode_Fabrik AnimGraphNode_Fabrik_6; // 0x40f20
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x410b0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x410d0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_5; // 0x410f0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x41280
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x412a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x412c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x41368
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x41408
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x41430
	FAnimNode_Fabrik AnimGraphNode_Fabrik_4; // 0x41450
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x415e0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_11; // 0x41600
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x41790
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_10; // 0x417b8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x41948
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x41ad8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x41c68
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x41c90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x41e20
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x41e48
	FAnimNode_Fabrik AnimGraphNode_Fabrik_3; // 0x41e70
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x42000
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x42020
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x42040
	FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x42060
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x421f0
	FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x42210
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x423a0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x423c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x42488
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x424b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x424d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x42598
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x425c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x425e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x42660
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x426e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x42780
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x42820
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x428c0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x42960
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x42a28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x42a50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x42ad0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x42b50
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x42c18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x42ce0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x42d08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x42dd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x42e50
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x42ed0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x42f98
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x42fc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x43088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x43108
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x43188
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x43250
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x43278
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x43340
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x433c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x43440
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x434e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x43580
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x43620
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x436e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x43710
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x43790
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x43810
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x438d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x439a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x439c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x43a90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x43b10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x43b90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x43c58
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x43c80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x43d48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x43dc8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x43e48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x43f10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x43f38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x44000
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x44080
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x44100
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x441b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x44308
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x44330
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x44358
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x44380
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x443a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x443d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x443f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x44420
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x44448
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x44470
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x44498
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x444c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x444e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x44510
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x44538
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x44560
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x44588
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x445b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x445d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x44600
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x44628
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x44650
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x44678
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x44808
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x448a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x44948
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x449e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x44b78
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x44d08
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x44e98
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x45028
	float Aiming_blend_true; // 0x451b8
	float Aiming_blend_false; // 0x451bc
};

struct UGraphNodeContextMenuContext : UObject {
	UBlueprint* Blueprint; // 0x28
	UEdGraph* Graph; // 0x30
	UEdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USceneComponent : UActorComponent {
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xb8
	USceneComponent* AttachParent; // 0xc0
	FName AttachSocketName; // 0xc8
	TArray<USceneComponent*> AttachChildren; // 0xd0
	TArray<USceneComponent*> ClientAttachedChildren; // 0xe0
	FVector RelativeLocation; // 0x11c
	FRotator RelativeRotation; // 0x128
	FVector RelativeScale3D; // 0x134
	FVector ComponentVelocity; // 0x140
	char bComponentToWorldUpdated : 1; // 0x14c
	char bAbsoluteLocation : 1; // 0x14c
	char bAbsoluteRotation : 1; // 0x14c
	char bAbsoluteScale : 1; // 0x14c
	char bVisible : 1; // 0x14c
	char bShouldBeAttached : 1; // 0x14c
	char bShouldSnapLocationWhenAttached : 1; // 0x14c
	char bShouldSnapRotationWhenAttached : 1; // 0x14d
	char bShouldUpdatePhysicsVolume : 1; // 0x14d
	char bHiddenInGame : 1; // 0x14d
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x14d
	char bUseAttachParentBound : 1; // 0x14d
	EComponentMobility Mobility; // 0x14f
	EDetailMode DetailMode; // 0x150
	FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x151
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xc0
};

struct UParticleModuleBeamTarget : UParticleModuleBeamBase {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x88
	char bLockTarget : 1; // 0x88
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x8c
	FRawDistributionVector TargetTangent; // 0x90
	char bLockTargetTangent : 1; // 0xd8
	FRawDistributionFloat TargetStrength; // 0xe0
	char bLockTargetStength : 1; // 0x110
	float LockRadius; // 0x114
};

struct At_Material_C : ASFPSBaseItem {
	UBoxComponent* Trace; // 0x310
	UStaticMeshComponent* Mesh; // 0x318
};

struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	FAIDistanceType GeometricDistanceType; // 0xd0
	char bUseParametrizedRadius : 1; // 0xd4
	char bUseNavAgentGoalLocation : 1; // 0xd4
	char bPathFindingBasedTest : 1; // 0xd4
};

struct ABMF_Sandbags_02_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x340
	float SourceHeight; // 0x344
	float BarnDoorAngle; // 0x348
	float BarnDoorLength; // 0x34c
	UTexture* SourceTexture; // 0x350
};

struct USFPSGameplayEventManager : UObject {
	bool bDynamicTimeScale; // 0x34
	ASFPSGameplayEventPoint* EventPointClass; // 0x40
	USFPSGameplayEvent* EventClass; // 0x48
	TArray<USFPSGameplayEvent*> Events; // 0x60
	int32_t EventTimeMin; // 0x70
	int32_t EventTimeMax; // 0x74
	int32_t MaximumEvents; // 0x78
	float EventActivationRadiusSquared; // 0x7c
	float EventActivationTime; // 0x80
	float EventMaxActiveTime; // 0x84
	int32_t MonstersMin; // 0x88
	int32_t MonstersMax; // 0x8c
	bool bEnableBaseFiltering; // 0x90
	float FilterRadius; // 0x94
	ESFPSGameplayEventInfoType ClientInfoType; // 0x98
	UObject* ActorClass; // 0xa0
	ASFPSLootBox* RewardContainerClass; // 0xa8
	USFPSItemSetStructSet* RewardSet; // 0xb0
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UMaterialExpressionConstantBiasScale : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Bias; // 0x54
	float Scale; // 0x58
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x1f8
	float Brightness; // 0x208
	float Intensity; // 0x20c
	FColor LightColor; // 0x210
	char bAffectsWorld : 1; // 0x214
	char CastShadows : 1; // 0x214
	char CastStaticShadows : 1; // 0x214
	char CastDynamicShadows : 1; // 0x214
	char bAffectTranslucentLighting : 1; // 0x214
	char bTransmission : 1; // 0x214
	char bCastVolumetricShadow : 1; // 0x214
	char bCastDeepShadow : 1; // 0x214
	char bCastRaytracedShadow : 1; // 0x215
	char bAffectReflection : 1; // 0x215
	char bAffectGlobalIllumination : 1; // 0x215
	float DeepShadowLayerDistribution; // 0x218
	float IndirectLightingIntensity; // 0x21c
	float VolumetricScatteringIntensity; // 0x220
	int32_t SamplesPerPixel; // 0x224
};

struct ABMF_Fence_01_C : At_LocationCraftActor_C {
	USFPSACSnapComponent* SFPSACSnap1; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x368
};

struct USFPSVoiceList : UObject {
	TArray<USFPSSoundTalkSet*> SentenceSoundTable; // 0x28
};

struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct UFoliageType_Actor : UFoliageType {
	AActor* ActorClass; // 0x3b0
	bool bShouldAttachToBaseComponent; // 0x3b8
};

struct ABMF_Gates_lock_01_C : ABMF_Gates_01_C {
	UStaticMeshComponent* Base_lock_02; // 0x388
	UStaticMeshComponent* Base_lock_01; // 0x390
};

struct UPaperGroupedSpriteComponent : UMeshComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x478
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x488
};

struct UCompositionGraphCaptureProtocol : UMovieSceneImageCaptureProtocolBase {
	FCompositionGraphCapturePasses IncludeRenderPasses; // 0x58
	bool bCaptureFramesInHDR; // 0x68
	int32_t HDRCompressionQuality; // 0x6c
	EHDRCaptureGamut CaptureGamut; // 0x70
	FSoftObjectPath PostProcessingMaterial; // 0x78
	bool bDisableScreenPercentage; // 0x90
	UMaterialInterface* PostProcessingMaterialPtr; // 0x98
};

struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x570
	char bIsFrozenRendering : 1; // 0x570
	char bIsOrbitingSelectedActor : 1; // 0x570
	char bOrbitPivotUseCenter : 1; // 0x570
	char bEnableBufferVisualization : 1; // 0x570
	char bEnableBufferVisualizationFullMode : 1; // 0x570
	char bIsBufferVisualizationInputSetup : 1; // 0x570
	char bLastDisplayEnabled : 1; // 0x570
	UDrawFrustumComponent* DrawFrustum; // 0x578
	AActor* SelectedActor; // 0x580
	UPrimitiveComponent* SelectedComponent; // 0x588
	FHitResult SelectedHitPoint; // 0x590
	APlayerController* OriginalControllerRef; // 0x618
	UPlayer* OriginalPlayer; // 0x620
	float SpeedScale; // 0x628
	float InitialMaxSpeed; // 0x62c
	float InitialAccel; // 0x630
	float InitialDecel; // 0x634
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	char bProxyIsJumpForceApplied : 1; // 0x330
	char bPressedJump : 1; // 0x330
	char bClientUpdating : 1; // 0x330
	char bClientWasFalling : 1; // 0x330
	char bClientResimulateRootMotion : 1; // 0x330
	char bClientResimulateRootMotionSources : 1; // 0x330
	char bSimGravityDisabled : 1; // 0x330
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331
	char bServerMoveIgnoreRootMotion : 1; // 0x331
	char bWasJumping : 1; // 0x331
	float JumpKeyHoldTime; // 0x334
	float JumpForceTimeRemaining; // 0x338
	float ProxyJumpForceStartedTime; // 0x33c
	float JumpMaxHoldTime; // 0x340
	int32_t JumpMaxCount; // 0x344
	int32_t JumpCurrentCount; // 0x348
	int32_t JumpCurrentCountPreJump; // 0x34c
	FMulticastInlineDelegate OnReachedJumpApex; // 0x358
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x378
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x388
	FRootMotionSourceGroup SavedRootMotion; // 0x398
	FRootMotionMovementParams ClientRootMotionParams; // 0x3d0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410
	FRepRootMotionMontage RepRootMotion; // 0x420
};

struct UDirectionalLightComponent : ULightComponent {
	float ShadowCascadeBiasDistribution; // 0x328
	char bEnableLightShaftOcclusion : 1; // 0x32c
	float OcclusionMaskDarkness; // 0x330
	float OcclusionDepthRange; // 0x334
	FVector LightShaftOverrideDirection; // 0x338
	float WholeSceneDynamicShadowRadius; // 0x344
	float DynamicShadowDistanceMovableLight; // 0x348
	float DynamicShadowDistanceStationaryLight; // 0x34c
	int32_t DynamicShadowCascades; // 0x350
	float CascadeDistributionExponent; // 0x354
	float CascadeTransitionFraction; // 0x358
	float ShadowDistanceFadeoutFraction; // 0x35c
	char bUseInsetShadowsForMovableObjects : 1; // 0x360
	int32_t FarShadowCascadeCount; // 0x364
	float FarShadowDistance; // 0x368
	float DistanceFieldShadowDistance; // 0x36c
	float LightSourceAngle; // 0x370
	float LightSourceSoftAngle; // 0x374
	float ShadowSourceAngleFactor; // 0x378
	float TraceDistance; // 0x37c
	char bUsedAsAtmosphereSunLight : 1; // 0x380
	int32_t AtmosphereSunLightIndex; // 0x384
	FLinearColor AtmosphereSunDiskColorScale; // 0x388
	char bPerPixelAtmosphereTransmittance : 1; // 0x398
	char bCastShadowsOnClouds : 1; // 0x398
	char bCastShadowsOnAtmosphere : 1; // 0x398
	char bCastCloudShadows : 1; // 0x398
	float CloudShadowStrength; // 0x39c
	float CloudShadowOnAtmosphereStrength; // 0x3a0
	float CloudShadowOnSurfaceStrength; // 0x3a4
	float CloudShadowDepthBias; // 0x3a8
	float CloudShadowExtent; // 0x3ac
	float CloudShadowMapResolutionScale; // 0x3b0
	float CloudShadowRaySampleCountScale; // 0x3b4
	FLinearColor CloudScatteredLuminanceScale; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3c8
	char bCastModulatedShadows : 1; // 0x3d8
	FColor ModulatedShadowColor; // 0x3dc
	float ShadowAmount; // 0x3e0
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct Ascope_opt_cod_4x_C : At_Sight_C {
	UStaticMeshComponent* cod_4x_reticles; // 0x3d0
};

struct AM_TripwireTrap_02_C : At_LocationCraftActor_C {
	UBoxComponent* Interaction; // 0x358
	UBoxComponent* GrenadeCollision; // 0x360
	UBoxComponent* ExplosionCollision; // 0x368
	USFPSACTripwireTrap* ACTripwireTrap; // 0x370
	USFPSACBaseCollision* SFPSACBaseCollision1; // 0x378
};

struct UMovieSceneSequence : UMovieSceneSignedObject {
	UMovieSceneCompiledData* CompiledData; // 0x50
	EMovieSceneCompletionMode DefaultCompletionMode; // 0x58
	bool bParentContextsAreSignificant; // 0x59
	bool bPlayableDirectly; // 0x5a
	EMovieSceneSequenceFlags SequenceFlags; // 0x5b
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct ABM_WallWindow_01_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
};

struct UDatasmithStaticMeshComponentTemplate : UDatasmithObjectTemplate {
	UStaticMesh* StaticMesh; // 0x30
	TArray<UMaterialInterface*> OverrideMaterials; // 0x38
};

struct UMaterialExpressionSceneColor : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput OffsetFraction; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UMovieSceneSkeletalAnimationTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
	bool bUseLegacySectionIndexBlend; // 0xa8
	FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams; // 0xb0
	bool bBlendFirstChildOfRoot; // 0xe0
};

struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	UPawnAction* Action; // 0x70
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxis; // 0x40
	FExpressionInput RotationAngle; // 0x54
	FExpressionInput PivotPoint; // 0x68
	FExpressionInput Position; // 0x7c
	float Period; // 0x90
};

struct ANavigationData : AActor {
	UPrimitiveComponent* RenderingComp; // 0x228
	FNavDataConfig NavDataConfig; // 0x230
	char bEnableDrawing : 1; // 0x2a8
	char bForceRebuildOnLoad : 1; // 0x2a8
	char bAutoDestroyWhenNoNavigation : 1; // 0x2a8
	char bCanBeMainNavData : 1; // 0x2a8
	char bCanSpawnOnRebuild : 1; // 0x2a8
	char bRebuildAtRuntime : 1; // 0x2a8
	ERuntimeGenerationType RuntimeGeneration; // 0x2ac
	float ObservedPathsTickInterval; // 0x2b0
	uint32_t DataVersion; // 0x2b4
	TArray<FSupportedAreaData> SupportedAreas; // 0x3c0
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UTouchInterface : UObject {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x88
	char bNRScaleEmitterTime : 1; // 0xb8
	FRawDistributionVector NoiseSpeed; // 0xc0
	char bSmooth : 1; // 0x108
	float NoiseLockRadius; // 0x10c
	char bNoiseLock : 1; // 0x110
	char bOscillate : 1; // 0x110
	float NoiseLockTime; // 0x114
	float NoiseTension; // 0x118
	char bUseNoiseTangents : 1; // 0x11c
	FRawDistributionFloat NoiseTangentStrength; // 0x120
	int32_t NoiseTessellation; // 0x150
	char bTargetNoise : 1; // 0x154
	float FrequencyDistance; // 0x158
	char bApplyNoiseScale : 1; // 0x15c
	FRawDistributionFloat NoiseScale; // 0x160
};

struct UMovementComponent : UActorComponent {
	USceneComponent* UpdatedComponent; // 0xb0
	UPrimitiveComponent* UpdatedPrimitive; // 0xb8
	FVector Velocity; // 0xc4
	FVector PlaneConstraintNormal; // 0xd0
	FVector PlaneConstraintOrigin; // 0xdc
	char bUpdateOnlyIfRendered : 1; // 0xe8
	char bAutoUpdateTickRegistration : 1; // 0xe8
	char bTickBeforeOwner : 1; // 0xe8
	char bAutoRegisterUpdatedComponent : 1; // 0xe8
	char bConstrainToPlane : 1; // 0xe8
	char bSnapToPlaneAtStart : 1; // 0xe8
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xe8
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb
};

struct ASFPSShootingRangeTarget : AActor {
	UMeshComponent* MeshRef; // 0x220
	UTextRenderComponent* lbInfo; // 0x228
	UStaticMeshComponent* Target; // 0x230
	UStaticMeshComponent* DamageClient; // 0x238
	UStaticMeshComponent* DamageServer; // 0x240
	UStaticMeshComponent* ClearTrigger; // 0x2e8
};

struct USpinBox : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	FSpinBoxStyle WidgetStyle; // 0x120
	USlateWidgetStyleAsset* Style; // 0x408
	int32_t MinFractionalDigits; // 0x410
	int32_t MaxFractionalDigits; // 0x414
	bool bAlwaysUsesDeltaSnap; // 0x418
	float Delta; // 0x41c
	float SliderExponent; // 0x420
	FSlateFontInfo Font; // 0x428
	ETextJustify Justification; // 0x480
	float MinDesiredWidth; // 0x484
	bool ClearKeyboardFocusOnCommit; // 0x488
	bool SelectAllTextOnCommit; // 0x489
	FSlateColor ForegroundColor; // 0x490
	FMulticastInlineDelegate OnValueChanged; // 0x4b8
	FMulticastInlineDelegate OnValueCommitted; // 0x4c8
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d8
	FMulticastInlineDelegate OnEndSliderMovement; // 0x4e8
	char bOverride_MinValue : 1; // 0x4f8
	char bOverride_MaxValue : 1; // 0x4f8
	char bOverride_MinSliderValue : 1; // 0x4f8
	char bOverride_MaxSliderValue : 1; // 0x4f8
	float MinValue; // 0x4fc
	float MaxValue; // 0x500
	float MinSliderValue; // 0x504
	float MaxSliderValue; // 0x508
};

struct ASFPSGameplayArea : AActor {
	TArray<USFPSACEncounter*> Encounters; // 0x220
	TArray<USFPSACMission*> Missions; // 0x230
	USceneComponent* Root; // 0x250
	TArray<USFPSACMission*> ActiveMissions; // 0x258
	TArray<USFPSACMission*> ReadyMissions; // 0x268
	TArray<USFPSACEncounter*> ActiveEncounters; // 0x278
	int32_t MaxActiveEncounters; // 0x288
	int32_t ActivationDelay; // 0x28c
};

struct UMovieSceneCameraShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x98
};

struct ABMF_Sandbags_01_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UPaperTerrainMaterial : UDataAsset {
	TArray<FPaperTerrainMaterialRule> Rules; // 0x30
	UPaperSprite* InteriorFill; // 0x40
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UFileMediaSource : UBaseMediaSource {
	FString FilePath; // 0x88
	bool PrecacheFile; // 0x98
};

struct AShell_Gun0_C : ASFPSShell {
	UStaticMeshComponent* Mesh; // 0x250
};

struct UUniformVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Direction; // 0xb4
};

struct Adevice_lighter_01_C : At_Device_C {
	UStaticMeshComponent* Flame; // 0x4a0
	UPointLightComponent* PointLight; // 0x4a8
};

struct At_Gameplay_C : ASFPSGameplayItem {
	UBoxComponent* Trace; // 0x360
	UStaticMeshComponent* Mesh; // 0x368
};

struct UEndpointSubmix : USoundSubmixBase {
	FName EndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	UAudioEndpointSettingsBase* EndpointSettings; // 0x48
};

struct UInterpTrackFloatMaterialParam : UInterpTrackFloatBase {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct USFPSCraftLibrary : UObject {
	TArray<FSFPSCraftGroup> Items; // 0x28
};

struct UMaterialExpressionCosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UPaperTileSet : UObject {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct UMediaComponent : UActorComponent {
	UMediaTexture* MediaTexture; // 0xb0
	UMediaPlayer* MediaPlayer; // 0xb8
};

struct ARectLight : ALight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct UARGeoAnchorComponent : UARComponent {
	FARGeoAnchorUpdatePayload ReplicatedPayload; // 0x280
};

struct ANavigationObjectBase : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UBillboardComponent* GoodSprite; // 0x230
	UBillboardComponent* BadSprite; // 0x238
	char bIsPIEPlayerStart : 1; // 0x240
};

struct UPhononReverbSourceSettings : UReverbPluginSourceSettingsBase {
	EIplSimulationType SourceReverbSimulationType; // 0x28
	float SourceReverbContribution; // 0x2c
};

struct APaperTerrainActor : AActor {
	USceneComponent* DummyRoot; // 0x220
	UPaperTerrainSplineComponent* SplineComponent; // 0x228
	UPaperTerrainComponent* RenderComponent; // 0x230
};

struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	FGameplayTagQuery TagQueryToMatch; // 0x1f8
	bool bUpdatedToUseQuery; // 0x240
	EGameplayContainerMatchType TagsToMatch; // 0x241
	FGameplayTagContainer GameplayTags; // 0x248
};

struct UMovieSceneEventSection : UMovieSceneSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct Aweapon_firearms_smg_hkump_C : At_FireArm_C {
	UStaticMeshComponent* DTK; // 0x7e0
	UStaticMeshComponent* DeviceLeftMount; // 0x7e8
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7f0
	UStaticMeshComponent* MagazineFull; // 0x7f8
	UStaticMeshComponent* MagazineEmpty; // 0x800
};

struct AM_Campfire_01_C : At_LocationCraftActor_C {
	UParticleSystemComponent* ParticleSystem; // 0x358
	UPointLightComponent* BigLight; // 0x360
	UPointLightComponent* RedLight; // 0x368
	USFPSACBaseCollision* SFPSACBaseCollision1; // 0x370
};

struct UMaterialExpressionLightmassReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput Lightmass; // 0x54
};

struct At_InventoryDevice_C : ASFPSInventoryDeviceItem {
	UBoxComponent* Trace; // 0x328
	UStaticMeshComponent* Mesh; // 0x330
};

struct UMonoWaveTableSynthPreset : UObject {
	FString PresetName; // 0x28
	char bLockKeyframesToGridBool : 1; // 0x38
	int32_t LockKeyframesToGrid; // 0x3c
	int32_t WaveTableResolution; // 0x40
	TArray<FRuntimeFloatCurve> WaveTable; // 0x48
	char bNormalizeWaveTables : 1; // 0x58
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x38
};

struct USFPSAnimEvent_StairStepSound : UAnimNotify {
	bool IsRightLeg; // 0x38
};

struct Aweapon_firearms_supp_rgm40_C : At_FireArm_C {
	UStaticMeshComponent* Shell; // 0x7e0
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e8
};

struct UParticleModuleColor_Seeded : UParticleModuleColor {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UAsyncActionChangePrimaryAssetBundles : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMediaTimeStampInfo : UObject {
	FTimespan Time; // 0x28
	int64_t SequenceIndex; // 0x30
};

struct UGizmoPlaneScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct Aweapon_firearms_rifle_aks74u_mod_C : At_FireArm_C {
	UStaticMeshComponent* DTK; // 0x7e0
	UStaticMeshComponent* DeviceLeftMount1; // 0x7e8
	UStaticMeshComponent* SightOpen; // 0x7f0
	UStaticMeshComponent* SightClose; // 0x7f8
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x800
	UStaticMeshComponent* MagazineFull; // 0x808
	UStaticMeshComponent* MagazineEmpty; // 0x810
};

struct AFlashGrenade_C : ASFPSFlashGrenade {
	UProjectileMovementComponent* ProjectileMovement; // 0x3e8
	UStaticMeshComponent* Mesh; // 0x3f0
};

struct UMovieSceneSubSection : UMovieSceneSection {
	FMovieSceneSectionParameters Parameters; // 0xe8
	float StartOffset; // 0x10c
	float TimeScale; // 0x110
	float PrerollTime; // 0x114
	char NetworkMask; // 0x118
	UMovieSceneSequence* SubSequence; // 0x120
	LazyObjectProperty ActorToRecord; // 0x128
	FString TargetSequenceName; // 0x148
	FDirectoryPath TargetPathToRecordTo; // 0x158
};

struct AMagicLeapSharedWorldGameMode : AGameMode {
	FMagicLeapSharedWorldSharedData SharedWorldData; // 0x308
	FMulticastInlineDelegate OnNewLocalDataFromClients; // 0x318
	float PinSelectionConfidenceThreshold; // 0x328
	AMagicLeapSharedWorldPlayerController* ChosenOne; // 0x3d0
};

struct UInterpTrackToggle : UInterpTrack {
	TArray<FToggleTrackKey> ToggleTrack; // 0x70
	char bActivateSystemEachUpdate : 1; // 0x80
	char bActivateWithJustAttachedFlag : 1; // 0x80
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UABP_weapon_firearms_rifle_groza_C : USFPSWeaponAnimInstance_AR {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x360
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UGizmoLineHandleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x470
	float HandleSize; // 0x47c
	float Thickness; // 0x480
	FVector Direction; // 0x484
	float Length; // 0x490
	bool bImageScale; // 0x494
};

struct UInteractiveGizmo : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x30
};

struct UMaterialExpressionConstant : UMaterialExpression {
	float R; // 0x40
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x48
	FSoundAttenuationSettings AttenuationOverrides; // 0x50
	char bOverrideAttenuation : 1; // 0x3f0
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UBillboardComponent : UPrimitiveComponent {
	UTexture2D* Sprite; // 0x450
	char bIsScreenSizeScaled : 1; // 0x458
	float ScreenSize; // 0x45c
	float U; // 0x460
	float UL; // 0x464
	float V; // 0x468
	float VL; // 0x46c
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UClothConfigNv : UClothConfigCommon {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	FVector LinearDrag; // 0x90
	FVector AngularDrag; // 0x9c
	FVector LinearInertiaScale; // 0xa8
	FVector AngularInertiaScale; // 0xb4
	FVector CentrifugalInertiaScale; // 0xc0
	float SolverFrequency; // 0xcc
	float StiffnessFrequency; // 0xd0
	float GravityScale; // 0xd4
	FVector GravityOverride; // 0xd8
	bool bUseGravityOverride; // 0xe4
	float TetherStiffness; // 0xe8
	float TetherLimit; // 0xec
	float CollisionThickness; // 0xf0
	float AnimDriveSpringStiffness; // 0xf4
	float AnimDriveDamperStiffness; // 0xf8
	EClothingWindMethod_Legacy WindMethod; // 0xfc
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x100
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x110
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x120
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x130
};

struct UDataDrivenCVarEngineSubsystem : UEngineSubsystem {
	FMulticastInlineDelegate OnDataDrivenCVarDelegate; // 0x30
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMaterialExpressionVolumetricAdvancedMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput PhaseG; // 0x40
	FExpressionInput PhaseG2; // 0x54
	FExpressionInput PhaseBlend; // 0x68
	FExpressionInput MultiScatteringContribution; // 0x7c
	FExpressionInput MultiScatteringOcclusion; // 0x90
	FExpressionInput MultiScatteringEccentricity; // 0xa4
	FExpressionInput ConservativeDensity; // 0xb8
	float ConstPhaseG; // 0xcc
	float ConstPhaseG2; // 0xd0
	float ConstPhaseBlend; // 0xd4
	bool PerSamplePhaseEvaluation; // 0xd8
	uint32_t MultiScatteringApproximationOctaveCount; // 0xdc
	float ConstMultiScatteringContribution; // 0xe0
	float ConstMultiScatteringOcclusion; // 0xe4
	float ConstMultiScatteringEccentricity; // 0xe8
	bool bGroundContribution; // 0xec
	bool bGrayScaleMaterial; // 0xed
	bool bRayMarchVolumeShadow; // 0xee
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FMulticastInlineDelegate OnDrop; // 0x58
	FMulticastInlineDelegate OnDragCancelled; // 0x68
	FMulticastInlineDelegate OnDragged; // 0x78
};

struct UMaterialExpressionPreviousFrameSwitch : UMaterialExpression {
	FExpressionInput CurrentFrame; // 0x40
	FExpressionInput PreviousFrame; // 0x54
};

struct ULightmappedSurfaceCollection : UObject {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct UAutomationTestSettings : UObject {
	TArray<FString> EngineTestModules; // 0x28
	TArray<FString> EditorTestModules; // 0x38
	FSoftObjectPath AutomationTestmap; // 0x48
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x60
	TArray<FSoftObjectPath> AssetsToOpen; // 0x70
	TArray<FString> MapsToPIETest; // 0x80
	FBuildPromotionTestSettings BuildPromotionTest; // 0x90
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x280
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2b0
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2c0
	TArray<FString> TestLevelFolders; // 0x2f0
	TArray<FExternalToolDefinition> ExternalTools; // 0x300
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x310
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x320
	FIntPoint DefaultScreenshotResolution; // 0x330
	float PIETestDuration; // 0x338
};

struct UARTrackedImage : UARTrackedGeometry {
	UARCandidateImage* DetectedImage; // 0xf8
	FVector2D EstimatedSize; // 0x100
};

struct ASFPSWeaponMF_Sight : ASFPSBaseWeaponMF {
	UStaticMesh* FullMesh; // 0x348
	UStaticMesh* PartialMesh; // 0x350
	bool bDoNotShowWeaponSight; // 0x358
	FVector CameraOrigin; // 0x35c
	FVector CameraOriginSecondary; // 0x368
	FTransform CollimatorTransform; // 0x380
	TArray<float> Zooms; // 0x3b0
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct UfrmRadialMenu_C : USFPSUserWidget_RadialMenu {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UUMG_RadialMenu_C* rmMotions_Start; // 0x280
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UParticleModuleLocationBoneSocket : UParticleModuleLocationBase {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x5c
	int32_t NumPreSelectedIndices; // 0x64
};

struct ASFPSAmmo : ASFPSBaseItem {
	ESFPSAmmoType AmmoType; // 0x310
	ESFPSDamageType DamageType; // 0x311
	FSFPSAmmoParameters Params; // 0x314
};

struct UParticleModuleMeshRotationRate_Seeded : UParticleModuleMeshRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct UABP_weapon_firearms_gun_TT_C : USFPSWeaponAnimInstance_Gun {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x318
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x360
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x388
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x400
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x428
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x450
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x4d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x500
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x580
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x5b0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x630
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x660
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xf0
	FMovieSceneFloatChannel LeftCurve; // 0x190
	FMovieSceneFloatChannel RightCurve; // 0x230
	FMovieSceneFloatChannel BottomCurve; // 0x2d0
};

struct USFPSACLocality : USceneComponent {
	float Radius; // 0x20c
	bool bDrawLabel; // 0x210
	FSFPSMapLabel MapLabel; // 0x218
	bool bDrawSprite; // 0x238
	bool bSafeArea; // 0x239
	bool bCanBeSelectedForRespawn; // 0x23a
	int32_t RespawnCooldownSec; // 0x23c
	bool bBase; // 0x240
};

struct UPawnAction_Repeat : UPawnAction {
	UPawnAction* ActionToRepeat; // 0x90
	UPawnAction* RecentActionCopy; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
};

struct UParticleModuleAccelerationDragScaleOverLife : UParticleModuleAccelerationBase {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct ACharacter_man_01_C : ASFPSCharacter {
	UWidgetComponent* frmPVE; // 0x1170
	USceneComponent* weapon_barrier_sg1; // 0x1178
	USceneComponent* weapon_barrier_gun0; // 0x1180
	USceneComponent* weapon_barrier_sg0; // 0x1188
	USceneComponent* weapon_barrier_ar0; // 0x1190
};

struct USoundNodeModulContOuterParam : USoundNode {
	UModulatorContOuterParams* PitchModulationParams; // 0x48
	UModulatorContOuterParams* VolumeModulationParams; // 0x50
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe8
	UAnimSequence* AnimSequence; // 0x1c0
	UAnimSequenceBase* Animation; // 0x1c8
	float StartOffset; // 0x1d0
	float EndOffset; // 0x1d4
	float PlayRate; // 0x1d8
	char bReverse : 1; // 0x1dc
	FName SlotName; // 0x1e0
	FVector StartLocationOffset; // 0x1e8
	FRotator StartRotationOffset; // 0x1f4
	bool bMatchWithPrevious; // 0x200
	FName MatchedBoneName; // 0x204
	FVector MatchedLocationOffset; // 0x20c
	FRotator MatchedRotationOffset; // 0x218
	bool bMatchTranslation; // 0x224
	bool bMatchIncludeZHeight; // 0x225
	bool bMatchRotationYaw; // 0x226
	bool bMatchRotationPitch; // 0x227
	bool bMatchRotationRoll; // 0x228
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UMaterialExpressionHairAttributes : UMaterialExpression {
	char bUseTangentSpace : 1; // 0x40
};

struct UMovieSceneCompiledData : UObject {
	FMovieSceneEvaluationTemplate EvaluationTemplate; // 0x28
	FMovieSceneSequenceHierarchy Hierarchy; // 0x188
	FMovieSceneEntityComponentField EntityComponentField; // 0x2a0
	FMovieSceneEvaluationField TrackTemplateField; // 0x390
	TArray<FFrameTime> DeterminismFences; // 0x3c0
	FGuid CompiledSignature; // 0x3d0
	FGuid CompilerVersion; // 0x3e0
	FMovieSceneSequenceCompilerMaskStruct AccumulatedMask; // 0x3f0
	FMovieSceneSequenceCompilerMaskStruct AllocatedMask; // 0x3f1
	EMovieSceneSequenceFlags AccumulatedFlags; // 0x3f2
};

struct USFPSAnimEvent_Weap_Steel_Damage : UAnimNotify {
	bool bFirstEvent; // 0x38
};

struct ASFPSAmbienceSpot : AActor {
	TArray<USFPSSoundBoxCopm*> BoxComponents; // 0x230
	float Chance; // 0x258
	float RainIntensivity; // 0x25c
	TArray<FSoundCues> SoundCues; // 0x260
	float SepDelay; // 0x270
	bool UseAltDelay; // 0x274
	FFloatMinMax FPlayBackDelay; // 0x278
	float SoundDensity; // 0x280
	TArray<UAudioComponent*> AudioComponents; // 0x288
	float FChanceToPlaySmall; // 0x298
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct ASFPSWeatherMan : AActor {
	float Wind_ForceMin; // 0x22c
	float Wind_ForceMax; // 0x230
	float Wind_SpeedMax; // 0x234
	float Wind_TimeActiveMin; // 0x238
	float Wind_TimeActiveMax; // 0x23c
	float Wind_TimeInactiveMin; // 0x240
	float Wind_TimeInactiveMax; // 0x244
	float Wind_DragConst; // 0x248
	float Wind_DragLinear; // 0x24c
	float Wind_DragSq; // 0x250
	UMaterialParameterCollection* ParametersCollection; // 0x280
};

struct UInteractiveToolPropertySet : UObject {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName group; // 0xa8
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct USFPSShellManager : UObject {
	TArray<ASFPSShell*> ShellList_SG0; // 0x28
	TArray<ASFPSShell*> ShellList_AR0; // 0x38
	TArray<ASFPSShell*> ShellList_Gun0; // 0x48
	TArray<ASFPSShell*> ShellList_SR0; // 0x58
	TArray<ASFPSShell*> ShellList_SR1; // 0x68
	ASFPSShell* Shell_SG0; // 0x90
	ASFPSShell* Shell_AR0; // 0x98
	ASFPSShell* Shell_Gun0; // 0xa0
	ASFPSShell* Shell_SR0; // 0xa8
	ASFPSShell* Shell_SR1; // 0xb0
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UfrmAAdminPanelGroup_C : USFPSUserWidget_CraftRolloutMan {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UCheckBox* btnOpen; // 0x2c0
	UImage* imgBackground0; // 0x2c8
	UImage* imgIcon; // 0x2d0
	UScrollBox* sbMain; // 0x2d8
};

struct USFPSUserWidget_ServerListItem : UUserWidget {
	FDelegate OnSelectEvent; // 0x300
	FDelegate OnDblClickedEvent; // 0x310
	FDelegate OnAddFavoriteEvent; // 0x320
};

struct UAISense_Hearing : UAISense {
	TArray<FAINoiseEvent> NoiseEvents; // 0x80
	float SpeedOfSoundSq; // 0x90
};

struct AShootingRangeTarget01_C : ASFPSShootingRangeTarget {
	UStaticMeshComponent* MeshClear; // 0x2f0
	UStaticMeshComponent* MeshDamageServer; // 0x2f8
	UStaticMeshComponent* MeshDamageClient; // 0x300
	UStaticMeshComponent* MeshTarget; // 0x308
	UTextRenderComponent* InfoText; // 0x310
	UStaticMeshComponent* Mesh; // 0x318
};

struct ASFPSCommonGameState : AGameState {
	FSFPSGameplayEventInfoArray GameplayEventInfos; // 0x290
	float Debug_ServerDeltaT; // 0x3a8
	UCurveFloat* TimeDilationCurve; // 0x3b0
	float TimeOfDay; // 0x3b8
	float TimeOfDayUndilated; // 0x3bc
	float TimeOfDayReplicated; // 0x3c0
	float DayLengthInSeconds; // 0x3cc
	float GameplayDayStart; // 0x3d0
	float GameplayDayEnd; // 0x3d4
};

struct UDatasmithCommonTessellationOptions : UDatasmithOptionsBase {
	FDatasmithTessellationOptions Options; // 0x28
};

struct UMaterialExpressionTangentOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UAnimNotify_PlaySound : UAnimNotify {
	USoundBase* Sound; // 0x38
	float VolumeMultiplier; // 0x40
	float PitchMultiplier; // 0x44
	char bFollow : 1; // 0x48
	FName AttachName; // 0x4c
};

struct URadialForceComponent : USceneComponent {
	float Radius; // 0x1f8
	ERadialImpulseFalloff Falloff; // 0x1fc
	float ImpulseStrength; // 0x200
	char bImpulseVelChange : 1; // 0x204
	char bIgnoreOwningActor : 1; // 0x204
	float ForceStrength; // 0x208
	float DestructibleDamage; // 0x20c
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x210
};

struct ASFPSBaseCharacter : ACharacter {
	float Accuracy; // 0x5b0
	AActor* GreenArea; // 0x5b8
	FSFPSCharacterObstacleAnimations ObatacleAnimations; // 0x788
	FSFPSCharacterStairAnimations StairAnimations; // 0x8f0
	USFPSCharacterMovementComponent* MovementComponent; // 0x910
	FSFPSMetabolismParams MetabolismParams; // 0x918
	float StopSprintAngle; // 0x924
	ESFPSCharacterDefaultMeshesType DefaultMeshType; // 0x938
	ESFPSCharacterPantsType PantsType; // 0x939
	ESFPSCharacterPose Pose; // 0x93a
	bool PoseChanging; // 0x93c
	FSFPSCharacterCapsuleHalfHeightChangeTimes CharacterCapsuleHalfHeightChangeTimes; // 0x940
	bool bIsDying; // 0x960
	bool bBusy; // 0x9d0
	USFPSACBaseInventory* ACInventory; // 0x9d8
	ESFPSCharacterTeleportState TeleportState; // 0x9e0
	uint16_t ShotRandomParamsIndex; // 0x9e2
	FVector JumpOverObstacleAction; // 0x9ec
	bool bCanJumpOverObstacle; // 0x9f8
	ESFPSJumpOverObstacleState JumpOverObstacleState; // 0x9f9
	UCurveFloat* JumpDuckCurve; // 0xa00
	UCurveFloat* JumpDuckCoeff; // 0xa08
	FVector JumpOverWindowAction; // 0xa10
	FName StairActorName; // 0xa40
	AActor* Car; // 0xa60
	AActor* LastDriverCar; // 0xa68
	USFPSACSoundSystem* SoundSystem; // 0xa78
	FSFPSCharacterSpeeds CharacterSpeeds; // 0xa88
	bool IsOnStair; // 0xade
	bool IsSprint; // 0xadf
	bool IsWalk; // 0xae0
	float Pitch; // 0xae4
	bool bAiming; // 0xb20
	float WeaponBarrier; // 0xb2c
	TArray<UAnimMontage*> MotionList; // 0xb50
	FGenericTeamId TeamID; // 0xb60
	float TLRP_Angle; // 0xb80
	float TLRP_Speed_StartMove; // 0xb84
	float TLRP_Speed_MaxAngle; // 0xb88
	float TLRP_Speed_Timer; // 0xb8c
	float TLRP_Time; // 0xb90
	float TLRP_Delay_Max; // 0xb94
	float TLRP_Delay_Speed; // 0xb98
};

struct USoundSubmixWithParentBase : USoundSubmixBase {
	USoundSubmixBase* ParentSubmix; // 0x38
};

struct UMatineeCameraShake : UCameraShakeBase {
	float OscillationDuration; // 0xa8
	float OscillationBlendInTime; // 0xac
	float OscillationBlendOutTime; // 0xb0
	FROscillator RotOscillation; // 0xb4
	FVOscillator LocOscillation; // 0xd8
	FFOscillator FOVOscillation; // 0xfc
	float AnimPlayRate; // 0x108
	float AnimScale; // 0x10c
	float AnimBlendInTime; // 0x110
	float AnimBlendOutTime; // 0x114
	float RandomAnimSegmentDuration; // 0x118
	UCameraAnim* Anim; // 0x120
	UCameraAnimationSequence* AnimSequence; // 0x128
	char bRandomAnimSegment : 1; // 0x130
	float OscillatorTimeRemaining; // 0x134
	UCameraAnimInst* AnimInst; // 0x138
	USequenceCameraShakePattern* SequenceShakePattern; // 0x180
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UNetAnalyticsAggregatorConfig : UObject {
	TArray<FNetAnalyticsDataConfig> NetAnalyticsData; // 0x28
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UActorChannel : UChannel {
	AActor* Actor; // 0x68
	TArray<UObject*> CreateSubObjects; // 0x158
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UMovieSceneByteSection : UMovieSceneSection {
	FMovieSceneByteChannel ByteCurve; // 0xf0
};

struct ABM_WallTriaLow_02_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
};

struct Aweapon_firearms_smg_bizon_C : At_FireArm_C {
	UStaticMeshComponent* DTK; // 0x7e0
	UStaticMeshComponent* DeviceLeftMount; // 0x7e8
	UStaticMeshComponent* SightClose; // 0x7f0
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7f8
	UStaticMeshComponent* MagazineFull; // 0x800
	UStaticMeshComponent* MagazineEmpty; // 0x808
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UABP_weapon_firearms_sg_m4_C : USFPSWeaponAnimInstance_SG {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	FAnimNode_Root AnimGraphNode_Root; // 0x318
	FAnimNode_Slot AnimGraphNode_Slot; // 0x348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x390
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3e0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x490
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x510
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x540
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2b0
	float FOVAngle; // 0x2b4
	float OrthoWidth; // 0x2b8
	UTextureRenderTarget2D* TextureTarget; // 0x2c0
	ESceneCaptureCompositeMode CompositeMode; // 0x2c8
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x830
	char bOverride_CustomNearClippingPlane : 1; // 0x834
	float CustomNearClippingPlane; // 0x838
	bool bUseCustomProjectionMatrix; // 0x83c
	FMatrix CustomProjectionMatrix; // 0x840
	bool bEnableClipPlane; // 0x880
	FVector ClipPlaneBase; // 0x884
	FVector ClipPlaneNormal; // 0x890
	char bCameraCutThisFrame : 1; // 0x89c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x89c
	bool bDisableFlipCopyGLES; // 0x8a0
};

struct UShootCrossfadeOuterParams : UObject {
	FDistanceDatum NearShoot; // 0x28
	FDistanceDatum FarShoot; // 0x3c
};

struct UMovieScene3DAttachSection : UMovieScene3DConstraintSection {
	FName AttachSocketName; // 0x118
	FName AttachComponentName; // 0x120
	EAttachmentRule AttachmentLocationRule; // 0x128
	EAttachmentRule AttachmentRotationRule; // 0x129
	EAttachmentRule AttachmentScaleRule; // 0x12a
	EDetachmentRule DetachmentLocationRule; // 0x12b
	EDetachmentRule DetachmentRotationRule; // 0x12c
	EDetachmentRule DetachmentScaleRule; // 0x12d
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct UParticleModuleLocationPrimitiveTriangle : UParticleModuleLocationBase {
	FRawDistributionVector StartOffset; // 0x30
	FRawDistributionFloat Height; // 0x78
	FRawDistributionFloat Angle; // 0xa8
	FRawDistributionFloat Thickness; // 0xd8
};

struct UfrmAllSettingsComboboxes_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* btnMain; // 0x270
	UTextBlock* lbtext; // 0x278
	UComboBoxString* FParentCombobox; // 0x280
	FString FComboboxString; // 0x288
};

struct UBrushBuilder : UObject {
	FString BitmapFilename; // 0x28
	FString ToolTip; // 0x38
	char NotifyBadParams : 1; // 0x48
	TArray<FVector> Vertices; // 0x50
	TArray<FBuilderPoly> Polys; // 0x60
	FName Layer; // 0x70
	char MergeCoplanars : 1; // 0x78
};

struct USFPSAI_TGenerateRandomPoint : UBTTaskNode {
	bool bUseCharacterValue; // 0x70
	float WanderRadius; // 0x74
	bool bCenteredInFront; // 0x78
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct UGeometryCollectionDebugDrawComponent : UActorComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct ALevelSequenceMediaController : AActor {
	ALevelSequenceActor* Sequence; // 0x228
	UMediaComponent* MediaComponent; // 0x230
	float ServerStartTimeSeconds; // 0x238
};

struct AExponentialHeightFog : AInfo {
	UExponentialHeightFogComponent* Component; // 0x220
	char bEnabled : 1; // 0x228
};

struct AStair_tower_wood_01_C : AActor {
	UArrowComponent* Step4; // 0x220
	UArrowComponent* Step8; // 0x228
	UArrowComponent* Step7; // 0x230
	UArrowComponent* Step6; // 0x238
	UArrowComponent* Step5; // 0x240
	UArrowComponent* TopPoint; // 0x248
	UArrowComponent* BottomPoint; // 0x250
	UStaticMeshComponent* Mesh; // 0x258
	UArrowComponent* Step3; // 0x260
	UArrowComponent* Step2; // 0x268
	UArrowComponent* Step1; // 0x270
	UArrowComponent* Step0; // 0x278
	USFPSACStair* SFPSACStair; // 0x280
	UBoxComponent* Overlap; // 0x288
};

struct UDcxVehicleTire : UDataAsset {
	float LateralStiffnessX; // 0x34
	float LateralStiffnessY; // 0x38
	float LongitudinalStiffnessPerUnitGravity; // 0x3c
	float CamberStiffnessPerUnitGravity; // 0x40
	FRuntimeFloatCurve FrictionVsSlipGraph; // 0x48
	TArray<FDcxDrivableSurfaceToTireFrictionPair> DrivableSurfaceToTireFrictionPairs; // 0xd0
};

struct ASFPSInventoryDeviceItem : ASFPSBaseItem {
	int32_t ID; // 0x310
	FVector Coords; // 0x314
	int64_t Time; // 0x320
};

struct UAIPerceptionComponent : UActorComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xb0
	UAISense* DominantSense; // 0xc0
	AAIController* AIOwner; // 0xd8
	FMulticastInlineDelegate OnPerceptionUpdated; // 0x160
	FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170
	FMulticastInlineDelegate OnTargetPerceptionInfoUpdated; // 0x180
};

struct UInputKeySelector : UWidget {
	FButtonStyle WidgetStyle; // 0x108
	FTextBlockStyle TextStyle; // 0x380
	FInputChord SelectedKey; // 0x5f0
	FSlateFontInfo Font; // 0x610
	FMargin Margin; // 0x668
	FLinearColor ColorAndOpacity; // 0x678
	FText KeySelectionText; // 0x688
	FText NoKeySpecifiedText; // 0x6a0
	bool bAllowModifierKeys; // 0x6b8
	bool bAllowGamepadKeys; // 0x6b9
	TArray<FKey> EscapeKeys; // 0x6c0
	FMulticastInlineDelegate OnKeySelected; // 0x6d0
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6e0
};

struct AMainMenuGameMode_C : AGameMode {
	USceneComponent* DefaultSceneRoot; // 0x308
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded : UParticleModuleLocationPrimitiveCylinder {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct URandomVector : UFieldNodeVector {
	float Magnitude; // 0xb0
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct UInterpTrackInstColorProp : UInterpTrackInstProperty {
	FColor ResetColor; // 0x58
};

struct UAvoidanceManager : UObject {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x258
	int32_t Priority; // 0x25c
	float FluidFriction; // 0x260
	char bWaterVolume : 1; // 0x264
	char bPhysicsOnContact : 1; // 0x264
};

struct USFPSACVehicleSoundSystem : UActorComponent {
	USoundCue* EngineCue; // 0xb0
	USoundCue* SuspensCue; // 0xb8
	USoundCue* ExtraStopCue; // 0xc0
	USoundCue* HandBrakeCue; // 0xc8
	USoundCue* CrashCue; // 0xd0
	USoundCue* DoorCue; // 0xd8
	USoundCue* BaseTiresCue; // 0xe0
	USoundCue* UnderwaterTires; // 0xe8
	USoundCue* CarDamageExplCue; // 0xf0
	USoundCue* CarHornCue; // 0xf8
	UDcxVehicleDriveComponent* OwnerVehicleComp; // 0x100
	float fEngineActive; // 0x108
	UAudioComponent* EngineAudioComponent; // 0x110
	UAudioComponent* DamageAudioComponent; // 0x118
	UAudioComponent* RoadTiresAudioComponent; // 0x120
	UAudioComponent* SuspensAudioComponent; // 0x128
	UAudioComponent* StopAudioComponent; // 0x130
	UAudioComponent* HornAudioComponent; // 0x138
	TWeakObjectPtr<UParticleSystemComponent> TiresParticleComponent; // 0x140
	TWeakObjectPtr<UParticleSystemComponent> DamageParticleComponent; // 0x148
	TWeakObjectPtr<UParticleSystemComponent> ExhaustPipeParticleComponent; // 0x150
	USoundCue* tPhysMatSound; // 0x158
	float LastSusp; // 0x160
	float CurDepth; // 0x164
	float LastRPM; // 0x178
	bool bIsPressed; // 0x17c
	bool bIsStopping; // 0x17d
	FVector LastCarLocation; // 0x180
	FRotator LastCarRotation; // 0x18c
	float LastForwSpeed; // 0x198
	bool bIsInAir; // 0x19c
	bool bIsLanded; // 0x19d
	bool bIsInWater; // 0x19e
	float HornPitch; // 0x1a0
	FComponentPos ComponentPositions; // 0x1a4
	bool bInited; // 0x1f8
	bool bEngineAct; // 0x1f9
	bool bUnderwaterIsActive; // 0x1fa
	float IncRPMSpeed; // 0x1fc
	float DecRPMSpeed; // 0x200
	float MinAngleToBrakes; // 0x204
	float MinForwSpeedToBrakes; // 0x208
	float MinDetentToBrakes; // 0x20c
	float MinRPMToBrakes; // 0x210
	float HeightPlay; // 0x214
	float ZShiftUp; // 0x218
	float ZShiftDown; // 0x21c
	float FlyTraceDistance; // 0x220
	float TireFadeTime; // 0x224
	float ActorMaxForwSpeed; // 0x228
	float MinDifRotToAbruptStop; // 0x22c
	float MinDifSpeedToAbruptStop; // 0x230
	UParticleSystem* LightBumpParticle; // 0x238
	UParticleSystem* ExhaustParticle; // 0x240
	UParticleSystem* LowWaterTiresParticle; // 0x248
	UParticleSystem* DeepWaterTiresParticle; // 0x250
	float WaterDeepDistance; // 0x258
	UParticleSystem* LightDamageParticle; // 0x260
	UParticleSystem* HeavyDamageParticle; // 0x268
	UParticleSystem* VehicleDestroyedParticle; // 0x270
	UParticleSystem* VehicleExplosionParticle; // 0x278
	float LightDamageStart; // 0x280
	float HeavyDamageStart; // 0x284
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t Row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t Column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ACableActor : AActor {
	UCableComponent* CableComponent; // 0x220
};

struct UfrmFilterCombobox_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* btnFitlter; // 0x270
	UTextBlock* lbtext; // 0x278
	FString FComboboxString; // 0x280
	UComboBoxString* FParentCombobox; // 0x290
};

struct UTexture2D : UTexture {
	int32_t LevelIndex; // 0x178
	int32_t FirstResourceMemMip; // 0x17c
	char bTemporarilyDisableStreaming : 1; // 0x180
	TextureAddress AddressX; // 0x181
	TextureAddress AddressY; // 0x182
	FIntPoint ImportedSize; // 0x184
};

struct UARMeshComponent : UARComponent {
	FARMeshUpdatePayload ReplicatedPayload; // 0x280
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct UToFloatField : UFieldNodeFloat {
	UFieldNodeInt* IntField; // 0xb0
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UOnsetNRTSettings : UAudioSynesthesiaNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct Aweapmf_flashlight_02_C : At_HandguardDeviceLeft_C {
	UStaticMeshComponent* Glow; // 0x358
	USpotLightComponent* Light; // 0x360
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct Aweapmf_DTK_762x39_02_C : At_MuzzleAttachement_C {
	USceneComponent* Muzzle; // 0x390
};

struct UMaterialExpressionSkyAtmosphereLightDirection : UMaterialExpression {
	int32_t LightIndex; // 0x40
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	TArray<FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo; // 0x318
	char bIsLayerThumbnail : 1; // 0x328
	char bDisableTessellation : 1; // 0x328
	char bMobile : 1; // 0x328
	char bEditorToolUsage : 1; // 0x328
};

struct UWidgetNavigation : UObject {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x4c
	FWidgetNavigationData Left; // 0x70
	FWidgetNavigationData Right; // 0x94
	FWidgetNavigationData Next; // 0xb8
	FWidgetNavigationData Previous; // 0xdc
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x220
};

struct AServerStatReplicator : AInfo {
	bool bUpdateStatNet; // 0x220
	bool bOverwriteClientStats; // 0x221
	uint32_t Channels; // 0x224
	uint32_t InRate; // 0x228
	uint32_t OutRate; // 0x22c
	uint32_t MaxPacketOverhead; // 0x234
	uint32_t InRateClientMax; // 0x238
	uint32_t InRateClientMin; // 0x23c
	uint32_t InRateClientAvg; // 0x240
	uint32_t InPacketsClientMax; // 0x244
	uint32_t InPacketsClientMin; // 0x248
	uint32_t InPacketsClientAvg; // 0x24c
	uint32_t OutRateClientMax; // 0x250
	uint32_t OutRateClientMin; // 0x254
	uint32_t OutRateClientAvg; // 0x258
	uint32_t OutPacketsClientMax; // 0x25c
	uint32_t OutPacketsClientMin; // 0x260
	uint32_t OutPacketsClientAvg; // 0x264
	uint32_t NetNumClients; // 0x268
	uint32_t InPackets; // 0x26c
	uint32_t OutPackets; // 0x270
	uint32_t InBunches; // 0x274
	uint32_t OutBunches; // 0x278
	uint32_t OutLoss; // 0x27c
	uint32_t InLoss; // 0x280
	uint32_t VoiceBytesSent; // 0x284
	uint32_t VoiceBytesRecv; // 0x288
	uint32_t VoicePacketsSent; // 0x28c
	uint32_t VoicePacketsRecv; // 0x290
	uint32_t PercentInVoice; // 0x294
	uint32_t PercentOutVoice; // 0x298
	uint32_t NumActorChannels; // 0x29c
	uint32_t NumConsideredActors; // 0x2a0
	uint32_t PrioritizedActors; // 0x2a4
	uint32_t NumRelevantActors; // 0x2a8
	uint32_t NumRelevantDeletedActors; // 0x2ac
	uint32_t NumReplicatedActorAttempts; // 0x2b0
	uint32_t NumReplicatedActors; // 0x2b4
	uint32_t NumActors; // 0x2b8
	uint32_t NumNetActors; // 0x2bc
	uint32_t NumDormantActors; // 0x2c0
	uint32_t NumInitiallyDormantActors; // 0x2c4
	uint32_t NumNetGUIDsAckd; // 0x2c8
	uint32_t NumNetGUIDsPending; // 0x2cc
	uint32_t NumNetGUIDsUnAckd; // 0x2d0
	uint32_t ObjPathBytes; // 0x2d4
	uint32_t NetGUIDOutRate; // 0x2d8
	uint32_t NetGUIDInRate; // 0x2dc
	uint32_t NetSaturated; // 0x2e0
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UTextureRenderTarget2DArray : UTextureRenderTarget {
	int32_t SizeX; // 0x180
	int32_t SizeY; // 0x184
	int32_t Slices; // 0x188
	FLinearColor ClearColor; // 0x18c
	EPixelFormat OverrideFormat; // 0x19c
	char bHDR : 1; // 0x19d
	char bForceLinearGamma : 1; // 0x19d
};

struct USFPSAI_TChangeAiming : UBTTaskNode {
	bool Aiming; // 0x70
};

struct UGeometryCollection : UObject {
	bool EnableClustering; // 0x30
	int32_t ClusterGroupIndex; // 0x34
	int32_t MaxClusterLevel; // 0x38
	TArray<float> DamageThreshold; // 0x40
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x50
	TArray<FGeometryCollectionSource> GeometrySource; // 0x58
	TArray<UMaterialInterface*> Materials; // 0x68
	ECollisionTypeEnum CollisionType; // 0x78
	EImplicitTypeEnum ImplicitType; // 0x79
	int32_t MinLevelSetResolution; // 0x7c
	int32_t MaxLevelSetResolution; // 0x80
	int32_t MinClusterLevelSetResolution; // 0x84
	int32_t MaxClusterLevelSetResolution; // 0x88
	float CollisionObjectReductionPercentage; // 0x8c
	bool bMassAsDensity; // 0x90
	float Mass; // 0x94
	float MinimumMassClamp; // 0x98
	float CollisionParticlesFraction; // 0x9c
	int32_t MaximumCollisionParticles; // 0xa0
	TArray<FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0xa8
	bool EnableRemovePiecesOnFracture; // 0xb8
	TArray<UMaterialInterface*> RemoveOnFractureMaterials; // 0xc0
	FGuid PersistentGuid; // 0xd0
	FGuid StateGuid; // 0xe0
	int32_t BoneSelectedMaterialIndex; // 0xf0
};

struct UGameplayTagsSettings : UGameplayTagsList {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool ClearInvalidTags; // 0x4a
	bool FastReplication; // 0x4b
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UfrmSpriteViewInv_C : USFPSUserWidget_SpriteViewInv {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UButton* btnMain; // 0x2f0
	USFPSUserWidget_EquipItem* pnMain; // 0x2f8
};

struct UDcxVehicleDriveRawInput : UDcxVehicleWheelsRawInput {
	int32_t ClutchIndex; // 0x40
	bool bGearUp; // 0x44
	bool bGearDown; // 0x45
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UCloudStorageBase : UPlatformInterfaceBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
	char bPostUpdateTickGroup : 1; // 0x228
	char bCurrentlyActive : 1; // 0x228
	FMulticastInlineDelegate OnParticleSpawn; // 0x230
	FMulticastInlineDelegate OnParticleBurst; // 0x240
	FMulticastInlineDelegate OnParticleDeath; // 0x250
	FMulticastInlineDelegate OnParticleCollide; // 0x260
};

struct UMovieSceneCameraShakeSourceShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
};

struct ULevelSequenceDirector : UObject {
	ULevelSequencePlayer* Player; // 0x28
	int32_t SubSequenceID; // 0x30
	int32_t MovieScenePlayerIndex; // 0x34
};

struct UFormAdmin_C : UUserWidget {
	UButton* Base_btnCopyPlayer; // 0x268
	UButton* Base_btnDelBase; // 0x270
	UButton* Base_btnDelBoxes; // 0x278
	UButton* Base_btnKeyChance; // 0x280
	UButton* Base_btnSteamProfile; // 0x288
	UButton* Base_btnStromTime; // 0x290
	UCheckBox* btnBase; // 0x298
	UCheckBox* btnBattlePVEOnly; // 0x2a0
	UCheckBox* btnBattlePVPPVE; // 0x2a8
	UButton* btnBuyServer; // 0x2b0
	UCheckBox* btnCameraFPS; // 0x2b8
	UCheckBox* btnCameraFPSTPS; // 0x2c0
	UCheckBox* btnCameraTPS; // 0x2c8
	UCheckBox* btnDeathLog; // 0x2d0
	UCheckBox* btnGameplay; // 0x2d8
	UCheckBox* btnItems; // 0x2e0
	UCheckBox* btnMessages; // 0x2e8
	UCheckBox* btnPlayers; // 0x2f0
	UCheckBox* btnServer; // 0x2f8
	UButton* btnServer_Teleport0; // 0x300
	UButton* btnServer_Teleport1; // 0x308
	UButton* btnServer_Teleport2; // 0x310
	UButton* btnServer_Teleport3; // 0x318
	UButton* btnServer_Teleport4; // 0x320
	UButton* btnServer_TeleportDead; // 0x328
	UCheckBox* btnVACNo; // 0x330
	UCheckBox* btnVACYes; // 0x338
	UButton* DeathLog_btnCopy; // 0x340
	UButton* DeathLog_btnDownload; // 0x348
	UfrmAdminPanelDeathRecord_C* frmAdminPanelDeathRecord; // 0x350
	UfrmAdminPanelDeathRecord_C* frmAdminPanelDeathRecord_125; // 0x358
	UImage* Gameplay_Background_2; // 0x360
	UImage* Gameplay_BackLine_2; // 0x368
	UImage* Gameplay_BackLine_3; // 0x370
	UImage* Gameplay_BackLine_4; // 0x378
	UImage* Gameplay_BackLine_5; // 0x380
	UImage* Gameplay_BackLine_6; // 0x388
	UImage* Gameplay_BackLine_7; // 0x390
	UImage* Gameplay_BackLine_8; // 0x398
	UImage* Gameplay_BackLine_9; // 0x3a0
	UButton* Gameplay_btnApplyAISettings; // 0x3a8
	UButton* Gameplay_btnApplyEventsSettings; // 0x3b0
	UCheckBox* Gameplay_btnDynamicTimeScaleOff; // 0x3b8
	UCheckBox* Gameplay_btnDynamicTimeScaleOn; // 0x3c0
	UCheckBox* Gameplay_btnPatrolOff; // 0x3c8
	UCheckBox* Gameplay_btnPatrolOn; // 0x3d0
	UImage* imgButtonsBackground; // 0x3d8
	UButton* Messages_btnMsgTimer; // 0x3e0
	UButton* Messages_btnSaveMOTD; // 0x3e8
	UButton* Messages_btnSaveMsg; // 0x3f0
	UButton* Messages_btnSendMOTD; // 0x3f8
	UButton* Messages_btnSendMsg; // 0x400
	UMultiLineEditableTextBox* Messages_mMOTD; // 0x408
	UMultiLineEditableTextBox* Messages_mMsg; // 0x410
	UButton* Players_btnAddToAdmins; // 0x418
	UButton* Players_btnBan; // 0x420
	UButton* Players_btnCopyBanned; // 0x428
	UButton* Players_btnCopyPlayer; // 0x430
	UButton* Players_btnDelFromAdmins; // 0x438
	UButton* Players_btnHandBan; // 0x440
	UButton* Players_btnSteamProfile; // 0x448
	UButton* Players_btnSteamProfileAdmins; // 0x450
	UButton* Players_btnSteamProfileBanned; // 0x458
	UButton* Players_btnSteamProfileHandBan; // 0x460
	UButton* Players_btnUnban; // 0x468
	UButton* Server_btnAdminSlotReserv; // 0x470
	UButton* Server_btnGameTime; // 0x478
	UButton* Server_btnInactiveBaseLifeTime; // 0x480
	UButton* Server_btnLootSpawnChance; // 0x488
	UButton* Server_btnPassword; // 0x490
	UButton* Server_btnPlayersMaxCount; // 0x498
	UCheckBox* Server_btnRestart0; // 0x4a0
	UCheckBox* Server_btnRestart1; // 0x4a8
	UCheckBox* Server_btnRestart10; // 0x4b0
	UCheckBox* Server_btnRestart11; // 0x4b8
	UCheckBox* Server_btnRestart12; // 0x4c0
	UCheckBox* Server_btnRestart13; // 0x4c8
	UCheckBox* Server_btnRestart14; // 0x4d0
	UCheckBox* Server_btnRestart15; // 0x4d8
	UCheckBox* Server_btnRestart16; // 0x4e0
	UCheckBox* Server_btnRestart17; // 0x4e8
	UCheckBox* Server_btnRestart18; // 0x4f0
	UCheckBox* Server_btnRestart19; // 0x4f8
	UCheckBox* Server_btnRestart2; // 0x500
	UCheckBox* Server_btnRestart20; // 0x508
	UCheckBox* Server_btnRestart21; // 0x510
	UCheckBox* Server_btnRestart22; // 0x518
	UCheckBox* Server_btnRestart23; // 0x520
	UCheckBox* Server_btnRestart3; // 0x528
	UCheckBox* Server_btnRestart4; // 0x530
	UCheckBox* Server_btnRestart5; // 0x538
	UCheckBox* Server_btnRestart6; // 0x540
	UCheckBox* Server_btnRestart7; // 0x548
	UCheckBox* Server_btnRestart8; // 0x550
	UCheckBox* Server_btnRestart9; // 0x558
	UButton* Server_btnSquadSize; // 0x560
};

struct USFPSAI_TDebug : UBTTaskNode {
	FString Text; // 0x70
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4e0
};

struct UAnimCompress_RemoveEverySecondKey : UAnimCompress {
	int32_t MinKeys; // 0x40
	char bStartAtSecondKey : 1; // 0x44
};

struct UParticleModuleVelocity_Seeded : UParticleModuleVelocity {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UAREnvironmentProbeComponent : UARComponent {
	FAREnvironmentProbeUpdatePayload ReplicatedPayload; // 0x280
};

struct Adevice_flashlight_02_C : At_Device_C {
	UStaticMeshComponent* Glow; // 0x4a0
	USpotLightComponent* Light; // 0x4a8
};

struct UMovieSceneComponentMaterialTrack : UMovieSceneMaterialTrack {
	int32_t MaterialIndex; // 0xa8
};

struct USFPSACInventory : USFPSACBaseInventory {
	TArray<ASFPSBaseItem*> CraftItems; // 0x170
	TArray<ASFPSBaseItem*> Cell0; // 0x180
	TArray<ASFPSBaseItem*> Cell1; // 0x190
	TArray<bool> CellLoaded; // 0x1a0
	FDelegate Server_MoveToSteamInventory_Callback; // 0x1e0
	FDelegate Server_MoveToInventory_FromSteamInventory_Callback; // 0x1f0
	FDelegate Server_MoveToEquip_FromSteamInventory_Callback; // 0x200
	FDelegate Server_MoveToWeaponMFInventory_FromSteamInventory_Callback; // 0x210
	FDelegate Server_MoveToGround_FromSteamInventory_Callback; // 0x220
};

struct UARPointComponent : UARComponent {
	FARPointUpdatePayload ReplicatedPayload; // 0x278
};

struct AScope_col_halosun_C : At_Sight_C {
	UStaticMeshComponent* deltapoint_collimator; // 0x3d0
};

struct UWidget : UVisual {
	UPanelSlot* Slot; // 0x28
	FDelegate bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	FDelegate ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	FDelegate ToolTipWidgetDelegate; // 0x70
	FDelegate VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	EMouseCursor Cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct Aweapon_firearms_gun_tt_C : At_FireArm_C {
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e0
	UStaticMeshComponent* MagazineFull; // 0x7e8
	UStaticMeshComponent* MagazineEmpty; // 0x7f0
};

struct UMaterialExpressionHairColor : UMaterialExpression {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct UThrobber : UWidget {
	int32_t NumberOfPieces; // 0x108
	bool bAnimateHorizontally; // 0x10c
	bool bAnimateVertically; // 0x10d
	bool bAnimateOpacity; // 0x10e
	USlateBrushAsset* PieceImage; // 0x110
	FSlateBrush Image; // 0x118
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UMaterialExpressionSobol : UMaterialExpression {
	FExpressionInput Cell; // 0x40
	FExpressionInput Index; // 0x54
	FExpressionInput Seed; // 0x68
	uint32_t ConstIndex; // 0x7c
	FVector2D ConstSeed; // 0x80
};

struct UTextureRenderTargetCube : UTextureRenderTarget {
	int32_t SizeX; // 0x180
	FLinearColor ClearColor; // 0x184
	EPixelFormat OverrideFormat; // 0x194
	char bHDR : 1; // 0x195
	char bForceLinearGamma : 1; // 0x195
};

struct ASFPSWeaponMF_MuzzleAttachment : ASFPSBaseWeaponMF {
	UParticleSystem* ShotParticle; // 0x330
	ESFPSSmallArmsMuzzleAttachmentType MuzzleAttachmentType; // 0x338
	FTransform SocketMuzzle; // 0x340
	float Length; // 0x370
	float RecoilMul; // 0x374
};

struct UARFaceGeometry : UARTrackedGeometry {
	FVector LookAtTarget; // 0xf8
	bool bIsTracked; // 0x104
	TMap<EARFaceBlendShape, float> BlendShapes; // 0x108
	FTransform LeftEyeTransform; // 0x190
	FTransform RightEyeTransform; // 0x1c0
};

struct ASkyAtmosphere : AInfo {
	USkyAtmosphereComponent* SkyAtmosphereComponent; // 0x220
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x48
};

struct UNavLinkDefinition : UObject {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UfrmPopupMenu_C : UUserWidget {
	UImage* imgBackgroun1; // 0x268
	UImage* imgBackgroun2; // 0x270
	UImage* imgBackgroun3; // 0x278
	UImage* imgBackgroun4; // 0x280
	UImage* imgBackgroun5; // 0x288
	UImage* imgBackgroun6; // 0x290
	UImage* imgBackgroun7; // 0x298
	UImage* imgBackgroun8; // 0x2a0
	UCanvasPanel* pnBackground; // 0x2a8
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	char bVisibleInRayTracing : 1; // 0x158
	char bEvaluateWorldPositionOffset : 1; // 0x158
	FBodyInstance BodyInstance; // 0x160
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x2b8
	FLightingChannels LightingChannels; // 0x2b9
	char bRenderCustomDepth : 1; // 0x2bc
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x2c0
	int32_t CustomDepthStencilValue; // 0x2c4
	int32_t TranslucencySortPriority; // 0x2c8
	float CollisionRadius; // 0x2cc
	float ShadeRadius; // 0x2d0
	int32_t NumSteps; // 0x2d4
	float InitialSeedDensity; // 0x2d8
	float AverageSpreadDistance; // 0x2dc
	float SpreadVariance; // 0x2e0
	int32_t SeedsPerStep; // 0x2e4
	int32_t DistributionSeed; // 0x2e8
	float MaxInitialSeedOffset; // 0x2ec
	bool bCanGrowInShade; // 0x2f0
	bool bSpawnsInShade; // 0x2f1
	float MaxInitialAge; // 0x2f4
	float MaxAge; // 0x2f8
	float OverlapPriority; // 0x2fc
	FFloatInterval ProceduralScale; // 0x300
	FRuntimeFloatCurve ScaleCurve; // 0x308
	int32_t ChangeCount; // 0x390
	char ReapplyDensity : 1; // 0x394
	char ReapplyRadius : 1; // 0x394
	char ReapplyAlignToNormal : 1; // 0x394
	char ReapplyRandomYaw : 1; // 0x394
	char ReapplyScaling : 1; // 0x394
	char ReapplyScaleX : 1; // 0x394
	char ReapplyScaleY : 1; // 0x394
	char ReapplyScaleZ : 1; // 0x394
	char ReapplyRandomPitchAngle : 1; // 0x395
	char ReapplyGroundSlope : 1; // 0x395
	char ReapplyHeight : 1; // 0x395
	char ReapplyLandscapeLayers : 1; // 0x395
	char ReapplyZOffset : 1; // 0x395
	char ReapplyCollisionWithWorld : 1; // 0x395
	char ReapplyVertexColorMask : 1; // 0x395
	char bEnableDensityScaling : 1; // 0x395
	char bEnableDiscardOnLoad : 1; // 0x396
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x398
	int32_t VirtualTextureCullMips; // 0x3a8
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x3ac
};

struct UInterpTrackMoveAxis : UInterpTrackFloatBase {
	EInterpMoveAxis MoveAxis; // 0x90
	FInterpLookupTrack LookupTrack; // 0x98
};

struct UMaterialFunctionInstance : UMaterialFunctionInterface {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct USFPSCameraShake : UMatineeCameraShake {
	float FirstPersonScale; // 0x1b0
	float ThirdPersonScale; // 0x1b4
};

struct UNavigationSystemModuleConfig : UNavigationSystemConfig {
	char bStrictlyStatic : 1; // 0x50
	char bCreateOnClient : 1; // 0x50
	char bAutoSpawnMissingNavData : 1; // 0x50
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x50
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x428
	char bDrawPolyEdges : 1; // 0x428
	char bDrawFilledPolys : 1; // 0x428
	char bDrawNavMeshEdges : 1; // 0x428
	char bDrawTileBounds : 1; // 0x428
	char bDrawPathCollidingGeometry : 1; // 0x428
	char bDrawTileLabels : 1; // 0x428
	char bDrawPolygonLabels : 1; // 0x428
	char bDrawDefaultPolygonCost : 1; // 0x429
	char bDrawPolygonFlags : 1; // 0x429
	char bDrawLabelsOnPathNodes : 1; // 0x429
	char bDrawNavLinks : 1; // 0x429
	char bDrawFailedNavLinks : 1; // 0x429
	char bDrawClusters : 1; // 0x429
	char bDrawOctree : 1; // 0x429
	char bDrawOctreeDetails : 1; // 0x429
	char bDrawMarkedForbiddenPolys : 1; // 0x42a
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x42a
	float DrawOffset; // 0x42c
	char bFixedTilePoolSize : 1; // 0x430
	int32_t TilePoolSize; // 0x434
	float TileSizeUU; // 0x438
	float CellSize; // 0x43c
	float CellHeight; // 0x440
	float AgentRadius; // 0x444
	float AgentHeight; // 0x448
	float AgentMaxSlope; // 0x44c
	float AgentMaxStepHeight; // 0x450
	float MinRegionArea; // 0x454
	float MergeRegionSize; // 0x458
	float MaxSimplificationError; // 0x45c
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x460
	int32_t TileNumberHardLimit; // 0x464
	int32_t PolyRefTileBits; // 0x468
	int32_t PolyRefNavPolyBits; // 0x46c
	int32_t PolyRefSaltBits; // 0x470
	FVector NavMeshOriginOffset; // 0x474
	float DefaultDrawDistance; // 0x480
	float DefaultMaxSearchNodes; // 0x484
	float DefaultMaxHierarchicalSearchNodes; // 0x488
	ERecastPartitioning RegionPartitioning; // 0x48c
	ERecastPartitioning LayerPartitioning; // 0x48d
	int32_t RegionChunkSplits; // 0x490
	int32_t LayerChunkSplits; // 0x494
	char bSortNavigationAreasByCost : 1; // 0x498
	char bPerformVoxelFiltering : 1; // 0x498
	char bMarkLowHeightAreas : 1; // 0x498
	char bUseExtraTopCellWhenMarkingAreas : 1; // 0x498
	char bFilterLowSpanSequences : 1; // 0x498
	char bFilterLowSpanFromTileCache : 1; // 0x498
	char bDoFullyAsyncNavDataGathering : 1; // 0x498
	char bUseBetterOffsetsFromCorners : 1; // 0x498
	char bStoreEmptyTileLayers : 1; // 0x499
	char bUseVirtualFilters : 1; // 0x499
	char bAllowNavLinkAsPathEnd : 1; // 0x499
	char bUseVoxelCache : 1; // 0x499
	float TileSetUpdateInterval; // 0x49c
	float HeuristicScale; // 0x4a0
	float VerticalDeviationFromGroundCompensation; // 0x4a4
};

struct UNamedInterfaces : UObject {
	TArray<FNamedInterface> NamedInterfaces; // 0x28
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x38
};

struct USFPSMapHandler : UObject {
	bool bVisible; // 0x248
	UUserWidget* FormMap; // 0x250
	USFPSUserWidget_MapElement* MapElement_Player; // 0x258
	USFPSUserWidget_MapElement* MapElement_Mission; // 0x260
	USFPSUserWidget_MapElement* MapElement_SaveScaleMission; // 0x268
	USFPSUserWidget_MapElement* MapElement_AllPlayersMarker; // 0x270
	USFPSUserWidget_MapElement* MapElement_AllBasesMarker; // 0x278
	USFPSUserWidget_MapElement* MapElement_AllBotsMarker; // 0x280
	USFPSUserWidget_MapElement* MapElement_TacticalMarker; // 0x288
	USFPSUserWidget_MapElement* MapElement_DeadMarker; // 0x290
	USFPSUserWidget_MapElement* MapElement_LootStash; // 0x298
	USFPSUserWidget_MapElement* MapElement_GreenArea; // 0x2a0
	USFPSUserWidget_MapElement* MapElement_RedArea; // 0x2a8
	USFPSUserWidget_MapElement* MapElement_Base; // 0x2b0
	USFPSUserWidget_MapElement* MapElement_Location; // 0x2b8
	USFPSUserWidget_MapElement* MapElement_SquadMarker; // 0x2c0
	USFPSUserWidget_MapElement* MapElement_TripwireTrap; // 0x2c8
	TArray<USFPSTacticalMarker*> TacticalMarkers; // 0x2d0
	USFPSTacticalMarker* DeadMarker; // 0x2e0
	TArray<USFPSLootStashMarker*> LootStashMarkers; // 0x2e8
	TArray<USFPSMissionMarker*> MissionMarkers; // 0x2f8
	TArray<USFPSSaveScaleMissionMarker*> SaveScaleMissionMarkers; // 0x308
	TArray<USFPSAllPlayersMarker*> AllPlayersMarkers; // 0x318
	TArray<USFPSAllBasesMarker*> AllBasesMarkers; // 0x328
	TArray<USFPSAllBotsMarker*> AllBotsMarkers; // 0x338
	TArray<USFPSGreenAreaMarker*> GreeenAreaMarkers; // 0x348
	TArray<USFPSBaseMarker*> BaseMarkers; // 0x358
	TArray<USFPSLocationMarker*> LocalitiesMarkers; // 0x368
	TArray<USFPSSquadMarker*> SquadMarkers; // 0x378
	TArray<USFPSTripwireTrapMarker*> TripwireTrapMarkers; // 0x388
};

struct USFPSUserWidget_RadialMenu : UUserWidget {
	int32_t SelectedIndex; // 0x270
};

struct ASFPSGameplayItem : ASFPSBaseItem {
	ESFPSGameplayEventInfoType ClientInfoType; // 0x310
	TArray<FSFPSItemSetStruct> LootSets; // 0x350
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UGizmoLocalFloatParameterSource : UGizmoBaseFloatParameterSource {
	float Value; // 0x48
	FGizmoFloatParameterChange LastChange; // 0x4c
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x288
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x48
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UInterpTrackInstProperty : UInterpTrackInst {
	TFieldPath<FProperty> InterpProperty; // 0x28
	UObject* PropertyOuterObjectInst; // 0x48
};

struct UMovieScene3DConstraintSection : UMovieSceneSection {
	FGuid ConstraintId; // 0xe8
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf8
};

struct UTestMovieSceneEvalHookTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x90
};

struct ASFPSLootBoxSpawner : ASFPSBaseLootSpawner {
	ASFPSLootBox* LootBox; // 0x248
	ASFPSLootBox* LootBoxClass; // 0x270
	TArray<FSFPSItemSetStruct> ItemsToSpawn; // 0x278
};

struct UGizmoLocalVec2ParameterSource : UGizmoBaseVec2ParameterSource {
	FVector2D Value; // 0x48
	FGizmoVec2ParameterChange LastChange; // 0x50
};

struct UEnvQueryTest_Overlap : UEnvQueryTest {
	FEnvOverlapData OverlapData; // 0x1f8
};

struct UMediaTexture : UTexture {
	TextureAddress AddressX; // 0x178
	TextureAddress AddressY; // 0x179
	bool AutoClear; // 0x17a
	FLinearColor ClearColor; // 0x17c
	bool EnableGenMips; // 0x18c
	char NumMips; // 0x18d
	bool NewStyleOutput; // 0x18e
	MediaTextureOutputFormat OutputFormat; // 0x18f
	float CurrentAspectRatio; // 0x190
	MediaTextureOrientation CurrentOrientation; // 0x194
	UMediaPlayer* MediaPlayer; // 0x198
};

struct AShell_SR0_C : ASFPSShell {
	UStaticMeshComponent* Mesh; // 0x250
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UBTDecorator_Cooldown : UBTDecorator {
	float CooldownTime; // 0x68
};

struct UCompositeCameraShakePattern : UCameraShakePattern {
	TArray<UCameraShakePattern*> ChildPatterns; // 0x28
};

struct Adevice_lighter_02_C : At_Device_C {
	UStaticMeshComponent* Flame; // 0x4a0
	UPointLightComponent* PointLight; // 0x4a8
};

struct USFPSUserWidget_HUDChatBox : UUserWidget {
	int32_t LabelsCount; // 0x2dc
	FSlateFontInfo Font; // 0x2e0
	float ViewportScale; // 0x338
};

struct UMaterialExpressionArccosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0x198
	EARDepthAccuracy DepthAccuracy; // 0x199
	bool bIsTemporallySmoothed; // 0x19a
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x90
	FMovieScenePropertyBinding PropertyBinding; // 0x98
	TArray<UMovieSceneSection*> Sections; // 0xb0
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x230
};

struct ABM_Stairs_01_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
};

struct UMovieScene : UMovieSceneSignedObject {
	TArray<FMovieSceneSpawnable> Spawnables; // 0x50
	TArray<FMovieScenePossessable> Possessables; // 0x60
	TArray<FMovieSceneBinding> ObjectBindings; // 0x70
	TMap<FName, FMovieSceneObjectBindingIDs> BindingGroups; // 0x80
	TArray<UMovieSceneTrack*> MasterTracks; // 0xd0
	UMovieSceneTrack* CameraCutTrack; // 0xe0
	FMovieSceneFrameRange SelectionRange; // 0xe8
	FMovieSceneFrameRange PlaybackRange; // 0xf8
	FFrameRate TickResolution; // 0x108
	FFrameRate DisplayRate; // 0x110
	EMovieSceneEvaluationType EvaluationType; // 0x118
	EUpdateClockSource ClockSource; // 0x119
	FSoftObjectPath CustomClockSourcePath; // 0x120
	TArray<FMovieSceneMarkedFrame> MarkedFrames; // 0x138
};

struct UAnimNotifyState_TimedParticleEffect : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UMaterialExpressionClearCoatNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UGetGeoLocationAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct Aweapmf_DTK_dot45_01_C : At_MuzzleAttachement_C {
	USceneComponent* Muzzle; // 0x390
};

struct UGizmoPlaneTranslationParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	FVector2D Parameter; // 0xb0
	FGizmoVec2ParameterChange LastChange; // 0xb8
	FVector CurTranslationOrigin; // 0xc8
	FVector CurTranslationNormal; // 0xd4
	FVector CurTranslationAxisX; // 0xe0
	FVector CurTranslationAxisY; // 0xec
	FTransform InitialTransform; // 0x100
};

struct UMaterialExpressionQualitySwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct UBTService_BlueprintBase : UBTService {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UMaterialExpressionBlackBody : UMaterialExpression {
	FExpressionInput Temp; // 0x40
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTextureEnableAutoImport : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char bReflectionCaptureCompression : 1; // 0x6c
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6d
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	EFixedFoveationLevels HMDFixedFoveationLevel; // 0x88
	ECustomDepthStencil CustomDepthStencil; // 0x89
	char bCustomDepthTaaJitter : 1; // 0x8c
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x90
	char bDefaultFeatureBloom : 1; // 0x94
	char bDefaultFeatureAmbientOcclusion : 1; // 0x94
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x94
	char bDefaultFeatureAutoExposure : 1; // 0x94
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x98
	float DefaultFeatureAutoExposureBias; // 0x9c
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa0
	char bUsePreExposure : 1; // 0xa0
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa0
	char bDefaultFeatureMotionBlur : 1; // 0xa0
	char bDefaultFeatureLensFlare : 1; // 0xa0
	char bTemporalUpsampling : 1; // 0xa0
	char bSSGI : 1; // 0xa0
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa4
	ELightUnits DefaultLightUnits; // 0xa5
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xa6
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xa8
	char bStencilForLODDither : 1; // 0xa8
	EEarlyZPass EarlyZPass; // 0xac
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb0
	char bDBuffer : 1; // 0xb0
	EClearSceneOptions ClearSceneMethod; // 0xb4
	char bBasePassOutputsVelocity : 1; // 0xb8
	char bVertexDeformationOutputsVelocity : 1; // 0xb8
	char bSelectiveBasePassOutputs : 1; // 0xb8
	char bDefaultParticleCutouts : 1; // 0xb8
	int32_t GPUSimulationTextureSizeX; // 0xbc
	int32_t GPUSimulationTextureSizeY; // 0xc0
	char bGlobalClipPlane : 1; // 0xc4
	EGBufferFormat GBufferFormat; // 0xc8
	char bUseGPUMorphTargets : 1; // 0xcc
	char bNvidiaAftermathEnabled : 1; // 0xcc
	char bMultiView : 1; // 0xcc
	char bMobilePostProcessing : 1; // 0xcc
	char bMobileMultiView : 1; // 0xcc
	char bMobileUseHWsRGBEncoding : 1; // 0xcc
	char bRoundRobinOcclusion : 1; // 0xcc
	char bODSCapture : 1; // 0xcc
	char bMeshStreaming : 1; // 0xcd
	float WireframeCullThreshold; // 0xd0
	char bEnableRayTracing : 1; // 0xd4
	char bEnableRayTracingTextureLOD : 1; // 0xd4
	char bSupportStationarySkylight : 1; // 0xd4
	char bSupportLowQualityLightmaps : 1; // 0xd4
	char bSupportPointLightWholeSceneShadows : 1; // 0xd4
	char bSupportAtmosphericFog : 1; // 0xd4
	char bSupportSkyAtmosphere : 1; // 0xd4
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xd4
	char bSupportSkinCacheShaders : 1; // 0xd5
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xd8
	float SkinCacheSceneMemoryLimitInMB; // 0xdc
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe0
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe0
	char bMobileAllowDistanceFieldShadows : 1; // 0xe0
	char bMobileAllowMovableDirectionalLights : 1; // 0xe0
	uint32_t MobileNumDynamicPointLights; // 0xe4
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xe8
	char bMobileAllowMovableSpotlights : 1; // 0xe8
	char bMobileAllowMovableSpotlightShadows : 1; // 0xe8
	char bSupport16BitBoneIndex : 1; // 0xe8
	char bGPUSkinLimit2BoneInfluences : 1; // 0xe8
	char bSupportDepthOnlyIndexBuffers : 1; // 0xe8
	char bSupportReversedIndexBuffers : 1; // 0xe8
	char bLPV : 1; // 0xe8
	char bMobileAmbientOcclusion : 1; // 0xe9
	char bUseUnlimitedBoneInfluences : 1; // 0xe9
	int32_t UnlimitedBonInfluencesThreshold; // 0xec
	FPerPlatformInt MaxSkinBones; // 0xf0
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf4
	char bMobileSupportsGen4TAA : 1; // 0xf8
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0xfc
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0xfd
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0x100
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x118
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x130
};

struct ASFPSAmbientSound : AAmbientSound {
	bool bAmbRegistered; // 0x228
	bool bBaseNoise; // 0x229
	bool bRainNoise; // 0x22a
	bool bThisIsBusSend; // 0x22b
	bool bIgnoreRoom; // 0x22c
	bool bUnderwaterNoise; // 0x22d
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UParticleModuleSize : UParticleModuleSizeBase {
	FRawDistributionVector StartSize; // 0x30
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x90
	FGuid ObjectGuid; // 0xa0
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bEnableBusSends : 1; // 0x38
	char bEnableBaseSubmix : 1; // 0x38
	char bEnableSubmixSends : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x108
	float MaxDistance; // 0x10c
	float TotalSamples; // 0x110
	float Priority; // 0x114
	USoundAttenuation* AttenuationSettings; // 0x118
	USoundSubmixBase* SoundSubmixObject; // 0x120
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x128
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x138
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x140
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x150
	TArray<UAssetUserData*> AssetUserData; // 0x160
};

struct ASFPSRoute : AActor {
	USFPSACRoute* Root; // 0x220
};

struct UBodySetup : UBodySetupCore {
	FKAggregateGeom AggGeom; // 0x48
	char bAlwaysFullAnimWeight : 1; // 0xa0
	char bConsiderForBounds : 1; // 0xa0
	char bMeshCollideAll : 1; // 0xa0
	char bDoubleSidedGeometry : 1; // 0xa0
	char bGenerateNonMirroredCollision : 1; // 0xa0
	char bSharedCookedData : 1; // 0xa0
	char bGenerateMirroredCollision : 1; // 0xa0
	char bSupportUVsAndFaceRemap : 1; // 0xa0
	UPhysicalMaterial* PhysMaterial; // 0xa8
	FWalkableSlopeOverride WalkableSlopeOverride; // 0xb0
	FBodyInstance DefaultInstance; // 0x128
	FVector BuildScale3D; // 0x288
};

struct USFPSSaver : UObject {
	TArray<FSFPSSaverCache> CharacterCache; // 0x98
	TArray<FSFPSSaverCache> Storages0Cache; // 0xa8
	TArray<FSFPSSaverCache> Storages1Cache; // 0xb8
	TArray<FString> DeathLog; // 0xc8
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UParticleModuleEventReceiverKillParticles : UParticleModuleEventReceiverBase {
	char bStopSpawning : 1; // 0x40
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct ASFPSRecoveryItem : ASFPSHandheldItem {
	float Health[0x2]; // 0x3f0
	float Food[0x2]; // 0x3f8
	float Water[0x2]; // 0x400
	bool bZeroSlowFoodAndWater; // 0x408
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct UTireType : UDataAsset {
	float FrictionScale; // 0x30
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x220
};

struct UDeviceProfile : UTextureLODSettings {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x88
};

struct USFPSUserWidget_TraderItem : UUserWidget {
	ASFPSBaseItem* ItemClass; // 0x268
	int32_t ActorGroupItemIndex; // 0x274
	int32_t ActorLibraryItemIndex; // 0x278
	FDelegate OnBuyEvent; // 0x2d0
	FDelegate OnCreateEvent; // 0x2e0
	FDelegate OnAddToStarterKitEvent; // 0x2f0
	FDelegate OnDeleteFromStarterKitEvent; // 0x300
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
	float PointOfViewBackwardOffset; // 0x64
	float NearClippingRadius; // 0x68
};

struct USynthComponentMoto : USynthComponent {
	UMotoSynthPreset* MotoSynthPreset; // 0x6c0
	float RPM; // 0x6c8
};

struct USFPSServerListHandler : UObject {
	TArray<FSFPSServerInfo> UnSortedFilteredServerList; // 0x188
	TArray<FSFPSServerInfo> tmpUnSortedFilteredServerList; // 0x198
	TArray<FSFPSServerInfo> SortedFilteredServerList; // 0x1a8
	FSFPSServerInfo SelectedServerInfo; // 0x1b8
	FDelegate VaRestCallback0; // 0x264
	FDelegate VaRestCallback1; // 0x274
	FDelegate VaRestCallback2; // 0x284
	FDelegate VaRestCallback3; // 0x294
	FDelegate VaRestCallback4; // 0x2a4
	UUserWidget* FormServerList; // 0x420
	USFPSUserWidget_ServerListItem* frmServerListItem; // 0x428
	TArray<FSFPSServerInfo> ServerList; // 0x430
};

struct UBTTaskNode : UBTNode {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x58
};

struct UEditableGameplayTagQueryExpression_AnyTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UMaterialExpressionCrossProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xc0
};

struct USFPSAICharacterSet : UObject {
	TArray<ASFPSAICharacter*> Characters; // 0x28
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x678
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x688
	FGuid GenerationGuid; // 0x698
};

struct UfrmSpriteViewEquip_C : USFPSUserWidget_SpriteViewInv {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UButton* btnMain; // 0x2f0
	USFPSUserWidget_EquipItem* pnMain; // 0x2f8
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UInterpGroup : UObject {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct USFPSACWeaponMFInventory : UActorComponent {
	TArray<ESFPSWeaponMFType> AvailableMFTypes; // 0xb0
	TArray<ASFPSBaseWeaponMF*> AvailableMFItems; // 0xc0
	TArray<AActor*> FInventory; // 0xd0
};

struct USFPSAI_TSetSightResolution : UBTTaskNode {
	float Resolution; // 0x70
};

struct UMovieSceneEasingExternalCurve : UObject {
	UCurveFloat* Curve; // 0x30
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ULogoutCallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ASFPSLocality : AActor {
	USFPSACLocality* LocalityComponent; // 0x220
};

struct UMaterialExpressionFeatureLevelSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x98
};

struct UARComponent : USceneComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct Aweapon_firearms_sg_m4_C : At_FireArm_C {
	UStaticMeshComponent* DeviceLeftMount; // 0x7e0
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e8
	UStaticMeshComponent* Shell; // 0x7f0
};

struct USFPSUserWidget_QuickSlot : UUserWidget {
	bool bAvailable; // 0x2c0
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	ESceneTextureId SceneTextureId; // 0x54
	bool bFiltered; // 0x55
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0xe8
	ANavigationData* MyNavData; // 0xf8
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UFontImportOptions : UObject {
	FFontImportOptionsData Data; // 0x28
};

struct UMainGameInstance_C : USFPSGameInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x8d0
};

struct USubmixEffectDynamicsProcessorPreset : USoundEffectSubmixPreset {
	FSubmixEffectDynamicsProcessorSettings Settings; // 0xf0
};

struct UParticleModuleMeshRotation : UParticleModuleRotationBase {
	FRawDistributionVector StartRotation; // 0x30
	char bInheritParent : 1; // 0x78
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x220
	TMap<UObject*, ULevelVariantSetsFunctionDirector*> DirectorInstances; // 0x238
};

struct Arecoveryitem_medikit_sterilizedrag_C : At_RecoveryItem_C {
	float Timer; // 0x420
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x90
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
	UPawnAction* RecentActionCopy; // 0xa8
};

struct ALightmassPortal : AActor {
	ULightmassPortalComponent* PortalComponent; // 0x220
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0xa8
	FName TrackName; // 0xb8
};

struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	TArray<int32_t> SortedInstances; // 0x598
	int32_t NumBuiltInstances; // 0x5a8
	FBox BuiltInstanceBounds; // 0x5b0
	FBox UnbuiltInstanceBounds; // 0x5cc
	TArray<FBox> UnbuiltInstanceBoundsList; // 0x5e8
	char bEnableDensityScaling : 1; // 0x5f8
	int32_t OcclusionLayerNumNodes; // 0x600
	FBoxSphereBounds CacheMeshExtendedBounds; // 0x604
	bool bDisableCollision; // 0x620
	int32_t InstanceCountToRender; // 0x624
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct USkyAtmosphereComponent : USceneComponent {
	ESkyAtmosphereTransformMode TransformMode; // 0x1f8
	float BottomRadius; // 0x1fc
	FColor GroundAlbedo; // 0x200
	float AtmosphereHeight; // 0x204
	float MultiScatteringFactor; // 0x208
	float TraceSampleCountScale; // 0x20c
	float RayleighScatteringScale; // 0x210
	FLinearColor RayleighScattering; // 0x214
	float RayleighExponentialDistribution; // 0x224
	float MieScatteringScale; // 0x228
	FLinearColor MieScattering; // 0x22c
	float MieAbsorptionScale; // 0x23c
	FLinearColor MieAbsorption; // 0x240
	float MieAnisotropy; // 0x250
	float MieExponentialDistribution; // 0x254
	float OtherAbsorptionScale; // 0x258
	FLinearColor OtherAbsorption; // 0x25c
	FTentDistribution OtherTentDistribution; // 0x26c
	FLinearColor SkyLuminanceFactor; // 0x278
	float AerialPespectiveViewDistanceScale; // 0x288
	float HeightFogContribution; // 0x28c
	float TransmittanceMinLightElevationAngle; // 0x290
	float AerialPerspectiveStartDepth; // 0x294
	FGuid bStaticLightingBuiltGUID; // 0x2bc
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct AM_RadioTrap_01_C : At_LocationCraftActor_C {
	UBoxComponent* GrenadeCollision; // 0x358
	USFPSACTripwireTrap* ACTripwireTrap; // 0x360
	USFPSACBaseCollision* SFPSACBaseCollision1; // 0x368
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UABP_weapon_firearms_sg_mossberg590_C : USFPSWeaponAnimInstance_SG {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	FAnimNode_Root AnimGraphNode_Root; // 0x318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x348
	FAnimNode_Slot AnimGraphNode_Slot; // 0x3c8
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x450
	int32_t SectionBaseY; // 0x454
	int32_t ComponentSizeQuads; // 0x458
	int32_t SubsectionSizeQuads; // 0x45c
	int32_t NumSubsections; // 0x460
	UMaterialInterface* OverrideMaterial; // 0x468
	UMaterialInterface* OverrideHoleMaterial; // 0x470
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x478
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x488
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x498
	TArray<int8_t> LODIndexToMaterialIndex; // 0x4a8
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4b8
	UTexture2D* XYOffsetmapTexture; // 0x4c8
	FVector4 WeightmapScaleBias; // 0x4d0
	float WeightmapSubsectionOffset; // 0x4e0
	FVector4 HeightmapScaleBias; // 0x4f0
	FBox CachedLocalBox; // 0x500
	LazyObjectProperty CollisionComponent; // 0x51c
	UTexture2D* HeightmapTexture; // 0x538
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x540
	TArray<UTexture2D*> WeightmapTextures; // 0x550
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x560
	FGuid MapBuildDataId; // 0x568
	TArray<FGuid> IrrelevantLights; // 0x578
	int32_t CollisionMipLevel; // 0x588
	int32_t SimpleCollisionMipLevel; // 0x58c
	float NegativeZBoundsExtension; // 0x590
	float PositiveZBoundsExtension; // 0x594
	float StaticLightingResolution; // 0x598
	int32_t ForcedLOD; // 0x59c
	int32_t LODBias; // 0x5a0
	FGuid StateId; // 0x5a4
	FGuid BakedTextureMaterialGuid; // 0x5b4
	UTexture2D* GIBakedBaseColorTexture; // 0x5c8
	char MobileBlendableLayerMask; // 0x5d0
	UMaterialInterface* MobileMaterialInterface; // 0x5d8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5e0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5f0
};

struct UMovieSceneCompiledDataManager : UObject {
	TMap<int32_t, FMovieSceneSequenceHierarchy> Hierarchies; // 0xd8
	TMap<int32_t, FMovieSceneEvaluationTemplate> TrackTemplates; // 0x128
	TMap<int32_t, FMovieSceneEvaluationField> TrackTemplateFields; // 0x178
	TMap<int32_t, FMovieSceneEntityComponentField> EntityComponentFields; // 0x1c8
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x258
	TArray<AActor*> OverrideInvisibleActors; // 0x268
	TArray<FName> OverrideInvisibleLevels; // 0x278
};

struct UEnvQuery : UDataAsset {
	FName QueryName; // 0x30
	TArray<UEnvQueryOption*> Options; // 0x38
};

struct UParticleModuleSize_Seeded : UParticleModuleSize {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UBoxFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	FTransform Transform; // 0xc0
	EFieldFalloffType Falloff; // 0xf0
};

struct Aweapmf_DTK_556x45_01_C : At_MuzzleAttachement_C {
	USceneComponent* Muzzle; // 0x390
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct UAssetManager : UObject {
	TArray<UObject*> ObjectReferenceList; // 0x2e0
	bool bIsGlobalAsyncScanEnvironment; // 0x2f0
	bool bShouldGuessTypeAndName; // 0x2f1
	bool bShouldUseSynchronousLoad; // 0x2f2
	bool bIsLoadingFromPakFiles; // 0x2f3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2f4
	bool bOnlyCookProductionAssets; // 0x2f5
	bool bIsBulkScanning; // 0x2f6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2f7
	bool bIsManagementDatabaseCurrent; // 0x2f8
	bool bUpdateManagementDatabaseAfterScan; // 0x2f9
	bool bIncludeOnlyOnDiskAssets; // 0x2fa
	bool bHasCompletedInitialScan; // 0x2fb
	int32_t NumberOfSpawnedNotifications; // 0x2fc
};

struct UPhononProbeComponent : USceneComponent {
	TArray<FVector> ProbeLocations; // 0x1f8
};

struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x68
};

struct UMaterialExpressionSamplePhysicsIntegerField : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
	EFieldIntegerType FieldTarget; // 0x54
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x220
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct UCommandlet : UObject {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
	char ShowProgress : 1; // 0x78
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct Aweapmf_silencer_762x39_01_C : At_MuzzleAttachement_C {
	USceneComponent* Muzzle; // 0x390
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct UMaterialExpressionStep : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct USFPSItemSetStructSet : UObject {
	TArray<FSFPSItemSetStruct> ItemSetStructs; // 0x28
};

struct UCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x120
	FDelegate CheckedStateDelegate; // 0x124
	FCheckBoxStyle WidgetStyle; // 0x138
	USlateWidgetStyleAsset* Style; // 0x6b8
	USlateBrushAsset* UncheckedImage; // 0x6c0
	USlateBrushAsset* UncheckedHoveredImage; // 0x6c8
	USlateBrushAsset* UncheckedPressedImage; // 0x6d0
	USlateBrushAsset* CheckedImage; // 0x6d8
	USlateBrushAsset* CheckedHoveredImage; // 0x6e0
	USlateBrushAsset* CheckedPressedImage; // 0x6e8
	USlateBrushAsset* UndeterminedImage; // 0x6f0
	USlateBrushAsset* UndeterminedHoveredImage; // 0x6f8
	USlateBrushAsset* UndeterminedPressedImage; // 0x700
	EHorizontalAlignment HorizontalAlignment; // 0x708
	FMargin Padding; // 0x70c
	FSlateColor BorderBackgroundColor; // 0x720
	EButtonClickMethod ClickMethod; // 0x748
	EButtonTouchMethod TouchMethod; // 0x749
	EButtonPressMethod PressMethod; // 0x74a
	bool IsFocusable; // 0x74b
	FMulticastInlineDelegate OnCheckStateChanged; // 0x750
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase {
	FRawDistributionVector Position; // 0x30
	FRawDistributionFloat Range; // 0x78
	FRawDistributionFloat Strength; // 0xa8
	char StrengthByDistance : 1; // 0xd8
	char bAffectBaseVelocity : 1; // 0xd8
	char bOverrideVelocity : 1; // 0xd8
	char bUseWorldSpacePosition : 1; // 0xd8
	char Positive_X : 1; // 0xd8
	char Positive_Y : 1; // 0xd8
	char Positive_Z : 1; // 0xd8
	char Negative_X : 1; // 0xd8
	char Negative_Y : 1; // 0xd9
	char Negative_Z : 1; // 0xd9
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x48
	float PitchMax; // 0x4c
	float VolumeMin; // 0x50
	float VolumeMax; // 0x54
};

struct UJoinSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ACameraRig_Rail : AActor {
	float CurrentPositionOnRail; // 0x220
	bool bLockOrientationToRail; // 0x224
	USceneComponent* TransformComponent; // 0x228
	USplineComponent* RailSplineComponent; // 0x230
	USceneComponent* RailCameraMount; // 0x238
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x480
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x488
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x490
	TArray<FVertexOffsetUsage> VertexOffsetUsage; // 0x4a0
	UPhysicsAsset* PhysicsAssetOverride; // 0x5a8
	int32_t ForcedLodModel; // 0x5b0
	int32_t MinLodModel; // 0x5b4
	float StreamingDistanceMultiplier; // 0x5c0
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x5d0
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x604
	char bOverrideMinLod : 1; // 0x606
	char bUseBoundsFromMasterPoseComponent : 1; // 0x606
	char bForceWireframe : 1; // 0x606
	char bDisplayBones : 1; // 0x606
	char bDisableMorphTarget : 1; // 0x606
	char bHideSkin : 1; // 0x607
	char bPerBoneMotionBlur : 1; // 0x607
	char bComponentUseFixedSkelBounds : 1; // 0x607
	char bConsiderAllBodiesForBounds : 1; // 0x607
	char bSyncAttachParentLOD : 1; // 0x607
	char bCanHighlightSelectedSections : 1; // 0x607
	char bRecentlyRendered : 1; // 0x607
	char bCastCapsuleDirectShadow : 1; // 0x607
	char bCastCapsuleIndirectShadow : 1; // 0x608
	char bCPUSkinning : 1; // 0x608
	char bEnableUpdateRateOptimizations : 1; // 0x608
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x608
	char bRenderStatic : 1; // 0x608
	char bIgnoreMasterPoseComponentLOD : 1; // 0x608
	char bCachedLocalBoundsUpToDate : 1; // 0x609
	char bForceMeshObjectUpdate : 1; // 0x609
	float CapsuleIndirectShadowMinVisibility; // 0x60c
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x620
	FMatrix CachedWorldToLocalTransform; // 0x640
};

struct APlayerController : AController {
	UPlayer* Player; // 0x298
	APawn* AcknowledgedPawn; // 0x2a0
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2a8
	AHUD* MyHUD; // 0x2b0
	APlayerCameraManager* PlayerCameraManager; // 0x2b8
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2c0
	bool bAutoManageActiveCameraTarget; // 0x2c8
	FRotator TargetViewRotation; // 0x2cc
	float SmoothTargetViewRotationSpeed; // 0x2e4
	TArray<AActor*> HiddenActors; // 0x2f0
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300
	float LastSpectatorStateSynchTime; // 0x314
	FVector LastSpectatorSyncLocation; // 0x318
	FRotator LastSpectatorSyncRotation; // 0x324
	int32_t ClientCap; // 0x330
	UCheatManager* CheatManager; // 0x338
	UCheatManager* CheatClass; // 0x340
	UPlayerInput* PlayerInput; // 0x348
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350
	char bPlayerIsWaiting : 1; // 0x3d0
	char NetPlayerIndex; // 0x3d4
	UNetConnection* PendingSwapConnection; // 0x410
	UNetConnection* NetConnection; // 0x418
	float InputYawScale; // 0x42c
	float InputPitchScale; // 0x430
	float InputRollScale; // 0x434
	char bShowMouseCursor : 1; // 0x438
	char bEnableClickEvents : 1; // 0x438
	char bEnableTouchEvents : 1; // 0x438
	char bEnableMouseOverEvents : 1; // 0x438
	char bEnableTouchOverEvents : 1; // 0x438
	char bForceFeedbackEnabled : 1; // 0x438
	float ForceFeedbackScale; // 0x43c
	TArray<FKey> ClickEventKeys; // 0x440
	EMouseCursor DefaultMouseCursor; // 0x450
	EMouseCursor CurrentMouseCursor; // 0x451
	ECollisionChannel DefaultClickTraceChannel; // 0x452
	ECollisionChannel CurrentClickTraceChannel; // 0x453
	float HitResultTraceDistance; // 0x454
	uint16_t SeamlessTravelCount; // 0x458
	uint16_t LastCompletedSeamlessTravelCount; // 0x45a
	UInputComponent* InactiveStateInputComponent; // 0x4d0
	char bShouldPerformFullTickWhenPaused : 1; // 0x4d8
	UTouchInterface* CurrentTouchInterface; // 0x4f0
	ASpectatorPawn* SpectatorPawn; // 0x548
	bool bIsLocalPlayerController; // 0x554
	FVector SpawnLocation; // 0x558
};

struct USFPSACStair : UActorComponent {
	TArray<UArrowComponent*> Steps; // 0xc8
	bool bBusy; // 0xd8
	USFPSPhysicalMaterial* StairPhysicalMaterial; // 0xe0
};

struct UCrowdFollowingComponent : UPathFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UParticleModuleAccelerationBase : UParticleModule {
	char bAlwaysInWorldSpace : 1; // 0x30
};

struct UGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FGameplayTagTableRow> GameplayTagList; // 0x38
};

struct UNavCollision : UNavCollisionBase {
	TArray<FNavCollisionCylinder> CylinderCollision; // 0x80
	TArray<FNavCollisionBox> BoxCollision; // 0x90
	UNavArea* AreaClass; // 0xa0
	char bGatherConvexGeometry : 1; // 0xa8
	char bCreateOnClient : 1; // 0xa8
};

struct UMaterialExpressionParticleSubUV : UMaterialExpressionTextureSample {
	char bBlend : 1; // 0x60
};

struct UParticleModulePivotOffset : UParticleModuleLocationBase {
	FVector2D PivotOffset; // 0x30
};

struct UAISenseConfig_Blueprint : UAISenseConfig {
	UAISense_Blueprint* Implementation; // 0x48
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct URuntimeVirtualTextureComponent : USceneComponent {
	TSoftObjectPtr<AActor> BoundsAlignActor; // 0x1f8
	bool bSetBoundsButton; // 0x220
	bool bSnapBoundsToLandscape; // 0x221
	URuntimeVirtualTexture* VirtualTexture; // 0x228
	bool bEnableScalability; // 0x230
	uint32_t ScalabilityGroup; // 0x234
	bool bHidePrimitives; // 0x238
	UVirtualTextureBuilder* StreamingTexture; // 0x240
	int32_t StreamLowMips; // 0x248
	bool bBuildStreamingMipsButton; // 0x24c
	bool bEnableCompressCrunch; // 0x24d
	bool bUseStreamingLowMipsInEditor; // 0x24e
	bool bBuildDebugStreamingMips; // 0x24f
};

struct UCullingField : UFieldNodeBase {
	UFieldNodeBase* Culling; // 0xb0
	UFieldNodeBase* Field; // 0xb8
	EFieldCullingOperationType Operation; // 0xc0
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct USFPSUserWidget_CraftRollout : UUserWidget {
	FDelegate OnBeginCraftEvent; // 0x2e8
};

struct Aweapon_firearms_sg_mp43_C : At_FireArm_C {
	UStaticMeshComponent* DeviceLeftMount; // 0x7e0
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e8
	UStaticMeshComponent* RightShell; // 0x7f0
	UStaticMeshComponent* LeftShellEmpty; // 0x7f8
	UStaticMeshComponent* RightShellEmpty; // 0x800
	UStaticMeshComponent* LeftShell; // 0x808
};

struct UBookMark : UBookmarkBase {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct UWindDirectionalSourceComponent : USceneComponent {
	float Strength; // 0x1f8
	float Speed; // 0x1fc
	float MinGustAmount; // 0x200
	float MaxGustAmount; // 0x204
	float Radius; // 0x208
	char bPointWind : 1; // 0x20c
};

struct UARObjectComponent : UARComponent {
	FARObjectUpdatePayload ReplicatedPayload; // 0x280
};

struct UMovieSceneHookSection : UMovieSceneSection {
	char bRequiresRangedHook : 1; // 0xf8
	char bRequiresTriggerHooks : 1; // 0xf8
};

struct USFPSAnimEvent_WC_ChangingFlag : UAnimNotify {
	bool bWeaponChanging; // 0x38
	bool bForCursor; // 0x39
};

struct UDcxVehicleWheelsComponent : UPawnMovementComponent {
	float ChassisMass; // 0x140
	FVector InertiaTensorScale; // 0x144
	FDcxVehicleTireLoadFilterData TireLoadFilter; // 0x150
	bool bUseAvoidance; // 0x160
	float AvoidanceWeight; // 0x164
	int32_t AvoidanceUID; // 0x168
	FNavAvoidanceMask AvoidanceGroup; // 0x16c
	FNavAvoidanceMask GroupsToAvoid; // 0x170
	FNavAvoidanceMask GroupsToIgnore; // 0x174
	TArray<FDcxVehicleWheelConfiguration> WheelConfigurations; // 0x178
	float ThresholdLongitudinalSpeed; // 0x188
	int32_t LowForwardSpeedSubStepCount; // 0x18c
	int32_t HighForwardSpeedSubStepCount; // 0x190
	float DragCoefficient; // 0x194
	float DragArea; // 0x198
	FDcxVehicleDriveInputRate ThrottleRate; // 0x19c
	FDcxVehicleDriveInputRate BrakeRate; // 0x1a4
	FDcxVehicleDriveInputRate HandbrakeRate; // 0x1ac
	FDcxVehicleDriveInputRate SteerRate; // 0x1b4
	float AvoidanceRadius; // 0x1bc
	float AvoidanceHeight; // 0x1c0
	float AvoidanceConsiderationRadius; // 0x1c4
	float AvoidanceThrottleStep; // 0x1c8
	float AvoidanceBrakeStep; // 0x1cc
	float AvoidanceSteerStep; // 0x1d0
	bool bRecreateRequired; // 0x1d4
	UDcxVehicleWheelsRawInput* RawInput; // 0x1d8
	TArray<float> SmoothAnalogControls; // 0x1e0
	FDcxVehicleDriveState ReplicatedState; // 0x1f0
	bool bWasAvoidanceUpdated; // 0x208
	FVector AvoidanceVelocity; // 0x20c
	FVector AvoidanceLockVelocity; // 0x218
	float AvoidanceLockTimer; // 0x224
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct Ascope_opt_mosin_C : At_Sight_C {
	UStaticMeshComponent* cod_4x_reticles; // 0x3d0
};

struct Aweapon_firearms_gun_pm_C : At_FireArm_C {
	USFPSACWeaponMFInventory* SFPSACWeaponMFInventory; // 0x7e0
	UStaticMeshComponent* MagazineFull; // 0x7e8
	UStaticMeshComponent* MagazineEmpty; // 0x7f0
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct UInterpTrackVectorMaterialParam : UInterpTrackVectorBase {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct USFPSAnimInstance : UAnimInstance {
	ASFPSBaseCharacter* Character; // 0x2b8
	bool bAnimIsDying; // 0x2c0
	bool bAnimIsDyingInWater; // 0x2c1
	bool bAnimInverseKinematicsDisabled; // 0x2c2
	float AnimLegsYawDelta; // 0x2c4
	float AnimLegsYawDeltaSign; // 0x2c8
	bool AnimLegsRotating; // 0x2cc
	float AnimPitch; // 0x2d0
	float AnimRoll; // 0x2d4
	float AnimSpeed; // 0x2d8
	float AnimSpeedZ; // 0x2dc
	float AnimJumpDuck; // 0x2e0
	float AnimSpeedScale; // 0x2e4
	float AnimDirectionForward; // 0x2e8
	float AnimDirectionRight; // 0x2ec
	float AnimAccelerationForward; // 0x2f0
	float AnimAccelerationRight; // 0x2f4
	float AnimFatigue; // 0x2f8
	float AnimBreath; // 0x2fc
	float AnimWeaponInertiaYaw; // 0x300
	float AnimWeaponInertiaPitch; // 0x304
	float AnimWeaponBarrier; // 0x308
	float AnimWeaponRollbackForward; // 0x30c
	float AnimWeaponRollbackRight; // 0x310
	ESFPSItemAnimTypes AnimWeaponAnimType; // 0x314
	bool AnimIsJumping; // 0x315
	bool AnimJumpEvent; // 0x316
	ESFPSCharacterPose AnimPose; // 0x317
	bool AnimPoseChanging; // 0x318
	bool AnimIsAiming; // 0x319
	bool AnimIsTeleporting; // 0x31a
	bool AnimIsOnStair; // 0x31b
	bool AnimSwimming; // 0x31c
	ESFPSCharacterMovingType AnimMovingType; // 0x31d
	float AnimDamageImpactEffectHead; // 0x320
	float AnimDamageImpactEffectTop; // 0x324
	float AnimDamageImpactEffectBottom; // 0x328
	float AnimDamageImpactEffectLeft; // 0x32c
	float AnimDamageImpactEffectRight; // 0x330
	float AnimStairPosition; // 0x334
	ASFPSHandheldItem* AnimWeaponChange_NewItem; // 0x338
	ASFPSHandheldItem* AnimWeaponChange_OldItem; // 0x340
	int32_t AnimWeaponChange_NewSlot; // 0x348
	int32_t AnimWeaponChange_OldSlot; // 0x34c
	bool AnimWeaponChange_SkipStartAnim; // 0x350
	FName AnimWeaponChange_OldSocket; // 0x354
	FName AnimWeaponChange_NewSocket; // 0x35c
	bool AnimWeaponChange_bHideOldItem; // 0x364
	ASFPSSmallArms* AnimReload_Weapon; // 0x368
	int32_t AnimReload_AmmoCount; // 0x370
	int32_t AnimReload_LoopCount; // 0x374
	int32_t AnimReload_LoopCounter; // 0x378
	bool AnimReload_BreakActive; // 0x37c
	ASFPSAmmo* AnimReload_AmmoClass; // 0x380
	UAnimMontage* AnimReload_Montage; // 0x388
	TWeakObjectPtr<ASFPSHandheldItem> AnimHandheldItemUse_Item; // 0x390
	UAnimMontage* AnimHandheldItemUse_Montage; // 0x398
	bool AnimHandheldItemUse_Break; // 0x3a0
	float AnimHandheldItemUse_Time; // 0x3a4
	bool AnimHandheldItemUsed; // 0x3a8
	bool AnimHandheldItemEnabled; // 0x3a9
	float WheelsSteerAngle; // 0x3ac
};

struct ALevelStreamingVolume : AVolume {
	TArray<FName> StreamingLevelNames; // 0x258
	char bEditorPreVisOnly : 1; // 0x268
	char bDisabled : 1; // 0x268
	EStreamingVolumeUsage StreamingUsage; // 0x26c
};

struct UAssetExportTask : UObject {
	UObject* Object; // 0x28
	UExporter* Exporter; // 0x30
	FString Filename; // 0x38
	bool bSelected; // 0x48
	bool bReplaceIdentical; // 0x49
	bool bPrompt; // 0x4a
	bool bAutomated; // 0x4b
	bool bUseFileArchive; // 0x4c
	bool bWriteEmptyFiles; // 0x4d
	TArray<UObject*> IgnoreObjectList; // 0x50
	UObject* Options; // 0x60
	TArray<FString> Errors; // 0x68
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct ABM_WallTria_02_C : At_LocationCraftActor_C {
	USFPSACBaseCollision* SFPSACBaseCollision; // 0x358
	USFPSACSnapComponent* SFPSACSnap; // 0x360
};

struct UHapticFeedbackEffect_Curve : UHapticFeedbackEffect_Base {
	FHapticFeedbackDetails_Curve HapticDetails; // 0x28
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28
	uint32_t PoolPrimeSize; // 0x2c
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UChannel : UObject {
	UNetConnection* Connection; // 0x28
};

struct UParticleModule : UObject {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct UTextureLightProfile : UTexture2D {
	float Brightness; // 0x1a0
	float TextureMultiplier; // 0x1a4
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct Ascope_opt_elcan_4x_C : At_Sight_C {
	UStaticMeshComponent* hamr_4x_reticles; // 0x3d0
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x258
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x30
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UParticleModuleRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionFloat StartRotationRate; // 0x30
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct UMovieScene3DTransformSection : UMovieSceneSection {
	FMovieSceneTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x3]; // 0xf8
	FMovieSceneFloatChannel Rotation[0x3]; // 0x2d8
	FMovieSceneFloatChannel Scale[0x3]; // 0x4b8
	FMovieSceneFloatChannel ManualWeight; // 0x698
	bool bUseQuaternionInterpolation; // 0x738
};

struct UMaterialExpressionSpriteTextureSampler : UMaterialExpressionTextureSampleParameter2D {
	bool bSampleAdditionalTextures; // 0x80
	int32_t AdditionalSlotIndex; // 0x84
	FText SlotDisplayName; // 0x88
};

struct UARPlaneGeometry : UARTrackedGeometry {
	EARPlaneOrientation Orientation; // 0xf8
	FVector Center; // 0xfc
	FVector Extent; // 0x108
	TArray<FVector> BoundaryPolygon; // 0x118
	UARPlaneGeometry* SubsumedBy; // 0x128
};

struct UActorComponent : UObject {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	int32_t UCSSerializationIndex; // 0x84
	char bNetAddressable : 1; // 0x88
	char bReplicates : 1; // 0x88
	char bAutoActivate : 1; // 0x89
	char bIsActive : 1; // 0x8a
	char bEditableWhenInherited : 1; // 0x8a
	char bCanEverAffectNavigation : 1; // 0x8a
	char bIsEditorOnly : 1; // 0x8a
	EComponentCreationMethod CreationMethod; // 0x8c
	FMulticastSparseDelegate OnComponentActivated; // 0x8d
	FMulticastSparseDelegate OnComponentDeactivated; // 0x8e
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct ASFPSHUD : AHUD {
	UMaterialParameterCollection* ParametersCollection; // 0x4f0
	float DamageSplashTime; // 0x4f8
};

struct UCameraModifier_CameraShake : UCameraModifier {
	TArray<FActiveCameraShakeInfo> ActiveShakes; // 0x48
	TMap<UCameraShakeBase*, FPooledCameraShakes> ExpiredPooledShakesMap; // 0x58
	float SplitScreenShakeScale; // 0xa8
};

struct UParticleModuleVelocityInheritParent : UParticleModuleVelocityBase {
	FRawDistributionVector Scale; // 0x38
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct UInterpGroupInst : UObject {
	UInterpGroup* group; // 0x28
	AActor* GroupActor; // 0x30
	TArray<UInterpTrackInst*> TrackInst; // 0x38
};

struct UObjectLibrary : UObject {
	UObject* ObjectBaseClass; // 0x28
	bool bHasBlueprintClasses; // 0x30
	TArray<UObject*> Objects; // 0x38
	TArray<TWeakObjectPtr<UObject>> WeakObjects; // 0x48
	bool bUseWeakReferences; // 0x58
	bool bIsFullyLoaded; // 0x59
};

struct USynthComponentToneGenerator : USynthComponent {
	float Frequency; // 0x6c0
	float Volume; // 0x6c4
};

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UInterpTrackAnimControl : UInterpTrackFloatBase {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct UIntSerialization : UObject {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	int8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct UParticleModuleAccelerationConstant : UParticleModuleAccelerationBase {
	FVector Acceleration; // 0x38
};

struct UVirtualTextureBuilder : UObject {
	UVirtualTexture2D* Texture; // 0x28
	uint64_t BuildHash; // 0x30
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct ALODActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<FHLODInstancingKey, UInstancedStaticMeshComponent*> InstancedStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct UBTDecorator_DoesPathExist : UBTDecorator {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
