namespace off {
	constexpr auto GNames = 0x9cf2f40;
	constexpr auto GObjects = 0x9d3ed20;
	constexpr auto GWorld = 0x9ec2510;
}
struct UDesperateMeasures {
	float _healAndUnhookMultiplier[0x3]; // 0x3d0
	int32_t _nbInjuredHookedOrDyingSurvivors; // 0x3dc
};

struct UIntervalGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x40
	UTransformProxy* TransformProxy; // 0x58
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x60
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x70
	UGizmoComponentAxisSource* AxisYSource; // 0x98
	UGizmoComponentAxisSource* AxisZSource; // 0xa0
};

struct UMovieSceneIntegerSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe8
};

struct UAISkill_InteractionTarget_ShockTherapy {
	float TargetToEvadePointMaxDistance; // 0x220
	float CastShockTimeBuffer; // 0x224
};

struct UIsPlayerPerformingInteraction {
	FGameplayTagContainer _interactionSemantics; // 0xe8
};

struct UTwinJumpAttackSuccessSubstate {
	FDBDTunableRowHandle _jumpSucceedAttachedCooldownTime; // 0x118
	FDBDTunableRowHandle _jumpSucceedNotAttachedCooldownTime; // 0x140
};

struct UButtonStyleAsset {
	FButtonStyle ButtonStyle; // 0x30
};

struct UUMGHudEditorVersionWidget {
	UButton* VersionButton; // 0x260
	UUMGDragWidget_HudEditor* _onEditWidget; // 0x268
};

struct UHapticFeedbackEffect_Curve {
	FHapticFeedbackDetails_Curve HapticDetails; // 0x30
};

struct ULandscapeWeightmapUsage {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x30
	FGuid LayerGuid; // 0x50
};

struct UBlindingFXComponent {
	FName _blindnessIntensityParameter; // 0xc8
	UCurveFloat* _blindnessMaterialCurve; // 0xd8
	UCurveFloat* _blindnessCurve; // 0xe0
	UPostProcessComponent* _postProcess; // 0xe8
	UMaterialInstanceDynamic* _postProcessMaterial; // 0xf0
};

struct UDisarmBearTrapInteraction {
	float _averageMaxVelocity; // 0x6d8
	float _averageMaxVelocitySquared; // 0x6dc
	FName _updateMontageID; // 0x6e0
	FName _loudNoiseAudibleRangeTunable; // 0x6ec
};

struct UMotionControllerComponent {
	int32_t PlayerIndex; // 0x428
	EControllerHand Hand; // 0x42c
	FName MotionSource; // 0x430
	char bDisableLowLatencyUpdate : 1; // 0x43c
	ETrackingStatus CurrentTrackingStatus; // 0x440
	bool bDisplayDeviceModel; // 0x441
	FName DisplayModelSource; // 0x444
	UStaticMesh* CustomDisplayMesh; // 0x450
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x458
	UPrimitiveComponent* DisplayComponent; // 0x4d0
};

struct UGameplayTagsSettings {
	bool ImportTagsFromConfig; // 0x50
	bool WarnOnInvalidTags; // 0x51
	bool FastReplication; // 0x52
	FString InvalidTagCharacters; // 0x58
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x68
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x78
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x88
	TArray<FName> CommonlyReplicatedTags; // 0x98
	int32_t NumBitsForContainerSize; // 0xa8
	int32_t NetIndexFirstBitSegment; // 0xac
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xb0
};

struct UBTDecorator_TimeLimit {
	float TimeLimit; // 0x70
};

struct UAtlantaCustomizationTooltipWidget {
	UImage* SmokeImage; // 0x338
	UUMGCustomizationTooltipHeaderWidget* Header; // 0x340
	UUMGCustomizationTooltipContentWidget* Content; // 0x348
};

struct ULiveLinkVirtualSubject {
	ULiveLinkRole* Role; // 0x38
	TArray<FLiveLinkSubjectName> Subjects; // 0x40
	TArray<ULiveLinkFrameTranslator*> FrameTranslators; // 0x50
};

struct UAnimNotify_PlayNiagaraEffect {
	UNiagaraSystem* Template; // 0x40
	FVector LocationOffset; // 0x48
	FRotator RotationOffset; // 0x54
	FVector Scale; // 0x60
	char Attached : 1; // 0x90
	FName SocketName; // 0x94
};

struct UButtonWidgetStyle {
	FButtonStyle ButtonStyle; // 0x38
};

struct UParticleModuleSourceMovement {
	FRawDistributionVector SourceMovementScale; // 0x38
};

struct UMovieSceneLevelVisibilityTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UMovieSceneWidgetMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x70
	FName TrackName; // 0x80
};

struct UPlaneCutToolProperties {
	bool bSnapToWorldGrid; // 0x58
	bool bKeepBothHalves; // 0x59
	float SpacingBetweenHalves; // 0x5c
	bool bFillCutHole; // 0x60
	bool bShowPreview; // 0x61
	bool bFillSpans; // 0x62
};

struct UNiagaraDataInterfaceGrid2D {
	int32_t NumCellsX; // 0xd8
	int32_t NumCellsY; // 0xdc
	int32_t NumCellsMaxAxis; // 0xe0
	int32_t NumAttributes; // 0xe4
	bool SetGridFromMaxAxis; // 0xe8
	FVector2D WorldBBoxSize; // 0xec
};

struct AGMAdaptiveShadowMapSourceComponentSpawner {
	bool bCreateASMSourceComponentOnBeginPlay; // 0x230
	bool bRemoveCastForCinematicOnlyFlagOnLights; // 0x231
	bool bRemoveLightFunctionMaterialOnLights; // 0x232
	int32_t NumLevelPerSource; // 0x234
	int32_t NumPreGeneratedLevelPerSource; // 0x238
	bool bPreviewOnly; // 0x23c
};

struct AMagicLeapSharedWorldGameState {
	FMagicLeapSharedWorldSharedData SharedWorldData; // 0x2a8
	FMagicLeapSharedWorldAlignmentTransforms AlignmentTransforms; // 0x2b8
	FMulticastInlineDelegate OnSharedWorldDataUpdated; // 0x2c8
	FMulticastInlineDelegate OnAlignmentTransformsUpdated; // 0x2d8
};

struct ULiveLinkSubjectSettings {
	TArray<ULiveLinkFramePreProcessor*> PreProcessors; // 0x30
	ULiveLinkFrameInterpolationProcessor* InterpolationProcessor; // 0x40
	TArray<ULiveLinkFrameTranslator*> Translators; // 0x48
	ULiveLinkRole* Role; // 0x58
};

struct UEnvQueryTest_PathfindingBatch {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x2d0
};

struct UAISkill_Interaction {
	EPawnInputPressTypes inputType; // 0xc0
	EInteractionSkillInputModes InputMode; // 0xc1
	EPawnInputPressTypes CancelInputType; // 0xc2
	EInteractionCancelInputModes CancelInputMode; // 0xc3
	bool AutoLockInput; // 0xc4
	FAIRoll StartRoll; // 0xc8
	FString StartInteractionID; // 0xf0
	FString StopInteractionID; // 0x100
	float MinHoldInputTime; // 0x110
	bool AutoReleaseHoldInputWhenCharged; // 0x114
};

struct UBabysitter {
	float _scratchMarkHidingTime[0x3]; // 0x3d0
	float _hasteEffect[0x3]; // 0x3dc
	float _showAuraTime[0x3]; // 0x3e8
	float _cooldownTime[0x3]; // 0x3f4
};

struct UParticleModuleCameraOffset {
	FRawDistributionFloat CameraOffset; // 0x38
	char bSpawnTimeOnly : 1; // 0x68
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x6c
};

struct UWidgetBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x338
	char bAllowTemplate : 1; // 0x340
	char bAllowDynamicCreation : 1; // 0x340
	char bValidTemplate : 1; // 0x340
	char bTemplateInitialized : 1; // 0x340
	char bCookedTemplate : 1; // 0x340
	char bClassRequiresNativeTick : 1; // 0x340
	TArray<FDelegateRuntimeBinding> Bindings; // 0x348
	TArray<UWidgetAnimation*> Animations; // 0x358
	TArray<FName> NamedSlots; // 0x368
	TSoftObjectPtr<UUserWidget> TemplateAsset; // 0x378
	UUserWidget* Template; // 0x3a8
};

struct UGeneralProjectChunkingSettings {
	int32_t NumberOfPaksInInitialChunk; // 0x30
	int32_t NumberOfPaksInAllChunks; // 0x34
	int32_t LeftoverPakId; // 0x38
	TArray<FPathPak> PakAssignmentPaths; // 0x40
	int32_t AtlantaNumberOfPaksInInitialChunk; // 0x50
	int32_t AtlantaAndroidNumberOfPaksInAllChunks; // 0x54
	int32_t AtlantaIOSNumberOfPaksInAllChunks; // 0x58
	int32_t AtlantaLeftoverPakId; // 0x5c
	TArray<FPathPak> AtlantaPakAssignmentPaths; // 0x60
	TArray<FPathPak> AtlantaAndroidPakAssignmentPaths; // 0x70
	TArray<FPathPak> AtlantaIOSPakAssignmentPaths; // 0x80
};

struct UProgressWidgetStyle {
	FProgressBarStyle ProgressBarStyle; // 0x38
};

struct UBTCompositeNode {
	TArray<FBTCompositeChild> Children; // 0x60
	TArray<UBTService*> Services; // 0x70
	char bApplyDecoratorScope : 1; // 0x90
};

struct UCoreScreenIndicatorsContainerWidget {
	float InactiveThreshold; // 0x2f8
	UCanvasPanel* Container; // 0x300
	UCoreScreenIndicatorWidget* ScreenIndicatorClass; // 0x308
	TMap<FString, UCoreScreenIndicatorWidget*> _screenIndicatorsMap; // 0x310
	TArray<UCoreScreenIndicatorWidget*> _screenIndicatorsPool; // 0x360
};

struct UNiagaraComponent {
	UNiagaraSystem* Asset; // 0x428
	ENiagaraTickBehavior TickBehavior; // 0x430
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x438
	char bForceSolo : 1; // 0x540
	char bAutoDestroy : 1; // 0x56c
	char bRenderingEnabled : 1; // 0x56c
	char bAutoManageAttachment : 1; // 0x56c
	char bAutoAttachWeldSimulatedBodies : 1; // 0x56c
	float MaxTimeBeforeForceUpdateTransform; // 0x570
	FMulticastInlineDelegate OnSystemFinished; // 0x578
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x588
	FName AutoAttachSocketName; // 0x590
	EAttachmentRule AutoAttachLocationRule; // 0x59c
	EAttachmentRule AutoAttachRotationRule; // 0x59d
	EAttachmentRule AutoAttachScaleRule; // 0x59e
};

struct UChestAnimInstance {
	ASearchable* _owningChest; // 0x270
	bool _isOpen; // 0x278
	bool _isBeingPriedOpen; // 0x279
	UInteractionDefinition* _openChestInteraction; // 0x288
};

struct AGeometryCacheActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x230
};

struct UParticleModuleSize_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct ULocalizedOverlays {
	UBasicOverlays* DefaultOverlays; // 0x30
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x38
};

struct ABaseGasCloudProjectile {
	EBombType _gasType; // 0x2b8
	UPoolableProjectileComponent* _poolableProjectile; // 0x2c0
	FDBDTunableRowHandle _gasCloudDuration; // 0x2c8
	FDBDTunableRowHandle _gasCloudGravityScale; // 0x2f0
	FDBDTunableRowHandle _gasCloudBounciness; // 0x318
	FDBDTunableRowHandle _gasCloudFriction; // 0x340
	FDBDTunableRowHandle _dissipateGasCloudTime; // 0x368
	FDBDTunableRowHandle _gasCloudMinimumLifetime; // 0x390
	FDBDTunableRowHandle _gasCloudSimpleCollisionRadius; // 0x3b8
	FDBDTunableRowHandle _gasCloudComplexCollisionRadius; // 0x3e0
	FDBDTunableRowHandle _gasCloudSurvivorDetectionRadius; // 0x408
	FDBDTunableRowHandle _gasCloudDetectionDelay; // 0x430
	FDBDTunableRowHandle _gasCloudCosmeticFadeDuration; // 0x458
	float _overlappingTime; // 0x480
	bool _dissipating; // 0x484
	TArray<ACamperPlayer*> _overlappingSurvivors; // 0x488
	UParticleSystemComponent* _gasParticleSystem; // 0x498
	USphereComponent* _simpleCollider; // 0x4a0
	USphereComponent* _complexCollider; // 0x4a8
	USpherePlayerOverlapComponent* _survivorDetector; // 0x4b0
	UActiveGasCloudTrackerComponent* _activeGasCloudTracker; // 0x4b8
	FGameplayTag _cloudSizeModifierTag; // 0x4c0
	float _cumulativeLifetime; // 0x4d0
};

struct UClothingAssetCommon {
	UPhysicsAsset* PhysicsAsset; // 0x50
	TMap<FName, UClothConfigBase*> ClothConfigs; // 0x58
	UClothConfigBase* ClothSharedSimConfig; // 0xa8
	UClothConfigBase* ClothSimConfig; // 0xb0
	UClothConfigBase* ChaosClothSimConfig; // 0xb8
	TArray<UClothLODDataCommon_Legacy*> ClothLodData; // 0xc0
	TArray<FClothLODDataCommon> LODData; // 0xd0
	TArray<int32_t> LodMap; // 0xe0
	TArray<FName> UsedBoneNames; // 0xf0
	TArray<int32_t> UsedBoneIndices; // 0x100
	int32_t ReferenceBoneIndex; // 0x110
	UClothingAssetCustomData* CustomData; // 0x118
	FClothConfig_Legacy ClothConfig; // 0x120
};

struct UArmDetectionFanComponent {
	FName _shoulderBone; // 0x270
	FName _elbowBone; // 0x27c
	FName _handBone; // 0x288
	FName _indexBone; // 0x294
	FName _hipBone; // 0x2a0
};

struct UPhysicsThrusterComponent {
	float ThrustStrength; // 0x210
};

struct UUMGLobbySearchingWidget {
	UUMGBankAndPlayerInfoWidget* BankAndPlayerInfoWidget; // 0x358
	FText ItemOrPowerText; // 0x360
	FText AddonText; // 0x378
	FText OfferingText; // 0x390
	FText PerksText; // 0x3a8
	FText TextWaitingForPlayers; // 0x3c0
	FText TextEstimatedTimeTitle; // 0x3d8
	UButton* ButtonCancelSearching; // 0x3f0
	UUMGPartySlotsWidget* PartySlots; // 0x3f8
};

struct UDBDRichTextBlock {
	bool _debugPreviewLargeTextState; // 0x6c8
	bool _debugPreviewUndockedState; // 0x6c9
	bool _hasLargeText; // 0x6ca
	FTextBlockOverrideProperties _largeTextProperties; // 0x6d0
	bool _overrideUndockedPropertiesWithLargeText; // 0x719
	bool _hasUndocking; // 0x71a
	FTextBlockOverrideProperties _undockedProperties; // 0x720
};

struct USoleSurvivor {
	float _auraHideDistancePerDeadOrDisconnectedSurvivor[0x3]; // 0x3d0
	TArray<ACamperPlayer*> _otherSurvivors; // 0x3e0
};

struct ULacerationComponent {
	float _laceration; // 0xf0
	UStatusEffect* _onHitSpeedBoost; // 0x100
	FTunableStat _maxLaceration; // 0x130
	FDBDTunableRowHandle _lacerationExplosionDamage; // 0x1b0
	FTunableStat _lacerationRegressionPerSecond; // 0x1d8
	FTunableStat _lacerationRegressionPerSecondWhileRunning; // 0x258
	FDBDTunableRowHandle _speedBoostIntensity; // 0x2d8
	FDBDTunableRowHandle _speedBoostDuration; // 0x300
	FDBDTunableRowHandle _stopTickingRegressionWhileInjured; // 0x328
	FDBDTunableRowHandle _stopTickingRegressionWhileInChase; // 0x350
	FDBDTunableRowHandle _stopTickingRegressionWithinTerrorRadius; // 0x378
	FTunableStat _timeBeforeLacerationDecayStarts; // 0x3a0
	FDBDTunableRowHandle _regressionBufferTimerAlwaysTicks; // 0x420
	FDBDTunableRowHandle _lacerationToRemoveOnBasicAttack; // 0x448
	FDBDTunableRowHandle _thresholdForGraceTimerScoreEvent; // 0x470
};

struct UInterpTrackInstAnimControl {
	float LastUpdatePosition; // 0x30
};

struct UMaterial {
	UPhysicalMaterial* PhysMaterial; // 0x90
	UPhysicalMaterialMask* PhysMaterialMask; // 0x98
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0xa0
	FScalarMaterialInput Metallic; // 0xe0
	FScalarMaterialInput Specular; // 0xfc
	FScalarMaterialInput Anisotropy; // 0x118
	FVectorMaterialInput Normal; // 0x134
	FVectorMaterialInput Tangent; // 0x150
	FColorMaterialInput EmissiveColor; // 0x16c
	EMaterialDomain MaterialDomain; // 0x188
	EBlendMode BlendMode; // 0x189
	EDecalBlendMode DecalBlendMode; // 0x18a
	EMaterialDecalResponse MaterialDecalResponse; // 0x18b
	char bIsDenseGeometryBHVR : 1; // 0x18c
	EMaterialShadingModel ShadingModel; // 0x190
	char bCastDynamicShadowAsMasked : 1; // 0x191
	char CastMaskedMaterialShadow : 1; // 0x194
	FMaterialShadingModelField ShadingModels; // 0x198
	float OpacityMaskClipValue; // 0x19c
	FVectorMaterialInput WorldPositionOffset; // 0x1a0
	FScalarMaterialInput Refraction; // 0x1bc
	FMaterialAttributesInput MaterialAttributes; // 0x1d8
	FScalarMaterialInput PixelDepthOffset; // 0x1f8
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x214
	char bEnableSeparateTranslucency : 1; // 0x230
	char bEnableResponsiveAA : 1; // 0x230
	char bScreenSpaceReflections : 1; // 0x230
	char bContactShadows : 1; // 0x230
	char TwoSided : 1; // 0x230
	char DitheredLODTransition : 1; // 0x230
	char DitherOpacityMask : 1; // 0x230
	char bAllowNegativeEmissiveColor : 1; // 0x230
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x231
	char bEnableMobileSeparateTranslucency : 1; // 0x232
	int32_t NumCustomizedUVs; // 0x234
	float TranslucencyDirectionalLightingIntensity; // 0x238
	float TranslucentShadowDensityScale; // 0x23c
	float TranslucentSelfShadowDensityScale; // 0x240
	float TranslucentSelfShadowSecondDensityScale; // 0x244
	float TranslucentSelfShadowSecondOpacity; // 0x248
	float TranslucentBackscatteringExponent; // 0x24c
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x250
	float TranslucentShadowStartOffset; // 0x260
	char bDisableDepthTest : 1; // 0x264
	char bRenderFragmentOnce : 1; // 0x268
	char bWriteOnlyAlpha : 1; // 0x26c
	char bGenerateSphericalParticleNormals : 1; // 0x26c
	char bTangentSpaceNormal : 1; // 0x26c
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x26c
	char bBlockGI : 1; // 0x26c
	char bUsedAsSpecialEngineMaterial : 1; // 0x26c
	char bUsedWithSkeletalMesh : 1; // 0x26c
	char bUsedWithEditorCompositing : 1; // 0x26c
	char bUsedWithParticleSprites : 1; // 0x26d
	char bUsedWithBeamTrails : 1; // 0x26d
	char bUsedWithMeshParticles : 1; // 0x26d
	char bUsedWithNiagaraSprites : 1; // 0x26d
	char bUsedWithNiagaraRibbons : 1; // 0x26d
	char bUsedWithNiagaraMeshParticles : 1; // 0x26d
	char bUsedWithGeometryCache : 1; // 0x26d
	char bUsedWithStaticLighting : 1; // 0x26d
	char bUsedWithMorphTargets : 1; // 0x26e
	char bUsedWithSplineMeshes : 1; // 0x26e
	char bUsedWithInstancedStaticMeshes : 1; // 0x26e
	char bUsedWithGeometryCollections : 1; // 0x26e
	char bUsesDistortion : 1; // 0x26e
	char bUsedWithClothing : 1; // 0x26e
	char bUsedWithWater : 1; // 0x270
	char bUsedWithHairStrands : 1; // 0x270
	char bUsedWithLidarPointCloud : 1; // 0x270
	char bUsedWithUI : 1; // 0x274
	char bAutomaticallySetUsageInEditor : 1; // 0x274
	char bFullyRough : 1; // 0x274
	char bUseFullPrecision : 1; // 0x274
	char bUseLightmapDirectionality : 1; // 0x274
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x278
	char bUseHQForwardReflections : 1; // 0x27c
	char bUsePlanarForwardReflections : 1; // 0x27c
	char bNormalCurvatureToRoughness : 1; // 0x27c
	EMaterialTessellationMode D3D11TessellationMode; // 0x27d
	char bEnableCrackFreeDisplacement : 1; // 0x27e
	char bEnableAdaptiveTessellation : 1; // 0x27e
	char AllowTranslucentCustomDepthWrites : 1; // 0x27e
	char Wireframe : 1; // 0x27e
	EMaterialShadingRate ShadingRate; // 0x27f
	char bCanMaskedBeAssumedOpaque : 1; // 0x280
	char bIsMasked : 1; // 0x280
	char bIsPreviewMaterial : 1; // 0x280
	char bIsFunctionPreviewMaterial : 1; // 0x280
	char bUseMaterialAttributes : 1; // 0x280
	char bCastRayTracedShadows : 1; // 0x280
	char bUseTranslucencyVertexFog : 1; // 0x280
	char bIsSky : 1; // 0x280
	char bUseTranslucencyVolumetricFog : 1; // 0x284
	char bComputeFogPerPixel : 1; // 0x288
	char bOutputTranslucentVelocity : 1; // 0x288
	char bAllowDevelopmentShaderCompile : 1; // 0x288
	char bIsMaterialEditorStatsMaterial : 1; // 0x288
	EBlendableLocation BlendableLocation; // 0x289
	char BlendableOutputAlpha : 1; // 0x28a
	char bEnableStencilTest : 1; // 0x28a
	EMaterialStencilCompare StencilCompare; // 0x28b
	char StencilRefValue; // 0x28c
	ERefractionMode RefractionMode; // 0x28d
	int32_t BlendablePriority; // 0x290
	char bIsBlendable : 1; // 0x294
	uint32_t UsageFlagWarnings; // 0x298
	float RefractionDepthBias; // 0x29c
	FGuid StateId; // 0x2a0
	float MaxDisplacement; // 0x2b0
	FMaterialCachedExpressionData CachedExpressionData; // 0x340
};

struct ULegalMenuScreenUMG {
	UUMGAtlantaLegalMenuScreen* _atlLegalMenuScreen; // 0x168
};

struct UAtlantaEventsTemplateDataAsset {
	TMap<EEventsType, UUMGAtlantaBaseEventsTemplate*> Data; // 0x38
};

struct UBoxReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x2b8
	UBoxComponent* PreviewInfluenceBox; // 0x2c0
	UBoxComponent* PreviewCaptureBox; // 0x2c8
};

struct UAnimationSharingManager {
	TArray<USkeleton*> Skeletons; // 0x30
	TArray<UAnimSharingInstance*> PerSkeletonData; // 0x40
};

struct UTestObjectStateProviderComponent {
	UGameplayTagContainerComponent* GameplayTagContainerComponent; // 0xc0
};

struct UKillerLocomotionSubAnimInstance {
	UAnimSequence* _landLightTPV; // 0x4f8
	UAnimSequence* _landLightFPV; // 0x500
	UBlendSpace1D* _BSLandTPV; // 0x508
	UBlendSpace1D* _BSLandFPV; // 0x510
	UAnimSequence* _walkToFallTPV; // 0x518
	UAnimSequence* _walkToFallFPV; // 0x520
	UAnimSequence* _carryIdleTPV; // 0x528
	UAnimSequence* _carryIdleFPV; // 0x530
	UAnimSequence* _fallingTPV; // 0x538
	UAnimSequence* _fallingFPV; // 0x540
	bool _isFirstPersonView; // 0x548
	UAnimSequence* _landLight; // 0x550
	UBlendSpace1D* _BSLand; // 0x558
	UAnimSequence* _walkToFall; // 0x560
	UAnimSequence* _carryIdle; // 0x568
	UAnimSequence* _falling; // 0x570
	bool _isVaultingToFall; // 0x578
	FTagStateBool _isVaultingToFallState; // 0x580
};

struct URuntimeVirtualTextureStreamingProxy {
	FVirtualTextureBuildSettings Settings; // 0x108
	bool bSinglePhysicalSpace; // 0x114
	uint32_t BuildHash; // 0x118
};

struct UParticleModuleTypeDataBeam2 {
	EBeam2Method BeamMethod; // 0x38
	int32_t TextureTile; // 0x3c
	float TextureTileDistance; // 0x40
	int32_t Sheets; // 0x44
	int32_t MaxBeamCount; // 0x48
	float Speed; // 0x4c
	int32_t InterpolationPoints; // 0x50
	char bAlwaysOn : 1; // 0x54
	int32_t UpVectorStepSize; // 0x58
	FName BranchParentName; // 0x5c
	FRawDistributionFloat Distance; // 0x68
	EBeamTaperMethod TaperMethod; // 0x98
	FRawDistributionFloat TaperFactor; // 0xa0
	FRawDistributionFloat TaperScale; // 0xd0
	char RenderGeometry : 1; // 0x100
	char RenderDirectLine : 1; // 0x100
	char RenderLines : 1; // 0x100
	char RenderTessellation : 1; // 0x100
};

struct UHLODProxy {
	TArray<FHLODProxyMesh> ProxyMeshes; // 0x30
};

struct UBlackboardKeyType_Class {
	UObject* BaseClass; // 0x38
};

struct UFurtiveChase {
	int32_t _maxTokensByLevel[0x3]; // 0x3d0
	float _terrorRadiusSuppressionPerToken; // 0x3dc
};

struct UDBDEmblem_KillerChaser {
	UCurveFloat* _chasePointsByDurationCurve; // 0x148
	TMap<ACamperPlayer*, float> _hookedPlayersPenaltyDelay; // 0x168
	UDBDRankDesignTunables* _rankTunablesClass; // 0x1b8
};

struct UGMAdaptiveShadowMapControllerComponent {
	FBHVRPerDetailModeInt TileSize; // 0x210
	int32_t TileCountX; // 0x2b0
	int32_t TileCountY; // 0x2b4
	FIntPoint GridSize; // 0x2b8
	int32_t GeneratedTilesPerFrame; // 0x2c0
	FBHVRPerDetailModeInt MaxPreallocatedTilesPerFrame; // 0x2c8
	bool bSupportsDirectionalLights; // 0x368
	bool bSupportsSpotLights; // 0x369
	UMaterialInterface* LightFunctionMaterial; // 0x370
	float CullShadowIfPixelSizeLessThan; // 0x378
	bool bPreviewOnly; // 0x37c
	UGMAdaptiveShadowMapAtlas* _atlas; // 0x390
	UGMAdaptiveShadowMapController* _controller; // 0x398
	TMap<UGMAdaptiveShadowMapSourceComponent*, UGMAdaptiveShadowMapSource*> _shadowMapSources; // 0x3a0
	UMaterialInstanceDynamic* _lightFunctionMaterialInstance; // 0x3f0
};

struct UClothPhysicalMeshDataBase_Legacy {
	TArray<FVector> Vertices; // 0x30
	TArray<FVector> Normals; // 0x40
	TArray<uint32_t> Indices; // 0x50
	TArray<float> InverseMasses; // 0x60
	TArray<FClothVertBoneData> BoneData; // 0x70
	int32_t NumFixedVerts; // 0x80
	int32_t MaxBoneWeights; // 0x84
	TArray<uint32_t> SelfCollisionIndices; // 0x88
};

struct UVerticalBoxSlot {
	FSlateChildSize Size; // 0x40
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x60
	EVerticalAlignment VerticalAlignment; // 0x61
};

struct UUMGFriendPartyListElementWidget {
	UWidgetSwitcher* ButtonOrStatusSwitcher; // 0x598
	UButton* CancelInviteButton; // 0x5a0
	UImage* PartyStatusImage; // 0x5a8
	FSlateBrush IconNotReady; // 0x5b0
	FSlateBrush IconReady; // 0x640
};

struct ULuckyBreak {
	float _activationTime[0x3]; // 0x3d0
};

struct UAgonySubAnimInstance {
	bool _isInAgony; // 0x4f0
	bool _isInTormentTrail; // 0x4f1
	bool _isInTormentTrailEffect; // 0x4f2
	bool _isInDeathBed; // 0x4f3
	bool _isDeadInDeathBed; // 0x4f4
	bool _isInStruggleInDeathBed; // 0x4f5
};

struct UBTService_StateMonitor {
	FBlackboardKeySelector BBIsIntroCompleted; // 0x78
	FBlackboardKeySelector BBDifficultyLevel; // 0xa8
};

struct ULamentConfigurationOutlineStrategy {
	FLinearColor _noChainHuntProgressColor; // 0xc0
	FLinearColor _chainHuntActiveColor; // 0xd0
	FLinearColor _killerColor; // 0xe0
};

struct USharedAuthenticationMigrateComponent {
	UObject* _worldContextObject; // 0x30
};

struct UAtlantaSkillCheckWidget {
	UCanvasPanel* SkillCheckArea; // 0x300
	UImage* HitArea; // 0x308
	UImage* Hit; // 0x310
	UImage* OrangeSmoke; // 0x318
	UImage* BonusArea; // 0x320
	UImage* StartMarker; // 0x328
	UImage* EndMarker; // 0x330
	UCanvasPanel* HitAreaContainer; // 0x338
	UCanvasPanel* BonusAreaContainer; // 0x340
	UCanvasPanel* HitAreaStartMarkerContainer; // 0x348
	UCanvasPanel* HitAreaEndMarkerContainer; // 0x350
	UCanvasPanel* MarkerContainer; // 0x358
	FLinearColor HexColor; // 0x360
	FLinearColor DefaultColor; // 0x370
	bool _isPlayAnimation; // 0x380
	float PathCoveredAngle; // 0x384
};

struct ANiagaraActor {
	UNiagaraComponent* NiagaraComponent; // 0x230
	char bDestroyOnSystemFinish : 1; // 0x238
};

struct ABubbleIndicator {
	float _lifeTime; // 0x230
	bool _displayToLocallyObserved; // 0x234
};

struct UGeneratorToolboxRepairInteraction {
	FText _interactionTextWhenEmpty; // 0x758
	FDBDTunableRowHandle _repairSkillCheckDurationWhenEmpty; // 0x770
	FDBDTunableRowHandle _repairSkillCheckChanceWhenEmpty; // 0x798
};

struct UMaterialExpressionTextureSampleParameterSubUV {
	char bBlend : 1; // 0x130
};

struct UDatasmithStaticMeshGLTFImportData {
	FString SourceMeshName; // 0x30
};

struct UWidgetNavigation {
	FWidgetNavigationData Up; // 0x30
	FWidgetNavigationData Down; // 0x5c
	FWidgetNavigationData Left; // 0x88
	FWidgetNavigationData Right; // 0xb4
	FWidgetNavigationData Next; // 0xe0
	FWidgetNavigationData Previous; // 0x10c
};

struct URenderingFeaturesSequencer {
	ADBDAggregateCullDistanceVolumes* _aggregateCullDistanceVolumes; // 0x40
	UWorld* _world; // 0x48
};

struct UNiagaraDataInterfaceCurlNoise {
	uint32_t Seed; // 0x38
};

struct AEffectsLocator {
	TArray<FEffectsLocatorTargets> AffectedActors; // 0x230
	float ActorCaptureRadius; // 0x240
};

struct URegionFinder {
	TArray<FRegion> Regions; // 0x30
	float TIMEOUT; // 0x40
};

struct UAtlantaSaveGame {
	FString SaveSlotName; // 0x30
	uint32_t UserIndex; // 0x40
	FName LastGenericLoadingImageId; // 0x44
	FName LastSpecificLoadingImageId; // 0x50
	bool IsLastSpecificImage; // 0x5c
};

struct UNiagaraSystem {
	bool bDumpDebugSystemInfo; // 0x39
	bool bDumpDebugEmitterInfo; // 0x3a
	char bFixedBounds : 1; // 0x3c
	UNiagaraEffectType* EffectType; // 0x40
	bool bOverrideScalabilitySettings; // 0x48
	TArray<FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x50
	FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x60
	TArray<FNiagaraEmitterHandle> EmitterHandles; // 0x70
	TArray<UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x80
	UNiagaraScript* SystemSpawnScript; // 0x90
	UNiagaraScript* SystemUpdateScript; // 0x98
	FNiagaraSystemCompiledData SystemCompiledData; // 0xb0
	FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x308
	FBox FixedBounds; // 0x410
	bool bAutoDeactivate; // 0x42c
	float WarmupTime; // 0x430
	int32_t WarmupTickCount; // 0x434
	float WarmupTickDelta; // 0x438
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x43c
	TArray<FName> UserDINamesReadInSystemScripts; // 0x440
};

struct UStreamVideoSubsystem {
	UStreamVideoManager* StreamVideoManager; // 0x38
	UStreamVideoFactory* StreamVideoFactory; // 0x40
};

struct UFadeComponent {
	FMulticastInlineDelegate OnFadePercentChanged; // 0xb8
	float _fadeDuration; // 0xc8
};

struct USurvivorMadnessEffect {
	float _madness; // 0x358
};

struct UMagicLeapARPinSaveGame {
	FGuid PinnedID; // 0x30
	FTransform ComponentWorldTransform; // 0x40
	FTransform PinTransform; // 0x70
};

struct UNetAnalyticsAggregatorConfig {
	TArray<FNetAnalyticsDataConfig> NetAnalyticsData; // 0x30
};

struct UThrobber {
	int32_t NumberOfPieces; // 0x128
	bool bAnimateHorizontally; // 0x12c
	bool bAnimateVertically; // 0x12d
	bool bAnimateOpacity; // 0x12e
	USlateBrushAsset* PieceImage; // 0x130
	FSlateBrush Image; // 0x138
};

struct UWidgetAnimationPlayCallbackProxy {
	FMulticastInlineDelegate Finished; // 0x30
};

struct UScreenSpaceLocationComponent {
	float ScreenSpaceX; // 0x210
	float ScreenSpaceY; // 0x214
	int32_t FrameDelay; // 0x218
	FVector2D _currentResolution; // 0x21c
	TArray<FTransform> _previousTransforms; // 0x228
};

struct UParticleModuleMeshRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USurvivorOutlineUpdateStrategy {
	FLinearColor _inDangerColorForSurvivor; // 0xc0
	FLinearColor _noRecoveryDyingColor; // 0xd0
	FLinearColor _fullRecoveryDyingColor; // 0xe0
	FLinearColor _saviourColorForSurvivor; // 0xf0
	FLinearColor _colorForKiller; // 0x100
	UTexture* _revealedGradient; // 0x110
	UTexture* _nonRevealedGradient; // 0x118
	bool _trappedIconActive; // 0x120
};

struct ATormentMode {
	UChargeableComponent* _activateTormentModeCharge; // 0x540
	UPowerChargeComponent* _tormentModeCharge; // 0x548
	UPowerChargePresentationItemProgressComponent* _tormentModeChargePresentation; // 0x558
	UPowerToggleComponent* _powerToggleComponent; // 0x560
	UTormentTrailSpawnerComponent* _tormentTrailSpawnerComponent; // 0x568
	UTormentTrailPointCollectionComponent* _tormentTrailPointCollectionComponent; // 0x570
	UTormentTrailPointCollectionComponent* _restrictedTormentTrailPointCollectionComponent; // 0x578
	UAuthoritativeActorPoolComponent* _tormentTrailControllerPool; // 0x580
	UAuthoritativeActorPoolComponent* _tormentAttackTrailControllerPool; // 0x588
	UAuthoritativeActorPoolComponent* _restrictedTormentTrailControllerPool; // 0x590
	UAuthoritativeActorPoolComponent* _tormentTrailPointPool; // 0x598
	UAuthoritativeActorPoolComponent* _restrictedTormentTrailPointPool; // 0x5a0
	FDBDTunableRowHandle _activateTormentModeSecondsToCharge; // 0x5a8
	FDBDTunableRowHandle _tormentModeMaxCharge; // 0x5d0
	FTunableStat _tormentModeChargeRate; // 0x5f8
	FTunableStat _tormentModeDischargeRate; // 0x678
	FDBDTunableRowHandle _tormentModePauseChargeRate; // 0x6f8
	FDBDTunableRowHandle _tormentModeAttackConsumePower; // 0x720
	FDBDTunableRowHandle _tormentModeMinimumPercentToActivate; // 0x748
	FDBDTunableRowHandle _tormentModeMouseYawScale; // 0x770
	FDBDTunableRowHandle _tormentModeYawAdjustTime; // 0x798
	FDBDTunableRowHandle _tormentModeGamePadYawScale; // 0x7c0
	FDBDTunableRowHandle _tormentModeYawInputLimit; // 0x7e8
	FDBDTunableRowHandle _tormentModeNotMovingYawScaleMultiplier; // 0x810
	FDBDTunableRowHandle _tormentModeNotMovingYawAdjustTime; // 0x838
	FDBDTunableRowHandle _tormentModeWalkSpeed; // 0x860
	FDBDTunableRowHandle _normalWalkSpeed; // 0x888
	FDBDTunableRowHandle _tormentModeForcedPitch; // 0x8b0
	UAgonyComponent* _agonyComponentClass; // 0x8d8
	UTormentTrailDetectorComponent* _killerTormentTrailDetectorClass; // 0x8f0
	UTormentTrailDetectorComponent* _survivorTormentTrailDetectorClass; // 0x8f8
	UTormentModeCooldownInteraction* _tormentModeCooldownInteraction; // 0x900
	UCurveFloat* _tormentModeChargeSpeedCurve; // 0x908
	AMobileTormentTrailRenderer* _mobileTormentTrailRendererClass; // 0x910
};

struct UDBDCoreUMGDesignTunables {
	TSoftClassPtr<UObject> CoreHudRootWidgetClass; // 0x30
	TSoftClassPtr<UObject> CorePlayerControllerClass; // 0x60
};

struct UHeadOn {
	bool IsPerformingHeadOn; // 0x3d0
	bool ExhaustOnlyOnSuccessfulStun; // 0x3d1
	bool StunKillersEnteringStunZone; // 0x3d2
	float _hideDuration[0x3]; // 0x3d4
	ALocker* _locker; // 0x3e0
};

struct UBTDecorator_IsObjectFocused {
	FBlackboardKeySelector BBObj; // 0x70
	EDecoratorIsObjFocusedFilter Filter; // 0xa0
};

struct ACameraRig_Rail {
	float CurrentPositionOnRail; // 0x230
	bool bLockOrientationToRail; // 0x234
	USceneComponent* TransformComponent; // 0x238
	USplineComponent* RailSplineComponent; // 0x240
	USceneComponent* RailCameraMount; // 0x248
};

struct UInAppPurchaseCallbackProxy2 {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UEditNormalsToolProperties {
	bool bRecomputeNormals; // 0x58
	ENormalCalculationMethod NormalCalculationMethod; // 0x59
	bool bFixInconsistentNormals; // 0x5a
	bool bInvertNormals; // 0x5b
	ESplitNormalMethod SplitNormalMethod; // 0x5c
	float SharpEdgeAngleThreshold; // 0x60
	bool bAllowSharpVertices; // 0x64
};

struct ADBDDebugGameMode {
	TMap<ADBDPlayerController*, int32_t> LoadoutIndex; // 0x420
	TSet<ADBDPlayer*> PlayersWithItems; // 0x470
	TArray<FCamperLoadout> CamperPawnOverrides; // 0x4c0
	TArray<FSlasherLoadout> SlasherPawnOverrides; // 0x4d0
};

struct UInteractionAudioComponent {
	UAkComponent* _audioComponent; // 0xb8
	FNonTunableStat _audioRadius; // 0xc0
};

struct UDedicatedServerStartupInitializer {
	UDBDTimeUtilities* _dbdTimeUtilities; // 0x78
};

struct UUMGHudEditorLayoutWidget {
	UUMGHudEditorScreen* hudEditorScreen; // 0x290
	UAkAudioEvent* _onSaveOverlapSound; // 0x298
	UUMGDragWidget_HudEditor* _currentWidgetToEdit; // 0x2a0
	TMap<UUMGHudEditorLayoutScreen*, bool> _isSaveDirtyMap; // 0x2a8
};

struct UPalletPullUpInteraction {
	EPalletSide _side; // 0x6d8
	APallet* _owningPallet; // 0x6e0
};

struct UNiagaraDataInterfaceVectorCurve {
	FRichCurve XCurve; // 0x60
	FRichCurve YCurve; // 0xe0
	FRichCurve ZCurve; // 0x160
};

struct UDistributionVectorParameterBase {
	FName ParameterName; // 0x58
	FVector MinInput; // 0x64
	FVector MaxInput; // 0x70
	FVector MinOutput; // 0x7c
	FVector MaxOutput; // 0x88
	DistributionParamMode ParamModes[0x3]; // 0x94
};

struct UEndpointSubmix {
	FName EndpointType; // 0x40
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x50
	UAudioEndpointSettingsBase* EndpointSettings; // 0x58
};

struct UHasEventHappenedEvaluatorCondition {
	FGameplayTag _firstGameEvent; // 0x60
};

struct UBlightPowerState {
	UCurveFloat* _stateSpeedCurve; // 0x40
	FTunableStat _stateDuration; // 0x48
	FDBDTunableRowHandle _cameraPitchRecenterTime; // 0xc8
	FDBDTunableRowHandle _wallDashCollisionRadius; // 0xf0
	FDBDTunableRowHandle _wallDashCollisionHeight; // 0x118
	FDBDTunableRowHandle _wallDashCollisionRange; // 0x140
	bool _playerCanCancelEarly; // 0x168
	bool _displayCollisionIndicator; // 0x178
};

struct UAISense_Team {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x90
};

struct UReturnTheFavorQEEvaluator {
	TSet<FGameplayTag> _favorToReturnEvents; // 0x90
	TSet<TWeakObjectPtr<ADBDPlayer>> _instigatorList; // 0xe0
};

struct UBlightPowerStateNonLethalDash {
	bool _smashBreakables; // 0x250
};

struct UWidget {
	UPanelSlot* Slot; // 0x30
	FDelegate bIsEnabledDelegate; // 0x38
	FText ToolTipText; // 0x50
	FDelegate ToolTipTextDelegate; // 0x68
	UWidget* ToolTipWidget; // 0x80
	FDelegate ToolTipWidgetDelegate; // 0x88
	FDelegate VisibilityDelegate; // 0x9c
	FWidgetTransform RenderTransform; // 0xb0
	FVector2D RenderTransformPivot; // 0xcc
	char bIsVariable : 1; // 0xd4
	char bCreatedByConstructionScript : 1; // 0xd4
	char bIsEnabled : 1; // 0xd4
	char bOverride_Cursor : 1; // 0xd4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xd8
	char bIsVolatile : 1; // 0xe0
	EMouseCursor Cursor; // 0xe1
	EWidgetClipping Clipping; // 0xe2
	ESlateVisibility Visibility; // 0xe3
	float RenderOpacity; // 0xe4
	UWidgetNavigation* Navigation; // 0xe8
	EFlowDirectionPreference FlowDirectionPreference; // 0xf0
	TArray<UPropertyBinding*> NativeBindings; // 0x118
};

struct UKillerIsLowOnAmmo {
	int32_t _ammoThreshold; // 0xe8
};

struct UButton {
	USlateWidgetStyleAsset* Style; // 0x140
	FButtonStyle WidgetStyle; // 0x148
	FLinearColor ColorAndOpacity; // 0x3f0
	FLinearColor BackgroundColor; // 0x400
	EButtonClickMethod ClickMethod; // 0x410
	EButtonTouchMethod TouchMethod; // 0x411
	EButtonPressMethod PressMethod; // 0x412
	bool IsFocusable; // 0x413
	FMulticastInlineDelegate OnClicked; // 0x418
	FMulticastInlineDelegate OnPressed; // 0x428
	FMulticastInlineDelegate OnReleased; // 0x438
	FMulticastInlineDelegate OnHovered; // 0x448
	FMulticastInlineDelegate OnUnhovered; // 0x458
	FMulticastInlineDelegate OnLongPress; // 0x468
	FTimerHandle LongPressTimerHandle; // 0x478
};

struct UDatasmithStaticMeshComponentTemplate {
	UStaticMesh* StaticMesh; // 0x38
	TArray<UMaterialInterface*> OverrideMaterials; // 0x40
};

struct UBloodOrbOverlapRevealToKiller {
	UTimerObject* _revealTimer; // 0x378
};

struct UButtonPressTracker {
	TWeakObjectPtr<UInputComponent> _trackedInputComponent; // 0x50
	TWeakObjectPtr<UPlayerInput> _playerInput; // 0x58
};

struct AOfferingCard {
	TArray<FRarityTexture> RarityTextures; // 0x230
	TArray<FOfferingTypeTexture> OfferingTypeTextures; // 0x240
};

struct UPaperTerrainMaterial {
	TArray<FPaperTerrainMaterialRule> Rules; // 0x38
	UPaperSprite* InteriorFill; // 0x48
};

struct UMovieSceneTrack {
	FMovieSceneTrackEvalOptions EvalOptions; // 0x58
	bool bIsEvalDisabled; // 0x5d
};

struct UInterpTrackInstColorProp {
	FColor ResetColor; // 0x60
};

struct UUMGCustomizationItemBuyButton {
	UImage* CurrencyColorStripe; // 0x410
	TMap<ECurrencyType, FColor> _currencyStripeColors; // 0x418
	FLinearColor _disabledOpacity; // 0x468
	FLinearColor _enabledOpacity; // 0x478
};

struct UUMGMenuMarketingBanner {
	UTextBlock* subtitle; // 0x470
};

struct USkeletalMeshSimplificationSettings {
	FName SkeletalMeshReductionModuleName; // 0x48
};

struct UNavModifierComponent {
	UNavArea* AreaClass; // 0xe8
	FVector FailsafeExtent; // 0xf0
	char bIncludeAgentHeight : 1; // 0xfc
};

struct USurvivorWasRecentlyUnhookedEffect {
	FDBDTunableRowHandle _survivorWasRecentlyUnhookedDuration; // 0x350
};

struct UUntrap {
	TArray<FString> _overridableInteractions; // 0x6d8
	FName _bearTrapUpdateMontageID; // 0x6e8
	FName _bearTrapFinishMontageID; // 0x6f4
};

struct ARespawnableInteractable {
	FMulticastInlineDelegate OnInteractionEnded; // 0x328
	FMulticastInlineDelegate OnIsInteractingChanged; // 0x338
	bool _isHidden; // 0x348
};

struct UBTTask_BlueprintBase {
	AAIController* AIOwner; // 0x78
	AActor* ActorOwner; // 0x80
	FIntervalCountdown TickInterval; // 0x88
	char bShowPropertyDetails : 1; // 0xa8
};

struct UOtherCharactersVerticalCollisionsHandler {
	TArray<AActor*> _ignoreBelowActors; // 0xb8
	TArray<AActor*> _overlappingActors; // 0xc8
	UCapsuleComponent* _pawnDetector; // 0xd8
};

struct UBTService {
	float Interval; // 0x68
	float RandomDeviation; // 0x6c
	char bCallTickOnSearchStart : 1; // 0x70
	char bRestartTimerOnEachActivation : 1; // 0x70
};

struct UOniDemonModeAttackStateComponent {
	FMulticastInlineDelegate OnChargedAttackReadyChanged; // 0xc0
};

struct UBTDecorator_IsTunable {
	ETunableComparison Operator; // 0x70
	FAITunableParameter TunableValue; // 0x74
	float CompareToValue; // 0x84
};

struct UParticleModuleVectorFieldScale {
	UDistributionFloat* VectorFieldScale; // 0x38
	FRawDistributionFloat VectorFieldScaleRaw; // 0x40
};

struct UNetSynchedClock {
	float _serverTimeUpdateDelay; // 0xc0
};

struct USplashScreenUMG {
	UUMGSplashScreen* _splashScreen; // 0x138
};

struct UUMGAtlantaFriendListScreen {
	UWidgetSwitcher* ListSwitcher; // 0x360
	UWidgetSwitcher* SearchResultSwitcher; // 0x368
	UUMGBaseFriendListElement* NonFriendSearchResult; // 0x370
	UUMGBaseFriendListElement* RequestReceivedSearchResult; // 0x378
	UUMGBaseFriendListElement* RequestSentSearchResult; // 0x380
	UUMGBaseFriendListElement* FriendSearchResult; // 0x388
	UTextBlock* SearchFailureText; // 0x390
	UUMGBaseButtonWidget* CloseButton; // 0x398
	UUMGFriendSearchBarWidget* SearchBar; // 0x3a0
	UHorizontalBox* ButtonTabContainer; // 0x3a8
	UUMGFriendListTabWidget* FriendListTabWidget; // 0x3b0
	UUMGSuggestionsListTabWidget* SuggestionListTabWidget; // 0x3b8
	UUMGRequestsListTabWidget* RequestListTabWidget; // 0x3c0
	UUMGFriendTabButtonWidget* FriendsTabButton; // 0x3c8
	UUMGFriendTabButtonWidget* SuggestionsTabButton; // 0x3d0
	UUMGFriendTabButtonWidget* RequestsTabButton; // 0x3d8
	UUMGBaseFriendListContextualMenuWidget* CurrentContextualMenuWidget; // 0x3e0
	TSoftClassPtr<UObject> FriendWidget; // 0x3e8
	TSoftClassPtr<UObject> RequestSentWidget; // 0x418
	TSoftClassPtr<UObject> FriendRequestReceivedWidget; // 0x448
	TSoftClassPtr<UObject> FriendsSuggestionWidget; // 0x478
	TSoftClassPtr<UObject> FriendsSuggestion; // 0x4a8
	TSoftClassPtr<UObject> FriendPartyInviteWidgetClass; // 0x4d8
	TSoftClassPtr<UObject> ContextualMenuInvite; // 0x508
	TSoftClassPtr<UObject> ContextualMenuConfirmDeclineAction; // 0x538
	TMap<FString, FFriendWidgetList> _existingFriendListWidgets; // 0x5f8
	TMap<FString, UUMGBaseFriendListElement*> _existingFriendInvitePartyWidget; // 0x648
};

struct UBTDecorator_Random {
	FAITunableParameter PercentageRatio; // 0x70
};

struct UCoreEndGameCollapseBarWidget {
	float _progressBarInterpSpeed; // 0x2f8
};

struct UAnimNotifyState_TimedParticleEffect {
	UParticleSystem* PSTemplate; // 0x38
	FName SocketName; // 0x40
	FVector LocationOffset; // 0x4c
	FRotator RotationOffset; // 0x58
	bool bDestroyAtEnd; // 0x64
};

struct UBloodOrbStateMonitorComponent {
	FMulticastInlineDelegate OnBloodOrbAbsorbedCosmetic; // 0xb8
};

struct UBTService_GetPinObject {
	FBlackboardKeySelector BBToSetKey; // 0x80
	FGameplayTag PinTag; // 0xb0
};

struct UPlaneBrushProperties {
	EPlaneBrushSideMode WhichSide; // 0x58
};

struct UAkEventCallbackInfo {
	int32_t PlayingID; // 0x38
	int32_t EventId; // 0x3c
};

struct UInteractionAnimNotify {
	FName NotifyId; // 0x40
};

struct UUMGAtlantaFreeTicketConfirmToUsePopup {
	UTexture2D* FreeTicketIcon; // 0x3e8
	FText PopupTitleContent; // 0x3f0
};

struct UBTTask_MoveTo {
	float AcceptableRadius; // 0xa8
	UNavigationQueryFilter* FilterClass; // 0xb0
	float ObservedBlackboardValueTolerance; // 0xb8
	char bObserveBlackboardValue : 1; // 0xbc
	char bAllowStrafe : 1; // 0xbc
	char bAllowPartialPath : 1; // 0xbc
	char bTrackMovingGoal : 1; // 0xbc
	char bProjectGoalLocation : 1; // 0xbc
	char bReachTestIncludesAgentRadius : 1; // 0xbc
	char bReachTestIncludesGoalRadius : 1; // 0xbc
	char bStopOnOverlap : 1; // 0xbc
	char bStopOnOverlapNeedsUpdate : 1; // 0xbd
};

struct UMovementComponent {
	USceneComponent* UpdatedComponent; // 0xb8
	UPrimitiveComponent* UpdatedPrimitive; // 0xc0
	FVector Velocity; // 0xcc
	FVector PlaneConstraintNormal; // 0xd8
	FVector PlaneConstraintOrigin; // 0xe4
	char bUpdateOnlyIfRendered : 1; // 0xf0
	char bAutoUpdateTickRegistration : 1; // 0xf0
	char bTickBeforeOwner : 1; // 0xf0
	char bAutoRegisterUpdatedComponent : 1; // 0xf0
	char bConstrainToPlane : 1; // 0xf0
	char bSnapToPlaneAtStart : 1; // 0xf0
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xf0
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xf0
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xf3
};

struct UAkTVOSInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkAudioSession AudioSession; // 0x98
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa8
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xd0
};

struct UMorphTarget {
	USkeletalMesh* BaseSkelMesh; // 0x30
};

struct UIsPerformingInteractionEvaluatorCondition {
	TArray<FGameplayTag> _semanticTags; // 0x48
};

struct UShapeAnimInstance {
	bool _isTier3Active; // 0x5a8
	UEvilWithinComponent* _evilWithinComponent; // 0x5b0
};

struct UNiagaraDataInterfaceAudioOscilloscope {
	USoundSubmix* Submix; // 0x38
	int32_t Resolution; // 0x40
	float ScopeInMilliseconds; // 0x44
};

struct UCamperHealthComponent {
	FMulticastInlineDelegate OnHealedDelegate; // 0xb8
	FMulticastInlineDelegate OnInjuredBleedoutStarted; // 0xc8
	FMulticastInlineDelegate OnInjuredBleedoutEnded; // 0xd8
	FMulticastInlineDelegate OnInjuredBleedoutKO; // 0xe8
	FMulticastInlineDelegate OnDamageStateChanged; // 0x128
	FMulticastInlineDelegate OnDamageStateChangedCosmetic; // 0x138
	FDBDTunableRowHandle _bleedoutBaseDuration; // 0x148
	FTagStateBool _inInjuredBleedOut; // 0x170
	FDBDTimer _bleedOutTimer; // 0x1a0
	bool _canBleedout; // 0x1c8
	TArray<UInteractionDefinition*> _pauseInjuredBleedoutTimerInteractions; // 0x1d0
	int32_t _currentHealthStateCount; // 0x1e0
	int32_t _numHealthyHeals; // 0x1e8
	FDBDTimer _dyingTimer; // 0x1f0
	UChargeableComponent* _healFromDyingChargeable; // 0x220
	UChargeableComponent* _healFromInjuredChargeable; // 0x228
	UChargeableComponent* _mendChargeable; // 0x230
	ADBDPlayer* _injuredBleedoutInstigator; // 0x238
};

struct ULocalLightComponent {
	ELightUnits IntensityUnits; // 0x390
	float Radius; // 0x394
	float AttenuationRadius; // 0x398
	FLightmassPointLightSettings LightmassSettings; // 0x39c
};

struct USoundBase {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x100
	float MaxDistance; // 0x104
	float TotalSamples; // 0x108
	float Priority; // 0x10c
	USoundAttenuation* AttenuationSettings; // 0x110
	FSoundModulation Modulation; // 0x118
	USoundSubmixBase* SoundSubmixObject; // 0x128
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x130
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x140
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x148
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x158
};

struct UNewsContentManager {
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x48
};

struct UMindBreaker {
	float _effectDurationAfterRepair[0x3]; // 0x3d0
};

struct UBlightAnimInstance {
	UBlightPowerStateComponent* _blightPowerStateComponent; // 0x5a8
	EWallGrabState _powerState; // 0x5b0
	float _stateTimeRemaining; // 0x5b4
	float _lookAngle; // 0x5b8
};

struct UNiagaraDataInterfaceAudioSubmix {
	USoundSubmix* Submix; // 0x38
};

struct UAkAudioEvent {
	TMap<FString, TSoftObjectPtr<UAkAssetPlatformData>> LocalizedPlatformAssetDataMap; // 0x60
	UAkAudioBank* RequiredBank; // 0xb0
	UAkAssetPlatformData* CurrentLocalizedPlatformData; // 0xb8
	float MaxAttenuationRadius; // 0xc0
	bool IsInfinite; // 0xc4
	float MinimumDuration; // 0xc8
	float MaximumDuration; // 0xcc
};

struct UParticleModuleAttractorLine {
	FVector EndPoint0; // 0x38
	FVector EndPoint1; // 0x44
	FRawDistributionFloat Range; // 0x50
	FRawDistributionFloat Strength; // 0x80
};

struct ULocalPlayerTrackerComponent {
	FMulticastInlineDelegate TrackerOnLocallyObservedChanged; // 0x210
};

struct URecommendationsGenerator {
	TWeakObjectPtr<Ushopmanager> _shopManager; // 0x30
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x38
	TMap<FString, URecommendationsFilter*> _filters; // 0x40
};

struct UMockDataMeshTrackerComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x210
	bool ScanWorld; // 0x220
	bool RequestNormals; // 0x221
	bool RequestVertexConfidence; // 0x222
	EMeshTrackerVertexColorMode VertexColorMode; // 0x223
	TArray<FColor> BlockVertexColors; // 0x228
	FLinearColor VertexColorFromConfidenceZero; // 0x238
	FLinearColor VertexColorFromConfidenceOne; // 0x248
	float UpdateInterval; // 0x258
	UMRMeshComponent* MRMesh; // 0x260
};

struct UDemogorgonPounceInteraction {
	UChargedAttackStateComponent* _chargedAttackState; // 0x748
	ASlasherPlayer* _owningSlasher; // 0x750
};

struct UAkMusicSyncCallbackInfo {
	int32_t PlayingID; // 0x38
	FAkSegmentInfo SegmentInfo; // 0x3c
	EAkCallbackType MusicSyncType; // 0x60
	FString UserCueName; // 0x68
};

struct UBlackboardKeyType_Object {
	UObject* BaseClass; // 0x38
};

struct UBTService_FindInteractor_Exit {
	EFindInteractorExitOptions Filter; // 0x218
	EFindInteractorOpenConditions OpenCondition; // 0x219
	FBlackboardKeySelector BBFinalExitLocation; // 0x220
	float ClosedDoorOffset; // 0x250
	float OpenDoorOffset; // 0x254
	FAITunableParameter OpenedExitGoalWeight; // 0x258
	FAITunableParameter HatchBonusGoalWeight; // 0x268
};

struct UContentScheduleManager {
	UObjectLibrary* _availableMapLibrary; // 0x138
};

struct ULookAtThreatSurvivorSubAnimInstance {
	float _maxDistanceForThreatDetection; // 0x4f0
	FName _headSocket; // 0x4f4
	FName _rootSocket; // 0x500
	float _yawToThreat; // 0x50c
	float _pitchToThreat; // 0x510
	bool _isVisibleThreat; // 0x514
};

struct UK26PowerChargePresentationPowerFadeComponent {
	UK26AmmoHandlerComponent* _ammoHandler; // 0xb8
};

struct UClonedMeshComponent {
	TMap<USceneComponent*, UMeshComponent*> _originalToClone; // 0x2a0
	TMap<UMeshComponent*, USceneComponent*> _cloneToOriginal; // 0x2f0
};

struct UGeneratorOutlineUpdateStrategy {
	FLinearColor _unrepairedAuraColor; // 0x130
	FLinearColor _fullyRepairedAuraColor; // 0x140
};

struct UDatasmithAssetUserData {
	TMap<FName, FString> MetaData; // 0x30
};

struct UUMGSplashScreen {
	FMulticastInlineDelegate OnSaveGamePopupCompleteEvent; // 0x300
	FMulticastInlineDelegate OnScreenTouched; // 0x310
	UCanvasPanel* SavePopup; // 0x320
	UTextBlock* GameVersion; // 0x328
	UTextBlock* LoadingState; // 0x330
	UTextBlock* PressKey; // 0x338
	UButton* TapButton; // 0x340
	UTextBlock* SaveGameTitle; // 0x348
	UTextBlock* SaveGameDescription; // 0x350
	UUMGDownloadProgressionWidget* DownloadProgression; // 0x358
	UUMGCharacterSlideShowWidget* CharacterSlideShow; // 0x360
};

struct UDatasmithLightComponentTemplate {
	char bVisible : 1; // 0x38
	char CastShadows : 1; // 0x3c
	char bUseTemperature : 1; // 0x3c
	char bUseIESBrightness : 1; // 0x3c
	float Intensity; // 0x40
	float Temperature; // 0x44
	float IESBrightnessScale; // 0x48
	FLinearColor LightColor; // 0x4c
	UMaterialInterface* LightFunctionMaterial; // 0x60
	UTextureLightProfile* IESTexture; // 0x68
};

struct UKnivesLauncher {
	FDBDTunableRowHandle _knifeSpawnOffset; // 0x180
	FDBDTunableRowHandle _knifeSpawnForwardOffset; // 0x1a8
	FDBDTunableRowHandle _launchSpeed; // 0x1d0
	FTunableStat _maxAmmoTunable; // 0x1f8
	bool _isInSuperModeThrow; // 0x280
};

struct UFirecrackerEffectHandlerComponent {
	FMulticastInlineDelegate OnFirecrackerInRangeBegin; // 0xb8
	FMulticastInlineDelegate OnFirecrackerInRangeUpdate; // 0xc8
	FMulticastInlineDelegate OnFirecrackerInRangeEnd; // 0xd8
	TArray<FFirecrackerEffectData> _effectDataList; // 0xe8
};

struct UAnimCompress_RemoveLinearKeys {
	float MaxPosDiff; // 0x48
	float MaxAngleDiff; // 0x4c
	float MaxScaleDiff; // 0x50
	float MaxEffectorDiff; // 0x54
	float MinEffectorDiff; // 0x58
	float EffectorDiffSocket; // 0x5c
	float ParentKeyScale; // 0x60
	char bRetarget : 1; // 0x64
	char bActuallyFilterLinearKeys : 1; // 0x64
};

struct UAICharacterBehaviourInteractWithActorData {
	AActor* TargetActor; // 0x30
	ECharacterMovementTypes characterMovementType; // 0x48
	bool usePathfinding; // 0x49
};

struct UUMGAtlantaPromoCodePopup {
	UOverlay* RewardPanel; // 0x3e8
	UHorizontalBox* RewardWidgetContainer; // 0x3f0
	TSoftClassPtr<UObject> RewardItemWidgetClass; // 0x3f8
	int32_t RewardItemWidgetMax; // 0x428
	FMargin RewardItemWidgetPadding; // 0x42c
	float RewardItemWidgetRevealDelay; // 0x43c
	UOverlay* CodePanel; // 0x440
	UEditableTextBox* PromoCodeInputTextBox; // 0x448
	UImage* InvalidIcon; // 0x450
};

struct USkeletalMeshLODSettings {
	FPerPlatformInt MinLOD; // 0x38
	FPerPlatformBool DisableBelowMinLodStripping; // 0x3c
	FPerPlatformBool bSupportLODStreaming; // 0x3d
	FPerPlatformInt MaxNumStreamedLODs; // 0x40
	FPerPlatformInt MaxNumOptionalLODs; // 0x44
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x48
};

struct UInterpTrackInstAkAudioRTPC {
	float LastUpdatePosition; // 0x30
};

struct UDBDAttackHittingSubstate {
	FStatProperty _hittingPercentDamageBegin; // 0x118
};

struct UMaterialFunctionInterface {
	FGuid StateId; // 0x30
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x40
};

struct UEnvQueryTest_Pathfinding {
	EEnvTestPathfinding TestMode; // 0x238
	UEnvQueryContext* Context; // 0x240
	FAIDataProviderBoolValue PathFromContext; // 0x248
	FAIDataProviderBoolValue SkipUnreachable; // 0x288
	UNavigationQueryFilter* FilterClass; // 0x2c8
};

struct ANavMeshBoundsVolume {
	FNavAgentSelector SupportedAgents; // 0x268
};

struct UParticleModuleVelocityBase {
	char bInWorldSpace : 1; // 0x38
	char bApplyOwnerScale : 1; // 0x38
};

struct UMaterialExpressionGetMaterialAttributes {
	FMaterialAttributesInput MaterialAttributes; // 0x48
	TArray<FGuid> AttributeGetTypes; // 0x68
};

struct AGeneratorDrivenActor {
	float LightPriority; // 0x230
	EComponentMobility TargetMobileLightMobility; // 0x234
	TArray<bool> _activated; // 0x238
	TArray<AGenerator*> _generators; // 0x248
};

struct UFSM_NotCondition {
	UFSM_Condition* _condition; // 0x38
};

struct UFSM_State {
	FName _stateName; // 0x30
	bool _shouldTick; // 0x3c
	UFSM_State* _defaultChildStateClass; // 0x40
	TArray<UFSM_Transition*> _transitions; // 0x48
	UFiniteStateMachine* _stateMachine; // 0x58
	UFSM_State* _parentState; // 0x60
	UFSM_State* _currentChildState; // 0x68
	float _startTimestamp; // 0x70
};

struct UDBDCharacterMovementComponent {
	float ProjectedWallSlidingFactor; // 0x630
	float RandomInputFrontMultiplier; // 0x634
	float RandomInputSideMultiplier; // 0x638
	float RandomInputBackMultiplier; // 0x63c
	bool _forceUseDropStaggerFix; // 0x6c8
	UBaseCharacterVelocityAdditiveStrategy* _velocityAdditiveStrategy; // 0x888
	UBaseInputAccelerationConstraintStrategy* _inputAccelerationConstraintStrategy; // 0x890
	UBaseCharacterRotationStrategy* _rotationStrategy; // 0x898
	AActor* _lookAtTarget; // 0x8a0
};

struct ULoProChainsAddon {
	FAnimationMontageDescriptor _breakPalletMontage; // 0x298
	float _halfDamageDurationAfterBreakable; // 0x2b8
	bool _doesAddonIncludeBreakableWalls; // 0x2bc
};

struct UTormentTrailSpawnerComponent {
	ATormentTrailController* _currentTrailController; // 0xb8
	FDBDTunableRowHandle _restrictionRangeToHooks; // 0xc0
	FDBDTunableRowHandle _restrictionRangeToGenerators; // 0xe8
	FDBDTunableRowHandle _restrictionRangeToExitSwitch; // 0x110
	FDBDTunableRowHandle _maxSlopeAngleForTrail; // 0x138
	FDBDTunableRowHandle _minSlopeAngleForTrail; // 0x160
	FDBDTunableRowHandle _restrictionRangeToHatch; // 0x188
	FDBDTunableRowHandle _restrictionMaxVerticalDistance; // 0x1b0
	UTormentTrailPointCollectionComponent* _tormentTrailPointCollectionComponent; // 0x1d8
	UTormentTrailPointCollectionComponent* _restrictedTormentTrailPointCollectionComponent; // 0x1e0
	UAuthoritativeActorPoolComponent* _tormentTrailControllerPool; // 0x1e8
	UAuthoritativeActorPoolComponent* _tormentRestrictedTrailControllerPool; // 0x1f0
	TArray<AActor*> _actorsInRange; // 0x210
	FVector _slopeDetectionOverGroundVector; // 0x220
	FVector _slopeDetectionEndVector; // 0x22c
	float _forwardMultiplierSlopeDetection; // 0x238
	float _epsilonToAddToSpawnLocationInZ; // 0x23c
};

struct UGameplayTaskResource {
	int32_t ManualResourceID; // 0x30
	int8_t AutoResourceID; // 0x34
	char bManuallySetID : 1; // 0x38
};

struct UCharacterProgressionManager {
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x30
};

struct UDistributionVector {
	char bCanBeBaked : 1; // 0x38
	char bIsDirty : 1; // 0x38
	char bBakedDataSuccesfully : 1; // 0x38
};

struct ULevelStreamingDynamic {
	char bInitiallyLoaded : 1; // 0x160
	char bInitiallyVisible : 1; // 0x160
};

struct UTeleportToDemogorgonPortalInteraction {
	float _enterPortalPhaseDuration; // 0x6d8
	float _cancelTeleportingPhaseDuration; // 0x6dc
	UPortalTargetingComponent* _portalTargetingComponent; // 0x6e0
	UPortalPlacerStateComponent* _portalPlacerState; // 0x6e8
	ADemogorgonPortal* _startingPortal; // 0x6f0
	ADemogorgonPortal* _targetedPortal; // 0x6f8
	ADBDPlayer* _interactingPlayer; // 0x700
	AActor* _huskRef; // 0x768
	AActor* ClassToSpawnForHusk; // 0x770
};

struct UIsHighestTierOriginatingPerk {
	TArray<UStatusEffect*> _applicableEffects; // 0xe8
};

struct UDBDPrimaryDataAsset {
	FPrimaryAssetType AssetType; // 0x38
};

struct UDateTimerUpdater {
	TMap<UDateTimeProvider*, FDateTimerArray> _timers; // 0x38
	TMap<UDateTimeProvider*, UDateTimeProvider*> _dateTimeProvider; // 0x88
};

struct UComboBoxWidgetStyle {
	FComboBoxStyle ComboBoxStyle; // 0x38
};

struct US28P02 {
	float _healingSpeedGainPercentage[0x3]; // 0x488
	bool _canSelfHeal; // 0x494
	float _selfHealSpeedPenalty[0x3]; // 0x498
};

struct UMapActorDetectorComponent {
	FMulticastInlineDelegate OnActorDetected; // 0xb8
	TArray<EMapActorCategory> CollectedCategories; // 0xc8
	UPrimitiveComponent* _primitive; // 0xd8
};

struct UBTTask_SetFocusCooldown {
	FBlackboardKeySelector BBOnObject; // 0x78
	FName ContextName; // 0xa8
	bool InfiniteDuration; // 0xb4
	float Duration; // 0xb8
};

struct UAddon_TormentMode_20 {
	float _lingerDuration; // 0x298
};

struct UUMGBloodStoreRowWidget {
	UHorizontalBox* ItemContainer; // 0x310
	UCanvasPanel* LockStatusPanel; // 0x318
	UCanvasPanel* HardLockedStatusPanel; // 0x320
	int32_t _purchasedItemsNbr; // 0x328
	int32_t _requiredItemNbr; // 0x32c
	EBloodStoreRowStyle _rowStyle; // 0x330
	FMargin _itemPadding; // 0x334
	TSoftClassPtr<UObject> _itemWidgetClass; // 0x348
	UObject* _itemClass; // 0x378
};

struct UDecalSpawnerCollection {
	TMap<FName, UDecalSpawner*> _decalSpawners; // 0x30
};

struct UBasicOverlays {
	TArray<FOverlayItem> Overlays; // 0x30
};

struct UOwningSlasherHasBeenStill {
	float _secondsOfStillnessRequired; // 0xd0
};

struct UMaterialExpressionRotator {
	FExpressionInput Coordinate; // 0x48
	FExpressionInput Time; // 0x64
	float CenterX; // 0x80
	float CenterY; // 0x84
	float Speed; // 0x88
	uint32_t ConstCoordinate; // 0x8c
};

struct ASnowman {
	FDBDTunableRowHandle _timeToRespawn; // 0x3e0
	FDBDTunableRowHandle _timeToBeDestroyed; // 0x408
	ESnowmanState _snowmanState; // 0x430
	ESnowmanDestructionType _snowmanDestructionType; // 0x431
	ACamperPlayer* _survivorUsingThisSnowman; // 0x438
	USkeletalMeshComponent* _snowmanSkeletalMesh; // 0x4c0
	UDBDOutlineComponent* _snowmanOutlineComponent; // 0x4c8
	UCapsuleComponent* _snowmanCapsule; // 0x4d0
	UHideInSnowmanInteraction* _hideInSnowmanInteraction; // 0x4d8
	UChargeableComponent* _hideInSnowmanInteractionChargeable; // 0x4e0
	UInteractor* _snowmanInteractor; // 0x4e8
	UPrimitiveComponent* _snowmanInteractionZone; // 0x4f0
	USnowmanAttackableComponent* _snowmanAttackableComponent; // 0x4f8
	bool _isAcquiredFromPool; // 0x500
	bool _isMoving; // 0x520
};

struct UMediaPlayer {
	FMulticastInlineDelegate OnEndReached; // 0x30
	FMulticastInlineDelegate OnMediaClosed; // 0x40
	FMulticastInlineDelegate OnMediaOpened; // 0x50
	FMulticastInlineDelegate OnMediaOpenFailed; // 0x60
	FMulticastInlineDelegate OnPlaybackResumed; // 0x70
	FMulticastInlineDelegate OnPlaybackSuspended; // 0x80
	FMulticastInlineDelegate OnSeekCompleted; // 0x90
	FMulticastInlineDelegate OnTracksChanged; // 0xa0
	FTimespan CacheAhead; // 0xb0
	FTimespan CacheBehind; // 0xb8
	FTimespan CacheBehindGame; // 0xc0
	bool NativeAudioOut; // 0xc8
	bool PlayOnOpen; // 0xc9
	char Shuffle : 1; // 0xcc
	char Loop : 1; // 0xcc
	UMediaPlaylist* Playlist; // 0xd0
	int32_t PlaylistIndex; // 0xd8
	FTimespan TimeDelay; // 0xe0
	float HorizontalFieldOfView; // 0xe8
	float VerticalFieldOfView; // 0xec
	FRotator ViewRotation; // 0xf0
	FGuid PlayerGuid; // 0x128
};

struct AClipManager {
	TArray<UDBDClipRegionComponent*> _clippingZones; // 0x230
	TSet<UMeshComponent*> _meshComponents; // 0x240
	TArray<FMaterialOriginalState> _dissolvedMeshes; // 0x290
	TMap<UMaterialInterface*, UMaterialInterface*> _normal2dissolve; // 0x2a0
	TMap<UMaterialInterface*, UMaterialInterface*> _dissolve2normal; // 0x2f0
	UDataTable* _sphericalDissolveMaterials; // 0x340
};

struct UCustomWidgetWrapper_InGame {
	int32_t VirtualJoystickIndex; // 0x1a0
};

struct UBTService_CopyBBEntry {
	FBlackboardKeySelector BBFrom; // 0x80
	FBlackboardKeySelector BBTo; // 0xb0
	bool CopyOnlyValidKeyValue; // 0xe0
};

struct UAICharacterEvasionBehaviour {
	ADBDPlayer* _prey; // 0x58
	ADBDAIPlayerController* _preyAIController; // 0x60
	AActor* _currentEscapePoint; // 0x68
	UCharacterEvasionBehaviourData* _characterEvasionData; // 0x70
};

struct UAddon_TheBlight_14 {
	float _speedIncreasePerDash; // 0x298
};

struct USoundNodeModulator {
	float PitchMin; // 0x50
	float PitchMax; // 0x54
	float VolumeMin; // 0x58
	float VolumeMax; // 0x5c
};

struct UParticleModuleSubUV {
	USubUVAnimation* Animation; // 0x38
	FRawDistributionFloat SubImageIndex; // 0x40
	char bUseRealTime : 1; // 0x70
};

struct UListView {
	EOrientation Orientation; // 0x2f8
	ESelectionMode SelectionMode; // 0x2f9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2fa
	bool bClearSelectionOnClick; // 0x2fb
	bool bIsFocusable; // 0x2fc
	float EntrySpacing; // 0x300
	bool bReturnFocusToSelection; // 0x304
	TArray<UObject*> ListItems; // 0x308
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x328
	FMulticastInlineDelegate BP_OnItemClicked; // 0x338
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x348
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x358
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x368
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x378
};

struct AAtlantaOfflineLobbyCamera {
	float ZCameraPositionOffsetMultiplier; // 0x7a0
	float _kDefaultAspectRatio; // 0x7a8
};

struct UProceduralMeshComponent {
	bool bUseComplexAsSimpleCollision; // 0x480
	bool bUseAsyncCooking; // 0x481
	UBodySetup* ProcMeshBodySetup; // 0x488
	TArray<FProcMeshSection> ProcMeshSections; // 0x490
	TArray<FKConvexElem> CollisionConvexElems; // 0x4a0
	FBoxSphereBounds LocalBounds; // 0x4b0
	TArray<UBodySetup*> AsyncBodySetupQueue; // 0x4d0
};

struct AEscapeDoor {
	TArray<FVector> EscapePositions; // 0x338
	TArray<UObject*> EscapeFire; // 0x348
	UChargeableComponent* _killerOpenChargeable; // 0x358
	UChargeableComponent* _openChargeable; // 0x360
	UAkComponent* _ak_audio_escape; // 0x368
	UEscapeDoorAnimInstance* _escapeDoorAnimInstance; // 0x370
	USceneComponent* _rootComponent; // 0x378
	bool _activated; // 0x380
	AEscapeBlocker* _escapeBlockerInstance; // 0x388
	USpotLightComponent* _spotlight; // 0x390
	ACamperPlayer* _localOverlappingCamper; // 0x3e0
	UAIPerceptionStimuliSourceComponent* _perceptionStimuliComponent; // 0x3f0
	UBlockableComponent* _doorSwitchBlockableComponent; // 0x3f8
};

struct UTimelineTemplate {
	float TimelineLength; // 0x30
	ETimelineLengthMode LengthMode; // 0x34
	char bAutoPlay : 1; // 0x35
	char bLoop : 1; // 0x35
	char bReplicated : 1; // 0x35
	char bIgnoreTimeDilation : 1; // 0x35
	float UpdateInterval; // 0x38
	TArray<FTTEventTrack> EventTracks; // 0x40
	TArray<FTTFloatTrack> FloatTracks; // 0x50
	TArray<FTTVectorTrack> VectorTracks; // 0x60
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x70
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x80
	FGuid TimelineGuid; // 0x90
	FName VariableName; // 0xa0
	FName DirectionPropertyName; // 0xac
	FName UpdateFunctionName; // 0xb8
	FName FinishedFunctionName; // 0xc4
};

struct UARTrackedGeometry {
	FGuid UniqueId; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UInterpTrackFloatMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x98
	FName ParamName; // 0xa8
};

struct UNiagaraEmitter {
	bool bLocalSpace; // 0x30
	bool bDeterminism; // 0x31
	int32_t RandomSeed; // 0x34
	EParticleAllocationMode AllocationMode; // 0x38
	int32_t PreAllocationCount; // 0x3c
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x40
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x68
	FNiagaraEmitterScriptProperties EmitterSpawnScriptProps; // 0x90
	FNiagaraEmitterScriptProperties EmitterUpdateScriptProps; // 0xb8
	ENiagaraSimTarget SimTarget; // 0xe0
	FBox FixedBounds; // 0xe4
	int32_t MinDetailLevel; // 0x100
	int32_t MaxDetailLevel; // 0x104
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0x108
	FNiagaraPlatformSet Platforms; // 0x120
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0x140
	char bInterpolatedSpawning : 1; // 0x150
	char bFixedBounds : 1; // 0x150
	char bUseMinDetailLevel : 1; // 0x150
	char bUseMaxDetailLevel : 1; // 0x150
	char bOverrideGlobalSpawnCountScale : 1; // 0x150
	char bRequiresPersistentIDs : 1; // 0x150
	float MaxDeltaTimePerTick; // 0x154
	uint32_t DefaultShaderStageIndex; // 0x158
	uint32_t MaxUpdateIterations; // 0x15c
	TSet<uint32_t> SpawnStages; // 0x160
	char bSimulationStagesEnabled : 1; // 0x1b0
	char bDeprecatedShaderStagesEnabled : 1; // 0x1b0
	char bLimitDeltaTime : 1; // 0x1b0
	FString UniqueEmitterName; // 0x1b8
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x1c8
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x1d8
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1e8
	UNiagaraScript* GPUComputeScript; // 0x1f8
	TArray<FName> SharedEventGeneratorIds; // 0x200
};

struct USocialManager {
	TArray<USocialToolkit*> SocialToolkits; // 0x50
	USocialDebugTools* SocialDebugTools; // 0x60
};

struct UTcpMessagingSettings {
	bool EnableTransport; // 0x30
	FString ListenEndpoint; // 0x38
	TArray<FString> ConnectToEndpoints; // 0x48
	int32_t ConnectionRetryDelay; // 0x58
	bool bStopServiceWhenAppDeactivates; // 0x5c
};

struct UTerrorRadiusIndicatorWidget {
	float _anchorY; // 0x348
};

struct UBTDecorator_ConeCheck {
	float ConeHalfAngle; // 0x70
	FBlackboardKeySelector ConeOrigin; // 0x78
	FBlackboardKeySelector ConeDirection; // 0xa8
	FBlackboardKeySelector Observed; // 0xd8
};

struct UFlurryOfKnives {
	int32_t _replicatedNumOfStacksReduction; // 0x720
	bool _isSuperModeThrow; // 0x724
	UStatusEffect* _selfSlowEffect; // 0x770
	FDBDTunableRowHandle _flurryOfKnivesEnterDuration; // 0x778
	FDBDTunableRowHandle _flurryOfKnivesExitDuration; // 0x7a0
	FDBDTunableRowHandle _chargeTime; // 0x7c8
	FTunableStat _baseTimeBetweenThrows; // 0x7f0
	UCurveFloat* _throwRateModifierByKnivesThrown; // 0x870
	FDBDTunableRowHandle _superModeThrowRateModifier; // 0x878
	FDBDTunableRowHandle _knivesLaunchSpeed; // 0x8a0
	FDBDTunableRowHandle _convergencePointDistance; // 0x8c8
	UCurveFloat* _coneOfFireAngleCurve; // 0x8f0
	FDBDTunableRowHandle _consecutiveKnivesStacksDecayTime; // 0x8f8
	FDBDTunableRowHandle _maxConsecutiveKnivesStacks; // 0x920
	UCurveFloat* _movementSpeedByKnivesThrown; // 0x948
	FDBDTunableRowHandle _superModeBaseMovementSpeed; // 0x950
	FDBDTunableRowHandle _baseWalkSpeed; // 0x978
	UCurveFloat* _recoilIntensityByKnivesThrown; // 0x9a0
	FDBDTunableRowHandle _recoilDuration; // 0x9a8
	FDBDTunableRowHandle _recoilAngle; // 0x9d0
	FDBDTunableRowHandle _maximumRecoilAngleVariation; // 0x9f8
	FDBDTunableRowHandle _rotationSpeedAdjustmentTime; // 0xa20
	FDBDTunableRowHandle _aimingStanceRotationYawScaleAdjustment; // 0xa48
	FDBDTunableRowHandle _aimingStanceRotationPitchScaleAdjustment; // 0xa70
	FDBDTunableRowHandle _throwingRotationYawScaleAdjustment; // 0xa98
	FDBDTunableRowHandle _throwingRotationPitchScaleAdjustment; // 0xac0
	FDBDTunableRowHandle _aimingStanceGamepadRotationYawScaleAdjustment; // 0xae8
	FDBDTunableRowHandle _aimingStanceGamepadRotationPitchScaleAdjustment; // 0xb10
	FDBDTunableRowHandle _throwingGamepadRotationYawScaleAdjustment; // 0xb38
	FDBDTunableRowHandle _throwingGamepadRotationPitchScaleAdjustment; // 0xb60
	UCurveFloat* _aimingGamepadPitchCurve; // 0xb88
	UCurveFloat* _aimingGamepadYawCurve; // 0xb90
	UCurveFloat* _throwingGamepadPitchCurve; // 0xb98
	UCurveFloat* _throwingGamepadYawCurve; // 0xba0
};

struct UK24WhipAttackOpenSubstate {
	UCurveFloat* _lvl3SpeedCurve; // 0x130
};

struct UPlayerInput {
	TArray<FKeyBind> DebugExecBindings; // 0x128
	TArray<FInputActionKeyMapping> ActionMappings; // 0x148
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x158
	TArray<FName> InvertedAxis; // 0x168
};

struct UPhysicsHandleComponent {
	UPrimitiveComponent* GrabbedComponent; // 0xb8
	char bSoftAngularConstraint : 1; // 0xcc
	char bSoftLinearConstraint : 1; // 0xcc
	char bInterpolateTarget : 1; // 0xcc
	float LinearDamping; // 0xd0
	float LinearStiffness; // 0xd4
	float AngularDamping; // 0xd8
	float AngularStiffness; // 0xdc
	float InterpolationSpeed; // 0x140
};

struct AAtmosphericFog {
	UAtmosphericFogComponent* AtmosphericFogComponent; // 0x230
};

struct UNiagaraDataInterfaceColorCurve {
	FRichCurve RedCurve; // 0x60
	FRichCurve GreenCurve; // 0xe0
	FRichCurve BlueCurve; // 0x160
	FRichCurve AlphaCurve; // 0x1e0
};

struct ASpectatorBeaconClient {
	FString DestSessionId; // 0x2f8
	FSpectatorReservation PendingReservation; // 0x308
	ESpectatorClientRequestType RequestType; // 0x380
	bool bPendingReservationSent; // 0x381
	bool bCancelReservation; // 0x382
};

struct ULoadingImagesDataProvider {
	TMap<FName, FLoadingImages> _cachedLoadingImages; // 0x30
	UDynamicContentHolder* _owningDynamicContentHolder; // 0x80
};

struct UEditPivotToolActionPropertySet {
	bool bUseWorldBox; // 0x60
};

struct UAtlCookedMaps {
	TArray<FAtlCookedMapDescription> Descriptions; // 0x38
};

struct UPacketHandlerProfileConfig {
	TArray<FString> Components; // 0x30
};

struct UUMGRefundPopup {
	UVerticalBox* RefundDataContainer; // 0x3e8
	TSoftClassPtr<UObject> RefundDataWidgetClass; // 0x3f0
};

struct UUMGCustomizationItemWidget {
	UImage* RarityBackground; // 0x310
	UImage* PaintOverlay; // 0x318
	UImage* Icon; // 0x320
	UCanvasPanel* NewIndicator; // 0x328
	UCanvasPanel* OutfitIndicator; // 0x330
	UVerticalBox* PricesContainer; // 0x338
	UCanvasPanel* ItemSelectedBorder; // 0x340
	UCanvasPanel* EquippedContainer; // 0x348
	TSoftClassPtr<UObject> _customizationItemPriceWidgetClass; // 0x350
	TArray<UUMGCustomizationItemPriceWidget*> _priceWidgets; // 0x380
	int32_t _itemIndex; // 0x390
	FName _itemId; // 0x394
};

struct ABaseVFX {
	bool _shouldLoadOnServer; // 0x230
};

struct UAkGroupValue {
	uint32_t GroupShortID; // 0x48
};

struct UAuthoritativePoolProjectileProviderAdapter {
	UAuthoritativeActorPoolComponent* _pool; // 0x38
};

struct UMeshSelectionTool {
	UMeshSelectionToolProperties* SelectionProps; // 0x210
	UMeshSelectionEditActions* SelectionActions; // 0x218
	UMeshSelectionToolActionPropertySet* EditActions; // 0x220
	UMeshSelectionSet* Selection; // 0x228
	TArray<AActor*> SpawnedActors; // 0x230
};

struct UGearhead {
	float _perkActivationDuration[0x3]; // 0x3d0
	bool _greatSkillCheck; // 0x3dc
	bool _basicAttack; // 0x3dd
	float _minimumAuraRevealDuration; // 0x3e0
	int32_t _attacksNeededToActivate; // 0x3e4
	int32_t _numAttacksBeforeActivation; // 0x3e8
	TMap<AGenerator*, FFastTimer> _timersBeforeUnreveal; // 0x3f0
	TArray<AGenerator*> _markedGenerators; // 0x440
	TArray<AGenerator*> _revealedGenerators; // 0x450
	TArray<AGenerator*> _local_revealedGenerators; // 0x460
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x68
};

struct ADBDAIBTController {
	UBehaviorTree* BehaviorTree; // 0x5d8
	TArray<UAISkill*> BaseSkills; // 0x5e0
	TArray<UAISkill*> RoleSkills; // 0x5f0
	TArray<FAISkillPerk> PerkSkills; // 0x600
	bool ListenToAttackEvents; // 0x610
	UDBDAIPerceptionComponent* _dbdPerception; // 0x618
	UDBDBlackboardComponent* _dbdBlackboard; // 0x620
	UDBDPathFollowingComponent* _dbdPathFollowing; // 0x628
	UDBDBehaviorTreeComponent* _dbdBehaviorTree; // 0x630
	UDBDNavMeshExplorerComponent* _navMeshExplorer; // 0x638
	UDBDAIStateComponent* _aiState; // 0x640
	UDBDAIGoalComponent* _aiGoal; // 0x648
	TMap<FGameplayTag, UBehaviorTree*> _setDynamicSubtrees; // 0x660
	TArray<UAISkill*> _aiSkills; // 0x6b0
};

struct UEditableGameplayTagQueryExpression_AnyTagsMatch {
	FGameplayTagContainer Tags; // 0x30
};

struct UUMGFriendListTabWidget {
	UUMGExpandableListWidget* SentInviteToParty; // 0x300
	UUMGExpandableListWidget* ConnectedFriendsExpandableList; // 0x308
	UUMGExpandableListWidget* DisconnectedFriendsExpandableList; // 0x310
};

struct AWindDirectionalSource {
	UWindDirectionalSourceComponent* Component; // 0x230
};

struct UStreamingSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x48
	char WarnIfTimeLimitExceeded : 1; // 0x48
	float TimeLimitExceededMultiplier; // 0x4c
	float TimeLimitExceededMinTime; // 0x50
	int32_t MinBulkDataSizeForAsyncLoading; // 0x54
	char UseBackgroundLevelStreaming : 1; // 0x58
	char AsyncLoadingUseFullTimeLimit : 1; // 0x58
	float AsyncLoadingTimeLimit; // 0x5c
	float PriorityAsyncLoadingExtraTime; // 0x60
	float LevelStreamingActorsUpdateTimeLimit; // 0x64
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x68
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x6c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x70
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x74
	char FlushStreamingOnExit : 1; // 0x78
	char EventDrivenLoaderEnabled : 1; // 0x78
};

struct UInAppPurchaseComponent {
	FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb8
	FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc8
	FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd8
	FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe8
	FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf8
	FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x108
	FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x118
};

struct UConvertToPolygonsTool {
	UConvertToPolygonsToolProperties* Settings; // 0x90
	UPreviewMesh* PreviewMesh; // 0x98
};

struct UAkPS5InitializationSettings {
	FAkCommonInitializationSettings CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkPS5AdvancedInitializationSettings AdvancedSettings; // 0xb8
};

struct UMultipleMadSurvivorsQEEvaluator {
	int32_t _requiredTier; // 0x90
	TSet<TWeakObjectPtr<AActor>> _madSurvivors; // 0x98
};

struct UBrushStampIndicator {
	float BrushRadius; // 0x40
	float BrushFalloff; // 0x44
	FVector BrushPosition; // 0x48
	FVector BrushNormal; // 0x54
	bool bDrawIndicatorLines; // 0x60
	bool bDrawRadiusCircle; // 0x61
	bool bDrawFalloffCircle; // 0x62
	int32_t SampleStepCount; // 0x64
	FLinearColor LineColor; // 0x68
	float LineThickness; // 0x78
	bool bDepthTested; // 0x7c
	bool bDrawSecondaryLines; // 0x7d
	float SecondaryLineThickness; // 0x80
	FLinearColor SecondaryLineColor; // 0x84
	UPrimitiveComponent* AttachedComponent; // 0x98
};

struct UUMGSubscriptionsPageScrollWidget {
	TSoftClassPtr<UObject> SubscriptionPackButtonClass; // 0x438
	FVector2D ItemPadding; // 0x468
};

struct UFSM_RefCondition {
	UFSM_Condition* _refcondition; // 0x38
};

struct UOniPounceInteraction {
	UOniDemonModeAttackStateComponent* _chargedAttackState; // 0x6e8
	UDemonModeComponent* _demonModeComponent; // 0x6f0
	ASlasherPlayer* _owningSlasher; // 0x6f8
};

struct UIpNetDriver {
	char LogPortUnreach : 1; // 0x768
	char AllowPlayerPortUnreach : 1; // 0x768
	uint32_t MaxPortCountToTry; // 0x76c
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x77c
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x780
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x784
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x788
	double MaxSecondsInReceive; // 0x790
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x798
	float ResolutionConnectionTimeout; // 0x79c
};

struct UUMGLoadoutBaseWidget {
	UUMGLoadoutItemButton* ItemOrPowerButton; // 0x300
	UUMGLoadoutItemButton* AddonFirstButton; // 0x308
	UUMGLoadoutItemButton* AddonSecondButton; // 0x310
	UUMGLoadoutItemButton* OfferingButton; // 0x318
	UUMGLoadoutItemButton* PerkFirstButton; // 0x320
	UUMGLoadoutItemButton* PerkSecondButton; // 0x328
	UUMGLoadoutItemButton* PerkThirdButton; // 0x330
	UUMGLoadoutItemButton* PerkFourthButton; // 0x338
	TArray<UUMGLoadoutItemButton*> LoadoutItemButtons; // 0x340
	bool usingMatchRules; // 0x350
	bool perkSlotsLockedByAdmin; // 0x351
	bool IsSlasher; // 0x352
};

struct UInterpGroupInst {
	UInterpGroup* Group; // 0x30
	AActor* GroupActor; // 0x38
	TArray<UInterpTrackInst*> TrackInst; // 0x40
};

struct UAISense_Damage {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x90
};

struct UPaperTileMap {
	bool Draft; // 0x30
	bool Licensed; // 0x31
	int32_t MapWidth; // 0x34
	int32_t MapHeight; // 0x38
	int32_t TileWidth; // 0x3c
	int32_t TileHeight; // 0x40
	float PixelsPerUnrealUnit; // 0x44
	float SeparationPerTileX; // 0x48
	float SeparationPerTileY; // 0x4c
	float SeparationPerLayer; // 0x50
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x58
	UMaterialInterface* Material; // 0x88
	TArray<UPaperTileLayer*> TileLayers; // 0x90
	float CollisionThickness; // 0xa0
	ESpriteCollisionMode SpriteCollisionDomain; // 0xa4
	ETileMapProjectionMode ProjectionMode; // 0xa5
	int32_t HexSideLength; // 0xa8
	UBodySetup* BodySetup; // 0xb0
	int32_t LayerNameIndex; // 0xb8
};

struct UQuestEventsHandlerTest {
	ADBDPlayer* _dbdPlayer; // 0x100
};

struct URecentlyActiveStateTagEvaluatorCondition {
	FGameplayTag _stateTag; // 0x4c
};

struct UInputKeySelector {
	FButtonStyle WidgetStyle; // 0x128
	FTextBlockStyle TextStyle; // 0x3d0
	FInputChord SelectedKey; // 0x658
	FSlateFontInfo Font; // 0x680
	FMargin Margin; // 0x6d8
	FLinearColor ColorAndOpacity; // 0x6e8
	FText KeySelectionText; // 0x6f8
	FText NoKeySpecifiedText; // 0x710
	bool bAllowModifierKeys; // 0x728
	bool bAllowGamepadKeys; // 0x729
	TArray<FKey> EscapeKeys; // 0x730
	FMulticastInlineDelegate OnKeySelected; // 0x740
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x750
};

struct UCoreGameManualPanelWidget {
	EGameManualMenuState _currentSelectedManualMenu; // 0x2e0
	EHelpType _currentGameManualTopic; // 0x2e1
	UPanelWidget* CategoryPanel; // 0x2e8
	UCoreGameManualCategoryButton* GameCategoryButton; // 0x2f0
	UCoreGameManualCategoryButton* SurvivorCategoryButton; // 0x2f8
	UCoreGameManualCategoryButton* KillerCategoryButton; // 0x300
	UPanelWidget* TopicsPanel; // 0x308
	UCoreTabContainerWidget* GameManualTopicsTabs; // 0x310
	UDBDTextBlock* GameManualContentTitle; // 0x318
	UDBDTextBlock* GameManualContentSubtitle; // 0x320
	UDBDRichTextBlock* GameManualContentText; // 0x328
	FMulticastInlineDelegate _onSetOnboardingMenuSubtitleDelegate; // 0x330
	FMulticastInlineDelegate _onResetOnboardingMenuSubtitleDelegate; // 0x340
};

struct ULuminARCandidateImage {
	bool bUseUnreliablePose; // 0x60
	bool bImageIsStationary; // 0x61
};

struct USourceEffectDynamicsProcessorPreset {
	FSourceEffectDynamicsProcessorSettings Settings; // 0x98
};

struct UParticleSystemComponent {
	UParticleSystem* Template; // 0x428
	TArray<UMaterialInterface*> EmitterMaterials; // 0x430
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x440
	char bResetOnDetach : 1; // 0x451
	char bUpdateOnDedicatedServer : 1; // 0x451
	char bAllowRecycling : 1; // 0x451
	char bAutoManageAttachment : 1; // 0x451
	char bAutoAttachWeldSimulatedBodies : 1; // 0x451
	char bWarmingUp : 1; // 0x452
	char bOverrideLODMethod : 1; // 0x452
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x452
	ParticleSystemLODMethod LODMethod; // 0x45f
	EParticleSignificanceLevel RequiredSignificance; // 0x460
	TArray<FParticleSysParam> InstanceParameters; // 0x468
	FMulticastInlineDelegate OnParticleSpawn; // 0x478
	FMulticastInlineDelegate OnParticleBurst; // 0x488
	FMulticastInlineDelegate OnParticleDeath; // 0x498
	FMulticastInlineDelegate OnParticleCollide; // 0x4a8
	bool bOldPositionValid; // 0x4b8
	FVector OldPosition; // 0x4bc
	FVector PartSysVelocity; // 0x4c8
	float WarmupTime; // 0x4d4
	float WarmupTickRate; // 0x4d8
	float SecondsBeforeInactive; // 0x4e0
	float MaxTimeBeforeForceUpdateTransform; // 0x4e8
	TArray<UParticleSystemReplay*> ReplayClips; // 0x508
	float CustomTimeDilation; // 0x520
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x58c
	FName AutoAttachSocketName; // 0x594
	EAttachmentRule AutoAttachLocationRule; // 0x5a0
	EAttachmentRule AutoAttachRotationRule; // 0x5a1
	EAttachmentRule AutoAttachScaleRule; // 0x5a2
	FMulticastInlineDelegate OnSystemFinished; // 0x5d0
};

struct UDrawPolygonToolStandardProperties {
	EDrawPolygonDrawMode PolygonType; // 0x58
	EDrawPolygonOutputMode OutputMode; // 0x59
	float FeatureSizeRatio; // 0x5c
	float ExtrudeHeight; // 0x60
	int32_t Steps; // 0x64
	bool bAllowSelfIntersections; // 0x68
	bool bShowGizmo; // 0x69
};

struct ALevelBounds {
	UBoxComponent* BoxComponent; // 0x230
	bool bAutoUpdateBounds; // 0x238
};

struct UOverlayMenuScreenUMG {
	UUMGAtlantaSettingScreen* _atlOverlayMenuScreen; // 0x300
};

struct ACamperPlayer {
	FMulticastInlineDelegate OnHookedStateChanged; // 0x10d8
	FMulticastInlineDelegate OnGuidedStateChanged; // 0x10e8
	FMulticastInlineDelegate OnPickedUpDelegate; // 0x10f8
	FMulticastInlineDelegate OnPickedUpEndDelegate; // 0x1108
	FMulticastInlineDelegate OnHPSlotChanged; // 0x1118
	FMulticastInlineDelegate OnImmobilizeStateChanged; // 0x1168
	FMulticastInlineDelegate OnHookEscapeFailedCosmetic; // 0x11a8
	float InputMashCount; // 0x11b8
	float InputMashDecayTime; // 0x11bc
	FName ReverseBearTrapAttachSocket; // 0x11c0
	bool isBeingDissolved; // 0x11cc
	float FootprintAudibleRange; // 0x11d0
	UStalkedComponent* StalkedComponent; // 0x11d8
	float CameraResetToleranceYaw; // 0x11e0
	float CameraResetTolerancePitch; // 0x11e4
	float CameraRecenterOffsetYaw; // 0x11e8
	float CameraRecenterOffsetPitch; // 0x11ec
	EGender Gender; // 0x11f0
	UCurveFloat* DropStaggerDuration; // 0x11f8
	UCurveFloat* DropStaggerMaxSpeed; // 0x1200
	float TimeforDeathWhileCrawling; // 0x1208
	float TimeforDeathWhileHooked; // 0x120c
	float SecondsUntilFootprintTrigger; // 0x1210
	bool TriggerAfflictionHUDIntro; // 0x1214
	UCamperStillnessTrackerComponent* _stillnessTracker; // 0x1298
	float PartiallyHiddenStillnessThreshold; // 0x12a0
	AActor* _escape; // 0x12a8
	AActor* _overlappingEscape; // 0x12b0
	USpherePlayerOverlapComponent* ProximityZone; // 0x12b8
	FDBDTimer _dropStaggerTimer; // 0x12d8
	UCapsuleComponent* SlashableZone; // 0x1308
	UCapsuleComponent* HookSlashableZone; // 0x1310
	UCamperSlashableComponent* _camperSlashable; // 0x1318
	UTerrorRadiusReceiverComponent* _terrorRadiusReceiverComponent; // 0x1320
	float CrouchCapsuleHalfHeight; // 0x1328
	float IKOffsetRightFoot; // 0x132c
	float IKOffsetLeftFoot; // 0x1330
	UDBDPawnSensingComponent* _camperSensor; // 0x1340
	USurviveTimerScoreEventComponent* _surviveTimerScoreComponent; // 0x1348
	TArray<ADBDPlayer*> _foundCampers; // 0x1368
	TArray<ADBDPlayer*> _potentialSaviors; // 0x1378
	UCamperHealthComponent* _healthComponent; // 0x1390
	UChargeableComponent* _hpSlot01; // 0x1398
	UChargeableComponent* _hpSlot02; // 0x13a0
	UChargeableComponent* _mendChargeable; // 0x13a8
	UBloodTrailSettings* _bloodTrailSettings; // 0x13b0
	UCamperBloodTrailComponent* _bloodTrailComponent; // 0x13b8
	UKillerInstinctComponent* _killerInstinctComponent; // 0x13c0
	UCameraAttachmentComponent* _cameraAttachment; // 0x13c8
	UCharmSpawnerComponent* _charmSpawnerComponent; // 0x13d0
	UHookableComponent* _hookableComponent; // 0x13d8
	UProtectionHitComponent* _protectionHitComponent; // 0x13e0
	UScreamComponent* _screamComponent; // 0x13e8
	UCharacterPositionRecorderComponent* _positionRecorder; // 0x13f0
	bool _runInputPressed; // 0x14ac
	bool _trapIndicatorActive; // 0x14d0
	TWeakObjectPtr<ACamperPlayer> _revealedSurvivor; // 0x14d4
	UCamperEndGameComponent* _camperEndGameComponent; // 0x14e0
	UAkComponent* _noOcclusionAkComponent; // 0x14e8
	bool _isHealingKOCamper; // 0x1514
	bool _isSkillCheckFailed; // 0x1515
	bool _isBeingSacrificed; // 0x1516
	bool _isWiggleProgressionAllowed; // 0x1517
	UMoveComponentToComponent* _meshMover; // 0x15b8
	USurvivorHitSprintEffect* _sprintEffect; // 0x15c0
};

struct UTheMettleOfMan {
	int32_t _tokenNeededToActivate[0x3]; // 0x3d0
	float _revealOutsideRange[0x3]; // 0x3dc
	bool _mustBeInjured; // 0x3e8
	int32_t _numTokenSoFar; // 0x3ec
	ETheMettleOfManPhase _currentPhase; // 0x3f0
	UStatusEffect* _revealToKillerEffect; // 0x400
};

struct USoundMix {
	char bApplyEQ : 1; // 0x30
	float EQPriority; // 0x34
	FAudioEQEffect EQSettings; // 0x38
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x78
	float initialDelay; // 0x88
	float FadeInTime; // 0x8c
	float Duration; // 0x90
	float FadeOutTime; // 0x94
};

struct UMeatHookOutlineUpdateStrategy {
	FLinearColor HookedOutlineColorSlasher; // 0x130
	FLinearColor CarryingOutlineColorSlasher; // 0x140
	FLinearColor DefaultOutlineColorSlasher; // 0x150
	FLinearColor VisibleOutlineColorCamper; // 0x160
};

struct UEmblemTooltipWidget {
	UImage* HeaderBackground; // 0x338
	UTextBlock* SubTitleLabel; // 0x340
	UImage* HeaderSmoke; // 0x348
	UVerticalBox* DataContainer; // 0x350
	UUMGTallyEmblemProgressBar* TallyEmblemProgressBar; // 0x358
	TSoftClassPtr<UObject> ProgressionDataWidgetClass; // 0x360
};

struct US28P01 {
	float _auraRevealDuration[0x3]; // 0x3d0
	float _auraRevealRange[0x3]; // 0x3dc
	UChargeableComponent* _S28P01ChargeableComponent; // 0x3e8
	bool _isPerkActive; // 0x3f0
	bool _isInteractionOngoing; // 0x3f1
	ADBDPlayer* _playerOwner; // 0x3f8
};

struct UBTTask_SetMovementMode {
	ECharacterMovementTypes MovementMode; // 0x78
};

struct UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0x108
	FGuid ExpressionGUID; // 0x114
	FName Group; // 0x124
};

struct UParticleModuleMeshRotationRateOverLife {
	FRawDistributionVector RotRate; // 0x38
	char bScaleRotRate : 1; // 0x80
};

struct UMaterialExpressionSpriteTextureSampler {
	bool bSampleAdditionalTextures; // 0x130
	int32_t AdditionalSlotIndex; // 0x134
	FText SlotDisplayName; // 0x138
};

struct UBrushBuilder {
	FString BitmapFilename; // 0x30
	FString ToolTip; // 0x40
	char NotifyBadParams : 1; // 0x50
	TArray<FVector> Vertices; // 0x58
	TArray<FBuilderPoly> Polys; // 0x68
	FName Layer; // 0x78
	char MergeCoplanars : 1; // 0x84
};

struct UActionButton {
	FSlateBrush DefaultImage; // 0x300
	UImage* IconImage; // 0x390
	UImage* ToggleSmokeImage; // 0x398
	UButton* Button; // 0x3a0
	float DefaultOpacity; // 0x3a8
	float ToggledOpacity; // 0x3ac
	float DisabledOpacity; // 0x3b0
	FSlateBrush Normal; // 0x3b8
	FSlateBrush Toggled; // 0x448
	FSlateBrush Disabled; // 0x4d8
	EActionButtonState _currentState; // 0x568
	EActionButtonState _previousState; // 0x569
};

struct UUMGCloseTooltipWidget {
	UButton* FullScreenButton; // 0x300
};

struct UBTTask_Interact {
	FBlackboardKeySelector BBInteractorObj; // 0x78
	EPawnInputPressTypes Input; // 0xa8
	float OnFailFocusCooldownDuration; // 0xac
	bool PropagateCooldownOnInteractable; // 0xb0
	float FailStartInteractTimeLimit; // 0xb4
};

struct UBoxOcclusionQueryComponent {
	float TimeUntilOccluded; // 0x450
};

struct UFontImportOptions {
	FFontImportOptionsData Data; // 0x30
};

struct UVirtualKeyboardManager {
	UVirtualKeyboard* _virtualKeyboard; // 0x30
};

struct USourceEffectSimpleDelayPreset {
	FSourceEffectSimpleDelaySettings Settings; // 0x88
};

struct UDBDAtlantaTutorialParameters {
	float SurvTutorial_WiggleChargeRateMultiplier; // 0x30
};

struct ABaseSky {
	bool AdjustCullDistance; // 0x238
	bool EnableIBL; // 0x239
	float IBLContributionMultiplier; // 0x23c
	FLinearColor ProbesTintColor; // 0x240
	float ProbesSaturationValue; // 0x250
	FBHVRPerDetailModeFloat ASMDepthBias; // 0x258
	FBHVRPerDetailModeFloat ASMDepthAttenuation; // 0x2f8
};

struct ACullDistanceVolume {
	TArray<FCullDistanceSizePair> CullDistances; // 0x268
	char bEnabled : 1; // 0x278
	char bUnbound : 1; // 0x278
};

struct UStaticMesh {
	FPerPlatformInt MinLOD; // 0x68
	bool bLimitLODRangeForShadow; // 0x6c
	FBHVRPerDetailModeInt ShadowMinLOD; // 0x70
	FBHVRPerDetailModeInt ShadowMaxLOD; // 0x110
	float LpvBiasMultiplier; // 0x1b0
	TArray<FStaticMaterial> StaticMaterials; // 0x1b8
	float LightmapUVDensity; // 0x1c8
	int32_t LightMapResolution; // 0x1cc
	int32_t LightMapCoordinateIndex; // 0x1d0
	float DistanceFieldSelfShadowBias; // 0x1d4
	bool bOverrideComponentDetailMode; // 0x1d8
	EDetailMode DetailMode; // 0x1d9
	int32_t DetailModeBitMask; // 0x1dc
	bool bOverrideReceivesDecals; // 0x1e0
	bool bReceivesDecals; // 0x1e1
	ELightmapGenerationMode LightmapGenerationMode; // 0x1e2
	FPerPlatformFloat DefaultLDMaxDrawDistance; // 0x1e4
	UBodySetup* BodySetup; // 0x1e8
	int32_t LODForCollision; // 0x1f0
	char bGenerateMeshDistanceField : 1; // 0x1f4
	char bStripComplexCollisionForConsole : 1; // 0x1f4
	char bHasNavigationData : 1; // 0x1f4
	char bSupportUniformlyDistributedSampling : 1; // 0x1f4
	char bSupportPhysicalMaterialMasks : 1; // 0x1f4
	char bIsBuiltAtRuntime : 1; // 0x1f4
	EBatchingMode BatchingMode; // 0x1f5
	int32_t BatchingDiameter; // 0x1f8
	char bAllowCPUAccess : 1; // 0x1fc
	char bSupportGpuUniformlyDistributedSampling : 1; // 0x1fc
	TArray<UStaticMeshSocket*> Sockets; // 0x220
	FVector PositiveBoundsExtension; // 0x240
	FVector NegativeBoundsExtension; // 0x24c
	FBoxSphereBounds ExtendedBounds; // 0x258
	int32_t ElementToIgnoreForTexFactor; // 0x274
	TArray<UAssetUserData*> AssetUserData; // 0x278
	UObject* EditableMesh; // 0x290
	UNavCollisionBase* NavCollision; // 0x298
};

struct UUMGCharacterScrollingInfoWidget {
	UUMGTeachablePerkButton* FirstTeachablePerk; // 0x300
	UUMGTeachablePerkButton* SecondTeachablePerk; // 0x308
	UUMGTeachablePerkButton* ThirdTeachablePerk; // 0x310
	UCanvasPanel* KillerInfoPanel; // 0x318
	UUMGInventoryItemButton* KillerPower; // 0x320
	UUMGHtmlRichText* CharacterBackstoryBox; // 0x328
	FText _killerPowerName; // 0x330
	FText _killerSpeedText; // 0x348
	FText _killerTerrorRadiusText; // 0x360
	FText _killerHeightText; // 0x378
	FText _perksTitle; // 0x390
	FText _teachablesTitle; // 0x3a8
	FText _powerTitle; // 0x3c0
	FText _attributesTitle; // 0x3d8
	UTextBlock* FirstTeachablePerkText; // 0x3f0
	UTextBlock* SecondTeachablePerkText; // 0x3f8
	UTextBlock* ThirdTeachablePerkText; // 0x400
	FText _backStoryTitle; // 0x408
	FMulticastInlineDelegate _onTeachableTooltipTriggeredEvent; // 0x440
	FMulticastInlineDelegate _onPowerButtonTooltipLongPressEvent; // 0x450
};

struct UParticleModuleBeamModifier {
	BeamModifierType modifierType; // 0x38
	FBeamModifierOptions PositionOptions; // 0x3c
	FRawDistributionVector Position; // 0x40
	FBeamModifierOptions TangentOptions; // 0x88
	FRawDistributionVector Tangent; // 0x90
	char bAbsoluteTangent : 1; // 0xd8
	FBeamModifierOptions StrengthOptions; // 0xdc
	FRawDistributionFloat Strength; // 0xe0
};

struct UAkAssetDataSwitchContainerData {
	TSoftObjectPtr<UAkGroupValue> GroupValue; // 0x30
	UAkGroupValue* DefaultGroupValue; // 0x60
	TArray<TSoftObjectPtr<UAkMediaAsset>> MediaList; // 0x68
	TArray<UAkAssetDataSwitchContainerData*> Children; // 0x78
};

struct UPoseAsset {
	FPoseDataContainer PoseContainer; // 0x88
	bool bAdditivePose; // 0x118
	int32_t BasePoseIndex; // 0x11c
	FName RetargetSource; // 0x120
};

struct UUMGBaseLandingPageStorefrontWidget {
	UHorizontalBox* BigButtonsSlot; // 0x300
	UVerticalBox* SmallButtonsSlot1; // 0x308
	UVerticalBox* SmallButtonsSlot2; // 0x310
	TSoftClassPtr<UObject> SmallButtonClass; // 0x318
	TSoftClassPtr<UObject> MediumButtonClass; // 0x348
	TSoftClassPtr<UObject> BigButtonClass; // 0x378
	FLinearColor DisabledButtonColor; // 0x3a8
	FText DisabledButtonText; // 0x3b8
	TArray<UUMGLandingPageButtonWidget*> _landingPageTabs; // 0x3e0
};

struct UMovieSceneColorTrack {
	bool bIsSlateColor; // 0x98
};

struct UUMGAtlantaBonusACEventTemplate {
	UUMGAtlCurrencyStorefrontWidget* currencyStorefrontWidget; // 0x300
	FString LastPackSmallIconPath; // 0x308
	float InitialSize; // 0x318
	float AugmentedSize; // 0x31c
	int32_t MaxNumberOfPacksToShowBigger; // 0x320
};

struct UInterpTrackVectorProp {
	FName PropertyName; // 0x98
};

struct UHasStatusEffectEvaluatorCondition {
	TArray<FName> _statusEffectList; // 0x48
};

struct UHatchAnimInstance {
	bool _isOpen; // 0x280
};

struct UBTTask_SetFleeLoopCooldown {
	float Duration; // 0x78
};

struct UPathStrategySelector_Flee {
	TMap<EAIFleePathStrategy, UPathStrategy*> FleePathStrategies; // 0x68
	TMap<EAIFleePathStrategy, UPathStrategy*> _activeFleePathStrategiesMap; // 0xc0
};

struct UImAllEars {
	int32_t _cooldownByLevel[0x3]; // 0x3d0
	float _durationByLevel[0x3]; // 0x3dc
	bool _useTerrorRadius; // 0x3e8
	float _triggerOutsideRadius; // 0x3ec
};

struct UAddon_K22Power_12 {
	float _increaseRemoveTwinTime; // 0x2a8
};

struct UTwinsSurvivorSubAnimInstance {
	bool _isRemovingTwin; // 0x4f0
};

struct UVideoCaptureProtocol {
	bool bUseCompression; // 0x70
	float CompressionQuality; // 0x74
};

struct UChaosClothSharedSimConfig {
	int32_t IterationCount; // 0x30
	int32_t SubdivisionCount; // 0x34
	float SelfCollisionThickness; // 0x38
	float CollisionThickness; // 0x3c
	bool bUseDampingOverride; // 0x40
	float Damping; // 0x44
	bool bUseGravityOverride; // 0x48
	float GravityScale; // 0x4c
	FVector Gravity; // 0x50
	bool bUseLocalSpaceSimulation; // 0x5c
	bool bUseXPBDConstraints; // 0x5d
};

struct UBorder {
	EHorizontalAlignment HorizontalAlignment; // 0x140
	EVerticalAlignment VerticalAlignment; // 0x141
	char bShowEffectWhenDisabled : 1; // 0x142
	FLinearColor ContentColorAndOpacity; // 0x144
	FDelegate ContentColorAndOpacityDelegate; // 0x154
	FMargin Padding; // 0x168
	FSlateBrush Background; // 0x178
	FDelegate BackgroundDelegate; // 0x208
	FLinearColor BrushColor; // 0x21c
	FDelegate BrushColorDelegate; // 0x22c
	FVector2D DesiredSizeScale; // 0x240
	bool bFlipForRightToLeftFlowDirection; // 0x248
	FDelegate OnMouseButtonDownEvent; // 0x24c
	FDelegate OnMouseButtonUpEvent; // 0x260
	FDelegate OnMouseMoveEvent; // 0x274
	FDelegate OnMouseDoubleClickEvent; // 0x288
};

struct UUMGCharacterButton {
	UImage* PortraitIcon; // 0x310
	UCanvasPanel* CharacterSelectedPanel; // 0x318
	UCanvasPanel* LevelPanel; // 0x328
	UTextBlock* CharacterLevelText; // 0x330
	UTextBlock* OwnedCustomizationText; // 0x338
	UTextBlock* TotalCustomizationText; // 0x340
	UCanvasPanel* PricePanel; // 0x348
	UUMGCharacterPrice* CellPrice; // 0x350
	UUMGCharacterPrice* ShardPrice; // 0x358
	FCharacterSlotData CharacterSlotData; // 0x360
};

struct UPromoPackContentDataAsset {
	TMap<EPromoPackContentType, FPromoPackContentTypeData> Data; // 0x38
};

struct UPathBuilder {
	float PathReachedPointRadius; // 0x38
	EAITerrorLevel ToleratedTerrorPressure; // 0x3c
	bool OverridePreviousPathStrategy; // 0x3d
	UNavMovePath* _path; // 0x40
	ADBDAIBTController* _aiOwner; // 0x48
};

struct USetDreamSnareInteraction {
	float MinPitch; // 0x6d8
	float MinPlacementDistance; // 0x6dc
	float MaxPlacementDistance; // 0x6e0
};

struct UDecalCollection {
	TArray<UDBDDecalComponent*> _decalComponentsArray; // 0x30
	TSet<UDBDDecalComponent*> _activeDecalComponents; // 0x40
	TSet<UDBDDecalComponent*> _inactiveDecalComponents; // 0x90
	TArray<bool> _DeltaZPool; // 0xe0
	TMap<UStaticMeshComponent*, int32_t> _deltaZMultipliers; // 0xf0
};

struct UApplicationLifecycleComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb8
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc8
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd8
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe8
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf8
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x108
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x118
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x128
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x138
};

struct UDBDAITypes {
	FGameplayTag AISkills_Context_Service_Root; // 0x30
	FGameplayTag AISkills_Context_Task_Slasher_AttackTarget; // 0x3c
	FGameplayTag AISkills_Context_Service_Slasher_AttackTarget; // 0x48
	FGameplayTag AISkills_Context_Task_Slasher_CrawlingTarget; // 0x54
	FGameplayTag AISkills_Context_Service_Slasher_CrawlingTarget; // 0x60
	FGameplayTag AISkills_Context_Service_Slasher_Investigate_NotInChase; // 0x6c
	FGameplayTag AISkills_Context_Service_Slasher_Investigate_InChase; // 0x78
	FGameplayTag AISkills_Context_Service_Slasher_Investigate_MoveAround; // 0x84
	FGameplayTag AISkills_Context_Service_Slasher_Patrol; // 0x90
	FGameplayTag AISkills_Context_Service_Slasher_Patrol_MoveAround; // 0x9c
	FGameplayTag AISkills_Context_Service_Camper_Standing; // 0xa8
	FGameplayTag AISkills_Context_Service_Camper_Flee_Run_InChase; // 0xb4
	FGameplayTag AISkills_Context_Service_Camper_Flee_Run_NotInChase; // 0xc0
	FGameplayTag AISkills_Context_Service_Camper_Patrol; // 0xcc
	FGameplayTag AISkills_Context_Service_Camper_RescueCarriedFriend; // 0xd8
	FGameplayTag AISkills_Context_Service_Camper_RemoveTrap; // 0xe4
	FGameplayTag AISkills_Context_Service_Camper_Chained; // 0xf0
	FGameplayTag AISkills_Context_Service_Camper_HelpOther; // 0xfc
	FGameplayTag AISkills_Context_Service_Camper_GoalInTerror; // 0x108
	FGameplayTag AISkills_Context_Service_Camper_Carried; // 0x114
	FGameplayTag AIBlackboard_InteractableWishList_FindSkill; // 0x120
	FGameplayTag AI_PointOfInterest_ActivatedDoor; // 0x12c
	FGameplayTag AI_PointOfInterest_ActivatedDoor_Opened; // 0x138
	FGameplayTag AI_PointOfInterest_BrokenGenerator; // 0x144
	FGameplayTag AI_PointOfInterest_OccupiedMeatHook; // 0x150
	FGameplayTag AI_PointOfInterest_HexTotem; // 0x15c
	FGameplayTag AI_PinLocation_WarpStart; // 0x168
	FGameplayTag AI_PinLocation_WarpEnd; // 0x174
	FGameplayTag AI_PinLocation_EQS; // 0x180
	FGameplayTag AI_PinLocation_WishedObj; // 0x18c
	FGameplayTag AI_PinLocation_GoTo; // 0x198
	FGameplayTag AI_PinObject_EQS; // 0x1a4
	FGameplayTag AI_PinObject_WishedObj; // 0x1b0
};

struct AVolumetricLightmapDensityVolume {
	FInt32Interval AllowedMipLevelRange; // 0x268
};

struct UEndMatchCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct ULevelVariantSets {
	UObject* DirectorClass; // 0x30
	TArray<UVariantSet*> VariantSets; // 0x38
};

struct UAchievementHandlerComponent {
	UGeneratorRepairWithGenericPerksEscapeAchievement* _generatorRepairWithGenericPerksOnlyEscapeAchievement; // 0xb8
	UCamperKONextToRaisedPalletAchievement* _camperKONextToRaisedPalletAchievement; // 0xc0
};

struct URejoinCheck {
	ERejoinStatus LastKnownStatus; // 0x30
	bool bRejoinAfterCheck; // 0x31
	bool bAttemptingRejoin; // 0x32
};

struct AMatineeActor {
	UInterpData* MatineeData; // 0x230
	FName MatineeControllerName; // 0x238
	float playRate; // 0x244
	char bPlayOnLevelLoad : 1; // 0x248
	char bForceStartPos : 1; // 0x248
	float ForceStartPosition; // 0x24c
	char bLooping : 1; // 0x250
	char bRewindOnPlay : 1; // 0x250
	char bNoResetOnRewind : 1; // 0x250
	char bRewindIfAlreadyPlaying : 1; // 0x250
	char bDisableRadioFilter : 1; // 0x250
	char bClientSideOnly : 1; // 0x250
	char bSkipUpdateIfNotVisible : 1; // 0x250
	char bIsSkippable : 1; // 0x250
	int32_t PreferredSplitScreenNum; // 0x254
	char bDisableMovementInput : 1; // 0x258
	char bDisableLookAtInput : 1; // 0x258
	char bHidePlayer : 1; // 0x258
	char bHideHud : 1; // 0x258
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x260
	char bShouldShowGore : 1; // 0x270
	TArray<UInterpGroupInst*> GroupInst; // 0x278
	TArray<FCameraCutInfo> CameraCuts; // 0x288
	char bIsPlaying : 1; // 0x298
	char bReversePlayback : 1; // 0x298
	char bPaused : 1; // 0x298
	char bPendingStop : 1; // 0x298
	float InterpPosition; // 0x29c
	char ReplicationForceIsPlaying; // 0x2a4
	FMulticastInlineDelegate OnPlay; // 0x2a8
	FMulticastInlineDelegate OnStop; // 0x2b8
	FMulticastInlineDelegate OnPause; // 0x2c8
};

struct UVomitStateComponent {
	FTagStateBool _isCharging; // 0xc0
};

struct UDecisiveStrike {
	float _timeAfterUnhook[0x3]; // 0x3d0
	float _skillCheckDelay; // 0x3dc
	float _skillCheckBuffer; // 0x3e0
	bool _killerHearsSkillCheckCue; // 0x3e4
	TArray<FGameplayTag> _deactivationEvents; // 0x458
	bool _hasBeenAttempted; // 0x468
};

struct UGunslingerEffectsComponent {
	FMulticastInlineDelegate OnIsAimingChanged; // 0xb8
	FMulticastInlineDelegate PlayOutOfAmmoSound; // 0xc8
	float _minimumTimeBetweenBroadcast; // 0xd8
	AHarpoonRifle* _rifle; // 0xe0
};

struct URiflePlayerLinker {
	FMulticastInlineDelegate OnLinkedPlayerSet; // 0xb8
	ADBDPlayer* _linkedPlayer; // 0xc8
	ADBDPlayer* _linkedPlayerDuringAttack; // 0xd0
	ADBDPlayer* _linkOwner; // 0xd8
	float _desiredLinkLength; // 0xe0
	FDBDTunableRowHandle _elasticLength; // 0x120
	FDBDTunableRowHandle _minimumLinkLength; // 0x148
	FDBDTunableRowHandle _breakFreeCloseRangeMaxDistance; // 0x170
	float _movementLinkReductionThreshold; // 0x19c
	float _movementAccelerationTreshold; // 0x1a0
};

struct UAISense_Trail {
	TArray<FAITrailEvent> Events; // 0x90
};

struct UGenyReflectionCaptureComponent {
	TArray<FReflectionCaptureTwoStates> generatorDrivenReflectionCapture; // 0x210
};

struct UDistributionVectorConstantCurve {
	FInterpCurveVector ConstantCurve; // 0x40
	char bLockAxes : 1; // 0x58
	EDistributionVectorLockFlags LockedAxes; // 0x5c
};

struct AReverseBearTrap {
	USkeletalMeshComponent* _rbtMesh; // 0x330
	UAnimationMontageSlave* _animMontageSlave; // 0x338
	int32_t _keyID; // 0x344
	bool _exitGatesPoweredAfterAttachment; // 0x3d8
	bool _generatorFixedAfterAttachment; // 0x3d9
};

struct UMaterialExpressionSign {
	FExpressionInput Input; // 0x48
};

struct UGeometryCacheTrack_FlipbookAnimation {
	uint32_t NumMeshSamples; // 0x60
};

struct UMaterialExpressionConstant3Vector {
	FLinearColor Constant; // 0x48
};

struct UUserWidget {
	FLinearColor ColorAndOpacity; // 0x130
	FDelegate ColorAndOpacityDelegate; // 0x140
	FSlateColor ForegroundColor; // 0x158
	FDelegate ForegroundColorDelegate; // 0x180
	FMargin Padding; // 0x194
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a8
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	char bCookedWidgetTree : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct UCoreTutorialObjectivesContainer {
	UCoreTutorialObjectiveItem* CoreTutorialObjectiveItemClass; // 0x2f8
	int32_t BasePooledInstanceAmount; // 0x300
	UGridPanel* ObjectiveContainer; // 0x308
	TArray<UCoreTutorialObjectiveItem*> _objectivePool; // 0x310
	TMap<FName, UCoreTutorialObjectiveItem*> _objectiveItems; // 0x320
};

struct UMovieSceneEventRepeaterSection {
	FMovieSceneEvent Event; // 0xe8
};

struct UCharacterCollection {
	ASlasherPlayer* _killer; // 0x148
	TSet<ACamperPlayer*> _survivors; // 0x150
	TSet<ADBDPlayer*> _mainDBDPlayers; // 0x1a0
	TSet<ADBDPlayer*> _otherCharacters; // 0x1f0
	TSet<ACharacter*> _nonPlayableCharacters; // 0x240
	TSet<ACharacter*> _allCharacters; // 0x290
};

struct USynthSamplePlayer {
	USoundWave* SoundWave; // 0x6f0
	FMulticastInlineDelegate OnSampleLoaded; // 0x6f8
	FMulticastInlineDelegate OnSamplePlaybackProgress; // 0x708
};

struct UMaterialExpressionDynamicParameter {
	TArray<FString> ParamNames; // 0x48
	FLinearColor defaultValue; // 0x58
	uint32_t ParameterIndex; // 0x68
};

struct UHISMMaterialHelperSettings {
	TMap<UStaticMesh*, TSoftClassPtr<UObject>> _meshMaterialOverride; // 0x38
};

struct AVectorFieldVolume {
	UVectorFieldComponent* VectorFieldComponent; // 0x230
};

struct UAISense_Blueprint {
	UUserDefinedStruct* ListenerDataType; // 0x90
	TArray<UAIPerceptionComponent*> ListenerContainer; // 0x98
	TArray<UAISenseEvent*> UnprocessedEvents; // 0xa8
};

struct UBTTask_CopyBBEntry {
	FBlackboardKeySelector BBFrom; // 0x78
	FBlackboardKeySelector BBTo; // 0xa8
	bool CopyOnlyValidKeyValue; // 0xd8
};

struct UUniformGridSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x40
	EVerticalAlignment VerticalAlignment; // 0x41
	int32_t row; // 0x44
	int32_t Column; // 0x48
};

struct USubtitlesPresenter {
	UUserWidget* SubtitlesWidgetClass; // 0xe0
};

struct UAssetLibraryManager {
	UObject* _worldContextObject; // 0x40
	TMap<int32_t, UCharacterItemsAssetLibrary*> _characterItemsAssetLibrary; // 0x48
	UIniAssetLibrary* _globalAssetLibrary; // 0x98
	UMenuAssetLibrary* _menuAssetLibrary; // 0xa0
	UGameAssetLibrary* _gameAssetLibrary; // 0xa8
	UTutorialAssetLibrary* _tutorialAssetLibrary; // 0xb0
	Ushopmanager* _shopManager; // 0xc0
	TArray<FAssetLibraryLoader> _loadingList; // 0xd8
	int32_t CharacterItemsAssetLoadCountPerChunk; // 0xe8
	int32_t BlindPackAssetLoadCountPerChunk; // 0xec
	int32_t MenuAssetLoadCountPerChunk; // 0xf0
	int32_t GlobalAssetLoadCountPerChunk; // 0xf4
	int32_t GameAssetLoadCountPerChunk; // 0xf8
};

struct UUMGPurchaseItemsInfo {
	UImage* Icon; // 0x300
	UTextBlock* Quantity; // 0x308
	UTextBlock* ItemName; // 0x310
};

struct UNiagaraRibbonRendererProperties {
	UMaterialInterface* Material; // 0x58
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x60
	ENiagaraRibbonFacingMode FacingMode; // 0x90
	float UV0TilingDistance; // 0x94
	FVector2D UV0Scale; // 0x98
	FVector2D UV0Offset; // 0xa0
	ENiagaraRibbonAgeOffsetMode UV0AgeOffsetMode; // 0xa8
	float UV1TilingDistance; // 0xac
	FVector2D UV1Scale; // 0xb0
	FVector2D UV1Offset; // 0xb8
	ENiagaraRibbonAgeOffsetMode UV1AgeOffsetMode; // 0xc0
	ENiagaraRibbonDrawDirection DrawDirection; // 0xc1
	float CurveTension; // 0xc4
	ENiagaraRibbonTessellationMode TessellationMode; // 0xc8
	int32_t TessellationFactor; // 0xcc
	bool bUseConstantFactor; // 0xd0
	float TessellationAngle; // 0xd4
	bool bScreenSpaceTessellation; // 0xd8
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe0
	FNiagaraVariableAttributeBinding ColorBinding; // 0x170
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x200
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x290
	FNiagaraVariableAttributeBinding RibbonTwistBinding; // 0x320
	FNiagaraVariableAttributeBinding RibbonWidthBinding; // 0x3b0
	FNiagaraVariableAttributeBinding RibbonFacingBinding; // 0x440
	FNiagaraVariableAttributeBinding RibbonIdBinding; // 0x4d0
	FNiagaraVariableAttributeBinding RibbonLinkOrderBinding; // 0x560
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x5f0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x680
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x710
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x7a0
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x830
};

struct ATemplateSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x238
	UTemplateSequencePlayer* SequencePlayer; // 0x250
	FSoftObjectPath TemplateSequence; // 0x258
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x278
};

struct UArchiveStoriesContainer {
	URewardTrackContainer* _rewardTrackContainer; // 0x1b0
	UWalletHandler* _wallet; // 0x280
	UArchiveVignettesContainer* _vignettesContainer; // 0x288
};

struct URedStainComponent {
	FLinearColor _initialSpotLightColor; // 0x3d0
};

struct UMaterialParameterCollectionInstance {
	UMaterialParameterCollection* Collection; // 0x38
};

struct UTargetWasTargetedByEventRecentlyEvaluator {
	TArray<FGameplayTag> _gameEventsToTriggerFirst; // 0xe8
};

struct UGameInstance {
	TArray<ULocalPlayer*> LocalPlayers; // 0x40
	UOnlineSession* OnlineSession; // 0x50
	TArray<UObject*> ReferencedObjects; // 0x58
};

struct UBTDecorator_IsAtLocation {
	float AcceptableRadius; // 0xa0
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0xa8
	FAIDistanceType GeometricDistanceType; // 0xe8
	char bUseParametrizedRadius : 1; // 0xec
	char bUseNavAgentGoalLocation : 1; // 0xec
	char bPathFindingBasedTest : 1; // 0xec
};

struct ANavModifierVolume {
	UNavArea* AreaClass; // 0x270
};

struct ULightIntensityTimelineComponent {
	TArray<FLightUpdate> lights; // 0xb8
	TArray<FLightMaterialUpdate> materialHelpers; // 0xc8
	UCurveFloat* intensityCurve; // 0xd8
	bool randomizeStart; // 0xe0
	bool randomizeLength; // 0xe1
	float minLength; // 0xe4
	float maxLength; // 0xe8
	bool normalizeCurve; // 0xec
	bool startTicking; // 0xed
	ELightUnits inputLightUnit; // 0xee
	FMulticastInlineDelegate OnTimelineFinished; // 0xf0
};

struct UGameplayTagsManager {
	TArray<FGameplayTagSource> TagSources; // 0xc8
	TArray<UDataTable*> GameplayTagTables; // 0x1b8
};

struct UInteractiveGizmo {
	UInputBehaviorSet* InputBehaviors; // 0x38
};

struct URuntimeVirtualTextureComponent {
	URuntimeVirtualTexture* VirtualTexture; // 0x210
	bool bUseStreamingLowMipsInEditor; // 0x218
	AActor* BoundsSourceActor; // 0x220
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter {
	FName ParameterName; // 0xb0
	FGuid ExpressionGUID; // 0xbc
	FName Group; // 0xcc
};

struct UGizmoArrowComponent {
	FVector Direction; // 0x448
	float Gap; // 0x454
	float Length; // 0x458
	float Thickness; // 0x45c
};

struct UPrimitivesRegistererComponent {
	TArray<UPrimitiveComponent*> _primitives; // 0xb8
	TWeakObjectPtr<UPrimitiveCollection> _primitiveCollection; // 0xc8
};

struct UUMGAtlantaCustomMatchLobbyScreen {
	UUMGBaseButtonWidget* EditButton; // 0x300
	UVerticalBox* RulesBox; // 0x308
	UTextBlock* CustomMatchTitle; // 0x310
	UTextBlock* MatchRulesTitle; // 0x318
};

struct UMovieSceneBoolSection {
	bool defaultValue; // 0xe8
	FMovieSceneBoolChannel BoolCurve; // 0xf0
};

struct UGeometryCacheCodecRaw {
	int32_t DummyProperty; // 0x40
};

struct UStalkedComponent {
	FMulticastInlineDelegate OnBeingStalkedChanged; // 0xb8
	float _maxStalkPoints; // 0xc8
	bool _stalkableWhileSightingStalker; // 0xcc
	bool _isBeingStalked; // 0xcd
	UChargeableComponent* _stalkPointsChargeable; // 0xd0
};

struct ADBDGame_Menu {
	bool StartWithSlasher; // 0x358
	UAtlantaPartyFlowHandler* _partyFlowHandler; // 0x360
	AMatineeActor* _matineeFadeActor; // 0x370
	AMatineeActor* _matineeIntroActor; // 0x378
	AMatineeActor* _matineeLoopActor; // 0x380
};

struct UUMGDownloadProgressionWidget {
	UProgressBar* ProgressBar; // 0x300
	UTextBlock* DownloadPercentage; // 0x308
	UTextBlock* DownloadDescription; // 0x310
};

struct UBlendSpace {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x150
};

struct UTargetWasDamagedBySpecialAttackRecentlyEvaluator {
	float _timeLimit; // 0x130
	TArray<FGameplayTag> _specialCaseGameEvents; // 0x138
};

struct UDatasmithGLTFSceneImportData {
	FString Generator; // 0x30
	float Version; // 0x40
	FString Author; // 0x48
	FString License; // 0x58
	FString source; // 0x68
};

struct UTestMovieSceneSequence {
	UMovieScene* MovieScene; // 0x350
};

struct UEnvQueryTest_LineOfSight {
	UEnvQueryContext* QuerierContext; // 0x238
	UEnvQueryContext* ToContext; // 0x240
	FAIDataProviderFloatValue ItemHeightOffset; // 0x248
	FAIDataProviderBoolValue Invert; // 0x288
};

struct UMaterialInstance {
	UPhysicalMaterial* PhysMaterial; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	UMaterialInterface* Parent; // 0xd8
	char bHasStaticPermutationResource : 1; // 0xe0
	char bOverrideSubsurfaceProfile : 1; // 0xe0
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xe8
	TArray<FVectorParameterValue> VectorParameterValues; // 0xf8
	TArray<FTextureParameterValue> TextureParameterValues; // 0x108
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x118
	TArray<FFontParameterValue> FontParameterValues; // 0x128
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x138
	FStaticParameterSet StaticParameters; // 0x150
	FMaterialCachedParameters CachedLayerParameters; // 0x190
	TArray<UObject*> CachedReferencedTextures; // 0x330
};

struct UInterpTrackInstSlomo {
	float OldTimeDilation; // 0x30
};

struct ADBDBaseMatchGameMode {
	UEndGameComponent* _endGameComponent; // 0x358
	UEscapeRequirementTracker* _escapeRequirementTracker; // 0x360
	ANetworkFenceActor* _theFence; // 0x368
};

struct UForceFeedbackAttenuation {
	FForceFeedbackAttenuationSettings Attenuation; // 0x30
};

struct UBTService_SetPathSpeedFactor {
	float SpeedFactor; // 0x78
};

struct UAddon_K22Power_20 {
	float _undetectableDuration; // 0x2a8
};

struct UAddon_K24_04 {
	float _effectTime; // 0x2a8
	FLinearColor OutlineColor; // 0x2ac
};

struct UUMGControlTypeSelectionWidget {
	UUMGControlTypeWidget* SnapOnJoystick; // 0x300
	UUMGControlTypeWidget* CameraFullScreen; // 0x308
	UTextBlock* TitleText; // 0x310
};

struct UBTDecorator_ExtConeCheck {
	FBlackboardKeySelector BBConeOrigin; // 0x70
	FBlackboardKeySelector BBConeDirection; // 0xa0
	FBlackboardKeySelector BBWith; // 0xd0
	FAITunableParameter ConeHalfAngle; // 0x100
};

struct ATimerGate {
	float _currentTime; // 0x248
};

struct UCounterforce {
	float _totemAuraVisibleDuration[0x3]; // 0x3d4
	float _startingTotemCleanseSpeedBonus[0x3]; // 0x3e0
	float _stackableTotemCleanseSpeedBonus[0x3]; // 0x3ec
};

struct USlateWidgetStyleAsset {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x30
};

struct URespawnablePositioner {
	FMulticastInlineDelegate OnIsInteractingWithAnyRespawnableInteractableChangedEvent; // 0xb8
	TArray<ARespawnableInteractable*> _respawnableInteractables; // 0xc8
};

struct UInterpTrackFloatAnimBPParam {
	UObject* AnimBlueprintClass; // 0x98
	UAnimInstance* AnimClass; // 0xa0
	FName ParamName; // 0xa8
};

struct UBTService_GetPinLocation {
	FBlackboardKeySelector BBToSetKey; // 0x80
	FGameplayTag PinTag; // 0xb0
};

struct UUMGRewardWidget {
	UImage* CheckIcon; // 0x300
};

struct URepairGeneratorSurvivorSubAnimInstance {
	FVector _snapPosition; // 0x538
	int32_t _side; // 0x544
	int32_t _repairAnimIndex; // 0x548
	bool _isRepairingGenerator; // 0x558
	bool _rightFootDown; // 0x559
	int32_t _animSequenceVariationCount; // 0x55c
	bool _isVomiting; // 0x560
	bool _hasSkillCheckFailed; // 0x561
};

struct ULuminRuntimeSettings {
	FString PackageName; // 0x30
	FString ApplicationDisplayName; // 0x40
	ELuminFrameTimingHint FrameTimingHint; // 0x50
	bool bProtectedContent; // 0x51
	bool bManualCallToAppReady; // 0x52
	bool bUseMobileRendering; // 0x53
	bool bUseVulkan; // 0x54
	FFilePath Certificate; // 0x58
	FDirectoryPath IconModelPath; // 0x68
	FDirectoryPath IconPortalPath; // 0x78
	FLocalizedIconInfos LocalizedIconInfos; // 0x88
	int32_t VersionCode; // 0x98
	int32_t MinimumAPILevel; // 0x9c
	TArray<ELuminPrivilege> AppPrivileges; // 0xa0
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xb0
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xc0
	FString SpatializationPlugin; // 0xd0
	FString ReverbPlugin; // 0xe0
	FString OcclusionPlugin; // 0xf0
	int32_t SoundCueCookQualityIndex; // 0x100
	bool bRemoveDebugInfo; // 0x104
	FDirectoryPath VulkanValidationLayerLibs; // 0x108
	bool bFrameVignette; // 0x118
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x120
};

struct USceneCaptureComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x210
	ESceneCaptureSource CaptureSource; // 0x211
	char bCaptureEveryFrame : 1; // 0x212
	char bCaptureOnMovement : 1; // 0x212
	bool bAlwaysPersistRenderingState; // 0x213
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x218
	TArray<AActor*> HiddenActors; // 0x228
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x238
	TArray<AActor*> ShowOnlyActors; // 0x248
	float LODDistanceFactor; // 0x258
	float MaxViewDistanceOverride; // 0x25c
	int32_t CaptureSortPriority; // 0x260
	bool bUseRayTracingIfEnabled; // 0x264
	bool bIgnoreCullDistanceVolumes; // 0x265
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x268
	FString ProfilingEventName; // 0x288
};

struct UMaterialExpressionMax {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
	float ConstA; // 0x80
	float ConstB; // 0x84
};

struct UARSaveWorldAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x58
	FMulticastInlineDelegate OnFailed; // 0x68
};

struct USplineComponent {
	FSplineCurves SplineCurves; // 0x428
	FInterpCurveVector SplineInfo; // 0x490
	FInterpCurveQuat SplineRotInfo; // 0x4a8
	FInterpCurveVector SplineScaleInfo; // 0x4c0
	FInterpCurveFloat SplineReparamTable; // 0x4d8
	bool bAllowSplineEditingPerInstance; // 0x4f0
	int32_t ReparamStepsPerSegment; // 0x4f4
	float Duration; // 0x4f8
	bool bStationaryEndpoints; // 0x4fc
	bool bSplineHasBeenEdited; // 0x4fd
	bool bModifiedByConstructionScript; // 0x4fe
	bool bInputSplinePointsToConstructionScript; // 0x4ff
	bool bDrawDebug; // 0x500
	bool bClosedLoop; // 0x501
	bool bLoopPositionOverride; // 0x502
	float LoopPosition; // 0x504
	FVector DefaultUpVector; // 0x508
};

struct USlateVectorArtData {
	TArray<FSlateMeshVertex> VertexData; // 0x30
	TArray<uint32_t> IndexData; // 0x40
	UMaterialInterface* Material; // 0x50
	FVector2D ExtentMin; // 0x58
	FVector2D ExtentMax; // 0x60
};

struct UCanvas {
	float OrgX; // 0x30
	float OrgY; // 0x34
	float ClipX; // 0x38
	float ClipY; // 0x3c
	FColor DrawColor; // 0x40
	char bCenterX : 1; // 0x44
	char bCenterY : 1; // 0x44
	char bNoSmooth : 1; // 0x44
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	FPlane ColorModulate; // 0x50
	UTexture2D* DefaultTexture; // 0x60
	UTexture2D* GradientTexture0; // 0x68
	UReporterGraph* ReporterGraph; // 0x70
};

struct APartyBeaconHost {
	UPartyBeaconState* State; // 0x258
	bool bLogoutOnSessionTimeout; // 0x2c0
	float SessionTimeoutSecs; // 0x2c4
	float TravelSessionTimeoutSecs; // 0x2c8
};

struct UAISenseConfig_Hearing {
	UAISense_Hearing* Implementation; // 0x50
	float HearingRange; // 0x58
	float LoSHearingRange; // 0x5c
	char bUseLoSHearing : 1; // 0x60
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x64
};

struct UMovieSceneVectorSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe8
	int32_t ChannelsUsed; // 0x368
};

struct UAnimNotify_PostInteractionSoundEvent {
	UAkAudioEvent* SoundEvent; // 0x40
	TSoftClassPtr<UObject> InteractionAudioClass; // 0x48
};

struct UPhysicsConstraintComponent {
	AActor* ConstraintActor1; // 0x210
	FConstrainComponentPropName ComponentName1; // 0x218
	AActor* ConstraintActor2; // 0x228
	FConstrainComponentPropName ComponentName2; // 0x230
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x250
	FMulticastInlineDelegate OnConstraintBroken; // 0x258
	FConstraintInstance ConstraintInstance; // 0x268
};

struct UMultiTransformer {
	UTransformGizmo* TransformGizmo; // 0xe0
	UTransformProxy* TransformProxy; // 0xe8
};

struct ASpectatorBeaconHost {
	USpectatorBeaconState* State; // 0x258
	bool bLogoutOnSessionTimeout; // 0x2c0
	float SessionTimeoutSecs; // 0x2c4
	float TravelSessionTimeoutSecs; // 0x2c8
};

struct UAsyncTask_LoadXRDeviceVisComponent {
	FMulticastInlineDelegate OnModelLoaded; // 0x38
	FMulticastInlineDelegate OnLoadFailure; // 0x48
	UPrimitiveComponent* SpawnedComponent; // 0x60
};

struct UHudScreenUMG {
	UUmgPlayerHud* _atlantaHud; // 0x248
	USafeZoneManagerWidget* _safeZoneManager; // 0x250
	TArray<UNoiseIndicatorWidget*> _closeNoiseIndicatorWidgets; // 0x258
	TArray<UExitOpenedIndicatorWidget*> _exitOpenedIndicatorWidgets; // 0x268
	TArray<UGeneratorIndicatorWidget*> _generatorIndicatorWidgets; // 0x278
	TArray<UNoiseIndicatorWidget*> _hatchIndicatorWidgets; // 0x288
	TArray<UHookedIndicatorWidget*> _hookedIndicatorWidgets; // 0x298
	TArray<UKillerNoiseIndicatorWidget*> _killerCuesIndicatorWidgets; // 0x2a8
	TMap<FString, UNoiseIndicatorWidget*> _loudNoiseIndicatorWidgets; // 0x2b8
	UBaseIndicatorWidget* _globalSoundIndicatorWidget; // 0x308
	TMap<FString, UNoiseIndicatorWidget*> _offscreenNoiseIndicatorWidgets; // 0x310
	TMap<int32_t, UBaseIndicatorWidget*> _noiseIndicatorMap; // 0x360
	UPromptManager* _promptManager; // 0x3b0
	UAtlantaTutorialObjectiveManager* _objectiveManager; // 0x3b8
	TSoftClassPtr<UObject> AtlantaObjectiveClass; // 0x3c0
};

struct UWallGrabInteractionDefinition {
	UBlightPowerStateComponent* _blightPowerStateComponent; // 0x5b0
	FDBDTunableRowHandle _wallDashAccelerationMultiplier; // 0x5b8
	ABlightPowerEstimatedCollisionIndicator* _blightPowerCollisionIndicator; // 0x5e0
	ABlightPowerEstimatedCollisionIndicator* _collisionIndicatorActorClass; // 0x5e8
};

struct UChildActorComponent {
	AActor* ChildActorClass; // 0x210
	AActor* ChildActor; // 0x218
	AActor* ChildActorTemplate; // 0x220
	bool bAlwaysRecreateOnRegister; // 0x228
	AActor* ChildActorMimic; // 0x230
};

struct UDBDPawnSensingComponent {
	bool bSenseEverywhere; // 0x100
	float PartiallyHiddenSensingDistance; // 0x104
};

struct UAISkill_FindInteractable {
	FString RequiredInteractionId; // 0x100
	EInputInteractionType RequiredInteractionInputType; // 0x110
};

struct UMaterialExpressionDistanceFieldGradient {
	FExpressionInput Position; // 0x48
};

struct UTestAnyActorPairQueryRangeIsTrue {
	UActorPairQueryEvaluatorComponent* _actorPairQueryEvaluatorComponent; // 0x100
};

struct UAICharacterHideInLockerBehaviourData {
	ECharacterMovementTypes characterMovementType; // 0x38
};

struct UTrailPointOutlineUpdateStrategy {
	FDBDTunableRowHandle _tormentTrailRevealDistance; // 0x130
};

struct UAnimNotifyState_TimedNiagaraEffect {
	UNiagaraSystem* Template; // 0x38
	FName SocketName; // 0x40
	FVector LocationOffset; // 0x4c
	FRotator RotationOffset; // 0x58
	bool bDestroyAtEnd; // 0x64
};

struct UUserDefinedEnum {
	TMap<FName, FText> DisplayNameMap; // 0x68
};

struct UPlatformInterfaceWebResponse {
	FString OriginalURL; // 0x30
	int32_t ResponseCode; // 0x40
	int32_t Tag; // 0x44
	FString StringResponse; // 0x48
	TArray<char> BinaryResponse; // 0x58
};

struct UExamplePresenter {
	UUserWidget* ExampleWidgetClass; // 0x108
};

struct USkeletalBodySetup {
	bool bSkipScaleFromAnimation; // 0x268
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x270
};

struct UAtlantaTutorialObjectiveManager {
	TArray<UAtlantaObjectiveWidget*> _objectivesList; // 0x30
	UVerticalBox* _objectivesContainer; // 0x40
};

struct UMaterialExpressionLandscapeLayerBlend {
	TArray<FLayerBlendInput> Layers; // 0x48
	FGuid ExpressionGUID; // 0x58
};

struct USystemTimeTimecodeProvider {
	FFrameRate FrameRate; // 0x38
	bool bGenerateFullFrame; // 0x40
	bool bUseHighPerformanceClock; // 0x41
};

struct UBTDecorator_DoesPathExist {
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0xa0
	char bUseSelf : 1; // 0xd0
	EPathExistanceQueryType PathQueryType; // 0xd4
	UNavigationQueryFilter* FilterClass; // 0xd8
};

struct UMaterialExpressionSceneDepth {
	EMaterialSceneAttributeInputMode InputMode; // 0x48
	FExpressionInput Input; // 0x4c
	FExpressionInput Coordinates; // 0x68
	FVector2D ConstInput; // 0x84
};

struct UZombieAttractedByGeneratorBTService {
	float _genRepairingHearingRange; // 0xa0
};

struct UGeneratorRepairInteraction {
	FDBDTunableRowHandle _penaltyPerRepairPlayerCount[0x3]; // 0x6d8
};

struct UMeshAnalysisProperties {
	FString SurfaceArea; // 0x58
	FString Volume; // 0x68
};

struct UPointLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x3a8
	float LightFalloffExponent; // 0x3ac
	float SourceRadius; // 0x3b0
	float SoftSourceRadius; // 0x3b4
	float SourceLength; // 0x3b8
};

struct UTriggerTimerOnLacerationAlmostFullEffect {
	ULacerationComponent* _lacerationComponent; // 0x350
	float _duration; // 0x358
};

struct USkeletalMeshSocket {
	FName SocketName; // 0x30
	FName BoneName; // 0x3c
	FVector RelativeLocation; // 0x48
	FRotator RelativeRotation; // 0x54
	FVector RelativeScale; // 0x60
	bool bForceAlwaysAnimated; // 0x6c
};

struct ULiveLinkSourceSettings {
	ELiveLinkSourceMode Mode; // 0x30
	FLiveLinkSourceBufferManagementSettings BufferSettings; // 0x38
	FString ConnectionString; // 0x88
	ULiveLinkSourceFactory* Factory; // 0x98
};

struct UMaterialExpressionLandscapeLayerSample {
	FName ParameterName; // 0x48
	float PreviewWeight; // 0x54
	FGuid ExpressionGUID; // 0x58
};

struct UAISense_Sight {
	int32_t MaxTracesPerTick; // 0x158
	int32_t MinQueriesPerTimeSliceCheck; // 0x15c
	double MaxTimeSlicePerTick; // 0x160
	float HighImportanceQueryDistanceThreshold; // 0x168
	float MaxQueryImportance; // 0x170
	float SightLimitQueryImportance; // 0x174
};

struct UCurveFloat {
	FRichCurve FloatCurve; // 0x38
	bool bIsEventCurve; // 0xb8
};

struct UUMGSettingContextButton {
	FMulticastInlineDelegate OnSettingContextButtonClickEvent; // 0x300
};

struct UParticleModuleLocationDirect {
	FRawDistributionVector Location; // 0x38
	FRawDistributionVector LocationOffset; // 0x80
	FRawDistributionVector ScaleFactor; // 0xc8
	FRawDistributionVector Direction; // 0x110
};

struct UCoreHudObjectivesWidget {
	UDBDTextBlock* SpecialSpacer; // 0x300
};

struct UTextureRenderTarget {
	float TargetGamma; // 0xc0
};

struct ARadialForceActor {
	URadialForceComponent* ForceComponent; // 0x230
};

struct UInterpTrackInstFloatProp {
	float ResetFloat; // 0x60
};

struct UMovieSceneAkTrack {
	TArray<UMovieSceneSection*> Sections; // 0x60
	char bIsAMasterTrack : 1; // 0x70
};

struct UMaterialExpressionLinearInterpolate {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
	FExpressionInput alpha; // 0x80
	float ConstA; // 0x9c
	float ConstB; // 0xa0
	float ConstAlpha; // 0xa4
};

struct UPerkHudWidget {
	UCanvasPanel* PerksClickable; // 0x300
	UCanvasPanel* PerksExternal; // 0x308
	TSoftClassPtr<UObject> AtlantaPerkActionButtonClass; // 0x310
	TMap<FName, UPerkActionButton*> _clickablePerksMap; // 0x340
	TMap<FName, UPerkActionButton*> _externalPerksMap; // 0x390
};

struct UDisplayStandMeatHookRequesterComponent {
	AMenuMeatHook* _meatHookClass; // 0xb8
};

struct UGeneratorAnimInstance {
	AGenerator* _owningGenerator; // 0x280
	bool _rushFailed; // 0x288
	bool _isActivated; // 0x289
	float _percentComplete; // 0x28c
};

struct ALight {
	ULightComponent* LightComponent; // 0x230
	char bEnabled : 1; // 0x238
};

struct UDifferentSurvivorsNearMeQEEvaluator {
	TSet<ADBDPlayer*> _foundSurvivors; // 0x98
};

struct UFrenzyAttackSuccessSubstate {
	FDBDTunableRowHandle _healthyTime; // 0x118
	FDBDTunableRowHandle _injuredTime; // 0x140
	FDBDTunableRowHandle _bleedoutTime; // 0x168
	UCurveFloat* _healthyCurve; // 0x190
	UCurveFloat* _injuredCurve; // 0x198
	UCurveFloat* _bleedoutCurve; // 0x1a0
};

struct UBTService_RunEQS {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xa8
};

struct UPrimaryAssetLabel {
	FPrimaryAssetRules Rules; // 0x38
	char bLabelAssetsInMyDirectory : 1; // 0x44
	char bIsRuntimeLabel : 1; // 0x44
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x48
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x58
	FCollectionReference AssetCollection; // 0x68
};

struct UDataTable {
	UScriptStruct* RowStruct; // 0x30
	char bStripFromClientBuilds : 1; // 0x88
	char bIgnoreExtraFields : 1; // 0x88
	char bIgnoreMissingFields : 1; // 0x88
	FString ImportKeyField; // 0x90
};

struct UConsoleSettings {
	int32_t MaxScrollbackSize; // 0x30
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x38
	TArray<FString> AutoCompleteMapPaths; // 0x48
	float BackgroundOpacityPercentage; // 0x58
	bool bOrderTopToBottom; // 0x5c
	bool bDisplayHelpInAutoComplete; // 0x5d
	FColor InputColor; // 0x60
	FColor HistoryColor; // 0x64
	FColor AutoCompleteCommandColor; // 0x68
	FColor AutoCompleteCVarColor; // 0x6c
	FColor AutoCompleteFadedColor; // 0x70
};

struct UPointSetComponent {
	UMaterialInterface* PointMaterial; // 0x478
	FBoxSphereBounds Bounds; // 0x480
	bool bBoundsDirty; // 0x49c
};

struct UUMGDragWidget_HudEditor {
	UUserWidget* OnSelectionWidgetClass; // 0x2a0
	UUMGHudEditorDragConstraintWidget* DragLinkWidgetClass; // 0x2a8
	UCustomWidgetWrapper_HudEditor* _customWrapper; // 0x2b0
	UUserWidget* _selectionWidget; // 0x2b8
	UUMGHudEditorDragConstraintWidget* _dragLinkWidget; // 0x2c0
	UUMGDragWidget_HudEditor* _parentLinkWidget; // 0x2c8
	UUMGDragWidget_HudEditor* _childLinkWidget; // 0x2d0
};

struct UInterpTrackFloatBase {
	FInterpCurveFloat FloatTrack; // 0x78
	float CurveTension; // 0x90
};

struct UAmbisonicsEncodingSettings {
	int32_t AmbisonicsOrder; // 0x30
};

struct ULoadoutSlotFloatingWidget {
	UTextBlock* Message; // 0x338
};

struct UAISkill_InteractionTarget_Throw {
	EAIThrowPredictionModes ThrowPredictionMode; // 0x220
	int32_t MaxAddPitchAngle; // 0x224
	EAIThrowProjectileModes ThrowProjectileMode; // 0x228
	FAITunableParameter HoldInputTimeRandDeviation; // 0x22c
	FAITunableParameter PitchAngleRandDeviation; // 0x23c
};

struct USoundConcurrency {
	FSoundConcurrencySettings Concurrency; // 0x30
};

struct UAISkill_Interaction_RemoveTwin {
	FDBDTunableRowHandle _removeTwinMaxCharge; // 0x170
};

struct UCineCameraComponent {
	FCameraFilmbackSettings FilmbackSettings; // 0x7d0
	FCameraFilmbackSettings Filmback; // 0x7dc
	FCameraLensSettings LensSettings; // 0x7e8
	FCameraFocusSettings FocusSettings; // 0x800
	float CurrentFocalLength; // 0x860
	float CurrentAperture; // 0x864
	float CurrentFocusDistance; // 0x868
	TArray<FNamedFilmbackPreset> FilmbackPresets; // 0x878
	TArray<FNamedLensPreset> LensPresets; // 0x888
	FString DefaultFilmbackPresetName; // 0x898
	FString DefaultFilmbackPreset; // 0x8a8
	FString DefaultLensPresetName; // 0x8b8
	float DefaultLensFocalLength; // 0x8c8
	float DefaultLensFStop; // 0x8cc
};

struct UAnimationWidget {
	float _playRate; // 0x260
};

struct UUMGCharacterPageScrollWidget {
	TSoftClassPtr<UObject> _characterButtonWidgetClass; // 0x448
	TArray<FCharacterSlotData> _charactersData; // 0x478
	bool _isKiller; // 0x488
	FText _charactersTitleText; // 0x490
	FText _killersTitleText; // 0x4a8
	FText _survivorsTitleText; // 0x4c0
};

struct UCrowdManager {
	ANavigationData* MyNavData; // 0x30
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x38
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x48
	int32_t MaxAgents; // 0x58
	float MaxAgentRadius; // 0x5c
	int32_t MaxAvoidedAgents; // 0x60
	int32_t MaxAvoidedWalls; // 0x64
	float NavmeshCheckInterval; // 0x68
	float PathOptimizationInterval; // 0x6c
	float SeparationDirClamp; // 0x70
	float PathOffsetRadiusMultiplier; // 0x74
	char bResolveCollisions : 1; // 0x78
};

struct UWraithAnimInstance {
	bool _isRingingBell; // 0x5a8
	bool _isCloaking; // 0x5a9
	bool _isUncloaking; // 0x5aa
	FPerspectiveDependentAnimSequenceSelector _cloakingInSelector; // 0x5b0
	FPerspectiveDependentAnimSequenceSelector _cloakingSelector; // 0x5c8
	FPerspectiveDependentAnimSequenceSelector _cloakingOutSelector; // 0x5e0
	FPerspectiveDependentAnimSequenceSelector _uncloakingInSelector; // 0x5f8
	FPerspectiveDependentAnimSequenceSelector _uncloakingSelector; // 0x610
	FPerspectiveDependentAnimSequenceSelector _uncloakingOutSelector; // 0x628
	float _cloakingPlayRate; // 0x640
};

struct UAkInitBank {
	TArray<FString> AvailableAudioCultures; // 0x60
	FString DefaultLanguage; // 0x70
};

struct UMaterialExpressionFontSample {
	UFont* Font; // 0x48
	int32_t FontTexturePage; // 0x50
};

struct UBTDecorator_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UUMGTallyEmblemProgressionWidget {
	UImage* PositiveIcon; // 0x300
	UImage* NegativeIcon; // 0x308
	UTextBlock* PercentText; // 0x310
	UTextBlock* DescriptionText; // 0x318
	FSlateColor WarningPercentColor; // 0x320
	FSlateColor WarningDescriptionColor; // 0x348
};

struct UMaterialExpressionTextureProperty {
	FExpressionInput TextureObject; // 0x48
	EMaterialExposedTextureProperty Property; // 0x64
};

struct UUMGSettingControlsContextWidget {
	bool AimAssist; // 0x378
	int32_t HandSide; // 0x37c
	int32_t InteractionButton; // 0x380
	bool InvertY; // 0x384
	float KillerCameraSensitivity; // 0x388
	float SurvivorCameraSensitivity; // 0x38c
};

struct UMeshSocketPointsProvider {
	FComponentReference _meshReference; // 0x30
	UMeshComponent* _mesh; // 0x60
	TArray<FName> _sockets; // 0x68
};

struct USendToDeathBedInteraction {
	ADeathBedInteractable* _deathBed; // 0x6e0
};

struct UK26P02 {
	float _generatorRegressPercentage[0x3]; // 0x3d8
	float _screamRevealLocationDuration; // 0x3e4
};

struct USocialParty {
	APartyBeaconClient* ReservationBeaconClientClass; // 0x60
	ASpectatorBeaconClient* SpectatorBeaconClientClass; // 0x68
	FUniqueNetIdRepl OwningLocalUserId; // 0x80
	FUniqueNetIdRepl CurrentLeaderId; // 0xa8
	TMap<FUniqueNetIdRepl, UPartyMember*> PartyMembersById; // 0xd0
	bool bEnableAutomaticPartyRejoin; // 0x120
	APartyBeaconClient* ReservationBeaconClient; // 0x1a0
	ASpectatorBeaconClient* SpectatorBeaconClient; // 0x1b8
};

struct UGFxMoviePlayer {
	FString SwfAssetName; // 0x38
	UGFxObject* root; // 0x48
	char bDisplayWithHudOff : 1; // 0x50
	char bEnableGammaCorrection : 1; // 0x50
	char bAllowInput : 1; // 0x50
	char bAllowFocus : 1; // 0x50
	char bCloseOnLevelChange : 1; // 0x50
	char bOnlyOwnerFocusable : 1; // 0x50
	char bDiscardNonOwnerInput : 1; // 0x50
	char bCaptureKeyboardInput : 1; // 0x50
	char bCaptureMouseInput : 1; // 0x51
	char bCaptureGamepadInput : 1; // 0x51
	char bCaptureTouchInput : 1; // 0x51
	char bIsSplitscreenLayoutModified : 1; // 0x51
	char bShowDefaultMouseCursor : 1; // 0x51
	char bBlurLesserMovies : 1; // 0x51
	char bHideLesserMovies : 1; // 0x51
	char bIsPriorityBlurred : 1; // 0x51
	char bIsPriorityHidden : 1; // 0x52
	char bIgnoreVisibilityEffect : 1; // 0x52
	char bIgnoreBlurEffect : 1; // 0x52
	char bRefreshed : 1; // 0x52
	char bPerformHitTest : 1; // 0x52
	GFxHitTestType HitTestType; // 0x54
	UTextureRenderTarget2D* RenderTexture; // 0x58
	UObject* ExternalInterface; // 0x60
	TArray<FKey> CaptureKeys; // 0x68
	TArray<FKey> FocusIgnoreKeys; // 0x78
	TArray<FExternalTexture> ExternalTextures; // 0x88
	EGFxRenderTextureMode RenderTextureMode; // 0x98
	char Priority; // 0x99
	TArray<FGFxWidgetBinding> WidgetBindings; // 0xa0
	int32_t SplitscreenLayoutYAdjust; // 0xb0
	FMulticastInlineDelegate OnFsCommand; // 0xb8
	FMulticastInlineDelegate OnStartCommand; // 0xc8
	FMulticastInlineDelegate OnCloseCommand; // 0xd8
	FMulticastInlineDelegate OnTickCommand; // 0xe8
	FMulticastInlineDelegate OnFocusGainedCommand; // 0xf8
	FMulticastInlineDelegate OnFocusLostCommand; // 0x108
	TArray<UGFxObject*> CachedMovieClipsArray; // 0x1d0
};

struct UMaterialExpressionFrac {
	FExpressionInput Input; // 0x48
};

struct UNavigationSystemConfig {
	FSoftClassPath NavigationSystemClass; // 0x30
	FNavAgentSelector SupportedAgentsMask; // 0x50
	FName DefaultAgentName; // 0x54
	char bIsOverriden : 1; // 0x60
};

struct UGameEventTracker {
	FMulticastInlineDelegate OnGameplayEvent; // 0x30
	FMulticastInlineDelegate OnGameflowEvent; // 0x40
};

struct USubmixEffectDynamicsProcessorPreset {
	FSubmixEffectDynamicsProcessorSettings Settings; // 0xc0
};

struct UWidgetTree {
	UWidget* RootWidget; // 0x30
};

struct UAnimClassData {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x38
	USkeleton* TargetSkeleton; // 0x48
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x50
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x60
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xb0
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xc0
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xd0
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xf0
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x110
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x130
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x150
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x170
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x190
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1b0
	TArray<FName> SyncGroupNames; // 0x200
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x210
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x220
};

struct UDestroySessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UUMGBaseFriendListContextualMenuWidget {
	UUMGFriendButtonWidget* InviteToPartyButton; // 0x318
	UUMGFriendButtonWidget* MuteButton; // 0x320
	UUMGFriendButtonWidget* UnmuteButton; // 0x328
	UUMGFriendButtonWidget* RemoveFriendButton; // 0x330
	UUMGFriendButtonWidget* RemovePlayerFromPartyButton; // 0x338
	UAkAudioEvent* TransitionOutAnimationSound; // 0x350
};

struct UEdgeObjectHandlingStrategy {
	TArray<UActorSpawner*> _edgeObjectSpawners; // 0x30
	TArray<UActorSpawner*> _edgeObjectBlockers; // 0x40
};

struct USocialGroupChannel {
	USocialUser* SocialUser; // 0x30
	FUniqueNetIdRepl GroupId; // 0x38
	FText DisplayName; // 0x60
	TArray<USocialUser*> Members; // 0x78
};

struct UGameUserSettings {
	bool bUseVSync; // 0x30
	bool bUseDynamicResolution; // 0x31
	uint32_t ResolutionSizeX; // 0x88
	uint32_t ResolutionSizeY; // 0x8c
	uint32_t LastUserConfirmedResolutionSizeX; // 0x90
	uint32_t LastUserConfirmedResolutionSizeY; // 0x94
	int32_t WindowPosX; // 0x98
	int32_t WindowPosY; // 0x9c
	int32_t FullscreenMode; // 0xa0
	int32_t LastConfirmedFullscreenMode; // 0xa4
	int32_t PreferredFullscreenMode; // 0xa8
	uint32_t Version; // 0xac
	int32_t AudioQualityLevel; // 0xb0
	int32_t LastConfirmedAudioQualityLevel; // 0xb4
	float FrameRateLimit; // 0xb8
	int32_t DesiredScreenWidth; // 0xc0
	bool bUseDesiredScreenHeight; // 0xc4
	int32_t DesiredScreenHeight; // 0xc8
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xcc
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xd0
	float LastRecommendedScreenWidth; // 0xd4
	float LastRecommendedScreenHeight; // 0xd8
	float LastCPUBenchmarkResult; // 0xdc
	float LastGPUBenchmarkResult; // 0xe0
	TArray<float> LastCPUBenchmarkSteps; // 0xe8
	TArray<float> LastGPUBenchmarkSteps; // 0xf8
	float LastGPUBenchmarkMultiplier; // 0x108
	bool bUseHDRDisplayOutput; // 0x10c
	int32_t HDRDisplayOutputNits; // 0x110
	FMulticastInlineDelegate OnGameUserSettingsUINeedsUpdate; // 0x118
};

struct UMaterialExpressionScalarParameter {
	float defaultValue; // 0x68
	bool bUseCustomPrimitiveData; // 0x6c
	char PrimitiveDataIndex; // 0x6d
};

struct UAddPatchToolProperties {
	float Width; // 0x58
	float Rotation; // 0x5c
	int32_t Subdivisions; // 0x60
	float Shift; // 0x64
};

struct UGeometryCache : UObject {
	TArray<UMaterialInterface*> Materials; // 0x38
	TArray<UGeometryCacheTrack*> Tracks; // 0x48
	int32_t StartFrame; // 0x68
	int32_t EndFrame; // 0x6c
};

struct UPropertyValue {
	TArray<TFieldPath<FProperty>> Properties; // 0x90
	TArray<int32_t> PropertyIndices; // 0xa0
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xb0
	FString FullDisplayString; // 0xc0
	FName PropertySetterName; // 0xd0
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xe0
	bool bHasRecordedData; // 0x130
	UObject* LeafPropertyClass; // 0x138
	TArray<char> ValueBytes; // 0x148
	EPropertyValueCategory PropCategory; // 0x158
};

struct UMeshInspectorTool {
	UMeshInspectorProperties* Settings; // 0x90
	UExistingMeshMaterialProperties* MaterialSettings; // 0x98
	UPreviewMesh* PreviewMesh; // 0xa8
	UMaterialInterface* DefaultMaterial; // 0xb0
};

struct AStaticMeshActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x230
	bool bStaticMeshReplicateMovement; // 0x238
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x239
};

struct UActivateOnEventTimedStatusEffect {
	FGameplayTagContainer _eventsToActivateOn; // 0x350
};

struct UChainsawRevInteraction {
	FName _soundCueDistanceDataID; // 0x708
	UAkAudioEvent* _chainsawRevStartAkAudioEvent; // 0x718
	UAkAudioEvent* _chainsawRevEndAkAudioEvent; // 0x720
	ASlasherPlayer* _owningSlasher; // 0x728
};

struct AMobileTormentTrailRenderer {
	UInstancedStaticMeshComponent* _pillarIsmComponent; // 0x230
	UInstancedStaticMeshComponent* _wireIsmComponent; // 0x238
	UInstancedStaticMeshComponent* _trailIsmComponent; // 0x240
	UInstancedStaticMeshComponent* _pillarOutlineIsmComponent; // 0x248
	UInstancedStaticMeshComponent* _wireOutlineIsmComponent; // 0x250
	TMap<ABaseTormentTrailPoint*, FTormentTrailPointInfo> _instanceMap; // 0x258
	UMaterialInstanceDynamic* _trailMaterialInstanceDynamic; // 0x2a8
};

struct UNiagaraDataInterfaceCurveBase {
	TArray<float> ShaderLUT; // 0x38
	float LUTMinTime; // 0x48
	float LUTMaxTime; // 0x4c
	float LUTInvTimeRange; // 0x50
	float LUTNumSamplesMinusOne; // 0x54
	char bUseLUT : 1; // 0x58
};

struct UDBDEmblem_SurvivorEvader {
	UCurveFloat* _killerDistanceStealthPointCurve; // 0x158
	UCurveFloat* _killerDistanceStealthPointCurveChasing; // 0x160
	UCurveFloat* _chaseDurationPointCurve; // 0x168
	UCurveFloat* _ZAxisDistanceScalingCurve; // 0x170
	UDBDRankDesignTunables* _rankTunablesClass; // 0x178
};

struct UBTService_RunSkills {
	FGameplayTag Context; // 0x78
	FBlackboardKeySelector BBFilterKey; // 0x88
	EBasicKeyOperation FilterOperation; // 0xb8
};

struct UBlightPowerStateComponent {
	FMulticastInlineDelegate OnPowerCollided; // 0xd0
	TArray<UBlightPowerState*> _blightPowerStateClasses; // 0xe0
	FDBDTunableRowHandle _canDashCheckCollisionRadius; // 0xf0
	FDBDTunableRowHandle _canDashCheckCollisionHeight; // 0x118
	FDBDTunableRowHandle _canDashCheckCollisionRange; // 0x140
	FDBDTunableRowHandle _blightLethalDashDodgeRadius; // 0x168
	UInteractionDefinition* _powerInteractionDefinition; // 0x190
	UTimerObject* _stateTimer; // 0x1b0
	TArray<UBlightPowerState*> _blightPowerStates; // 0x1b8
	UBlightPowerState* _currentBlightPowerState; // 0x1c8
	char _dashTokens; // 0x1d0
	FTunableStat _maximumDashTokens; // 0x1d8
	FTunableStat _tokenChargeRate; // 0x258
};

struct UForThePeople {
	float _brokenEffectDurations[0x3]; // 0x3dc
	FSecondaryInteractionProperties _secondaryActionProperties; // 0x3e8
};

struct UFlashbang {
	AGenerator* _generatorBeingRepaired; // 0x3d8
	float _generatorsRepairTargetProgression; // 0x3e0
	float _generatorRepairPercentToCraftFlashbang[0x3]; // 0x3e4
};

struct UARGetCandidateObjectAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x58
	FMulticastInlineDelegate OnFailed; // 0x68
};

struct UAIHealAllyBehaviourData {
	ACamperPlayer* _targetAlly; // 0x30
};

struct UBTTask_RunEQSQuery {
	UEnvQuery* QueryTemplate; // 0xa8
	TArray<FEnvNamedValue> QueryParams; // 0xb0
	TArray<FAIDynamicParam> QueryConfig; // 0xc0
	EEnvQueryRunMode RunMode; // 0xd0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xd8
	bool bUseBBKey; // 0x108
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x110
};

struct UPawnAction_Wait {
	float TimeToWait; // 0xa0
};

struct UUniformVector {
	float Magnitude; // 0xb8
	FVector Direction; // 0xbc
};

struct ULevelReadyToPlayPlayerComponent {
	TArray<FLevelReadyToPlayRequirements> _levelReadyToPlayRequirementsTarget; // 0xb8
};

struct UProjectileMovementComponent {
	float InitialSpeed; // 0xf8
	float MaxSpeed; // 0xfc
	char bRotationFollowsVelocity : 1; // 0x100
	char bRotationRemainsVertical : 1; // 0x100
	char bShouldBounce : 1; // 0x100
	char bInitialVelocityInLocalSpace : 1; // 0x100
	char bForceSubStepping : 1; // 0x100
	char bSimulationEnabled : 1; // 0x100
	char bSweepCollision : 1; // 0x100
	char bIsHomingProjectile : 1; // 0x100
	char bBounceAngleAffectsFriction : 1; // 0x101
	char bIsSliding : 1; // 0x101
	char bInterpMovement : 1; // 0x101
	char bInterpRotation : 1; // 0x101
	float PreviousHitTime; // 0x104
	FVector PreviousHitNormal; // 0x108
	float ProjectileGravityScale; // 0x114
	float Buoyancy; // 0x118
	float Bounciness; // 0x11c
	float Friction; // 0x120
	float BounceVelocityStopSimulatingThreshold; // 0x124
	float MinFrictionFraction; // 0x128
	FMulticastInlineDelegate OnProjectileBounce; // 0x130
	FMulticastInlineDelegate OnProjectileStop; // 0x140
	float HomingAccelerationMagnitude; // 0x150
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x154
	float MaxSimulationTimeStep; // 0x15c
	int32_t MaxSimulationIterations; // 0x160
	int32_t BounceAdditionalIterations; // 0x164
	float InterpLocationTime; // 0x168
	float InterpRotationTime; // 0x16c
	float InterpLocationMaxLagDistance; // 0x170
	float InterpLocationSnapToTargetDistance; // 0x174
};

struct UZombiesInterestEventManager {
	TArray<FGameplayTag> _zombieInterestEvents; // 0xd0
};

struct UK25SurvivorChainRotationStrategy {
	TWeakObjectPtr<ACamperPlayer> _cachedSurvivor; // 0xb8
	UK25SurvivorChainAttachmentComponent* _cachedChainAttachmentComponent; // 0xc0
};

struct ACharm {
	USkeletalMeshComponent* _skeletalMeshComponent; // 0x238
	AItemVfx* _actorVfx; // 0x240
};

struct UBTService_ClearBBEntry {
	FBlackboardKeySelector BBToResetKey; // 0x80
};

struct UHarpoonChainPositioner {
	AHarpoonProp* _harpoonPropClass; // 0xb8
	FName _survivorAttachSocket; // 0xc0
	FName _animationSocket; // 0xcc
	FDBDTunableRowHandle _reelBackToRifleSpeed; // 0xd8
	float _harpoonMinimumSnapBackDistance; // 0x100
	AHarpoonProp* _harpoonProp; // 0x108
	AHarpoonProjectile* _harpoonProjectile; // 0x110
	ADBDPlayer* _collector; // 0x118
	ARifleChain* _chain; // 0x128
};

struct UHexPerk {
	TArray<ADBDPlayer*> _playersWhoKnowCurse; // 0x428
};

struct UBlightedSerumDashInteraction {
	UBlightedSerumCooldownInteraction* _cooldownInteraction; // 0x5b0
	UBlightedSerumCollisionInteraction* _collisionInteraction; // 0x5b8
	UCurveFloat* _dashSpeedCurve; // 0x5c0
	UCurveFloat* _lookAngleToTurnRateCurveController; // 0x5c8
	UCurveFloat* _lookAngleToTurnRateCurveMouse; // 0x5d0
	float _dashDuration; // 0x5d8
	float _vectorInterpToSpeed; // 0x5dc
	float _wallDashAccelerationMultiplier; // 0x5e0
	float _cameraPitchRecenterTime; // 0x5e4
	float _lookAngleTurnRateModifier; // 0x5e8
	float _wallDashCollisionRadius; // 0x5ec
	float _wallDashCollisionHeight; // 0x5f0
	float _wallDashCollisionRange; // 0x5f4
};

struct USpinBoxWidgetStyle {
	FSpinBoxStyle SpinBoxStyle; // 0x38
};

struct UClickDragInputBehavior {
	bool bUpdateModifiersDuringDrag; // 0x120
};

struct UUMGSwitcherScreen {
	FMulticastInlineDelegate OnLoadoutWidgetSlotClicked; // 0x300
	FMulticastInlineDelegate OnLoadoutWidgetInventoryItemSelected; // 0x310
	FMulticastInlineDelegate OnLoadoutWidgetInventoryItemUnselected; // 0x320
	UWidgetSwitcher* ContainerWidgetSwitcher; // 0x390
	UUMGBloodStoreWidget* BloodStoreWidget; // 0x398
	UUMGLoadoutWidget* LoadoutWidget; // 0x3a0
	UUMGCharacterSelectionWidget* CharacterSelectionWidget; // 0x3a8
};

struct AEmitter {
	UParticleSystemComponent* ParticleSystemComponent; // 0x230
	char bDestroyOnSystemFinish : 1; // 0x238
	char bPostUpdateTickGroup : 1; // 0x238
	char bCurrentlyActive : 1; // 0x238
	FMulticastInlineDelegate OnParticleSpawn; // 0x240
	FMulticastInlineDelegate OnParticleBurst; // 0x250
	FMulticastInlineDelegate OnParticleDeath; // 0x260
	FMulticastInlineDelegate OnParticleCollide; // 0x270
};

struct AWindow {
	FNativeBlockIndicatorData NativeSmokeOtherIndicatorData; // 0x328
	FNativeBlockIndicatorData NativeEntityIndicatorData; // 0x340
	FNativeBlockIndicatorData NativeSmokeSelfIndicatorData; // 0x358
	bool _isBlockedByLevel; // 0x370
	UChildActorComponent* _entityAssets; // 0x378
	UMaterialHelper* _materialHelper; // 0x380
	UAkComponent* _akAudioWindow; // 0x388
	UAkAudioEvent* akAudioEventWindowsBlocStart; // 0x390
	UAkAudioEvent* akAudioEventWindowsBlocStop; // 0x398
	TMap<ACamperPlayer*, FVaultData> _survivorVaultData; // 0x3a0
	ULocalPlayerTrackerComponent* _localPlayerTracker; // 0x3f8
	UBlockableComponent* _blockableComponent; // 0x400
	UDBDNavEvadeLoopComponent* _navEvadeLoopComponent; // 0x418
};

struct UIsTimerDoneCondition {
	UTimerObject* _timer; // 0xe8
};

struct UK24CheatComponent {
	AZombiesManagement* _zombieManagementClass; // 0xb8
	AZombiesManagement* _zombiesManagement; // 0xc0
};

struct AProceduralFoliageBlockingVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x268
};

struct UAISkill_Find {
	AActor* FindClass; // 0xc0
	FGameplayTag BlackboardWishListTag; // 0xc8
	float SearchInterval; // 0xd4
	bool MustBeSeen; // 0xd8
	TArray<UObject*> _currentWishedObjects; // 0xe0
};

struct UScreamSurvivorSubAnimInstance {
	bool _screamTrigger; // 0x4f0
};

struct USourceEffectBitCrusherPreset {
	FSourceEffectBitCrusherSettings Settings; // 0x78
};

struct ASpotLight {
	USpotLightComponent* SpotLightComponent; // 0x240
};

struct UVariant {
	FText DisplayText; // 0x30
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x60
	UTexture2D* Thumbnail; // 0x70
};

struct UGameManualSubPresenter {
	TScriptInterface<IGameManualViewInterface> _gameManualWidget; // 0xb8
};

struct UBTService_FindInteractor {
	FBlackboardKeySelector BBSearchAround; // 0x88
	float SearchInterval; // 0xb8
	float SearchHeightAmplifierActivationHeight; // 0xbc
	float SearchHeightAmplifier; // 0xc0
	UNavigationQueryFilter* FilterClass; // 0xc8
	bool RegisterAsDiscoveredWhenFound; // 0xd0
	FBlackboardKeySelector BBOnlyFromActor; // 0xd8
	TArray<FString> OnlyWithInteractorIDs; // 0x108
	float RejectIfTerrorIsCloserThanSelfMargin; // 0x118
	float RejectIfInTerrorRadius; // 0x11c
	bool RejectIfInPressureZone; // 0x120
	bool UseLastKnownPositionForTerrorRejects; // 0x121
	bool RejectIfWasInCooldownAndFocusedOnAnotherObject; // 0x122
	FName RejectCooldownContextName; // 0x124
	bool AbandonIfInChase; // 0x130
	bool RejectIfFocusedByOther; // 0x131
	bool RejectIfNotFocusedBySelf; // 0x132
	bool IgnoreFocusFilterInEndgameCollapse; // 0x133
	bool RejectIfNotInSight; // 0x134
	bool IgnoreSightFilterIfDiscovered; // 0x135
	bool IgnoreSightFilterIfInRange; // 0x136
	float RejectAboveRange; // 0x138
	bool IgnoreRangeFilterIfDiscovered; // 0x13c
	bool IgnoreRangeFilterIfInSight; // 0x13d
	FBlackboardKeySelector BBInteractLocation; // 0x140
	FBlackboardKeySelector BBInteractorObj; // 0x170
	FAITunableParameter CantInterruptGoalInteractionUnderRemainingTime; // 0x1a0
	FAITunableParameter GoalBasicWeight; // 0x1b0
	FAITunableParameter GoalWeightMaxDistance; // 0x1c0
	FAITunableParameter GoalWeightAtMinDistance; // 0x1d0
	FAITunableParameter GoalWeightAtEndgameStart; // 0x1e0
	FAITunableParameter GoalWeightAtEndgameEnd; // 0x1f0
	UInteractor* _goalInteractor; // 0x200
	ADBDAIBTController* _aiOwner; // 0x208
};

struct UPawnAction_Move {
	AActor* GoalActor; // 0xa0
	FVector goalLocation; // 0xa8
	float AcceptableRadius; // 0xb4
	UNavigationQueryFilter* FilterClass; // 0xb8
	char bAllowStrafe : 1; // 0xc0
	char bFinishOnOverlap : 1; // 0xc0
	char bUsePathfinding : 1; // 0xc0
	char bAllowPartialPath : 1; // 0xc0
	char bProjectGoalToNavigation : 1; // 0xc0
	char bUpdatePathToGoal : 1; // 0xc0
	char bAbortChildActionOnPathChange : 1; // 0xc0
};

struct UBTTask_SetIsChased {
	bool ToSetValue; // 0x78
};

struct ULandscapeLayerInfoObject {
	FName LayerName; // 0x30
	UPhysicalMaterial* PhysMaterial; // 0x40
	float Hardness; // 0x48
	FLinearColor LayerUsageDebugColor; // 0x4c
};

struct UParticleModuleEventReceiverKillParticles {
	char bStopSpawning : 1; // 0x48
};

struct UTrailOfTorment {
	float _cooldownDuration[0x3]; // 0x3e8
	int32_t _highlightPriority; // 0x3f4
	bool _isPerkActivated; // 0x3f8
	AGenerator* _highlightedGenerator; // 0x400
	UStatusEffect* _statusEffect; // 0x408
};

struct UPrimitiveCollection {
	TSet<TWeakObjectPtr<UPrimitiveComponent>> _primitives; // 0x30
};

struct UK25TeleportInteraction {
	int32_t _maxNumberLocationQueriesPerTick; // 0x6d8
	float _timeSensingLamentConfigurationAfterInteractionEnded; // 0x6dc
	FDBDTunableRowHandle _slowdownAfterTeleportDuration; // 0x700
};

struct UProceduralFoliageComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xb8
	float TileOverlap; // 0xc0
	AVolume* SpawningVolume; // 0xc8
	FGuid ProceduralGuid; // 0xd0
};

struct UDynamicMeshBrushTool {
	UPreviewMesh* PreviewMesh; // 0x1d0
};

struct UFindTurnBasedMatchCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UInteractionDefinition {
	FString InteractionID; // 0x250
	float SnapTime; // 0x260
	bool ResetCameraDuringSnap; // 0x264
	bool IsInteractionCancelled; // 0x265
	bool AllowStartInteractionFromHeldInput; // 0x266
	bool AtlantaOverridePowerButtonImage; // 0x267
	FName AtlantaInteractionID; // 0x268
	bool AtlantaOverrideItemUseToggleState; // 0x274
	bool OverrideStopInteractionOnInputRelease; // 0x275
	bool StopInteractionOnMontageComplete; // 0x276
	bool StopInteractionOnMontageBlendingOut; // 0x277
	bool StopInteractionOnTimerExpire; // 0x278
	bool StopInteractionOnHeightDelta; // 0x279
	bool StopEnterMontageOnExit; // 0x27a
	bool StopUpdateMontageOnExit; // 0x27b
	bool IgnoreStrafeAnimFix; // 0x27c
	EInteractionAnimation InteractionAnimation; // 0x27d
	bool CamperCanInteract; // 0x27e
	bool SlasherCanInteract; // 0x27f
	bool AllowInputPersistence; // 0x280
	bool snapPosition; // 0x281
	bool snapRotation; // 0x282
	float SnapStopDistance; // 0x284
	bool TestClearPathDuringSnap; // 0x288
	bool CheckInteractableIsInPlayerView; // 0x289
	float CheckInteractableInViewSphereSweepRadius; // 0x28c
	FVector CheckInteractableInViewOffset; // 0x290
	float CheckInteractableInViewOffsetDistanceToHitPoint; // 0x29c
	bool IsInterruptibleIfTestClearPathDuringSnapFails; // 0x2a0
	bool TestPlayerOrientationOnSnap; // 0x2a1
	bool ScaleEnterAnimationToTime; // 0x2a2
	bool ScaleMainAnimationToTime; // 0x2a3
	bool ScaleExitAnimationToTime; // 0x2a4
	ESnapBackType SnapBackType; // 0x2a5
	ESnapBackPositionType SnapBackPositionType; // 0x2a6
	FVector2D SnapBackPositionOffset; // 0x2a8
	bool SnapToInitialRotationDuringSnapBack; // 0x2b0
	bool UseStartSnapTimeForSnapExitTime; // 0x2b1
	bool CanInteractWhileIncapacitated; // 0x2b2
	bool CanInteractWhileCloaked; // 0x2b3
	bool CanInteractWhileChainBlinking; // 0x2b4
	bool CanInteractWhileAttacking; // 0x2b5
	bool CanInteractWhileChainLinked; // 0x2b6
	bool CanInteractWhileShocked; // 0x2b7
	bool CanInteractWhileUnhookingSelf; // 0x2b8
	bool CanInteractWhileCarrying; // 0x2b9
	bool AllowNavigation; // 0x2ba
	bool AllowNavigationInput; // 0x2bb
	bool AllowRotation; // 0x2bc
	bool UseCameraMontageMode; // 0x2bd
	bool OwnerBlocksAttack; // 0x2be
	bool IsHighPriority; // 0x2bf
	bool AllowOverridingWhenNotForced; // 0x2c0
	bool IgnoreOverlapOnInteractable; // 0x2c1
	bool UseAuthoritativeMovement; // 0x2c2
	bool CanBeAuthoritativePushedDuringEnter; // 0x2c3
	bool CanBeAuthoritativePushedDuringUpdate; // 0x2c4
	bool CanBeAuthoritativePushedDuringExit; // 0x2c5
	bool CanAuthoritativePush; // 0x2c6
	bool CancelOnHit; // 0x2c7
	bool CancelOnAttack; // 0x2c8
	bool HideItem; // 0x2c9
	bool AutoBindToParentInteractor; // 0x2ca
	bool AutoBindToParentZone; // 0x2cb
	float CancelOnMoveInitialDelay; // 0x2cc
	float CancelOnMoveInput; // 0x2d0
	bool CancelOnMoveInputOnlyWhenRunning; // 0x2d4
	TArray<float> ProgressBasedSkillChecks; // 0x2d8
	bool CanCrouch; // 0x2e8
	bool AffectsStillness; // 0x2e9
	bool ConsideredIdle; // 0x2ea
	bool BlockSelfInteract; // 0x2eb
	float InteractionTime; // 0x2ec
	bool ShowHighlightWhenActive; // 0x2f0
	bool AtlantaAlwaysHighPriority; // 0x2f1
	bool ShowHighlightWhenAvailable; // 0x2f2
	EPowerProgressBar ProgressBarToUpdate; // 0x2f3
	bool UpdateHighlightOpacityUsingCharge; // 0x2f4
	EInputInteractionType interactionInputType; // 0x2f5
	bool StopInteractionOnInputRelease; // 0x2f6
	TArray<UInterruptionDefinition*> _interruptionDefinitions; // 0x2f8
	FMulticastInlineDelegate OnInteractionAnimNotify; // 0x350
	bool DebugUnavailability; // 0x360
	EInputInteractionType SecondaryActionInputType; // 0x361
	EInputInteractionType AtlantaSecondaryActionInputType; // 0x362
	UCurveFloat* NavigationSpeedCurveEnter; // 0x380
	UCurveFloat* NavigationSpeedCurve; // 0x388
	UCurveFloat* NavigationSpeedCurveExit; // 0x390
	EInputInteractionType InteractionAtlantaInputType; // 0x398
	bool AtlantaStopInteractionOnInputRelease; // 0x399
	bool _shouldCheckInteractedUpon; // 0x39a
	EInteractionOwnership OwnershipUsability; // 0x39b
	float ExitInteractionTime; // 0x39c
	bool ApplyModifiersToExitTime; // 0x3a0
	FText InteractionDescriptionText; // 0x3a8
	EButtonType AtlantaLastButtonPressed; // 0x3c0
	float InteractionHeightDeltaMax; // 0x3c4
	float MaximumVelocity; // 0x3c8
	FAnimationMontageDescriptor EnterMontage; // 0x3d0
	FAnimationMontageDescriptor UpdateMontage; // 0x3f0
	FAnimationMontageDescriptor ExitMontage; // 0x410
	FName SnapSocketName; // 0x430
	bool _canBeAttachedToAnyZone; // 0x43c
	EButtonType CancelButtonType; // 0x43d
	EButtonType SecondaryActionButtonType; // 0x43e
	EButtonType SecondaryAttackButtonType; // 0x43f
	bool _isInterruptibleBySacrifice; // 0x440
	bool IgnoreStun; // 0x441
	FGameplayTagContainer _tags; // 0x448
	FGameplayTag _objectStateTag; // 0x468
	TMap<FName, FSecondaryInteractionProperties> _secondaryInteractions; // 0x478
	bool _useHoldPrompt; // 0x4c8
	bool _allowInteractionInNarrowSpaces; // 0x4c9
	bool _allowIKSensorDuringInteraction; // 0x4ca
	bool _startUpdateMontageDuringEnter; // 0x4cb
	UInteractor* _interactor; // 0x4d0
	TArray<UInteractionDefinition*> _mutuallyExclusiveInteractionsClient; // 0x4d8
	FActivationDefinition _activationDefinition; // 0x4e8
	UPrimitiveComponent* _zone; // 0x510
	EInputInteractionType _cancelInputType; // 0x518
	FGameplayTagContainer _preventingTags; // 0x520
	FGameplayTagContainer _disablingTags; // 0x540
	TArray<UPlayerInteractionHandler*> _evaluatingInteractionHandlers; // 0x560
	FSecondaryInteractionProperties DEPRECATED_SecondaryInteractionProperties; // 0x570
};

struct UUMGNavigationButtonWidget {
	UWidget* NotificationPanel; // 0x430
};

struct UUMGObjectivesWidget {
	ESlateVisibility PanelEscapeRequirementsVisibility; // 0x300
	ESlateVisibility PanelGeneratorVisibility; // 0x301
	ESlateVisibility PanelFindExitVisibility; // 0x302
	ESlateVisibility PanelHatchVisibility; // 0x303
};

struct USoundNodeBranch {
	FName BoolParameterName; // 0x50
};

struct UAddon_K22Power_19 {
	float _auraRevealedDuration; // 0x2a8
};

struct UTwinBaseAddon {
	FName _statusEffectId; // 0x298
	float _customParam; // 0x2a4
};

struct UMaterialExpressionLandscapeLayerSwitch {
	FExpressionInput LayerUsed; // 0x48
	FExpressionInput LayerNotUsed; // 0x64
	FName ParameterName; // 0x80
	char PreviewUsed : 1; // 0x8c
	FGuid ExpressionGUID; // 0x90
};

struct UDeceptionEffect {
	bool _hideBloodTrailsWhenCamperFakeEnterLocker; // 0x350
};

struct UActorDependency {
	TArray<FDependency> Dependencies; // 0xb8
};

struct UAddon_TheBlight_21 {
	UStatusEffect* _forceKoStatusEffect; // 0x298
};

struct USoundfieldSubmix {
	FName SoundfieldEncodingFormat; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x58
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x60
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x70
};

struct UEnvQueryTest_Distance {
	EEnvTestDistance TestMode; // 0x238
	UEnvQueryContext* DistanceTo; // 0x240
};

struct UMRMeshComponent {
	UMaterialInterface* Material; // 0x430
	bool bCreateMeshProxySections; // 0x438
	bool bUpdateNavMeshOnMeshUpdate; // 0x439
	bool bNeverCreateCollisionMesh; // 0x43a
	UBodySetup* CachedBodySetup; // 0x440
	TArray<UBodySetup*> BodySetups; // 0x448
	UMaterialInterface* WireframeMaterial; // 0x458
};

struct UTemplateSequence {
	UMovieScene* MovieScene; // 0x350
	TSoftClassPtr<UObject> BoundActorClass; // 0x358
	TSoftObjectPtr<AActor> BoundPreviewActor; // 0x388
	TMap<FGuid, FName> BoundActorComponents; // 0x3b8
};

struct ALanternInteractable {
	FMulticastInlineDelegate OnLanternStateChanged; // 0x328
	FMulticastInlineDelegate OnLanternCollectedByPlayerCosmetic; // 0x338
	ALanternLightCollectable* _collectableClass; // 0x368
};

struct UWindowTitleBarAreaSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct USwfMovie {
	char bUseGFxExport : 1; // 0x30
	char bOptimizeForMobiles : 1; // 0x30
	char bSetSRGBOnImportedTextures : 1; // 0x30
	char bPackTextures : 1; // 0x30
	int32_t PackTextureSize; // 0x34
	char bForceSquarePacking : 1; // 0x38
	FlashTextureRescale TextureRescale; // 0x3c
	FString TextureFormat; // 0x40
	char bReplaceImages : 1; // 0x50
	FString SourceFile; // 0x58
	TArray<FString> FontMappings; // 0x68
	FString SourceFileTimestamp; // 0x78
	uint64_t ImportTimeStamp; // 0x88
	TArray<char> RawData; // 0x90
	TArray<FString> ReferencedAssetNames; // 0xa0
	TArray<UObject*> References; // 0xb0
	TArray<UObject*> UserReferences; // 0xc0
};

struct USmoothMeshTool {
	ESmoothMeshToolSmoothType SmoothType; // 0x98
	float SmoothSpeed; // 0x9c
	int32_t SmoothIterations; // 0xa0
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xa8
};

struct UCharacterChaseVisualComponent {
	FMulticastInlineDelegate OnChaseStartEvent; // 0xb8
	FMulticastInlineDelegate OnChaseEndEvent; // 0xc8
	UMaterialHelperUnaffectedStaticMeshComp* _vignetteMeshComp; // 0xd8
	FVector _relativeLocation; // 0xe0
	FVector _relativeScale; // 0xec
	FRotator _relativeRotation; // 0xf8
	float _fovModifyFactor; // 0x104
};

struct UAkLinuxInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
};

struct UCompositeModifierCondition {
	TArray<UEventDrivenModifierCondition*> _conditions; // 0xf0
};

struct UDownloadMultiTextureTask {
	TArray<UDownloadingTextureTask*> _downloadingTasks; // 0x30
	TMap<FName, UTexture2DDynamic*> _downloadedTextures; // 0x58
	int32_t _remainingTasks; // 0xa8
};

struct UInteractiveToolManager {
	UInteractiveTool* ActiveLeftTool; // 0x38
	UInteractiveTool* ActiveRightTool; // 0x40
	TMap<FString, UInteractiveToolBuilder*> ToolBuilders; // 0x98
};

struct UStreamableRenderAsset {
	double ForceMipLevelsToBeResidentTimestamp; // 0x30
	int32_t NumCinematicMipLevels; // 0x38
	int32_t StreamingIndex; // 0x3c
	int32_t CachedCombinedLODBias; // 0x40
	char CachedNumResidentLODs; // 0x44
	char bCachedReadyForStreaming : 1; // 0x45
	char NeverStream : 1; // 0x45
	char bGlobalForceMipLevelsToBeResident : 1; // 0x45
	char bIsStreamable : 1; // 0x45
	char bHasStreamingUpdatePending : 1; // 0x45
	char bForceMiplevelsToBeResident : 1; // 0x45
	char bIgnoreStreamingMipBias : 1; // 0x45
	char bUseCinematicMipLevels : 1; // 0x45
};

struct UParticleModuleLocationStaticVertSurface {
	ELocationStaticVertSurfaceSource SourceType; // 0x38
	FVector UniversalOffset; // 0x3c
	char bUpdatePositionEachFrame : 1; // 0x48
	char bOrientMeshEmitters : 1; // 0x48
	FName StaticMeshActorParamName; // 0x4c
	char bEnforceNormalCheck : 1; // 0x58
	FVector NormalToCompare; // 0x5c
	float NormalCheckToleranceDegrees; // 0x68
	float NormalCheckTolerance; // 0x6c
	TArray<int32_t> ValidMaterialIndices; // 0x70
	char bInheritVertexColor : 1; // 0x80
	char bInheritUV : 1; // 0x80
	uint32_t InheritUVChannel; // 0x84
};

struct ULightMapVirtualTexture2D {
	TArray<int8_t> TypeToLayer; // 0x108
};

struct UCoreButtonSelector {
	FMulticastInlineDelegate OnSelectedDelegate; // 0x2d8
	FMulticastInlineDelegate OnSelectedAgainDelegate; // 0x2e8
	FMulticastInlineDelegate OnUnselectedDelegate; // 0x2f8
	TArray<UCoreSelectableButtonWidget*> _buttons; // 0x308
};

struct UMovieSceneEnumTrack {
	UEnum* Enum; // 0x98
};

struct Uspecialeventmanager {
	USpecialEventsContainer* _specialEventsContainer; // 0xb0
};

struct UPanelScreenUMG {
	UUMGSwitcherScreen* _atlantaPanelScreen; // 0x320
};

struct UUMGEndGameCollapseWidget {
	float _progressBarInterpSpeed; // 0x308
	bool _slowMode; // 0x30c
	UCanvasPanel* NormalBar; // 0x310
	UCanvasPanel* SlowBar; // 0x318
	UUMGEndGameCollapseProgressWidget* NormalProgressBar; // 0x320
	UUMGEndGameCollapseProgressWidget* SlowProgressBar; // 0x328
	UUMGEndGameCollapseProgressWidget* _topBar; // 0x378
};

struct USoundNodeModulatorContinuous {
	FModulatorContinuousParams PitchModulationParams; // 0x50
	FModulatorContinuousParams VolumeModulationParams; // 0x74
};

struct UThrowRockInteraction {
	FDBDTunableRowHandle _loudNoiseAudioRange; // 0x5b0
	float _scratchMarksApplicationDelay; // 0x5d8
	int32_t _scratchMarksCountToSpawn; // 0x5dc
	float _diversionHeightOffset; // 0x5e4
};

struct UUMGAtlantaTutorialGenericPopup {
	UImage* ImageTutorial; // 0x3e8
	UVerticalBox* ImagesCanvas; // 0x3f0
	UHorizontalBox* ButtonsPanel; // 0x3f8
	TSoftClassPtr<UObject> _pageButtonWidgetClass; // 0x400
	float ButtonWidth; // 0x430
	float DelayBeforeChangingImage; // 0x434
	FTimerHandle _changeImagesTimerHandle; // 0x438
};

struct ACameraActor {
	EAutoReceiveInput AutoActivateForPlayer; // 0x230
	UCameraComponent* CameraComponent; // 0x238
	USceneComponent* SceneComponent; // 0x240
	char bConstrainAspectRatio : 1; // 0x250
	float AspectRatio; // 0x254
	float FOVAngle; // 0x258
	float PostProcessBlendWeight; // 0x25c
	FPostProcessSettings PostProcessSettings; // 0x260
};

struct UUMGPromoPackContentWidget {
	UHorizontalBox* Content; // 0x300
	UPromoPackContentDataAsset* WidgetPerContentType; // 0x308
	UScrollBox* ScrollBox; // 0x310
	TArray<TWeakObjectPtr<UVerticalBox>> _itemsContainer; // 0x318
};

struct UTimedRespawnableTrigger {
	URespawningEventComponent* _respawningEventComponent; // 0xb8
};

struct UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnPlay; // 0x410
	FMulticastInlineDelegate OnPlayReverse; // 0x420
	FMulticastInlineDelegate OnStop; // 0x430
	FMulticastInlineDelegate OnPause; // 0x440
	FMulticastInlineDelegate OnFinished; // 0x450
	EMovieScenePlayerStatus Status; // 0x460
	char bReversePlayback : 1; // 0x464
	UMovieSceneSequence* Sequence; // 0x468
	FFrameNumber StartTime; // 0x470
	int32_t DurationFrames; // 0x474
	int32_t CurrentNumLoops; // 0x478
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x490
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x4a8
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x830
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x840
};

struct UWraithBurnable {
	FDBDTunableRowHandle _flashlightEvasionScoreCooldown; // 0x110
};

struct UEditMeshPolygonsTool {
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0xd8
	UPolyEditTransformProperties* TransformProps; // 0xe0
	UEditMeshPolygonsToolActions* EditActions; // 0x210
	UEditMeshPolygonsToolActions_Triangles* EditActions_Triangles; // 0x218
	UEditMeshPolygonsToolEdgeActions* EditEdgeActions; // 0x220
	UEditMeshPolygonsToolEdgeActions_Triangles* EditEdgeActions_Triangles; // 0x228
	UEditMeshPolygonsToolUVActions* EditUVActions; // 0x230
	UPolyEditExtrudeProperties* ExtrudeProperties; // 0x238
	UPolyEditCutProperties* CutProperties; // 0x2d0
	UPolyEditSetUVProperties* SetUVProperties; // 0x2d8
	UPolygonSelectionMechanic* SelectionMechanic; // 0x2e0
	UMultiTransformer* MultiTransformer; // 0x2f0
	UPolyEditPreviewMesh* EditPreview; // 0x6a0
	UPlaneDistanceFromHitMechanic* ExtrudeHeightMechanic; // 0x6b0
	USpatialCurveDistanceMechanic* CurveDistMechanic; // 0x6b8
	UCollectSurfacePathMechanic* SurfacePathMechanic; // 0x6c0
};

struct UUMGTallyListWidget {
	FText TopLeftText; // 0x430
	FText TopRightText; // 0x448
	UCanvasPanel* ListBGPanel; // 0x460
	EPlayerRole _playerRole; // 0x468
	TSet<int32_t> _inAnimationPlayedPages; // 0x470
	TMap<ETallyListPageID, UUMGTallyListElementWidget*> _listItemWidgets; // 0x4c0
};

struct UBTDecorator {
	char bInverseCondition : 1; // 0x68
	EBTFlowAbortMode FlowAbortMode; // 0x6c
};

struct UDatasmithLandscapeTemplate {
	UMaterialInterface* LandscapeMaterial; // 0x38
	int32_t StaticLightingLOD; // 0x40
};

struct UInterpTrackLinearColorProp {
	FName PropertyName; // 0x98
};

struct UAsyncActionHandleSaveGame {
	FMulticastInlineDelegate COMPLETED; // 0x38
	USaveGame* SaveGameObject; // 0x68
};

struct UParticleModuleAttractorPointGravity {
	FVector Position; // 0x38
	float Radius; // 0x44
	UDistributionFloat* Strength; // 0x48
	FRawDistributionFloat StrengthRaw; // 0x50
};

struct USlasherHitsWhileCarryingTrackerComponent {
	TSet<ACamperPlayer*> _campersHitDuringLastCarry; // 0xb8
};

struct UUMGHudEditorDragConstraintWidget {
	USizeBox* LinkSizeBox; // 0x260
	UUserWidget* _childWidget; // 0x268
	UUserWidget* _parentWidget; // 0x270
};

struct UBTDecorator_IsGameState {
	EArithmeticKeyOperation RemainingObjectiveOp; // 0x70
	int32_t NbRemainingObjectives; // 0x74
	EArithmeticKeyOperation SurvivorsLeftOp; // 0x78
	int32_t NbSurvivorsLeft; // 0x7c
};

struct UBTTask_RunSkills {
	FGameplayTag Context; // 0x78
};

struct UAnyMeansNecessary {
	bool RevealSurvivorOnPalletPullUpStarted; // 0x3d0
	bool RevealSurvivorOnPalletPulledUp; // 0x3d1
	float RevealSurvivorDuration; // 0x3d4
	TWeakObjectPtr<UStatusEffect> _effect; // 0x3d8
	float _cooldownDuration[0x3]; // 0x3e0
};

struct UBorderSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UPerkSoundHudWidget {
	UHorizontalBox* PerkIcons; // 0x300
};

struct UChangeZombieStateBTTask {
	EZombieState _zombieState; // 0xb0
};

struct UCollectSerumInCrateInteraction {
	ASupplyCrateInteractable* _owningSupplyCrate; // 0x5d8
};

struct UGnomePlayerComponent {
	bool _hasInteractedWithGnomeThisGame; // 0xb8
};

struct UAISkill_FindCollectable_LamentConfiguration {
	FAITunableParameter StopChainHuntGoalWeight; // 0x120
	FAITunableParameter PreemptiveFindLamentGoalWeight; // 0x130
};

struct UAkAssetDataSwitchContainer {
	TArray<UAkAssetDataSwitchContainerData*> SwitchContainers; // 0x90
	UAkGroupValue* DefaultGroupValue; // 0xa0
};

struct AK25SurvivorChainAttachmentAnchor {
	FDBDTunableRowHandle _chainMaxBreakingLength; // 0x248
	float _timeBetweenTrace; // 0x270
	FK25SurvivorChainAttachmentData _attachmentData; // 0x278
	TWeakObjectPtr<ACamperPlayer> _owningSurvivor; // 0x2a0
	TWeakObjectPtr<AK25Chain> _attachedChain; // 0x2a8
	FVector _cachedPullDirection; // 0x2d8
};

struct ULamentConfigurationChainHuntComponent {
	float _floorChainHuntTimeBetweenChainStrikes; // 0x130
	FTunableStat _chainHuntChargeTime; // 0x138
	UCurveFloat* _chainNumberPerChainHuntCluster; // 0x1b8
	UCurveFloat* _timeBetweenChainHuntClusterStrikes; // 0x1c0
	UK25KillerChainHuntEffectsComponent* _killerChainHuntEffectsComponentClass; // 0x1c8
	UK25SurvivorChainHuntEffectsComponent* _survivorChainHuntEffectsComponentClass; // 0x1d0
	UK25KillerChainHuntEffectsComponent* _killerChainHuntEffectsComponent; // 0x1d8
	TArray<UK25SurvivorChainHuntEffectsComponent*> _chainHuntEffectsComponents; // 0x1e0
	float _cachedAdditiveChainStrikeDelayTime; // 0x250
	FChainHuntStateData _chainHuntStateData; // 0x288
	EChainHuntState _oldChainHuntState; // 0x298
};

struct UEnvQueryTest_Volume {
	UEnvQueryContext* VolumeContext; // 0x238
	AVolume* VolumeClass; // 0x240
	char bDoComplexVolumeTest : 1; // 0x248
};

struct UAIPerceptionSystem {
	TArray<UAISense*> Senses; // 0x90
	float PerceptionAgingRate; // 0xa0
};

struct UControlPointMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4e8
};

struct UUMGAtlEndDateTimerWidget {
	UTextBlock* TextEndIn; // 0x300
};

struct UUMGBasePassStorefrontWidget {
	UUMGSubscriptionsPageScrollWidget* SubscriptionsPageScroll; // 0x300
};

struct UUMGTallyBloodpointsWidget {
	ESlateVisibility _itemBoxVisibility; // 0x310
	FText _labelTotalScore; // 0x318
	FText _labelItemTitle; // 0x330
	FText _labelItemAddOnTitle; // 0x348
	FLinearColor _labelItemTitleColor; // 0x360
	UHorizontalBox* BoxScoreCategory; // 0x370
	TMap<EDBDScoreCategory, FScoreCategoryUIExtraData> _scoreCategoryExtraDataMap; // 0x378
};

struct USkyLightComponent {
	ESkyLightSourceType SourceType; // 0x260
	UTextureCube* Cubemap; // 0x268
	float SourceCubemapAngle; // 0x270
	int32_t CubemapResolution; // 0x274
	float SkyDistanceThreshold; // 0x278
	bool bCaptureEmissiveOnly; // 0x27c
	bool bLowerHemisphereIsBlack; // 0x27d
	FLinearColor LowerHemisphereColor; // 0x280
	float OcclusionMaxDistance; // 0x290
	float Contrast; // 0x294
	float OcclusionExponent; // 0x298
	float MinOcclusion; // 0x29c
	FColor OcclusionTint; // 0x2a0
	EOcclusionCombineMode OcclusionCombineMode; // 0x2a4
	UTextureCube* BlendDestinationCubemap; // 0x358
};

struct UStaticMeshSocket {
	FName SocketName; // 0x30
	FVector RelativeLocation; // 0x3c
	FRotator RelativeRotation; // 0x48
	FVector RelativeScale; // 0x54
	FString Tag; // 0x60
};

struct UBTService_Patrol {
	FBlackboardKeySelector BBFilterKey; // 0x78
	EBasicKeyOperation FilterOperation; // 0xa8
	FVector NavMeshFindLocationExtents; // 0xac
	float MinPatrolInvestigationDistance; // 0xb8
	float PatrolPointsValidityCheckInterval; // 0xbc
	FBlackboardKeySelector BBPatrolPointOwner; // 0xc0
	FBlackboardKeySelector BBPatrolLocation; // 0xf0
	FBlackboardKeySelector BBGoToNextPatrolLocation; // 0x120
};

struct UShowLoginUICallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UDragDropOperation_Widget {
	UUMGDragWidget* Widget; // 0x90
	UPanelWidget* WidgetParent; // 0x98
	FVector2D startPosition; // 0xa0
	FVector2D WidgetLocalScale; // 0xa8
	float WidgetLocalOpacity; // 0xc8
	FVector2D OnDropOffset; // 0xcc
	FVector2D OnDragOffset; // 0xd4
	FAnchors WidgetSlotAnchors; // 0xdc
	FMargin WidgetSlotOffsets; // 0xec
	FVector2D WidgetSlotPosition; // 0xfc
	FVector2D WidgetSlotSize; // 0x104
	bool WidgetSlotAutoSize; // 0x10c
	FVector2D WidgetSlotAlignment; // 0x110
	int32_t WidgetSlotZOrder; // 0x118
	UUMGDragWidget* ChildLinkWidget; // 0x120
};

struct USkeletalMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x6d0
	UAnimInstance* AnimClass; // 0x6d8
	UAnimInstance* AnimScriptInstance; // 0x6e0
	UAnimInstance* PostProcessAnimInstance; // 0x6e8
	FSingleAnimationPlayData AnimationData; // 0x6f0
	FVector RootBoneTranslation; // 0x718
	FVector LineCheckBoundsScale; // 0x724
	TArray<UAnimInstance*> LinkedInstances; // 0x750
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x760
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x770
	float GlobalAnimRateScale; // 0x7a0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x7a4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x7a5
	EAnimationMode AnimationMode; // 0x7a7
	char bDisablePostProcessBlueprint : 1; // 0x7a9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x7a9
	char bHasValidBodies : 1; // 0x7a9
	char bBlendPhysics : 1; // 0x7a9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x7a9
	char bUpdateJointsFromAnimation : 1; // 0x7aa
	char bDisableClothSimulation : 1; // 0x7aa
	char bDisableRigidBodyAnimNode : 1; // 0x7aa
	char bAllowAnimCurveEvaluation : 1; // 0x7aa
	char bDisableAnimCurves : 1; // 0x7aa
	char bCollideWithEnvironment : 1; // 0x7ab
	char bCollideWithAttachedChildren : 1; // 0x7ab
	char bLocalSpaceSimulation : 1; // 0x7ab
	char bResetAfterTeleport : 1; // 0x7ab
	char bDeferKinematicBoneUpdate : 1; // 0x7ab
	char bNoSkeletonUpdate : 1; // 0x7ab
	char bPauseAnims : 1; // 0x7ab
	char bUseRefPoseOnInitAnim : 1; // 0x7ac
	char bEnablePerPolyCollision : 1; // 0x7ac
	char bForceRefpose : 1; // 0x7ac
	char bOnlyAllowAutonomousTickPose : 1; // 0x7ac
	char bIsAutonomousTickPose : 1; // 0x7ac
	char bOldForceRefPose : 1; // 0x7ac
	char bShowPrePhysBones : 1; // 0x7ac
	char bRequiredBonesUpToDate : 1; // 0x7ac
	char bAnimTreeInitialised : 1; // 0x7ad
	char bIncludeComponentLocationIntoBounds : 1; // 0x7ad
	char bEnableLineCheckWithBounds : 1; // 0x7ad
	char bUseBendingElements : 1; // 0x7ad
	char bUseTetrahedralConstraints : 1; // 0x7ad
	char bUseThinShellVolumeConstraints : 1; // 0x7ad
	char bUseSelfCollisions : 1; // 0x7ad
	char bUseContinuousCollisionDetection : 1; // 0x7ad
	char bPropagateCurvesToSlaves : 1; // 0x7ae
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x7ae
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x7ae
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x7ae
	uint16_t CachedAnimCurveUidVersion; // 0x7b0
	EClothMassMode MassMode; // 0x7b2
	float UniformMass; // 0x7b4
	float TotalMass; // 0x7b8
	float Density; // 0x7bc
	float MinPerParticleMass; // 0x7c0
	float ClothBlendWeight; // 0x7c4
	float EdgeStiffness; // 0x7c8
	float BendingStiffness; // 0x7cc
	float AreaStiffness; // 0x7d0
	float VolumeStiffness; // 0x7d4
	float StrainLimitingStiffness; // 0x7d8
	float ShapeTargetStiffness; // 0x7dc
	TArray<FName> DisallowedAnimCurves; // 0x7e0
	UBodySetup* BodySetup; // 0x7f0
	FMulticastInlineDelegate OnConstraintBroken; // 0x800
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x810
	float TeleportDistanceThreshold; // 0x8f8
	float TeleportRotationThreshold; // 0x8fc
	uint32_t LastPoseTickFrame; // 0x908
	UClothingSimulationInteractor* ClothingInteractor; // 0x960
	FMulticastInlineDelegate OnAnimInitialized; // 0xa30
};

struct UUniformInteger {
	int32_t Magnitude; // 0xb8
};

struct UAISubsystem {
	UAISystem* AISystem; // 0x38
};

struct UInterpFilter {
	FString Caption; // 0x30
};

struct ANavLinkProxy_Base {
	float WaitLinkOffset; // 0x280
	float MoveOnEndPointTimeLimit; // 0x284
	int32_t NbMaxLinkUsers; // 0x288
	TMap<ADBDPlayer*, FMoveLinkPlayerInfo> _players; // 0x290
	TArray<ADBDPlayer*> _linkUsedByPlayers; // 0x2e0
};

struct UMaterialExpressionStaticBoolParameter {
	char defaultValue : 1; // 0x68
};

struct UNiagaraDataInterfaceCurve {
	FRichCurve Curve; // 0x60
};

struct ABaseTormentTrailPoint {
	USphereComponent* _collisionComponent; // 0x248
	float _collisionRadius; // 0x250
	FTunableStat _tormentTrailAliveTime; // 0x258
	USplineMeshComponent* _splineMeshComponent; // 0x308
	TArray<UStaticMesh*> _trailMeshList; // 0x310
	char _indexInTrail; // 0x320
};

struct UDeathBedAntiCampComponent {
	FDBDTunableRowHandle _anticampZoneDistance; // 0x100
	FDBDTunableRowHandle _anticampZoneTimeToTrigger; // 0x128
};

struct UFixedFrameRateCustomTimeStep {
	FFrameRate FixedFrameRate; // 0x30
};

struct UFXWidget {
	UNiagaraSystem* _niagaraSystem; // 0x260
	FFXWidgetPlayer _particlePlayer; // 0x278
};

struct ULandscapeMeshCollisionComponent {
	FGuid MeshGuid; // 0x508
};

struct AOnlineLobbyLevel {
	UProceduralGenerationData* ProceduralGenerationData; // 0x2b0
	TArray<FVector> _onlineLobbySlasherPOVTrackerOffsets; // 0x2b8
	TArray<TWeakObjectPtr<ADisplayStand>> _onlineLobbyCamperDisplayStands; // 0x2c8
	TArray<TWeakObjectPtr<ADisplayStand>> _onlineLobbySlasherDisplayStands; // 0x2d8
};

struct UMaterialExpression {
	UMaterial* Material; // 0x30
	UMaterialFunction* Function; // 0x38
	char bIsParameterExpression : 1; // 0x40
};

struct UAnimCompress {
	char bNeedsSkeleton : 1; // 0x40
	AnimationCompressionFormat TranslationCompressionFormat; // 0x44
	AnimationCompressionFormat RotationCompressionFormat; // 0x45
	AnimationCompressionFormat ScaleCompressionFormat; // 0x46
};

struct UParticleModuleAccelerationDrag {
	UDistributionFloat* DragCoefficient; // 0x40
	FRawDistributionFloat DragCoefficientRaw; // 0x48
};

struct AOnlineBeaconHost {
	int32_t ListenPort; // 0x268
	TArray<AOnlineBeaconClient*> ClientActors; // 0x270
};

struct AARSharedWorldGameState {
	TArray<char> PreviewImageData; // 0x2a8
	TArray<char> ARWorldData; // 0x2b8
	int32_t PreviewImageBytesTotal; // 0x2c8
	int32_t ARWorldBytesTotal; // 0x2cc
	int32_t PreviewImageBytesDelivered; // 0x2d0
	int32_t ARWorldBytesDelivered; // 0x2d4
};

struct USculptMaxBrushProperties {
	float MaxHeight; // 0x58
	bool bFreezeCurrentHeight; // 0x5c
};

struct UNiagaraDataInterfaceVector2DCurve {
	FRichCurve XCurve; // 0x60
	FRichCurve YCurve; // 0xe0
};

struct USourceBasedOutlineUpdateStrategy {
	FLinearColor _defaultColorForSurvivor; // 0xc0
	FLinearColor _defaultColorForSlasher; // 0xd0
};

struct UCoreBaseHudWidget {
	float FocusAnimationDuration; // 0x2d8
	float FocusAnimationDelay; // 0x2dc
	EEasingType FocusAnimationEasing; // 0x2e0
	float FocusAnimationMaxOpacity; // 0x2e4
	float FocusAnimationMinOpacity; // 0x2e8
};

struct UParticleModuleOrientationAxisLock {
	EParticleAxisLock LockAxisFlags; // 0x38
};

struct UAkComponent {
	bool bUseSpatialAudio; // 0x230
	ECollisionChannel OcclusionCollisionChannel; // 0x238
	char EnableSpotReflectors : 1; // 0x23c
	UAkAuxBus* EarlyReflectionAuxBus; // 0x240
	FString EarlyReflectionAuxBusName; // 0x248
	int32_t EarlyReflectionOrder; // 0x258
	float EarlyReflectionBusSendGain; // 0x25c
	float EarlyReflectionMaxPathLength; // 0x260
	float roomReverbAuxBusGain; // 0x264
	int32_t diffractionMaxEdges; // 0x268
	int32_t diffractionMaxPaths; // 0x26c
	float diffractionMaxPathLength; // 0x270
	char DrawFirstOrderReflections : 1; // 0x274
	char DrawSecondOrderReflections : 1; // 0x274
	char DrawHigherOrderReflections : 1; // 0x274
	char DrawDiffraction : 1; // 0x274
	bool StopWhenOwnerDestroyed; // 0x278
	float AttenuationScalingFactor; // 0x27c
	float OcclusionRefreshInterval; // 0x280
	bool bUseReverbVolumes; // 0x284
	bool ShouldTransmitRelativeAngle; // 0x285
	float OcclusionAffect; // 0x288
	float MaxDistance; // 0x28c
};

struct UDedicatedServerManager {
	TScriptInterface<IDedicatedServerStartupInitializerInterface> _startupInitializer; // 0x30
	UDBDGameInstance* _gameInstance; // 0x50
	UOnlineSystemHandler* _onlineSystemHandler; // 0x58
};

struct UQuestEventEvaluatorBase {
	ADBDPlayer* _dbdPlayer; // 0x50
	TArray<UEvaluatorCondition*> _evaluatorConditionsClass; // 0x70
	TArray<UEvaluatorCondition*> _evaluatorConditions; // 0x80
};

struct UTileBank {
	TArray<ATile*> _allTileBlueprints; // 0x120
};

struct UInteractionRespawnableTrigger {
	URespawningEventComponent* _respawningEventComponent; // 0xb8
};

struct UInterpTrackInstToggle {
	ETrackToggleAction action; // 0x30
	float LastUpdatePosition; // 0x34
	char bSavedActiveState : 1; // 0x38
};

struct UDragDropOperation {
	FString Tag; // 0x30
	UObject* Payload; // 0x40
	UWidget* DefaultDragVisual; // 0x48
	EDragPivot Pivot; // 0x50
	FVector2D Offset; // 0x54
	FMulticastInlineDelegate OnDrop; // 0x60
	FMulticastInlineDelegate OnDragCancelled; // 0x70
	FMulticastInlineDelegate OnDragged; // 0x80
};

struct UComboBox {
	TArray<UObject*> Items; // 0x128
	FDelegate OnGenerateWidgetEvent; // 0x138
	bool bIsFocusable; // 0x14c
};

struct UAISkill_InteractionTarget_StalkShape {
	int32_t StalkRangeLimitedAtEvilTier; // 0x220
	float MaxStalkRangeWhenLimitedByEvilTier; // 0x224
};

struct UParticleModuleRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UMovieSceneMaterialParameterCollectionTrack {
	UMaterialParameterCollection* MPC; // 0x70
};

struct UBTService_FindInteractor_WishList {
	FGameplayTag WishListTag; // 0x218
};

struct UMicroTransactionBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x40
	FString LastError; // 0x50
	FString LastErrorSolution; // 0x60
};

struct UUMGCustomizationScreenWidget {
	UUMGCustomizationPageScrollWidget* PageScrollWidget; // 0x330
	UUMGCustomizationCategoriesBar* CustomizationCategoriesBar; // 0x338
	UTextBlock* CategoryLabel; // 0x340
	UTextBlock* CurrentlyEquippedLabel; // 0x348
	UCanvasPanel* AvailableInOutfitsContainer; // 0x350
	UCanvasPanel* UnlockItemContainer; // 0x358
	UUMGCustomizationItemWidget* OutfitItem; // 0x360
	UVerticalBox* PriceContainer; // 0x368
	TSoftClassPtr<UObject> PriceButtonWidgetClass; // 0x370
	FName _currentSelectedItem; // 0x3a4
};

struct UBasePowerSubAnimInstance {
	bool _isUsingPower; // 0x4f8
};

struct UPathStrategySelector {
	ADBDAIBTController* _aiOwner; // 0x38
	TArray<UPathStrategy*> _activePathStrategies; // 0x40
	TArray<UPathStrategy*> _nextPathStrategies; // 0x50
};

struct UOverlaySlot {
	FMargin Padding; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UBlueprintCore {
	UObject* SkeletonGeneratedClass; // 0x30
	UObject* GeneratedClass; // 0x38
	bool bLegacyNeedToPurgeSkelRefs; // 0x40
	FGuid BlueprintGuid; // 0x44
};

struct UCoreKeyListenerButtontWidget {
	UDBDTextBlock* InputNameTB; // 0x398
};

struct UMaterialExpressionArcsine {
	FExpressionInput Input; // 0x48
};

struct ARecastNavMesh {
	char bDrawTriangleEdges : 1; // 0x428
	char bDrawPolyEdges : 1; // 0x428
	char bDrawFilledPolys : 1; // 0x428
	char bDrawNavMeshEdges : 1; // 0x428
	char bDrawTileBounds : 1; // 0x428
	char bDrawPathCollidingGeometry : 1; // 0x428
	char bDrawTileLabels : 1; // 0x428
	char bDrawPolygonLabels : 1; // 0x428
	char bDrawDefaultPolygonCost : 1; // 0x429
	char bDrawLabelsOnPathNodes : 1; // 0x429
	char bDrawNavLinks : 1; // 0x429
	char bDrawFailedNavLinks : 1; // 0x429
	char bDrawClusters : 1; // 0x429
	char bDrawOctree : 1; // 0x429
	char bDrawOctreeDetails : 1; // 0x429
	char bDrawMarkedForbiddenPolys : 1; // 0x429
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x42a
	char bDrawNavMesh : 1; // 0x42a
	float DrawOffset; // 0x42c
	char bFixedTilePoolSize : 1; // 0x430
	int32_t TilePoolSize; // 0x434
	float TileSizeUU; // 0x438
	float CellSize; // 0x43c
	float CellHeight; // 0x440
	float AgentRadius; // 0x444
	float AgentHeight; // 0x448
	float AgentMaxHeight; // 0x44c
	float AgentMaxSlope; // 0x450
	float AgentMaxStepHeight; // 0x454
	float MinRegionArea; // 0x458
	float MergeRegionSize; // 0x45c
	float MaxSimplificationError; // 0x460
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x464
	int32_t TileNumberHardLimit; // 0x468
	int32_t PolyRefTileBits; // 0x46c
	int32_t PolyRefNavPolyBits; // 0x470
	int32_t PolyRefSaltBits; // 0x474
	FVector NavMeshOriginOffset; // 0x478
	float DefaultDrawDistance; // 0x484
	float DefaultMaxSearchNodes; // 0x488
	float DefaultMaxHierarchicalSearchNodes; // 0x48c
	ERecastPartitioning RegionPartitioning; // 0x490
	ERecastPartitioning LayerPartitioning; // 0x491
	int32_t RegionChunkSplits; // 0x494
	int32_t LayerChunkSplits; // 0x498
	char bSortNavigationAreasByCost : 1; // 0x49c
	char bPerformVoxelFiltering : 1; // 0x49c
	char bMarkLowHeightAreas : 1; // 0x49c
	char bFilterLowSpanSequences : 1; // 0x49c
	char bFilterLowSpanFromTileCache : 1; // 0x49c
	char bDoFullyAsyncNavDataGathering : 1; // 0x49c
	char bUseBetterOffsetsFromCorners : 1; // 0x49c
	char bStoreEmptyTileLayers : 1; // 0x49c
	char bUseVirtualFilters : 1; // 0x49d
	char bAllowNavLinkAsPathEnd : 1; // 0x49d
	char bUseVoxelCache : 1; // 0x49d
	float TileSetUpdateInterval; // 0x4a0
	float HeuristicScale; // 0x4a4
	float VerticalDeviationFromGroundCompensation; // 0x4a8
};

struct UDoesPerkHaveToken {
	TWeakObjectPtr<UPerk> _perk; // 0xe8
};

struct UHatchetThrow {
	FDBDTunableRowHandle _hatchetThrowCancellationCooldown; // 0x6e8
};

struct ADBDPlayerController {
	FMulticastInlineDelegate OnPawnLeavingGame; // 0x640
	FMulticastInlineDelegate OnLocallyObservedChanged; // 0x650
	ANetworkFenceActor* _theFence; // 0x6f8
	UDBDBaseInputHandler* _inputHandler; // 0x708
	APawn* _aiPawn; // 0x838
	EPlayerRole _controllerGameRole; // 0x848
};

struct UTriplanarDecalComponent {
	float MinHeight; // 0x210
	float Height; // 0x214
	float MaskIntensity; // 0x218
	UTexture2D* TopTexture; // 0x220
	UTexture2D* BottomTexture; // 0x228
	UTexture2D* MaskTexture; // 0x230
	EDetailMode MinQualitySetting; // 0x238
	UDecalComponent* _triPlanarDecal; // 0x240
	UObject* _triPlanarDecalClass; // 0x248
	UMaterial* _decalMaterial; // 0x250
};

struct UFloatingPawnMovement {
	float MaxSpeed; // 0x148
	float Acceleration; // 0x14c
	float Deceleration; // 0x150
	float TurningBoost; // 0x154
	char bPositionCorrected : 1; // 0x158
};

struct USourceEffectStereoDelayPreset {
	FSourceEffectStereoDelaySettings Settings; // 0x84
};

struct UAddon_K22Power_10 {
	float _blindnessDuration; // 0x2a8
};

struct UFoliageType_InstancedStaticMesh {
	UStaticMesh* Mesh; // 0x378
	TArray<UMaterialInterface*> OverrideMaterials; // 0x380
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x390
};

struct UTooltipScreenUMG {
	UBaseTooltipWidget* _tooltipWidget; // 0x120
};

struct UUMGAtlantaRequestRoleButton {
	UWidgetSwitcher* IconSwitcher; // 0x430
};

struct UHideInSnowmanInteraction {
	bool _shouldRunOutOfSnowman; // 0x5b0
	bool _isSnowmanShieldDamaged; // 0x5b1
	FDBDTunableRowHandle _timeToEnterSnowman; // 0x5b8
	FDBDTunableRowHandle _minimumTimeToRunAndExit; // 0x5e0
	FDBDTunableRowHandle _cameraZoomBack; // 0x608
	FDBDTunableRowHandle _timeToZoomEnter; // 0x630
	FDBDTunableRowHandle _timeToZoomExit; // 0x658
};

struct UMeshComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x428
	TArray<UMaterialInterface*> BackupMaterials; // 0x438
	char bEnableMaterialParameterCaching : 1; // 0x470
};

struct UAddon_K22Power_21 {
	float _exposedDuration; // 0x2a8
};

struct ULandscapeSplineSegment {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x30
	FInterpCurveVector SplineInfo; // 0x60
	TArray<FLandscapeSplineInterpPoint> Points; // 0x78
	FBox Bounds; // 0x88
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa8
};

struct UMadgrit {
	UCurveFloat* _slashHittingSpeedCurve; // 0x3d0
};

struct USkillCheckPresenter {
	UUserWidget* SkillCheckWidgetClass; // 0x108
};

struct UAISkill_InteractionTeleportEthereal_Nightmare {
	float TeleportIfPathLengthSavedAboveRange; // 0x1d8
	AGenerator* _toGenerator; // 0x1e0
};

struct UGizmoComponentHitTarget {
	UPrimitiveComponent* Component; // 0x38
};

struct UUMGMenuEventsBanner {
	UImage* EventsIcon; // 0x470
	UTextBlock* FallbackTitle; // 0x478
};

struct UHexPentimento {
	TSet<FName> _statusEffectNames; // 0x440
	URekindleTotemInteraction* _rekindleInteractionClass; // 0x490
	TArray<ATotem*> _blockedTotems; // 0x498
};

struct USynthSound {
	USynthComponent* OwningSynthComponent; // 0x370
};

struct UGameplayTask_SpawnActor {
	FMulticastInlineDelegate success; // 0x70
	FMulticastInlineDelegate DidNotSpawn; // 0x80
	AActor* ClassToSpawn; // 0xa8
};

struct UDistortion {
	float _activationDurations[0x3]; // 0x3d0
	bool _auraBlockIsActive; // 0x3dc
};

struct UAISkill_FindCollectable_SupplyCrate {
	FAITunableParameter UrgencyGoalWeight; // 0x138
};

struct UMovieSceneFloatSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct UDBDBlackboardComponent {
	TMap<UObject*, FMindFocusObjectEntry> _mindFocusEntries; // 0x1c0
	TMap<FGameplayTag, FVector> _pinLocations; // 0x210
	TMap<FGameplayTag, UObject*> _pinObjects; // 0x260
	TMap<UObject*, float> _lostMindFocusEntries; // 0x2b0
	TMap<FGameplayTag, FWeightedWishedObjectMapContainer> _objectWishListMap; // 0x300
	TSet<UObject*> _discoveredObjects; // 0x350
	TSet<UObject*> _intentionValidators; // 0x3a0
};

struct UMaterialExpressionArccosineFast {
	FExpressionInput Input; // 0x48
};

struct UAlignObjectsTool {
	UAlignObjectsToolProperties* AlignProps; // 0xa0
};

struct UGPUCullingInstancedStaticMeshComponent {
	TArray<UMaterialInterface*> MaterialOverrides; // 0x5b0
};

struct UCoreEndGameCollapseProgressWidget {
	UProgressBar* ProgressBar; // 0x2d8
	UCanvasPanel* MarkerLeftCanvas; // 0x2e0
	UCanvasPanel* MarkerRightCanvas; // 0x2e8
	UHorizontalBoxSlot* _markerLeftBox; // 0x2f0
	UHorizontalBoxSlot* _markerRightBox; // 0x2f8
};

struct USoundNodeDoppler {
	float DopplerIntensity; // 0x50
	bool bUseSmoothing; // 0x54
	float SmoothingInterpSpeed; // 0x58
};

struct UInstancedStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x4e8
	int32_t NumCustomDataFloats; // 0x4f8
	TArray<float> PerInstanceSMCustomData; // 0x500
	int32_t InstancingRandomSeed; // 0x510
	int32_t InstanceStartCullDistance; // 0x514
	int32_t InstanceEndCullDistance; // 0x518
	TArray<int32_t> InstanceReorderTable; // 0x520
	int32_t NumPendingLightmaps; // 0x578
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x580
};

struct UAudioCurveSourceComponent {
	FName CurveSourceBindingName; // 0x800
	float CurveSyncOffset; // 0x80c
};

struct ULoudNoiseHUDIndicator {
	UStaticMesh* MaskMesh; // 0x210
	UStaticMesh* DistortionMesh; // 0x218
	float EdgePadding; // 0x220
	float CornerRoundness; // 0x224
	float ScreenFadeOutDistance; // 0x228
	FMulticastInlineDelegate LoudNoiseAddedEvent; // 0x230
	TArray<FLoudNoiseIndicatorData> _trackedNoises; // 0x270
};

struct UPathFollowingComponent {
	UNavMovementComponent* MovementComp; // 0xf0
	ANavigationData* MyNavData; // 0x100
};

struct APhantomTrap {
	UTerrorRadiusEmitterComponent* _terrorRadiusEmitter; // 0x328
	float _lineOfSightTraceMinInterval; // 0x330
};

struct UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderFloatValue GridSize; // 0x88
	FAIDataProviderFloatValue SpaceBetween; // 0xc8
	UEnvQueryContext* GenerateAround; // 0x108
};

struct ADBDPlayerControllerBase {
	ADBDPlayer* _mainCharacter; // 0x628
};

struct UBTService_StimuliMonitor_Camper {
	FBlackboardKeySelector BBTerrorPressure; // 0x190
	FBlackboardKeySelector BBIsFleeing; // 0x1c0
	float LastValidTerrorRadiusStimulusMemoryLifeTime; // 0x1f0
};

struct UMaterialExpressionCollectionParameter {
	UMaterialParameterCollection* Collection; // 0x48
	FName ParameterName; // 0x50
	FGuid ParameterId; // 0x5c
};

struct UTextureRenderTargetCube {
	int32_t SizeX; // 0xc8
	FLinearColor ClearColor; // 0xcc
	EPixelFormat OverrideFormat; // 0xdc
	char bHDR : 1; // 0xdd
	char bForceLinearGamma : 1; // 0xdd
};

struct USoundNodeOscillator {
	char bModulateVolume : 1; // 0x50
	char bModulatePitch : 1; // 0x50
	float AmplitudeMin; // 0x54
	float AmplitudeMax; // 0x58
	float FrequencyMin; // 0x5c
	float FrequencyMax; // 0x60
	float OffsetMin; // 0x64
	float OffsetMax; // 0x68
	float CenterMin; // 0x6c
	float CenterMax; // 0x70
};

struct UPositionLagCompensationComponent {
	float _maxExtrapolationDurationInSeconds; // 0xb8
	float _maxInterpolationToServerMoveInSeconds; // 0xbc
};

struct UQosEvaluator {
	bool bInProgress; // 0x50
	bool bCancelOperation; // 0x51
	TArray<FDatacenterQosInstance> Datacenters; // 0x58
};

struct UPalletPulldownBlockerComponent {
	bool _isPalletPulldownBlockedByEntity; // 0x160
	float _blockedDisappearFxTime; // 0x164
};

struct UUMGAtlantaMatchConfigPageScrollItem {
	UCanvasPanel* ImagePanel; // 0x430
	UCanvasPanel* DefaultPanel; // 0x438
	UImage* DefaultImage; // 0x440
	float _unselectedOpacity; // 0x448
	float _selectedOpacity; // 0x44c
};

struct ANavLinkProxy_DirectMove {
	TArray<FVector> CustomPathPoints; // 0x2f0
	float MoveToPathPointTimeLimit; // 0x300
	TMap<ADBDPlayer*, UNavMovePath*> _playersOnPath; // 0x308
};

struct UStereoLayerShapeEquirect {
	FBox2D LeftUVRect; // 0x30
	FBox2D RightUVRect; // 0x44
	FVector2D LeftScale; // 0x58
	FVector2D RightScale; // 0x60
	FVector2D LeftBias; // 0x68
	FVector2D RightBias; // 0x70
};

struct UCharacterPositionRecorderComponent {
	float _cacheTimespan; // 0xb8
};

struct UMasterAudioSubmixCaptureProtocol {
	FString Filename; // 0x60
};

struct ADecalActor {
	UDecalComponent* Decal; // 0x230
};

struct UMaterialExpressionBentNormalCustomOutput {
	FExpressionInput Input; // 0x48
};

struct ULocationServicesImpl {
	FMulticastInlineDelegate OnLocationChanged; // 0x30
};

struct UDefaultObjectPlacementValidationStrategy {
	FVector _objectPlacementRaycastStart; // 0xb8
	FVector _objectPlacementRaycastEnd; // 0xc4
	FFloatRange _objectHeightRangeAroundBaseLocation; // 0xd0
};

struct UGestureInteractionDefinition {
	EGestureID _gestureID; // 0x5b0
};

struct UBTTask_RunBehavior {
	UBehaviorTree* BehaviorAsset; // 0x78
};

struct UBTTask_WaitBlackboardTime {
	FBlackboardKeySelector BlackboardKey; // 0x80
};

struct UDBDProjectileMovementComponent {
	FMulticastInlineDelegate OnComponentToSweepCollisionBP; // 0x1f8
	TArray<FComponentSweepInfo> _componentsToSweep; // 0x220
	FVector _previousPosition; // 0x230
	USceneComponent* _cachedUpdatedComponent; // 0x240
	FVector _initialLocation; // 0x248
	float _distanceTravelled; // 0x254
	bool _hasMaximumDistance; // 0x258
	float _maximumTravelDistance; // 0x25c
};

struct UPrisonChainAddon {
	FDBDTunableRowHandle _maxTensionCharge; // 0x298
	float _tensionChargeModifier; // 0x2c0
};

struct UScrollBoxWidgetStyle {
	FScrollBoxStyle ScrollBoxStyle; // 0x38
};

struct URemeshMeshToolProperties {
	int32_t TargetTriangleCount; // 0x68
	ERemeshSmoothingType SmoothingType; // 0x6c
	int32_t RemeshIterations; // 0x70
	bool bDiscardAttributes; // 0x74
	bool bShowWireframe; // 0x75
	bool bShowGroupColors; // 0x76
	bool bUseTargetEdgeLength; // 0x77
	float TargetEdgeLength; // 0x78
	bool bReproject; // 0x7c
};

struct UDBDAttack {
	EAttackType _attackType; // 0xd0
	bool _useMontage; // 0xd1
	EDetectionZone _damageZone; // 0xd2
	EDetectionZone _lockZone; // 0xd3
	EDetectionZone _obstructionZone; // 0xd4
	FStatProperty _maxAccelerationMultiplier; // 0xd8
	FDBDAttackTargetTracker _targetTracker; // 0x160
	TMap<EAttackSubstate, UDBDAttackSubstate*> _stateClasses; // 0x218
	TArray<ACharacter*> _localAlreadyHitTargets; // 0x268
	TMap<EAttackSubstate, UDBDAttackSubstate*> _states; // 0x288
	TArray<ADBDPlayer*> _hitTargets; // 0x2f8
	TSet<ADBDPlayer*> _targetsAwaitingServerValidation; // 0x308
	EHitValidatorConfigName _hitValidationConfigName; // 0x35c
};

struct UPlayerGameRelevancyComponent {
	FTagStateBool _isRelevantToGameplay; // 0xb8
};

struct UAkCheckBox {
	ECheckBoxState CheckedState; // 0x4d8
	FDelegate CheckedStateDelegate; // 0x4dc
	FCheckBoxStyle WidgetStyle; // 0x4f0
	EHorizontalAlignment HorizontalAlignment; // 0xad0
	bool IsFocusable; // 0xad1
	FAkBoolPropertyToControl ThePropertyToControl; // 0xad8
	FAkWwiseItemToControl ItemToControl; // 0xae8
	FMulticastInlineDelegate AkOnCheckStateChanged; // 0xb28
	FMulticastInlineDelegate OnItemDropped; // 0xb38
	FMulticastInlineDelegate OnPropertyDropped; // 0xb48
};

struct ATormentAttackTrailPoint {
	FDBDTunableRowHandle _attackPointDelayToEnableCollision; // 0x360
};

struct USphereComponent {
	float SphereRadius; // 0x440
};

struct USocialToolkit {
	USocialUser* LocalUser; // 0x68
	TArray<USocialUser*> AllUsers; // 0x70
	ULocalPlayer* LocalPlayerOwner; // 0xd0
	USocialChatManager* SocialChatManager; // 0xd8
};

struct UAsyncActionLoadPrimaryAssetClassList {
	FMulticastInlineDelegate COMPLETED; // 0x80
};

struct UCheckBoxStyleAsset {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UVectorField {
	FBox Bounds; // 0x30
	float Intensity; // 0x4c
};

struct UNiagaraDataInterfaceParticleRead {
	FString EmitterName; // 0x38
};

struct UUMGAtlantaNavigationScreen {
	UUMGBankAndPlayerInfoWidget* BankAndPlayerInfoWidget; // 0x300
	UTextBlock* TextButtonStart; // 0x308
	ESlateVisibility PlayModeSelectionVisibility; // 0x310
	ESlateVisibility CharacterInfoVisibility; // 0x311
	ESlateVisibility BackButtonVisibility; // 0x312
	ESlateVisibility MenuButtonsVisibility; // 0x313
	ESlateVisibility ButtonRoleVisibility; // 0x314
	UButton* ButtonRole; // 0x318
	UWidgetSwitcher* BottomRightWidgetSwitcher; // 0x320
	UUMGPartySlotsWidget* PartyPlayerSlots; // 0x328
	UUMGBaseCountdownWidget* PartyCountdownLarge; // 0x330
	TArray<FPartyMemberUIData> _partyMembers; // 0x338
};

struct UMaterialExpressionAbs {
	FExpressionInput Input; // 0x48
};

struct UCDNPatchManager {
	FString InstallDirectory; // 0x30
	int32_t PakOrder; // 0x40
	FString PakMountPoint; // 0x48
	TWeakObjectPtr<UGameInstance> _gameInstance; // 0xa0
	UAtlantaPendingContent* _currentContentToInstall; // 0x198
	TArray<FString> _remainingManifestsToInstall; // 0x1a0
	TMap<FString, UAtlantaPendingContent*> _contentToInstall; // 0x1b0
	UAtlantaPendingContent* _MobilePendingContent; // 0x248
};

struct UTimeSynchronizableMediaSource {
	bool bUseTimeSynchronization; // 0x98
	int32_t FrameDelay; // 0x9c
	double TimeDelay; // 0xa0
};

struct UCrowdFollowingComponent {
	UCharacterMovementComponent* CharacterMovement; // 0x268
	FVector CrowdAgentMoveDirection; // 0x270
};

struct UAnimSharingStateInstance {
	UAnimSequence* AnimationToPlay; // 0x270
	float PermutationTimeOffset; // 0x278
	float playRate; // 0x27c
	bool bStateBool; // 0x280
	UAnimSharingInstance* Instance; // 0x288
};

struct UAISkill_InteractionTeleportEthereal_Demogorgon {
	float MaxRangeFromFirstPortal; // 0x1d8
	ADemogorgonPortal* _firstPortal; // 0x1e0
	ADemogorgonPortal* _secondPortal; // 0x1e8
};

struct UMaterialExpressionTangent {
	FExpressionInput Input; // 0x48
	float Period; // 0x64
};

struct UPathBuilder_EvadeLoop {
	float AddDistanceToRequiredEvadeGap; // 0x50
	float ForceEvadePointUnderDistance; // 0x54
	float ChaserCrossingEvadeTimePenalty; // 0x58
	float SwapPathReachTimeBuffer; // 0x5c
	FString BreakPalletInteractionId; // 0x60
	float OnPathRadius; // 0x70
	float MaxEvadeInteractableWeightDistance; // 0x74
	float WeightAtMaxDistance; // 0x78
	bool MaxWeightAtNearestDistanceIfHostileHasRangedAbility; // 0x7c
	float WeightAtMaxSafety; // 0x80
	float MaxNearAllyPenaltyPathPointDistance; // 0x84
	float WeightWhenNearAlly; // 0x88
	UNavMovePath* _originalEvadeLoopWorkPath; // 0x90
	UNavMovePath* _querierWorkPathA; // 0x98
	UNavMovePath* _querierWorkPathB; // 0xa0
	UNavMovePath* _chaserWorkPath; // 0xa8
	UDBDNavEvadeLoopComponent* _pickedEvadeLoopComponent; // 0xb0
};

struct UUMGPartyCountdownWidget {
	UButton* UnreadyButton; // 0x368
	UCanvasPanel* UnreadyButtonContainer; // 0x370
};

struct US29P03 {
	float _recoverSpeedPercentage[0x3]; // 0x488
};

struct UMaterialExpressionAtmosphericFogColor {
	FExpressionInput WorldPosition; // 0x48
};

struct UDBDEmblem_KillerGatekeeperTest {
	ADBDGameState* _gameState; // 0x138
};

struct UAnimNotify_PlayMontageNotify {
	FName NotifyName; // 0x40
};

struct UAkSettingsPerUser {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x30
	FFilePath WwiseMacInstallationPath; // 0x40
	FString WaapiIPAddress; // 0x50
	uint32_t WaapiPort; // 0x60
	bool AutoSyncSelection; // 0x64
	bool SoundDataGenerationSkipLanguage; // 0x66
};

struct UBlinkerComponent {
	float _rayCastZOffet; // 0xb8
	float _rayCastLength; // 0xbc
	float _minimumIndicatorVelocity; // 0xc0
	float _IndicatorVelocityEasingFactor; // 0xc4
	FVector _lineOfSightBlinkOffset; // 0xc8
	UDBDTimerComponent* _blinkChainTimer; // 0xe0
};

struct URendererOverrideSettings {
	char bSupportAllShaderPermutations : 1; // 0x48
	char bForceRecomputeTangents : 1; // 0x48
};

struct UParticleModuleVectorFieldGlobal {
	char bOverrideGlobalVectorFieldTightness : 1; // 0x38
	float GlobalVectorFieldScale; // 0x3c
	float GlobalVectorFieldTightness; // 0x40
};

struct USoundSourceBus {
	ESourceBusChannels SourceBusChannels; // 0x318
	float SourceBusDuration; // 0x31c
	char bAutoDeactivateWhenSilent : 1; // 0x320
};

struct UMovieSceneSection {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x58
	FMovieSceneEasingSettings Easing; // 0x60
	FMovieSceneFrameRange SectionRange; // 0x98
	FFrameNumber PreRollFrames; // 0xa8
	FFrameNumber PostRollFrames; // 0xac
	int32_t RowIndex; // 0xb0
	int32_t OverlapPriority; // 0xb4
	char bIsActive : 1; // 0xb8
	char bIsLocked : 1; // 0xb8
	float StartTime; // 0xbc
	float EndTime; // 0xc0
	float PrerollTime; // 0xc4
	float PostrollTime; // 0xc8
	char bIsInfinite : 1; // 0xcc
	bool bSupportsInfiniteRange; // 0xd0
	FOptionalMovieSceneBlendType BlendType; // 0xd1
};

struct UCoreInputPromptTextWidget {
	UCoreInputPromptWidget* InputPrompt; // 0x2d8
	UTextBlock* TextField; // 0x2e0
	FKey InputKey; // 0x2e8
	FText Text; // 0x308
};

struct UNiagaraEffectType {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x30
	ENiagaraCullReaction CullReaction; // 0x34
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct ACrowBomb {
	float _innerRadius; // 0x258
	float _outerRadius; // 0x25c
	float _maxTakeoffDelay; // 0x260
	int32_t _numCrows; // 0x264
	int32_t _crowCenterDistance; // 0x268
	int32_t _crowOuterDistance; // 0x26c
	int32_t _eliminationSamples; // 0x270
	float _eliminationStddev; // 0x274
	TSoftClassPtr<UObject> _meshComponentClass; // 0x278
	TArray<UWorldRunawayMeshComponent*> _crows; // 0x2a8
	USceneComponent* _root; // 0x2d0
	USceneComponent* _traceStart; // 0x2d8
	USceneComponent* _traceEnd; // 0x2e0
	bool _landed; // 0x2e8
};

struct UPortalRadiusDetectorComponent {
	TArray<ADemogorgonPortal*> Portals; // 0xb8
	TArray<ADBDPlayer*> _playersInsideRadius; // 0xc8
};

struct UGunslingerAnimInstance {
	bool _isAiming; // 0x5a8
	bool _isAimingWarmup; // 0x5a9
	bool _isAimingCooldown; // 0x5aa
	bool _isAimingReadyToShoot; // 0x5ab
	bool _isFiring; // 0x5ac
	bool _isInMissShotCooldown; // 0x5ad
	bool _isInSuccessShot; // 0x5ae
	bool _isLinked; // 0x5af
	bool _isReeling; // 0x5b0
	bool _isInGunState; // 0x5b1
	float _idleToAimAnimPlayrate; // 0x5b4
	float _aimToIdleAnimPlayrate; // 0x5b8
	float _fireAnimPlayRate; // 0x5bc
	float _missShotCooldownAnimPlayRate; // 0x5c0
	float _successShotAnimPlayRate; // 0x5c4
	UAnimSequence* _idleToAimAnim; // 0x5c8
	UAnimSequence* _aimToIdleAnim; // 0x5d0
	UAnimSequence* _fireAnim; // 0x5d8
	UAnimSequence* _missShotCooldownAnim; // 0x5e0
	UAnimSequence* _successShotAnim; // 0x5e8
	FDBDTunableRowHandle _idleToAimAnimDuration; // 0x5f0
	FDBDTunableRowHandle _aimToIdleAnimDuration; // 0x618
	FDBDTunableRowHandle _fireAnimDuration; // 0x640
	FTunableStat _missShotCooldownAnimDuration; // 0x668
	FDBDTunableRowHandle _successShotAnimDuration; // 0x6e8
};

struct UBlackBox {
	FDBDTunableRowHandle _blockDuration; // 0x298
};

struct UGameplayTask_TimeLimitedExecution {
	FMulticastInlineDelegate OnFinished; // 0x70
	FMulticastInlineDelegate OnTimeExpired; // 0x80
};

struct UUniformScalar {
	float Magnitude; // 0xb8
};

struct UAICharacterRepairGeneratorBehaviourData {
	AGenerator* _generator; // 0x30
	ECharacterMovementTypes _characterMovementType; // 0x38
};

struct UMaterialExpressionRuntimeVirtualTextureOutput {
	FExpressionInput BaseColor; // 0x48
	FExpressionInput Specular; // 0x64
	FExpressionInput Roughness; // 0x80
	FExpressionInput Normal; // 0x9c
	FExpressionInput WorldHeight; // 0xb8
	FExpressionInput Opacity; // 0xd4
	FExpressionInput Mask; // 0xf0
};

struct ULeaderboardQueryCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieSceneCameraAnimSection {
	FMovieSceneCameraAnimSectionData AnimData; // 0xe8
	UCameraAnim* CameraAnim; // 0x108
	float playRate; // 0x110
	float PlayScale; // 0x114
	float BlendInTime; // 0x118
	float BlendOutTime; // 0x11c
	bool bLooping; // 0x120
};

struct UEnvQueryInstanceBlueprintWrapper {
	int32_t QueryID; // 0x38
	UEnvQueryItemType* ItemType; // 0x60
	int32_t OptionIndex; // 0x68
	FMulticastInlineDelegate OnQueryFinishedEvent; // 0x70
};

struct UAsyncTaskDownloadCacheImage {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFail; // 0x48
	FString _url; // 0x58
};

struct UDarkSense {
	float _effectDurationOnGeneratorComplete; // 0x3d0
	float _effectDurationOnFinalGeneratorComplete[0x3]; // 0x3d4
};

struct UEditableText {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FText HintText; // 0x158
	FDelegate HintTextDelegate; // 0x170
	FEditableTextStyle WidgetStyle; // 0x188
	USlateWidgetStyleAsset* Style; // 0x3c0
	USlateBrushAsset* BackgroundImageSelected; // 0x3c8
	USlateBrushAsset* BackgroundImageComposing; // 0x3d0
	USlateBrushAsset* CaretImage; // 0x3d8
	FSlateFontInfo Font; // 0x3e0
	FSlateColor ColorAndOpacity; // 0x438
	bool IsReadOnly; // 0x460
	bool IsPassword; // 0x461
	float MinimumDesiredWidth; // 0x464
	bool IsCaretMovedWhenGainFocus; // 0x468
	bool SelectAllTextWhenFocused; // 0x469
	bool RevertTextOnEscape; // 0x46a
	bool ClearKeyboardFocusOnCommit; // 0x46b
	bool SelectAllTextOnCommit; // 0x46c
	bool AllowContextMenu; // 0x46d
	EVirtualKeyboardType KeyboardType; // 0x46e
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x46f
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x470
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x471
	ETextJustify Justification; // 0x472
	FShapedTextOptions ShapedTextOptions; // 0x473
	FMulticastInlineDelegate OnTextChanged; // 0x478
	FMulticastInlineDelegate OnTextCommitted; // 0x488
};

struct UBlightedSerumCollisionInteraction {
	UBlightedSerumCooldownInteraction* _cooldownInteraction; // 0x5b0
	float _bounceTime; // 0x5b8
};

struct UUMGBloodStoreTimer {
	FSlateColor _normalColor; // 0x310
	FSlateColor _warningColor; // 0x338
	UTextBlock* RemainingTimeTextBlock; // 0x360
	UImage* RefreshImage; // 0x368
};

struct UBTDecorator_HasDynamicSubtree {
	FGameplayTag InjectTag; // 0x70
};

struct UBatchDrawing {
	AActor* _actorToSpawnInstancesInto; // 0x30
	TMap<UStaticMesh*, FPerMeshInstancingData> _meshesToInstancingData; // 0x38
	UHISMMaterialHelperSettings* _hismMaterialHelperSettings; // 0x88
	UMaterialPerThemeSettings* _materialPerThemeSettings; // 0x90
};

struct UTricksterChainedThrowsAddon {
	bool _resetOnEnteringFlurryInteraction; // 0x29c
	float _lacerationPenaltyRangeThreshold; // 0x2a0
	float _closeRangeLacerationPenalty; // 0x2a4
	float _maximumMultiplier; // 0x2a8
};

struct UUMGSuggestionsListTabWidget {
	UUMGExpandableListWidget* PlayedWithFriendsExpandableList; // 0x300
	UUMGExpandableListWidget* SocialFriendsExpandableList; // 0x308
};

struct UTutorialNotificationController {
	FMulticastInlineDelegate OnBlockingNotificationDismissedEvent; // 0x30
};

struct UUMGCustomizationPageScrollWidget {
	TSoftClassPtr<UObject> _customizationItemWidgetClass; // 0x448
	TArray<FStoreItemSlotData> _availableItemsData; // 0x478
	TArray<UUMGCustomizationItemWidget*> _itemWidgets; // 0x488
};

struct URichTextBlockImageSharedSizeDecorator {
	int32_t Width; // 0x38
	int32_t Height; // 0x3c
};

struct UMaterialExpressionDesaturation {
	FExpressionInput Input; // 0x48
	FExpressionInput Fraction; // 0x64
	FLinearColor LuminanceFactors; // 0x80
};

struct UK26SpawnCrowProjectileChargeableInteractionDefinition {
	FMulticastInlineDelegate OnChargingStarted; // 0x6d8
	FMulticastInlineDelegate OnChargingStopped; // 0x6e8
	FMulticastInlineDelegate OnProjectileSummoned; // 0x6f8
	FDBDTunableRowHandle _chargeCooldownTime; // 0x708
	FDBDTunableRowHandle _summonCooldownTime; // 0x730
	FDBDTunableRowHandle _pathLength; // 0x758
	FDBDTunableRowHandle _projectileHeight; // 0x780
	FDBDTunableRowHandle _projectileSummonDistance; // 0x7a8
	FDBDTunableRowHandle _cooldownGracePeriodPercentage; // 0x7d0
	FDBDTunableRowHandle _globalSpawnCooldownTime; // 0x7f8
	FDBDTunableRowHandle _pathDistanceCheckAttempts; // 0x820
	AK26AimingGuide* _aimingGuideClass; // 0x848
	AK26AimingGuide* _local_aimingGuide; // 0x850
	bool _isConfirmButtonPressed; // 0x858
	UK26AmmoHandlerComponent* _ammoHandler; // 0x860
	UK26PathHandlerComponent* _pathHandler; // 0x868
	UK26PowerStatusHandlerComponent* _statusHandler; // 0x870
	bool _firedFullyChargedEvent; // 0x878
	bool _isWaitingForSummonAcknowledgement; // 0x879
	UCurveFloat* _globalCooldownMovementSpeedCurve; // 0x880
};

struct UDBDEasyAntiCheat {
	UDBDGameInstance* _gameInstance; // 0x48
	bool _connectedToServer; // 0x50
};

struct UAkLuminInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
};

struct AStreamVideoPlayer {
	UMediaPlayer* MediaPlayer; // 0x250
	UMediaSoundComponent* SoundComponent; // 0x258
	UUMGStreamVideoWidget* StreamVideoWidget; // 0x260
	UStreamMediaSource* StreamMediaSource; // 0x268
	UAudioComponent* _audioComponent; // 0x270
};

struct UUMGAtlStorePriceWidget {
	UTextBlock* PriceText; // 0x300
};

struct ARifleChain {
	FMulticastInlineDelegate OnProjectileSet; // 0x230
	FMulticastInlineDelegate OnIsCollidingChanged; // 0x240
	UAkComponent* _chainCenterAkComponent; // 0x250
	UAkAudioEvent* _collisionLoopStartEvent; // 0x258
	UAkAudioEvent* _collisionLoopEndEvent; // 0x260
	TArray<FAkSoundLoop> _collisionSoundLoops; // 0x268
	float _sphereTraceRadius; // 0x278
	float _timeBetweenTrace; // 0x27c
	TScriptInterface<IGunslingerHarpoon> _harpoon; // 0x280
};

struct UBTDecorator_KeepInCone {
	float ConeHalfAngle; // 0x70
	FBlackboardKeySelector ConeOrigin; // 0x78
	FBlackboardKeySelector Observed; // 0xa8
	char bUseSelfAsOrigin : 1; // 0xd8
	char bUseSelfAsObserved : 1; // 0xd8
};

struct UIridescentCoinAddon {
	UStatusEffect* _exposedStatusEffect; // 0x298
};

struct UInterpTrackInstVectorMaterialParam {
	TArray<UMaterialInstanceDynamic*> materialInstances; // 0x30
	TArray<FVector> ResetVectors; // 0x40
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x50
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x60
};

struct UPlatformEventsComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb8
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc8
};

struct UEditorMeshVisualization {
	TSoftObjectPtr<USkeletalMesh> MeshVisualization; // 0x210
	FTransform RelativeTransform; // 0x240
};

struct UParticleModuleRotationRateMultiplyLife {
	FRawDistributionFloat LifeMultiplier; // 0x38
};

struct UAnimSharingTransitionInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x270
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x278
	float BlendTime; // 0x280
	bool bBlendBool; // 0x284
};

struct UHudPresenter {
	ADBDPlayer* _presentedCharacter; // 0xe0
	ADBDPlayer* _pendingCharacter; // 0xe8
	ADBDSpectator* _spectatorPawn; // 0xf0
};

struct UCoreBaseLoadoutPartWidget {
	UDBDImage* ImageRarity; // 0x260
	UDBDImage* ImageIcon; // 0x268
	UTextBlock* TextStackCount; // 0x270
};

struct APaperCharacter {
	UPaperFlipbookComponent* Sprite; // 0x4d0
};

struct UAuthoritativeMovementComponent {
	TArray<ACharacter*> _charactersToPush; // 0xc8
	TArray<ACharacter*> _stopIgnoreCharacterOnEndOverlap; // 0xd8
	UCapsuleComponent* _pawnDetector; // 0xf0
	TArray<ACharacter*> _authoritativeIgnoreOverlapCharacters; // 0xf8
	TArray<ACharacter*> _previousAuthoritativeIgnoreOverlapCharacters; // 0x108
};

struct UUMGTallyEmblemMarker {
	UImage* QualityImage; // 0x300
	TMap<EEmblemQuality, FEmblemQualityImages> _qualityImages; // 0x308
};

struct UCoreCursor {
	UScaleBox* CursorScaleBox; // 0x260
};

struct USourceEffectFilterPreset {
	FSourceEffectFilterSettings Settings; // 0x7c
};

struct UDBDAIGoalComponent {
	TMap<UObject*, FAIGoal> _activeGoals; // 0xc0
	TMap<UObject*, FAIGoalWeightContainer> _foundWeightedGoals; // 0x110
};

struct UARTrackableNotifyComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb8
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc8
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd8
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe8
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf8
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x108
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x118
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x128
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x138
	FMulticastInlineDelegate OnAddTrackedImage; // 0x148
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x158
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x168
	FMulticastInlineDelegate OnAddTrackedFace; // 0x178
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x188
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x198
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a8
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b8
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c8
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d8
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e8
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f8
};

struct AFootSteps {
	float _raycastHalfAngle; // 0x234
	float _raycastZOffset; // 0x238
	float _raycastDistance; // 0x23c
	UMaterial* _material; // 0x240
	float _minimumDecalSize; // 0x248
	float _maximumDecalSize; // 0x24c
	float _projectionTickness; // 0x250
	float _visibilityMultiplierInterpSpeed; // 0x254
	UCurveFloat* _fadeCurve; // 0x258
	UCurveFloat* _veinsCurve; // 0x260
	FBHVRPerDetailModeInt _decalPoolSize; // 0x268
	FBHVRPerDetailModeFloat _recycleThresholdPercentage; // 0x308
	FBHVRPerDetailModeFloat _recycleDistancePercentage; // 0x3a8
	FBHVRPerDetailModeInt _maxOverlapping; // 0x448
	TMap<UDBDDecalComponent*, FFootStep> _footSteps; // 0x4e8
	UDecalSpawner* _decalSpawner; // 0x538
};

struct UDBDTextDesignTunables {
	FString creditsHtml; // 0x30
	FText LegalTextTitle; // 0x40
	FText LegalText; // 0x58
	FText ConsentTextTitle; // 0x70
	FText ConsentText; // 0x88
	FText LegalTextSIEA; // 0xa0
	FText LegalTextSIEE; // 0xb8
	FText SystemMessage_ChatDisconnected; // 0xd0
	FText SystemMessage_ChatReturnedToLobby; // 0xe8
	FText SystemMessage_ChatMatchServerClosed; // 0x100
};

struct UUMGLobbyJoinedWidget {
	bool LocalPlayerIsSlasher; // 0x300
	FText TextLeaveLobby; // 0x308
	FText TextPlayerNotReadyYet; // 0x320
	FText TextWaitingPlayers; // 0x338
	FText TextToBeReady; // 0x350
	UHorizontalBox* CommandButtonsContainer; // 0x368
};

struct USceneComponentPointProvider {
	FComponentReference _sceneReference; // 0x30
	USceneComponent* _sceneComponent; // 0x60
};

struct UObjectReferencer {
	TArray<UObject*> ReferencedObjects; // 0x30
};

struct UPerkSelectionSlotWidget {
	UTextBlock* PerkName; // 0x300
	UTextBlock* TextChoose; // 0x308
	UPerkActionButton* PerkActionButton; // 0x310
	UImage* SelectedIcon; // 0x318
	UUMGHtmlRichText* DescriptionText; // 0x320
	UImage* PictureBackground; // 0x328
	UImage* PicturePerkBackground; // 0x330
	UImage* PictureHighlightFrame; // 0x338
	UImage* PictureTopRightBackground; // 0x340
	UImage* PictureTopRightFrame; // 0x348
	float HighOpacity; // 0x350
	float LowOpacity; // 0x354
	float PerkBackgroundLowOpacity; // 0x358
	float DescriptionBackgroundLowOpacity; // 0x35c
};

struct UAkMacInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xc0
};

struct UPreviewMesh {
	bool bBuildSpatialDataStructure; // 0x48
	bool bDrawOnTop; // 0x49
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0x58
};

struct UNotModifierCondition {
	UEventDrivenModifierCondition* _condition; // 0xf0
};

struct UDragonsGrip {
	AGenerator* _kickedGenerator; // 0x3d0
	float _activationDuration[0x3]; // 0x3d8
	float _cooldownDuration[0x3]; // 0x3e4
	float _exposedEffectDuration[0x3]; // 0x3f0
	bool _onlyExposeFirstSurvivor; // 0x3fc
	FDBDTunableRowHandle _loudNoiseRange; // 0x408
};

struct UK26CrowProjectileAnimInstance {
	bool _isInInvalidState; // 0x270
	bool _isInSummonState; // 0x271
	bool _isInIdleState; // 0x272
	bool _isInFollowPathState; // 0x273
	bool _isInOffPathState; // 0x274
	bool _isInDestroyedState; // 0x275
	bool _isBeingFlashlighted; // 0x276
	float _flashlightProgress; // 0x278
	AK26CrowProjectile* _owningCrowProjectile; // 0x2a0
};

struct UTriggerableActivatorComponent {
	TSoftClassPtr<UObject> _triggerableClass; // 0xb8
	TArray<UTriggerableWorldObjectComponent*> _triggerables; // 0xe8
};

struct UMeshStatisticsProperties {
	FString Mesh; // 0x58
	FString UV; // 0x68
	FString Attributes; // 0x78
};

struct UParticleModuleRequired {
	UMaterialInterface* Material; // 0x38
	float MinFacingCameraBlendDistance; // 0x40
	float MaxFacingCameraBlendDistance; // 0x44
	FVector EmitterOrigin; // 0x48
	FRotator EmitterRotation; // 0x54
	EParticleScreenAlignment ScreenAlignment; // 0x60
	char bUseLocalSpace : 1; // 0x61
	char bKillOnDeactivate : 1; // 0x61
	char bKillOnCompleted : 1; // 0x61
	EParticleSortMode SortMode; // 0x62
	char bUseLegacyEmitterTime : 1; // 0x63
	char bRemoveHMDRoll : 1; // 0x63
	char bEmitterDurationUseRange : 1; // 0x63
	float EmitterDuration; // 0x64
	FRawDistributionFloat SpawnRate; // 0x68
	TArray<FParticleBurst> BurstList; // 0x98
	float EmitterDelay; // 0xa8
	float EmitterDelayLow; // 0xac
	char bDelayFirstLoopOnly : 1; // 0xb0
	EParticleSubUVInterpMethod InterpolationMethod; // 0xb1
	char bScaleUV : 1; // 0xb2
	char bEmitterDelayUseRange : 1; // 0xb2
	EParticleBurstMethod ParticleBurstMethod; // 0xb3
	char bOverrideSystemMacroUV : 1; // 0xb4
	char bUseMaxDrawCount : 1; // 0xb4
	EOpacitySourceMode OpacitySourceMode; // 0xb5
	EEmitterNormalsMode EmitterNormalsMode; // 0xb6
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xb7
	int32_t SubImages_Horizontal; // 0xb8
	int32_t SubImages_Vertical; // 0xbc
	float RandomImageTime; // 0xc0
	int32_t RandomImageChanges; // 0xc4
	FVector MacroUVPosition; // 0xc8
	float MacroUVRadius; // 0xd4
	EParticleUVFlipMode UVFlippingMode; // 0xd8
	ESubUVBoundingVertexCount BoundingMode; // 0xd9
	char bDurationRecalcEachLoop : 1; // 0xda
	FVector NormalsSphereCenter; // 0xdc
	float AlphaThreshold; // 0xe8
	int32_t EmitterLoops; // 0xec
	UTexture2D* CutoutTexture; // 0xf0
	int32_t MaxDrawCount; // 0xf8
	float EmitterDurationLow; // 0xfc
	FVector NormalsCylinderDirection; // 0x100
	TArray<FName> NamedMaterialOverrides; // 0x110
};

struct UTwinJumpTargetVisibleEffect {
	AActor* _twinJumpTargetObject; // 0x350
	AActor* _twinJumpTarget; // 0x358
	USelectiveVisibilityComponent* _jumpTargetVisibility; // 0x360
};

struct UTireType {
	float FrictionScale; // 0x38
};

struct UUMGMonthlyPassRewardsPopup {
	UTextBlock* SubscriptionLabel; // 0x3e8
	UTextBlock* TitleLabel; // 0x3f0
	UImage* SubscriptionIcon; // 0x3f8
	UTextBlock* RenewalDateLabel; // 0x400
	UHorizontalBox* RewardsContainer; // 0x408
	TSoftClassPtr<UObject> RewardWidgetClass; // 0x410
	FMargin _rewardsPadding; // 0x440
};

struct USnowmanAnimInstance {
	bool _isIdle; // 0x270
	bool _isBeingEntered; // 0x271
	bool _isControlled; // 0x272
	bool _isDestroyed; // 0x273
	bool _isBeingDestroyedDueToSurvivorRunExit; // 0x274
	bool _isBeingDestroyedDueToKillerAttackWhileControlled; // 0x275
	bool _isBeingDestroyedDueToKillerAttackWhileEmpty; // 0x276
	bool _isSurvivorUsingSnowmanMoving; // 0x277
	TWeakObjectPtr<ASnowman> _snowman; // 0x27c
	TWeakObjectPtr<ACamperPlayer> _survivorUsingSnowman; // 0x284
};

struct UMovieSceneBindingOverrides {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x30
};

struct UAkSettings {
	char MaxSimultaneousReverbVolumes; // 0x30
	FFilePath WwiseProjectPath; // 0x38
	FDirectoryPath WwiseSoundDataFolder; // 0x48
	bool bAutoConnectToWAAPI; // 0x58
	ECollisionChannel DefaultOcclusionCollisionChannel; // 0x59
	TMap<TSoftObjectPtr<UPhysicalMaterial>, FAkGeometrySurfacePropertiesToMap> AkGeometryMap; // 0x60
	bool SplitSwitchContainerMedia; // 0xb0
	bool UseEventBasedPackaging; // 0xb1
	bool EnableAutomaticAssetSynchronization; // 0xb2
	FString CommandletCommitMessage; // 0xb8
	TMap<FString, FString> UnrealCultureToWwiseCulture; // 0xc8
	bool AskedToUseNewAssetManagement; // 0x118
	bool bEnableMultiCoreRendering; // 0x119
	bool MigratedEnableMultiCoreRendering; // 0x11a
	bool FixupRedirectorsDuringMigration; // 0x11b
	FDirectoryPath WwiseWindowsInstallationPath; // 0x120
	FFilePath WwiseMacInstallationPath; // 0x130
};

struct ULandscapeSettings {
	int32_t MaxNumberOfLayers; // 0x48
};

struct USkeleton {
	TArray<FBoneNode> BoneTree; // 0x40
	TArray<FTransform> RefLocalPoses; // 0x50
	FGuid VirtualBoneGuid; // 0x178
	TArray<FVirtualBone> VirtualBones; // 0x188
	TArray<USkeletalMeshSocket*> Sockets; // 0x198
	FSmartNameContainer SmartNames; // 0x1f8
	TArray<UBlendProfile*> BlendProfiles; // 0x278
	TArray<FAnimSlotGroup> SlotGroups; // 0x288
	TArray<UAssetUserData*> AssetUserData; // 0x360
};

struct UAnimNotify_PlayParticleEffect {
	UParticleSystem* PSTemplate; // 0x40
	FVector LocationOffset; // 0x48
	FRotator RotationOffset; // 0x54
	FVector Scale; // 0x60
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct APaperTerrainActor {
	USceneComponent* DummyRoot; // 0x230
	UPaperTerrainSplineComponent* SplineComponent; // 0x238
	UPaperTerrainComponent* RenderComponent; // 0x240
};

struct UEditableGameplayTagQueryExpression_AllExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x30
};

struct UParticleLODLevel {
	int32_t Level; // 0x30
	char bEnabled : 1; // 0x34
	UParticleModuleRequired* RequiredModule; // 0x38
	TArray<UParticleModule*> Modules; // 0x40
	UParticleModuleTypeDataBase* TypeDataModule; // 0x50
	UParticleModuleSpawn* SpawnModule; // 0x58
	UParticleModuleEventGenerator* EventGenerator; // 0x60
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x68
	TArray<UParticleModule*> SpawnModules; // 0x78
	TArray<UParticleModule*> UpdateModules; // 0x88
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x98
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa8
	char ConvertedModules : 1; // 0xb8
	int32_t PeakActiveParticles; // 0xbc
};

struct UDBDSpringArmComponent {
	char bEnableComponentwiseCameraLag : 1; // 0x2a0
	FVector ComponenwiseCameraLagSpeed; // 0x2a4
	float TargetArmMinLength; // 0x2b0
	char bEnableDistanceCameraLag : 1; // 0x2b4
	float CameraDistanceLagSpeed; // 0x2b8
	char bDrawDebugTraceMarkers : 1; // 0x2c0
	TArray<TWeakObjectPtr<AActor>> ignoreActors; // 0x2c8
};

struct UDatasmithCineCameraActorTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x38
};

struct UAtlantaRitualsScreen {
	UUMGAtlantaRitualsScreen* _umgScreen; // 0x120
};

struct UCameraHandlerComponent {
	FMulticastInlineDelegate OnSocketChanged; // 0xb8
	TMap<EDBDCameraSocketID, AActor*> _cameraMap; // 0xd0
	EDBDCameraSocketID _delayedSocketID; // 0x120
	EDBDCameraSocketID _currentSocketID; // 0x121
	bool _manualZoomAllowPerkModifiers; // 0x169
	UCurveFloat* _manualZoomCurveFloat; // 0x170
	FName _cameraAttachmentSocket; // 0x178
	USceneComponent* _cameraAttachmentComponent; // 0x188
	bool _isFOVSystemActive; // 0x198
};

struct UAISkill_FindCollectable {
	int32_t CollectUnderItemCount; // 0x118
	float CollectOverItemChargeRatio; // 0x11c
};

struct UZombieBlindableComponent {
	UGameplayTagContainerComponent* _ownerObjectState; // 0x240
};

struct UGeometryCollectionDebugDrawComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb8
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xc0
};

struct UAISkill_InteractionTarget_TormentMode {
	float ChasedTargetToEvadePointMaxDistance; // 0x220
	float StartTormentInPatrolAboveChargeRatio; // 0x224
	float StartTormentInChaseAboveChargeRatio; // 0x228
};

struct UNiagaraPreviewAxis_InterpParamInt32 {
	int32_t Min; // 0x40
	int32_t Max; // 0x44
};

struct UNavigationPath {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x30
	TArray<FVector> PathPoints; // 0x40
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x50
};

struct UUMGSubscriptionPackButtonWidget {
	USubscriptionRewardDataAsset* WidgetPerRewardType; // 0x430
	UCanvasPanel* ButtonPressedVFX; // 0x438
	UCanvasPanel* PricePanel; // 0x440
	UImage* TitleIcon; // 0x448
	UTextBlock* Title; // 0x450
	UTextBlock* Price; // 0x458
	UCanvasPanel* RenewalDatePanel; // 0x460
	UTextBlock* RenewalDateText; // 0x468
	UUniformGridPanel* PurchaseRewardsGrid; // 0x470
	UUniformGridPanel* DailyRewardsGrid; // 0x478
	UImage* PortraitBorder; // 0x480
	UButton* InfoButton; // 0x488
	UImage* ActiveBackgroundImage; // 0x490
	UImage* NonActiveBackgroundImage; // 0x498
	FLinearColor ActiveTextColor; // 0x4a0
	FLinearColor NonActiveTextColor; // 0x4b0
	FLinearColor TextColor; // 0x4c0
	FLinearColor ActiveSmokeBackgroundTint; // 0x4d0
	FLinearColor NonActiveSmokeBackgroundTint; // 0x4e0
	UImage* PurchaseRewardsSmokeBackground; // 0x4f0
	UImage* DailyRewardsSmokeBackground; // 0x4f8
	FLinearColor ActiveTitleBackgroundTint; // 0x500
	FLinearColor NonActiveTitleBackgroundTint; // 0x510
	UImage* TitleBackground; // 0x520
	UCanvasPanel* ActiveFrame; // 0x528
	UCanvasPanel* NonActiveFrame; // 0x530
};

struct UMaterialExpressionFeatureLevelSwitch {
	FExpressionInput Default; // 0x48
	FExpressionInput Inputs[0x4]; // 0x64
};

struct UAnySurvivorHasObjectState {
	FGameplayTag _stateTag; // 0x138
};

struct UWrapBoxSlot {
	FMargin Padding; // 0x40
	bool bFillEmptySpace; // 0x50
	float FillSpanWhenLessThan; // 0x54
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UDestroyDemogorgonPortalInteraction {
	ADemogorgonPortal* _owningPortal; // 0x6d8
};

struct UTormentModeCooldownInteraction {
	FDBDTunableRowHandle _tormentModeCooldownTime; // 0x5b0
	FDBDTunableRowHandle _tormentModeCancelWalkSpeed; // 0x5d8
	FDBDTunableRowHandle _normalWalkSpeed; // 0x600
};

struct UMaterialExpressionMapARPassthroughCameraUV {
	FExpressionInput Coordinates; // 0x48
};

struct UKillerInstinctComponent {
	FCustomKillerInstinctData _defaultKillerInstinctAsset; // 0xb8
	UNiagaraComponent* _particleSystemComponent; // 0xe0
	FLinearColor _camperHighlightColorOverride; // 0xec
	TArray<FCustomKillerInstinctData> _customKillerInstinctData; // 0x1a8
	FCustomKillerInstinctData _currentKillerInstinctData; // 0x1b8
};

struct ACineCameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7a0
};

struct UMaterialExpressionSquareRoot {
	FExpressionInput Input; // 0x48
};

struct UInterpTrackVisibility {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x78
	char bFireEventsWhenForwards : 1; // 0x88
	char bFireEventsWhenBackwards : 1; // 0x88
	char bFireEventsWhenJumpingForwards : 1; // 0x88
};

struct UUMGTallyScoreboardPlayerInfoWidget {
	FMulticastInlineDelegate OnTallyScoreboardAddFriendEvent; // 0x358
	FMulticastInlineDelegate OnTallyScoreboardReportEvent; // 0x368
	UImage* ImageHorizontalSeparation; // 0x378
	FTallyPlayerResultData PlayerResultData; // 0x380
	bool LoadoutIsBlocked; // 0x5f8
};

struct UNiagaraSettings {
	TArray<FSoftObjectPath> AdditionalParameterTypes; // 0x48
	TArray<FSoftObjectPath> AdditionalPayloadTypes; // 0x58
	TArray<FSoftObjectPath> AdditionalParameterEnums; // 0x68
	FSoftObjectPath DefaultEffectType; // 0x78
	TArray<FText> QualityLevels; // 0x98
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xa8
};

struct UUMGBloodStoreSubMenu {
	UUMGBloodStoreTimer* SurvivorTimer; // 0x320
	UUMGBloodStoreTimer* KillerTimer; // 0x328
};

struct ULandscapeInfo {
	LazyObjectProperty LandscapeActor; // 0x30
	FGuid LandscapeGuid; // 0x4c
	int32_t ComponentSizeQuads; // 0x5c
	int32_t SubsectionSizeQuads; // 0x60
	int32_t ComponentNumSubsections; // 0x64
	FVector DrawScale; // 0x68
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x118
};

struct UMaterialExpressionSobol {
	FExpressionInput Cell; // 0x48
	FExpressionInput Index; // 0x64
	FExpressionInput Seed; // 0x80
	uint32_t ConstIndex; // 0x9c
	FVector2D ConstSeed; // 0xa0
};

struct USoundNodeAttenuation {
	USoundAttenuation* AttenuationSettings; // 0x50
	FSoundAttenuationSettings AttenuationOverrides; // 0x58
	char bOverrideAttenuation : 1; // 0x3f8
};

struct UProceduralShapeToolProperties {
	bool bInstanceIfPossible; // 0x58
	EMakeMeshShapeType Shape; // 0x5c
	float Width; // 0x60
	float Height; // 0x64
	float FeatureRadius; // 0x68
	int32_t Slices; // 0x6c
	int32_t Subdivisions; // 0x70
	EMakeMeshPolygroupMode PolygroupMode; // 0x74
	EMakeMeshPlacementType PlaceMode; // 0x75
	EMakeMeshPivotLocation PivotLocation; // 0x76
	float Rotation; // 0x78
	bool bAlignShapeToPlacementSurface; // 0x7c
};

struct UParticleModuleEventReceiverSpawn {
	FRawDistributionFloat SpawnCount; // 0x48
	char bUseParticleTime : 1; // 0x78
	char bUsePSysLocation : 1; // 0x78
	char bInheritVelocity : 1; // 0x78
	FRawDistributionVector InheritVelocityScale; // 0x80
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc8
	char bBanPhysicalMaterials : 1; // 0xd8
};

struct USprintBurst {
	float _exhaustionDuration[0x3]; // 0x3d0
	float _sprintDuration; // 0x3dc
	UActivatableExhaustedEffect* _exhaustedEffect; // 0x3e0
};

struct UInGameAdManager {
	char bShouldPauseWhileAdOpen : 1; // 0x40
	TArray<FDelegate> ClickedBannerDelegates; // 0x48
	TArray<FDelegate> ClosedAdDelegates; // 0x58
};

struct UActivePhaseWalkInteraction {
	FTunableStat _fullyChargedSpeed; // 0x6d8
	UCurveFloat* _chargingSpeedCurve; // 0x758
	FDBDTunableRowHandle _phaseWalkPenaltyThreshold; // 0x760
	FDBDTunableRowHandle _phaseWalkPenaltyValue; // 0x788
	FTunableStat _activePhaseWalkChargeDuration; // 0x7b8
	UAnimMontage* _activePhaseWalkChargingMontage; // 0x838
};

struct ADBDPlayerState_Lobby {
	bool IsOwnershipValidated; // 0x770
};

struct UAddon_TheBlight_ConsecutiveDashSpeedBonus {
	float _speedIncreasePerDash; // 0x298
};

struct UMaterialExpressionCeil {
	FExpressionInput Input; // 0x48
};

struct UBlinkComponent {
	FMulticastInlineDelegate OnBlinkStateChangedDelegate; // 0xb8
	bool _isInBlinkingState; // 0xc8
};

struct UUMGLacerationStatusEffectUI {
	UImage* LacerationDecoration; // 0x300
	UImage* LacerationFill; // 0x308
	TArray<int32_t> _maximumLacerationDefinitions; // 0x310
	TArray<UPaperSprite*> _lacerationDecorationImages; // 0x320
	TArray<UTexture2D*> _lacerationFillImages; // 0x330
	FLinearColor _lacerationDefaultColor; // 0x340
	FLinearColor _lacerationFillFullColor; // 0x350
	FName _glassShatterDisintigrateAnimationName; // 0x360
};

struct UInteractionDetectorComponent {
	UPrimitiveComponent* _detectionPrimitive; // 0xb8
	TSet<AInteractable*> _overlappingInteractables; // 0xc0
	TSet<UPrimitiveComponent*> _overlappingPrimitiveComponents; // 0x110
	TSet<AActor*> _ignoredActors; // 0x160
};

struct UGameNetworkManagerSettings {
	int32_t MinDynamicBandwidth; // 0x30
	int32_t MaxDynamicBandwidth; // 0x34
	int32_t TotalNetBandwidth; // 0x38
	int32_t BadPingThreshold; // 0x3c
	char bIsStandbyCheckingEnabled : 1; // 0x40
	float StandbyRxCheatTime; // 0x44
	float StandbyTxCheatTime; // 0x48
	float PercentMissingForRxStandby; // 0x4c
	float PercentMissingForTxStandby; // 0x50
	float PercentForBadPing; // 0x54
	float JoinInProgressStandbyWaitTime; // 0x58
};

struct UOwningPlayerInBoonBlessingRange {
	ATotem* _boundTotem; // 0x100
};

struct USolidarity {
	bool _allowMedkit; // 0x3d0
	UChargeableComponent* _healerHPSlot; // 0x3d8
	UChargeableComponent* _targetHPSlot; // 0x3e0
	UChargeableInteractionDefinition* _healOtherInteraction; // 0x3e8
};

struct UBTTask_GameplayTaskBase {
	char bWaitForGameplayTask : 1; // 0x78
};

struct UDBDGameUserSettings {
	TArray<FInputActionKeyMapping> ActionMappings; // 0x128
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x138
	FMulticastInlineDelegate OnSetCustomizedHudsTimestamp; // 0x148
	FString DeviceLoginTokenID; // 0x158
	int32_t ScalabilityLevel; // 0x168
	bool AutoScalabilitySet; // 0x16c
	bool AutoAdjust; // 0x16d
	int32_t ScreenResolution; // 0x170
	bool FullScreen; // 0x174
	int32_t MenuScaleFactor; // 0x178
	int32_t HudScaleFactor; // 0x17c
	int32_t SkillCheckScaleFactor; // 0x180
	bool LargeText; // 0x184
	bool HUDPlayerNamesVisibility; // 0x185
	bool HUDKillerHookCountVisibility; // 0x186
	bool HUDScoreEventsVisibility; // 0x187
	uint32_t FPSLimit; // 0x188
	int32_t MainVolume; // 0x18c
	bool MainVolumeOn; // 0x190
	int32_t MenuMusicVolume; // 0x194
	bool MenuMusicVolumeOn; // 0x198
	bool UseHeadphones; // 0x199
	bool MuteOnFocusLost; // 0x19a
	int32_t KillerCameraSensitivity; // 0x19c
	int32_t SurvivorCameraSensitivity; // 0x1a0
	int32_t KillerMouseSensitivity; // 0x1a4
	int32_t SurvivorMouseSensitivity; // 0x1a8
	int32_t KillerControllerSensitivity; // 0x1ac
	int32_t SurvivorControllerSensitivity; // 0x1b0
	bool AimAssist; // 0x1b4
	int32_t ControlType; // 0x1b8
	bool InvertY; // 0x1bc
	bool SurvivorInvertY; // 0x1bd
	FString Language; // 0x1c0
	bool LanguageIsDefinedByPlayer; // 0x1d0
	int32_t HighestWeightSeenNews; // 0x1d4
	FSharedAuthenticationTokenInformation SharedLoginInformation; // 0x1d8
	uint32_t LastPanelContextId; // 0x208
	bool ArchivesAutoPlayVoiceOver; // 0x20c
	bool HasAcceptedCrossplayPopup; // 0x20d
	bool HasAcceptedCrossProgressionPopup; // 0x20e
	bool UseAtlantaCustomizedHuds; // 0x20f
	bool UseAtlantaSurvivorQuickTurn; // 0x210
	bool UseAtlantaKillerQuickTurn; // 0x211
	TArray<FAtlantaCustomizedHudSettings> AtlantaCustomizedHuds; // 0x218
	bool ShowPortraitBorder; // 0x230
	FString PartyPrivacyState; // 0x238
	int32_t ColorBlindMode; // 0x290
	int32_t ColorBlindModeIntensity; // 0x294
	bool BeginnerMode; // 0x298
	bool Subtitles; // 0x299
	int32_t SubtitlesBackgroundOpacity; // 0x29c
	int32_t SubtitlesSize; // 0x2e8
};

struct UTextLayoutWidget {
	FShapedTextOptions ShapedTextOptions; // 0x128
	ETextJustify Justification; // 0x12b
	ETextWrappingPolicy WrappingPolicy; // 0x12c
	char AutoWrapText : 1; // 0x12d
	float WrapTextAt; // 0x130
	FMargin Margin; // 0x134
	float LineHeightPercentage; // 0x144
};

struct UGridPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x260
};

struct UParticleModuleColor {
	FRawDistributionVector StartColor; // 0x38
	FRawDistributionFloat StartAlpha; // 0x80
	char bClampAlpha : 1; // 0xb0
};

struct UMaterialExpressionParticleSubUV {
	char bBlend : 1; // 0x108
};

struct UAISkill_InteractionTarget_ThrowAntidote {
	float _minPathLengthForThrow; // 0x298
	float _minThrowDistance; // 0x29c
	float _cooldownTime; // 0x2a0
};

struct ULiveLinkCurveRemapSettings {
	FLiveLinkCurveConversionSettings CurveConversionSettings; // 0xa0
};

struct UBaseIndicatorWidget {
	UCanvasPanel* _safeZonePanel; // 0x300
	UCanvasPanelSlot* _canvasPanelSlot; // 0x308
	float RadiusMultiplier; // 0x310
	UCanvasPanel* IndicatorPanel; // 0x318
	UCanvasPanel* Indicator; // 0x320
	UImage* ArrowImage; // 0x328
};

struct UNiagaraDataInterfaceStaticMesh {
	UStaticMesh* DefaultMesh; // 0x38
	AActor* source; // 0x40
	UStaticMeshComponent* SourceComponent; // 0x48
	FNDIStaticMeshSectionFilter SectionFilter; // 0x50
};

struct UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x38
	TArray<FName> ComponentTags; // 0x68
	TArray<UAssetUserData*> AssetUserData; // 0x78
	int32_t UCSSerializationIndex; // 0x8c
	char bNetAddressable : 1; // 0x90
	char bReplicates : 1; // 0x90
	char bAutoActivate : 1; // 0x91
	char bIsActive : 1; // 0x92
	char bEditableWhenInherited : 1; // 0x92
	char bCanEverAffectNavigation : 1; // 0x92
	char bIsEditorOnly : 1; // 0x92
	EComponentCreationMethod CreationMethod; // 0x94
	FMulticastSparseDelegate OnComponentActivated; // 0x95
	FMulticastSparseDelegate OnComponentDeactivated; // 0x96
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x98
};

struct UBoneSocketLocalVelocityEvaluator {
	USkeletalMeshComponent* _meshComponent; // 0xb8
	TArray<FName> _trackedBoneSocketNames; // 0xc0
};

struct UAkMediaAssetData {
	bool IsStreamed; // 0x30
	bool UseDeviceMemory; // 0x31
};

struct UCorrectiveAction {
	float _startingTokens[0x3]; // 0x3d0
	FName _statusEffectName; // 0x3dc
	FGameplayTagContainer _allowedInteractionSemanticsForToken; // 0x3e8
};

struct UUniformGridPanel {
	FMargin SlotPadding; // 0x140
	float MinDesiredSlotWidth; // 0x150
	float MinDesiredSlotHeight; // 0x154
};

struct ULuminARSessionConfig {
	FMagicLeapPlanesQuery PlanesQuery; // 0xb0
	int32_t MaxPlaneQueryResults; // 0x110
	int32_t MinPlaneArea; // 0x114
	bool bArbitraryOrientationPlaneDetection; // 0x118
	FVector PlaneSearchExtents; // 0x11c
	TArray<EMagicLeapPlaneQueryFlags> PlaneQueryFlags; // 0x128
	bool bDiscardZeroExtentPlanes; // 0x138
	bool bDefaultUseUnreliablePose; // 0x139
};

struct UDynamicEntryBoxBase {
	EDynamicBoxType EntryBoxType; // 0x128
	FVector2D EntrySpacing; // 0x12c
	TArray<FVector2D> SpacingPattern; // 0x138
	FSlateChildSize EntrySizeRule; // 0x148
	EHorizontalAlignment EntryHorizontalAlignment; // 0x150
	EVerticalAlignment EntryVerticalAlignment; // 0x151
	int32_t MaxElementSize; // 0x154
	FUserWidgetPool EntryWidgetPool; // 0x168
};

struct UMovieSceneFadeSection {
	FLinearColor FadeColor; // 0x188
	char bFadeAudio : 1; // 0x198
};

struct UUMGEndGameCollapseProgressWidget {
	UProgressBar* ProgressBar; // 0x300
	UCanvasPanel* MarkerLeftCanvas; // 0x308
	UCanvasPanel* MarkerRightCanvas; // 0x310
	UHorizontalBoxSlot* _markerLeftBox; // 0x318
	UHorizontalBoxSlot* _markerRightBox; // 0x320
};

struct UActorSpawner {
	EGameplayElementType Type; // 0x220
	TSoftClassPtr<UObject> Visualization; // 0x228
	bool ActivatedByDefault; // 0x258
	TArray<FActorSpawnerProperties> ActivatedSceneElement; // 0x260
	TArray<FActorSpawnerProperties> DeactivatedSceneElement; // 0x270
	float Weight; // 0x280
	int32_t SpawnCountMax; // 0x284
	int32_t SpawnPriorityTier; // 0x288
	FMulticastInlineDelegate OnAsyncActorSpawned; // 0x290
	bool WeightInfluenceable; // 0x2a8
	bool WeightInfluencer; // 0x2a9
	float Cost; // 0x2ac
	UObject* _toSpawn; // 0x2b0
	TWeakObjectPtr<AActor> _spawnedActorOnAuthority; // 0x2c0
};

struct UInterpTrackSound {
	TArray<FSoundTrackKey> Sounds; // 0x98
	char bPlayOnReverse : 1; // 0xa8
	char bContinueSoundOnMatineeEnd : 1; // 0xa8
	char bSuppressSubtitles : 1; // 0xa8
	char bTreatAsDialogue : 1; // 0xa8
	char bAttach : 1; // 0xa8
};

struct ACurrencyDisplayable {
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x238
	TMap<ECurrencyType, USkeletalMesh*> _currencyMeshes; // 0x240
};

struct UBookMark {
	FVector Location; // 0x30
	FRotator Rotation; // 0x3c
	TArray<FString> HiddenLevels; // 0x48
};

struct USculptBrushProperties {
	float Depth; // 0x70
	bool bHitBackFaces; // 0x74
};

struct APlayerCameraManager {
	APlayerController* PCOwner; // 0x230
	USceneComponent* TransformComponent; // 0x238
	float DefaultFOV; // 0x24c
	float DefaultOrthoWidth; // 0x254
	float DefaultAspectRatio; // 0x25c
	FCameraCacheEntry CameraCache; // 0x2a0
	FCameraCacheEntry LastFrameCameraCache; // 0x880
	FTViewTarget ViewTarget; // 0xe60
	FTViewTarget PendingViewTarget; // 0x1450
	FCameraCacheEntry CameraCachePrivate; // 0x1a70
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x2050
	TArray<UCameraModifier*> ModifierList; // 0x2630
	TArray<UCameraModifier*> DefaultModifiers; // 0x2640
	float FreeCamDistance; // 0x2650
	FVector FreeCamOffset; // 0x2654
	FVector ViewTargetOffset; // 0x2660
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x2680
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x2690
	UCameraAnimInst* AnimInstPool[0x8]; // 0x2698
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x26d8
	TArray<UCameraAnimInst*> ActiveAnims; // 0x26f8
	TArray<UCameraAnimInst*> FreeAnims; // 0x2708
	ACameraActor* AnimCameraActor; // 0x2718
	char bIsOrthographic : 1; // 0x2720
	char bDefaultConstrainAspectRatio : 1; // 0x2720
	char bClientSimulatingViewTarget : 1; // 0x2720
	char bUseClientSideCameraUpdates : 1; // 0x2720
	char bGameCameraCutThisFrame : 1; // 0x2721
	float ViewPitchMin; // 0x2724
	float ViewPitchMax; // 0x2728
	float ViewYawMin; // 0x272c
	float ViewYawMax; // 0x2730
	float ViewRollMin; // 0x2734
	float ViewRollMax; // 0x2738
	float ServerUpdateCameraTimeout; // 0x2740
};

struct UBTService_SetBBEntry {
	FBlackboardKeySelector BBToSetKey; // 0x80
	FString ToSetValue; // 0xb0
	FAITunableParameter RandomSetChance; // 0xc0
};

struct AKnifeProjectile {
	UPrimitiveComponent* _worldCollider; // 0x338
	UPrimitiveComponent* _camperDetector; // 0x340
	TSet<ADBDPlayer*> _playersAffectedThisThrow; // 0x358
	UPoolableProjectileComponent* _poolableActorComponent; // 0x3a8
	FDBDTunableRowHandle _knifeMaxRange; // 0x3b0
	FDBDTunableRowHandle _addonExplosionRadius; // 0x3d8
	FDBDTunableRowHandle _numberOfAddonBounces; // 0x400
};

struct UDBD_CrossDissolver {
	TArray<UMaterialInterface*> NewMaterials; // 0xb8
	TArray<USkeletalMeshComponent*> BaseSkeletalMesh; // 0xc8
	TArray<USkeletalMeshComponent*> ClonedSkeletalMeshes; // 0xd8
};

struct UTwinBaseKillerInstinctEffect {
	FTunableStat _lullabyRange; // 0x350
	FDBDTunableRowHandle _lingerDuration; // 0x3d0
};

struct UMovieSceneAkAudioEventSection {
	UAkAudioEvent* Event; // 0x128
	bool RetriggerEvent; // 0x130
	int32_t ScrubTailLengthMs; // 0x134
	bool StopAtSectionEnd; // 0x138
	FString EventName; // 0x140
	float MaxSourceDuration; // 0x170
	FString MaxDurationSourceID; // 0x178
};

struct UHarpoonedSurvivorSubAnimInstance {
	float _linkedMaxSpeed; // 0x4f0
	float _timeBeforeHarpoonHitReset; // 0x4f4
	FName _hitHarpoonedEnterEvent; // 0x4f8
	FName _chainBreakEnterEvent; // 0x504
	bool _isChainLinked; // 0x510
	bool _isBeingReeled; // 0x511
	bool _hasLinkInput; // 0x512
	float _linkInputX; // 0x514
	float _linkInputY; // 0x518
	bool _chainBreakTrigger; // 0x51c
	bool _triggerHarpoonHit; // 0x51d
	float _harpoonHitTurnAnimNormalizedStartTime; // 0x520
	bool _harpoonHitAnimTurnRight; // 0x524
	bool _isCrawling; // 0x525
};

struct UBTTask_PushPawnAction {
	UPawnAction* action; // 0x78
};

struct UChaserCharacterComponent {
	UDBDPawnSensingComponent* _camperSensor; // 0x138
	TMap<ADBDPlayer*, FChaseUpdateInfo> _chaseUpdateInfo; // 0x140
	TArray<ADBDPlayer*> _chasedPlayers; // 0x190
	TArray<ADBDPlayer*> _authority_survivorsWhoStunnedKillerByPalletDuringChase; // 0x1a0
	FGameplayTagContainer _preventChaseTags; // 0x1e0
};

struct ATile {
	bool RerunConstructionScript; // 0x230
	int32_t MinimumSpacing; // 0x234
	int32_t MaximumSpacing; // 0x238
	bool DiagonalSpacing; // 0x23c
	bool TypeSpacing; // 0x23d
	int32_t MaximumCount; // 0x240
	FVector2D Dimension; // 0x244
	TArray<EscapeStrategyType> AvailableEscapeTypes; // 0x250
	ETileType Type; // 0x260
	EDensity Density; // 0x261
	EPathType Path; // 0x262
	int32_t Number; // 0x264
	bool PlaceHolder; // 0x268
	int32_t SpawnPriorityTier; // 0x26c
	float Weight; // 0x270
	FVector2D Coord; // 0x274
	EQuadrantSpawnType QuadrantSpawnType; // 0x27c
	EBasementType BasementType; // 0x27d
	TArray<UTileSpawnPoint*> SpawnPointsCache; // 0x280
	TArray<UObjectRandomizer*> ObjectRandomizersCache; // 0x290
	TArray<UActorSpawner*> ActorSpawnersCache; // 0x2a0
	TArray<UActorVariationSpawner*> ActorVariationSpawnersCache; // 0x2b0
	FRandomStream SharedTileRandomizer; // 0x33c
	bool _initialized; // 0x344
};

struct UExpandableArea {
	FExpandableAreaStyle Style; // 0x130
	FSlateBrush BorderBrush; // 0x260
	FSlateColor BorderColor; // 0x2f0
	bool bIsExpanded; // 0x318
	float MaxHeight; // 0x31c
	FMargin HeaderPadding; // 0x320
	FMargin AreaPadding; // 0x330
	FMulticastInlineDelegate OnExpansionChanged; // 0x340
	UWidget* HeaderContent; // 0x350
	UWidget* BodyContent; // 0x358
};

struct UTexture2DDynamic {
	EPixelFormat Format; // 0xc8
};

struct URemeshMeshTool {
	URemeshMeshToolProperties* BasicProperties; // 0x98
	UMeshStatisticsProperties* MeshStatisticsProperties; // 0xa0
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xa8
};

struct UUMGLoadoutWidget {
	FText InventoryItemTypeText; // 0x358
	FText InventoryFilterText; // 0x370
	UUMGLoadoutPageScrollWidget* PageScrollWidget; // 0x388
	FText LoadoutTitleText; // 0x390
	FText InventoryPanelTitleText; // 0x3a8
};

struct UEnvQueryGenerator {
	FString OptionName; // 0x38
	UEnvQueryItemType* ItemType; // 0x48
	char bAutoSortTests : 1; // 0x50
};

struct AZombieAIController {
	UBehaviorTree* _zombieBehaviorTree; // 0x358
	UAIPerceptionComponent* _aiPerceptionComponent; // 0x360
	TArray<ACamperPlayer*> _survivorInVision; // 0x370
	ACamperPlayer* _chaseTargetSurvivor; // 0x380
	FVector _goToLocation; // 0x388
	TArray<ACamperPlayer*> _survivorsInAttackDetector; // 0x3a0
	FDBDTunableRowHandle _zombieAttackHitTime; // 0x3b0
	FDBDTunableRowHandle _zombieAttackOpenTime; // 0x3d8
	FDBDTunableRowHandle _zombieAnimSpawnTime; // 0x400
	FDBDTunableRowHandle _zombieAnimDyingTime; // 0x428
	FTunableStat _zombieSightRadius; // 0x450
	FTunableStat _zombieLoseSightRadius; // 0x4d0
	FTunableStat _zombieVisionHalfAngle; // 0x550
	FDBDTunableRowHandle _zombieFallSmashTime; // 0x5d0
	FDBDTunableRowHandle _zombieAttackCooldownTime; // 0x5f8
};

struct APawn {
	char bUseControllerRotationPitch : 1; // 0x238
	char bUseControllerRotationYaw : 1; // 0x238
	char bUseControllerRotationRoll : 1; // 0x238
	char bCanAffectNavigationGeneration : 1; // 0x238
	float BaseEyeHeight; // 0x23c
	EAutoReceiveInput AutoPossessPlayer; // 0x240
	EAutoPossessAI AutoPossessAI; // 0x241
	char RemoteViewPitch; // 0x242
	AController* AIControllerClass; // 0x248
	APlayerState* PlayerState; // 0x250
	AController* LastHitBy; // 0x260
	AController* Controller; // 0x268
	FVector ControlInputVector; // 0x274
	FVector LastControlInputVector; // 0x280
};

struct UControlModeManager {
	UGameInstance* _gameInstance; // 0x80
};

struct UCharacterMovementComponent {
	ACharacter* CharacterOwner; // 0x158
	float GravityScale; // 0x160
	float MaxStepHeight; // 0x164
	float JumpZVelocity; // 0x168
	float JumpOffJumpZFactor; // 0x16c
	float WalkableFloorAngle; // 0x170
	float WalkableFloorZ; // 0x174
	EMovementMode MovementMode; // 0x178
	char CustomMovementMode; // 0x179
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x17a
	float GroundFriction; // 0x17c
	float MaxWalkSpeed; // 0x19c
	float MaxWalkSpeedCrouched; // 0x1a0
	float MaxSwimSpeed; // 0x1a4
	float MaxFlySpeed; // 0x1a8
	float MaxCustomMovementSpeed; // 0x1ac
	float MaxAcceleration; // 0x1b0
	float MinAnalogWalkSpeed; // 0x1b4
	float BrakingFrictionFactor; // 0x1b8
	float BrakingFriction; // 0x1bc
	float BrakingSubStepTime; // 0x1c0
	float BrakingDecelerationWalking; // 0x1c4
	float BrakingDecelerationFalling; // 0x1c8
	float BrakingDecelerationSwimming; // 0x1cc
	float BrakingDecelerationFlying; // 0x1d0
	float AirControl; // 0x1d4
	float AirControlBoostMultiplier; // 0x1d8
	float AirControlBoostVelocityThreshold; // 0x1dc
	float FallingLateralFriction; // 0x1e0
	float CrouchedHalfHeight; // 0x1e4
	float Buoyancy; // 0x1e8
	float PerchRadiusThreshold; // 0x1ec
	float PerchAdditionalHeight; // 0x1f0
	FRotator RotationRate; // 0x1f4
	char bUseSeparateBrakingFriction : 1; // 0x200
	char bApplyGravityWhileJumping : 1; // 0x200
	char bUseControllerDesiredRotation : 1; // 0x200
	char bOrientRotationToMovement : 1; // 0x200
	char bSweepWhileNavWalking : 1; // 0x200
	char bMovementInProgress : 1; // 0x200
	char bEnableScopedMovementUpdates : 1; // 0x200
	char bEnableServerDualMoveScopedMovementUpdates : 1; // 0x201
	char bForceMaxAccel : 1; // 0x201
	char bRunPhysicsWithNoController : 1; // 0x201
	char bForceNextFloorCheck : 1; // 0x201
	char bShrinkProxyCapsule : 1; // 0x201
	char bCanWalkOffLedges : 1; // 0x201
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x201
	char bNetworkSkipProxyPredictionOnNetUpdate : 1; // 0x202
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1; // 0x202
	char bDeferUpdateMoveComponent : 1; // 0x202
	char bEnablePhysicsInteraction : 1; // 0x202
	char bTouchForceScaledToMass : 1; // 0x202
	char bPushForceScaledToMass : 1; // 0x202
	char bPushForceUsingZOffset : 1; // 0x202
	char bScalePushForceToVelocity : 1; // 0x203
	USceneComponent* DeferredUpdatedMoveComponent; // 0x208
	float MaxOutOfWaterStepHeight; // 0x210
	float OutofWaterZ; // 0x214
	float Mass; // 0x218
	float StandingDownwardForceScale; // 0x21c
	float InitialPushForceFactor; // 0x220
	float PushForceFactor; // 0x224
	float PushForcePointZOffsetFactor; // 0x228
	float TouchForceFactor; // 0x22c
	float MinTouchForce; // 0x230
	float MaxTouchForce; // 0x234
	float RepulsionForce; // 0x238
	FVector Acceleration; // 0x23c
	FQuat LastUpdateRotation; // 0x250
	FVector LastUpdateLocation; // 0x260
	FVector LastUpdateVelocity; // 0x26c
	float ServerLastTransformUpdateTimeStamp; // 0x278
	float ServerLastClientGoodMoveAckTime; // 0x27c
	float ServerLastClientAdjustmentTime; // 0x280
	FVector PendingImpulseToApply; // 0x284
	FVector PendingForceToApply; // 0x290
	float AnalogInputModifier; // 0x29c
	float MaxSimulationTimeStep; // 0x2ac
	int32_t MaxSimulationIterations; // 0x2b0
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x2b4
	float MaxDepenetrationWithGeometry; // 0x2b8
	float MaxDepenetrationWithGeometryAsProxy; // 0x2bc
	float MaxDepenetrationWithPawn; // 0x2c0
	float MaxDepenetrationWithPawnAsProxy; // 0x2c4
	float NetworkSimulatedSmoothLocationTime; // 0x2c8
	float NetworkSimulatedSmoothRotationTime; // 0x2cc
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2d0
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2d4
	float NetProxyShrinkRadius; // 0x2d8
	float NetProxyShrinkHalfHeight; // 0x2dc
	float NetworkMaxSmoothUpdateDistance; // 0x2e0
	float NetworkNoSmoothUpdateDistance; // 0x2e4
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2e8
	float NetworkMinTimeBetweenClientAdjustments; // 0x2ec
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2f0
	float NetworkLargeClientCorrectionDistance; // 0x2f4
	float LedgeCheckThreshold; // 0x2f8
	float JumpOutOfWaterPitch; // 0x2fc
	FFindFloorResult CurrentFloor; // 0x300
	EMovementMode DefaultLandMovementMode; // 0x39c
	EMovementMode DefaultWaterMovementMode; // 0x39d
	EMovementMode GroundMovementMode; // 0x39e
	char bMaintainHorizontalGroundVelocity : 1; // 0x39f
	char bImpartBaseVelocityX : 1; // 0x39f
	char bImpartBaseVelocityY : 1; // 0x39f
	char bImpartBaseVelocityZ : 1; // 0x39f
	char bImpartBaseAngularVelocity : 1; // 0x39f
	char bJustTeleported : 1; // 0x39f
	char bNetworkUpdateReceived : 1; // 0x39f
	char bNetworkMovementModeChanged : 1; // 0x39f
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x3a0
	char bServerAcceptClientAuthoritativePosition : 1; // 0x3a0
	char bNotifyApex : 1; // 0x3a0
	char bCheatFlying : 1; // 0x3a0
	char bWantsToCrouch : 1; // 0x3a0
	char bCrouchMaintainsBaseLocation : 1; // 0x3a0
	char bIgnoreBaseRotation : 1; // 0x3a0
	char bFastAttachedMove : 1; // 0x3a0
	char bAlwaysCheckFloor : 1; // 0x3a1
	char bUseFlatBaseForFloorChecks : 1; // 0x3a1
	char bPerformingJumpOff : 1; // 0x3a1
	char bWantsToLeaveNavWalking : 1; // 0x3a1
	char bUseRVOAvoidance : 1; // 0x3a1
	char bRequestedMoveUseAcceleration : 1; // 0x3a1
	char bWasSimulatingRootMotion : 1; // 0x3a1
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x3a2
	bool LockRootMotionRotationPitch; // 0x3a3
	bool LockRootMotionRotationYaw; // 0x3a4
	bool LockRootMotionRotationRoll; // 0x3a5
	char bHasRequestedVelocity : 1; // 0x3a6
	char bRequestedMoveWithMaxSpeed : 1; // 0x3a6
	char bWasAvoidanceUpdated : 1; // 0x3a6
	char bProjectNavMeshWalking : 1; // 0x3a6
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x3a6
	float AvoidanceConsiderationRadius; // 0x3b8
	FVector RequestedVelocity; // 0x3bc
	int32_t AvoidanceUID; // 0x3c8
	FNavAvoidanceMask AvoidanceGroup; // 0x3cc
	FNavAvoidanceMask GroupsToAvoid; // 0x3d0
	FNavAvoidanceMask GroupsToIgnore; // 0x3d4
	float AvoidanceWeight; // 0x3d8
	FVector PendingLaunchVelocity; // 0x3dc
	float NavMeshProjectionInterval; // 0x490
	float NavMeshProjectionTimer; // 0x494
	float NavMeshProjectionInterpSpeed; // 0x498
	float NavMeshProjectionHeightScaleUp; // 0x49c
	float NavMeshProjectionHeightScaleDown; // 0x4a0
	float NavWalkingFloorDistTolerance; // 0x4a4
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x4a8
	float MinTimeBetweenTimeStampResets; // 0x4f0
	FRootMotionSourceGroup CurrentRootMotion; // 0x4f8
	FRootMotionMovementParams RootMotionParams; // 0x5c0
	FVector AnimRootMotionVelocity; // 0x600
};

struct UMaterialExpressionLightmassReplace {
	FExpressionInput Realtime; // 0x48
	FExpressionInput Lightmass; // 0x64
};

struct UCreateSessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct UAISkill_FindInteractable_SolveSickness {
	FAITunableParameter UrgencyGoalWeight; // 0x118
};

struct USourceEffectPannerPreset {
	FSourceEffectPannerSettings Settings; // 0x78
};

struct URangeToActorsTrackerStrategy {
	FDBDTunableRowHandle _range; // 0x30
};

struct UHapticFeedbackEffect_SoundWave {
	USoundWave* SoundWave; // 0x30
};

struct UGameFlowContextSystem {
	URootMovie* m_RootMovie; // 0x100
};

struct UDrawPolygonToolSnapProperties {
	bool bEnableSnapping; // 0x58
	bool bSnapToWorldGrid; // 0x59
	bool bSnapToVertices; // 0x5a
	bool bSnapToEdges; // 0x5b
	bool bSnapToAngles; // 0x5c
	bool bSnapToLengths; // 0x5d
	float SegmentLength; // 0x60
	bool bHitSceneObjects; // 0x64
	float HitNormalOffset; // 0x68
};

struct UUMGQueueStatusIconWidget {
	UImage* statusIndicator; // 0x300
	FLinearColor AcceptableColor; // 0x308
	FLinearColor ModerateColor; // 0x318
	FLinearColor LongColor; // 0x328
};

struct AAtlantaHeartbeatActor {
	bool IsHeartbeatShown; // 0x230
};

struct UCrownPillarOutlineUpdateStrategy {
	FLinearColor _offeringEnabledAuraColor; // 0xc0
};

struct UOniDashHitDiffInTimeQEEvaluator {
	AActor* _previousTarget; // 0x98
};

struct USubmixEffectConvolutionReverbPreset {
	FSubmixEffectConvolutionReverbSettings Settings; // 0x48
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x70
	bool bEnableHardwareAcceleration; // 0x71
};

struct UBTService_SetMovementMode {
	ECharacterMovementTypes OnEnterMovementMode; // 0x78
	ECharacterMovementTypes OnExitMovementMode; // 0x79
};

struct UStencilOutlineRenderStrategy {
	TArray<UMaterialInterface*> _replacementMaterials; // 0x70
	TArray<UBatchMeshCommands*> _translucentCopies; // 0x80
};

struct UAnimationSharingSetup {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x30
	FAnimationSharingScalability ScalabilitySettings; // 0x40
};

struct UItemModifier {
	FGameplayModifierData ModifierData; // 0x220
};

struct UMovieSceneCameraCutSection {
	FGuid CameraGuid; // 0xe8
	FMovieSceneObjectBindingID CameraBindingID; // 0xf8
};

struct UPlayerInteractionHandler {
	float PriorityConeAngle; // 0x120
	float BotPriorityConeAngle; // 0x124
	FMulticastInlineDelegate Authority_SecondaryActionDoneDelegate; // 0x138
	FMulticastInlineDelegate NewInteractionRequestedDelegate; // 0x148
	FMulticastInlineDelegate ServerValidatedInteractionStartedDelegate; // 0x158
	FMulticastInlineDelegate ServerValidatedInteractionEndedDelegate; // 0x168
	EInteractionLayer InteractionLayer; // 0x178
	FMulticastInlineDelegate OnDeactivateSkillCheckDelegate; // 0x188
	bool _hasInteractionRequest; // 0x1d0
	bool _hasInteractionRequestInBuffer; // 0x1d1
	UInteractionDefinition* _interactionToSwapTo; // 0x1f0
	UInteractionDefinition* _currentInteraction; // 0x218
	TArray<ADBDPlayer*> _currentPlayerDependencies; // 0x2c0
	EInputInteractionType _currentInteractionType; // 0x2d0
	USkillCheck* _skillCheck; // 0x2d8
	TArray<float> _progressBasedSkillChecks; // 0x2e8
	ADBDPlayer* _requestedInterruptionOtherParty; // 0x358
	UInterruptionDefinition* _requestedInterruptionDefinition; // 0x360
	bool _requestedInterruptionIsInterruptor; // 0x368
	ADBDPlayer* _currentInterruptionOtherParty; // 0x370
	UInterruptionDefinition* _currentInterruptionDefinition; // 0x378
	bool _currentInterruptionIsInterruptor; // 0x380
	bool _interactionInProgress; // 0x381
	TArray<UInteractionDefinition*> _interactionsInZone; // 0x3b8
};

struct UBlendSpace1D {
	bool bScaleAnimation; // 0x150
};

struct UInterpTrackInstFloatMaterialParam {
	TArray<UMaterialInstanceDynamic*> materialInstances; // 0x30
	TArray<float> ResetFloats; // 0x40
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x50
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x60
};

struct UFlashlightTargetFXComponent {
	bool _modifiesBeamAngle; // 0xe8
	UFlashlightableComponent* _flashlightable; // 0xf0
};

struct UBlockElement {
	TWeakObjectPtr<UObject> _source; // 0x30
	TSet<TWeakObjectPtr<ADBDPlayer>> _affectedPlayers; // 0x38
};

struct UEruption {
	TArray<AGenerator*> _server_highlightedGenerators; // 0x3d0
	bool _isPerkEnabled; // 0x3e0
	float _generatorRegressPercentage[0x3]; // 0x3e4
	float _survivorImposedStatusEffectDuration[0x3]; // 0x3f0
	float _perkCooldownDuration[0x3]; // 0x3fc
	float _screamRevealLocationDuration; // 0x408
};

struct UK25ChainAttachedStatusEffect {
	UCurveFloat* _percentageReductionSpeedPerChainCurve; // 0x350
	UK25SurvivorChainAttachmentComponent* _chainAttachmentComponent; // 0x358
	int32_t _cachedNumberOfChainsAttached; // 0x360
};

struct UK25KillerTeleportationPositionFinderComponent {
	float _rayCastZOffet; // 0xb8
	float _rayCastLength; // 0xbc
	float _killerInRangeMinimumDistanceCheck; // 0xc0
	float _killerInRangeMaxRangePercentage; // 0xc4
	float _deltaHeightThreshold; // 0xc8
	FDBDTunableRowHandle _minDistanceFromLamentConfiguration; // 0xd0
	FDBDTunableRowHandle _maxDistanceFromLamentConfiguration; // 0xf8
	float _timeBetweenFailsafeChecks; // 0x140
	EK25TeleportLocationStatus _teleportLocationStatus; // 0x188
	FVector _bestTeleportLocation; // 0x18c
	TArray<AEscapeDoor*> _escapeDoors; // 0x198
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x30
};

struct UMaterialExpressionVectorNoise {
	FExpressionInput Position; // 0x48
	EVectorNoiseFunction NoiseFunction; // 0x64
	int32_t Quality; // 0x68
	char bTiling : 1; // 0x6c
	uint32_t TileSize; // 0x70
};

struct UBTTask_FinishWithResult {
	EBTNodeResult Result; // 0x78
};

struct USlateAccessibleWidgetData {
	bool bCanChildrenBeAccessible; // 0x30
	ESlateAccessibleBehavior AccessibleBehavior; // 0x31
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x32
	FText AccessibleText; // 0x38
	FDelegate AccessibleTextDelegate; // 0x50
	FText AccessibleSummaryText; // 0x68
	FDelegate AccessibleSummaryTextDelegate; // 0x80
};

struct UAxisFlickMasher {
	UInputComponent* _inputComponent; // 0xb8
	UAxisFlick* _axisFlick1; // 0xc8
	UAxisFlick* _axisFlick2; // 0xd0
};

struct ATransformGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x230
	UPrimitiveComponent* TranslateY; // 0x238
	UPrimitiveComponent* TranslateZ; // 0x240
	UPrimitiveComponent* TranslateYZ; // 0x248
	UPrimitiveComponent* TranslateXZ; // 0x250
	UPrimitiveComponent* TranslateXY; // 0x258
	UPrimitiveComponent* RotateX; // 0x260
	UPrimitiveComponent* RotateY; // 0x268
	UPrimitiveComponent* RotateZ; // 0x270
	UPrimitiveComponent* UniformScale; // 0x278
	UPrimitiveComponent* AxisScaleX; // 0x280
	UPrimitiveComponent* AxisScaleY; // 0x288
	UPrimitiveComponent* AxisScaleZ; // 0x290
	UPrimitiveComponent* PlaneScaleYZ; // 0x298
	UPrimitiveComponent* PlaneScaleXZ; // 0x2a0
	UPrimitiveComponent* PlaneScaleXY; // 0x2a8
};

struct USurvivorCollectableOutlineUpdateStrategy {
	FLinearColor _outlineColor; // 0xc0
	FLinearColor _nearlyConsumedColor; // 0xd0
};

struct UAkWindowsInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x30
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkWindowsAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UHatchetLauncher {
	FRotator _angleOffset; // 0x180
	UCurveFloat* _angleOffsetCurve; // 0x190
	UCurveFloat* _speedCurve; // 0x198
	float _hatchetSpeedWhenThrowFullyCharged; // 0x1a0
	UCurveFloat* _hatchetPitchCurve; // 0x1a8
	FDBDTunableRowHandle _hatchetMinAngleOffset; // 0x1b0
	FDBDTunableRowHandle _hatchetMaxAngleOffset; // 0x1d8
	FDBDTunableRowHandle _hatchetMinSpeed; // 0x200
	FDBDTunableRowHandle _hatchetMaxSpeed; // 0x228
	FDBDTunableRowHandle _hatchetLaunchPitchMin; // 0x250
	FDBDTunableRowHandle _hatchetLaunchPitchMax; // 0x278
};

struct ULightingHelper {
	ABaseSky* _levelLighting; // 0x30
	ABaseSky* _levelLightingFixed; // 0x38
	ABaseSky* _levelLightingSpawned; // 0x40
	ABaseSky* _levelLightingWithoutExposure; // 0x48
	AActor* _adaptiveShadowMapControllersActor; // 0x50
	ULightingInterpolator* _lightingInterpolator; // 0x58
	ULightingFactory* _lightingFactory; // 0x60
	UPostProcessComponent* _postProcessCache; // 0x68
	bool _bIsDreamworldActive; // 0x70
};

struct UCoreHudRootWidget {
	UOverlay* WidgetContainer; // 0x260
	UOverlay* OuterContainer; // 0x268
	UOverlay* SpectateContainer; // 0x270
	UScaleBox* ScaleHud; // 0x278
	float UnfocusedOpacity; // 0x280
	UCurveFloat* Test4kDpiScalingCurve; // 0x288
	UUserWidget* Test4kDpiCurveClass; // 0x290
	UUserWidget* Test4kDpiCurveWidget; // 0x298
	UUserWidget* EndGameCollapseBarWidgetClass; // 0x2a0
	UUserWidget* EquippedItemWidgetClass; // 0x2a8
	UUserWidget* EquippedPowerWidgetClass; // 0x2b0
	UUserWidget* ExternalEffectsWidgetClass; // 0x2b8
	UUserWidget* HudAlertWidgetClass; // 0x2c0
	UUserWidget* InteractionProgressWidgetClass; // 0x2c8
	UUserWidget* InteractionPromptsContainerWidgetClass; // 0x2d0
	UUserWidget* ItemInteractionWidgetClass; // 0x2d8
	UUserWidget* LeaningArrowsWidgetClass; // 0x2e0
	UUserWidget* MatchResultWidgetClass; // 0x2e8
	UUserWidget* OfferingInteractionWidgetClass; // 0x2f0
	UUserWidget* PerksContainerWidgetClass; // 0x2f8
	UUserWidget* PingStatusWidgetClass; // 0x300
	UUserWidget* PlayerStatusesWidgetClass; // 0x308
	UUserWidget* ScreenIndicatorWidgetClass; // 0x310
	UUserWidget* SpectateBarWidgetClass; // 0x318
	UUserWidget* StartSequenceWidgetClass; // 0x320
	UUserWidget* StatusEffectWidgetClass; // 0x328
	UUserWidget* TestBuildFlagWidgetClass; // 0x330
	UUserWidget* TutorialMysteryNoteWidgetClass; // 0x338
	UUserWidget* TutorialObjectivesWidgetClass; // 0x340
	UUserWidget* TutorialPopupWidgetClass; // 0x348
	TArray<TScriptInterface<ICoreBaseViewInterface>> _coreBaseViewInterfaces; // 0x350
	FMulticastInlineDelegate HUDWidgetsFadeOutCompletedDelegate; // 0x360
};

struct ADBD_SoundEventSpawner {
	TArray<FDBD_SoundSpawnerData> AtlantaSoundDescriptor; // 0x230
	TArray<FDBD_SoundSpawnerData> SoundDescriptor; // 0x240
	TArray<AActor*> _loadedSoundAssets; // 0x258
};

struct UMaterialExpressionRotateAboutAxis {
	FExpressionInput NormalizedRotationAxis; // 0x48
	FExpressionInput RotationAngle; // 0x64
	FExpressionInput PivotPoint; // 0x80
	FExpressionInput Position; // 0x9c
	float Period; // 0xb8
};

struct UHudScreenCoreUMG {
	UCoreHudRootWidget* _rootWidget; // 0x240
	ATutorialsUtilities* _tutorialsUtilities; // 0x3a8
	TArray<TScriptInterface<IPlayerStatusViewInterface>> _playerStatusInterfaces; // 0x3b0
	FInteractionProgressViewData _interactionProgressViewData; // 0x3c0
	FItemBundleViewData _itemBundleViewData; // 0x428
	FPowerBundleViewData _powerBundleViewData; // 0x5c8
	TArray<FPlayerStatusViewData> _playerStatusViewData; // 0x710
};

struct UUMGAtlantaRitualTab {
	UVerticalBox* ContainerBox; // 0x300
	TSoftClassPtr<UObject> _itemWidgetClass; // 0x308
};

struct UTheExecutionerAnimInstance {
	bool _isInTormentMode; // 0x5a8
	bool _isChargingTormentMode; // 0x5a9
	bool _isTormentModeAttacking; // 0x5aa
	float _tormentModeVerticalInput; // 0x5ac
	float _tormentModeHorizontalInput; // 0x5b0
};

struct UCoreHudAlertWidget {
	int32_t MaxDisplayedItems; // 0x2f8
	float SecondaryAlpha; // 0x2fc
	float FullAlertDuration; // 0x300
	float PendingAlertDuration; // 0x304
	float AnimationDuration; // 0x308
	EEasingType AnimationEasing; // 0x30c
	float AnimationTranslationY; // 0x310
	UCoreHudScoreAlertItem* CoreHudScoreAlertItemClass; // 0x318
	UCoreHudStatusEffectAlertItem* CoreHudStatusEffectAlertItemClass; // 0x320
	UGridPanel* AlertContainer; // 0x328
	TArray<UCoreBaseUserWidget*> _alerts; // 0x330
	TArray<UCoreBaseUserWidget*> _pendingAlerts; // 0x340
	TArray<UCoreHudScoreAlertItem*> _scoreAlertPool; // 0x350
	TArray<UCoreHudStatusEffectAlertItem*> _statusEffectAlertPool; // 0x360
};

struct UPreviewMeshCollection {
	USkeleton* Skeleton; // 0x40
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x48
};

struct UBaseBrushTool {
	UBrushBaseProperties* BrushProperties; // 0xc8
	bool bInBrushStroke; // 0xd0
	FBrushStampData LastBrushStamp; // 0xd4
	TSoftClassPtr<UObject> PropertyClass; // 0x198
	UBrushStampIndicator* BrushStampIndicator; // 0x1c8
};

struct UParticleModuleParameterDynamic {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x38
	int32_t UpdateFlags; // 0x48
	char bUsesVelocity : 1; // 0x4c
};

struct UInterpTrackVectorMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x98
	FName ParamName; // 0xa8
};

struct UFSM_HasStateRanForXSecondsCondition {
	FDBDTunableRowHandle _minTimeInSecondsToSatisfyCondition; // 0x38
};

struct UParticleModuleBeamNoise {
	char bLowFreq_Enabled : 1; // 0x38
	int32_t Frequency; // 0x3c
	int32_t Frequency_LowRange; // 0x40
	FRawDistributionVector NoiseRange; // 0x48
	FRawDistributionFloat NoiseRangeScale; // 0x90
	char bNRScaleEmitterTime : 1; // 0xc0
	FRawDistributionVector NoiseSpeed; // 0xc8
	char bSmooth : 1; // 0x110
	float NoiseLockRadius; // 0x114
	char bNoiseLock : 1; // 0x118
	char bOscillate : 1; // 0x118
	float NoiseLockTime; // 0x11c
	float NoiseTension; // 0x120
	char bUseNoiseTangents : 1; // 0x124
	FRawDistributionFloat NoiseTangentStrength; // 0x128
	int32_t NoiseTessellation; // 0x158
	char bTargetNoise : 1; // 0x15c
	float FrequencyDistance; // 0x160
	char bApplyNoiseScale : 1; // 0x164
	FRawDistributionFloat NoiseScale; // 0x168
};

struct UAsyncActionChangePrimaryAssetBundles {
	FMulticastInlineDelegate COMPLETED; // 0x80
};

struct UHexBloodFavor {
	float _palletInRange[0x3]; // 0x440
	float _palletPulldownBlockTime[0x3]; // 0x44c
};

struct ULightmassPortalComponent {
	UBoxComponent* PreviewBox; // 0x210
};

struct UVariantSet {
	FText DisplayText; // 0x30
	bool bExpanded; // 0x60
	TArray<UVariant*> Variants; // 0x68
};

struct UMaterialExpressionMin {
	FExpressionInput A; // 0x48
	FExpressionInput B; // 0x64
	float ConstA; // 0x80
	float ConstB; // 0x84
};

struct UEnvQueryManager {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xb0
	TArray<UEnvQueryContext*> LocalContexts; // 0xc0
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xd0
	float MaxAllowedTestingTime; // 0x134
	bool bTestQueriesUsingBreadth; // 0x138
	int32_t QueryCountWarningThreshold; // 0x13c
	double QueryCountWarningInterval; // 0x140
};

struct UContextualQuestComponent {
	TArray<FSpecialBehaviourObjectsInfo> _specialBehaviourObjectsInfo; // 0xe0
	bool _isInitialized; // 0xf0
};

struct UCharacterPusherComponent {
	TArray<ACharacter*> _charactersToPush; // 0xe8
	TSet<ACharacter*> _ignoredCharacters; // 0xf8
	UCapsuleComponent* _characterDetector; // 0x148
	UCapsuleComponent* _characterCollision; // 0x150
	UBasePushStrategyComponent* _pushStrategy; // 0x158
	TArray<ACharacter*> _ignoredByPushedCharacters; // 0x160
};

struct UAnimSet {
	char bAnimRotationOnly : 1; // 0x30
	TArray<FName> TrackBoneNames; // 0x38
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x48
	TArray<char> BoneUseAnimTranslation; // 0x58
	TArray<char> ForceUseMeshTranslation; // 0x68
	TArray<FName> UseTranslationBoneNames; // 0x78
	TArray<FName> ForceMeshTranslationBoneNames; // 0x88
	FName PreviewSkelMeshName; // 0x98
	FName BestRatioSkelMeshName; // 0xa4
};

struct UMaterialExpressionCurveAtlasRowParameter {
	UCurveLinearColor* Curve; // 0x70
	UCurveLinearColorAtlas* Atlas; // 0x78
	FExpressionInput InputTime; // 0x80
};

struct ABaseProjectile {
	float OnImpactAINoiseEventRange; // 0x230
	bool _multicastLaunch; // 0x278
	bool _allowMultipleHits; // 0x279
	FGameplayTagContainer _semanticGameplayTags; // 0x280
	bool _notifyClientOfServerHitValidationResult; // 0x2a0
	UBaseProjectileReplicationComponent* _replicationComponent; // 0x2a8
};

struct UStateTagEvaluatorCondition {
	FGameplayTag _gameplayTag; // 0x48
};

struct UBlightPowerStateDash {
	FTunableStat _vectorInterpToSpeed; // 0x188
	UCurveFloat* _noDashTimeLimitSpeedCurve; // 0x208
	UCurveFloat* _lookAngleToTurnRateCurveController; // 0x210
	UCurveFloat* _lookAngleToTurnRateCurveMouse; // 0x218
	UCurveFloat* _lookAngleToMaxTurnRateCurveMouse; // 0x220
};

struct UVisionary {
	float _auraVisibilityRange[0x3]; // 0x3d0
	float _cooldownDuration[0x3]; // 0x3dc
};

struct ADatasmithAreaLightActor {
	EDatasmithAreaLightActorType LightType; // 0x230
	EDatasmithAreaLightActorShape LightShape; // 0x231
	FVector2D Dimensions; // 0x234
	float Intensity; // 0x23c
	ELightUnits IntensityUnits; // 0x240
	FLinearColor Color; // 0x244
	float Temperature; // 0x254
	UTextureLightProfile* IESTexture; // 0x258
	bool bUseIESBrightness; // 0x260
	float IESBrightnessScale; // 0x264
	FRotator Rotation; // 0x268
	float SourceRadius; // 0x274
	float SourceLength; // 0x278
	float AttenuationRadius; // 0x27c
	float SpotlightInnerAngle; // 0x280
	float SpotlightOuterAngle; // 0x284
};

struct UMaterialExpressionVectorParameter {
	FLinearColor defaultValue; // 0x68
	bool bUseCustomPrimitiveData; // 0x78
	char PrimitiveDataIndex; // 0x79
};

struct UBackgroundBlur {
	FMargin Padding; // 0x140
	EHorizontalAlignment HorizontalAlignment; // 0x150
	EVerticalAlignment VerticalAlignment; // 0x151
	bool bApplyAlphaToBlur; // 0x152
	float BlurStrength; // 0x154
	bool bOverrideAutoRadiusCalculation; // 0x158
	int32_t BlurRadius; // 0x15c
	FSlateBrush LowQualityFallbackBrush; // 0x160
};

struct UMaterialExpressionComment {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	FString Text; // 0x50
	FLinearColor CommentColor; // 0x60
	int32_t FontSize; // 0x70
};

struct UTutorialEndGameComponent {
	float _timerMaxCompletionPercentage; // 0x158
};

struct UAkGeometryComponent {
	AkMeshType MeshType; // 0x210
	int32_t LOD; // 0x214
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride; // 0x218
	FAkGeometrySurfaceOverride CollisionMeshSurfaceOverride; // 0x268
	char bEnableDiffraction : 1; // 0x278
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x278
	AActor* AssociatedRoom; // 0x280
	FAkGeometryData GeometryData; // 0x298
};

struct UBehaviorTreeManager {
	int32_t MaxDebuggerSteps; // 0x30
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x38
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x48
};

struct AWorldSettings {
	int32_t VisibilityCellSize; // 0x238
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x23c
	char bPrecomputeVisibility : 1; // 0x23d
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x23d
	char bEnableWorldBoundsChecks : 1; // 0x23d
	char bEnableNavigationSystem : 1; // 0x23d
	char bEnableAISystem : 1; // 0x23d
	char bEnableWorldComposition : 1; // 0x23d
	char bUseClientSideLevelStreamingVolumes : 1; // 0x23d
	char bEnableWorldOriginRebasing : 1; // 0x23d
	char bWorldGravitySet : 1; // 0x23e
	char bGlobalGravitySet : 1; // 0x23e
	char bMinimizeBSPSections : 1; // 0x23e
	char bForceNoPrecomputedLighting : 1; // 0x23e
	char bHighPriorityLoading : 1; // 0x23e
	char bHighPriorityLoadingLocal : 1; // 0x23e
	char bOverrideDefaultBroadphaseSettings : 1; // 0x23e
	UNavigationSystemConfig* NavigationSystemConfig; // 0x240
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x248
	float WorldToMeters; // 0x250
	float KillZ; // 0x254
	UDamageType* KillZDamageType; // 0x258
	float WorldGravityZ; // 0x260
	float GlobalGravityZ; // 0x264
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x268
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x270
	AGameModeBase* DefaultGameMode; // 0x278
	AGameNetworkManager* GameNetworkManagerClass; // 0x280
	int32_t PackedLightAndShadowMapTextureSize; // 0x288
	FVector DefaultColorScale; // 0x28c
	bool DoAllowBatching; // 0x298
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x29c
	float GlobalDistanceFieldViewDistance; // 0x2a0
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x2a4
	FReverbSettings DefaultReverbSettings; // 0x2a8
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2c8
	float MonoCullingDistance; // 0x2ec
	USoundMix* DefaultBaseSoundMix; // 0x2f0
	float TimeDilation; // 0x2f8
	float MatineeTimeDilation; // 0x2fc
	float DemoPlayTimeDilation; // 0x300
	float MinGlobalTimeDilation; // 0x304
	float MaxGlobalTimeDilation; // 0x308
	float MinUndilatedFrameTime; // 0x30c
	float MaxUndilatedFrameTime; // 0x310
	FBroadphaseSettings BroadphaseSettings; // 0x314
	APlayerState* Pauser; // 0x358
	TArray<FNetViewer> ReplicationViewers; // 0x360
	TArray<UAssetUserData*> AssetUserData; // 0x370
	APlayerState* PauserPlayerState; // 0x380
	int32_t MaxNumberOfBookmarks; // 0x388
	UBookmarkBase* DefaultBookmarkClass; // 0x390
	TArray<UBookmarkBase*> BookmarkArray; // 0x398
	UBookmarkBase* LastBookmarkClass; // 0x3a8
};

struct UVaultableOutlineUpdateStrategy {
	bool _canBeRevealedToLocalPlayer; // 0x130
};

struct UTargetOfEventRecentlyQEEvaluator {
	FGameplayTag _firstGameEvent; // 0x98
	bool _secondEventOnSelf; // 0xa4
};

struct UBlendProfile {
	USkeleton* OwningSkeleton; // 0x38
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x40
};

struct UWorldComposition {
	TArray<ULevelStreaming*> TilesStreaming; // 0x50
	double TilesStreamingTimeThreshold; // 0x60
	bool bLoadAllTilesDuringCinematic; // 0x68
	bool bRebaseOriginIn3DSpace; // 0x69
	float RebaseOriginDistance; // 0x6c
};

struct UMovieSceneGeometryCacheSection {
	FMovieSceneGeometryCacheParams Params; // 0xe8
};

struct UChainsawAnalyticsBaseComponent {
	float _maxDistanceFromHookToBeConsideredCamping; // 0xd0
};

struct UCannibalPowerPresentationItemProgressComponent {
	UCannibalChainsawPowerComponent* _cannibalPowerChainsawComponent; // 0xb8
};

struct UMeshEditingViewProperties {
	bool bShowWireframe; // 0x58
	EMeshEditingMaterialModes MaterialMode; // 0x5c
	bool bFlatShading; // 0x60
	FLinearColor Color; // 0x64
	UTexture2D* Image; // 0x78
};

struct UKillerBlindingFXComponent {
	UAkAudioEvent* _blindedSound; // 0x120
};

struct UMaterialExpressionTextureCoordinate {
	int32_t CoordinateIndex; // 0x48
	float UTiling; // 0x4c
	float VTiling; // 0x50
	char UnMirrorU : 1; // 0x54
	char UnMirrorV : 1; // 0x54
};

struct UControllerPairingManager {
	TWeakObjectPtr<UDBDGameInstance> _gameInstance; // 0x30
};

struct UUMGLoadoutFilterButton {
	UButton* ActionButton; // 0x300
	FMulticastInlineDelegate OnLoadoutFilterButtonClicked; // 0x308
};

struct ADBDCustomizationTool {
	TSoftClassPtr<UObject> OverallLightingClass; // 0x230
	FDBDCustomizationToolData CustomizationData; // 0x260
	TArray<AActor*> _spawnedActors; // 0xf38
};

struct UParticleModuleAccelerationDragScaleOverLife {
	UDistributionFloat* DragScale; // 0x40
	FRawDistributionFloat DragScaleRaw; // 0x48
};

struct UAnimationAsset {
	USkeleton* Skeleton; // 0x40
	TArray<UAnimMetaData*> MetaData; // 0x68
	TArray<UAssetUserData*> AssetUserData; // 0x78
};

struct UArrowComponent {
	FColor ArrowColor; // 0x428
	float ArrowSize; // 0x42c
	float ScreenSize; // 0x430
	char bIsScreenSizeScaled : 1; // 0x434
	char bTreatAsASprite : 1; // 0x434
};

struct APainCausingVolume {
	char bPainCausing : 1; // 0x278
	float DamagePerSec; // 0x27c
	UDamageType* DamageType; // 0x280
	float PainInterval; // 0x288
	char bEntryPain : 1; // 0x28c
	char BACKUP_bPainCausing : 1; // 0x28c
	AController* DamageInstigator; // 0x290
};

struct UBloodwebManager {
	UBloodwebGenerator* _bloodwebBuilderClass; // 0x60
	UDBDGameInstance* _gameInstance; // 0x68
	UDBDDesignTunables* _designTunables; // 0x70
	UBloodwebTunables* _bloodwebTunables; // 0x78
	TScriptInterface<IDBDBloodwebDefinitionBase> _bloodWebDefinition; // 0x80
	UBloodwebGenerator* _bloodwebBuilder; // 0x90
	UBloodwebEntity* _entity; // 0x98
	UBloodwebHandler* _bloodwebHandler; // 0xa0
};

struct UUMGPlayersStatusWidget {
	TMap<EPlayerRole, FCustomizedHudPlayerWrapperIdMapContainer> CustomizedHudWrapperIdMap; // 0x300
	TSoftClassPtr<UObject> PlayerStatusIconClass; // 0x350
	UHorizontalBox* playersContainer; // 0x380
	TMap<FString, UUMGPlayerStatusIcon*> playerIconsByName; // 0x388
};

struct UAddPrimitiveTool {
	UProceduralShapeToolProperties* ShapeSettings; // 0x98
	UNewMeshMaterialProperties* MaterialProperties; // 0xa0
	UPreviewMesh* PreviewMesh; // 0xa8
	ULastActorInfo* LastGenerated; // 0xb0
};

struct UCurveLinearColorAtlas {
	uint32_t TextureSize; // 0x108
	TArray<UCurveLinearColor*> GradientCurves; // 0x110
};

struct UMonoWaveTableSynthPreset {
	FString PresetName; // 0x30
	char bLockKeyframesToGridBool : 1; // 0x40
	int32_t LockKeyframesToGrid; // 0x44
	int32_t WaveTableResolution; // 0x48
	TArray<FRuntimeFloatCurve> WaveTable; // 0x50
	char bNormalizeWaveTables : 1; // 0x60
};

struct USetTrapInteraction {
	FSocketOrBoneCache _dropSocket; // 0x6d8
};

struct UK26DismissCrowChargeableInteractionDefinition {
	FTunableStat _chargeTime; // 0x6d8
	UK26PowerStatusHandlerComponent* _k26PowerStatusHandlerComponent; // 0x758
	bool _isLevelReadyToPlay; // 0x760
};

struct UEditableGameplayTagQueryExpression_NoExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x30
};

struct UCullingField {
	UFieldNodeBase* Culling; // 0xb8
	UFieldNodeBase* Field; // 0xc0
	EFieldCullingOperationType Operation; // 0xc8
};

struct UCoreHudObjectiveWidget {
	UDBDTextBlock* SpecialSpacer; // 0x300
};

struct UToFloatField {
	UFieldNodeInt* IntField; // 0xb8
};

struct UDrawPolyPathTool {
	UDrawPolyPathProperties* TransformProps; // 0xa8
	UDrawPolyPathExtrudeProperties* ExtrudeProperties; // 0xb0
	UNewMeshMaterialProperties* MaterialProperties; // 0xb8
	UConstructionPlaneMechanic* PlaneMechanic; // 0x140
	UPolyEditPreviewMesh* EditPreview; // 0x1e8
	UPlaneDistanceFromHitMechanic* ExtrudeHeightMechanic; // 0x1f0
	USpatialCurveDistanceMechanic* CurveDistMechanic; // 0x1f8
	UCollectSurfacePathMechanic* SurfacePathMechanic; // 0x200
};

struct UVRNotificationsComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb8
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc8
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd8
	FMulticastInlineDelegate HMDLostDelegate; // 0xe8
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf8
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x108
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x118
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x128
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x138
};

struct AEntity {
	UCurveFloat* _dissolveCurve; // 0x230
	UCurveFloat* _revealsCurve; // 0x238
	UMaterialHelper* _materialHelper; // 0x240
	USkeletalMeshComponent* _skeletalMesh; // 0x248
};

struct UMeshRotationCorrectionSubAnimInstance {
	float _rotationInterpSpeed; // 0x4f0
	bool _isCrawling; // 0x4f4
	FRotator _toSlopeRotation; // 0x4f8
	UCharacterMovementComponent* _movementComponent; // 0x508
};

struct UEditableTextBox {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FEditableTextBoxStyle WidgetStyle; // 0x158
	USlateWidgetStyleAsset* Style; // 0x9b8
	FText HintText; // 0x9c0
	FDelegate HintTextDelegate; // 0x9d8
	FSlateFontInfo Font; // 0x9f0
	FLinearColor ForegroundColor; // 0xa48
	FLinearColor BackgroundColor; // 0xa58
	FLinearColor ReadOnlyForegroundColor; // 0xa68
	bool IsReadOnly; // 0xa78
	bool IsPassword; // 0xa79
	float MinimumDesiredWidth; // 0xa7c
	FMargin Padding; // 0xa80
	bool IsCaretMovedWhenGainFocus; // 0xa90
	bool SelectAllTextWhenFocused; // 0xa91
	bool RevertTextOnEscape; // 0xa92
	bool ClearKeyboardFocusOnCommit; // 0xa93
	bool SelectAllTextOnCommit; // 0xa94
	bool AllowContextMenu; // 0xa95
	EVirtualKeyboardType KeyboardType; // 0xa96
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xa97
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa98
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa99
	ETextJustify Justification; // 0xa9a
	FShapedTextOptions ShapedTextOptions; // 0xa9b
	FMulticastInlineDelegate OnTextChanged; // 0xaa0
	FMulticastInlineDelegate OnTextCommitted; // 0xab0
};

struct UMaterialExpressionSkyAtmosphereAerialPerspective {
	FExpressionInput WorldPosition; // 0x48
};

struct UMaterialExpressionPreviousFrameSwitch {
	FExpressionInput CurrentFrame; // 0x48
	FExpressionInput PreviousFrame; // 0x64
};

struct UImgMediaSource {
	FFrameRate FrameRateOverride; // 0x98
	FString ProxyOverride; // 0xa0
	FDirectoryPath SequencePath; // 0xb0
};

struct UUMGBaseCurrencyButtonWidget {
	UImage* FXImage; // 0x430
	UImage* CurrencyColorImage; // 0x438
	UImage* CurrencyIcon; // 0x440
	UTextBlock* PriceText; // 0x448
	FSlateColor AffordableColor; // 0x450
	FSlateColor NotAffordableColor; // 0x478
	FLinearColor DisabledOpacity; // 0x4a0
	FLinearColor EnabledOpacity; // 0x4b0
};

struct UExhaustedEffect {
	float CooldownModifier; // 0x360
};

struct UMaterialExpressionCustom {
	FString Code; // 0x48
	ECustomMaterialOutputType OutputType; // 0x58
	FString Description; // 0x60
	TArray<FCustomInput> Inputs; // 0x70
	TArray<FCustomDefine> AdditionalDefines; // 0x80
	TArray<FString> IncludeFilePaths; // 0x90
};

struct UBTDecorator_IsInteractionAvailable {
	TArray<FString> InteractionIds; // 0x70
	EIsInteractionAvailableOnFilter OnFilter; // 0x80
	bool FailIfAnotherOngoingInteraction; // 0x81
	bool FailIfNotPerformingInteraction; // 0x82
};

struct UAlert {
	float _killerAuraRevealDuration[0x3]; // 0x3d0
	UStatusEffect* _alertKillerRevealEffect; // 0x3e0
};

struct UCharacterSightComponent {
	float _minimumCharacterScreenPercent; // 0xf0
	float _minimumCharacterVisiblePixelsPercent; // 0xf4
	float _maximumSightDistance; // 0xf8
	float _screenVisibilityZoneRadiusPercent; // 0xfc
	float _sightingDelay; // 0x100
	float _discerningDelay; // 0x104
	float _undiscerningDelay; // 0x108
	ACharacter* _sightableCharacterClass; // 0x110
	TArray<FAuthorityDiscernedCharacter> _discernedCharacters; // 0x118
	TArray<FDiscernibleCharacter> _localDiscernibleCharacters; // 0x128
	bool _debugMode; // 0x148
	bool _canSee; // 0x149
	FActivationDefinition _activationDefinition; // 0x150
};

struct AMagicFountain {
	FVector AIInteractionOffset; // 0x330
};

struct UBoxComponent {
	FVector BoxExtent; // 0x440
	float LineThickness; // 0x44c
};

struct UParticleModuleAccelerationOverLifetime {
	FRawDistributionVector AccelOverLife; // 0x40
};

struct UARTrackedImage {
	UARCandidateImage* DetectedImage; // 0xf0
	FVector2D EstimatedSize; // 0xf8
};

struct UChargerComponent {
	FString ChargerComponentID; // 0xc0
	FMulticastInlineDelegate OnChargeStateChange; // 0xd0
	FMulticastInlineDelegate OnChargePercentChange; // 0xe0
	EEnergyTypeEnum EnergyType; // 0x108
	float _currentEnergyLevel; // 0x10c
	float _maxEnergyLevel; // 0x110
};

struct UNiagaraDataInterfaceChaosDestruction {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x38
	EDataSourceTypeEnum DataSourceType; // 0x88
	int32_t DataProcessFrequency; // 0x8c
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90
	bool DoSpawn; // 0x94
	FVector2D SpawnMultiplierMinMax; // 0x98
	float SpawnChance; // 0xa0
	FVector2D ImpulseToSpawnMinMax; // 0xa4
	FVector2D SpeedToSpawnMinMax; // 0xac
	FVector2D MassToSpawnMinMax; // 0xb4
	FVector2D ExtentMinToSpawnMinMax; // 0xbc
	FVector2D ExtentMaxToSpawnMinMax; // 0xc4
	FVector2D VolumeToSpawnMinMax; // 0xcc
	FVector2D SolverTimeToSpawnMinMax; // 0xd4
	int32_t SurfaceTypeToSpawn; // 0xdc
	ELocationFilteringModeEnum LocationFilteringMode; // 0xe0
	ELocationXToSpawnEnum LocationXToSpawn; // 0xe1
	FVector2D LocationXToSpawnMinMax; // 0xe4
	ELocationYToSpawnEnum LocationYToSpawn; // 0xec
	FVector2D LocationYToSpawnMinMax; // 0xf0
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf8
	FVector2D LocationZToSpawnMinMax; // 0xfc
	EDataSortTypeEnum DataSortingType; // 0x104
	bool bGetExternalCollisionData; // 0x105
	bool DoSpatialHash; // 0x106
	FVector SpatialHashVolumeMin; // 0x108
	FVector SpatialHashVolumeMax; // 0x114
	FVector SpatialHashVolumeCellSize; // 0x120
	int32_t MaxDataPerCell; // 0x12c
	bool bApplyMaterialsFilter; // 0x130
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138
	bool bGetExternalBreakingData; // 0x188
	bool bGetExternalTrailingData; // 0x189
	FVector2D RandomPositionMagnitudeMinMax; // 0x18c
	float InheritedVelocityMultiplier; // 0x194
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198
	FVector2D RandomVelocityMagnitudeMinMax; // 0x19c
	float SpreadAngleMax; // 0x1a4
	FVector VelocityOffsetMin; // 0x1a8
	FVector VelocityOffsetMax; // 0x1b4
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0
	float MaxLatency; // 0x1c8
	EDebugTypeEnum DebugType; // 0x1cc
	int32_t LastSpawnedPointID; // 0x1d0
	float LastSpawnTime; // 0x1d4
	float SolverTime; // 0x1e8
	float TimeStampOfLastProcessedData; // 0x1ec
};

struct UBlackboardKeyType_NativeEnum {
	FString EnumName; // 0x38
	UEnum* EnumType; // 0x48
};

struct UAISlasherChaseAndAttackBehaviour {
	UAISlasherChaseAndAttackBehaviourData* _behaviourData; // 0x58
	ASlasherPlayer* _slasherPlayer; // 0x60
	ADBDAIPlayerController* _slasherAIPlayerController; // 0x68
};

struct UBTDecorator_RandomByDistance {
	FBlackboardKeySelector BBAroundLoc; // 0x70
	FBlackboardKeySelector BBRelativeFromTime; // 0xa0
	FBlackboardKeySelector BBRelativeToTime; // 0xd0
	FAITunableParameter StartDistance; // 0x100
	FAITunableParameter EndDistance; // 0x110
	FAITunableParameter PercentageAtStartDistance; // 0x120
	FAITunableParameter PercentageAtEndDistance; // 0x130
	TArray<FAIRandomByDistancePercentagesAtTime> PercentagesAtTimes; // 0x140
};

struct UCamperSlashableComponent {
	UCapsuleComponent* _slashableZone; // 0xc0
	UCapsuleComponent* _hookSlashableZone; // 0xc8
	float _standingCapsuleHalfHeight; // 0xd0
	float _crouchCapsuleHalfHeight; // 0xd4
	FGameplayTagContainer _slashableDisablingStateTags; // 0xd8
	float _sourceActivationLingerDuration; // 0xf8
	USlashableActivationSourceCollection* _slashableActivationSources; // 0x128
};

struct UUMGPromoPackSelectedItemWidget {
	UUMGHtmlRichText* ItemDescription; // 0x300
	UImage* ItemTypeIcon; // 0x308
	UTextBlock* ItemName; // 0x310
	UTextBlock* ItemSubTitle; // 0x318
	UNamedSlot* SelectedItemSlot; // 0x320
	UUMGPromoPackItemWidget* SelectedItem; // 0x328
	UScrollBox* ScrollBox; // 0x330
};

struct UBaseGroundDetectorComponent {
	FName _startTransformName; // 0x168
	ECollisionChannel _walkableCollisionChannel; // 0x174
	bool _traceComplex; // 0x175
	float _extraTraceDistance; // 0x178
	USkinnedMeshComponent* _skinnedMeshComponent; // 0x180
	FName _startSlopeTransformName; // 0x190
};

struct ULightBurnableFlashlightTargetFXComponent {
	ULightBurnable* _burnable; // 0x100
};

struct USurvivorPlagueEffect {
	float _sicknessAmount; // 0x398
	float _sicknessCap; // 0x39c
	float _vomitSlowDuration; // 0x3a0
	float _vomitSlowAmount; // 0x3a4
	TArray<float> _sicknessThresholds; // 0x3a8
	bool _wasRecentlyHitByVomit; // 0x3b8
	TArray<FString> _nonNauseatingInteractions; // 0x3c0
	FTunableStat _sicknessGainPerSecondFromInfectedInteractable; // 0x3e8
	bool _debugMode; // 0x4f8
};

struct UNetConnection {
	TArray<UChildConnection*> Children; // 0x50
	UNetDriver* Driver; // 0x60
	UPackageMap* PackageMapClass; // 0x68
	UPackageMap* PackageMap; // 0x70
	TArray<UChannel*> OpenChannels; // 0x78
	TArray<AActor*> SentTemporaries; // 0x88
	AActor* ViewTarget; // 0x98
	AActor* OwningActor; // 0xa0
	int32_t MaxPacket; // 0xa8
	char InternalAck : 1; // 0xac
	FUniqueNetIdRepl playerID; // 0x168
	double LastReceiveTime; // 0x1d8
	TArray<UChannel*> ChannelsToTick; // 0x1518
};

struct UEngine {
	UFont* TinyFont; // 0x38
	FSoftObjectPath TinyFontName; // 0x40
	UFont* SmallFont; // 0x60
	FSoftObjectPath SmallFontName; // 0x68
	UFont* MediumFont; // 0x88
	FSoftObjectPath MediumFontName; // 0x90
	UFont* LargeFont; // 0xb0
	FSoftObjectPath LargeFontName; // 0xb8
	UFont* SubtitleFont; // 0xd8
	FSoftObjectPath SubtitleFontName; // 0xe0
	TArray<UFont*> AdditionalFonts; // 0x100
	TArray<FString> AdditionalFontNames; // 0x118
	UConsole* ConsoleClass; // 0x128
	FSoftClassPath ConsoleClassName; // 0x130
	UGameViewportClient* GameViewportClientClass; // 0x150
	FSoftClassPath GameViewportClientClassName; // 0x158
	ULocalPlayer* LocalPlayerClass; // 0x178
	FSoftClassPath LocalPlayerClassName; // 0x180
	AWorldSettings* WorldSettingsClass; // 0x1a0
	FSoftClassPath WorldSettingsClassName; // 0x1a8
	FSoftClassPath NavigationSystemClassName; // 0x1c8
	UNavigationSystemBase* NavigationSystemClass; // 0x1e8
	FSoftClassPath NavigationSystemConfigClassName; // 0x1f0
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x210
	FSoftClassPath AvoidanceManagerClassName; // 0x218
	UAvoidanceManager* AvoidanceManagerClass; // 0x238
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x240
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x248
	FSoftClassPath GameUserSettingsClassName; // 0x268
	UGameUserSettings* GameUserSettingsClass; // 0x288
	FSoftClassPath AIControllerClassName; // 0x290
	UGameUserSettings* GameUserSettings; // 0x2b0
	ALevelScriptActor* LevelScriptActorClass; // 0x2b8
	FSoftClassPath LevelScriptActorClassName; // 0x2c0
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x2e0
	FSoftClassPath GameSingletonClassName; // 0x300
	UObject* GameSingleton; // 0x320
	FSoftClassPath AssetManagerClassName; // 0x328
	UAssetManager* AssetManager; // 0x348
	UTexture2D* DefaultTexture; // 0x350
	FSoftObjectPath DefaultTextureName; // 0x358
	UTexture* DefaultDiffuseTexture; // 0x378
	FSoftObjectPath DefaultDiffuseTextureName; // 0x380
	UTexture2D* DefaultBSPVertexTexture; // 0x3a0
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x3a8
	UTexture2D* HighFrequencyNoiseTexture; // 0x3c8
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x3d0
	UTexture2D* DefaultBokehTexture; // 0x3f0
	FSoftObjectPath DefaultBokehTextureName; // 0x3f8
	UTexture2D* DefaultBloomKernelTexture; // 0x418
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x420
	UMaterial* WireframeMaterial; // 0x440
	FString WireframeMaterialName; // 0x448
	UMaterial* DebugMeshMaterial; // 0x458
	FSoftObjectPath DebugMeshMaterialName; // 0x460
	UMaterial* EmissiveMeshMaterial; // 0x480
	FSoftObjectPath EmissiveMeshMaterialName; // 0x488
	UMaterial* LevelColorationLitMaterial; // 0x4a8
	FString LevelColorationLitMaterialName; // 0x4b0
	UMaterial* LevelColorationUnlitMaterial; // 0x4c0
	FString LevelColorationUnlitMaterialName; // 0x4c8
	UMaterial* LightingTexelDensityMaterial; // 0x4d8
	FString LightingTexelDensityName; // 0x4e0
	UMaterial* ShadedLevelColorationLitMaterial; // 0x4f0
	FString ShadedLevelColorationLitMaterialName; // 0x4f8
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x508
	FString ShadedLevelColorationUnlitMaterialName; // 0x510
	UMaterial* RemoveSurfaceMaterial; // 0x520
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x528
	UMaterial* VertexColorMaterial; // 0x548
	FString VertexColorMaterialName; // 0x550
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x560
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x568
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x578
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x580
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x590
	FString VertexColorViewModeMaterialName_RedOnly; // 0x598
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x5a8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x5b0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x5c0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x5c8
	FSoftObjectPath DebugEditorMaterialName; // 0x5d8
	UMaterial* ConstraintLimitMaterial; // 0x5f8
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x600
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x608
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x610
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x618
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x620
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x628
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x630
	UMaterial* InvalidLightmapSettingsMaterial; // 0x638
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x640
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x660
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x668
	UMaterial* ArrowMaterial; // 0x688
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x690
	FSoftObjectPath ArrowMaterialName; // 0x698
	FLinearColor LightingOnlyBrightness; // 0x6b8
	TArray<FLinearColor> ShaderComplexityColors; // 0x6c8
	TArray<FLinearColor> QuadComplexityColors; // 0x6d8
	TArray<FLinearColor> LightComplexityColors; // 0x6e8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x6f8
	TArray<FLinearColor> LODColorationColors; // 0x708
	TArray<FLinearColor> HLODColorationColors; // 0x718
	TArray<FLinearColor> StreamingAccuracyColors; // 0x728
	float MaxPixelShaderAdditiveComplexityCount; // 0x738
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x73c
	float MinLightMapDensity; // 0x740
	float IdealLightMapDensity; // 0x744
	float MaxLightMapDensity; // 0x748
	char bRenderLightMapDensityGrayscale : 1; // 0x74c
	float RenderLightMapDensityGrayscaleScale; // 0x750
	float RenderLightMapDensityColorScale; // 0x754
	FLinearColor LightMapDensityVertexMappedColor; // 0x758
	FLinearColor LightMapDensitySelectedColor; // 0x768
	TArray<FStatColorMapping> StatColorMappings; // 0x778
	UPhysicalMaterial* DefaultPhysMaterial; // 0x788
	FSoftObjectPath DefaultPhysMaterialName; // 0x790
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x7b0
	TArray<FClassRedirect> ActiveClassRedirects; // 0x7c0
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x7d0
	TArray<FStructRedirect> ActiveStructRedirects; // 0x7e0
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x7f0
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x7f8
	UTexture2D* BlueNoiseTexture; // 0x818
	FSoftObjectPath BlueNoiseTextureName; // 0x820
	UTexture2D* MiniFontTexture; // 0x840
	FSoftObjectPath MiniFontTextureName; // 0x848
	UTexture* WeightMapPlaceholderTexture; // 0x868
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x870
	UTexture2D* LightMapDensityTexture; // 0x890
	FSoftObjectPath LightMapDensityTextureName; // 0x898
	UGameViewportClient* GameViewport; // 0x8c0
	TArray<FString> DeferredCommands; // 0x8c8
	int32_t TickCycles; // 0x8d8
	int32_t GameCycles; // 0x8dc
	int32_t ClientCycles; // 0x8e0
	float NearClipPlane; // 0x8e4
	char bHardwareSurveyEnabled : 1; // 0x8e8
	char bSubtitlesEnabled : 1; // 0x8e8
	char bSubtitlesForcedOff : 1; // 0x8e8
	int32_t MaximumLoopIterationCount; // 0x8ec
	char bCanBlueprintsTickByDefault : 1; // 0x8f0
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x8f0
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x8f0
	char bEnableEditorPSysRealtimeLOD : 1; // 0x8f0
	char bSmoothFrameRate : 1; // 0x8f0
	char bUseFixedFrameRate : 1; // 0x8f0
	float FixedFrameRate; // 0x8f4
	FFloatRange SmoothedFrameRateRange; // 0x8f8
	UEngineCustomTimeStep* CustomTimeStep; // 0x908
	FSoftClassPath CustomTimeStepClassName; // 0x930
	UTimecodeProvider* TimecodeProvider; // 0x950
	FSoftClassPath TimecodeProviderClassName; // 0x978
	bool bGenerateDefaultTimecode; // 0x998
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x99c
	float GenerateDefaultTimecodeFrameDelay; // 0x9a4
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x9a8
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x9ac
	char bShouldGenerateLowQualityLightmaps : 1; // 0x9b0
	FColor C_WorldBox; // 0x9b4
	FColor C_BrushWire; // 0x9b8
	FColor C_AddWire; // 0x9bc
	FColor C_SubtractWire; // 0x9c0
	FColor C_SemiSolidWire; // 0x9c4
	FColor C_NonSolidWire; // 0x9c8
	FColor C_WireBackground; // 0x9cc
	FColor C_ScaleBoxHi; // 0x9d0
	FColor C_VolumeCollision; // 0x9d4
	FColor C_BSPCollision; // 0x9d8
	FColor C_OrthoBackground; // 0x9dc
	FColor C_Volume; // 0x9e0
	FColor C_BrushShape; // 0x9e4
	float StreamingDistanceFactor; // 0x9e8
	FDirectoryPath GameScreenshotSaveDirectory; // 0x9f0
	ETransitionType TransitionType; // 0xa00
	FString TransitionDescription; // 0xa08
	FString TransitionGameMode; // 0xa18
	float MeshLODRange; // 0xa28
	char bAllowMatureLanguage : 1; // 0xa2c
	float CameraRotationThreshold; // 0xa30
	float CameraTranslationThreshold; // 0xa34
	float PrimitiveProbablyVisibleTime; // 0xa38
	float MaxOcclusionPixelsFraction; // 0xa3c
	char bPauseOnLossOfFocus : 1; // 0xa40
	int32_t MaxParticleResize; // 0xa44
	int32_t MaxParticleResizeWarn; // 0xa48
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0xa50
	float NetClientTicksPerSecond; // 0xa60
	float DisplayGamma; // 0xa64
	float MinDesiredFrameRate; // 0xa68
	FLinearColor DefaultSelectedMaterialColor; // 0xa6c
	FLinearColor SelectedMaterialColor; // 0xa7c
	FLinearColor SelectionOutlineColor; // 0xa8c
	FLinearColor SubduedSelectionOutlineColor; // 0xa9c
	FLinearColor SelectedMaterialColorOverride; // 0xaac
	bool bIsOverridingSelectedColor; // 0xabc
	char bEnableOnScreenDebugMessages : 1; // 0xac0
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0xac0
	char bSuppressMapWarnings : 1; // 0xac0
	char bDisableAILogging : 1; // 0xac0
	uint32_t bEnableVisualLogRecordingOnStart; // 0xac4
	int32_t ScreenSaverInhibitorSemaphore; // 0xacc
	char bLockReadOnlyLevels : 1; // 0xad0
	FString ParticleEventManagerClassPath; // 0xad8
	float SelectionHighlightIntensity; // 0xae8
	float BSPSelectionHighlightIntensity; // 0xaec
	float SelectionHighlightIntensityBillboards; // 0xaf0
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xd40
	TArray<FString> ServerActors; // 0xd50
	TArray<FString> RuntimeServerActors; // 0xd60
	float NetErrorLogInterval; // 0xd70
	char bStartedLoadMapMovie : 1; // 0xd74
	int32_t NextWorldContextHandle; // 0xd90
};

struct UParticleModuleLocationPrimitiveSphere {
	FRawDistributionFloat StartRadius; // 0xb8
};

struct UMaterialExpressionChannelMaskParameter {
	EChannelMaskParameterColor MaskChannel; // 0x80
	FExpressionInput Input; // 0x84
};

struct UJoinSessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x38
	FMulticastInlineDelegate OnFailure; // 0x48
};

struct AgameMode {
	FName MatchState; // 0x2d8
	char bDelayedStart : 1; // 0x2e4
	int32_t NumSpectators; // 0x2e8
	int32_t NumPlayers; // 0x2ec
	int32_t NumBots; // 0x2f0
	float MinRespawnDelay; // 0x2f4
	int32_t NumTravellingPlayers; // 0x2f8
	ULocalMessage* EngineMessageClass; // 0x300
	TArray<APlayerState*> InactivePlayerArray; // 0x308
	float InactivePlayerStateLifeSpan; // 0x318
	int32_t MaxInactivePlayers; // 0x31c
	bool bHandleDedicatedServerReplays; // 0x320
};

struct ABandwidthTestActor {
