// Created by BlueFire1337
// Updated 2021-11-26
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x51e3440;
	constexpr auto GObjects = 0x51fb9e8;
	constexpr auto GWorld = 0x5335d50;
}

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct UBTTask_FlyTo : UBTTaskNode {
	FBlackboardKeySelector FlightLocationKey; // 0x70
	FBlackboardKeySelector FlightResultKey; // 0x98
	FBlackboardKeySelector KeyToFlipFlopWhenTaskExits; // 0xc0
	float MinimumProximityRequired; // 0xe8
	char bRecalcPathOnDestinationChanged : 1; // 0xec
	float RecalculatePathTolerance; // 0xf0
	FDoNNavigationQueryParams queryParams; // 0xf8
	FBT_FlyToTarget_DebugParams DebugParams; // 0x118
	ADonNavigationManager* NavigationManager; // 0x128
	bool bTeleportToDestinationUponFailure; // 0x130
	float MaxTimeBeforeTeleport; // 0x134
};

struct UMovieSceneAkAudioRTPCSection : UMovieSceneSection {
	UAkRtpc* RTPC; // 0xe8
	FString Name; // 0xf0
	FRichCurve FloatCurve; // 0x100
	FMovieSceneFloatChannelSerializationHelper FloatChannelSerializationHelper; // 0x180
	FMovieSceneFloatChannel RTPCChannel; // 0x1b0
};

struct UAsyncTaskDownloadImage : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct UMotionControllerComponent : UPrimitiveComponent {
	int32_t PlayerIndex; // 0x440
	EControllerHand hand; // 0x444
	FName MotionSource; // 0x448
	char bDisableLowLatencyUpdate : 1; // 0x450
	ETrackingStatus CurrentTrackingStatus; // 0x454
	bool bDisplayDeviceModel; // 0x455
	FName DisplayModelSource; // 0x458
	UStaticMesh* CustomDisplayMesh; // 0x460
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x468
	UPrimitiveComponent* DisplayComponent; // 0x4e0
};

struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	FName ParameterName; // 0x60
	FGuid ExpressionGUID; // 0x68
	FName Group; // 0x78
};

struct UBP_GameSettingsWrapper_C : UObject {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
	UBP_GameSettings_C* Game Settings; // 0x30
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct UParticleModuleTypeDataAnimTrail : UParticleModuleTypeDataBase {
	char bDeadTrailsOnDeactivate : 1; // 0x30
	char bEnablePreviousTangentRecalculation : 1; // 0x30
	char bTangentRecalculationEveryFrame : 1; // 0x30
	float TilingDistance; // 0x34
	float DistanceTessellationStepSize; // 0x38
	float TangentTessellationStepSize; // 0x3c
	float WidthTessellationStepSize; // 0x40
};

struct UMovieSceneEventSection : UMovieSceneSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct ABP_CeilingBuildPartBase1_C : ABP_StaticMeshBuildPartBase_C {
	UBoxComponent* WeatherProof; // 0x860
	UStaticMeshComponent* Cube_StabilityWarning; // 0x868
	float StabilityMulitplyByWall; // 0x870
	float StabilityMulitplyByHasPillarCeiling; // 0x874
	bool HasPillar; // 0x878
	float InnerSideDamageMultiplier; // 0x87c
	float StabilityMultiplyByPillar; // 0x880
	float StabilityMultiplyByCenterPillar; // 0x884
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct UMovieSceneMediaSection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLooping; // 0xf0
	FFrameNumber StartFrameOffset; // 0xf4
	UMediaTexture* MediaTexture; // 0xf8
	UMediaSoundComponent* MediaSoundComponent; // 0x100
	bool bUseExternalMediaPlayer; // 0x108
	UMediaPlayer* ExternalMediaPlayer; // 0x110
};

struct UInterpTrackAnimControl : UInterpTrackFloatBase {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct UMovieSceneCameraShakeSourceTriggerTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x440
	int32_t SectionBaseY; // 0x444
	int32_t ComponentSizeQuads; // 0x448
	int32_t SubsectionSizeQuads; // 0x44c
	int32_t NumSubsections; // 0x450
	UMaterialInterface* OverrideMaterial; // 0x458
	UMaterialInterface* OverrideHoleMaterial; // 0x460
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x468
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x478
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x488
	TArray<int8_t> LODIndexToMaterialIndex; // 0x498
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4a8
	UTexture2D* XYOffsetmapTexture; // 0x4b8
	FVector4 WeightmapScaleBias; // 0x4c0
	float WeightmapSubsectionOffset; // 0x4d0
	FVector4 HeightmapScaleBias; // 0x4e0
	FBox CachedLocalBox; // 0x4f0
	LazyObjectProperty CollisionComponent; // 0x50c
	UTexture2D* HeightmapTexture; // 0x528
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x530
	TArray<UTexture2D*> WeightmapTextures; // 0x540
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x550
	FGuid MapBuildDataId; // 0x558
	TArray<FGuid> IrrelevantLights; // 0x568
	int32_t CollisionMipLevel; // 0x578
	int32_t SimpleCollisionMipLevel; // 0x57c
	float NegativeZBoundsExtension; // 0x580
	float PositiveZBoundsExtension; // 0x584
	float StaticLightingResolution; // 0x588
	int32_t ForcedLOD; // 0x58c
	int32_t LODBias; // 0x590
	FGuid StateId; // 0x594
	FGuid BakedTextureMaterialGuid; // 0x5a4
	UTexture2D* GIBakedBaseColorTexture; // 0x5b8
	char MobileBlendableLayerMask; // 0x5c0
	UMaterialInterface* MobileMaterialInterface; // 0x5c8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5d0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5e0
};

struct ABP_WaterGenerator_C : ABP_FunctionalityBuildPartBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x890
	UBP_StorageInventoryComponent_C* WaterSupply; // 0x898
	UWaterStorageComponentBase* WaterStorageComponentBase; // 0x8a0
	FTimerHandle WorkingTimer; // 0x8a8
	float DefaultGenerateWaterPerSec; // 0x8b0
	float RainyGenerateWaterMultiply; // 0x8b4
	float InnerBoundaryReduceMultiply; // 0x8b8
	bool bHasWeatherProofComp; // 0x8bc
	float WeatherProofCheckInterval; // 0x8c0
	FTimerHandle WeatherProofCheckTimer; // 0x8c8
	float EnergyCostPerTime; // 0x8d0
	float WaterGenerateInterval; // 0x8d4
};

struct ANavigationObjectBase : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UBillboardComponent* GoodSprite; // 0x230
	UBillboardComponent* BadSprite; // 0x238
	char bIsPIEPlayerStart : 1; // 0x240
};

struct UWBP_HUD_ActionMain_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_78; // 0x268
	UImage* Mode; // 0x270
	TMap<E_MechanicArmMode, FSlateBrush> Icon; // 0x278
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct UIFO_SG_Goofy_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2f8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x340
};

struct UBP_AbnormalStateComponent_C : UCustomReplicationActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb8
	TArray<float> AbnormalState; // 0xc0
	TMap<E_AbnormalStateType, UCurveFloat*> AbnormalLevelInfo; // 0xd0
	TMap<E_AbnormalStateType, float> RecoveryPerSec; // 0x120
	TArray<float> AccumulatedTime; // 0x170
	TMap<E_AbnormalStateType, FS_IntFloatMap> Interval; // 0x180
	TMap<E_AbnormalStateType, int32_t> LastSendLevel; // 0x1d0
};

struct UBTTask_RangeAttack_Juggernaut_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	float DelayTime; // 0xb0
	FBlackboardKeySelector IsRangeAttack; // 0xb8
	FBlackboardKeySelector TargetActor; // 0xe0
	FVector BackMoveLocation; // 0x108
	FBlackboardKeySelector Aggro; // 0x118
	FBlackboardKeySelector IsSelectAttackType; // 0x140
	FBlackboardKeySelector IsRangeAttackOther; // 0x168
	FBlackboardKeySelector IsMeleeAttack; // 0x190
	FBlackboardKeySelector IsWalkingAttack; // 0x1b8
	FBlackboardKeySelector IsExecutionAttack; // 0x1e0
};

struct UCloudWatchDeleteAnomalyDetector : UAwsCloudWatchAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UWBP_Main_MachineArm_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_S_List; // 0x268
	UWidgetAnimation* Anim_M_List; // 0x270
	UHorizontalBox* HorizontalBox_332; // 0x278
	UImage* Image_106; // 0x280
	UVerticalBox* SubCategoryList; // 0x288
	UWBP_Main_MachineArmListing_L_C* WBP_Main_MachineArmListing_L; // 0x290
	UWBP_Main_MachineArmListing_M_C* WBP_Main_MachineArmListing_M; // 0x298
	UWBP_Main_MachineArmListing_S_C* WBP_Main_MachineArmListing_S; // 0x2a0
	UWBP_MainFrame_C* WBP_MainFrame; // 0x2a8
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header; // 0x2b0
	UWrapBox* WrapBox_Large; // 0x2b8
	UWBP_Main_MachineArmListing_M_C* PrevSelectedSubCategory; // 0x2c0
	TMap<int32_t, UWBP_Main_MachineArmListing_L_C*> CategoryMap; // 0x2c8
	TMap<int32_t, UWBP_Main_MachineArmListing_M_C*> SubMap; // 0x318
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat StartRotation; // 0x30
};

struct UInterpTrack : UObject {
	TArray<UInterpTrack*> SubTracks; // 0x38
	UInterpTrackInst* TrackInstClass; // 0x48
	ETrackActiveCondition ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	char bOnePerGroup : 1; // 0x68
	char bDirGroupOnly : 1; // 0x68
	char bDisableTrack : 1; // 0x68
	char bIsSelected : 1; // 0x68
	char bIsAnimControlTrack : 1; // 0x68
	char bSubTrackOnly : 1; // 0x68
	char bVisible : 1; // 0x68
	char bIsRecording : 1; // 0x68
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xe8
	FMovieSceneFloatChannel LeftCurve; // 0x188
	FMovieSceneFloatChannel RightCurve; // 0x228
	FMovieSceneFloatChannel BottomCurve; // 0x2c8
};

struct UPhononGeometryComponent : USceneComponent {
	bool ExportAllChildren; // 0x1f8
	uint32_t NumVertices; // 0x1fc
	uint32_t NumTriangles; // 0x200
};

struct USQSCreateQueue : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UWBP_Radiogram_6010103_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x2a8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x2b0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x2b8
};

struct ABP_Cyclops_Type00_C : ACommonAI_BaseAICharacter_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe28
	bool IsAlert; // 0xe30
};

struct UWBP_CraftingCostListing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Amount; // 0x268
	UWBP_Button_UI_C* ButtonTo; // 0x270
	UImage* Image_54; // 0x278
	UTextBlock* Name; // 0x280
	UWBP_Slot_Display_C* WBP_Slot_Display; // 0x288
	UBP_PlayerInventoryComponent_C* PlayerInv; // 0x290
	E_CraftingType CraftingCategoryType; // 0x298
	int32_t Item ID; // 0x29c
	int32_t AmountCount; // 0x2a0
	int32_t Product; // 0x2a4
};

struct USpotEventTypeData_SupplyDrop_C : USpotEventTypeData_Base_C {
	TArray<FItemCodeValue> RandItemGenerate; // 0xc8
	float LifetimeAfterDrop; // 0xd8
};

struct USupplyTurret_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3f0
	FAnimNode_Root AnimGraphNode_Root; // 0x4f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x528
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x570
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5f0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x620
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6d0
	float Yaw; // 0x6f0
	float Pitch; // 0x6f4
	FRotator ActorRot; // 0x6f8
	ABP_TurretBase_C* Turret; // 0x708
	bool IsFolded; // 0x710
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UAISenseEvent_Hearing : UAISenseEvent {
	FAINoiseEvent Event; // 0x28
};

struct ABP_ThrownFragGrenade_C : ABP_ThrownGrenade_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
	float BombDamage; // 0x3d0
	float BombMinimalDamage; // 0x3d4
	float InnerRadius; // 0x3d8
	float OuterRadius; // 0x3dc
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UMovieSceneCameraAnimSection : UMovieSceneSection {
	FMovieSceneCameraAnimSectionData AnimData; // 0xe8
	UCameraAnim* CameraAnim; // 0x108
	float PlayRate; // 0x110
	float PlayScale; // 0x114
	float BlendInTime; // 0x118
	float BlendOutTime; // 0x11c
	bool bLooping; // 0x120
};

struct UMutableMaskOutCache : UObject {
	TMap<FString, FString> Materials; // 0x28
	TMap<FString, FMaskOutTexture> Textures; // 0x78
};

struct UGizmoRectangleComponent : UGizmoBaseComponent {
	FVector DirectionX; // 0x460
	FVector DirectionY; // 0x46c
	float OffsetX; // 0x478
	float OffsetY; // 0x47c
	float LengthX; // 0x480
	float LengthY; // 0x484
	float Thickness; // 0x488
	char SegmentFlags; // 0x48c
};

struct UAvfMediaSettings : UObject {
	bool NativeAudioOut; // 0x28
};

struct UNavigationQueryFilter : UObject {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UAxisPositionGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bInInteraction; // 0x89
	FVector InteractionOrigin; // 0x8c
	FVector InteractionAxis; // 0x98
	FVector InteractionStartPoint; // 0xa4
	FVector InteractionCurPoint; // 0xb0
	float InteractionStartParameter; // 0xbc
	float InteractionCurParameter; // 0xc0
	float ParameterSign; // 0xc4
};

struct UDatasmithCineCameraComponentTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings; // 0x30
	FDatasmithCameraLensSettingsTemplate LensSettings; // 0x38
	FDatasmithCameraFocusSettingsTemplate FocusSettings; // 0x3c
	float CurrentFocalLength; // 0x44
	float CurrentAperture; // 0x48
	FDatasmithPostProcessSettingsTemplate PostProcessSettings; // 0x50
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
	UMatineeCameraShake* ShakeClass; // 0x108
	float PlayScale; // 0x110
	ECameraShakePlaySpace PlaySpace; // 0x114
	FRotator UserDefinedPlaySpace; // 0x118
};

struct USQSGetQueueAttributes : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueId; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct AAkReverbVolume : AVolume {
	char bEnabled : 1; // 0x258
	UAkAuxBus* AuxBus; // 0x260
	FString AuxBusName; // 0x268
	float SendLevel; // 0x278
	float FadeRate; // 0x27c
	float Priority; // 0x280
	UAkLateReverbComponent* LateReverbComponent; // 0x288
};

struct UAkCallbackInfo : UObject {
	UAkComponent* AkComponent; // 0x28
};

struct UBaseMediaSource : UMediaSource {
	FName PlayerName; // 0x80
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UMovieSceneCameraShakeSourceShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
};

struct ABP_NPCSpawnLooper_C : ABP_NPCSpawnerBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	TMap<FName, int32_t> CurrentSpawnInfo; // 0x3a0
	int32_t CurrentNPCTypeIndex; // 0x3f0
	TArray<FName> CurrentSpawnUIDs; // 0x3f8
	int32_t RemainSpawnNPCs; // 0x408
	float SpawnTime; // 0x40c
	bool ActiveKeepSpawn; // 0x410
	float RespawnTime; // 0x414
	bool SpawnByDead; // 0x418
	TArray<int32_t> RespawnUIDs; // 0x420
	FTimerHandle RespawnByDeadHandler; // 0x430
	TArray<float> SpawnTimeByDead; // 0x438
	FFloatValueFromDataTable NPCCountMultiply; // 0x448
};

struct UDeviceProfile : UTextureLODSettings {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x88
};

struct UToFloatField : UFieldNodeFloat {
	UFieldNodeInt* IntField; // 0xb0
};

struct UWBP_WorldMap_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border; // 0x268
	UCanvasPanel* Canvas_Respawn; // 0x270
	UGamepadCursor_C* GamepadCursor; // 0x278
	UWBP_MapMarker_DeadPlayer_C* Marker_DeadPlayer; // 0x280
	UOverlay* Overlay_DeadMarker; // 0x288
	UOverlay* Overlay_Landmark; // 0x290
	UOverlay* Overlay_Team; // 0x298
	UWBP_MapMarker_Player_C* PlayerMarker; // 0x2a0
	UOverlay* Scale; // 0x2a8
	UOverlay* Translation; // 0x2b0
	UWBP_MapMarker_Waypoint_C* WaypointMarker; // 0x2b8
	UWorldMap_Image_C* WorldMap_Image; // 0x2c0
	UOverlay* WorldMarkers; // 0x2c8
	FVector2D ClampedPosition; // 0x2d0
	float LerpSpeed; // 0x2d8
	float NewZoom; // 0x2dc
	FTimerHandle TimerChangeZoomHandler; // 0x2e0
	FVector2D TempPivot; // 0x2e8
	FVector2D NewPivot; // 0x2f0
	TArray<UWBP_MapMarker_EventPoint_C*> SpotEvents; // 0x2f8
	TArray<UWBP_MapMarker_RespawnPoint_C*> RespawnPoint; // 0x308
	TArray<UWBP_MapMarker_LandmarkEffect_C*> LandmarkEffects; // 0x318
	TArray<UWBP_MapMarker_LandmarkEffectCauser_C*> LandmarkEffectCausers; // 0x328
	float Lerp; // 0x338
	FVector2D Scaled; // 0x33c
	bool IsRespawnMap; // 0x344
	bool bScaleChanging; // 0x345
	bool bPivotChanging; // 0x346
	bool bDrag; // 0x347
};

struct ULevelVariantSets : UObject {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct UDecalComponent : USceneComponent {
	UMaterialInterface* DecalMaterial; // 0x1f8
	int32_t sortOrder; // 0x200
	float FadeScreenSize; // 0x204
	float FadeStartDelay; // 0x208
	float FadeDuration; // 0x20c
	float FadeInDuration; // 0x210
	float FadeInStartDelay; // 0x214
	char bDestroyOwnerAfterFade : 1; // 0x218
	FVector DecalSize; // 0x21c
};

struct UVRNotificationsComponent : UActorComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb0
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc0
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd0
	FMulticastInlineDelegate HMDLostDelegate; // 0xe0
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf0
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x100
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x110
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x120
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x130
};

struct UBTTask_MoveToLocation_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FBlackboardKeySelector KEYTargetActorOrLocation; // 0xb0
	float LimitTime; // 0xd8
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UNetDriver : UObject {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t NetServerMaxTickRate; // 0x58
	int32_t MaxNetTickRate; // 0x5c
	int32_t MaxInternetClientRate; // 0x60
	int32_t MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	UNetConnection* ServerConnection; // 0x88
	TArray<UNetConnection*> ClientConnections; // 0x90
	int32_t RecentlyDisconnectedTrackingTime; // 0x100
	UWorld* World; // 0x140
	UPackage* WorldPackage; // 0x148
	UObject* NetConnectionClass; // 0x170
	UObject* ReplicationDriverClass; // 0x178
	FName NetDriverName; // 0x190
	TArray<FChannelDefinition> ChannelDefinitions; // 0x198
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1a8
	TArray<UChannel*> ActorChannelPool; // 0x1f8
	float Time; // 0x238
	UReplicationDriver* ReplicationDriver; // 0x710
};

struct UMaterialExpressionInverseLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UStereoLayerShapeCylinder : UStereoLayerShape {
	float Radius; // 0x28
	float OverlayArc; // 0x2c
	int32_t Height; // 0x30
};

struct UCustomizableObjectSystem : UObject {
	TArray<FPendingReleaseSkeletalMeshInfo> PendingReleaseSkeletalMesh; // 0x28
	UCustomizableObjectImageProviderArray* PreviewExternalImageProvider; // 0x38
	TArray<UTexture2D*> ProtectedCachedTextures; // 0x140
	UCustomizableInstanceLODManagementBase* DefaultInstanceLODManagement; // 0x160
	UCustomizableInstanceLODManagementBase* CurrentInstanceLODManagement; // 0x168
};

struct UAnimNotify_SpawnAKForRangeWeapon_C : UAnimNotify {
	FName BoneName; // 0x38
	bool NeedAttached; // 0x40
	UAkAudioEvent* AKEventType; // 0x48
	UAkSwitchValue* SoundType; // 0x50
};

struct UWBP_Key_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Img; // 0x268
	USizeBox* SizeBox_2; // 0x270
	UTextBlock* Text_Hold; // 0x278
	UTextBlock* Text_Key; // 0x280
	UWidgetSwitcher* WidgetSwitcher_1; // 0x288
	FString Key; // 0x290
	EnumKeyInputType KeyInputType; // 0x2a0
	bool SkipButtonBind; // 0x2a1
	bool bHold; // 0x2a2
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xb0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xb8
};

struct ABP_BuildingBlockZone_C : AActor {
	UBoxComponent* Building Block Zone; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
};

struct UMaterialExpressionArcsineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPhysicsThrusterComponent : USceneComponent {
	float ThrustStrength; // 0x1f8
};

struct ULoginUserCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AWorldLocation_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USphereComponent* AreaSphere; // 0x228
	UBoxComponent* AreaCube; // 0x230
	USceneComponent* DefaultSceneRoot; // 0x238
	FText LocationName; // 0x240
	bool UseCubeCollision; // 0x258
	float TriggerSize; // 0x25c
	bool IsDiscovered; // 0x260
	AQuestMapController_C* Controller; // 0x268
	UTexture2D* Icon; // 0x270
	FLinearColor UndiscoveredTint; // 0x278
	FLinearColor DiscoveredTint; // 0x288
	bool HasLocalMap; // 0x298
	UTexture2D* LocalMap; // 0x2a0
	bool TravelAllowedFrom; // 0x2a8
	bool TravelAllowedTo; // 0x2a9
	bool Display; // 0x2aa
	ATravelPoint_C* TravelPoint; // 0x2b0
	APawn* Pawn; // 0x2b8
	UC_Manager-LocalMap_C* LocalMapManager; // 0x2c0
	UC_Manager-WorldMap_C* WorldMapManager; // 0x2c8
};

struct ABP_ElectricFenceGate_C : ABP_FunctionalityBuildPartBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x890
	UBP_BuildJointComponent_C* BP_BuildJointComponent; // 0x898
	UBP_BuildJointComponent_C* BP_BuildJointComponent1; // 0x8a0
	USkeletalMeshComponent* SkeletalMesh; // 0x8a8
};

struct UEditableGeometryCollectionAdapter : UEditableMeshAdapter {
	UGeometryCollection* GeometryCollection; // 0x28
	UGeometryCollection* OriginalGeometryCollection; // 0x30
	int32_t GeometryCollectionLODIndex; // 0x38
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UNiagaraSettings : UDeveloperSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UAkAssetDataSwitchContainerData : UObject {
	TSoftObjectPtr<UAkGroupValue> GroupValue; // 0x28
	UAkGroupValue* DefaultGroupValue; // 0x50
	TArray<UAkMediaAsset*> MediaList; // 0x58
	TArray<UAkAssetDataSwitchContainerData*> Children; // 0x68
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	UDataTable* TextStyleSet; // 0x140
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x148
	bool bOverrideDefaultStyle; // 0x158
	FTextBlockStyle DefaultTextStyleOverride; // 0x160
	float MinDesiredWidth; // 0x3d0
	ETextTransformPolicy TextTransformPolicy; // 0x3d4
	FTextBlockStyle DefaultTextStyle; // 0x3d8
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x648
};

struct UWBP_Radiogram_Crafting_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* list; // 0x268
	TArray<FS_CraftingRecipeData> Crafting Recipe Data; // 0x270
	UWBP_Main_Radiogram_C* Radiogram Main; // 0x280
	int32_t UID; // 0x288
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x468
	UMaterialInterface* MaterialOverride; // 0x470
	FLinearColor SpriteColor; // 0x478
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	int32_t UsageIndex; // 0x2c
	FGuid UsageId; // 0x30
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1b8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x298
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2a8
};

struct UCloudWatchLogsDescribeLogStreams : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ABP_OccupyZone_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UBillboardComponent* Billboard; // 0x228
	USceneComponent* Scene; // 0x230
	float CurrentOccupyPercent; // 0x238
	float ServerOccupyPercent; // 0x23c
	ABP_LandmarkZone_C* LandmarkRef; // 0x240
	TArray<BP_SurvivalCharacter_C*> OccupyPlayers; // 0x248
	bool IsIn; // 0x258
	float OccupyRate; // 0x25c
	float DecreaseOccupyRate; // 0x260
	bool Conflict; // 0x264
	bool IsStartOccupy; // 0x265
};

struct ULocationInfo_Gamepad_C : UUserWidget {
	ULocationInfo_C* LocationInfo; // 0x260
};

struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x38
	EDataSourceTypeEnum DataSourceType; // 0x88
	int32_t DataProcessFrequency; // 0x8c
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90
	bool DoSpawn; // 0x94
	FVector2D SpawnMultiplierMinMax; // 0x98
	float SpawnChance; // 0xa0
	FVector2D ImpulseToSpawnMinMax; // 0xa4
	FVector2D SpeedToSpawnMinMax; // 0xac
	FVector2D MassToSpawnMinMax; // 0xb4
	FVector2D ExtentMinToSpawnMinMax; // 0xbc
	FVector2D ExtentMaxToSpawnMinMax; // 0xc4
	FVector2D VolumeToSpawnMinMax; // 0xcc
	FVector2D SolverTimeToSpawnMinMax; // 0xd4
	int32_t SurfaceTypeToSpawn; // 0xdc
	ELocationFilteringModeEnum LocationFilteringMode; // 0xe0
	ELocationXToSpawnEnum LocationXToSpawn; // 0xe1
	FVector2D LocationXToSpawnMinMax; // 0xe4
	ELocationYToSpawnEnum LocationYToSpawn; // 0xec
	FVector2D LocationYToSpawnMinMax; // 0xf0
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf8
	FVector2D LocationZToSpawnMinMax; // 0xfc
	EDataSortTypeEnum DataSortingType; // 0x104
	bool bGetExternalCollisionData; // 0x105
	bool DoSpatialHash; // 0x106
	FVector SpatialHashVolumeMin; // 0x108
	FVector SpatialHashVolumeMax; // 0x114
	FVector SpatialHashVolumeCellSize; // 0x120
	int32_t MaxDataPerCell; // 0x12c
	bool bApplyMaterialsFilter; // 0x130
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138
	bool bGetExternalBreakingData; // 0x188
	bool bGetExternalTrailingData; // 0x189
	FVector2D RandomPositionMagnitudeMinMax; // 0x18c
	float InheritedVelocityMultiplier; // 0x194
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198
	FVector2D RandomVelocityMagnitudeMinMax; // 0x19c
	float SpreadAngleMax; // 0x1a4
	FVector VelocityOffsetMin; // 0x1a8
	FVector VelocityOffsetMax; // 0x1b4
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0
	float MaxLatency; // 0x1c8
	EDebugTypeEnum DebugType; // 0x1cc
	int32_t LastSpawnedPointID; // 0x1d0
	float LastSpawnTime; // 0x1d4
	float SolverTime; // 0x1e8
	float TimeStampOfLastProcessedData; // 0x1ec
};

struct UMaterialExpressionLightmassReplace : UMaterialExpression {
	FExpressionInput RealTime; // 0x40
	FExpressionInput Lightmass; // 0x54
};

struct UMachineArmAbilityBase : UObject {
	FText Description; // 0x28
};

struct UWBP_Main_Crafting_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Listing; // 0x268
	UBorder* Border_1; // 0x270
	UButton* Button_111; // 0x278
	UScrollBox* CraftingScrollList; // 0x280
	UEditableTextBox* EditableTextBox_Search; // 0x288
	UUniformGridPanel* UniformGridPanel_1; // 0x290
	UWBP_Button_UI_C* WBP_Button_All; // 0x298
	UWBP_Button_UI_C* WBP_Button_Ammunition; // 0x2a0
	UWBP_Button_UI_C* WBP_Button_Consumable; // 0x2a8
	UWBP_Button_UI_C* WBP_Button_Equipment; // 0x2b0
	UWBP_Button_UI_C* WBP_Button_Installation; // 0x2b8
	UWBP_Button_UI_C* WBP_Button_Memorycard; // 0x2c0
	UWBP_Button_UI_C* WBP_Button_Resource; // 0x2c8
	UWBP_Button_UI_C* WBP_Button_Weapon; // 0x2d0
	UWBP_MainFrame_Toolbar_C* WBP_MainFrame_Toolbar; // 0x2d8
	UWBP_Toolbar_Dropdown_C* WBP_Toolbar_Dropdown; // 0x2e0
	bool DragEnabled; // 0x2e8
	bool IsMouseButtonDown; // 0x2e9
	FVector2D LastMousePosition; // 0x2ec
	bool IsDrag; // 0x2f4
	UCanvasPanelSlot* ParentSlot; // 0x2f8
	float SafetyZoneX; // 0x300
	float SafetyZoneY; // 0x304
	int32_t Colums; // 0x308
	bool List View; // 0x30c
	E_CraftingCatergoryType Category Fillter; // 0x30d
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x310
	TArray<UWBP_Slot_Inventory_C*> Inventory Slots; // 0x318
	int32_t Horizontal; // 0x328
	FVector2D Inventory Slots Size; // 0x32c
	bool Inventory; // 0x334
	bool Crafting; // 0x335
	TArray<int32_t> AvailableRecipes; // 0x338
	UBP_CraftingComponent_C* TargetCraftingComponent; // 0x348
	bool bDropdown; // 0x350
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UWBP_RadiogramImage_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_Button_UI_C* ButtonTo; // 0x268
	UImage* Image_124; // 0x270
	FSlateBrush Custom Image; // 0x278
	int32_t UID; // 0x300
	bool Custom Size; // 0x304
	FText HoverText; // 0x308
	E_RadiogramDetailType RadiogramRefrenceType; // 0x320
};

struct UCloudWatchPutMetricData : UAwsCloudWatchAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct USurvivalGameViewportClient : URMGameViewportClient {
	FSoftObjectPath AkMasterVolumeRTPCName; // 0x380
	UAkRtpc* AkMasterVolumeRTPC; // 0x398
};

struct UMaterialExpressionRotator : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct UFAI_BTTask_SetFlyLocationByAttackRange_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FBlackboardKeySelector KEYTargetActor; // 0xb0
	FBlackboardKeySelector KEYTargetLocation; // 0xd8
	AAIController* OwnerController; // 0x100
	APawn* ControlledPawn; // 0x108
	float MaxRange; // 0x110
	float MinRange; // 0x114
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x2]; // 0xf8
	FMovieSceneFloatChannel Rotation; // 0x238
	FMovieSceneFloatChannel Scale[0x2]; // 0x2d8
	FMovieSceneFloatChannel Shear[0x2]; // 0x418
};

struct UBTTask_FocusRandomLocationNearMe_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
};

struct UTexture2DArray : UTexture {
	TextureAddress AddressX; // 0x130
	TextureAddress AddressY; // 0x131
	TextureAddress AddressZ; // 0x132
};

struct UVectorFieldStatic : UVectorField {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UDatasmithLightComponentTemplate : UDatasmithObjectTemplate {
	char bVisible : 1; // 0x30
	char CastShadows : 1; // 0x34
	char bUseTemperature : 1; // 0x34
	char bUseIESBrightness : 1; // 0x34
	float Intensity; // 0x38
	float Temperature; // 0x3c
	float IESBrightnessScale; // 0x40
	FLinearColor LightColor; // 0x44
	UMaterialInterface* LightFunctionMaterial; // 0x58
	UTextureLightProfile* IESTexture; // 0x60
};

struct USteamRequestGroupOfficersCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieSceneObjectPropertyTrack : UMovieScenePropertyTrack {
	UObject* PropertyClass; // 0xb0
};

struct ACameraActor : AActor {
	EAutoReceiveInput AutoActivateForPlayer; // 0x220
	UCameraComponent* CameraComponent; // 0x228
	USceneComponent* SceneComponent; // 0x230
	char bConstrainAspectRatio : 1; // 0x240
	float AspectRatio; // 0x244
	float FOVAngle; // 0x248
	float PostProcessBlendWeight; // 0x24c
	FPostProcessSettings PostProcessSettings; // 0x250
};

struct UARBasicLightEstimate : UARLightEstimate {
	float AmbientIntensityLumens; // 0x28
	float AmbientColorTemperatureKelvin; // 0x2c
	FLinearColor AmbientColor; // 0x30
};

struct UWBP_Main_Crafting_InfoV2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_1; // 0x268
	UButton* Button_Craft; // 0x270
	UButton* Button_Dec1; // 0x278
	UButton* Button_Dec10; // 0x280
	UButton* Button_Inc1; // 0x288
	UButton* Button_Inc10; // 0x290
	UButton* Button_Max; // 0x298
	UEditableTextBox* EditableTextBoxAmount; // 0x2a0
	UImage* Image_334; // 0x2a8
	UImage* Image_704; // 0x2b0
	UImage* Image_Craftable; // 0x2b8
	UImage* Image_Icon; // 0x2c0
	UVerticalBox* Panel_CommonStats; // 0x2c8
	URichTextBlock* RichTextBlock_67; // 0x2d0
	UTextBlock* Text_Name; // 0x2d8
	UTextBlock* TimeCost; // 0x2e0
	UWBP_MainFrame_C* WBP_MainFrame; // 0x2e8
	UWBP_MainFrame_C* WBP_MainFrame_2; // 0x2f0
	UWrapBox* WrapBox_Requirement; // 0x2f8
	UBP_PlayerInventoryComponent_C* TargetPlayerInventoryComponent; // 0x300
	UBP_CraftingComponent_C* TargetCraftingComponent; // 0x308
	UWBP_CraftingV2_C* MainWidget; // 0x310
	int32_t CraftingCount; // 0x318
	FS_CraftingRecipeData CurrentSelectRecipe; // 0x320
	FItemInventory Item; // 0x360
	FText Amount; // 0x398
};

struct UOnlineBeaconSubsystem : UWorldSubsystem {
	TMap<AOnlineBeaconClient*, AOnlineBeaconHostObjectDynamic*> HostingBeacons; // 0x30
	AOnlineBeaconHost* HostBeacon; // 0x80
};

struct URMHttpRequest_Get_Op_Info : URMHttpRequestBase {
	FMulticastInlineDelegate OnSuccess; // 0x48
	FMulticastInlineDelegate OnFailure; // 0x58
};

struct UBP_SkillAcitvationConditionBase_C : UObject {
	FS_ConditionParam Param; // 0x28
};

struct UBST_Stealth_C : UBP_SkillActionTaskBase_C {
	FTimerHandle EndedTimer; // 0xc8
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct UTF-RIFLE_Anim_BP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2f8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x340
};

struct ABP_BigStorageBox_C : ABP_MasterStorage_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
};

struct UMaterialExpressionTextureSampleParameterSubUV : UMaterialExpressionTextureSampleParameter2D {
	char bBlend : 1; // 0x80
};

struct UPlatformInterfaceWebResponse : UObject {
	FString OriginalURL; // 0x28
	int32_t ResponseCode; // 0x38
	int32_t Tag; // 0x3c
	FString StringResponse; // 0x40
	TArray<char> BinaryResponse; // 0x50
};

struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x98
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UClothingAssetCommon : UClothingAssetBase {
	UPhysicsAsset* PhysicsAsset; // 0x48
	TMap<FName, UClothConfigBase*> ClothConfigs; // 0x50
	UClothConfigBase* ClothSharedSimConfig; // 0xa0
	UClothConfigBase* ClothSimConfig; // 0xa8
	UClothConfigBase* ChaosClothSimConfig; // 0xb0
	TArray<UClothLODDataCommon_Legacy*> ClothLODData; // 0xb8
	TArray<FClothLODDataCommon> LODData; // 0xc8
	TArray<int32_t> LodMap; // 0xd8
	TArray<FName> UsedBoneNames; // 0xe8
	TArray<int32_t> UsedBoneIndices; // 0xf8
	int32_t ReferenceBoneIndex; // 0x108
	UClothingAssetCustomData* CustomData; // 0x110
	FClothConfig_Legacy ClothConfig; // 0x118
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x100
};

struct ULeaderBoard : UObject {
	TArray<FPlayerScore> Scores; // 0x28
	int32_t NumAccumulatedPlayers; // 0x38
};

struct UWBP_Main_TeamLog_C : UUserWidget {
	UScrollBox* ScrollBox_TeamLog; // 0x260
	UWBP_MainFrame_C* WBP_MainFrame; // 0x268
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header; // 0x270
	bool Find State; // 0x278
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x220
	UPrimitiveComponent* TranslateY; // 0x228
	UPrimitiveComponent* TranslateZ; // 0x230
	UPrimitiveComponent* TranslateYZ; // 0x238
	UPrimitiveComponent* TranslateXZ; // 0x240
	UPrimitiveComponent* TranslateXY; // 0x248
	UPrimitiveComponent* RotateX; // 0x250
	UPrimitiveComponent* RotateY; // 0x258
	UPrimitiveComponent* RotateZ; // 0x260
	UPrimitiveComponent* UniformScale; // 0x268
	UPrimitiveComponent* AxisScaleX; // 0x270
	UPrimitiveComponent* AxisScaleY; // 0x278
	UPrimitiveComponent* AxisScaleZ; // 0x280
	UPrimitiveComponent* PlaneScaleYZ; // 0x288
	UPrimitiveComponent* PlaneScaleXZ; // 0x290
	UPrimitiveComponent* PlaneScaleXY; // 0x298
};

struct UAkFolder : UAkAudioType {
	FString UnrealFolderPath; // 0x40
	FString WwiseFolderPath; // 0x50
};

struct UInterpGroup : UObject {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct ABP_ProcessingFacilityBase_C : ABP_FacilityBaseBuildPart_C {
	UBP_BuildJointComponent_C* Socekt3; // 0x860
	UBP_BuildJointComponent_C* Socekt2; // 0x868
	UBP_BuildJointComponent_C* Socekt1; // 0x870
	UBP_BuildJointComponent_C* Socekt; // 0x878
	UBP_BuildJointComponent_C* Bolt; // 0x880
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct UFAI_BTDecorator_CheckTooFarFromHome_C : UBTDecorator_BlueprintBase {
	FBlackboardKeySelector KEYSpawner; // 0xa0
	float Limit; // 0xc8
	float FarLimit; // 0xcc
	FVector CenterLocation; // 0xd0
	float Bound; // 0xdc
	TScriptInterface<IBPI_NPCSpawnerInterface_C> As BPI NPCSpawner Interface; // 0xe0
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x440
	UBodySetup* BrushBodySetup; // 0x448
};

struct UInfinite_Compound : USceneComponent {
	bool RealTime; // 0x1f8
	float TimeJump; // 0x1fc
	EInfinityCategory InfinityCategory; // 0x200
};

struct UARPin : UObject {
	UARTrackedGeometry* TrackedGeometry; // 0x28
	USceneComponent* PinnedComponent; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	FMulticastInlineDelegate OnARTrackingStateChanged; // 0xc0
	FMulticastInlineDelegate OnARTransformUpdated; // 0xd0
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UBTCompositeNode : UBTNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
	char bApplyDecoratorScope : 1; // 0x88
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UGizmoWorldAxisSource : UObject {
	FVector Origin; // 0x30
	int32_t AxisIndex; // 0x3c
};

struct AFieldSystemActor : AActor {
	UFieldSystemComponent* FieldSystemComponent; // 0x220
};

struct UWBP_WorldMapPanel_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Open; // 0x268
	UTextBlock* Text_Timer; // 0x270
	UWBP_PlayerInfo_C* WBP_PlayerInfo; // 0x278
	UWBP_ShortRanking_C* WBP_Ranking_Simple; // 0x280
	UWBP_WorldMap_C* WBP_WorldMap; // 0x288
	UWidgetSwitcher* WidgetSwitcher_56; // 0x290
	USizeBox* WS_DDay; // 0x298
	USizeBox* WS_PlayerInfo; // 0x2a0
	FVector2D ClampedPosition; // 0x2a8
	float LerpSpeed; // 0x2b0
	float NewZoom; // 0x2b4
	FTimerHandle TimerChangeZoomHandler; // 0x2b8
	bool NeedClampLocation; // 0x2c0
	FVector2D NewPivot; // 0x2c4
	TArray<UWBP_MapMarker_EventPoint_C*> SpotEvents; // 0x2d0
	TArray<UWBP_MapMarker_RespawnPoint_C*> RespawnPoint; // 0x2e0
	TArray<UWBP_MapMarker_C*> AttackedAlert; // 0x2f0
	TArray<UWBP_MapMarker_C*> DeadOthers; // 0x300
	FFloatValueFromDataTable GameTimeMultiflyByConfig; // 0x310
	FString TimerText; // 0x338
	ABP_ModelViewer_C* SummaryModel; // 0x348
};

struct UBTTask_FinishWithResult : UBTTaskNode {
	EBTNodeResult Result; // 0x70
};

struct UPhononReverbSourceSettings : UReverbPluginSourceSettingsBase {
	EIplSimulationType SourceReverbSimulationType; // 0x28
	float SourceReverbContribution; // 0x2c
};

struct USoundfieldEffectBase : UObject {
	USoundfieldEffectSettingsBase* Settings; // 0x28
};

struct AShooterTargetPoint : ATargetPoint {
	bool bTeleportTarget; // 0x220
	int32_t UsableTeamID; // 0x224
	int32_t UsablePlayerOrder; // 0x228
};

struct UMediaComponent : UActorComponent {
	UMediaTexture* MediaTexture; // 0xb0
	UMediaPlayer* MediaPlayer; // 0xb8
};

struct UWBP_Main_MailSystem_C : UUserWidget {
	UWBP_MainFrame_C* BP_UI_Frame; // 0x260
	UWidgetSwitcher* DetailPanel; // 0x268
	UImage* Image_94; // 0x270
	UImage* Image_164; // 0x278
	UImage* Image_314; // 0x280
	UScrollBox* MailList; // 0x288
	UWBP_MailDetail_C* WBP_MailDetail; // 0x290
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header; // 0x298
	float LastRefreshTime; // 0x2a0
	bool IsFirstCreated; // 0x2a4
};

struct UCloudWatchLogsPutLogEvents : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UPhysicsSettings : UPhysicsSettingsCore {
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0xe0
	ESettingsLockedAxis LockedAxis; // 0x114
	ESettingsDOF DefaultDegreesOfFreedom; // 0x115
	bool bSuppressFaceRemapTable; // 0x116
	bool bSupportUVFromHitResults; // 0x117
	bool bDisableActiveActors; // 0x118
	bool bDisableKinematicStaticPairs; // 0x119
	bool bDisableKinematicKinematicPairs; // 0x11a
	bool bDisableCCD; // 0x11b
	bool bEnableEnhancedDeterminism; // 0x11c
	float AnimPhysicsMinDeltaTime; // 0x120
	bool bSimulateAnimPhysicsAfterReset; // 0x124
	float MaxPhysicsDeltaTime; // 0x128
	bool bSubstepping; // 0x12c
	bool bSubsteppingAsync; // 0x12d
	float MaxSubstepDeltaTime; // 0x130
	int32_t MaxSubsteps; // 0x134
	float SyncSceneSmoothingFactor; // 0x138
	float InitialAverageFrameRate; // 0x13c
	int32_t PhysXTreeRebuildRate; // 0x140
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x148
	FBroadphaseSettings DefaultBroadphaseSettings; // 0x158
	float MinDeltaVelocityForHitEvents; // 0x198
	FChaosPhysicsSettings ChaosSettings; // 0x19c
};

struct UABP_Drone_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x378
};

struct UMaterialExpressionConstant2Vector : UMaterialExpression {
	float R; // 0x40
	float G; // 0x44
};

struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	FSubmixEffectFilterSettings Settings; // 0x9c
};

struct UWBP_Toolbar_Dropdown_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Dropdown; // 0x268
	UButton* Button_Category; // 0x270
	UImage* Image_Category; // 0x278
	UNamedSlot* NamedSlot_82; // 0x280
	UTextBlock* Text_Category; // 0x288
	UVerticalBox* VerticalBox_Dropdown; // 0x290
	UObject* Resource Object; // 0x298
	FText In Text; // 0x2a0
	FMulticastInlineDelegate OnClicked; // 0x2b8
	bool bDropdown; // 0x2c8
};

struct UPostProcessComponent : USceneComponent {
	FPostProcessSettings Settings; // 0x200
	float Priority; // 0x750
	float BlendRadius; // 0x754
	float BlendWeight; // 0x758
	char bEnabled : 1; // 0x75c
	char bUnbound : 1; // 0x75c
};

struct ABP_Afterimage2_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UPoseableMeshComponent* PoseableMesh; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
	float AtferImage_Timeline_Refraction_F9891ED745C5E1BBAA3B34A7F0BC19B8; // 0x238
	float AtferImage_Timeline_ColorPower_F9891ED745C5E1BBAA3B34A7F0BC19B8; // 0x23c
	float AtferImage_Timeline_Opacity_F9891ED745C5E1BBAA3B34A7F0BC19B8; // 0x240
	ETimelineDirection AtferImage_Timeline__Direction_F9891ED745C5E1BBAA3B34A7F0BC19B8; // 0x244
	UTimelineComponent* AtferImage Timeline; // 0x248
	UMaterialInstanceDynamic* Afterimage Material; // 0x250
	USkeletalMeshComponent* ModelRef; // 0x258
};

struct UWBP_MachineArm_CostListing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_54; // 0x268
	UTextBlock* Name; // 0x270
	UTextBlock* Text_Amount; // 0x278
	UWBP_Slot_Display_C* WBP_Slot_Display; // 0x280
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x288
	int32_t Item ID; // 0x290
	bool TraceResouceCount; // 0x294
	int32_t Amount; // 0x298
};

struct UMaterialExpressionAdd : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UAnimSequenceBase : UAnimationAsset {
	TArray<FAnimNotifyEvent> Notifies; // 0x80
	float SequenceLength; // 0x90
	float RateScale; // 0x94
	FRawCurveTracks RawCurveData; // 0x98
};

struct UNiagaraDataInterfaceArrayFloat3 : UNiagaraDataInterfaceArray {
	TArray<FVector> FloatData; // 0x50
};

struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FComboBoxStyle ComboBoxStyle; // 0x30
};

struct UInteractiveGizmoManager : UObject {
	TArray<FActiveGizmo> ActiveGizmos; // 0x30
	TMap<FString, UInteractiveGizmoBuilder*> GizmoBuilders; // 0x58
};

struct URepair_Table_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2f8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x398
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3e8
	ABP_RepairTable_C* Repair Table; // 0x468
	bool IsWorking; // 0x470
};

struct UMaterialExpressionQualitySwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct UMovieSceneSequence : UMovieSceneSignedObject {
	UMovieSceneCompiledData* CompiledData; // 0x50
	EMovieSceneCompletionMode DefaultCompletionMode; // 0x58
	bool bParentContextsAreSignificant; // 0x59
	bool bPlayableDirectly; // 0x5a
	EMovieSceneSequenceFlags SequenceFlags; // 0x5b
};

struct UUdpMessagingSettings : UObject {
	bool EnabledByDefault; // 0x28
	bool EnableTransport; // 0x29
	bool bAutoRepair; // 0x2a
	bool bStopServiceWhenAppDeactivates; // 0x2b
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	EUdpMessageFormat MessageFormat; // 0x50
	char MulticastTimeToLive; // 0x51
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct ABP_Juggernaut_Ridable_C : ACharacter {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4c0
	USceneComponent* Scene; // 0x4c8
	USpringArmComponent* SpringArm; // 0x4d0
	UCameraComponent* Camera; // 0x4d8
	BP_MasterCharacter_C* Rider; // 0x4e0
	float SpringArmRotationYaw; // 0x4e8
	float SpringArmRotationPitch; // 0x4ec
	FVector ForwardVector; // 0x4f0
	FVector RightVector; // 0x4fc
	bool IsTurn; // 0x508
	float TurnRate; // 0x50c
	FRotator PreviousRotation; // 0x510
	float TurnSpeedSmooth; // 0x51c
	bool IsPlayingLaser; // 0x520
	float CameraLagLength; // 0x524
};

struct UDistributionVectorConstant : UDistributionVector {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct UMovieSceneSignedObject : UObject {
	FGuid Signature; // 0x28
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UNiagaraDataInterfaceSpline : UNiagaraDataInterface {
	AActor* Source; // 0x38
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct UBTTask_CheckJuniorSpawner_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FBlackboardKeySelector spawner; // 0xb0
	float FarLimit; // 0xd8
};

struct UWBP_ObjectiveCheckbox_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Checked; // 0x268
	UWidgetAnimation* Anim_Attention; // 0x270
	UCheckBox* CheckBox_80; // 0x278
	UImage* Image_60; // 0x280
	UImage* Image_143; // 0x288
	UImage* Image_209; // 0x290
	UImage* Image_284; // 0x298
	USizeBox* SizeBox_1; // 0x2a0
	UTextBlock* TB_Do; // 0x2a8
};

struct AOnlineBeacon : AActor {
	float BeaconConnectionInitialTimeout; // 0x228
	float BeaconConnectionTimeout; // 0x22c
	UNetDriver* NetDriver; // 0x230
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct UArrowComponent : UPrimitiveComponent {
	FColor ArrowColor; // 0x440
	float ArrowSize; // 0x444
	float ArrowLength; // 0x448
	float ScreenSize; // 0x44c
	char bIsScreenSizeScaled : 1; // 0x450
	char bTreatAsASprite : 1; // 0x450
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UAnimNotify_CameraShake_C : UAnimNotify {
	USVCameraShake* CameraShake; // 0x38
	bool bPlayOnlyOwner; // 0x40
};

struct ABP_ConcreteResource_C : ABP_BreakableResource_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x460
};

struct ULowEntryLong : UObject {
	TArray<char> Bytes; // 0x28
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct USequenceCameraShake : UCameraShakeBase {
	UCameraAnimationSequence* Sequence; // 0x98
	float PlayRate; // 0xa0
	float Scale; // 0xa4
	float BlendInTime; // 0xa8
	float BlendOutTime; // 0xac
	float RandomSegmentDuration; // 0xb0
	bool bRandomSegment; // 0xb4
	USequenceCameraShakeSequencePlayer* Player; // 0xb8
	USequenceCameraShakeCameraStandIn* CameraStandIn; // 0xc0
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UVehicleAnimInstance : UAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0xa40
};

struct UGameSessionSettings : UObject {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UNiagaraDataInterfaceGrid2DCollectionReader : UNiagaraDataInterfaceGrid2D {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UComboBoxString : UWidget {
	TArray<FString> DefaultOptions; // 0x108
	FString SelectedOption; // 0x118
	FComboBoxStyle WidgetStyle; // 0x128
	FTableRowStyle ItemStyle; // 0x518
	FMargin ContentPadding; // 0xce0
	float MaxListHeight; // 0xcf0
	bool HasDownArrow; // 0xcf4
	bool EnableGamepadNavigationMode; // 0xcf5
	FSlateFontInfo Font; // 0xcf8
	FSlateColor ForegroundColor; // 0xd50
	bool bIsFocusable; // 0xd78
	FDelegate OnGenerateWidgetEvent; // 0xd7c
	FMulticastInlineDelegate OnSelectionChanged; // 0xd90
	FMulticastInlineDelegate OnOpening; // 0xda0
};

struct UBuildJointComponent : UBoxComponent {
	EBuildJointType BuildJointType; // 0x468
	TArray<EBuildLayoutType> BuildLayoutList; // 0x470
	int32_t sortOrder; // 0x480
	TArray<ABuildPartBase*> IgnoreClassArray; // 0x488
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct UWBP_FunctionalityMainButton_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_124; // 0x268
	UImage* Image_51; // 0x270
	UImage* Image_UX; // 0x278
	UTextBlock* TextBlock_533; // 0x280
	UWBP_UI_SlotHovering_C* WBP_UI_SlotHovering; // 0x288
	FText Text; // 0x290
	FMulticastInlineDelegate OnClicked; // 0x2a8
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x220
};

struct UVehicleAKData : UDataAsset {
	UAkAudioEvent* AkCrashEvent; // 0x30
	TArray<UAkGroupValue*> AKCrashSwitchValue; // 0x38
	TArray<float> AKCrashSwitchSpeed; // 0x48
	bool IsPlaySound_Claxon; // 0x58
	UAkAudioEvent* AkClaxonEvent; // 0x60
	TArray<UAkGroupValue*> AKClaxonSwitchValue; // 0x68
	bool IsPlaySound_Skid; // 0x78
	UAkAudioEvent* AkSkidEvent; // 0x80
	TArray<UAkGroupValue*> AKSkidSwitchValue; // 0x88
	bool IsPlaySound_NotEnoughBattery; // 0x98
	UAkAudioEvent* AkNotEnoughBatteryEvent; // 0xa0
	TArray<UAkGroupValue*> AKNotEnoughBatterySwitchValue; // 0xa8
	bool IsPlaySound_Jump; // 0xb8
	UAkAudioEvent* AkJumpEvent; // 0xc0
	TArray<UAkGroupValue*> AKJumpSwitchValue; // 0xc8
	UAkAudioEvent* AkLandEvent; // 0xd8
	TArray<UAkGroupValue*> AKLandSwitchValue; // 0xe0
};

struct UVariantObjectBinding : UObject {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct UAudioImpulseResponse : UObject {
	TArray<float> ImpulseResponse; // 0x28
	int32_t NumChannels; // 0x38
	int32_t SampleRate; // 0x3c
	float NormalizationVolumeDb; // 0x40
	bool bTrueStereo; // 0x44
	TArray<float> IRData; // 0x48
};

struct UInterpTrackLinearColorProp : UInterpTrackLinearColorBase {
	FName PropertyName; // 0x90
};

struct UBP_OccupyFunctionComponent_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	bool IsIn; // 0xb8
	FMulticastInlineDelegate OnChangeIsIn; // 0xc0
	FMulticastInlineDelegate OnChangeStartOccupy; // 0xd0
	FMulticastInlineDelegate WhenChangeOccupyPlayers; // 0xe0
	TArray<BP_SurvivalCharacter_C*> OccupyPlayers; // 0xf0
	FMulticastInlineDelegate OnOccupyed; // 0x100
	FMulticastInlineDelegate OnResetOccupyed; // 0x110
	FMulticastInlineDelegate OnFailOccupy; // 0x120
	float OccupyRateMultiply; // 0x130
	float DecreaseOccupyRateMultiply; // 0x134
	bool CanOccupyFail; // 0x138
	bool IsOccupyed; // 0x139
	float IncreaseTime; // 0x13c
	float DecreaseTime; // 0x140
	float ServerCompleteTime; // 0x144
	FMulticastInlineDelegate OnComplete; // 0x148
	bool RequestReset; // 0x158
	float OldOccupyRateMultiply; // 0x15c
	float OldDecreaseOccupyRateMultiply; // 0x160
	bool OccupyComplete; // 0x164
};

struct ULocalLightComponent : ULightComponent {
	ELightUnits IntensityUnits; // 0x328
	float Radius; // 0x32c
	float AttenuationRadius; // 0x330
	FLightmassPointLightSettings LightmassSettings; // 0x334
};

struct USpotEventCondition_Periodic_C : UEventActivationCondition {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
	FFloatRange StartTime; // 0x30
	FFloatRange ActivationSpan; // 0x40
	bool Active; // 0x50
};

struct AScoreActor : AActor {
	UWidgetComponent* Widget; // 0x220
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x2c8
};

struct UNiagaraEffectType : UObject {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	UNiagaraSignificanceHandler* SignificanceHandler; // 0x30
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct UReflectionCaptureComponent : USceneComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct ABP_ActorSpawnManager_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
	TMap<FName, ABP_ActorSpawner_C*> ActorSpawnerMap; // 0x230
	UDataTable* ActorSpawnGroupInfo; // 0x280
	bool bIsInitBySimulated; // 0x288
};

struct URMHttpRequest : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct ABP_LightDrone_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* Drone_LightCone; // 0x228
	USpotLightComponent* SpotLight; // 0x230
	USkeletalMeshComponent* SkeletalMesh; // 0x238
	USceneComponent* DefaultSceneRoot; // 0x240
	float _____0_Amount_D0846B9D48B890304515C2BD214CE06A; // 0x248
	ETimelineDirection _____0__Direction_D0846B9D48B890304515C2BD214CE06A; // 0x24c
	UTimelineComponent*   _1; // 0x250
	float Intensity; // 0x258
	float AttenuationRadius; // 0x25c
	float OuterConeAngle; // 0x260
	float InnerConeAngle; // 0x264
	BP_SV_Ultra_Dynamic_Sky_C* LightSky; // 0x268
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct ABP_RetrieveSystemDesc_C : ABP_FunctionalityBuildPartBase_C {
	UParticleSystemComponent* P_Facility_Receiver; // 0x890
};

struct UWBP_AdminConsole_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button; // 0x268
	UButton* Button_2; // 0x270
	UButton* Button_3; // 0x278
	UButton* Button_4; // 0x280
	UButton* Button_5; // 0x288
	UButton* Button_6; // 0x290
	UButton* Button_7; // 0x298
	UButton* Button_11; // 0x2a0
	UButton* Button_62; // 0x2a8
	UButton* Button_101; // 0x2b0
	UButton* Button_145; // 0x2b8
	UButton* Button_346; // 0x2c0
	UButton* Button123; // 0x2c8
	UButton* Button123_2; // 0x2d0
	UButton* Button123_3; // 0x2d8
	UButton* Button123_4; // 0x2e0
	UButton* Button234; // 0x2e8
	UButton* Button234_2; // 0x2f0
	UButton* Button_Get; // 0x2f8
	UButton* Button_Get_2; // 0x300
	UButton* Button_History; // 0x308
	UButton* Button_KillActor; // 0x310
	UButton* Button_Spawn; // 0x318
	UButton* Button_SpawnAllItems; // 0x320
	UButton* Button_Tab_Cheat; // 0x328
	UButton* Button_Tab_PlayerList; // 0x330
	UButton* Button_Tap_AdminTools; // 0x338
	UButton* Button_Tap_Graphic_2; // 0x340
	UEditableTextBox* EditableTextBox_Amount; // 0x348
	UEditableTextBox* EditableTextBox_Name; // 0x350
	UButton* Exit; // 0x358
	UImage* Image; // 0x360
	UImage* Image_84; // 0x368
	UImage* Image_169; // 0x370
	UImage* Image_Fly; // 0x378
	UImage* Image_Fly_2; // 0x380
	UImage* Image_God; // 0x388
	UImage* Image_hp; // 0x390
	UImage* Image_Nocost; // 0x398
	UImage* Image_Trace; // 0x3a0
	UImage* Image_Trace_2; // 0x3a8
	UWrapBox* list; // 0x3b0
	UVerticalBox* ScrollBox_Quick; // 0x3b8
	USlider* Slider_220; // 0x3c0
	UTextBlock* Text_Time; // 0x3c8
	UImage* Unlock; // 0x3d0
	UWB_AdminTools_C* WB_AdminTools; // 0x3d8
	UWB_ClassicSettingsDev_C* WB_ClassicSettingsDev; // 0x3e0
	UWBP_AdminConsole_QuickListing_C* WBP_AdminConsole_QuickListing; // 0x3e8
	UWBP_AdminUserManagement_C* WBP_AdminUserManagement; // 0x3f0
	UWBP_AdminConsole_ItemListing_C* WBP_CheatItemList; // 0x3f8
	UWidgetSwitcher* WidgetSwitcher_1; // 0x400
	FText PreviewNum; // 0x408
	int32_t CreateCount; // 0x420
	UWBP_AdminConsole_ItemListing_C* CurrentSeletedItem; // 0x428
	bool PrevMouseState; // 0x430
	TArray<UWBP_AdminConsole_ItemListing_C*> WidgetArray; // 0x438
	UBP_QuickGen_C* QuickGenSave; // 0x448
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UGizmoBaseComponent : UPrimitiveComponent {
	FLinearColor Color; // 0x440
	float HoverSizeMultiplier; // 0x450
	float PixelHitDistanceThreshold; // 0x454
};

struct UPlatformEventsComponent : UActorComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct ABP_MasterRangeWeapon_C : ASVProjectileWeapon {
	FPointerToUberGraphFrame UberGraphFrame; // 0x750
	UStaticMeshComponent* Display; // 0x758
	UAkComponent* AkFireHole; // 0x760
	bool Can Reload; // 0x768
	FDataTableRowHandle Ammo Item; // 0x770
	bool Single Shot Trace; // 0x780
	float Auto Fire Rate; // 0x784
	int32_t Multi Shot Count; // 0x788
	int32_t Burst Fire Count; // 0x78c
	float BurstFireDelay; // 0x790
	FS_WeaponRecoil Per Shot Recoil; // 0x798
	USoundBase* Fire Sound; // 0x7d0
	UAkSwitchValue* AKWeaponSwitch; // 0x7d8
	USoundBase* Empty Fire Sound; // 0x7e0
	float Min Spread; // 0x7e8
	float Max Spread; // 0x7ec
	float Idle Spread; // 0x7f0
	float Jog Spread; // 0x7f4
	float Aim Spread; // 0x7f8
	float Aim Walk Spread; // 0x7fc
	float Sprint Spread; // 0x800
	float Jump Spread; // 0x804
	float Crouch Spread; // 0x808
	float Crouch Walking Spread; // 0x80c
	float Crouch Aimed Spread; // 0x810
	float Crouch Aimed Walking Spread; // 0x814
	float Spread Increase Per Shot; // 0x818
	float Spread Reduction Rate; // 0x81c
	FS_RangeWeaponAnims Range Weapon Animations; // 0x820
	float Current Spread; // 0x8a8
	int32_t Fire Count; // 0x8ac
	bool Left Mouse Down; // 0x8b0
	bool Allow Fire; // 0x8b1
	FItemInventory Loading Ammo Item; // 0x8b8
	FName Muzzle Flash Effect Socket Name; // 0x8f0
	UParticleSystemComponent* Muzzle Effect; // 0x8f8
	USoundBase* Default Sound; // 0x900
	ABP_MasterProjectile_C* ProjectileClass; // 0x908
	UCurveFloat* DropRateCurve; // 0x910
	UCurveFloat* MultifleDamageCurve; // 0x918
	float IdleSpreadMax; // 0x920
	float JogSpreadMax; // 0x924
	float AimSpreadMax; // 0x928
	float AimWalkSpreadMax; // 0x92c
	float SprintSpreadMax; // 0x930
	float JumpSpreadMax; // 0x934
	float CrouchSpreadMax; // 0x938
	float CrouchWalkingSpreadMax; // 0x93c
	float CrouchAimedSpreadMax; // 0x940
	float CrouchAimedWalkingSpreadMax; // 0x944
	bool ClientIsReloading; // 0x948
	UMatineeCameraShake* CameraShakeClass; // 0x950
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x958
	FS_WeaponRecoil Zoom Per Shot Recoil; // 0x960
	bool bCanReduceSpread; // 0x998
	float AgainReduceSpreadTime; // 0x99c
	FRandomStream RandomStream; // 0x9a0
	FS_WeaponRecoil Crouch Per Shot Recoil; // 0x9a8
	float Operability; // 0x9e0
	float CurrentOperabilityValue; // 0x9e4
	float AimRange; // 0x9e8
	bool FireLockForBurst; // 0x9ec
	bool bPressedADS; // 0x9ed
	int32_t BeginAKSoundFireCount; // 0x9f0
	float HideMeshPoint; // 0x9f4
	int32_t ClientAmmo; // 0x9f8
	bool bNeedFireSound; // 0x9fc
	float Damage; // 0xa00
	TMap<EPlayerMoveState, float> MinSpread; // 0xa08
	TMap<EPlayerMoveState, float> MaxSpread; // 0xa58
	FDamageStruct DTDamageStruct; // 0xaa8
	bool BoltAction; // 0xae0
	bool Bolting; // 0xae1
	FMulticastInlineDelegate OnFIreProjectile; // 0xae8
	float BurstCoolTime; // 0xaf8
	float ProjectileSpeedMultiply; // 0xafc
	float DamageMultiply; // 0xb00
	float FireSoundMultipy; // 0xb04
	float EffectLightMultiply; // 0xb08
	float RecoilMultiply; // 0xb0c
	float ReloadSpeedMultiply; // 0xb10
	UAkSwitchValue* MuzzleAKSwitch; // 0xb18
	TArray<FAttachmentSlot> Attachments; // 0xb20
	TArray<FName> HideMeshTagsWhenADS; // 0xb30
	bool IsActivated; // 0xb40
	FMulticastInlineDelegate OnChangeClientAmmo; // 0xb48
	UMaterialInstanceDynamic* MI_Display; // 0xb58
	TArray<UPrimitiveComponent*> StealthMeshes; // 0xb60
	bool Pressed; // 0xb70
};

struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UChaosClothConfig : UClothConfigCommon {
	EClothMassMode MassMode; // 0x28
	float UniformMass; // 0x2c
	float TotalMass; // 0x30
	float Density; // 0x34
	float MinPerParticleMass; // 0x38
	float EdgeStiffness; // 0x3c
	float BendingStiffness; // 0x40
	bool bUseBendingElements; // 0x44
	float AreaStiffness; // 0x48
	float VolumeStiffness; // 0x4c
	float StrainLimitingStiffness; // 0x50
	float LimitScale; // 0x54
	EChaosClothTetherMode TetherMode; // 0x58
	bool bUseGeodesicDistance; // 0x59
	float ShapeTargetStiffness; // 0x5c
	float CollisionThickness; // 0x60
	float FrictionCoefficient; // 0x64
	bool bUseSelfCollisions; // 0x68
	float SelfCollisionThickness; // 0x6c
	bool bUseLegacyBackstop; // 0x70
	float DampingCoefficient; // 0x74
	bool bUsePointBasedWindModel; // 0x78
	float DragCoefficient; // 0x7c
	float LiftCoefficient; // 0x80
	bool bUseGravityOverride; // 0x84
	float GravityScale; // 0x88
	FVector Gravity; // 0x8c
	float AnimDriveSpringStiffness; // 0x98
	FVector LinearVelocityScale; // 0x9c
	float AngularVelocityScale; // 0xa8
	bool bUseTetrahedralConstraints; // 0xac
	bool bUseThinShellVolumeConstraints; // 0xad
	bool bUseContinuousCollisionDetection; // 0xae
};

struct UNiagaraDataInterfaceSkeletalMesh : UNiagaraDataInterface {
	ENDISkeletalMesh_SourceMode SourceMode; // 0x38
	AActor* Source; // 0x40
	FNiagaraUserParameterBinding MeshUserParameter; // 0x48
	USkeletalMeshComponent* SourceComponent; // 0x68
	ENDISkeletalMesh_SkinningMode SkinningMode; // 0x70
	TArray<FName> SamplingRegions; // 0x78
	int32_t WholeMeshLOD; // 0x88
	TArray<FName> FilteredBones; // 0x90
	TArray<FName> FilteredSockets; // 0xa0
	FName ExcludeBoneName; // 0xb0
	char bExcludeBone : 1; // 0xb8
	bool bRequireCurrentFrameData; // 0xb9
};

struct UBTTask_MoveBackFromTarget_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	bool bForceMoveBack; // 0xb0
	FBlackboardKeySelector TargetActor; // 0xb8
	FBlackboardKeySelector TargetLocation; // 0xe0
	float HealthChance; // 0x108
	float Chance; // 0x10c
	float MoveBackChance; // 0x110
	float MaxNearFriendCount; // 0x114
	float MoveBackChanceByFriend; // 0x118
	float MoveBackDistance; // 0x11c
	float MoveBackDistanceInterval; // 0x120
	float Max Health; // 0x124
	ACommonAI_BaseAICharacter_C* MyCharacter; // 0x128
};

struct UInterpFilter : UObject {
	FString Caption; // 0x28
};

struct AWorldSettings : AInfo {
	int32_t VisibilityCellSize; // 0x228
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x22c
	char bPrecomputeVisibility : 1; // 0x22d
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x22d
	char bEnableWorldBoundsChecks : 1; // 0x22d
	char bEnableNavigationSystem : 1; // 0x22d
	char bEnableAISystem : 1; // 0x22d
	char bEnableWorldComposition : 1; // 0x22d
	char bUseClientSideLevelStreamingVolumes : 1; // 0x22d
	char bEnableWorldOriginRebasing : 1; // 0x22d
	char bWorldGravitySet : 1; // 0x22e
	char bGlobalGravitySet : 1; // 0x22e
	char bMinimizeBSPSections : 1; // 0x22e
	char bForceNoPrecomputedLighting : 1; // 0x22e
	char bHighPriorityLoading : 1; // 0x22e
	char bHighPriorityLoadingLocal : 1; // 0x22e
	char bOverrideDefaultBroadphaseSettings : 1; // 0x22e
	UNavigationSystemConfig* NavigationSystemConfig; // 0x230
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x238
	float WorldToMeters; // 0x240
	float KillZ; // 0x244
	UDamageType* KillZDamageType; // 0x248
	float WorldGravityZ; // 0x250
	float GlobalGravityZ; // 0x254
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x258
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x260
	AGameModeBase* DefaultGameMode; // 0x268
	AGameNetworkManager* GameNetworkManagerClass; // 0x270
	int32_t PackedLightAndShadowMapTextureSize; // 0x278
	FVector DefaultColorScale; // 0x27c
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x288
	float GlobalDistanceFieldViewDistance; // 0x28c
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x290
	FReverbSettings DefaultReverbSettings; // 0x298
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2b8
	float MonoCullingDistance; // 0x2dc
	USoundMix* DefaultBaseSoundMix; // 0x2e0
	float TimeDilation; // 0x2e8
	float MatineeTimeDilation; // 0x2ec
	float DemoPlayTimeDilation; // 0x2f0
	float MinGlobalTimeDilation; // 0x2f4
	float MaxGlobalTimeDilation; // 0x2f8
	float MinUndilatedFrameTime; // 0x2fc
	float MaxUndilatedFrameTime; // 0x300
	FBroadphaseSettings BroadphaseSettings; // 0x304
	APlayerState* Pauser; // 0x348
	TArray<FNetViewer> ReplicationViewers; // 0x350
	TArray<UAssetUserData*> AssetUserData; // 0x360
	APlayerState* PauserPlayerState; // 0x370
	int32_t MaxNumberOfBookmarks; // 0x378
	UBookmarkBase* DefaultBookmarkClass; // 0x380
	TArray<UBookmarkBase*> BookmarkArray; // 0x388
	UBookmarkBase* LastBookmarkClass; // 0x398
};

struct ABP_OceanologyAdvanced_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* Distance; // 0x228
	UInfinite_Compound* Infinite_Compound; // 0x230
	USceneComponent* Scene; // 0x238
	UStaticMeshComponent* Ocean; // 0x240
	USphereComponent* Caustics Level ; // 0x248
	float Ocean Level; // 0x250
	FGlobal_Displacement GlobalDisplacement; // 0x254
	FBaseOffset BaseOffset; // 0x268
	Max_Waves Max_Waves; // 0x284
	FVector World Position; // 0x288
	FVector Height; // 0x294
	ShadingMode Shading Mode; // 0x2a0
	UMaterialInstanceDynamic* Ocean surface; // 0x2a8
	FWave_2  ; // 0x2b0
	FWave_3  ; // 0x2c4
	FWave_4  ; // 0x2d8
	FWave_5  ; // 0x2ec
	bool Use Distance Field; // 0x300
	FDistance_Field Distance_Field; // 0x304
	FTessellation Tessellation; // 0x314
	FSurface_Light Surface_Light; // 0x320
	FFoam_Generator Foam_Generator; // 0x350
	FRefraction Refraction; // 0x3b8
	UMaterialInstance* Custom_01; // 0x3d0
	UMaterialInstance* Custom_02; // 0x3d8
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UCloudWatchLogsDeleteLogGroup : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct AMagicLeapARPinInfoActorBase : AActor {
	FGuid PinId; // 0x220
	bool bVisibilityOverride; // 0x230
};

struct UBlackboardComponent : UActorComponent {
	UBrainComponent* BrainComp; // 0xb0
	UBlackboardData* DefaultBlackboardAsset; // 0xb8
	UBlackboardData* BlackboardAsset; // 0xc0
	TArray<UBlackboardKeyType*> KeyInstances; // 0xe8
};

struct UParticleModuleColorOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorOverLife; // 0x30
	FRawDistributionFloat AlphaOverLife; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UMovieSceneEnumSection : UMovieSceneSection {
	FMovieSceneByteChannel EnumCurve; // 0xe8
};

struct UBTDecorator_BlackboardBase : UBTDecorator {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UActorSequenceComponent : UActorComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct UGizmoAxisRotationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Angle; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurRotationAxis; // 0xbc
	FVector CurRotationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct ABP_WindowFrameWallBase_C : ABP_WallBuildPartBase_C {
	UBP_BuildJointComponent_C* WindowSocket; // 0x8e0
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
	float PointOfViewBackwardOffset; // 0x64
	float NearClippingRadius; // 0x68
};

struct UImgMediaSource : UBaseMediaSource {
	FFrameRate FrameRateOverride; // 0x88
	FString ProxyOverride; // 0x90
	FDirectoryPath SequencePath; // 0xa0
};

struct UParticleModuleVelocityOverLifetime : UParticleModuleVelocityBase {
	FRawDistributionVector VelOverLife; // 0x38
	char Absolute : 1; // 0x80
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x258
	TArray<AActor*> OverrideInvisibleActors; // 0x268
	TArray<FName> OverrideInvisibleLevels; // 0x278
};

struct UWBP_Button_Menu_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button; // 0x268
	UImage* Image_Cover; // 0x270
	UImage* Image_Cover_2; // 0x278
	UTextBlock* Text; // 0x280
	UTextBlock* Text_2; // 0x288
	FMulticastInlineDelegate OnButtonClicked; // 0x290
	FText Name; // 0x2a0
	FString Key; // 0x2b8
	FString Additional Key; // 0x2c8
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct AItemPickup : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x220
};

struct UButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
};

struct UWBP_Radiogram_4020303_C : UUserWidget {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x260
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x268
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x270
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x278
	UWBP_RadiogramListing_C* WBP_RadiogramListing_4; // 0x280
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7a0
};

struct UXRVisualizationFunctionLibrary : UBlueprintFunctionLibrary {
	UXRVisualizationLoadHelper* LoadHelper; // 0x28
};

struct UNavigationGraphNodeComponent : USceneComponent {
	FNavGraphNode Node; // 0x1f8
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x210
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x218
};

struct ABP_Flare_NPCDrone_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UMaterialBillboardComponent* Flare; // 0x228
	UTexture* SubFlareTexture; // 0x230
	FLinearColor SubFlareColor; // 0x238
	float SubFlareIntensity; // 0x248
	float SubFlarePowExp; // 0x24c
	float SubFlareSize; // 0x250
	UTexture* SubFlare2Texture; // 0x258
	FLinearColor SubFlare2Color; // 0x260
	float SubFlare2Intensity; // 0x270
	float SubFlare2Size; // 0x274
	float SubFlare2PowExp; // 0x278
	UTexture* AnamorphicTexture; // 0x280
	float AnamorphicFlareInnerRadius; // 0x288
	float AnamorphicFlareInnerDensity; // 0x28c
	float AnamorphicFlareIntensity; // 0x290
	FLinearColor AnamorphicFlareInnerColor; // 0x294
	float AnamorphicFlarePowExp; // 0x2a4
	float AnamorphicFlareSizeFactor; // 0x2a8
	UTexture* HaloTexture; // 0x2b0
	float HaloInnerRadius; // 0x2b8
	float HaloIntensity; // 0x2bc
	float HaloPowExp; // 0x2c0
	FLinearColor HaloInnerColor; // 0x2c4
	FLinearColor HaloOuterColor; // 0x2d4
	UTexture* SubHaloTexture; // 0x2e8
	float SubHaloInnerRadius; // 0x2f0
	float SubHaloIntensity; // 0x2f4
	FLinearColor SubHaloColor; // 0x2f8
	float SubHaloPowExp; // 0x308
	FLinearColor AnamorphicFlareOuterColor; // 0x30c
	float FadeDistance; // 0x31c
};

struct UWBP_HUD_Action_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Refresh; // 0x268
	UWidgetAnimation* Anim_Vehicle_Empty; // 0x270
	UImage* FireType; // 0x278
	UImage* Image_9; // 0x280
	UImage* Image_13; // 0x288
	UImage* Image_86; // 0x290
	UImage* Image_90; // 0x298
	UImage* Image_162; // 0x2a0
	UImage* Image_228; // 0x2a8
	UImage* Image_347; // 0x2b0
	UImage* Image_Seat_2; // 0x2b8
	UImage* Image_Seat_3; // 0x2c0
	UImage* Image_Seat_4; // 0x2c8
	UImage* Image_Seat_5; // 0x2d0
	UImage* State; // 0x2d8
	UTextBlock* Text_Ammo; // 0x2e0
	UTextBlock* Text_AmmoTotal; // 0x2e8
	UTextBlock* Text_VehicleSpeed; // 0x2f0
	UProgressBar* VehicleHP; // 0x2f8
	UProgressBar* VehicleHP_2; // 0x300
	UVerticalBox* VerticalBox_ActionGuide; // 0x308
	UWBP_HUD_ActionMain_C* WBP_HUD_ActionMain; // 0x310
	UWBP_HUD_ActionSub_C* WBP_HUD_ActionSub; // 0x318
	UWBP_HUD_Held_InteractionListing_C* WBP_HUD_Held_InteractionListing_Hand; // 0x320
	UWBP_Key_C* WBP_Key_FireMode; // 0x328
	UWidgetSwitcher* WidgetSwitcher_Action; // 0x330
	UWidgetSwitcher* WidgetSwitcher_Held; // 0x338
	UWidgetSwitcher* WidgetSwitcher_Vehicle; // 0x340
	UCanvasPanel* WS_Action_Hand; // 0x348
	UCanvasPanel* WS_Action_Holdable; // 0x350
	UCanvasPanel* WS_Action_Vehicle; // 0x358
	UGridPanel* WS_Held_Empty; // 0x360
	UGridPanel* WS_Held_RangeWeapon; // 0x368
	UGridPanel* WS_Vehicle_Dynamo; // 0x370
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x378
	UWidget* ActiveWidget; // 0x380
	int32_t TempVehicleBattery; // 0x388
	int32_t TempVehicleHealth; // 0x38c
	int32_t TempVehicleSpeed; // 0x390
	int32_t TempAmmo; // 0x394
	UWBP_HoldableGuideUIBase_C* HoldableGuideUI; // 0x398
	bool bIsLMBWidgetDefault; // 0x3a0
	E_MechanicArmMode Mechanic Arm Mode; // 0x3a1
	AHoldableBase* Current Holdable; // 0x3a8
	int32_t CurrentAmmo_Total; // 0x3b0
};

struct USoundWave : USoundBase {
	int32_t CompressionQuality; // 0x1b8
	int32_t StreamingPriority; // 0x1bc
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x1c0
	ESoundGroup SoundGroup; // 0x1c2
	char bLooping : 1; // 0x1c3
	char bStreaming : 1; // 0x1c3
	char bSeekableStreaming : 1; // 0x1c3
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x1c4
	char bMature : 1; // 0x1c5
	char bManualWordWrap : 1; // 0x1c5
	char bSingleLine : 1; // 0x1c6
	char bIsAmbisonics : 1; // 0x1c6
	TArray<float> FrequenciesToAnalyze; // 0x1c8
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x1d8
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x1e8
	int32_t InitialChunkSize; // 0x1f8
	FString SpokenText; // 0x240
	float SubtitlePriority; // 0x250
	float Volume; // 0x254
	float Pitch; // 0x258
	int32_t NumChannels; // 0x25c
	int32_t SampleRate; // 0x260
	TArray<FSubtitleCue> Subtitles; // 0x270
	UCurveTable* Curves; // 0x280
	UCurveTable* InternalCurves; // 0x288
};

struct UOnlineBeaconsSettings : UObject {
	int32_t ListenPort; // 0x28
	float InitialTimeout; // 0x2c
	float Timeout; // 0x30
	FName NetDriverClass; // 0x34
	FName NetDriverFallbackClass; // 0x3c
};

struct UMovieSceneCinematicShotSection : UMovieSceneSubSection {
	FString ShotDisplayName; // 0x160
	FText DisplayName; // 0x170
};

struct UGetUserPrivilegeCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct USurvivalCharacterMovementComponent : UCharacterMovementComponent {
	bool bStopTickComponent; // 0xb04
};

struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x358
	float OuterConeAngle; // 0x35c
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x80
	float LpvBiasMultiplier; // 0x84
	TArray<FStaticMaterial> StaticMaterials; // 0x88
	float LightmapUVDensity; // 0x98
	int32_t LightMapResolution; // 0x9c
	int32_t LightMapCoordinateIndex; // 0xa0
	float DistanceFieldSelfShadowBias; // 0xa4
	UBodySetup* BodySetup; // 0xa8
	int32_t LODForCollision; // 0xb0
	char bGenerateMeshDistanceField : 1; // 0xb4
	char bStripComplexCollisionForConsole : 1; // 0xb4
	char bHasNavigationData : 1; // 0xb4
	char bSupportUniformlyDistributedSampling : 1; // 0xb4
	char bSupportPhysicalMaterialMasks : 1; // 0xb4
	char bIsBuiltAtRuntime : 1; // 0xb4
	char bAllowCPUAccess : 1; // 0xb4
	char bSharedCookedData : 1; // 0xb5
	char bSupportGpuUniformlyDistributedSampling : 1; // 0xb5
	TArray<UStaticMeshSocket*> Sockets; // 0xd8
	FVector PositiveBoundsExtension; // 0xf8
	FVector NegativeBoundsExtension; // 0x104
	FBoxSphereBounds ExtendedBounds; // 0x110
	int32_t ElementToIgnoreForTexFactor; // 0x12c
	TArray<UAssetUserData*> AssetUserData; // 0x130
	UObject* EditableMesh; // 0x140
	UNavCollisionBase* NavCollision; // 0x148
};

struct UWBP_Radiogram_6010105_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x2a8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x2b0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x2b8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_4; // 0x2c0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_5; // 0x2c8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_6; // 0x2d0
};

struct UActorComponent : UObject {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	int32_t UCSSerializationIndex; // 0x84
	char bNetAddressable : 1; // 0x88
	char bReplicates : 1; // 0x88
	char bAutoActivate : 1; // 0x89
	char bIsActive : 1; // 0x8a
	char bEditableWhenInherited : 1; // 0x8a
	char bCanEverAffectNavigation : 1; // 0x8a
	char bIsEditorOnly : 1; // 0x8a
	EComponentCreationMethod CreationMethod; // 0x8c
	FMulticastSparseDelegate OnComponentActivated; // 0x8d
	FMulticastSparseDelegate OnComponentDeactivated; // 0x8e
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct ULayer : UObject {
	FName LayerName; // 0x28
	char bIsVisible : 1; // 0x30
	TArray<FLayerActorStats> ActorStats; // 0x38
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UWBP_HUD_Notice_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Play; // 0x268
	UTextBlock* Text_Notice; // 0x270
	FText NoticeText; // 0x278
	bool ApearAnim; // 0x290
	bool DoCountDown; // 0x291
	float EndTime; // 0x294
	FFloatValueFromDataTable GameTimeMultiplier; // 0x298
	FTimerHandle TimerCountDown; // 0x2c0
};

struct ABP_ConsumeHoldable_C : AConsumeHoldableBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4a0
	float CastStartTime_Local; // 0x4a8
	bool CanUnheldBySameItem; // 0x4ac
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct UTexture2D : UTexture {
	int32_t LevelIndex; // 0xd8
	int32_t FirstResourceMemMip; // 0xdc
	char bTemporarilyDisableStreaming : 1; // 0xe0
	TextureAddress AddressX; // 0xe1
	TextureAddress AddressY; // 0xe2
	FIntPoint ImportedSize; // 0xe4
};

struct APlayerCameraManager : AActor {
	APlayerController* PCOwner; // 0x220
	USceneComponent* TransformComponent; // 0x228
	float DefaultFOV; // 0x238
	float DefaultOrthoWidth; // 0x240
	float DefaultAspectRatio; // 0x248
	FCameraCacheEntry CameraCache; // 0x290
	FCameraCacheEntry LastFrameCameraCache; // 0x880
	FTViewTarget ViewTarget; // 0xe70
	FTViewTarget PendingViewTarget; // 0x1470
	FCameraCacheEntry CameraCachePrivate; // 0x1aa0
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x2090
	TArray<UCameraModifier*> ModifierList; // 0x2680
	TArray<UCameraModifier*> DefaultModifiers; // 0x2690
	float FreeCamDistance; // 0x26a0
	FVector FreeCamOffset; // 0x26a4
	FVector ViewTargetOffset; // 0x26b0
	FMulticastInlineDelegate OnAudioFadeChangeEvent; // 0x26c0
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x26e0
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x26f0
	UCameraAnimInst* AnimInstPool[0x8]; // 0x26f8
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2738
	TArray<UCameraAnimInst*> ActiveAnims; // 0x2758
	TArray<UCameraAnimInst*> FreeAnims; // 0x2768
	ACameraActor* AnimCameraActor; // 0x2778
	char bIsOrthographic : 1; // 0x2780
	char bDefaultConstrainAspectRatio : 1; // 0x2780
	char bClientSimulatingViewTarget : 1; // 0x2780
	char bUseClientSideCameraUpdates : 1; // 0x2780
	char bGameCameraCutThisFrame : 1; // 0x2781
	float ViewPitchMin; // 0x2784
	float ViewPitchMax; // 0x2788
	float ViewYawMin; // 0x278c
	float ViewYawMax; // 0x2790
	float ViewRollMin; // 0x2794
	float ViewRollMax; // 0x2798
	float ServerUpdateCameraTimeout; // 0x27a0
};

struct ABP_SkillBase_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
	float CoolTime; // 0x230
	FS_SkillStruct Skill; // 0x238
	float LastActivationTime; // 0x268
	BP_SurvivalCharacter_C* Character; // 0x270
	int32_t Idx; // 0x278
	TArray<UBP_SkillAcitvationConditionBase_C*> ConditionList; // 0x280
	bool IsActivation; // 0x290
	TArray<UBP_SkillActionTaskBase_C*> SkillTasks; // 0x298
	float StartEnergyCost; // 0x2a8
	int32_t UID; // 0x2ac
};

struct UImage : UWidget {
	FSlateBrush Brush; // 0x108
	FDelegate BrushDelegate; // 0x190
	FLinearColor ColorAndOpacity; // 0x1a0
	FDelegate ColorAndOpacityDelegate; // 0x1b0
	bool bFlipForRightToLeftFlowDirection; // 0x1c0
	FDelegate OnMouseButtonDownEvent; // 0x1c4
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	EFireEventsAtPosition EventPosition; // 0x84
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UGetRecentPlayersCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x250
	TArray<AOnlineBeaconClient*> ClientActors; // 0x258
};

struct UCloudWatchLogsDeleteLogStream : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ABP_StairLBuildPart_C : ABP_StaticMeshBuildPartBase_C {
	UBP_BuildJointComponent_C* Bolt; // 0x860
};

struct UWBP_Slot_Inventory_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border; // 0x268
	UCanvasPanel* CanvasPanel_Slot; // 0x270
	UHorizontalBox* HorizontalBox_Attachment; // 0x278
	UImage* Image_Able; // 0x280
	UImage* Image_AttachmentGrip; // 0x288
	UImage* Image_AttachmentMagazine; // 0x290
	UImage* Image_AttachmentMuzzle; // 0x298
	UImage* Image_AttachmentSight; // 0x2a0
	UImage* Image_Broken; // 0x2a8
	UImage* Image_Item; // 0x2b0
	UImage* Image_Selected; // 0x2b8
	UImage* Image_Tier; // 0x2c0
	UImage* Image_Unique; // 0x2c8
	UProgressBar* ProgressBar_Condition; // 0x2d0
	USizeBox* SizeBox_1; // 0x2d8
	UImage* State_EMP; // 0x2e0
	UTextBlock* Text_Amount; // 0x2e8
	UTextBlock* Text_Slot; // 0x2f0
	UWBP_UI_SlotHovering_C* WBP_UI_SlotHovering; // 0x2f8
	bool Mouse Over; // 0x300
	FItemInventory Item; // 0x308
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x340
	FVector2D Slot Size; // 0x348
	float Tooltip Delay; // 0x350
	bool Selected; // 0x354
	bool Allow Selection; // 0x355
	int32_t Slot Number; // 0x358
	bool UseInGameUI; // 0x35c
	bool IsDoubleClick; // 0x35d
	FItemGeneralInfo generalinfo; // 0x360
	bool bInteraction; // 0x4b0
	bool bBreakable; // 0x4b1
	FProgressBarStyle ConditionStyle_Default; // 0x4b8
	FProgressBarStyle ConidtionStyle_Consumable; // 0x658
	bool bUseCondition; // 0x7f8
	FTimerHandle StateOverlayTimer; // 0x800
	bool UseArchiveItem; // 0x808
	FArchiveItemInfo ArchiveItem; // 0x810
	float TempCondition; // 0x878
	float CurrentCondition; // 0x87c
	TArray<FDataTableRowHandle> HighlightUIDArray; // 0x880
};

struct ABP_Survival_Sky_Sphere_C : AActor {
	UStaticMeshComponent* SkySphereMesh; // 0x220
	USceneComponent* Base; // 0x228
	UMaterialInstanceDynamic* Sky material; // 0x230
	bool Refresh material; // 0x238
	ADirectionalLight* Directional light actor; // 0x240
	bool Colors determined by sun position; // 0x248
	float Sun height; // 0x24c
	float Sun brightness; // 0x250
	float Horizon falloff; // 0x254
	FLinearColor Zenith Color; // 0x258
	FLinearColor Horizon color; // 0x268
	FLinearColor Cloud color; // 0x278
	FLinearColor Overall Color; // 0x288
	float Cloud speed; // 0x298
	float Cloud opacity; // 0x29c
	float Stars brightness; // 0x2a0
	UCurveLinearColor* Horizon color curve; // 0x2a8
	UCurveLinearColor* Zenith color curve; // 0x2b0
	UCurveLinearColor* Cloud color curve; // 0x2b8
};

struct UWBP_Radiogram_6010210_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x2a8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x2b0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x2b8
};

struct UWBP_HUD_Event_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Notification; // 0x268
	UWidgetAnimation* Anim_Alarm; // 0x270
	UBorder* Border_Alarm; // 0x278
	UTextBlock* Count; // 0x280
	UImage* dot1; // 0x288
	UImage* dot2; // 0x290
	UImage* Image_2; // 0x298
	UImage* Image_3; // 0x2a0
	UImage* Image_63; // 0x2a8
	UImage* Image_110; // 0x2b0
	UImage* Image_293; // 0x2b8
	UImage* Image_Tint; // 0x2c0
	UVerticalBox* RadiogramObjectiveList; // 0x2c8
	UTextBlock* TextBlock; // 0x2d0
	UTextBlock* TextBlock_Name; // 0x2d8
	UVerticalBox* VerticalBox; // 0x2e0
	UWBP_Key_C* WBP_Key; // 0x2e8
	TMap<UWBP_ObjectiveBase_C*, int32_t> RememberdIndex; // 0x2f0
	TMap<AActor*, UWBP_ObjectiveBase_C*> ObjectRefs; // 0x340
	FIntPair NewestRadiorgam; // 0x390
	UWBP_RadiogramObjectiveMain_C* RadiogramMenu; // 0x398
	UWBP_TutorialQuestMain_C* TutorialObjective; // 0x3a0
};

struct USVCH_Male_TP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x2c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x2f0
	FAnimNode_Slot AnimGraphNode_Slot_10; // 0x3b0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x3f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x550
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x5d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x728
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x750
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x8e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x900
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x920
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x9c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0xb50
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xbf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0xd48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xde8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xe10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xe38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xe60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xe88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xeb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xed8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xf00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xf28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xf50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xf78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xfa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xfc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xff0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1018
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1040
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1068
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1090
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x10b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x10e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1108
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1130
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1158
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x1180
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1200
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1230
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x12b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x12e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x1330
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x13f0
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1440
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x1470
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x1490
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x14b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x15b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x1638
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x16f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x17e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x1880
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x1968
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x1a08
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1af0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x1b20
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x1b40
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x1b60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1c68
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x1ce8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1da8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x1e28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1ec8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x1f48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1fe8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2068
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x2098
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x2158
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x21d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x2278
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x22f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x2398
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x2418
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x2498
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x2538
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x25b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x25e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x2668
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x2728
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x27a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2848
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x28c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x28f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x2978
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2a38
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x2ab8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2b58
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2bd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2c08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x2c88
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x2d28
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x2d48
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2d68
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x2e70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2f30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2fb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x3030
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x30b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x3150
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x31d0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3270
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x32a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x3388
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x3428
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x3448
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3468
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3570
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x35f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x36b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x3798
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x3880
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x3920
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x3a08
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3aa8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3ad8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x3b88
	FAnimNode_Slot AnimGraphNode_Slot_9; // 0x3c08
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0x3c50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x3c98
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x3cc0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x3e18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x3ed8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x3f00
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x3f28
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x3f70
	FAnimNode_Fabrik AnimGraphNode_Fabrik_3; // 0x3fc0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x4150
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x42a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x42d0
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x42f8
	FAnimNode_Root AnimGraphNode_Root_2; // 0x4340
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x4370
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x4398
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x43c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x43e8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x4540
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x4698
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x46c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x4760
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x4788
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x47b0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x4908
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x49c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x4a10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x4ab0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x4ad8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x4b98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x4bc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x4c60
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x4ce0
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4d80
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x4e98
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x4ee0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x4f08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x4f30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x4f58
	FAnimNode_DragonFeetSolver AnimGraphNode_DragonFeetSolver; // 0x50b0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x5700
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x5858
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x58f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x5920
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x5948
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x5970
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x59b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x59e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x5aa0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5ac8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x5b68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x5bb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x5bd8
	FAnimNode_DragonSpineSolver AnimGraphNode_DragonSpineSolver; // 0x5d30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x6510
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x6668
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x6708
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x6730
	FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x6758
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x6808
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x68a8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x6968
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x6988
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x6a08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x6aa8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x6ad0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x6b90
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x6c10
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x6cd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x6cf8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x6d20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x6dc0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x6e60
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x6fb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x7088
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x7108
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x71f0
	FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x7290
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x7420
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x7440
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x7460
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7528
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x7680
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x76a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x76d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x7770
	FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x77a0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x7930
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x7950
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x7970
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x7a38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x7ad8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7b00
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x7b28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x7be8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x7c68
	FAnimNode_Root AnimGraphNode_Root; // 0x7df8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7e28
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x7e50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7f20
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x7fa0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x8060
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x80e0
	float Forward; // 0x8270
	bool NowInDediSvr; // 0x8274
	bool Player Dead; // 0x8275
	TArray<FDragonData_FootData> FootIKInfo; // 0x8278
	bool Is In Air; // 0x8288
	float FootIKBlendingAlpha; // 0x828c
	bool UseFookIK; // 0x8290
	bool Equipping; // 0x8291
	bool IsCasting; // 0x8292
	bool bIsPlayingSkillTasking; // 0x8293
	bool Reloading; // 0x8294
	bool bIsVault; // 0x8295
	FHoldableAnimation Holdable Animation; // 0x8298
	FS_RangeWeaponAnims Ranage Weapon Animations; // 0x8420
	float Yaw; // 0x84a8
	float Pitch; // 0x84ac
	bool bIsRangedWeaponAimed; // 0x84b0
	bool bPlayerWakeUp; // 0x84b1
	bool bIsRiding; // 0x84b2
	UAnimSequence* ThrowHoldingAnim; // 0x84b8
	bool Aimed; // 0x84c0
	bool bIsThrowWeapon; // 0x84c1
	UBlendSpaceBase* Empty Hands Aim Offset; // 0x84c8
	FTransform Left Hand Transform; // 0x84d0
	bool Holding Item; // 0x8500
	bool Use Left Hand Socket; // 0x8501
	float Direction; // 0x8504
	float Speed; // 0x8508
	float ADSSpeed; // 0x850c
	UBlendSpaceBase* Jog Character Blend Space; // 0x8510
	UAnimSequenceBase* Idle Character Animation; // 0x8518
	UAnimSequenceBase* Jump Start Character Animation; // 0x8520
	UAnimSequenceBase* Jump Loop Character Animation; // 0x8528
	UAnimSequenceBase* Jump Land Character Animation; // 0x8530
	UAnimSequenceBase* Crouch Idle Character Animation; // 0x8538
	UBlendSpaceBase* Crouch Character Blend Space; // 0x8540
	bool Jump Start End; // 0x8548
	bool Jump Land End; // 0x8549
	BP_MasterCharacter_C* Character; // 0x8550
	bool DoJump; // 0x8558
	AHoldableBase* Held Actor; // 0x8560
	bool Crouching; // 0x8568
	float Base Pitch; // 0x856c
	float Base Yaw; // 0x8570
	AWeaponBase* Master Weapon; // 0x8578
	bool bPlayerSleep; // 0x8580
	bool WithoutBlend; // 0x8581
	UBST_AnimationTask_C* AnimationTask; // 0x8588
	FString SkillAnimTaskName; // 0x8590
	float MaxJumpHight; // 0x85a0
	float LandingHight; // 0x85a4
	UCurveFloat* LandingSoundVolumeCurve; // 0x85a8
	bool bPlayerLieDown; // 0x85b0
	bool Enable Jump; // 0x85b1
	FMulticastInlineDelegate OnNotifyVaultJumpStarted; // 0x85b8
	FMulticastInlineDelegate OnNotifyVaultJumpEnded; // 0x85c8
	bool bCriticalLanding; // 0x85d8
	FName LeftHandSocketName; // 0x85dc
	bool bHasRangeWeaponAttachment; // 0x85e4
	UAnimSequenceBase* ForeGripHandAnimation; // 0x85e8
	float LeftHandMultifly; // 0x85f0
	float LeftHandAlpha; // 0x85f4
	bool IsMyCharacter; // 0x85f8
	AWeaponBase* Target Weapon; // 0x8600
	USkeletalMeshComponent* TargetSkelMesh; // 0x8608
	bool RightLean; // 0x8610
	bool LeftLean; // 0x8611
	bool NearWallHandUp; // 0x8612
	bool BlendNearWallAnimSeq; // 0x8613
	float DestBlandRatio; // 0x8614
	float HandUpBlendRatio; // 0x8618
	bool IsSwim; // 0x861c
};

struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
};

struct UNiagaraDataInterfaceGrid3D : UNiagaraDataInterfaceRWBase {
	FIntVector NumCells; // 0xd8
	float CellSize; // 0xe4
	int32_t NumCellsMaxAxis; // 0xe8
	ESetResolutionMethod SetResolutionMethod; // 0xec
	FVector WorldBBoxSize; // 0xf0
};

struct UWBP_DebugWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* TextBlock_135; // 0x268
	BP_SurvivalCharacter_C* TSVC; // 0x270
};

struct ABP_WaterPoolBase_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UBoxComponent* WaterVolume; // 0x228
	UStaticMeshComponent* WaterSurface; // 0x230
	USceneComponent* Scene; // 0x238
	UMaterialInterface* Ocean Material; // 0x240
	float Water Scale X; // 0x248
	float Water Scale Y; // 0x24c
	float Wave Speed; // 0x250
	UMaterialInstanceDynamic* Water Material; // 0x258
	float Overall Water Scale; // 0x260
	float Variation Amount; // 0x264
	FLinearColor Primary Water Color; // 0x268
	FLinearColor Secondary Water Color; // 0x278
	float Base Opacity; // 0x288
	float Shore Depth; // 0x28c
	float Depth Scale; // 0x290
	FLinearColor Deep Water Color; // 0x294
	FLinearColor Shallow Water Color; // 0x2a4
	float RemainWater; // 0x2b4
	FVector EndLocation; // 0x2b8
	float TotalWater; // 0x2c4
	float InteractionDistance; // 0x2c8
	float RefillPerSecond; // 0x2cc
	FFloatValueFromDataTable ThirstGainRatioByWater; // 0x2d0
	float DrinkAmount; // 0x2f8
};

struct UCloudWatchLogsDescribeSubscriptionFilters : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UAssetExportTask : UObject {
	UObject* Object; // 0x28
	UExporter* Exporter; // 0x30
	FString Filename; // 0x38
	bool bSelected; // 0x48
	bool bReplaceIdentical; // 0x49
	bool bPrompt; // 0x4a
	bool bAutomated; // 0x4b
	bool bUseFileArchive; // 0x4c
	bool bWriteEmptyFiles; // 0x4d
	TArray<UObject*> IgnoreObjectList; // 0x50
	UObject* Options; // 0x60
	TArray<FString> Errors; // 0x68
};

struct UMaterialExpressionDistanceToNearestSurface : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct UNiagaraDataInterfaceArrayFloat2 : UNiagaraDataInterfaceArray {
	TArray<FVector2D> FloatData; // 0x50
};

struct UResourceBatchData : UDataAsset {
	TMap<FString, FResourceBatchGroupData> Groups; // 0x30
	FString PreviewMapTexturePath; // 0x80
};

struct UWBP_Function_Crafting_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_Button_Function_C* Button_Radiogram; // 0x268
	UVerticalBox* OptionBox; // 0x270
	UWBP_Button_Function_C* WBP_Button_Max; // 0x278
	UWBP_Button_Function_C* WBP_Button_x10; // 0x280
	UWBP_Button_Function_C* WBP_Button_x5; // 0x288
	bool Item Droppable; // 0x290
	E_ItemCategorys Item Category; // 0x291
	bool Item Stackable; // 0x292
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x298
	UWBP_InGameUI_C* InGameUI; // 0x2a0
	UWBP_Slot_Inventory_C* Slot Reference; // 0x2a8
	FS_CraftingRecipeData Crafting Recipe; // 0x2b0
	UBP_CraftingComponent_C* TargetCraftingComponent; // 0x2f0
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x230
};

struct UMaterialExpressionGIReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct UWBP_HUD_Interaction_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UOverlay* Overlay_Cursor; // 0x268
	UWBP_HUD_InteractionListing_C* WBP_HUD_InteractionListing_Build; // 0x270
	UWBP_HUD_InteractionListing_C* WBP_HUD_InteractionListing_Cancel; // 0x278
	UWBP_HUD_InteractionListing_C* WBP_HUD_InteractionListing_OpenRingUI; // 0x280
	UWBP_HUD_InteractionListing_C* WBP_HUD_InteractionListing_Rotate; // 0x288
	UWBP_HUD_Interaction_Target_C* WBP_InteractionGuideWidget; // 0x290
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x298
	AActor* TargetedActor; // 0x2a0
	UBP_PlayerBuildingComponent_C* Player Building Component; // 0x2a8
	FText TempTargetName; // 0x2b0
	FText CurrentTargetName; // 0x2c8
	bool bTempAble; // 0x2e0
	bool bCurrentAble; // 0x2e1
	bool bRotate; // 0x2e2
	bool bRide; // 0x2e3
	ESlateVisibility In Visibility; // 0x2e4
	E_MechanicArmMode Mechanic Arm Mode; // 0x2e5
	E_InteractionType CurrentAction; // 0x2e6
	ABP_BuildPartBase_C* As BP Build Part Base; // 0x2e8
};

struct ASurvivalGameMode : AGameMode {
	ASessionDataManager* SessionDataManager_Native; // 0x308
	bool NeedCustomize; // 0x310
	int32_t AdminPlayerSessionSlot; // 0x314
	UDataTable* BanNickNameDataTable; // 0x318
	UDataTable* BlackListUIDDataTable; // 0x320
	TArray<FString> BanNickNames; // 0x328
	TArray<FString> BlackListUIDs; // 0x338
	FSurvivalWorldSettings WorldSettings; // 0x348
	ASVTeamInfo* TeamClass; // 0x3e0
	TArray<ASVTeamInfo*> Teams; // 0x3e8
	float CheckInvaildTeamMemberInterval; // 0x3f8
};

struct USceneCaptureComponentCube : USceneCaptureComponent {
	UTextureRenderTargetCube* TextureTarget; // 0x2b0
	bool bCaptureRotation; // 0x2b8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2c0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2c8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2d0
	float IPD; // 0x2d8
};

struct USourceEffectEQPreset : USoundEffectSourcePreset {
	FSourceEffectEQSettings Settings; // 0xa0
};

struct USequenceCameraShakeCameraStandIn : UObject {
	float FieldOfView; // 0x30
};

struct USVWeaponPartsContent : USVItemPartsContent {
	EWeaponPartsType WeaponPartsType; // 0x48
};

struct UWBP_HUD_Casting_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UInvalidationBox* InvalidationBox_4; // 0x268
	UProgressBar* Progress_Casting; // 0x270
	UTextBlock* TB_Function; // 0x278
	UTextBlock* Text_CastingItem; // 0x280
	UTextBlock* Text_CastingTime; // 0x288
	UWBP_Key_C* WBP_Key; // 0x290
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x298
	AConsumeHoldableBase* Consume Holdable Base; // 0x2a0
	bool bCasting; // 0x2a8
	AHoldableBase* CurrentHoldable; // 0x2b0
};

struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x428
	char bDrawPolyEdges : 1; // 0x428
	char bDrawFilledPolys : 1; // 0x428
	char bDrawNavMeshEdges : 1; // 0x428
	char bDrawTileBounds : 1; // 0x428
	char bDrawPathCollidingGeometry : 1; // 0x428
	char bDrawTileLabels : 1; // 0x428
	char bDrawPolygonLabels : 1; // 0x428
	char bDrawDefaultPolygonCost : 1; // 0x429
	char bDrawLabelsOnPathNodes : 1; // 0x429
	char bDrawNavLinks : 1; // 0x429
	char bDrawFailedNavLinks : 1; // 0x429
	char bDrawClusters : 1; // 0x429
	char bDrawOctree : 1; // 0x429
	char bDrawOctreeDetails : 1; // 0x429
	char bDrawMarkedForbiddenPolys : 1; // 0x429
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x42a
	float DrawOffset; // 0x42c
	char bFixedTilePoolSize : 1; // 0x430
	int32_t TilePoolSize; // 0x434
	float TileSizeUU; // 0x438
	float CellSize; // 0x43c
	float CellHeight; // 0x440
	float AgentRadius; // 0x444
	float AgentHeight; // 0x448
	float AgentMaxSlope; // 0x44c
	float AgentMaxStepHeight; // 0x450
	float MinRegionArea; // 0x454
	float MergeRegionSize; // 0x458
	float MaxSimplificationError; // 0x45c
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x460
	int32_t TileNumberHardLimit; // 0x464
	int32_t PolyRefTileBits; // 0x468
	int32_t PolyRefNavPolyBits; // 0x46c
	int32_t PolyRefSaltBits; // 0x470
	FVector NavMeshOriginOffset; // 0x474
	float DefaultDrawDistance; // 0x480
	float DefaultMaxSearchNodes; // 0x484
	float DefaultMaxHierarchicalSearchNodes; // 0x488
	ERecastPartitioning RegionPartitioning; // 0x48c
	ERecastPartitioning LayerPartitioning; // 0x48d
	int32_t RegionChunkSplits; // 0x490
	int32_t LayerChunkSplits; // 0x494
	char bSortNavigationAreasByCost : 1; // 0x498
	char bPerformVoxelFiltering : 1; // 0x498
	char bMarkLowHeightAreas : 1; // 0x498
	char bUseExtraTopCellWhenMarkingAreas : 1; // 0x498
	char bFilterLowSpanSequences : 1; // 0x498
	char bFilterLowSpanFromTileCache : 1; // 0x498
	char bDoFullyAsyncNavDataGathering : 1; // 0x498
	char bUseBetterOffsetsFromCorners : 1; // 0x498
	char bStoreEmptyTileLayers : 1; // 0x499
	char bUseVirtualFilters : 1; // 0x499
	char bAllowNavLinkAsPathEnd : 1; // 0x499
	char bUseVoxelCache : 1; // 0x499
	float TileSetUpdateInterval; // 0x49c
	float HeuristicScale; // 0x4a0
	float VerticalDeviationFromGroundCompensation; // 0x4a4
};

struct UPaperSprite : UObject {
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FVector2D BakedSourceUV; // 0x48
	FVector2D BakedSourceDimension; // 0x50
	UTexture2D* BakedSourceTexture; // 0x58
	UMaterialInterface* DefaultMaterial; // 0x60
	UMaterialInterface* AlternateMaterial; // 0x68
	TArray<FPaperSpriteSocket> Sockets; // 0x70
	ESpriteCollisionMode SpriteCollisionDomain; // 0x80
	float PixelsPerUnrealUnit; // 0x84
	UBodySetup* BodySetup; // 0x88
	int32_t AlternateMaterialSplitIndex; // 0x90
	TArray<FVector4> BakedRenderData; // 0x98
};

struct USAC_CompareHP_C : UBP_SkillAcitvationConditionBase_C {
	float CompareHealth; // 0x98
	bool IsLarger; // 0x9c
};

struct UAnimNotify_LungeToTarget_C : UAnimNotifyState {
	float JumpHeight; // 0x30
	float JumpTime; // 0x34
	float Accupy; // 0x38
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x220
};

struct UMovieSceneAudioTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x80
};

struct UWB_ClassicComboBoxItem_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* TextComboBoxItem; // 0x268
	UWB_ClassicComboBoxButton_C* WB_ClassicComboBoxButton; // 0x270
	FString ItemOption; // 0x278
	FSVideoResolution Resolution; // 0x288
};

struct UMaterialExpressionCustom : UMaterialExpression {
	FString Code; // 0x40
	ECustomMaterialOutputType OutputType; // 0x50
	FString Description; // 0x58
	TArray<FCustomInput> Inputs; // 0x68
	TArray<FCustomOutput> AdditionalOutputs; // 0x78
	TArray<FCustomDefine> AdditionalDefines; // 0x88
	TArray<FString> IncludeFilePaths; // 0x98
};

struct UWidgetAnimation : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x68
	bool bLegacyFinishOnStop; // 0x78
	FString DisplayLabel; // 0x80
};

struct UBP_GameSettings_C : USaveGame {
	float Look General Horizontal Sensitivity; // 0x28
	float Look General Vertical Sensitivity; // 0x2c
	bool Look Horizontal Invert; // 0x30
	bool Look Vertical Invert; // 0x31
	TScriptInterface<IBPI_GameSettingsInterface_C> Game Settings Interface; // 0x38
	FString Save File Name; // 0x48
	int32_t Save File User Index; // 0x58
	TArray<FSAudioUpdateStruct> AudioEmittors; // 0x60
	float Audio Multiplier Master; // 0x70
	float Audio Multiplier Music; // 0x74
	float Audio Multiplier Effect; // 0x78
	float Audio Multiplier Ambient; // 0x7c
	float Audio Multiplier UI; // 0x80
	float Audio Multiplier World Voice; // 0x84
	float Audio Multiplier Team Voice; // 0x88
	float Volume Master; // 0x8c
	float Volume Music; // 0x90
	float Volume Effect; // 0x94
	float Volume Ambient; // 0x98
	int32_t Video X Resolution; // 0x9c
	int32_t Video Y Resolution; // 0xa0
	TArray<UCameraComponent*> Camera List; // 0xa8
	EWindowMode Screen Mode; // 0xb8
	int32_t Resolution Scale Quality; // 0xbc
	float View Distance Scale; // 0xc0
	int32_t Anti Aliasing Quality; // 0xc4
	int32_t Post Processing Quality; // 0xc8
	int32_t Shadow Quality; // 0xcc
	int32_t Texture Quality; // 0xd0
	int32_t Effect Quality; // 0xd4
	int32_t Foliage Quality; // 0xd8
	float Field Of View FOV; // 0xdc
	float Motion Blur Strength; // 0xe0
	bool VSync Enabled; // 0xe4
	bool My Custom Checkbox; // 0xe5
	int32_t My Custom RadioBox; // 0xe8
	float My Custom Slider; // 0xec
	float Bloom Intensity; // 0xf0
	float Gamma Intensity; // 0xf4
	float Gain Intensity; // 0xf8
	UBP_GameSettings_C* Previous Setting State; // 0x100
	FString My Custom Combobox; // 0x108
	float Current Frame Time; // 0x118
	TArray<UBP_KeyAction_C*> Key Actions; // 0x120
	TArray<UBP_KeyInput_C*> Input Float Axis List; // 0x130
	TArray<FSKeyActionSave> Saved Key Inputs; // 0x140
	float Volume UI; // 0x150
	float Volume World Voice; // 0x154
	float Volume Team Voice; // 0x158
	float Volume Mic; // 0x15c
	EWindowMode Old ScreenMode State; // 0x160
	bool ChatWindowed; // 0x161
	float ChatOpacity; // 0x164
	bool HUDGuide; // 0x168
	float Look ADS Vertical Sensitivity; // 0x16c
	float Look Vertical Sensitivity Multiplier; // 0x170
	float Look ADS Horizontal Sensitivity; // 0x174
	FMulticastInlineDelegate OnKeyBindChanged; // 0x178
	E_FSRQualityMode FSR Quality Mode; // 0x188
	bool HUDCoordinate; // 0x189
	FMulticastInlineDelegate OnSettingsChanged; // 0x190
	bool PendingTutorial; // 0x1a0
	FMulticastInlineDelegate OnTutorialEnableStateChanged; // 0x1a8
	E_VoiceInputMode VoiceInputMode; // 0x1b8
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xe8
	FFrameNumber StartFrameOffset; // 0xf0
	float StartOffset; // 0xf4
	float AudioStartTime; // 0xf8
	float AudioDilationFactor; // 0xfc
	float AudioVolume; // 0x100
	FMovieSceneFloatChannel SoundVolume; // 0x108
	FMovieSceneFloatChannel PitchMultiplier; // 0x1a8
	FMovieSceneActorReferenceData AttachActorData; // 0x248
	bool bLooping; // 0x2f8
	bool bSuppressSubtitles; // 0x2f9
	bool bOverrideAttenuation; // 0x2fa
	USoundAttenuation* AttenuationSettings; // 0x300
	FDelegate OnQueueSubtitles; // 0x308
	FMulticastInlineDelegate OnAudioFinished; // 0x318
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x328
};

struct UWBP_Slot_Functionality_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Activated; // 0x268
	UBorder* Border; // 0x270
	UImage* Image_Default; // 0x278
	UImage* Image_Disabled; // 0x280
	UImage* Image_HoverTint; // 0x288
	UImage* Image_Item; // 0x290
	UProgressBar* ProgressBar_Condition; // 0x298
	E_EquipmentCategorys Equipment Type; // 0x2a0
	FS_EquipmentSlot Equipment Item; // 0x2a8
	UTexture2D* Empty Slot Image; // 0x2e8
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2f0
	float ConditionPercent; // 0x2f8
	bool IsOtherPlayerSlot; // 0x2fc
	UBP_PlayerInventoryComponent_C* OtherPlayerInventory Component; // 0x300
	FItemGeneralInfo generalinfo; // 0x310
	int32_t WeaponIndex; // 0x460
};

struct UChaosGameplayEventDispatcher : UChaosEventListenerComponent {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct UUniformGridSlot : UPanelSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int32_t Row; // 0x3c
	int32_t Column; // 0x40
};

struct USynthComponentToneGenerator : USynthComponent {
	float Frequency; // 0x6c0
	float Volume; // 0x6c4
};

struct USK_Electronic_Fence_Door_02_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2f8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x398
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x3e8
	bool IsOpen; // 0x438
};

struct ABP_ThrownGrenade_C : ABP_ThrowItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x378
	float DelayTime; // 0x380
	USoundBase* EffectBombSound; // 0x388
	float DestroyTime; // 0x390
	ABP_EffectActor_C* EffectActorRef; // 0x398
	ABP_EffectActor_C* EffectActorClass; // 0x3a0
	UParticleSystem* EffectBombParticle; // 0x3a8
	TArray<UAkSwitchValue*> EffectAKSwitches; // 0x3b0
	float EffectDestroyTime; // 0x3c0
	float EffectDeactiveTime; // 0x3c4
};

struct USpotEventTypeData_Base_C : USpotEventTypeData {
	float ActivationDelay; // 0x30
	FSlateBrush SpotIcon; // 0x38
	bool ShowRange; // 0xc0
};

struct ACommonAI_BaseAICharacter_C : ASurvivalAICharacterBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x940
	UCapsuleComponent* SimpleHitComponent; // 0x948
	UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x950
	UBillboardComponent* Billboard; // 0x958
	UBP_HitCapsule_Compoent_C* BP_HitCapsule_Compoent; // 0x960
	UCapsuleComponent* MeleeAttackCollision; // 0x968
	UBP_StorageInventoryComponent_C* BP_StorageInventoryComponent; // 0x970
	UBP_HitNotifyComponent_C* BP_HitNotifyComponent; // 0x978
	float _____1_Opacity_9190C77946D7CC74125AA3A3325D4D5F; // 0x980
	ETimelineDirection _____1__Direction_9190C77946D7CC74125AA3A3325D4D5F; // 0x984
	UTimelineComponent*   _2; // 0x988
	float _____0_Opacity_54AB039447F5F247E8F46C8DA204F220; // 0x990
	float _____0_DisappearZ_54AB039447F5F247E8F46C8DA204F220; // 0x994
	ETimelineDirection _____0__Direction_54AB039447F5F247E8F46C8DA204F220; // 0x998
	UTimelineComponent*   _1; // 0x9a0
	int32_t Resources; // 0x9a8
	TMap<AActor*, USoundBase*> HarvestSound; // 0x9b0
	TMap<E_AbnormalStateType, float> GivenAbnormalCondition; // 0xa00
	FVector MeshOriginalRelativeLoc; // 0xa50
	bool UseRagdoll; // 0xa5c
	float DestroyTime; // 0xa60
	FMulticastInlineDelegate OnDead; // 0xa68
	FDataTableRowHandle DropItemTable; // 0xa78
	int32_t InitUID; // 0xa88
	FResourceInfo ResourceData; // 0xa90
	bool IsImmediatleyHarvesting; // 0xb08
	UAssetUserDataBlueprintable* AssetUserDataInSpawnActor; // 0xb10
	TMap<FName, float> PartDamage; // 0xb18
	UAkAudioEvent* DeadSoundEvent; // 0xb68
	TSet<UObject*> BoneUpdateRequestors; // 0xb70
	TSet<UObject*> MeleeAttackTargets; // 0xbc0
	float FallingStartTime; // 0xc10
	bool AutoPlayDamageAnim; // 0xc14
	TMap<float, FName> DetachableBones; // 0xc18
	float LastStunTime; // 0xc68
	float StunCoolTime; // 0xc6c
	float StunDuration; // 0xc70
	EVisibilityBasedAnimTickOption ServerDefaultAnimTickOption; // 0xc74
	bool prevWasRecentrlyRendered; // 0xc75
	bool IsStunned; // 0xc76
	bool IsPlayingAttackAnimation; // 0xc77
	float TurnSpeedSmooth; // 0xc78
	FRotator PreviousRotation; // 0xc7c
	float OriginalMaxSpeed; // 0xc88
	float OriginalAcceleration; // 0xc8c
	UObject* PlayerExistenceCheckerVolume; // 0xc90
	TMap<int32_t, UCapsuleComponent*> MeleeAttackCollisions; // 0xc98
	TSet<UObject*> TurnLockers; // 0xce8
	UAkSwitchValue* NPCTypeSwitch; // 0xd38
	bool ExistAnyPlayersNearby; // 0xd40
	bool OpenInventory; // 0xd41
	float InteractionDistance; // 0xd44
	char NPCHitCount; // 0xd48
	bool IsSpawnAnimation; // 0xd49
	bool InitBy; // 0xd4a
	TArray<UTexture2D*> AlertIcons; // 0xd50
	bool IsInventoryEmpty; // 0xd60
	float CurrentMonsterSpeedRatio; // 0xd64
	TMap<FName, USceneComponent*> RangeAttackSocket; // 0xd68
	TArray<int32_t> AttackWeights; // 0xdb8
	int32_t TotalAttackWeight; // 0xdc8
	int32_t TotalMeleeAttackWeight; // 0xdcc
	int32_t TotalRangeAttackWeight; // 0xdd0
	TArray<int32_t> TutorialIndicatorVisibleStep; // 0xdd8
	UBP_WidgetIndicatorComponent_C* TutorialIndicator; // 0xde8
	bool bHealthEffectCheck; // 0xdf0
	bool IsDefender; // 0xdf1
	TArray<int32_t> MeleeAttackIndex_Defender; // 0xdf8
	TArray<int32_t> RangeAttackIndex_Defender; // 0xe08
	float HitRotationYaw; // 0xe18
	bool IsBeginDisappear; // 0xe1c
	bool IsDamagedRight; // 0xe1d
	bool IsNoSpawner; // 0xe1e
	float RepTimeAfterDead; // 0xe20
};

struct USynthComponent : USceneComponent {
	char bAutoDestroy : 1; // 0x1f8
	char bStopWhenOwnerDestroyed : 1; // 0x1f8
	char bAllowSpatialization : 1; // 0x1f8
	char bOverrideAttenuation : 1; // 0x1f8
	char bOutputToBusOnly : 1; // 0x1fc
	USoundAttenuation* AttenuationSettings; // 0x200
	FSoundAttenuationSettings AttenuationOverrides; // 0x208
	USoundConcurrency* ConcurrencySettings; // 0x5a8
	TSet<USoundConcurrency*> ConcurrencySet; // 0x5b0
	USoundClass* SoundClass; // 0x600
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x608
	USoundSubmixBase* SoundSubmix; // 0x610
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x618
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x628
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x638
	char bIsUISound : 1; // 0x648
	char bIsPreviewSound : 1; // 0x648
	int32_t EnvelopeFollowerAttackTime; // 0x64c
	int32_t EnvelopeFollowerReleaseTime; // 0x650
	FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x658
	USynthSound* Synth; // 0x688
	UAudioComponent* AudioComponent; // 0x690
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct UTextureRenderTarget2D : UTextureRenderTarget {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	FLinearColor ClearColor; // 0xe8
	TextureAddress AddressX; // 0xf8
	TextureAddress AddressY; // 0xf9
	char bForceLinearGamma : 1; // 0xfa
	char bHDR : 1; // 0xfa
	char bGPUSharedFlag : 1; // 0xfa
	ETextureRenderTargetFormat RenderTargetFormat; // 0xfb
	char bAutoGenerateMips : 1; // 0xfc
	TextureFilter MipsSamplerFilter; // 0xfd
	TextureAddress MipsAddressU; // 0xfe
	TextureAddress MipsAddressV; // 0xff
	EPixelFormat OverrideFormat; // 0x100
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x220
	float CraneYaw; // 0x224
	float CraneArmLength; // 0x228
	bool bLockMountPitch; // 0x22c
	bool bLockMountYaw; // 0x22d
	USceneComponent* TransformComponent; // 0x230
	USceneComponent* CraneYawControl; // 0x238
	USceneComponent* CranePitchControl; // 0x240
	USceneComponent* CraneCameraMount; // 0x248
};

struct UWBP_RingFrame_C : UUserWidget {
	UWidgetAnimation* Anim_Open; // 0x260
	UNamedSlot* CustomPanel; // 0x268
	UHorizontalBox* HorizontalBox_Resource; // 0x270
	UImage* Image_Background; // 0x278
	UImage* Image_Icon; // 0x280
	URetainerBox* RetainerBox_198; // 0x288
	UOverlay* SegmentPanel; // 0x290
	UTextBlock* Text_Description; // 0x298
	UTextBlock* Text_Name; // 0x2a0
};

struct UGameViewportClient : UScriptViewportClient {
	UConsole* ViewportConsole; // 0x40
	TArray<FDebugDisplayProperty> DebugProperties; // 0x48
	int32_t MaxSplitscreenPlayers; // 0x68
	UWorld* World; // 0x78
	UGameInstance* GameInstance; // 0x80
};

struct AAIController_Robot_C : ACommonAI_BaseAIController_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x498
	AActor* EnumyActor; // 0x4a0
	AActor* FriendlyActor; // 0x4a8
	AActor* CurrentActor; // 0x4b0
	AActor* PlayerActor; // 0x4b8
	AActor* DamageCauser; // 0x4c0
	bool IsDamaged; // 0x4c8
	float DamagedTime; // 0x4cc
};

struct UWBP_HUD_Team_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* VerticalBox_Team; // 0x268
	UWBP_HUD_TeamListing_C* WBP_HUD_TeamListing; // 0x270
	UBP_PlayerInventoryComponent_C* PlayerInventoryComponent; // 0x278
	TMap<FString, UWBP_HUD_TeamListing_C*> CachedTeamMemberWidget; // 0x280
};

struct USequenceCameraShakeSequencePlayer : UObject {
	UObject* BoundObjectOverride; // 0x480
	UMovieSceneSequence* Sequence; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x490
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x30
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x40
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x50
	FSolverIterations SolverIterations; // 0x60
	char bNotForDedicatedServer : 1; // 0x7c
	UThumbnailInfo* ThumbnailInfo; // 0x120
	TArray<UBodySetup*> BodySetup; // 0x128
};

struct UNiagaraDataInterfaceArrayColor : UNiagaraDataInterfaceArray {
	TArray<FLinearColor> ColorData; // 0x50
};

struct UMenuItems : UObject {
	TArray<FMenuItem> items; // 0x28
	FMulticastInlineDelegate OnMenuOpen; // 0x40
	FMulticastInlineDelegate OnMenuClose; // 0x50
};

struct UParticleEventReceiverAkPostEvent : UParticleModuleEventReceiverBase {
	UAkAudioEvent* AkEvent; // 0x40
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UTextureRenderTarget2DArray : UTextureRenderTarget {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t Slices; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct USQSTagQueue : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x108
	float MaxDistance; // 0x10c
	float TotalSamples; // 0x110
	float Priority; // 0x114
	USoundAttenuation* AttenuationSettings; // 0x118
	FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x120
	USoundSubmixBase* SoundSubmixObject; // 0x168
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x170
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x180
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x188
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x198
	TArray<UAssetUserData*> AssetUserData; // 0x1a8
};

struct UBodySetup : UBodySetupCore {
	FKAggregateGeom AggGeom; // 0x48
	char bAlwaysFullAnimWeight : 1; // 0xa8
	char bConsiderForBounds : 1; // 0xa8
	char bMeshCollideAll : 1; // 0xa8
	char bDoubleSidedGeometry : 1; // 0xa8
	char bGenerateNonMirroredCollision : 1; // 0xa8
	char bSharedCookedData : 1; // 0xa8
	char bGenerateMirroredCollision : 1; // 0xa8
	char bSupportUVsAndFaceRemap : 1; // 0xa8
	UPhysicalMaterial* PhysMaterial; // 0xb0
	FWalkableSlopeOverride WalkableSlopeOverride; // 0xb8
	FBodyInstance DefaultInstance; // 0x130
	FVector BuildScale3D; // 0x290
};

struct UWaterStorageComponentBase : UActorComponent {
	float MaxStorage; // 0xb0
	float WaterPushAmountPerSec; // 0xb4
	float WaterPullAmountPerSec; // 0xb8
	int32_t InPipeCount; // 0xbc
	int32_t OutPipeCount; // 0xc0
	float Current; // 0xc4
	float PollutedRatio; // 0xc8
	bool bIsWorkingWaterTransform; // 0xcc
	TMap<UWaterStorageComponentBase*, bool> ConnectState; // 0xd0
	TArray<UWaterStorageComponentBase*> InPipeArray; // 0x120
	TArray<UWaterStorageComponentBase*> OutPipeArray; // 0x130
	TMap<UWaterStorageComponentBase*, float> PullingAmountAvgPerSec; // 0x140
};

struct UPhysicsConstraintComponent : USceneComponent {
	AActor* ConstraintActor1; // 0x1f8
	FConstrainComponentPropName ComponentName1; // 0x200
	AActor* ConstraintActor2; // 0x208
	FConstrainComponentPropName ComponentName2; // 0x210
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x228
	FMulticastInlineDelegate OnConstraintBroken; // 0x230
	FConstraintInstance ConstraintInstance; // 0x240
};

struct UAIPerceptionComponent : UActorComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xb0
	UAISense* DominantSense; // 0xc0
	AAIController* AIOwner; // 0xd8
	FMulticastInlineDelegate OnPerceptionUpdated; // 0x160
	FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170
	FMulticastInlineDelegate OnTargetPerceptionInfoUpdated; // 0x180
};

struct UWBP_RadiogramBase_C : UUserWidget {
	UNamedSlot* Canvas; // 0x260
};

struct UBPANS_JuggernautMeleeAttack_C : USVAnimNotifyState {
	UAkAudioEvent* HitAkEvent; // 0x30
	UAkSwitchValue* HitAkSwitch; // 0x38
	int32_t SpecialAttackIndex; // 0x40
	float MultiplyLaunchVelocity; // 0x44
	float MultiplyAirborne; // 0x48
	float InnerRadius; // 0x4c
	float OutterRadius; // 0x50
	float IgnoreZone; // 0x54
	float NPCHeight; // 0x58
};

struct AInfinityFireProjectileBase : AActor {
	TArray<FWeaponHitSetting> HitSetting; // 0x220
	AWeapon* OwnerWeapon; // 0x230
	bool bDontShowHitEffectOnPlayer; // 0x238
	bool bWaitParticlesOnDestroy; // 0x239
	bool bTakeDownable; // 0x23a
	float Health; // 0x23c
	int32_t TakeDownScore; // 0x240
	bool bDestroyPending; // 0x244
	EBulletType BulletType; // 0x245
};

struct UFindSessionsCallbackProxyAdvanced : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UGizmoUniformScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	FVector2D Parameter; // 0x6c
	FGizmoVec2ParameterChange LastChange; // 0x74
	FVector CurScaleOrigin; // 0x84
	FVector CurScaleNormal; // 0x90
	FVector CurScaleAxisX; // 0x9c
	FVector CurScaleAxisY; // 0xa8
	FTransform InitialTransform; // 0xc0
};

struct UObjectLibrary : UObject {
	UObject* ObjectBaseClass; // 0x28
	bool bHasBlueprintClasses; // 0x30
	TArray<UObject*> Objects; // 0x38
	TArray<TWeakObjectPtr<UObject>> WeakObjects; // 0x48
	bool bUseWeakReferences; // 0x58
	bool bIsFullyLoaded; // 0x59
};

struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	FBlackboardKeySelector ActorToCheck; // 0x68
	EGameplayContainerMatchType TagsToMatch; // 0x90
	FGameplayTagContainer GameplayTags; // 0x98
	FString CachedDescription; // 0xb8
};

struct UMaterialExpressionPanner : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	FExpressionInput Speed; // 0x68
	float SpeedX; // 0x7c
	float SpeedY; // 0x80
	uint32_t ConstCoordinate; // 0x84
	bool bFractionalPart; // 0x88
};

struct UWBP_Function_Equipment_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_Button_Function_C* Button_Radiogram; // 0x268
	UWBP_Button_Function_C* Button_Unequip; // 0x270
	UVerticalBox* OptionBox; // 0x278
	FS_EquipmentSlot Equipment Item; // 0x280
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2c0
	UWBP_InGameUI_C* InGameUI; // 0x2c8
	UWBP_Slot_Inventory_C* Slot Reference; // 0x2d0
};

struct USQSListDeadLetterSourceQueues : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UWBP_ObjectiveListing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Attention; // 0x268
	UImage* Image_38; // 0x270
	UImage* Image_106; // 0x278
	UImage* Image_Icon; // 0x280
	UWidgetSwitcher* Switch; // 0x288
	UTextBlock* Text_Distance; // 0x290
	UWBP_ObjectiveCheckbox_C* WBP_HUD_ObjectDoSomething; // 0x298
	UWBP_ObjectiveProgress_C* WBP_HUD_ObjectProgress; // 0x2a0
	UWBP_ObjectiveTime_C* WBP_HUD_ObjectTimer; // 0x2a8
	FVector TargetLocation; // 0x2b0
	float TargetTime; // 0x2bc
	bool DistanceEnabled; // 0x2c0
	int32_t PrevDistance; // 0x2c4
	ECheckBoxState Current Check State; // 0x2c8
};

struct UNiagaraDataInterfaceExport : UNiagaraDataInterface {
	FNiagaraUserParameterBinding CallbackHandlerParameter; // 0x38
	ENDIExport_GPUAllocationMode GPUAllocationMode; // 0x58
	int32_t GPUAllocationFixedSize; // 0x5c
	float GPUAllocationPerParticleSize; // 0x60
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UAISense_Blueprint : UAISense {
	UUserDefinedStruct* ListenerDataType; // 0x80
	TArray<UAIPerceptionComponent*> ListenerContainer; // 0x88
	TArray<UAISenseEvent*> UnprocessedEvents; // 0x98
};

struct AInfinityFireProjectile_Bullet : AInfinityFireProjectileBase {
	UParticleSystemComponent* TrailParticleComp; // 0x248
	float TravelDistance; // 0x250
	USoundBase* WhipSound; // 0x258
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct USurvivalAIStateMachine : UObject {
	ASurvivalAICharacterBase* SVAICharacter; // 0x28
	ASurvivalAIController* SVAIController; // 0x30
	USurvivalAIStateMachine* CurrentState; // 0x38
	FVector SpawnLocation; // 0x40
	FVector GoalLocation; // 0x4c
	FVector ViaLocation; // 0x58
	FVector NewMoveLocation; // 0x64
	FVector OldMoveLocation; // 0x70
	bool IsMoveTo; // 0x7c
	bool IsMoveToVia; // 0x7d
	TArray<AActor*> ActorsToIgnore_LandmarkBase; // 0x80
	TArray<AActor*> ActorsToIgnore_SpotEvent; // 0x90
	float Timer_StopAMove; // 0xa0
};

struct UCloudWatchLogsFilterLogEvents : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UCallbackProxyCreateWorkshopItem : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
	FMulticastInlineDelegate OnSteamInitFailure; // 0x50
};

struct ABP_FunctionHoldable_C : AFunctionalHoldableBase {
	UStaticMeshComponent* StaticMesh; // 0x508
};

struct UPreviewMeshCollection : UDataAsset {
	USkeleton* Skeleton; // 0x38
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x40
};

struct UAutoResizedWidgetComponent_C : UWidgetComponentEx {
	FPointerToUberGraphFrame UberGraphFrame; // 0x5a0
	bool bAutoResizeToFullScreen; // 0x5a8
	float WidgetScale; // 0x5ac
};

struct UBP_ScreenIndicator_C : UWidgetComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x590
	UTexture2D* Icon; // 0x598
	FSlateColor Slate Color; // 0x5a0
	int32_t TempDistance; // 0x5c8
	UWBP_Objective_Indicator_C* WBP_Indicator; // 0x5d0
	FString String; // 0x5d8
	bool bPlayer; // 0x5e8
};

struct ABP_RespawnBuildPartBase_C : ABP_StaticMeshBuildPartBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x860
	UCapsuleComponent* Respawn Location; // 0x868
	float LastUseTime; // 0x870
	float CoolTime; // 0x874
	float CoolTimeShareDistance; // 0x878
};

struct UNPCAnimInstance : UAnimInstance {
	bool NowInDediSvr; // 0x2b8
	bool StopAllForOptimization; // 0x2b9
	float SpeedX; // 0x2bc
	float SpeedY; // 0x2c0
	float IdleWalkX; // 0x2c4
	float IdleWalkY; // 0x2c8
	float TurnSpeed; // 0x2cc
	float SpineRotationYaw; // 0x2d0
	float SpineRotationPitch; // 0x2d4
	FVector TargetActorLocation; // 0x2d8
	FVector TargetLocation; // 0x2e4
	bool FocusTargetActor; // 0x2f0
	bool ClientHit; // 0x2f1
	bool CriticalHit; // 0x2f2
	float DamagedWeight; // 0x2f4
	bool Damaged; // 0x2f8
	bool DamagedHead; // 0x2f9
	bool DamagedFront; // 0x2fa
	bool DamagedRight; // 0x2fb
	bool Dead; // 0x2fc
	int32_t Stress; // 0x300
};

struct ULevelActorContainer : UObject {
	TArray<AActor*> Actors; // 0x28
};

struct UBP_KeyAction_C : UObject {
	FString Action Name; // 0x28
	bool IsMultipleKeys; // 0x38
	FString Category; // 0x40
	TArray<UBP_KeyMapping_C*> Key Mappings; // 0x50
};

struct UBP_SkillActionTaskBase_C : UObject {
	FString TaskName; // 0x28
	FMulticastInlineDelegate TaskTriger; // 0x38
	FS_ConditionParam Param; // 0x48
	ABP_SkillBase_C* Skill; // 0xb8
	bool TaskFinished; // 0xc0
};

struct ULevelStreamingDynamic : ULevelStreaming {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct UMovieSceneBoolSection : UMovieSceneSection {
	bool DefaultValue; // 0xe8
	FMovieSceneBoolChannel BoolCurve; // 0xf0
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UVOIPTalker : UActorComponent {
	FVoiceSettings Settings; // 0xb0
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UEdGraph : UObject {
	UEdGraphSchema* Schema; // 0x28
	TArray<UEdGraphNode*> Nodes; // 0x30
	char bEditable : 1; // 0x40
	char bAllowDeletion : 1; // 0x40
	char bAllowRenaming : 1; // 0x40
};

struct UGizmoComponentHitTarget : UObject {
	UPrimitiveComponent* Component; // 0x30
};

struct UNetReplicationGraphConnection : UReplicationConnectionDriver {
	UNetConnection* NetConnection; // 0x28
	AReplicationGraphDebugActor* DebugActor; // 0x170
	TArray<FLastLocationGatherInfo> LastGatherLocations; // 0x188
	TArray<UReplicationGraphNode*> ConnectionGraphNodes; // 0x1a0
	UReplicationGraphNode_TearOff_ForConnection* TearOffNode; // 0x1b0
};

struct UC_Manager-LocalMap_C : UQuestMapComponent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AWorldLocation_C* ActiveLocation; // 0xb8
	UWBP_HUD_Compass_C* CompassWidget; // 0xc0
	ULocalMap_C* LocalMapWidget; // 0xc8
	UMaterialInstanceDynamic* LocalMap; // 0xd0
	UWBP_MapMarker_Player_C* PlayerMarker; // 0xd8
	UMaterialInstanceDynamic* PlayerMarkerMaterial; // 0xe0
	bool Initialized?; // 0xe8
	bool IsOpen; // 0xe9
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UWBP_HoldableGuideUIBase_C : UUserWidget {
	AHoldableBase* TargetHoldable; // 0x260
};

struct UBPANS_PlayAKSound_C : UAnimNotifyState {
	FName SocketName; // 0x30
	bool Attach; // 0x38
	UAkAudioEvent* AkEvent; // 0x40
	TArray<UAkSwitchValue*> Switches; // 0x48
	TMap<UAkRtpc*, float> RTPCs; // 0x58
	TMap<USkeletalMeshComponent*, UAkComponent*> OwnerComponents; // 0xa8
	UAkAudioEvent* AKStopEvent; // 0xf8
};

struct ABP_WaterPurifier_C : ABP_MaintainConvertBuildParts_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x8d0
};

struct UWBP_ObjectiveFrame_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Open; // 0x268
	UImage* Image_47; // 0x270
	UImage* Image_Icon; // 0x278
	UNamedSlot* NamedSlot_Desc; // 0x280
	UNamedSlot* NamedSlot_Objectives; // 0x288
	UTextBlock* Text_Name; // 0x290
	UVerticalBox* VerticalBox_1; // 0x298
	FVector2D Image Size; // 0x2a0
	UObject* Image; // 0x2a8
	UObject* Image_1; // 0x2b0
	UObject* Image_2; // 0x2b8
};

struct ABP_CraftingFunctionalityBase_C : ABP_FunctionalityBuildPartBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x890
	UBP_StorageInventoryComponent_C* BP_StorageInventoryComponent; // 0x898
	UBP_CraftingComponent_C* BP_CraftingComponent; // 0x8a0
	bool IsWorking; // 0x8a8
	int32_t CurrentCraftingItem; // 0x8ac
	float EnergyCostPerMin; // 0x8b0
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	ENavDataGatheringModeConfig DataGatheringMode; // 0x70
	float DirtyAreaWarningSizeThreshold; // 0x74
	TArray<FNavDataConfig> SupportedAgents; // 0x78
	FNavAgentSelector SupportedAgentsMask; // 0x88
	TArray<ANavigationData*> NavDataSet; // 0x90
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa0
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc0
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd0
	FNavigationSystemRunMode OperationMode; // 0x1c8
	float DirtyAreasUpdateFreq; // 0x15cc
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UWBP_Toolbar_Close_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_Close; // 0x268
	FMulticastInlineDelegate OnClicked; // 0x270
};

struct UWBP_Radiogram_6010106_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x2a8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_49; // 0x2b0
};

struct UBTTask_ReloadRangeWeapon_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
};

struct ABP_ReleaseStealth_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UAkComponent* Ak; // 0x228
	UParticleSystemComponent* ParticleSystem; // 0x230
	USceneComponent* DefaultSceneRoot; // 0x238
};

struct UAkSettings : UObject {
	char MaxSimultaneousReverbVolumes; // 0x28
	FFilePath WwiseProjectPath; // 0x30
	FDirectoryPath WwiseSoundDataFolder; // 0x40
	bool bAutoConnectToWAAPI; // 0x50
	ECollisionChannel DefaultOcclusionCollisionChannel; // 0x51
	ECollisionChannel DefaultFitToGeometryCollisionChannel; // 0x52
	TMap<TSoftObjectPtr<UPhysicalMaterial>, FAkGeometrySurfacePropertiesToMap> AkGeometryMap; // 0x58
	float GlobalDecayAbsorption; // 0xa8
	TSoftObjectPtr<UAkAuxBus> DefaultReverbAuxBus; // 0xb0
	TMap<float, TSoftObjectPtr<UAkAuxBus>> EnvironmentDecayAuxBusMap; // 0xd8
	FString HFDampingName; // 0x128
	FString DecayEstimateName; // 0x138
	FString TimeToFirstReflectionName; // 0x148
	TSoftObjectPtr<UAkRtpc> HFDampingRTPC; // 0x158
	TSoftObjectPtr<UAkRtpc> DecayEstimateRTPC; // 0x180
	TSoftObjectPtr<UAkRtpc> TimeToFirstReflectionRTPC; // 0x1a8
	TMap<FGuid, FAkAcousticTextureParams> AcousticTextureParamsMap; // 0x1d0
	bool SplitSwitchContainerMedia; // 0x220
	bool SplitMediaPerFolder; // 0x221
	bool UseEventBasedPackaging; // 0x222
	bool EnableAutomaticAssetSynchronization; // 0x223
	FString CommandletCommitMessage; // 0x228
	TMap<FString, FString> UnrealCultureToWwiseCulture; // 0x238
	bool AskedToUseNewAssetManagement; // 0x288
	bool bEnableMultiCoreRendering; // 0x289
	bool MigratedEnableMultiCoreRendering; // 0x28a
	bool FixupRedirectorsDuringMigration; // 0x28b
	FDirectoryPath WwiseWindowsInstallationPath; // 0x290
	FFilePath WwiseMacInstallationPath; // 0x2a0
};

struct UMaterialExpressionMaterialFunctionCall : UMaterialExpression {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UMaterialExpressionLandscapePhysicalMaterialOutput : UMaterialExpressionCustomOutput {
	TArray<FPhysicalMaterialInput> Inputs; // 0x40
};

struct UWBP_Functionality_TransferTerrasite_C : UWBP_FunctionalityBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UWBP_PopUp_Button_C* Convert; // 0x278
	UImage* Image; // 0x280
	UImage* Image_2; // 0x288
	UImage* Image_75; // 0x290
	UImage* Image_86; // 0x298
	UTextBlock* TerraPointChargeText; // 0x2a0
	UTextBlock* TerraPointText; // 0x2a8
	UWBP_Slot_Inventory_C* TerraSite_2; // 0x2b0
	UWBP_Slot_Inventory_C* TerraSite_3; // 0x2b8
	UWBP_Slot_Inventory_C* TerraSite_4; // 0x2c0
	UUniformGridPanel* UniformGridPanel_97; // 0x2c8
	UWBP_Functionality_TransferTerrasiteMenu_C* WBP_Functionality_TransferTerrasiteMenu; // 0x2d0
	UWBP_FunctionalityInfo_C* WBP_FunctionalityInfo; // 0x2d8
	UWBP_Toolbar_Dropdown_C* WBP_Toolbar_Dropdown; // 0x2e0
	TArray<UWBP_Slot_Inventory_C*> TransInventorySlots; // 0x2e8
	ABP_TerrasiteTransfter_C* TransferTerrasite; // 0x2f8
	int32_t TerraPointCharge; // 0x300
	int32_t TerraPoint; // 0x304
	TArray<FDataTableRowHandle> ItemToTerraPointList; // 0x308
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct UAkGroupValue : UAkAudioType {
	TArray<TSoftObjectPtr<UAkMediaAsset>> MediaDependencies; // 0x40
	uint32_t GroupShortID; // 0x50
};

struct UCloudWatchLogsGetLogRecord : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ABP_FunctionalityBuildPartBase_C : ABP_StaticMeshBuildPartBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x860
	UWBP_FunctionalityBase_C* FunctionalityInteractionlWidgetClass; // 0x868
	bool IsSwitchedOn; // 0x870
	FMulticastInlineDelegate OnChangedSwitchState; // 0x878
	float ReserveSwitchOnTime; // 0x888
	bool IsControlableByRMC; // 0x88c
};

struct UUserWidget : UWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMulticastInlineDelegate OnVisibilityChanged; // 0x168
	FMargin Padding; // 0x190
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a0
	UUMGSequenceTickManager* AnimationTickManager; // 0x1b0
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct UWBP_HUD_Stats_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image; // 0x268
	UImage* Image_98; // 0x270
	UImage* Image_Energy; // 0x278
	UImage* Image_Health; // 0x280
	UImage* Image_Hunger; // 0x288
	UImage* Image_Stamina; // 0x290
	UImage* Image_Thirst; // 0x298
	UTextBlock* Text_Energy; // 0x2a0
	UTextBlock* Text_Health; // 0x2a8
	UTextBlock* Text_Hunger; // 0x2b0
	UTextBlock* Text_Stamina; // 0x2b8
	UTextBlock* Text_Thirst; // 0x2c0
	UBP_PlayerInventoryComponent_C* Player Inventory Component; // 0x2c8
	UMaterialInstanceDynamic* MI_Health; // 0x2d0
	UMaterialInstanceDynamic* MI_Stamina; // 0x2d8
	UMaterialInstanceDynamic* MI_Energy; // 0x2e0
	UMaterialInstanceDynamic* MI_Hunger; // 0x2e8
	UMaterialInstanceDynamic* MI_Thirst; // 0x2f0
	int32_t CurrentHealth; // 0x2f8
	float MaxHealth; // 0x2fc
	int32_t CurrentEnergy; // 0x300
	float MaxEnergy; // 0x304
	int32_t CurrentStamina; // 0x308
	float MaxStamina; // 0x30c
	int32_t CurrentHunger; // 0x310
	int32_t CurrentThirsty; // 0x314
};

struct USkeletalMeshLODSettings : UDataAsset {
	FPerPlatformInt MinLOD; // 0x30
	FPerPlatformBool DisableBelowMinLodStripping; // 0x34
	bool bOverrideLODStreamingSettings; // 0x35
	FPerPlatformBool bSupportLODStreaming; // 0x36
	FPerPlatformInt MaxNumStreamedLODs; // 0x38
	FPerPlatformInt MaxNumOptionalLODs; // 0x3c
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x40
};

struct UWBP_Main_MachineArmListing_M_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_1; // 0x268
	UTextBlock* GradeText; // 0x270
	UImage* Image_39; // 0x278
	UImage* Image_Blink; // 0x280
	UImage* Image_Selected; // 0x288
	UBorder* ListReady; // 0x290
	UTextBlock* TextBlock_47; // 0x298
	UTextBlock* TextBlock_177; // 0x2a0
	UWBP_UI_ListingHovering_C* WBP_UI_ListingHovering; // 0x2a8
	FMachinArmAbilitySub Data; // 0x2b0
	FMulticastInlineDelegate OnClicked; // 0x2f0
	int32_t SubIdx; // 0x300
	int32_t MainIdx; // 0x304
	int32_t CurrentGrade; // 0x308
};

struct UEndpointSubmix : USoundSubmixBase {
	FName EndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	UAudioEndpointSettingsBase* EndpointSettings; // 0x48
};

struct UMovieSceneAkTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	char bIsAMasterTrack : 1; // 0x88
};

struct UBP_FunctionalityHandleComponent_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	FFloatValueFromDataTable ThirstGainRatioByWater; // 0xb8
	float DrinkAmount; // 0xe0
	TArray<FBPItemAmountPair> BPItemAmountPair; // 0xe8
};

struct UBoss_Spider_Move_AnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x2f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x318
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x340
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x368
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x390
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x3e0
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x490
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x540
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5f0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x670
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x6a0
	FAnimNode_Slot AnimGraphNode_Slot; // 0x750
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x798
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x838
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x8d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x978
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x9a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x9c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x9f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xa18
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xa98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xac8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xb48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb78
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xbf8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc28
	FAnimNode_Root AnimGraphNode_Root; // 0xcd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xd08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xda8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xe28
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xf30
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xf50
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1058
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1078
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1118
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1198
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1280
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x13d8
	char CCState; // 0x1400
	UObject* Character; // 0x1408
	bool bMeleeAttack; // 0x1410
	bool Stunned; // 0x1411
	bool Enable Jump; // 0x1412
	float Speed; // 0x1414
	float Direction; // 0x1418
	bool Crouching; // 0x141c
	FRotator SpineRotation; // 0x1420
	FName AttackType; // 0x142c
	FMulticastInlineDelegate OnRocketFired; // 0x1438
	bool bShootRocketLaunch; // 0x1448
	FMulticastInlineDelegate OnAttackAnimFinished; // 0x1450
	float RocketFirePlayRate; // 0x1460
	bool NowInDediSvr; // 0x1464
};

struct UAkSettingsPerUser : UObject {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x28
	FFilePath WwiseMacInstallationPath; // 0x38
	bool EnableAutomaticAssetSynchronization; // 0x48
	FString WaapiIPAddress; // 0x50
	uint32_t WaapiPort; // 0x60
	bool bAutoConnectToWAAPI; // 0x64
	bool AutoSyncSelection; // 0x65
	bool SuppressWwiseProjectPathWarnings; // 0x66
	bool SoundDataGenerationSkipLanguage; // 0x67
};

struct AActor : UObject {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bHidden : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bCanBeDamaged : 1; // 0x59
	char bBlockInput : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x170
	FMulticastSparseDelegate OnTakeAnyDamage; // 0x180
	FMulticastSparseDelegate OnTakePointDamage; // 0x181
	FMulticastSparseDelegate OnTakeRadialDamage; // 0x182
	FMulticastSparseDelegate OnActorBeginOverlap; // 0x183
	FMulticastSparseDelegate OnActorEndOverlap; // 0x184
	FMulticastSparseDelegate OnBeginCursorOver; // 0x185
	FMulticastSparseDelegate OnEndCursorOver; // 0x186
	FMulticastSparseDelegate OnClicked; // 0x187
	FMulticastSparseDelegate OnReleased; // 0x188
	FMulticastSparseDelegate OnInputTouchBegin; // 0x189
	FMulticastSparseDelegate OnInputTouchEnd; // 0x18a
	FMulticastSparseDelegate OnInputTouchEnter; // 0x18b
	FMulticastSparseDelegate OnInputTouchLeave; // 0x18c
	FMulticastSparseDelegate OnActorHit; // 0x18d
	FMulticastSparseDelegate OnDestroyed; // 0x18e
	FMulticastSparseDelegate OnEndPlay; // 0x18f
	TArray<UActorComponent*> InstanceComponents; // 0x1f0
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x200
};

struct UWBP_ChatCategoryButtons_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_Category; // 0x268
	UImage* Image_Anim; // 0x270
	UImage* Image_Icon; // 0x278
	UOverlay* Overlay_Selected; // 0x280
	UWBP_Tooltip_UI_C* WBP_Tooltip_UI; // 0x288
	E_ChatCategory Category; // 0x290
	UWBP_MainChatWindow_C* MainChatRef; // 0x298
	FText Button Name; // 0x2a0
	FSlateBrush Icon; // 0x2b8
};

struct UClothConfigNv : UClothConfigCommon {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	FVector LinearDrag; // 0x90
	FVector AngularDrag; // 0x9c
	FVector LinearInertiaScale; // 0xa8
	FVector AngularInertiaScale; // 0xb4
	FVector CentrifugalInertiaScale; // 0xc0
	float SolverFrequency; // 0xcc
	float StiffnessFrequency; // 0xd0
	float GravityScale; // 0xd4
	FVector GravityOverride; // 0xd8
	bool bUseGravityOverride; // 0xe4
	float TetherStiffness; // 0xe8
	float TetherLimit; // 0xec
	float CollisionThickness; // 0xf0
	float AnimDriveSpringStiffness; // 0xf4
	float AnimDriveDamperStiffness; // 0xf8
	EClothingWindMethod_Legacy WindMethod; // 0xfc
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x100
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x110
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x120
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x130
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct UFacility_Pannel_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2f8
	bool Connect; // 0x340
};

struct UMaterialExpressionCeil : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UNetworkSettings : UDeveloperSettings {
	char bVerifyPeer : 1; // 0x38
	char bEnableMultiplayerWorldOriginRebasing : 1; // 0x38
	int32_t MaxRepArraySize; // 0x3c
	int32_t MaxRepArrayMemory; // 0x40
	TArray<FNetworkEmulationProfileDescription> NetworkEmulationProfiles; // 0x48
};

struct USoundSourceBus : USoundWave {
	ESourceBusChannels SourceBusChannels; // 0x370
	float SourceBusDuration; // 0x374
	UAudioBus* AudioBus; // 0x378
	char bAutoDeactivateWhenSilent : 1; // 0x380
};

struct UMovieSceneComponentMaterialTrack : UMovieSceneMaterialTrack {
	int32_t MaterialIndex; // 0x90
};

struct UWBP_UI_ListingHovering_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Hovered; // 0x268
	bool Mouse Over; // 0x270
	FItemInventory Item; // 0x278
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2b0
	FVector2D Icon Image Size; // 0x2b8
	float Tooltip Delay; // 0x2c0
	bool Selected; // 0x2c4
	bool Allow Selection; // 0x2c5
	UWBP_Tooltip_C* Tooltip Widget; // 0x2c8
	bool Convert Slot; // 0x2d0
	int32_t Slot Number; // 0x2d4
	bool UseInGameUI; // 0x2d8
	FItemGeneralInfo generalinfo; // 0x2e0
	bool bClickSound; // 0x430
};

struct UBreakableTreeCollisionComponent : UShapeComponent {
	UPrimitiveComponent* OriginalPrimitiveComp; // 0x458
};

struct UAISense_Damage : UAISense {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x80
};

struct UWBP_UI_Tooltip_TextOnly_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Text_Tooltip; // 0x268
	UTextBlock* Text_Tooltip_Desc; // 0x270
	FText In Text; // 0x278
	FText In Desc; // 0x290
};

struct UWBP_HUD_Dialogue_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Disappear; // 0x268
	UWidgetAnimation* Appear; // 0x270
	UGridPanel* GridPanel_40; // 0x278
	UImage* Image_Portrait; // 0x280
	UTextBlock* Text_Dialogue; // 0x288
	UTextBlock* Text_Name; // 0x290
	bool bOpened; // 0x298
	float WaitTime; // 0x29c
};

struct UWBP_Radiogram_4010104_C : UUserWidget {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x260
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x268
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x270
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x278
	UWBP_RadiogramListing_C* WBP_RadiogramListing_4; // 0x280
	UWBP_RadiogramListing_C* WBP_RadiogramListing_5; // 0x288
};

struct ABP_StickyBomb_C : ABP_MineBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x8c0
};

struct UWBP_Radiogram_6010110_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x2a8
};

struct UBTService_StressReducer_C : UBTService_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x98
	float ReduceStressInterval; // 0xa0
	FTimerHandle ReduceStressTimerHandler; // 0xa8
	FBlackboardKeySelector KEYTargetActor; // 0xb0
	FBlackboardKeySelector KEYStress; // 0xd8
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
	char bPostUpdateTickGroup : 1; // 0x228
	char bCurrentlyActive : 1; // 0x228
	FMulticastInlineDelegate OnParticleSpawn; // 0x230
	FMulticastInlineDelegate OnParticleBurst; // 0x240
	FMulticastInlineDelegate OnParticleDeath; // 0x250
	FMulticastInlineDelegate OnParticleCollide; // 0x260
};

struct USourceEffectStereoDelayPreset : USoundEffectSourcePreset {
	FSourceEffectStereoDelaySettings Settings; // 0xb4
};

struct UBasicReplicationGraph : UReplicationGraph {
	UReplicationGraphNode_GridSpatialization2D* GridNode; // 0x498
	UReplicationGraphNode_ActorList* AlwaysRelevantNode; // 0x4a0
	TArray<FConnectionAlwaysRelevantNodePair> AlwaysRelevantForConnectionList; // 0x4a8
	TArray<AActor*> ActorsWithoutNetConnection; // 0x4b8
};

struct UButtonStyleAsset : UObject {
	FButtonStyle ButtonStyle; // 0x28
};

struct UParticleModuleRotationRate_Seeded : UParticleModuleRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct UABP_SupplyDrop_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x348
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x370
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x420
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4d0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x550
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x580
	bool IsOpen; // 0x630
};

struct ABuildPartBase : AActor {
	TArray<EBuildLayoutType> BuildLayoutList; // 0x220
	bool bIsTickable; // 0x230
	bool bClientIgnoreTickableOptimize; // 0x231
	TArray<FString> Owners_Internal; // 0x238
	bool bNeedOwnersReliable; // 0x248
};

struct ALevelScriptActor : AActor {
	char bInputEnabled : 1; // 0x220
};

struct UEditableTextBox : UWidget {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FEditableTextBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x928
	FText HintText; // 0x930
	FDelegate HintTextDelegate; // 0x948
	FSlateFontInfo Font; // 0x958
	FLinearColor ForegroundColor; // 0x9b0
	FLinearColor BackgroundColor; // 0x9c0
	FLinearColor ReadOnlyForegroundColor; // 0x9d0
	bool IsReadOnly; // 0x9e0
	bool IsPassword; // 0x9e1
	float MinimumDesiredWidth; // 0x9e4
	FMargin Padding; // 0x9e8
	bool IsCaretMovedWhenGainFocus; // 0x9f8
	bool SelectAllTextWhenFocused; // 0x9f9
	bool RevertTextOnEscape; // 0x9fa
	bool ClearKeyboardFocusOnCommit; // 0x9fb
	bool SelectAllTextOnCommit; // 0x9fc
	bool AllowContextMenu; // 0x9fd
	EVirtualKeyboardType KeyboardType; // 0x9fe
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9ff
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa00
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa01
	ETextJustify Justification; // 0xa02
	FShapedTextOptions ShapedTextOptions; // 0xa03
	FMulticastInlineDelegate OnTextChanged; // 0xa08
	FMulticastInlineDelegate OnTextCommitted; // 0xa18
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct UAnimationSettings : UDeveloperSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct UARTrackableNotifyComponent : UActorComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x110
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130
	FMulticastInlineDelegate OnAddTrackedImage; // 0x140
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160
	FMulticastInlineDelegate OnAddTrackedFace; // 0x170
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f0
};

struct UMovieSceneEntitySystem : UObject {
	UMovieSceneEntitySystemLinker* Linker; // 0x28
};

struct UBlackboardKeyType_String : UBlackboardKeyType {
	FString StringValue; // 0x30
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x60
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UAkIOSInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkAudioSession AudioSession; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa0
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xc8
};

struct UUserInterfaceSettings : UDeveloperSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	TMap<EMouseCursor, FHardwareCursorReference> HardwareCursors; // 0x40
	TMap<EMouseCursor, FSoftClassPath> SoftwareCursors; // 0x90
	FSoftClassPath DefaultCursor; // 0xe0
	FSoftClassPath TextEditBeamCursor; // 0xf8
	FSoftClassPath CrosshairsCursor; // 0x110
	FSoftClassPath HandCursor; // 0x128
	FSoftClassPath GrabHandCursor; // 0x140
	FSoftClassPath GrabHandClosedCursor; // 0x158
	FSoftClassPath SlashedCircleCursor; // 0x170
	float ApplicationScale; // 0x188
	EUIScalingRule UIScaleRule; // 0x18c
	FSoftClassPath CustomScalingRuleClass; // 0x190
	FRuntimeFloatCurve UIScaleCurve; // 0x1a8
	bool bAllowHighDPIInGameMode; // 0x230
	FIntPoint DesignScreenSize; // 0x234
	bool bLoadWidgetsOnDedicatedServer; // 0x23c
	TArray<UObject*> CursorClasses; // 0x240
	UObject* CustomScalingRuleClassInstance; // 0x250
	UDPICustomScalingRule* CustomScalingRule; // 0x258
};

struct UMaterialExpressionClearCoatNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct UMovieSceneByteTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UMovieSceneMediaPlayerPropertySection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLoop; // 0xf0
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char CastShadow : 1; // 0x38c
	char bCastDynamicShadow : 1; // 0x38c
	char bCastStaticShadow : 1; // 0x38c
	char bCastFarShadow : 1; // 0x390
	char bCastHiddenShadow : 1; // 0x394
	char bCastShadowAsTwoSided : 1; // 0x398
	char bAffectDistanceFieldLighting : 1; // 0x39c
	FLightingChannels LightingChannels; // 0x39d
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a0
	char bRenderCustomDepth : 1; // 0x3a0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3a4
	int32_t CustomDepthStencilValue; // 0x3a8
	float LDMaxDrawDistance; // 0x3ac
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b0
	int32_t CollisionMipLevel; // 0x3c8
	int32_t SimpleCollisionMipLevel; // 0x3cc
	float CollisionThickness; // 0x3d0
	FBodyInstance BodyInstance; // 0x3d8
	char bGenerateOverlapEvents : 1; // 0x530
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x530
	int32_t ComponentSizeQuads; // 0x534
	int32_t SubsectionSizeQuads; // 0x538
	int32_t NumSubsections; // 0x53c
	char bUsedForNavigation : 1; // 0x540
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x540
	bool bUseDynamicMaterialInstance; // 0x544
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x545
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x546
	bool bHasLayersContent; // 0x547
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x548
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UWBP_Objective_LM3_C : UWBP_ObjectiveBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UTextBlock* Text_Objective; // 0x278
	UWBP_ObjectiveFrame_C* WBP_ObjectiveFrame; // 0x280
	UWBP_ObjectiveListing_C* WBP_ObjectiveListing; // 0x288
	UWBP_ObjectiveListing_C* WBP_ObjectiveListing_Air; // 0x290
	UWBP_ObjectiveListing_C* WBP_ObjectiveListing_Humid; // 0x298
	UWBP_ObjectiveListing_C* WBP_ObjectiveListing_Soil; // 0x2a0
	UWBP_ObjectiveListing_C* WBP_ObjectiveListing_Solar; // 0x2a8
	UWidgetSwitcher* WS_Objectives; // 0x2b0
	bool IsAllOccupyed; // 0x2b8
	bool bElevatorCall; // 0x2b9
};

struct ANavMeshBoundsVolume : AVolume {
	FNavAgentSelector SupportedAgents; // 0x258
};

struct UWBP_RingSegmentBase_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Hovered; // 0x268
	UWidgetAnimation* Anim_Open; // 0x270
	UImage* Background; // 0x278
	UImage* Image_Icon; // 0x280
	UOverlay* Overlay_Column; // 0x288
	int32_t Equal Parts; // 0x290
	int32_t Row; // 0x294
	int32_t Column; // 0x298
	int32_t UID; // 0x29c
	FText Segment Name; // 0x2a0
	FText Segment Description; // 0x2b8
	UTexture2D* Icon; // 0x2d0
	FSlateColor Base Color; // 0x2d8
	E_SegmentType Segment Type; // 0x300
	USoundBase* Hover Sound; // 0x308
	bool bSelected; // 0x310
	bool Enabled; // 0x311
	FS_BuildPartInfo Build Part Info; // 0x318
	float Degree Low; // 0x518
	float Degree High; // 0x51c
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct UAnimNotifyState_TimedNiagaraEffect : UAnimNotifyState {
	UNiagaraSystem* Template; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UCloudWatchLogsAssociateKmsKey : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ARectLight : ALight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct USynthComponentMonoWaveTable : USynthComponent {
	FMulticastInlineDelegate OnTableAltered; // 0x6c0
	FMulticastInlineDelegate OnNumTablesChanged; // 0x6d0
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x6e0
};

struct UChaosClothSharedSimConfig : UClothSharedConfigCommon {
	int32_t IterationCount; // 0x28
	int32_t SubdivisionCount; // 0x2c
	float SelfCollisionThickness; // 0x30
	float CollisionThickness; // 0x34
	bool bUseDampingOverride; // 0x38
	float Damping; // 0x3c
	bool bUseGravityOverride; // 0x40
	float GravityScale; // 0x44
	FVector Gravity; // 0x48
	bool bUseLocalSpaceSimulation; // 0x54
	bool bUseXPBDConstraints; // 0x55
};

struct UWBP_Main_Radiogram_TreeListing_S_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_1; // 0x268
	UCanvasPanel* CanvasPanel_Tree; // 0x270
	UImage* Image_30; // 0x278
	UImage* Image_Icon; // 0x280
	UImage* Image_Locked; // 0x288
	UImage* Image_Tree; // 0x290
	UImage* New; // 0x298
	UTextBlock* Text_Title; // 0x2a0
	UImage* TutorialTint; // 0x2a8
	UWBP_UI_SlotHovering_C* WBP_UI_SlotHovering; // 0x2b0
	FS_RadiogramGuide RadiogramGuide; // 0x2b8
	UObjectiveSystemManagerComponent_C* ObjectiveComponent; // 0x398
	int32_t QuestIdx; // 0x3a0
	int32_t GroupID; // 0x3a4
	UWBP_Main_Radiogram_Description_C* RadiogramDescription; // 0x3a8
	FMulticastInlineDelegate OnSublistClicked; // 0x3b0
	bool bInitialized; // 0x3c0
	UWBP_Main_RadiogramListing_L_C* MainCategory; // 0x3c8
	bool bUnlocked; // 0x3d0
};

struct AAkAmbientSound : AActor {
	UAkAudioEvent* AkAudioEvent; // 0x220
	UAkComponent* AkComponent; // 0x228
	bool StopWhenOwnerIsDestroyed; // 0x230
	bool AutoPost; // 0x231
};

struct UPostEventAtLocationAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
};

struct UWBP_HUD_Guide_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Open; // 0x268
	UWBP_Key_C* A; // 0x270
	UWBP_Key_C* D; // 0x278
	UInvalidationBox* InvalidationBox_1; // 0x280
	UOverlay* Overlay_Move; // 0x288
	UWBP_Key_C* S; // 0x290
	UVerticalBox* verticalBox_Default; // 0x298
	UVerticalBox* VerticalBox_Vehicle; // 0x2a0
	UWBP_Key_C* W; // 0x2a8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Accel; // 0x2b0
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_AutoRun; // 0x2b8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Backward; // 0x2c0
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Brake; // 0x2c8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Crafting; // 0x2d0
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Dismount; // 0x2d8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_FreeView; // 0x2e0
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Headlight; // 0x2e8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Honk; // 0x2f0
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Inventory; // 0x2f8
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Landmark; // 0x300
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_MachineArm; // 0x308
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Mail; // 0x310
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_map; // 0x318
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Marker; // 0x320
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Mode_Build; // 0x328
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Mode_Manage; // 0x330
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Mouse; // 0x338
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Radiogram; // 0x340
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Seat; // 0x348
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Sprint; // 0x350
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Survivor; // 0x358
	UWBP_HUD_GuideListing_C* WBP_HUD_GuideListing_Vision; // 0x360
	UWidgetSwitcher* WidgetSwitcher_Guide; // 0x368
	int32_t LastExecTutorialStep; // 0x370
	TArray<UWBP_HUD_GuideListing_C*> VisibleList; // 0x378
	TArray<UWBP_HUD_GuideListing_C*> HighlightList; // 0x388
	UBP_GameSettings_C* Game Settings; // 0x398
};

struct UWBP_MainFrame_Toolbar_Checkbox_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCheckBox* CheckBox_273; // 0x268
	UImage* Image_202; // 0x270
	UWBP_Tooltip_UI_C* WBP_Tooltip_UI; // 0x278
	FMulticastInlineDelegate OnCheckStateChanged; // 0x280
	UObject* Icon; // 0x290
	bool Tooltip; // 0x298
	FText Name; // 0x2a0
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UAnimBP_TF-Rifle_R_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x340
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct USkeletalBodySetup : UBodySetup {
	bool bSkipScaleFromAnimation; // 0x2a8
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x2b0
};

struct UMaterialExpressionFunctionInput : UMaterialExpression {
	FExpressionInput Preview; // 0x40
	FName InputName; // 0x54
	FString Description; // 0x60
	FGuid ID; // 0x70
	EFunctionInputType InputType; // 0x80
	FVector4 PreviewValue; // 0x90
	char bUsePreviewValueAsDefault : 1; // 0xa0
	int32_t SortPriority; // 0xa4
	char bCompilingFunctionPreview : 1; // 0xa8
};

struct UAnimBP_Jetcharger_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x340
};

struct UGameplayTask_TimeLimitedExecution : UGameplayTask {
	FMulticastInlineDelegate OnFinished; // 0x68
	FMulticastInlineDelegate OnTimeExpired; // 0x78
};

struct UWBP_Main_Inventory_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_MainFrame_C* BP_UI_Frame; // 0x268
	UUniformGridPanel* InventoryGrid; // 0x270
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header; // 0x278
	bool DragEnabled; // 0x280
	bool IsMouseButtonDown; // 0x281
	FVector2D LastMousePosition; // 0x284
	bool IsDrag; // 0x28c
	UCanvasPanelSlot* ParentSlot; // 0x290
	float SafetyZoneY; // 0x298
	float SafetyZoneX; // 0x29c
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2a0
	TArray<UWBP_Slot_Inventory_C*> Inventory Slots; // 0x2a8
	int32_t Colums; // 0x2b8
	UWBP_HUD_C* Parent Widget; // 0x2c0
};

struct UCloudWatchLogsCreateLogGroup : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ABP_InsertBatteryPackBase_C : ABP_ConsumeHoldable_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4b0
	UStaticMeshComponent* StaticMesh; // 0x4b8
	float ChargedAmount; // 0x4c0
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat LifeTime; // 0x30
};

struct AReflectionCapture : AActor {
	UReflectionCaptureComponent* CaptureComponent; // 0x220
};

struct USQSListQueueTags : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UBP_SurvivalGameSave_C : USaveGame {
	TArray<FS_PlayerSave> PlayerCharacterSaves; // 0x28
	TArray<FS_SaveItem> Item Saves; // 0x38
	TArray<FS_SaveStorage> Storage Component Saves; // 0x48
	TArray<FS_ItemSpawnerSave> Item Spawners Items; // 0x58
	TArray<FS_BuildingSave> Build Part Saves; // 0x68
	TArray<FS_DeadPlayerSave> DeadPlayerSaves; // 0x78
	float ServerGameTimeOffset; // 0x88
	TMap<FString, FS_VehicleSpawner> VehicleSpawnerSaveData; // 0x90
	int32_t ResetCount; // 0xe0
	TArray<FS_LandmarkSaveInfo> LandmarkInfos; // 0xe8
	TMap<FString, float> BanList; // 0xf8
	TMap<FString, float> ChatBlockList; // 0x148
	TArray<FS_ServerNotice> ServerNotice; // 0x198
	TMap<FString, FS_RetrieveSystemInfo> RetrieveSystemInfo; // 0x1a8
	TMap<FString, FMailDataArray> UserMailSystem; // 0x1f8
	TMap<FString, FS_MachineArmAbilitySave> MachineArmInfo; // 0x248
	TMap<FString, FS_UserCustomizeInfo> UserCustomizeInfo; // 0x298
	TMap<FString, FUserSessionInfo> UserSessionInfo; // 0x2e8
	TMap<FString, FIntArray> UserCraftNotifyList; // 0x338
	TMap<FString, int32_t> UserCurrentTutorialStepMap; // 0x388
	TMap<FString, FS_TutorialGoalDataArray> UserTutorialProgressData; // 0x3d8
	bool Restart; // 0x428
	TArray<FS_SurvivalRank> SummaryRank; // 0x430
	TArray<FS_SurvivalRank> rank; // 0x440
	TMap<FString, FS_SurvivalRank> RankMap; // 0x450
	TArray<FS_SaveTeamInfo> TeamsInfo; // 0x4a0
	TMap<FString, FUserTerraPointInfo> UserTerraShopInfo; // 0x4b0
	float EndTime; // 0x500
	bool PrepareEnd; // 0x504
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x80
	FAIDataProviderFloatValue ConeDegrees; // 0xb8
	FAIDataProviderFloatValue AngleStep; // 0xf0
	FAIDataProviderFloatValue Range; // 0x128
	UEnvQueryContext* CenterActor; // 0x160
	char bIncludeContextLocation : 1; // 0x168
};

struct UARCandidateImage : UDataAsset {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct USourceEffectFilterPreset : USoundEffectSourcePreset {
	FSourceEffectFilterSettings Settings; // 0xb0
};

struct UCloudWatchLogsTagLogGroup : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UWBP_HoldableKeyGuide_C : UWBP_HoldableGuideUIBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UVerticalBox* GuideList; // 0x270
	TArray<FS_InteractionKeyGuide> PrevKeyGuide; // 0x278
};

struct UBP_SkillSystemComponent_C : USkillSystemComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	TArray<ABP_SkillBase_C*> ProtocolInstance; // 0xf0
	TMap<E_MemoryCardAbilityType, float> TotalAbility; // 0x100
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UNiagaraSystem : UFXSystemAsset {
	bool bDumpDebugSystemInfo; // 0x30
	bool bDumpDebugEmitterInfo; // 0x31
	bool bRequireCurrentFrameData; // 0x32
	char bFixedBounds : 1; // 0x34
	UNiagaraEffectType* EffectType; // 0x38
	bool bOverrideScalabilitySettings; // 0x40
	TArray<FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x48
	FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x58
	TArray<FNiagaraEmitterHandle> EmitterHandles; // 0x68
	TArray<UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x78
	UNiagaraScript* SystemSpawnScript; // 0x88
	UNiagaraScript* SystemUpdateScript; // 0x90
	FNiagaraSystemCompiledData SystemCompiledData; // 0xa8
	FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x2c0
	FBox FixedBounds; // 0x388
	bool bAutoDeactivate; // 0x3a4
	float WarmupTime; // 0x3a8
	int32_t WarmupTickCount; // 0x3ac
	float WarmupTickDelta; // 0x3b0
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x3b4
	TArray<FName> UserDINamesReadInSystemScripts; // 0x3b8
};

struct UBuildPatchManifest : UObject {
	char ManifestFileVersion; // 0x28
	bool bIsFileData; // 0x29
	uint32_t appId; // 0x2c
	FString AppName; // 0x30
	FString BuildVersion; // 0x40
	FString LaunchExe; // 0x50
	FString LaunchCommand; // 0x60
	TSet<FString> PrereqIds; // 0x70
	FString PrereqName; // 0xc0
	FString PrereqPath; // 0xd0
	FString PrereqArgs; // 0xe0
	TArray<FFileManifestData> FileManifestList; // 0xf0
	TArray<FChunkInfoData> ChunkList; // 0x100
	TArray<FCustomFieldData> CustomFields; // 0x110
};

struct UWBP_Functionality_TransferTerrasiteMenu_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UUniformGridPanel* UniformGridPanel; // 0x268
	UUniformGridPanel* UniformGridPanel_39; // 0x270
	FTerraShopMerchandise TerraShopMerchandise; // 0x278
	int32_t GridInRow; // 0x2b8
	int32_t GridInColumn; // 0x2bc
	int32_t MerchandiesIdx; // 0x2c0
	UWBP_PopUp_TransferTerrasite_C* WBP_PopUpTransferTerrasite; // 0x2c8
	float DailyRecvTime; // 0x2d0
	float EndTime; // 0x2d4
	float StandardSecond; // 0x2d8
	bool IsOutOfDate; // 0x2dc
	TArray<UWBP_Functionality_TransferTerrasiteList_C*> WBP_Functionality_TransferTerrasiteDailyList_Arry; // 0x2e0
	float StartTime; // 0x2f0
	bool IsResetDailyMerchandise; // 0x2f4
	bool IsInitDailiyExpireTime; // 0x2f5
};

struct UFindTurnBasedMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ULocalMap_Image_C : UUserWidget {
	UImage* Map; // 0x260
};

struct UWBP_Radiogram_6010211_C : UWBP_radiogram_CustomBase_C {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x298
	UTextBlock* TextBlock; // 0x2a0
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x2a8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x2b0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x2b8
	UWBP_RadiogramListing_C* WBP_RadiogramListing_4; // 0x2c0
	UWBP_RadiogramListing_C* WBP_RadiogramListing_5; // 0x2c8
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x2d0
	char bStopAILogicOnUnposses : 1; // 0x2d0
	char bLOSflag : 1; // 0x2d0
	char bSkipExtraLOSChecks : 1; // 0x2d0
	char bAllowStrafe : 1; // 0x2d0
	char bWantsPlayerState : 1; // 0x2d0
	char bSetControlRotationFromPawnOrientation : 1; // 0x2d0
	UPathFollowingComponent* PathFollowingComponent; // 0x2d8
	UBrainComponent* BrainComponent; // 0x2e0
	UAIPerceptionComponent* PerceptionComponent; // 0x2e8
	UPawnActionsComponent* ActionsComp; // 0x2f0
	UBlackboardComponent* Blackboard; // 0x2f8
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x300
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x308
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x310
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FMulticastInlineDelegate OnDrop; // 0x58
	FMulticastInlineDelegate OnDragCancelled; // 0x68
	FMulticastInlineDelegate OnDragged; // 0x78
};

struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct ABP_MasterStorage_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UBP_CollisionByDistanceComponent_C* BP_CollisionByDistanceComponent; // 0x228
	UStaticMeshComponent* BoxBody; // 0x230
	USceneComponent* Scene; // 0x238
	UBP_StorageInventoryComponent_C* BP_StorageInventoryComponent; // 0x240
	float Timeline_Destroy_Opacity_3D0FB81844B98952311F7CBC787DA0C0; // 0x248
	ETimelineDirection Timeline_Destroy__Direction_3D0FB81844B98952311F7CBC787DA0C0; // 0x24c
	UTimelineComponent* Timeline_Destroy; // 0x250
	bool Use Interact Time; // 0x258
	float Time To Interact; // 0x25c
	FText Interact Action Text; // 0x260
	FText Interact Timer Text; // 0x278
	FSlateBrush Interact Brush; // 0x290
	UAudioComponent* Interact Sound; // 0x318
	USoundBase* Interact Timer Sound; // 0x320
	bool IsOpened; // 0x328
	float InteractableDistance; // 0x32c
	FText Name; // 0x330
	FMulticastInlineDelegate OnInteract; // 0x348
	USoundBase* OpenSound; // 0x358
	USoundBase* CloseSound; // 0x360
	TArray<UMaterialInstanceDynamic*> BoxDynamicMaterials; // 0x368
	FDataTableRowHandle DropItemTable; // 0x378
	TArray<FItemCodeValue> WeightTable; // 0x388
	UBP_WidgetIndicatorComponent_C* TutorialIndicator; // 0x398
	TArray<int32_t> TutorialIndicatorVisibleStep; // 0x3a0
	FName CollisionProfileName; // 0x3b0
	FVector WidgetIndicatorOffset; // 0x3b8
};

struct UAssetManager : UObject {
	TArray<UObject*> ObjectReferenceList; // 0x2c0
	bool bIsGlobalAsyncScanEnvironment; // 0x2d0
	bool bShouldGuessTypeAndName; // 0x2d1
	bool bShouldUseSynchronousLoad; // 0x2d2
	bool bIsLoadingFromPakFiles; // 0x2d3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2d4
	bool bOnlyCookProductionAssets; // 0x2d5
	bool bIsBulkScanning; // 0x2d6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2d7
	bool bIsManagementDatabaseCurrent; // 0x2d8
	bool bUpdateManagementDatabaseAfterScan; // 0x2d9
	bool bIncludeOnlyOnDiskAssets; // 0x2da
	bool bHasCompletedInitialScan; // 0x2db
	int32_t NumberOfSpawnedNotifications; // 0x2dc
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct UPhononOcclusionSourceSettings : UOcclusionPluginSourceSettingsBase {
	EIplDirectOcclusionMode DirectOcclusionMode; // 0x28
	EIplDirectOcclusionMethod DirectOcclusionMethod; // 0x29
	float DirectOcclusionSourceRadius; // 0x2c
	bool DirectAttenuation; // 0x30
	bool AirAbsorption; // 0x31
};

struct ULevelStreaming : UObject {
	TSoftObjectPtr<UWorld> WorldAsset; // 0x28
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	int32_t LevelLODIndex; // 0xb0
	int32_t StreamingPriority; // 0xb4
	char bShouldBeVisible : 1; // 0xba
	char bShouldBeLoaded : 1; // 0xba
	char bLocked : 1; // 0xba
	char bIsStatic : 1; // 0xba
	char bShouldBlockOnLoad : 1; // 0xba
	char bShouldBlockOnUnload : 1; // 0xbb
	char bDisableDistanceStreaming : 1; // 0xbb
	char bDrawOnLevelStatusMap : 1; // 0xbb
	FLinearColor LevelColor; // 0xbc
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	FMulticastInlineDelegate OnLevelLoaded; // 0xe8
	FMulticastInlineDelegate OnLevelUnloaded; // 0xf8
	FMulticastInlineDelegate OnLevelShown; // 0x108
	FMulticastInlineDelegate OnLevelHidden; // 0x118
	ULevel* LoadedLevel; // 0x128
	ULevel* PendingUnloadLevel; // 0x130
};

struct UCurveLinearColorAtlas : UTexture2D {
	uint32_t TextureSize; // 0x100
	TArray<UCurveLinearColor*> GradientCurves; // 0x108
};

struct UMaterialExpressionScalarParameter : UMaterialExpressionParameter {
	float DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x5c
	char PrimitiveDataIndex; // 0x5d
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterfaceRWBase {
	FString EmitterName; // 0xd8
};

struct UAkAssetDataSwitchContainer : UAkAssetDataWithMedia {
	TArray<UAkAssetDataSwitchContainerData*> SwitchContainers; // 0x78
	UAkGroupValue* DefaultGroupValue; // 0x88
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct URotatingMovementComponent : UMovementComponent {
	FRotator RotationRate; // 0xf0
	FVector PivotTranslation; // 0xfc
	char bRotationInLocalSpace : 1; // 0x108
};

struct UExtCharacterMovementComponent : UCharacterMovementComponent {
	bool MirrorRootMotion; // 0xb00
	EAxis MirrorAxis; // 0xb01
	EAxis FlipAxis; // 0xb02
};

struct UWBP_HUD_TeamListing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_Frame; // 0x268
	UImage* Image; // 0x270
	UImage* Image_2; // 0x278
	UImage* Image_87; // 0x280
	UImage* Image_111; // 0x288
	UImage* Image_Voice; // 0x290
	UProgressBar* ProgressBar_TeamHealth; // 0x298
	UTextBlock* Text_Index; // 0x2a0
	UTextBlock* Text_TeamName; // 0x2a8
	UBP_PlayerInventoryComponent_C* PlayerInventoryComponent; // 0x2b0
	FTeamMemberInfo Team Member Info; // 0x2b8
	ASurvivalPlayerState* Member PS; // 0x2d8
	float Health; // 0x2e0
	int32_t Index; // 0x2e4
};

struct ABP_RayProjectile_C : ABP_MasterProjectile_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b8
	TSet<AActor*> DamagedActors; // 0x3c0
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct ULoadingScreenSettings : UDeveloperSettings {
	FALoadingScreenSettings StartupLoadingScreen; // 0x38
	FALoadingScreenSettings DefaultLoadingScreen; // 0x478
	FClassicLayoutSettings Classic; // 0x8b8
	FCenterLayoutSettings Center; // 0x960
	FLetterboxLayoutSettings Letterbox; // 0xa00
	FSidebarLayoutSettings Sidebar; // 0xb38
	FDualSidebarLayoutSettings DualSidebar; // 0xbe8
};

struct UBP_KeyInput_C : UObject {
	FKey Key Input; // 0x28
	bool Analog Use Negative Axis; // 0x40
	float Analog Previous Axis Value; // 0x44
	float Analog Current Axis Value; // 0x48
	float World Delta Seconds; // 0x4c
	bool Input is Using Delta; // 0x50
	FString Display Name; // 0x58
};

struct UAkMediaAssetData : UObject {
	bool IsStreamed; // 0x28
	bool UseDeviceMemory; // 0x29
};

struct UParticleModuleSizeMultiplyLife : UParticleModuleSizeBase {
	FRawDistributionVector LifeMultiplier; // 0x30
	char MultiplyX : 1; // 0x78
	char MultiplyY : 1; // 0x78
	char MultiplyZ : 1; // 0x78
};

struct UInheritableComponentHandler : UObject {
	TArray<FComponentOverrideRecord> Records; // 0x28
	TArray<UActorComponent*> UnnecessaryComponents; // 0x38
};

struct UParticleModuleRequired : UParticleModule {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct UWBP_Popup_ForbiddenNick_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_MainFrame_C* BP_UI_Frame; // 0x268
	UImage* Image; // 0x270
	UImage* Image_92; // 0x278
	UImage* Image_164; // 0x280
	UTextBlock* TextBlock_4; // 0x288
	UWBP_PopUp_Button_C* WBP_PopUp_Button; // 0x290
	bool DragEnabled; // 0x298
	bool IsMouseButtonDown; // 0x299
	FVector2D LastMousePosition; // 0x29c
	bool IsDrag; // 0x2a4
	UCanvasPanelSlot* ParentSlot; // 0x2a8
	float SafetyZoneY; // 0x2b0
	float SafetyZoneX; // 0x2b4
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2b8
	UWBP_HUD_C* Parent Widget; // 0x2c0
	bool Name Error; // 0x2c8
	ABP_BuildPartBase_C* Building; // 0x2d0
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UWBP_Radiogram_4020302_C : UUserWidget {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x260
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x268
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x270
	UWBP_RadiogramListing_C* WBP_RadiogramListing_3; // 0x278
	UWBP_RadiogramListing_C* WBP_RadiogramListing_4; // 0x280
};

struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	char FocusPriority; // 0x98
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve Curve; // 0x70
};

struct UAgon_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2f8
};

struct UAnimBlueprint : UBlueprint {
	USkeleton* TargetSkeleton; // 0xa8
	TArray<FAnimGroupInfo> Groups; // 0xb0
	bool bUseMultiThreadedAnimationUpdate; // 0xc0
	bool bWarnAboutBlueprintUsage; // 0xc1
};

struct UInterpTrackInstAkAudioEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UMaterialExpressionSpriteTextureSampler : UMaterialExpressionTextureSampleParameter2D {
	bool bSampleAdditionalTextures; // 0x80
	int32_t AdditionalSlotIndex; // 0x84
	FText SlotDisplayName; // 0x88
};

struct USurvivalReplicationGraphNode_AlwaysRelevant_ForConnection : UReplicationGraphNode {
	AActor* LastPawn; // 0x278
	TArray<FAlwaysRelevantActorInfo> PastRelevantActors; // 0x280
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* itemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct ULandscapeMeshCollisionComponent : ULandscapeHeightfieldCollisionComponent {
	FGuid MeshGuid; // 0x520
};

struct ULevelSequenceAnimSequenceLink : UAssetUserData {
	TArray<FLevelSequenceAnimSequenceLinkItem> AnimSequenceLinks; // 0x28
};

struct USteamVRChaperoneComponent : UActorComponent {
	FMulticastInlineDelegate OnLeaveBounds; // 0xb0
	FMulticastInlineDelegate OnReturnToBounds; // 0xc0
};

struct ULandscapeSplinesComponent : UPrimitiveComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x440
	TArray<ULandscapeSplineSegment*> Segments; // 0x450
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x460
};

struct USoundNodeWavePlayer : USoundNodeAssetReferencer {
	TSoftObjectPtr<USoundWave> SoundWaveAssetPtr; // 0x48
	USoundWave* SoundWave; // 0x70
	char bLooping : 1; // 0x80
};

struct UBlackboardKeyType_Class : UBlackboardKeyType {
	UObject* BaseClass; // 0x30
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UNavArea : UNavAreaBase {
	float DefaultCost; // 0x30
	float FixedAreaEnteringCost; // 0x34
	FColor DrawColor; // 0x38
	FNavAgentSelector SupportedAgents; // 0x3c
	char bSupportsAgent0 : 1; // 0x40
	char bSupportsAgent1 : 1; // 0x40
	char bSupportsAgent2 : 1; // 0x40
	char bSupportsAgent3 : 1; // 0x40
	char bSupportsAgent4 : 1; // 0x40
	char bSupportsAgent5 : 1; // 0x40
	char bSupportsAgent6 : 1; // 0x40
	char bSupportsAgent7 : 1; // 0x40
	char bSupportsAgent8 : 1; // 0x41
	char bSupportsAgent9 : 1; // 0x41
	char bSupportsAgent10 : 1; // 0x41
	char bSupportsAgent11 : 1; // 0x41
	char bSupportsAgent12 : 1; // 0x41
	char bSupportsAgent13 : 1; // 0x41
	char bSupportsAgent14 : 1; // 0x41
	char bSupportsAgent15 : 1; // 0x41
};

struct ABP_LandingPOD_C : ABP_MasterResource_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x440
	UParticleSystemComponent* P_SmokePuff1; // 0x448
	UParticleSystemComponent* P_SmokePuff2; // 0x450
	USkeletalMeshComponent* SkeletalMesh; // 0x458
	float TimeToDestroy; // 0x460
	FString OwningUserId; // 0x468
	BP_SurvivalCharacter_C* Character; // 0x478
	FTimerHandle CharacterDistanceCheckTimer; // 0x480
	bool ReadyToDestroy; // 0x488
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
};

struct ABP_SessionDataManager_C : ASessionDataManager {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
	USceneComponent* DefaultSceneRoot; // 0x368
	TMap<FString, FS_DeadPlayerSave> DeadPlayerInfo; // 0x370
	FIntValueFromDataTable RetrieveSystemDefaultSlotCount; // 0x3c0
	TMap<FString, FS_RetrieveSystemInfo> RetrieveSystemInfo; // 0x3e8
	TMap<FString, FS_UserCustomizeInfo> UserCustomizeInfo; // 0x438
	TMap<FString, FS_MachineArmAbilitySave> MachineArmAbilityInfo; // 0x488
	TMap<FString, ABP_BuildPartBase_C*> SessionBuildPartList; // 0x4d8
	FIntValueFromDataTable DailyItemCount; // 0x528
	TMap<FString, ABP_MasterItem_C*> SessionItemList; // 0x550
	TMap<FString, ABP_CarSpawner_C*> CarSpawnerList; // 0x5a0
	TMap<FString, ABP_LandingPOD_C*> LandingPODList; // 0x5f0
};

struct UCollisionProfile : UDeveloperSettings {
	TArray<FCollisionResponseTemplate> Profiles; // 0x38
	TArray<FCustomChannelSetup> DefaultChannelResponses; // 0x48
	TArray<FCustomProfile> EditProfiles; // 0x58
	TArray<FRedirector> ProfileRedirects; // 0x68
	TArray<FRedirector> CollisionChannelRedirects; // 0x78
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct USQSUntagQueue : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct ABP_LandmarkZone_C : ALandmarkBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x378
	USceneComponent* SceneRoot; // 0x380
	UBillboardComponent* Icon; // 0x388
	UBP_WidgetIndicatorComponent_C* MainIndicator; // 0x390
	UBP_ObjectiveBroadcaster_C* ObjectiveWidget; // 0x398
	UBoxComponent* RadiogramBroadcaster; // 0x3a0
	UBoxComponent* DialogMessageVolume; // 0x3a8
	UBP_PlayerInventoryComponent_C* CurrentPlayerInventoryComponent; // 0x3b0
	FText ActionText; // 0x3b8
	float InteractTime; // 0x3d0
	FText InteractActionText; // 0x3d8
	bool bCanInteractable; // 0x3f0
	FTimerHandle CountDownTimerHandler; // 0x3f8
	FMulticastInlineDelegate CountDownDone; // 0x400
	TArray<FS_LandmarkDialogueByState> blueDialogues; // 0x410
	E_UserActionOverlapZoneType RadioOverlap; // 0x420
	bool EnterObjective; // 0x421
	FVector ScaleByDistance; // 0x424
	TArray<FS_Dialogue> DialogueMessage; // 0x430
	int32_t DialogueIndex; // 0x440
	UAkAudioEvent* BGMPlayEvent; // 0x448
	UAkAudioEvent* BGMStopEvent; // 0x450
	bool IndicatorOn; // 0x458
	FVector MainIndicatorLocation; // 0x45c
	float CloseTime; // 0x468
	float ServerCloseTime; // 0x46c
	FMulticastInlineDelegate OnLandmarkSkillActivated; // 0x470
	FMulticastInlineDelegate OnUpdatedIndicator; // 0x480
};

struct UWBP_MapMarker_RespawnPoint_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_Disabled; // 0x268
	UWidgetAnimation* Anim_Hovered; // 0x270
	UWidgetAnimation* Anim_Activated; // 0x278
	UBorder* Border; // 0x280
	UC_Manager-RespawnMap_C* RespawnMapManager; // 0x288
	ABP_RespawnBuildPartBase_C* RespawnBuildPart; // 0x290
	UMaterialInstanceDynamic* MI_RespawnGauge; // 0x298
	bool IsActivated; // 0x2a0
	UWBP_MapMarkerTooltip_C* TooltipRef; // 0x2a8
	FVector Player Dead Loc; // 0x2b0
	FMulticastInlineDelegate OnDoubleClicked; // 0x2c0
	bool bSpawnable; // 0x2d0
	UC_Manager-WorldMap_C* WorldMapManager; // 0x2d8
	bool bLeftMouseDown; // 0x2e0
	bool bDragged; // 0x2e1
	FMulticastInlineDelegate OnHoveredRespawnMarker; // 0x2e8
};

struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UOnsetNRTSettings : UAudioSynesthesiaNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct UMovieSceneVectorSection : UMovieSceneSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe8
	int32_t ChannelsUsed; // 0x368
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1a0
};

struct UAsyncActionLoadPrimaryAssetClassList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMagicLeapARPinSaveGame : USaveGame {
	FGuid PinnedID; // 0x28
	FTransform ComponentWorldTransform; // 0x40
	FTransform PinTransform; // 0x70
	bool bShouldPinActor; // 0xa0
};

struct UWBP_Main_Radiogram_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* VerticalBox_List; // 0x268
	UWBP_Button_UI_C* WBP_Button_UI; // 0x270
	UWBP_Main_Radiogram_Description_C* WBP_Main_Radiogram_Description; // 0x278
	UObjectiveSystemManagerComponent_C* ObjectiveSystem; // 0x280
	UWBP_Main_Radiogram_Description_C* RadiogramDescrioption; // 0x288
	UWBP_Main_RadiogramListing_S_C* PrevWidget; // 0x290
	bool FirstCreated; // 0x298
	TArray<UWBP_Main_RadiogramListing_L_C*> RadiogramMainCategoryList; // 0x2a0
	UWBP_Main_RadiogramListing_L_C* TutorialMain; // 0x2b0
	TMap<int32_t, FS_RadiogramGuide> CachedTutorialRadiogram; // 0x2b8
	TMap<int32_t, FIntPair> CachedDefaultIdentifier; // 0x308
	TMap<int32_t, FIntPair> CachedCustomIdentifier; // 0x358
};

struct UBP_ConvertInventoryComponent_C : UBP_InventoryComponentBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x138
	UBP_InventoryComponentBase_C* OutputInventory; // 0x140
	bool bIsWorking; // 0x148
	float ConvertInterval; // 0x14c
	FTimerHandle ConvertTimer; // 0x150
	bool HasWorkingSlot; // 0x158
	float ConvertValuePerTime; // 0x15c
	E_ConvertType Convert Type; // 0x160
	float TransMultiply; // 0x164
	E_ConvertStopType ConvertStopReason; // 0x168
	FMulticastInlineDelegate StopReasonDispatcher; // 0x170
};

struct UInterpTrackVectorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UDatasmithStaticMeshGLTFImportData : UDatasmithStaticMeshImportData {
	FString SourceMeshName; // 0x28
};

struct AAkSpotReflector : AActor {
	UAkAuxBus* EarlyReflectionAuxBus; // 0x220
	FString EarlyReflectionAuxBusName; // 0x228
	UAkAcousticTexture* AcousticTexture; // 0x238
	float DistanceScalingFactor; // 0x240
	float Level; // 0x244
};

struct AWeaponBase : AHoldableBase {
	ESVWeaponType WeaponType; // 0x478
	float CumulativeFireInterval; // 0x47c
	int32_t FireCountForIntervalCheck; // 0x480
	int32_t FireCountMax; // 0x484
	int32_t MultiShotCount_Native; // 0x488
	USkeletalMeshComponent* WeaponMesh; // 0x490
	float CoolTime; // 0x498
	float WeaponFireAnimTime; // 0x49c
	float FireAnimTime; // 0x4a0
	bool IsPlayingFireAnim; // 0x4a4
	bool bAutoFire; // 0x4a5
	bool FirePressed; // 0x4a6
	FTransform AimCameraTransform; // 0x4b0
	UAnimMontage* TP_FireAnimation; // 0x4e0
	UAnimMontage* FP_FireAnimation; // 0x4e8
	UAnimMontage* Weapon_FireAnimation; // 0x4f0
	bool bClientPrecedingProduction; // 0x4f8
	float ADSSpeed; // 0x4fc
	float ADSAdditionalSpeedMultiply; // 0x500
	float ADSFOV; // 0x504
	float ADSDoF; // 0x508
	TArray<FHitEffectInfo> HitEffects; // 0x510
	TMap<EAttachmentType, int32_t> EquipedAttachments; // 0x520
	TArray<float> CustomFOVs; // 0x570
	TArray<float> CustomDoFs; // 0x580
	TArray<FTransform> CustomFoVTransforms; // 0x590
	int32_t SelectedCustomFoVIndex; // 0x5a0
	float LastFireTime; // 0x5a4
	float OldLastFireTime; // 0x5a8
};

struct ABP_SVWeatherTool_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UPostProcessComponent* RainDropPP; // 0x228
	UAkComponent* AkWindSound; // 0x230
	UDecalComponent* SnowySurfaceDecal; // 0x238
	UDecalComponent* WetSurfaceDecal; // 0x240
	UDecalComponent* WetRippleDecal; // 0x248
	UDirectionalLightComponent* LightningDirectionalLight; // 0x250
	UStaticMeshComponent* CloudsMesh; // 0x258
	UPostProcessComponent* ScreenPostProcess; // 0x260
	UParticleSystemComponent* LightningBolts_Part; // 0x268
	UParticleSystemComponent* SheetLightning_Part; // 0x270
	UParticleSystemComponent* Rain_GPU; // 0x278
	UParticleSystemComponent* Snow; // 0x280
	UParticleSystemComponent* RainWind; // 0x288
	UParticleSystemComponent* Hail; // 0x290
	UParticleSystemComponent* Rain; // 0x298
	USceneComponent* Scene; // 0x2a0
	bool Enable Rain; // 0x2a8
	E_RainStyle Rain Style; // 0x2a9
	bool Enable Hail; // 0x2aa
	FLinearColor Rain Color; // 0x2ac
	float Rain Brightness; // 0x2bc
	float Rain Density; // 0x2c0
	float Rain Impact Density; // 0x2c4
	FVector Rain Velocity; // 0x2c8
	bool Lock To Player Camera; // 0x2d4
	AActor* Actor To Lock To; // 0x2d8
	float Hail Density; // 0x2e0
	bool Enable Mist; // 0x2e4
	float Mist Density; // 0x2e8
	FVector Mist Velocity; // 0x2ec
	float Hail Scale; // 0x2f8
	bool Enable Snow; // 0x2fc
	E_SnowStyle Snow Style; // 0x2fd
	float Rain Ground Intensity; // 0x300
	USoundBase* Rain Loop SFX; // 0x308
	bool Enable PostProcess; // 0x310
	bool Enable Clouds; // 0x311
	float Cloud Morph Speed; // 0x314
	bool Enable Sheet Lightning; // 0x318
	float Sheet Lightning Intensity; // 0x31c
	FLinearColor Fog Near Color; // 0x320
	FLinearColor Fog Medium Color; // 0x330
	FLinearColor Fog Far Color; // 0x340
	float Fog Density; // 0x350
	float Fog Start Distance; // 0x354
	float Fog Medium Blend Distance; // 0x358
	float Fog Far Blend Distance; // 0x35c
	float Sheet Lightning Delay Min; // 0x360
	float Sheet Lightning Delay Max; // 0x364
	float Sheet Lightning Flash Intensity Min; // 0x368
	float Sheet Lightning Flash Intensity Max; // 0x36c
	USoundBase* Sheet Lightning SFX; // 0x370
	float Sheet Lightning SFX Volume; // 0x378
	float Sheet Lightning SFX Delay; // 0x37c
	float Sheet Lightning SFX Pitch Min; // 0x380
	float Sheet Lightning SFX Pitch Max; // 0x384
	bool Enable Bolt Lightning; // 0x388
	float Bolt Lightning Delay Min; // 0x38c
	float Bolt Lightning Delay Max; // 0x390
	float Bolt Lightning Flash Intensity Min; // 0x394
	float Bolt Lightning Flash Intensity Max; // 0x398
	USoundBase* Bolt Lightning SFX; // 0x3a0
	float Bolt Lightning SFX Volume; // 0x3a8
	float Bolt Lightning SFX Delay; // 0x3ac
	float Bolt Lightning SFX Pitch Min; // 0x3b0
	float Bolt Lightning SFX Pitch Max; // 0x3b4
	float Cloud Intensity Tangent 1; // 0x3b8
	float Cloud Intensity Tangent 2; // 0x3bc
	float Snow Density; // 0x3c0
	FVector Snow Velocity Min; // 0x3c4
	FVector Snow Velocity Max; // 0x3d0
	float Snow Ground Intensity; // 0x3dc
	float Screen Rain Effects Intensity; // 0x3e0
	bool Screen Rain Effects Cull Center; // 0x3e4
	float Screen Frost Effects Intensity; // 0x3e8
	USoundBase* Snow Wind Loop SFX; // 0x3f0
	float Snow Wind SFX Volume; // 0x3f8
	float Rain Loop SFX Volume; // 0x3fc
	float Snow Wind SFX Pitch; // 0x400
	float Rain Loop SFX Pitch; // 0x404
	FVector  Speed; // 0x408
	bool Enable Runtime Edit; // 0x414
	FMulticastInlineDelegate OnPropertyChanged; // 0x418
	float Rain Light Scale; // 0x428
	float Snow Light Scale; // 0x42c
	FFloatValueFromDataTable Rain Temperature Increase; // 0x430
	FFloatValueFromDataTable Snow Temperature Increase; // 0x458
	float Bolt Lightning SFX Volume Interpolated; // 0x480
	bool WaitingForBoltLightning; // 0x484
	float Rain Change Interpolator; // 0x488
	float Weather Proof Factor; // 0x48c
	float Wind Speed; // 0x490
	UMaterialInstanceDynamic* MI_Rain; // 0x498
	UMaterialInstanceDynamic* MI_Snow; // 0x4a0
	float Wind Speed from Sequencer; // 0x4a8
	float LastWindSoundUpdateTime; // 0x4ac
	FVector WindDirection; // 0x4b0
	float EffectAlpha; // 0x4bc
	float Height; // 0x4c0
	float DropletTime; // 0x4c4
	float TrailAlpha; // 0x4c8
	float Volume; // 0x4cc
	bool bWindSoundActive; // 0x4d0
};

struct ABP_ModelViewer_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USkeletalMeshComponent* Face; // 0x228
	USceneCaptureComponent2D* CaptureComponent; // 0x230
	UPointLightComponent* PointLight7; // 0x238
	UPointLightComponent* PointLight6; // 0x240
	UPointLightComponent* PointLight5; // 0x248
	UPointLightComponent* PointLight4; // 0x250
	UPointLightComponent* PointLight3; // 0x258
	UPointLightComponent* PointLight2; // 0x260
	UPointLightComponent* PointLight1; // 0x268
	UPointLightComponent* PointLight; // 0x270
	USkeletalMeshComponent* Arm; // 0x278
	USkeletalMeshComponent* Feet; // 0x280
	USkeletalMeshComponent* Legs; // 0x288
	USkeletalMeshComponent* Chest; // 0x290
	USkeletalMeshComponent* Head; // 0x298
	USkeletalMeshComponent* SkeletalMesh; // 0x2a0
	USceneComponent* DefaultSceneRoot1; // 0x2a8
	bool Preformance Mode; // 0x2b0
};

struct USceneComponent : UActorComponent {
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xb8
	USceneComponent* AttachParent; // 0xc0
	FName AttachSocketName; // 0xc8
	TArray<USceneComponent*> AttachChildren; // 0xd0
	TArray<USceneComponent*> ClientAttachedChildren; // 0xe0
	FVector RelativeLocation; // 0x11c
	FRotator RelativeRotation; // 0x128
	FVector RelativeScale3D; // 0x134
	FVector ComponentVelocity; // 0x140
	char bComponentToWorldUpdated : 1; // 0x14c
	char bAbsoluteLocation : 1; // 0x14c
	char bAbsoluteRotation : 1; // 0x14c
	char bAbsoluteScale : 1; // 0x14c
	char bVisible : 1; // 0x14c
	char bShouldBeAttached : 1; // 0x14c
	char bShouldSnapLocationWhenAttached : 1; // 0x14c
	char bShouldSnapRotationWhenAttached : 1; // 0x14d
	char bShouldUpdatePhysicsVolume : 1; // 0x14d
	char bHiddenInGame : 1; // 0x14d
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x14d
	char bUseAttachParentBound : 1; // 0x14d
	EComponentMobility Mobility; // 0x14f
	EDetailMode DetailMode; // 0x150
	FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x151
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterialMask* PhysMaterialMask; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	FScalarMaterialInput Metallic; // 0xd8
	FScalarMaterialInput Specular; // 0xec
	FScalarMaterialInput Anisotropy; // 0x100
	FVectorMaterialInput Normal; // 0x114
	FVectorMaterialInput Tangent; // 0x128
	FColorMaterialInput EmissiveColor; // 0x13c
	EMaterialDomain MaterialDomain; // 0x150
	EBlendMode BlendMode; // 0x151
	EDecalBlendMode DecalBlendMode; // 0x152
	EMaterialDecalResponse MaterialDecalResponse; // 0x153
	EMaterialShadingModel ShadingModel; // 0x154
	char bCastDynamicShadowAsMasked : 1; // 0x155
	FMaterialShadingModelField ShadingModels; // 0x156
	float OpacityMaskClipValue; // 0x158
	FVectorMaterialInput WorldPositionOffset; // 0x15c
	FScalarMaterialInput Refraction; // 0x170
	FMaterialAttributesInput MaterialAttributes; // 0x184
	FScalarMaterialInput PixelDepthOffset; // 0x19c
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b0
	char bEnableSeparateTranslucency : 1; // 0x1c4
	char bEnableResponsiveAA : 1; // 0x1c4
	char bScreenSpaceReflections : 1; // 0x1c4
	char bContactShadows : 1; // 0x1c4
	char TwoSided : 1; // 0x1c4
	char DitheredLODTransition : 1; // 0x1c4
	char DitherOpacityMask : 1; // 0x1c4
	char bAllowNegativeEmissiveColor : 1; // 0x1c4
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1c5
	char bEnableMobileSeparateTranslucency : 1; // 0x1c6
	int32_t NumCustomizedUVs; // 0x1c8
	float TranslucencyDirectionalLightingIntensity; // 0x1cc
	float TranslucentShadowDensityScale; // 0x1d0
	float TranslucentSelfShadowDensityScale; // 0x1d4
	float TranslucentSelfShadowSecondDensityScale; // 0x1d8
	float TranslucentSelfShadowSecondOpacity; // 0x1dc
	float TranslucentBackscatteringExponent; // 0x1e0
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1e4
	float TranslucentShadowStartOffset; // 0x1f4
	char bDisableDepthTest : 1; // 0x1f8
	char bWriteOnlyAlpha : 1; // 0x1f8
	char bGenerateSphericalParticleNormals : 1; // 0x1f8
	char bTangentSpaceNormal : 1; // 0x1f8
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x1f8
	char bBlockGI : 1; // 0x1f8
	char bUsedAsSpecialEngineMaterial : 1; // 0x1f8
	char bUsedWithSkeletalMesh : 1; // 0x1f8
	char bUsedWithEditorCompositing : 1; // 0x1f9
	char bUsedWithParticleSprites : 1; // 0x1f9
	char bUsedWithBeamTrails : 1; // 0x1f9
	char bUsedWithMeshParticles : 1; // 0x1f9
	char bUsedWithNiagaraSprites : 1; // 0x1f9
	char bUsedWithNiagaraRibbons : 1; // 0x1f9
	char bUsedWithNiagaraMeshParticles : 1; // 0x1f9
	char bUsedWithGeometryCache : 1; // 0x1f9
	char bUsedWithStaticLighting : 1; // 0x1fa
	char bUsedWithMorphTargets : 1; // 0x1fa
	char bUsedWithSplineMeshes : 1; // 0x1fa
	char bUsedWithInstancedStaticMeshes : 1; // 0x1fa
	char bUsedWithGeometryCollections : 1; // 0x1fa
	char bUsesDistortion : 1; // 0x1fa
	char bUsedWithClothing : 1; // 0x1fa
	char bUsedWithWater : 1; // 0x1fc
	char bUsedWithHairStrands : 1; // 0x1fc
	char bUsedWithLidarPointCloud : 1; // 0x1fc
	char bUsedWithVirtualHeightfieldMesh : 1; // 0x1fc
	char bUsedWithUI : 1; // 0x200
	char bAutomaticallySetUsageInEditor : 1; // 0x200
	char bFullyRough : 1; // 0x200
	char bUseFullPrecision : 1; // 0x200
	char bUseLightmapDirectionality : 1; // 0x200
	char bUseAlphaToCoverage : 1; // 0x200
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x204
	char bUseHQForwardReflections : 1; // 0x208
	char bUsePlanarForwardReflections : 1; // 0x208
	char bNormalCurvatureToRoughness : 1; // 0x208
	EMaterialTessellationMode D3D11TessellationMode; // 0x209
	char bEnableCrackFreeDisplacement : 1; // 0x20a
	char bEnableAdaptiveTessellation : 1; // 0x20a
	char AllowTranslucentCustomDepthWrites : 1; // 0x20a
	char Wireframe : 1; // 0x20a
	EMaterialShadingRate ShadingRate; // 0x20b
	char bCanMaskedBeAssumedOpaque : 1; // 0x20c
	char bIsMasked : 1; // 0x20c
	char bIsPreviewMaterial : 1; // 0x20c
	char bIsFunctionPreviewMaterial : 1; // 0x20c
	char bUseMaterialAttributes : 1; // 0x20c
	char bCastRayTracedShadows : 1; // 0x20c
	char bUseTranslucencyVertexFog : 1; // 0x20c
	char bApplyCloudFogging : 1; // 0x20c
	char bIsSky : 1; // 0x20d
	char bComputeFogPerPixel : 1; // 0x20d
	char bOutputTranslucentVelocity : 1; // 0x20d
	char bAllowDevelopmentShaderCompile : 1; // 0x20d
	char bIsMaterialEditorStatsMaterial : 1; // 0x20d
	EBlendableLocation BlendableLocation; // 0x20e
	char BlendableOutputAlpha : 1; // 0x20f
	char bEnableStencilTest : 1; // 0x20f
	EMaterialStencilCompare StencilCompare; // 0x210
	char StencilRefValue; // 0x211
	ERefractionMode RefractionMode; // 0x212
	int32_t BlendablePriority; // 0x214
	char bIsBlendable : 1; // 0x218
	uint32_t UsageFlagWarnings; // 0x21c
	float RefractionDepthBias; // 0x220
	FGuid StateId; // 0x224
	float MaxDisplacement; // 0x234
	FMaterialCachedExpressionData CachedExpressionData; // 0x268
};

struct UGetGeoLocationAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UBTTaskNode : UBTNode {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct UMagicLeapTouchpadGesturesComponent : UActorComponent {
	FMulticastInlineDelegate OnTouchpadGestureStart; // 0xb8
	FMulticastInlineDelegate OnTouchpadGestureContinue; // 0xc8
	FMulticastInlineDelegate OnTouchpadGestureEnd; // 0xd8
};

struct UBoxComponent : UShapeComponent {
	FVector BoxExtent; // 0x458
	float LineThickness; // 0x464
};

struct UWBP_HUD_CompassMarker_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_Marker; // 0x268
	UScaleBox* ScaleBox_Marker; // 0x270
	UObject* MarkerIcon; // 0x278
	UMaterialInstanceDynamic* MI; // 0x280
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x220
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x228
};

struct UBTTask_FireWeapon_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	float Duration; // 0xb0
	BP_PlayerAI_C* MyPawn; // 0xb8
};

struct UWBP_Main_Description_Attachment_C : UUserWidget {
	UWBP_MainFrame_C* BP_UI_Frame; // 0x260
	UWBP_Slot_Equipment_C* ForeGrip; // 0x268
	UImage* Image_Foregrip; // 0x270
	UImage* Image_Magazine; // 0x278
	UImage* Image_Muzzle; // 0x280
	UImage* Image_Scope; // 0x288
	UWBP_Slot_Equipment_C* Magazine; // 0x290
	UWBP_Slot_Equipment_C* Muzzle; // 0x298
	UWBP_Slot_Equipment_C* Scope; // 0x2a0
};

struct UVehicleSkidData : UDataAsset {
	UParticleSystem* WaterFX; // 0x30
	UParticleSystem* DirtFX; // 0x38
	UParticleSystem* AsphaltFX; // 0x40
	float WaterMinSpeed; // 0x48
	float WaterMaxSpeed; // 0x4c
	float DirtMinSpeed; // 0x50
	float DirtMaxSpeed; // 0x54
	float AsphaltMinSpeed; // 0x58
	float AsphaltMaxSpeed; // 0x5c
	float WaterMinSpawn; // 0x60
	float WaterMaxSpawn; // 0x64
	float DirtMinSpawn; // 0x68
	float DirtMaxSpawn; // 0x6c
	float AsphaltMinSpawn; // 0x70
	float AsphaltMaxSpawn; // 0x74
	float WaterMinLifeTime; // 0x78
	float WaterMaxLifeTime; // 0x7c
	float DirtMinLifeTime; // 0x80
	float DirtMaxLifeTime; // 0x84
	float AsphaltMinLifeTime; // 0x88
	float AsphaltMaxLifeTime; // 0x8c
	FVector WaterMinInitSize; // 0x90
	FVector WaterMaxInitSize; // 0x9c
	FVector DirtMinInitSize; // 0xa8
	FVector DirtMaxInitSize; // 0xb4
	FVector AsphaltMinInitSize; // 0xc0
	FVector AsphaltMaxInitSize; // 0xcc
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMapClass; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	FUniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray<UChannel*> ChannelsToTick; // 0x1518
};

struct USoundfieldSubmix : USoundSubmixWithParentBase {
	FName SoundfieldEncodingFormat; // 0x40
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x48
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x60
};

struct UOnlinePIESettings : UDeveloperSettings {
	bool bOnlinePIEEnabled; // 0x38
	TArray<FPIELoginSettingsInternal> Logins; // 0x40
};

struct UBP_CraftingComponent_C : UCustomReplicationActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb8
	TArray<FS_CraftingSlot> CraftingListing; // 0xc0
	float CraftTime; // 0xd0
	float CurrentCraftFinshTime; // 0xd4
	FTimerHandle Crafting Timer; // 0xd8
	UBP_InventoryComponentBase_C* TargetInventory; // 0xe0
	bool bCraftingPaused; // 0xe8
	TArray<UBP_PlayerInventoryComponent_C*> ConnectedPlayerArray; // 0xf0
	FMulticastInlineDelegate OnUpdateCraftingSlot; // 0x100
	int32_t MaxCraftQueue; // 0x110
	float LocalCraftFinishTime; // 0x114
	int32_t TempIdx; // 0x118
	E_CraftingType CraftingType; // 0x11c
	FMulticastInlineDelegate OnIdxChanged; // 0x120
	USoundBase* CraftFinishSound; // 0x130
	USoundBase* CraftingStartSound; // 0x138
	AActor* CommandActor; // 0x140
	bool IsWorking; // 0x148
	bool bCraftStop; // 0x149
	E_CraftingPauseType Stop Reason; // 0x14a
};

struct UParticleModuleTypeDataRibbon : UParticleModuleTypeDataBase {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct ABP_ActorSpawnSpot_C : AActorSpawnSpotBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* SceneRoot; // 0x228
	USphereComponent* EditorOnly_BatchCollision; // 0x230
	USceneComponent* Relative; // 0x238
	USceneComponent* RandomYawCheck; // 0x240
	UBillboardComponent* Billboard; // 0x248
	FName ResourceGroup; // 0x250
	ABP_ActorSpawner_C* ActorSpawner; // 0x258
	AActor* ManagedActor; // 0x260
	AActor* SnapShotActorClass; // 0x268
	TMap<AActor*, FTransform> TransformOffsetSnapShot; // 0x270
	TMap<AActor*, E_ActorSpawnRotRule> SpawnRotRule; // 0x2c0
	FVector DrawBoxSize; // 0x310
	float HeightOffset; // 0x31c
	float LastDestroyTime; // 0x320
	bool Initialized; // 0x324
};

struct UTurret_SK_Skeleton_AnimBlueprint_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3f0
	FAnimNode_Root AnimGraphNode_Root; // 0x4f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x528
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x570
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x598
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x5c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x610
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x638
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x6b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x6e8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x768
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x798
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x848
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x8f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9a8
	float Yaw; // 0x9c8
	float Pitch; // 0x9cc
	FRotator ActorRot; // 0x9d0
	ABP_TurretBase_C* Turret; // 0x9e0
	bool IsFolded; // 0x9e8
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct UCompositeDataTable : UDataTable {
	TArray<UDataTable*> ParentTables; // 0xc8
	TArray<UDataTable*> OldParentTables; // 0xd8
};

struct UMaterialExpressionTemporalSobol : UMaterialExpression {
	FExpressionInput Index; // 0x40
	FExpressionInput Seed; // 0x54
	uint32_t ConstIndex; // 0x68
	FVector2D ConstSeed; // 0x6c
};

struct UMaterialExpressionSphericalParticleOpacity : UMaterialExpression {
	FExpressionInput Density; // 0x40
	float ConstantDensity; // 0x54
};

struct USpotEventTypeData_IncomingDropship_C : USpotEventTypeData_Base_C {
	TArray<FItemCodeValue> RandItemGenerate; // 0xc8
	FDataTableRowHandle NeedItem; // 0xd8
	TMap<int32_t, int32_t> InnerMonster; // 0xe8
	TMap<int32_t, int32_t> OuterMonster; // 0x138
	float MinSpawnTime; // 0x188
	float MaxSpawnTime; // 0x18c
	float TimeComeShip; // 0x190
	float TimeBeforeEnd; // 0x194
	float TimeBeforeEscape; // 0x198
};

struct UMachineArmAbilityComponent : UCustomReplicationActorComponent {
	float HealingHealthFactor; // 0xb8
	float RecoverEnergyFactor; // 0xbc
	float AdditiveMaxHealth; // 0xc0
	float AdditiveMaxEnergy; // 0xc4
	float SurvivalStatEffectMultiply; // 0xc8
	TArray<float> ResourceGatherSpeedMultiply; // 0xd0
	TArray<float> ResourceGatherAmountMultiply; // 0xe0
	TArray<float> CastConsumeSpeedMultiply; // 0xf0
	bool bLearnGliding; // 0x100
	bool bLearnChargePunch; // 0x101
	int32_t AISepcViewer; // 0x104
};

struct USurvivalGameInstance : UGameInstance {
	UGameDataManager* GameDataManager; // 0x1a8
	UGameDataManager* GameDataManagerClass; // 0x1b0
	USVVoiceInterface* VoiceInterface; // 0x1c0
	USVVoiceInterface* VoiceInterfaceClass; // 0x1c8
	FMulticastInlineDelegate OnSystemResolutionChanged; // 0x1d0
};

struct UAnimationDataSourceRegistry : UObject {
	TMap<FName, TWeakObjectPtr<UObject>> DataSources; // 0x28
};

struct UPhysicsConstraintTemplate : UObject {
	FConstraintInstance DefaultInstance; // 0x28
	TArray<FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1e8
	FConstraintProfileProperties DefaultProfile; // 0x1f8
};

struct UAISense_Hearing : UAISense {
	TArray<FAINoiseEvent> NoiseEvents; // 0x80
	float SpeedOfSoundSq; // 0x90
};

struct UCloudWatchLogsPutQueryDefinition : UAwsCloudWatchLogsAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct ULowEntryLatentActionObject : UObject {
	bool Finished; // 0x28
	UObject* Result; // 0x30
	int32_t KeepAliveCount; // 0x38
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x448
};

struct UMaterialExpressionArctangent2Fast : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct UUniformVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Direction; // 0xb4
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x30
	USkeleton* TargetSkeleton; // 0x40
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x48
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x58
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xa8
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xb8
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xc8
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xe8
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x108
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x128
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x148
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x168
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x188
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1a8
	TArray<FName> SyncGroupNames; // 0x1f8
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x208
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x218
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x268
};

struct UWB_ClassicComboBoxButton_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* VisualNoninteractButton; // 0x268
	FButtonStyle Original Style; // 0x270
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UInterpTrackInstDirector : UInterpTrackInst {
	AActor* OldViewTarget; // 0x28
};

struct UMeshSelectionSet : USelectionSet {
	TArray<int32_t> Vertices; // 0x40
	TArray<int32_t> Edges; // 0x50
	TArray<int32_t> Faces; // 0x60
	TArray<int32_t> Groups; // 0x70
};

struct ASkeletalMeshActor : AActor {
	char bShouldDoAnimNotifies : 1; // 0x228
	char bWakeOnLevelStart : 1; // 0x228
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x230
	USkeletalMesh* ReplicatedMesh; // 0x238
	UPhysicsAsset* ReplicatedPhysAsset; // 0x240
	UMaterialInterface* ReplicatedMaterial0; // 0x248
	UMaterialInterface* ReplicatedMaterial1; // 0x250
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UNiagaraDataInterfaceAudioOscilloscope : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
	int32_t Resolution; // 0x40
	float ScopeInMilliseconds; // 0x44
};

struct AInfinityFireProjectile : AInfinityFireProjectileBase {
	UCapsuleComponent* CollisionComp; // 0x248
	UProjectileMovementComponent* ProjectileMovement; // 0x250
	TSet<AActor*> HitActors; // 0x260
};

struct USoundNodeSoundClass : USoundNode {
	USoundClass* SoundClassOverride; // 0x48
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x48
};

struct UGridPathFollowingComponent : UPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x250
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UWBP_Functionality_Hologram_C : UWBP_FunctionalityBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UButton* Button_153; // 0x278
	UButton* Button_155; // 0x280
	UButton* Button_156; // 0x288
	UImage* Image1; // 0x290
	UImage* Image2; // 0x298
	UImage* Image3; // 0x2a0
	UTextBlock* Text_2; // 0x2a8
	UTextBlock* Text_3; // 0x2b0
	UTextBlock* Text_4; // 0x2b8
	UWBP_FunctionalityInfo_C* WBP_FunctionalityInfo; // 0x2c0
	UWBP_FunctionalityMainButton_C* WBP_FunctionalityMainButton; // 0x2c8
	UWBP_Slot_Display_C* WBP_Slot_Display; // 0x2d0
	UWBP_Slot_Display_C* WBP_Slot_Display_2; // 0x2d8
	UWBP_Slot_Display_C* WBP_Slot_Display_3; // 0x2e0
	ABP_HologramTrapBuildPartBase_C* Hologram Build Part Base; // 0x2e8
};

struct UBTTask_ResetAIPerception_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
};

struct UWBP_Main_Mail_Listing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_1; // 0x268
	UBorder* Border_Ring; // 0x270
	UImage* Image_Item; // 0x278
	UImage* Image_New; // 0x280
	UImage* Image_Selected; // 0x288
	UTextBlock* title; // 0x290
	UWBP_UI_ListingHovering_C* WBP_UI_ListingHovering; // 0x298
	FMulticastInlineDelegate OnMailClicked; // 0x2a0
	FMailData MailMessage; // 0x2b0
	int32_t Index; // 0x338
	UWBP_Main_MailSystem_C* MailSystem; // 0x340
	bool bItem; // 0x348
	bool bUnopened; // 0x349
};

struct UWBP_RetrieverRegisterSlot_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border; // 0x268
	UImage* Image_HoverTint; // 0x270
	UImage* Image_Item; // 0x278
	UTextBlock* Text_Index; // 0x280
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x288
	int32_t UID; // 0x290
	int32_t SlotIndex; // 0x294
	FMulticastInlineDelegate DragItem; // 0x298
	bool bInteractionSlot; // 0x2a8
};

struct UBrushBuilder : UObject {
	FString BitmapFilename; // 0x28
	FString Tooltip; // 0x38
	char NotifyBadParams : 1; // 0x48
	TArray<FVector> Vertices; // 0x50
	TArray<FBuilderPoly> Polys; // 0x60
	FName Layer; // 0x70
	char MergeCoplanars : 1; // 0x78
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x1f8
	char bSupportsDepth : 1; // 0x1f8
	char bNoAlphaChannel : 1; // 0x1f8
	UTexture* Texture; // 0x200
	UTexture* LeftTexture; // 0x208
	char bQuadPreserveTextureRatio : 1; // 0x210
	FVector2D QuadSize; // 0x214
	FBox2D UVRect; // 0x21c
	float CylinderRadius; // 0x230
	float CylinderOverlayArc; // 0x234
	int32_t CylinderHeight; // 0x238
	FEquirectProps EquirectProps; // 0x23c
	EStereoLayerType StereoLayerType; // 0x284
	EStereoLayerShape StereoLayerShape; // 0x285
	UStereoLayerShape* Shape; // 0x288
	int32_t Priority; // 0x290
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UAsyncActionHandleSaveGame : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
	USaveGame* SaveGameObject; // 0x60
};

struct UGeometryCollectionComponent : UMeshComponent {
	AChaosSolverActor* ChaosSolverActor; // 0x470
	UGeometryCollection* RestCollection; // 0x558
	TArray<AFieldSystemActor*> InitializationFields; // 0x560
	bool Simulating; // 0x570
	EObjectStateTypeEnum ObjectType; // 0x578
	bool EnableClustering; // 0x579
	int32_t ClusterGroupIndex; // 0x57c
	int32_t MaxClusterLevel; // 0x580
	TArray<float> DamageThreshold; // 0x588
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x598
	int32_t CollisionGroup; // 0x59c
	float CollisionSampleFraction; // 0x5a0
	float LinearEtherDrag; // 0x5a4
	float AngularEtherDrag; // 0x5a8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0x5b0
	EInitialVelocityTypeEnum InitialVelocityType; // 0x5b8
	FVector InitialLinearVelocity; // 0x5bc
	FVector InitialAngularVelocity; // 0x5c8
	UPhysicalMaterial* PhysicalMaterialOverride; // 0x5d8
	FGeomComponentCacheParameters CacheParameters; // 0x5e0
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsStateChange; // 0x630
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsLoadingStateChange; // 0x640
	FMulticastInlineDelegate OnChaosBreakEvent; // 0x668
	float DesiredCacheTime; // 0x678
	bool CachePlayback; // 0x67c
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x680
	bool bNotifyBreaks; // 0x690
	bool bNotifyCollisions; // 0x691
	bool bEnableReplication; // 0x692
	bool bEnableAbandonAfterLevel; // 0x693
	int32_t ReplicationAbandonClusterLevel; // 0x694
	FGeometryCollectionRepData RepData; // 0x698
	UBodySetup* DummyBodySetup; // 0x8c8
};

struct ABP_SurvivalPlayerController_C : ABP_SVChatController_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x610
	UWorldCollisionToggleByDistanceComponent* WorldCollisionToggleByDistance; // 0x618
	UBP_WidgetIndicatorManager_C* BP_WidgetIndicatorManager; // 0x620
	UBP_VehicleHandleComponent_C* BP_VehicleHandleComponent; // 0x628
	UBP_TutorialHandler_C* BP_TutorialHandler; // 0x630
	UBP_IngamePopupUIManager_C* BP_IngamePopupUIManager; // 0x638
	UAkComponent* BGMObject; // 0x640
	UAIPerceptionStimuliSourceComponent* AIPerceptionStimuliSource; // 0x648
	UObjectiveSystemManagerComponent_C* ObjectiveComponent; // 0x650
	UBP_FunctionalityHandleComponent_C* BP_FunctionalityHandleComponent; // 0x658
	UBP_LandmarkHandleComponent_C* BP_LandmarkHandleComponent; // 0x660
	UC_Manager-RespawnMap_C* C_Manager-RespawnMap; // 0x668
	UC_Manager-Compass_C* C_Manager-Compass; // 0x670
	UC_Manager-WorldMap_C* C_Manager-WorldMap; // 0x678
	UC_Manager-LocalMap_C* C_Manager-LocalMap; // 0x680
	UQuestMapManager_C* QuestMapManager; // 0x688
	bool IsCharacterInitLoadingFinished; // 0x690
	int32_t TimeOutCount; // 0x694
	UBP_PlayerInventoryComponent_C* PlayerInventoryComponent; // 0x698
	int32_t MouseVisibilityStack; // 0x6a0
	FString CachedNickName; // 0x6a8
	UWBP_AdminConsole_C* AdminConsoleUI; // 0x6b8
	FTimerHandle JumpTimerHandle; // 0x6c0
	BP_SV_Ultra_Dynamic_Sky_C* UltraDynamicSky; // 0x6c8
	bool IsShowPremissionArea; // 0x6d0
	bool bShowOtherPlayerHP; // 0x6d1
	bool bShowBulletTrace; // 0x6d2
	bool RecievePossesedLoc; // 0x6d3
	UWBP_System_C* SystemUI; // 0x6d8
	bool IsShowSystemMenu; // 0x6e0
	FVector PossesLoc; // 0x6e4
	bool ShowAIStateMark; // 0x6f0
	TArray<FS_SurvivalRank> SavedRank; // 0x6f8
	FMulticastInlineDelegate OnNotifyRankInfoUpdate; // 0x708
	bool IsFirstJoin; // 0x718
	float LastRecieveRefreshRankTime; // 0x71c
	bool EnableSaveDummyData; // 0x720
	bool LoadedDummyData; // 0x721
	FString SaveDataName; // 0x728
	int32_t NumDummyMovementSeq; // 0x738
	int32_t NumDummyOtherSeq; // 0x73c
	int32_t SaveDummyHoldable; // 0x740
	UDummySequenceAsset* DummyDataAsset; // 0x748
	UAkAudioEvent* CurrentBGMStopEvent; // 0x750
	UAkAudioEvent* CurrentBGMPlayEvent; // 0x758
	TArray<FS_BGMInfo> BGMQueue; // 0x760
	bool SUPERPOWER; // 0x770
	FMulticastInlineDelegate OnDummyPlayComplete; // 0x778
	bool ShowRadiogramIdx; // 0x788
	float LastJoinTime; // 0x78c
	TArray<ABP_LandmarkZone_C*> LastBGMZones; // 0x790
	UWBP_HUD_WakeUp_C* WakeupWidget; // 0x7a0
	float DamageMultiplier; // 0x7a8
	TMap<FString, float> RequestTime; // 0x7b0
	FMulticastInlineDelegate OnNotifyReceivePlayerSummaryInfo; // 0x800
	float RequestInterval; // 0x810
	TMap<FString, FS_PlayerInfoSummary> CachedPlayerSummary; // 0x818
	bool IsCtrlMouseVisible; // 0x868
	FMulticastInlineDelegate GetAllUserNickWithUIDFromServer; // 0x870
	ABP_WorldMapPivot_C* WorldPivotActor; // 0x880
	bool bIsShowStability; // 0x888
	UWBP_Popup_ForbiddenNick_C* BanNickWidget; // 0x890
	bool GodPierce; // 0x898
	bool TestEndSequence; // 0x899
	FMulticastInlineDelegate OnRecvNickname; // 0x8a0
	UWBP_EscapeNotifcation_C* EscapeWidget; // 0x8b0
	float LastEscapeTime; // 0x8b8
	FFloatValueFromDataTable EscapeCoolTime; // 0x8c0
	FS_RetrieveSystemInfo RetrieveRegisterInfo; // 0x8e8
	FMulticastInlineDelegate OnRecvRetrieveSystem; // 0x900
	FS_MachineArmAbilitySave MachineArmAbilitySave; // 0x910
	FMulticastInlineDelegate OnUpdateMachineArmAbilityInfo; // 0x960
	APawn* PrevPawn; // 0x970
	FS_SurvivalRank My Rank; // 0x978
	BP_MasterCharacter_C* LogoutCharacter; // 0x9b8
	TArray<int32_t> CraftNotifyList; // 0x9c0
	TArray<int32_t> ReserveCraftNotifyList; // 0x9d0
	TArray<E_DummyClientSupportFeature> DummyClientPendingJobQueue; // 0x9e0
	E_DummyClientSupportFeature CurrentDummyClientJob; // 0x9f0
	int32_t CurrentDummyClientJobIdx; // 0x9f4
	int32_t QualityIndex; // 0x9f8
	int32_t ForceLODIndex; // 0x9fc
	TArray<int32_t> TempArray; // 0xa00
	int32_t Idx; // 0xa10
	float TempAmbient; // 0xa14
	float TempEffect; // 0xa18
	float TempMusic; // 0xa1c
	float TempUI; // 0xa20
	float TempVoice; // 0xa24
	int32_t MuteSoundCallCount; // 0xa28
	FUserTerraPointInfo UserTerraPointInfo; // 0xa30
	FMulticastInlineDelegate OnNotifyTerraPointChanged; // 0xa58
	FMulticastInlineDelegate OnResponseBuyMerchandise; // 0xa68
	FMulticastInlineDelegate OnNotifyRecvTerraPointInfo; // 0xa78
	FMulticastInlineDelegate OnCallPossess; // 0xa88
	FMulticastInlineDelegate OnCallUnPossess; // 0xa98
	FMulticastInlineDelegate OnNotifyEnableJointCollision; // 0xaa8
	bool IsReceiveDailyMerchandise; // 0xab8
	FMulticastInlineDelegate OnNotifyRecvNewDailyInfo; // 0xac0
	bool IsTalking; // 0xad0
	FMulticastInlineDelegate OnVoiceInputMuted; // 0xad8
	FMulticastInlineDelegate OnVivoxUserTalkingStateChanged_TeamChannel; // 0xae8
	FMulticastInlineDelegate OnVivoxUserTalkingStateChanged_AreaChannel; // 0xaf8
	FMulticastInlineDelegate OnUnlockAreaVoice; // 0xb08
	int32_t RemoveTeamIndex; // 0xb18
	FIntValueFromDataTable MaxTeamSize; // 0xb20
	FS_SaveTeamInfo EmptyTeamsInfo; // 0xb48
	FTeamMemberInfo EmptyTeamMemberInfo; // 0xb88
};

struct ABP_MasterResource_C : AResourceBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UBP_CollisionByDistanceComponent_C* BP_CollisionByDistanceComponent; // 0x280
	USceneComponent* SceneRoot; // 0x288
	UAkComponent* ImmediatleyGatherSound; // 0x290
	UStaticMeshComponent* Resource Mesh; // 0x298
	float DisappearTimeline_Opacity_5D78CA5847C6324F263A1CB4E77FAF2C; // 0x2a0
	ETimelineDirection DisappearTimeline__Direction_5D78CA5847C6324F263A1CB4E77FAF2C; // 0x2a4
	UTimelineComponent* DisappearTimeline; // 0x2a8
	float AppearTimeline_Opacity_948F1DD1431C6446E142E9AE23C0966A; // 0x2b0
	ETimelineDirection AppearTimeline__Direction_948F1DD1431C6446E142E9AE23C0966A; // 0x2b4
	UTimelineComponent* AppearTimeline; // 0x2b8
	int32_t Resources; // 0x2c0
	float Respawn Time; // 0x2c4
	bool No Respawn; // 0x2c8
	bool Resource Can Respawn; // 0x2c9
	FText Name; // 0x2d0
	UStaticMesh* ChildActorComponentMesh; // 0x2e8
	bool bUsedChildActorComponent; // 0x2f0
	bool bPlacedLevel; // 0x2f1
	TArray<FS_ResourceVisibleComponents> VisibleComponentsForResources; // 0x2f8
	TArray<UPrimitiveComponent*> CurrentVisibleMeshes; // 0x308
	bool SmoothAppear; // 0x318
	FResourceInfo ResourceData; // 0x320
	bool IsImmediatleyHarvesting; // 0x398
	float HarvestableDistance; // 0x39c
	bool Initialized; // 0x3a0
	ABP_ActorSpawnManager_C* ActorSpawnManager; // 0x3a8
	ABP_ActorSpawnSpot_C* TargetActorSpot; // 0x3b0
	UTexture* Value; // 0x3b8
	bool ApplyUnderSurfaceMaterial; // 0x3c0
	UBP_WidgetIndicatorComponent_C* TutorialIndicator; // 0x3c8
	TArray<int32_t> TutorialIndicatorVisibleStep; // 0x3d0
	FVector TutorialWidgetIndicatorRelativeLoc; // 0x3e0
	TMap<FString, int32_t> GatherData; // 0x3f0
};

struct UBP_WidgetIndicatorComponentHasIndex_C : UBP_WidgetIndicatorComponent_C {
	int32_t CustomIndex; // 0x618
};

struct UParticleModuleSizeScaleBySpeed : UParticleModuleSizeBase {
	FVector2D SpeedScale; // 0x30
	FVector2D MaxScale; // 0x38
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> queryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct APlayerStart : ANavigationObjectBase {
	FName PlayerStartTag; // 0x248
};

struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	FSourceEffectChorusSettings Settings; // 0x108
};

struct ULocalizedOverlays : UOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct ABP_TurretBase_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UCapsuleComponent* CollisionCapsule; // 0x228
	UBP_HitNotifyComponent_C* BP_HitNotifyComponent; // 0x230
	USceneComponent* FireOffset; // 0x238
	USphereComponent* DetectRange; // 0x240
	UParticleSystemComponent* DestroyParticle; // 0x248
	USkeletalMeshComponent* TurretSkelMesh; // 0x250
	USceneComponent* Scene; // 0x258
	TArray<ASurvivalCharacterBase*> InCharacter; // 0x260
	FRotator NewTargetRotation; // 0x270
	TArray<ASurvivalCharacterBase*> ExcutionTarget; // 0x280
	ASurvivalCharacterBase* CurrentTarget; // 0x290
	bool CanShoot; // 0x298
	FText TurretName; // 0x2a0
	E_TurretAttackMode TurretAttackMode; // 0x2b8
	bool IsSwitchedOn; // 0x2b9
	TArray<FString> AllyUID; // 0x2c0
	AActor* CommandActor; // 0x2d0
	ABP_MasterProjectile_C* ProjectileClass; // 0x2d8
	float FireDelay; // 0x2e0
	FMulticastInlineDelegate OnFire; // 0x2e8
	UCurveFloat* DropCurve; // 0x2f8
	UCurveFloat* DamageCurve; // 0x300
	FRotator RotateOffset; // 0x308
	float TargetYaw; // 0x314
	float TargetPitch; // 0x318
	bool bUseAnimBP; // 0x31c
	FFloatRange PitchClamp; // 0x320
	float DetectRangeValue; // 0x330
	float Deviation; // 0x334
	TSet<E_HitboxType> TracableHitBox; // 0x338
	bool IsFirstShoot; // 0x388
	float FirstTraceShootDelay; // 0x38c
	float RotationAlpha; // 0x390
	FDamageStruct DamageStruct; // 0x398
	int32_t ShotCountForOne; // 0x3d0
	float HP; // 0x3d4
	bool Dead; // 0x3d8
	FMulticastInlineDelegate OnDead; // 0x3e0
	float DestroyTime; // 0x3f0
	bool bAttackAI; // 0x3f4
	bool TempHasWeapon; // 0x3f5
	UAnimMontage* FireAnimMontage; // 0x3f8
};

struct UMaterialExpressionArccosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UWBP_Radiogram_1010105_C : UUserWidget {
	UWBP_RadiogramBase_C* Radiogram_Base; // 0x260
	UWBP_RadiogramListing_C* WBP_RadiogramListing; // 0x268
	UWBP_RadiogramListing_C* WBP_RadiogramListing_2; // 0x270
};

struct UPhysicsSpringComponent : USceneComponent {
	float SpringStiffness; // 0x1f8
	float SpringDamping; // 0x1fc
	float SpringLengthAtRest; // 0x200
	float SpringRadius; // 0x204
	ECollisionChannel SpringChannel; // 0x208
	bool bIgnoreSelf; // 0x209
	float SpringCompression; // 0x20c
};

struct UWBP_Slot_Quick_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border; // 0x268
	UBorder* Border_Index; // 0x270
	UImage* Image_Selected; // 0x278
	UImage* Image_Selected_2; // 0x280
	UTextBlock* Text_Index; // 0x288
	UWBP_UI_SlotHovering_C* WBP_UI_SlotHovering; // 0x290
	bool Mouse Over; // 0x298
	FItemInventory Item; // 0x2a0
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2d8
	FVector2D Icon Image Size; // 0x2e0
	float Tooltip Delay; // 0x2e8
	bool Selected; // 0x2ec
	bool Allow Selection; // 0x2ed
	UWBP_Tooltip_C* Tooltip Widget; // 0x2f0
	int32_t Slot Number; // 0x2f8
	bool IsDoubleClick; // 0x2fc
	EQuickSlotType Type; // 0x2fd
	int32_t RegisterNum; // 0x300
	UWBP_Slot_Inventory_C* InventorySlot; // 0x308
	UWBP_Slot_Equipment_C* ProtocolSlot; // 0x310
	int32_t MyPresetIdx; // 0x318
	UBP_GameSettings_C* Game Settings; // 0x320
};

struct UWBP_Main_MachineArmListing_L_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button; // 0x268
	UImage* Image_Blink; // 0x270
	UImage* Image_Selected; // 0x278
	UTextBlock* TextBlock_40; // 0x280
	UWBP_UI_Alert_C* WBP_UI_Alert; // 0x288
	FS_MachineArmAbilityInfo Data; // 0x290
	FMulticastInlineDelegate OnClickedTopCategory; // 0x2c0
	int32_t MainIdx; // 0x2d0
	bool bAlert; // 0x2d4
};

struct UGameNetworkManagerSettings : UObject {
	int32_t MinDynamicBandwidth; // 0x28
	int32_t MaxDynamicBandwidth; // 0x2c
	int32_t TotalNetBandwidth; // 0x30
	int32_t BadPingThreshold; // 0x34
	char bIsStandbyCheckingEnabled : 1; // 0x38
	float StandbyRxCheatTime; // 0x3c
	float StandbyTxCheatTime; // 0x40
	float PercentMissingForRxStandby; // 0x44
	float PercentMissingForTxStandby; // 0x48
	float PercentForBadPing; // 0x4c
	float JoinInProgressStandbyWaitTime; // 0x50
};

struct USpotEventsAsset : UDataAsset {
	FText Description; // 0x30
	TArray<FSpotEventData> Events; // 0x48
};

struct UAkWwiseTreeSelector : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UMaterialExpressionAntialiasedTextureMask : UMaterialExpressionTextureSampleParameter2D {
	float Threshold; // 0x80
	ETextureColorChannel Channel; // 0x84
};

struct UBlueprintCore : UObject {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	FGuid BlueprintGuid; // 0x3c
};

struct UParticleModuleLocationPrimitiveSphere : UParticleModuleLocationPrimitiveBase {
	FRawDistributionFloat StartRadius; // 0xb0
};

struct UCloudWatchEnableAlarmActions : UAwsCloudWatchAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct USoundfieldEndpointSubmix : USoundSubmixBase {
	FName SoundfieldEndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	USoundfieldEndpointSettingsBase* EndpointSettings; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x58
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x60
};

struct UDataAsset : UObject {
	UDataAsset* NativeClass; // 0x28
};

struct UHapticFeedbackEffect_Buffer : UHapticFeedbackEffect_Base {
	TArray<char> Amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UGizmoArrowComponent : UGizmoBaseComponent {
	FVector Direction; // 0x460
	float Gap; // 0x46c
	float Length; // 0x470
	float Thickness; // 0x474
};

struct UMaterialExpressionFeatureLevelSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
};

struct UMovementComponent : UActorComponent {
	USceneComponent* UpdatedComponent; // 0xb0
	UPrimitiveComponent* UpdatedPrimitive; // 0xb8
	FVector Velocity; // 0xc4
	FVector PlaneConstraintNormal; // 0xd0
	FVector PlaneConstraintOrigin; // 0xdc
	char bUpdateOnlyIfRendered : 1; // 0xe8
	char bAutoUpdateTickRegistration : 1; // 0xe8
	char bTickBeforeOwner : 1; // 0xe8
	char bAutoRegisterUpdatedComponent : 1; // 0xe8
	char bConstrainToPlane : 1; // 0xe8
	char bSnapToPlaneAtStart : 1; // 0xe8
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xe8
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb
};

struct ABP_ActorSpawner_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
	FName GroupName; // 0x230
	FS_ResourceGroup SpawnerInfo; // 0x238
	TArray<float> RequestQueue; // 0x260
	bool IsTimerWorking; // 0x270
	TArray<ABP_ActorSpawnSpot_C*> ResourceSpotArray; // 0x278
	TMap<ABP_ActorSpawnSpot_C*, AActor*> WorkingSpot; // 0x288
	TMap<AActor*, int32_t> SpawnCount; // 0x2d8
	ABP_ActorSpawnManager_C* Manager; // 0x328
	int32_t DelayedCount; // 0x330
	UCurveFloat* RespawnMultiplyByPlayerCount; // 0x338
	bool BeingRespawn; // 0x340
	FTimerHandle TimerHandle; // 0x348
	FVector TotalLoc; // 0x350
	FFloatValueFromDataTable ResourceRegenMultiplier; // 0x360
	float CurrentTimerTime; // 0x388
	bool FirstSpawning; // 0x38c
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UMagicLeapMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x200
	bool ScanWorld; // 0x210
	EMagicLeapMeshType MeshType; // 0x211
	UBoxComponent* BoundingVolume; // 0x218
	EMagicLeapMeshLOD LevelOfDetail; // 0x220
	float PerimeterOfGapsToFill; // 0x224
	bool Planarize; // 0x228
	float DisconnectedSectionArea; // 0x22c
	bool RequestNormals; // 0x230
	bool RequestVertexConfidence; // 0x231
	EMagicLeapMeshVertexColorMode VertexColorMode; // 0x232
	TArray<FColor> BlockVertexColors; // 0x238
	FLinearColor VertexColorFromConfidenceZero; // 0x248
	FLinearColor VertexColorFromConfidenceOne; // 0x258
	bool RemoveOverlappingTriangles; // 0x268
	UMRMeshComponent* MRMesh; // 0x270
	int32_t BricksPerFrame; // 0x278
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	bool bRestrictCrossConsole; // 0x50
	bool bEnableRemovalRequests; // 0x51
	TArray<FPartyReservation> Reservations; // 0x58
};

struct USVCH_Male_ModelViewer_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2c8
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x348
	FAnimNode_Root AnimGraphNode_Root; // 0x3c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3f0
	bool IsActionState; // 0x490
	bool IsFocusingParts; // 0x491
};

struct ABP_Juggernaut_Hover_C : ACommonAI_BaseAICharacter_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe28
	UParticleSystemComponent* DeathEffect; // 0xe30
	UArrowComponent* Arrow3; // 0xe38
	bool IsPlaySpawnAnimation; // 0xe40
	bool IsHovering; // 0xe41
	bool IsPlayDeathEffect; // 0xe42
	bool IsReturnToSpawnPoint; // 0xe43
	bool IsArriveToSpawnPoint; // 0xe44
	AActor* spawner; // 0xe48
	bool IsVisibility; // 0xe50
};

struct USQSAddPermission : UAwsSQSAsync {
	FMulticastInlineDelegate Callback; // 0x30
};

struct UBST_CharacterActionNotifyTask_C : UBP_SkillActionTaskBase_C {
	int32_t TriggerRepeatCount; // 0xc4
	TArray<E_EventNotifyList> DispatchEvent; // 0xc8
	int32_t TriggerCount; // 0xd8
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct UWBP_Main_Inventory_External_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_MainFrame_C* BP_UI_Inventory; // 0x268
	UWBP_MainFrame_C* BP_UI_Player; // 0x270
	UWBP_Slot_Equipment_C* ChestEquipmentSlot; // 0x278
	UWBP_Slot_Equipment_C* FeetEquipmentSlot; // 0x280
	UWBP_Slot_Equipment_C* HeadEquipmentSlot; // 0x288
	UImage* Image_50; // 0x290
	UUniformGridPanel* InventoryGrid; // 0x298
	UWBP_Slot_Equipment_C* LegsEquipmentSlot; // 0x2a0
	UWBP_Slot_Equipment_C* Memory1EquipmentSlot; // 0x2a8
	UWBP_Slot_Equipment_C* Memory2EquipmentSlot; // 0x2b0
	UWBP_Slot_Equipment_C* Memory3EquipmentSlot; // 0x2b8
	UWBP_Slot_Equipment_C* Memory4EquipmentSlot; // 0x2c0
	UWBP_Slot_Equipment_C* Protocol1EquipmentSlot; // 0x2c8
	UWBP_Slot_Equipment_C* Protocol2EquipmentSlot; // 0x2d0
	UScrollBox* ScrollBox_Log; // 0x2d8
	UTextBlock* Text_SurvivalDays; // 0x2e0
	UTextBlock* TextBlock_76; // 0x2e8
	UWBP_Button_UI_C* WBP_Button_UI; // 0x2f0
	UWBP_Functionality_ItemLogListing_C* WBP_Functionality_ItemLogListing_2; // 0x2f8
	UWBP_FunctionalityInfo_C* WBP_FunctionalityInfo; // 0x300
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header; // 0x308
	UWBP_MainFrame_Header_C* WBP_MainFrame_Header_118; // 0x310
	UWidgetSwitcher* WidgetSwitcher_Info; // 0x318
	UWrapBox* WrapBox_Storage; // 0x320
	USpacer* WS_Info_Empty; // 0x328
	UOverlay* WS_Info_Player; // 0x330
	UOverlay* WS_Info_StorageBuildPart; // 0x338
	bool DragEnabled; // 0x340
	bool IsMouseButtonDown; // 0x341
	FVector2D LastMousePosition; // 0x344
	bool IsDrag; // 0x34c
	UCanvasPanelSlot* ParentSlot; // 0x350
	float SafetyZoneY; // 0x358
	float SafetyZoneX; // 0x35c
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x360
	UWBP_HUD_C* Parent Widget; // 0x368
	TArray<UWBP_Slot_Inventory_C*> Inventory Slots; // 0x370
	int32_t Colums; // 0x380
	UBP_InventoryComponentBase_C* ConnectedInven; // 0x388
	FS_EquipmentSlot New Equipment; // 0x390
	TMap<UWBP_Slot_Equipment_C*, FS_EquipmentSlot> OccupationSlotList; // 0x3d0
};

struct UDatasmithMaterialInstanceTemplate : UDatasmithObjectTemplate {
	TSoftObjectPtr<UMaterialInterface> ParentMaterial; // 0x30
	TMap<FName, float> ScalarParameterValues; // 0x58
	TMap<FName, FLinearColor> VectorParameterValues; // 0xa8
	TMap<FName, TSoftObjectPtr<UTexture>> TextureParameterValues; // 0xf8
	FDatasmithStaticParameterSetTemplate StaticParameters; // 0x148
};

struct UMovieScenePrimitiveMaterialSection : UMovieSceneSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe8
};

struct UInterpTrackMove : UInterpTrack {
	FInterpCurveVector PosTrack; // 0x70
	FInterpCurveVector EulerTrack; // 0x88
	FInterpLookupTrack LookupTrack; // 0xa0
	FName LookAtGroupName; // 0xb0
	float LinCurveTension; // 0xb8
	float AngCurveTension; // 0xbc
	char bUseQuatInterpolation : 1; // 0xc0
	char bShowArrowAtKeys : 1; // 0xc0
	char bDisableMovement : 1; // 0xc0
	char bShowTranslationOnCurveEd : 1; // 0xc0
	char bShowRotationOnCurveEd : 1; // 0xc0
	char bHide3DTrack : 1; // 0xc0
	EInterpTrackMoveRotMode RotMode; // 0xc4
};

struct UAnimCompress_RemoveEverySecondKey : UAnimCompress {
	int32_t MinKeys; // 0x40
	char bStartAtSecondKey : 1; // 0x44
};

struct UWBP_Main_Landmark_RewardListing_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image; // 0x268
	UImage* Image_Tier; // 0x270
	int32_t Item ID; // 0x278
};

struct UChildConnection : UNetConnection {
	UNetConnection* Parent; // 0x1af0
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UTestMovieSceneSubTrack : UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct URMHttpRequest_Put_Client_Name : URMHttpRequestBase {
	FMulticastInlineDelegate OnSuccess; // 0x48
	FMulticastInlineDelegate OnFailure; // 0x58
};

struct ABP_LandmarkMonster_C : ACommonAI_BaseAICharacter_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe28
	float Time_LungeTarget_JumpHeight_7ECFC6164963E248D2D7CC95E033DD99; // 0xe30
	float Time_LungeTarget_MoveAlpha_7ECFC6164963E248D2D7CC95E033DD99; // 0xe34
	ETimelineDirection Time_LungeTarget__Direction_7ECFC6164963E248D2D7CC95E033DD99; // 0xe38
	UTimelineComponent* Time_LungeTarget; // 0xe40
	TArray<BP_SurvivalCharacter_C*> AttackedCharacter; // 0xe48
	FTimerHandle AttackStateTimer; // 0xe58
	FVector HitLocation; // 0xe60
	FVector CurrentLocationForLunge; // 0xe6c
	FVector TempLocation; // 0xe78
	AController* KillerController; // 0xe88
	bool bIgnoreNearPlayer; // 0xe90
	TArray<BP_SurvivalCharacter_C*> NearPlayers; // 0xe98
};

struct UCustomizableSkeletalComponent : USceneComponent {
	float SkippedLastRenderTime; // 0x1fc
	UCustomizableObjectInstance* CustomizableObjectInstance; // 0x200
};

struct UBP_UnlcokEscapeCode_C : UBP_MachineArmAbilityObjectBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x40
};

struct ABP_WorldEndDust_fx_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UParticleSystemComponent* P_WorldEnd_Dust2; // 0x228
	USphereComponent* Sphere; // 0x230
	bool FollowPlayer; // 0x238
	float Height; // 0x23c
	float DropletTime; // 0x240
	float EffectAlpha; // 0x244
	float TrailAlpha; // 0x248
	float Volume; // 0x24c
	BP_SurvivalCharacter_C* FollowCharacter; // 0x250
	FVector CentralLocation; // 0x258
	float Radius; // 0x264
};

struct ULowEntryBitDataReader : UObject {
	TArray<char> Bytes; // 0x28
	int32_t Position; // 0x38
	char CurrentByte; // 0x3c
	int32_t CurrentBytePosition; // 0x40
};

struct UFieldSystemMetaDataIteration : UFieldSystemMetaData {
	int32_t Iterations; // 0xb0
};

struct UGeometryCacheComponent : UMeshComponent {
	UGeometryCache* GeometryCache; // 0x468
	bool bRunning; // 0x470
	bool bLooping; // 0x471
	float StartTimeOffset; // 0x474
	float PlaybackSpeed; // 0x478
	int32_t NumTracks; // 0x47c
	float ElapsedTime; // 0x480
	float Duration; // 0x4b4
	bool bManualTick; // 0x4b8
};

struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x268
	float DamagePerSec; // 0x26c
	UDamageType* DamageType; // 0x270
	float PainInterval; // 0x278
	char bEntryPain : 1; // 0x27c
	char BACKUP_bPainCausing : 1; // 0x27c
	AController* DamageInstigator; // 0x280
};

struct UNiagaraEmitter : UObject {
	bool bLocalSpace; // 0x28
	bool bDeterminism; // 0x29
	int32_t RandomSeed; // 0x2c
	EParticleAllocationMode AllocationMode; // 0x30
	int32_t PreAllocationCount; // 0x34
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x38
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x60
	ENiagaraSimTarget SimTarget; // 0x88
	FBox FixedBounds; // 0x8c
	int32_t MinDetailLevel; // 0xa8
	int32_t MaxDetailLevel; // 0xac
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0xb0
	FNiagaraPlatformSet Platforms; // 0xc8
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0xf8
	char bInterpolatedSpawning : 1; // 0x108
	char bFixedBounds : 1; // 0x108
	char bUseMinDetailLevel : 1; // 0x108
	char bUseMaxDetailLevel : 1; // 0x108
	char bOverrideGlobalSpawnCountScale : 1; // 0x108
	char bRequiresPersistentIDs : 1; // 0x108
	char bCombineEventSpawn : 1; // 0x108
	float MaxDeltaTimePerTick; // 0x10c
	uint32_t DefaultShaderStageIndex; // 0x110
	uint32_t MaxUpdateIterations; // 0x114
	TSet<uint32_t> SpawnStages; // 0x118
	char bSimulationStagesEnabled : 1; // 0x168
	char bDeprecatedShaderStagesEnabled : 1; // 0x168
	char bLimitDeltaTime : 1; // 0x168
	FString UniqueEmitterName; // 0x170
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x180
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x190
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1a0
	UNiagaraScript* GPUComputeScript; // 0x1b0
	TArray<FName> SharedEventGeneratorIds; // 0x1b8
};

struct UWBP_HUD_Fake_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* InventorySlotBorder; // 0x268
	bool Mouse Over; // 0x270
	FItemInventory Item; // 0x278
	UBP_PlayerInventoryComponent_C* Inventory Component; // 0x2b0
	float Tooltip Delay; // 0x2b8
	UWBP_Tooltip_C* Tooltip Widget; // 0x2c0
	bool Controllable; // 0x2c8
	FText TextTooltip; // 0x2d0
	bool Is Text Only; // 0x2e8
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct UBTTask_RangeAttackOther_Juggernaut_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	float DelayTime; // 0xb0
	FBlackboardKeySelector IsRangeAttackOther; // 0xb8
	FBlackboardKeySelector TargetActor; // 0xe0
	FVector BackMoveLocation; // 0x108
	FBlackboardKeySelector IsSelectAttackType; // 0x118
	FBlackboardKeySelector IsRangeAttack; // 0x140
	FBlackboardKeySelector IsMeleeAttack; // 0x168
	FBlackboardKeySelector IsWalkingAttack; // 0x190
	FBlackboardKeySelector IsExecutionAttack; // 0x1b8
};

struct UNPCTeamComponent : UActorComponent {
	bool Friendly_Player; // 0xb0
	bool Friendly_Robot; // 0xb1
	bool Friendly_Askr; // 0xb2
	bool Friendly_Pioneer; // 0xb3
	bool Friendly_Hyena; // 0xb4
	bool Friendly_Helbine; // 0xb5
	bool Friendly_Creature; // 0xb6
	bool Friendly_Union; // 0xb7
	char MyTeam; // 0xb8
};

struct UInputAxisKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x28
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x48
	float DelayMax; // 0x4c
};

struct UHLODProxy : UObject {
	TArray<FHLODProxyMesh> ProxyMeshes; // 0x28
	TMap<UHLODProxyDesc*, FHLODProxyMesh> HLODActors; // 0x38
};

struct UAnimationAsset : UObject {
	USkeleton* Skeleton; // 0x38
	TArray<UAnimMetaData*> MetaData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct USurvivalVehicleSyncComponent : UActorComponent {
	float MinReliableCorrectionInterval; // 0xb8
	float MinCorrectionInterval; // 0xc0
	float SendingToServerIntervalAtClient; // 0xc8
	float CorrectionIntervalAtClient; // 0xd0
	float FrameLimit_CorrectionIntervalAtClient; // 0x170
};

struct UWB_AdminTools_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button; // 0x268
	UButton* Button_ApplyNotice; // 0x270
	UButton* Button_CopyUserID; // 0x278
	UButton* Button_PVEDamage; // 0x280
	UButton* Button_PVP; // 0x288
	UButton* Button_Rain; // 0x290
	UButton* Button_Tag_Change; // 0x298
	UButton* Button_Tag_Toggle; // 0x2a0
	UButton* Button_User_Chat_1; // 0x2a8
	UButton* Button_User_Chat_2; // 0x2b0
	UButton* Button_User_Chat_11; // 0x2b8
	UButton* Button_User_Chat_61; // 0x2c0
	UButton* Button_User_Chat_Ban; // 0x2c8
	UButton* Button_User_ChatLog; // 0x2d0
	UButton* Button_User_CheatTerget; // 0x2d8
	UButton* Button_User_Delete; // 0x2e0
	UButton* Button_User_Server_1; // 0x2e8
	UButton* Button_User_Server_2; // 0x2f0
	UButton* Button_User_Server_11; // 0x2f8
	UButton* Button_User_Server_61; // 0x300
	UButton* Button_User_Server_Ban; // 0x308
	UButton* Button_User_ToMe; // 0x310
	UButton* Button_User_ToUser; // 0x318
	UButton* Button_User_ToUser_2; // 0x320
	UComboBoxString* ComboBox_NoticeIndex; // 0x328
	UEditableText* EditableText_NameTag; // 0x330
	UEditableTextBox* EditableTextBox_ChatMins; // 0x338
	UEditableTextBox* EditableTextBox_ServerMins; // 0x340
	UImage* Image_4; // 0x348
	UImage* Image_5; // 0x350
	UImage* Image_6; // 0x358
	UImage* Image_48; // 0x360
	UImage* Image_131; // 0x368
	UImage* Image_PVPDisabled; // 0x370
