// Created by BlueFire1337
// Updated 2021-12-07
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x3e33c00;
	constexpr auto GObjects = 0x3e4c5f0;
	constexpr auto GWorld = 0x3f8ddb0;
}

struct UAIPerceptionSystem : UAISubsystem {
	TArray<UAISense*> Senses; // 0x88
	float PerceptionAgingRate; // 0x98
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x790
};

struct AHLLMapData_HalfTrack : AHLLMapData_Vehicle {
	AMobileSpawn* LinkedSpawn; // 0x260
};

struct AHLLArmourWeapon_Ballistic : AHLLArmourWeapon {
	TArray<FZeroAngle> ZeroAngles; // 0x470
	char ZeroAngleIndex; // 0x480
	FBallisticShotID WeaponSeed; // 0x481
	FRepShot RepShot; // 0x484
	float ShotSpread; // 0x4a0
	UHLLBallisticsComponent_Vehicle* BallisticHandler; // 0x4a8
};

struct UShooterCharacterMovement : UCharacterMovementComponent {
	float MaxWalkSpeedADS; // 0x610
	float MaxWalkSpeedProne; // 0x614
	float MaxSprintSpeed; // 0x618
	float MaxSprintSpeedCrouched; // 0x61c
	float VaultingSpeed; // 0x620
	float ClimbingSpeed; // 0x624
	float BarbedWireMaxSpeed; // 0x628
	AShooterCharacter* m_owningCharacter; // 0x630
};

struct UHLLMainMenuBase : UUserWidget {
	char bCanZoom : 1; // 0x230
};

struct UGameNetworkManagerSettings : UObject {
	int32_t MinDynamicBandwidth; // 0x28
	int32_t MaxDynamicBandwidth; // 0x2c
	int32_t TotalNetBandwidth; // 0x30
	int32_t BadPingThreshold; // 0x34
	char bIsStandbyCheckingEnabled : 1; // 0x38
	float StandbyRxCheatTime; // 0x3c
	float StandbyTxCheatTime; // 0x40
	float PercentMissingForRxStandby; // 0x44
	float PercentMissingForTxStandby; // 0x48
	float PercentForBadPing; // 0x4c
	float JoinInProgressStandbyWaitTime; // 0x50
};

struct UGameMapsSettings : UObject {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct UWGT_GameMenuItem_C : UHLLMenuButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	URichTextBlock* RTxt_MenuText; // 0x278
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct UAREnvironmentCaptureProbe : UARTrackedGeometry {
	UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture; // 0xf8
};

struct AHLL_GameState_C : AShooterGameState {
	FPointerToUberGraphFrame UberGraphFrame; // 0x700
	USceneComponent* DefaultSceneRoot; // 0x708
	FMulticastInlineDelegate OnPlayerCountsChanged; // 0x710
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct UWGT_ReplenishAmmoNotification_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UWidgetAnimation* Pulse; // 0x238
	UWidgetAnimation* FadeInOut; // 0x240
	UImage* BG; // 0x248
	UImage* Icon; // 0x250
	UOverlay* Overlay; // 0x258
	FSlateBrush Image; // 0x260
	bool bForSupplies; // 0x2e8
};

struct UWGT_CosmeticItem_Large_V2_C : UHLLUI_CosmeticItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* Hover; // 0x280
	UImage* EquipedIndicator; // 0x288
	UBorder* SelectBorder; // 0x290
	bool bFocus; // 0x298
	FMulticastInlineDelegate OnCreateCosmeticButtons; // 0x2a0
};

struct UW_MapKey_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UHorizontalBox* HB_11; // 0x238
	UHorizontalBox* HB_01; // 0x240
	UHorizontalBox* HB_02; // 0x248
	UHorizontalBox* HB_03; // 0x250
	UHorizontalBox* HB_04; // 0x258
	UHorizontalBox* HB_06; // 0x260
	UHorizontalBox* HB_07; // 0x268
	UHorizontalBox* HB_08; // 0x270
	UHorizontalBox* HB_09; // 0x278
	UHorizontalBox* HB_Airhead; // 0x280
	UHorizontalBox* HB_FuelNode; // 0x288
	UHorizontalBox* HB_Halftrack; // 0x290
	UHorizontalBox* HB_HeavyTank; // 0x298
	UHorizontalBox* HB_LightTank; // 0x2a0
	UHorizontalBox* HB_Logi; // 0x2a8
	UHorizontalBox* HB_ManpowerNode; // 0x2b0
	UHorizontalBox* HB_MediumTank; // 0x2b8
	UHorizontalBox* HB_MunitionsNode; // 0x2c0
	UHorizontalBox* HB_Officer; // 0x2c8
	UHorizontalBox* HB_ReconVehicle; // 0x2d0
	UHorizontalBox* HB_TransportTruck; // 0x2d8
	UHorizontalBox* HorizontalBox_1; // 0x2e0
	UHorizontalBox* HorizontalBox_2; // 0x2e8
	UHorizontalBox* HorizontalBox_3; // 0x2f0
	UHorizontalBox* HorizontalBox_4; // 0x2f8
	UHorizontalBox* HorizontalBox_5; // 0x300
	UHorizontalBox* HorizontalBox_6; // 0x308
	UHorizontalBox* HorizontalBox_7; // 0x310
	UHorizontalBox* HorizontalBox_8; // 0x318
	UHorizontalBox* HorizontalBox_9; // 0x320
	UHorizontalBox* HorizontalBox_13; // 0x328
	UHorizontalBox* HorizontalBox_14; // 0x330
	UImage* Image_127; // 0x338
	UImage* Image_160; // 0x340
	UUniformGridPanel* Panel; // 0x348
	UScrollBox* ScrollBox_3; // 0x350
	UVerticalBox* VB_Title; // 0x358
	bool Key_Title; // 0x360
	UW_HoverToolTip_Explained_C* Widget_ExplainedTooltip; // 0x368
	int32_t Key_Columns; // 0x370
	FMulticastInlineDelegate ReInitialize Event Dispatcher; // 0x378
	TMap<MapKeys, FMapKey> KeyData; // 0x388
	UDataTable* MapKeyTable; // 0x3d8
	UWGT_OverviewMap_V2_C* ParentOverviewMap; // 0x3e0
};

struct UCompressedImageSequenceProtocol : UImageSequenceProtocol {
	int32_t CompressionQuality; // 0xd8
};

struct UHLLUI_Loadout : UUserWidget {
	TWeakObjectPtr<UHLLUI_LoadoutSelector> ParentSelector; // 0x230
	UImage* ItemIcon; // 0x238
	UTextBlock* ItemName; // 0x240
	char bIsSelected : 1; // 0x248
	char bIsUnlocked : 1; // 0x248
	char LoadoutID; // 0x249
	FSlateBrush DefaultIcon; // 0x250
};

struct AProneMechanicsTestLogic : AActor {
	AShooterCharacterT1* StandToCrouchChar; // 0x220
	AShooterCharacterT1* ProneToStandChar; // 0x228
	AShooterCharacterT1* ProneToCrouchChar; // 0x230
	AShooterCharacterT1* CantLeaveProneChar; // 0x238
	AShooterCharacterT1* CanLeaveProneToCrouchChar; // 0x240
	AShooterCharacterT1* ProneToSlopeChar; // 0x248
	AShooterCharacterT1* CrawlSlopeChar; // 0x250
};

struct AGameModeBase : AInfo {
	FString OptionsString; // 0x220
	AGameSession* GameSessionClass; // 0x230
	AGameStateBase* GameStateClass; // 0x238
	APlayerController* PlayerControllerClass; // 0x240
	APlayerState* PlayerStateClass; // 0x248
	AHUD* HUDClass; // 0x250
	APawn* DefaultPawnClass; // 0x258
	ASpectatorPawn* SpectatorClass; // 0x260
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x268
	AServerStatReplicator* ServerStatReplicatorClass; // 0x270
	AGameSession* GameSession; // 0x278
	AGameStateBase* GameState; // 0x280
	AServerStatReplicator* ServerStatReplicator; // 0x288
	FText DefaultPlayerName; // 0x290
	char bUseSeamlessTravel : 1; // 0x2a8
	char bStartPlayersAsSpectators : 1; // 0x2a8
	char bPauseable : 1; // 0x2a8
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x240
	TArray<UAssetUserData*> AssetUserData; // 0x250
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x270
};

struct ULandscapeWeightmapUsage : UObject {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x28
	FGuid LayerGuid; // 0x48
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x2c8
};

struct UMaterialExpressionArctangent2 : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct UGameplayTask_SpawnActor : UGameplayTask {
	FMulticastInlineDelegate Success; // 0x68
	FMulticastInlineDelegate DidNotSpawn; // 0x78
	AActor* ClassToSpawn; // 0xa0
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x220
	bool bAutoUpdateBounds; // 0x228
};

struct UParticleModuleLocationSkelVertSurface : UParticleModuleLocationBase {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct ARectLight : ALight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct USoundNodeDistanceDelay : USoundNode {
	float SpeedOfSound; // 0x48
	float BypassDistance; // 0x4c
	float MaxDelay; // 0x50
};

struct UHintsAndTips : UObject {
	TSoftObjectPtr<UDataTable> HintDataTable; // 0x28
	float MinDisplayTimeToComplete; // 0x50
	EHint CurrentHint; // 0x54
	int32_t CurrentHintPriority; // 0x58
	UDataTable* HintTable; // 0x70
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UHLLAnimNotify_CameraAnim : UAnimNotify {
	UCameraAnim* AnimToPlay; // 0x38
	float Scale; // 0x40
	float PlaySpeed; // 0x44
	float BlendInTime; // 0x48
	float BlendOutTime; // 0x4c
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UParticleModuleSpawn : UParticleModuleSpawnBase {
	FRawDistributionFloat Rate; // 0x38
	FRawDistributionFloat RateScale; // 0x68
	EParticleBurstMethod ParticleBurstMethod; // 0x98
	TArray<FParticleBurst> BurstList; // 0xa0
	FRawDistributionFloat BurstScale; // 0xb0
	char bApplyGlobalSpawnRateScale : 1; // 0xe0
};

struct ADynamicSpawn : AActor {
	FDynamicSpawnGatherParams SpawnGatherParams; // 0x288
	float WaveIntervalSeconds; // 0x29c
	AHLLPlatoon* m_owningPlatoon; // 0x2a0
	ETeam m_OwningTeam; // 0x2a8
	float m_nextWaveTime; // 0x2ac
	float DismantleTime; // 0x2b0
	EDynamicSpawnType DynamicSpawnType; // 0x2b4
	EHLLDamageFilterType DamageFilterType; // 0x2b5
	FName UnitSpawnOnScoreAction; // 0x2b8
	FName TeamSpawnOnScoreAction; // 0x2c0
	FText DisplayName; // 0x2c8
	int32_t DestroyedByEnemyManpowerPenalty; // 0x2e0
	int32_t MinEnemyPlayersToOverrun; // 0x2e4
	USoundBase* EnemyDestroyedSound; // 0x2e8
	FText EnemyDestroyedMessage; // 0x2f0
	float OverrunSphereRadius; // 0x308
	FCollisionProfileName OverrunQuery; // 0x30c
	AShooterPlayerState* SpawnedByPlayer; // 0x340
	USceneComponent* DummyRoot; // 0x348
	UStaticMeshComponent* MeshComponent; // 0x350
	UAudioComponent* LoopingAC; // 0x358
	UHLLMapComponent* MapComponent; // 0x360
	UHLLIndicatorComponent* IndicatorComponent; // 0x368
	UBoxComponent* GhostBlockerComponent; // 0x370
	UHLLSimpleHealthComponent* HealthComponent; // 0x378
	FRepGhostBarrier GhostBarrierInfo; // 0x380
	UNearbySpawnEnemyDetection* NearbySpawnEnemyDetection; // 0x390
	char bDetectNearbyEnemies : 1; // 0x3b0
	float EnemyDetectionDistance; // 0x3b4
	float EnemyBlockingDistance; // 0x3b8
	float NonFriendlySectorBlockingDistance; // 0x3bc
	float SpawnBlockingCooldown; // 0x3c0
	char bCanBeRemovedByCommander : 1; // 0x3c4
	FText OwnerMessageWhenRemoved; // 0x3c8
	USoundBase* AbilityRemovedSound; // 0x3e0
	EHint HintWhenSpawnedOn; // 0x3e8
};

struct AHLLCommanderAbility_PlaneBase : AHLLCommanderAbility_Placeable {
	FVector CoverageInfo; // 0x370
	UStaticMeshComponent* PlaneMesh; // 0x380
	UAudioComponent* PlaneAudio; // 0x388
	UAudioComponent* PlaneFlybyAudio; // 0x390
	UParticleSystemComponent* PlaneParticles; // 0x398
	float FlightTime; // 0x3a0
	float PlaneSpeed; // 0x3a4
	float PlaneAltitude; // 0x3a8
	float SpawnOffset; // 0x3ac
	float DespawnOffset; // 0x3b0
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0xe0
	FVector FailsafeExtent; // 0xe8
	char bIncludeAgentHeight : 1; // 0xf4
};

struct UParticleModuleLocationPrimitiveSphere : UParticleModuleLocationPrimitiveBase {
	FRawDistributionFloat StartRadius; // 0xb0
};

struct AActor : UObject {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bHidden : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bCanBeDamaged : 1; // 0x59
	char bBlockInput : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x170
	FMulticastSparseDelegate OnTakeAnyDamage; // 0x180
	FMulticastSparseDelegate OnTakePointDamage; // 0x181
	FMulticastSparseDelegate OnTakeRadialDamage; // 0x182
	FMulticastSparseDelegate OnActorBeginOverlap; // 0x183
	FMulticastSparseDelegate OnActorEndOverlap; // 0x184
	FMulticastSparseDelegate OnBeginCursorOver; // 0x185
	FMulticastSparseDelegate OnEndCursorOver; // 0x186
	FMulticastSparseDelegate OnClicked; // 0x187
	FMulticastSparseDelegate OnReleased; // 0x188
	FMulticastSparseDelegate OnInputTouchBegin; // 0x189
	FMulticastSparseDelegate OnInputTouchEnd; // 0x18a
	FMulticastSparseDelegate OnInputTouchEnter; // 0x18b
	FMulticastSparseDelegate OnInputTouchLeave; // 0x18c
	FMulticastSparseDelegate OnActorHit; // 0x18d
	FMulticastSparseDelegate OnDestroyed; // 0x18e
	FMulticastSparseDelegate OnEndPlay; // 0x18f
	TArray<UActorComponent*> InstanceComponents; // 0x1f0
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x200
};

struct AHLLDispenserItem_Garrison : AHLLDispenserItem_DynamicSpawnGhost {
	char bAutoDestroyGarrisonsPlacedByOtherOfficers : 1; // 0x4c8
};

struct UNearbySpawnEnemyDetection : UActorComponent {
	char bDetectNearbyEnemies : 1; // 0xc8
	float EnemyDetectionDistance; // 0xcc
	float EnemyBlockingDistance; // 0xd0
	float NonFriendlySectorBlockingDistance; // 0xd4
	float SpawnBlockingCooldown; // 0xd8
	FSpawnEnemyInfo SpawnEnemyInfo; // 0xdc
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x1f0
	FVector SocketOffset; // 0x1f4
	FVector TargetOffset; // 0x200
	float ProbeSize; // 0x20c
	ECollisionChannel ProbeChannel; // 0x210
	char bDoCollisionTest : 1; // 0x214
	char bUsePawnControlRotation : 1; // 0x214
	char bInheritPitch : 1; // 0x214
	char bInheritYaw : 1; // 0x214
	char bInheritRoll : 1; // 0x214
	char bEnableCameraLag : 1; // 0x214
	char bEnableCameraRotationLag : 1; // 0x214
	char bUseCameraLagSubstepping : 1; // 0x214
	char bDrawDebugLagMarkers : 1; // 0x215
	float CameraLagSpeed; // 0x218
	float CameraRotationLagSpeed; // 0x21c
	float CameraLagMaxTimeStep; // 0x220
	float CameraLagMaxDistance; // 0x224
};

struct UHLLDialogButton : UUserWidget {
	UButton* RootButton; // 0x230
	UTextBlock* ButtonText; // 0x238
	int32_t Index; // 0x240
	FMulticastInlineDelegate OnPressed; // 0x248
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UParticleModuleTypeDataRibbon : UParticleModuleTypeDataBase {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x148
	char bReverseAsBrake : 1; // 0x148
	char bUseRVOAvoidance : 1; // 0x148
	char bRawHandbrakeInput : 1; // 0x148
	char bRawGearUpInput : 1; // 0x148
	char bRawGearDownInput : 1; // 0x148
	char bWasAvoidanceUpdated : 1; // 0x14c
	char bAutoDriveOnPlay : 1; // 0x150
	float Mass; // 0x168
	TArray<FWheelSetup> WheelSetups; // 0x170
	float DragCoefficient; // 0x180
	float MaxWaterVolumeUpdateDistance; // 0x184
	float ChassisWidth; // 0x188
	float ChassisHeight; // 0x18c
	char bHasParkingGear : 1; // 0x190
	float DragArea; // 0x194
	float EstimatedMaxEngineSpeed; // 0x198
	float MaxEngineRPM; // 0x19c
	float DebugDragMagnitude; // 0x1a0
	FVector CenterOfMassOffset; // 0x1a4
	FVector InertiaTensorScale; // 0x1b0
	float MinNormalizedTireLoad; // 0x1bc
	float MinNormalizedTireLoadFiltered; // 0x1c0
	float MaxNormalizedTireLoad; // 0x1c4
	float MaxNormalizedTireLoadFiltered; // 0x1c8
	float ThresholdLongitudinalSpeed; // 0x1cc
	int32_t LowForwardSpeedSubStepCount; // 0x1d0
	int32_t HighForwardSpeedSubStepCount; // 0x1d4
	TArray<UVehicleWheel*> Wheels; // 0x1d8
	float RVOAvoidanceRadius; // 0x200
	float RVOAvoidanceHeight; // 0x204
	float AvoidanceConsiderationRadius; // 0x208
	float RVOSteeringStep; // 0x20c
	float RVOThrottleStep; // 0x210
	int32_t AvoidanceUID; // 0x214
	FNavAvoidanceMask AvoidanceGroup; // 0x218
	FNavAvoidanceMask GroupsToAvoid; // 0x21c
	FNavAvoidanceMask GroupsToIgnore; // 0x220
	float AvoidanceWeight; // 0x224
	FVector PendingLaunchVelocity; // 0x228
	FReplicatedVehicleState ReplicatedState; // 0x250
	float RawSteeringInput; // 0x26c
	float RawThrottleInput; // 0x270
	float RawBrakeInput; // 0x274
	float SteeringInput; // 0x278
	float ThrottleInput; // 0x27c
	float BrakeInput; // 0x280
	float HandbrakeInput; // 0x284
	float IdleBrakeInput; // 0x288
	float StopThreshold; // 0x28c
	float WrongDirectionThreshold; // 0x290
	FVehicleInputRate ThrottleInputRate; // 0x294
	FVehicleInputRate BrakeInputRate; // 0x29c
	FVehicleInputRate HandbrakeInputRate; // 0x2a4
	FVehicleInputRate SteeringInputRate; // 0x2ac
	AController* OverrideController; // 0x2d8
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat StartRotation; // 0x30
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AHLLMapData_Ability : AHLLMapData_Basic {
	AHLLCommanderAbility_Placeable* AssignedAbility; // 0x248
};

struct UHLLMapIcon_SpawnBase : UHLLMapIconBase {
	FLinearColor DotColour_Selected; // 0x368
	FLinearColor DotColour_Unselected; // 0x378
	FLinearColor DotColour_EnemyNear; // 0x388
	FLinearColor GradientColour_Default; // 0x398
	FLinearColor GradientColour_Selected; // 0x3a8
	FLinearColor GradientColour_Pulsing; // 0x3b8
	FLinearColor GradientColour_EnemyNear; // 0x3c8
	FLinearColor SelectionRingColour_Default; // 0x3d8
	FLinearColor SelectionRingColour_EnemyNear; // 0x3e8
	FLinearColor IconColour_Default; // 0x3f8
	FLinearColor IconColour_Platoon; // 0x408
	FLinearColor IconColour_Enemy; // 0x418
	char bColouriseIconWhenSelected : 1; // 0x428
	FLinearColor IconColour_Selected; // 0x42c
	FLinearColor PulseColour_Platoon; // 0x43c
	FLinearColor PulseColour_Ally; // 0x44c
	UImage* IconDot; // 0x460
	UImage* Gradient; // 0x468
	UImage* PulseRing; // 0x470
	UImage* SelectionRing; // 0x478
	UTextBlock* PlatoonIDText; // 0x480
	UImage* NearbyEnemyIndicator; // 0x488
	UWidgetAnimation* Anim_PulseLoop; // 0x490
	UWidgetAnimation* Anim_SelectedLoop; // 0x498
	UWidgetAnimation* Anim_Selected; // 0x4a0
};

struct UMaterialExpressionConstant2Vector : UMaterialExpression {
	float R; // 0x40
	float G; // 0x44
};

struct UHLLAdminCameraMovement : UFloatingPawnMovement {
	float MinSpeed; // 0x150
};

struct UMovieSceneEasingExternalCurve : UObject {
	UCurveFloat* Curve; // 0x30
};

struct UPlatoonManagementStackNotification : UUserWidget {
	UTextBlock* Title; // 0x248
	UTextBlock* Message; // 0x250
	float DisplayTime; // 0x258
};

struct ULandscapeSettings : UDeveloperSettings {
	int32_t MaxNumberOfLayers; // 0x38
};

struct UHLLArmourWeaponUI : UUserWidget {
	AHLLArmourWeapon* AssignedWeapon; // 0x230
	UHLLArmourWeaponUI_AmmoItem* AmmoItemWidget; // 0x238
	TArray<UHLLArmourWeaponUI_AmmoItem*> ActiveAmmoItems; // 0x240
	UImage* WeaponIcon; // 0x250
	UTextBlock* WeaponNameText; // 0x258
	UTextBlock* WeaponHeaderText; // 0x260
	UProgressBar* LoadProgress; // 0x268
	UWidget* SingleAmmoContainer; // 0x270
	UTextBlock* AmmoClip; // 0x278
	UTextBlock* AmmoClips; // 0x280
	UTextBlock* AmmoState; // 0x288
	UTextBlock* MunitionsCost; // 0x290
	UWidgetSwitcher* MunitionsSwitcher; // 0x298
	UVerticalBox* MultiAmmoContainer; // 0x2a0
};

struct AHLLDispenserItem_TimedSatchel : AHLLDispenserItem_Base {
	TArray<char> TimeValues; // 0x470
};

struct UParticleModuleMeshRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionVector StartRotationRate; // 0x30
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UMaterialExpressionTruncate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct APartyBeaconHost : AOnlineBeaconHostObject {
	UPartyBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x220
};

struct UHierarchicalLODSetup : UObject {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct AHLLSatchelCharge : AHLLExplosive {
	UStaticMeshComponent* SatchelMesh; // 0x3b0
	char DetonationTimeSeconds; // 0x3b8
	float ServerTimeAtDetonation; // 0x3bc
	FCollisionProfileName HitQueryProfile; // 0x3c0
	FTimerHandle TH_SatchelDetonate; // 0x3c8
};

struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase {
	FRawDistributionVector Position; // 0x30
	FRawDistributionFloat Range; // 0x78
	FRawDistributionFloat Strength; // 0xa8
	char StrengthByDistance : 1; // 0xd8
	char bAffectBaseVelocity : 1; // 0xd8
	char bOverrideVelocity : 1; // 0xd8
	char bUseWorldSpacePosition : 1; // 0xd8
	char Positive_X : 1; // 0xd8
	char Positive_Y : 1; // 0xd8
	char Positive_Z : 1; // 0xd8
	char Negative_X : 1; // 0xd8
	char Negative_Y : 1; // 0xd9
	char Negative_Z : 1; // 0xd9
};

struct UHLLUI_ServerBrowser : UUserWidget {
	char bRefreshQueued : 1; // 0x230
	UHLLUI_ServerBrowserItem* SearchResultWidget; // 0x240
	TArray<UHLLUI_ServerBrowserItem*> SearchResultWidgets; // 0x248
	int32_t SelectedServerIndex; // 0x258
	EHLLSearchQueryType CurrentQueryType; // 0x25c
	EHLLUI_ServerSortMode CurrentSortMode; // 0x25d
	char bSortAscendingMode : 1; // 0x25e
	TArray<FHLLUI_ServerResult> SortedResults; // 0x260
	char bShowingPasswordEntry : 1; // 0x270
	float SelectedServerRefreshInterval; // 0x274
	UDataTable* MapBrowserInfo; // 0x288
	UWidgetSwitcher* ServerListSwitcher; // 0x290
	UWidgetSwitcher* ServerDetailsSwitcher; // 0x298
	UImage* ServerInfoImage; // 0x2a0
	UScrollBox* ServerScrollBox; // 0x2a8
	UTextBlock* MessageText; // 0x2b0
	UTextBlock* ActivityText; // 0x2b8
	UTextBlock* JoinServerText; // 0x2c0
	UTextBlock* ServerDetails_MapName; // 0x2c8
	UTextBlock* ServerDetails_PlayerCount; // 0x2d0
	UTextBlock* ServerDetails_GameMode; // 0x2d8
	UTextBlock* ServerDetails_OffensiveModeAttackingFaction; // 0x2e0
	UTextBlock* ServerDetails_Ping; // 0x2e8
	UTextBlock* ServerDetails_ServerQueueData; // 0x2f0
	UEditableTextBox* ServerNameFilter; // 0x2f8
	UTextBlock* ServerFoundText; // 0x300
	UEditableTextBox* PasswordEntryBox; // 0x308
	UPanelWidget* PasswordEntryPanel; // 0x310
	UButton* PasswordJoin; // 0x318
	UButton* PasswordCancel; // 0x320
};

struct UWindowTitleBarArea : UContentWidget {
	bool bWindowButtonsEnabled; // 0x120
	bool bDoubleClickTogglesFullscreen; // 0x121
};

struct AShooterImpactEffect : AActor {
	char bHitSurfaceSet : 1; // 0x220
	FHitResult HitSurface; // 0x224
	float DecalProjectionDepth; // 0x2ac
	float SurfaceSearchDepth; // 0x2b0
	char bFindComplexSurface : 1; // 0x2b4
	char bOrientToSurface : 1; // 0x2b4
	char bSearchInWorldSpace : 1; // 0x2b4
	EAxis SurfaceSearchAxis; // 0x2b5
	char bAttachDecals : 1; // 0x2b6
	char bDecalsUseRelevancy : 1; // 0x2b6
	float DecalRelevancyDistance; // 0x2b8
	float DecalFadeScreenSize; // 0x2bc
	FSurfaceVFX SurfaceEffects; // 0x2c0
	FSurfaceSounds SurfaceSounds; // 0x418
	FSurfaceDecals SurfaceDecals; // 0x570
	UParticleSystemComponent* SpawnedPC; // 0x830
	UAudioComponent* SpawnedAC; // 0x838
	UDecalComponent* SpawnedDC; // 0x840
};

struct UWidget_DebugPlayerStates_C : UUserWidget {
	UButton* Background; // 0x230
	UImage* Image_1; // 0x238
	UImage* Image_2; // 0x240
	UImage* Image_3; // 0x248
	UTextBlock* TextBox; // 0x250
};

struct UWGT_UseContext_UseHealWeapon_C : UHLLUseContext_HealWeapon {
	FPointerToUberGraphFrame UberGraphFrame; // 0x250
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	FBodyInstance BodyInstance; // 0x158
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x288
	FLightingChannels LightingChannels; // 0x289
	char bRenderCustomDepth : 1; // 0x28c
	int32_t CustomDepthStencilValue; // 0x290
	int32_t TranslucencySortPriority; // 0x294
	float CollisionRadius; // 0x298
	float ShadeRadius; // 0x29c
	int32_t NumSteps; // 0x2a0
	float InitialSeedDensity; // 0x2a4
	float AverageSpreadDistance; // 0x2a8
	float SpreadVariance; // 0x2ac
	int32_t SeedsPerStep; // 0x2b0
	int32_t DistributionSeed; // 0x2b4
	float MaxInitialSeedOffset; // 0x2b8
	bool bCanGrowInShade; // 0x2bc
	bool bSpawnsInShade; // 0x2bd
	float MaxInitialAge; // 0x2c0
	float MaxAge; // 0x2c4
	float OverlapPriority; // 0x2c8
	FFloatInterval ProceduralScale; // 0x2cc
	FRuntimeFloatCurve ScaleCurve; // 0x2d8
	int32_t ChangeCount; // 0x360
	char ReapplyDensity : 1; // 0x364
	char ReapplyRadius : 1; // 0x364
	char ReapplyAlignToNormal : 1; // 0x364
	char ReapplyRandomYaw : 1; // 0x364
	char ReapplyScaling : 1; // 0x364
	char ReapplyScaleX : 1; // 0x364
	char ReapplyScaleY : 1; // 0x364
	char ReapplyScaleZ : 1; // 0x364
	char ReapplyRandomPitchAngle : 1; // 0x365
	char ReapplyGroundSlope : 1; // 0x365
	char ReapplyHeight : 1; // 0x365
	char ReapplyLandscapeLayers : 1; // 0x365
	char ReapplyZOffset : 1; // 0x365
	char ReapplyCollisionWithWorld : 1; // 0x365
	char ReapplyVertexColorMask : 1; // 0x365
	char bEnableDensityScaling : 1; // 0x365
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x368
	int32_t VirtualTextureCullMips; // 0x378
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x37c
};

struct UHLLGunnerUI_HowitzerRangeItem : UUserWidget {
	UTextBlock* RangeText; // 0x230
	UTextBlock* ElevationText; // 0x238
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct USoundGroups : UObject {
	TArray<FSoundGroup> SoundGroupProfiles; // 0x28
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UOptionButton_V2_C : UHLLUI_OptionSelection {
	FPointerToUberGraphFrame UberGraphFrame; // 0x240
	UImage* FocusEffect; // 0x248
	UImage* LeftArrow; // 0x250
	UButton* LeftButton; // 0x258
	UImage* LeftFocusedArrow; // 0x260
	UOverlay* LeftOverlay; // 0x268
	UImage* LeftShoulder; // 0x270
	UButton* OptionButton; // 0x278
	USlider* OptionSlider; // 0x280
	UTextBlock* OptionTextBlock; // 0x288
	UImage* RightArrow; // 0x290
	UButton* RightButton; // 0x298
	UImage* RightFocusedArrow; // 0x2a0
	UOverlay* RightOverlay; // 0x2a8
	UImage* RightShoulder; // 0x2b0
	FText Text; // 0x2b8
	EOptionMenuItemType Type; // 0x2d0
	int32_t Value; // 0x2d4
	FSlateColor NormalTextColor; // 0x2d8
	FSlateColor HoveredTextColor; // 0x300
	FMulticastInlineDelegate OnClicked; // 0x328
	FButtonStyle InitialButtonStyle; // 0x338
	TArray<FText> CustomOptions; // 0x5b0
	int32_t CustomMaxValue; // 0x5c0
	FButtonStyle FocusedButtonStyle; // 0x5c8
	int32_t MinValue; // 0x840
	bool bHasArrows; // 0x844
	float SliderValue; // 0x848
	bool bIncreaseButtonSize; // 0x84c
	bool bHasShoulderButtons; // 0x84d
	FMulticastInlineDelegate OnCreateSelectButton; // 0x850
};

struct UComponentDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintComponentDelegateBinding> ComponentDelegateBindings; // 0x28
};

struct USoundNode : UObject {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct AHLLMapData_ReconItem : AHLLMapData_Basic {
	FReconDataItem ReconData; // 0x248
};

struct UHLLVoiceData : UDataAsset {
	TMap<EHLLDamageType, TSoftObjectPtr<USoundBase>> PainVoices; // 0x30
	float PainThreshold; // 0x80
	TMap<EHLLDamageType, TSoftObjectPtr<USoundBase>> CriticalVoices; // 0x88
	TMap<EHLLDamageType, TSoftObjectPtr<USoundBase>> DeathVoices; // 0xd8
	TSoftObjectPtr<USoundBase> DismemberedDeathVoice; // 0x128
	TSoftObjectPtr<USoundBase> WoundedLoop; // 0x150
	TSoftObjectPtr<USoundBase> CriticalLoop; // 0x178
	TSoftObjectPtr<USoundBase> WeaponSteadyBreath; // 0x1a0
	TSoftObjectPtr<USoundBase> WeaponUnsteadyBreath; // 0x1c8
	TSoftObjectPtr<USoundBase> JumpSound; // 0x1f0
};

struct UReportPlayerDialog_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	FString TargetGlobalPlayerId; // 0x238
	FMulticastInlineDelegate OnOpenCloseChanged; // 0x248
};

struct AHLLCommanderAbility_StrafingRun : AHLLCommanderAbility_Placeable {
	USplineComponent* FollowSpline_2; // 0x370
	UStaticMeshComponent* PlaneMesh_2; // 0x378
	UAudioComponent* PlaneAmbientSound; // 0x380
	UAudioComponent* PlaneDiveSound; // 0x388
	USceneComponent* PlaneRoot; // 0x390
	float PlaneSpeed; // 0x398
	float ActivationTime; // 0x39c
	float DiveActivationTime; // 0x3a0
	AShooterImpactEffect* ImpactEffect; // 0x3a8
	float PlaneGunSpacing; // 0x3b0
	float ShotRandomOffset; // 0x3b4
	float ShotRadius; // 0x3b8
	float ShotAngle; // 0x3bc
	float Damage; // 0x3c0
	float Suppression; // 0x3c4
	float SuppressionRadius; // 0x3c8
	float FireTime; // 0x3cc
	float CoverageLength; // 0x3d0
	int32_t NumShots; // 0x3d4
	UShooterDamageType* DamageType; // 0x3d8
	UParticleSystem* MuzzleFlash; // 0x3e0
	USoundBase* MuzzleSound; // 0x3e8
	TArray<TWeakObjectPtr<UParticleSystemComponent>> MuzzleFlashPSC; // 0x3f0
	TArray<TWeakObjectPtr<UAudioComponent>> MuzzleAC; // 0x400
};

struct UHLLOnlinePlayerStats : UObject {
	FHLLStatDeltaAccumulator ActiveAccumulator; // 0x48
	FHLLStatDeltaAccumulator PendingWriteAccumulator; // 0x58
	char bPendingStartWrite : 1; // 0x78
	char bWaitingForRefresh : 1; // 0x78
	char bWaitingForWrite : 1; // 0x78
	char bWaitingForFlush : 1; // 0x78
	char bKillOnComplete : 1; // 0x78
	char bInitialStatsPopulated : 1; // 0x78
	FPackedOnlineStats InitialStatValues; // 0x80
	char bOnlineStatsPopulated : 1; // 0xa0
	FPackedOnlineStats CachedOnlineStatValues; // 0xa8
	FDateTime StartTime; // 0xc8
};

struct AServerQueueFrontend : AInfo {
	UServerQueueProgressWidget* ProgressWidgetClass; // 0x220
	int32_t ProgressWidgetZOrder; // 0x228
	AServerQueueBeaconClient* BeaconClient; // 0x230
	UServerQueueProgressWidget* ProgressWidget; // 0x238
};

struct UHLLHUDBase : UUserWidget {
	UCanvasPanel* WorldWidgetPanel; // 0x230
	UCanvasPanel* WorldWidgetPanel_Toggleable; // 0x238
	TArray<UHLLIndicatorBase*> ActiveIndicatorWidgets; // 0x320
	TArray<int32_t> SectorDisplayPriorities; // 0x330
	UTextBlock* SectorWarningMessage; // 0x340
	UVerticalBox* HealVBox; // 0x348
	UTextBlock* HealMessage; // 0x350
	UImage* HealProgress; // 0x358
	UTextBlock* TeamKillMessage; // 0x360
	UHLLWeaponListItem* WeaponListItem; // 0x370
	float WeaponListShowTime; // 0x378
	TArray<UHLLWeaponListItem*> ActiveWeaponListItems; // 0x380
	UVerticalBox* WeaponListVBox; // 0x390
	UWidget* SecondaryOutput; // 0x3a0
	UWidget* WarmupWidget; // 0x3a8
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x338
	float SourceHeight; // 0x33c
	float BarnDoorAngle; // 0x340
	float BarnDoorLength; // 0x344
	UTexture* SourceTexture; // 0x348
};

struct UBillboardComponent : UPrimitiveComponent {
	UTexture2D* Sprite; // 0x410
	char bIsScreenSizeScaled : 1; // 0x418
	float ScreenSize; // 0x41c
	float U; // 0x420
	float UL; // 0x424
	float V; // 0x428
	float VL; // 0x42c
};

struct UButtonPrompt : UUserWidget {
	UTextBlock* Timeout; // 0x250
	TSoftObjectPtr<UTexture2D> GamepadIcon; // 0x258
	TSoftObjectPtr<UTexture2D> SecondaryGamepadIcon; // 0x280
};

struct UReplicationGraph : UReplicationDriver {
	UNetReplicationGraphConnection* ReplicationConnectionManagerClass; // 0x28
	UNetDriver* NetDriver; // 0x30
	TArray<UNetReplicationGraphConnection*> Connections; // 0x38
	TArray<UNetReplicationGraphConnection*> PendingConnections; // 0x48
	TArray<UReplicationGraphNode*> GlobalGraphNodes; // 0x98
	TArray<UReplicationGraphNode*> PrepareForReplicationNodes; // 0xa8
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x410
	UNavAreaBase* AreaClass; // 0x418
	FColor ShapeColor; // 0x420
	char bDrawOnlyIfSelected : 1; // 0x424
	char bShouldCollideWhenPlacing : 1; // 0x424
	char bDynamicObstacle : 1; // 0x424
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UAsyncActionChangePrimaryAssetBundles : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x68
	FName TrackName; // 0x78
};

struct UGameplayMessage_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UTextBlock* Message; // 0x238
	FText Text; // 0x240
	float LifeSpan; // 0x258
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x40
	FGuid ExpressionGUID; // 0x50
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x38
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x220
};

struct USpinBox : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	FSpinBoxStyle WidgetStyle; // 0x120
	USlateWidgetStyleAsset* Style; // 0x408
	int32_t MinFractionalDigits; // 0x410
	int32_t MaxFractionalDigits; // 0x414
	bool bAlwaysUsesDeltaSnap; // 0x418
	float Delta; // 0x41c
	float SliderExponent; // 0x420
	FSlateFontInfo Font; // 0x428
	ETextJustify Justification; // 0x478
	float MinDesiredWidth; // 0x47c
	bool ClearKeyboardFocusOnCommit; // 0x480
	bool SelectAllTextOnCommit; // 0x481
	FSlateColor ForegroundColor; // 0x488
	FMulticastInlineDelegate OnValueChanged; // 0x4b0
	FMulticastInlineDelegate OnValueCommitted; // 0x4c0
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d0
	FMulticastInlineDelegate OnEndSliderMovement; // 0x4e0
	char bOverride_MinValue : 1; // 0x4f0
	char bOverride_MaxValue : 1; // 0x4f0
	char bOverride_MinSliderValue : 1; // 0x4f0
	char bOverride_MaxSliderValue : 1; // 0x4f0
	float MinValue; // 0x4f4
	float MaxValue; // 0x4f8
	float MinSliderValue; // 0x4fc
	float MaxSliderValue; // 0x500
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USoundSourceBus : USoundWave {
	ESourceBusChannels SourceBusChannels; // 0x308
	float SourceBusDuration; // 0x30c
	char bAutoDeactivateWhenSilent : 1; // 0x310
};

struct UHLLOptionScreenBase : UUserWidget {
	UShooterGameViewportClient* ViewportClient; // 0x348
	UVoipMicCheckWidget* VoipMicCheckWidgetClass; // 0x350
	UHLLUI_OptionSelection* VoipConnectionButton; // 0x358
	UTextBlock* VoipConnectionStatusText; // 0x360
	UTextBlock* VoipConnectionLabel; // 0x368
	float VoipConnectionStatusChangeTimeout; // 0x370
};

struct UBTService : UBTAuxiliaryNode {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UCreatePlatoon_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UAvailablePlatoonTypes_V2_C* AvailablePlatoonTypes; // 0x238
	UCircularThrobber* CircularThrobber_1; // 0x240
	UVerticalBox* MainPanel; // 0x248
	UWidgetSwitcher* PanelSwitcher; // 0x250
	UBorder* ProgressPanel; // 0x258
	Uhll_text_C* txt_title; // 0x260
	FMulticastInlineDelegate OnClosed; // 0x268
	FMulticastInlineDelegate OnHovered; // 0x278
	FMulticastInlineDelegate OnUnhovered; // 0x288
	int32_t CurrentIndex; // 0x298
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct UMaterialExpressionSquareRoot : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AHLLMapData_Supplies : AHLLMapData_Basic {
	ESupplyType SupplyType; // 0x248
	uint16_t SuppliesRemaining; // 0x24a
};

struct UWidget : UVisual {
	UPanelSlot* Slot; // 0x28
	FDelegate bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	FDelegate ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	FDelegate ToolTipWidgetDelegate; // 0x70
	FDelegate VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	EMouseCursor cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct UHLLUpgradeData_Structure : UHLLUpgradeData {
	UStaticMesh* UpgradeMesh; // 0x150
};

struct UWGT_RoleSelectItem_V2_C : UHLLUI_RoleItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UBorder* LevelBorder; // 0x270
	UButton* SelectButton; // 0x278
	UBorder* TextBorder; // 0x280
	bool bFavourite; // 0x288
	FMulticastInlineDelegate OnClick; // 0x290
	bool bHasSectionFocus; // 0x2a0
	FMulticastInlineDelegate ChangeFaction; // 0x2a8
};

struct UAISense_Team : UAISense {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct AWarfareGameMode : AShooterGameMode {
	int32_t NumBaseLineCapsToWin; // 0x528
};

struct UScrollBox : UPanelWidget {
	FScrollBoxStyle WidgetStyle; // 0x120
	FScrollBarStyle WidgetBarStyle; // 0x348
	USlateWidgetStyleAsset* Style; // 0x818
	USlateWidgetStyleAsset* BarStyle; // 0x820
	EOrientation Orientation; // 0x828
	ESlateVisibility ScrollBarVisibility; // 0x829
	EConsumeMouseWheel ConsumeMouseWheel; // 0x82a
	FVector2D ScrollbarThickness; // 0x82c
	FMargin ScrollbarPadding; // 0x834
	bool AlwaysShowScrollbar; // 0x844
	bool AlwaysShowScrollbarTrack; // 0x845
	bool AllowOverscroll; // 0x846
	bool bAnimateWheelScrolling; // 0x847
	EDescendantScrollDestination NavigationDestination; // 0x848
	float NavigationScrollPadding; // 0x84c
	EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x850
	bool bAllowRightClickDragScrolling; // 0x851
	float WheelScrollMultiplier; // 0x854
	FMulticastInlineDelegate OnUserScrolled; // 0x858
};

struct UHLLMapIcon_Ability : UHLLMapIconBase {
	int32_t PlacingPriority; // 0x368
	UImage* DirectionIndicator; // 0x370
	UImage* ProgressIndicator; // 0x378
	USizeBox* CoverageIndicator; // 0x380
	UBorder* CoverageBorder; // 0x388
};

struct UWGT_LoadoutOption_V2_C : UHLLUI_Loadout {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d8
	UWidgetAnimation* Hover; // 0x2e0
	UImage* LockIcon; // 0x2e8
	UButton* RootButton; // 0x2f0
	UBorder* SelectBorder; // 0x2f8
	bool bFocus; // 0x300
	FMulticastInlineDelegate OnCreateConfirmButton; // 0x308
	UImage* LockIcon; // 0x318
};

struct UWGT_Credits_V2_C : UHLLUI_Credits {
	FPointerToUberGraphFrame UberGraphFrame; // 0x378
	UWidgetAnimation* OpenAnim; // 0x380
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x388
	UMainMenuWidget_V2_C* MainMenu; // 0x390
};

struct UMaterialExpressionRuntimeVirtualTextureReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput VirtualTextureOutput; // 0x54
};

struct UDistributionFloatUniformCurve : UDistributionFloat {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct USoundNodeWavePlayer : USoundNodeAssetReferencer {
	TSoftObjectPtr<USoundWave> SoundWaveAssetPtr; // 0x48
	USoundWave* SoundWave; // 0x70
	char bLooping : 1; // 0x78
};

struct USoundNodeSoundClass : USoundNode {
	USoundClass* SoundClassOverride; // 0x48
};

struct UHLLAnimNotify_VibrationEvent : UAnimNotify {
	USoundBase* Sound; // 0x48
	float VolumeMultiplier; // 0x50
	float PitchMultiplier; // 0x54
	char bFollow : 1; // 0x58
};

struct UTextLayoutWidget : UWidget {
	FShapedTextOptions ShapedTextOptions; // 0x108
	ETextJustify Justification; // 0x10b
	ETextWrappingPolicy WrappingPolicy; // 0x10c
	char AutoWrapText : 1; // 0x10d
	float WrapTextAt; // 0x110
	FMargin Margin; // 0x114
	float LineHeightPercentage; // 0x124
};

struct UMaterialExpressionOneMinus : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UWGT_HealthCircular_C : UHLLSeatHealthStatusItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FSlateBrush Brush; // 0x278
};

struct UMovieSceneColorSection : UMovieSceneSection {
	FMovieSceneFloatChannel RedCurve; // 0xe0
	FMovieSceneFloatChannel GreenCurve; // 0x180
	FMovieSceneFloatChannel BlueCurve; // 0x220
	FMovieSceneFloatChannel AlphaCurve; // 0x2c0
};

struct UWGT_MarkerTooltip_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UTextBlock* Desc; // 0x238
	UTextBlock* Vis; // 0x240
};

struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x268
	float DamagePerSec; // 0x26c
	UDamageType* DamageType; // 0x270
	float PainInterval; // 0x278
	char bEntryPain : 1; // 0x27c
	char BACKUP_bPainCausing : 1; // 0x27c
	AController* DamageInstigator; // 0x280
};

struct UPaperTileSet : UObject {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct USplineMeshComponent : UStaticMeshComponent {
	FSplineMeshParams SplineParams; // 0x4a8
	FVector SplineUpDir; // 0x500
	float SplineBoundaryMin; // 0x50c
	FGuid CachedMeshBodySetupGuid; // 0x510
	UBodySetup* BodySetup; // 0x520
	float SplineBoundaryMax; // 0x528
	char bAllowSplineEditingPerInstance : 1; // 0x52c
	char bSmoothInterpRollScale : 1; // 0x52c
	char bMeshDirty : 1; // 0x52c
	ESplineMeshAxis ForwardAxis; // 0x52d
	float VirtualTextureMainPassMaxDrawDistance; // 0x530
};

struct UCurveLinearColor : UCurveBase {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct UMaterialBillboardComponent : UPrimitiveComponent {
	TArray<FMaterialSpriteElement> Elements; // 0x410
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FSpectatorReservation PendingReservation; // 0x2f0
	ESpectatorClientRequestType RequestType; // 0x368
	bool bPendingReservationSent; // 0x369
	bool bCancelReservation; // 0x36a
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UAudioComponent : USceneComponent {
	USoundBase* Sound; // 0x1f0
	TArray<FAudioComponentParam> InstanceParameters; // 0x1f8
	USoundClass* SoundClassOverride; // 0x208
	char bAutoDestroy : 1; // 0x210
	char bStopWhenOwnerDestroyed : 1; // 0x210
	char bShouldRemainActiveIfDropped : 1; // 0x210
	char bAllowSpatialization : 1; // 0x210
	char bOverrideAttenuation : 1; // 0x210
	char bOverrideSubtitlePriority : 1; // 0x210
	char bIsUISound : 1; // 0x210
	char bEnableLowPassFilter : 1; // 0x210
	char bOverridePriority : 1; // 0x211
	char bSuppressSubtitles : 1; // 0x211
	char bAutoManageAttachment : 1; // 0x212
	FName AudioComponentUserID; // 0x218
	float PitchModulationMin; // 0x220
	float PitchModulationMax; // 0x224
	float VolumeModulationMin; // 0x228
	float VolumeModulationMax; // 0x22c
	float VolumeMultiplier; // 0x230
	int32_t EnvelopeFollowerAttackTime; // 0x234
	int32_t EnvelopeFollowerReleaseTime; // 0x238
	float Priority; // 0x23c
	float SubtitlePriority; // 0x240
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x248
	float PitchMultiplier; // 0x250
	float LowPassFilterFrequency; // 0x254
	USoundAttenuation* AttenuationSettings; // 0x260
	FSoundAttenuationSettings AttenuationOverrides; // 0x268
	USoundConcurrency* ConcurrencySettings; // 0x608
	TSet<USoundConcurrency*> ConcurrencySet; // 0x610
	EAttachmentRule AutoAttachLocationRule; // 0x66c
	EAttachmentRule AutoAttachRotationRule; // 0x66d
	EAttachmentRule AutoAttachScaleRule; // 0x66e
	FMulticastInlineDelegate OnAudioFinished; // 0x670
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x698
	FMulticastInlineDelegate OnAudioSingleEnvelopeValue; // 0x6c0
	FMulticastInlineDelegate OnAudioMultiEnvelopeValue; // 0x6e8
	FSoundModulation Modulation; // 0x710
	FDelegate OnQueueSubtitles; // 0x720
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x730
	FName AutoAttachSocketName; // 0x738
};

struct UTextRenderComponent : UPrimitiveComponent {
	FText Text; // 0x410
	UMaterialInterface* TextMaterial; // 0x428
	UFont* Font; // 0x430
	EHorizTextAligment HorizontalAlignment; // 0x438
	EVerticalTextAligment VerticalAlignment; // 0x439
	FColor TextRenderColor; // 0x43c
	float XScale; // 0x440
	float YScale; // 0x444
	float WorldSize; // 0x448
	float InvDefaultSize; // 0x44c
	float HorizSpacingAdjust; // 0x450
	float VertSpacingAdjust; // 0x454
	char bAlwaysRenderAsText : 1; // 0x458
};

struct UTurretControllerComponent2 : UPitchYawControllerComponent {
	FName TurretBoneName; // 0x488
	FName BarrelBoneName; // 0x490
	float MinTurretRotationScale; // 0x498
	ATankGunnerSeat* GunnerSeat; // 0x4a8
	UAudioComponent* YawAudio; // 0x4b0
	UAudioComponent* PitchAudio; // 0x4b8
	UStaticMeshComponent* CharacterMovementBarrierTurret; // 0x4c0
	UStaticMeshComponent* CharacterMovementBarrierBarrel; // 0x4c8
	UVibrationEventController* YawVibrationController; // 0x4d0
	UVibrationEventController* PitchVibrationController; // 0x4d8
};

struct AShooterPlayerState : APlayerState {
	FMulticastInlineDelegate OnRoleChanged; // 0x340
	FMulticastInlineDelegate OnTeamChanged; // 0x350
	FMulticastInlineDelegate OnPlatoonChanged; // 0x360
	float OutpostBuildTimer; // 0x374
	int32_t NumKills; // 0x378
	int32_t NumDeaths; // 0x37c
	char bQuitter : 1; // 0x380
	float m_lastOutpostBuildTime; // 0x384
	UObject* m_lastSpawnObject; // 0x388
	char bPendingPlatoonKickOnDeath : 1; // 0x390
	FHLLPlayerScoreData ScoreData; // 0x394
	float LastPawnRestartTime; // 0x400
	UHLLPlayerStats* MatchStatsTracker; // 0x408
	float LastTeamSwitchTime; // 0x45c
	uint16_t PlayerLevel; // 0x464
	FHLLPlayerInfo RepPlayerInfo; // 0x468
	FCharacterCosmeticProfile RequestedCosmetics_Character; // 0x498
	char RequestedLoadout_Character; // 0x4b0
	char NumCommendationsReceived; // 0x4b1
	FMulticastInlineDelegate OnMarkerAddedOrUpdated; // 0x4b8
	FMulticastInlineDelegate OnMarkerRemoved; // 0x4c8
	FRepMarkerInfo RepMarkerInfo; // 0x4e8
	EPlayingState PlayingState; // 0x738
	char NumPunishments; // 0x739
	float AccruedPunishTime; // 0x73c
	FMulticastInlineDelegate OnSharedAmmoRegenStarted; // 0x740
	FMulticastInlineDelegate OnSharedAmmoRegenComplete; // 0x750
	USoundBase* AmmoRegenStartSound; // 0x760
	USoundBase* AmmoRegenSound; // 0x768
	float DefaultAmmoRegenTime; // 0x770
	FHLLSharedAmmoData SharedAmmo; // 0x774
	FString ClanTag; // 0x7b8
	float NextAvailableVoteTime_Instigator; // 0x7c8
	float NextAvailableVoteTime_Target; // 0x7cc
	char bVoteKickImmune : 1; // 0x7d0
};

struct AController : AActor {
	APlayerState* PlayerState; // 0x228
	FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x238
	FName StateName; // 0x248
	APawn* Pawn; // 0x250
	ACharacter* Character; // 0x260
	USceneComponent* TransformComponent; // 0x268
	FRotator ControlRotation; // 0x288
	char bAttachToPawn : 1; // 0x294
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x270
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x278
	APlayerCameraManager* BaseCamera; // 0x280
	FTransform RelativeTransform; // 0x290
	float BaseFOV; // 0x2c0
	char bAllowMultipleInstances : 1; // 0x2c4
	char bResetWhenRetriggered : 1; // 0x2c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x2c8
	float DistFromCamera; // 0x2d8
};

struct AHLLAbilityDrop_Spawn : ADynamicSpawn {
	UHLLParachuteMeshComponent* Parachute; // 0x3f8
	float DescentSpeed; // 0x400
	char MaxWaves; // 0x404
	FDropSpawnInfo ReplicatedDropInfo; // 0x408
	char NumExecutedWaves; // 0x414
};

struct UBasicReplicationGraph : UReplicationGraph {
	UReplicationGraphNode_GridSpatialization2D* GridNode; // 0x498
	UReplicationGraphNode_ActorList* AlwaysRelevantNode; // 0x4a0
	TArray<FConnectionAlwaysRelevantNodePair> AlwaysRelevantForConnectionList; // 0x4a8
	TArray<AActor*> ActorsWithoutNetConnection; // 0x4b8
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UWGT_RadialChat_Base_V2_C : UHLLRadialMenu_ChatBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UBackgroundBlur* BackgroundBlur_63; // 0x340
};

struct USphereComponent : UShapeComponent {
	float SphereRadius; // 0x428
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UComboBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FComboBoxStyle ComboBoxStyle; // 0x30
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x958
	bool bIsReadOnly; // 0xbc0
	bool AllowContextMenu; // 0xbc1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbc2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbc3
	USlateWidgetStyleAsset* Style; // 0xbc8
	FSlateFontInfo Font; // 0xbd0
	FLinearColor ForegroundColor; // 0xc20
	FLinearColor BackgroundColor; // 0xc30
	FLinearColor ReadOnlyForegroundColor; // 0xc40
	FMulticastInlineDelegate OnTextChanged; // 0xc50
	FMulticastInlineDelegate OnTextCommitted; // 0xc60
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x58
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UABP_Rifleman_TPP_V2_C : UHLLCharacterAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x2d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x3e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0x400
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x4b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0x530
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x558
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0x580
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x638
	FAnimNode_Slot AnimGraphNode_Slot_23; // 0x660
	FAnimNode_Slot AnimGraphNode_Slot_22; // 0x6a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x6f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x718
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x740
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x7b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x830
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0x8a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x960
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_29; // 0x988
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0xa50
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0xb10
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_41; // 0xbc8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0xc78
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0xc98
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0xda0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0xdc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0xe78
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0xea0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0xf40
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0xf60
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0xf80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0xfa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x1058
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x1080
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_8; // 0x1120
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x1188
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_7; // 0x1200
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x1268
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_40; // 0x12e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x1390
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x1430
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x1458
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_28; // 0x14d0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x1598
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x1720
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x18a8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_27; // 0x1920
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x19e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x1a60
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x1b00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x1bc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x1be8
	FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x1c10
	FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x1c40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x1cf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x1d18
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_26; // 0x1d40
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x1e08
	FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1ec8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1fc0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x20c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x21d0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x21f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x22b0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x2368
	FAnimNode_Slot AnimGraphNode_Slot_21; // 0x2420
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x2468
	FAnimNode_Slot AnimGraphNode_Slot_20; // 0x2490
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x24d8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_25; // 0x2500
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x25c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x2690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x2708
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x2780
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x27f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x2820
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x2848
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x28e8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x2910
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x29c8
	FAnimNode_Slot AnimGraphNode_Slot_19; // 0x2a80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x2ac8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x2af0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x2bb0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2d90
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_6; // 0x2e98
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x2f00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x2f28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x2f50
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x2f78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x3038
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x3060
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x3088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x3100
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x3178
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x31f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x32b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x3330
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x33a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x3420
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x3498
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x3510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x3588
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x3600
	FAnimNode_Slot AnimGraphNode_Slot_18; // 0x36c8
	FAnimNode_Slot AnimGraphNode_Slot_17; // 0x3710
	FAnimNode_Slot AnimGraphNode_Slot_16; // 0x3758
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_39; // 0x37a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_38; // 0x3850
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_37; // 0x3900
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_36; // 0x39b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_35; // 0x3a60
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_34; // 0x3b10
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_33; // 0x3bc0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x3c70
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0x3d38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x3e00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x3e28
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x3e48
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x3f00
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x3f20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x3fe8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x4010
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x4038
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x4060
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x4088
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x40b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x40d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x4100
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x4128
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x4150
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x4178
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x41a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x41c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x41f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x4268
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x4328
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x43f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x4468
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_5; // 0x4490
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x44f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x4520
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x45e0
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_3; // 0x4600
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x4720
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x4740
	FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x47b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x47e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0x4860
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x4928
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x49a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0x4a18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x4ae0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x4b58
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x4c18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x4ce0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x4d58
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_4; // 0x4d80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x4de8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x4e10
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x4ed0
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_2; // 0x4ef0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x5010
	FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x5030
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x5060
	FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x5088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x50b8
	FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x5130
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0x5160
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x5228
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x52a0
	FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x5318
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x5348
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0x53f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x54c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x54e8
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_3; // 0x55f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x5658
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x5680
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x56a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x56d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x56f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x5720
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x5748
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x5770
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x5798
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x57c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x57e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x5810
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x5838
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x5860
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x5888
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x58b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x58d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x5900
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x5928
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x5950
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x5978
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x59a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x59c8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x59f0
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_6; // 0x5ab8
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_5; // 0x5b10
	FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_3; // 0x5b68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x5b98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x5bc0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x5be8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x5c10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x5c38
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_4; // 0x5d00
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_3; // 0x5d58
	FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_2; // 0x5db0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x5de0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x5e08
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x5e30
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x5e58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x5e80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x5ea8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x5ed0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x5ef8
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_2; // 0x5fc0
	FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator; // 0x6018
	FAnimNode_StateResult AnimGraphNode_CustomTransitionResult; // 0x6070
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x60a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x60c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x60f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x6118
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x6140
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x6168
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x6190
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x61b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x61e0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_32; // 0x6258
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x6308
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x6330
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x63f0
	FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x6468
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_31; // 0x6498
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x6548
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x65c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x6638
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x66b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x6728
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x67a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x6818
	FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x6890
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x68c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x68e8
	FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x6960
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x6990
	FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x6a08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x6a38
	FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x6ab0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x6ae0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37; // 0x6b80
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36; // 0x6c60
	FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x6d40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x6d70
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_30; // 0x6d98
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_29; // 0x6e48
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_28; // 0x6ef8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x6fa8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x7088
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x7168
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x7248
	FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x7328
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x7358
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x7420
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x74e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x7560
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_27; // 0x75d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x7688
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x7700
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x7778
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0x77a8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0x7858
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x7908
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x79e8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x7ac8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x7ba8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x7c70
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27; // 0x7d50
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26; // 0x7e30
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x7f10
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0x7f40
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0x7ff0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x80a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x8118
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x8190
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x8208
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x8280
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0x8348
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x83f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25; // 0x8498
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24; // 0x8578
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23; // 0x8658
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x8738
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x87b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x87e0
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x8808
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x8838
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x8860
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x8888
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x88b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x88d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x8900
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x8928
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x8950
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x8978
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x89a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x89d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0x89f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0x8aa8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x8b58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22; // 0x8c18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21; // 0x8cf8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20; // 0x8dd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x8eb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x8f30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x8fa8
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x9020
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x9050
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19; // 0x9100
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18; // 0x91e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17; // 0x92c0
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x93a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x93d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x9480
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16; // 0x9530
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x9610
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x96f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x97d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x98b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x9990
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x9a70
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x9b38
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x9b68
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x9c18
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x9cc8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x9d88
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x9e68
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x9f48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0xa028
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xa0a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xa118
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xa190
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0xa1c0
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xa270
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xa2a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0xa350
	FAnimNode_Slot AnimGraphNode_Slot_15; // 0xa418
	FAnimNode_Slot AnimGraphNode_Slot_14; // 0xa460
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0xa4a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xa560
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0xa640
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0xa6f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0xa720
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0xa748
	FAnimNode_Slot AnimGraphNode_Slot_13; // 0xa808
	FAnimNode_Slot AnimGraphNode_Slot_12; // 0xa850
	FAnimNode_Slot AnimGraphNode_Slot_11; // 0xa898
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0xa8e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xa990
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xaa58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xaad0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xab48
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0xabc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0xac70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0xac98
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0xacc0
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0xace0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xae00
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0xae20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0xaec0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0xaee8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0xafa8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0xafd0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0xb088
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0xb140
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0xb168
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0xb190
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0xb1b8
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0xb1e0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0xb2b0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0xb380
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0xb450
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0xb500
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0xb5b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0xb5e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0xb608
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0xb6a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0xb6d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0xb770
	FAnimNode_Slot AnimGraphNode_Slot_10; // 0xb850
	FAnimNode_Slot AnimGraphNode_Slot_9; // 0xb898
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0xb8e0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0xb928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0xb9d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0xba00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0xba28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xba50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xba78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xbaa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xbac8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xbaf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xbb18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xbb40
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xbbb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xbbe8
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xbc60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xbc90
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xbd08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xbd38
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xbdb0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0xbde0
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xbe08
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xbe38
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0xbee8
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xbfa0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0xc030
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc0d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xc1d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xc1f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0xc218
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xc240
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xc2f8
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0xc320
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xc500
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0xc520
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0xc5d8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0xc6a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0xc828
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xc850
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0xc930
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0xc958
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0xc980
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0xc9a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0xca60
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0xca88
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0xcb40
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0xcbf0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0xcca0
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel_2; // 0xcd68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0xcdd0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0xcdf8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0xcec0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0xcf78
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0xcfa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0xcfc8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0xcff0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0xd0a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0xd0d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0xd0f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0xd120
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0xd1e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0xd208
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0xd2c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0xd2f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0xd3b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0xd3d8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0xd400
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0xd4c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0xd570
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0xd650
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0xd708
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0xd730
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0xd758
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0xd818
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xd860
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0xd918
	FAnimNode_Root AnimGraphNode_Root; // 0xd960
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0xd990
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0xda58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xda80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xdaa8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xdb60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xdb88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xdbb0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0xdbd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xdc98
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0xdcc0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xdd08
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xddd0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xde88
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xdeb0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xdf78
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xdfa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xe068
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel; // 0xe090
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xe0f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xe120
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xe148
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xe170
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xe198
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xe1c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xe1e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xe210
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xe238
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xe260
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xe288
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xe2b8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0xe2e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xe390
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xe408
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xe480
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xe4f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xe528
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xe5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xe650
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xe6c8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0xe740
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xe770
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xe7e8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xe860
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe910
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xe9d8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xea98
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xeb48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xebf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xec70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xece8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xed60
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xedd8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xee08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xeeb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xef30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xefa8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xf020
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xf050
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0xf100
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xf148
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xf210
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xf238
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xf260
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xf290
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xf330
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xf410
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xf4f0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xf520
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xf5d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xf690
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xf730
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xf758
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xf808
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xf880
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xf940
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xf968
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xf990
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xfa50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xfaf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xfb18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xfb40
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xfb68
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xfc08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xfcc0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xfce8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xfda8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xfdd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xfdf8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xfe98
	FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xfeb8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xffa8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xffc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x10080
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x100a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x100d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x10170
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x101e8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x10288
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x10368
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x104f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x10678
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x10718
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x108a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x10958
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x10980
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x10a20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x10ad8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x10b00
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x10b28
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x10b70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x10c30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x10c58
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x10cf8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x10d40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x10e00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x10e28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x10e50
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10e78
	FAnimNode_Slot AnimGraphNode_Slot; // 0x10f18
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x10f60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x11020
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x11048
	bool IsLocallyControlled; // 0x11070
	bool IsDead; // 0x11071
	bool IsDeployed; // 0x11072
	bool IsBraced; // 0x11073
	bool IsADS; // 0x11074
	bool EnableFullBody; // 0x11075
	bool WeaponUsesADS; // 0x11076
	float Speed; // 0x11078
	bool WantsToMove; // 0x1107c
	bool IsSprinting; // 0x1107d
	bool IsTurning; // 0x1107e
	bool DirectionPivot; // 0x1107f
	bool LockMovingDirection; // 0x11080
	bool LockPivotingDirection; // 0x11081
	float MovementThreshold; // 0x11084
	float SprintWeight; // 0x11088
	float SprintWeightInv; // 0x1108c
	float LegsTurnRef; // 0x11090
	float LegsTurnRate; // 0x11094
	bool Debug; // 0x11098
	FRotator CharacterRotation; // 0x1109c
	float DeltaTimeX; // 0x110a8
	FRotator LastVelocityRotation; // 0x110ac
	FRotator PreviousVelocityRotation; // 0x110b8
	UABP_Rifleman_FPP_V2_C* FPP_Component; // 0x110c8
	AShooterWeapon* Weapon; // 0x110d0
	UCapsuleComponent* CapsuleComponent; // 0x110d8
	AShooterWeapon* RequestedWeapon; // 0x110e0
	UWeaponTPPAnimationSet* AnimSet; // 0x110e8
	UWeaponTPPAnimationSet* DefaultAnimSet; // 0x110f0
	AShooterCharacter* PlayerPawn; // 0x110f8
	USkeletalMeshComponent* TPP_Component; // 0x11100
	float FallSpeed; // 0x11108
	float InAirTime; // 0x1110c
	float JumpVelocity; // 0x11110
	float LeanInAir; // 0x11114
	float AccelerationDifference; // 0x11118
	float PreviousSpeed; // 0x1111c
	float LeanRotation; // 0x11120
	float LeanAcceleration; // 0x11124
	float FootPositionPhase; // 0x11128
	float FootPositionDirection; // 0x1112c
	int32_t RandomIndex_Idle; // 0x11130
	UAnimSequenceBase* pose_inheritance_stand; // 0x11138
	UAnimSequenceBase* pose_inheritance_crouch; // 0x11140
	UAnimSequenceBase* pose_inheritance_prone; // 0x11148
	UAnimSequenceBase* idle_stand; // 0x11150
	UAnimSequenceBase* idle_crouch; // 0x11158
	UAnimSequenceBase* idle_prone; // 0x11160
	UAnimSequenceBase* idle_stand_break_01; // 0x11168
	UAnimSequenceBase* idle_stand_break_02; // 0x11170
	UAnimSequenceBase* idle_crouch_break_01; // 0x11178
	UAnimSequenceBase* idle_crouch_break_02; // 0x11180
	UBlendSpaceBase* bs_locomotion_stand; // 0x11188
	UBlendSpaceBase* bs_locomotion_crouch; // 0x11190
	UBlendSpaceBase* bs_locomotion_prone; // 0x11198
	UBlendSpaceBase* bs_stop_walk_stand; // 0x111a0
	UBlendSpaceBase* bs_stop_walk_crouch; // 0x111a8
	UBlendSpaceBase* bs_stop_jog_stand; // 0x111b0
	UBlendSpaceBase* bs_stop_jog_crouch; // 0x111b8
	UBlendSpaceBase* bs_stop_sprint_stand; // 0x111c0
	UBlendSpaceBase* bs_stop_sprint_crouch; // 0x111c8
	UBlendSpaceBase* bs_stop_jog_stand_to_prone; // 0x111d0
	UBlendSpaceBase* bs_stop_jog_crouch_to_prone; // 0x111d8
	UBlendSpaceBase* bs_stop_sprint_stand_to_prone; // 0x111e0
	UBlendSpaceBase* bs_stop_sprint_crouch_to_prone; // 0x111e8
	UAnimSequenceBase* rotate_stand_r; // 0x111f0
	UAnimSequenceBase* rotate_stand_l; // 0x111f8
	UAnimSequenceBase* rotate_crouch_r; // 0x11200
	UAnimSequenceBase* rotate_crouch_l; // 0x11208
	UAnimSequenceBase* rotate_prone_r; // 0x11210
	UAnimSequenceBase* rotate_prone_l; // 0x11218
	UBlendSpaceBase* stand_vault; // 0x11220
	UBlendSpaceBase* stand_climb; // 0x11228
	UAnimSequenceBase* t_stand_to_crouch; // 0x11230
	UAnimSequenceBase* t_stand_to_prone; // 0x11238
	UAnimSequenceBase* t_crouch_to_prone; // 0x11240
	UAnimSequenceBase* t_crouch_to_stand; // 0x11248
	UAnimSequenceBase* t_prone_to_stand; // 0x11250
	UAnimSequenceBase* t_prone_to_crouch; // 0x11258
	UAnimSequenceBase* bipod_deploy_stand; // 0x11260
	bool Bipod_Moving; // 0x11268
	bool Bipod_Moving_Direction; // 0x11269
	ECharacterStance Stance; // 0x1126a
	ECharacterStance StanceStored; // 0x1126b
	ECharacterStance StancePrevious; // 0x1126c
	ECharacterStance StanceDeath; // 0x1126d
	bool ChangedStance; // 0x1126e
	EWeaponType WeaponTypeCurrent; // 0x1126f
	bool IsVaulting; // 0x11270
	bool IsClimbing; // 0x11271
	FVector2D LeanAdditive; // 0x11274
	FRotator SprintRotation; // 0x1127c
	UWidget_DebugPlayerStates_C* DebugWidget; // 0x11288
	EWeaponType WeaponTypeLast; // 0x11290
	float ADS_Weight; // 0x11294
	EWeaponGroups_V2 WeaponGroup; // 0x11298
	float Speed_Max_ADS; // 0x1129c
	float Speed_Max_Sprint_Standing; // 0x112a0
	float Speed_Max_Sprint_Crouched; // 0x112a4
	ETransitionState_V2 TransitionState; // 0x112a8
	ETransitionState_V2 TransitionStateLast; // 0x112a9
	bool Initialized; // 0x112aa
	FVector2D RelativeVelocity; // 0x112ac
	FVector2D RelativeVelocitySlow; // 0x112b4
	FVector2D RelativeVelocityStored; // 0x112bc
	float RelativeVelocityDifference; // 0x112c4
	FVector LegsForwardDirRef; // 0x112c8
	float DebugAlignRadius; // 0x112d4
	float StanceTransitionSpeed; // 0x112d8
	float SpeedTimerTime; // 0x112dc
	float Speed_Max_Jog_Standing; // 0x112e0
	float Speed_Max_Jog_Crouched; // 0x112e4
	float Speed_Max_Proned; // 0x112e8
	float Bipod_IntepPose; // 0x112ec
	float Bipod_IntepPose_Stored; // 0x112f0
	float Bipod_AimVerticalBlend; // 0x112f4
	FVector PlayerBipod_T; // 0x112f8
	FRotator PlayerBipod_R; // 0x11304
	FTransform Bipod_Anchor; // 0x11310
	float IK_Left; // 0x11340
	float IK_Right; // 0x11344
	bool IK_Left_Enabled; // 0x11348
	bool IK_Right_Enabled; // 0x11349
	UAnimSequenceBase* stand_jump_enter; // 0x11350
	UAnimSequenceBase* stand_jump_loop; // 0x11358
	UAnimSequenceBase* stand_jump_exit; // 0x11360
	UAnimSequenceBase* sprint_stand; // 0x11368
	UAnimSequenceBase* sprint_crouch; // 0x11370
	UAnimSequenceBase* pose_inheritance_deploy; // 0x11378
	UAnimSequenceBase* pose_ads_stand; // 0x11380
	UAnimSequenceBase* pose_ads_crouch; // 0x11388
	UAnimSequenceBase* pose_ads_prone; // 0x11390
	UAnimSequenceBase* bipod_deploy_crouch; // 0x11398
	UAnimSequenceBase* bipod_deploy_prone; // 0x113a0
	UAnimSequenceBase* bipod_idle_stand; // 0x113a8
	UAnimSequenceBase* bipod_idle_crouch; // 0x113b0
	UAnimSequenceBase* bipod_idle_prone; // 0x113b8
	UAnimSequenceBase* bipod_undeploy_stand; // 0x113c0
	UAnimSequenceBase* bipod_undeploy_crouch; // 0x113c8
	UAnimSequenceBase* bipod_undeploy_prone; // 0x113d0
	UBlendSpaceBase* bs_start_walk_stand; // 0x113d8
	UBlendSpaceBase* bs_start_walk_crouch; // 0x113e0
	UBlendSpaceBase* bs_start_jog_stand; // 0x113e8
	UBlendSpaceBase* bs_start_jog_crouch; // 0x113f0
	UBlendSpaceBase* bs_start_prone_to_jog; // 0x113f8
	UBlendSpaceBase* bs_start_prone_to_sprint; // 0x11400
	float Timer_Turn; // 0x11408
	float Time_Stop; // 0x1140c
	bool CaptureStopTimer; // 0x11410
	EVelocityStage_V2 VelocityStage; // 0x11411
	float VelocityDifference; // 0x11414
	FVector CharacterVelocityStored; // 0x11418
	float ac_LegsTurnCurve; // 0x11424
	UBlendSpaceBase* AO_Stand; // 0x11428
	UBlendSpaceBase* AO_Stand_ADS; // 0x11430
	UBlendSpaceBase* AO_Crouch; // 0x11438
	UBlendSpaceBase* AO_Crouch_ADS; // 0x11440
	UBlendSpaceBase* AO_Prone; // 0x11448
	UBlendSpaceBase* AO_Prone_ADS; // 0x11450
	float ac_IK_Right_Default; // 0x11458
	float ac_IK_Left_Default; // 0x1145c
	UAnimSequenceBase* pose_idle_stand; // 0x11460
	UAnimSequenceBase* pose_idle_crouch; // 0x11468
	UAnimSequenceBase* pose_idle_prone; // 0x11470
	FRotator LegsForwardDir; // 0x11478
	float CharDirection; // 0x11484
	float CharDirectionSign; // 0x11488
	UAimOffsetBlendSpace* AO_Crouch_Moving; // 0x11490
	float Speed_Normalized_Relevant; // 0x11498
	float Speed_Normalized_Relevant_Max; // 0x1149c
	float Speed_Normalized_Stand; // 0x114a0
	float Speed_Normalized_Crouch; // 0x114a4
	float Speed_Normalized_Prone; // 0x114a8
	float Speed_Normalized_Stand_Sprint; // 0x114ac
	float Speed_Normalized_Crouch_Sprint; // 0x114b0
	float Speed_Normalized_ADS; // 0x114b4
	float Speed_Sticky; // 0x114b8
	int32_t RandomIndex_Death; // 0x114bc
	int32_t RandomIndex_Death_Prone; // 0x114c0
	float FullBodyBlend; // 0x114c4
	float CharDirection_Moving; // 0x114c8
	float AimOffsetWeight; // 0x114cc
	float CharDirection_Moving_Slow; // 0x114d0
	float CharDirection_Pivoting; // 0x114d4
	UAnimSequenceBase* idle_stand_ads; // 0x114d8
	UAnimSequenceBase* idle_crouch_ads; // 0x114e0
	UAnimSequenceBase* idle_prone_ads; // 0x114e8
	float Bipod_HeightDiff; // 0x114f0
	float ac_InheritanceWeight; // 0x114f4
	float ac_OverrideHandIK; // 0x114f8
	EWeaponGroups_V2 EquippedGroup; // 0x114fc
	float Prone_FrontSlopeAngle; // 0x11500
	float Prone_BackSlopeAngle; // 0x11504
	float Prone_FrontSlopeAngle_Stored; // 0x11508
	float Prone_BackSlopeAngle_Stored; // 0x1150c
	float ac_Weight_UpperBody; // 0x11510
	APlayerPawn_Anim_V2_C* PlayerPawnAnim; // 0x11518
	float IK_Foot_Offset; // 0x11520
	float Bipod_AimRotation; // 0x11524
	float Bipod_AimRotation_Stored; // 0x11528
	float ac_IK_Action_Override_Left; // 0x1152c
	float ac_IK_Action_Override_Right; // 0x11530
	UAnimSequenceBase* brace_stand_idle; // 0x11538
	UAnimSequenceBase* brace_crouch_idle; // 0x11540
	UAnimSequenceBase* brace_prone_idle; // 0x11548
	float ac_Action; // 0x11550
	AStressTestBot_C* BotTestPawn; // 0x11558
	FRotator Prone_FrontSlopeRotation; // 0x11560
	FRotator Prone_BackSlopeRotation; // 0x1156c
	FVector IK_Foot_Target_Left_Location; // 0x11578
	FRotator IK_Foot_Target_Left_Rotation; // 0x11584
	FVector IK_Foot_Target_Right_Location; // 0x11590
	FRotator IK_Foot_Target_Right_Rotation; // 0x1159c
	float LeanWeight; // 0x115a8
	UBlendSpace* bs_locomotion_stand_ads; // 0x115b0
	UBlendSpace* bs_locomotion_crouch_ads; // 0x115b8
	UAnimSequenceBase* Brace_Stand_Enter; // 0x115c0
	UAnimSequenceBase* brace_crouch_enter; // 0x115c8
	UAnimSequenceBase* brace_prone_enter; // 0x115d0
	UAnimSequenceBase* brace_stand_exit; // 0x115d8
	UAnimSequenceBase* brace_crouch_exit; // 0x115e0
	UAnimSequenceBase* brace_prone_exit; // 0x115e8
	float ac_RightHandAction; // 0x115f0
	FVector CharacterVelocityLastDetermined; // 0x115f4
	float CharacterVelocityTimeCheck; // 0x11600
	FRotator LegsForwardDirInv; // 0x11604
	float AimPitch; // 0x11610
	float AimYaw; // 0x11614
	UCurveVector* crv_vault; // 0x11618
	UCurveVector* crv_climb; // 0x11620
	UAnimSequenceBase* vault_enter_low; // 0x11628
	UAnimSequenceBase* vault_enter_high; // 0x11630
	EVaultingMoveType Vault_Type; // 0x11638
	bool Vault_Low; // 0x11639
	bool Vault_WaitForGround; // 0x1163a
	float Vault_Enter_Start; // 0x1163c
	float Vault_Exit_Start; // 0x11640
	float Vault_Enter_Alpha; // 0x11644
	float Vault_Over_Alpha; // 0x11648
	float Vault_Exit_Alpha; // 0x1164c
	float Vault_Over_Time; // 0x11650
	FVector Vault_Obstacle; // 0x11654
	FVector Vault_Obstacle_World; // 0x11660
	FVector Vault_MeshStart; // 0x1166c
	FVector Vault_RootOffset; // 0x11678
	float Vault_Enter_Speed; // 0x11684
	float Vault_Over_Speed; // 0x11688
	float Vault_Exit_Speed; // 0x1168c
	float Vault_Enter_Speed_Mod; // 0x11690
	float Vault_Over_Speed_Mod; // 0x11694
	float Vault_Exit_Speed_Mod; // 0x11698
	FVector Vault_Enter_Vec; // 0x1169c
	FVector Vault_Over_Vec; // 0x116a8
	FVector Vault_Exit_Vec; // 0x116b4
	FVector Vault_Velocity; // 0x116c0
	float AimYaw_Stored; // 0x116cc
	float Vault_Enter_Low_AnimRate; // 0x116d0
	float Vault_Enter_High_AnimRate; // 0x116d4
	float Vault_Over_Low_AnimRate; // 0x116d8
	float Vault_Over_High_AnimRate; // 0x116dc
	float Vault_Exit_Low_AnimRate; // 0x116e0
	float Vault_Exit_High_AnimRate; // 0x116e4
	bool Vault_OverTransition; // 0x116e8
	bool Vault_ExitTransition; // 0x116e9
	float IK_ForceOn; // 0x116ec
	UAnimSequenceBase* rotate_stand_r_brc; // 0x116f0
	UAnimSequenceBase* rotate_stand_l_brc; // 0x116f8
	UAnimSequenceBase* rotate_crouch_r_brc; // 0x11700
	UAnimSequenceBase* rotate_crouch_l_brc; // 0x11708
	UAnimSequenceBase* rotate_prone_r_brc; // 0x11710
	UAnimSequenceBase* rotate_prone_l_brc; // 0x11718
	float CharDirection_HighSpeed; // 0x11720
	FVector Climb_Enter_Vec; // 0x11724
	float HorizontalTurnThreshold; // 0x11730
	EWeaponGroups_V2 WeaponGroup_Last; // 0x11734
	FVector ProneRootOffset; // 0x11738
	float ProneRootOffset_Length; // 0x11744
	bool IsMoving; // 0x11748
	bool IsStopping; // 0x11749
	bool IsGrounded; // 0x1174a
	bool IsPivoting; // 0x1174b
	float t_Update_100ms; // 0x1174c
	float t_Update_300ms; // 0x11750
	float Climb_Enter_Alpha; // 0x11754
	FVector Climb_GoalOffset; // 0x11758
	float t_Update_1000ms; // 0x11764
	FVector PlayerCenterOffset; // 0x11768
	TArray<UAnimMontage*> StanceTransitionMontages; // 0x11778
	UAnimSequence* PivotSequence; // 0x11788
	UAnimMontage* EquipMontage; // 0x11790
	bool ResetTimerResetters; // 0x11798
	float Climb_Enter_Start; // 0x1179c
	float Climb_Speed; // 0x117a0
	float Climb_Speed_Mod; // 0x117a4
	bool EnableVaultAndClimb; // 0x117a8
	UBlendSpaceBase* a_lean_ads; // 0x117b0
	UBlendSpaceBase* a_lean; // 0x117b8
	bool DisableAdvancedLayering; // 0x117c0
	FRotator PrevCapsuleRot; // 0x117c4
	bool T_Melee_Bayonet; // 0x117d0
	bool T_Melee_Bayonet_Hit; // 0x117d1
	UAnimSequenceBase* a_vault_enter_high; // 0x117d8
	UAnimSequenceBase* a_vault_enter_low; // 0x117e0
	UAnimSequenceBase* a_vault_exit_high; // 0x117e8
	UAnimSequenceBase* a_vault_exit_low; // 0x117f0
	UAnimSequenceBase* a_vault_exit_land_high; // 0x117f8
	UAnimSequenceBase* a_vault_exit_land_low; // 0x11800
	UAnimSequenceBase* a_climb; // 0x11808
	bool VaultForceExitTrigger; // 0x11810
	bool EquipPose; // 0x11811
	FPoseSnapshot EquipSnapshot; // 0x11818
	UBlendSpaceBase* a_lean_Unarmed; // 0x11850
	EWeaponDeployState CurrentDeployState; // 0x11858
	float LegIKAlpha; // 0x1185c
	bool PerformingQuickAttack; // 0x11860
	bool FullyIdleBlended; // 0x11861
	FVector ShotDirection; // 0x11864
	bool ValidBraceStandExit; // 0x11870
	bool bHitReaction; // 0x11871
	bool FinishedVaultClimb; // 0x11872
	bool Reloading; // 0x11873
};

struct UDirectionalLightComponent : ULightComponent {
	float ShadowCascadeBiasDistribution; // 0x320
	char bEnableLightShaftOcclusion : 1; // 0x324
	float OcclusionMaskDarkness; // 0x328
	float OcclusionDepthRange; // 0x32c
	FVector LightShaftOverrideDirection; // 0x330
	float WholeSceneDynamicShadowRadius; // 0x33c
	float DynamicShadowDistanceMovableLight; // 0x340
	float DynamicShadowDistanceStationaryLight; // 0x344
	int32_t DynamicShadowCascades; // 0x348
	float CascadeDistributionExponent; // 0x34c
	float CascadeTransitionFraction; // 0x350
	float ShadowDistanceFadeoutFraction; // 0x354
	char bUseInsetShadowsForMovableObjects : 1; // 0x358
	int32_t FarShadowCascadeCount; // 0x35c
	float FarShadowDistance; // 0x360
	float DistanceFieldShadowDistance; // 0x364
	float LightSourceAngle; // 0x368
	float LightSourceSoftAngle; // 0x36c
	float TraceDistance; // 0x370
	FLightmassDirectionalLightSettings LightmassSettings; // 0x374
	char bCastModulatedShadows : 1; // 0x384
	FColor ModulatedShadowColor; // 0x388
	float ShadowAmount; // 0x38c
	char bUsedAsAtmosphereSunLight : 1; // 0x390
	int32_t AtmosphereSunLightIndex; // 0x394
};

struct UReverbEffect : UObject {
	float Density; // 0x28
	float Diffusion; // 0x2c
	float Gain; // 0x30
	float GainHF; // 0x34
	float DecayTime; // 0x38
	float DecayHFRatio; // 0x3c
	float ReflectionsGain; // 0x40
	float ReflectionsDelay; // 0x44
	float LateGain; // 0x48
	float LateDelay; // 0x4c
	float AirAbsorptionGainHF; // 0x50
	float RoomRolloffFactor; // 0x54
};

struct UMaterialExpressionCustom : UMaterialExpression {
	FString Code; // 0x40
	ECustomMaterialOutputType OutputType; // 0x50
	FString Description; // 0x58
	TArray<FCustomInput> Inputs; // 0x68
	TArray<FCustomDefine> AdditionalDefines; // 0x78
	TArray<FString> IncludeFilePaths; // 0x88
};

struct UHLLAdminCameraSpringArm : USpringArmComponent {
	AActor* TraceIgnoreActor; // 0x280
};

struct UWGT_RconConsoleWindow_C : UHLLRconCommandWindow {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UMultiLineEditableTextBox* Output_Multi; // 0x250
	UScrollBox* TextScrollBox; // 0x258
	UEditableText* UserCommandTextBox; // 0x260
};

struct UWGT_ServerListItem_V2_C : UHLLUI_ServerBrowserItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	UBorder* RootBorder; // 0x2b8
	UButton* RootButton; // 0x2c0
	UWGT_ServerBrowser_V2_C* ServerBrowserWidget; // 0x2c8
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x80
	FAIDataProviderFloatValue ConeDegrees; // 0xb8
	FAIDataProviderFloatValue AngleStep; // 0xf0
	FAIDataProviderFloatValue Range; // 0x128
	UEnvQueryContext* CenterActor; // 0x160
	char bIncludeContextLocation : 1; // 0x168
};

struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	UPawnAction* Action; // 0x70
};

struct UHLLMarkers_MapMenuItem : UUserWidget {
	EHLLMarker AssignedMarker; // 0x230
	TWeakObjectPtr<UHLLMarkers_MapMenu> OwningMenu; // 0x234
	UImage* IconType; // 0x240
	UTextBlock* MarkerName; // 0x248
	UTextBlock* MarkerCount; // 0x250
};

struct UHLLRadialMenu_WeaponSegment : UHLLRadialMenu_Segment {
	EWeaponType WeaponType; // 0x2c4
	UImage* WeaponIcon; // 0x2c8
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> QueryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UHLLUI_RoleItem : UUserWidget {
	TWeakObjectPtr<UHLLUI_CharacterSelection> ParentPanel; // 0x230
	EPlayerRole Role; // 0x238
	UCheckBox* FavouriteChecker; // 0x240
	UImage* RoleIcon; // 0x248
	UTextBlock* RoleName; // 0x250
	UTextBlock* RoleLevel; // 0x258
	UProgressBar* RoleLevelProgress; // 0x260
};

struct UWGT_AdminCamPlayerEntry_C : UHLLAdminCamPlayerEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* CopyID; // 0x270
	UButton* CopyName; // 0x278
	UBorder* RootBorder; // 0x280
	UButton* RootButton; // 0x288
};

struct ANavigationTestingActor : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	UNavigationInvokerComponent* InvokerComponent; // 0x238
	char bActAsNavigationInvoker : 1; // 0x240
	FNavAgentProperties NavAgentProps; // 0x248
	FVector QueryingExtent; // 0x278
	ANavigationData* MyNavData; // 0x288
	FVector ProjectedLocation; // 0x290
	char bProjectedLocationValid : 1; // 0x29c
	char bSearchStart : 1; // 0x29c
	float CostLimitFactor; // 0x2a0
	float MinimumCostLimit; // 0x2a4
	char bBacktracking : 1; // 0x2a8
	char bUseHierarchicalPathfinding : 1; // 0x2a8
	char bGatherDetailedInfo : 1; // 0x2a8
	char bDrawDistanceToWall : 1; // 0x2a8
	char bShowNodePool : 1; // 0x2a8
	char bShowBestPath : 1; // 0x2a8
	char bShowDiffWithPreviousStep : 1; // 0x2a8
	char bShouldBeVisibleInGame : 1; // 0x2a8
	ENavCostDisplay CostDisplayMode; // 0x2ac
	FVector2D TextCanvasOffset; // 0x2b0
	char bPathExist : 1; // 0x2b8
	char bPathIsPartial : 1; // 0x2b8
	char bPathSearchOutOfNodes : 1; // 0x2b8
	float PathfindingTime; // 0x2bc
	float PathCost; // 0x2c0
	int32_t PathfindingSteps; // 0x2c4
	ANavigationTestingActor* OtherActor; // 0x2c8
	UNavigationQueryFilter* FilterClass; // 0x2d0
	int32_t ShowStepIndex; // 0x2d8
	float OffsetFromCornersDistance; // 0x2dc
};

struct UHLLUseContext_MountWeapon : UHLLUseContextBase {
	URichTextBlock* UseText; // 0x238
};

struct USynthComponent : USceneComponent {
	char bAutoDestroy : 1; // 0x1f0
	char bStopWhenOwnerDestroyed : 1; // 0x1f0
	char bAllowSpatialization : 1; // 0x1f0
	char bOverrideAttenuation : 1; // 0x1f0
	char bOutputToBusOnly : 1; // 0x1f4
	USoundAttenuation* AttenuationSettings; // 0x1f8
	FSoundAttenuationSettings AttenuationOverrides; // 0x200
	USoundConcurrency* ConcurrencySettings; // 0x5a0
	TSet<USoundConcurrency*> ConcurrencySet; // 0x5a8
	USoundClass* SoundClass; // 0x5f8
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x600
	USoundSubmixBase* SoundSubmix; // 0x608
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x610
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x620
	FSoundModulation Modulation; // 0x630
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x640
	char bIsUISound : 1; // 0x650
	char bIsPreviewSound : 1; // 0x650
	int32_t EnvelopeFollowerAttackTime; // 0x654
	int32_t EnvelopeFollowerReleaseTime; // 0x658
	FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x660
	USynthSound* Synth; // 0x690
	UAudioComponent* AudioComponent; // 0x698
};

struct APlayerState : AInfo {
	float Score; // 0x220
	int32_t PlayerId; // 0x224
	char Ping; // 0x228
	char bShouldUpdateReplicatedPing : 1; // 0x22a
	char bIsSpectator : 1; // 0x22a
	char bOnlySpectator : 1; // 0x22a
	char bIsABot : 1; // 0x22a
	char bIsInactive : 1; // 0x22a
	char bFromPreviousLevel : 1; // 0x22a
	int32_t StartTime; // 0x22c
	ULocalMessage* EngineMessageClass; // 0x230
	FString SavedNetworkAddress; // 0x240
	FUniqueNetIdRepl UniqueId; // 0x250
	APawn* PawnPrivate; // 0x280
	FString PlayerNamePrivate; // 0x300
};

struct UInterpTrackFloatProp : UInterpTrackFloatBase {
	FName PropertyName; // 0x90
};

struct USteamNetConnection : UIpConnection {
	bool bIsPassthrough; // 0x1ad0
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0x88
};

struct AShooterWeapon_Projectile : AShooterWeapon {
	AShooterProjectile* ProjectileClass; // 0x8b8
};

struct UMaterialExpressionShadingModel : UMaterialExpression {
	EMaterialShadingModel ShadingModel; // 0x40
};

struct UMaterialExpressionSceneColor : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput OffsetFraction; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct USoundNodeHLLDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct UHLLUseContext_Dispenser : UHLLUseContextBase {
	FLinearColor CantDropTint; // 0x23c
	UVerticalBox* ItemList; // 0x250
	TArray<UHLLDispenserListItem*> ItemWidgets; // 0x258
	TWeakObjectPtr<AShooterWeapon_Dispenser> CurrentListWeapon; // 0x268
	UVerticalBox* RootVBox; // 0x270
	UImage* RadialProg; // 0x278
	UImage* IconImage; // 0x280
	URichTextBlock* DisplayText; // 0x288
	URichTextBlock* SelectText; // 0x290
	UHorizontalBox* RotateHBox; // 0x298
	URichTextBlock* RotateLText; // 0x2a0
	URichTextBlock* RotateRText; // 0x2a8
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UHLLWeaponForceFeedbackData : UHLLWeaponVibrationData {
	TArray<FHLLWeaponForceFeedbackEvent> Events; // 0x30
};

struct UWGT_RoundSummaryPlayer_C : UHLLRoundSummaryPlayer {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	UButton* Button_179; // 0x330
	UButton* FriendButton; // 0x338
	UImage* Image; // 0x340
	UImage* Image_9; // 0x348
	UImage* Image_10; // 0x350
	UImage* PlatformIcon; // 0x358
	UW_HoverToolTip_C* Tooltip_Widget_Kick; // 0x360
	UW_HoverToolTip_C* Tooltip_Widget_Mute; // 0x368
	UW_HoverToolTip_C* Tooltip_Widget_Friend; // 0x370
	UWGT_RoundSummaryDetails_V2_C* Scoreboard; // 0x378
	float DefaultBGAlpha; // 0x380
	FMulticastInlineDelegate OnCustomNavigation; // 0x388
	int32_t PlatoonButtonIndex; // 0x398
	UWidget* CustomNavigationTarget; // 0x3a0
	FMulticastInlineDelegate OnFocus; // 0x3a8
	FMulticastInlineDelegate OnFocusLoss; // 0x3b8
	bool bIsFocused; // 0x3c8
	UWidget* MenuAnchorContent; // 0x3d0
	FLinearColor HilightColour; // 0x3d8
};

struct UHapticFeedbackEffect_SoundWave : UHapticFeedbackEffect_Base {
	USoundWave* SoundWave; // 0x28
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	bool bDisplayHelpInAutoComplete; // 0x55
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UMaterialExpressionSceneDepth : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput Coordinates; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UBTTask_FinishWithResult : UBTTaskNode {
	EBTNodeResult Result; // 0x70
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UAREnvironmentCaptureProbeTexture : UTextureCube {
	EARTextureType TextureType; // 0x110
	float Timestamp; // 0x114
	FGuid ExternalTextureGuid; // 0x118
	FVector2D Size; // 0x128
};

struct AShooterWeapon_TravelTime : AShooterWeapon {
	ARifleProjectile* ProjectileClass; // 0x8b8
	TMap<uint32_t, ARifleProjectile*> TravelingProjectiles; // 0x8c0
};

struct UMaterialExpressionDeriveNormalZ : UMaterialExpression {
	FExpressionInput InXY; // 0x40
};

struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	FGameplayTag InjectionTag; // 0x70
	UBehaviorTree* DefaultBehaviorAsset; // 0x78
	UBehaviorTree* BehaviorAsset; // 0x80
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x438
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x440
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x448
	UPhysicsAsset* PhysicsAssetOverride; // 0x550
	int32_t ForcedLodModel; // 0x558
	int32_t MinLodModel; // 0x55c
	float StreamingDistanceMultiplier; // 0x568
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x578
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x5ac
	char bOverrideMinLod : 1; // 0x5ae
	char bUseBoundsFromMasterPoseComponent : 1; // 0x5ae
	char bForceWireframe : 1; // 0x5ae
	char bDisplayBones : 1; // 0x5ae
	char bDisableMorphTarget : 1; // 0x5ae
	char bHideSkin : 1; // 0x5ae
	char bPerBoneMotionBlur : 1; // 0x5af
	char bComponentUseFixedSkelBounds : 1; // 0x5af
	char bConsiderAllBodiesForBounds : 1; // 0x5af
	char bSyncAttachParentLOD : 1; // 0x5af
	char bCanHighlightSelectedSections : 1; // 0x5af
	char bRecentlyRendered : 1; // 0x5af
	char bCastCapsuleDirectShadow : 1; // 0x5af
	char bCastCapsuleIndirectShadow : 1; // 0x5af
	char bCPUSkinning : 1; // 0x5b0
	char bEnableUpdateRateOptimizations : 1; // 0x5b0
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x5b0
	char bRenderStatic : 1; // 0x5b0
	char bIgnoreMasterPoseComponentLOD : 1; // 0x5b0
	char bCachedLocalBoundsUpToDate : 1; // 0x5b0
	char bForceMeshObjectUpdate : 1; // 0x5b1
	float CapsuleIndirectShadowMinVisibility; // 0x5b4
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x5c8
	FMatrix CachedWorldToLocalTransform; // 0x5f0
};

struct UMaterialParameterCollectionInstance : UObject {
	UMaterialParameterCollection* Collection; // 0x30
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x48
	float DelayMax; // 0x4c
};

struct APaperSpriteActor : AActor {
	UPaperSpriteComponent* RenderComponent; // 0x220
};

struct UAnimSharingStateInstance : UAnimInstance {
	UAnimSequence* AnimationToPlay; // 0x270
	float PermutationTimeOffset; // 0x278
	float PlayRate; // 0x27c
	bool bStateBool; // 0x280
	UAnimSharingInstance* Instance; // 0x288
};

struct AHLLCommanderAbility_GhostPlane : AHLLCommanderAbility_DropperPlane {
	FDispenserData DispenserData; // 0x3d8
	AHLLGhostAbilitySafezone* SafezoneClass; // 0x568
	AHLLDispenserItem_Base* GhostInstance; // 0x570
	AHLLGhostAbilitySafezone* SafezoneInstance; // 0x578
};

struct UMaterialExpressionVectorNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	EVectorNoiseFunction NoiseFunction; // 0x54
	int32_t Quality; // 0x58
	char bTiling : 1; // 0x5c
	uint32_t TileSize; // 0x60
};

struct UInterpTrackFloatParticleParam : UInterpTrackFloatBase {
	FName ParamName; // 0x90
};

struct AHLLAdminCamera : APawn {
	USphereComponent* CollisionSphere; // 0x280
	UHLLAdminCameraMovement* AdminCameraMovement; // 0x288
	UHLLAdminCameraSpringArm* CameraArm; // 0x290
	UCameraComponent* Camera; // 0x298
	UHLLMapComponent* MapComponent; // 0x2a0
	float TargetScanDistance; // 0x2a8
	float TargetScanRadius; // 0x2ac
	float ZoomSpeed; // 0x2b0
	UMaterialInterface* PostProcessMaterial; // 0x2b8
	float FOVZoomMin; // 0x2c0
	FFollowCamSettings VehicleSettings; // 0x2c4
	FFollowCamSettings CharacterSettings; // 0x2e4
	UMaterialInstanceDynamic* PostProcessMID; // 0x308
	float TargetArmRatio; // 0x310
	float CurrentArmRatio; // 0x314
	float MinArmLength; // 0x318
	float MaxArmLength; // 0x31c
	float TargetZoomRatio; // 0x320
	float CurrentZoomRatio; // 0x324
	FAdminCamTarget ReticleTarget; // 0x328
	FAdminCamTarget LockedTarget; // 0x338
	EAdminCamMode CurrentMode; // 0x2e78
	EAdminHighlightMode HighlightMode; // 0x2e79
	EAdminUIMode UIMode; // 0x2e7a
	char PermissionsMask; // 0x2e7b
};

struct UHLLScopeWidget : UUserWidget {
	AShooterWeapon* AssignedWeapon; // 0x230
	char bRotateWithLean : 1; // 0x238
	char bScopeParallax : 1; // 0x238
	UHLLScopeImage* ScopeImage; // 0x240
	UTextBlock* ZoomText; // 0x248
};

struct UFlamethrowerComponent : USceneComponent {
	AFlamethrowerBurningSpot* GroundBurningFX; // 0x1f0
	AFlamethrowerBurningCharacter* CharacterBurningFX; // 0x1f8
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	EARWorldAlignment WorldAlignment; // 0x37
	EARSessionType SessionType; // 0x38
	EARPlaneDetectionMode PlaneDetectionMode; // 0x39
	bool bHorizontalPlaneDetection; // 0x3a
	bool bVerticalPlaneDetection; // 0x3b
	bool bEnableAutoFocus; // 0x3c
	EARLightEstimationMode LightEstimationMode; // 0x3d
	EARFrameSyncMode FrameSyncMode; // 0x3e
	bool bEnableAutomaticCameraOverlay; // 0x3f
	bool bEnableAutomaticCameraTracking; // 0x40
	bool bResetCameraTracking; // 0x41
	bool bResetTrackedObjects; // 0x42
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8c
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8d
	TArray<char> SerializedARCandidateImageDatabase; // 0x90
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa0
};

struct UGamepadLayoutKey_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	URichTextBlock* ActionText; // 0x238
	UImage* ButtonIcon; // 0x240
	URichTextBlock* HoldActionText; // 0x248
	UScaleBox* IconScaleBox; // 0x250
	UHorizontalBox* LayoutContainer; // 0x258
	USpacer* Spacer_88; // 0x260
	UVerticalBox* TextContainer; // 0x268
	FKey AssociatedGamepadKey; // 0x270
	bool bIsTextOnLeftSide; // 0x288
	FText RichTextFormat; // 0x290
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UParticleModuleMeshRotation_Seeded : UParticleModuleMeshRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UPanelSlot : UVisual {
	UPanelWidget* Parent; // 0x28
	UWidget* Content; // 0x30
};

struct UMaterialExpressionSpriteTextureSampler : UMaterialExpressionTextureSampleParameter2D {
	bool bSampleAdditionalTextures; // 0xf0
	int32_t AdditionalSlotIndex; // 0xf4
	FText SlotDisplayName; // 0xf8
};

struct UMovieSceneFadeSection : UMovieSceneFloatSection {
	FLinearColor FadeColor; // 0x180
	char bFadeAudio : 1; // 0x190
};

struct UMockDataMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f0
	bool ScanWorld; // 0x200
	bool RequestNormals; // 0x201
	bool RequestVertexConfidence; // 0x202
	EMeshTrackerVertexColorMode VertexColorMode; // 0x203
	TArray<FColor> BlockVertexColors; // 0x208
	FLinearColor VertexColorFromConfidenceZero; // 0x218
	FLinearColor VertexColorFromConfidenceOne; // 0x228
	float UpdateInterval; // 0x238
	UMRMeshComponent* MRMesh; // 0x240
};

struct AHLLArtillerySpawner : AActor {
	USceneComponent* DummyRoot; // 0x220
	AHLLArtilleryBase* ArtilleryClass; // 0x228
};

struct AShooterBot : AShooterCharacter {
	UBehaviorTree* BotBehavior; // 0x1038
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	UDataTable* TextStyleSet; // 0x140
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x148
	bool bOverrideDefaultStyle; // 0x158
	FTextBlockStyle DefaultTextStyleOverride; // 0x160
	float MinDesiredWidth; // 0x3c8
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x638
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UNetReplicationGraphConnection : UReplicationConnectionDriver {
	UNetConnection* NetConnection; // 0x28
	AReplicationGraphDebugActor* DebugActor; // 0x170
	TArray<FLastLocationGatherInfo> LastGatherLocations; // 0x190
	TArray<UReplicationGraphNode*> ConnectionGraphNodes; // 0x1a8
	UReplicationGraphNode_TearOff_ForConnection* TearOffNode; // 0x1b8
};

struct AHLLCommanderAbility_Placeable : AHLLCommanderAbility {
	FRepAbilityPlacement PlacementData; // 0x350
	char bChatMessageNameSector : 1; // 0x35c
	char bAllowPlacementOutOfBounds : 1; // 0x35c
	char bSupportRotation : 1; // 0x35c
	char bTickPlacementChecks : 1; // 0x35c
	ECollisionChannel PlacementChannelName; // 0x35d
	char bFixedBaseRotation : 1; // 0x35e
	UHLLMapComponent* MapComponent; // 0x360
	char bTransformValid : 1; // 0x368
	char bIsPlacementValid : 1; // 0x368
	char bHideIconForThisActivation : 1; // 0x368
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct ABaseTruck : ABaseVehicle {
	AHLLSeat* FrontPassengerSeatClass; // 0x4e8
	int32_t NumBackPassengerSeats; // 0x4f0
	AHLLSeat* BackPassengerSeatClass; // 0x4f8
	AHLLSeat* FrontPassengerSeat; // 0x500
	TArray<AHLLSeat*> BackPassengerSeats; // 0x508
	UHLLArmourCollisionMesh* ArmourCollision_Body; // 0x518
};

struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FSpinBoxStyle SpinBoxStyle; // 0x30
};

struct ULayer : UObject {
	FName LayerName; // 0x28
	char bIsVisible : 1; // 0x30
	TArray<FLayerActorStats> ActorStats; // 0x38
};

struct UHLLRoundSummaryStat : UUserWidget {
	FSlateColor HostileTeamColour; // 0x230
	FSlateColor FriendlyTeamColour; // 0x258
	UTextBlock* TitleText; // 0x280
	UTextBlock* StatText; // 0x288
};

struct AHLLSeat : AActor {
	char bUsePostProcess : 1; // 0x220
	FPostProcessSettings PostSettings; // 0x230
	TArray<FHLLSeatZoomLevel> ZoomFOVList; // 0x778
	USoundBase* ZoomInSound; // 0x788
	USoundBase* ZoomOutSound; // 0x790
	AShooterCharacter* CurrentOccupant; // 0x798
	FHLLSeatOccupancyUpdate OccupancyUpdate; // 0x7a0
	FHLLSeatOccupancyUpdate PendingOccupancyUpdateRep; // 0x7b0
	bool bHasPendingOccupancyUpdate; // 0x7c0
	char bHideFirstPerson : 1; // 0x7c1
	char bHideThirdPerson : 1; // 0x7c1
	char bFirstPersonIsThirdPerson : 1; // 0x7c1
	char bHideThirdPersonHeadInFirstPerson : 1; // 0x7c1
	char bAllowSameTeamOnly : 1; // 0x7c1
	char bAllowEntryDuringMatchWarmup : 1; // 0x7c1
	char bAttachOccupant : 1; // 0x7c1
	ESeatAttachmentMode AttachmentMode; // 0x7c2
	char bProtectOccupant : 1; // 0x7c3
	char bUnequipWeaponOnSeating : 1; // 0x7c3
	char bUseSeatViewpoint : 1; // 0x7c3
	char bEnableLaserTagging : 1; // 0x7c3
	char bDisablePingMarkers : 1; // 0x7c4
	FName AttachSocketName; // 0x7c8
	FName EyepointSocketName; // 0x7d0
	UAnimInstance* OccupantAnim_1P; // 0x7d8
	UAnimInstance* OccupantAnim_3P; // 0x7e0
	UHLLSeatWidgetBase* SeatUI; // 0x7e8
	FSlateBrush SeatIcon; // 0x7f0
	FText SeatDisplayName; // 0x878
	TSet<EHint> HintsToDisplay; // 0x890
	char bClearEnterOrExitHintOnEnter : 1; // 0x8e0
	EHint CanEnterHint; // 0x8e1
	EHint CantEnterHint; // 0x8e2
	char bSendSeatCapsuleOffsets : 1; // 0x8e3
	ESeatOccupantDeathAction OccupantDeathAction; // 0x8e4
	USoundMix* SoundMix; // 0x8e8
	char bIsExterior : 1; // 0x8f0
	USoundBase* ExitSound; // 0x8f8
	USoundBase* EnterSound; // 0x900
	char bHasPushedSoundMix : 1; // 0x908
	UInputComponent* SeatInput; // 0x910
	AActor* SeatOwner; // 0x918
	int32_t SeatIndex; // 0x920
	float EntryTime; // 0x930
	float SwitchTime; // 0x934
	float ExitTime; // 0x938
	char bHidesPlayerNameHUDIndicator : 1; // 0x93c
	TArray<AHLLArmourWeapon*> OwnedWeapons; // 0x960
};

struct UHLLRoundSummaryDetails : UUserWidget {
	EViewMode CurrentViewMode; // 0x230
	UShooterGameViewportClient* ViewportClient; // 0x238
	TArray<UHLLRoundSummaryStat*> StatWidgets; // 0x240
	char bMatchEnded : 1; // 0x250
	bool ViewingPersonal; // 0x251
	int32_t MaxRows; // 0x254
	float StatUpdateFrequency; // 0x258
	UHLLTeamContainer* TeamContainerClass; // 0x268
	UHLLRoundSummaryStat* StatWidgetClass; // 0x270
	UHLLTeamContainer* AxisTeamData; // 0x278
	UHLLTeamContainer* AlliedTeamData; // 0x280
	UNamedSlot* LHSSlot; // 0x288
	UNamedSlot* RHSSlot; // 0x290
	UTextBlock* WinScoreText; // 0x298
	UTextBlock* LHSTeamName; // 0x2a0
	UTextBlock* RHSTeamName; // 0x2a8
	UTextBlock* LHSPlayerCount; // 0x2b0
	UTextBlock* RHSPlayerCount; // 0x2b8
	UImage* LHSTeamIcon; // 0x2c0
	UImage* RHSTeamIcon; // 0x2c8
	UWidget* CommendationHint; // 0x2d0
	UUniformGridPanel* StatGridPanel; // 0x2d8
	UWidgetSwitcher* ContentSwitcher; // 0x2e0
	UTextBlock* ServerPopulationText; // 0x2e8
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UShooterCheatManager : UCheatManager {
	char bGodMode : 1; // 0x78
};

struct UMovieSceneByteSection : UMovieSceneSection {
	FMovieSceneByteChannel ByteCurve; // 0xe0
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x220
};

struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x148
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c
	double MaxTimeSlicePerTick; // 0x150
	float HighImportanceQueryDistanceThreshold; // 0x158
	float MaxQueryImportance; // 0x160
	float SightLimitQueryImportance; // 0x164
};

struct UHLLMedicIndicator : UHLLIndicatorBase {
	UTextBlock* DistanceText; // 0x2a8
	UTextBlock* PlayerName; // 0x2b0
};

struct USoundfieldSubmix : USoundSubmixWithParentBase {
	FName SoundfieldEncodingFormat; // 0x40
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x48
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x60
};

struct UHLLAimAssistManager : UWorldSubsystem {
	UHLLAimAssistSettingsDataAsset* AimAssistSettingsAsset; // 0x30
};

struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x438
	int32_t PreviousLODLevel; // 0x43c
	int32_t MinLOD; // 0x440
	int32_t SubDivisionStepSize; // 0x444
	UStaticMesh* StaticMesh; // 0x448
	FColor WireframeColorOverride; // 0x450
	char bEvaluateWorldPositionOffset : 1; // 0x454
	char bOverrideWireframeColor : 1; // 0x454
	char bOverrideMinLod : 1; // 0x454
	char bOverrideNavigationExport : 1; // 0x454
	char bForceNavigationObstacle : 1; // 0x454
	char bDisallowMeshPaintPerInstance : 1; // 0x454
	char bIgnoreInstanceForTextureStreaming : 1; // 0x454
	char bOverrideLightMapRes : 1; // 0x454
	char bCastDistanceFieldIndirectShadow : 1; // 0x455
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x455
	char bUseSubDivisions : 1; // 0x455
	char bUseDefaultCollision : 1; // 0x455
	char bReverseCulling : 1; // 0x455
	int32_t OverriddenLightMapRes; // 0x458
	float DistanceFieldIndirectShadowMinVisibility; // 0x45c
	float DistanceFieldSelfShadowBias; // 0x460
	float StreamingDistanceMultiplier; // 0x464
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x468
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x478
	FLightmassPrimitiveSettings LightmassSettings; // 0x488
};

struct ULandscapeSplinesComponent : UPrimitiveComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x410
	TArray<ULandscapeSplineSegment*> Segments; // 0x420
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x430
};

struct UWGT_RadialMarkers_Segment_C : UHLLRadialMenu_MarkersSegment {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	USizeBox* IconSizer; // 0x290
	UImage* SegmentBG; // 0x298
	FLinearColor DefaultBGColor; // 0x2a0
	FLinearColor DefaultColor; // 0x2b0
	UMaterialInstanceDynamic* DynMatSegmentBG; // 0x2c0
};

struct UCharacterMovementComponent : UPawnMovementComponent {
	ACharacter* CharacterOwner; // 0x148
	float GravityScale; // 0x150
	float MaxStepHeight; // 0x154
	float JumpZVelocity; // 0x158
	float JumpOffJumpZFactor; // 0x15c
	float WalkableFloorAngle; // 0x160
	float WalkableFloorZ; // 0x164
	EMovementMode MovementMode; // 0x168
	char CustomMovementMode; // 0x169
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x16a
	float GroundFriction; // 0x16c
	float MaxWalkSpeed; // 0x18c
	float MaxWalkSpeedCrouched; // 0x190
	float MaxSwimSpeed; // 0x194
	float MaxFlySpeed; // 0x198
	float MaxCustomMovementSpeed; // 0x19c
	float MaxAcceleration; // 0x1a0
	float MinAnalogWalkSpeed; // 0x1a4
	float BrakingFrictionFactor; // 0x1a8
	float BrakingFriction; // 0x1ac
	float BrakingSubStepTime; // 0x1b0
	float BrakingDecelerationWalking; // 0x1b4
	float BrakingDecelerationFalling; // 0x1b8
	float BrakingDecelerationSwimming; // 0x1bc
	float BrakingDecelerationFlying; // 0x1c0
	float AirControl; // 0x1c4
	float AirControlBoostMultiplier; // 0x1c8
	float AirControlBoostVelocityThreshold; // 0x1cc
	float FallingLateralFriction; // 0x1d0
	float CrouchedHalfHeight; // 0x1d4
	float Buoyancy; // 0x1d8
	float PerchRadiusThreshold; // 0x1dc
	float PerchAdditionalHeight; // 0x1e0
	FRotator RotationRate; // 0x1e4
	char bUseSeparateBrakingFriction : 1; // 0x1f0
	char bApplyGravityWhileJumping : 1; // 0x1f0
	char bUseControllerDesiredRotation : 1; // 0x1f0
	char bOrientRotationToMovement : 1; // 0x1f0
	char bSweepWhileNavWalking : 1; // 0x1f0
	char bMovementInProgress : 1; // 0x1f0
	char bEnableScopedMovementUpdates : 1; // 0x1f0
	char bEnableServerDualMoveScopedMovementUpdates : 1; // 0x1f1
	char bForceMaxAccel : 1; // 0x1f1
	char bRunPhysicsWithNoController : 1; // 0x1f1
	char bForceNextFloorCheck : 1; // 0x1f1
	char bShrinkProxyCapsule : 1; // 0x1f1
	char bCanWalkOffLedges : 1; // 0x1f1
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x1f1
	char bNetworkSkipProxyPredictionOnNetUpdate : 1; // 0x1f2
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1; // 0x1f2
	char bDeferUpdateMoveComponent : 1; // 0x1f2
	char bEnablePhysicsInteraction : 1; // 0x1f2
	char bTouchForceScaledToMass : 1; // 0x1f2
	char bPushForceScaledToMass : 1; // 0x1f2
	char bPushForceUsingZOffset : 1; // 0x1f2
	char bScalePushForceToVelocity : 1; // 0x1f3
	USceneComponent* DeferredUpdatedMoveComponent; // 0x1f8
	float MaxOutOfWaterStepHeight; // 0x200
	float OutofWaterZ; // 0x204
	float Mass; // 0x208
	float StandingDownwardForceScale; // 0x20c
	float InitialPushForceFactor; // 0x210
	float PushForceFactor; // 0x214
	float PushForcePointZOffsetFactor; // 0x218
	float TouchForceFactor; // 0x21c
	float MinTouchForce; // 0x220
	float MaxTouchForce; // 0x224
	float RepulsionForce; // 0x228
	FVector Acceleration; // 0x22c
	FQuat LastUpdateRotation; // 0x240
	FVector LastUpdateLocation; // 0x250
	FVector LastUpdateVelocity; // 0x25c
	float ServerLastTransformUpdateTimeStamp; // 0x268
	float ServerLastClientGoodMoveAckTime; // 0x26c
	float ServerLastClientAdjustmentTime; // 0x270
	FVector PendingImpulseToApply; // 0x274
	FVector PendingForceToApply; // 0x280
	float AnalogInputModifier; // 0x28c
	float MaxSimulationTimeStep; // 0x29c
	int32_t MaxSimulationIterations; // 0x2a0
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x2a4
	float MaxDepenetrationWithGeometry; // 0x2a8
	float MaxDepenetrationWithGeometryAsProxy; // 0x2ac
	float MaxDepenetrationWithPawn; // 0x2b0
	float MaxDepenetrationWithPawnAsProxy; // 0x2b4
	float NetworkSimulatedSmoothLocationTime; // 0x2b8
	float NetworkSimulatedSmoothRotationTime; // 0x2bc
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2c0
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2c4
	float NetProxyShrinkRadius; // 0x2c8
	float NetProxyShrinkHalfHeight; // 0x2cc
	float NetworkMaxSmoothUpdateDistance; // 0x2d0
	float NetworkNoSmoothUpdateDistance; // 0x2d4
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2d8
	float NetworkMinTimeBetweenClientAdjustments; // 0x2dc
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2e0
	float NetworkLargeClientCorrectionDistance; // 0x2e4
	float LedgeCheckThreshold; // 0x2e8
	float JumpOutOfWaterPitch; // 0x2ec
	FFindFloorResult CurrentFloor; // 0x2f0
	EMovementMode DefaultLandMovementMode; // 0x384
	EMovementMode DefaultWaterMovementMode; // 0x385
	EMovementMode GroundMovementMode; // 0x386
	char bMaintainHorizontalGroundVelocity : 1; // 0x387
	char bImpartBaseVelocityX : 1; // 0x387
	char bImpartBaseVelocityY : 1; // 0x387
	char bImpartBaseVelocityZ : 1; // 0x387
	char bImpartBaseAngularVelocity : 1; // 0x387
	char bJustTeleported : 1; // 0x387
	char bNetworkUpdateReceived : 1; // 0x387
	char bNetworkMovementModeChanged : 1; // 0x387
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x388
	char bServerAcceptClientAuthoritativePosition : 1; // 0x388
	char bNotifyApex : 1; // 0x388
	char bCheatFlying : 1; // 0x388
	char bWantsToCrouch : 1; // 0x388
	char bCrouchMaintainsBaseLocation : 1; // 0x388
	char bIgnoreBaseRotation : 1; // 0x388
	char bFastAttachedMove : 1; // 0x388
	char bAlwaysCheckFloor : 1; // 0x389
	char bUseFlatBaseForFloorChecks : 1; // 0x389
	char bPerformingJumpOff : 1; // 0x389
	char bWantsToLeaveNavWalking : 1; // 0x389
	char bUseRVOAvoidance : 1; // 0x389
	char bRequestedMoveUseAcceleration : 1; // 0x389
	char bWasSimulatingRootMotion : 1; // 0x389
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x38a
	char bHasRequestedVelocity : 1; // 0x38a
	char bRequestedMoveWithMaxSpeed : 1; // 0x38a
	char bWasAvoidanceUpdated : 1; // 0x38a
	char bProjectNavMeshWalking : 1; // 0x38a
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x38a
	float AvoidanceConsiderationRadius; // 0x39c
	FVector RequestedVelocity; // 0x3a0
	int32_t AvoidanceUID; // 0x3ac
	FNavAvoidanceMask AvoidanceGroup; // 0x3b0
	FNavAvoidanceMask GroupsToAvoid; // 0x3b4
	FNavAvoidanceMask GroupsToIgnore; // 0x3b8
	float AvoidanceWeight; // 0x3bc
	FVector PendingLaunchVelocity; // 0x3c0
	float NavMeshProjectionInterval; // 0x470
	float NavMeshProjectionTimer; // 0x474
	float NavMeshProjectionInterpSpeed; // 0x478
	float NavMeshProjectionHeightScaleUp; // 0x47c
	float NavMeshProjectionHeightScaleDown; // 0x480
	float NavWalkingFloorDistTolerance; // 0x484
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x488
	float MinTimeBetweenTimeStampResets; // 0x4d0
	FRootMotionSourceGroup CurrentRootMotion; // 0x4d8
	FRootMotionMovementParams RootMotionParams; // 0x5a0
	FVector AnimRootMotionVelocity; // 0x5e0
};

struct AReconVehiclePassengerSeat : AVehicleSeatBase {
	USceneComponent* InteriorMeshAttachmentRoot; // 0x978
	UStaticMeshComponent* InteriorMesh; // 0x980
	USeatCameraController* CameraController; // 0x988
};

struct UW_HoverToolTip_C : UUserWidget {
	UTextBlock* TextBlock_1; // 0x230
	FText Text_Tooltip; // 0x238
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe0
};

struct UHTP_Widget_Role_Loadout_Item_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UImage* bottomline; // 0x238
	UBPW_EquipmentItem_C* BPW_EquipmentItem; // 0x240
	UTextBlock* label_slotType; // 0x248
	UTextBlock* txt_primaryName; // 0x250
	EWeaponType Weapon; // 0x258
	E_SlotTypes SlotType; // 0x259
	E_SlotSizes SlotSize; // 0x25a
};

struct UVaultingComponent : UActorComponent {
	float MinObstacleHeight; // 0xb0
	float MaxObstacleHeight; // 0xb4
	float MaxObstacleThicknessToVaultOver; // 0xb8
	float MaxDistanceToObstacle; // 0xbc
	float MaxAllowedAngleFromFacingObstacleStraight; // 0xc0
	float MinOpeningWidthForVaulting; // 0xc4
	float MinOpeningHeightForVaulting; // 0xc8
	float MaxClimbableObstacleHeightStillClassifiedAsVault; // 0xcc
};

struct UHLLUI_LoadoutTooltip : UUserWidget {
	UTextBlock* ItemName; // 0x230
	UTextBlock* RequirementText; // 0x238
	UShooterGameViewportClient* ViewportClient; // 0x240
};

struct UHLLUI_Credits : UUserWidget {
	UScrollBox* CreditsScroller; // 0x230
	float AutoScrollSpeed; // 0x238
	float LeadEmptySpaceHeight; // 0x240
	UStringTable* RolesStringTable; // 0x248
	UStringTable* DepartmentsStringTable; // 0x250
	UDataTable* CreditsInfo; // 0x258
	UDataTable* OrganisationInfo; // 0x260
	UHLLUI_CreditsOrganisation* OrganisationWidget; // 0x268
	UHLLUI_CreditsCategory_Department* DepartmentWidget; // 0x270
	UHLLUI_CreditsCategory_RoleAndMembers* RolesAndMembersWidget; // 0x278
	TMap<FName, UHLLUI_CreditsOrganisation*> OrganisationOverrides; // 0x280
	TMap<FName, UHLLUI_CreditsCategory_Department*> DepartmentOverrides; // 0x2d0
	TMap<FName, UHLLUI_CreditsCategory_RoleAndMembers*> RolesAndMembersOverrides; // 0x320
};

struct UPlatoonManagementStack : UUserWidget {
	UBorder* RequestsContainer; // 0x230
	UBorder* NotificationsContainer; // 0x248
	UPlatoonManagementStackNotification* NotificationWidget; // 0x250
	TArray<FPlatoonManagementNotification> PendingNotifications; // 0x258
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char bCastStaticShadow : 1; // 0x38c
	char bCastShadowAsTwoSided : 1; // 0x38c
	char bCastFarShadow : 1; // 0x38c
	char bAffectDistanceFieldLighting : 1; // 0x390
	FLightingChannels LightingChannels; // 0x391
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x394
	char bRenderCustomDepth : 1; // 0x394
	int32_t CustomDepthStencilValue; // 0x398
	float LDMaxDrawDistance; // 0x39c
	FLightmassPrimitiveSettings LightmassSettings; // 0x3a0
	int32_t CollisionMipLevel; // 0x3b8
	int32_t SimpleCollisionMipLevel; // 0x3bc
	float CollisionThickness; // 0x3c0
	FBodyInstance BodyInstance; // 0x3c8
	char bGenerateOverlapEvents : 1; // 0x4f8
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x4f8
	int32_t ComponentSizeQuads; // 0x4fc
	int32_t SubsectionSizeQuads; // 0x500
	int32_t NumSubsections; // 0x504
	char bUsedForNavigation : 1; // 0x508
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x508
	bool bUseDynamicMaterialInstance; // 0x50c
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x50d
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x50e
	bool bHasLayersContent; // 0x50f
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x510
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x60
	float LpvBiasMultiplier; // 0x64
	TArray<FStaticMaterial> StaticMaterials; // 0x68
	float LightmapUVDensity; // 0x78
	int32_t LightMapResolution; // 0x7c
	int32_t LightMapCoordinateIndex; // 0x80
	float DistanceFieldSelfShadowBias; // 0x84
	UBodySetup* BodySetup; // 0x88
	int32_t LODForCollision; // 0x90
	char bGenerateMeshDistanceField : 1; // 0x94
	char bStripComplexCollisionForConsole : 1; // 0x94
	char bHasNavigationData : 1; // 0x94
	char bSupportUniformlyDistributedSampling : 1; // 0x94
	char bSupportPhysicalMaterialMasks : 1; // 0x94
	char bIsBuiltAtRuntime : 1; // 0x94
	char bAllowCPUAccess : 1; // 0x94
	char bSupportGpuUniformlyDistributedSampling : 1; // 0x95
	TArray<UStaticMeshSocket*> Sockets; // 0xb8
	FVector PositiveBoundsExtension; // 0xd8
	FVector NegativeBoundsExtension; // 0xe4
	FBoxSphereBounds ExtendedBounds; // 0xf0
	int32_t ElementToIgnoreForTexFactor; // 0x10c
	TArray<UAssetUserData*> AssetUserData; // 0x110
	UObject* EditableMesh; // 0x128
	UNavCollisionBase* NavCollision; // 0x130
};

struct UBPW_SpeakingPlayersListItem_C : USpeakingPlayersListItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Image_1; // 0x250
	UImage* PlatformIcon; // 0x258
};

struct AGameNetworkManager : AInfo {
	float BadPacketLossThreshold; // 0x220
	float SeverePacketLossThreshold; // 0x224
	int32_t BadPingThreshold; // 0x228
	int32_t SeverePingThreshold; // 0x22c
	int32_t AdjustedNetSpeed; // 0x230
	float LastNetSpeedUpdateTime; // 0x234
	int32_t TotalNetBandwidth; // 0x238
	int32_t MinDynamicBandwidth; // 0x23c
	int32_t MaxDynamicBandwidth; // 0x240
	char bIsStandbyCheckingEnabled : 1; // 0x244
	char bHasStandbyCheatTriggered : 1; // 0x244
	float StandbyRxCheatTime; // 0x248
	float StandbyTxCheatTime; // 0x24c
	float PercentMissingForRxStandby; // 0x250
	float PercentMissingForTxStandby; // 0x254
	float PercentForBadPing; // 0x258
	float JoinInProgressStandbyWaitTime; // 0x25c
	float MoveRepSize; // 0x260
	float MAXPOSITIONERRORSQUARED; // 0x264
	float MAXNEARZEROVELOCITYSQUARED; // 0x268
	float CLIENTADJUSTUPDATECOST; // 0x26c
	float MAXCLIENTUPDATEINTERVAL; // 0x270
	float MaxClientForcedUpdateDuration; // 0x274
	float ServerForcedUpdateHitchThreshold; // 0x278
	float ServerForcedUpdateHitchCooldown; // 0x27c
	float MaxMoveDeltaTime; // 0x280
	float MaxClientSmoothingDeltaTime; // 0x284
	float ClientNetSendMoveDeltaTime; // 0x288
	float ClientNetSendMoveDeltaTimeThrottled; // 0x28c
	float ClientNetSendMoveDeltaTimeStationary; // 0x290
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x294
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x298
	bool ClientAuthorativePosition; // 0x29c
	float ClientErrorUpdateRateLimit; // 0x2a0
	float ClientNetCamUpdateDeltaTime; // 0x2a4
	float ClientNetCamUpdatePositionLimit; // 0x2a8
	bool bMovementTimeDiscrepancyDetection; // 0x2ac
	bool bMovementTimeDiscrepancyResolution; // 0x2ad
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x2b0
	float MovementTimeDiscrepancyMinTimeMargin; // 0x2b4
	float MovementTimeDiscrepancyResolutionRate; // 0x2b8
	float MovementTimeDiscrepancyDriftAllowance; // 0x2bc
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2c0
	bool bUseDistanceBasedRelevancy; // 0x2c1
};

struct UHLLAdminCamUI : UUserWidget {
	UWidget* PlayerSearchPanel; // 0x230
	UWidget* KickBanPanel; // 0x238
	UWidget* HotkeyPanel; // 0x240
	UScrollBox* PlayerSearchEntryBox; // 0x248
	UEditableTextBox* PlayerNameFilter; // 0x250
	UEditableTextBox* KickBanReasonEntry; // 0x258
	UProgressBar* SpeedBar; // 0x260
	UTextBlock* NumPlayersText; // 0x268
	UHLLAdminCamPlayerEntry* PlayerEntryWidget; // 0x270
	TArray<UHLLAdminCamPlayerEntry*> PlayerWidgets; // 0x278
	AShooterPlayerState* SelectedPlayer; // 0x288
};

struct UPlatformInterfaceBase : UObject {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UCameraShake : UObject {
	char bSingleInstance : 1; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	FROscillator RotOscillation; // 0x38
	FVOscillator LocOscillation; // 0x5c
	FFOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	UCameraAnim* Anim; // 0xa0
	char bRandomAnimSegment : 1; // 0xa8
	APlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	UCameraAnimInst* AnimInst; // 0x150
};

struct UServerQueueProgressWidget : UUserWidget {
	UTextBlock* BodyText; // 0x248
	UButton* CancelButton; // 0x250
	UWidget* MatchOverIndicator; // 0x258
	AServerQueueBeaconClient* BeaconClient; // 0x260
};

struct ABP_Powerline_Master_C : AActor {
	UStaticMeshComponent* Cable2; // 0x220
	UStaticMeshComponent* Cable1; // 0x228
	UStaticMeshComponent* Connector2; // 0x230
	UStaticMeshComponent* Connector1; // 0x238
	UStaticMeshComponent* SM_PowerPole; // 0x240
	USceneComponent* Root; // 0x248
	TArray<ABP_Powerline_Master_C*> Powerlines; // 0x250
	TArray<ABP_Powerline_Master_C*> Temp Powerlines; // 0x260
	ABP_Powerline_Master_C* Closest Powerline; // 0x270
	float Closest Distance; // 0x278
	int32_t Powerline Target; // 0x27c
	int32_t Number Of Powerlines; // 0x280
	bool Has Lamp; // 0x284
	bool Has Transformer; // 0x285
	bool Has Frames; // 0x286
	bool Has Pegs; // 0x287
	bool Light On; // 0x288
	UMaterialInstanceDynamic* DMI_Main; // 0x290
	float Rust Opacity; // 0x298
	float Rust Tweaker; // 0x29c
	float Rust Flipper; // 0x2a0
	FLinearColor Color; // 0x2a4
	TArray<ABP_Powerline_Master_C*> Sorted Powerlines; // 0x2b8
	UStaticMesh* Cable 1 Style; // 0x2c8
	UStaticMesh* Cable 2 Style; // 0x2d0
	float Light Intensity; // 0x2d8
	TSoftObjectPtr<ABP_Powerline_Master_C> Powerline; // 0x2e0
	bool NewVar_1; // 0x308
};

struct UParticleModuleRotationRate_Seeded : UParticleModuleRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe0
};

struct UArmyCommanderRole : UUserWidget {
	char bReadOnly : 1; // 0x230
	UImage* RoleIcon; // 0x238
	UTextBlock* PlayerName; // 0x240
	UWidgetSwitcher* ButtonSwitcher; // 0x248
	UUserWidget* ClaimRole; // 0x250
	UUserWidget* ReleaseRole; // 0x258
};

struct UMRMeshComponent : UPrimitiveComponent {
	UMaterialInterface* Material; // 0x418
	bool bCreateMeshProxySections; // 0x420
	bool bUpdateNavMeshOnMeshUpdate; // 0x421
	bool bNeverCreateCollisionMesh; // 0x422
	UBodySetup* CachedBodySetup; // 0x428
	TArray<UBodySetup*> BodySetups; // 0x430
	UMaterialInterface* WireframeMaterial; // 0x440
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UThrobber : UWidget {
	int32_t NumberOfPieces; // 0x108
	bool bAnimateHorizontally; // 0x10c
	bool bAnimateVertically; // 0x10d
	bool bAnimateOpacity; // 0x10e
	USlateBrushAsset* PieceImage; // 0x110
	FSlateBrush Image; // 0x118
};

struct UArtyTurnControllerComponent : UPitchYawControllerComponent {
	AHLLSeat_ArtilleryGunner* GunnerSeat; // 0x488
	AHLLSeat_ArtilleryLoader* LoaderSeat; // 0x490
	UCapsuleComponent* CharacterTurretGuard; // 0x498
	UAudioComponent* TurnAudio; // 0x4a0
	UVibrationEventController* TurnVibrationController; // 0x4a8
};

struct UMaterialExpressionScalarParameter : UMaterialExpressionParameter {
	float DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x5c
	char PrimitiveDataIndex; // 0x5d
};

struct UMaterialExpressionStaticSwitchParameter : UMaterialExpressionStaticBoolParameter {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x74
};

struct UWGT_RoundSummaryStat_C : UHLLRoundSummaryStat {
	UImage* Image_1; // 0x290
};

struct AExponentialHeightFog : AInfo {
	UExponentialHeightFogComponent* Component; // 0x220
	char bEnabled : 1; // 0x228
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x258
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct UMaterialExpressionBlackBody : UMaterialExpression {
	FExpressionInput Temp; // 0x40
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct UHLLSectorIndicator : UHLLIndicatorBase {
	UTextBlock* SectorNameText; // 0x2a8
	UProgressBar* CaptureProgress_Friendly; // 0x2b0
	UProgressBar* CaptureProgress_Enemy; // 0x2b8
	UImage* CurrentCap; // 0x2c0
	UTextBlock* DistanceText; // 0x2c8
	UImage* ResourceBrush; // 0x2d0
	UImage* FlagBrush; // 0x2d8
	UWidgetAnimation* AnimExpandCollapse; // 0x2e0
	bool bExpandedState; // 0x2e8
	float ExpandedAngle; // 0x2ec
	FLinearColor Colour_Neutral; // 0x2f0
	FLinearColor Colour_Friendly; // 0x300
	FLinearColor Colour_Enemy; // 0x310
};

struct USoundNodeVehicleEngine : USoundNode {
	char bEqualPowerCrossfade : 1; // 0x48
	TArray<FVehicleEngineDatum> EngineSamples; // 0x50
	float CurrentRPM; // 0x64
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct AInteractiveFoliageActor : AStaticMeshActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	FVector TouchingActorEntryPosition; // 0x238
	FVector FoliageVelocity; // 0x244
	FVector FoliageForce; // 0x250
	FVector FoliagePosition; // 0x25c
	float FoliageDamageImpulseScale; // 0x268
	float FoliageTouchImpulseScale; // 0x26c
	float FoliageStiffness; // 0x270
	float FoliageStiffnessQuadratic; // 0x274
	float FoliageDamping; // 0x278
	float MaxDamageImpulse; // 0x27c
	float MaxTouchImpulse; // 0x280
	float MaxForce; // 0x284
	float Mass; // 0x288
};

struct UCurveLinearColorAtlas : UTexture2D {
	uint32_t TextureSize; // 0xe8
	TArray<UCurveLinearColor*> GradientCurves; // 0xf0
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UOptionsHeader_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UTextBlock* HeaderText; // 0x238
	FText HeaderValue; // 0x240
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x228
};

struct UTimelineTemplate : UObject {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	FName VariableName; // 0x90
	FName DirectionPropertyName; // 0x98
	FName UpdateFunctionName; // 0xa0
	FName FinishedFunctionName; // 0xa8
};

struct UWGT_BarracksPanel_V2_C : UHLLUI_CharacterSelection {
	FPointerToUberGraphFrame UberGraphFrame; // 0x358
	UWidgetAnimation* FadeInRightColumn; // 0x360
	UWidgetAnimation* FadeInLeftColumn; // 0x368
	UWidgetAnimation* Fade; // 0x370
	UWidgetAnimation* TitleChange; // 0x378
	UWidgetAnimation* RightPanelChange; // 0x380
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x388
	USlider* CharacterSpinSlider; // 0x390
	UVerticalBox* CosmeticDetailsVBox; // 0x398
	UOptionButton_V2_C* FactionSwitcher; // 0x3a0
	UHorizontalBox* HBox_Switcher; // 0x3a8
	USizeBox* LeftSBox; // 0x3b0
	UTabbedButtonContainer_V2_C* LoadoutTabbedButtonContainer; // 0x3b8
	USizeBox* RightSBox; // 0x3c0
	UVerticalBox* RoleDetailsVBox; // 0x3c8
	UTabbedButtonContainer_V2_C* RoleTabbedButtonContainer; // 0x3d0
	UScrollBox* SB_Roles; // 0x3d8
	UTextBlock* TeamCategory; // 0x3e0
	UMainMenuWidget_V2_C* MainMenu; // 0x3e8
	int32_t ButtonIndex; // 0x3f0
	UWGT_RoleSelectItem_V2_C* SelectedRole; // 0x3f8
	bool bFocusedOnRoles; // 0x400
	UMatchmakingScreen_V2_C* MatchmakingScreen; // 0x408
	bool bWasFocused; // 0x410
	int32_t FactionIndex; // 0x414
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xe0
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct APaperFlipbookActor : AActor {
	UPaperFlipbookComponent* RenderComponent; // 0x220
};

struct AHLLSupplyDropBase : AActor {
	USceneComponent* SceneRoot; // 0x288
	UStaticMeshComponent* Mesh; // 0x290
	UHLLMapComponent* MapComponent; // 0x298
	UHLLIndicatorComponent* IndicatorComponent; // 0x2a0
	UHLLSimpleHealthComponent* HealthComponent; // 0x2a8
	float DismantleTime; // 0x2b0
	FText DisplayName; // 0x2b8
	ETeam OwningTeam; // 0x2d0
	EHLLDamageFilterType DamageFilterType; // 0x2d1
	AShooterPlayerState* SpawnedByPlayer; // 0x2d8
};

struct UHLLMapIcon_Player : UHLLMapIconBase {
	char bIsHighlighted : 1; // 0x368
	UWidgetAnimation* PlayerPingAnimation; // 0x378
	UWidgetAnimation* HighlightAnimation; // 0x380
	UTextBlock* PlatoonID; // 0x388
	UImage* Icon_Star; // 0x390
	UImage* LocalPlayerFOV; // 0x398
	UWidget* RotationContainer; // 0x3a0
};

struct UPlatoonMemberCommander : UPlatoonMemberBase {
	UBorder* Colouriser; // 0x278
	UWidgetAnimation* Anim_NoCommander; // 0x280
	FLinearColor WarningColour; // 0x288
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x58
	char bFireEventsWhenBackwards : 1; // 0x58
	EFireEventsAtPosition EventPosition; // 0x5c
	TArray<FMovieSceneObjectBindingID> EventReceivers; // 0x60
	TArray<UMovieSceneSection*> Sections; // 0x70
};

struct UParticleModuleColor : UParticleModuleColorBase {
	FRawDistributionVector StartColor; // 0x30
	FRawDistributionFloat StartAlpha; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UHLLIndicatorBase : UUserWidget {
	float ViewDistance; // 0x230
	float EnemyViewDistance; // 0x234
	float VerticalOffset; // 0x238
	FLinearColor EnemyTint; // 0x23c
	FVector2D IconAlignment; // 0x24c
	char bFadeWithHUD : 1; // 0x254
	char bScaleOverDistance : 1; // 0x254
	char bCustomColourise : 1; // 0x254
	char bShowEnemy : 1; // 0x254
	char bShowEnemyInAdminCamera : 1; // 0x254
	char bHideWhenAimedAt : 1; // 0x254
	char bOnlyHideInADS : 1; // 0x254
	int32_t ZPriority; // 0x258
	float AngleTolerance; // 0x25c
	char bEnableOcclusionTest : 1; // 0x260
	ECollisionChannel OcclusionTraceChannel; // 0x261
	TWeakObjectPtr<UHLLIndicatorComponent> AssignedComponent; // 0x264
	UImage* Icon; // 0x270
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x438
	EWidgetTimingPolicy TimingPolicy; // 0x439
	UUserWidget* WidgetClass; // 0x440
	FIntPoint DrawSize; // 0x448
	bool bManuallyRedraw; // 0x450
	bool bRedrawRequested; // 0x451
	float RedrawTime; // 0x454
	FIntPoint CurrentDrawSize; // 0x460
	bool bDrawAtDesiredSize; // 0x468
	FVector2D Pivot; // 0x46c
	bool bReceiveHardwareInput; // 0x474
	bool bWindowFocusable; // 0x475
	EWindowVisibility WindowVisibility; // 0x476
	bool bApplyGammaCorrection; // 0x477
	ULocalPlayer* OwnerPlayer; // 0x478
	FLinearColor BackgroundColor; // 0x480
	FLinearColor TintColorAndOpacity; // 0x490
	float OpacityFromTexture; // 0x4a0
	EWidgetBlendMode BlendMode; // 0x4a4
	bool bIsTwoSided; // 0x4a5
	bool TickWhenOffscreen; // 0x4a6
	UUserWidget* Widget; // 0x4a8
	UBodySetup* BodySetup; // 0x4d0
	UMaterialInterface* TranslucentMaterial; // 0x4d8
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4e0
	UMaterialInterface* OpaqueMaterial; // 0x4e8
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x4f0
	UMaterialInterface* MaskedMaterial; // 0x4f8
	UMaterialInterface* MaskedMaterial_OneSided; // 0x500
	UTextureRenderTarget2D* RenderTarget; // 0x508
	UMaterialInstanceDynamic* MaterialInstance; // 0x510
	bool bAddedToScreen; // 0x518
	bool bEditTimeUsable; // 0x519
	FName SharedLayerName; // 0x51c
	int32_t LayerZOrder; // 0x524
	EWidgetGeometryMode GeometryMode; // 0x528
	float CylinderArcAngle; // 0x52c
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct AARSkyLight : ASkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x230
};

struct UHLLArmourHealthComponent : UActorComponent {
	FHLLArmourDeltaInfo ArmourInfo; // 0xc8
	float ExplodeDelay; // 0x1f8
	float MinTimeBetweenRepairSounds; // 0x1fc
	USoundBase* RepairSound; // 0x200
	USoundBase* RepairCompleteSound; // 0x208
	AController* KilledInstigator; // 0x220
	UHLLVehicleDamageFX* DamageEffectData; // 0x228
	AHLLVehicleWreck* WreckActor; // 0x230
	float DeathExplosionDamage; // 0x238
	float DeathExplosionRadius; // 0x23c
	float DeathExplosionSuppression; // 0x240
	float DeathExplosionSuppressionRadius; // 0x244
	UDamageType* ExplosionDamageType; // 0x248
	AShooterImpactEffect* ExplosionEffect; // 0x250
	TMap<FName, FHLLActiveDamageFX> ActiveDamageFX; // 0x258
	UPrimitiveComponent* OverrideReferenceComponent; // 0x2a8
	EHLLArmourRating DefaultArmourRating; // 0x2b0
	float DefaultResistance[0x4]; // 0x2b4
	TArray<FArmouredBody> ArmouredBodies; // 0x2c8
	TArray<FArmourBox> Compartments; // 0x2d8
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieSceneSequencePlayer : UObject {
	FMulticastInlineDelegate OnPlay; // 0x408
	FMulticastInlineDelegate OnPlayReverse; // 0x418
	FMulticastInlineDelegate OnStop; // 0x428
	FMulticastInlineDelegate OnPause; // 0x438
	FMulticastInlineDelegate OnFinished; // 0x448
	EMovieScenePlayerStatus Status; // 0x458
	char bReversePlayback : 1; // 0x45c
	UMovieSceneSequence* Sequence; // 0x460
	FFrameNumber StartTime; // 0x468
	int32_t DurationFrames; // 0x46c
	int32_t CurrentNumLoops; // 0x470
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x4a0
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x828
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x838
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x840
	float CheckpointSaveMaxMSPerFrame; // 0xc54
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xc88
	bool bIsLocalReplay; // 0xce8
	TArray<APlayerController*> SpectatorControllers; // 0xcf0
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileUseLegacyShadingModel : 1; // 0x44
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	char bAnisotropicBRDF : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6c
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	ECustomDepthStencil CustomDepthStencil; // 0x88
	char bCustomDepthTaaJitter : 1; // 0x8c
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x90
	char bDefaultFeatureBloom : 1; // 0x94
	char bDefaultFeatureAmbientOcclusion : 1; // 0x94
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x94
	char bDefaultFeatureAutoExposure : 1; // 0x94
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x98
	float DefaultFeatureAutoExposureBias; // 0x9c
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa0
	char bUsePreExposure : 1; // 0xa0
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa0
	char bDefaultFeatureMotionBlur : 1; // 0xa0
	char bDefaultFeatureLensFlare : 1; // 0xa0
	char bTemporalUpsampling : 1; // 0xa0
	char bSSGI : 1; // 0xa0
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa4
	ELightUnits DefaultLightUnits; // 0xa5
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xa6
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xa8
	char bStencilForLODDither : 1; // 0xa8
	EEarlyZPass EarlyZPass; // 0xac
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb0
	char bDBuffer : 1; // 0xb0
	EClearSceneOptions ClearSceneMethod; // 0xb4
	char bBasePassOutputsVelocity : 1; // 0xb8
	char bVertexDeformationOutputsVelocity : 1; // 0xb8
	char bSelectiveBasePassOutputs : 1; // 0xb8
	char bDefaultParticleCutouts : 1; // 0xb8
	int32_t GPUSimulationTextureSizeX; // 0xbc
	int32_t GPUSimulationTextureSizeY; // 0xc0
	char bGlobalClipPlane : 1; // 0xc4
	EGBufferFormat GBufferFormat; // 0xc8
	char bUseGPUMorphTargets : 1; // 0xcc
	char bNvidiaAftermathEnabled : 1; // 0xcc
	char bMultiView : 1; // 0xcc
	char bMobilePostProcessing : 1; // 0xcc
	char bMobileMultiView : 1; // 0xcc
	char bMobileUseHWsRGBEncoding : 1; // 0xcc
	char bRoundRobinOcclusion : 1; // 0xcc
	char bODSCapture : 1; // 0xcc
	char bMeshStreaming : 1; // 0xcd
	float WireframeCullThreshold; // 0xd0
	char bEnableRayTracing : 1; // 0xd4
	char bEnableRayTracingTextureLOD : 1; // 0xd4
	char bSupportStationarySkylight : 1; // 0xd4
	char bSupportLowQualityLightmaps : 1; // 0xd4
	char bSupportPointLightWholeSceneShadows : 1; // 0xd4
	char bSupportAtmosphericFog : 1; // 0xd4
	char bSupportSkyAtmosphere : 1; // 0xd4
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xd4
	char bSupportSkinCacheShaders : 1; // 0xd5
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xd8
	float SkinCacheSceneMemoryLimitInMB; // 0xdc
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe0
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe0
	char bMobileAllowDistanceFieldShadows : 1; // 0xe0
	char bMobileAllowMovableDirectionalLights : 1; // 0xe0
	uint32_t MobileNumDynamicPointLights; // 0xe4
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xe8
	char bMobileAllowMovableSpotlights : 1; // 0xe8
	char bSupport16BitBoneIndex : 1; // 0xe8
	char bGPUSkinLimit2BoneInfluences : 1; // 0xe8
	char bSupportDepthOnlyIndexBuffers : 1; // 0xe8
	char bSupportReversedIndexBuffers : 1; // 0xe8
	char bSupportMaterialLayers : 1; // 0xe8
	char bLPV : 1; // 0xe8
};

struct URuntimeVirtualTexture : UObject {
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x28
	bool bCompressTextures; // 0x29
	bool bEnable; // 0x2a
	bool bClearTextures; // 0x2b
	bool bSinglePhysicalSpace; // 0x2c
	bool bPrivateSpace; // 0x2d
	bool bEnableScalability; // 0x2e
	int32_t Size; // 0x30
	int32_t TileCount; // 0x34
	int32_t TileSize; // 0x38
	int32_t TileBorderSize; // 0x3c
	int32_t StreamLowMips; // 0x40
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
	bool bEnableCompressCrunch; // 0x50
	int32_t RemoveLowMips; // 0x54
};

struct UReplicationGraphNode : UObject {
	TArray<UReplicationGraphNode*> AllChildNodes; // 0x28
};

struct AReplicationGraphDebugActor : AActor {
	UReplicationGraph* ReplicationGraph; // 0x220
	UNetReplicationGraphConnection* ConnectionManager; // 0x228
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct ATrackedVehicle : AWheeledVehicle {
	UTracksComponent* Tracks; // 0x290
	USuspensionsComponent* Suspensions; // 0x298
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded : UParticleModuleLocationPrimitiveCylinder {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct USmoothNetworkedMovement : UActorComponent {
	char bInterpMovement : 1; // 0xb0
	char bInterpRotation : 1; // 0xb0
	float InterpLocationTime; // 0xb4
	float InterpRotationTime; // 0xb8
	float InterpLocationMaxLagDistance; // 0xbc
	float InterpLocationSnapToTargetDistance; // 0xc0
	float FinalLocationInterpSpeed; // 0xc4
	USceneComponent* UpdatedComponent; // 0xc8
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct AShooterWeapon_Repair : AShooterWeapon {
	float TimeBetweenRepairs; // 0x8b8
	int32_t RepairPerSecond; // 0x8bc
	float RepairRange; // 0x8c0
	char RepairActionScoreInterval; // 0x8c4
	FName RepairActionScore; // 0x8c8
	UParticleSystem* SurfaceParticle; // 0x8d0
	USoundBase* SurfaceSound; // 0x8d8
	UParticleSystemComponent* RepairPSC; // 0x8e0
	UAudioComponent* RepairASC; // 0x8e8
	TWeakObjectPtr<UHLLArmourHealthComponent> CurrentRepairTarget; // 0x8f0
	float LastRepairTime; // 0x8f8
	int32_t RepairCounter; // 0x8fc
	UVibrationEventController* WeldVibrationEventController; // 0x900
};

struct UUnitLeaderSettings_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UGridPanel* GridPanel_84; // 0x238
	UOptionButton_V2_C* InvitePlayersButton; // 0x240
	UBorder* RootBorder; // 0x248
	UOptionButton_V2_C* UnitDesignationToggle; // 0x250
	UOptionButton_V2_C* UnitPrivacyToggle; // 0x258
	UOptionButton_V2_C* VOIPToggle; // 0x260
	UDeploymentScreen_V2_C* DeploymentScreen; // 0x268
};

struct ULoadingScreensData : UDataAsset {
	FSlateColor BackgroundBrushColor; // 0x30
	UMaterialInterface* ImagePannerMaterial; // 0x58
	FSlateColor ImageDarkeningBrushColor; // 0x60
	UMaterialInterface* VignetteMaterial; // 0x88
	FSlateColor VignetteImageColor; // 0x90
	UMaterialInterface* TextGritMaterial; // 0xb8
	FSlateColor TextGritColor; // 0xc0
	UMaterialInterface* ScratchesMaterial; // 0xe8
	FSlateColor ScratchesColor; // 0xf0
	FSlateColor GameModeColor; // 0x118
	FSlateFontInfo GameModeFont; // 0x140
	FSlateColor MapNameColor; // 0x190
	FSlateFontInfo MapNameFont; // 0x1b8
	FSlateColor DateColor; // 0x208
	FSlateFontInfo DateFont; // 0x230
	FSlateColor LocationColor; // 0x280
	FSlateFontInfo LocationFont; // 0x2a8
	FSlateColor DateLocationSeparatorLineColor; // 0x2f8
	UTexture2D* ThrobberImage; // 0x320
	UDataTable* MapDataTable; // 0x328
	UDataTable* NonMapDataTable; // 0x330
};

struct UHLLUseContext_HealWeapon : UHLLUseContextBase {
	URichTextBlock* HealText; // 0x238
	UImage* RadialProg; // 0x240
	UImage* IconImage; // 0x248
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
	EMaterialSamplerType SamplerType; // 0x48
	char IsDefaultMeshpaintTexture : 1; // 0x49
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x30
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x220
	FColor BrushColor; // 0x224
	int32_t PolyFlags; // 0x228
	char bColored : 1; // 0x22c
	char bSolidWhenSelected : 1; // 0x22c
	char bPlaceableFromClassBrowser : 1; // 0x22c
	char bNotForClientOrServer : 1; // 0x22c
	UModel* Brush; // 0x230
	UBrushComponent* BrushComponent; // 0x238
	char bInManipulation : 1; // 0x240
	TArray<FGeomSelection> SavedSelections; // 0x248
};

struct UHLLAnimInstance_ArtilleryBase : UAnimInstance {
	AHLLArtilleryBase* ArtilleryPiece; // 0x270
	AHLLArmourWeapon* ArtilleryWeapon; // 0x278
	float TurretYaw; // 0x280
	float TurretPitch; // 0x284
	float LoadingProgress; // 0x288
	bool bIsLoading; // 0x28c
};

struct AShooterCharacter : ACharacter {
	USceneComponent* Mesh1PTransform; // 0x4e0
	USkeletalMeshComponent* Mesh1P; // 0x4e8
	USkelMeshWithLinkedBoundsComponent* HeadMesh; // 0x4f0
	UStaticMeshComponent* Helmet; // 0x4f8
	FName HelmetAttachSocketName; // 0x500
	UPostProcessComponent* ADS_DOF_PostProcess; // 0x508
	UClientBotPlayerInputComponent* m_clientBotPlayerInputComponent; // 0x510
	TArray<TSoftClassPtr<UObject>> DebugInventory; // 0x518
	TArray<FString> LocalDebugInventory; // 0x528
	AShooterWeapon* CurrentWeapon; // 0x538
	char bWantsToRun : 1; // 0x54c
	USoundCue* RunLoopSound; // 0x568
	USoundCue* RunStopSound; // 0x570
	float MinTimeBeforeRunStopSound; // 0x578
	float ProneEyeHeight; // 0x57c
	float EyeHeightTransitionSpeed; // 0x580
	FHeadBobSettings WalkingHeadBob; // 0x584
	FHeadBobSettings SprintingHeadBob; // 0x598
	FHeadBobSettings ProneHeadBob; // 0x5ac
	float SprintingStrafeMultipliler; // 0x5c0
	TArray<AShooterWeapon*> Inventory; // 0x670
	EHLLInventorySlot LastEquippedSlot; // 0x680
	EHLLInventorySlot LastEquippedWeaponSlot; // 0x681
	UHLLMapComponent* MapComponent; // 0x688
	char bIsViewingMap : 1; // 0x690
	UInputComponent* MapModeBlockedInput; // 0x698
	float SuppressionRecoveryRate; // 0x6b0
	float SuppressionLockTimer; // 0x6b4
	float MaxSuppression; // 0x6b8
	UMaterialInterface* SuppressionBlendable; // 0x6c0
	USoundBase* SuppressionLocalSound; // 0x6c8
	UCurveFloat* Suppression_SoundCurve; // 0x6d0
	UCurveFloat* Suppression_ShakeCurve_Explosion; // 0x6d8
	UCurveFloat* Suppression_ShakeCurve_Firearm; // 0x6e0
	UCameraShake* Suppression_CamShake_Explosion; // 0x6e8
	UCameraShake* Suppression_CamShake_Firearms; // 0x6f0
	FFrameSuppressionInfo ReplicatedSuppressionInfo; // 0x6f8
	UMaterialInstanceDynamic* m_PostProcessDMI; // 0x710
	UPostProcessComponent* PlayerPostProcess; // 0x718
	UAudioComponent* Suppress_Heartbeat; // 0x720
	FHLLUseContext UseContext; // 0x728
	char bUseContextLocked : 1; // 0x734
	char bUseContextActive : 1; // 0x734
	FMulticastInlineDelegate OnWeaponChangedDelegate; // 0x748
	FMulticastInlineDelegate OnStateChangedDelegate; // 0x758
	float CriticalTime; // 0x768
	float HoldToLetGoTime; // 0x76c
	int32_t MaxCriticalChances; // 0x770
	float HealthFXInterp_Speed; // 0x778
	float HealthPulseSpeedLow; // 0x780
	float HealthPulseSpeedHigh; // 0x784
	float SplatterLockTime; // 0x788
	float SplatterFadeSpeed; // 0x78c
	float Health; // 0x79c
	float WoundedBleedTime; // 0x7a0
	float WoundedBleedAmount; // 0x7a4
	EHLLHealthState HealthState; // 0x7a8
	FHLLHealthDeltaInfo LastHealthDeltaInfo; // 0x7b0
	FRepHealData ReplicatedHealInfo; // 0x9e4
	UShapeComponent* HealingCollisionShape; // 0x9f0
	FName HealingCollisionAttachmentSocket; // 0x9f8
	UAudioComponent* VoiceAudioComponent; // 0xa00
	UAudioComponent* BreathAudioComponent; // 0xa08
	UHLLVoiceData* VoiceData; // 0xa10
	float MinTimeBetweenBreaths; // 0xa18
	float MinTimeBetweenVocalisations; // 0xa1c
	TMap<EHLLDamageType, TSoftObjectPtr<USoundBase>> DamageSounds; // 0xa20
	float MinTimeBetweenImpactSounds; // 0xa70
	float WoundedLoopMinVolume; // 0xa84
	FSurfaceSounds LandSounds; // 0xa88
	UAudioComponent* HealthLoopAC; // 0xbe0
	float WeaponSway_ProneModifier; // 0xbe8
	float WeaponSway_CrouchedModifier; // 0xbec
	float WeaponSway_StandingModifier; // 0xbf0
	float WeaponSway_FallingModifier; // 0xbf4
	float MinTimeBetweenJumps; // 0xc34
	FKillTimerInfo KillTimerInfo; // 0xc48
	char SectorKillTime; // 0xc50
	char SectorVehicleKillTime; // 0xc51
	char DrownKillTime; // 0xc52
	float KillTimer_FXInterpSpeed; // 0xc54
	float TotemPollingRepulsionPower; // 0xc5c
	UCurveFloat* FallDamageCurve; // 0xc68
	UCameraShake* FallCameraShake; // 0xc70
	UCameraShake* ProneCameraShake; // 0xc78
	UCameraShake* ProneLandedCameraShake; // 0xc80
	UCameraShake* CrouchCameraShake; // 0xc88
	UCameraShake* StandCameraShake; // 0xc90
	UCameraShake* JumpCameraShake; // 0xc98
	UCameraShake* ThrowCameraShake; // 0xca0
	UCameraShake* StartSprintingCameraShake; // 0xca8
	UCameraShake* StopSprintingCameraShake; // 0xcb0
	float MinStanceTransitionTime; // 0xcc0
	float LastStanceTransitionTime; // 0xcc4
	AHLLSeat* CurrentSeat; // 0xcc8
	FRepSeatPendingTransition RepSeatTransition; // 0xcd0
	FMulticastInlineDelegate OnCharacterSeatChange; // 0xcd8
	UPostProcessComponent* Close_DOF_PostProcess; // 0xd00
	UAudioComponent* AC_TurnInPlace; // 0xd10
	USoundBase* TurnInPlaceSound; // 0xd18
	USoundBase* TurnInPlaceStopSound; // 0xd20
	UHLLGoreComponent* GoreComponent; // 0xd28
	FVector DeployCameraOffset; // 0xd30
	FVector4 DeployCameraRotationLimits; // 0xd40
	float DeployedCamBlendAlpha; // 0xd50
	float DeployCameraBlendSpeed; // 0xd54
	float SpeedScaleFactor_Default; // 0xd58
	float SpeedScaleFactor_Crouched; // 0xd5c
	float SpeedScaleFactor_Prone; // 0xd60
	UHLLFootstepData* FootstepData; // 0xd68
	float HeadTiltAngle; // 0xd90
	float TiltBlendSpeed; // 0xd94
	FRigPivotSettings RigPivotSettings; // 0xdb0
	float ObstacleDistance; // 0xe18
	float ObstacleHeight; // 0xe1c
	EVaultingMoveType VaultingMoveType; // 0xe20
	UVaultingComponent* Vaulting; // 0xe28
	TWeakObjectPtr<UAudioComponent> UseContextAC; // 0xe50
	char bUseContextACStarted : 1; // 0xe58
	UInputComponent* m_grenadeInput; // 0xe60
	char bWantsToADS : 1; // 0xe6a
	char bIsTargeting : 1; // 0xe6a
	ETeam m_BackupTeam; // 0xe6b
	UHLLIndicatorComponent* PlayerIndicator; // 0xe78
	UHLLIndicatorComponent* MedicIndicator; // 0xe80
	UHLLIndicatorComponent* CriticalIndicator; // 0xe88
	FVector_NetQuantize RelativeHeadLocation; // 0xe9c
	FVector_NetQuantize RelativeMeshLocation; // 0xea8
	float CameraVerticalMovementSpeed; // 0xecc
	AActor* LastDamageCauser; // 0xee8
	float RagdollBlendAnimPercent; // 0xef0
	UAnimMontage* StandingDeathAnimations; // 0xef8
	UAnimMontage* CrouchedDeathAnimations; // 0xf00
	UAnimMontage* ProneDeathAnimations; // 0xf08
	UStaticMesh* BackerHelmetMesh; // 0xf18
	UStaticMesh* PreOrderHelmetMesh; // 0xf20
	USoundBase* EnterWaterSound; // 0xf28
	USoundBase* ExitWaterSound; // 0xf30
	float MinSplashZVeloc; // 0xf38
	float MinTimeBetweenSplashFX; // 0xf3c
	ULeaningComponent* Leaning; // 0xf50
	char bShowTPPMeshInFPP : 1; // 0xf58
	USkeletalMesh* PronePoseMesh; // 0xf68
	USkeletalMesh* CrouchPoseMesh; // 0xf70
	USkeletalMesh* StandingPoseMesh; // 0xf78
	float MaxAutoRunDoubleTapInterval; // 0xfd8
	ECharacterStance CharacterStance; // 0xfe4
	FName FPPCameraBone; // 0xfe8
	char bIsSpectatorMode : 1; // 0xff0
	TArray<UMaterialInstanceDynamic*> HandMaterials; // 0xff8
	UVibrationEventController* CrawlVibrationController; // 0x1010
	UVibrationEventController* JumpVibrationController; // 0x1018
	UVibrationEventController* DamageVibrationController; // 0x1020
	UVibrationEventController* CriticalVibrationController; // 0x1028
	UVibrationEventController* WoundedVibrationController; // 0x1030
};

struct UParticleSystemComponent : UFXSystemComponent {
	UParticleSystem* Template; // 0x410
	TArray<UMaterialInterface*> EmitterMaterials; // 0x418
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x428
	char bResetOnDetach : 1; // 0x439
	char bUpdateOnDedicatedServer : 1; // 0x439
	char bAllowRecycling : 1; // 0x439
	char bAutoManageAttachment : 1; // 0x439
	char bAutoAttachWeldSimulatedBodies : 1; // 0x439
	char bWarmingUp : 1; // 0x43a
	char bOverrideLODMethod : 1; // 0x43a
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x43a
	ParticleSystemLODMethod LODMethod; // 0x445
	EParticleSignificanceLevel RequiredSignificance; // 0x446
	TArray<FParticleSysParam> InstanceParameters; // 0x448
	FMulticastInlineDelegate OnParticleSpawn; // 0x458
	FMulticastInlineDelegate OnParticleBurst; // 0x468
	FMulticastInlineDelegate OnParticleDeath; // 0x478
	FMulticastInlineDelegate OnParticleCollide; // 0x488
	bool bOldPositionValid; // 0x498
	FVector OldPosition; // 0x49c
	FVector PartSysVelocity; // 0x4a8
	float WarmupTime; // 0x4b4
	float WarmupTickRate; // 0x4b8
	float SecondsBeforeInactive; // 0x4c0
	float MaxTimeBeforeForceUpdateTransform; // 0x4c8
	TArray<UParticleSystemReplay*> ReplayClips; // 0x4e8
	float CustomTimeDilation; // 0x500
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x558
	FName AutoAttachSocketName; // 0x560
	EAttachmentRule AutoAttachLocationRule; // 0x568
	EAttachmentRule AutoAttachRotationRule; // 0x569
	EAttachmentRule AutoAttachScaleRule; // 0x56a
	FMulticastInlineDelegate OnSystemFinished; // 0x598
};

struct ATriggerBase : AActor {
	UShapeComponent* CollisionComponent; // 0x220
};

struct UBackgroundBlurSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UEnvQueryTest_Dot : UEnvQueryTest {
	FEnvDirection LineA; // 0x1f8
	FEnvDirection LineB; // 0x218
	EEnvTestDot TestMode; // 0x238
	bool bAbsoluteValue; // 0x239
};

struct AHLLArtilleryBase : AActor {
	float YawRate; // 0x288
	float MaxYawAngle; // 0x28c
	float PitchRate; // 0x290
	float MinPitchAngle; // 0x294
	float MaxPitchAngle; // 0x298
	float ServerUpdateTurretRate; // 0x29c
	UArtyBarrelControllerComponent* BarrelController; // 0x2a0
	UArtyTurnControllerComponent* TurnController; // 0x2a8
	UAudioComponent* PitchAudio; // 0x2b0
	UAudioComponent* YawAudio; // 0x2b8
	UAudioComponent* TurnAudio; // 0x2c0
	UHLLMapComponent* MapComponent; // 0x2c8
	float TurnSpeed; // 0x2d0
	ETeam Team; // 0x2d4
	FHLLArmourMetaData ArmourMetaData; // 0x2d8
	EHLLDamageFilterType DamageFilterType; // 0x2f8
	USkeletalMeshComponent* ArtilleryMesh; // 0x300
	UHLLArmourHealthComponent* ArmourHealth; // 0x308
	UHLLArmourInventory* ArmourInventory; // 0x310
	UHLLIndicatorComponent* IndicatorComponent; // 0x318
	UCapsuleComponent* CharacterTurretGuard; // 0x320
	AHLLSeat_ArtilleryGunner* GunnerSeatClass; // 0x328
	AHLLSeat_ArtilleryLoader* LoaderSeatClass; // 0x330
	AHLLSeat_ArtilleryGunner* GunnerSeat; // 0x338
	AHLLSeat_ArtilleryLoader* LoaderSeat; // 0x340
	AShooterPlayerState* SpawnedByPlayer; // 0x348
	UVibrationEventController* PitchVibrationController; // 0x350
	UVibrationEventController* YawVibrationController; // 0x358
	UVibrationEventController* TurnVibrationController; // 0x360
};

struct UAsyncTaskDownloadImage : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct ULevelStreamingDynamic : ULevelStreaming {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct UHLLArmourWeaponUI_AmmoItem : UUserWidget {
	UHLLArmourWeaponUI* OwningPanel; // 0x230
	char AmmoIndex; // 0x238
	UHLLKeyText* SelectKeyText; // 0x240
	UBorder* SelectionBorder; // 0x248
	UTextBlock* AmmoName; // 0x250
	UImage* AmmoIcon; // 0x258
	UTextBlock* AmmoClip; // 0x260
	UTextBlock* AmmoClips; // 0x268
	UTextBlock* MunitionsCost; // 0x270
	UWidgetSwitcher* MunitionsSwitcher; // 0x278
};

struct UKeyBindingButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UBorder* EditingMode; // 0x238
	UTextBlock* PrimaryKey; // 0x240
	UButton* PrimaryKeyButton; // 0x248
	UWidgetSwitcher* Switcher; // 0x250
	FSlateColor NormalTextColor; // 0x258
	FSlateColor HoveredTextColor; // 0x280
	bool Hovered; // 0x2a8
	bool Editing; // 0x2a9
	FButtonStyle HighlightedButtonStyle; // 0x2b0
	FButtonStyle NotHighlightedButtonStyle; // 0x528
	FKey Key; // 0x7a0
	UKeyBinding_V2_C* Owner; // 0x7b8
};

struct UHLLMapTooltip_Player : UHLLTooltipBase {
	UTextBlock* PlayerName; // 0x260
	UTextBlock* PlayerIcon; // 0x268
	UTextBlock* PlayerDistance; // 0x270
};

struct UHLLIndicatorComponent : UActorComponent {
	UHLLIndicatorBase* IndicatorClass; // 0xb0
	char bAutoCreate : 1; // 0xb8
	char bWantsIndicator : 1; // 0xb8
};

struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x410
	UBodySetup* BrushBodySetup; // 0x418
};

struct UInterpTrackDirector : UInterpTrack {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct UHLLMarkers_MapMenu : UHLLMapContextWidget {
	UHLLMarkers_MapMenuItem* ItemClass; // 0x248
	TArray<UHLLMarkers_MapMenuItem*> Items; // 0x250
	UVerticalBox* Options; // 0x260
};

struct UMaterialExpressionRound : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AShooterPlayerController_Menu : APlayerController {
	char bIsZoomedIn : 1; // 0x580
	float ZoomOutTime; // 0x584
	float ZoomInTime; // 0x588
	EViewTargetBlendFunction BlendMode; // 0x58c
	float BlendPower; // 0x590
	UHLLMainMenuBase* MainMenuWidget; // 0x598
	ACameraActor* MainViewCamera; // 0x5a0
	ACameraActor* ZoomedViewCamera; // 0x5a8
	UShooterGameViewportClient* ViewportClient; // 0x5b0
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct UHLLVoteWidget : UUserWidget {
	FVoteHandle Vote; // 0x230
	URichTextBlock* BodyText; // 0x238
	UTextBlock* TitleText; // 0x240
	UTextBlock* Countdown; // 0x248
	UShooterGameViewportClient* ViewportClient; // 0x250
	AShooterPlayerController* PlayerController; // 0x258
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x2f0
	FVehicleDifferential4WData DifferentialSetup; // 0x390
	float AckermannAccuracy; // 0x3ac
	FVehicleTransmissionData TransmissionSetup; // 0x3b0
	FRuntimeFloatCurve SteeringCurve; // 0x3e0
};

struct UPawnAction_Repeat : UPawnAction {
	UPawnAction* ActionToRepeat; // 0x98
	UPawnAction* RecentActionCopy; // 0xa0
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
};

struct UHLLMapMetaTemplate : UObject {
	ETeam OffensiveModeAttackingTeam; // 0x28
	float SectorWidth; // 0x2c
	float SectorHeight; // 0x30
	int32_t MapWidth; // 0x34
	int32_t MapHeight; // 0x38
	TArray<FHLLSectorDefinition> Sectors; // 0x40
	FText MapFriendlyName; // 0x50
	FString MapID; // 0x68
	FText MapShortName; // 0x78
	EMapOrientation Orientation; // 0x90
	TSoftObjectPtr<UTexture2D> OverviewImage; // 0xa0
	float CompassOffset; // 0xc8
	EFaction AxisFaction; // 0xcc
	EFaction AlliesFaction; // 0xcd
	UHLLMapAbilityData* AxisAbilityData; // 0xd0
	UHLLMapAbilityData* AlliesAbilityData; // 0xd8
};

struct UMaterialExpressionPreviousFrameSwitch : UMaterialExpression {
	FExpressionInput CurrentFrame; // 0x40
	FExpressionInput PreviousFrame; // 0x54
};

struct AHLLAbility_ResourceConversion : AHLLCommanderAbility {
	EGameResource GeneratedResource; // 0x350
	int32_t GeneratedAmount; // 0x354
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0xe8
};

struct AHLLAbility_ProjectileStrike : AHLLCommanderAbility_Placeable {
	AShooterProjectile* ProjectileClass; // 0x370
	char NumProjectiles; // 0x378
	float StrikeZoneRadius; // 0x37c
	float DelayBetweenProjectiles; // 0x380
	float InitialLaunchDelay; // 0x384
	float ProjectileStartDistance; // 0x388
	float ProjectileLaunchZOffset; // 0x38c
	float ProjectileArcFactor; // 0x390
	USoundBase* LaunchSound; // 0x398
	bool bProjectilesStartedFiring; // 0x3a0
};

struct UHTP_Widget_Role_Loadout_Engineer_C : UUserWidget {
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Item_C_3; // 0x230
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Item_C_4; // 0x238
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Item_C_7; // 0x240
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Item_C_8; // 0x248
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary; // 0x250
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_3; // 0x258
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_4; // 0x260
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_16; // 0x268
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_17; // 0x270
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_C_5; // 0x278
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_C_11; // 0x280
	UHTP_Widget_Role_Loadout_Item_C* HTP_Widget_Role_Loadout_Primary_C_12; // 0x288
	UImage* icn_faction; // 0x290
	UImage* Image_10; // 0x298
	UImage* Image_17; // 0x2a0
};

struct UReplicationGraphNode_AlwaysRelevant_ForConnection : UReplicationGraphNode_ActorList {
	TArray<FAlwaysRelevantActorInfo> PastRelevantActors; // 0x110
	AActor* LastViewer; // 0x120
	AActor* LastViewTarget; // 0x128
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct UChatLine_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UTextBlock* Channel; // 0x238
	UThrobber* CooldownIndicator; // 0x240
	UHorizontalBox* HB_Cooldown; // 0x248
	UEditableTextBox* Message; // 0x250
	EChatChannel ChatChannel; // 0x258
	FChatStyle Style; // 0x260
	float MinDelayBetweenMessages; // 0x3a0
	FTimerHandle Timer_MessageAvailable; // 0x3a8
	int32_t MaxCharacterInput; // 0x3b0
	UChat_C* Widget_Chat; // 0x3b8
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UBoxComponent : UShapeComponent {
	FVector BoxExtent; // 0x428
	float LineThickness; // 0x434
};

struct ULightMapVirtualTexture2D : UTexture2D {
	TArray<int8_t> TypeToLayer; // 0xe8
};

struct UWGT_OverviewMap_V2_C : UHLLOverviewMapWrapper {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	UWidgetAnimation* A_OpenMapKey; // 0x350
	UWidgetAnimation* Anim_OpenClose; // 0x358
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo_V2; // 0x360
	UHorizontalBox* HorizontalBox_2; // 0x368
	UW_HotkeyPanelElement_C* hotkey_Marker; // 0x370
	UW_HotkeyPanelElement_C* hotkey_StrategicMap; // 0x378
	UImage* Image_1; // 0x380
	UImage* Image_3; // 0x388
	UImage* Image_6; // 0x390
	UImage* Image_81; // 0x398
	UHorizontalBox* KeyboardButtons; // 0x3a0
	USizeBox* SB_Map; // 0x3a8
	USizeBox* SizeBox_5; // 0x3b0
	URichTextBlock* txt_KeyExpand; // 0x3b8
	UW_MapKey_C* W_MapKey; // 0x3c0
	bool Map_KeyOpen; // 0x3c8
	EMapInputState CurrentInputState; // 0x3c9
	UHLLMapIconBase* NewVar_1; // 0x3d0
	bool HasHighlightedIcon; // 0x3d8
	bool HasAbilityIconSelected; // 0x3d9
	bool CanPlaceAbility; // 0x3da
	bool CanSelectAbility; // 0x3db
	bool CanActivate; // 0x3dc
	bool CanBeRotated; // 0x3dd
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x438
	UMaterialInterface* MaterialOverride; // 0x440
	FLinearColor SpriteColor; // 0x448
};

struct UAnimCompress_RemoveEverySecondKey : UAnimCompress {
	int32_t MinKeys; // 0x40
	char bStartAtSecondKey : 1; // 0x44
};

struct AShooterWeapon_Grenade : AShooterWeapon {
	FGrenadeWeaponData GrenadeConfig; // 0x8b8
	FWeaponAnim AimOverhandAnimation; // 0x8e8
	FWeaponAnim AimUnderhandAnimation; // 0x910
	FWeaponAnim ThrowOverhandAnimation; // 0x938
	FWeaponAnim ThrowUnderhandAnimation; // 0x960
	char m_throwOverhandCounter; // 0x988
	char m_throwUnderhandCounter; // 0x989
	char m_aimOverhandCounter; // 0x98a
	char m_aimUnderhandCounter; // 0x98b
	AGrenadeProjectile* m_projectile; // 0x9b0
	UGlobalGrenadeThrowSettings* m_globalThrowSettings; // 0x9b8
};

struct UHLLSettings : UDeveloperSettings {
	int32_t PlayerLevelStart; // 0x38
	int32_t PlayerLevelMod; // 0x3c
	int32_t MaxPlayerLevels; // 0x40
	int32_t RoleLevelStart; // 0x44
	int32_t RoleLevelMod; // 0x48
	int32_t MaxRoleLevels; // 0x4c
	int32_t MaxRank; // 0x50
	TArray<int32_t> PlayerLevelTable; // 0x58
	TArray<int32_t> RoleLevelTable; // 0x68
	TArray<TSoftObjectPtr<UDataTable>> CosmeticData; // 0x78
	TSoftObjectPtr<UDataTable> GamepadLayouts; // 0x88
	TArray<TSoftObjectPtr<UHLLTeamLoadouts>> Loadouts; // 0xb0
	TArray<TSoftObjectPtr<USoundBase>> MatchWinMusic; // 0xc0
	TSoftObjectPtr<UDataTable> DLCData; // 0xd0
};

struct UHLLVoteDataComponent : UActorComponent {
	float VoteLifetime; // 0xb8
	float VoteCompletionTime; // 0xbc
	TArray<FVoteThreshold> DefaultThresholds; // 0xc0
	float VoteTargetCooldown; // 0xd0
	float VoteInstigatorCooldown; // 0xd4
	char bVoteKickEnabled : 1; // 0xd8
	FVoteDataContainer_Static StaticData; // 0xe0
	FVoteDataContainer_Dynamic DynamicData; // 0x1f8
};

struct URadialForceComponent : USceneComponent {
	float Radius; // 0x1f0
	ERadialImpulseFalloff Falloff; // 0x1f4
	float ImpulseStrength; // 0x1f8
	char bImpulseVelChange : 1; // 0x1fc
	char bIgnoreOwningActor : 1; // 0x1fc
	float ForceStrength; // 0x200
	float DestructibleDamage; // 0x204
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x208
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterialMask* PhysMaterialMask; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	FScalarMaterialInput Metallic; // 0xd8
	FScalarMaterialInput Specular; // 0xec
	FScalarMaterialInput Anisotropy; // 0x100
	FVectorMaterialInput Normal; // 0x114
	FVectorMaterialInput Tangent; // 0x128
	FColorMaterialInput EmissiveColor; // 0x13c
	EMaterialDomain MaterialDomain; // 0x150
	EBlendMode BlendMode; // 0x151
	EDecalBlendMode DecalBlendMode; // 0x152
	EMaterialDecalResponse MaterialDecalResponse; // 0x153
	EMaterialShadingModel ShadingModel; // 0x154
	char bCastDynamicShadowAsMasked : 1; // 0x155
	FMaterialShadingModelField ShadingModels; // 0x156
	float OpacityMaskClipValue; // 0x158
	FVectorMaterialInput WorldPositionOffset; // 0x15c
	FScalarMaterialInput Refraction; // 0x170
	FMaterialAttributesInput MaterialAttributes; // 0x184
	FScalarMaterialInput PixelDepthOffset; // 0x19c
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b0
	char bEnableSeparateTranslucency : 1; // 0x1c4
	char bEnableResponsiveAA : 1; // 0x1c4
	char bScreenSpaceReflections : 1; // 0x1c4
	char bContactShadows : 1; // 0x1c4
	char TwoSided : 1; // 0x1c4
	char DitheredLODTransition : 1; // 0x1c4
	char DitherOpacityMask : 1; // 0x1c4
	char bAllowNegativeEmissiveColor : 1; // 0x1c4
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1c5
	char bEnableMobileSeparateTranslucency : 1; // 0x1c6
	int32_t NumCustomizedUVs; // 0x1c8
	float TranslucencyDirectionalLightingIntensity; // 0x1cc
	float TranslucentShadowDensityScale; // 0x1d0
	float TranslucentSelfShadowDensityScale; // 0x1d4
	float TranslucentSelfShadowSecondDensityScale; // 0x1d8
	float TranslucentSelfShadowSecondOpacity; // 0x1dc
	float TranslucentBackscatteringExponent; // 0x1e0
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1e4
	float TranslucentShadowStartOffset; // 0x1f4
	char bDisableDepthTest : 1; // 0x1f8
	char bWriteOnlyAlpha : 1; // 0x1f8
	char bGenerateSphericalParticleNormals : 1; // 0x1f8
	char bTangentSpaceNormal : 1; // 0x1f8
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x1f8
	char bBlockGI : 1; // 0x1f8
	char bUsedAsSpecialEngineMaterial : 1; // 0x1f8
	char bUsedWithSkeletalMesh : 1; // 0x1f8
	char bUsedWithEditorCompositing : 1; // 0x1f9
	char bUsedWithParticleSprites : 1; // 0x1f9
	char bUsedWithBeamTrails : 1; // 0x1f9
	char bUsedWithMeshParticles : 1; // 0x1f9
	char bUsedWithNiagaraSprites : 1; // 0x1f9
	char bUsedWithNiagaraRibbons : 1; // 0x1f9
	char bUsedWithNiagaraMeshParticles : 1; // 0x1f9
	char bUsedWithGeometryCache : 1; // 0x1f9
	char bUsedWithStaticLighting : 1; // 0x1fa
	char bUsedWithMorphTargets : 1; // 0x1fa
	char bUsedWithSplineMeshes : 1; // 0x1fa
	char bUsedWithInstancedStaticMeshes : 1; // 0x1fa
	char bUsedWithGeometryCollections : 1; // 0x1fa
	char bUsesDistortion : 1; // 0x1fa
	char bUsedWithClothing : 1; // 0x1fa
	char bUsedWithWater : 1; // 0x1fc
	char bUsedWithHairStrands : 1; // 0x1fc
	char bUsedWithLidarPointCloud : 1; // 0x1fc
	char bUsedWithUI : 1; // 0x200
	char bAutomaticallySetUsageInEditor : 1; // 0x200
	char bFullyRough : 1; // 0x200
	char bUseFullPrecision : 1; // 0x200
	char bUseLightmapDirectionality : 1; // 0x200
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x204
	char bUseHQForwardReflections : 1; // 0x208
	char bUsePlanarForwardReflections : 1; // 0x208
	char bNormalCurvatureToRoughness : 1; // 0x208
	EMaterialTessellationMode D3D11TessellationMode; // 0x209
	char bEnableCrackFreeDisplacement : 1; // 0x20a
	char bEnableAdaptiveTessellation : 1; // 0x20a
	char AllowTranslucentCustomDepthWrites : 1; // 0x20a
	char Wireframe : 1; // 0x20a
	char bCanMaskedBeAssumedOpaque : 1; // 0x20a
	char bIsMasked : 1; // 0x20a
	char bIsPreviewMaterial : 1; // 0x20a
	char bIsFunctionPreviewMaterial : 1; // 0x20a
	char bUseMaterialAttributes : 1; // 0x20b
	char bCastRayTracedShadows : 1; // 0x20b
	char bUseTranslucencyVertexFog : 1; // 0x20b
	char bIsSky : 1; // 0x20b
	char bComputeFogPerPixel : 1; // 0x20b
	char bOutputTranslucentVelocity : 1; // 0x20b
	char bAllowDevelopmentShaderCompile : 1; // 0x20b
	char bIsMaterialEditorStatsMaterial : 1; // 0x20b
	EBlendableLocation BlendableLocation; // 0x20c
	char BlendableOutputAlpha : 1; // 0x20d
	char bEnableStencilTest : 1; // 0x20d
	EMaterialStencilCompare StencilCompare; // 0x20e
	char StencilRefValue; // 0x20f
	ERefractionMode RefractionMode; // 0x210
	int32_t BlendablePriority; // 0x214
	char bIsBlendable : 1; // 0x218
	uint32_t UsageFlagWarnings; // 0x21c
	float RefractionDepthBias; // 0x220
	FGuid StateId; // 0x224
	float MaxDisplacement; // 0x234
	FMaterialCachedExpressionData CachedExpressionData; // 0x2c0
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct UHLLUI_CosmeticItemTooltip : UUserWidget {
	UTextBlock* ItemName; // 0x230
	UTextBlock* RequirementText; // 0x238
	UTextBlock* ItemAdditionalText; // 0x240
	UShooterGameViewportClient* ViewportClient; // 0x248
};

struct UWrapBox : UPanelWidget {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	bool bExplicitWrapWidth; // 0x12c
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UNavCollision : UNavCollisionBase {
	TArray<FNavCollisionCylinder> CylinderCollision; // 0x80
	TArray<FNavCollisionBox> BoxCollision; // 0x90
	UNavArea* AreaClass; // 0xa0
	char bGatherConvexGeometry : 1; // 0xa8
	char bCreateOnClient : 1; // 0xa8
};

struct UHLLScrollZoom : UWidget {
	FDelegate ColorAndOpacityDelegate; // 0x108
	FDelegate BrushDelegate; // 0x118
	FSlateBrush Brush; // 0x128
	FLinearColor ColorAndOpacity; // 0x1b0
	FDrawSectorInfo DrawSectorInfo; // 0x1c0
	bool bDrawGridLines; // 0x1d8
	bool bDrawSubGrid; // 0x1d9
	bool bDrawGridShadow; // 0x1da
	bool bAntiAliasGrid; // 0x1db
	bool bDrawText; // 0x1dc
	bool bDrawSectors; // 0x1dd
	float MaxZoom; // 0x1e0
	FSlateFontInfo GridFont; // 0x1e8
	FVector2D TopTextOffset; // 0x238
	FVector2D LeftTextOffset; // 0x240
	int32_t MajorNumSegments; // 0x248
	float MajorLineThickness; // 0x24c
	float MajorShadowThickness; // 0x250
	FLinearColor MajorLineColour; // 0x254
	FLinearColor MajorShadowColour; // 0x264
	FVector2D MajorShadowOffset; // 0x274
	int32_t MinorNumSegments; // 0x27c
	float MinorLineThickness; // 0x280
	FLinearColor MinorLineColour; // 0x284
	float MinorMinZoom; // 0x294
};

struct UNavMovementComponent : UMovementComponent {
	FNavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x124
	char bUseAccelerationForPaths : 1; // 0x124
	char bUseFixedBrakingDistanceForPaths : 1; // 0x124
	FMovementProperties MovementState; // 0x125
	UObject* PathFollowingComp; // 0x128
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMapClass; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	FUniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray<UChannel*> ChannelsToTick; // 0x1510
};

struct UNavLinkCustomComponent : UNavRelevantComponent {
	uint32_t NavLinkUserId; // 0xe8
	UNavArea* EnabledAreaClass; // 0xf0
	UNavArea* DisabledAreaClass; // 0xf8
	FNavAgentSelector SupportedAgents; // 0x100
	FVector LinkRelativeStart; // 0x104
	FVector LinkRelativeEnd; // 0x110
	ENavLinkDirection LinkDirection; // 0x11c
	char bLinkEnabled : 1; // 0x120
	char bNotifyWhenEnabled : 1; // 0x120
	char bNotifyWhenDisabled : 1; // 0x120
	char bCreateBoxObstacle : 1; // 0x120
	FVector ObstacleOffset; // 0x124
	FVector ObstacleExtent; // 0x130
	UNavArea* ObstacleAreaClass; // 0x140
	float BroadcastRadius; // 0x148
	float BroadcastInterval; // 0x14c
	ECollisionChannel BroadcastChannel; // 0x150
};

struct UVirtualTexturePoolConfig : UObject {
	int32_t DefaultSizeInMegabyte; // 0x28
	TArray<FVirtualTextureSpacePoolConfig> Pools; // 0x30
};

struct UMainMenuNavigationScreen_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UbtnNav_V2_C* btnNav_Barracks; // 0x238
	UbtnNav_V2_C* btnNav_Credits; // 0x240
	UbtnNav_V2_C* btnNav_Enlist; // 0x248
	UbtnNav_V2_C* btnNav_Guide; // 0x250
	UbtnNav_V2_C* btnNav_Quit; // 0x258
	UbtnNav_V2_C* btnNav_Settings; // 0x260
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x268
	UOverlay* Home; // 0x270
	UTextBlock* SlashBarracks; // 0x278
	UTextBlock* SlashCredits; // 0x280
	UTextBlock* SlashEnlist; // 0x288
	UTextBlock* SlashGuide; // 0x290
	UTextBlock* SlashQuit; // 0x298
	UTextBlock* SlashSettings; // 0x2a0
	UVerticalBox* VB_Nav; // 0x2a8
	UMainMenuWidget_V2_C* MainMenu; // 0x2b0
	int32_t LastMenuIndex; // 0x2b8
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UHTP_Widget_Topic_Generic_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UHorizontalBox* HB_Header; // 0x238
	UHTP_Widget_Role_Loadout_Commander_C* HTP_Widget_Role_Loadout_Commander; // 0x240
	UImage* Image_2; // 0x248
	UImage* Image_3; // 0x250
	UImage* img_headerIcon; // 0x258
	UImage* img_Image; // 0x260
	URichTextBlock* rtxt_Description; // 0x268
	USizeBox* SB_HeaderIcon; // 0x270
	USizeBox* SB_Image; // 0x278
	USizeBox* SB_SubWidget; // 0x280
	UTextBlock* txt_Name; // 0x288
	UTextBlock* txt_subTitle; // 0x290
	UTextBlock* txt_Tagline; // 0x298
	UWidgetSwitcher* WidgetSwitcher_Visuals; // 0x2a0
	FText MapName; // 0x2a8
	UTexture2D* MapImage; // 0x2c0
	FText MapDescription; // 0x2c8
	FName TableRow; // 0x2e0
	FMargin rColumnMargins; // 0x2e8
	FMargin lColumnMargins; // 0x2f8
	bool hasImage; // 0x308
	FMargin ColumnMargins_null; // 0x30c
	bool isUltrawide; // 0x31c
	bool isNotWidescreen; // 0x31d
	FVector2D imageDimensions; // 0x320
	float wrapLength; // 0x328
	bool hasWidget; // 0x32c
	FST_HTP HintInfo; // 0x330
};

struct UW_Btn_HTPTopic_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UButton* Btn_Topic; // 0x238
	UImage* Img_TopicSelected; // 0x240
	UTextBlock* Txt_TopicTitle; // 0x248
	FMulticastInlineDelegate Clicked; // 0x250
	bool Active; // 0x260
	FSlateColor NormalTextColor; // 0x268
	FSlateColor HoveredTextColor; // 0x290
	FButtonStyle ActiveButtonStyle; // 0x2b8
	FButtonStyle NormalButtonStyle; // 0x530
	bool Hovered; // 0x7a8
	FText Topic_Text; // 0x7b0
	int32_t Topic_Int; // 0x7c8
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	char bProxyIsJumpForceApplied : 1; // 0x330
	char bPressedJump : 1; // 0x330
	char bClientUpdating : 1; // 0x330
	char bClientWasFalling : 1; // 0x330
	char bClientResimulateRootMotion : 1; // 0x330
	char bClientResimulateRootMotionSources : 1; // 0x330
	char bSimGravityDisabled : 1; // 0x330
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331
	char bServerMoveIgnoreRootMotion : 1; // 0x331
	char bWasJumping : 1; // 0x331
	float JumpKeyHoldTime; // 0x334
	float JumpForceTimeRemaining; // 0x338
	float ProxyJumpForceStartedTime; // 0x33c
	float JumpMaxHoldTime; // 0x340
	int32_t JumpMaxCount; // 0x344
	int32_t JumpCurrentCount; // 0x348
	FMulticastInlineDelegate OnReachedJumpApex; // 0x350
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x370
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x380
	FRootMotionSourceGroup SavedRootMotion; // 0x390
	FRootMotionMovementParams ClientRootMotionParams; // 0x3d0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410
	FRepRootMotionMontage RepRootMotion; // 0x420
};

struct AHLLArmourWeapon_ReconGun : AHLLArmourWeapon {
	float ScannedAreaInterpSpeed; // 0x470
	float ScannedAreaRadius; // 0x474
	TArray<EObjectTypeQuery> ScanObjectTypes; // 0x478
	float FadeOutDuration; // 0x488
	UStaticMesh* ReconAreaMesh; // 0x490
	UMaterial* ReconAreaMaterial; // 0x498
	UMaterialInstanceDynamic* ReconAreaSphereMID; // 0x4a0
	UStaticMeshComponent* ReconAreaVisualsComponent; // 0x4a8
	FVector ShotLocation; // 0x4b0
};

struct AHLLMapDataBase : AActor {
	UHLLMapIconBase* IconClass; // 0x220
	FRepMapPosition MapPosition; // 0x228
	char bOwnerIsMovable : 1; // 0x230
};

struct AHLLVehicleWreck : AActor {
	USceneComponent* DummyRoot; // 0x238
	UStaticMeshComponent* Mesh; // 0x240
	UHLLSimpleHealthComponent* HealthComponent; // 0x248
	float ServerSpawnedTime; // 0x250
	AActor* ReplacedVehicleActor; // 0x258
	ETeam Team; // 0x260
	AShooterImpactEffect* ExplosionEffect; // 0x268
	float BaseLifespan; // 0x270
	float WreckReplacementDelay; // 0x274
};

struct UMaterialExpressionGetMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x40
	TArray<FGuid> AttributeGetTypes; // 0x58
};

struct UHLLUseContext_SwitchOrExitSeat : UHLLUseContextBase {
	UImage* SwitchProgress; // 0x238
	URichTextBlock* SwitchText; // 0x240
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UUserWidget : UWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMargin Padding; // 0x168
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x178
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x188
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x198
	UWidgetTree* WidgetTree; // 0x1a8
	int32_t Priority; // 0x1b0
	char bSupportsKeyboardFocus : 1; // 0x1b4
	char bIsFocusable : 1; // 0x1b4
	char bStopAction : 1; // 0x1b4
	char bHasScriptImplementedTick : 1; // 0x1b4
	char bHasScriptImplementedPaint : 1; // 0x1b4
	char bCookedWidgetTree : 1; // 0x1b4
	EWidgetTickFrequency TickFrequency; // 0x1c0
	UInputComponent* InputComponent; // 0x1c8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x1d0
};

struct UCameraModifier_CameraShake : UCameraModifier {
	TArray<FActiveCameraShakeInfo> ActiveShakes; // 0x48
	TMap<UCameraShake*, FPooledCameraShakes> ExpiredPooledShakesMap; // 0x58
	float SplitScreenShakeScale; // 0xa8
};

struct UUdpMessagingSettings : UObject {
	bool EnableTransport; // 0x28
	bool bAutoRepair; // 0x29
	bool bStopServiceWhenAppDeactivates; // 0x2a
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	EUdpMessageFormat MessageFormat; // 0x50
	char MulticastTimeToLive; // 0x51
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UMaterialExpressionAntialiasedTextureMask : UMaterialExpressionTextureSampleParameter2D {
	float Threshold; // 0xf0
	ETextureColorChannel Channel; // 0xf4
};

struct UW_OnScreenTip_C : UHLLHintWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UWidgetAnimation* A_TipFadeOut; // 0x238
	UVerticalBox* DismissVBox; // 0x240
	URichTextBlock* HintRichText; // 0x248
	FMulticastInlineDelegate OST_Completed; // 0x250
	FHint Hint_Current; // 0x260
	bool Hint_Removing; // 0x2b8
	FHint Hint_Next; // 0x2c0
	bool Hint_InQueue; // 0x318
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct UArmyLogo : UUserWidget {
	UImage* ArmyIcon; // 0x230
	UTextBlock* ArmyName; // 0x238
};

struct UWGT_PlatoonRole_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UImage* icn_defaultRole; // 0x238
	Uhll_text_C* txt_label; // 0x240
	EPlayerRole RoleType; // 0x248
};

struct UHLLSatchelIndicator : UHLLIndicatorBase {
	UImage* CountdownProg; // 0x2a8
};

struct UM3SuspensionComponent : UActorComponent {
	char bEnabled : 1; // 0xb0
	FM3SuspensionSideSetup LeftSideSetup; // 0xb4
	FM3SuspensionSideSetup RightSideSetup; // 0x114
	float BogieArmLength; // 0x174
	float BogieWheelRadius; // 0x178
	float BogieFrameHalfLength; // 0x17c
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	bool bCanBlend; // 0x58
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct AMainMenu_C : ALevelScriptActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x228
};

struct UMaterialExpressionChannelMaskParameter : UMaterialExpressionVectorParameter {
	EChannelMaskParameterColor MaskChannel; // 0x70
	FExpressionInput Input; // 0x74
};

struct UHLLUI_LoadoutSelector : UUserWidget {
	TWeakObjectPtr<UHLLUI_CharacterSelection> ParentPanel; // 0x238
	int32_t MaxLoadoutColumns; // 0x240
	UHLLUI_LoadoutEntry* LargeItemWidget; // 0x248
	UHLLUI_LoadoutEntry* SmallItemWidget; // 0x250
	TArray<UHLLUI_LoadoutEntry*> ActiveItems; // 0x258
	TArray<UHLLUI_Loadout*> ActiveLoadouts; // 0x268
	UHLLUI_LoadoutTooltip* TooltipItem; // 0x278
	UUniformGridPanel* LoadoutPanel; // 0x280
	UWrapBox* EntryPanel; // 0x288
	UTextBlock* UnlockedText; // 0x290
	UTextBlock* LoadoutName; // 0x298
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UMaterialInterface : UObject {
	USubsurfaceProfile* SubsurfaceProfile; // 0x38
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x50
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct ADeathCamera : AActor {
	UCameraComponent* Camera; // 0x238
	USphereComponent* Collision; // 0x240
	UProjectileMovementComponent* Movement; // 0x248
	float RotationAxisConeHalfAngle; // 0x250
	float RotationSpeed; // 0x254
	float RotationDecelerationSpeed; // 0x258
	float FadeToBlackTime; // 0x25c
	float FadeToSkyViewTime; // 0x260
	float BlownUpDeathScreenDelay; // 0x264
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionDistanceToNearestSurface : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct UBTNode : UObject {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UMaterialExpressionConstantBiasScale : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Bias; // 0x54
	float Scale; // 0x58
};

struct UPlatoonInvitationDialogPlayer : UUserWidget {
	UTextBlock* PlayerName; // 0x230
	UCheckBox* Invited; // 0x238
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x230
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x240
	UNavLinkCustomComponent* SmartLinkComp; // 0x250
	bool bSmartLinkIsRelevant; // 0x258
	FMulticastInlineDelegate OnSmartLinkReached; // 0x260
};

struct AHLL_GameMode_C : AShooterGameMode {
	USceneComponent* DefaultSceneRoot; // 0x528
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UWeaponTPPAnimationSet : UObject {
	UAnimSequence* StandIdle; // 0x28
	UAnimSequence* StandIdleBreak01; // 0x30
	UAnimSequence* StandIdleBreak02; // 0x38
	UAnimSequence* CrouchIdle; // 0x40
	UAnimSequence* CrouchIdleBreak01; // 0x48
	UAnimSequence* CrouchIdleBreak02; // 0x50
	UAnimSequence* ProneIdle; // 0x58
	UAnimSequence* StandRotateRight; // 0x60
	UAnimSequence* StandRotateLeft; // 0x68
	UAnimSequence* CrouchRotateRight; // 0x70
	UAnimSequence* CrouchRotateLeft; // 0x78
	UAnimSequence* ProneRotateRight; // 0x80
	UAnimSequence* ProneRotateLeft; // 0x88
	UAnimSequence* JumpEnter; // 0x90
	UAnimSequence* JumpLoop; // 0x98
	UAnimSequence* JumpExit; // 0xa0
	UAnimSequence* StandSprint; // 0xa8
	UAnimSequence* CrouchSprint; // 0xb0
	UAnimSequence* PoseInheritanceStand; // 0xb8
	UAnimSequence* PoseInheritanceCrouch; // 0xc0
	UAnimSequence* PoseInheritanceProne; // 0xc8
	UAnimSequence* PoseIdleStand; // 0xd0
	UAnimSequence* PoseIdleCrouch; // 0xd8
	UAnimSequence* PoseIdleProne; // 0xe0
	UAnimSequence* PoseAdsStand; // 0xe8
	UAnimSequence* PoseAdsCrouch; // 0xf0
	UAnimSequence* PoseAdsProne; // 0xf8
	UAnimSequence* StandToCrouch; // 0x100
	UAnimSequence* StandToProne; // 0x108
	UAnimSequence* CrouchToStand; // 0x110
	UAnimSequence* CrouchToProne; // 0x118
	UAnimSequence* ProneToStand; // 0x120
	UAnimSequence* ProneToCrouch; // 0x128
	UAnimSequence* DeployInheritPose; // 0x130
	UAnimSequence* StandDeployPivot; // 0x138
	UAnimSequence* StandBipodDeploy; // 0x140
	UAnimMontage* StandBipodUndeploy; // 0x148
	UAnimSequence* CrouchBipodDeploy; // 0x150
	UAnimMontage* CrouchBipodUndeploy; // 0x158
	UAnimSequence* ProneBipodDeploy; // 0x160
	UAnimMontage* ProneBipodUndeploy; // 0x168
	UAnimSequence* StandBipodIdle; // 0x170
	UAnimSequence* CrouchBipodIdle; // 0x178
	UAnimSequence* ProneBipodIdle; // 0x180
	UAnimSequence* BraceStandEnter; // 0x188
	UAnimSequence* BraceStandIdle; // 0x190
	UAnimSequence* BraceStandExit; // 0x198
	UAnimSequence* BraceCrouchEnter; // 0x1a0
	UAnimSequence* BraceCrouchIdle; // 0x1a8
	UAnimSequence* BraceCrouchExit; // 0x1b0
	UAnimSequence* BraceProneEnter; // 0x1b8
	UAnimSequence* BraceProneIdle; // 0x1c0
	UAnimSequence* BraceProneExit; // 0x1c8
	UAnimSequence* BracePivotStand_R; // 0x1d0
	UAnimSequence* BracePivotStand_L; // 0x1d8
	UAnimSequence* BracePivotCrouch_R; // 0x1e0
	UAnimSequence* BracePivotCrouch_L; // 0x1e8
	UAnimSequence* BracePivotProne_R; // 0x1f0
	UAnimSequence* BracePivotProne_L; // 0x1f8
	UBlendSpace* StandLocomotion; // 0x200
	UBlendSpace* StandLocomotionADS; // 0x208
	UBlendSpace* CrouchLocomotion; // 0x210
	UBlendSpace* CrouchLocomotionADS; // 0x218
	UBlendSpace* ProneLocomotion; // 0x220
	UBlendSpace* StandWalkStart; // 0x228
	UBlendSpace* StandWalkStop; // 0x230
	UBlendSpace* StandJogStart; // 0x238
	UBlendSpace* StandJogStop; // 0x240
	UBlendSpace* StandSprintStop; // 0x248
	UBlendSpace* CrouchWalkStart; // 0x250
	UBlendSpace* CrouchWalkStop; // 0x258
	UBlendSpace* CrouchJogStart; // 0x260
	UBlendSpace* CrouchJogStop; // 0x268
	UBlendSpace* CrouchSprintStop; // 0x270
	UBlendSpace* ProneToJog; // 0x278
	UBlendSpace* ProneToSprint; // 0x280
	UBlendSpace* StandSprintStopToProne; // 0x288
	UBlendSpace* StandJogStopToProne; // 0x290
	UBlendSpace* CrouchSprintStopToProne; // 0x298
	UBlendSpace* CrouchJogStopToProne; // 0x2a0
	UBlendSpace* StandVault; // 0x2a8
	UBlendSpace* StandClimb; // 0x2b0
	UAnimMontage* StandLeft; // 0x2b8
	UAnimMontage* StandRight; // 0x2c0
	UAnimMontage* CrouchLeft; // 0x2c8
	UAnimMontage* CrouchRight; // 0x2d0
	UAnimMontage* ProneLeft; // 0x2d8
	UAnimMontage* ProneRight; // 0x2e0
	UAimOffsetBlendSpace* AO_Stand; // 0x2e8
	UAimOffsetBlendSpace* AO_Crouch; // 0x2f0
	UAimOffsetBlendSpace* AO_Crouch_Moving; // 0x2f8
	UAimOffsetBlendSpace* AO_Prone; // 0x300
	UAimOffsetBlendSpace* AO_Stand_ADS; // 0x308
	UAimOffsetBlendSpace* AO_Crouch_ADS; // 0x310
	UAimOffsetBlendSpace* AO_Prone_ADS; // 0x318
};

struct UAIPerceptionComponent : UActorComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xb0
	UAISense* DominantSense; // 0xc0
	AAIController* AIOwner; // 0xd8
	FMulticastInlineDelegate OnPerceptionUpdated; // 0x160
	FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170
};

struct UDialogueVoice : UObject {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UMovieScene3DTransformSection : UMovieSceneSection {
	FMovieSceneTransformMask TransformMask; // 0xe0
	FMovieSceneFloatChannel Translation[0x3]; // 0xe8
	FMovieSceneFloatChannel Rotation[0x3]; // 0x2c8
	FMovieSceneFloatChannel Scale[0x3]; // 0x4a8
	FMovieSceneFloatChannel ManualWeight; // 0x688
	bool bUseQuaternionInterpolation; // 0x72c
};

struct UWGT_LoadoutEntry_Small_C : UHLLUI_LoadoutEntry {
	USizeBox* RootSizer; // 0x268
};

struct AHLLPhysicsVolume : APhysicsVolume {
	char CharacterMovementFlags; // 0x268
};

struct UWGT_UseContext_Resupply_C : UHLLUseContext_Supplies {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
};

struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FScrollBoxStyle ScrollBoxStyle; // 0x30
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
};

struct UCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x120
	FDelegate CheckedStateDelegate; // 0x124
	FCheckBoxStyle WidgetStyle; // 0x138
	USlateWidgetStyleAsset* Style; // 0x6b8
	USlateBrushAsset* UncheckedImage; // 0x6c0
	USlateBrushAsset* UncheckedHoveredImage; // 0x6c8
	USlateBrushAsset* UncheckedPressedImage; // 0x6d0
	USlateBrushAsset* CheckedImage; // 0x6d8
	USlateBrushAsset* CheckedHoveredImage; // 0x6e0
	USlateBrushAsset* CheckedPressedImage; // 0x6e8
	USlateBrushAsset* UndeterminedImage; // 0x6f0
	USlateBrushAsset* UndeterminedHoveredImage; // 0x6f8
	USlateBrushAsset* UndeterminedPressedImage; // 0x700
	EHorizontalAlignment HorizontalAlignment; // 0x708
	FMargin Padding; // 0x70c
	FSlateColor BorderBackgroundColor; // 0x720
	bool IsFocusable; // 0x748
	FMulticastInlineDelegate OnCheckStateChanged; // 0x750
};

struct UHLLAmmoDepotIndicator : UHLLIndicatorBase {
	UBorder* ReplenishBorder; // 0x2a8
};

struct UBPW_EquipmentItem_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UImage* Image_1; // 0x238
	USizeBox* SizeBox_1; // 0x240
	EWeaponType Equipment_Type; // 0x248
	UW_HoverToolTip_Explained_C* Widget_TooltipRef; // 0x250
	FST_EquipmentItem_Info Equipment_Info; // 0x258
	E_SlotSizes SlotSize; // 0x2a8
	FVector2D SlotDimensions; // 0x2ac
};

struct UHLLPhysicalMaterial : UPhysicalMaterial {
	char bSupportBulletPenetration : 1; // 0x80
	char bOverlapGeneratesProjectileFX : 1; // 0x80
	char bEnableEntryFX : 1; // 0x80
	char bEnableExitFX : 1; // 0x80
	char bIgnoreDamageOnPenetration : 1; // 0x80
	int32_t RequiredPower; // 0x84
	float DamageReduction; // 0x88
	float VelocityReduction; // 0x8c
	FLinearColor DebugColour; // 0x90
};

struct AMapData_AdminCam_C : AHLLMapData_AdminCamera {
	USceneComponent* DefaultSceneRoot; // 0x240
};

struct UInterpTrackInstDirector : UInterpTrackInst {
	AActor* OldViewTarget; // 0x28
};

struct UNavigationSystemConfig : UObject {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct UHLLRoundSummaryTeam : UUserWidget {
	UImage* TeamFlag; // 0x238
	UTextBlock* MunitionsText; // 0x240
	UTextBlock* ManpowerText; // 0x248
	UTextBlock* FuelText; // 0x250
	UTextBlock* ScoreValue; // 0x258
};

struct UInAppPurchaseRestoreCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UHTP_Widget_DeploymentScreen_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UImage* Image_1; // 0x238
	UImage* Image_2; // 0x240
	UImage* Image_3; // 0x248
	UImage* Image_22; // 0x250
	UImage* Image_23; // 0x258
	URichTextBlock* RichTextBlock_1; // 0x260
	UTextBlock* txt_Name; // 0x268
	UTextBlock* txt_Tagline; // 0x270
};

struct UBrushBuilder : UObject {
	FString BitmapFilename; // 0x28
	FString Tooltip; // 0x38
	char NotifyBadParams : 1; // 0x48
	TArray<FVector> Vertices; // 0x50
	TArray<FBuilderPoly> Polys; // 0x60
	FName Layer; // 0x70
	char MergeCoplanars : 1; // 0x78
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct UDataAsset : UObject {
	UDataAsset* NativeClass; // 0x28
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x2d0
	char bStopAILogicOnUnposses : 1; // 0x2d0
	char bLOSflag : 1; // 0x2d0
	char bSkipExtraLOSChecks : 1; // 0x2d0
	char bAllowStrafe : 1; // 0x2d0
	char bWantsPlayerState : 1; // 0x2d0
	char bSetControlRotationFromPawnOrientation : 1; // 0x2d0
	UPathFollowingComponent* PathFollowingComponent; // 0x2d8
	UBrainComponent* BrainComponent; // 0x2e0
	UAIPerceptionComponent* PerceptionComponent; // 0x2e8
	UPawnActionsComponent* ActionsComp; // 0x2f0
	UBlackboardComponent* Blackboard; // 0x2f8
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x300
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x308
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x310
};

struct UBPW_Army_V2_C : UArmy {
	FPointerToUberGraphFrame UberGraphFrame; // 0x258
	UWidgetAnimation* A_NewUnit; // 0x260
	UBorder* Border_1; // 0x268
	UButton* btn_NewUnit; // 0x270
	UVerticalBox* CommanderPanel; // 0x278
	UHLLScrollBox* HLLScrollBox_358; // 0x280
	UImage* Image_161; // 0x288
	FTimerHandle Timer_CheckForUnits; // 0x290
	FMulticastInlineDelegate Btn_NewUnitPressed; // 0x298
	ETeam Player_Team; // 0x2a8
	FMulticastInlineDelegate CreateInfantry; // 0x2b0
	FMulticastInlineDelegate CreateArmor; // 0x2c0
	FMulticastInlineDelegate CreateRecon; // 0x2d0
	UArmyCommanderRole* CommanderWidget; // 0x2e0
	FMulticastInlineDelegate OnNavigateRight; // 0x2e8
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x2f8
	UWidget* LastSelectedWidget; // 0x300
};

struct AHLLMapData_Player : AHLLMapDataBase {
	char PlayerYaw; // 0x238
	char bIsSeated : 1; // 0x239
	APlayerState* PlayerState; // 0x240
};

struct UHLLUI_CreditsCategory_RoleAndMembers : UUserWidget {
	UTextBlock* TitleText; // 0x230
	UTextBlock* MemberText; // 0x238
};

struct UVRNotificationsComponent : UActorComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb0
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc0
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd0
	FMulticastInlineDelegate HMDLostDelegate; // 0xe0
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf0
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x100
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x110
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x120
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x130
};

struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bIsDirty : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UGamepadRTBImageDecorator : URichTextBlockImageDecorator {
	UDataTable* PlaystationButtonTable; // 0x30
	UDataTable* XboxButtonTable; // 0x38
};

struct UReconDriverSeatUI : UVehicleDriverSeatUI {
	UImage* TankTurretImage; // 0x2d0
};

struct UMaterialExpressionMaterialFunctionCall : UMaterialExpression {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UARTrackedQRCode : UARTrackedImage {
	FString QRCode; // 0xf8
	int32_t Version; // 0x108
};

struct USlider : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	float MinValue; // 0x11c
	float MaxValue; // 0x120
	FSliderStyle WidgetStyle; // 0x128
	EOrientation Orientation; // 0x468
	FLinearColor SliderBarColor; // 0x46c
	FLinearColor SliderHandleColor; // 0x47c
	bool IndentHandle; // 0x48c
	bool Locked; // 0x48d
	bool MouseUsesStep; // 0x48e
	bool RequiresControllerLock; // 0x48f
	float StepSize; // 0x490
	bool IsFocusable; // 0x494
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x498
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x4a8
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x4b8
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4c8
	FMulticastInlineDelegate OnValueChanged; // 0x4d8
};

struct AShooterWeapon_HealBase : AShooterWeapon {
	FHealWeaponData HealWeaponConfig; // 0x8b8
	TWeakObjectPtr<AShooterCharacter> CurrentHealTarget; // 0x988
};

struct UOptionsTabButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UButton* OptionButton; // 0x238
	UTextBlock* OptionTextBlock; // 0x240
	FButtonStyle InitialButtonStyle; // 0x248
	FText Text; // 0x4c0
	FSlateColor NormalTextColor; // 0x4d8
	FSlateColor HoveredTextColor; // 0x500
	FMulticastInlineDelegate OnClicked; // 0x528
	bool Active; // 0x538
	bool Hovered; // 0x539
	FButtonStyle NormalButtonStyle; // 0x540
	FButtonStyle ActiveButtonStyle; // 0x7b8
	FButtonStyle FocusedButtonStyle; // 0xa30
	FButtonStyle SelectedButtonStyle; // 0xca8
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct USignificanceManager : UObject {
	FSoftClassPath SignificanceManagerClassName; // 0x108
};

struct USoundCue : USoundBase {
	char bPrimeOnLoad : 1; // 0x160
	USoundNode* FirstNode; // 0x168
	float VolumeMultiplier; // 0x170
	float PitchMultiplier; // 0x174
	FSoundAttenuationSettings AttenuationOverrides; // 0x178
	float SubtitlePriority; // 0x518
	char bOverrideAttenuation : 1; // 0x520
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x520
	int32_t CookedQualityIndex; // 0x524
	char bHasPlayWhenSilent : 1; // 0x528
};

struct AShermanJumbo : ABaseTank {
	UTracksComponent* Tracks2; // 0x5d8
};

struct UHLLSeatNameplateContainer : UHLLNameplateIndicatorBase {
	UHLLSeatIndicatorItem* ItemClass; // 0x2b8
	char bShowOnlyDriver : 1; // 0x2c0
	char bShowPassengerCount : 1; // 0x2c0
	TArray<UHLLSeatIndicatorItem*> ItemWidgets; // 0x2c8
	UVerticalBox* OccupantVBox; // 0x2d8
	UWidget* AdditionalOccupants; // 0x2e0
	UTextBlock* AdditionalOccupantText; // 0x2e8
};

struct AShooterGameSession : AGameSession {
	AOnlineBeaconHost* BeaconHost; // 0x4f0
	AServerQueueBeaconHostObject* ServerQueueBeaconHostObject; // 0x4f8
};

struct UGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FGameplayTagTableRow> GameplayTagList; // 0x38
};

struct USoundNodeLooping : USoundNode {
	int32_t LoopCount; // 0x48
	char bLoopIndefinitely : 1; // 0x4c
};

struct AShooterWeapon_Instant : AShooterWeapon {
	FInstantWeaponData InstantConfig; // 0x8b8
	AShooterImpactEffect* ImpactTemplate; // 0x8f0
	FHLLTracerProperties TracerProperties; // 0x8f8
	FInstantHitInfo HitNotify; // 0x910
	float SuppressionBulletRadius; // 0x928
	float SuppressionBulletAmount; // 0x92c
	float SuppressionBulletFalloff; // 0x930
	float SuppressionScoreModifier; // 0x934
	int32_t NumSuppressionShotsForScore; // 0x938
	float Cached_MaxRange; // 0x940
	float Cached_MaxTravelTime; // 0x944
	char TracerCounter; // 0x948
};

struct APostProcessVolume : AVolume {
	FPostProcessSettings Settings; // 0x260
	float Priority; // 0x7a0
	float BlendRadius; // 0x7a4
	float BlendWeight; // 0x7a8
	char bEnabled : 1; // 0x7ac
	char bUnbound : 1; // 0x7ac
};

struct UMaterialExpressionCeil : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionParticleSubUV : UMaterialExpressionTextureSample {
	char bBlend : 1; // 0xd0
};

struct UWGT_BrowserFilterButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UCheckBox* RootCheck; // 0x238
	UTextBlock* RootText; // 0x240
	EHLLUI_ServerShowFilter FilterType; // 0x248
	FMulticastInlineDelegate OnToggle; // 0x250
	FCheckBoxStyle FocusedStyle; // 0x260
	FCheckBoxStyle InitialStyle; // 0x7e0
	UWGT_ServerBrowser_V2_C* ServerBrowser; // 0xd60
};

struct UW_HotkeyPanelElement_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UScaleBox* SB_Icon; // 0x238
	UTextBlock* txt_hintText; // 0x240
	FText HintText; // 0x248
	FName KeybindName; // 0x260
	bool isKey; // 0x268
	FSlateBrush IconBrush; // 0x270
	FText KeyBind; // 0x2f8
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xe0
	FFrameNumber StartFrameOffset; // 0xe8
	float StartOffset; // 0xec
	float AudioStartTime; // 0xf0
	float AudioDilationFactor; // 0xf4
	float AudioVolume; // 0xf8
	FMovieSceneFloatChannel SoundVolume; // 0x100
	FMovieSceneFloatChannel PitchMultiplier; // 0x1a0
	FMovieSceneActorReferenceData AttachActorData; // 0x240
	bool bSuppressSubtitles; // 0x2f0
	bool bOverrideAttenuation; // 0x2f1
	USoundAttenuation* AttenuationSettings; // 0x2f8
	FDelegate OnQueueSubtitles; // 0x300
	FMulticastInlineDelegate OnAudioFinished; // 0x310
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x320
};

struct UBuildPatchManifest : UObject {
	char ManifestFileVersion; // 0x28
	bool bIsFileData; // 0x29
	uint32_t AppID; // 0x2c
	FString AppName; // 0x30
	FString BuildVersion; // 0x40
	FString LaunchExe; // 0x50
	FString LaunchCommand; // 0x60
	TSet<FString> PrereqIds; // 0x70
	FString PrereqName; // 0xc0
	FString PrereqPath; // 0xd0
	FString PrereqArgs; // 0xe0
	TArray<FFileManifestData> FileManifestList; // 0xf0
	TArray<FChunkInfoData> ChunkList; // 0x100
	TArray<FCustomFieldData> CustomFields; // 0x110
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
};

struct UMaterialExpressionShaderStageSwitch : UMaterialExpression {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct UCompositionGraphCaptureProtocol : UMovieSceneImageCaptureProtocolBase {
	FCompositionGraphCapturePasses IncludeRenderPasses; // 0x58
	bool bCaptureFramesInHDR; // 0x68
	int32_t HDRCompressionQuality; // 0x6c
	EHDRCaptureGamut CaptureGamut; // 0x70
	FSoftObjectPath PostProcessingMaterial; // 0x78
	bool bDisableScreenPercentage; // 0x90
	UMaterialInterface* PostProcessingMaterialPtr; // 0x98
};

struct AMapData_Recon_C : AHLLMapData_ReconItem {
	USceneComponent* DefaultSceneRoot; // 0x268
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct AFlamethrowerBurningSpot : AActor {
	float Power; // 0x220
};

struct UMovieSceneLevelVisibilitySection : UMovieSceneSection {
	ELevelVisibility Visibility; // 0xe0
	TArray<FName> LevelNames; // 0xe8
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct APaperTerrainActor : AActor {
	USceneComponent* DummyRoot; // 0x220
	UPaperTerrainSplineComponent* SplineComponent; // 0x228
	UPaperTerrainComponent* RenderComponent; // 0x230
};

struct ULandscapeGrassType : UObject {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct UTankGunnerSeatUI : UHLLTankSeatUI_Base {
	UHLLArmourWeaponUI* PrimaryWeaponInfo; // 0x280
	UHLLArmourWeaponUI* SecondaryWeaponInfo; // 0x288
	URichTextBlock* ZoomKeyText; // 0x290
	URichTextBlock* PrecisionKeyText; // 0x298
	UBorder* MuzzleOcclusion; // 0x2a0
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UPaperTerrainMaterial : UDataAsset {
	TArray<FPaperTerrainMaterialRule> Rules; // 0x30
	UPaperSprite* InteriorFill; // 0x40
};

struct AMobileSpawn : AActor {
	float WaveIntervalSeconds; // 0x230
	FDynamicSpawnGatherParams SpawnGatherParams; // 0x234
	UNearbySpawnEnemyDetection* NearbySpawnEnemyDetection; // 0x260
	UHLLMapComponent* SpawnMapComponent; // 0x268
	UAudioComponent* SpawnAudio; // 0x270
	float NextSpawnWaveTime; // 0x278
	char bAllowedToDeploy : 1; // 0x27c
	char bIsDrowning : 1; // 0x27c
	float MovementSpeedKph; // 0x280
	char NumAvailableSpawnLocations; // 0x284
	ETeam Team; // 0x285
};

struct UHLLUseContext_Supplies : UHLLUseContextBase {
	FSlateBrush CanUseIcon; // 0x238
	FSlateBrush CantUseIcon; // 0x2c0
	UImage* RadialProg; // 0x348
	UImage* IconImage; // 0x350
	URichTextBlock* DisplayText; // 0x358
};

struct ULevelSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x348
	FLevelSequenceObjectReferenceMap ObjectReferences; // 0x350
	FLevelSequenceBindingReferences BindingReferences; // 0x3a0
	TMap<FString, FLevelSequenceObject> PossessedObjects; // 0x440
	UObject* DirectorClass; // 0x490
};

struct UMovieSceneBuiltInEasingFunction : UObject {
	EMovieSceneBuiltInEasing Type; // 0x30
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x80
	bool bAdditivePose; // 0x110
	int32_t BasePoseIndex; // 0x114
	FName RetargetSource; // 0x118
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UMaterialExpressionLogarithm2 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UBTService_BlueprintBase : UBTService {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UShooterGameInstance : UGameInstance {
	FMulticastInlineDelegate RconStatePostInitialisedEvent; // 0x198
	FString WelcomeScreenMap; // 0x1b0
	FString MainMenuMap; // 0x1c0
	ULoadingScreensData* LoadingScreensData; // 0x408
	AActor* m_pendingRconActor; // 0x468
	UHLLOnlineStatsManager* StatManager; // 0x488
	UHLLCosmeticManager* CosmeticManager; // 0x490
	UServerQueue* ServerQueue; // 0x498
	UHintsAndTips* HintsAndTips; // 0x4a0
	TSoftClassPtr<UObject> MaterialManagerClass; // 0x4b8
	UHLLMaterialManager* MaterialManager; // 0x4e0
};

struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UHLLScopeImage : UImage {
	ESlateVisibility VisibilityWhenUnloaded; // 0x210
};

struct UParticleModuleBeamSource : UParticleModuleBeamBase {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UParticleModuleVectorFieldRotationRate : UParticleModuleVectorFieldBase {
	FVector RotationRate; // 0x30
};

struct UMovieSceneFolder : UObject {
	FName FolderName; // 0x28
	TArray<UMovieSceneFolder*> ChildFolders; // 0x30
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x40
	TArray<FString> ChildObjectBindingStrings; // 0x50
};

struct ATiger : ABaseTank {
	UTracksComponent* Tracks2; // 0x5d8
};

struct UHLLMarkerIndicator : UHLLIndicatorBase {
	float FadeTime; // 0x2a8
	float ProjectionEdgePadding; // 0x2ac
	UWidgetAnimation* MovedOrPlacedAnim; // 0x2b0
	UImage* MarkerIcon; // 0x2b8
	UTextBlock* MarkerText; // 0x2c0
	UTextBlock* OwnerText; // 0x2c8
	UTextBlock* DistanceText; // 0x2d0
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UEnvQueryInstanceBlueprintWrapper : UObject {
	int32_t QueryID; // 0x30
	UEnvQueryItemType* ItemType; // 0x58
	int32_t OptionIndex; // 0x60
	FMulticastInlineDelegate OnQueryFinishedEvent; // 0x68
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UMaterialExpressionMaterialProxyReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x40
};

struct AHLLCommanderAbility_ReconPlane : AHLLCommanderAbility_PlaneBase {
	char bLOSCheck : 1; // 0x3b8
	TArray<EObjectTypeQuery> ScanObjectTypes; // 0x3c0
	ECollisionChannel LOSChannel; // 0x3d0
	float DistanceBetweenScans; // 0x3d4
	float ScanRadius; // 0x3d8
};

struct UWidgetSwitcherSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UProceduralFoliageSpawner : UObject {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct UHLLUI_PlayerLevel : UUserWidget {
	char bUseGrouping : 1; // 0x230
	UTextBlock* PlayerName; // 0x238
	UTextBlock* PlayerLevel; // 0x240
	UTextBlock* CurrentXP; // 0x248
	UTextBlock* NextLevelXP; // 0x250
	UProgressBar* LevelProgress; // 0x258
	UWidget* RankContainer; // 0x260
	UImage* RankIcon; // 0x268
};

struct UHLLDeployment_TeamSelectItem : UUserWidget {
	UHLLDeployment_TeamSelect* OwningTeamPanel; // 0x230
	ETeam AssignedTeam; // 0x238
	EFaction AssignedFaction; // 0x239
	char bIsAvailable : 1; // 0x23a
	UWidget* EnabledStateWidget; // 0x240
	UTextBlock* PlayerCount; // 0x248
	UTextBlock* FactionName; // 0x250
	UImage* FactionIcon; // 0x258
	UButton* SelectButton; // 0x260
};

struct ACameraShakeSourceActor : AActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x220
};

struct UWGT_MapIcon_Garrison_C : UHLLMapIcon_Garrison {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4a8
	UBorder* Icon; // 0x4b0
	UOverlay* Overlay; // 0x4b8
	UScaleBox* Scaler; // 0x4c0
	USizeBox* Sizer; // 0x4c8
	UW_HoverToolTip_Explained_C* Widget_TooltipRef; // 0x4d0
};

struct AGarrison : ADynamicSpawn {
	bool bStrongInLockedSectors; // 0x3f0
	float StrongDismantleTime; // 0x3f4
};

struct UArmy : UUserWidget {
	UArmyCommanderRole* CommanderRole; // 0x230
	UPlatoonList* Infantry; // 0x238
	UPlatoonList* Armor; // 0x240
	UPlatoonList* Recon; // 0x248
	char bReadOnly : 1; // 0x250
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct AHLLAmmoDepot : AHLLDispenseStructure {
	int32_t ReplenishRate; // 0x370
	float ReplenishRadius; // 0x374
	USoundBase* ReplenishingSound; // 0x378
	char bIsReplenishing : 1; // 0x388
	UParticleSystemComponent* ReplenishParticle; // 0x390
	TWeakObjectPtr<UAudioComponent> ReplenishAC; // 0x398
	UHLLMapComponent* MapComponent; // 0x3a0
	UHLLIndicatorComponent* IndicatorComponent; // 0x3a8
};

struct UParticleModuleLight_Seeded : UParticleModuleLight {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UGameplayTask : UObject {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UMovieSceneCameraShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x58
};

struct UAutoDestroySubsystem : UWorldSubsystem {
	TArray<AActor*> ActorsToPoll; // 0x38
};

struct UPawnNoiseEmitterComponent : UActorComponent {
	char bAIPerceptionSystemCompatibilityMode : 1; // 0xb0
	FVector LastRemoteNoisePosition; // 0xb4
	float NoiseLifetime; // 0xc0
	float LastRemoteNoiseVolume; // 0xc4
	float LastRemoteNoiseTime; // 0xc8
	float LastLocalNoiseVolume; // 0xcc
	float LastLocalNoiseTime; // 0xd0
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct UHLLRoundSummaryPlayer : UUserWidget {
	bool bIsLocalPlayer; // 0x230
	bool bHasFocus; // 0x232
	UBorder* RootBorder; // 0x248
	UTextBlock* PlayerName; // 0x250
	UTextBlock* PlayerClan; // 0x258
	UImage* PlayerIcon; // 0x260
	UImage* RankIcon; // 0x268
	UPanelWidget* RankIconContainer; // 0x270
	UTextBlock* PlayerLevel; // 0x278
	UTextBlock* PingValue; // 0x280
	UTextBlock* CombatValue; // 0x288
	UTextBlock* OffenseValue; // 0x290
	UTextBlock* DefenseValue; // 0x298
	UTextBlock* SupportValue; // 0x2a0
	UTextBlock* CommendCount; // 0x2a8
	UButton* CommendButton; // 0x2b0
	UImage* CommendIcon; // 0x2b8
	UMenuAnchor* MenuAnchor; // 0x2c0
	ECommendationTooltipType CommendationType; // 0x2ca
	UImage* VoipIcon; // 0x2d0
	TWeakObjectPtr<AShooterPlayerState> AssignedPlayer; // 0x2d8
	UImage* KickIcon; // 0x2e0
	UTextBlock* VotingText; // 0x2e8
	FText KickTooltipText; // 0x2f0
	FText MuteTooltipText; // 0x308
	UWidget* FriendWidget; // 0x320
};

struct UBTService_DefaultFocus : UBTService_BlackboardBase {
	char FocusPriority; // 0x98
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FPartyReservation PendingReservation; // 0x2f0
	EClientRequestType RequestType; // 0x340
	bool bPendingReservationSent; // 0x341
	bool bCancelReservation; // 0x342
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x250
	TArray<AOnlineBeaconClient*> ClientActors; // 0x258
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct ULandscapeHeightfieldCollisionComponent : UPrimitiveComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x410
	int32_t SectionBaseX; // 0x420
	int32_t SectionBaseY; // 0x424
	int32_t CollisionSizeQuads; // 0x428
	float CollisionScale; // 0x42c
	int32_t SimpleCollisionSizeQuads; // 0x430
	TArray<char> CollisionQuadFlags; // 0x438
	FGuid HeightfieldGuid; // 0x448
	FBox CachedLocalBox; // 0x458
	LazyObjectProperty RenderComponent; // 0x474
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x4a0
};

struct AHLLResourceNode : AActor {
	USceneComponent* DummyRoot; // 0x290
	UStaticMeshComponent* Mesh; // 0x298
	UHLLMapComponent* MapComponent; // 0x2a0
	UHLLIndicatorComponent* IndicatorComponent; // 0x2a8
	UHLLResourceGenerator* ResourceComponent; // 0x2b0
	UHLLSimpleHealthComponent* HealthComponent; // 0x2b8
	float DismantleTime; // 0x2c0
	ETeam OwningTeam; // 0x2c4
	char RegenerationTypes; // 0x2c5
	float AmmoRegenRadius; // 0x2c8
	FCollisionProfileName AmmoRegenQuery; // 0x2cc
	float AmmoRegenLength; // 0x2d4
	FName RegenerationScoreName; // 0x2d8
	FHLLUpgradeInfo UpgradeData; // 0x2e0
	UHLLUpgradeGhostComponent* UpgradeGhostComponent; // 0x368
	EHLLDamageFilterType DamageFilterType; // 0x370
	AShooterPlayerState* SpawnedByPlayer; // 0x378
	int32_t NodeID; // 0x388
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb0
	float LOSHearingThreshold; // 0xb4
	float SightRadius; // 0xb8
	float SensingInterval; // 0xbc
	float HearingMaxSoundAge; // 0xc0
	char bEnableSensingUpdates : 1; // 0xc4
	char bOnlySensePlayers : 1; // 0xc4
	char bSeePawns : 1; // 0xc4
	char bHearNoises : 1; // 0xc4
	FMulticastInlineDelegate OnSeePawn; // 0xd0
	FMulticastInlineDelegate OnHearNoise; // 0xe0
	float PeripheralVisionAngle; // 0xf0
	float PeripheralVisionCosine; // 0xf4
};

struct UModelComponent : UPrimitiveComponent {
	UBodySetup* ModelBodySetup; // 0x428
};

struct UParticleModuleLocationEmitterDirect : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
};

struct UMaterialExpressionSkyAtmosphereAerialPerspective : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
};

struct AFlamethrowerBurningCharacter : AActor {
	ACharacter* BurningCharacter; // 0x220
};

struct UTruckDriverSeatUI : UVehicleDriverSeatUI {
	UPanelWidget* DropsPanel; // 0x2d0
	UTextBlock* DropCount; // 0x2d8
	UPanelWidget* DropActionPanel; // 0x2e0
	UImage* DropProgressWheel; // 0x2e8
	UWidgetSwitcher* DropsStatusSwitcher; // 0x2f0
	UPanelWidget* DropBlockedPanel; // 0x2f8
	UPanelWidget* DropInProgressPanel; // 0x300
	URichTextBlock* SuppliesKeyHint; // 0x308
};

struct UBPW_PlatoonInvitationDialog_V2_C : UPlatoonInvitationDialog {
	FPointerToUberGraphFrame UberGraphFrame; // 0x258
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo_V2; // 0x260
	UbtnSimple_V2_C* CancelButton; // 0x268
	UImage* Image_1; // 0x270
	UbtnSimple_V2_C* InviteButton; // 0x278
	URetainerBox* RetainerBox_2; // 0x280
	int32_t PlayersSelected; // 0x288
	bool bClosing; // 0x28c
};

struct UHLLMenuButton : UUserWidget {
	FMulticastInlineDelegate OnPress; // 0x230
	FText Text; // 0x240
	UImage* HoverIcon; // 0x258
	UButton* RootButton; // 0x260
	UTextBlock* ButtonText; // 0x268
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xe0
};

struct UAssetManager : UObject {
	TArray<UObject*> ObjectReferenceList; // 0x2c0
	bool bIsGlobalAsyncScanEnvironment; // 0x2d0
	bool bShouldGuessTypeAndName; // 0x2d1
	bool bShouldUseSynchronousLoad; // 0x2d2
	bool bIsLoadingFromPakFiles; // 0x2d3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2d4
	bool bOnlyCookProductionAssets; // 0x2d5
	bool bIsBulkScanning; // 0x2d6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2d7
	bool bIsManagementDatabaseCurrent; // 0x2d8
	bool bUpdateManagementDatabaseAfterScan; // 0x2d9
	bool bIncludeOnlyOnDiskAssets; // 0x2da
	int32_t NumberOfSpawnedNotifications; // 0x2dc
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x230
};

struct UPendingPlayerDeployment : UObject {
	TScriptInterface<IDynamicSpawnInterface> Spawn; // 0x30
	AShooterPlayerController* Player; // 0x40
};

struct UClothingAssetBase : UObject {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct URotatingMovementComponent : UMovementComponent {
	FRotator RotationRate; // 0xf0
	FVector PivotTranslation; // 0xfc
	char bRotationInLocalSpace : 1; // 0x108
};

struct UMatchmakingScreen_V2_C : UHLLMatchmaking {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UWidgetAnimation* Anim_Select; // 0x238
	UTextBlock* ActivityText; // 0x240
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x248
	UWidgetSwitcher* ButtonSwitcher; // 0x250
	UbtnSimple_V2_C* CommunityServersButton; // 0x258
	UWidgetSwitcher* FilterSwitcher; // 0x260
	UbtnSimple_V2_C* FindMatchButton; // 0x268
	UGameFiltersScreen_C* GameFiltersScreen; // 0x270
	UHorizontalBox* HorizontalBox_1; // 0x278
	UImage* Image_3; // 0x280
	UImage* Image_4; // 0x288
	UImage* Loading; // 0x290
	UWidgetSwitcher* MatchmakingSwitcher; // 0x298
	UButton* MessageHelp; // 0x2a0
	UOptionsScreen_V2_C* OptionsScreen; // 0x2a8
	UWidgetSwitcher* OptionsSwitcher; // 0x2b0
	UScrollBox* PartyScrollingList; // 0x2b8
	UWidgetSwitcher* ServerListSwitcher; // 0x2c0
	UbtnSimple_V2_C* StartMatchButton; // 0x2c8
	UTextBlock* TimeAsText; // 0x2d0
	float WidthScaling; // 0x2d8
	bool bCurrentEnabledState; // 0x2dc
	UMainMenuWidget_V2_C* MainMenu; // 0x2e0
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x220
};

struct UAnimationSettings : UDeveloperSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bOnlyCheckForMissingSkeletalMeshes; // 0x51
	bool bForceBelowThreshold; // 0x52
	bool bFirstRecompressUsingCurrentOrDefault; // 0x53
	bool bRaiseMaxErrorToExisting; // 0x54
	bool bEnablePerformanceLog; // 0x55
	bool bStripAnimationDataOnDedicatedServer; // 0x56
	bool bTickAnimationOnSkeletalMeshInit; // 0x57
};

struct UAISenseConfig_Blueprint : UAISenseConfig {
	UAISense_Blueprint* Implementation; // 0x48
};

struct UWGT_CommendTooltip_List_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UTextBlock* 1; // 0x238
	UTextBlock* 2; // 0x240
	UTextBlock* 3; // 0x248
	UTextBlock* 4; // 0x250
	UTextBlock* 5; // 0x258
	UHLLRoundSummaryPlayer* OwningWidget; // 0x260
	TArray<UTextBlock*> NameWidgets; // 0x268
	int32_t MaxCommendations; // 0x278
};

struct UBorder : UContentWidget {
	EHorizontalAlignment HorizontalAlignment; // 0x120
	EVerticalAlignment VerticalAlignment; // 0x121
	char bShowEffectWhenDisabled : 1; // 0x122
	FLinearColor ContentColorAndOpacity; // 0x124
	FDelegate ContentColorAndOpacityDelegate; // 0x134
	FMargin Padding; // 0x144
	FSlateBrush Background; // 0x158
	FDelegate BackgroundDelegate; // 0x1e0
	FLinearColor BrushColor; // 0x1f0
	FDelegate BrushColorDelegate; // 0x200
	FVector2D DesiredSizeScale; // 0x210
	bool bFlipForRightToLeftFlowDirection; // 0x218
	FDelegate OnMouseButtonDownEvent; // 0x21c
	FDelegate OnMouseButtonUpEvent; // 0x22c
	FDelegate OnMouseMoveEvent; // 0x23c
	FDelegate OnMouseDoubleClickEvent; // 0x24c
};

struct UTimeSynchronizationSource : UObject {
	bool bUseForSynchronization; // 0x28
	int32_t FrameOffset; // 0x2c
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	float OutputVolume; // 0x68
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x70
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct USkeletalMeshSimplificationSettings : UDeveloperSettings {
	FName SkeletalMeshReductionModuleName; // 0x38
};

struct AHLLMapData_Marker : AHLLMapDataBase {
	EHLLMarker MarkerType; // 0x238
	char MarkerSubIndex; // 0x239
	TWeakObjectPtr<AShooterPlayerState> OwningPlayer; // 0x23c
	FMulticastInlineDelegate OnMovedOrPlacedDelegate; // 0x248
	bool bWantsDisplayed; // 0x258
	float DisplayToggleOnTime; // 0x25c
	float DisplayToggleOffTime; // 0x260
	UHLLIndicatorComponent_Marker* IndicatorComponent; // 0x268
};

struct UHLLMapIcon_SeatBase : UHLLMapIconBase {
	char bColouriseButton : 1; // 0x368
	char bColouriseIcon : 1; // 0x368
};

struct UTorsionBarSuspensionsComponent : USuspensionsComponent {
	float DefaultSuspensionArmLength; // 0xb8
	float RotationSpeed; // 0xbc
	TArray<FTrackedVehicleTorsionBarSuspensionDescriptor> SuspensionDescriptors; // 0xc0
	FTrackedVehicleTorsionBarSuspensionFixedWheel LeftSprocket; // 0xd0
	FTrackedVehicleTorsionBarSuspensionFixedWheel RightSprocket; // 0xe8
	FTrackedVehicleTorsionBarSuspensionFixedWheel LeftRoller; // 0x100
	FTrackedVehicleTorsionBarSuspensionFixedWheel RightRoller; // 0x118
	UTracksComponent* Tracks; // 0x130
	USkeletalMeshComponent* Mesh; // 0x138
};

struct AHLLDispenserItem_StructureAdv : AHLLDispenserItem_StructureBase {
	int32_t RequiredNearbyPlatoonMembers; // 0x488
	TArray<AActor*> DistanceCheckClasses; // 0x490
	float MinDistanceToOther; // 0x4a0
	float MinAllowedEnemyDistance; // 0x4a4
	float MaxPlatoonMemberDistance; // 0x4a8
};

struct UHLLDismemberData : UDataAsset {
	USkeletalMesh* GoreMesh; // 0x30
	UPhysicsAsset* GoreMeshPhysicsAsset; // 0x38
	FName COMBoneName; // 0x40
	float COMImpulseScale; // 0x48
	USoundCue* TearSound; // 0x50
	TArray<FHLLBreakableJointData> BreakableJoints; // 0x58
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	ECollisionChannel DefaultSightCollisionChannel; // 0x9b
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct UTabbedButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UImage* LabelRadio; // 0x238
	UTextBlock* LabelText; // 0x240
	UButton* RootButton; // 0x248
	UTextBlock* SpacerText; // 0x250
	UWidget* ParentWidget; // 0x258
	bool bSelected; // 0x260
	bool bHovered; // 0x261
	FText ButtonText; // 0x268
	bool bHasSectionFocus; // 0x280
	FMulticastInlineDelegate OnClicked; // 0x288
	int32_t TextSize; // 0x298
};

struct UEditableTextBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextBoxStyle EditableTextBoxStyle; // 0x30
};

struct UWGT_CommanderPanel_C : UHLLCommanderUI {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UImage* GreyOut; // 0x2e8
	UImage* GreyOut_2; // 0x2f0
	UImage* GreyOut_3; // 0x2f8
	UImage* Image_1; // 0x300
	UImage* Image_6; // 0x308
	UImage* Image_7; // 0x310
	UImage* Image_8; // 0x318
	UImage* Image_10; // 0x320
	UImage* Image_11; // 0x328
	UImage* Image_13; // 0x330
	UCanvasPanel* Tooltip; // 0x338
	USizeBox* ToolTipContainer; // 0x340
	UWGT_OverviewMap_V2_C* OverviewMapParent; // 0x348
};

struct UW_GH_GameProgress_PopIndicator_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UBorder* B_Master; // 0x238
	UBorder* B_StrongPoint; // 0x240
	UGridPanel* GP_Holder; // 0x248
	UHorizontalBox* HB_PopHolder; // 0x250
	UImage* Img_PopI_01; // 0x258
	UImage* Img_PopI_02; // 0x260
	UImage* Img_PopI_03; // 0x268
	bool Population_Enemy; // 0x270
	bool test; // 0x271
};

struct UInterpTrackLinearColorBase : UInterpTrack {
	FInterpCurveLinearColor LinearColorTrack; // 0x70
	float CurveTension; // 0x88
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x270
	FName PreviousMatchState; // 0x278
	int32_t ElapsedTime; // 0x280
};

struct UClothPhysicalMeshDataBase_Legacy : UObject {
	TArray<FVector> Vertices; // 0x28
	TArray<FVector> Normals; // 0x38
	TArray<uint32_t> Indices; // 0x48
	TArray<float> InverseMasses; // 0x58
	TArray<FClothVertBoneData> BoneData; // 0x68
	int32_t NumFixedVerts; // 0x78
	int32_t MaxBoneWeights; // 0x7c
	TArray<uint32_t> SelfCollisionIndices; // 0x80
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x220
};

struct UInterpTrackParticleReplay : UInterpTrack {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0x70
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UWeaponFPPAnimationSet : UObject {
	UAnimSequence* PoseInheritance; // 0x28
	UAnimSequence* PoseIdle; // 0x30
	UAnimSequence* PoseADS; // 0x38
	FWeaponAnim Equip; // 0x40
	FWeaponAnim Fire; // 0x68
	FWeaponAnim Bolt; // 0x90
	FWeaponAnim Reload; // 0xb8
	FWeaponAnim ReloadEmpty; // 0xe0
	FWeaponAnim ChangeBarrel; // 0x108
	FWeaponAnim ReloadEnter; // 0x130
	FWeaponAnim ReloadEnterWet; // 0x158
	FWeaponAnim ReloadLoop; // 0x180
	FWeaponAnim ReloadLoopWet; // 0x1a8
	FWeaponAnim ReloadExit; // 0x1d0
	FWeaponAnim ReloadExitEmpty; // 0x1f8
	FWeaponAnim Deploy; // 0x220
	FWeaponAnim Undeploy; // 0x248
	FWeaponAnim ReloadDeployed; // 0x270
	FWeaponAnim ReloadDeployedEmpty; // 0x298
	FWeaponAnim ChangeBarrelDeployed; // 0x2c0
	UAnimMontage* Jump; // 0x2e8
	UAnimMontage* Vault; // 0x2f0
	UAnimMontage* Climb; // 0x2f8
	UAnimMontage* StandToProne; // 0x300
	UAnimMontage* ProneToStand; // 0x308
	UAnimSequence* Sprint; // 0x310
	UBlendSpace* Crawl; // 0x318
};

struct UHLLDispenserListItem : UUserWidget {
	UBorder* RootBorder; // 0x230
	UImage* ItemIcon; // 0x238
	UTextBlock* ItemName; // 0x240
	UTextBlock* ItemLimits; // 0x248
};

struct UWGT_MapSelectButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UWidgetAnimation* Hover; // 0x238
	UWidgetAnimation* Fade; // 0x240
	UHorizontalBox* HB_Mode; // 0x248
	UImage* Image; // 0x250
	UImage* Image_111; // 0x258
	UTextBlock* MapModeField; // 0x260
	UTextBlock* MapNameField; // 0x268
	UImage* MapPreviewImage; // 0x270
	UButton* SelectMapButton; // 0x278
	FString map_DebugName; // 0x280
	UMapChangeMenu_V2_C* parentMenu; // 0x290
	FColor DeselectedColor; // 0x298
	FColor HighlightedColor; // 0x29c
	float DelayTimer; // 0x2a0
};

struct UInterpTrackVectorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UHLLUpgradeData : UDataAsset {
	int32_t UpgradeTime; // 0x30
	int32_t SuppliesCost; // 0x34
	FText UpgradeText; // 0x38
	FSlateBrush UpgradeIcon; // 0x50
	FName ActionScore; // 0xd8
	FName OwnerActionScore; // 0xe0
	float ScoreModifier; // 0xe8
	float OwnerScoreModifier; // 0xec
	int32_t MinContributionForScore; // 0xf0
	EHLLPlayerStat ContributorStatWhenApplied; // 0xf4
	EHLLPlayerStat OwnerStatWhenApplied; // 0xf5
	char bApplyToContributors : 1; // 0xf6
	char bApplyToStructureOwner : 1; // 0xf6
	EUpgradeScoringMethod OwnerScoringMethod; // 0xf7
	EHLLAchievementStat AchievementStat; // 0xf8
	uint32_t IncrementAmount; // 0xfc
	int32_t MinContributionForAchievement; // 0x100
	FTransform UpgradeEffectRelativeTransform; // 0x110
	USoundBase* UpgradeSound; // 0x140
	UParticleSystem* UpgradeParticle; // 0x148
};

struct UParticleModuleLocationPrimitiveTriangle : UParticleModuleLocationBase {
	FRawDistributionVector StartOffset; // 0x30
	FRawDistributionFloat Height; // 0x78
	FRawDistributionFloat Angle; // 0xa8
	FRawDistributionFloat Thickness; // 0xd8
};

struct AShooterGameMode : AGameMode {
	APawn* BotPawnClass; // 0x308
	APawn* AxisPlayerPawnClass; // 0x310
	APawn* AlliesPlayerPawnClass; // 0x318
	AHLLAdminCamera* AdminCameraClass; // 0x320
	int32_t WarmupTime; // 0x334
	int32_t RoundTime; // 0x338
	int32_t SectorCaptureTime; // 0x33c
	int32_t SectorCaptureProtectionTime; // 0x340
	int32_t DeathScore; // 0x34c
	int32_t MaxBots; // 0x350
	TArray<AShooterAIController*> BotControllers; // 0x358
	TSet<AController*> m_deployedPlayerControllers; // 0x3a8
	TArray<UPendingPlayerDeployment*> m_pendingDeployments; // 0x3f8
	TArray<AShooterPickup*> LevelPickups; // 0x408
	UHLL_AnalyticsServer* m_AnalyticsServer; // 0x428
	FScoreXPModifiers XP_ScoreModifiers; // 0x44c
	float MatchWinMultiplier; // 0x45c
	float MatchLossMultiplier; // 0x460
	int32_t XPPerMatchMinute; // 0x464
	float BonusMultiplierPerCommendation; // 0x468
	int32_t MinMatchTimeForXP; // 0x46c
	UDataTable* ActionScoreTable; // 0x470
	float GlobalScoreModifier; // 0x478
	FHLLRoleModifiers RoleModifiers[0xe]; // 0x47c
	int32_t FinaleTimer; // 0x4ec
	EMatchFinaleState FinaleState; // 0x4f0
	FDateTime TimeFinished; // 0x4f8
	int32_t FinaleTime_EndScreen; // 0x500
	int32_t FinaleTime_Commendations; // 0x504
	int32_t FinaleTime_ProgressionAndGroupPhoto; // 0x508
	float MaximumPunishTime; // 0x50c
	TArray<AHLLTurnBackVolume*> TurnBackAreas; // 0x510
};

struct UHLLResourceNodeIndicator : UHLLIndicatorBase {
	UTextBlock* GenerationText; // 0x2a8
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UAnimBlueprint : UBlueprint {
	USkeleton* TargetSkeleton; // 0xa8
	TArray<FAnimGroupInfo> Groups; // 0xb0
	bool bUseMultiThreadedAnimationUpdate; // 0xc0
	bool bWarnAboutBlueprintUsage; // 0xc1
};

struct AHLLRecoilTester : AActor {
	char NumBurstsToFire; // 0x220
	float LineDrawTime; // 0x224
	float HitDrawTime; // 0x228
	char ShotsPerBurst; // 0x22c
	TArray<FShotOffset> ShotOffsets; // 0x230
	FRecoilAndSpreadState RecoilState; // 0x240
	FRecoilAndSpread RecoilConfig; // 0x248
	UArrowComponent* BaseArrow; // 0x278
	UArrowComponent* AimArrow; // 0x280
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UWGT_GameMenu_V2_C : UHLLInGameMenu {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UbtnNav_V2_C* btn_FieldManual_2; // 0x268
	UbtnNav_V2_C* btn_LeaveServer; // 0x270
	UbtnNav_V2_C* btn_Options_2; // 0x278
	UbtnNav_V2_C* btn_Quit; // 0x280
	UbtnNav_V2_C* btn_Redeploy; // 0x288
	UButtonPromptsInfo_V2_C* ButtonPromptsInfo; // 0x290
	UOverlay* DevSpace; // 0x298
	UMapChangeMenu_V2_C* MapChangeMenu; // 0x2a0
	UMenuHeader_C* MenuHeader; // 0x2a8
	UPartyManagementList_C* PartyManagementList; // 0x2b0
	UWidgetSwitcher* PartySwitcher; // 0x2b8
	UHorizontalBox* QuitContainer; // 0x2c0
	UHorizontalBox* RedeployContainer; // 0x2c8
	UReportPlayerDialog_C* ReportPlayerDialog; // 0x2d0
	UTextBlock* SlashFieldManual; // 0x2d8
	UTextBlock* SlashLeaveServer; // 0x2e0
	UTextBlock* SlashOptions; // 0x2e8
	UTextBlock* SlashQuit; // 0x2f0
	UTextBlock* SlashRedeploy; // 0x2f8
	UVerticalBox* VB_Nav; // 0x300
	UW_Menu_HTP_V2_C* W_Menu_HTP; // 0x308
	FMulticastInlineDelegate BackDelegate; // 0x310
	int32_t PopupIndex; // 0x320
	bool bFocusReceived; // 0x324
	bool bPopupVisible; // 0x325
	TArray<UbtnNav_V2_C*> MenuButtons; // 0x328
	bool ReportDialogOpen; // 0x338
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxis; // 0x40
	FExpressionInput RotationAngle; // 0x54
	FExpressionInput PivotPoint; // 0x68
	FExpressionInput Position; // 0x7c
	float Period; // 0x90
};

struct UHLLSupplyComponent : UActorComponent {
	char bAutoRegisterSupplies : 1; // 0xb0
	FMulticastInlineDelegate OnSuppliesChanged; // 0xb8
	int32_t NumSupplies; // 0xc8
	float SupplyRange; // 0xcc
	uint16_t NumSuppliesRemaining; // 0xd0
	char bRegisteredSupplies : 1; // 0xd2
	FName SupplyUseScore; // 0xd4
	char bScaleScoreByAmount : 1; // 0xdc
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UObjectReferencer : UObject {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct UButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
	FMulticastInlineDelegate OnDoubleClicked; // 0x418
};

struct UMaterialExpressionSphereMask : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0xd8
	EARDepthAccuracy DepthAccuracy; // 0xd9
	bool bIsTemporallySmoothed; // 0xda
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe0
	UAnimSequence* AnimSequence; // 0x1b8
	UAnimSequenceBase* Animation; // 0x1c0
	float StartOffset; // 0x1c8
	float EndOffset; // 0x1cc
	float PlayRate; // 0x1d0
	char bReverse : 1; // 0x1d4
	FName SlotName; // 0x1d8
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UChatOverlay : UUserWidget {
	UChat* Chat; // 0x230
	UTextBlock* PromptText; // 0x238
	UTextBlock* AdminMessageText; // 0x240
	UScrollBox* AdminMessageScroller; // 0x248
	UWidgetAnimation* ToggleAdminMessage; // 0x250
	float ScrollSpeed; // 0x258
	float AdminMessage_InitialDelay; // 0x25c
	float AdminMessage_CompletionTime; // 0x260
	UButton* ConsumeClickButton; // 0x268
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct UShooterDamageType : UDamageType {
	UForceFeedbackEffect* HitForceFeedback; // 0x40
	UForceFeedbackEffect* KilledForceFeedback; // 0x48
	UCameraShake* HitCameraShake; // 0x50
	float HitCameraShakeScale; // 0x58
	float HeadshotDamageMultiplier; // 0x5c
	float LimbDamageMultiplier; // 0x60
	bool bInstantCritHeadshot; // 0x64
	bool bHeadshotsBypassCritical; // 0x65
	bool bAllowCriticalState; // 0x66
	float CriticalBypassDamageThreshold; // 0x68
	float CriticalBypassDamageDistance; // 0x6c
	char bApplyImpulse : 1; // 0x70
	float RagdollImpulse; // 0x74
	float RagdollUpKickImpulse; // 0x78
	float ImpulseFalloff; // 0x7c
	float PointDamageRadius; // 0x80
	char bEnableDismemberment : 1; // 0x84
	float MaxDistFromHitToDismember; // 0x88
	int32_t MaxBreaksPerHit; // 0x8c
	char bApplyVehicleImpulseOnPointDamage : 1; // 0x90
	EHLLArmourPenetration ArmourPenetration; // 0x91
	EHLLArmourPenetration RadialArmourPenetration; // 0x92
	EHLLArmourDamageType ArmourDamageType; // 0x93
	EHLLArmourDamageType RadialArmourDamageType; // 0x94
	float ArmourPassthroughTraceLength; // 0x98
	float InternalModulePenetrationDepth; // 0x9c
	char bBypassArmourDeflection_Impact : 1; // 0xa0
	char bBypassArmourDeflection_Radial : 1; // 0xa0
	char bForceCarryOverArmourDamage : 1; // 0xa0
	float SelfDamageScale; // 0xa4
	float FriendlyDamageScale; // 0xa8
	int64_t BypassFriendlyDamageScale; // 0xb0
	char bSuppressHelmetEject : 1; // 0xb8
	char bNotifyAnimationsPointDamage : 1; // 0xb8
	char bNotifyAnimationsRadialDamage : 1; // 0xb8
	char bBypassDamageFilters : 1; // 0xb8
	int64_t FriendlyDamageFilter; // 0xc0
	int64_t EnemyDamageFilter; // 0xc8
	EHLLDamageType DamageType; // 0xd0
	EHLLDamageOrigin DamageOrigin; // 0xd1
	float MinExecutionDamage; // 0xd4
	float PunishForTeamKill; // 0xd8
	float PunishForSelfKill; // 0xdc
	char bClearPendingPunishments : 1; // 0xe0
	char bRewardAllSeatsOccupants : 1; // 0xe0
	char bBypassSeatProtection : 1; // 0xe0
	char bHasSelfKillAchievement : 1; // 0xe0
	EHLLAchievement SelfKillAchievement; // 0xe1
	TSet<EHLLAchievementStat> EnemyKillStats; // 0xe8
	char bHasEnemyVehicleKillAchievement : 1; // 0x138
	EHLLAchievement VehicleKillAchievement; // 0x139
	TSet<EHLLAchievement> CustomAchievementImplementations; // 0x140
};

struct URangeSliderWithText_V2_C : UHLLUI_OptionSelection {
	FPointerToUberGraphFrame UberGraphFrame; // 0x240
	UImage* FocusEffect; // 0x248
	UTextBlock* Percentage; // 0x250
	USlider* Slider; // 0x258
	USizeBox* SliderSizeBox; // 0x260
	FMulticastInlineDelegate OnValueChanged; // 0x268
	FText Format; // 0x278
	float RangeMin; // 0x290
	float RangeMax; // 0x294
	int32_t MaxDecimalDigits; // 0x298
	float SliderWidthOverride; // 0x29c
	float DisplayedRangeMin; // 0x2a0
	float DisplayedRangeMax; // 0x2a4
	float LastValue; // 0x2a8
	float SliderStepSize; // 0x2ac
	bool bUseDiscreteValue; // 0x2b0
	float DiscreteValue; // 0x2b4
	FSliderStyle InitialSliderStyle; // 0x2b8
	FSliderStyle FocusedSliderStyle; // 0x5f8
	FSlateColor FocusedTextStyle; // 0x938
	FSlateColor InitialTextStyle; // 0x960
	SliderStepType StepType; // 0x988
	float CalculatedStepSize; // 0x98c
	bool 0-1Value; // 0x990
};

struct UHLLRichPresence : UGameInstanceSubsystem {
	float TimeBetweenPresenceUpdates; // 0x30
	FTimerHandle TH_Update; // 0x38
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct UHLLAdminCamPlayerEntry : UUserWidget {
	AShooterPlayerState* AssignedPlayer; // 0x230
	char bIsSelected : 1; // 0x238
	char bHiddenByFilter : 1; // 0x238
	UTextBlock* PlayerRole; // 0x240
	UTextBlock* PlayerLevel; // 0x248
	UTextBlock* PlayerName; // 0x250
	UTextBlock* PlayerId; // 0x258
	UHLLAdminCamUI* OwningUI; // 0x260
};

struct UMasterAudioSubmixCaptureProtocol : UMovieSceneAudioCaptureProtocolBase {
	FString Filename; // 0x58
};

struct UParticleModuleCollisionGPU : UParticleModuleCollisionBase {
	FRawDistributionFloat Resilience; // 0x30
	FRawDistributionFloat ResilienceScaleOverLife; // 0x60
	float Friction; // 0x90
	float RandomSpread; // 0x94
	float RandomDistribution; // 0x98
	float RadiusScale; // 0x9c
	float RadiusBias; // 0xa0
	EParticleCollisionResponse Response; // 0xa4
	EParticleCollisionMode CollisionMode; // 0xa5
};

struct UJoinSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UBPW_PlatoonManagementStack_KickRequest_V2_C : UPlatoonManagementStackKickRequest {
	FPointerToUberGraphFrame UberGraphFrame; // 0x290
	UbtnSimple_V2_C* Button_Cancel; // 0x298
	UbtnSimple_V2_C* Button_MakingRoomForFriend; // 0x2a0
	UbtnSimple_V2_C* Button_NotCommunicating; // 0x2a8
	UbtnSimple_V2_C* Button_NotWithOfficer; // 0x2b0
};

struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	FEnvTraceData ProjectionData; // 0x50
};

struct AReflectionCapture : AActor {
	UReflectionCaptureComponent* CaptureComponent; // 0x220
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x338
	float LightFalloffExponent; // 0x33c
	float SourceRadius; // 0x340
	float SoftSourceRadius; // 0x344
	float SourceLength; // 0x348
};

struct UNavigationGraphNodeComponent : USceneComponent {
	FNavGraphNode Node; // 0x1f0
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x208
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x210
};

struct UBPW_PlatoonManagementStack_Invite_V2_C : UPlatoonManagementStackInvite {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UWidgetAnimation* Pulse; // 0x278
	UUniformGridPanel* ButtonPanel; // 0x280
	UWGT_PlayerVoteButton_C* No; // 0x288
	UTextBlock* txt_VoteSubmit; // 0x290
	UWidgetSwitcher* WidgetSwitcher_1; // 0x298
	UWGT_PlayerVoteButton_C* Yes; // 0x2a0
};

struct UHLLSimpleHealthComponent : UActorComponent {
	float DamageThreshold; // 0xb0
	ESimpleDeathBehaviour DeathBehaviour; // 0xb4
	float PostDeathLifespan; // 0xb8
	FName EnemyScoreForKill; // 0xbc
	EHLLPlayerStat EnemyStatForKill; // 0xc4
	EHint EnemyHintForKill; // 0xc5
	char bDismantleBehaviourOverride : 1; // 0xc6
	ESimpleDeathBehaviour DismantleBehaviour; // 0xc7
	TArray<AController*> KillerInstigators; // 0xc8
	AShooterImpactEffect* DeathEffect; // 0xd8
	FTransform EffectRelativeTransform; // 0xe0
	AHLLVehicleWreck* WreckActor; // 0x110
	char bHandledDeath : 1; // 0x118
	UDamageType* ExplosionDamageType; // 0x120
	float ExplosionDamage; // 0x128
	float ExplosionRadius; // 0x12c
	float ExplosionSuppression; // 0x130
	float ExplosionSuppressionRadius; // 0x134
	FMulticastInlineDelegate OnKilled; // 0x138
	FRepHealthInfo HealthInfo; // 0x148
	ESimpleDeathNotify DeathNotifyBehaviour; // 0x150
	char bDismantleNotifyOverride : 1; // 0x151
	ESimpleDeathNotify DismantleNotifyBehaviour; // 0x152
};

struct AHLLCosmeticCharacterRenderer : AHLLCosmeticCharacter {
	UCineCameraComponent* ViewCamera; // 0x260
	UStaticMeshComponent* BackgroundMesh; // 0x268
};

struct UABP_MG34_FPP_V2_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FAnimNode_Root AnimGraphNode_Root; // 0x278
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2a8
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x3f8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x440
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x508
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x610
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x638
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x660
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x688
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6d8
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x750
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x780
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x7c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7f8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x870
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x8a0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x8e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x918
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9e8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xa08
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xac0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xb80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xba8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0xbd0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xc18
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xcd8
	FAnimNode_Slot AnimGraphNode_Slot; // 0xd20
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xd68
	float BulletScale; // 0xe70
	bool IsDeployed; // 0xe74
	bool IsUnfolded; // 0xe75
	bool IsBraced; // 0xe76
	bool IsEmpty; // 0xe77
	FRotator BipodRotation; // 0xe78
	float BipodResult; // 0xe84
	UABP_Rifleman_FPP_V2_C* FPPInstance; // 0xe88
	UABP_Rifleman_TPP_V2_C* TPPInstance; // 0xe90
	AShooterCharacter* ShooterCharacter; // 0xe98
	AShooterWeapon* ShooterWeapon; // 0xea0
	float TransitionSpeed; // 0xea8
	ECharacterStance Stance; // 0xeac
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UNavigationSystemModuleConfig : UNavigationSystemConfig {
	char bStrictlyStatic : 1; // 0x50
	char bCreateOnClient : 1; // 0x50
	char bAutoSpawnMissingNavData : 1; // 0x50
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x50
};

struct UPlayer : UObject {
	APlayerController* PlayerController; // 0x30
	int32_t CurrentNetSpeed; // 0x38
	int32_t ConfiguredInternetSpeed; // 0x3c
	int32_t ConfiguredLanSpeed; // 0x40
};

struct UIntSerialization : UObject {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	int8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct UVehicleExitLocationComponent : UCapsuleComponent {
	int32_t Priority; // 0x430
};

struct UWGT_BrowserSortButton_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UButton* RootButton; // 0x238
	USizeBox* RootSBox; // 0x240
	UImage* SortArrow; // 0x248
	UTextBlock* SortLabel; // 0x250
	EHLLUI_ServerSortMode SortType; // 0x258
	FMulticastInlineDelegate OnSort; // 0x260
	float Width; // 0x270
};

struct ATrench_ef01_Mound_C : AActor {
	UStaticMeshComponent* StaticMeshComponent7; // 0x220
	UStaticMeshComponent* StaticMeshComponent4; // 0x228
	UStaticMeshComponent* SM_WoodRubble_011; // 0x230
	UStaticMeshComponent* SM_TrenchPile03; // 0x238
	UStaticMeshComponent* SM_Crate05; // 0x240
	UStaticMeshComponent* SM_Crate04; // 0x248
	UStaticMeshComponent* SM_Crate03; // 0x250
	UStaticMeshComponent* SM_Crate02; // 0x258
	UStaticMeshComponent* SM_Crate01; // 0x260
	UStaticMeshComponent* SM_WoodRubble_03; // 0x268
	UStaticMeshComponent* SM_WoodRubble_06; // 0x270
	UStaticMeshComponent* SM_TrenchPile02; // 0x278
	UStaticMeshComponent* SM_TrenchPile01; // 0x280
	UStaticMeshComponent* StaticMeshComponent17; // 0x288
	UStaticMeshComponent* StaticMeshComponent15; // 0x290
	UStaticMeshComponent* StaticMeshComponent14; // 0x298
	UStaticMeshComponent* StaticMeshComponent9; // 0x2a0
	UStaticMeshComponent* StaticMeshComponent8; // 0x2a8
	UStaticMeshComponent* StaticMeshComponent6; // 0x2b0
	UStaticMeshComponent* StaticMeshComponent5; // 0x2b8
	UStaticMeshComponent* StaticMeshComponent3; // 0x2c0
	UStaticMeshComponent* StaticMeshComponent2; // 0x2c8
	UStaticMeshComponent* StaticMeshComponent0; // 0x2d0
	USceneComponent* SharedRoot; // 0x2d8
};

struct ASceneCapture2D : ASceneCapture {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x230
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UFont : UObject {
	EFontCacheType FontCacheType; // 0x30
	TArray<FFontCharacter> Characters; // 0x38
	TArray<UTexture2D*> Textures; // 0x48
	int32_t IsRemapped; // 0x58
	float EmScale; // 0x5c
	float Ascent; // 0x60
	float Descent; // 0x64
	float Leading; // 0x68
	int32_t Kerning; // 0x6c
	FFontImportOptionsData ImportOptions; // 0x70
	int32_t NumCharacters; // 0x120
	TArray<int32_t> MaxCharHeight; // 0x128
	float ScalingFactor; // 0x138
	int32_t LegacyFontSize; // 0x13c
	FName LegacyFontName; // 0x140
	FCompositeFont CompositeFont; // 0x148
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xe0
	FMovieSceneFloatChannel Translation[0x2]; // 0xe8
	FMovieSceneFloatChannel Rotation; // 0x228
	FMovieSceneFloatChannel Scale[0x2]; // 0x2c8
	FMovieSceneFloatChannel Shear[0x2]; // 0x408
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UParticleModuleEventReceiverBase : UParticleModuleEventBase {
	EParticleEventType EventGeneratorType; // 0x30
	FName EventName; // 0x34
};

struct UMaterialExpressionLandscapeLayerWeight : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Layer; // 0x54
	FName ParameterName; // 0x68
	float PreviewWeight; // 0x70
	FVector ConstBase; // 0x74
	FGuid ExpressionGUID; // 0x80
};

struct UHLLRadialMenu_ChildBase : UUserWidget {
	TWeakObjectPtr<UHLLRadialMenu_Base> OwningRadialMenu; // 0x230
};

struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	char bPositionCorrected : 1; // 0x148
};

struct UbtnNav_V2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UButton* btn_Nav; // 0x238
	UTextBlock* txt_btn_Label; // 0x240
	FText Label; // 0x248
	FSlateFontInfo Font; // 0x260
	bool bUseEnabledColouring; // 0x2b0
	FMulticastInlineDelegate OnClick; // 0x2b8
	bool bSelected; // 0x2c8
	bool bAllCaps; // 0x2c9
	bool bFocus; // 0x2ca
	FButtonStyle InitialButtonStyle; // 0x2d0
	FButtonStyle FocusedButtonStyle; // 0x548
	UTextBlock* ButtonDescriptionTextWidget; // 0x7c0
	FText ButtonDescriptionText; // 0x7c8
	FMulticastInlineDelegate UpdateDescriptionText; // 0x7e0
	FMulticastInlineDelegate OnHover; // 0x7f0
	FMulticastInlineDelegate OnUnhover; // 0x800
