namespace off {
	constexpr auto GNames = 0x5e51500;
	constexpr auto GObjects = 0x5e68df0;
	constexpr auto GWorld = 0x5f50610;
}
struct UMaterialExpressionShadingPathSwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct UMM_OptionNum {
	UImage* Img_Icon; // 0x2f0
	UTextBlock* Txt_OptionName; // 0x2f8
	UTextBlock* Txt_OptionNum; // 0x300
};

struct UDialogueCameraData {
	TArray<FActorPlacement> CameraDataArray; // 0x30
};

struct UMM_Ranking_Reward_Popup {
	UMirButton* m_pBtnClose; // 0x2f0
	UMM_Common_Btn_Symbol* m_pBtnXClose; // 0x2f8
	UMirCheckBox* m_pCheckBoxDaily; // 0x300
	UMirCheckBox* m_pCheckBoxWeekly; // 0x308
	UMirCheckBox* m_pCheckBoxSeason; // 0x310
	UMirButton* m_pBtnSeason; // 0x318
	UMirCheckBox* m_pCheckBoxDailyTwoTab; // 0x320
	UMirCheckBox* m_pCheckBoxWeeklyTwoTab; // 0x328
	UCanvasPanel* m_pCanCheckBox; // 0x330
	UCanvasPanel* m_pCanCheckBoxTwoTab; // 0x338
	UMirScrollBox* m_pScrollList; // 0x340
	UMirTextBlock* m_pTxtDaily; // 0x348
	UMirTextBlock* m_pTxtWeekly; // 0x350
	UMirTextBlock* m_pTxtSeason; // 0x358
	UMirTextBlock* m_pTxtDailyTwoTab; // 0x360
	UMirTextBlock* m_pTxtWeeklyTwoTab; // 0x368
	UCanvasPanel* m_pCanRewardInfo; // 0x370
	UCanvasPanel* m_pCanRewardDetailPanel01; // 0x378
	UCanvasPanel* m_pCanRewardDetailPanel02; // 0x380
	UCanvasPanel* m_pCanRewardDetailPanel03; // 0x388
	UCanvasPanel* m_pCanRewardDetailPanel04; // 0x390
	UMM_Ranking_Reward_Item* m_pRewardDetailItem1; // 0x398
	UMM_Ranking_Reward_Item* m_pRewardDetailItem2; // 0x3a0
	UMM_Ranking_Reward_Item* m_pRewardDetailItem3; // 0x3a8
	UMM_Ranking_Reward_Item* m_pRewardDetailItem4; // 0x3b0
	UMirTextBlock* m_pTxtRewardDetail1; // 0x3b8
	UMirTextBlock* m_pTxtRewardDetail2; // 0x3c0
	UMirTextBlock* m_pTxtRewardDetail3; // 0x3c8
	UMirTextBlock* m_pTxtRewardDetail4; // 0x3d0
	UMirButton* m_pBtnRewardDetailClose; // 0x3d8
	TArray<UCanvasPanel*> m_RewardDetailPanelList; // 0x3e0
	TArray<UMM_Ranking_Reward_Item*> m_RewardDetailItemList; // 0x3f0
	TArray<UMirTextBlock*> m_RewardDetailDescList; // 0x400
};

struct UPopup_WorldBossFailRewardInfo {
	UHorizontalBox* HorizontalBox_reward02; // 0x2e0
	UHorizontalBox* HorizontalBox_4; // 0x2e8
	UMirTextBlock* txtFixedRewardNotice; // 0x2f0
	UMirTextBlock* txtRewardTitle; // 0x2f8
	UMirTextBlock* txtFailReason; // 0x300
	UMM_Slot_Material* slotReward[0x7]; // 0x308
};

struct UMovieSceneVectorSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe0
	int32_t ChannelsUsed; // 0x360
};

struct APlayerStartPIE {
	FName PlayerStartTag; // 0x240
};

struct UMM_Occupation_Rank_List {
	UMM_Slot_Rank* Slot_Rank; // 0x2e0
	UMirImage* Img_Background_Other; // 0x2e8
	UMirImage* Img_Background_Mine; // 0x2f0
	UMirImage* Img_GuildMark; // 0x2f8
	UMirImage* Img_GuildMarkEdge; // 0x300
	UMirImage* Img_Grade; // 0x308
	UMirTextBlock* Txt_Camp; // 0x310
	UMirTextBlock* Txt_GuildName; // 0x318
	UMirTextBlock* Txt_UserName; // 0x320
	UMirTextBlock* Txt_KillScore; // 0x328
	UMirTextBlock* Txt_OccupationScore; // 0x330
	UMirTextBlock* Txt_DestroyScore; // 0x338
};

struct UBaseMediaSource {
	FName PlayerName; // 0x80
};

struct USlateAccessibleWidgetData {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	DelegateProperty AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	DelegateProperty AccessibleSummaryTextDelegate; // 0x70
};

struct UMM_PetStatSlot {
	UMirTextBlock* m_Txt_StatType; // 0x2e0
	UMirTextBlock* m_Txt_StatValue; // 0x2e8
};

struct UInterpTrackEvent {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct USoundNodeBranch {
	FName BoolParameterName; // 0x40
};

struct USoundNodeSwitch {
	FName IntParameterName; // 0x40
};

struct UMM_Popup_GuildOtherMembers {
	UMirScrollBox* sb_member; // 0x2f0
	UMM_Common_Board_Notice* bn_empty; // 0x2f8
	UMM_Common_Btn* btn_confirm; // 0x300
	UMM_Common_Btn_Symbol* btn_close; // 0x308
	UMirTextBlock* Txt_Title; // 0x310
};

struct UMM_Popup_SquareStageList_Slot {
	UMirTextBlock* txtRoomNum; // 0x2e0
	UMirTextBlock* txtRoomName; // 0x2e8
	UMirTextBlock* txtProbability; // 0x2f0
	UMirTextBlock* txtPercent; // 0x2f8
	UButton* m_pBtn_Info; // 0x300
};

struct UMM_CustomTitleSetting {
	int32_t STRING_TITLE; // 0x2e0
	int32_t STRING_GUIDE_NEW; // 0x2e4
	int32_t STRING_GUIDE_PERIOD; // 0x2e8
	int32_t STRING_GUIDE_MESSAGE_RESET; // 0x2ec
	int32_t STRING_REMAIN_DAY; // 0x2f0
	int32_t STRING_REMAIN_HOUR; // 0x2f4
	int32_t STRING_REMAIN_SOON; // 0x2f8
	int32_t STRING_DEL_TITLE; // 0x2fc
	int32_t STRING_BUTTON_CANCEL; // 0x300
	int32_t STRING_BUTTON_OK; // 0x304
	int32_t STRING_ERROR_EMPTY_MATERIAL; // 0x308
	int32_t STRING_ERROR_RULE_VIOLATION_2; // 0x30c
	int32_t STRING_ERROR_RULE_VIOLATION_3; // 0x310
	int32_t STRING_ERROR_RULE_VIOLATION_4; // 0x314
	UMirTextBlock* Txt_Title; // 0x318
	UMirTextBlock* Txt_GuideMsg1; // 0x320
	UMirTextBlock* Txt_GuideMsg2; // 0x328
	UPanelWidget* Pan_Remain; // 0x330
	UMirTextBlock* Txt_RemainDay; // 0x338
	UMirTextBlock* Txt_RemainDay_Del; // 0x340
	UMirEditableText* EditTxt_CustomTitle; // 0x348
	UMM_Slot_Material* Slot_Material; // 0x350
	UMirCanvasPanel* Pan_Edit; // 0x358
	UMM_Common_Btn* Btn_Cancel_Edit; // 0x360
	UMM_Common_Btn_Cost* Btn_Ok_Edit; // 0x368
	UMirCanvasPanel* Pan_Del; // 0x370
	UMM_Common_Btn* Btn_Cancel_Del; // 0x378
	UMM_Common_Btn* Btn_Ok_Del; // 0x380
	UMM_Common_Btn_Symbol* m_CloseBtn; // 0x388
	FString m_CustomTitle; // 0x390
};

struct UBTTask_PlaySound {
	USoundCue* SoundToPlay; // 0x70
};

struct UMM_Customizing_Costume_Palette {
	TArray<UMM_Customizing_PaletteItem*> m_PaletteItemArray; // 0x300
	UWrapBox* m_pColorListBox; // 0x310
	UMM_Customizing_PaletteItem* m_MainColor; // 0x318
	UMM_Customizing_PaletteItem* m_SubColor; // 0x320
	UMM_Common_Btn_IconText* m_pBtnRandomColor; // 0x328
	UMM_Common_Btn_IconText* m_pBtnPresetPopup; // 0x330
};

struct UMM_Auction_Slot_Result {
	UMM_Slot_Inventory* m_pSlotItem; // 0x348
	UMirTextBlock* m_pTxtName; // 0x350
	UMirTextBlock* m_pTxtSellPrice; // 0x358
	UMirTextBlock* m_pTxtRealSellPrice; // 0x360
	UMirRichTextBlock* m_pTxtRemainTime; // 0x368
	UMM_Common_Btn* m_pBtnCancle; // 0x370
};

struct UMM_Popup_NPCShopBuyCount {
	UMM_Slot_Material* mat_slot; // 0x2e0
	UMirTextBlock* Txt_Title; // 0x2e8
	UMirTextBlock* txt_item_name; // 0x2f0
	UMirTextBlock* txt_item_count; // 0x2f8
	UMM_Item_Make_Slider* make_slider; // 0x300
	UMM_Common_Btn* btn_cancle; // 0x308
	UMM_Common_Btn_Cost* btn_bye; // 0x310
	UMM_Common_Btn_Symbol* btn_close; // 0x318
	UMirCanvasPanel* m_pNoticePanel; // 0x320
	UMirRichTextBlock* Txt_Notice; // 0x328
	int32_t STR_SELECT_COUNT; // 0x330
};

struct UMM_CharAbility_Info_Guild {
	UMirTextBlock* m_MirTextBlock_GuildName; // 0x2f0
	UMirTextBlock* m_MirTextBlock_GuildGrade; // 0x2f8
	UMirTextBlock* m_MirTextBlock_Custom; // 0x300
	UMirTextBlock* m_MirTextBlock_GuildNo; // 0x308
	UVerticalBox* m_GuildInfo; // 0x310
	UMirImage* m_Img_GuildMark; // 0x318
	UMirImage* m_Img_GuildMark_Frame; // 0x320
	UCanvasPanel* m_CanvasPanel_BtnOtherGuild; // 0x328
	UMirButton* m_Btn_GoOtherGuild; // 0x330
	UMM_Common_Btn_Symbol* m_Btn_SaveClipBoard; // 0x338
};

struct UMM_CommonVerticalTabSet {
	int32_t m_iFontSize; // 0x2f0
	bool m_bUseBg; // 0x2f4
	bool m_bHideInsteadOfLock; // 0x2f5
	UMirScrollBox* m_Scr_Main; // 0x328
	TArray<UMM_CommonVerticalTabBtn*> m_arTab; // 0x330
	UEffectWidgetBase* m_SelectedEffect; // 0x340
};

struct UBTTask_ExecuteSkill {
	FString Desc; // 0x78
};

struct UMM_Popup_CollectComplete {
	UMirButton* m_Btn_Bg; // 0x2e0
	UPanelWidget* m_Panel_Effect; // 0x2e8
	UMirTextBlock* m_Txt_Title; // 0x2f0
	UMirTextBlock* m_Txt_Info; // 0x2f8
	UMirImage* m_Img_Effect; // 0x300
	UMirTextBlock* m_Txt_Effect; // 0x308
	UWidgetAnimation* m_OpenAni; // 0x310
	int32_t m_TitleStrID; // 0x318
	int32_t m_CloseStrID; // 0x31c
};

struct UAISense_Damage {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x80
};

struct APostProcessVolume {
	FPostProcessSettings Settings; // 0x260
	float Priority; // 0x790
	float BlendRadius; // 0x794
	float BlendWeight; // 0x798
	char bEnabled : 1; // 0x79c
	char bUnbound : 1; // 0x79c
};

struct UAISense_Prediction {
	TArray<FAIPredictionEvent> RegisteredEvents; // 0x80
};

struct ULandscapeGrassType {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct UMaterialExpressionDeltaTime {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UMovieSceneFolder {
	FName FolderName; // 0x28
	TArray<UMovieSceneFolder*> ChildFolders; // 0x30
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x40
	TArray<FString> ChildObjectBindingStrings; // 0x50
};

struct UMM_Popup_Occupation_Auction {
	UMM_Occupation_BidHistory* BidHistory_01; // 0x2e0
	UMM_Occupation_BidHistory* BidHistory_02; // 0x2e8
	UMirTextBlock* Txt_Title; // 0x2f0
	UMirTextBlock* Txt_MinimumBidAmount; // 0x2f8
	UMirTextBlock* Txt_BidAmount; // 0x300
	UMirTextBlock* Txt_GuildHoldinAmount; // 0x308
	UMirTextBlock* Txt_RemainTime; // 0x310
	UMirTextBlock* Txt_Description; // 0x318
	UMM_Common_Btn* btn_refresh; // 0x320
	UMM_Common_Btn* Btn_Bid; // 0x328
	UMM_Common_Btn_Symbol* Btn_Left_Amount; // 0x330
	UMM_Common_Btn_Symbol* Btn_Right_Amount; // 0x338
	UMM_Common_Btn_Symbol* btn_close; // 0x340
	UMirImage* Img_Guild_Coin1; // 0x348
	UMirImage* Img_Guild_Coin2; // 0x350
	UMirButton* Btn_OpenNumPad; // 0x358
};

struct USourceEffectFilterPreset {
	FSourceEffectFilterSettings Settings; // 0x74
};

struct UParticleEffectNotify {
	bool m_bUseMainPC; // 0x50
	bool UseElement; // 0x51
	EParticleEffectElementType TestElementType; // 0x52
	bool m_bUseColor; // 0x53
	FLinearColor m_bEnemyColor; // 0x54
	UParticleSystem* PSTemplate; // 0x68
	AActor* SkeletalEffect; // 0x70
	UAnimationAsset* SkeletalEffecthAnimation; // 0x78
	FVector LocationOffset; // 0x80
	FRotator RotationOffset; // 0x8c
	FVector Scale; // 0x98
	bool Attached; // 0xa4
	bool m_bUseSkelVert; // 0xa5
	FName SocketName; // 0xa8
	FVector ParamSize; // 0xb0
};

struct UMM_CharAbility_Info_Rating {
	UMM_Common_Btn_Symbol* m_Btn_CustomTitle; // 0x300
	UHorizontalBox* m_Grid_CustomTitle; // 0x308
	UMirTextBlock* m_MirTextBlock_NickTitle; // 0x310
	UMirTextBlock* m_MirTextBlock_Nick; // 0x318
	UMirTextBlock* m_MirTextBlock_CombatTitle; // 0x320
	UMirTextBlock* m_MirTextBlock_Attck; // 0x328
	UMirTextBlock* m_MirTextBlock_TendGradeTitle; // 0x330
	UMirTextBlock* m_MirTextBlock_TendGrade; // 0x338
	UMirTextBlock* m_MirTextBlock_TendGradeValue; // 0x340
	UMM_Common_Btn_Symbol* m_Btn_TitleEdit; // 0x348
	UMM_Common_Btn_Symbol* m_Btn_TitleDel; // 0x350
};

struct UFacebookQueryUserInfo {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFail; // 0x40
};

struct UMM_New_Force_Ability_Slot {
	UMirImage* m_C_Img_Ability; // 0x2f8
	UMirTextBlock* m_C_Txt_AbilityName; // 0x300
	UMirTextBlock* m_C_Txt_AbilityLevel; // 0x308
	UMirTextBlock* m_C_Txt_AbilityValue; // 0x310
	UMirImage* m_C_Img_Selected; // 0x318
	UMirTextBlock* m_Txt_BloodName; // 0x320
	UPanelWidget* m_Grid_Ability; // 0x328
	UMirTextBlock* m_Txt_NextAbility; // 0x330
	UMirTextBlock* m_Txt_PenaltyAbility; // 0x338
	UMirButton* m_C_Btn_Main; // 0x340
	UPanelWidget* m_Grid_Effect; // 0x348
	UMirImage* m_C_Img_Indicator; // 0x350
};

struct UAISense_Sight {
	int32_t MaxTracesPerTick; // 0x130
	int32_t MinQueriesPerTimeSliceCheck; // 0x134
	double MaxTimeSlicePerTick; // 0x138
	float HighImportanceQueryDistanceThreshold; // 0x140
	float MaxQueryImportance; // 0x148
	float SightLimitQueryImportance; // 0x14c
};

struct UMM_B_Dominion {
	UMM_CommonHorizontalTabSet* m_pTabDominion; // 0x300
	UWidgetSwitcher* m_pSwitchDominion; // 0x308
	UMM_Dominion_Castle* m_pDominionCastle; // 0x310
	UMM_Dominion_Base* m_pDominionBase; // 0x318
};

struct UMM_TutorialStart {
	UMirTextBlock* m_pTitleText; // 0x2e0
	UMM_Common_Btn* m_pSkipButton; // 0x2e8
	UMM_Common_Btn* m_pConfirmButton; // 0x2f0
};

struct UAnimCustomInstance {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FScriptMulticastDelegate OnMontageBlendingOut; // 0x38
	FScriptMulticastDelegate OnMontageStarted; // 0x48
	FScriptMulticastDelegate OnMontageEnded; // 0x58
	FScriptMulticastDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct UMM_B_MysticalPiece {
	UImage* m_RenderTargetImage; // 0x2f0
	UImage* m_TargetPos; // 0x2f8
	UMM_CombatPoint* m_CombatPoint; // 0x300
	UMirButton* m_Btn_SelectDeck; // 0x308
	UMM_MysticalPieceQuickTab* m_DeckTab; // 0x310
	UMirTextBlock* m_Txt_SelectDeckIndex; // 0x318
	UMirTextBlock* m_Txt_SelectDeck; // 0x320
	UCanvasPanel* m_Can_GoToTranscend; // 0x328
	UMirImage* m_Img_Transcend; // 0x330
	UMirButton* m_Btn_GoToTranscend; // 0x338
	UMirTextBlock* m_Txt_Transcend; // 0x340
	TArray<UMirCanvasPanel*> m_Can_EquipSlots; // 0x348
	TArray<UMirImage*> m_Img_EquipBGs; // 0x358
	TArray<UMM_MysticalPieceSlot*> m_EquipSlots; // 0x368
	UOverlay* m_Overlay_Stats; // 0x378
	UMirTextBlock* m_Txt_ItemName; // 0x380
	UMM_Slot_Inventory* m_Slot_MysticalPiece; // 0x388
	UMirRichTextBlock* m_Rtxt_DescTitle; // 0x390
	UMirRichTextBlock* m_Rtxt_Desc; // 0x398
	UMM_Mystical_ItemInfo_Ability* m_ItemInfo_Passive; // 0x3a0
	TArray<UMM_Mystical_ItemInfo_Ability*> m_ItemInfo_Abilitys; // 0x3a8
	UMM_Inventory_MysticalPiece* m_Inven_MysticalPiece; // 0x3b8
	UMM_Common_Btn_Symbol* m_Btn_DetailInfos; // 0x3c0
	UMM_Popup_MysticalPieces_Infos* m_Popup_Attribute; // 0x3c8
	UMirButton* m_Btn_ItemInfoBack; // 0x3d0
	UWidgetAnimation* m_DecShow; // 0x3e0
	UWidgetAnimation* m_DecHide; // 0x3e8
	UWidgetAnimation* m_SlotOpen; // 0x3f0
	UWidgetAnimation* m_InvenOpen; // 0x3f8
};

struct UMM_CustomizingScreenShot {
	AMM_PhotoModeCharacter* m_pPhotoModeCharacter; // 0x2e0
	UPhotoModeData* m_pPhotoModeData; // 0x2e8
	AMM_CharacterCustomizingActor* pCustomizingActor; // 0x2f0
	AMM_CustomizingLevelActor* pCustomizingLevelActor; // 0x2f8
	TMap<EPhotoModeOptionType, FPhotoMode_Option> m_mapOption; // 0x3c0
};

struct UMM_GameViewportClient {
	AActor* m_pSignificanceTarget; // 0x2f0
	UCurveFloat* m_FadeInCurve; // 0x2f8
	UCurveFloat* m_FadeOutCurve; // 0x300
	UCurveFloat* m_CurFadeCurve; // 0x308
};

struct UMM_Slot_Simple_Jewel {
	UMirImage* Img_JewelLock; // 0x3e8
};

struct USteamLogin {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFail; // 0x40
};

struct UMM_B_NewGuild {
	UMM_CommonHorizontalTabSet* m_CT_HrzTabSet; // 0x308
	UMM_Guild_MainHome* m_Guild_MainHome; // 0x310
	UMM_GuildMembers* guild_member; // 0x318
	UMM_GuildOption* guild_option; // 0x320
};

struct UMM_Party_Member_Slot {
	UMirCanvasPanel* m_Canvas_User; // 0x2f0
	UMirImage* m_Img_Icn_Leader; // 0x2f8
	UMirImage* m_Img_Icn_Class; // 0x300
	UMirTextBlock* m_Txt_Level; // 0x308
	UMirTextBlock* m_Txt_Nickname; // 0x310
	UMirTextBlock* m_Txt_CombatPoint; // 0x318
	UMirCanvasPanel* m_Canvas_Menu; // 0x320
	UPanelWidget* m_Grid_Kick; // 0x328
	UPanelWidget* m_Grid_Detail; // 0x330
	UPanelWidget* m_Grid_ChangeLeader; // 0x338
	UMM_Common_Btn_Symbol* m_C_Btn_ChangeLeader; // 0x340
	UMM_Common_Btn_Symbol* m_C_Btn_Kick; // 0x348
	UMM_Common_Btn_Symbol* m_C_Btn_Detail; // 0x350
	UMirCanvasPanel* m_Can_Mine; // 0x358
	UMirTextBlock* m_Txt_UserStage; // 0x360
	UMirTextBlock* m_Txt_ChangeLeader; // 0x368
	UMirCanvasPanel* m_Canvas_Slot; // 0x370
	UMirImage* m_Img_Bg_Lock; // 0x378
	UMirImage* m_Img_Bg_Unlock; // 0x380
	UMirImage* m_Img_All; // 0x388
	UMirImage* m_Img_Lock; // 0x390
	UMirImage* m_Img_Able_Class; // 0x398
	UMirTextBlock* m_Txt_Able_Class; // 0x3a0
	UMirButton* m_Btn_Option; // 0x3a8
	UMirButton* m_Btn_Invite; // 0x3b0
	UMirButton* m_Btn_Main; // 0x3b8
};

struct UDistributionFloat {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct ADecalActor {
	UDecalComponent* Decal; // 0x218
};

struct UParticleModuleLocationPrimitiveBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x68
};

struct UNavigationSystemModuleConfig {
	char bStrictlyStatic : 1; // 0x50
	char bCreateOnClient : 1; // 0x50
	char bAutoSpawnMissingNavData : 1; // 0x50
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x50
};

struct UMovieSceneEulerTransformTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UInterpTrackVectorMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct UVerticalBoxSlot {
	FSlateChildSize Size; // 0x38
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UCheckBoxWidgetStyle {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct USubmixEffectFlexiverbPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0x78
};

struct UMM_PopupPartyPWKeypad {
	UMM_Common_Btn* btn_back; // 0x2e0
	UMirTextBlock* txt_number; // 0x2e8
	UMM_Common_Btn_Symbol* btn_close; // 0x2f0
	UMM_Common_Btn* Btn_Cancel; // 0x2f8
	UMM_Common_Btn* btn_confirm; // 0x300
	UMirButton* lst_btn_number[0xa]; // 0x308
	UMirButton* btn_reset; // 0x358
	UMirButton* btn_remove; // 0x360
};

struct UMaterialExpressionMapARPassthroughCameraUV {
	FExpressionInput Coordinates; // 0x40
};

struct UMM_Popup_XsollaIAP {
	UMirWebBrowser* m_WebBrowser; // 0x2e0
	UMirButton* m_Btn_Close; // 0x2e8
	FTimerHandle DelayCloseTimeHandle; // 0x2f0
};

struct UMovieSceneSlomoSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe0
};

struct UMM_HudAutoBattle_Element {
	TMap<EAutoBattleState, FBrushObject> AuotBattleStateIcon; // 0x2f0
	UMirButton* ElementButton; // 0x340
	UMirImage* IconImage; // 0x348
};

struct UBTNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UMM_Hud_Chat_Popup {
	UWidgetAnimation* m_AniStart; // 0x300
	UWidgetAnimation* m_AniEnd; // 0x308
	UPanelWidget* Panel_Main; // 0x310
	UPanelWidget* Panel_LeftMenu; // 0x318
	UMM_Hud_Chat_Indicator* Chat_TotalIndicator; // 0x320
	UWidgetSwitcher* m_ContentWidgetSwitcher; // 0x328
	UWidgetSwitcher* m_ChatAreaPopupSwitcher; // 0x330
	UMM_Hud_Chat_ChattingRoom* m_ChattingRoom; // 0x338
	UMM_Hud_Chat_SearchWhisper* m_SearchWhisper; // 0x340
	UMM_Hud_Chat_EmptyGuild* m_EmptyGuild; // 0x348
	UMM_Popup_Chat_Macro* m_PopupMacro; // 0x350
	UMM_Popup_Chat_VoiceOption* m_PopupVoiceOption; // 0x358
	UMM_Popup_Chat_UserInfo* m_PopupUserInteraction; // 0x360
	UMM_Common_Btn_Symbol* m_CloseButton; // 0x368
	UMirCheckBox* Toggle_Setting; // 0x370
	UMirCheckBox* Toggle_WhisperChat; // 0x378
	UMirCheckBox* Toggle_Menu; // 0x380
	UMM_Hud_Chat_Area* m_ChatArea; // 0x388
	UMirListView* m_ListView_ChannelList; // 0x390
	TArray<UHudChatTabSlotObj*> m_arChannelSlotObj; // 0x398
	UMM_Common_Btn_Symbol* m_StageInfoButton; // 0x3a8
};

struct UWidgetAnimation {
	UMovieScene* MovieScene; // 0x348
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x350
	bool bLegacyFinishOnStop; // 0x360
	FString DisplayLabel; // 0x368
};

struct AMiniMapNaviDataExporter {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct UMM_PopUp_Costume_Palette {
	UWidgetAnimation* m_AniStart; // 0x300
	UWidgetAnimation* m_AniEnd; // 0x308
	UMM_Customizing_PaletteItem* Palette_Main; // 0x310
	UMM_Customizing_PaletteItem* Palette_Sub; // 0x318
	UVerticalBox* Grid_Main; // 0x320
	UVerticalBox* Grid_Sub; // 0x328
	UMM_Common_Btn_IconText* Btn_Random; // 0x330
	UMM_Common_Btn_IconText* Btn_Go_Preset; // 0x338
	UMM_Common_Btn* Btn_Cancel; // 0x340
	UMM_Common_Btn_Cost* Btn_Cost; // 0x348
	UCanvasPanel* Panel_Summary; // 0x350
	UMirCanvasPanel* Panel_Color; // 0x358
	UMM_Common_Btn_Symbol* Btn_PaletteClose; // 0x360
	UMirTextBlock* Txt_Title; // 0x368
	UMirTextBlock* Txt_PaletteTitle; // 0x370
	TArray<UMM_Slot_Costume_Palette*> PaletteSlotList; // 0x378
	TArray<UMM_Slot_Costume_Palette*> PaletteSlotList_Direct_CH1; // 0x388
	TArray<UMM_Slot_Costume_Palette*> PaletteSlotList_Direct_CH2; // 0x398
	UMM_Common_Btn_Symbol* btn_close; // 0x3a8
	UMirWrapScrollBox* Scroll_WrapBox_Preset; // 0x3b0
	UMirWrapScrollBox* Scroll_WrapBox_Direct_Main; // 0x3b8
	UMirWrapScrollBox* Scroll_WrapBox_Direct_Sub; // 0x3c0
	UMM_Costume_SlideBar* SlideBar_Main; // 0x3c8
	UMM_Costume_SlideBar* SlideBar_Sub; // 0x3d0
	int32_t SelectCostumeID; // 0x3d8
	bool DirtyFlag; // 0x3dc
	bool WarrnigUseID; // 0x3dd
	int32_t ItemUseId; // 0x3e0
	int32_t m_MaxSlotCount; // 0x3e4
	int32_t m_CurrentSlotCount; // 0x3e8
	int32_t Select_PaletteNumber_CH1; // 0x3ec
	int32_t Select_PaletteNumber_CH2; // 0x3f0
	int32_t m_MaxSlotCount_Direct_CH1; // 0x3f4
	int32_t m_CurrentSlotCount_Direct_CH1; // 0x3f8
	int32_t m_MaxSlotCount_Direct_CH2; // 0x3fc
	int32_t m_CurrentSlotCount_Direct_CH2; // 0x400
	int32_t STRING_BTN_PURCHASE; // 0x404
	int32_t STRING_TITLE_PALETTE; // 0x408
	int32_t STRING_TITLE_PRESET; // 0x40c
	int32_t STRING_MAIN_COLOR; // 0x410
	int32_t STRING_SUB_COLOR; // 0x414
};

struct UMM_Guild_DevItemSlot {
	UMirImage* mImgIcon; // 0x2f0
	UMirImage* mImgLock; // 0x2f8
	UMirTextBlock* mTxtCount; // 0x300
	UMirTextBlock* mTxtFixedSuccess; // 0x308
	UMirTextBlock* mTxtLockLevel; // 0x310
	UMirButton* mBtnGotoGuildDev; // 0x318
};

struct UTextureRenderTarget {
	float TargetGamma; // 0xd0
};

struct UMM_Popup_ClosedTraining_Ability {
	UMirTextBlock* m_Txt_Title; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e8
	UVerticalBox* m_VBox_1; // 0x2f0
	UVerticalBox* m_VBox_2; // 0x2f8
};

struct AMM_TotemObject {
	UMM_ExecuteDecalComponent* ExecuteDecalComponent; // 0x400
};

struct UMM_WemixWebBrowser {
	FString m_WemixAuth; // 0x2e0
	FString DracoContractAddress; // 0x370
	FString CharacterContractAddress; // 0x380
	FString BaseItemURI; // 0x390
	UPanelWidget* m_Panel_Main; // 0x3a0
	UMirWebBrowser* m_Web_Main; // 0x3a8
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x3b0
};

struct UCheatManager {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct UDecalComponent {
	UMaterialInterface* DecalMaterial; // 0x220
	int32_t SortOrder; // 0x228
	float FadeScreenSize; // 0x22c
	float FadeStartDelay; // 0x230
	float FadeDuration; // 0x234
	float FadeInDuration; // 0x238
	float FadeInStartDelay; // 0x23c
	char bDestroyOwnerAfterFade : 1; // 0x240
	FVector DecalSize; // 0x244
};

struct UMaterialExpressionNormalize {
	FExpressionInput VectorInput; // 0x40
};

struct AImmediatelyKillTrigger {
	FVector m_BoxExtent; // 0x218
	FColor m_BoxColor; // 0x224
};

struct UTimelineComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UMirScrollBox {
	EStyle_MirScrollBox m_eStyle; // 0x880
};

struct UMM_ServerRelocationGroup_Global {
	UMirTextBlock* m_Txt_ServerGroup; // 0x2e0
	UMirButton* m_Btn_Fold; // 0x2e8
	UMirCheckBox* m_CheckBox_Flod; // 0x2f0
	UWrapBox* m_Wrap_ServerList; // 0x2f8
};

struct AScriptMonsterKillCountTrigger {
	TArray<int32_t> m_MonsterIDArray; // 0x298
	TArray<int32_t> m_MonsterOrderIDArray; // 0x2a8
};

struct UMM_Auction_Slot_Material {
	UMM_Slot_Inventory* m_pSlotItem; // 0x340
	UMirTextBlock* m_pTxtName; // 0x348
	UMirTextBlock* m_pTxtEachPrice; // 0x350
	UMirTextBlock* m_pTxtTotalPrice; // 0x358
	UMirTextBlock* m_pTxtRemainTime; // 0x360
	UMirButton* m_pBtnItem; // 0x368
	UMirButton* m_pBtnClick; // 0x370
};

struct UUserDefinedEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct UMM_Customizing_Picker_DetailBar {
	UMirTextBlock* Txt_Detail; // 0x2f0
	int32_t m_CustomizingType; // 0x2f8
};

struct UParticleModuleParameterDynamic {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UMM_ClassSelect {
	UMM_MoviePlayerWidget* m_pMoviePlayerWidget; // 0x2f0
	UMirImage* m_pClassSymbolImage; // 0x2f8
	FText m_ClassNameText; // 0x300
	FText m_ClassDescriptionText; // 0x318
	UMM_Common_Btn* m_pClassConfirmBtn; // 0x330
	UMirButton* m_pMovieReplayButton; // 0x338
	UMirButton* m_pBackButton; // 0x340
	UWidgetAnimation* Ani_ClassSlot; // 0x348
	TArray<UMM_ClassSelect_Slot*> m_SelectSlotArray; // 0x350
};

struct UMM_CharacterSelect {
	UPanelWidget* Panel_DeleteInfo; // 0x2f0
	UPanelWidget* Panel_GuildName; // 0x2f8
	UPanelWidget* Panel_GuildPosition; // 0x300
	UMM_Common_Btn_Symbol* Btn_DeleteCharacterCancel; // 0x308
	UMirTextBlock* Txt_DeleteTime; // 0x310
	TArray<UMM_CharacterSelect_Slot*> SelectList; // 0x318
	UMirButton* Btn_HistoryBack; // 0x328
	UMirImage* Img_ClassSymbol; // 0x330
	UMirTextBlock* txt_nickname; // 0x338
	UMirTextBlock* txt_level; // 0x340
	UMirTextBlock* Txt_CombatPoint; // 0x348
	UMirTextBlock* Txt_GuildName; // 0x350
	UMirTextBlock* Txt_GuildPosition; // 0x358
	UMirTextBlock* Txt_Position; // 0x360
	UMM_Common_Btn* Btn_DeleteCharacter; // 0x368
	UMM_Common_Btn* Btn_GameStart; // 0x370
	UMM_Common_Btn* Btn_FaceJob; // 0x378
	UMirButton* Btn_GameOption; // 0x380
	UMirButton* Btn_VoiceDownload; // 0x388
	UPanelWidget* Panel_VoiceDownload; // 0x390
	UPanelWidget* Panel_VoiceDownload_Btn; // 0x398
	UPanelWidget* Panel_VoiceDownload_Progress; // 0x3a0
	UMM_Common_Btn* btn_nft_import; // 0x3a8
	int32_t STRING_TIME_DAYS; // 0x3b0
	int32_t STRING_TIME_HOURS; // 0x3b4
	int32_t STRING_TIME_MINUTES; // 0x3b8
	int32_t STRING_TIME_SECONDS; // 0x3bc
	int32_t STRING_REMAIN_TIME; // 0x3c0
	int32_t STRING_CHARACTER_DELETE_TITLE; // 0x3c4
	int32_t STRING_EMPTY_GUILD_NAME; // 0x3c8
	int32_t m_CharacterDeleteTime; // 0x3cc
	float m_CurrentDeltaTime; // 0x3d0
	FString m_DayString; // 0x3d8
	FString m_HourString; // 0x3e8
	FString m_MinuteString; // 0x3f8
	FString m_SecondString; // 0x408
	UPanelWidget* m_Can_Ping; // 0x420
	UMirImage* m_Img_Ping; // 0x428
	UMirTextBlock* m_Txt_Ping; // 0x430
};

struct UMM_Dominion_Title_ListBase {
	UVerticalBox* m_pVertBox; // 0x2e0
	UMirTextBlock* m_pTxtTitle; // 0x2e8
};

struct UMM_PopUp_InventoryExtend {
	UMM_Item_Make_Slider* m_InputSlider; // 0x2f8
	UMM_Common_Btn* m_CB_Cancel; // 0x300
	UMM_Common_Btn_Cost* m_CB_Buy; // 0x308
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x310
	UMirRichTextBlock* m_RTxt_Notice; // 0x318
	UMirTextBlock* m_Txt_Title; // 0x320
	UMM_Common_ToolTipBtn* m_C_Btn_ToolTip; // 0x328
};

struct UMM_Ranking_Reward_List_New {
	UMirImage* m_pImgRank; // 0x2e0
	UMirTextBlock* m_pTxtRankValue; // 0x2e8
	UMM_Slot_New_Ranking_Reward_Buff* m_RewardItem1; // 0x2f0
	UMM_Slot_New_Ranking_Reward_Buff* m_RewardItem2; // 0x2f8
	UMM_Slot_New_Ranking_Reward_Buff* m_RewardItem3; // 0x300
	UMM_Slot_New_Ranking_Reward_Buff* m_RewardItem4; // 0x308
};

struct UBTDecorator_TagCooldown {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct UInterpGroupInstDirector {
	UInterpGroup* Group; // 0x28
	AActor* GroupActor; // 0x30
	TArray<UInterpTrackInst*> TrackInst; // 0x38
};

struct UPawnMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UInterpTrackFloatProp {
	FName PropertyName; // 0x90
};

struct UEnvQueryGenerator_ProjectedPoints {
	FEnvTraceData ProjectionData; // 0x50
};

struct USourceEffectWaveShaperPreset {
	FSourceEffectWaveShaperSettings Settings; // 0x70
};

struct UMovieSceneCinematicShotSection {
	FString ShotDisplayName; // 0x150
	FText DisplayName; // 0x160
};

struct UMovieSceneParticleParameterTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UMirImage {
	FSlateBrush Brush; // 0x108
	DelegateProperty BrushDelegate; // 0x190
	FLinearColor ColorAndOpacity; // 0x1a0
	DelegateProperty ColorAndOpacityDelegate; // 0x1b0
	bool bFlipForRightToLeftFlowDirection; // 0x1c0
	DelegateProperty OnMouseButtonDownEvent; // 0x1c4
};

struct UMM_TemplateManager {
	TMap<ETableType, UDataTable*> m_TableMap; // 0x28
	TArray<UDataTable*> m_CustomizingBoneDataTables; // 0x78
	TArray<UDataTable*> m_CustomizingPresetDataTables; // 0x88
	TArray<UDataTable*> m_CustomizingSettingDataTables; // 0x98
	UDataTable* m_CustomizingTypeDataTable; // 0xa8
	TArray<UDataTable*> m_StoryQuestTables; // 0xb0
	UDataTable* m_QuestTableSet; // 0xc0
	FString m_strCSVPath; // 0x2a8
	TArray<FString> m_arTableNameNotUseCSV; // 0x2b8
	bool m_bInit; // 0x2c8
};

struct UMM_MakeItem_Slot_Special {
	UMirImage* m_Img_GradeBgEffect; // 0x440
	UMirImage* m_ImgEquipMaark; // 0x448
	UMirImage* m_ImgTypeImage; // 0x450
	UMirButton* m_BtnSetItem; // 0x458
	UPanelWidget* m_ImgRemoveItemPanel; // 0x460
	UMM_Common_Btn_Symbol* m_ImgRemoveItemBtn; // 0x468
	UMirTextBlock* m_TxtItemSmeltingLevel; // 0x470
	UMirImage* m_ImgPlusSpecial; // 0x478
	UMM_ItemMake_Switch* Material_Switch; // 0x480
	EMakeItemType m_MakeType; // 0x488
	UMirImage* m_Img_Tier; // 0x490
};

struct UEnvQueryTest_Distance {
	EEnvTestDistance TestMode; // 0x1c0
	UEnvQueryContext* DistanceTo; // 0x1c8
};

struct UMM_Occupation_KillLog_Slot {
	UWidgetAnimation* AnimationStart; // 0x2e0
	UWidgetAnimation* AnimationEnd; // 0x2e8
	UWidgetSwitcher* Switcher_KillLog; // 0x2f0
	UMirTextBlock* Txt_KillLog01; // 0x2f8
	UMirTextBlock* Txt_KillLog02; // 0x300
	UMirTextBlock* Txt_KillLog03; // 0x308
	FTimerHandle TimeHandle_EndLog; // 0x310
	FTimerHandle TimeHandle_FinishLog; // 0x318
	TWeakObjectPtr<UMM_Occupation_KillLog> OwnerObjectWeakPtr; // 0x320
	UMirImage* m_img_KillLog; // 0x328
};

struct UUserInterfaceSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	TMap<EMouseCursor, FHardwareCursorReference> HardwareCursors; // 0x40
	TMap<EMouseCursor, FSoftClassPath> SoftwareCursors; // 0x90
	FSoftClassPath DefaultCursor; // 0xe0
	FSoftClassPath TextEditBeamCursor; // 0xf8
	FSoftClassPath CrosshairsCursor; // 0x110
	FSoftClassPath HandCursor; // 0x128
	FSoftClassPath GrabHandCursor; // 0x140
	FSoftClassPath GrabHandClosedCursor; // 0x158
	FSoftClassPath SlashedCircleCursor; // 0x170
	float ApplicationScale; // 0x188
	EUIScalingRule UIScaleRule; // 0x18c
	FSoftClassPath CustomScalingRuleClass; // 0x190
	FRuntimeFloatCurve UIScaleCurve; // 0x1a8
	bool bAllowHighDPIInGameMode; // 0x230
	bool bLoadWidgetsOnDedicatedServer; // 0x231
	TArray<UObject*> CursorClasses; // 0x238
	UObject* CustomScalingRuleClassInstance; // 0x248
	UDPICustomScalingRule* CustomScalingRule; // 0x250
	bool bForceCalculateScale; // 0x258
};

struct UDistributionVectorUniform {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct UFrameGrabberProtocol {
	EMovieSceneCaptureProtocolState State; // 0x50
};

struct UMM_RelationQuestList {
	TMap<int32_t, int32_t> m_CategoryToStr; // 0x2f0
	UMirListView* m_ListView_GroupList; // 0x340
	UMirListView* m_ListView_RelationList; // 0x348
	UMM_CommonHorizontalTabSet* m_CategorySet; // 0x350
	UMM_QuestRelation_Progress* m_QuestRelationProg; // 0x358
	TArray<URelationGroupSlotObj*> m_arRelationGroupSlotObj; // 0x370
	TArray<URelationSlotObj*> m_arRelationSlotObj; // 0x380
};

struct ATimerTrigger {
	float m_Time; // 0x278
	bool m_bShowLimitTimeWidget; // 0x27c
};

struct UMM_MysticalPieceQuickTab {
	UMM_MysticalPieceQuickSlotBtn* m_arQuickBtn[0x5]; // 0x2f0
};

struct UMM_Popup_FriendlyCharacter {
	UMM_Common_Btn_Symbol* btn_close; // 0x2e0
	UMM_Common_Btn* btn_search; // 0x2e8
	UMM_Common_Btn* btn_confirm; // 0x2f0
	UMirScrollBox* sb_member; // 0x2f8
	UMM_Common_Board_Notice* empty_notice; // 0x300
};

struct UMM_Slot_Rank {
	UMirImage* img_rank; // 0x2e0
	UMirTextBlock* txt_rank; // 0x2e8
};

struct AMyDrawDebug {
	TArray<ABlockingVolume*> m_BlockingVolumeArray; // 0x218
	FColor m_BoxColor; // 0x228
	FColor m_BoxBoardColor; // 0x22c
};

struct AReflectionCapture {
	UReflectionCaptureComponent* CaptureComponent; // 0x218
};

struct UParticleModuleLocationEmitter {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
	char bApplyOrbitOffset : 1; // 0x4c
};

struct UMovieSceneSubSection {
	FMovieSceneSectionParameters Parameters; // 0xe0
	float StartOffset; // 0xf8
	float TimeScale; // 0xfc
	float PrerollTime; // 0x100
	UMovieSceneSequence* SubSequence; // 0x108
	AActor* ActorToRecord; // 0x110
	FString TargetSequenceName; // 0x130
	FDirectoryPath TargetPathToRecordTo; // 0x140
};

struct UOnlineEngineInterfaceImpl {
	FName VoiceSubsystemNameOverride; // 0x28
};

struct UMM_Customizing_Scroll {
	UMirScrollBox* m_ScrollBox; // 0x308
	TArray<UMM_Customizing_ListItem*> m_ListSlotArray; // 0x310
};

struct UMM_Dominion_Base_List {
	UMirListView* m_ListView_DominionList; // 0x2f0
	TArray<UDominionSlotObj*> m_arDominionSlotObj; // 0x310
};

struct UMM_GameOption_Switch {
	UTextBlock* Txt_MainTitle; // 0x2f8
	UCheckBox* Chk_MainSwitch; // 0x300
	UMirButton* Btn_CheckDisable; // 0x308
	int32_t SwitchFlag; // 0x310
};

struct UMaterialExpressionStaticComponentMaskParameter {
	FExpressionInput Input; // 0x58
	char DefaultR : 1; // 0x6c
	char DefaultG : 1; // 0x6c
	char DefaultB : 1; // 0x6c
	char DefaultA : 1; // 0x6c
};

struct UGeometryCacheComponent {
	UGeometryCache* GeometryCache; // 0x440
	bool bRunning; // 0x448
	bool bLooping; // 0x449
	float StartTimeOffset; // 0x44c
	float PlaybackSpeed; // 0x450
	int32_t NumTracks; // 0x454
	float ElapsedTime; // 0x458
	float Duration; // 0x48c
	bool bManualTick; // 0x490
};

struct UMM_B_Shop_NPC {
	UMM_B_Shop_ListElement* ListElementClass; // 0x2f0
	int32_t m_TestValue; // 0x2f8
	UWidgetAnimation* m_Anim_Open; // 0x300
	UWidgetAnimation* m_Anim_Close; // 0x308
	UMM_Common_Btn_Symbol* m_BtnClose; // 0x310
	UMM_Goods_Slot* m_Goods; // 0x318
	UTextBlock* m_TitleText; // 0x320
	UMirScrollBox* m_ScrollBox; // 0x328
	UMirScrollBox* m_GuildScrollBox; // 0x330
	UMM_Common_Btn* btn_reset; // 0x338
	UMirTextBlock* txt_time_value; // 0x340
	UMirTextBlock* txt_time; // 0x348
	UGridPanel* gp_normal; // 0x350
	UGridPanel* gp_black_iron; // 0x358
	UMM_GuildIcon* guild_icon; // 0x360
	UMirRichTextBlock* txt_guild_name; // 0x368
	UMirTextBlock* txt_remain_count; // 0x370
	UMirTextBlock* txt_remain_time; // 0x378
	UMM_ShopNpcGoods* shop_npc_goods; // 0x380
	UMirCanvasPanel* m_CanvasEventGoods; // 0x388
	UMirImage* m_Img_CostIcon; // 0x390
	UMirTextBlock* m_Txt_CostValue; // 0x398
	UMM_Common_ToolTipBtn* m_pBtnCommToolTip; // 0x3a0
};

struct UMM_PieceItemSlot {
	UWidgetAnimation* m_Effect; // 0x2e0
	UMM_Slot_Material* m_PieceItemSlot; // 0x2e8
};

struct USceneCaptureComponent2D {
	ECameraProjectionMode ProjectionType; // 0x2d0
	float FOVAngle; // 0x2d4
	float OrthoWidth; // 0x2d8
	UTextureRenderTarget2D* TextureTarget; // 0x2e0
	ESceneCaptureCompositeMode CompositeMode; // 0x2e8
	FPostProcessSettings PostProcessSettings; // 0x2f0
	float PostProcessBlendWeight; // 0x820
	char bOverride_CustomNearClippingPlane : 1; // 0x824
	float CustomNearClippingPlane; // 0x828
	bool bUseCustomProjectionMatrix; // 0x82c
	FMatrix CustomProjectionMatrix; // 0x830
	bool bEnableClipPlane; // 0x870
	FVector ClipPlaneBase; // 0x874
	FVector ClipPlaneNormal; // 0x880
	char bCameraCutThisFrame : 1; // 0x88c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x88c
};

struct USourceEffectPhaserPreset {
	FSourceEffectPhaserSettings Settings; // 0x78
};

struct UMM_Popup_ServerSelect_Global {
	FLinearColor ServerCongestion_Normal; // 0x2e0
	FLinearColor ServerCongestion_Busy; // 0x2f0
	FLinearColor ServerCongestion_Saturation; // 0x300
	FLinearColor Filter_Normal; // 0x310
	FLinearColor Filter_Selected; // 0x320
	UPanelWidget* m_Can_ServerSelect; // 0x360
	UPanelWidget* m_Can_FindChar; // 0x368
	UMirImage* m_Img_TotalFilter_Selected; // 0x370
	UMirImage* m_Img_RecommendFilter_Selected; // 0x378
	UMirImage* m_Img_MyFilter_Selected; // 0x380
	UMirTextBlock* m_Txt_TotalFilter; // 0x388
	UMirTextBlock* m_Txt_RecommendFilter; // 0x390
	UMirTextBlock* m_Txt_MyFilter; // 0x398
	UMirButton* m_Btn_TotalFilter; // 0x3a0
	UMirButton* m_Btn_RecommendFilter; // 0x3a8
	UMirButton* m_Btn_MyFilter; // 0x3b0
	UMirImage* m_Img_ServerCongestionInfo_1; // 0x3b8
	UMirImage* m_Img_ServerCongestionInfo_2; // 0x3c0
	UMirImage* m_Img_ServerCongestionInfo_3; // 0x3c8
	UMirTextBlock* m_Txt_ServerCongestionInfo_1; // 0x3d0
	UMirTextBlock* m_Txt_ServerCongestionInfo_2; // 0x3d8
	UMirTextBlock* m_Txt_ServerCongestionInfo_3; // 0x3e0
	UMM_Common_Btn_Symbol* m_CB_ServerSelectClose; // 0x3e8
	UMirScrollBox* m_Scr_RegionList; // 0x3f0
	UMirScrollBox* m_Scr_ServerList; // 0x3f8
	TArray<UMM_RegionSlot_Global*> m_arRegionSlot; // 0x400
	TArray<UMM_ServerGroup_Global*> m_arServerGroup; // 0x410
	UPanelWidget* m_Can_TopArrow; // 0x420
	UPanelWidget* m_Can_BottomArrow; // 0x428
	UWidgetAnimation* m_Ani_Arrow; // 0x430
	UMirTextBlock* m_Txt_RecentServer; // 0x438
	UMM_Common_Btn_Symbol* m_CB_ServerSelectRefresh; // 0x440
	UMM_Common_Btn* m_CB_GoToFindChar; // 0x448
	UMM_Common_Btn_Symbol* m_CB_FindCharClose; // 0x450
	UMirScrollBox* m_Scr_FindCharList; // 0x458
	TArray<UMM_FindCharSlot_Global*> m_arCharSlot; // 0x460
};

struct UMM_State_Item {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMovieSceneCameraCutTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UMM_QuestBaseMsg {
	UMirRichTextBlock* m_Txt_Message; // 0x2e0
	int32_t m_RARE_QUEST_ICON; // 0x2e8
	int32_t m_HERO_QUEST_ICON; // 0x2ec
	int32_t m_LEGEND_QUEST_ICON; // 0x2f0
	UWidgetAnimation* m_OpenAni; // 0x300
	UWidgetAnimation* m_CloseAni; // 0x308
};

struct UMovieSceneIntegerSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe0
};

struct UMM_Popup_GuildInvite {
	UMM_Common_Btn_Symbol* btn_close; // 0x2f0
	UMM_Common_Btn_Symbol* btn_search; // 0x2f8
	UMM_Common_Btn* btn_confirm; // 0x300
	UMM_Common_Btn* btn_refresh; // 0x308
	UMirScrollBox* sb_recommend; // 0x310
	UMM_Common_Board_Notice* notice; // 0x318
	UMirEditableText* edit_txt_search; // 0x320
	UMirCanvasPanel* cp_invite; // 0x328
	UMirCanvasPanel* cp_search; // 0x330
	UMM_Common_Btn_Symbol* btn_prev; // 0x338
	UMM_Common_Btn_Symbol* btn_next; // 0x340
	UMirTextBlock* txt_page; // 0x348
	UMM_Common_Btn* btn_search_cancel; // 0x350
	UMM_Common_Btn* btn_confirm_search; // 0x358
};

struct AWallTrigger {
	UBoxComponent* m_pBoxCollision; // 0x278
	bool m_bWallActivated; // 0x280
};

struct UGameplayTagsDeveloperSettings {
	FString DeveloperConfigName; // 0x28
};

struct UButtonSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UMM_AchievementSlot {
	UMM_Condition_info* ConditionInfo; // 0x2e8
	TArray<UMM_Slot_Material*> RewardList; // 0x2f0
	UMM_Common_Btn* Btn_Receive; // 0x300
	int32_t m_AchievementID; // 0x308
	UMirImage* m_CompleteImg; // 0x310
	UPanelWidget* m_PanelReward; // 0x318
	UPanelWidget* m_PanelBtn; // 0x320
	UMirButton* m_SelectBtn; // 0x328
	UMirImage* m_FocusImg; // 0x330
};

struct UPhysicsThrusterComponent {
	float ThrustStrength; // 0x220
};

struct UMM_PKRecordList {
	UTextBlock* m_Txt_Time; // 0x2e8
	UImage* m_Img_Win; // 0x2f0
	UImage* m_Img_Die; // 0x2f8
	UImage* m_Img_UserClassMark; // 0x300
	UTextBlock* m_Txt_UserName; // 0x308
	UTextBlock* m_Txt_UserCombatPoint; // 0x310
	UImage* m_Img_Frame; // 0x318
	UImage* m_Img_Symbol; // 0x320
	UTextBlock* m_Txt_GuildName; // 0x328
	UMM_Common_Btn* m_ActionBtn; // 0x330
};

struct UBorderSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UHitPostProcessMatNotify {
	FHitPostProcessMaterialData HitPostProcessData; // 0x38
};

struct ALevel_Master_C {
	char bInputEnabled : 1; // 0x218
};

struct UMM_B_Party_List {
	UMM_Party_LeftTab* m_Tab_Left; // 0x2f0
	UMirCheckBox* m_CheckBox_Alarm; // 0x2f8
	UMirCheckBox* m_CheckBox_Guild; // 0x300
	UMirTextBlock* m_Txt_MinLv; // 0x308
	UMirTextBlock* m_Txt_MaxLv; // 0x310
	UMirButton* m_Btn_MinLv; // 0x318
	UMirButton* m_Btn_MaxLv; // 0x320
	UMM_Common_Btn_Symbol* m_C_Btn_ResetSearchRange; // 0x328
	UMM_Common_Board_Notice* m_C_Empty_Notice; // 0x330
	UMirListView* m_ListView_PartyList; // 0x338
	UMM_Common_Btn* m_C_Btn_Refresh; // 0x340
	UMirCanvasPanel* m_Canvas_List; // 0x348
	TArray<UPartySlotObj*> m_arPartySlotObj; // 0x358
};

struct UAppleLogin {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFail; // 0x40
};

struct UMM_UIAction_ItemGetWay {
	int32_t STR_NPCSTORE_GRADE1_TITLE; // 0x130
	int32_t STR_NPCSTORE_GRADE2_TITLE; // 0x134
	int32_t STR_QUEST_LOCK_MESSAGE; // 0x138
	int32_t STR_QUEST_LOCK_COMMONMESSAGE; // 0x13c
	int32_t STR_QUEST_MISSION_COMPLETE; // 0x140
	int32_t STR_QUEST_REQUEST_TITLE; // 0x144
	int32_t STR_QUEST_REQUEST_COMPLETE; // 0x148
	int32_t STRID_NOVALIDATE; // 0x14c
	int32_t STRID_NOVALIDATE_COST; // 0x150
};

struct UFirebaseFutureUser {
	FScriptMulticastDelegate OnComplete; // 0x30
};

struct UMM_Popup_GuildDonation {
	UMM_Common_Btn_Symbol* btn_close; // 0x2f0
	UMM_Common_Btn* Btn_Cancel; // 0x2f8
	UMM_Common_Btn* btn_details; // 0x300
	UMM_Common_Btn* btn_confirm; // 0x308
	UMM_Common_Btn* btn_confirm_lock; // 0x310
	TArray<UMM_Popup_GuildDonationSelectSlot*> lst_slot; // 0x318
	UMirImage* img_send; // 0x328
	UMirImage* img_recv; // 0x330
	UMirImage* img_possession; // 0x338
	UMirTextBlock* txt_send_name; // 0x340
	UMirTextBlock* txt_send; // 0x348
	UMirTextBlock* txt_recv; // 0x350
	UMirTextBlock* txt_possession; // 0x358
	UMirImage* img_donation; // 0x360
	UMirTextBlock* txt_donation_name; // 0x368
	UMirTextBlock* txt_donation; // 0x370
	UMirCanvasPanel* cp_commission; // 0x378
	UMirTextBlock* txt_commission; // 0x380
	UMM_Item_Make_Slider* item_make_slider; // 0x388
	UWidgetSwitcher* switcher; // 0x390
	UMirImage* img_dev; // 0x398
	UMirTextBlock* txt_dev_title; // 0x3a0
	UMirTextBlock* txt_dev; // 0x3a8
	UMirTextBlock* Txt_Title; // 0x3b0
	UMirTextBlock* Txt_Desc; // 0x3b8
	UMirCanvasPanel* cp_reward; // 0x3c0
	UMirImage* img_reward_exp; // 0x3c8
	UMirTextBlock* txt_reward_exp; // 0x3d0
	UMirImage* img_reward_money; // 0x3d8
	UMirTextBlock* txt_reward_money; // 0x3e0
};

struct AMM_BattleTestGameMode {
	UMaterialParameterCollection* m_pBackgroundParamCollection; // 0x330
	AMM_Monster* m_pFriendMonster; // 0x338
	AMM_CharacterPawnBase* m_pSelectTarget; // 0x340
	AMM_CharacterPawnBase* m_pLockOnTarget; // 0x348
	bool EndLevelTravel; // 0x350
	AUIBackGroundActor* m_pUIBackGroundActor; // 0x400
	AMM_SituationDirectiveEffect* SituationDirectiveActor; // 0x408
	TMap<int32_t, TWeakObjectPtr<AQuestArrivalDisplayActor>> MapQuestArrivalDisplayActor; // 0x410
	AMM_HQPlayerReferenceActor* m_pHQPlayer; // 0x460
	AMM_PortraitCaptureActor* m_pPortraitCaptureActor; // 0x468
	UCanvasRenderTarget2D* m_pPlayerPortraitRenderTarget; // 0x470
	AContentsLightManager* m_pContentsLightManager; // 0x478
	FString MyEditorCulture; // 0x490
};

struct UMM_Dominion_Title_SlotBase {
	UMirTextBlock* m_pTxtClass; // 0x2e0
	UMirTextBlock* m_pTxtName; // 0x2e8
	UMM_Common_Btn_Symbol* m_pBtnInfo; // 0x2f0
	UMM_GuildMemberPortrait* m_pPortrait; // 0x2f8
	UMirButton* m_pBtnClick; // 0x300
};

struct UInterpTrackInstVectorMaterialParam {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UMirScaleBox {
	float m_fUserSpecifiedScaleOnFold; // 0x140
	UWNAndroidDeviceState* m_pDeviceStateListener; // 0x148
};

struct UMovieSceneMarginTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UDamageType {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UMaterialExpressionTransformPosition {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct UMM_B_Request {
	int32_t m_WatchingAllQuestToStr; // 0x2f0
	UMM_CommonVerticalTabSet* m_VerticalSet; // 0x2f8
	UMirListView* m_ListView_RequestList; // 0x300
	UMirCheckBox* m_CheckCompleteQuest; // 0x308
	UMirTextBlock* m_CompleteQuest; // 0x310
	UMirTextBlock* m_Msg; // 0x318
	UPanelWidget* m_Grid_Panel; // 0x320
	UMM_Common_Board_Notice* m_pCommNotice_Empty; // 0x328
	TArray<URequestSlotObj*> m_arRequestSlotObj; // 0x330
};

struct UMM_UserEvent_GachaResultSlot {
	UMM_Slot_Inventory* m_pSlotItem; // 0x2f0
	UMirTextBlock* m_pTxtItemName; // 0x2f8
	UMirTextBlock* m_Txt_Seal; // 0x300
	UMirCanvasPanel* m_pCanvasItemName; // 0x308
	UMirImage* m_Img_Gold_Card_Squre_Fx; // 0x310
	UWidgetAnimation* m_pCardOpenAni; // 0x318
	UWidgetAnimation* m_pHeroCardOpenAni; // 0x320
	UWidgetAnimation* m_pLegendCardOpenAni; // 0x328
	UWidgetAnimation* m_pSlotStartAni; // 0x330
	UWidgetAnimation* m_pBounceAni; // 0x338
	UWidgetAnimation* m_pCardTurnOpen; // 0x340
	UGridPanel* m_Grid_Card_Turn_Effect; // 0x348
	UEffectWidgetBase* m_WE_Unsealing_Complete02; // 0x350
	UMirButton* m_pBtnClick; // 0x358
	UMirCanvasPanel* m_pPanelCover; // 0x360
	UMirImage* m_Img_Cover; // 0x368
	UScaleBox* m_pScaleSeal; // 0x370
	UGridPanel* m_Effect_Panel; // 0x378
	UEffectWidgetBase* m_Effect_Widget; // 0x380
	UWidgetAnimation* m_pGreatHeroOpenAni; // 0x388
	UWidgetAnimation* m_pHeroAppearAni; // 0x390
};

struct UMovieScene3DConstraintSection {
	FGuid ConstraintId; // 0xe0
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf0
};

struct UEnvQueryGenerator_ActorsOfClass {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x88
	UEnvQueryContext* SearchCenter; // 0xb8
};

struct UHorizontalBoxSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UDistributionFloatUniformCurve {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct UParticleModuleMeshRotationRateMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x30
};

struct URadialVector {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
};

struct UTextBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x58
};

struct UAnimCompress_RemoveEverySecondKey {
	int32_t MinKeys; // 0x50
	char bStartAtSecondKey : 1; // 0x54
};

struct UBTService_BlueprintBase {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UMM_PopupEdit {
	UMirCanvasPanel* cp_change; // 0x2e0
	UMirCanvasPanel* cp_reset; // 0x2e8
	UMirTextBlock* Txt_Title; // 0x2f0
	UMirEditableText* edit_txt; // 0x2f8
	UMM_Common_Btn* Btn_Cancel; // 0x300
	UMM_Common_Btn* btn_confirm; // 0x308
	UMM_Common_Btn_Symbol* btn_close; // 0x310
	UMirTextBlock* txt_custom_title_reset; // 0x318
};

struct UMirCanvasPanel {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UWidget {
	UPanelSlot* Slot; // 0x28
	DelegateProperty bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	DelegateProperty ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	DelegateProperty ToolTipWidgetDelegate; // 0x70
	DelegateProperty VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	EMouseCursor Cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct UImgMediaSource {
	FFrameRate FrameRateOverride; // 0x88
	FString ProxyOverride; // 0x90
	FDirectoryPath SequencePath; // 0xa0
};

struct UMM_Option_Ability_Compare {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMM_PKModeSlot {
	FScriptMulticastDelegate OnSelectedModeEvent; // 0x2e0
	UButton* m_Btn_Base; // 0x2f0
	UImage* m_Image_Mode; // 0x2f8
	UTextBlock* m_TextBlock_Mode; // 0x300
	UImage* m_Image_Selected; // 0x308
	EPKModeType m_ModeType; // 0x310
	bool m_IsSelected; // 0x311
};

struct UBeamAnimNotifyState {
	int32_t EffectId; // 0x30
};

struct UMM_Auction_ComboSlot {
	UMirTextBlock* m_pTxtName; // 0x2e0
	UMirImage* m_pImgSelect; // 0x2e8
	UMirButton* m_pBtnMain; // 0x2f0
};

struct UFirebaseFutureFetchProvideResult {
	FScriptMulticastDelegate OnComplete; // 0x30
};

struct UGoogleLoginSubSystem {
	UFirebaseCredential* m_WindowFirebaseCredential; // 0x40
	UFirebaseGoogleCredential* m_GoogleCredential; // 0x48
};

struct UMM_CharAbility_Info_Fame {
	UMirTextBlock* Txt_Fame_Level; // 0x2f0
	UMirProgressBar* PB_Fame; // 0x2f8
	UMirTextBlock* Txt_Pb; // 0x300
	UMirTextBlock* Txt_Fame_Title; // 0x308
	UMirTextBlock* Txt_Fame_Value; // 0x310
	UMM_Common_Btn_Symbol* Btn_Fame_Info; // 0x318
	UMirScrollBox* ScrollBox_Fame; // 0x320
	TArray<UMM_Fame_List_MainSlot*> FameMainSlot_List; // 0x328
	int32_t m_MaxFameSlotCount; // 0x338
	int32_t m_CurrentFameSlotCount; // 0x33c
};

struct UMM_Fame_DetailInfo_Slot {
	UMirTextBlock* Txt_Title; // 0x2e0
	UMirTextBlock* Txt_Value; // 0x2e8
	int32_t STRID_POINT; // 0x2f0
};

struct UMM_New_Force_Ability_Icon {
	FLinearColor m_SelectColor; // 0x300
	FLinearColor m_MaxLevelSelectColor; // 0x310
	UMirImage* m_C_Img_Ability; // 0x328
	UMirImage* m_C_Img_Indicator; // 0x330
	UPanelWidget* m_C_Grid_Effect; // 0x338
	UPanelWidget* m_C_Img_Selected; // 0x340
	UPanelWidget* m_C_Grid_Grade; // 0x348
	UMirTextBlock* m_C_Txt_Grade; // 0x350
	UMirButton* m_C_Btn_Main; // 0x358
	UMirImage* m_SelectEffect; // 0x360
	UWidgetAnimation* m_AuiGuide; // 0x368
};

struct UEdGraphNode_Documentation {
	FString link; // 0x98
	FString Excerpt; // 0xa8
};

struct UMovieSceneSpawnSection {
	bool DefaultValue; // 0xe0
	FMovieSceneBoolChannel BoolCurve; // 0xe8
};

struct UMM_Popup_UserEvent {
	UMirTextBlock* m_Txt_Title; // 0x2f0
	UMM_Common_Btn_Symbol* m_C_Btn_Close; // 0x2f8
	UMirScrollBox* m_ScrollBox_Tab; // 0x300
	UMirCanvasPanel* m_Can_List; // 0x308
	UMirCanvasPanel* m_Can_Event; // 0x310
	UMM_UserEvent_Attendance_Month* m_UserEvent_Attendance_Month; // 0x318
	UMM_UserEvent_Attendance_Day* m_UserEvent_Attendance_Day; // 0x320
	UMM_UserEvent_Attendance_Day_02* m_UserEvent_Attendance_Day_02; // 0x328
	UMM_UserEvent_BattlePass* m_UserEvent_BattlePass; // 0x330
	UMM_UserEvent_Goal* m_UserEvent_Goal; // 0x338
	UMM_UserEvent_WebBrowser* m_UserEvent_WebBrowser; // 0x340
	UMM_UserEvent_Gacha* m_UserEvent_Gacha; // 0x348
	UMM_UserEvent_Benediction* m_UserEvent_Benediction; // 0x350
	UMM_UserEvent_Siege* m_UserEvent_Siege; // 0x358
	UMM_USerEvent_BP_Attendance* m_UserEvent_BattlePass_Attendance; // 0x360
	UMM_Common_Board_Notice* m_C_Empty_Notice; // 0x368
};

struct AGuardNpcSpawnTrigger {
	int32_t m_FriendMonsterID; // 0x278
	int32_t m_MonsterOrderID; // 0x27c
	ATriggerWayPoint* m_pWayPoint; // 0x280
	AMM_Monster* m_pGuardNpc; // 0x288
};

struct UMaterialExpressionChannelMaskParameter {
	EChannelMaskParameterColor MaskChannel; // 0x70
	FExpressionInput Input; // 0x74
};

struct UMM_Scroll_Dots {
	int32_t m_iDotsMaxCount; // 0x2f0
	TArray<UMirImage*> ImgList_ON; // 0x2f8
	TArray<UMirCanvasPanel*> PanelList; // 0x308
	int32_t CurrentDot; // 0x318
};

struct ANavigationTestingActor {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UNavigationInvokerComponent* InvokerComponent; // 0x230
	char bActAsNavigationInvoker : 1; // 0x238
	FNavAgentProperties NavAgentProps; // 0x240
	FVector QueryingExtent; // 0x270
	ANavigationData* MyNavData; // 0x280
	FVector ProjectedLocation; // 0x288
	char bProjectedLocationValid : 1; // 0x294
	char bSearchStart : 1; // 0x294
	char bBacktracking : 1; // 0x294
	char bUseHierarchicalPathfinding : 1; // 0x294
	char bGatherDetailedInfo : 1; // 0x294
	char bDrawDistanceToWall : 1; // 0x294
	char bShowNodePool : 1; // 0x294
	char bShowBestPath : 1; // 0x294
	char bShowDiffWithPreviousStep : 1; // 0x295
	char bShouldBeVisibleInGame : 1; // 0x295
	ENavCostDisplay CostDisplayMode; // 0x298
	FVector2D TextCanvasOffset; // 0x29c
	char bPathExist : 1; // 0x2a4
	char bPathIsPartial : 1; // 0x2a4
	char bPathSearchOutOfNodes : 1; // 0x2a4
	float PathfindingTime; // 0x2a8
	float PathCost; // 0x2ac
	int32_t PathfindingSteps; // 0x2b0
	ANavigationTestingActor* OtherActor; // 0x2b8
	UNavigationQueryFilter* FilterClass; // 0x2c0
	int32_t ShowStepIndex; // 0x2c8
	float OffsetFromCornersDistance; // 0x2cc
};

struct UMM_B_DominionWanted {
	UMM_CommonVerticalTabSet* m_pTab_Vertical; // 0x2f0
	UMirListView* m_pListView_WantedList; // 0x2f8
	UMM_Common_Board_Notice* m_pEmpty_Notice; // 0x300
	UMM_Common_Btn* m_pBtnAddWanted; // 0x308
	TArray<UDominionWantedSlotObj*> m_arWantedSlotObj; // 0x310
};

struct ALandscapeStreamingProxy {
	ALandscape* LandscapeActor; // 0x510
};

struct UFieldSystemMetaDataIteration {
	int32_t Iterations; // 0xb0
};

struct UMaterialExpressionWorldPosition {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x40
};

struct UMM_Popup_Occupation_Rank {
	TArray<UMM_Occupation_Rank_List*> RankList; // 0x2f0
	UMM_Occupation_Rank_List* MyRankInfo; // 0x300
	UMM_Common_Btn_Symbol* btn_close; // 0x308
	UMM_Common_Btn* Btn_Ok; // 0x310
	UMirButton* Btn_Close_BG; // 0x318
};

struct AMatineeActor {
	UInterpData* MatineeData; // 0x218
	FName MatineeControllerName; // 0x220
	float PlayRate; // 0x228
	char bPlayOnLevelLoad : 1; // 0x22c
	char bForceStartPos : 1; // 0x22c
	float ForceStartPosition; // 0x230
	char bLooping : 1; // 0x234
	char bRewindOnPlay : 1; // 0x234
	char bNoResetOnRewind : 1; // 0x234
	char bRewindIfAlreadyPlaying : 1; // 0x234
	char bDisableRadioFilter : 1; // 0x234
	char bClientSideOnly : 1; // 0x234
	char bSkipUpdateIfNotVisible : 1; // 0x234
	char bIsSkippable : 1; // 0x234
	int32_t PreferredSplitScreenNum; // 0x238
	char bDisableMovementInput : 1; // 0x23c
	char bDisableLookAtInput : 1; // 0x23c
	char bHidePlayer : 1; // 0x23c
	char bHideHud : 1; // 0x23c
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x240
	char bShouldShowGore : 1; // 0x250
	TArray<UInterpGroupInst*> GroupInst; // 0x258
	TArray<FCameraCutInfo> CameraCuts; // 0x268
	char bIsPlaying : 1; // 0x278
	char bReversePlayback : 1; // 0x278
	char bPaused : 1; // 0x278
	char bPendingStop : 1; // 0x278
	float InterpPosition; // 0x27c
	char ReplicationForceIsPlaying; // 0x284
	FScriptMulticastDelegate OnPlay; // 0x288
	FScriptMulticastDelegate OnStop; // 0x298
	FScriptMulticastDelegate OnPause; // 0x2a8
};

struct UTextLayoutWidget {
	FShapedTextOptions ShapedTextOptions; // 0x108
	ETextJustify Justification; // 0x10b
	ETextWrappingPolicy WrappingPolicy; // 0x10c
	char AutoWrapText : 1; // 0x10d
	float WrapTextAt; // 0x110
	FMargin Margin; // 0x114
	float LineHeightPercentage; // 0x124
};

struct UParticleModulePivotOffset {
	FVector2D PivotOffset; // 0x30
};

struct UParticleModuleLocationSkelVertSurface {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct UMaterialExpressionScreenPosition {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UMM_Popup_Restore_Exp {
	UMM_Common_Btn_Symbol* m_pBtnClose; // 0x2f8
	UMM_Common_Btn* m_pBtnRestore; // 0x300
	UMM_Common_Btn_Cost* m_pBtnRestore_Item; // 0x308
	UMirTextBlock* m_pTxtTitle; // 0x310
	UMirTextBlock* m_pTxtTab_General; // 0x318
	UMirTextBlock* m_pTxtTab_Advanced; // 0x320
	UMirTextBlock* m_pTxtNum; // 0x328
	UMirTextBlock* m_pTxtRate; // 0x330
	UMirCheckBox* m_pBtnTab_General; // 0x338
	UMirCheckBox* m_pBtnTab_Advanced; // 0x340
	UMirScrollBox* m_pScrollList; // 0x348
	UMM_Common_Board_Notice* m_pEmptyNoticeBoard; // 0x350
};

struct UMovieSubtitleData {
	TArray<FMovieSubtitleInfo> SubtitleDataList; // 0x30
};

struct UMM_TotalQuickSlot_Potion {
	int32_t OpenShopBuyID; // 0x2f0
	UMM_GameOption_Slider* m_pHPAutoPercent; // 0x2f8
	UMM_GameOption_Slider* m_pMPAutoPercent; // 0x300
	UMirButton* m_pBtnOpenShop; // 0x308
	UMirButton* m_pBtnSortGrade; // 0x310
	UMirImage* m_pImgSortGrade_Up; // 0x318
	UMirImage* m_pImgSortGrade_Down; // 0x320
	UMM_SharedScrollBox* m_pScrollBox_ItemSlot; // 0x330
	UMirTextBlock* m_pTxtItemName; // 0x338
	UMM_Common_Btn* m_pBtnUseItem; // 0x340
	UMM_Common_Board_Notice* m_pCommNotice; // 0x348
	UMirTextBlock* m_pTxtShop; // 0x350
	UMirTextBlock* m_pTxtSortGrade; // 0x358
};

struct UMM_Dungeon_List_Slot {
	int32_t NeedLvStrID; // 0x2f0
	float NormalOpacity; // 0x2f4
	float DisableOpacity; // 0x2f8
	UMirTextBlock* Txt_Title; // 0x300
	UMirImage* Img_Thumbnail; // 0x308
	UMirImage* Img_Lock; // 0x310
	UMirImage* Img_DisableBG; // 0x318
	UMirImage* Img_Select; // 0x320
	UMirImage* Img_Indicaotr; // 0x328
	UMirImage* Img_QuestIcon; // 0x330
	UMirTextBlock* txt_level; // 0x338
	UMirTextBlock* Txt_LevelNum; // 0x340
	UMirRichTextBlock* Txt_NeedLevel; // 0x348
	UMirImage* ImgBossIcon; // 0x350
	UMirImage* imgBattle; // 0x358
};

struct UMM_SpecialAbility {
	UPanelWidget* m_SpecialAbilityGrid; // 0x2e0
	UMirTextBlock* m_SpecialAbilityName; // 0x2e8
	UMirRichTextBlock* m_SpecialAbilityDesc; // 0x2f0
	int32_t m_SkillPassiveID; // 0x2f8
	int32_t STR_MSGID_PASSIVE; // 0x2fc
};

struct UMovieSceneFloatTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UInterpFilter {
	FString Caption; // 0x28
};

struct UGameplayTask_TimeLimitedExecution {
	FScriptMulticastDelegate OnFinished; // 0x68
	FScriptMulticastDelegate OnTimeExpired; // 0x78
};

struct UParticleModuleSizeBase {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct USynthComponent {
	char bAutoDestroy : 1; // 0x220
	char bStopWhenOwnerDestroyed : 1; // 0x220
	char bAllowSpatialization : 1; // 0x220
	char bOverrideAttenuation : 1; // 0x220
	char bOutputToBusOnly : 1; // 0x224
	USoundAttenuation* AttenuationSettings; // 0x228
	FSoundAttenuationSettings AttenuationOverrides; // 0x230
	USoundConcurrency* ConcurrencySettings; // 0x520
	TSet<USoundConcurrency*> ConcurrencySet; // 0x528
	USoundClass* SoundClass; // 0x578
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x580
	USoundSubmix* SoundSubmix; // 0x588
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x590
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x5a0
	FSoundModulation Modulation; // 0x5b0
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x5c0
	char bIsUISound : 1; // 0x5d0
	char bIsPreviewSound : 1; // 0x5d0
	int32_t EnvelopeFollowerAttackTime; // 0x5d4
	int32_t EnvelopeFollowerReleaseTime; // 0x5d8
	FScriptMulticastDelegate OnAudioEnvelopeValue; // 0x5e0
	USynthSound* Synth; // 0x610
	UAudioComponent* AudioComponent; // 0x618
};

struct USceneCaptureTool {
	TWeakObjectPtr<ADirectionalLight> DirLight; // 0x2e0
	USceneCaptureTool_Slider* Slider_CameraRotator; // 0x2e8
	USceneCaptureTool_Slider* Slider_DirLight; // 0x2f0
	UComboBoxString* ComboBox_ChangePC; // 0x2f8
	UComboBoxString* ComboBox_ChangeUI; // 0x300
	UButton* Btn_Reset_01; // 0x308
	UButton* Btn_Reset_02; // 0x310
	UButton* Btn_Reset_03; // 0x318
	UButton* Btn_Save_01; // 0x320
	UButton* Btn_Save_02; // 0x328
	UButton* Btn_Save_03; // 0x330
	UMirTextBlock* Txt_Location; // 0x338
	UMirTextBlock* Txt_Rotator; // 0x340
	UMirTextBlock* Txt_FOV; // 0x348
	UMirTextBlock* Txt_Sensitivity; // 0x350
	USlider* Slider_Opacity; // 0x358
	UMirTextBlock* Txt_Opacity; // 0x360
};

struct UMM_DungeonCommonTitle3 {
	UMirImage* imgBoss[0x5]; // 0x2e0
};

struct UMM_GM_Msg {
	float m_fMoveSpeed; // 0x2f0
	float m_fShowTime; // 0x2f4
	UMirRichTextBlock* m_RTxt_Message; // 0x2f8
	UMirCanvasPanel* m_pPanelArea; // 0x300
	UMirImage* m_Img_Bg; // 0x308
};

struct UAIResource_Logic {
	int32_t ManualResourceID; // 0x28
	uint8_t AutoResourceID; // 0x2c
	char bManuallySetID : 1; // 0x30
};

struct UAnimBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x308
	USkeleton* TargetSkeleton; // 0x318
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x320
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x330
	TArray<FName> SyncGroupNames; // 0x400
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x410
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x420
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x470
};

struct UPaperFlipbookComponent {
	UPaperFlipbook* SourceFlipbook; // 0x440
	UMaterialInterface* Material; // 0x448
	float PlayRate; // 0x450
	char bLooping : 1; // 0x454
	char bReversePlayback : 1; // 0x454
	char bPlaying : 1; // 0x454
	float AccumulatedTime; // 0x458
	int32_t CachedFrameIndex; // 0x45c
	FLinearColor SpriteColor; // 0x460
	UBodySetup* CachedBodySetup; // 0x470
	FScriptMulticastDelegate OnFinishedPlaying; // 0x478
};

struct UMM_CrowdControlComponent {
	AMM_CharacterPawnBase* m_pCharBase; // 0xb0
	TMap<int32_t, FCrowdControlData> m_mapCCData; // 0xb8
};

struct UNavigationInvokerComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct UMM_SiegeObserver_Situationboard {
	UMM_Occupation_Minimap* m_SiegeMinimap; // 0x300
	UMM_Occupation_BattleFieldInfo* m_SiegeBattleFieldInfo; // 0x308
	UMirTextBlock* m_Txt_Offense_CombatPoint; // 0x310
	UMirTextBlock* m_Txt_Defense_CombatPoint; // 0x318
	UMirImage* m_Img_Offense_CombatPoint; // 0x320
	UMirProgressBar* m_Progress_Defense_CombatPoint; // 0x328
	UMirTextBlock* m_Txt_Offense_Warrior; // 0x330
	UMirTextBlock* m_Txt_Defense_Warrior; // 0x338
	UMirImage* m_Img_Offense_Warrior; // 0x340
	UMirProgressBar* m_Progress_Defense_Warrior; // 0x348
	UMirTextBlock* m_Txt_Offense_Magician; // 0x350
	UMirTextBlock* m_Txt_Defense_Magician; // 0x358
	UMirImage* m_Img_Offense_Magician; // 0x360
	UMirProgressBar* m_Progress_Defense_Magician; // 0x368
	UMirTextBlock* m_Txt_Offense_Taoist; // 0x370
	UMirTextBlock* m_Txt_Defense_Taoist; // 0x378
	UMirImage* m_Img_Offense_Taoist; // 0x380
	UMirProgressBar* m_Progress_Defense_Taoist; // 0x388
	UMirTextBlock* m_Txt_Offense_Assassin; // 0x390
	UMirTextBlock* m_Txt_Defense_Assassin; // 0x398
	UMirImage* m_Img_Offense_Assassin; // 0x3a0
	UMirProgressBar* m_Progress_Defense_Assassin; // 0x3a8
	UMirTextBlock* m_Txt_Offense_Berserker; // 0x3b0
	UMirTextBlock* m_Txt_Defense_Berserker; // 0x3b8
	UMirImage* m_Img_Offense_Berserker; // 0x3c0
	UMirProgressBar* m_Progress_Defense_Berserker; // 0x3c8
};

struct APatchActor {
	int32_t m_iActiveDownloadPakMax; // 0x390
	UMM_PatchWidget* m_PatchWidget; // 0x3c0
	AMiniGame_ManagerActor* m_MiniGameActor; // 0x3f0
};

struct AGuardNpcEnterCheckTrigger {
	AGuardNpcSpawnTrigger* m_pFriendNpcTrigger; // 0x288
	UBoxComponent* m_pBoxCollision; // 0x290
	AActor* m_pDelayInitActor; // 0x298
};

struct UWidgetNavigation {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x4c
	FWidgetNavigationData Left; // 0x70
	FWidgetNavigationData Right; // 0x94
	FWidgetNavigationData Next; // 0xb8
	FWidgetNavigationData Previous; // 0xdc
};

struct UMM_Customizing_Preset {
	UVerticalBox* m_pVerticalBox; // 0x2e0
	UWrapBox* m_pWrapBox; // 0x2e8
	TArray<UMM_Customizing_PresetItem*> m_PresetArray; // 0x2f0
};

struct ADebugCameraHUD {
	APlayerController* PlayerOwner; // 0x218
	char bLostFocusPaused : 1; // 0x220
	char bShowHUD : 1; // 0x220
	char bShowDebugInfo : 1; // 0x220
	int32_t CurrentTargetIndex; // 0x224
	char bShowHitBoxDebugInfo : 1; // 0x228
	char bShowOverlays : 1; // 0x228
	char bEnableDebugTextShadow : 1; // 0x228
	TArray<AActor*> PostRenderedActors; // 0x230
	TArray<FName> DebugDisplay; // 0x248
	TArray<FName> ToggledDebugCategories; // 0x258
	UCanvas* Canvas; // 0x268
	UCanvas* DebugCanvas; // 0x270
	TArray<FDebugTextInfo> DebugTextList; // 0x278
	AActor* ShowDebugTargetDesiredClass; // 0x288
	AActor* ShowDebugTargetActor; // 0x290
};

struct UPaperTileSet {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct UMM_Popup_Addressbook_TabSlot {
	int32_t STRING_TAB_NAME_ID; // 0x2f0
	EMail_AddressbookTab ETabType; // 0x2f4
	UMirImage* m_Img_Selected; // 0x2f8
	UMirTextBlock* m_Txt_TabName; // 0x300
	UMirButton* m_Btn_Main; // 0x308
};

struct UMM_Popup_Contents_Notice {
	float m_fShowTime; // 0x2e0
	UWidgetAnimation* m_AniStart; // 0x2e8
	UWidgetAnimation* m_AniEnd; // 0x2f0
	UMirImage* m_Img_Symbol; // 0x308
	UMirTextBlock* m_Txt_Title; // 0x310
	UMirTextBlock* m_Txt_Description; // 0x318
};

struct UMM_DominionWanted_Slot {
	UMirImage* m_Img_CharacterClass; // 0x2e8
	UMirTextBlock* m_Txt_CharacterName; // 0x2f0
	UMirTextBlock* m_Txt_CombatPoint; // 0x2f8
	UMirImage* m_pImgOnline; // 0x300
	UMirTextBlock* m_TxtOnline; // 0x308
	UMM_GuildIcon* m_GuildIcon; // 0x310
	UMirTextBlock* m_Txt_GuildName; // 0x318
	UMirTextBlock* m_Txt_GuildEmpty; // 0x320
	UMirImage* m_Img_RewardCost; // 0x328
	UMirTextBlock* m_Txt_RewardCost; // 0x330
	UWidgetSwitcher* m_WidgetSwitcher_Chase; // 0x338
	UMirTextBlock* m_Txt_RemainTime; // 0x340
	UMirImage* m_Img_Disable; // 0x348
	UMirButton* m_pBtnClick; // 0x350
};

struct UMM_Item_Make_Special_Popup {
	UMirTextBlock* m_Txt_None; // 0x2f0
	UMirTextBlock* m_Item_Name; // 0x2f8
	UMM_Common_Btn* m_Regist_Complete_Btn; // 0x300
	UMM_Common_Btn_Symbol* m_Close_Btn; // 0x308
	TArray<UMM_MakeItem_Slot_Special*> m_Material_Slot_Array; // 0x310
	UMM_SharedScrollBox* m_ScrollBox; // 0x320
	TArray<UMM_Slot_Inventory*> InventoryList; // 0x328
	uint32_t mMakeItemID; // 0x338
	uint32_t SPECIAL_MATERIAL_TITLE_NAME; // 0x33c
	uint32_t SPECIAL_MATERIAL_WEAPON; // 0x340
	uint32_t SPECIAL_MATERIAL_ARMOR; // 0x344
	uint32_t SPECIAL_MATERIAL_ACCESSORY; // 0x348
};

struct UMM_RelationQuestMsg {
	UMirImage* m_Img_Icon; // 0x318
	UMirImage* m_Img_Rare_Icon; // 0x320
	UMirImage* m_Img_Hero_Icon; // 0x328
	UMirImage* m_Img_Legend_Icon; // 0x330
};

struct UMaterialExpressionDecalDerivative {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UAITask {
	AAIController* OwnerController; // 0x68
};

struct ALightmassPortal {
	ULightmassPortalComponent* PortalComponent; // 0x218
};

struct UParticleModuleParameterBase {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct AMonsterMoveTrigger {
	int32_t m_MonsterOrderID; // 0x278
	TArray<AMM_Monster*> m_MonsterArray; // 0x280
};

struct UCompositeCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct ACameraControlBase {
	ECollisionChannel ProbeChannel; // 0x780
	float StartCollisionGap; // 0x784
	float CollisionSphere; // 0x788
	float CollisionPullSpeed; // 0x78c
	float CollisionReturnSpeed; // 0x790
	bool m_bDoCollision; // 0x794
	UMaterialParameterCollection* DarkChangeCollection; // 0x898
	UMaterialParameterCollection* FlyDashCollection; // 0x8a0
	TArray<UParticleSystem*> m_pFlyDashParticle; // 0x8a8
};

struct UMM_B_XdracoSealing {
	UMM_Common_Board_Notice* m_pNotice; // 0x2f0
	UMM_CommonHorizontalTabSet* m_pMainMenuTab; // 0x2f8
	UMM_CommonVerticalTabSet* m_pSubMenuTab; // 0x300
	UMM_Common_ToggleBtn* m_pToggle_MakeFilter; // 0x308
	UCanvasPanel* m_pPanel_SealingInvenRect; // 0x310
	UMM_Xdraco_SealingInventory* m_pSealing_List; // 0x318
	UMM_Xdraco_SealingInfo* m_pSealing_Info; // 0x320
};

struct UMaterialExpressionCustomOutput {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UAnimSequence {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd0
	EAdditiveAnimationType AdditiveAnimType; // 0x1a8
	EAdditiveBasePoseType RefPoseType; // 0x1a9
	UAnimSequence* RefPoseSeq; // 0x1b0
	int32_t RefFrameIndex; // 0x1b8
	FName RetargetSource; // 0x1bc
	EAnimInterpolationType Interpolation; // 0x1c4
	bool bEnableRootMotion; // 0x1c5
	ERootMotionRootLock RootMotionRootLock; // 0x1c6
	bool bForceRootLock; // 0x1c7
	bool bUseNormalizedRootMotionScale; // 0x1c8
	bool bRootMotionSettingsCopiedFromMontage; // 0x1c9
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x1d0
};

struct UTexture {
	FGuid LightingGuid; // 0x48
	int32_t LODBias; // 0x58
	TextureCompressionSettings CompressionSettings; // 0x5c
	TextureFilter Filter; // 0x5d
	ETextureMipLoadOptions MipLoadOptions; // 0x5e
	TextureGroup LODGroup; // 0x5f
	char SRGB : 1; // 0x60
	char bNoTiling : 1; // 0x60
	char VirtualTextureStreaming : 1; // 0x60
	char CompressionYCoCg : 1; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x68
};

struct AWindDirectionalSource {
	UWindDirectionalSourceComponent* Component; // 0x218
};

struct UMM_HudBtnAction {
	TArray<FBrushObject> m_arrBrushActionBG; // 0x2e0
	TArray<FBrushObject> m_arrBrushAction; // 0x2f0
	FLinearColor m_CooltimeColorOpacity; // 0x300
	bool m_OnRoundCoolTime; // 0x310
	UWidgetAnimation* m_AniPress; // 0x318
	int32_t m_iEffectID_Open; // 0x320
	int32_t m_iEffectID_Continue; // 0x324
	int32_t m_iEffectID_EndCooltime; // 0x328
	int32_t m_iEffectID_UseOK; // 0x32c
	int32_t m_iEffectID_Touched; // 0x330
	UImage* m_pImgActionBG; // 0x338
	UImage* m_pImgAction; // 0x340
	UImage* m_pImgCooltime; // 0x348
	UMirButton* m_pBtnAction; // 0x350
	UPanelWidget* m_pGridEffect; // 0x358
	UEffectWidgetBase* m_pContinueEffect; // 0x360
	UEffectWidgetBase* m_pEndCooltimeEffect; // 0x368
	UImage* m_pImg_RoundCooltime; // 0x380
	UPanelWidget* m_pGrd_RoundCooltime; // 0x388
};

struct UMaterialExpressionTruncate {
	FExpressionInput Input; // 0x40
};

struct UMM_Collect_TierList {
	int32_t m_TierStrID; // 0x2e0
	int32_t m_AllStrID; // 0x2e4
	int32_t m_OneTierStrID; // 0x2e8
	int32_t m_TwoTierStrID; // 0x2ec
	int32_t m_ThreeTierStrID; // 0x2f0
	int32_t m_FourTierStrID; // 0x2f4
	UMirTextBlock* m_Txt_Title; // 0x2f8
	UMM_Auction_Enchant_ComboList* m_CollectTierList; // 0x300
};

struct AMM_MainPC {
	APlayerController* m_pPlayerController; // 0xc08
	UObject* m_pRefVehicleMesh; // 0xc10
	UObject* m_pRefVehicleAnimBP; // 0xc18
	UParticleSystemComponent* m_TargetLockOnEffect; // 0xc20
	UParticleSystemComponent* m_pSharedTargetEffect; // 0xc28
	float NearAttackRange; // 0xc98
	AMM_AutoBehaviorAIController* m_pAutoBehaviorAIController; // 0xcd0
	bool isWallOverlap; // 0xd36
	UMM_GhostTrailComponent* m_GhostComponet; // 0xdc0
	UMM_GuideDecalComponent* GuideDecalComponent; // 0xdc8
	UParticleSystemComponent* SubTargetLineEffect; // 0xeb0
	UParticleSystemComponent* MainTargetLineEffect; // 0xeb8
	EAutoMoveState OldAutoMoveState; // 0xec0
	EAutoMoveState CurrentAutoMoveState; // 0xec1
	EBehaviorType OldBehaviorType; // 0xecf
	EBehaviorType BehaviorType; // 0xed0
	float DarkTime; // 0xee0
	UCurveFloat* DarkCurve; // 0xee8
};

struct UMM_ItemSynthesis {
	int32_t STRING_ID_GREAT_SUCCESS; // 0x2f0
	int32_t STRING_ID_SUCCESS; // 0x2f4
	TArray<int32_t> arICON_ITEM_GRADE; // 0x2f8
	FLinearColor AURAEFFECT_COLOR_GRADE_EPIC; // 0x308
	FLinearColor AURAEFFECT_COLOR_GRADE_LEGNED; // 0x318
	int32_t STRING_ID_POINT_DEACTIVE; // 0x328
	int32_t STRING_ID_POINT_LACK; // 0x32c
	int32_t STRING_ID_POINT_ENOUGH; // 0x330
	int32_t STRING_ID_CENSER_NAME_NONE; // 0x334
	int32_t STRING_ID_CENSER_NAME_EPIC; // 0x338
	int32_t STRING_ID_CENSER_NAME_LEGNED; // 0x33c
	UMM_ItemSynthesis_List* m_arItemSynthesisList[0xa]; // 0x340
	UMM_Common_Btn* m_C_Btn_AutoReg; // 0x390
	UMM_Common_Btn* m_C_Btn_Make; // 0x398
	UMirTextBlock* m_Txt_Desc; // 0x3a0
	UMirCanvasPanel* m_Can_Censer; // 0x3a8
	UMirCanvasPanel* m_Can_AuraEffect; // 0x3b0
	UMirCanvasPanel* m_Can_ItemGrade_Effect; // 0x3b8
	UMirImage* m_Img_IcnItemGrade; // 0x3c0
	UMirImage* m_Img_AuraEffect_Left; // 0x3c8
	UMirImage* m_Img_AuraEffect_Right; // 0x3d0
	UMirButton* m_Btn_PointReward; // 0x3d8
	UMirRichTextBlock* m_RTxt_Point; // 0x3e0
	UMirTextBlock* m_Txt_Desc_2; // 0x3e8
	UMirRichTextBlock* m_RTxt_CenserGrade; // 0x3f0
	UMirImage* m_Img_CenserHead; // 0x3f8
	UMirImage* m_Img_CenserBody; // 0x400
	UMirImage* m_Img_Indicator; // 0x408
	UImage* m_Img_ItemGrade_Epic; // 0x410
	UImage* m_Img_ItemGrade_Legned; // 0x418
	UMirScrollBox* m_ScrollBox; // 0x420
	UWidgetAnimation* m_AniPointUP; // 0x428
};

struct UMaterialExpressionRuntimeVirtualTextureOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
};

struct UMM_PopupExpBooster {
	UMirTextBlock* Txt_Title; // 0x2e0
	UMirRichTextBlock* txt_time; // 0x2e8
	UMirRichTextBlock* txt_2; // 0x2f0
	UMirTextBlock* txt_exp_booster; // 0x2f8
	UMirRichTextBlock* txt_active; // 0x300
	UMM_Common_Btn_Symbol* btn_close; // 0x308
	UMirScrollBox* sb_status; // 0x310
	UMM_Common_Btn* btn_go_to_shop; // 0x318
};

struct UPopup_DungeonReward_Info3 {
	UMirTextBlock* txtDifficulty; // 0x2e0
	UMirImage* arImgDifficultStar[0x5]; // 0x2e8
	UMirTextBlock* txtFixedDeadNum; // 0x310
	UMirTextBlock* txtDeadNum; // 0x318
	UMirCanvasPanel* canReward; // 0x320
};

struct UStreamableRenderAsset {
	double ForceMipLevelsToBeResidentTimestamp; // 0x28
	int32_t NumCinematicMipLevels; // 0x30
	int32_t StreamingIndex; // 0x34
	int32_t CachedCombinedLODBias; // 0x38
	char CachedNumResidentLODs; // 0x3c
	char bCachedReadyForStreaming : 1; // 0x3d
	char NeverStream : 1; // 0x3d
	char bGlobalForceMipLevelsToBeResident : 1; // 0x3d
	char bIsStreamable : 1; // 0x3d
	char bHasStreamingUpdatePending : 1; // 0x3d
	char bForceMiplevelsToBeResident : 1; // 0x3d
	char bIgnoreStreamingMipBias : 1; // 0x3d
	char bUseCinematicMipLevels : 1; // 0x3d
};

struct UStaticMeshComponent {
	int32_t ForcedLodModel; // 0x440
	int32_t PreviousLODLevel; // 0x444
	int32_t MinLOD; // 0x448
	int32_t SubDivisionStepSize; // 0x44c
	UStaticMesh* StaticMesh; // 0x450
	FColor WireframeColorOverride; // 0x458
	char bEvaluateWorldPositionOffset : 1; // 0x45c
	char bOverrideWireframeColor : 1; // 0x45c
	char bOverrideMinLOD : 1; // 0x45c
	char bOverrideNavigationExport : 1; // 0x45c
	char bForceNavigationObstacle : 1; // 0x45c
	char bDisallowMeshPaintPerInstance : 1; // 0x45c
	char bIgnoreInstanceForTextureStreaming : 1; // 0x45c
	char bOverrideLightMapRes : 1; // 0x45c
	char bCastDistanceFieldIndirectShadow : 1; // 0x45d
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x45d
	char bUseSubDivisions : 1; // 0x45d
	char bUseDefaultCollision : 1; // 0x45d
	char bForceReceiveCSMForLM : 1; // 0x45d
	char bReverseCulling : 1; // 0x45d
	int32_t OverriddenLightMapRes; // 0x460
	float DistanceFieldIndirectShadowMinVisibility; // 0x464
	float DistanceFieldSelfShadowBias; // 0x468
	float StreamingDistanceMultiplier; // 0x46c
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x470
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x480
	FLightmassPrimitiveSettings LightmassSettings; // 0x490
};

struct UMM_Achievement_Option_Slot {
	UMirTextBlock* Txt_OptionName; // 0x2e0
	UMirTextBlock* Txt_OptionValue; // 0x2e8
};

struct UMM_Common_GuideBtn {
	int32_t GuideId; // 0x2f0
	bool UseAutoContentsType; // 0x2f4
	UMirButton* m_Btn_Main; // 0x2f8
	UMirImage* m_Img_Icon; // 0x300
};

struct UMMUIDirectionalLightComponent {
	UMaterialParameterCollection* UICharacterMaterialParameterCollection; // 0x220
	FColor LightColor; // 0x228
	float LightIntensity; // 0x22c
	bool IsSecondLight; // 0x230
};

struct UParticleModuleMeshRotationRateOverLife {
	FRawDistributionVector RotRate; // 0x30
	char bScaleRotRate : 1; // 0x78
};

struct UMM_HudMagicSquareMenu {
	int32_t m_iStringID_BtnExit; // 0x2f0
	int32_t m_iStringID_BtnCancel; // 0x2f4
	int32_t m_iStringID_ExitMessage; // 0x2f8
	int32_t m_iStringID_TimerNotiTitle; // 0x2fc
	int32_t m_iStringID_TimerNotiMessage; // 0x300
	int32_t m_iStringID_Move; // 0x304
	int32_t m_iNextMoveEffectID; // 0x308
	ULimitTimerWidget* m_pLimitTimerWidget; // 0x310
	UCanvasPanel* canNextMove; // 0x318
	UCanvasPanel* canExit; // 0x320
	UCanvasPanel* canDrop; // 0x328
	UCanvasPanel* canInfo; // 0x330
	UButton* m_pBtn_NextMove; // 0x338
	UButton* m_pBtn_Exit; // 0x340
	UMirTextBlock* m_pTextChangeTimer; // 0x348
	UButton* m_pBtn_Info; // 0x350
	UMM_Common_Btn_Symbol* m_pBtn_Drop; // 0x358
	UPanelWidget* m_pGridEffect; // 0x360
	UEffectWidgetBase* m_pEffectNextMove; // 0x368
	UMirButton* btnAddTime; // 0x370
	UWidgetAnimation* aniRotation; // 0x378
};

struct APrecomputedVisibilityVolume {
	EBrushType BrushType; // 0x218
	FColor BrushColor; // 0x21c
	int32_t PolyFlags; // 0x220
	char bColored : 1; // 0x224
	char bSolidWhenSelected : 1; // 0x224
	char bPlaceableFromClassBrowser : 1; // 0x224
	char bNotForClientOrServer : 1; // 0x224
	UModel* Brush; // 0x228
	UBrushComponent* BrushComponent; // 0x230
	char bInManipulation : 1; // 0x238
	TArray<FGeomSelection> SavedSelections; // 0x240
};

struct UInterpTrackInstMove {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UDistributionVectorUniformCurve {
	FInterpCurveTwoVectors ConstantCurve; // 0x38
	char bLockAxes1 : 1; // 0x50
	char bLockAxes2 : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x56
	char bUseExtremes : 1; // 0x5c
};

struct UMaterialExpressionSceneDepth {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput Coordinates; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct ASkeletalMeshActor {
	char bShouldDoAnimNotifies : 1; // 0x220
	char bWakeOnLevelStart : 1; // 0x220
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x228
	USkeletalMesh* ReplicatedMesh; // 0x230
	UPhysicsAsset* ReplicatedPhysAsset; // 0x238
	UMaterialInterface* ReplicatedMaterial0; // 0x240
	UMaterialInterface* ReplicatedMaterial1; // 0x248
};

struct USoundNodeAssetReferencer {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UMaterialExpressionParticleColor {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct USoundNodeQualityLevel {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UMM_CheckBox_Switch {
	UWidgetSwitcher* m_WidgetSwitcher; // 0x2f0
	UMirButton* m_Btn_Main; // 0x2f8
	UMirImage* m_ImgOn; // 0x300
	UMirImage* m_ImgOff; // 0x308
	UMirTextBlock* m_Txt_On; // 0x310
	UMirTextBlock* m_Txt_Off; // 0x318
	ESwitchBox m_ESwitchStatus; // 0x320
};

struct UMM_Hud_ServerVisitMenu {
	UCanvasPanel* m_CanvasPanel; // 0x2f0
	UTextBlock* m_Txt_LimitTime; // 0x2f8
	UTextBlock* m_Txt_Time; // 0x300
	UTextBlock* m_Txt_LifeCount; // 0x308
	UButton* m_Btn_Exit; // 0x310
	UButton* m_Btn_ShowVisitMembers; // 0x318
	UButton* m_Btn_ShowWaypoints; // 0x320
	UWidgetAnimation* m_Ani_Limit_Loop; // 0x328
};

struct UMovieSceneBoolSection {
	bool DefaultValue; // 0xe0
	FMovieSceneBoolChannel BoolCurve; // 0xe8
};

struct UBrushComponent {
	UModel* Brush; // 0x418
	UBodySetup* BrushBodySetup; // 0x420
};

struct UMovieSceneParticleSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe0
};

struct ULevelCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UMM_B_MagicStone {
	UMM_NewInventory_MagicStone* inventory; // 0x2f0
	UMM_Common_Btn* btn_equip; // 0x2f8
	UMM_Common_Btn* btn_go_to_compose; // 0x300
	UMM_MagicStoneEquip* magic_stone_equip; // 0x308
	UMM_Popup_MagicStone_Attribute* popup_attribute; // 0x310
	UMM_SortListBtn* btn_sort; // 0x318
	UMM_MagicStoneDetailInfo* detail_info; // 0x320
	UMirTextBlock* txt_select_deckIndex; // 0x328
	UMirTextBlock* txt_select_deck; // 0x330
	UMirTextBlock* txt_forge; // 0x338
	UMirButton* btn_deck; // 0x340
	UMirButton* btn_transcend; // 0x348
	UVerticalBox* transcend_slot; // 0x350
	UMM_MagicStoneQuickTab* quick_tab; // 0x358
	UMirCanvasPanel* cp_quick_tab; // 0x360
	UMirCanvasPanel* cp_quick_tab_bg; // 0x368
};

struct UMM_Exchange_Tab_HorizonBtn {
	UMirTextBlock* m_Txt_TabName; // 0x2f0
	UMirImage* m_Img_Selected; // 0x2f8
	UMirButton* m_Btn_Main; // 0x300
	UTutorialHighlightWidget* m_TutorialHighLight; // 0x308
};

struct UParticleModuleSize_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UMM_PopupGuildGiveOtherSlot {
	UMirTextBlock* txt_relation; // 0x2e0
	UMirImage* img_online; // 0x2e8
	UMM_GuildMemberPortrait* Portrait; // 0x2f0
	UMirTextBlock* txt_nickname; // 0x2f8
	UMirTextBlock* txt_custom_title; // 0x300
	UMirTextBlock* txt_level; // 0x308
	UMirImage* img_class; // 0x310
	UMirTextBlock* txt_class; // 0x318
	UMirTextBlock* txt_combat_power; // 0x320
	UMirButton* btn_select; // 0x328
	UMirImage* img_guild_symbol; // 0x330
	UMirImage* img_guild_frame; // 0x338
	UMirTextBlock* txt_guild_name; // 0x340
	UMirCheckBox* cb_selected; // 0x348
};

struct UMM_UserEvent_Tab_Slot {
	UMirCanvasPanel* m_Can_Tab; // 0x2f0
	UMM_UserEvent_WebBanner* m_WebBanner; // 0x2f8
	UMirTextBlock* m_Txt_Name; // 0x300
	UMirImage* m_Img_Thumb; // 0x308
	UMirImage* m_Img_Alarm; // 0x310
	UMirImage* m_Img_Selected; // 0x318
	UMirImage* m_Img_Banner; // 0x320
	UMirButton* m_Btn_Main; // 0x328
};

struct USoundNodeWavePlayer {
	USoundWave* SoundWaveAssetPtr; // 0x40
	USoundWave* SoundWave; // 0x68
	char bLooping : 1; // 0x70
};

struct UComboWidget {
	FLinearColor Color_2; // 0x910
	FLinearColor Color_11; // 0x920
	FLinearColor Color_101; // 0x930
	FSlateBrush Number_1; // 0x940
	FSlateBrush Number_2; // 0x9c8
	FSlateBrush Number_3; // 0xa50
	FSlateBrush Number_4; // 0xad8
	FSlateBrush Number_5; // 0xb60
	FSlateBrush Number_6; // 0xbe8
	FSlateBrush Number_7; // 0xc70
	FSlateBrush Number_8; // 0xcf8
	FSlateBrush Number_9; // 0xd80
	FSlateBrush Number_10; // 0xe08
	UWidgetAnimation* m_pAnimFadeIn; // 0xe90
	UWidgetAnimation* m_pAnimChangeNum; // 0xe98
	UWidgetAnimation* m_pAnimFadeOut; // 0xea0
	UMirImage* m_Img_Combo; // 0xee8
};

struct UListView {
	EOrientation Orientation; // 0x7c8
	ESelectionMode SelectionMode; // 0x7c9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x7ca
	bool bClearSelectionOnClick; // 0x7cb
	bool bIsFocusable; // 0x7cc
	float EntrySpacing; // 0x7d0
	bool bReturnFocusToSelection; // 0x7d4
	TArray<UObject*> listItems; // 0x7d8
	FScriptMulticastDelegate BP_OnEntryInitialized; // 0x7f8
	FScriptMulticastDelegate BP_OnItemClicked; // 0x808
	FScriptMulticastDelegate BP_OnItemDoubleClicked; // 0x818
	FScriptMulticastDelegate BP_OnItemIsHoveredChanged; // 0x828
	FScriptMulticastDelegate BP_OnItemSelectionChanged; // 0x838
	FScriptMulticastDelegate BP_OnItemScrolledIntoView; // 0x848
};

struct UMM_Costume_SlideBar {
	float SLIDER_MAX_SIZE; // 0x2f0
	float SliderCorrectionValue; // 0x2f4
	ESLIDEBAR_TYPE SlideBar_Channel; // 0x2f8
	UMirButton* Btn_Minus; // 0x300
	UMirButton* Btn_Plus; // 0x308
	UMM_UI_Drag* UIDrag_Slide; // 0x310
	UMirTextBlock* Txt_Value; // 0x318
	UCanvasPanel* m_SliderBG_Parent; // 0x320
	USpacer* m_SliderBG; // 0x328
	int32_t m_SliderValue; // 0x330
	float m_ControlPosX; // 0x334
	float m_ControlRatio; // 0x338
	int32_t AddBtnValue; // 0x33c
	float AddValueUpdateTime; // 0x340
	bool Btn_Pressed_Down; // 0x344
	bool Btn_Pressed_Up; // 0x345
	int32_t STR_PERCENT; // 0x348
};

struct UMM_Popup_Auto_OptionChange {
	UMM_Common_Btn_Symbol* m_pBtn_Close; // 0x318
	UHorizontalBox* m_pGrade1Box; // 0x320
	UHorizontalBox* m_pGrade2Box; // 0x328
	UHorizontalBox* m_pGrade3Box; // 0x330
	UMM_Common_Btn_Symbol* m_pBtn_Box1_Decrease; // 0x338
	UMM_Common_Btn_Symbol* m_pBtn_Box1_Increase; // 0x340
	UMM_Common_Btn_Symbol* m_pBtn_Box2_Decrease; // 0x348
	UMM_Common_Btn_Symbol* m_pBtn_Box2_Increase; // 0x350
	UMM_Common_Btn_Symbol* m_pBtn_Box3_Decrease; // 0x358
	UMM_Common_Btn_Symbol* m_pBtn_Box3_Increase; // 0x360
	UMirImage* m_pImg_Box1_Grade; // 0x368
	UMirImage* m_pImg_Box2_Grade; // 0x370
	UMirImage* m_pImg_Box3_Grade; // 0x378
	UMirTextBlock* m_pTxt_Box1_GradeCount; // 0x380
	UMirTextBlock* m_pTxt_Box2_GradeCount; // 0x388
	UMirTextBlock* m_pTxt_Box3_GradeCount; // 0x390
	UMirImage* m_pImg_Material1; // 0x398
	UMirImage* m_pImg_Material2; // 0x3a0
	UMirImage* m_pImg_Material3; // 0x3a8
	UMirTextBlock* m_pTxt_MaterialCount1; // 0x3b0
	UMirTextBlock* m_pTxt_MaterialCount2; // 0x3b8
	UMirTextBlock* m_pTxt_MaterialCount3; // 0x3c0
	UMM_Item_Make_Slider* m_pNumInput; // 0x3c8
	UMM_Common_Btn* m_pBtn_StartOptionChange; // 0x3d0
	UMirTextBlock* m_pTxt_Info; // 0x3d8
};

struct UBTDecorator_ReachedMoveGoal {
	char bInverseCondition : 1; // 0x60
	EBTFlowAbortMode FlowAbortMode; // 0x64
};

struct ULandscapeMeshCollisionComponent {
	FGuid MeshGuid; // 0x4f8
};

struct UMM_Hud_Chat_BroadCast_MSG {
	UMirButton* Btn_ItemInfo; // 0x2e0
	UMirRichTextBlock* m_Txt_Notice; // 0x2e8
	int64_t m_SendUserUID; // 0x2f0
	int64_t m_ShareItemUID; // 0x2f8
	int32_t m_SmeltingLv; // 0x300
};

struct UMM_Popup_Chat_Macro {
	UMM_Common_Btn_Symbol* btn_close; // 0x2e0
	TArray<UMM_Hud_Chat_MacroSlot*> m_SlotList; // 0x2e8
};

struct UBTTask_SelfComeBack {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct UMM_Guild_DiplomacyTopMenuSlot {
	UMirTextBlock* m_Txt_MenuTitle; // 0x2e0
	UMirTextBlock* m_Txt_MenuValue; // 0x2e8
};

struct UMM_Common_Popup_ItemInfo {
	UMM_PopUp_ItemInfo* m_ItemInfo_Left; // 0x2e0
	UMM_PopUp_ItemInfo* m_ItemInfo_Right; // 0x2e8
};

struct UGhostTrailMeshData {
	TArray<UStaticMeshComponent*> BaseStaticMeshComponents; // 0x28
	TArray<UStaticMeshComponent*> GhostStaticMeshComponents; // 0x38
	TArray<USkeletalMeshComponent*> BaseSkeletalMeshComponents; // 0x48
	TArray<UPoseableMeshComponent*> GhostPoseableMeshComponents; // 0x58
	TArray<USkeletalMeshComponent*> MasterSkeletalMeshComponents; // 0x68
	TArray<UMaterialInstanceDynamic*> MIDArray; // 0x78
};

struct UMM_ProgressBar_Tail {
	UMirImage* Image_BG; // 0x318
	UProgressBar* ProgressBar_Tail; // 0x320
	UProgressBar* ProgressBar_Contents; // 0x328
	UTextBlock* TextBlock_Text; // 0x330
	FPorgressColor DefaultColor; // 0x338
};

struct UHapticFeedbackEffect_SoundWave {
	USoundWave* SoundWave; // 0x28
};

struct UParticleModuleAccelerationDragScaleOverLife {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct UMM_Login_VersionSlot {
	UMirTextBlock* m_pTxtName; // 0x2e0
	UMirImage* m_pImgSelect; // 0x2e8
	UMirButton* m_pBtnMain; // 0x2f0
};

struct UMM_Popup_WebBrowser {
	UPanelWidget* m_Can_Back; // 0x300
	UMirButton* m_Btn_Back; // 0x308
	UMirWebBrowser* m_C_WebBrowser; // 0x310
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x318
	UMM_Common_Btn_Symbol* m_CB_Home; // 0x320
};

struct ANavigationData {
	UPrimitiveComponent* RenderingComp; // 0x220
	FNavDataConfig NavDataConfig; // 0x228
	char bEnableDrawing : 1; // 0x2a0
	char bForceRebuildOnLoad : 1; // 0x2a0
	char bAutoDestroyWhenNoNavigation : 1; // 0x2a0
	char bCanBeMainNavData : 1; // 0x2a0
	char bCanSpawnOnRebuild : 1; // 0x2a0
	char bRebuildAtRuntime : 1; // 0x2a0
	ERuntimeGenerationType RuntimeGeneration; // 0x2a4
	float ObservedPathsTickInterval; // 0x2a8
	uint32_t DataVersion; // 0x2ac
	TArray<FSupportedAreaData> SupportedAreas; // 0x390
};

struct UMM_PopupGuildPartnerSlot {
	UMirImage* img_online; // 0x2e0
	UMM_GuildMemberPortrait* Portrait; // 0x2e8
	UMirTextBlock* txt_grade; // 0x2f0
	UMirTextBlock* txt_nickname; // 0x2f8
	UMirTextBlock* txt_custom_title; // 0x300
	UMirTextBlock* txt_level; // 0x308
	UMirImage* img_class; // 0x310
	UMirTextBlock* txt_class; // 0x318
	UMirTextBlock* txt_combat_power; // 0x320
	UMirTextBlock* txt_daily_contribution; // 0x328
	UMirTextBlock* txt_total_contribution; // 0x330
	UMirTextBlock* txt_is_partner; // 0x338
	UMirImage* Img_Select; // 0x340
	UMirButton* btn_select; // 0x348
};

struct UMM_Mastery_Slot {
	UMirImage* mImgSelected; // 0x300
	UMirImage* mImgLimited; // 0x308
	UMirImage* mImgIcon; // 0x310
	UMirTextBlock* mTxtLevel; // 0x318
	UMirImage* mImgIndicator; // 0x320
	UMirButton* mBtnMain; // 0x328
	UPanelWidget* mGridEffect; // 0x330
	UWidgetAnimation* mAuiGuide; // 0x338
};

struct UMaterialExpressionShadowReplace {
	FExpressionInput Default; // 0x40
	FExpressionInput shadow; // 0x54
};

struct UMM_GuildReportSlot {
	UMirImage* Img_Icon; // 0x2e0
	UMirTextBlock* Txt_Name; // 0x2e8
	UMirProgressBar* pb_progress; // 0x2f0
	UMirTextBlock* txt_progress; // 0x2f8
	UMirTextBlock* txt_daily_mission; // 0x300
	UMM_Common_Btn_Symbol* btn_reward0; // 0x308
	UMirTextBlock* txt_reward0; // 0x310
	UMM_Common_Btn_Symbol* btn_reward1; // 0x318
	UMirTextBlock* txt_reward1; // 0x320
	UMM_Common_Btn_Symbol* btn_reward2; // 0x328
	UMirTextBlock* txt_reward2; // 0x330
	UMM_Common_Btn* btn_recv; // 0x338
	UMirImage* img_clear; // 0x340
	UMirImage* img_complete; // 0x348
};

struct ABeginPlayTrigger {
	FString m_EditorTriggerName; // 0x220
	TArray<AActivateTrigger*> m_pActiveTriggerArray; // 0x230
	int32_t m_TriggerIndex; // 0x240
	ETriggerType m_TriggerType; // 0x244
	bool m_bActiveTriggerCondition; // 0x268
	bool m_bActivated; // 0x269
	AMM_TriggerManager* m_pTriggerManager; // 0x270
};

struct UMM_ItemResult_FailInfo {
	int32_t FailGuideStrID; // 0x2e0
	int32_t NextPercentStrID; // 0x2e4
};

struct UMaterialExpressionArctangent {
	FExpressionInput Input; // 0x40
};

struct UMovieSceneTrack {
	FMovieSceneTrackEvalOptions EvalOptions; // 0x50
	bool bIsEvalDisabled; // 0x55
};

struct UMM_B_Skill {
	UMirScrollBox* mScrollBoxSkillList; // 0x2f0
	UMirTextBlock* mTxtSkillName; // 0x2f8
	UMirTextBlock* mTxtSkillEffectInfo; // 0x300
	UMirRichTextBlock* mRtSkillDesc; // 0x308
	UMirButton* mBtnAwaken; // 0x310
	UMirTextBlock* mTxtAwaken; // 0x318
	UMirTextBlock* mTxtSpecialDesc; // 0x320
	UMM_Common_Btn_Symbol* mCBPrev; // 0x328
	UMM_Common_Btn_Symbol* mCBNext; // 0x330
	UMM_Skill_Info* mSkillInfo; // 0x338
	UMM_Skill_DeckSetting* mSkillDeckSetting; // 0x340
	TArray<UMM_Skill_ListSlot*> mSkillList; // 0x348
	TArray<UMirRichTextBlock*> mRtSkillEffectDescList; // 0x358
};

struct AARSkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x228
};

struct UMasterAudioSubmixCaptureProtocol {
	FString Filename; // 0x58
};

struct USoundNodeRandom {
	TArray<float> Weights; // 0x40
	TArray<bool> HasBeenUsed; // 0x50
	int32_t NumRandomUsed; // 0x60
	int32_t PreselectAtLevelLoad; // 0x64
	char bShouldExcludeFromBranchCulling : 1; // 0x68
	char bSoundCueExcludedFromBranchCulling : 1; // 0x68
	char bRandomizeWithoutReplacement : 1; // 0x68
};

struct USoundSimple : USoundBase {
	TArray<FSoundVariation> Variations; // 0x160
	USoundWave* SoundWave; // 0x170
};

struct UMM_UIAction_QuestObtain {
	int32_t m_MissionZoneToStr; // 0x68
};

struct UMM_New_Occupation_Ranking_List {
	UMirTextBlock* m_Txt_Rank; // 0x2e8
	UMirImage* m_img_Ranking; // 0x2f0
	UMirTextBlock* m_Txt_Name; // 0x2f8
	UMirTextBlock* m_Txt_Info; // 0x300
	UMirTextBlock* m_Txt_Point; // 0x308
	UMirImage* m_img_MyRank; // 0x310
	UMirImage* m_img_GuildMarkIcon; // 0x318
	UMirImage* m_img_GuildMarkFrame; // 0x320
	UMirButton* m_RankButton; // 0x328
};

struct UAnimNotify_PlayParticleEffect {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UMM_ServerSlot {
	UPanelWidget* m_Can_Recommend; // 0x2e8
	UMirImage* m_Img_New; // 0x2f0
	UMirImage* m_Img_ServerCongestionInfo; // 0x2f8
	UMirTextBlock* m_Txt_ServerName; // 0x300
	UMirTextBlock* m_Txt_Peace; // 0x308
	UMirTextBlock* m_Txt_ServerNotice; // 0x310
	UPanelWidget* m_Hrz_CharCount; // 0x318
	UMirTextBlock* m_Txt_CharCount; // 0x320
	UMirButton* m_Btn_Main; // 0x328
};

struct ANetworkGenManager {
	bool m_bNamingPosID; // 0x218
};

struct UEnvQueryTest_PathfindingBatch {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x238
};

struct UMM_Popup_Auction_GuildSlot {
	UMirCanvasPanel* m_pCanvasGuild; // 0x2e0
	UMirCanvasPanel* m_pCanvasNoGuild; // 0x2e8
	UMirImage* m_pImgGuildBg; // 0x2f0
	UMirImage* m_pImgGuildMark; // 0x2f8
	UMirTextBlock* m_pTxtGuildName; // 0x300
	UMirTextBlock* m_pTxtGuildMaster; // 0x308
};

struct URichTextBoxDecorator {
	bool bReveal; // 0x28
	int32_t RevealedIndex; // 0x2c
};

struct UPanelSlot {
	UPanelWidget* Parent; // 0x28
	UWidget* Content; // 0x30
};

struct UMM_ClosedTraining_Slot_BaseSphere {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMM_Popup_Appearance_Slot {
	UMirTextBlock* Txt_Name; // 0x2e0
	UMirTextBlock* Txt_Value; // 0x2e8
	UMirImage* Img_Icon; // 0x2f0
};

struct UMM_UserEvent_WebBanner {
	FVector2D BannerSize; // 0x2e0
	UImage* m_Img_Banner; // 0x2e8
	UAsyncTaskDownloadImage* mDownloadImage; // 0x2f0
};

struct UFoliageInstancedStaticMeshComponent {
	FScriptMulticastDelegate OnInstanceTakePointDamage; // 0x628
	FScriptMulticastDelegate OnInstanceTakeRadialDamage; // 0x638
};

struct UInterpGroupDirector {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct UMaterialExpressionConstant3Vector {
	FLinearColor Constant; // 0x40
};

struct UPopup_DungeonReward_PartySlot {
	UMirTextBlock* txtRank; // 0x2e0
	UMirImage* imgClassIcon; // 0x2e8
	UMirTextBlock* txtNickName; // 0x2f0
	UMirTextBlock* txtLevel; // 0x2f8
	UMirRichTextBlock* rtxtContribution; // 0x300
	UMirCanvasPanel* canParty; // 0x308
	UMirTextBlock* txtNoParty; // 0x310
};

struct UMaterialExpressionFunctionOutput {
	FName OutputName; // 0x40
	FString Description; // 0x48
	int32_t SortPriority; // 0x58
	FExpressionInput A; // 0x5c
	char bLastPreviewed : 1; // 0x70
	FGuid ID; // 0x74
};

struct UFacebookLogout {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFail; // 0x40
};

struct UMM_Customizing_MainCategoryItem {
	UMirImage* m_pMainCategoryImage; // 0x2e0
	UMirImage* m_pMainSelectImage; // 0x2e8
	UMirButton* m_MainCategorySelectBtn; // 0x2f0
};

struct UMaterialExpressionShaderStageSwitch {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct UMM_HudProgressBar {
	UWidgetAnimation* m_pAnim_Progress_End; // 0x2e0
	UWidgetAnimation* m_pAnim_Progress_Loof; // 0x2e8
	UCanvasPanel* m_CanProgressObj; // 0x2f0
	UCanvasPanel* m_CanLoopEffect; // 0x2f8
	UProgressBar* Pro_Guage; // 0x300
	UTextBlock* txt_progress; // 0x308
	UHorizontalBox* m_RemainCountHorizontalBox; // 0x310
	UTextBlock* m_Txt_RemainCount; // 0x318
	UMM_Common_Btn_Symbol* btn_gather_info; // 0x320
	UMirRichTextBlock* txtTitle; // 0x328
	UOverlay* ovlBuff; // 0x330
	UVerticalBox* vtcBuffInfo; // 0x338
	UMirButton* btnBuffTooltip; // 0x340
	UImage* imgBuffIcon[0x2]; // 0x348
	UBuffInfoSlotWidget* wgtBuffInfoSlot[0x2]; // 0x358
};

struct UMM_TotalMenu_SubSlot {
	int32_t m_iSubSlot_Row; // 0x308
	int32_t m_iSubSlot_Col; // 0x30c
	UMirTextBlock* m_Txt_Name; // 0x318
	UMirButton* m_Btn_Main; // 0x320
	UPanelWidget* m_Grid_OpenEffect; // 0x328
	UMirImage* m_Img_Indicator; // 0x330
	UEffectWidgetBase* m_OpenEffect; // 0x338
};

struct UAISenseConfig_Team {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UMM_Slot_RelationQuest {
	FLinearColor m_DisableColor; // 0x2e8
	FLinearColor m_OnGoingColor; // 0x2f8
	FLinearColor m_EndColor; // 0x308
	UMirImage* m_Img_Frame; // 0x318
	UMirTextBlock* m_Txt_Title; // 0x320
	UMirButton* m_Btn_Open; // 0x328
	UMirImage* m_Img_Indicator; // 0x330
	UMirImage* m_Img_Complete; // 0x338
	UMirTextBlock* m_Txt_Percent; // 0x340
	int32_t m_RARE_QUEST_ICON; // 0x348
	int32_t m_HERO_QUEST_ICON; // 0x34c
	int32_t m_LEGEND_QUEST_ICON; // 0x350
};

struct UMM_QuestRelation_Progress {
	UMirTextBlock* m_TxtProgressValue; // 0x2f0
	UMirProgressBar* m_ProgressQuest; // 0x2f8
	UMirButton* m_BtnReward; // 0x300
	UMirImage* m_ImgRewardIcon; // 0x308
	UMirImage* m_Imgindicator; // 0x310
	UMirImage* m_ImgComplete; // 0x318
};

struct UMM_Hud_Chat_Area {
	UPanelWidget* Panel_VoiceOption; // 0x2f0
	UMirCheckBox* Toggle_Macro; // 0x2f8
	UMirCheckBox* Toggle_VoiceChat_Off; // 0x300
	UMirCheckBox* Toggle_VoiceChat_On; // 0x308
	UMirEditableText* EditTxt_Chatting; // 0x310
	int32_t STRING_UNABLE_MESSAGE; // 0x318
	int32_t STRING_ENABLE_MESSAGE; // 0x31c
};

struct UGeometryCacheTrackStreamable {
	UGeometryCacheCodecBase* Codec; // 0x58
	float StartSampleTime; // 0x188
};

struct UTutorialHighlightWidget {
	int32_t m_MainTypeID; // 0x240
	FName m_TargetIndex; // 0x244
};

struct UMM_ItemResult_SingleAbilityInfo {
	UMirImage* Img_Before_Symbol; // 0x2e0
	UMirRichTextBlock* RichTxt_Before_AbilityOption; // 0x2e8
	UMirImage* Img_After_Symbol; // 0x2f0
	UMirRichTextBlock* RichTxt_After_AbilityOption; // 0x2f8
	UMirImage* Img_Arrow; // 0x300
};

struct UMovieSceneCameraCutSection {
	FGuid CameraGuid; // 0xe0
	FMovieSceneObjectBindingID CameraBindingID; // 0xf0
};

struct UGranularSynth {
	USoundWave* GranulatedSoundWave; // 0x650
};

struct UMaterialExpressionPreSkinnedLocalBounds {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UAnimCompress_RemoveLinearKeys {
	float MaxPosDiff; // 0x50
	float MaxAngleDiff; // 0x54
	float MaxScaleDiff; // 0x58
	float MaxEffectorDiff; // 0x5c
	float MinEffectorDiff; // 0x60
	float EffectorDiffSocket; // 0x64
	float ParentKeyScale; // 0x68
	char bRetarget : 1; // 0x6c
	char bActuallyFilterLinearKeys : 1; // 0x6c
	char bOptimizeForForwardPlayback : 1; // 0x6c
	char bUseDecompression : 1; // 0x6c
	char bUseMultithreading : 1; // 0x6c
};

struct UParticleModuleRotationOverLifetime {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct UMM_B_XdracoStorage {
	int32_t INVENTORY_ID; // 0x2e0
	UMM_Xdraco_InvenLeft* m_InvenLeft; // 0x2e8
	UMM_Xdraco_InvenRight* m_InvenRight; // 0x2f0
};

struct UCapsuleComponent {
	float CapsuleHalfHeight; // 0x430
	float CapsuleRadius; // 0x434
};

struct AParticleEventManager {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct UMM_TotalQuick_SkillSlot {
	UMirImage* m_pImgSkillIcon; // 0x2e0
	UImage* m_pImgSlotDirBg; // 0x2e8
	UCanvasPanel* m_pCan_AutoSetOn; // 0x2f0
	UCanvasPanel* m_pCan_AutoSetOff; // 0x2f8
	UMirImage* m_pImgBookmarkOff; // 0x300
	UMirImage* m_pImgBookmarkOn; // 0x308
	UButton* m_pBtnClick; // 0x310
};

struct UParticleModuleEventGenerator {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x30
};

struct UMM_Popup_Passive_Option_Info {
	UMirTextBlock* Txt_SkillPassiveName; // 0x2e0
	UMirTextBlock* Txt_SkillPassiveState; // 0x2e8
	UMirRichTextBlock* Txt_SkillPassiveExplain; // 0x2f0
	UMirRichTextBlock* Txt_SkillPassiveExplain_Short; // 0x2f8
	UPanelWidget* Panel_Main; // 0x300
	UButton* btn_close; // 0x308
};

struct UARGetCandidateObjectAsyncTaskBlueprintProxy {
	FScriptMulticastDelegate OnSuccess; // 0x50
	FScriptMulticastDelegate OnFailed; // 0x60
};

struct UMovieSceneStringTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct USpinBox {
	float Value; // 0x108
	DelegateProperty ValueDelegate; // 0x10c
	FSpinBoxStyle WidgetStyle; // 0x120
	USlateWidgetStyleAsset* Style; // 0x408
	float Delta; // 0x410
	float SliderExponent; // 0x414
	FSlateFontInfo Font; // 0x418
	ETextJustify Justification; // 0x468
	float MinDesiredWidth; // 0x46c
	bool ClearKeyboardFocusOnCommit; // 0x470
	bool SelectAllTextOnCommit; // 0x471
	FSlateColor ForegroundColor; // 0x478
	FScriptMulticastDelegate OnValueChanged; // 0x4a0
	FScriptMulticastDelegate OnValueCommitted; // 0x4b0
	FScriptMulticastDelegate OnBeginSliderMovement; // 0x4c0
	FScriptMulticastDelegate OnEndSliderMovement; // 0x4d0
	char bOverride_MinValue : 1; // 0x4e0
	char bOverride_MaxValue : 1; // 0x4e0
	char bOverride_MinSliderValue : 1; // 0x4e0
	char bOverride_MaxSliderValue : 1; // 0x4e0
	float MinValue; // 0x4e4
	float MaxValue; // 0x4e8
	float MinSliderValue; // 0x4ec
	float MaxSliderValue; // 0x4f0
};

struct UAnimCompress_LeastDestructive {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	char bEnableSegmenting : 1; // 0x38
	uint32_t IdealNumFramesPerSegment; // 0x3c
	uint32_t MaxNumFramesPerSegment; // 0x40
	AnimationCompressionFormat TranslationCompressionFormat; // 0x44
	AnimationCompressionFormat RotationCompressionFormat; // 0x45
	AnimationCompressionFormat ScaleCompressionFormat; // 0x46
	float MaxCurveError; // 0x48
};

struct UMaterialExpressionFloor {
	FExpressionInput Input; // 0x40
};

struct UBTDecorator_DoesPathExist {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct UAnimationSharingSetup {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct UMM_Force_SimpleInfo {
	UMirTextBlock* m_C_Txt_ForceName; // 0x2e0
	UMirTextBlock* m_C_Txt_ForceLevel; // 0x2e8
	UMirProgressBar* m_C_Pgr_Exp; // 0x2f0
	UMirImage* m_C_Img_Ability; // 0x2f8
	UMirTextBlock* m_C_Txt_AbilityName; // 0x300
	UMirTextBlock* m_C_Txt_AbilityValue; // 0x308
	UMirImage* m_C_Img_ArrowUp; // 0x310
};

struct USoundBase {
	USoundClass* SoundClassObject; // 0x28
	char bDebug : 1; // 0x30
	char bOverrideConcurrency : 1; // 0x30
	char bOutputToBusOnly : 1; // 0x30
	char bHasDelayNode : 1; // 0x30
	char bHasConcatenatorNode : 1; // 0x30
	char bBypassVolumeScaleForPriority : 1; // 0x30
	EVirtualizationMode VirtualizationMode; // 0x31
	TSet<USoundConcurrency*> ConcurrencySet; // 0x88
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xd8
	float Duration; // 0xf8
	float MaxDistance; // 0xfc
	float TotalSamples; // 0x100
	float Priority; // 0x104
	USoundAttenuation* AttenuationSettings; // 0x108
	FSoundModulation Modulation; // 0x110
	USoundSubmix* SoundSubmixObject; // 0x120
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x128
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x138
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x140
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x150
};

struct UMM_Occupation_Observer {
	UMirTextBlock* m_Txt_RemainTime; // 0x300
	UMirTextBlock* m_Txt_Defence_Guild_Name; // 0x308
	UMirTextBlock* m_Txt_Offence_Guild_Name; // 0x310
	UMM_GuildIcon* m_GuildIcon_Defence; // 0x318
	UMM_GuildIcon* m_GuildIcon_Offence; // 0x320
	UMirTextBlock* m_Txt_Catapult_Count; // 0x328
	UMirTextBlock* m_Txt_Gate_HP; // 0x330
	UMirTextBlock* m_Txt_Target_Capture_HP; // 0x338
	UMirTextBlock* m_Txt_Defence_Flag_Count; // 0x340
	UMirTextBlock* m_Txt_Siege_Tower_Count; // 0x348
	UMirTextBlock* m_Txt_Offence_Flag_Count; // 0x350
	UMirTextBlock* m_Txt_ServerName; // 0x358
	UMM_Occupation_Observer_KillLog* m_KillLog_Defence; // 0x360
	UMM_Occupation_Observer_KillLog* m_KillLog_Offence; // 0x368
	UMirButton* m_Btn_Gate; // 0x370
	UMirButton* m_Btn_Capture; // 0x378
	UMM_Occupation_Observer_TargetHP* m_SiegeObserver_HP; // 0x380
};

struct APortalInfoExporter {
	bool m_bExport; // 0x218
	bool m_bImport; // 0x219
};

struct UMovieSceneComponentMaterialTrack {
	int32_t MaterialIndex; // 0x68
};

struct UMM_ContentsPoint {
	UMirRichTextBlock* m_RTxt_Title; // 0x2e0
	UMM_Common_Btn_Symbol* m_CB_Detail; // 0x2e8
	UMirImage* m_Img_Point; // 0x2f0
	UMirTextBlock* m_Txt_Point; // 0x2f8
};

struct UMaterialExpressionFontSampleParameter {
	FName ParameterName; // 0x50
	FGuid ExpressionGUID; // 0x58
	FName Group; // 0x68
};

struct UMovieSceneEasingExternalCurve {
	UCurveFloat* Curve; // 0x30
};

struct UMM_MessageWidgetBase {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMM_MagicStoneQuickTab {
	UMM_MagicStoneQuickTabSlot* lst_slot[0x5]; // 0x2f0
};

struct UMaterialExpressionDDX {
	FExpressionInput Value; // 0x40
};

struct UAISense_Team {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct UBlackboardKeyType_Enum {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UMovieSceneObjectPropertySection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe0
};

struct UAISystemBase {
	FSoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50
};

struct UMaterialExpressionArctangentFast {
	FExpressionInput Input; // 0x40
};

struct ACinematicDialogue {
	UDialogueCameraData* m_pDialogueCameraPreset; // 0x238
	TArray<UObject*> m_ResourceArray; // 0x240
	bool m_bTest; // 0x250
	int32_t m_TestDirectingID; // 0x254
	ALevelSequenceActor* m_pLevelSequenceActor; // 0x2b0
	ULevelSequencePlayer* m_pLevelSequencePlayer; // 0x2b8
	ACutsceneCamera* m_pCutsceneCamera; // 0x2c0
	UCutsceneDialogueWidget* m_pDialogueWidget; // 0x2c8
	UObject* m_pCallbackObject; // 0x328
};

struct UAISenseBlueprintListener {
	EUserDefinedStructureStatus Status; // 0xa8
	FGuid Guid; // 0xac
};

struct UBTService_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance {
	int32_t LightIndex; // 0x40
	FExpressionInput WorldPosition; // 0x44
};

struct UMaterialExpressionDepthFade {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct APainCausingVolume {
	char bPainCausing : 1; // 0x260
	float DamagePerSec; // 0x264
	UDamageType* DamageType; // 0x268
	float PainInterval; // 0x270
	char bEntryPain : 1; // 0x274
	char BACKUP_bPainCausing : 1; // 0x274
	AController* DamageInstigator; // 0x278
};

struct UGameplayTasksComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FScriptMulticastDelegate OnClaimedResourcesChange; // 0x110
};

struct UComboBoxString {
	TArray<FString> DefaultOptions; // 0x108
	FString SelectedOption; // 0x118
	FComboBoxStyle WidgetStyle; // 0x128
	FTableRowStyle ItemStyle; // 0x500
	FMargin ContentPadding; // 0xcc8
	float MaxListHeight; // 0xcd8
	bool HasDownArrow; // 0xcdc
	bool EnableGamepadNavigationMode; // 0xcdd
	FSlateFontInfo Font; // 0xce0
	FSlateColor ForegroundColor; // 0xd30
	bool bIsFocusable; // 0xd58
	DelegateProperty OnGenerateWidgetEvent; // 0xd5c
	FScriptMulticastDelegate OnSelectionChanged; // 0xd70
	FScriptMulticastDelegate OnOpening; // 0xd80
};

struct ADirectingTrigger {
	int32_t m_SequencePlayID; // 0x278
	EDirectingTriggerType m_DirectingState; // 0x27c
};

struct UMM_Popup_Dominion_TaxDetail {
	UMirScrollBox* ScrollBox_Main; // 0x2f0
	UMM_Common_Btn_Symbol* btn_close; // 0x2f8
	UMM_Common_Btn* m_pBtnOut; // 0x300
	UMirButton* Btn_Background; // 0x308
};

struct UUIParticleEmitterAsset {
	EEmitterType EmitterType; // 0x28
	float EmitSeconds; // 0x2c
	FUIParticleProperty MaxParticleCount; // 0x30
	FUIParticleProperty SpawnParticlePerSecond; // 0x818
	FUIParticleProperty ParticleEmitAngle; // 0x1000
	FRange_Vector2D EmitPosRange; // 0x17e8
	FPosotion_Vector2DCurve EmitPosition; // 0x1800
	bool AutoEmitPosRange; // 0x27d0
	bool AutoScale; // 0x27d1
	bool ScaleByX; // 0x27d2
	FVector2D DesignSize; // 0x27d4
	EPositionType PositionType; // 0x27dc
	FUIParticleProperty LifeSpan; // 0x27e0
	FUIParticleProperty Size; // 0x2fc8
	FUIParticleProperty Pivot; // 0x37b0
	FUIParticleProperty RotationStart; // 0x3f98
	FUIParticleProperty RotationSpeed; // 0x4780
	FUIParticleProperty Color; // 0x4f68
	UObject* ResourceObject; // 0x5750
	bool RotationFollowSpeed; // 0x5758
	bool UseSeparateSize; // 0x5759
	FUIParticleProperty Gravity; // 0x5760
	FUIParticleProperty StartSpeed; // 0x5f48
	FUIParticleProperty AirResistance; // 0x6730
	FUIParticleProperty RadialAcceleration; // 0x6f18
	FUIParticleProperty TangentialAcceleration; // 0x7700
	FUIParticleProperty Radius; // 0x7ee8
	FUIParticleProperty DegreePerSecond; // 0x86d0
	FUIParticleProperty PositionX; // 0x8eb8
	FUIParticleProperty PositionY; // 0x96a0
	TArray<FChildEmitter> ChildrenEmitters; // 0x9e88
	TArray<FScalarParamCurve> ScalarParams; // 0x9e98
	TArray<FScalarParamCurve> ScalarParamsWhenStart; // 0x9ea8
	EParticleDrawEffect DrawEffect; // 0x9eb8
	bool UseScaleFollowSpeedDirection; // 0x9eb9
	FUIParticleProperty ScaleFollowSpeedDirection; // 0x9ec0
	bool UseScaleFollowSpeedVertical; // 0xa6a8
	FUIParticleProperty ScaleFollowSpeedVertical; // 0xa6b0
	FUIParticleProperty DirectionScale; // 0xae98
	FUIParticleProperty VerticalDirectionScale; // 0xb680
	FUIParticleProperty SineDirectionStart; // 0xbe68
	FUIParticleProperty SineDirectionSpeed; // 0xc650
	FUIParticleProperty SineDirectionRange; // 0xce38
};

struct APawn {
	char bUseControllerRotationPitch : 1; // 0x220
	char bUseControllerRotationYaw : 1; // 0x220
	char bUseControllerRotationRoll : 1; // 0x220
	char bCanAffectNavigationGeneration : 1; // 0x220
	float BaseEyeHeight; // 0x224
	EAutoReceiveInput AutoPossessPlayer; // 0x228
	EAutoPossessAI AutoPossessAI; // 0x229
	char RemoteViewPitch; // 0x22a
	AController* AIControllerClass; // 0x230
	APlayerState* PlayerState; // 0x238
	AController* LastHitBy; // 0x248
	AController* Controller; // 0x250
	FVector ControlInputVector; // 0x25c
	FVector LastControlInputVector; // 0x268
};

struct UJoinSessionCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UCameraShakeNotify {
	UCameraShake* CameraShakeClass; // 0x38
	float ShakeScale; // 0x40
	float ShakeDistance; // 0x44
};

struct UDistributionVectorConstant {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct ULimitTimerWidget {
	UTextBlock* txtLimitTime; // 0x2f0
	UTextBlock* txtTime; // 0x2f8
	UMirButton* btnExtend; // 0x300
	UMirButton* btnExtend2; // 0x308
	UImage* imgExtend; // 0x310
	UMM_Common_Popup_Outgame* m_pOutgamePopupExtendTime; // 0x318
	UMirCanvasPanel* canAutoExtending; // 0x320
	UEffectWidgetBase* eftAutoExtendWgt; // 0x328
	UMirTextBlock* txtAutoExtendCount; // 0x330
	UMirButton* btnAutoExtending; // 0x338
	UWidgetAnimation* StartWarnAni; // 0x358
};

struct UMaterialExpressionParticleDirection {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UInterpTrackFloatParticleParam {
	FName ParamName; // 0x90
};

struct AMirSkySphereActor {
	bool UseLightMap; // 0x218
	bool ColorsDeterminedBySunPosition; // 0x219
	float SunBrightness; // 0x21c
	float CloudSpeed; // 0x220
	float CloudOpacity; // 0x224
	float StarsBrightness; // 0x228
	float SunHeight; // 0x22c
	float SunRadius; // 0x230
	float HorizonFalloff; // 0x234
	FLinearColor ZenithColor; // 0x238
	FLinearColor HorizonColor; // 0x248
	FLinearColor CloudColor; // 0x258
	FLinearColor OverallColor; // 0x268
};

struct UGridSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t Row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t Column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct UMM_HudDungeonMenu {
	int32_t m_iStringID_BtnCancel; // 0x2f0
	int32_t m_iStringID_BtnExit; // 0x2f4
	int32_t m_iStringID_ExitDungeon; // 0x2f8
	int32_t m_iStringID_ExitSecretDungeon_Item; // 0x2fc
	int32_t m_iStringID_ExitSecretDungeon_Quest; // 0x300
	UWidgetAnimation* m_pAniDoingEffect; // 0x308
	UWidgetAnimation* m_pAniAttentionEffect; // 0x310
	UMirCanvasPanel* m_pCan_Tracker; // 0x318
	UMirTextBlock* m_pText_Title; // 0x320
	UMirTextBlock* m_pText_Mission; // 0x328
	UButton* m_pBtn_Tracker; // 0x330
	ULimitTimerWidget* m_pLimitTimerWidget; // 0x338
	UButton* m_pBtn_DropInfo; // 0x340
	UButton* m_pBtn_Exit; // 0x348
	UImage* m_imgBtn_DropInfo; // 0x350
	UImage* m_imgBtn_Exit; // 0x358
	UCanvasPanel* m_pCanDoingEffect; // 0x360
	UCanvasPanel* m_pCanAttentionEffect; // 0x368
	UCanvasPanel* canDropInfo; // 0x370
	UCanvasPanel* canExit; // 0x378
};

struct UMM_Popup_Auction_ItemInfoSlot {
	UMirScrollBox* m_pScrollInfo; // 0x2e0
	UMM_Slot_Inventory* m_pSlotInven; // 0x2e8
	UMirTextBlock* m_pTxtItemName; // 0x2f0
	UMirTextBlock* m_pTxtItemTranscend; // 0x2f8
	UMirTextBlock* m_pTxtItemClass; // 0x300
	UGridPanel* m_pGridDesc; // 0x308
	UGridPanel* m_pGridCombat; // 0x310
	UGridPanel* m_pGridAbility; // 0x318
	UGridPanel* m_pGridAddOption; // 0x320
	UMM_PopUp_ItemInfo_Ability* m_pCombatPoint; // 0x328
	TArray<UMM_PopUp_ItemInfo_Ability*> m_arrAbility; // 0x330
	TArray<UMM_PopUp_ItemInfo_Ability*> m_arrOption; // 0x340
	UMirTextBlock* m_pTxtDesc; // 0x350
	UMM_Common_Btn* m_pBtnItemCompare; // 0x358
	UMM_SpecialAbility* m_pSpecialAbility; // 0x360
};

struct UMM_UserEvent_Goal_Slot {
	UMirTextBlock* m_Txt_RelationTitle; // 0x2e0
	UMirRichTextBlock* m_RTxt_LevelUpTitle; // 0x2e8
	UMirTextBlock* m_Txt_Description; // 0x2f0
	UMirImage* m_Img_CompleteBg; // 0x2f8
	UMirImage* m_Img_CompleteMark; // 0x300
	UMirImage* m_Img_Lock; // 0x308
	UMM_Slot_Material* m_RewardItemSlot[0x2]; // 0x310
	UMM_Common_Btn* m_C_Btn_Progress; // 0x320
	UMM_Common_Btn* m_C_Btn_Complete; // 0x328
	UMirCanvasPanel* m_Can_Relation; // 0x330
	UMirCanvasPanel* m_Can_LevelUp; // 0x338
};

struct UMM_Map_Player {
	float m_fRaderScale; // 0x2e0
	USpacer* m_SpcMain; // 0x2e8
	UImage* m_ImgView; // 0x2f0
	UImage* m_ImgPlayer; // 0x2f8
};

struct UMM_CostumeAbility_Part_Option {
	UMirImage* Img_Icon; // 0x2e0
	UMirTextBlock* Txt_Type; // 0x2e8
	UMirTextBlock* Txt_Value; // 0x2f0
	TArray<UMM_CostumeAbility_Info*> AbilityInfoList; // 0x2f8
	int32_t STRID_COUNT; // 0x308
	int32_t MAX_INFO; // 0x30c
};

struct UGameplayTask_ClaimResource {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UMM_Common_PartyMember {
	UMirImage* m_pImgParty; // 0x2f0
	UMirTextBlock* m_pTxtMemberCount; // 0x2f8
};

struct AOnlineBeaconHostObject {
	FString BeaconTypeName; // 0x218
	AOnlineBeaconClient* ClientBeaconActorClass; // 0x228
	TArray<AOnlineBeaconClient*> ClientActors; // 0x230
};

struct UImageSequenceProtocol_EXR {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct UMaterialExpressionLandscapeLayerWeight {
	FExpressionInput Base; // 0x40
	FExpressionInput Layer; // 0x54
	FName ParameterName; // 0x68
	float PreviewWeight; // 0x70
	FVector ConstBase; // 0x74
	FGuid ExpressionGUID; // 0x80
};

struct ASpeechBalloonUI {
	USpeechBalloonWidget* m_pSpeechBalloonWidget; // 0x218
	USkeletalMeshComponent* m_pTargetMesh; // 0x220
	AMM_CharacterPawnBase* m_pTarget; // 0x228
};

struct UMovieScene3DPathTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x58
};

struct UBTTask_SetTagCooldown {
	FGameplayTag CooldownTag; // 0x70
	bool bAddToExistingDuration; // 0x78
	float CooldownDuration; // 0x7c
};

struct AGeometryCacheActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x218
};

struct UMM_PopupWorldBossChannel {
	UMM_Common_Btn_Symbol* btnClose; // 0x2f0
	UWidgetAnimation* m_StartAni; // 0x2f8
	UWidgetAnimation* m_EndAni; // 0x300
};

struct UMM_NFTRelocation_SetList {
	UMirTextBlock* m_Txt_Message; // 0x2e0
	UMM_Common_Btn* m_Btn_Move; // 0x2e8
};

struct UAnimCompress_ACLCustom {
	float DefaultVirtualVertexDistance; // 0x50
	float SafeVirtualVertexDistance; // 0x54
	ACLCompressionLevel CompressionLevel; // 0x58
	ACLRotationFormat RotationFormat; // 0x59
	ACLVectorFormat TranslationFormat; // 0x5a
	ACLVectorFormat ScaleFormat; // 0x5b
	float ErrorThreshold; // 0x5c
	float ConstantRotationThresholdAngle; // 0x60
	float ConstantTranslationThreshold; // 0x64
	float ConstantScaleThreshold; // 0x68
	char bClipRangeReduceRotations : 1; // 0x6c
	char bClipRangeReduceTranslations : 1; // 0x6c
	char bClipRangeReduceScales : 1; // 0x6c
	char EnableSegmenting : 1; // 0x6c
	char bSegmentRangeReduceRotations : 1; // 0x6c
	char bSegmentRangeReduceTranslations : 1; // 0x6c
	char bSegmentRangeReduceScales : 1; // 0x6c
	uint16_t IdealNumKeyFramesPerSegment; // 0x70
	uint16_t MaxNumKeyFramesPerSegment; // 0x72
};

struct USafeZone {
	bool PadLeft; // 0x120
	bool PadRight; // 0x121
	bool PadTop; // 0x122
	bool PadBottom; // 0x123
};

struct UBrushBuilder {
	FString BitmapFilename; // 0x28
	FString ToolTip; // 0x38
	char NotifyBadParams : 1; // 0x48
	TArray<FVector> Vertices; // 0x50
	TArray<FBuilderPoly> Polys; // 0x60
	FName Layer; // 0x70
	char MergeCoplanars : 1; // 0x78
};

struct UInterpTrackDirector {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct UMaterialExpressionTangentOutput {
	FExpressionInput Input; // 0x40
};

struct UPlatformInterfaceBase {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UARFaceGeometry {
	FVector LookAtTarget; // 0xe8
	bool bIsTracked; // 0xf4
	TMap<EARFaceBlendShape, float> BlendShapes; // 0xf8
};

struct UNavTestRenderingComponent {
	float MinDrawDistance; // 0x228
	float LDMaxDrawDistance; // 0x22c
	float CachedMaxDrawDistance; // 0x230
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x234
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x235
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x236
	ELightmapType LightmapType; // 0x237
	char bUseMaxLODAsImposter : 1; // 0x238
	float CachedBoundsSphereDiameter; // 0x23c
	char bBatchImpostersAsInstances : 1; // 0x240
	char bNeverDistanceCull : 1; // 0x240
	char bAlwaysCreatePhysicsState : 1; // 0x240
	char bGenerateOverlapEvents : 1; // 0x240
	char bMultiBodyOverlap : 1; // 0x241
	char bTraceComplexOnMove : 1; // 0x241
	char bReturnMaterialOnMove : 1; // 0x241
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x241
	char bAllowCullDistanceVolume : 1; // 0x241
	char bHasMotionBlurVelocityMeshes : 1; // 0x241
	char bVisibleInReflectionCaptures : 1; // 0x241
	char bVisibleInRayTracing : 1; // 0x241
	char bRenderInMainPass : 1; // 0x242
	char bRenderInDepthPass : 1; // 0x242
	char bReceivesDecals : 1; // 0x242
	char bOwnerNoSee : 1; // 0x242
	char bOnlyOwnerSee : 1; // 0x242
	char bTreatAsBackgroundForOcclusion : 1; // 0x242
	char bUseAsOccluder : 1; // 0x242
	char bSelectable : 1; // 0x242
	char bForceMipStreaming : 1; // 0x243
	char bHasPerInstanceHitProxies : 1; // 0x243
	char CastShadow : 1; // 0x243
	char bAffectDynamicIndirectLighting : 1; // 0x243
	char bAffectDistanceFieldLighting : 1; // 0x243
	char bCastDynamicShadow : 1; // 0x243
	char bCastStaticShadow : 1; // 0x243
	char bCastVolumetricTranslucentShadow : 1; // 0x243
	char bSelfShadowOnly : 1; // 0x244
	char bCastFarShadow : 1; // 0x244
	char bCastInsetShadow : 1; // 0x244
	char bCastCinematicShadow : 1; // 0x244
	char bCastHiddenShadow : 1; // 0x244
	char bCastShadowAsTwoSided : 1; // 0x244
	char bLightAsIfStatic : 1; // 0x244
	char bLightAttachmentsAsGroup : 1; // 0x244
	char bExcludeFromLightAttachmentGroup : 1; // 0x245
	char bReceiveMobileCSMShadows : 1; // 0x245
	char bSingleSampleShadowFromStationaryLights : 1; // 0x245
	char bIgnoreRadialImpulse : 1; // 0x245
	char bIgnoreRadialForce : 1; // 0x245
	char bApplyImpulseOnDamage : 1; // 0x245
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x245
	char AlwaysLoadOnClient : 1; // 0x245
	char AlwaysLoadOnServer : 1; // 0x246
	char bUseEditorCompositing : 1; // 0x246
	char bRenderCustomDepth : 1; // 0x246
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x247
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x249
	FLightingChannels LightingChannels; // 0x24a
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x24b
	int32_t CustomDepthStencilValue; // 0x24c
	FCustomPrimitiveData CustomPrimitiveData; // 0x250
	int32_t TranslucencySortPriority; // 0x260
	int32_t VisibilityId; // 0x264
	char bIgnoreOcclusionVolume : 1; // 0x268
	int32_t OcclusionVolumeId; // 0x26c
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x270
	uint8_t VirtualTextureLodBias; // 0x280
	uint8_t VirtualTextureCullMips; // 0x281
	uint8_t VirtualTextureMinCoverage; // 0x282
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x283
	float LpvBiasMultiplier; // 0x288
	float BoundsScale; // 0x294
	TArray<AActor*> MoveIgnoreActors; // 0x2a8
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2b8
	FBodyInstance BodyInstance; // 0x2d8
	FScriptMulticastDelegate OnComponentHit; // 0x3e8
	FScriptMulticastDelegate OnComponentBeginOverlap; // 0x3e9
	FScriptMulticastDelegate OnComponentEndOverlap; // 0x3ea
	FScriptMulticastDelegate OnComponentWake; // 0x3eb
	FScriptMulticastDelegate OnComponentSleep; // 0x3ec
	FScriptMulticastDelegate OnBeginCursorOver; // 0x3ee
	FScriptMulticastDelegate OnEndCursorOver; // 0x3ef
	FScriptMulticastDelegate OnClicked; // 0x3f0
	FScriptMulticastDelegate OnReleased; // 0x3f1
	FScriptMulticastDelegate OnInputTouchBegin; // 0x3f2
	FScriptMulticastDelegate OnInputTouchEnd; // 0x3f3
	FScriptMulticastDelegate OnInputTouchEnter; // 0x3f4
	FScriptMulticastDelegate OnInputTouchLeave; // 0x3f5
	UPrimitiveComponent* LODParentPrimitive; // 0x410
};

struct UMM_Dominion_Title_Tooltip {
	UMirTextBlock* m_pTxtName; // 0x2e0
	UMirTextBlock* m_pTxtValue; // 0x2e8
	UGridPanel* m_pGridPanel; // 0x2f0
	UMirImage* m_pImgIcon; // 0x2f8
	URichTextBox* m_pTxtBuffInfo; // 0x300
};

struct AMM_MonsterAIController {
	AMM_Monster* m_Monster; // 0x3a0
	EMonsterAttackType LastAttackType; // 0x3a8
	int32_t CurrentShortSkillSetIndex; // 0x3ac
	bool HasShortSkills; // 0x3b0
	int32_t CurrentLongSkillSetIndex; // 0x3b4
	bool HasLongSkills; // 0x3b8
	bool EnoughAttackToUseSkill; // 0x3b9
	int32_t PickupedNormalAttackCount; // 0x3bc
	int32_t NormalAttackCount; // 0x3c0
	int32_t CurAttackTID; // 0x3c4
};

struct UEngineMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct UMM_Guild_BlackIron_Title {
	UMirTextBlock* m_pTxtTitle; // 0x2e0
	UMM_Common_ToolTipBtn* m_pInfo; // 0x2e8
};

struct UMM_Popup_Siege_Command_EditText {
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e0
	UMirEditableText* m_InputText; // 0x2e8
	UMirButton* m_Btn_Macro; // 0x2f0
	UMM_Common_Btn* m_Btn_Ok; // 0x2f8
	UMM_Common_Btn* m_Btn_Cancel; // 0x300
	UMirCanvasPanel* m_Macro_Canvas; // 0x308
	UMirButton* m_Btn_Attack; // 0x310
	UMirButton* m_Btn_Assemble; // 0x318
	UMirButton* m_Btn_Defence; // 0x320
	UMirButton* m_Btn_Retreat; // 0x328
	UMirButton* m_Btn_Wait; // 0x330
	UMirImage* m_arSelectImg[0x5]; // 0x338
	UMirImage* m_ImgSelectMark; // 0x360
};

struct UMaterialExpressionDecalLifetimeOpacity {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UAudioCurveSourceComponent {
	FName CurveSourceBindingName; // 0x758
	float CurveSyncOffset; // 0x760
};

struct UMM_ItemSynthesis_ListSlot {
	UGridPanel* m_Grid_Effect; // 0x2e0
	UMM_Slot_Material* m_Slot_Material; // 0x2e8
	UEffectWidgetBase* m_Effect; // 0x2f0
};

struct UAssetManager {
	TArray<UObject*> ObjectReferenceList; // 0x2c0
	bool bIsGlobalAsyncScanEnvironment; // 0x2d0
	bool bShouldGuessTypeAndName; // 0x2d1
	bool bShouldUseSynchronousLoad; // 0x2d2
	bool bIsLoadingFromPakFiles; // 0x2d3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2d4
	bool bOnlyCookProductionAssets; // 0x2d5
	bool bIsBulkScanning; // 0x2d6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2d7
	bool bIsManagementDatabaseCurrent; // 0x2d8
	bool bUpdateManagementDatabaseAfterScan; // 0x2d9
	bool bIncludeOnlyOnDiskAssets; // 0x2da
	int32_t NumberOfSpawnedNotifications; // 0x2dc
};

struct USizeBox {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct UMaterialExpressionCeil {
	FExpressionInput Input; // 0x40
};

struct UMM_CommonVerticalTabTreeBtn {
	UVerticalBox* m_pVrtSubTree; // 0x340
	UMirImage* m_pImgArrowUp; // 0x348
	UMirImage* m_pImgArrowDown; // 0x350
};

struct UMM_HudPotionSlot {
	TArray<FBrushObject> m_arrBrushCoolTimeFont; // 0x2f0
	int32_t m_iEffectID_UsePotion; // 0x300
	int32_t m_iEffectID_EndCooltime; // 0x304
	float m_fPressedSelectTime; // 0x308
	UMirTextBlock* m_TextCount; // 0x310
	UMirImage* m_pImgIcon; // 0x318
	int32_t NotAutoUseItemStringID; // 0x320
	UPanelWidget* m_pCanSlot; // 0x328
	UMirTextBlock* m_Txt_CoolTime; // 0x330
	UImage* m_pImgPotionCool; // 0x338
	UPanelWidget* m_pGridEffect; // 0x340
	UMirButton* m_pBtnPotionArea; // 0x348
	UMirImage* m_Img_Empty; // 0x350
	UMirImage* m_Img_Effect_Auto; // 0x358
	UMirCanvasPanel* m_Can_AutoState; // 0x360
	UWidgetAnimation* m_pAnim_AutoOn; // 0x368
	UWidgetAnimation* m_pAnim_AutoOff; // 0x370
	UMirCanvasPanel* m_Can_AniAuto; // 0x378
	UMirCanvasPanel* m_Can_AniManual; // 0x380
	UEffectWidgetBase* m_Effect_Use; // 0x388
	UMirCanvasPanel* m_pCanRemove; // 0x390
	UMirButton* m_pBtnRemove; // 0x398
};

struct UMM_GuildJoinReqeustListSlot {
	UMirImage* img_rank; // 0x2e0
	UMirTextBlock* txt_rank; // 0x2e8
	UMirImage* img_class; // 0x2f0
	UMirTextBlock* Txt_Name; // 0x2f8
	UMirTextBlock* txt_level; // 0x300
	UMirTextBlock* txt_join_type; // 0x308
	UMirTextBlock* txt_time; // 0x310
	UMirButton* Btn_Main; // 0x318
	UMM_Common_CombatPoint* CombatPoint; // 0x320
};

struct UMovieSceneFadeSection {
	FLinearColor FadeColor; // 0x180
	char bFadeAudio : 1; // 0x190
};

struct UMM_New_Force_Tab {
	UMirImage* m_C_Img_Select; // 0x2f8
	UMirImage* m_C_Img_Icon; // 0x300
	UMirImage* m_C_Img_Indicator; // 0x308
	UMirImage* m_C_Img_Lock; // 0x310
	UMirTextBlock* m_C_Txt_State; // 0x318
	UMirTextBlock* m_C_Txt_Percent; // 0x320
	UMirTextBlock* m_C_Txt_Name; // 0x328
	UMirButton* m_C_Btn_Tab; // 0x330
};

struct URichTextBlockImageDecorator {
	UDataTable* ImageSet; // 0x28
};

struct UMaterialInstanceConstant {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UMaterialInterface* Parent; // 0x90
	char bHasStaticPermutationResource : 1; // 0x98
	char bOverrideSubsurfaceProfile : 1; // 0x98
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xa0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xb0
	TArray<FTextureParameterValue> TextureParameterValues; // 0xc0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xd0
	TArray<FFontParameterValue> FontParameterValues; // 0xe0
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xf0
	TArray<UObject*> PermutationTextureReferences; // 0x108
	FStaticParameterSet StaticParameters; // 0x118
};

struct UOnlineSubsystemExtendedSteamWebBrowser {
	FScriptMulticastDelegate OnUrlChanged; // 0x108
	FString InitialURL; // 0x118
	bool bSupportsTransparency; // 0x128
};

struct UMM_Map_Waypoint_List {
	UMM_MAP_Waypoint_Category* m_arWaypointCategroy[0x8]; // 0x2f8
	UMM_Map_CheckBtn* m_arMapCheckBtn[0x2]; // 0x348
	UMirTextBlock* m_Txt_Channel; // 0x358
	UScrollBox* m_Scr_WaypointList; // 0x360
	UMM_Common_Btn* m_CB_ChannelChange; // 0x368
	UMM_Common_Btn* m_CB_Move; // 0x370
	UMM_Common_Btn_Cost* m_CB_Immedi_Move; // 0x378
	UHorizontalBox* m_Hrz_Notice; // 0x380
	UMirRichTextBlock* m_RTxt_Notice; // 0x388
	UMirRichTextBlock* m_Txt_MapType; // 0x390
	UMM_Common_Btn* m_btn_ChangeMapType; // 0x398
};

struct UMM_UIActionManager {
	TMap<EMirUIActionType, UMM_UIAction*> m_ActionMap; // 0x28
};

struct UUserDefinedImageCaptureProtocol {
	EDesiredImageFormat Format; // 0xd8
	bool bEnableCompression; // 0xd9
	int32_t CompressionQuality; // 0xdc
};

struct UTestMovieSceneSequence {
	UMovieScene* MovieScene; // 0x348
};

struct ABandwidthTestActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x218
};

struct UMM_GameOption_InGame {
	UMM_CommonVerticalTabSet* InGameTabSet; // 0x2f0
	UWidgetSwitcher* WidgetSwitcher; // 0x2f8
	UMM_GameOption_InGame_Battle* InGame_Battle; // 0x300
	UMM_GameOption_InGame_QuickSlot* InGame_QuickSlot; // 0x308
	UMM_GameOption_InGame_HUD* InGame_HUD; // 0x310
	UMM_GameOption_InGame_Convenience* InGame_Convenience; // 0x318
	UMM_GameOption_InGame_Community* InGame_Community; // 0x320
	UMM_GameOption_InGame_Target* InGame_Target; // 0x328
	UMM_GameOption_InGame_Alarm* InGame_Alarm; // 0x330
};

struct UMaterialFunctionInstance {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct UParticleModuleLocationBoneSocket {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x5c
	int32_t NumPreSelectedIndices; // 0x64
};

struct UMM_IAPManager {
	UIAPStoreModuleBase* MirStoreModule; // 0x110
};

struct USplineMeshComponent {
	FSplineMeshParams SplineParams; // 0x4b0
	FVector SplineUpDir; // 0x508
	float SplineBoundaryMin; // 0x514
	FGuid CachedMeshBodySetupGuid; // 0x518
	UBodySetup* BodySetup; // 0x528
	float SplineBoundaryMax; // 0x530
	char bAllowSplineEditingPerInstance : 1; // 0x534
	char bSmoothInterpRollScale : 1; // 0x534
	char bMeshDirty : 1; // 0x534
	ESplineMeshAxis ForwardAxis; // 0x535
	float VirtualTextureMainPassMaxDrawDistance; // 0x538
};

struct UHapticFeedbackEffect_Buffer {
	TArray<char> amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UMM_UserEvent_Attendance_Month {
	UMirTextBlock* m_Txt_Name; // 0x2f0
	UMirImage* m_Img_Thumb; // 0x2f8
	UWrapBox* m_WrapBox; // 0x300
	UMM_UserEvent_WebBanner* m_WebBanner; // 0x308
};

struct UMM_PopupGuildPartner {
	UMirScrollBox* sb_member; // 0x2f0
	UMM_Common_Board_Notice* bn_empty; // 0x2f8
	UMM_Common_Btn* btn_confirm; // 0x300
	UMM_Common_Btn* Btn_Cancel; // 0x308
	UMM_Common_Btn_Symbol* btn_close; // 0x310
	UMirTextBlock* Txt_Title; // 0x318
	UMirTextBlock* txt_sort; // 0x320
	UMirCheckBox* cb_sort; // 0x328
	UMirCanvasPanel* cp_sort; // 0x330
	UMirButton* btn_sort_combat_point; // 0x338
	UMirButton* btn_sort_level; // 0x340
	UMirButton* btn_sort_grade; // 0x348
	UMirImage* img_sort_combat_point; // 0x350
	UMirImage* img_sort_level; // 0x358
	UMirImage* img_sort_grade; // 0x360
	UMirTextBlock* txt_last; // 0x368
	UMM_Common_ToolTipBtn* tooltip_partner; // 0x370
};

struct UFontImportOptions {
	FFontImportOptionsData Data; // 0x28
};

struct UContentsLightData {
	TMap<EPlayerClassID, FContentsLightValue> CustomizingClassLight; // 0x30
	TMap<EPlayerClassID, FContentsPostProcessValue> CustomizingClassPostProcess; // 0x80
	TMap<EPlayerClassID, FContentsLightValue> UIClassLight; // 0xd0
	TMap<EPlayerClassID, FContentsPostProcessValue> UIClassPostProcess; // 0x120
	TMap<EPlayerClassID, FContentsLightValue> UIForceLight; // 0x170
	TMap<EPlayerClassID, FContentsPostProcessValue> UIForcePostProcess; // 0x1c0
	FContentsLightValue VehicleLight; // 0x210
	FContentsPostProcessValue VehiclePostProcess; // 0x254
	FContentsLightValue DarkPetLight; // 0x270
	FContentsPostProcessValue DarkPetPostProcess; // 0x2b4
	FContentsLightValue BrightPetLight; // 0x2d0
	FContentsPostProcessValue BrightPetPostProcess; // 0x314
};

struct UMM_Dominion_Title_NormalSlot {
	UMirTextBlock* m_pTxtClass; // 0x2e0
	UMirTextBlock* m_pTxtName; // 0x2e8
	UMM_Common_Btn_Symbol* m_pBtnInfo; // 0x2f0
	UMM_GuildMemberPortrait* m_pPortrait; // 0x2f8
	UMirButton* m_pBtnClick; // 0x300
};

struct UNavigationSystemConfig {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct URuntimeVirtualTextureStreamingProxy {
	FVirtualTextureBuildSettings Settings; // 0x100
	bool bSinglePhysicalSpace; // 0x10c
	uint32_t BuildHash; // 0x110
};

struct UMM_CharacterPartsComponent {
	FString m_AnimPath; // 0x100
	TArray<int32_t> m_DontDestroyPartsIndex; // 0x150
	UAnimInstance* m_pMainAnimInstance; // 0x160
	TMap<int32_t, USkeletalMeshComponent*> m_mapSkeletalMeshComponent; // 0x238
	TMap<int32_t, UStaticMeshComponent*> m_mapStaticMeshComponent; // 0x288
	char bDoneUseMaterialUpdate : 1; // 0x3d1
	char bUseAttachParentBound : 1; // 0x3d1
	char bComponentUseFixedSkelBounds : 1; // 0x3d1
	FVector BoundsMin; // 0x3d4
	FVector BoundsMax; // 0x3e0
	char bCustomBoundsExtension : 1; // 0x3ec
	FVector PositiveBounds; // 0x3f0
	FVector NegativeBounds; // 0x3fc
	FLinearColor m_BurstEmissive_DCOlor; // 0x408
	float m_fBurstFresnel_Exponenth; // 0x418
	float m_fBurstFresnel_BaseReflect; // 0x41c
	float m_fBurstFresnel_power; // 0x420
	FLinearColor m_HitColorLow; // 0x424
	float m_fHitFresnel_Exponenth; // 0x434
	float m_fHitFresnel_BaseReflect; // 0x438
	float m_fConstFlashTime; // 0x43c
	float m_fConstGuardHitFlashTime; // 0x440
	float DieEffectTime; // 0x444
	float Dissolve; // 0x448
	float EmissiveBurn; // 0x44c
	FLinearColor EmissiveBurn_Color; // 0x450
	TMap<int32_t, FCharacterPartsMID> m_mapCharacterMID; // 0x488
	TMap<int32_t, FCharacterPartsMID> m_mapDieMID; // 0x4d8
	TMap<int32_t, FCharacterPartsMID> m_mapMaskedMID; // 0x528
	TMap<int32_t, FCharacterPartsMID> m_mapCachedMID; // 0x578
	UMaterialInstance* m_CustomMaterialInstance; // 0x5c8
	TMap<FString, UObject*> m_mapCachedAnim; // 0x5d0
	TMap<int32_t, UObject*> m_mapCachedMesh; // 0x620
};

struct UClothPhysicalMeshDataNv {
	TArray<float> MaxDistances; // 0xe0
	TArray<float> BackstopDistances; // 0xf0
	TArray<float> BackstopRadiuses; // 0x100
	TArray<float> AnimDriveMultipliers; // 0x110
};

struct UAIDataProvider_QueryParams {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UMM_USerEvent_BP_Attendance {
	int32_t STRING_ID_BTN_BUY; // 0x2f0
	int32_t STRING_ID_BTN_ACTIVE; // 0x2f4
	UMirTextBlock* m_Txt_Name; // 0x2f8
	UMirImage* m_Img_Thumb; // 0x300
	UMM_UserEvent_WebBanner* m_WebBanner; // 0x308
	UMirScrollBox* m_ScrollBox; // 0x310
	UMirTextBlock* m_Txt_Season_Schedule; // 0x318
	UMirTextBlock* m_Txt_Btn_Name1; // 0x320
	UMirTextBlock* m_Txt_Btn_Name2; // 0x328
	UMirButton* m_Btn_Buy1; // 0x330
	UMirButton* m_Btn_Buy2; // 0x338
	UMirImage* m_Img_Indicator_1; // 0x340
	UMirImage* m_Img_Indicator_2; // 0x348
	UMM_Common_Btn* m_C_Btn_ReceiveAll; // 0x350
};

struct UMM_Slot_Refund_Sanctions_List {
	UMirTextBlock* m_Txt_PayTime; // 0x350
	UMirTextBlock* m_Txt_ProductName; // 0x358
	UMirTextBlock* m_Txt_PayNumber; // 0x360
	UPanelWidget* m_Can_PayButton; // 0x368
	UMirTextBlock* m_Txt_PayCost; // 0x370
	UMirButton* m_Btn_Pay; // 0x378
	UMirTextBlock* m_Txt_PayComplete; // 0x380
};

struct UMM_Occupation_Observer_KillLog_Slot {
	FLinearColor Defence_Name_Color; // 0x2e0
	FLinearColor Offence_Name_Color; // 0x2f0
	UMirTextBlock* m_Txt_AttackerName; // 0x300
	UMirTextBlock* m_Txt_TargetName; // 0x308
	UMirImage* m_Img_Defence_Attack_Icon; // 0x310
	UMirImage* m_Img_Offence_Attack_Icon; // 0x318
	UMirImage* m_Img_Background; // 0x320
	UWidgetAnimation* AnimationStart_Left; // 0x328
	UWidgetAnimation* AnimationStart_Right; // 0x330
	UWidgetAnimation* AnimationEnd_Left; // 0x338
	UWidgetAnimation* AnimationEnd_Right; // 0x340
	TWeakObjectPtr<UMM_Occupation_Observer_KillLog> m_OwnerWidget; // 0x348
};

struct UMovieSceneGeometryCacheTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x58
};

struct UAnimNotifyState_TimedParticleEffect {
	UParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UMM_HudPartyUser {
	FLinearColor COLOR_HP_BAR_YELLOW; // 0x2f0
	FLinearColor COLOR_HP_BAR_RED; // 0x300
	UCanvasPanel* m_Can_Panel; // 0x318
	UMirImage* m_Img_VoiceChat_On; // 0x320
	UMirImage* m_Img_VoiceChat_Off; // 0x328
	UImage* m_Img_Leader; // 0x330
	UImage* m_Img_Class; // 0x338
	UTextBlock* m_TxtNickName; // 0x340
	UImage* m_Img_Invite; // 0x348
	UPanelWidget* m_Grid_HP; // 0x350
	UProgressBar* m_Prg_HP; // 0x358
	UProgressBar* m_Prg_Shield; // 0x360
	UPanelWidget* m_Can_PrgEffect_1; // 0x368
	UPanelWidget* m_Grid_Revival; // 0x370
	UMirTextBlock* m_Txt_Revival; // 0x378
	UMirButton* m_Btn_Main; // 0x380
	UMirButton* m_Btn_Invite; // 0x388
};

struct UMM_Slot_Occupation_Ranking {
	UMirListView* m_ranking_ListView; // 0x2e0
	TArray<URankingSlotObj*> m_rankSlot_List; // 0x2e8
};

struct UMM_Inventory_AutoSmelt {
	UMM_NewInventoryTab* m_InvenTab; // 0x2f8
	UMM_NewInventory* m_Inven; // 0x300
};

struct ACameraRig_Rail {
	float CurrentPositionOnRail; // 0x218
	bool bLockOrientationToRail; // 0x21c
	USceneComponent* TransformComponent; // 0x220
	USplineComponent* RailSplineComponent; // 0x228
	USceneComponent* RailCameraMount; // 0x230
};

struct UAnimCompress_BitwiseCompressOnly {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	char bEnableSegmenting : 1; // 0x38
	uint32_t IdealNumFramesPerSegment; // 0x3c
	uint32_t MaxNumFramesPerSegment; // 0x40
	AnimationCompressionFormat TranslationCompressionFormat; // 0x44
	AnimationCompressionFormat RotationCompressionFormat; // 0x45
	AnimationCompressionFormat ScaleCompressionFormat; // 0x46
	float MaxCurveError; // 0x48
};

struct UMM_PopUp_GuildJoinOrCreation {
	UMirTextBlock* Txt_Title; // 0x2e0
	UMirRichTextBlock* r_txt_message; // 0x2e8
	UMM_Common_Btn* Btn_First; // 0x2f0
	UMM_Common_Btn* Btn_Second; // 0x2f8
	UMM_Common_Btn_Symbol* btn_close; // 0x300
};

struct UAndroidPermissionCallbackProxy {
	FScriptMulticastDelegate OnPermissionsGrantedDynamicDelegate; // 0x28
};

struct UParticleModuleVectorFieldLocal {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UMM_ContentsGetItemMsg {
	EContentsGetItemMsgType m_eWidgetType; // 0x2f0
	float m_fSettingTime_NextMessage; // 0x2f4
	float m_fSettingTime_NextMessage_MakeItem; // 0x2f8
	float m_fSettingTime_TitleEffect; // 0x2fc
	float m_fSettingTime_StartDisplaySlot; // 0x300
	float m_fSettingTime_NextSlot; // 0x304
	float m_fSettingTime_SlotOpacity; // 0x308
	float m_fSettingTime_SlotEffect; // 0x30c
	UWidgetAnimation* m_AniStart_Single_Item; // 0x310
	UWidgetAnimation* m_AniStart_Single_Cost; // 0x318
	UWidgetAnimation* m_AniStart_Multiple; // 0x320
	UWidgetAnimation* m_AniStart_Special; // 0x328
	UWidgetAnimation* m_AniStart_MakeSuccess_Item; // 0x330
	UWidgetAnimation* m_AniStart_MakeSuccessBonus_Item; // 0x338
	UWidgetAnimation* m_AniStart_MakeFail_Item; // 0x340
	UWidgetAnimation* m_AniEnd; // 0x348
	UMirButton* m_Btn_Main; // 0x450
	UMM_Slot_Registered_Circle* m_ItemSlot_Title; // 0x458
	UMirRichTextBlock* m_RTxt_TitleMain; // 0x460
	UMirImage* m_Img_Polish_One; // 0x468
	UMirImage* m_Img_Polish_All; // 0x470
	UPanelWidget* m_Hrz_TitleInfoDeco; // 0x478
	UMirRichTextBlock* m_RTxt_TitleSub; // 0x480
	UMirRichTextBlock* m_RTxt_AddedOptionName; // 0x488
	UMirRichTextBlock* m_RTxt_AddedOptionValue; // 0x490
	UMM_Slot_Material* m_arItemSlot[0xa]; // 0x498
	UGridSlot* m_arItemSlot_GridSlot[0xa]; // 0x4e8
	UPanelWidget* m_arItemSlot_EffectPanel[0xa]; // 0x538
};

struct UMovieSceneTransformTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UCanvasPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UMM_Map_Rader {
	float m_fRotateSpeed; // 0x2e0
	UTextBlock* m_TxtMapName; // 0x2f0
	UTextBlock* m_TxtChannel; // 0x2f8
	UTextBlock* m_TxtAreaInfo; // 0x300
	UPanelWidget* m_GridMapDetail; // 0x308
	UPanelWidget* m_GridMapDetailRotate; // 0x310
	UMM_Map_Detail* m_MapDetail; // 0x318
	UButton* m_BtnMapDetail; // 0x320
};

struct UMM_GameOption_PC {
	UMM_CommonVerticalTabSet* PC_TabSet; // 0x2f0
	UWidgetSwitcher* WidgetSwitcher; // 0x2f8
	UMM_GameOption_KeySetting* game_option_key_setting; // 0x300
};

struct UMaterialExpressionFrac {
	FExpressionInput Input; // 0x40
};

struct UMM_Map_Waypoint_List_Slot {
	int32_t m_iIcon_NormalWaypoint; // 0x2f0
	int32_t m_iIcon_UnableWaypoint; // 0x2f4
	int32_t IconAbleFixedNPC; // 0x2f8
	int32_t IconAble_NPC_Shop; // 0x2fc
	int32_t IconAble_NPC_ItemMake; // 0x300
	int32_t IconAble_NPC_Exchange; // 0x304
	int32_t IconAble_NPC_BeautySalon; // 0x308
	int32_t IconAbleEventNPC; // 0x30c
	int32_t IconAbleInventoryNPC; // 0x310
	int32_t IconAble_Relation; // 0x314
	int32_t IconAbleNamed; // 0x318
	int32_t IconUnableNamed; // 0x31c
	int32_t IconAbleBoss; // 0x320
	int32_t IconUnableBoss; // 0x324
	int32_t IconAbleFieldBoss; // 0x328
	int32_t IconUnableFieldBoss; // 0x32c
	int32_t IconAbleWorldBoss; // 0x330
	int32_t IconUnableWorldBoss; // 0x334
	int32_t IconAbleEliteModeType; // 0x338
	int32_t IconUnableEliteModeType; // 0x33c
	int32_t IconAbleMining; // 0x340
	int32_t IconUnableMining; // 0x344
	int32_t IconAbleGather; // 0x348
	int32_t IconUnableGather; // 0x34c
	int32_t IconAbleBMining; // 0x350
	int32_t IconUnableBMining; // 0x354
	int32_t IconAbleZinki; // 0x358
	int32_t IconUnableZinki; // 0x35c
	int32_t IconAbleMonsterSpawn; // 0x360
	int32_t IconUnableMonsterSpawn; // 0x364
	FVector2D m_vIconSize; // 0x368
	int32_t IconAbleSanctum; // 0x370
	int32_t IconUnableSanctum; // 0x374
	int32_t IconAbleDascoMeltingNPC; // 0x378
	UMirImage* m_Img_Icon; // 0x390
	UMirTextBlock* m_Txt_Name; // 0x398
	UMirTextBlock* m_Txt_Explored; // 0x3a0
	UMirImage* m_Img_Selected; // 0x3a8
	UPanelWidget* m_Grid_Disabled; // 0x3b0
	UMirButton* m_Btn_Main; // 0x3b8
};

struct UMaterialExpressionLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct UMM_Passive_RandomSlot {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMM_Map_Minimap {
	UMM_Map_Detail* m_MapDetail; // 0x300
	UMM_CommonHorizontalTabSet* m_CTHrzTabSet; // 0x308
	UMM_Map_Waypoint_List* m_MapWaypointList; // 0x310
	UMM_Map_Occupation* m_MapOccupation; // 0x318
	UPanelWidget* m_Grid_DropItem; // 0x320
	UMirListView* m_ListView_DropItemList; // 0x328
	UMirCheckBox* m_CheckBox_SectorGrade; // 0x330
	UMM_Common_ToolTipBtn* m_pBtnCommToolTip; // 0x338
	TArray<UMaterialSlotObj*> m_arDropItemSlotObj; // 0x340
	UHorizontalBox* m_Hrz_Sanctum; // 0x350
	UMirTextBlock* m_Txt_Sanctum; // 0x358
	int32_t m_iFontSize; // 0x364
	int32_t m_iMiddleFontSize; // 0x368
	int32_t m_iSmallFontSize; // 0x36c
	int32_t m_iBidoFontSize; // 0x370
	int32_t m_iEliteFontSize; // 0x374
};

struct UWeaponMaterialNotify {
	TArray<FWeaponMaterialData> m_arrWeaponMaterial; // 0x30
};

struct UBTComposite_Selector {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
	char bApplyDecoratorScope : 1; // 0x88
};

struct UMM_Popup_ServerVisit_GuildAlly_Slot {
	UMirTextBlock* m_Txt_GuildName; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Add_GuildList; // 0x2e8
	UMM_Common_Btn_Symbol* m_Btn_Remove_GuildList; // 0x2f0
};

struct UEnvQueryGenerator_Donut {
	FAIDataProviderFloatValue InnerRadius; // 0x80
	FAIDataProviderFloatValue OuterRadius; // 0xb0
	FAIDataProviderIntValue NumberOfRings; // 0xe0
	FAIDataProviderIntValue PointsPerRing; // 0x110
	FEnvDirection ArcDirection; // 0x140
	FAIDataProviderFloatValue ArcAngle; // 0x160
	bool bUseSpiralPattern; // 0x190
	UEnvQueryContext* Center; // 0x198
	char bDefineArc : 1; // 0x1a0
};

struct AGeometryCollectionDebugDrawActor {
	FGeometryCollectionDebugDrawWarningMessage WarningMessage; // 0x218
	FGeometryCollectionDebugDrawActorSelectedRigidBody SelectedRigidBody; // 0x220
	bool bDebugDrawWholeCollection; // 0x238
	bool bDebugDrawHierarchy; // 0x239
	bool bDebugDrawClustering; // 0x23a
	EGeometryCollectionDebugDrawActorHideGeometry HideGeometry; // 0x23b
	bool bShowRigidBodyId; // 0x23c
	bool bShowRigidBodyCollision; // 0x23d
	bool bCollisionAtOrigin; // 0x23e
	bool bShowRigidBodyTransform; // 0x23f
	bool bShowRigidBodyInertia; // 0x240
	bool bShowRigidBodyVelocity; // 0x241
	bool bShowRigidBodyForce; // 0x242
	bool bShowRigidBodyInfos; // 0x243
	bool bShowTransformIndex; // 0x244
	bool bShowTransform; // 0x245
	bool bShowParent; // 0x246
	bool bShowLevel; // 0x247
	bool bShowConnectivityEdges; // 0x248
	bool bShowGeometryIndex; // 0x249
	bool bShowGeometryTransform; // 0x24a
	bool bShowBoundingBox; // 0x24b
	bool bShowFaces; // 0x24c
	bool bShowFaceIndices; // 0x24d
	bool bShowFaceNormals; // 0x24e
	bool bShowSingleFace; // 0x24f
	int32_t SingleFaceIndex; // 0x250
	bool bShowVertices; // 0x254
	bool bShowVertexIndices; // 0x255
	bool bShowVertexNormals; // 0x256
	bool bUseActiveVisualization; // 0x257
	float PointThickness; // 0x258
	float LineThickness; // 0x25c
	bool bTextShadow; // 0x260
	float TextScale; // 0x264
	float NormalScale; // 0x268
	float AxisScale; // 0x26c
	float ArrowScale; // 0x270
	FColor RigidBodyIdColor; // 0x274
	float RigidBodyTransformScale; // 0x278
	FColor RigidBodyCollisionColor; // 0x27c
	FColor RigidBodyInertiaColor; // 0x280
	FColor RigidBodyVelocityColor; // 0x284
	FColor RigidBodyForceColor; // 0x288
	FColor RigidBodyInfoColor; // 0x28c
	FColor TransformIndexColor; // 0x290
	float TransformScale; // 0x294
	FColor LevelColor; // 0x298
	FColor ParentColor; // 0x29c
	float ConnectivityEdgeThickness; // 0x2a0
	FColor GeometryIndexColor; // 0x2a4
	float GeometryTransformScale; // 0x2a8
	FColor BoundingBoxColor; // 0x2ac
	FColor FaceColor; // 0x2b0
	FColor FaceIndexColor; // 0x2b4
	FColor FaceNormalColor; // 0x2b8
	FColor SingleFaceColor; // 0x2bc
	FColor VertexColor; // 0x2c0
	FColor VertexIndexColor; // 0x2c4
	FColor VertexNormalColor; // 0x2c8
	UBillboardComponent* SpriteComponent; // 0x2d0
};

struct UMM_Popup_Loading {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMovieSceneMediaSection {
	UMediaSource* MediaSource; // 0xe0
	bool bLooping; // 0xe8
	FFrameNumber StartFrameOffset; // 0xec
	UMediaTexture* MediaTexture; // 0xf0
	UMediaSoundComponent* MediaSoundComponent; // 0xf8
	bool bUseExternalMediaPlayer; // 0x100
	UMediaPlayer* ExternalMediaPlayer; // 0x108
};

struct UGuildWarMonsterComponent {
	TWeakObjectPtr<AMM_Monster> m_Owner; // 0xb0
};

struct UOnlineSubsystemExtendedSteamWidget {
	UOnlineSubsystemExtendedSteamWebBrowser* WebBrowser; // 0x240
	UButton* m_Btn_Close; // 0x268
};

struct UMM_Slot_Inventory_BG {
	UMirImage* slot_inventory_bg; // 0x510
	UPanelWidget* slot_inventory; // 0x518
};

struct UInterpTrackFloatBase {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UParticleModuleTypeDataGpu {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UMM_Popup_Relation_RewardInfo {
	UMirButton* m_Btn_BG_Close; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e8
	UMirListView* m_ListView_RewardList; // 0x2f0
	TArray<URelationRewardInfoSlotObj*> m_arRewardSlotObj; // 0x310
};

struct UInAppPurchaseCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct USoundNodeModulator {
	float PitchMin; // 0x40
	float PitchMax; // 0x44
	float VolumeMin; // 0x48
	float VolumeMax; // 0x4c
};

struct UMM_GetItemWayListSlot_Category {
	UMirButton* m_Btn_Main; // 0x2f0
	UPanelWidget* m_Grid_Effect; // 0x2f8
	UMirTextBlock* m_Txt_Name; // 0x300
	UMirImage* m_Img_Icon; // 0x308
	UMirImage* m_Img_Lock; // 0x310
	UMirImage* m_Img_Disable; // 0x318
	UMirTextBlock* m_Txt_Title; // 0x320
	URichTextBox* Txt_StageTitle; // 0x328
	UMM_Common_Btn* m_Btn_Go; // 0x330
	UWidgetSwitcher* WSwitcher; // 0x338
	int32_t m_Type; // 0x340
	int32_t m_SubType; // 0x344
	FString m_strName; // 0x348
	int32_t m_StageLock; // 0x358
	bool m_StageEnableCombatPower; // 0x35c
	int32_t STRID_STAGELOCK_LEVEL; // 0x360
	int32_t STRID_STAGELOCK_QUEST; // 0x364
	int32_t STRID_STAGELOCK_COMBATPOWER; // 0x368
	int32_t STRID_STAGELOCK_NOGUILD; // 0x36c
	int32_t STRID_STAGELEVEL; // 0x370
};

struct UInterpTrackInstFloatParticleParam {
	float ResetFloat; // 0x28
};

struct UMaterialExpressionArccosineFast {
	FExpressionInput Input; // 0x40
};

struct UMM_Popup_Auction_ItemSlot {
	UMirTextBlock* m_pTxtSellCount; // 0x2e0
	UMirScrollBox* m_pScrollList; // 0x2e8
};

struct UMMRichTextBox {
	FText Text; // 0x2e0
	FSlateFontInfo Font; // 0x2f8
	FVector2D ShadowOffset; // 0x348
	FLinearColor ShadowColorAndOpacity; // 0x350
	float MinDesiredWidth; // 0x360
	ETextJustify Justification; // 0x364
	FMargin Margin; // 0x368
	float LineHeightPercentage; // 0x378
	bool AutoWrapText; // 0x37c
	float WrapTextAt; // 0x380
	ETextWrappingPolicy WrappingPolicy; // 0x384
	URichTextBox* m_RTxt_Content; // 0x388
};

struct UInputTouchDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x28
};

struct UBlendSpaceBase {
	bool bRotationBlendInMeshSpace; // 0x88
	float AnimLength; // 0x8c
	FInterpolationParameter InterpolationParam[0x3]; // 0x90
	float TargetWeightInterpolationSpeedPerSec; // 0xa8
	ENotifyTriggerMode NotifyTriggerMode; // 0xac
	TArray<FPerBoneInterpolation> PerBoneBlend; // 0xb0
	int32_t SampleIndexWithMarkers; // 0xc0
	TArray<FBlendSample> SampleData; // 0xc8
	TArray<FEditorElement> GridSamples; // 0xd8
	FBlendParameter BlendParameters[0x3]; // 0xe8
};

struct UPhotoModeData {
	float DefaultHeight; // 0x30
	float DefaultYaw; // 0x34
	float DefaultPitch; // 0x38
	float DefaultDistance; // 0x3c
	FPhotoMode_ValueRange CameraWidthRagne; // 0x40
	FPhotoMode_ValueRange CameraHighRange; // 0x48
	FPhotoMode_ValueRange CameraPitchRange; // 0x50
	FPhotoMode_ValueRange CameraDistanceRange; // 0x58
	TMap<int32_t, UAnimBlueprint*> Map_PtrClassAnimBP; // 0x60
	TArray<FPhotoMode_Pose> Class1_PoseData; // 0xb0
	TArray<FPhotoMode_Pose> Class2_PoseData; // 0xc0
	TArray<FPhotoMode_Pose> Class3_PoseData; // 0xd0
	TArray<FPhotoMode_Pose> Class4_PoseData; // 0xe0
	TArray<FPhotoMode_Pose> Class5_PoseData; // 0xf0
	TArray<FPhotoMode_Filter> FilterData; // 0x100
	float DOF_FocalDistance_Def; // 0x110
	float DOF_FocalDistance_Min; // 0x114
	float DOF_FocalDistance_Max; // 0x118
	float FOV_Def; // 0x11c
	float FOV_Min; // 0x120
	float FOV_Max; // 0x124
	float Brightness_Def; // 0x128
	float Brightness_Min; // 0x12c
	float Brightness_Max; // 0x130
	TMap<EPhotoModeOptionType, FPhotoMode_Option> Map_Option; // 0x138
	int32_t STRID_PoseTitle; // 0x188
	int32_t STRID_FilterTitle; // 0x18c
	int32_t STRID_DOFTitle; // 0x190
	int32_t STRID_FOVTitle; // 0x194
	int32_t STRID_BrightnessTitle; // 0x198
	int32_t STRID_PhotoModeOption; // 0x19c
	int32_t STRID_CharShowOption; // 0x1a0
	int32_t STRID_CharNameTagShowOption; // 0x1a4
	int32_t STRID_GuildMarkOption; // 0x1a8
	int32_t STRID_GuildNameOption; // 0x1ac
};

struct UARTrackedPoint {
	FGuid UniqueId; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct USpectatorBeaconState {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UAREnvironmentCaptureProbeTexture {
	EARTextureType TextureType; // 0x128
	float Timestamp; // 0x12c
	FGuid ExternalTextureGuid; // 0x130
	FVector2D Size; // 0x140
};

struct UMM_CharAbility_Info_Pet {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UEditableStaticMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct UAutomationTestSettings {
	TArray<FString> EngineTestModules; // 0x28
	TArray<FString> EditorTestModules; // 0x38
	FSoftObjectPath AutomationTestmap; // 0x48
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x60
	TArray<FSoftObjectPath> AssetsToOpen; // 0x70
	FBuildPromotionTestSettings BuildPromotionTest; // 0x80
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x270
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2a0
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2b0
	TArray<FString> TestLevelFolders; // 0x2e0
	TArray<FExternalToolDefinition> ExternalTools; // 0x2f0
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x300
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x310
	FIntPoint DefaultScreenshotResolution; // 0x320
};

struct UFacebookLoginSubSystem {
	UFirebaseCredential* m_WindowFirebaseCredential; // 0x40
};

struct UTouchInterface {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UMM_UIAction_GuildExpedition {
	UMM_B_DungeonCommon* m_pCurDungeonWidget; // 0x90
};

struct APhysicsThruster {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x218
};

struct UGameSessionSettings {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UMM_B_Smite {
	UWidgetAnimation* m_AniLoop; // 0x2e0
};

struct UMovieSceneSlomoTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UParticleEmitter {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct UParticleModuleSubUVBase {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct UMM_UIShopPeriodDetailSlot {
	UMirTextBlock* mTxtPeriodTitle; // 0x2e0
};

struct UFoliageType {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	FBodyInstance BodyInstance; // 0x158
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x268
	FLightingChannels LightingChannels; // 0x269
	char bRenderCustomDepth : 1; // 0x26c
	int32_t CustomDepthStencilValue; // 0x270
	int32_t TranslucencySortPriority; // 0x274
	float CollisionRadius; // 0x278
	float ShadeRadius; // 0x27c
	int32_t NumSteps; // 0x280
	float InitialSeedDensity; // 0x284
	float AverageSpreadDistance; // 0x288
	float SpreadVariance; // 0x28c
	int32_t SeedsPerStep; // 0x290
	int32_t DistributionSeed; // 0x294
	float MaxInitialSeedOffset; // 0x298
	bool bCanGrowInShade; // 0x29c
	bool bSpawnsInShade; // 0x29d
	float MaxInitialAge; // 0x2a0
	float MaxAge; // 0x2a4
	float OverlapPriority; // 0x2a8
	FFloatInterval ProceduralScale; // 0x2ac
	FRuntimeFloatCurve ScaleCurve; // 0x2b8
	int32_t ChangeCount; // 0x340
	char ReapplyDensity : 1; // 0x344
	char ReapplyRadius : 1; // 0x344
	char ReapplyAlignToNormal : 1; // 0x344
	char ReapplyRandomYaw : 1; // 0x344
	char ReapplyScaling : 1; // 0x344
	char ReapplyScaleX : 1; // 0x344
	char ReapplyScaleY : 1; // 0x344
	char ReapplyScaleZ : 1; // 0x344
	char ReapplyRandomPitchAngle : 1; // 0x345
	char ReapplyGroundSlope : 1; // 0x345
	char ReapplyHeight : 1; // 0x345
	char ReapplyLandscapeLayers : 1; // 0x345
	char ReapplyZOffset : 1; // 0x345
	char ReapplyCollisionWithWorld : 1; // 0x345
	char ReapplyVertexColorMask : 1; // 0x345
	char bEnableDensityScaling : 1; // 0x345
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x348
	int32_t VirtualTextureCullMips; // 0x358
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x35c
};

struct UMaterialExpressionFeatureLevelSwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct UMM_GameOption_Account {
	UMirTextBlock* Txt_CharacterName; // 0x2f0
	UMirTextBlock* Txt_AccountName; // 0x2f8
	UMM_Common_Btn_Symbol* Btn_EditNickName; // 0x300
	UMM_Common_Btn_Symbol* Btn_Account_Apple; // 0x308
	UMirTextBlock* Txt_Account_Apple; // 0x310
	UMM_Common_Btn_Symbol* Btn_Account_Google; // 0x318
	UMirTextBlock* Txt_Account_Google; // 0x320
	UMM_Common_Btn_Symbol* Btn_Account_Facebook; // 0x328
	UMirTextBlock* Txt_Account_Facebook; // 0x330
	UMM_Common_Btn_Symbol* Btn_Account_Steam; // 0x338
	UMirTextBlock* Txt_Account_Steam; // 0x340
	UMirCanvasPanel* Can_Slot_Steam; // 0x348
	UPanelWidget* Slot_Guest; // 0x350
	UMirTextBlock* Txt_Account_Guest; // 0x358
	UPanelWidget* Slot_GuestContinue; // 0x360
	UMM_Common_Btn_Symbol* Btn_Account_GuestContinue; // 0x368
	UMM_Common_Btn* m_CB_Help; // 0x370
	UMM_Common_Btn* m_CB_Customer; // 0x378
	UMM_Common_Btn* m_CB_ServicePolicy; // 0x380
	UMM_Common_Btn* m_CB_PrivacyPolicy; // 0x388
	UMM_Common_Btn* m_CB_Withdraw; // 0x390
	UMM_Common_Btn* m_CB_Coupon; // 0x398
	UMM_Common_Btn* m_CB_Community; // 0x3a0
	UMM_Common_Btn* m_CB_OneStoreLogout; // 0x3a8
	UMM_Common_Btn* m_CB_ChangeCharacter; // 0x3b0
	UMM_Common_Btn* m_CB_Logout; // 0x3b8
	UMM_Common_Btn* m_CB_MistranslationReport; // 0x3c0
	UMirTextBlock* m_Txt_VersionValue; // 0x3c8
	UMirTextBlock* m_Txt_WhiteListVersionValue; // 0x3d0
};

struct UMM_Xdraco_SealingInfo {
	UMM_Item_Make_Slot_Registered* m_pSlot_SealingItem; // 0x2f0
	TArray<UMM_ItemSealing_Material_Slot*> Slot_Material; // 0x2f8
	UPanelWidget* Grid_NeedCost1; // 0x308
	UMirImage* Img_NeedCost1; // 0x310
	UMirTextBlock* Txt_NeedCost1; // 0x318
	UMM_Common_Btn_Symbol* m_pBtn_NeedCost1; // 0x320
	UMirButton* m_pBtnMain_NeedCost1; // 0x328
	UPanelWidget* Grid_NeedCost2; // 0x330
	UMirImage* Img_NeedCost2; // 0x338
	UMirTextBlock* Txt_NeedCost2; // 0x340
	UMM_Common_Btn_Symbol* m_pBtn_NeedCost2; // 0x348
	UMirButton* m_pBtnMain_NeedCost2; // 0x350
	int32_t m_CostType_2; // 0x358
	int32_t m_CostType_3; // 0x35c
	UMirCanvasPanel* m_pPanel_Bottom; // 0x360
	UMM_Common_Btn* m_pBtn_Make; // 0x368
	UPanelWidget* m_pDecoEffectPanel; // 0x370
	UMirCanvasPanel* m_pPanel_Effect_Basic; // 0x378
	uint32_t m_iMakeItemID; // 0x380
	UVerticalBox* Panel_Notice_MinReserve; // 0x388
	UMirTextBlock* Txt_Notice_MinReserve; // 0x390
	UMirRichTextBlock* RTxt_Notice_MinReserve; // 0x398
};

struct UMovieSceneSpawnTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
	FGuid ObjectGuid; // 0x68
};

struct UMM_Popup_Teleport {
	UMirButton* m_pBtnBGClose; // 0x2f0
	UMM_Common_Btn_Symbol* m_pBtnSymClose; // 0x2f8
	UMM_Common_Btn* m_pBtnSymTeleport; // 0x300
	UMirScrollBox* m_pScrollBox; // 0x308
	UMM_Common_Board_Notice* m_pCommonBoard; // 0x310
};

struct AProceduralFoliageVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x250
};

struct UMM_Common_Item_NameTag {
	UMirTextBlock* Txt_TargetItemName; // 0x2f0
	UMirTextBlock* Txt_TargetItemSmeltingLv; // 0x2f8
	UMirImage* Img_TargetItemTier; // 0x300
	UPanelWidget* Panel_TargetItemGradePanel; // 0x308
	UMirTextBlock* Txt_TargetItemGrade; // 0x310
	UPanelWidget* Panel_TargetItemPolishPanel; // 0x318
	UMirImage* Img_TargetItemPolishEffect_One; // 0x320
	UMirImage* Img_TargetItemPolishEffect_All; // 0x328
	UPanelWidget* Panel_TargetItemSetPanel; // 0x330
	UPanelWidget* m_GridTier; // 0x338
};

struct UEnvQueryManager {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct UWidgetTree {
	UWidget* RootWidget; // 0x28
};

struct UMM_ShortCutKey {
	UMirCanvasPanel* cp_slot; // 0x2e0
	UMirButton* Btn_BG; // 0x2e8
};

struct UMM_SubTarget {
	UWidgetAnimation* m_Ani_SubTarget; // 0x2e0
};

struct UParticleModuleSubUVMovie {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UShowLoginUICallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFailure; // 0x40
};

struct AMyNpcSpawner {
	USkeletalMeshComponent* m_pMesh; // 0x218
	FVector m_BoxExtend; // 0x220
	FVector m_WarpCoordinate; // 0x22c
	float m_fCapsuleHalfHeigth; // 0x238
	float m_fCapsuleRadius; // 0x23c
	int32_t m_NpcID; // 0x240
	FString m_NpcNameTitle; // 0x248
	FString m_NpcName; // 0x258
	float m_InteractionRange; // 0x268
	float m_SightRange; // 0x26c
	bool m_bShowInteractionRange; // 0x270
	bool m_bSightRange; // 0x271
};

struct UMM_B_Login {
	bool m_bAbleTick; // 0x2f0
	float m_fProgressSpeed; // 0x2f4
	FLinearColor ServerCongestion_Normal; // 0x2f8
	FLinearColor ServerCongestion_Busy; // 0x308
	FLinearColor ServerCongestion_Saturation; // 0x318
	FLinearColor ServerState_Closed; // 0x328
	float m_fShowLoginInfoTime; // 0x338
	UPanelWidget* m_Grid_TouchNotice; // 0x350
	UMirTextBlock* m_Txt_ServerName; // 0x358
	UMirTextBlock* m_Txt_Peace; // 0x360
	UMirTextBlock* m_Txt_ServerState; // 0x368
	UMirButton* m_Btn_ServerChange; // 0x370
	UMirTextBlock* m_Txt_Version; // 0x378
	UMirTextBlock* m_Txt_LoadingPercent; // 0x380
	UPanelWidget* m_Can_Logout; // 0x388
	UMirImage* m_Img_LogoutIcon; // 0x390
	UMirButton* m_Btn_Logout; // 0x398
	UPanelWidget* m_Can_Option; // 0x3a0
	UMirButton* m_Btn_Option; // 0x3a8
	UPanelWidget* m_Overlay_GameStart; // 0x3b0
	UMirButton* m_Btn_GameStart; // 0x3b8
	UMirButton* m_Btn_Screen; // 0x3c0
	UMM_VolumeController* m_VolumeController; // 0x3c8
	UMirButton* m_Btn_AccountPopup; // 0x3d0
	UMirButton* m_Btn_BlockScreen; // 0x3d8
};

struct UMM_PKMode {
	UWidgetAnimation* m_pAnim_Start; // 0x2f0
	UWidgetAnimation* m_pAnim_End; // 0x2f8
	UMM_PKModeSlot* ListElementClass; // 0x300
	UMirWrapScrollBox* m_ScrollBoxList; // 0x308
	TArray<UMM_PKModeSlot*> PKSlotList; // 0x310
	int32_t m_TestValue; // 0x320
	int32_t ScrollBox_Offset; // 0x324
	float SkipTimer_ScrollBox; // 0x328
	UMirTextBlock* m_TextTitle; // 0x330
	UTextBlock* m_TextBlock_TendGrade; // 0x338
	UTextBlock* m_TextBlock_TendValue; // 0x340
	UTextBlock* m_TextPKExplain_1; // 0x348
	UTextBlock* m_TextPKExplain_2; // 0x350
	UCheckBox* m_CheckBox_OnlyUserTarget; // 0x358
	UTextBlock* m_TextBlock_OnlyUserTargetNotice; // 0x360
	UMM_Common_Btn* m_Btn_PKRecord; // 0x368
	UMirButton* Btn_Background; // 0x370
	UMM_Common_Btn_Symbol* btn_close; // 0x378
	UMM_Common_ToolTipBtn* Btn_Tooltip_Mode; // 0x380
	UMM_Common_ToolTipBtn* Btn_Tooltip_ModeChange; // 0x388
	UVerticalBox* m_VBox_1; // 0x390
	UVerticalBox* m_VBox_2; // 0x398
	UVerticalBox* m_VBox_3; // 0x3a0
	UVerticalBox* m_VBox_4; // 0x3a8
	TArray<UMM_Option_Ability*> m_SlotList_1; // 0x3b0
	TArray<UMM_Option_Ability*> m_SlotList_2; // 0x3c0
	TArray<UMM_Option_Ability*> m_SlotList_3; // 0x3d0
	TArray<UMM_Option_Ability*> m_SlotList_4; // 0x3e0
	UMM_Option_Ability* m_pRefWidget; // 0x3f0
	UMM_Scroll_Dots* m_ScrollDots; // 0x3f8
	int32_t ScrollBox_Offset_Old; // 0x404
	bool EventSkip; // 0x408
	UMirCanvasPanel* Can_AllyListBtn; // 0x410
	UMirButton* Btn_AllyList; // 0x418
};

struct UMM_Popup_Restore_Item {
	UMM_Common_Btn_Symbol* m_pBtnClose; // 0x2f0
	UMM_Common_Btn* m_pBtnMove; // 0x2f8
	UMirScrollBox* m_pScrollList; // 0x300
};

struct UMaterialInstance {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UMaterialInterface* Parent; // 0x90
	char bHasStaticPermutationResource : 1; // 0x98
	char bOverrideSubsurfaceProfile : 1; // 0x98
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xa0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xb0
	TArray<FTextureParameterValue> TextureParameterValues; // 0xc0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xd0
	TArray<FFontParameterValue> FontParameterValues; // 0xe0
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xf0
	TArray<UObject*> PermutationTextureReferences; // 0x108
	FStaticParameterSet StaticParameters; // 0x118
};

struct UMM_WarpMoveManager {
	bool bSendWarp; // 0x48
	bool UsedPortal; // 0x49
	bool WarpInProgress; // 0x4a
	EWarpMethodType WarpMethodType; // 0x4b
	EWarpContentsType WarpContentsType; // 0x4c
	int32_t StageId; // 0x50
	FVector DestLocation; // 0x54
	FRotator DestRotator; // 0x60
	int32_t RecvStageID; // 0x6c
	EAutoMoveState ReservedAutoMoveState; // 0x70
	EAutoBattleState ReservedAutoBattleState; // 0x71
	EBehaviorType ReservedBehaviorType; // 0x72
	int32_t TargetID; // 0x74
	int32_t TriggerPortalID; // 0x78
	int32_t ActiveQuestID; // 0x7c
	int32_t ActiveQuestType; // 0x80
	int32_t MoveRequestID; // 0x84
	int32_t MoveRequestNpcID; // 0x88
	int32_t ServerWarpMethod; // 0x8c
	bool ScriptWarp; // 0x90
	bool bChannelWaiting; // 0x91
	int32_t iChannelWaitingWarpTID; // 0x94
	int64_t iChannelWaitingZoneUID; // 0x98
	int64_t ZoneUniqueID; // 0xa0
};

struct UBTTask_DisableCounterAttack {
	EBTNodeResult ReturnResult; // 0x70
};

struct UParticleModuleOrbitBase {
	char bUseEmitterTime : 1; // 0x30
};

struct UMM_B_Synthesis {
	UMM_CommonVerticalTabSet* m_C_Tab_Vertical; // 0x2e0
	UMM_CommonHorizontalTabSet* m_C_Tab_Horizon; // 0x2e8
	UMM_ItemSynthesis* m_ItemSynthesis; // 0x2f0
	UMM_ItemSynthesis_Inven* m_ItemSynthesis_Inven; // 0x2f8
};

struct UMM_PopUp_ItemInfo_List {
	UMM_PopUp_ItemInfo_Ability* Combat_Ability; // 0x2e8
	UPanelWidget* m_CombatGrid; // 0x2f0
	UTextBlock* m_CombatTxt; // 0x2f8
	UPanelWidget* m_ItemNameEquipLVGrid; // 0x300
	UPanelWidget* m_NameGrid; // 0x308
	UTextBlock* m_ItemName; // 0x310
	UTextBlock* m_OverlapEquipAble; // 0x318
	UPanelWidget* m_EquipLvGrid; // 0x320
	UTextBlock* m_EquipLvTxt; // 0x328
	UTextBlock* m_JobTxt; // 0x330
	bool isShowItemLine; // 0x338
	UPanelWidget* m_ItemLine; // 0x340
	UPanelWidget* m_SmeltGrid; // 0x348
	UTextBlock* m_SmeltValue; // 0x350
	UPanelWidget* m_SpecialAbilityGrid; // 0x358
	UPanelWidget* m_AbilityLine; // 0x360
	UPanelWidget* m_AbilityGrid; // 0x368
	TArray<UMM_PopUp_ItemInfo_Ability*> m_Abilities; // 0x370
	UMirCanvasPanel* m_Grid_Trade; // 0x380
	UMM_Common_Btn_Symbol* m_AddOptionBtn; // 0x388
	UPanelWidget* m_OptionGrid; // 0x3a0
	UMirTextBlock* m_OptionName; // 0x3a8
	UImage* Img_OptionBG; // 0x3b0
	TArray<UMM_PopUp_ItemInfo_Ability*> m_OptionAbilities; // 0x3b8
	UPanelWidget* m_ItemSetGrid; // 0x3c8
	UTextBlock* m_SetNameCount; // 0x3d0
	UPanelWidget* m_SetAbilityGrid; // 0x3d8
	TArray<UMM_PopUp_ItemInfo_Ability*> m_SetItemAbillities; // 0x3e0
	UPanelWidget* m_ItemDescGrid; // 0x3f0
	UTextBlock* m_ItemDesc; // 0x3f8
	UPanelWidget* m_Grid_Unsealing; // 0x400
	UMirTextBlock* m_Txt_UnsealingTime; // 0x408
	UPanelWidget* m_Grid_TermTime; // 0x410
	UMirTextBlock* m_Txt_TermTime; // 0x418
	UPanelWidget* m_DurabilityGrid; // 0x420
	UMirTextBlock* m_Txt_Durability; // 0x428
	UPanelWidget* m_ItemSellGrid; // 0x430
	UMirTextBlock* m_ItemSellTitle; // 0x438
	UMirTextBlock* m_ItemSellPrice; // 0x440
	UMirTextBlock* m_OptionMaxStr; // 0x448
	UMirScrollBox* m_ScrollInfo; // 0x450
	UMirCanvasPanel* m_Panel_Package; // 0x458
	UMM_Common_Btn_Symbol* m_PackageBtn; // 0x460
	UPanelWidget* m_Panel_Source; // 0x468
	UMirTextBlock* m_Txt_SourceTitle; // 0x470
	UMirTextBlock* m_Txt_Source; // 0x478
	UMirTextBlock* m_Txt_CreateDate; // 0x480
	UMirTextBlock* m_Txt_Serial; // 0x488
	UMirTextBlock* m_Txt_SerialNumber; // 0x490
	UMirTextBlock* m_Txt_Limited; // 0x498
	UMirTextBlock* m_Txt_LimitedNumber; // 0x4a0
	UImage* m_Line_4; // 0x4a8
	TArray<UMirTextBlock*> m_Txt_StatNames; // 0x4b0
	bool m_IsLeftSide; // 0x4c0
	int32_t STRID_ITEM_DURABILITY; // 0x4c4
	int32_t STRID_MSG_TRADABLE; // 0x4c8
	int32_t STRID_MSG_REINFORCE_STATE; // 0x4cc
	int32_t STRID_MSG_REINFORCE; // 0x4d0
};

struct UMM_Popup_UIShopStepGoodsList {
	UMirTextBlock* m_TxtTitle; // 0x2f0
	UMirTextBlock* m_TxtDesc; // 0x2f8
	UMirListView* m_ListView; // 0x300
	UMM_Common_Btn_Symbol* m_BtnClose; // 0x308
};

struct UMM_PopupCharacterSearch {
	UMM_Common_Btn_Symbol* btn_close; // 0x2e0
	UMM_Common_Btn_Symbol* btn_prev; // 0x2e8
	UMM_Common_Btn_Symbol* btn_next; // 0x2f0
	UMM_Common_Btn* btn_confirm; // 0x2f8
	UMirTextBlock* txt_page; // 0x300
	UMirTextBlock* Txt_Title; // 0x308
	UMirTextBlock* Txt_Search; // 0x310
	UMirScrollBox* sb_list; // 0x318
};

struct UDemoNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x800
	float CheckpointSaveMaxMSPerFrame; // 0xc14
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xc48
	bool bIsLocalReplay; // 0xc58
	TArray<APlayerController*> SpectatorControllers; // 0xc60
};

struct ASkeletalEffect {
	USkeletalMeshComponent* m_pSkelMesh; // 0x218
};

struct URadialFalloff {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Radius; // 0xc0
	FVector Position; // 0xc4
	EFieldFalloffType Falloff; // 0xd0
};

struct UParticleModuleSizeMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x30
	char MultiplyX : 1; // 0x78
	char MultiplyY : 1; // 0x78
	char MultiplyZ : 1; // 0x78
};

struct UMM_Popup_GuestContinueSetting {
	UMM_Common_Btn* m_Btn_Confirm; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e8
	UMM_Common_Btn* m_Btn_LinkIDCopy; // 0x2f0
	UMirTextBlock* m_Txt_LinkID; // 0x2f8
	UMirEditableText* m_Edit_Password; // 0x300
	UMirTextBlock* m_Txt_Password_Empty; // 0x308
	UMirTextBlock* m_Txt_Password_Complete; // 0x310
};

struct UMM_Fame_List {
	UCanvasPanel* CanvasPanel; // 0x2e0
	UPanelWidget* Grid_Title_Info; // 0x2e8
	UMirScrollBox* ScrollBox_Info; // 0x2f0
	UPanelWidget* Grid_Board; // 0x2f8
	UMirScrollBox* ScrollBox_Board; // 0x300
	UMirTextBlock* Txt_Title_Info; // 0x308
	UMM_Common_Btn_Symbol* Btn_Close_Info; // 0x310
	UMirTextBlock* Txt_Title_Board; // 0x318
	UMM_Common_Btn_Symbol* Btn_Close_Board; // 0x320
	TArray<UMM_Fame_List_SubSlot*> InfoSlot_List; // 0x328
	TArray<UMM_Fame_DetailInfo_Slot*> BoardSlot_List; // 0x338
	int32_t m_MaxInfoSlotCount; // 0x348
	int32_t m_CurrentInfoSlotCount; // 0x34c
	int32_t m_MaxBoardSlotCount; // 0x350
	int32_t m_CurrentBoardSlotCount; // 0x354
	int32_t STRID_BOARD_TITLE; // 0x358
};

struct UParticleModuleColorBase {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct UScriptSubtitleWidget {
	FText m_SubtitleText; // 0x2e0
};

struct AGameStateBase {
	AGameModeBase* GameModeClass; // 0x218
	AGameModeBase* AuthorityGameMode; // 0x220
	ASpectatorPawn* SpectatorClass; // 0x228
	TArray<APlayerState*> PlayerArray; // 0x230
	bool bReplicatedHasBegunPlay; // 0x240
	float ReplicatedWorldTimeSeconds; // 0x244
	float ServerWorldTimeSecondsDelta; // 0x248
	float ServerWorldTimeSecondsUpdateFrequency; // 0x24c
};

struct UMM_B_UIShopAds {
	UMirCanvasPanel* m_Panel_MainTabBG; // 0x2f0
	UMirScrollBox* m_MainTabScrollBox; // 0x2f8
	UMirCanvasPanel* m_PanelSubTabLine; // 0x300
	UMirScrollBox* m_SubTabScrollBox; // 0x308
	UMM_UIShopGoodsListNormal* m_UIShopGoodsList; // 0x310
	UMirCanvasPanel* m_Panel_Ads; // 0x318
	UMirTextBlock* m_Txt_AdsTooltipTitle; // 0x320
	UMirTextBlock* m_Txt_AdsCoolTime; // 0x328
	UMirCheckBox* m_CheckBoxSkip; // 0x330
	UMirTextBlock* m_Txt_Skip; // 0x338
	UMM_Common_Btn_Cost* m_Btn_StartAds; // 0x340
	UMM_UIShopAdsRewardBox* m_AdsRewardBox; // 0x348
	UMM_UIShopAdsMovieWidget* m_MoviePlayerWidget; // 0x350
	UFadeWidget* m_FadeWidget; // 0x358
};

struct UMM_AdManager {
	FTimerHandle m_DelayHideBlockScreenTimeHandle; // 0x48
	FTimerHandle m_DelayRetryTimeHandle; // 0x50
	UObject* AdObject; // 0x88
};

struct UInGameAdManager {
	char bShouldPauseWhileAdOpen : 1; // 0x38
	TArray<DelegateProperty> ClickedBannerDelegates; // 0x40
	TArray<DelegateProperty> ClosedAdDelegates; // 0x50
};

struct UMaterialExpressionSquareRoot {
	FExpressionInput Input; // 0x40
};

struct UChaosPhysicalMaterial {
	float Friction; // 0x28
	float Restitution; // 0x2c
	float SleepingLinearVelocityThreshold; // 0x30
	float SleepingAngularVelocityThreshold; // 0x34
};

struct UCustomizingComponentBase {
	UMirTextBlock* m_Txt_Title; // 0x2e0
};

struct UMM_B_Guild_MarkChange {
	int32_t m_iCreateCost; // 0x300
	UWidgetAnimation* m_AniStart; // 0x308
	UWidgetAnimation* m_AniEnd; // 0x310
	UTextBlock* m_Txt_Notice; // 0x328
	UImage* m_Img_Frame; // 0x330
	UImage* m_Img_Symbol; // 0x338
	UEditableText* m_Edit_GuildName; // 0x340
	UScrollBox* m_Scr_SymbolList; // 0x348
	UScrollBox* m_Scr_FrameList; // 0x350
	TArray<UMM_GuildIconSlot*> m_arSymbolList; // 0x358
	TArray<UMM_GuildIconSlot*> m_arFrameList; // 0x368
	UMM_Common_Btn_Symbol* m_CB_SymbolList_Left; // 0x378
	UMM_Common_Btn_Symbol* m_CB_SymbolList_Right; // 0x380
	UMM_Common_Btn_Symbol* m_CB_FrameList_Left; // 0x388
	UMM_Common_Btn_Symbol* m_CB_FrameList_Right; // 0x390
	UMM_Common_Btn_Cost* m_CB_Create; // 0x398
};

struct UMM_BP_Attendance_Day_Slot {
	UPanelWidget* m_Panel_Today; // 0x2e0
	UPanelWidget* m_Panel_Oneday; // 0x2e8
	UMirTextBlock* m_Txt_Name; // 0x2f0
	UMM_Slot_Material* m_ItemSlot_2; // 0x2f8
	UMM_Slot_Material* m_ItemSlot_3; // 0x300
	UPanelWidget* m_Panel_Yellow; // 0x308
	UPanelWidget* m_Panel_Blue; // 0x310
	UMirImage* m_Img_Yellow; // 0x318
	UMirImage* m_Img_Blue; // 0x320
	UMM_Common_Btn* m_C_Btn_Main; // 0x328
};

struct UMM_Common_Btn_Base {
	ECommonBtnType m_eCommonBtnType; // 0x2e0
	float m_fLockTime; // 0x2e4
	bool m_bUseClickAnimation; // 0x2e8
	UMirWidgetData* m_WidgetData; // 0x2f0
	UWidgetAnimation* m_AniClick; // 0x2f8
	UMirImage* m_ImgBg; // 0x308
	UMirImage* m_ImgBgShadow; // 0x310
	UMirButton* m_BtnMain; // 0x318
	FScriptMulticastDelegate m_OnClickedEvent; // 0x330
};

struct UMM_Hud_PKPenalty {
	UPanelWidget* Panel_Effect; // 0x2f0
	UMirImage* Img_PenaltyIcon; // 0x2f8
	UMirButton* Btn_Penalty; // 0x300
	UMM_Popup_DeathPenalty* PopupDeathPenalty; // 0x308
};

struct UFindSessionsCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct APlayerCameraManager {
	APlayerController* PCOwner; // 0x218
	USceneComponent* TransformComponent; // 0x220
	float DefaultFOV; // 0x230
	float DefaultOrthoWidth; // 0x238
	float DefaultAspectRatio; // 0x240
	FCameraCacheEntry CameraCache; // 0x290
	FCameraCacheEntry LastFrameCameraCache; // 0x860
	FTViewTarget ViewTarget; // 0xe30
	FTViewTarget PendingViewTarget; // 0x1410
	FCameraCacheEntry CameraCachePrivate; // 0x1a10
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x1fe0
	TArray<UCameraModifier*> ModifierList; // 0x25b0
	TArray<UCameraModifier*> DefaultModifiers; // 0x25c0
	float FreeCamDistance; // 0x25d0
	FVector FreeCamOffset; // 0x25d4
	FVector ViewTargetOffset; // 0x25e0
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x2600
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x2610
	UCameraAnimInst* AnimInstPool[0x8]; // 0x2618
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2658
	TArray<UCameraAnimInst*> ActiveAnims; // 0x2678
	TArray<UCameraAnimInst*> FreeAnims; // 0x2688
	ACameraActor* AnimCameraActor; // 0x2698
	char bIsOrthographic : 1; // 0x26a0
	char bDefaultConstrainAspectRatio : 1; // 0x26a0
	char bClientSimulatingViewTarget : 1; // 0x26a0
	char bUseClientSideCameraUpdates : 1; // 0x26a0
	char bGameCameraCutThisFrame : 1; // 0x26a1
	float ViewPitchMin; // 0x26a4
	float ViewPitchMax; // 0x26a8
	float ViewYawMin; // 0x26ac
	float ViewYawMax; // 0x26b0
	float ViewRollMin; // 0x26b4
	float ViewRollMax; // 0x26b8
	float ServerUpdateCameraTimeout; // 0x26c0
};

struct UPatchTableData {
	TArray<FName> ExcludeFileNameList; // 0x30
	TArray<FName> PatchFolderList; // 0x40
};

struct UReturnResultsTerminal {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	char bReplicates : 1; // 0x84
	char bNetAddressable : 1; // 0x84
	char bAutoActivate : 1; // 0x85
	char bIsActive : 1; // 0x86
	char bEditableWhenInherited : 1; // 0x86
	char bCanEverAffectNavigation : 1; // 0x86
	char bIsEditorOnly : 1; // 0x86
	EComponentCreationMethod CreationMethod; // 0x88
	FScriptMulticastDelegate OnComponentActivated; // 0x89
	FScriptMulticastDelegate OnComponentDeactivated; // 0x8a
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct UBlueprintGeneratedClass {
	int32_t NumReplicatedProperties; // 0x210
	char bHasNativizedParent : 1; // 0x214
	char bHasCookedComponentInstancingData : 1; // 0x214
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x218
	TArray<UActorComponent*> ComponentTemplates; // 0x228
	TArray<UTimelineTemplate*> Timelines; // 0x238
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x248
	USimpleConstructionScript* SimpleConstructionScript; // 0x258
	UInheritableComponentHandler* InheritableComponentHandler; // 0x260
	UStructProperty* UberGraphFramePointerProperty; // 0x268
	UFunction* UberGraphFunction; // 0x270
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x278
};

struct UGameplayTask_WaitDelay {
	FScriptMulticastDelegate OnFinish; // 0x68
};

struct UMM_UserEvent_BenedictionSlot {
	UMirImage* m_Img_GradeBgEffect; // 0x3f8
	UMirImage* m_ImgDisabled; // 0x400
	UMirImage* m_ImgCurrSelected; // 0x408
	UMirImage* m_Img_Complete; // 0x410
	UEffectWidgetBase* m_Effect; // 0x418
};

struct USoundWaveProcedural {
	int32_t CompressionQuality; // 0x160
	int32_t StreamingPriority; // 0x164
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x168
	ESoundGroup SoundGroup; // 0x16a
	char bLooping : 1; // 0x16b
	char bStreaming : 1; // 0x16b
	char bSeekableStreaming : 1; // 0x16b
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x16c
	char bMature : 1; // 0x16d
	char bManualWordWrap : 1; // 0x16d
	char bSingleLine : 1; // 0x16d
	char bIsAmbisonics : 1; // 0x16d
	TArray<float> FrequenciesToAnalyze; // 0x170
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x180
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x190
	int32_t InitialChunkSize; // 0x1a0
	FString SpokenText; // 0x1e8
	float SubtitlePriority; // 0x1f8
	float Volume; // 0x1fc
	float Pitch; // 0x200
	int32_t NumChannels; // 0x204
	int32_t SampleRate; // 0x208
	TArray<FSubtitleCue> Subtitles; // 0x218
	UCurveTable* Curves; // 0x228
	UCurveTable* InternalCurves; // 0x230
};

struct UMM_HudTargetBuffInfo {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UNavigationQueryFilter {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UMM_Popup_GuestContinue {
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e0
	UMM_Common_Btn* m_Btn_LoadAccount; // 0x2e8
	UMirEditableText* m_Edit_Code; // 0x2f0
	UMirEditableText* m_Edit_Password; // 0x2f8
};

struct UMM_DailyWork_Progress {
	UMM_Slot_DailyWork_Reward* Slot_Plus_Reward01; // 0x2e0
	UMirTextBlock* Txt_PlusReward_2; // 0x2e8
	UMirImage* Img_Check_PlusReward_2; // 0x2f0
	UMM_Slot_DailyWork_Reward* Slot_Plus_Reward02; // 0x2f8
	UMirTextBlock* Txt_PlusReward_3; // 0x300
	UMirImage* Img_Check_PlusReward_3; // 0x308
	UMirRichTextBlock* RichTxt_Progress; // 0x310
	UMirProgressBar* Progress_DailyWork; // 0x318
	UMirTextBlock* Txt_Title; // 0x320
	UMM_Common_Btn* Btn_ReceiveAll; // 0x328
	int32_t STRING_DAILY_WORK_TITLE; // 0x330
	int32_t STRING_DAILY_WORK_PLUS_REWARD_2; // 0x334
	int32_t STRING_DAILY_WORK_PLUS_REWARD_3; // 0x338
	int32_t ALL_RECIEVE_BTN_EFECT_ID; // 0x33c
};

struct UMM_Hud_QuestMessage {
	UPanelWidget* m_Hor_NormalBg; // 0x318
	UPanelWidget* m_Hor_NormalLine; // 0x320
	UPanelWidget* m_Hor_RelationBg; // 0x328
	UPanelWidget* m_Hor_RelationLine; // 0x330
};

struct UMM_BattlePass_Menu_Btn {
	EBattlePassMenu MENU_BTN_TYPE; // 0x2f0
	int32_t STRING_ID_MENU_BTN; // 0x2f4
	UMirImage* m_Img_Selected; // 0x2f8
	UMirImage* m_Img_Locked; // 0x300
	UMirTextBlock* m_Txt_TabName; // 0x308
	UMirImage* m_Img_Indicator; // 0x310
	UMirButton* m_Btn_Main; // 0x318
};

struct UMM_Item_Make_Slot_Registered {
	UMirImage* m_Img_GradeBgEffect; // 0x3e8
	UMirTextBlock* m_TxtName; // 0x3f0
	UMirImage* m_ImgEquiped; // 0x3f8
	UMirTextBlock* m_TxtCount; // 0x400
	UMirImage* m_ImgTier; // 0x408
	UGridPanel* m_PanelName; // 0x410
	int32_t SLOT_EFFECT_INDEX; // 0x418
};

struct UMM_Popup_Auction_Count {
	UMM_Popup_Auction_ItemSlot* m_pItemSlot; // 0x2e0
	UMirTextBlock* m_pTxtTheme; // 0x2e8
	UMirRichTextBlock* m_pTxtSellCount; // 0x2f0
	UMirTextBlock* m_pTxtPrice; // 0x2f8
	UMirTextBlock* m_pTxtCommision; // 0x300
	UMirTextBlock* m_pTxtTotalPrice; // 0x308
	UMM_Common_Btn_Symbol* m_pBtnClose; // 0x310
	UMM_Common_Btn* m_pBtnOk; // 0x318
	UMM_Common_Btn* m_pBtnCancle; // 0x320
};

struct UMM_GuildShortCut {
	UMirButton* btn_close; // 0x2e0
	UMM_Common_Btn* btn_character_detail; // 0x2e8
	UMM_Common_Btn* btn_guild_grade; // 0x2f0
};

struct UMM_HudPetBuffIcon {
	UMirImage* m_Img_TierBg; // 0x2e8
	UMirImage* m_Img_PetIcon; // 0x2f0
	UMirTextBlock* m_Txt_BuffTime; // 0x2f8
	UMirButton* m_Btn_Main; // 0x300
};

struct UExporter {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int32_t PreferredFormatIndex; // 0x58
	int32_t TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
	UAssetExportTask* ExportTask; // 0x68
};

struct AMirLevelSequenceActor {
	ULevelSequencePlayer* m_pLevelSequencePlayer; // 0x238
	ALevelSequenceActor* m_pLevelSequenceActor; // 0x240
};

struct UMM_Occupation_Revival_Flag {
	FLinearColor neutralGaugeColor; // 0x2e0
	FLinearColor defenseGaugeColor; // 0x2f0
	FLinearColor offenseGaugeColor; // 0x300
	UCanvasPanel* rootPanel; // 0x310
	UCanvasPanel* guildMarkPanel; // 0x318
	UCanvasPanel* gaugePanel; // 0x320
	UCanvasPanel* lockTimePanel; // 0x328
	UTextBlock* revivalFlagName; // 0x330
	UTextBlock* ownerGuildName; // 0x338
	UImage* ownerGuildMark; // 0x340
	UImage* ownerGuildFrame; // 0x348
	UImage* dominanceGlow; // 0x350
	UImage* dominanceLine; // 0x358
	UImage* ownerGauge; // 0x360
	UImage* dominanceGauge; // 0x368
	UImage* lockTimeGauge; // 0x370
	UImage* gaugeHighlight_Home; // 0x378
	UImage* gaugeHighlight_Away; // 0x380
	UWidgetAnimation* animRotation_Home; // 0x388
	UWidgetAnimation* animRotation_Away; // 0x390
	UWidgetAnimation* animAwayIn; // 0x398
};

struct UMM_Popup_ClosedTraining_Collect {
	UMirTextBlock* m_Txt_Title; // 0x2e0
	UMirTextBlock* m_Txt_Desc; // 0x2e8
	UMirScrollBox* m_ScrollBox; // 0x2f0
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2f8
};

struct UMM_GuildWanted {
	UMirCanvasPanel* mPanelWanted; // 0x2f0
	UMirTextBlock* txt_count; // 0x2f8
	UMirButton* btn_search; // 0x300
	UMirScrollBox* sb_wanted; // 0x308
	UMM_Common_Board_Notice* bn_empty; // 0x310
	UMM_GuildDevLock* mPanelDevLock; // 0x318
};

struct UWidgetBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x300
	char bAllowTemplate : 1; // 0x308
	char bAllowDynamicCreation : 1; // 0x308
	char bValidTemplate : 1; // 0x308
	char bTemplateInitialized : 1; // 0x308
	char bCookedTemplate : 1; // 0x308
	char bClassRequiresNativeTick : 1; // 0x308
	TArray<FDelegateRuntimeBinding> Bindings; // 0x310
	TArray<UWidgetAnimation*> Animations; // 0x320
	TArray<FName> NamedSlots; // 0x330
	UUserWidget* TemplateAsset; // 0x340
	UUserWidget* Template; // 0x368
};

struct ASpectatorPawn {
	float BaseTurnRate; // 0x278
	float BaseLookUpRate; // 0x27c
	UPawnMovementComponent* MovementComponent; // 0x280
	USphereComponent* CollisionComponent; // 0x288
	UStaticMeshComponent* MeshComponent; // 0x290
	char bAddDefaultMovementBindings : 1; // 0x298
};

struct UMM_Dominion_Title_NormalList {
	UVerticalBox* m_pVertBox; // 0x2e0
	UMirTextBlock* m_pTxtTitle; // 0x2e8
};

struct ASpectatorBeaconClient {
	FString DestSessionId; // 0x2d8
	FSpectatorReservation PendingReservation; // 0x2e8
	ESpectatorClientRequestType RequestType; // 0x360
	bool bPendingReservationSent; // 0x361
	bool bCancelReservation; // 0x362
};

struct UMM_Slot_Material_CircleA {
	UMirTextBlock* m_Smelt; // 0x440
};

struct UMM_UIAction_Achievement {
	int32_t STRING_ERROR_ACHIEVEMNT_COMPLETE; // 0x154
	int32_t STRING_ERROR_EMPTY_RECEIVEALL; // 0x158
	int32_t STRING_ERROR_NOTENOUGH_INVENTORY; // 0x15c
	int32_t STRING_ERROR_ACHIEVEMENT_END; // 0x160
	int32_t STRING_ERROR_ACHIEVEMENT_MAX_MONEY; // 0x164
	bool m_IsLevelUp; // 0x16c
	int32_t m_PrevLevel; // 0x170
	bool m_IsNotRecieve; // 0x174
	int32_t STRING_ERROR_MAX_VALUE_GOLD_COIN; // 0x17c
	int32_t STRING_ERROR_MAX_VALUE_SILVER_COIN; // 0x180
	int32_t STRING_ERROR_MAX_VALUE_COIN; // 0x184
	int32_t STRING_ERROR_MAX_VALUE_SAPPHIRE; // 0x188
	int32_t STRING_ERROR_MAX_VALUE_ENERGY_POINT; // 0x18c
	int32_t STRING_ERROR_MAX_VALUE_BLACK_IRON; // 0x190
	int32_t STRING_ERROR_MAX_VALUE_COMBAT_JADE; // 0x194
	int32_t STRING_ERROR_MAX_VALUE_PVP_SCORE; // 0x198
	int32_t STRING_ERROR_MAX_VALUE_GUILD_COIN; // 0x19c
	int32_t STRING_ERROR_MAX_VALUE_FRIENDSHIP_SCORE; // 0x1a0
};

struct UComboButtonWidgetStyle {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UChaosDebugDrawComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	char bReplicates : 1; // 0x84
	char bNetAddressable : 1; // 0x84
	char bAutoActivate : 1; // 0x85
	char bIsActive : 1; // 0x86
	char bEditableWhenInherited : 1; // 0x86
	char bCanEverAffectNavigation : 1; // 0x86
	char bIsEditorOnly : 1; // 0x86
	EComponentCreationMethod CreationMethod; // 0x88
	FScriptMulticastDelegate OnComponentActivated; // 0x89
	FScriptMulticastDelegate OnComponentDeactivated; // 0x8a
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct UAnimationSharingManager {
	TArray<USkeleton*> Skeletons; // 0x28
	TArray<UAnimSharingInstance*> PerSkeletonData; // 0x38
};

struct UMM_B_NPCMenu {
	UMM_Common_Btn_Symbol* m_Btn_Menu1; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Menu2; // 0x2e8
	UMM_Common_Btn_Symbol* m_Btn_Menu3; // 0x2f0
	UMM_Common_Btn_Symbol* m_Btn_Menu4; // 0x2f8
	TArray<UMM_Common_Btn_Symbol*> BtnMenuArray; // 0x300
	UTextBlock* m_Txt_Menu1; // 0x310
	UTextBlock* m_Txt_Menu2; // 0x318
	UTextBlock* m_Txt_Menu3; // 0x320
	UTextBlock* m_Txt_Menu4; // 0x328
	TArray<UTextBlock*> TxtMenuArray; // 0x330
	UPanelWidget* m_Grd_Menu1; // 0x340
	UPanelWidget* m_Grd_Menu2; // 0x348
	UPanelWidget* m_Grd_Menu3; // 0x350
	UPanelWidget* m_Grd_Menu4; // 0x358
	TArray<UPanelWidget*> GridMenuArray; // 0x360
	UMM_Common_Btn_Symbol* m_Btn_MenuRelation; // 0x380
	UTextBlock* m_Txt_MenuRelation; // 0x388
	UPanelWidget* m_Grd_MenuRelation; // 0x390
};

struct UGeometryCollectionComponent {
	AChaosSolverActor* ChaosSolverActor; // 0x448
	UGeometryCollection* RestCollection; // 0x530
	TArray<AFieldSystemActor*> InitializationFields; // 0x538
	bool Simulating; // 0x548
	EObjectStateTypeEnum ObjectType; // 0x550
	bool EnableClustering; // 0x551
	int32_t ClusterGroupIndex; // 0x554
	int32_t MaxClusterLevel; // 0x558
	TArray<float> DamageThreshold; // 0x560
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x570
	int32_t CollisionGroup; // 0x574
	float CollisionSampleFraction; // 0x578
	UChaosPhysicalMaterial* PhysicalMaterial; // 0x580
	EInitialVelocityTypeEnum InitialVelocityType; // 0x588
	FVector InitialLinearVelocity; // 0x58c
	FVector InitialAngularVelocity; // 0x598
	FGeomComponentCacheParameters CacheParameters; // 0x5a8
	FScriptMulticastDelegate NotifyGeometryCollectionPhysicsStateChange; // 0x5f8
	FScriptMulticastDelegate NotifyGeometryCollectionPhysicsLoadingStateChange; // 0x608
	FScriptMulticastDelegate OnChaosBreakEvent; // 0x630
	float DesiredCacheTime; // 0x640
	bool CachePlayback; // 0x644
	FScriptMulticastDelegate OnChaosPhysicsCollision; // 0x648
	bool bNotifyBreaks; // 0x658
	bool bNotifyCollisions; // 0x659
	UBodySetup* DummyBodySetup; // 0x808
};

struct APaperGroupedSpriteActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x218
};

struct AController {
	APlayerState* PlayerState; // 0x220
	FScriptMulticastDelegate OnInstigatedAnyDamage; // 0x230
	FName StateName; // 0x240
	APawn* Pawn; // 0x248
	ACharacter* Character; // 0x258
	USceneComponent* TransformComponent; // 0x260
	FRotator ControlRotation; // 0x280
	char bAttachToPawn : 1; // 0x28c
};

struct ARectLight {
	URectLightComponent* RectLightComponent; // 0x228
};

struct UMM_Dominion_Base_StrongPoint {
	UMM_GuildIcon* m_pGuildIcon; // 0x308
	UMirTextBlock* m_pTxtGuildName; // 0x310
	UMirTextBlock* m_pTxtGuildMaster; // 0x318
	UMM_Common_Btn_Symbol* m_pBtnGuildInfo; // 0x320
	UMirTextBlock* m_pTxtGuildEmpty; // 0x328
	UWidgetSwitcher* m_pSwitcherGuild; // 0x330
	UMirTextBlock* m_pTxtOccupationDur; // 0x338
	UMirTextBlock* m_pTxtOccupationState; // 0x340
	UMirTextBlock* m_pTxtBlackIronValue; // 0x348
	UMirTextBlock* m_pTxtStorageBlackIronValue; // 0x350
	UMirTextBlock* m_pTxtSellBlackIronValue; // 0x358
	UMM_Common_Btn* m_pBtnBlackIronStorage; // 0x360
	UMirImage* img_black_iron_indicator; // 0x368
	UMirButton* m_pBtnInfoBlackIron; // 0x370
	UMirButton* m_pBtnInfoBlackIronStorage; // 0x378
	UMirButton* m_pBtnInfoBlackIronSell; // 0x380
	UMM_Common_Board_Notice* m_pEmptyCommonBoard; // 0x388
	UMM_Common_Btn_Translation* m_pBtnTranslation_Notice; // 0x390
	UMM_Common_Btn* m_pBtn_Send_Notice; // 0x398
	UMirScrollBox* m_pScr_Edit_Notice; // 0x3a0
	UMirMultiLineEditableText* m_pEdit_Notice; // 0x3a8
	UMirScrollBox* m_pScr_Txt_Notice; // 0x3b0
	UMirTextBlock* m_pTxt_Notice; // 0x3b8
};

struct AMode_Unified_C {
	USceneComponent* DefaultSceneRoot; // 0x4a0
	UMediaPlayer* LogoMedia; // 0x4a8
};

struct UMM_UIShopGoodsBigSlot {
	UMirCanvasPanel* m_Panel_GoodsInfo; // 0x440
	UMirScrollBox* m_ScrollBox_DetailSlot; // 0x448
	UMirCanvasPanel* m_Panel_OnlyDesc; // 0x450
	UMirRichTextBlock* m_RTxt_OnlyDesc; // 0x458
	UScaleBox* m_ScaleBox_Period; // 0x460
	UMirTextBlock* m_Txt_PeriodDesc; // 0x468
	UMirImage* m_Img_PeriodIndicator; // 0x470
};

struct UTimeSynchronizableMediaSource {
	bool bUseTimeSynchronization; // 0x88
	int32_t FrameDelay; // 0x8c
	double TimeDelay; // 0x90
};

struct UBTTask_FinishWithResult {
	EBTNodeResult Result; // 0x70
};

struct UMM_Popup_GuildDevShortCut {
	UPanelWidget* mGridShortCut; // 0x2e8
	UMirTextBlock* mTxtShortCutName; // 0x2f0
	UMirTextBlock* mTxtShortCutDesc; // 0x2f8
	UMirImage* mImgIcon; // 0x300
	UMM_Common_Btn* mBtnShortCut; // 0x308
	UMM_Common_Btn_Symbol* mBtnClose; // 0x310
};

struct UMovieSceneColorSection {
	FMovieSceneFloatChannel RedCurve; // 0xe0
	FMovieSceneFloatChannel GreenCurve; // 0x180
	FMovieSceneFloatChannel BlueCurve; // 0x220
	FMovieSceneFloatChannel AlphaCurve; // 0x2c0
};

struct UMM_ServerSlot_Global {
	FLinearColor SlotBG_CurRegion; // 0x2e0
	FLinearColor SlotBG_OtherRegion; // 0x2f0
	UMirImage* m_Img_Bg; // 0x318
	UMirImage* m_Img_Selected; // 0x320
	UPanelWidget* m_Can_Recommend; // 0x328
	UMirImage* m_Img_New; // 0x330
	UMirTextBlock* m_Txt_ServerName; // 0x338
	UMirTextBlock* m_Txt_Peace; // 0x340
	UMirImage* m_Img_ServerCongestionInfo; // 0x348
	UMirTextBlock* m_Txt_ServerNotice; // 0x350
	UPanelWidget* m_Hrz_CharCount; // 0x358
	UMirTextBlock* m_Txt_CharCount; // 0x360
	UMirButton* m_Btn_Main; // 0x368
};

struct UVectorFieldStatic {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
	TArray<FVector4> CPUData; // 0xf0
};

struct UMM_Slot_Costume_Palette {
	int32_t Palette_RowID_CH1; // 0x300
	int32_t Palette_RowID_CH2; // 0x304
	int32_t Palette_CostumeID; // 0x308
	float Palette_Density_CH1; // 0x30c
	float Palette_Density_CH2; // 0x310
	int32_t Palette_Color_CH1; // 0x314
	int32_t Palette_Color_CH2; // 0x318
	int32_t Palette_DyeingType; // 0x31c
	UMirImage* Img_Color_1; // 0x320
	UMirImage* Img_Color_2; // 0x328
	UMirImage* Img_Checked; // 0x330
	UMirImage* img_selected; // 0x338
	UMirButton* m_BtnMain; // 0x340
};

struct UCurveLinearColorAtlas {
	uint32_t TextureSize; // 0x100
	TArray<UCurveLinearColor*> GradientCurves; // 0x108
};

struct UMM_Popup_Xdraco_Sealing {
	int32_t STRING_SEAL_TITLE; // 0x2e0
	int32_t STRING_UNSEAL_TITLE; // 0x2e4
	int32_t STRING_SEAL_DESC; // 0x2e8
	int32_t STRING_SEAL_DELAY_DESC; // 0x2ec
	int32_t STRING_UNSEAL_DESC; // 0x2f0
	UMirTextBlock* m_Txt_Title; // 0x2f8
	UMirTextBlock* m_Txt_ItemName; // 0x300
	UMM_Slot_Material* m_Slot_Item; // 0x308
	UMirRichTextBlock* m_Rtxt_Desc; // 0x310
	UMM_Common_Btn_Symbol* m_C_Btn_Close; // 0x318
	UMM_Common_Btn* m_C_Btn_Cancel; // 0x320
	UMM_Common_Btn* m_C_Btn_UnSeal; // 0x328
	UMM_Common_Btn_Cost* m_C_Btn_Seal; // 0x330
};

struct UMM_Common_CombatPoint {
	UMirImage* Img_Icon; // 0x2f8
	UMirTextBlock* Txt_Value; // 0x300
	UMirButton* Btn_Main; // 0x308
	int32_t CombatValue; // 0x310
};

struct USlateBrushAsset {
	FSlateBrush Brush; // 0x28
};

struct UMM_CharacterSelect_Slot {
	UPanelWidget* Panel_SelectBG; // 0x2e0
	UMirImage* Img_ClassSymbol; // 0x2e8
	UMirTextBlock* Txt_CharacterLevel; // 0x2f0
	UMirTextBlock* Txt_CharacterName; // 0x2f8
	UMirTextBlock* Txt_DeleteTime; // 0x300
	UMirButton* Btn_SelectSlot; // 0x308
	UPanelWidget* Panel_Info; // 0x310
	UPanelWidget* Panel_Lock; // 0x318
	UPanelWidget* Panel_Empty; // 0x320
	UPanelWidget* Panel_Delete; // 0x328
	UOverlay* m_Overlay_NFT; // 0x330
	uint64_t m_CharacterUID; // 0x338
	uint32_t m_SlotIndex; // 0x340
	int32_t STRING_TIME_DAYS; // 0x344
	int32_t STRING_TIME_HOURS; // 0x348
	int32_t STRING_TIME_MINUTES; // 0x34c
	UPanelWidget* Panel_ServerChange; // 0x360
};

struct UMaterialFunction {
	FString Description; // 0x40
	TArray<UMaterialExpression*> FunctionExpressions; // 0x50
	char bExposeToLibrary : 1; // 0x60
	char bPrefixParameterNames : 1; // 0x60
	char bReentrantFlag : 1; // 0x60
};

struct UMM_Secret_Popup {
	int32_t PartyMatchingStrID; // 0x2f0
	int32_t EnterStrID; // 0x2f4
	int32_t MoveStrID; // 0x2f8
	UMM_Common_Btn_Symbol* btn_close; // 0x300
	UMirTextBlock* Txt_Title; // 0x308
	UMirTextBlock* Txt_Explanation; // 0x310
	UMirTextBlock* Txt_FixedNowBP; // 0x318
	UMirTextBlock* Txt_NowBPNum; // 0x320
	UMirTextBlock* Txt_FixedRecommendBP; // 0x328
	UMirTextBlock* Txt_RecommendBPNum; // 0x330
	UMirTextBlock* Txt_Stage; // 0x338
	UMirTextBlock* Txt_DifficultyNum; // 0x340
	UMM_Common_Btn_Symbol* Btn_LvDown; // 0x348
	UMM_Common_Btn_Symbol* Btn_LvUp; // 0x350
	UMirImage* Img_SelectDungeon; // 0x358
	UMirImage* Img_Disabled; // 0x360
	UMM_Slot_Material* Img_NeedCost; // 0x368
	UMirTextBlock* Txt_NeedCostTitle; // 0x370
	UMirTextBlock* Txt_NeedCost; // 0x378
	UMM_Slot_Material* Img_NeedItem; // 0x380
	UMirTextBlock* Txt_NeedItemTitle; // 0x388
	UMirTextBlock* Txt_NeedItem; // 0x390
	UMirTextBlock* Txt_FixedHaveTicket; // 0x398
	UMirTextBlock* txtFixedDisabled; // 0x3a0
	UPanelWidget* Pan_RewardList; // 0x3a8
	TArray<UMM_Slot_Material*> slot_reward; // 0x3b0
	UMM_Common_Btn* Btn_PartyMatching; // 0x3c0
	UMM_Common_Btn* Btn_DungeonEnter; // 0x3c8
	UMM_DungeonQuestSlotWidget* wgtNeedQuest; // 0x3d0
	UButton* Btn_Disable; // 0x3d8
};

struct AMM_GameStateBase {
	AGameModeBase* GameModeClass; // 0x218
	AGameModeBase* AuthorityGameMode; // 0x220
	ASpectatorPawn* SpectatorClass; // 0x228
	TArray<APlayerState*> PlayerArray; // 0x230
	bool bReplicatedHasBegunPlay; // 0x240
	float ReplicatedWorldTimeSeconds; // 0x244
	float ServerWorldTimeSecondsDelta; // 0x248
	float ServerWorldTimeSecondsUpdateFrequency; // 0x24c
};

struct UARCandidateImage {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderFloatValue GridSize; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb0
	UEnvQueryContext* GenerateAround; // 0xe0
};

struct ULeaderboardFlushCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UMM_CostumeAbility_Select {
	UMirTextBlock* Txt_Title; // 0x2f0
	TArray<UMM_PopUp_ItemInfo_Ability*> arrSelect_Ability; // 0x2f8
};

struct UMaterialExpressionConstantBiasScale {
	FExpressionInput Input; // 0x40
	float Bias; // 0x54
	float Scale; // 0x58
};

struct UMM_HudLeftTabMenuSlot {
	int32_t SymbolIconID; // 0x2e0
	int32_t SymbolGuildIconID; // 0x2e4
	ELeftTabMenuSlotType eMenuSlotType; // 0x2e8
	int32_t m_iEffectID_Touched; // 0x2ec
	UImage* m_pImgSelected; // 0x2f0
	UButton* m_pBtnTab; // 0x2f8
	UMirImage* m_Img_IcnMake; // 0x300
	UPanelWidget* m_pGridEffect; // 0x308
	UMirImage* m_Img_Symbol_Select; // 0x310
	UPanelWidget* m_Grid_Indicator; // 0x318
	UImage* m_Img_Indicator; // 0x320
	UMirTextBlock* m_Txt_Indicator; // 0x328
	UMirTextBlock* m_Txt_PartyMemberCount; // 0x330
	UEffectWidgetBase* m_Effect_FullParty; // 0x338
};

struct UMM_FindCharSlot_Global {
	UMirTextBlock* m_Txt_ServerName; // 0x2f8
	UMirTextBlock* m_Txt_CharLevel; // 0x300
	UMirImage* m_Img_CharClass; // 0x308
	UMirTextBlock* m_Txt_CharName; // 0x310
	UMirTextBlock* m_Txt_LastLogin; // 0x318
	UMM_Common_Btn* m_CB_ServerSelect; // 0x320
};

struct UMM_SynthesisResult_Slot {
	UMM_Slot_Inventory* m_pSlotItem; // 0x2f0
	UMirTextBlock* m_pTxtItemName; // 0x2f8
	UMirTextBlock* m_Txt_Seal; // 0x300
	UMirCanvasPanel* m_pCanvasItemName; // 0x308
	UMirImage* m_Img_Gold_Card_Squre_Fx; // 0x310
	UWidgetAnimation* m_pCardOpenAni; // 0x318
	UWidgetAnimation* m_pCardOpenGreatSuccessAni; // 0x320
	UWidgetAnimation* m_pHeroCardOpenAni; // 0x328
	UWidgetAnimation* m_pHeroCardOpenGreatSuccessAni; // 0x330
	UWidgetAnimation* m_pLegendCardOpenAni; // 0x338
	UWidgetAnimation* m_pLegendCardOpenGreatSuccessAni; // 0x340
	UWidgetAnimation* m_pSlotStartAni; // 0x348
	UWidgetAnimation* m_pBounceAni; // 0x350
	UWidgetAnimation* m_pCardTurnOpen; // 0x358
	UWidgetAnimation* m_pCenserBounceAni; // 0x360
	UMirImage* m_pSuccessBounceImage; // 0x368
	UWidgetAnimation* m_pGreatSuccessAni; // 0x370
	UGridPanel* m_Grid_Card_Turn_Effect; // 0x378
	UEffectWidgetBase* m_WE_Unsealing_Complete02; // 0x380
	UMirButton* m_pBtnClick; // 0x388
	UMirCanvasPanel* m_pPanelCover; // 0x390
	UMirImage* m_Img_Cover; // 0x398
	UScaleBox* m_pScaleSeal; // 0x3a0
	UGridPanel* m_Effect_Panel; // 0x3a8
	UEffectWidgetBase* m_Effect_Widget; // 0x3b0
	UWidgetAnimation* m_pGreatHeroOpenAni; // 0x3b8
	UWidgetAnimation* m_pHeroAppearAni; // 0x3c0
};

struct UPhysicsConstraintComponent {
	AActor* ConstraintActor1; // 0x220
	FConstrainComponentPropName ComponentName1; // 0x228
	AActor* ConstraintActor2; // 0x230
	FConstrainComponentPropName ComponentName2; // 0x238
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x250
	FScriptMulticastDelegate OnConstraintBroken; // 0x258
	FConstraintInstance ConstraintInstance; // 0x268
};

struct UMM_Customizing_Component {
	UPanelWidget* m_ComponentPanel; // 0x2e0
	UCanvasPanel* m_ComponentCanvasPanel; // 0x2e8
	TArray<UPanelWidget*> m_ComponentList; // 0x2f0
	UMirScrollBox* m_ScrollBox; // 0x300
};

struct UMM_Xdraco_SealingInventory {
	int32_t MAX_SLOT; // 0x2f0
	int32_t MAX_LINE_SLOT; // 0x2f4
	UMirWrapScrollBox* m_pScrollBox; // 0x2f8
	TArray<UMM_ItemSealing_Slot*> InvenSlotList; // 0x300
	int32_t m_MaxSlotCount; // 0x310
	int32_t m_CurrentSlotCount; // 0x314
};

struct UInterpTrackColorScale {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UFloatTextWidget {
	FVector2D WidgetSIze; // 0x870
	float OverlapRandomOffsetMin; // 0x878
	float OverlapRandomOffsetMax; // 0x87c
	FSlateBrush Number_1; // 0x880
	FSlateBrush Number_2; // 0x908
	FSlateBrush Number_3; // 0x990
	FSlateBrush Number_4; // 0xa18
	FSlateBrush Number_5; // 0xaa0
	FSlateBrush Number_6; // 0xb28
	FSlateBrush Number_7; // 0xbb0
	FSlateBrush Number_8; // 0xc38
	FSlateBrush Number_9; // 0xcc0
	FSlateBrush Number_10; // 0xd48
	FSlateBrush ImageFont_Critical; // 0xdd0
	int32_t IconID_Critical; // 0xe58
	FSlateBrush ImageFont_Unbeatable; // 0xe60
	int32_t IconID_Unbeatable; // 0xee8
	FSlateBrush ImageFont_ImmuneDamage; // 0xef0
	int32_t IconID_ImmuneDamage; // 0xf78
	FSlateBrush ImageFont_Immortal; // 0xf80
	int32_t IconID_Immortal; // 0x1008
	FSlateBrush ImageFont_Dodge; // 0x1010
	int32_t IconID_Dodge; // 0x1098
	FSlateBrush ImageFont_Miss; // 0x10a0
	int32_t IconID_Miss; // 0x1128
	FSlateBrush ImageFont_Defense; // 0x1130
	int32_t IconID_Defense; // 0x11b8
	FSlateBrush ImageFont_Shield; // 0x11c0
	int32_t IconID_Shield; // 0x1248
	FSlateBrush ImageFont_Absorb; // 0x1250
	int32_t IconID_Absorb; // 0x12d8
	FSlateBrush ImageFont_ProtectPVP; // 0x12e0
	int32_t IconID_ProtectPVP; // 0x1368
	FSlateBrush ImageFont_Spirit; // 0x1370
	int32_t IconID_Spirit; // 0x13f8
	FSlateBrush ImageFont_SiegeGuard; // 0x1400
	int32_t IconID_SiegeGuard; // 0x1488
	FVector2D Offset_My_Damage; // 0x148c
	FVector2D Offset_My_Unbeatable; // 0x1494
	FVector2D Offset_My_ImmuneDamage; // 0x149c
	FVector2D Offset_My_Immortal; // 0x14a4
	FVector2D Offset_My_Dodge; // 0x14ac
	FVector2D Offset_My_Shield; // 0x14b4
	FVector2D Offset_My_Absorb; // 0x14bc
	FVector2D Offset_My_Gain; // 0x14c4
	FVector2D Offset_My_GainHP; // 0x14cc
	FVector2D Offset_My_GainMP; // 0x14d4
	FVector2D Offset_My_GainSP; // 0x14dc
	FVector2D Offset_My_Lost; // 0x14e4
	FVector2D Offset_My_LostMP; // 0x14ec
	FVector2D Offset_My_LostSP; // 0x14f4
	FVector2D Offset_My_ProtectPVP; // 0x14fc
	FVector2D Offset_My_SiegeGuard; // 0x1504
	FVector2D Offset_Other_Damage; // 0x150c
	FVector2D Offset_Other_Unbeatable; // 0x1514
	FVector2D Offset_Other_ImmuneDamage; // 0x151c
	FVector2D Offset_Other_Immortal; // 0x1524
	FVector2D Offset_Other_Dodge; // 0x152c
	FVector2D Offset_Other_Shield; // 0x1534
	FVector2D Offset_Other_Absorb; // 0x153c
	FVector2D Offset_Other_Gain; // 0x1544
	FVector2D Offset_Other_GainHP; // 0x154c
	FVector2D Offset_Other_GainMP; // 0x1554
	FVector2D Offset_Other_GainSP; // 0x155c
	FVector2D Offset_Other_Lost; // 0x1564
	FVector2D Offset_Other_LostMP; // 0x156c
	FVector2D Offset_Other_LostSP; // 0x1574
	FVector2D Offset_Other_ProtectPVP; // 0x157c
	FVector2D Offset_Other_SiegeGuard; // 0x1584
	FVector2D Offset_LinkAttack; // 0x158c
	FSlateBrush PlusMinus_Plus; // 0x1598
	FSlateBrush PlusMinus_Minus; // 0x1620
	UWidgetAnimation* WidgetAnim_My_Damage; // 0x16a8
	UWidgetAnimation* WidgetAnim_My_Smite; // 0x16b0
	UWidgetAnimation* WidgetAnim_My_Critical; // 0x16b8
	UWidgetAnimation* WidgetAnim_My_TextFont; // 0x16c0
	UWidgetAnimation* WidgetAnim_My_Gain; // 0x16c8
	UWidgetAnimation* WidgetAnim_My_Lost; // 0x16d0
	UWidgetAnimation* WidgetAnim_Other_Damage; // 0x16d8
	UWidgetAnimation* WidgetAnim_Other_Smite; // 0x16e0
	UWidgetAnimation* WidgetAnim_Other_Critical; // 0x16e8
	UWidgetAnimation* WidgetAnim_Other_TextFont; // 0x16f0
	UWidgetAnimation* WidgetAnim_Other_Gain; // 0x16f8
	UWidgetAnimation* WidgetAnim_Other_Lost; // 0x1700
	UImage* m_pImg_100001; // 0x1708
	UImage* m_pImg_10001; // 0x1710
	UImage* m_pImg_1001; // 0x1718
	UImage* m_pImg_101; // 0x1720
	UImage* m_pImg_11; // 0x1728
	UImage* m_pImg_2; // 0x1730
	UImage* m_pImg_Txt; // 0x1738
	UImage* m_pImg_PlusMinus; // 0x1740
	UImage* m_pImg_Blood; // 0x1748
	UGridPanel* BaseGridPanel; // 0x1750
};

struct AEmitter {
	UParticleSystemComponent* ParticleSystemComponent; // 0x218
	char bDestroyOnSystemFinish : 1; // 0x220
	char bPostUpdateTickGroup : 1; // 0x220
	char bCurrentlyActive : 1; // 0x220
	FScriptMulticastDelegate OnParticleSpawn; // 0x228
	FScriptMulticastDelegate OnParticleBurst; // 0x238
	FScriptMulticastDelegate OnParticleDeath; // 0x248
	FScriptMulticastDelegate OnParticleCollide; // 0x258
};

struct AMM_CharacterCustomizingActor {
	UPoseableMeshComponent* m_pFaceControlMesh; // 0x228
	UMaterialInstanceDynamic* m_pFaceAreaMarkMID; // 0x230
	USkeletalMeshComponent* m_pMainFaceMesh; // 0x2f8
	UPoseableMeshComponent* m_pCopyFaceMesh; // 0x300
	UMM_CharacterPartsComponent* m_pPartsComponent; // 0x318
	TMap<int32_t, USkeletalMeshComponent*> m_mapCustomizingMeshParts; // 0x320
	UPoseableMeshComponent* m_pPoseableFaceMesh; // 0x370
	TMap<int32_t, FCharacterPartsMID> m_mapCharacterMID; // 0x378
};

struct ATriggerSphere {
	UShapeComponent* CollisionComponent; // 0x218
};

struct UMM_CostumeAbility_Info {
	UMirImage* Img_Icon; // 0x2e0
	UMirTextBlock* Txt_Type; // 0x2e8
	UMirTextBlock* Txt_Value; // 0x2f0
};

struct UMM_PetGradeUp_InfoSlot {
	UMirTextBlock* m_Txt_Level; // 0x2e0
	UMirTextBlock* m_Txt_EquipSlotCount; // 0x2e8
	UMM_PetAbilitySlot* m_arSkillSlot[0x4]; // 0x2f0
};

struct UAsyncActionLoadPrimaryAssetClassList {
	FScriptMulticastDelegate Completed; // 0x78
};

struct UCreateSessionCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UOnlineSessionClient {
	bool bIsFromInvite; // 0x188
	bool bHandlingDisconnect; // 0x189
};

struct AMM_PhotoModeCharacter {
	TArray<int32_t> m_MeshIDArray; // 0x238
	FString m_AnimPath; // 0x248
	UPhotoModeData* m_pPhotoModeData; // 0x258
	USpringArmComponent* m_pSprintArm; // 0x260
	UCameraComponent* m_pCamera; // 0x268
	USkeletalMeshComponent* m_pMesh; // 0x270
	UMM_CharacterPartsComponent* m_pPartsComponent; // 0x278
	bool m_bMyCharacterHide; // 0x280
	UMM_PhotoModeAnimInstance* m_pPhotoModeAnimInstance; // 0x2b0
	UMM_PhotoModeWidget* m_pPhotoModeWidget; // 0x2b8
};

struct USourceEffectPannerPreset {
	FSourceEffectPannerSettings Settings; // 0x70
};

struct UEditableText {
	FText Text; // 0x108
	DelegateProperty TextDelegate; // 0x120
	FText HintText; // 0x130
	DelegateProperty HintTextDelegate; // 0x148
	FEditableTextStyle WidgetStyle; // 0x158
	USlateWidgetStyleAsset* Style; // 0x370
	USlateBrushAsset* BackgroundImageSelected; // 0x378
	USlateBrushAsset* BackgroundImageComposing; // 0x380
	USlateBrushAsset* CaretImage; // 0x388
	FSlateFontInfo Font; // 0x390
	FSlateColor ColorAndOpacity; // 0x3e0
	bool IsReadOnly; // 0x408
	bool IsPassword; // 0x409
	float MinimumDesiredWidth; // 0x40c
	bool IsCaretMovedWhenGainFocus; // 0x410
	bool SelectAllTextWhenFocused; // 0x411
	bool RevertTextOnEscape; // 0x412
	bool ClearKeyboardFocusOnCommit; // 0x413
	bool SelectAllTextOnCommit; // 0x414
	bool AllowContextMenu; // 0x415
	EVirtualKeyboardType KeyboardType; // 0x416
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x417
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x418
	ETextJustify Justification; // 0x419
	FShapedTextOptions ShapedTextOptions; // 0x41a
	FScriptMulticastDelegate OnTextChanged; // 0x420
	FScriptMulticastDelegate OnTextCommitted; // 0x430
};

struct UMovieSceneColorTrack {
	bool bIsSlateColor; // 0x88
};

struct UNoiseField {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct UMM_Mystical_ItemInfo_Ability {
	UMirImage* m_AbilityIcon; // 0x2e0
	UTextBlock* m_AbilityName; // 0x2e8
	UMirTextBlock* m_AbilityValue; // 0x2f0
	UMirTextBlock* m_AbilityValueDefault; // 0x2f8
	UMirTextBlock* m_AbilityAddValue; // 0x300
	UTextBlock* m_Txt1; // 0x308
	UTextBlock* m_Txt2; // 0x310
	int32_t m_WidgetIndex; // 0x318
	UMirImage* Img_Arrow; // 0x320
	UMirTextBlock* Txt_Point; // 0x328
	UProgressBar* m_PolishProgressBar; // 0x330
	UTextBlock* m_PolishStatValue; // 0x338
	UMirImage* m_Img_Grade; // 0x340
	UTextBlock* m_Txt_OptionValue; // 0x348
	UTextBlock* m_Txt_OptionMin; // 0x350
	UTextBlock* m_Txt_OptionMax; // 0x358
	UTextBlock* m_Txt11; // 0x360
	UTextBlock* m_Txt12; // 0x368
	UTextBlock* m_Txt13; // 0x370
	UMirImage* m_Img_Ability; // 0x378
	UTextBlock* m_Txt_Title_SetItem; // 0x380
	UTextBlock* m_Txt_Desc_SetItem; // 0x388
	UTextBlock* m_Txt_Value_SetItem; // 0x390
	UMirTextBlock* Txt_Value_Durability; // 0x398
	UMirTextBlock* Txt_Value_Penalty; // 0x3a0
	UMirImage* Img_Arrow_Penalty; // 0x3a8
	UMirTextBlock* Txt_Point_Penalty; // 0x3b0
	UHorizontalBox* m_Panel_2; // 0x3b8
	UPanelWidget* m_Panel_3; // 0x3c0
	UPanelWidget* m_Panel_4; // 0x3c8
	UPanelWidget* m_Panel_5; // 0x3d0
	UPanelWidget* m_Panel_6; // 0x3d8
	int32_t RESOURCE_ICONID_LOCK; // 0x3e0
};

struct AMirSplineActor {
	USplineComponent* SplineComponent; // 0x218
};

struct UFirebaseFacebookCredential {
	FScriptMulticastDelegate OnComplete; // 0x30
};

struct UMM_Hud_Chat_EmptyGuild {
	UMM_Common_Btn* Btn_JoinGuild; // 0x2e0
};

struct USoundCue {
	char bPrimeOnLoad : 1; // 0x160
	USoundNode* FirstNode; // 0x168
	float VolumeMultiplier; // 0x170
	float PitchMultiplier; // 0x174
	FSoundAttenuationSettings AttenuationOverrides; // 0x178
	float SubtitlePriority; // 0x468
	char bOverrideAttenuation : 1; // 0x470
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x470
	char bHasPlayWhenSilent : 1; // 0x470
};

struct UListViewBase {
	FScrollBarStyle WidgetBarStyle; // 0x108
	ESlateVisibility ScrollBarVisibility; // 0x5d8
	FVector2D ScrollbarThickness; // 0x5dc
	FMargin ScrollbarPadding; // 0x5e4
	bool AlwaysShowScrollbar; // 0x5f4
	bool AlwaysShowScrollbarTrack; // 0x5f5
	UUserWidget* EntryWidgetClass; // 0x5f8
	float WheelScrollMultiplier; // 0x600
	bool bEnableScrollAnimation; // 0x604
	bool bEnableFixedLineOffset; // 0x605
	float FixedLineScrollOffset; // 0x608
	FScriptMulticastDelegate BP_OnEntryGenerated; // 0x610
	FScriptMulticastDelegate BP_OnEntryReleased; // 0x620
	FUserWidgetPool EntryWidgetPool; // 0x630
};

struct UAnimNotify_PlayMontageNotify {
	FName NotifyName; // 0x38
};

struct UPrimitiveComponent {
	float MinDrawDistance; // 0x228
	float LDMaxDrawDistance; // 0x22c
	float CachedMaxDrawDistance; // 0x230
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x234
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x235
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x236
	ELightmapType LightmapType; // 0x237
	char bUseMaxLODAsImposter : 1; // 0x238
	float CachedBoundsSphereDiameter; // 0x23c
	char bBatchImpostersAsInstances : 1; // 0x240
	char bNeverDistanceCull : 1; // 0x240
	char bAlwaysCreatePhysicsState : 1; // 0x240
	char bGenerateOverlapEvents : 1; // 0x240
	char bMultiBodyOverlap : 1; // 0x241
	char bTraceComplexOnMove : 1; // 0x241
	char bReturnMaterialOnMove : 1; // 0x241
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x241
	char bAllowCullDistanceVolume : 1; // 0x241
	char bHasMotionBlurVelocityMeshes : 1; // 0x241
	char bVisibleInReflectionCaptures : 1; // 0x241
	char bVisibleInRayTracing : 1; // 0x241
	char bRenderInMainPass : 1; // 0x242
	char bRenderInDepthPass : 1; // 0x242
	char bReceivesDecals : 1; // 0x242
	char bOwnerNoSee : 1; // 0x242
	char bOnlyOwnerSee : 1; // 0x242
	char bTreatAsBackgroundForOcclusion : 1; // 0x242
	char bUseAsOccluder : 1; // 0x242
	char bSelectable : 1; // 0x242
	char bForceMipStreaming : 1; // 0x243
	char bHasPerInstanceHitProxies : 1; // 0x243
	char CastShadow : 1; // 0x243
	char bAffectDynamicIndirectLighting : 1; // 0x243
	char bAffectDistanceFieldLighting : 1; // 0x243
	char bCastDynamicShadow : 1; // 0x243
	char bCastStaticShadow : 1; // 0x243
	char bCastVolumetricTranslucentShadow : 1; // 0x243
	char bSelfShadowOnly : 1; // 0x244
	char bCastFarShadow : 1; // 0x244
	char bCastInsetShadow : 1; // 0x244
	char bCastCinematicShadow : 1; // 0x244
	char bCastHiddenShadow : 1; // 0x244
	char bCastShadowAsTwoSided : 1; // 0x244
	char bLightAsIfStatic : 1; // 0x244
	char bLightAttachmentsAsGroup : 1; // 0x244
	char bExcludeFromLightAttachmentGroup : 1; // 0x245
	char bReceiveMobileCSMShadows : 1; // 0x245
	char bSingleSampleShadowFromStationaryLights : 1; // 0x245
	char bIgnoreRadialImpulse : 1; // 0x245
	char bIgnoreRadialForce : 1; // 0x245
	char bApplyImpulseOnDamage : 1; // 0x245
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x245
	char AlwaysLoadOnClient : 1; // 0x245
	char AlwaysLoadOnServer : 1; // 0x246
	char bUseEditorCompositing : 1; // 0x246
	char bRenderCustomDepth : 1; // 0x246
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x247
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x249
	FLightingChannels LightingChannels; // 0x24a
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x24b
	int32_t CustomDepthStencilValue; // 0x24c
	FCustomPrimitiveData CustomPrimitiveData; // 0x250
	int32_t TranslucencySortPriority; // 0x260
	int32_t VisibilityId; // 0x264
	char bIgnoreOcclusionVolume : 1; // 0x268
	int32_t OcclusionVolumeId; // 0x26c
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x270
	uint8_t VirtualTextureLodBias; // 0x280
	uint8_t VirtualTextureCullMips; // 0x281
	uint8_t VirtualTextureMinCoverage; // 0x282
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x283
	float LpvBiasMultiplier; // 0x288
	float BoundsScale; // 0x294
	TArray<AActor*> MoveIgnoreActors; // 0x2a8
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2b8
	FBodyInstance BodyInstance; // 0x2d8
	FScriptMulticastDelegate OnComponentHit; // 0x3e8
	FScriptMulticastDelegate OnComponentBeginOverlap; // 0x3e9
	FScriptMulticastDelegate OnComponentEndOverlap; // 0x3ea
	FScriptMulticastDelegate OnComponentWake; // 0x3eb
	FScriptMulticastDelegate OnComponentSleep; // 0x3ec
	FScriptMulticastDelegate OnBeginCursorOver; // 0x3ee
	FScriptMulticastDelegate OnEndCursorOver; // 0x3ef
	FScriptMulticastDelegate OnClicked; // 0x3f0
	FScriptMulticastDelegate OnReleased; // 0x3f1
	FScriptMulticastDelegate OnInputTouchBegin; // 0x3f2
	FScriptMulticastDelegate OnInputTouchEnd; // 0x3f3
	FScriptMulticastDelegate OnInputTouchEnter; // 0x3f4
	FScriptMulticastDelegate OnInputTouchLeave; // 0x3f5
	UPrimitiveComponent* LODParentPrimitive; // 0x410
};

struct ASkyLight {
	USkyLightComponent* LightComponent; // 0x218
	char bEnabled : 1; // 0x220
};

struct UParticleModuleEventReceiverBase {
	EParticleEventType EventGeneratorType; // 0x30
	FName EventName; // 0x34
};

struct UMM_Occupation_Observer_TargetHP {
	UMirTextBlock* m_Txt_Name; // 0x3a0
	UMirImage* m_Img_Icon; // 0x3a8
};

struct UPaperSprite {
	FVector2D BakedSourceUV; // 0x38
	FVector2D BakedSourceDimension; // 0x40
	UTexture2D* BakedSourceTexture; // 0x48
	UMaterialInterface* DefaultMaterial; // 0x50
	UMaterialInterface* AlternateMaterial; // 0x58
	TArray<FPaperSpriteSocket> Sockets; // 0x60
	ESpriteCollisionMode SpriteCollisionDomain; // 0x70
	float PixelsPerUnrealUnit; // 0x74
	UBodySetup* BodySetup; // 0x78
	int32_t AlternateMaterialSplitIndex; // 0x80
	TArray<FVector4> BakedRenderData; // 0x88
};

struct ARigidBodyBase {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct UMM_Popup_Chat_UserInfo {
	UMirTextBlock* Txt_UserNickname; // 0x300
	UMM_Common_Btn* Btn_CharacterDetail; // 0x308
	UMM_Common_Btn* Btn_PartyInvite; // 0x310
	UMM_Common_Btn* Btn_WhisperChat; // 0x318
	UMM_Common_Btn* Btn_BlockUser; // 0x320
	UMM_Common_Btn_Symbol* btn_close; // 0x328
	UMM_Common_Btn* Btn_NickNameCopy; // 0x330
	UMM_Common_Btn* Btn_MessageCopy; // 0x338
};

struct AMoveTrigger {
	FVector m_BoxExtent; // 0x280
	AMoveTrigger* Next; // 0x290
	AMoveTrigger* prev; // 0x298
};

struct UMM_CharAbility_Info_Rank {
	TArray<UMM_PlayerRank*> PlayerRankList; // 0x2f0
};

struct UMaterialExpressionRayTracingQualitySwitch {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UAISenseConfig_Sight {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
};

struct UWriteAndFlushLeaderboards {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFail; // 0x40
};

struct UActorSequencePlayer {
	FScriptMulticastDelegate OnPlay; // 0x408
	FScriptMulticastDelegate OnPlayReverse; // 0x418
	FScriptMulticastDelegate OnStop; // 0x428
	FScriptMulticastDelegate OnPause; // 0x438
	FScriptMulticastDelegate OnFinished; // 0x448
	EMovieScenePlayerStatus Status; // 0x458
	char bReversePlayback : 1; // 0x45c
	UMovieSceneSequence* Sequence; // 0x460
	FFrameNumber StartTime; // 0x468
	int32_t DurationFrames; // 0x46c
	int32_t CurrentNumLoops; // 0x470
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x4a0
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x810
	TScriptInterface<Class> PlaybackClient; // 0x820
};

struct UMovieScene3DPathSection {
	FMovieSceneFloatChannel TimingCurve; // 0x108
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1a8
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1a9
	char bFollow : 1; // 0x1ac
	char bReverse : 1; // 0x1ac
	char bForceUpright : 1; // 0x1ac
};

struct UEditableGameplayTagQuery {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct AFieldSystemActor {
	UFieldSystemComponent* FieldSystemComponent; // 0x218
};

struct USourceEffectEQPreset {
	FSourceEffectEQSettings Settings; // 0x78
};

struct UMM_CharacterCustomizingModule {
	TWeakObjectPtr<UMM_CharacterPartsComponent> m_pPartsComponent; // 0x7c
};

struct UMM_Popup_GuildHostility {
	UMirTextBlock* m_Txt_Title; // 0x2f0
	UMirTextBlock* m_Txt_Desc; // 0x2f8
	UMirTextBlock* m_Txt_MyGuildName; // 0x300
	UMirTextBlock* m_Txt_MyGuildCombatPower; // 0x308
	UMM_GuildIcon* m_MyGuildIcon; // 0x310
	UMirTextBlock* m_Txt_GuildName; // 0x318
	UMirTextBlock* m_Txt_GuildCombatPower; // 0x320
	UMM_GuildIcon* m_GuildIcon; // 0x328
	UMirCanvasPanel* m_Panel_EndTime; // 0x330
	UMirTextBlock* m_Txt_EndTime; // 0x338
	UHorizontalBox* m_Panel_Cost; // 0x340
	UMirTextBlock* m_Txt_CostTitle; // 0x348
	UMirImage* m_Img_WarCostIcon; // 0x350
	UMirTextBlock* m_Txt_WarCostCount; // 0x358
	UMM_Common_Btn* m_CB_StartHostility; // 0x360
	UMM_Common_Btn* m_CB_CancelHostility; // 0x368
	UMM_Common_Btn* m_CB_Cancel; // 0x370
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x378
	UMirTextBlock* m_Txt_RemindTime; // 0x380
	UWidgetAnimation* m_OpenAni; // 0x388
	UWidgetAnimation* m_CloseAni; // 0x390
};

struct UInterpTrackInstToggle {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct AGhostSkeletalMesh {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct UFieldNodeFloat {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
	char bReplicates : 1; // 0x84
	char bNetAddressable : 1; // 0x84
	char bAutoActivate : 1; // 0x85
	char bIsActive : 1; // 0x86
	char bEditableWhenInherited : 1; // 0x86
	char bCanEverAffectNavigation : 1; // 0x86
	char bIsEditorOnly : 1; // 0x86
	EComponentCreationMethod CreationMethod; // 0x88
	FScriptMulticastDelegate OnComponentActivated; // 0x89
	FScriptMulticastDelegate OnComponentDeactivated; // 0x8a
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
};

struct AProceduralFoliageBlockingVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x250
};

struct UParticleModuleKillHeight {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UMM_PopupGuildSearchSlot {
	UMirImage* img_rank; // 0x2e0
	UMirTextBlock* txt_rank; // 0x2e8
	UMM_GuildIcon* guild_icon; // 0x2f0
	UMirTextBlock* Txt_Name; // 0x2f8
	UMirTextBlock* txt_master_name; // 0x300
	UMirTextBlock* txt_combatpower; // 0x308
	UMirTextBlock* txt_level; // 0x310
	UMirTextBlock* txt_member; // 0x318
	UMirButton* Btn_Main; // 0x320
};

struct UMM_Dominion_Base {
	UMirImage* m_pImgPerson; // 0x2f0
	UMirTextBlock* m_pTxtUserCount; // 0x2f8
	UMM_Common_Btn_Cost* m_pBtnFastEnter; // 0x300
	UMM_Common_Btn* m_pBtnEnter; // 0x308
	UMM_Dominion_Base_List* m_pBaseList; // 0x310
	UMM_Dominion_Base_StrongPoint* m_pBaseStrongPoint; // 0x318
};

struct UMM_DungeonCommonGuildExpTicket {
	UMirCanvasPanel* canCreateState; // 0x2e0
	UMirTextBlock* txtFixNeedTicket; // 0x2e8
	UMM_Slot_Material_Item* slotNeedTicket1; // 0x2f0
	UMM_Slot_Material_Item* slotNeedTicket2; // 0x2f8
	UMM_Slot_Material_Item* slotNeedTicket3; // 0x300
	UMirCanvasPanel* canReadyState; // 0x308
	UMirTextBlock* txtNoti1; // 0x310
	UMirRichTextBlock* rtxtNoti2; // 0x318
	UMirCanvasPanel* canRunState; // 0x320
	UMirCanvasPanel* canLeftState; // 0x328
	UMirTextBlock* txtLeftState1; // 0x330
	UMirTextBlock* txtLeftState2; // 0x338
	UMirCanvasPanel* canRightState; // 0x340
	UMirTextBlock* txtRightState1; // 0x348
	UMirTextBlock* txtRightState2; // 0x350
	UMM_Common_ToolTipBtn* BtnTooltip; // 0x358
};

struct UMM_Popup_GuildCommandMark {
	UMirTextBlock* m_TxtTargetName; // 0x2e0
	TArray<UMM_GuildCommandMark_Slot*> m_MarkSlots; // 0x2e8
	UMirButton* m_BtnClose; // 0x2f8
};

struct UMM_HudTargetInfo {
	UCanvasPanel* Can_Mana; // 0x2e0
	TArray<UMM_BuffIconWidget*> buffIconWidget; // 0x2e8
	UMM_HudTargetBuffInfo* BuffInfoList; // 0x2f8
	UMirImage* Img_MaintargetIcon_BG; // 0x300
	UMirRichTextBlock* Txt_Maintarget_Grade; // 0x308
	UMM_ProgressBar_HP_Stack* Progressbar_TargetHP; // 0x310
	UProgressBar* targetManaPrg; // 0x318
	UMirTextBlock* Text_Mana; // 0x320
	UMirTextBlock* levelTxt; // 0x328
	UMirTextBlock* nameTxt; // 0x330
	UMirButton* MainTargetButton; // 0x338
	UCanvasPanel* Can_SubTargetInfo; // 0x340
	UMirTextBlock* Text_SubtargetHP; // 0x348
	UProgressBar* Prg_SubTargetHp; // 0x350
	UMirTextBlock* Txt_SubTarget_Level; // 0x358
	UMirTextBlock* Txt_SubTarget_Name; // 0x360
	UMirButton* Btn_Sub_Close; // 0x368
	UCanvasPanel* Can_Worldboss_Con; // 0x370
	UMirButton* Btn_WorldBoss_Contribution; // 0x378
	UMirButton* SubTargetButton; // 0x380
	UMM_HudTargetSubMenu* m_pMainTargetSubMenu; // 0x388
	UMM_HudTargetSubMenu* m_pSubTargetSubMenu; // 0x390
	UMirButton* btn_lock; // 0x398
	UMirImage* Img_Unlock; // 0x3a0
	UMirImage* Img_Lock; // 0x3a8
	UHorizontalBox* HorizontalBox_MainBuffListArea; // 0x3b0
	UCanvasPanel* Can_Target_Sharing; // 0x3b8
	UMirButton* Btn_Target_Sharing; // 0x3c0
	UWidgetAnimation* aniTargetSharing; // 0x3c8
	UWidgetAnimation* m_BuffInfoStartAni; // 0x3f0
	UWidgetAnimation* m_BuffInfoStartAniShort; // 0x3f8
	FLinearColor SPBarColor_2; // 0x400
	FLinearColor SPBarColor_3; // 0x410
	float RecoverSPLimitTime; // 0x420
	int32_t ShieldType; // 0x424
	bool UnbeatableShield; // 0x428
	bool InRecover; // 0x430
	bool RecoveryComplete; // 0x431
	float ProductionTime; // 0x434
	float StartTime; // 0x438
};

struct ULightmappedSurfaceCollection {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UMM_Guild_DevList {
	TArray<UCanvasPanel*> m_arCanSlot; // 0x2f0
	TArray<UMM_Guild_DevSlot*> m_arSlot1; // 0x300
	TArray<UMM_Guild_DevSlot*> m_arSlot2; // 0x310
	TArray<UMM_Guild_DevSlot*> m_arSlot3; // 0x320
	TArray<UMM_Guild_DevSlot*> m_arSlot4; // 0x330
	TArray<UMM_Guild_DevSlot*> m_arUsedDevSlot; // 0x348
};

struct UMM_B_PopupNFTCharacterListSlot {
	UMirTextBlock* txt_region; // 0x2e0
	UMirTextBlock* txt_world; // 0x2e8
	UMirImage* img_character_icon; // 0x2f0
	UMirTextBlock* txt_nickname; // 0x2f8
	UMirTextBlock* txt_level; // 0x300
	UMirImage* img_cost; // 0x308
	UMirTextBlock* txt_cost; // 0x310
	UMirTextBlock* txt_collection; // 0x318
	UMirImage* img_selected; // 0x320
	UMirButton* btn_selected; // 0x328
};

struct UMM_HeadlineMsg {
	float m_fMoveSpeed; // 0x2f0
	UWidgetAnimation* m_AniStart; // 0x2f8
	UPanelWidget* m_Grid_DisplayArea; // 0x328
	UMirRichTextBlock* m_RTxt_Message; // 0x330
	UCanvasPanel* m_Canvas_TextArea; // 0x338
};

struct UMM_TotalMenu {
	TArray<UMM_TotalMenu_SlotBase*> m_arTotalMenuSlot; // 0x300
	UWidgetAnimation* m_AniStart; // 0x310
	UWidgetAnimation* m_AniShowSubSlot_1; // 0x318
	UWidgetAnimation* m_AniShowSubSlot_2; // 0x320
	UWidgetAnimation* m_AniShowSubSlot_3; // 0x328
	UWidgetAnimation* m_AniShowSubSlot_4; // 0x330
	UWidgetAnimation* m_AniShowSubSlot_5; // 0x338
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x340
	UMM_Goods_Detail* m_Goods_Detail; // 0x348
	UMirButton* m_Btn_Screen; // 0x350
	UMirCanvasPanel* m_Canvas_Info; // 0x358
	UMM_Common_Btn_Symbol* m_Btn_InfoClose; // 0x360
	UMM_Common_Btn* m_Btn_Achieve; // 0x368
	UMirTextBlock* m_Txt_CostValue; // 0x370
	UMirImage* m_Img_Icon; // 0x378
	UMirTextBlock* m_Txt_Desc; // 0x380
	UMirCanvasPanel* m_Canvas_SimpleGraphic; // 0x388
	UMM_Common_Btn_Symbol* m_Btn_SimpleGraphicClose; // 0x390
	UMirCheckBox* m_Check_Graphic; // 0x398
	UMirCheckBox* m_Check_Name; // 0x3a0
	UMirCheckBox* m_Check_GuildMark; // 0x3a8
	UPanelWidget* m_Can_ServerTime; // 0x3b0
	UMirTextBlock* m_Txt_ServerTime; // 0x3b8
};

struct UUniformInteger {
	int32_t Magnitude; // 0xb0
};

struct AMatineeActorCameraAnim {
	UCameraAnim* CameraAnim; // 0x2c0
};

struct UCinematicAnimInstance {
	float m_FirstAnimationLength; // 0x290
	float m_SecondAnimationLength; // 0x294
	bool m_FirstAniLoop; // 0x298
	bool m_SecondAniLoop; // 0x299
	bool m_bChangeFirstAnim; // 0x29a
	EPlayAniType m_PlayAniState; // 0x29b
	float m_Speed; // 0x29c
	float m_LookAtAlpha; // 0x2a0
	FVector m_LookAtLocation; // 0x2a4
	UAnimSequenceBase* m_pFirstSequence; // 0x2c0
	UAnimSequenceBase* m_pSecondSequence; // 0x2c8
};

struct UAssetManagerSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UParticleModuleColorScaleOverLife {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct UMaterialExpressionRuntimeVirtualTextureReplace {
	FExpressionInput Default; // 0x40
	FExpressionInput VirtualTextureOutput; // 0x54
};

struct UMaterialExpressionSphereMask {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct UMM_Auction_Tab_Search {
	UMM_Common_Board_Notice* m_pNotice; // 0x300
	UMM_CommonVerticalTabTreeSet* m_pTabSearchList; // 0x308
	UMirCanvasPanel* m_pCanvalBack; // 0x310
	UMirButton* m_pBtnBack; // 0x318
	UMirListView* m_pListView; // 0x320
	UMM_Auction_Tab_Search_TabGroup* m_pFilterGroup; // 0x328
	UMM_Auction_Tab_Search_ColumnName* m_pColumnName; // 0x330
};

struct AMM_CustomActorBase {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct AMM_Monster {
	int32_t MonDebugFSMLogCount; // 0xa48
	TArray<FString> m_MonDebugFSMLogList; // 0xa50
	TArray<FString> m_MonDebugLog; // 0xa60
	bool m_bDrawPushPullLocation; // 0xa70
	TArray<FVector> m_PushPullLocationList; // 0xa78
	float TestFloat; // 0xa88
	bool m_bPoolingObject; // 0xa8c
	UMM_B_MonNameTag* m_pMonNameTag; // 0xad8
	AMonsterGroupTrigger* m_pMonsterGroup; // 0xae8
	float m_fDeleteTime; // 0xb64
	bool m_bHideNameTag; // 0xb68
	UMonsterEntityComponent* m_pMonsterEntityComp; // 0xbc8
	int32_t SPState; // 0xed0
	float SPUpdateTime; // 0xed4
	float SPStateLimitTime; // 0xed8
};

struct UMM_New_Force_Detail_Info {
	UHorizontalBox* m_CurInfo; // 0x2f0
	UMirTextBlock* m_Txt_ForceName; // 0x2f8
	UMM_Common_Btn_Symbol* m_Btn_Detail; // 0x300
	UHorizontalBox* m_NextInfo; // 0x308
	UMirTextBlock* m_Txt_NextForceName; // 0x310
	UMM_Common_Btn_Symbol* m_Btn_NextDetail; // 0x318
};

struct ALevelScriptActor {
	char bInputEnabled : 1; // 0x218
};

struct UBTTask_WaitBlackboardTime {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UChaosSolverSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct UMonsterEntityComponent {
	TWeakObjectPtr<AMM_Monster> m_Owner; // 0xb0
};

struct AMM_BlueprintActionEffect {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x58
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bBlockInput : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x168
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x178
	FScriptMulticastDelegate OnTakePointDamage; // 0x179
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x17a
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x17b
	FScriptMulticastDelegate OnActorEndOverlap; // 0x17c
	FScriptMulticastDelegate OnBeginCursorOver; // 0x17d
	FScriptMulticastDelegate OnEndCursorOver; // 0x17e
	FScriptMulticastDelegate OnClicked; // 0x17f
	FScriptMulticastDelegate OnReleased; // 0x180
	FScriptMulticastDelegate OnInputTouchBegin; // 0x181
	FScriptMulticastDelegate OnInputTouchEnd; // 0x182
	FScriptMulticastDelegate OnInputTouchEnter; // 0x183
	FScriptMulticastDelegate OnInputTouchLeave; // 0x184
	FScriptMulticastDelegate OnActorHit; // 0x185
	FScriptMulticastDelegate OnDestroyed; // 0x186
	FScriptMulticastDelegate OnEndPlay; // 0x187
	TArray<UActorComponent*> InstanceComponents; // 0x1e8
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x1f8
};

struct USourceEffectMidSideSpreaderPreset {
	FSourceEffectMidSideSpreaderSettings Settings; // 0x74
};

struct UMM_Force_LevelUp {
	UMirImage* Img_Symbol; // 0x2e0
	UMirTextBlock* Txt_Title; // 0x2e8
	UMirTextBlock* Txt_Description; // 0x2f0
};

struct UActorChannel {
	AActor* Actor; // 0x70
	TArray<UObject*> CreateSubObjects; // 0x160
};

struct UMM_GameOption_Environment {
	UMM_CommonVerticalTabSet* EnvironmentTabSet; // 0x2f0
	UWidgetSwitcher* WidgetSwitcher; // 0x2f8
	UMM_GameOption_Graphic* Environment_Graphic; // 0x300
	UMM_GameOption_Sound* Environment_Sound; // 0x308
	UMM_GameOption_Language* Environment_Language; // 0x310
};

struct UMaterialExpressionFunctionInput {
	FExpressionInput Preview; // 0x40
	FName InputName; // 0x54
	FString Description; // 0x60
	FGuid ID; // 0x70
	EFunctionInputType InputType; // 0x80
	FVector4 PreviewValue; // 0x90
	char bUsePreviewValueAsDefault : 1; // 0xa0
	int32_t SortPriority; // 0xa4
	char bCompilingFunctionPreview : 1; // 0xa8
};

struct UMM_UIShopBtnCashBag {
	UMirTextBlock* mTxtTabName; // 0x2f0
	UMirImage* mImgSelected; // 0x2f8
	UMirImage* mImgIndicator; // 0x300
	UMirButton* mBtnCashBag; // 0x308
};

struct UEnvQueryTest_Random {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x80
	FAIDataProviderFloatValue FloatValueMax; // 0xb0
	EEnvTestScoreEquation ScoringEquation; // 0xe1
	EEnvQueryTestClamping ClampMinType; // 0xe2
	EEnvQueryTestClamping ClampMaxType; // 0xe3
	EEQSNormalizationType NormalizationType; // 0xe4
	FAIDataProviderFloatValue ScoreClampMin; // 0xe8
	FAIDataProviderFloatValue ScoreClampMax; // 0x118
	FAIDataProviderFloatValue ScoringFactor; // 0x148
	FAIDataProviderFloatValue ReferenceValue; // 0x178
	bool bDefineReferenceValue; // 0x1a8
	char bWorkOnFloatValues : 1; // 0x1b8
};

struct UInteractiveFoliageComponent {
	int32_t ForcedLodModel; // 0x440
	int32_t PreviousLODLevel; // 0x444
	int32_t MinLOD; // 0x448
	int32_t SubDivisionStepSize; // 0x44c
	UStaticMesh* StaticMesh; // 0x450
	FColor WireframeColorOverride; // 0x458
	char bEvaluateWorldPositionOffset : 1; // 0x45c
	char bOverrideWireframeColor : 1; // 0x45c
	char bOverrideMinLOD : 1; // 0x45c
	char bOverrideNavigationExport : 1; // 0x45c
	char bForceNavigationObstacle : 1; // 0x45c
	char bDisallowMeshPaintPerInstance : 1; // 0x45c
	char bIgnoreInstanceForTextureStreaming : 1; // 0x45c
	char bOverrideLightMapRes : 1; // 0x45c
	char bCastDistanceFieldIndirectShadow : 1; // 0x45d
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x45d
	char bUseSubDivisions : 1; // 0x45d
	char bUseDefaultCollision : 1; // 0x45d
	char bForceReceiveCSMForLM : 1; // 0x45d
	char bReverseCulling : 1; // 0x45d
	int32_t OverriddenLightMapRes; // 0x460
	float DistanceFieldIndirectShadowMinVisibility; // 0x464
	float DistanceFieldSelfShadowBias; // 0x468
	float StreamingDistanceMultiplier; // 0x46c
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x470
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x480
	FLightmassPrimitiveSettings LightmassSettings; // 0x490
};

struct AMM_GachaInteractionObjectActor {
	EGachaBoxType TestGacha; // 0x218
	EGachaResultType TestGachaResult; // 0x219
	int32_t TestItemID; // 0x21c
	UPetCameraData* m_pPetCameraData; // 0x220
	USkeletalMeshComponent* GachaMeshComponent; // 0x228
	USkeletalMeshComponent* ResultMeshComponent; // 0x230
	UParticleSystemComponent* DefaultParticleComponent; // 0x238
	UParticleSystemComponent* InteractionParticleComponent; // 0x240
	UGachaDirectingData* GachaDirectingData; // 0x248
	UAnimSequenceBase* m_pIdleAnimation; // 0x250
	UAnimSequenceBase* m_pOpenAnimation; // 0x258
	UAnimSequenceBase* m_pEndAnimation; // 0x260
	AMM_GachaManagerActor* GachaManagerActor; // 0x268
	UParticleSystem* m_pInteractionEffect; // 0x270
	UParticleSystem* m_pInteractionOpenEffect; // 0x278
	UParticleSystem* m_pInteractionMaterialEffect; // 0x280
	UObject* m_pResultAnimation; // 0x288
};

struct UMM_RefuseRebirthGauge {
	UMirImage* m_RefuseRebirthGauge; // 0x2e0
	UCanvasPanel* m_Canvas_PartyMember; // 0x2e8
};

struct UOnlineSubsystemExtendedFacebookWebBrowser {
	FScriptMulticastDelegate OnUrlChanged; // 0x108
	FString InitialURL; // 0x118
	bool bSupportsTransparency; // 0x128
};

struct UMM_CommonVerticalTabBtn_Symbol {
	UMirTextBlock* m_Txt_TabName; // 0x2f0
	UMirImage* m_Img_Locked; // 0x2f8
	UMirImage* m_Img_Selected; // 0x300
	UMirButton* m_Btn_Main; // 0x308
	UMirImage* m_Img_Indicator; // 0x310
	UPanelWidget* m_Grid_Effect_1; // 0x318
	UPanelWidget* m_Grid_Effect_2; // 0x320
	UMirTextBlock* m_Txt_Name; // 0x328
	UMirImage* m_Img_Icon; // 0x330
	UMirImage* m_Img_SelectedBG; // 0x338
	int32_t TypeID; // 0x340
	int32_t CostTypeID; // 0x344
};

struct UTestMovieSceneSection {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UMM_ExecuteDecalComponent {
	FName InsideName; // 0xb0
	float ElapsedTime; // 0xb8
	float ScalingTime; // 0xbc
	float AliveTime; // 0xc0
	float CharScale; // 0xc4
	UDecalComponent* ExecuteDecal; // 0xc8
	UMaterialInstanceDynamic* ExecuteMaterialInstanceDynamic; // 0xd0
};

struct UAnimationAsset {
	USkeleton* Skeleton; // 0x38
	TArray<UAnimMetaData*> metadata; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct UMaterialExpressionSign {
	FExpressionInput Input; // 0x40
};

struct UMM_Guild_MainHome {
	FLinearColor m_Color_DominionGrade_2; // 0x36c
	FLinearColor m_Color_DominionGrade_3; // 0x37c
	FLinearColor m_Color_DominionGrade_4; // 0x38c
	UMirImage* m_Img_Frame; // 0x3a0
	UMirImage* m_Img_Symbol; // 0x3a8
	UMirTextBlock* m_Txt_Leader_Title; // 0x3b0
	UMirTextBlock* m_Txt_Leader; // 0x3b8
	UMirTextBlock* m_Txt_Member_Title; // 0x3c0
	UMirTextBlock* m_Txt_Member_Count; // 0x3c8
	UMirTextBlock* m_Txt_Guild_Dominion; // 0x3d0
	UMirImage* m_Img_Guild_Dominion; // 0x3d8
	UMirTextBlock* m_Txt_Guild_Name; // 0x3e0
	UMirTextBlock* m_Txt_Guild_Lv; // 0x3e8
	UMirTextBlock* m_Txt_CombatPower_Title; // 0x3f0
	UMirTextBlock* m_Txt_CombatPower_Value; // 0x3f8
	UMirProgressBar* m_Prog_Guild_Exp; // 0x400
	UMirTextBlock* m_Txt_Guild_Exp_Value; // 0x408
	UMirTextBlock* m_Txt_GuildDev_Point; // 0x410
	UMM_Guild_Info_Btn* m_CB_GuildDevGroup_2; // 0x418
	UMM_Guild_Info_Btn* m_CB_GuildDevGroup_3; // 0x420
	UMM_Guild_Info_Btn* m_CB_GuildDevGroup_4; // 0x428
	UMirTextBlock* m_Txt_Pr_Title; // 0x430
	UMirScrollBox* m_Scr_Edit_PR; // 0x438
	UMirMultiLineEditableText* m_Edit_PR; // 0x440
	UMirScrollBox* m_Scr_Txt_PR; // 0x448
	UMirTextBlock* m_Txt_PR; // 0x450
	UCanvasPanel* m_Can_Send_PR; // 0x458
	UMM_Common_Btn* m_Btn_Send_PR; // 0x460
	UMM_Common_Btn_Translation* m_Btn_Translation; // 0x468
	UMirCanvasPanel* m_Panel_MyInfo; // 0x470
	UMM_Guild_Slot_Btn* m_CB_Support; // 0x478
	UMM_Guild_Slot_Btn* m_CB_Diplomacy; // 0x480
	UMM_Guild_Slot_Btn* m_CB_Wanted; // 0x488
	UMM_Guild_Slot_Btn* m_CB_Event; // 0x490
	UMM_Guild_Slot_Btn* m_CB_Develop; // 0x498
	UMM_Guild_Slot_Btn* m_CB_Inventory; // 0x4a0
	UMM_Guild_Slot_Btn* m_CB_GuildShop; // 0x4a8
	UMM_Guild_Slot_Btn* m_CB_GuildSupply; // 0x4b0
	UMirTextBlock* m_Txt_JoinLimitCombatPoint; // 0x4b8
	UMM_Common_Btn* m_CB_Applicant; // 0x4c0
	UMM_Common_Btn* m_CB_ApplicantCancel; // 0x4c8
	UMM_Common_Btn* m_CB_InviteAgree; // 0x4d0
	UMM_Common_Btn* m_CB_InviteDisAgree; // 0x4d8
	UMM_Common_Btn* m_CB_ReqAlliance; // 0x4e0
	UMM_Common_Btn* m_CB_ReqAllianceCancel; // 0x4e8
	UMM_Common_Btn* m_CB_AllianceDisAgree; // 0x4f0
	UMM_Common_Btn* m_CB_AllianceAgree; // 0x4f8
	UMM_Common_Btn* m_CB_AllianceClear; // 0x500
	UMM_Common_Btn* m_CB_Hostility; // 0x508
	UMM_Common_Btn* m_CB_HostilityCancel; // 0x510
	UMM_Common_Btn* m_CB_GuildMember; // 0x518
	UMM_Common_Btn_Symbol* m_CB_Contribute; // 0x520
	UMirCanvasPanel* m_Panel_OtherInfo; // 0x528
	UMirImage* m_Img_OtherIcon; // 0x530
	UMirRichTextBlock* m_RichTxt_OtherStatus; // 0x538
	UHorizontalBox* m_DevSkillBox; // 0x540
	TArray<UMirImage*> m_Img_SkillIcons; // 0x548
	TArray<UMirButton*> m_Btn_SkillIcons; // 0x558
	UMirCanvasPanel* m_Panel_MaxMembers; // 0x568
	UMirRichTextBlock* m_RichTxt_MaxMembers; // 0x570
	UMM_Common_ToolTipBtn* m_BtnTooltip_GuildInfo; // 0x578
	UMM_Common_ToolTipBtn* m_BtnTooltip_GuildDev; // 0x580
	UMirCanvasPanel* m_Panel_Sanctum; // 0x588
	UMirCanvasPanel* m_Panel_SanctumTime; // 0x590
	UMirTextBlock* m_Txt_Sanctum_RemaindTime; // 0x598
	UMirImage* m_Img_Sanctum; // 0x5a0
	UMirButton* m_Btn_Sanctum; // 0x5a8
	UWidgetAnimation* m_Ani_Sanctum; // 0x5b0
	UMM_Common_Btn_Symbol* m_Btn_SaveClipBoard; // 0x5b8
};

struct USubUVAnimation {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UNavLinkCustomComponent {
	uint32_t NavLinkUserId; // 0xe8
	UNavArea* EnabledAreaClass; // 0xf0
	UNavArea* DisabledAreaClass; // 0xf8
	FNavAgentSelector SupportedAgents; // 0x100
	FVector LinkRelativeStart; // 0x104
	FVector LinkRelativeEnd; // 0x110
	ENavLinkDirection LinkDirection; // 0x11c
	char bLinkEnabled : 1; // 0x120
	char bNotifyWhenEnabled : 1; // 0x120
	char bNotifyWhenDisabled : 1; // 0x120
	char bCreateBoxObstacle : 1; // 0x120
	FVector ObstacleOffset; // 0x124
	FVector ObstacleExtent; // 0x130
	UNavArea* ObstacleAreaClass; // 0x140
	float BroadcastRadius; // 0x148
	float BroadcastInterval; // 0x14c
	ECollisionChannel BroadcastChannel; // 0x150
};

struct UMM_ScreenMsg {
	float m_fShowTime; // 0x2f0
	UWidgetAnimation* m_AniStart; // 0x2f8
	UMirRichTextBlock* m_RTxt_Message; // 0x328
};

struct UMaterialExpressionParticleMotionBlurFade {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UBookMark2D {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct UParticleModuleBeamSource {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UMM_Popup_GuildMembersGradeSlot {
	UMirImage* Img_Grade; // 0x2e0
	UMirImage* img_selected; // 0x2e8
	UMirTextBlock* txt_grade_name; // 0x2f0
	UMirTextBlock* txt_count; // 0x2f8
	UMirButton* Btn_Main; // 0x300
};

struct AGameModeBase {
	FString OptionsString; // 0x218
	AGameSession* GameSessionClass; // 0x228
	AGameStateBase* GameStateClass; // 0x230
	APlayerController* PlayerControllerClass; // 0x238
	APlayerState* PlayerStateClass; // 0x240
	AHUD* HUDClass; // 0x248
	APawn* DefaultPawnClass; // 0x250
	ASpectatorPawn* SpectatorClass; // 0x258
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x260
	AServerStatReplicator* ServerStatReplicatorClass; // 0x268
	AGameSession* GameSession; // 0x270
	AGameStateBase* GameState; // 0x278
	AServerStatReplicator* ServerStatReplicator; // 0x280
	FText DefaultPlayerName; // 0x288
	char bUseSeamlessTravel : 1; // 0x2a0
	char bStartPlayersAsSpectators : 1; // 0x2a0
	char bPauseable : 1; // 0x2a0
};

struct UInterpTrackVisibility {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UParticleModuleRotation {
	FRawDistributionFloat StartRotation; // 0x30
};

struct UMM_Dominion_Castle_Log {
	UMirImage* m_pImgIcon; // 0x2e8
	UMirTextBlock* m_pTxtTaxValue; // 0x2f0
	UMM_Common_Btn_Symbol* m_pBtnSetTax; // 0x2f8
};

struct UMM_Popup_MysticalPieces_Infos {
	UMirTextBlock* m_Txt_Title; // 0x2e0
	UMM_Common_Btn_Symbol* m_Btn_Close; // 0x2e8
	UMirScrollBox* m_MirScrollBox; // 0x2f0
	TArray<UMM_PopUp_ItemInfo_Ability*> m_ItemInfo_Abilitys; // 0x2f8
	TArray<UMM_PassiveSkillDesc*> m_SkillInfos; // 0x308
	UMM_Common_Board_Notice* m_Notice; // 0x318
	UMirButton* m_Btn_Bg; // 0x320
	UMirTextBlock* m_Txt_Notice; // 0x328
};

struct AMonsterKillTrigger {
	bool m_bInstantKill; // 0x278
	int32_t m_MonsterOrderID; // 0x27c
};

struct UBTService {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UNavigationGraphNodeComponent {
	FNavGraphNode Node; // 0x220
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x238
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x240
};

struct UMM_QuickSlot_Option_Button {
	FText m_Text; // 0x2e8
	int32_t m_iSelected; // 0x300
	FSlateFontInfo m_Font; // 0x308
	FSlateColor m_SelectFontColor; // 0x358
	FSlateColor m_UnSelectFontColor; // 0x380
	UTextBlock* m_Txt_Name; // 0x3b8
	UMirImage* m_Img_Select; // 0x3c0
	UMirButton* m_Btn_Main; // 0x3c8
};

struct UMM_GameOption_InGame_Target {
	UMM_GameOption_Select* Option_select_mode; // 0x2f0
	TArray<UMM_GameOption_Select*> arOption_Select; // 0x2f8
};

struct UMeshSimplificationSettings {
	FName MeshReductionModuleName; // 0x38
};

struct UMovieSceneObjectPropertyTrack {
	UObject* PropertyClass; // 0x88
};

struct ULayer {
	FName LayerName; // 0x28
	char bIsVisible : 1; // 0x30
	TArray<FLayerActorStats> ActorStats; // 0x38
};

struct UOnlinePIESettings {
	bool bOnlinePIEEnabled; // 0x38
	TArray<FPIELoginSettingsInternal> Logins; // 0x40
};

struct UMaterialExpressionBreakMaterialAttributes {
	FMaterialAttributesInput MaterialAttributes; // 0x40
};

struct UScrollBar {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct UParticleModuleCameraBase {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct AInvincibilityTrigger {
	bool m_bInvincibility; // 0x278
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UToIntegerField {
	UFieldNodeFloat* FloatField; // 0xb0
};

struct UMM_PlayerAnimInstance {
	float MoveBlendSpeed; // 0x270
	float MoveRate; // 0x274
	bool BattleState; // 0x278
	ERideState RideState; // 0x279
	int32_t VehicleType; // 0x27c
	float SideWalkDir; // 0x280
	bool IsStandJump; // 0x284
	int32_t SkillId; // 0x288
	int32_t CCSTANCE; // 0x28c
	int32_t AniIndex; // 0x290
	int32_t OpObjectType; // 0x294
	EAIRWALK_STATE AirwalkState; // 0x298
	bool IsHit; // 0x299
	bool bNewWallJumpStart; // 0x29a
	UCurveFloat* DashCameraBlurCurve; // 0x2a0
	UCurveFloat* Jump02Curve; // 0x2a8
	AMM_PC* Player; // 0x2b0
};

struct UDirectionalLightComponent {
	float ShadowCascadeBiasDistribution; // 0x368
	char bEnableLightShaftOcclusion : 1; // 0x36c
	float OcclusionMaskDarkness; // 0x370
	float OcclusionDepthRange; // 0x374
	FVector LightShaftOverrideDirection; // 0x378
	float WholeSceneDynamicShadowRadius; // 0x384
	float DynamicShadowDistanceMovableLight; // 0x388
	float DynamicShadowDistanceStationaryLight; // 0x38c
	int32_t DynamicShadowCascades; // 0x390
	float CascadeDistributionExponent; // 0x394
	float CascadeTransitionFraction; // 0x398
	float ShadowDistanceFadeoutFraction; // 0x39c
	char bUseInsetShadowsForMovableObjects : 1; // 0x3a0
	int32_t FarShadowCascadeCount; // 0x3a4
	float FarShadowDistance; // 0x3a8
	float DistanceFieldShadowDistance; // 0x3ac
	float LightSourceAngle; // 0x3b0
	float LightSourceSoftAngle; // 0x3b4
	float TraceDistance; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3bc
	char bCastModulatedShadows : 1; // 0x3cc
	FColor ModulatedShadowColor; // 0x3d0
	float ShadowAmount; // 0x3d4
	char bUsedAsAtmosphereSunLight : 1; // 0x3d8
	int32_t AtmosphereSunLightIndex; // 0x3dc
};

struct UMM_Popup_Term_Item_Info {
	UWidgetAnimation* m_AniStart; // 0x300
	UWidgetAnimation* m_AniEnd; // 0x308
	TArray<UMM_Slot_Term_Item*> Array_Slot; // 0x310
	UMM_Common_Btn_Symbol* btn_close; // 0x320
	UMirScrollBox* ScrollBox; // 0x328
	int32_t m_MaxTermItemSlotCount; // 0x330
	int32_t m_CurrentTermItemSlotCount; // 0x334
};

struct AMM_PC {
	AMM_Vehicle* m_pVehicle; // 0xa40
	AMM_ObjectBase* m_pInteractionObject; // 0xa58
	float m_VehicleCapsuleHeight; // 0xa64
	float m_DefaultCapsuleHeight; // 0xa68
	ALobbyCameraControl* CameraControl; // 0xa70
	AMM_PetObject* m_pPetObject; // 0xa90
	TArray<UParticleSystemComponent*> m_WeaponEffectComponentArray; // 0xab0
	float NormalAttackButtonCheckTime; // 0xad8
	float ChargingStartDelayTime; // 0xadc
	float NormalAttackInitTime; // 0xae0
	float m_AutoRideDistance; // 0xae4
	float m_AutoRideStepTime; // 0xae8
	float m_HangOnTime; // 0xaec
	float m_WallCheckAngle; // 0xaf0
	float m_WallCheckDistance; // 0xaf4
	float m_LandCheckDistance; // 0xaf8
	float m_FlySpeed; // 0xafc
	float m_FlyDownSpeed; // 0xb00
	float m_FallMoveSpeed; // 0xb04
	float m_LandAnimationTime; // 0xb08
	float m_FastRunControlTime; // 0xb0c
	UCameraShake* CameraShakeClass01; // 0xb10
	UCameraShake* CameraShakeClass02; // 0xb18
	ERideState m_RideState; // 0xb20
	bool IsHitState; // 0xb21
	int32_t m_ServerUID; // 0xb3c
	float ChangeBattleStateTime; // 0xb44
	bool m_IsStandJump; // 0xb60
	bool m_IsStandLand; // 0xb61
	float m_SideWalkDir; // 0xb64
	UMM_B_NameTag* m_pNameTag; // 0xb70
	int32_t m_AccountGrade; // 0xb78
};

struct UMaterialExpressionQualitySwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct USteamNetDriver {
	char LogPortUnreach : 1; // 0x708
	char AllowPlayerPortUnreach : 1; // 0x708
	uint32_t MaxPortCountToTry; // 0x70c
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x71c
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x720
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x724
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x728
	double MaxSecondsInReceive; // 0x730
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x738
};

struct UMM_Inventory_MysticalPiece {
	UMM_NewInventoryTab* m_InvenTab; // 0x2e8
	UMM_NewInventory* m_Inven; // 0x2f0
	UMM_SortListBtn* m_SortListBtn; // 0x2f8
	UMM_Common_Btn* m_Btn_Compose; // 0x300
	UMM_Common_Btn* m_Btn_Equip; // 0x308
};

struct AWorldSettings {
	int32_t VisibilityCellSize; // 0x220
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x224
	char bPrecomputeVisibility : 1; // 0x225
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x225
	char bEnableWorldBoundsChecks : 1; // 0x225
	char bEnableNavigationSystem : 1; // 0x225
	char bEnableAISystem : 1; // 0x225
	char bEnableWorldComposition : 1; // 0x225
	char bUseClientSideLevelStreamingVolumes : 1; // 0x225
	char bEnableWorldOriginRebasing : 1; // 0x225
	char bWorldGravitySet : 1; // 0x226
	char bGlobalGravitySet : 1; // 0x226
	char bMinimizeBSPSections : 1; // 0x226
	char bForceNoPrecomputedLighting : 1; // 0x226
	char bHighPriorityLoading : 1; // 0x226
	char bHighPriorityLoadingLocal : 1; // 0x226
	char bOverrideDefaultBroadphaseSettings : 1; // 0x226
	UNavigationSystemConfig* NavigationSystemConfig; // 0x228
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x230
	float WorldToMeters; // 0x238
	float KillZ; // 0x23c
	UDamageType* KillZDamageType; // 0x240
	float WorldGravityZ; // 0x248
	float GlobalGravityZ; // 0x24c
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x250
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x258
	AGameModeBase* DefaultGameMode; // 0x260
	AGameNetworkManager* GameNetworkManagerClass; // 0x268
	int32_t PackedLightAndShadowMapTextureSize; // 0x270
	FVector DefaultColorScale; // 0x274
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x280
	float GlobalDistanceFieldViewDistance; // 0x284
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x288
	FReverbSettings DefaultReverbSettings; // 0x290
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2b0
	float MonoCullingDistance; // 0x2d4
	USoundMix* DefaultBaseSoundMix; // 0x2d8
	float TimeDilation; // 0x2e0
	float MatineeTimeDilation; // 0x2e4
	float DemoPlayTimeDilation; // 0x2e8
	float MinGlobalTimeDilation; // 0x2ec
	float MaxGlobalTimeDilation; // 0x2f0
	float MinUndilatedFrameTime; // 0x2f4
	float MaxUndilatedFrameTime; // 0x2f8
	FBroadphaseSettings BroadphaseSettings; // 0x2fc
	APlayerState* Pauser; // 0x340
	TArray<FNetViewer> ReplicationViewers; // 0x348
	TArray<UAssetUserData*> AssetUserData; // 0x358
	APlayerState* PauserPlayerState; // 0x368
	int32_t MaxNumberOfBookmarks; // 0x370
	UBookmarkBase* DefaultBookmarkClass; // 0x378
	TArray<UBookmarkBase*> BookmarkArray; // 0x380
	UBookmarkBase* LastBookmarkClass; // 0x390
};

struct UMM_Popup_UnsealingAcceleration {
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x300
	UMM_Slot_Material* m_Slot_Item; // 0x308
	UMirTextBlock* m_Txt_ItemName; // 0x310
	UMirTextBlock* m_Txt_ItemGrade; // 0x318
	UMirTextBlock* m_Txt_SupportCount; // 0x320
	UMirProgressBar* m_Prg_Time; // 0x328
	UMirProgressBar* m_Prg_SupportTime; // 0x330
	UMirTextBlock* m_Txt_Time; // 0x338
	UMirScrollBox* m_Scr_AccelerationList; // 0x340
	TArray<UMM_UnsealingAccelerationSlot*> m_arAccelerationSlot; // 0x348
	UMM_Item_Make_Slider* m_pSliderPoint; // 0x358
	UMirTextBlock* m_pTxtAtTime; // 0x360
	UMirTextBlock* m_pTxtUsePoint; // 0x368
	UMirTextBlock* m_pTxtMyPoint; // 0x370
	UMM_Common_Btn* m_pBtnCancle; // 0x378
	UMM_Common_Btn* m_pBtnOk; // 0x380
};

struct UMaterialExpressionLightVector {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UGeometryCacheTrack_FlipbookAnimation {
	uint32_t NumMeshSamples; // 0x58
};

struct UMM_Occupation_SituationBoard {
	UMM_Occupation_Minimap* m_SiegeMinimap; // 0x2f0
	UMM_Occupation_BattleFieldInfo* m_SiegeBattleFieldInfo; // 0x2f8
	UMM_Common_Btn_Symbol* m_Btn_OpenRankPopup; // 0x300
	UMM_Common_Btn_Symbol* m_Btn_ChattingPopup; // 0x308
	UMM_Hud_Chat* m_Hud_MiniChat; // 0x310
	UMirCanvasPanel* m_Position_Notice; // 0x318
	UMirTextBlock* m_Txt_Notice; // 0x320
	TArray<UMM_Occupation_CommandSlot*> m_CommandList; // 0x328
	UMirCheckBox* m_Check_MapNotice; // 0x338
	UCanvasPanel* Panel_Command_Drag; // 0x340
	UImage* m_Img_Drag; // 0x348
	int32_t m_TouchIndex; // 0x350
};

struct UMM_Ranking_Reward_Popup_New {
	UMirButton* m_pBtnCloseBG; // 0x2f0
	UMM_Common_Btn_Symbol* m_pBtnClose; // 0x2f8
	UMirScrollBox* m_pScrollList; // 0x300
};

struct UMM_UIAction_UIShop {
	AMM_GachaManagerActor* m_pGachaManager; // 0x68
};

struct UPlayMovieWidget {
	UMediaPlayer* m_MediaPlayer; // 0x2e0
	UMediaSource* m_MediaSource; // 0x2e8
	UCanvasPanel* m_pSkipBtnPanel; // 0x300
	UButton* m_pSkipButton; // 0x308
	UMirTextBlock* m_pMovieSubtitleText; // 0x310
	UMovieSubtitleData* m_pSubtitleData; // 0x318
	float m_fSkipDelayTime; // 0x324
};

struct AWaypointArea {
	int32_t m_UniqueID; // 0x218
	int32_t m_ActiveRadius; // 0x21c
	FVector m_WarpCoordinate; // 0x220
	bool m_bDefaultState; // 0x22c
	ECostType m_WaypointWarpNeedCostId; // 0x22d
	int32_t m_WaypointWarpNeedCostCount; // 0x230
	int32_t m_WaypointWarpNeedItemId; // 0x234
	int32_t m_WaypointWarpNeedItemCount; // 0x238
	EWaypointType m_WaypointType; // 0x23c
	EWaypointSubType m_WaypointSubType; // 0x240
	bool m_bEnableSubType; // 0x244
	int32_t m_WaypointNameID; // 0x248
	FString m_WayPointName; // 0x250
	int32_t m_InfoValue; // 0x260
	bool m_bNavInside; // 0x264
};

struct UBTTask_MoveTo {
	float AcceptableRadius; // 0x98
	UNavigationQueryFilter* FilterClass; // 0xa0
	float ObservedBlackboardValueTolerance; // 0xa8
	char bObserveBlackboardValue : 1; // 0xac
	char bAllowStrafe : 1; // 0xac
	char bAllowPartialPath : 1; // 0xac
	char bTrackMovingGoal : 1; // 0xac
	char bProjectGoalLocation : 1; // 0xac
	char bReachTestIncludesAgentRadius : 1; // 0xac
	char bReachTestIncludesGoalRadius : 1; // 0xac
	char bStopOnOverlap : 1; // 0xac
	char bStopOnOverlapNeedsUpdate : 1; // 0xad
};

struct UMM_UIAction_XdracoSealing {
	float Time_NextMessage_MakeItem; // 0x178
	int32_t ANIEND_TIME_FAIL; // 0x17c
	int32_t ANIEND_TIME_SUCCESS; // 0x180
	int32_t ANIEND_TIME_GREATESUCCESS; // 0x184
};

struct UMM_ServerRelocationSlot_Global {
	UMirCanvasPanel* m_Canvas_Recommend; // 0x2e0
	UMirTextBlock* m_Txt_Server; // 0x2e8
	UMirRichTextBlock* m_RTxt_Notice; // 0x2f0
	UMirButton* m_Btn_Select; // 0x2f8
};

struct ANavModifierVolume {
	UNavArea* AreaClass; // 0x258
};

struct UAudioCaptureComponent {
	int32_t JitterLatencyFrames; // 0x650
};

struct UQuitMatchCallbackProxy {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UMM_CommonVerticalTabBtn {
	UMirTextBlock* m_Txt_TabName; // 0x2f8
	UMirImage* m_Img_Locked; // 0x300
	UMirImage* m_Img_Indicator; // 0x308
	UMirTextBlock* m_Txt_Indicator; // 0x310
	UMirImage* m_Img_Selected; // 0x318
	UMirButton* m_Btn_Main; // 0x320
	UPanelWidget* m_Grid_Effect_1; // 0x328
	UPanelWidget* m_Grid_Effect_2; // 0x330
	int32_t STR_MSGID_SELECTEDEMPTY; // 0x338
};

struct UScaleBoxSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UCloudStorageBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct UMM_Dominion_Castle_Guild {
	UMM_GuildIcon* m_pIconGuild; // 0x308
	UMirTextBlock* m_pTxtGuildName; // 0x310
	UMirTextBlock* m_pTxtGuildMasterName; // 0x318
	UMM_Common_Btn_Symbol* m_pBtnGuildInfo; // 0x320
	UHorizontalBox* m_pWidgetOccupyDur; // 0x328
	UMirTextBlock* m_pTxtOccupyDur; // 0x330
	UMM_Common_ToolTipBtn* m_pCommToolTip; // 0x338
	UMM_Common_Btn* m_pBtnStorage; // 0x340
	UMirTextBlock* m_pTxtStorage; // 0x348
	UMM_Dominion_Goods_Slot* m_pGoodsSlot0; // 0x350
	UMM_Dominion_Goods_Slot* m_pGoodsSlot1; // 0x358
	UMM_Dominion_Goods_Slot* m_pGoodsSlot2; // 0x360
	UMM_Dominion_Goods_Slot* m_pGoodsSlot3; // 0x368
};

struct UMM_Popup_ClosedTraining_CollectResult {
	FLinearColor m_SuccessColor; // 0x2e0
	FLinearColor m_PaneltyColor; // 0x2f0
	UMirCanvasPanel* m_Panel_Success; // 0x300
	UMirCanvasPanel* m_Panel_Penalty; // 0x308
	UMirButton* m_Btn_Close; // 0x310
	UMirTextBlock* m_Txt_Name; // 0x318
	UMirRichTextBlock* m_Txt_Desc; // 0x320
	UMirTextBlock* m_Txt_Notice; // 0x328
	UVerticalBox* m_VBox; // 0x330
	UWidgetAnimation* m_Ani_Success; // 0x338
	UWidgetAnimation* m_Ani_Panelty; // 0x340
};

struct UMM_ProfileImageEditor {
	UTexture2D* m_pPhotoTexture; // 0x2e0
	UMM_Popup_Profile* m_pParentProfile; // 0x2e8
	UMM_Common_Btn* m_BtnOk; // 0x2f0
};

struct UBTDecorator_TimeLimit {
	float TimeLimit; // 0x68
};

struct UMM_Hud_SubMenu {
	TMap<ESubMenuType, int32_t> m_mapSubMenuSlotTypeInfo; // 0x2f0
	UMM_Hud_SubMenuSlot* m_arrSubMenuSlotList[0x2]; // 0x340
};

struct UPlatformMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UMM_HudPartyManage {
	int32_t BTN_PartyCreateStringID; // 0x2e0
	int32_t BTN_IconTID; // 0x2e4
	UImage* m_ImgIcon; // 0x2e8
	UTextBlock* m_TxtMain; // 0x2f0
	UButton* m_BtnMain; // 0x2f8
};

struct UBillboardComponent {
	UTexture2D* Sprite; // 0x418
	char bIsScreenSizeScaled : 1; // 0x420
	float ScreenSize; // 0x424
	float U; // 0x428
	float UL; // 0x42c
	float V; // 0x430
	float VL; // 0x434
};

struct UMotionControllerComponent {
	int32_t PlayerIndex; // 0x418
	EControllerHand Hand; // 0x41c
	FName MotionSource; // 0x420
	char bDisableLowLatencyUpdate : 1; // 0x428
	ETrackingStatus CurrentTrackingStatus; // 0x42c
	bool bDisplayDeviceModel; // 0x42d
	FName DisplayModelSource; // 0x430
	UStaticMesh* CustomDisplayMesh; // 0x438
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x440
	UPrimitiveComponent* DisplayComponent; // 0x4b0
};

struct USteamNetConnection {
	bool bIsPassthrough; // 0x1a20
};

struct UMovieSceneEnumTrack {
	UEnum* Enum; // 0x88
};

struct ACameraBlockingVolume {
	EBrushType BrushType; // 0x218
	FColor BrushColor; // 0x21c
	int32_t PolyFlags; // 0x220
	char bColored : 1; // 0x224
	char bSolidWhenSelected : 1; // 0x224
	char bPlaceableFromClassBrowser : 1; // 0x224
	char bNotForClientOrServer : 1; // 0x224
	UModel* Brush; // 0x228
	UBrushComponent* BrushComponent; // 0x230
	char bInManipulation : 1; // 0x238
	TArray<FGeomSelection> SavedSelections; // 0x240
};

struct UInterpTrackInstParticleReplay {
	float LastUpdatePosition; // 0x28
};

struct UMM_Auction_Slot_Sell {
	UMM_Slot_Inventory* m_pSlotItem; // 0x370
	UMirTextBlock* m_pTxtName; // 0x378
	UMirTextBlock* m_pTxtPrice; // 0x380
	UMirRichTextBlock* m_pTxtRemainTime; // 0x388
	UMM_Common_Btn* m_pBtnCancle; // 0x390
};

struct UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UNativeWidgetHost {
	UPanelSlot* Slot; // 0x28
	DelegateProperty bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	DelegateProperty ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	DelegateProperty ToolTipWidgetDelegate; // 0x70
	DelegateProperty VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	EMouseCursor Cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct UMM_UnsealingAccelerationSlot {
	UMM_Slot_Inventory* m_Slot_Item; // 0x300
	UMirTextBlock* m_Txt_ItemName; // 0x308
	UMirTextBlock* m_Txt_ItemExplain; // 0x310
	UMirTextBlock* m_Txt_HaveCount; // 0x318
	UMM_Common_Btn_Cost* m_CB_UseCash; // 0x320
	UMM_Common_Btn* m_CB_UseItemAll; // 0x328
	UMM_Common_Btn* m_CB_UseItem; // 0x330
};

struct UMaterialExpressionTangent {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UShapeComponent {
	UBodySetup* ShapeBodySetup; // 0x418
	UNavAreaBase* AreaClass; // 0x420
	FColor ShapeColor; // 0x428
	char bDrawOnlyIfSelected : 1; // 0x42c
	char bShouldCollideWhenPlacing : 1; // 0x42c
	char bDynamicObstacle : 1; // 0x42c
};

struct ULegacyLevelSequenceDirectorBlueprint {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UMirWrapScrollBox {
	int32_t m_iSlotCountPerLine; // 0x880
	FMargin m_vSlotPadding; // 0x884
	EStyle_MirWrapScrollBox m_eStyle; // 0x894
	UUserWidget* m_pParentWidget; // 0x8a8
	TArray<UWidget*> m_arSlot; // 0x8b0
	TArray<UPanelWidget*> m_arPanel; // 0x8c0
};

struct UMM_NewInventory_Equipment {
	UMM_NewInventoryTab* m_InvenTab; // 0x2e8
	UMM_NewInventory* m_Inven; // 0x2f0
	UMM_NewInventory_EquipmentAction* m_InvenEquipAction; // 0x2f8
};

struct UDistributionVectorParameterBase {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UMM_B_NameTag {
	UCanvasPanel* m_Can_GuildMark; // 0x2e0
	UImage* m_Img_GuildSymbol; // 0x2e8
	UImage* m_Img_GuildFrame; // 0x2f0
	UPanelWidget* m_Grd_Title; // 0x2f8
	UTextBlock* m_Txt_Title; // 0x300
	UTextBlock* m_Txt_GuildName; // 0x308
	UTextBlock* m_Txt_Name; // 0x310
	UPanelWidget* m_Grd_HP; // 0x318
	UProgressBar* m_Prg_HP; // 0x320
	UCanvasPanel* m_Can_SubIcon; // 0x328
	UImage* m_Img_SubIcon; // 0x330
	UImage* m_Img_BgSubIcon; // 0x338
	UImage* m_SpeechBalloonLoc; // 0x340
	USpacer* m_NameTextSpacer_GuildMark; // 0x348
	USpacer* m_NameTextSpacer_ClassIcon; // 0x350
	UMM_RevivalTag_Btn* m_RevivalTag_Btn; // 0x358
	UMM_RefuseRebirthGauge* m_RefuseRebirthGauge; // 0x360
	UMirCanvasPanel* m_canSharedTargetIcon; // 0x368
	UMirCanvasPanel* m_CanGuildCommandMark; // 0x370
	UMirImage* m_ImgGuildCommandMark; // 0x378
};

struct UTextureCube {
	FGuid LightingGuid; // 0x48
	int32_t LODBias; // 0x58
	TextureCompressionSettings CompressionSettings; // 0x5c
	TextureFilter Filter; // 0x5d
	ETextureMipLoadOptions MipLoadOptions; // 0x5e
	TextureGroup LODGroup; // 0x5f
	char SRGB : 1; // 0x60
	char bNoTiling : 1; // 0x60
	char VirtualTextureStreaming : 1; // 0x60
	char CompressionYCoCg : 1; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x68
};

struct UMM_PopUp_BuildingList {
	int32_t m_MoveStr; // 0x2e0
	int32_t m_CompleteStr; // 0x2e4
	int32_t m_levelStr; // 0x2e8
	int32_t m_CombatStr; // 0x2ec
	int32_t m_ExpStr; // 0x2f0
	int32_t m_PerValueStrID; // 0x2f4
	int32_t m_CollectPlant; // 0x2f8
	int32_t m_CollectMine; // 0x2fc
	int32_t m_BlackIron; // 0x300
	int32_t m_CollectForce; // 0x304
	int32_t m_HaveNoGuildStr; // 0x308
	UMirImage* m_Img_Thumnail; // 0x310
	UMirImage* m_Img_Thumnail2; // 0x318
	UMirImage* m_Img_Icon; // 0x320
	UScaleBox* m_Scale_Box; // 0x328
	UMirTextBlock* m_Txt_Condition; // 0x330
	UMirTextBlock* m_Txt_ConditionValue; // 0x338
	UPanelWidget* m_Panel_Complete; // 0x340
	UMirButton* m_Btn_Check; // 0x348
	UMM_Common_Btn* m_Btn_Move; // 0x350
};

struct UMM_Popup_Party_Slot_Option_Item {
	ESlotClassOption SlotOption; // 0x2e0
	int32_t STRING_ID_EXPLAIN_ALL; // 0x2e4
	int32_t STRING_ID_EXPLAIN_LOCK; // 0x2e8
	TArray<int32_t> arSTRING_ID_CLASS_NAME; // 0x2f0
	TArray<int32_t> arSTRING_ID_CLASS_EXPLAN; // 0x300
	UVerticalBox* m_VrtBox_All; // 0x310
	UVerticalBox* m_VrtBox_Class; // 0x318
	UVerticalBox* m_VrtBox_Lock; // 0x320
	UMirImage* m_Img_Class; // 0x328
	UMirTextBlock* m_Txt_ClassName; // 0x330
	UMirTextBlock* m_Txt_Explain; // 0x338
	UMirButton* m_Btn_Main; // 0x340
};

struct UMM_PopupGuildCostExchange {
	UMM_Common_Btn_Symbol* btn_close; // 0x2f0
	UMM_Common_Btn* btn_confirm; // 0x2f8
	UMM_Common_Btn* Btn_Cancel; // 0x300
	UMirTextBlock* txt_send; // 0x308
	UMirTextBlock* txt_recv; // 0x310
	UMirImage* img_send; // 0x318
	UMirImage* img_recv; // 0x320
	UMirImage* img_possession; // 0x328
	UMirTextBlock* txt_possession_value; // 0x330
	UMM_Item_Make_Slider* item_make_slider; // 0x338
	TArray<UMM_Popup_GuildDonationSelectSlot*> lst_slot; // 0x340
};

struct UMaterialFunctionInterface {
	FGuid StateID; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UMM_Map_Dest {
	float m_fRaderScale; // 0x2e0
	UWidgetAnimation* m_AniActive; // 0x2e8
	USpacer* m_SpcMain; // 0x2f8
	UImage* m_ImgDest_1; // 0x300
	UImage* m_ImgDest_2; // 0x308
};

struct UMM_Customizing_Save {
	UMirScrollBox* m_SaveSlotList; // 0x2f0
	UMM_Common_Btn_Symbol* m_SaveButton; // 0x2f8
	UMM_Common_Btn* m_OkButton; // 0x300
	UMirCheckBox* m_AutoCheckBox; // 0x308
	UWidget* m_EmptyNotice; // 0x310
	TArray<UMM_Customizing_SaveSlot*> m_SaveSlotArray; // 0x318
};

struct UMM_Popup_Revival_Select {
	UMM_Occupation_Minimap* OccupationMinimap; // 0x2f0
	UMirListView* m_ListView_RevivalSelectList; // 0x2f8
	UMM_Common_Btn* Btn_Revival; // 0x300
	UMM_Common_Btn_Symbol* btn_close; // 0x308
	TArray<URevivalSelectSlotObj*> m_arRevivalSelectSlotObj; // 0x318
};

struct UOnlineSubsystemExtendedGoogleWidget {
	UOnlineSubsystemExtendedGoogleWebBrowser* WebBrowser; // 0x240
	UButton* m_Btn_Close; // 0x268
};

struct ULevelSequenceDirector {
	ULevelSequencePlayer* Player; // 0x28
};

struct USpacer {
	FVector2D Size; // 0x108
};

struct UMM_Customizing_PaletteThumbnail {
	UMirTextBlock* m_Txt_Title; // 0x2e0
};

struct UEdGraphNode {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UMM_Hud_Chat_DottedLine {
	UMirRichTextBlock* RTxt_DottedLine; // 0x2f0
};

struct UMM_Occupation_Observer_KillLog {
	UPanelWidget* m_PanelMain; // 0x2f0
	TArray<UMM_Occupation_Observer_KillLog_Slot*> KillLogList; // 0x2f8
	bool m_InitAsyncLoad; // 0x308
	float m_AddMessageLatency; // 0x30c
	KillLogCampType CampType; // 0x310
};

struct UNamedSlot {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UGameplayTagsManager {
	TArray<FGameplayTagSource> TagSources; // 0xc0
	TArray<UDataTable*> GameplayTagTables; // 0x1b0
};

struct UMM_MagicStone_AttributeSlot {
	UMirImage* Img_Icon; // 0x2f0
	UMirTextBlock* Txt_OptionName; // 0x2f8
	UMirTextBlock* Txt_OptionValue; // 0x300
};

struct UMM_Hud_BackSkill {
	UMirImage* m_pSkillIcon; // 0x2e0
	UPanelWidget* m_pMainPanel; // 0x2e8
	UWidgetAnimation* m_pAniSkillOn; // 0x2f0
};

struct UHorizontalBox {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UCameraShake {
	char bSingleInstance : 1; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	FROscillator RotOscillation; // 0x38
	FVOscillator LocOscillation; // 0x5c
	FFOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	UCameraAnim* Anim; // 0xa0
	char bRandomAnimSegment : 1; // 0xa8
	APlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	UCameraAnimInst* AnimInst; // 0x150
};

struct UMM_Popup_Invite_Alarm {
	UMirTextBlock* m_Txt_Alarm_Count; // 0x2e0
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x2e8
	UMM_Invite_Alarm_Slot* m_Slot_Invite_Alarm; // 0x2f0
	UMM_Common_Btn* m_CB_Accept; // 0x2f8
	UMM_Common_Btn* m_CB_Refuse; // 0x300
};

struct UGraphNodeContextMenuContext {
	UBlueprint* Blueprint; // 0x28
	UEdGraph* Graph; // 0x30
	UEdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48
};

struct UDynamicEntryBox {
	UUserWidget* EntryWidgetClass; // 0x1c8
};

struct UMM_Map_Channel {
	UMirTextBlock* m_Txt_ChangeChannel; // 0x2f0
	UMM_Common_Btn_Symbol* m_CB_Close; // 0x2f8
	UMirImage* m_Img_PartyIcon; // 0x300
	UMirTextBlock* m_Txt_PartyChannelInfo; // 0x308
	UMirButton* m_Btn_Main; // 0x310
	UMirListView* m_ListView_ChannelList; // 0x318
	TArray<UChannelSlotObj*> m_arChannelSlotObj; // 0x320
};

struct UInAppPurchaseData {
	FIAPProductData m_IAPProductData; // 0x28
};

struct ULightmassPrimitiveSettingsObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x28
};

struct UMM_Dominion_Title_Info {
	UWidgetBase* m_pParentWidget; // 0x260
	TArray<TWeakObjectPtr<UWidgetBase>> m_arChildWidget; // 0x268
	TArray<TWeakObjectPtr<UMirTextBlock>> m_arMirTextBlock; // 0x280
	TArray<TWeakObjectPtr<UMirRichTextBlock>> m_arMirRichTextBlock; // 0x290
	TArray<TWeakObjectPtr<UMirEditableText>> m_arMirEditableText; // 0x2a0
	TArray<TWeakObjectPtr<UMirImage>> m_arMirImage; // 0x2b0
};

struct UMM_Popup_BattlePsss_BuyInfo {
	int32_t STRING_ID_MESSAGE; // 0x2e0
	UMirImage* m_Img_Banner; // 0x2e8
	UMirImage* m_Img_LevelLimit; // 0x2f0
	UMirRichTextBlock* m_RTxt_Message; // 0x2f8
	UMirTextBlock* m_Txt_Title; // 0x300
	UMirTextBlock* m_Txt_LevelLimit; // 0x308
	UMM_Common_Btn_Symbol* m_C_Btn_Close; // 0x310
	UMM_Common_Btn* m_C_Btn_Cancel; // 0x318
	UMM_Common_Btn* m_C_Btn_Buy; // 0x320
};

struct APlayerCutsceneActor {
	UStaticMeshComponent* m_pWeaponMeshComponent01; // 0x300
	UStaticMeshComponent* m_pWeaponMeshComponent02; // 0x308
};

struct UParticleModuleTrailSource {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UAimOffsetBlendSpace1D {
	bool bScaleAnimation; // 0x148
};

struct UPaperTileLayer {
	FText LayerName; // 0x28
	int32_t LayerWidth; // 0x40
	int32_t LayerHeight; // 0x44
	char bHiddenInGame : 1; // 0x48
	char bLayerCollides : 1; // 0x48
	char bOverrideCollisionThickness : 1; // 0x48
	char bOverrideCollisionOffset : 1; // 0x48
	float CollisionThicknessOverride; // 0x4c
	float CollisionOffsetOverride; // 0x50
	FLinearColor LayerColor; // 0x54
	int32_t AllocatedWidth; // 0x64
	int32_t AllocatedHeight; // 0x68
	TArray<FPaperTileInfo> AllocatedCells; // 0x70
	UPaperTileSet* TileSet; // 0x80
	TArray<int32_t> AllocatedGrid; // 0x88
};

struct UNavLinkComponent {
	TArray<FNavigationLink> Links; // 0x420
};

struct UMM_PopUp_ItemInfo_Costume {
	UCanvasPanel* m_Grid_Item_Info; // 0x300
	UMM_Costume_Slot_InvenItem* Slot_Main; // 0x308
	UMirTextBlock* Txt_Name; // 0x310
	UMirTextBlock* txt_date; // 0x318
	UMirButton* Btn_Main; // 0x320
	UMM_Common_Btn_Symbol* btn_close; // 0x328
	TArray<UPanelWidget*> Panel_Ability; // 0x330
	TArray<UMirImage*> Img_Ability; // 0x340
	TArray<UMirTextBlock*> Txt_Ability_Name; // 0x350
	TArray<UMirTextBlock*> Txt_Ability_Value; // 0x360
	UMirImage* Img_Icon_Cost; // 0x370
	UMirTextBlock* Txt_Name_CostValue; // 0x378
	COSTUME_PARTS m_CostumeParts; // 0x380
	int32_t m_CostumeId; // 0x384
};

struct UMM_LoginManager {
	UGoogleLoginSubSystem* m_GoogleLoginSubSystem; // 0x1c8
	UAppleLoginSubSystem* m_AppleLoginSubSystem; // 0x1d0
	UFacebookLoginSubSystem* m_FacebookLoginSubSystem; // 0x1d8
