// Created by BlueFire1337
// Updated 2022-01-28
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0xc012540;
	constexpr auto GObjects = 0xc02ab38;
	constexpr auto GWorld = 0xc142828;
}

struct UMOCheckBoxEntry : UMOOptionsEntry {
	UMOCheckBox* pMOCheckBox; // 0x318
};

struct UMOTaskAcceptPanel : UMOTaskPanel {
	UMOButton* pMOButton; // 0x2d0
	UMOTaskItemListEntry* pSelectedEntry; // 0x2d8
	UMOScrollBox* pMOScrollBox_TaskEntries; // 0x2e0
	UTextBlock* pTextBlock_TaskDescription; // 0x2e8
};

struct UMaterialExpressionDesaturation : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Fraction; // 0x54
	FLinearColor LuminanceFactors; // 0x68
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	FEnvTraceData ProjectionData; // 0x50
};

struct UMODataAssetAudioVisualParameter : UPrimaryDataAsset {
	EVisualMaterialType Type; // 0x30
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x88
	char bNRScaleEmitterTime : 1; // 0xb8
	FRawDistributionVector NoiseSpeed; // 0xc0
	char bSmooth : 1; // 0x108
	float NoiseLockRadius; // 0x10c
	char bNoiseLock : 1; // 0x110
	char bOscillate : 1; // 0x110
	float NoiseLockTime; // 0x114
	float NoiseTension; // 0x118
	char bUseNoiseTangents : 1; // 0x11c
	FRawDistributionFloat NoiseTangentStrength; // 0x120
	int32_t NoiseTessellation; // 0x150
	char bTargetNoise : 1; // 0x154
	float FrequencyDistance; // 0x158
	char bApplyNoiseScale : 1; // 0x15c
	FRawDistributionFloat NoiseScale; // 0x160
};

struct UWB_MOCharCreationInfoEntry_C : UMOCharCreationInfoEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	UWidgetAnimation* UpdateValue; // 0x330
	UHorizontalBox* HorizontalBox_6; // 0x338
};

struct UPlayMontageCallbackProxy : UObject {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct UMaterialExpressionInverseLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UMOCharCreationPanel : UMOUserWidget {
	UMOCharacterCreationNew* pCharCreation; // 0x2c8
};

struct AMOEquipmentActorBow : AMOEquipmentActor {
	USkeletalMeshComponent* BowComponent; // 0x288
	UChildActorComponent* ArrowChildActorComponent; // 0x290
	FMOEquipmentActorBowData BowData; // 0x298
	FMOEquipmentActorArrowData arrowData; // 0x2c0
	UMaterialInstanceDynamic* BaseMID; // 0x2f0
	UMaterialInstanceDynamic* CompositeMID; // 0x2f8
};

struct UCurveLinearColor : UCurveBase {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct UInAppPurchaseComponent : UActorComponent {
	FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb0
	FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc0
	FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd0
	FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe0
	FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf0
	FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x100
	FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x110
};

struct USoundNodeConcatenator : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct UMODataAssetEmoteDefinitions : UPrimaryDataAsset {
	TArray<UMODataAssetEmoteBaseDefinition*> pDefinitions; // 0x30
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x340
	float SourceHeight; // 0x344
	float BarnDoorAngle; // 0x348
	float BarnDoorLength; // 0x34c
	UTexture* SourceTexture; // 0x350
};

struct UNiagaraComponent : UFXSystemComponent {
	UNiagaraSystem* Asset; // 0x440
	ENiagaraTickBehavior TickBehavior; // 0x448
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x450
	char bForceSolo : 1; // 0x518
	char bEnableGpuComputeDebug : 1; // 0x518
	char bAutoDestroy : 1; // 0x544
	char bRenderingEnabled : 1; // 0x544
	char bAutoManageAttachment : 1; // 0x544
	char bAutoAttachWeldSimulatedBodies : 1; // 0x544
	float MaxTimeBeforeForceUpdateTransform; // 0x548
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x550
	FMulticastInlineDelegate OnSystemFinished; // 0x568
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x578
	FName AutoAttachSocketName; // 0x580
	EAttachmentRule AutoAttachLocationRule; // 0x588
	EAttachmentRule AutoAttachRotationRule; // 0x589
	EAttachmentRule AutoAttachScaleRule; // 0x58a
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USoundNodeParamCrossFade : USoundNodeDistanceCrossFade {
	FName ParamName; // 0x58
};

struct UInputComponent : UActorComponent {
	TArray<FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x120
};

struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct UMOJournalPanel : UMOUserWidget {
	UMOJournal* pJournal; // 0x2c8
};

struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterfaceRWBase {
	FString EmitterName; // 0xd8
};

struct UPropertyBinding : UObject {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x58
};

struct UMaterialExpressionGIReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ULocalizedOverlays : UOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct UMOUserWidgetTabButtonNew : UMOUserWidget {
	int32_t iFontSize; // 0x2c8
	UButton* pButton; // 0x2d0
	UTextBlock* pTextBlock; // 0x2d8
	FText sTooltip; // 0x2e0
	int32_t iTabIndex; // 0x2f8
	FMulticastInlineDelegate TabIndexDelegate; // 0x300
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UUniformGridSlot : UPanelSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int32_t Row; // 0x3c
	int32_t column; // 0x40
};

struct UOnlineSessionClient : UOnlineSession {
	bool bIsFromInvite; // 0x1d8
	bool bHandlingDisconnect; // 0x1d9
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x468
	int32_t MapHeight; // 0x46c
	int32_t TileWidth; // 0x470
	int32_t TileHeight; // 0x474
	UPaperTileSet* DefaultLayerTileSet; // 0x478
	UMaterialInterface* Material; // 0x480
	TArray<UPaperTileLayer*> TileLayers; // 0x488
	FLinearColor TileMapColor; // 0x498
	int32_t UseSingleLayerIndex; // 0x4a8
	bool bUseSingleLayer; // 0x4ac
	UPaperTileMap* TileMap; // 0x4b0
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UEnvQueryTest_Project : UEnvQueryTest {
	FEnvTraceData ProjectionData; // 0x1f8
};

struct APaperTileMapActor : AActor {
	UPaperTileMapComponent* RenderComponent; // 0x220
};

struct UMOEtherworldSubsystem : UMOWorldSubsystemBase {
	bool bEtherworldIsActive; // 0x40
	bool bDeadAvatarsIsVisibleInWorld; // 0x41
	bool bLivingAvatarsIsVisibleInEther; // 0x42
	FMulticastInlineDelegate OnEtherworldStateChanged; // 0x48
	USoundCue* pSoundCue_AmbientSound; // 0x58
	USoundMix* pSoundMix_Ether; // 0x60
	UNiagaraSystem* pParticleSystem_EtherBodyClient; // 0x68
	UNiagaraSystem* pParticleSystem_Ambient; // 0x70
	UTexture* pEtherworldLUT; // 0x78
	UTexture* pDefaultLUT; // 0x80
	UNiagaraComponent* pNiagaraComponent_BodyClient; // 0x88
	UNiagaraComponent* pNiagaraComponent_Ambient; // 0x90
	UAudioComponent* pAudioComponent; // 0x98
};

struct UDatasmithGLTFSceneImportData : UDatasmithSceneImportData {
	FString Generator; // 0x28
	float Version; // 0x38
	FString Author; // 0x40
	FString License; // 0x50
	FString Source; // 0x60
};

struct UBP_MODragDropOperationItem_C : UMODragDropOperationItem {
	UWB_ButtonItem_C* DragSlotRef; // 0xa8
	UMaterialInstanceDynamic* Material; // 0xb0
	UWB_ItemSlotActionbar_C* ActionSlotRef; // 0xb8
	UWB_ItemSlotContainer_C* ContainerSlotRef; // 0xc0
	UWB_ItemSlotPaperdoll_C* PaperdollSlotRef; // 0xc8
	UObject* CraftingSlotRef; // 0xd0
	FString sItemDataJson; // 0xd8
	bool bIllegal; // 0xe8
	bool bDontAttemptDropItem; // 0xe9
};

struct AMOMagicActor : AActor {
	AMOMagicEffectBall* pMagicBallEffect; // 0x220
	AMOMagicEffectBall* cMagicBallEffectClass; // 0x238
	UMODataAssetMagic* pCurrentDataAsset; // 0x260
};

struct USlateAccessibleWidgetData : UObject {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	FDelegate AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	FDelegate AccessibleSummaryTextDelegate; // 0x70
};

struct UInterpTrack : UObject {
	TArray<UInterpTrack*> SubTracks; // 0x38
	UInterpTrackInst* TrackInstClass; // 0x48
	ETrackActiveCondition ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	char bOnePerGroup : 1; // 0x68
	char bDirGroupOnly : 1; // 0x68
	char bDisableTrack : 1; // 0x68
	char bIsSelected : 1; // 0x68
	char bIsAnimControlTrack : 1; // 0x68
	char bSubTrackOnly : 1; // 0x68
	char bVisible : 1; // 0x68
	char bIsRecording : 1; // 0x68
};

struct UGeometryCollection : UObject {
	TArray<FGeometryCollectionSource> GeometrySource; // 0x30
	TArray<UMaterialInterface*> Materials; // 0x40
	ECollisionTypeEnum CollisionType; // 0x50
	EImplicitTypeEnum ImplicitType; // 0x51
	int32_t MinLevelSetResolution; // 0x54
	int32_t MaxLevelSetResolution; // 0x58
	int32_t MinClusterLevelSetResolution; // 0x5c
	int32_t MaxClusterLevelSetResolution; // 0x60
	float CollisionObjectReductionPercentage; // 0x64
	bool bMassAsDensity; // 0x68
	float Mass; // 0x6c
	float MinimumMassClamp; // 0x70
	float CollisionParticlesFraction; // 0x74
	int32_t MaximumCollisionParticles; // 0x78
	TArray<FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0x80
	bool EnableRemovePiecesOnFracture; // 0x90
	TArray<UMaterialInterface*> RemoveOnFractureMaterials; // 0x98
	FGuid PersistentGuid; // 0xa8
	FGuid StateGuid; // 0xb8
	int32_t BoneSelectedMaterialIndex; // 0xc8
};

struct UMOCraftingBow : UMOCrafting {
	UMOScrollBox* pScrollBox_BowType; // 0x310
	UMOScrollBox* pScrollBox_BowShape; // 0x318
	UMOScrollBox* pScrollBox_BowMaterialSetup; // 0x320
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_BowBaseMaterial; // 0x328
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_BowSecondaryMaterial; // 0x330
	UMOCraftingSliderWidget* pCraftingSlider_Bow; // 0x338
	UMaterialInstance* pPreviewMaterial; // 0x340
	FString sBowMaterialBaseName; // 0x348
	FString sBowMaterialSecondaryName; // 0x358
	FString sBowShapeName; // 0x368
	FString sBowTypeName; // 0x378
	FString sBowMaterialSetup; // 0x388
	TArray<FBowCraftingInfo_BowShape> vCraftingInfo_BowShape; // 0x398
	TArray<FBowCraftingInfo_BowType> vCraftingInfo_BowType; // 0x3a8
};

struct UAB_CH_Player_Male_Human_Head_C : UMOAnimationInstancePlayerHead {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3e0
	FMOAnimNode_CachedFacePose MOAnimGraphNode_CachedFacePose_2; // 0x3e8
	FMOAnimNode_FaceDriver MOAnimGraphNode_FaceDriver_2; // 0x438
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x470
	FMOAnimNode_CachedFacePose MOAnimGraphNode_CachedFacePose; // 0x488
	FMOAnimNode_FaceDriver MOAnimGraphNode_FaceDriver; // 0x4d8
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x510
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x528
	FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_3; // 0x5c8
	FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve; // 0x668
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x6c0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x6e0
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh_2; // 0x7a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x978
	FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode_2; // 0xad0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xb70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xb98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xbc0
	FAnimNode_PoseBlendNode AnimGraphNode_PoseBlendNode; // 0xc80
	FAnimNode_Root AnimGraphNode_Root; // 0xd20
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0xd50
	FMOAnimNode_EyesLookAt MOAnimGraphNode_EyesLookAt; // 0xf28
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1088
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x10a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1148
	FMOAnimNode_LODSwitch MOAnimGraphNode_LODSwitch; // 0x1170
	float Jaw Open; // 0x1210
	float Mask Width Min; // 0x1214
	float Mask Width Max; // 0x1218
	float Mask Length Min; // 0x121c
	float Mask Length Max; // 0x1220
	float Mask Depth Min; // 0x1224
	float Mask Depth Max; // 0x1228
};

struct UGameplayTask_TimeLimitedExecution : UGameplayTask {
	FMulticastInlineDelegate OnFinished; // 0x68
	FMulticastInlineDelegate OnTimeExpired; // 0x78
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USkeleton : UObject {
	TArray<FBoneNode> BoneTree; // 0x38
	TArray<FTransform> RefLocalPoses; // 0x48
	FGuid VirtualBoneGuid; // 0x170
	TArray<FVirtualBone> VirtualBones; // 0x180
	TArray<USkeletalMeshSocket*> Sockets; // 0x190
	FSmartNameContainer SmartNames; // 0x1f0
	TArray<UBlendProfile*> BlendProfiles; // 0x270
	TArray<FAnimSlotGroup> SlotGroups; // 0x280
	TArray<UAssetUserData*> AssetUserData; // 0x358
};

struct UParticleModuleSizeMultiplyLife : UParticleModuleSizeBase {
	FRawDistributionVector LifeMultiplier; // 0x30
	char MultiplyX : 1; // 0x78
	char MultiplyY : 1; // 0x78
	char MultiplyZ : 1; // 0x78
};

struct UMOKeybindEntry : UMOWidgetBlueprint {
	FMulticastInlineDelegate OnMappingUpdatedDelegate; // 0x260
	UTextBlock* pText; // 0x270
	UInputKeySelector* pInputKeySelector; // 0x278
	int32_t structIndex; // 0x280
	float fAxisScale; // 0x284
	FName mappingName; // 0x288
	UMOUserWidgetOptionsKeybinds* pMOOptionsKeybinds; // 0x290
};

struct AMOAiEffectActor : AActor {
	USoundCue* pSoundCue_SpawnTarget; // 0x220
	USoundCue* pSoundCue_SpawnSource; // 0x228
	UNiagaraSystem* pNiagaraSystem_SpawnTarget; // 0x230
	UNiagaraSystem* pNiagaraSystem_SpawnSource; // 0x238
	ACharacter* pActor_Source; // 0x240
	ACharacter* pActor_Target; // 0x248
	FVector vTargetLocation; // 0x250
	UNiagaraComponent* pNiagaraComponent_Target; // 0x260
	UNiagaraComponent* pNiagaraComponent_Source; // 0x268
};

struct UGerstnerWaterWaves : UWaterWaves {
	UGerstnerWaterWaveGeneratorBase* GerstnerWaveGenerator; // 0x28
	TArray<FGerstnerWave> GerstnerWaves; // 0x30
	float MaxWaveHeight; // 0x40
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct UMOPhysicalMaterial : UPhysicalMaterial {
	EAtlasServerHitBoneID eHitBone; // 0x80
	FMOPhysicalMaterialSoundProperties SoundProperties; // 0x88
};

struct UConstantQNRTSettings : UAudioSynesthesiaNRTSettings {
	float StartingFrequency; // 0x28
	int32_t NumBands; // 0x2c
	float NumBandsPerOctave; // 0x30
	float AnalysisPeriod; // 0x34
	bool bDownmixToMono; // 0x38
	EConstantQFFTSizeEnum FFTSize; // 0x39
	EFFTWindowType WindowType; // 0x3a
	EAudioSpectrumType SpectrumType; // 0x3b
	float BandWidthStretch; // 0x3c
	EConstantQNormalizationEnum CQTNormalization; // 0x40
	float NoiseFloorDb; // 0x44
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x220
	bool bAutoUpdateBounds; // 0x228
};

struct ULuminApplicationLifecycleComponent : UApplicationLifecycleComponent {
	FMulticastInlineDelegate DeviceHasReactivatedDelegate; // 0x140
	FMulticastInlineDelegate DeviceWillEnterRealityModeDelegate; // 0x150
	FMulticastInlineDelegate DeviceWillGoInStandbyDelegate; // 0x160
	FMulticastInlineDelegate FocusLostDelegate; // 0x170
	FMulticastInlineDelegate FocusGainedDelegate; // 0x180
};

struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	ENiagaraSystemSpawnSectionStartBehavior SectionStartBehavior; // 0xe8
	ENiagaraSystemSpawnSectionEvaluateBehavior SectionEvaluateBehavior; // 0xec
	ENiagaraSystemSpawnSectionEndBehavior SectionEndBehavior; // 0xf0
	ENiagaraAgeUpdateMode AgeUpdateMode; // 0xf4
};

struct UGeometryCacheCodecRaw : UGeometryCacheCodecBase {
	int32_t DummyProperty; // 0x38
};

struct UNiagaraDataInterfaceFieldSystem : UNiagaraDataInterface {
	UBlueprint* BlueprintSource; // 0x38
	AActor* SourceActor; // 0x40
	FIntVector FieldDimensions; // 0x48
	FVector MinBounds; // 0x54
	FVector MaxBounds; // 0x60
};

struct UMOPetListEntry : UMOWidgetBlueprint {
	UButton* pButton; // 0x270
	UImage* pImageIcon; // 0x278
	UTextBlock* pTextBlockPetName; // 0x280
	UTextBlock* pTextBlockLevel; // 0x288
	int32_t iEntryIndex; // 0x290
};

struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle ButtonStyle; // 0x30
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct UMOMurderCountEntry : UMOWidgetBlueprint {
	UMOCheckBox* pMOCheckBox_Report; // 0x260
	UTextBlock* pTextBlock_Name; // 0x268
};

struct UBP_SaveGame_C : UMOSaveGame {
	FString UserName; // 0x150
	FString Password; // 0x160
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct UMOUserWidgetCompass : UMOUserWidget {
	UMOUserWidgetWaypoint* cWaypointClass; // 0x2c8
	UCanvasPanel* pWaypointCanvas; // 0x2d0
	UMaterialInstanceDynamic* compassMaterial; // 0x2d8
};

struct UNiagaraDataInterfacePlatformSet : UNiagaraDataInterface {
	FNiagaraPlatformSet Platforms; // 0x38
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x30
	USkeleton* TargetSkeleton; // 0x40
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x48
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x58
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xa8
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xb8
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xc8
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xe8
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x108
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x128
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x148
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x168
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x188
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1a8
	TArray<FName> SyncGroupNames; // 0x1f8
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x208
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x218
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x268
};

struct UMODataAssetPetEquipmentDefinitions : UPrimaryDataAsset {
	UMODataAssetEquipmentShared* pSharedData; // 0x30
	UMODataAssetPetEquipment* pHorseEquipmentFallback; // 0x38
	UMODataAssetPetEquipment* pBearEquipmentFallback; // 0x40
	TArray<UMODataAssetPetEquipment*> vHorsePetEquipment; // 0x48
	TArray<UMODataAssetPetEquipment*> vBearPetEquipment; // 0x58
	bool bPetEquipmentIsPreloaded; // 0x68
	TArray<USkeletalMesh*> pLoadedSkeletalMeshes; // 0x70
	TArray<UAnimInstance*> LoadedAnimInstances; // 0x80
	TArray<USoundCue*> LoadedSounds; // 0x90
};

struct UAB_CH_Player_Male_Human_Armor_06_RisarSoldier_Legs_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2e8
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x308
	FAnimNode_Root AnimGraphNode_Root; // 0x4e0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0x510
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x760
	float DummyBoneLength; // 0x9b0
	FKawaiiPhysicsSettings PhysicsSettingsSide; // 0x9b4
};

struct AExponentialHeightFog : AInfo {
	UExponentialHeightFogComponent* Component; // 0x220
	char bEnabled : 1; // 0x228
};

struct UWindowTitleBarAreaSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	TSet<int32_t> OutputShaderStages; // 0x38
	TSet<int32_t> IterationShaderStages; // 0x88
};

struct ULocationServicesImpl : UObject {
	FMulticastInlineDelegate OnLocationChanged; // 0x28
};

struct UMOUserWidget : UUserWidget {
	bool bBypassShouldRightClickOverride; // 0x260
	bool bTryAutoOpenInventory; // 0x261
	bool bDynamicallyModifyZOrder; // 0x262
	bool bAddToWindowTracker; // 0x263
	bool bClosedByEsc; // 0x264
	USoundCue* pOpenSoundCue; // 0x268
	USoundCue* pCloseSoundCue; // 0x270
	FString sSaveIdentifier; // 0x278
};

struct UDestroySessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UWB_MOChatColorSelectionEntry_C : UMOChatColorSelectionEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
};

struct UMaterialExpressionSkyAtmosphereLightDiskLuminance : UMaterialExpression {
	int32_t LightIndex; // 0x40
};

struct USceneCaptureComponentCube : USceneCaptureComponent {
	UTextureRenderTargetCube* TextureTarget; // 0x2b0
	bool bCaptureRotation; // 0x2b8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2c0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2c8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2d0
	float IPD; // 0x2d8
};

struct UFurSplines : UObject {
	TArray<FVector> Vertices; // 0x28
	TArray<int32_t> Index; // 0x38
	TArray<int32_t> Count; // 0x48
	int32_t ControlPointCount; // 0x58
	FString ImportFilename; // 0x60
	int32_t Version; // 0x70
	int32_t ImportTransformation; // 0x74
	float Threshold; // 0x78
};

struct UAnimCompress_PerTrackCompression : UAnimCompress_RemoveLinearKeys {
	float MaxZeroingThreshold; // 0x60
	float MaxPosDiffBitwise; // 0x64
	float MaxAngleDiffBitwise; // 0x68
	float MaxScaleDiffBitwise; // 0x6c
	TArray<AnimationCompressionFormat> AllowedRotationFormats; // 0x70
	TArray<AnimationCompressionFormat> AllowedTranslationFormats; // 0x80
	TArray<AnimationCompressionFormat> AllowedScaleFormats; // 0x90
	char bResampleAnimation : 1; // 0xa0
	float ResampledFramerate; // 0xa4
	int32_t MinKeysForResampling; // 0xa8
	char bUseAdaptiveError : 1; // 0xac
	char bUseOverrideForEndEffectors : 1; // 0xac
	int32_t TrackHeightBias; // 0xb0
	float ParentingDivisor; // 0xb4
	float ParentingDivisorExponent; // 0xb8
	char bUseAdaptiveError2 : 1; // 0xbc
	float RotationErrorSourceRatio; // 0xc0
	float TranslationErrorSourceRatio; // 0xc4
	float ScaleErrorSourceRatio; // 0xc8
	float MaxErrorPerTrackRatio; // 0xcc
	float PerturbationProbeSize; // 0xd0
};

struct UTouchInterface : UObject {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UAREnvironmentProbeComponent : UARComponent {
	FAREnvironmentProbeUpdatePayload ReplicatedPayload; // 0x280
};

struct UEditableGameplayTagQueryExpression_AnyTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ABP_AiEffectElemental_Attack_C : AMOAiEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
};

struct UViewport : UContentWidget {
	FLinearColor BackgroundColor; // 0x120
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UInterpTrackDirector : UInterpTrack {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct UMODataAssetHead : UMODataAssetEquipmentShared {
	UStaticMesh* pStaticMesh; // 0x308
	bool bBluntWeapon; // 0x310
	FText sDisplayName; // 0x318
	UTexture2D* pIcon; // 0x330
	UNiagaraSystem* pBlockParticles; // 0x338
	UNiagaraSystem* pPerfectBlockParticles; // 0x340
	UNiagaraSystem* pEquipHitParticles; // 0x348
	UNiagaraSystem* pGenericHitParticles; // 0x350
	UParticleSystem* pSwingTrail; // 0x358
	USoundCue* pDealDamageSoundGeneric; // 0x360
	USoundCue* pDealDamageSoundSwing; // 0x368
	USoundCue* pDealDamageSoundStab; // 0x370
	USoundCue* pSwingSound; // 0x378
	USoundCue* pBlockSound; // 0x380
	USoundCue* pPerfectBlockSound; // 0x388
	USoundCue* pEquipHitSound; // 0x390
	USoundCue* pEquipSound; // 0x398
	USoundCue* pUnequipSound; // 0x3a0
	USoundCue* pDestroyedSound; // 0x3a8
	USoundCue* pPushSound; // 0x3b0
	USoundCue* pHitDuringCharge; // 0x3b8
	TArray<FSocketEmitterPair> vSocketEmitterPairs; // 0x3c0
	TArray<FSocketSoundPair> vSocketSoundPairs; // 0x3d0
	TArray<FSocketLightPair> vSocketLightPairs; // 0x3e0
};

struct UWB_CladeGiftsLearnedGiftsText_C : UMOUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c8
	UTextBlock* LearnedCladeGifts_TextBox; // 0x2d0
	FText CladeGiftName; // 0x2d8
};

struct UStereoLayerShapeEquirect : UStereoLayerShape {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UMOSkinning : UMOUserWidget {
	UMOButtonMedium* pMOButton_Skinning; // 0x2c8
	UTextBlock* pTextBlock_Sign; // 0x2d0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_Resource; // 0x2d8
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression {
	FExpressionInput TextureSize; // 0x40
	float ConstWidth; // 0x54
	float ConstHeight; // 0x58
};

struct UMOSocialFriendsEntry : UMOWidgetBlueprint {
	UMOSocialFriends* pFriends; // 0x278
	FLinearColor vOnlineImageColor; // 0x280
	FLinearColor vOnlineTextColor; // 0x290
	FLinearColor vOfflineColor; // 0x2a0
	int32_t iEntryState; // 0x2b0
	bool bOnline; // 0x2b4
	UTextBlock* pName; // 0x2b8
	UTextBlock* pTextBlockEntryInfo; // 0x2c0
	UTextBlock* pTextBlock_AcceptFriend; // 0x2c8
	UMOButtonMedium* pMOButton_AcceptFriend; // 0x2d0
	UMOButtonSmall* pRemoveFriend; // 0x2d8
	UImage* pOnlineImage; // 0x2e0
};

struct UMaterialExpressionClearCoatNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct UMatineeCameraShake : UCameraShakeBase {
	float OscillationDuration; // 0x98
	float OscillationBlendInTime; // 0x9c
	float OscillationBlendOutTime; // 0xa0
	FROscillator RotOscillation; // 0xa4
	FVOscillator LocOscillation; // 0xc8
	FFOscillator FOVOscillation; // 0xec
	float AnimPlayRate; // 0xf8
	float AnimScale; // 0xfc
	float AnimBlendInTime; // 0x100
	float AnimBlendOutTime; // 0x104
	float RandomAnimSegmentDuration; // 0x108
	UCameraAnim* Anim; // 0x110
	char bRandomAnimSegment : 1; // 0x118
	float OscillatorTimeRemaining; // 0x11c
	UCameraAnimInst* AnimInst; // 0x120
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct ABP_MOSky_C : AMOSunSky {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230
	UStaticMeshComponent* SunAndMoon; // 0x238
	USceneComponent* DefaultSceneRoot; // 0x240
	TArray<UMaterialInstanceDynamic*> SkyInst; // 0x248
	UCurveLinearColor* Horizon color curve; // 0x258
	UCurveLinearColor* Zenith color curve; // 0x260
	float SkyBrightness; // 0x268
	float SkyContrast; // 0x26c
	float SkySaturation; // 0x270
	float StarsBrightness; // 0x274
	float ExpDensity; // 0x278
	AExponentialHeightFog* ExpFog_Active; // 0x280
	float SkyLightingIntensity; // 0x288
	float SkySunArea; // 0x28c
	float NearDensityMorning; // 0x290
	float NearDensityNight; // 0x294
	float FarDensity; // 0x298
	FLinearColor SkyHorizonColor; // 0x29c
	float HorizonDensity; // 0x2ac
	FLinearColor SkyZenithColor; // 0x2b0
	float ZenithDensity; // 0x2c0
	float SkyLightIntensity; // 0x2c4
	FLinearColor SkyLightColor; // 0x2c8
	float VolumetricScattering; // 0x2d8
	float ExFogDensity; // 0x2dc
	float ExFogCutOffDistance; // 0x2e0
	float ExFogHeightFalloff; // 0x2e4
	FLinearColor FogInsColor; // 0x2e8
	float FogMaxOpacity; // 0x2f8
	float ExFogStartDistance; // 0x2fc
	bool VolumetricFogEnable?; // 0x300
	FColor VolumetricFogColor; // 0x304
	FLinearColor DirectionalInsColor; // 0x308
	float DirecitonalInsExp; // 0x318
	float DirecitonalInsSD; // 0x31c
	float AtFogScaling; // 0x320
	FLinearColor VolumetricFogEmissive; // 0x324
	float VolumetricFogDistance; // 0x334
	float VolumetricFogExScale; // 0x338
	float VolumetricFogScatteringDistribution; // 0x33c
	UMaterialInstanceDynamic* CloudShadowInst; // 0x340
	float StarsRotator; // 0x348
	float SolarTime; // 0x34c
	float Latitude; // 0x350
	float Longitude; // 0x354
	float TimeZone; // 0x358
	float NorthOffset; // 0x35c
	float Elevation; // 0x360
	float CorrectedElevation; // 0x364
	float MoonElevationOffset; // 0x368
	float Azimuth; // 0x36c
	bool UseDaylightSavingTime; // 0x370
	int32_t DSTStartMonth; // 0x374
	int32_t DSTStartDay; // 0x378
	int32_t DSTEndMonth; // 0x37c
	int32_t DSTEndDay; // 0x380
	int32_t DSTSwitchHour; // 0x384
	float Sunrise_Sun; // 0x388
	float Day_Sun; // 0x38c
	float Sunset_Sun; // 0x390
	float Night_Sun; // 0x394
	float Sunrise_Sky; // 0x398
	float Day_Sky; // 0x39c
	float Sunset_Sky; // 0x3a0
	float Night_Sky; // 0x3a4
	UCurveFloat* SunIntensity_SunsetCurve; // 0x3a8
	UCurveFloat* SunIntensity_SunriseCurve; // 0x3b0
	UCurveFloat* Sun_Temperature; // 0x3b8
	UCurveLinearColor* Fog_InscatteringColor; // 0x3c0
	UCurveFloat* Fog_Opacity; // 0x3c8
	FS_MO2_Sun MO2Sun; // 0x3d0
	FS_MO2_Clouds MO2Clouds; // 0x410
	FS_MO2_Sky MO2Sky; // 0x548
	TArray<FS_MO2_Moon> MO2Moon; // 0x578
	UObject* MOSunSky; // 0x588
	FS_MO2_Sky Sky_Parameters; // 0x590
	ABP_MODirectionalLight_SunCycle_Refactor_C* MODirectional; // 0x5c0
	UCurveFloat* C_StarsBrightness; // 0x5c8
	FS_MO2_Moon_MaterialParameters MoonParameterList; // 0x5d0
	bool OverrideMoons; // 0x660
	TArray<FVector> DirectionOverride; // 0x668
	bool OverrideDirection; // 0x678
	UMaterialInstance* SkyMaterial; // 0x680
};

struct AStaticMeshCompositionActor : AActor {
	TArray<FStaticMeshCompositionInfo> vMeshCompositionInfos; // 0x220
	bool bMergeMeshesOnConstruction; // 0x230
	EPostMeshMergeAction ePostMergeAction; // 0x231
};

struct AWindDirectionalSource : AInfo {
	UWindDirectionalSourceComponent* Component; // 0x220
};

struct AMOAvatarStaticMesh : AMOAvatar {
	UStaticMeshComponent* pStaticMeshComponent; // 0x2b0
	USoundCue* pUseSoundCue; // 0x2b8
};

struct UMOCharacterDelete : UMOUserWidget {
	FString sCharacterName; // 0x2c8
	UButton* pButtonDelete; // 0x2d8
	UEditableTextBox* pEditableTextBoxDeleteName; // 0x2e0
};

struct UMOSpellbook : UMOUserWidget {
	UUserWidget* cSpellIconWidgetClass; // 0x2c8
	UImage* pImageBackground; // 0x2d0
	UMOSpellbookSpell* pSpellbookSpell; // 0x2d8
	TArray<UTexture2D*> vSpellbookBackgrounds; // 0x2e0
	UMOSpellbookSpellList* pSpellbookSpellListEcumenical; // 0x2f0
	UMOSpellbookSpellList* pSpellbookSpellListSpiritism; // 0x2f8
	int32_t iLastSpellIndex; // 0x300
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
};

struct UAudioImpulseResponse : UObject {
	TArray<float> ImpulseResponse; // 0x28
	int32_t NumChannels; // 0x38
	int32_t SampleRate; // 0x3c
	float NormalizationVolumeDb; // 0x40
	bool bTrueStereo; // 0x44
	TArray<float> IRData; // 0x48
};

struct ULevelSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x68
	FLevelSequenceObjectReferenceMap ObjectReferences; // 0x70
	FLevelSequenceBindingReferences BindingReferences; // 0xc0
	TMap<FString, FLevelSequenceObject> PossessedObjects; // 0x160
	UObject* DirectorClass; // 0x1b0
	TArray<UAssetUserData*> AssetUserData; // 0x1b8
};

struct UBuildPatchManifest : UObject {
	char ManifestFileVersion; // 0x28
	bool bIsFileData; // 0x29
	uint32_t AppID; // 0x2c
	FString AppName; // 0x30
	FString BuildVersion; // 0x40
	FString LaunchExe; // 0x50
	FString LaunchCommand; // 0x60
	TSet<FString> PrereqIds; // 0x70
	FString PrereqName; // 0xc0
	FString PrereqPath; // 0xd0
	FString PrereqArgs; // 0xe0
	TArray<FFileManifestData> FileManifestList; // 0xf0
	TArray<FChunkInfoData> ChunkList; // 0x100
	TArray<FCustomFieldData> CustomFields; // 0x110
};

struct UVariantSet : UObject {
	FText DisplayText; // 0x28
	bool bExpanded; // 0x58
	TArray<UVariant*> Variants; // 0x60
	UTexture2D* Thumbnail; // 0x70
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UMOPassiveStatIncreaseManager : UMOManager {
	AMOPlayerController* pPlayerController; // 0x28
};

struct UExponentialHeightFogComponent : USceneComponent {
	float FogDensity; // 0x1f8
	float FogHeightFalloff; // 0x1fc
	FExponentialHeightFogData SecondFogData; // 0x200
	FLinearColor FogInscatteringColor; // 0x20c
	UTextureCube* InscatteringColorCubemap; // 0x220
	float InscatteringColorCubemapAngle; // 0x228
	FLinearColor InscatteringTextureTint; // 0x22c
	float FullyDirectionalInscatteringColorDistance; // 0x23c
	float NonDirectionalInscatteringColorDistance; // 0x240
	float DirectionalInscatteringExponent; // 0x244
	float DirectionalInscatteringStartDistance; // 0x248
	FLinearColor DirectionalInscatteringColor; // 0x24c
	float FogMaxOpacity; // 0x25c
	float StartDistance; // 0x260
	float FogCutoffDistance; // 0x264
	bool bEnableVolumetricFog; // 0x268
	float VolumetricFogScatteringDistribution; // 0x26c
	FColor VolumetricFogAlbedo; // 0x270
	FLinearColor VolumetricFogEmissive; // 0x274
	float VolumetricFogExtinctionScale; // 0x284
	float VolumetricFogDistance; // 0x288
	float VolumetricFogStaticLightingScatteringIntensity; // 0x28c
	bool bOverrideLightColorsWithFogInscatteringColors; // 0x290
};

struct UMOSkillsTreeList : UMOWidgetBlueprint {
	UMOButtonLarge* pMOButton_AutoOptimize; // 0x260
	UMOWidgetBlueprint* cSkillsTreeListEntryClass; // 0x268
	UMOScrollBox* pScrollBox; // 0x270
	UTextBlock* pNumberOfSkills; // 0x278
	UTextBlock* pMaximumNumberOfSkills; // 0x280
	UTextBlock* pSkillsOverflowed; // 0x288
	UMOSkillsTree* pSkillsTreeParent; // 0x290
	TArray<UMOSkillsTreeListEntry*> vTreeListEntries; // 0x298
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct UMOUserWidgetOptionsKeybinds : UMOUserWidgetOptionsPanel {
	TArray<UScrollBox*> vScrollBoxes; // 0x2d0
	FMOKeybindCategoriesStruct CategoriesStruct; // 0x2e0
	TArray<FMOKeybindSelectStruct> vDefaultKeybindings; // 0x300
	TArray<UMOWidgetBlueprint*> vMOWidgetBPEntries; // 0x310
	UMOWidgetBlueprint* cMOKeybindEntryClass; // 0x320
	UMOWidgetBlueprint* cMOCategoryLineClass; // 0x328
	UMOUserWidget* cMOCategoryClass; // 0x330
	UMOUserWidgetTabButton* pTabButton_Actions; // 0x338
	UMOUserWidgetTabButton* pTabButton_Actionbars; // 0x340
	UScrollBox* pScrollBox_Actions; // 0x348
	UScrollBox* pScrollBox_ActionBars; // 0x350
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct UActorChannel : UChannel {
	AActor* Actor; // 0x70
	TArray<UObject*> CreateSubObjects; // 0x160
};

struct UWB_MOCarouselSelectValue_2_C : UMOCarouselSelectValue {
	FPointerToUberGraphFrame UberGraphFrame; // 0x350
	UHorizontalBox* HorizontalBox_340; // 0x358
};

struct UMovieSceneCompiledDataManager : UObject {
	TMap<int32_t, FMovieSceneSequenceHierarchy> Hierarchies; // 0xd8
	TMap<int32_t, FMovieSceneEvaluationTemplate> TrackTemplates; // 0x128
	TMap<int32_t, FMovieSceneEvaluationField> TrackTemplateFields; // 0x178
	TMap<int32_t, FMovieSceneEntityComponentField> EntityComponentFields; // 0x1c8
};

struct UAnimationSharingSetup : UObject {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct ULakeGenerator : UWaterBodyGenerator {
	UStaticMeshComponent* LakeMeshComp; // 0x28
	UBoxComponent* LakeCollisionComp; // 0x30
	ULakeCollisionComponent* LakeCollision; // 0x38
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x220
	UPrimitiveComponent* TranslateY; // 0x228
	UPrimitiveComponent* TranslateZ; // 0x230
	UPrimitiveComponent* TranslateYZ; // 0x238
	UPrimitiveComponent* TranslateXZ; // 0x240
	UPrimitiveComponent* TranslateXY; // 0x248
	UPrimitiveComponent* RotateX; // 0x250
	UPrimitiveComponent* RotateY; // 0x258
	UPrimitiveComponent* RotateZ; // 0x260
	UPrimitiveComponent* UniformScale; // 0x268
	UPrimitiveComponent* AxisScaleX; // 0x270
	UPrimitiveComponent* AxisScaleY; // 0x278
	UPrimitiveComponent* AxisScaleZ; // 0x280
	UPrimitiveComponent* PlaneScaleYZ; // 0x288
	UPrimitiveComponent* PlaneScaleXZ; // 0x290
	UPrimitiveComponent* PlaneScaleXY; // 0x298
};

struct UAnimationDataSourceRegistry : UObject {
	TMap<FName, TWeakObjectPtr<UObject>> DataSources; // 0x28
};

struct UInterpTrackSound : UInterpTrackVectorBase {
	TArray<FSoundTrackKey> Sounds; // 0x90
	char bPlayOnReverse : 1; // 0xa0
	char bContinueSoundOnMatineeEnd : 1; // 0xa0
	char bSuppressSubtitles : 1; // 0xa0
	char bTreatAsDialogue : 1; // 0xa0
	char bAttach : 1; // 0xa0
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UTimeSynchronizationSource : UObject {
	bool bUseForSynchronization; // 0x28
	int32_t FrameOffset; // 0x2c
};

struct UMOEditableCurrencyWidget : UMOUserWidget {
	UMOEditableTextBox* pMOEditableTextBox_Gold; // 0x2d8
	UMOEditableTextBox* pMOEditableTextBox_Silver; // 0x2e0
	UMOEditableTextBox* pMOEditableTextBox_Cuprum; // 0x2e8
};

struct UCameraShakeSourceComponent : USceneComponent {
	ECameraShakeAttenuation Attenuation; // 0x1f8
	float InnerAttenuationRadius; // 0x1fc
	float OuterAttenuationRadius; // 0x200
	UCameraShakeBase* CameraShake; // 0x208
	bool bAutoStart; // 0x210
};

struct UMOTooltipSpell : UUserWidget {
	UOverlay* pOverlay; // 0x260
	UTextBlock* pDisplaynameText; // 0x268
	UTextBlock* pDescriptionText; // 0x270
	UTextBlock* pUseDescriptionText; // 0x278
	UGridPanel* pMyGridPanel; // 0x280
};

struct APhysicsConstraintActor : ARigidBodyBase {
	UPhysicsConstraintComponent* ConstraintComp; // 0x220
	AActor* ConstraintActor1; // 0x228
	AActor* ConstraintActor2; // 0x230
	char bDisableCollision : 1; // 0x238
};

struct UMovieSceneEntitySystemLinker : UObject {
	FMovieSceneEntitySystemGraph SystemGraph; // 0x238
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UWB_CharacterCreation_Head_PresetEntry_Horizontal_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UMOButtonLarge* LoadButton; // 0x268
	UMOButtonLarge* SaveButton; // 0x270
	USizeBox* SizeBox_1; // 0x278
	UMOTextBlock_Base_Small_White_01* TitleBlock; // 0x280
	FMulticastInlineDelegate OnPresetLoad; // 0x288
	FMulticastInlineDelegate OnPresetSave; // 0x298
	int32_t Index; // 0x2a8
};

struct USynthComponentMoto : USynthComponent {
	UMotoSynthPreset* MotoSynthPreset; // 0x6c0
	float RPM; // 0x6c8
};

struct UMovieSceneVectorSection : UMovieSceneSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe8
	int32_t ChannelsUsed; // 0x368
};

struct UMOSimpleIcon : UUserWidget {
	UImage* pIcon; // 0x260
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct UMagicLeapMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x200
	bool ScanWorld; // 0x210
	EMagicLeapMeshType MeshType; // 0x211
	UBoxComponent* BoundingVolume; // 0x218
	EMagicLeapMeshLOD LevelOfDetail; // 0x220
	float PerimeterOfGapsToFill; // 0x224
	bool Planarize; // 0x228
	float DisconnectedSectionArea; // 0x22c
	bool RequestNormals; // 0x230
	bool RequestVertexConfidence; // 0x231
	EMagicLeapMeshVertexColorMode VertexColorMode; // 0x232
	TArray<FColor> BlockVertexColors; // 0x238
	FLinearColor VertexColorFromConfidenceZero; // 0x248
	FLinearColor VertexColorFromConfidenceOne; // 0x258
	bool RemoveOverlappingTriangles; // 0x268
	UMRMeshComponent* MRMesh; // 0x270
	int32_t BricksPerFrame; // 0x278
};

struct UArchVisCharMovementComponent : UCharacterMovementComponent {
	FRotator RotationalAcceleration; // 0xb00
	FRotator RotationalDeceleration; // 0xb0c
	FRotator MaxRotationalVelocity; // 0xb18
	float MinPitch; // 0xb24
	float MaxPitch; // 0xb28
	float WalkingFriction; // 0xb2c
	float WalkingSpeed; // 0xb30
	float WalkingAcceleration; // 0xb34
};

struct UPropertyValue : UObject {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct UBP_MODragDropOperationPetSkill_C : UMODragDropOperationPetSkill {
	UWB_ItemSlotActionbar_C* ActionSlotRef; // 0x98
};

struct UMaterialExpressionThinTranslucentMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput TransmittanceColor; // 0x40
};

struct ULandscapeHeightfieldCollisionComponent : UPrimitiveComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x440
	int32_t SectionBaseX; // 0x450
	int32_t SectionBaseY; // 0x454
	int32_t CollisionSizeQuads; // 0x458
	float CollisionScale; // 0x45c
	int32_t SimpleCollisionSizeQuads; // 0x460
	TArray<char> CollisionQuadFlags; // 0x468
	FGuid HeightfieldGuid; // 0x478
	FBox CachedLocalBox; // 0x488
	LazyObjectProperty RenderComponent; // 0x4a4
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x4d0
};

struct UEditableTextBox : UWidget {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FEditableTextBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x928
	FText HintText; // 0x930
	FDelegate HintTextDelegate; // 0x948
	FSlateFontInfo Font; // 0x958
	FLinearColor ForegroundColor; // 0x9b0
	FLinearColor BackgroundColor; // 0x9c0
	FLinearColor ReadOnlyForegroundColor; // 0x9d0
	bool IsReadOnly; // 0x9e0
	bool IsPassword; // 0x9e1
	float MinimumDesiredWidth; // 0x9e4
	FMargin Padding; // 0x9e8
	bool IsCaretMovedWhenGainFocus; // 0x9f8
	bool SelectAllTextWhenFocused; // 0x9f9
	bool RevertTextOnEscape; // 0x9fa
	bool ClearKeyboardFocusOnCommit; // 0x9fb
	bool SelectAllTextOnCommit; // 0x9fc
	bool AllowContextMenu; // 0x9fd
	EVirtualKeyboardType KeyboardType; // 0x9fe
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9ff
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa00
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa01
	ETextJustify Justification; // 0xa02
	FShapedTextOptions ShapedTextOptions; // 0xa03
	FMulticastInlineDelegate OnTextChanged; // 0xa08
	FMulticastInlineDelegate OnTextCommitted; // 0xa18
};

struct UMOItemSlotPaperdoll : UMOItemSlot {
	FString sEquipSlot; // 0x2b0
};

struct UPhysicsThrusterComponent : USceneComponent {
	float ThrustStrength; // 0x1f8
};

struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
	FRichCurve WCurve; // 0x1f0
};

struct UBTService_BlueprintBase : UBTService {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UMOPetListEntryTamed : UMOPetListEntry {
	UMOUserWidgetProgressBar* pWB_ProgressBar_Experience; // 0x2f0
	UTextBlock* pTextBlockLevelXP; // 0x2f8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_Feed; // 0x300
};

struct UMOPreviewModePlacementHouse : UMOPreviewModePlacement {
	TArray<FString> UpgradeContentIDs; // 0xd0
	TArray<UBoxComponent*> PreviewBoxComponents; // 0xe0
	TArray<TSoftClassPtr<UObject>> ActorTypeIgnoreList; // 0x128
	TArray<TSoftClassPtr<UObject>> MinDistanceFromTypeArray; // 0x138
};

struct USynthSamplePlayer : USynthComponent {
	USoundWave* SoundWave; // 0x6c0
	FMulticastInlineDelegate OnSampleLoaded; // 0x6c8
	FMulticastInlineDelegate OnSamplePlaybackProgress; // 0x6d8
};

struct UMockDataMeshTrackerComponent : USceneComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f8
	bool ScanWorld; // 0x208
	bool RequestNormals; // 0x209
	bool RequestVertexConfidence; // 0x20a
	EMeshTrackerVertexColorMode VertexColorMode; // 0x20b
	TArray<FColor> BlockVertexColors; // 0x210
	FLinearColor VertexColorFromConfidenceZero; // 0x220
	FLinearColor VertexColorFromConfidenceOne; // 0x230
	float UpdateInterval; // 0x240
	UMRMeshComponent* MRMesh; // 0x248
};

struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x280
	float BaseLookUpRate; // 0x284
	UPawnMovementComponent* MovementComponent; // 0x288
	USphereComponent* CollisionComponent; // 0x290
	UStaticMeshComponent* MeshComponent; // 0x298
	char bAddDefaultMovementBindings : 1; // 0x2a0
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x340
	float LightFalloffExponent; // 0x344
	float SourceRadius; // 0x348
	float SoftSourceRadius; // 0x34c
	float SourceLength; // 0x350
};

struct UWB_CategoryLine_C : UMOWidgetBlueprint {
	UImage* Image_Line_Keybinds_2; // 0x260
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct ABP_AiEffectSpit_C : AMOAiEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FVector vHitLocation; // 0x278
};

struct UMODragDropOperationItem : UMODragDropOperation {
	UMOItemSlot* pItemSlot; // 0x88
	FString sItemGuid; // 0x90
	EDragItemFrom EDragItemFrom; // 0xa0
};

struct UEnvQueryTest_Distance : UEnvQueryTest {
	EEnvTestDistance TestMode; // 0x1f8
	UEnvQueryContext* DistanceTo; // 0x200
};

struct UVectorFieldStatic : UVectorField {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
};

struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	UPawnAction* Action; // 0x70
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UParticleModuleVelocityInheritParent : UParticleModuleVelocityBase {
	FRawDistributionVector Scale; // 0x38
};

struct UInterpTrackMoveAxis : UInterpTrackFloatBase {
	EInterpMoveAxis MoveAxis; // 0x90
	FInterpLookupTrack LookupTrack; // 0x98
};

struct UParticleModuleRequired : UParticleModule {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct UNiagaraRibbonRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x80
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x88
	ENiagaraRibbonFacingMode FacingMode; // 0xa8
	FNiagaraRibbonUVSettings UV0Settings; // 0xac
	FNiagaraRibbonUVSettings UV1Settings; // 0xd0
	ENiagaraRibbonDrawDirection DrawDirection; // 0xf4
	float CurveTension; // 0xf8
	ENiagaraRibbonTessellationMode TessellationMode; // 0xfc
	int32_t TessellationFactor; // 0x100
	bool bUseConstantFactor; // 0x104
	float TessellationAngle; // 0x108
	bool bScreenSpaceTessellation; // 0x10c
	FNiagaraVariableAttributeBinding PositionBinding; // 0x110
	FNiagaraVariableAttributeBinding ColorBinding; // 0x168
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x1c0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x218
	FNiagaraVariableAttributeBinding RibbonTwistBinding; // 0x270
	FNiagaraVariableAttributeBinding RibbonWidthBinding; // 0x2c8
	FNiagaraVariableAttributeBinding RibbonFacingBinding; // 0x320
	FNiagaraVariableAttributeBinding RibbonIdBinding; // 0x378
	FNiagaraVariableAttributeBinding RibbonLinkOrderBinding; // 0x3d0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x428
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x480
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x4d8
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x530
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x588
	FNiagaraVariableAttributeBinding U0OverrideBinding; // 0x5e0
	FNiagaraVariableAttributeBinding V0RangeOverrideBinding; // 0x638
	FNiagaraVariableAttributeBinding U1OverrideBinding; // 0x690
	FNiagaraVariableAttributeBinding V1RangeOverrideBinding; // 0x6e8
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2b0
	float FOVAngle; // 0x2b4
	float OrthoWidth; // 0x2b8
	UTextureRenderTarget2D* TextureTarget; // 0x2c0
	ESceneCaptureCompositeMode CompositeMode; // 0x2c8
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x820
	char bOverride_CustomNearClippingPlane : 1; // 0x824
	float CustomNearClippingPlane; // 0x828
	bool bUseCustomProjectionMatrix; // 0x82c
	FMatrix CustomProjectionMatrix; // 0x830
	bool bEnableClipPlane; // 0x870
	FVector ClipPlaneBase; // 0x874
	FVector ClipPlaneNormal; // 0x880
	char bCameraCutThisFrame : 1; // 0x88c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x88c
	bool bDisableFlipCopyGLES; // 0x890
};

struct UEnvQueryOption : UObject {
	UEnvQueryGenerator* Generator; // 0x28
	TArray<UEnvQueryTest*> Tests; // 0x30
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UMOExtraction : UMOUserWidget {
	UMOButtonMedium* pMOButton_Extraction; // 0x2c8
	UTextBlock* pTextBlock_Sign; // 0x2d0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_Resource; // 0x2d8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_Catalyst; // 0x2e0
};

struct UMOWorldTimeSubsystem : UEngineSubsystem {
	float fDebugTimeOfDaySpeed; // 0x50
	float fDebugTimeOfDayOffset; // 0x54
	bool bIgnoreTimeOfDayUpdates; // 0x58
	bool bHasReceivedInitialDayTimeUpdateFromServer; // 0x59
};

struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	TArray<int32_t> SortedInstances; // 0x588
	int32_t NumBuiltInstances; // 0x598
	FBox BuiltInstanceBounds; // 0x5a0
	FBox UnbuiltInstanceBounds; // 0x5bc
	TArray<FBox> UnbuiltInstanceBoundsList; // 0x5d8
	char bEnableDensityScaling : 1; // 0x5e8
	int32_t OcclusionLayerNumNodes; // 0x5f0
	FBoxSphereBounds CacheMeshExtendedBounds; // 0x5f4
	bool bDisableCollision; // 0x610
	int32_t InstanceCountToRender; // 0x614
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UMaterialExpressionLogarithm10 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct ULiveLinkSubjectSettings : UObject {
	TArray<ULiveLinkFramePreProcessor*> PreProcessors; // 0x28
	ULiveLinkFrameInterpolationProcessor* InterpolationProcessor; // 0x38
	TArray<ULiveLinkFrameTranslator*> Translators; // 0x40
	ULiveLinkRole* Role; // 0x50
	FFrameRate FrameRate; // 0x58
	bool bRebroadcastSubject; // 0x60
};

struct UGizmoLocalVec2ParameterSource : UGizmoBaseVec2ParameterSource {
	FVector2D Value; // 0x48
	FGizmoVec2ParameterChange LastChange; // 0x50
};

struct UMOLoginScreen : UMOUserWidget {
	FString sCopyrightInformation; // 0x2c8
	FString sVersionNumber; // 0x2d8
	FString sGameNewsLink; // 0x2e8
	UMOButtonLarge* pMOButton_Options; // 0x2f8
	UMOButtonLarge* pMOButtonLogin; // 0x300
	UMOMessageBox* pMessageBox; // 0x308
	UMOLoginMessageBox* pLoginMessageBox; // 0x310
	UTextBlock* pTextBlockGameNewsHeader; // 0x318
	UTextBlock* pTextBlockGameNewsText; // 0x320
	UTextBlock* pTextBlockGameNewsLink; // 0x328
	UMOBorderHeader* pMOBorderHeader; // 0x330
	UMOButton* pButtonGameNewsLink; // 0x338
	UTextBlock* pCopyrightNotice; // 0x340
	UTextBlock* pVersionNumber; // 0x348
	UMOEULA* pMOEULA; // 0x350
	UBackgroundBlur* pBlur_EULA; // 0x358
};

struct UGerstnerWaterWaveGeneratorSpectrum : UGerstnerWaterWaveGeneratorBase {
	EWaveSpectrumType SpectrumType; // 0x28
	TArray<FGerstnerWaveOctave> Octaves; // 0x30
};

struct UComboBox : UWidget {
	TArray<UObject*> Items; // 0x108
	FDelegate OnGenerateWidgetEvent; // 0x118
	bool bIsFocusable; // 0x128
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct UMediaTimeStampInfo : UObject {
	FTimespan Time; // 0x28
	int64_t SequenceIndex; // 0x30
};

struct ABodyFireEffect_C : AMOEffectActorBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
};

struct UMOCharacterCreationNew : UMOUserWidget {
	UMOCharCreationFaceCustomization* pFaceCustomizationWidgetInstance; // 0x2c8
	UMOCharCreationFaceCustomization* cFaceCustomizationWidget; // 0x2d0
	FMOCharacterPlayerAppearance charAppearance; // 0x2d8
	AMOGameModeMenu* pMOGameModeMenu; // 0x5a0
	UMOUserWidgetTabButtonNew* pPanelTabButton_Species; // 0x5a8
	UMOUserWidgetTabButtonNew* pPanelTabButton_Bloodline; // 0x5b0
	UMOUserWidgetTabButtonNew* pPanelTabButton_Attributes; // 0x5b8
	UMOUserWidgetTabButtonNew* pPanelTabButton_Appearance; // 0x5c0
	UMOUserWidgetTabButtonNew* pPanelTabButton_Finalize; // 0x5c8
	UMOUserWidgetTabManager* pTabManager; // 0x5d0
	TArray<UMOCharCreationPanel*> vPanels; // 0x5d8
	int32_t iCurrentPanel; // 0x5e8
	UMOCharCreationInfoPanel* pPanel_Info; // 0x5f0
	UMOCharCreationSpeciesPanel* pPanel_Species; // 0x5f8
	UMOCharCreationBloodlinePanel* pPanel_Bloodline; // 0x600
	UMOCharCreationAttributesPanel* pPanel_Attributes; // 0x608
	UMOCharCreationAppearancePanel* pPanel_Appearance; // 0x610
	UMOCharCreationFinalizePanel* pPanel_Finalize; // 0x618
	UMOButtonLarge* pMOButton_Next; // 0x620
	UMOButtonLarge* pMOButton_Back; // 0x628
	UMOText* pPanelText; // 0x630
	FTimerHandle m_TimerHandle_UpdateCharacterAppearance; // 0x638
	bool bCanUpdateCharacter; // 0x640
};

struct UInterpTrackFloatAnimBPParam : UInterpTrackFloatBase {
	UObject* AnimBlueprintClass; // 0x90
	UAnimInstance* AnimClass; // 0x98
	FName ParamName; // 0xa0
};

struct UParticleModuleTypeDataAnimTrail : UParticleModuleTypeDataBase {
	char bDeadTrailsOnDeactivate : 1; // 0x30
	char bEnablePreviousTangentRecalculation : 1; // 0x30
	char bTangentRecalculationEveryFrame : 1; // 0x30
	float TilingDistance; // 0x34
	float DistanceTessellationStepSize; // 0x38
	float TangentTessellationStepSize; // 0x3c
	float WidthTessellationStepSize; // 0x40
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x470
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x478
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x480
	TArray<FVertexOffsetUsage> VertexOffsetUsage; // 0x490
	UPhysicsAsset* PhysicsAssetOverride; // 0x598
	int32_t ForcedLodModel; // 0x5a0
	int32_t MinLodModel; // 0x5a4
	float StreamingDistanceMultiplier; // 0x5b0
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x5c0
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x5f4
	char bOverrideMinLod : 1; // 0x5f6
	char bUseBoundsFromMasterPoseComponent : 1; // 0x5f6
	char bForceWireframe : 1; // 0x5f6
	char bDisplayBones : 1; // 0x5f6
	char bDisableMorphTarget : 1; // 0x5f6
	char bHideSkin : 1; // 0x5f7
	char bPerBoneMotionBlur : 1; // 0x5f7
	char bComponentUseFixedSkelBounds : 1; // 0x5f7
	char bConsiderAllBodiesForBounds : 1; // 0x5f7
	char bSyncAttachParentLOD : 1; // 0x5f7
	char bCanHighlightSelectedSections : 1; // 0x5f7
	char bRecentlyRendered : 1; // 0x5f7
	char bCastCapsuleDirectShadow : 1; // 0x5f7
	char bCastCapsuleIndirectShadow : 1; // 0x5f8
	char bCPUSkinning : 1; // 0x5f8
	char bEnableUpdateRateOptimizations : 1; // 0x5f8
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x5f8
	char bRenderStatic : 1; // 0x5f8
	char bIgnoreMasterPoseComponentLOD : 1; // 0x5f8
	char bCachedLocalBoundsUpToDate : 1; // 0x5f9
	char bForceMeshObjectUpdate : 1; // 0x5f9
	float CapsuleIndirectShadowMinVisibility; // 0x5fc
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x610
	FMatrix CachedWorldToLocalTransform; // 0x630
};

struct UChaosClothSharedSimConfig : UClothSharedConfigCommon {
	int32_t IterationCount; // 0x28
	int32_t SubdivisionCount; // 0x2c
	float SelfCollisionThickness; // 0x30
	float CollisionThickness; // 0x34
	bool bUseDampingOverride; // 0x38
	float Damping; // 0x3c
	bool bUseGravityOverride; // 0x40
	float GravityScale; // 0x44
	FVector Gravity; // 0x48
	bool bUseLocalSpaceSimulation; // 0x54
	bool bUseXPBDConstraints; // 0x55
};

struct UObjectReferencer : UObject {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct AMOStaticMeshActorUse : AMOStaticMeshActor {
	USoundCue* pSoundCueUse; // 0x258
	FText sUseText; // 0x260
	float fUseTimer; // 0x278
	float fAtlasUseDistance; // 0x27c
	EObjectUse eUseType; // 0x280
	UStaticMeshComponent* pStaticMeshComp; // 0x288
	FString sStringIdentifier; // 0x290
	TArray<FString> vLearnSkillsOnOpen; // 0x2a0
};

struct ULuminRuntimeSettings : UObject {
	FString PackageName; // 0x28
	FString ApplicationDisplayName; // 0x38
	ELuminFrameTimingHint FrameTimingHint; // 0x48
	bool bProtectedContent; // 0x49
	bool bManualCallToAppReady; // 0x4a
	bool bUseMobileRendering; // 0x4b
	bool bUseVulkan; // 0x4c
	FFilePath Certificate; // 0x50
	FDirectoryPath IconModelPath; // 0x60
	FDirectoryPath IconPortalPath; // 0x70
	FLocalizedIconInfos LocalizedIconInfos; // 0x80
	int32_t VersionCode; // 0x90
	int32_t MinimumAPILevel; // 0x94
	TArray<ELuminPrivilege> AppPrivileges; // 0x98
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8
	FString SpatializationPlugin; // 0xc8
	FString ReverbPlugin; // 0xd8
	FString OcclusionPlugin; // 0xe8
	int32_t SoundCueCookQualityIndex; // 0xf8
	bool bRemoveDebugInfo; // 0xfc
	FDirectoryPath VulkanValidationLayerLibs; // 0x100
	bool bFrameVignette; // 0x110
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118
};

struct ARectLight : ALight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct UMOInventoryButtonItem : UMOUserWidget {
	UMOButtonItem* pButtonItem; // 0x2c8
};

struct UMOItemSlotActionbar : UMOItemSlot {
	int32_t iActionSlotID; // 0x2b0
	int32_t iActionBarID; // 0x2b4
	FString sItemGuid; // 0x2b8
	UMOActionBar* pActionBarParent; // 0x2c8
	UTextBlock* pKeybindingText; // 0x2d0
	UMOButtonSkill* pButtonSkill; // 0x2d8
	UMOButtonSpell* pButtonSpell; // 0x2e0
	UMOButtonPetSkill* pButtonPetSkill; // 0x2e8
};

struct UGameplayTaskResource : UObject {
	int32_t ManualResourceID; // 0x28
	int8_t AutoResourceID; // 0x2c
	char bManuallySetID : 1; // 0x30
};

struct UPlayerInput : UObject {
	TArray<FKeyBind> DebugExecBindings; // 0x120
	TArray<FName> InvertedAxis; // 0x160
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x40
	FGuid ExpressionGUID; // 0x50
};

struct UAISystemBase : UObject {
	FSoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50
};

struct AMagicLeapARPinInfoActorBase : AActor {
	FGuid PinId; // 0x220
	bool bVisibilityOverride; // 0x230
};

struct ABP_AiEffectElemental_Heal_C : ABP_AiEffectElemental_Attack_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
};

struct UWB_ButtonSkillWidget_C : UMOButtonSkillWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
};

struct UMaterialExpressionScalarParameter : UMaterialExpressionParameter {
	float DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x5c
	char PrimitiveDataIndex; // 0x5d
};

struct UNavRelevantComponent : UActorComponent {
	char bAttachToOwnersRoot : 1; // 0xd4
	UObject* CachedNavParent; // 0xd8
};

struct UBillboardComponent : UPrimitiveComponent {
	UTexture2D* Sprite; // 0x440
	char bIsScreenSizeScaled : 1; // 0x448
	float ScreenSize; // 0x44c
	float U; // 0x450
	float UL; // 0x454
	float V; // 0x458
	float VL; // 0x45c
};

struct UMOEquipmentShieldComponent : UMOEquipmentComponent {
	UStaticMeshComponent* pFrameComponent; // 0xf0
	UStaticMeshComponent* pHandleComponent; // 0xf8
	UMODataAssetShield* pDataAssetHandle; // 0x100
	UMODataAssetShieldFrame* pDataAssetFrame; // 0x108
	FMOShieldData sEquipmentData; // 0x110
	UMaterialInstanceDynamic* pHandleMID; // 0x140
	UMaterialInstanceDynamic* pHeadMID; // 0x148
	float fFrameScale; // 0x150
};

struct UAvoidanceManager : UObject {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x9c
	FSubmixEffectDelaySettings DynamicSettings; // 0xa8
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UVectorFieldComponent : UPrimitiveComponent {
	UVectorField* VectorField; // 0x440
	float Intensity; // 0x448
	float Tightness; // 0x44c
	char bPreviewVectorField : 1; // 0x450
};

struct UMovieSceneByteTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct ULeaderboardFlushCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x48
};

struct AAudioVolume : AVolume {
	float Priority; // 0x258
	char bEnabled : 1; // 0x25c
	FReverbSettings Settings; // 0x260
	FInteriorSettings AmbientZoneSettings; // 0x280
	TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings; // 0x2a8
	TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings; // 0x2b8
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct UTimelineTemplate : UObject {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	FName VariableName; // 0x90
	FName DirectionPropertyName; // 0x98
	FName UpdateFunctionName; // 0xa0
	FName FinishedFunctionName; // 0xa8
};

struct UKawaiiPhysicsLimitsDataAsset : UDataAsset {
	TArray<FSphericalLimit> SphericalLimits; // 0x30
	TArray<FCapsuleLimit> CapsuleLimits; // 0x40
	TArray<FPlanarLimit> PlanarLimits; // 0x50
};

struct UMOCharacterMovementComponent : UCharacterMovementComponent {
	float CalcVelocityTickInterval; // 0xb08
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct ANavMeshBoundsVolume : AVolume {
	FNavAgentSelector SupportedAgents; // 0x258
};

struct UOculusSceneCaptureCubemap : UObject {
	TArray<USceneCaptureComponent2D*> CaptureComponents; // 0x38
};

struct UTimecodeProvider : UObject {
	float FrameDelay; // 0x28
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UMOButtonTab : UMOButton {
	USlateWidgetStyleAsset* CustomStyle; // 0x438
};

struct UMOCraftingArmor : UMOCrafting {
	UMOScrollBox* pScrollBox_ArmorSlot; // 0x310
	UMOScrollBox* pScrollBox_ArmorStyle; // 0x318
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_ArmorOutsideMaterial; // 0x320
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_ArmorInsideMaterial; // 0x328
	UMaterialInstance* pPreviewMaterial; // 0x330
	FString sArmorSlotMaterialInsideName; // 0x338
	FString sArmorSlotMaterialOutsideName; // 0x348
	FString sArmorSlotName; // 0x358
	FString sArmorStyleName; // 0x368
	UMOCraftingSliderWidget* pCraftingSlider_Inside; // 0x378
	UMOCraftingSliderWidget* pCraftingSlider_Outside; // 0x380
	TArray<FArmorCraftingInfo_ArmorSlot> vCraftingInfo_ArmorSlot; // 0x398
	TArray<FArmorCraftingInfo_Style> vCraftingInfo_ArmorStyle; // 0x3a8
	TArray<UMOCraftingListEntry*> vCraftingArmorSlotGroups; // 0x3b8
};

struct UNiagaraPrecompileContainer : UObject {
	TArray<UNiagaraScript*> Scripts; // 0x28
	UNiagaraSystem* System; // 0x38
};

struct UParticleModuleBeamTarget : UParticleModuleBeamBase {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x88
	char bLockTarget : 1; // 0x88
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x8c
	FRawDistributionVector TargetTangent; // 0x90
	char bLockTargetTangent : 1; // 0xd8
	FRawDistributionFloat TargetStrength; // 0xe0
	char bLockTargetStength : 1; // 0x110
	float LockRadius; // 0x114
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	char bPersistFade : 1; // 0x90
	char bFadeAudio : 1; // 0x90
	FLinearColor FadeColor; // 0x94
};

struct UAB_CH_Player_Male_Human_Armor_03_Rags_Legs_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0x2d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x520
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x540
	FAnimNode_CopyPoseFromMesh AnimGraphNode_CopyPoseFromMesh; // 0x560
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0x740
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0x990
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0xbe0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0xe30
	FAnimNode_Root AnimGraphNode_Root; // 0x1080
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x10b0
	float DummyBoneLength; // 0x1300
	FKawaiiPhysicsSettings PhysicsSettings; // 0x1304
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UPlanePositionGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoVec2ParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bFlipX; // 0x89
	bool bFlipY; // 0x8a
	bool bInInteraction; // 0x8b
	FVector InteractionOrigin; // 0x8c
	FVector InteractionNormal; // 0x98
	FVector InteractionAxisX; // 0xa4
	FVector InteractionAxisY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	FVector2D InteractionStartParameter; // 0xd4
	FVector2D InteractionCurParameter; // 0xdc
	FVector2D ParameterSigns; // 0xe4
};

struct UIpConnection : UNetConnection {
	float SocketErrorDisconnectDelay; // 0x1b40
};

struct ULandscapeGrassType : UObject {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct ULiveLinkDrivenComponent : UActorComponent {
	FLiveLinkSubjectName SubjectName; // 0xb0
	FName ActorTransformBone; // 0xb8
	bool bModifyActorTransform; // 0xc0
	bool bSetRelativeLocation; // 0xc1
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UDLSSSettings : UObject {
	bool bEnableDLSSD3D12; // 0x28
	bool bEnableDLSSD3D11; // 0x29
	bool bEnableDLSSVulkan; // 0x2a
	bool bEnableDLSSInEditorViewports; // 0x2b
	bool bEnableScreenpercentageManipulationInDLSSEditorViewports; // 0x2c
	bool bEnableDLSSInPlayInEditorViewports; // 0x2d
	bool bShowDLSSSDebugOnScreenMessages; // 0x2e
	FString GenericDLSSBinaryPath; // 0x30
	bool bGenericDLSSBinaryExists; // 0x40
	uint32_t NVIDIANGXApplicationId; // 0x44
	FString CustomDLSSBinaryPath; // 0x48
	bool bCustomDLSSBinaryExists; // 0x58
};

struct UOculusMR_State : UObject {
	FTrackedCamera TrackedCamera; // 0x28
	USceneComponent* TrackingReferenceComponent; // 0xa0
	double ScalingFactor; // 0xa8
	bool ChangeCameraStateRequested; // 0xb4
	bool BindToTrackedCameraIndexRequested; // 0xb5
};

struct UInterpTrackInstEvent : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char bReflectionCaptureCompression : 1; // 0x6c
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6d
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	ECustomDepthStencil CustomDepthStencil; // 0x88
	char bCustomDepthTaaJitter : 1; // 0x8c
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x90
	char bDefaultFeatureBloom : 1; // 0x94
	char bDefaultFeatureAmbientOcclusion : 1; // 0x94
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x94
	char bDefaultFeatureAutoExposure : 1; // 0x94
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x98
	float DefaultFeatureAutoExposureBias; // 0x9c
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa0
	char bUsePreExposure : 1; // 0xa0
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa0
	char bDefaultFeatureMotionBlur : 1; // 0xa0
	char bDefaultFeatureLensFlare : 1; // 0xa0
	char bTemporalUpsampling : 1; // 0xa0
	char bSSGI : 1; // 0xa0
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa4
	ELightUnits DefaultLightUnits; // 0xa5
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xa6
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xa8
	char bStencilForLODDither : 1; // 0xa8
	EEarlyZPass EarlyZPass; // 0xac
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb0
	char bDBuffer : 1; // 0xb0
	EClearSceneOptions ClearSceneMethod; // 0xb4
	char bBasePassOutputsVelocity : 1; // 0xb8
	char bVertexDeformationOutputsVelocity : 1; // 0xb8
	char bSelectiveBasePassOutputs : 1; // 0xb8
	char bDefaultParticleCutouts : 1; // 0xb8
	int32_t GPUSimulationTextureSizeX; // 0xbc
	int32_t GPUSimulationTextureSizeY; // 0xc0
	char bGlobalClipPlane : 1; // 0xc4
	EGBufferFormat GBufferFormat; // 0xc8
	char bUseGPUMorphTargets : 1; // 0xcc
	char bNvidiaAftermathEnabled : 1; // 0xcc
	char bMultiView : 1; // 0xcc
	char bMobilePostProcessing : 1; // 0xcc
	char bMobileMultiView : 1; // 0xcc
	char bMobileUseHWsRGBEncoding : 1; // 0xcc
	char bRoundRobinOcclusion : 1; // 0xcc
	char bODSCapture : 1; // 0xcc
	char bMeshStreaming : 1; // 0xcd
	float WireframeCullThreshold; // 0xd0
	char bEnableRayTracing : 1; // 0xd4
	char bEnableRayTracingTextureLOD : 1; // 0xd4
	char bEnableHybridTranslucency : 1; // 0xd4
	char bSupportStationarySkylight : 1; // 0xd4
	char bSupportLowQualityLightmaps : 1; // 0xd4
	char bSupportPointLightWholeSceneShadows : 1; // 0xd4
	char bSupportAtmosphericFog : 1; // 0xd4
	char bSupportSkyAtmosphere : 1; // 0xd4
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xd5
	char bSupportSkinCacheShaders : 1; // 0xd5
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xd8
	float SkinCacheSceneMemoryLimitInMB; // 0xdc
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe0
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe0
	char bMobileAllowDistanceFieldShadows : 1; // 0xe0
	char bMobileAllowMovableDirectionalLights : 1; // 0xe0
	uint32_t MobileNumDynamicPointLights; // 0xe4
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xe8
	char bMobileAllowMovableSpotlights : 1; // 0xe8
	char bMobileAllowMovableSpotlightShadows : 1; // 0xe8
	char bSupport16BitBoneIndex : 1; // 0xe8
	char bGPUSkinLimit2BoneInfluences : 1; // 0xe8
	char bSupportDepthOnlyIndexBuffers : 1; // 0xe8
	char bSupportReversedIndexBuffers : 1; // 0xe8
	char bLPV : 1; // 0xe8
	char bMobileAmbientOcclusion : 1; // 0xe9
	char bUseUnlimitedBoneInfluences : 1; // 0xe9
	int32_t UnlimitedBonInfluencesThreshold; // 0xec
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf0
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0xf1
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0xf2
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0xf8
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x110
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x128
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bInInteraction; // 0x88
	FVector RotationOrigin; // 0x8c
	FVector RotationAxis; // 0x98
	FVector RotationPlaneX; // 0xa4
	FVector RotationPlaneY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	float InteractionStartAngle; // 0xd4
	float InteractionCurAngle; // 0xd8
};

struct USingleClickInputBehavior : UAnyButtonInputBehavior {
	bool HitTestOnRelease; // 0xc0
};

struct UUniformGridPanel : UPanelWidget {
	FMargin SlotPadding; // 0x120
	float MinDesiredSlotWidth; // 0x130
	float MinDesiredSlotHeight; // 0x134
};

struct UMOHintWidget : UMOUserWidget {
	UTextBlock* pHintBody; // 0x2c8
	UTextBlock* pHintTitle; // 0x2d0
	UMOCheckBox* pCheckBox; // 0x2d8
};

struct UParticleModuleColorScaleOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct UMagicLeapARPinSettings : UObject {
	float UpdateCheckFrequency; // 0x28
	FMagicLeapARPinState OnUpdatedEventTriggerDelta; // 0x2c
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x28
	bool bEnableTerrainSplineEditing; // 0x29
	bool bResizeSpriteDataToMatchTextures; // 0x2a
};

struct UMOButtonPetSkill : UMOButton {
	FRequiredPetSkillData sReqData; // 0x438
	FOptionalPetSkillData sOptData; // 0x468
	UMaterialInstanceDynamic* pMaterialInstance; // 0x498
};

struct UMOCharCreationSpeciesPanel : UMOCharCreationPanel {
	UMOCladeGiftButton* cMOCladeGiftButtonClass; // 0x2d0
	UDataTable* pCurrentDataTable; // 0x2d8
	UUniformGridPanel* pUniformGridPanel_CladeGifts; // 0x2e0
	TArray<ENation> vAllowedNations; // 0x2e8
	UMOCarouselSelectText* pCarouselSelect_Gender; // 0x338
	UMOCarouselSelectText* pCarouselSelect_Nation; // 0x340
	UMOCarouselSelectText* pCarouselSelect_Clade; // 0x348
	UMOCarouselSelectText* pCarouselSelect_Race; // 0x350
	TArray<UMOCladeGiftButton*> vGiftButtons; // 0x358
	UTextBlock* pTextBlock_Strengths; // 0x368
	UTextBlock* pTextBlock_Summary; // 0x370
	UTextBlock* pTextBlock_Lore; // 0x378
	TArray<FText> vStrenghtsText; // 0x380
	TArray<FText> vSummaryText; // 0x390
	TArray<FText> vLoreText; // 0x3a0
	UImage* pCladeImage_Human; // 0x3b0
	UImage* pCladeImage_Alvarin; // 0x3b8
	UImage* pCladeImage_Oghmir; // 0x3c0
	UImage* pCladeImage_Thursar; // 0x3c8
};

struct ULightmappedSurfaceCollection : UObject {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct UMaterialExpressionVectorParameter : UMaterialExpressionParameter {
	FLinearColor DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x68
	char PrimitiveDataIndex; // 0x69
};

struct UWaterWavesAssetReference : UWaterWavesBase {
	UWaterWavesAsset* WaterWavesAsset; // 0x28
};

struct ADatasmithAreaLightActor : AActor {
	EDatasmithAreaLightActorType LightType; // 0x220
	EDatasmithAreaLightActorShape LightShape; // 0x221
	FVector2D Dimensions; // 0x224
	float Intensity; // 0x22c
	ELightUnits IntensityUnits; // 0x230
	FLinearColor Color; // 0x234
	float Temperature; // 0x244
	UTextureLightProfile* IESTexture; // 0x248
	bool bUseIESBrightness; // 0x250
	float IESBrightnessScale; // 0x254
	FRotator Rotation; // 0x258
	float SourceRadius; // 0x264
	float SourceLength; // 0x268
	float AttenuationRadius; // 0x26c
	float SpotlightInnerAngle; // 0x270
	float SpotlightOuterAngle; // 0x274
};

struct UMovieSceneParticleTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> ParticleSections; // 0x80
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct UAnimComposite : UAnimCompositeBase {
	FAnimTrack AnimationTrack; // 0xa8
};

struct AGameNetworkManager : AInfo {
	float BadPacketLossThreshold; // 0x220
	float SeverePacketLossThreshold; // 0x224
	int32_t BadPingThreshold; // 0x228
	int32_t SeverePingThreshold; // 0x22c
	int32_t AdjustedNetSpeed; // 0x230
	float LastNetSpeedUpdateTime; // 0x234
	int32_t TotalNetBandwidth; // 0x238
	int32_t MinDynamicBandwidth; // 0x23c
	int32_t MaxDynamicBandwidth; // 0x240
	char bIsStandbyCheckingEnabled : 1; // 0x244
	char bHasStandbyCheatTriggered : 1; // 0x244
	float StandbyRxCheatTime; // 0x248
	float StandbyTxCheatTime; // 0x24c
	float PercentMissingForRxStandby; // 0x250
	float PercentMissingForTxStandby; // 0x254
	float PercentForBadPing; // 0x258
	float JoinInProgressStandbyWaitTime; // 0x25c
	float MoveRepSize; // 0x260
	float MAXPOSITIONERRORSQUARED; // 0x264
	float MAXNEARZEROVELOCITYSQUARED; // 0x268
	float CLIENTADJUSTUPDATECOST; // 0x26c
	float MAXCLIENTUPDATEINTERVAL; // 0x270
	float MaxClientForcedUpdateDuration; // 0x274
	float ServerForcedUpdateHitchThreshold; // 0x278
	float ServerForcedUpdateHitchCooldown; // 0x27c
	float MaxMoveDeltaTime; // 0x280
	float MaxClientSmoothingDeltaTime; // 0x284
	float ClientNetSendMoveDeltaTime; // 0x288
	float ClientNetSendMoveDeltaTimeThrottled; // 0x28c
	float ClientNetSendMoveDeltaTimeStationary; // 0x290
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x294
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x298
	bool ClientAuthorativePosition; // 0x29c
	float ClientErrorUpdateRateLimit; // 0x2a0
	float ClientNetCamUpdateDeltaTime; // 0x2a4
	float ClientNetCamUpdatePositionLimit; // 0x2a8
	bool bMovementTimeDiscrepancyDetection; // 0x2ac
	bool bMovementTimeDiscrepancyResolution; // 0x2ad
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x2b0
	float MovementTimeDiscrepancyMinTimeMargin; // 0x2b4
	float MovementTimeDiscrepancyResolutionRate; // 0x2b8
	float MovementTimeDiscrepancyDriftAllowance; // 0x2bc
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x2c0
	bool bUseDistanceBasedRelevancy; // 0x2c1
};

struct UMovieSceneGeometryCacheSection : UMovieSceneSection {
	FMovieSceneGeometryCacheParams Params; // 0xe8
};

struct UInfinite_Compound : USceneComponent {
	bool RealTime; // 0x1f8
	bool EnableScale; // 0x1f9
	float TimeJump; // 0x1fc
	float VisionLimit; // 0x200
	float ScaleFactor; // 0x204
	float BeginningScale; // 0x208
	float ScaleMin; // 0x20c
	float ScaleMax; // 0x210
	EInfinityCategory InfinityCategory; // 0x214
};

struct UNiagaraDataInterfaceColorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve RedCurve; // 0x70
	FRichCurve GreenCurve; // 0xf0
	FRichCurve BlueCurve; // 0x170
	FRichCurve AlphaCurve; // 0x1f0
};

struct UForceFeedbackEffect : UObject {
	TArray<FForceFeedbackChannelDetails> ChannelDetails; // 0x28
	float Duration; // 0x38
};

struct ADungeonFire_Blueprint_C : AEmitter {
	UAudioComponent* Audio; // 0x270
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct USkeletalBodySetup : UBodySetup {
	bool bSkipScaleFromAnimation; // 0x2a0
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x2a8
};

struct ULandscapeMeshCollisionComponent : ULandscapeHeightfieldCollisionComponent {
	FGuid MeshGuid; // 0x520
};

struct UHudSettings : UObject {
	char bShowHUD : 1; // 0x28
	TArray<FName> DebugDisplay; // 0x30
};

struct UMOQuestTaskEntry : UMOUserWidget {
	URichTextBlock* pTaskText; // 0x2c8
	UMOQuestEntry* pMyQuest; // 0x2d0
	FVector vTaskLocation; // 0x2d8
	bool bTaskFocused; // 0x2e4
	ETaskState eCurTaskState; // 0x2e5
};

struct UMOOptionsEntry : UMOUserWidget {
	int32_t entryIndex; // 0x2c8
	UMOUserWidgetOptionsPanel* pOptionsPanel; // 0x2d0
	UTextBlock* pText; // 0x2d8
	FText InitializeDisplayText; // 0x2e0
	FText InitializeToolTipText; // 0x2f8
	int32_t iInitFontSize; // 0x310
};

struct UMOMailPanel : UMOUserWidget {
	UMOMail* pMail; // 0x2c8
};

struct UMOItemSlotPlaceItem : UMOItemSlot {
	bool bRequiresSkill; // 0x2b0
	bool bHideStackSize; // 0x2b1
	UMOUserWidget* pParent; // 0x2b8
	UMOBasicTooltip* pInvalidDropInfo; // 0x2c0
};

struct UEdGraphNode : UObject {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UMagicLeapTouchpadGesturesComponent : UActorComponent {
	FMulticastInlineDelegate OnTouchpadGestureStart; // 0xb8
	FMulticastInlineDelegate OnTouchpadGestureContinue; // 0xc8
	FMulticastInlineDelegate OnTouchpadGestureEnd; // 0xd8
};

struct UMagicLeapImageTrackerComponent : USceneComponent {
	UTexture2D* TargetImageTexture; // 0x1f8
	FString Name; // 0x200
	float LongerDimension; // 0x210
	bool bIsStationary; // 0x214
	bool bUseUnreliablePose; // 0x215
	EMagicLeapImageTargetOrientation AxisOrientation; // 0x216
	FMulticastInlineDelegate OnSetImageTargetSucceeded; // 0x218
	FMulticastInlineDelegate OnSetImageTargetFailed; // 0x228
	FMulticastInlineDelegate OnImageTargetFound; // 0x238
	FMulticastInlineDelegate OnImageTargetLost; // 0x248
	FMulticastInlineDelegate OnImageTargetUnreliableTracking; // 0x258
};

struct UMagicLeapHeadTrackingNotificationsComponent : UVRNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x140
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x150
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x160
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x170
};

struct USoundfieldEffectBase : UObject {
	USoundfieldEffectSettingsBase* Settings; // 0x28
};

struct UEndpointSubmix : USoundSubmixBase {
	FName EndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	UAudioEndpointSettingsBase* EndpointSettings; // 0x48
};

struct UMOCameraComponent : UCameraComponent {
	float CameraHMDBlend; // 0x7c0
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UMovieSceneLiveLinkSection : UMovieSceneSection {
	FLiveLinkSubjectPreset SubjectPreset; // 0xe8
	TArray<bool> ChannelMask; // 0x120
	TArray<UMovieSceneLiveLinkSubSection*> SubSections; // 0x130
	FName SubjectName; // 0x150
	FLiveLinkFrameData TemplateToPush; // 0x158
	FLiveLinkRefSkeleton RefSkeleton; // 0x1e8
	TArray<FName> CurveNames; // 0x208
	TArray<FMovieSceneFloatChannel> PropertyFloatChannels; // 0x218
};

struct UMOPaperdollStatistics : UMOWidgetBlueprint {
	UMOCharCreationInfoEntry* pInfoEntry_HealthReserves; // 0x260
	UMOCharCreationInfoEntry* pInfoEntry_StaminaReserves; // 0x268
	UMOCharCreationInfoEntry* pInfoEntry_ManaReserves; // 0x270
	UMOCharCreationInfoEntry* pInfoEntry_Thirst; // 0x278
	UMOCharCreationInfoEntry* pInfoEntry_Hunger; // 0x280
	UMOCharCreationInfoEntry* pInfoEntry_MaxSpeed; // 0x288
	UMOCharCreationInfoEntry* pInfoEntry_MaxJump; // 0x290
	UMOCharCreationInfoEntry* pInfoEntry_ArmorWeight; // 0x298
	UMOCharCreationInfoEntry* pInfoEntry_CarryWeight; // 0x2a0
	UMOCharCreationInfoEntry* pInfoEntry_BodyHeat; // 0x2a8
	UMOCharCreationInfoEntry* pInfoEntry_WorldHeat; // 0x2b0
	UMOCharCreationInfoEntry* pInfoEntry_StaminaRegen; // 0x2b8
	UMOCharCreationInfoEntry* pInfoEntry_ManaRegen; // 0x2c0
	UTextBlock* pTextBlockStandingsNation_Tindremene; // 0x2c8
	UTextBlock* pTextBlockStandingsNation_Sidoian; // 0x2d0
	UTextBlock* pTextBlockStandingsNation_Khurite; // 0x2d8
	UTextBlock* pTextBlockStandingsNation_Sarducaan; // 0x2e0
	UTextBlock* pTextBlockStandingsNation_Kallard; // 0x2e8
	UTextBlock* pTextBlockStandingsNation_Alvarin; // 0x2f0
	UTextBlock* pTextBlockStandingsNation_Huergar; // 0x2f8
	UTextBlock* pTextBlockStandingsNation_Risar; // 0x300
	UTextBlock* pTextBlock_MurderCount; // 0x308
	UTextBlock* pTextBlock_MurderCountTimer; // 0x310
	TArray<UTextBlock*> vTextBlockStandingsNations; // 0x318
	TArray<FText> vStandingTitles; // 0x338
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct ABP_AiEffectArrowFire_C : AMOAiEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
};

struct ABP_MODirectionalLight_SunCycle_Refactor_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UTextRenderComponent* OutputDebugText; // 0x228
	UArrowComponent* AltitudeRefArrow; // 0x230
	UArrowComponent* AzimuthRefArrow; // 0x238
	UArrowComponent* EarthPoleArrow; // 0x240
	UArrowComponent* WorldPositionForwardArrow; // 0x248
	UArrowComponent* WorldPositionNormalArrow; // 0x250
	UStaticMeshComponent* FakeSun; // 0x258
	UStaticMeshComponent* FakeEarth; // 0x260
	USceneComponent* Scene; // 0x268
	bool SolarReverseDirection; // 0x270
	float SolarMaxIntensity; // 0x274
	float SolarMaxIntensity_Multiplier; // 0x278
	float SkyDayMaxIntensity; // 0x27c
	float ObserverWorldPositionLatitude; // 0x280
	float SolarYearTime; // 0x284
	float SolarDayTime; // 0x288
	float PreviousSolarTime; // 0x28c
	bool LockDayTime; // 0x290
	bool TestDayNightSystemInPIE; // 0x291
	FVector ObserverWorldPositionNormal; // 0x294
	FVector ObserverWorldPositionForward; // 0x2a0
	FVector ObserverWorldPositionAzimuthReference; // 0x2ac
	FVector ObserverWorldPositionAltitudeReference; // 0x2b8
	float SolarAzimuth; // 0x2c4
	float SolarAzimuthNormalized; // 0x2c8
	float SolarAltitude; // 0x2cc
	float TestDayNightSystemInPIE_TimeMultiplier; // 0x2d0
	ADirectionalLight* SunDirectionalLightActor; // 0x2d8
	float SolarAltitudeNormalized; // 0x2e0
	float SolarUE4Pitch; // 0x2e4
	float SolarUE4Yaw; // 0x2e8
	FRotator SolarUE4Rotator; // 0x2ec
	ADirectionalLight* MoonDirectionalLightActor; // 0x2f8
	ASkyLight* SkyLightActor; // 0x300
	ASkyAtmosphere* SkyAtmosphereActor; // 0x308
	ABP_Sky_Sphere_C* SkySphereActor; // 0x310
	float SolarOutputLightIntensity; // 0x318
	float SolarOutputLightIntensityNormalized; // 0x31c
	float SkyNightMaxIntensity; // 0x320
	bool bRecaptureSkyEnabled; // 0x324
	UCurveFloat* SolarAltitude_LightIntensityCurve; // 0x328
	UCurveFloat* SolarAltitude_ShadowOpacityCurve; // 0x330
	float SolarOutputShadowOpacity; // 0x338
	float SkyLightOutputLightIntensity; // 0x33c
	UCurveFloat* SolarAltitude_SkyLightIntensityCurve; // 0x340
	UCurveFloat* SolarAltitude_NightDarknessCurve; // 0x348
	UCurveFloat* SolarAltitude_SkyBlendNightDayCurve; // 0x350
	FLinearColor SkyLightOutputColor; // 0x358
	float SkyLightOutputVolumetricScattering; // 0x368
	float LunarMaxIntensity; // 0x36c
	UCurveFloat* LunarAltitude_LightIntensityCurve; // 0x370
	UCurveFloat* LunarAltitude_ShadowOpacityCurve; // 0x378
	UCurveFloat* LunarAltitude_SkyLightIntensityCurve; // 0x380
	float LunarAzimuth; // 0x388
	float LunarAzimuthNormalized; // 0x38c
	float LunarAltitude; // 0x390
	float LunarAltitudeNormalized; // 0x394
	float LunarUE4Pitch; // 0x398
	float LunarUE4Yaw; // 0x39c
	FRotator LunarUE4Rotator; // 0x3a0
	float LunarOutputLightIntensity; // 0x3ac
	float LunarOutputLightIntensityNormalized; // 0x3b0
	float LunarOutputShadowOpacity; // 0x3b4
	float SkyLightNightToDayBlend; // 0x3b8
	UCurveFloat* SolarAltitude_Temperature; // 0x3c0
	UCurveFloat* SolarAltitude_SkyAtmosphereMieAbsorptionScaleCurve; // 0x3c8
	float SolarBloomScale; // 0x3d0
	float SolarBloomThreshold; // 0x3d4
	FColor SolarBloomTint; // 0x3d8
	float LunarBloomScale; // 0x3dc
	float LunarBloomThreshold; // 0x3e0
	FColor LunarBloomTint; // 0x3e4
	AExponentialHeightFog* ExpHeightFogActor; // 0x3e8
	float SkyAtmosphereMieAbsorptionScale; // 0x3f0
	FS_MO2_Sun MO2Sun; // 0x3f4
	TArray<FS_MO2_Moon> MO2Moons; // 0x438
	UCurveFloat* CF_FogOpacity; // 0x448
	UCurveLinearColor* CF_FogInscatteringColor; // 0x450
	float LunarAltitudeOffset; // 0x458
	FRotator Lunar2UE4Rotator; // 0x45c
	float LunarAltitudeOffset2; // 0x468
	float SunForcesOffMoonLightFactor; // 0x46c
	float SunForcesOffMoonShadowsFactor; // 0x470
	float SkylightDungeonTransition; // 0x474
	FLinearColor initSkyLightColor; // 0x478
	float PPExposureCompensation_Day; // 0x488
	float PPExposureCompensation_Night; // 0x48c
	float PPExposureMin_Day; // 0x490
	float PPExposureMin_Night; // 0x494
	float PPSlope_Day; // 0x498
	float PPSlope_Night; // 0x49c
	float PPToe_Day; // 0x4a0
	float PPToe_Night; // 0x4a4
	APostProcessVolume* GlobalPostProcess_Day; // 0x4a8
	APostProcessVolume* GlobalPostProcess_Night; // 0x4b0
};

struct UBTComposite_SimpleParallel : UBTCompositeNode {
	EBTParallelMode FinishMode; // 0x90
};

struct UStereoLayerShapeCylinder : UStereoLayerShape {
	float Radius; // 0x28
	float OverlayArc; // 0x2c
	int32_t Height; // 0x30
};

struct UDataAsset : UObject {
	UDataAsset* NativeClass; // 0x28
};

struct UInterpTrackLinearColorBase : UInterpTrack {
	FInterpCurveLinearColor LinearColorTrack; // 0x70
	float CurveTension; // 0x88
};

struct ABP_EQ_EquipmentGenerator_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* Handle; // 0x228
	UStaticMeshComponent* Head; // 0x230
	EEquipmentGroup EquipmentGroup; // 0x238
	EWeaponGroup WeaponGroup; // 0x239
	int32_t HeadIndex; // 0x23c
	int32_t HandleIndex; // 0x240
	EResourceGroup HeadResourceGroup; // 0x244
	int32_t HeadResourceIndex; // 0x248
	EResourceGroup HandleResourceGroup; // 0x24c
	int32_t HandleResourceIndex; // 0x250
	UMODataAssetHeadDefinitions* Head_Definitions; // 0x258
	UMODataAssetHandleDefinitions* Handle_Definitions; // 0x260
	UMODataAssetResourceDefinitions* Resource_Definitions; // 0x268
	UMaterialInterface* HeadMaterial; // 0x270
	UMaterialInterface* HandleMaterial; // 0x278
	UMaterialInstanceDynamic* Handle_MID; // 0x280
	UMaterialInstanceDynamic* Head_MID; // 0x288
	UMODataAssetShieldDefinitions* ShieldBase_Definitions; // 0x290
	FName DesiredSocketOnAutoAttach; // 0x298
};

struct UMOCheckBoxEntryLanguage : UMOOptionsEntry {
	UMOCheckBox* pMOCheckBox; // 0x318
	FString sLanguage; // 0x320
	int32_t iPctCompleted; // 0x330
	FString sLanguageLink; // 0x338
};

struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
};

struct UNavMovementComponent : UMovementComponent {
	FNavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x124
	char bUseAccelerationForPaths : 1; // 0x124
	char bUseFixedBrakingDistanceForPaths : 1; // 0x124
	FMovementProperties MovementState; // 0x125
	UObject* PathFollowingComp; // 0x128
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x198
	TArray<FString> ActorGuidStrings; // 0x218
};

struct UMovieSceneLiveLinkSubSection : UObject {
	FLiveLinkSubSectionData SubSectionData; // 0x28
	ULiveLinkRole* SubjectRole; // 0x38
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xf0
};

struct UMOBrokerPanel : UMOUserWidget {
	UMOButton* pMOButton; // 0x2c8
	UMOBroker* pBroker; // 0x2d0
};

struct UWB_MOOptionsUIPanel_C : UMOUserWidgetOptionsUI {
	UImage* Image_Line_UI; // 0x348
};

struct UUserDefinedStruct : UScriptStruct {
	EUserDefinedStructureStatus Status; // 0xc0
	FGuid Guid; // 0xc4
};

struct UMaterialInstance : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x90
	UMaterialInterface* Parent; // 0xd0
	char bHasStaticPermutationResource : 1; // 0xd8
	char bOverrideSubsurfaceProfile : 1; // 0xd8
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xe0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xf0
	TArray<FTextureParameterValue> TextureParameterValues; // 0x100
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x110
	TArray<FFontParameterValue> FontParameterValues; // 0x120
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x130
	FStaticParameterSet StaticParameters; // 0x148
	FMaterialCachedParameters CachedLayerParameters; // 0x188
	TArray<UObject*> CachedReferencedTextures; // 0x328
};

struct UWidgetAnimation : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x68
	bool bLegacyFinishOnStop; // 0x78
	FString DisplayLabel; // 0x80
};

struct UFileMediaSource : UBaseMediaSource {
	FString FilePath; // 0x88
	bool PrecacheFile; // 0x98
};

struct AMOCharacter : ACharacter {
	int32_t LocalAvatarID; // 0x4c0
	bool bRandomizeAppearance; // 0x4c4
	bool bRandomizeClade; // 0x4c5
	bool bRandomizeRace; // 0x4c6
	bool bRandomizeArmor; // 0x4c7
	bool bRandomizeEquipment; // 0x4c8
	int32_t RandomStream_BaseSeed; // 0x4cc
	float fDefaultHeightOverride; // 0x4d0
	FMOCollisionPoolAttachmentInfo ExtraColliderShapeInfo; // 0x4d8
	TArray<UShapeComponent*> CachedExtraColliderShapes; // 0x4f0
	bool bIsInRagdoll; // 0x512
	float fMaxDistanceForFootStepTraces; // 0x514
	AActor* LookAtActorOverrideCinematic; // 0x528
	FName LookAtTargetBoneName; // 0x530
	FMOCharacterPlayerAppearance DefaultAppearance; // 0x538
	FMOCharacterBodyShape BodyShape; // 0x800
	UMOCharacterEffects* pEffects; // 0x818
	UMOCharacterProjectileCreation* pProjectileCreation; // 0x820
	UMOEtherWorldCharacterSystem* pEtherWorldSystem; // 0x828
	float fRagdollDurationBeforeDeathSequence; // 0x830
	float fLoginSequenceDuration; // 0x834
	float fLogoutSequenceDuration; // 0x838
	float fDeathSequenceDuration; // 0x83c
	float fEnterOrLeaveWorldSequenceDuration; // 0x840
	bool bIsInEtherworld; // 0x844
	int32_t CustomDepthRenderChannel; // 0x848
	TArray<FMOSynchronizedFullBodyAnimationEntry> FullBodyAnimationQueue; // 0x858
	bool bIsInConstruction; // 0x878
	bool bIsSpawning; // 0x879
	FMOAnimationSequenceReactions ReactionAnimations; // 0x880
	FMOAnimationSequenceAttacks AttackAnimations; // 0x8c0
	FMOSynchronizedFullBodyAnimationEntry DominantFullBodyAnimation; // 0x930
	TArray<FMOSynchronizedFullBodyAnimationEntry> ActiveFullBodyAnimations; // 0x9c0
	bool bIsInFirstPerson; // 0x9d0
	ECombatInputDirection LastAttackAnimationDirection; // 0x9d1
	UMODataAssetWeaponAnimations* ActiveWeaponAnimationSet; // 0x9d8
	UMODataAssetMagicAnimations* ActiveMagicAnimationSet; // 0x9e0
	float OnServerVerify_CombatReleaseAnimDuration; // 0x9e8
	float OnServerVerify_CombatReleaseTimeStamp; // 0x9ec
	EMagicReleaseType eLastMagicReleaseType; // 0x9f0
	UMOCameraComponent* CameraComponent; // 0x9f8
	UMOBodyManagerComponent* pBodyManagerComponent; // 0xa00
	UMOArmorManagerComponent* pArmorManagerComponent; // 0xa08
	UMOEquipmentManagerComponent* EquipmentManagerComponent; // 0xa10
	UMOCharacterCompositionComponent* pCompositionComponent; // 0xa18
	TMap<EPhysicalSurface, USoundCue*> vFootStepSounds; // 0xa20
	FName sCameraBoneName; // 0xa70
	UMOWidgetComponentChatBubble* cChatBubbleWidgetComponentClass; // 0xa80
	FString sJournalRowNameToUnlock; // 0xa88
	USoundCue* pSoundCueUse; // 0xb18
	USoundCue* pSoundCueUseAlternative; // 0xb20
	FString sSteamStatOnKill; // 0xb28
	EMOSpawnSequence SpawnSequence; // 0xb64
	bool bIsUndead; // 0xb65
	bool bIsInCombat; // 0xb66
	UMOCombatSystem* pActiveCombat; // 0xbb0
	UMOCombatSystemMelee* pMeleeCombat; // 0xbb8
	UMOCombatSystemRanged* pRangedCombat; // 0xbc0
	float fCharacterHeight; // 0xbdc
	float fCharacterBindHeight; // 0xbe0
	float fCharacterScale; // 0xbe4
	float fEquipmentScale; // 0xbe8
	bool bIsMounted; // 0xbec
	bool bAnimMontageBound; // 0xbed
	bool bAlignWithFloor; // 0xc1c
	FMOObstacleAvoidanceParameters ObstacleAvoidanceParameters; // 0xc20
	bool bCanStrafe; // 0xca6
};

struct USkyLightComponent : ULightComponentBase {
	bool bRealTimeCapture; // 0x228
	ESkyLightSourceType SourceType; // 0x229
	UTextureCube* Cubemap; // 0x230
	float SourceCubemapAngle; // 0x238
	int32_t CubemapResolution; // 0x23c
	float SkyDistanceThreshold; // 0x240
	bool bCaptureEmissiveOnly; // 0x244
	bool bLowerHemisphereIsBlack; // 0x245
	FLinearColor LowerHemisphereColor; // 0x248
	float OcclusionMaxDistance; // 0x258
	float Contrast; // 0x25c
	float OcclusionExponent; // 0x260
	float MinOcclusion; // 0x264
	FColor OcclusionTint; // 0x268
	char bCloudAmbientOcclusion : 1; // 0x26c
	float CloudAmbientOcclusionStrength; // 0x270
	float CloudAmbientOcclusionExtent; // 0x274
	float CloudAmbientOcclusionMapResolutionScale; // 0x278
	float CloudAmbientOcclusionApertureScale; // 0x27c
	EOcclusionCombineMode OcclusionCombineMode; // 0x280
	UTextureCube* BlendDestinationCubemap; // 0x338
};

struct UPreviewMeshCollection : UDataAsset {
	USkeleton* Skeleton; // 0x38
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x40
};

struct UMODataAssetNPCConversation : UPrimaryDataAsset {
	FText sStartingText; // 0x30
	FText sPlayerResponse1; // 0x48
	FText sPlayerResponse2; // 0x60
	FText sPlayerResponse3; // 0x78
	FText sPlayerResponse4; // 0x90
	FText sPlayerResponse5; // 0xa8
	FMONPCReply pNextNPCReply1; // 0xc0
	FMONPCReply pNextNPCReply2; // 0x190
	FMONPCReply pNextNPCReply3; // 0x260
	FMONPCReply pNextNPCReply4; // 0x330
	FMONPCReply pNextNPCReply5; // 0x400
};

struct UMOEquipmentManagerComponent : UActorComponent {
	UMOEquipmentComponent* pMainEquipmentComponent; // 0xb0
	UMOEquipmentComponent* pSecondaryEquipmentComponent; // 0xb8
	UMODataAssetArrowHead* pArrowHeadData; // 0xc0
};

struct UWB_MOCharCreationSlider_SkinComplexion_C : UMOOptionSliderWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x330
	UImage* Input; // 0x338
	float fMinValue; // 0x340
	float fMaxValue; // 0x344
	float fOptionsSliderValue; // 0x348
	float fOptionsSliderModifier; // 0x34c
	FString AppendEndOfStringWith; // 0x350
	bool bRoundOutVariable; // 0x360
	float fPrecisionPower; // 0x364
	FText ToolTip; // 0x368
	float TestVariable; // 0x380
	bool BackgroundIsVisible; // 0x384
};

struct UParticleSystem : UFXSystemAsset {
	float UpdateTime_FPS; // 0x30
	float UpdateTime_Delta; // 0x34
	float WarmupTime; // 0x38
	float WarmupTickRate; // 0x3c
	TArray<UParticleEmitter*> Emitters; // 0x40
	UParticleSystemComponent* PreviewComponent; // 0x50
	UInterpCurveEdSetup* CurveEdSetup; // 0x58
	float LODDistanceCheckTime; // 0x60
	float MacroUVRadius; // 0x64
	TArray<float> LODDistances; // 0x68
	TArray<FParticleSystemLOD> LODSettings; // 0x78
	FBox FixedRelativeBoundingBox; // 0x88
	float SecondsBeforeInactive; // 0xa4
	float Delay; // 0xa8
	float DelayLow; // 0xac
	char bOrientZAxisTowardCamera : 1; // 0xb0
	char bUseFixedRelativeBoundingBox : 1; // 0xb0
	char bShouldResetPeakCounts : 1; // 0xb0
	char bHasPhysics : 1; // 0xb0
	char bUseRealtimeThumbnail : 1; // 0xb0
	char ThumbnailImageOutOfDate : 1; // 0xb0
	char bUseDelayRange : 1; // 0xb1
	char bAllowManagedTicking : 1; // 0xb1
	char bAutoDeactivate : 1; // 0xb1
	char bRegenerateLODDuplicate : 1; // 0xb1
	EParticleSystemUpdateMode SystemUpdateMode; // 0xb2
	ParticleSystemLODMethod LODMethod; // 0xb3
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xb4
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0xb5
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xb7
	uint32_t MinTimeBetweenTicks; // 0xb8
	float InsignificanceDelay; // 0xbc
	FVector MacroUVPosition; // 0xc0
	FBox CustomOcclusionBounds; // 0xcc
	TArray<FLODSoloTrack> SoloTracking; // 0xe8
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0xf8
};

struct USkeletalMeshSocket : UObject {
	FName SocketName; // 0x28
	FName BoneName; // 0x30
	FVector RelativeLocation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale; // 0x50
	bool bForceAlwaysAnimated; // 0x5c
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UMaterialExpressionSceneDepth : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput Coordinates; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UWidgetTree : UObject {
	UWidget* RootWidget; // 0x28
};

struct UMovieScene3DAttachSection : UMovieScene3DConstraintSection {
	FName AttachSocketName; // 0x118
	FName AttachComponentName; // 0x120
	EAttachmentRule AttachmentLocationRule; // 0x128
	EAttachmentRule AttachmentRotationRule; // 0x129
	EAttachmentRule AttachmentScaleRule; // 0x12a
	EDetachmentRule DetachmentLocationRule; // 0x12b
	EDetachmentRule DetachmentRotationRule; // 0x12c
	EDetachmentRule DetachmentScaleRule; // 0x12d
};

struct UWB_MO_Scrollbox_Arrow_Up_C : UMOUserWidget {
	UImage* pImage; // 0x2c8
};

struct UMaterialExpressionVolumetricAdvancedMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput PhaseG; // 0x40
	FExpressionInput PhaseG2; // 0x54
	FExpressionInput PhaseBlend; // 0x68
	FExpressionInput MultiScatteringContribution; // 0x7c
	FExpressionInput MultiScatteringOcclusion; // 0x90
	FExpressionInput MultiScatteringEccentricity; // 0xa4
	FExpressionInput ConservativeDensity; // 0xb8
	float ConstPhaseG; // 0xcc
	float ConstPhaseG2; // 0xd0
	float ConstPhaseBlend; // 0xd4
	bool PerSamplePhaseEvaluation; // 0xd8
	uint32_t MultiScatteringApproximationOctaveCount; // 0xdc
	float ConstMultiScatteringContribution; // 0xe0
	float ConstMultiScatteringOcclusion; // 0xe4
	float ConstMultiScatteringEccentricity; // 0xe8
	bool bGroundContribution; // 0xec
	bool bGrayScaleMaterial; // 0xed
	bool bRayMarchVolumeShadow; // 0xee
};

struct UPlaneReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadiusScale; // 0x270
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UMOAnimNotifyPlayCharacterVoice : UMOAnimNotify {
	ECharacterSound eVoiceSound; // 0x38
};

struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve Curve; // 0x70
};

struct UInterpTrackVectorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UParticleModuleLocationDirect : UParticleModuleLocationBase {
	FRawDistributionVector Location; // 0x30
	FRawDistributionVector LocationOffset; // 0x78
	FRawDistributionVector ScaleFactor; // 0xc0
	FRawDistributionVector Direction; // 0x108
};

struct UInterpTrackInstFloatParticleParam : UInterpTrackInst {
	float ResetFloat; // 0x28
};

struct UTexture2DArray : UTexture {
	TextureAddress AddressX; // 0x130
	TextureAddress AddressY; // 0x131
	TextureAddress AddressZ; // 0x132
};

struct UMovieSceneGeometryCollectionSection : UMovieSceneSection {
	FMovieSceneGeometryCollectionParams Params; // 0xe8
};

struct ULiveLinkDebuggerSettings : UObject {
	FSlateColor MinBarColor; // 0x28
	FSlateColor MaxBarColor; // 0x50
	float DPIScaleMultiplier; // 0x78
};

struct UFontFace : UObject {
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	char bVisibleInRayTracing : 1; // 0x158
	char bEvaluateWorldPositionOffset : 1; // 0x158
	FBodyInstance BodyInstance; // 0x160
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x2b8
	FLightingChannels LightingChannels; // 0x2b9
	char bRenderCustomDepth : 1; // 0x2bc
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x2c0
	int32_t CustomDepthStencilValue; // 0x2c4
	int32_t TranslucencySortPriority; // 0x2c8
	float CollisionRadius; // 0x2cc
	float ShadeRadius; // 0x2d0
	int32_t NumSteps; // 0x2d4
	float InitialSeedDensity; // 0x2d8
	float AverageSpreadDistance; // 0x2dc
	float SpreadVariance; // 0x2e0
	int32_t SeedsPerStep; // 0x2e4
	int32_t DistributionSeed; // 0x2e8
	float MaxInitialSeedOffset; // 0x2ec
	bool bCanGrowInShade; // 0x2f0
	bool bSpawnsInShade; // 0x2f1
	float MaxInitialAge; // 0x2f4
	float MaxAge; // 0x2f8
	float OverlapPriority; // 0x2fc
	FFloatInterval ProceduralScale; // 0x300
	FRuntimeFloatCurve ScaleCurve; // 0x308
	int32_t ChangeCount; // 0x390
	char ReapplyDensity : 1; // 0x394
	char ReapplyRadius : 1; // 0x394
	char ReapplyAlignToNormal : 1; // 0x394
	char ReapplyRandomYaw : 1; // 0x394
	char ReapplyScaling : 1; // 0x394
	char ReapplyScaleX : 1; // 0x394
	char ReapplyScaleY : 1; // 0x394
	char ReapplyScaleZ : 1; // 0x394
	char ReapplyRandomPitchAngle : 1; // 0x395
	char ReapplyGroundSlope : 1; // 0x395
	char ReapplyHeight : 1; // 0x395
	char ReapplyLandscapeLayers : 1; // 0x395
	char ReapplyZOffset : 1; // 0x395
	char ReapplyCollisionWithWorld : 1; // 0x395
	char ReapplyVertexColorMask : 1; // 0x395
	char bEnableDensityScaling : 1; // 0x395
	char bEnableDiscardOnLoad : 1; // 0x396
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x398
	int32_t VirtualTextureCullMips; // 0x3a8
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x3ac
};

struct UNiagaraRendererProperties : UNiagaraMergeable {
	FNiagaraPlatformSet Platforms; // 0x28
	int32_t SortOrderHint; // 0x58
	bool bIsEnabled; // 0x5c
	bool bMotionBlurEnabled; // 0x5d
};

struct UMOStablesRemPet : UMOUserWidget {
	UTextBlock* pTextBlockPetPoints; // 0x2c8
	UTextBlock* pTextBlockPetPointsMax; // 0x2d0
	UMOScrollBox* pMOScrollBox_Pets; // 0x2d8
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x258
	TArray<AActor*> OverrideInvisibleActors; // 0x268
	TArray<FName> OverrideInvisibleLevels; // 0x278
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
	char bPostUpdateTickGroup : 1; // 0x228
	char bCurrentlyActive : 1; // 0x228
	FMulticastInlineDelegate OnParticleSpawn; // 0x230
	FMulticastInlineDelegate OnParticleBurst; // 0x240
	FMulticastInlineDelegate OnParticleDeath; // 0x250
	FMulticastInlineDelegate OnParticleCollide; // 0x260
};

struct USoundNodeQualityLevel : USoundNode {
	int32_t CookedQualityLevelIndex; // 0x48
};

struct UMaterialExpressionArccosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UDEV_BP_ClientEffect_Transcendental_Awerness_C : UMOClientEffectAlvarinZoom {
	FPointerToUberGraphFrame UberGraphFrame; // 0x78
	FPostProcessSettings pPreviousPostProcessSettings; // 0x80
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct ABodyFireEffect_Flamestrike_C : AMOEffectActorBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
	TArray<FName> Locations; // 0x230
	UNiagaraSystem* NiagaraSystem; // 0x240
	TArray<UNiagaraComponent*> NiagaraSystem_List; // 0x248
	TArray<FString> SocketFilter; // 0x258
	bool Temp; // 0x268
};

struct UInputTouchDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x28
};

struct UNiagaraParameterCollectionInstance : UObject {
	UNiagaraParameterCollection* Collection; // 0x28
	TArray<FNiagaraVariable> OverridenParameters; // 0x30
	FNiagaraParameterStore ParameterStorage; // 0x40
};

struct ASwitchActor : AActor {
	USceneComponent* SceneComponent; // 0x238
	int32_t LastSelectedOption; // 0x240
};

struct UMaterialExpressionSmoothStep : UMaterialExpression {
	FExpressionInput Min; // 0x40
	FExpressionInput Max; // 0x54
	FExpressionInput Value; // 0x68
	float ConstMin; // 0x7c
	float ConstMax; // 0x80
	float ConstValue; // 0x84
};

struct UAITask_MoveTo : UAITask {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UBTTask_FinishWithResult : UBTTaskNode {
	EBTNodeResult Result; // 0x70
};

struct UMODataAssetWeaponAnimations : UPrimaryDataAsset {
	bool bUseExactAimDuringCharge; // 0x30
	bool bCorrectPelvisTranslationDuringRelease; // 0x31
	float HandMovementLagMultiplier; // 0x34
	float HandMovementSwayHorizontalMultiplier; // 0x38
	float HandMovementSwayVerticalMultiplier; // 0x3c
	float HandMovementSwayRotationDegrees; // 0x40
	float HandMovementTurnSwayHorizontalMultiplier; // 0x44
	float HandMovementTurnSwayVerticalMultiplier; // 0x48
	float HandMovementDuringChargeMultiplier; // 0x4c
	float HandBreathSwayAmplitude; // 0x50
	UMODataAssetWeaponAnimations* FirstPersonOverrideSet; // 0x58
	UMODataAssetWeaponAnimations* MountedOverrideSet; // 0x60
	UMODataAssetWeaponAnimations* ShieldBucklerOverrideSet; // 0x68
	UMODataAssetWeaponAnimations* ShieldRoundOverrideSet; // 0x70
	UMODataAssetWeaponAnimations* ShieldKiteOverrideSet; // 0x78
	UMODataAssetWeaponAnimations* ShieldTowerOverrideSet; // 0x80
	float WalkBaseSpeed; // 0x88
	float RunBaseSpeed; // 0x8c
	float SprintBaseSpeed; // 0x90
	UBlendSpaceBase* WalkBlendspace; // 0x98
	UBlendSpaceBase* RunBlendspace; // 0xa0
	UAnimSequenceBase* Sprint; // 0xa8
	UAnimSequenceBase* MercyModeIdle; // 0xb0
	UAnimSequenceBase* MercyModeEnter; // 0xb8
	UAnimSequenceBase* MercyModeLeave; // 0xc0
	UAnimSequenceBase* MercyModeWalk; // 0xc8
	UAnimSequenceBase* Idle; // 0xd0
	UAnimSequenceBase* Equip; // 0xd8
	UAnimSequenceBase* Unequip; // 0xe0
	UAnimSequenceBase* Warcry; // 0xe8
	UAimOffsetBlendSpace* CombatAimOffset; // 0xf0
	UAnimSequenceBase* Push; // 0xf8
	UAnimSequenceBase* BlockLeft; // 0x100
	UAnimSequenceBase* BlockMiddle; // 0x108
	UAnimSequenceBase* BlockRight; // 0x110
	UAnimSequenceBase* BlockUp; // 0x118
	UBlendSpaceBase* TakeHitBlendspace; // 0x120
	UAnimMontage* AttackMontage_Left; // 0x128
	UAnimMontage* AttackMontage_Middle; // 0x130
	UAnimMontage* AttackMontage_Right; // 0x138
	UAnimMontage* AttackMontage_Up; // 0x140
	UAnimMontage* BlockMontage_Left; // 0x148
	UAnimMontage* BlockMontage_Middle; // 0x150
	UAnimMontage* BlockMontage_Right; // 0x158
	UAnimMontage* BlockMontage_Up; // 0x160
};

struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	char bAllowDifferentItemTypes : 1; // 0x60
	char bHasMatchingItemType : 1; // 0x60
	UEnvQueryItemType* ForcedItemType; // 0x68
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct AMOStaticMeshActor : AStaticMeshActor {
	FText sDisplayName; // 0x230
	FString sJournalRowNameToUnlock; // 0x248
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct UMODataAssetPlayerBaseDefinition : UPrimaryDataAsset {
	TSoftObjectPtr<UMODataAssetPlayerBaseDefinition> UndeadVariant; // 0x30
	UMaterialInterface* EtherworldMaterial; // 0x58
	UNiagaraSystem* EtherworldParticleEffect; // 0x60
	TArray<FColor> vFurColors; // 0x68
	UMaterialInterface* pFurPreviewMaterial; // 0x78
	int32_t iDefaultSkinDecorationIndexA; // 0x80
	int32_t iDefaultSkinDecorationIndexB; // 0x84
	int32_t iDefaultSkinDecorationIndexC; // 0x88
	TArray<FColor> vEyeColors; // 0x90
	int32_t iDefaultEyeColorIndex; // 0xa0
	UMaterialInterface* pEyePreviewMaterial; // 0xa8
	TArray<FColor> vSkinColors; // 0xb0
	int32_t iDefaultSkinColorIndex; // 0xc0
	UMaterialInterface* pSkinPreviewMaterial; // 0xc8
	TArray<FColor> vHairColors; // 0xd0
	int32_t iDefaultHairColorIndex; // 0xe0
	UMaterialInterface* pHairPreviewMaterial; // 0xe8
	int32_t iDefaultFaceTattooIndex; // 0xf0
	int32_t iDefaultBodyTattooIndex; // 0xf4
	ESpecies Species; // 0xf8
	ESex Sex; // 0xf9
	float fPenisScale; // 0xfc
	float fDefaultLength; // 0x100
	float fSkeletalMeshBaseHeight; // 0x104
	UCurveFloat* pHeadScaleByHeightCurve; // 0x108
	USkeletalMesh* LowDetailProxyMesh; // 0x110
	UMaterialInterface* LowDetailProxyMaterial; // 0x118
	USkeletalMesh* DefaultHead; // 0x120
	UAnimInstance* HeadAnimClass; // 0x128
	UMaterialInterface* HeadSkinMaterial; // 0x130
	UMaterialInterface* EyesMaterial; // 0x138
	UMaterialInterface* EyesAOMaterial; // 0x140
	UMaterialInterface* FaceTattooMaterial; // 0x148
	UPoseAsset* HeadPoseAsset; // 0x150
	UPoseAsset* HeadARKitPoses; // 0x158
	UPoseAsset* HeadCustomizationShapes; // 0x160
	TArray<TSoftObjectPtr<UMODataAssetHair>> Hairstyles; // 0x168
	TArray<TSoftObjectPtr<UMODataAssetHair>> Beards; // 0x178
	USkeletalMesh* DefaultBody; // 0x188
	UAnimInstance* BodyAnimClass; // 0x190
	UMaterialInterface* BodySkinMaterial; // 0x198
	UMaterialInterface* BodyTattooMaterial; // 0x1a0
	UPhysicsAsset* PhysicsAsset; // 0x1a8
	UAnimInstance* PaperdollBodyAnimClass; // 0x1b0
	UAnimSequenceBase* BodyProportionsBaseSequence; // 0x1b8
	UPoseAsset* BodyProportionsPoseAsset; // 0x1c0
	TArray<UTexture*> BodyHairTextures; // 0x1c8
	UMaterialInterface* HeadFurMaterial; // 0x1d8
	USkeletalMesh* HeadFurMesh; // 0x1e0
	UFurSplines* HeadFurSplines; // 0x1e8
	FMOGFurParameters HeadFurParameters; // 0x1f0
	UMaterialInterface* BodyFurMaterial; // 0x248
	USkeletalMesh* BodyFurMesh; // 0x250
	UFurSplines* BodyFurSplines; // 0x258
	FMOGFurParameters BodyFurParameters; // 0x260
	float WalkBaseSpeed; // 0x2b8
	float RunBaseSpeed; // 0x2bc
	float SprintBaseSpeed; // 0x2c0
	UMODataAssetAnimationRandomSet* IdleVariations; // 0x2c8
	UMODataAssetAnimationRandomSet* IdleVariations_FP; // 0x2d0
	UMODataAssetAnimationRandomSet* IdleVariations_NPC; // 0x2d8
	UBlendSpaceBase* WalkBlendspace; // 0x2e0
	UBlendSpaceBase* RunBlendspace; // 0x2e8
	UAnimSequenceBase* Sprint; // 0x2f0
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Unarmed; // 0x2f8
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Axe1H; // 0x320
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Axe2H; // 0x348
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Dagger; // 0x370
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Hammer1H; // 0x398
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Hammer2H; // 0x3c0
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_PoleAxe; // 0x3e8
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_PoleSword; // 0x410
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Spear; // 0x438
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Sword1H; // 0x460
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Sword2H; // 0x488
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Lance; // 0x4b0
	TSoftObjectPtr<UMODataAssetWeaponAnimations> WeaponAnimationSet_Bow; // 0x4d8
	TSoftObjectPtr<UMODataAssetMagicAnimations> MagicAnimationSet_Ecumenical; // 0x500
	TSoftObjectPtr<UMODataAssetMagicAnimations> MagicAnimationSet_Spiritism; // 0x528
	TSoftObjectPtr<UMODataAssetMagicAnimations> MagicAnimationSet_Necromancy; // 0x550
	TSoftObjectPtr<UMODataAssetMagicAnimations> MagicAnimationSet_Elementalism; // 0x578
	UMODataAssetEtherCombat* Ethercombat; // 0x5a0
	TSoftObjectPtr<UMODataAssetFishingAnimations> FishingAnimationSet; // 0x5a8
	UMODataAssetTattooDefinitions* pTattooDefinitions; // 0x5d0
	UMODataAssetEmoteDefinitions* pEmotes; // 0x5d8
	UMODataAssetSkillAnimationDefinitions* pSkillAnimations; // 0x5e0
	UMODataAssetAnimationRandomSet* MountedIdleVariations; // 0x5e8
	UMODataAssetAnimationRandomSet* MountedIdleVariations_FP; // 0x5f0
	UMODataAssetAnimationRandomSet* MountedIdleVariations_NPC; // 0x5f8
	UAnimSequenceBase* Mounted_Mount_Left; // 0x600
	UAnimSequenceBase* Mounted_Mount_Right; // 0x608
	UAnimSequenceBase* Mounted_Dismount_Left; // 0x610
	UAnimSequenceBase* Mounted_Dismount_Right; // 0x618
	FMOAnimationSequenceReactions ReactionSequences; // 0x620
	USoundCue* pSoundCue_Pain; // 0x660
	USoundCue* pSoundCue_Death; // 0x668
	USoundCue* pSoundCue_HeavyBreathing; // 0x670
	USoundCue* pSoundCue_Gasp; // 0x678
	USoundCue* pSoundCue_Drown; // 0x680
	USoundCue* pSoundCue_Push; // 0x688
	USoundCue* pSoundCue_MercyModeSound; // 0x690
	USoundCue* pSoundCue_JumpStart; // 0x698
	USoundCue* pSoundCue_JumpEnd; // 0x6a0
	USoundCue* pSoundCue_FastSwing; // 0x6a8
	USoundCue* pSoundCue_FullChargedSwing; // 0x6b0
	USoundCue* pSoundCue_HardChargedSwing; // 0x6b8
	USoundCue* pSoundCue_BattleCry; // 0x6c0
	USoundCue* pSoundCue_KauBeam; // 0x6c8
	USoundCue* pSoundCue_GoreLimbRemoved; // 0x6d0
	USoundCue* pSoundCue_GorePiercingDeath; // 0x6d8
	USoundCue* pSoundCue_GoreBluntDeath; // 0x6e0
	USoundCue* pSoundCue_GoreBowDeath; // 0x6e8
	bool bAnimationsArePreloaded; // 0x6f0
	TArray<UMODataAssetWeaponAnimations*> PreloadedWeaponAnimations; // 0x6f8
	TArray<UMODataAssetMagicAnimations*> PreloadedMagicAnimations; // 0x708
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x220
	FColor BrushColor; // 0x224
	int32_t PolyFlags; // 0x228
	char bColored : 1; // 0x22c
	char bSolidWhenSelected : 1; // 0x22c
	char bPlaceableFromClassBrowser : 1; // 0x22c
	char bNotForClientOrServer : 1; // 0x22c
	UModel* Brush; // 0x230
	UBrushComponent* BrushComponent; // 0x238
	char bInManipulation : 1; // 0x240
	TArray<FGeomSelection> SavedSelections; // 0x248
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UMOQuestEntry : UMOUserWidget {
	UTextBlock* pTitleText; // 0x2c8
	UVerticalBox* pTaskVerticalBox; // 0x2d0
	UMOQuestTaskEntry* cMOQuestTaskEntry; // 0x2d8
	UMOQuestWidget* pQuestWidgetOwner; // 0x2e0
	UImage* pQuestIcon; // 0x2e8
	bool bQuestFocused; // 0x2f0
	TArray<UMOQuestTaskEntry*> vQuestTasks; // 0x2f8
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UMOAlchemy : UMOUserWidget {
	UMOButtonMedium* pMOButton_Alchemy; // 0x2c8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_Resource; // 0x2d0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_1; // 0x2d8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_2; // 0x2e0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_3; // 0x2e8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_4; // 0x2f0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_5; // 0x2f8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_6; // 0x300
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_7; // 0x308
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_8; // 0x310
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_9; // 0x318
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_10; // 0x320
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_11; // 0x328
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_12; // 0x330
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_13; // 0x338
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_14; // 0x340
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_15; // 0x348
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_IngredientSlot_16; // 0x350
	UImage* pSlot_000; // 0x358
	UImage* pSlot_001; // 0x360
	UImage* pSlot_002; // 0x368
	UImage* pSlot_003; // 0x370
	UImage* pSlot_101; // 0x378
	UImage* pSlot_102; // 0x380
	UImage* pSlot_103; // 0x388
	UImage* pSlot_104; // 0x390
	UImage* pSlot_105; // 0x398
	UImage* pSlot_106; // 0x3a0
	UImage* pSlot_107; // 0x3a8
	UImage* pSlot_108; // 0x3b0
	UImage* pSlot_109; // 0x3b8
	UImage* pSlot_110; // 0x3c0
	UImage* pSlot_111; // 0x3c8
	UImage* pSlot_112; // 0x3d0
	TArray<UMOItemSlotPlaceItem*> vIngredientSlotSimplifier; // 0x3e8
	TArray<UImage*> vBasicIngredientsHidden; // 0x3f8
	TArray<UImage*> vAdvancedIngredientsHidden; // 0x408
};

struct UNiagaraLightRendererProperties : UNiagaraRendererProperties {
	char bUseInverseSquaredFalloff : 1; // 0x80
	char bAffectsTranslucency : 1; // 0x80
	float RadiusScale; // 0x84
	FVector ColorAdd; // 0x88
	FNiagaraVariableAttributeBinding LightRenderingEnabledBinding; // 0x98
	FNiagaraVariableAttributeBinding LightExponentBinding; // 0xf0
	FNiagaraVariableAttributeBinding PositionBinding; // 0x148
	FNiagaraVariableAttributeBinding ColorBinding; // 0x1a0
	FNiagaraVariableAttributeBinding RadiusBinding; // 0x1f8
	FNiagaraVariableAttributeBinding VolumetricScatteringBinding; // 0x250
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct UMODataAssetFishingRodDefinitions : UPrimaryDataAsset {
	UMODataAssetFishingRod* pFallBackFishingRod; // 0x30
	UMODataAssetEquipmentShared* pSharedData; // 0x38
	TArray<UMODataAssetFishingRod*> vFishingRods; // 0x40
};

struct AMOEquipmentActorTwoPart : AMOEquipmentActor {
	UStaticMeshComponent* HandleComponent; // 0x288
	UStaticMeshComponent* HeadComponent; // 0x290
	bool bTraceUsingHead; // 0x298
	TArray<FVector> LocalHeadTracePositions; // 0x2a0
	UMaterialInstanceDynamic* HandleMID; // 0x2b0
	UMaterialInstanceDynamic* HeadMID; // 0x2b8
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UWidgetSwitcherSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x80
	bool bAdditivePose; // 0x110
	int32_t BasePoseIndex; // 0x114
	FName RetargetSource; // 0x118
};

struct UMOCraftingSliderWidget : UUserWidget {
	UMOSlider* pMOSlider; // 0x260
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x1f8
	float Brightness; // 0x208
	float Intensity; // 0x20c
	FColor LightColor; // 0x210
	char bAffectsWorld : 1; // 0x214
	char CastShadows : 1; // 0x214
	char CastStaticShadows : 1; // 0x214
	char CastDynamicShadows : 1; // 0x214
	char bAffectTranslucentLighting : 1; // 0x214
	char bTransmission : 1; // 0x214
	char bCastVolumetricShadow : 1; // 0x214
	char bCastDeepShadow : 1; // 0x214
	char bCastRaytracedShadow : 1; // 0x215
	char bAffectReflection : 1; // 0x215
	char bAffectGlobalIllumination : 1; // 0x215
	float DeepShadowLayerDistribution; // 0x218
	float IndirectLightingIntensity; // 0x21c
	float VolumetricScatteringIntensity; // 0x220
	int32_t SamplesPerPixel; // 0x224
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x48
	float PitchMax; // 0x4c
	float VolumeMin; // 0x50
	float VolumeMax; // 0x54
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe8
};

struct UWB_TabButtonNewImage_C : UMOUserWidgetTabButtonNew {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	UImage* ImageHovered; // 0x318
	UImage* ImageIcon; // 0x320
	UImage* ImagePressed; // 0x328
	UTexture2D* Texture; // 0x330
	UTexture2D* TextureSelected; // 0x338
};

struct AMODecorationActor : AMOStaticMeshActorUse {
	AMOAvatarStaticMeshBuildableHouse* pHouse; // 0x2b0
	UStaticMeshComponent* pRemoveComponent; // 0x2b8
	bool bIsChest; // 0x2c0
};

struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	FSubmixEffectFilterSettings Settings; // 0x9c
};

struct AMOTriggerVolumeJournal : AMOTriggerVolume {
	FString sJournalRowNameToUnlock; // 0x258
};

struct UMOCharCreationAppearancePanel : UMOCharCreationPanel {
	FMulticastInlineDelegate OnShowFaceCustomization; // 0x2d0
	TMap<int32_t, UMODataAssetTattoo*> FaceTattooMap; // 0x2e0
	TMap<int32_t, UMODataAssetTattoo*> BodyTattooMap; // 0x330
	UMODataAssetTattoo* pFaceTattoo; // 0x380
	UMODataAssetTattoo* pBodyTattoo; // 0x388
	ETattooEffectType eFaceTattooStyle; // 0x390
	ETattooEffectType eBodyTattooStyle; // 0x391
	TArray<ETattooEffectType> vFaceTattooStyles; // 0x398
	TArray<ETattooEffectType> vBodyTattooStyles; // 0x3a8
	int32_t iPreviousValue_SkinDecorationA; // 0x3b8
	int32_t iPreviousValue_SkinDecorationB; // 0x3bc
	int32_t iPreviousValue_SkinDecorationC; // 0x3c0
	UMOButtonLarge* pMOButton_EnableFaceCustomization; // 0x3c8
	UMOCarouselSelectValue* pCarouselSelect_HairStyle; // 0x3d0
	UMOCarouselSelectValue* pCarouselSelect_Beard; // 0x3d8
	UVerticalBox* pVerticalBox_Tattoo; // 0x3e0
	UMOCarouselSelectText* pCarouselSelect_FaceTattooType; // 0x3e8
	UMOCarouselSelectText* pCarouselSelect_BodyTattooType; // 0x3f0
	UMOCarouselSelectValue* pCarouselSelect_FaceTattoo; // 0x3f8
	UMOCarouselSelectValue* pCarouselSelect_BodyTattoo; // 0x400
	UMOCarouselSelectText* pCarouselSelect_FaceTattooStyle; // 0x408
	UMOCarouselSelectText* pCarouselSelect_BodyTattooStyle; // 0x410
	UMOOptionSliderWidget* pSlider_Weight; // 0x418
	UUniformGridPanel* pUniformGridPanel_SkinColors; // 0x420
	UUniformGridPanel* pUniformGridPanel_HairColors; // 0x428
	UUniformGridPanel* pUniformGridPanel_BeardColors; // 0x430
	UUniformGridPanel* pUniformGridPanel_EyeColors; // 0x438
	UUniformGridPanel* pUniformGridPanel_FaceTattooColors; // 0x440
	UUniformGridPanel* pUniformGridPanel_BodyTattooColors; // 0x448
	UMOOptionSliderWidget* pSlider_SkinDecorationA; // 0x450
	UMOOptionSliderWidget* pSlider_SkinDecorationB; // 0x458
	UMOOptionSliderWidget* pSlider_SkinDecorationC; // 0x460
	UMOCarouselSelectText* pCarouselSelect_SkinDecorationA; // 0x468
	UOverlay* pOverlay_SkinDecorationC; // 0x470
	UUniformGridPanel* pUniformGridPanel_SkinDecorationC; // 0x478
	UMOCharCreationColorEntry* cMOColorEntryClass; // 0x480
	UMOCharCreationColorEntry* CMOHiddenColorEntryClass; // 0x488
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct ULiveLinkComponent : UActorComponent {
	FMulticastInlineDelegate OnLiveLinkUpdated; // 0xb0
};

struct AMOPlayerController : APlayerController {
	USoundCue* pHeartBeat; // 0x5f0
	USoundCue* pTakeFallDamage; // 0x5f8
	UCurveFloat* pChargeDamageScaleCurve; // 0x600
	UMaterialParameterCollection* pDayNightParamCollection; // 0x608
	int32_t ControlledAvatarID; // 0x614
	FMOEquipmentStats LeftEquipmentStats; // 0x618
	FMOEquipmentStats RightEquipmentStats; // 0x640
	bool bReplicateJumpInAtlas; // 0x668
	float BaseTurnRate; // 0x66c
	float BaseLookUpRate; // 0x670
	bool bIsLoadingOrTeleporting; // 0x6e8
	ACameraActor* pStationaryCamera; // 0x6f0
	UMOGameUserSettings* pMOGameUserSettings; // 0x6f8
	UMaterialParameterCollection* pUIParameterCollection; // 0x700
	TArray<UMOClientEffect*> vClientEffects; // 0x708
	UDataTable* pDataTableClientEffects; // 0x718
	UMOStatManager* pStatManager; // 0x720
	UMOHintManager* pHintManager; // 0x728
	UMOTargetManager* pTargetManager; // 0x730
	UMOCombatSystem* pCombatSystem; // 0x738
	UMOCombatSystem* pLastActiveCombatSystem; // 0x740
	UMOCombatSystemRanged* pRangedCombatSystem; // 0x748
	UMOCombatSystemMelee* pMeleeCombatSystem; // 0x750
	UMOCombatSystemMagic* pMagicCombatSystem; // 0x758
	UMOCombatSystemFishing* pFishingCombatSystem; // 0x760
	AActor* pWaypointActor; // 0x768
	UMOPreviewMode* pPreviewMode; // 0x770
	UUserWidget* LoadingWidget; // 0x778
	UAudioComponent* pBreathingAudioComponent; // 0x888
	UAudioComponent* pHeartBeatAudioComponent; // 0x890
};

struct UARPoseComponent : UARComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct UMOCraftingPetEquipment : UMOCrafting {
	UMOScrollBox* pScrollBox_ArmorSlot; // 0x310
	UMOScrollBox* pScrollBox_ArmorStyle; // 0x318
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_ArmorOutsideMaterial; // 0x320
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_ArmorInsideMaterial; // 0x328
	UMaterialInstance* pPreviewMaterial; // 0x330
	FString sArmorSlotMaterialInsideName; // 0x338
	FString sArmorSlotMaterialOutsideName; // 0x348
	FString sArmorSlotName; // 0x358
	FString sArmorStyleName; // 0x368
	UMOCraftingSliderWidget* pCraftingSlider_Inside; // 0x378
	UMOCraftingSliderWidget* pCraftingSlider_Outside; // 0x380
	TArray<FPetEquipmentCraftingInfo_FamilySlot> vCraftingInfo_ArmorSlot; // 0x398
	TArray<FPetEquipmentCraftingInfo_Style> vCraftingInfo_ArmorStyle; // 0x3a8
	TArray<UMOCraftingListEntry*> vCraftingPetEquipmentSlotGroups; // 0x3b8
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1a0
};

struct UMovieSceneGeometryCacheTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct USubmixEffectFlexiverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0xa0
};

struct UMovieSceneControlRigParameterTrack : UMovieSceneNameableTrack {
	UControlRig* ControlRig; // 0x88
	UMovieSceneSection* SectionToKey; // 0x90
	TArray<UMovieSceneSection*> Sections; // 0x98
	FName TrackName; // 0xa8
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMaterialExpressionShaderStageSwitch : UMaterialExpression {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct UMotoSynthSource : UObject {
	bool bConvertTo8Bit; // 0x28
	float DownSampleFactor; // 0x2c
	FRuntimeFloatCurve RPMCurve; // 0x30
	TArray<float> SourceData; // 0xb8
	TArray<int16_t> SourceDataPCM; // 0xc8
	int32_t SourceSampleRate; // 0xd8
	TArray<FGrainTableEntry> GrainTable; // 0xe0
};

struct UMOUserWidgetGMTabs : UMOUserWidget {
	TArray<UMOGMCharacterButtons*> vPanels; // 0x2c8
	UMOGMCharacterButtons* pCurrentPanel; // 0x2d8
	UMOUserWidgetTabButtonNew* pPanelTabButton_Teleport; // 0x2e0
	UMOGMCharacterButtons* pGMTabsPanel_Teleport; // 0x2e8
	UMOUserWidgetTabButtonNew* pPanelTabButton_VoipChat; // 0x2f0
	UMOGMCharacterButtons* pGMTabsPanel_VoipChat; // 0x2f8
	UMOUserWidgetTabButtonNew* pPanelTabButton_UserActions; // 0x300
	UMOGMCharacterButtons* pGMTabsPanel_UserActions; // 0x308
	UMOUserWidgetTabButtonNew* pPanelTabButton_QoL; // 0x310
	UMOGMCharacterButtons* pGMTabsPanel_QoL; // 0x318
	UMOUserWidgetTabButtonNew* pPanelTabButton_Logs; // 0x320
	UMOGMCharacterButtons* pGMTabsPanel_Logs; // 0x328
	UMOUserWidgetTabButtonNew* pPanelTabButton_Houses; // 0x330
	UMOGMCharacterButtons* pGMTabsPanel_Houses; // 0x338
	UMOUserWidgetTabButtonNew* pPanelTabButton_Ai; // 0x340
	UMOGMCharacterButtons* pGMTabsPanel_Ai; // 0x348
	UMOUserWidgetTabButtonNew* pPanelTabButton_Pets; // 0x350
	UMOGMCharacterButtons* pGMTabsPanel_Pets; // 0x358
	UMOGMHUD* pMOGMHUD; // 0x360
};

struct USequenceCameraShakeCameraStandIn : UObject {
	float FieldOfView; // 0x30
};

struct UMOSaveGame : USaveGame {
	FMOSaveData sData; // 0x28
};

struct UInteractiveToolPropertySet : UObject {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct UMaterialExpressionDynamicParameter : UMaterialExpression {
	TArray<FString> ParamNames; // 0x40
	FLinearColor DefaultValue; // 0x50
	uint32_t ParameterIndex; // 0x60
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UMOFrameBase : UMOUserWidget {
	TArray<UTexture2D*> vFlagIcons; // 0x2c8
	UTextBlock* pTextBlockCharacterName; // 0x2d8
	UMOUserWidgetProgressBar* pProgressBarHealth; // 0x2e0
	UTextBlock* pTextBlockHealth; // 0x2e8
	UImage* pCriminalImage; // 0x2f0
	UImage* pVoipIcon; // 0x2f8
	UBorder* pFrameBorder; // 0x308
};

struct UMOTooltipSkill : UUserWidget {
	UOverlay* pOverlay; // 0x260
	UTextBlock* pDisplaynameText; // 0x268
	UTextBlock* pDescriptionText; // 0x270
	UTextBlock* pUseDescriptionText; // 0x278
	UGridPanel* pMyGridPanel; // 0x280
};

struct UParticleModuleSpawn : UParticleModuleSpawnBase {
	FRawDistributionFloat Rate; // 0x38
	FRawDistributionFloat RateScale; // 0x68
	EParticleBurstMethod ParticleBurstMethod; // 0x98
	TArray<FParticleBurst> BurstList; // 0xa0
	FRawDistributionFloat BurstScale; // 0xb0
	char bApplyGlobalSpawnRateScale : 1; // 0xe0
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UAnimSet : UObject {
	char bAnimRotationOnly : 1; // 0x28
	TArray<FName> TrackBoneNames; // 0x30
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x40
	TArray<char> BoneUseAnimTranslation; // 0x50
	TArray<char> ForceUseMeshTranslation; // 0x60
	TArray<FName> UseTranslationBoneNames; // 0x70
	TArray<FName> ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98
};

struct UMovieSceneStringSection : UMovieSceneSection {
	FMovieSceneStringChannel StringCurve; // 0xe8
};

struct UAnimNotify_PlayMontageNotifyWindow : UAnimNotifyState {
	FName NotifyName; // 0x30
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct ASkeletalMeshActor : AActor {
	char bShouldDoAnimNotifies : 1; // 0x228
	char bWakeOnLevelStart : 1; // 0x228
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x230
	USkeletalMesh* ReplicatedMesh; // 0x238
	UPhysicsAsset* ReplicatedPhysAsset; // 0x240
	UMaterialInterface* ReplicatedMaterial0; // 0x248
	UMaterialInterface* ReplicatedMaterial1; // 0x250
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct AMOEquipmentActor : AActor {
	USceneComponent* SceneRootComponent; // 0x220
	UMOProjectileMovementComponent* ProjectileMovementComponent; // 0x228
	EEquipmentGroup EquipmentGroup; // 0x230
	bool bLocalTracePositionsNeedUpdate; // 0x231
	TArray<FVector> LocalTracePositions; // 0x238
	bool bAutoActivateExtraComponents; // 0x248
	TArray<UAudioComponent*> AudioComponents; // 0x250
	TArray<UNiagaraComponent*> NiagaraComponents; // 0x260
	TArray<UPointLightComponent*> PointLightComponents; // 0x270
	FTimerHandle TrailsActiveDurationTimer; // 0x280
};

struct URuntimeVirtualTextureComponent : USceneComponent {
	TSoftObjectPtr<AActor> BoundsAlignActor; // 0x1f8
	bool bSetBoundsButton; // 0x220
	bool bSnapBoundsToLandscape; // 0x221
	URuntimeVirtualTexture* VirtualTexture; // 0x228
	bool bEnableScalability; // 0x230
	uint32_t ScalabilityGroup; // 0x234
	bool bHidePrimitives; // 0x238
	UVirtualTextureBuilder* StreamingTexture; // 0x240
	int32_t StreamLowMips; // 0x248
	bool bBuildStreamingMipsButton; // 0x24c
	bool bEnableCompressCrunch; // 0x24d
	bool bUseStreamingLowMipsInEditor; // 0x24e
	bool bBuildDebugStreamingMips; // 0x24f
};

struct UMaterialExpressionSign : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UBTNode : UObject {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UReverbEffect : UObject {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UWindowTitleBarArea : UContentWidget {
	bool bWindowButtonsEnabled; // 0x120
	bool bDoubleClickTogglesFullscreen; // 0x121
};

struct UAnimBoneCompressionCodec : UObject {
	FString Description; // 0x28
};

struct UNiagaraSettings : UDeveloperSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UMOGMHUD : UMOUserWidget {
	UMOScrollBox* pMOScrollBox_Petitions; // 0x2c8
	UMOGMCharacterButtons* pMOGMCharacterButtons; // 0x2d0
	UMOUserWidgetGMTabs* pGMTabs; // 0x2d8
	UMOSimpleList* pSimpleListGM; // 0x2e0
	UMOSimpleList* pSimpleListGMSpawn; // 0x2e8
	UMOContainer* pGMInventory; // 0x2f0
	UMOGMOpenPetition* cGMOpenPetition; // 0x2f8
	UMOInventoryButtonItem* cInventoryItem; // 0x300
	FString GMDisplayName; // 0x310
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct AStaticMeshActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	bool bStaticMeshReplicateMovement; // 0x228
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UTireType : UDataAsset {
	float FrictionScale; // 0x30
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct AWaterBodyRiver : AWaterBody {
	URiverGenerator* RiverGenerator; // 0xdd0
	UMaterialInterface* LakeTransitionMaterial; // 0xdd8
	UMaterialInstanceDynamic* LakeTransitionMID; // 0xde0
	UMaterialInterface* OceanTransitionMaterial; // 0xde8
	UMaterialInstanceDynamic* OceanTransitionMID; // 0xdf0
};

struct UARMeshComponent : UARComponent {
	FARMeshUpdatePayload ReplicatedPayload; // 0x280
};

struct UProgressBar : UWidget {
	FProgressBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x2a8
	USlateBrushAsset* BackgroundImage; // 0x2b0
	USlateBrushAsset* FillImage; // 0x2b8
	USlateBrushAsset* MarqueeImage; // 0x2c0
	float Percent; // 0x2c8
	EProgressBarFillType BarFillType; // 0x2cc
	bool bIsMarquee; // 0x2cd
	FVector2D BorderPadding; // 0x2d0
	FDelegate PercentDelegate; // 0x2d8
	FLinearColor FillColorAndOpacity; // 0x2e8
	FDelegate FillColorAndOpacityDelegate; // 0x2f8
};

struct UInterpTrackParticleReplay : UInterpTrack {
	TArray<FParticleReplayTrackKey> TrackKeys; // 0x70
};

struct UImgMediaSettings : UObject {
	FFrameRate DefaultFrameRate; // 0x28
	float CacheBehindPercentage; // 0x30
	float CacheSizeGB; // 0x34
	int32_t CacheThreads; // 0x38
	int32_t CacheThreadStackSizeKB; // 0x3c
	float GlobalCacheSizeGB; // 0x40
	bool UseGlobalCache; // 0x44
	uint32_t ExrDecoderThreads; // 0x48
	FString DefaultProxy; // 0x50
	bool UseDefaultProxy; // 0x60
};

struct UParticleModuleBeamSource : UParticleModuleBeamBase {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UParticleModuleOrientationAxisLock : UParticleModuleOrientationBase {
	EParticleAxisLock LockAxisFlags; // 0x30
};

struct UPlatformInterfaceWebResponse : UObject {
	FString OriginalURL; // 0x28
	int32_t ResponseCode; // 0x38
	int32_t Tag; // 0x3c
	FString StringResponse; // 0x40
	TArray<char> BinaryResponse; // 0x50
};

struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	FSourceEffectChorusSettings Settings; // 0x108
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	EFireEventsAtPosition EventPosition; // 0x84
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UMaterialFunctionInstance : UMaterialFunctionInterface {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct UMOAnimInstanceFishingRod : UAnimInstance {
	UAnimSequenceBase* PullSequence; // 0x2b8
	float StringRestDistance; // 0x2c0
};

struct UMOButtonSpell : UMOButton {
	FRequiredSpellData sReqData; // 0x448
	UMaterialInstanceDynamic* pMaterialInstance; // 0x4d0
};

struct AVolumetricCloud : AInfo {
	UVolumetricCloudComponent* VolumetricCloudComponent; // 0x220
};

struct AEQSTestingPawn : ACharacter {
	UEnvQuery* QueryTemplate; // 0x4c0
	TArray<FEnvNamedValue> QueryParams; // 0x4c8
	TArray<FAIDynamicParam> QueryConfig; // 0x4d8
	float TimeLimitPerStep; // 0x4e8
	int32_t StepToDebugDraw; // 0x4ec
	EEnvQueryHightlightMode HighlightMode; // 0x4f0
	char bDrawLabels : 1; // 0x4f4
	char bDrawFailedItems : 1; // 0x4f4
	char bReRunQueryOnlyOnFinishedMove : 1; // 0x4f4
	char bShouldBeVisibleInGame : 1; // 0x4f4
	char bTickDuringGame : 1; // 0x4f4
	EEnvQueryRunMode QueryingMode; // 0x4f8
	FNavAgentProperties NavAgentProperties; // 0x500
};

struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x148
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c
	double MaxTimeSlicePerTick; // 0x150
	float HighImportanceQueryDistanceThreshold; // 0x158
	float MaxQueryImportance; // 0x160
	float SightLimitQueryImportance; // 0x164
};

struct UMOCheckBox : UCheckBox {
	USlateWidgetStyleAsset* CustomStyle; // 0x770
};

struct UMODataAssetTattooEffectCollection : UPrimaryDataAsset {
	TArray<UMODataAssetTattooEffect*> vTattooEffects; // 0x30
};

struct UMovieScene : UMovieSceneSignedObject {
	TArray<FMovieSceneSpawnable> Spawnables; // 0x50
	TArray<FMovieScenePossessable> Possessables; // 0x60
	TArray<FMovieSceneBinding> ObjectBindings; // 0x70
	TMap<FName, FMovieSceneObjectBindingIDs> BindingGroups; // 0x80
	TArray<UMovieSceneTrack*> MasterTracks; // 0xd0
	UMovieSceneTrack* CameraCutTrack; // 0xe0
	FMovieSceneFrameRange SelectionRange; // 0xe8
	FMovieSceneFrameRange PlaybackRange; // 0xf8
	FFrameRate TickResolution; // 0x108
	FFrameRate DisplayRate; // 0x110
	EMovieSceneEvaluationType EvaluationType; // 0x118
	EUpdateClockSource ClockSource; // 0x119
	FSoftObjectPath CustomClockSourcePath; // 0x120
	TArray<FMovieSceneMarkedFrame> MarkedFrames; // 0x138
};

struct UMOBrokerSellPetsPanel : UMOBrokerPanel {
	UMOBrokerCurrencyWidget* pMOBrokerCurrencyWidget; // 0x2d8
	UMOButton* pMOButton_Close; // 0x2e0
	UMOPetListEntry* pPetEntry_Sell; // 0x2e8
};

struct UMOMurderCount : UMOUserWidget {
	UMOWidgetBlueprint* cMurderCountListEntryClass; // 0x2d0
	TArray<UMOMurderCountEntry*> vMurderCountEntries; // 0x2d8
	UVerticalBox* pVerticalBox_Murderers; // 0x2e8
};

struct UWB_MOKeybindCategoryEntry_C : UMOCategoryEntry {
	UWB_CategoryLine_C* WB_MOKeybindCategoryLine; // 0x2d0
	UWB_CategoryLine_C* WB_MOKeybindCategoryLine_2; // 0x2d8
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UMovieSceneMediaPlayerPropertySection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLoop; // 0xf0
};

struct UCompressedImageSequenceProtocol : UImageSequenceProtocol {
	int32_t CompressionQuality; // 0xd8
};

struct USkeletalMeshLODSettings : UDataAsset {
	FPerPlatformInt MinLOD; // 0x30
	FPerPlatformBool DisableBelowMinLodStripping; // 0x34
	bool bOverrideLODStreamingSettings; // 0x35
	FPerPlatformBool bSupportLODStreaming; // 0x36
	FPerPlatformInt MaxNumStreamedLODs; // 0x38
	FPerPlatformInt MaxNumOptionalLODs; // 0x3c
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x40
};

struct UNiagaraDataInterfaceArray : UNiagaraDataInterface {
	int32_t MaxElements; // 0x40
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x68
};

struct ALevelScriptActor : AActor {
	char bInputEnabled : 1; // 0x220
};

struct UMediaComponent : UActorComponent {
	UMediaTexture* MediaTexture; // 0xb0
	UMediaPlayer* MediaPlayer; // 0xb8
};

struct UMOStatManager : UObject {
	UDataTable* exportData; // 0x28
};

struct UParticleModuleMeshRotationRateOverLife : UParticleModuleRotationRateBase {
	FRawDistributionVector RotRate; // 0x30
	char bScaleRotRate : 1; // 0x78
};

struct ABP_AiEffectAcid_C : AMOAiEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	FVector vHitLocation; // 0x278
};

struct UWB_MOOptions_New_C : UMOUserWidgetOptions {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	UWidgetAnimation* FadeIn; // 0x3a0
	UMOBorder* MOBorder_UnsavedChanges_2; // 0x3a8
	UCanvasPanel* OptionsPanel; // 0x3b0
	UMOButtonLarge* pMOButtonUnsavedChanges_No_2; // 0x3b8
	UMOButtonLarge* pMOButtonUnsavedChanges_Yes_2; // 0x3c0
};

struct UWB_MOOptionsAudioPanel_VoiceMeter_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UMOSlider* AutoActivateThreshold; // 0x268
	UImage* Image_1; // 0x270
	FMulticastInlineDelegate OnVoiceAutoActivationThresholdUpdated; // 0x278
	bool bVoiceAutoActivateEnabled; // 0x288
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UARTrackableNotifyComponent : UActorComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x110
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130
	FMulticastInlineDelegate OnAddTrackedImage; // 0x140
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160
	FMulticastInlineDelegate OnAddTrackedFace; // 0x170
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f0
};

struct UNiagaraDataInterfaceExport : UNiagaraDataInterface {
	FNiagaraUserParameterBinding CallbackHandlerParameter; // 0x38
	ENDIExport_GPUAllocationMode GPUAllocationMode; // 0x58
	int32_t GPUAllocationFixedSize; // 0x5c
	float GPUAllocationPerParticleSize; // 0x60
};

struct UMediaTexture : UTexture {
	TextureAddress AddressX; // 0xd8
	TextureAddress AddressY; // 0xd9
	bool AutoClear; // 0xda
	FLinearColor ClearColor; // 0xdc
	bool EnableGenMips; // 0xec
	char NumMips; // 0xed
	bool NewStyleOutput; // 0xee
	MediaTextureOutputFormat OutputFormat; // 0xef
	float CurrentAspectRatio; // 0xf0
	MediaTextureOrientation CurrentOrientation; // 0xf4
	UMediaPlayer* MediaPlayer; // 0xf8
};

struct AMOAvatarStaticMeshBuildable : AMOAvatarStaticMesh {
	TArray<FMOBuildableStates> vBuildableStates; // 0x2c8
	UStaticMeshComponent* pSignComponent; // 0x2d8
};

struct UWB_ButtonItem_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Pulse; // 0x268
	UMOButtonItem* ButtonItem; // 0x270
};

struct UNiagaraDataInterfaceRenderTarget2DArray : UNiagaraDataInterfaceRWBase {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x108
};

struct UParticleModuleVectorFieldScaleOverLife : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScaleOverLife; // 0x30
	FRawDistributionFloat VectorFieldScaleOverLifeRaw; // 0x38
};

struct UHapticFeedbackEffect_Buffer : UHapticFeedbackEffect_Base {
	TArray<char> Amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UNiagaraDataInterfaceAudioPlayer : UNiagaraDataInterface {
	USoundBase* SoundToPlay; // 0x38
	USoundAttenuation* Attenuation; // 0x40
	USoundConcurrency* Concurrency; // 0x48
	TArray<FName> ParameterNames; // 0x50
	bool bLimitPlaysPerTick; // 0x60
	int32_t MaxPlaysPerTick; // 0x64
	bool bStopWhenComponentIsDestroyed; // 0x68
};

struct URadialFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Radius; // 0xc0
	FVector Position; // 0xc4
	EFieldFalloffType Falloff; // 0xd0
};

struct UInAppPurchaseRestoreCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UDirectionalLightComponent : ULightComponent {
	float ShadowCascadeBiasDistribution; // 0x328
	char bEnableLightShaftOcclusion : 1; // 0x32c
	float OcclusionMaskDarkness; // 0x330
	float OcclusionDepthRange; // 0x334
	FVector LightShaftOverrideDirection; // 0x338
	float WholeSceneDynamicShadowRadius; // 0x344
	float DynamicShadowDistanceMovableLight; // 0x348
	float DynamicShadowDistanceStationaryLight; // 0x34c
	int32_t DynamicShadowCascades; // 0x350
	float CascadeDistributionExponent; // 0x354
	float CascadeTransitionFraction; // 0x358
	float ShadowDistanceFadeoutFraction; // 0x35c
	char bUseInsetShadowsForMovableObjects : 1; // 0x360
	int32_t FarShadowCascadeCount; // 0x364
	float FarShadowDistance; // 0x368
	float DistanceFieldShadowDistance; // 0x36c
	float LightSourceAngle; // 0x370
	float LightSourceSoftAngle; // 0x374
	float ShadowSourceAngleFactor; // 0x378
	float TraceDistance; // 0x37c
	char bUsedAsAtmosphereSunLight : 1; // 0x380
	int32_t AtmosphereSunLightIndex; // 0x384
	FLinearColor AtmosphereSunDiskColorScale; // 0x388
	char bPerPixelAtmosphereTransmittance : 1; // 0x398
	char bCastShadowsOnClouds : 1; // 0x398
	char bCastShadowsOnAtmosphere : 1; // 0x398
	char bCastCloudShadows : 1; // 0x398
	float CloudShadowStrength; // 0x39c
	float CloudShadowOnAtmosphereStrength; // 0x3a0
	float CloudShadowOnSurfaceStrength; // 0x3a4
	float CloudShadowDepthBias; // 0x3a8
	float CloudShadowExtent; // 0x3ac
	float CloudShadowMapResolutionScale; // 0x3b0
	float CloudShadowRaySampleCountScale; // 0x3b4
	FLinearColor CloudScatteredLuminanceScale; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3c8
	char bCastModulatedShadows : 1; // 0x3d8
	FColor ModulatedShadowColor; // 0x3dc
	float ShadowAmount; // 0x3e0
};

struct UDatasmithCineCameraComponentTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings; // 0x30
	FDatasmithCameraLensSettingsTemplate LensSettings; // 0x38
	FDatasmithCameraFocusSettingsTemplate FocusSettings; // 0x3c
	float CurrentFocalLength; // 0x44
	float CurrentAperture; // 0x48
	FDatasmithPostProcessSettingsTemplate PostProcessSettings; // 0x50
};

struct UMOText : UMOUserWidget {
	UTextBlock* pTextBlock; // 0x2c8
	FText InitializeText; // 0x2d0
	int32_t InitializeFontSize; // 0x2e8
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct UAnimSharingStateInstance : UAnimInstance {
	UAnimSequence* AnimationToPlay; // 0x2b8
	float PermutationTimeOffset; // 0x2c0
	float PlayRate; // 0x2c4
	bool bStateBool; // 0x2c8
	UAnimSharingInstance* Instance; // 0x2d0
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UNiagaraComponentRendererProperties : UNiagaraRendererProperties {
	USceneComponent* ComponentType; // 0x80
	uint32_t ComponentCountLimit; // 0x88
	FNiagaraVariableAttributeBinding EnabledBinding; // 0x90
	bool bAssignComponentsOnParticleID; // 0xe8
	bool bOnlyCreateComponentsOnParticleSpawn; // 0xe9
	USceneComponent* TemplateComponent; // 0xf0
	TArray<FNiagaraComponentPropertyBinding> PropertyBindings; // 0xf8
};

struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x4d0
	int32_t NumCustomDataFloats; // 0x4e0
	TArray<float> PerInstanceSMCustomData; // 0x4e8
	int32_t InstancingRandomSeed; // 0x4f8
	int32_t InstanceStartCullDistance; // 0x4fc
	int32_t InstanceEndCullDistance; // 0x500
	TArray<int32_t> InstanceReorderTable; // 0x508
	int32_t NumPendingLightmaps; // 0x560
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x568
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x48
	float LoopEnd; // 0x4c
	float DurationAfterLoop; // 0x50
	int32_t LoopCount; // 0x54
	char bLoopIndefinitely : 1; // 0x58
	char bLoop : 1; // 0x58
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x60
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x68
	FRuntimeFloatCurve VolumeCurve; // 0x70
	FRuntimeFloatCurve PitchCurve; // 0xf8
	float PitchMin; // 0x180
	float PitchMax; // 0x184
	float VolumeMin; // 0x188
	float VolumeMax; // 0x18c
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct UWB_ButtonSpellWidget_C : UMOButtonSpellWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
};

struct UStaticMeshSimulationComponent : UActorComponent {
	bool Simulating; // 0xb8
	bool bNotifyCollisions; // 0xb9
	EObjectStateTypeEnum ObjectType; // 0xba
	float Mass; // 0xbc
	ECollisionTypeEnum CollisionType; // 0xc0
	EImplicitTypeEnum ImplicitType; // 0xc1
	int32_t MinLevelSetResolution; // 0xc4
	int32_t MaxLevelSetResolution; // 0xc8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xcc
	FVector InitialLinearVelocity; // 0xd0
	FVector InitialAngularVelocity; // 0xdc
	float DamageThreshold; // 0xe8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xf0
	AChaosSolverActor* ChaosSolverActor; // 0xf8
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x100
	TArray<UPrimitiveComponent*> SimulatedComponents; // 0x120
};

struct UMovieSceneLevelVisibilitySection : UMovieSceneSection {
	ELevelVisibility Visibility; // 0xf0
	TArray<FName> LevelNames; // 0xf8
};

struct UMOItemSlot : UUserWidget {
	UMOButtonItem* pButtonItem; // 0x290
	UBorder* pButtonBorder; // 0x298
	UTextBlock* pStackNumber; // 0x2a0
};

struct ULiveLinkComponentSettings : UObject {
	TMap<ULiveLinkRole*, ULiveLinkControllerBase*> DefaultControllerForRole; // 0x28
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct AMOCharacterAIGeneratedTaskVendor : AMOCharacterAIGenerated {
	USoundCue* pOpenVendorMale; // 0xf98
	USoundCue* pCloseVendorMale; // 0xfa0
	USoundCue* pRefuseVendorMale; // 0xfa8
	USoundCue* pAcceptVendorMale; // 0xfb0
	USoundCue* pOpenVendorFemale; // 0xfb8
	USoundCue* pCloseVendorFemale; // 0xfc0
	USoundCue* pRefuseVendorFemale; // 0xfc8
	USoundCue* pAcceptVendorFemale; // 0xfd0
	USoundCue* pShoutOutVendorMale; // 0xfd8
	USoundCue* pShoutOutVendorFemale; // 0xfe0
};

struct URuntimeVirtualTexture : UObject {
	int32_t TileCount; // 0x28
	int32_t TileSize; // 0x2c
	int32_t TileBorderSize; // 0x30
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x34
	bool bCompressTextures; // 0x35
	bool bClearTextures; // 0x36
	bool bSinglePhysicalSpace; // 0x37
	bool bPrivateSpace; // 0x38
	bool bAdaptive; // 0x39
	bool bContinuousUpdate; // 0x3a
	int32_t RemoveLowMips; // 0x3c
	TextureGroup LODGroup; // 0x40
	int32_t Size; // 0x44
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	TArray<FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo; // 0x368
	char bIsLayerThumbnail : 1; // 0x378
	char bDisableTessellation : 1; // 0x378
	char bMobile : 1; // 0x378
	char bEditorToolUsage : 1; // 0x378
};

struct UMOFrameLocalPlayerMount : UMOFrameBase {
	UMOGameUserSettings* pMOGameUserSettings; // 0x328
	UMOUserWidgetProgressBar* pProgressBarStamina; // 0x330
	UTextBlock* pTextBlockStamina; // 0x338
};

struct UClothPhysicalMeshDataBase_Legacy : UObject {
	TArray<FVector> Vertices; // 0x28
	TArray<FVector> Normals; // 0x38
	TArray<uint32_t> Indices; // 0x48
	TArray<float> InverseMasses; // 0x58
	TArray<FClothVertBoneData> BoneData; // 0x68
	int32_t NumFixedVerts; // 0x78
	int32_t MaxBoneWeights; // 0x7c
	TArray<uint32_t> SelfCollisionIndices; // 0x80
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct UWB_MOOptionsVideoPanel_C : UMOUserWidgetOptionsVideo {
	UImage* Image_Line_UI; // 0x3a0
};

struct UAISense_Prediction : UAISense {
	TArray<FAIPredictionEvent> RegisteredEvents; // 0x80
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UMOButtonPlus : UMOButton {
	USlateWidgetStyleAsset* CustomStyle; // 0x438
};

struct UGizmoBoxComponent : UGizmoBaseComponent {
	FVector Origin; // 0x460
	FQuat Rotation; // 0x470
	FVector Dimensions; // 0x480
	float LineThickness; // 0x48c
	bool bRemoveHiddenLines; // 0x490
	bool bEnableAxisFlip; // 0x491
};

struct UMOUserWidgetOptionsAudio : UMOUserWidgetOptionsPanel {
	UMOGameInstance* pMOGameInstance; // 0x2d0
	UMOOptionSliderWidget* pSlider_Master; // 0x2d8
	UMOOptionSliderWidget* pSlider_Music; // 0x2e0
	UMOOptionSliderWidget* pSlider_Interface; // 0x2e8
	UMOOptionSliderWidget* pSlider_VoiceMaster; // 0x2f0
	UMOCheckBoxEntry* pCheckBox_VoiceChat; // 0x2f8
	UMOCheckBoxEntry* pCheckBox_VoiceActivation; // 0x300
	UMOComboBoxStringEntry* pMOComboBox_VoipOutputDevices; // 0x308
	UMOComboBoxStringEntry* pMOComboBox_VoipInputDevices; // 0x310
	UMOCheckBoxEntry* pCheckBox_TestVoice; // 0x318
};

struct UMaterialExpressionConstant : UMaterialExpression {
	float R; // 0x40
};

struct UNiagaraPreviewAxis_InterpParamVector2D : UNiagaraPreviewAxis_InterpParamBase {
	FVector2D Min; // 0x38
	FVector2D Max; // 0x40
};

struct UMaterialExpressionCollectionParameter : UMaterialExpression {
	UMaterialParameterCollection* Collection; // 0x40
	FName ParameterName; // 0x48
	FGuid ParameterId; // 0x50
};

struct UMODataAssetMagicDefinitions : UPrimaryDataAsset {
	UMODataAssetMagic* pFallbackEffect; // 0x30
	TMap<int32_t, TSoftObjectPtr<UMODataAssetMagic>> vMagicList; // 0x38
	bool bAllEffectsArePreloaded; // 0x88
	TMap<int32_t, UMODataAssetMagic*> vMagicListLoaded; // 0x90
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UMaterialExpressionBlendMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput A; // 0x40
	FMaterialAttributesInput B; // 0x58
	FExpressionInput Alpha; // 0x70
	EMaterialAttributeBlend PixelAttributeBlendType; // 0x84
	EMaterialAttributeBlend VertexAttributeBlendType; // 0x85
};

struct UDistributionFloatParameterBase : UDistributionFloatConstant {
	FName ParameterName; // 0x40
	float MinInput; // 0x48
	float MaxInput; // 0x4c
	float MinOutput; // 0x50
	float MaxOutput; // 0x54
	DistributionParamMode ParamMode; // 0x58
};

struct URichTextBlockImageDecorator : URichTextBlockDecorator {
	UDataTable* ImageSet; // 0x28
};

struct UWB_MOOptionsGameplayPanel_C : UMOUserWidgetOptionsGameplay {
	UImage* Image_Line_UI; // 0x368
};

struct UMaterialExpressionLandscapePhysicalMaterialOutput : UMaterialExpressionCustomOutput {
	TArray<FPhysicalMaterialInput> Inputs; // 0x40
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionParticleSubUV : UMaterialExpressionTextureSample {
	char bBlend : 1; // 0x60
};

struct APartyBeaconHost : AOnlineBeaconHostObject {
	UPartyBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct UMORenameUserWidget : UMOUserWidget {
	FString sOverrideValidChars; // 0x2c8
	int32_t iNameMinLength; // 0x2d8
	int32_t iNameMaxLength; // 0x2dc
	UMOButton* pMOButton_OK; // 0x2e0
	UMOButton* pMOButton_Cancel; // 0x2e8
	UMOEditableTextBox* pMOEditableText; // 0x2f0
};

struct UDefaultLevelSequenceInstanceData : UObject {
	AActor* TransformOriginActor; // 0x30
	FTransform TransformOrigin; // 0x40
};

struct UGizmoAxisScaleParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	float Parameter; // 0x6c
	FGizmoFloatParameterChange LastChange; // 0x70
	FVector CurScaleAxis; // 0x78
	FVector CurScaleOrigin; // 0x84
	FTransform InitialTransform; // 0x90
};

struct UMediaSoundComponent : USynthComponent {
	EMediaSoundChannels Channels; // 0x6c0
	bool DynamicRateAdjustment; // 0x6c4
	float RateAdjustmentFactor; // 0x6c8
	FFloatRange RateAdjustmentRange; // 0x6cc
	UMediaPlayer* MediaPlayer; // 0x6e0
};

struct ULevelCapture : UMovieSceneCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMapClass; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	FUniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray<UChannel*> ChannelsToTick; // 0x1518
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct UInteractiveGizmoManager : UObject {
	TArray<FActiveGizmo> ActiveGizmos; // 0x30
	TMap<FString, UInteractiveGizmoBuilder*> GizmoBuilders; // 0x58
};

struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	ENDIStaticMesh_SourceMode SourceMode; // 0x38
	UStaticMesh* DefaultMesh; // 0x40
	AActor* Source; // 0x48
	UStaticMeshComponent* SourceComponent; // 0x50
	FNDIStaticMeshSectionFilter SectionFilter; // 0x58
	bool bUsePhysicsBodyVelocity; // 0x68
	TArray<FName> FilteredSockets; // 0x70
};

struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	FVector Min; // 0x38
	FVector Max; // 0x44
};

struct UWB_TooltipItem_C : UMOTooltip {
	UCanvasPanel* CanvasPanel_1; // 0x298
	UImage* Image_Line; // 0x2a0
	UMOTextBlock_Title_Medium_Red_02* TitleText; // 0x2a8
	UTextBlock* WeightText; // 0x2b0
	UWP_CurrencyWidget_C* WP_CurrencyWidget; // 0x2b8
};

struct UMODataAssetTattooEffect : UPrimaryDataAsset {
	UMODataAssetTattooVisuals* pTattooVisuals; // 0x30
	UMaterialInterface* pTattooEffectPreviewMaterial; // 0x38
	ETattooEffectType eTattooType; // 0x40
	FColor CharCreation_UIColor; // 0x44
};

struct UInteractiveToolManager : UObject {
	UInteractiveTool* ActiveLeftTool; // 0x30
	UInteractiveTool* ActiveRightTool; // 0x38
	TMap<FString, UInteractiveToolBuilder*> ToolBuilders; // 0x90
};

struct UInterpData : UObject {
	float InterpLength; // 0x28
	float PathBuildTime; // 0x2c
	TArray<UInterpGroup*> InterpGroups; // 0x30
	UInterpCurveEdSetup* CurveEdSetup; // 0x40
	float EdSectionStart; // 0x48
	float EdSectionEnd; // 0x4c
	char bShouldBakeAndPrune : 1; // 0x50
	UInterpGroupDirector* CachedDirectorGroup; // 0x58
	TArray<FName> AllEventNames; // 0x60
};

struct UChaosClothConfig : UClothConfigCommon {
	EClothMassMode MassMode; // 0x28
	float UniformMass; // 0x2c
	float TotalMass; // 0x30
	float Density; // 0x34
	float MinPerParticleMass; // 0x38
	float EdgeStiffness; // 0x3c
	float BendingStiffness; // 0x40
	bool bUseBendingElements; // 0x44
	float AreaStiffness; // 0x48
	float VolumeStiffness; // 0x4c
	float StrainLimitingStiffness; // 0x50
	float LimitScale; // 0x54
	EChaosClothTetherMode TetherMode; // 0x58
	bool bUseGeodesicDistance; // 0x59
	float ShapeTargetStiffness; // 0x5c
	float CollisionThickness; // 0x60
	float FrictionCoefficient; // 0x64
	bool bUseSelfCollisions; // 0x68
	float SelfCollisionThickness; // 0x6c
	bool bUseLegacyBackstop; // 0x70
	float DampingCoefficient; // 0x74
	bool bUsePointBasedWindModel; // 0x78
	float DragCoefficient; // 0x7c
	float LiftCoefficient; // 0x80
	bool bUseGravityOverride; // 0x84
	float GravityScale; // 0x88
	FVector Gravity; // 0x8c
	float AnimDriveSpringStiffness; // 0x98
	FVector LinearVelocityScale; // 0x9c
	float AngularVelocityScale; // 0xa8
	bool bUseTetrahedralConstraints; // 0xac
	bool bUseThinShellVolumeConstraints; // 0xad
	bool bUseContinuousCollisionDetection; // 0xae
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	FGuid ObjectGuid; // 0x88
};

struct USoundNodeDialoguePlayer : USoundNode {
	FDialogueWaveParameter DialogueWaveParameter; // 0x48
	char bLooping : 1; // 0x68
};

struct UMovieSceneBindingOverrides : UObject {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x28
};

struct UGizmoComponentHitTarget : UObject {
	UPrimitiveComponent* Component; // 0x30
};

struct UGeometryCacheComponent : UMeshComponent {
	UGeometryCache* GeometryCache; // 0x468
	bool bRunning; // 0x470
	bool bLooping; // 0x471
	float StartTimeOffset; // 0x474
	float PlaybackSpeed; // 0x478
	int32_t NumTracks; // 0x47c
	float ElapsedTime; // 0x480
	float Duration; // 0x4b4
	bool bManualTick; // 0x4b8
};

struct AWaterBodyIsland : AActor {
	UWaterSplineComponent* SplineComp; // 0x228
};

struct UDatasmithStaticMeshGLTFImportData : UDatasmithStaticMeshImportData {
	FString SourceMeshName; // 0x28
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UGizmoRectangleComponent : UGizmoBaseComponent {
	FVector DirectionX; // 0x460
	FVector DirectionY; // 0x46c
	float OffsetX; // 0x478
	float OffsetY; // 0x47c
	float LengthX; // 0x480
	float LengthY; // 0x484
	float Thickness; // 0x488
	char SegmentFlags; // 0x48c
};

struct UAnimBoneCompressionSettings : UObject {
	TArray<UAnimBoneCompressionCodec*> Codecs; // 0x28
};

struct ABP_Login_Camera_C : AMOCineCameraActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x810
	EMOPaperdollActorType LookForPaperdollType; // 0x818
};

struct UMOAssetManager : UAssetManager {
	bool bHasLoadedPlayerDefinitions; // 0x458
	TMap<FPrimaryAssetId, UMODataAssetPlayerBaseDefinition*> PlayerBodyDefinitions; // 0x460
};

struct UMaterialExpressionSetMaterialAttributes : UMaterialExpression {
	TArray<FExpressionInput> Inputs; // 0x40
	TArray<FGuid> AttributeSetTypes; // 0x50
};

struct UNiagaraDataInterfaceAudioOscilloscope : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
	int32_t Resolution; // 0x40
	float ScopeInMilliseconds; // 0x44
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct ULakeCollisionComponent : UPrimitiveComponent {
	UBodySetup* CachedBodySetup; // 0x440
	FVector BoxExtent; // 0x448
};

struct UAmbisonicsEncodingSettings : USoundfieldEncodingSettingsBase {
	int32_t AmbisonicsOrder; // 0x28
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb0
	float LOSHearingThreshold; // 0xb4
	float SightRadius; // 0xb8
	float SensingInterval; // 0xbc
	float HearingMaxSoundAge; // 0xc0
	char bEnableSensingUpdates : 1; // 0xc4
	char bOnlySensePlayers : 1; // 0xc4
	char bSeePawns : 1; // 0xc4
	char bHearNoises : 1; // 0xc4
	FMulticastInlineDelegate OnSeePawn; // 0xd0
	FMulticastInlineDelegate OnHearNoise; // 0xe0
	float PeripheralVisionAngle; // 0xf0
	float PeripheralVisionCosine; // 0xf4
};

struct UInputBehaviorSet : UObject {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct UInAppPurchaseCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UGizmoComponentAxisSource : UObject {
	USceneComponent* Component; // 0x30
	int32_t AxisIndex; // 0x38
	bool bLocalAxes; // 0x3c
};

struct UMOItemListEntry : UMOWidgetBlueprint {
	UButton* pButton; // 0x270
	UTextBlock* pTextBlockItemName; // 0x278
	UMOCurrencyWidget* pCurrencyWidget; // 0x280
	UMOItemSlotStatic* pItemSlot; // 0x288
	UMOUserWidget* pParentWidget; // 0x290
	UMOScrollBox* pParentScrollBox; // 0x298
};

struct UParticleModuleSize_Seeded : UParticleModuleSize {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UARTrackedObject : UARTrackedGeometry {
	UARCandidateObject* DetectedObject; // 0xf8
};

struct UWB_ButtonPetSkillWidget_C : UMOButtonPetSkillWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UAnimInstance : UObject {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct UMaterialExpressionHairColor : UMaterialExpression {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct AMOEquipmentActorQuiver : AMOEquipmentActorStaticMesh {
	bool bRefreshArrowsOnly; // 0x298
	int32_t NumVisibleArrows; // 0x29c
};

struct UMeshMergeComponent : UProceduralMeshComponent {
	UMaterialInterface* pFallbackMaterial; // 0x4d0
	TArray<UMaterialInstanceDynamic*> vCombinedMaterials; // 0x4d8
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct UDatasmithPostProcessVolumeTemplate : UDatasmithObjectTemplate {
	FDatasmithPostProcessSettingsTemplate Settings; // 0x30
	char bEnabled : 1; // 0x70
	char bUnbound : 1; // 0x70
};

struct UMOAudioComponentPoolSubsystem : UMOWorldSubsystemBase {
	AMOAudioComponentPoolSubsystemActor* AudioComponentPoolActor; // 0x38
};

struct UMOButtonSmall : UMOButton {
	USlateWidgetStyleAsset* CustomStyle; // 0x438
};

struct UMOSkillsVeteran : UMOWidgetBlueprint {
	FString ActionListEntryLabel; // 0x260
	FText ProffessionsListEntryLabel; // 0x270
	UTextBlock* pTextBlockPointsToSpend; // 0x288
	UTextBlock* pTextBlockPointsInCrafting; // 0x290
	UTextBlock* pTextBlockPointsInActions; // 0x298
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UAnimSequenceBase : UAnimationAsset {
	TArray<FAnimNotifyEvent> Notifies; // 0x80
	float SequenceLength; // 0x90
	float RateScale; // 0x94
	FRawCurveTracks RawCurveData; // 0x98
};

struct UStreamingSettings : UDeveloperSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UInterpTrackInstDirector : UInterpTrackInst {
	AActor* OldViewTarget; // 0x28
};

struct UScaleBox : UContentWidget {
	EStretch Stretch; // 0x120
	EStretchDirection StretchDirection; // 0x121
	float UserSpecifiedScale; // 0x124
	bool IgnoreInheritedScale; // 0x128
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x440
	FInterpCurveVector SplineInfo; // 0x4b0
	FInterpCurveQuat SplineRotInfo; // 0x4c8
	FInterpCurveVector SplineScaleInfo; // 0x4e0
	FInterpCurveFloat SplineReparamTable; // 0x4f8
	bool bAllowSplineEditingPerInstance; // 0x510
	int32_t ReparamStepsPerSegment; // 0x514
	float Duration; // 0x518
	bool bStationaryEndpoints; // 0x51c
	bool bSplineHasBeenEdited; // 0x51d
	bool bModifiedByConstructionScript; // 0x51e
	bool bInputSplinePointsToConstructionScript; // 0x51f
	bool bDrawDebug; // 0x520
	bool bClosedLoop; // 0x521
	bool bLoopPositionOverride; // 0x522
	float LoopPosition; // 0x524
	FVector DefaultUpVector; // 0x528
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	UDataTable* TextStyleSet; // 0x140
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x148
	bool bOverrideDefaultStyle; // 0x158
	FTextBlockStyle DefaultTextStyleOverride; // 0x160
	float MinDesiredWidth; // 0x3d0
	ETextTransformPolicy TextTransformPolicy; // 0x3d4
	FTextBlockStyle DefaultTextStyle; // 0x3d8
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x648
};

struct UDebugCameraControllerSettings : UDeveloperSettings {
	TArray<FDebugCameraControllerSettingsViewModeIndex> CycleViewModes; // 0x38
};

struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	FProgressBarStyle ProgressBarStyle; // 0x30
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x148
};

struct ULocalLightComponent : ULightComponent {
	ELightUnits IntensityUnits; // 0x328
	float Radius; // 0x32c
	float AttenuationRadius; // 0x330
	FLightmassPointLightSettings LightmassSettings; // 0x334
};

struct UBlendSpaceBase : UAnimationAsset {
	bool bRotationBlendInMeshSpace; // 0x88
	float AnimLength; // 0x8c
	FInterpolationParameter InterpolationParam[0x3]; // 0x90
	float TargetWeightInterpolationSpeedPerSec; // 0xa8
	ENotifyTriggerMode NotifyTriggerMode; // 0xac
	TArray<FPerBoneInterpolation> PerBoneBlend; // 0xb0
	int32_t SampleIndexWithMarkers; // 0xc0
	TArray<FBlendSample> SampleData; // 0xc8
	TArray<FEditorElement> GridSamples; // 0xd8
	FBlendParameter BlendParameters[0x3]; // 0xe8
};

struct USoundNodeModulatorContinuous : USoundNode {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x68
};

struct UActorSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x68
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1f8
	int32_t VirtualUserIndex; // 0x218
	int32_t PointerIndex; // 0x21c
	ECollisionChannel TraceChannel; // 0x220
	float InteractionDistance; // 0x224
	EWidgetInteractionSource InteractionSource; // 0x228
	bool bEnableHitTesting; // 0x229
	bool bShowDebug; // 0x22a
	float DebugSphereLineThickness; // 0x22c
	float DebugLineThickness; // 0x230
	FLinearColor DebugColor; // 0x234
	FHitResult CustomHitResult; // 0x2c0
	FVector2D LocalHitLocation; // 0x34c
	FVector2D LastLocalHitLocation; // 0x354
	UWidgetComponent* HoveredWidgetComponent; // 0x360
	FHitResult LastHitResult; // 0x368
	bool bIsHoveredWidgetInteractable; // 0x3f4
	bool bIsHoveredWidgetFocusable; // 0x3f5
	bool bIsHoveredWidgetHitTestVisible; // 0x3f6
};

struct UMOAnimNotifyFootStep : UMOAnimNotify {
	bool bLeft; // 0x38
};

struct UMOBrokerSellOrdersPanel : UMOBrokerPanel {
	UMOBrokerCurrencyWidget* pMOBrokerCurrencyWidget; // 0x2d8
	UMOButton* pMOButton_Close; // 0x2e0
	UMOItemSlotPlaceItem* pItemSlot; // 0x2e8
};

struct UMOChildActorEquipmentComponent : UChildActorComponent {
	bool bAutoActivateExtraComponents; // 0x230
	EEquipmentGroup EquipmentType; // 0x231
	FMOWeaponData WeaponData; // 0x238
	FMOShieldData ShieldData; // 0x268
	FMOBowData BowData; // 0x298
	FMOArrowData arrowData; // 0x2c0
	FMOArmorPartData ArmorData; // 0x2e8
	FMOArmorPartData PetEquipmentData; // 0x310
	ESex ArmorSex; // 0x338
	ESpecies ArmorSpecies; // 0x339
	bool bEquipmentActorNeedsUpdate; // 0x33a
	bool bArrowOnBowNeedsUpdate; // 0x33b
	bool bChildActorMeshAndTextureUseMaxDetail; // 0x33c
	bool bAutoDestroyChildActorOnInvalidData; // 0x33d
};

struct ABP_MortalOnlinePlayerController_C : AMOPlayerController {
	FPointerToUberGraphFrame UberGraphFrame; // 0x8b8
};

struct UAutomationTestSettings : UObject {
	TArray<FString> EngineTestModules; // 0x28
	TArray<FString> EditorTestModules; // 0x38
	FSoftObjectPath AutomationTestmap; // 0x48
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x60
	TArray<FSoftObjectPath> AssetsToOpen; // 0x70
	TArray<FString> MapsToPIETest; // 0x80
	FBuildPromotionTestSettings BuildPromotionTest; // 0x90
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x280
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2b0
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2c0
	TArray<FString> TestLevelFolders; // 0x2f0
	TArray<FExternalToolDefinition> ExternalTools; // 0x300
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x310
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x320
	FIntPoint DefaultScreenshotResolution; // 0x330
	float PIETestDuration; // 0x338
};

struct UMovieSceneSlomoSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct AMOEquipmentActorPetEquipment : AMOEquipmentActor {
	USkeletalMeshComponent* PetEquipmentComponent; // 0x288
	USkeletalMeshComponent* MasterPoseComponentOverride; // 0x290
	FMOEquipmentActorPetEquipmentData PetEquipmentData; // 0x298
};

struct UMaterialExpression : UObject {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UParticleModuleSourceMovement : UParticleModuleLocationBase {
	FRawDistributionVector SourceMovementScale; // 0x30
};

struct UMOCharacterCollisionPoolSubsystem : UMOWorldSubsystemBase {
	AMOCharacterCollisionPoolSubsystemActor* CollisionPoolActor; // 0x38
};

struct ASpiritArm_C : AMOSpiritArm {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UChildActorComponent* BP_Orb; // 0x2e8
	USphereComponent* Sphere; // 0x2f0
	UStaticMeshComponent* StaticMesh1; // 0x2f8
	UNiagaraComponent* Niagara; // 0x300
	UStaticMeshComponent* StaticMesh; // 0x308
};

struct USafeZoneSlot : UPanelSlot {
	bool bIsTitleSafe; // 0x38
	FMargin SafeAreaScale; // 0x3c
	EHorizontalAlignment HAlign; // 0x4c
	EVerticalAlignment VAlign; // 0x4d
	FMargin Padding; // 0x50
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct AMOTestingDummy : AActor {
	UParticleSystem* pParticleSystem_SwingBloodTrail; // 0x220
	FString sName; // 0x228
};

struct ABP_MOCharacterAI_Creature_C : AMOCharacterAICreature {
	FPointerToUberGraphFrame UberGraphFrame; // 0xdb0
	float DeathEffectTimeline_fDissolveSkeleton_5635A14B4D106716143DBBB0A9BA9FDA; // 0xdb8
	float DeathEffectTimeline_fMeshTranslation_5635A14B4D106716143DBBB0A9BA9FDA; // 0xdbc
	float DeathEffectTimeline_fDissolveBody_5635A14B4D106716143DBBB0A9BA9FDA; // 0xdc0
	ETimelineDirection DeathEffectTimeline__Direction_5635A14B4D106716143DBBB0A9BA9FDA; // 0xdc4
	UTimelineComponent* DeathEffectTimeline; // 0xdc8
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UMorphTarget : UObject {
	USkeletalMesh* BaseSkelMesh; // 0x28
};

struct UWindDirectionalSourceComponent : USceneComponent {
	float Strength; // 0x1f8
	float Speed; // 0x1fc
	float MinGustAmount; // 0x200
	float MaxGustAmount; // 0x204
	float Radius; // 0x208
	char bPointWind : 1; // 0x20c
};

struct USubmixEffectMultibandCompressorPreset : USoundEffectSubmixPreset {
	FSubmixEffectMultibandCompressorSettings Settings; // 0xb0
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterialMask* PhysMaterialMask; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	FScalarMaterialInput Metallic; // 0xd8
	FScalarMaterialInput Specular; // 0xec
	FScalarMaterialInput Anisotropy; // 0x100
	FVectorMaterialInput Normal; // 0x114
	FVectorMaterialInput Tangent; // 0x128
	FColorMaterialInput EmissiveColor; // 0x13c
	EMaterialDomain MaterialDomain; // 0x150
	EBlendMode BlendMode; // 0x151
	EDecalBlendMode DecalBlendMode; // 0x152
	EMaterialDecalResponse MaterialDecalResponse; // 0x153
	EMaterialShadingModel ShadingModel; // 0x154
	char bCastDynamicShadowAsMasked : 1; // 0x155
	FMaterialShadingModelField ShadingModels; // 0x156
	float OpacityMaskClipValue; // 0x158
	FVectorMaterialInput WorldPositionOffset; // 0x15c
	FScalarMaterialInput Refraction; // 0x170
	FMaterialAttributesInput MaterialAttributes; // 0x184
	FScalarMaterialInput PixelDepthOffset; // 0x19c
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b0
	char bEnableSeparateTranslucency : 1; // 0x1c4
	char bEnableResponsiveAA : 1; // 0x1c4
	char bScreenSpaceReflections : 1; // 0x1c4
	char bContactShadows : 1; // 0x1c4
	char TwoSided : 1; // 0x1c4
	char DitheredLODTransition : 1; // 0x1c4
	char DitherOpacityMask : 1; // 0x1c4
	char bAllowNegativeEmissiveColor : 1; // 0x1c4
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1c5
	char bEnableMobileSeparateTranslucency : 1; // 0x1c6
	int32_t NumCustomizedUVs; // 0x1c8
	float TranslucencyDirectionalLightingIntensity; // 0x1cc
	float TranslucentShadowDensityScale; // 0x1d0
	float TranslucentSelfShadowDensityScale; // 0x1d4
	float TranslucentSelfShadowSecondDensityScale; // 0x1d8
	float TranslucentSelfShadowSecondOpacity; // 0x1dc
	float TranslucentBackscatteringExponent; // 0x1e0
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1e4
	float TranslucentShadowStartOffset; // 0x1f4
	char bDisableDepthTest : 1; // 0x1f8
	char bWriteOnlyAlpha : 1; // 0x1f8
	char bGenerateSphericalParticleNormals : 1; // 0x1f8
	char bTangentSpaceNormal : 1; // 0x1f8
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x1f8
	char bBlockGI : 1; // 0x1f8
	char bUsedAsSpecialEngineMaterial : 1; // 0x1f8
	char bUsedWithSkeletalMesh : 1; // 0x1f8
	char bUsedWithEditorCompositing : 1; // 0x1f9
	char bUsedWithParticleSprites : 1; // 0x1f9
	char bUsedWithBeamTrails : 1; // 0x1f9
	char bUsedWithMeshParticles : 1; // 0x1f9
	char bUsedWithNiagaraSprites : 1; // 0x1f9
	char bUsedWithNiagaraRibbons : 1; // 0x1f9
	char bUsedWithNiagaraMeshParticles : 1; // 0x1f9
	char bUsedWithGeometryCache : 1; // 0x1f9
	char bUsedWithStaticLighting : 1; // 0x1fa
	char bUsedWithMorphTargets : 1; // 0x1fa
	char bUsedWithSplineMeshes : 1; // 0x1fa
	char bUsedWithInstancedStaticMeshes : 1; // 0x1fa
	char bUsedWithGeometryCollections : 1; // 0x1fa
	char bUsesDistortion : 1; // 0x1fa
	char bUsedWithClothing : 1; // 0x1fa
	char bUsedWithWater : 1; // 0x1fc
	char bUsedWithHairStrands : 1; // 0x1fc
	char bUsedWithLidarPointCloud : 1; // 0x1fc
	char bUsedWithVirtualHeightfieldMesh : 1; // 0x1fc
	char bUsedWithUI : 1; // 0x200
	char bAutomaticallySetUsageInEditor : 1; // 0x200
	char bFullyRough : 1; // 0x200
	char bUseFullPrecision : 1; // 0x200
	char bUseLightmapDirectionality : 1; // 0x200
	char bUseAlphaToCoverage : 1; // 0x200
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x204
	char bUseHQForwardReflections : 1; // 0x208
	char bUsePlanarForwardReflections : 1; // 0x208
	char bNormalCurvatureToRoughness : 1; // 0x208
	EMaterialTessellationMode D3D11TessellationMode; // 0x209
	char bEnableCrackFreeDisplacement : 1; // 0x20a
	char bEnableAdaptiveTessellation : 1; // 0x20a
	char AllowTranslucentCustomDepthWrites : 1; // 0x20a
	char Wireframe : 1; // 0x20a
	EMaterialShadingRate ShadingRate; // 0x20b
	char bCanMaskedBeAssumedOpaque : 1; // 0x20c
	char bIsMasked : 1; // 0x20c
	char bIsPreviewMaterial : 1; // 0x20c
	char bIsFunctionPreviewMaterial : 1; // 0x20c
	char bUseMaterialAttributes : 1; // 0x20c
	char bCastRayTracedShadows : 1; // 0x20c
	char bUseTranslucencyVertexFog : 1; // 0x20c
	char bApplyCloudFogging : 1; // 0x20c
	char bIsSky : 1; // 0x20d
	char bComputeFogPerPixel : 1; // 0x20d
	char bOutputTranslucentVelocity : 1; // 0x20d
	char bAllowDevelopmentShaderCompile : 1; // 0x20d
	char bIsMaterialEditorStatsMaterial : 1; // 0x20d
	EBlendableLocation BlendableLocation; // 0x20e
	char BlendableOutputAlpha : 1; // 0x20f
	char bEnableStencilTest : 1; // 0x20f
	EMaterialStencilCompare StencilCompare; // 0x210
	char StencilRefValue; // 0x211
	ERefractionMode RefractionMode; // 0x212
	int32_t BlendablePriority; // 0x214
	char bIsBlendable : 1; // 0x218
	uint32_t UsageFlagWarnings; // 0x21c
	float RefractionDepthBias; // 0x220
	FGuid StateId; // 0x224
	float MaxDisplacement; // 0x234
	FMaterialCachedExpressionData CachedExpressionData; // 0x268
};

struct UScrollBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FScrollBoxStyle ScrollBoxStyle; // 0x30
};

struct UShowLoginUICallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UParticleModule : UObject {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct UMovieSceneCameraShakeSourceTriggerSection : UMovieSceneSection {
	FMovieSceneCameraShakeSourceTriggerChannel Channel; // 0xe8
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xb0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xb8
};

struct AMOEquipmentActorStaticMesh : AMOEquipmentActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x288
	UStaticMesh* StaticMesh; // 0x290
};

struct UPhysicsConstraintComponent : USceneComponent {
	AActor* ConstraintActor1; // 0x1f8
	FConstrainComponentPropName ComponentName1; // 0x200
	AActor* ConstraintActor2; // 0x208
	FConstrainComponentPropName ComponentName2; // 0x210
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x228
	FMulticastInlineDelegate OnConstraintBroken; // 0x230
	FConstraintInstance ConstraintInstance; // 0x240
};

struct UMaterialExpressionPanner : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	FExpressionInput Speed; // 0x68
	float SpeedX; // 0x7c
	float SpeedY; // 0x80
	uint32_t ConstCoordinate; // 0x84
	bool bFractionalPart; // 0x88
};

struct UInterpTrackInstColorProp : UInterpTrackInstProperty {
	FColor ResetColor; // 0x58
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UDatasmithFBXSceneImportData : UDatasmithSceneImportData {
	bool bGenerateLightmapUVs; // 0x28
	FString TexturesDir; // 0x30
	char IntermediateSerialization; // 0x40
	bool bColorizeMaterials; // 0x41
};

struct USphereReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadius; // 0x270
	float CaptureDistanceScale; // 0x274
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
};

struct UCharacterCompositionComponent : UActorComponent {
	bool bControlledByCompositionSubsystem; // 0xb0
	bool bPreviewEditorProxy; // 0xb1
	FCharacterCompositionPart EditorProxy; // 0xc0
	TMap<FName, FCharacterCompositionPart> Parts; // 0x210
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xb0
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct APaperSpriteActor : AActor {
	UPaperSpriteComponent* RenderComponent; // 0x220
};

struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct AMOCineCameraActor : ACineCameraActor {
	EMOMainMenuCameraAssignment CameraAssignment; // 0x800
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UMOQuestWidget : UMOUserWidget {
	UVerticalBox* pQuestVerticalBox; // 0x2c8
	UMOQuestEntry* cMOQuestEntry; // 0x2d0
	TArray<UMOQuestEntry*> vQuests; // 0x2d8
};

struct ULevelSequenceBurnIn : UUserWidget {
	FLevelSequencePlayerSnapshot FrameInformation; // 0x260
	ALevelSequenceActor* LevelSequenceActor; // 0x318
};

struct UMODataAssetMagic : UMODataAssetMagicShared {
	AMOMagicEffectBall* cMagicBallEffectClass; // 0x30
	UNiagaraSystem* pFingerBeam; // 0x38
};

struct UInputKeySelector : UWidget {
	FButtonStyle WidgetStyle; // 0x108
	FTextBlockStyle TextStyle; // 0x380
	FInputChord SelectedKey; // 0x5f0
	FSlateFontInfo Font; // 0x610
	FMargin Margin; // 0x668
	FLinearColor ColorAndOpacity; // 0x678
	FText KeySelectionText; // 0x688
	FText NoKeySpecifiedText; // 0x6a0
	bool bAllowModifierKeys; // 0x6b8
	bool bAllowGamepadKeys; // 0x6b9
	TArray<FKey> EscapeKeys; // 0x6c0
	FMulticastInlineDelegate OnKeySelected; // 0x6d0
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6e0
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UInteractiveToolsContext : UObject {
	UInputRouter* InputRouter; // 0x58
	UInteractiveToolManager* ToolManager; // 0x60
	UInteractiveGizmoManager* GizmoManager; // 0x68
	TSoftClassPtr<UObject> ToolManagerClass; // 0x70
};

struct URetainerBox : UContentWidget {
	bool bRetainRender; // 0x120
	bool RenderOnInvalidation; // 0x121
	bool RenderOnPhase; // 0x122
	int32_t Phase; // 0x124
	int32_t PhaseCount; // 0x128
	UMaterialInterface* EffectMaterial; // 0x130
	FName TextureParameter; // 0x138
};

struct UARTrackedPose : UARTrackedGeometry {
	FARPose3D TrackedPose; // 0xf8
};

struct UControlRigComponent : UPrimitiveComponent {
	UControlRig* ControlRigClass; // 0x440
	FMulticastInlineDelegate OnPostInitializeDelegate; // 0x448
	FMulticastInlineDelegate OnPreSetupDelegate; // 0x458
	FMulticastInlineDelegate OnPostSetupDelegate; // 0x468
	FMulticastInlineDelegate OnPreUpdateDelegate; // 0x478
	FMulticastInlineDelegate OnPostUpdateDelegate; // 0x488
	TArray<FControlRigComponentMappedElement> MappedElements; // 0x498
	bool bResetTransformBeforeTick; // 0x4a8
	bool bResetInitialsBeforeSetup; // 0x4a9
	bool bUpdateRigOnTick; // 0x4aa
	bool bUpdateInEditor; // 0x4ab
	bool bDrawBones; // 0x4ac
	UControlRig* ControlRig; // 0x4b0
};

struct UMOHUD : UUserWidget {
	TArray<UMOUserWidget*> vOpenWindows; // 0x260
	TArray<UMOContainer*> vContainers; // 0x270
	UCanvasPanel* pCanvasPanel; // 0x280
	FIntPoint ipCurResolution; // 0x298
	FVector2D CursorPos_OnStart; // 0x2a0
	FVector2D WidgetPos_OnMoveStart; // 0x2a8
	UMOUserWidget* pDragMOWidget; // 0x2b0
	bool bShouldHideTargetFrame; // 0x2b8
	UMOFrameLocalPlayer* pMOFrameLocalPlayer; // 0x2c0
	UMOFrameLocalPlayerMount* pMOFrameLocalPlayerMount; // 0x2c8
	UMOFrameBase* pMOFrameTarget; // 0x2d0
	UMOCrosshair* pMOCrosshair; // 0x2d8
	UMOGameMessage* pMOGameMessage; // 0x2e0
	UMOStunTimer* pMOStunTimer; // 0x2e8
	UMOPaperdoll* pPaperdoll; // 0x2f0
	UMOSimpleList* pMOSimpleList; // 0x2f8
	UMOPopupMessage* pMOPopupMessage; // 0x300
	UMOWorldMap* pWorldMap; // 0x308
	UMOMessageBox* pMessageBox; // 0x310
	UMOGameMenu* pGameMenu; // 0x318
	UMODamageVingette* pDamageVingette; // 0x320
	UMODamageDirectionIndcatorPool* pDamageDirectionIndcatorPool; // 0x328
	UMOChatGUI* pChatLog; // 0x330
	UMOSkills* pSkills; // 0x338
	UMOVendor* pVendor; // 0x340
	UMOTrade* pTrade; // 0x348
	UMOMurderCount* pMurderCount; // 0x350
	UMOActionBar* pActionBar0; // 0x358
	UMOActionBar* pActionBar1; // 0x360
	UMOActionBar* pActionBar2; // 0x368
	UMOActionBar* pActionBar3; // 0x370
	UMOUserWidgetCompassHUD* pCompassHUD; // 0x378
	UTextBlock* pAlphaBuildNumber; // 0x380
	UMODialogSystem* pDialogSystem; // 0x388
	UMOCraftingMelee* pCraftingMelee; // 0x390
	UMOCraftingShield* pCraftingShield; // 0x398
	UMOCraftingBow* pCraftingBow; // 0x3a0
	UMOCraftingArmor* pCraftingArmor; // 0x3a8
	UMOCraftingPetEquipment* pCraftingPetEquipment; // 0x3b0
	UMOExtraction* pExtraction; // 0x3b8
	UMORefining* pRefining; // 0x3c0
	UMOSkinning* pSkinning; // 0x3c8
	UMOCooking* pCooking; // 0x3d0
	UMOAlchemy* pAlchemy; // 0x3d8
	UMOHintWidget* pHintWidget; // 0x3e0
	UMOSocial* pSocial; // 0x3e8
	UMOGuildStone* pGuildStone; // 0x3f0
	UMOSpellbook* pSpellBook; // 0x3f8
	UMOPets* pPets; // 0x400
	UMOStables* pStables; // 0x408
	UMOPerformanceStatsOverlay* pPerformanceOverlay; // 0x410
	UUserWidget* cContainerClass; // 0x418
	UMOUserWidgetOptions* pMOOptions; // 0x428
	UMOButtonShortcuts* pButtonShortcuts; // 0x430
	UMOBroker* pMOBroker; // 0x438
	UMOMail* pMOMail; // 0x440
	UMOFanfare* pFanfare; // 0x448
	UMOHavenCitySelect* pHavenCitySelect; // 0x450
	UMOHavenInstanceSelect* pHavenInstanceSelect; // 0x458
	UMOTask* pMOTask; // 0x460
	UMOJournal* pMOJournal; // 0x468
	UMOBuildable* pMOBuildable; // 0x470
	UMOScribingPanel* pScribingPanel; // 0x478
	UMOFishingEquipment* pFishingEquipment; // 0x480
	bool shouldHideShortcutWidget; // 0x488
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FSpectatorReservation PendingReservation; // 0x2f0
	ESpectatorClientRequestType RequestType; // 0x368
	bool bPendingReservationSent; // 0x369
	bool bCancelReservation; // 0x36a
};

struct URiverGenerator : UWaterBodyGenerator {
	TArray<USplineMeshComponent*> SplineMeshComponents; // 0x28
};

struct UMOPets : UMOUserWidget {
	FTimerHandle MemberTimerHandle; // 0x2c8
	int32_t iCurTimerRepeats; // 0x2d0
	UTexture2D* pPetAttackIconTexture; // 0x2d8
	UTexture2D* pPetFollowIconTexture; // 0x2e0
	UTexture2D* pPetStayIconTexture; // 0x2e8
	UTexture2D* pPetOpenBagsIconTexture; // 0x2f0
	TArray<FMOPetData> vPetData; // 0x2f8
	UMOUserWidgetTabManager* pMOUserWidgetTabManager; // 0x308
	TArray<UMOUserWidgetTabButtonNew*> vTabButtons; // 0x310
	UMOUserWidgetTabButtonNew* pTabButtonNewText_All; // 0x320
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_1; // 0x328
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_2; // 0x330
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_3; // 0x338
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_4; // 0x340
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_5; // 0x348
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_6; // 0x350
	UMOUserWidgetTabButtonNew* pTabButtonNewText_Pet_7; // 0x358
	UMOPetsAll* pPanelPetsAll; // 0x360
	UMOPetsInfo* pPanelPetsInfo; // 0x368
	UMOPetListEntry* cPetListEntryClass; // 0x370
};

struct UWB_CharacterCreation_Head_C : UMOCharCreationFaceCustomization {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWidgetAnimation* PasteAnimation; // 0x348
	UWidgetAnimation* ShareAnimation; // 0x350
	UImage* BG_Fill; // 0x358
	UImage* BG_NoSlider; // 0x360
	UImage* BGFill1; // 0x368
	UImage* Image_386; // 0x370
	UVerticalBox* MainList; // 0x378
	UMOButton* PasteButton; // 0x380
	UMOTextBlock_Base_Small_White_01* PasteMessage; // 0x388
	UWB_CharacterCreation_Head_PresetEntry_Horizontal_C* Preset1; // 0x390
	UWB_CharacterCreation_Head_PresetEntry_Horizontal_C* Preset2; // 0x398
	UWB_CharacterCreation_Head_PresetEntry_Horizontal_C* Preset3; // 0x3a0
	UWB_CharacterCreation_Head_PresetEntry_Horizontal_C* Preset4; // 0x3a8
	UMOButtonLarge* RandomizeButton; // 0x3b0
	UMOButtonLarge* ResetButton; // 0x3b8
	UCanvasPanel* RootCanvasPanel; // 0x3c0
	UMOButton* ShareButton; // 0x3c8
	UMOTextBlock_Base_Small_White_01* ShareMessage; // 0x3d0
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_BrowRidge; // 0x3d8
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_Cheeks; // 0x3e0
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_ChinPlacement; // 0x3e8
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_ChinShape; // 0x3f0
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_EarShape; // 0x3f8
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_EyesPlacement; // 0x400
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_EyesShape; // 0x408
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_FaceSize; // 0x410
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_FaceWidth; // 0x418
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_MouthPlacement; // 0x420
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_MouthShape; // 0x428
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_NoseRidge; // 0x430
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_NoseShape; // 0x438
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_NoseTip; // 0x440
	UWB_CharacterCreation_Head_3DSlider_C* Slider2D_NoseWidth; // 0x448
	UMOTextBlock_Base_Small_White_01* Title_Textblock; // 0x450
	FTransform LastCharacterTransform; // 0x460
	FMulticastInlineDelegate OnFaceCustomizationUIDestroyed; // 0x490
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FVector ResetVector; // 0x58
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0x80
	FAIDataProviderFloatValue ConeDegrees; // 0xb8
	FAIDataProviderFloatValue AngleStep; // 0xf0
	FAIDataProviderFloatValue Range; // 0x128
	UEnvQueryContext* CenterActor; // 0x160
	char bIncludeContextLocation : 1; // 0x168
};

struct UNiagaraEmitter : UObject {
	bool bLocalSpace; // 0x28
	bool bDeterminism; // 0x29
	int32_t RandomSeed; // 0x2c
	EParticleAllocationMode AllocationMode; // 0x30
	int32_t PreAllocationCount; // 0x34
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x38
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x60
	ENiagaraSimTarget SimTarget; // 0x88
	FBox FixedBounds; // 0x8c
	int32_t MinDetailLevel; // 0xa8
	int32_t MaxDetailLevel; // 0xac
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0xb0
	FNiagaraPlatformSet Platforms; // 0xc8
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0xf8
	char bInterpolatedSpawning : 1; // 0x108
	char bFixedBounds : 1; // 0x108
	char bUseMinDetailLevel : 1; // 0x108
	char bUseMaxDetailLevel : 1; // 0x108
	char bOverrideGlobalSpawnCountScale : 1; // 0x108
	char bRequiresPersistentIDs : 1; // 0x108
	char bCombineEventSpawn : 1; // 0x108
	float MaxDeltaTimePerTick; // 0x10c
	uint32_t DefaultShaderStageIndex; // 0x110
	uint32_t MaxUpdateIterations; // 0x114
	TSet<uint32_t> SpawnStages; // 0x118
	char bSimulationStagesEnabled : 1; // 0x168
	char bDeprecatedShaderStagesEnabled : 1; // 0x168
	char bLimitDeltaTime : 1; // 0x168
	FString UniqueEmitterName; // 0x170
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x180
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x190
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1a0
	UNiagaraScript* GPUComputeScript; // 0x1b0
	TArray<FName> SharedEventGeneratorIds; // 0x1b8
};

struct USoundConcurrency : UObject {
	FSoundConcurrencySettings Concurrency; // 0x28
};

struct UActorSequenceComponent : UActorComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct UVirtualTexturePoolConfig : UObject {
	int32_t DefaultSizeInMegabyte; // 0x28
	TArray<FVirtualTextureSpacePoolConfig> Pools; // 0x30
};

struct ULandscapeWeightmapUsage : UObject {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x28
	FGuid LayerGuid; // 0x48
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x270
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x278
	APlayerCameraManager* BaseCamera; // 0x280
	FTransform RelativeTransform; // 0x290
	float BaseFOV; // 0x2c0
	char bAllowMultipleInstances : 1; // 0x2c4
	char bResetWhenRetriggered : 1; // 0x2c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x2c8
	float DistFromCamera; // 0x2d8
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe8
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
	float PointOfViewBackwardOffset; // 0x64
	float NearClippingRadius; // 0x68
};

struct UMOCharacterSelection : UMOUserWidget {
	UTextBlock* pTextBlockCharacterName; // 0x2c8
	UTextBlock* pTextBlockMid; // 0x2d0
	bool bHasCharacter; // 0x2d8
	UMOButton* pButtonDeleteCharacter; // 0x2e0
	UMOButton* pButtonPlay; // 0x2e8
};

struct UMOPhysicalMaterialGather : UMOPhysicalMaterial {
	FString sJournalRowToUnlock; // 0x98
	FString sGatherMisc; // 0xa8
	FString sGatherSkill; // 0xb8
	EGatherTypes eGatherType; // 0xc8
	int32_t iMin; // 0xcc
	int32_t iMax; // 0xd0
	FText sDisplayName; // 0xd8
	FText sUseString; // 0xf0
	float fHoldUseTimer; // 0x108
	UNiagaraSystem* pGatherParticles; // 0x110
	USoundCue* pGatherSound; // 0x118
};

struct UParticleModuleLocationPrimitiveSphere : UParticleModuleLocationPrimitiveBase {
	FRawDistributionFloat StartRadius; // 0xb0
};

struct UGeometryCacheCodecBase : UObject {
	TArray<int32_t> TopologyRanges; // 0x28
};

struct UConstantQNRT : UAudioSynesthesiaNRT {
	UConstantQNRTSettings* Settings; // 0x78
};

struct UMovieSceneCameraShakeSourceTriggerTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UWB_MO_CharacterDeleteComfirm_C : UMOCharacterDelete {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UWidgetAnimation* FadeIn; // 0x2f0
	UBackgroundBlur* MainPrompt_BlurBackground; // 0x2f8
	UMOButtonClose* MOButtonClose_336; // 0x300
	UCircularThrobber* pCircularThrobber_WaitingForResponse; // 0x308
	UTextBlock* pDeleteCharacterInfo; // 0x310
	UImage* pMiddleVertical; // 0x318
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xe8
	FFrameNumber StartFrameOffset; // 0xf0
	float StartOffset; // 0xf4
	float AudioStartTime; // 0xf8
	float AudioDilationFactor; // 0xfc
	float AudioVolume; // 0x100
	FMovieSceneFloatChannel SoundVolume; // 0x108
	FMovieSceneFloatChannel PitchMultiplier; // 0x1a8
	FMovieSceneActorReferenceData AttachActorData; // 0x248
	bool bLooping; // 0x2f8
	bool bSuppressSubtitles; // 0x2f9
	bool bOverrideAttenuation; // 0x2fa
	USoundAttenuation* AttenuationSettings; // 0x300
	FDelegate OnQueueSubtitles; // 0x308
	FMulticastInlineDelegate OnAudioFinished; // 0x318
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x328
};

struct UMOCrosshair : UMOUserWidget {
	UTextBlock* pTextBlockTargetName; // 0x2c8
	UTextBlock* pTextBlockGuildTag; // 0x2d0
	UTextBlock* pTextBlockPreNameTitle; // 0x2d8
	UTextBlock* pTextBlockPostNameTitle; // 0x2e0
	UTextBlock* pTextBlockUseString; // 0x2e8
	UTextBlock* pTextBlockScreenMessage; // 0x2f0
	UImage* pImageCrosshair; // 0x2f8
	UHorizontalBox* pHorizontalBox_Criminal; // 0x300
	UImage* pImageCrosshairHover; // 0x308
	UImage* pCriminalImage; // 0x310
	TArray<FColor> vFlagColors; // 0x318
	UImage* pImageLeftActionIndicator; // 0x328
	UImage* pImageRightActionIndicator; // 0x330
	UImage* pImageOverheadActionIndicator; // 0x338
	UImage* pImageThrustActionIndicator; // 0x340
	UImage* pImageCharge; // 0x348
};

struct UBodySetupCore : UObject {
	FName BoneName; // 0x28
	EPhysicsType PhysicsType; // 0x30
	ECollisionTraceFlag CollisionTraceFlag; // 0x31
	EBodyCollisionResponse CollisionReponse; // 0x32
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct USubmixEffectSubmixEQPreset : USoundEffectSubmixPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0xa0
};

struct USoundfieldSubmix : USoundSubmixWithParentBase {
	FName SoundfieldEncodingFormat; // 0x40
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x48
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x60
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct USynthComponentMonoWaveTable : USynthComponent {
	FMulticastInlineDelegate OnTableAltered; // 0x6c0
	FMulticastInlineDelegate OnNumTablesChanged; // 0x6d0
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x6e0
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded : UParticleModuleLocationPrimitiveCylinder {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct AWaterBody : AActor {
	UPhysicalMaterial* PhysicalMaterial; // 0x230
	float TargetWaveMaskDepth; // 0x238
	float MaxWaveHeightOffset; // 0x23c
	int32_t WaterBodyIndex; // 0x240
	bool bFillCollisionUnderWaterBodiesForNavmesh; // 0x244
	FUnderwaterPostProcessSettings UnderwaterPostProcessSettings; // 0x250
	EWaterBodyType WaterBodyType; // 0x7c0
	FWaterCurveSettings CurveSettings; // 0x7c8
	UMaterialInterface* WaterMaterial; // 0x7e8
	UMaterialInterface* UnderwaterPostProcessMaterial; // 0x7f0
	bool bAffectsLandscape; // 0x7f8
	bool bGenerateCollisions; // 0x7f9
	bool bOverrideWaterMesh; // 0x7fa
	UStaticMesh* WaterMeshOverride; // 0x800
	int32_t OverlapMaterialPriority; // 0x808
	FName CollisionProfileName; // 0x80c
	UWaterSplineComponent* SplineComp; // 0x818
	UWaterSplineMetadata* WaterSplineMetadata; // 0x820
	UMaterialInstanceDynamic* WaterMID; // 0x828
	UMaterialInstanceDynamic* UnderwaterPostProcessMID; // 0x830
	TArray<LazyObjectProperty> Islands; // 0x838
	TArray<LazyObjectProperty> ExclusionVolumes; // 0x848
	TWeakObjectPtr<ALandscapeProxy> Landscape; // 0x858
	FPostProcessSettings CurrentPostProcessSettings; // 0x860
	bool bCanAffectNavigation; // 0xdb0
	UNavAreaBase* WaterNavAreaClass; // 0xdb8
	UWaterWavesBase* WaterWaves; // 0xdc0
	bool bHasWaveSpectrumSettings; // 0xdc8
	bool bHasTerrainCarvingSettingsSettings; // 0xdc9
};

struct ALODActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<UMaterialInterface*, UInstancedStaticMeshComponent*> ImpostersStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct UMotionControllerComponent : UPrimitiveComponent {
	int32_t PlayerIndex; // 0x440
	EControllerHand Hand; // 0x444
	FName MotionSource; // 0x448
	char bDisableLowLatencyUpdate : 1; // 0x450
	ETrackingStatus CurrentTrackingStatus; // 0x454
	bool bDisplayDeviceModel; // 0x455
	FName DisplayModelSource; // 0x458
	UStaticMesh* CustomDisplayMesh; // 0x460
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x468
	UPrimitiveComponent* DisplayComponent; // 0x4e0
};

struct UMOButtonAttributeToggle : UMOWidgetBlueprint {
	TArray<UTexture2D*> vToggleIcons; // 0x260
	TArray<FText> vToggleTooltips; // 0x270
	UButton* pButton; // 0x280
	UImage* pImageIcon; // 0x288
};

struct UMOEquipmentComponent : UActorComponent {
	bool bHiddenInGame; // 0xb0
	bool bDisableExtraComponents; // 0xb1
	bool bIsShowingExtraComponents; // 0xb2
	TArray<UAudioComponent*> vExtraAudioComponents; // 0xb8
	TArray<UNiagaraComponent*> vExtraNiagaraComponents; // 0xc8
	TArray<UPointLightComponent*> vExtraPointLightComponents; // 0xd8
};

struct UInterpTrackFloatBase : UInterpTrack {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UAB_CH_Player_Male_Body_PostProcess_C : UMOAnimationInstancePostProcess {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0x300
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x550
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x570
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x688
};

struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct UTextureRenderTarget : UTexture {
	float TargetGamma; // 0xd8
};

struct UWB_MOOptionsChatPanel_C : UMOUserWidgetOptionsChat {
	UImage* Image_Line_UI; // 0x388
};

struct UIntSerialization : UObject {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	int8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct UMaterialExpressionMaterialProxyReplace : UMaterialExpression {
	FExpressionInput RealTime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UMaterialExpressionShadingPathSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct UMOBrokerCategoryEntry : UMOUserWidget {
	FMulticastInlineDelegate BrokerCategoryDelegate; // 0x2c8
	UMOButton* pMOButton; // 0x2d8
	UTextBlock* pMOText; // 0x2e0
	UVerticalBox* pVerticalBox; // 0x2e8
	bool bIsChecked; // 0x2f0
	int32_t iCategoryID; // 0x2f4
	int32_t iParentID; // 0x2f8
};

struct USoundNodeLooping : USoundNode {
	int32_t LoopCount; // 0x48
	char bLoopIndefinitely : 1; // 0x4c
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x258
};

struct UARTrackedImage : UARTrackedGeometry {
	UARCandidateImage* DetectedImage; // 0xf8
	FVector2D EstimatedSize; // 0x100
};

struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue GridSize; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	UEnvQueryContext* GenerateAround; // 0xf0
};

struct AMOAvatarStaticMeshBuildableKeep : AMOAvatarStaticMeshBuildableHouse {
	UStaticMeshComponent* pGuildStoneComponent; // 0x338
};

struct UWB_MO_LoginScreen_C : UMOLoginScreen {
	FPointerToUberGraphFrame UberGraphFrame; // 0x370
	UWidgetAnimation* FadeIn; // 0x378
	UWidgetAnimation* FadeInNews; // 0x380
	UImage* BG; // 0x388
	UImage* MO_Logo_Image; // 0x390
	UMOButtonLarge* MOButtonLarge-CloseApplication; // 0x398
	UButton* pButtonOpen_Discord; // 0x3a0
	UButton* pButtonOpen_Forums; // 0x3a8
	UButton* pButtonOpen_Twitter; // 0x3b0
	UImage* pMiddleVertical; // 0x3b8
	UMOBorderHeader* pMOLoginServerList; // 0x3c0
	UScrollBox* ServerScrollBox; // 0x3c8
	UWB_LoginError_C* WB_LoginError; // 0x3d0
	UWB_MO_LoginScreen_ServerEntry_C* WB_MO_LoginScreen_ServerEntry; // 0x3d8
	UBP_SaveGame_C* SaveGameRef; // 0x3e0
	UWB_MO_LoginScreen_C* BP_MO_LoginScreen; // 0x3e8
	UObject* LoginOptions; // 0x3f0
	bool OptionsIsNotKaboom; // 0x3f8
	int32_t NewVar_3; // 0x3fc
};

struct ULiveLinkTimeSynchronizationSource : UTimeSynchronizationSource {
	FLiveLinkSubjectName SubjectName; // 0x30
};

struct USplineChainComponent : UChainComponent {
	FRuntimeFloatCurve SplineFollowWeight; // 0x5e8
	USplineComponent* SplineComponent; // 0x670
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x220
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UAB_CH_Player_Female_Body_PostProcess_C : UMOAnimationInstancePostProcess {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2f8
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x318
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x430
	FAnimNode_KavajSoftbody AnimGraphNode_KavajSoftbody; // 0x450
	FKavajSoftBodyDefinitions BreastDefinitions; // 0x630
	FKavajSoftBodyParameters BreastParameters; // 0x670
};

struct UOceanGenerator : UWaterBodyGenerator {
	TArray<UOceanBoxCollisionComponent*> CollisionBoxes; // 0x28
	TArray<UOceanCollisionComponent*> CollisionHullSets; // 0x38
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct UWB_ItemSlotPaperdoll_C : UMOItemSlotPaperdoll {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	UWidgetAnimation* DestroyItemAnimation; // 0x350
	UMaterialInstanceDynamic* ItemMaterial; // 0x358
	UWB_SplitStack_C* SplitStackRef; // 0x360
	bool altKeyDown; // 0x368
	FSlateBrush pDefaultBrush; // 0x370
	UTexture2D* pOverrideFrameTexture; // 0x3f8
	bool bInactiveInAlpha; // 0x400
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x468
	EWidgetTimingPolicy TimingPolicy; // 0x469
	UUserWidget* WidgetClass; // 0x470
	FIntPoint DrawSize; // 0x478
	bool bManuallyRedraw; // 0x480
	bool bRedrawRequested; // 0x481
	float RedrawTime; // 0x484
	FIntPoint CurrentDrawSize; // 0x490
	bool bDrawAtDesiredSize; // 0x498
	FVector2D Pivot; // 0x49c
	bool bReceiveHardwareInput; // 0x4a4
	bool bWindowFocusable; // 0x4a5
	EWindowVisibility WindowVisibility; // 0x4a6
	bool bApplyGammaCorrection; // 0x4a7
	ULocalPlayer* OwnerPlayer; // 0x4a8
	FLinearColor BackgroundColor; // 0x4b0
	FLinearColor TintColorAndOpacity; // 0x4c0
	float OpacityFromTexture; // 0x4d0
	EWidgetBlendMode BlendMode; // 0x4d4
	bool bIsTwoSided; // 0x4d5
	bool TickWhenOffscreen; // 0x4d6
	UBodySetup* BodySetup; // 0x4d8
	UMaterialInterface* TranslucentMaterial; // 0x4e0
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4e8
	UMaterialInterface* OpaqueMaterial; // 0x4f0
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x4f8
	UMaterialInterface* MaskedMaterial; // 0x500
	UMaterialInterface* MaskedMaterial_OneSided; // 0x508
	UTextureRenderTarget2D* RenderTarget; // 0x510
	UMaterialInstanceDynamic* MaterialInstance; // 0x518
	bool bAddedToScreen; // 0x520
	bool bEditTimeUsable; // 0x521
	FName SharedLayerName; // 0x524
	int32_t LayerZOrder; // 0x52c
	EWidgetGeometryMode GeometryMode; // 0x530
	float CylinderArcAngle; // 0x534
	ETickMode TickMode; // 0x538
	UUserWidget* Widget; // 0x560
};

struct UMOTaskPanel : UMOUserWidget {
	UMOTask* pTask; // 0x2c8
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct UInterpTrackFloatProp : UInterpTrackFloatBase {
	FName PropertyName; // 0x90
};

struct UDeviceProfileManager : UObject {
	TArray<UObject*> Profiles; // 0x28
};

struct UVirtualTextureBuilder : UObject {
	UVirtualTexture2D* Texture; // 0x28
	uint64_t BuildHash; // 0x30
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct UMyPluginObject : UObject {
	FMyPluginStruct MyStruct; // 0x28
};

struct USoundCue : USoundBase {
	char bPrimeOnLoad : 1; // 0x1b8
	USoundNode* FirstNode; // 0x1c0
	float VolumeMultiplier; // 0x1c8
	float PitchMultiplier; // 0x1cc
	FSoundAttenuationSettings AttenuationOverrides; // 0x1d0
	float SubtitlePriority; // 0x570
	char bOverrideAttenuation : 1; // 0x578
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x578
	int32_t CookedQualityIndex; // 0x57c
	char bHasPlayWhenSilent : 1; // 0x580
};

struct UGerstnerWaterWaveGeneratorSimple : UGerstnerWaterWaveGeneratorBase {
	int32_t NumWaves; // 0x28
	int32_t Seed; // 0x2c
	float Randomness; // 0x30
	float MinWavelength; // 0x34
	float MaxWavelength; // 0x38
	float WavelengthFalloff; // 0x3c
	float MinAmplitude; // 0x40
	float MaxAmplitude; // 0x44
	float AmplitudeFalloff; // 0x48
	float WindAngleDeg; // 0x4c
	float DirectionAngularSpreadDeg; // 0x50
	float SmallWaveSteepness; // 0x54
	float LargeWaveSteepness; // 0x58
	float SteepnessFalloff; // 0x5c
};

struct UMOCurrencyWidget : UUserWidget {
	UTextBlock* pTextBlock_Cuprum; // 0x260
	UTextBlock* pTextBlock_Silver; // 0x268
	UTextBlock* pTextBlock_Gold; // 0x270
	int64_t iCurCuprum; // 0x278
};

struct URadialIntMask : UFieldNodeInt {
	float Radius; // 0xb0
	FVector Position; // 0xb4
	int32_t InteriorValue; // 0xc0
	int32_t ExteriorValue; // 0xc4
	ESetMaskConditionType SetMaskCondition; // 0xc8
};

struct UMOCombatSystemMelee : UMOCombatSystem {
	FMOCombatSystemMeleeDragInput DragInput; // 0x88
	TArray<UPrimitiveComponent*> vTraceIgnoreComponents; // 0x1a8
};

struct USteamNetConnection : UIpConnection {
	bool bIsPassthrough; // 0x1b90
};

struct AMOCharacterGM : AMOCharacterPlayer {
	int32_t iColor; // 0xcf0
	USoundCue* pGenericSoundCue; // 0xcf8
	UMOGMHUD* cGMOHUD; // 0xd00
	UMOGMHUD* pGMHUD; // 0xd08
};

struct UCompositeDataTable : UDataTable {
	TArray<UDataTable*> ParentTables; // 0xb0
	TArray<UDataTable*> OldParentTables; // 0xc0
};

struct UMOScribingPanel : UMOUserWidget {
	UMOButton* pButton_StartScribing; // 0x2c8
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_BookSlot; // 0x2d0
	UMOItemSlotPlaceItem* pItemSlotPlaceItem_ScribeSlot; // 0x2d8
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x220
};

struct UMOChatColorSelectionEntry : UMOOptionsEntry {
	UButton* pMOButton; // 0x318
	UMOUserWidgetOptionsChat* pOptionsChat; // 0x320
	UImage* pImage; // 0x328
	FColor currentColor; // 0x330
};

struct UMOGameMenu : UMOUserWidget {
	UMOButtonMedium* pOptionsButton; // 0x2c8
};

struct ANavigationTestingActor : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	UNavigationInvokerComponent* InvokerComponent; // 0x238
	char bActAsNavigationInvoker : 1; // 0x240
	FNavAgentProperties NavAgentProps; // 0x248
	FVector QueryingExtent; // 0x278
	ANavigationData* MyNavData; // 0x288
	FVector ProjectedLocation; // 0x290
	char bProjectedLocationValid : 1; // 0x29c
	char bSearchStart : 1; // 0x29c
	float CostLimitFactor; // 0x2a0
	float MinimumCostLimit; // 0x2a4
	char bBacktracking : 1; // 0x2a8
	char bUseHierarchicalPathfinding : 1; // 0x2a8
	char bGatherDetailedInfo : 1; // 0x2a8
	char bDrawDistanceToWall : 1; // 0x2a8
	char bShowNodePool : 1; // 0x2a8
	char bShowBestPath : 1; // 0x2a8
	char bShowDiffWithPreviousStep : 1; // 0x2a8
	char bShouldBeVisibleInGame : 1; // 0x2a8
	ENavCostDisplay CostDisplayMode; // 0x2ac
	FVector2D TextCanvasOffset; // 0x2b0
	char bPathExist : 1; // 0x2b8
	char bPathIsPartial : 1; // 0x2b8
	char bPathSearchOutOfNodes : 1; // 0x2b8
	float PathfindingTime; // 0x2bc
	float PathCost; // 0x2c0
	int32_t PathfindingSteps; // 0x2c4
	ANavigationTestingActor* OtherActor; // 0x2c8
	UNavigationQueryFilter* FilterClass; // 0x2d0
	int32_t ShowStepIndex; // 0x2d8
	float OffsetFromCornersDistance; // 0x2dc
};

struct UNiagaraDataInterfaceWater : UNiagaraDataInterface {
	AWaterBody* SourceBody; // 0x38
};

struct UMaterialExpressionShadowReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Shadow; // 0x54
};

struct UBP_MODragDropOperationSkill_C : UMODragDropOperationSkill {
	UWB_ItemSlotActionbar_C* ActionSlotRef; // 0x98
};

struct UParticleModuleMeshMaterial : UParticleModuleMaterialBase {
	TArray<UMaterialInterface*> MeshMaterials; // 0x30
};

struct UWB_MOCheckBoxEntryLanguage_C : UMOCheckBoxEntryLanguage {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	UMOButtonMedium* MOButtonMedium_HelpOut; // 0x350
	UTextBlock* pText_Pct; // 0x358
};

struct UMOPopupMessage : UMOUserWidget {
	UTextBlock* pCaptionText; // 0x2c8
	UTextBlock* pBodyText; // 0x2d0
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	UObject* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
	UEdGraphPin_Deprecated* ParentPin; // 0x108
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
};

struct UMOUserWidgetOptionsChat : UMOUserWidgetOptionsPanel {
	UMOColorPicker* pMOColorPicker; // 0x2d0
	UMOCheckBoxEntry* pTempCheckBoxEntry_DisableChat; // 0x2d8
	TArray<UMOCheckBoxEntry*> vCheckBoxEntries; // 0x2e0
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Local; // 0x2f0
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Whisper; // 0x2f8
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Yell; // 0x300
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Guild; // 0x308
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Skill; // 0x310
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Combat; // 0x318
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Game; // 0x320
	UMOCheckBoxEntry* pCheckBoxEntry_PopUp_Server; // 0x328
	int32_t iLastPressedEntryIndex_Color; // 0x330
	TArray<UMOChatColorSelectionEntry*> vColorEntries; // 0x338
	UMOChatColorSelectionEntry* pColorEntry_Local; // 0x348
	UMOChatColorSelectionEntry* pColorEntry_Whisper; // 0x350
	UMOChatColorSelectionEntry* pColorEntry_Yell; // 0x358
	UMOChatColorSelectionEntry* pColorEntry_Guild; // 0x360
	UMOChatColorSelectionEntry* pColorEntry_Skill; // 0x368
	UMOChatColorSelectionEntry* pColorEntry_Combat; // 0x370
	UMOChatColorSelectionEntry* pColorEntry_Game; // 0x378
	UMOChatColorSelectionEntry* pColorEntry_Server; // 0x380
};

struct AMOEquipmentActorArmor : AMOEquipmentActor {
	USkeletalMeshComponent* ArmorComponent; // 0x288
	USkeletalMeshComponent* MasterPoseComponentOverride; // 0x290
	FMOEquipmentActorArmorData ArmorData; // 0x298
};

struct UMODamageDirectionIndcatorPool : UMOUserWidget {
	TArray<UMODamageDirectionIndcator*> vDamageIndicators; // 0x2c8
	AMOPlayerController* pMOPlayerController; // 0x2d8
};

struct UMRMeshComponent : UPrimitiveComponent {
	UMaterialInterface* Material; // 0x450
	UMaterialInterface* WireframeMaterial; // 0x458
	bool bCreateMeshProxySections; // 0x460
	bool bUpdateNavMeshOnMeshUpdate; // 0x461
	bool bNeverCreateCollisionMesh; // 0x462
	UBodySetup* CachedBodySetup; // 0x468
	TArray<UBodySetup*> BodySetups; // 0x470
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x220
};

struct UWB_MOOptionsKeybindsPanel_C : UMOUserWidgetOptionsKeybinds {
	FPointerToUberGraphFrame UberGraphFrame; // 0x358
	UImage* BACKGROUND; // 0x360
	UCanvasPanel* CanvasPanel-Keybindings; // 0x368
	UWB_TabManager_C* WB_TabManager; // 0x370
};

struct UMOBrokerPetListEntry : UMOPetListEntry {
	UMOCurrencyWidget* pMOCurrencyWidget; // 0x300
	UTextBlock* pTextBlockCityName; // 0x308
	UTextBlock* pTextBlockPlayerName; // 0x310
	UTextBlock* pTextBlockQuantity; // 0x318
	UTextBlock* pTextBlockDays; // 0x320
	UTextBlock* pMOBrokerButton_Text; // 0x328
	UImage* pImage_SelectedBG; // 0x330
	UImage* pImage_HoveredBG; // 0x338
	UMOButton* pMOButton_BrokerEntry; // 0x340
	TArray<FString> vBaggedItemJsonArray; // 0x348
	int32_t iBagSize; // 0x358
	uint64_t iCuprumCost; // 0x360
	int32_t iCurPanelState; // 0x368
	bool bSelectionState; // 0x36c
};

struct UGameplayTagsSettings : UGameplayTagsList {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool FastReplication; // 0x4a
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct AControlRigControlActor : AActor {
	AActor* ActorToTrack; // 0x220
	UControlRig* ControlRigClass; // 0x228
	bool bRefreshOnTick; // 0x230
	bool bIsSelectable; // 0x231
	UMaterialInterface* MaterialOverride; // 0x238
	FString ColorParameter; // 0x240
	bool bCastShadows; // 0x250
	USceneComponent* ActorRootComponent; // 0x258
	UControlRig* ControlRig; // 0x260
	TArray<FName> ControlNames; // 0x268
	TArray<FTransform> GizmoTransforms; // 0x278
	TArray<UStaticMeshComponent*> Components; // 0x288
	TArray<UMaterialInstanceDynamic*> Materials; // 0x298
	FName ColorParameterName; // 0x2a8
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct UCameraAnim : UObject {
	UInterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	FBox BoundingBox; // 0x34
	char bRelativeToInitialTransform : 1; // 0x50
	char bRelativeToInitialFOV : 1; // 0x50
	float BaseFOV; // 0x54
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5b0
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct ULODSyncComponent : UActorComponent {
	int32_t NumLODs; // 0xb0
	int32_t ForcedLOD; // 0xb4
	TArray<FComponentSync> ComponentsToSync; // 0xb8
	TMap<FName, FLODMappingData> CustomLODMapping; // 0xc8
	int32_t CurrentLOD; // 0x118
	int32_t CurrentNumLODs; // 0x11c
	TArray<UPrimitiveComponent*> DriveComponents; // 0x120
	TArray<UPrimitiveComponent*> SubComponents; // 0x130
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x100
};

struct ALuminAROrigin : AAROriginActor {
	UMRMeshComponent* MRMeshComponent; // 0x220
	UMaterialInterface* PlaneSurfaceMaterial; // 0x228
	UMaterialInterface* WireframeMaterial; // 0x230
};

struct ULiveLinkCurveRemapSettings : ULiveLinkSourceSettings {
	FLiveLinkCurveConversionSettings CurveConversionSettings; // 0xa0
};

struct UMOTask : UMOUserWidget {
	UMOTaskItemListEntry* cTaskItemListEntryClass; // 0x2c8
	TArray<UMOUserWidgetTabButtonNew*> vTabButtons; // 0x2d0
	UMOUserWidgetTabButtonNew* pMOTabButton_AcceptTask; // 0x2e0
	UMOUserWidgetTabButtonNew* pMOTabButton_DeliverItems; // 0x2e8
	TArray<UMOTaskPanel*> vPanels; // 0x2f0
	UMOTaskAcceptPanel* pMOTaskAcceptPanel; // 0x300
	UMOTaskDeliveryPanel* pMOTaskDeliveryPanel; // 0x308
	AMOCharacterAIGeneratedTaskVendor* pTaskVendorCharacter; // 0x310
	bool bCanAcceptTask; // 0x318
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct UMODataAssetAnimationRandomSet : UPrimaryDataAsset {
	FRandomPlayerSequenceEntry DefaultSequence; // 0x30
	float MinimumPlayTimeBeforeRandomizing; // 0x80
	float MaximumPlayTimeBeforeRandomizing; // 0x84
	TArray<FMORandomPlayerSequenceEntry> Sequences; // 0x88
};

struct UBP_MO_UnsavedChanges_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UMOButtonLarge* pMOButtonUnsavedChanges_No; // 0x268
	UMOButtonLarge* pMOButtonUnsavedChanges_Yes; // 0x270
	UObject* NewVar_1; // 0x278
	UUserWidget* NewVar_2; // 0x280
	UObject* WP_LoginOptions; // 0x288
};

struct AARSkyLight : ASkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x230
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct UMovieSceneSequenceTickManager : UObject {
	TArray<AActor*> SequenceActors; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x38
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UNiagaraDataInterfaceArrayBool : UNiagaraDataInterfaceArray {
	TArray<bool> BoolData; // 0x50
};

struct UMOEOSSubsystem : UEngineSubsystem {
	FMulticastInlineDelegate OnErrorThrown; // 0x38
};

struct UMaterialExpressionRound : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UMOButtonLarge : UMOButton {
	USlateWidgetStyleAsset* CustomStyle; // 0x438
};

struct UMOCraftingListEntry : UMOWidgetBlueprint {
	UTextBlock* pTextBlockCraftingName; // 0x260
	UTextBlock* pTextBlockCraftingSub; // 0x268
	float fDepthOffset; // 0x270
	UMOSkillsTree* pSkillTreeParent; // 0x288
	UMOCraftingListEntry* pParent; // 0x290
	UMOCrafting* pCraftingParent; // 0x298
	TArray<UMOCraftingListEntry*> vChildren; // 0x2a0
};

struct UNiagaraEventReceiverEmitterAction_SpawnParticles : UNiagaraEventReceiverEmitterAction {
	uint32_t NumParticles; // 0x28
};

struct UMOSaveDataInstance : UObject {
	FMOSaveData sData; // 0x28
	FString sSaveDataSlotName; // 0x150
	int32_t iSaveDataUserIndex; // 0x160
};

struct ULiveLinkComponentController : UActorComponent {
	FLiveLinkSubjectRepresentation SubjectRepresentation; // 0xb0
	TMap<ULiveLinkRole*, ULiveLinkControllerBase*> ControllerMap; // 0xc0
	bool bUpdateInEditor; // 0x110
	FMulticastInlineDelegate OnLiveLinkUpdated; // 0x118
	FComponentReference ComponentToControl; // 0x128
	bool bDisableEvaluateLiveLinkWhenSpawnable; // 0x150
	bool bEvaluateLiveLink; // 0x151
};

struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28
};

struct UMovieSceneControlRigParameterSection : UMovieSceneParameterSection {
	UControlRig* ControlRig; // 0x148
	TArray<bool> ControlsMask; // 0x150
	FMovieSceneTransformMask TransformMask; // 0x160
	bool bAdditive; // 0x164
	bool bApplyBoneFilter; // 0x165
	FInputBlendPose BoneFilter; // 0x168
	FMovieSceneFloatChannel Weight; // 0x178
	TMap<FName, FChannelMapInfo> ControlChannelMap; // 0x218
	TArray<FEnumParameterNameAndCurve> EnumParameterNamesAndCurves; // 0x268
	TArray<FIntegerParameterNameAndCurve> IntegerParameterNamesAndCurves; // 0x278
};

struct UMOJournalNoteEntry : UMOUserWidget {
	FMOJournalNoteSaveData sNoteSaveData; // 0x2f8
	UImage* pSelectedBG; // 0x328
	UImage* pIcon; // 0x330
	UTextBlock* pTitleText; // 0x338
	UMOButton* pMOButton; // 0x340
	UMOButton* pMOButton_Remove; // 0x348
	UMOButton* pMOButton_Rename; // 0x350
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UMaterialExpressionLandscapeLayerWeight : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Layer; // 0x54
	FName ParameterName; // 0x68
	float PreviewWeight; // 0x70
	FVector ConstBase; // 0x74
	FGuid ExpressionGUID; // 0x80
};

struct UBP_MODragDropOperationSpell_C : UMODragDropOperationSpell {
	UWB_ItemSlotActionbar_C* ActionSlotRef; // 0x98
};

struct UWB_CharacterCreationNew_C : UMOCharacterCreationNew {
	FPointerToUberGraphFrame UberGraphFrame; // 0x648
	UWidgetAnimation* FadeIn; // 0x650
	UImage* PanelTextBackground; // 0x658
	UMOButton* pMOButton_Camera_CloseUp; // 0x660
	UMOButton* pMOButton_Camera_ZoomedOut; // 0x668
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UMovieSceneAudioTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x80
};

struct UARGeoAnchorComponent : UARComponent {
	FARGeoAnchorUpdatePayload ReplicatedPayload; // 0x280
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UBTCompositeNode : UBTNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
	char bApplyDecoratorScope : 1; // 0x88
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	EGainParamMode GainMode; // 0x68
	float OutputVolume; // 0x6c
	float WetLevel; // 0x70
	float DryLevel; // 0x74
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x78
};

struct UMaterialExpressionCosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UMaterialExpressionDistanceToNearestSurface : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct ULiveLinkInstance : UAnimInstance {
	ULiveLinkRetargetAsset* CurrentRetargetAsset; // 0x2b8
};

struct UMaterialExpressionShadingModel : UMaterialExpression {
	EMaterialShadingModel ShadingModel; // 0x40
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UAB_Creature_Lying_QuickFix_C : UMOAnimationInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x530
	FAnimNode_Root AnimGraphNode_Root; // 0x538
	FMOAnimNode_RandomPlayer MOAnimGraphNode_RandomPlayer; // 0x568
	FAnimNode_Slot AnimGraphNode_Slot; // 0x688
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct UAvfMediaSettings : UObject {
	bool NativeAudioOut; // 0x28
};

struct UWorld : UObject {
	ULevel* PersistentLevel; // 0x30
	UNetDriver* NetDriver; // 0x38
	ULineBatchComponent* LineBatcher; // 0x40
	ULineBatchComponent* PersistentLineBatcher; // 0x48
	ULineBatchComponent* ForegroundLineBatcher; // 0x50
	AGameNetworkManager* NetworkManager; // 0x58
	UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60
	TArray<UObject*> ExtraReferencedObjects; // 0x68
	TArray<UObject*> PerModuleDataObjects; // 0x78
	TArray<ULevelStreaming*> StreamingLevels; // 0x88
	FStreamingLevelsToConsider StreamingLevelsToConsider; // 0x98
	FString StreamingLevelsPrefix; // 0xc0
	ULevel* CurrentLevelPendingVisibility; // 0xd0
	ULevel* CurrentLevelPendingInvisibility; // 0xd8
	UDemoNetDriver* DemoNetDriver; // 0xe0
	AParticleEventManager* MyParticleEventManager; // 0xe8
	APhysicsVolume* DefaultPhysicsVolume; // 0xf0
	char bAreConstraintsDirty : 1; // 0x10e
	UNavigationSystemBase* NavigationSystem; // 0x110
	AGameModeBase* AuthorityGameMode; // 0x118
	AGameStateBase* GameState; // 0x120
	UAISystemBase* AISystem; // 0x128
	UAvoidanceManager* AvoidanceManager; // 0x130
	TArray<ULevel*> Levels; // 0x138
	TArray<FLevelCollection> LevelCollections; // 0x148
	UGameInstance* OwningGameInstance; // 0x180
	TArray<UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x188
	UCanvas* CanvasForRenderingToTarget; // 0x198
	UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x1a0
	TSet<UActorComponent*> ComponentsThatNeedPreEndOfFrameSync; // 0x1f8
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x248
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x258
	UWorldComposition* WorldComposition; // 0x5d8
	FWorldPSCPool PSCPool; // 0x668
};

struct UMOCarouselSelectValue : UMOUserWidget {
	FText LabelText; // 0x2c8
	FText InitTooltipText; // 0x2e0
	int32_t iValueIncrement; // 0x2f8
	int32_t iMinValue; // 0x2fc
	int32_t iMaxValue; // 0x300
	int32_t iCurrentValue; // 0x304
	UMOButton* pMOButton_Forward; // 0x318
	UMOButton* pMOButton_Back; // 0x320
	UTextBlock* pLabelText; // 0x328
	UTextBlock* pValueText; // 0x330
	int32_t iEntryIndex; // 0x338
	UMOCharCreationAttributesPanel* pAttributePanel; // 0x340
	bool bCannotLoop; // 0x348
};

struct UMODataAssetEtherCombat : UPrimaryDataAsset {
	UMODataAssetEtherCombat* FirstPersonOverride; // 0x30
	UAnimMontage* AttackMontage; // 0x38
	UAnimSequenceBase* AttackBeginAnimation; // 0x40
	UAnimSequenceBase* AttackCancelAnimation; // 0x48
	AMOSpiritArm* cSpiritArmClass; // 0x50
};

struct UMOChatGUI : UMOUserWidget {
	bool bIsResizing; // 0x2c8
	bool bIsMoving; // 0x2c9
	UUserWidget* ChatMessage; // 0x2d0
	UUserWidget* ChannelTab; // 0x2d8
	UEditableTextBox* pChatBox; // 0x318
	UButton* pSendButton; // 0x320
	UButton* pChannelButton; // 0x328
	UScrollBox* pChatLog; // 0x330
	UTextBlock* pChannelText; // 0x338
	UHorizontalBox* pHorizontalBox_ChannelTabs; // 0x340
	FVector2D OriginalChatLogSize; // 0x358
	FVector2D CursorPos_OnStart; // 0x360
	FVector2D Size_OnResizingStart; // 0x368
	FVector2D ChatPos_OnMoveStart; // 0x370
	FIntPoint ipCurResolution; // 0x378
	UHorizontalBox* pHorizontalBox_Scale; // 0x380
	UMOButton* pMOButton_Resize; // 0x388
};

struct UParticleModuleVelocityCone : UParticleModuleVelocityBase {
	FRawDistributionFloat Angle; // 0x38
	FRawDistributionFloat Velocity; // 0x68
	FVector Direction; // 0x98
};

struct UPaperFlipbook : UObject {
	float FramesPerSecond; // 0x28
	TArray<FPaperFlipbookKeyFrame> KeyFrames; // 0x30
	UMaterialInterface* DefaultMaterial; // 0x40
	EFlipbookCollisionMode CollisionSource; // 0x48
};

struct UMOVendor : UMOUserWidget {
	UMOButtonMedium* pMOButton_Accept; // 0x2c8
	UTextBlock* pTextBlock_TotalCost; // 0x2d0
	UMOScrollBox* pMOScrollBox_ForSale; // 0x2d8
	UMOScrollBox* pMOScrollBox_Buy; // 0x2e0
	UMOScrollBoxPlaceItems* pMOScrollBoxPlaceItems_Sell; // 0x2e8
	UVerticalBox* pVerticalBox_Wants; // 0x2f0
	UGridPanel* pGridPanel_Wants; // 0x2f8
	UMOEditableTextBox* pMOEditableTextBox; // 0x300
	UMOItemListEntry* cVendorListEntryClass; // 0x308
	UMOItemSlotStatic* cStaticSlotEntryClass; // 0x310
	AMOCharacterAIGeneratedVendor* pVendorCharacter; // 0x338
};

struct UAxisPositionGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bInInteraction; // 0x89
	FVector InteractionOrigin; // 0x8c
	FVector InteractionAxis; // 0x98
	FVector InteractionStartPoint; // 0xa4
	FVector InteractionCurPoint; // 0xb0
	float InteractionStartParameter; // 0xbc
	float InteractionCurParameter; // 0xc0
	float ParameterSign; // 0xc4
};

struct UMaterialExpressionNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	FExpressionInput FilterWidth; // 0x54
	float Scale; // 0x68
	int32_t Quality; // 0x6c
	ENoiseFunction NoiseFunction; // 0x70
	char bTurbulence : 1; // 0x74
	int32_t Levels; // 0x78
	float OutputMin; // 0x7c
	float OutputMax; // 0x80
	float LevelScale; // 0x84
	char bTiling : 1; // 0x88
	uint32_t RepeatSize; // 0x8c
};

struct UMOJournalEntriesPanel : UMOJournalPanel {
	UMOScrollBox* pMOScrollBox_GroupEntries; // 0x2d0
	UMOJournalEntry* pLastClickedEntry; // 0x2d8
	UCanvasPanel* pCanvasPanel; // 0x2e0
	UImage* pBanner; // 0x2e8
	UTextBlock* pTitleText; // 0x2f0
	UMOEditableTextBox* pMOEditableTextBox_Search; // 0x2f8
	UMOMultiLineEditableTextBox* pEditableTextBox; // 0x300
	UMOJournalEntry* cMOJournalEntry; // 0x308
	UMOJournalGroupEntry* cMOJournalGroupEntry; // 0x310
	TMap<FString, UMOJournalEntry*> vJournalEntryMap; // 0x318
	TMap<FString, UMOJournalGroupEntry*> vJournalGroupMap; // 0x368
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UInAppPurchaseCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct USourceEffectRingModulationPreset : USoundEffectSourcePreset {
	FSourceEffectRingModulationSettings Settings; // 0xb0
};

struct UMOMusicSubsystem : UMOWorldSubsystemBase {
	FMulticastInlineDelegate OnCurrentSongStoppedOrFinished; // 0x40
	UAudioComponent* pAudioComponentA; // 0x60
	UAudioComponent* pAudioComponentB; // 0x68
	USoundCue* pNextSoundTrack; // 0x70
	USoundCue* pOverrideCue; // 0x78
	USoundCue* pPreOverrideCue; // 0x80
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0x108
	TWeakObjectPtr<UWorld> World; // 0x118
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x120
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x440
	int32_t SectionBaseY; // 0x444
	int32_t ComponentSizeQuads; // 0x448
	int32_t SubsectionSizeQuads; // 0x44c
	int32_t NumSubsections; // 0x450
	UMaterialInterface* OverrideMaterial; // 0x458
	UMaterialInterface* OverrideHoleMaterial; // 0x460
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x468
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x478
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x488
	TArray<int8_t> LODIndexToMaterialIndex; // 0x498
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4a8
	UTexture2D* XYOffsetmapTexture; // 0x4b8
	FVector4 WeightmapScaleBias; // 0x4c0
	float WeightmapSubsectionOffset; // 0x4d0
	FVector4 HeightmapScaleBias; // 0x4e0
	FBox CachedLocalBox; // 0x4f0
	LazyObjectProperty CollisionComponent; // 0x50c
	UTexture2D* HeightmapTexture; // 0x528
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x530
	TArray<UTexture2D*> WeightmapTextures; // 0x540
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x550
	FGuid MapBuildDataId; // 0x558
	TArray<FGuid> IrrelevantLights; // 0x568
	int32_t CollisionMipLevel; // 0x578
	int32_t SimpleCollisionMipLevel; // 0x57c
	float NegativeZBoundsExtension; // 0x580
	float PositiveZBoundsExtension; // 0x584
	float StaticLightingResolution; // 0x588
	int32_t ForcedLOD; // 0x58c
	int32_t LODBias; // 0x590
	FGuid StateId; // 0x594
	FGuid BakedTextureMaterialGuid; // 0x5a4
	UTexture2D* GIBakedBaseColorTexture; // 0x5b8
	char MobileBlendableLayerMask; // 0x5c0
	UMaterialInterface* MobileMaterialInterface; // 0x5c8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5d0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5e0
};

struct UWB_MOCharCreationSpeciesPanel_C : UMOCharCreationSpeciesPanel {
	UWB_MO_Scrollbox_Arrow_Down_C* WB_MO_Scrollbox_Arrow_Down; // 0x3d0
	UWB_MO_Scrollbox_Arrow_Up_C* WB_MO_Scrollbox_Arrow_Up; // 0x3d8
};

struct UMaterialExpressionRuntimeVirtualTextureSample : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	FExpressionInput WorldPosition; // 0x54
	FExpressionInput MipValue; // 0x68
	URuntimeVirtualTexture* VirtualTexture; // 0x80
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x88
	bool bSinglePhysicalSpace; // 0x89
	bool bAdaptive; // 0x8a
	ERuntimeVirtualTextureMipValueMode MipValueMode; // 0x8b
	ERuntimeVirtualTextureTextureAddressMode TextureAddressMode; // 0x8c
};

struct UControlRigValidator : UObject {
	TArray<UControlRigValidationPass*> Passes; // 0x28
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UControlRig : UObject {
	ERigExecutionType ExecutionType; // 0x45
	URigVM* VM; // 0x48
	FRigHierarchyContainer Hierarchy; // 0x50
	TSoftObjectPtr<UControlRigGizmoLibrary> GizmoLibrary; // 0x3b8
	TMap<FName, FCachedPropertyPath> InputProperties; // 0x3f0
	TMap<FName, FCachedPropertyPath> OutputProperties; // 0x440
	FControlRigDrawContainer DrawContainer; // 0x490
	UAnimationDataSourceRegistry* DataSourceRegistry; // 0x4c0
	TArray<FName> EventQueue; // 0x4c8
	FRigInfluenceMapPerEvent Influences; // 0x550
	UControlRig* InteractionRig; // 0x5b0
	UControlRig* InteractionRigClass; // 0x5b8
	TArray<UAssetUserData*> AssetUserData; // 0x5c0
};

struct ALight : AActor {
	ULightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	FString EnumName; // 0x30
	UEnum* EnumType; // 0x40
};

struct UWaterWavesAsset : UObject {
	UWaterWaves* WaterWaves; // 0x28
};

struct UMOJournal : UMOUserWidget {
	UMOJournalEntriesPanel* pJournalEntriesPanel; // 0x2c8
	UMOJournalNotesPanel* pJournalNotesPanel; // 0x2d0
	UMOButtonClose* pMOButton_Close; // 0x2d8
	TArray<UMOJournalPanel*> vPanels; // 0x2e0
	TArray<UMOUserWidgetTabButtonNew*> vTabButtons; // 0x2f0
	UMOUserWidgetTabButtonNew* pMOTabButton_Entries; // 0x300
	UMOUserWidgetTabButtonNew* pMOTabButton_Notes; // 0x308
};

struct ABP_AiEffectArrow_C : AMOAiEffectActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
};

struct UVariantObjectBinding : UObject {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct UGizmoConstantAxisSource : UObject {
	FVector Origin; // 0x30
	FVector Direction; // 0x3c
};

struct AMOCharacterCollisionPoolSubsystemActor : AActor {
	bool bIsEditorPreview; // 0x220
	bool bHasPlayerPosition; // 0x221
	FVector LastKnownPlayerPosition; // 0x224
	int32_t PoolGrowAmount; // 0x230
	int32_t TickId; // 0x234
	TArray<AMOCharacter*> RegisteredCharacters; // 0x238
	TArray<USphereComponent*> AvailableSphereShapes; // 0x248
	TArray<UCapsuleComponent*> AvailableCapsuleShapes; // 0x258
};

struct UMaterialExpressionSubtract : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMOCheckBoxQuest : UMOUserWidget {
	UMOCheckBox* pMOCheckBox; // 0x2c8
	UTextBlock* pTextBlockSign; // 0x2d0
	UImage* pColorImage; // 0x2d8
	UImage* pImageBG; // 0x2e0
};

struct UPhysicsSettings : UPhysicsSettingsCore {
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0xe0
	ESettingsLockedAxis LockedAxis; // 0x114
	ESettingsDOF DefaultDegreesOfFreedom; // 0x115
	bool bSuppressFaceRemapTable; // 0x116
	bool bSupportUVFromHitResults; // 0x117
	bool bDisableActiveActors; // 0x118
	bool bDisableKinematicStaticPairs; // 0x119
	bool bDisableKinematicKinematicPairs; // 0x11a
	bool bDisableCCD; // 0x11b
	bool bEnableEnhancedDeterminism; // 0x11c
	float AnimPhysicsMinDeltaTime; // 0x120
	bool bSimulateAnimPhysicsAfterReset; // 0x124
	float MaxPhysicsDeltaTime; // 0x128
	bool bSubstepping; // 0x12c
	bool bSubsteppingAsync; // 0x12d
	float MaxSubstepDeltaTime; // 0x130
	int32_t MaxSubsteps; // 0x134
	float SyncSceneSmoothingFactor; // 0x138
	float InitialAverageFrameRate; // 0x13c
	int32_t PhysXTreeRebuildRate; // 0x140
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x148
	FBroadphaseSettings DefaultBroadphaseSettings; // 0x158
	float MinDeltaVelocityForHitEvents; // 0x198
	FChaosPhysicsSettings ChaosSettings; // 0x19c
};

struct UNavLinkDefinition : UObject {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UParticleModuleCollisionGPU : UParticleModuleCollisionBase {
	FRawDistributionFloat Resilience; // 0x30
	FRawDistributionFloat ResilienceScaleOverLife; // 0x60
	float Friction; // 0x90
	float RandomSpread; // 0x94
	float RandomDistribution; // 0x98
	float RadiusScale; // 0x9c
	float RadiusBias; // 0xa0
	EParticleCollisionResponse Response; // 0xa4
	EParticleCollisionMode CollisionMode; // 0xa5
};

struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct UMovieSceneCinematicShotSection : UMovieSceneSubSection {
	FString ShotDisplayName; // 0x160
	FText DisplayName; // 0x170
};

struct UBP_ClientEffect_AlvarinZoom_C : UMOClientEffectAlvarinZoom {
	FPointerToUberGraphFrame UberGraphFrame; // 0x78
	FPostProcessSettings pPreviousPostProcessSettings; // 0x80
};

struct UParticleModuleLocationPrimitiveTriangle : UParticleModuleLocationBase {
	FRawDistributionVector StartOffset; // 0x30
	FRawDistributionFloat Height; // 0x78
	FRawDistributionFloat Angle; // 0xa8
	FRawDistributionFloat Thickness; // 0xd8
};

struct UNiagaraDataInterfaceGrid2DCollectionReader : UNiagaraDataInterfaceGrid2D {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UMOBodyManagerComponent : UActorComponent {
	UGFurComponent* BodyFurMesh; // 0xb0
	UGFurComponent* HeadFurMesh; // 0xb8
	UNiagaraComponent* EtherParticlesComponent; // 0xc0
	UMaterialInstanceDynamic* pBodyComponentMID; // 0xc8
	UMaterialInstanceDynamic* pHeadComponentMID; // 0xd0
	UMaterialInstanceDynamic* pEyesComponentMID; // 0xd8
	UMaterialInstanceDynamic* pEyesAOComponentMID; // 0xe0
	UMaterialInstanceDynamic* pHairComponentMID; // 0xe8
	UMaterialInstanceDynamic* pBeardComponentMID; // 0xf0
	UMaterialInstanceDynamic* pHeadFurMID; // 0xf8
	UMaterialInstanceDynamic* pBodyFurMID; // 0x100
	FMulticastInlineDelegate OnPlayerDefinitionChanged; // 0x108
	USkeletalMeshComponent* pHairComponent; // 0x118
	USkeletalMeshComponent* pBeardComponent; // 0x120
	USkeletalMeshComponent* pHeadComponent; // 0x128
	USkeletalMeshComponent* pBodyComponent; // 0x130
	bool bIsPaperdoll; // 0x138
	bool bIsUndead; // 0x139
	bool bUseEtherworldAppearance; // 0x13a
	FMOCharacterBodyData sCharacterBodyData; // 0x140
	FMOCharacterDecorationData sCharacterDecorationData; // 0x170
	FMOCharacterFaceCustomizationData sFaceCustomizationData; // 0x1b8
	UMODataAssetPlayerBaseDefinition* ActivePlayerDefinition; // 0x1c8
	UMODataAssetHair* ActiveHairDefinition; // 0x1d0
	UMODataAssetHair* ActiveBeardDefinition; // 0x1d8
	UMODataAssetTattoo* ActiveFaceTattooDefinition; // 0x1e0
	UMODataAssetTattoo* ActiveBodyTattooDefinition; // 0x1e8
};

struct UMovieSceneSubTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct ACameraRig_Rail : AActor {
	float CurrentPositionOnRail; // 0x220
	bool bLockOrientationToRail; // 0x224
	USceneComponent* TransformComponent; // 0x228
	USplineComponent* RailSplineComponent; // 0x230
	USceneComponent* RailCameraMount; // 0x238
};

struct UMOGameUserSettings : UGameUserSettings {
	int32_t LastKnownVOIPInputDeviceID; // 0x120
	FString LastKnownVOIPInputDeviceName; // 0x128
	int32_t LastKnownVOIPOutputDeviceID; // 0x138
	FString LastKnownVOIPOutputDeviceName; // 0x140
	float fVoipVoiceActivateThreshold; // 0x150
	FMulticastInlineDelegate OnVoipVoiceActivateThresholdChanged; // 0x158
	FMulticastInlineDelegate OnVoipInputChanged; // 0x168
	FMulticastInlineDelegate OnVoipOutputChanged; // 0x178
	bool bWasEverInitialized_Audio; // 0x188
	bool bWasEverInitialized_Video; // 0x189
	bool bWasEverInitialized_Keybinds; // 0x18a
	bool bWasEverInitialized_Chat; // 0x18b
	bool bWasEverInitialized_UI; // 0x18c
	bool bWasEverInitialized_Gameplay; // 0x18d
	float fMasterVol; // 0x190
	float fMusicVol; // 0x19c
	float fInterfaceVol; // 0x1a8
	float fVoiceMasterVol; // 0x1b4
	bool bVoiceChat; // 0x1c0
	bool bVoiceActivation; // 0x1c3
	bool bGore; // 0x1c6
	bool bFullNudity; // 0x1c9
	bool bMotionBlur; // 0x1cc
	bool bYConstrainedFieldOfView; // 0x1d1
	bool bUseMultithreadedRendering; // 0x1d4
	bool bUseCharacterDistanceCPUOptimization; // 0x1d7
	int32_t iPostProcessingQuality; // 0x1ec
	int32_t iDLSSQuality; // 0x208
	float fResolutionScale; // 0x23c
	float fFieldOfView; // 0x248
	float fViewDistance; // 0x254
	bool bPaperdollShouldRender; // 0x264
	bool bShowFPSCounter; // 0x265
	TArray<FMOKeybindSelectStruct> vKeybindOverrides; // 0x268
	TArray<FMOKeybindSelectStruct> vSavedKeybindOverrides; // 0x278
	FVector2D chatSize; // 0x288
	FVector2D chatPos; // 0x290
	TArray<bool> vChatPopUps; // 0x298
	TArray<bool> vSavedChatPopUps; // 0x2a8
	TArray<bool> vDefaultChatPopUps; // 0x2b8
	bool bDisableHelpChat; // 0x2c8
	bool bSavedDisableHelpChat; // 0x2c9
	TArray<FColor> vChatColors; // 0x2d8
	TArray<FColor> vSavedChatColors; // 0x2e8
	TArray<FColor> vDefaultChatColors; // 0x2f8
	TArray<FColor> vNonModifiableChatColors; // 0x308
	TArray<bool> vUICheckBoxes; // 0x360
	TArray<bool> vSavedUICheckBoxes; // 0x370
	TArray<bool> vDefaultUICheckBoxes; // 0x380
	TArray<int32_t> vUIComboBoxes; // 0x398
	TArray<int32_t> vSavedUIComboBoxes; // 0x3a8
	TArray<int32_t> vDefaultUIComboBoxes; // 0x3b8
	TArray<float> vUISliders; // 0x3d0
	TArray<float> vSavedUISliders; // 0x3e0
	TArray<float> vDefaultUISliders; // 0x3f0
	TArray<bool> vGameplayCheckBoxes; // 0x418
	TArray<bool> vSavedGameplayCheckBoxes; // 0x428
	TArray<bool> vDefaultGameplayCheckBoxes; // 0x438
	TArray<int32_t> vGameplayComboBoxes; // 0x450
	TArray<int32_t> vSavedGameplayComboBoxes; // 0x460
	TArray<int32_t> vDefaultGameplayComboBoxes; // 0x470
	TArray<float> vGameplaySliders; // 0x488
	TArray<float> vSavedGameplaySliders; // 0x498
	TArray<float> vDefaultGameplaySliders; // 0x4a8
	FString sSavedLanguage; // 0x4c8
	TMap<EHint, FMOHintDefinitions> vHints; // 0x4e8
	TMap<EHint, FMOHintDefinitions> vSavedHints; // 0x538
	TMap<FString, FString> vBlockedVoipPlayersThroughSteamID; // 0x588
	TMap<FString, FString> vBlockedVoipPlayersThroughDisplayName; // 0x5d8
};

struct UNiagaraDataInterfaceGrid3DCollection : UNiagaraDataInterfaceGrid3D {
	int32_t NumAttributes; // 0x100
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0x108
	ENiagaraGpuBufferFormat BufferFormat; // 0x128
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct UMOHavenCitySelect : UMOUserWidget {
	UMOCarouselSelectText* pMOCarousel_MyrlandCitySelect; // 0x2c8
	UMOCurrencyWidget* pMOCurrencyWidget; // 0x2d0
	UMOButtonHold* pMOButtonHold_ConfirmCity; // 0x2d8
	UTextBlock* pTextBlock_TitleName; // 0x2e0
	UTextBlock* pTextBlock_TotalItems; // 0x2e8
	UTextBlock* pTextBlock_Warning; // 0x2f0
	UTextBlock* pTextBlock_PlaceItems; // 0x2f8
	UTextBlock* pTextBlock_CityText; // 0x300
	UTextBlock* pTextBlock_CityText2; // 0x308
	UImage* pImage_City; // 0x310
	UVerticalBox* pVerticalBox_PlaceItems; // 0x318
	UMOBorderHeaderTabs* pMOBorder; // 0x320
	UMOScrollBoxPlaceItems* pMOScrollBox_ItemsToBring; // 0x328
	UMOPopupMessage* pPopupWarning; // 0x330
	UBackgroundBlur* pPopupBGBlur; // 0x338
	FString sFailReason; // 0x340
	TArray<UTexture2D*> vCityTextures; // 0x350
	TArray<FString> vCityTexts; // 0x360
};

struct USubmixEffectStereoDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct UNetDriver : UObject {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t NetServerMaxTickRate; // 0x58
	int32_t MaxNetTickRate; // 0x5c
	int32_t MaxInternetClientRate; // 0x60
	int32_t MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	UNetConnection* ServerConnection; // 0x88
	TArray<UNetConnection*> ClientConnections; // 0x90
	int32_t RecentlyDisconnectedTrackingTime; // 0x100
	UWorld* World; // 0x140
	UPackage* WorldPackage; // 0x148
	UObject* NetConnectionClass; // 0x170
	UObject* ReplicationDriverClass; // 0x178
	FName NetDriverName; // 0x190
	TArray<FChannelDefinition> ChannelDefinitions; // 0x198
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1a8
	TArray<UChannel*> ActorChannelPool; // 0x1f8
	float Time; // 0x210
	UReplicationDriver* ReplicationDriver; // 0x6e8
};

struct UMovieScenePropertySystem : UMovieSceneEntitySystem {
	UMovieScenePropertyInstantiatorSystem* InstantiatorSystem; // 0x40
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UAndroidPermissionCallbackProxy : UObject {
	FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate; // 0x28
};

struct USourceEffectFoldbackDistortionPreset : USoundEffectSourcePreset {
	FSourceEffectFoldbackDistortionSettings Settings; // 0x9c
};

struct UMOBrokerPickupItems : UMOUserWidget {
	UMOButton* pMOButton_Close; // 0x2c8
	UMOMailItemListEntry* cMOMailItemListEntryClass; // 0x2d0
	UMOScrollBox* pMOScrollBox_Items; // 0x2d8
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UWB_MOCharCreationFinalizePanel_C : UMOCharCreationFinalizePanel {
	FPointerToUberGraphFrame UberGraphFrame; // 0x318
	UTextBlock* pLabelText; // 0x320
	UTextBlock* pLabelText_2; // 0x328
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x48
};

struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UMOSkills : UMOUserWidget {
	UMOSkillsTree* pSkillTreeAbilities; // 0x2c8
	UMOSkillsTree* pSkillTreeCrafting; // 0x2d0
	UMOSkillsVeteran* pSkillVeteran; // 0x2d8
};

struct UMaterialExpressionLandscapeLayerSample : UMaterialExpression {
	FName ParameterName; // 0x40
	float PreviewWeight; // 0x48
	FGuid ExpressionGUID; // 0x4c
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x230
};

struct UWaterSplineMetadata : USplineMetadata {
	FInterpCurveFloat Depth; // 0x28
	FInterpCurveFloat WaterVelocityScalar; // 0x40
	FInterpCurveFloat RiverWidth; // 0x58
	FInterpCurveFloat AudioIntensity; // 0x70
	FInterpCurveVector WaterVelocity; // 0x88
};

struct UGraphNodeContextMenuContext : UObject {
	UBlueprint* Blueprint; // 0x28
	UEdGraph* Graph; // 0x30
	UEdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48
};

struct UMaterialExpressionHairAttributes : UMaterialExpression {
	char bUseTangentSpace : 1; // 0x40
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct UMODataAssetTattooPlacement : UPrimaryDataAsset {
	UMODataAssetTattooEffectTextures* pTattooEffectTextures; // 0x30
	float BO_UseUvSet2; // 0x38
	float BO_UseUvSet3; // 0x3c
	float BO_UDIM_Mask; // 0x40
	float BO_UDIM_ID; // 0x44
	float BO_BodyOrnament_Left; // 0x48
	float BO_BodyOrnament_Right; // 0x4c
	float BO_CenterFix_X; // 0x50
	float BO_CenterFix_Y; // 0x54
	float BO_RotateCenter_X; // 0x58
	float BO_RotateCenter_Y; // 0x5c
	float BO_RotateCenter_Rotation; // 0x60
	float BO_Scale; // 0x64
	float BO_Scale_X; // 0x68
	float BO_Scale_Y; // 0x6c
	float BO_Translation_X; // 0x70
	float BO_Translation_Y; // 0x74
};

struct UProceduralFoliageTile : UObject {
	UProceduralFoliageSpawner* FoliageSpawner; // 0x28
	TArray<FProceduralFoliageInstance> InstancesArray; // 0xd0
};

struct UNiagaraDataInterfaceSkeletalMesh : UNiagaraDataInterface {
	ENDISkeletalMesh_SourceMode SourceMode; // 0x38
	AActor* Source; // 0x40
	FNiagaraUserParameterBinding MeshUserParameter; // 0x48
	USkeletalMeshComponent* SourceComponent; // 0x68
	ENDISkeletalMesh_SkinningMode SkinningMode; // 0x70
	TArray<FName> SamplingRegions; // 0x78
	int32_t WholeMeshLOD; // 0x88
	TArray<FName> FilteredBones; // 0x90
	TArray<FName> FilteredSockets; // 0xa0
	FName ExcludeBoneName; // 0xb0
	char bExcludeBone : 1; // 0xb8
	bool bRequireCurrentFrameData; // 0xb9
};

struct UMovieSceneTakeSection : UMovieSceneSection {
	FMovieSceneIntegerChannel HoursCurve; // 0xe8
	FMovieSceneIntegerChannel MinutesCurve; // 0x178
	FMovieSceneIntegerChannel SecondsCurve; // 0x208
	FMovieSceneIntegerChannel FramesCurve; // 0x298
	FMovieSceneFloatChannel SubFramesCurve; // 0x328
	FMovieSceneStringChannel Slate; // 0x3c8
};

struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	UStaticMesh* ParticleMesh; // 0x80
	ENiagaraSortMode SortMode; // 0x88
	char bOverrideMaterials : 1; // 0x8c
	char bSortOnlyWhenTranslucent : 1; // 0x8c
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0x90
	FVector2D SubImageSize; // 0xa0
	char bSubImageBlend : 1; // 0xa8
	ENiagaraMeshFacingMode FacingMode; // 0xac
	char bLockedAxisEnable : 1; // 0xb0
	FVector LockedAxis; // 0xb4
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0xc0
	FVector PivotOffset; // 0xc4
	ENiagaraMeshPivotOffsetSpace PivotOffsetSpace; // 0xd0
	char bEnableFrustumCulling : 1; // 0xd4
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x248
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x2a0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x2f8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x400
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x458
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x4b0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x508
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x560
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x5b8
};

struct UWB_TooltipSpell_C : UMOTooltipSpell {
	UCanvasPanel* CanvasPanel_1; // 0x290
	UImage* Image_Line; // 0x298
	UTextBlock* TextBlock_1; // 0x2a0
	UTextBlock* WeightText; // 0x2a8
};

struct UGizmoLineHandleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x460
	float HandleSize; // 0x46c
	float Thickness; // 0x470
	FVector Direction; // 0x474
	float Length; // 0x480
	bool bImageScale; // 0x484
};

struct UARPin : UObject {
	UARTrackedGeometry* TrackedGeometry; // 0x28
	USceneComponent* PinnedComponent; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	FMulticastInlineDelegate OnARTrackingStateChanged; // 0xc0
	FMulticastInlineDelegate OnARTransformUpdated; // 0xd0
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	bool bRestrictCrossConsole; // 0x50
	bool bEnableRemovalRequests; // 0x51
	TArray<FPartyReservation> Reservations; // 0x58
};

struct UMOButtonSkill : UMOButton {
	FRequiredSkillData sReqData; // 0x438
	FOptionalSkillData sOptData; // 0x488
	UMaterialInstanceDynamic* pMaterialInstance; // 0x4d8
};

struct UBookMark2D : UBookmarkBase {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct AMOAvatarStaticMeshBuildableHouse : AMOAvatarStaticMeshBuildable {
	UStaticMeshComponent* pDoorComponent; // 0x2f8
	UStaticMeshComponent* pChestComponent; // 0x300
	int32_t iNumberOfFloors; // 0x308
	bool bIsLastFloorRoof; // 0x30c
	float fCeilingHeight; // 0x318
	float fFloorZBaseOffset; // 0x31c
	int32_t iMaxNumDecorationsPerFloor; // 0x334
};

struct ULightmassPrimitiveSettingsObject : UObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x28
};

struct UPhysicalMaterialMask : UObject {
	int32_t UVChannelIndex; // 0x28
	TextureAddress AddressX; // 0x2c
	TextureAddress AddressY; // 0x2d
};

struct UPhysicsHandleComponent : UActorComponent {
	UPrimitiveComponent* GrabbedComponent; // 0xb0
	char bSoftAngularConstraint : 1; // 0xc0
	char bSoftLinearConstraint : 1; // 0xc0
	char bInterpolateTarget : 1; // 0xc0
	float LinearDamping; // 0xc4
	float LinearStiffness; // 0xc8
	float AngularDamping; // 0xcc
	float AngularStiffness; // 0xd0
	float InterpolationSpeed; // 0x140
};

struct ANiagaraPreviewGrid : AActor {
	UNiagaraSystem* System; // 0x220
	ENiagaraPreviewGridResetMode ResetMode; // 0x228
	UNiagaraPreviewAxis* PreviewAxisX; // 0x230
	UNiagaraPreviewAxis* PreviewAxisY; // 0x238
	ANiagaraPreviewBase* PreviewClass; // 0x240
	float SpacingX; // 0x248
	float SpacingY; // 0x24c
	int32_t NumX; // 0x250
	int32_t NumY; // 0x254
	TArray<UChildActorComponent*> PreviewComponents; // 0x258
};

struct UEdGraphNode_Documentation : UEdGraphNode {
	FString Link; // 0x98
	FString Excerpt; // 0xa8
};

struct UMaterialExpressionParameter : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
};

struct UMOPreviewModeAI : UMOPreviewMode {
	AMOCharacterAI* pTargetAvatar; // 0x50
};

struct UMOOptionSliderWidget : UMOOptionsEntry {
	UMOSlider* pMOSlider; // 0x328
};

struct UDatasmithCommonTessellationOptions : UDatasmithOptionsBase {
	FDatasmithTessellationOptions Options; // 0x28
};

struct UGameplayTagsDeveloperSettings : UDeveloperSettings {
	FString DeveloperConfigName; // 0x38
	FName FavoriteTagSource; // 0x48
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	FAIDistanceType GeometricDistanceType; // 0xd0
	char bUseParametrizedRadius : 1; // 0xd4
	char bUseNavAgentGoalLocation : 1; // 0xd4
	char bPathFindingBasedTest : 1; // 0xd4
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UBackgroundBlurSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UInterpTrackToggle : UInterpTrack {
	TArray<FToggleTrackKey> ToggleTrack; // 0x70
	char bActivateSystemEachUpdate : 1; // 0x80
	char bActivateWithJustAttachedFlag : 1; // 0x80
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UDatasmithLightComponentTemplate : UDatasmithObjectTemplate {
	char bVisible : 1; // 0x30
	char CastShadows : 1; // 0x34
	char bUseTemperature : 1; // 0x34
	char bUseIESBrightness : 1; // 0x34
	float Intensity; // 0x38
	float Temperature; // 0x3c
	float IESBrightnessScale; // 0x40
	FLinearColor LightColor; // 0x44
	UMaterialInterface* LightFunctionMaterial; // 0x58
	UTextureLightProfile* IESTexture; // 0x60
};

struct UParticleModuleEventReceiverBase : UParticleModuleEventBase {
	EParticleEventType EventGeneratorType; // 0x30
	FName EventName; // 0x34
};

struct UMOSocialGuild : UMOWidgetBlueprint {
	UMOGuildStoneMembers* pGuildStoneMembers; // 0x260
};

struct UGeometryCacheTrack_FlipbookAnimation : UGeometryCacheTrack {
	uint32_t NumMeshSamples; // 0x58
};

struct UNiagaraDataInterfaceGrid2DCollection : UNiagaraDataInterfaceGrid2D {
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xf8
	ENiagaraGpuBufferFormat OverrideBufferFormat; // 0x118
	char bOverrideFormat : 1; // 0x119
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x170
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct USoundSourceBus : USoundWave {
	ESourceBusChannels SourceBusChannels; // 0x370
	float SourceBusDuration; // 0x374
	UAudioBus* AudioBus; // 0x378
	char bAutoDeactivateWhenSilent : 1; // 0x380
};

struct UMovieSceneBuiltInEasingFunction : UObject {
	EMovieSceneBuiltInEasing Type; // 0x30
};

struct UWidgetSwitcher : UPanelWidget {
	int32_t ActiveWidgetIndex; // 0x120
};

struct UDynamicEntryBoxBase : UWidget {
	EDynamicBoxType EntryBoxType; // 0x108
	FVector2D EntrySpacing; // 0x10c
	TArray<FVector2D> SpacingPattern; // 0x118
	FSlateChildSize EntrySizeRule; // 0x128
	EHorizontalAlignment EntryHorizontalAlignment; // 0x130
	EVerticalAlignment EntryVerticalAlignment; // 0x131
	int32_t MaxElementSize; // 0x134
	FRadialBoxSettings RadialBoxSettings; // 0x138
	FUserWidgetPool EntryWidgetPool; // 0x158
};

struct UWB_ItemSlotContainer_C : UMOItemSlotContainer {
	FPointerToUberGraphFrame UberGraphFrame; // 0x350
	UWidgetAnimation* AnimatCooldown; // 0x358
	UWidgetAnimation* HighlightItemAnimation; // 0x360
	UWidgetAnimation* AddItemAnimation; // 0x368
	UWidgetAnimation* DestroyItemAnimation; // 0x370
	UImage* pCooldownImageNew; // 0x378
	UWB_SplitStack_C* SplitStackRef; // 0x380
};

struct UGizmoAxisTranslationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Parameter; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurTranslationAxis; // 0xbc
	FVector CurTranslationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct UMODialogSystem : UMOUserWidget {
	UTextBlock* sTextBoxText; // 0x2c8
	UTextBlock* sNPCName; // 0x2d0
	UTextBlock* uResponse1; // 0x2d8
	UTextBlock* uResponse2; // 0x2e0
	UTextBlock* uResponse3; // 0x2e8
	UTextBlock* uResponse4; // 0x2f0
	UTextBlock* uResponse5; // 0x2f8
	UMOButton* uResponseButton1; // 0x300
	UMOButton* uResponseButton2; // 0x308
	UMOButton* uResponseButton3; // 0x310
	UMOButton* uResponseButton4; // 0x318
	UMOButton* uResponseButton5; // 0x320
	UMOButton* uQuitResponseButton; // 0x328
	FText sGreetingPhrase; // 0x330
	TArray<UTextBlock*> vResponses; // 0x348
	TArray<UMOButton*> vResponsesButtons; // 0x358
	UMODataAssetNPCConversation* pCurrentConversation; // 0x368
	UMODataAssetNPCConversation* pResetConversation; // 0x370
	UMOHUD* pHUD; // 0x378
	AMOCharacterAI* pOwner; // 0x380
	AMOPlayerController* pPlayerController; // 0x388
};

struct UMOCharCreationAttributesPanel : UMOCharCreationPanel {
	int32_t iAttributePoints; // 0x2d0
	int32_t iAttributePointsGainedFromSize; // 0x2d4
	int32_t iTotalAttributePoints; // 0x2d8
	int32_t iStartAttributePoints; // 0x2dc
	TArray<UMOCarouselSelectValue*> vAttributeCarousels; // 0x2f0
	UMOCarouselSelectValue* pCarouselSelect_Str; // 0x300
	UMOCarouselSelectValue* pCarouselSelect_Dex; // 0x308
	UMOCarouselSelectValue* pCarouselSelect_Con; // 0x310
	UMOCarouselSelectValue* pCarouselSelect_Int; // 0x318
	UMOCarouselSelectValue* pCarouselSelect_Psy; // 0x320
	UMOCarouselSelectValue* pCarouselSelect_Age; // 0x328
	UMOCarouselSelectValue* pCarouselSelect_Size; // 0x330
	UMOCarouselSelectValue* pLastUpdatedCarousel; // 0x338
	UMOCharCreationInfoEntry* pInfoEntry_AttributePoints; // 0x340
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UDataTable : UObject {
	UScriptStruct* RowStruct; // 0x28
	char bStripFromClientBuilds : 1; // 0x80
	char bIgnoreExtraFields : 1; // 0x80
	char bIgnoreMissingFields : 1; // 0x80
	FString ImportKeyField; // 0x88
};

struct UAnimNotify_PlayNiagaraEffect : UAnimNotify {
	UNiagaraSystem* Template; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	bool bAbsoluteScale; // 0x64
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UFindTurnBasedMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28
	bool bUseDynamicResolution; // 0x29
	uint32_t ResolutionSizeX; // 0x80
	uint32_t ResolutionSizeY; // 0x84
	uint32_t LastUserConfirmedResolutionSizeX; // 0x88
	uint32_t LastUserConfirmedResolutionSizeY; // 0x8c
	int32_t WindowPosX; // 0x90
	int32_t WindowPosY; // 0x94
	int32_t FullscreenMode; // 0x98
	int32_t LastConfirmedFullscreenMode; // 0x9c
	int32_t PreferredFullscreenMode; // 0xa0
	uint32_t Version; // 0xa4
	int32_t AudioQualityLevel; // 0xa8
	int32_t LastConfirmedAudioQualityLevel; // 0xac
	float FrameRateLimit; // 0xb0
	int32_t DesiredScreenWidth; // 0xb8
	bool bUseDesiredScreenHeight; // 0xbc
	int32_t DesiredScreenHeight; // 0xc0
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xc4
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xc8
	float LastRecommendedScreenWidth; // 0xcc
	float LastRecommendedScreenHeight; // 0xd0
	float LastCPUBenchmarkResult; // 0xd4
	float LastGPUBenchmarkResult; // 0xd8
