// Created by BlueFire1337
// Updated 2022-01-26
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x62832c0;
	constexpr auto GObjects = 0x629ba50;
	constexpr auto GWorld = 0x63d7c00;
}

struct USkeletalMeshSocket : UObject {
	FName SocketName; // 0x28
	FName BoneName; // 0x30
	FVector RelativeLocation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale; // 0x50
	bool bForceAlwaysAnimated; // 0x5c
	bool bCanBeAffectedByMorphTargets; // 0x5d
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UMaterialExpressionChannelMaskParameter : UMaterialExpressionVectorParameter {
	EChannelMaskParameterColor MaskChannel; // 0x70
};

struct UAbilityTask_ApplyRootMotionRadialForce : UAbilityTask_ApplyRootMotion_Base {
	FMulticastInlineDelegate OnFinish; // 0xc0
	FVector Location; // 0xd0
	AActor* LocationActor; // 0xe0
	float Strength; // 0xe8
	float Duration; // 0xec
	float Radius; // 0xf0
	bool bIsPush; // 0xf4
	bool bIsAdditive; // 0xf5
	bool bNoZForce; // 0xf6
	UCurveFloat* StrengthDistanceFalloff; // 0xf8
	UCurveFloat* StrengthOverTime; // 0x100
	bool bUseFixedWorldDirection; // 0x108
	FRotator FixedWorldDirection; // 0x10c
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x4b0
	EWidgetTimingPolicy TimingPolicy; // 0x4b1
	UUserWidget* WidgetClass; // 0x4b8
	FIntPoint DrawSize; // 0x4c0
	bool bManuallyRedraw; // 0x4c8
	bool bRedrawRequested; // 0x4c9
	float RedrawTime; // 0x4cc
	FIntPoint CurrentDrawSize; // 0x4d8
	bool bDrawAtDesiredSize; // 0x4e0
	FVector2D Pivot; // 0x4e4
	bool bReceiveHardwareInput; // 0x4ec
	bool bWindowFocusable; // 0x4ed
	EWindowVisibility WindowVisibility; // 0x4ee
	bool bApplyGammaCorrection; // 0x4ef
	ULocalPlayer* OwnerPlayer; // 0x4f0
	FLinearColor BackgroundColor; // 0x4f8
	FLinearColor TintColorAndOpacity; // 0x508
	float OpacityFromTexture; // 0x518
	EWidgetBlendMode BlendMode; // 0x51c
	bool bIsTwoSided; // 0x51d
	bool TickWhenOffscreen; // 0x51e
	UBodySetup* BodySetup; // 0x520
	UMaterialInterface* TranslucentMaterial; // 0x528
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x530
	UMaterialInterface* OpaqueMaterial; // 0x538
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x540
	UMaterialInterface* MaskedMaterial; // 0x548
	UMaterialInterface* MaskedMaterial_OneSided; // 0x550
	UTextureRenderTarget2D* RenderTarget; // 0x558
	UMaterialInstanceDynamic* MaterialInstance; // 0x560
	bool bAddedToScreen; // 0x568
	bool bEditTimeUsable; // 0x569
	FName SharedLayerName; // 0x56c
	int32_t LayerZOrder; // 0x574
	EWidgetGeometryMode GeometryMode; // 0x578
	float CylinderArcAngle; // 0x57c
	ETickMode TickMode; // 0x580
	UUserWidget* Widget; // 0x5a8
};

struct ANatureEnvironmentVolume : AVolume {
	TWeakObjectPtr<ANatureController> NatureController; // 0x348
	int32_t Priority; // 0x350
	EEnvironmentVolumeType VolumeType; // 0x354
	float ReduceResistance; // 0x358
};

struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x310
	float CraneYaw; // 0x314
	float CraneArmLength; // 0x318
	bool bLockMountPitch; // 0x31c
	bool bLockMountYaw; // 0x31d
	USceneComponent* TransformComponent; // 0x320
	USceneComponent* CraneYawControl; // 0x328
	USceneComponent* CranePitchControl; // 0x330
	USceneComponent* CraneCameraMount; // 0x338
};

struct UTextureLightProfile : UTexture2D {
	float Brightness; // 0x100
	float TextureMultiplier; // 0x104
};

struct UProceduralDiscToolProperties : UProceduralShapeToolProperties {
	float Radius; // 0x70
	int32_t RadialSlices; // 0x74
	int32_t RadialSubdivisions; // 0x78
};

struct UUI_Altar : USGUI {
	TWeakObjectPtr<ASGStructureAltar> BindAltar; // 0x2d8
	UVerticalBox* DeadlyGeneralVertical; // 0x2e0
	UVerticalBox* RestGeneralVertical; // 0x2e8
	UButton* AddFoodButton; // 0x2f0
	UButton* AddLifeCountButton; // 0x2f8
	UButton* ReleaseGeneralButton; // 0x300
	UButton* RebornGeneralButton; // 0x308
	UTextBlock* LeftFoodAmount; // 0x310
	UButton* CloseButton; // 0x318
	UAltarGeneralSlot* AltarGeneralSlotTemplate; // 0x320
	TArray<UAltarGeneralSlot*> GeneralSlotList; // 0x328
	FGuid SelectedGeneralGuid; // 0x340
	FGuid ReduceRebornGeneralGuid; // 0x350
	UTextBlock* OtherUsingText; // 0x360
	TWeakObjectPtr<USGInventoryComponent> BindInventory; // 0x368
	FDateTime FinalRebornTime; // 0x370
};

struct UToIntegerField : UFieldNodeInt {
	UFieldNodeFloat* FloatField; // 0xc0
};

struct UNiagaraDataInterfaceArrayQuat : UNiagaraDataInterfaceArray {
	TArray<FQuat> QuatData; // 0x50
};

struct UUI_ChangeName : USGUI {
	UTextBlock* OriginName; // 0x2f0
	UEditableTextBox* ChangeName; // 0x2f8
	UButton* Confirm; // 0x300
	UButton* Cancel; // 0x308
	char bForceChangeName : 1; // 0x310
};

struct AUIWSWaterBody : AActor {
	AUIWSManager* MyManager; // 0x310
	UDecalComponent* CausticsDecal; // 0x380
	bool UseHISM; // 0x389
	FVector HISMScaleOffset; // 0x38c
	bool CanUseGerstnerWave; // 0x3a0
	int32_t WaterBodyIndex; // 0x3a4
	float MaxWaveHeightOffset; // 0x3a8
	UWaterWavesBase* WaterWaves; // 0x3b0
	bool EpicWaterMaterials; // 0x3c8
	float CullDistance; // 0x3cc
	UMaterialInterface* WaterBodyMat; // 0x3d0
	UMaterialInterface* WaterBodyMatLOD1; // 0x3d8
	UMaterialInterface* WaterCustomBodyMat; // 0x3e0
	UMaterialInterface* WaterCustomBodyMatLOD1; // 0x3e8
	UMaterialInterface* WaterRiverMat; // 0x3f0
	UMaterialInterface* WaterRiverMatLOD1; // 0x3f8
	UMaterialParameterCollection* MPC_Water; // 0x400
	float FogIntensity; // 0x408
	float MaxDepth; // 0x40c
	float NearPlane; // 0x410
	float ScatteringAniso; // 0x414
	FLinearColor PPAbsorption; // 0x418
	FLinearColor PPAbsorptionDark; // 0x428
	FLinearColor FogAmbientColor; // 0x438
	FLinearColor FogAmbientColorDark; // 0x448
	FLinearColor FogScatterColor; // 0x458
	FLinearColor FogScatterColorDark; // 0x468
	float Wave_Intensity; // 0x478
	bool OverrideWaterMaterials; // 0x490
	UMaterialInterface* CustomWaterMaterial; // 0x498
	UMaterialInterface* CustomWaterMaterialDistant; // 0x4a0
	bool bIsInteractive; // 0x4a9
	bool bDisableAutomaticInteraction; // 0x4aa
	bool bDisableAutomaticInteractionXbox; // 0x4ab
	bool bDisableAutomaticInteractionPS4; // 0x4ac
	bool bDisableAutomaticInteractionNintendoSwitch; // 0x4ad
	bool bDisableAutomaticInteractionAndroid; // 0x4ae
	bool bDisableAutomaticInteractionIOS; // 0x4af
	int32_t MaxTileScale; // 0x4b0
	int32_t SimResMin; // 0x4b4
	bool bTieSimToFPS; // 0x4b8
	bool InteractOnDamage; // 0x4b9
	bool bLimitTickRate; // 0x4ba
	float TickRate; // 0x4bc
	float DamageScale; // 0x4c0
	FLinearColor WaterColor; // 0x4c8
	FLinearColor DeepOpacity; // 0x4d8
	FLinearColor ShallowOpacity; // 0x4e8
	float DepthTransitionDistance; // 0x4f8
	float UnderWaterBrightnessMult; // 0x4fc
	float ShallowEdgeFadeDistance; // 0x500
	float ShallowEdgeFadePower; // 0x504
	bool bEnableParticleOnDamage; // 0x508
	bool bEnableParticleOnCollision; // 0x509
	bool bOverrideParticleSettings; // 0x50a
	float InteractionEffectScaleMin; // 0x50c
	float InteractionEffectScaleMax; // 0x510
	UParticleSystem* InteractionEffect; // 0x518
	float DamageEffectScaleMin; // 0x520
	float DamageEffectScaleMax; // 0x524
	UParticleSystem* DamageEffect; // 0x528
	UTextureRenderTarget2D* activeheight0; // 0x560
	UTextureRenderTarget2D* activeheight1; // 0x568
	UTextureRenderTarget2D* activeheight2; // 0x570
	UTextureRenderTarget2D* activenormal; // 0x578
	UTextureRenderTarget2D* localheight0; // 0x580
	UTextureRenderTarget2D* localheight1; // 0x588
	UTextureRenderTarget2D* localheight2; // 0x590
	UTextureRenderTarget2D* localnormal; // 0x598
	UTextureRenderTarget2D* globalheight0; // 0x5a0
	UTextureRenderTarget2D* globalheight1; // 0x5a8
	UTextureRenderTarget2D* globalheight2; // 0x5b0
	UTextureRenderTarget2D* globalnormal; // 0x5b8
	UParticleSystem* DefaultSplashEffect; // 0x5e8
	UMaterialInstanceDynamic* WaterMID; // 0x5f0
	UMaterialInstanceDynamic* WaterMIDLOD1; // 0x5f8
	UMaterialInstanceDynamic* HeightSimInst; // 0x610
	UMaterialInstanceDynamic* ForceSplatInst; // 0x618
	UMaterialInstanceDynamic* ManualSplatInst; // 0x620
	UMaterialInstanceDynamic* ManualBoxSplatInst; // 0x628
	UMaterialInstanceDynamic* ComputeNormalInst; // 0x630
	UCanvas* Canvas; // 0x638
	FVector2D Size; // 0x640
	FDrawToRenderTargetContext Context; // 0x648
	UCanvas* CanvasMan; // 0x658
	FVector2D SizeMan; // 0x660
	FDrawToRenderTargetContext ContextMan; // 0x668
	bool ActivateCaustics; // 0x678
	UMaterialInterface* CausticsMat; // 0x688
	float CausticsStartHeight; // 0x690
	float CausticsDecalSizeZ; // 0x694
	FLinearColor EmisiveColor; // 0x698
	bool EnableRayTraceCaustics; // 0x6ac
};

struct UAttackRebound_AnimNotifyState : UAnimNotifyState {
	EAttackSocketType Enum_AttackSocketType; // 0x30
	FString AttackTag; // 0x38
	char bCloseAttackTrace : 1; // 0x48
	char IsOffHandWeapon : 1; // 0x48
	char IsKickAttack : 1; // 0x48
	char ClearAimState : 1; // 0x48
	float TriggerTime; // 0x4c
	TArray<FTransform> AttackAnimBoneData; // 0x50
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x310
	FColor BrushColor; // 0x314
	int32_t PolyFlags; // 0x318
	char bColored : 1; // 0x31c
	char bSolidWhenSelected : 1; // 0x31c
	char bPlaceableFromClassBrowser : 1; // 0x31c
	char bNotForClientOrServer : 1; // 0x31c
	UModel* Brush; // 0x320
	UBrushComponent* BrushComponent; // 0x328
	char bInManipulation : 1; // 0x330
	TArray<FGeomSelection> SavedSelections; // 0x338
};

struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x210
	float LDMaxDrawDistance; // 0x214
	float CachedMaxDrawDistance; // 0x218
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x21c
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x21d
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x21e
	ELightmapType LightmapType; // 0x21f
	char bUseMaxLODAsImposter : 1; // 0x220
	char bBatchImpostersAsInstances : 1; // 0x220
	char bNeverDistanceCull : 1; // 0x220
	char bDisallowAddToPhysicsScene : 1; // 0x220
	char bAlwaysCreatePhysicsState : 1; // 0x221
	char bGenerateOverlapEvents : 1; // 0x221
	char bMultiBodyOverlap : 1; // 0x221
	char bTraceComplexOnMove : 1; // 0x221
	char bReturnMaterialOnMove : 1; // 0x221
	char bOptimizeForceDynamicPhysicalState : 1; // 0x221
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x221
	char bAllowCullDistanceVolume : 1; // 0x222
	char bHasMotionBlurVelocityMeshes : 1; // 0x222
	char bVisibleInReflectionCaptures : 1; // 0x222
	char bVisibleInRealTimeSkyCaptures : 1; // 0x222
	char bVisibleInRayTracing : 1; // 0x222
	char bRenderInMainPass : 1; // 0x222
	char bRenderInDepthPass : 1; // 0x222
	char bReceivesDecals : 1; // 0x222
	char bOwnerNoSee : 1; // 0x223
	char bOnlyOwnerSee : 1; // 0x223
	char bTreatAsBackgroundForOcclusion : 1; // 0x223
	char bUseAsOccluder : 1; // 0x223
	char bSelectable : 1; // 0x223
	char bForceMipStreaming : 1; // 0x223
	char bHasPerInstanceHitProxies : 1; // 0x223
	char CastShadow : 1; // 0x223
	char bAffectDynamicIndirectLighting : 1; // 0x224
	char bAffectDistanceFieldLighting : 1; // 0x224
	char bCastDynamicShadow : 1; // 0x224
	char bCastStaticShadow : 1; // 0x224
	char bCastVolumetricTranslucentShadow : 1; // 0x224
	char bCastContactShadow : 1; // 0x224
	char bSelfShadowOnly : 1; // 0x224
	char bCastFarShadow : 1; // 0x224
	char bCastInsetShadow : 1; // 0x225
	char bCastCinematicShadow : 1; // 0x225
	char bCastHiddenShadow : 1; // 0x225
	char bCastShadowAsTwoSided : 1; // 0x225
	char bLightAsIfStatic : 1; // 0x225
	char bLightAttachmentsAsGroup : 1; // 0x225
	char bExcludeFromLightAttachmentGroup : 1; // 0x225
	char bReceiveMobileCSMShadows : 1; // 0x225
	char bSingleSampleShadowFromStationaryLights : 1; // 0x226
	char bIgnoreRadialImpulse : 1; // 0x226
	char bIgnoreRadialForce : 1; // 0x226
	char bApplyImpulseOnDamage : 1; // 0x226
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x226
	char bFillCollisionUnderneathForNavmesh : 1; // 0x226
	char AlwaysLoadOnClient : 1; // 0x226
	char AlwaysLoadOnServer : 1; // 0x226
	char bUseEditorCompositing : 1; // 0x227
	char bRenderCustomDepth : 1; // 0x227
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x22e
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x230
	FLightingChannels LightingChannels; // 0x231
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x232
	int32_t CustomDepthStencilValue; // 0x234
	FCustomPrimitiveData CustomPrimitiveData; // 0x238
	FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x248
	int32_t TranslucencySortPriority; // 0x260
	int32_t VisibilityId; // 0x264
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x268
	int8_t VirtualTextureLodBias; // 0x278
	int8_t VirtualTextureCullMips; // 0x279
	int8_t VirtualTextureMinCoverage; // 0x27a
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x27b
	float LpvBiasMultiplier; // 0x280
	float OverrideStepHeight; // 0x284
	float BoundsScale; // 0x298
	TArray<AActor*> MoveIgnoreActors; // 0x2b8
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2c8
	FBodyInstance BodyInstance; // 0x2e8
	FMulticastSparseDelegate OnComponentHit; // 0x448
	FMulticastSparseDelegate OnComponentBeginOverlap; // 0x449
	FMulticastSparseDelegate OnComponentEndOverlap; // 0x44a
	FMulticastSparseDelegate OnComponentWake; // 0x44b
	FMulticastSparseDelegate OnComponentSleep; // 0x44c
	FMulticastSparseDelegate OnBeginCursorOver; // 0x44e
	FMulticastSparseDelegate OnEndCursorOver; // 0x44f
	FMulticastSparseDelegate OnClicked; // 0x450
	FMulticastSparseDelegate OnReleased; // 0x451
	FMulticastSparseDelegate OnInputTouchBegin; // 0x452
	FMulticastSparseDelegate OnInputTouchEnd; // 0x453
	FMulticastSparseDelegate OnInputTouchEnter; // 0x454
	FMulticastSparseDelegate OnInputTouchLeave; // 0x455
	UPrimitiveComponent* LODParentPrimitive; // 0x470
};

struct UBakedOcclusionMapVisualizationProperties : UInteractiveToolPropertySet {
	float BaseGrayLevel; // 0x60
	float OcclusionMultiplier; // 0x64
};

struct UAISenseConfig_Hearing : UAISenseConfig {
	UAISense_Hearing* Implementation; // 0x48
	float HearingRange; // 0x50
	float LoSHearingRange; // 0x54
	char bUseLoSHearing : 1; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe8
	UAnimSequence* AnimSequence; // 0x1c0
	UAnimSequenceBase* Animation; // 0x1c8
	float StartOffset; // 0x1d0
	float EndOffset; // 0x1d4
	float PlayRate; // 0x1d8
	char bReverse : 1; // 0x1dc
	FName SlotName; // 0x1e0
	FVector StartLocationOffset; // 0x1e8
	FRotator StartRotationOffset; // 0x1f4
	bool bMatchWithPrevious; // 0x200
	FName MatchedBoneName; // 0x204
	FVector MatchedLocationOffset; // 0x20c
	FRotator MatchedRotationOffset; // 0x218
	bool bMatchTranslation; // 0x224
	bool bMatchIncludeZHeight; // 0x225
	bool bMatchRotationYaw; // 0x226
	bool bMatchRotationPitch; // 0x227
	bool bMatchRotationRoll; // 0x228
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x310
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct APlayerCameraManager : AActor {
	APlayerController* PCOwner; // 0x310
	USceneComponent* TransformComponent; // 0x318
	float DefaultFOV; // 0x328
	float DefaultOrthoWidth; // 0x330
	float DefaultAspectRatio; // 0x338
	FCameraCacheEntry CameraCache; // 0x380
	FCameraCacheEntry LastFrameCameraCache; // 0x980
	FTViewTarget ViewTarget; // 0xf80
	FTViewTarget PendingViewTarget; // 0x1590
	FCameraCacheEntry CameraCachePrivate; // 0x1bd0
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x21d0
	TArray<UCameraModifier*> ModifierList; // 0x27d0
	TArray<UCameraModifier*> DefaultModifiers; // 0x27e0
	float FreeCamDistance; // 0x27f0
	FVector FreeCamOffset; // 0x27f4
	FVector ViewTargetOffset; // 0x2800
	FMulticastInlineDelegate OnAudioFadeChangeEvent; // 0x2810
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x2830
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x2840
	UCameraAnimInst* AnimInstPool[0x8]; // 0x2848
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2888
	TArray<UCameraAnimInst*> ActiveAnims; // 0x28a8
	TArray<UCameraAnimInst*> FreeAnims; // 0x28b8
	ACameraActor* AnimCameraActor; // 0x28c8
	char bIsOrthographic : 1; // 0x28d0
	char bDefaultConstrainAspectRatio : 1; // 0x28d0
	char bClientSimulatingViewTarget : 1; // 0x28d0
	char bUseClientSideCameraUpdates : 1; // 0x28d0
	char bGameCameraCutThisFrame : 1; // 0x28d1
	float ViewPitchMin; // 0x28d4
	float ViewPitchMax; // 0x28d8
	float ViewYawMin; // 0x28dc
	float ViewYawMax; // 0x28e0
	float ViewRollMin; // 0x28e4
	float ViewRollMax; // 0x28e8
	float ServerUpdateCameraTimeout; // 0x28f0
};

struct UMirrorTool : UMultiSelectionTool {
	UMirrorToolProperties* Settings; // 0x98
	UMirrorToolActionPropertySet* ToolActions; // 0xa0
	TArray<UDynamicMeshReplacementChangeTarget*> MeshesToMirror; // 0xa8
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xb8
	UConstructionPlaneMechanic* PlaneMechanic; // 0x110
};

struct UFoliageType_Actor : UFoliageType {
	AActor* ActorClass; // 0x3d8
	bool bShouldAttachToBaseComponent; // 0x3e0
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x4b8
	USkeletalMesh* SkeletalMeshSimple; // 0x4c0
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x4c8
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x4d0
	TArray<FVertexOffsetUsage> VertexOffsetUsage; // 0x4e0
	UPhysicsAsset* PhysicsAssetOverride; // 0x5e8
	int32_t ForcedLodModel; // 0x5f0
	int32_t MinLodModel; // 0x5f4
	float StreamingDistanceMultiplier; // 0x600
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x610
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x644
	char bNoMeshPhysics : 1; // 0x645
	char bUseSimpleMesh : 1; // 0x645
	char bCloseBonesUpdate : 1; // 0x645
	char bSimulateAnimSwitch : 1; // 0x645
	char bOverrideMinLod : 1; // 0x647
	char bUseBoundsFromMasterPoseComponent : 1; // 0x647
	char bForceWireframe : 1; // 0x647
	char bDisplayBones : 1; // 0x647
	char bDisableMorphTarget : 1; // 0x647
	char bHideSkin : 1; // 0x648
	char bPerBoneMotionBlur : 1; // 0x648
	char bComponentUseFixedSkelBounds : 1; // 0x648
	char bConsiderAllBodiesForBounds : 1; // 0x648
	char bSyncAttachParentLOD : 1; // 0x648
	char bCanHighlightSelectedSections : 1; // 0x648
	char bRecentlyRendered : 1; // 0x648
	char bCastCapsuleDirectShadow : 1; // 0x648
	char bCastCapsuleIndirectShadow : 1; // 0x649
	char bCPUSkinning : 1; // 0x649
	char bEnableUpdateRateOptimizations : 1; // 0x649
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x649
	char bRenderStatic : 1; // 0x649
	char bIgnoreMasterPoseComponentLOD : 1; // 0x649
	char bCachedLocalBoundsUpToDate : 1; // 0x64a
	char bForceMeshObjectUpdate : 1; // 0x64a
	float CapsuleIndirectShadowMinVisibility; // 0x64c
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x664
	FMatrix CachedWorldToLocalTransform; // 0x680
};

struct UUI_TrafficGoods : USGUI {
	UTextBlock* MenuNameText; // 0x2d8
	UTextBlock* RefreshTimeText; // 0x2e0
	UTextBlock* RefreshCapitalTimeText; // 0x2e8
	UTextBlock* RefreshPriceRatioTimeText; // 0x2f0
	UUniformGridPanel* MainGridPannel; // 0x2f8
	UButton* LeftPageButton; // 0x300
	UTextBlock* PageText; // 0x308
	UButton* RightPageButton; // 0x310
	UTextBlock* OwnerCapitalNumText; // 0x318
	UButton* ButtonCancel; // 0x320
	UTextBlock* CancelText; // 0x328
	UTextBlock* ConfirmText; // 0x330
	UButton* ButtonConfirm; // 0x338
	UUI_TrafficGoodsSlot* TrafficGoodsSlotClass; // 0x340
};

struct UAnimSet : UObject {
	char bAnimRotationOnly : 1; // 0x28
	TArray<FName> TrackBoneNames; // 0x30
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x40
	TArray<char> BoneUseAnimTranslation; // 0x50
	TArray<char> ForceUseMeshTranslation; // 0x60
	TArray<FName> UseTranslationBoneNames; // 0x70
	TArray<FName> ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98
};

struct UN_VehiclePerkSlot : UUserWidget {
	TSoftObjectPtr<UTexture2D> VehiclePerkQualityBrush[0x6]; // 0x260
	TSoftObjectPtr<UTexture2D> VehiclePerkSlotBrush[0x5]; // 0x350
	FLinearColor VehiclePerkQualityOutlineColor[0x6]; // 0x418
	FSlateColor ACModifyAddTextColor; // 0x478
	FSlateColor ACModifyReduceTextColor; // 0x4a0
	FSlateColor ACModifyNormalTextColor; // 0x4c8
	TSoftObjectPtr<UTexture2D> ACModifyAddTexture; // 0x4f0
	TSoftObjectPtr<UTexture2D> ACModifyReduceTexture; // 0x518
	UBorder* PerkBGBorder; // 0x540
	UImage* PerkImg; // 0x548
	UImage* PerkEquipImg; // 0x550
	UImage* PerkRecessiveImg; // 0x558
	UImage* PerkQualityImg; // 0x560
	UTextBlock* PerkNameText; // 0x568
	UTextBlock* TbPerkACModifyHP; // 0x570
	UImage* ImgPerkACModifyHP; // 0x578
	UTextBlock* TbPerkACModifySP; // 0x580
	UImage* ImgPerkACModifySP; // 0x588
	UTextBlock* TbPerkACModifyWeight; // 0x590
	UImage* ImgPerkACModifyWeight; // 0x598
	UTextBlock* TbPerkACModifySpeed; // 0x5a0
	UImage* ImgPerkACModifySpeed; // 0x5a8
	UTextBlock* TbPerkACModifyOperate; // 0x5b0
	UImage* ImgPerkACModifyOperate; // 0x5b8
	UTextBlock* TbPerkDescription; // 0x5c0
};

struct UUI_AnimalFarmRecord : USGUI {
	int32_t RecordCount; // 0x2d8
	UCanvasPanel* LoadingCanvas; // 0x2e0
	UScrollBox* RecordScrollBox; // 0x2e8
	URichTextBlock* RtbRecord; // 0x2f0
	UButton* CloseButton; // 0x2f8
	TArray<FAnimalFarmRecord> CurRecords; // 0x300
	int32_t CurRecordBeginIndex; // 0x310
	int32_t CurRecordEndIndex; // 0x314
};

struct UAchievementConditionWidget : UUserWidget {
	double LastUpdateProgressTime; // 0x270
	float UpdateProgressTimeInterval; // 0x278
	bool bAccomplished; // 0x27c
};

struct UWBP_N_GenericConfirmationDialog_C : UUI_GenericConfirmationDialog {
	UImage* Image_79; // 0x400
	UImage* Image_137; // 0x408
	UImage* Image_227; // 0x410
};

struct ABP_LightningEffect_C : ALightningEffect {
	FPointerToUberGraphFrame UberGraphFrame; // 0x698
	UNiagaraComponent* LightningNiagaraComponent; // 0x6a0
};

struct UAnimNotifyState_Ladder : UAnimNotifyState {
	ASGCharacter* CharacterOwner; // 0x360
	UAnimMontage* PlayMontage; // 0x368
};

struct UWaterMeshComponent : UMeshComponent {
	int32_t ForceCollapseDensityLevel; // 0x4b0
	float TileSize; // 0x4b4
	FIntPoint ExtentInTiles; // 0x4b8
	UMaterialInterface* FarDistanceMaterial; // 0x4c0
	float FarDistanceMeshExtent; // 0x4c8
	FVector RTWorldLocation; // 0x4cc
	FVector RTWorldSizeVector; // 0x4d8
	int32_t TessellationFactor; // 0x5c8
	float LODScale; // 0x5cc
};

struct UMaterialExpressionMaterialAttributeLayers : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
	FMaterialAttributesInput Input; // 0x58
	FMaterialLayersFunctions DefaultLayers; // 0x70
	TArray<UMaterialExpressionMaterialFunctionCall*> LayerCallers; // 0xb0
	int32_t NumActiveLayerCallers; // 0xc0
	TArray<UMaterialExpressionMaterialFunctionCall*> BlendCallers; // 0xc8
	int32_t NumActiveBlendCallers; // 0xd8
	bool bIsLayerGraphBuilt; // 0xdc
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x38
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xc0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xc8
};

struct ALevelSequenceMediaController : AActor {
	ALevelSequenceActor* Sequence; // 0x318
	UMediaComponent* MediaComponent; // 0x320
	float ServerStartTimeSeconds; // 0x328
};

struct UARMeshComponent : UARComponent {
	FARMeshUpdatePayload ReplicatedPayload; // 0x290
};

struct UStableFeedSlot : UUserWidget {
	TSoftObjectPtr<UTexture2D> BGBorder_NormalTexture; // 0x260
	TSoftObjectPtr<UTexture2D> BGBorder_HoverTexture; // 0x288
	TSoftObjectPtr<UTexture2D> BGBorder_SelectTexture; // 0x2b0
	TSoftObjectPtr<UTexture2D> CastratedTexture; // 0x2d8
	TSoftObjectPtr<UTexture2D> SexFemaleTexture; // 0x300
	TSoftObjectPtr<UTexture2D> SexMaleTexture; // 0x328
	TSoftObjectPtr<UTexture2D> SystemTrainerTexture; // 0x350
	TSoftObjectPtr<UTexture2D> DefaultVehicleTexture; // 0x378
	TMap<EGeneralsQualityType, float> QualityCorrectionToQualityType; // 0x3a0
	TSoftObjectPtr<UTexture2D> VehicleQualityTexture[0x6]; // 0x3f0
	TSoftObjectPtr<UTexture2D> SystemTrainerQualityTexture[0x3]; // 0x4e0
	TSoftObjectPtr<UTexture2D> SystemTrainerSpecialTypeTexture[0x3]; // 0x558
	TSoftObjectPtr<UTexture2D> TrainerQualityTexture[0x6]; // 0x5d0
	TSoftObjectPtr<UTexture2D> TrainerSpecialTypeTexture[0x4]; // 0x6c0
	FText DisableClickTexts[0x2b]; // 0x760
	FText PregnancyToolTipText; // 0xb68
	TSoftObjectPtr<UTexture2D> DBTypeStatusTexture; // 0xb80
	TSoftObjectPtr<UTexture2D> GrowingStatusTexture; // 0xba8
	TSoftObjectPtr<UTexture2D> MatingStatusTexture; // 0xbd0
	TSoftObjectPtr<UTexture2D> PregnancyStatusTexture; // 0xbf8
	TSoftObjectPtr<UTexture2D> TrainingStatusTexture; // 0xc20
	TSoftObjectPtr<UTexture2D> StarvingStatusTexture; // 0xc48
	TSoftObjectPtr<UTexture2D> RidingStatusTexture; // 0xc70
	TSoftObjectPtr<UTexture2D> RecoveryHPStatusTexture; // 0xc98
	TSoftObjectPtr<UTexture2D> DiffServerStatusTexture; // 0xcc0
	TSoftObjectPtr<UTexture2D> UnknownStatusTexture; // 0xce8
	TSoftObjectPtr<UTexture2D> WorkTypeStatusTexture; // 0xd10
	TSoftObjectPtr<UTexture2D> TamingStatusTexture; // 0xd38
	TSoftObjectPtr<UTexture2D> MateCDStatusTexture; // 0xd60
	TSoftObjectPtr<UTexture2D> ReborningStatusTexture; // 0xd88
	TSoftObjectPtr<UTexture2D> DeathTypeStatusTexture; // 0xdb0
	UBorder* BGBorder; // 0xdd8
	UBorder* FGBorder; // 0xde0
	UTextBlock* DisableClickTB; // 0xde8
	UImage* VehicleStatusIcon; // 0xdf0
	UImage* VehicleQualityBG; // 0xdf8
	UImage* VehicleIconImg; // 0xe00
	UButton* VehicleDetailBtn; // 0xe08
	UCanvasPanel* MiddlePanel; // 0xe10
	UTextBlock* NameText; // 0xe18
	UTextBlock* LevelText; // 0xe20
	UImage* SexImg; // 0xe28
	UProgressBar* SchedulePB; // 0xe30
	UTextBlock* ScheduleText; // 0xe38
	UCanvasPanel* TrainerPanel; // 0xe40
	UBorder* TrainerIconBG; // 0xe48
	UCanvasPanel* TrainerQualityPanel; // 0xe50
	UImage* TrainerQualityBG; // 0xe58
	UImage* TrainerSpecialTypeBG; // 0xe60
	UImage* TrainerIconImg; // 0xe68
	UImage* BindTrainerImg; // 0xe70
	UButton* StopTrainBtn; // 0xe78
	UButton* TakeTrainRewardBtn; // 0xe80
	UButton* AccRebornBtn; // 0xe88
	FBaseAnimalChunkData ChunkVehicleData; // 0xea0
	FStableLinkAnimalNetData LinkAnimalNetData; // 0xf50
	FText VehicleStatusTipText; // 0xf80
	TWeakObjectPtr<ASG_AnimalVehicleCharacter> BindVehicleChar; // 0xf98
	char bUseCloudData : 1; // 0xfa0
};

struct UAnimInstance : UObject {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct UBTTask_DoRoadPath : UBTTask_AnimalBase {
	float BrakingDistance; // 0xd0
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UParticleModuleMeshRotation_Seeded : UParticleModuleMeshRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UMaterialInstance : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x90
	UMaterialInterface* Parent; // 0xd0
	char bHasStaticPermutationResource : 1; // 0xd8
	char bOverrideSubsurfaceProfile : 1; // 0xd8
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xe0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xf0
	TArray<FTextureParameterValue> TextureParameterValues; // 0x100
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x110
	TArray<FFontParameterValue> FontParameterValues; // 0x120
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x130
	FStaticParameterSet StaticParameters; // 0x148
	FMaterialCachedParameters CachedLayerParameters; // 0x188
	TArray<UObject*> CachedReferencedTextures; // 0x328
};

struct UWaterSplineComponent : USplineComponent {
	FWaterSplineCurveDefaults WaterSplineDefaults; // 0x580
	FWaterSplineCurveDefaults PreviousWaterSplineDefaults; // 0x590
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x4b0
	UMaterialInterface* MaterialOverride; // 0x4b8
	FLinearColor SpriteColor; // 0x4c0
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct USGGameDataAllNpc : UObject {
	TArray<ABaseCharacter*> CheatNPC; // 0x28
};

struct USGLocalPlayer : ULocalPlayer {
	FMulticastInlineDelegate OnGetServersFinish; // 0x268
	FMulticastInlineDelegate OnServerPingFinish; // 0x278
	FMulticastInlineDelegate OnGetOfficialSealInfosFinish; // 0x288
	FMulticastInlineDelegate OnGetOccupyDetailInfoFinish; // 0x298
	FMulticastInlineDelegate OnGetSteamTicket; // 0x2a8
	TArray<FGameServerInfo> LogicGameServerInfo; // 0x2b8
	TArray<FGameServerInfo> LobbyServerInfoTotal; // 0x2c8
	TArray<FGameServerInfo> LobbyServerInfo; // 0x2d8
	TArray<FOfficalSealInfo> OfficalSealInfos; // 0x2e8
};

struct UMagicLeapPlanesComponent : USceneComponent {
	TArray<EMagicLeapPlaneQueryFlags> QueryFlags; // 0x208
	UBoxComponent* SearchVolume; // 0x218
	int32_t MaxResults; // 0x220
	float MinHolePerimeter; // 0x224
	float MinPlaneArea; // 0x228
	EMagicLeapPlaneQueryType QueryType; // 0x22c
	float SimilarityThreshold; // 0x230
	FMulticastInlineDelegate OnPlanesQueryResult; // 0x238
	FMulticastInlineDelegate OnPersistentPlanesQueryResult; // 0x248
};

struct UEditUVIslandsTool : UMeshSurfacePointTool {
	UExistingMeshMaterialProperties* MaterialSettings; // 0xc8
	UMaterialInstanceDynamic* CheckerMaterial; // 0xd0
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0xd8
	UPolygonSelectionMechanic* SelectionMechanic; // 0xe0
	UMultiTransformer* MultiTransformer; // 0xf0
};

struct AMeleeWeapon : ASGWeapon {
	USceneComponent* SceneRootComponent; // 0x7888
	UStaticMeshComponent* WeaponStaticMesh; // 0x7890
	UBoxComponent* BlockCollision; // 0x7898
	UBoxComponent* ShieldBlockArrowCollision; // 0x78a0
	UParticleSystemComponent* TrailParticleComponent; // 0x78a8
	UStaticMeshComponent* WeaponOreStaticMesh; // 0x78b0
	UParticleSystemComponent* WeaponOreParticleComponent; // 0x78b8
	char bUseCustomFlag : 1; // 0x78c0
	TArray<FName> CustomFlagMaterialNames; // 0x78c8
	float FlagImageModifies[0x5]; // 0x78d8
	UMaterialInstanceDynamic* DMI_FlagImage; // 0x78f0
	UTextureRenderTarget2D* RT_FlagImage; // 0x78f8
	FString FlagImageString; // 0x7900
	float NearlyHitDistanceTolerance; // 0x7918
	int32_t AttackHitsMaxNumber; // 0x791c
	int32_t AttackFoliageHitsMaxNumber; // 0x7920
	char bClientUseNewTrace : 1; // 0x7924
	char bCanAttackRebound : 1; // 0x7924
	UCurveFloat* AttackReboundCurve; // 0x7928
	int32_t DeltaTraceNumber; // 0x7930
	float BodyTraceSphereRadius; // 0x7934
	ETrailState Enum_TrailState; // 0x7938
	TArray<ECollisionChannel> AttackReboundIgnoreQuerys; // 0x7940
	FRuntimeFloatCurve AttackReboundRateCurve; // 0x7950
	FRuntimeFloatCurve RiderAttackReboundRateCurve; // 0x79d8
	TMap<EAimDirection, FWeaponBlockCollisionInfo> TMap_BlockCollisionOffset; // 0x7a60
	TMap<EAimDirection, FWeaponBlockCollisionInfo> TMap_OffBlockCollisionOffset; // 0x7ab0
	TMap<EAimDirection, FWeaponBlockCollisionInfo> TMap_RiderBlockCollisionOffset; // 0x7b00
	TMap<EAimDirection, FWeaponBlockCollisionInfo> TMap_RiderOffBlockCollisionOffset; // 0x7b50
	TArray<FWeaponWorldTraceInfo> Server_LastMeleeWeaponTraces; // 0x7ba0
	TArray<FWeaponWorldTraceInfo> Server_CurrentMeleeWeaponTraces; // 0x7bb0
	TArray<FWeaponWorldTraceInfo> Server_LastBodyTraces; // 0x7bc0
	TArray<FWeaponWorldTraceInfo> Server_CurrentBodyTraces; // 0x7bd0
	FTimerHandle UpdateWeaponTraceTimer; // 0x7be0
	FTimerHandle UpdateWeaponReboundTraceTimer; // 0x7be8
	FAttackInfo Struct_CurrentAttackInfo; // 0x7bf0
	char bIsAttackRebounding : 1; // 0x7c50
	char bCauserDamage : 1; // 0x7c50
	char bSuccessCauserDamage : 1; // 0x7c50
	EAttackSocketType Enum_AttackSocketType; // 0x7c51
	float WeaponBlood; // 0x7c74
	TArray<UMaterialInstanceDynamic*> Mat_Weapon; // 0x7c78
	TMap<float, float> ShieldBlockedArrowMultiAdd; // 0x7c98
	float ShowDeltaTime; // 0x7cf8
	ENiagaraWeaponType NiagaraWeaponType; // 0x7d14
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct USGBuffComponent : UActorComponent {
	TArray<USGBuff*> BuffArray; // 0xc0
	TArray<FStructureBuffEntry> AllowedBuff; // 0xd0
	int32_t ReplicatedBuffMaxAmount; // 0xe0
	FMulticastInlineDelegate OnAddBuffEvent; // 0xe8
	FMulticastInlineDelegate OnUpdateBuffEvent; // 0xf8
	FMulticastInlineDelegate OnRemoveBuffEvent; // 0x108
	FMulticastInlineDelegate OnUpdateReplicatedEvent; // 0x118
	TMap<UObject*, UParticleSystemComponent*> BuffParticleMap; // 0x128
	ABaseCharacter* CacheBaseCharacter; // 0x198
};

struct USequenceCameraShakeSequencePlayer : UObject {
	UObject* BoundObjectOverride; // 0x480
	UMovieSceneSequence* Sequence; // 0x488
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x490
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x38
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct UConditionSlot : UUserWidget {
	TWeakObjectPtr<ASGCharacter> BindCharacter; // 0x260
	UImage* ConditionImage; // 0x268
	UProgressBar* LevelProgress; // 0x270
	UTextBlock* ConditionName; // 0x278
	UTextBlock* LevelText; // 0x280
	float MaxAmount; // 0x288
	ESPType SlotType; // 0x28c
	int32_t Index; // 0x290
	TArray<TSoftObjectPtr<UTexture2D>> STRImageTexture2D; // 0x298
	TArray<TSoftObjectPtr<UTexture2D>> DEXImageTexture2D; // 0x2a8
	TArray<TSoftObjectPtr<UTexture2D>> STAImageTexture2D; // 0x2b8
	TArray<TSoftObjectPtr<UTexture2D>> INTImageTexture2D; // 0x2c8
	TArray<TSoftObjectPtr<UTexture2D>> CHAImageTexture2D; // 0x2d8
	FText OneHandedWeaponsText; // 0x2e8
	FText ShieldsText; // 0x300
	FText TowHandedWeaponsText; // 0x318
	FText PolearmsText; // 0x330
	FText HeavyArmorsText; // 0x348
	FText ThrowingText; // 0x360
	FText ArcheryText; // 0x378
	FText CrossbowsText; // 0x390
	FText RidingText; // 0x3a8
	FText LightArmorsText; // 0x3c0
	FText PhysiqueText; // 0x3d8
	FText MiningText; // 0x3f0
	FText LumberingText; // 0x408
	FText HuntingText; // 0x420
	FText PlantingText; // 0x438
	FText HandMakingText; // 0x450
	FText SiegeWorkingText; // 0x468
	FText BuildingText; // 0x480
	FText ArmorerText; // 0x498
	FText HerbText; // 0x4b0
	FText TamingText; // 0x4c8
	FText LeaderShipText; // 0x4e0
	FText RecruitText; // 0x4f8
	FText TrainingText; // 0x510
	FText RenownText; // 0x528
};

struct UPaletteWidget : UUserWidget {
	UColorTemplate* ColorTemplateClass; // 0x260
	TArray<FVector2D> ColorTemplates; // 0x268
	UUniformGridPanel* UGPColorTemplate; // 0x288
	UColorSelector* ColorSelector; // 0x290
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UPlayerSoundData : USGSoundDatabase {
	FName BrakingOnHorseSound; // 0x88
	FName StartingOnHorseSound; // 0x90
	TMap<EGeneralShortCutSlotType, FName> IssueOrderSound; // 0x98
};

struct UUI_Perk : USGUI {
	UCurveTable* SKillPointsConsumeTable; // 0x2d8
	UCurveTable* SKillMasteryMultipleTable; // 0x2e0
	UCurveTable* SKillTable; // 0x2e8
	UCurveTable* AddSKillTable; // 0x2f0
	UPerkLevelDivisionLine* PerkLevelDivisionLineClass; // 0x2f8
	UAddSkillExpPanel* AddSkillExpPanelClass; // 0x300
	UPerkPanel* RpbSTPanel; // 0x308
	UPerkPanel* RpbAGPanel; // 0x310
	UPerkPanel* RpbWIPanel; // 0x318
	UPerkPanel* RpbENPanel; // 0x320
	UPerkPanel* RpbCHPanel; // 0x328
	UTextBlock* TbPublicSkillExp; // 0x330
	UTextBlock* TbPerkPoint; // 0x338
	UTextBlock* TbMasteryPoint; // 0x340
	TMap<ESkillType, FSkillLocalData> LocalSkillValueMap; // 0x388
	UCanvasPanel* SkillLevelLineCanvas; // 0x3e0
	UCanvasPanel* MainCanvas; // 0x3e8
	UCanvasPanel* SkillTipsCanvas; // 0x3f0
	UTextBlock* TbDescription; // 0x3f8
	UTextBlock* TbSkillExp; // 0x400
	UTextBlock* TbSkillMultiple; // 0x408
	UScrollBox* SkillTipsScrollBox; // 0x410
	UImage* ImgSkillIcon; // 0x418
	UTextBlock* TbGetSkillExpType; // 0x420
	UTextBlock* CapitalText; // 0x428
	UTextBlock* TbWeekFree; // 0x430
	UTextBlock* TbItemFree; // 0x438
	int32_t CurPerkPoint; // 0x440
	UCanvasPanelSlot* SkillLevelLineCanvasSlot; // 0x448
	UAddSkillExpPanel* AddSkillExpPanel; // 0x450
	ESkillType CurShowTipsSkillType; // 0x458
};

struct UUserDefinedStruct : UScriptStruct {
	EUserDefinedStructureStatus Status; // 0xc0
	FGuid Guid; // 0xc4
};

struct UUI_Season : USGUI {
	UUI_SeasonPassport* SeasonPassportPage; // 0x2d8
	UTextBlock* SeasonInfoText; // 0x2e0
	UUI_SeasonQuest* WBP_SeasonQuest; // 0x2e8
	UUI_SeasonQuest* WBP_SeasonWeekQuest; // 0x2f0
	UUI_SeasonShop* WBP_SeasonShop; // 0x2f8
	UButton* BtnSeason; // 0x300
	UButton* BtnSeasonQuest; // 0x308
	UButton* BtnSeasonWeekQuest; // 0x310
	UButton* BtnSeasonReward; // 0x318
};

struct UGameMapsSettings : UObject {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UGameSessionSettings : UObject {
	int32_t MaxSpectators; // 0x28
	int32_t MaxPlayers; // 0x2c
	char bRequiresPushToTalk : 1; // 0x30
};

struct UNiagaraEmitter : UObject {
	bool bLocalSpace; // 0x28
	bool bDeterminism; // 0x29
	int32_t RandomSeed; // 0x2c
	EParticleAllocationMode AllocationMode; // 0x30
	int32_t PreAllocationCount; // 0x34
	FNiagaraEmitterScriptProperties UpdateScriptProps; // 0x38
	FNiagaraEmitterScriptProperties SpawnScriptProps; // 0x60
	ENiagaraSimTarget SimTarget; // 0x88
	FBox FixedBounds; // 0x8c
	int32_t MinDetailLevel; // 0xa8
	int32_t MaxDetailLevel; // 0xac
	FNiagaraDetailsLevelScaleOverrides GlobalSpawnCountScaleOverrides; // 0xb0
	FNiagaraPlatformSet Platforms; // 0xc8
	FNiagaraEmitterScalabilityOverrides ScalabilityOverrides; // 0xf8
	char bInterpolatedSpawning : 1; // 0x108
	char bFixedBounds : 1; // 0x108
	char bUseMinDetailLevel : 1; // 0x108
	char bUseMaxDetailLevel : 1; // 0x108
	char bOverrideGlobalSpawnCountScale : 1; // 0x108
	char bRequiresPersistentIDs : 1; // 0x108
	char bCombineEventSpawn : 1; // 0x108
	float MaxDeltaTimePerTick; // 0x10c
	uint32_t DefaultShaderStageIndex; // 0x110
	uint32_t MaxUpdateIterations; // 0x114
	TSet<uint32_t> SpawnStages; // 0x118
	char bSimulationStagesEnabled : 1; // 0x168
	char bDeprecatedShaderStagesEnabled : 1; // 0x168
	char bLimitDeltaTime : 1; // 0x168
	FString UniqueEmitterName; // 0x170
	TArray<UNiagaraRendererProperties*> RendererProperties; // 0x180
	TArray<FNiagaraEventScriptProperties> EventHandlerScriptProps; // 0x190
	TArray<UNiagaraSimulationStageBase*> SimulationStages; // 0x1a0
	UNiagaraScript* GPUComputeScript; // 0x1b0
	TArray<FName> SharedEventGeneratorIds; // 0x1b8
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UDatasmithLightComponentTemplate : UDatasmithObjectTemplate {
	char bVisible : 1; // 0x30
	char CastShadows : 1; // 0x34
	char bUseTemperature : 1; // 0x34
	char bUseIESBrightness : 1; // 0x34
	float Intensity; // 0x38
	float Temperature; // 0x3c
	float IESBrightnessScale; // 0x40
	FLinearColor LightColor; // 0x44
	UMaterialInterface* LightFunctionMaterial; // 0x58
	UTextureLightProfile* IESTexture; // 0x60
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UWBP_KeySettingRadioButton_C : UUI_RadioButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x540
	UButton* BtnBg; // 0x548
	UTextBlock* TbTitle; // 0x550
	FText Title; // 0x558
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x310
};

struct UWBP_SettingComboBoxItem_C : USystemSettingItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368
	UCanvasPanel* CanvasPanel_53; // 0x370
	UComboBoxString* SettingComboBox; // 0x378
	UTextBlock* TbTitle; // 0x380
	FText Title; // 0x388
};

struct UMovieSceneColorSection : UMovieSceneSection {
	FMovieSceneFloatChannel RedCurve; // 0xe8
	FMovieSceneFloatChannel GreenCurve; // 0x188
	FMovieSceneFloatChannel BlueCurve; // 0x228
	FMovieSceneFloatChannel AlphaCurve; // 0x2c8
};

struct UMotoSynthSource : UObject {
	bool bConvertTo8Bit; // 0x28
	float DownSampleFactor; // 0x2c
	FRuntimeFloatCurve RPMCurve; // 0x30
	TArray<float> SourceData; // 0xb8
	TArray<int16_t> SourceDataPCM; // 0xc8
	int32_t SourceSampleRate; // 0xd8
	TArray<FGrainTableEntry> GrainTable; // 0xe0
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct ULevelUpAnimationNotifyWidget : UAnimationNotifyWidget {
	UImage* BackImg; // 0x278
	UTextBlock* LevelNum; // 0x280
	UWidgetAnimation* LevelUpAnim; // 0x288
	ULevelUpColWidget* LevelUpInfoCol; // 0x290
	ULevelUpColWidget* PerkPointCol; // 0x298
	ULevelUpColWidget* MasteryPointCol; // 0x2a0
	ULevelUpColWidget* CraftPointCol; // 0x2a8
	float AnimPlaySpeed; // 0x2b0
};

struct ULevelSequenceDirector : UObject {
	ULevelSequencePlayer* Player; // 0x28
};

struct UIntSerialization : UObject {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	int8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct UMaterialExpressionMax : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t Row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t Column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct ANiagaraPreviewGrid : AActor {
	UNiagaraSystem* System; // 0x310
	ENiagaraPreviewGridResetMode ResetMode; // 0x318
	UNiagaraPreviewAxis* PreviewAxisX; // 0x320
	UNiagaraPreviewAxis* PreviewAxisY; // 0x328
	ANiagaraPreviewBase* PreviewClass; // 0x330
	float SpacingX; // 0x338
	float SpacingY; // 0x33c
	int32_t NumX; // 0x340
	int32_t NumY; // 0x344
	TArray<UChildActorComponent*> PreviewComponents; // 0x348
};

struct UParticleModuleBeamSource : UParticleModuleBeamBase {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct UBTTask_MoveAroundBlockade : UBTTask_AnimalBase {
	FBlackboardKeySelector BBKey_IsMoveAroundBlockade; // 0xd0
	char bUseNavPathForAttack : 1; // 0xf8
};

struct UNotificationSlot : USGUI {
	EMsgType MessageType; // 0x2f8
	ENotifyMessageType NotifyMessageType; // 0x2f9
	UObject* SGObject; // 0x3a8
	FVector2D ImageSize; // 0x3b0
	UImage* bg; // 0x3b8
	UImage* TextureImage; // 0x3c0
	UTextBlock* LeftNotifyText; // 0x3c8
	UTextBlock* NotifyText; // 0x3d0
	FLinearColor BattleUpTextColor; // 0x3d8
	bool IsBattleWorld; // 0x3e8
};

struct UUMGSequencePlayer : UObject {
	UWidgetAnimation* Animation; // 0x410
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x420
};

struct UBTDecorator_TagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct UUI_Gate : UUserWidget {
	FString GateName; // 0x260
	TArray<FName> RegionIDList; // 0x270
	FName OccupiedGuildID; // 0x280
};

struct UABP_MenuCharacter_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2f8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x378
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3a8
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x460
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x640
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x820
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x928
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xa30
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xb38
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xc40
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xd48
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xd68
	UAnimSequence* PlayingAnimSequence; // 0xd88
};

struct UUserWidget : UWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMulticastInlineDelegate OnVisibilityChanged; // 0x168
	FMargin Padding; // 0x190
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a0
	UUMGSequenceTickManager* AnimationTickManager; // 0x1b0
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct UGuildGroupSlot : UUserWidget {
	UButton* AddGroupButton; // 0x260
	UTextBlock* GroupIndexText; // 0x268
	UTextBlock* GroupNameText; // 0x270
	UTextBlock* GroupMemberText; // 0x278
	UButton* ChangeNameButton; // 0x280
	UButton* DeleteGroupButton; // 0x288
	UUI_ModifyText* AddGuildGroupUIOverride; // 0x290
	UUI_ModifyText* ModifyGuildGroupUIOverride; // 0x298
	UUI_GenericConfirmationDialog* ConfirmDeleteGroupUIOverride; // 0x2a0
};

struct USphereReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadius; // 0x280
	float CaptureDistanceScale; // 0x284
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x288
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	int32_t ActiveTilesUpdateBucketNum; // 0x70
	ENavDataGatheringModeConfig DataGatheringMode; // 0x74
	float DirtyAreaWarningSizeThreshold; // 0x78
	TArray<FNavDataConfig> SupportedAgents; // 0x80
	FNavAgentSelector SupportedAgentsMask; // 0x90
	TArray<ANavigationData*> NavDataSet; // 0x98
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa8
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc8
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd8
	FNavigationSystemRunMode OperationMode; // 0x220
	float DirtyAreasUpdateFreq; // 0x1624
};

struct UParticleModule : UObject {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct APrefabActor : AActor {
	UPrefabComponent* PrefabComponent; // 0x310
};

struct ALightningEmitter : AActor {
	UBillboardComponent* MainBillboard; // 0x310
	UBillboardComponent* SourcePoint; // 0x318
	UBillboardComponent* TargetPoint; // 0x320
	bool bAutoActivate; // 0x328
	bool bLoop; // 0x329
	float LoopDuration; // 0x32c
	FLightningAttachment SourceAttachment; // 0x330
	FLightningAttachment TargetAttachment; // 0x390
	FLightningParams LightningParams; // 0x3f0
	FBranchingParams BranchingParams; // 0x4a8
	FEmissionParams RootEmissionParams; // 0x4d8
	FEmissionParams BranchEmissionParams; // 0x4ec
	float DisplacementMult; // 0x500
	float TimeMultiplier; // 0x504
	bool bUseSeparateThread; // 0x508
	bool bGenerateHitEvents; // 0x509
	EHitReaction HitReaction; // 0x50a
	bool bGenerateOverlapEvents; // 0x50b
	TMap<ECollisionChannel, ECollisionResponse> CollisionResponses; // 0x510
	TArray<AActor*> IgnoredActors; // 0x560
	bool bDrawBranches; // 0x570
	bool bDrawCurveWidth; // 0x571
	bool bCurveCustomColor; // 0x572
	FColor CurveColor; // 0x574
	FColor AttachmentVolumesColor; // 0x578
	FMulticastSparseDelegate EventOnRootSpawned; // 0x57c
	TArray<ALightningEffect*> LightningsArray; // 0x580
	ALightningEffect* LightningEffectClass; // 0x590
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct UAISense_Blueprint : UAISense {
	UUserDefinedStruct* ListenerDataType; // 0x80
	TArray<UAIPerceptionComponent*> ListenerContainer; // 0x88
	TArray<UAISenseEvent*> UnprocessedEvents; // 0x98
};

struct AGlobalMapManager : AActor {
	float GetServerListInfoInvertal; // 0x310
	TArray<int32_t> OfficalLogicGameServers; // 0x338
	TArray<FRequestOccupyDetailInfo> OccupyDetailInfoRequestList; // 0x348
	int32_t MaxCityGroupId; // 0x358
	FGameServerInfo SiteServerInfo; // 0x360
};

struct UUI_StructureOccupyShelterSlot : UUserWidget {
	TWeakObjectPtr<ASGStructureOccupy> RemoteActor; // 0x260
	USGUI* RootSGUI; // 0x268
	FProtectionRequirement ProtectionReq; // 0x270
	int32_t ProtectionGuildActivityPoint; // 0x2c0
	int32_t ProtectionGAPImageIndex; // 0x2c4
	UTextBlock* ProtectTitleText; // 0x2c8
	URichTextBlock* ProtectTimeRichText; // 0x2d0
	UHorizontalBox* ResourceHorizontalBox; // 0x2d8
	UUI_StructureOccupyItemSlot* StructureOccupyItemSlotClass; // 0x2e0
	UButton* ProtectButton; // 0x2e8
	UTextBlock* ProtectButtonText; // 0x2f0
	UBorder* ProtectBorder; // 0x2f8
	FSlateBrush ProtectBrush; // 0x300
	FSlateBrush UnProtectBrush; // 0x388
	UButton* BuyProtectButton; // 0x410
};

struct UAbilityTask_WaitGameplayTagAdded : UAbilityTask_WaitGameplayTag {
	FMulticastInlineDelegate Added; // 0xa8
};

struct UBTTask_GameplayTaskBase : UBTTaskNode {
	char bWaitForGameplayTask : 1; // 0x70
};

struct UBlackboardComponent : UActorComponent {
	UBrainComponent* BrainComp; // 0xc0
	UBlackboardData* DefaultBlackboardAsset; // 0xc8
	UBlackboardData* BlackboardAsset; // 0xd0
	TArray<UBlackboardKeyType*> KeyInstances; // 0xf8
};

struct ABP_RT_Quality_Parameters_C : ASGRTXQuality {
	FPointerToUberGraphFrame UberGraphFrame; // 0x320
	UPostProcessComponent* RTX_PostProcess; // 0x328
	USceneComponent* DefaultSceneRoot; // 0x330
	FString Enable Reflection; // 0x338
	FString Enable AO; // 0x348
	FString Enable Shadow; // 0x358
	FString Enable Translucensy; // 0x368
	FString Enable Translucency Height Fog; // 0x378
	FString Enable Translucency Shadows; // 0x388
	FString Enable Refraction; // 0x398
	FString Translucency Max Roughness; // 0x3a8
	FString Max Refraction Rays; // 0x3b8
	FString Evaluate Materials in Shadow; // 0x3c8
	FString Shadow Enable Two Sided Geometry; // 0x3d8
	FString Enable Height Fog in Reflection; // 0x3e8
	FString Reflection Sort Materials; // 0x3f8
	FString Enable Reflection Shadow; // 0x408
	FString Reflection Max Roughness; // 0x418
	bool DebugPreview; // 0x428
	FString Use Texture LOD; // 0x430
	FString Reflection Screen Percentage; // 0x440
	FVector Box Reletive Scale; // 0x450
	bool Hidden in Game; // 0x45c
	FString Normal Bias; // 0x460
	FString Debug Force Opaque; // 0x470
	FString Debug Force Full Build; // 0x480
	FString Debug Disable Triangle Cull; // 0x490
	FString Debug Force Build Mode; // 0x4a0
	FString Reflection Max Ray Distance; // 0x4b0
	FString Reflection Min Ray Distance; // 0x4c0
	FString Reflection Max Bounces; // 0x4d0
	FString Reflection SPP; // 0x4e0
	FString Shadow SPP; // 0x4f0
	FString Enable Reflection Denoiser; // 0x500
	FString Enable Shadow Denoiser; // 0x510
	Enum_RT_Quality_Preset Enum_RT_QualitySwitch; // 0x520
	FString GI type; // 0x528
	FString Enable GI Denoiser; // 0x538
	FString GI EvalSkyLight; // 0x548
	FString GI MaxBounce; // 0x558
	FString GI MaxRayDistance; // 0x568
	FString GI SPP; // 0x578
	FString GI Screen Percentage; // 0x588
	FString GI UseRussianRoulette ; // 0x598
	FString Enable RT SkyLight; // 0x5a8
	FString Enable SkyLight Denoiser; // 0x5b8
	FString SkyLight Enable Two Sided Geomtry; // 0x5c8
	FString SkyLight MaxRay Distance; // 0x5d8
	FString SkyLight SPP; // 0x5e8
	FString Reflection Enable Materials; // 0x5f8
	FVeryHigh Custom_Preset; // 0x610
	FHigh Reflection+Shadow+AO+Translucency+Caustics; // 0x19a0
	FMedium Reflection+Shadow+AO+Translucency+GI; // 0x2d30
	FFilm Reflection+Shadow+AO+Translucency; // 0x40c0
	FLow Reflection+Shadow+AO; // 0x5450
	FXbox Reflection Only; // 0x67e0
	FPS5 Shadow+AO; // 0x7b70
	FDisable Disable; // 0x8f00
	FString RT Enable Reflection Capture ; // 0xa290
	FString Enable Shader Cache; // 0xa2a0
	FString AO Enable Material; // 0xa2b0
	FString AO Enable Two Sided Geometry; // 0xa2c0
	FString PSO Cache Size; // 0xa2d0
	FString Enable Landscape Detect Texture Streaming; // 0xa2e0
	FString Enable Landscape LOD UpdateEveryFrame; // 0xa2f0
	FString Enable Instanced Static Mesh; // 0xa300
	FString Enable Instanced Static Meshes Culling; // 0xa310
	FString Instanced Static Meshes Culling Radius; // 0xa320
	FString Shadow Max Batch Size; // 0xa330
	FString GI Diffuse Threshold; // 0xa340
	FString Shadow Denoiser Max Batch Size; // 0xa350
	FString Enable Landscape In RT; // 0xa360
	FString RTX Switch; // 0xa370
	FString Enable Reflection Test Roughness; // 0xa380
	float UseShaderWPO; // 0xa390
	FString Reflection Sky Light Contribution; // 0xa398
	FString GI Sort Materials; // 0xa3a8
	FString GI Enable Two Sided Geometry; // 0xa3b8
	FString Final Gather Distance; // 0xa3c8
	FString Enable Hybrid Translucency; // 0xa3d8
	FString Hybrid Translucency DepthThreshold ; // 0xa3e8
	FString Hybrid Translucency Layers; // 0xa3f8
	FString Hybrid Translucency Support; // 0xa408
	FString Lighting Max Lights; // 0xa418
	FString Lighting Max Shadow Lights; // 0xa428
	FString Lighting Miss Shader; // 0xa438
	FString Shadow Max Lights; // 0xa448
	FString Shadow Max Denoised Lights ; // 0xa458
	FString Translucency Mask ; // 0xa468
	FString SkyLight Enable Materials; // 0xa478
	FString  Half Res Hybrid Translucency; // 0xa488
	FString Shadows Support Translucency; // 0xa498
	FString Support Light Function; // 0xa4a8
	FString Sharp Shadow Fall Back; // 0xa4b8
	FString Light Channel Support; // 0xa4c8
	FString Translucency Roughness Multiplier ; // 0xa4d8
	FString Reflections Roughness Multiplier ; // 0xa4e8
	FString Hybrid Reflection; // 0xa4f8
	FString Per-Light Shadow Casting; // 0xa508
	FString ParallelMeshBatchSize; // 0xa518
	FString BuildRayTracingMeshForCaustics; // 0xa528
	FString Exclude Translucents From Shadows ; // 0xa538
	FString Auto Instance ; // 0xa548
	FString Enable SSGI; // 0xa558
	FString Half Res SSGI; // 0xa568
	FString SSGI Quality; // 0xa578
	FString Parallel Mesh Batch Setup ; // 0xa588
	FString Batch Materials ; // 0xa598
	FString Enable Mesh Caustics; // 0xa5a8
	FString Water Caustics Type; // 0xa5b8
	FString Water Caustics Refractive Intensity ; // 0xa5c8
	FString Water Caustics Reflective Intensity ; // 0xa5d8
	FString Water Caustics Fresnel Base Reflect Fraction ; // 0xa5e8
	FString Water Caustics Map Size X  ; // 0xa5f8
	FString Water Caustics Map Size Y; // 0xa608
	FString Water Caustics Num Denoise Passes ; // 0xa618
	FString Water Caustics Min Reflection Ray Distance ; // 0xa628
	FString Water Caustics Max Reflection Ray Distance ; // 0xa638
	FString Water Caustics Min Refraction Ray Distance ; // 0xa648
	FString Water Caustics Max Refraction Ray Distance ; // 0xa658
	FString Water Caustics Rect Light Temporal Weight ; // 0xa668
	FString Mesh Caustics Resolution ; // 0xa678
	FString Mesh Caustics Intensity ; // 0xa688
	FString Water Caustics Buffer Scale ; // 0xa698
	FString Mesh Caustics Buffer Scale ; // 0xa6a8
	FString Mesh Caustics Temporal Strength ; // 0xa6b8
	FString Mesh Caustics Jitter ; // 0xa6c8
	FString Mesh Caustics Enable Dispersion ; // 0xa6d8
	FString Mesh Caustics Translucent Reflection Mode; // 0xa6e8
	FString Mesh Caustics Max Trace Depth ; // 0xa6f8
	FString Mesh Caustics Adaptive Photon Size ; // 0xa708
	FString Mesh Caustics Enable Temporal Filter ; // 0xa718
	FString Mesh Caustics Adaptive Smooth ; // 0xa728
	FString Mesh Caustics Adaptive Update Speed ; // 0xa738
	FString Mesh Caustics Adaptive Variance Gain ; // 0xa748
	FString Mesh Caustics Fixed Light ; // 0xa758
	FString Mesh Caustics Max Intensity ; // 0xa768
	FString Translucency Enable Absorption ; // 0xa778
	FString Mesh Caustics Soft Caustics Sample ; // 0xa788
	FString Water Caustics Refract Back Face Culling Threshold ; // 0xa798
	FString Water Caustics Reflect Back Face Culling Threshold ; // 0xa7a8
	FString Water Caustics Map Cascades ; // 0xa7b8
	FString Water Caustics Map Force Level ; // 0xa7c8
	FString Water Caustics Map Cascade Scale ; // 0xa7d8
	FString Water Caustics Show Photon ; // 0xa7e8
	FString Water Caustics Photon Scale; // 0xa7f8
	FString Mesh Caustics Enable Advanced Soft Caustics ; // 0xa808
	FString Mesh Caustics Mid Cull Color Threshold ; // 0xa818
	FString Mesh Caustics Final Cull Color Threshold ; // 0xa828
	FString Water Caustics Cascade Sampling Offset X ; // 0xa838
	FString Water Caustics Cascade Sampling Offset Y; // 0xa848
	FString Water Caustics Cascade Sampling UVScale X ; // 0xa858
	FString Water Caustics Cascade Sampling UVScale Y ; // 0xa868
	FString Sharpness; // 0xa878
	FString Binary Search Order; // 0xa888
	FString Quality; // 0xa898
	FString DLSS Enable; // 0xa8a8
	FString Reflections Enable TAA Before DLSS ; // 0xa8b8
	FString Translucency Enable TAA Before DLSS ; // 0xa8c8
	FString GI Max Light Count ; // 0xa8d8
	FString AO SPP; // 0xa8e8
	FString GI Denoiser Type; // 0xa8f8
	FString GI Apply AO; // 0xa908
	FString GI Denoiser Color Clamp; // 0xa918
	FString GI Denoiser Normal Tolerance; // 0xa928
	FString Spatial Normal Tolerance; // 0xa938
	bool Enable RTX Parameter Override based on DLSS status; // 0xa948
	bool Enable Override From UI; // 0xa949
	FString Particle Reapply TAA after DLSS; // 0xa950
	FString Refraction Background Sample Fallback ; // 0xa960
	FString GI Denoise History Length; // 0xa970
	FString Spatial Filter Iteration; // 0xa980
	FString DIstance Field AO; // 0xa990
	FString DIstance Field GI; // 0xa9a0
	FString Distance Field Shadow; // 0xa9b0
	FString Distance Fields; // 0xa9c0
	FString Translucency Ignore Backface Opacity; // 0xa9d0
	FString Use Scene Light Dir; // 0xa9e0
	FString Enable Volumetric Shadow; // 0xa9f0
	FString Absorption Force Shading On Opaque Objects; // 0xaa00
	FString Mesh Caustics Max Ray Distance; // 0xaa10
	FString Mesh Caustics Temporal Color Tolerance; // 0xaa20
	FString GI Diffuse Boost; // 0xaa30
	FString Reflected Translucency Mode; // 0xaa40
	FString Reflected Translucency Max Bounces; // 0xaa50
	FString Reflected Translucency Transmission Threshold; // 0xaa60
	FString Half Res Refraction; // 0xaa70
	FString AO Denoiser History Convolution Sample Count ; // 0xaa80
	FString Shadow PrioritizeDirectional; // 0xaa90
	FString Frames Until Feature Desturction; // 0xaaa0
	FString Dilate Motion Vectors; // 0xaab0
	FString Reflections TAA; // 0xaac0
	FString Water Reflections TAA; // 0xaad0
	FString Instanced Static Meshes Culling Angle; // 0xaae0
	FPostProcessSettings RTX Post Process Settings; // 0xaaf0
	float RTX Post Process Weight; // 0xb050
	FString Enable Translucency in Reflection; // 0xb058
	bool Unbound; // 0xb068
	float RTX Post Process Priority; // 0xb06c
	FString FinalGather UseReservoirResampling; // 0xb070
	FString GI Metalic Support; // 0xb080
	FString GI Denoiser Spatial Filter Type; // 0xb090
	FString GI Denoiser Use SH; // 0xb0a0
	FString GI Denoiser SH Sharpness; // 0xb0b0
	FString ATrous Depth Tolerance ; // 0xb0c0
	FString Final Gather SkyLight Intensity ; // 0xb0d0
	FString Final Gather SkyLight IndirectMultiplier ; // 0xb0e0
	FString Instanced Static Meshes Evaluate WPO; // 0xb0f0
	FString Instanced Static Meshes Simulation Count; // 0xb100
	FString Shadow UseBiasForSkipWPOEval; // 0xb110
	FString Shadow MaxBiasForInexactGeometry; // 0xb120
	FString Enable Ray Tracing Culling; // 0xb130
	FString Ray Tracing Culling Angle; // 0xb140
	FString Ray Tracing Culling Radius; // 0xb150
	FString Sky Light Screen Percentage; // 0xb160
	FString FinalGather Iterations ; // 0xb170
	FString FinalGather Filter Width; // 0xb180
	FString GI Firefly Suppression; // 0xb190
	FString Reflections EnableTwoSidedGeometry ; // 0xb1a0
	FString GeometryCache; // 0xb1b0
	FString StaticMeshes; // 0xb1c0
	FString StaticMeshes Enable WPO ; // 0xb1d0
	FString StaticMeshes Enable WPO Culling; // 0xb1e0
	FString StaticMeshes WPO Culling Radius ; // 0xb1f0
	FString SkeletalMeshes ; // 0xb200
	FString ProceduralMeshes ; // 0xb210
	FString NiagaraMeshes; // 0xb220
	FString NiagaraRibbons; // 0xb230
	FString NiagaraSprites; // 0xb240
	FString GI Directional Light; // 0xb250
	FString GI Point Light; // 0xb260
	FString GI Rect Light; // 0xb270
	FString GI Sky Light; // 0xb280
	FString GI Spot Light; // 0xb290
	FString Shadows Directional; // 0xb2a0
	FString Shadows Point; // 0xb2b0
	FString Shadows Rect; // 0xb2c0
	FString Shadows Spot; // 0xb2d0
	FString AO UseBiasForSkipWPOEval ; // 0xb2e0
	FString AO MaxBiasForInexactGeometry ; // 0xb2f0
	FString GI Reservoir Update Interval ; // 0xb300
	FString Final Gather Normal From Depth; // 0xb310
	FString Final Gather Max Reuse Weight; // 0xb320
	FString Final Gather Aggressive Reservoir Reuse ; // 0xb330
	FString GIDenoise ATrous Filter Width; // 0xb340
	FString WaterCaustics ReflectiveNormalScale ; // 0xb350
	FString WaterCaustics RefractiveNormalScale ; // 0xb360
	USGGameUserSettings* SGGameUserSettings; // 0xb370
	bool CachebForceClose; // 0xb378
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct AAudioVolume : AVolume {
	float Priority; // 0x348
	char bEnabled : 1; // 0x34c
	FReverbSettings Settings; // 0x350
	FInteriorSettings AmbientZoneSettings; // 0x370
	TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings; // 0x398
	TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings; // 0x3a8
};

struct UTextureLODSettings : UObject {
	TArray<FTextureLODGroup> TextureLODGroups; // 0x28
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x208
	FVector SocketOffset; // 0x20c
	FVector TargetOffset; // 0x218
	float ProbeSize; // 0x224
	ECollisionChannel ProbeChannel; // 0x228
	char bDoCollisionTest : 1; // 0x22c
	char bUsePawnControlRotation : 1; // 0x22c
	char bInheritPitch : 1; // 0x22c
	char bInheritYaw : 1; // 0x22c
	char bInheritRoll : 1; // 0x22c
	char bEnableCameraLag : 1; // 0x22c
	char bEnableCameraRotationLag : 1; // 0x22c
	char bUseCameraLagSubstepping : 1; // 0x22c
	char bDrawDebugLagMarkers : 1; // 0x22d
	float CameraLagSpeed; // 0x230
	float CameraRotationLagSpeed; // 0x234
	float CameraLagMaxTimeStep; // 0x238
	float CameraLagMaxDistance; // 0x23c
};

struct USGCharacterMovementComponent : UCharacterMovementComponent {
	float ClimbFriction; // 0xb50
	char bAccelerationFollowsRotation : 1; // 0xb54
	float MinAcceleration; // 0xb58
	char bRequestedMoveWithMaxSpeedOverride : 1; // 0xb5c
	float AdditiveNavCheckDistance; // 0xb60
	bool bLimitMoveOnNav; // 0xb64
	char bEnableUpdateRateOptimizations : 1; // 0xb65
	char bClientEnableUpdateRateOptimizations : 1; // 0xb65
	TMap<int32_t, int32_t> FrequencyToSkipUpdateMap; // 0xb68
	char bDisplayDebugUpdateRateOptimizations : 1; // 0xbb8
	float LostDeltaTime; // 0xbbc
	float ServerDeltaTimeTolerance; // 0xbe0
	char bFixMoveUpdatedTolerance : 1; // 0xbe4
	ENavMeshMovementMode NavMeshWalkingMode; // 0xc01
	ENavMeshLimitBoundaryMode NavMeshLimitBoundaryMode; // 0xc02
	FVector2D NavMeshWalkingSlideRateRange; // 0xc04
	float NavMeshWalkingEnterInterval; // 0xc0c
	int32_t NavMeshWalkingAllowLeaveToleranceNumber; // 0xc10
	TArray<float> LeavePointRadiusInNavMesh; // 0xc18
	char bUseFindTeleportSpotEx : 1; // 0xc28
	char bSetNavWalkingPhysics : 1; // 0xc28
	char bNavWalkingCheckPath : 1; // 0xc28
	char bSwimSinkToBottom : 1; // 0xc40
	float SwimSinkToBottomSpeed; // 0xc44
	char bCanSwimMove : 1; // 0xc48
	char bResolvePenetrationByAbove : 1; // 0xc48
	float OverlapCollisionShapeRadiusMul; // 0xc4c
	float ExtraSweepHeight; // 0xc50
	ABaseCharacter* BaseCharacterOwner; // 0xc68
};

struct UAbilityTask_ApplyRootMotionJumpForce : UAbilityTask_ApplyRootMotion_Base {
	FMulticastInlineDelegate OnFinish; // 0xc0
	FMulticastInlineDelegate OnLanded; // 0xd0
	FRotator Rotation; // 0xe0
	float Distance; // 0xec
	float Height; // 0xf0
	float Duration; // 0xf4
	float MinimumLandedTriggerTime; // 0xf8
	bool bFinishOnLanded; // 0xfc
	UCurveVector* PathOffsetCurve; // 0x100
	UCurveFloat* TimeMappingCurve; // 0x108
};

struct UUI_GenericMultiItemDialog : USGUI {
	FGenericMultiItemParam BindGenericMultiItemParams; // 0x2e8
	UButton* AcceptButton; // 0x350
	UButton* CancelButton; // 0x358
	UTextBlock* TitleTextBlock; // 0x360
	UTextBlock* DescriptionText; // 0x368
	UTextBlock* AcceptButtonTextBlock; // 0x370
	UCanvasPanel* ItemCheckPanel; // 0x378
	UUniformGridPanel* ItemGrid; // 0x380
	UScrollBox* ItemCheckScrollBox; // 0x388
	int32_t CurRowCounts; // 0x390
	UGenericMultiItemSlot* CheckItemTemplate; // 0x398
	TArray<UGenericMultiItemSlot*> CheckItemSlotList; // 0x3a0
	TArray<FGenericMultiItem> MultiItems; // 0x3b0
	EMultiChooseItemsType ItemFilterType; // 0x3c0
	FText TitleText[0x4]; // 0x3c8
	FText DesText[0x4]; // 0x428
	FText EmptyDesText[0x4]; // 0x488
};

struct USGCraftPerkGroup : UObject {
	FText CPGName; // 0x28
	FText CPGDescription; // 0x40
	TSoftObjectPtr<UTexture2D> CPGTexture; // 0x58
	TSoftObjectPtr<UTexture2D> CPGCircleBg; // 0x80
	int32_t CPGTypeIndex; // 0xa8
	ECraftPerkTimes CPGTimes; // 0xac
	int32_t RequiredCharacterLevel; // 0xb0
	int32_t RequiredCraftPoints; // 0xb4
	FCraftEntries CraftRequirement; // 0xb8
	int32_t RequireCopper; // 0xd8
	TArray<FPerkItemRequirement> RequireItems; // 0xe0
	char bHasLearned : 1; // 0xf0
	char bCanLearned : 1; // 0xf0
	char bHideInCraftPerkUI : 1; // 0xf0
	char bHideInCraftPerkUIMainLand : 1; // 0xf0
	int32_t RequireGuildLevel; // 0xf4
	int32_t GuildExperience; // 0xf8
	int32_t GuildCapital; // 0xfc
	bool NeedCheckDLC; // 0x100
	TArray<int32_t> DLCList; // 0x108
	int32_t Rows; // 0x118
	int32_t Column; // 0x11c
	TArray<USGCraftPerk*> CraftPerks; // 0x120
};

struct USGGameDataInteractiveImageData : UObject {
	TMap<EInteractiveMenus, FSoftObjectPath> InteractiveSelectedImage; // 0x28
	TMap<int32_t, FSoftObjectPath> InteractiveSelectedMulImage; // 0x78
	TMap<EInteractiveMenus, FSoftObjectPath> InteractiveUnSelectedImage; // 0xc8
	TMap<int32_t, FSoftObjectPath> InteractiveUnSelectedMulImage; // 0x118
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x160
};

struct UEdgeLoopInsertionProperties : UInteractiveToolPropertySet {
	EEdgeLoopPositioningMode PositionMode; // 0x60
	EEdgeLoopInsertionMode InsertionMode; // 0x64
	int32_t NumLoops; // 0x68
	double ProportionOffset; // 0x70
	double DistanceOffset; // 0x78
	bool bInteractive; // 0x80
	bool bFlipOffsetDirection; // 0x81
	bool bWireframe; // 0x82
	double VertexTolerance; // 0x88
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UInterpFilter : UObject {
	FString Caption; // 0x28
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionCustom : UMaterialExpression {
	FString Code; // 0x40
	ECustomMaterialOutputType OutputType; // 0x50
	FString Description; // 0x58
	TArray<FCustomInput> Inputs; // 0x68
	TArray<FCustomOutput> AdditionalOutputs; // 0x78
	TArray<FCustomDefine> AdditionalDefines; // 0x88
	TArray<FString> IncludeFilePaths; // 0x98
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct UMeshAttributePaintTool : UDynamicMeshBrushTool {
	UMeshAttributePaintToolProperties* AttribProps; // 0x200
};

struct UNiagaraPreviewAxis_InterpParamInt32 : UNiagaraPreviewAxis_InterpParamBase {
	int32_t Min; // 0x38
	int32_t Max; // 0x3c
};

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x370
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x378
};

struct UGeometryCacheTrack_FlipbookAnimation : UGeometryCacheTrack {
	uint32_t NumMeshSamples; // 0x58
};

struct UMaterialExpressionDepthFade : UMaterialExpression {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct UNiagaraComponentPool : UObject {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UAbilityTask_WaitConfirm : UAbilityTask {
	FMulticastInlineDelegate OnConfirm; // 0x80
};

struct UAnimNotifyState_Trail : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	ETrailWidthMode WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	char bRecycleSpawnedSystems : 1; // 0x54
};

struct UDestructibleMesh : USkeletalMesh {
	FDestructibleParameters DefaultDestructibleParameters; // 0x3a8
	TArray<FFractureEffect> FractureEffects; // 0x430
	TArray<int32_t> CustomChunkIndex; // 0x448
	TArray<FVector> CustomExplodeDirection; // 0x458
	TArray<char> IsStaticChunk; // 0x468
	TArray<FKAggregateGeom> ChunkAggGeoms; // 0x478
};

struct UGenericConfirmationCheckItemSlot : UUserWidget {
	UImage* ImgIcon; // 0x260
	UTextBlock* AmountText; // 0x268
	int32_t NeedAmount; // 0x270
	TWeakObjectPtr<USGItem> BindItem; // 0x274
	TWeakObjectPtr<USGInventoryComponent> BindCheckInventory; // 0x27c
	float SlotWidth; // 0x284
	float SlotHeight; // 0x288
	USizeBox* SlotSizeBox; // 0x290
	USGUI* RootUI; // 0x298
	char bEnough : 1; // 0x2a0
	FLinearColor EnoughColor; // 0x2a4
	FLinearColor NotEnoughColor; // 0x2b4
	int32_t FontSize; // 0x2c4
};

struct ANatureWeather : AActor {
	bool EnableRainParticle; // 0x318
	float RainParticleSpawnCount; // 0x31c
	FVector RainParticleDirection; // 0x320
	UParticleSystem* RainParticle; // 0x330
	UMaterialInterface* RainParticleMat; // 0x338
	UNatureWeatherComponent* Component; // 0x340
	USceneCaptureComponent2D* SceneCaptureComp; // 0x348
};

struct UNiagaraDataInterfaceArrayFloat4 : UNiagaraDataInterfaceArray {
	TArray<FVector4> FloatData; // 0x50
};

struct USetCollisionGeometryToolProperties : UInteractiveToolPropertySet {
	ECollisionGeometryType GeometryType; // 0x60
	ESetCollisionGeometryInputMode InputMode; // 0x64
	bool bUseWorldSpace; // 0x68
	bool bRemoveContained; // 0x69
	bool bEnableMaxCount; // 0x6a
	int32_t MaxCount; // 0x6c
	float MinThickness; // 0x70
	bool bDetectBoxes; // 0x74
	bool bDetectSpheres; // 0x75
	bool bDetectCapsules; // 0x76
	bool bSimplifyHulls; // 0x77
	int32_t HullTargetFaceCount; // 0x78
	bool bSimplifyPolygons; // 0x7c
	float HullTolerance; // 0x80
	EProjectedHullAxis SweepAxis; // 0x84
	bool bAppendToExisting; // 0x88
	ECollisionGeometryMode SetCollisionType; // 0x8c
};

struct UUI_N_ShopBanner : UUserWidget {
	UWidgetSwitcher* BannerSwitcher; // 0x260
	UButton* TurnLeftBtn; // 0x268
	UButton* TurnRightBtn; // 0x270
	UHorizontalBox* IndexHBox; // 0x278
	FMargin IndexPicPadding; // 0x280
	UUI_N_Shop_BannerStateBtn* BannerStateBtnTemplate; // 0x290
};

struct ASGStructureNPC : ASGStructureSeat {
	TArray<ABaseCharacter*> AllowNPCClass; // 0xf78
	char bUseSeatWeaponMontage : 1; // 0xf88
	TArray<FSeatWeaponMontage> SeatWeaponMontage; // 0xf90
	char bMapProduceStructure : 1; // 0xfa0
	TArray<USGItem*> GetWaterItemTemplates; // 0xfa8
	UAnimMontage* PlayerGetWaterMontage; // 0xfb8
	int32_t WaterCooldownTime; // 0xfc0
	float PlayerGetWaterCoolTime; // 0xfc4
	char bProduceStructure : 1; // 0xfc8
	char bNeedNPCForProduce : 1; // 0xfc8
	int32_t DropWrapperId; // 0xfcc
	float DropInterval; // 0xfd0
	float AddSkillExpPerSecond; // 0xfd4
	EStructureNPCType StructureNPCType; // 0xfd8
	float HangUpAddExp; // 0xfe8
	float HangUpAddExpInterval; // 0xfec
	float HangUpWeaponAddExp[0x8]; // 0xff0
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct UAsyncActionHandleSaveGame : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate Completed; // 0x30
	USaveGame* SaveGameObject; // 0x60
};

struct UInputComponent : UActorComponent {
	TArray<FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x130
};

struct UDatasmithImportOptions : UDatasmithOptionsBase {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x28
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x29
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x2a
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x2b
	EDatasmithImportActorPolicy LightImportPolicy; // 0x2c
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x2d
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x2e
	EDatasmithImportMaterialQuality MaterialQuality; // 0x2f
	FDatasmithImportBaseOptions BaseOptions; // 0x34
	FDatasmithReimportOptions ReimportOptions; // 0x48
	FString Filename; // 0x50
	FString FilePath; // 0x60
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct ASGStructureStable : ASGStructureSeat {
	char bClearZeroLifeChunk : 1; // 0xf70
	float SearchCharacterInterval; // 0xf74
	char bIsDebugSearchCharacter : 1; // 0xf78
	TArray<FLinkChunkWithTrainerInfo> LinkAnimalChunkInfo; // 0xf98
	TArray<FGuid> LinkGeneralChunkGuid; // 0xfa8
	TArray<FLinkChunkWithTrainerInfo> LinkReborningChunkInfo; // 0xfb8
	UDataTable* FoodDataTable; // 0xfc8
	float RebornReduceFoodPerSecond; // 0xfd0
	TArray<FName> TainerSeatSocketName; // 0xfe8
	int32_t NumTainerSeats; // 0xff8
	UDataTable* TrainerDataTable; // 0x1000
	TMap<ESystemTrainerType, FSystemTrainerInfo> SystemTrainerConfig; // 0x1008
	float TrainerWorkTimeThreshold; // 0x1058
	float ReleaseTraceOffsetUp; // 0x10c0
	float ReleaseTraceOffsetDown; // 0x10c4
	float ReleaseRandomRadiusMin; // 0x10c8
	float ReleaseRandomRadiusMax; // 0x10cc
	float ReleaseToleranceHeight; // 0x10d0
	float ReleaseRandomRadiusMinByOperator; // 0x10d4
	float ReleaseRandomRadiusMaxByOperator; // 0x10d8
	float ReleaseToleranceHeightByOperator; // 0x10dc
	FVector VaildReleaseLocation; // 0x10e0
	FTimerHandle CalcReborningHandle; // 0x10f0
	float CalcReborningTimerInterval; // 0x10f8
	FTimerHandle CalcWorkingHandle; // 0x1100
	float CalcWorkingTimerInterval; // 0x1108
	FTimerHandle UpdateAnimalDataHandle; // 0x1110
	float UpdateAnimalDataTimerInterval; // 0x1118
	char bUseAnimalNetData : 1; // 0x111c
	int32_t ShowAnimalMaxNum; // 0x1120
	int32_t LastAnimalCount; // 0x1124
	char bUseNiagara : 1; // 0x1128
	UNiagaraSystem* NiagaraAsset; // 0x1130
	float NiaAnimalSeparation; // 0x1138
	FVector NiaAnimalScale; // 0x113c
	FVector NiaComponentOffset; // 0x1148
	TWeakObjectPtr<UNiagaraComponent> AnimalNiagaraComponent; // 0x1154
};

struct UUI_ModEntryTemplate : UUserWidget {
	UTextBlock* mTextBlockName; // 0x268
};

struct UMaterialExpressionRotator : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct UUI_XianChengRelationShip : USGUI {
	UXianChengRelationShipItem* ItemTemplate; // 0x2d8
	TArray<UXianChengRelationShipItem*> XianChengRelationShipItems; // 0x2e0
	UUniformGridPanel* XianChengRelationShipGridPanel; // 0x2f0
};

struct UPhysicsSettingsCore : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableShapeSharing; // 0x50
	bool bEnablePCM; // 0x51
	bool bEnableStabilization; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	bool bDefaultHasComplexCollision; // 0x55
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	float ContactOffsetMultiplier; // 0x68
	float MinContactOffset; // 0x6c
	float MaxContactOffset; // 0x70
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x74
	ECollisionTraceFlag DefaultShapeComplexity; // 0x75
	FChaosSolverConfiguration SolverOptions; // 0x78
};

struct ULuminRuntimeSettings : UObject {
	FString PackageName; // 0x28
	FString ApplicationDisplayName; // 0x38
	ELuminFrameTimingHint FrameTimingHint; // 0x48
	bool bProtectedContent; // 0x49
	bool bManualCallToAppReady; // 0x4a
	bool bUseMobileRendering; // 0x4b
	bool bUseVulkan; // 0x4c
	FFilePath Certificate; // 0x50
	FDirectoryPath IconModelPath; // 0x60
	FDirectoryPath IconPortalPath; // 0x70
	FLocalizedIconInfos LocalizedIconInfos; // 0x80
	int32_t VersionCode; // 0x90
	int32_t MinimumAPILevel; // 0x94
	TArray<ELuminPrivilege> AppPrivileges; // 0x98
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8
	FString SpatializationPlugin; // 0xc8
	FString ReverbPlugin; // 0xd8
	FString OcclusionPlugin; // 0xe8
	int32_t SoundCueCookQualityIndex; // 0xf8
	bool bRemoveDebugInfo; // 0xfc
	FDirectoryPath VulkanValidationLayerLibs; // 0x100
	bool bFrameVignette; // 0x110
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118
};

struct UWBP_KeySetting_C : UUI_KeySetting {
	UCanvasPanel* KeySetting; // 0x2b8
	UWBP_KeySettingRadioView_C* KeySettingRadioView; // 0x2c0
	UImage* TitleImage; // 0x2c8
	UImage* TitleImage_2; // 0x2d0
	UImage* TitleImage_3; // 0x2d8
	UImage* TitleImage_4; // 0x2e0
	UImage* TitleImage_5; // 0x2e8
	UImage* TitleImage_6; // 0x2f0
	UImage* TitleImage_7; // 0x2f8
	UImage* TitleImage_8; // 0x300
	UImage* TitleImage_9; // 0x308
	UWBP_KeySettingItem_C* SelectKeySettingItem_1; // 0x310
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x310
};

struct USculptBrushProperties : UBrushBaseProperties {
	float Depth; // 0x78
	bool bHitBackFaces; // 0x7c
	float Lazyness; // 0x80
	bool bShowPerBrushProps; // 0x84
};

struct UDeviceProfile : UTextureLODSettings {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x88
};

struct UGuildApplySlot : USGUI {
	UTextBlock* ApplyNameText; // 0x2d8
	UTextBlock* ApplyLevelText; // 0x2e0
	UTextBlock* ApplyVerifyText; // 0x2e8
	UDataButton* AgreeDataButton; // 0x2f0
	UDataButton* RejectDataButton; // 0x2f8
};

struct ASGGameMode : AGameMode {
	TArray<FString> PrivateServerPlayerNameSet; // 0x428
	ASGCharacter* LobbySpawnCharacterTemplate; // 0x438
	float LobbyLoginWaitTime; // 0x514
	UDataTable* ExploitCompConfigsDataTable; // 0x5b8
	USGCheatManager* AdminSGCheatManager; // 0x628
	TArray<UOnlineLobbySession*> OnlineLobbySessionList; // 0x630
	UShutDownService* ShutDownServiceSocket; // 0x648
	TMap<FString, UBasePlayerData*> BasePlayerDatas; // 0x650
	TMap<FString, FPlayerPresenceStaus> PlayerPresenceStaus; // 0x6a0
	FServerInfoData ServerInfoData; // 0x6f0
	FSkillAddExpAction SkillAddExpAction; // 0x7e8
	FServerMultiplier GameMultiplier; // 0x9b0
	FDateTime LastClearGuildGongXunTime; // 0xf10
	TMap<FGuid, FGuildSingleServerData> GuildSingleServerDatas; // 0xf18
	TMap<FGuid, FGuildDetailData> GuildDetailDatas; // 0xf68
	TMap<FGuid, FGuildBriefData> GuildBriefDatas; // 0xfb8
	int64_t ServerOpenTime; // 0x1008
	UPubDataManager* PubDataManager; // 0x1010
	char bPubDataAllLoaded : 1; // 0x1018
	TMap<FGuid, FMsgRecordList> PlayerMsgRecords; // 0x1040
	TMap<FGuid, FMsgRecordList> GuildMsgRecords; // 0x1090
	int32_t MaxGuildContainerRecCount; // 0x10e0
	TMap<FGuid, FGuildContainerRecSets> GuildContainerLogs; // 0x10e8
	char bApplyToGameStateAfterLoadWorldCompleted : 1; // 0x1138
	int32_t CurrentServerLevel; // 0x113c
	FTaishouSignInfo TaishouSignInfoBackup; // 0x1140
	char bWorldIsSaveGame : 1; // 0x1259
	float ClearDBChunkMinutes; // 0x125c
	float ClearChunkMinutes; // 0x1260
	float DefaultRebornTime; // 0x1264
	int32_t DefaultDeathReduceLifeCount; // 0x1268
	TMap<ECharacterType, int32_t> DeathReduceLifeCount; // 0x1270
	TMap<FGuid, FBaseChunkDataInfo> ChunkInfoMap; // 0x12c0
	EBattleType BattleType; // 0x1310
	FGuid DefenseGuildGuid; // 0x1324
	FGuid AttackGuildGuid; // 0x1334
	FGuid DefenseAllianGuid; // 0x1344
	FGuid AttackAllianGuid; // 0x1354
	uint32_t DeleteRoleCoolDownMinutes; // 0x1388
	int32_t CalProtectionInterval; // 0x138c
	double LastCalProtectionTime; // 0x1390
	char bOpenQuestSystem : 1; // 0x1398
	TMap<FGuid, FGuildStructureData> GuildStructureDatas; // 0x13a0
	TMap<FGuid, FMiniMapMarkDataArray> PlayerMiniMapMarkDatas; // 0x13f0
	TMap<FGuid, FMiniMapMarkDataArray> GuildMiniMapMarkDatas; // 0x1440
	TMap<FGuid, FGuildStructureInfoData> GuildStructureInfoDatas; // 0x1490
	TMap<FGuid, FCharacterStructureData> ServerCharacterStructureDatas; // 0x14e0
	TMap<FString, FOccupySellInfo> PlayerOccupySellDatas; // 0x1530
	int32_t GMInitProtectTime; // 0x1580
	TMap<FGuid, FVector> PlayerLastDeathLocations; // 0x1588
	int32_t SaveLastDeathInfoNum; // 0x15d8
	TMap<FGuid, FDeathCharacterInfoList> DeathCharacterInfoMap; // 0x15e0
	int32_t PlayerVoiceDistance; // 0x1630
	TArray<FWorship> CurrentWorshipEffect; // 0x16c0
	FGuid XianChengOwner; // 0x16d0
	TArray<char> StandalonePlayerData; // 0x1738
	TArray<char> StandaloneCharacterData; // 0x1748
};

struct UUI_GuildSilverStore : USGUI {
	UImage* StoreImage; // 0x2d8
	UImage* TakeImage; // 0x2e0
	UButton* StoreButton; // 0x2e8
	UButton* TakeButton; // 0x2f0
	UButton* ConfirmButton; // 0x2f8
	UDataButton* ConfirmTipsButton; // 0x300
	UButton* CannelButton; // 0x308
	UTextBlock* GuildSilverText; // 0x310
	UTextBlock* GuildResultText; // 0x318
	UTextBlock* PlayerNameText; // 0x320
	UTextBlock* PlayerSilverText; // 0x328
	UTextBlock* PlayerResultText; // 0x330
	UEditableTextBox* ValueTextBox; // 0x338
	UImage* StoreResultImage; // 0x340
	UImage* PlayerResultImage; // 0x348
	TSoftObjectPtr<UTexture2D> AddResultTexture; // 0x350
	TSoftObjectPtr<UTexture2D> ReduceResultTexture; // 0x378
	FLinearColor AddResultColor; // 0x3a0
	FLinearColor ReduceResultColor; // 0x3b0
	USGToolTipWidget* ButtonTipWidgetTemplate; // 0x3c0
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UUI_N_GuildSkill : USGUI {
	UTextBlock* GuildExpText; // 0x2d8
	UTextBlock* GuildMoneyText; // 0x2e0
	UButton* BackButton; // 0x2e8
	UVerticalBox* GuildSkillGroupVerticalBox; // 0x2f0
	UCanvasPanel* UpgradeGuildSkillCanvas; // 0x2f8
	UTextBlock* NeedGuildActiveText; // 0x300
	UTextBlock* NeedGuildSilverText; // 0x308
	UCheckBox* UseSelfCopperCheckBox; // 0x310
	UButton* ConfirmUpgradeButton; // 0x318
	UButton* CancelUpgradeButton; // 0x320
	UGuildSkillGroupSlot* GuildSkillGroupSlotTemplate; // 0x328
	TArray<FGuildSkillDrawGroup> GuildSkillDrawGroups; // 0x330
	FLinearColor EnoughColor; // 0x340
	FLinearColor NotEnoughColor; // 0x350
	UUI_GenericConfirmationDialog* ConfirmUsePersonalUIOverride; // 0x360
};

struct UJunSelectorWidget : UUserWidget {
	UJunSelectorItem* ItemTemplate; // 0x260
	UJunDistrictFilterWidget* DistrictFilterTemplate; // 0x268
	UUniformGridPanel* UGPItem; // 0x270
	UScrollBox* MainScrollBox; // 0x278
	UUniformGridPanel* UGPDistrict; // 0x280
	UJunSelectorItem* SelectItem; // 0x298
	TArray<UJunSelectorItem*> ItemList; // 0x2a0
	TArray<FJunSelectorConfig> JunList; // 0x2b0
	TArray<int32_t> Districts; // 0x2c0
	TArray<UJunDistrictFilterWidget*> DistrictFilters; // 0x2d0
	TArray<int32_t> CheckedDistricts; // 0x2e0
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UInterpTrackFloatParticleParam : UInterpTrackFloatBase {
	FName ParamName; // 0x90
};

struct USoundNodeOscillator : USoundNode {
	char bModulateVolume : 1; // 0x48
	char bModulatePitch : 1; // 0x48
	float AmplitudeMin; // 0x4c
	float AmplitudeMax; // 0x50
	float FrequencyMin; // 0x54
	float FrequencyMax; // 0x58
	float OffsetMin; // 0x5c
	float OffsetMax; // 0x60
	float CenterMin; // 0x64
	float CenterMax; // 0x68
};

struct UMagicLeapLightingTrackingComponent : UActorComponent {
	bool UseGlobalAmbience; // 0xc0
	bool UseColorTemp; // 0xc1
};

struct ASGStructureLadder : ASGStructure {
	char bUseSkeletalMesh : 1; // 0xb98
	float CanUseAngle; // 0xb9c
	char bIsAerialLadder : 1; // 0xba0
	char bBuilded : 1; // 0xba0
	float BuildCheckDistance; // 0xba4
	float PushCheckDistance; // 0xba8
	float ClimbStartTolerance; // 0xbac
	float PenetrationTraceHeight; // 0xbb0
	int32_t PenetrationStartStep; // 0xbb4
	double LastResponseClimbLadderTime; // 0xbb8
	UParticleSystem* BuildAerialLadderParticle; // 0xbc0
	TWeakObjectPtr<UParticleSystemComponent> BuildAerialLadderParticleComp; // 0xbc8
	UCurveFloat* BuildAerialLadderCurve; // 0xbd0
	FTransform BuildAerialLadderTransformLS; // 0xbe0
	UAnimMontage* BuildAerialLadderMontage; // 0xc10
	float BuildAerialLadderSuccessPosition; // 0xc18
	UParticleSystem* PushAerialLadderParticle; // 0xc20
	TWeakObjectPtr<UParticleSystemComponent> PushAerialLadderParticleComp; // 0xc28
	UCurveFloat* PushAerialLadderCurve; // 0xc30
	FTransform PushAerialLadderTransformLS; // 0xc40
	UAnimMontage* PushAerialLadderMontage; // 0xc70
	float PushAerialLadderSuccessPosition; // 0xc78
	FRotator OriginRotation; // 0xc7c
	FRotator FinishRotation; // 0xc88
	float BuildOneSecondAddLocalPitch; // 0xc94
	float PushOneSecondAddLocalPitch; // 0xc98
	float PushUseDurable; // 0xc9c
	FTimerHandle RotateTimerHandle; // 0xca8
	char bBuildingRotate : 1; // 0xcb0
	float AccumulateRotateTime; // 0xcb4
	char bPushingRotate : 1; // 0xcbc
	TArray<TWeakObjectPtr<ABaseCharacter>> ClimbCharacters; // 0xcc0
};

struct UStableTrainerSlot : UUserWidget {
	TSoftObjectPtr<UTexture2D> TrainerQualityTexture[0x6]; // 0x260
	TSoftObjectPtr<UTexture2D> TrainerSpecialTypeTexture[0x4]; // 0x350
	UImage* TrainerQualityBG; // 0x3f0
	UImage* TrainerSpecialTypeBG; // 0x3f8
	UImage* TrainerIconImg; // 0x400
	UButton* StopWorkBtn; // 0x408
	UTextBlock* TrainerStatusText; // 0x410
	UTextBlock* TrainerNameText; // 0x418
	UTextBlock* TrainerLevelText; // 0x420
	UTextBlock* TrainerLifeCountText; // 0x428
	UTextBlock* TrainerTameSkillExpText; // 0x430
	UProgressBar* WorkRemainTimePB; // 0x438
	UTextBlock* TrainerWorkTimeText; // 0x440
	UButton* StopRestBtn; // 0x448
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct USoundNodeModulatorContinuous : USoundNode {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UOnsetNRTSettings : UAudioSynesthesiaNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct UGeometryCollectionComponent : UMeshComponent {
	AChaosSolverActor* ChaosSolverActor; // 0x4b8
	UGeometryCollection* RestCollection; // 0x5a0
	TArray<AFieldSystemActor*> InitializationFields; // 0x5a8
	bool Simulating; // 0x5b8
	EObjectStateTypeEnum ObjectType; // 0x5c0
	bool EnableClustering; // 0x5c1
	int32_t ClusterGroupIndex; // 0x5c4
	int32_t MaxClusterLevel; // 0x5c8
	TArray<float> DamageThreshold; // 0x5d0
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x5e0
	int32_t CollisionGroup; // 0x5e4
	float CollisionSampleFraction; // 0x5e8
	float LinearEtherDrag; // 0x5ec
	float AngularEtherDrag; // 0x5f0
	UChaosPhysicalMaterial* PhysicalMaterial; // 0x5f8
	EInitialVelocityTypeEnum InitialVelocityType; // 0x600
	FVector InitialLinearVelocity; // 0x604
	FVector InitialAngularVelocity; // 0x610
	UPhysicalMaterial* PhysicalMaterialOverride; // 0x620
	FGeomComponentCacheParameters CacheParameters; // 0x628
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsStateChange; // 0x678
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsLoadingStateChange; // 0x688
	FMulticastInlineDelegate OnChaosBreakEvent; // 0x6b0
	float DesiredCacheTime; // 0x6c0
	bool CachePlayback; // 0x6c4
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x6c8
	bool bNotifyBreaks; // 0x6d8
	bool bNotifyCollisions; // 0x6d9
	bool bEnableReplication; // 0x6da
	bool bEnableAbandonAfterLevel; // 0x6db
	int32_t ReplicationAbandonClusterLevel; // 0x6dc
	FGeometryCollectionRepData RepData; // 0x6e0
	UBodySetup* DummyBodySetup; // 0x918
};

struct UN_SplitItemPanel : UUserWidget {
	UTextBlock* ItemName; // 0x260
	UTextBlock* OperationText; // 0x268
	UEditableText* OperationAmountText; // 0x270
	UButton* AddButton; // 0x278
	UButton* ReduceButton; // 0x280
	USlider* OperationSlider; // 0x288
	UButton* AcceptButton; // 0x290
	UButton* CancelButton; // 0x298
	TWeakObjectPtr<USGItem> BindItem; // 0x2a0
	EInventoryTypes SourceInventoryType; // 0x2a8
	EInventoryTypes InventoryType; // 0x2a9
	int32_t CraftNum; // 0x2b4
	FText SplitText; // 0x2b8
	FText CraftText; // 0x2d0
	FVector2D WidgetOffset; // 0x2e8
	ESplitUIType SplitType; // 0x2f0
	EInventoryTypes RecordTransportItemInventoyType; // 0x2f1
	int32_t RecordSplitNum; // 0x2f4
};

struct ULevelActorContainer : UObject {
	TArray<AActor*> Actors; // 0x28
};

struct UUI_GuildBeInviteList : USGUI {
	UScrollBox* BeInviteListPanel; // 0x2d8
	UDataButton* PrePageDataButton; // 0x2e0
	UDataButton* NextPageDataButton; // 0x2e8
	UTextBlock* ShowPageText; // 0x2f0
	UButton* ExitButton; // 0x2f8
	UCheckBox* InviteSwitchCheckBox; // 0x300
	USortableTitleSlot* AllianceNameTitleSlot; // 0x308
	USortableTitleSlot* PlayerNameTitleSlot; // 0x310
	USortableTitleSlot* ManagementTitleSlot; // 0x318
	int32_t ApplyNumPerPage; // 0x320
	UGuildBeInviteSlot* GuildBeInviteSlotClass; // 0x328
};

struct UStereoLayerShapeEquirect : UStereoLayerShape {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UDatasmithPointLightComponentTemplate : UDatasmithObjectTemplate {
	ELightUnits IntensityUnits; // 0x30
	float SourceRadius; // 0x34
	float SourceLength; // 0x38
	float AttenuationRadius; // 0x3c
};

struct UFontFace : UObject {
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42
};

struct APostProcessVolume : AVolume {
	FPostProcessSettings Settings; // 0x350
	float Priority; // 0x8b0
	float BlendRadius; // 0x8b4
	float BlendWeight; // 0x8b8
	char bEnabled : 1; // 0x8bc
	char bUnbound : 1; // 0x8bc
};

struct UNiagaraPreviewAxis_InterpParamVector2D : UNiagaraPreviewAxis_InterpParamBase {
	FVector2D Min; // 0x38
	FVector2D Max; // 0x40
};

struct UBTTask_RoadPath : UBTTask_SGBlueprintBase {
	FBlackboardKeySelector BBKey_RoadPathIndex; // 0xc0
	FBlackboardKeySelector BBKey_DesiredLocation; // 0xe8
	ECustomRoadPathType Enum_CustomRoadPathType; // 0x168
	float AcceptableRadius; // 0x16c
	float FollowAddDistance; // 0x170
	FVector2D FinishedRoadPathCoolingTimeRange; // 0x17c
	char bCheckWaitChangeGuard : 1; // 0x184
};

struct USafeZone : UContentWidget {
	bool PadLeft; // 0x120
	bool PadRight; // 0x121
	bool PadTop; // 0x122
	bool PadBottom; // 0x123
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe8
};

struct ASGMenuHUD : AHUD {
	UUI_OfficalSessionList* OfficalSessionListTemplate; // 0x408
	UUI_PrivateSessionList* PrivateSessionListTemplate; // 0x410
	UUI_MainMenu* MainMenuTemplate; // 0x418
	UUI_Setting* SettingTemplate; // 0x420
	USGUI* GameNoticeTemplate; // 0x428
	UUI_ModsManageBase* ModManageTemplate; // 0x430
	UUI_ProducerList* ProducerListTemplate; // 0x438
	UUI_PrivateSessionEntry* PrivateSessionEntryTemplate; // 0x440
	UUI_OfficalSessionList* OfficalSessionListUI; // 0x448
	UUI_PrivateSessionList* PrivateSessionListUI; // 0x450
	UUI_MainMenu* MainMenuUI; // 0x458
	UUI_Setting* SettingUI; // 0x460
	USGUI* GameNoticeUI; // 0x468
	UUI_ModsManageBase* ModManageUI; // 0x470
	UUI_ProducerList* ProducerListUI; // 0x478
	UUI_PrivateSessionEntry* PrivateSessionEntryUI; // 0x480
};

struct USGVehiclePerk : UObject {
	FText Name; // 0x28
	FText Description; // 0x40
	FString Param1; // 0x58
	FString Param2; // 0x68
	FString Param3; // 0x78
	FString Param4; // 0x88
	FString Param5; // 0x98
	TSoftObjectPtr<UTexture2D> PerkTexture; // 0xa8
	EVehiclePerkType VehiclePerkType; // 0xd0
	FString VehicleGroupTag; // 0xd8
	EAttributeCorrectionType RequiredAttributeCorrectionType; // 0xe8
	int32_t RequiredAttributeCorrectionCount; // 0xec
	EAnimalQualityType RequiredQualityType; // 0xf0
	int32_t RequiredWildLevel; // 0xf4
	int32_t RequiredTameLevel; // 0xf8
	int32_t RequiredRealNameDataIndex; // 0xfc
	TArray<USGVehiclePerk*> RequiredPerkEntries; // 0x100
	float RequiredStrongMorph; // 0x110
	float RequiredThinMorph; // 0x114
	EAnimalFurColorType RequiredSkinColorType; // 0x118
	ECharacterSex RequiredSex; // 0x119
	char bRequiredCastrated : 1; // 0x11a
	int32_t RequiredCastrateLifeCount; // 0x11c
	TArray<float> AttributeCorrectionModify; // 0x120
	EVehiclePerkQualityType PerkQualityType; // 0x130
	USGBuff* BindBuff; // 0x138
	USGBuff* TriggerBuff; // 0x140
	char bPassivePerk : 1; // 0x148
	char bNegativePerk : 1; // 0x148
	EVehiclePerkState VehiclePerkState; // 0x149
};

struct UN_GuildSkillSlot : USGUI {
	UImage* BorderImage; // 0x2d8
	UImage* MaskImage; // 0x2e0
	UTextBlock* LevelText; // 0x2e8
	UImage* IconImage; // 0x2f0
	UImage* LevelUpImage; // 0x2f8
	UCanvasPanel* LevelCanvasPanel; // 0x300
	UGuildSkillToolTipWidget* ToolTipWidgetTemplateOverride; // 0x308
	TSoftObjectPtr<UTexture2D> NormalBorderTexture; // 0x310
	TSoftObjectPtr<UTexture2D> NormalMaskTexture; // 0x338
	TSoftObjectPtr<UTexture2D> CanUpdateBorderTexture; // 0x360
	TSoftObjectPtr<UTexture2D> CanUpdateMaskTexture; // 0x388
	TSoftObjectPtr<UTexture2D> UnlockBorderTexture; // 0x3b0
	TSoftObjectPtr<UTexture2D> UnlockMaskTexture; // 0x3d8
	TSoftObjectPtr<UTexture2D> SelectedBorderTexture; // 0x400
	TSoftObjectPtr<UTexture2D> SelectedMaskTexture; // 0x428
};

struct UGizmoTransformChangeStateTarget : UObject {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x50
};

struct UUI_GameSiegeTips : USGUI {
	char bIsFireSeat : 1; // 0x2f8
	char bIsControlSeat : 1; // 0x2f8
	char bActive : 1; // 0x2f8
	ETurretFireMode FireMode; // 0x2f9
	char bShowAngle : 1; // 0x2fa
	TWeakObjectPtr<USGInventoryComponent> BindInventory; // 0x2fc
	UImage* ScaleplateImg; // 0x308
	UCanvasPanel* ReloadCanvas; // 0x310
	UTextBlock* ReloadAmmoText; // 0x318
	UProgressBar* ReloadProgressBar; // 0x320
	UCanvasPanel* AnglePanel; // 0x328
	UTextBlock* AngleText; // 0x330
	UCanvasPanel* StoreCanvas; // 0x338
	UProgressBar* StoreProgressBar; // 0x340
	UTextBlock* StoreProgressBarText; // 0x348
	UCanvasPanel* LeftTimeCanvas; // 0x350
	UProgressBar* LeftTimeProgressBar; // 0x358
	UTextBlock* LeftTimeText; // 0x360
	USGRichTextBlock* TipsText; // 0x368
	UCanvasPanel* WarningCanvas; // 0x370
	UCanvasPanel* ScaleplateCanvas; // 0x378
	UHorizontalBox* BottomHelpHorizontal; // 0x380
	UUniformGridPanel* AmmoGridPanel; // 0x388
	int32_t ColumnMaxAmount; // 0x390
	USiegeTipsAmmoSlot* SiegeAmmoSlotTemplate; // 0x398
	char bIsNeedShowScaleplate : 1; // 0x3a0
	UHelpTipsSlot* SiegeTipsHelpSlotTemplate; // 0x3a8
	TArray<UHelpTipsSlot*> NotControlSeatCollapsedSlotList; // 0x3b0
	TArray<UHelpTipsSlot*> NotFireSeatCollapsedSlotList; // 0x3c0
	FVector4 BottomSlotPadding; // 0x3d0
	char bShowScaleplate : 1; // 0x3e0
	FHelpTips SiegeTypeToHelpTip[0xa]; // 0x3e8
	FText ChangeOperationText; // 0x488
	FText ChangeFireSeatText; // 0x4a0
	FText ChangeHelpSeatText; // 0x4b8
	float FireStopTime; // 0x4d0
	TArray<USiegeTipsAmmoSlot*> AmmoSlotList; // 0x4e0
};

struct UUI_TransGuildExpPoint : USGUI {
	UTextBlock* GuildLevelText; // 0x2d8
	UTextBlock* ActivityPointText; // 0x2e0
	UTextBlock* CurrentPointText; // 0x2e8
	UButton* ReducePointButton; // 0x2f0
	UButton* AddPointButton; // 0x2f8
	UButton* SubmitButton; // 0x300
	UButton* CancelButton; // 0x308
	USlider* TransferSlider; // 0x310
};

struct UAnimationSharingSetup : UObject {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct USkeleton : UObject {
	TArray<FBoneNode> BoneTree; // 0x38
	TArray<FTransform> RefLocalPoses; // 0x48
	FGuid VirtualBoneGuid; // 0x170
	TArray<FVirtualBone> VirtualBones; // 0x180
	TArray<USkeletalMeshSocket*> Sockets; // 0x190
	FSmartNameContainer SmartNames; // 0x1f0
	TArray<UBlendProfile*> BlendProfiles; // 0x270
	TArray<FAnimSlotGroup> SlotGroups; // 0x280
	TArray<UAssetUserData*> AssetUserData; // 0x358
};

struct UUI_PasswordConfirmationDialog : USGUI {
	UButton* BtnAccept; // 0x2e8
	UEditableTextBox* EtbPassword; // 0x2f0
	UEditableTextBox* EtbConfirmPassword; // 0x2f8
	UEditableTextBox* EtbEmail; // 0x300
	UTextBlock* TbTitle; // 0x308
	UTextBlock* TbContent; // 0x310
	UTextBlock* TbError; // 0x318
	UCheckBox* CheckBoxShowPassword; // 0x320
};

struct UAutomationTestSettings : UObject {
	TArray<FString> EngineTestModules; // 0x28
	TArray<FString> EditorTestModules; // 0x38
	FSoftObjectPath AutomationTestmap; // 0x48
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x60
	TArray<FSoftObjectPath> AssetsToOpen; // 0x70
	TArray<FString> MapsToPIETest; // 0x80
	FBuildPromotionTestSettings BuildPromotionTest; // 0x90
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x280
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2b0
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2c0
	TArray<FString> TestLevelFolders; // 0x2f0
	TArray<FExternalToolDefinition> ExternalTools; // 0x300
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x310
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x320
	FIntPoint DefaultScreenshotResolution; // 0x330
	float PIETestDuration; // 0x338
};

struct UGuanAiRowSlot : USGUI {
	UTextBlock* GuanAiNameText; // 0x2d8
	UImage* GuanAiImage; // 0x2e0
	UButton* BtnEntry; // 0x2e8
	UTextBlock* TbEntry; // 0x2f0
	int32_t GuanAiId; // 0x2f8
	int32_t BtnEntryState; // 0x2fc
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	char bVisibleInRayTracing : 1; // 0x158
	char bEvaluateWorldPositionOffset : 1; // 0x158
	FBodyInstance BodyInstance; // 0x160
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x2c0
	FLightingChannels LightingChannels; // 0x2c1
	char bRenderCustomDepth : 1; // 0x2c4
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x2c8
	int32_t CustomDepthStencilValue; // 0x2cc
	int32_t TranslucencySortPriority; // 0x2d0
	float CollisionRadius; // 0x2d4
	float ShadeRadius; // 0x2d8
	int32_t NumSteps; // 0x2dc
	float InitialSeedDensity; // 0x2e0
	float AverageSpreadDistance; // 0x2e4
	float SpreadVariance; // 0x2e8
	int32_t SeedsPerStep; // 0x2ec
	int32_t DistributionSeed; // 0x2f0
	float MaxInitialSeedOffset; // 0x2f4
	TArray<FRelatedFoliageTypeEntry> ProceduralCloseToFoliages; // 0x2f8
	TArray<FRelatedFoliageTypeEntry> ProceduralFarFromFoliages; // 0x308
	bool bCanGrowInShade; // 0x318
	bool bSpawnsInShade; // 0x319
	float MaxInitialAge; // 0x31c
	float MaxAge; // 0x320
	float OverlapPriority; // 0x324
	FFloatInterval ProceduralScale; // 0x328
	FRuntimeFloatCurve ScaleCurve; // 0x330
	int32_t ChangeCount; // 0x3b8
	char ReapplyDensity : 1; // 0x3bc
	char ReapplyRadius : 1; // 0x3bc
	char ReapplyAlignToNormal : 1; // 0x3bc
	char ReapplyRandomYaw : 1; // 0x3bc
	char ReapplyScaling : 1; // 0x3bc
	char ReapplyScaleX : 1; // 0x3bc
	char ReapplyScaleY : 1; // 0x3bc
	char ReapplyScaleZ : 1; // 0x3bc
	char ReapplyRandomPitchAngle : 1; // 0x3bd
	char ReapplyGroundSlope : 1; // 0x3bd
	char ReapplyHeight : 1; // 0x3bd
	char ReapplyLandscapeLayers : 1; // 0x3bd
	char ReapplyZOffset : 1; // 0x3bd
	char ReapplyCollisionWithWorld : 1; // 0x3bd
	char ReapplyVertexColorMask : 1; // 0x3bd
	char bEnableDensityScaling : 1; // 0x3bd
	char bEnableDiscardOnLoad : 1; // 0x3be
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x3c0
	int32_t VirtualTextureCullMips; // 0x3d0
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x3d4
};

struct UInterpTrackFloatMaterialParam : UInterpTrackFloatBase {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	bool bCanBlend; // 0x78
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct USourceEffectEnvelopeFollowerPreset : USoundEffectSourcePreset {
	FSourceEffectEnvelopeFollowerSettings Settings; // 0x9c
};

struct UAnimCurveCompressionSettings : UObject {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct USGToolTipWidget : UUserWidget {
	FVector2D ToolTipSize; // 0x260
	FVector2D ToolTipOffset; // 0x268
	EHorizontalAlignment HorizontalAlignment; // 0x270
	EVerticalAlignment VerticalAlignment; // 0x271
};

struct AWeatherVolumetricFog : AActor {
	UParticleSystem* VolumeFogParticle; // 0x318
	UMaterialInterface* VolumeFogMat; // 0x320
	float ParticleSize; // 0x328
	float VolumeFogIntensity; // 0x32c
	float VolumeFogDistance; // 0x330
	float VolumeFogFallOff; // 0x334
	float VolumeFogDistanceFar; // 0x338
	float VolumeFogFallOffFar; // 0x33c
	float VolumeFogFarAmount; // 0x340
	FLinearColor VolumeFogColor; // 0x344
	FLinearColor VolumeFogColor2; // 0x354
	FLinearColor VolumeFogEmissiveColor; // 0x364
	float VolumeFogScale; // 0x374
	FLinearColor VolumeFogSpeed1X; // 0x378
	float SandStormsIntensity; // 0x388
	FLinearColor SandStormsColor; // 0x38c
	float SandStormsAlpha; // 0x39c
	UParticleSystem* SandStormsParticle; // 0x3a0
	UParticleSystem* SandStormsLeafParticle; // 0x3a8
	UMaterialInterface* SandStormMat; // 0x3b0
	UMaterialInterface* SandStormLeafMat; // 0x3b8
	UMaterialInterface* SandStormLeafMat2; // 0x3c0
};

struct UWBP_KeySettingItem_C : UKeySettingItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c8
	UImage* ImgBg; // 0x2d0
};

struct UWBP_ProducerName_4_C : UUserWidget {
	UWBP_ProducerSlot_C* WBP_ProducerSlot; // 0x260
	UWBP_ProducerSlot_C* WBP_ProducerSlot_2; // 0x268
	UWBP_ProducerSlot_C* WBP_ProducerSlot_4; // 0x270
	UWBP_ProducerSlot_C* WBP_ProducerSlot_7; // 0x278
	UWBP_ProducerSlot_C* WBP_ProducerSlot_8; // 0x280
	UWBP_ProducerSlot_C* WBP_ProducerSlot_9; // 0x288
	UWBP_ProducerSlot_C* WBP_ProducerSlot_10; // 0x290
	UWBP_ProducerSlot_C* WBP_ProducerSlot_11; // 0x298
	UWBP_ProducerSplitLine_C* WBP_ProducerSplitLine; // 0x2a0
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x370
	FName PreviousMatchState; // 0x378
	int32_t ElapsedTime; // 0x380
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xb0
};

struct UN_SetPriorityPanel : UUserWidget {
	TWeakObjectPtr<UN_InventorySlot> BindItemSlot; // 0x260
	FVector2D WidgetOffset; // 0x268
	UButton* HighButton; // 0x270
	UButton* MiddleButton; // 0x278
	UButton* LowButton; // 0x280
	UButton* CleanButton; // 0x288
	TWeakObjectPtr<USGItem> BindItem; // 0x290
	TWeakObjectPtr<ASGPlayerController> PlayerController; // 0x298
	TWeakObjectPtr<ASGPlayerCharacter> PlayerCharacter; // 0x2a0
};

struct UMovieScenePrimitiveMaterialSection : UMovieSceneSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe8
};

struct UWBP_PasswordDialog_C : UUI_PasswordDialog {
	URichTextBlock* CheckBoxSelectedTextBlock; // 0x318
	UImage* Image; // 0x320
	UImage* Image_131; // 0x328
	UImage* Image_250; // 0x330
	UImage* ImgBg; // 0x338
	UImage* ImgBorder; // 0x340
	UImage* ImgNameInputBg; // 0x348
};

struct UUI_ServerParamBool : UUserWidget {
	UCheckBox* CheckBoxSelected; // 0x260
	UTextBlock* TbParamName; // 0x268
	UButton* ButtonSet; // 0x270
	FString StrParamName; // 0x278
	FString StrCommand; // 0x288
};

struct UUI_SeasonPassportReward : UUserWidget {
	UTextBlock* RewardNameText; // 0x260
	UUI_SeasonPassportRewardItem* RewardItemUp1; // 0x268
	UUI_SeasonPassportRewardItem* RewardItemUp2; // 0x270
	UUI_SeasonPassportRewardItem* RewardItemUp; // 0x278
	UUI_SeasonPassportRewardItem* RewardItemDown; // 0x280
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x80
	bool bAdditivePose; // 0x110
	int32_t BasePoseIndex; // 0x114
	FName RetargetSource; // 0x118
};

struct UPaperRuntimeSettings : UObject {
	bool bEnableSpriteAtlasGroups; // 0x28
	bool bEnableTerrainSplineEditing; // 0x29
	bool bResizeSpriteDataToMatchTextures; // 0x2a
};

struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	FProgressBarStyle ProgressBarStyle; // 0x30
};

struct UN_SlotExtraMenu : UUserWidget {
	char bRemove : 1; // 0x260
	UN_SlotExtraMenuButton* ButtonTemplate; // 0x268
	FMargin SlotListPadding; // 0x270
	TWeakObjectPtr<USGItem> BindItem; // 0x280
	EInventoryTypes BindInventoryType; // 0x288
	TWeakObjectPtr<USGInventoryComponent> BindInventory; // 0x28c
	TWeakObjectPtr<UN_InventorySlot> InventorySlot; // 0x294
	TWeakObjectPtr<USGUI> RootSGUI; // 0x29c
	UVerticalBox* MenuVetical; // 0x2a8
	FVector2D DefaultWidgetSize; // 0x2b0
	TArray<UN_SlotExtraMenuButton*> ButtonList; // 0x2b8
	UN_SlotExtraMenuButton* ShowTipRepairButton; // 0x2c8
	USGToolTipWidget* RepairTipTemplate; // 0x2d0
};

struct UNN_CraftPerkGroupSlot : UUserWidget {
	UCanvasPanel* CraftPerkGroupCanvas; // 0x260
	UImage* HighLightBg; // 0x268
	UImage* bg; // 0x270
	UImage* CircleBg; // 0x278
	UImage* icon; // 0x280
	UTextBlock* NameText; // 0x288
	UHorizontalBox* CraftPerkPanel; // 0x290
	UImage* LearnStateImage; // 0x298
	USGUI* RootUI; // 0x2a0
	USGCraftPerkGroup* BindCraftPerk; // 0x2a8
	TSoftObjectPtr<UTexture2D> TimesBg[0x8]; // 0x2b0
	TSoftObjectPtr<UTexture2D> TimesCanLearnBg[0x8]; // 0x3f0
	TSoftObjectPtr<UTexture2D> LearnStateImageTexture[0x3]; // 0x530
	UNN_CraftPerkSlot* CraftPerkSlotTemplate; // 0x5a8
	TArray<UNN_CraftPerkSlot*> CraftPerkSlotList; // 0x5b0
	char bLearned : 1; // 0x5c0
	USGToolTipWidget* ToolTipsTemplate; // 0x5c8
	char bIsMouseIn : 1; // 0x5d0
};

struct ANatureBGMVolume : AVolume {
	int32_t Priority; // 0x348
	FBGMDetailData ModifyBGM[0xa]; // 0x350
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct UDrawAndRevolveTool : UInteractiveTool {
	UCurveControlPointsMechanic* ControlPointsMechanic; // 0xf8
	UConstructionPlaneMechanic* PlaneMechanic; // 0x100
	URevolveToolProperties* Settings; // 0x108
	UNewMeshMaterialProperties* MaterialProperties; // 0x110
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0x118
};

struct UUI_ButtonBase : UUserWidget {
	FName ButtonName; // 0x260
	FName TwinkleImageName; // 0x268
	FButtonStyle ButtonStyle; // 0x270
	bool bCanClick; // 0x4e8
	UButton* BgButton; // 0x4f0
	UImage* TwinkleImage; // 0x4f8
};

struct UFormationSlot : UUserWidget {
	FName KeyName; // 0x260
	char FormationIndex; // 0x268
	UTextBlock* TbKey; // 0x270
	UImage* ImgPressedBorder; // 0x278
};

struct UNiagaraEffectType : UObject {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	UNiagaraSignificanceHandler* SignificanceHandler; // 0x30
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct USGHuangLi : UObject {
	FText YearText; // 0x28
	FText MonthText; // 0x40
	FText DayText; // 0x58
	TArray<FText> HuangLiNameText; // 0x70
	FHuangLiEffectNameDetail EffectNamesDetail[0x4]; // 0x80
	int32_t BeginYear; // 0x180
	int32_t BeginMonth; // 0x184
	int32_t BeginDay; // 0x188
	int32_t BeginHour; // 0x18c
	int32_t BeginMinute; // 0x190
	int32_t BeginSecond; // 0x194
	int32_t HuangLiDaySeconds; // 0x198
	FXingShenEffect XingShenEffects[0xc]; // 0x1a0
	FJianChuEffect JianChuEffects[0xc]; // 0x560
	FXingXiuEffect XingXiuEffects[0x1c]; // 0x920
	UDataTable* HuangLiDataTable; // 0x11e0
};

struct ABP_LightningEffect_FarThunderbolt_C : ABP_LightningEffect_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x6a8
	USoundBase* StrikeSound; // 0x6b0
	USoundBase* GrowthSoundFar; // 0x6b8
};

struct UWBP_ProducerList_C : UUI_ProducerList {
	UWidgetAnimation* RotateMirror; // 0xf70
	UImage* BottomBlack; // 0xf78
	UImage* HeadBlack; // 0xf80
	UImage* Image_Bg; // 0xf88
	UImage* ImageLogo; // 0xf90
	UImage* ImageLogoBg; // 0xf98
	UImage* ImageLogoBg_Texture; // 0xfa0
	UImage* ImageSpark; // 0xfa8
	UImage* ImageSwordFire; // 0xfb0
	UImage* ImageWenZiEffect; // 0xfb8
	UImage* OrnaLeft; // 0xfc0
	UWBP_ProducerName_C* WBP_ProducerName; // 0xfc8
	UWBP_ProducerName_2_C* WBP_ProducerName_3; // 0xfd0
	UWBP_ProducerName_3_C* WBP_ProducerName_4; // 0xfd8
	UWBP_ProducerName_4_C* WBP_ProducerName_5; // 0xfe0
	UWBP_ProducerName_5_C* WBP_ProducerName_6; // 0xfe8
	UWBP_ProducerName_6_C* WBP_ProducerName_7; // 0xff0
	UWBP_ProducerName_7_C* WBP_ProducerName_8; // 0xff8
};

struct UGameplayCueSet : UDataAsset {
	TArray<FGameplayCueNotifyData> GameplayCueData; // 0x30
};

struct UUI_Setting : USGUI {
	UUI_SystemSetting* SystemSettingUI; // 0x2d8
	UUI_KeySetting* KeySettingUI; // 0x2e0
	UButton* BtnReleaseKey; // 0x2e8
	UButton* BtnConfirm; // 0x2f0
	UButton* BtnSetToDefault; // 0x2f8
	UTextBlock* TbSetToDefault; // 0x300
	UButton* BtnClose; // 0x308
	UButton* BtnCancel; // 0x310
	int32_t CurSettingRadioIndex; // 0x318
	FVector2D MousePosition; // 0x31c
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x198
	TArray<FString> ActorGuidStrings; // 0x218
};

struct AFishManagerVolume : AVolume {
	TArray<AFlockFish*> FlockTypes; // 0x348
	TArray<float> NumInFlock; // 0x358
	float OptimizationCheckTime; // 0x368
	float OptimizationDistance; // 0x36c
	float HideResetTime; // 0x374
	bool DebugShowArea; // 0x378
	bool DebugFishMove; // 0x379
	USGExploitComponent* DeathExploitComponentTemplate; // 0x380
};

struct UDeformMeshPolygonsTool : UMeshSurfacePointTool {
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0xc8
	UDeformMeshPolygonsTransformProperties* TransformProps; // 0xd0
};

struct ASGStructureBasement : ASGStructure {
	FSlateBrush SameTeamBasementBrush; // 0xb98
	TSoftObjectPtr<UTexture2D> SameTeamBasementTexture; // 0xc20
	FLinearColor SameTeamBasementColor; // 0xc48
	FSlateBrush DiffTeamBasementBrush; // 0xc58
	TSoftObjectPtr<UTexture2D> DiffTeamBasementTexture; // 0xce0
	FLinearColor DiffTeamBasementColor; // 0xd08
	FSlateBrush SameTeamLockBasementBrush; // 0xd18
	TSoftObjectPtr<UTexture2D> SameTeamLockBasementTexture; // 0xda0
	FLinearColor SameTeamLockBasementColor; // 0xdc8
	FSlateBrush DiffTeamLockBasementBrush; // 0xdd8
	TSoftObjectPtr<UTexture2D> DiffTeamLockBasementTexture; // 0xe60
	FLinearColor DiffTeamLockBasementColor; // 0xe88
	FSlateBrush AttackTeamBrush; // 0xe98
	TSoftObjectPtr<UTexture2D> AttackTeamTexture; // 0xf20
	FLinearColor AttackTeamColor; // 0xf48
	FSlateBrush DefenseTeamBrush; // 0xf58
	TSoftObjectPtr<UTexture2D> DefenseTeamTexture; // 0xfe0
	FLinearColor DefenseTeamColor; // 0x1008
	FSlateBrush NoTeamBrush; // 0x1018
	TSoftObjectPtr<UTexture2D> NoTeamTexture; // 0x10a0
	FLinearColor NoTeamColor; // 0x10c8
	UUserWidget* TitleWidget; // 0x10d8
	float PerpareTime; // 0x10e0
	float PlayTime; // 0x10e4
	float FailedLeaveTime; // 0x10e8
	float SuccessLeaveTime; // 0x10ec
	float FinishTime; // 0x10f0
	TArray<FBattleAwardItem> SuccessAward; // 0x10f8
	TArray<FBattleAwardItem> FailedAward; // 0x1108
	TArray<AActor*> DefenseGuildActors; // 0x1128
	TArray<AActor*> AttackGuildActors; // 0x1138
	TArray<AActor*> LogicServerLevelEffectActors; // 0x1148
	FMulticastInlineDelegate OnCurrentStageChanged; // 0x1190
	float BattleGroundMusicCheckTime; // 0x11a8
	float BattleGroundMusicTimeThreshold; // 0x11ac
	TArray<FBasementPhaseData> HpPhaseData; // 0x11b0
	UParticleSystemComponent* HpPhaseParticleComponent; // 0x11c0
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct UUI_BattleGroup : USGUI {
	TSoftObjectPtr<UTexture2D> tex_win_bg; // 0x2d8
	TSoftObjectPtr<UTexture2D> tex_win_huawen; // 0x300
	TSoftObjectPtr<UTexture2D> tex_win_guanxiao; // 0x328
	TSoftObjectPtr<UTexture2D> tex_win_text_zh; // 0x350
	TSoftObjectPtr<UTexture2D> tex_win_text_en; // 0x378
	TSoftObjectPtr<UTexture2D> tex_fail_bg; // 0x3a0
	TSoftObjectPtr<UTexture2D> tex_fail_huawen; // 0x3c8
	TSoftObjectPtr<UTexture2D> tex_fail_guanxiao; // 0x3f0
	TSoftObjectPtr<UTexture2D> tex_fail_text_zh; // 0x418
	TSoftObjectPtr<UTexture2D> tex_fail_text_en; // 0x440
	UImage* Img_Bg; // 0x468
	UImage* Img_HuaWen; // 0x470
	UImage* Img_GuanXiao; // 0x478
	UImage* Img_ResultText; // 0x480
	int32_t CurrentCountDownTimeInt; // 0x488
	bool bShowRespawn; // 0x48c
	TArray<FSpawnLocationInfo> SpawnLocationInfos; // 0x490
	float GetSpawnLocationInterval; // 0x4a0
	EBattleGamePlayType BattleGamePlayType; // 0x4b0
	TArray<FPlayerBattleData> PlayerBattleDatas; // 0x4b8
	bool bBattleFinished; // 0x4c8
	bool bMySuccess; // 0x4c9
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UWidgetNavigation : UObject {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x4c
	FWidgetNavigationData Left; // 0x70
	FWidgetNavigationData Right; // 0x94
	FWidgetNavigationData Next; // 0xb8
	FWidgetNavigationData Previous; // 0xdc
};

struct ASGStructureFunctionFacelift : ASGStructureFunctionTable {
	TSoftObjectPtr<UTexture2D> ThumbnailTexture; // 0xf80
};

struct UARTrackableNotifyComponent : UActorComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xe0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0x100
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x110
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x120
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x130
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x140
	FMulticastInlineDelegate OnAddTrackedImage; // 0x150
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x160
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x170
	FMulticastInlineDelegate OnAddTrackedFace; // 0x180
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x190
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x1a0
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1d0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1f0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x200
};

struct UGuildAuthoritySlot : USGUI {
	UTextBlock* OperateAuthTypeText; // 0x2d8
	UGuildAuthorityComboBox* OperateAuthComboBox; // 0x2e0
	UDataButton* TipsDataButton; // 0x2e8
	USGToolTipWidget* ButtonTipWidgetTemplate; // 0x2f0
	UUI_GenericConfirmationDialog* ConfirmSubmitUIOverride; // 0x2f8
};

struct UGenericMultiItemSlot : UUserWidget {
	UImage* ImgIcon; // 0x260
	UTextBlock* AmountText; // 0x268
	TWeakObjectPtr<USGInventoryComponent> BindCheckInventory; // 0x270
	TWeakObjectPtr<USGItem> BindItem; // 0x278
	float SlotWidth; // 0x280
	float SlotHeight; // 0x284
	USizeBox* SlotSizeBox; // 0x288
	UButton* AddButton; // 0x290
	UButton* ReduceButton; // 0x298
	UEditableText* OperationAmountText; // 0x2a0
	int32_t MaxAmount; // 0x2a8
	int32_t CurrentAmount; // 0x2ac
	int32_t AllowAddMaxAmount; // 0x2b0
	int32_t FontSize; // 0x2b4
	UUI_GenericMultiItemDialog* ParnetUI; // 0x2b8
};

struct UNavMovementComponent : UMovementComponent {
	FNavAgentProperties NavAgentProps; // 0x100
	float FixedPathBrakingDistance; // 0x130
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x134
	char bUseAccelerationForPaths : 1; // 0x134
	char bUseFixedBrakingDistanceForPaths : 1; // 0x134
	FMovementProperties MovementState; // 0x135
	UObject* PathFollowingComp; // 0x138
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x310
};

struct UViewAlignedSculptBrushOpProps : UMeshSculptBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0x88
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xc8
	UEnum* StateEnum; // 0xe8
	AActor* SharingActor; // 0xf0
};

struct UMaterialExpressionMultiply : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UAbilityTask_WaitGameplayEffectStackChange : UAbilityTask {
	FMulticastInlineDelegate OnChange; // 0x80
	FMulticastInlineDelegate InvalidHandle; // 0x90
};

struct UResonanceAudioReverbPluginPreset : USoundEffectSubmixPreset {
	FResonanceAudioReverbPluginSettings Settings; // 0xe0
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct ASGStructureFunctionCraft : ASGStructureFunctionTable {
	TSoftObjectPtr<UTexture2D> ThumbnailTexture; // 0xf80
};

struct ULandscapeSplineControlPoint : UObject {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	float Width; // 0x40
	float LayerWidthRatio; // 0x44
	float SideFalloff; // 0x48
	float LeftSideFalloffFactor; // 0x4c
	float RightSideFalloffFactor; // 0x50
	float LeftSideLayerFalloffFactor; // 0x54
	float RightSideLayerFalloffFactor; // 0x58
	float EndFalloff; // 0x5c
	TArray<FLandscapeSplineConnection> ConnectedSegments; // 0x60
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	UControlPointMeshComponent* LocalMeshComponent; // 0xa0
};

struct UN_InventoryPanel : UUserWidget {
	UBorder* InventoryExchangeBorder; // 0x260
	EInventoryTypes BindInventoryType; // 0x268
	TWeakObjectPtr<USGInventoryComponent> BindInventoryComponent; // 0x26c
	TArray<UN_InventorySlot*> InventorySlotList; // 0x278
	USGUI* ParentSGUI; // 0x288
	USGUI* RootSGUI; // 0x290
	char bSlotAllowDrag : 1; // 0x298
	char bRemote : 1; // 0x298
	EInventoryPanelBgType InventoryPanelBgType; // 0x299
	UImage* BottomBg; // 0x2a0
	UUniformGridPanel* InventoryGrid; // 0x2a8
	UInventoryFunctionButton* ArrangeButton; // 0x2b0
	UInventoryFunctionButton* SwitchButton; // 0x2b8
	UInventoryFunctionButton* DropAllButton; // 0x2c0
	UInventoryFunctionButton* DropButton; // 0x2c8
	UInventoryFunctionButton* ShowWeightButton; // 0x2d0
	UInventoryItemTypeFilterSlot* ConsumeTypeSlot; // 0x2d8
	UInventoryItemTypeFilterSlot* EquipTypeSlot; // 0x2e0
	UInventoryItemTypeFilterSlot* WeaponTypeSlot; // 0x2e8
	UInventoryItemTypeFilterSlot* AmmoTypeSlot; // 0x2f0
	UInventoryItemTypeFilterSlot* StructureTypeSlot; // 0x2f8
	UInventoryItemTypeFilterSlot* ResourceTypeSlot; // 0x300
	UInventoryItemTypeFilterSlot* SearchTypeSlot; // 0x308
	UEditableTextBox* SearchEditBox; // 0x310
	UCanvasPanel* FilterPanel; // 0x318
	UHorizontalBox* PanelButtonPanel; // 0x320
	UCanvasPanel* TitlePanel; // 0x328
	UTextBlock* TitleText; // 0x330
	UImage* TitleImage; // 0x338
	UCanvasPanel* WeightCanvas; // 0x340
	UTextBlock* WeightText; // 0x348
	UCanvasPanel* SlotNumCanvas; // 0x350
	UTextBlock* SlotNumText; // 0x358
	FSlateBrush AboveTitleImageBrush; // 0x360
	FText RemoteTitleText; // 0x3e8
	FText GeneralTitleText; // 0x400
	FText HorseTitleText; // 0x418
	FText CrossServerTitleText; // 0x430
	FText BattleTitleText; // 0x448
	int32_t UnLockNum; // 0x460
	FVector2D FilterPanelAbovePos; // 0x464
	char bDisplayHelpPanel : 1; // 0x46c
	char bNeedRefreshSlotNum : 1; // 0x480
	FString SearchString; // 0x488
	UInventoryItemTypeFilterSlot* CurrentActiveFilterSlot; // 0x498
	char bForceShowDefaultNum : 1; // 0x4a0
	TWeakObjectPtr<USGItem> RecordTransportItem; // 0x4a4
	TWeakObjectPtr<USGInventoryComponent> RecordTransportItemInventoy; // 0x4ac
	EInventoryTypes RecordTransportItemInventoyType; // 0x4b4
	char bRecordShift : 1; // 0x4b5
	char bRecordCtrl : 1; // 0x4b5
	char bNeedShowFuelGuide : 1; // 0x4b5
	int32_t CountsPerRow; // 0x4b8
	int32_t CurrentInventoryNum; // 0x4bc
	int32_t TickUpdateSlotNumber; // 0x4c0
	int32_t LastInventoryItemNum; // 0x4c4
	int32_t DefaultShowInventoryNum; // 0x4cc
	UN_InventorySlot* InventorySlotClass; // 0x4d0
	FName HelpPanelName; // 0x4d8
	UHorizontalBox* HelpPanel; // 0x4e0
	FName QuickHelpPanelName; // 0x4e8
	UN_QuickHelpPanel* QuickHelpPanel; // 0x4f0
	UQuickHelpSlot* QuickHelpSlotTemplate; // 0x4f8
};

struct UAbilityTask_ApplyRootMotion_Base : UAbilityTask {
	FName ForceName; // 0x84
	ERootMotionFinishVelocityMode FinishVelocityMode; // 0x8c
	FVector FinishSetVelocity; // 0x90
	float FinishClampVelocity; // 0x9c
	UCharacterMovementComponent* MovementComponent; // 0xa0
};

struct UClothPhysicalMeshDataNv_Legacy : UClothPhysicalMeshDataBase_Legacy {
	TArray<float> MaxDistances; // 0xe0
	TArray<float> BackstopDistances; // 0xf0
	TArray<float> BackstopRadiuses; // 0x100
	TArray<float> AnimDriveMultipliers; // 0x110
};

struct UParticleSystemComponent : UFXSystemComponent {
	UParticleSystem* Template; // 0x488
	TArray<UMaterialInterface*> EmitterMaterials; // 0x490
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x4a0
	char bResetOnDetach : 1; // 0x4b1
	char bUpdateOnDedicatedServer : 1; // 0x4b1
	char bAllowRecycling : 1; // 0x4b1
	char bAutoManageAttachment : 1; // 0x4b1
	char bAutoAttachWeldSimulatedBodies : 1; // 0x4b1
	char bWarmingUp : 1; // 0x4b2
	char bOverrideLODMethod : 1; // 0x4b2
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x4b2
	ParticleSystemLODMethod LODMethod; // 0x4bd
	EParticleSignificanceLevel RequiredSignificance; // 0x4be
	TArray<FParticleSysParam> InstanceParameters; // 0x4c0
	FMulticastInlineDelegate OnParticleSpawn; // 0x4d0
	FMulticastInlineDelegate OnParticleBurst; // 0x4e0
	FMulticastInlineDelegate OnParticleDeath; // 0x4f0
	FMulticastInlineDelegate OnParticleCollide; // 0x500
	bool bOldPositionValid; // 0x510
	FVector OldPosition; // 0x514
	FVector PartSysVelocity; // 0x520
	float WarmupTime; // 0x52c
	float WarmupTickRate; // 0x530
	float SecondsBeforeInactive; // 0x538
	float MaxTimeBeforeForceUpdateTransform; // 0x540
	TArray<UParticleSystemReplay*> ReplayClips; // 0x568
	float CustomTimeDilation; // 0x580
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x5d8
	FName AutoAttachSocketName; // 0x5e0
	EAttachmentRule AutoAttachLocationRule; // 0x5e8
	EAttachmentRule AutoAttachRotationRule; // 0x5e9
	EAttachmentRule AutoAttachScaleRule; // 0x5ea
	FMulticastInlineDelegate OnSystemFinished; // 0x618
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct ABP_HorseMC_Login_Base_C : ACharacter {
	FPointerToUberGraphFrame UberGraphFrame; // 0x5d0
	USkeletalMeshComponent* Armor; // 0x5d8
	UStaticMeshComponent* Weapon; // 0x5e0
	USkeletalMeshComponent* Ponytail; // 0x5e8
	USkeletalMeshComponent* Bristle; // 0x5f0
	USkeletalMeshComponent* Saddle; // 0x5f8
	USkeletalMeshComponent* Cuish; // 0x600
	USkeletalMeshComponent* Chest; // 0x608
	USkeletalMeshComponent* Helmet; // 0x610
	USkeletalMeshComponent* Human; // 0x618
	UABP_MenuCharacter_C* MenuCharacterAnimInstance; // 0x620
	UABP_MenuHorse_C* MenuHorseAnimInstance; // 0x628
	UAnimSequence* HumanAnimation; // 0x630
	UAnimSequence* HorseAnimation; // 0x638
	bool Left Reins Enabled; // 0x640
	bool Right Reins Enabled; // 0x641
};

struct URemoveOccludedTrianglesOperatorFactory : UObject {
	URemoveOccludedTrianglesTool* Tool; // 0x30
};

struct UGuildQuestObjectSlot : USGUI {
	UImage* BGImage; // 0x2d8
	UTextBlock* QuestObjectNameText; // 0x2e0
	UTextBlock* QuestObjectDescText; // 0x2e8
	TSoftObjectPtr<UTexture2D> NormalTexture; // 0x2f0
	TSoftObjectPtr<UTexture2D> CompleteTexture; // 0x318
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x310
};

struct UPhononSourceComponent : USceneComponent {
	float BakingRadius; // 0x208
	FName UniqueIdentifier; // 0x20c
};

struct USGPerkToolTipWidget : USGToolTipWidget {
	USGCraftRequirementEntry* CraftRequirementEntry; // 0x288
	TWeakObjectPtr<UPerkSlot> BindPerkSlot; // 0x290
	TWeakObjectPtr<ASGCharacter> BindCharacter; // 0x298
	UCanvasPanel* MainCanvas; // 0x2a0
	UTextBlock* TbPerkName; // 0x2a8
	UTextBlock* TbPerkDescription; // 0x2b0
	UTextBlock* TbNeedCharacterLevel; // 0x2b8
	UTextBlock* TbSmallSkill; // 0x2c0
	UTextBlock* TbNeedSkillLevel; // 0x2c8
	UTextBlock* TbNeedPoint; // 0x2d0
	UTextBlock* TbNeedCapital; // 0x2d8
	UTextBlock* TbNeedPerk; // 0x2e0
	UVerticalBox* RequireVertical; // 0x2e8
	UVerticalBox* CraftRequirementsList; // 0x2f0
	UCanvasPanel* RequireCharacterLevelCanvas; // 0x2f8
	UCanvasPanel* RequireSmallSkillCanvas; // 0x300
	UCanvasPanel* RequireSkillLevelCanvas; // 0x308
	UCanvasPanel* RequirePerkCanvas; // 0x310
	UCanvasPanel* RequirePointCanvas; // 0x318
	UCanvasPanel* RequireCapitalCanvas; // 0x320
	UHorizontalBox* RequireItemCanvas; // 0x328
	UCanvasPanel* RequireMultiCompulsorySkillCanvas; // 0x330
	UCanvasPanel* RequireMultiElectiveSkillCanvas; // 0x338
	UTextBlock* NeedCharacterLevelText; // 0x340
	UTextBlock* NeedSmallSkillText; // 0x348
	UTextBlock* NeedSkillLevelText; // 0x350
	UTextBlock* NeedPerkText; // 0x358
	UTextBlock* NeedItemsText; // 0x360
	UTextBlock* NeedPointText; // 0x368
	UTextBlock* NeedCapitalText; // 0x370
	UTextBlock* RequireMultiCompulsorySkillText; // 0x378
	UTextBlock* RequireMultiElectiveSkillText; // 0x380
	UVerticalBox* CompulsorySkillVertical; // 0x388
	UVerticalBox* ElectiveSkillVertical; // 0x390
	USGPerkTipMultiSkillText* PerkTipMultiSkillTemplate; // 0x398
	FSPSmallSkillText SmallSkillText[0x5]; // 0x3a0
	FLinearColor EnoughColor; // 0x3f0
	FLinearColor NotEnoughColor; // 0x400
	FText SavedLearnPerkItemEnoughText; // 0x410
	int32_t PerkLevel; // 0x428
	float ToolTipsDescriptionTextWrapDelta; // 0x42c
};

struct ULevelSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x68
	FLevelSequenceObjectReferenceMap ObjectReferences; // 0x70
	FLevelSequenceBindingReferences BindingReferences; // 0xc0
	TMap<FString, FLevelSequenceObject> PossessedObjects; // 0x160
	UObject* DirectorClass; // 0x1b0
	TArray<UAssetUserData*> AssetUserData; // 0x1b8
};

struct USGGameDataJueWei : UObject {
	TMap<int32_t, FJueWeiConfig> AllJueWei; // 0x28
	float RenownExpAdd[0xd]; // 0x78
	TArray<FText> JueWeiPropTip; // 0xb0
};

struct UPanelSlot : UVisual {
	UPanelWidget* Parent; // 0x28
	UWidget* Content; // 0x30
};

struct UJueWeiPropSlot : USGUI {
	UImage* IconImage; // 0x2d8
	UTextBlock* PropText; // 0x2e0
	USGToolTipWidget* TipWidgetTemplate; // 0x2e8
	FText TipText; // 0x2f0
};

struct ULandscapeSplineSegment : UObject {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct UUI_NPCTalkSlot : UUserWidget {
	char bLeftMouseButtonDown : 1; // 0x260
	char bCanNotPress : 1; // 0x260
	UBorder* bg; // 0x268
	UImage* NPCQuestionImage; // 0x270
	UTextBlock* NPCQuestionText; // 0x278
	TSoftObjectPtr<UTexture2D> BGUnSelected; // 0x280
	TSoftObjectPtr<UTexture2D> BGSelected; // 0x2a8
	FLinearColor TextCanNotPressColor; // 0x2d0
	FLinearColor TextWarningColor; // 0x2e0
	FLinearColor TextErrorColor; // 0x2f0
	char IsHover : 1; // 0x300
	char bPressed : 1; // 0x300
	USGUI* RootSGUI; // 0x308
	TWeakObjectPtr<ASGGeneralCharacter> BindGeneralCharacter; // 0x310
	FNPCTalkInfo BindTalkInfo; // 0x318
	int32_t BindTalkID; // 0x388
};

struct UAsyncTaskDownloadImage : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct UNiagaraComponent : UFXSystemComponent {
	UNiagaraSystem* Asset; // 0x488
	ENiagaraTickBehavior TickBehavior; // 0x490
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x498
	char bForceSolo : 1; // 0x560
	char bEnableGpuComputeDebug : 1; // 0x560
	char bAutoDestroy : 1; // 0x58c
	char bRenderingEnabled : 1; // 0x58c
	char bAutoManageAttachment : 1; // 0x58c
	char bAutoAttachWeldSimulatedBodies : 1; // 0x58c
	float MaxTimeBeforeForceUpdateTransform; // 0x590
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x598
	FMulticastInlineDelegate OnSystemFinished; // 0x5b0
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x5c0
	FName AutoAttachSocketName; // 0x5c8
	EAttachmentRule AutoAttachLocationRule; // 0x5d0
	EAttachmentRule AutoAttachRotationRule; // 0x5d1
	EAttachmentRule AutoAttachScaleRule; // 0x5d2
};

struct UUI_StructureOccupyBuffPanel : UUserWidget {
	TWeakObjectPtr<ASGStructureOccupy> RemoteActor; // 0x260
	USGUI* RootSGUI; // 0x268
	UVerticalBox* ProtectBox; // 0x270
	UUI_StructureOccupyBuffSlot* OccupyBuffSlotClass; // 0x278
};

struct USynthComponentMoto : USynthComponent {
	UMotoSynthPreset* MotoSynthPreset; // 0x6d0
	float RPM; // 0x6d8
};

struct UVehicleAttributePanel : UUserWidget {
	UTextBlock* HPText; // 0x260
	UTextBlock* StunText; // 0x268
	UTextBlock* SPText; // 0x270
	UTextBlock* MaxSpeedText; // 0x278
	UTextBlock* OperateText; // 0x280
	UTextBlock* HungryText; // 0x288
	UTextBlock* WeightText; // 0x290
	UTextBlock* HealthText; // 0x298
	UTextBlock* ImpactText; // 0x2a0
	UTextBlock* LifeCountText; // 0x2a8
	UTextBlock* SlashArmorText; // 0x2b0
	UTextBlock* PierceArmorText; // 0x2b8
	UTextBlock* CrushArmorText; // 0x2c0
	UTextBlock* SiegeArmorText; // 0x2c8
	TWeakObjectPtr<ASG_AnimalVehicleCharacter> BindVehicleCharacter; // 0x2d0
};

struct UGroupEdgeInsertionProperties : UInteractiveToolPropertySet {
	EGroupEdgeInsertionMode InsertionMode; // 0x60
	bool bWireframe; // 0x64
	double VertexTolerance; // 0x68
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UGuildMemberListPanel : USGUI {
	UButton* LeaveGuildButton; // 0x2d8
	UButton* GuildGroupButton; // 0x2e0
	UButton* GuildSkillButton; // 0x2e8
	UButton* GuildTechButton; // 0x2f0
	UButton* ZhanLingButton; // 0x2f8
	UButton* KPIManagementButton; // 0x300
	UDataButton* PrePageDataButton; // 0x308
	UDataButton* NextPageDataButton; // 0x310
	UTextBlock* ShowPageText; // 0x318
	UCanvasPanel* MemberListPanel; // 0x320
	USortableTitleSlot* PlayerNameTitleSlot; // 0x328
	USortableTitleSlot* PlayerLevelTitleSlot; // 0x330
	USortableTitleSlot* MemberLevelTitleSlot; // 0x338
	USortableTitleSlot* GongXunTitleSlot; // 0x340
	USortableTitleSlot* OfficialJobTitleSlot; // 0x348
	USortableTitleSlot* MemberGroupTitleSlot; // 0x350
	USortableTitleSlot* DKPTitleSlot; // 0x358
	USortableTitleSlot* OnlineStateTitleSlot; // 0x360
	USortableTitleSlot* ManagementTitleSlot; // 0x368
	int32_t GuildMemberNumPerPage; // 0x370
	FVector2D MemberSlotSize; // 0x374
	UGuildMemberSlot* GuildMemberSlotClass; // 0x380
	UUI_ApplyGuildConfirm* ConfirmLeaveGuildUIOverride; // 0x388
	UUI_GenericConfirmationDialog* ConfirmKickOutUIOverride; // 0x390
	UUI_GenericConfirmationDialog* ConfirmChangeOwnerUIOverride; // 0x398
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct USGAudioComponent : UAudioComponent {
	float OverrideStartTime; // 0x878
	float FadeInDuration; // 0x87c
	float FadeInVolumeLevel; // 0x880
	float FadeOutDuration; // 0x884
	float FadeOutVolumeLevel; // 0x888
	EAudioFaderCurve FadeCurve; // 0x88c
	float CurrentPlaybackTime; // 0x890
	TWeakObjectPtr<USoundCue> SGSynthSoundCue; // 0x894
};

struct UUI_RadioButtonView : UUserWidget {
	TMap<FString, UUI_RadioButton*> RadioButtonMap; // 0x260
	FMulticastInlineDelegate OnRadioButtonViewButtonPressed; // 0x2b0
	FMulticastInlineDelegate OnRadioButtonViewButtonReleased; // 0x2c0
	int32_t DefaultActiveIndex; // 0x2d0
	UUI_RadioButton* ActiveRadioButton; // 0x2d8
	UPanelWidget* RadioButtonPanel; // 0x2e0
};

struct UWBP_OverallScalabilityLevelSliderView_C : USystemSettingItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368
	UTextBlock* Custom; // 0x370
	UTextBlock* Epic; // 0x378
	UTextBlock* Excellent; // 0x380
	UTextBlock* High; // 0x388
	UImage* ImgScrollBg; // 0x390
	UTextBlock* Low; // 0x398
	UTextBlock* Medium; // 0x3a0
	UImage* Point1; // 0x3a8
	UImage* Point2; // 0x3b0
	UImage* Point3; // 0x3b8
	UImage* Point4; // 0x3c0
	UImage* Point5; // 0x3c8
	UImage* Point6; // 0x3d0
	USlider* Slider; // 0x3d8
	int32_t SelectIndex; // 0x3e0
	FMulticastInlineDelegate OnSelectIndexChanged; // 0x3e8
};

struct UParticleModuleColor : UParticleModuleColorBase {
	FRawDistributionVector StartColor; // 0x30
	FRawDistributionFloat StartAlpha; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct USphereComponent : UShapeComponent {
	float SphereRadius; // 0x4a0
};

struct UNiagaraDataInterfaceArrayBool : UNiagaraDataInterfaceArray {
	TArray<bool> BoolData; // 0x50
};

struct UAREnvironmentProbeComponent : UARComponent {
	FAREnvironmentProbeUpdatePayload ReplicatedPayload; // 0x290
};

struct USubmixEffectStereoDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct USimpleItemSlot : UUserWidget {
	UImage* ImgIcon; // 0x260
	UBorder* OutBorder; // 0x268
	FLinearColor UnactivedColor; // 0x270
	FSlateBrush OutBorder_Normal; // 0x280
	FSlateBrush OutBorder_Hover; // 0x308
	FSlateBrush Active_Brush; // 0x390
	char IsHover : 1; // 0x418
	USGUI* RootSGUI; // 0x420
	USGUI* ParentUI; // 0x428
	char bActived : 1; // 0x430
	int32_t iLeftDays; // 0x434
	float iTotalDays; // 0x438
	USGItem* BindItemClass; // 0x440
	USGToolTipWidget* ToolTipsTemplate; // 0x448
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterialMask* PhysMaterialMask; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	FScalarMaterialInput Metallic; // 0xd8
	FScalarMaterialInput Specular; // 0xec
	FScalarMaterialInput Anisotropy; // 0x100
	FVectorMaterialInput Normal; // 0x114
	FVectorMaterialInput Tangent; // 0x128
	FColorMaterialInput EmissiveColor; // 0x13c
	EMaterialDomain MaterialDomain; // 0x150
	EBlendMode BlendMode; // 0x151
	EDecalBlendMode DecalBlendMode; // 0x152
	EMaterialDecalResponse MaterialDecalResponse; // 0x153
	EMaterialShadingModel ShadingModel; // 0x154
	char bCastDynamicShadowAsMasked : 1; // 0x155
	FMaterialShadingModelField ShadingModels; // 0x156
	float OpacityMaskClipValue; // 0x158
	int32_t MaterialObjectFlag; // 0x15c
	FVectorMaterialInput WorldPositionOffset; // 0x160
	FScalarMaterialInput Refraction; // 0x174
	FMaterialAttributesInput MaterialAttributes; // 0x188
	FScalarMaterialInput PixelDepthOffset; // 0x1a0
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b4
	char bEnableSeparateTranslucency : 1; // 0x1c8
	char bEnableResponsiveAA : 1; // 0x1c8
	char bScreenSpaceReflections : 1; // 0x1c8
	char bContactShadows : 1; // 0x1c8
	char TwoSided : 1; // 0x1c8
	char DitheredLODTransition : 1; // 0x1c8
	char DitherOpacityMask : 1; // 0x1c8
	char bAllowNegativeEmissiveColor : 1; // 0x1c8
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1c9
	char bEnableMobileSeparateTranslucency : 1; // 0x1ca
	int32_t NumCustomizedUVs; // 0x1cc
	float TranslucencyDirectionalLightingIntensity; // 0x1d0
	float TranslucentShadowDensityScale; // 0x1d4
	float TranslucentSelfShadowDensityScale; // 0x1d8
	float TranslucentSelfShadowSecondDensityScale; // 0x1dc
	float TranslucentSelfShadowSecondOpacity; // 0x1e0
	float TranslucentBackscatteringExponent; // 0x1e4
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1e8
	float TranslucentShadowStartOffset; // 0x1f8
	char bDisableDepthTest : 1; // 0x1fc
	char bWriteOnlyAlpha : 1; // 0x1fc
	char bGenerateSphericalParticleNormals : 1; // 0x1fc
	char bTangentSpaceNormal : 1; // 0x1fc
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x1fc
	char bBlockGI : 1; // 0x1fc
	char bUsedAsSpecialEngineMaterial : 1; // 0x1fc
	char bUsedWithSkeletalMesh : 1; // 0x1fc
	char bUsedWithEditorCompositing : 1; // 0x1fd
	char bUsedWithParticleSprites : 1; // 0x1fd
	char bUsedWithBeamTrails : 1; // 0x1fd
	char bUsedWithMeshParticles : 1; // 0x1fd
	char bUsedWithNiagaraSprites : 1; // 0x1fd
	char bUsedWithNiagaraRibbons : 1; // 0x1fd
	char bUsedWithNiagaraMeshParticles : 1; // 0x1fd
	char bUsedWithGeometryCache : 1; // 0x1fd
	char bUsedWithStaticLighting : 1; // 0x1fe
	char bUsedWithMorphTargets : 1; // 0x1fe
	char bUsedWithSplineMeshes : 1; // 0x1fe
	char bUsedWithInstancedStaticMeshes : 1; // 0x1fe
	char bUsedWithGeometryCollections : 1; // 0x1fe
	char bUsesDistortion : 1; // 0x1fe
	char bUsedWithClothing : 1; // 0x1fe
	char bUsedWithWater : 1; // 0x200
	char bUsedWithHairStrands : 1; // 0x200
	char bUsedWithLidarPointCloud : 1; // 0x200
	char bUsedWithVirtualHeightfieldMesh : 1; // 0x200
	char bUsedWithUI : 1; // 0x204
	char bAutomaticallySetUsageInEditor : 1; // 0x204
	char bFullyRough : 1; // 0x204
	char bUseFullPrecision : 1; // 0x204
	char bUseLightmapDirectionality : 1; // 0x204
	char bUseAlphaToCoverage : 1; // 0x204
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x208
	char bUseHQForwardReflections : 1; // 0x20c
	char bUsePlanarForwardReflections : 1; // 0x20c
	char bNormalCurvatureToRoughness : 1; // 0x20c
	EMaterialTessellationMode D3D11TessellationMode; // 0x20d
	char bEnableCrackFreeDisplacement : 1; // 0x20e
	char bEnableAdaptiveTessellation : 1; // 0x20e
	char AllowTranslucentCustomDepthWrites : 1; // 0x20e
	char AllowTranslucentOcclusionPassWrites : 1; // 0x20e
	char Wireframe : 1; // 0x20e
	EMaterialShadingRate ShadingRate; // 0x20f
	char bCanMaskedBeAssumedOpaque : 1; // 0x210
	char bIsMasked : 1; // 0x210
	char bIsPreviewMaterial : 1; // 0x210
	char bIsFunctionPreviewMaterial : 1; // 0x210
	char bUseMaterialAttributes : 1; // 0x210
	char bCastRayTracedShadows : 1; // 0x210
	char bUseTranslucencyVertexFog : 1; // 0x210
	char bApplyCloudFogging : 1; // 0x210
	char bIsSky : 1; // 0x211
	char bComputeFogPerPixel : 1; // 0x211
	char bOutputTranslucentVelocity : 1; // 0x211
	char bAllowDevelopmentShaderCompile : 1; // 0x211
	char bIsMaterialEditorStatsMaterial : 1; // 0x211
	EBlendableLocation BlendableLocation; // 0x212
	char BlendableOutputAlpha : 1; // 0x213
	char bEnableStencilTest : 1; // 0x213
	EMaterialStencilCompare StencilCompare; // 0x214
	char StencilRefValue; // 0x215
	ERefractionMode RefractionMode; // 0x216
	int32_t BlendablePriority; // 0x218
	char bIsBlendable : 1; // 0x21c
	uint32_t UsageFlagWarnings; // 0x220
	float RefractionDepthBias; // 0x224
	FGuid StateId; // 0x228
	float MaxDisplacement; // 0x238
	FMaterialCachedExpressionData CachedExpressionData; // 0x270
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1a0
};

struct ATestPlayerCharacterData : AActor {
	TArray<FBattleSoliderInfo> BattleSoliderInfos; // 0x310
};

struct UInputRouter : UObject {
	bool bAutoInvalidateOnHover; // 0x28
	bool bAutoInvalidateOnCapture; // 0x29
	UInputBehaviorSet* ActiveInputBehaviors; // 0x38
};

struct UUI_VehicleGenealogy : USGUI {
	int32_t OriginColumn; // 0x2d8
	int32_t OriginRows; // 0x2dc
	float SlotLength; // 0x2e0
	float SlotWidth; // 0x2e4
	UVehicleGenealogySlot* GenealogySlotTemplate; // 0x2e8
	TArray<float> GenealogyRowsMul; // 0x2f0
	UCanvasPanel* LoadingCanvas; // 0x300
	UHorizontalBox* GenealogyHB; // 0x308
	UCanvasPanel* GenealogyPanel; // 0x310
	UButton* CloseBtn; // 0x318
	UUI_VehiclePerk* VehiclePerkPanel; // 0x320
	UVehicleGenealogySlot* MyGenealogySlot; // 0x328
	UVehicleGenealogySlot* FatherGenealogySlot; // 0x330
	UVehicleGenealogySlot* MotherGenealogySlot; // 0x338
	UVehicleGenealogySlot* GrandFatherGenealogySlot_F; // 0x340
	UVehicleGenealogySlot* GrandMotherGenealogySlot_F; // 0x348
	UVehicleGenealogySlot* GrandFatherGenealogySlot_M; // 0x350
	UVehicleGenealogySlot* GrandMotherGenealogySlot_M; // 0x358
	TWeakObjectPtr<ASG_AnimalsCharacter> BindVehicleCharacter; // 0x360
};

struct AUIWSCapture : AActor {
	USceneCaptureComponent2D* SceneCaptureComp; // 0x310
	USceneComponent* SceneRoot; // 0x318
	UMaterialInstanceDynamic* DrawMID; // 0x320
	FVector moveoffset; // 0x328
	UTextureRenderTarget2D* RTPersistent; // 0x338
	UTextureRenderTarget2D* RTCapture; // 0x340
	UMaterialParameterCollection* MPC_UIWSWaterBodies; // 0x348
};

struct UGridPanel : UPanelWidget {
	TArray<float> ColumnFill; // 0x120
	TArray<float> RowFill; // 0x130
};

struct USimpleDynamicMeshComponent : UBaseDynamicMeshComponent {
	EDynamicMeshTangentCalcType TangentsType; // 0x4f8
	bool bInvalidateProxyOnChange; // 0x4f9
	bool bExplicitShowWireframe; // 0x530
	bool bDrawOnTop; // 0x580
};

struct UN_SlotExtraMenuButton : UUserWidget {
	UButton* ExtraButton; // 0x260
	UTextBlock* ExtraText; // 0x268
	FName ActionName[0x18]; // 0x274
	FText AltText; // 0x338
	FText ShiftText; // 0x350
	FText CmdText; // 0x368
	FText CtrlText; // 0x380
	FText PlaceText; // 0x3a0
	FText EquipText; // 0x3b8
	FText UseText; // 0x3d0
	FText UnEquipText; // 0x3e8
	FText SplitText; // 0x400
	FText RepairText; // 0x418
	FText ExchangeText; // 0x430
	FText CraftOneText; // 0x448
	FText CraftMoreText; // 0x460
	FText FeedText; // 0x478
	FText LearnAWText; // 0x490
	FText GiveText; // 0x4a8
	FText OpenPackageText; // 0x4c0
	FText MapSignText; // 0x4d8
	FText GiftText; // 0x4f0
	FText ChangeNameText; // 0x508
	FText AddFoodText; // 0x520
	FText AddMoneyText; // 0x538
	FText EquipAppearanceText; // 0x550
	FText UnEquipAppearanceText; // 0x568
	FText UnlockAppearanceText; // 0x580
	FText DropText; // 0x598
	FText SetPriorityText; // 0x5b0
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPhononMaterialComponent : UActorComponent {
	int32_t MaterialIndex; // 0xc0
	EPhononMaterial MaterialPreset; // 0xc4
	float LowFreqAbsorption; // 0xc8
	float MidFreqAbsorption; // 0xcc
	float HighFreqAbsorption; // 0xd0
	float LowFreqTransmission; // 0xd4
	float MidFreqTransmission; // 0xd8
	float HighFreqTransmission; // 0xdc
	float Scattering; // 0xe0
};

struct USoundNodeTime : USoundNode {
	float PreviewTimeVolumeMultiplierSet[0x2]; // 0x48
};

struct UCameraRadioButton : UUI_RadioButton {
	int32_t CameraLevel; // 0x540
	FName CameraTarget; // 0x544
	FRotator BodyRotator; // 0x54c
};

struct UVaulting_AnimNotifyState : UAnimNotifyState {
	UAnimMontage* PlayMontage; // 0x268
	float StartPosition; // 0x270
	FVector2D SmoothStartLocRange; // 0x274
	FVector2D SmoothStartRotRange; // 0x27c
	float MaxHeightRetentionTime; // 0x284
	FVector2D MaxHeightRange; // 0x288
	FVector2D EarlyBlendOutTimeRange; // 0x290
	FVector2D ReverseDetachRange; // 0x298
	ESimulateSpace Enum_SimulateSpaceType; // 0x2a0
	TMap<EAnimCurve, FRuntimeFloatCurve> TMap_SimulateCurve; // 0x2a8
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UBookMark : UBookmarkBase {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct UUI_News : USGUI {
	UNewsItem* ItemTemplate; // 0x2d8
	TArray<UNewsItem*> NewsItems; // 0x2e0
	TMap<FGuid, char> RemoveNewsMaps; // 0x2f0
	UUniformGridPanel* UGPNewsItem; // 0x340
	UScrollBox* ScrollNews; // 0x348
	UButton* BtnClearNews; // 0x350
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UGizmoScaledTransformSource : UGizmoBaseTransformSource {
	TScriptInterface<IGizmoTransformSource> ChildTransformSource; // 0x48
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x48
	FSoundAttenuationSettings AttenuationOverrides; // 0x50
	char bOverrideAttenuation : 1; // 0x3f0
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x6e0
	UAnimInstance* AnimClass; // 0x6e8
	UAnimInstance* AnimScriptInstance; // 0x6f0
	UAnimInstance* PostProcessAnimInstance; // 0x6f8
	FSingleAnimationPlayData AnimationData; // 0x700
	FVector RootBoneTranslation; // 0x728
	FVector LineCheckBoundsScale; // 0x734
	TArray<UAnimInstance*> LinkedInstances; // 0x770
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x780
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x790
	float GlobalAnimRateScale; // 0x8f0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8f4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8f5
	EAnimationMode AnimationMode; // 0x8f7
	char bDisablePostProcessBlueprint : 1; // 0x8f9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8f9
	char bHasValidBodies : 1; // 0x8f9
	char bBlendPhysics : 1; // 0x8f9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8f9
	char bUpdateJointsFromAnimation : 1; // 0x8f9
	char bDisableClothSimulation : 1; // 0x8fa
	char bDisableRigidBodyAnimNode : 1; // 0x8fa
	char bAllowAnimCurveEvaluation : 1; // 0x8fa
	char bDisableAnimCurves : 1; // 0x8fa
	char bCollideWithEnvironment : 1; // 0x8fa
	char bCollideWithAttachedChildren : 1; // 0x8fb
	char bLocalSpaceSimulation : 1; // 0x8fb
	char bResetAfterTeleport : 1; // 0x8fb
	char bDeferKinematicBoneUpdate : 1; // 0x8fb
	char bNoSkeletonUpdate : 1; // 0x8fb
	char bPauseAnims : 1; // 0x8fb
	char bUseRefPoseOnInitAnim : 1; // 0x8fb
	char bEnablePerPolyCollision : 1; // 0x8fc
	char bForceRefpose : 1; // 0x8fc
	char bOnlyAllowAutonomousTickPose : 1; // 0x8fc
	char bIsAutonomousTickPose : 1; // 0x8fc
	char bOldForceRefPose : 1; // 0x8fc
	char bShowPrePhysBones : 1; // 0x8fc
	char bRequiredBonesUpToDate : 1; // 0x8fc
	char bAnimTreeInitialised : 1; // 0x8fc
	char bIncludeComponentLocationIntoBounds : 1; // 0x8fd
	char bEnableLineCheckWithBounds : 1; // 0x8fd
	char bUseBendingElements : 1; // 0x8fd
	char bUseTetrahedralConstraints : 1; // 0x8fd
	char bUseThinShellVolumeConstraints : 1; // 0x8fd
	char bUseSelfCollisions : 1; // 0x8fd
	char bUseContinuousCollisionDetection : 1; // 0x8fd
	char bPropagateCurvesToSlaves : 1; // 0x8fd
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8fe
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8fe
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8fe
	uint16_t CachedAnimCurveUidVersion; // 0x900
	EClothMassMode MassMode; // 0x902
	float UniformMass; // 0x904
	float TotalMass; // 0x908
	float Density; // 0x90c
	float MinPerParticleMass; // 0x910
	float ClothBlendWeight; // 0x914
	float EdgeStiffness; // 0x918
	float BendingStiffness; // 0x91c
	float AreaStiffness; // 0x920
	float VolumeStiffness; // 0x924
	float StrainLimitingStiffness; // 0x928
	float ShapeTargetStiffness; // 0x92c
	bool bWaitForParallelClothTask; // 0x930
	TArray<FName> DisallowedAnimCurves; // 0x938
	UBodySetup* BodySetup; // 0x948
	FMulticastInlineDelegate OnConstraintBroken; // 0x958
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x968
	float TeleportDistanceThreshold; // 0xa38
	float TeleportRotationThreshold; // 0xa3c
	uint32_t LastPoseTickFrame; // 0xa48
	UClothingSimulationInteractor* ClothingInteractor; // 0xaa0
	FMulticastInlineDelegate OnAnimInitialized; // 0xb70
};

struct UUI_AdminPrivateServerPanel : UUI_AdminSubPanel {
	UUI_AdminBlockListPanel* AdminBlockListPanel; // 0x2d8
};

struct UNiagaraComponentSettings : UObject {
	TSet<FName> SuppressActivationList; // 0x28
	TSet<FName> ForceAutoPooolingList; // 0x78
	TSet<FNiagaraEmitterNameSettingsRef> SuppressEmitterList; // 0xc8
};

struct UUI_ScalabilityDetailPanel : UUserWidget {
	EScalabilityDetailType ScalabilityDetailType; // 0x260
	UScalabilityDetailItem* ItemTemplate[0x2]; // 0x268
	int32_t ItemNumPerRow; // 0x278
	UVerticalBox* VBItem; // 0x280
	UTextBlock* TbName; // 0x288
	TArray<UScalabilityDetailItem*> ItemList; // 0x290
};

struct USGTrafficGoods : UObject {
	UDataTable* TrafficGoodsTable; // 0x28
	UDataTable* SellerTable; // 0x30
	UCurveTable* SellerLVCurve; // 0x38
	int32_t PriceRatioRefrehInterval; // 0x40
	TMap<GoodsSellerType, FText> GoodsSellerNameMap; // 0x48
	TMap<TrafficGoodsType, FVector2D> GoodsPriceRatioMap; // 0x98
};

struct USoundClass : UObject {
	FSoundClassProperties Properties; // 0x28
	TArray<USoundClass*> ChildClasses; // 0xa8
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0xb8
	USoundClass* ParentClass; // 0xc8
};

struct UGameplayEffect : UObject {
	EGameplayEffectDurationType DurationPolicy; // 0x30
	FGameplayEffectModifierMagnitude DurationMagnitude; // 0x38
	FScalableFloat Period; // 0x1e0
	bool bExecutePeriodicEffectOnApplication; // 0x200
	EGameplayEffectPeriodInhibitionRemovedPolicy PeriodicInhibitionPolicy; // 0x201
	TArray<FGameplayModifierInfo> Modifiers; // 0x208
	TArray<FGameplayEffectExecutionDefinition> Executions; // 0x218
	FScalableFloat ChanceToApplyToTarget; // 0x228
	TArray<UGameplayEffectCustomApplicationRequirement*> ApplicationRequirements; // 0x248
	TArray<UGameplayEffect*> TargetEffectClasses; // 0x258
	TArray<FConditionalGameplayEffect> ConditionalGameplayEffects; // 0x268
	TArray<UGameplayEffect*> OverflowEffects; // 0x278
	bool bDenyOverflowApplication; // 0x288
	bool bClearStackOnOverflow; // 0x289
	TArray<UGameplayEffect*> PrematureExpirationEffectClasses; // 0x290
	TArray<UGameplayEffect*> RoutineExpirationEffectClasses; // 0x2a0
	bool bRequireModifierSuccessToTriggerCues; // 0x2b0
	bool bSuppressStackingCues; // 0x2b1
	TArray<FGameplayEffectCue> GameplayCues; // 0x2b8
	UGameplayEffectUIData* UIData; // 0x2c8
	FInheritedTagContainer InheritableGameplayEffectTags; // 0x2d0
	FInheritedTagContainer InheritableOwnedTagsContainer; // 0x330
	FGameplayTagRequirements OngoingTagRequirements; // 0x390
	FGameplayTagRequirements ApplicationTagRequirements; // 0x3d0
	FGameplayTagRequirements RemovalTagRequirements; // 0x410
	FInheritedTagContainer RemoveGameplayEffectsWithTags; // 0x450
	FGameplayTagRequirements GrantedApplicationImmunityTags; // 0x4b0
	FGameplayEffectQuery GrantedApplicationImmunityQuery; // 0x4f0
	FGameplayEffectQuery RemoveGameplayEffectQuery; // 0x648
	EGameplayEffectStackingType StackingType; // 0x799
	int32_t StackLimitCount; // 0x79c
	EGameplayEffectStackingDurationPolicy StackDurationRefreshPolicy; // 0x7a0
	EGameplayEffectStackingPeriodPolicy StackPeriodResetPolicy; // 0x7a1
	EGameplayEffectStackingExpirationPolicy StackExpirationPolicy; // 0x7a2
	TArray<FGameplayAbilitySpecDef> GrantedAbilities; // 0x7a8
};

struct URewardCondition_Int : URewardCondition {
	EValueConditionType ConditionType; // 0x50
	int64_t Value; // 0x58
	bool bSingleCondition; // 0x60
};

struct UAutoDestroySubsystem : UWorldSubsystem {
	TArray<AActor*> ActorsToPoll; // 0x38
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct UProceduralTorusToolProperties : UProceduralShapeToolProperties {
	float MajorRadius; // 0x70
	float MinorRadius; // 0x74
	int32_t TubeSlices; // 0x78
	int32_t CrossSectionSlices; // 0x7c
};

struct URevolveBoundaryTool : UMeshBoundaryToolBase {
	URevolveBoundaryToolProperties* Settings; // 0x160
	UNewMeshMaterialProperties* MaterialProperties; // 0x168
	UConstructionPlaneMechanic* PlaneMechanic; // 0x170
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0x178
};

struct UARObjectComponent : UARComponent {
	FARObjectUpdatePayload ReplicatedPayload; // 0x290
};

struct UN_CraftQueuePanel : UUserWidget {
	UN_CraftPanel* ParentUI; // 0x260
	USGUI* RootSGUI; // 0x268
	TArray<FName> CraftingQueueSlotNames; // 0x270
	TArray<UN_ItemCraftQueueSlot*> CraftingQueueSlots; // 0x280
	TArray<FItemCraftQueueEntry> LastItemCraftQueueEntries; // 0x290
	TWeakObjectPtr<USGInventoryComponent> BindInventoryComponent; // 0x2a0
};

struct UParticleModuleLocationPrimitiveTriangle : UParticleModuleLocationBase {
	FRawDistributionVector StartOffset; // 0x30
	FRawDistributionFloat Height; // 0x78
	FRawDistributionFloat Angle; // 0xa8
	FRawDistributionFloat Thickness; // 0xd8
};

struct UMaterialExpressionRuntimeVirtualTextureReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput VirtualTextureOutput; // 0x54
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UOperationModeItem : UUserWidget {
	TSoftObjectPtr<UTexture2D> NormalBGTexture; // 0x260
	TSoftObjectPtr<UTexture2D> HoverBgTexture; // 0x288
	TSoftObjectPtr<UTexture2D> SelectBGTexture; // 0x2b0
	UButton* BtnBg; // 0x2e8
	UImage* ImgBg; // 0x2f0
};

struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x4b0
	int32_t PreviousLODLevel; // 0x4b4
	int32_t MinLOD; // 0x4b8
	int32_t SubDivisionStepSize; // 0x4bc
	UStaticMesh* StaticMesh; // 0x4c0
	FColor WireframeColorOverride; // 0x4c8
	char bEvaluateWorldPositionOffset : 1; // 0x4cc
	char bOverrideWireframeColor : 1; // 0x4cc
	char bOverrideMinLod : 1; // 0x4cc
	char bOverrideNavigationExport : 1; // 0x4cc
	char bForceNavigationObstacle : 1; // 0x4cc
	char bDisallowMeshPaintPerInstance : 1; // 0x4cc
	char bIgnoreInstanceForTextureStreaming : 1; // 0x4cc
	char bOverrideLightMapRes : 1; // 0x4cc
	char bCastDistanceFieldIndirectShadow : 1; // 0x4cd
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x4cd
	char bUseSubDivisions : 1; // 0x4cd
	char bUseDefaultCollision : 1; // 0x4cd
	char bReverseCulling : 1; // 0x4cd
	int32_t OverriddenLightMapRes; // 0x4d0
	float DistanceFieldIndirectShadowMinVisibility; // 0x4d4
	float DistanceFieldSelfShadowBias; // 0x4d8
	float StreamingDistanceMultiplier; // 0x4dc
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x4e0
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x4f0
	FLightmassPrimitiveSettings LightmassSettings; // 0x500
};

struct UCollisionProfile : UDeveloperSettings {
	TArray<FCollisionResponseTemplate> Profiles; // 0x38
	TArray<FCustomChannelSetup> DefaultChannelResponses; // 0x48
	TArray<FCustomProfile> EditProfiles; // 0x58
	TArray<FRedirector> ProfileRedirects; // 0x68
	TArray<FRedirector> CollisionChannelRedirects; // 0x78
};

struct AWaterMeshActor : AActor {
	UTexture2D* WaterVelocityTexture; // 0x310
	UWaterMeshComponent* WaterMesh; // 0x318
};

struct UCorpsePOITips : UMiniMapPOITips {
	UTextBlock* TbCorpseRemainingTime; // 0x288
	UCanvasPanel* LoadingCanvas; // 0x290
	UCanvasPanel* MainCanvas; // 0x298
};

struct UBTService_UpdateFollowStatus : UBTService_SGBlueprintBase {
	char bAlwaysUpdateFollowLoc : 1; // 0xb0
};

struct UItemAuctionPanel : USGUI {
	UVerticalBox* ItemListVerticalBox; // 0x2d8
	UVerticalBox* ItemNameVerticalBox; // 0x2e0
	UCanvasPanel* CanvasPanel_SearchItemName; // 0x2e8
	UEditableTextBox* SearchEditableBox; // 0x2f0
	UButton* SearchButton; // 0x2f8
	UGuildAuthorityComboBox* ComboBoxItemType; // 0x300
	UGuildAuthorityComboBox* ComboBoxItemSubType; // 0x308
	UGuildAuthorityComboBox* ComboBoxQuality; // 0x310
	UGuildAuthorityComboBox* ComboBoxLevel; // 0x318
	UCanvasPanel* TipsPanel; // 0x320
	UN_InventorySlot* InventorySlot; // 0x328
	UButton* BuyButton; // 0x330
	UButton* Button_Previous; // 0x338
	UButton* Button_Next; // 0x340
	UTextBlock* TextBlock_CurrentPage; // 0x348
	UN_EquipPanel* EquipPanel; // 0x350
	UN_InventoryPanel* InventoryPanel; // 0x358
	UItemAuctionSlot* ItemAuctionSlotClass; // 0x360
	UItemAuctionSearchNameSlot* ItemAuctionSearchNameSlotClass; // 0x368
	int32_t MaxLevel; // 0x370
	int32_t MaxPage; // 0x374
	int32_t OnePageDataCount; // 0x378
	TWeakObjectPtr<UItemAuctionSlot> ItemSlotSelected; // 0x3d0
	TWeakObjectPtr<UItemAuctionSearchNameSlot> ItemSeacrhNameSlotSelected; // 0x3d8
	TWeakObjectPtr<UUI_GuildAuctionHouse> RootUI; // 0x3e0
};

struct UAnimalAppearanceInfo : UObject {
	TArray<FAnimalAppearanceStruct> AnimalAppearanceStruct; // 0x28
	TArray<FAnimalFurComponentConfig> FurComponentConfigs; // 0x38
	char bRandomSkinHuaSe : 1; // 0x48
	float SkinHuaSeAlpha; // 0x4c
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x360
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x368
	APlayerCameraManager* BaseCamera; // 0x370
	FTransform RelativeTransform; // 0x380
	float BaseFOV; // 0x3b0
	char bAllowMultipleInstances : 1; // 0x3b4
	char bResetWhenRetriggered : 1; // 0x3b4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x3b8
	float DistFromCamera; // 0x3c8
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x90
	FName TrackName; // 0xa0
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct USGGameDataNPCTalkData : UObject {
	TMap<int32_t, FNPCTalkInfo> NPCTalkConfig; // 0x28
	TMap<int32_t, FSoftObjectPath> QuestionImage; // 0x78
};

struct UBTDecorator_DoesPathExist : UBTDecorator {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct ASGStructureFunctionRack : ASGStructureFunctionTable {
	char bCarriedNeedItem : 1; // 0xf80
	ABaseCharacter* SaveGameCarriedCharacter; // 0xf88
	TWeakObjectPtr<ABaseCharacter> CarriedCharacter; // 0xf90
	TWeakObjectPtr<ABaseCharacter> CarriedCharacterTarget; // 0xf98
	FName BindSocketName; // 0xfa0
	float AutoTameAdd; // 0xfa8
	UAnimMontage* BindToRackAnim; // 0xfb0
	FTimerHandle TameTimerHandle; // 0xfb8
};

struct AAmbientSoundSpline : AActor {
	UAudioSplineComponent* AudioSplineComponent; // 0x310
};

struct UUI_ApplyGuildConfirm : UUI_ModifyText {
	UCheckBox* AlertCheckBox; // 0x3e8
	UTextBlock* AlertText; // 0x3f0
	FSlateColor NormalAlertColor; // 0x3f8
	FSlateColor InvalidAlertColor; // 0x420
	char bDefaultAlertChecked : 1; // 0x448
};

struct UUI_NN_CraftPerk : USGUI {
	ECPGType CPGType; // 0x2d8
	FCPGFilterInfo CPGInfo[0x2]; // 0x2e0
	FCPGFilters CPGFilterOptionInfo[0x2]; // 0x390
	int32_t SelectOptionType; // 0x3b0
	UHorizontalBox* CPGTypePanel; // 0x3b8
	int32_t ShowCPGTypePanelNum; // 0x3c0
	UHorizontalBox* OptionPanel; // 0x3c8
	UCanvasPanel* CraftPerkGroupPanel; // 0x3d0
	UScrollBox* CraftPerkGroupScrollBox; // 0x3d8
	TArray<UOptionButton*> OptionButtonList; // 0x3e0
	TArray<UOptionButton*> CPGTypeButtonList; // 0x3f0
	UOptionButton* OptionButtonTemplate; // 0x400
	UNN_CraftPerkGroupSlot* CraftPerkGroupSlotTemplate; // 0x408
	char bIsGuildCraftPerkUI : 1; // 0x410
	float SlotLength; // 0x414
	float SlotWidth; // 0x418
	FVector2D NextLineStartPosition; // 0x41c
	FVector2D NextLineFromStartPositionDistance; // 0x424
	FVector2D ReceiveLinePosition; // 0x42c
	float LineWidth; // 0x434
	UNN_CraftPerkGroupLine* CraftPerkGroupLineTemplate; // 0x438
	UCanvasPanel* CraftPerkGroupCanvas; // 0x440
	char bStartDrag : 1; // 0x448
	UEditableTextBox* SearchEditableTextBlock; // 0x450
	FString SearchString; // 0x458
	UNN_CraftPerkGroupSlot* OnlySearchOneSlot; // 0x468
	char bSearchSlot : 1; // 0x470
	TWeakObjectPtr<UNN_CraftPerkGroupSlot> LearnGroupSlot; // 0x474
	UN_CraftPanelTips* CraftPanelTipsTemplate; // 0x480
	USGToolTipWidget* DefaultToolTipsClass; // 0x488
	TWeakObjectPtr<USGToolTipWidget> CraftPerkItemTips; // 0x490
	TWeakObjectPtr<USGToolTipWidget> CraftPerkCraftTips; // 0x498
	UTextBlock* CapitalText; // 0x4a0
	UTextBlock* CraftPerkPointText; // 0x4a8
};

struct UPlaneFalloff : UFieldNodeFloat {
	float Magnitude; // 0xc0
	float MinRange; // 0xc4
	float MaxRange; // 0xc8
	float Default; // 0xcc
	float Distance; // 0xd0
	FVector position; // 0xd4
	FVector Normal; // 0xe0
	EFieldFalloffType Falloff; // 0xec
};

struct ASGEnvironmentVolume : AVolume {
	FText VolumeName; // 0x348
	TArray<AActor*> OverlapActors; // 0x360
	USGBuff* OverlapBuff; // 0x370
	FTimerHandle AddBuffTimer; // 0x378
	char bEnterDestroy : 1; // 0x380
	char bOnlyAddBuffToSameTeamId : 1; // 0x380
};

struct UUI_StructureAIAttackLogSlot : UUserWidget {
	UTextBlock* TargetTypeText; // 0x260
	UTextBlock* TargetNameText; // 0x268
	UTextBlock* TargetOwnerNameText; // 0x270
	UTextBlock* TargetGuildNameText; // 0x278
	UTextBlock* AttackTimesText; // 0x280
	UTextBlock* UTCTimeText; // 0x288
};

struct UUserDefinedImageCaptureProtocol : UUserDefinedCaptureProtocol {
	EDesiredImageFormat Format; // 0xd8
	bool bEnableCompression; // 0xd9
	int32_t CompressionQuality; // 0xdc
};

struct UMovieSceneEventSection : UMovieSceneSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2c8
	float FOVAngle; // 0x2cc
	float OrthoWidth; // 0x2d0
	UTextureRenderTarget2D* TextureTarget; // 0x2d8
	ESceneCaptureCompositeMode CompositeMode; // 0x2e0
	FPostProcessSettings PostProcessSettings; // 0x2f0
	float PostProcessBlendWeight; // 0x850
	char bOverride_CustomNearClippingPlane : 1; // 0x854
	float CustomNearClippingPlane; // 0x858
	bool bUseCustomProjectionMatrix; // 0x85c
	FMatrix CustomProjectionMatrix; // 0x860
	bool bEnableClipPlane; // 0x8a0
	FVector ClipPlaneBase; // 0x8a4
	FVector ClipPlaneNormal; // 0x8b0
	char bCameraCutThisFrame : 1; // 0x8bc
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x8bc
	bool bDisableFlipCopyGLES; // 0x8c0
};

struct UNamedInterfaces : UObject {
	TArray<FNamedInterface> NamedInterfaces; // 0x28
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x38
};

struct UEdGraphNode : UObject {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct AWaterBodyIsland : AActor {
	UWaterSplineComponent* SplineComp; // 0x318
};

struct ASGStructureGivePerkPoints : ASGStructure {
	int32_t GivePerkPointDataIndex; // 0xb98
	int32_t GivePerkPoints; // 0xb9c
	UParticleSystem* ReceiveEmitter; // 0xba0
	FVector ReceiveEmitterLocationOffset; // 0xba8
	float GivePerkPointsTimeTicker; // 0xbb4
};

struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0x100
	float MaxSpeed; // 0x104
	char bRotationFollowsVelocity : 1; // 0x108
	char bRotationRemainsVertical : 1; // 0x108
	char bShouldBounce : 1; // 0x108
	char bInitialVelocityInLocalSpace : 1; // 0x108
	char bForceSubStepping : 1; // 0x108
	char bSimulationEnabled : 1; // 0x108
	char bSweepCollision : 1; // 0x108
	char bIsHomingProjectile : 1; // 0x108
	char bBounceAngleAffectsFriction : 1; // 0x109
	char bIsSliding : 1; // 0x109
	char bInterpMovement : 1; // 0x109
	char bInterpRotation : 1; // 0x109
	float PreviousHitTime; // 0x10c
	FVector PreviousHitNormal; // 0x110
	float ProjectileGravityScale; // 0x11c
	float Buoyancy; // 0x120
	float Bounciness; // 0x124
	float Friction; // 0x128
	float BounceVelocityStopSimulatingThreshold; // 0x12c
	float MinFrictionFraction; // 0x130
	FMulticastInlineDelegate OnProjectileBounce; // 0x138
	FMulticastInlineDelegate OnProjectileStop; // 0x148
	float HomingAccelerationMagnitude; // 0x158
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x15c
	float MaxSimulationTimeStep; // 0x164
	int32_t MaxSimulationIterations; // 0x168
	int32_t BounceAdditionalIterations; // 0x16c
	float InterpLocationTime; // 0x170
	float InterpRotationTime; // 0x174
	float InterpLocationMaxLagDistance; // 0x178
	float InterpLocationSnapToTargetDistance; // 0x17c
};

struct UInteractiveToolManager : UObject {
	UInteractiveTool* ActiveLeftTool; // 0x30
	UInteractiveTool* ActiveRightTool; // 0x38
	TMap<FString, UInteractiveToolBuilder*> ToolBuilders; // 0x90
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct APaperGroupedSpriteActor : AActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x310
};

struct USGAchievementReward : USGReward {
	int32_t HonorPoint; // 0x28
	TArray<FAchievementDamageMultiply> DamageMultiply; // 0x30
	TArray<FString> Titles; // 0x40
	float Exp; // 0x50
	int32_t copper; // 0x54
	int32_t GuildImageIndex; // 0x58
	TSoftObjectPtr<UTexture2D> GuildImageTexture; // 0x60
};

struct UHorizonDialogueStyleInfo : UObject {
	TArray<FHorizonDialogueSegmentInfoStyle> SegmentStyleList; // 0x28
};

struct UHuangLiMenuSlot : UUserWidget {
	UBorder* BorderOut; // 0x270
	UTextBlock* MenuText; // 0x278
	TSoftObjectPtr<UTexture2D> BorderActiveTexture; // 0x280
	TSoftObjectPtr<UTexture2D> BorderNormalTexture; // 0x2a8
	TSoftObjectPtr<UTexture2D> BorderHoverTexture; // 0x2d0
	TSoftObjectPtr<UTexture2D> BorderClickTexture; // 0x2f8
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UMaterialExpressionSobol : UMaterialExpression {
	FExpressionInput Cell; // 0x40
	FExpressionInput Index; // 0x54
	FExpressionInput Seed; // 0x68
	uint32_t ConstIndex; // 0x7c
	FVector2D ConstSeed; // 0x80
};

struct UGroomHairGroupsPreview : UObject {
	TArray<FGroomHairGroupPreview> Groups; // 0x28
};

struct UServerStateTips : USGToolTipWidget {
	FText StateText[0x3]; // 0x288
	UTextBlock* TbState; // 0x2d0
	UTextBlock* TbPlayerNum; // 0x2d8
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UWBP_ProducerName_3_C : UUserWidget {
	UWBP_ProducerSlot_C* WBP_ProducerSlot; // 0x260
	UWBP_ProducerSlot_C* WBP_ProducerSlot_2; // 0x268
	UWBP_ProducerSlot_C* WBP_ProducerSlot_3; // 0x270
	UWBP_ProducerSlot_C* WBP_ProducerSlot_4; // 0x278
	UWBP_ProducerSlot_C* WBP_ProducerSlot_5; // 0x280
	UWBP_ProducerSlot_C* WBP_ProducerSlot_6; // 0x288
	UWBP_ProducerSlot_C* WBP_ProducerSlot_7; // 0x290
	UWBP_ProducerSlot_C* WBP_ProducerSlot_8; // 0x298
	UWBP_ProducerSlot_C* WBP_ProducerSlot_9; // 0x2a0
	UWBP_ProducerSlot_C* WBP_ProducerSlot_10; // 0x2a8
	UWBP_ProducerSlot_C* WBP_ProducerSlot_11; // 0x2b0
	UWBP_ProducerSplitLine_C* WBP_ProducerSplitLine; // 0x2b8
};

struct USoundSubmixBase : UObject {
	TArray<USoundSubmixBase*> ChildSubmixes; // 0x28
};

struct UN_DragDropItem : UDragDropOperation {
	TWeakObjectPtr<USGItem> BindItem; // 0xb8
};

struct UNewsItem : UUserWidget {
	float RollingSubtitlesSpeed; // 0x260
	UCanvasPanel* NewsCanvas; // 0x268
	URichTextBlock* RTbNews; // 0x270
	UButton* BtnNews; // 0x278
	UButton* BtnClose; // 0x280
	UNewsClientData* BindNewsClientData; // 0x2a8
	UUI_News* RootUI; // 0x2b0
};

struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x238
	float MaxDrawDistance; // 0x23c
	float MaxDistanceFadeRange; // 0x240
	char bUseTemperature : 1; // 0x244
	int32_t ShadowMapChannel; // 0x248
	float MinRoughness; // 0x250
	float SpecularScale; // 0x254
	float ShadowResolutionScale; // 0x258
	float ShadowBias; // 0x25c
	float ShadowSlopeBias; // 0x260
	float ShadowSharpen; // 0x264
	float ContactShadowLength; // 0x268
	char ContactShadowLengthInWS : 1; // 0x26c
	char InverseSquaredFalloff : 1; // 0x26c
	char CastTranslucentShadows : 1; // 0x26c
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x26c
	char bAffectDynamicIndirectLighting : 1; // 0x26c
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x26c
	FLightingChannels LightingChannels; // 0x270
	UMaterialInterface* LightFunctionMaterial; // 0x278
	FVector LightFunctionScale; // 0x280
	UTextureLightProfile* IESTexture; // 0x290
	char bUseIESBrightness : 1; // 0x298
	float IESBrightnessScale; // 0x29c
	float LightFunctionFadeDistance; // 0x2a0
	float DisabledBrightness; // 0x2a4
	char bEnableLightShaftBloom : 1; // 0x2a8
	float BloomScale; // 0x2ac
	float BloomThreshold; // 0x2b0
	float BloomMaxBrightness; // 0x2b4
	FColor BloomTint; // 0x2b8
	bool bUseRayTracedDistanceFieldShadows; // 0x2bc
	float RayStartOffsetDepthScale; // 0x2c0
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	int32_t UsageIndex; // 0x2c
	FGuid UsageId; // 0x30
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1b8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x298
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2a8
};

struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UUI_SeasonPassportRewardItem : UUserWidget {
	UImage* ItemImage; // 0x260
	UImage* LockImage; // 0x268
	UImage* AlreadyGetImage; // 0x270
	UTextBlock* RewardNumText; // 0x278
};

struct AGameSession : AInfo {
	int32_t MaxSpectators; // 0x310
	int32_t MaxPlayers; // 0x314
	int32_t MaxPartySize; // 0x318
	char MaxSplitscreensPerConnection; // 0x31c
	bool bRequiresPushToTalk; // 0x31d
	FName SessionName; // 0x320
};

struct UParticleModuleLight_Seeded : UParticleModuleLight {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct UEditNormalsOperatorFactory : UObject {
	UEditNormalsTool* Tool; // 0x30
};

struct UNiagaraRendererProperties : UNiagaraMergeable {
	FNiagaraPlatformSet Platforms; // 0x28
	int32_t SortOrderHint; // 0x58
	bool bIsEnabled; // 0x5c
	bool bMotionBlurEnabled; // 0x5d
};

struct UBTTask_TurnToBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct UAbilityTask_WaitInputRelease : UAbilityTask {
	FMulticastInlineDelegate OnRelease; // 0x80
};

struct UAbilityTask_WaitGameplayEffectRemoved : UAbilityTask {
	FMulticastInlineDelegate OnRemoved; // 0x80
	FMulticastInlineDelegate InvalidHandle; // 0x90
};

struct UMovieSceneCompiledDataManager : UObject {
	TMap<int32_t, FMovieSceneSequenceHierarchy> Hierarchies; // 0xd8
	TMap<int32_t, FMovieSceneEvaluationTemplate> TrackTemplates; // 0x128
	TMap<int32_t, FMovieSceneEvaluationField> TrackTemplateFields; // 0x178
	TMap<int32_t, FMovieSceneEntityComponentField> EntityComponentFields; // 0x1c8
};

struct UBakedOcclusionMapToolProperties : UInteractiveToolPropertySet {
	int32_t OcclusionRays; // 0x60
	float MaxDistance; // 0x64
	bool bGaussianBlur; // 0x68
	float BlurRadius; // 0x6c
	float BiasAngle; // 0x70
};

struct UGuildKPILogSlot : UUserWidget {
	UCanvasPanel* PointCanvasPanel; // 0x260
	UCanvasPanel* AddCanvasPanel; // 0x268
	UTextBlock* TimeText; // 0x270
	UEditableTextBox* ContentTextBox; // 0x278
	UEditableTextBox* PointTextBox; // 0x280
	UButton* AddSlotButton; // 0x288
	UButton* DeleteSlotButton; // 0x290
};

struct UMovingTurn_AnimNotifyState : UAnimNotifyState {
	UAnimMontage* TurnMontage; // 0x30
	UCurveFloat* RotationCurveAsset; // 0x38
	float StopBlendTime; // 0x40
	char bOnlyTriggerOnServer : 1; // 0x44
	char bIsForbidMove : 1; // 0x44
	char bForceStopMontage : 1; // 0x44
	float MaxTurnYaw; // 0x48
};

struct UInAppPurchaseRestoreCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UN_EquipPanel : UUserWidget {
	UPreviewSceneWidget* PreviewWidget; // 0x260
	TArray<FName> EquipCanvasName; // 0x268
	TArray<FName> RemoteShortCutCanvasName; // 0x278
	char bOverrideShowPosition : 1; // 0x288
	char bShowLeft : 1; // 0x288
	char bEnableOverridePreviewWidget : 1; // 0x288
	float OverridePreviewWidgetDistance; // 0x28c
	FVector OverridePreviewWidgetMeshLocation; // 0x290
	FVector OverridePreviewWidgetMeshLocationOffset; // 0x29c
	FRotator OverridePreviewWidgetMeshRotation; // 0x2a8
	FVector OverridePreviewWidgetCameraLocationOffset; // 0x2b4
	FRotator OverridePreviewWidgetCameraRotation; // 0x2c0
	float OverridePreviewScale; // 0x2cc
	UAnimMontage* OverridePreviewWidgetDefaultAnim; // 0x2d0
	char bOverrideSet : 1; // 0x2d8
	FPreviewCameraSetting DefaultPreviewSetting; // 0x2dc
	char bRemote : 1; // 0x320
	char bPlayer : 1; // 0x320
	USGUI* ParentUI; // 0x328
	TArray<UImage*> VirtualImageList; // 0x330
	TArray<UN_InventorySlot*> InventorySlotList; // 0x340
	TArray<UN_InventorySlot*> ShortCutSlotList; // 0x350
	TWeakObjectPtr<USGInventoryComponent> BindInventoryComponent; // 0x360
	TWeakObjectPtr<AActor> BindActor; // 0x368
	TWeakObjectPtr<ABaseCharacter> BindCharacter; // 0x370
	TSoftObjectPtr<UTexture2D> VirtualHumanImageTexture2D[0x4]; // 0x378
	TSoftObjectPtr<UTexture2D> VirtualImageHorseTexture2D[0x4]; // 0x418
	TSoftObjectPtr<UTexture2D> VirtualImageSiegeTexture2D[0x2]; // 0x4b8
	char bSlotAllowDrag : 1; // 0x508
	char bWatchDead : 1; // 0x508
	UButton* PVEButton; // 0x510
	UTextBlock* PVEText; // 0x518
	FButtonStyle PVPOpenStyle; // 0x520
	FButtonStyle PVPCloseStyle; // 0x798
	FSlateColor PVPOpenColor; // 0xa10
	FSlateColor PVPCloseColor; // 0xa38
	UCanvasPanel* CloudDataMark; // 0xa60
	UTextBlock* CloudDataTimeText; // 0xa68
	char bOnlyShowPreview : 1; // 0xa70
	TWeakObjectPtr<USGItem> RecordTransportItem; // 0xa74
	EInventoryTypes RecordTransportItemInventoyType; // 0xa7c
	EInventoryTypes RecordTransportItemTargetInventoyType; // 0xa7d
	int32_t RecordSlot; // 0xa80
	UButton* ShowAppearanceBtn; // 0xa88
	UCheckBox* SACheckBox; // 0xa90
};

struct UWeapon_AnimInstance : UAnimInstance {
	AShooterWeapon* SG_ShooterWeapon; // 0x2c0
	char bIsAim : 1; // 0x2c8
	char bIsAimPull : 1; // 0x2c8
	char bIsAttack : 1; // 0x2c8
	char bIsReload : 1; // 0x2c8
};

struct UImplicitSmoothProperties : UInteractiveToolPropertySet {
	float SmoothSpeed; // 0x60
	float Smoothness; // 0x64
	bool bPreserveUVs; // 0x68
	float VolumeCorrection; // 0x6c
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x3c8
};

struct UStableRebornPanel : UUserWidget {
	UStableRebornSlot* StableRebornSlotTemplate; // 0x260
	UUserWidget* EmptySlotTemplate; // 0x268
	int32_t PageMaxNum; // 0x270
	UVerticalBox* SlotVerticalBox; // 0x278
	UButton* LastPageBtn; // 0x280
	UTextBlock* CurPageText; // 0x288
	UTextBlock* MaxPageText; // 0x290
	UButton* NextPageBtn; // 0x298
	UButton* ReleaseBtn; // 0x2a0
	UButton* RebornBtn; // 0x2a8
	UButton* AddLifeBtn; // 0x2b0
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct UMeshSelectionTool : UDynamicMeshBrushTool {
	UMeshSelectionToolProperties* SelectionProps; // 0x200
	UMeshSelectionEditActions* SelectionActions; // 0x208
	UMeshSelectionToolActionPropertySet* EditActions; // 0x210
	UMeshSelectionSet* Selection; // 0x218
	TArray<AActor*> SpawnedActors; // 0x220
};

struct UXianChengRelationShipItem : UUserWidget {
	TSoftObjectPtr<UTexture2D> AllianBkTexture; // 0x260
	TSoftObjectPtr<UTexture2D> HostileBkTexture; // 0x288
	TSoftObjectPtr<UTexture2D> AllianTexture; // 0x2b0
	TSoftObjectPtr<UTexture2D> HostileTexture; // 0x2d8
	TSoftObjectPtr<UTexture2D> WeRiseAllianTexture; // 0x300
	TSoftObjectPtr<UTexture2D> HostileRiseAllianTexture; // 0x328
	FText AlianText; // 0x350
	FText HostileText; // 0x368
	FText WeRiseAllianText; // 0x380
	FText HostileRiseAllianText; // 0x398
	FButtonStyle CheckedStyle; // 0x3b0
	FButtonStyle UnCheckedStyle; // 0x628
	UImage* ImgBk; // 0x8a0
	UTextBlock* TbGuildName; // 0x8a8
	UImage* ImgRelationShip; // 0x8b0
	UTextBlock* TbRelationShip; // 0x8b8
	UButton* BtAllian; // 0x8c0
	UButton* BtHostile; // 0x8c8
};

struct UUI_AllianceApplyList : USGUI {
	UScrollBox* ApplyListPanel; // 0x2d8
	UDataButton* PrePageDataButton; // 0x2e0
	UDataButton* NextPageDataButton; // 0x2e8
	UTextBlock* ShowPageText; // 0x2f0
	UButton* ExitButton; // 0x2f8
	UCheckBox* AllowJoinCheckBox; // 0x300
	USortableTitleSlot* NameTitleSlot; // 0x308
	USortableTitleSlot* TimeTitleSlot; // 0x310
	int32_t ApplyNumPerPage; // 0x318
	UAllianceApplySlot* AllianceApplySlotClass; // 0x320
};

struct UShaderPlatformQualitySettings : UObject {
	FMaterialQualityOverrides QualityOverrides[0x4]; // 0x28
};

struct UIterativeOffsetProperties : UInteractiveToolPropertySet {
	int32_t Steps; // 0x60
	bool bOffsetBoundaries; // 0x64
	float SmoothingPerStep; // 0x68
	bool bReprojectSmooth; // 0x6c
};

struct UTransformMeshesTool : UMultiSelectionTool {
	UTransformMeshesToolProperties* TransformProps; // 0x98
	TArray<FTransformMeshesTarget> ActiveGizmos; // 0xb0
};

struct UWBP_MouseSensitivitySettingSliderItem_C : USystemSettingItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368
	UImage* ImgScrollBg; // 0x370
	USlider* Slider; // 0x378
	UTextBlock* TbTitle; // 0x380
	UTextBlock* Text; // 0x388
	UTextBlock* Text1; // 0x390
	float StepSize; // 0x398
};

struct UWBP_Notice_C : UUI_GameNotice {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UCircularThrobber* CircularThrobber; // 0x2e8
	UImage* Image_bg1; // 0x2f0
	UImage* Image_OutBg; // 0x2f8
	UVerticalBox* VerticalBoxList; // 0x300
	UWebBrowser* WebBrowserNotice; // 0x308
	FString BaseURL; // 0x310
	FString BaseUrl-en; // 0x320
};

struct UWorldRankItemSlot : UUserWidget {
	char IsSelfItem : 1; // 0x260
	UN_InventorySlot* ItemSlotClass; // 0x268
	UCanvasPanel* RewardCanvasPanel; // 0x270
	USGUI* RootSGUI; // 0x280
	TWeakObjectPtr<USGInventoryComponent> BindInventoryComponent; // 0x288
	TArray<USGItem*> TempItems; // 0x290
};

struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct USGFoliageInstancedStaticMeshComponent : UFoliageInstancedStaticMeshComponent {
	char bEnableNetworkGameplay : 1; // 0x6e0
	char bScaleHealth : 1; // 0x6e0
	char bIgnoreWeaponRebound : 1; // 0x6e0
	char bUseDestructableDebris : 1; // 0x6e0
	char bEnableHitShake : 1; // 0x6e0
	float HealthScaleMultilier; // 0x6e4
	float MinHealthScale; // 0x6e8
	float MaxHealthScale; // 0x6ec
	USGExploitComponent* EmbededComponentClass; // 0x6f0
	float DestructableDebrisMaxReplicateRange; // 0x6f8
	USoundBase* DestroyedSound; // 0x700
	ASGDestructibleActor* DestructableActorClass; // 0x708
	FVector InteractiveFXSpawnOffset; // 0x710
	UParticleSystem* InteractiveFX; // 0x720
	USoundBase* InteractiveSound; // 0x728
	TArray<FExploitScaleConfig> ExploitScaleConfigs; // 0x730
	FElementsMaskStruct ElementsMaskStruct; // 0x740
	USGExploitComponent* ExploitComponent; // 0x760
};

struct UDisplaceMeshCommonProperties : UInteractiveToolPropertySet {
	EDisplaceMeshToolDisplaceType DisplacementType; // 0x60
	float DisplaceIntensity; // 0x64
	int32_t RandomSeed; // 0x68
	int32_t Subdivisions; // 0x6c
	FName WeightMap; // 0x70
	TArray<FString> WeightMapsList; // 0x78
	bool bInvertWeightMap; // 0x88
	bool bDisableSizeWarning; // 0x89
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
	float PointOfViewBackwardOffset; // 0x64
	float NearClippingRadius; // 0x68
};

struct ASGStructurePackageStation : ASGStructureNPC {
	int32_t UsePackageStationCoolTime; // 0x1010
	int32_t UseMenuTime; // 0x1014
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xe8
	FMovieSceneFloatChannel LeftCurve; // 0x188
	FMovieSceneFloatChannel RightCurve; // 0x228
	FMovieSceneFloatChannel BottomCurve; // 0x2c8
};

struct UCrowdFollowingComponent : UPathFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x278
};

struct UIpConnection : UNetConnection {
	float SocketErrorDisconnectDelay; // 0x1b40
};

struct UMyPluginObject : UObject {
	FMyPluginStruct MyStruct; // 0x28
};

struct UAbilityTask_WaitTargetData : UAbilityTask {
	FMulticastInlineDelegate ValidData; // 0x80
	FMulticastInlineDelegate Cancelled; // 0x90
	AGameplayAbilityTargetActor* TargetClass; // 0xa0
	AGameplayAbilityTargetActor* TargetActor; // 0xa8
};

struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase {
	FRawDistributionVector position; // 0x30
	FRawDistributionFloat Range; // 0x78
	FRawDistributionFloat Strength; // 0xa8
	char StrengthByDistance : 1; // 0xd8
	char bAffectBaseVelocity : 1; // 0xd8
	char bOverrideVelocity : 1; // 0xd8
	char bUseWorldSpacePosition : 1; // 0xd8
	char Positive_X : 1; // 0xd8
	char Positive_Y : 1; // 0xd8
	char Positive_Z : 1; // 0xd8
	char Negative_X : 1; // 0xd8
	char Negative_Y : 1; // 0xd9
	char Negative_Z : 1; // 0xd9
};

struct USourceEffectRingModulationPreset : USoundEffectSourcePreset {
	FSourceEffectRingModulationSettings Settings; // 0xb0
};

struct UProceduralPuncturedDiscToolProperties : UProceduralDiscToolProperties {
	float HoleRadius; // 0x80
};

struct UWBP_PrivateSessionDescription_C : UPrivateSessionDescription {
	UImage* ImgBg; // 0x2c0
	UImage* ImgBottom; // 0x2c8
	UImage* ImgInnerBorder; // 0x2d0
	UImage* ImgMODBg; // 0x2d8
	UImage* ImgSessionBg; // 0x2e0
	UImage* ImgSessionBorder; // 0x2e8
	UImage* ImgTitle; // 0x2f0
	UImage* ImgTop; // 0x2f8
	UImage* TitleImage; // 0x300
};

struct UUI_SGGameRecord : USGUI {
	UGameRecordDataRow* GameRecordDataRowTemplate; // 0x2d8
	UButton* AddGameRecordDataBtn; // 0x2e0
	UButton* DeleteGameRecordDataBtn; // 0x2e8
	UButton* DeleteCurveDataBtn; // 0x2f0
	UCheckBox* LoopPlayCB; // 0x2f8
	UButton* PlayFromZeroTimeBtn; // 0x300
	UButton* SetPrevFrameBtn; // 0x308
	UButton* SetNextFrameBtn; // 0x310
	UButton* ShowInExplorerBtn; // 0x318
	UButton* PlayFromCurTimeBtn; // 0x320
	UButton* StopBtn; // 0x328
	UScrollBox* GameRecordDataList; // 0x330
	UScrollBox* GameRecordCurveList; // 0x338
	UGameRecordTrack* GameRecordTrack; // 0x340
	UButton* FitHorzBtn; // 0x348
	UButton* FitVertBtn; // 0x350
	UCanvasPanel* CurveKeyValuePanel; // 0x358
	USpinBox* TimeSpinBox; // 0x360
	USpinBox* ValueSpinBox; // 0x368
	UButton* MinimizeBtn; // 0x370
	UButton* CloseBtn; // 0x378
	UButton* SaveDataBtn; // 0x380
	UCheckBox* ShowFocusPlaneCB; // 0x388
	UTextBlock* SavedDataFilename; // 0x390
	UTextBlock* TipText; // 0x398
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct AProceduralFoliageBlockingVolume : AVolume {
	TArray<AProceduralFoliageVolume*> ProceduralFoliageVolumes; // 0x348
};

struct UUI_CountySeatAltarSlot : USGUI {
	UButton* Button_Worship; // 0x2d8
	UButton* Button_Background; // 0x2e0
	UImage* Image_Icon; // 0x2e8
	UTextBlock* TextBlock_CapitalCopper; // 0x2f0
	UTextBlock* TextBlock_EndTime; // 0x2f8
	UComboBoxString* ComboBox_Day; // 0x300
	UCanvasPanel* CanvasPanel_Time; // 0x308
	UCanvasPanel* CanvasPanel_EndTime; // 0x310
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UToFloatField : UFieldNodeFloat {
	UFieldNodeInt* IntField; // 0xc0
};

struct UMovieSceneLevelVisibilityTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UInputSettings : UObject {
	TArray<FInputAxisConfigEntry> AxisConfig; // 0x28
	char bAltEnterTogglesFullscreen : 1; // 0x38
	char bF11TogglesFullscreen : 1; // 0x38
	char bUseMouseForTouch : 1; // 0x38
	char bEnableMouseSmoothing : 1; // 0x38
	char bEnableFOVScaling : 1; // 0x38
	char bCaptureMouseOnLaunch : 1; // 0x38
	char bDefaultViewportMouseLock : 1; // 0x38
	char bAlwaysShowTouchInterface : 1; // 0x38
	char bShowConsoleOnFourFingerTap : 1; // 0x39
	char bEnableGestureRecognizer : 1; // 0x39
	bool bUseAutocorrect; // 0x3a
	TArray<FString> ExcludedAutocorrectOS; // 0x40
	TArray<FString> ExcludedAutocorrectCultures; // 0x50
	TArray<FString> ExcludedAutocorrectDeviceModels; // 0x60
	EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x70
	EMouseLockMode DefaultViewportMouseLockMode; // 0x71
	float FOVScale; // 0x74
	float DoubleClickTime; // 0x78
	TArray<FInputActionKeyMapping> ActionMappings; // 0x80
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x90
	TArray<FInputActionSpeechMapping> SpeechMappings; // 0xa0
	TSoftClassPtr<UObject> DefaultPlayerInputClass; // 0xb0
	TSoftClassPtr<UObject> DefaultInputComponentClass; // 0xd8
	FSoftObjectPath DefaultTouchInterface; // 0x100
	FKey ConsoleKey; // 0x118
	TArray<FKey> ConsoleKeys; // 0x130
};

struct UUI_MapItem : UUserWidget {
	TSoftObjectPtr<UTexture2D> NormalRowTexture; // 0x260
	TSoftObjectPtr<UTexture2D> HoverRowTexture; // 0x288
	TSoftObjectPtr<UTexture2D> SelectRowTexture; // 0x2b0
	TMap<int32_t, FLinearColor> PingMsColor; // 0x2d8
	UTextBlock* TbSessionName; // 0x328
	UTextBlock* TbPlayerNum; // 0x330
	UTextBlock* TbPingMS; // 0x338
	UButton* BtnBg; // 0x340
	UImage* ImgBg; // 0x348
	FMulticastInlineDelegate OnMapItemClicked; // 0x350
	int32_t BindServerInfoIndex; // 0x360
	char bHovered : 1; // 0x364
	char bSelected : 1; // 0x364
	char bFavorite : 1; // 0x364
};

struct UFieldSystemMetaDataProcessingResolution : UFieldSystemMetaData {
	EFieldResolutionType ResolutionType; // 0xc0
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	bool bRestrictCrossConsole; // 0x50
	bool bEnableRemovalRequests; // 0x51
	TArray<FPartyReservation> Reservations; // 0x58
};

struct UAllianceListPanel : USGUI {
	UAllianceDetailsSlot* AllianceDetailsSlot; // 0x2d8
	UEditableTextBox* SearchAllianceEditBox; // 0x2e0
	UDataButton* PrePageDataButton; // 0x2e8
	UDataButton* NextPageDataButton; // 0x2f0
	UTextBlock* ShowPageText; // 0x2f8
	UScrollBox* AllianceListPanel; // 0x300
	UButton* CreateAllianceButton; // 0x308
	UButton* InviteToAllianceButton; // 0x310
	USortableTitleSlot* NameTitleSlot; // 0x318
	USortableTitleSlot* OwnerTitleSlot; // 0x320
	USortableTitleSlot* MemberCountTitleSlot; // 0x328
	USortableTitleSlot* GuildCountTitleSlot; // 0x330
	USortableTitleSlot* ManagementTitleSlot; // 0x338
	UCanvasPanel* LoadingCanvasPanel; // 0x340
	int32_t AllianceListNumPerPage; // 0x348
	UAllianceListSlot* AllianceListSlotClass; // 0x350
	UUI_ModifyText* CreateAllianceUIOverride; // 0x358
	UUI_ModifyText* InviteToAllianceUIOverride; // 0x360
	UUI_ModifyText* ApplyAllianceUIOverride; // 0x368
	int32_t RequestAllianceListCount; // 0x370
};

struct UGizmoWorldAxisSource : UObject {
	FVector Origin; // 0x30
	int32_t AxisIndex; // 0x3c
};

struct UBTService_BlueprintBase : UBTService {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UPlatformEventsComponent : UActorComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xc0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xd0
};

struct ULakeCollisionComponent : UPrimitiveComponent {
	UBodySetup* CachedBodySetup; // 0x488
	FVector BoxExtent; // 0x490
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xb0
};

struct ANavSystemConfigOverride : AActor {
	UNavigationSystemConfig* NavigationSystemConfig; // 0x310
	ENavSystemOverridePolicy OverridePolicy; // 0x318
	char bLoadOnClient : 1; // 0x319
};

struct UUI_AdminPlayerPanel : USGUI {
	UScrollBox* ScrollBoxPlayerList; // 0x2d8
	UEditableTextBox* SearchTextBoxPlayer; // 0x2e0
	UCheckBox* CheckBoxOnline; // 0x2f8
	UCheckBox* CheckBoxOffline; // 0x300
	UUI_ServerAdminPlayerRow* UUI_ServerAdminPlayerRowTemplate; // 0x318
	TArray<UUI_ServerAdminPlayerRow*> CachedServerAdminPlayerRow; // 0x320
};

struct UGizmoComponentAxisSource : UObject {
	USceneComponent* Component; // 0x30
	int32_t AxisIndex; // 0x38
	bool bLocalAxes; // 0x3c
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xc0
	bool bUseCollidingComponentsForSourceBounds; // 0xe8
	bool bKeepOwnBoundsScale; // 0xe9
	bool bUseCollidingComponentsForOwnBounds; // 0xea
	FTransform PostTransform; // 0xf0
	bool bCopyXBounds; // 0x120
	bool bCopyYBounds; // 0x121
	bool bCopyZBounds; // 0x122
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xf0
};

struct UUI_VehiclePerk : USGUI {
	int32_t PerRowCount; // 0x2d8
	UVehiclePerkSlot* VehiclePerkSlotTemplate; // 0x2e0
	UUI_ModifyVehiclePerk* ModifyVehiclePerkTemplate; // 0x2e8
	UUniformGridPanel* ForbidPlacePerkPanel; // 0x2f0
	UUniformGridPanel* AllowPlacePerkPanel; // 0x2f8
	UUniformGridPanel* SpecialPerkPanel; // 0x300
	UUniformGridPanel* RecessivePerkPanel; // 0x308
	TWeakObjectPtr<ASG_HorseCharacter> BindHorseCharacter; // 0x310
};

struct UBrushRemeshProperties : URemeshProperties {
	bool bEnableRemeshing; // 0x70
	int32_t TriangleSize; // 0x74
	int32_t PreserveDetail; // 0x78
};

struct USkyAtmosphereComponent : USceneComponent {
	ESkyAtmosphereTransformMode TransformMode; // 0x208
	float BottomRadius; // 0x20c
	FColor GroundAlbedo; // 0x210
	float AtmosphereHeight; // 0x214
	float MultiScatteringFactor; // 0x218
	float TraceSampleCountScale; // 0x21c
	float RayleighScatteringScale; // 0x220
	FLinearColor RayleighScattering; // 0x224
	float RayleighExponentialDistribution; // 0x234
	float MieScatteringScale; // 0x238
	FLinearColor MieScattering; // 0x23c
	float MieAbsorptionScale; // 0x24c
	FLinearColor MieAbsorption; // 0x250
	float MieAnisotropy; // 0x260
	float MieExponentialDistribution; // 0x264
	float OtherAbsorptionScale; // 0x268
	FLinearColor OtherAbsorption; // 0x26c
	FTentDistribution OtherTentDistribution; // 0x27c
	FLinearColor SkyLuminanceFactor; // 0x288
	float AerialPespectiveViewDistanceScale; // 0x298
	float HeightFogContribution; // 0x29c
	float TransmittanceMinLightElevationAngle; // 0x2a0
	float AerialPerspectiveStartDepth; // 0x2a4
	FGuid bStaticLightingBuiltGUID; // 0x2cc
};

struct ASGStructureInstrument : ASGStructureSeat {
	TArray<FRotator> SeatRotationOffset; // 0xf70
	TArray<FName> CameraSocketName; // 0xf80
	char bCanNPCHelp : 1; // 0xf90
	TArray<ABaseCharacter*> AllowNpcControlClass; // 0xf98
	UStaticMesh* InstrumentStickMesh; // 0xfa8
	TArray<FName> InstrumentStickSocketNames; // 0xfb0
	char bShowCrossHair : 1; // 0xfc0
	FText TipsText; // 0xfc8
	ESiegeType SiegeType; // 0xfe0
	TArray<UStaticMeshComponent*> InstrumentStickComponents; // 0xfe8
};

struct UPullKelvinletBrushOpProps : UBaseKelvinletBrushOpProps {
	float Falloff; // 0x70
	float Depth; // 0x74
};

struct UHorseAuctionSellPanel : USGUI {
	UScrollBox* ScrollSellHorseList; // 0x2d8
	UScrollBox* ScrollMyHorseList; // 0x2e0
	UButton* Button_Recall; // 0x2e8
	UButton* Button_Sell; // 0x2f0
	UVehicleEquipPanel* VehicleEquipPanel; // 0x2f8
	UOptionButton* AttributeButton; // 0x300
	UOptionButton* PerkButton; // 0x308
	UVehicleAttributePanel* AttributePanel; // 0x310
	UUI_VehiclePerk* PerkPanel; // 0x318
	UCanvasPanel* CanvasPanel_Preview; // 0x320
	UButton* Button_RefreshSellList; // 0x328
	UButton* Button_RefreshMyList; // 0x330
	UHorseAuctionSellSlot* HorseAuctionSellSlot; // 0x338
	TWeakObjectPtr<UHorseAuctionSellSlot> MyHorseSlotSelected; // 0x340
	TWeakObjectPtr<UHorseAuctionSellSlot> SellHorseSlotSelected; // 0x348
	TWeakObjectPtr<UUI_GuildAuctionHouse> ParentUI; // 0x350
};

struct UGuildKPIItemSlot : UUserWidget {
	UBorder* BGBorder; // 0x260
	UImage* IconImage; // 0x268
	UTextBlock* NameText; // 0x270
	TSoftObjectPtr<UTexture2D> NormalBGTexture; // 0x278
	TSoftObjectPtr<UTexture2D> SelectBGTexture; // 0x2a0
};

struct UARTrackedObject : UARTrackedGeometry {
	UARCandidateObject* DetectedObject; // 0xf8
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x280
	UBoxComponent* PreviewInfluenceBox; // 0x288
	UBoxComponent* PreviewCaptureBox; // 0x290
};

struct UARPointComponent : UARComponent {
	FARPointUpdatePayload ReplicatedPayload; // 0x288
};

struct UHorseAuctionPanel : USGUI {
	UScrollBox* ScrollHorseList; // 0x2d8
	UVehicleEquipPanel* VehicleEquipPanel; // 0x2e0
	UVehicleAttributePanel* AttributePanel; // 0x2e8
	UUI_VehiclePerk* PerkPanel; // 0x2f0
	UCanvasPanel* CanvasPanel_Preview; // 0x2f8
	UOptionButton* AttributeButton; // 0x300
	UOptionButton* PerkButton; // 0x308
	UGuildAuthorityComboBox* ComboBoxQuality; // 0x310
	UGuildAuthorityComboBox* ComboBoxVehicleType; // 0x318
	UGuildAuthorityComboBox* ComboBoxLevel; // 0x320
	UButton* SearchButton; // 0x328
	UButton* BuyButton; // 0x330
	UButton* Button_Previous; // 0x338
	UButton* Button_Next; // 0x340
	UTextBlock* TextBlock_CurrentPage; // 0x348
	UHorseAuctionSellSlot* HorseAuctionSellSlot; // 0x350
	int32_t MaxLevel; // 0x358
	int32_t MaxPage; // 0x35c
	int32_t OnePageDataCount; // 0x360
	TWeakObjectPtr<UUI_GuildAuctionHouse> ParentUI; // 0x378
	TWeakObjectPtr<UHorseAuctionSellSlot> HorseSlotSelected; // 0x380
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UMaterialExpressionFeatureLevelSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
};

struct UDrawPolygonTool : UInteractiveTool {
	UDrawPolygonToolStandardProperties* PolygonProperties; // 0x88
	UDrawPolygonToolSnapProperties* SnapProperties; // 0x90
	UNewMeshMaterialProperties* MaterialProperties; // 0x98
	UPreviewMesh* PreviewMesh; // 0x150
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
	UPlaneDistanceFromHitMechanic* HeightMechanic; // 0x540
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x108
	float MaxDistance; // 0x10c
	float TotalSamples; // 0x110
	float Priority; // 0x114
	USoundAttenuation* AttenuationSettings; // 0x118
	FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x120
	USoundSubmixBase* SoundSubmixObject; // 0x168
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x170
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x180
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x188
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x198
	TArray<UAssetUserData*> AssetUserData; // 0x1a8
};

struct UGroomBindingAsset : UObject {
	UGroomAsset* Groom; // 0x28
	USkeletalMesh* SourceSkeletalMesh; // 0x30
	USkeletalMesh* TargetSkeletalMesh; // 0x38
	int32_t NumInterpolationPoints; // 0x40
	int32_t MatchingSection; // 0x44
	TArray<FGoomBindingGroupInfo> GroupInfos; // 0x48
};

struct UPrivateSessionDescription : UUserWidget {
	UPrivateSessionMODItem* MODItemTemplate; // 0x260
	int32_t MaxMODItemNumPerPage; // 0x268
	float MODItemSizeY; // 0x26c
	UTextBlock* TbSessionName; // 0x280
	URichTextBlock* RtbDescription; // 0x288
	UButton* BtnConfirm; // 0x290
	UCanvasPanel* MODCanvas; // 0x298
	USizeBox* MODSizeBox; // 0x2a0
	UUniformGridPanel* UGPMODList; // 0x2a8
	TArray<UPrivateSessionMODItem*> MODItemList; // 0x2b0
};

struct UGizmoLocalFloatParameterSource : UGizmoBaseFloatParameterSource {
	float Value; // 0x48
	FGizmoFloatParameterChange LastChange; // 0x4c
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x310
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UBTTask_SetRandomPoint : UBTTask_SGBlueprintBase {
	FBlackboardKeySelector BBKey_DesiredLocation; // 0xc0
};

struct ASG_HemlockCharacter : ASG_MoveSeatingCharacter {
	float TriggerBoxDamageImpulse; // 0x2698
	float TriggerBoxDamageAmount; // 0x269c
	USGDamageType* TriggerBoxDamageTypeClass; // 0x26a0
	EDamageType TriggerBoxDamageType; // 0x26a8
	char bAutoSplineRouteMoveStarted : 1; // 0x26a9
	FSoftObjectPath DestroyedMesh; // 0x26b0
	ASGDestructibleActor* DestroyedMeshActorClass; // 0x26c8
	FName DeadSoundID; // 0x26d0
	UAnimMontage* MoveMontage; // 0x26d8
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x310
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x318
};

struct UGivePerkAnimationNotifyWidget : UAnimationNotifyWidget {
	UWidgetAnimation* GivePerk; // 0x278
	UTextBlock* TextBlock_perkpoint; // 0x280
};

struct UMiniMapPOI_Actor : UMiniMapPOI {
	char bShowHeightIndicator : 1; // 0x390
	float AcceptableHeightDiff; // 0x394
	char bFollowActorRotation : 1; // 0x398
	UImage* UpArrow; // 0x3a8
	UImage* DownArrow; // 0x3b0
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x30
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x40
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x50
	FSolverIterations SolverIterations; // 0x60
	char bNotForDedicatedServer : 1; // 0x7c
	UThumbnailInfo* ThumbnailInfo; // 0x120
	TArray<UBodySetup*> BodySetup; // 0x128
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UCageInfoHUDSlot : UUserWidget {
	TSoftObjectPtr<UTexture2D> SexFemaleTexture; // 0x260
	TSoftObjectPtr<UTexture2D> SexMaleTexture; // 0x288
	UTextBlock* AnimalNameText; // 0x2b0
	UImage* AnimalSexImg; // 0x2b8
	UTextBlock* AnimalEscapeTimeText; // 0x2c0
	TWeakObjectPtr<ASGStructureAnimalCage> BindCageStructure; // 0x2c8
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UEnvQueryTest_InsideWaterBody : UEnvQueryTest {
	bool bIncludeWaves; // 0x1f8
	bool bSimpleWaves; // 0x1f9
	bool bIgnoreExclusionVolumes; // 0x1fa
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UGizmoPlaneScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct USGAchievementToolTipWidget : USGToolTipWidget {
	UTextBlock* TbName; // 0x288
	UHorizontalBox* HbName; // 0x290
	UTextBlock* TbDescription; // 0x298
	UHorizontalBox* HbDescription; // 0x2a0
};

struct UAnimSequenceLevelSequenceLink : UAssetUserData {
	FGuid SkelTrackGuid; // 0x28
	FSoftObjectPath PathToLevelSequence; // 0x38
};

struct UARGeoAnchorComponent : UARComponent {
	FARGeoAnchorUpdatePayload ReplicatedPayload; // 0x290
};

struct UAcceptOutputProperties : UInteractiveToolPropertySet {
	bool bExportSeparatedPiecesAsNewMeshAssets; // 0x60
};

struct USmoothMeshTool : UBaseMeshProcessingTool {
	USmoothMeshToolProperties* SmoothProperties; // 0x400
	UIterativeSmoothProperties* IterativeProperties; // 0x408
	UDiffusionSmoothProperties* DiffusionProperties; // 0x410
	UImplicitSmoothProperties* ImplicitProperties; // 0x418
	USmoothWeightMapSetProperties* WeightMapProperties; // 0x420
};

struct UReverbEffect : UObject {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UDisplaceMeshSineWaveProperties : UInteractiveToolPropertySet {
	float SineWaveFrequency; // 0x60
	float SineWavePhaseShift; // 0x64
	FVector SineWaveDirection; // 0x68
};

struct UNewsClientData_GeneralHungry : UNewsClientData {
	FGuid GeneralChunkId; // 0x50
};

struct UPlaneBrushOpProps : UBasePlaneBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
	float Depth; // 0x68
	EPlaneBrushSideMode WhichSide; // 0x6c
};

struct ACreateRoleCameraActor : ASGCameraActor {
	TArray<FCreateRoleCameraLevelData> CameraLevelDatas; // 0x8a8
	int32_t DefaultCameraLevel; // 0x8b8
	FName DefaultCameraTarget; // 0x8bc
	float WheelInterval; // 0x8c4
	FVector DefaultLocation; // 0x8c8
	float CameraInterpDuration; // 0x8d4
	UCurveFloat* CameraInterpCurve; // 0x8d8
	FRotator DefaultRotator; // 0x8e0
	float FreeOffsetStep; // 0x8ec
	float FreeOffsetInterpSpeed; // 0x8f0
	float ResetFreeOffsetInterpSpeed; // 0x8f4
	FVector CameraRelativeLocationOffset; // 0x924
	FVector FreeRelativeLocationOffset; // 0x930
	FVector TargetFreeRelativeLocationOffset; // 0x93c
	float CameraDistance; // 0x948
	float CameraFOV; // 0x94c
	int32_t CameraLevel; // 0x950
	FName CameraTarget; // 0x954
	char bFree : 1; // 0x95c
};

struct UGizmoBaseComponent : UPrimitiveComponent {
	FLinearColor Color; // 0x488
	float HoverSizeMultiplier; // 0x498
	float PixelHitDistanceThreshold; // 0x49c
};

struct UDatasmithAreaLightActorTemplate : UDatasmithObjectTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct UNiagaraDataInterfaceNeighborGrid3D : UNiagaraDataInterfaceGrid3D {
	uint32_t MaxNeighborsPerCell; // 0x100
};

struct UDisplaceMeshTextureMapProperties : UInteractiveToolPropertySet {
	UTexture2D* DisplacementMap; // 0x60
};

struct UMaterialExpressionSpriteTextureSampler : UMaterialExpressionTextureSampleParameter2D {
	bool bSampleAdditionalTextures; // 0x80
	int32_t AdditionalSlotIndex; // 0x84
	FText SlotDisplayName; // 0x88
};

struct UCrowdManager : UCrowdManagerBase {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct UAIAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFail; // 0x38
};

struct UAudioCurveSourceComponent : UAudioComponent {
	FName CurveSourceBindingName; // 0x880
	float CurveSyncOffset; // 0x888
};

struct UWBP_ScalabilityFloatItem_C : UScalabilityDetailItem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UHorizontalBox* HorizontalBox; // 0x2e8
	UImage* ImgScrollBg; // 0x2f0
	USlider* Slider; // 0x2f8
	UTextBlock* TbTitle; // 0x300
	UTextBlock* TbValue; // 0x308
	UTextBlock* TbVariableValue; // 0x310
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0xf8
	EARDepthAccuracy DepthAccuracy; // 0xf9
	bool bIsTemporallySmoothed; // 0xfa
};

struct UGlobalMapFilter : UUserWidget {
	FText FilterName; // 0x260
	EGlobalMapFilterType FilterType; // 0x278
	UCheckBox* CbFilter; // 0x290
	UTextBlock* TbFilterName; // 0x298
	UButton* BtnFilter; // 0x2a0
};

struct UUI_AimDirection : UUserWidget {
	UImage* DirectionArrowImage; // 0x260
	UWidgetAnimation* FadeAnimation; // 0x268
	float MaxWaitTime; // 0x27c
	FVector2D FadePlayRateRange; // 0x280
	TMap<EAimDirection, FDirectionWidgetData> TMap_DirectionWidgetData; // 0x288
};

struct UViewport : UContentWidget {
	FLinearColor BackgroundColor; // 0x120
};

struct UPhysicalMaterial : UObject {
	float Friction; // 0x28
	float StaticFriction; // 0x2c
	EFrictionCombineMode FrictionCombineMode; // 0x30
	bool bOverrideFrictionCombineMode; // 0x31
	float Restitution; // 0x34
	EFrictionCombineMode RestitutionCombineMode; // 0x38
	bool bOverrideRestitutionCombineMode; // 0x39
	float Density; // 0x3c
	float SleepLinearVelocityThreshold; // 0x40
	float SleepAngularVelocityThreshold; // 0x44
	int32_t SleepCounterThreshold; // 0x48
	float RaiseMassToPower; // 0x4c
	float DestructibleDamageThresholdScale; // 0x50
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x58
	EPhysicalSurface SurfaceType; // 0x60
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct ASGCharacter : ABaseCharacter {
	USGCharacterAnimInstance* SGAnimInstance; // 0x2120
	char CapsuleCollision : 1; // 0xe7e8
	EStanceMode Enum_StanceMode; // 0xe7f8
	EMovingGaitType Enum_PlayerInputGaitType; // 0xe7f9
	EMovingGaitType Enum_MovingGaitType; // 0xe7fa
	char bShouldRun : 1; // 0xe7fb
	FCharacterJumpZConfig Struct_CharacterJumpZ; // 0xfe88
	char bIsAiming : 1; // 0xfe90
	char UseWeapon : 1; // 0xfe90
	char bShowBlockCollision : 1; // 0xfe90
	FBlockInfo Struct_CurrentBlockData; // 0xfe98
	FTimerHandle DelayBlockTimer; // 0xfea8
	FTimerHandle UpdateBlockStateTimer; // 0xfeb0
	FTimerHandle UpdateBlockDirectionTimer; // 0xfeb8
	FGuid CurrentAttackUniqueId; // 0xfec0
	char bQuickAttack : 1; // 0xfed0
	float AttackResetTime; // 0xfed4
	float AttackTransitionTime; // 0xfed8
	float DelayCleatAttackStateTime; // 0xfedc
	float DelayAttackTime; // 0xfee0
	float DelayBlockTime; // 0xfee4
	char bEnableAnimAfterShaking : 1; // 0xfee8
	char bIsPressedKickAttack : 1; // 0xfee8
	char bIsPressedOffHandWeaponAttack : 1; // 0xfee8
	char bIsPressedBlock : 1; // 0xfee8
	char bIsPlayAttackMontage : 1; // 0xfee8
	char bIsContinuousAttack : 1; // 0xfee8
	FTimerHandle DelayAttackTimer; // 0xfef0
	FTimerHandle UpdateAttackStateTimer; // 0xfef8
	FTimerHandle DelayClearAttackStateTimer; // 0xff00
	float RiderSprintAttackCoolingTime; // 0xff08
	float RiderSprintAttackCoolingTimeAdd; // 0xff0c
	float RiderSprintAttackLoopingTime; // 0xff10
	float RiderSprintAttackLoopingTimeAdd; // 0xff14
	FTimerHandle RiderSprintAttackCoolingTimer; // 0xff18
	FTimerHandle RiderSprintAttackLoopTimer; // 0xff20
	char bUpdateCrosshair : 1; // 0xff28
	float DesiredCrosshairValue; // 0xff2c
	UAnimMontage* KickMontage; // 0xff30
	FTimerHandle UpdateShooterShakeTimer; // 0xff48
	char bIsCancelAttack : 1; // 0xff50
	UAnimMontage* CancelAttackMontage; // 0xff58
	float SecondaryAttackCoolingTime; // 0xff60
	char bIsAttackCooling : 1; // 0xff64
	char bIsCancelAttackCooling : 1; // 0xff64
	FTimerHandle CancelAttackCoolingTimer; // 0xff78
	int32_t ComboAttackMaxNumber; // 0xff80
	char bIsComboAttack : 1; // 0xff84
	int32_t ComboAttackCurrentNumber; // 0xff88
	FTimerHandle UpdateShooterPullTimer; // 0xff90
	FTimerHandle UpdateShooterPullHoldTimer; // 0xff98
	char bIsShake : 1; // 0xffa0
	char bIsWantReload : 1; // 0xffa0
	float TestAlpha; // 0xffbc
	float HoldBreathTime; // 0xffcc
	char bIsPressedHoldBreath : 1; // 0xffd0
	char bIsHoldBreath : 1; // 0xffd0
	char bIsHoldBreathCooling : 1; // 0xffd0
	FHitAnims Struct_LastHitAnims; // 0xffd8
	char bIsBlockDamageAttack : 1; // 0x10060
	float WillDeadReliveHP; // 0x10064
	float WillDeadReliveHPAdd; // 0x10068
	float WillDeadReliveHPMulAdd; // 0x1006c
	float WillDeadReliveHPConfig; // 0x10070
	float WillDeadReliveHPRandom; // 0x10074
	float RescueTime; // 0x10078
	float RescueTimeAdd; // 0x1007c
	float RescueTimeMulAdd; // 0x10080
	float RescueTimeConfig; // 0x10084
	float RescueTimeRandom; // 0x10088
	ASGCharacter* AcceptRescueCharacter; // 0x10090
	ASGCharacter* DoRescueCharacter; // 0x10098
	TWeakObjectPtr<ASGCharacter> VirtualRecuseCharacter; // 0x100a0
	FTimerHandle RescueTimerHandle; // 0x100a8
	FTimerHandle RescueCheckTimerHandle; // 0x100b0
	float RescueRadius; // 0x100b8
	float WillDeadEyeHeight; // 0x100bc
	float MaxSkillLevel; // 0x10140
	float MaxAddSkillLevel; // 0x10144
	float PlayerCharAddExpMulAdd; // 0x10148
	float PlayerCharAddSkillExpMulAdd; // 0x1014c
	float GenCharAddExpMulAdd; // 0x10150
	float GenCharAddSkillExpMulAdd; // 0x10154
	int32_t ST; // 0x10158
	int32_t AG; // 0x1015c
	int32_t WI; // 0x10160
	int32_t EN; // 0x10164
	int32_t CH; // 0x10168
	double PublicSkillExp; // 0x10170
	int64_t ReduceSkillMasteryWeek; // 0x10178
	UCurveTable* ReduceSkillMasteryCapitalDataTable; // 0x10180
	int32_t ReduceSkillMasteryTimes; // 0x10188
	int32_t WeekFreeReduceSkillMasteryTimes; // 0x1018c
	int32_t FreeReduceSkillMasteryTimes; // 0x101a0
	int32_t FreeReduceSkillMasteryPointsAdd; // 0x101b8
	UDataTable* LimitSkillLevelDataTable; // 0x101c0
	float OneHandedWeapons; // 0x101c8
	float OneHandedWeaponsCalculation; // 0x101cc
	float OneHandedWeaponsConfig; // 0x101d0
	int32_t OneHandedWeaponsAddPoints; // 0x101d4
	int32_t OneHandedWeaponsRandom; // 0x101d8
	int32_t OneHandedWeaponsAdd; // 0x101dc
	double OneHandedWeaponsExp; // 0x101e0
	double OneHandedWeaponsLevelUpExp; // 0x101e8
	int32_t OneHandedWeaponsMastery; // 0x101f0
	int32_t OneHandedWeaponsLimitLevelIndex; // 0x101f4
	int32_t OneHandedWeaponsLimitLevel; // 0x101f8
	float Shields; // 0x101fc
	float ShieldsCalculation; // 0x10200
	float ShieldsConfig; // 0x10204
	int32_t ShieldsAddPoints; // 0x10208
	int32_t ShieldsRandom; // 0x1020c
	int32_t ShieldsAdd; // 0x10210
	double ShieldsExp; // 0x10218
	double ShieldsLevelUpExp; // 0x10220
	int32_t ShieldsMastery; // 0x10228
	int32_t ShieldsLimitLevelIndex; // 0x1022c
	int32_t ShieldsLimitLevel; // 0x10230
	float TowHandedWeapons; // 0x10234
	float TowHandedWeaponsCalculation; // 0x10238
	float TowHandedWeaponsConfig; // 0x1023c
	int32_t TowHandedWeaponsAddPoints; // 0x10240
	int32_t TowHandedWeaponsRandom; // 0x10244
	int32_t TowHandedWeaponsAdd; // 0x10248
	double TowHandedWeaponsExp; // 0x10250
	double TowHandedWeaponsLevelUpExp; // 0x10258
	int32_t TowHandedWeaponsMastery; // 0x10260
	int32_t TowHandedWeaponsLimitLevelIndex; // 0x10264
	int32_t TowHandedWeaponsLimitLevel; // 0x10268
	float Polearms; // 0x1026c
	float PolearmsCalculation; // 0x10270
	float PolearmsConfig; // 0x10274
	int32_t PolearmsAddPoints; // 0x10278
	int32_t PolearmsRandom; // 0x1027c
	int32_t PolearmsAdd; // 0x10280
	double PolearmsExp; // 0x10288
	double PolearmsLevelUpExp; // 0x10290
	int32_t PolearmsMastery; // 0x10298
	int32_t PolearmsLimitLevelIndex; // 0x1029c
	int32_t PolearmsLimitLevel; // 0x102a0
	float HeavyArmors; // 0x102a4
	float HeavyArmorsCalculation; // 0x102a8
	float HeavyArmorsConfig; // 0x102ac
	int32_t HeavyArmorsAddPoints; // 0x102b0
	int32_t HeavyArmorsRandom; // 0x102b4
	int32_t HeavyArmorsAdd; // 0x102b8
	double HeavyArmorsExp; // 0x102c0
	double HeavyArmorsLevelUpExp; // 0x102c8
	int32_t HeavyArmorsMastery; // 0x102d0
	int32_t HeavyArmorsLimitLevelIndex; // 0x102d4
	int32_t HeavyArmorsLimitLevel; // 0x102d8
	float Throwing; // 0x102dc
	float ThrowingCalculation; // 0x102e0
	float ThrowingConfig; // 0x102e4
	int32_t ThrowingAddPoints; // 0x102e8
	int32_t ThrowingRandom; // 0x102ec
	int32_t ThrowingAdd; // 0x102f0
	double ThrowingExp; // 0x102f8
	double ThrowingLevelUpExp; // 0x10300
	int32_t ThrowingMastery; // 0x10308
	int32_t ThrowingLimitLevelIndex; // 0x1030c
	int32_t ThrowingLimitLevel; // 0x10310
	float Archery; // 0x10314
	float ArcheryCalculation; // 0x10318
	float ArcheryConfig; // 0x1031c
	int32_t ArcheryAddPoints; // 0x10320
	int32_t ArcheryRandom; // 0x10324
	int32_t ArcheryAdd; // 0x10328
	double ArcheryExp; // 0x10330
	double ArcheryLevelUpExp; // 0x10338
	int32_t ArcheryMastery; // 0x10340
	int32_t ArcheryLimitLevelIndex; // 0x10344
	int32_t ArcheryLimitLevel; // 0x10348
	float Crossbows; // 0x1034c
	float CrossbowsCalculation; // 0x10350
	float CrossbowsConfig; // 0x10354
	int32_t CrossbowsAddPoints; // 0x10358
	int32_t CrossbowsRandom; // 0x1035c
	int32_t CrossbowsAdd; // 0x10360
	double CrossbowsExp; // 0x10368
	double CrossbowsLevelUpExp; // 0x10370
	int32_t CrossbowsMastery; // 0x10378
	int32_t CrossbowsLimitLevelIndex; // 0x1037c
	int32_t CrossbowsLimitLevel; // 0x10380
	float Riding; // 0x10384
	float RidingCalculation; // 0x10388
	float RidingConfig; // 0x1038c
	int32_t RidingAddPoints; // 0x10390
	int32_t RidingRandom; // 0x10394
	int32_t RidingAdd; // 0x10398
	double RidingExp; // 0x103a0
	double RidingLevelUpExp; // 0x103a8
	int32_t RidingMastery; // 0x103b0
	int32_t RidingLimitLevelIndex; // 0x103b4
	int32_t RidingLimitLevel; // 0x103b8
	float LightArmors; // 0x103bc
	float LightArmorsCalculation; // 0x103c0
	float LightArmorsConfig; // 0x103c4
	int32_t LightArmorsAddPoints; // 0x103c8
	int32_t LightArmorsRandom; // 0x103cc
	int32_t LightArmorsAdd; // 0x103d0
	double LightArmorsExp; // 0x103d8
	double LightArmorsLevelUpExp; // 0x103e0
	int32_t LightArmorsMastery; // 0x103e8
	int32_t LightArmorsLimitLevelIndex; // 0x103ec
	int32_t LightArmorsLimitLevel; // 0x103f0
	float Physique; // 0x103f4
	float PhysiqueCalculation; // 0x103f8
	float PhysiqueConfig; // 0x103fc
	int32_t PhysiqueAddPoints; // 0x10400
	int32_t PhysiqueRandom; // 0x10404
	int32_t PhysiqueAdd; // 0x10408
	double PhysiqueExp; // 0x10410
	double PhysiqueLevelUpExp; // 0x10418
	int32_t PhysiqueMastery; // 0x10420
	int32_t PhysiqueLimitLevelIndex; // 0x10424
	int32_t PhysiqueLimitLevel; // 0x10428
	float Mining; // 0x1042c
	float MiningCalculation; // 0x10430
	float MiningConfig; // 0x10434
	int32_t MiningAddPoints; // 0x10438
	int32_t MiningRandom; // 0x1043c
	int32_t MiningAdd; // 0x10440
	double MiningExp; // 0x10448
	double MiningLevelUpExp; // 0x10450
	int32_t MiningMastery; // 0x10458
	int32_t MiningLimitLevelIndex; // 0x1045c
	int32_t MiningLimitLevel; // 0x10460
	float Lumbering; // 0x10464
	float LumberingCalculation; // 0x10468
	float LumberingConfig; // 0x1046c
	int32_t LumberingAddPoints; // 0x10470
	int32_t LumberingRandom; // 0x10474
	int32_t LumberingAdd; // 0x10478
	double LumberingExp; // 0x10480
	double LumberingLevelUpExp; // 0x10488
	int32_t LumberingMastery; // 0x10490
	int32_t LumberingLimitLevelIndex; // 0x10494
	int32_t LumberingLimitLevel; // 0x10498
	float Hunting; // 0x1049c
	float HuntingCalculation; // 0x104a0
	float HuntingConfig; // 0x104a4
	int32_t HuntingAddPoints; // 0x104a8
	int32_t HuntingRandom; // 0x104ac
	int32_t HuntingAdd; // 0x104b0
	double HuntingExp; // 0x104b8
	double HuntingLevelUpExp; // 0x104c0
	int32_t HuntingMastery; // 0x104c8
	int32_t HuntingLimitLevelIndex; // 0x104cc
	int32_t HuntingLimitLevel; // 0x104d0
	float Planting; // 0x104d4
	float PlantingCalculation; // 0x104d8
	float PlantingConfig; // 0x104dc
	int32_t PlantingAddPoints; // 0x104e0
	int32_t PlantingRandom; // 0x104e4
	int32_t PlantingAdd; // 0x104e8
	double PlantingExp; // 0x104f0
	double PlantingLevelUpExp; // 0x104f8
	int32_t PlantingMastery; // 0x10500
	int32_t PlantingLimitLevelIndex; // 0x10504
	int32_t PlantingLimitLevel; // 0x10508
	float HandMaking; // 0x1050c
	float HandMakingCalculation; // 0x10510
	float HandMakingConfig; // 0x10514
	int32_t HandMakingAddPoints; // 0x10518
	int32_t HandMakingRandom; // 0x1051c
	int32_t HandMakingAdd; // 0x10520
	double HandMakingExp; // 0x10528
	double HandMakingLevelUpExp; // 0x10530
	int32_t HandMakingMastery; // 0x10538
	int32_t HandMakingLimitLevelIndex; // 0x1053c
	int32_t HandMakingLimitLevel; // 0x10540
	float SiegeWorking; // 0x10544
	float SiegeWorkingCalculation; // 0x10548
	float SiegeWorkingConfig; // 0x1054c
	int32_t SiegeWorkingAddPoints; // 0x10550
	int32_t SiegeWorkingRandom; // 0x10554
	int32_t SiegeWorkingAdd; // 0x10558
	double SiegeWorkingExp; // 0x10560
	double SiegeWorkingLevelUpExp; // 0x10568
	int32_t SiegeWorkingMastery; // 0x10570
	int32_t SiegeWorkingLimitLevelIndex; // 0x10574
	int32_t SiegeWorkingLimitLevel; // 0x10578
	float Building; // 0x1057c
	float BuildingCalculation; // 0x10580
	float BuildingConfig; // 0x10584
	int32_t BuildingAddPoints; // 0x10588
	int32_t BuildingRandom; // 0x1058c
	int32_t BuildingAdd; // 0x10590
	double BuildingExp; // 0x10598
	double BuildingLevelUpExp; // 0x105a0
	int32_t BuildingMastery; // 0x105a8
	int32_t BuildingLimitLevelIndex; // 0x105ac
	int32_t BuildingLimitLevel; // 0x105b0
	float Armorer; // 0x105b4
	float ArmorerCalculation; // 0x105b8
	float ArmorerConfig; // 0x105bc
	int32_t ArmorerAddPoints; // 0x105c0
	int32_t ArmorerRandom; // 0x105c4
	int32_t ArmorerAdd; // 0x105c8
	double ArmorerExp; // 0x105d0
	double ArmorerLevelUpExp; // 0x105d8
	int32_t ArmorerMastery; // 0x105e0
	int32_t ArmorerLimitLevelIndex; // 0x105e4
	int32_t ArmorerLimitLevel; // 0x105e8
	UCurveTable* ForgeWeaponQualityDataTable; // 0x105f0
	UCurveTable* ForgeArmorQualityDataTable; // 0x105f8
	float Herb; // 0x10600
	float HerbCalculation; // 0x10604
	float HerbConfig; // 0x10608
	int32_t HerbAddPoints; // 0x1060c
	int32_t HerbRandom; // 0x10610
	int32_t HerbAdd; // 0x10614
	double HerbExp; // 0x10618
	double HerbLevelUpExp; // 0x10620
	int32_t HerbMastery; // 0x10628
	int32_t HerbLimitLevelIndex; // 0x1062c
	int32_t HerbLimitLevel; // 0x10630
	float LeaderShip; // 0x10634
	float LeaderShipCalculation; // 0x10638
	float LeaderShipConfig; // 0x1063c
	int32_t LeaderShipAddPoints; // 0x10640
	int32_t LeaderShipRandom; // 0x10644
	int32_t LeaderShipAdd; // 0x10648
	double LeaderShipExp; // 0x10650
	double LeaderShipLevelUpExp; // 0x10658
	int32_t LeaderShipMastery; // 0x10660
	int32_t LeaderShipLimitLevelIndex; // 0x10664
	int32_t LeaderShipLimitLevel; // 0x10668
	float Training; // 0x1066c
	float TrainingCalculation; // 0x10670
	float TrainingConfig; // 0x10674
	int32_t TrainingAddPoints; // 0x10678
	int32_t TrainingRandom; // 0x1067c
	int32_t TrainingAdd; // 0x10680
	double TrainingExp; // 0x10688
	double TrainingLevelUpExp; // 0x10690
	int32_t TrainingMastery; // 0x10698
	int32_t TrainingLimitLevelIndex; // 0x1069c
	int32_t TrainingLimitLevel; // 0x106a0
	float Recruit; // 0x106a4
	float RecruitCalculation; // 0x106a8
	float RecruitConfig; // 0x106ac
	int32_t RecruitAddPoints; // 0x106b0
	int32_t RecruitRandom; // 0x106b4
	int32_t RecruitAdd; // 0x106b8
	double RecruitExp; // 0x106c0
	double RecruitLevelUpExp; // 0x106c8
	int32_t RecruitMastery; // 0x106d0
	int32_t RecruitLimitLevelIndex; // 0x106d4
	int32_t RecruitLimitLevel; // 0x106d8
	float Taming; // 0x106dc
	float TamingCalculation; // 0x106e0
	float TamingConfig; // 0x106e4
	int32_t TamingAddPoints; // 0x106e8
	int32_t TamingRandom; // 0x106ec
	int32_t TamingAdd; // 0x106f0
	double TamingExp; // 0x106f8
	double TamingLevelUpExp; // 0x10700
	int32_t TamingMastery; // 0x10708
	int32_t TamingLimitLevelIndex; // 0x1070c
	int32_t TamingLimitLevel; // 0x10710
	float TamingAddExpLimitPerHour; // 0x10714
	FDateTime LastTamingAddExpLimitTime; // 0x10718
	double TamingLimitExp; // 0x10720
	float Renown; // 0x10728
	float RenownCalculation; // 0x1072c
	float RenownConfig; // 0x10730
	int32_t RenownAddPoints; // 0x10734
	int32_t RenownRandom; // 0x10738
	int32_t RenownAdd; // 0x1073c
	double RenownExp; // 0x10740
	double RenownLevelUpExp; // 0x10748
	int32_t RenownMastery; // 0x10750
	int32_t RenownLimitLevelIndex; // 0x10754
	int32_t RenownLimitLevel; // 0x10758
	float PolearmsOnHorseDamageMulAdd; // 0x1075c
	float OneHandAxeToShieldMulAdd; // 0x10760
	float TowHandAxeToShieldMulAdd; // 0x10764
	float PolearmsAxeToShieldMulAdd; // 0x10768
	float ThrowingAxeToShieldMulAdd; // 0x1076c
	float BowAxeToShieldMulAdd; // 0x10770
	float CrossBowAxeToShieldMulAdd; // 0x10774
	float OneHandHammerToArmorMulAdd; // 0x10778
	float TowHandHammerToArmorMulAdd; // 0x1077c
	float PolearmHammerToArmorMulAdd; // 0x10780
	float ThrowingHammerToArmorMulAdd; // 0x10784
	float BowHammerToArmorMulAdd; // 0x10788
	float CrossBowHammerToArmorMulAdd; // 0x1078c
	float OneHandSwordToHPMulAdd; // 0x10790
	float TowHandSwordToHPMulAdd; // 0x10794
	float PolearmSwordToHPMulAdd; // 0x10798
	float ThrowingSwordToHPMulAdd; // 0x1079c
	float BowSwordToHPMulAdd; // 0x107a0
	float CrossBowSwordToHPMulAdd; // 0x107a4
	float SiegeTurretToStructureMulAdd; // 0x107a8
	float SiegeBallistaToStructureMulAdd; // 0x107ac
	float SiegeFireThrowerToStructureMulAdd; // 0x107b0
	float SiegeRamToStructureMulAdd; // 0x107b4
	float OneHandHammerToWeaponMulAdd; // 0x107b8
	float TowHandHammerToWeaponMulAdd; // 0x107bc
	float PolearmHammerToWeaponMulAdd; // 0x107c0
	float ThrowingHammerToWeaponMulAdd; // 0x107c4
	float BowHammerToWeaponMulAdd; // 0x107c8
	float CrossBowHammerToWeaponMulAdd; // 0x107cc
	float MineResLv1MulAdd; // 0x107d0
	float MineResLv2MulAdd; // 0x107d4
	float MineResLv3MulAdd; // 0x107d8
	float MineResLv4MulAdd; // 0x107dc
	float LumberResLv1MulAdd; // 0x107e0
	float LumberResLv2MulAdd; // 0x107e4
	float LumberResLv3MulAdd; // 0x107e8
	float LumberResLv4MulAdd; // 0x107ec
	float HuntResLv1MulAdd; // 0x107f0
	float HuntResLv2MulAdd; // 0x107f4
	float HuntResLv3MulAdd; // 0x107f8
	float HuntResLv4MulAdd; // 0x107fc
	float PlantResLv1MulAdd; // 0x10800
	float PlantResLv2MulAdd; // 0x10804
	float PlantResLv3MulAdd; // 0x10808
	float PlantResLv4MulAdd; // 0x1080c
	float PlantSeedLv1MulAdd; // 0x10810
	float PlantSeedLv2MulAdd; // 0x10814
	float PlantSeedLv3MulAdd; // 0x10818
	float PlantSeedLv4MulAdd; // 0x1081c
	float CultivatedLandMulAdd; // 0x10820
	float FertilizerMulAdd; // 0x10824
	float WateringMulAdd; // 0x10828
	float PlantResLv1Luck; // 0x1082c
	float PlantResLv1LuckProduceMulAdd; // 0x10830
	float PlantResLv2Luck; // 0x10834
	float PlantResLv2LuckProduceMulAdd; // 0x10838
	float PlantResLv3Luck; // 0x1083c
	float PlantResLv3LuckProduceMulAdd; // 0x10840
	float PlantResLv4Luck; // 0x10844
	float PlantResLv4LuckProduceMulAdd; // 0x10848
	float PlantSeedLv1Luck; // 0x1084c
	float PlantSeedLv1LuckProduceMulAdd; // 0x10850
	float PlantSeedLv2Luck; // 0x10854
	float PlantSeedLv2LuckProduceMulAdd; // 0x10858
	float PlantSeedLv3Luck; // 0x1085c
	float PlantSeedLv3LuckProduceMulAdd; // 0x10860
	float PlantSeedLv4Luck; // 0x10864
	float PlantSeedLv4LuckProduceMulAdd; // 0x10868
	float HerbResLv1MulAdd; // 0x1086c
	float HerbResLv2MulAdd; // 0x10870
	float HerbResLv3MulAdd; // 0x10874
	float HerbResLv4MulAdd; // 0x10878
	float GeneralExploitDamageMulAdd; // 0x1087c
	float TowHandWeaponBreakDefenseRatioAdd; // 0x10880
	float AnimalDamageReduceMulAdd; // 0x10884
	float AnimalWarnRangeMulAdd; // 0x10888
	float HandMakingTimeMulAdd; // 0x1088c
	float SiegeWorkMaxHPMulAdd; // 0x10890
	float SiegeWorkReloadTimeMulAdd; // 0x10894
	float SiegeWorkDrawTimeMulAdd; // 0x10898
	float BallistaBulletSpeedMulAdd; // 0x1089c
	float BallistaLineDisMulAdd; // 0x108a0
	float BallistaEnable; // 0x108a4
	float SiegeProjectileFollowEnable; // 0x108a8
	float FlamethrowerAmmoMulAdd; // 0x108ac
	float SiegeWorkSpeedMulAdd; // 0x108b0
	float SiegeWorkRotateSpeedMulAdd; // 0x108b4
	float ClimbLadderSpeedMulAdd; // 0x108b8
	float BuildingResMulAdd; // 0x108bc
	float BuildingHPRecoverMulAdd; // 0x108c0
	float BuildingFixTimeMulAdd; // 0x108c4
	int32_t WeaponEffect; // 0x108c8
	TArray<UParticleSystem*> WeaponEffects; // 0x108d0
	float WoundTypeValue1; // 0x108e0
	float WoundTypeValue2; // 0x108e4
	float WoundTypeValue3; // 0x108e8
	float WoundTypeValue4; // 0x108ec
	float Wound1AddOtherMulAdd; // 0x108f0
	float Wound2AddOtherMulAdd; // 0x108f4
	float Wound3AddOtherMulAdd; // 0x108f8
	float Wound4AddOtherMulAdd; // 0x108fc
	float Wound1ResistMulAdd; // 0x10900
	float Wound2ResistMulAdd; // 0x10904
	float Wound3ResistMulAdd; // 0x10908
	float Wound4ResistMulAdd; // 0x1090c
	float DeadlyValue; // 0x10910
	USGBuff* DeadlyBuff; // 0x10918
	float WoundAutoRecoverValue; // 0x10920
	float TamingExpMulAdd; // 0x1093c
	float TamingHealRecMulAdd; // 0x10940
	float TamingHungerRecMulAdd; // 0x10944
	float TamedAnimalExpMulAdd; // 0x10948
	float MaxGeneralsAdd; // 0x1094c
	float MaxGeneralsHPMulAdd; // 0x10950
	float MaxGeneralsSpeedMulAdd; // 0x10954
	float MaxGeneralsSPMulAdd; // 0x10958
	float GeneralsStunMulAdd; // 0x1095c
	int32_t MaxWarGeneralNumberAdd; // 0x10960
	float MinRecruitAddLevel; // 0x10964
	float MaxRecruitAddLevel; // 0x10968
	float RecruitAddLife; // 0x1096c
	int32_t CurrentRecruitMaxLevel; // 0x10970
	float LoyaltyAddMultiAdd; // 0x10974
	float GeneralRebornTimeMultiAdd; // 0x10978
	float GeneralHungerReduceMultiAdd; // 0x1097c
	float GeneralSTSkillMultiAdd; // 0x10980
	float GeneralAGSkillMultiAdd; // 0x10984
	float GeneralWISkillMultiAdd; // 0x10988
	float GeneralENSkillMultiAdd; // 0x1098c
	float GeneralCHSkillMultiAdd; // 0x10990
	float GeneralSkillAddOneHandedWeaponsMultiAdd; // 0x10994
	float GeneralSkillAddShieldsMultiAdd; // 0x10998
	float GeneralSkillAddTowHandedWeaponsMultiAdd; // 0x1099c
	float GeneralSkillAddPolearmsMultiAdd; // 0x109a0
	float GeneralSkillAddHeavyArmorsMultiAdd; // 0x109a4
	float GeneralSkillAddThrowingMultiAdd; // 0x109a8
	float GeneralSkillAddArcheryMultiAdd; // 0x109ac
	float GeneralSkillAddCrossbowsMultiAdd; // 0x109b0
	float GeneralSkillAddRidingMultiAdd; // 0x109b4
	float GeneralSkillAddLightArmorsMultiAdd; // 0x109b8
	float GeneralSkillAddPhysiqueMultiAdd; // 0x109bc
	float GeneralSkillAddMiningMultiAdd; // 0x109c0
	float GeneralSkillAddLumberingMultiAdd; // 0x109c4
	float GeneralSkillAddHuntingMultiAdd; // 0x109c8
	float GeneralSkillAddPlantingMultiAdd; // 0x109cc
	float GeneralSkillAddHandMakingMultiAdd; // 0x109d0
	float GeneralSkillAddSiegeWorkingMultiAdd; // 0x109d4
	float GeneralSkillAddBuildingMultiAdd; // 0x109d8
	float GeneralSkillAddArmorerMultiAdd; // 0x109dc
	float GeneralSkillAddHerbMultiAdd; // 0x109e0
	float GeneralSkillAddTamingMultiAdd; // 0x109e4
	float GeneralSkillAddLeaderShipMultiAdd; // 0x109e8
	float GeneralSkillAddRecruitMultiAdd; // 0x109ec
	float GeneralSkillAddTrainingMultiAdd; // 0x109f0
	float GeneralSkillAddRenownMultiAdd; // 0x109f4
	int32_t ExtraSkillPointsAdd; // 0x109f8
	int32_t ExtraPerkPointsAdd; // 0x109fc
	float ThrowingRangeMulAdd; // 0x10a00
	float BowRangeMulAdd; // 0x10a04
	float CorssBowRangeMulAdd; // 0x10a08
	int32_t CorssBowPiercenessAdd; // 0x10a0c
	float CorssBowPiercenessRatio; // 0x10a10
	float BeInFullSwingValue; // 0x10a14
	float BeInFullSwingValueAdd; // 0x10a18
	float BeInFullSwingMaxValue; // 0x10a1c
	float BeInFullSwingTime; // 0x10a20
	FTimerHandle BeInFullSwingTimerHandle; // 0x10a28
	USGBuff* BeInFullSwingBuffTemplate; // 0x10a30
	float SkilledMiner; // 0x10a38
	float PracticeMiner; // 0x10a3c
	float BeInFullSwingMiner; // 0x10a40
	float ExplorationCopper; // 0x10a44
	float ExplorationIron; // 0x10a48
	float ExplorationXuanhuaIron; // 0x10a4c
	float ExplorationMeteorite; // 0x10a50
	float ExplorationClay; // 0x10a54
	float ExplorationSalt; // 0x10a58
	float ExplorationKaolinite; // 0x10a5c
	float ExplorationCoal; // 0x10a60
	float ExplorationNitramite; // 0x10a64
	float ExplorationSulfur; // 0x10a68
	float ExplorationRealgar; // 0x10a6c
	float ExplorationJade; // 0x10a70
	float AddBarkProduction; // 0x10a74
	float SkilledLumber; // 0x10a78
	float PracticeLumber; // 0x10a7c
	float BeInFullSwingLumber; // 0x10a80
	float SharpEyesLevel2Tree; // 0x10a84
	float SharpEyesLevel3Tree; // 0x10a88
	float SharpEyesLevel4Tree; // 0x10a8c
	float BoneProduction; // 0x10a90
	float SkilledHunter; // 0x10a94
	float SensitiveSmell; // 0x10a98
	float PracticeHunter; // 0x10a9c
	float WalkOnTiptoe; // 0x10aa0
	float SkillfulSwimmer; // 0x10aa4
	float OneHandedWeaponsAttackBlockDurableMultiAdd; // 0x10aa8
	float ShieldsAttackBlockDurableMultiAdd; // 0x10aac
	float TowHandedWeaponsAttackBlockDurableMultiAdd; // 0x10ab0
	float PolearmsAttackBlockDurableMultiAdd; // 0x10ab4
	float ArcheryAttackDurableMultiAdd; // 0x10ab8
	float CrossbowsAttackDurableMultiAdd; // 0x10abc
	float SiegeAttackDurableMultiAdd; // 0x10ac0
	TArray<int32_t> Perks; // 0x10ac8
	int32_t CurrentMasteryPoints; // 0x10ad8
	int32_t MasteryPointsAdd; // 0x10adc
	int32_t CurrentCraftPoints; // 0x10ae0
	int32_t CurrentPerkPoints; // 0x10ae4
	TArray<int32_t> CraftPerkGroups; // 0x10ae8
	TArray<USGCraftPerkGroup*> DefaultCraftPerkGroup; // 0x10af8
	float BowAimTimeMulAdd; // 0x10b08
	float BowReloadTimeMulAdd; // 0x10b0c
	float BowHoldTimeAdd; // 0x10b10
	float BowMovingAngleMulAdd; // 0x10b14
	float BowRotationScatteringAngleMulAdd; // 0x10b18
	float RiderBowMovingAngleMulAdd; // 0x10b1c
	float BowAngleMulAdd; // 0x10b20
	float BowArrowSpeedAdd; // 0x10b24
	float CrossBowAimTimeMulAdd; // 0x10b28
	float CrossBowReloadTimeMulAdd; // 0x10b2c
	float CrossBowHoldTimeAdd; // 0x10b30
	float CrossBowMovingAngleMulAdd; // 0x10b34
	float RiderCrossBowMovingAngleMulAdd; // 0x10b38
	float CrossBowAngleMulAdd; // 0x10b3c
	float CrossBowArrowSpeedAdd; // 0x10b40
	float ThrowingReloadTimeMulAdd; // 0x10b44
	float ThrowingAngleMulAdd; // 0x10b48
	float ThrowingArrowSpeedAdd; // 0x10b4c
	float OnehandCostSPMulAdd; // 0x10b50
	float TowhandCostSPMulAdd; // 0x10b54
	float PolearmsCostSPMulAdd; // 0x10b58
	float ThrowingCostSPMulAdd; // 0x10b5c
	float ArcheryCostSPMulAdd; // 0x10b60
	float CrossbowsCostSPMulAdd; // 0x10b64
	float OnehandMaxComboAdd; // 0x10b68
	float TowhandMaxComboAdd; // 0x10b6c
	float PolearmsMaxComboAdd; // 0x10b70
	float RidingRotationMulAdd; // 0x10b74
	float RidingRotationMulInterpSpeedAdd; // 0x10b78
	float OneHandHeadShootDmgMulAdd; // 0x10b7c
	float TowHandHeadShootDmgMulAdd; // 0x10b80
	float PolearmHeadShootDmgMulAdd; // 0x10b84
	float BowHeadShootDmgMulAdd; // 0x10b88
	float CorssBowHeadShootDmgMulAdd; // 0x10b8c
	float ThrowingHeadShootDmgMulAdd; // 0x10b90
	float SiegeHeadShootDmgMulAdd; // 0x10b94
	float JueWeiAchievementShieldDurableMulAdd; // 0x10b98
	float RidingAccelerationMulAdd; // 0x10b9c
	float RidingCostSPMulAdd; // 0x10ba0
	float ForgeWeaponAbility; // 0x10ba4
	float ForgeArmorAbility; // 0x10ba8
	float ReduceEquipmentWeightMultiAdd; // 0x10bac
	float CanRepaireStructureEquipment; // 0x10bb0
	float BackShieldBlockedDamageMultiAdd; // 0x10bb4
	float PushShieldBlockedArrowScaleMultiAdd; // 0x10bb8
	float UseSiegeDamageMulAdd; // 0x10bbc
	float AchievementHonorMulAdd; // 0x10bc0
	float BattleHonorMulAdd; // 0x10bc4
	float BannerWeiWangMulAdd; // 0x10bc8
	float HonorDamageMulAdd; // 0x10bcc
	bool bHQMesh; // 0x10bd0
	bool bRandomAppearanceInEditor; // 0x10bd1
	UCharacterRandomAppearanceWeight* RandomAppearanceWeight; // 0x10bd8
	TArray<FName> AppearanceTemplates; // 0x10be0
	FAppearanceData AppearanceData; // 0x10bf0
	USGItem* Helmet; // 0x10d68
	USGItem* Chest; // 0x10d70
	USGItem* Cuish; // 0x10d78
	USGItem* Back; // 0x10d80
	char bAppearanceState : 1; // 0x10d88
	USGItem* HelmetAppearance; // 0x10d90
	USGItem* ChestAppearance; // 0x10d98
	USGItem* UnderwaistAppearance; // 0x10da0
	USGItem* FashionKitHelmet; // 0x10da8
	USGItem* FashionKitChest; // 0x10db0
	USGItem* FashionKitCuish; // 0x10db8
	FString FlagImageString; // 0x10dc0
	FCharacterMeshLODDynamicMaterialData DynamicGameMeshMats[0x3]; // 0x10e08
	FCharacterMeshLODDynamicMaterialData DynamicHQMeshMats[0x3]; // 0x10e50
	UMaterialInstanceDynamic* DynamicHairMaterial; // 0x10e98
	UMaterialInstanceDynamic* DynamicMoustacheMaterial; // 0x10ea0
	TWeakObjectPtr<ASGPlayerController> ViewBasePropertyController; // 0x10eb8
	FString PlayerAccountId; // 0x10ec0
	uint32_t CharacterDataVersion; // 0x10ed0
	int32_t TaiShouTitleIndex; // 0x10ed8
	float FoodBuffModifyDataMulAdd; // 0x10edc
	float WineBuffModifyDataMulAdd; // 0x10ee0
	float MedicineBuffModifyDataMulAdd; // 0x10ee4
	TArray<FArtofWar> ArtofWar; // 0x10ee8
	int32_t bCanClimbWall; // 0x10ef8
	int32_t bCanLightArmorClimbWall; // 0x10efc
	int32_t bCanHeavyArmorClimbWall; // 0x10f00
	float ClimbWallHeight; // 0x10f04
	float LightArmorClimbWallHeight; // 0x10f08
	float HeavyArmorClimbWallHeight; // 0x10f0c
	int32_t MaxPersonalStructureAdd; // 0x10f10
	char bDeadChangeDurable : 1; // 0x10f14
	float WildNPCDeadDurableMulMin; // 0x10f18
	float WildNPCDeadDurableMulMax; // 0x10f1c
	TWeakObjectPtr<ASG_AnimalsCharacter> BindedHorse; // 0x10f20
	TWeakObjectPtr<ASG_AnimalsCharacter> BeFollowHorse; // 0x10f28
	char bCanClimbInEditor : 1; // 0x10f38
	UAnimMontage* AnimSkillMontage; // 0x10f50
	FVaultingParams VaultingParams; // 0x10f60
	UAnimSkill_VaultingData* AnimSkillVaultingData; // 0x110b0
	TArray<float> WoundValues; // 0x110b8
	TArray<int32_t> StructureGivePerks; // 0x110c8
	char LadderParamsIndex; // 0x110d8
	float ChargeResDefenseEffective; // 0x110dc
	float MaxCharge; // 0x110e0
	float MinCharge; // 0x110e4
	float MaxChargeTumbleRate; // 0x110e8
	float MinChargeTumbleRate; // 0x110ec
	UMaterialInstanceDynamic* DMI_FlagImage; // 0x110f0
	UTextureRenderTarget2D* RT_FlagImage; // 0x110f8
};

struct UInputKeySelector : UWidget {
	FButtonStyle WidgetStyle; // 0x108
	FTextBlockStyle TextStyle; // 0x380
	FInputChord SelectedKey; // 0x5f0
	FSlateFontInfo Font; // 0x610
	FMargin Margin; // 0x668
	FLinearColor ColorAndOpacity; // 0x678
	FText KeySelectionText; // 0x688
	FText NoKeySpecifiedText; // 0x6a0
	bool bAllowModifierKeys; // 0x6b8
	bool bAllowGamepadKeys; // 0x6b9
	TArray<FKey> EscapeKeys; // 0x6c0
	FMulticastInlineDelegate OnKeySelected; // 0x6d0
	FMulticastInlineDelegate OnIsSelectingKeyChanged; // 0x6e0
};

struct UParticleModuleLocationEmitterDirect : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
};

struct URewardCondition_Float : URewardCondition {
	EValueConditionType ConditionType; // 0x50
	float Value; // 0x54
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct UHierarchicalLODSetup : UObject {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x488
	char bEnableMaterialParameterCaching : 1; // 0x4a8
};

struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct UColorSelector : UUserWidget {
	float Hue; // 0x260
	FVector2D ColorStaturation; // 0x264
	FVector2D ColorValue; // 0x26c
	USizeBox* SBMain; // 0x278
	UImage* ImgColorBg; // 0x280
	UImage* ImgCursor; // 0x288
	UCanvasPanelSlot* ImgCursorSlot; // 0x2a0
	char bStartColorSelector : 1; // 0x2a8
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct UParticleModuleAccelerationConstant : UParticleModuleAccelerationBase {
	FVector Acceleration; // 0x38
};

struct UParticleModuleOrbitBase : UParticleModule {
	char bUseEmitterTime : 1; // 0x30
};

struct UMovieSceneBindingOverrides : UObject {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x28
};

struct UIterativeSmoothProperties : UInteractiveToolPropertySet {
	float SmoothingPerStep; // 0x60
	int32_t Steps; // 0x64
	bool bSmoothBoundary; // 0x68
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
};

struct UHapticFeedbackEffect_SoundWave : UHapticFeedbackEffect_Base {
	USoundWave* SoundWave; // 0x28
};

struct UInterpTrackInstSound : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
	UAudioComponent* PlayAudioComp; // 0x30
};

struct UAISense_Touch : UAISense {
	TArray<FAITouchEvent> RegisteredEvents; // 0x80
};

struct UDrawPolygonToolSnapProperties : UInteractiveToolPropertySet {
	bool bEnableSnapping; // 0x60
	bool bSnapToWorldGrid; // 0x61
	bool bSnapToVertices; // 0x62
	bool bSnapToEdges; // 0x63
	bool bSnapToAngles; // 0x64
	bool bSnapToLengths; // 0x65
	float SegmentLength; // 0x68
	bool bHitSceneObjects; // 0x6c
	float HitNormalOffset; // 0x70
};

struct ASGStructureFunctionTable : ASGStructureSeat {
	char bCanNPCUse : 1; // 0xf78
	char bOnlySeatCharacterCanOpenInventory : 1; // 0xf78
};

struct UShutDownService : UObject {
	USGCheatManager* CheatManager; // 0x60
};

struct UNiagaraDataInterfaceGrid2DCollectionReader : UNiagaraDataInterfaceGrid2D {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UCloudStorageBase : UPlatformInterfaceBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct USequenceCameraShakeCameraStandIn : UObject {
	float FieldOfView; // 0x30
};

struct UOccupyFlagItem : UUserWidget {
	UMaterialInstance* OccupyFlagMaterial; // 0x260
	FLinearColor SameTeamProgressColor; // 0x268
	FLinearColor OtherTeamProgressColor; // 0x278
	UImage* ImgFlag; // 0x290
	UImage* ImgOccupyFlag; // 0x298
	UTextBlock* TbProgress; // 0x2a0
	UTextBlock* TbPercent; // 0x2a8
};

struct UWBP_KeySettingRadioView_C : UUI_RadioButtonView {
	UWBP_KeySettingRadioButton_C* Attack; // 0x2f0
	UWBP_KeySettingRadioButton_C* Camera; // 0x2f8
	UWBP_KeySettingRadioButton_C* General; // 0x300
	UWBP_KeySettingRadioButton_C* GroundedMovement; // 0x308
	UWBP_KeySettingRadioButton_C* OtherMovement; // 0x310
	UWBP_KeySettingRadioButton_C* ShortCut; // 0x318
	UWBP_KeySettingRadioButton_C* UI; // 0x320
	UWBP_KeySettingRadioButton_C* Verhicle; // 0x328
	UWBP_KeySettingRadioButton_C* Voice; // 0x330
};

struct USGInventoryComponent : UActorComponent {
	char bInitDefaultItemDeletePrevious : 1; // 0xc8
	char bInital : 1; // 0xc8
	TArray<USGItem*> InventoryItems; // 0xd0
	int32_t InventoryItemMaxAmount; // 0xe0
	char bNeedCheckNewInventoryItemMaxAmount : 1; // 0xe4
	int32_t NewInventoryItemMaxAmount; // 0xe8
	TArray<USGItem*> EquipItems; // 0xf0
	int32_t EquipItemMaxAmount; // 0x100
	TArray<USGItem*> ShortCutItems; // 0x108
	char bIsCraftStructure : 1; // 0x118
	int32_t ShortCutItemMaxAmount; // 0x11c
	int32_t ShortCutShowOnePageAmount; // 0x120
	TArray<USGItem*> CraftItems; // 0x128
	TArray<USGItem*> AutoCraftItems; // 0x138
	USGItem* FunctionItem; // 0x148
	USGItem* FaceliftItem; // 0x150
	USGItem* FuelItem; // 0x158
	TArray<USGItem*> FoodItems; // 0x160
	int32_t FoodItemMaxAmount; // 0x170
	TArray<USGItem*> BattleStoreItems; // 0x178
	int32_t BattleStoreItemMaxAmount; // 0x188
	TArray<USGItem*> CrossServerStoreItems; // 0x190
	int32_t CrossServerStoreItemMaxAmount; // 0x1a0
	FGuid TransportMachineGuid; // 0x1a4
	TMap<USGItem*, int32_t> DefaultInventoryItems; // 0x1b8
	TMap<USGItem*, int32_t> CheatInventoryItems; // 0x208
	TMap<USGItem*, EItemQuality> CheatInventoryItemQuality; // 0x258
	TArray<USGItem*> DefaultEquippedItems; // 0x2a8
	TMap<USGItem*, int32_t> DefaultShortCutItems; // 0x2b8
	TArray<USGItem*> DefaultCraftItems; // 0x308
	int32_t MaxAddGroup; // 0x318
	char bIsDead : 1; // 0x31c
	float UseConsumeItemCD[0x1a]; // 0x328
	FMulticastInlineDelegate OnInventoryAddItem; // 0x390
	FMulticastInlineDelegate OnInventoryRemoveItem; // 0x3a0
	FMulticastInlineDelegate OnInventoryUpdateItem; // 0x3b0
	FMulticastInlineDelegate OnInventoryUpdateItemMaxAmount; // 0x3c0
	FMulticastInlineDelegate OnInventoryUpdateItemMaxBattleAmount; // 0x3d0
	FMulticastInlineDelegate OnInventoryAddEquip; // 0x3e0
	FMulticastInlineDelegate OnInventoryRemoveEquip; // 0x3f0
	FMulticastInlineDelegate OnInventoryUpdateEquip; // 0x400
	FMulticastInlineDelegate OnInventoryAddSlot; // 0x410
	FMulticastInlineDelegate OnInventoryRemoveSlot; // 0x420
	FMulticastInlineDelegate OnInventoryUpdateSlot; // 0x430
	FMulticastInlineDelegate OnInventoryAddPerk; // 0x440
	FMulticastInlineDelegate OnInventoryUpdateFunction; // 0x450
	FMulticastInlineDelegate OnInventoryUpdateFacelift; // 0x460
	FMulticastInlineDelegate OnInventoryUpdateFuel; // 0x470
	FMulticastInlineDelegate OnInventoryAddFood; // 0x480
	FMulticastInlineDelegate OnInventoryRemoveFood; // 0x490
	FMulticastInlineDelegate OnInventoryUpdateFood; // 0x4a0
	FMulticastInlineDelegate OnStoreAddItem; // 0x4b0
	FMulticastInlineDelegate OnStoreRemoveItem; // 0x4c0
	FMulticastInlineDelegate OnStoreUpdateItem; // 0x4d0
	FMulticastInlineDelegate OnInventoryItemChanged; // 0x4e0
	FMulticastInlineDelegate OnInventoryCraftItemPriorityChanged; // 0x4f0
	FMulticastInlineDelegate OnInventoryView; // 0x500
	TArray<TWeakObjectPtr<ASGPlayerController>> RemoteViewingInventoryPlayerControllers; // 0x510
	int32_t MaxItemCraftQueueEntries; // 0x530
	char bAutoCraftingEnabled : 1; // 0x534
	TArray<FItemCraftQueueEntry> ItemCraftQueueEntries; // 0x538
	TArray<USGItem*> OnlyAddItemTemplates; // 0x548
	FTimerHandle CraftTimerHandle; // 0x558
	float CraftProcessInterval; // 0x560
	FTimerHandle ConsumeItemCDHandle; // 0x570
	float ConsumeItemCDInterval; // 0x578
	TArray<FItemAutoCraftQueueEntry> AutoCraftingQueueEntries; // 0x588
	TArray<FItemExpireTimeData> ItemExpireTimeData; // 0x598
	char bCanOpen : 1; // 0x5a8
	char bUseWeight : 1; // 0x5a8
	char bLimitOverWeightTake : 1; // 0x5a8
	float LimitOverWeightTake; // 0x5ac
	float CurWeight; // 0x5b4
	EInventoryFunctions InventoryFunction; // 0x5b8
	TArray<FItemFunctionEntry> ItemFunctionEntries; // 0x5c0
	int32_t DefaultMaxCanCraftAmount; // 0x5d0
	TWeakObjectPtr<ASGPlayerController> OwnerSGPlayerController; // 0x5d4
	char bCanSetPassword : 1; // 0x5dc
	double LastSendClientNotifyTime; // 0x5e0
	char bCanOpenInventorySpecial : 1; // 0x5e8
	char bDebug : 1; // 0x5e8
	float LastCalcExpireTime; // 0x5ec
	float SavedCalcExpireTime; // 0x5f0
	float TickCalcExpiringItemInterval; // 0x5f4
	TArray<int32_t> HighCraftItemIndex; // 0x600
	TArray<int32_t> MiddleCraftItemIndex; // 0x610
	TArray<int32_t> LowCraftItemIndex; // 0x620
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct UGuildKPIItemImageSlot : USGUI {
	UImage* ItemIconImage; // 0x2d8
};

struct UMicroTransactionBase : UPlatformInterfaceBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x38
	FString LastError; // 0x48
	FString LastErrorSolution; // 0x58
};

struct UParticleModuleMeshRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionVector StartRotationRate; // 0x30
};

struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
	FRichCurve WCurve; // 0x1f0
};

struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UN_RemoteFunctionPanel : UUserWidget {
	UN_RemoteFunctionSlot* RemoteFunctionSlotTemplate; // 0x260
	TArray<FText> ItemQualityText; // 0x268
	UTextBlock* NameText; // 0x278
	UTextBlock* LevelText; // 0x280
	UImage* ImgThumbnail; // 0x288
	UCanvasPanel* HPProgressCanvas; // 0x290
	UTextBlock* HPText; // 0x298
	UProgressBar* HPProgressBar; // 0x2a0
	UN_ItemFunctionSlot* FunctionSlot; // 0x2a8
	UN_ItemFaceliftSlot* FaceliftSlot; // 0x2b0
	UVerticalBox* FunctionVertical; // 0x2b8
	UGuildAuthorityComboBox* QualityComboBox; // 0x2c0
	UTextBlock* TbTips; // 0x2c8
	UCanvasPanel* FaceliftPanel; // 0x2d0
	UButton* BtnFacelift; // 0x2d8
	UTextBlock* TbFaceliftWarning; // 0x2e0
	EItemQuality SelectQualityType; // 0x2e8
	UN_RemoteFunctionSlot* FunctionSlotList; // 0x2f0
	TWeakObjectPtr<USGItem> BindItem; // 0x2f8
	TWeakObjectPtr<USGInventoryComponent> BindInventory; // 0x300
	TWeakObjectPtr<ASGStructureFunctionCraft> BindStructureFunctionCraft; // 0x308
	TWeakObjectPtr<ASGStructureFunctionFacelift> BindStructureFunctionFacelift; // 0x310
	TWeakObjectPtr<USGUI> RootUI; // 0x318
};

struct UWBP_PrivateSessionListEntry_C : UUI_PrivateSessionEntry {
	UImage* Image; // 0x2f0
	UImage* Image_1; // 0x2f8
	UImage* ImgClose; // 0x300
	UImage* ImgDetailBottom; // 0x308
	UImage* ImgDetailTop; // 0x310
	UImage* ImgMapListTitle; // 0x318
	UImage* ImgSessionBg; // 0x320
};

struct ABandwidthTestActor : AActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x310
};

struct UMaterialExpressionShadingPathSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct UMaterialExpressionPerInstanceCustomData : UMaterialExpression {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x288
	bool bUpdateVertexNormal; // 0x289
	bool bFaceOutOfScreen; // 0x28a
	FARFaceUpdatePayload ReplicatedPayload; // 0x290
};

struct USoundEffectSourcePresetChain : UObject {
	TArray<FSourceEffectChainEntry> Chain; // 0x28
	char bPlayEffectChainTails : 1; // 0x38
};

struct UInheritableComponentHandler : UObject {
	TArray<FComponentOverrideRecord> Records; // 0x28
	TArray<UActorComponent*> UnnecessaryComponents; // 0x38
};

struct AGameplayAbilityTargetActor_ActorPlacement : AGameplayAbilityTargetActor_GroundTrace {
	UObject* PlacedActorClass; // 0x460
	UMaterialInterface* PlacedActorMaterial; // 0x468
};

struct UMediaComponent : UActorComponent {
	UMediaTexture* MediaTexture; // 0xc0
	UMediaPlayer* MediaPlayer; // 0xc8
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct USCS_Node : UObject {
	UObject* ComponentClass; // 0x28
	UActorComponent* ComponentTemplate; // 0x30
	FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x38
	FName AttachToName; // 0x80
	FName ParentComponentOrVariableName; // 0x88
	FName ParentComponentOwnerClassName; // 0x90
	bool bIsParentComponentNative; // 0x98
	TArray<USCS_Node*> ChildNodes; // 0xa0
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xb0
	FGuid VariableGuid; // 0xc0
	FName InternalVariableName; // 0xd0
};

struct UBTTask_DoFollow : UBTTask_AnimalBase {
	float OverrideBrakingDistance; // 0xd0
};

struct UBTTask_KeepFormation : UBTTask_SGBlueprintBase {
	FBlackboardKeySelector BBKey_DesiredLocation; // 0xc0
	FBlackboardKeySelector BBKey_VirtualStatus; // 0xe8
	char bGetCustomConfigFromCharacter : 1; // 0x110
	float FollowDistance; // 0x114
	float FollowDistanceTolerance; // 0x11c
	FVector2D FollowFinishWaitTimeInRange; // 0x128
	char bIgnoreAgainFollowDistance : 1; // 0x130
	char bUpdateKeepInPlaceLoc : 1; // 0x130
	char bUpdateDesiredLocationOnActor : 1; // 0x130
	char bUpdateDesiredLocationOnFormation : 1; // 0x130
	char bFinishedTask : 1; // 0x130
	char bEnableReachStatuType : 1; // 0x130
	EAIStatusType Enum_ReachStatuType; // 0x131
	char bReachToggleAIMoveOrder : 1; // 0x132
	float UpdateFormationMaxWaitTime; // 0x150
	FVector2D UpdateFormationMaxWaitTimeInRange; // 0x154
	char bUpdateFormationLocation : 1; // 0x2a8
	char bUseSmoothActorLocation : 1; // 0x2a8
	float FormationLocationCapsuleCheckMultiply; // 0x2ac
	float FormationLocationTolerance; // 0x2b0
	float FormationLocationSmoothTolerance; // 0x2b4
	float FormationLocationMaxTolerance; // 0x2b8
	float FormationLocationInterpSpeed; // 0x2bc
	float FormationCustomVelocityInterpSpeed; // 0x2c0
	FVector2D FormationLocationClampSize; // 0x2c4
	FVector2D RotationWaitTimeInRange; // 0x2d8
	FVector2D TurnInPlaceWaitTimeInRange; // 0x2ec
	FVector2D TurnInPlaceAddRotationInRange; // 0x2f4
	char bUpdateFormationRotation : 1; // 0x2fc
	char bUseSmoothActorRotation : 1; // 0x2fc
	float FollowDeltaAngle; // 0x300
	float FormationRotationTolerance; // 0x304
	float FormationRotationInterpSpeed; // 0x30c
	float ImpulseMaxWaitTime; // 0x318
	FVector2D ImpulseMaxWaitTimeInRange; // 0x31c
	FVector2D CollisionMaxWaitTimeInRange; // 0x32c
	float SetActorLocationTolerance; // 0x334
	char bCheckWaitChangeGuard : 1; // 0x338
};

struct ASGBoxProjectile : ASGProjectile {
	UBoxComponent* BoxProjectileCollisionComponent; // 0x6e8
};

struct ASGStructureOccupyFlag : ASGStructure {
	UStaticMeshComponent* OccupySphereComponent; // 0xb98
	USkeletalMeshComponent* FlagSkeletalMeshComponent; // 0xba0
	FSlateBrush SameOrAttackTeamFlagBrush; // 0xba8
	TSoftObjectPtr<UTexture2D> SameOrAttackTeamFlagTexture; // 0xc30
	FLinearColor SameOrAttackTeamFlagColor; // 0xc58
	FSlateBrush DiffOrDefenseTeamFlagBrush; // 0xc68
	TSoftObjectPtr<UTexture2D> DiffOrDefenseTeamFlagTexture; // 0xcf0
	FLinearColor DiffOrDefenseTeamFlagColor; // 0xd18
	FSlateBrush NoTeamFlagBrush; // 0xd28
	TSoftObjectPtr<UTexture2D> NoTeamFlagTexture; // 0xdb0
	FLinearColor NoTeamFlagColor; // 0xdd8
	FSlateBrush DiffOrDefenseTeamLockFlagBrush; // 0xde8
	TSoftObjectPtr<UTexture2D> DiffOrDefenseTeamLockFlagTexture; // 0xe70
	FLinearColor DiffOrDefenseTeamLockFlagColor; // 0xe98
	UStaticMesh* NeutralStaticMesh; // 0xea8
	UStaticMesh* AttackFlagStaticMesh; // 0xeb0
	UStaticMesh* DefenseStaticMesh; // 0xeb8
	USkeletalMesh* NeutralSkeletalMesh; // 0xec0
	USkeletalMesh* AttackFlagSkeletalMesh; // 0xec8
	USkeletalMesh* DefenseSkeletalMesh; // 0xed0
	float OccupyTimeInterval; // 0xed8
	float OccupyNotifyInterval; // 0xedc
	float CheckOccupyTimeInterval; // 0xee0
	float CheckOccupyRadius; // 0xee4
	EFlagOccupyType FlagOccupyType; // 0xee8
	char bHasNoTeamStateInPingPang : 1; // 0xee9
	float fPlayerOccupySpeed; // 0xeec
	int32_t PlayerOccupySpeedNumLimit; // 0xef0
	int32_t MaxOccupyCount; // 0xef4
	TArray<AActor*> RelatedActors; // 0xef8
	EOccupyPreConditionType OccupyPreConditionType; // 0xf08
	TArray<AActor*> PreConditionActors; // 0xf10
	float AddBattleTime; // 0xf20
	int32_t ClientShowOrderPriority; // 0xf24
	FOccupyFlagInfo OccupyFlagInfo; // 0xf28
	char CacheInitGenericTeamId; // 0xf38
	FMulticastInlineDelegate OnOccupyFlagInfoChanged; // 0xf70
	FMulticastInlineDelegate OnOccupyFlagMaxOccupyCountChanged; // 0xf80
	FMulticastInlineDelegate OnOccupyFlagGenericTeamIdChanged; // 0xf90
	float LastTimeSeconds; // 0xfa0
	float LastUpdateLeftOccupyTimer; // 0xfa4
};

struct UChargeAIAttackState : UMeleeAIAttackState {
	float ChargeDurationTime; // 0x108
	float ChargingSpeedMulAdd; // 0x10c
	float ChargingAccelerationMulAdd; // 0x110
};

struct UCloudChunkDataSubSystem : UGameInstanceSubsystem {
	TMap<FGuid, FCloudChunkData> CloudChunkDataDict; // 0x30
};

struct UGuildEventColumn : UUserWidget {
	float BaseConflictImgLength; // 0x260
	float ExtraConflictImgLength; // 0x264
	UImage* IconImg; // 0x268
	UTextBlock* EventGuildTypeText; // 0x270
	UImage* ConflictImg; // 0x278
	UButton* DetailBtn; // 0x280
	UTextBlock* ConflictTb; // 0x288
	UTextBlock* DescriptionTb; // 0x290
	UButton* DeclareWarBtn; // 0x298
	TWeakObjectPtr<UUI_GuildEvent> ParentGuildEventUI; // 0x2a0
	EEventGuildType EventGuildType; // 0x2a8
	FText DescriptionText; // 0x2b0
};

struct UABP_HorseMC_C : USG_AnimalsAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0xff0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0xff8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x10c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x11a8
	FAnimNode_Slot AnimGraphNode_Slot_12; // 0x1300
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1348
	FAnimNode_Slot AnimGraphNode_Slot_11; // 0x1408
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1450
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1478
	FAnimNode_Root AnimGraphNode_Root_5; // 0x14a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x14d0
	FAnimNode_Slot AnimGraphNode_Slot_10; // 0x1628
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1670
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1698
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1758
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x1780
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x1868
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x1950
	FAnimNode_Root AnimGraphNode_Root_4; // 0x1a18
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1a48
	FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x1b60
	FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x1cf0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1e80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1f88
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0x2090
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x24d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2910
	FAnimNode_Root AnimGraphNode_Root_3; // 0x2990
	FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x29c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x3010
	FSGAnimNode_ModifyBone SGAnimGraphNode_ModifyBone; // 0x3030
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x3118
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x3138
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x3158
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3180
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x3220
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x3240
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x3398
	FAnimNode_Root AnimGraphNode_Root_2; // 0x33c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x33f0
	FAnimNode_Slot AnimGraphNode_Slot_9; // 0x3548
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x3590
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x35b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x3678
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x36a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x36c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x36f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x3718
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x3740
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x3768
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x3790
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x37b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x37e0
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x38c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x38f8
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x39e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x3a10
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x3af8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x3b28
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x3bf0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x3cd8
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x3dc0
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_3; // 0x3df0
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x3e08
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x3e38
	FAnimNode_Root AnimGraphNode_Root; // 0x3ee8
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0x3f18
	FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4; // 0x3f60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x4010
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x4038
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x4060
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x4088
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x40b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x40d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x4100
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x4128
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0x4150
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0x4178
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0x41a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0x41c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0x41f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0x4218
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0x4240
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0x4268
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x4290
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x42b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x42e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x4308
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x4330
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x4358
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x4380
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x43a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x43d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x43f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x4420
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x4448
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x4470
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x4498
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x44c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x44e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x4510
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x4538
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x4560
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x4588
	FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3; // 0x45b0
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x4660
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x4690
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x46b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x46e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x4708
	FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2; // 0x4730
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x47e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x4810
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x48f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x4928
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x4950
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x4978
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_2; // 0x49a0
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x4a30
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x4a60
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x4af0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x4b20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x4b48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4b70
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x4bf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x4c20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x4c48
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x4c70
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x4cc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4d88
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4e08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4e38
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x4eb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x4ee8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x4f10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x4f38
	FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer; // 0x4f60
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x5010
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x5040
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x5088
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x50d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x5118
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x5140
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x5168
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x5190
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x51b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x51e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x5208
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x5230
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x5258
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x5340
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x5370
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x5458
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x5488
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x5570
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x55a0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x5688
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x56b8
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x56d0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x5700
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x57b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x57e0
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x5808
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5820
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5850
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x5900
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x5948
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x5a10
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x5a60
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x5aa8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x5c00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x5c28
	FSGAnimNode_LayeredBoneBlend SGAnimGraphNode_LayeredBoneBlend; // 0x5c50
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x5d10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x5dd8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x5e00
	FAnimNode_Slot AnimGraphNode_Slot; // 0x5e48
	FVector tail; // 0x5e90
	bool EnableTail; // 0x5e9c
	FSGInputBlendPose Struct_DamageBoneLayerConfig; // 0x5ea0
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UHorizonRadioButtonUserWidget : UHorizonDesignableUserWidget {
	FMulticastInlineDelegate OnCheckedDelegate; // 0x260
	FMulticastInlineDelegate OnUnCheckedDelegate; // 0x270
	UCheckBox* CheckBox_Main; // 0x2b0
	UTextBlock* TextBlock_Main; // 0x2b8
	FText Text_Main; // 0x2c0
	bool bCheckedByDefault; // 0x2d8
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UNpcSpawnTemplate : UObject {
	TArray<FNPCSpawnData> NPCSpawnDatas; // 0x28
	TArray<FNPCSpawnLimit> NPCSpawnLimits; // 0x38
};

struct UGizmoLineHandleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x4a8
	float HandleSize; // 0x4b4
	float Thickness; // 0x4b8
	FVector Direction; // 0x4bc
	float Length; // 0x4c8
	bool bImageScale; // 0x4cc
};

struct URetainerBox : UContentWidget {
	bool bRetainRender; // 0x120
	bool RenderOnInvalidation; // 0x121
	bool RenderOnPhase; // 0x122
	int32_t Phase; // 0x124
	int32_t PhaseCount; // 0x128
	UMaterialInterface* EffectMaterial; // 0x130
	FName TextureParameter; // 0x138
};

struct AGeometryCollectionRenderLevelSetActor : AActor {
	UVolumeTexture* TargetVolumeTexture; // 0x310
	UMaterial* RayMarchMaterial; // 0x318
	float SurfaceTolerance; // 0x320
	float Isovalue; // 0x324
	bool Enabled; // 0x328
	bool RenderVolumeBoundingBox; // 0x329
};

struct UMaterialExpressionTextureSampleParameterSubUV : UMaterialExpressionTextureSampleParameter2D {
	char bBlend : 1; // 0x80
};

struct UNiagaraDataInterfaceRenderTarget2D : UNiagaraDataInterfaceRWBase {
	FIntPoint Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe0
	char bOverrideFormat : 1; // 0xe1
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x108
};

struct USGGameDataAchievement : USGGameDataConditionReward {
	TMap<FString, int32_t> AchievementNumMap; // 0x98
	TMap<FString, USGAchievement*> AchievementConfigs; // 0xe8
};

struct UVehiclePerkDragDropOperation : UDragDropOperation {
	TWeakObjectPtr<USGVehiclePerk> BindVehiclePerk; // 0x88
};

struct ULiveLinkSubjectSettings : UObject {
	TArray<ULiveLinkFramePreProcessor*> PreProcessors; // 0x28
	ULiveLinkFrameInterpolationProcessor* InterpolationProcessor; // 0x38
	TArray<ULiveLinkFrameTranslator*> Translators; // 0x40
	ULiveLinkRole* Role; // 0x50
	FFrameRate FrameRate; // 0x58
	bool bRebroadcastSubject; // 0x60
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct USystemSettingItemTips : USGToolTipWidget {
	UTextBlock* TbTipsContent; // 0x288
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x518
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x488
	UBodySetup* BrushBodySetup; // 0x490
};

struct UGeneralWagesPanel : UUserWidget {
	FBaseGeneralChunkData BindGeneralChunkData; // 0x260
	TWeakObjectPtr<UUI_N_General> ParentUI; // 0x348
	UTextBlock* LeftWagesTimesText; // 0x350
	UTextBlock* NextUseWagesText; // 0x358
	UTextBlock* LeftWagesTimes; // 0x360
	UTextBlock* WagesNeedText; // 0x368
	UEditableText* WagesEditText; // 0x370
	UButton* AcceptButton; // 0x378
	UButton* CancelButton; // 0x380
	USlider* WagesSlider; // 0x388
	UVerticalBox* MainVertical; // 0x390
	UTextBlock* Description; // 0x398
	char bIsEnoughCapital : 1; // 0x3a0
	char bTodayCanGiveWages : 1; // 0x3a0
	int32_t WantGiveWages; // 0x3a4
	float ToolTipsDescriptionTextWrapDelta; // 0x3a8
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UMaterialExpressionLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x208
	char bSupportsDepth : 1; // 0x208
	char bNoAlphaChannel : 1; // 0x208
	UTexture* Texture; // 0x210
	UTexture* LeftTexture; // 0x218
	char bQuadPreserveTextureRatio : 1; // 0x220
	FVector2D QuadSize; // 0x224
	FBox2D UVRect; // 0x22c
	float CylinderRadius; // 0x240
	float CylinderOverlayArc; // 0x244
	int32_t CylinderHeight; // 0x248
	FEquirectProps EquirectProps; // 0x24c
	EStereoLayerType StereoLayerType; // 0x294
	EStereoLayerShape StereoLayerShape; // 0x295
	UStereoLayerShape* Shape; // 0x298
	int32_t Priority; // 0x2a0
};

struct UUI_BenchmarkScalability : USGUI {
	UTextBlock* TbBenchmarkScalability; // 0x2d8
	UButton* BtnReturn; // 0x2e0
	UButton* BtnOpenSystemSetting; // 0x2e8
};

struct UNiagaraDataInterfaceGrid3D : UNiagaraDataInterfaceRWBase {
	FIntVector NumCells; // 0xd8
	float CellSize; // 0xe4
	int32_t NumCellsMaxAxis; // 0xe8
	ESetResolutionMethod SetResolutionMethod; // 0xec
	FVector WorldBBoxSize; // 0xf0
};

struct USGConditionReward : UObject {
	TArray<URewardCondition*> Conditions; // 0x28
	USGReward* Reward; // 0x38
};

struct ASGStructure : ASGGamePlayActor {
	USceneComponent* StructureRootComponent; // 0x518
	UStaticMeshComponent* StructureStaticMeshComponent; // 0x520
	UPointLightComponent* StructurePointLightComponent; // 0x528
	int32_t Level; // 0x530
	char bPreviewStructure : 1; // 0x534
	TArray<UMaterialInstanceDynamic*> PreviewInstances; // 0x538
	UMaterialInterface* PreviewCreateMaterial; // 0x548
	UStaticMesh* PreviewCreateMesh; // 0x550
	TArray<UMaterialInterface*> PreviewCreateMeshMaterial; // 0x558
	TArray<UMaterialInterface*> PreviewCreateMeshErrorMaterial; // 0x568
	char bDeletePreviewCreateMeshWhenFinish : 1; // 0x578
	char bShowParticleWhenCreatePreview : 1; // 0x578
	char bForceCreateOnGround : 1; // 0x578
	char bForceCreateOnFloor : 1; // 0x578
	char bCheckOtherPointOnFloor : 1; // 0x578
	float MaxCreateRange; // 0x57c
	int32_t BindType; // 0x580
	TArray<FBindPointInfo> BindPoints; // 0x588
	float SearchBindPointRadius; // 0x598
	float MaxBindPointRadius; // 0x59c
	char bBindPointTransRotation : 1; // 0x5a0
	FVector CreateHitLocationOffset; // 0x5a4
	FVector CreateCheckBox; // 0x5b0
	FVector CreateCheckBoxOffset; // 0x5bc
	FRotator CreateCheckBoxRotOffset; // 0x5c8
	FVector CreateCheckBoxScale; // 0x5d4
	FVector OtherCreateCheckBox; // 0x5e0
	FVector OtherCreateCheckBoxOffset; // 0x5ec
	FVector OtherPointOnFloorLocation; // 0x5f8
	TArray<FVector> CreateCheckDirections; // 0x608
	FVector SimpleFoundationBox; // 0x618
	FVector SimpleBoxLocOffset; // 0x624
	TArray<UStaticMesh*> MeshForSimple; // 0x630
	char bNeedBindPointForCreate : 1; // 0x640
	char bCreateSelectDirection : 1; // 0x640
	float MaxHeightToWorldGround; // 0x644
	float OfficalRoadOffset; // 0x648
	char bFoundation : 1; // 0x64c
	char bSimpleFoundation : 1; // 0x64c
	char bWall : 1; // 0x64c
	char bXianChengDoor : 1; // 0x64c
	char bOutDoor : 1; // 0x64c
	char bFloor : 1; // 0x64c
	char bPillar : 1; // 0x64c
	char bGuildShop : 1; // 0x64c
	int32_t GuildShopLevel; // 0x650
	char bGuildAuctionHouse : 1; // 0x654
	char bNeedNearByFoundation : 1; // 0x654
	float MaxDistanceBindPointNearByFoundation; // 0x658
	char bOnlyFoundationWhenBindedToFoundation : 1; // 0x65c
	ASGStructure* CanReplaceByStructureClass; // 0x660
	ASGStructure* PreventReplaceByStructureClass; // 0x668
	char bMovableStructure : 1; // 0x670
	UShapeComponent* TriggerBoxComponent; // 0x678
	float TriggerBoxDamageInterval; // 0x680
	float TriggerBoxDamageAmount; // 0x684
	float TriggerBoxCollectionDamageAmount; // 0x688
	float TriggerBoxCollectionReduceHPPercent; // 0x68c
	float TriggerBoxDamageReduceHPPercent; // 0x690
	float TriggerBoxDamageImpulse; // 0x694
	USGDamageType* TriggerBoxDamageType; // 0x698
	char bTriggerBoxCollection : 1; // 0x6a0
	char bNeedPlayerInputForCollection : 1; // 0x6a0
	char bDoNotUseSceneObjectSearchForCollect : 1; // 0x6a0
	char bNeedPlayerInputForDamage : 1; // 0x6a0
	char bShowMiniMapPOI : 1; // 0x6a0
	FString MiniMapPOIStyleID; // 0x6a8
	EMiniMapStructureVisibleType MiniMapPOIVisibleType; // 0x6b8
	char bForceCreateOnWall : 1; // 0x6b9
	char bCanBebDemolished : 1; // 0x6b9
	float CheckFloorZUp; // 0x6bc
	float CheckFloorZDown; // 0x6c0
	FName SpawnSoundID; // 0x6c4
	char bAllowPlacingOnOtherGuildStructure : 1; // 0x6cc
	float CheckEnemyFoundationRadius; // 0x6d0
	char bCheckNearByEnemyFoundation : 1; // 0x6d4
	char bPreventNearByEnemyFoundation : 1; // 0x6d4
	char bPreventCreateOnFloor : 1; // 0x6d4
	char bCreateOnGroundWhenBinded : 1; // 0x6d4
	char bRealFoundation : 1; // 0x6d4
	char bFoundationStack : 1; // 0x6d4
	char bCreateHPByInterval : 1; // 0x6d4
	float InitHPPercentageWhenCreate; // 0x6d8
	float CreateHPInterval; // 0x6dc
	float CreateHPPerInterval; // 0x6e0
	char bOnlyCreateInWater : 1; // 0x6e4
	char bCannotCreateInWater : 1; // 0x6e4
	FVector CheckWaterLocationOffset; // 0x6e8
	float CheckMinWaterHeight; // 0x6f4
	float CheckEnemyPlayerRadius; // 0x6f8
	TArray<FString> AllowRotationMarkList; // 0x700
	FString NeedRotationMark; // 0x710
	char bCreateInTimeRange : 1; // 0x720
	int32_t AllowCreateStartHour; // 0x724
	int32_t AllowCreateEndHour; // 0x728
	TArray<ASGStructure*> IgnorePreventStructureClasses; // 0x730
	char bPreventOtherCreate : 1; // 0x740
	char bAllowAttachToStaticMeshSocket : 1; // 0x740
	FName AttachToStaticMeshSocketName; // 0x744
	char bGuildStructure : 1; // 0x74c
	int32_t GuildStructureUniqueId; // 0x750
	int32_t RequireGuildLevel; // 0x754
	float GuildCreateCoolTime; // 0x758
	TArray<FGuildStructureSetting> GuildStructureSettings; // 0x760
	char bPersonalStructure : 1; // 0x770
	int32_t PersonalStructureUniqueId; // 0x774
	int32_t PersonalStructureMaxNum; // 0x778
	ASGStructure* AddPersonalStructureMaxNumClass; // 0x780
	char bUseGroundTraceNormal : 1; // 0x788
	char bPerkStructure : 1; // 0x788
	char bIgnoreEnemyFoundationWhenPerk : 1; // 0x788
	char bPerkStructureSetPlayerOwnerId : 1; // 0x788
	char bPerkStructureHiddenWhenBuilded : 1; // 0x788
	char bUsePerkStructureRotation : 1; // 0x788
	char bPerkSelectDirection : 1; // 0x788
	char IgnoreStructureCheckVolumes : 1; // 0x788
	int32_t PerkStructureCreateCoolTime; // 0x78c
	FVector SpawnPerkStructureLocationOffset; // 0x790
	TArray<TWeakObjectPtr<ASGStructureCheckVolume>> LinkStructureCheckVolumes; // 0x7a0
	float GivingItemFromDemolishPercentage; // 0x7d0
	TArray<ASGStructure*> EnvironmentAllowStructureClasses; // 0x7d8
	char bOnlyInteractiveInventorySameTeam : 1; // 0x7e8
	char bCannotOperateInCountryCombat : 1; // 0x7e8
	ASGStructureFrame* LinkFrameStructure; // 0x7f0
	char bIgnoreMaxStructureNumInRadius : 1; // 0x7f8
	char bCanRepair : 1; // 0x7f8
	char bRepairing : 1; // 0x7f8
	double NextAllowRepairTime; // 0x800
	int32_t RepairCooldownTime; // 0x808
	float RepairInterval; // 0x80c
	float RepairHPPerInterval; // 0x810
	float RepairHPRemainRep; // 0x814
	float RepairHPRemain; // 0x818
	FTimerHandle RepairHandle; // 0x820
	float RepairHPPerMul; // 0x828
	USGItem* ConsumeItem; // 0x830
	char bOccupyStructure : 1; // 0x838
	char bCheckOtherTeamArea : 1; // 0x838
	char bOnlyInMyTeamArea : 1; // 0x838
	float CheckOtherTeamAreaRadius; // 0x83c
	char bDecay : 1; // 0x840
	char bInnerStructure : 1; // 0x840
	char bNeedDecay : 1; // 0x840
	char bInOtherOccupyArea : 1; // 0x840
	float NoTeamAreaDecayInterval; // 0x844
	float NoTeamAreaDecayHPPercent; // 0x848
	float TeamAreaDecayInterval; // 0x84c
	float TeamAreaDecayHPPercent; // 0x850
	float DecayHP; // 0x854
	FTimerHandle DecayStructureHandle; // 0x858
	char bGiveCauserDamage : 1; // 0x860
	float GiveCauserDamageImpulse; // 0x864
	float GiveCauserDamage; // 0x868
	TArray<USGDamageType*> PreventGiveCauserDamageTypes; // 0x870
	USGDamageType* GiveCauserDamageType; // 0x880
	EDamageType AttackDamageType; // 0x888
	FName BeAIAttackSocketName; // 0x88c
	char bAllowCreateOnPlatform : 1; // 0x894
	ABaseCharacter* PlatformCharacter; // 0x898
	float PlatformWeightMul; // 0x8a0
	char bAllowLogicInactive : 1; // 0x8a4
	char bLogicInactiveDestroy : 1; // 0x8a4
	double LastLogicInactiveTime; // 0x8a8
	float TotalLogicInactiveTime; // 0x8b0
	FDateTime LastLogicInactiveDateTime; // 0x8b8
	char bLogicInactive : 1; // 0x8c0
	TArray<TWeakObjectPtr<UActorComponent>> LogicInactiveUnRegisteredComponents; // 0x940
	char bParentManageLogicActive : 1; // 0x950
	char bPendingDeadWhenInActive : 1; // 0x960
	FString OwnerPlayerName; // 0x968
	FString OwnerName; // 0x978
	uint32_t StructureID; // 0x988
	TArray<uint32_t> BindedStructuresByID; // 0x990
	TArray<ASGStructure*> BindedStructures; // 0x9a0
	TArray<ASGStructure*> StructuresOnFloor; // 0x9b0
	ASGStructure* CreateOnFloorStructure; // 0x9c0
	char bPendingRemove : 1; // 0x9c8
	char bChangeFoundation : 1; // 0x9c8
	char bHiddenInGame : 1; // 0x9c8
	char bDoNotRestPerkLink : 1; // 0x9c8
	ASGStructure* LinkPerkStructure; // 0x9d0
	AActor* LinkPerkSpawnedActor; // 0x9d8
	double LastPerkStructureCreateTime; // 0x9e0
	TArray<TWeakObjectPtr<AActor>> TriggerOverlapActors; // 0x9e8
	FTimerHandle TriggerHandle; // 0x9f8
	ASGStructure* LastPreventStructure; // 0xa08
	TArray<UMaterialInterface*> PreventStructureMaterials; // 0xa10
	char bGuildStoreStructure : 1; // 0xa28
	char bDemolished : 1; // 0xa28
	char bSetMovable : 1; // 0xa28
	FText HelpText; // 0xa30
	char bIgnoreStructureAuthority : 1; // 0xa48
	char bCanSetStructureAuthority : 1; // 0xa48
	int32_t StructureAuthority; // 0xa4c
	int32_t CurrentStructureProssessAuth; // 0xa50
	int32_t CurrentStructureAllianceDoor; // 0xa54
	int32_t CurrentStructureAllianceInventory; // 0xa58
	int32_t CurrentStructureAllianceCreate; // 0xa5c
	UUserWidget* DisplayHUDShowWidgetTemplate; // 0xa60
	char bUseDestructibleExplode : 1; // 0xa68
	UCurveFloat* OverrideExplodeAmountLerpCurve; // 0xa70
	FVector OverrideExplodeDirection; // 0xa78
	float OverrideExplodeInterval; // 0xa84
	char bShowStructureDebugInfo : 1; // 0xa88
	float CreateHPRemain; // 0xa8c
	FTimerHandle CreateHPHandle; // 0xa90
	float CreateHPRemainRep; // 0xa98
	int32_t BindPointNum; // 0xa9c
	int32_t NextBindPointIndex; // 0xaa0
	AActor* SpawnActorTemplate; // 0xaa8
	ASplineRouteActor* SplineRouteActor; // 0xab0
	char bUseAutoFollowSplineRoute : 1; // 0xab8
	float DamageToStructure; // 0xabc
	char bNPCSpawnIgnoreCheck : 1; // 0xb00
	float PlatformMultiplyAdd; // 0xb04
	char bDamageAddSkillExp : 1; // 0xb08
	float CreatedSkillExp; // 0xb0c
	float GuildEventCheckInterval; // 0xb10
	FTimerHandle GuildEventCheckHandle; // 0xb18
	char bUseGuildImage : 1; // 0xb20
	TArray<FName> GuildImageMaterialNames; // 0xb28
	float FlagImageModifies[0x5]; // 0xb38
	FString GuildImage; // 0xb50
	TWeakObjectPtr<UStaticMeshComponent> GuildImageMeshComponent; // 0xb60
	UMaterialInstanceDynamic* DMI_FlagImage; // 0xb68
	UTextureRenderTarget2D* RT_FlagImage; // 0xb70
	char bUseCustomFlag : 1; // 0xb78
	FString FlagImageString; // 0xb80
	char bCanClimb : 1; // 0xb90
};

struct UUI_BattleAward : USGUI {
	UBattleAwardItemSlot* BattleAwardItemSlotClass; // 0x2d8
	UUniformGridPanel* AwardItemsGridBox; // 0x2e0
	int64_t ReceiveMouseDownTicks; // 0x2e8
};

struct UInterpTrackAnimControl : UInterpTrackFloatBase {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct AArchVisCharacter : ACharacter {
	FString LookUpAxisName; // 0x5c8
	FString LookUpAtRateAxisName; // 0x5d8
	FString TurnAxisName; // 0x5e8
	FString TurnAtRateAxisName; // 0x5f8
	FString MoveForwardAxisName; // 0x608
	FString MoveRightAxisName; // 0x618
	float MouseSensitivityScale_Pitch; // 0x628
	float MouseSensitivityScale_Yaw; // 0x62c
};

struct USmoothHoleFillProperties : UInteractiveToolPropertySet {
	bool bConstrainToHoleInterior; // 0x60
	int32_t RemeshingExteriorRegionWidth; // 0x64
	int32_t SmoothingExteriorRegionWidth; // 0x68
	int32_t SmoothingInteriorRegionWidth; // 0x6c
	float InteriorSmoothness; // 0x70
	double FillDensityScalar; // 0x78
	bool bProjectDuringRemesh; // 0x80
};

struct UBTService_SGBlueprintBase : UBTService_BlueprintBase {
	ASG_AIController* SG_AIController; // 0x98
	ASGGeneralAIController* SG_GeneralAIController; // 0xa0
	ASGGeneralCharacter* SG_GeneralCharacter; // 0xa8
};

struct UPreviewSceneWidget : UUserWidget {
	FTimerHandle PreviewMontageHandle; // 0x260
	float FOV; // 0x270
	UMaterialInstanceDynamic* DynamicMaterial; // 0x278
	UMaterialInterface* BaseMaterial; // 0x280
	FVector MeshLocation; // 0x288
	FVector MeshLocationOffset; // 0x294
	FRotator MeshRotation; // 0x2a0
	FRotator OrbitRotation; // 0x2ac
	float PreviewScale; // 0x2b8
	FVector CameraPivotOffset; // 0x2bc
	float CameraDistance; // 0x2c8
	float BrakeSpeed; // 0x2cc
	float RotationSpeed; // 0x2d0
	FRotator AutoRotator; // 0x2d4
	UAnimMontage* DefaultAnim; // 0x2e0
	UWorld* GameWorld; // 0x2e8
	TArray<USceneComponent*> PreviewComponents; // 0x2f0
	FVector2D RotationVelocity; // 0x300
	FPreviewCharacterStruct PreviewCharacterStruct; // 0x308
	UWorld* PreviewWorld; // 0x348
	USceneCaptureComponent2D* CaptureComponent; // 0x350
};

struct UPrivateSessionPassword : UUserWidget {
	UEditableTextBox* EtbPassword; // 0x260
	UButton* BtnConfirm; // 0x268
	UButton* BtnCancel; // 0x270
};

struct UFontImportOptions : UObject {
	FFontImportOptionsData Data; // 0x28
};

struct UMaterialExpressionTruncate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UDatasmithCineCameraActorTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x30
};

struct ULenovoQueryOption : UUserWidget {
	TSoftObjectPtr<UTexture2D> NormalBackgroundTexture; // 0x260
	TSoftObjectPtr<UTexture2D> HoverBackgroundTexture; // 0x288
	TSoftObjectPtr<UTexture2D> SelectedBackgroundTexture; // 0x2b0
	FLinearColor NormalBackgroundColor; // 0x2d8
	FLinearColor HoverBackgroundColor; // 0x2e8
	FLinearColor SelectedBackgroundColor; // 0x2f8
	UButton* BtnBg; // 0x338
	UImage* ImgBg; // 0x340
	UTextBlock* TbOption; // 0x348
	char bSelected : 1; // 0x350
	char bHovered : 1; // 0x350
	int32_t BindOptionIndex; // 0x354
	int32_t BindIndex; // 0x358
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x310
};

struct UMagicLeapHeadTrackingNotificationsComponent : UVRNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x150
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x160
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x170
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x180
};

struct UPlaneCutTool : UMultiSelectionTool {
	UPlaneCutToolProperties* BasicProperties; // 0x98
	UAcceptOutputProperties* AcceptProperties; // 0xa0
	FVector CutPlaneOrigin; // 0xa8
	FQuat CutPlaneOrientation; // 0xc0
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xd0
	TArray<UDynamicMeshReplacementChangeTarget*> MeshesToCut; // 0xe0
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
};

struct AStaticMeshFloatingActor : AStaticMeshActor {
	UBoxComponent* FloatingBox; // 0x320
	FVector2D WaterResistanceRange; // 0x328
	FVector2D MinWaterResistanceRange; // 0x330
	float FloatingForce; // 0x338
	float MeshMass; // 0x33c
	FVector CenterOfMassOffset; // 0x340
	EWaveShape DefaultWaveShape; // 0x34c
	float DefaultWaveStrength; // 0x350
	float DefaultWaveSizePercent; // 0x354
	TArray<FWaveConfigData> WaveData; // 0x358
	FRotator WaveRotator; // 0x368
};

struct UUI_TransGuildActivityPoint : USGUI {
	UTextBlock* TransferPointText; // 0x2d8
	UTextBlock* GongXunPointText; // 0x2e0
	UTextBlock* ToDayLeftText; // 0x2e8
	UButton* ReducePointButton; // 0x2f0
	UButton* AddPointButton; // 0x2f8
	UButton* SubmitButton; // 0x300
	UButton* CancelButton; // 0x308
	USlider* TransferSlider; // 0x310
};

struct UOnlinePIESettings : UDeveloperSettings {
	bool bOnlinePIEEnabled; // 0x38
	TArray<FPIELoginSettingsInternal> Logins; // 0x40
};

struct UPaperFlipbookComponent : UMeshComponent {
	UPaperFlipbook* SourceFlipbook; // 0x4b0
	UMaterialInterface* Material; // 0x4b8
	float PlayRate; // 0x4c0
	char bLooping : 1; // 0x4c4
	char bReversePlayback : 1; // 0x4c4
	char bPlaying : 1; // 0x4c4
	float AccumulatedTime; // 0x4c8
	int32_t CachedFrameIndex; // 0x4cc
	FLinearColor SpriteColor; // 0x4d0
	UBodySetup* CachedBodySetup; // 0x4e0
	FMulticastInlineDelegate OnFinishedPlaying; // 0x4e8
};

struct UN_AppearanceSlot : UN_InventorySlot {
	UImage* InUseBg; // 0xf80
	UTextBlock* InUseText; // 0xf88
	float LockBgAlpha; // 0xf90
	TSoftObjectPtr<UTexture2D> ExpiredIcon; // 0xf98
	ECharacterAppearanceType AppearanceItemType; // 0xfc0
	USGItem* ItemTemplateForShow; // 0xfd0
};

struct UBTTask_DoSleep : UBTTask_AnimalBase {
	float FarBrakingDistance; // 0xd0
	float ProjectToNavInterval; // 0xd4
	float LastProjectToNavTime; // 0xe0
	FVector DesiredLocationToNavigation; // 0xe4
};

struct UUI_SeasonQuest : UUserWidget {
	UTextBlock* QuestNameText; // 0x260
