// Created by BlueFire1337
// Updated 2021-12-01
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x3752b7c;
	constexpr auto GObjects = 0x3752bec;
	constexpr auto UEngine = 0x3768130;
	constexpr auto DecryptionKey = 0x3ff;
}

struct UUIComponent_Rotator : UUIComponent_Display {
	int32_t m_nTickHandle; // 0x124
	float m_fRotationDegreesPerSecond; // 0x128
};

struct UTgSeqAct_SetHexState : USequenceAction {
	char m_bChallengerWon : 1; // 0x108
};

struct UTgDeviceForm_HexaFireGuns : UTgDeviceForm {
	ObjectProperty m_SpinnerSkelControl1P; // 0x28c
	ObjectProperty m_SpinnerSkelControl3P; // 0x294
	int32_t m_nNextGunFired; // 0x29c
	FName c_nmSocket1; // 0x2a0
	FName c_nmSocket2; // 0x2a8
	FName c_nmSocket3; // 0x2b0
	FName c_nmSocket4; // 0x2b8
	ObjectProperty m_LowerRightBarrel1P; // 0x2c0
	ObjectProperty m_UpperRightBarrel1P; // 0x2c8
	ObjectProperty m_LowerLeftBarrel1P; // 0x2d0
	ObjectProperty m_UpperLeftBarrel1P; // 0x2d8
	ObjectProperty m_LowerRightBarrel3P; // 0x2e0
	ObjectProperty m_UpperRightBarrel3P; // 0x2e8
	ObjectProperty m_LowerLeftBarrel3P; // 0x2f0
	ObjectProperty m_UpperLeftBarrel3P; // 0x2f8
};

struct USeqAct_CameraFade : USequenceAction {
	FColor FadeColor; // 0x108
	FVector2D FadeAlpha; // 0x10c
	float FadeOpacity; // 0x114
	float FadeTime; // 0x118
	char bPersistFade : 1; // 0x11c
	char bFadeAudio : 1; // 0x11c
	float FadeTimeRemaining; // 0x120
	TArray<ObjectProperty> CachedPCs; // 0x124
};

struct UTgAIBehaviorCondition_SelectedTargetHealthPercent : UTgAIBehaviorCondition_DistanceBase {
	char bMustBeEnemy : 1; // 0x9c
	char bIgnoreTaskforce : 1; // 0x9c
	ETargetSelector TargetSelector; // 0xa0
	ECombatTargetType TargetType; // 0xa1
	int32_t TargetId; // 0xa4
	float HealthPct; // 0xa8
};

struct UUIScene_UIStreetStyleEvent : UUIScene {
	ObjectProperty m_pTabs; // 0x1cc
	ObjectProperty m_pBack; // 0x1d4
	ObjectProperty m_pHome; // 0x1dc
	ObjectProperty m_pRewards; // 0x1e4
	ObjectProperty m_pQuests; // 0x1ec
	ObjectProperty m_pOverview; // 0x1f4
	ObjectProperty m_pRotator; // 0x1fc
};

struct APortal : ATriggerVolume {
	ObjectProperty Destination; // 0x2bc
	FRotator SourceEdgeRotation; // 0x2c4
	FVector SourceEdgeTranslation; // 0x2d0
	float fEdgeWidth; // 0x2dc
	char bForceParallelEdges : 1; // 0x2e0
};

struct UUIScene_UIPurchaseGems : UUIScene {
	Fdword m_dwVendorRequestId; // 0x1cc
};

struct ATgDevice_SleightOfHand : ATgDevice {
	ObjectProperty m_InhandWeapon; // 0xa04
};

struct ATgDevice_SevenInhand : ATgDevice {
	int32_t m_nBurstModTotalShots[0x5]; // 0xa04
};

struct UTgControlModule_ThirdPerson : UTgControlModule {
	int32_t CameraYawOffset; // 0x6c
	float fRotInterpSpeed; // 0x70
	float fAimPitch; // 0x74
	FInterpCurveFloat PitchCurve; // 0x78
	FInterpCurveFloat AimCurve; // 0x8c
	ObjectProperty m_StrafeCameraAnim; // 0xa0
	ObjectProperty m_CameraAnimStrafeRight; // 0xa8
	ObjectProperty m_CameraAnimStrafeLeft; // 0xb0
	float fOrientationResetStartPitch; // 0xb8
	float fOrientationResetRemaining; // 0xbc
	float fOrientationResetDuration; // 0xc0
	float fOrientationResetCooldown; // 0xc4
	float fOrientationResetLastUsed; // 0xc8
};

struct ATgGame : AFrameworkGame {
	UObject* m_ContentPackageReference; // 0x4dc
	GAME_WIN_STATE m_GameWinState; // 0x4e4
	TG_GAME_TYPE m_GameType; // 0x4e5
	float m_fSpawnProtectionTime; // 0x4e8
	float m_fMaxRepawnTime; // 0x4ec
	float m_fUnpauseCountdownRemaining; // 0x4f0
	int32_t s_nBotPlayerCount; // 0x4f4
	char s_bSpawnOfflinePawns : 1; // 0x4f8
	char s_bGameInitialized : 1; // 0x4f8
	char s_bEACMatchStartSent : 1; // 0x4f8
	char s_bGameEndMissionProcessed : 1; // 0x4f8
	char s_bMissionSealed : 1; // 0x4f8
	char m_bForceUsePRISpawnPoint : 1; // 0x4f8
	char m_bRewardCalculated : 1; // 0x4f8
	char m_bStatsCanTie : 1; // 0x4f8
	char m_bStatsIsSymmetric : 0; // 0x4f8
	char m_bIsTutorialGametype : 0; // 0x4f8
	char m_bIsPracticeGametype : 0; // 0x4f8
	char m_bEnableHeadShots : 0; // 0x4f8
	char m_bPlayOfTheGameLocked : 0; // 0x4f8
	char m_bPlayOfTheGameDisabled : 0; // 0x4f8
	char m_bSpawnDisconnectedPlayersStunned : 0; // 0x4f8
	char m_bPlayersCanOnlyDieOnce : 0; // 0x4f8
	char m_bUseKillEmotes : 0; // 0x4f8
	char m_bNotifyKillCombos : 0; // 0x4f8
	char m_bFirstBloodAwarded : 0; // 0x4f8
	int32_t m_nNumTaskForces; // 0x4fc
	int32_t s_nNextActorInstanceId; // 0x500
	int32_t s_nNextProjectileInstanceId; // 0x504
	TArray<ObjectProperty> s_AIVolumes; // 0x508
	TArray<int32_t> s_Taskforce1AIVolumesIndices; // 0x518
	TArray<int32_t> s_Taskforce2AIVolumesIndices; // 0x528
	TArray<ObjectProperty> s_FortressVolumes; // 0x538
	TMap<None, None> s_AIAnnotations; // 0x548
	TArray<ObjectProperty> s_DeviceVolumes; // 0x590
	TArray<ObjectProperty> s_ActorFactories; // 0x5a0
	float s_fXPModifier; // 0x5b0
	int32_t m_nTaskforce1Kills; // 0x5b4
	int32_t m_nTaskforce2Kills; // 0x5b8
	float m_fGlobalCooldownTime; // 0x5bc
	TArray<int32_t> m_ClientLogins; // 0x5c0
	float m_fOcclusionCalcPeriod; // 0x5d0
	float m_fOcclusionMaxDeviation; // 0x5d4
	float m_fReadyPercent; // 0x5d8
	FPlayOfTheGameInfo m_PlayOfTheGame; // 0x5dc
	float m_fPlayOfTheGameLength; // 0x5e8
	float m_fPlayOfTheGameIntroBufferLength; // 0x5ec
	float m_fPlayOfTheGameOuttroBufferLength; // 0x5f0
	TArray<FPlayOfTheGameEventConfig> m_PlayOfTheGameEventConfigs; // 0x5f4
	TArray<ObjectProperty> m_PlayerSpawnExits; // 0x604
	TArray<ObjectProperty> m_ReadyPlayers; // 0x614
};

struct UPComImageDownloader : UObject {
	TArray<FPComImageDownload> DownloadImages; // 0x60
	DelegateProperty __OnPComImageDownloaded__Delegate; // 0x70
};

struct USeqAct_SetMatInstScalarParam : USequenceAction {
	ObjectProperty MatInst; // 0x108
	FName ParamName; // 0x110
	float ScalarValue; // 0x118
};

struct UMaterialExpressionConstantBiasScale : UMaterialExpression {
	FExpressionInput Input; // 0xb0
	float Bias; // 0xe4
	float Scale; // 0xe8
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x94
};

struct UMcpUserManagerBase : UMcpServiceBase {
	FString McpUserManagerClassName; // 0x78
	DelegateProperty __OnRegisterUserComplete__Delegate; // 0x88
	DelegateProperty __OnQueryUsersComplete__Delegate; // 0x98
	DelegateProperty __OnDeleteUserComplete__Delegate; // 0xa8
};

struct UTgSkelControlSingleBone_PistonBarrel : UTgSkelControlSingleBone {
	float m_nDepressDistance; // 0x124
	float m_nReturnSpeed; // 0x128
};

struct ATgDevice_ToggleInhandFiremode : ATgDevice {
	ObjectProperty m_CachedInhand; // 0xa04
};

struct ATgDevice_ManaRift : ATgDevice {
	ObjectProperty m_CachedImani; // 0xa04
	float m_fDistanceTolerance; // 0xa0c
	FVector m_vLastLocation; // 0xa10
	char m_bLocationIsLive : 1; // 0xa1c
	float m_fLocationTimestamp; // 0xa20
};

struct ATgDevice_Roost : ATgDevice {
	ObjectProperty m_ScopeDevice; // 0xa04
};

struct ATgGame_SinglePointCaptureAndHold : ATgGame_PointCapture {
	int32_t m_nCurrentActiveCapturePointIndex; // 0x79c
	int32_t m_nNumTicketsForCapturingPoint; // 0x7a0
	int32_t m_nNumTicketsForHoldingPoint; // 0x7a4
	float m_fNewPointTime; // 0x7a8
	float m_fDefendingTeamRespawnTime; // 0x7ac
};

struct UPointLightComponent : ULightComponent {
	float ShadowRadiusMultiplier; // 0x1a4
	float Radius; // 0x1a8
	float FalloffExponent; // 0x1ac
	float ShadowFalloffExponent; // 0x1b0
	float MinShadowFalloffRadius; // 0x1b4
	FMatrix CachedParentToWorld; // 0x1c0
	FVector Translation; // 0x200
	FPlane ShadowPlane; // 0x210
	ComponentProperty PreviewLightRadius; // 0x220
	FLightmassPointLightSettings LightmassSettings; // 0x228
	ComponentProperty PreviewLightSourceRadius; // 0x238
};

struct ATgObjective : AActor {
	char r_nDefenderTaskForceIndex; // 0x280
	char r_nControllingTaskForceIndex; // 0x281
	char r_nContestingTaskForceIndex; // 0x282
	EObjectiveStatus r_eStatus; // 0x283
	int32_t r_nControllingTaskForceCount; // 0x284
	ObjectProperty m_InWordIndicatorFX; // 0x288
	ObjectProperty m_ForegroundIndicatorFX; // 0x290
	int32_t m_nActiveAlertId; // 0x298
	int32_t m_nPendingActiveAlertId; // 0x29c
	int32_t m_nInactiveAlertId; // 0x2a0
	int32_t m_nWaypointMessageOverride; // 0x2a4
	char m_bTriggerEventsOnClientAsWell : 1; // 0x2a8
};

struct UTgAnimBlendByPaladinsCharacter_Flak : UTgAnimBlendByPaladinsCharacter {
	ObjectProperty m_CachedFlakPawn; // 0x544
};

struct UTgCameraModule_FrontFacingCamera : UTgCameraModule_ThirdPerson {
	FRotator m_rWorldRotationOffset; // 0x118
	float m_fFOV; // 0x124
};

struct UUIData_String : UUIData {
	FString m_sValue; // 0x64
};

struct ATgProj_GrumpyBomb : ATgProj_FreeGrenade {
	ComponentProperty m_Silhouette; // 0x580
	char m_bSilhouetteInitialized : 1; // 0x588
	char m_bSilhouetteAllowed : 1; // 0x588
	float m_fPostLandDurationAccelerant; // 0x58c
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x60
	ObjectProperty PhysMaterial; // 0x68
	float Hardness; // 0x70
	char bNoWeightBlend : 1; // 0x74
};

struct UNavMeshPath_BiasAgainstPolysWithinDistanceOfLocations : UNavMeshPathConstraint {
	FVector Location; // 0x78
	FVector Rotation; // 0x84
	float DistanceToCheck; // 0x90
	TArray<FVector> LocationsToCheck; // 0x94
};

struct UTgAchievement_ShieldForDuration : UTgAchievement {
	float m_fStartFireTime; // 0x94
};

struct UTgInvListener_SetChildDamageType : UTgInventoryObject_Listen_ActiveWhileOffCooldown {
	int32_t m_nOldDamageType; // 0xc8
	FName m_nmOldDamageTypeClass; // 0xcc
	UTgDamageType* m_OldDamageTypeClass; // 0xd4
};

struct UTgAnimNodeChannelFire_AzaanUlt : UTgAnimNodeChannelFire {
	AzaanUltAnimState m_eAnimState; // 0x180
};

struct UTgGameplayCurvesSet_RecoilSimple : UTgGameplayCurvesSet {
	FRawDistributionFloat HorizRecoil1; // 0x64
	FRawDistributionFloat HorizRecoil2; // 0x88
	FRawDistributionFloat VertRecoil1; // 0xac
	FRawDistributionFloat VertRecoil2; // 0xd0
	EPaladinsRecoilType RecoilType; // 0xf4
};

struct UTgAIBehaviorAction_SelectLaneCombatTarget : UTgAIBehaviorAction {
	char bMustBeEnemy : 1; // 0x94
	char bMustBeSameLane : 1; // 0x94
	char bMustHaveLineOfSight : 1; // 0x94
	char bMustHaveDamagedGod : 1; // 0x94
	char bMustNotBeImmune : 1; // 0x94
	char bMustBeInForwardCone : 1; // 0x94
	char bEffectGroupCategoryCheckInstigator : 1; // 0x94
	char bMustBeHittable : 1; // 0x94
	char bMustNotBeNearShield : 0; // 0x94
	ETargetSelector TargetSelector; // 0x98
	ECombatTargetType TargetType; // 0x99
	ECombatTargetType IgnoreTargetType; // 0x9a
	int32_t EffectCategoryId; // 0x9c
	float DistanceThreshold; // 0xa0
	float ForwardConeAngle; // 0xa4
};

struct UTgAnimBlendByHeadSkin : UTgAnimNodeBlendList {
	TArray<FHeadSkinChildInfo> m_SkinMap; // 0x168
};

struct ARadialBlurActor : AActor {
	ComponentProperty RadialBlur; // 0x280
};

struct USeqAct_SetSkelControlTarget : USequenceAction {
	FName SkelControlName; // 0x108
	TArray<ObjectProperty> TargetActors; // 0x110
};

struct UTgAnimBlendBySpeedWithExhaustion : UTgAnimBlendBySpeed {
	char m_bEnableExhaustion : 1; // 0x21c
	float m_fExhaustionLevel; // 0x220
	TArray<int32_t> m_ExhaustedChildren; // 0x224
	TArray<int32_t> m_GainExhaustionChildren; // 0x234
	float m_fExhaustionGainSpeed; // 0x244
	float m_fExhaustionLossSpeed; // 0x248
	float m_fExhaustionLevelMax; // 0x24c
	float m_fExhaustionLevelMin; // 0x250
};

struct UTgSoundGroup : UObject {
	TArray<ObjectProperty> c_SoundCues; // 0x60
	TArray<FFootstepSoundInfo> c_FootstepSounds; // 0x70
};

struct UParticleModuleColorOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorOverLife; // 0x68
	FRawDistributionFloat AlphaOverLife; // 0x8c
	char bClampAlpha : 1; // 0xb0
};

struct UTgGameplayCurves : UObject {
	TArray<ObjectProperty> CurveSets; // 0x60
	TArray<ObjectProperty> InheritedCurves; // 0x70
	char bShowInheritedCurves : 1; // 0x80
	char bInheritedCurvesShareEditorTab : 1; // 0x80
	ObjectProperty CurveEdSetup; // 0x84
};

struct ATgPawn_Druid : ATgPawn_Character {
	ObjectProperty m_CachedRMBTargeting; // 0x3160
	ObjectProperty m_CachedRMB; // 0x3168
	ObjectProperty m_CachedSpawnFox; // 0x3170
	ObjectProperty m_GuidedArrowTarget; // 0x3178
	ObjectProperty r_ActiveFox; // 0x3180
	float r_fRMBProjectileSpeed; // 0x3188
	float r_fLastStandAnimTime; // 0x318c
	int32_t r_nFoxActivityNonce; // 0x3190
	FString m_sDeployRedeployIconOverride; // 0x3194
	char c_bAcknowledgedIsLeaping : 1; // 0x31a4
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxisAndAngle; // 0xb0
	FExpressionInput PositionOnAxis; // 0xe4
	FExpressionInput Position; // 0x118
};

struct UTgAIBehaviorCondition_DifficultyLevel : UTgAIBehaviorCondition {
	EBotDifficultyLevel Difficulty; // 0x98
};

struct ULightFunction : UObject {
	ObjectProperty SourceMaterial; // 0x60
	FVector Scale; // 0x68
	float DisabledBrightness; // 0x74
};

struct UTgSeqAct_AIMoveToActor : USequenceAction {
	ObjectProperty Destination; // 0x108
};

struct ATgDeploy_YagoHardenPoison : ATgDeploy_EffectField {
	float m_fRadiusIncPerSec; // 0x4a0
	float m_fMaxRadiusScale; // 0x4a4
};

struct UTgAnimNodeTriggerCameraAnim : UAnimNodeBlendBase {
	ObjectProperty CameraAnim; // 0x114
	float fBlendInTime; // 0x11c
	float fBlendOutTime; // 0x120
	char bLoopAnimation : 1; // 0x124
	char bBlendInOnBecomeRelevant : 1; // 0x124
	char bBlendInOnReplayAnim : 1; // 0x124
	char bBlendOutOnStopFire : 1; // 0x124
	char bPlayAnimInLocalSpace : 1; // 0x124
	char bPropertiesRelativeToBase : 1; // 0x124
	TG_EQUIP_POINT m_StopFireEquipSlotTarget; // 0x128
	ObjectProperty CameraAnimInst; // 0x12c
};

struct UTgDeviceForm_WallBangFire : UTgDeviceForm {
	FSaatiAimInfo s_CachedAimInfo; // 0x28c
	TArray<ObjectProperty> m_SaatiUltNodes3p; // 0x2a4
	TArray<ObjectProperty> m_SaatiUltNodes1p; // 0x2b4
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UUIData_LoadoutItem : UUIData {
	Fdword m_dwItemId; // 0x64
	Fdword m_dwCount; // 0x68
	Fdword m_dwSortOrder; // 0x6c
	Fdword m_dwLoadoutItemType; // 0x70
	FQWord m_qwLoadoutItemId; // 0x74
	ObjectProperty m_pOwningLoadout; // 0x7c
};

struct UUIData_PlayerMatchRecord : UUIData {
	FPointer VfTable_IUIDataInterface_Name; // 0x64
	int32_t nBotId; // 0x6c
	int32_t nPlayerId; // 0x70
	Fdword dwCharacterId; // 0x74
	int32_t nLevel; // 0x78
	int32_t nKills; // 0x7c
	int32_t nDeaths; // 0x80
	int32_t nAssists; // 0x84
	int32_t nEarnedCredits; // 0x88
	int32_t nHealingPlayer; // 0x8c
	int32_t nHealingBot; // 0x90
	int32_t nHealingTotal; // 0x94
	int32_t nSelfHealing; // 0x98
	int32_t nDmgTaken; // 0x9c
	int32_t nDmgPlayer; // 0xa0
	int32_t nDmgBot; // 0xa4
	int32_t nDmgTotal; // 0xa8
	int32_t nSoloKills; // 0xac
	int32_t nFlankKills; // 0xb0
	int32_t nMultikill; // 0xb4
	int32_t nKillstreak; // 0xb8
	int32_t nDmgStructure; // 0xbc
	int32_t nDmgMitigated; // 0xc0
	int32_t nObjectiveTime; // 0xc4
	int32_t nCards[0x5]; // 0xc8
	int32_t nCardLevels[0x5]; // 0xdc
	int32_t nLegendary; // 0xf0
	int32_t nLegendaryLevel; // 0xf4
	int32_t nPassive; // 0xf8
	int32_t nPassiveLevel; // 0xfc
	int32_t nPurchasedItems[0x4]; // 0x100
	int32_t nPurchasedItemLevels[0x4]; // 0x110
	int32_t nMountItemId; // 0x120
	int32_t nEmoteItemId; // 0x124
	int32_t nMVPPoseItemId; // 0x128
	int32_t nSprayItemId; // 0x12c
	int32_t nTitleItemId; // 0x130
	int32_t nTaskForce; // 0x134
	char bAlly : 1; // 0x138
	char bLocal : 1; // 0x138
	char bReported : 1; // 0x138
	char bIsPaidBattlePass : 1; // 0x138
	char bIsVerifiedPlayer : 1; // 0x138
	char m_bPendingFilterRequest : 1; // 0x138
	FString sPlayer; // 0x13c
	FUniqueNetId ConsoleUniqueId; // 0x14c
	Fdword dwPortalId; // 0x154
	Fdword dwBattlePassXp; // 0x158
};

struct UUIComponent_CommendationHistoryPanel : UUIComponent_Display {
	ObjectProperty m_mcTeamworkCountTF; // 0x124
	ObjectProperty m_mcLeadershipCountTF; // 0x12c
	ObjectProperty m_mcSkillCountTF; // 0x134
	ObjectProperty m_mcCommendationRewardsButton; // 0x13c
	ObjectProperty m_ProgressBar; // 0x144
};

struct ATgDroppedItem : AActor {
	float m_fLifeSpan; // 0x280
	char m_bFadeOut : 1; // 0x284
	FName m_nmPickUpState; // 0x288
	int32_t r_nItemId; // 0x290
	ComponentProperty c_Mesh; // 0x294
	TArray<ObjectProperty> s_EffectGroupList; // 0x29c
};

struct UTgAudioConversations : UObject {
	TArray<FVoxConversation> m_Conversations; // 0x60
	char m_bInitialized : 1; // 0x70
	char m_bTF1Conversed : 1; // 0x70
	char m_bTF2Conversed : 1; // 0x70
	ObjectProperty m_GRI; // 0x74
	int32_t m_nConversationAttemptsRemaining; // 0x7c
};

struct UUIScene_UIHudKoga : UUIScene {
	char m_bViewTargetKoga : 1; // 0x1cc
	char m_bInitialized : 1; // 0x1cc
	char m_bPostInitActions : 1; // 0x1cc
	char m_bBarShown : 1; // 0x1cc
	ObjectProperty m_pCachedKoga; // 0x1d0
	ObjectProperty m_mcMeter; // 0x1d8
	ObjectProperty m_Bars[0x3]; // 0x1e0
	int32_t m_nTickCallbackHandle; // 0x1f8
	int32_t m_nUIHudCallbackHandle; // 0x1fc
};

struct UUIScene_UIHudMap : UUIScene {
	ObjectProperty m_pGamepadSelectAction; // 0x1cc
};

struct UUIComponent_Quest : UUIComponent_Display {
	ObjectProperty m_pQuestPanelButton; // 0x124
	ObjectProperty m_pQuestDiscardButton; // 0x12c
	ObjectProperty m_mcProgressFrame; // 0x134
	ObjectProperty m_mcQuestProgressBar; // 0x13c
	ObjectProperty m_mcQuestProgressMask; // 0x144
	ObjectProperty m_mcQuestTitle; // 0x14c
	ObjectProperty m_mcQuestType; // 0x154
	ObjectProperty m_mcQuestIconRendered; // 0x15c
	ObjectProperty m_mcQuestIcon; // 0x164
	ObjectProperty m_mcDailyQueueBonusIcon; // 0x16c
	ObjectProperty m_mcQuestFrame; // 0x174
	ObjectProperty m_mcGlow; // 0x17c
	ObjectProperty m_mcNew; // 0x184
	ObjectProperty m_mcGoalSequences[0x7]; // 0x18c
	ObjectProperty m_GoalSequenceBar; // 0x1c4
	ObjectProperty m_mcQuestChestIcon; // 0x1cc
	ObjectProperty m_mcRewardItem; // 0x1d4
	ObjectProperty m_mcRewardItemRarity; // 0x1dc
	ObjectProperty m_mcRewardItemIcon; // 0x1e4
	ObjectProperty m_mcRewardItemImageStack; // 0x1ec
	ObjectProperty m_mcRewardItemTexture; // 0x1f4
	ObjectProperty m_mcRewardItemName; // 0x1fc
	ObjectProperty m_mcRewardSubtitle; // 0x204
	ObjectProperty m_mcQuestProgressText; // 0x20c
	ObjectProperty m_mcQuestDescription; // 0x214
	ObjectProperty m_mcQuestRewardAmount; // 0x21c
	ObjectProperty m_mcQuestRewardAmount1; // 0x224
	ObjectProperty m_pCurrencyRewards; // 0x22c
	float m_fSequenceOrigX; // 0x234
	float m_fSequenceOrigY; // 0x238
	float m_fSequenceOrigWidth; // 0x23c
};

struct UMobileMenuImage : UMobileMenuObject {
	ObjectProperty Image; // 0xdc
	MenuImageDrawStyle ImageDrawStyle; // 0xe4
	FUVCoords ImageUVs; // 0xe8
	FLinearColor ImageColor; // 0xfc
};

struct UParticleModuleSizeMultiplyLife : UParticleModuleSizeBase {
	FRawDistributionVector LifeMultiplier; // 0x68
	char MultiplyX : 1; // 0x8c
	char MultiplyY : 1; // 0x8c
	char MultiplyZ : 1; // 0x8c
};

struct UTgAnimNodeAimOffset_Charge : UTgAnimNodeAimOffset {
	char m_bInterpToCurrentTurnRate : 1; // 0x1f4
	char m_bDisableIfNotMoving : 1; // 0x1f4
	char m_bResetOnBecomeRelevant : 1; // 0x1f4
	float m_fInterpSpeed; // 0x1f8
	float m_fMaxYawRate; // 0x1fc
	float m_fAimYawOffset; // 0x200
	FRotator m_rCachedOwnerRotator; // 0x204
};

struct ATgMapCalloutVolume : AVolume {
	FString m_sMsg; // 0x2bc
};

struct UOnlinePlaylistProvider : UUIResourceDataProvider {
	int32_t PlaylistId; // 0x94
	TArray<FName> PlaylistGameTypeNames; // 0x98
	FString DisplayName; // 0xa8
	int32_t Priority; // 0xb8
};

struct ATgPawn_DruidGuardian : ATgPawn_Character {
	ObjectProperty m_CachedDruid; // 0x3160
	ObjectProperty m_CachedRush; // 0x3168
	ObjectProperty r_pRedeployPlaceholder; // 0x3170
	float m_fGuardianIntroLockoutTime; // 0x3178
	float m_fRotationRateDegPerSec; // 0x317c
	float m_fRedeployTweenDuration; // 0x3180
	float m_fRedeployTweenRampUpDuration; // 0x3184
	float m_fRedeployTweenSpeedFeetPerSecStart; // 0x3188
	float m_fRedeployTweenSpeedFeetPerSecEnd; // 0x318c
	float m_fRedeployFailsafeTime; // 0x3190
	float m_fStunRushTweenRampUpDuration; // 0x3194
	float m_fStunRushTweenSpeedFeetPerSecStart; // 0x3198
	float m_fStunRushTweenSpeedFeetPerSecEnd; // 0x319c
	float m_fPostRedeployLockout; // 0x31a0
	float m_fRedeployVerticalOffset; // 0x31a4
	float r_fStunRushCooldownTime; // 0x31a8
	char r_bStunRushInCooldown : 1; // 0x31ac
	char r_bInWispForm : 1; // 0x31ac
	char r_bStunRushRedeploy : 1; // 0x31ac
	char r_bAnimatingRushHit : 1; // 0x31ac
	char c_bPsychicGrowlOnWindupOnly : 1; // 0x31ac
	int32_t r_nStunRushInCooldownNonce; // 0x31b0
	float m_fPostRedeployOutputDuration; // 0x31b4
	int32_t m_nPostRedeployOutputSlot; // 0x31b8
	float c_fWispTransitionTime; // 0x31bc
	float c_fWispTransitionTimeTotal; // 0x31c0
	float m_fStunRushPsychicGrowlLockoutTime; // 0x31c4
	float m_fMaxSeekingTurnDegPerSec; // 0x31c8
	float m_fSeekingSpeedFeetPerSec; // 0x31cc
	float m_fRushHitSpeedFactor; // 0x31d0
	ObjectProperty r_pRushTarget; // 0x31d4
	int32_t m_nHealFeedDefaultIconId; // 0x31dc
	float c_fPsychicGrowlCooldownTime; // 0x31e0
	float r_fPsychicGrowlRangeSqr; // 0x31e4
};

struct ATgProj_MoonShard : ATgProj_Simulated {
	FPointer VfTable_ITgCallbackInterface; // 0x52c
	ObjectProperty m_CallbackContainer; // 0x534
	float m_fMaxPullAcceleration; // 0x53c
	float m_fMaxSpeed; // 0x540
	float m_fPeakLateralDampening; // 0x544
	float m_fInnerRadius; // 0x548
	float m_fKnockupRadius; // 0x54c
	float m_fOuterRadius; // 0x550
	float m_fRadiusExitTolerance; // 0x554
	float m_fPhysWalkingAccelerationFactor; // 0x558
	char c_bDebugRadii : 1; // 0x55c
	TArray<ObjectProperty> m_RegisteredPawns; // 0x560
	TArray<FMoonShardPawnRecord> m_AffectedPawns; // 0x570
};

struct UTgDeviceForm_TiberiusLeap : UTgDeviceForm {
	ObjectProperty m_CachedTiberius; // 0x28c
};

struct UTgDeviceForm_SilenceBeam : UTgDeviceForm_SpinnerWhileFiring {
	ObjectProperty m_pCachedGauntlet; // 0x2b8
};

struct UUIComponent_Card : UUIComponent_Display {
	ObjectProperty m_mcCTA; // 0x124
	ObjectProperty m_mcChampion; // 0x12c
	ObjectProperty m_mcChampionIcon; // 0x134
	ObjectProperty m_mcCooldown; // 0x13c
	ObjectProperty m_mcCost; // 0x144
	ObjectProperty m_mcName; // 0x14c
	ObjectProperty m_mcSkill; // 0x154
	ObjectProperty m_mcDesc; // 0x15c
	ObjectProperty m_mcRarity; // 0x164
	ObjectProperty m_mcFrame; // 0x16c
	ObjectProperty m_mcCooldownTimer; // 0x174
	ObjectProperty m_mcIcon; // 0x17c
	ObjectProperty m_mcRarityGlow; // 0x184
	char m_bShowChampion : 1; // 0x18c
	char m_bShowRarityGlow : 1; // 0x18c
};

struct USeqAct_GetDistance : USequenceAction {
	float Distance; // 0x108
};

struct UUIComponent_Targeter_Headhunter : UUIComponent_Targeter_PointTargeter {
	ObjectProperty m_mcSpinner; // 0x184
	float m_fSpinnerRotation; // 0x18c
};

struct UTgClientSettings : UObject {
	float MinimapScaling; // 0x60
	float UIScaling; // 0x64
	float HUDScaling; // 0x68
	float CombatTextScaling; // 0x6c
	float ChatScaling; // 0x70
	float ChatFadeout; // 0x74
	ENamePlateName OverlayGodName; // 0x78
	EFriendStateNotifications ShowFriendStateNotifications; // 0x79
	ETargetingLineStyle TargetingLineStyle; // 0x7a
	ETargetingPreviewStyle TargetingPreviewStyle; // 0x7b
	ETargetingReticleStyle TargetingReticleStyle; // 0x7c
	ETargetingHighlightStyle TargetingHighlightStyle; // 0x7d
	ECastMode CastMode; // 0x7e
	EMapPlacement MapPlacement; // 0x7f
	EControlIconStyle ControlIconStyle; // 0x80
	EColorBlindOption SelectedColorBlindOption; // 0x81
	ECrossplayCombinedSetting CombinedCrossplayOption; // 0x82
	ECrossInputMethod CrossInputMethod; // 0x83
	EAspectRatio DesiredAspectRatio; // 0x84
	char OverlayShowLocalPlayer : 1; // 0x88
	char DisableHelpMessages : 1; // 0x88
	char ShowInHandTargeting : 1; // 0x88
	char DisableTargetingAid : 1; // 0x88
	char VerticalTargetingPreviews : 1; // 0x88
	char DisableProfanityFilter : 1; // 0x88
	char ShowTeamTags : 1; // 0x88
	char SpectateDamage : 1; // 0x88
	char SpectateHeals : 0; // 0x88
	char SpectateCrits : 0; // 0x88
	char SpectateGold : 0; // 0x88
	char SpectateXP : 0; // 0x88
	char SpectateOutlines : 0; // 0x88
	char ShowRentNotification : 0; // 0x88
	char ShowHUDScore : 0; // 0x88
	char ShowHUDEnemy : 0; // 0x88
	char ShowHUDStats : 0; // 0x88
	char ShowHUDItems : 0; // 0x88
	char ShowWardPings : 0; // 0x88
	char ShowCauterizeHealthBar : 0; // 0x88
	char bShowCardCooldowns : 0; // 0x88
	char DoNotDisturb : 0; // 0x88
	char LoadAssistModeSubLevel : 0; // 0x88
	char bTargetingAlwaysShowPreview : 0; // 0x88
	char bUseCastQueueing : 0; // 0x88
	char bUseFixedPitchMode : 0; // 0x88
	char NewUserPromptTutorialMatch : 0; // 0x88
	char NewUserFinished : 0; // 0x88
	char VendorStoreTopTier : 0; // 0x88
	char bEnableHelpPopups : 0; // 0x88
	char ColorBlindMode : 0; // 0x88
	char ColorBlindModeShader : 0; // 0x88
	char bCharacterVolume : 1; // 0x8c
	char MasterMute : 1; // 0x8c
	char SFXMute : 1; // 0x8c
	char MusicMute : 1; // 0x8c
	char VoiceMute : 1; // 0x8c
	char MatchNotifierMute : 1; // 0x8c
	char AllPlayerMute : 1; // 0x8c
	char bEnableVoiceChat : 1; // 0x8c
	char bUsePushToTalkForVoiceChat : 0; // 0x8c
	char QueueWaitRegion : 0; // 0x8c
	char QueueWaitSolo : 0; // 0x8c
	char DisableCrossplay : 0; // 0x8c
	char AutoPurchase : 0; // 0x8c
	char AutoSkill : 0; // 0x8c
	char bToggleZoom : 0; // 0x8c
	char DisableJoystickInput : 0; // 0x8c
	char EnableControllerFeedback : 0; // 0x8c
	char EnableGyroInput : 0; // 0x8c
	char bEnableHudTeams : 0; // 0x8c
	char bEnableHudCombat : 0; // 0x8c
	char bEnableHudHealth : 0; // 0x8c
	char bEnableHudSkills : 0; // 0x8c
	char bEnableHudTeamUI : 0; // 0x8c
	char bEnableHudTeamDeathMarkers : 0; // 0x8c
	char bEnableHudMinimap : 0; // 0x8c
	char bReticleBloom : 0; // 0x8c
	char bChangeReticleOverEnemy : 0; // 0x8c
	char bEnableSpecatorPlayerIcons : 0; // 0x8c
	char bShowSpectatorItems : 0; // 0x8c
	char bPublicParty : 0; // 0x8c
	char bShownVaultTutorial : 0; // 0x8c
	char bEnableSpectate : 0; // 0x8c
	char blockNonFriendChat : 1; // 0x90
	char newUserFinishedTutorial : 1; // 0x90
	char bShowLiveVideo : 1; // 0x90
	char ShownBountyCoinLinkPrompt : 1; // 0x90
	int32_t TeamTagFormat; // 0x94
	float FogOfWarDimness; // 0x98
	float MinimapOpacity; // 0x9c
	int32_t DemoBotId; // 0xa0
	float CastQueueTime; // 0xa4
	float FixedPitchLowerBoundDegrees; // 0xa8
	float FixedPitchUpperBoundDegrees; // 0xac
	int32_t PlayNowTabId; // 0xb0
	int32_t VendorStoreTabId; // 0xb4
	int32_t VendorStoreTypeId; // 0xb8
	int32_t VendorStoreTypeRecId; // 0xbc
	int32_t LeagueSelection; // 0xc0
	int32_t VPSelection; // 0xc4
	int32_t ColorBlindModeShaderType; // 0xc8
	float ColorBlindModeIntensity; // 0xcc
	float MasterVolume; // 0xd0
	float SFXVolume; // 0xd4
	float MusicVolume; // 0xd8
	float VoiceVolume; // 0xdc
	float MatchNotifierVolume; // 0xe0
	float VoiceChatVolume; // 0xe4
	float VoiceChatMicVolume; // 0xe8
	int32_t nAudioPanning; // 0xec
	float DesiredFOV; // 0xf0
	float fGamma; // 0xf4
	float fControllerFeedbackStrength; // 0xf8
	int32_t nEnableHudDamage; // 0xfc
	int32_t nReticleColor; // 0x100
	int32_t nReticleType; // 0x104
	int32_t nHealFeedMode; // 0x108
	int32_t nVGSType; // 0x10c
	int32_t nScoreboardType; // 0x110
	int32_t nSpectatorBlueTeamSeriesScore; // 0x114
	int32_t nSpectatorRedTeamSeriesScore; // 0x118
	int32_t TwitchServer; // 0x11c
	int32_t TwitchBitrate; // 0x120
	int32_t TwitchFramerate; // 0x124
	int32_t TwitchMicVolume; // 0x128
	int32_t TwitchGameVolume; // 0x12c
	int32_t TwitchResolution; // 0x130
	int32_t TwitchMicMute; // 0x134
	int32_t TwitchGameMute; // 0x138
	int32_t TwitchSaveUsername; // 0x13c
	FString TwitchTitle; // 0x140
	FString TwitchUsername; // 0x150
	FString DemoVideo; // 0x160
	TArray<FString> DemoResults; // 0x170
	int32_t CustomGameQueueIndex; // 0x180
	TArray<int32_t> CurrentMultiQueues; // 0x184
	TArray<int32_t> OptOutMultiQueues; // 0x194
	int32_t loadingPortraitBanner; // 0x1a4
	TArray<int32_t> newUserWatchedVideos; // 0x1a8
	int32_t ChosenSkinId; // 0x1b8
	int32_t ChosenClassId; // 0x1bc
	int32_t ChosenWeaponId; // 0x1c0
	int32_t ChosenWeaponSkinId; // 0x1c4
	int32_t ChosenPedestalId; // 0x1c8
	int32_t SelectedChampionSortIndex; // 0x1cc
	TArray<int32_t> m_CTAItemIds; // 0x1d0
	FString m_PlayerCTAName; // 0x1e0
	TArray<int32_t> m_TransientItemsAcquired; // 0x1f0
	FString m_SavedLoginVersion; // 0x200
	FString m_LastLoginVersion; // 0x210
	int32_t m_SavedBattlePassLevel; // 0x220
	int32_t m_LastLoginBattlePassLevel; // 0x224
};

struct APrefabInstance : AActor {
	ObjectProperty TemplatePrefab; // 0x280
	int32_t TemplateVersion; // 0x288
	TMap<None, None> ArchetypeToInstanceMap; // 0x28c
	ObjectProperty SequenceInstance; // 0x2d4
	int32_t PI_PackageVersion; // 0x2dc
	int32_t PI_LicenseePackageVersion; // 0x2e0
	TArray<char> PI_Bytes; // 0x2e4
	TArray<ObjectProperty> PI_CompleteObjects; // 0x2f4
	TArray<ObjectProperty> PI_ReferencedObjects; // 0x304
	TArray<FString> PI_SavedNames; // 0x314
	TMap<None, None> PI_ObjectMap; // 0x324
	char m_bIgnoreVersionUpdates : 1; // 0x36c
};

struct ATgHeightFog : AInfo {
	ComponentProperty FogComponent; // 0x280
};

struct UMorphNodeWeight : UMorphNodeWeightBase {
	float NodeWeight; // 0x84
};

struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x240
	float OuterConeAngle; // 0x244
	float LightShaftConeAngle; // 0x248
	ComponentProperty PreviewInnerCone; // 0x24c
	ComponentProperty PreviewOuterCone; // 0x254
	FRotator Rotation; // 0x25c
};

struct UUIGameInfoSummary : UUIResourceDataProvider {
	FString ClassName; // 0x94
	FString GameAcronym; // 0xa4
	FString MapPrefix; // 0xb4
	char bIsTeamGame : 1; // 0xc4
	char bIsDisabled : 1; // 0xc4
	FString GameSettingsClassName; // 0xc8
	FString GameName; // 0xd8
	FString Description; // 0xe8
};

struct ATgDevice_RocketLauncher : ATgDevice {
	FVector m_vProjectileSpawnOffset2; // 0xa04
	int32_t m_nFireCount; // 0xa10
};

struct ATgDevice_AtlasBarrage : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	ObjectProperty m_FireDevice; // 0xa0c
};

struct UTgSeqAct_TemporaryAddDevice : USequenceAction {
	int32_t m_nDeviceId; // 0x108
	int32_t m_nEquipPoint; // 0x10c
};

struct USkelControlFootPlacement : USkelControlLimb {
	float FootOffset; // 0x128
	EAxis FootUpAxis; // 0x12c
	FRotator FootRotOffset; // 0x130
	char bInvertFootUpAxis : 1; // 0x13c
	char bOrientFootToGround : 1; // 0x13c
	char bOnlyEnableForUpAdjustment : 1; // 0x13c
	char m_bManuallyOverrideEffectorLocation : 1; // 0x13c
	char m_bUseCachedFootOffset : 1; // 0x13c
	float MaxUpAdjustment; // 0x140
	float MaxDownAdjustment; // 0x144
	float MaxFootOrientAdjust; // 0x148
	FVector m_vCachedFootOffset; // 0x14c
};

struct UMaterialEffect : UPostProcessEffect {
	ObjectProperty Material; // 0x88
};

struct UTgSeqEvent_LoadoutChanged : USequenceEvent {
	int32_t DeckId; // 0x128
};

struct UTgDeviceFire_SilenceBeam : UTgDeviceFire {
	ObjectProperty m_CachedGauntlet; // 0x268
	float m_fLockOnScale; // 0x270
	float m_fServerRangeBufferMult; // 0x274
	float m_fBaseEncroachmentActorRange; // 0x278
};

struct ATgCharacterPerformance : ATgGame {
	ObjectProperty BasePerformanceCapture; // 0x624
	EPComPerformanceCaptureState CurrentCaptureState; // 0x62c
	FString CharacterInput; // 0x630
	FString SetInput; // 0x640
	int32_t CurrentCharacterIndex; // 0x650
	int32_t CurrentSkinIndex; // 0x654
	TArray<ObjectProperty> CharacterPlacements; // 0x658
	TArray<FString> CharactersToTest; // 0x668
	TArray<int32_t> AllSkinIDs; // 0x678
	TArray<FDeviceToCharacterID> DeviceToCharacterIDPairs; // 0x688
	TArray<FPComPerformanceCaptureStatsPerSkin> StatsPerSkin; // 0x698
	TArray<ObjectProperty> CharacterPawns; // 0x6a8
	ObjectProperty ManifestGroup; // 0x6b8
	FPointer CharacterPerformanceUtility; // 0x6c0
};

struct UTgTutorialAnnouncer : UObject {
	TArray<ObjectProperty> TutorialSounds; // 0x60
	TArray<ObjectProperty> QueuedSounds; // 0x70
	ComponentProperty CurrentSoundAC; // 0x80
	ObjectProperty OwnerPC; // 0x88
};

struct UTgDeviceForm_GraceSupport : UTgDeviceForm {
	ObjectProperty m_CachedWMA; // 0x28c
};

struct UTgAnimBlendByAmmo : UTgAnimNodeBlendList {
	int32_t m_nDefaultChild; // 0x168
	TG_EQUIP_POINT m_EquipPoint; // 0x16c
	char m_bDelayUpdateUntilReplay : 1; // 0x170
	char m_bCheckAmmoPerTick : 1; // 0x170
	TArray<FAmmoBlendParams> m_ChildAmmoParams; // 0x174
	int32_t m_nPendingChildIndex; // 0x184
	int32_t m_nAmmoUpdateTickTag; // 0x188
};

struct UActorFactoryVehicle : UActorFactory {
	AVehicle* VehicleClass; // 0x9c
};

struct UTgInventoryObject_Listen_GiftGiver : UTgInventoryObject_Listen_AbilityProcBase {
	char m_bHasActivated : 1; // 0xcc
};

struct UOnlineTitleFileDownloadBase : UMCPBase {
	TArray<DelegateProperty> ReadTitleFileCompleteDelegates; // 0x80
	TArray<DelegateProperty> RequestTitleFileListCompleteDelegates; // 0x90
	FString BaseUrl; // 0xa0
	FString RequestFileListURL; // 0xb0
	FString RequestFileURL; // 0xc0
	float TimeOut; // 0xd0
	TArray<FFileNameToURLMapping> FilesToUrls; // 0xd4
	DelegateProperty __OnReadTitleFileComplete__Delegate; // 0xe4
	DelegateProperty __OnRequestTitleFileListComplete__Delegate; // 0xf4
};

struct ATgDevice_RestoreSoul : ATgDevice {
	ObjectProperty m_CachedOraclePawn; // 0xa04
	FImpactInfo m_CachedImpact; // 0xa0c
	char m_bApplyCooldown : 1; // 0xa88
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x74
};

struct UGFxEngine : UObject {
	TArray<FGCReference> GCReferences; // 0x60
	int32_t RefCount; // 0x70
	TArray<FName> ForceGarbageCollectUponReleaseTextures; // 0x74
};

struct ATgDevice_Emitter : ATgDevice {
	TArray<ObjectProperty> m_PawnsInRange; // 0xa04
	ObjectProperty m_CollisionProxy; // 0xa14
	char m_bHasProjector : 1; // 0xa1c
	char m_bIsOnOwner : 1; // 0xa1c
	float m_fProjectorPercent; // 0xa20
	ObjectProperty m_CachedPawnOwner; // 0xa24
};

struct UExporter : UObject {
	TArray<FString> FormatExtension; // 0x68
	TArray<FString> FormatDescription; // 0x78
};

struct UInGameAdManager : UPlatformInterfaceBase {
	char bShouldPauseWhileAdOpen : 1; // 0x80
};

struct UTgAIBehaviorAction_ReloadDevice : UTgAIBehaviorAction {
	TG_EQUIP_POINT DeviceToUse; // 0x94
};

struct UUIComponent_BattlePassRewardJoinedLevels : UUIComponent_Display {
	TArray<ObjectProperty> m_pLevels; // 0x124
	ObjectProperty m_mcHeader; // 0x134
	ObjectProperty m_mcTierLock; // 0x13c
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0xb0
};

struct UGameCrowd_ListOfAgents : UObject {
	TArray<FAgentArchetypeInfo> ListOfAgents; // 0x60
};

struct UTgParticleSystemComponent : UParticleSystemComponent {
	ComponentProperty m_AttachedToSkelMesh; // 0x3c8
	char m_bReenableAfterTeleport : 1; // 0x3d0
};

struct UUIComponent_RaumSoulCharges : UUIComponent_Display {
	ObjectProperty m_CachedRaum; // 0x124
	ObjectProperty m_mcText; // 0x12c
	ObjectProperty m_mcIcon; // 0x134
	ObjectProperty m_mcAnim; // 0x13c
	ObjectProperty m_mcMaxStacks; // 0x144
	char m_bIsHiding : 1; // 0x14c
	char m_bEnabled : 1; // 0x14c
	int32_t m_nCurrentSoulCharges; // 0x150
};

struct UTgAnimNodeBlendByBlink : UAnimNodeBlendPerBone {
	ObjectProperty m_TgPawn; // 0x158
	ComponentProperty m_SkelMesh; // 0x160
	float m_fBlinkAnimRate; // 0x168
	FVector2D m_vTimeBetweenBlinks; // 0x16c
	float m_fTimeTillNextBlink; // 0x174
	TArray<FName> m_DisableBlinkingAnimNodeNameList; // 0x178
	TArray<ObjectProperty> m_CachedNodeList; // 0x188
	char m_bInitializedCachedNodeList : 1; // 0x198
};

struct UUIComponent_HealthBar : UUIComponent_Display {
	TArray<ObjectProperty> m_mcHealthBarTicks; // 0x124
	TArray<ObjectProperty> m_mcHealthBarTickPool; // 0x134
	ObjectProperty m_mcHealthBarContainer; // 0x144
	TArray<FBarTickTypes> m_BarTickTypes; // 0x14c
	FBarTickTypes m_ArmorBarTickInfo; // 0x15c
	int32_t m_nLastUsedHealthTickColorFrame; // 0x19c
	float m_fDisplayedMaxHealth; // 0x1a0
	float m_fDisplayedHealthPct; // 0x1a4
	float m_fActualHealthPct; // 0x1a8
	float m_fLastDisplayedHealthPct; // 0x1ac
	float m_fDisplayedHealthNoArmorPct; // 0x1b0
	float m_fActualHealthNoArmorPct; // 0x1b4
	float m_fLastDisplayedHealthNoArmorPct; // 0x1b8
	float m_fDisplayedMaxArmor; // 0x1bc
	TArray<ObjectProperty> m_mcArmorBarTicks; // 0x1c0
	TArray<ObjectProperty> m_mcArmorBarTickPool; // 0x1d0
	ObjectProperty m_mcArmorBarContainer; // 0x1e0
	ObjectProperty m_mcArmorBarFrame; // 0x1e8
	float m_fDisplayedArmorPct; // 0x1f0
	float m_fActualArmorPct; // 0x1f4
	float m_fLastDisplayedArmorPct; // 0x1f8
	int32_t m_nMaxArmorTicks; // 0x1fc
	int32_t m_nCurrentArmorTicks; // 0x200
	float m_fArmorBarWidth; // 0x204
	float m_fArmorTickPadding; // 0x208
	float m_fDisplayedShieldPct; // 0x20c
	float m_fActualShieldPct; // 0x210
	float m_fLastDisplayedShieldPct; // 0x214
	float m_fHealthPerTick; // 0x218
	int32_t m_nMaxHealthTicks; // 0x21c
	int32_t m_nCurrentHealthTicks; // 0x220
	float m_fBarWidth; // 0x224
	float m_fTickPadding; // 0x228
	float m_fLowHealthThreshold; // 0x22c
	char m_bUseAbyssalEchoTickColor : 1; // 0x230
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0xb0
	ESceneTextureType SceneTextureType; // 0xe4
	char ScreenAlign : 1; // 0xe8
};

struct UParticleModuleLocationStaticVertSurface : UParticleModuleLocationBase {
	ELocationStaticVertSurfaceSource SourceType; // 0x68
	FVector UniversalOffset; // 0x6c
	char bUpdatePositionEachFrame : 1; // 0x78
	char bOrientMeshEmitters : 1; // 0x78
	char bEnforceNormalCheck : 1; // 0x78
	FName StaticMeshActorParamName; // 0x7c
	FVector NormalToCompare; // 0x84
	float NormalCheckToleranceDegrees; // 0x90
	float NormalCheckTolerance; // 0x94
	TArray<int32_t> ValidMaterialIndices; // 0x98
};

struct UAnimSequence : UObject {
	FName SequenceName; // 0x60
	TArray<FAnimNotifyEvent> Notifies; // 0x68
	TArray<ObjectProperty> MetaData; // 0x78
	TArray<FSkelControlModifier> BoneControlModifiers; // 0x88
	float SequenceLength; // 0x98
	int32_t NumFrames; // 0x9c
	float RateScale; // 0xa0
	char bParticleEffectsAreFootsteps : 1; // 0xa4
	char bNoLoopingInterpolation : 1; // 0xa4
	char bIsAdditive : 1; // 0xa4
	char bAdditiveBuiltLooping : 1; // 0xa4
	char bDoNotOverrideCompression : 1; // 0xa4
	char bHasBeenUsed : 1; // 0xa4
	char bWasCompressedWithoutTranslations : 1; // 0xa4
	TArray<FRawAnimSequenceTrack> RawAnimData; // 0xa8
	TArray<FRawAnimSequenceTrack> RawAnimationData; // 0xb8
	TArray<FTranslationTrack> TranslationData; // 0xc8
	TArray<FRotationTrack> RotationData; // 0xd8
	TArray<FCurveTrack> CurveData; // 0xe8
	AnimationCompressionFormat TranslationCompressionFormat; // 0xf8
	AnimationCompressionFormat RotationCompressionFormat; // 0xf9
	AnimationKeyFormat KeyEncodingFormat; // 0xfa
	TArray<int32_t> CompressedTrackOffsets; // 0xfc
	TArray<char> CompressedByteStream; // 0x10c
	FPointer TranslationCodec; // 0x11c
	FPointer RotationCodec; // 0x124
	TArray<FBoneAtom> AdditiveRefPose; // 0x12c
	TArray<FRawAnimSequenceTrack> AdditiveBasePose; // 0x13c
	int32_t EncodingPkgVersion; // 0x14c
	float UseScore; // 0x150
};

struct UMaterialExpressionTerrainLayerSwitch : UMaterialExpression {
	FPointer InstanceOverride; // 0xb0
	FExpressionInput LayerUsed; // 0xb8
	FExpressionInput LayerNotUsed; // 0xec
	FName ParameterName; // 0x120
	char PreviewUsed : 1; // 0x128
	FGuid ExpressionGUID; // 0x12c
};

struct UTgAnimNodeBlendByCombat : UTgAnimNodeBlendList {
	ObjectProperty m_TgP; // 0x168
};

struct ATgAkActor : AActor {
	char m_bCanCheckOcclusion : 1; // 0x280
};

struct ATgPawn_Character : ATgPawn_Biped {
	char c_bUpdatePlayerStatUI : 1; // 0x2fcc
	char m_bInHandFiring : 1; // 0x2fcc
	char r_bNearCapturePoint : 1; // 0x2fcc
	char r_bNearPayload : 1; // 0x2fcc
	char r_bNearSiegeMonster : 1; // 0x2fcc
	char r_bVisibleToEnemies : 1; // 0x2fcc
	char s_bAmmoReloadCheat : 1; // 0x2fcc
	char s_bAutomountProtection : 1; // 0x2fcc
	char m_bRecalcMoveSpeed : 0; // 0x2fcc
	char m_bAttemptingAirJump : 0; // 0x2fcc
	char m_bDelayingStopSpecialJumpFx : 0; // 0x2fcc
	char m_bPendingBounce : 0; // 0x2fcc
	char s_bInitiatingJoin : 0; // 0x2fcc
	char r_bJoinForceView : 0; // 0x2fcc
	char c_bInterpolatingFOV : 0; // 0x2fcc
	char s_bReplicateInhandAmmo : 0; // 0x2fcc
	char m_bPendingPawnModScan : 0; // 0x2fcc
	char c_bShouldTickThisFrame : 0; // 0x2fcc
	char r_bCanChangeLoadout : 0; // 0x2fcc
	float m_fLastCapturePointReclaimedTime; // 0x2fd0
	float m_fMinReclaimPointTime; // 0x2fd4
	float c_fUpdateAltitudeRTPCDelay; // 0x2fd8
	float m_fInHandStartFireTime; // 0x2fdc
	float m_fInHandStopFireTime; // 0x2fe0
	float m_fWallDamagePercent; // 0x2fe4
	float m_fSiegeDamagePercent; // 0x2fe8
	float r_fZoomAmt; // 0x2fec
	char r_nCriticalHit; // 0x2ff0
	float m_fMountZoomOverride; // 0x2ff4
	ObjectProperty r_StuckBombs[0x6]; // 0x2ff8
	int32_t m_nCharacterRole; // 0x3028
	ComponentProperty m_CustomCharacterComponent; // 0x302c
	ComponentProperty m_MountedCollisionComponent; // 0x3034
	ComponentProperty m_MeshEncompassingCollisionComponent; // 0x303c
	TArray<TScriptInterface<Class>> m_CachedMoveSpeedModDevices; // 0x3044
	TArray<TScriptInterface<Class>> m_CachedAccelModDevices; // 0x3054
	TArray<TScriptInterface<Class>> m_CachedDeployModDevices; // 0x3064
	int32_t m_nAirJumps; // 0x3074
	float m_fAirJumpZSpeed; // 0x3078
	FVector m_vBounceVelocity; // 0x307c
	ObjectProperty m_JoinTargetLocal; // 0x3088
	ObjectProperty m_JoinSourceLocal; // 0x3090
	ObjectProperty r_JoinTarget; // 0x3098
	FVector r_vJoinSourceLocation; // 0x30a0
	FVector r_vJoinTargetLocation; // 0x30ac
	float r_fJoinTweenDuration; // 0x30b8
	float c_fFOVInterpStartTimestamp; // 0x30bc
	float c_fFOVInterpStartValue; // 0x30c0
	float c_fFOVInterpEndTimestamp; // 0x30c4
	float c_fLastAppliedFOV; // 0x30c8
	ObjectProperty r_JoinSource; // 0x30cc
	TArray<FForceFaceTargetActor> m_ForceFaceActors; // 0x30d4
	float m_fForceFaceRotationTime; // 0x30e4
	FRotator m_rForcedRotation; // 0x30e8
	float m_fForceFaceRotationRate; // 0x30f4
	int32_t r_nInHandCurrentAmmo; // 0x30f8
	int32_t r_nInHandMaxAmmo; // 0x30fc
	int32_t s_nOppressorMineStackCount; // 0x3100
	float c_fTickCatchup; // 0x3104
	float m_fEmoteMoveSpeedCeiling; // 0x3108
	int32_t r_nEquippedEmotes[0x4]; // 0x310c
	int32_t r_nEquippedSprays[0x4]; // 0x311c
	FWeaponDOF m_CurrentDOFSettings; // 0x312c
	float m_fOverriddenFOV; // 0x3154
	ObjectProperty s_pCaptureProxy; // 0x3158
};

struct ATgDevice_DredgeRMB : ATgDevice {
	ObjectProperty m_CachedInhand; // 0xa04
	ObjectProperty m_RevealDev; // 0xa0c
};

struct UTgSeqAct_MarkSpawnReturn : USequenceAction {
	ObjectProperty m_Teleporter; // 0x108
};

struct UUIData_List : UUIData {
	TArray<ObjectProperty> pData; // 0x64
};

struct UUIDataProvider_OnlinePlayerDataBase : UUIDataProvider {
	int32_t PlayerControllerId; // 0x70
};

struct ATgProj_FuriaQ : ATgProj_Simulated {
	TArray<ObjectProperty> m_StunnedTargets; // 0x52c
	char m_bShouldCheckStop : 1; // 0x53c
	char m_bStopped : 1; // 0x53c
	FVector vTargetStopLocation; // 0x540
};

struct UTgAIBehaviorAction_MoveBase : UTgAIBehaviorAction {
	char bSubtractPawnRadius : 1; // 0x94
	char bSubtractTargetPawnRadius : 1; // 0x94
	char bLookAtTarget : 1; // 0x94
	char bMustHaveLOS : 1; // 0x94
	float MoveTolerance; // 0x98
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0xa0
	FName PropertyName; // 0xb0
};

struct UGameplayEventsHandler : UObject {
	TArray<int32_t> EventIDFilter; // 0x60
	TArray<FGameStatGroup> GroupFilter; // 0x70
	ObjectProperty Reader; // 0x80
};

struct USeqAct_SetMotionBlurParams : USeqAct_Latent {
	float MotionBlurAmount; // 0x120
	float InterpolateSeconds; // 0x124
	float InterpolateElapsed; // 0x128
	float OldMotionBlurAmount; // 0x12c
};

struct UHttpFactory : UObject {
	FString HttpRequestClassName; // 0x60
};

struct ATgDevice_Telepunch : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	ObjectProperty m_CachedDemon; // 0xa0c
	ObjectProperty m_HitCharacter; // 0xa14
	char m_bLiftApplied : 1; // 0xa1c
	char m_bStealthApplied : 1; // 0xa1c
	float m_fLerpTime; // 0xa20
	FVector m_vHitCharacterInitialLocation; // 0xa24
	float m_fHorizontalHitMaxDist; // 0xa30
	float m_fVerticalHitMaxDist; // 0xa34
	float m_fTeleportPreferedDistance; // 0xa38
	float m_fTargetLockTime; // 0xa3c
};

struct UActorFactoryAmbientSound : UActorFactory {
	ObjectProperty AmbientSoundCue; // 0x9c
};

struct ATgAbyssalEchoSpawnPoint : AActor {
	int32_t m_nTaskForceId; // 0x280
};

struct UTgAIBehaviorAction_UseConsumable : UTgAIBehaviorAction {
	EConsumableType ConsumableType; // 0x94
};

struct UParticleModuleTypeDataMesh : UParticleModuleTypeDataBase {
	ObjectProperty Mesh; // 0x68
	char CastShadows : 1; // 0x70
	char DoCollisions : 1; // 0x70
	char bAllowMotionBlur : 1; // 0x70
	char bOverrideMaterial : 1; // 0x70
	char bCameraFacing : 1; // 0x70
	char bApplyParticleRotationAsSpin : 1; // 0x70
	EMeshScreenAlignment MeshAlignment; // 0x74
	EParticleAxisLock AxisLockOption; // 0x75
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x76
	EMeshCameraFacingOptions CameraFacingOption; // 0x77
	float Pitch; // 0x78
	float Roll; // 0x7c
	float Yaw; // 0x80
};

struct ATgLobbyCamera : ACameraActor {
	ObjectProperty m_ViewTarget; // 0x420
	TArray<ObjectProperty> m_FriendlyTargets; // 0x428
	TArray<ObjectProperty> m_EnemyTargets; // 0x438
	FVector m_RenderCenterPointOffset; // 0x448
	char m_bActive : 1; // 0x454
	char m_bAdjustCameraToTarget : 1; // 0x454
	char m_bAdjustZoomByTargetHeight : 1; // 0x454
	char m_bFirstCameraEyeCheck : 1; // 0x454
	int32_t m_nPosition; // 0x458
	float m_fRemainingTweenTime; // 0x45c
	float m_fTotalTweenTime; // 0x460
	FTPOV m_TweenSourcePOV; // 0x464
	float m_fLateralOffsetMultiplier; // 0x488
	float m_fHorizontalOffsetMultiplier; // 0x48c
	float m_fViewLateralOffsetMultiplier; // 0x490
	float m_fViewHorizontalOffsetMultiplier; // 0x494
	float m_fMaxAdjustSpeedTranslation; // 0x498
	float m_fMaxAdjustSpeedRotation; // 0x49c
	FVector m_vViewOffset; // 0x4a0
	FVector m_vOriginalViewOffset; // 0x4ac
	float m_fZoomAdjustBaseHeight; // 0x4b8
	float m_fZoomAdjustMultiplier; // 0x4bc
	float m_fFirstCameraEyeCheckTimestamp; // 0x4c0
	ELobbyCameraTag m_CameraTag; // 0x4c4
};

struct UTgGameplayCurvesSet_AimAssistKeyframes : UTgGameplayCurvesSet {
	TArray<ObjectProperty> HorizMagnetKeyframes; // 0x64
	TArray<ObjectProperty> VertMagnetKeyframes; // 0x74
	TArray<ObjectProperty> FrictionKeyframes; // 0x84
	TArray<ObjectProperty> TrackingByAccuracyKeyframes; // 0x94
	TArray<ObjectProperty> TrackingByAngleKeyframes; // 0xa4
};

struct ALadder : ANavigationPoint {
	ObjectProperty MyLadder; // 0x378
	ObjectProperty LadderList; // 0x380
};

struct UTgMapInfo : UMapInfo {
	ObjectProperty m_EndFocusActor_TF1; // 0x60
	ObjectProperty m_EndFocusActor_TF2; // 0x68
	ObjectProperty m_FatalityFactory_TF1_2; // 0x70
	ObjectProperty m_FatalityFactory_TF1_3; // 0x78
	ObjectProperty m_FatalityFactory_TF1_4; // 0x80
	ObjectProperty m_FatalityFactory_TF2_2; // 0x88
	ObjectProperty m_FatalityFactory_TF2_3; // 0x90
	ObjectProperty m_FatalityFactory_TF2_4; // 0x98
	ObjectProperty m_OverlayPathMesh; // 0xa0
	FVector2D m_vMapCenter; // 0xa8
	FVector2D m_vTaskForce1BaseLocation; // 0xb0
	FVector2D m_vTaskForce2BaseLocation; // 0xb8
	float m_fLockViewBufferZoneSize; // 0xc0
	char m_bSupportsGuardianThrone : 1; // 0xc4
	float m_LitParticleBrightness; // 0xc8
};

struct USeqEvent_RigidBodyCollision : USequenceEvent {
	float MinCollisionVelocity; // 0x128
};

struct ATgWeaponMeshActor : AActor {
	ObjectProperty m_OwningPawn; // 0x280
	UTgSkeletalMeshComponent_Weapon* m_WeaponMesh1PClass; // 0x288
	ComponentProperty m_WeaponMesh1P; // 0x290
	UTgSkeletalMeshComponent_Weapon* m_WeaponMesh3PClass; // 0x298
	ComponentProperty m_WeaponMesh3P; // 0x2a0
	TArray<ObjectProperty> m_SimpleTransitionerNodes1P; // 0x2a8
	TArray<ObjectProperty> m_DeviceModeBlendNodes; // 0x2b8
	TArray<ObjectProperty> m_FitToDurationNodes; // 0x2c8
	TArray<ObjectProperty> m_PaladinsCharacterNodes; // 0x2d8
	TArray<ObjectProperty> m_TriggerCameraAnimNodes; // 0x2e8
	ObjectProperty PoseTransitioner; // 0x2f8
	TArray<ObjectProperty> m_PawnMeshSimpleTransitionerNodes; // 0x300
	TArray<ObjectProperty> m_PawnMeshFitToDurationNodes; // 0x310
	TArray<ObjectProperty> m_PawnMeshPaladinsCharacterNodes; // 0x320
	TArray<ObjectProperty> m_PawnMeshTriggerCameraAnimNodes; // 0x330
	int32_t m_nNumTracersPerShot; // 0x340
	int32_t m_nEquipSlot; // 0x344
	int32_t m_nDeviceId; // 0x348
	int32_t m_MeshAsmId1P; // 0x34c
	int32_t m_MeshAsmId3P; // 0x350
	ATgDevice* m_WeaponClass; // 0x354
	TG_PLAY_FIRE_EFFECT_ON m_PlayFireEffectsOn[0x31]; // 0x35c
	TG_EQUIP_POINT m_ActiveEquipPoint; // 0x38d
	EFirstPersonWeaponAttachState Current1pAttachState; // 0x38e
	char m_bShouldLoopingMuzzleTrace : 1; // 0x390
	char m_bUseSocketForCameraAttach : 1; // 0x390
	char m_bProceduralBob : 1; // 0x390
	char m_bIsFOVZoomed : 1; // 0x390
	char m_bFlourishBlocked : 1; // 0x390
	char m_bIsHoldingBeacon : 1; // 0x390
	char m_bWasViewTargetLastTick : 1; // 0x390
	char m_bUseCameraAnims : 1; // 0x390
	char c_bEnemyMatLoaded : 0; // 0x390
	char bUseEmitterPoolForTracers : 0; // 0x390
	ComponentProperty m_HandsMesh; // 0x394
	ComponentProperty m_HeadMesh1P; // 0x39c
	FVector2D m_v2WeaponLagAimOffset; // 0x3a4
	FVector2D m_nMaxWeaponLag; // 0x3ac
	FVector2D m_v2WeaponLagInterpSpeed; // 0x3b4
	FVector2D m_v2WeaponLagSmoothingFactor; // 0x3bc
	FRotator m_rLastRotation; // 0x3c4
	FVector2D m_fSmoothedAimOffset; // 0x3d0
	float m_fSmoothAimFactor; // 0x3d8
	ObjectProperty m_FireCameraShake; // 0x3dc
	int32_t m_nTracerCounter; // 0x3e4
	int32_t m_nTracerFrequency; // 0x3e8
	FName m_TracerName; // 0x3ec
	float m_fTracerLifetime; // 0x3f4
	FName m_HitTargetName; // 0x3f8
	FName m_HitWallName; // 0x400
	FName m_WhizbyName; // 0x408
	float m_BeamEmitterEndPointOffset; // 0x410
	int32_t m_nBeaconMeshId; // 0x414
	TArray<ObjectProperty> m_HitReactionSkelControls; // 0x418
	TArray<FQueuedImpactEffect> m_QueuedImpactEffects; // 0x428
	TArray<FQueuedImpactDecal> m_QueuedImpactDecals; // 0x438
	ObjectProperty m_GameplayCurves; // 0x448
};

struct UTgInventoryObject_Listen_LastStand : UTgInventoryObject_Listen_ActiveDuringAbility {
	char m_bHealthInActiveRange : 1; // 0xd4
};

struct ATgDevice_ShellSpin : ATgDevice_Charge {
	float m_fZoomDurationOverride; // 0xa78
};

struct ATgDevice_YingInhand : ATgDevice {
	ObjectProperty m_CachedYingPawn; // 0xa04
};

struct UMcpMessageManager : UMcpMessageBase {
	FPointer VfTable_FTickableObject; // 0xec
	FString CreateMessageUrl; // 0xf4
	FString DeleteMessageUrl; // 0x104
	FString QueryMessagesUrl; // 0x114
	FString QueryMessageContentsUrl; // 0x124
	FString DeleteAllMessagesUrl; // 0x134
	TArray<FMcpCompressMessageRequest> CompressMessageRequests; // 0x144
	TArray<FMcpUncompressMessageRequest> UncompressMessageRequests; // 0x154
};

struct UTgCombinedPostProcessEffect : UPostProcessEffect {
	FColor HitEffectColor; // 0x88
	FVector SceneShadows; // 0x8c
	FVector SceneHighLights; // 0x98
	FVector SceneMidTones; // 0xa4
	float SceneDesaturation; // 0xb0
	FVector SceneColorize; // 0xb4
};

struct ATgDeploy_Midnight : ATgDeployable {
	float r_fPersistTime; // 0x46c
	ObjectProperty r_TargetPawn; // 0x470
	ObjectProperty m_pMIC; // 0x478
	ATgMidnightFogVolumeDensityInfo* m_FogInfoClass; // 0x480
	ObjectProperty m_FogInfo; // 0x488
	char m_bCleanedUp : 1; // 0x490
	char m_b3PFxActive : 1; // 0x490
	char m_b1PSoundActive : 1; // 0x490
};

struct UTgSeqAct_SendPlayerTrackingEvent : USequenceAction {
	int32_t m_nEventId; // 0x108
	int32_t m_nSubEventID; // 0x10c
	FString m_ReferenceName; // 0x110
	int32_t m_nReferenceValue; // 0x120
};

struct UTgDeviceForm_ShadowDash : UTgDeviceForm {
	int32_t nDashFXIndex; // 0x28c
};

struct UUIData_Accolade : UUIData {
	int32_t m_nIconFrame; // 0x64
	int32_t m_nValue; // 0x68
	int32_t m_nTitleId; // 0x6c
};

struct UAmbientOcclusionEffect : UPostProcessEffect {
	FLinearColor OcclusionColor; // 0x88
	float OcclusionPower; // 0x98
	float OcclusionScale; // 0x9c
	float OcclusionBias; // 0xa0
	float MinOcclusion; // 0xa4
	char SSAO2 : 1; // 0xa8
	char bAngleBasedSSAO : 1; // 0xa8
	float OcclusionRadius; // 0xac
	float OcclusionAttenuation; // 0xb0
	EAmbientOcclusionQuality OcclusionQuality; // 0xb4
	float OcclusionFadeoutMinDistance; // 0xb8
	float OcclusionFadeoutMaxDistance; // 0xbc
	float HaloDistanceThreshold; // 0xc0
	float HaloDistanceScale; // 0xc4
	float HaloOcclusion; // 0xc8
	float EdgeDistanceThreshold; // 0xcc
	float EdgeDistanceScale; // 0xd0
	float FilterDistanceScale; // 0xd4
	int32_t FilterSize; // 0xd8
	float HistoryConvergenceTime; // 0xdc
	float HistoryWeightConvergenceTime; // 0xe0
};

struct ATgDevice_HealingStation : ATgDevice_TurretMod {
	float m_fFireTimer; // 0xa04
	ObjectProperty m_CachedPawnOwner; // 0xa08
};

struct UTgCameraModifier_LobbyCameraTransition : UCameraModifier {
	ObjectProperty SourceCamera; // 0x80
	ObjectProperty DestinationCamera; // 0x88
	CameraTransType TransitionType; // 0x90
	float fSlideDistance; // 0x94
};

struct ATgProj_BunnyHeal : ATgProj_Simulated {
	float m_fRetargetingTimer; // 0x52c
	float m_fRetargetTime; // 0x530
	ObjectProperty m_pBouncedFrom; // 0x534
	ObjectProperty m_CachedBunnyHeal; // 0x53c
};

struct UCloudStorageBase : UPlatformInterfaceBase {
	TArray<FString> LocalCloudFiles; // 0x80
	char bSuppressDelegateCalls : 1; // 0x90
};

struct ATgDevice_Vengeance_Lex : ATgDevice {
	ObjectProperty r_MarkedPlayer; // 0xa04
	ObjectProperty s_PreviouslyMarkedPlayer; // 0xa0c
	char s_bRevealApplied : 1; // 0xa14
	ObjectProperty s_DiscoveryDevice; // 0xa18
	float m_fMarkPlayerRefreshRate; // 0xa20
	float m_fCheckPlayerRefreshRate; // 0xa24
};

struct UUIData_List_PrimaryQueues : UUIData_List_TitleIcon {
	ObjectProperty pCustomData; // 0x88
	ObjectProperty pTrainingData; // 0x90
};

struct UTgInventoryObject_Listen_Combo_Evie : UTgInventoryObject_Listen_Combo {
	TArray<ObjectProperty> m_MarkedTargets; // 0xcc
	float m_fBlinkTimestamp; // 0xdc
	float m_fIceBlockTimestamp; // 0xe0
};

struct UDrawCylinderComponent : UPrimitiveComponent {
	FColor CylinderColor; // 0x24c
	ObjectProperty CylinderMaterial; // 0x250
	float CylinderRadius; // 0x258
	float CylinderTopRadius; // 0x25c
	float CylinderHeight; // 0x260
	float CylinderHeightOffset; // 0x264
	int32_t CylinderSides; // 0x268
	char bDrawWireCylinder : 1; // 0x26c
	char bDrawLitCylinder : 1; // 0x26c
	char bDrawOnlyIfSelected : 1; // 0x26c
};

struct UUIComponent_DLCPack : UUIComponent_Display {
	TArray<ObjectProperty> m_mcDetail; // 0x124
	ObjectProperty m_mcNew; // 0x134
	ObjectProperty m_mcTitle; // 0x13c
	ObjectProperty m_mcSubtitle; // 0x144
	ObjectProperty m_mcPrice; // 0x14c
	ObjectProperty m_mcConsolePrice; // 0x154
	ObjectProperty m_mcDollars; // 0x15c
	ObjectProperty m_mcCents; // 0x164
	ObjectProperty m_mcCurrency; // 0x16c
	ObjectProperty m_mcOneTimePurchase; // 0x174
	ObjectProperty m_mcBuyNowText; // 0x17c
	ObjectProperty m_mcRefund; // 0x184
	ObjectProperty m_mcRefundCurrency; // 0x18c
	ObjectProperty m_mcSaleBanner; // 0x194
	ObjectProperty m_mcDLCTexture; // 0x19c
	ObjectProperty m_mcPanelButton; // 0x1a4
	ObjectProperty m_pPurchaseButton; // 0x1ac
	ObjectProperty m_pRealMoneyPrice; // 0x1b4
	ObjectProperty m_pCrystalPrice; // 0x1bc
	ObjectProperty m_pPurchaseButtonNew; // 0x1c4
	ObjectProperty m_mcGamepadPrompt; // 0x1cc
	AdTextureSize m_eTextureSize; // 0x1d4
	char m_bIsPortrait : 1; // 0x1d8
	char m_bIsPanelButton : 1; // 0x1d8
	char m_bScaleOnRollover : 1; // 0x1d8
	char m_bShowDetailsOnSelect : 1; // 0x1d8
	int32_t m_nPackId; // 0x1dc
	FString m_sPackPrefix; // 0x1e0
	FName m_sGamepadBuyKey; // 0x1f0
};

struct UUIComponent_LootItem : UUIComponent_Display {
	ObjectProperty m_pItem; // 0x124
	ObjectProperty m_mcXName; // 0x12c
	ObjectProperty m_mcRentalIcon; // 0x134
	ObjectProperty m_mcRentalText; // 0x13c
};

struct UUIComponent_GoalReward : UUIComponent_Display {
	ObjectProperty m_mcTitle; // 0x124
	ObjectProperty m_mcItemName; // 0x12c
	ObjectProperty m_mcGoal; // 0x134
	ObjectProperty m_mcOwned; // 0x13c
	ObjectProperty m_mcLock; // 0x144
	ObjectProperty m_mcIcon; // 0x14c
	ObjectProperty m_Progress; // 0x154
};

struct UUIComponent_RolledItem : UUIComponent_Display {
	ObjectProperty m_pCard; // 0x124
	ObjectProperty m_pLegendaryCard; // 0x12c
	ObjectProperty m_pItem; // 0x134
	ObjectProperty m_mcItemDuplicateLabel; // 0x13c
	ObjectProperty m_pReplacementItem; // 0x144
	ObjectProperty m_pFrameButton; // 0x14c
	ObjectProperty m_SubItems; // 0x154
	ObjectProperty m_pEquipButton; // 0x15c
	ObjectProperty m_pEquippedText; // 0x164
	char bRollover : 1; // 0x16c
	ObjectProperty m_akItemAnimCurrency; // 0x170
};

struct UUIComponent_Skill : UUIComponent_Display {
	ObjectProperty m_mcPrompt; // 0x124
	ObjectProperty m_mcBase; // 0x12c
	ObjectProperty m_mcIcon; // 0x134
	ObjectProperty m_mcTitle; // 0x13c
	ObjectProperty m_mcDamage; // 0x144
	ObjectProperty m_mcSubtitle; // 0x14c
	ObjectProperty m_mcSubtitleShort; // 0x154
	ObjectProperty m_mcCooldown; // 0x15c
	ObjectProperty m_mcCooldownTF; // 0x164
};

struct UMaterialExpressionConstant2Vector : UMaterialExpression {
	float R; // 0xb0
	float G; // 0xb4
};

struct UTgInventoryObject_Listen_Combo_Grover : UTgInventoryObject_Listen_Combo {
	FVector m_vAxeStartingLocation; // 0xcc
};

struct UPComPictureInPictureScene : UObject {
	float SkyBrightness; // 0x60
	FColor SkyColor; // 0x64
	float LightBrightness; // 0x68
	char bAlwaysAllowAudioPlayback : 1; // 0x6c
	char bForceAllUsedMipsResident : 1; // 0x6c
	FPointer Scene; // 0x70
	TArray<ComponentProperty> Components; // 0x78
	ComponentProperty DirectionalLight; // 0x88
	ComponentProperty DirectionalBounceLight; // 0x90
	ComponentProperty SkyLight; // 0x98
	ComponentProperty LineBatcher; // 0xa0
};

struct UUIComponent_SocialPlayer : UUIComponent_Display {
	ObjectProperty m_mcName; // 0x124
	ObjectProperty m_pName; // 0x12c
	ObjectProperty m_Avatar; // 0x134
	ObjectProperty m_CrossplayIcon; // 0x13c
	ObjectProperty m_mcStatus; // 0x144
	ObjectProperty m_mcLevel; // 0x14c
	ObjectProperty m_mcLevelX; // 0x154
	ObjectProperty m_mcRankedIndicator; // 0x15c
	ObjectProperty m_mcRankedIcon; // 0x164
	ObjectProperty m_mcFrame; // 0x16c
	ObjectProperty m_mcTitle; // 0x174
	ObjectProperty m_mcAddIcon; // 0x17c
	ObjectProperty m_mcAddFrame; // 0x184
	ObjectProperty m_mcAddFrameBG; // 0x18c
};

struct UUIComponent_Button_LoadoutDeathCard : UUIComponent_Display {
	ObjectProperty m_mcDeathCard; // 0x124
	ObjectProperty m_mcName; // 0x12c
};

struct ATgHoldSpot : ATgDefensePoint {
	ObjectProperty HoldVehicle; // 0x3a0
};

struct UTgAIBehaviorCondition_CombatTargetInDeviceVolume : UTgAIBehaviorCondition {
	int32_t DeviceID; // 0x98
	char bMustBeEnemy : 1; // 0x9c
};

struct USeqVar_Bool : USequenceVariable {
	int32_t bValue; // 0xa0
};

struct UTexture2DDynamic : UTexture {
	int32_t SizeX; // 0x100
	int32_t SizeY; // 0x104
	EPixelFormat Format; // 0x108
	int32_t NumMips; // 0x10c
	char bIsResolveTarget : 1; // 0x110
};

struct UUIComponent_RatingInteractable : UUIComponent_Interactable {
	ObjectProperty m_mcRatingIcon; // 0x140
};

struct UUIComponent_PlaySettings : UUIComponent_Display {
	ObjectProperty m_mcTitle; // 0x124
	ObjectProperty m_mcSite; // 0x12c
	ObjectProperty m_mcSubtitle; // 0x134
	ObjectProperty m_pSiteSelectList; // 0x13c
	ObjectProperty m_pLeftArrow; // 0x144
	ObjectProperty m_pRightArrow; // 0x14c
	ObjectProperty m_pCloseButton; // 0x154
	ObjectProperty m_pConfirmButton; // 0x15c
	ObjectProperty m_pSelectedSite; // 0x164
	ObjectProperty m_pPreviewSite; // 0x16c
	float m_fPreviewTime; // 0x174
	float m_fPreviewDuration; // 0x178
};

struct UUIComponent_EventBundlePanelWithRewards : UUIComponent_EventBundlePanel {
	ObjectProperty m_mcRewards; // 0x144
	ObjectProperty m_mcRewardsCurrencyTitle; // 0x14c
	ObjectProperty m_mcRewardsDescription; // 0x154
	ObjectProperty m_mcRewardsHidePadding; // 0x15c
	ObjectProperty m_pRewardItems; // 0x164
	Fdword m_dwCurrentEventCurrencyType; // 0x16c
	Fdword m_dwCurrentEventRewardsXPTable; // 0x170
	Fdword m_dwCurrentEventRewardsVendor; // 0x174
};

struct ULightmassPrimitiveSettingsObject : UObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x60
};

struct UTgSkelCon_SkinGate : USkelControlBase {
	FSkelControlSkinGateChild DefaultChild; // 0xd0
	TArray<FSkelControlSkinGateChild> ChildControls; // 0xe4
};

struct UTgEffectForm_Maeve_Midnight : UTgEffectForm {
	int32_t m_nEndFXId; // 0xfc
	ObjectProperty m_pEndFX; // 0x100
	ObjectProperty m_pCameraEffect; // 0x108
	float m_fEndFXKillTime; // 0x110
};

struct UTexture : USurface {
	char SRGB : 1; // 0x60
	char RGBE : 1; // 0x60
	char bIsSourceArtUncompressed : 1; // 0x60
	char CompressionNoAlpha : 1; // 0x60
	char CompressionNone : 1; // 0x60
	char CompressionNoMipmaps : 1; // 0x60
	char CompressionFullDynamicRange : 1; // 0x60
	char DeferCompression : 1; // 0x60
	char NeverStream : 0; // 0x60
	char bDitherMipMapAlpha : 0; // 0x60
	char bPreserveBorderR : 0; // 0x60
	char bPreserveBorderG : 0; // 0x60
	char bPreserveBorderB : 0; // 0x60
	char bPreserveBorderA : 0; // 0x60
	char bNoTiling : 0; // 0x60
	char bForcePVRTC4 : 0; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 0; // 0x60
	char bUseCinematicMipLevels : 0; // 0x60
	float UnpackMin[0x4]; // 0x64
	float UnpackMax[0x4]; // 0x74
	FUntypedBulkData_Mirror SourceArt; // 0x84
	TextureCompressionSettings CompressionSettings; // 0xc4
	TextureFilter Filter; // 0xc5
	TextureGroup LODGroup; // 0xc6
	TextureGroup CachedLODGroup; // 0xc7
	TextureMipGenSettings MipGenSettings; // 0xc8
	int32_t LODBias; // 0xcc
	int32_t CachedCombinedLODBias; // 0xd0
	int32_t NumCinematicMipLevels; // 0xd4
	FPointer Resource; // 0xd8
	float AdjustBrightness; // 0xe0
	float AdjustBrightnessCurve; // 0xe4
	float AdjustVibrance; // 0xe8
	float AdjustSaturation; // 0xec
	float AdjustRGBCurve; // 0xf0
	float AdjustHue; // 0xf4
	int32_t InternalFormatLODBias; // 0xf8
	int32_t RequiredCreationFlags; // 0xfc
};

struct UPBRuleNodeRandom : UPBRuleNodeBase {
	int32_t NumOutputs; // 0x70
	int32_t MinNumExecuted; // 0x74
	int32_t MaxNumExecuted; // 0x78
};

struct UTgInvListener_KillVengeanceTarget : UTgInvListener {
	ObjectProperty m_CachedVengeance; // 0xc4
};

struct USeqAct_MobileAddInputZones : USequenceAction {
	FName ZoneName; // 0x108
	ObjectProperty NewZone; // 0x110
};

struct UAnimNodeAdditiveBlending : UAnimNodeBlend {
	char bPassThroughWhenNotRendered : 1; // 0x124
};

struct UActorFactoryApexDestructible : UActorFactory {
	char bStartAwake : 1; // 0x9c
	ERBCollisionChannel RBChannel; // 0xa0
	FRBCollisionChannelContainer CollideWithChannels; // 0xa4
	ObjectProperty DestructibleAsset; // 0xa8
};

struct USeqEvent_HudRenderImage : USeqEvent_HudRender {
	FLinearColor DisplayColor; // 0x140
	FVector DisplayLocation; // 0x150
	ObjectProperty DisplayTexture; // 0x15c
	float XL; // 0x164
	float YL; // 0x168
	float U; // 0x16c
	float V; // 0x170
	float UL; // 0x174
	float VL; // 0x178
};

struct AKActorFromStatic : AKActor {
	ObjectProperty MyStaticMeshActor; // 0x3b4
	float MaxImpulseSpeed; // 0x3bc
};

struct ATgTrigger_Use : ATrigger {
	FString m_sDisplayText; // 0x290
	FString m_sInactiveText; // 0x2a0
	int32_t m_nInteractDistance; // 0x2b0
	char m_bAimToInteract : 1; // 0x2b4
	int32_t m_nDisplayMsgId; // 0x2b8
	int32_t m_nInactiveMsgId; // 0x2bc
};

struct UTgDeviceForm_KingBomb : UTgDeviceForm {
	char m_bKingBombActive : 1; // 0x28c
};

struct UInterpTrackInstParticleReplay : UInterpTrackInst {
	float LastUpdatePosition; // 0x60
};

struct UTgAIBehaviorCondition_DistanceFromShield : UTgAIBehaviorCondition_DistanceBase {
	char bMustBeEnemy : 1; // 0x9c
};

struct UTgGamePhase_Branch : UTgGamePhase {
	char m_bConditionMet : 1; // 0xb8
};

struct UUIData_MatchInvitePlayerState : UUIData {
	Fdword m_dwPlayerId; // 0x64
	MatchInvitePlayerState m_eState; // 0x68
	Fdword m_dwAvatarIcon; // 0x6c
	char m_bLocalPlayer : 1; // 0x70
	char m_bInParty : 1; // 0x70
	char m_bFriendly : 1; // 0x70
};

struct USkelControl_Multiply : USkelControlBase {
	float Multiplier; // 0xd0
};

struct UInterpTrackFloatParticleParam : UInterpTrackFloatBase {
	FName ParamName; // 0xb8
};

struct UTgDeviceForm_Pursuit : UTgDeviceForm {
	ObjectProperty m_CachedLex; // 0x28c
	FName m_LeftSlideSkelControlName1P; // 0x294
	FName m_RightSlideSkelControlName1P; // 0x29c
	FName m_LeftSlideSkelControlName3P; // 0x2a4
	FName m_RightSlideSkelControlName3P; // 0x2ac
	ObjectProperty m_LeftSlideSkelControl1P; // 0x2b4
	ObjectProperty m_RightSlideSkelControl1P; // 0x2bc
	ObjectProperty m_LeftSlideSkelControl3P; // 0x2c4
	ObjectProperty m_RightSlideSkelControl3P; // 0x2cc
	float c_fPreviousLeftSlideStrength; // 0x2d4
	float c_fPreviousRightSlideStrength; // 0x2d8
	char m_bCachedDualFireParity : 1; // 0x2dc
};

struct UTgSetting : UTgObject {
	float m_fDefault; // 0x60
	float m_fConfigDefault; // 0x64
	float m_fOriginal; // 0x68
	float m_fMax; // 0x6c
	float m_fMin; // 0x70
	float m_fTemp; // 0x74
	float m_fValue; // 0x78
	float m_fPrecision; // 0x7c
	SETTING_TYPE m_eType; // 0x80
	TArray<FOptionData> m_Options; // 0x84
};

struct UTgSeqAct_AIStartFireAt : USequenceAction {
	char ForcedFireMode; // 0x108
};

struct UUIComponent_AbilityPointsPool : UUIComponent_Display {
	char m_bDirty : 1; // 0x124
	int32_t m_nTickCallbackHandle; // 0x128
	ObjectProperty m_mcAbilityPointsPool; // 0x12c
	ObjectProperty m_mcAbilityIcon[0x4]; // 0x134
	ObjectProperty m_mcPointsFill[0x4]; // 0x154
	ObjectProperty m_mcPointsText[0x4]; // 0x174
	ObjectProperty m_mcTalentFocusFrame[0x4]; // 0x194
	float m_fFillWidth; // 0x1b4
	int32_t m_nPoints[0x4]; // 0x1b8
	AbilityModifiedByDevice m_eFocusedAbility; // 0x1c8
};

struct UTgAnimBlendByRecoilTime : UAnimNodeBlend {
	ObjectProperty m_TgDeviceForm; // 0x124
	ObjectProperty m_TgPawn; // 0x12c
	float m_PctBlend; // 0x134
	float m_fBlendTime; // 0x138
	float m_fMaxRecoilTime; // 0x13c
};

struct UInterpTrackSound : UInterpTrackVectorBase {
	TArray<FSoundTrackKey> Sounds; // 0xb8
	char bPlayOnReverse : 1; // 0xc8
	char bContinueSoundOnMatineeEnd : 1; // 0xc8
	char bSuppressSubtitles : 1; // 0xc8
	char bTreatAsDialogue : 1; // 0xc8
};

struct USeqAct_SubtractFloat : USeqAct_SetSequenceVariable {
	float ValueA; // 0x108
	float ValueB; // 0x10c
	float FloatResult; // 0x110
	int32_t IntResult; // 0x114
};

struct UTgDeviceFire_DrogozInhand_Salvo : UTgDeviceFire_DrogozInhand {
	ObjectProperty m_CachedDrogozInhand; // 0x268
};

struct UTgInvListener_RaumFullRev : UTgInvListener {
	ObjectProperty m_CachedRaum; // 0xc4
	char m_bActiveEffects : 1; // 0xcc
};

struct UTgAnimBlendPerBone : UAnimNodeBlendPerBone {
	char m_bLoopSourceChild : 1; // 0x158
	char m_bLoopTargetChild : 1; // 0x158
	char m_bPlaySourceChild : 1; // 0x158
	char m_bPlayTargetChild : 1; // 0x158
	char m_bSetStrengthFromAnimNode : 1; // 0x158
	char m_bInvertStrengthFromAnimNode : 1; // 0x158
	char m_bInitializedCachedNodeList : 1; // 0x158
	TArray<FName> m_StrengthAnimNodeNameList; // 0x15c
	TArray<ObjectProperty> m_CachedNodeList; // 0x16c
};

struct ATgDevice_VanguardUlt : ATgDevice {
	ObjectProperty m_CachedVanguard; // 0xa04
	ObjectProperty s_Target; // 0xa0c
	FVector m_vThrowVector; // 0xa14
	FVector s_vServerGrabOffset; // 0xa20
	char c_bWaitingForHit : 1; // 0xa2c
	char m_bGrabFailed : 1; // 0xa2c
};

struct UMobileMenuScene : UObject {
	FString MenuName; // 0x60
	TArray<ObjectProperty> MenuObjects; // 0x70
	ObjectProperty SceneCaptionFont; // 0x80
	ObjectProperty InputOwner; // 0x88
	char bSceneDoesNotRequireInput : 1; // 0x90
	char bRelativeLeft : 1; // 0x90
	char bRelativeTop : 1; // 0x90
	char bRelativeWidth : 1; // 0x90
	char bRelativeHeight : 1; // 0x90
	char bApplyGlobalScaleLeft : 1; // 0x90
	char bApplyGlobalScaleTop : 1; // 0x90
	char bApplyGlobalScaleWidth : 1; // 0x90
	char bApplyGlobalScaleHeight : 0; // 0x90
	char TouchpadIndex; // 0x94
	float Left; // 0x98
	float Top; // 0x9c
	float Width; // 0xa0
	float Height; // 0xa4
	float InitialLeft; // 0xa8
	float InitialTop; // 0xac
	float InitialWidth; // 0xb0
	float InitialHeight; // 0xb4
	float AuthoredGlobalScale; // 0xb8
	float Opacity; // 0xbc
	ObjectProperty UITouchSound; // 0xc0
	ObjectProperty UIUnTouchSound; // 0xc8
};

struct UTgGameDC_Chat : UTgObject {
	FQueueMessage c_CurrentMessage; // 0x60
	TArray<FQueueMessage> c_QueuedMessages; // 0x90
	float c_fProcessTime; // 0xa0
	TArray<ObjectProperty> c_DeferredMessages; // 0xa4
	ObjectProperty m_scFirstBlood; // 0xb4
	TArray<FMessageToken> m_MessageTokens; // 0xbc
	float m_fLastEnemyKilledAllyMessageTime; // 0xcc
	float m_fMinEnemyKilledAllyMessageTime; // 0xd0
	float m_fLastAllyKilledEnemyMessageTime; // 0xd4
	float m_fMinAllyKilledEnemyMessageTime; // 0xd8
};

struct UUIDataProvider_OnlinePartyChatList : UUIDataProvider_OnlinePlayerDataBase {
	TArray<FOnlinePartyMember> PartyMembersList; // 0x74
	TArray<FString> NatTypes; // 0x84
	FString NickNameCol; // 0x94
	FString NatTypeCol; // 0xa4
	FString IsLocalCol; // 0xb4
	FString IsInPartyVoiceCol; // 0xc4
	FString IsTalkingCol; // 0xd4
	FString IsInGameSessionCol; // 0xe4
	FString IsPlayingThisGameCol; // 0xf4
};

struct ATgDevice_EnlightenmentGun : ATgDevice {
	ObjectProperty m_CachedPrincess; // 0xa04
	char m_bAutoFireAfterPostHitDelay : 1; // 0xa0c
};

struct UUIComponent_OptionEntryBase : UUIComponent_Interactable {
	ObjectProperty m_mcLabel; // 0x140
	ObjectProperty m_pGroup; // 0x148
};

struct UTgBeamHelper : UTgObject {
	int32_t m_nSpecialFxId; // 0x60
	ObjectProperty m_pSpecialFx; // 0x64
	TArray<ComponentProperty> m_pPSCList; // 0x6c
	char m_bVisibilityEnabled : 1; // 0x7c
	char m_bCurrentlyVisible : 1; // 0x7c
	char m_bRequiresTarget : 1; // 0x7c
	char m_bTangentsEnabled : 1; // 0x7c
	FVector m_vInitialTangent; // 0x80
	ObjectProperty m_pOwner; // 0x8c
	ObjectProperty m_pTarget; // 0x94
	ComponentProperty m_pAttachMesh; // 0x9c
	FName m_nmAttachMeshSocket; // 0xa4
};

struct UUIDataProvider_OnlinePlayerStorageArray : UUIDataProvider {
	ObjectProperty PlayerStorage; // 0x70
	int32_t PlayerStorageId; // 0x78
	FString ColumnHeaderText; // 0x7c
	TArray<FName> Values; // 0x8c
};

struct UTgAIBehaviorCondition_IsLastAttackerOfType : UTgAIBehaviorCondition {
	ECombatTargetType TargetType; // 0x98
};

struct UOnlineAuthInterfaceImpl : UObject {
	FPointer VfTable_IOnlineAuthInterface; // 0x60
	ObjectProperty OwningSubsystem; // 0x68
	char bAuthReady : 1; // 0x70
	FSparseArray_Mirror ClientAuthSessions; // 0x74
	FSparseArray_Mirror ServerAuthSessions; // 0xac
	FSparseArray_Mirror PeerAuthSessions; // 0xe4
	FSparseArray_Mirror LocalClientAuthSessions; // 0x11c
	FSparseArray_Mirror LocalServerAuthSessions; // 0x154
	FSparseArray_Mirror LocalPeerAuthSessions; // 0x18c
	TArray<DelegateProperty> AuthReadyDelegates; // 0x1c4
	TArray<DelegateProperty> ClientAuthRequestDelegates; // 0x1d4
	TArray<DelegateProperty> ServerAuthRequestDelegates; // 0x1e4
	TArray<DelegateProperty> ClientAuthResponseDelegates; // 0x1f4
	TArray<DelegateProperty> ServerAuthResponseDelegates; // 0x204
	TArray<DelegateProperty> ClientAuthCompleteDelegates; // 0x214
	TArray<DelegateProperty> ServerAuthCompleteDelegates; // 0x224
	TArray<DelegateProperty> ClientAuthEndSessionRequestDelegates; // 0x234
	TArray<DelegateProperty> ServerAuthRetryRequestDelegates; // 0x244
	TArray<DelegateProperty> ClientConnectionCloseDelegates; // 0x254
	TArray<DelegateProperty> ServerConnectionCloseDelegates; // 0x264
	DelegateProperty __OnAuthReady__Delegate; // 0x274
	DelegateProperty __OnClientAuthRequest__Delegate; // 0x284
	DelegateProperty __OnServerAuthRequest__Delegate; // 0x294
	DelegateProperty __OnClientAuthResponse__Delegate; // 0x2a4
	DelegateProperty __OnServerAuthResponse__Delegate; // 0x2b4
	DelegateProperty __OnClientAuthComplete__Delegate; // 0x2c4
	DelegateProperty __OnServerAuthComplete__Delegate; // 0x2d4
	DelegateProperty __OnClientAuthEndSessionRequest__Delegate; // 0x2e4
	DelegateProperty __OnServerAuthRetryRequest__Delegate; // 0x2f4
	DelegateProperty __OnClientConnectionClose__Delegate; // 0x304
	DelegateProperty __OnServerConnectionClose__Delegate; // 0x314
};

struct UMobileMenuBarItem : UObject {
	int32_t Width; // 0x60
	int32_t Height; // 0x64
	FVector2D VpPos; // 0x68
};

struct ATargetPoint : AKeypoint {
	int32_t SpawnRefCount; // 0x288
};

struct UImageBasedReflectionComponent : UStaticMeshComponent {
	char bEnabled : 1; // 0x310
	char bTwoSided : 1; // 0x310
	ObjectProperty ReflectionTexture; // 0x314
	FLinearColor ReflectionColor; // 0x31c
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x68
	FVector EndPoint1; // 0x74
	FRawDistributionFloat Range; // 0x80
	FRawDistributionFloat Strength; // 0xa4
};

struct UPComMusicThemePlayer : UObject {
	FPointer VfTable_FTickableObject; // 0x60
	FString MusicThemePath; // 0x68
	ObjectProperty MusicTheme; // 0x78
	ComponentProperty MusicComp; // 0x80
	ObjectProperty MusicSyncActor; // 0x88
	FName LastMusicEvent; // 0x90
	FMusicTrackStruct CurrentMusicTrack; // 0x98
	float CurrentMusicTrackStartTime; // 0xc4
	float CurrentMusicTrackDuration; // 0xc8
};

struct ATgPickupFactory_Item : ATgPickupFactory {
	ObjectProperty PickupSound; // 0x3d4
	FString PickupMessage; // 0x3dc
	float RespawnTime; // 0x3ec
};

struct UUIData_TitleQuantity : UUIData {
	FString m_sTitle; // 0x64
	int32_t m_nQuantity; // 0x74
	int32_t m_nTotal; // 0x78
};

struct UTgDeviceFire_CorvusBeacon : UTgDeviceFire {
	float m_fServerScaleBufferMult; // 0x268
	float m_fBaseEncroachmentActorRange; // 0x26c
	float m_fScaleYZ; // 0x270
};

struct UUIData_ChestDataWithCTA : UUIData {
	Fdword m_dwCTACount; // 0x64
	ObjectProperty m_pChestData; // 0x68
};

struct UUIComponent_CommendationToastEntry : UUIComponent_Display {
	ObjectProperty m_mcItemIcon; // 0x124
	ObjectProperty m_mcTitle; // 0x12c
	ObjectProperty m_mcDesc; // 0x134
	ObjectProperty m_mcPointsAmountTF; // 0x13c
	ObjectProperty m_pCloseButton; // 0x144
	float m_fOriginalXPos; // 0x14c
	float m_fWidth; // 0x150
	char m_bInitialized : 1; // 0x154
	char m_bAnimating : 1; // 0x154
	ToastSequence m_eAnimSequence; // 0x158
	float m_fAnimationTime; // 0x15c
};

struct UUIComponent_StoreAccount : UUIComponent_Display {
	ObjectProperty m_pRedeemCode; // 0x124
	ObjectProperty m_pPurchaseBoost; // 0x12c
	ObjectProperty m_pChangeName; // 0x134
	ObjectProperty m_grAccount; // 0x13c
};

struct UUIData : UObject {
	int32_t m_nPriority; // 0x60
};

struct UUIComponent_StoreDLC : UUIComponent_Display {
	ObjectProperty m_mcDLCOwnedTF; // 0x124
	ObjectProperty m_pDLCList; // 0x12c
	ObjectProperty m_pDLCListHorizontal; // 0x134
	ObjectProperty m_pLeftArrow; // 0x13c
	ObjectProperty m_pRightArrow; // 0x144
	ObjectProperty m_pUpArrow; // 0x14c
	ObjectProperty m_pDownArrow; // 0x154
	ObjectProperty m_mcTaxTF; // 0x15c
	ObjectProperty m_grDLC; // 0x164
	ObjectProperty m_grDLCHorizontal; // 0x16c
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct UPBRuleNodeWindowWall : UPBRuleNodeBase {
	float CellMaxSizeX; // 0x70
	float CellMaxSizeZ; // 0x74
	float WindowSizeX; // 0x78
	float WindowSizeZ; // 0x7c
	float WindowPosX; // 0x80
	float WindowPosZ; // 0x84
	char bScaleWindowWithCell : 1; // 0x88
	float YOffset; // 0x8c
	ObjectProperty Material; // 0x90
};

struct UNavMeshPathConstraint : UObject {
	ObjectProperty NextConstraint; // 0x60
	int32_t NumNodesProcessed; // 0x68
	int32_t NumThrownOutNodes; // 0x6c
	float AddedDirectCost; // 0x70
	float AddedHeuristicCost; // 0x74
};

struct USeqAct_SetPhysics : USequenceAction {
	EPhysics newPhysics; // 0x108
};

struct AWindDirectionalSource : AInfo {
	ComponentProperty Component; // 0x280
};

struct UTgDeviceForm_ToggleADS : UTgDeviceForm_ToggleWithLockout {
	float m_fTransitionAmount; // 0x28c
	float m_fTransitionPerSec; // 0x290
	float m_fDesiredScopeWorld1pFOV; // 0x294
	float m_fDesiredScopeWorld3pFOV; // 0x298
	float m_fLastSetWorldFOVInterp; // 0x29c
};

struct UTgEffectForm_Freeze : UTgEffectForm_DisablePawn {
	int32_t m_BurstingIceFXId; // 0x100
};

struct ATgDeploy_CommanderUlt : ATgDeploy_EffectField {
	ObjectProperty m_CameraShake; // 0x4a0
};

struct UInputContext : UObject {
	FPointer VfTable_ITgCallbackInterface; // 0x60
	ObjectProperty m_SuperContext; // 0x68
	TArray<ObjectProperty> m_SubContextStack; // 0x70
	char m_bPassInputToNextContext : 1; // 0x80
	char m_bBlockGlobalContext : 1; // 0x80
	TArray<ObjectProperty> m_InputActions; // 0x84
	ObjectProperty m_CallbackContainer; // 0x94
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0xb0
	FGuid ExpressionGUID; // 0xc0
};

struct AKAsset : AActor {
	ComponentProperty SkeletalMeshComponent; // 0x280
	char bDamageAppliesImpulse : 1; // 0x288
	char bWakeOnLevelStart : 1; // 0x288
	char bBlockPawns : 1; // 0x288
	ObjectProperty ReplicatedMesh; // 0x28c
	ObjectProperty ReplicatedPhysAsset; // 0x294
};

struct UMaterialExpressionDepthBiasBlend : UMaterialExpressionTextureSample {
	char bNormalize : 1; // 0x120
	float BiasScale; // 0x124
	FExpressionInput Bias; // 0x128
};

struct UTgAnimNodeBlendList : UAnimNodeBlendList {
	float DefaultBlendTime; // 0x144
	TArray<float> ChildBlendTimes; // 0x148
	TArray<FChildBlendParam> SpecificChildBlendTimes; // 0x158
};

struct ATgDevice_BombKingInhand : ATgDevice_DualWield {
	char r_bHasActiveProjectile : 1; // 0xa14
	char m_bInDetonationMode : 1; // 0xa14
	TArray<FStickyBombPendingDetonate> m_PendingDetonations; // 0xa18
	TArray<ObjectProperty> m_PendingProjectileConversions; // 0xa28
	TArray<int32_t> c_nLiveExplosiveIds; // 0xa38
	float m_fValidationTolerance; // 0xa48
	DelegateProperty __DetonatorFiringDelegate__Delegate; // 0xa4c
};

struct ATgDevice_LazarusInhand : ATgDevice_ChainSequence {
	TArray<FHitSoundData> HitActorsAngles; // 0xa10
	int32_t m_nHitIndex; // 0xa20
	DelegateProperty __InterruptFiringAndResetChainDelegate__Delegate; // 0xa24
};

struct ATgWeaponMeshActor_RiderInhand : ATgWeaponMeshActor {
	ObjectProperty m_AltFireFx; // 0x450
	char m_b3pFireShouldBeActive : 1; // 0x458
};

struct UTgDeviceForm_GrohkInhand : UTgDeviceForm {
	ObjectProperty m_SpinnerSkelControl; // 0x28c
};

struct UTgSkelCon_FootPlacement : USkelControlFootPlacement {
	char bShouldUseWorldDown : 1; // 0x158
};

struct UUIDataProvider_SettingsArray : UUIDataProvider {
	ObjectProperty Settings; // 0x70
	int32_t SettingsId; // 0x78
	FName SettingsName; // 0x7c
	FString ColumnHeaderText; // 0x84
	TArray<FIdToStringMapping> Values; // 0x94
};

struct UTgInvListener_SoulChargesActive : UTgInventoryObject_Listen_AbilityProcBase {
	char m_bIsListenerActive : 1; // 0xcc
	char m_bIsCardLogicActive : 1; // 0xcc
};

struct UTgSeqAct_SetInputEnabled : USequenceAction {
	char bEnableMoveForward : 1; // 0x108
	char bEnableMoveBackward : 1; // 0x108
	char bEnableMoveLeft : 1; // 0x108
	char bEnableMoveRight : 1; // 0x108
	char bEnableLookUp : 1; // 0x108
	char bEnableLookDown : 1; // 0x108
	char bEnableLookLeft : 1; // 0x108
	char bEnableLookRight : 1; // 0x108
	char bEnableJumping : 0; // 0x108
	char bEnableMounting : 0; // 0x108
	char bEnableAuto : 0; // 0x108
	char bEnableAlt : 0; // 0x108
	char bEnableBattleAbility : 0; // 0x108
	char bEnableMovementAbility : 0; // 0x108
	char bEnableUltimate : 0; // 0x108
	char bEnableEmote : 0; // 0x108
};

struct UGameEngine : UEngine {
	ObjectProperty GPendingLevel; // 0x8a4
	FString PendingLevelPlayerControllerClassName; // 0x8ac
	FURL LastURL; // 0x8bc
	FURL LastRemoteURL; // 0x924
	TArray<FString> ServerActors; // 0x98c
	FString TravelURL; // 0x99c
	char TravelType; // 0x9ac
	char bWorldWasLoadedThisTick : 1; // 0x9b0
	char bWorldWasLoadedLastTick : 1; // 0x9b0
	char bCheckForMovieCapture : 1; // 0x9b0
	char bTriggerPostLoadMap : 1; // 0x9b0
	char bStartedLoadMapMovie : 1; // 0x9b0
	char bShouldCommitPendingMapChange : 1; // 0x9b0
	char bClearAnimSetLinkupCachesOnLoadMap : 1; // 0x9b0
	char bEnableSecondaryDisplay : 1; // 0x9b0
	char bEnableSecondaryViewport : 0; // 0x9b0
	ObjectProperty OnlineSubsystem; // 0x9b4
	ObjectProperty GamePadLightbarSubsystem; // 0x9bc
	ObjectProperty DLCEnumerator; // 0x9c4
	FString DownloadableContentEnumeratorClassName; // 0x9cc
	ObjectProperty DLCManager; // 0x9dc
	FString DownloadableContentManagerClassName; // 0x9e4
	TArray<FName> LevelsToLoadForPendingMapChange; // 0x9f4
	TArray<ObjectProperty> LoadedLevelsForPendingMapChange; // 0xa04
	FString PendingMapChangeFailureDescription; // 0xa14
	float MaxDeltaTime; // 0xa24
	FString SecondaryViewportClientClassName; // 0xa28
	TArray<ObjectProperty> SecondaryViewportClients; // 0xa38
	TArray<FPointer> SecondaryViewportFrames; // 0xa48
	TArray<FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0xa58
	TArray<ObjectProperty> ObjectReferencers; // 0xa68
	TArray<FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0xa78
	TArray<FNamedNetDriver> NamedNetDrivers; // 0xa88
	TArray<FAnimTag> AnimTags; // 0xa98
};

struct ACameraActor : AActor {
	char bConstrainAspectRatio : 1; // 0x280
	char bCamOverridePostProcess : 1; // 0x280
	float AspectRatio; // 0x284
	float FOVAngle; // 0x288
	float CamOverridePostProcessAlpha; // 0x28c
	FPostProcessSettings CamOverridePostProcess; // 0x290
	ComponentProperty DrawFrustum; // 0x410
	ComponentProperty MeshComp; // 0x418
};

struct ATgPathfinder : AActor {
	FPointer VfTable_IInterface_NavigationHandle; // 0x280
	float m_fMaxSpeed; // 0x288
	TArray<FVector> m_vWaypoints; // 0x28c
	float m_fPathCheckRadius; // 0x29c
	ObjectProperty m_NavigationHandle; // 0x2a0
	ObjectProperty m_Spline; // 0x2a8
	ObjectProperty m_CurrentSpline; // 0x2b0
	float m_fCurrentSplineDist; // 0x2b8
	FNavMeshPathParams m_NavMeshPathParams; // 0x2bc
	TArray<ObjectProperty> m_ActiveWalkers; // 0x2f4
	float m_WalkerLifeSpan; // 0x304
	DelegateProperty __OnFinishedPathing__Delegate; // 0x308
};

struct ATgGame_Paladins_CrazyKing : ATgGame_Paladins {
	float m_fSetupDuration; // 0x868
	float m_fRoundDuration; // 0x86c
	TArray<ObjectProperty> m_CapturePoints; // 0x870
	int32_t m_nCurrentActivePointIndex; // 0x880
	int32_t m_nLastActivePointIndex; // 0x884
	ObjectProperty m_currentActiveCapturePoint; // 0x888
	float m_fMaxDistanceBetweenConsecutivePoints; // 0x890
};

struct UUIComponent_ItemRadialMenu_Text : UUIComponent_Display {
	ObjectProperty m_mcLock; // 0x124
	ObjectProperty m_mcRarityText; // 0x12c
	ObjectProperty m_mcBackgroundFade; // 0x134
	ObjectProperty m_mcBackgroundFrame; // 0x13c
	ObjectProperty m_mcBackgroundColor; // 0x144
	ObjectProperty m_mcBackgroundHighlight; // 0x14c
	ObjectProperty m_mcKeybind; // 0x154
	int32_t m_nPadding; // 0x15c
};

struct UTgGamePhase_ScoreOnKill : UTgGamePhase {
	int32_t m_nPointsPerKill; // 0xb8
};

struct USeqAct_ToggleConstraintDrive : USequenceAction {
	char bEnableAngularPositionDrive : 1; // 0x108
	char bEnableAngularVelocityDrive : 1; // 0x108
	char bEnableLinearPositionDrive : 1; // 0x108
	char bEnableLinearvelocityDrive : 1; // 0x108
};

struct UUIDataStore_OnlinePlayerData : UUIDataStore_Remote {
	ObjectProperty FriendsProvider; // 0x98
	int32_t PlayerControllerId; // 0xa0
	FString PlayerNick; // 0xa4
	FString ProfileSettingsClassName; // 0xb4
	UOnlineProfileSettings* ProfileSettingsClass; // 0xc4
	ObjectProperty ProfileProvider; // 0xcc
	FString ProfileProviderClassName; // 0xd4
	UUIDataProvider_OnlineProfileSettings* ProfileProviderClass; // 0xe4
	FString PlayerStorageClassName; // 0xec
	UOnlinePlayerStorage* PlayerStorageClass; // 0xfc
	ObjectProperty StorageProvider; // 0x104
	FString StorageProviderClassName; // 0x10c
	UUIDataProvider_OnlinePlayerStorage* StorageProviderClass; // 0x11c
	ObjectProperty FriendMessagesProvider; // 0x124
	ObjectProperty AchievementsProvider; // 0x12c
	FString FriendsProviderClassName; // 0x134
	UUIDataProvider_OnlineFriends* FriendsProviderClass; // 0x144
	FString FriendMessagesProviderClassName; // 0x14c
	UUIDataProvider_OnlineFriendMessages* FriendMessagesProviderClass; // 0x15c
	FString AchievementsProviderClassName; // 0x164
	UUIDataProvider_PlayerAchievements* AchievementsProviderClass; // 0x174
	FString PartyChatProviderClassName; // 0x17c
	UUIDataProvider_OnlinePartyChatList* PartyChatProviderClass; // 0x18c
	ObjectProperty PartyChatProvider; // 0x194
};

struct UTgAnimBlendByDirection : UTgAnimNodeBlendList {
	ObjectProperty m_TgPawn; // 0x168
	EBlendByDirectionSpeedType m_SpeedType; // 0x170
	EBlendDirTypes LastDirection; // 0x171
	char bAdjustRateByVelocity : 1; // 0x174
	char bNoDirectionIsEnabled : 1; // 0x174
	char bResetLooping : 1; // 0x174
	char m_bDelayBlendOutToPlayAnim : 1; // 0x174
	char m_bIsAllowedToBlendOut : 1; // 0x174
	char m_bMirrorDirectionsWhenPawnMirrored : 1; // 0x174
	char m_bStopChildrenOnCeaseRelevant : 1; // 0x174
};

struct UDOFEffect : UPostProcessEffect {
	float FalloffExponent; // 0x88
	float BlurKernelSize; // 0x8c
	float MaxNearBlurAmount; // 0x90
	float MinBlurAmount; // 0x94
	float MaxFarBlurAmount; // 0x98
	EFocusType FocusType; // 0x9c
	float FocusInnerRadius; // 0xa0
	float FocusDistance; // 0xa4
	FVector FocusPosition; // 0xa8
};

struct UTgDeviceForm_RuckusInhand : UTgDeviceForm {
	char m_bFiredFromLeftGun : 1; // 0x28c
	char m_bFiredFromTopBarrel : 1; // 0x28c
	char m_bPlayingSpinnerSound : 1; // 0x28c
	char m_bPlayingFireLoopSound : 1; // 0x28c
	char m_bIsFiring : 1; // 0x28c
	ObjectProperty m_SpinnerSkelControl1P; // 0x290
	ObjectProperty m_SpinnerSkelControl3P; // 0x298
	FName c_nmSocketLeft; // 0x2a0
	FName c_nmSocketRight; // 0x2a8
	float m_fLoopingSoundThreshold; // 0x2b0
	float m_fLastSpinConfirmationTimestamp; // 0x2b4
	float m_fSpinConfirmationCooldown; // 0x2b8
	ObjectProperty m_LowerRightBarrel1P; // 0x2bc
	ObjectProperty m_UpperRightBarrel1P; // 0x2c4
	ObjectProperty m_LowerLeftBarrel1P; // 0x2cc
	ObjectProperty m_UpperLeftBarrel1P; // 0x2d4
	ObjectProperty m_LowerRightBarrel3P; // 0x2dc
	ObjectProperty m_UpperRightBarrel3P; // 0x2e4
	ObjectProperty m_LowerLeftBarrel3P; // 0x2ec
	ObjectProperty m_UpperLeftBarrel3P; // 0x2f4
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	FPointer FloatProp; // 0x70
	float ResetFloat; // 0x78
	FPointer DistributionProp; // 0x7c
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x6c
	FRawDistributionVector OffsetAmount; // 0x70
	FOrbitOptions OffsetOptions; // 0x94
	FRawDistributionVector RotationAmount; // 0x98
	FOrbitOptions RotationOptions; // 0xbc
	FRawDistributionVector RotationRateAmount; // 0xc0
	FOrbitOptions RotationRateOptions; // 0xe4
};

struct USoundNodeRandom : USoundNode {
	TArray<float> Weights; // 0x74
	int32_t PreselectAtLevelLoad; // 0x84
	char bRandomizeWithoutReplacement : 1; // 0x88
	TArray<char> HasBeenUsed; // 0x8c
	int32_t NumRandomUsed; // 0x9c
};

struct UTgDeviceForm_Spray : UTgDeviceForm {
	TArray<ObjectProperty> m_SprayMaterial; // 0x28c
	ObjectProperty m_SprayMIC; // 0x29c
	ComponentProperty c_SpawnedDecal; // 0x2a4
	int32_t m_nRandAlphaMaskMax; // 0x2ac
	int32_t m_nPrevAlphaMask; // 0x2b0
	ObjectProperty c_SprayHitFX; // 0x2b4
	ObjectProperty c_SprayMissedFX; // 0x2bc
	TArray<FSpraySetup> m_SpraySetups; // 0x2c4
	int32_t m_nActiveSpraySetup; // 0x2d4
	int32_t m_nDesiredSprayDeviceId; // 0x2d8
};

struct UUIComponent_NotificationEntry : UUIComponent_Display {
	ObjectProperty m_mcTitle; // 0x124
	ObjectProperty m_mcDesc; // 0x12c
	ObjectProperty m_mcTimestamp; // 0x134
	ObjectProperty m_mcCategory; // 0x13c
	ObjectProperty m_mcItemIconTexture; // 0x144
	ObjectProperty m_mcGFxImageStack; // 0x14c
	ObjectProperty m_mcChestImageStack; // 0x154
	ObjectProperty m_mcDefaultIcon; // 0x15c
	ObjectProperty m_mcLoadingFrame; // 0x164
	ObjectProperty m_mcDeathCard; // 0x16c
	ObjectProperty m_pAvatar; // 0x174
	ObjectProperty m_pCTA; // 0x17c
	ObjectProperty m_pGoToButton; // 0x184
	ObjectProperty m_pClearButton; // 0x18c
	ObjectProperty m_pFrameButton; // 0x194
};

struct UGameCheatManager : UCheatManager {
	ObjectProperty DebugCameraControllerRef; // 0x80
	ADebugCameraController* DebugCameraControllerClass; // 0x88
	FString DebugCameraControllerClassName; // 0x90
};

struct UMaterialExpressionTransform : UMaterialExpression {
	FExpressionInput Input; // 0xb0
	EMaterialVectorCoordTransformSource TransformSourceType; // 0xe4
	EMaterialVectorCoordTransform TransformType; // 0xe5
};

struct UBookMark2D : UObject {
	float Zoom2D; // 0x60
	FIntPoint Location; // 0x64
};

struct UFracturedStaticMeshComponent : UFracturedBaseComponent {
	TArray<char> FragmentNeighborsVisible; // 0x338
	FBox VisibleBox; // 0x348
	char bUseSkinnedRendering : 1; // 0x364
	char bUseVisibleVertsForBounds : 1; // 0x364
	char bTopFragmentsRootNonDestroyable : 1; // 0x364
	char bBottomFragmentsRootNonDestroyable : 1; // 0x364
	float TopBottomFragmentDistThreshold; // 0x368
	ObjectProperty LoseChunkOutsideMaterialOverride; // 0x36c
	float FragmentBoundsMaxZ; // 0x374
	float FragmentBoundsMinZ; // 0x378
	ComponentProperty SkinnedComponent; // 0x37c
};

struct UTgAnimNodeSlot : UAnimNodeSlot {
	ObjectProperty m_TgPawn; // 0x138
	char m_bBlendOutIfVelocityIsGreaterThanZero : 1; // 0x140
	char m_bIsTransitionAnim : 1; // 0x140
	char m_bNotifyActorOnChildAnimEnd : 1; // 0x140
	FName m_nmHackingTransitionAnimName; // 0x144
	FName m_nmHackingLoopingAnimName; // 0x14c
	FName m_nmAFKTransitionAnimName; // 0x154
	FName m_nmAFKLoopingAnimName; // 0x15c
	FName m_nmQueuedAnim; // 0x164
};

struct UMcpIdMappingBase : UMcpServiceBase {
	FString McpIdMappingClassName; // 0x78
	DelegateProperty __OnAddMappingComplete__Delegate; // 0x88
	DelegateProperty __OnQueryMappingsComplete__Delegate; // 0x98
};

struct UTgSkelCon_OscillateTranslation : USkelControlSingleBone {
	float OscillationAmplitude; // 0x100
	float OscillationFrequency; // 0x104
	FVector OscillationAxis; // 0x108
	EBoneControlSpace OscillationAxisSpace; // 0x114
	FName OscillationAxisSpaceBoneName; // 0x118
	float Theta; // 0x120
};

struct USeqAct_FeatureTest : USeqAct_Log {
	FString FreezeAtParameters; // 0x12c
	float ScreenShotDelay; // 0x13c
	FString ScreenShotName; // 0x140
	float RemainingScreenShotDelay; // 0x150
};

struct UMaterialExpressionFluidNormal : UMaterialExpression {
	FExpressionInput Coordinates; // 0xb0
};

struct UTgDeviceForm : UObject {
	FPointer VfTable_FCallbackEventDevice; // 0x60
	ObjectProperty PawnOwner; // 0x68
	FEquipDeviceInfo c_EquipDeviceInfo; // 0x70
	int32_t m_nDeviceType; // 0x7c
	DeviceTargetMode m_eTargetingMode; // 0x80
	ETargetingModeStatus c_eTargetingModeStatus; // 0x81
	char c_bDeployed : 1; // 0x84
	char c_bHandDevice : 1; // 0x84
	char c_bDisableDefaultTimelapseRecovery : 1; // 0x84
	char c_bIsTransitioningToNewMode : 1; // 0x84
	char c_bTargetingModeEnabled : 1; // 0x84
	char c_bTargeterInitializedThisTick : 1; // 0x84
	char c_bTargeterIsInWorldDPG : 1; // 0x84
	char c_bUseInstigatorMesh : 1; // 0x84
	char c_bIsInHand : 0; // 0x84
	char m_bInitializingAssets : 0; // 0x84
	char m_bLoopWhileFiringCameraAnim : 0; // 0x84
	char m_bUseImpactFXOverride : 0; // 0x84
	char m_bRecoilTimerActive : 0; // 0x84
	char m_bForce1pViewWhileFiring : 0; // 0x84
	char m_bForce3PViewWhileFiring : 0; // 0x84
	char m_bForce3PViewInBuildup : 0; // 0x84
	TArray<ObjectProperty> c_PawnAnimSetOverrideList; // 0x88
	TArray<FModeData> ModeDatas; // 0x98
	FPointer m_pAmSetup; // 0xa8
	ComponentProperty c_Mesh; // 0xb0
	ComponentProperty c_AttachedMesh; // 0xb8
	ComponentProperty c_ThirdPersonMesh; // 0xc0
	ComponentProperty c_FirstPersonMesh; // 0xc8
	FName c_nmMountPoint; // 0xd0
	FName FormState; // 0xd8
	int32_t c_nFireMode; // 0xe0
	int32_t c_nEquipSlot; // 0xe4
	float c_fLastReceivedRefireTime; // 0xe8
	float c_fLastFireTimestamp; // 0xec
	int32_t c_nLastFxMode; // 0xf0
	ObjectProperty c_TargetingModeMeshIndicator; // 0xf4
	ObjectProperty c_TargetingModeFx; // 0xfc
	FAimData c_TargetingAim; // 0x104
	int32_t c_nTargetingModeFxId; // 0x138
	float c_fRemainingTransitionTime; // 0x13c
	float c_fTotalTransitionTime; // 0x140
	ObjectProperty m_LockedTarget; // 0x144
	ObjectProperty m_AssetReference; // 0x14c
	ObjectProperty m_OwnerActor; // 0x154
	TArray<ObjectProperty> m_AbilityBlendList1P; // 0x15c
	TArray<ObjectProperty> m_AbilityBlendList3P; // 0x16c
	TArray<ObjectProperty> m_ChannelFireBlendList1P; // 0x17c
	TArray<ObjectProperty> m_ChannelFireBlendList3P; // 0x18c
	TArray<ObjectProperty> m_TargetingBlendList1P; // 0x19c
	TArray<ObjectProperty> m_TargetingBlendList3P; // 0x1ac
	TArray<ObjectProperty> m_ToggleTransitionNodes1P; // 0x1bc
	TArray<ObjectProperty> m_ToggleTransitionNodes3P; // 0x1cc
	TArray<ObjectProperty> m_AmmoBlendList1P; // 0x1dc
	TArray<ObjectProperty> m_AmmoBlendList3P; // 0x1ec
	TArray<ObjectProperty> m_CooldownSyncNode1P; // 0x1fc
	TArray<ObjectProperty> m_CooldownSyncNode3P; // 0x20c
	TArray<ObjectProperty> m_DeviceEquippedNode1P; // 0x21c
	TArray<ObjectProperty> m_DeviceEquippedNode3P; // 0x22c
	ObjectProperty m_WhileFiringCameraAnimInst; // 0x23c
	float m_fWhileFiringCameraAnimBlendInTime; // 0x244
	float m_fWhileFiringCameraAnimBlendOutTime; // 0x248
	FPointer m_RandomShotSpreadStream; // 0x24c
	int32_t m_nLastSetShotSpreadSeed; // 0x254
	int32_t m_nSyntheticVisualBurstRate; // 0x258
	int32_t m_nSyntheticShotsRemaining; // 0x25c
	float m_fSyntheticShotRefireRate; // 0x260
	float m_fSyntheticShotTimer; // 0x264
	FSyntheticImpactEffectArgs m_SyntheticImpactArgs; // 0x268
	ObjectProperty m_GameplayCurves; // 0x280
	float m_fRecoilTimer; // 0x288
};

struct ATgSkeletalMeshActor : ASkeletalMeshActor {
	FMeshAssets c_MeshAssets; // 0x2e8
	char c_bLoadMeshAssetts : 1; // 0x328
};

struct USeqAct_SetVelocity : USequenceAction {
	FVector VelocityDir; // 0x108
	float VelocityMag; // 0x114
	char bVelocityRelativeToActorRotation : 1; // 0x118
};

struct ATgPawn_LanePusherBase : ATgPawn_Biped {
	float s_fSpeedMultiplierToCatchUpToSquad; // 0x2fcc
	ObjectProperty s_PlayerAttacker; // 0x2fd0
	ObjectProperty r_StartSpline; // 0x2fd8
	ObjectProperty r_ServerSyncSpline; // 0x2fe0
	FServerSplineSync r_ServerSync; // 0x2fe8
	char m_bMoving : 1; // 0x2ff0
	char c_bServerSync : 1; // 0x2ff0
	char m_bDoNotScaleCollisionBoxWithDatabase : 1; // 0x2ff0
	char m_bApplySplinePitchToActor : 1; // 0x2ff0
	char c_bApplySplinePitchToMesh : 1; // 0x2ff0
	char m_bFullStopWhenNoDesiredSpeed : 1; // 0x2ff0
	char s_bStopBackpeddlingAtCheckpoints : 1; // 0x2ff0
	char m_bAllowBackpeddling : 1; // 0x2ff0
	char m_bDestroyed : 0; // 0x2ff0
	char r_bAsleep : 0; // 0x2ff0
	ObjectProperty m_Spline; // 0x2ff4
	ComponentProperty m_CollisionBox; // 0x2ffc
	float m_fSplineDist; // 0x3004
	float c_fSplineDistCorrection; // 0x3008
	float c_fClientSideMovementFudgeFactor; // 0x300c
	float c_fClientCorrectionTolerance; // 0x3010
	float c_fClientCorrectionRate; // 0x3014
	float m_fGroundSpeedScaleLastTick; // 0x3018
	float r_fTrackGroundSpeed; // 0x301c
	float m_fAcceleration; // 0x3020
};

struct ATgDevice_FlakInhand : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	ObjectProperty m_KineticDevice; // 0xa0c
};

struct APlayerCollectorGame : AGameInfo {
	int32_t NumberOfClientsToWaitFor; // 0x4cc
	FString URLToLoad; // 0x4d0
};

struct ATgGame_Paladins_Assault : ATgGame_Paladins_Siege {
	float m_fAttackDuration; // 0xa64
	float m_fAttackPhaseOvertimeDuration; // 0xa68
	float m_fAttackCaptureRateMultiplier; // 0xa6c
	ObjectProperty m_AttackPoint; // 0xa70
	char m_bInAttackPhaseOvertime : 1; // 0xa78
	float m_fTakeoverSecondPhaseInstructionDelay; // 0xa7c
};

struct UTgAIBehaviorAction_Juke : UTgAIBehaviorAction {
	float JukeDist; // 0x94
	float JukeProbability; // 0x98
};

struct UTgSeqAct_FadeOut : USequenceAction {
	float m_fDuration; // 0x108
};

struct ANxForceFieldTornado : ANxForceField {
	ObjectProperty Shape; // 0x2d4
	ComponentProperty DrawComponent; // 0x2dc
	float RadialStrength; // 0x2e4
	float RotationalStrength; // 0x2e8
	float LiftStrength; // 0x2ec
	float ForceRadius; // 0x2f0
	float ForceTopRadius; // 0x2f4
	float LiftFalloffHeight; // 0x2f8
	float EscapeVelocity; // 0x2fc
	float ForceHeight; // 0x300
	float HeightOffset; // 0x304
	char BSpecialRadialForceMode : 1; // 0x308
	float SelfRotationStrength; // 0x30c
	FPointer Kernel; // 0x310
};

struct ATerrain : AInfo {
	TArray<FTerrainHeight> Heights; // 0x280
	TArray<FTerrainInfoData> InfoData; // 0x290
	TArray<FTerrainLayer> Layers; // 0x2a0
	int32_t NormalMapLayer; // 0x2b0
	TArray<FTerrainDecoLayer> DecoLayers; // 0x2b4
	TArray<FAlphaMap> AlphaMaps; // 0x2c4
	TArray<ComponentProperty> TerrainComponents; // 0x2d4
	int32_t NumSectionsX; // 0x2e4
	int32_t NumSectionsY; // 0x2e8
	TArray<FTerrainWeightedMaterial> WeightedMaterials; // 0x2ec
	TArray<ObjectProperty> WeightedTextureMaps; // 0x2fc
	int32_t MaxTesselationLevel; // 0x30c
	int32_t MinTessellationLevel; // 0x310
	float TesselationDistanceScale; // 0x314
	float TessellationCheckDistance; // 0x318
	int32_t CollisionTesselationLevel; // 0x31c
	FCachedTerrainMaterialArray CachedTerrainMaterials[0x2]; // 0x320
	int32_t NumVerticesX; // 0x340
	int32_t NumVerticesY; // 0x344
	int32_t NumPatchesX; // 0x348
	int32_t NumPatchesY; // 0x34c
	int32_t MaxComponentSize; // 0x350
	int32_t StaticLightingResolution; // 0x354
	char bIsOverridingLightResolution : 1; // 0x358
	char bBilinearFilterLightmapGeneration : 1; // 0x358
	char bCastShadow : 1; // 0x358
	char bForceDirectLightMap : 1; // 0x358
	char bCastDynamicShadow : 1; // 0x358
	char bEnableSpecular : 1; // 0x358
	char bBlockRigidBody : 1; // 0x358
	char bAllowRigidBodyUnderneath : 1; // 0x358
	char bAcceptsDynamicLights : 0; // 0x358
	char bMorphingEnabled : 0; // 0x358
	char bMorphingGradientsEnabled : 0; // 0x358
	char bLocked : 0; // 0x358
	char bHeightmapLocked : 0; // 0x358
	char bShowingCollision : 0; // 0x358
	char bUseWorldOriginTextureUVs : 0; // 0x358
	char bShowWireframe : 0; // 0x358
	ObjectProperty TerrainPhysMaterialOverride; // 0x35c
	FLightingChannelContainer LightingChannels; // 0x364
	FLightmassPrimitiveSettings LightmassSettings; // 0x368
	FPointer ReleaseResourcesFence; // 0x384
	int32_t EditorTessellationLevel; // 0x38c
	TArray<FSelectedTerrainVertex> SelectedVertices; // 0x390
	FColor WireframeColor; // 0x3a0
};

struct UUIData_List_TitleIcon : UUIData_List {
	int32_t nIcon; // 0x74
	TArray<FString> sTitles; // 0x78
};

struct UUIComponent_RewardPanel : UUIComponent_Display {
	char m_bShowingDetails : 1; // 0x124
	FProgressInfo m_pCurrentInfo; // 0x128
	FProgressInfo m_pEndingInfo; // 0x138
	ObjectProperty m_akLevelUp; // 0x148
	ObjectProperty m_akRankUp; // 0x150
	ObjectProperty m_mcPanelTitleTF; // 0x158
	ObjectProperty m_mcProgressBar; // 0x160
	ObjectProperty m_mcLevelTF; // 0x168
	ObjectProperty m_mcCurrentLevelTF; // 0x170
	ObjectProperty m_mcRequiredXPTF; // 0x178
	ObjectProperty m_mcLevelUpTF; // 0x180
	ObjectProperty m_mcRankIcon; // 0x188
	ObjectProperty m_mcReward; // 0x190
	ObjectProperty m_mcNextRewardTF; // 0x198
	ObjectProperty m_mcRewardNameTF; // 0x1a0
	ObjectProperty m_mcRewardRankIcon; // 0x1a8
	ObjectProperty m_pCurrentXP; // 0x1b0
	ObjectProperty m_pXPGained; // 0x1b8
	ObjectProperty m_pRewardItem; // 0x1c0
	ObjectProperty m_pProgressBarA; // 0x1c8
	ObjectProperty m_pProgressBarB; // 0x1d0
	ObjectProperty m_pDetailEntries; // 0x1d8
	ObjectProperty m_pFrameButton; // 0x1e0
	ObjectProperty m_pProgressButton; // 0x1e8
};

struct UUIComponent_StoreFeatured : UUIComponent_Display {
	TArray<FJsonFeatureData> m_pFeatureData; // 0x124
	TMap<None, None> m_pFeatureMap; // 0x134
	ObjectProperty m_pJsonPanels[0x7]; // 0x17c
	ObjectProperty m_pCarouselPanel; // 0x1b4
	ObjectProperty m_grFeatured; // 0x1bc
};

struct USeqAct_GetLocationAndRotation : USequenceAction {
	FVector Location; // 0x108
	FVector RotationVector; // 0x114
	FVector Rotation; // 0x120
	FName SocketOrBoneName; // 0x12c
};

struct ATgRepInfo_Factory : AReplicationInfo {
	ReplicatedFactoryState s_FactoryState; // 0x280
	ReplicatedFactoryState r_FactoryState[0x3]; // 0x281
	char r_bVisibleOnMap[0x3]; // 0x284
	char r_bRespawnVisible[0x3]; // 0x287
	MinimapFactoryType r_MinimapType; // 0x28a
	ObjectProperty r_FactoryOwner; // 0x28c
	ObjectProperty r_TaskforceInfo; // 0x294
	int32_t r_nFactoryId; // 0x29c
	ObjectProperty r_LastSpawnedRepInfo; // 0x2a0
	float r_fRespawnDelay; // 0x2a8
	float r_fRespawnTimer; // 0x2ac
};

struct UUIMoviePlayer : UGFxMoviePlayer {
	int32_t m_nLastTimerIndex; // 0x1f8
	char m_bInitialized : 1; // 0x1fc
	char m_bInTransition : 1; // 0x1fc
	char m_bResizeForSafeZones : 1; // 0x1fc
	ObjectProperty m_mcRoot; // 0x200
	ObjectProperty m_mcGlobal; // 0x208
	ObjectProperty m_DataHandler; // 0x210
	ObjectProperty m_TimerManager; // 0x218
	UTgDataHandler* m_DataHandlerClass; // 0x220
	FPointer m_pTgCallbackDevice; // 0x228
	FPointer m_pKeybindLookup; // 0x230
	ObjectProperty OnlineSub; // 0x238
	TScriptInterface<Class> GameInterface; // 0x240
	TScriptInterface<Class> VoiceInterface; // 0x250
	TScriptInterface<Class> PlayerInterface; // 0x260
	TScriptInterface<Class> ContentInterface; // 0x270
	TScriptInterface<Class> PlayerInterfaceEx; // 0x280
	TScriptInterface<Class> MarketplaceInterface; // 0x290
};

struct UTgGamePhase_RandomChild : UTgGamePhase {
	char m_bSequentiallyUnique : 1; // 0xb8
	int32_t m_nPreviousChildIndex; // 0xbc
};

struct UUIDataLoadouts : UUIDataObject {
	TMap<None, None> m_Loadouts; // 0x74
	FMultiMap_Mirror m_TemplateLoadouts; // 0xbc
	FMultiMap_Mirror m_EventTemplateLoadouts; // 0x104
	TArray<FPendingImportRequest> m_PendingImports; // 0x14c
	char m_bEventTemplatesActive : 1; // 0x15c
	int32_t m_nEventTemplateVendorId; // 0x160
};

struct UTgImpactFx : UObject {
	float c_fMaxFxDistance; // 0x60
	char c_bAlignToSurfaceNormal : 1; // 0x64
	FIMPACT_FX c_EmptyImpact; // 0x68
	TArray<FIMPACT_FX> c_Impacts; // 0x9c
};

struct UParticleSystemComponent : UPrimitiveComponent {
	ObjectProperty Template; // 0x24c
	UParticleLightEnvironmentComponent* LightEnvironmentClass; // 0x254
	ObjectProperty LightEnvironmentSharedInstigator; // 0x25c
	int32_t MaxLightEnvironmentPooledReuses; // 0x264
	TArray<FPointer> EmitterInstances; // 0x268
	TArray<ComponentProperty> SMComponents; // 0x278
	TArray<ObjectProperty> SMMaterialInterfaces; // 0x288
	TArray<ComponentProperty> SkelMeshComponents; // 0x298
	TArray<FViewParticleEmitterInstanceMotionBlurInfo> ViewMBInfoArray; // 0x2a8
	char bAutoActivate : 1; // 0x2b8
	char bWasCompleted : 1; // 0x2b8
	char bHasDurationElapsed : 1; // 0x2b8
	char bSuppressSpawning : 1; // 0x2b8
	char bWasDeactivated : 1; // 0x2b8
	char bResetOnDetach : 1; // 0x2b8
	char bUpdateOnDedicatedServer : 1; // 0x2b8
	char bJustAttached : 1; // 0x2b8
	char bIsActive : 0; // 0x2b8
	char bHasBeenActivated : 0; // 0x2b8
	char bWasRecycledSinceLastTick : 0; // 0x2b8
	char bWarmingUp : 0; // 0x2b8
	char bIsCachedInPool : 0; // 0x2b8
	char bOverrideLODMethod : 0; // 0x2b8
	char bSkipUpdateDynamicDataDuringTick : 0; // 0x2b8
	char bSkipBoundsUpdate : 0; // 0x2b8
	char bUpdateComponentInTick : 0; // 0x2b8
	char bDeferredBeamUpdate : 0; // 0x2b8
	char bForcedInActive : 0; // 0x2b8
	char bIsWarmingUp : 0; // 0x2b8
	char bIsViewRelevanceDirty : 0; // 0x2b8
	char bRecacheViewRelevance : 0; // 0x2b8
	char m_EmitBasedOnAnimNotify : 0; // 0x2b8
	char bLODUpdatePending : 0; // 0x2b8
	char bSkipSpawnCountCheck : 0; // 0x2b8
	char m_bRealTimeTicking : 0; // 0x2b8
	char bHasSavedScale3D : 0; // 0x2b8
	TArray<FParticleSysParam> InstanceParameters; // 0x2bc
	FVector OldPosition; // 0x2cc
	FVector PartSysVelocity; // 0x2d8
	float WarmupTime; // 0x2e4
	float WarmupTickRate; // 0x2e8
	int32_t LODLevel; // 0x2ec
	float SecondsBeforeInactive; // 0x2f0
	float TimeSinceLastForceUpdateTransform; // 0x2f4
	float MaxTimeBeforeForceUpdateTransform; // 0x2f8
	float AccumTickTime; // 0x2fc
	ParticleSystemLODMethod LODMethod; // 0x300
	ParticleReplayState ReplayState; // 0x301
	TArray<FMaterialViewRelevance> CachedViewRelevanceFlags; // 0x304
	float m_ActiveRemainingTime; // 0x314
	FParticleChannelContainer m_ParticleChannels; // 0x318
	TArray<ObjectProperty> ReplayClips; // 0x31c
	int32_t ReplayClipIDNumber; // 0x32c
	int32_t ReplayFrameIndex; // 0x330
	float AccumLODDistanceCheckTime; // 0x334
	TArray<FParticleEventSpawnData> SpawnEvents; // 0x338
	TArray<FParticleEventDeathData> DeathEvents; // 0x348
	TArray<FParticleEventCollideData> CollisionEvents; // 0x358
	TArray<FParticleEventKismetData> KismetEvents; // 0x368
	TArray<FParticleEventAttractorCollideData> AttractorCollisionEvents; // 0x378
	FPointer ReleaseResourcesFence; // 0x388
	float CustomTimeDilation; // 0x390
	float EmitterDelay; // 0x394
	float FOV; // 0x398
	FVector SavedScale3D; // 0x39c
	DelegateProperty __OnSystemFinished__Delegate; // 0x3a8
	DelegateProperty __OnSystemDurationElapsed__Delegate; // 0x3b8
};

struct UParticleModuleLocationPrimitiveSphere : UParticleModuleLocationPrimitiveBase {
	FRawDistributionFloat StartRadius; // 0xb4
};

struct UTgAnimNodeTiltTowardsVelocity : UAnimNodeBlendBase {
	FVector2D m_MaximumVelocity; // 0x114
	int32_t m_PitchOffset; // 0x11c
	int32_t m_MaximumPitchOffset; // 0x120
	int32_t m_RollOffset; // 0x124
	int32_t m_MaximumRollOffset; // 0x128
	ObjectProperty m_Pawn; // 0x12c
};

struct ATgDevice_ActivateOnChildGeneric1 : ATgDevice {
	ObjectProperty m_LinkedDev; // 0xa04
};

struct ATgDevice_Survival : ATgDevice {
	ObjectProperty m_ThrustDevice; // 0xa04
};

struct UUIComponent_EndOfMatchLobbyTrials : UUIComponent_Display {
	ObjectProperty m_pEventChallengeList; // 0x124
	TArray<ObjectProperty> m_pInactiveTrials; // 0x12c
	ObjectProperty m_pGoToTrials; // 0x13c
	ObjectProperty m_pGoToTrialText; // 0x144
	ObjectProperty m_pGoToTrialsAction; // 0x14c
};

struct UUIComponent_ItemStatsEntry : UUIComponent_Display {
	FString m_sItemStatsLabels[0x7]; // 0x124
	ObjectProperty m_mcIcon; // 0x194
	ObjectProperty m_mcTF; // 0x19c
};

struct UTgAnimNodeSelfDestruct : UTgAnimNodeSequence {
	int32_t NumberOfLoopsBeforeDestruct; // 0x1bc
	int32_t LoopsCompleted; // 0x1c0
	TArray<FName> ScaleOutSkelControlNames; // 0x1c4
	float TimeRemaingForScaleOut; // 0x1d4
	TArray<ObjectProperty> ScaleOutSkelControls; // 0x1d8
	TArray<float> ScaleOutStartScales; // 0x1e8
	float ScaleOutStartTime; // 0x1f8
};

struct UUIComponent_TargeterManager : UUIComponent_Display {
	ObjectProperty m_mcOwningScene; // 0x124
	UObject* pTargeterClass; // 0x12c
	char m_TargeterID; // 0x134
	TArray<ObjectProperty> m_Targeters; // 0x138
};

struct UUIScene_UICouponAcquisition : UUIScene {
	ObjectProperty m_CouponAcquisitionInput; // 0x1cc
};

struct UForceFieldShapeCapsule : UForceFieldShape {
	ComponentProperty Shape; // 0x60
};

struct USequence : USequenceOp {
	FPointer LogFile; // 0xec
	TArray<ObjectProperty> SequenceObjects; // 0xf4
	TArray<ObjectProperty> ActiveSequenceOps; // 0x104
	TArray<ObjectProperty> NestedSequences; // 0x114
	TArray<ObjectProperty> UnregisteredEvents; // 0x124
	TArray<FActivateOp> DelayedActivatedOps; // 0x134
	TArray<ObjectProperty> DelayedLatentOps; // 0x144
	char bEnabled : 1; // 0x154
	TArray<FQueuedActivationInfo> QueuedActivations; // 0x158
	int32_t DefaultViewX; // 0x168
	int32_t DefaultViewY; // 0x16c
	float DefaultViewZoom; // 0x170
};

struct UTgSeqAct_GetPlayerCount : USequenceAction {
	int32_t m_nTaskForce; // 0x108
	float m_fPlayerCount; // 0x10c
	float m_fAssaultCount; // 0x110
	float m_fMedicCount; // 0x114
	float m_fReconCount; // 0x118
	float m_fRoboticsCount; // 0x11c
};

struct UGameCameraBase : UObject {
	ObjectProperty PlayerCamera; // 0x60
	char bResetCameraInterpolation : 1; // 0x68
};

struct UTgAnimNodeBlendAnimsByDirection : UAnimNodeSequenceBlendBase {
	float m_BlendSpeed; // 0x1bc
	char m_bUsePlayRateByDirection : 1; // 0x1c0
	char m_bIncludeStandingAnim : 1; // 0x1c0
	char m_bForceStanding : 1; // 0x1c0
	char m_bInterpolateWeights : 1; // 0x1c0
	char m_bMirrorDirectionsWhenPawnMirrored : 1; // 0x1c0
	char m_bForwardLeftCorrection : 1; // 0x1c0
	float m_PlayRateByDirection[0x8]; // 0x1c4
	float m_PlayRateStanding; // 0x1e4
	float m_fStillThreshold; // 0x1e8
	float m_DirAngle; // 0x1ec
	float m_LastRelevantTime; // 0x1f0
};

struct ATgDevice_ArcingBeam : ATgDevice {
	TArray<FArcingInfo> m_ArcingList; // 0xa04
	int32_t m_nMaxNumArcsPerTarget; // 0xa14
	char m_bCanTargetShields : 1; // 0xa18
	char m_bIsArcing : 1; // 0xa18
};

struct UUIComponent_BattlePassChallenge : UUIComponent_Display {
	char m_bGated : 1; // 0x124
	char m_bCompleted : 1; // 0x124
	ObjectProperty m_mcExpanded; // 0x128
	ObjectProperty m_mcExpandedIcon; // 0x130
	ObjectProperty m_mcExpandedTitle; // 0x138
	ObjectProperty m_mcExpandedRewardLabel; // 0x140
	ObjectProperty m_mcExpandedRewardTF; // 0x148
	ObjectProperty m_mcTierTF; // 0x150
	ObjectProperty m_pGoalList; // 0x158
	ObjectProperty m_mcCollapsed; // 0x160
	ObjectProperty m_mcCollapsedIcon; // 0x168
	ObjectProperty m_mcCollapsedTitle; // 0x170
	ObjectProperty m_mcCollapsedRewardLabel; // 0x178
	ObjectProperty m_mcCollapsedRewardTF; // 0x180
	ObjectProperty m_mcLockedTF; // 0x188
};

struct UMaterialExpressionTextureSampleParameterNormal : UMaterialExpressionTextureSampleParameter {
	FPointer InstanceOverride; // 0x140
};

struct UTgGamePhase_RoundReset : UTgGamePhase {
	char m_bAutoMountAtEnd : 1; // 0xb8
};

struct UMultiProviderAnalytics : UAnalyticEventsBase {
	TArray<FString> AnalyticsProviderClassNames; // 0x98
	TArray<ObjectProperty> AnalyticsProviders; // 0xa8
};

struct UTgSkelControlSingleBone_DisplayGroup : UTgSkelControlSingleBone {
	TArray<FDisplayGroupInfo> DisplayGroupInfos; // 0x124
};

struct ATgPawn_LanePusher : ATgPawn_LanePusherBase {
	char m_bInIntroduction : 1; // 0x3024
	char r_bIsInsideBase : 1; // 0x3024
	char m_bHarvestTexturesForFadeMIC : 1; // 0x3024
	char m_bBroadcastDeath : 1; // 0x3024
	EDestroyedAnimStages c_eDestroyedAnimStage; // 0x3028
	ObjectProperty c_BeamFX; // 0x302c
	float m_fBaseWheelSpeed; // 0x3034
	int32_t m_nMaxLevel; // 0x3038
	int32_t m_nFriendlyFadeMaterialFXId; // 0x303c
	int32_t m_nEnemyFadeMaterialFXId; // 0x3040
	TArray<ObjectProperty> m_FadeMICs; // 0x3044
	float m_fDamageScaleWhileTraveling; // 0x3054
};

struct UTgSeqAct_SetLobbyMeshSkin : USequenceAction {
	int32_t m_nMessageSkinId; // 0x108
	int32_t m_nMessageDeviceSkinId; // 0x10c
	int32_t m_nSkinId; // 0x110
	int32_t m_nDeviceSkinId; // 0x114
};

struct ATgEmitterCrashlanding : ATgEmitterSpawnable {
	ComponentProperty m_PrimaryMesh; // 0x294
	ComponentProperty m_SecondaryMesh; // 0x29c
	float ParticleDurationAfterImpact; // 0x2a4
	ComponentProperty m_LensFlare; // 0x2a8
	ComponentProperty m_AudioComponent; // 0x2b0
};

struct ATgDevice_Toggle : ATgDevice {
	char m_bIsToggle : 1; // 0xa04
};

struct UTgGameDataHandler : UTgDataHandler {
	ObjectProperty m_Game; // 0x11c
};

struct UTgSeqAct_GiveCredits : USequenceAction {
	int32_t CreditsToGive; // 0x108
};

struct UUIComponent_DruidGuardianInfo : UUIComponent_Display {
	ObjectProperty m_mcStun; // 0x124
	ObjectProperty m_StunCD; // 0x12c
	ObjectProperty m_Health; // 0x134
	ObjectProperty m_CachedDruid; // 0x13c
	char m_bUIStunRushInCooldown : 1; // 0x144
	char m_bIsVisible : 1; // 0x144
	float m_fUIStunRushCooldownTimeLeft; // 0x148
	float m_fUIStunRushCooldownTimeTotal; // 0x14c
	int32_t m_nLastUIStunRushNonce; // 0x150
	int32_t m_nLastFoxActivityNonce; // 0x154
	float m_fFoxActivityPingCooldown; // 0x158
	float m_fFoxActivityPingCooldownTotal; // 0x15c
};

struct UCheatManager : UObject {
	FString ViewingFrom; // 0x60
	FString OwnCamera; // 0x70
};

struct UTgAIBehaviorSensor_SafeToRecall : UTgAIBehaviorSensor {
	float SafeRecallDist; // 0x94
};

struct ASplineActor : AActor {
	TArray<FSplineConnection> Connections; // 0x280
	FVector SplineActorTangent; // 0x290
	FColor SplineColor; // 0x29c
	char bDisableDestination : 1; // 0x2a0
	char bAlreadyVisited : 1; // 0x2a0
	TArray<ObjectProperty> LinksFrom; // 0x2a4
	ObjectProperty nextOrdered; // 0x2b4
	ObjectProperty prevOrdered; // 0x2bc
	ObjectProperty previousPath; // 0x2c4
	int32_t bestPathWeight; // 0x2cc
	int32_t visitedWeight; // 0x2d0
	FInterpCurveFloat SplineVelocityOverTime; // 0x2d4
};

struct UTgSeqEvent_SpawnWise : USequenceEvent {
	int32_t Taskforce; // 0x128
};

struct UMaterialExpressionLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
	FExpressionInput Alpha; // 0x118
};

struct UUIScene_UIPatchNotesPopup : UUIScene {
	ObjectProperty m_mcTitle; // 0x1cc
	ObjectProperty m_CarouselPanel; // 0x1d4
	ObjectProperty m_pNextButton; // 0x1dc
	TArray<FJsonFeatureData> m_FeatureData; // 0x1e4
	TMap<None, None> m_FeatureMap; // 0x1f4
};

struct UTgAnimNotify_Sound : UAnimNotify_Sound {
	TArray<FPSE_Skin> m_SkinOverrideList; // 0x88
};

struct UMaterialInstanceTimeVarying : UMaterialInstance {
	char bAutoActivateAll : 1; // 0x2f4
	float Duration; // 0x2f8
	TArray<FFontParameterValueOverTime> FontParameterValues; // 0x2fc
	TArray<FScalarParameterValueOverTime> ScalarParameterValues; // 0x30c
	TArray<FTextureParameterValueOverTime> TextureParameterValues; // 0x31c
	TArray<FVectorParameterValueOverTime> VectorParameterValues; // 0x32c
	TArray<FLinearColorParameterValueOverTime> LinearColorParameterValues; // 0x33c
};

struct UTgSeqOp_MathCalc : USequenceCondition {
	float m_fResult; // 0xec
};

struct ATgDevice_Mount : ATgDevice_Toggle {
	char m_bForceFireDueToRespawn : 1; // 0xa08
	char m_bDismountProtection : 1; // 0xa08
	char m_bAutoMounting : 1; // 0xa08
	float m_fZoomDurationOverride; // 0xa0c
	TArray<ObjectProperty> m_CachedInhands; // 0xa10
	float m_fAutoMountDismountProtectionDuration; // 0xa20
};

struct ATgPawn_Bunny : ATgPawn_Character {
	ObjectProperty m_CachedBunnyLink; // 0x3160
	ObjectProperty m_CachedBunnyHeal; // 0x3168
	ObjectProperty m_CachedBunnyDefense; // 0x3170
	ObjectProperty m_CachedBunnyUlt; // 0x3178
	ObjectProperty c_CachedBunnyLinkForm; // 0x3180
	char m_bWhileEnemyLinkedEffectsApplied : 1; // 0x3188
	char m_bWhileFriendlyLinkedEffectsApplied : 1; // 0x3188
	char m_bSpiritLinkViewConstraint : 1; // 0x3188
	char m_bLinkedPawnsNetworkUpdate : 1; // 0x3188
	char m_bHasBeefySpiritLinkTalent : 1; // 0x3188
	int32_t m_nFriendlyLinkBeamFXId_1P; // 0x318c
	int32_t m_nFriendlyLinkBeamFXId_3P; // 0x3190
	int32_t m_nEnemyLinkBeamFXId_1P; // 0x3194
	int32_t m_nEnemyLinkBeamFXId_3P; // 0x3198
	int32_t m_nLinkBreakBeamFXId_1P; // 0x319c
	float m_fLinkBreakBeamTTL; // 0x31a0
	FName m_nmLinkBeamStartSocket; // 0x31a4
	float m_fLinkBreakDelay; // 0x31ac
	float m_fLinkBeamWeaknessOffset; // 0x31b0
	float m_fLinkBeamRestrengthenPeriod; // 0x31b4
	FName m_nmFamiliarFxDisplayGroup; // 0x31b8
	FName m_nmBeamWeaknessParameter; // 0x31c0
	ObjectProperty m_CurrentTarget; // 0x31c8
	float m_fMaxSpiritLinkRangeFeet; // 0x31d0
	float m_fSpiritLinkLoSFoVClient; // 0x31d4
	float m_fSpiritLinkLoSFoVServerGrace; // 0x31d8
	TArray<FSpiritLink> m_SpiritLinks; // 0x31dc
	TArray<FBreakingSpiritLink> m_SpiritLinkBreaks; // 0x31ec
	int32_t r_nSpiritLinkedPawnIds[0x3]; // 0x31fc
	int32_t m_nBeefySpiritLinkTalentId; // 0x3208
	float m_fBeefySpiritLinkTalentDuration; // 0x320c
};

struct ATgFatalityMeshActor : AActor {
	int32_t m_nTaskForceId; // 0x280
	ComponentProperty m_Mesh; // 0x284
};

struct UUIScene_UICredits : UUIScene {
	int32_t m_nCurrentPage; // 0x1cc
	TArray<ObjectProperty> m_pPages; // 0x1d0
	ObjectProperty m_pUpArrow; // 0x1e0
	ObjectProperty m_pDownArrow; // 0x1e8
};

struct UUIScene_UINotificationCenter : UUIScene {
	char m_eState; // 0x1cc
	ObjectProperty m_pTabs; // 0x1d0
	ObjectProperty m_pBack; // 0x1d8
	ObjectProperty m_pBlocker; // 0x1e0
	ObjectProperty m_pNotifications; // 0x1e8
	ObjectProperty m_pCoupons; // 0x1f0
	ObjectProperty m_grInput; // 0x1f8
};

struct UUIComponent_PopupManager : UUIComponent {
	TArray<FSceneData> m_PopupStack; // 0x118
	int32_t m_nCloseCurrentPopupHandle; // 0x128
	char m_bAllowPopups : 1; // 0x12c
};

struct UUIComponent_GenericTitleButtons : UUIComponent_Display {
	ObjectProperty m_mcTitle[0x2]; // 0x124
	ObjectProperty m_Buttons[0x8]; // 0x134
	int32_t m_ButtonClickHandles[0x8]; // 0x174
	ObjectProperty m_grButtons; // 0x194
};

struct USeqAct_CameraLookAt : USequenceAction {
	char bAffectCamera : 1; // 0x108
	char bAlwaysFocus : 1; // 0x108
	char bAdjustCamera : 1; // 0x108
	char bTurnInPlace : 1; // 0x108
	char bIgnoreTrace : 1; // 0x108
	char bAffectHead : 1; // 0x108
	char bRotatePlayerWithCamera : 1; // 0x108
	char bToggleGodMode : 1; // 0x108
	char bLeaveCameraRotation : 0; // 0x108
	char bDisableInput : 0; // 0x108
	char bUsedTimer : 0; // 0x108
	char bCheckLineOfSight : 0; // 0x108
	FVector2D InterpSpeedRange; // 0x10c
	FVector2D InFocusFOV; // 0x114
	FName FocusBoneName; // 0x11c
	FString TextDisplay; // 0x124
	float TotalTime; // 0x134
	float CameraFOV; // 0x138
	float RemainingTime; // 0x13c
};

struct UUIComponent_NotificationCouponEntry : UUIComponent_Display {
	ObjectProperty m_mcTitle; // 0x124
	ObjectProperty m_mcExpiration; // 0x12c
	ObjectProperty m_mcItemIconTexture; // 0x134
	ObjectProperty m_mcChestImageStack; // 0x13c
	ObjectProperty m_pCTA; // 0x144
	ObjectProperty m_pCostPrev; // 0x14c
	ObjectProperty m_pCostCurrent; // 0x154
	ObjectProperty m_pGoToButton; // 0x15c
	ObjectProperty m_pFrameButton; // 0x164
};

struct UUIComponent_Button_LoadoutAnnouncer : UUIComponent_Display {
	ObjectProperty m_Play; // 0x124
	ObjectProperty m_mcAnnouncerIcon; // 0x12c
	ObjectProperty m_mcAnnouncerIconRarity; // 0x134
	ObjectProperty m_mcAnnouncerIconTexture; // 0x13c
	ObjectProperty m_mcEquipped; // 0x144
	ObjectProperty m_mcName; // 0x14c
};

struct UAnimNotify_PawnMaterialParam : UAnimNotify_Scripted {
	TArray<FScalarParameterInterpStruct> ScalarParameterInterpArray; // 0x68
};

struct UNavMeshPath_MinDistBetweenSpecsOfType : UNavMeshPathConstraint {
	float MinDistBetweenEdgeTypes; // 0x78
	FVector InitLocation; // 0x7c
	ENavMeshEdgeType EdgeType; // 0x88
	float Penalty; // 0x8c
};

struct UUIDataStore_Registry : UUIDataStore {
	TArray<FRegistryKeyValuePair> RegistryData; // 0x98
};

struct ATgDoorMarker : ATgTeamBlocker {
	DoorStatus r_eStatus; // 0x29c
	DoorStatus m_eInitStatus; // 0x29d
	ObjectProperty s_CollisionProxy; // 0x2a0
	float m_fProximity; // 0x2a8
	int32_t m_nTeamThatControlsDoor; // 0x2ac
	int32_t m_nMeshAssemblyId; // 0x2b0
	ComponentProperty m_DoorSMC; // 0x2b4
};

struct ATgGame_Paladins_Survival : ATgGame_Paladins_Siege {
	int32_t m_nWinningTaskforceThisRound; // 0xa64
	float m_fRoundStartTime; // 0xa68
};

struct ATgPawn_Tiberius : ATgPawn_Character {
	ObjectProperty m_CachedHeavyBlade; // 0x3160
	ObjectProperty m_CachedLeap; // 0x3168
	ObjectProperty m_CachedUlt; // 0x3170
	ObjectProperty m_CachedBladeDetonateTalent; // 0x3178
	ObjectProperty m_CachedLeapAssaultTalent; // 0x3180
	ObjectProperty m_CachedHeavyBladeForm; // 0x3188
	TigerBladeState r_eRemoteBladeState; // 0x3190
	ObjectProperty r_BladeProjectile; // 0x3194
	ObjectProperty r_BladeDeployable; // 0x319c
	FVector r_vLastLeapDirection; // 0x31a4
	char r_bHasViciousAssault : 1; // 0x31b0
	char r_bBladeInRecall : 1; // 0x31b0
	int32_t m_nAltInhandSlot; // 0x31b4
	int32_t m_nAltAltfireSlot; // 0x31b8
	float r_fRemoteUltDurationPercent; // 0x31bc
	int32_t r_nRemainingUltCharges; // 0x31c0
	int32_t r_nMaxUltCharges; // 0x31c4
	FString m_sSecondaryActivationIconOverride; // 0x31c8
	TArray<ObjectProperty> m_HeavyBladeScaleSkelControls; // 0x31d8
};

struct UUIHudCenter : UTgGfxScene {
	int32_t m_nReticle; // 0x1ec
	int32_t m_nStuckCount; // 0x1f0
	int32_t m_nAmmoCurrent; // 0x1f4
	int32_t m_nAmmoClipSize; // 0x1f8
	int32_t m_nReticleColor; // 0x1fc
	char m_bChangeReticleOverEnemy : 1; // 0x200
	char m_bChargeAmmo : 1; // 0x200
	char m_bReticleBloom : 1; // 0x200
	char m_bReticleVisible : 1; // 0x200
	char m_bReticleAccessoryVisible : 1; // 0x200
	char m_bDisableCombatLog : 1; // 0x200
	char m_bRecharging : 1; // 0x200
	char m_bWasHiddenOnTick : 1; // 0x200
	char m_bWasReloading : 0; // 0x200
	char m_bShowFuel : 0; // 0x200
	char m_bHitWarning3pVisible : 0; // 0x200
	float m_fReloadTime; // 0x204
	float m_fReloadTimer; // 0x208
	ObjectProperty m_scHitMarker[0x5]; // 0x20c
	ObjectProperty m_mcReticle; // 0x234
	ObjectProperty m_mcDropReticle; // 0x23c
	ObjectProperty m_mcCircleReticle; // 0x244
	ObjectProperty m_mcCicleReticleAccuracy[0x2]; // 0x24c
	ObjectProperty m_mcCrossReticle; // 0x25c
	ObjectProperty m_mcCrossReticleUp; // 0x264
	ObjectProperty m_mcCrossReticleLeft; // 0x26c
	ObjectProperty m_mcCrossReticleRight; // 0x274
	ObjectProperty m_mcCrossReticleDown; // 0x27c
	ObjectProperty m_mcDotReticle; // 0x284
	ObjectProperty m_mcWideReticle; // 0x28c
	ObjectProperty m_mcShaLinReticle; // 0x294
	ObjectProperty m_mcShaLinReticleDraw; // 0x29c
	ObjectProperty m_mcShaLinImpalerReticle; // 0x2a4
	ObjectProperty m_mcAtlasReticle; // 0x2ac
	ObjectProperty m_mcAtlasReticleDraw; // 0x2b4
	ObjectProperty m_mcMaeveReticle; // 0x2bc
	ObjectProperty m_mcMaevePounceLIRecticle; // 0x2c4
	ObjectProperty m_mcMaevePounceLORecticle; // 0x2cc
	ObjectProperty m_mcMaevePounceRIRecticle; // 0x2d4
	ObjectProperty m_mcMaevePounceRORecticle; // 0x2dc
	ObjectProperty m_mcHitWarning3p; // 0x2e4
	ObjectProperty m_mcTargeter; // 0x2ec
	ObjectProperty m_mcHitMarker; // 0x2f4
	ObjectProperty m_mcHitMarkerTicks[0x4]; // 0x2fc
	ObjectProperty m_mcAccuracy; // 0x31c
	ObjectProperty m_mcRecharge; // 0x324
	ObjectProperty m_mcRechargeCD; // 0x32c
	ObjectProperty m_mcStuck; // 0x334
	ObjectProperty m_mcAmmoNew; // 0x33c
	ObjectProperty m_mcAmmoNewCharge; // 0x344
	ObjectProperty m_mcAmmoNewCurrent; // 0x34c
	ObjectProperty m_mcAmmoNewClipSize; // 0x354
	ObjectProperty m_mcAmmoNewChargeMask; // 0x35c
	ObjectProperty m_mcMakoaSmash; // 0x364
	ObjectProperty m_mcMakoaSmashObj[0x3]; // 0x36c
	FVector2D m_vMakoaSmashStart[0x3]; // 0x384
	FVector2D m_vMakoaSmashEnd[0x3]; // 0x39c
	int32_t m_eCombatInfoType; // 0x3b4
	float m_fGlobalChatTimer; // 0x3b8
	ObjectProperty m_Reward; // 0x3bc
	ObjectProperty m_RewardName; // 0x3c4
	ObjectProperty m_RewardAmount; // 0x3cc
	ObjectProperty m_mcGlobalChat; // 0x3d4
	ObjectProperty m_mcGlobalChatTF; // 0x3dc
	ObjectProperty m_mcDamage; // 0x3e4
	ObjectProperty m_Projectiles; // 0x3ec
	FHudProjectile m_ProjectilePointers[0xa]; // 0x3f4
	TArray<FHudMarker> m_DamageMarkersLight; // 0x674
	TArray<int32_t> m_DamageMarkerFreelistLight; // 0x684
	TArray<FHudMarker> m_DamageMarkersMedium; // 0x694
	TArray<int32_t> m_DamageMarkerFreelistMedium; // 0x6a4
	TArray<FHudMarker> m_DamageMarkersHeavy; // 0x6b4
	TArray<int32_t> m_DamageMarkerFreelistHeavy; // 0x6c4
	TArray<FHudMarker> m_DamageMarkersAOEMedium; // 0x6d4
	TArray<int32_t> m_DamageMarkerFreelistAOEMedium; // 0x6e4
	TArray<FHudMarker> m_DamageMarkersAOEHeavy; // 0x6f4
	TArray<int32_t> m_DamageMarkerFreelistAOEHeavy; // 0x704
	ObjectProperty m_mcFuel; // 0x714
	ObjectProperty m_mcFuelBar; // 0x71c
	ObjectProperty m_mcFuelMask; // 0x724
	ObjectProperty m_mcReload; // 0x72c
	ObjectProperty m_mcReloadTF; // 0x734
	ObjectProperty m_mcReloadAnim; // 0x73c
	ObjectProperty m_TorvaldShieldBar; // 0x744
	ObjectProperty m_DemonTeleportTimer; // 0x74c
	ObjectProperty m_VanguardShieldBar; // 0x754
	ObjectProperty m_pLazarusShieldBar; // 0x75c
	ObjectProperty m_pFernandoShieldBar; // 0x764
	ObjectProperty m_HealFeed; // 0x76c
	TArray<FMessageClip> m_Messages; // 0x774
	float m_fClient3pReloadOffset; // 0x784
	float m_fHitWarning3pMoveSpeed; // 0x788
	float m_fHitWarning3pMoveCheckDistance; // 0x78c
	float m_fHitWarning3pScale; // 0x790
	FColor m_cHitWarning3pColor; // 0x794
	FColor m_cHitWarning3pReticleColor; // 0x798
	float m_fHitWarning3pThreshold; // 0x79c
	float m_fHitWarning3pThreshold2d; // 0x7a0
	FVector2D m_vHitWarning3pScalingSize; // 0x7a4
	FVector2D m_vHitWarning3pScalingRange; // 0x7ac
	float m_fHitWarning3pScalingSpeed; // 0x7b4
	float m_fAOEDamageMediumHeavyThreshold; // 0x7b8
	float m_fDamageLightMediumThreshold; // 0x7bc
	float m_fDamageMediumHeavyThreshold; // 0x7c0
	FHitMarkerInfo m_HitMarker; // 0x7c4
	float m_fMaxDamageTimestamp; // 0x7ec
	float m_fDamageDealtRTPCSustainDuration; // 0x7f0
	float m_fChampionHitTimestamp; // 0x7f4
	float m_fChampionCountRTPCSustainDuration; // 0x7f8
	TArray<FDamageInstance> m_AccumulatedDamageInstances; // 0x7fc
	float m_fDamageAccumulationWindow; // 0x80c
	ObjectProperty m_GameplayCurves; // 0x810
};

struct UGameThirdPersonCameraMode_Default : UGameThirdPersonCameraMode {
	float WorstLocAimingZOffset; // 0x258
	char bTemporaryOriginRotInterp : 1; // 0x25c
	float TemporaryOriginRotInterpSpeed; // 0x260
};

struct UGameExplosion : UObject {
	char bDirectionalExplosion : 1; // 0x60
	char bIgnoreInstigator : 1; // 0x60
	char bAllowTeammateCringes : 1; // 0x60
	char bFullDamageToAttachee : 1; // 0x60
	char bAttachExplosionEmitterToAttachee : 1; // 0x60
	char bPerformRadialBlurRelevanceCheck : 1; // 0x60
	char bCausesFracture : 1; // 0x60
	char bAllowPerMaterialFX : 1; // 0x60
	char bParticleSystemIsBeingOverriddenDontUsePhysMatVersion : 0; // 0x60
	char bSkipDefaultPhysMatParticleSystem : 0; // 0x60
	char bUseMapSpecificValues : 0; // 0x60
	char bUseOverlapCheck : 0; // 0x60
	char bOrientCameraShakeTowardsEpicenter : 0; // 0x60
	char bAutoControllerVibration : 0; // 0x60
	float DirectionalExplosionAngleDeg; // 0x64
	float DamageDelay; // 0x68
	float Damage; // 0x6c
	float DamageRadius; // 0x70
	float DamageFalloffExponent; // 0x74
	ObjectProperty ActorToIgnoreForDamage; // 0x78
	AActor* ActorClassToIgnoreForDamage; // 0x80
	AActor* ActorClassToIgnoreForKnockdownsAndCringes; // 0x88
	UDamageType* MyDamageType; // 0x90
	float KnockDownRadius; // 0x98
	float KnockDownStrength; // 0x9c
	float CringeRadius; // 0xa0
	FVector2D CringeDuration; // 0xa4
	float MomentumTransferScale; // 0xac
	ObjectProperty ParticleEmitterTemplate; // 0xb0
	float ExplosionEmitterScale; // 0xb8
	ObjectProperty HitActor; // 0xbc
	FVector HitLocation; // 0xc4
	FVector HitNormal; // 0xd0
	ObjectProperty ExplosionSound; // 0xdc
	ObjectProperty ExplosionSoundHurtSomeone; // 0xe4
	ComponentProperty ExploLight; // 0xec
	float ExploLightFadeOutTime; // 0xf4
	ComponentProperty ExploRadialBlur; // 0xf8
	float ExploRadialBlurFadeOutTime; // 0x100
	float ExploRadialBlurMaxBlur; // 0x104
	float FractureMeshRadius; // 0x108
	float FracturePartVel; // 0x10c
	ObjectProperty CamShake; // 0x110
	ObjectProperty CamShake_Left; // 0x118
	ObjectProperty CamShake_Right; // 0x120
	ObjectProperty CamShake_Rear; // 0x128
	float CamShakeInnerRadius; // 0x130
	float CamShakeOuterRadius; // 0x134
	float CamShakeFalloff; // 0x138
	AEmitterCameraLensEffectBase* CameraLensEffect; // 0x13c
	float CameraLensEffectRadius; // 0x144
};

struct UTgInventoryObject_Listen_Combo_BombKing : UTgInventoryObject_Listen_Combo {
	TArray<FStickyHitInfo> m_HitActors; // 0xcc
};

struct UTgAchievement_Damage : UTgAchievement {
	float m_fDamageDealt; // 0x94
};

struct ATgDevice_YagorathUlt : ATgDevice {
	ObjectProperty m_CachedYagorath; // 0xa04
	ObjectProperty m_Target; // 0xa0c
	float m_fPrePullTime; // 0xa14
	char m_bGrabFailed : 1; // 0xa18
	char m_bPullHit : 1; // 0xa18
	char m_bPullCancelledByCollision : 1; // 0xa18
	float m_fPreUltHealth; // 0xa1c
	float m_fPreUltMaxHealth; // 0xa20
	float m_fPullSpeedBreakFactor; // 0xa24
	float m_fDistanceBreakFactor; // 0xa28
	float m_fTargetBounceVel; // 0xa2c
};

struct UTgDeviceForm_Salvo : UTgDeviceForm {
	TArray<ObjectProperty> m_SalvoBlendList1P; // 0x28c
	TArray<ObjectProperty> m_SalvoBlendList3P; // 0x29c
	char m_bSalvoLightShouldBlink : 1; // 0x2ac
	char m_bSalvoLightIsOn : 1; // 0x2ac
	float m_fLastLightChangeTime; // 0x2b0
	float m_fMinLightChangeTime; // 0x2b4
};

struct ATgDeviceVolumeInfo : AInfo {
	ObjectProperty V; // 0x280
};

struct UTgAnimNodeBlendByHealth : UTgAnimNodeBlendList {
	TArray<float> m_HealthChildren; // 0x168
	ObjectProperty m_TgPawn; // 0x178
};

struct ATgTeleporter : ATeleporter {
	int32_t m_nMapObjectId; // 0x3a4
	int32_t m_nMapId; // 0x3a8
	char m_nPreload : 1; // 0x3ac
	char m_bSetTaskForce : 1; // 0x3ac
	char m_bBalanceTaskForce : 1; // 0x3ac
	char m_bIgnoreNonMembers : 1; // 0x3ac
	char m_bUsePlayerStart : 1; // 0x3ac
	char m_bRequestMission : 1; // 0x3ac
	char m_nStartGroup; // 0x3b0
	char m_nTaskForce; // 0x3b1
};

struct ATgPawn_Lex : ATgPawn_Character {
	ObjectProperty m_VengeanceDevice; // 0x3160
	ObjectProperty m_CombatSlideDevice; // 0x3168
	ObjectProperty m_InPursuitDevice; // 0x3170
	ObjectProperty m_WeaponMeshActorLexInhand; // 0x3178
	ObjectProperty m_Target; // 0x3180
	float m_MaxSlideCameraAngle; // 0x3188
	int32_t m_PrevCameraYaw; // 0x318c
	char c_bUltFiring : 1; // 0x3190
	char c_bPursuitFiring : 1; // 0x3190
	char m_bFireLeftWeapon : 1; // 0x3190
	ObjectProperty r_Targets[0x5]; // 0x3194
	ETheLawTargetState r_TargetStates[0x5]; // 0x31bc
	int32_t r_nInhandAmmoRemaining; // 0x31c4
};

struct UTgInventoryObject_Listen_OutOfCombat : UTgInvListener {
	char m_bEffectIsApplied : 1; // 0xc4
};

struct ATgDevice_RiderMovement : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_AccelMultiplier; // 0xa04
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa0c
	float m_fLastMultiplierUsed; // 0xa14
};

struct UTgGamePhase_Capture : UTgGamePhase {
	ObjectProperty m_currentActiveCapturePoint; // 0xb8
	float m_fCaptureGoal; // 0xc0
	float m_fCapturePointsPerSecond; // 0xc4
	int32_t m_nCreditsForCapturingPoint; // 0xc8
	float m_fSecondTracker; // 0xcc
};

struct URB_RadialImpulseComponent : UPrimitiveComponent {
	ERadialImpulseFalloff ImpulseFalloff; // 0x24c
	float ImpulseStrength; // 0x250
	float ImpulseRadius; // 0x254
	char bVelChange : 1; // 0x258
	char bCauseFracture : 1; // 0x258
	ComponentProperty PreviewSphere; // 0x25c
};

struct URB_BodySetup : UKMeshProps {
	ESleepFamily SleepFamily; // 0xb8
	FName BoneName; // 0xbc
	char bFixed : 1; // 0xc4
	char bNoCollision : 1; // 0xc4
	char bBlockZeroExtent : 1; // 0xc4
	char bBlockNonZeroExtent : 1; // 0xc4
	char bNoBodyShotChecks : 1; // 0xc4
	char bEnableContinuousCollisionDetection : 1; // 0xc4
	char bAlwaysFullAnimWeight : 1; // 0xc4
	char bConsiderForBounds : 1; // 0xc4
	ObjectProperty PhysMaterial; // 0xc8
	float MassScale; // 0xd0
	TArray<FPointer> CollisionGeom; // 0xd4
	TArray<FVector> CollisionGeomScale3D; // 0xe4
	TArray<FVector> PreCachedPhysScale; // 0xf4
	TArray<FKCachedConvexData> PreCachedPhysData; // 0x104
	int32_t PreCachedPhysDataVersion; // 0x114
};

struct USeqVar_Object : USequenceVariable {
	ObjectProperty ObjValue; // 0xa0
	FVector ActorLocation; // 0xa8
	TArray<UObject*> SupportedClasses; // 0xb4
};

struct UUIComponent_MatchLobbyCustomize : UUIComponent {
	ObjectProperty m_mcChampionItemSelect; // 0x118
	ObjectProperty m_PreviousButton; // 0x120
	ObjectProperty m_NextButton; // 0x128
	ObjectProperty m_BuyVoicepack; // 0x130
	ObjectProperty m_InputBuyVoicePack; // 0x138
	ObjectProperty m_InputSelectVoicePack; // 0x140
	ObjectProperty m_EquipSlotList; // 0x148
	ObjectProperty m_ItemList; // 0x150
	ObjectProperty m_pEquipSlotNavLeft; // 0x158
	ObjectProperty m_pEquipSlotNavRight; // 0x160
	ObjectProperty m_VoiceDropdown; // 0x168
	ObjectProperty m_pPurchase; // 0x170
	UIChampionCustomizeState m_eState; // 0x178
	UIChampionCustomizeState m_eSelectedSlot; // 0x179
	ObjectProperty m_mcTooltip; // 0x17c
	ObjectProperty m_pTooltipInfo; // 0x184
	ObjectProperty m_pColorPicker; // 0x18c
};

struct UTgGamePhase_ChangeRespawnTime : UTgGamePhase {
	float m_fRespawnDuration; // 0xb8
};

struct UTgCameraModule_SpectatorOverview : UTgCameraModule_Spectator {
	FRotator WorldViewRotation; // 0x9c
	float FOV; // 0xa8
	float TargetZoomedFOV; // 0xac
	float ZoomIncrement; // 0xb0
	float MinZoom; // 0xb4
	float MaxZoom; // 0xb8
	float ZoomInterpTime; // 0xbc
	FVector CurrentSpringLocation; // 0xc0
	float PawnTargetSpringDamping; // 0xcc
	float FreeCamSpringDamping; // 0xd0
	float IgnoreSpringDistance; // 0xd4
	TArray<FCameraPitchInfo> CameraPitchData; // 0xd8
	char bFlippedSides : 1; // 0xe8
	char bJustBecameActive : 1; // 0xe8
	char bAutoZoomEnabled : 1; // 0xe8
	float OverviewCameraInfluenceDist; // 0xec
	TArray<ObjectProperty> OverviewCameras; // 0xf0
	TArray<ObjectProperty> TransparentTowerList; // 0x100
	FVector ObstacleTransparentExtent; // 0x110
	float fMinAutoZoomFOVAngle; // 0x11c
	float fMaxAutoZoomFOVAngle; // 0x120
	float fMinAutoZoomDistance; // 0x124
	float fMaxAutoZoomDistance; // 0x128
	float fAutoZoomDetectionRadius; // 0x12c
	float fAutoZoomInSpeed; // 0x130
	float fAutoZoomOutSpeed; // 0x134
	float fAutoZoomInLockOutTime; // 0x138
	float fAutoZoomOutLockOutTime; // 0x13c
	float m_RemainingAutoZoomInLockOutTime; // 0x140
	float m_RemainingAutoZoomOutLockOutTime; // 0x144
};

struct ADynamicPhysicsVolume : APhysicsVolume {
	char bEnabled : 1; // 0x314
};

struct UTgCameraModule_Free : UTgCameraModule {
	float CamAltitude; // 0x68
	float DesiredCamAltitude; // 0x6c
	float MaxCamAltitude; // 0x70
	float MinCamAltitude; // 0x74
	float CamZoomIncrement; // 0x78
	char m_bCachedNoDeathCamExperiment : 1; // 0x7c
};

struct ATgPawn_SiegeWall : ATgPawn_Tower {
	float m_fImpactEffectXRange; // 0x2f28
	float m_fImpactEffectYRange; // 0x2f2c
	FVector r_vNextImpactEffectLocation; // 0x2f30
	float m_fImpactRecoveryTime; // 0x2f3c
	float m_fRemainingImpactRecoveryTime; // 0x2f40
	float m_fMaxImpactSize; // 0x2f44
	ObjectProperty m_ImpactMIC; // 0x2f48
	char c_bIsVulnerable : 1; // 0x2f50
	char m_bHasRegisteredObstacle : 1; // 0x2f50
	char m_bSpawnedThisFrame : 1; // 0x2f50
	char m_bQueriedBorderEdges : 1; // 0x2f50
};

struct UTgSeqAct_UIAlert : USequenceAction {
	int32_t nMsgId; // 0x108
	TArray<int32_t> Taskforces; // 0x10c
	TArray<char> Broadcast; // 0x11c
};

struct USoundNode : UObject {
	int32_t NodeUpdateHint; // 0x60
	TArray<ObjectProperty> ChildNodes; // 0x64
};

struct ATgDevice_Protection : ATgDevice {
	ObjectProperty m_Gauntlet; // 0xa04
};

struct USoundNodeAttenuationAndGain : USoundNode {
	char bAttenuate : 1; // 0x74
	char bSpatialize : 1; // 0x74
	char bAttenuateWithLPF : 1; // 0x74
	float dBAttenuationAtMax; // 0x78
	float OmniRadius; // 0x7c
	SoundDistanceModel GainDistanceAlgorithm; // 0x80
	SoundDistanceModel AttenuateDistanceAlgorithm; // 0x81
	ESoundDistanceCalc DistanceType; // 0x82
	float MinimalVolume; // 0x84
	float RadiusMin; // 0x88
	float RadiusPeak; // 0x8c
	float RadiusMax; // 0x90
	float LPFMinimal; // 0x94
	float LPFRadiusMin; // 0x98
	float LPFRadiusPeak; // 0x9c
	float LPFRadiusMax; // 0xa0
};

struct ATgWeaponMeshActor_ChurchillInhand : ATgWeaponMeshActor_ADS {
	FPointer VfTable_ITgObserver_ViewTargetChanged; // 0x454
	ObjectProperty m_CachedChurchill; // 0x45c
	float m_fShieldLagStrength; // 0x464
	float m_fShieldMinPitch; // 0x468
	float m_fShieldMinPitchMaxTranslate; // 0x46c
	FLinearColor m_cDefaultColorizeRed1p; // 0x470
	FLinearColor m_cDefaultColorizeRed3p; // 0x480
	int32_t m_nColorizeRedChnageSource; // 0x490
	FLinearColor DetectedColorWeapon; // 0x494
};

struct UTgSeqAct_JoinTeam : USequenceAction {
	ObjectProperty TeamLeader; // 0x108
};

struct UTgDeviceForm_RestoreSoul : UTgDeviceForm {
	ObjectProperty m_CachedOracle; // 0x28c
};

struct UUIChatScene : UTgGfxScene {
	int32_t m_nContextChangedCallbackHandle; // 0x1ec
	ObjectProperty m_KeyCapture; // 0x1f0
	int32_t m_nChannel; // 0x1f8
	int32_t m_nScroll; // 0x1fc
	int32_t m_nLineNumber; // 0x200
	int32_t m_nPrevIndex; // 0x204
	float m_fBuffer; // 0x208
	float m_fOutputWidth; // 0x20c
	FString m_sRecipient; // 0x210
	FString m_sRemaining; // 0x220
	FString m_sLastInput; // 0x230
	int32_t m_nCommand; // 0x240
	ObjectProperty m_pChatData; // 0x244
	ObjectProperty m_mcInput; // 0x24c
	TArray<FChatMessage> m_Messages; // 0x254
	TArray<FString> m_PrevChats; // 0x264
	TArray<FChannelData> m_Shortcuts; // 0x274
	int32_t m_ReplyTargetIndex; // 0x284
	AUTOCOMPLETE_STATE m_bAutocompleteState; // 0x288
};

struct UTgAIBehaviorCondition_TeamDeathCount : UTgAIBehaviorCondition {
	char bMustBeEnemy : 1; // 0x98
	int32_t DeathThreshold; // 0x9c
};

struct UPComPlayerProfile : UOnlinePlayerStorage {
	int32_t Rank; // 0x94
	int32_t Kills; // 0x98
	int32_t Deaths; // 0x9c
	int32_t Assists; // 0xa0
	int32_t XpLevel; // 0xa4
	int32_t HZPoints; // 0xa8
	int32_t XPPoints; // 0xac
	int32_t AssistPoints; // 0xb0
	int32_t AverageScore; // 0xb4
	int32_t BoostHoursRemaining; // 0xb8
	int32_t InfoMask; // 0xbc
	int32_t TimePlayed; // 0xc0
	int32_t TotalAccolades; // 0xc4
	int32_t FastestSki; // 0xc8
	int32_t FlagGrabs; // 0xcc
	int32_t FlagCaps; // 0xd0
	int32_t GensDestroyed; // 0xd4
	int32_t ObjsDestroyed; // 0xd8
	char bVIP : 1; // 0xdc
	char bBoost : 1; // 0xdc
	int32_t PlayerID; // 0xe0
	FString PlayerName; // 0xe4
	TArray<FBadgeStruct> Badges; // 0xf4
	TArray<FBadgeStruct> TopBadges; // 0x104
	TArray<FPropertyPair> ClassTimePlayed; // 0x114
	TArray<FAccoladeStruct> Accolades; // 0x124
};

struct UTgDeviceForm_ArcaneMissilesInhand : UTgDeviceForm_Inhand {
	ObjectProperty m_CachedGauntlet; // 0x29c
	float c_fLastReceivedTransitionInTime; // 0x2a4
};

struct UUIData_StreamSettings : UUIData {
	char m_bIsStreaming : 1; // 0x64
	FPComOpenBroadcasterSettings m_Settings; // 0x68
};

struct UTgMiniMap : UObject {
	int32_t m_nMiniMapMode; // 0x60
	char m_bShouldDisplayMiniMap : 1; // 0x64
	char m_bHasMiniMapTexture : 1; // 0x64
	char m_bRequiresLOS : 1; // 0x64
	char m_bUseFlashSizing : 1; // 0x64
	char m_bSpectating : 1; // 0x64
	float m_fLastUpdateTime; // 0x68
	ObjectProperty m_MiniMapBaseMIC; // 0x6c
	ObjectProperty m_MiniMapMIC; // 0x74
	ObjectProperty m_DynamicMask; // 0x7c
	int32_t m_nMaskSize; // 0x84
	float m_fIconScale; // 0x88
	FVector2D m_vMapLocation; // 0x8c
	int32_t m_nMapSize; // 0x94
	FPointer m_MiniMapRender; // 0x98
	ObjectProperty m_OwnerPC; // 0xa0
	int32_t m_nWorldMapSize; // 0xa8
	ObjectProperty m_MICPinging; // 0xac
	ObjectProperty m_MICPingingEnemy; // 0xb4
	ObjectProperty m_MICRetreat; // 0xbc
	ObjectProperty m_MICRetreatEnemy; // 0xc4
	ObjectProperty m_MICAlert; // 0xcc
	ObjectProperty m_MICAlertEnemy; // 0xd4
	ObjectProperty m_MICAlertSilent; // 0xdc
	ObjectProperty m_MICLocalPlayer; // 0xe4
	ObjectProperty m_MICLocalSpectator; // 0xec
	TArray<ObjectProperty> m_TextureRefs; // 0xf4
	ObjectProperty m_MICPlayer[0x6]; // 0x104
	ObjectProperty m_MICMinion[0x6]; // 0x134
	ObjectProperty m_MICTower[0x6]; // 0x164
	ObjectProperty m_MICTitan[0x6]; // 0x194
	ObjectProperty m_MICPhoenix[0x6]; // 0x1c4
	ObjectProperty m_MICCapturePoint[0x6]; // 0x1f4
	ObjectProperty m_MICLanePusher[0x6]; // 0x224
	ObjectProperty m_MICTowerOlympus[0x3]; // 0x254
	ObjectProperty m_MICTitanOlympus[0x6]; // 0x26c
	ObjectProperty m_MICPhoenixOlympus[0x3]; // 0x29c
	ObjectProperty m_MICMonster; // 0x2b4
	FLinearColor m_PortalLinkColor[0x6]; // 0x2bc
	FBuffMonsterMIC m_MICBuffMonster[0xe]; // 0x31c
	ObjectProperty m_MICTowerDestroyed; // 0x46c
	ObjectProperty m_PlayerBackground[0x6]; // 0x474
	ObjectProperty m_TowerAttackBackground[0x6]; // 0x4a4
	TMap<None, None> m_IconMap; // 0x4d4
	FBitArray_Mirror m_MaskPoints; // 0x51c
	TgMapOrientation m_Orientation; // 0x53c
	TgMapTeam m_LocalTeam; // 0x53d
	TgClientVisibilityMode m_VisibilityMode; // 0x53e
	char bUpdateCapturePoint[0x5]; // 0x53f
	TMap<None, None> m_EntityMap; // 0x544
	TArray<FLayerIndex> m_PortalLayeringIdx; // 0x58c
	TArray<FLayerIndex> m_LayeringIdx; // 0x59c
	TArray<FMiniMapPingInfo> m_IndependentPings; // 0x5ac
};

struct UUIComponent_SimulMediaRewardInfo : UUIComponent_Display {
	ObjectProperty m_mcTF0; // 0x124
	ObjectProperty m_mcTF1; // 0x12c
	ObjectProperty m_mcTF2; // 0x134
	ObjectProperty m_mcTF3; // 0x13c
	ObjectProperty m_mcRewardIcon; // 0x144
	ObjectProperty m_mcRewardIcon1; // 0x14c
	ObjectProperty m_CollectionRewardTracker; // 0x154
	ObjectProperty m_CollectionRewardReceived; // 0x15c
};

struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase {
	FRawDistributionVector Position; // 0x68
	FRawDistributionFloat Range; // 0x8c
	FRawDistributionFloat Strength; // 0xb0
	char StrengthByDistance : 1; // 0xd4
	char bAffectBaseVelocity : 1; // 0xd4
	char bOverrideVelocity : 1; // 0xd4
	char bUseWorldSpacePosition : 1; // 0xd4
};

struct ATgDevice_RiderUlt : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	char r_nEatingCookie; // 0xa0c
};

struct UBlurEffect : UPostProcessEffect {
	int32_t BlurKernelSize; // 0x88
};

struct ATgShadowStickProp : ATgPropActor {
	float m_fCheckFallTimer; // 0x294
	float m_fCheckFallFrequency; // 0x298
	char m_bAttachedToPersonalShield : 1; // 0x29c
	char m_bAttachedToDeployable : 1; // 0x29c
	char m_bAttachedToPet : 1; // 0x29c
	char m_bSkipClosenessCheck : 1; // 0x29c
	ObjectProperty attachedToTarget; // 0x2a0
};

struct ATgRepInfo_Game_Flagball : ATgRepInfo_Game {
	float c_fFlagballCorrectInterval; // 0x5c8
	float c_fFlagballCorrectTimer; // 0x5cc
	char c_bInFarMoveState : 1; // 0x5d0
	char r_bPassingEnabled : 1; // 0x5d0
	char r_bBallActive : 1; // 0x5d0
	char r_bBallExists : 1; // 0x5d0
	ObjectProperty c_Flagball; // 0x5d4
	ObjectProperty c_TF1Goal; // 0x5dc
	ObjectProperty c_TF2Goal; // 0x5e4
	float r_nTimeRemaining; // 0x5ec
	ObjectProperty r_BallCarrier; // 0x5f0
	FVector r_vBallPosition; // 0x5f8
	FVector r_vBallVelocity; // 0x604
	FVector r_vBallPositionForHUD; // 0x610
	FVector r_vTF1GoalLocation; // 0x61c
	FVector r_vTF2GoalLocation; // 0x628
	int32_t c_nFlagballDeviceFireID; // 0x634
	ObjectProperty r_GoalMarker; // 0x638
};

struct UTgDeviceFire_CommanderUlt : UTgDeviceFire {
	float m_fMaxZTrace; // 0x268
	float m_fZOffSet; // 0x26c
	float m_fXYOffset; // 0x270
};

struct UTgAIBehaviorCondition_InsideDeviceVolume : UTgAIBehaviorCondition {
	int32_t DeviceID; // 0x98
	char bMustBeEnemy : 1; // 0x9c
};

struct UNetConnection : UPlayer {
	TArray<ObjectProperty> Children; // 0xb0d0
};

struct UAnimationCompressionAlgorithm_RemoveEverySecondKey : UAnimationCompressionAlgorithm {
	int32_t MinKeys; // 0x78
	char bStartAtSecondKey : 1; // 0x7c
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat Lifetime; // 0x68
};

struct ATgDevice_OwlSidearm : ATgDevice {
	float m_fQueueFireTime; // 0xa04
	float m_fQueueFireTimeThreshold; // 0xa08
	char m_bEnableContinuousFire : 1; // 0xa0c
};

struct UTgAnimNotifySkinData : UObject {
	FString OwningNotify; // 0x60
	ObjectProperty SoundCueTemplate; // 0x70
	ObjectProperty ParticleSystemTemplate; // 0x78
	int32_t nSkinId; // 0x80
	int32_t nSkinLevel; // 0x84
};

struct UTgDeviceForm_Pounce : UTgDeviceForm {
	TArray<ObjectProperty> m_PounceNodes3p; // 0x28c
	TArray<ObjectProperty> m_PounceNodes1p; // 0x29c
	char bFOVZoomActive : 1; // 0x2ac
	float m_fCameraFOVInterpolationTime; // 0x2b0
	float m_fFOVModifier; // 0x2b4
};

struct UNavMeshPath_SameCoverLink : UNavMeshPathConstraint {
	ObjectProperty TestLink; // 0x78
};

struct UTgSeqAct_PlayAnnouncement : USequenceAction {
	char bPlayImmediately : 1; // 0x108
	char bFlushOthers : 1; // 0x108
	int32_t SoundIndex; // 0x10c
	ObjectProperty OptionalCue; // 0x110
};

struct UUIScene_UIHnHAcquisition : UUIScene {
	int32_t m_nOrbsToDisplay; // 0x1cc
	float m_fFadeInTimer; // 0x1d0
	float m_fBackTimer; // 0x1d4
	char m_bOwnsBlessing : 1; // 0x1d8
	ObjectProperty m_pDrogozBundle; // 0x1dc
	ObjectProperty m_pMaeveBundle; // 0x1e4
	ObjectProperty m_pTyraBundle; // 0x1ec
	ObjectProperty m_pAndroBundle; // 0x1f4
	FMultiMap_Mirror m_pAcquiredItems; // 0x1fc
	ObjectProperty m_mcBlessing; // 0x244
	ObjectProperty m_mcSeal; // 0x24c
	ObjectProperty m_mcSealTF; // 0x254
	ObjectProperty m_mcAcquisition; // 0x25c
	ObjectProperty m_mcAcquisitionTF; // 0x264
	ObjectProperty m_mcNumItems; // 0x26c
	ObjectProperty m_pItems; // 0x274
	ObjectProperty m_pNextButton; // 0x27c
	ObjectProperty m_pNextButtonAction; // 0x284
};

struct ATgSpawnGate : ADynamicBlockingVolume {
	ESpawnGateType m_eSpawnGateType; // 0x2c4
	ObjectProperty m_StandardEmitter; // 0x2c8
	ObjectProperty m_TeamColoredEmitter; // 0x2d0
	char m_bStartActive : 1; // 0x2d8
	char m_bGateOpen : 1; // 0x2d8
	char m_bCollisionActive : 1; // 0x2d8
	int32_t m_nCurrentTaskforce; // 0x2dc
};

struct UInterpGroup : UObject {
	FPointer VfTable_FInterpEdInputInterface; // 0x60
	TArray<ObjectProperty> InterpTracks; // 0x68
	FName GroupName; // 0x78
	FColor GroupColor; // 0x80
	TArray<ObjectProperty> GroupAnimSets; // 0x84
	char bCollapsed : 1; // 0x94
	char bVisible : 1; // 0x94
	char bIsFolder : 1; // 0x94
	char bIsParented : 1; // 0x94
	char bIsSelected : 1; // 0x94
};

struct UUIScene_UIHudTiberius : UUIScene {
	char m_bViewTargetTiberius : 1; // 0x1cc
	char m_bHudVisible : 1; // 0x1cc
	int32_t m_nNumUltCharges; // 0x1d0
	int32_t m_nNumUltChargesMax; // 0x1d4
	ObjectProperty m_pDataActive; // 0x1d8
	ObjectProperty m_pDataInactive; // 0x1e0
	ObjectProperty m_pUltCharges; // 0x1e8
	ObjectProperty m_CachedTiberius; // 0x1f0
};

struct ATgDeploy_EffectSpots : ATgDeploy_MatchParentFireMode {
	FEffectSpotInfo r_EffectSpots[0x64]; // 0x46c
	int32_t m_nNewSpotIndex; // 0x159c
	ObjectProperty m_CollisionProxy; // 0x15a0
	float m_fFirstPassRadius; // 0x15a8
	TArray<ObjectProperty> m_TouchingActors; // 0x15ac
	TArray<FEffectSpotTarget> m_AffectedActors; // 0x15bc
	char m_bUsesEffectRefresh : 1; // 0x15cc
	float m_fLastRefreshTime; // 0x15d0
	float m_fMinRefreshTime; // 0x15d4
	FEffectSpotFXInfo c_SpotFX[0x64]; // 0x15d8
};

struct UUIScene_UIHudCenter : UUIScene {
	ObjectProperty m_mcKillingBlow; // 0x1cc
};

struct UMaterialExpressionParticleMacroUV : UMaterialExpression {
	char bUseViewSpace : 1; // 0xb0
};

struct UTgPawnMod_FxAudio_EDMJenos : UTgPawnMod_FxAudio {
	float m_fGlowMultBass; // 0xac
};

struct ATgTutorialVolume : AVolume {
	char m_bHasLocalPawn : 1; // 0x2bc
	char m_bHasSeenLocalPawnBefore : 1; // 0x2bc
};

struct UTerrainMaterial : UObject {
	FMatrix LocalToMapping; // 0x60
	ETerrainMappingType MappingType; // 0xa0
	float MappingScale; // 0xa4
	float MappingRotation; // 0xa8
	float MappingPanU; // 0xac
	float MappingPanV; // 0xb0
	ObjectProperty Material; // 0xb4
	ObjectProperty DisplacementMap; // 0xbc
	float DisplacementScale; // 0xc4
};

struct AWaterVolume : APhysicsVolume {
	ObjectProperty EntrySound; // 0x314
	AActor* EntryActor; // 0x31c
	ObjectProperty ExitSound; // 0x324
	AActor* ExitActor; // 0x32c
};

struct UTgInventoryObject_Listen_Combo_Cassie : UTgInventoryObject_Listen_Combo {
	float m_fDodgeRollFireTime; // 0xcc
	ObjectProperty m_CachedCassiePawn; // 0xd0
};

struct UUIScene_UIPopupChampionLevelUp : UUIScene {
	ObjectProperty m_mcTitle; // 0x1cc
	ObjectProperty m_mcPurchaseAmount; // 0x1d4
	ObjectProperty m_mcLevelTF; // 0x1dc
	ObjectProperty m_mcCancelPrompt; // 0x1e4
	ObjectProperty m_mcHoldPrompt; // 0x1ec
	ObjectProperty m_mcWait; // 0x1f4
	ObjectProperty m_pSpinner; // 0x1fc
	ObjectProperty m_pControllerPrice; // 0x204
	ObjectProperty m_pPurchaseButton; // 0x20c
	ObjectProperty m_pHoldPrompt; // 0x214
	ObjectProperty m_pLeftArrow; // 0x21c
	ObjectProperty m_pRightArrow; // 0x224
	ObjectProperty m_pCancelButton; // 0x22c
	Fdword m_dwChampId; // 0x234
	Fdword m_dwChampXP; // 0x238
	Fdword m_dwChampLevel; // 0x23c
	Fdword m_dwPurchaseLevel; // 0x240
	ObjectProperty m_pLTI; // 0x244
	ObjectProperty m_pPurchasePrice; // 0x24c
	Fdword m_dwPurchaseQuantity; // 0x254
};

struct UUIComponent : UObject {
	FPointer VfTable_ITgCallbackInterface; // 0x60
	UICOMPONENTTYPE m_ComponentType; // 0x68
	ObjectProperty m_Owner; // 0x6c
	ObjectProperty m_mcRoot; // 0x74
	FString m_sLoadName; // 0x7c
	int32_t m_nLoadIndex; // 0x8c
	FString m_sConstructName; // 0x90
	char m_bConstructed : 1; // 0xa0
	char m_bCenteredHorizontally : 1; // 0xa0
	char m_bCenteredVertically : 1; // 0xa0
	char m_bShouldCreateInput : 1; // 0xa0
	char m_bBlockInputFallThrough : 1; // 0xa0
	char m_bBlockGlobalInput : 1; // 0xa0
	char m_bPushInputOnVisible : 1; // 0xa0
	int32_t m_nDeferredUpdateCallbackHandle; // 0xa4
	TArray<ObjectProperty> m_Components; // 0xa8
	FMultiMap_Mirror m_ComponentMap; // 0xb8
	ObjectProperty m_CallbackContainer; // 0x100
	int32_t m_nXBeforeCenter; // 0x108
	int32_t m_nYBeforeCenter; // 0x10c
	ObjectProperty m_InputContext; // 0x110
};

struct UUIScene_UIChampion : UUIScene {
	UICHAMPION_STATE m_eState; // 0x1cc
	char m_bInsideRotator : 1; // 0x1d0
	char m_bIsRotating : 1; // 0x1d0
	float m_fPrevMouseXPos; // 0x1d4
	ObjectProperty m_pChampData; // 0x1d8
	ObjectProperty m_mcDetailsTitle; // 0x1e0
	ObjectProperty m_mcDetailsSubtitle; // 0x1e8
	ObjectProperty m_mcDetailsClassIcon; // 0x1f0
	ObjectProperty m_pRotator; // 0x1f8
	ObjectProperty m_pOverview; // 0x200
	ObjectProperty m_pSkins; // 0x208
	ObjectProperty m_pLoadouts; // 0x210
	ObjectProperty m_pAbilities; // 0x218
};

struct UUIComponent_ItemUIChampion : UUIComponent_Display {
	ObjectProperty m_mcName; // 0x124
	ObjectProperty m_mcOwned; // 0x12c
	ObjectProperty m_mcRarity; // 0x134
	ObjectProperty m_mcEquipped; // 0x13c
	ObjectProperty m_mcChampionName; // 0x144
	ObjectProperty m_mcSourceIconLock; // 0x14c
	ObjectProperty m_mcSourceIconEvent; // 0x154
	ObjectProperty m_mcSourceIconBattlePass; // 0x15c
	ObjectProperty m_mcSourceIconChest; // 0x164
	ObjectProperty m_mcColorPickerIcon; // 0x16c
	ObjectProperty m_pItemHint; // 0x174
	ObjectProperty m_pItemPrice; // 0x17c
	ObjectProperty m_pSourceIconCurrencies; // 0x184
	ObjectProperty m_pExclusiveBanner; // 0x18c
	ObjectProperty m_pItemPreviewStack; // 0x194
	char m_bCheckSkinForCollectionEquipped : 1; // 0x19c
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t PosX; // 0xb0
	int32_t PosY; // 0xb4
	int32_t SizeX; // 0xb8
	int32_t SizeY; // 0xbc
	FString Text; // 0xc0
};

struct UUIScene_UISettings : UUIScene {
	ObjectProperty m_LastOpenChatTab; // 0x1cc
};

struct UNavMeshPath_Toward : UNavMeshPathConstraint {
	char bBiasAgainstHighLevelPath : 1; // 0x78
	float OutOfHighLevelPathBias; // 0x7c
	ObjectProperty GoalActor; // 0x80
	FVector GoalPoint; // 0x88
};

struct ATgDevice_LongbowPlanted : ATgDevice_Stim {
	ObjectProperty m_CachedLongbow; // 0xa04
	ObjectProperty m_CachedInhand; // 0xa0c
};

struct UUIComponent_Targeter_BracketTargeter : UUIComponent_Targeter {
	ObjectProperty m_mcTargeterLeft; // 0x184
	ObjectProperty m_mcTargeterRight; // 0x18c
	float m_fSideTargeterAspectRatio; // 0x194
	float m_fMaxBracketWidth; // 0x198
};

struct ATgDeploy_Pickup : ATgDeployable {
	char m_bApplyToEntireTeam : 1; // 0x46c
};

struct UTgInventoryObject_Listen_Combo_Barik : UTgInventoryObject_Listen_Combo {
	TArray<FComboInfo> m_ComboInfoList; // 0xcc
	TArray<FUIMarkInfo> m_UIMarkInfoList; // 0xdc
	TArray<FBurningMarkInfo> m_BurningMarks; // 0xec
};

struct ATgAIController : AGameAIController {
	ObjectProperty m_pOwner; // 0x4e0
	FVector m_vSpawnLocation; // 0x4e8
	FRotator m_rSpawnDirection; // 0x4f4
	ObjectProperty m_pFactory; // 0x500
	int32_t m_nFactorySpawnGroup; // 0x508
	FPointer m_pBot; // 0x50c
	FPointer m_pSettings; // 0x514
	FPointer m_pSkin; // 0x51c
	int32_t m_iAssignedLane; // 0x524
	TMap<None, None> m_SeePawnCache; // 0x528
	float LastSeePawnCacheTime; // 0x570
	float SeePawnClearTime; // 0x574
	ObjectProperty m_pLastAttacker; // 0x578
	ObjectProperty m_Squad; // 0x580
	float LastDamageTakenTime; // 0x588
	FVector LastDamageTakenPosition; // 0x58c
	TMap<None, None> m_LoSCache; // 0x598
	float LastLoSCacheTime; // 0x5e0
	EHavokNavigationMeshType m_eNavmeshType; // 0x5e4
	EPhysics WalkingPhysics; // 0x5e5
	float m_fAILevelUpSecs; // 0x5e8
	float VisionDistance; // 0x5ec
	float VisionDistanceBonus; // 0x5f0
	char bUsesObstacleAvoidance : 1; // 0x5f4
	char bIsPaused : 1; // 0x5f4
	char bIsAIFrozen : 1; // 0x5f4
	ObjectProperty ObstacleAvoidance; // 0x5f8
	float ObstacleAvoidanceGridPointSize; // 0x600
	float ObstacleAvoidanceGridExtents; // 0x604
	FVector SpreadLocation; // 0x608
	ObjectProperty CachedPRI; // 0x614
	float LastCheckStuckTime; // 0x61c
	float CheckStuckTime; // 0x620
	FVector LastCachedStuckPosition; // 0x624
	float LastCheckFlungTime; // 0x630
	float CheckFlungTime; // 0x634
	FVector LastCachedFlungPosition; // 0x638
};

struct UForceFeedbackManager : UObject {
	char bAllowsForceFeedback : 1; // 0x60
	char bIsPaused : 1; // 0x60
	float ScaleAllWaveformsBy; // 0x64
	TArray<FForceFeedbackPlayingInfo> PlayingWaveforms; // 0x68
};

struct ANxGenericForceFieldBrush : AVolume {
	int32_t ExcludeChannel; // 0x2bc
	FRBCollisionChannelContainer CollideWithChannels; // 0x2c0
	ERBCollisionChannel RBChannel; // 0x2c4
	FFB_ForceFieldCoordinates Coordinates; // 0x2c5
	FVector Constant; // 0x2c8
	FVector PositionMultiplierX; // 0x2d4
	FVector PositionMultiplierY; // 0x2e0
	FVector PositionMultiplierZ; // 0x2ec
	FVector PositionTarget; // 0x2f8
	FVector VelocityMultiplierX; // 0x304
	FVector VelocityMultiplierY; // 0x310
	FVector VelocityMultiplierZ; // 0x31c
	FVector VelocityTarget; // 0x328
	FVector Noise; // 0x334
	FVector FalloffLinear; // 0x340
	FVector FalloffQuadratic; // 0x34c
	float TorusRadius; // 0x358
	FPointer ForceField; // 0x35c
	TArray<FPointer> ConvexMeshes; // 0x364
	TArray<FPointer> ExclusionShapes; // 0x374
	TArray<FPointer> ExclusionShapePoses; // 0x384
	FPointer LinearKernel; // 0x394
};

struct ATgPhysAnimTestActor : AActor {
	TArray<FName> LowerBoneNames; // 0x280
	TArray<FName> LinearBoneSpringNames; // 0x290
	TArray<FName> AngularBoneSpringNames; // 0x2a0
	ComponentProperty SkeletalMeshComponent; // 0x2b0
	EPATAState CurrentState; // 0x2b8
	char bBlendToGetUp : 1; // 0x2bc
	char bBlendingBack : 1; // 0x2bc
	char bRampingDownMotors : 1; // 0x2bc
	char bNextPokeKnocksDown : 1; // 0x2bc
	float GetUpBlendStartTime; // 0x2c0
	float GetUpBlendTime; // 0x2c4
	float GetUpToIdleTime; // 0x2c8
	float ActorOriginHeight; // 0x2cc
	float PokePauseTime; // 0x2d0
	float PokeBlendTime; // 0x2d4
	float BlendBackStartTime; // 0x2d8
	float MotorDownStartTime; // 0x2dc
	float MotorDownTime; // 0x2e0
	float MotorDownAnimTime; // 0x2e4
	float BlendStaggerAnimTime; // 0x2e8
	float StaggerSpeedAdj; // 0x2ec
	float StaggerVel; // 0x2f0
	FVector MoveDir; // 0x2f4
	float AngularHipDriveScale; // 0x300
	float StaggerMuscleScale; // 0x304
	ObjectProperty BlendNode; // 0x308
	ObjectProperty GetUpNode; // 0x310
	ObjectProperty RunNode; // 0x318
	ObjectProperty HipBody; // 0x320
};

struct UPlayer : UObject {
	FPointer VfTable_FExec; // 0x60
	ObjectProperty Actor; // 0x68
	int32_t CurrentNetSpeed; // 0x70
	int32_t ConfiguredInternetSpeed; // 0x74
	int32_t ConfiguredLanSpeed; // 0x78
	float PP_DesaturationMultiplier; // 0x7c
	float PP_HighlightsMultiplier; // 0x80
	float PP_MidTonesMultiplier; // 0x84
	float PP_ShadowsMultiplier; // 0x88
};

struct UNavMeshGoal_Filter : UObject {
	char bShowDebug : 1; // 0x60
	int32_t NumNodesThrownOut; // 0x64
	int32_t NumNodesProcessed; // 0x68
};

struct UUIScene_UIFullScreenBattlePass : UUIScene {
	ObjectProperty m_InputBack; // 0x1cc
	ObjectProperty m_InputOk; // 0x1d4
	ObjectProperty m_pBack; // 0x1dc
	ObjectProperty m_pButton; // 0x1e4
	ObjectProperty m_pButtonKey; // 0x1ec
	TArray<int32_t> m_PreviewItemIds; // 0x1f4
	int32_t m_nCurrentPreviewIndex; // 0x204
	char m_bIsShown : 1; // 0x208
	char m_bCanPreviewItems : 1; // 0x208
};

struct UTgInventoryObject_Listen_Combo_Pip : UTgInventoryObject_Listen_Combo {
	TArray<ObjectProperty> m_Projectiles; // 0xcc
	TArray<FVector> m_SpawnLocations; // 0xdc
	TArray<ObjectProperty> m_MarkedTargetsFlask; // 0xec
	TArray<float> m_fMarkedTimesFlask; // 0xfc
};

struct UUIComponent_SummerEventHome : UUIComponent_Display {
	ObjectProperty m_pBundleLTI; // 0x124
	ObjectProperty m_pBonusLTI; // 0x12c
	ObjectProperty m_mcBundleTitle; // 0x134
	ObjectProperty m_mcButtonTitle; // 0x13c
	ObjectProperty m_pBundleItems; // 0x144
	ObjectProperty m_pPurchaseButton; // 0x14c
	ObjectProperty m_pPurchaseButtonCurr; // 0x154
	ObjectProperty m_pPurchaseButtonKey; // 0x15c
	ObjectProperty m_pPlayPanel; // 0x164
	ObjectProperty m_pItemPreviewStack; // 0x16c
	ObjectProperty m_pPurchaseAction; // 0x174
};

struct UUIData_Commendation : UUIData {
	int32_t m_nType; // 0x64
};

struct UCurveEdPresetCurve : UObject {
	FString CurveName; // 0x60
	TArray<FPresetGeneratedPoint> Points; // 0x70
};

struct UMaterial : UMaterialInterface {
	ObjectProperty PhysMaterial; // 0x254
	UPhysicalMaterial* PhysicalMaterial; // 0x25c
	ObjectProperty PhysMaterialMask; // 0x264
	int32_t PhysMaterialMaskUVChannel; // 0x26c
	ObjectProperty BlackPhysicalMaterial; // 0x270
	ObjectProperty WhitePhysicalMaterial; // 0x278
	FColorMaterialInput DiffuseColor; // 0x280
	FScalarMaterialInput DiffusePower; // 0x2bc
	FColorMaterialInput SpecularColor; // 0x2f8
	FScalarMaterialInput SpecularPower; // 0x334
	FVectorMaterialInput Normal; // 0x370
	FColorMaterialInput EmissiveColor; // 0x3b4
	FScalarMaterialInput Opacity; // 0x3f0
	FScalarMaterialInput OpacityMask; // 0x42c
	float OpacityMaskClipValue; // 0x468
	float ShadowDepthBias; // 0x46c
	FVector2MaterialInput Distortion; // 0x470
	EBlendMode BlendMode; // 0x4b0
	EMaterialLightingModel LightingModel; // 0x4b1
	EMaterialDepthModifier DepthModificationMode; // 0x4b2
	EMaterialTessellationMode D3D11TessellationMode; // 0x4b3
	FColorMaterialInput CustomLighting; // 0x4b4
	FColorMaterialInput CustomSkylightDiffuse; // 0x4f0
	FVectorMaterialInput AnisotropicDirection; // 0x52c
	FScalarMaterialInput TwoSidedLightingMask; // 0x570
	FColorMaterialInput TwoSidedLightingColor; // 0x5ac
	FVectorMaterialInput WorldPositionOffset; // 0x5e8
	FVectorMaterialInput WorldDisplacement; // 0x62c
	FScalarMaterialInput TessellationMultiplier; // 0x670
	FColorMaterialInput SubsurfaceInscatteringColor; // 0x6ac
	FColorMaterialInput SubsurfaceAbsorptionColor; // 0x6e8
	FScalarMaterialInput SubsurfaceScatteringRadius; // 0x724
	FVectorMaterialInput CustomPixelShaderVector; // 0x760
	FScalarMaterialInput PixelDepthModifier; // 0x7a4
	char EnableSubsurfaceScattering : 1; // 0x7e0
	char EnableSeparateTranslucency : 1; // 0x7e0
	char bEnableMaskedAntialiasing : 1; // 0x7e0
	char TwoSided : 1; // 0x7e0
	char TwoSidedFlipsNormals : 1; // 0x7e0
	char TwoSidedSeparatePass : 1; // 0x7e0
	char bDisableDepthTest : 1; // 0x7e0
	char bSceneTextureRenderBehindTranslucency : 1; // 0x7e0
	char bAllowFog : 0; // 0x7e0
	char bTranslucencyReceiveDominantShadowsFromStatic : 0; // 0x7e0
	char bTranslucencyInheritDominantShadowsFromOpaque : 0; // 0x7e0
	char bAllowTranslucencyDoF : 0; // 0x7e0
	char bUseOneLayerDistortion : 0; // 0x7e0
	char bUseLitTranslucencyDepthPass : 0; // 0x7e0
	char bUseLitTranslucencyPostRenderDepthPass : 0; // 0x7e0
	char bCastLitTranslucencyShadowAsMasked : 0; // 0x7e0
	char bUsedAsLightFunction : 0; // 0x7e0
	char bUsedWithFogVolumes : 0; // 0x7e0
	char bUsedAsSpecialEngineMaterial : 0; // 0x7e0
	char bUsedWithSkeletalMesh : 0; // 0x7e0
	char bUsedWithTerrain : 0; // 0x7e0
	char bUsedWithLandscape : 0; // 0x7e0
	char bUsedWithMobileLandscape : 0; // 0x7e0
	char bUsedWithFracturedMeshes : 0; // 0x7e0
	char bUsedWithParticleSystem : 0; // 0x7e0
	char bUsedWithParticleSprites : 0; // 0x7e0
	char bUsedWithBeamTrails : 0; // 0x7e0
	char bUsedWithParticleSubUV : 0; // 0x7e0
	char bUsedWithSpeedTree : 0; // 0x7e0
	char bUsedWithStaticLighting : 0; // 0x7e0
	char bUsedWithLensFlare : 0; // 0x7e0
	char bUsedWithGammaCorrection : 0; // 0x7e0
	char bUsedWithInstancedMeshParticles : 1; // 0x7e4
	char bUsedWithFluidSurfaces : 1; // 0x7e4
	char bUsedWithDecals : 1; // 0x7e4
	char bUsedWithMaterialEffect : 1; // 0x7e4
	char bUsedWithMorphTargets : 1; // 0x7e4
	char bUsedWithRadialBlur : 1; // 0x7e4
	char bUsedWithInstancedMeshes : 1; // 0x7e4
	char bUsedWithSplineMeshes : 1; // 0x7e4
	char bUsedWithAPEXMeshes : 0; // 0x7e4
	char bUsedWithScreenDoorFade : 0; // 0x7e4
	char bEnableCrackFreeDisplacement : 0; // 0x7e4
	char bTessellationFrustumCulling : 0; // 0x7e4
	char bTessellationBackfaceCulling : 0; // 0x7e4
	char bUseImageBasedReflections : 0; // 0x7e4
	char Wireframe : 0; // 0x7e4
	char bPerPixelCameraVector : 0; // 0x7e4
	char bAllowLightmapSpecular : 0; // 0x7e4
	char bOverrideLowQualitySpecular : 0; // 0x7e4
	char bCleanupUnusedTextures : 0; // 0x7e4
	char bIsFallbackMaterial : 0; // 0x7e4
	char bUsesDistortion : 0; // 0x7e4
	char bIsMasked : 0; // 0x7e4
	char bIsPreviewMaterial : 0; // 0x7e4
	float ImageReflectionNormalDampening; // 0x7e8
	ObjectProperty CookedShaderCache; // 0x7ec
	FPointer MaterialResources[0x3]; // 0x7f4
	FPointer DefaultMaterialInstances[0x3]; // 0x80c
	int32_t EditorX; // 0x824
	int32_t EditorY; // 0x828
	int32_t EditorPitch; // 0x82c
	int32_t EditorYaw; // 0x830
	TArray<ObjectProperty> Expressions; // 0x834
	TArray<FMaterialFunctionInfo> MaterialFunctionInfos; // 0x844
	TMap<None, None> EditorParameters; // 0x854
	TArray<ObjectProperty> ReferencedTextures; // 0x89c
};

struct UTgSkelCon_CCD_IK_FootPlacement : USkelControlBase {
	int32_t NumBones; // 0xd0
	int32_t MaxPerBoneIterations; // 0xd4
	int32_t IterationsCount; // 0xd8
	float Precision; // 0xdc
	char bStartFromTail : 1; // 0xe0
	char bNoTurnOptimization : 1; // 0xe0
	char bAllowStretching : 1; // 0xe0
	char bInvertFootUpAxis : 1; // 0xe0
	char bOrientFootToGround : 1; // 0xe0
	char bOnlyEnableForUpAdjustment : 1; // 0xe0
	char m_bUseCachedFootOffset : 1; // 0xe0
	TArray<FJointConstraintInformation> JointConstraints; // 0xe4
	float MaxAngleSteps; // 0xf4
	float MaxStretchSteps; // 0xf8
	float FootOffset; // 0xfc
	EAxis FootUpAxis; // 0x100
	FRotator FootRotOffset; // 0x104
	float MaxUpAdjustment; // 0x110
	float MaxDownAdjustment; // 0x114
	float MaxFootOrientAdjust; // 0x118
	FVector EffectorLocation; // 0x11c
	FVector m_vCachedFootOffset; // 0x128
};

struct UUIComponent_EventVault : UUIComponent_Display {
	Fdword m_dwVaultVendor; // 0x124
	Fdword m_dwRequiredBundlesVendor; // 0x128
	int32_t m_nSelectedIndex; // 0x12c
	char m_bUseFixedCamDisance : 1; // 0x130
	char m_bPlayEmoteIfSkinOwned : 1; // 0x130
	ObjectProperty m_pPreviewLTI; // 0x134
	TMap<None, None> m_CardArt; // 0x13c
	TArray<ObjectProperty> m_pVaultItems; // 0x184
	ObjectProperty m_mcNameTF; // 0x194
	ObjectProperty m_mcDescTF; // 0x19c
	ObjectProperty m_mcUnlockTF; // 0x1a4
	ObjectProperty m_pRequiredBundles; // 0x1ac
	ObjectProperty m_pPurchaseButton; // 0x1b4
	ObjectProperty m_pPrevArrow; // 0x1bc
	ObjectProperty m_pNextArrow; // 0x1c4
	ObjectProperty m_pPurchaseAction; // 0x1cc
	ObjectProperty m_pCardArtMesh; // 0x1d4
	ObjectProperty m_CardArtMaterial; // 0x1dc
	ObjectProperty m_CardArtManifestGroup; // 0x1e4
};

struct UTgInventoryObject_Listen_PoisonBolts : UTgInventoryObject_Listen_AbilityProcBase {
	TArray<FPoisonBoltInfo> m_PoisonBoltTargets; // 0xcc
	int32_t m_EffectGroupID; // 0xdc
};

struct ATgDevice_SevenMaskedFear : ATgDevice_HitPulse {
	float m_fTimeFocusedOnIncrement; // 0xa0c
	float m_fTimeFocusedOnThreshold; // 0xa10
	TArray<FFearTarget> m_TrackedFearedTargets; // 0xa14
};

struct UUIScene_UIHudStrix : UUIScene {
	ObjectProperty m_mcScope; // 0x1cc
	ObjectProperty m_mcOuterScope; // 0x1d4
	char m_bViewTargetOwl : 1; // 0x1dc
	char m_bHudVisible : 1; // 0x1dc
	float m_fColorTransitionAmt; // 0x1e0
	float m_fColorTransitionPerSec; // 0x1e4
	FLinearColor m_ColorTransitionMultiplier; // 0x1e8
	FLinearColor m_ColorTransitionAdditive; // 0x1f8
	int32_t m_nScopeColorTransitionCBHandle; // 0x208
};

struct UTcpNetDriver : UNetDriver {
	char AllowPlayerPortUnreach : 1; // 0x208
	char LogPortUnreach : 1; // 0x20c
};

struct UTgSeqAct_TemporaryRemoveDevice : USequenceAction {
	int32_t m_nEquipPoint; // 0x108
};

struct UUIHudWaypoint : UTgGfxScene {
	float m_fClipSize; // 0x1ec
	float m_fPushTimer; // 0x1f0
	float m_fPulseDelay; // 0x1f4
	float m_fPulseTimer; // 0x1f8
	TArray<FWaypointObjective> m_Captures; // 0x1fc
	FWaypointObjective m_Escort; // 0x20c
	FWaypointObjective m_Attack; // 0x238
	FWaypointObjective m_Defend; // 0x264
	FWaypointObjective m_Beacon; // 0x290
	FWaypointObjective m_Projectile[0x4]; // 0x2bc
	FWaypointObjective m_KillCamYou; // 0x36c
	TArray<FWaypointObjective> m_DominationObjectives; // 0x398
	FVector m_SnappedWaypointOffset; // 0x3a8
};

struct UTgSkelCon_ClockworkSpinner : USkelControlSingleBone {
	float m_fInterpTime; // 0x100
	float m_fRemainingInterpTime; // 0x104
	float m_fPauseTime; // 0x108
	float m_fRemainingPauseTime; // 0x10c
	EAxis RotationAxis; // 0x110
	int32_t DeltaRotation; // 0x114
	float m_fInterpRotation; // 0x118
	char bLimitedRotation : 1; // 0x11c
	char bForward : 1; // 0x11c
	char m_bResetRotationOnZeroStrength : 1; // 0x11c
	float m_fRotationMin; // 0x120
	float m_fRotationMax; // 0x124
	float m_fResetInterpTime; // 0x128
	float m_fResetPauseTime; // 0x12c
	float m_fResetRotation; // 0x130
	float m_fRotatorMin; // 0x134
	float m_fRotatorMax; // 0x138
	float RotationsPerSecond; // 0x13c
	float ResetRotationsPerSecond; // 0x140
};

struct UTgInventoryObject_Listen_FirstShotDuringOrAfterStealth : UTgInvListener {
	char m_bWasStealthed : 1; // 0xc4
	float m_fLastStealthTime; // 0xc8
};

struct UUIData_Loadout : UUIData {
	FPointer VfTable_IUIData_LoadoutInterface; // 0x64
	Fdword m_dwLoadoutId; // 0x6c
	FString m_sNewName; // 0x70
	char m_bPendingNameChange : 1; // 0x80
	char m_bItemsDirty : 1; // 0x80
	int32_t m_nCopyOfTemplate; // 0x84
	TArray<ObjectProperty> m_LoadoutItems; // 0x88
};

struct UAnimNotify_Sound : UAnimNotify {
	ObjectProperty SoundCue; // 0x68
	char bFollowActor : 1; // 0x70
	char bIgnoreIfMeshHidden : 1; // 0x70
	char bIgnoreIfActorHidden : 1; // 0x70
	FName BoneName; // 0x74
	float PercentToPlay; // 0x7c
	float VolumeMultiplier; // 0x80
	float PitchMultiplier; // 0x84
};

struct UTgDeviceForm_AzaanDash : UTgDeviceForm {
	TArray<ObjectProperty> m_AzaanNodes1p; // 0x28c
	int32_t m_nLastPosture; // 0x29c
	ObjectProperty m_Target; // 0x2a0
};

struct UParticleModuleAttractorSkelVertSurface : UParticleModuleAttractorBase {
	EVertSurfaceAttractorFalloffType FalloffType; // 0x68
	EAttractorSkelVertSurfaceDestination DestinationType; // 0x69
	char bParticleLifeRelative : 1; // 0x6c
	char bEnforceNormalCheck : 1; // 0x6c
	FRawDistributionFloat FalloffExponent; // 0x70
	FRawDistributionFloat Range; // 0x94
	FRawDistributionFloat Strength; // 0xb8
	FRawDistributionFloat CollisionRadius; // 0xdc
	FRawDistributionFloat DragCoefficient; // 0x100
	FRawDistributionFloat DragRadius; // 0x124
	FVector UniversalOffset; // 0x148
	FName SkelMeshActorParamName; // 0x154
	TArray<FName> ValidAssociatedBones; // 0x15c
	FVector NormalToCompare; // 0x16c
	float NormalCheckToleranceDegrees; // 0x178
	float NormalCheckTolerance; // 0x17c
	TArray<int32_t> ValidMaterialIndices; // 0x180
};

struct AApexDestructibleActor : AActor {
	ComponentProperty LightEnvironment; // 0x280
	char bFractureMaterialOverride : 1; // 0x288
	char bPlaySingleFractureMaterialEffect : 1; // 0x288
	TArray<ObjectProperty> FractureMaterials; // 0x28c
	ComponentProperty StaticDestructibleComponent; // 0x29c
	int32_t LOD; // 0x2a4
	TArray<char> VisibilityFactors; // 0x2a8
	TArray<ObjectProperty> FractureSounds; // 0x2b8
	TArray<ObjectProperty> FractureParticleEffects; // 0x2c8
};

struct ATgGame_Paladins_Flagball : ATgGame_Paladins {
	float m_fSetupDuration; // 0x868
	float m_fRoundResetDuration; // 0x86c
	ObjectProperty m_SpawnPoint; // 0x870
	char m_bFlagballActive : 1; // 0x878
	char m_bPlayOfTheGameOnFinalScore : 1; // 0x878
	char m_bPlayedOneMinuteLeftSwitch : 1; // 0x878
	char m_bAnnouncerPlayBallPlayed : 1; // 0x878
	char m_bAnnouncerPlayedMatchPointTF1 : 1; // 0x878
	char m_bAnnouncerPlayedMatchPointTF2 : 1; // 0x878
	int32_t m_nFlagballDeviceID; // 0x87c
	TG_EQUIP_POINT m_eFlagballEquipSlot; // 0x880
	EFlagballLeadState m_currentLeadState; // 0x881
	EFlagballPossessionState m_currentPossessionState; // 0x882
	float m_fCleanUpFailSafeTimer; // 0x884
	float m_fCleanUpFailSafeRate; // 0x888
};

struct UTgAnimBlendInterpBySpeed : UAnimNodeBlend {
	ObjectProperty m_TgPawn; // 0x124
	float m_fBlendTime; // 0x12c
	float m_fFullRunSpeed; // 0x130
	float m_fFullIdleSpeed; // 0x134
};

struct UUISettings : UTgGfxScene {
	ObjectProperty m_ChampionDropdown; // 0x1ec
	int32_t m_eType; // 0x1f4
	int32_t m_nHighlightOption; // 0x1f8
	int32_t m_nOptionCount; // 0x1fc
	int32_t m_nScrollIndex; // 0x200
	char m_bOptionFocus : 1; // 0x204
	char m_bKeybindFocus : 1; // 0x204
	char m_bSettingsChanged : 1; // 0x204
	char m_bIsInResetPrompt : 1; // 0x204
	char m_bUseVSync : 1; // 0x204
	char m_bUseD3D11 : 1; // 0x204
	float m_fDelayTimer; // 0x208
	ObjectProperty m_Title; // 0x20c
	ObjectProperty m_Frame; // 0x214
	ObjectProperty m_Reset; // 0x21c
	ObjectProperty m_Blocker; // 0x224
	ObjectProperty m_KeybindPopup; // 0x22c
	ObjectProperty m_KeybindPopupTF; // 0x234
	ObjectProperty m_KeybindCancel; // 0x23c
	FSettingOption m_Option[0xc]; // 0x244
	FKeybindOption m_Keybind[0xc]; // 0x664
	ObjectProperty m_AcceptButton; // 0x964
	ObjectProperty m_mcScrollbar; // 0x96c
	ObjectProperty m_grOptions; // 0x974
	ObjectProperty m_grKeybinds; // 0x97c
	ObjectProperty m_grTeams; // 0x984
	ObjectProperty m_mcGamepad; // 0x98c
	ObjectProperty m_mcGamepadButtons; // 0x994
	ObjectProperty m_mcGamepadImage; // 0x99c
	ObjectProperty m_Spectator; // 0x9a4
	ObjectProperty m_mcSpectatorTeamNameBlue; // 0x9ac
	ObjectProperty m_mcSpectatorTeamNameRed; // 0x9b4
	ObjectProperty m_mcSafeFrame; // 0x9bc
	ObjectProperty m_ResetToDefaultAction; // 0x9c4
	TArray<int32_t> m_DelayedUpdates; // 0x9cc
	TArray<int32_t> m_VideoTypes; // 0x9dc
	TArray<int32_t> m_HudTypes; // 0x9ec
	TArray<int32_t> m_AudioTypes; // 0x9fc
	TArray<int32_t> m_ControlTypes; // 0xa0c
	TArray<int32_t> m_SpectatorTypes; // 0xa1c
};

struct UUIData_StringWithCount : UUIData_String {
	int32_t m_nValue; // 0x74
};

struct UAnimNotify_ForceField : UAnimNotify {
	ComponentProperty ForceFieldComponent; // 0x68
	char bAttach : 1; // 0x70
	FName SocketName; // 0x74
	FName BoneName; // 0x7c
};

struct UInterpGroupAI : UInterpGroup {
	FName StageMarkGroup; // 0x98
	char SnapToRootBoneLocationWhenFinished : 1; // 0xa0
	char bNoEncroachmentCheck : 1; // 0xa0
	char bDisableWorldCollision : 1; // 0xa0
	char bIgnoreLegacyHeightAdjust : 1; // 0xa0
	char bRecreatePreviewPawn : 1; // 0xa0
	char bRefreshStageMarkGroup : 1; // 0xa0
};

struct UParticleModuleUberRainSplashB : UParticleModuleUberBase {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector ColorOverLife; // 0xc0
	FRawDistributionFloat AlphaOverLife; // 0xe4
	FRawDistributionVector LifeMultiplier; // 0x108
	char MultiplyX : 1; // 0x12c
	char MultiplyY : 1; // 0x12c
	char MultiplyZ : 1; // 0x12c
	FRawDistributionFloat StartRotationRate; // 0x130
};

struct ANxGenericForceField : ANxForceField {
	FFG_ForceFieldCoordinates Coordinates; // 0x2d4
	FVector Constant; // 0x2d8
	FVector PositionMultiplierX; // 0x2e4
	FVector PositionMultiplierY; // 0x2f0
	FVector PositionMultiplierZ; // 0x2fc
	FVector PositionTarget; // 0x308
	FVector VelocityMultiplierX; // 0x314
	FVector VelocityMultiplierY; // 0x320
	FVector VelocityMultiplierZ; // 0x32c
	FVector VelocityTarget; // 0x338
	FVector Noise; // 0x344
	FVector FalloffLinear; // 0x350
	FVector FalloffQuadratic; // 0x35c
	float TorusRadius; // 0x368
	FPointer LinearKernel; // 0x36c
};

struct ATgTeamBlocker : ATgMeshAssembly {
	char m_bBlockFlagCarrier : 1; // 0x298
	char m_bBlockFriendlyFire : 1; // 0x298
};

struct UUIComponent_TeamPortraits : UUIComponent_Display {
	char m_bFriendly : 1; // 0x124
	int32_t m_nTaskForceId; // 0x128
	int32_t m_nPortraitToPlayerId[0x5]; // 0x12c
};

struct UDrawConeComponent : UPrimitiveComponent {
	FColor ConeColor; // 0x24c
	float ConeRadius; // 0x250
	float ConeAngle; // 0x254
	int32_t ConeSides; // 0x258
};

struct UTgInventoryObject_Listen_FirstShotDuringOrAfterMovementAbility : UTgInventoryObject_Listen_FirstShotAfterMovementAbility {
	char m_bMovementAbilityActive : 1; // 0xd4
};

struct UTgDeviceForm_CorrupterUlt : UTgDeviceForm {
	ObjectProperty m_CachedCorrupter; // 0x28c
	char m_bPoolActive : 1; // 0x294
	TArray<ObjectProperty> m_VoraAnimNodes; // 0x298
};

struct ATgDevice_InPursuit : ATgDevice {
	char m_bRecalculateTarget : 1; // 0xa04
	ObjectProperty m_CurrentMark; // 0xa08
	ObjectProperty m_PursuitTarget; // 0xa10
	ObjectProperty m_CachedInhand; // 0xa18
};

struct ATgProj_Tracer : ATgProjectile {
	ComponentProperty PSC; // 0x450
};

struct UUIData_EventEmoteButton : UUIData {
	ObjectProperty m_pEmoteItem; // 0x64
	ObjectProperty m_pQuestGoals; // 0x6c
};

struct UInterpTrackInstSkelControlStrength : UInterpTrackInst {
	char bSavedControlledByAnimMetaData : 1; // 0x60
};

struct UTgAnimBlendByPaladinsCharacter : UTgAnimNodeBlendList {
	ObjectProperty m_WeaponMeshActor; // 0x168
	TG_EQUIP_POINT m_SubNodeEquipSlot; // 0x170
	FChildAnimParameters m_ChildParams[0x11]; // 0x174
	TArray<EPalCharParams> m_nChildAnimStack; // 0x52c
	int32_t m_nCustomRetrieveIndex; // 0x53c
	char m_bBlendToIdleOnInterruptInspect : 1; // 0x540
};

struct UAnimNodeCrossfader : UAnimNodeBlend {
	FName DefaultAnimSeqName; // 0x124
	char bDontBlendOutOneShot : 1; // 0x12c
	float PendingBlendOutTimeOneShot; // 0x130
};

struct UUIComponent_HudScoreTDM : UUIComponent_Display {
	int32_t m_nTimeRemaining; // 0x124
	int32_t m_nMaxScore; // 0x128
	int32_t m_nScoreA; // 0x12c
	int32_t m_nScoreB; // 0x130
	char m_bFlashWhenUnderTenSeconds : 1; // 0x134
	char m_bOvertime : 1; // 0x134
	char m_bFriendlyTaskForceClose : 1; // 0x134
	char m_bEnemyTaskForceClose : 1; // 0x134
	char m_bForceTDMHUD : 1; // 0x134
	ObjectProperty m_mcTDMTitle; // 0x138
	ObjectProperty m_mcTDMTime; // 0x140
	ObjectProperty m_mcTDMSubtitle; // 0x148
	ObjectProperty m_mcTDMScoreA; // 0x150
	ObjectProperty m_mcTDMScoreAScore; // 0x158
	ObjectProperty m_mcTDMScoreAScoreTextAnim; // 0x160
	ObjectProperty m_mcTDMScoreAScoreTF; // 0x168
	ObjectProperty m_mcTDMScoreAScoreAnim; // 0x170
	ObjectProperty m_mcTDMScoreAProgress; // 0x178
	ObjectProperty m_mcTDMScoreAProgressAnim; // 0x180
	ObjectProperty m_mcTDMScoreAProgressAnimAnim; // 0x188
	ObjectProperty m_mcTDMScoreB; // 0x190
	ObjectProperty m_mcTDMScoreBScore; // 0x198
	ObjectProperty m_mcTDMScoreBScoreTextAnim; // 0x1a0
	ObjectProperty m_mcTDMScoreBScoreTF; // 0x1a8
	ObjectProperty m_mcTDMScoreBScoreAnim; // 0x1b0
	ObjectProperty m_mcTDMScoreBProgress; // 0x1b8
	ObjectProperty m_mcTDMScoreBProgressAnim; // 0x1c0
	ObjectProperty m_mcTDMScoreBProgressAnimAnim; // 0x1c8
	ObjectProperty m_mcOvertime; // 0x1d0
	ObjectProperty m_mcOvertimeTF; // 0x1d8
	ObjectProperty m_mcOvertimeBar; // 0x1e0
	ObjectProperty m_mcOvertimeFrame; // 0x1e8
	float m_fTDMScoreATextAnchorX; // 0x1f0
	float m_fTDMScoreBTextAnchorX; // 0x1f4
	int32_t m_nOvertimeStateAck; // 0x1f8
	float m_fOvertimeStart; // 0x1fc
	float m_fOvertimeDuration; // 0x200
	float m_fOvertimeFrequency; // 0x204
	int32_t m_nTaskForceAhead; // 0x208
	ObjectProperty m_MatchAlmostOverAkEvent; // 0x20c
};

struct UTgInvListener_ExplosiveImpalerArrow : UTgInventoryObject_Listen_ActiveWhileOffCooldown {
	FAimData m_AimData; // 0xc8
};

struct ATgDevice_LexInhand : ATgDevice {
	ObjectProperty m_CachedLexPawn; // 0xa04
	ObjectProperty m_CachedInPursuitDevice; // 0xa0c
	ObjectProperty m_CachedVengeanceDevice; // 0xa14
	char m_bShouldAutoFire : 1; // 0xa1c
	char r_bDeathHastensEquiped : 1; // 0xa1c
	float m_fQueueFireTime; // 0xa20
	float m_fQueueFireTimeThreshold; // 0xa24
};

struct UGamePadLightbarSubsystem : UObject {
	LightBarState CurrentLightBarState; // 0x60
	FLinearColor CurrentColor; // 0x64
	FLinearColor OriginalColor; // 0x74
	FLinearColor TargetColor; // 0x84
	float LerpTimeRemaining; // 0x94
	float TotalLerpTime; // 0x98
	FColor DefaultColor; // 0x9c
	TArray<FColorDefinition> ColorDefinitions; // 0xa0
	TArray<FLerpToInstruction> LerpToInstructions; // 0xb0
	TArray<FSetAndLerpInstruction> SetAndLerpInstructions; // 0xc0
	TArray<FPulseInstruction> PulseInstructions; // 0xd0
};

struct UAnimNodeSequence : UAnimNode {
	FName AnimSeqName; // 0xfc
	float Rate; // 0x104
	char bPlaying : 1; // 0x108
	char bLooping : 1; // 0x108
	char bCauseActorAnimEnd : 1; // 0x108
	char bCauseActorAnimPlay : 1; // 0x108
	char bCeaseRelevantOnAnimTreeReset : 1; // 0x108
	char bZeroRootRotation : 1; // 0x108
	char bZeroRootTranslation : 1; // 0x108
	char bDisableWarningWhenAnimNotFound : 1; // 0x108
	char bNoNotifies : 0; // 0x108
	char bForceRefposeWhenNotPlaying : 0; // 0x108
	char bIsIssuingNotifies : 0; // 0x108
	char bForceAlwaysSlave : 0; // 0x108
	char bSynchronize : 0; // 0x108
	char bReverseSync : 0; // 0x108
	char bShowTimeLineSlider : 0; // 0x108
	char bLoopCameraAnim : 0; // 0x108
	char bRandomizeCameraAnimLoopStartTime : 0; // 0x108
	char bCameraAnimRelativeToBase : 0; // 0x108
	char m_bIgnoreFootSkelControls : 0; // 0x108
	char m_bIgnoreBlendBySpeedScaling : 0; // 0x108
	char bDoNotResetIfPlaying : 0; // 0x108
	char bOnlyResetSynchGroupOnReplayAnim : 0; // 0x108
	char bEditorOnlyAddRefPoseToAdditiveAnimation : 0; // 0x108
	char bCheckForFinishAnimEarly : 0; // 0x108
	char bBlendingOut : 0; // 0x108
	float CurrentTime; // 0x10c
	float PreviousTime; // 0x110
	float EndTime; // 0x114
	ObjectProperty AnimSeq; // 0x118
	int32_t AnimLinkupIndex; // 0x120
	float NotifyWeightThreshold; // 0x124
	FName SynchGroupName; // 0x128
	float SynchPosOffset; // 0x130
	ObjectProperty CameraAnim; // 0x134
	ObjectProperty ActiveCameraAnimInstance; // 0x13c
	float CameraAnimScale; // 0x144
	float CameraAnimPlayRate; // 0x148
	float CameraAnimBlendInTime; // 0x14c
	float CameraAnimBlendOutTime; // 0x150
	ERootBoneAxis RootBoneOption[0x3]; // 0x154
	ERootRotationOption RootRotationOption[0x3]; // 0x157
	ObjectProperty DebugTrack; // 0x15c
	ObjectProperty DebugCarat; // 0x164
	TArray<ObjectProperty> DeferredNotifies; // 0x16c
	TArray<FDeferredAnimNotifyTickInformation> DeferredNotifyTicks; // 0x17c
	TArray<FDeferredAnimNotifyEndInformation> DeferredNotifyEnds; // 0x18c
	TArray<ObjectProperty> MetaDataSkelControlList; // 0x19c
};

struct ATgPawn_Lazarus : ATgPawn_Character {
	ObjectProperty m_pCrystalDeployable; // 0x3160
	ObjectProperty m_SelfResurrectionDevice; // 0x3168
	ObjectProperty m_AbsorptionFieldDevice; // 0x3170
	ObjectProperty m_ChargeBurstDevice; // 0x3178
	ObjectProperty m_ShatterfallDevice; // 0x3180
	ObjectProperty m_SeethingRageCard; // 0x3188
	ObjectProperty m_PlayingGodCard; // 0x3190
	ObjectProperty m_ItWaitsCard; // 0x3198
	ObjectProperty m_StoneStrengthCard; // 0x31a0
	ObjectProperty m_ItFollowsCard; // 0x31a8
	ObjectProperty m_CameraShake; // 0x31b0
	ObjectProperty m_CameraShakeOwner; // 0x31b8
	ObjectProperty m_InhandShake0; // 0x31c0
	ObjectProperty m_InhandShake1; // 0x31c8
	ObjectProperty m_UltimateShake; // 0x31d0
	ObjectProperty m_Killer; // 0x31d8
	char r_bShouldRez : 1; // 0x31e0
	char m_bUseShatterFallZoom : 1; // 0x31e0
	char m_bUsingDeathMesh : 1; // 0x31e0
	float r_fEnergy; // 0x31e4
	float r_fAccumulatedDamage; // 0x31e8
	ResurrectionState r_mCurrentState; // 0x31ec
	int32_t m_nChargeNumber; // 0x31f0
	float m_PreviousZHeight; // 0x31f4
	float m_GravityMultiplier; // 0x31f8
	float m_fItWaitsTimer; // 0x31fc
	float m_fItFollowsMovementSpeedMult; // 0x3200
	float m_fStrengthOfStoneDamageReduction; // 0x3204
	int32_t m_nDeathMeshAsmId; // 0x3208
	int32_t m_nQueuedFireDevice; // 0x320c
	TArray<FBloodStoneTarget> m_BloodStoneTargets; // 0x3210
};

struct UUIComponent_LexVengeance : UUIComponent_Display {
	ObjectProperty m_RouletteTarget; // 0x124
	ObjectProperty m_Target; // 0x12c
	ObjectProperty m_mcBounty; // 0x134
	ObjectProperty m_mcKillstreak; // 0x13c
	ObjectProperty m_mcKillstreakText; // 0x144
	ObjectProperty m_Lex; // 0x14c
	ObjectProperty m_pUIData; // 0x154
	ObjectProperty m_CachedTargetChampion; // 0x15c
	TArray<ObjectProperty> m_pInRangeEnemies; // 0x164
	float m_Timer; // 0x174
	float m_TimePerFrame; // 0x178
	float m_fOffsetX; // 0x17c
	char m_bRouletteSpinning : 1; // 0x180
	char m_bEnabled : 1; // 0x180
	int32_t m_nRouletteIndex; // 0x184
	int32_t m_nDisplayedKillstreak; // 0x188
	int32_t m_nDisplayedBounty; // 0x18c
	float m_fEmblemXPos; // 0x190
	ObjectProperty m_FlipbookSound; // 0x194
	ObjectProperty m_LockInSound; // 0x19c
	ObjectProperty m_SwooshSound; // 0x1a4
	ObjectProperty m_FrontlineComment; // 0x1ac
	ObjectProperty m_DamageComment; // 0x1b4
	ObjectProperty m_SupportComment; // 0x1bc
	ObjectProperty m_FlankComment; // 0x1c4
};

struct UUIComponent_CorvusMark : UUIComponent_Display {
	ObjectProperty m_mcFrame; // 0x124
	ObjectProperty m_mcIcon; // 0x12c
	ObjectProperty m_mcSecondIcon; // 0x134
	ObjectProperty m_Corvus; // 0x13c
	ObjectProperty m_pUIData; // 0x144
	ObjectProperty m_CachedMarkedChampions[0x2]; // 0x14c
	char m_bEnabled : 1; // 0x15c
	char m_bCleared : 1; // 0x15c
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x74
	float LoopEnd; // 0x78
	float DurationAfterLoop; // 0x7c
	int32_t LoopCount; // 0x80
	char bLoopIndefinitely : 1; // 0x84
	char bLoop : 1; // 0x84
	ComponentProperty VolumeInterpCurve; // 0x88
	ComponentProperty PitchInterpCurve; // 0x90
};

struct UFont : UObject {
	TArray<FFontCharacter> Characters; // 0x60
	TArray<ObjectProperty> Textures; // 0x70
	TMap<None, None> CharRemap; // 0x80
	int32_t IsRemapped; // 0xc8
	float EmScale; // 0xcc
	float Ascent; // 0xd0
	float Descent; // 0xd4
	float Leading; // 0xd8
	int32_t Kerning; // 0xdc
	FFontImportOptionsData ImportOptions; // 0xe0
	int32_t NumCharacters; // 0x188
	TArray<int32_t> MaxCharHeight; // 0x18c
	float ScalingFactor; // 0x19c
};

struct USeqEvent_Used : USequenceEvent {
	char bAimToInteract : 1; // 0x128
	float InteractDistance; // 0x12c
	FString InteractText; // 0x130
	ObjectProperty InteractIcon; // 0x140
	TArray<AActor*> ClassProximityTypes; // 0x148
	TArray<AActor*> IgnoredClassProximityTypes; // 0x158
};

struct AAmbientSound : AKeypoint {
	char bAutoPlay : 1; // 0x288
	char bIsPlaying : 1; // 0x288
	ComponentProperty AudioComponent; // 0x28c
};

struct UTgSeqAct_ForceClientTutorialAction : USequenceAction {
	eForcedClientTutorialAction ForcedAction; // 0x108
	eTutorialForceableElements GameUIElement; // 0x109
};

struct UUIData_RealMoneyItem : UUIData_DLCItem {
	FString m_sProductName; // 0x74
	FString m_sProductSKU; // 0x84
	FString m_sConsoleDescription; // 0x94
	FString m_sIncludeTaxMessage; // 0xa4
	FString m_sProductImage; // 0xb4
	TArray<FString> m_sDisplayListPrice; // 0xc4
	TArray<FString> m_sDisplayPrice; // 0xd4
	TArray<FString> m_sCurrencyCode; // 0xe4
	TArray<FString> m_sSignedOffer; // 0xf4
	TArray<float> m_fListPrice; // 0x104
	TArray<float> m_fPrice; // 0x114
	char m_bPurchasable : 1; // 0x124
};

struct UUIData_Quest : UUIData {
	FQWord m_qwQuestId; // 0x64
	Fdword m_dwActivityId; // 0x6c
	Fdword m_dwPrevActivityId; // 0x70
	Fdword m_dwGroupingNumber; // 0x74
	Fdword m_eStatus; // 0x78
	FQWord m_dtReceivedDatetime; // 0x7c
	char m_bIsDirty : 1; // 0x84
	char m_bHasSeen : 1; // 0x84
	char m_bIsNew : 1; // 0x84
	char m_bCanAbandon : 1; // 0x84
	char m_bCompletionAck : 1; // 0x84
	char m_bGoalsInitialized : 1; // 0x84
	char m_bShowLastComplete : 1; // 0x84
	QuestType m_eQuestType; // 0x88
	TArray<ObjectProperty> m_Goals; // 0x8c
};

struct ATgWeaponMeshActor_GroverInhandAxe : ATgWeaponMeshActor {
	ObjectProperty StanceNode; // 0x450
};

struct ATgPawn_BombKing : ATgPawn_Character {
	float m_fBounceDampingVertMin; // 0x3160
	float m_fBounceDampingVertMax; // 0x3164
	float m_fBounceDampingHorizMin; // 0x3168
	float m_fBounceDampingHorizMax; // 0x316c
	char c_bRenderKingBombMesh : 1; // 0x3170
	char m_bForced3PDuringKingBomb : 1; // 0x3170
	int32_t c_nKingBombMeshID; // 0x3174
	FVector m_fKingBombCameraOffset; // 0x3178
	EWeaponMeshState r_weaponMeshState; // 0x3184
	int32_t m_nInhandID; // 0x3188
	int32_t m_nGrumpyBombID; // 0x318c
	int32_t m_nPoppyBombID; // 0x3190
	float r_fJoltKnockback; // 0x3194
	ATgDevice* m_InhandClass; // 0x3198
	ATgDevice* m_GrumpyBombClass; // 0x31a0
	ATgDevice* m_PoppyBombClass; // 0x31a8
};

struct UTgSeqAct_SetUltimateEnergy : USequenceAction {
	float fChargePercent; // 0x108
};

struct ATgDevice_Wormhole : ATgDevice {
	FVector m_vPreviousLocation; // 0xa04
	ObjectProperty m_CachedBlink; // 0xa10
	ObjectProperty m_WormholeAimForwarderMod; // 0xa18
	char m_bWormholeEnabled : 1; // 0xa20
	char m_bWormholeEndedDuringBlink : 1; // 0xa20
};

struct UTgAIBehaviorAction_SelectLaneMoveTargetAsCombatTarget : UTgAIBehaviorAction {
	char bSkipPawnNotify : 1; // 0x94
};

struct UUIComponent_PurchaseOption : UUIComponent_Display {
	ObjectProperty m_mcOption; // 0x124
	ObjectProperty m_mcSkinBoost; // 0x12c
	ObjectProperty m_pButton; // 0x134
	ObjectProperty m_mcControllerCost; // 0x13c
	ObjectProperty m_mcControllerCurrencyIcon; // 0x144
	ObjectProperty m_mcControllerButton; // 0x14c
	ObjectProperty m_mcPreviousCost; // 0x154
	ObjectProperty m_mcPreviousCostStrikethrough; // 0x15c
	ObjectProperty m_mcPreviousCostCurrencyIcon; // 0x164
	int32_t m_nPurchaseQuantity; // 0x16c
};

struct UTgAnimNotify_AudioGroup : UAnimNotify {
	ObjectProperty c_PreviewSound; // 0x68
	FName c_SoundCueName; // 0x70
	TG_MESH_SOURCE c_eMeshSource; // 0x78
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x68
	char bSpawnTimeOnly : 1; // 0x8c
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x90
};

struct UTgAkAudioManagement : UObject {
	FAkMeterCallbackState m_MeterCallbackSlots[0x10]; // 0x60
	TArray<Fdword> dwAllBusses; // 0x160
	char m_bInitialized : 1; // 0x170
};

struct ATgTeleportPlayerVolume : AVolume {
	TgTeleportVolumeType TeleportLocation; // 0x2bc
	int32_t nMessageId; // 0x2c0
	char bTeleportBots : 1; // 0x2c4
	char bTeleportPlayers : 1; // 0x2c4
};

struct ATgDevice_Drag : ATgDevice {
	ObjectProperty m_PullTarget; // 0xa04
	FRotator m_TargetInitialRotation; // 0xa0c
	float m_fPullStartTime; // 0xa18
	ObjectProperty m_StunnedTarget; // 0xa1c
	ObjectProperty r_ClientPullTarget; // 0xa24
	float m_fTruePostfireTime; // 0xa2c
	float m_fPullVelocityBreakFactor; // 0xa30
	float m_fPullVerticalEndOffset; // 0xa34
	float m_fMaxPullTime; // 0xa38
	float m_fPrePullTime; // 0xa3c
	float m_fPullEndOffset; // 0xa40
	float m_fPullSpeed; // 0xa44
	float m_fPullEndStunDuration; // 0xa48
	char m_bCanStillPull : 1; // 0xa4c
	char m_bNeedsDelayedServerEndPull : 1; // 0xa4c
	char m_bNeedsDelayedClientEndPull : 1; // 0xa4c
	char m_bHasPulledOnce : 1; // 0xa4c
	char m_bPullMissed : 1; // 0xa4c
	FVector m_vEndLocation; // 0xa50
	ObjectProperty m_CachedPawnOwner; // 0xa5c
};

struct UImageReflectionShadowPlaneComponent : UPrimitiveComponent {
	char bEnabled : 1; // 0x24c
	FPlane ReflectionPlane; // 0x250
};

struct UUIComponent_ItemObtainabilityBanner : UUIComponent_Display {
	SimplifiedItemObtainabilityValue m_eObtainability; // 0x124
	char m_bForceHide : 1; // 0x128
	ObjectProperty m_mcTF; // 0x12c
};

struct UUIComponent_OptionEntryPaged : UUIComponent_OptionEntryBase {
	TArray<FPagedEntry> m_Entries; // 0x150
	int32_t m_nSelectedIndex; // 0x160
	ObjectProperty m_pLeftArrow; // 0x164
	ObjectProperty m_pRightArrow; // 0x16c
	ObjectProperty m_mcValueTF; // 0x174
};

struct UTgControlModule_Koga : UTgControlModule_ThirdPerson {
	ObjectProperty m_CachedKogaPawn; // 0xcc
};

struct USeqAct_SetVector : USeqAct_SetSequenceVariable {
	FVector DefaultValue; // 0x108
};

struct UMaterialExpressionStaticBool : UMaterialExpression {
	char Value : 1; // 0xb0
};

struct UTgAIBehaviorCondition_HasConsumable : UTgAIBehaviorCondition {
	EConsumableType ConsumableType; // 0x98
};

struct UUIComponent_StoreFilterToggle : UUIComponent_Interactable {
	char m_bActive : 1; // 0x140
	ObjectProperty m_mcTitle; // 0x144
	ObjectProperty m_mcToggle; // 0x14c
};

struct UParticleModuleMeshRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionVector StartRotationRate; // 0x68
};

struct USkelControlTrail : USkelControlBase {
	int32_t ChainLength; // 0xd0
	EAxis ChainBoneAxis; // 0xd4
	char bInvertChainBoneAxis : 1; // 0xd8
	char bLimitStretch : 1; // 0xd8
	char bActorSpaceFakeVel : 1; // 0xd8
	char bHadValidStrength : 1; // 0xd8
	float TrailRelaxation; // 0xdc
	float StretchLimit; // 0xe0
	FVector FakeVelocity; // 0xe4
	float ThisTimstep; // 0xf0
	TArray<FVector> TrailBoneLocations; // 0xf4
	FMatrix OldLocalToWorld; // 0x110
};

struct UTgAnimBlendByBuffMonsterIntro : UTgAnimNodeBlendList {
	char m_bScalePlayRateOfSpawnAndIntro : 1; // 0x168
	char m_bEndIntroStateEarly : 1; // 0x168
	char m_bIntroHasBeenSetup : 1; // 0x168
	float m_fIntroTimeHittableAt; // 0x16c
	float m_fTimeToStartIntroAnim; // 0x170
	ObjectProperty m_CachedPawn; // 0x174
	float m_fSpawnIntroScaleRate; // 0x17c
};

struct ATgDevice_FuriaRMB : ATgDevice {
	ObjectProperty m_Furia; // 0xa04
	FImpactInfo m_CachedImpact; // 0xa0c
};

struct UUIComponent_MatchLobbyChampion : UUIComponent_Display {
	ObjectProperty m_pButton; // 0x124
	ObjectProperty m_mcIcon; // 0x12c
	ObjectProperty m_mcFrame; // 0x134
	ObjectProperty m_mcRented; // 0x13c
	ObjectProperty m_mcRotation; // 0x144
	ObjectProperty m_mcRecommended; // 0x14c
	ObjectProperty m_mcClassIcon; // 0x154
	UICMLCState m_eCurrentDisplayState; // 0x15c
	int32_t m_nRowNum; // 0x160
	int32_t m_nChampionOwnershipCBHandle; // 0x164
};

struct ATgDevice_Charge : ATgDevice {
	EChargeState m_eChargeState; // 0xa04
	ChargeStopOnHitType m_bStopOnHitType; // 0xa05
	ChargeFiringType m_ChargeTimingType; // 0xa06
	char m_bUsePhysFlying : 1; // 0xa08
	char m_bUseReticleTargetAim : 1; // 0xa08
	char m_bUseDamageRadiusForHitProxy : 1; // 0xa08
	char m_bIgnoreHumanoids : 1; // 0xa08
	char m_bHitOnce : 1; // 0xa08
	char m_bApplyHitOnTouch : 1; // 0xa08
	char m_bApplyHitSpecialOnTouch : 1; // 0xa08
	char m_bCharging : 1; // 0xa08
	char m_bInterruptDeviceIfChargeEnds : 0; // 0xa08
	char m_bUseDirectHitSpecial : 0; // 0xa08
	char m_bChargeBackward : 0; // 0xa08
	char m_bCanLeftClickCancel : 0; // 0xa08
	char m_bIgnoreMovementCorrection : 0; // 0xa08
	char m_bAimTowardsAcceleration : 0; // 0xa08
	char m_bAimUpIfAccelZero : 0; // 0xa08
	char m_bPostChargeUseWalkSpeed : 0; // 0xa08
	char m_bChargeRespectsMoveSpeedMultipliers : 0; // 0xa08
	char s_bHasQueuedChargeDir : 0; // 0xa08
	char s_bForcingStartCharge : 0; // 0xa08
	char m_bEndChargeImmediately : 0; // 0xa08
	char m_bHasQueuedCharge : 0; // 0xa08
	ObjectProperty m_HitProxy; // 0xa0c
	FVector m_vHitProxyRelativeLocation; // 0xa14
	FVector m_vHitProxySizeOffset; // 0xa20
	float s_fServerValidationSizeMultiplier; // 0xa2c
	float m_fPostChargeVelocityMult; // 0xa30
	float m_fPostChargeVelocityCap; // 0xa34
	float m_fWaitForClientStartChargeAimTime; // 0xa38
	FRotator s_rQueuedChargeDir; // 0xa3c
	float m_fChargeQueueTime; // 0xa48
	FRotator m_rLastChargeDirection; // 0xa4c
	TArray<ObjectProperty> s_AppliedList; // 0xa58
	TArray<FTimestampedActor> s_HitActors; // 0xa68
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	char bIsLayerThumbnail : 1; // 0x344
	int32_t DataWeightmapIndex; // 0x348
	int32_t DataWeightmapSize; // 0x34c
};

struct UTgAnimNodeBlendByVerticalAim : UAnimNodeBlendBase {
	float m_Aim; // 0x114
	FVector2D m_Range; // 0x118
	float m_AngleOffset; // 0x120
	float m_PreviousAim; // 0x124
	char bInitialized : 1; // 0x128
	char m_bLoopChildrenOnRelevant : 1; // 0x128
	char m_bPlayChildrenOnRelevant : 1; // 0x128
	FName m_AnimName_Up; // 0x12c
	FName m_AnimName_Center; // 0x134
	FName m_AnimName_Down; // 0x13c
	ObjectProperty m_SeqNode1; // 0x144
	ObjectProperty m_SeqNode2; // 0x14c
};

struct ATgDevice_FuriaInhand : ATgDevice {
	ObjectProperty m_Furia; // 0xa04
	float s_fCurrentAttackSpeedTier; // 0xa0c
	float s_fHolyWrathDecayStartTime; // 0xa10
};

struct UTgAnimNodeSequenceByBoneRotation : UAnimNodeSequence {
	FName BoneName; // 0x1ac
	EAxis BoneAxis; // 0x1b4
	TArray<FAnimByRotation> AnimList; // 0x1b8
};

struct UUIData_LeagueEOM : UUIData {
	ObjectProperty m_pLeague; // 0x64
	ObjectProperty m_pTier; // 0x6c
	int32_t m_nGameId; // 0x74
	int32_t m_nPointChange; // 0x78
	int32_t m_nCurrentPoints; // 0x7c
	int32_t m_nWins; // 0x80
	int32_t m_nLosses; // 0x84
	int32_t m_nMatchesPlayed; // 0x88
	ObjectProperty m_TierChange; // 0x8c
};

struct UUIComponent_MatchLobbyMap : UUIComponent_Display {
	ObjectProperty m_mcMapName; // 0x124
	ObjectProperty m_mcModeName; // 0x12c
	ObjectProperty m_mcMapIcon; // 0x134
};

struct UUIComponent_SummerEventOverview : UUIComponent_Display {
	ObjectProperty m_grOverview; // 0x124
};

struct AHavokCustomTraversalAnnotation : AActor {
	ObjectProperty m_Target; // 0x280
	EHavokTraversalType TraversalType; // 0x288
	float EdgeCost; // 0x28c
	FRotator SourceEdgeRotation; // 0x290
	FVector SourceEdgeTranslation; // 0x29c
	float fEdgeWidth; // 0x2a8
	char bForceParallelEdges : 1; // 0x2ac
	ObjectProperty m_Source; // 0x2b0
};

struct UTgAnimBlendByFall : UTgAnimNodeBlendList {
	EFallSource m_FallSource; // 0x168
	EBlendFallTypes FallState; // 0x169
	EPhysics m_PreviousTickPhysics; // 0x16a
	float LastFallingVelocity; // 0x16c
	ObjectProperty pOwner; // 0x170
	float m_fPrelandDistance; // 0x178
	char m_bDebugMeasureJumpUp : 1; // 0x17c
	char m_bDebugMeasureJumpDownToLand : 1; // 0x17c
	char m_bMeasuring : 1; // 0x17c
	char m_bUsesPreDown : 1; // 0x17c
	char m_bJumpOnly : 1; // 0x17c
	char m_bForceDownOnRelevantWhileFalling : 1; // 0x17c
	char m_bPlayDownStateWhileFlying : 1; // 0x17c
	FVector m_StartMeasureJump; // 0x180
	float m_fMeasureTime; // 0x18c
	float m_fLandingMovementPlayRate; // 0x190
	FName m_nmNameLandingSynchGroup; // 0x194
};

struct UCloudSaveSystem : UObject {
	TScriptInterface<Class> KeyValueStore; // 0x60
	TScriptInterface<Class> DataBlobStore; // 0x70
	TArray<FGetSaveDataCallbackStruct> OnGetSaveDataCallbacks; // 0x80
	TArray<FSetSaveDataCallbackStruct> OnSetSaveDataCallbacks; // 0x90
	DelegateProperty DeleteSaveDataCallback; // 0xa0
	int32_t ActiveSlotForDelete; // 0xb0
	TArray<FSaveSlotOperation> ActiveSaveSlotOperations; // 0xb4
	DelegateProperty __OnGetSaveDataCallback__Delegate; // 0xc4
	DelegateProperty __SaveSystemCallback__Delegate; // 0xd4
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<FVectorMaterialParamMICData> MICInfos; // 0x60
	ObjectProperty InstancedTrack; // 0x70
};

struct USeqAct_AttachToEvent : USequenceAction {
	char bPreferController : 1; // 0x108
};

struct UTgSubtitledMessages : UObject {
	FQueuedSubtitle CurrentSubtitle; // 0x60
	TArray<FQueuedSubtitle> QueuedSubtitles; // 0x84
	ObjectProperty OwnerPC; // 0x94
	ComponentProperty PlayingSubtitleAC; // 0x9c
	char bFinishedSubtitle : 1; // 0xa4
	float SubtitleFailsafeTime; // 0xa8
};

struct UTgAIBehaviorCondition : UTgAIBehaviorNode {
	EBehaviorComparison ComparisonOperator; // 0x94
};

struct UTexture2DComposite : UTexture {
	TArray<FSourceTexture2DRegion> SourceRegions; // 0x100
	int32_t MaxTextureSize; // 0x110
	int32_t DestSizeX; // 0x114
	int32_t DestSizeY; // 0x118
};

struct UTgAnimBlendByMountSkin : UTgAnimNodeBlendList {
	TArray<FMountSkinChildInfo> m_SkinMap; // 0x168
};

struct ATgDevice_ToggleADS : ATgDevice_ToggleWithLockout {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa10
	char m_bDelayMoveSpeedPenalty : 1; // 0xa18
	char m_bIsZoomed : 1; // 0xa18
};

struct ATgDevice_AstroQ : ATgDevice {
	char m_bApplyCooldown : 1; // 0xa04
};

struct ATgDevice_OverGrowth : ATgDevice {
	ObjectProperty m_VineDevice; // 0xa04
};

struct ATgPawn_Koga : ATgPawn_Character {
	char m_bUseSecondWeapon : 1; // 0x3160
	char c_bUseSecondDeathAnim : 1; // 0x3160
	char c_bWallClimbExpected : 1; // 0x3160
	int32_t m_nAltInhandSlot; // 0x3164
	int32_t m_nAltAltfireSlot; // 0x3168
	float m_fStamina; // 0x316c
	float m_fMaxStamina; // 0x3170
	float m_fStaminaRegenLockout; // 0x3174
	float m_fSwapLockoutTime; // 0x3178
	float m_fStaminaRegenLockoutTime; // 0x317c
	float r_fRemoteStamina; // 0x3180
	float c_fOldRemoteStamina; // 0x3184
	ObjectProperty m_CachedNinjaF; // 0x3188
	ObjectProperty m_CachedNinjaSwap; // 0x3190
	ObjectProperty m_CachedWallClimb; // 0x3198
	ObjectProperty m_CachedDragonFangLeg; // 0x31a0
	FString m_sSkillIconOverride; // 0x31a8
};

struct USettings : UObject {
	TArray<FLocalizedStringSetting> LocalizedSettings; // 0x60
	TArray<FSettingsProperty> Properties; // 0x70
	TArray<FLocalizedStringSettingMetaData> LocalizedSettingsMappings; // 0x80
	TArray<FSettingsPropertyPropertyMetaData> PropertyMappings; // 0x90
};

struct UTgDeviceForm_LazarusInhand : UTgDeviceForm {
	TArray<FHitPawn> m_pHitPawnsList; // 0x28c
};

struct ATgDevice_AtlasRMBInhand : ATgDevice {
	ObjectProperty m_CachedInhand; // 0xa04
};

struct UTgInvListener_CooledMags : UTgInvListener {
	ObjectProperty m_CachedOwlPawn; // 0xc4
	ObjectProperty m_CachedSidearm; // 0xcc
	ObjectProperty m_CachedInhand; // 0xd4
	float m_fAmmoFillTime; // 0xdc
};

struct AGameCrowdInteractionPoint : AActor {
	char bIsEnabled : 1; // 0x280
	ComponentProperty CylinderComponent; // 0x284
};

struct UTgDeviceForm_AzaanUlt : UTgDeviceForm {
	TArray<ObjectProperty> m_AzaanUltNodes3p; // 0x28c
	TArray<ObjectProperty> m_AzaanUltNodes1p; // 0x29c
};

struct UTgAIBehaviorAction_MoveToLanePusher : UTgAIBehaviorAction_MoveToTarget {
	TG_EQUIP_POINT DeviceSlot; // 0x9c
};

struct UTgDeviceForm_Barrage : UTgDeviceForm {
	ObjectProperty m_CachedActiveOverlayController; // 0x28c
};

struct UTgDataHandler : UGFxObject {
	ObjectProperty m_MP; // 0x104
	TArray<ObjectProperty> m_DataChunkList; // 0x10c
};

struct UUIDataObject : UUIData {
	FPointer VfTable_ITgCallbackInterface; // 0x64
	ObjectProperty m_CallbackContainer; // 0x6c
};

struct ATgDevice_RaumUlt : ATgDevice_Charge {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa78
	ObjectProperty m_CachedRaum; // 0xa80
	char m_bLockoutDuringPostFire : 1; // 0xa88
	float m_fChargeDeviationMeanLifetime; // 0xa8c
	float m_fAccumulatedChargeDeviation; // 0xa90
	float m_fMaxTurnDegPerSec; // 0xa94
	float m_fMaxDirectionShiftDegrees; // 0xa98
	float m_fPerActorHitPeriod; // 0xa9c
};

struct UTgPawnMod_FxAudio_EDMStrix : UTgPawnMod_FxAudio {
	float m_fGlowMultBass; // 0xac
};

struct UUIComponent_AccountLinkIcon : UUIComponent_Display {
	ObjectProperty m_mcIconFacebook; // 0x124
	ObjectProperty m_mcIconTwitch; // 0x12c
};

struct ATgDevice_GrumpyBomb : ATgDevice {
	float m_fPostTargetingLockInDuration; // 0xa04
};

struct ATgProj_ExtraColliders : ATgProj_SpeedOverRange {
	ObjectProperty m_SecondaryCollisionProxies[0x2]; // 0x52c
	ComponentProperty m_SecondaryDebugProximityDistancePSC[0x2]; // 0x53c
	TArray<FTrackedCollision> m_TrackedCollisions; // 0x54c
};

struct UFogVolumeConstantDensityComponent : UFogVolumeDensityComponent {
	float Density; // 0xe0
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0xb0
	FExpressionInput Height; // 0xe4
	FExpressionInput HeightRatioInput; // 0x118
	float HeightRatio; // 0x14c
	float ReferencePlane; // 0x150
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x60
	char bEnabled : 1; // 0x64
	char ConvertedModules : 1; // 0x64
	ObjectProperty RequiredModule; // 0x68
	TArray<ObjectProperty> Modules; // 0x70
	ObjectProperty TypeDataModule; // 0x80
	ObjectProperty SpawnModule; // 0x88
	ObjectProperty EventGenerator; // 0x90
	TArray<ObjectProperty> SpawningModules; // 0x98
	TArray<ObjectProperty> SpawnModules; // 0xa8
	TArray<ObjectProperty> UpdateModules; // 0xb8
	TArray<ObjectProperty> OrbitModules; // 0xc8
	TArray<ObjectProperty> EventReceiverModules; // 0xd8
	int32_t PeakActiveParticles; // 0xe8
};

struct UUIData_PreviewItems : UUIData {
	TArray<int32_t> m_PreviewItemIds; // 0x64
};

struct UInputGroup : UObject {
	FPointer VfTable_ITgCallbackInterface; // 0x60
	int32_t m_nMinX; // 0x68
	int32_t m_nMinY; // 0x6c
	int32_t m_nSizeX; // 0x70
	int32_t m_nSizeY; // 0x74
	int32_t m_nFocusX; // 0x78
	int32_t m_nFocusY; // 0x7c
	int32_t m_nPrevFocusX; // 0x80
	int32_t m_nPrevFocusY; // 0x84
	char m_bLoopX : 1; // 0x88
	char m_bLoopY : 1; // 0x88
	char m_bCursorUpdateX : 1; // 0x88
	char m_bCursorUpdateY : 1; // 0x88
	char m_bCursorUpdateWidth : 1; // 0x88
	char m_bCursorUpdateHeight : 1; // 0x88
	char m_bAllowSelect : 1; // 0x88
	char m_bAllowNavigation : 1; // 0x88
	char m_bCallbacksRegistered : 0; // 0x88
	int32_t m_nDefaultXFocus; // 0x8c
	int32_t m_nDefaultYFocus; // 0x90
	ObjectProperty m_NavUp; // 0x94
	ObjectProperty m_NavDown; // 0x9c
	ObjectProperty m_NavLeft; // 0xa4
	ObjectProperty m_NavRight; // 0xac
	ObjectProperty m_Select; // 0xb4
	ObjectProperty m_InputContext; // 0xbc
	TArray<FUIGroupObject> m_Objects; // 0xc4
	ObjectProperty m_mcCursor; // 0xd4
	ObjectProperty m_CallbackContainer; // 0xdc
};

struct ATgDeploy_DarkConvergence : ATgDeploy_Bomb {
	TArray<FPullData> m_PullDataList; // 0x484
	ObjectProperty r_PulledTargets[0x5]; // 0x494
	FVector r_PulledTargetLocations[0x5]; // 0x4bc
	TArray<ObjectProperty> c_Beams; // 0x4f8
	float c_fHideBeamsTimer; // 0x508
	float s_fVerticalTargetLocationOffset; // 0x50c
};

struct UUIComponent_Accolade : UUIComponent_Display {
	ObjectProperty m_mcIcon; // 0x124
	ObjectProperty m_mcTitle; // 0x12c
	ObjectProperty m_mcValue; // 0x134
};

struct UTgAnimNodeFidget : UAnimNodeBlendList {
	float m_SelectedIdleTimeBeforeFidgeting; // 0x144
	float m_CurrentIdleTime; // 0x148
	float BlendToFidgetDuration; // 0x14c
	float BlendFromFidgetDuration; // 0x150
	EFidgetType FidgetType; // 0x154
	float MinimumIdleTimeBeforeFidgeting; // 0x158
	float MaximumIdleTimeBeforeFidgeting; // 0x15c
	char AllowIdleAnimToComplete : 1; // 0x160
	float ChanceToFidgetWhenIdleCompletes; // 0x164
};

struct UAnimNodeAimOffset : UAnimNodeBlendBase {
	FVector2D Aim; // 0x114
	FVector2D AngleOffset; // 0x11c
	char bForceAimDir : 1; // 0x124
	char bBakeFromAnimations : 1; // 0x124
	char bPassThroughWhenNotRendered : 1; // 0x124
	char bSynchronizeNodesInEditor : 1; // 0x124
	int32_t PassThroughAtOrAboveLOD; // 0x128
	EAnimAimDir ForcedAimDir; // 0x12c
	TArray<char> RequiredBones; // 0x130
	TArray<char> AimCpntIndexLUT; // 0x140
	ObjectProperty TemplateNode; // 0x150
	TArray<FAimOffsetProfile> Profiles; // 0x158
	int32_t CurrentProfileIndex; // 0x168
};

struct UTgAnimBlendBy1P3P : UTgAnimNodeBlendList {
	ObjectProperty m_TgPawn; // 0x168
};

struct UAnimNodeSequenceBlendBase : UAnimNodeSequence {
	TArray<FAnimBlendInfo> Anims; // 0x1ac
};

struct UTgAIBehaviorCondition_NumGodsInCapturePointRadius : UTgAIBehaviorCondition_DistanceBase {
	char bGodsMustBeEnemy : 1; // 0x9c
	int32_t GodThreshold; // 0xa0
};

struct UUIComponent_MatchLobbyChampionList : UUIComponent_Display {
	ObjectProperty m_mcPick; // 0x124
	ObjectProperty m_mcPickAnimA; // 0x12c
	ObjectProperty m_mcPickAnimB; // 0x134
	ObjectProperty m_mcDimmer; // 0x13c
	ObjectProperty m_ChampionList; // 0x144
	ObjectProperty m_RoleTabs; // 0x14c
	ObjectProperty m_TabLeft; // 0x154
	ObjectProperty m_TabRight; // 0x15c
	char m_bChampionsShown : 1; // 0x164
	char m_bChampionsEnabled : 1; // 0x164
};

struct UUIDataStore_InputAlias : UUIDataStore_StringBase {
	TArray<FUIDataStoreInputAlias> InputAliases; // 0x98
	TMap<None, None> InputAliasLookupMap; // 0xa8
};

struct UUIComponent_BoosterItemBenefits : UUIComponent_Display {
	int32_t m_nRowsSet; // 0x124
	ObjectProperty m_mcBenefitsTF[0xb]; // 0x128
};

struct UPhysicsAsset : UObject {
	TArray<ObjectProperty> BodySetup; // 0x60
	FMap_Mirror BodySetupIndexMap; // 0x70
	TArray<int32_t> BoundsBodies; // 0xb8
	TArray<ObjectProperty> ConstraintSetup; // 0xc8
	ObjectProperty DefaultInstance; // 0xd8
};

struct UKismetBookMark : UBookMark2D {
	FString BookMarkSequencePathName; // 0x6c
};

struct UParticleModuleTypeDataPhysX : UParticleModuleTypeDataBase {
	ObjectProperty PhysXParSys; // 0x68
	FPhysXEmitterVerticalLodProperties VerticalLod; // 0x70
};

struct UMcpServerTimeBase : UMcpServiceBase {
	FString McpServerTimeClassName; // 0x78
	DelegateProperty __OnQueryServerTimeComplete__Delegate; // 0x88
};

struct UUIDataLeaguePlayer : UUIData {
	ObjectProperty pPlayer; // 0x64
	ObjectProperty pLeague; // 0x6c
	ObjectProperty pTier; // 0x74
	ObjectProperty pHighestTier; // 0x7c
	int32_t nPointsEarned; // 0x84
	int32_t nPointsTrend; // 0x88
	Fdword dwRank; // 0x8c
	Fdword dwRankPrev; // 0x90
	Fdword dwWins; // 0x94
	Fdword dwLosses; // 0x98
	Fdword dwDodges; // 0x9c
	Fdword dwMatchesPlayedInTier; // 0xa0
	Fdword dwRegion; // 0xa4
	Fdword dwRecommendedTierId; // 0xa8
	Fdword dwTitleId; // 0xac
	FDateTimeWrapper dtLastPlayed; // 0xb0
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	char bPersistFade : 1; // 0xb8
};

struct UBrushComponent : UPrimitiveComponent {
	ObjectProperty Brush; // 0x24c
	FKAggregateGeom BrushAggGeom; // 0x254
	FPointer BrushPhysDesc; // 0x2a0
	FKCachedConvexData_Mirror CachedPhysBrushData; // 0x2a8
	int32_t CachedPhysBrushDataVersion; // 0x2b8
	char bBlockComplexCollisionTrace : 1; // 0x2bc
};

struct UTgRewardCenterManager : UObject {
	ObjectProperty m_pMovie; // 0x60
	TArray<FGoalRewardItem> m_pReturningBonus; // 0x68
};

struct USplineComponent : UPrimitiveComponent {
	FInterpCurveVector SplineInfo; // 0x24c
	float SplineCurviness; // 0x260
	FColor SplineColor; // 0x264
	float SplineDrawRes; // 0x268
	float SplineArrowSize; // 0x26c
	char bSplineDisabled : 1; // 0x270
	FInterpCurveFloat SplineReparamTable; // 0x274
};

struct UTgInventoryObject_Listen_HealthPCT_In_Range : UTgInvListener {
	char m_bApplied : 1; // 0xc4
};

struct UActorFactoryEmitter : UActorFactory {
	ObjectProperty ParticleSystem; // 0x9c
};

struct UUIComponent_HeaderTabsRotating : UUIComponent_List {
	int32_t m_nMiddleIndex; // 0x260
	int32_t m_nSelectedIndex; // 0x264
	float m_fButtonSpace; // 0x268
	float m_fBumperSpaceLeft; // 0x26c
	float m_fBumperSpaceRight; // 0x270
	float m_fButtonStartX; // 0x274
	float m_fButtonEndX; // 0x278
	ObjectProperty m_mcTitleTF; // 0x27c
	ObjectProperty m_mcLogo; // 0x284
	ObjectProperty m_mcLogoFaded; // 0x28c
	ObjectProperty m_mcBackground; // 0x294
	ObjectProperty m_mcBackgroundMask; // 0x29c
	ObjectProperty m_mcButtonMask; // 0x2a4
	ObjectProperty m_mcSearching; // 0x2ac
	ObjectProperty m_mcSearchingMask; // 0x2b4
	ObjectProperty m_mcHeaderLeft; // 0x2bc
	ObjectProperty m_mcHeaderRight; // 0x2c4
	ObjectProperty m_pPips; // 0x2cc
	ObjectProperty m_pBumpers[0x2]; // 0x2d4
	ObjectProperty m_NavLeft; // 0x2e4
	ObjectProperty m_NavRight; // 0x2ec
};

struct UUIDataAcquisitionQueue : UUIData {
	TArray<ObjectProperty> m_Acquisitions; // 0x64
};

struct UUIComponent_CommendationReward : UUIComponent_Display {
	ObjectProperty m_pItemPreviewStack; // 0x124
	ObjectProperty m_mcLevelRequirement; // 0x12c
};

struct UUIComponent_StringWithCount : UUIComponent_Display {
	ObjectProperty m_mcCountTF; // 0x124
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x8c
};

struct USeqAct_SetString : USeqAct_SetSequenceVariable {
	FString Target; // 0x108
	FString Value; // 0x118
};

struct UPartyBeacon : UObject {
	FPointer VfTable_FTickableObject; // 0x60
	int32_t PartyBeaconPort; // 0x68
	FPointer Socket; // 0x6c
	char bIsInTick : 1; // 0x74
	char bWantsDeferredDestroy : 1; // 0x74
	char bShouldTick : 1; // 0x74
	float HeartbeatTimeout; // 0x78
	float ElapsedHeartbeatTime; // 0x7c
	FName BeaconName; // 0x80
	DelegateProperty __OnDestroyComplete__Delegate; // 0x88
};

struct UUIHudPlayer : UUIHudPlayer_Base {
	ObjectProperty m_mcSkipDeathCamPrompt; // 0x32c
};

struct AReverbVolume : AVolume {
	float Priority; // 0x2bc
	char bEnabled : 1; // 0x2c0
	char m_bUseAudioAltitude : 1; // 0x2c0
	FReverbSettings Settings; // 0x2c4
	FInteriorSettings AmbientZoneSettings; // 0x2d4
	ObjectProperty NextLowerPriorityVolume; // 0x304
	FName AuxBusName; // 0x30c
	float SendLevel; // 0x314
	float m_fAudioAltitudeCeiling; // 0x318
	float m_fAudioAltitudeFloor; // 0x31c
};

struct UInteraction : UUIRoot {
	DelegateProperty __OnReceivedNativeInputKey__Delegate; // 0x70
	DelegateProperty __OnReceivedNativeInputAxis__Delegate; // 0x80
	DelegateProperty __OnReceivedNativeInputChar__Delegate; // 0x90
	DelegateProperty __OnInitialize__Delegate; // 0xa0
};

struct UMaterialFunction : UObject {
	FGuid StateId; // 0x60
	FString Description; // 0x70
	char bExposeToLibrary : 1; // 0x80
	char bReentrantFlag : 1; // 0x80
	TArray<FString> LibraryCategories; // 0x84
	TArray<ObjectProperty> FunctionExpressions; // 0x94
};

struct ATgDevice_GourdMod : ATgDevice {
	TArray<ObjectProperty> m_ImmuneTargets; // 0xa04
	TArray<float> m_ImmuneTimes; // 0xa14
};

struct UUIComponent_CompetitiveRankChange : UUIComponent_Display {
	ObjectProperty m_pButton; // 0x124
	ObjectProperty m_mcRankIcon; // 0x12c
	ObjectProperty m_mcRankName; // 0x134
};

struct UUIData_BattlePassLevel : UUIData {
	int32_t m_nLevel; // 0x64
	ObjectProperty m_pLTI; // 0x68
	char m_bUnlocked : 1; // 0x70
	char m_bPremium : 1; // 0x70
};

struct UUIHudScoreboard : UTgGfxScene {
	int32_t m_nFirstRowIconHeight; // 0x1ec
	int32_t m_nRowSpacing; // 0x1f0
	int32_t m_nTalentXOffset; // 0x1f4
	int32_t m_nPassiveXOffset; // 0x1f8
	int32_t m_nFirstItemXOffset; // 0x1fc
	int32_t m_nItemSpacing; // 0x200
	int32_t m_nBestStreak; // 0x204
	FScoreInfo m_RedScore[0x5]; // 0x208
	FScoreInfo m_BlueScore[0x5]; // 0xb7c
	ObjectProperty m_ItemTooltip; // 0x14f0
	ObjectProperty m_mcStats; // 0x14f8
	ObjectProperty m_mcTitle; // 0x1500
	ObjectProperty m_mcTitles; // 0x1508
	ObjectProperty m_mcMuteVoiceGamepadPrompt; // 0x1510
	ObjectProperty m_mcViewProfilePrompt; // 0x1518
	ObjectProperty m_mcHighlight; // 0x1520
	ObjectProperty m_mcStat[0x5]; // 0x1528
	ObjectProperty m_grPlayers; // 0x1550
	ObjectProperty m_grItems; // 0x1558
	ObjectProperty m_grCards; // 0x1560
	ObjectProperty m_mcTabs[0x2]; // 0x1568
	ObjectProperty m_mcTabKey[0x2]; // 0x1578
	ObjectProperty m_mcTabTitles[0x2]; // 0x1588
	ScoreboardTabs m_eCurrentTab; // 0x1598
	char m_bMuteStateDirty : 1; // 0x159c
};

struct ATgDevice_ChurchillTurret : ATgDevice {
	ObjectProperty m_CachedChurchill; // 0xa04
};

struct UUIHudKillFeed : UTgGfxScene {
	int32_t m_nMaxDisplayedKillEntries; // 0x1ec
	int32_t m_nDepth; // 0x1f0
	FString m_sKillEntryName; // 0x1f4
	FString m_sHHPickupEntryName; // 0x204
	char m_bDisableKillFeed : 1; // 0x214
	float m_fKillEntryUpwardAnimDistance; // 0x218
	TArray<FUIKILLFEED_DATA> m_Entries; // 0x21c
	TArray<FUIKILLFEED_DATA> m_EntryPool; // 0x22c
	ObjectProperty m_mcGuide; // 0x23c
};

struct USeqAct_ToggleInput : USeqAct_Toggle {
	char bToggleMovement : 1; // 0x108
	char bToggleTurning : 1; // 0x108
};

struct UUIScene_UIStoreDetail : UUIScene {
	int32_t m_nInventoryUpdateCallbackHandle; // 0x1cc
	ObjectProperty m_mcTitleTF; // 0x1d0
	ObjectProperty m_mcDescTF; // 0x1d8
	ObjectProperty m_mcDLCTexture; // 0x1e0
	ObjectProperty m_pItemPreview; // 0x1e8
	ObjectProperty m_pItemList; // 0x1f0
	ObjectProperty m_pPurchaseButton; // 0x1f8
	ObjectProperty m_pBack; // 0x200
	ObjectProperty m_pTextBox; // 0x208
	ObjectProperty m_pRotator; // 0x210
};

struct UParticleModuleMeshRotation : UParticleModuleRotationBase {
	FRawDistributionVector StartRotation; // 0x68
	char bInheritParent : 1; // 0x8c
};

struct USeqVar_Float : USequenceVariable {
	float FloatValue; // 0xa0
};

struct UHTTPDownload : UDownload {
	FString RedirectToURL; // 0x74
	char UseCompression : 1; // 0x84
	FString ProxyServerHost; // 0xaa4
	int32_t ProxyServerPort; // 0xab4
	char MaxRedirection : 1; // 0xab8
	float ConnectionTimeout; // 0xabc
};

struct UPBRuleNodeCycle : UPBRuleNodeBase {
	EProcBuildingAxis RepeatAxis; // 0x70
	float RepeatSize; // 0x74
	int32_t CycleSize; // 0x78
	char bFixRepeatSize : 1; // 0x7c
};

struct UTgAnimNodeBlendByZoomTransition : UTgAnimNodeBlendList {
	float m_fTransitionStartTime; // 0x168
};

struct UUIComponent_TitlesViewEntry : UUIComponent_Interactable {
	int32_t m_nTitleId; // 0x140
	ObjectProperty m_mcRarityText; // 0x144
	ObjectProperty m_mcColorBlock; // 0x14c
	ObjectProperty m_mcFade; // 0x154
	ObjectProperty m_mcTitle; // 0x15c
	ObjectProperty m_mcLockIcon; // 0x164
	ObjectProperty m_mcEquipped; // 0x16c
	ObjectProperty m_scEquip; // 0x174
	ObjectProperty m_scUnequip; // 0x17c
	ObjectProperty m_scNotOwned; // 0x184
};

struct UActorFactoryPhysicsAsset : UActorFactory {
	ObjectProperty PhysicsAsset; // 0x9c
	ObjectProperty SkeletalMesh; // 0xa4
	char bStartAwake : 1; // 0xac
	char bDamageAppliesImpulse : 1; // 0xac
	char bNotifyRigidBodyCollision : 1; // 0xac
	char bUseCompartment : 1; // 0xac
	char bCastDynamicShadow : 1; // 0xac
	FVector InitialVelocity; // 0xb0
	FVector DrawScale3D; // 0xbc
};

struct UTgSeqEvent_TutorialEvent : USequenceEvent {
	TUTORIAL_EVENT TutEvent; // 0x128
	int32_t EventData; // 0x12c
};

struct ATgDevice_ShadowUlt : ATgDevice_Charge {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa78
	ObjectProperty m_Shadow; // 0xa80
	char m_bHasHitTarget : 1; // 0xa88
	FVector m_vLastChargeStartLocation; // 0xa8c
	float m_fChargePercent; // 0xa98
	float m_fInitalEnergyCost; // 0xa9c
	FVector m_vCachedTargeterEndpoint; // 0xaa0
};

struct UTgAIBehaviorAction_LookAtCombatTarget : UTgAIBehaviorAction {
	char bAllowAimNose : 1; // 0x94
	char bHeadShot : 1; // 0x94
};

struct ATgDevice_DredgeF : ATgDevice {
	ObjectProperty r_Portals[0x2]; // 0xa04
	int32_t r_nNextDeployable; // 0xa14
	FVector s_vTeleportTarget; // 0xa18
	ObjectProperty m_CachedTgP; // 0xa24
};

struct UUIComponent_LevelProgress : UUIComponent_Display {
	ObjectProperty m_mcLevel; // 0x124
	ObjectProperty m_mcNextLevelXP; // 0x12c
	ObjectProperty m_mcTimePlayed; // 0x134
	ObjectProperty m_mcWins; // 0x13c
	ObjectProperty m_mcTotalXP; // 0x144
	ObjectProperty m_mcProgress; // 0x14c
};

struct UUIComponent_HomeGoToItem : UUIComponent_Display {
	ObjectProperty m_mcTitle; // 0x124
	ObjectProperty m_mcSubtitle; // 0x12c
	ObjectProperty m_mcDescription; // 0x134
	ObjectProperty m_GoToItemButton; // 0x13c
	ObjectProperty m_pGamepadKey; // 0x144
	ObjectProperty m_pCurrentItem; // 0x14c
	ObjectProperty m_pCurrentLootTableItem; // 0x154
	int32_t m_nLocationId; // 0x15c
};

struct UUIData_RadialEquipMenu : UUIData {
	char m_bEmoteDisplay : 1; // 0x64
	TArray<ObjectProperty> m_SlotData; // 0x68
};

struct UUIComponent_MatchLobbyBansChampion : UUIComponent_Display {
	ObjectProperty m_mcIcon; // 0x124
	char m_bIsActive : 1; // 0x12c
};

struct UMaterialExpressionDepthOfFieldFunction : UMaterialExpression {
	EDepthOfFieldFunctionValue FunctionValue; // 0xb0
	FExpressionInput Depth; // 0xb4
};

struct UTgDeviceFire_MirrorDamageToHealBlock : UTgDeviceFire {
	float m_fHealBlockAmount; // 0x268
};

struct UTgAIUtilitySet : UTgAIBehaviorNode {
	EAIAnnotationType AnnotationType; // 0x94
	TArray<ObjectProperty> Functions; // 0x98
	TArray<ObjectProperty> Filters; // 0xa8
};

struct UTgAIInfluenceMapRenderingComponent : UHavokNavigationRenderingComponent {
	ObjectProperty InfluenceMap; // 0x250
	ObjectProperty InfluenceMapTexture; // 0x258
};

struct UTgAnimNotify_ToggleSocketSpecialFX : UAnimNotify {
	FName m_DisplayGroupName; // 0x68
	int32_t m_EquipSlot; // 0x70
	char m_bActivateFxGroup : 1; // 0x74
};

struct ATgDevice_SelfResurrection : ATgDevice {
	char m_bFiringLockout : 1; // 0xa04
};

struct UAnimNodeBlendList : UAnimNodeBlendBase {
	TArray<float> TargetWeight; // 0x114
	float BlendTimeToGo; // 0x124
	int32_t ActiveChildIndex; // 0x128
	char bPlayActiveChild : 1; // 0x12c
	char bForceChildFullWeightWhenBecomingRelevant : 1; // 0x12c
	char bSkipBlendWhenNotRendered : 1; // 0x12c
	TArray<int32_t> PlayActiveChildExceptionList; // 0x130
	float SliderPosition; // 0x140
};

struct UTgAIBehaviorAction_Strafe : UTgAIBehaviorAction_MoveToTarget {
	float StrafeUpdateTime; // 0x9c
	float DistanceMultiplier; // 0xa0
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	ObjectProperty PSTemplate; // 0x68
	char bIsExtremeContent : 1; // 0x70
	char bAttach : 1; // 0x70
	char bPreview : 1; // 0x70
	char bSkipIfOwnerIsHidden : 1; // 0x70
	char bIsFootstep : 1; // 0x70
	char ShouldDilateTimeByPlayRate : 1; // 0x70
	char m_bReuse : 1; // 0x70
	ObjectProperty PSNonExtremeContentTemplate; // 0x74
	FName SocketName; // 0x7c
	FName BoneName; // 0x84
	FName BoneSocketModuleActorName; // 0x8c
	float TimeDilationFactor; // 0x94
};

struct UParticleModuleUberRainImpacts : UParticleModuleUberBase {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartRotation; // 0xc0
	char bInheritParent : 1; // 0xe4
	char MultiplyX : 1; // 0xe4
	char MultiplyY : 1; // 0xe4
	char MultiplyZ : 1; // 0xe4
	char bIsUsingCylinder : 1; // 0xe4
	char bPositive_X : 1; // 0xe4
	char bPositive_Y : 1; // 0xe4
	char bPositive_Z : 1; // 0xe4
	char bNegative_X : 0; // 0xe4
	char bNegative_Y : 0; // 0xe4
	char bNegative_Z : 0; // 0xe4
	char bSurfaceOnly : 0; // 0xe4
	char bVelocity : 0; // 0xe4
	char bRadialVelocity : 0; // 0xe4
	FRawDistributionVector LifeMultiplier; // 0xe8
	FRawDistributionFloat PC_VelocityScale; // 0x10c
	FRawDistributionVector PC_StartLocation; // 0x130
	FRawDistributionFloat PC_StartRadius; // 0x154
	FRawDistributionFloat PC_StartHeight; // 0x178
	CylinderHeightAxis PC_HeightAxis; // 0x19c
	FRawDistributionVector ColorOverLife; // 0x1a0
	FRawDistributionFloat AlphaOverLife; // 0x1c4
};

struct ATgBotFactory_PointCapture : ATgBotFactory_Leashed {
	ObjectProperty m_CapturePoint; // 0x388
};

struct AVehicle : APawn {
	ObjectProperty Driver; // 0x5a8
	char bDriving : 1; // 0x5b0
	char bDriverIsVisible : 1; // 0x5b0
	char bAttachDriver : 1; // 0x5b0
	char bTurnInPlace : 1; // 0x5b0
	char bSeparateTurretFocus : 1; // 0x5b0
	char bFollowLookDir : 1; // 0x5b0
	char bHasHandbrake : 1; // 0x5b0
	char bScriptedRise : 1; // 0x5b0
	char bDuckObstacles : 0; // 0x5b0
	char bAvoidReversing : 0; // 0x5b0
	char bRetryPathfindingWithDriver : 0; // 0x5b0
	char bIgnoreStallZ : 0; // 0x5b0
	char bDoExtraNetRelevancyTraces : 0; // 0x5b0
	TArray<FVector> ExitPositions; // 0x5b4
	float ExitRadius; // 0x5c4
	FVector ExitOffset; // 0x5c8
	float Steering; // 0x5d4
	float Throttle; // 0x5d8
	float Rise; // 0x5dc
	FVector TargetLocationAdjustment; // 0x5e0
	float DriverDamageMult; // 0x5ec
	float MomentumMult; // 0x5f0
	UDamageType* CrushedDamageType; // 0x5f4
	float MinCrushSpeed; // 0x5fc
	float ForceCrushPenetration; // 0x600
	char StuckCount; // 0x604
	float ThrottleTime; // 0x608
	float StuckTime; // 0x60c
	float OldSteering; // 0x610
	float OnlySteeringStartTime; // 0x614
	float OldThrottle; // 0x618
	float AIMoveCheckTime; // 0x61c
	float VehicleMovingTime; // 0x620
	float TurnTime; // 0x624
};

struct ASceneCapture2DActor : ASceneCaptureActor {
	ComponentProperty DrawFrustum; // 0x288
};

struct UCloudStorageBaseCloudSaveSystemKVS : UObject {
	ObjectProperty CloudStorage; // 0x60
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FPointer ColorProp; // 0x70
	FLinearColor ResetColor; // 0x78
};

struct USimpleSplineAudioComponent : USplineAudioComponent {
	char bAttenuateWithLPF : 1; // 0x2e4
	float LPFRadiusMin; // 0x2e8
	float LPFRadiusMax; // 0x2ec
	float dBAttenuationAtMax; // 0x2f0
	float FlattenAttenuationRadius; // 0x2f4
	SoundDistanceModel DistanceAlgorithm; // 0x2f8
	float RadiusMin; // 0x2fc
	float RadiusMax; // 0x300
	TArray<FSplineSoundSlot> SoundSlots; // 0x304
	ObjectProperty NotifyBufferFinishedHook; // 0x314
};

struct ULensFlareComponent : UPrimitiveComponent {
	ObjectProperty Template; // 0x24c
	ComponentProperty PreviewInnerCone; // 0x254
	ComponentProperty PreviewOuterCone; // 0x25c
	ComponentProperty PreviewRadius; // 0x264
	char bAutoActivate : 1; // 0x26c
	char bIsActive : 1; // 0x26c
	char bHasTranslucency : 1; // 0x26c
	char bHasUnlitTranslucency : 1; // 0x26c
	char bHasUnlitDistortion : 1; // 0x26c
	char bUsesSceneColor : 1; // 0x26c
	char bHasSeparateTranslucency : 1; // 0x26c
	char bUseTrueConeCalculation : 1; // 0x26c
	char bVisibleForMobile : 0; // 0x26c
	float OuterCone; // 0x270
	float InnerCone; // 0x274
	float ConeFudgeFactor; // 0x278
	float Radius; // 0x27c
	float MinStrength; // 0x280
	FLinearColor SourceColor; // 0x284
	TArray<FLensFlareElementMaterials> Materials; // 0x294
	FPointer ReleaseResourcesFence; // 0x2a4
	float NextTraceTime; // 0x2ac
};

struct UTgAnimNodeBlendByPhysics : UAnimNodeBlendList {
	ObjectProperty m_TgPawn; // 0x144
	EPhysics m_LastPhysics; // 0x14c
	EPhysics m_CurrentPhysics; // 0x14d
	int32_t m_CurrentPhysicsChildIndex; // 0x150
	TArray<EPhysics> m_PhysicsChildren; // 0x154
	char m_bDirectUnspecifiedPhysicsThroughChild0 : 1; // 0x164
	float DefaultBlendTime; // 0x168
	TArray<FChildrenBlendInfo> m_ChildrenBlendInfo; // 0x16c
};

struct ATgFlagballSpawnPoint : AActor {
	int32_t m_nFlagBallFiremodeID; // 0x280
	ObjectProperty m_FireMode; // 0x284
	char m_bSetupFireMode : 1; // 0x28c
};

struct ATgDevice_Barrage : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	ObjectProperty m_BarrageFireDevice; // 0xa0c
};

struct UMcpMessageBase : UMcpServiceBase {
	FString McpMessageManagerClassName; // 0x78
	EMcpMessageCompressionType CompressionType; // 0x88
	TArray<FMcpMessageContents> MessageContentsList; // 0x8c
	TArray<FMcpMessageList> MessageLists; // 0x9c
	DelegateProperty __OnCreateMessageComplete__Delegate; // 0xac
	DelegateProperty __OnDeleteMessageComplete__Delegate; // 0xbc
	DelegateProperty __OnQueryMessagesComplete__Delegate; // 0xcc
	DelegateProperty __OnQueryMessageContentsComplete__Delegate; // 0xdc
};

struct UGameExplosionContent : UObject {
	char bAutoControllerVibration : 1; // 0x60
	char bOrientCameraShakeTowardsEpicenter : 1; // 0x60
	ObjectProperty ExplosionSound; // 0x64
	ObjectProperty CamShake; // 0x6c
	ObjectProperty CamShake_Left; // 0x74
	ObjectProperty CamShake_Right; // 0x7c
	ObjectProperty CamShake_Rear; // 0x84
	float CamShakeInnerRadius; // 0x8c
	float CamShakeOuterRadius; // 0x90
	float CamShakeFalloff; // 0x94
	AEmitterCameraLensEffectBase* CameraLensEffect; // 0x98
	float CameraLensEffectRadius; // 0xa0
	ComponentProperty ExploLight; // 0xa4
	float ExploLightFadeOutTime; // 0xac
	ComponentProperty ExploRadialBlur; // 0xb0
	float ExploRadialBlurFadeOutTime; // 0xb8
	float ExploRadialBlurMaxBlur; // 0xbc
	ObjectProperty ParticleEmitterTemplate; // 0xc0
	ObjectProperty FogVolumeArchetype; // 0xc8
};

struct USeqAct_Destroy : USequenceAction {
	char bDestroyBasedActors : 1; // 0x108
	TArray<AActor*> IgnoreBasedClasses; // 0x10c
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
	FExpressionInput AGreaterThanB; // 0x118
	FExpressionInput AEqualsB; // 0x14c
	FExpressionInput ALessThanB; // 0x180
};

struct UOnlineEventsInterfaceMcp : UMCPBase {
	TArray<FEventUploadConfig> EventUploadConfigs; // 0x80
	TArray<FPointer> MCPEventPostObjects; // 0x90
	TArray<EEventUploadType> DisabledUploadTypes; // 0xa0
	char bBinaryStats : 1; // 0xb0
};

struct UTgEffectModifyProperty_AltFire : UTgEffectModifyProperty {
	TArray<ObjectProperty> m_LastRetrievedOverrides; // 0xbc
};

struct UTgAIBehaviorCondition_NumRallyPoints : UTgAIBehaviorCondition {
	int32_t nRallyPointsThreshold; // 0x98
	char bMustBeEnemy : 1; // 0x9c
	char bMustBeSameTaskForce : 1; // 0x9c
};

struct UTgSeqAct_GetBot : USequenceAction {
	int32_t m_nBotNumber; // 0x108
};

struct UTextureFlipBook : UTexture2D {
	FPointer VfTable_FTickableObject; // 0x208
	float TimeIntoMovie; // 0x210
	float TimeSinceLastFrame; // 0x214
	float HorizontalScale; // 0x218
	float VerticalScale; // 0x21c
	char bPaused : 1; // 0x220
	char bStopped : 1; // 0x220
	char bLooping : 1; // 0x220
	char bAutoPlay : 1; // 0x220
	int32_t HorizontalImages; // 0x224
	int32_t VerticalImages; // 0x228
	TextureFlipBookMethod FBMethod; // 0x22c
	float FrameRate; // 0x230
	float FrameTime; // 0x234
	int32_t CurrentRow; // 0x238
	int32_t CurrentColumn; // 0x23c
	float RenderOffsetU; // 0x240
	float RenderOffsetV; // 0x244
	FPointer ReleaseResourcesFence; // 0x248
};

struct UTgGamePhase_FlagballActive : UTgGamePhase {
	float m_fFlagballCorrectInterval; // 0xb8
	float m_fFlagballCorrectTimer; // 0xbc
};

struct USeqAct_SetSoundMode : USequenceAction {
	ObjectProperty SoundMode; // 0x108
	char bTopPriority : 1; // 0x110
};

struct UTgSeqAct_ParentAnimComponent : USequenceAction {
	char bDetach : 1; // 0x108
};

struct UParticleModuleSubUVDirect : UParticleModuleSubUVBase {
	FRawDistributionVector SubUVPosition; // 0x68
	FRawDistributionVector SubUVSize; // 0x8c
};

struct USkelControlWheel : USkelControlSingleBone {
	float WheelDisplacement; // 0x100
	float WheelMaxRenderDisplacement; // 0x104
	float WheelRoll; // 0x108
	EAxis WheelRollAxis; // 0x10c
	EAxis WheelSteeringAxis; // 0x10d
	float WheelSteering; // 0x110
	char bInvertWheelRoll : 1; // 0x114
	char bInvertWheelSteering : 1; // 0x114
};

struct UTerrainLayerSetup : UObject {
	TArray<FTerrainFilteredMaterial> Materials; // 0x60
};

struct UPBRuleNodeComment : UPBRuleNodeBase {
	int32_t SizeX; // 0x70
	int32_t SizeY; // 0x74
	int32_t BorderWidth; // 0x78
	FColor BorderColor; // 0x7c
	char bFilled : 1; // 0x80
	FColor FillColor; // 0x84
};

struct AProcBuilding : AVolume {
	TArray<FPBMeshCompInfo> BuildingMeshCompInfos; // 0x2bc
	TArray<FPBFracMeshCompInfo> BuildingFracMeshCompInfos; // 0x2cc
	ComponentProperty SimpleMeshComp; // 0x2dc
	char bGenerateRoofMesh : 1; // 0x2e4
	char bGenerateFloorMesh : 1; // 0x2e4
	char bApplyRulesToRoof : 1; // 0x2e4
	char bApplyRulesToFloor : 1; // 0x2e4
	char bSplitWallsAtRoofLevels : 1; // 0x2e4
	char bSplitWallsAtWallEdges : 1; // 0x2e4
	char bQuickEdited : 1; // 0x2e4
	char bBuildingBrushCollision : 1; // 0x2e4
	char bDebugDrawEdgeInfo : 0; // 0x2e4
	char bDebugDrawScopes : 0; // 0x2e4
	TArray<ComponentProperty> LODMeshComps; // 0x2e8
	int32_t NumMeshedTopLevelScopes; // 0x2f8
	float MaxFacadeZ; // 0x2fc
	float MinFacadeZ; // 0x300
	TArray<ObjectProperty> OverlappingBuildings; // 0x304
	float SimpleMeshMassiveLODDistance; // 0x314
	float RenderToTexturePullBackAmount; // 0x318
	int32_t RoofLightmapRes; // 0x31c
	int32_t NonRectWallLightmapRes; // 0x320
	FName ParamSwatchName; // 0x324
	TArray<FPBMaterialParam> BuildingMaterialParams; // 0x32c
	ObjectProperty LowLODPersistentActor; // 0x33c
	ComponentProperty CurrentSimpleMeshComp; // 0x344
	ObjectProperty CurrentSimpleMeshActor; // 0x34c
	int32_t BuildingInstanceVersion; // 0x354
};

struct UParticleModuleVelocityOverLifetime : UParticleModuleVelocityBase {
	FRawDistributionVector VelOverLife; // 0x6c
	char Absolute : 1; // 0x90
};

struct UTgAIBehaviorAction_MoveToAvoidableProjectile : UTgAIBehaviorAction_MoveToTarget {
	char bMustBeEnemy : 1; // 0x9c
	char bIgnoreInsideCollision : 1; // 0x9c
	char bMoveAway : 1; // 0x9c
};

struct USeqVar_Character : USeqVar_Object {
	APawn* PawnClass; // 0xc4
};

struct UTgSeqAct_FadeIn : USequenceAction {
	float m_fDuration; // 0x108
};

struct UInterpTrackNotify : UInterpTrack {
	ObjectProperty Node; // 0xa0
	FName ParentNodeName; // 0xa8
	ObjectProperty OuterSequence; // 0xb0
	ObjectProperty OuterSet; // 0xb8
	TArray<FNotifyTrackKey> NotifyTrack; // 0xc0
};

struct UTgAnimBlendByPercent : UTgAnimNodeBlendList {
	float m_fCurrentPercent; // 0x168
	int32_t m_nDeferredActiveChild; // 0x16c
	int32_t m_fDeferredActiveChildBlendTime; // 0x170
	char m_bDeferUpdatesWhilePlaying : 1; // 0x174
	TArray<FBlendByPercentValues> m_ChildParams; // 0x178
};

struct UTgInventoryObject_Listen_InHand_HitMissStacker : UTgInvListener {
	float m_fLastStackTime; // 0xc4
	int32_t m_nAppliedStacks; // 0xc8
};

struct ATgDevice_WallClimb : ATgDevice {
	ObjectProperty m_CachedKoga; // 0xa04
	FVector m_vWallSimilarityTestNormal; // 0xa0c
	FVector m_vCurrentWallClimbNormal; // 0xa18
	char m_bIsWallClimbing : 1; // 0xa24
	char r_bWantsWallClimb : 1; // 0xa24
	char m_bRequiresBaseable : 1; // 0xa24
	char m_bRequiresStepUpOn : 1; // 0xa24
	char m_bHitStepUpOn : 1; // 0xa24
	char m_bHitCanBase : 1; // 0xa24
	char m_bHitWorldGeometry : 1; // 0xa24
	char m_bGeometryTestResult : 1; // 0xa24
	float m_fWallMagnetMovePerSec; // 0xa28
	float m_fWallClimbVertOffset; // 0xa2c
	float m_fWallNormalSimilarityThreshold; // 0xa30
	float m_fAngularThreshold; // 0xa34
	float m_fVelocityThreshold; // 0xa38
	float m_fWallClimbSpeed; // 0xa3c
	float m_fWallGeometryNormalOffset; // 0xa40
	float m_fPostAbortLockout; // 0xa44
	float m_fMaxWallClimbTime; // 0xa48
	float m_fGeometryTestPeriod; // 0xa4c
	float m_fWallClimbLockoutJumpVelocity; // 0xa50
	float m_fWallJumpZSpeed; // 0xa54
	float m_fWallClimbTime; // 0xa58
};

struct ATgSpawnTeleporterEntrance : AVolume {
	char bEnabled : 1; // 0x2bc
};

struct UDrawCapsuleComponent : UPrimitiveComponent {
	FColor CapsuleColor; // 0x24c
	ObjectProperty CapsuleMaterial; // 0x250
	float CapsuleHeight; // 0x258
	float CapsuleRadius; // 0x25c
	char bDrawWireCapsule : 1; // 0x260
	char bDrawLitCapsule : 1; // 0x260
	char bDrawOnlyIfSelected : 1; // 0x260
};

struct UPBRuleNodeEdgeAngle : UPBRuleNodeBase {
	EProcBuildingEdge Edge; // 0x70
	TArray<FRBEdgeAngleInfo> Angles; // 0x74
};

struct ATgStaticMeshActor_TeamColor : AStaticMeshActor {
	int32_t nTaskForce; // 0x2a4
	FName TeamColoringParameterName; // 0x2a8
	char bInvertColoringParameter : 1; // 0x2b0
	char bInstancedAllMaterials : 1; // 0x2b0
	char bFriendlyWithLocalPlayer; // 0x2b4
	TArray<ObjectProperty> InitialMaterialList; // 0x2b8
};

struct UTgAnimMetaData_MICStates_Interp : UTgAnimMetaData_Keyframed {
	FName MICStateNameFrom; // 0x80
	FName MICStateNameTo; // 0x88
	int32_t nMaterialIndex; // 0x90
	char bApplyToChildMeshes : 1; // 0x94
};

struct ATgPawn_Blades : ATgPawn_Character {
	float m_fGravityFalloffDuration; // 0x3160
	float m_fGravityFalloffTimer; // 0x3164
	float m_fAirControlReductionDuration; // 0x3168
	float m_fAirControlReductionTimer; // 0x316c
	float m_fAirControlReductionPercent; // 0x3170
	char r_bProwlActive : 1; // 0x3174
	char c_bHasDjSkin : 1; // 0x3174
	char c_bHasDjWeapon : 1; // 0x3174
	float r_fProwlAccelMultiplier; // 0x3178
	float r_fProwlGroundSpeedMultiplier; // 0x317c
	float r_fProwlJumpHeightMultiplier; // 0x3180
	float r_fProwlAirControlMultiplier; // 0x3184
	float r_fProwlFadeOutDuration; // 0x3188
	float m_fProwlFadeOutTimer; // 0x318c
	float r_fFeatherliteGravityMultiplier; // 0x3190
	GemEmissiveAnim r_eGemEmissiveAnim; // 0x3194
	GemEmissiveAnim r_eGemEmissiveEndAnim; // 0x3195
	DjBladesFace c_eCurrentDjBladesFace; // 0x3196
	DjBladesFace c_eDjBladesFace[0x3]; // 0x3197
	ObjectProperty c_pGemEmissiveMIC; // 0x319c
	FName m_nmGemEmissiveParamName; // 0x31a4
	float m_fGemEmissiveBaseValue; // 0x31ac
	float m_fGemEmissiveBaseAnimSpeed; // 0x31b0
	float c_fGemEmissiveCurrentValue; // 0x31b4
	TArray<GemEmissiveAnim> c_eGemEmissiveAnimType; // 0x31b8
	TArray<float> c_fGemEmissiveTargetValue; // 0x31c8
	TArray<float> c_fGemEmissiveAnimSpeed; // 0x31d8
	TArray<float> c_fGemEmissiveHoldTimer; // 0x31e8
	float m_fGemEmissive1PBaseValue; // 0x31f8
	float m_fGemEmissive1PAnimSpeedMult; // 0x31fc
	float m_fGemEmissive1PValueMult; // 0x3200
	float m_fGemEmissiveGlobalScalar; // 0x3204
	float c_fDjBladesFaceTimeout[0x3]; // 0x3208
	FDjBladesFaceConfig c_DjBladesFaceConfig[0x8]; // 0x3214
	TArray<FDjBladesVGSFace> c_DjBladesVGSFaces; // 0x3254
	FName c_nmDjBladesFaceXParamName; // 0x3264
	FName c_nmDjBladesFaceYParamName; // 0x326c
};

struct ATgDevice_FernandoInhand : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
};

struct ATgDevice_SilenceBeam : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
	ObjectProperty m_CachedGauntletPawn; // 0xa0c
};

struct UComponent : UObject {
	UObject* TemplateOwnerClass; // 0x60
	FName TemplateName; // 0x68
};

struct AHavokNavMeshActor : AActor {
	char bNavMeshLoaded : 1; // 0x280
	char DrawTraversalAnalysis : 1; // 0x280
	char DrawNavMeshEdges : 1; // 0x280
	char DrawNavMeshUserEdges : 1; // 0x280
	char DrawNavMeshFaces : 1; // 0x280
	char DrawCluster : 1; // 0x280
	char DrawFaceToClusterLines : 1; // 0x280
	char FixupOverlappingTriangles : 1; // 0x280
	char IncludeUserEdgesInClusters : 0; // 0x280
	char ShrinkNavMeshByCharacterWidth : 0; // 0x280
	char UseSimplification : 0; // 0x280
	char PreserveVerticalBorderRegions : 0; // 0x280
	char BorderPreservationTolerance : 0; // 0x280
	char bAnalyzeDropDowns : 0; // 0x280
	char bAnalyzeJumps : 0; // 0x280
	ComponentProperty EditorSprite; // 0x284
	ComponentProperty RenderingComponent; // 0x28c
	FUntypedBulkData_Mirror NavMeshData; // 0x294
	FPointer HavokWorld; // 0x2d4
	ObjectProperty HavokGrid; // 0x2dc
	EHavokVersion Version; // 0x2e4
	FVector DrawClusterOffset; // 0x2e8
	FVector SingleCarverAABBMin; // 0x2f4
	FVector SingleCarverAABBMax; // 0x300
	float MaxBorderDistanceError; // 0x30c
	float MaxPartitionHeightError; // 0x310
	float MinRegionArea; // 0x314
	float MinDistanceToSeed; // 0x318
	float MaxWalkableSlope; // 0x31c
	float EntityHalfHeight; // 0x320
	float StartingHeightOffset; // 0x324
	float MaxStepHeight; // 0x328
	float MaxPolyHeight; // 0x32c
	float HeightMergeThreshold; // 0x330
	float MinRadius; // 0x334
	float MaxRadius; // 0x338
	float MaxDropHeight; // 0x33c
	float MaxUnderhang; // 0x340
	float DropDownCost; // 0x344
	float MaxJumpHeight; // 0x348
	float StandardJumpHeight; // 0x34c
	float StandardJumpDistance; // 0x350
	float JumpCost; // 0x354
	float MinTraversalEdgeLength; // 0x358
	float DegenerateWidthThreshold; // 0x35c
	float MaxConcaveBorderSimplifyArea; // 0x360
	float RaiseEdgeHeightLimit; // 0x364
};

struct ATgDevice_BunnyLink : ATgDevice {
	ObjectProperty m_CachedBunny; // 0xa04
	ObjectProperty m_CandidateSpiritLinkTarget; // 0xa0c
	ObjectProperty m_CurrentSpiritLinkTarget; // 0xa14
	float m_fLinkedDamageHealthFloor; // 0xa1c
	float m_fSpiritLinkBreakThreshold; // 0xa20
	ObjectProperty m_LinkDeviceMode; // 0xa24
};

struct UOnlinePlayerStorage : UObject {
	int32_t VersionNumber; // 0x60
	int32_t VersionSettingsId; // 0x64
	int32_t SaveCountSettingId; // 0x68
	TArray<FOnlineProfileSetting> ProfileSettings; // 0x6c
	TArray<FSettingsPropertyPropertyMetaData> ProfileMappings; // 0x7c
	EOnlinePlayerStorageAsyncState AsyncState; // 0x8c
	int32_t DeviceID; // 0x90
};

struct USeqCond_SwitchObject : USeqCond_SwitchBase {
	TArray<FSwitchObjectCase> SupportedValues; // 0xec
};

struct AKeypoint : AActor {
	ComponentProperty SpriteComp; // 0x280
};

struct ALandscapeProxy : AInfo {
	FGuid LandscapeGuid; // 0x280
	int32_t MaxLODLevel; // 0x290
	ObjectProperty DefaultPhysMaterial; // 0x294
	float StreamingDistanceMultiplier; // 0x29c
	ObjectProperty LandscapeMaterial; // 0x2a0
	float LODDistanceFactor; // 0x2a8
	TArray<ComponentProperty> LandscapeComponents; // 0x2ac
	TArray<ComponentProperty> CollisionComponents; // 0x2bc
	TMap<None, None> MaterialInstanceConstantMap; // 0x2cc
	TMap<None, None> WeightmapUsageMap; // 0x314
	float StaticLightingResolution; // 0x35c
	ObjectProperty LandscapeActor; // 0x360
	char bIncludeInManualZPrepass : 1; // 0x368
	char bIsProxy : 1; // 0x368
	char bIsSetup : 1; // 0x368
	char bResetup : 1; // 0x368
	char bIsMovingToLevel : 1; // 0x368
	TArray<FName> ActorLayerNames; // 0x36c
	FLightmassPrimitiveSettings LightmassSettings; // 0x37c
	int32_t CollisionMipLevel; // 0x398
	int32_t MobileLODBias; // 0x39c
	TArray<FLandscapeLayerStruct> LayerInfoObjs; // 0x3a0
	int32_t ComponentSizeQuads; // 0x3b0
	int32_t SubsectionSizeQuads; // 0x3b4
	int32_t NumSubsections; // 0x3b8
};

struct ATgPropActor : AActor {
	ComponentProperty c_Mesh; // 0x280
	float m_fTickPostDeactivate; // 0x288
	char m_bDeactivateOnPhysNone : 1; // 0x28c
	char m_bIsActive : 1; // 0x28c
	char m_bForceHidden : 1; // 0x28c
	EPhysics m_ePhysicsOnActive; // 0x290
};

struct AFrameworkGame : AGameInfo {
	TArray<FRequiredMobileInputConfig> RequiredMobileInputConfigs; // 0x4cc
};

struct ATgDevice_OppressorMine : ATgDevice {
	TArray<ObjectProperty> m_NewTargetSFXRecentTargets; // 0xa04
	TArray<float> m_NewTargetSFXTargetTime; // 0xa14
	float m_fMinNewTargetSFXDelay; // 0xa24
};

struct UActorFactoryFogVolumeConstantDensityInfo : UActorFactory {
	ObjectProperty SelectedMaterial; // 0x9c
	char bNothingSelected : 1; // 0xa4
};

struct ATgDevice_CorvusRMB : ATgDevice {
	ObjectProperty m_Corvus; // 0xa04
	FImpactInfo m_CachedImpact; // 0xa0c
};

struct ATgDevice_AzaanWalls : ATgDevice {
	int32_t m_nWallMeshId; // 0xa04
	ObjectProperty m_pAzaan; // 0xa08
	char m_bWasAboveThreshold : 1; // 0xa10
	float m_fWallDistToFocalPoint; // 0xa14
	float m_fWallSpread; // 0xa18
	float m_fWallDepthCheck; // 0xa1c
	float m_fWallZForgiveness; // 0xa20
	FRotator m_rCachedWallAim; // 0xa24
	FVector m_vOpenSpotExtent; // 0xa30
	FVector m_vCachedWallFocus; // 0xa3c
	int32_t m_nNumberOfWalls; // 0xa48
	int32_t r_nActiveDeployableWalls; // 0xa4c
};

struct UUIData_HeaderTab : UUIData {
	FString m_sTitle; // 0x64
	int32_t m_nCTACount; // 0x74
	int32_t m_nFrame; // 0x78
};

struct UUIData_RebindCommand : UUIData {
	int32_t m_nCommandIndex; // 0x64
	int32_t m_nCaptureAlt; // 0x68
};

struct UUIData_ReportPlayer : UUIData {
	ObjectProperty m_pPlayerData; // 0x64
	ObjectProperty m_pPlayerEntry; // 0x6c
};

struct ATgPawn_Flak : ATgPawn_Character {
	ObjectProperty m_CachedKineticBurstDevice; // 0x3160
	ObjectProperty m_CachedSiegeUnitDevice; // 0x3168
	ObjectProperty m_CachedUltimateDevice; // 0x3170
	ObjectProperty m_CachedShoulderBashDevice; // 0x3178
	ObjectProperty m_WepIdleSound; // 0x3180
	float m_PreviousZHeight; // 0x3188
	float m_GravityMultiplier; // 0x318c
	char m_bUseShoulderBashRetrieve : 1; // 0x3190
	char m_bUseShoulderBashZoom : 1; // 0x3190
};

struct ATgDevice_CorrupterUlt : ATgDevice {
	char hasFired : 1; // 0xa04
	ObjectProperty m_Corrupter; // 0xa08
	ObjectProperty r_Target; // 0xa10
	float m_fNextTargetUpdateIn; // 0xa18
	float m_fUpdateTargetPeriod; // 0xa1c
	float m_fDeliverDamageDelay; // 0xa20
};

struct UTgDeviceForm_DruidRMB : UTgDeviceForm {
	ObjectProperty m_CachedDruid; // 0x28c
	ObjectProperty m_pLastTarget; // 0x294
	FDruidHealBeam m_DruidHealBeams[0xa]; // 0x29c
	int32_t m_nNextBeamIndex; // 0x314
	FVector m_vFireLocationOffset; // 0x318
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x68
	char bNRScaleEmitterTime : 1; // 0x68
	char bSmooth : 1; // 0x68
	char bNoiseLock : 1; // 0x68
	char bOscillate : 1; // 0x68
	char bUseNoiseTangents : 1; // 0x68
	char bTargetNoise : 1; // 0x68
	char bApplyNoiseScale : 1; // 0x68
	int32_t Frequency; // 0x6c
	int32_t Frequency_LowRange; // 0x70
	FRawDistributionVector NoiseRange; // 0x74
	FRawDistributionFloat NoiseRangeScale; // 0x98
	FRawDistributionVector NoiseSpeed; // 0xbc
	float NoiseLockRadius; // 0xe0
	float NoiseLockTime; // 0xe4
	float NoiseTension; // 0xe8
	FRawDistributionFloat NoiseTangentStrength; // 0xec
	int32_t NoiseTessellation; // 0x110
	float FrequencyDistance; // 0x114
	FRawDistributionFloat NoiseScale; // 0x118
};

struct ATgDeploy_Bomb : ATgDeployable {
	float r_fPersistTime; // 0x46c
	ComponentProperty m_CountdownIndicator; // 0x470
	ObjectProperty m_CountdownIndicatorMIC; // 0x478
	float r_fRadiusScale; // 0x480
};

struct UTgDeviceForm_ShoulderBash : UTgDeviceForm {
	int32_t moveAmount; // 0x28c
};

struct ATgTeamPlayerStart : ATgStartPoint {
	char m_nTaskForce; // 0x3bc
	int32_t m_nPriority; // 0x3c0
	int32_t nPrevPriority; // 0x3c4
	float m_fMaxDistForEnemyCheckUU; // 0x3c8
	float m_fMaxDistForHazardCheckUU; // 0x3cc
	float m_fMaxWeightForEnemyDistanceCheck; // 0x3d0
	float m_fMaxDistForAllyCheckUU; // 0x3d4
	float m_fMinDistForAllyCheckUU; // 0x3d8
	float m_fMaxWeightForAllyDistanceCheck; // 0x3dc
	float m_fRandomRatingWeighting; // 0x3e0
	char m_bInitialSpawnOnly : 1; // 0x3e4
	char m_bDisallowEnemyLOS : 1; // 0x3e4
	char m_bRotateTowardNearestVisibleAlly : 1; // 0x3e4
	float m_fExtraHeightToTraceTo; // 0x3e8
	int32_t m_nMinLevel; // 0x3ec
	float m_fLastUsedTimeStamp; // 0x3f0
	TArray<ObjectProperty> s_AssignedPlayers; // 0x3f4
};

struct USeqEvent_Touch : USequenceEvent {
	TArray<AActor*> ClassProximityTypes; // 0x128
	TArray<AActor*> IgnoredClassProximityTypes; // 0x138
	char bForceOverlapping : 1; // 0x148
	char bUseInstigator : 1; // 0x148
	char bAllowDeadPawns : 1; // 0x148
	TArray<ObjectProperty> TouchedList; // 0x14c
};

struct UTgStreamManager : UObject {
	FString WatchEnd; // 0x60
	FString m_CurrentChannel; // 0x70
	int32_t m_nNewsIndex; // 0x80
	TArray<FGameStream> Streams; // 0x84
	char m_hasReceivedStreams : 1; // 0x94
	char m_hasAnySpecial : 1; // 0x94
	char m_hasAnyFeatured : 1; // 0x94
	ObjectProperty m_Movie; // 0x98
	DelegateProperty __ViewerSort__Delegate; // 0xa0
	DelegateProperty __FeaturedSort__Delegate; // 0xb0
	DelegateProperty __LiveSort__Delegate; // 0xc0
};

struct UUIData_LoadoutCategory : UUIData {
	FString m_sName; // 0x64
	ObjectProperty m_pItem; // 0x74
};

struct ATgDevice_GeometryBarrierTank : ATgDevice {
	char r_bHasTremorsEquipped : 1; // 0xa04
	float r_fTremorsCooldownReduction; // 0xa08
	float m_fCachedWallHealthPercent; // 0xa0c
};

struct UUIComponent_BattlePassChallengeLarge : UUIComponent_Display {
	ObjectProperty m_mcTitleTF; // 0x124
	ObjectProperty m_mcTierTF; // 0x12c
	ObjectProperty m_mcLabelTF; // 0x134
	ObjectProperty m_mcRewardTF; // 0x13c
	ObjectProperty m_mcExperienceTF; // 0x144
	ObjectProperty m_mcCurrencyIcon; // 0x14c
	ObjectProperty m_pGoalList; // 0x154
};

struct UUIComponent_CustomizeSlot : UUIComponent_Display {
	ObjectProperty m_mcName; // 0x124
	ObjectProperty m_mcRarity; // 0x12c
	ObjectProperty m_mcLock; // 0x134
	ObjectProperty m_pAvatar; // 0x13c
	ObjectProperty m_pIcon; // 0x144
	ObjectProperty m_pObtainability; // 0x14c
};

struct AFracturedStaticMeshPart : AFracturedStaticMeshActor {
	float DestroyPartRadiusFactor; // 0x314
	ObjectProperty BaseFracturedMeshActor; // 0x318
	char bHasBeenRecycled : 1; // 0x320
	char bChangeRBChannelWhenAsleep : 1; // 0x320
	char bCompositeThatExplodesOnImpact : 1; // 0x320
	float LastSpawnTime; // 0x324
	int32_t PartPoolIndex; // 0x328
	float FracPartGravScale; // 0x32c
	ERBCollisionChannel AsleepRBChannel; // 0x330
	FVector OldVelocity; // 0x334
	float CurrentVibrationLevel; // 0x340
	float LastImpactSoundTime; // 0x344
};

struct UUIComponent_ProgressBarRadial : UUIComponent_Display {
	int32_t m_nZeroPercentFrame; // 0x124
	int32_t m_nHundredPercentFrame; // 0x128
	float m_fAnimTime; // 0x12c
	float m_fAnimDelay; // 0x130
	float m_fCurrentPercent; // 0x134
	float m_fTargetPercent; // 0x138
	float m_fDeltaPercent; // 0x13c
	ObjectProperty m_mcMask; // 0x140
};

struct UUIComponent_LoadoutHeader : UUIComponent_Display {
	ObjectProperty m_Back; // 0x124
	ObjectProperty m_Prev; // 0x12c
	ObjectProperty m_Next; // 0x134
	ObjectProperty m_InputNext; // 0x13c
	ObjectProperty m_InputPrev; // 0x144
};

struct UTgAnimBlendByTag : UTgAnimNodeBlendList {
	TArray<FTagInfo> m_TagMap; // 0x168
};

struct USeqAct_AkLoadBank : USeqAct_Latent {
	char Async : 1; // 0x120
	char bWaitingCallback : 1; // 0x120
	ObjectProperty Bank; // 0x124
	int32_t Signal; // 0x12c
};

struct UUIComponent_ArcadeRankedProgress : UUIComponent_Display {
	ObjectProperty m_mcQueueName; // 0x124
	ObjectProperty m_mcRatingChange; // 0x12c
	ObjectProperty m_mcRatingImproved; // 0x134
	ObjectProperty m_pRating; // 0x13c
};

struct UUIAchievementPopups : UTgGfxScene {
	char m_bNewElementsQueued : 1; // 0x1ec
	TArray<FAchievementProgressData> m_rawProgressList; // 0x1f0
	TArray<FAchievementProgressData> m_queuedProgressList; // 0x200
	ObjectProperty m_pPopup; // 0x210
	ObjectProperty m_pUnlockedTF; // 0x218
	ObjectProperty m_pPointsTF; // 0x220
	ObjectProperty m_pNameTF; // 0x228
	ObjectProperty m_pDescriptionTF; // 0x230
	ObjectProperty m_pIconLoader; // 0x238
	ObjectProperty m_pProgressBar; // 0x240
	ObjectProperty m_pProgressBarMask; // 0x248
	ObjectProperty m_pProgressBarTF; // 0x250
	ObjectProperty m_pProgressBarFill; // 0x258
	float m_fDisplayTimer; // 0x260
	float m_fDelayTimer; // 0x264
};

struct ATgDevice_Lightspeed : ATgDevice {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xa04
};

struct UPathConstraint : UObject {
	int32_t CacheIdx; // 0x60
	ObjectProperty NextConstraint; // 0x64
};

struct UUIData_Name : UUIData {
	FName m_Value; // 0x64
};

struct UUIHudDecks : UTgGfxScene {
	char m_bPresentCharacterCustomizationWhenReady : 1; // 0x1ec
	char m_bPopup : 1; // 0x1ec
	int32_t m_nPassive; // 0x1f0
	int32_t m_nTalent; // 0x1f4
	TScriptInterface<Class> m_Loadout; // 0x1f8
	int32_t m_nTime; // 0x208
	int32_t m_nSelectLoadoutHandle; // 0x20c
	int32_t m_nStepNum; // 0x210
	ObjectProperty m_mcPopup; // 0x214
	ObjectProperty m_PopupEquip; // 0x21c
	ObjectProperty m_mcPopupTitle; // 0x224
	ObjectProperty m_mcPopupCard[0x5]; // 0x22c
	ObjectProperty m_mcPopupShadow[0x5]; // 0x254
	ObjectProperty m_mcBack; // 0x27c
	ObjectProperty m_mcBreadcrumbs[0x3]; // 0x284
	ObjectProperty m_mcBreadcrumbLines[0x2]; // 0x29c
	ObjectProperty m_mcTitle; // 0x2ac
	ObjectProperty m_mcSubtitle; // 0x2b4
	ObjectProperty m_mcTime; // 0x2bc
	ObjectProperty m_akEquip; // 0x2c4
	ObjectProperty m_DeckAbilityPools[0x8]; // 0x2cc
	ObjectProperty m_SelectedDeckAbilityPool; // 0x30c
	ObjectProperty m_pLoadoutsList; // 0x314
	ObjectProperty m_mcLoadoutTalent; // 0x31c
	ObjectProperty m_mcLoadoutTalentIcon; // 0x324
	ObjectProperty m_mcLoadoutTalentTF; // 0x32c
	ObjectProperty m_mcGameTip; // 0x334
	ObjectProperty m_mcGameTipTitle; // 0x33c
	ObjectProperty m_mcGameTipSubtitle; // 0x344
	ObjectProperty m_BackAction; // 0x34c
	ObjectProperty m_EquipAction; // 0x354
};

struct UUIHudResult : UTgGfxScene {
	char m_bRoundEnd : 1; // 0x1ec
	char m_bLoadingModel : 1; // 0x1ec
	char m_bMapOutroFinished : 1; // 0x1ec
	char m_bGameOver : 1; // 0x1ec
	char m_bGameWon : 1; // 0x1ec
	char m_bUsePlayOfTheGameIntroAnim : 1; // 0x1ec
	float m_fResultDisplayTime; // 0x1f0
	float m_fPlayOfTheGameTimer; // 0x1f4
	float m_fHomeTimer; // 0x1f8
	float m_fRoundTime; // 0x1fc
	float m_fRoundTimer; // 0x200
	float m_fAnimTimer; // 0x204
	int32_t m_nWinningTaskforce; // 0x208
	float m_fAsyncMeshLoadTimeout; // 0x20c
	float m_fIntroDuration; // 0x210
	float m_fPlayOfTheGameTimeoutDuration; // 0x214
	ObjectProperty m_mcBlocker; // 0x218
	ObjectProperty m_mcResult; // 0x220
	ObjectProperty m_mcResultEOR; // 0x228
	ObjectProperty m_mcResultTitle; // 0x230
	ObjectProperty m_mcResultTitleAnim; // 0x238
	ObjectProperty m_mcResultDefeat; // 0x240
	ObjectProperty m_mcResultVictory; // 0x248
	ObjectProperty m_mcResultVictorySpectator; // 0x250
	ObjectProperty m_mcResultPlayOfTheGameContainer; // 0x258
	ObjectProperty m_mcResultPlayOfTheGame; // 0x260
	ObjectProperty m_mcResultPlayOfTheGameBackground; // 0x268
	ObjectProperty m_mcResultPlayOfTheGamePlayerNameGroup; // 0x270
	ObjectProperty m_mcResultPlayOfTheGamePlayerName; // 0x278
	ObjectProperty m_pResultPlayOfTheGamePlayerName; // 0x280
	ObjectProperty m_mcResultPlayOfTheGamePlayerNameShadow; // 0x288
	ObjectProperty m_mcResultPlayOfTheGamePlayerTitle; // 0x290
	ObjectProperty m_mcResultPlayOfTheGamePlayerPortrait; // 0x298
	ObjectProperty m_mcResultPlayOfTheGamePlayerPortraitFrame; // 0x2a0
	ObjectProperty m_mcResultPlayOfTheGamePlayerPortraitIcon; // 0x2a8
	ObjectProperty m_mcResultPlayOfTheGamePlayerPortraitIconTexture; // 0x2b0
	ObjectProperty m_mcResultPlayOfTheGameChampionNameGroup; // 0x2b8
	ObjectProperty m_mcResultPlayOfTheGameChampionName; // 0x2c0
	ObjectProperty m_mcResultPlayOfTheGameChampionNameTF; // 0x2c8
	ObjectProperty m_mcResultPlayOfTheGameText; // 0x2d0
	ObjectProperty m_mcResultPlayOfTheGameTextAs; // 0x2d8
	int32_t m_nBasePotGXPos; // 0x2e0
	EPlayOfTheGameState m_ePlayOfTheGameState; // 0x2e4
	float m_fPlayOfTheGameStateTime; // 0x2e8
};

struct UUIComponent_MatchLobbySoundCues : UUIComponent_Display {
	ObjectProperty m_akSelect; // 0x124
	ObjectProperty m_akRollover; // 0x12c
	ObjectProperty m_akTabChange; // 0x134
	ObjectProperty m_akCountdown; // 0x13c
	ObjectProperty m_akLockInSelf; // 0x144
	ObjectProperty m_akLockInEnemy; // 0x14c
	ObjectProperty m_akLockInTeam; // 0x154
	int32_t m_nChampMatchStartTickHandle; // 0x15c
	int32_t m_nChampSelectTickHandle; // 0x160
	Fdword m_dwLastPlayedDraftAnnouncer; // 0x164
	int32_t m_nChampSelectHandle; // 0x168
};

struct UStaticMesh : UObject {
	TArray<FStaticMeshLODInfo> LODInfo; // 0x70
	float LODDistanceRatio; // 0x80
	float LODMaxRange; // 0x84
	int32_t LightMapResolution; // 0x98
	int32_t LightMapCoordinateIndex; // 0x9c
	ObjectProperty BodySetup; // 0xf8
	char UseSimpleLineCollision : 1; // 0x13c
	char UseSimpleBoxCollision : 1; // 0x140
	char UseSimpleRigidBodyCollision : 1; // 0x144
	char UseFullPrecisionUVs : 1; // 0x148
	char bUsedForInstancing : 1; // 0x14c
	int32_t ConsolePreallocateInstanceCount; // 0x150
	char bUseMaximumStreamingTexelRatio : 1; // 0x154
	char bPartitionForEdgeGeometry : 1; // 0x158
	char bCanBecomeDynamic : 1; // 0x15c
	char bStripComplexCollisionForConsole : 1; // 0x164
	char bStripComplexCollision : 1; // 0x168
	char bPerLODStaticLightingForInstancing : 1; // 0x16c
	float StreamingDistanceMultiplier; // 0x170
};

struct UAnimNodeBlendBase : UAnimNode {
	TArray<FAnimBlendChild> Children; // 0xfc
	char bFixNumChildren : 1; // 0x10c
	char m_bForceChildToLoop : 1; // 0x10c
	AlphaBlendType BlendType; // 0x110
};

struct UParticleModuleMaterialByParameter : UParticleModuleMaterialBase {
	TArray<FName> MaterialParameters; // 0x68
	TArray<ObjectProperty> DefaultMaterials; // 0x78
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x24c
	int32_t SectionBaseY; // 0x250
	int32_t ComponentSizeQuads; // 0x254
	int32_t SubsectionSizeQuads; // 0x258
	int32_t NumSubsections; // 0x25c
	ObjectProperty OverrideMaterial; // 0x260
	ObjectProperty MaterialInstance; // 0x268
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x270
	TArray<ObjectProperty> WeightmapTextures; // 0x280
	FIndirectArray_Mirror WeightmapData; // 0x290
	FVector4 WeightmapScaleBias; // 0x2a0
	float WeightmapSubsectionOffset; // 0x2b0
	FVector4 HeightmapScaleBias; // 0x2c0
	ObjectProperty HeightmapTexture; // 0x2d0
	FBoxSphereBounds CachedBoxSphereBounds; // 0x2d8
	FBox CachedLocalBox; // 0x2f4
	TArray<ObjectProperty> ShadowMaps; // 0x310
	TArray<FGuid> IrrelevantLights; // 0x320
	FLightMapRef LightMap; // 0x330
	FPointer EditToolRenderData; // 0x338
	int32_t CollisionMipLevel; // 0x340
	FPointer PlatformData; // 0x344
	int32_t PlatformDataSize; // 0x34c
	char bNeedPostUndo : 1; // 0x350
	int32_t ForcedLOD; // 0x354
	char NeighborLOD[0x8]; // 0x358
	char NeighborLODBias[0x8]; // 0x360
	int32_t LODBias; // 0x368
};

struct ATgCapturePoint : AActor {
	ObjectProperty s_CollisionProxy; // 0x280
	ObjectProperty r_RepInfo; // 0x288
	float m_fCollisionProxyRadius; // 0x290
	float m_fCollisionProxyHeight; // 0x294
	float m_fBaseTransitionSpeed; // 0x298
	float m_fTransitionSpeedBuff; // 0x29c
	float m_fCurrentTransitionSpeed; // 0x2a0
	ObjectProperty c_OwnershipChangedKismetNode; // 0x2a4
	ObjectProperty s_BotSpawners[0x2]; // 0x2ac
	ObjectProperty m_CurrentBotSpawners[0x2]; // 0x2bc
	ObjectProperty s_NeutralBotSpawner; // 0x2cc
	int32_t m_CapturePointIndex; // 0x2d4
	float s_fReplenishBotTime; // 0x2d8
	float s_fRemainingReplenishBotTime; // 0x2dc
	float s_fFriendlyReplenishBuffPct; // 0x2e0
	float m_fRegenUpdateTimer; // 0x2e4
	float m_fOwnedManaRegen; // 0x2e8
	float m_fOwnedHealthRegen; // 0x2ec
	ObjectProperty s_GameInfo; // 0x2f0
	int32_t m_nTF1Count; // 0x2f8
	int32_t m_nTF2Count; // 0x2fc
	float m_fLastEnemyKillVoxTimestamp; // 0x300
	int32_t m_nLaneNumber; // 0x304
	ComponentProperty m_WorldIconSprite; // 0x308
};

struct ATgPawn_Corrupter : ATgPawn_Character {
	ObjectProperty m_SpinDevice; // 0x3160
	ObjectProperty m_InHandDevice; // 0x3168
	ObjectProperty m_CachedLatch; // 0x3170
	ObjectProperty m_CorruptionPassive; // 0x3178
	ObjectProperty m_UltDevice; // 0x3180
	int32_t r_nCorruptionStacks; // 0x3188
	int32_t nMaxCorruption; // 0x318c
	int32_t nAmountToHealPerStack; // 0x3190
	int32_t c_nPoolMeshID; // 0x3194
	int32_t c_nNormalMeshID; // 0x3198
	float m_PreviousZHeight; // 0x319c
	float m_GravityMultiplier; // 0x31a0
	char m_bRenderPool : 1; // 0x31a4
	char m_bForced3PDuringPool : 1; // 0x31a4
	char m_bForcingMeshTransition : 1; // 0x31a4
	char r_bAbility1CanEmote : 1; // 0x31a4
};

struct UUICharacterSummary : UUIResourceDataProvider {
	FString ClassPathName; // 0x94
	FString CharacterName; // 0xa4
	FString CharacterBio; // 0xb4
	char bIsDisabled : 1; // 0xc4
};

struct UTgControlModule_Stoker : UTgControlModule_ThirdPerson {
	ObjectProperty m_CachedStokerPawn; // 0xcc
};

struct UMaterialExpressionMultiply : UMaterialExpression {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct UUIPurchase : UTgGfxScene {
	int32_t m_nPurchaseItem; // 0x1ec
	int32_t m_nPurchaseType; // 0x1f0
	int32_t m_nPurchaseBundle; // 0x1f4
	int32_t m_nPurchaseVendor; // 0x1f8
	int32_t m_nPurchaseLootItem; // 0x1fc
	int32_t m_nPurchaseQuantity; // 0x200
	FQWord m_qwPurchaseCustomData; // 0x204
	char m_bHasBonusItem : 1; // 0x20c
	char m_bIsMultiPurchase : 1; // 0x20c
	int32_t m_nBonusItem; // 0x210
	int32_t m_nBonusType; // 0x214
	int32_t m_nBonusBundle; // 0x218
	int32_t m_nBonusVendor; // 0x21c
	int32_t m_nBonusLootItem; // 0x220
	int32_t m_eCurrencyUsed; // 0x224
	int32_t m_nCurrentTab; // 0x228
	int32_t m_nCurrentCoupon; // 0x22c
	float m_fPurchaseDelay; // 0x230
	float m_fPurchaseTimeout; // 0x234
	FString m_lsMultiPurchaseTitle; // 0x238
	FString m_lsMultiPurchaseSubTitle; // 0x248
	ObjectProperty m_pSelectedPrice; // 0x258
	ObjectProperty m_mcWait; // 0x260
	ObjectProperty m_mcTitle; // 0x268
	ObjectProperty m_mcCursor; // 0x270
	ObjectProperty m_mcCancel; // 0x278
	ObjectProperty m_mcSpinner; // 0x280
	ObjectProperty m_mcSubtitle; // 0x288
	ObjectProperty m_mcBooster; // 0x290
	ObjectProperty m_mcTab[0x2]; // 0x298
	ObjectProperty m_mcTabSelected[0x2]; // 0x2a8
	ObjectProperty m_mcTabHighlight[0x2]; // 0x2b8
	ObjectProperty m_mcDivider[0x2]; // 0x2c8
	ObjectProperty m_mcCouponSelect; // 0x2d8
	ObjectProperty m_mcCouponSelectArrow0; // 0x2e0
	ObjectProperty m_mcCouponSelectArrow1; // 0x2e8
	ObjectProperty m_mcCouponSelectIcon; // 0x2f0
	ObjectProperty m_mcCouponSelectTF; // 0x2f8
	ObjectProperty m_mcCouponSelectHighlight; // 0x300
	ObjectProperty m_mcBlocker; // 0x308
	ObjectProperty m_mcBoosterItem; // 0x310
	FUIAcquiredItem m_BoosterItemDisplay; // 0x318
	ObjectProperty m_BoosterItemInfo; // 0x420
	ObjectProperty m_HoldPrompt; // 0x428
	ObjectProperty m_PriceOptionList; // 0x430
	ObjectProperty m_grScreen; // 0x438
	ObjectProperty m_PlayerCurrency; // 0x440
	ObjectProperty m_ChampionPackAd; // 0x448
	ObjectProperty m_ChampionPackButton; // 0x450
	ObjectProperty m_ChampionPackData; // 0x458
	ObjectProperty m_ChampionPackPrompt; // 0x460
	ObjectProperty m_Carousel; // 0x468
	TArray<FUIAcquiredItem> m_PurchaseItems; // 0x470
	TArray<ObjectProperty> m_PurchaseTabPrices; // 0x480
	TArray<ObjectProperty> m_RentalTabPrices; // 0x490
	TArray<ObjectProperty> m_MultiPurchaseItems; // 0x4a0
	ObjectProperty m_akPurchaseItem; // 0x4b0
	int32_t m_nEquipByBoostingID; // 0x4b8
};

struct UGameViewportClient : UScriptViewportClient {
	FPointer VfTable_FExec; // 0x68
	FPointer Viewport; // 0x70
	FPointer ViewportFrame; // 0x78
	TArray<ObjectProperty> GlobalInteractions; // 0x80
	UUIInteraction* UIControllerClass; // 0x90
	ObjectProperty UIController; // 0x98
	ObjectProperty ViewportConsole; // 0xa0
	FExportShowFlags_Mirror ShowFlags; // 0xa8
	FString LoadingMessage; // 0xb8
	FString SavingMessage; // 0xc8
	FString ConnectingMessage; // 0xd8
	FString PausedMessage; // 0xe8
	FString PrecachingMessage; // 0xf8
	char bShowTitleSafeZone : 1; // 0x108
	char bDisplayHardwareMouseCursor : 1; // 0x108
	char bOverrideDiffuseAndSpecular : 1; // 0x108
	char bIsPlayInEditorViewport : 1; // 0x108
	char bShowSystemMouseCursor : 1; // 0x108
	char bDisableWorldRendering : 1; // 0x108
	char bCapturedWorldRendering : 1; // 0x108
	char bDebugNoGFxUI : 1; // 0x108
	FTitleSafeZoneArea TitleSafeZone; // 0x10c
	TArray<FSplitscreenData> SplitscreenInfo; // 0x11c
	ESplitScreenType DesiredSplitscreenType; // 0x12c
	ESplitScreenType ActiveSplitscreenType; // 0x12d
	ESplitScreenType Default2PSplitType; // 0x12e
	ESplitScreenType Default3PSplitType; // 0x12f
	FString ProgressMessage[0x2]; // 0x130
	float ProgressTimeOut; // 0x150
	float ProgressFadeTime; // 0x154
	TArray<FDebugDisplayProperty> DebugProperties; // 0x158
	FPointer ScaleformInteraction; // 0x168
	FPointer PreviousFrameViewFamily; // 0x170
	DelegateProperty __HandleInputKey__Delegate; // 0x178
	DelegateProperty __HandleInputAxis__Delegate; // 0x188
	DelegateProperty __HandleInputChar__Delegate; // 0x198
};

struct ATgDeploy_ChurchillShield : ATgDeploy_Shield {
	float m_fMinPitch; // 0x470
};

struct UTgDeviceForm_MinigunSpinUp : UTgDeviceForm {
	ObjectProperty m_SpinnerSkelControl1P; // 0x28c
	ObjectProperty m_SpinnerSkelControl3P; // 0x294
};

struct USVehicleWheel : UComponent {
	float Steer; // 0x70
	float MotorTorque; // 0x74
	float BrakeTorque; // 0x78
	float ChassisTorque; // 0x7c
	char bPoweredWheel : 1; // 0x80
	char bHoverWheel : 1; // 0x80
	char bCollidesVehicles : 1; // 0x80
	char bCollidesPawns : 1; // 0x80
	char bIsSquealing : 1; // 0x80
	char bWheelOnGround : 1; // 0x80
	float SteerFactor; // 0x84
	FName SkelControlName; // 0x88
	ObjectProperty WheelControl; // 0x90
	FName BoneName; // 0x98
	FVector BoneOffset; // 0xa0
	float WheelRadius; // 0xac
	float SuspensionTravel; // 0xb0
	float SuspensionSpeed; // 0xb4
	ObjectProperty WheelParticleSystem; // 0xb8
	EWheelSide Side; // 0xc0
	float LongSlipFactor; // 0xc4
	float LatSlipFactor; // 0xc8
	float HandbrakeLongSlipFactor; // 0xcc
	float HandbrakeLatSlipFactor; // 0xd0
	float ParkedSlipFactor; // 0xd4
	FVector WheelPosition; // 0xd8
	float SpinVel; // 0xe4
	float LongSlipRatio; // 0xe8
	float LatSlipAngle; // 0xec
	FVector ContactNormal; // 0xf0
	FVector LongDirection; // 0xfc
	FVector LatDirection; // 0x108
	float ContactForce; // 0x114
	float LongImpulse; // 0x118
	float LatImpulse; // 0x11c
	float DesiredSuspensionPosition; // 0x120
	float SuspensionPosition; // 0x124
	float CurrentRotation; // 0x128
	FPointer WheelShape; // 0x12c
	int32_t WheelMaterialIndex; // 0x134
	UParticleSystemComponent* WheelPSCClass; // 0x138
	ComponentProperty WheelParticleComp; // 0x140
	FName SlipParticleParamName; // 0x148
};

struct AAmbientSoundSimple : AAmbientSound {
	ObjectProperty AmbientProperties; // 0x294
	ObjectProperty SoundCueInstance; // 0x29c
	ObjectProperty SoundNodeInstance; // 0x2a4
};

struct UTgInventoryObject_Listen_CombatRepair : UTgInvListener {
	ObjectProperty m_CachedPawnOwner; // 0xc4
};

struct UAnimNodePlayCustomAnim : UAnimNodeBlend {
	char bIsPlayingCustomAnim : 1; // 0x124
	float CustomPendingBlendOutTime; // 0x128
};

struct UTgAIBehaviorComposite : UTgAIBehaviorNode {
	TArray<ObjectProperty> Children; // 0x94
	TArray<int32_t> ChildrenIndices; // 0xa4
	char bCompleteOnAll : 1; // 0xb4
	char bFailsOnAll : 1; // 0xb4
	char bRetryFailedChild : 1; // 0xb4
	char bFixedChildrenSize : 1; // 0xb4
};

struct ATgDeploy_Molotov : ATgDeploy_EffectSpots {
	TArray<FMolotovPointInfo> m_PointInfos; // 0x1a88
	FMolotovCenterInfo m_CenterInfo; // 0x1a98
	TArray<FMolotovTriangleInfo> m_TriInfos; // 0x1ae0
	TArray<FMolotovStrandInfo> m_StrandInfos; // 0x1af0
	FMolotovGrowthInfo m_GrowthInfo; // 0x1b00
	FMolotovGeneralSettings m_Settings; // 0x1b1c
};

struct UTgInvListener_SoulChargesConsumed : UTgInventoryObject_Listen_AbilityProcBase {
	char m_bIsListenerActive : 1; // 0xcc
	int32_t m_nNumSoulCharges; // 0xd0
};

struct UTgDeviceForm_Dominance : UTgDeviceForm {
	ObjectProperty m_SKCFlagScale; // 0x28c
};

struct UOnlineStatsRead : UOnlineStats {
	FString LeaderboardName; // 0x84
};

struct UUIDataChampions : UUIDataObject {
	ObjectProperty m_pActiveChampion; // 0x74
	TArray<ObjectProperty> m_Champions; // 0x7c
	TArray<ObjectProperty> m_InstallingChampions; // 0x8c
	TArray<ObjectProperty> m_PvEChampions; // 0x9c
	TArray<ObjectProperty> m_Collections; // 0xac
	TMap<None, None> m_PerChampionCollections; // 0xbc
	TMap<None, None> m_ChampionIdToData; // 0x104
	TMap<None, None> m_BotIdToVoicePackId; // 0x14c
	Fdword m_dwStoreVendorsRequestId; // 0x194
	Fdword m_dwRotationVendorRequestId; // 0x198
	float m_fInstallCheckTimer; // 0x19c
	float m_fInstallCheckInterval; // 0x1a0
	char m_bRotationVendorFullyLoadedCalled : 1; // 0x1a4
	char m_bStoreChampionsCalled : 1; // 0x1a4
};

struct UTgAnimBlendBySkin : UTgAnimNodeBlendList {
	TArray<FSkinChildInfo> m_SkinMap; // 0x168
};

struct ATgGame_Arena_Capture : ATgGame_Arena {
	int32_t s_nCaptureHostilePointXP; // 0x798
	int32_t s_nCaptureHostilePointGold; // 0x79c
	int32_t s_nReclaimPointXP; // 0x7a0
	int32_t s_nReclaimPointGold; // 0x7a4
	int32_t m_nCurrentActiveCapturePointIndex; // 0x7a8
	float m_fNewPointTime; // 0x7ac
};

struct UAnimNodeBlendMultiBone : UAnimNodeBlendBase {
	TArray<FChildBoneBlendInfo> BlendTargetList; // 0x114
	TArray<char> SourceRequiredBones; // 0x124
};

struct UTgAchievement_MitigateDuringAbility : UTgAchievement {
	ObjectProperty m_CachedDevice; // 0x94
};

struct USkelControlLimb : USkelControlBase {
	FVector EffectorLocation; // 0xd0
	EBoneControlSpace EffectorLocationSpace; // 0xdc
	EBoneControlSpace JointTargetLocationSpace; // 0xdd
	EBoneControlSpace JointOffsetSpace; // 0xde
	EAxis BoneAxis; // 0xdf
	EAxis JointAxis; // 0xe0
	FName EffectorSpaceBoneName; // 0xe4
	FVector JointTargetLocation; // 0xec
	FName JointTargetSpaceBoneName; // 0xf8
	FVector JointOffset; // 0x100
	FName JointOffsetBoneName; // 0x10c
	char bInvertBoneAxis : 1; // 0x114
	char bInvertJointAxis : 1; // 0x114
	char bRotateJoint : 1; // 0x114
	char bMaintainEffectorRelRot : 1; // 0x114
	char bTakeRotationFromEffectorSpace : 1; // 0x114
	char bAllowStretching : 1; // 0x114
	char m_bSnapEffectorToBoneLocation : 1; // 0x114
	FVector2D StretchLimits; // 0x118
	FName StretchRollBoneName; // 0x120
};

struct ATgModifyPawnPropertiesVolume : AVolume {
	int32_t m_nMapObjectId; // 0x2bc
	char m_bDisableJump : 1; // 0x2c0
	char m_bDisableBlockActors : 1; // 0x2c0
	char m_bDisableHanging : 1; // 0x2c0
	char m_bDisableAllDevices : 1; // 0x2c0
	char m_bTriggerUseEvent : 1; // 0x2c0
	char m_bOneWayMovement : 1; // 0x2c0
	FRotator m_vOnewWay; // 0x2c4
	ComponentProperty m_DirArrow; // 0x2d0
	int32_t s_nLootTableId; // 0x2d8
};

struct UUIComponent_EndOfMatchLobbyQuests : UUIComponent_Display {
	ObjectProperty m_mcQuestCount; // 0x124
	ObjectProperty m_pQuestPanels; // 0x12c
	ObjectProperty m_grQuests; // 0x134
};

struct UTgAchievement_DeviceHealing : UTgAchievement {
	int32_t m_nHealingDealt; // 0x94
};

struct APComVideoPlayer : AActor {
	FString VideoURL; // 0x280
	int32_t Width; // 0x290
	int32_t Height; // 0x294
	float Volume; // 0x298
	char bAutoResize : 1; // 0x29c
	char bConstrainAspectRatio : 1; // 0x29c
	char bDebugRender : 1; // 0x29c
	char bVideoFinished : 1; // 0x29c
	char bOnVideoFinishedIssued : 1; // 0x29c
	char bHasMinorStreamingProblem : 1; // 0x29c
	float ConstrainedAspectRatio; // 0x2a0
	FPointer Resource; // 0x2a4
	ObjectProperty RenderTargetToUse; // 0x2ac
	ObjectProperty TextureCopyForStreamingProblem; // 0x2b4
	float TimeSinceMinorStreamingProblem; // 0x2bc
	ObjectProperty StreamingProblemMaterial; // 0x2c0
	EPComVideoPlayerError CurrentErrorState; // 0x2c8
	EPComVideoPlayerError RenderThreadErrorState; // 0x2c9
	ObjectProperty BlackTexture; // 0x2cc
	DelegateProperty __OnVideoFinished__Delegate; // 0x2d4
	DelegateProperty __OnVideoError__Delegate; // 0x2e4
};

struct UTgSynchronizedTimer : UGFxObject {
	char m_bPausedByGame : 1; // 0x104
	char m_bSuppressCallback : 1; // 0x104
	char m_bRunning : 1; // 0x104
	char m_bPaused : 1; // 0x104
	ObjectProperty m_MP; // 0x108
	ObjectProperty m_TimerManager; // 0x110
};

struct UUIScene_UISummerEvent : UUIScene {
	ObjectProperty m_pTabs; // 0x1cc
	ObjectProperty m_pBack; // 0x1d4
	ObjectProperty m_pHome; // 0x1dc
	ObjectProperty m_pVault; // 0x1e4
	ObjectProperty m_pRewards; // 0x1ec
	ObjectProperty m_pOverview; // 0x1f4
	ObjectProperty m_pRotator; // 0x1fc
};

struct ATgAIController_BehaviorMapNpc : ATgAIController_Behavior {
	TArray<FThreatEntry> ThreatList; // 0x930
	char bThreatListDecays : 1; // 0x940
	char bOutsideLeash : 1; // 0x940
	char bHadCombatTarget : 1; // 0x940
	float LeashDistance; // 0x944
	ObjectProperty LeashVolume; // 0x948
	TArray<ObjectProperty> LeashActors; // 0x950
};

struct UUIScene_UIPopupDeal : UUIScene {
	ObjectProperty m_mcTitle; // 0x1cc
	ObjectProperty m_pDealPanel; // 0x1d4
	ObjectProperty m_pOkButton; // 0x1dc
	ObjectProperty m_pCancelButton; // 0x1e4
};

struct ATgDevice_CorvusUltFire : ATgDevice {
	ObjectProperty m_CorvusUltDevice; // 0xa04
	float m_fTraceDownDistance; // 0xa0c
};

struct UTgAIBehaviorCondition_CombatTargetHealthPercent : UTgAIBehaviorCondition {
	float HealthPct; // 0x98
};

struct AInventory : AActor {
	ObjectProperty Inventory; // 0x280
	ObjectProperty InvManager; // 0x288
	FString ItemName; // 0x290
	char bDropOnDeath : 1; // 0x2a0
	char bDelayedSpawn : 1; // 0x2a0
	char bPredictRespawns : 1; // 0x2a0
	float RespawnTime; // 0x2a4
	float MaxDesireability; // 0x2a8
	FString PickupMessage; // 0x2ac
	ObjectProperty PickupSound; // 0x2bc
	FString PickupForce; // 0x2c4
	ADroppedPickup* DroppedPickupClass; // 0x2d4
	ComponentProperty DroppedPickupMesh; // 0x2dc
	ComponentProperty PickupFactoryMesh; // 0x2e4
	ComponentProperty DroppedPickupParticles; // 0x2ec
};

struct USeqAct_MultiplyFloat : USeqAct_SetSequenceVariable {
	float ValueA; // 0x108
	float ValueB; // 0x10c
	float FloatResult; // 0x110
	int32_t IntResult; // 0x114
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x74
	float PitchMax; // 0x78
	float VolumeMin; // 0x7c
	float VolumeMax; // 0x80
	FRawDistributionFloat PitchModulation; // 0x84
	FRawDistributionFloat VolumeModulation; // 0xa8
};

struct UUIComponent_RankedProgress : UUIComponent_Display {
	ObjectProperty m_mcName; // 0x124
	ObjectProperty m_mcRank; // 0x12c
	ObjectProperty m_mcWins; // 0x134
	ObjectProperty m_mcLosses; // 0x13c
	ObjectProperty m_mcTier; // 0x144
	ObjectProperty m_mcTPLabel; // 0x14c
	ObjectProperty m_mcTP; // 0x154
	ObjectProperty m_pProgress; // 0x15c
};

struct UUIComponent_BannerButton : UUIComponent_Interactable {
	ObjectProperty m_pGamepadKey; // 0x140
	ObjectProperty m_pFrameButton; // 0x148
};

struct UUIWebBrowser : UTgGfxScene {
	char m_bAutoClose : 1; // 0x1ec
	char m_bDrawBorder : 1; // 0x1ec
	ObjectProperty m_mcFrame; // 0x1f0
	ObjectProperty m_mcBrowserShape; // 0x1f8
	ObjectProperty m_mcBackButton; // 0x200
	ObjectProperty m_mcForwardButton; // 0x208
	ObjectProperty m_mcCloseButton; // 0x210
};

struct UUIDataStore_OnlinePlaylists : UUIDataStore {
	FString ProviderClassName; // 0x98
	UUIResourceDataProvider* ProviderClass; // 0xa8
	TArray<ObjectProperty> RankedDataProviders; // 0xb0
	TArray<ObjectProperty> UnrankedDataProviders; // 0xc0
	TArray<ObjectProperty> RecModeDataProviders; // 0xd0
	TArray<ObjectProperty> PrivateDataProviders; // 0xe0
	ObjectProperty PlaylistMan; // 0xf0
};

struct UNavMeshGoalFilter_OutSideOfDotProductWedge : UNavMeshGoal_Filter {
	FVector Location; // 0x6c
	FVector Rotation; // 0x78
	float Epsilon; // 0x84
};

struct ATgDevice_Scout : ATgDevice {
	ObjectProperty m_CachedPawnOwner; // 0xa04
	TArray<ObjectProperty> m_AlliesScouted; // 0xa0c
	TArray<ObjectProperty> m_EnemiesScouted; // 0xa1c
	float m_fScoutRefreshTime; // 0xa2c
};

struct UTgAIBehaviorCondition_TimeSinceLastTookDamage : UTgAIBehaviorCondition {
	float TimeThreshold; // 0x98
	char bMustBeCombatTarget : 1; // 0x9c
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	float R; // 0xb0
	float G; // 0xb4
	float B; // 0xb8
};

struct USoundNodeDelay : USoundNode {
	float DelayMin; // 0x74
	float DelayMax; // 0x78
	FRawDistributionFloat DelayDuration; // 0x7c
};

struct UTgAnimBlendByNodeName : UTgAnimNodeBlendList {
	TArray<FNodeNameToChildIndex> m_NodeNameToChildIndex; // 0x168
	TArray<FRelevantNodeNameNodes> m_CachedNodes; // 0x178
	ObjectProperty m_LastSuccessfulAnimNode; // 0x188
	char m_bHasCachedNodes : 1; // 0x190
};

struct UTgAIUtilityFilter_InsideActiveRallyPoint : UTgAIUtilityFilter {
	char bAllowEnemyRally : 1; // 0xc0
};

struct APlayerController : AController {
	ObjectProperty Player; // 0x470
	ObjectProperty PlayerCamera; // 0x478
	ACamera* CameraClass; // 0x480
	char bFrozen : 1; // 0x488
	char bPressedJump : 1; // 0x488
	char bDoubleJump : 1; // 0x488
	char bUpdatePosition : 1; // 0x488
	char bUpdating : 1; // 0x488
	char bNeverSwitchOnPickup : 1; // 0x488
	char bCheatFlying : 1; // 0x488
	char bCameraPositionLocked : 1; // 0x488
	char bShortConnectTimeOut : 0; // 0x488
	char bPendingDestroy : 0; // 0x488
	char bWasSpeedHack : 0; // 0x488
	char bWasSaturated : 0; // 0x488
	char bAimingHelp : 0; // 0x488
	char bCameraCut : 0; // 0x488
	char bClientSimulatingViewTarget : 0; // 0x488
	char bHasVoiceHandshakeCompleted : 0; // 0x488
	char bCanPlayOnline : 0; // 0x488
	char bCanShareUserCreatedContent : 0; // 0x488
	char bCanCommunicateVoice : 0; // 0x488
	char bPrivilegesInitialized : 0; // 0x488
	char bIsCrossPlayEnabled : 0; // 0x488
	char bCinematicMode : 0; // 0x488
	char bInteractiveMode : 0; // 0x488
	char bCinemaDisableInputMove : 0; // 0x488
	char bCinemaDisableInputLook : 0; // 0x488
	char bRenderHUDFullScreen : 0; // 0x488
	char bIgnoreNetworkMessages : 0; // 0x488
	char bShowKismetDrawText : 0; // 0x488
	char bAcceptSendCorrections : 0; // 0x488
	char bReplicateAllPawns : 0; // 0x488
	char bIsUsingStreamingVolumes : 0; // 0x488
	char bIsExternalUIOpen : 0; // 0x488
	char bIsControllerConnected : 1; // 0x48c
	char bCheckSoundOcclusion : 1; // 0x48c
	char bDebugCameraAnims : 1; // 0x48c
	char bBlockCameraAnimsFromOverridingPostProcess : 1; // 0x48c
	char bLogHearSoundOverflow : 1; // 0x48c
	char bShowMoveErrors : 1; // 0x48c
	char bCheckRelevancyThroughPortals : 1; // 0x48c
	char bDebugClientAdjustPosition : 1; // 0x48c
	char bIsInTimelapse : 0; // 0x48c
	char bIsTimelapsePlayOfTheGame : 0; // 0x48c
	float MaxResponseTime; // 0x490
	float WaitDelay; // 0x494
	ObjectProperty AcknowledgedPawn; // 0x498
	EDoubleClickDir DoubleClickDir; // 0x4a0
	char bIgnoreMoveInput; // 0x4a1
	char bIgnoreLookInput; // 0x4a2
	char bRun; // 0x4a3
	char bDuck; // 0x4a4
	char NetPlayerIndex; // 0x4a5
	ObjectProperty ViewTarget; // 0x4a8
	ObjectProperty RealViewTarget; // 0x4b0
	ObjectProperty ControllingDirTrackInst; // 0x4b8
	float FOVAngle; // 0x4c0
	float DesiredFOV; // 0x4c4
	float DefaultFOV; // 0x4c8
	float LODDistanceFactor; // 0x4cc
	FRotator TargetViewRotation; // 0x4d0
	float TargetEyeHeight; // 0x4dc
	FRotator BlendedTargetViewRotation; // 0x4e0
	ObjectProperty myHUD; // 0x4ec
	ObjectProperty mySecondaryHUD; // 0x4f4
	USavedMove* SavedMoveClass; // 0x4fc
	ObjectProperty SavedMoves; // 0x504
	ObjectProperty FreeMoves; // 0x50c
	ObjectProperty PendingMove; // 0x514
	FVector LastAckedAccel; // 0x51c
	float CurrentTimeStamp; // 0x528
	float LastUpdateTime; // 0x52c
	float ServerTimeStamp; // 0x530
	float TimeMargin; // 0x534
	float ClientUpdateTime; // 0x538
	float MaxTimeMargin; // 0x53c
	float LastActiveTime; // 0x540
	int32_t ClientCap; // 0x544
	float DynamicPingThreshold; // 0x548
	float LastPingUpdate; // 0x54c
	float LastSpeedHackLog; // 0x550
	FClientAdjustment PendingAdjustment; // 0x554
	int32_t GroundPitch; // 0x58c
	ObjectProperty CheatManager; // 0x590
	UCheatManager* CheatClass; // 0x598
	ObjectProperty PlayerInput; // 0x5a0
	UPlayerInput* InputClass; // 0x5a8
	FVector FailedPathStart; // 0x5b0
	ComponentProperty CylinderComponent; // 0x5bc
	FString ForceFeedbackManagerClassName; // 0x5c4
	ObjectProperty ForceFeedbackManager; // 0x5d4
	TArray<ObjectProperty> Interactions; // 0x5dc
	TArray<FUniqueNetId> VoiceMuteList; // 0x5ec
	TArray<FUniqueNetId> GameplayVoiceMuteList; // 0x5fc
	TArray<FUniqueNetId> VoicePacketFilter; // 0x60c
	TArray<FConnectedPeerInfo> ConnectedPeers; // 0x61c
	TArray<FUniqueNetId> BestNextHostPeers; // 0x62c
	ObjectProperty MigratedSearchToJoin; // 0x63c
	ObjectProperty OnlineSub; // 0x644
	TScriptInterface<Class> VoiceInterface; // 0x64c
	ObjectProperty OnlinePlayerData; // 0x65c
	float InteractDistance; // 0x664
	FName DelayedJoinSessionName; // 0x668
	TArray<FInputMatchRequest> InputRequests; // 0x670
	float LastBroadcastTime; // 0x680
	FString LastBroadcastString[0x4]; // 0x684
	TArray<FName> PendingMapChangeLevelNames; // 0x6c4
	ObjectProperty MyCoverReplicator; // 0x6d4
	TArray<FDebugTextInfo> DebugTextList; // 0x6dc
	float SpectatorCameraSpeed; // 0x6ec
	ObjectProperty PendingSwapConnection; // 0x6f0
	float MinRespawnDelay; // 0x6f8
	int32_t MaxConcurrentHearSounds; // 0x6fc
	TArray<ComponentProperty> HearSoundActiveComponents; // 0x700
	TArray<ComponentProperty> HearSoundPoolComponents; // 0x710
	TArray<ObjectProperty> HiddenActors; // 0x720
	float m_RigidBodyMaxPositionErrorThreshold; // 0x730
	float LastSpectatorStateSynchTime; // 0x734
	FColor CurrentUpdateDebugColor; // 0x738
	DelegateProperty __OnMissingPeersUnregistered__Delegate; // 0x73c
	DelegateProperty __CanUnpause__Delegate; // 0x74c
	DelegateProperty __InputMatchDelegate__Delegate; // 0x75c
};

struct ATgDevice_Headhunter : ATgDevice_Stim {
	ObjectProperty m_CachedInhandDevice; // 0xa04
	ObjectProperty m_CachedSniperModeDevice; // 0xa0c
	char m_bCamFXEnabled : 1; // 0xa14
};

struct UFracturedStaticMesh : UStaticMesh {
	float CoreMeshScale; // 0x1dc
	char bSliceUsingCoreCollision : 1; // 0x210
	ObjectProperty FragmentDestroyEffect; // 0x214
	TArray<ObjectProperty> FragmentDestroyEffects; // 0x21c
	float FragmentDestroyEffectScale; // 0x22c
	float FragmentHealthScale; // 0x230
	float FragmentMinHealth; // 0x234
	float FragmentMaxHealth; // 0x238
	char bUniformFragmentHealth : 1; // 0x23c
	float ChunkLinVel; // 0x240
	float ChunkAngVel; // 0x244
	float ChunkLinHorizontalScale; // 0x248
	float ExplosionVelScale; // 0x24c
	char bCompositeChunksExplodeOnImpact : 1; // 0x250
	char bFixIsolatedChunks : 1; // 0x254
	char bAlwaysBreakOffIsolatedIslands : 1; // 0x258
	char bSpawnPhysicsChunks : 1; // 0x25c
	float ChanceOfPhysicsChunk; // 0x260
	float ExplosionChanceOfPhysicsChunk; // 0x264
	float NormalPhysicsChunkScaleMin; // 0x268
	float NormalPhysicsChunkScaleMax; // 0x26c
	float ExplosionPhysicsChunkScaleMin; // 0x270
	float ExplosionPhysicsChunkScaleMax; // 0x274
	float MinConnectionSupportArea; // 0x278
	ObjectProperty DynamicOutsideMaterial; // 0x27c
	ObjectProperty LoseChunkOutsideMaterial; // 0x284
	int32_t OutsideMaterialIndex; // 0x28c
};

struct ATgDevice_CorrupterSiphon : ATgDevice {
	ObjectProperty m_Corrupter; // 0xa04
};

struct UTgDeviceForm_VanguardGrab : UTgDeviceForm {
	TArray<ObjectProperty> m_VanguardGrabNodes3p; // 0x28c
	ObjectProperty m_Target; // 0x29c
	int32_t m_nPosture; // 0x2a4
};

struct UUIComponent_RolledSubItem : UUIComponent_Display {
	ObjectProperty m_mcDuplicate; // 0x124
	ObjectProperty m_pReplacementCurrency; // 0x12c
	ObjectProperty m_pItem; // 0x134
};

struct AMobileHUD : AHUD {
	char bShowGameHud : 1; // 0x5a0
	char bShowMobileHud : 1; // 0x5a0
	char bForceMobileHUD : 1; // 0x5a0
	char bShowMobileTilt : 1; // 0x5a0
	char bDebugTouches : 1; // 0x5a0
	char bDebugZones : 1; // 0x5a0
	char bDebugZonePresses : 1; // 0x5a0
	char bShowMotionDebug : 1; // 0x5a0
	ObjectProperty JoystickBackground; // 0x5a4
	FTextureUVs JoystickBackgroundUVs; // 0x5ac
	ObjectProperty JoystickHat; // 0x5bc
	FTextureUVs JoystickHatUVs; // 0x5c4
	ObjectProperty ButtonImages[0x2]; // 0x5d4
	FTextureUVs ButtonUVs[0x2]; // 0x5e4
	ObjectProperty ButtonFont; // 0x604
	FColor ButtonCaptionColor; // 0x60c
	ObjectProperty TrackballBackground; // 0x610
	FTextureUVs TrackballBackgroundUVs; // 0x618
	ObjectProperty TrackballTouchIndicator; // 0x628
	FTextureUVs TrackballTouchIndicatorUVs; // 0x630
	ObjectProperty SliderImages[0x4]; // 0x640
	FTextureUVs SliderUVs[0x4]; // 0x660
	float MobileTiltX; // 0x6a0
	float MobileTiltY; // 0x6a4
	float MobileTiltSize; // 0x6a8
	TArray<ObjectProperty> KismetRenderEvents; // 0x6ac
};

struct UInterpTrackSkelControlStrength : UInterpTrackFloatBase {
	FName SkelControlName; // 0xb8
};

struct ATcpLink : AInternetLink {
	ELinkState LinkState; // 0x2a4
	FIpAddr RemoteAddr; // 0x2a8
	ATcpLink* AcceptClass; // 0x2bc
	TArray<char> SendFIFO; // 0x2c4
	FString RecvBuf; // 0x2d4
};

struct ATgDevice_BunnyUlt : ATgDevice {
	ObjectProperty m_CachedBunny; // 0xa04
	ObjectProperty m_CurrentUltTarget; // 0xa0c
	char m_bRequireTargetToFire : 1; // 0xa14
};

struct USkeletalMeshSocket : UObject {
	FName SocketName; // 0x60
	FName BoneName; // 0x68
	FVector RelativeLocation; // 0x70
	FRotator RelativeRotation; // 0x7c
	FVector RelativeScale; // 0x88
	ComponentProperty PreviewSkelComp; // 0x94
};

struct UTgAudioComponent : UAudioComponent {
	char m_bCanBeHeardDuringStealth : 1; // 0x2cc
	float m_fStealthFadeInTime; // 0x2d0
	float m_fStealthFadeOutTime; // 0x2d4
	float m_fStealthVolumeMultiplier; // 0x2d8
};

struct UUIComponent_EndOfMatchLobbyBestClass : UUIComponent_Display {
	ObjectProperty m_pMVPs; // 0x124
	ObjectProperty m_grBestClass; // 0x12c
	ObjectProperty m_pBattlePassBanner; // 0x134
	ObjectProperty m_pGotoBPAction; // 0x13c
	ObjectProperty m_mcCommendationsRemaining; // 0x144
	ObjectProperty m_mcCommendationsRemainingTF; // 0x14c
};

struct ATgDevice_RespawnBeacon : ATgDevice {
	ObjectProperty s_BeaconExit; // 0xa04
	char r_bHasBeacon : 1; // 0xa0c
};

struct UUIComponent_EventBonusPanel : UUIComponent_Display {
	ObjectProperty m_mcTitleTF; // 0x124
	ObjectProperty m_mcUnlockTF; // 0x12c
	ObjectProperty m_pBonusItems; // 0x134
	ObjectProperty m_pLoadingFrame; // 0x13c
	ObjectProperty m_pUnlockAllButton; // 0x144
};

struct UUIHudPlayer_NPC : UUIHudPlayer_Base {
	ObjectProperty m_mcNPCIcon; // 0x32c
	ObjectProperty m_mcTF; // 0x334
};

struct UTgDeviceMod_CooldownOverride : UObject {
	char m_bAlwaysIgnoreCD : 1; // 0x60
	float m_fChanceToIgnoreCD; // 0x64
};

struct ATgDevice_Counter : ATgDevice {
	char r_bInterruptAfterCounterAttack : 1; // 0xa04
};

struct UMaterialExpressionDynamicParameter : UMaterialExpression {
	TArray<FString> ParamNames; // 0xb0
};

struct UUIHudTarget : UTgGfxScene {
	int32_t m_nOwnerBotId; // 0x1ec
	TArray<ObjectProperty> m_TargetingManagers; // 0x1f0
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	FRawDistributionFloat SubImageIndex; // 0x68
	char bUseRealTime : 1; // 0x8c
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x68
	char Positive_Y : 1; // 0x68
	char Positive_Z : 1; // 0x68
	char Negative_X : 1; // 0x68
	char Negative_Y : 1; // 0x68
	char Negative_Z : 1; // 0x68
	char SurfaceOnly : 1; // 0x68
	char Velocity : 1; // 0x68
	FRawDistributionFloat VelocityScale; // 0x6c
	FRawDistributionVector StartLocation; // 0x90
};

struct UTgIconDetails : UObject {
	ObjectProperty m_OwningGroup; // 0x60
	ObjectProperty m_mcIconObject; // 0x68
	ObjectProperty m_mcTexture; // 0x70
	ObjectProperty m_mcLoadingSpinner; // 0x78
	FString m_sTextureString; // 0x80
	FString m_sTag; // 0x90
	char m_bIsTextureSet : 1; // 0xa0
};

struct UInterpTrackInstFaceFX : UInterpTrackInst {
	char bFirstUpdate : 1; // 0x60
	float LastUpdatePosition; // 0x64
};

struct ATgBotEncounterVolume : AVolume {
	TArray<ObjectProperty> m_Factories; // 0x2bc
	int32_t m_nPlayers; // 0x2cc
};

struct UUIInteractable_Button_Currency : UUIInteractable_Button {
	ObjectProperty m_mcSlash; // 0x140
	ObjectProperty m_pKey; // 0x148
	ObjectProperty m_pCurrencies; // 0x150
};

struct UUIAccountLinkPopup : UTgGfxScene {
	FString m_sUserEmail; // 0x1ec
};

struct USeqAct_AddRemoveFaceFXAnimSet : USequenceAction {
	TArray<ObjectProperty> FaceFXAnimSets; // 0x108
};

struct UUIResourceDataProvider : UUIPropertyDataProvider {
	char bSkipDuringEnumeration : 1; // 0x90
};

struct UTgAnimNodeBlendByAFK : UTgAnimNodeBlendList {
	ObjectProperty PawnOwner; // 0x168
};

struct ATgWeaponMeshActor_RaumMinigun : ATgWeaponMeshActor {
	ObjectProperty m_CachedRaum; // 0x450
	ObjectProperty m_CachedInhandForm; // 0x458
	ObjectProperty m_PropWeapon; // 0x460
	FVector m_vPropWeaponOrigin; // 0x468
	char m_bPendingThrow : 1; // 0x474
	char c_b3PWepHiddenDueToThrow : 1; // 0x474
	float m_fPendingThrowTime; // 0x478
	float m_fMinimumThrowHistory; // 0x47c
	float m_fWeaponThrownFailsafeTime; // 0x480
	float m_fSyntheticShotAccuracyModifier; // 0x484
	float m_fReloadTimeToThrowWeapon; // 0x488
	float m_fReloadPctWeaponThrown; // 0x48c
	float m_fReloadTimeToRecoverWeapon; // 0x490
	float m_fThrowVelocityFactor; // 0x494
};

struct UCameraShake : UObject {
	char bSingleInstance : 1; // 0x60
	char bRandomAnimSegment : 1; // 0x60
	char bDoHUDShake : 1; // 0x60
	float OscillationDuration; // 0x64
	float OscillationBlendInTime; // 0x68
	float OscillationBlendOutTime; // 0x6c
	FROscillator RotOscillation; // 0x70
	FVOscillator LocOscillation; // 0x94
	FFOscillator FOVOscillation; // 0xb8
	ObjectProperty Anim; // 0xc4
	float AnimPlayRate; // 0xcc
	float AnimScale; // 0xd0
	float AnimBlendInTime; // 0xd4
	float AnimBlendOutTime; // 0xd8
	float RandomAnimSegmentDuration; // 0xdc
	FV2DOscillator HUDOscillation; // 0xe0
};

struct UTgSeqEvent_MICParameterEvent : USequenceEvent {
	eMICEventType MICEventType; // 0x128
	TArray<ObjectProperty> AttachedMICs; // 0x12c
};

struct UTgAnimNodeBlendByIntroduction : UTgAnimNodeBlendList {
	char m_bIsRelevant : 1; // 0x168
};

struct ARB_Thruster : ARigidBodyBase {
	char bThrustEnabled : 1; // 0x280
	float ThrustStrength; // 0x284
};

struct UActorFactoryDynamicSM : UActorFactory {
	ObjectProperty StaticMesh; // 0x9c
	FVector DrawScale3D; // 0xa4
	char bNoEncroachCheck : 1; // 0xb0
	char bNotifyRigidBodyCollision : 1; // 0xb0
	char bBlockRigidBody : 1; // 0xb0
	char bUseCompartment : 1; // 0xb0
	char bCastDynamicShadow : 1; // 0xb0
	ECollisionType CollisionType; // 0xb4
};

struct UInputAction : UUIData {
	FPointer VfTable_ITgCallbackInterface; // 0x64
	TArray<FInputKeyEvent> m_Keys; // 0x6c
	ObjectProperty m_CallbackContainer; // 0x7c
	char m_bAllowFallThrough : 1; // 0x84
};

struct UDistributionVectorUniformCurve : UDistributionVector {
	FInterpCurveTwoVectors ConstantCurve; // 0x7c
	char bLockAxes1 : 1; // 0x90
	char bLockAxes2 : 1; // 0x90
	char bUseExtremes : 1; // 0x90
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x94
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x96
};

struct USkeletalMesh : UObject {
	FBoxSphereBounds Bounds; // 0x60
	FVector LodCheckSphereOrigin; // 0x7c
	float LodCheckSphereRadius; // 0x88
	TArray<ObjectProperty> Materials; // 0x8c
	TArray<ObjectProperty> ClothingAssets; // 0x9c
	TArray<FApexClothingAssetInfo> ClothingLodMap; // 0xac
	FVector Origin; // 0xbc
	FRotator RotOrigin; // 0xc8
	TArray<int32_t> RefSkeleton; // 0xd4
	int32_t SkeletalDepth; // 0xe4
	TMap<None, None> NameIndexMap; // 0xe8
	FIndirectArray_Mirror LODModels; // 0x130
	FPointer SourceData; // 0x140
	TArray<FBoneAtom> RefBasesInvMatrix; // 0x148
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0x158
	EAxis SkelMirrorAxis; // 0x168
	EAxis SkelMirrorFlipAxis; // 0x169
	TArray<ObjectProperty> Sockets; // 0x16c
	TArray<FString> BoneBreakNames; // 0x17c
	TArray<BoneBreakOption> BoneBreakOptions; // 0x18c
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0x19c
	TArray<FSkeletalMeshOptimizationSettings> OptimizationSettings; // 0x1ac
	TArray<FName> PerPolyCollisionBones; // 0x1bc
	TArray<FName> AddToParentPerPolyCollisionBone; // 0x1cc
	TArray<int32_t> PerPolyBoneKDOPs; // 0x1dc
	char bStripkDOP : 1; // 0x1ec
	char bPerPolyUseSoftWeighting : 1; // 0x1ec
	char bUseSimpleLineCollision : 1; // 0x1ec
	char bUseSimpleBoxCollision : 1; // 0x1ec
	char bForceCPUSkinning : 1; // 0x1ec
	char bUseFullPrecisionUVs : 1; // 0x1ec
	char bHasBeenSimplified : 1; // 0x1ec
	ObjectProperty FaceFXAsset; // 0x1f0
	int32_t LODBiasPC; // 0x1f8
	int32_t LODBiasPS3; // 0x1fc
	int32_t LODBiasXbox360; // 0x200
	int32_t LODBiasOrbis; // 0x204
	TArray<FPointer> ClothMesh; // 0x208
	TArray<float> ClothMeshScale; // 0x218
	TArray<int32_t> ClothToGraphicsVertMap; // 0x228
	TArray<float> ClothMovementScale; // 0x238
	ClothMovementScaleGen ClothMovementScaleGenMode; // 0x248
	float ClothToAnimMeshMaxDist; // 0x24c
	char bLimitClothToAnimMesh : 1; // 0x250
	TArray<int32_t> ClothWeldingMap; // 0x254
	int32_t ClothWeldingDomain; // 0x264
	TArray<int32_t> ClothWeldedIndices; // 0x268
	char bForceNoWelding : 1; // 0x278
	int32_t NumFreeClothVerts; // 0x27c
	TArray<int32_t> ClothIndexBuffer; // 0x280
	TArray<FName> ClothBones; // 0x290
	int32_t ClothHierarchyLevels; // 0x2a0
	char bEnableClothBendConstraints : 1; // 0x2a4
	char bEnableClothDamping : 1; // 0x2a4
	char bUseClothCOMDamping : 1; // 0x2a4
	float ClothStretchStiffness; // 0x2a8
	float ClothBendStiffness; // 0x2ac
	float ClothDensity; // 0x2b0
	float ClothThickness; // 0x2b4
	float ClothDamping; // 0x2b8
	int32_t ClothIterations; // 0x2bc
	int32_t ClothHierarchicalIterations; // 0x2c0
	float ClothFriction; // 0x2c4
	float ClothRelativeGridSpacing; // 0x2c8
	float ClothPressure; // 0x2cc
	float ClothCollisionResponseCoefficient; // 0x2d0
	float ClothAttachmentResponseCoefficient; // 0x2d4
	float ClothAttachmentTearFactor; // 0x2d8
	float ClothSleepLinearVelocity; // 0x2dc
	float HardStretchLimitFactor; // 0x2e0
	char bHardStretchLimit : 1; // 0x2e4
	char bEnableClothOrthoBendConstraints : 1; // 0x2e4
	char bEnableClothSelfCollision : 1; // 0x2e4
	char bEnableClothPressure : 1; // 0x2e4
	char bEnableClothTwoWayCollision : 1; // 0x2e4
	TArray<FClothSpecialBoneInfo> ClothSpecialBones; // 0x2e8
	char bEnableClothLineChecks : 1; // 0x2f8
	char bClothMetal : 1; // 0x2f8
	float ClothMetalImpulseThreshold; // 0x2fc
	float ClothMetalPenetrationDepth; // 0x300
	float ClothMetalMaxDeformationDistance; // 0x304
	char bEnableClothTearing : 1; // 0x308
	float ClothTearFactor; // 0x30c
	int32_t ClothTearReserve; // 0x310
	char bEnableValidBounds : 1; // 0x314
	FVector ValidBoundsMin; // 0x318
	FVector ValidBoundsMax; // 0x324
	FMap_Mirror ClothTornTriMap; // 0x330
	TArray<int32_t> SoftBodySurfaceToGraphicsVertMap; // 0x378
	TArray<int32_t> SoftBodySurfaceIndices; // 0x388
	TArray<FVector> SoftBodyTetraVertsUnscaled; // 0x398
	TArray<int32_t> SoftBodyTetraIndices; // 0x3a8
	TArray<FSoftBodyTetraLink> SoftBodyTetraLinks; // 0x3b8
	TArray<FPointer> CachedSoftBodyMeshes; // 0x3c8
	TArray<float> CachedSoftBodyMeshScales; // 0x3d8
	TArray<FName> SoftBodyBones; // 0x3e8
	TArray<FSoftBodySpecialBoneInfo> SoftBodySpecialBones; // 0x3f8
	float SoftBodyVolumeStiffness; // 0x408
	float SoftBodyStretchingStiffness; // 0x40c
	float SoftBodyDensity; // 0x410
	float SoftBodyParticleRadius; // 0x414
	float SoftBodyDamping; // 0x418
	int32_t SoftBodySolverIterations; // 0x41c
	float SoftBodyFriction; // 0x420
	float SoftBodyRelativeGridSpacing; // 0x424
	float SoftBodySleepLinearVelocity; // 0x428
	char bEnableSoftBodySelfCollision : 1; // 0x42c
	float SoftBodyAttachmentResponse; // 0x430
	float SoftBodyCollisionResponse; // 0x434
	float SoftBodyDetailLevel; // 0x438
	int32_t SoftBodySubdivisionLevel; // 0x43c
	char bSoftBodyIsoSurface : 1; // 0x440
	char bEnableSoftBodyDamping : 1; // 0x440
	char bUseSoftBodyCOMDamping : 1; // 0x440
	float SoftBodyAttachmentThreshold; // 0x444
	char bEnableSoftBodyTwoWayCollision : 1; // 0x448
	float SoftBodyAttachmentTearFactor; // 0x44c
	char bEnableSoftBodyLineChecks : 1; // 0x450
	char bHasVertexColors : 1; // 0x450
	TArray<char> GraphicsIndexIsCloth; // 0x454
	TArray<float> CachedStreamingTextureFactors; // 0x464
	float StreamingDistanceMultiplier; // 0x474
	int32_t ReleaseResourcesFence; // 0x478
	FQWord SkelMeshRUID; // 0x47c
	char bUseClothingAssetMaterial : 1; // 0x484
};

struct UParticleModuleLocationDirect : UParticleModuleLocationBase {
	FRawDistributionVector Location; // 0x68
	FRawDistributionVector LocationOffset; // 0x8c
	FRawDistributionVector ScaleFactor; // 0xb0
	FRawDistributionVector Direction; // 0xd4
};

struct AEmitterPool : AActor {
	ComponentProperty PSCTemplate; // 0x280
	TArray<ComponentProperty> PoolComponents; // 0x288
	TArray<ComponentProperty> ActiveComponents; // 0x298
	int32_t MaxActiveEffects; // 0x2a8
	int32_t InitialPooledComponentCount; // 0x2ac
	char bLogPoolOverflow : 1; // 0x2b0
	char bLogPoolOverflowList : 1; // 0x2b0
	TArray<FEmitterBaseInfo> RelativePSCs; // 0x2b4
	float SMC_MIC_ReductionTime; // 0x2c4
	float SMC_MIC_CurrentReductionTime; // 0x2c8
	int32_t IdealStaticMeshComponents; // 0x2cc
	int32_t IdealMaterialInstanceConstants; // 0x2d0
	TArray<ComponentProperty> FreeSMComponents; // 0x2d4
	TArray<ObjectProperty> FreeMatInstConsts; // 0x2e4
};

struct UTgAnimBlendByPaladinsCharacter_Drogoz : UTgAnimBlendByPaladinsCharacter {
	TArray<FName> m_AmmoSkelControlNames; // 0x544
	TArray<ObjectProperty> m_AmmoSkelControls; // 0x554
	ObjectProperty m_CachedDrogozPawn; // 0x564
};

struct ULightComponent : UActorComponent {
	FPointer SceneInfo; // 0x88
	FMatrix WorldToLight; // 0x90
	FMatrix LightToWorld; // 0xd0
	FGuid LightGuid; // 0x110
	FGuid LightmapGuid; // 0x120
	float Brightness; // 0x130
	FColor LightColor; // 0x134
	ObjectProperty Function; // 0x138
	char bEnabled : 1; // 0x140
	char CastShadows : 1; // 0x140
	char CastStaticShadows : 1; // 0x140
	char CastDynamicShadows : 1; // 0x140
	char bCastCompositeShadow : 1; // 0x140
	char bAffectCompositeShadowDirection : 1; // 0x140
	char bNonModulatedSelfShadowing : 1; // 0x140
	char bSelfShadowOnly : 1; // 0x140
	char bAllowPreShadow : 0; // 0x140
	char bForceDynamicLight : 0; // 0x140
	char UseDirectLightMap : 0; // 0x140
	char bHasLightEverBeenBuiltIntoLightMap : 0; // 0x140
	char bCanAffectDynamicPrimitivesOutsideDynamicChannel : 0; // 0x140
	char bRenderLightShafts : 0; // 0x140
	char bUseImageReflectionSpecular : 0; // 0x140
	char bPrecomputedLightingIsValid : 0; // 0x140
	char bExplicitlyAssignedLight : 0; // 0x140
	char bAllowCompositingIntoDLE : 0; // 0x140
	ComponentProperty LightEnvironment; // 0x144
	FLightingChannelContainer LightingChannels; // 0x14c
	ELightAffectsClassification LightAffectsClassification; // 0x150
	ELightShadowMode LightShadowMode; // 0x151
	FLinearColor ModShadowColor; // 0x154
	float ModShadowFadeoutTime; // 0x164
	float ModShadowFadeoutExponent; // 0x168
	int32_t LightListIndex; // 0x16c
	EShadowProjectionTechnique ShadowProjectionTechnique; // 0x170
	EShadowFilterQuality ShadowFilterQuality; // 0x171
	int32_t MinShadowResolution; // 0x174
	int32_t MaxShadowResolution; // 0x178
	int32_t ShadowFadeResolution; // 0x17c
	float OcclusionDepthRange; // 0x180
	float BloomScale; // 0x184
	float BloomThreshold; // 0x188
	float BloomScreenBlendThreshold; // 0x18c
	FColor BloomTint; // 0x190
	float RadialBlurPercent; // 0x194
	float OcclusionMaskDarkness; // 0x198
	float ReflectionSpecularBrightness; // 0x19c
	EDetailMode DetailMode; // 0x1a0
};

struct UTgInventoryObject_Listen_StandingStillSelfEffect : UTgInvListener {
	float m_fRestTime; // 0xc4
	char m_bIsApplied : 1; // 0xc8
	ObjectProperty m_CachedPawnOwner; // 0xcc
};

struct UTgInventoryObject_Listen_AdrenalineJunkie : UTgInvListener {
	ObjectProperty m_CachedRestoreStaminaDevice; // 0xc4
	ObjectProperty m_CachedNinjaSMG; // 0xcc
	float m_DamageRemainder; // 0xd4
};

struct ATgDevice_Kunai : ATgDevice {
	float m_fBurstSpreadHalfAngleDeg; // 0xa04
	FVector m_vProjectileSpawnOffsetLeft; // 0xa08
	FVector m_vProjectileSpawnOffsetRight; // 0xa14
};

struct ATgDeploy_DistortionField : ATgDeploy_EffectAura {
	float m_fRadiusVFXScale; // 0x4b0
};

struct UTgAIBehaviorAction_SelectLaneMoveTarget_Minotaur : UTgAIBehaviorAction {
	char bMustBeEnemy : 1; // 0x94
};

struct UTgSeqEvent_ControlPointOwnershipChange_Server : USequenceEvent {
	int32_t PointIndex; // 0x128
};

struct ASpeedTreeActor : AActor {
	ComponentProperty SpeedTreeComponent; // 0x280
};

struct UUIComponent_BPReward : UUIComponent_Display {
	ObjectProperty m_mcRarity; // 0x124
	ObjectProperty m_mcHighlight; // 0x12c
	ObjectProperty m_mcLock; // 0x134
	ObjectProperty m_mcChestIcon; // 0x13c
	ObjectProperty m_mcIcon; // 0x144
	ObjectProperty m_mcCardIcon; // 0x14c
	ObjectProperty m_Avatar; // 0x154
};

struct UTgInventoryObject_Listen_Combo_Grohk : UTgInventoryObject_Listen_Combo {
	float m_fFirstHitThisTickTimestamp; // 0xcc
	int32_t m_nHitsThisChain; // 0xd0
	char m_bBonusActive : 1; // 0xd4
};

struct ATgGame_Mission : ATgGame {
	char m_bSpawnInTaskForceArea : 1; // 0x624
	char s_bPreGuardianPhasePulsed : 1; // 0x624
	char s_bGuardianPhasePulsed : 1; // 0x624
	char s_bWasSurrendered : 1; // 0x624
	char m_bSurrenderAvailable : 1; // 0x624
	char m_bAllowAutoUpgrades : 1; // 0x624
	char m_bUsePlayerCharacterIntros : 1; // 0x624
	GameTimerState m_eTimerState; // 0x628
	GameTimerState m_eTimerStatePaused; // 0x629
	float m_fMissionTime; // 0x62c
	float m_fSecondaryMissionTime; // 0x630
	float m_fWaitingForPlayersTime; // 0x634
	float m_fSetupTime; // 0x638
	float m_fPausedAtTime; // 0x63c
	float m_fGameMissionTime; // 0x640
	float s_MissionTimeAccumulator; // 0x644
	TArray<ObjectProperty> s_ReadyPlayers; // 0x648
	int32_t s_nReadyMercs; // 0x658
	float m_fTickCreditsFreq; // 0x65c
	float m_fCreditsToGivePerTick; // 0x660
	int32_t m_nStartingCurrency; // 0x664
	int32_t m_nStartingLevel; // 0x668
	int32_t m_nWinBonusXp; // 0x66c
	int32_t m_nWinPlayerXp; // 0x670
	int32_t m_nLosePlayerXp; // 0x674
	float m_fGodXpCoefficient; // 0x678
	float m_fGodXpCoefficientLoss; // 0x67c
	float m_fGodXpWinBonus; // 0x680
	float m_fFreeVIPWinPoints; // 0x684
	float m_fFreeVIPLossPoints; // 0x688
	float m_fFreeVIPPerMinute; // 0x68c
	float m_fPaidVIPWinPoints; // 0x690
	float m_fPaidVIPLossPoints; // 0x694
	float m_fPaidVIPPerMinute; // 0x698
	float m_fBattlePassWinBonus; // 0x69c
	float m_fBaseTokens; // 0x6a0
	int32_t m_nKillTokens; // 0x6a4
	int32_t m_nWinBonusTokens; // 0x6a8
	UTgMinimapManager* m_MinimapManagerClass; // 0x6ac
	FSurrenderData s_SurrenderData[0x2]; // 0x6b4
	float m_fSurrenderTime; // 0x6fc
	int32_t m_XPRadius; // 0x700
	float m_MinionKillerBonus; // 0x704
	float m_BasePlayerGoldReward; // 0x708
	float m_fFirstBloodGoldReward; // 0x70c
	float m_fBasePlayerAssistGoldRewardMultipler; // 0x710
	float m_fBasePlayerAssistXpRewardMultipler; // 0x714
	float m_fBaseNPCAssistGoldRewardMultipler; // 0x718
	float m_fBaseNPCAssistXpRewardMultipler; // 0x71c
	TArray<ObjectProperty> m_MinionGoals; // 0x720
	int32_t m_nLastTimeDilationWindowId; // 0x730
	TArray<FTimeDilationWindow> m_ActiveTimeDilationWindows; // 0x734
};

struct ATgSplineActor : ASplineActor {
	ELanePusherActionPoint m_ActionPoint; // 0x2e8
	char m_bPreview : 1; // 0x2ec
};

struct UUIComponent_MasteryRewardsEntry : UUIComponent_Display {
	ObjectProperty m_mcLockIcon; // 0x124
	ObjectProperty m_mcLevelText; // 0x12c
	ObjectProperty m_mcRewardType; // 0x134
	ObjectProperty m_mcRewardName; // 0x13c
	ObjectProperty m_mcRewardTitle; // 0x144
	ObjectProperty m_mcRewardChest; // 0x14c
	ObjectProperty m_mcRewardCurrency; // 0x154
	ObjectProperty m_mcRewardCurrencyTF; // 0x15c
	ObjectProperty m_mcCardIcon; // 0x164
	ObjectProperty m_mcItemIcon; // 0x16c
	ObjectProperty m_mcTextureIcon; // 0x174
	ObjectProperty m_mcRarity; // 0x17c
	ObjectProperty m_pFrameButton; // 0x184
	ObjectProperty m_pPriceButton; // 0x18c
};

struct UTgAnimNodeChannelFire_CorvusUlt : UTgAnimNodeChannelFire {
	CorvusUltAnimState m_eAnimState; // 0x180
};

struct ATgSkeletalMeshActor_DestructibleTowerChunk : ATgSkeletalMeshActorSpawnable {
	ComponentProperty TgSkeletalMeshComp; // 0x32c
};

struct ATgDevice_Spray : ATgDevice {
	char m_bMissedSpray : 1; // 0xa04
	int32_t m_nSelectedSpray; // 0xa08
};

struct UPath_WithinDistanceEnvelope : UPathConstraint {
	float MaxDistance; // 0x6c
	float MinDistance; // 0x70
	char bSoft : 1; // 0x74
	char bOnlyThrowOutNodesThatLeaveEnvelope : 1; // 0x74
	float SoftStartPenalty; // 0x78
	FVector EnvelopeTestPoint; // 0x7c
};

struct UTgGameplayCurvesSet : UObject {
	ECurveSetTypes CurveSetType; // 0x60
};

struct UTimeLapseRecordingDriver : UNetDriver {
	FString DemoSpectatorClass; // 0x208
	float DefaultRewindTime; // 0x218
};

struct UParticleModuleColor : UParticleModuleColorBase {
	FRawDistributionVector StartColor; // 0x68
	FRawDistributionFloat StartAlpha; // 0x8c
	char bClampAlpha : 1; // 0xb0
};

struct UInterpTrackInstHeadTracking : UInterpTrackInst {
	EHeadTrackingAction Action; // 0x60
	TMap<None, None> CurrentActorMap; // 0x64
	ComponentProperty Mesh; // 0xac
	TArray<ObjectProperty> TrackControls; // 0xb4
	float LastUpdatePosition; // 0xc4
};

struct UTgSeqCond_HasCondition : USequenceCondition {
	ConditionType ConditionList; // 0xec
};

struct UTgAIBehaviorAction_SetBotBehaviorState : UTgAIBehaviorAction {
	EBotBehaviorState DesiredBehaviorState; // 0x94
};

struct UUIComponent_HalloweenEventStore : UUIComponent_Display {
	char m_bOwnsMapYing : 1; // 0x124
	char m_bOwnsMapFernando : 1; // 0x124
	char m_bOwnsMapVivian : 1; // 0x124
	ObjectProperty m_mcMapWarning; // 0x128
	ObjectProperty m_mcMapWarningTF0; // 0x130
	ObjectProperty m_mcMapWarningTF1; // 0x138
	ObjectProperty m_mcMapWarningIcon; // 0x140
	ObjectProperty m_mcCurrencyTF; // 0x148
	ObjectProperty m_mcButtonBG; // 0x150
	ObjectProperty m_pGoldDoubloons; // 0x158
	ObjectProperty m_pDarkDoubloons; // 0x160
	ObjectProperty m_pItemPreview; // 0x168
	ObjectProperty m_pUnlockButton; // 0x170
	ObjectProperty m_pStoreBundles; // 0x178
	ObjectProperty m_pStoreItems; // 0x180
	ObjectProperty m_grStore; // 0x188
	ObjectProperty m_pUnlockAction; // 0x190
	FVector m_vBaseCameraOffset; // 0x198
	FVector m_vDeathStampCameraOffset; // 0x1a4
};

struct UTgInventoryObject_Listen_DeployOnAbility : UTgInventoryObject_Listen_AbilityProcBase {
	EDeployOnAbilityType m_eDeployType; // 0xcc
};

struct UUIComponent_PlayTraining : UUIComponent_Display {
	ObjectProperty m_mcDailyQueueBonusNotification; // 0x124
	ObjectProperty m_mcDailyQueueBonusNotificationTF; // 0x12c
	ObjectProperty m_mcDailyQueueBonusIcon; // 0x134
	ObjectProperty m_pPanels; // 0x13c
	ObjectProperty m_grInput; // 0x144
};

struct UPlayerInput : UInput {
	char bUsingGamepad : 1; // 0x178
	char bInvertMouse : 1; // 0x178
	char bInvertController : 1; // 0x178
	char bInvertTurn : 1; // 0x178
	char bWasForward : 1; // 0x178
	char bWasBack : 1; // 0x178
	char bWasLeft : 1; // 0x178
	char bWasRight : 1; // 0x178
	char bEdgeForward : 0; // 0x178
	char bEdgeBack : 0; // 0x178
	char bEdgeLeft : 0; // 0x178
	char bEdgeRight : 0; // 0x178
	char bEnableMouseSmoothing : 0; // 0x178
	char bEnableFOVScaling : 0; // 0x178
	char bLockTurnUntilRelease : 0; // 0x178
	FName LastAxisKeyName; // 0x17c
	float DoubleClickTimer; // 0x184
	float DoubleClickTime; // 0x188
	float MouseSensitivity; // 0x18c
	float m_fLookSensitivity; // 0x190
	float m_fLookSensitivityY; // 0x194
	float m_fLookAccelSpeed; // 0x198
	float m_fDeadZoneLeft; // 0x19c
	float m_fDeadZoneRight; // 0x1a0
	float aBaseX; // 0x1a4
	float aBaseY; // 0x1a8
	float aBaseZ; // 0x1ac
	float aMouseX; // 0x1b0
	float aMouseY; // 0x1b4
	float aForward; // 0x1b8
	float aTurn; // 0x1bc
	float aStrafe; // 0x1c0
	float aUp; // 0x1c4
	float aLookUp; // 0x1c8
	float aRightAnalogTrigger; // 0x1cc
	float aLeftAnalogTrigger; // 0x1d0
	float aPS3AccelX; // 0x1d4
	float aPS3AccelY; // 0x1d8
	float aPS3AccelZ; // 0x1dc
	float aPS3Gyro; // 0x1e0
	float aWiiUPointerX; // 0x1e4
	float aWiiUPointerY; // 0x1e8
	FVector aTilt; // 0x1ec
	FVector aRotationRate; // 0x1f8
	FVector aGravity; // 0x204
	FVector aAcceleration; // 0x210
	FVector aTouch[0x5]; // 0x21c
	FVector aBackTouch[0x5]; // 0x258
	float RawJoyUp; // 0x294
	float RawJoyRight; // 0x298
	float RawJoyLookRight; // 0x29c
	float RawJoyLookUp; // 0x2a0
	float MoveForwardSpeed; // 0x2a4
	float MoveStrafeSpeed; // 0x2a8
	float LookRightScale; // 0x2ac
	float LookUpScale; // 0x2b0
	char bStrafe; // 0x2b4
	char bXAxis; // 0x2b5
	char bYAxis; // 0x2b6
	float ZeroTime[0x2]; // 0x2b8
	float SmoothedMouse[0x2]; // 0x2c0
	int32_t MouseSamples; // 0x2c8
	float MouseSamplingTotal; // 0x2cc
	float AutoUnlockTurnTime; // 0x2d0
};

struct USeqCond_CompareInt : USequenceCondition {
	int32_t ValueA; // 0xec
	int32_t ValueB; // 0xf0
};

struct UPBRuleNodeSplit : UPBRuleNodeBase {
	EProcBuildingAxis SplitAxis; // 0x70
	TArray<FRBSplitInfo> SplitSetup; // 0x74
};

struct UTgDeviceForm_HexaFire : UTgDeviceForm {
	ObjectProperty m_LeftRocket1p; // 0x28c
