namespace off {
	constexpr auto GNames = 0x5386640;
	constexpr auto GObjects = 0x539ebc0;
	constexpr auto GWorld = 0x54d3ca0;
}
struct UARPlaneGeometry {
	EARPlaneOrientation Orientation; // 0xf8
	FVector Center; // 0xfc
	FVector Extent; // 0x108
	TArray<FVector> BoundaryPolygon; // 0x118
	UARPlaneGeometry* SubsumedBy; // 0x128
};

struct AShooterAIController {
	UBlackboardComponent* BlackboardComp; // 0x328
	UBehaviorTreeComponent* BehaviorComp; // 0x330
};

struct UInterpTrackInstAkAudioRTPC {
	float LastUpdatePosition; // 0x28
};

struct USourceEffectSimpleDelayPreset {
	FSourceEffectSimpleDelaySettings Settings; // 0xa8
};

struct UAkAudioEventData {
	float MaxAttenuationRadius; // 0xb8
	bool IsInfinite; // 0xbc
	float MinimumDuration; // 0xc0
	float MaximumDuration; // 0xc4
	TMap<FString, UAkAssetDataSwitchContainer*> LocalizedMedia; // 0xc8
	TSet<UAkAudioEvent*> PostedEvents; // 0x118
	TSet<UAkAuxBus*> UserDefinedSends; // 0x168
	TSet<UAkTrigger*> PostedTriggers; // 0x1b8
	TSet<UAkGroupValue*> GroupValues; // 0x208
};

struct ABombMode_Bomb {
	USceneComponent* DummyRoot; // 0x228
	USkeletalMeshComponent* BombMeshComponent; // 0x230
	UMapIconComponent* MapIconComponent; // 0x238
	FBox DefuseBox; // 0x240
	UParticleSystem* DetonateEffect; // 0x260
	int32_t TeamAllegiance; // 0x268
	ABombMode_Zone* Zone; // 0x270
	bool Armed; // 0x278
	float Fuse; // 0x27c
	bool IsBeingDefused; // 0x280
	ABombPlayerState* Defuser; // 0x288
	AController* Planter; // 0x290
	UCurveFloat* DamageFalloff; // 0x298
	UWorldMarkerComponent* WorldMarkerComponent; // 0x2a0
	UAkComponent* DefaultAkComponent; // 0x2b0
	UAkAudioEvent* TickingEvent; // 0x2b8
	UAkAudioEvent* StopTickingEvent; // 0x2c0
	bool bAttackersSeeBombIcon; // 0x2c8
	bool bDefendersSeeBombIcon; // 0x2c9
	bool bCanBeSeenByDefender; // 0x2ca
	float MaxFuse; // 0x2cc
	bool bDrawDebugDefuseArea; // 0x2f8
};

struct UGizmoComponentHitTarget {
	UPrimitiveComponent* Component; // 0x30
};

struct UApply-Legend-button-Promod_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Default; // 0x268
	UWidgetAnimation* Clicked; // 0x270
	UWidgetAnimation* Unselected; // 0x278
	UWidgetAnimation* Selected; // 0x280
	UImage* Image_405; // 0x288
	UButton* Wish-Button; // 0x290
	FMulticastInlineDelegate ButtonClicked; // 0x298
};

struct UEnvQueryManager {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct UMaterialExpressionStaticComponentMaskParameter {
	char DefaultR : 1; // 0x58
	char DefaultG : 1; // 0x58
	char DefaultB : 1; // 0x58
	char DefaultA : 1; // 0x58
};

struct UPFGroupManager {
	TArray<FString> GroupInvitationEntityIds; // 0x28
	TArray<FPFPlayerId> GroupApplicantEntityIds; // 0x38
	TArray<FPFPlayerId> GroupBlocksEntityIds; // 0x48
	TArray<FPFPlayerId> GroupInvitesEntityIds; // 0x58
	TArray<FPFPlayerId> GroupMembersEntityIds; // 0x68
	TArray<FPFSingleEntityMembershipInfo> SingleEntityMembershipInfo; // 0x78
	FMulticastInlineDelegate UpdateUIEvent; // 0x88
	UPlayFabSubsystem* PlayFabSubsystem; // 0x98
	UPFPlayerIdCache* PlayerIdCache; // 0xb0
	bool bIsServer; // 0xb8
	bool bGroupCreated; // 0xb9
};

struct UNUIBreadCrumb {
	FString Name; // 0x260
};

struct UWBP_ProneBlock_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Glitch; // 0x268
	UWidgetAnimation* Intro; // 0x270
	UTextBlock* descriptiontext; // 0x278
	UTextBlock* descriptiontextBLUE; // 0x280
	UTextBlock* descriptiontextRED; // 0x288
	bool bIsProneBlocked; // 0x290
};

struct UReverbEffect {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UBP_StunnedCameraModifier_C {
	UMaterialInstanceDynamic* PostProcessMaterial; // 0x48
	float Strength; // 0x50
};

struct UMaterial {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UPhysicalMaterialMask* PhysMaterialMask; // 0x90
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0x98
	FScalarMaterialInput Metallic; // 0xd8
	FScalarMaterialInput Specular; // 0xec
	FScalarMaterialInput Anisotropy; // 0x100
	FVectorMaterialInput Normal; // 0x114
	FVectorMaterialInput Tangent; // 0x128
	FColorMaterialInput EmissiveColor; // 0x13c
	EMaterialDomain MaterialDomain; // 0x150
	EBlendMode BlendMode; // 0x151
	EDecalBlendMode DecalBlendMode; // 0x152
	EMaterialDecalResponse MaterialDecalResponse; // 0x153
	EMaterialShadingModel ShadingModel; // 0x154
	char bCastDynamicShadowAsMasked : 1; // 0x155
	FMaterialShadingModelField ShadingModels; // 0x156
	float OpacityMaskClipValue; // 0x158
	FVectorMaterialInput WorldPositionOffset; // 0x15c
	FScalarMaterialInput Refraction; // 0x170
	FMaterialAttributesInput MaterialAttributes; // 0x184
	FScalarMaterialInput PixelDepthOffset; // 0x19c
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b0
	char bEnableSeparateTranslucency : 1; // 0x1c4
	char bEnableResponsiveAA : 1; // 0x1c4
	char bScreenSpaceReflections : 1; // 0x1c4
	char bContactShadows : 1; // 0x1c4
	char TwoSided : 1; // 0x1c4
	char DitheredLODTransition : 1; // 0x1c4
	char DitherOpacityMask : 1; // 0x1c4
	char bAllowNegativeEmissiveColor : 1; // 0x1c4
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1c5
	char bEnableMobileSeparateTranslucency : 1; // 0x1c6
	int32_t NumCustomizedUVs; // 0x1c8
	float TranslucencyDirectionalLightingIntensity; // 0x1cc
	float TranslucentShadowDensityScale; // 0x1d0
	float TranslucentSelfShadowDensityScale; // 0x1d4
	float TranslucentSelfShadowSecondDensityScale; // 0x1d8
	float TranslucentSelfShadowSecondOpacity; // 0x1dc
	float TranslucentBackscatteringExponent; // 0x1e0
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1e4
	float TranslucentShadowStartOffset; // 0x1f4
	char bDisableDepthTest : 1; // 0x1f8
	char bWriteOnlyAlpha : 1; // 0x1f8
	char bGenerateSphericalParticleNormals : 1; // 0x1f8
	char bTangentSpaceNormal : 1; // 0x1f8
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x1f8
	char bBlockGI : 1; // 0x1f8
	char bUsedAsSpecialEngineMaterial : 1; // 0x1f8
	char bUsedWithSkeletalMesh : 1; // 0x1f8
	char bUsedWithEditorCompositing : 1; // 0x1f9
	char bUsedWithParticleSprites : 1; // 0x1f9
	char bUsedWithBeamTrails : 1; // 0x1f9
	char bUsedWithMeshParticles : 1; // 0x1f9
	char bUsedWithNiagaraSprites : 1; // 0x1f9
	char bUsedWithNiagaraRibbons : 1; // 0x1f9
	char bUsedWithNiagaraMeshParticles : 1; // 0x1f9
	char bUsedWithGeometryCache : 1; // 0x1f9
	char bUsedWithStaticLighting : 1; // 0x1fa
	char bUsedWithMorphTargets : 1; // 0x1fa
	char bUsedWithSplineMeshes : 1; // 0x1fa
	char bUsedWithInstancedStaticMeshes : 1; // 0x1fa
	char bUsedWithGeometryCollections : 1; // 0x1fa
	char bUsesDistortion : 1; // 0x1fa
	char bUsedWithClothing : 1; // 0x1fa
	char bUsedWithWater : 1; // 0x1fc
	char bUsedWithHairStrands : 1; // 0x1fc
	char bUsedWithLidarPointCloud : 1; // 0x1fc
	char bUsedWithVirtualHeightfieldMesh : 1; // 0x1fc
	char bUsedWithUI : 1; // 0x200
	char bAutomaticallySetUsageInEditor : 1; // 0x200
	char bFullyRough : 1; // 0x200
	char bUseFullPrecision : 1; // 0x200
	char bUseLightmapDirectionality : 1; // 0x200
	char bUseAlphaToCoverage : 1; // 0x200
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x204
	char bUseHQForwardReflections : 1; // 0x208
	char bUsePlanarForwardReflections : 1; // 0x208
	char bNormalCurvatureToRoughness : 1; // 0x208
	EMaterialTessellationMode D3D11TessellationMode; // 0x209
	char bEnableCrackFreeDisplacement : 1; // 0x20a
	char bEnableAdaptiveTessellation : 1; // 0x20a
	char AllowTranslucentCustomDepthWrites : 1; // 0x20a
	char Wireframe : 1; // 0x20a
	EMaterialShadingRate ShadingRate; // 0x20b
	char bCanMaskedBeAssumedOpaque : 1; // 0x20c
	char bIsMasked : 1; // 0x20c
	char bIsPreviewMaterial : 1; // 0x20c
	char bIsFunctionPreviewMaterial : 1; // 0x20c
	char bUseMaterialAttributes : 1; // 0x20c
	char bCastRayTracedShadows : 1; // 0x20c
	char bUseTranslucencyVertexFog : 1; // 0x20c
	char bApplyCloudFogging : 1; // 0x20c
	char bIsSky : 1; // 0x20d
	char bComputeFogPerPixel : 1; // 0x20d
	char bOutputTranslucentVelocity : 1; // 0x20d
	char bAllowDevelopmentShaderCompile : 1; // 0x20d
	char bIsMaterialEditorStatsMaterial : 1; // 0x20d
	EBlendableLocation BlendableLocation; // 0x20e
	char BlendableOutputAlpha : 1; // 0x20f
	char bEnableStencilTest : 1; // 0x20f
	EMaterialStencilCompare StencilCompare; // 0x210
	char StencilRefValue; // 0x211
	ERefractionMode RefractionMode; // 0x212
	int32_t BlendablePriority; // 0x214
	char bIsBlendable : 1; // 0x218
	uint32_t UsageFlagWarnings; // 0x21c
	float RefractionDepthBias; // 0x220
	FGuid StateId; // 0x224
	float MaxDisplacement; // 0x234
	FMaterialCachedExpressionData CachedExpressionData; // 0x268
};

struct UNUISettingsMenuHeader {
	bool SecretSetting; // 0x260
};

struct UNavArea {
	float DefaultCost; // 0x30
	float FixedAreaEnteringCost; // 0x34
	FColor DrawColor; // 0x38
	FNavAgentSelector SupportedAgents; // 0x3c
	char bSupportsAgent0 : 1; // 0x40
	char bSupportsAgent1 : 1; // 0x40
	char bSupportsAgent2 : 1; // 0x40
	char bSupportsAgent3 : 1; // 0x40
	char bSupportsAgent4 : 1; // 0x40
	char bSupportsAgent5 : 1; // 0x40
	char bSupportsAgent6 : 1; // 0x40
	char bSupportsAgent7 : 1; // 0x40
	char bSupportsAgent8 : 1; // 0x41
	char bSupportsAgent9 : 1; // 0x41
	char bSupportsAgent10 : 1; // 0x41
	char bSupportsAgent11 : 1; // 0x41
	char bSupportsAgent12 : 1; // 0x41
	char bSupportsAgent13 : 1; // 0x41
	char bSupportsAgent14 : 1; // 0x41
	char bSupportsAgent15 : 1; // 0x41
};

struct UPaperTerrainComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x440
	bool bClosedSpline; // 0x448
	bool bFilledSpline; // 0x449
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x450
	int32_t RandomSeed; // 0x458
	float SegmentOverlapAmount; // 0x45c
	FLinearColor TerrainColor; // 0x460
	int32_t ReparamStepsPerSegment; // 0x470
	ESpriteCollisionMode SpriteCollisionDomain; // 0x474
	float CollisionThickness; // 0x478
	UBodySetup* CachedBodySetup; // 0x480
};

struct AVaultVolume {
	UBoxComponent* BoxComponent; // 0x220
	UArrowComponent* ArrowComponent; // 0x228
};

struct UShowLoginUICallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UMedal25BombDOM {
	ADOMGameMode* DOMGameMode; // 0x48
};

struct ADebugCameraController {
	char bShowSelectedInfo : 1; // 0x570
	char bIsFrozenRendering : 1; // 0x570
	char bIsOrbitingSelectedActor : 1; // 0x570
	char bOrbitPivotUseCenter : 1; // 0x570
	char bEnableBufferVisualization : 1; // 0x570
	char bEnableBufferVisualizationFullMode : 1; // 0x570
	char bIsBufferVisualizationInputSetup : 1; // 0x570
	char bLastDisplayEnabled : 1; // 0x570
	UDrawFrustumComponent* DrawFrustum; // 0x578
	AActor* SelectedActor; // 0x580
	UPrimitiveComponent* SelectedComponent; // 0x588
	FHitResult SelectedHitPoint; // 0x590
	APlayerController* OriginalControllerRef; // 0x620
	UPlayer* OriginalPlayer; // 0x628
	float SpeedScale; // 0x630
	float InitialMaxSpeed; // 0x634
	float InitialAccel; // 0x638
	float InitialDecel; // 0x63c
};

struct UNUI_RightClickableButton {
	FMulticastInlineDelegate OnRightClick; // 0x428
};

struct UBookMark2D {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct UBattalionPathFollowingComponent {
	USplineComponent* SplinePath; // 0x268
};

struct ADOMGameMode {
	float CaptureTime; // 0x878
	float CooldownTime; // 0x87c
	float ScoreInterval; // 0x880
	float AllyZoneSpawnWeighting; // 0x884
	float AllyZoneSpawnDistance; // 0x888
	float AllyZoneSpawnExponent; // 0x88c
	float EnemyZoneSpawnWeighting; // 0x890
	float EnemyZoneSpawnDistance; // 0x894
	float EnemyZoneSpawnExponent; // 0x898
	int32_t CaptureScore; // 0x89c
	ADOMGameState* DOMGameState; // 0x8a0
	UObject* ZoneClass; // 0x8a8
	FNationSound EnemyCapturedA_Event; // 0x8c0
	FNationSound EnemyCapturedB_Event; // 0x8e0
	FNationSound EnemyCapturedC_Event; // 0x900
	FNationSound EnemyTakingA_Event; // 0x920
	FNationSound EnemyTakingB_Event; // 0x940
	FNationSound EnemyTakingC_Event; // 0x960
	FNationSound CapturedA_Event; // 0x980
	FNationSound CapturedB_Event; // 0x9a0
	FNationSound CapturedC_Event; // 0x9c0
	FNationSound TakingA_Event; // 0x9e0
	FNationSound TakingB_Event; // 0xa00
	FNationSound TakingC_Event; // 0xa20
	UAkAudioEvent* EventControlAllObjectives; // 0xa40
	UAkAudioEvent* EventGettingDominated; // 0xa48
	UAkAudioEvent* EventLostA; // 0xa50
	UAkAudioEvent* EventLostB; // 0xa58
	UAkAudioEvent* EventLostC; // 0xa60
	UAkAudioEvent* EventTakenA; // 0xa68
	UAkAudioEvent* EventTakenB; // 0xa70
	UAkAudioEvent* EventTakenC; // 0xa78
	UAkAudioEvent* EventObjectiveTakenSuccess; // 0xa80
};

struct UEnvQueryTest_Distance {
	EEnvTestDistance TestMode; // 0x1f8
	UEnvQueryContext* DistanceTo; // 0x200
};

struct ARadialForceActor {
	URadialForceComponent* ForceComponent; // 0x220
};

struct ALadder {
	USceneComponent* SceneComponent; // 0x220
	UBoxComponent* BoxComponent; // 0x228
	UArrowComponent* ArrowComponent; // 0x230
	UNavLinkComponent* NavLinkComponent; // 0x238
	int32_t Steps; // 0x250
	float Stride; // 0x254
	float LadderHeight; // 0x258
	FVector NavLinkOffsetBottom; // 0x25c
	FVector NavLinkOffsetTop; // 0x268
	EPhysicalSurface LadderType; // 0x274
};

struct UMedalAggressor {
	ADOMGameMode* DOMGameMode; // 0x48
};

struct UEnvQueryTest_Project {
	FEnvTraceData ProjectionData; // 0x1f8
};

struct UWBP_InteractionEvent_C {
	UImage* ProgressEventImage; // 0x268
};

struct UWBP_WeaponPickup_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Glitch; // 0x268
	UTextBlock* descriptiontext_2; // 0x270
	UImage* GunIcon_BLUE; // 0x278
	UImage* GunIcon_RED; // 0x280
	UTextBlock* GunName; // 0x288
	UTextBlock* GunName_BLUE; // 0x290
	UTextBlock* GunName_RED; // 0x298
	UImage* GunPickupIcon; // 0x2a0
	UInvalidationBox* IB_Root; // 0x2a8
	UPlatformKeyImage_C* PlatformKeyImage; // 0x2b0
	UPlatformKeyImage_C* PlatformKeyImage_2; // 0x2b8
	UPlatformKeyImage_C* PlatformKeyImage_3; // 0x2c0
	UTextBlock* PressOrHoldText; // 0x2c8
	UCanvasPanel* WholeWidgetCanvasPanel; // 0x2d0
	UHUDTextDataAsset* HUD Colour; // 0x2d8
	UHUDTextDataAsset* HUDColour; // 0x2e0
};

struct AGameSession {
	int32_t MaxSpectators; // 0x220
	int32_t MaxPlayers; // 0x224
	int32_t MaxPartySize; // 0x228
	char MaxSplitscreensPerConnection; // 0x22c
	bool bRequiresPushToTalk; // 0x22d
	FName SessionName; // 0x230
};

struct UNiagaraDataInterfaceTexture {
	UTexture* Texture; // 0x38
};

struct ABattalionCharacter {
	TArray<ECollisionChannel> LOSTraceBlockingObjects; // 0x4c8
	bool bHasFireHeld; // 0x4e8
	float JoystickInputMaxDuration; // 0x4f4
	FTimerHandle TimerHandle_MeleeEquipHoldTimer; // 0x500
	FTimerHandle TimerHandle_ControllerSwapWeaponTimer; // 0x508
	FTimerHandle TimerHandle_GrenadeThrowFullyEndedTimer; // 0x510
	bool bMeleeHoldEquipComplete; // 0x518
	bool bWeaponSwapEquipComplete; // 0x519
	FString LastSetSurface; // 0x520
	float TimeCycleWeaponStarted; // 0x538
	bool bWantsToADSNewWeapon; // 0x53c
	ABattalionGrenade* GrenadeClass; // 0x550
	ABattalionSmokeGrenade* SmokeGrenadeClass; // 0x558
	ABattalionIncendiaryGrenade* IncendiaryGrenadeClass; // 0x560
	ABattalionFlashGrenade* FlashGrenadeClass; // 0x568
	ABattalionStunGrenade* StunGrenadeClass; // 0x570
	ABattalionGrenadePickup* USGrenadePickupClass; // 0x578
	ABattalionGrenadePickup* DEGrenadePickupClass; // 0x580
	ABattalionGrenadePickup* RUSGrenadePickupClass; // 0x588
	ABattalionGrenadePickup* BRITGrenadePickupClass; // 0x590
	ABattalionGrenadePickup* SpecialGrenadePickupClass; // 0x598
	TArray<FString> KnifeTestProperty; // 0x5a0
	float RayStartOffsetForward; // 0x5b0
	FVector DefaultCullVolumeWeaponScale; // 0x5b4
	FVector DefaultCullVolumeHeadScale; // 0x5c0
	FVector DefaultCullVolumeBodyScale; // 0x5cc
	TArray<UMaterialInstanceDynamic*> MeshDynamicMaterials; // 0x650
	TArray<UMaterialInstanceDynamic*> HeadMeshDynamicMaterials; // 0x660
	TArray<UMaterialInstanceDynamic*> WeaponDynamicMaterials; // 0x670
	UDamageType* KnifeDamageType; // 0x680
	UDamageType* QuickMeleeDamageType; // 0x688
	UDamageType* FallDamageType; // 0x690
	UDamageType* FireDamageType; // 0x698
	float FallDamageMinSpeed; // 0x6a0
	float FallDamageMaxSpeed; // 0x6a4
	float FallDamageMinDamage; // 0x6a8
	float FallDamageMaxDamage; // 0x6ac
	int32_t WantedWeaponSlot; // 0x6b0
	int32_t PreviousWeaponSlot; // 0x6b4
	UDamageType* NadeDamageType; // 0x6b8
	UDamageType* BombDamageType; // 0x6c0
	float VoiceOverDistance; // 0x6c8
	float VoiceOverFriendlyDistance; // 0x6cc
	float VoiceLinePlayedIncrementSeconds; // 0x6d0
	float VoiceLineDeathScreamDistance; // 0x6d4
	TArray<EGrenadeType> Grenades; // 0x6e0
	TArray<ESpecialGrenadeType> SpecialGrenades; // 0x6f0
	UTexture2D* SniperCrosshairTexture; // 0x700
	float SensitivityMultiplier; // 0x708
	float UnScopeVelocityThreshold; // 0x70c
	bool bIsPerformingLeftHandAction; // 0x710
	bool bTargetingBlocked; // 0x711
	USceneComponent* Mesh1PSceneComponent; // 0x718
	UAudioPassByComponent* AudioPassByComponent; // 0x720
	UCapsuleComponent* ProneCapsuleComponent; // 0x728
	UWidgetComponent* PlayerName; // 0x730
	UHUDPlayerName* PlayerNameInstance; // 0x738
	UFOVSkeletalMeshComponent* Mesh1P; // 0x740
	UFOVSkeletalMeshComponent* Mesh1PSocketMesh; // 0x748
	UFOVSkeletalMeshComponent* Mesh1PSocketMeshAlternate; // 0x750
	USkeletalMeshComponent* Mesh3PSocketMesh; // 0x758
	USkeletalMeshComponent* Mesh3PSocketMeshAlternate; // 0x760
	UPlayerSceneCaptureComponent2D* PlayerSceneCapture2D; // 0x768
	FName WeaponAttachPoint; // 0x770
	USkeletalMeshComponent* MeshHead; // 0x778
	USkeletalMeshComponent* MeshBomb; // 0x780
	FWeaponStopper EmergencyStopper; // 0x788
	TArray<FTeamOutfit> TeamOutfits; // 0x798
	TArray<ABattalionWeapon*> Inventory; // 0x7a8
	USkeletalMesh* SmokeGrenadeMesh; // 0x7b8
	USkeletalMesh* SmokeGrenadeMeshTP; // 0x7c0
	UObject* SmokeGrenadeMeshClass; // 0x7c8
	USkeletalMesh* AmericanGrenadeMesh; // 0x7d0
	USkeletalMesh* AmericanGrenadeMeshTP; // 0x7d8
	UObject* AmericanGrenadeMeshClass; // 0x7e0
	USkeletalMesh* GermanGrenadeMesh; // 0x7e8
	USkeletalMesh* GermanGrenadeMeshTP; // 0x7f0
	UObject* GermanGrenadeMeshClass; // 0x7f8
	USkeletalMesh* RussianGrenadeMesh; // 0x800
	USkeletalMesh* RussianGrenadeMeshTP; // 0x808
	USkeletalMesh* BritishGrenadeMesh; // 0x810
	USkeletalMesh* BritishGrenadeMeshTP; // 0x818
	UObject* RussianGrenadeMeshClass; // 0x820
	UObject* BritishGrenadeMeshClass; // 0x828
	ABattalionWeapon* CurrentWeapon; // 0x830
	AActor* NearPickupWeapon; // 0x838
	bool bShouldAutoPickupAmmo; // 0x840
	FTakeHitInfo LastTakeHitInfo; // 0x848
	float TargetingSpeedModifier; // 0x980
	char bPendingTargeting : 1; // 0x985
	char bPendingTargetingToggled : 1; // 0x985
	char bHorizontalSpeedEnabled : 1; // 0x985
	bool bADSState; // 0x986
	char bIsTargeting : 1; // 0x987
	float TargetingTransition; // 0x988
	float TargetingTransitionProgress; // 0x98c
	float TargetingSlowTransitionSpeed; // 0x994
	float TargetingAnimProgress; // 0x998
	FVector VelocityForAnim; // 0x99c
	FVector LastInAirVelocityForAnim; // 0x9a8
	FRotator LastVelocityRotationForAnim; // 0x9b4
	bool JumpedForAnim; // 0x9c0
	float CurrentLean; // 0x9c4
	float LeanLeftTarget; // 0x9c8
	float LeanRightTarget; // 0x9cc
	float LeanCheckDistance; // 0x9d0
	float LeanDistanceModifier; // 0x9d4
	float RunningSpeedModifier; // 0x9d8
	float WeaponPickupDistance; // 0x9dc
	float LeaningSpeedModifier; // 0x9e0
	float LeaningSpeedADSModifier; // 0x9e4
	UCurveFloat* LeanADSWeapRollCurve; // 0x9e8
	float LeanExtent; // 0x9f0
	float BattEyeHeight; // 0x9f4
	float BattCrouchedEyeHeight; // 0x9f8
	float BattPronedEyeHeight; // 0x9fc
	float HoldTimeToProne; // 0xa0c
	float HoldTimeToSwitchWeapon; // 0xa18
	char WantsToLeanRight : 1; // 0xa1c
	char WantsToLeanLeft : 1; // 0xa1c
	FVector ViewRecoilSpeed; // 0xa28
	FVector ViewRecoil; // 0xa34
	FVector ViewRecoilCharacterClamp; // 0xa4c
	float ViewRecoilPermanentPercentage; // 0xa58
	FVector2D ViewSwayPitchClamp; // 0xa9c
	FVector2D ViewSwayYawClamp; // 0xaa4
	bool bHasFinishedDeathAnimation; // 0xad4
	UCurveFloat* FlinchCurve; // 0xad8
	UCurveFloat* RedFlinchCurve; // 0xae0
	float FlinchHeadScalar; // 0xae8
	UCurveFloat* ProneToCrouchInterp; // 0xb08
	UCurveFloat* CrouchToProneInterp; // 0xb10
	float ProneRotationMaxPitchClamp; // 0xb20
	float ProneRotationMinPitchClamp; // 0xb24
	float StandingRotationMaxPitchClamp; // 0xb28
	float StandingRotationMinPitchClamp; // 0xb2c
	float GrenadePrepTime; // 0xb40
	float GrenadeThrowTime; // 0xb44
	float GrenadeThrowAnimLength; // 0xb48
	float GrenadeWeaponRequipTime; // 0xb4c
	char bMeleeAttacking : 1; // 0xb54
	FKnifeAnimationInfo KnifeInfo; // 0xb58
	bool bMeleeAttackingAsPrimary; // 0xb5c
	float KnifeAnimLength; // 0xb60
	float KnifeAttackTime; // 0xb64
	float KnifeCancelTime; // 0xb68
	bool bGrenadePrepared; // 0xb6c
	uint32_t bGrenadeThrowing; // 0xb70
	char bGrenadeHeld; // 0xb74
	char bHasBomb; // 0xb75
	TArray<UMaterialInstanceDynamic*> MeshMIDs; // 0xb80
	UMaterialInstanceDynamic* Mesh1PMID; // 0xb90
	FSpecialAnim LadderAnim; // 0xb98
	FCharacterAnim GrenadeAnim; // 0xbb8
	FCharacterAnim GermanGrenadeAnim; // 0xbc8
	FCharacterAnim RussianGrenadeAnim; // 0xbd8
	FCharacterAnim BritishGrenadeAnim; // 0xbe8
	FCharacterAnim SmokeGrenadeAnim; // 0xbf8
	UCurveVector* ActiveGrenadePrepareCameraSway; // 0xc28
	UCurveVector* ActiveGrenadeThrowCameraSway; // 0xc30
	FCharacterAnim BombPlantedAnim; // 0xc38
	FCharacterAnim BombDefusedAnim; // 0xc48
	USkeletalMesh* KnifeMesh; // 0xc58
	UObject* KnifeMeshClass; // 0xc60
	FCharacterAnim KnifeAnim; // 0xc68
	FCharacterAnim EquippedKnifeAnim; // 0xc78
	UCurveVector* KnifeAnimSway; // 0xc88
	UCurveVector* KnifeAnimSwayTranslation; // 0xc90
	UAnimMontage* DeathAnim; // 0xc98
	UAnimMontage* FlashedMontagePtr; // 0xca0
	TArray<FDeathAnim> DeathAnims; // 0xca8
	TArray<FDeathAnim> DeathGrenadeAnims; // 0xcb8
	TArray<FDeathAnim> DeathHeadshotAnims; // 0xcc8
	TArray<FDeathAnim> DeathPelvisAnims; // 0xcd8
	TArray<FDeathAnim> DeathStomachAnims; // 0xce8
	TArray<FDeathAnim> DeathNeckAnims; // 0xcf8
	TArray<FDeathAnim> DeathBehindAnims; // 0xd08
	UAkAudioEvent* ThrowingAxeSound; // 0xd68
	UAkComponent* DefaultAkComponent; // 0xd70
	UAkAudioEvent* DamageFromBurningSound; // 0xd78
	UAkAudioEvent* BulletPassByEvent; // 0xd80
	UAkAudioEvent* BulletPassByEvent_Sniper; // 0xd88
	UAkAudioEvent* DeathSound; // 0xd90
	UAkAudioEvent* GrenadePickedUpEvent; // 0xd98
	UAkAudioEvent* SpecialGrenadePickedUpEvent; // 0xda0
	UAkAudioEvent* WeaponPickedUpEvent; // 0xda8
	UAkAudioEvent* HurtmarkerSoundEvent; // 0xdb0
	UAkAudioEvent* HurtMarkerHeadshotSound; // 0xdb8
	UAkAudioEvent* DamageFromFallSoftSound; // 0xdc0
	UAkAudioEvent* DamageFromFallHardSound; // 0xdc8
	UAkAudioEvent* HurtmarkerKnifeSoundEvent; // 0xdd0
	UAnimMontage* VaultHigh; // 0xdd8
	UAnimMontage* VaultMedium; // 0xde0
	UAnimMontage* VaultLow; // 0xde8
	UAkAudioEvent* CrouchToStandingSound; // 0xdf0
	UAkAudioEvent* StandingToCrouchSound; // 0xdf8
	UAkAudioEvent* StandingToProneSound; // 0xe00
	UAkAudioEvent* ProneToStandingSound; // 0xe08
	UAkAudioEvent* CrouchToProneSound; // 0xe10
	UAkAudioEvent* ProneToCrouchSound; // 0xe18
	UAkAudioEvent* VaultSound; // 0xe20
	UParticleSystem* DeathBloodFX; // 0xe28
	UParticleSystem* HitWarpFX; // 0xe30
	FRotator DeathBloodFXRotator; // 0xe38
	FVector DeathBloodFXScalar; // 0xe44
	UParticleSystem* RespawnFX; // 0xe50
	UAkAudioEvent* RespawnSound; // 0xe58
	UAkAudioEvent* LowHealthLoopSound; // 0xe60
	UAkAudioEvent* LowHealthSoundStop; // 0xe68
	FName LowHealthVolumeParam; // 0xe70
	UAkAudioEvent* LowHealthGasp; // 0xe80
	UAkAudioEvent* HealthRegeneratedSound; // 0xe88
	UAkAudioEvent* HealthStartedRegeneratingSound; // 0xe90
	UAkAudioEvent* RunLoopSound; // 0xe98
	UAkAudioEvent* RunStopSound; // 0xea0
	UAkAudioEvent* TargetingSound; // 0xea8
	UAkAudioEvent* TargetingOutSound; // 0xeb0
	UAkAudioEvent* StopCriticalHealthSounds; // 0xeb8
	UAkAudioEvent* ActionFootstep; // 0xec0
	UAkAudioEvent* ActionLadderFootstep; // 0xec8
	UAkAudioEvent* ActionLadderFootstepMetal; // 0xed0
	UAkAudioEvent* ActionLand; // 0xed8
	UAkAudioEvent* ActionJump1p; // 0xee0
	UAkAudioEvent* ActionJump3p; // 0xee8
	UAkAudioEvent* HitmarkerSound; // 0xef0
	UAkAudioEvent* HitmarkerKnifeSound; // 0xef8
	UAkAudioEvent* HitmarkerHeadshotSound; // 0xf00
	UAkAudioEvent* HitmarkerHeadshotKillSound; // 0xf08
	float MeleeDistance; // 0xf10
	float QuickMeleeDamage; // 0xf14
	bool bDebugMelee; // 0xf18
	float MeleeProneDistance; // 0xf40
	UAkAudioEvent* ZombieAttackVocal; // 0xf48
	UAkAudioEvent* ZombieAttackFlesh; // 0xf50
	UAkAudioEvent* SurvivorKillConfirmed; // 0xf58
	UAkAudioEvent* WeaponPickUpSound; // 0xf60
	UAkAudioEvent* StartSlideLoop; // 0xf68
	UAkAudioEvent* StopSlideLoop; // 0xf70
	UAkAudioEvent* KillConfirmedSound; // 0xf80
	UAkAudioEvent* KillConfirmedCollateralSound; // 0xf88
	UAkAudioEvent* HeadshotKillConfirmedSound; // 0xf90
	UAkAudioEvent* StartBombPlantSound; // 0xf98
	UAkAudioEvent* StartDefusePlantSound; // 0xfa0
	UAkAudioEvent* FallingSound; // 0xfa8
	UAkAudioEvent* DeathScream; // 0xfb0
	UAkAudioEvent* StopFallingEvent; // 0xfb8
	UAkAudioEvent* FlashStartSound; // 0xfc0
	UAkAudioEvent* FlashStopSound; // 0xfc8
	float FirstPersonWalkTriggerSpeedDivisor; // 0xfd0
	float FirstPersonLadderWalkTriggerSpeedDivisor; // 0xfd4
	UCurveVector* WalkGunBobRotation; // 0xfe0
	float WalkGunBobRotationScale; // 0xfe8
	float WalkGunBobRotationSpeed; // 0xfec
	FVector ScreenSpaceWalkGunBobLocation; // 0xff0
	FVector HipStanceOffsetCrouch; // 0x10b0
	FVector HipStanceOffsetProne; // 0x10bc
	float LeftFootPlacementTime; // 0x10c8
	float RightFootPlacementTime; // 0x10cc
	float LeftFootSecondaryPlacementTime; // 0x10d0
	float RightFootSecondaryPlacementTime; // 0x10d4
	UCurveVector* SprintScreenBob; // 0x10d8
	float SprintScreenBobRotationScale; // 0x10e0
	float SprintScreenBobRotationSpeed; // 0x10e4
	float CameraAnimLerpSpeed; // 0x1114
	UCurveVector* JumpLandScreenBob; // 0x1118
	UCurveVector* JumpLandGunBob; // 0x1120
	float JumpLandBobMinScale; // 0x1128
	float JumpLandBobMaxScale; // 0x112c
	float JumpLandBobMinSpeed; // 0x1130
	float JumpLandBobMaxSpeed; // 0x1134
	ABattalionPlayerState* ProxyPlayerState; // 0x1168
	USkeletalMesh* EnemyTeamFPPMesh; // 0x1170
	USkeletalMesh* EnemyTeamTPPMesh; // 0x1178
	USkeletalMesh* EnemyTeamTPPHeadMesh; // 0x1180
	USkeletalMesh* FriendlyTeamFPPMesh; // 0x1188
	USkeletalMesh* FriendlyTeamTPPMesh; // 0x1190
	USkeletalMesh* FriendlyTeamTPPHeadMesh; // 0x1198
	UPhysicsAsset* NormalPhysicsAsset; // 0x11a8
	UPhysicsAsset* RagdollPhysicsAsset; // 0x11b0
	TArray<UDamageType*> MassiveDamageTypes; // 0x1228
	UCurveFloat* KillAbberationCurve; // 0x1250
	FPostProcessSettings DefaultPostProcessSettings; // 0x1260
	FPostProcessSettings CurrentPostProcessSettings; // 0x17b0
	float QuickReloadTime; // 0x1d00
	UAkAudioEvent* QuickReloadSound; // 0x1d08
	float QuickFireGlitchTime; // 0x1d10
	UAkAudioEvent* QuickFireGlitchSound; // 0x1d18
	bool MovementStoppedByFire; // 0x1d20
	UTimelineComponent* FlashTimelinePtr; // 0x1da0
	ABattalionPlayerControllerGMBase* CurrentViewerPC; // 0x1db0
	bool bHealthRegenerating; // 0x1db8
	char bIsDying : 1; // 0x1dbc
	float Health; // 0x1dc0
	float LastHitTime; // 0x1dc4
	float LastWeaponFireTime; // 0x1dc8
	bool bIsFlashed; // 0x1dcc
	UCurveFloat* FlashCurvePtr; // 0x1dd0
	UCameraShakeBase* CameraShakePtr; // 0x1dd8
	UMaterialParameterCollection* FlashMeterialParameterCollectionPtr; // 0x1de0
	FName WhiteScreenWeightParameterName; // 0x1de8
	FName ScreenCaptureWeightParameterName; // 0x1df0
	char bPressedVault : 1; // 0x1e14
	int32_t ClientMaxCorpsesOverTenPlayers; // 0x1e18
	int32_t ClientMaxCorpsesUnderTenPlayers; // 0x1e1c
	float ClientCorpseTimeout; // 0x1e20
	float ServerCorpseTimeout; // 0x1e24
	ECharacterTeam CharacterType; // 0x1e28
	EClassName CurrentClass; // 0x1e29
	ENationType Nation; // 0x1e2a
	int32_t CharacterGearSetType; // 0x1e2c
	float PossesedAliveTime; // 0x1e30
	float HoldingWeaponTime; // 0x1e34
	ALadder* LadderForAnimation; // 0x1e38
	FVector DirectionToDamage; // 0x1e40
	AController* CachedController; // 0x1e50
	TMap<AController*, float> Assisters; // 0x1e58
	EStanceType CurrentStance; // 0x1ed0
	bool bIsCriticalHealth; // 0x1ef8
	float CriticalHealth; // 0x1f04
	FHealthRegenEvent HealthRegenBelowCritical; // 0x1f08
	FHealthRegenEvent HealthRegenAboveCritical; // 0x1f24
	bool bCriticalRegen; // 0x1f40
	float HealthRegenAmount; // 0x1f44
	float HealthRegenDelay; // 0x1f48
	float HealthRegenSpeed; // 0x1f4c
	bool bUseDeathAnim; // 0x1f50
	UAkAudioEvent* CriticalHealthLoop; // 0x1f58
	UAkAudioEvent* CriticalHealthLoopReset; // 0x1f60
	UAkAudioEvent* CritcalHealthRegenerated; // 0x1f68
	bool bLocalOutline; // 0x1f70
	bool bForceNoOutline; // 0x1f79
	ABattalionCharacter* LastDamagedPlayer; // 0x1f90
	FPostProcessSettings InfectedPostProcessSettings; // 0x1fa0
	UMaterialInstance* InfectedFace; // 0x24f0
	UMaterialInstance* InfectedBody; // 0x24f8
	UAkAudioEvent* InfectedPlayIdleLoop_FP; // 0x2500
	UAkAudioEvent* InfectedPlayIdleLoop_3P; // 0x2508
	UAkAudioEvent* InfectedStopIdleLoop_FP; // 0x2510
	UAkAudioEvent* InfectedStopIdleLoop_3P; // 0x2518
	UAkAudioEvent* InfectedAttackVocal_FP; // 0x2520
	UAkAudioEvent* InfectedAttackVocal_3P; // 0x2528
	UAkAudioEvent* InfectedDeathScream; // 0x2530
	float AutoAimInnerRadius; // 0x2548
	float AutoAimOuterRadius; // 0x254c
	float AutoAimInnerRadiusCrouching; // 0x2550
	float AutoAimOuterRadiusCrouching; // 0x2554
	float AutoAimInnerRadiusProne; // 0x2558
	float AutoAimOuterRadiusProne; // 0x255c
	UCurveFloat* AutoAimTargetInnerRadiusVsDistanceCurve; // 0x2560
	UCurveFloat* AutoAimTargetOuterRadiusVsDistanceCurve; // 0x2568
	UCurveFloat* JoyStickAccelerationCurveVertical; // 0x2570
	UCurveFloat* JoyStickAccelerationCurveHorizontal; // 0x2578
	UCurveFloat* JoyStickAccelerationCurveADSVertical; // 0x2580
	UCurveFloat* JoyStickAccelerationCurveADSHorizontal; // 0x2588
	UCurveFloat* JoyStickAccelerationCurveScopedVertical; // 0x2590
	UCurveFloat* JoyStickAccelerationCurveScopedHorizontal; // 0x2598
	UCurveFloat* AutoAimFollowDistanceCurve; // 0x25a0
	UCurveFloat* AutoAimFollowDistanceCurvePrecision; // 0x25a8
	UCurveFloat* AutoAimFollowDistanceCurveFocus; // 0x25b0
	UCurveFloat* AutoAimFollowDistanceCurveScoped; // 0x25b8
	UCurveFloat* AutoAimFollowDistanceCurveScopedPrecision; // 0x25c0
	UCurveFloat* AutoAimFollowDistanceCurveScopedFocus; // 0x25c8
	UCurveFloat* AutoAimFollowDistanceCurveADS; // 0x25d0
	UCurveFloat* AutoAimFollowDistanceCurveADSPrecision; // 0x25d8
	UCurveFloat* AutoAimFollowDistanceCurveADSFocus; // 0x25e0
	UCurveFloat* AutoAimFollowDistanceCurveScopedADS; // 0x25e8
	UCurveFloat* AutoAimFollowDistanceCurveScopedADSPrecision; // 0x25f0
	UCurveFloat* AutoAimFollowDistanceCurveScopedADSFocus; // 0x25f8
	UCurveFloat* AutoAimTargetStrengthCurveHorizontal; // 0x2600
	UCurveFloat* AutoAimTargetStrengthCurveHorizontalPrecision; // 0x2608
	UCurveFloat* AutoAimTargetStrengthCurveHorizontalFocus; // 0x2610
	UCurveFloat* AutoAimTargetStrengthCurveVertical; // 0x2618
	UCurveFloat* AutoAimTargetStrengthCurveVerticalPrecision; // 0x2620
	UCurveFloat* AutoAimTargetStrengthCurveVerticalFocus; // 0x2628
	UCurveFloat* AutoAimTreacleHipCurveHorizontal; // 0x2630
	UCurveFloat* AutoAimTreacleHipCurveHorizontalPrecision; // 0x2638
	UCurveFloat* AutoAimTreacleHipCurveHorizontalFocus; // 0x2640
	UCurveFloat* AutoAimTreacleADSCurveHorizontal; // 0x2648
	UCurveFloat* AutoAimTreacleADSCurveHorizontalPrecision; // 0x2650
	UCurveFloat* AutoAimTreacleADSCurveHorizontalFocus; // 0x2658
	UCurveFloat* AutoAimTreacleScopeCurveHorizontal; // 0x2660
	UCurveFloat* AutoAimTreacleScopeCurveHorizontalPrecision; // 0x2668
	UCurveFloat* AutoAimTreacleScopeCurveHorizontalFocus; // 0x2670
	UCurveFloat* AutoAimTreacleHipCurveVertical; // 0x2678
	UCurveFloat* AutoAimTreacleADSCurveVertical; // 0x2680
	UCurveFloat* AutoAimTreacleScopeCurveVertical; // 0x2688
	UCurveFloat* AutoAimDistanceStrengthCurve; // 0x2690
	UCurveFloat* AutoAimDistanceStrengthCurvePrecision; // 0x2698
	UCurveFloat* AutoAimDistanceStrengthCurveFocus; // 0x26a0
	UCurveFloat* AutoAimPlayerVelocityStrengthCurve; // 0x26a8
	float ControllerScopedSensitivityMultiplier; // 0x26b0
	float ControllerVerticalSensitivityMultiplier; // 0x26b4
	float ControllerHorizontalSensitivityMultiplier; // 0x26b8
	float ControllerBaseADSSensitivityMultiplier; // 0x26bc
	float ControllerTriggerAxisThreshold; // 0x26c0
	float ControllerResetAccelerationDotThreshold; // 0x26c4
	float UseButtonHoldTime; // 0x26e4
	float UseButtonMeleeHold; // 0x26e8
	float UseButtonWeaponSwapHold; // 0x26ec
	float TimeToDestroy; // 0x2708
	UBattalionGameInstance* BattInstance; // 0x2710
	UBattalionSettings* BattSettings; // 0x2718
	int32_t ControllerSensitivityStepOffset; // 0x2720
	float ControllerSensitivityStepMultiplier; // 0x2724
	bool bCanEquipCancelFromFiring; // 0x2728
	TWeakObjectPtr<ACharacter> LastAutoAimTarget; // 0x272c
	bool bEnableEquipInput; // 0x2735
	bool bEnableReloadInput; // 0x2736
	bool bEnableLookInput; // 0x2737
	bool ShouldRetryUpdateTeamMesh; // 0x2738
	int32_t RetryUpdateTeamCount; // 0x273c
	int32_t MaxRetryUpdateTeamAttempts; // 0x2740
	FGrenadeThrowInfo PreparedGrenadeInfo; // 0x2770
	bool bIsCurrentlyThrowingGrenade; // 0x2798
	float DestroyTimer; // 0x279c
	bool bShouldDestroy; // 0x27a0
	int32_t MeleeComboIndex; // 0x27a4
	int32_t MeleeComboMax; // 0x27a8
	float MeleeComboMaxCutoffTime; // 0x27ac
};

struct UHardpointGameOverviewWidget {
	float WaitingToStartTimer; // 0x390
	FText OvertimeText; // 0x398
	ESlateVisibility OvertimeTimeVisibility; // 0x3b0
};

struct UInterpTrackVisibility {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UWBP_SniperVignette_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* CanvasPanel_1; // 0x268
	UImage* Image; // 0x270
	UImage* Image_362; // 0x278
	UImage* IMG_BluredScope; // 0x280
	UImage* IMG_NonBluredScope; // 0x288
	UImage* IMG_SniperVignette; // 0x290
	UCurveFloat* BlurCurve; // 0x298
	float BlurTransition; // 0x2a0
	APromodCharacter* PromodCharacter; // 0x2a8
	bool newVisibility; // 0x2b0
	float Delta Time; // 0x2b4
};

struct UNavigationGraphNodeComponent {
	FNavGraphNode Node; // 0x1f8
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x210
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x218
};

struct UPostEventAsync {
	FMulticastInlineDelegate Completed; // 0x30
};

struct UMaterialExpressionDDX {
	FExpressionInput Value; // 0x40
};

struct UKantanCategoryStyleSet {
	TArray<FKantanCategoryStyle> Styles; // 0x30
};

struct UGetGeoLocationAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UBigTimeDisplay_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* IMG_ComparisonIndicator; // 0x268
	UImage* IMG_PlusIcon; // 0x270
	UTextBlock* TimeDisplayText; // 0x278
	UWidgetSwitcher* WS_ComparisonType; // 0x280
	float Seconds; // 0x288
	bool ShouldColourText; // 0x28c
	bool ShouldUseTriangle; // 0x28d
};

struct USettings_Backdrop__Config_Selected_C {
	UImage* Backdrop-colour-image; // 0x260
	UImage* Breaker; // 0x268
	UImage* Line; // 0x270
	UImage* slant; // 0x278
	UImage* slant_2; // 0x280
};

struct UAnimationSharingSetup {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct UOnlinePIESettings {
	bool bOnlinePIEEnabled; // 0x38
	TArray<FPIELoginSettingsInternal> Logins; // 0x40
};

struct UMaterialExpressionConstant {
	float R; // 0x40
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x60
};

struct UMaterialExpressionConstant3Vector {
	FLinearColor Constant; // 0x40
};

struct UMedal30BombTDM {
	ATDMGameMode* TDMGameMode; // 0x48
};

struct UAkLuminInitializationSettings {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UMapSelectDataAsset {
	TArray<FMapSelectList> Maps; // 0x30
};

struct UInterpTrackInstMove {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct AFireUp_HandCannon {
	ABattalionWeapon* HandCannonWeaponClass; // 0x3c8
	ABattalionWeapon_Instant* SpawnedHandCannon; // 0x3d0
	ESlotType PreviousSlotType; // 0x3d8
	int32_t CachedKills; // 0x3dc
	UAkAudioEvent* HandCannonShot; // 0x3e0
};

struct UWorld {
	ULevel* PersistentLevel; // 0x30
	UNetDriver* NetDriver; // 0x38
	ULineBatchComponent* LineBatcher; // 0x40
	ULineBatchComponent* PersistentLineBatcher; // 0x48
	ULineBatchComponent* ForegroundLineBatcher; // 0x50
	AGameNetworkManager* NetworkManager; // 0x58
	UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60
	TArray<UObject*> ExtraReferencedObjects; // 0x68
	TArray<UObject*> PerModuleDataObjects; // 0x78
	TArray<ULevelStreaming*> StreamingLevels; // 0x88
	FStreamingLevelsToConsider StreamingLevelsToConsider; // 0x98
	FString StreamingLevelsPrefix; // 0xc0
	ULevel* CurrentLevelPendingVisibility; // 0xd0
	ULevel* CurrentLevelPendingInvisibility; // 0xd8
	UDemoNetDriver* DemoNetDriver; // 0xe0
	AParticleEventManager* MyParticleEventManager; // 0xe8
	APhysicsVolume* DefaultPhysicsVolume; // 0xf0
	char bAreConstraintsDirty : 1; // 0x10e
	UNavigationSystemBase* NavigationSystem; // 0x110
	AGameModeBase* AuthorityGameMode; // 0x118
	AGameStateBase* GameState; // 0x120
	UAISystemBase* AISystem; // 0x128
	UAvoidanceManager* AvoidanceManager; // 0x130
	TArray<ULevel*> Levels; // 0x138
	TArray<FLevelCollection> LevelCollections; // 0x148
	UGameInstance* OwningGameInstance; // 0x180
	TArray<UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x188
	UCanvas* CanvasForRenderingToTarget; // 0x198
	UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x1a0
	TSet<UActorComponent*> ComponentsThatNeedPreEndOfFrameSync; // 0x1f8
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x248
	TArray<UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x258
	UWorldComposition* WorldComposition; // 0x5d8
	FWorldPSCPool PSCPool; // 0x668
};

struct UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0x60
	FGuid ExpressionGUID; // 0x68
	FName Group; // 0x78
};

struct UClothingAssetBase {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct ULandscapeMeshCollisionComponent {
	FGuid MeshGuid; // 0x520
};

struct ABP_MapEditorGizmo_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x510
};

struct UWBP_CargoOverviewScore_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UProgressBar* LeftTeamProgressBar; // 0x268
	UTextBlock* LeftTeamScore; // 0x270
	UTextBlock* LeftTeamScore2; // 0x278
	UImage* MatchTimerBackground; // 0x280
	UImage* PayloadDisabledIcon; // 0x288
	UImage* PayloadProgressBackground; // 0x290
	UImage* PayloadScoreBox; // 0x298
	UImage* PayloadSpeedBox; // 0x2a0
	UImage* PayloadSpeedImage; // 0x2a8
	UTextBlock* PrimaryTimer; // 0x2b0
	UImage* ProgressBorder; // 0x2b8
	UProgressBar* RightTeamProgressBar; // 0x2c0
	UTextBlock* RightTeamScore; // 0x2c8
	UWBP_CargoProgress_C* WBP_CargoProgress; // 0x2d0
	bool bBombPlanted; // 0x2d8
	float BombTimer; // 0x2dc
	ECargoPlayerSideState PlayerSide; // 0x2e0
};

struct UBTDecorator_HasLoSTo {
	FBlackboardKeySelector EnemyKey; // 0x68
};

struct UBoneMaskFilter {
	TArray<FInputBlendPose> BlendPoses; // 0x28
};

struct UComponentDelegateBinding {
	TArray<FBlueprintComponentDelegateBinding> ComponentDelegateBindings; // 0x28
};

struct UARTextureCameraDepth {
	EARDepthQuality DepthQuality; // 0xf8
	EARDepthAccuracy DepthAccuracy; // 0xf9
	bool bIsTemporallySmoothed; // 0xfa
};

struct UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UGizmoBoxComponent {
	FVector Origin; // 0x460
	FQuat Rotation; // 0x470
	FVector Dimensions; // 0x480
	float LineThickness; // 0x48c
	bool bRemoveHiddenLines; // 0x490
	bool bEnableAxisFlip; // 0x491
};

struct USkeletalBodySetup {
	bool bSkipScaleFromAnimation; // 0x2a0
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x2a8
};

struct UWBP_FullscreenMovie_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* MediaTexture; // 0x268
	UMediaPlayer* MediaPlayer; // 0x270
	UAkAudioEvent* Wwise Event; // 0x278
	FMulticastInlineDelegate OnPlaybackStarted; // 0x280
	FMulticastInlineDelegate OnPlaybackFinished; // 0x290
	FMulticastInlineDelegate OnPlaybackFailed; // 0x2a0
};

struct UBTService_DefaultFocus {
	char FocusPriority; // 0x98
};

struct UPhysicsThrusterComponent {
	float ThrustStrength; // 0x1f8
};

struct ABombMode_BombSpawn {
	int32_t StageID; // 0x220
};

struct UCameraAnim {
	UInterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	FBox BoundingBox; // 0x34
	char bRelativeToInitialTransform : 1; // 0x50
	char bRelativeToInitialFOV : 1; // 0x50
	float BaseFov; // 0x54
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5b0
};

struct UButtonWidgetStyle {
	FButtonStyle ButtonStyle; // 0x30
};

struct USourceEffectMidSideSpreaderPreset {
	FSourceEffectMidSideSpreaderSettings Settings; // 0x98
};

struct UBTTask_MoveDirectlyToward {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb0
	char bProjectVectorGoalToNavigation : 1; // 0xb0
	char bUpdatedDeprecatedProperties : 1; // 0xb0
};

struct UCameraComponent {
	float FieldOfView; // 0x1f8
	float OrthoWidth; // 0x1fc
	float OrthoNearClipPlane; // 0x200
	float OrthoFarClipPlane; // 0x204
	float AspectRatio; // 0x208
	char bConstrainAspectRatio : 1; // 0x20c
	char bUseFieldOfViewForLOD : 1; // 0x20c
	char bLockToHmd : 1; // 0x20c
	char bUsePawnControlRotation : 1; // 0x20c
	ECameraProjectionMode ProjectionMode; // 0x20d
	float PostProcessBlendWeight; // 0x240
	FPostProcessSettings PostProcessSettings; // 0x270
};

struct AStaticMeshActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	bool bStaticMeshReplicateMovement; // 0x228
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229
};

struct UMaterialExpressionBlackBody {
	FExpressionInput Temp; // 0x40
};

struct UKantanChart {
	FMargin Margins; // 0x108
	FText ChartTitle; // 0x118
	FMargin TitlePadding; // 0x130
	float UpdateTickRate; // 0x140
};

struct UMovieSceneNiagaraTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UMaterialExpressionDistanceToNearestSurface {
	FExpressionInput Position; // 0x40
};

struct UMaterialExpressionShadingPathSwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct ULandscapeLayerInfoObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UMRMeshComponent {
	UMaterialInterface* Material; // 0x450
	UMaterialInterface* WireframeMaterial; // 0x458
	bool bCreateMeshProxySections; // 0x460
	bool bUpdateNavMeshOnMeshUpdate; // 0x461
	bool bNeverCreateCollisionMesh; // 0x462
	UBodySetup* CachedBodySetup; // 0x468
	TArray<UBodySetup*> BodySetups; // 0x470
};

struct UFOVFixedStaticMeshComponent {
	float FOV; // 0x4d0
};

struct UMaterialExpressionSine {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UCircularThrobber {
	int32_t NumberOfPieces; // 0x108
	float Period; // 0x10c
	float Radius; // 0x110
	USlateBrushAsset* PieceImage; // 0x118
	FSlateBrush Image; // 0x120
	bool bEnableRadius; // 0x1a8
};

struct UAPB_UNDCRifle_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x308
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x350
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x3f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x438
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4b8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x538
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x600
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x748
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x7c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x810
	float Targeting Transition; // 0x858
};

struct UNiagaraComponent {
	UNiagaraSystem* Asset; // 0x440
	ENiagaraTickBehavior TickBehavior; // 0x448
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x450
	char bForceSolo : 1; // 0x518
	char bEnableGpuComputeDebug : 1; // 0x518
	char bAutoDestroy : 1; // 0x544
	char bRenderingEnabled : 1; // 0x544
	char bAutoManageAttachment : 1; // 0x544
	char bAutoAttachWeldSimulatedBodies : 1; // 0x544
	float MaxTimeBeforeForceUpdateTransform; // 0x548
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x550
	FMulticastInlineDelegate OnSystemFinished; // 0x568
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x578
	FName AutoAttachSocketName; // 0x580
	EAttachmentRule AutoAttachLocationRule; // 0x588
	EAttachmentRule AutoAttachRotationRule; // 0x589
	EAttachmentRule AutoAttachScaleRule; // 0x58a
};

struct UMovieScene3DPathSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct AWheeledVehicle {
	USkeletalMeshComponent* Mesh; // 0x280
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x288
};

struct UNUILevelUp {
	UTexture2D* OldIconTexture; // 0x278
	UTexture2D* NewIconTexture; // 0x280
	FString OldLevel; // 0x288
	FString NewLevel; // 0x298
	bool bNeedImageAnimation; // 0x2a8
};

struct UWBP_CargoPlayerIcons_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BlueBar; // 0x268
	UHorizontalBox* LeftTeamPlayerIcons; // 0x270
	UTextBlock* LeftTeamPlayersAliveValue; // 0x278
	UImage* RedBar; // 0x280
	UHorizontalBox* RightTeamPlayerIcons; // 0x288
	UTextBlock* RightTeamPlayersAliveValue; // 0x290
	UWidgetSwitcher* TeamInfoWidgetSwitcherL; // 0x298
	UWidgetSwitcher* TeamInfoWidgetSwitcherR; // 0x2a0
	UTextBlock* TeamNum1; // 0x2a8
	UTextBlock* TeamNum2; // 0x2b0
	TArray<UWBP_PlayerAliveIcon_C*> LeftTeamWidgets; // 0x2b8
	TArray<UWBP_PlayerAliveIcon_C*> RightTeamWidgets; // 0x2c8
	int32_t MissingWidgets; // 0x2d8
	int32_t AlivePlayers_Team0; // 0x2dc
	int32_t AlivePlayers_Team1; // 0x2e0
	TArray<APlayerState*> PlayersTeam0; // 0x2e8
	TArray<APlayerState*> PlayersTeam1; // 0x2f8
	bool bIsShootout; // 0x308
};

struct UDebug_Button-BLACK-LEFT-JUSTIFIED_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* TEXT_MOTION; // 0x268
	UWidgetAnimation* UNHOVER; // 0x270
	UWidgetAnimation* HOVER; // 0x278
	UTextBlock* BLUETEXT; // 0x280
	UImage* Blur-Steak; // 0x288
	UButton* DEBUG-BUTTON; // 0x290
	UTextBlock* REDTEXT; // 0x298
	UTextBlock* TOPTEXT; // 0x2a0
	FText Text; // 0x2a8
	bool NewVar_1; // 0x2c0
	FMulticastInlineDelegate ButtonClicked; // 0x2c8
};

struct UWBP_GrenadeIndicator_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UCanvasPanel* CanvasPanel_1; // 0x280
	UWBP_GrenadeMarker_C* WBP_GrenadeMarker1; // 0x288
	UWBP_GrenadeMarker_C* WBP_GrenadeMarker2; // 0x290
	UWBP_GrenadeMarker_C* WBP_GrenadeMarker3; // 0x298
	UWBP_GrenadeMarker_C* WBP_GrenadeMarker4; // 0x2a0
	UWBP_GrenadeMarker_C* WBP_GrenadeMarker5; // 0x2a8
	TArray<UWBP_GrenadeMarker_C*> GrenadeMarkers; // 0x2b0
	UHUDTextDataAsset* HUD Colour; // 0x2c0
};

struct UNUIVideoTrainingPlaying {
	EVideoTrainingType CurrentVideoType; // 0x290
	UBattalionSubtitlesDataAsset* CurrentSubtitles; // 0x298
	FText DisplayName; // 0x2a0
	bool SubtitlesVisible; // 0x2b8
};

struct UMaterialExpressionTextureBase {
	UTexture* Texture; // 0x40
};

struct ASceneCapture {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UARPoseComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UNiagaraComponentPool {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct APromodPawn_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2dd0
	USphereComponent* BulletFlyByChecker; // 0x2dd8
	UPostProcessComponent* FlashPostProcess; // 0x2de0
	float Timeline_2_Radius_FFD76325486CF6F44C8725AC60C18F7B; // 0x2de8
	ETimelineDirection Timeline_2__Direction_FFD76325486CF6F44C8725AC60C18F7B; // 0x2dec
	UTimelineComponent* Timeline_3; // 0x2df0
	float Timeline_1_Radius_A1AFF3D84AC00D718CB1D287DCABDC6B; // 0x2df8
	ETimelineDirection Timeline_1__Direction_A1AFF3D84AC00D718CB1D287DCABDC6B; // 0x2dfc
	UTimelineComponent* Timeline_2; // 0x2e00
	float Timeline_0_Radius_1D8C7D22412F793B751EA7A874AB4CEE; // 0x2e08
	ETimelineDirection Timeline_0__Direction_1D8C7D22412F793B751EA7A874AB4CEE; // 0x2e0c
	UTimelineComponent* Timeline_1; // 0x2e10
	UDebugUI_C* DebugUI; // 0x2e18
	UWBP_StrafeJumpSpeedFeedback_C* StrafeSpeedUI; // 0x2e20
	bool bLoadPositionHeld; // 0x2e28
	bool bSavePositionHeld; // 0x2e29
	float FOVStore; // 0x2e2c
	UOnFireAwardsDataAsset* FireActionAwardsDataAsset; // 0x2e30
	bool bIgnoreLeanActionRelease; // 0x2e38
	FName SpatialMarkerParentBoneName_1; // 0x2e3c
	FVector SpatialMarkerPositionalOffset_1; // 0x2e44
	bool bIsInSmoke; // 0x2e50
	FVector LastHitLocationOffset; // 0x2e54
	FVector LastHitDirection; // 0x2e60
	FName Last Hit Bone Name; // 0x2e6c
	FVector Last Hit Location; // 0x2e74
	TArray<UMaterialInstanceDynamic*> MeshMID; // 0x2e80
	TArray<UMaterialInstanceDynamic*> DynamicMats; // 0x2e90
	FVector2D MousePos; // 0x2ea0
	UNiagaraSystem* DeathVFX; // 0x2ea8
	FVector2D LeftJoystickPos; // 0x2eb0
	FVector2D RightJoystickPos; // 0x2eb8
	UNiagaraSystem* DashVFX; // 0x2ec0
	char PrevControllerType; // 0x2ec8
	UBP_StunnedCameraModifier_C* StunnedVFX; // 0x2ed0
	UNiagaraSystem* HandCannonDeath; // 0x2ed8
	FHitResult DeathDamageHitResult; // 0x2ee0
	float TimeSinceStartedFiring; // 0x2f6c
	bool IsStartTimeSet; // 0x2f70
	float FinalRumbleIntensity; // 0x2f74
	float Max Rumble Intensity; // 0x2f78
	bool CameraModifierRemoved; // 0x2f7c
	float ArchitypeRumbleMultiplier; // 0x2f80
	float SMGRumbleMultiplier; // 0x2f84
	float RifleRumble Multiplier; // 0x2f88
	float SniperRumble Multiplier; // 0x2f8c
	float PistolRumble Multiplier; // 0x2f90
	float RumbleDuration; // 0x2f94
	ENUM_MovementState MovementState; // 0x2f98
	ENUM_MovementAction MovementAction; // 0x2f99
	ENUM_Gait Gait; // 0x2f9a
	ENUM_MovementState PrevMovementState; // 0x2f9b
	FRotator InAirRotation; // 0x2f9c
	ENUM_MovementAction PrevMovementAction; // 0x2fa8
	ENUM_Gait PrevActualGait; // 0x2fa9
	FVector PreviousVelocity; // 0x2fac
	FVector Acceleration; // 0x2fb8
	float Speed; // 0x2fc4
	bool IsMoving; // 0x2fc8
	FRotator LastVelocityRotation; // 0x2fcc
	float MovementInputAmount; // 0x2fd8
	bool HasMovementInput; // 0x2fdc
	FRotator LastMovementInputRotation; // 0x2fe0
	float AimYawRate; // 0x2fec
	float PreviousAimYaw; // 0x2ff0
	ENUM_Gait AllowedGait; // 0x2ff4
	ENUM_Gait ActualGait; // 0x2ff5
	ENUM_Gait DesiredGait; // 0x2ff6
	float LocalWalkSpeed; // 0x2ff8
	float LocalRunSpeed; // 0x2ffc
	float LocalSprintSpeed; // 0x3000
	float SingleFireWeaponIncrease; // 0x3004
	UMaterialInstanceDynamic* BombScreenMat; // 0x3008
	UMaterialInstanceDynamic* BombScreenMat3P; // 0x3010
	bool bSinglePlayerMode; // 0x3018
	UWBP_JumperMovementHUD_C* JumperHUD; // 0x3020
};

struct UWBP_TugOfWarOverview_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b8
	UTextBlock* CenterTimer; // 0x3c0
	UCanvasPanel* CP_ProgressOverview; // 0x3c8
	UTextBlock* CurrentState; // 0x3d0
	UTextBlock* CurrentState_2; // 0x3d8
	UImage* Image; // 0x3e0
	UImage* Image_2; // 0x3e8
	UImage* IMG_Contested; // 0x3f0
	UImage* IMG_Disabled; // 0x3f8
	UImage* IMG_PassivePushed; // 0x400
	UImage* IMG_PassivePushing; // 0x408
	UImage* IMG_ProgressBackground; // 0x410
	UImage* IMG_Pushed; // 0x418
	UImage* IMG_Pushing; // 0x420
	UImage* IMG_SuddenDeath; // 0x428
	USizeBox* IMG_SuddenDeathContainer; // 0x430
	UHorizontalBox* LeftTeamPlayerIcons; // 0x438
	UImage* Re-EnableImage_MyTeam; // 0x440
	UImage* Re-EnableImage_TheirTeam; // 0x448
	UCanvasPanel* Re-EnableProgress; // 0x450
	UWBP_ProgressBar_C* Re-EnableProgressBar_MyTeam; // 0x458
	UWBP_ProgressBar_C* Re-EnableProgressBar_TheirTeam; // 0x460
	UHorizontalBox* RightTeamPlayerIcons; // 0x468
	UImage* SpeedStateBackgroundImage; // 0x470
	UTextBlock* Timer_2; // 0x478
	UWBP_TugOfWarProgress_C* WBP_TugOfWarProgress; // 0x480
	UWidgetSwitcher* WS_CargoSpeedState; // 0x488
	TArray<UWBP_PlayerAliveIcon_C*> LeftTeamWidgets; // 0x490
	TArray<UWBP_PlayerAliveIcon_C*> RightTeamWidgets; // 0x4a0
	int32_t MissingWidgets; // 0x4b0
	UHUDTextDataAsset* HUDColour; // 0x4b8
	ACargoGameState* CargoGameState_1; // 0x4c0
};

struct UMedalBlowout {
	AWartideGameMode* WartideGameMode; // 0x48
};

struct UFriendlyTemplate {
	ABattalionCharacter* LinkedCharacter; // 0x268
	UMaterialInstanceDynamic* CachedMaterial; // 0x270
	UMaterialInstanceDynamic* CachedMaterialBombCarrier; // 0x278
	ABeacon* Beacon; // 0x280
	float BeaconScaleX; // 0x288
	float BeaconScaleY; // 0x28c
	UImage* Image; // 0x290
	UTextBlock* SpecIDImage; // 0x298
	FString SpecID; // 0x2a0
	UImage* BombImage; // 0x2b0
	FVector2D ScaledPlayerPos; // 0x2b8
	float RotationAngle; // 0x2c0
	float Zoom; // 0x2c4
	UCanvasPanelSlot* CanvasPanelSlot; // 0x2c8
	FLinearColor Tint; // 0x2d0
	float MiniMapScale; // 0x2e0
	float MiniMapZoom; // 0x2e4
	bool RotateMap; // 0x2e8
	bool FiredThisFrame; // 0x2e9
	bool SingleShot; // 0x2ea
	FVector2D LastPos; // 0x2ec
	bool bInActiveArray; // 0x2f4
	float FadeTimer; // 0x2f8
};

struct UGeometryCache {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
	int32_t StartFrame; // 0x60
	int32_t EndFrame; // 0x64
};

struct ULoudnessNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UNUIPrompt {
	bool bAccepted; // 0x290
	UTextBlock* TitleText; // 0x298
	UScrollBox* MessageContainer; // 0x2a0
	UTextBlock* MessageText; // 0x2a8
	UNUIButton* AcceptButton; // 0x2b0
	UNUIButton* CancelButton; // 0x2b8
	UWidget* CancelContainer; // 0x2c0
	UWidget* SmokeBackdrop; // 0x2c8
};

struct UAnimationSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct UThrobber {
	int32_t NumberOfPieces; // 0x108
	bool bAnimateHorizontally; // 0x10c
	bool bAnimateVertically; // 0x10d
	bool bAnimateOpacity; // 0x10e
	USlateBrushAsset* PieceImage; // 0x110
	FSlateBrush Image; // 0x118
};

struct UMaterialExpressionComponentMask {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UStereoLayerShapeEquirect {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UGizmoConstantFrameAxisSource {
	FVector Origin; // 0x30
	FVector Direction; // 0x3c
	FVector TangentX; // 0x48
	FVector TangentY; // 0x54
};

struct UDatasmithDecalComponentTemplate {
	int32_t SortOrder; // 0x30
	FVector DecalSize; // 0x34
	UMaterialInterface* Material; // 0x40
};

struct UMedal25BombTDM {
	ATDMGameMode* TDMGameMode; // 0x48
};

struct ABattalionTutorialPickup {
	ABattalionWeapon* WeaponClass; // 0x220
	ABattalionWeapon* Weapon; // 0x228
	USceneComponent* SceneComponent; // 0x230
	USkeletalMeshComponent* MeshComponent; // 0x238
	UBoxComponent* BoxCollision; // 0x240
};

struct UButton {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
};

struct UMaterialExpressionMapARPassthroughCameraUV {
	FExpressionInput Coordinates; // 0x40
};

struct UMedalInvincible {
	ATDMGameMode* TDMGameMode; // 0x48
	TArray<FInvincibleTracker> InvincibleTrackers; // 0x50
};

struct UPlayFabProfilesAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x118
	UPlayFabJsonObject* RequestJsonObj; // 0x120
	UPlayFabJsonObject* ResponseJsonObj; // 0x128
};

struct USMConduitInstance {
	bool bEvalWithTransitions; // 0xc0
	bool bCanEvaluate; // 0xc1
};

struct URichTextBlock {
	FText Text; // 0x128
	UDataTable* TextStyleSet; // 0x140
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x148
	bool bOverrideDefaultStyle; // 0x158
	FTextBlockStyle DefaultTextStyleOverride; // 0x160
	float MinDesiredWidth; // 0x3d0
	ETextTransformPolicy TextTransformPolicy; // 0x3d4
	FTextBlockStyle DefaultTextStyle; // 0x3d8
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x648
};

struct UBTDecorator_SetTagCooldown {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct UParticleModuleAccelerationConstant {
	FVector Acceleration; // 0x38
};

struct UBTService_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UDatasmithGLTFSceneImportData {
	FString Generator; // 0x28
	float Version; // 0x38
	FString Author; // 0x40
	FString License; // 0x50
	FString Source; // 0x60
};

struct UParticleModuleTrailSource {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UInterpTrackInstFloatAnimBPParam {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct ULightComponentBase {
	FGuid LightGuid; // 0x1f8
	float Brightness; // 0x208
	float Intensity; // 0x20c
	FColor LightColor; // 0x210
	char bAffectsWorld : 1; // 0x214
	char CastShadows : 1; // 0x214
	char CastStaticShadows : 1; // 0x214
	char CastDynamicShadows : 1; // 0x214
	char bAffectTranslucentLighting : 1; // 0x214
	char bTransmission : 1; // 0x214
	char bCastVolumetricShadow : 1; // 0x214
	char bCastDeepShadow : 1; // 0x214
	char bCastRaytracedShadow : 1; // 0x215
	char bAffectReflection : 1; // 0x215
	char bAffectGlobalIllumination : 1; // 0x215
	float DeepShadowLayerDistribution; // 0x218
	float IndirectLightingIntensity; // 0x21c
	float VolumetricScatteringIntensity; // 0x220
	int32_t SamplesPerPixel; // 0x224
};

struct UNUIWidgetReferences {
	TArray<UObject*> Templates; // 0x28
};

struct UInteractiveToolPropertySet {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct AHardpointGameMode {
	float FirstHardpointWaitTime; // 0xd38
	bool WinOnTeamEmptyShootout; // 0xd3c
	float HardpointCycleTime; // 0xd40
	float PreviewNextHardpointTime; // 0xd48
	float HardpointScoreInterval; // 0xd4c
	float HardpointScorePerTick; // 0xd50
	float PreShootoutTime; // 0xd58
	bool bAllowOvertime; // 0xd5c
	float HardpointOvertimeRoundTime; // 0xd60
	float HardpointOvertimeScoreLimit; // 0xd64
	float HardpointMarkerTime; // 0xd68
	bool bUsingCustomShootout; // 0xd6c
	TArray<AHardpointZone*> HardpointZones; // 0xd70
	int32_t CurrentZoneIndex; // 0xd80
	AHardpointZone* CurrentActiveZone; // 0xd88
	AHardpointZone* NextZone; // 0xd90
	float LastRoundEndTime; // 0xd98
	UAkComponent* DefaultAkComp; // 0xda0
	UAkAudioEvent* GameStartSound; // 0xda8
	UAkAudioEvent* StartGameInstructionsSound; // 0xdb0
	UAkAudioEvent* FirstPointSpawnedSound; // 0xdb8
	UAkAudioEvent* PointMovingShortlySound; // 0xdc0
	UAkAudioEvent* PointUnlockedSound; // 0xdc8
	UAkAudioEvent* CapturedByEnemySound; // 0xdd0
	UAkAudioEvent* CapturedByFriendlySound; // 0xdd8
	UAkAudioEvent* GameAlmostEndedEvent; // 0xde0
	UAkAudioEvent* StopGameAlmostEndedEvent; // 0xde8
	UAkAudioEvent* PointContestedSound; // 0xdf0
	UAkAudioEvent* EnemyNearingVictorySound; // 0xdf8
	UAkAudioEvent* StartRoundEndMusic; // 0xe00
	UAkAudioEvent* StopRoundEndMusic; // 0xe08
	UAkAudioEvent* OvertimeAnnouncerSound; // 0xe10
	float StopSoundTime; // 0xe18
	AHardpointGameState* HardpointGameState; // 0xe28
};

struct USplineMeshComponent {
	FSplineMeshParams SplineParams; // 0x4d8
	FVector SplineUpDir; // 0x530
	float SplineBoundaryMin; // 0x53c
	FGuid CachedMeshBodySetupGuid; // 0x540
	UBodySetup* BodySetup; // 0x550
	float SplineBoundaryMax; // 0x558
	char bAllowSplineEditingPerInstance : 1; // 0x55c
	char bSmoothInterpRollScale : 1; // 0x55c
	char bMeshDirty : 1; // 0x55c
	ESplineMeshAxis ForwardAxis; // 0x55d
	float VirtualTextureMainPassMaxDrawDistance; // 0x560
};

struct UNUIGameTimer {
	FString GameTimer; // 0x278
	FLinearColor Color; // 0x288
};

struct UDeviceProfile {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x88
};

struct AController {
	APlayerState* PlayerState; // 0x228
	FMulticastInlineDelegate OnInstigatedAnyDamage; // 0x238
	FName StateName; // 0x248
	APawn* Pawn; // 0x250
	ACharacter* Character; // 0x260
	USceneComponent* TransformComponent; // 0x268
	FRotator ControlRotation; // 0x288
	char bAttachToPawn : 1; // 0x294
};

struct ABombHUD {
	UNUIBombIcon* bombicon; // 0x5f8
	UNUIBombIcon* BombIconClass; // 0x600
};

struct UHUDPlayerName_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UTextBlock* PlayerHealth; // 0x2c0
	UTextBlock* PlayerName; // 0x2c8
	FNone* PlayerPhaseWidgetConsole_142; // 0x2d0
	UCanvasPanel* SpectatorInfo; // 0x2d8
	UTextBlock* TextBlock_749; // 0x2e0
	UImage* Weapon; // 0x2e8
	UWidgetSwitcher* WidgetSwitcher_313; // 0x2f0
	FNone* XrayPlayername; // 0x2f8
	FSlateColor PlayerNameColour; // 0x300
};

struct UBasicOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UAnimNotify_PlayMontageNotify {
	FName NotifyName; // 0x38
};

struct UMedal1v5Clutch {
	AWartideGameMode* WartideGameMode; // 0x48
	ABattalionPlayerControllerGMBase* ClutcherPC; // 0x50
};

struct UGizmoCircleComponent {
	FVector Normal; // 0x460
	float Radius; // 0x46c
	float Thickness; // 0x470
	int32_t NumSides; // 0x474
	bool bViewAligned; // 0x478
	bool bOnlyAllowFrontFacingHits; // 0x479
};

struct UAnimationAsset {
	USkeleton* Skeleton; // 0x38
	TArray<UAnimMetaData*> MetaData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct UAvfMediaSettings {
	bool NativeAudioOut; // 0x28
};

struct UMovieSceneCapture {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct UWBP_JumperGameOverview_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* Count_Second; // 0x2f8
	UImage* Image; // 0x300
	UImage* Image_2; // 0x308
	UImage* Image_144; // 0x310
	UImage* Image_390; // 0x318
	UTextBlock* TextBlock_JumperCheckpointCount; // 0x320
	UTextBlock* TextBlock_JumperRespawnCount; // 0x328
	UTextBlock* TextBlock_JumperTimer; // 0x330
	UTextBlock* TextBlock_JumperTimer_2; // 0x338
	UTextBlock* TextBlock_JumperTimer_3; // 0x340
	UTextBlock* TextBlock_JumperTimer_4; // 0x348
	UTextBlock* TextBlock_JumperTimer_5; // 0x350
};

struct UParticleModuleOrbit {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UImgMediaSettings {
	FFrameRate DefaultFrameRate; // 0x28
	float CacheBehindPercentage; // 0x30
	float CacheSizeGB; // 0x34
	int32_t CacheThreads; // 0x38
	int32_t CacheThreadStackSizeKB; // 0x3c
	float GlobalCacheSizeGB; // 0x40
	bool UseGlobalCache; // 0x44
	uint32_t ExrDecoderThreads; // 0x48
	FString DefaultProxy; // 0x50
	bool UseDefaultProxy; // 0x60
};

struct UMovieSceneMediaTrack {
	TArray<UMovieSceneSection*> MediaSections; // 0x80
};

struct UMaterialExpressionHairAttributes {
	char bUseTangentSpace : 1; // 0x40
};

struct UMedalBombTechnician {
	AWartideGameMode* WartideGameMode; // 0x48
};

struct UNUISettings {
	FSoftClassPath WelcomeScreenClass; // 0x38
	FSoftClassPath LoadingScreenClass; // 0x50
	FSoftClassPath PromptClass; // 0x68
	FSoftClassPath PauseMenuClass; // 0x80
	FSoftClassPath DebugMenuClass; // 0x98
	TSoftObjectPtr<UMediaPlayer> SmokeOverlayPlayer; // 0xb0
	TSoftObjectPtr<UMediaSource> SmokeOverlayVideo; // 0xd8
	TSoftObjectPtr<UMediaPlayer> SmokeBackdropPlayer; // 0x100
	TSoftObjectPtr<UMediaSource> SmokeBackdropVideo; // 0x128
};

struct UUserDefinedStruct {
	EUserDefinedStructureStatus Status; // 0xc0
	FGuid Guid; // 0xc4
};

struct UAkAssetData {
	uint32_t CachedHash; // 0x28
};

struct UEnvQueryGenerator_ActorsOfClass {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct UBTTask_MoveTo {
	float AcceptableRadius; // 0x98
	UNavigationQueryFilter* FilterClass; // 0xa0
	float ObservedBlackboardValueTolerance; // 0xa8
	char bObserveBlackboardValue : 1; // 0xac
	char bAllowStrafe : 1; // 0xac
	char bAllowPartialPath : 1; // 0xac
	char bTrackMovingGoal : 1; // 0xac
	char bProjectGoalLocation : 1; // 0xac
	char bReachTestIncludesAgentRadius : 1; // 0xac
	char bReachTestIncludesGoalRadius : 1; // 0xac
	char bStopOnOverlap : 1; // 0xac
	char bStopOnOverlapNeedsUpdate : 1; // 0xad
};

struct UMedalLoneSurvivor {
	AInfectionGameMode* INFGameMode; // 0x48
};

struct AMapEditorPawn {
	int32_t MaxUndoHistory; // 0x2a8
	FGameplayTag GeometryObjectTag; // 0x2ac
	AMapEditorObjectPreview* ObjectPreviewClass; // 0x2b8
	AMapEditorGizmo* MapEditorGizmoClass; // 0x2c0
	float CursorTraceDistance; // 0x2c8
	float CursorTraceFailedDistance; // 0x2cc
	FHitResult LastCursorHitResult; // 0x2d0
	FVector2D CachedCursorScreenPosition; // 0x35c
	FVector2D LastCursorScreenPosition; // 0x364
	FMapEditorObjectData SpawningObjectData; // 0x370
	bool bSpawningObject; // 0x410
	AMapEditorObjectPreview* ObjectPreview; // 0x418
	TArray<AMapEditorObject*> SelectedObjects; // 0x420
	AMapEditorController* MapEditorController; // 0x430
	AMapEditorGizmo* MapEditorGizmo; // 0x438
	TArray<AMapEditorObject*> CopyClipboard; // 0x440
	TArray<FMapEditorUndoableAction> UndoHistory; // 0x450
};

struct USlateAccessibleWidgetData {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	FDelegate AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	FDelegate AccessibleSummaryTextDelegate; // 0x70
};

struct UMedalKingSlayer {
	AFFAGameMode* FFAGameMode; // 0x48
};

struct UParticleModuleVelocityBase {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct ALandscapeMeshProxyActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x220
};

struct APromodHUD {
	UHUDMaster* MasterHUDWidget; // 0x310
	UHUDMaster* MasterHUDClass; // 0x318
	UHUDMaster* JumperHUDClass; // 0x320
	UHUDMaster* SNDHUDClass; // 0x328
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct UWrapBox {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	float WrapSize; // 0x12c
	bool bExplicitWrapWidth; // 0x130
	bool bExplicitWrapSize; // 0x131
	EOrientation Orientation; // 0x132
};

struct UControlPointMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4d0
};

struct UAkAudioType {
	uint32_t ShortID; // 0x28
	TArray<UObject*> UserData; // 0x30
};

struct UCartesianPlot {
	UObject* DataSource; // 0x368
};

struct UNUIMiniMap {
	TArray<ABattalionSmokeGrenade*> Smokes; // 0x278
	TArray<UMapSmokeWidget*> SmokeWidgets; // 0x288
	TArray<UWorldMarkerComponent*> WorldMarkers; // 0x298
	TArray<UMapMarkerWidget*> MarkerWidgets; // 0x2a8
	FVector2D Position; // 0x2b8
	FVector2D DesiredPosition; // 0x2c0
	float RotationAngle; // 0x2c8
	ABeacon* Beacon; // 0x2d0
	UCanvasPanel* ThisCanvas; // 0x2d8
	UMaterialInstanceDynamic* CachedMaterial; // 0x2e0
	TArray<UFriendlyTemplate*> FrenemyImages; // 0x2e8
	float Scale; // 0x2f8
	float Zoom; // 0x2fc
	UImage* PlayerIconImage; // 0x300
	UImage* PlayerIconBombOutline; // 0x308
	FLinearColor PlayerLocation; // 0x310
	FVector2D ScaledPosition; // 0x320
	FVector2D NormalisedPosition; // 0x328
	float MiniMapScale; // 0x330
	float MiniMapZoom; // 0x334
	TArray<ABattalionCharacter*> Frenemies; // 0x338
	bool RotateMap; // 0x348
	bool bShouldShowSmokes; // 0x349
	ABattalionPlayerControllerGMBase* OwnerPC; // 0x358
};

struct UParticleModuleRotationOverLifetime {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct UOn_Fire_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image; // 0x268
	UImage* Image_97; // 0x270
	UImage* Image_420; // 0x278
	UMediaPlayer* MediaPlayer; // 0x280
};

struct UParticleModuleTypeDataMesh {
	UStaticMesh* Mesh; // 0x30
	float LODSizeScale; // 0x40
	char bUseStaticMeshLODs : 1; // 0x44
	char CastShadows : 1; // 0x44
	char DoCollisions : 1; // 0x44
	EMeshScreenAlignment MeshAlignment; // 0x45
	char bOverrideMaterial : 1; // 0x46
	char bOverrideDefaultMotionBlurSettings : 1; // 0x46
	char bEnableMotionBlur : 1; // 0x46
	FRawDistributionVector RollPitchYawRange; // 0x48
	EParticleAxisLock AxisLockOption; // 0x90
	char bCameraFacing : 1; // 0x91
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x92
	EMeshCameraFacingOptions CameraFacingOption; // 0x93
	char bApplyParticleRotationAsSpin : 1; // 0x94
	char bFaceCameraDirectionRatherThanPosition : 1; // 0x94
	char bCollisionsConsiderPartilceSize : 1; // 0x94
};

struct UChaosGameplayEventDispatcher {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct ACTFHUD {
	UNUIFlagIcon* FlagIcon; // 0x638
	UBattalionDamageType* FlagDmgTypeClass; // 0x640
	UBattalionDamageType* FlagDmgType; // 0x648
	UNUICTFFlagStates* CTFFlagStates; // 0x650
	UNUICTFGameOverview* CTFGameOverview; // 0x658
	UNUIFlagIcon* FlagIconClass; // 0x660
	UNUICTFFlagStates* CTFFlagStatesClass; // 0x668
	UNUICTFGameOverview* CTFGameOverviewClass; // 0x670
};

struct ACTFMode_FlagZone {
	ACTFMode_Flag* flag; // 0x220
	UBoxComponent* CollisionComp; // 0x228
	char TeamAllegiance; // 0x230
	UWorldMarkerComponent* DefaultWorldMarker; // 0x238
};

struct UBattalionSettings {
	FMulticastInlineDelegate OnSettingsChanged; // 0x28
	FString Language; // 0x38
	FString Resolution; // 0x48
	int32_t DisplayMode; // 0x58
	bool Vsync; // 0x5c
	int32_t DisplayIndex; // 0x60
	int32_t NvReflexMode; // 0x64
	float FPS; // 0x68
	int32_t ResolutionQuality; // 0x70
	int32_t MSAA; // 0x74
	float Gamma; // 0x78
	bool bBloom; // 0x7c
	bool bMotionBlur; // 0x7d
	bool bLensFlare; // 0x7e
	bool bKillAberration; // 0x7f
	float ColorStrength; // 0x80
	float ColorTint; // 0x84
	float WorldContrast; // 0x88
	float SkyFade; // 0x8c
	float Vignette; // 0x90
	float LightbouncePower; // 0x94
	float AOStrength; // 0x98
	float LensFlareIntensity; // 0x9c
	float ExposureAmount; // 0xa0
	float Sharpness; // 0xa4
	bool bShowWeaponAndArms; // 0xa8
	float MasterVolume; // 0xac
	float MenuMusicVolume; // 0xb0
	float GameMusicVolume; // 0xb4
	FString AudioOutputDevice; // 0xb8
	bool MuteSelf; // 0xc8
	bool MuteAll; // 0xc9
	float MouseSensitivity; // 0xd8
	FString MouseSensitivityScalingOption; // 0xe0
	float MouseSensitivityRelativeAmount; // 0xf0
	float MouseADSSensitivity; // 0xf4
	float MouseScopedSensitivity; // 0xf8
	bool bMouseInvertVertical; // 0xfc
	bool bController; // 0xfd
	FName ControllerButtonConfig; // 0x100
	FName ControllerStickConfig; // 0x108
	bool bUseRadialDeadzone; // 0x110
	FString ControllerAutoAimType; // 0x118
	float ControllerSensitivity; // 0x128
	float ControllerHorizontalSensitivity; // 0x12c
	float ControllerVerticalSensitivity; // 0x130
	float ControllerADSSensitivity; // 0x134
	float ControllerScopedSensitivity; // 0x138
	bool bControllerInvertVertical; // 0x144
	bool bControllerVibration; // 0x145
	FString WeaponKeybindsOption; // 0x148
	float ControllerDeadZone; // 0x158
	bool bCrossPlay; // 0x15c
	bool bCrossPlayPrompted; // 0x15d
	float FOV; // 0x160
	bool bFixedFOVWeaponView; // 0x164
	bool bLeftHandWeaponView; // 0x165
	bool bHeadBob; // 0x166
	bool bShowHUD; // 0x167
	bool bShowTopBar; // 0x168
	bool bShowMinimap; // 0x169
	bool bMinimapFixed; // 0x16a
	bool bShowKillFeed; // 0x16b
	bool bShowKillMessage; // 0x16c
	bool bShowChat; // 0x16d
	bool bShowVoiceFeed; // 0x16e
	bool bShowCrosshair; // 0x16f
	bool bShowPlayerNames; // 0x170
	bool bShowGameStatus; // 0x171
	bool bShowInteraction; // 0x172
	bool bShowInventory; // 0x173
	bool bShowScoreAward; // 0x174
	bool bShowScreenEffects; // 0x175
	bool bShowGrenadeIcon; // 0x176
	bool bShowVault; // 0x177
	bool bShowGameTimer; // 0x178
	bool bShowPickup; // 0x179
	bool bShowMarkers; // 0x17a
	bool bShowDistanceOnMarker; // 0x17b
	bool bShowInventoryWeapons; // 0x17c
	bool bShowPlayersAliveText; // 0x17d
	bool bShowCallOut; // 0x17e
	bool bShowObjectiveScores; // 0x17f
	bool bShowPlayerRanking; // 0x180
	bool bShowNetworkStatus; // 0x181
	bool bShowMedalAwards; // 0x182
	bool bShowSpectatorHUD; // 0x183
	bool bLoadoutAlwaysVisible; // 0x184
	bool bShowBulletTracers; // 0x185
	bool bShowGizmoHelpUI; // 0x186
	bool bShowStrafeHelpUI; // 0x187
	bool bShowSystemTime; // 0x188
	bool bShowMovementHelpUI; // 0x189
	bool bShowFrameTime; // 0x18a
	bool bShowClientFPS; // 0x18b
	bool bShowIdleTime; // 0x18c
	bool bShowGameThreadTime; // 0x18d
	bool bShowRenderThreadTime; // 0x18e
	bool bShowRHIThreadTime; // 0x18f
	bool bShowGameLatency; // 0x190
	bool bShowRenderLatency; // 0x191
	bool bShowGameToRenderLatency; // 0x192
	bool bShowGPUTemp; // 0x193
	TArray<FActionBind> ActionBinds; // 0x198
	TArray<FAxisBind> AxisBinds; // 0x1a8
	TMap<FKey, FString> DebugConsoleCommandBinds; // 0x1b8
	UNUISettingsMenu* SettingsMenu; // 0x208
	UBattalionGameInstance* BattInstance; // 0x210
	TMap<FName, FString> Profiles; // 0x218
};

struct UAnimBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct APromodGameMode {
	int32_t AssaultClassLimit; // 0x9d0
	int32_t BreacherClassLimit; // 0x9d4
	int32_t ReconClassLimit; // 0x9d8
	int32_t MinPlayersForReporting; // 0x9dc
	float TimeToRegenQuickUtil; // 0x9e0
	bool SpectateTeamAllowed; // 0x9e4
	float RoundEndingTickingTime; // 0x9e8
	float RoundEndingTickingTimePeriod; // 0x9ec
	float ChangeTeamCooldownTime; // 0x9f0
	APromodGameState* PromodGameState; // 0x9f8
	bool bReportingEnabled; // 0xa00
	bool bForceEnableReporting; // 0xa01
	bool bTryHardMode; // 0xa02
	int32_t NumRegularRoundsPlayed; // 0xa04
	int32_t TotalAbilitiesUsed; // 0xa08
	int32_t NumMatchScoreReports; // 0xa0c
	int32_t TotalPlayerMatchScore; // 0xa10
	TMap<FName, int32_t> AbilityCounters; // 0xa18
	int32_t InitialNumRounds; // 0xa68
	float DelayPeriodBetweenInitLoadouts; // 0xa6c
	FTimerHandle TimerHandle_FeedbackScreenTimeout; // 0xa70
	APromodClassSettings* CleanClassSettings; // 0xa80
	UAkAudioEvent* GameLossSound; // 0xa90
	UAkAudioEvent* GameWinSound; // 0xa98
	UAkAudioEvent* FlawlessWinSound; // 0xaa0
	UAkAudioEvent* MatchStartingSound; // 0xaa8
	UAkAudioEvent* LastRoundOfHalfSound; // 0xab0
	UAkAudioEvent* MatchPointSound; // 0xab8
	UAkAudioEvent* StratTimeSound; // 0xac0
	UAkAudioEvent* RoundLossSound; // 0xac8
	UAkAudioEvent* RoundWinSound; // 0xad0
	UAkAudioEvent* RoundStartSound; // 0xad8
	UAkAudioEvent* WarmupSound; // 0xae0
	UAkAudioEvent* ThirtySecondsRemainingSound; // 0xae8
	UAkAudioEvent* AceSound; // 0xaf0
	UAkAudioEvent* BombDroppedSound; // 0xaf8
	UAkAudioEvent* BombPlantedSoundA; // 0xb00
	UAkAudioEvent* BombPlantedSoundB; // 0xb08
	UAkAudioEvent* ClutchSound; // 0xb10
	UAkAudioEvent* LastPlayerStandingSound; // 0xb18
	UAkAudioEvent* OneEnemyRemainingSound; // 0xb20
	UAkAudioEvent* RoundCountdownTick; // 0xb28
	UAkAudioEvent* EndingRoundTickSound; // 0xb30
	UAkAudioEvent* StopSoundsRoundEnd; // 0xb38
	bool ShootOutFirstRoundPlayed; // 0xb4b
	TArray<ABattalionPlayerControllerGMBase*> CachedPlayers; // 0xc98
	TArray<FInitializeLoadoutQueueItem> InitializeLoadoutQueue; // 0xca8
	TArray<FMapToModeSchema> MapsWithSupportedModes; // 0xcb8
	UGameEventRecorder* GameEventRecorder; // 0xcc8
	float TimeSinceLastLoadoutInitialization; // 0xcd0
};

struct AARSharedWorldGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct ABattalionWeapon_Instant {
	FDeathAnim KilledCharacterDeathAnim; // 0x7d0
	bool bDeathAnimOverridden; // 0x810
	FInstantHitInfo HitNotify; // 0x814
	ABattalionImpactEffect* ImpactTemplate; // 0x830
	ABattalionImpactEffect* FailedImpactTemplate; // 0x838
	ABattalionBloodEffect* ImpactBloodTemplate; // 0x840
	ABattalionBloodEffect* ImpactBloodWoundTemplate; // 0x848
	UParticleSystem* TrailFX; // 0x850
	UParticleSystem* TracerFX; // 0x858
	UParticleSystem* TracerFX1P; // 0x860
	float TracerFX1P_Chance; // 0x868
	FName TrailTargetParam; // 0x86c
	TArray<UParticleSystemComponent*> TracerTickUpdates; // 0x878
	EWeaponArchetype WeaponCategory; // 0x888
};

struct UMapViewComponent {
	FMulticastInlineDelegate OnVisibleCategoriesChanged; // 0x468
	FMulticastInlineDelegate OnViewSizeChanged; // 0x478
	FMulticastInlineDelegate OnViewDestroyed; // 0x488
	EMapViewRotationMode RotationMode; // 0x498
	FRotator FixedRotation; // 0x49c
	float InheritedYawOffset; // 0x4a8
	bool bSupportZooming; // 0x4ac
	USceneComponent* HeightProxy; // 0x4b0
	float BackgoundLevelCacheLifetime; // 0x4b8
	TSet<AMapBackground*> MapBackgrounds; // 0x568
	TMap<AMapBackground*, int32_t> PositionOnMultiLevelBackgrounds; // 0x5b8
};

struct UEnvQueryTest_PathfindingBatch {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UControllerLayoutLabelText_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* CustomLabel; // 0x268
	UTextBlock* DefaultLabel; // 0x270
	UWidgetSwitcher* WidgetSwitcher_138; // 0x278
	ETextJustify TextJustification; // 0x280
};

struct UParticleModuleSize {
	FRawDistributionVector StartSize; // 0x30
};

struct UWBP_PingSelection_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_RadialMenu_C* WBP_RadialMenu; // 0x268
	TArray<EPingType> PingTypes; // 0x270
	UPromodPingablesDataAsset* PingablesDataAsset; // 0x280
	TArray<FSlateBrush> RadialMenuItems; // 0x288
};

struct UAISense_Touch {
	TArray<FAITouchEvent> RegisteredEvents; // 0x80
};

struct UChildActorComponent {
	AActor* ChildActorClass; // 0x1f8
	AActor* ChildActor; // 0x200
	AActor* ChildActorTemplate; // 0x208
};

struct UMaterialFunction {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
};

struct UHUDWorldMarker {
	UCurveFloat* MarkerAdsVisibilityCurve; // 0x260
	UCurveFloat* MarkerVisibilityCurve; // 0x268
	UWorldMarkerComponent* WorldMarkerReference; // 0x270
	bool bHideOnFinishLerp; // 0x278
	bool bStuckToScreen; // 0x279
	UMaterialInstanceDynamic* ProgressMaterial; // 0x280
	TArray<UMaterialInstanceDynamic*> ProgressMaterials; // 0x288
	UWidget* MarkerSizeReference; // 0x298
	float FadoutTime; // 0x2a0
	float AffixTime; // 0x2a4
	float MinScale; // 0x2a8
	float MaxScale; // 0x2ac
	float ScaleEdgeDistance; // 0x2b0
	float MinScaleDistance; // 0x2b4
	float MaxScaleDistance; // 0x2b8
	float MarkerScaleMultiplier; // 0x2bc
	float OverviewHeight; // 0x2c0
	float MiniMapRadius; // 0x2c4
	FVector2D MiniMapOffset; // 0x2c8
	float ProjectionHorizontalBlendCone; // 0x2d0
	float ProjectionVerticalBlendCone; // 0x2d4
	float AzimuthBlendAngle; // 0x2d8
	float AzimuthBlendCone; // 0x2dc
	float MaxAlpha; // 0x2e0
	float MinAlpha; // 0x2e4
	float FadeAlpha; // 0x2e8
	float FadeTime; // 0x2ec
	float AimMaxAlpha; // 0x2f0
	float AimMinAlpha; // 0x2f4
	float AimFovealRadius; // 0x2f8
	float AimParafovealBelt; // 0x2fc
	float HipMaxAlpha; // 0x300
	float HipMinAlpha; // 0x304
	float HipFovealRadius; // 0x308
	float HipParafovealBelt; // 0x30c
	float ArrowFadeTime; // 0x310
	UBattalionGameInstance* BattInstance; // 0x318
	UBattalionSettings* BattSettings; // 0x320
};

struct UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnPlay; // 0x410
	FMulticastInlineDelegate OnPlayReverse; // 0x420
	FMulticastInlineDelegate OnStop; // 0x430
	FMulticastInlineDelegate OnPause; // 0x440
	FMulticastInlineDelegate OnFinished; // 0x450
	EMovieScenePlayerStatus Status; // 0x460
	char bReversePlayback : 1; // 0x464
	UMovieSceneSequence* Sequence; // 0x468
	FFrameNumber StartTime; // 0x470
	int32_t DurationFrames; // 0x474
	float DurationSubFrames; // 0x478
	int32_t CurrentNumLoops; // 0x47c
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x480
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x498
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x5e8
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x5f8
	UMovieSceneSequenceTickManager* TickManager; // 0x608
};

struct UInteractiveTool {
	UInputBehaviorSet* InputBehaviors; // 0x48
	TArray<UObject*> ToolPropertyObjects; // 0x50
};

struct UEnvQueryGenerator_Composite {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	char bAllowDifferentItemTypes : 1; // 0x60
	char bHasMatchingItemType : 1; // 0x60
	UEnvQueryItemType* ForcedItemType; // 0x68
};

struct UWelcomePopup_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UWidgetAnimation* Outro; // 0x278
	UWidgetAnimation* Intro; // 0x280
	UAccept_C* Accept; // 0x288
	UTextButton_C* AcceptButton; // 0x290
	UCancel_C* Cancel; // 0x298
	UTextButton_C* CancelButton; // 0x2a0
	UTextBlock* DescriptText; // 0x2a8
	UTextBlock* TextBlock_1; // 0x2b0
	UTextBlock* TitleText; // 0x2b8
	UWBP_IDontKnow_PopupButton_C* WBP_IDontKnow_PopupButton; // 0x2c0
	bool InitializedSound; // 0x2c8
};

struct UBTTask_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UMedalDefender {
	ADOMGameMode* DOMGameMode; // 0x48
};

struct UFindSessionsCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UParticleModuleLocationEmitterDirect {
	FName EmitterName; // 0x30
};

struct URendererOverrideSettings {
	char bSupportAllShaderPermutations : 1; // 0x38
	char bForceRecomputeTangents : 1; // 0x38
};

struct UTextBlock {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FSlateColor ColorAndOpacity; // 0x150
	FDelegate ColorAndOpacityDelegate; // 0x178
	FSlateFontInfo Font; // 0x188
	FSlateBrush StrikeBrush; // 0x1e0
	FVector2D ShadowOffset; // 0x268
	FLinearColor ShadowColorAndOpacity; // 0x270
	FDelegate ShadowColorAndOpacityDelegate; // 0x280
	float MinDesiredWidth; // 0x290
	bool bWrapWithInvalidationPanel; // 0x294
	bool bAutoWrapText; // 0x295
	ETextTransformPolicy TextTransformPolicy; // 0x296
	bool bSimpleTextMode; // 0x297
};

struct UAchievementQueryCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UMaterialExpressionArctangent2Fast {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct APaperTileMapActor {
	UPaperTileMapComponent* RenderComponent; // 0x220
};

struct UMovieSceneParameterSection {
	TArray<FBoolParameterNameAndCurve> BoolParameterNamesAndCurves; // 0xe8
	TArray<FScalarParameterNameAndCurve> ScalarParameterNamesAndCurves; // 0xf8
	TArray<FVector2DParameterNameAndCurves> Vector2DParameterNamesAndCurves; // 0x108
	TArray<FVectorParameterNameAndCurves> VectorParameterNamesAndCurves; // 0x118
	TArray<FColorParameterNameAndCurves> ColorParameterNamesAndCurves; // 0x128
	TArray<FTransformParameterNameAndCurves> TransformParameterNamesAndCurves; // 0x138
};

struct USourceEffectPhaserPreset {
	FSourceEffectPhaserSettings Settings; // 0xa0
};

struct ACullDistanceVolume {
	TArray<FCullDistanceSizePair> CullDistances; // 0x258
	char bEnabled : 1; // 0x268
};

struct UPromodAllFireUpsDataAsset {
	TArray<UPromodFireUpDataAsset*> FireUps; // 0x30
};

struct UPLAY-MM-Button_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Simulation-text-off; // 0x268
	UWidgetAnimation* Simulation-activated; // 0x270
	UWidgetAnimation* Pulse; // 0x278
	UWidgetAnimation* Clicked; // 0x280
	UWidgetAnimation* SingleFrameSelected; // 0x288
	UWidgetAnimation* Default; // 0x290
	UImage* Backdrop-colour-image; // 0x298
	UImage* Backdrop-colour-image_2; // 0x2a0
	UImage* MM_ICON_2; // 0x2a8
	UButton* PM-BUTTON; // 0x2b0
	UCanvasPanel* Selected-Size-Canvas; // 0x2b8
	UCanvasPanel* UNSelected-Size-Canvas; // 0x2c0
	FMulticastInlineDelegate ButtonClicked; // 0x2c8
};

struct ABattalionGameMode {
	UAkAudioEvent* WorldLoadingEvent; // 0x2c0
	TArray<ABattalionPlayerControllerGMBase*> Spectators; // 0x2c8
	TArray<ABattalionPlayerControllerGMBase*> CountdownToStartPlayersCinematic; // 0x2e8
	bool HasStartedCountdownToStartCinematic; // 0x2f8
	TArray<FMapModeVoteInfo> MapModeVotes; // 0x318
	bool MapModeVoteSuccessful; // 0x328
	int32_t NumTravellingPlayers; // 0x32c
	FString PendingTravelURL; // 0x330
	bool PendingTravelAbsolute; // 0x340
	float PendingTravelTimer; // 0x344
	float PendingTravelTime; // 0x348
	bool bPendingTravel; // 0x34c
	int32_t PreviousTravelTimerSeconds; // 0x350
	bool NextModeSelectedByCmd; // 0x354
	bool FillEmptySlotsWithBots; // 0x355
	bool AllowBots; // 0x356
	bool bAllowGlobalVoiceChat; // 0x357
	bool bCheatsEnabled; // 0x358
	bool StratMode; // 0x359
	FString MarketPath; // 0x360
	bool ManualTravelOnly; // 0x370
	bool ShouldPickRandomSubmode; // 0x371
	TArray<FString> AdminSteamIDs; // 0x378
	int32_t FailedConnectCleanupAttempts; // 0x388
	bool MapVotingEnabled; // 0x38c
	int32_t NumMapOptionsToGive; // 0x390
	int32_t PlayerKillScore; // 0x394
	int32_t PlayerAssistScore; // 0x398
	int32_t DeathScore; // 0x39c
	int32_t RoundWinScore; // 0x3a0
	int32_t RoundDrawScore; // 0x3a4
	int32_t RoundLossScore; // 0x3a8
	int32_t GameWinScore; // 0x3ac
	int32_t GameDrawScore; // 0x3b0
	int32_t GameLossScore; // 0x3b4
	int32_t AttackObjectiveScore; // 0x3b8
	int32_t DefendObjectiveScore; // 0x3bc
	int32_t ScoreToWinRound; // 0x3c0
	int32_t NumRounds; // 0x3c4
	int32_t SwapSidesRound; // 0x3c8
	int32_t NumTeams; // 0x3cc
	FName StartType; // 0x3d0
	int32_t MaxPlayersPerTeam; // 0x3d8
	int32_t NumSpectatorSlots; // 0x3dc
	int32_t NumNations; // 0x3e0
	bool FriendlyFire; // 0x3e4
	int32_t MaxGunsOnGround; // 0x3e8
	int32_t MaxGrenadesOnGround; // 0x3ec
	int32_t RequiredPlayers; // 0x3f0
	float RespawnDelay; // 0x3f4
	bool EnableEnemyPlayerNames; // 0x3f8
	bool DisableTeamSwaping; // 0x3f9
	float RandomSpawnInfluence; // 0x3fc
	float EnemySpawnInfluenceDistance; // 0x400
	float EnemySpawnInfluenceValue; // 0x404
	float EnemySpawnInfluenceExponent; // 0x408
	float EnemySpawnWeakForceInfluenceDistance; // 0x40c
	float EnemySpawnWeakForceInfluenceValue; // 0x410
	float EnemySpawnWeakForceInfluenceExponent; // 0x414
	float AllySpawnInfluenceExponent; // 0x418
	float AllySpawnInfluenceDistance; // 0x41c
	float AllySpawnInfluenceValue; // 0x420
	float PreviousSpawnInfluence; // 0x424
	float PreviousSpawnAreaInfluence; // 0x428
	float PreviousSpawnAreaDistance; // 0x42c
	float PreviousSpawnAreaInfluenceExponent; // 0x430
	float TeamDeathAreaTimeOfRelevance; // 0x434
	float TeamDeathAreaInfluence; // 0x438
	float TeamDeathAreaDistance; // 0x43c
	float TeamDeathAreaInfluenceExponent; // 0x440
	float TeamDeathLastSpawnAreaTimeOfRelevance; // 0x444
	float TeamDeathLastSpawnAreaInfluence; // 0x448
	float TeamDeathLastSpawnAreaDistance; // 0x44c
	float TeamDeathLastSpawnAreaInfluenceExponent; // 0x450
	int32_t IdlePlayerTimeout; // 0x454
	int32_t CountdownToStartTime; // 0x458
	int32_t SetupRoundTime; // 0x45c
	int32_t CinematicSetupRoundTime; // 0x460
	int32_t StratTime; // 0x464
	int32_t RoundTime; // 0x468
	int32_t PostRoundTime; // 0x46c
	int32_t WarmupRespawnTime; // 0x470
	int32_t PostMatchTime; // 0x474
	int32_t WaitingToStartTimer; // 0x478
	int32_t VoteTime; // 0x47c
	bool VoteKickEnabled; // 0x480
	float CharacterDestroyTime; // 0x484
	float PassiveFireUpEarnTime; // 0x488
	float MultikillTimer; // 0x48c
	bool bUseShootout; // 0x490
	float ShootoutRoundTime; // 0x494
	float ShootoutSetupTime; // 0x498
	float ShootoutTransitionTime; // 0x49c
	float ShootoutPostRoundTime; // 0x4a0
	float OverviewAndShootoutTitleScreenTimes; // 0x4a4
	bool CinematicsEnabled; // 0x4a8
	float CountdownToStartCinematicDelay; // 0x4ac
	bool OutlineAllowed; // 0x4b0
	bool GrenadeLinesAllowed; // 0x4b1
	bool LockedToFirstPerson; // 0x4b2
	float SpectatorTransferTime; // 0x4b4
	bool SpectatorTeamEnabled; // 0x4b8
	bool ForceFreeCamOnSpectatorStart; // 0x4b9
	float EnemyWeaponDamageModifier; // 0x4bc
	float SelfGrenadeDamageScale; // 0x4c0
	float SelfOtherDamageScale; // 0x4c4
	float FriendlyBulletDamageScale; // 0x4c8
	float FriendlyGrenadeDamageScale; // 0x4cc
	float InactivePlayerStateLifeSpan; // 0x4d0
	bool DisableWeaponDrop; // 0x4d4
	bool SendSafeString; // 0x4d5
	bool AllPlayersInvulnerable; // 0x4d6
	bool WinOnTeamEmpty; // 0x4d7
	int32_t NumBots; // 0x4d8
	float TakeItemFromBotDistance; // 0x4dc
	FString DefaultReplayName; // 0x4e0
	float RecordHz; // 0x4f0
	float CheckpointDelay; // 0x4f4
	bool RecordReplays; // 0x4f8
	int32_t ProScoreWin; // 0x4fc
	int32_t ProScoreDraw; // 0x500
	int32_t ProScoreLoss; // 0x504
	FString CurrentMapName; // 0x508
	FString CurrentModeName; // 0x518
	TArray<FString> TeamNames; // 0x528
	TArray<FString> TeamColors; // 0x538
	FMapDataCollection MapDataCollection; // 0x548
	TArray<ENationType> TeamNations; // 0x558
	float AdditionalRoundTime; // 0x568
	TArray<ABattalionPlayerControllerGMBase*> CurrentBots; // 0x5b8
	TArray<ABattalionPlayerControllerGMBase*> CurrentPlayers; // 0x5c8
	TArray<ABattalionCharacter*> AliveCharacters; // 0x5d8
	FVoteInfo CurrentVote; // 0x5e8
	ABattalionGameState* BattalionGameState; // 0x660
	ABattalionMarket* Market; // 0x670
	FSpectatorRules SpectatorRules; // 0x678
	UCurveFloat* NearlyEndedTimeCurve; // 0x688
	UCurveFloat* NearlyEndedScoreCurve; // 0x690
	ABattalionLoadoutSystem* LoadoutSystem; // 0x6a0
	ABattalionLoadoutSystem* LoadoutSystemClass; // 0x6a8
	ABattalionMarket* MarketClass; // 0x6b0
	TArray<FRecentKilledEvent> RecentKilledEvents; // 0x6b8
	TArray<ABattalionPlayerState*> EndGameMVPs; // 0x6c8
	TArray<APlayerState*> InactivePlayerArray; // 0x6d8
	FName MatchState; // 0x6e8
	FGuid MatchID; // 0x6f0
	FName PreviousMatchState; // 0x700
	int32_t NumPlayers; // 0x708
	TMap<EOnlinePlatform, FPlatformMatchSession> MatchSessions; // 0x710
	int32_t NumReadyPlayers; // 0x764
	TArray<FPendingRespawnInfo> PendingRespawns; // 0x768
	TArray<FPendingSpectateInfo> PendingSpectators; // 0x778
	TArray<FPendingKickInfo> PendingKicks; // 0x788
	UAkAudioEvent* AlliesWinEvent; // 0x798
	UAkAudioEvent* AxisWinEvent; // 0x7a0
	UAkAudioEvent* DrawEvent; // 0x7a8
	UAkAudioEvent* GameStartedVOEvent; // 0x7b0
	UAkAudioEvent* HalfTimeVOEvent; // 0x7b8
	bool NextRoundTimeout_Techncial; // 0x7c0
	bool NextRoundTimeout_Tactical; // 0x7c1
	bool PlayedCountdownMusic; // 0x7c2
	float PeriodicalTickTimer; // 0x7c4
	float TeamSpecIDCheckTimer; // 0x7c8
	float TeamSpecIDCheckReset; // 0x7cc
	float PassiveEarnFireUpTimer; // 0x7d0
	UBattalionGameInstance* BattInstance; // 0x7d8
	UBattalionCommandManager* CommandManager; // 0x7e0
	UBattalionMedalManager* MedalManager; // 0x7e8
	UBattalionMedalsDataAsset* MedalDataAsset; // 0x7f0
	TArray<APerfTestLocation*> PerfTextLocs; // 0x800
	FTimerHandle TimedScoreAwardHandle; // 0x818
	UPromodGameModeScoreAwardsDataAsset* ScoreAwardsDataAsset; // 0x820
	TArray<FTickedIntervalScoreAwardEntity> PlayersToAwardTickedScoreTo; // 0x828
};

struct UPromodOffensiveUtilDataAsset {
	TArray<FOffensiveUtilItem> OffensiveUtils; // 0x30
};

struct UDecalComponent {
	UMaterialInterface* DecalMaterial; // 0x1f8
	int32_t SortOrder; // 0x200
	float FadeScreenSize; // 0x204
	float FadeStartDelay; // 0x208
	float FadeDuration; // 0x20c
	float FadeInDuration; // 0x210
	float FadeInStartDelay; // 0x214
	char bDestroyOwnerAfterFade : 1; // 0x218
	FVector DecalSize; // 0x21c
};

struct APromodShootoutSpawn {
	bool bAllowed; // 0x278
	bool bTugOfWar; // 0x279
};

struct UCargoTeam {
	float TimeTaken; // 0x180
	float TimeRemaining; // 0x184
	float GracePeriodRemaining; // 0x188
	int32_t LastReachedCheckpoint; // 0x18c
	int32_t LastReachedCheckpointPip; // 0x190
};

struct ULightmassPortalComponent {
	UBoxComponent* PreviewBox; // 0x1f8
};

struct UParticleModuleMeshRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct USubmixEffectFlexiverbPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0xa0
};

struct UAnimSharingStateInstance : UAnimInstance {
	UAnimSequence* AnimationToPlay; // 0x2b8
	float PermutationTimeOffset; // 0x2c0
	float PlayRate; // 0x2c4
	bool bStateBool; // 0x2c8
	UAnimSharingInstance* Instance; // 0x2d0
};

struct USoundNodeWaveParam {
	FName WaveParameterName; // 0x48
};

struct UMaterialExpressionShaderStageSwitch {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct AWartidePlayerController {
	UAkAudioEvent* BuyGrenadeSound; // 0xc60
	UAkAudioEvent* BuySpecialGrenadeSound; // 0xc68
	UAkAudioEvent* BuyWeaponSound; // 0xc70
	UAkAudioEvent* DonateSound; // 0xc78
	UAkAudioEvent* RequestDonateSound; // 0xc80
	UAkAudioEvent* RecievedDonationSound; // 0xc88
	bool ShowBombActionPlant; // 0xc90
	bool ShowBombActionDefuse; // 0xc91
	bool AlreadyPlayedVoiceInstructions; // 0xc92
};

struct USlateBrushAsset {
	FSlateBrush Brush; // 0x28
};

struct UDistributionFloatConstant {
	float Constant; // 0x38
};

struct ATriggerBase {
	UShapeComponent* CollisionComponent; // 0x220
};

struct UNUICredits {
	float ScrollStartOffset; // 0x290
	float ScrollEndOffset; // 0x294
	float ScrollMaxSpeed; // 0x298
	float ScrollAutoScrollSpeed; // 0x29c
	float MaxDelayTilAutoScroll; // 0x2a0
	float ScrollAcceleration; // 0x2a4
	EControllerAnalogStick ControlAnalogStick; // 0x2a8
};

struct UWBP_ClassChanged_C {
	UWidgetAnimation* FadeInAndOut; // 0x260
	UHUDTextDataAsset* HUDColour; // 0x268
};

struct ULocationServicesImpl {
	FMulticastInlineDelegate OnLocationChanged; // 0x28
};

struct UDatasmithStaticMeshTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UMicroTransactionBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x38
	FString LastError; // 0x48
	FString LastErrorSolution; // 0x58
};

struct UTexture2DDynamic {
	EPixelFormat Format; // 0xe0
};

struct UWBP_PlayerLoadoutModificationScreen_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextButton_C* AcceptButton; // 0x268
	UTextButton_C* BTN_Back; // 0x270
	UTextButton_C* BTN_Delete; // 0x278
	UTextButton_C* BTN_FireUp; // 0x280
	UTextButton_C* BTN_Hat; // 0x288
	UTextButton_C* BTN_Melee; // 0x290
	UTextButton_C* BTN_Offense; // 0x298
	UTextButton_C* BTN_Primary; // 0x2a0
	UTextButton_C* BTN_Quick; // 0x2a8
	UTextButton_C* BTN_SaveLoadout; // 0x2b0
	UTextButton_C* BTN_SetFave; // 0x2b8
	UTextButton_C* BTN_Sidearm; // 0x2c0
	UTextButton_C* BTN_Tactical; // 0x2c8
	UTextBlock* DescriptText; // 0x2d0
	UImage* FavouriteImage; // 0x2d8
	UWBP_ModKitWeaponButton_C* Fireup; // 0x2e0
	UWBP_ModKitWeaponButton_C* Hats; // 0x2e8
	UImage* Image; // 0x2f0
	UImage* Image_2; // 0x2f8
	UImage* Image_3; // 0x300
	UImage* Image_4; // 0x308
	UImage* Image_134; // 0x310
	UImage* Image_154; // 0x318
	UMultiLineEditableText* LoadoutName; // 0x320
	UWBP_ModKitWeaponButton_C* MainWeapon; // 0x328
	UWBP_ModKitWeaponButton_C* Melee; // 0x330
	UWBP_ModKitWeaponButton_C* OffensiveUtil; // 0x338
	UWBP_ModKitWeaponButton_C* QuickUtil; // 0x340
	UOverlay* SavedPopupOverlay; // 0x348
	UScaleBox* ScaleBox_FireUpSelection; // 0x350
	UScaleBox* ScaleBox_HatSelection; // 0x358
	UScaleBox* ScaleBox_MainSelection; // 0x360
	UScaleBox* ScaleBox_MeleeSelection; // 0x368
	UScaleBox* ScaleBox_OffensiveSelection; // 0x370
	UScaleBox* ScaleBox_QuickSelection; // 0x378
	UScaleBox* ScaleBox_SidearnSelection; // 0x380
	UScaleBox* ScaleBox_TacticalSelection; // 0x388
	UWidgetSwitcher* SelectionWidgetSwitcher; // 0x390
	UWBP_ModKitWeaponButton_C* Sidearm; // 0x398
	USizeBox* SizeBox_Back; // 0x3a0
	USizeBox* SizeBox_Delete; // 0x3a8
	USizeBox* SizeBox_FireUp; // 0x3b0
	USizeBox* SizeBox_Hat; // 0x3b8
	USizeBox* SizeBox_Main; // 0x3c0
	USizeBox* SizeBox_Melee; // 0x3c8
	USizeBox* SizeBox_Offense; // 0x3d0
	USizeBox* SizeBox_QuickUtil; // 0x3d8
	USizeBox* SizeBox_Save; // 0x3e0
	USizeBox* SizeBox_SetFave; // 0x3e8
	USizeBox* SizeBox_Sidearm; // 0x3f0
	USizeBox* SizeBox_Tactical; // 0x3f8
	USpacer* Spacer_Fave_Save; // 0x400
	USpacer* Spacer_Save_Delete; // 0x408
	UWBP_ModKitWeaponButton_C* TacticalUtil; // 0x410
	UTextBlock* TitleText; // 0x418
	UPromodClassManagerDataAsset* ClassData; // 0x420
	UPromodClassDataAsset* ThisLoopsClassData; // 0x428
	TArray<UPromodClassDataAsset*> PrimaryDataAssets; // 0x430
	TArray<UPromodClassDataAsset*> SidearmDataAssets; // 0x440
	TArray<UPromodClassDataAsset*> MeleeDataAssets; // 0x450
	UPromodAllFireUpsDataAsset* AllFireUps; // 0x460
	int32_t IndexOfFireUpType; // 0x468
	UPromodOffensiveUtilDataAsset* OffensiveDataAsset; // 0x470
	UPromodTacticalUtilDataAsset* TacticalDataAsset; // 0x478
	UPromodCosmeticsDataAsset* CostmeticDataAsset_Hats; // 0x480
	FOffensiveUtilItem OffensiveSlot; // 0x488
	FTacticalUtilItem TacticalSlot; // 0x4d0
	FCosmeticItem HatSlot; // 0x520
	TArray<FLoadoutData> LoadoutsToInitFrom; // 0x558
	UTextButton_C* PrevSelectedButton; // 0x568
	FLinearColor SelectedButtonCol; // 0x570
	FLinearColor NotSelectedButtonCol; // 0x580
	int32_t IndexOfLoadout; // 0x590
	FMulticastInlineDelegate BackButton; // 0x598
	FQuickUtilItem QuickSlot; // 0x5a8
	UPromodQuickUtilDataAsset* QuickUtilDataAsset; // 0x5d0
	bool bSetAsFavourite; // 0x5d8
	int32_t IndexOfQuickUtilType; // 0x5dc
	FMulticastInlineDelegate LoadoutEditedAndSaved; // 0x5e0
	int32_t Max Loadout Name Length; // 0x5f0
};

struct UMaterialExpressionAbs {
	FExpressionInput Input; // 0x40
};

struct USubmixEffectConvolutionReverbPreset {
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	FSubmixEffectConvolutionReverbSettings Settings; // 0x70
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x98
	bool bEnableHardwareAcceleration; // 0x99
};

struct USpinBoxWidgetStyle {
	FSpinBoxStyle SpinBoxStyle; // 0x30
};

struct UMaterialExpressionPerInstanceCustomData {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct UActorChannel {
	AActor* Actor; // 0x70
	TArray<UObject*> CreateSubObjects; // 0x160
};

struct UBTTask_FinishWithResult {
	EBTNodeResult Result; // 0x70
};

struct UMovieSceneSequenceTickManager {
	TArray<AActor*> SequenceActors; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x38
};

struct UABP_Intervention_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x350
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x470
	FAnimNode_Slot AnimGraphNode_Slot; // 0x4f0
};

struct UParticleModuleAccelerationBase {
	char bAlwaysInWorldSpace : 1; // 0x30
};

struct UTouchInterface {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UParticleModuleBeamModifier {
	BeamModifierType ModifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector Position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UBombCharacterComponent {
	USkeletalMesh* Bomb1PSkeletalMesh; // 0x278
	USkeletalMesh* Bomb3PSkeletalMesh; // 0x280
	UObject* Bomb1PSkeletalMeshClass; // 0x288
	UObject* Bomb3PSkeletalMeshClass; // 0x290
	FSpecialAnim PlantingAnim; // 0x298
	FSpecialAnim QuickPlantingAnim; // 0x2b8
	FSpecialAnim DefusingAnim; // 0x2d8
	TArray<UMaterialInstanceDynamic*> Mesh1PMaterials; // 0x2f8
};

struct UParticleModuleSizeScale {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct ALiveFireGameMode {
	bool bUseRandomLocationForBotSpawning; // 0x850
	ELiveFireTrainingDifficulty CurrentDifficulty; // 0x851
	TMap<ELiveFireTrainingDifficulty, FLiveFireTrainingDetails> DifficultyModes; // 0x858
	APromodBot* BotClass; // 0x8a8
	int32_t SpawnCount; // 0x8b0
	int32_t NumBotsSpawned; // 0x8b4
};

struct UPromodWeaponDataAsset {
	TArray<FPromodWeaponInfo> PromodWeapons; // 0x30
};

struct UBTDecorator_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UDynamicEntryBoxBase {
	EDynamicBoxType EntryBoxType; // 0x108
	FVector2D EntrySpacing; // 0x10c
	TArray<FVector2D> SpacingPattern; // 0x118
	FSlateChildSize EntrySizeRule; // 0x128
	EHorizontalAlignment EntryHorizontalAlignment; // 0x130
	EVerticalAlignment EntryVerticalAlignment; // 0x131
	int32_t MaxElementSize; // 0x134
	FRadialBoxSettings RadialBoxSettings; // 0x138
	FUserWidgetPool EntryWidgetPool; // 0x158
};

struct UMockDataMeshTrackerComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f8
	bool ScanWorld; // 0x208
	bool RequestNormals; // 0x209
	bool RequestVertexConfidence; // 0x20a
	EMeshTrackerVertexColorMode VertexColorMode; // 0x20b
	TArray<FColor> BlockVertexColors; // 0x210
	FLinearColor VertexColorFromConfidenceZero; // 0x220
	FLinearColor VertexColorFromConfidenceOne; // 0x230
	float UpdateInterval; // 0x240
	UMRMeshComponent* MRMesh; // 0x248
};

struct AMapEditorGizmo {
	USceneComponent* TransformRootComponent; // 0x220
	USceneComponent* TranslationRootComponent; // 0x228
	UStaticMeshComponent* TranslationFreeAxis; // 0x230
	UStaticMeshComponent* TranslationHandleXAxis; // 0x238
	UStaticMeshComponent* TranslationHandleYAxis; // 0x240
	UStaticMeshComponent* TranslationHandleZAxis; // 0x248
	UStaticMeshComponent* TranslationHandleXYAxis; // 0x250
	UStaticMeshComponent* TranslationHandleXZAxis; // 0x258
	UStaticMeshComponent* TranslationHandleYZAxis; // 0x260
	USceneComponent* RotationRootComponent; // 0x268
	UStaticMeshComponent* RotationHandleTrackBall; // 0x270
	UStaticMeshComponent* RotationHandleXAxis; // 0x278
	UStaticMeshComponent* RotationHandleYAxis; // 0x280
	UStaticMeshComponent* RotationHandleZAxis; // 0x288
	USceneComponent* ScaleRootComponent; // 0x290
	UStaticMeshComponent* ScaleHandleUniform; // 0x298
	UStaticMeshComponent* ScaleHandleXAxis; // 0x2a0
	UStaticMeshComponent* ScaleHandleYAxis; // 0x2a8
	UStaticMeshComponent* ScaleHandleZAxis; // 0x2b0
	UStaticMeshComponent* ScaleHandleXYAxis; // 0x2b8
	UStaticMeshComponent* ScaleHandleXZAxis; // 0x2c0
	UStaticMeshComponent* ScaleHandleYZAxis; // 0x2c8
	TMap<UPrimitiveComponent*, FGizmoHandleData> TransformHandleDataMap; // 0x2d0
	EMapEditorTransformMode TransformMode; // 0x320
	EMapEditorTransformSpace TransformSpace; // 0x321
	AMapEditorObject* AttachedObject; // 0x328
	TArray<AMapEditorObject*> SelectedObjects; // 0x330
	bool bIsPerformingDragAction; // 0x340
	UPrimitiveComponent* CurrentlyHoveredHandle; // 0x348
	AMapEditorController* MapEditorControllerRef; // 0x350
	AMapEditorPawn* MapEditorPawnRef; // 0x358
};

struct UAssetMappingTable {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UWheeledVehicleMovementComponent4W {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UBTService_RunEQS {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UInputKeyDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UCrowdFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UWBP_SP_HUDEquipment_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_AmmoAdded; // 0x268
	UHorizontalBox* HB_Ammo; // 0x270
	UInvalidationBox* IB_Ammo; // 0x278
	UInvalidationBox* IB_LoadPos; // 0x280
	UInvalidationBox* IB_SavePos; // 0x288
	UInvalidationBox* IB_TacticalUtil; // 0x290
	UInvalidationBox* IB_WeaponSlot; // 0x298
	UImage* IMG_OffensiveUtilImage; // 0x2a0
	UImage* IMG_QuickUtilImage; // 0x2a8
	UImage* IMG_Slot1; // 0x2b0
	UImage* IMG_Slot2; // 0x2b8
	UImage* IMG_Slot3; // 0x2c0
	UImage* IMG_TacticalUtilBackground; // 0x2c8
	UImage* IMG_TacticalUtilImage; // 0x2d0
	UImage* IMG_WeaponBackground; // 0x2d8
	UImage* IMG_WeaponIconSlot1; // 0x2e0
	UImage* IMG_WeaponIconSlot2; // 0x2e8
	UImage* IMG_WeaponIconSlot3; // 0x2f0
	UPlatformKeyImage_C* KEY_Load; // 0x2f8
	UPlatformKeyImage_C* KEY_Reset; // 0x300
	UPlatformKeyImage_C* KEY_Save; // 0x308
	UProgressBar* PB_LoadPos; // 0x310
	UProgressBar* PB_SetPos; // 0x318
	UTextBlock* TB_AddedAmmo; // 0x320
	UTextBlock* TB_ClipAmmo; // 0x328
	UTextBlock* TB_ReserveAmmo; // 0x330
	UWidgetSwitcher* WS_SlotIcon; // 0x338
	UWidgetSwitcher* WS_SlotIndex; // 0x340
	int32_t Clip Ammo; // 0x348
	int32_t Reserve Ammo; // 0x34c
	ESpecialGrenadeType Tactical Util Type; // 0x350
	EGrenadeType Offensive Util Type; // 0x351
	EFireUpType Quick Util Type; // 0x352
	int32_t Offensive Util Count; // 0x354
	int32_t Tactical Util Count; // 0x358
	int32_t Quick Util Count; // 0x35c
	APromodPlayerState* Player State; // 0x360
	ESlotType ActiveSlot; // 0x368
	UTexture2D* AvailableBackground; // 0x370
	UTexture2D* NotAvailableBackground; // 0x378
	APromodPlayerController* OwningController; // 0x380
	APromodPawn_C* SpectatedPlayerCharacter; // 0x388
	bool SavePosPressed; // 0x390
	bool LoadPosPressed; // 0x391
	bool ResetPressed; // 0x392
	float Delta Time; // 0x394
	float SavePosTimePressed; // 0x398
	float LoadPosTimePressed; // 0x39c
	float SavePosActivateTime; // 0x3a0
	float LoadPosActivateTime; // 0x3a4
	bool ShowGizmoOptions; // 0x3a8
};

struct UMaterialExpressionRuntimeVirtualTextureOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UNiagaraComponentSettings {
	TSet<FName> SuppressActivationList; // 0x28
	TSet<FName> ForceAutoPooolingList; // 0x78
	TSet<FNiagaraEmitterNameSettingsRef> SuppressEmitterList; // 0xc8
};

struct UWBP_StyleScoreAwardFeed_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UWidgetAnimation* On_Fire_Chromatic; // 0x278
	UWidgetAnimation* +15-Fire-Kill; // 0x280
	UWidgetAnimation* +10-Fire-Kill; // 0x288
	UWidgetAnimation* Edge_Glow; // 0x290
	UWidgetAnimation* Fire-Shot; // 0x298
	UWidgetAnimation* OnFireGlowIcon; // 0x2a0
	UWidgetAnimation* FadeOffWithTime; // 0x2a8
	UVerticalBox* AwardContainer; // 0x2b0
	UHorizontalBox* HB_ComboScore; // 0x2b8
	UHorizontalBox* HB_ComboScore_BLUE; // 0x2c0
	UHorizontalBox* HB_ComboScore_RED; // 0x2c8
	UImage* Image_492; // 0x2d0
	UImage* On-Fire-Edge-Glow-BLue; // 0x2d8
	UImage* On-Fire-Edge-Glow-BLue_Shot; // 0x2e0
	UOn_Fire_C* On_Fire; // 0x2e8
	UImage* OnFireGlow; // 0x2f0
	UProgressBar* OnFireProgressBar; // 0x2f8
	URetainerBox* RetainerBox_1; // 0x300
	URetainerBox* RetainerBox_2; // 0x308
	UHorizontalBox* ScoreContainer; // 0x310
	UTextBlock* ScoreText; // 0x318
	UTextBlock* ScoreText_BLUE; // 0x320
	UTextBlock* ScoreText_RED; // 0x328
	UTextBlock* TB_ComboMultiplier; // 0x330
	UTextBlock* TB_ComboMultiplier_BLUE; // 0x338
	UTextBlock* TB_ComboMultiplier_RED; // 0x340
	UTextBlock* TB_ComboScore; // 0x348
	UTextBlock* TB_ComboScore_BLUE; // 0x350
	UTextBlock* TB_ComboScore_RED; // 0x358
	UWBP_StyleScoreAwardEntry_C* WBP_StyleScoreAwardEntry; // 0x360
	UWBP_StyleScoreAwardEntry_C* WBP_StyleScoreAwardEntry_2; // 0x368
	UWBP_StyleScoreAwardEntry_C* WBP_StyleScoreAwardEntry_3; // 0x370
	UWBP_StyleScoreAwardEntry_C* WBP_StyleScoreAwardEntry_4; // 0x378
	UWBP_StyleScoreAwardEntry_C* WBP_StyleScoreAwardEntry_5; // 0x380
	int32_t OnFireThreshold; // 0x388
	float ComboDecayTime; // 0x38c
	int32_t currentOnFireScore; // 0x390
	bool OnFireVisible; // 0x394
	float CurrentComboScore; // 0x398
	int32_t CurrentComboMultiplier; // 0x39c
	bool OldOnFire; // 0x3a0
	float OnFireVar; // 0x3a4
	UHUDTextDataAsset* HUD Colour; // 0x3a8
};

struct UViewport {
	FLinearColor BackgroundColor; // 0x120
};

struct UMaterialExpressionFeatureLevelSwitch {
	FExpressionInput Default; // 0x40
};

struct ATDMGameMode {
	bool EndOnMatchPointWin; // 0x838
	float WeaponSelectGracePeriod; // 0x83c
	float RoundTimeLeftUntilStopBackfill; // 0x840
	float ScorePctToStopBackfill; // 0x844
	bool AlreadyStoppedBackfill; // 0x848
	TArray<AActor*> UsedSpawns; // 0x868
};

struct UEditableGameplayTagQuery {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UAkRoomComponent {
	char bEnable : 1; // 0x218
	UAkRoomComponent* NextLowerPriorityComponent; // 0x220
	float Priority; // 0x228
	float WallOcclusion; // 0x22c
	float AuxSendLevel; // 0x230
	bool AutoPost; // 0x234
};

struct USystemTimeTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UKantanBarChartWidgetStyle {
	FKantanBarChartStyle ChartStyle; // 0x30
};

struct UBattalionCharacterComponent {
	UAkAudioEvent* MusicEvent; // 0x1f8
	UAkAudioEvent* StopMusicEvent; // 0x200
	UAkAudioEvent* PauseMusicEvent; // 0x208
	UAkAudioEvent* ResumeMusicEvent; // 0x210
};

struct UDebug_Button-LIGHT-LEFT-JUSTIFIED_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* TEXT_MOTION; // 0x268
	UWidgetAnimation* UNHOVER; // 0x270
	UWidgetAnimation* HOVER; // 0x278
	UTextBlock* BLUETEXT; // 0x280
	UImage* Blur-Steak; // 0x288
	UButton* DEBUG-BUTTON; // 0x290
	UTextBlock* REDTEXT; // 0x298
	UTextBlock* TOPTEXT; // 0x2a0
	FText Text; // 0x2a8
	bool NewVar_1; // 0x2c0
	FMulticastInlineDelegate ButtonClicked; // 0x2c8
};

struct APlayerController {
	UPlayer* Player; // 0x298
	APawn* AcknowledgedPawn; // 0x2a0
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2a8
	AHUD* MyHUD; // 0x2b0
	APlayerCameraManager* PlayerCameraManager; // 0x2b8
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2c0
	bool bAutoManageActiveCameraTarget; // 0x2c8
	FRotator TargetViewRotation; // 0x2cc
	float SmoothTargetViewRotationSpeed; // 0x2e4
	TArray<AActor*> HiddenActors; // 0x2f0
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300
	float LastSpectatorStateSynchTime; // 0x314
	FVector LastSpectatorSyncLocation; // 0x318
	FRotator LastSpectatorSyncRotation; // 0x324
	int32_t ClientCap; // 0x330
	UCheatManager* CheatManager; // 0x338
	UCheatManager* CheatClass; // 0x340
	UPlayerInput* PlayerInput; // 0x348
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350
	char bPlayerIsWaiting : 1; // 0x3d0
	char NetPlayerIndex; // 0x3d4
	UNetConnection* PendingSwapConnection; // 0x410
	UNetConnection* NetConnection; // 0x418
	float InputYawScale; // 0x42c
	float InputPitchScale; // 0x430
	float InputRollScale; // 0x434
	char bShowMouseCursor : 1; // 0x438
	char bEnableClickEvents : 1; // 0x438
	char bEnableTouchEvents : 1; // 0x438
	char bEnableMouseOverEvents : 1; // 0x438
	char bEnableTouchOverEvents : 1; // 0x438
	char bForceFeedbackEnabled : 1; // 0x438
	float ForceFeedbackScale; // 0x43c
	TArray<FKey> ClickEventKeys; // 0x440
	EMouseCursor DefaultMouseCursor; // 0x450
	EMouseCursor CurrentMouseCursor; // 0x451
	ECollisionChannel DefaultClickTraceChannel; // 0x452
	ECollisionChannel CurrentClickTraceChannel; // 0x453
	float HitResultTraceDistance; // 0x454
	uint16_t SeamlessTravelCount; // 0x458
	uint16_t LastCompletedSeamlessTravelCount; // 0x45a
	UInputComponent* InactiveStateInputComponent; // 0x4d0
	char bShouldPerformFullTickWhenPaused : 1; // 0x4d8
	UTouchInterface* CurrentTouchInterface; // 0x4f0
	ASpectatorPawn* SpectatorPawn; // 0x548
	bool bIsLocalPlayerController; // 0x554
	FVector SpawnLocation; // 0x558
};

struct UParticleModuleRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UComboButtonWidgetStyle {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UInterpTrackLinearColorProp {
	FName PropertyName; // 0x90
};

struct URarityColourDataAsset {
	TArray<FRarityColourEntity> RarityColours; // 0x30
};

struct UProceduralFoliageComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xb0
	float TileOverlap; // 0xb8
	AVolume* SpawningVolume; // 0xc0
	FGuid ProceduralGuid; // 0xc8
};

struct ACTFGameMode {
	float DistanceToFlagTouch; // 0x878
	float DistanceToFlagZone; // 0x87c
	float DropFlagDisablePickupCounter; // 0x880
	float FlagZoneSpawnWeighting; // 0x884
	float FlagZoneSpawnDistance; // 0x888
	float EnemyFlagAtZoneSpawnPointScalar; // 0x88c
	float AllyFlagAtZoneSpawnPointScalar; // 0x890
	float EnemyFlagNotAtZoneSpawnPointScalar; // 0x894
	float AllyFlagNotAtZoneSpawnPointScalar; // 0x898
	bool UseOvertime; // 0x89c
	float FlagCheckTime; // 0x8a0
	bool ExtraTimeSet; // 0x8a4
	int32_t NumOvertimeRounds; // 0x8a8
	float DroppedFlagResetTime; // 0x8ac
	float VerticalDistanceToFlagZone; // 0x8b8
	ACTFGameState* CTFGameState; // 0x8c0
	UObject* FlagClass; // 0x8c8
	UObject* FlagZoneClass; // 0x8d0
	FNationSound mFriendPickedUpEvent; // 0x8d8
	FNationSound mEnemyPickedUpEvent; // 0x8f8
	FNationSound mFriendDroppedEvent; // 0x918
	FNationSound mEnemyDroppedEvent; // 0x938
	FNationSound mFriendReturnedEvent; // 0x958
	FNationSound mEnemyReturnedEvent; // 0x978
	FNationSound mFriendCapturedEvent; // 0x998
	FNationSound mEnemyCapturedEvent; // 0x9b8
	UAkAudioEvent* EnemyFlagCapturedEvent; // 0x9d8
	UAkAudioEvent* EnemyFlagReturnedEvent; // 0x9e0
	UAkAudioEvent* EnemyFlagTakenEvent; // 0x9e8
	UAkAudioEvent* FriendlyFlagCapturedEvent; // 0x9f0
	UAkAudioEvent* FriendlyFlagReturnedEvent; // 0x9f8
	UAkAudioEvent* FriendlyFlagTakenEvent; // 0xa00
	UAkAudioEvent* PersonalFlagPickupEvent; // 0xa08
	float OnFloorTimer; // 0xa10
	bool FloorTimerActive; // 0xa14
};

struct UABP_AmmoBox_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot; // 0x388
};

struct UNiagaraEffectType {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	UNiagaraSignificanceHandler* SignificanceHandler; // 0x30
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct UVehicleAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0xa40
};

struct UMaterialExpressionHairColor {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct UWBP_SNDLeaderboard_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a8
	UBackgroundBlur* BackgroundBlur_106; // 0x2b0
	UBorder* Border_RoundNumber; // 0x2b8
	UBorder* Border_RoundPips; // 0x2c0
	UCanvasPanel* CanvasPanel_71; // 0x2c8
	UImage* IMG_SelfTeamBottomBar; // 0x2d0
	UImage* IMG_SelfTeamHalfTimeArrow; // 0x2d8
	USizeBox* SB_RoundPips; // 0x2e0
	USizeBox* SB_SelfTeamBottomBar; // 0x2e8
	USizeBox* SB_SelfTeamHalfTimeArrow; // 0x2f0
	UTextBlock* TB_EnemyTeamScore; // 0x2f8
	UTextBlock* TB_RoundNumber; // 0x300
	UTextBlock* TB_SelfTeamScore; // 0x308
	UVerticalBox* VB_EnemyTeamPlayers; // 0x310
	UVerticalBox* VB_SelfTeamPlayers; // 0x318
	UVerticalBox* VerticalBox; // 0x320
	UVerticalBox* VerticalBox_140; // 0x328
	UHorizontalBox* WB_RoundPips; // 0x330
	UWBP_SNDLeaderboardItem_C* WBP_SNDLeaderboardItem_C_1; // 0x338
	TArray<UWBP_SNDLeaderboardItem_C*> LeaderboardItemWidgets; // 0x340
	int32_t TotalPlayers; // 0x350
	int32_t MissingLeaderboardItems; // 0x354
};

struct ULevelVariantSets {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct UARComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct UMedalAnotherNotch {
	AFFAGameMode* FFAGameMode; // 0x48
};

struct UMaterialExpressionSmoothStep {
	FExpressionInput Min; // 0x40
	FExpressionInput Max; // 0x54
	FExpressionInput Value; // 0x68
	float ConstMin; // 0x7c
	float ConstMax; // 0x80
	float ConstValue; // 0x84
};

struct UBlackboardKeyType_Enum {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UPaperFlipbook {
	float FramesPerSecond; // 0x28
	TArray<FPaperFlipbookKeyFrame> KeyFrames; // 0x30
	UMaterialInterface* DefaultMaterial; // 0x40
	EFlipbookCollisionMode CollisionSource; // 0x48
};

struct UAnimSharingInstance {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0x88
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xc8
	UEnum* StateEnum; // 0xe8
	AActor* SharingActor; // 0xf0
};

struct UNUIScreenEffects {
	float SniperVignette; // 0x278
	UNUIDamageIndicator* DamageIndicatorClass; // 0x288
};

struct UBreakpoint {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UARPlaneComponent {
	FARPlaneUpdatePayload ReplicatedPayload; // 0x280
};

struct UMaterialExpressionSetMaterialAttributes {
	TArray<FExpressionInput> Inputs; // 0x40
	TArray<FGuid> AttributeSetTypes; // 0x50
};

struct UMaterialExpressionDecalMipmapLevel {
	FExpressionInput TextureSize; // 0x40
	float ConstWidth; // 0x54
	float ConstHeight; // 0x58
};

struct URadialForceComponent {
	float Radius; // 0x1f8
	ERadialImpulseFalloff Falloff; // 0x1fc
	float ImpulseStrength; // 0x200
	char bImpulseVelChange : 1; // 0x204
	char bIgnoreOwningActor : 1; // 0x204
	float ForceStrength; // 0x208
	float DestructibleDamage; // 0x20c
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x210
};

struct UBattalionCommandManager {
	ABattalionGameMode* GameMode; // 0x28
};

struct UAnimSharingAdditiveInstance {
	TWeakObjectPtr<USkeletalMeshComponent> BaseComponent; // 0x2b8
	TWeakObjectPtr<UAnimSequence> AdditiveAnimation; // 0x2c0
	float Alpha; // 0x2c8
	bool bStateBool; // 0x2cc
};

struct AHQGameMode {
	float CaptureTime; // 0x878
	float CooldownTime; // 0x87c
	int32_t CaptureScore; // 0x880
	int32_t ScorePerSecond; // 0x884
	float ObjectiveResetTime; // 0x888
	float ObjectiveRespawnTime; // 0x88c
	float ObjectiveUnlockTime; // 0x890
	float ObjectiveCaptureTimeout; // 0x894
	bool ExtraTimeSet; // 0x898
	UObject* ZoneClass; // 0x8a0
	UAkAudioEvent* ObjectiveCapturedEventFriendly; // 0x8e0
	UAkAudioEvent* ObjectiveCapturedEventEnemy; // 0x8e8
	UAkAudioEvent* ObjectiveDestroyedEvent; // 0x8f0
	UAkAudioEvent* FriendlyCapturedHQEvent; // 0x8f8
	UAkAudioEvent* EnemyCapturedHQEvent; // 0x900
	UAkAudioEvent* FriendlyDestroyedHQEvent; // 0x908
	UAkAudioEvent* EnemyDestroyedHQEvent; // 0x910
	UAkAudioEvent* FriendlySecuredHQEvent; // 0x918
	UAkAudioEvent* EnemySecuredHQEvent; // 0x920
	UAkAudioEvent* HQUnlockedEvent; // 0x928
	UAkAudioEvent* HQLocatedEvent; // 0x930
	float DebugLogTimer; // 0x938
	float DebugLogInterval; // 0x93c
	bool DebuggingEndRound; // 0x940
};

struct UNUITeamMatchResultScreen {
	FLinearColor ResultTextColor; // 0x350
};

struct USceneCaptureComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x1f8
	ESceneCaptureSource CaptureSource; // 0x1f9
	char bCaptureEveryFrame : 1; // 0x1fa
	char bCaptureOnMovement : 1; // 0x1fa
	bool bAlwaysPersistRenderingState; // 0x1fb
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x200
	TArray<AActor*> HiddenActors; // 0x210
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x220
	TArray<AActor*> ShowOnlyActors; // 0x230
	float LODDistanceFactor; // 0x240
	float MaxViewDistanceOverride; // 0x244
	int32_t CaptureSortPriority; // 0x248
	bool bUseRayTracingIfEnabled; // 0x24c
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x250
	FString ProfilingEventName; // 0x290
};

struct USizeBoxSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UStreamingSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UNiagaraDataInterfaceGrid2D {
	int32_t NumCellsX; // 0xd8
	int32_t NumCellsY; // 0xdc
	int32_t NumCellsMaxAxis; // 0xe0
	int32_t NumAttributes; // 0xe4
	bool SetGridFromMaxAxis; // 0xe8
	FVector2D WorldBBoxSize; // 0xec
};

struct UChaosClothSharedSimConfig {
	int32_t IterationCount; // 0x28
	int32_t SubdivisionCount; // 0x2c
	float SelfCollisionThickness; // 0x30
	float CollisionThickness; // 0x34
	bool bUseDampingOverride; // 0x38
	float Damping; // 0x3c
	bool bUseGravityOverride; // 0x40
	float GravityScale; // 0x44
	FVector Gravity; // 0x48
	bool bUseLocalSpaceSimulation; // 0x54
	bool bUseXPBDConstraints; // 0x55
};

struct UNUIBombGameOverview {
	TArray<UNUIBombGameOverviewAvatar*> LeftTeamWidgets; // 0x3a0
	TArray<UNUIBombGameOverviewAvatar*> RightTeamWidgets; // 0x3b0
	UNUIBombGameOverviewAvatar* AvatarWidgetClass; // 0x3c0
	TArray<ABombPlayerState*> LeftPlayerList; // 0x3c8
	TArray<ABombPlayerState*> RightPlayerList; // 0x3d8
	FText LeftTeamAliveCount; // 0x3e8
	FText RightTeamAliveCount; // 0x400
	ESlateVisibility SpectatorScoreVisibility; // 0x418
	ESlateVisibility LeftTeamAvatarsVisibility; // 0x419
	ESlateVisibility RightTeamAvatarsVisibility; // 0x41a
	ESlateVisibility LeftTeamAliveCountVisibility; // 0x41b
	ESlateVisibility RightTeamAliveCountVisibility; // 0x41c
	ESlateVisibility SpectatorBombInteractionTimerVisibility; // 0x41d
	float BombInteractionProgress; // 0x420
};

struct UParticleModuleVelocity {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct ACargoPlayerSpawn {
	int32_t Checkpoint; // 0x278
};

struct UMaterialExpressionTransformPosition {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct UMovieSceneColorTrack {
	bool bIsSlateColor; // 0xb0
};

struct USynthComponentToneGenerator {
	float Frequency; // 0x6c0
	float Volume; // 0x6c4
};

struct UWBP_GenericBlockedMessage_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Glitch; // 0x268
	UWidgetAnimation* Intro; // 0x270
	UTextBlock* descriptiontext; // 0x278
	UTextBlock* descriptiontextBLUE; // 0x280
	UTextBlock* descriptiontextRED; // 0x288
	bool bIsShowing; // 0x290
	float FadeDelay; // 0x294
	UHUDMaster* HUDReference; // 0x298
};

struct UGrenadeMarker {
	ABattalionCharacter* LinkedCharacter; // 0x260
	float BeaconScaleX; // 0x268
	float BeaconScaleY; // 0x26c
	float Angle; // 0x270
	FVector2D Translation; // 0x274
	UImage* Image; // 0x280
	UImage* NadeImage; // 0x288
	FVector2D ScaledPlayerPos; // 0x290
	float RotationAngle; // 0x298
	UCanvasPanelSlot* CanvasPanelSlot; // 0x2a0
};

struct ATemplateSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x228
	UTemplateSequencePlayer* SequencePlayer; // 0x240
	FSoftObjectPath TemplateSequence; // 0x248
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x260
};

struct UPromodMainMenuScreen {
	TArray<FString> UNLOCKEDLEVELS; // 0x290
	TMap<FString, int32_t> KillrunLevelStarsMap; // 0x2a0
};

struct ULeaderboardItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* LocalPlayerArrowBreathe; // 0x268
	UImage* BackdropImage; // 0x270
	UTextBlock* NameBox; // 0x278
	UButton* ProfileBtn; // 0x280
	UTextBlock* RankBox; // 0x288
	UTextBlock* timeBox; // 0x290
	FUniqueNetIdRepl PlayerNetId; // 0x298
};

struct UGarbageCollectionSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UMedal50BombHQ {
	AHQGameMode* HQGameMode; // 0x48
};

struct APromodPlayerState {
	FLoadoutData LastChosenClass; // 0x5e8
	FLoadoutData PendingClassChange; // 0x730
	FMulticastInlineDelegate OnFireupAvailabilityChanged; // 0x878
	FMulticastInlineDelegate OnQuickUtilAvailabilityChanged; // 0x888
	FMulticastInlineDelegate OnClassChanged; // 0x898
	float FireUpScoreProgress; // 0x8a8
	bool bShootoutEliminated; // 0x8ac
	int32_t KillsThisRound; // 0x8b0
	bool bHasSpawnedWithClass; // 0x8b4
	FFireupState FireupState_Ultimate; // 0x8b8
	FFireupState FireupState_Quick; // 0x8c8
	float TimeUntilQuickUtilAward; // 0x8d8
	EPromodActionPrompt CurrentActionPrompt; // 0x8dc
	int32_t CurrentKillConfirmPoints; // 0x8e0
};

struct UBehaviorTreeManager {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UAIDataProvider_Random {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UInterpGroupInst {
	UInterpGroup* Group; // 0x28
	AActor* GroupActor; // 0x30
	TArray<UInterpTrackInst*> TrackInst; // 0x38
};

struct URuntimeVirtualTexture {
	int32_t TileCount; // 0x28
	int32_t TileSize; // 0x2c
	int32_t TileBorderSize; // 0x30
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x34
	bool bCompressTextures; // 0x35
	bool bClearTextures; // 0x36
	bool bSinglePhysicalSpace; // 0x37
	bool bPrivateSpace; // 0x38
	bool bAdaptive; // 0x39
	bool bContinuousUpdate; // 0x3a
	int32_t RemoveLowMips; // 0x3c
	TextureGroup LODGroup; // 0x40
	int32_t Size; // 0x44
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
};

struct UMaterialExpressionTime {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct UCanvasPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UNUIReadyPrompt {
	bool ReadyState; // 0x278
	FText BindName; // 0x280
	FText RequiredPlayersRemainingText; // 0x298
};

struct USkyAtmosphereComponent {
	ESkyAtmosphereTransformMode TransformMode; // 0x1f8
	float BottomRadius; // 0x1fc
	FColor GroundAlbedo; // 0x200
	float AtmosphereHeight; // 0x204
	float MultiScatteringFactor; // 0x208
	float TraceSampleCountScale; // 0x20c
	float RayleighScatteringScale; // 0x210
	FLinearColor RayleighScattering; // 0x214
	float RayleighExponentialDistribution; // 0x224
	float MieScatteringScale; // 0x228
	FLinearColor MieScattering; // 0x22c
	float MieAbsorptionScale; // 0x23c
	FLinearColor MieAbsorption; // 0x240
	float MieAnisotropy; // 0x250
	float MieExponentialDistribution; // 0x254
	float OtherAbsorptionScale; // 0x258
	FLinearColor OtherAbsorption; // 0x25c
	FTentDistribution OtherTentDistribution; // 0x26c
	FLinearColor SkyLuminanceFactor; // 0x278
	float AerialPespectiveViewDistanceScale; // 0x288
	float HeightFogContribution; // 0x28c
	float TransmittanceMinLightElevationAngle; // 0x290
	float AerialPerspectiveStartDepth; // 0x294
	FGuid bStaticLightingBuiltGUID; // 0x2bc
};

struct UExpandableArea {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct AHardpointGameState {
	float CurrentZoneTimeRemaining; // 0x610
	EHardpointState CurrentHardpointState; // 0x614
	int32_t CurrentZoneAllegiance; // 0x618
};

struct UAnimNotifyState_TimedParticleEffect {
	UParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct USoundNodeModulator {
	float PitchMin; // 0x48
	float PitchMax; // 0x4c
	float VolumeMin; // 0x50
	float VolumeMax; // 0x54
};

struct UNuclearAsset {
	FGuid UUID; // 0x30
};

struct UMaterialExpressionSkyAtmosphereAerialPerspective {
	FExpressionInput WorldPosition; // 0x40
};

struct USubmixEffectSubmixEQPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0xa0
};

struct ABattalionBloodEffect {
	TArray<FDecalData> DefaultDecals; // 0x220
	float DecalDepth; // 0x230
	FHitResult SurfaceHit; // 0x234
};

struct USoundNodeDelay {
	float DelayMin; // 0x48
	float DelayMax; // 0x4c
};

struct UCommandlet {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
	char ShowProgress : 1; // 0x78
};

struct UNiagaraDataInterfaceCurveBase {
	TArray<float> ShaderLUT; // 0x38
	float LUTMinTime; // 0x48
	float LUTMaxTime; // 0x4c
	float LUTInvTimeRange; // 0x50
	float LUTNumSamplesMinusOne; // 0x54
	char bUseLUT : 1; // 0x58
	char bExposeCurve : 1; // 0x58
	FName ExposedName; // 0x5c
	UTexture2D* ExposedTexture; // 0x68
};

struct AArchVisCharacter {
	FString LookUpAxisName; // 0x4b8
	FString LookUpAtRateAxisName; // 0x4c8
	FString TurnAxisName; // 0x4d8
	FString TurnAtRateAxisName; // 0x4e8
	FString MoveForwardAxisName; // 0x4f8
	FString MoveRightAxisName; // 0x508
	float MouseSensitivityScale_Pitch; // 0x518
	float MouseSensitivityScale_Yaw; // 0x51c
};

struct UParticleSystem {
	float UpdateTime_FPS; // 0x30
	float UpdateTime_Delta; // 0x34
	float WarmupTime; // 0x38
	float WarmupTickRate; // 0x3c
	TArray<UParticleEmitter*> Emitters; // 0x40
	UParticleSystemComponent* PreviewComponent; // 0x50
	UInterpCurveEdSetup* CurveEdSetup; // 0x58
	float LODDistanceCheckTime; // 0x60
	float MacroUVRadius; // 0x64
	TArray<float> LODDistances; // 0x68
	TArray<FParticleSystemLOD> LODSettings; // 0x78
	FBox FixedRelativeBoundingBox; // 0x88
	float SecondsBeforeInactive; // 0xa4
	float Delay; // 0xa8
	float DelayLow; // 0xac
	char bOrientZAxisTowardCamera : 1; // 0xb0
	char bUseFixedRelativeBoundingBox : 1; // 0xb0
	char bShouldResetPeakCounts : 1; // 0xb0
	char bHasPhysics : 1; // 0xb0
	char bUseRealtimeThumbnail : 1; // 0xb0
	char ThumbnailImageOutOfDate : 1; // 0xb0
	char bUseDelayRange : 1; // 0xb1
	char bAllowManagedTicking : 1; // 0xb1
	char bAutoDeactivate : 1; // 0xb1
	char bRegenerateLODDuplicate : 1; // 0xb1
	EParticleSystemUpdateMode SystemUpdateMode; // 0xb2
	ParticleSystemLODMethod LODMethod; // 0xb3
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xb4
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0xb5
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xb7
	uint32_t MinTimeBetweenTicks; // 0xb8
	float InsignificanceDelay; // 0xbc
	FVector MacroUVPosition; // 0xc0
	FBox CustomOcclusionBounds; // 0xcc
	TArray<FLODSoloTrack> SoloTracking; // 0xe8
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0xf8
};

struct AScaledMapBeacon {
	UBoxComponent* MapScaleExtents; // 0x260
};

struct ADOMGameState {
	TArray<ADOMMode_Zone*> Zones; // 0x4a0
	float CaptureTime; // 0x4b0
};

struct USkeletalMesh {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	TArray<FSkeletalMaterial> Materials; // 0xd8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xe8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xf8
	FPerPlatformInt MinLOD; // 0x158
	FPerPlatformBool DisableBelowMinLodStripping; // 0x15c
	EAxis SkelMirrorAxis; // 0x15d
	EAxis SkelMirrorFlipAxis; // 0x15e
	char bUseFullPrecisionUVs : 1; // 0x15f
	char bUseHighPrecisionTangentBasis : 1; // 0x15f
	char bHasBeenSimplified : 1; // 0x15f
	char bHasVertexColors : 1; // 0x15f
	char bEnablePerPolyCollision : 1; // 0x15f
	UBodySetup* BodySetup; // 0x160
	UPhysicsAsset* PhysicsAsset; // 0x168
	UPhysicsAsset* ShadowPhysicsAsset; // 0x170
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x178
	TArray<UMorphTarget*> MorphTargets; // 0x188
	UAnimInstance* PostProcessAnimBlueprint; // 0x310
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x318
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x328
	TArray<UAssetUserData*> AssetUserData; // 0x358
	TArray<USkeletalMeshSocket*> Sockets; // 0x368
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x388
};

struct UMedal40BombHQ {
	AHQGameMode* HQGameMode; // 0x48
};

struct AInfectionGameState {
	int32_t SurvivorTeamSize; // 0x4a0
	int32_t InfectedAlive; // 0x4a4
};

struct UWBP_GrenadeMarker_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UImage* Arrow; // 0x270
	UCanvasPanel* CanvasPanel_1; // 0x278
	UImage* Grenade; // 0x280
	UOverlay* GrenadeOverlay; // 0x288
	UCanvasPanel* RotationParent; // 0x290
	bool bIsInUse; // 0x298
};

struct UImage {
	FSlateBrush Brush; // 0x108
	FDelegate BrushDelegate; // 0x190
	FLinearColor ColorAndOpacity; // 0x1a0
	FDelegate ColorAndOpacityDelegate; // 0x1b0
	bool bFlipForRightToLeftFlowDirection; // 0x1c0
	FDelegate OnMouseButtonDownEvent; // 0x1c4
};

struct UPlayFabServerAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x8c8
	UPlayFabJsonObject* RequestJsonObj; // 0x8d0
	UPlayFabJsonObject* ResponseJsonObj; // 0x8d8
};

struct UMovieSceneTrackInstance {
	UObject* AnimatedObject; // 0x28
	bool bIsMasterTrackInstance; // 0x30
	UMovieSceneEntitySystemLinker* Linker; // 0x38
	TArray<FMovieSceneTrackInstanceInput> Inputs; // 0x40
};

struct AProceduralFoliageBlockingVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct UParticleModuleColor {
	FRawDistributionVector StartColor; // 0x30
	FRawDistributionFloat StartAlpha; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct AMapIconActor {
	UMapIconComponent* MapIconComponent; // 0x220
};

struct UWBP_BlitzBombProgress_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Percentage; // 0x268
	UWBP_BombProgressBar_C* ProgressBar; // 0x270
};

struct UMedalDomination {
	ADOMGameMode* DOMGameMode; // 0x48
};

struct UBehaviorTree {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UPhysicsSettings {
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0xe0
	ESettingsLockedAxis LockedAxis; // 0x114
	ESettingsDOF DefaultDegreesOfFreedom; // 0x115
	bool bSuppressFaceRemapTable; // 0x116
	bool bSupportUVFromHitResults; // 0x117
	bool bDisableActiveActors; // 0x118
	bool bDisableKinematicStaticPairs; // 0x119
	bool bDisableKinematicKinematicPairs; // 0x11a
	bool bDisableCCD; // 0x11b
	bool bEnableEnhancedDeterminism; // 0x11c
	float AnimPhysicsMinDeltaTime; // 0x120
	bool bSimulateAnimPhysicsAfterReset; // 0x124
	float MaxPhysicsDeltaTime; // 0x128
	bool bSubstepping; // 0x12c
	bool bSubsteppingAsync; // 0x12d
	float MaxSubstepDeltaTime; // 0x130
	int32_t MaxSubsteps; // 0x134
	float SyncSceneSmoothingFactor; // 0x138
	float InitialAverageFrameRate; // 0x13c
	int32_t PhysXTreeRebuildRate; // 0x140
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x148
	FBroadphaseSettings DefaultBroadphaseSettings; // 0x158
	float MinDeltaVelocityForHitEvents; // 0x198
	FChaosPhysicsSettings ChaosSettings; // 0x19c
};

struct UMovieSceneBoolSection {
	bool DefaultValue; // 0xe8
	FMovieSceneBoolChannel BoolCurve; // 0xf0
};

struct UMaterialExpressionArccosineFast {
	FExpressionInput Input; // 0x40
};

struct UKantanChartLegend {
	FMargin Margins; // 0x108
	FMargin SeriesPadding; // 0x118
	FSlateBrush Background; // 0x128
	int32_t FontSize; // 0x1b0
	TWeakObjectPtr<UKantanCartesianChartBase> Chart; // 0x1b4
};

struct UMaterialExpressionDistanceFieldGradient {
	FExpressionInput Position; // 0x40
};

struct APaperGroupedSpriteActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct UAnimSet {
	char bAnimRotationOnly : 1; // 0x28
	TArray<FName> TrackBoneNames; // 0x30
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0x40
	TArray<char> BoneUseAnimTranslation; // 0x50
	TArray<char> ForceUseMeshTranslation; // 0x60
	TArray<FName> UseTranslationBoneNames; // 0x70
	TArray<FName> ForceMeshTranslationBoneNames; // 0x80
	FName PreviewSkelMeshName; // 0x90
	FName BestRatioSkelMeshName; // 0x98
};

struct UDistributionVectorUniform {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct UNiagaraPrecompileContainer {
	TArray<UNiagaraScript*> Scripts; // 0x28
	UNiagaraSystem* System; // 0x38
};

struct ABattalionWeapon {
	UTimelineComponent* DematerializeTimeline; // 0x220
	FMulticastInlineDelegate OnFireStateChanged; // 0x230
	UMaterialInterface* WeaponMaterialIcon; // 0x260
	FCanvasIcon PrimaryIcon; // 0x268
	FCanvasIcon SecondaryIcon; // 0x280
	FCanvasIcon PrimaryClipIcon; // 0x298
	FCanvasIcon SecondaryClipIcon; // 0x2b0
	float AmmoIconsCount; // 0x2c8
	int32_t PrimaryClipIconOffset; // 0x2cc
	int32_t SecondaryClipIconOffset; // 0x2d0
	FCanvasIcon Crosshair[0x5]; // 0x2d8
	FCanvasIcon AimingCrosshair[0x5]; // 0x350
	bool UseLaserDot; // 0x3c8
	bool UseCustomCrosshair; // 0x3c9
	bool UseCustomAimingCrosshair; // 0x3ca
	bool bHideCrosshairWhileNotAiming; // 0x3cb
	bool bHideCrosshairWhileAiming; // 0x3cc
	bool HideWeaponDuringTransition; // 0x3cd
	float TransitionHideWeaponPoint; // 0x3d0
	FWeaponAnim ActiveReloadAnim; // 0x3d8
	TArray<FSoftObjectPath> SkinAssetToLoad_FP; // 0x3f8
	TArray<FSoftObjectPath> SkinAssetToLoad_3P; // 0x408
	bool EnableRTPCSinceBurst; // 0x430
	float RTPCSinceBurstMAX; // 0x434
	UAkComponent* DefaultAkComp; // 0x438
	UAkAudioEvent* WeaponBashImpactSound; // 0x440
	FString SkinId; // 0x448
	ABattalionCharacter* MyPawn; // 0x458
	ABattalionPlayerState* MyPawn_PlayerState; // 0x460
	FQuat DefaultRelativeRotation; // 0x470
	int32_t CurrentWeaponLevel; // 0x480
	FMulticastInlineDelegate OnWeaponFinishedHolster; // 0x488
	FString WeaponName; // 0x4a0
	UTexture2D* WeaponIcon; // 0x4b0
	UTexture2D* WeaponModKitIcon; // 0x4b8
	EParentModKit ParentModKit; // 0x4c0
	FWeaponCosmeticDataArray CosmeticData; // 0x4c8
	UPromodWeaponStatsDataAsset* StatsDataAsset; // 0x4e0
	USceneComponent* RootScene; // 0x4e8
	UFOVSkeletalMeshComponent* Mesh1P; // 0x4f0
	FVector Mesh1POffset; // 0x4f8
	FVector Mesh1POffsetTargeting; // 0x504
	USkeletalMeshComponent* Mesh3P; // 0x510
	UFOVParticleSystemComponent* BulletCasingEmitter; // 0x518
	UFOVParticleSystemComponent* MagazineCasingEmitter; // 0x520
	float WeaponTraceStartOffset; // 0x52c
	bool EnableSniperGracePeriod; // 0x534
	float SniperGracePeriod; // 0x538
	bool bUseBurstShotRTPC; // 0x53c
	float SingleFireBurstRecoverySpeed; // 0x544
	float AddedPerBurstValue; // 0x548
	bool bEnableTransitionTelescope; // 0x54c
	UAkComponent* PawnAkComponent; // 0x550
	TArray<UMaterialInstanceDynamic*> Mesh1PMaterials; // 0x558
	TArray<UMaterialInstanceDynamic*> PawnMesh1PMaterials; // 0x568
	int32_t TelescopeMaterialIndex; // 0x578
	FName TelescopeMaterialParamName; // 0x57c
	UMaterialInstanceDynamic* TelescopeMaterialInstance; // 0x588
	FName MuzzleAttachPoint; // 0x590
	FVector MuzzleScale1P; // 0x598
	FVector MuzzleScale3P; // 0x5a4
	bool Muzzle1PAttachToGun; // 0x5b0
	UParticleSystem* MuzzleFX1P; // 0x5b8
	UParticleSystem* MuzzleFX3P; // 0x5c0
	UFOVParticleSystemComponent* MuzzlePSC1P; // 0x5c8
	UParticleSystemComponent* MuzzlePSC3P; // 0x5d0
	FName UpperRecieverAttachPoint; // 0x5d8
	FName MagazineAttachPoint; // 0x5e0
	UParticleSystem* BulletCasing; // 0x5e8
	float BulletCasingDelay; // 0x5f0
	UParticleSystem* MagazineCasing; // 0x5f8
	float MagazineCasingDelay; // 0x600
	UCameraShakeBase* FireCameraShake; // 0x608
	UForceFeedbackEffect* FireForceFeedback; // 0x610
	char bStopSegmentedReload : 1; // 0x620
	bool bIsHolstered; // 0x624
	char bPendingReload : 1; // 0x628
	uint32_t InspectCounter; // 0x62c
	char bPendingRechamber : 1; // 0x630
	char bPendingHolster : 1; // 0x638
	EWeaponState CurrentState; // 0x640
	int32_t CurrentAmmo; // 0x654
	int32_t CurrentAmmoInClip; // 0x658
	char Chambered : 1; // 0x65c
	FWeaponBurstCounter BurstCounter; // 0x660
	int32_t CancelCounter; // 0x66c
	bool b3pFireAudioLoopActive; // 0x670
	bool b1pFireAudioLoopActive; // 0x671
	FTimerHandle TimerHandle_OnEquipFinished; // 0x678
	FTimerHandle TimerHandle_OnQuickEquipFinished; // 0x680
	FTimerHandle TimerHandle_OnHolsterFinished; // 0x688
	FTimerHandle TimerHandle_StopReload; // 0x690
	FTimerHandle TimerHandle_SegmentedReload; // 0x698
	FTimerHandle TimerHandle_ReloadNextSegment; // 0x6a0
	FTimerHandle TimerHandle_ReloadWeapon; // 0x6a8
	FTimerHandle TimerHandle_RechamberWeapon; // 0x6b0
	FTimerHandle TimerHandle_EarlyRechamberWeapon; // 0x6b8
	FTimerHandle TimerHandle_HandleFiring; // 0x6c0
	FTimerHandle TimerHandle_FireRateChecker; // 0x6c8
	FTimerHandle TimerHandle_LoopingSoundSafetyCheck; // 0x6d0
	FTimerHandle TimerHandle_LoopingAnimationSafetyCheck; // 0x6d8
	FTimerHandle TimerHandle_RechamberAfterFiring; // 0x6e0
	FTimerHandle TimerHandle_ReloadAfterFiring; // 0x6e8
	FTimerHandle TimerHandle_CreateBulletCasing; // 0x6f0
	FTimerHandle TimerHandle_CreateMagazineCasing; // 0x6f8
	FTimerHandle TimerHandle_ResetRecoilPattern; // 0x700
	FTimerHandle TimerHandle_StartCancelHolster; // 0x708
	FTimerHandle TimerHandle_RestartFire; // 0x720
	float AudioMercyShotTolerance; // 0x730
	FTimerHandle TimerHandle_ForceVisHandle; // 0x750
	FTimerHandle TimerHandle_LadderEquipHandle; // 0x758
	bool CanFireAfterLadder; // 0x760
	USkeletalMeshComponent* CustomDepthMesh; // 0x768
	bool bSwapAfterHolster; // 0x770
	TArray<UMaterialInstanceDynamic*> WeaponMIDs; // 0x790
	float DematerializeTimelineLength; // 0x7a0
	FWeaponDematerializationData WeaponDematerializationData; // 0x7a4
};

struct UMapEditorSaveData {
	TArray<FMapEditorObjectSaveData> ObjectSaveData; // 0x50
};

struct UBTTask_RunEQSQuery {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> QueryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct ABP_ThrowableDeployableCover_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UBoxComponent* ScaledCollisionComponent; // 0x228
	UProjectileMovementComponent* MovementComponent; // 0x230
	UAkComponent* DefaultAkComp; // 0x238
	UStaticMeshComponent* MeshComponent; // 0x240
	UBoxComponent* CollisionComponent; // 0x248
	FMulticastInlineDelegate OnImpact; // 0x250
	UAkAudioEvent* DetonateSound; // 0x260
	FMulticastInlineDelegate OnFailed; // 0x268
	bool ImpactSoundPlayed; // 0x278
	FRotator InitialRotation; // 0x27c
};

struct UMovieSceneEventSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct UNUIReplayControls {
	float CurrentPlayRate; // 0x278
	float TimeWhenPaused; // 0x27c
};

struct UPlaneFalloff {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector Position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct AServerStatReplicator {
	bool bUpdateStatNet; // 0x220
	bool bOverwriteClientStats; // 0x221
	uint32_t Channels; // 0x224
	uint32_t InRate; // 0x228
	uint32_t OutRate; // 0x22c
	uint32_t MaxPacketOverhead; // 0x234
	uint32_t InRateClientMax; // 0x238
	uint32_t InRateClientMin; // 0x23c
	uint32_t InRateClientAvg; // 0x240
	uint32_t InPacketsClientMax; // 0x244
	uint32_t InPacketsClientMin; // 0x248
	uint32_t InPacketsClientAvg; // 0x24c
	uint32_t OutRateClientMax; // 0x250
	uint32_t OutRateClientMin; // 0x254
	uint32_t OutRateClientAvg; // 0x258
	uint32_t OutPacketsClientMax; // 0x25c
	uint32_t OutPacketsClientMin; // 0x260
	uint32_t OutPacketsClientAvg; // 0x264
	uint32_t NetNumClients; // 0x268
	uint32_t InPackets; // 0x26c
	uint32_t OutPackets; // 0x270
	uint32_t InBunches; // 0x274
	uint32_t OutBunches; // 0x278
	uint32_t OutLoss; // 0x27c
	uint32_t InLoss; // 0x280
	uint32_t VoiceBytesSent; // 0x284
	uint32_t VoiceBytesRecv; // 0x288
	uint32_t VoicePacketsSent; // 0x28c
	uint32_t VoicePacketsRecv; // 0x290
	uint32_t PercentInVoice; // 0x294
	uint32_t PercentOutVoice; // 0x298
	uint32_t NumActorChannels; // 0x29c
	uint32_t NumConsideredActors; // 0x2a0
	uint32_t PrioritizedActors; // 0x2a4
	uint32_t NumRelevantActors; // 0x2a8
	uint32_t NumRelevantDeletedActors; // 0x2ac
	uint32_t NumReplicatedActorAttempts; // 0x2b0
	uint32_t NumReplicatedActors; // 0x2b4
	uint32_t NumActors; // 0x2b8
	uint32_t NumNetActors; // 0x2bc
	uint32_t NumDormantActors; // 0x2c0
	uint32_t NumInitiallyDormantActors; // 0x2c4
	uint32_t NumNetGUIDsAckd; // 0x2c8
	uint32_t NumNetGUIDsPending; // 0x2cc
	uint32_t NumNetGUIDsUnAckd; // 0x2d0
	uint32_t ObjPathBytes; // 0x2d4
	uint32_t NetGUIDOutRate; // 0x2d8
	uint32_t NetGUIDInRate; // 0x2dc
	uint32_t NetSaturated; // 0x2e0
};

struct AOnlineBeaconClient {
	AOnlineBeaconHostObject* BeaconOwner; // 0x250
	UNetConnection* BeaconConnection; // 0x258
	EBeaconConnectionState ConnectionState; // 0x260
};

struct UAkAssetDataSwitchContainerData {
	TSoftObjectPtr<UAkGroupValue> GroupValue; // 0x28
	UAkGroupValue* DefaultGroupValue; // 0x50
	TArray<TSoftObjectPtr<UAkMediaAsset>> MediaList; // 0x58
	TArray<UAkAssetDataSwitchContainerData*> Children; // 0x68
};

struct UMaterialExpressionCeil {
	FExpressionInput Input; // 0x40
};

struct USkeletalMeshSimulationComponent {
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xb8
	AChaosSolverActor* ChaosSolverActor; // 0xc0
	UPhysicsAsset* OverridePhysicsAsset; // 0xc8
	bool bSimulating; // 0xd0
	bool bNotifyCollisions; // 0xd1
	EObjectStateTypeEnum ObjectType; // 0xd2
	float Density; // 0xd4
	float MinMass; // 0xd8
	float MaxMass; // 0xdc
	ECollisionTypeEnum CollisionType; // 0xe0
	float ImplicitShapeParticlesPerUnitArea; // 0xe4
	int32_t ImplicitShapeMinNumParticles; // 0xe8
	int32_t ImplicitShapeMaxNumParticles; // 0xec
	int32_t MinLevelSetResolution; // 0xf0
	int32_t MaxLevelSetResolution; // 0xf4
	int32_t CollisionGroup; // 0xf8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xfc
	FVector InitialLinearVelocity; // 0x100
	FVector InitialAngularVelocity; // 0x10c
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x118
};

struct UVariantObjectBinding {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct UPlayFabAdminAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x798
	UPlayFabJsonObject* RequestJsonObj; // 0x7a0
	UPlayFabJsonObject* ResponseJsonObj; // 0x7a8
};

struct UBorder {
	EHorizontalAlignment HorizontalAlignment; // 0x120
	EVerticalAlignment VerticalAlignment; // 0x121
	char bShowEffectWhenDisabled : 1; // 0x122
	FLinearColor ContentColorAndOpacity; // 0x124
	FDelegate ContentColorAndOpacityDelegate; // 0x134
	FMargin Padding; // 0x144
	FSlateBrush Background; // 0x158
	FDelegate BackgroundDelegate; // 0x1e0
	FLinearColor BrushColor; // 0x1f0
	FDelegate BrushColorDelegate; // 0x200
	FVector2D DesiredSizeScale; // 0x210
	bool bFlipForRightToLeftFlowDirection; // 0x218
	FDelegate OnMouseButtonDownEvent; // 0x21c
	FDelegate OnMouseButtonUpEvent; // 0x22c
	FDelegate OnMouseMoveEvent; // 0x23c
	FDelegate OnMouseDoubleClickEvent; // 0x24c
};

struct UMovieSceneBindingOverrides {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x28
};

struct UMovieSceneComponentMaterialTrack {
	int32_t MaterialIndex; // 0x90
};

struct UABP_KaBar_OffHand_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2f8
};

struct ACameraActor {
	EAutoReceiveInput AutoActivateForPlayer; // 0x220
	UCameraComponent* CameraComponent; // 0x228
	USceneComponent* SceneComponent; // 0x230
	char bConstrainAspectRatio : 1; // 0x240
	float AspectRatio; // 0x244
	float FOVAngle; // 0x248
	float PostProcessBlendWeight; // 0x24c
	FPostProcessSettings PostProcessSettings; // 0x250
};

struct UDistributionVectorUniformCurve {
	FInterpCurveTwoVectors ConstantCurve; // 0x38
	char bLockAxes1 : 1; // 0x50
	char bLockAxes2 : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x56
	char bUseExtremes : 1; // 0x5c
};

struct ALevelSequenceMediaController {
	ALevelSequenceActor* Sequence; // 0x228
	UMediaComponent* MediaComponent; // 0x230
	float ServerStartTimeSeconds; // 0x238
};

struct UMovieSceneCameraShakeSourceShakeSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
};

struct ULightmappedSurfaceCollection {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UABP_TrophySystem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x378
};

struct UUserDefinedImageCaptureProtocol {
	EDesiredImageFormat Format; // 0xd8
	bool bEnableCompression; // 0xd9
	int32_t CompressionQuality; // 0xdc
};

struct UNUIOneInTheChamberLivesLeft {
	int32_t LivesLeft; // 0x278
};

struct ABeacon {
	FVector2D Origin; // 0x220
	float ScaleX; // 0x228
	float ScaleY; // 0x22c
	UTexture2D* MapTexture; // 0x230
	UTexture2D* MapBackgroundTexture; // 0x238
	UTexture2D* FriendlyTexture; // 0x240
	UTexture2D* EnemyTexture; // 0x248
	UTexture2D* SpectatorTexture; // 0x250
	UStaticMesh* MapBoundsPlane; // 0x258
};

struct UMedalFlagDomination {
	ACTFGameMode* CTFGameMode; // 0x48
};

struct AShooterBot {
	UBehaviorTree* BotBehavior; // 0x2dd0
};

struct UWBP_LoadoutScreen_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* EnterEditMode; // 0x268
	UButton* BTN_Back; // 0x270
	UWBP_TimedConfirm_C* BTN_Delete; // 0x278
	UButton* BTN_Edit; // 0x280
	UButton* BTN_Equip; // 0x288
	UButton* BTN_Favourite; // 0x290
	UButton* BTN_FocusGrabber; // 0x298
	UEditableTextBox* ETB_LoadoutName; // 0x2a0
	UImage* Image_6; // 0x2a8
	UImage* Image_157; // 0x2b0
	UImage* IMG_DarkBackground; // 0x2b8
	UImage* IMG_Favourite; // 0x2c0
	UImage* IMG_Preview_Full; // 0x2c8
	UImage* IMG_Preview_Icon; // 0x2d0
	UImage* IMG_Preview_Video; // 0x2d8
	UImage* IMG_TPModelType; // 0x2e0
	UPlatformKeyImage_C* Key_Back; // 0x2e8
	UWBP_LoadoutItem_C* LoadoutItem_Fireup; // 0x2f0
	UWBP_LoadoutItem_C* LoadoutItem_Hat; // 0x2f8
	UWBP_LoadoutItem_C* LoadoutItem_Melee; // 0x300
	UWBP_LoadoutItem_C* LoadoutItem_OffensiveUtil; // 0x308
	UWBP_LoadoutItem_C* LoadoutItem_Primary; // 0x310
	UWBP_LoadoutItem_C* LoadoutItem_QuickUtil; // 0x318
	UWBP_LoadoutItem_C* LoadoutItem_SideArm; // 0x320
	UWBP_LoadoutItem_C* LoadoutItem_TacticalUtil; // 0x328
	UScrollBox* SB_LoadoutButtons; // 0x330
	UScrollBox* SB_LoadoutItemChoices; // 0x338
	UTextBlock* TB_HoveredSubtitle; // 0x340
	UTextBlock* TB_HoveredTitle; // 0x348
	UTextBlock* TB_LoadoutItemType; // 0x350
	UTextBlock* TB_Preview_Subtitle; // 0x358
	UTextBlock* TB_Preview_Title; // 0x360
	UTextBlock* TB_Preview_Tooltip; // 0x368
	UUniformGridPanel* UGP_LoadoutItemChoices; // 0x370
	UVerticalBox* VB_LoadoutDetails; // 0x378
	UWidgetSwitcher* WS_PreviewType; // 0x380
	TArray<FLoadoutData> PLAYERLOADOUTS; // 0x388
	UWBP_CustomLoadoutContainer_C* LastContainer; // 0x398
	TArray<FLoadoutData> LoadoutsToInitFrom; // 0x3a0
	bool EditScreen; // 0x3b0
	FLoadoutData SelectedLoadout; // 0x3b8
	FLoadoutData HoveredLoadout; // 0x500
	UWBP_LoadoutItem_C* LoadoutItemSelected; // 0x648
	ELoadoutItem SelectedLoadoutType; // 0x650
	UWBP_LoadoutItem_C* LoadoutItemOptionSelected; // 0x658
	bool InGame; // 0x660
	UWBP_CustomLoadoutButton_C* Selected Loadout Button; // 0x668
	int32_t NameMaxCharacters; // 0x670
	UMediaPlayer* MediaPlayer; // 0x678
};

struct UMasterAudioSubmixCaptureProtocol {
	FString Filename; // 0x58
};

struct UNUIObjectiveScores {
	FText AllyNameText; // 0x278
	FText EnemyNameText; // 0x290
	FText AllyScoreText; // 0x2a8
	FText EnemyScoreText; // 0x2c0
	int32_t AllyScore; // 0x2d8
	int32_t EnemyScore; // 0x2dc
	float AllyProgress; // 0x2e0
	float EnemyProgress; // 0x2e4
	FVector2D MinimapMargin; // 0x2e8
	float MinimapSize; // 0x2f0
};

struct UUserDefinedCaptureProtocol {
	UWorld* World; // 0x58
};

struct UAkPS4InitializationSettings {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x88
	FAkPS4AdvancedInitializationSettings AdvancedSettings; // 0xb0
};

struct UModelComponent {
	UBodySetup* ModelBodySetup; // 0x458
};

struct UAudioSettings {
	FSoftObjectPath DefaultSoundClassName; // 0x38
	FSoftObjectPath DefaultMediaSoundClassName; // 0x50
	FSoftObjectPath DefaultSoundConcurrencyName; // 0x68
	FSoftObjectPath DefaultBaseSoundMix; // 0x80
	FSoftObjectPath VoiPSoundClass; // 0x98
	FSoftObjectPath MasterSubmix; // 0xb0
	FSoftObjectPath ReverbSubmix; // 0xc8
	FSoftObjectPath EQSubmix; // 0xe0
	EVoiceSampleRate VoiPSampleRate; // 0xf8
	float DefaultReverbSendLevel; // 0xfc
	int32_t MaximumConcurrentStreams; // 0x100
	float GlobalMinPitchScale; // 0x104
	float GlobalMaxPitchScale; // 0x108
	TArray<FAudioQualitySettings> QualityLevels; // 0x110
	char bAllowPlayWhenSilent : 1; // 0x120
	char bDisableMasterEQ : 1; // 0x120
	char bAllowCenterChannel3DPanning : 1; // 0x120
	uint32_t NumStoppingSources; // 0x124
	EPanningMethod PanningMethod; // 0x128
	EMonoChannelUpmixMethod MonoChannelUpmixMethod; // 0x129
	FString DialogueFilenameFormat; // 0x130
};

struct UMedalOneManArmy {
	ATDMGameMode* TDMGameMode; // 0x48
	TArray<FOneManArmyTracker> Trackers; // 0x50
};

struct UWBP_ChatEntry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Author_Text; // 0x268
	UTextBlock* Channel+Message_Text; // 0x270
	FText Author; // 0x278
	FText Channel; // 0x290
	FText Message; // 0x2a8
};

struct UPlatformEventsComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct APlaceableTrophySystem {
	bool bShouldDematerialize; // 0x220
	UTimelineComponent* DematerializeTimeline; // 0x228
	TArray<UMaterialInstanceDynamic*> TrophyMIDs; // 0x230
	UMeshComponent* DematerializationMesh; // 0x240
	float DematerializeTimelineLength; // 0x248
	UCurveFloat* DematerializeTimelineCurve; // 0x250
	FPlaceableTrophySystemDematerializationData PlaceableTrophySystemDematerializationData; // 0x258
};

struct UParticleModuleSizeMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x30
	char MultiplyX : 1; // 0x78
	char MultiplyY : 1; // 0x78
	char MultiplyZ : 1; // 0x78
};

struct UBaseBrushTool {
	UBrushBaseProperties* BrushProperties; // 0xc0
	bool bInBrushStroke; // 0xc8
	float WorldToLocalScale; // 0xcc
	FBrushStampData LastBrushStamp; // 0xd0
	TSoftClassPtr<UObject> PropertyClass; // 0x190
	UBrushStampIndicator* BrushStampIndicator; // 0x1b8
};

struct UTextureLightProfile {
	float Brightness; // 0x100
	float TextureMultiplier; // 0x104
};

struct UKantanPointStyle {
	UTexture2D* DataPointTexture; // 0x30
	FIntPoint PointSizeTextureOffsets[0x3]; // 0x38
};

struct UNUIPlayerAvatar {
	bool bAvatarAvailable; // 0x278
	UTexture2D* Texture; // 0x280
	ABattalionPlayerState* Player; // 0x288
};

struct UInterpTrackInstAnimControl {
	float LastUpdatePosition; // 0x28
};

struct UVehicleWheel {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UVRNotificationsComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb0
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc0
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd0
	FMulticastInlineDelegate HMDLostDelegate; // 0xe0
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf0
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x100
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x110
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x120
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x130
};

struct UPlanePositionGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoVec2ParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bFlipX; // 0x89
	bool bFlipY; // 0x8a
	bool bInInteraction; // 0x8b
	FVector InteractionOrigin; // 0x8c
	FVector InteractionNormal; // 0x98
	FVector InteractionAxisX; // 0xa4
	FVector InteractionAxisY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	FVector2D InteractionStartParameter; // 0xd4
	FVector2D InteractionCurParameter; // 0xdc
	FVector2D ParameterSigns; // 0xe4
};

struct UABP_MP5_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x388
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x470
	FAnimNode_Slot AnimGraphNode_Slot; // 0x4f0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x538
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x640
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x660
};

struct ASkyLight {
	USkyLightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct UMaterialExpressionMaterialFunctionCall {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UDynamicEntryBox {
	UUserWidget* EntryWidgetClass; // 0x1d8
};

struct UWBP_Vault_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Glitch; // 0x268
	UWidgetAnimation* Intro; // 0x270
	UTextBlock* descriptiontext; // 0x278
	UTextBlock* descriptiontextBLUE; // 0x280
	UTextBlock* descriptiontextRED; // 0x288
	UInvalidationBox* InvalidationBox_WholeWidget; // 0x290
	UPlatformKeyImage_C* PlatformKeyImage; // 0x298
	UPlatformKeyImage_C* PlatformKeyImage_2; // 0x2a0
	UPlatformKeyImage_C* PlatformKeyImage_3; // 0x2a8
	bool bCanVault; // 0x2b0
	bool bGamepadUIShowing; // 0x2b1
	UHUDTextDataAsset* HUDText Colour; // 0x2b8
	UHUDTextDataAsset* HUDColour; // 0x2c0
};

struct UPlayFabEventsAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa8
	UPlayFabJsonObject* RequestJsonObj; // 0xb0
	UPlayFabJsonObject* ResponseJsonObj; // 0xb8
};

struct UARQRCodeComponent {
	FARQRCodeUpdatePayload ReplicatedPayload; // 0x280
};

struct UBlueprintGeneratedClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct UWBP_GameOverScreen_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UTextBlock* TextBlock; // 0x2a8
	UTextBlock* TextBlock_2; // 0x2b0
};

struct UNiagaraDataInterfaceCurlNoise {
	uint32_t Seed; // 0x38
};

struct ABP_BlinkFireUp_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
	float MaxDistance; // 0x3d0
	float SnapDistance; // 0x3d4
	FVector DesiredLocation; // 0x3d8
	int32_t BackStepAmount; // 0x3e4
	float MinValidDistance; // 0x3e8
};

struct UAnimNotifyState_TimedNiagaraEffect {
	UNiagaraSystem* Template; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UMaterialExpressionArcsine {
	FExpressionInput Input; // 0x40
};

struct UPlaneReflectionCaptureComponent {
	float InfluenceRadiusScale; // 0x270
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UBTDecorator_CompareBBEntries {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct ALODActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<UMaterialInterface*, UInstancedStaticMeshComponent*> ImpostersStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct UDatasmithFBXSceneImportData {
	bool bGenerateLightmapUVs; // 0x28
	FString TexturesDir; // 0x30
	char IntermediateSerialization; // 0x40
	bool bColorizeMaterials; // 0x41
};

struct UParticleModuleVelocityOverLifetime {
	FRawDistributionVector VelOverLife; // 0x38
	char Absolute : 1; // 0x80
};

struct UJoinSessionCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UGuardiansMapAsset {
	TSoftObjectPtr<UWorld> Map; // 0x40
	FText DisplayName; // 0x68
	TSoftObjectPtr<UTexture2D> Splash; // 0x80
};

struct UMedalHQDestroyed {
	AHQGameMode* HQGameMode; // 0x48
};

struct UTexture2DArray {
	TextureAddress AddressX; // 0x130
	TextureAddress AddressY; // 0x131
	TextureAddress AddressZ; // 0x132
};

struct UMedalRainingLimbs {
	AInfectionGameMode* INFGameMode; // 0x48
};

struct UMovieScenePrimitiveMaterialTrack {
	int32_t MaterialIndex; // 0xb0
};

struct UAkSettingsPerUser {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x28
	FFilePath WwiseMacInstallationPath; // 0x38
	FString WaapiIPAddress; // 0x48
	uint32_t WaapiPort; // 0x58
	bool AutoSyncSelection; // 0x5c
	bool SuppressWwiseProjectPathWarnings; // 0x5d
	bool SoundDataGenerationSkipLanguage; // 0x5e
};

struct UMaterialExpressionBreakMaterialAttributes {
	FMaterialAttributesInput MaterialAttributes; // 0x40
};

struct UParticleModuleBeamTarget {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x88
	char bLockTarget : 1; // 0x88
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x8c
	FRawDistributionVector TargetTangent; // 0x90
	char bLockTargetTangent : 1; // 0xd8
	FRawDistributionFloat TargetStrength; // 0xe0
	char bLockTargetStength : 1; // 0x110
	float LockRadius; // 0x114
};

struct APartyBeaconHost {
	UPartyBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct UWBP_Announcement_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* HideAnimation; // 0x268
	UWidgetAnimation* ShowAnimation; // 0x270
	UTextBlock* AnnouncementText; // 0x278
	UCanvasPanel* CanvasPanel_1; // 0x280
	UInvalidationBox* InvalidationBox_WholeWidget; // 0x288
	UHUDTextDataAsset* HUDColour; // 0x290
};

struct UAchievementWriteCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UArchVisCharMovementComponent {
	FRotator RotationalAcceleration; // 0xb00
	FRotator RotationalDeceleration; // 0xb0c
	FRotator MaxRotationalVelocity; // 0xb18
	float MinPitch; // 0xb24
	float MaxPitch; // 0xb28
	float WalkingFriction; // 0xb2c
	float WalkingSpeed; // 0xb30
	float WalkingAcceleration; // 0xb34
};

struct UMedalFastDenial {
	ACTFGameMode* CTFGameMode; // 0x48
};

struct UMeshComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x440
	char bEnableMaterialParameterCaching : 1; // 0x460
};

struct UARTrackedPose {
	FARPose3D TrackedPose; // 0xf8
};

struct UTimelineTemplate {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	FName VariableName; // 0x90
	FName DirectionPropertyName; // 0x98
	FName UpdateFunctionName; // 0xa0
	FName FinishedFunctionName; // 0xa8
};

struct UPanelSlot {
	UPanelWidget* Parent; // 0x28
	UWidget* Content; // 0x30
};

struct ACargoPlayerState {
	float ObjectiveTime; // 0x908
	float CurrentContestingTimer; // 0x90c
};

struct UParticleModuleLocationWorldOffset_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UInterpCurveEdSetup {
	TArray<FCurveEdTab> Tabs; // 0x28
	int32_t ActiveTab; // 0x38
};

struct UMaterialExpressionFontSample {
	UFont* Font; // 0x40
	int32_t FontTexturePage; // 0x48
};

struct USoundfieldEffectBase {
	USoundfieldEffectSettingsBase* Settings; // 0x28
};

struct UNUIBuyScreen {
	bool WeaponBought; // 0x278
	bool RequestedFromPauseMenu; // 0x279
	FText TimerText; // 0x280
	FText CurrentAssaultText; // 0x298
	FText CurrentSpecOpsText; // 0x2b0
	FText CurrentSniperText; // 0x2c8
	int32_t MaxAssaultLoadouts; // 0x2e0
	int32_t MaxSpecOpsLoadouts; // 0x2e4
	int32_t MaxSniperLoadouts; // 0x2e8
	int32_t CurrentAssault; // 0x2ec
	int32_t CurrentSpecOps; // 0x2f0
	int32_t CurrentSnipers; // 0x2f4
};

struct UDatasmithVREDSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct UQuitMatchCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UScrollBar {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct USynth2DSlider {
	float ValueX; // 0x108
	float ValueY; // 0x10c
	FDelegate ValueXDelegate; // 0x110
	FDelegate ValueYDelegate; // 0x120
	FSynth2DSliderStyle WidgetStyle; // 0x130
	FLinearColor SliderHandleColor; // 0x3e8
	bool IndentHandle; // 0x3f8
	bool Locked; // 0x3f9
	float StepSize; // 0x3fc
	bool IsFocusable; // 0x400
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x408
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x418
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x428
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x438
	FMulticastInlineDelegate OnValueChangedX; // 0x448
	FMulticastInlineDelegate OnValueChangedY; // 0x458
};

struct ULandscapeHeightfieldCollisionComponent {
	TArray<ULandscapeLayerInfoObject*> ComponentLayerInfos; // 0x440
	int32_t SectionBaseX; // 0x450
	int32_t SectionBaseY; // 0x454
	int32_t CollisionSizeQuads; // 0x458
	float CollisionScale; // 0x45c
	int32_t SimpleCollisionSizeQuads; // 0x460
	TArray<char> CollisionQuadFlags; // 0x468
	FGuid HeightfieldGuid; // 0x478
	FBox CachedLocalBox; // 0x488
	LazyObjectProperty RenderComponent; // 0x4a4
	TArray<UPhysicalMaterial*> CookedPhysicalMaterials; // 0x4d0
};

struct UAB_Tactical_Flashbang_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot; // 0x388
};

struct UScrollBox {
	FScrollBoxStyle WidgetStyle; // 0x120
	FScrollBarStyle WidgetBarStyle; // 0x348
	USlateWidgetStyleAsset* Style; // 0x818
	USlateWidgetStyleAsset* BarStyle; // 0x820
	EOrientation Orientation; // 0x828
	ESlateVisibility ScrollBarVisibility; // 0x829
	EConsumeMouseWheel ConsumeMouseWheel; // 0x82a
	FVector2D ScrollbarThickness; // 0x82c
	FMargin ScrollbarPadding; // 0x834
	bool AlwaysShowScrollbar; // 0x844
	bool AlwaysShowScrollbarTrack; // 0x845
	bool AllowOverscroll; // 0x846
	bool bAnimateWheelScrolling; // 0x847
	EDescendantScrollDestination NavigationDestination; // 0x848
	float NavigationScrollPadding; // 0x84c
	EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x850
	bool bAllowRightClickDragScrolling; // 0x851
	float WheelScrollMultiplier; // 0x854
	FMulticastInlineDelegate OnUserScrolled; // 0x858
};

struct UAB_WW2SMG_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x388
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3d0
	FAnimNode_Slot AnimGraphNode_Slot; // 0x470
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4b8
};

struct UAwardManager {
	FMulticastInlineDelegate OnAwardRegisteredDelegate; // 0x28
	FMulticastInlineDelegate OnScalingAwardStartDelegate; // 0x38
	FMulticastInlineDelegate OnScalingAwardEndDelegate; // 0x48
	FMulticastInlineDelegate OnScalingAwardValueDelegate; // 0x58
	FMulticastInlineDelegate OnAnyKillDelegate; // 0x68
	FMulticastInlineDelegate OnResetDelegate; // 0x78
	UOnFireAwardsDataAsset* OnFireAwardsDataAsset; // 0x88
};

struct UTextureRenderTarget2DArray {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t Slices; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct UMaterialExpressionQualitySwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct APerfTestLocation {
	FString LocationName; // 0x250
};

struct UWBP_CargoHUD_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UWidgetAnimation* FlashBang; // 0x270
	UWidgetAnimation* Kill+15-And-Beyond; // 0x278
	UWidgetAnimation* Kill+10; // 0x280
	UWidgetAnimation* Kill+5; // 0x288
	UWidgetAnimation* DamageTaken; // 0x290
	UVerticalBox* BlockedMessagesVerticalBox; // 0x298
	USizeBox* ClientFPS; // 0x2a0
	UCanvasPanel* FlashBangableWidgets; // 0x2a8
	USizeBox* FrameTime; // 0x2b0
	USizeBox* GameLatency; // 0x2b8
	USizeBox* GameThreadTime; // 0x2c0
	USizeBox* GameToRenderLatency; // 0x2c8
	USizeBox* GPUTemp; // 0x2d0
	USizeBox* IdleTime; // 0x2d8
	UWidgetSwitcher* OverviewSwitcher; // 0x2e0
	URetainerBox* RB_CurvedHud; // 0x2e8
	USizeBox* RenderLatency; // 0x2f0
	USizeBox* RenderThreadTime; // 0x2f8
	USizeBox* RHIThreadTime; // 0x300
	UWBP_ActionPrompt_C* WBP_ActionPrompt; // 0x308
	UWBP_Announcement_C* WBP_Announcement; // 0x310
	UWBP_BasicScoreAward_C* WBP_BasicScoreAward; // 0x318
	UWBP_BombInfo_C* WBP_BombInfo; // 0x320
	UWBP_CargoGameoverviewWidget_C* WBP_CargoGameoverviewWidget_C_1; // 0x328
	UWBP_CargoObjectiveProgress_C* WBP_CargoObjectiveProgress; // 0x330
	UWBP_CargoResultScreen_C* WBP_CargoResultScreen; // 0x338
	UWBP_ChatFeed_C* WBP_ChatFeed; // 0x340
	UWBP_ClassChanged_C* WBP_ClassChanged; // 0x348
	UWBP_Crosshair_C* WBP_Crosshair; // 0x350
	UWBP_DamageTakenIndicator_C* WBP_DamageTakenIndicator; // 0x358
	UWBP_FireUpProgress_C* WBP_FireUpProgress; // 0x360
	UWBP_GameOverScreen_C* WBP_GameOverScreen; // 0x368
	UWBP_GrenadeIndicator_C* WBP_GrenadeIndicator; // 0x370
	UWBP_Hitmarker_C* WBP_Hitmarker; // 0x378
	UWBP_HUDEquipment_C* WBP_HUDEquipment_C_170; // 0x380
	UWBP_InGameLoadoutSelection_C* WBP_InGameLoadoutSelection_304; // 0x388
	UWBP_Interaction_C* WBP_Interaction; // 0x390
	UWBP_Killfeed_C* WBP_Killfeed; // 0x398
	UWBP_KillSuccess_C* WBP_KillSuccess; // 0x3a0
	UWBP_Message_C* WBP_Message; // 0x3a8
	UWBP_MiniMap_C* WBP_MiniMap; // 0x3b0
	UWBP_Overtime_Shootout_Title_C* WBP_Overtime_Shootout_Title; // 0x3b8
	UWBP_Overtime_Shootout_Transition_C* WBP_Overtime_Shootout_Transition; // 0x3c0
	UWBP_Overtime_Shootout_Victory_C* WBP_Overtime_Shootout_Victory; // 0x3c8
	UWBP_Overtime_Title_C* WBP_Overtime_Title; // 0x3d0
	UWBP_PingSelection_C* WBP_PingSelection; // 0x3d8
	UWBP_PlantProgressBar_C* WBP_PlantProgressBar; // 0x3e0
	UWBP_RespawnTimer_C* WBP_RespawnTimer; // 0x3e8
	UWBP_ShootoutOverview_C* WBP_ShootoutOverview; // 0x3f0
	UWBP_SNDLeaderboard_C* WBP_SNDLeaderboard; // 0x3f8
	UWBP_SniperVignette_C* WBP_SniperVignette; // 0x400
	UWBP_Spectating_C* WBP_Spectating; // 0x408
	UWBP_StaminaAndHealthBars_C* WBP_StaminaAndHealthBars; // 0x410
	UWBP_StrafeJumpSpeedFeedback_C* WBP_StrafeJumpSpeedFeedback; // 0x418
	UWBP_SwappingSides_C* WBP_SwappingSides; // 0x420
	UWBP_TugOfWarOverview_C* WBP_TugOfWarOverview; // 0x428
	UWBP_Vault_C* WBP_Vault; // 0x430
	UWBP_WeaponPickup_C* WBP_WeaponPickup; // 0x438
	ESlateVisibility In Visibility; // 0x440
	FMulticastInlineDelegate OnShowUpdateLeaderboard; // 0x448
	bool IsPlayingHealth; // 0x458
	FMulticastInlineDelegate OnShowUpdateGameOverScreen; // 0x460
	TArray<UWBP_GenericBlockedMessage_C*> CurrentBlockedMessages; // 0x470
	bool bBlockedUIFound; // 0x480
	float RemainingStamina; // 0x484
	float StaminaRegenMultiplier; // 0x488
	int32_t StaminaDirection; // 0x48c
	FStaminaEvent StaminaEvent; // 0x490
	float FlashRemainingDuration; // 0x4a4
};

struct UNuclearOnlineSystem {
	FMulticastInlineDelegate OnJoinSession; // 0x30
	FMulticastInlineDelegate OnPlayerJoinedLobby; // 0x40
	FMulticastInlineDelegate OnPlayerLeftLobby; // 0x50
	AOnlineBeaconHost* LobbyListener; // 0x190
	ANuclearLobbyHost* LobbyHost; // 0x198
	ANuclearLobbyClient* LobbyClient; // 0x1a0
};

struct UAsyncActionLoadPrimaryAssetClass {
	FMulticastInlineDelegate Completed; // 0x78
};

struct AMaterialInstanceActor {
	TArray<AActor*> TargetActors; // 0x220
};

struct USoundNodeWavePlayer {
	TSoftObjectPtr<USoundWave> SoundWaveAssetPtr; // 0x48
	USoundWave* SoundWave; // 0x70
	char bLooping : 1; // 0x80
};

struct UActorSequence {
	UMovieScene* MovieScene; // 0x60
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x68
};

struct UInterpTrack {
	TArray<UInterpTrack*> SubTracks; // 0x38
	UInterpTrackInst* TrackInstClass; // 0x48
	ETrackActiveCondition ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	char bOnePerGroup : 1; // 0x68
	char bDirGroupOnly : 1; // 0x68
	char bDisableTrack : 1; // 0x68
	char bIsSelected : 1; // 0x68
	char bIsAnimControlTrack : 1; // 0x68
	char bSubTrackOnly : 1; // 0x68
	char bVisible : 1; // 0x68
	char bIsRecording : 1; // 0x68
};

struct ULightmassPrimitiveSettingsObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x28
};

struct UGizmoAxisTranslationParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Parameter; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurTranslationAxis; // 0xbc
	FVector CurTranslationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct UInterpTrackInstAkAudioEvent {
	float LastUpdatePosition; // 0x28
};

struct UAISense_Blueprint {
	UUserDefinedStruct* ListenerDataType; // 0x80
	TArray<UAIPerceptionComponent*> ListenerContainer; // 0x88
	TArray<UAISenseEvent*> UnprocessedEvents; // 0x98
};

struct ADatasmithImportedSequencesActor {
	TArray<ULevelSequence*> ImportedSequences; // 0x220
};

struct UDistributionFloatUniformCurve {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct UInputAxisKeyDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x28
};

struct ULandscapeSplinesComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x440
	TArray<ULandscapeSplineSegment*> Segments; // 0x450
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x460
};

struct UJumper_MainMenu_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* Selcetion-menu-intro; // 0x2f8
	UBack-Legend-button-Promod_C* Back-Legend-button-Promod; // 0x300
	UJumper-MM-Button_C* Jumper-MM-Button; // 0x308
	UJumper_LevelSelect_C* Jumper_LevelSelect; // 0x310
	UCanvasPanel* LevelSelectPanel; // 0x318
	UWidgetSwitcher* MenuWidgetSwitcher; // 0x320
	USandbox-MM-Button_C* Sandbox-MM-Button; // 0x328
	UTutorial-MM-Button_C* Tutorial-MM-Button; // 0x330
	UJumper_LevelSelect_C* TutorialLevelSelect; // 0x338
	UCanvasPanel* TutorialMenu; // 0x340
	UMainMenu_C* MainMenuReference; // 0x348
	bool IsLevelPicker; // 0x350
	TArray<UWidget*> MainMenuWidgetsToDisable; // 0x358
};

struct AMapFog {
	FMulticastInlineDelegate OnMapFogMaterialChanged; // 0x238
	int32_t FogRenderTargetSize; // 0x248
	UMaterialInterface* FogMaterial_UMG; // 0x250
	UMaterialInterface* FogMaterial_Canvas; // 0x258
	float MinimapOpacityHidden; // 0x260
	float MinimapOpacityExplored; // 0x264
	float MinimapOpacityRevealing; // 0x268
	UMaterialInterface* FogCombineMaterial; // 0x270
	float FogCacheLifetime; // 0x278
	bool bEnableWorldFog; // 0x27c
	UMaterialInterface* FogPostProcessMaterial; // 0x280
	float WorldOpacityHidden; // 0x288
	float WorldOpacityExplored; // 0x28c
	float WorldOpacityRevealing; // 0x290
	APostProcessVolume* PostProcessVolume; // 0x298
	EFogPostProcessVolumeOption AutoLocatePostProcessVolume; // 0x2a0
	UTextureRenderTarget2D* PermanentRevealRT_A; // 0x2a8
	UTextureRenderTarget2D* PermanentRevealRT_B; // 0x2b0
	UTextureRenderTarget2D* RevealRT_Staging; // 0x2b8
	TMap<UMapRendererComponent*, UMaterialInstanceDynamic*> MaterialInstances; // 0x2c8
	UMaterialInstanceDynamic* FogCombineMatInst; // 0x318
	UMaterialInstanceDynamic* FogPostProcessMatInst; // 0x320
	TArray<UMapRevealerComponent*> MapRevealers; // 0x358
};

struct UWBP_BlitzPlayerAliveIcon_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Background; // 0x268
	UImage* bombicon; // 0x270
	UImage* Border; // 0x278
	UImage* DeadIcon; // 0x280
	UImage* Highlight; // 0x288
	UImage* IMG_FireupIcon; // 0x290
	UImage* PlayerIcon; // 0x298
	APromodPlayerState* BoundPlayer; // 0x2a0
	UHUDTextDataAsset* HUDColour; // 0x2a8
};

struct APartyBeaconClient {
	FString DestSessionId; // 0x2e0
	FPartyReservation PendingReservation; // 0x2f0
	EClientRequestType RequestType; // 0x340
	bool bPendingReservationSent; // 0x341
	bool bCancelReservation; // 0x342
};

struct UMovieSceneEntitySystem {
	UMovieSceneEntitySystemLinker* Linker; // 0x28
};

struct AHeadquarters_Zone {
	float ZoneRadius; // 0x220
	UStaticMeshComponent* ZoneMesh; // 0x228
	UBoxComponent* CollisionComp; // 0x230
	int32_t CurrentTeamAllegiance; // 0x238
	ENationType CurrentNationAllegiance; // 0x23c
	UParticleSystem* DetonateEffect; // 0x240
	FString ImageID; // 0x260
	float CaptureProgress; // 0x270
	bool IsBeingCaptured; // 0x274
	bool ShouldTick; // 0x275
	float TimeCaptured; // 0x278
	int32_t CapturingTeam; // 0x27c
	ENationType CapturingNation; // 0x280
	float ReturnCaptureCoolDown; // 0x284
	int32_t NumPlayersCapping; // 0x288
	bool IsContested; // 0x28c
	TArray<AHeadquartersPlayerController*> PlayersInZone; // 0x290
	TArray<AHeadquartersPlayerState*> PlayerStatesInZone; // 0x2a0
	UWorldMarkerComponent* DefaultWorldMarker; // 0x2b0
	FHQMode_ZoneProperties ZoneProperties; // 0x2b8
	float CaptureTime; // 0x2c8
	float CooldownTime; // 0x2cc
	UTexture2D* AIcon; // 0x2d0
	UTexture2D* BIcon; // 0x2d8
	UTexture2D* CIcon; // 0x2e0
	float NeutraliseTime; // 0x2e8
	bool Neutral; // 0x2ec
	bool bCanBeCaptured; // 0x2ed
	bool StraightCap; // 0x2ee
	bool IsBeingNeutralised; // 0x2ef
	UAkAudioEvent* HQUnlockEvent; // 0x2f8
	UAkAudioEvent* StartHQRadioStaticEvent; // 0x300
	UAkAudioEvent* StopHQRadioStaticEvent; // 0x308
	UAkAudioEvent* HQDestroyedEvent; // 0x310
};

struct UGeometryCollectionDebugDrawComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct UMaterialExpressionWorldPosition {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x40
};

struct UWBP_Overtime_Title_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Show; // 0x268
	UImage* Mov_Title; // 0x270
	UMediaPlayer* MP_Title; // 0x278
};

struct UWBP_CustomLoadoutContainer_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UHorizontalBox* HorizontalBox_1; // 0x268
};

struct UMaterialExpressionComment {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UMaterialExpressionIf {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct UStereoLayerShapeCylinder {
	float Radius; // 0x28
	float OverlayArc; // 0x2c
	int32_t Height; // 0x30
};

struct ASpectatorBeaconHost {
	USpectatorBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct UBTDecorator_IsBBEntryOfClass {
	UObject* TestClass; // 0x90
};

struct UThirdPersonAnimInstance {
	float CurrentVaultHeight; // 0x2bc
	float CurrentVaultProgress; // 0x2c0
	bool bJustLaunchedFromPad; // 0x2c4
	bool bIsKnifeEqupped; // 0x358
	UAnimMontage* StandToCrouchMontage; // 0x360
	UAnimMontage* CrouchToProneMontage; // 0x368
	UAnimMontage* ProneToCrouchMontage; // 0x370
	UAnimMontage* CrouchToStandMontage; // 0x378
	UAnimMontage* JumpLandMontage; // 0x380
	UAnimSequence* DefaultGripPoseSequence; // 0x388
	UCurveFloat* Turn70HalfSecondCurve; // 0x390
	UAnimMontage* StandShuffle20Montage; // 0x398
	UAnimMontage* StandShuffle20MontageReverse; // 0x3a0
	UAnimMontage* CrouchTurnLeft20; // 0x3a8
	UAnimMontage* CrouchTurnRight20; // 0x3b0
	UAnimMontage* StandShuffleMontage; // 0x3b8
	UAnimMontage* StandShuffleMontageReverse; // 0x3c0
	UAnimMontage* CrouchTurnLeft70; // 0x3c8
	UAnimMontage* CrouchTurnRight70; // 0x3d0
	UAnimMontage* StandShuffle180Montage; // 0x3d8
	UAnimMontage* StandShuffle180MontageReverse; // 0x3e0
	UAnimMontage* CrouchTurnLeft180; // 0x3e8
	UAnimMontage* CrouchTurnRight180; // 0x3f0
	float FootPosition; // 0x47c
	float FootPositionDirection; // 0x480
	float Speed; // 0x484
	ACharacter* CharacterOwner; // 0x488
	APromodCharacter* ThirdPersonPawn; // 0x490
	bool InAir; // 0x498
	float Direction; // 0x49c
	float StartPosition; // 0x4a0
	float RootOffsetYaw; // 0x4a4
	int32_t Stance; // 0x4a8
	bool StanceEquals2; // 0x4ac
	UAnimSequence* AdditiveGripPose3P; // 0x4b0
	FTransform AdditiveGripTransform; // 0x4c0
	bool IsOneHanded; // 0x4f0
	float TargetingAnimTransition; // 0x4f4
	bool IsRunning; // 0x4f8
	float RunLean; // 0x4fc
	bool ShouldStandStill; // 0x500
	float InstantDirection; // 0x504
	bool IsFiring; // 0x508
	bool bDisplayDead; // 0x509
	bool OnLadder; // 0x50a
	float LadderAnimationProgress; // 0x50c
	FVector LeanTranslation; // 0x510
	FRotator LeanUpperBodyRotation; // 0x51c
	FRotator LeanLowerBodyRotation; // 0x528
	bool BlendGripPose; // 0x534
	float BlendGripPoseFlt; // 0x538
	float AdditiveInvertedGripFixApply; // 0x53c
	bool AdditiveInvertedGripFixApplyBool; // 0x540
	FVector2D AODulledInverted; // 0x544
	FVector2D AODulledInvertedClamped; // 0x54c
	float IsOneHandedFloat; // 0x554
	bool LastTimeInAirST1; // 0x558
	float CardinalLerpDirection; // 0x55c
	bool bIsBot; // 0x560
	bool bIsSliding; // 0x561
};

struct UEnvQueryGenerator_ProjectedPoints {
	FEnvTraceData ProjectionData; // 0x50
};

struct UProceduralFoliageSpawner {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct AAudioVolume {
	float Priority; // 0x258
	char bEnabled : 1; // 0x25c
	FReverbSettings Settings; // 0x260
	FInteriorSettings AmbientZoneSettings; // 0x280
	TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings; // 0x2a8
	TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings; // 0x2b8
};

struct UNavigationPath {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UTestMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct UParticleModuleLocationPrimitiveBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x68
};

struct UWBP_CargoPayloadStatus_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	USizeBox* Arrow1; // 0x268
	UCanvasPanel* CP_Arrows; // 0x270
	UImage* PayloadImage; // 0x278
	UImage* PayloadStateImage; // 0x280
	ACargoGameState* CargoGameState; // 0x288
	bool bCargoEnabled; // 0x290
	ECargoPlayerSideState PlayerSide; // 0x291
};

struct UInputRouter {
	bool bAutoInvalidateOnHover; // 0x28
	bool bAutoInvalidateOnCapture; // 0x29
	UInputBehaviorSet* ActiveInputBehaviors; // 0x38
};

struct UEnvQueryTest {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UMaterialExpressionBlendMaterialAttributes {
	FMaterialAttributesInput A; // 0x40
	FMaterialAttributesInput B; // 0x58
	FExpressionInput Alpha; // 0x70
	EMaterialAttributeBlend PixelAttributeBlendType; // 0x84
	EMaterialAttributeBlend VertexAttributeBlendType; // 0x85
};

struct UBTTask_WaitBlackboardTime {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UMaterialExpressionAtmosphericFogColor {
	FExpressionInput WorldPosition; // 0x40
};

struct UMedalHQSecured {
	AHQGameMode* HQGameMode; // 0x48
};

struct UPromodClassDataAsset {
	EClassName ClassName; // 0x30
	TArray<UPromodWeaponArchetypeDataAsset*> PrimaryWeaponClassData; // 0x38
	TArray<UPromodWeaponArchetypeDataAsset*> SidearmWeaponClassData; // 0x48
	TArray<UPromodWeaponArchetypeDataAsset*> MeleeWeaponClassData; // 0x58
	USkeletalMesh* BodyMesh3P_Friendly; // 0x68
	USkeletalMesh* BodyMesh3P_Enemy; // 0x70
	USkeletalMesh* HeadMesh3P_Friendly; // 0x78
	USkeletalMesh* HeadMesh3P_Enemy; // 0x80
	TArray<UPromodFireUpDataAsset*> FireUps; // 0x88
};

struct USkeletalMeshLODSettings {
	FPerPlatformInt MinLOD; // 0x30
	FPerPlatformBool DisableBelowMinLodStripping; // 0x34
	bool bOverrideLODStreamingSettings; // 0x35
	FPerPlatformBool bSupportLODStreaming; // 0x36
	FPerPlatformInt MaxNumStreamedLODs; // 0x38
	FPerPlatformInt MaxNumOptionalLODs; // 0x3c
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x40
};

struct UNiagaraSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UMinimapInternal_IconMouseCapture_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	FMulticastInlineDelegate OnMouseClick; // 0x268
	bool MouseDownStarted; // 0x278
	bool MouseDragStarted; // 0x279
	FVector2D MouseDownPos; // 0x27c
	float MouseDownTime; // 0x284
	float MouseMoveThreshold; // 0x288
	FGeometry MapGeo; // 0x28c
	FMulticastInlineDelegate OnBoxSelect; // 0x2c8
	UCanvasPanelSlot* ParentCanvasSlot; // 0x2d8
	bool MouseDown_IsLeft; // 0x2e0
	bool MouseDown_IsShift; // 0x2e1
	bool MouseDown_IsCtrl; // 0x2e2
	bool bEnableBoxSelect; // 0x2e3
	FLinearColor BoxSelectColor; // 0x2e4
};

struct UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct ABP_ThrowableTrophySystem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	FMulticastInlineDelegate OnImpact; // 0x2a0
};

struct ULevelStreamingDynamic {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct USoundNodeConcatenator {
	TArray<float> InputVolume; // 0x48
};

struct USceneCaptureComponentCube {
	UTextureRenderTargetCube* TextureTarget; // 0x2b0
	bool bCaptureRotation; // 0x2b8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2c0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2c8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2d0
	float IPD; // 0x2d8
};

struct UMovieSceneCameraShakeTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x80
};

struct AVolumetricCloud {
	UVolumetricCloudComponent* VolumetricCloudComponent; // 0x220
};

struct UWBP_HardpointPlayerIcons_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BlueBar; // 0x268
	UInvalidationBox* InvalidationBox_1; // 0x270
	UInvalidationBox* InvalidationBox_LeftPlayerIcons; // 0x278
	UInvalidationBox* InvalidationBox_RightPlayerIcons; // 0x280
	UHorizontalBox* LeftTeamPlayerIcons; // 0x288
	UTextBlock* LeftTeamPlayersAliveValue; // 0x290
	UImage* RedBar; // 0x298
	UHorizontalBox* RightTeamPlayerIcons; // 0x2a0
	UTextBlock* RightTeamPlayersAliveValue; // 0x2a8
	UWidgetSwitcher* TeamInfoWidgetSwitcherL; // 0x2b0
	UWidgetSwitcher* TeamInfoWidgetSwitcherR; // 0x2b8
	TArray<UWBP_PlayerAliveIcon_C*> LeftTeamWidgets; // 0x2c0
	TArray<UWBP_PlayerAliveIcon_C*> RightTeamWidgets; // 0x2d0
	int32_t MissingWidgets; // 0x2e0
	int32_t AlivePlayers_Team0; // 0x2e4
	int32_t AlivePlayers_Team1; // 0x2e8
	TArray<APlayerState*> PlayersTeam0; // 0x2f0
	TArray<APlayerState*> PlayersTeam1; // 0x300
	bool bIsShootout; // 0x310
};

struct UShadowMapTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x100
};

struct UAkCheckBox {
	ECheckBoxState CheckedState; // 0x4b8
	FDelegate CheckedStateDelegate; // 0x4bc
	FCheckBoxStyle WidgetStyle; // 0x4d0
	EHorizontalAlignment HorizontalAlignment; // 0xa50
	bool IsFocusable; // 0xa51
	FAkBoolPropertyToControl ThePropertyToControl; // 0xa58
	FAkWwiseItemToControl ItemToControl; // 0xa68
	FMulticastInlineDelegate AkOnCheckStateChanged; // 0xaa8
	FMulticastInlineDelegate OnItemDropped; // 0xab8
	FMulticastInlineDelegate OnPropertyDropped; // 0xac8
};

struct UNiagaraDataInterfaceAudioSubmix {
	USoundSubmix* Submix; // 0x38
};

struct UNiagaraPreviewAxis_InterpParamVector {
	FVector Min; // 0x38
	FVector Max; // 0x44
};

struct USkeletalMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x690
	UAnimInstance* AnimClass; // 0x698
	UAnimInstance* AnimScriptInstance; // 0x6a0
	UAnimInstance* PostProcessAnimInstance; // 0x6a8
	FSingleAnimationPlayData AnimationData; // 0x6b0
	FVector RootBoneTranslation; // 0x6d8
	FVector LineCheckBoundsScale; // 0x6e4
	TArray<UAnimInstance*> LinkedInstances; // 0x720
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x730
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x740
	float GlobalAnimRateScale; // 0x8a0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8a4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8a5
	EAnimationMode AnimationMode; // 0x8a7
	char bDisablePostProcessBlueprint : 1; // 0x8a9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8a9
	char bHasValidBodies : 1; // 0x8a9
	char bBlendPhysics : 1; // 0x8a9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8a9
	char bUpdateJointsFromAnimation : 1; // 0x8a9
	char bDisableClothSimulation : 1; // 0x8aa
	char bDisableRigidBodyAnimNode : 1; // 0x8b0
	char bAllowAnimCurveEvaluation : 1; // 0x8b0
	char bDisableAnimCurves : 1; // 0x8b0
	char bCollideWithEnvironment : 1; // 0x8b0
	char bCollideWithAttachedChildren : 1; // 0x8b1
	char bLocalSpaceSimulation : 1; // 0x8b1
	char bResetAfterTeleport : 1; // 0x8b1
	char bDeferKinematicBoneUpdate : 1; // 0x8b1
	char bNoSkeletonUpdate : 1; // 0x8b1
	char bPauseAnims : 1; // 0x8b1
	char bUseRefPoseOnInitAnim : 1; // 0x8b1
	char bEnablePerPolyCollision : 1; // 0x8b2
	char bForceRefpose : 1; // 0x8b2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8b2
	char bIsAutonomousTickPose : 1; // 0x8b2
	char bOldForceRefPose : 1; // 0x8b2
	char bShowPrePhysBones : 1; // 0x8b2
	char bRequiredBonesUpToDate : 1; // 0x8b2
	char bAnimTreeInitialised : 1; // 0x8b2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8b3
	char bEnableLineCheckWithBounds : 1; // 0x8b3
	char bUseBendingElements : 1; // 0x8b3
	char bUseTetrahedralConstraints : 1; // 0x8b3
	char bUseThinShellVolumeConstraints : 1; // 0x8b3
	char bUseSelfCollisions : 1; // 0x8b3
	char bUseContinuousCollisionDetection : 1; // 0x8b3
	char bPropagateCurvesToSlaves : 1; // 0x8b3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8b4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8b4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8b4
	uint16_t CachedAnimCurveUidVersion; // 0x8b6
	EClothMassMode MassMode; // 0x8b8
	float UniformMass; // 0x8bc
	float TotalMass; // 0x8c0
	float Density; // 0x8c4
	float MinPerParticleMass; // 0x8c8
	float ClothBlendWeight; // 0x8cc
	float EdgeStiffness; // 0x8d0
	float BendingStiffness; // 0x8d4
	float AreaStiffness; // 0x8d8
	float VolumeStiffness; // 0x8dc
	float StrainLimitingStiffness; // 0x8e0
	float ShapeTargetStiffness; // 0x8e4
	bool bWaitForParallelClothTask; // 0x8e8
	TArray<FName> DisallowedAnimCurves; // 0x8f0
	UBodySetup* BodySetup; // 0x900
	FMulticastInlineDelegate OnConstraintBroken; // 0x910
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x920
	float TeleportDistanceThreshold; // 0x9f8
	float TeleportRotationThreshold; // 0x9fc
	uint32_t LastPoseTickFrame; // 0xa08
	UClothingSimulationInteractor* ClothingInteractor; // 0xa60
	FMulticastInlineDelegate OnAnimInitialized; // 0xb30
};

struct USoundNodeSoundClass {
	USoundClass* SoundClassOverride; // 0x48
};

struct UBlueprint {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct ABattalionPlayerController_Menu {
	UAkAudioEvent* StopContinuousSoundsEvent; // 0x570
};

struct UPoseWatch {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct ULevelSequenceDirector {
	ULevelSequencePlayer* Player; // 0x28
};

struct UNUIBombMatchResultScreen {
	bool bTeamsReversed; // 0x278
	FText MatchResultTitleText; // 0x280
	FText LeftTeamRoundsWon; // 0x298
	FText RightTeamRoundsWon; // 0x2b0
	FText ModeName; // 0x2c8
	FText MapName; // 0x2e0
	FText MatchTime; // 0x2f8
	FLinearColor ResultColor; // 0x310
	FText GameEndTime; // 0x320
};

struct UPhysicsConstraintTemplate {
	FConstraintInstance DefaultInstance; // 0x28
	TArray<FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1e8
	FConstraintProfileProperties DefaultProfile; // 0x1f8
};

struct UButtonStyleAsset {
	FButtonStyle ButtonStyle; // 0x28
};

struct UDistributionFloat {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UInputAxisDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UMaterialExpressionShadingModel {
	EMaterialShadingModel ShadingModel; // 0x40
};

struct UNUIButton {
	UButton* Button; // 0x260
	UTextBlock* ButtonText; // 0x268
	UImage* ButtonBackground; // 0x270
	ENUIButtonStyle ActiveStyle; // 0x278
	FNUIButtonStyle NormalStyle; // 0x280
	FNUIButtonStyle HoveredStyle; // 0x6d0
	FNUIButtonStyle PressedStyle; // 0xb20
	bool bAllowSFX; // 0xf70
};

struct UARPointComponent {
	FARPointUpdatePayload ReplicatedPayload; // 0x278
};

struct UBTCompositeNode {
	TArray<FBTCompositeChild> Children; // 0x58
	TArray<UBTService*> Services; // 0x68
	char bApplyDecoratorScope : 1; // 0x88
};

struct UObjectLibrary {
	UObject* ObjectBaseClass; // 0x28
	bool bHasBlueprintClasses; // 0x30
	TArray<UObject*> Objects; // 0x38
	TArray<TWeakObjectPtr<UObject>> WeakObjects; // 0x48
	bool bUseWeakReferences; // 0x58
	bool bIsFullyLoaded; // 0x59
};

struct ATugOfWarMonorailPath {
	bool bTeam0IsAt0thSplinePoint; // 0x309
	float AttackersTugOfWarSpeedMultiplier; // 0x30c
	float DefaultTugOfWarMonorailSpeedMultiplier; // 0x310
	float DisableTugOfWarTime; // 0x314
	float EnableTugOfWarTime; // 0x318
	bool bIsInSuddenDeath; // 0x31c
	float SuddenDeathWinPercentage; // 0x320
};

struct UAccept_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Clicked; // 0x268
	UWidgetAnimation* Default; // 0x270
	UWidgetAnimation* Selected; // 0x278
	UWidgetAnimation* Unselected; // 0x280
	UButton* PM-BUTTON; // 0x288
	FMulticastInlineDelegate ButtonClicked; // 0x290
};

struct UPaperTileLayer {
	FText LayerName; // 0x28
	int32_t LayerWidth; // 0x40
	int32_t LayerHeight; // 0x44
	char bHiddenInGame : 1; // 0x48
	char bLayerCollides : 1; // 0x48
	char bOverrideCollisionThickness : 1; // 0x48
	char bOverrideCollisionOffset : 1; // 0x48
	float CollisionThicknessOverride; // 0x4c
	float CollisionOffsetOverride; // 0x50
	FLinearColor LayerColor; // 0x54
	int32_t AllocatedWidth; // 0x64
	int32_t AllocatedHeight; // 0x68
	TArray<FPaperTileInfo> AllocatedCells; // 0x70
	UPaperTileSet* TileSet; // 0x80
	TArray<int32_t> AllocatedGrid; // 0x88
};

struct UCapsuleComponent {
	float CapsuleHalfHeight; // 0x458
	float CapsuleRadius; // 0x45c
};

struct UUniformInteger {
	int32_t Magnitude; // 0xb0
};

struct USoundNodeSwitch {
	FName IntParameterName; // 0x48
};

struct UAudioPassByComponent {
	USphereComponent* SoundEffectColliderCollision; // 0x1f8
};

struct UMedal40BombCTF {
	ACTFGameMode* CTFGameMode; // 0x48
};

struct UVectorField {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UTextureRenderTargetVolume {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t SizeZ; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct APlayerState {
	float Score; // 0x220
	int32_t PlayerId; // 0x224
	char Ping; // 0x228
	char bShouldUpdateReplicatedPing : 1; // 0x22a
	char bIsSpectator : 1; // 0x22a
	char bOnlySpectator : 1; // 0x22a
	char bIsABot : 1; // 0x22a
	char bIsInactive : 1; // 0x22a
	char bFromPreviousLevel : 1; // 0x22a
	int32_t StartTime; // 0x22c
	ULocalMessage* EngineMessageClass; // 0x230
	FString SavedNetworkAddress; // 0x240
	FUniqueNetIdRepl UniqueID; // 0x250
	APawn* PawnPrivate; // 0x280
	FString PlayerNamePrivate; // 0x300
};

struct USoundNodeModulatorContinuous {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UNiagaraSimulationStageBase {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct UNavLinkDefinition {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UDatasmithStaticMeshComponentTemplate {
	UStaticMesh* StaticMesh; // 0x30
	TArray<UMaterialInterface*> OverrideMaterials; // 0x38
};

struct UInputBehaviorSet {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct UWBP_RadialMenuItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Selected; // 0x268
	UImage* IMG_ItemImage; // 0x270
};

struct UNiagaraDataInterfaceVolumeTexture {
	UVolumeTexture* Texture; // 0x38
};

struct UNavigationSystemConfig {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct UUserWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMulticastInlineDelegate OnVisibilityChanged; // 0x168
	FMargin Padding; // 0x190
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a0
	UUMGSequenceTickManager* AnimationTickManager; // 0x1b0
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct AHUD {
	APlayerController* PlayerOwner; // 0x220
	char bLostFocusPaused : 1; // 0x228
	char bShowHUD : 1; // 0x228
	char bShowDebugInfo : 1; // 0x228
	int32_t CurrentTargetIndex; // 0x22c
	char bShowHitBoxDebugInfo : 1; // 0x230
	char bShowOverlays : 1; // 0x230
	char bEnableDebugTextShadow : 1; // 0x230
	TArray<AActor*> PostRenderedActors; // 0x238
	TArray<FName> DebugDisplay; // 0x250
	TArray<FName> ToggledDebugCategories; // 0x260
	UCanvas* Canvas; // 0x270
	UCanvas* DebugCanvas; // 0x278
	TArray<FDebugTextInfo> DebugTextList; // 0x280
	AActor* ShowDebugTargetDesiredClass; // 0x290
	AActor* ShowDebugTargetActor; // 0x298
};

struct ABombGameState {
	TArray<ABombMode_Bomb*> Bombs; // 0x4a0
	TArray<ABombMode_Zone*> BombZones; // 0x4b0
	float PlantTime; // 0x4c0
	float QuickPlantTime; // 0x4c4
	float DefuseTime; // 0x4c8
	bool BombDetonated; // 0x4cc
	bool BombDefused; // 0x4cd
	bool DecideTeamRoundActive; // 0x4ce
	bool DecideTeamRoundComplete; // 0x4cf
	bool DecideTeamVoteInProgress; // 0x4d0
	int32_t DecideTeamRoundWinner; // 0x4d4
	FString DecideTeamVoteResult; // 0x4d8
	bool UseDecideTeamRound; // 0x4e8
	bool DecideTeamRoundIsKnifeOnly; // 0x4e9
	int32_t OvertimeCounter; // 0x4ec
	float BombInteractionProgress; // 0x4f0
	float BombInteractionTimeStamp; // 0x4f4
	ABombPlayerState* BombInteractionPlayer; // 0x4f8
	float ShootoutRoundTime; // 0x500
	float ShootoutSetupTime; // 0x504
	float ShootoutTransitionTime; // 0x508
	float ShootoutPostRoundTime; // 0x50c
	float OverviewAndShootoutTitleScreenTimes; // 0x510
	bool bBombPlanted; // 0x514
	TArray<ABombMode_BombSpawn*> BombSpawns; // 0x518
	ENationType AttackingNation; // 0x528
	int32_t AttackingTeam; // 0x52c
};

struct UMapSmokeWidget {
	ABattalionSmokeGrenade* LinkedSmoke; // 0x268
	UMaterialInstanceDynamic* CachedMaterial; // 0x270
	ABeacon* Beacon; // 0x278
	float BeaconScaleX; // 0x280
	float BeaconScaleY; // 0x284
	float Zoom; // 0x288
	UVerticalBox* MarkerVerticalBox; // 0x290
	UImage* SmokeImage; // 0x298
	UImage* SmokeImage2; // 0x2a0
	UImage* SmokeImage3; // 0x2a8
	FVector2D ScaledPlayerPos; // 0x2b0
	float RotationAngle; // 0x2b8
	UCanvasPanelSlot* CanvasPanelSlot; // 0x2c0
	UMaterialInstanceDynamic* ProgressMaterial; // 0x2c8
	bool bInActiveArray; // 0x2f4
};

struct ATUTPlayerState {
	FString PendingInventory; // 0x590
	ESlotType PendingWeaponSlot; // 0x5a0
};

struct UIpConnection {
	float SocketErrorDisconnectDelay; // 0x1b40
};

struct UGranularSynth {
	USoundWave* GranulatedSoundWave; // 0x6c0
};

struct UMaterialExpressionLightmassReplace {
	FExpressionInput Realtime; // 0x40
	FExpressionInput Lightmass; // 0x54
};

struct UWBP_CargoProgressCheckpoint_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* IMG_CheckpointProgress; // 0x268
	UImage* IMG_Colour; // 0x270
	UImage* ObjectiveImage; // 0x278
	USizeBox* SizeBox; // 0x280
	USizeBox* SizeBox_1; // 0x288
	UWidgetSwitcher* WidgetSwitcher_1; // 0x290
	ACargoCheckpoint* LinkedCheckpoint; // 0x298
	UMaterialInstanceDynamic* ProgressMaterial; // 0x2a0
	FLinearColor FillColour; // 0x2a8
};

struct UNUIMapSelectDisplay {
	FString MapName; // 0x260
};

struct UAnimInstance {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct APromodCharacter {
	UPostProcessComponent* PostProcessComponent; // 0x27b8
	UMapIconComponent* MapIconComponent; // 0x27c0
	float MapIconSize; // 0x27c8
	UTexture2D* ArrowMiniMapTexture; // 0x27d0
	UTexture2D* BombMiniMapTexture; // 0x27d8
	UTexture2D* BombMiniMapObjectiveTexture; // 0x27e0
	UWidgetComponent* SpatialMarkerComponent; // 0x27e8
	UMapViewComponent* MapViewComponent; // 0x27f0
	UTimelineComponent* VaultTimeline; // 0x27f8
	UCurveFloat* VaultTimelineCurve; // 0x2800
	UCurveVector* VaultLowWallCurve; // 0x2808
	UCurveVector* VaultHighWallCurve; // 0x2810
	float VaultLowWallMax; // 0x2818
	bool bIsVaulting; // 0x281c
	FVaultData LastVault; // 0x2820
	UWorldMarkerComponent* BombCarrierWorldMarker; // 0x2888
	bool bIsSprinting; // 0x2890
	bool bAllowGizmo; // 0x2891
	float ProneLandBobScalar; // 0x2894
	FName SpatialMarkerParentBoneName; // 0x2898
	FVector SpatialMarkerPositionalOffset; // 0x28a0
	AMapIconActor* EnemyMapIconActorClass; // 0x28b0
	AMapIconActor* EnemyMapIconActor; // 0x28b8
	FLinearColor MinimapIconSelfColour; // 0x28c0
	FLinearColor MinimapIconFriendlyColour; // 0x28d0
	TArray<FKick> ViewKicks; // 0x28e0
	TArray<FKick> ViewKickRecoveries; // 0x28f0
	FMulticastInlineDelegate OnLandedDelegate; // 0x2900
	bool bPrevIsSprinting; // 0x2910
	bool bIsProned; // 0x2911
	bool bCanSeeBomb; // 0x2912
	bool bIsSliding; // 0x2913
	bool bIsOnFire; // 0x2914
	int32_t OnFireScore; // 0x2918
	float ScalingFactor; // 0x291c
	float WallRunChromaticAberrationAmount; // 0x2920
	float WallRunVelocityThresholdForEffects; // 0x2924
	float WallRunFovIncrease; // 0x2928
	float WallRunEffectIncreaseRate; // 0x292c
	float WallRunEffectDecreaseRate; // 0x2930
	float WallRunTimeToHitMaxEffect; // 0x2934
	bool bLaunchedFromPad; // 0x293c
	USkeletalMesh* Bomb1PSkeletalMesh; // 0x2940
	USkeletalMesh* Bomb3PSkeletalMesh; // 0x2948
	UObject* Bomb1PSkeletalMeshAnimClass; // 0x2950
	UObject* Bomb3PSkeletalMeshAnimClass; // 0x2958
	FSpecialAnim PlantingAnim; // 0x2960
	FSpecialAnim QuickPlantingAnim; // 0x2980
	FSpecialAnim DefusingAnim; // 0x29a0
	UMaterialInterface* SnapShotMaterial; // 0x29c0
	UMaterialInstanceDynamic* SnapShotMaterialInstance; // 0x29c8
	APingActor* PingActorClass; // 0x29d0
	float healthRTPCToPush; // 0x29d8
	ABattalionWeapon_Instant* HandCannonWeapon; // 0x29e0
	ABattalionWeapon* HandCannonWeaponClass; // 0x29e8
	UPromodDeathCamera* DeathCameraComponent; // 0x2a50
	float InputDoubleTapTime; // 0x2a5c
	float InputHoldTime; // 0x2a60
	TArray<APingActor*> ActivePingActors; // 0x2a68
	APingActor* LastPredictedPing; // 0x2a78
	AActor* LastLookedAtInteractable; // 0x2a80
	AActor* CurrentlyLookedAtInteractable; // 0x2a88
	AActor* CurrentInteractable; // 0x2a90
	float InteractionDistance; // 0x2aa0
	UPhysicalMaterial* NoDamagePhsyMat; // 0x2aa8
	UPhysicalMaterial* SilentNoDamagePhsyMat; // 0x2ab0
	bool DebugShowStats; // 0x2ab8
	bool bDebugShowCurrentControllerType; // 0x2ab9
	bool bIsGizmoHeld; // 0x2ad5
	APromodGizmo* GizmoClass; // 0x2ad8
	APromodGizmo* GizmoPtr; // 0x2ae0
	UPromodInventoryComponent* InventoryComponent; // 0x2af0
	UAkAudioEvent* HotdropLandSound; // 0x2af8
	float FootstepSpeedThreshold; // 0x2b00
	float OldMoveVal; // 0x2b04
	UAkAudioEvent* SprintEndEvent; // 0x2b10
	UAkAudioEvent* SprintDrainEventStart; // 0x2b18
	UAkAudioEvent* SprintDrainEventStop; // 0x2b20
	UAkAudioEvent* FireUpRifleEvent; // 0x2b28
	UAkAudioEvent* FireUpSMGEvent; // 0x2b30
	UAkAudioEvent* FireUpSniperEvent; // 0x2b38
	UAkAudioEvent* FireUpHandcannonStopEvent1P; // 0x2b40
	UAkAudioEvent* NearMissSound; // 0x2b48
	UAkAudioEvent* CollateralSound; // 0x2b50
	UAkAudioEvent* KillConfirmedLvl1; // 0x2b58
	UAkAudioEvent* KillConfirmedLvl2; // 0x2b60
	UAkAudioEvent* KillConfirmedLvl3; // 0x2b68
	UAkAudioEvent* KillConfirmedLvl4; // 0x2b70
	UAkAudioEvent* KillConfirmedLvl5; // 0x2b78
	UAkAudioEvent* FireUpReadySound; // 0x2b80
	UAkAudioEvent* DamageFromBulletSound; // 0x2b88
	UAkAudioEvent* ThirdPDamageFromBulletSound; // 0x2b90
	UAkAudioEvent* DamageFromWorldCollapseSound; // 0x2b98
	UAkAudioEvent* WorldLoadingEvent; // 0x2ba0
	UAkAudioEvent* ResupplyAmmoFromCargoSound; // 0x2ba8
	UAkAudioEvent* RespawnPlayerSound; // 0x2bb0
	float SprintDrainTriggerZone; // 0x2bb8
	bool bDoingWeaponBlockingAction; // 0x2bbd
	float CurrentLeanValue; // 0x2bc0
	float SmoothMaxLeanFrac; // 0x2bc4
	float WeaponCycleDelay; // 0x2bc8
	bool bCanADSInProne; // 0x2bcd
	FVector LeanCameraOffset; // 0x2bd0
	UAkAudioEvent* SMGStartLoop; // 0x2be0
	UAkAudioEvent* SMGStopLoop; // 0x2be8
	UAkAudioEvent* ARStartLoop; // 0x2bf0
	UAkAudioEvent* ARStopLoop; // 0x2bf8
	AFireUpAction* PredictedFireUpAction; // 0x2c00
	AFireUpAction* ReplicatedFireUpAction; // 0x2c08
	AFireUpAction* PredictedQuickUtilFireUpAction; // 0x2c10
	AFireUpAction* ReplicatedQuickUtilFireUpAction; // 0x2c18
	UPromodCharacterMovementComponent* PromodCharacterMovementComponent; // 0x2c20
	bool ShouldMakeFootstepSound; // 0x2c32
	float InitialFootstepDelay; // 0x2c90
	float ForwardFootstepIntervalTimeWalk; // 0x2c94
	float ForwardFootstepIntervalTimeSprint; // 0x2c98
	bool EnableASDFootstepIntervals; // 0x2c9c
	float LeftFootstepIntervalTimeWalk; // 0x2ca0
	float BackFootstepIntervalTimeWalk; // 0x2ca4
	float GizmoAnimationTimeLength; // 0x2cac
	float GizmoPrepareTime; // 0x2cb0
	float GizmoEndPrepareTime; // 0x2cb4
	float GizmoWeaponEquipTime; // 0x2cb8
	FCharacterAnim UseGizmoAnim; // 0x2cc0
	float GizmoChromaticAberrationAmount; // 0x2cd0
	float GizmoEffectIncreaseRate; // 0x2cd4
	float GizmoEffectDecreaseRate; // 0x2cd8
	float GizmoTimeToHitMaxEffect; // 0x2cdc
	float GizmoStopEffectTime; // 0x2ce0
	float GizmoStartEffectTime; // 0x2ce4
	float Target360SpinRotation; // 0x2cf4
	float StrafeKillSpeedTarget; // 0x2d08
	float StrafeActiveTime; // 0x2d0c
	float CurrentHUDSprintValue; // 0x2d18
	FName LastHitBoneName; // 0x2d40
	FVector LastHitLocation; // 0x2d48
	AWorldVFXManager* WorldVFXManager; // 0x2d58
	UTimelineComponent* StunTimelinePtr; // 0x2d60
	UAnimMontage* StunnedMontagePtr; // 0x2d68
	UAkAudioEvent* StunStartSound; // 0x2d70
	UAkAudioEvent* StunStopSound; // 0x2d78
	bool bIsStunned; // 0x2d80
	UCurveFloat* StunCurvePtr; // 0x2d88
	UMaterialParameterCollection* StunMeterialParameterCollectionPtr; // 0x2d90
	APromodGameState* PromodGameState; // 0x2dc0
	ACargoGameState* CargoGameState; // 0x2dc8
};

struct ACameraShakeSourceActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x220
};

struct UGameUserSettings {
	bool bUseVSync; // 0x28
	bool bUseDynamicResolution; // 0x29
	uint32_t ResolutionSizeX; // 0x80
	uint32_t ResolutionSizeY; // 0x84
	uint32_t LastUserConfirmedResolutionSizeX; // 0x88
	uint32_t LastUserConfirmedResolutionSizeY; // 0x8c
	int32_t WindowPosX; // 0x90
	int32_t WindowPosY; // 0x94
	int32_t FullscreenMode; // 0x98
	int32_t LastConfirmedFullscreenMode; // 0x9c
	int32_t PreferredFullscreenMode; // 0xa0
	uint32_t Version; // 0xa4
	int32_t AudioQualityLevel; // 0xa8
	int32_t LastConfirmedAudioQualityLevel; // 0xac
	float FrameRateLimit; // 0xb0
	int32_t DesiredScreenWidth; // 0xb8
	bool bUseDesiredScreenHeight; // 0xbc
	int32_t DesiredScreenHeight; // 0xc0
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xc4
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xc8
	float LastRecommendedScreenWidth; // 0xcc
	float LastRecommendedScreenHeight; // 0xd0
	float LastCPUBenchmarkResult; // 0xd4
	float LastGPUBenchmarkResult; // 0xd8
	TArray<float> LastCPUBenchmarkSteps; // 0xe0
	TArray<float> LastGPUBenchmarkSteps; // 0xf0
	float LastGPUBenchmarkMultiplier; // 0x100
	bool bUseHDRDisplayOutput; // 0x104
	int32_t HDRDisplayOutputNits; // 0x108
	FMulticastInlineDelegate OnGameUserSettingsUINeedsUpdate; // 0x110
};

struct UParticleModuleOrbitBase {
	char bUseEmitterTime : 1; // 0x30
};

struct UHUDMaster {
	UAwardManager* AwardManager; // 0x260
};

struct UNiagaraDataInterfaceVectorCurve {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
};

struct UWBP_BasicScoreAward_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Glitch; // 0x268
	UWidgetAnimation* FadeOut; // 0x270
	UWidgetAnimation* PopIn; // 0x278
	UInvalidationBox* IB_Root; // 0x280
	UOverlay* Overlay_1; // 0x288
	UTextBlock* TextBlock_82; // 0x290
	UTextBlock* TextBlock_BLUE; // 0x298
	UTextBlock* TextBlock_RED; // 0x2a0
	int32_t CurrentScore; // 0x2a8
	float TimeToFadeOut; // 0x2ac
	float ResetScoreTime; // 0x2b0
	UHUDTextDataAsset* HUDText Colour; // 0x2b8
	FTimerHandle TimerHandle_ResetScore; // 0x2c0
	FTimerHandle TimerHandle_FadeOut; // 0x2c8
};

struct UABP_Deagle_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x388
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3d0
	FAnimNode_Slot AnimGraphNode_Slot; // 0x470
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x4b8
};

struct USoundfieldSubmix {
	FName SoundfieldEncodingFormat; // 0x40
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x48
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x60
};

struct AFFAPlayerState {
	FString PendingInventory; // 0x598
	bool FirstWeapon; // 0x5a8
};

struct UBackgroundBlurSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UNiagaraMeshRendererProperties {
	UStaticMesh* ParticleMesh; // 0x80
	ENiagaraSortMode SortMode; // 0x88
	char bOverrideMaterials : 1; // 0x8c
	char bSortOnlyWhenTranslucent : 1; // 0x8c
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0x90
	FVector2D SubImageSize; // 0xa0
	char bSubImageBlend : 1; // 0xa8
	ENiagaraMeshFacingMode FacingMode; // 0xac
	char bLockedAxisEnable : 1; // 0xb0
	FVector LockedAxis; // 0xb4
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0xc0
	FVector PivotOffset; // 0xc4
	ENiagaraMeshPivotOffsetSpace PivotOffsetSpace; // 0xd0
	char bEnableFrustumCulling : 1; // 0xd4
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x248
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x2a0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x2f8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x400
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x458
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x4b0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x508
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x560
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x5b8
};

struct UBTDecorator_TimeLimit {
	float TimeLimit; // 0x68
};

struct UNUIMatchResultScreen {
	FText MatchResultText; // 0x278
	FText ModeName; // 0x290
	FText MapName; // 0x2a8
	FText MatchTime; // 0x2c0
	FLinearColor ResultColor; // 0x2d8
	FText GameEndTime; // 0x2e8
	bool bExperienceAwarded; // 0x308
	TArray<ABattalionPlayerState*> TopPlayerStates; // 0x310
	TArray<FText> TopPlayerScoreTexts; // 0x320
	TArray<FMapModeVoteInfo> VoteOptions; // 0x330
	ABattalionGameState* GameState; // 0x340
	bool HasVoted; // 0x348
	int32_t MatchResult; // 0x34c
};

struct UABP_UNDCSidearm_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x388
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x3d0
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x470
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x4b8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x538
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x580
	FAnimNode_Slot AnimGraphNode_Slot; // 0x620
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x668
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x6e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x738
	float TargetingTransition; // 0x7d8
	bool IsTargeting; // 0x7dc
};

struct UABP_WW2Rifle_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x350
};

struct USourceEffectChorusPreset {
	FSourceEffectChorusSettings Settings; // 0x108
};

struct UMaterialExpressionArctangent2 {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct ULightMapVirtualTexture2D {
	TArray<int8_t> TypeToLayer; // 0x100
};

struct UMaterialExpressionSkyAtmosphereLightDiskLuminance {
	int32_t LightIndex; // 0x40
};

struct AFFAGameMode {
	bool EndOnMatchPointWin; // 0x838
	float WeaponSelectGracePeriod; // 0x83c
	float RoundTimeLeftUntilStopBackfill; // 0x840
	float ScorePctToStopBackfill; // 0x844
	bool AlreadyStoppedBackfill; // 0x848
	bool MatchEndHUDShown; // 0x849
	AFFAGameState* FFAGameState; // 0x850
	TArray<AActor*> UsedSpawns; // 0x858
	TArray<ABattalionPlayerControllerGMBase*> CachedPlayers; // 0x868
	AFFAPlayerController* CurrentlyWinningPC; // 0x878
	AFFAPlayerController* CurrentlySecondPlacePC; // 0x880
	FNationSound EventRivalIn2ndGaining; // 0x888
	FNationSound EventYouAreIn2ndPlace; // 0x8a8
	FNationSound EventOneMinLeft_Losing; // 0x8c8
	FNationSound EventHalfway_Victory; // 0x8e8
};

struct UNiagaraDataInterfaceFieldSystem {
	UBlueprint* BlueprintSource; // 0x38
	AActor* SourceActor; // 0x40
	FIntVector FieldDimensions; // 0x48
	FVector MinBounds; // 0x54
	FVector MaxBounds; // 0x60
};

struct UWBP_ServerBrowserItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_MapBackground; // 0x268
	UBorder* Border_ModeBackground; // 0x270
	UBorder* Border_PingBackground; // 0x278
	UBorder* Border_PlayersBackground; // 0x280
	UBorder* Border_TitleBackground; // 0x288
	UBorder* Border_TypeBackground; // 0x290
	UButton* Button; // 0x298
	UBorder* ContainerBorder; // 0x2a0
	UImage* IMG_MapBackground; // 0x2a8
	UImage* IMG_MapLeftBar; // 0x2b0
	UImage* IMG_ModeBackground; // 0x2b8
	UImage* IMG_ModeLeftBar; // 0x2c0
	UImage* IMG_PingBackground; // 0x2c8
	UImage* IMG_PingLeftBar; // 0x2d0
	UImage* IMG_PlayersBackground; // 0x2d8
	UImage* IMG_PlayersLeftBar; // 0x2e0
	UImage* IMG_SelectedArrow; // 0x2e8
	UImage* IMG_TitleBackground; // 0x2f0
	UImage* IMG_TitleLeftBar; // 0x2f8
	UImage* IMG_TypeBackground; // 0x300
	UImage* IMG_TypeLeftBar; // 0x308
	UImage* IMG_TypeLocked; // 0x310
	UImage* IMG_TypePublic; // 0x318
	UTextBlock* MapTxt; // 0x320
	UTextBlock* ModeTxt; // 0x328
	UTextBlock* PingTxt; // 0x330
	UTextBlock* PlayerCountTxt; // 0x338
	UTextBlock* ServerNameTxt; // 0x340
	UWidgetSwitcher* WS_ServerType; // 0x348
	FNuclearSessionResult Session; // 0x350
	FMulticastInlineDelegate OnSelected; // 0x518
	FLinearColor DefaultBrushColor; // 0x528
	FLinearColor DefaultContentColor; // 0x538
	FLinearColor ActiveBrushColor; // 0x548
	FLinearColor ActiveContentColor; // 0x558
	FSlateColor MatchingChangelistColor; // 0x568
	bool HasBeenHighlighted; // 0x590
	bool Is Active; // 0x591
	FString Mode; // 0x598
	UWBP_ServerBrowser_C* ServerBrowser; // 0x5a8
};

struct UDeviceProfileManager {
	TArray<UObject*> Profiles; // 0x28
};

struct UPromodTeam {
	TArray<FLiveClassData> LiveClassUsage; // 0x170
};

struct ACameraRig_Rail {
	float CurrentPositionOnRail; // 0x220
	bool bLockOrientationToRail; // 0x224
	USceneComponent* TransformComponent; // 0x228
	USplineComponent* RailSplineComponent; // 0x230
	USceneComponent* RailCameraMount; // 0x238
};

struct UCrateDataAsset {
	TArray<FCrateEntity> Crates; // 0x30
};

struct UParticleModuleCollisionGPU {
	FRawDistributionFloat Resilience; // 0x30
	FRawDistributionFloat ResilienceScaleOverLife; // 0x60
	float Friction; // 0x90
	float RandomSpread; // 0x94
	float RandomDistribution; // 0x98
	float RadiusScale; // 0x9c
	float RadiusBias; // 0xa0
	EParticleCollisionResponse response; // 0xa4
	EParticleCollisionMode CollisionMode; // 0xa5
};

struct UMedalJustKeepShootin {
	AInfectionGameMode* INFGameMode; // 0x48
};

struct UFoliageInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x668
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x678
	FGuid GenerationGuid; // 0x688
};

struct UBP_RegenCameraModifier_C {
	float FovAddition; // 0x48
	UMaterialInstanceDynamic* PostProcessMaterial; // 0x50
	float Radius; // 0x58
	float Intensity; // 0x5c
};

struct UWBP_ActionPrompt_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	UTextBlock* descriptiontext; // 0x290
	UTextBlock* Hold; // 0x298
	UInvalidationBox* IB_Root; // 0x2a0
	UPlatformKeyImage_C* PlatformKeyImage_2; // 0x2a8
	UHUDTextDataAsset* HUDColour; // 0x2b0
};

struct UMedalLastMinuteSavior {
	ATDMGameMode* TDMGameMode; // 0x48
	TArray<FLastMinuteSaviorKillTracker> KillTrackers; // 0x50
};

struct UMaterialExpressionStaticBool {
	char Value : 1; // 0x40
};

struct UInterpTrackVectorBase {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UNavRelevantComponent {
	char bAttachToOwnersRoot : 1; // 0xd4
	UObject* CachedNavParent; // 0xd8
};

struct UWBP_SNDLeaderboardItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_Avatar; // 0x268
	UBorder* Border_Defuses; // 0x270
	UBorder* Border_FireupIcon; // 0x278
	UBorder* Border_FireupProgress; // 0x280
	UBorder* Border_KDA; // 0x288
	UBorder* Border_Ping; // 0x290
	UBorder* Border_Plants; // 0x298
	UBorder* Border_PlayerName; // 0x2a0
	UBorder* Border_Score; // 0x2a8
	UImage* IMG_DeadIcon; // 0x2b0
	UImage* IMG_FireupIcon; // 0x2b8
	UImage* IMG_SelfBorder; // 0x2c0
	UImage* PlayerIcon; // 0x2c8
	UTextBlock* TB_Defuses; // 0x2d0
	UTextBlock* TB_FireupProgress; // 0x2d8
	UTextBlock* TB_KDA; // 0x2e0
	UTextBlock* TB_Ping; // 0x2e8
	UTextBlock* TB_Plants; // 0x2f0
	UTextBlock* TB_PlayerName; // 0x2f8
	UTextBlock* TB_Score; // 0x300
	UWidgetSwitcher* WS_PlayerIcon; // 0x308
	bool bIsInitialized; // 0x310
	FColor AliveColor; // 0x314
	FColor DeadColor; // 0x318
	FLeaderboardData Player Data; // 0x320
	APromodPlayerState* Player State; // 0x368
	int32_t DebugTeamNumber; // 0x370
	FLinearColor FriendlyColour; // 0x374
	FLinearColor EnemyColour; // 0x384
	FLinearColor FriendlyColourFireup; // 0x394
	FLinearColor EnemyColourFireup; // 0x3a4
};

struct UKantanCartesianChartWidgetStyle {
	FKantanCartesianChartStyle ChartStyle; // 0x30
};

struct UHUDRichTextBlock {
	FSlateFontInfo Font; // 0x678
	FLinearColor Color; // 0x6d0
};

struct USoundfieldEndpointSubmix {
	FName SoundfieldEndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	USoundfieldEndpointSettingsBase* EndpointSettings; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x58
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x60
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch {
	FGameplayTagContainer Tags; // 0x28
};

struct UAISystemBase {
	FSoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50
};

struct UParticleModuleMeshRotation {
	FRawDistributionVector StartRotation; // 0x30
	char bInheritParent : 1; // 0x78
};

struct UParticleModuleVectorFieldLocal {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UPreviewMeshCollection {
	USkeleton* Skeleton; // 0x38
	TArray<FPreviewMeshCollectionEntry> SkeletalMeshes; // 0x40
};

struct UToIntegerField {
	UFieldNodeFloat* FloatField; // 0xb0
};

struct UWBP_HardpointZoneListEntry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BackgroundLeft; // 0x268
	UImage* BackgroundRight; // 0x270
	UTextBlock* HardpointName; // 0x278
	bool bIsActive; // 0x280
};

struct UNUIVotingMenu {
	char VotesYes; // 0x278
	char VotesNo; // 0x279
	bool bVoted; // 0x27a
	bool bVotedYes; // 0x27b
};

struct UCameraModifier {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct UPhysicsConstraintComponent {
	AActor* ConstraintActor1; // 0x1f8
	FConstrainComponentPropName ComponentName1; // 0x200
	AActor* ConstraintActor2; // 0x208
	FConstrainComponentPropName ComponentName2; // 0x210
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x228
	FMulticastInlineDelegate OnConstraintBroken; // 0x230
	FConstraintInstance ConstraintInstance; // 0x240
};

struct UMedalTeamPlayer {
	AInfectionGameMode* INFGameMode; // 0x48
};

struct USMStateMachineInstance {
	bool bWaitForEndState; // 0xc0
	bool bReuseCurrentState; // 0xc1
	bool bReuseIfNotEndState; // 0xc2
};

struct ALight {
	ULightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct ABattalionIncendiaryEffect {
	bool bFireFxLoaded; // 0x220
	bool bFireFxSpawned; // 0x221
	bool bExploded; // 0x222
	TArray<FFireImpact> FireImpacts; // 0x228
	UAkAudioEvent* FireLoopSound; // 0x238
	UAkAudioEvent* FireLoopEnd; // 0x240
	UAkComponent* AkComponent; // 0x248
	float TimeSinceExplosion; // 0x250
	UParticleSystem* FireFX; // 0x258
	int32_t NumRings; // 0x260
	int32_t BaseFireLocationsPerRing; // 0x264
	float DistanceBetweenRings; // 0x268
	int32_t MaxFireDistance; // 0x26c
	float FireTraceGravity; // 0x270
	float DamageCapsuleHalfHeight; // 0x274
	float DamageCapsuleRadius; // 0x278
	float IncendiaryLength; // 0x27c
	float FireLoopEndSoundLength; // 0x280
	UDamageType* FireDamageType; // 0x288
	float DamageRate; // 0x290
	float MaxFireDamage; // 0x294
	float TimeUntilMaxDamage; // 0x298
	int32_t NumDamageRings; // 0x29c
	int32_t BaseDamageTracesPerRing; // 0x2a0
	bool bDebugIncendiaryLocations; // 0x2a4
	FTimerHandle TimerHandle_FireDamageTick; // 0x2a8
	UParticleSystemComponent* EmitterComponent; // 0x2b0
	TArray<UCapsuleComponent*> FireCapsuleComponents; // 0x2b8
	TArray<UParticleSystemComponent*> FireParticleComponents; // 0x2c8
	AController* InstigatingController; // 0x2d8
	APawn* InstigatingPawn; // 0x2e0
};

struct UAvoidanceManager {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct UPlayFabAuthenticationAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xf8
	UPlayFabJsonObject* RequestJsonObj; // 0x100
	UPlayFabJsonObject* ResponseJsonObj; // 0x108
};

struct UBTDecorator_ConeCheck {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector ConeDirection; // 0x98
	FBlackboardKeySelector Observed; // 0xc0
};

struct UTexture2D {
	int32_t LevelIndex; // 0xd8
	int32_t FirstResourceMemMip; // 0xdc
	char bTemporarilyDisableStreaming : 1; // 0xe0
	TextureAddress AddressX; // 0xe1
	TextureAddress AddressY; // 0xe2
	FIntPoint ImportedSize; // 0xe4
};

struct UBTTask_RotateToFaceBBEntry {
	float Precision; // 0x98
};

struct APlayerCameraManager {
	APlayerController* PCOwner; // 0x220
	USceneComponent* TransformComponent; // 0x228
	float DefaultFOV; // 0x238
	float DefaultOrthoWidth; // 0x240
	float DefaultAspectRatio; // 0x248
	FCameraCacheEntry CameraCache; // 0x290
	FCameraCacheEntry LastFrameCameraCache; // 0x880
	FTViewTarget ViewTarget; // 0xe70
	FTViewTarget PendingViewTarget; // 0x1470
	FCameraCacheEntry CameraCachePrivate; // 0x1aa0
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x2090
	TArray<UCameraModifier*> ModifierList; // 0x2680
	TArray<UCameraModifier*> DefaultModifiers; // 0x2690
	float FreeCamDistance; // 0x26a0
	FVector FreeCamOffset; // 0x26a4
	FVector ViewTargetOffset; // 0x26b0
	FMulticastInlineDelegate OnAudioFadeChangeEvent; // 0x26c0
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x26e0
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x26f0
	UCameraAnimInst* AnimInstPool[0x8]; // 0x26f8
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2738
	TArray<UCameraAnimInst*> ActiveAnims; // 0x2758
	TArray<UCameraAnimInst*> FreeAnims; // 0x2768
	ACameraActor* AnimCameraActor; // 0x2778
	char bIsOrthographic : 1; // 0x2780
	char bDefaultConstrainAspectRatio : 1; // 0x2780
	char bClientSimulatingViewTarget : 1; // 0x2780
	char bUseClientSideCameraUpdates : 1; // 0x2780
	char bGameCameraCutThisFrame : 1; // 0x2781
	float ViewPitchMin; // 0x2784
	float ViewPitchMax; // 0x2788
	float ViewYawMin; // 0x278c
	float ViewYawMax; // 0x2790
	float ViewRollMin; // 0x2794
	float ViewRollMax; // 0x2798
	float ServerUpdateCameraTimeout; // 0x27a0
};

struct UClothConfigNv {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	FVector LinearDrag; // 0x90
	FVector AngularDrag; // 0x9c
	FVector LinearInertiaScale; // 0xa8
	FVector AngularInertiaScale; // 0xb4
	FVector CentrifugalInertiaScale; // 0xc0
	float SolverFrequency; // 0xcc
	float StiffnessFrequency; // 0xd0
	float GravityScale; // 0xd4
	FVector GravityOverride; // 0xd8
	bool bUseGravityOverride; // 0xe4
	float TetherStiffness; // 0xe8
	float TetherLimit; // 0xec
	float CollisionThickness; // 0xf0
	float AnimDriveSpringStiffness; // 0xf4
	float AnimDriveDamperStiffness; // 0xf8
	EClothingWindMethod_Legacy WindMethod; // 0xfc
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x100
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x110
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x120
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x130
};

struct UBlendSpace1D {
	bool bScaleAnimation; // 0x148
};

struct UAkGeometryComponent {
	AkMeshType MeshType; // 0x1f8
	int32_t LOD; // 0x1fc
	float WeldingThreshold; // 0x200
	TMap<UMaterialInterface*, FAkGeometrySurfaceOverride> StaticMeshSurfaceOverride; // 0x208
	FAkGeometrySurfaceOverride CollisionMeshSurfaceOverride; // 0x258
	char bEnableDiffraction : 1; // 0x268
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x268
	AActor* AssociatedRoom; // 0x270
	FAkGeometryData GeometryData; // 0x288
};

struct UEngine {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct UParticleModuleRequired {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct AAimTrainingManager {
	UStaticMeshComponent* StartTrainingTarget; // 0x220
	UStaticMeshComponent* EndTrainingTarget; // 0x228
	UBoxComponent* TargetArea; // 0x230
	EAimTrainingMode TrainingMode; // 0x238
	AAimTrainingTarget* TargetActorClass; // 0x240
	FVector TargetBaseScale; // 0x248
	float TargetScaleScalar; // 0x254
	bool EndOnNoLives; // 0x258
	char MaxLives; // 0x259
	float TrainingStartDelay; // 0x25c
	bool EndOnTimer; // 0x260
	float TrainingTime; // 0x264
	float RegularTargetLifetime; // 0x268
	bool RegularUseConstantInterval; // 0x26c
	float RegularConstantInterval; // 0x270
	FVector2D RegularTargetIntervalRange; // 0x274
	FVector2D RegularTargetIntervalTimeRange; // 0x27c
	bool RegularUseConstantSize; // 0x284
	bool RandomiseReflexLocation; // 0x285
	bool MaxReflexTime; // 0x286
	float DoubleTargetLifetime; // 0x288
	float DoubleTimeBetweenTargets; // 0x28c
	float MovingTargetLifetime; // 0x290
	float TargetMoveSpeed; // 0x294
	bool MovingUseConstantInterval; // 0x298
	float MovingConstantInterval; // 0x29c
	FVector2D MovingTargetIntervalRange; // 0x2a0
	FVector2D MovingTargetIntervalTimeRange; // 0x2a8
	bool MovingUseConstantSize; // 0x2b0
	TArray<AAimTrainingTarget*> ActiveTargets; // 0x2b8
	char ActiveTrainingLivesLeft; // 0x2c8
};

struct UTimeDisplay_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* IMG_ComparisonIndicator; // 0x268
	UImage* IMG_PlusIcon; // 0x270
	UTextBlock* TimeDisplayText; // 0x278
	UWidgetSwitcher* WS_ComparisonType; // 0x280
	float Seconds; // 0x288
	bool ShouldColourText; // 0x28c
	bool ShouldUseTriangle; // 0x28d
};

struct UActorSequenceComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct AKillRunCourse {
	TArray<FKillRunCheckpointData> CheckpointData; // 0x2c0
	UAkAudioEvent* CollateralSound; // 0x308
	UAkAudioEvent* KillConfirmedLvl1; // 0x310
	UAkAudioEvent* KillConfirmedLvl2; // 0x318
	UAkAudioEvent* KillConfirmedLvl3; // 0x320
	UAkAudioEvent* KillConfirmedLvl4; // 0x328
	UAkAudioEvent* KillConfirmedLvl5; // 0x330
};

struct UNUILoadoutCard {
	FLoadoutCard CardData; // 0x278
};

struct UARSessionConfig {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct UWBP_CargoGameoverviewWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3e8
	UWidgetAnimation* Pulse; // 0x3f0
	UWidgetAnimation* Anim_Notification; // 0x3f8
	UTextBlock* NotReady; // 0x400
	UPlatformKeyImage_C* PlatformKeyImage; // 0x408
	UTextBlock* PlayerList; // 0x410
	UTextBlock* PressOrHoldTextBox; // 0x418
	UHorizontalBox* ReadyupBox; // 0x420
	UScaleBox* ScaleBox; // 0x428
	USpacer* Spacer_3; // 0x430
	USpacer* Spacer_291; // 0x438
	UTextBlock* TextBlock_4; // 0x440
	UTextBlock* Timer; // 0x448
	UTextBlock* ToReadyUp; // 0x450
	UVerticalBox* VerticalBox_1; // 0x458
	UVerticalBox* VerticalBox_150; // 0x460
	UTextBlock* WaitingText; // 0x468
	UWBP_CargoOverviewScore_C* WBP_CargoOverviewScore; // 0x470
	UWBP_CargoPlayerIcons_C* WBP_CargoPlayerIcons; // 0x478
	TArray<UWBP_PlayerAliveIcon_C*> LeftTeamWidgets; // 0x480
	TArray<UWBP_PlayerAliveIcon_C*> RightTeamWidgets; // 0x490
	int32_t MissingWidgets; // 0x4a0
	int32_t AlivePlayers_Team0; // 0x4a4
	int32_t AlivePlayers_Team1; // 0x4a8
	bool bIsShootout; // 0x4ac
	UHUDTextDataAsset* HUDColour; // 0x4b0
	ACargoGameState* CargoGameState; // 0x4b8
	bool bOverrideVisibility; // 0x4c0
	ECargoPlayerSideState PlayerSide; // 0x4c1
};

struct UNoiseField {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct UChildConnection {
	UNetConnection* Parent; // 0x1af0
};

struct UCreateSessionCallbackProxy {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UMaterialExpressionCrossProduct {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UNUIFFAObjectiveScores {
	ESlateVisibility RivalVisibility; // 0x2f8
};

struct UInterpTrackFloatMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct UAudioCaptureComponent {
	int32_t JitterLatencyFrames; // 0x6c0
};

struct UPawnActionsComponent {
	APawn* ControlledPawn; // 0xb0
	TArray<FPawnActionStack> ActionStacks; // 0xb8
	TArray<FPawnActionEvent> ActionEvents; // 0xc8
	UPawnAction* CurrentAction; // 0xd8
};

struct UAnimBlueprint {
	USkeleton* TargetSkeleton; // 0xa8
	TArray<FAnimGroupInfo> Groups; // 0xb0
	bool bUseMultiThreadedAnimationUpdate; // 0xc0
	bool bWarnAboutBlueprintUsage; // 0xc1
};

struct UMaterialShaderQualitySettings {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct UGridPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x250
};

struct UCircularProgressBar_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* CPB_Image; // 0x268
	USizeBox* CPB_SizeBox; // 0x270
	USizeBox* FI_SizeBox; // 0x278
	UPlatformKeyImage_C* PlatformKeyImage; // 0x280
	float Scale; // 0x288
	UMaterialInstanceDynamic* DMI; // 0x290
	float MaxValue; // 0x298
	float MinValue; // 0x29c
	float tmp; // 0x2a0
	float CurrentPercentage; // 0x2a4
	float CurrentRealValue; // 0x2a8
	FLinearColor Color And Opacity; // 0x2ac
	float LastPercentage; // 0x2bc
	float LastRealvalue; // 0x2c0
	FMulticastInlineDelegate EventProgressBarFilled; // 0x2c8
	FMulticastInlineDelegate EventProgressBarZero; // 0x2d8
	float InitialValue; // 0x2e8
	bool IsInitialValueAPercentage; // 0x2ec
	FLinearColor Tint; // 0x2f0
	FLinearColor BackgroundColor; // 0x300
};

struct UShapeComponent {
	UBodySetup* ShapeBodySetup; // 0x440
	UNavAreaBase* AreaClass; // 0x448
	FColor ShapeColor; // 0x450
	char bDrawOnlyIfSelected : 1; // 0x454
	char bShouldCollideWhenPlacing : 1; // 0x454
	char bDynamicObstacle : 1; // 0x454
};

struct UEdGraphPin_Deprecated {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	UObject* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
	UEdGraphPin_Deprecated* ParentPin; // 0x108
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
};

struct ABP_ThrowingKnife_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d0
	USphereComponent* Sphere; // 0x3d8
	bool bLanded; // 0x3e0
	float MaxRetrievalTime; // 0x3e4
	float RotationRate; // 0x3e8
};

struct UMaterialExpressionSign {
	FExpressionInput Input; // 0x40
};

struct UAkMusicSyncCallbackInfo {
	int32_t PlayingID; // 0x30
	FAkSegmentInfo SegmentInfo; // 0x34
	EAkCallbackType MusicSyncType; // 0x58
	FString UserCueName; // 0x60
};

struct USoundNodeDoppler {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UCanvasRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0x108
	TWeakObjectPtr<UWorld> World; // 0x118
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x120
};

struct UMovieSceneGeometryCollectionSection {
	FMovieSceneGeometryCollectionParams Params; // 0xe8
};

struct UParticleModuleSize_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UMovieScene3DConstraintSection {
	FGuid ConstraintId; // 0xe8
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf8
};

struct UTextPropertyTestObject {
	FText DefaultedText; // 0x28
	FText UndefaultedText; // 0x40
	FText TransientText; // 0x58
};

struct USlateVectorArtData {
	TArray<FSlateMeshVertex> VertexData; // 0x28
	TArray<uint32_t> IndexData; // 0x38
	UMaterialInterface* Material; // 0x48
	FVector2D ExtentMin; // 0x50
	FVector2D ExtentMax; // 0x58
};

struct ULevelSequenceAnimSequenceLink {
	TArray<FLevelSequenceAnimSequenceLinkItem> AnimSequenceLinks; // 0x28
};

struct UNUIGenericPopup {
	bool IsAccepted; // 0x260
};

struct UComboBoxString {
	TArray<FString> DefaultOptions; // 0x108
	FString SelectedOption; // 0x118
	FComboBoxStyle WidgetStyle; // 0x128
	FTableRowStyle ItemStyle; // 0x518
	FMargin ContentPadding; // 0xce0
	float MaxListHeight; // 0xcf0
	bool HasDownArrow; // 0xcf4
	bool EnableGamepadNavigationMode; // 0xcf5
	FSlateFontInfo Font; // 0xcf8
	FSlateColor ForegroundColor; // 0xd50
	bool bIsFocusable; // 0xd78
	FDelegate OnGenerateWidgetEvent; // 0xd7c
	FMulticastInlineDelegate OnSelectionChanged; // 0xd90
	FMulticastInlineDelegate OnOpening; // 0xda0
};

struct UTestMovieSceneTrack {
	bool bHighPassFilter; // 0x80
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct UChannel {
	UNetConnection* Connection; // 0x28
};

struct UMaterialExpressionInverseLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UNUIMapPlacement {
	bool bLeftMouseDown; // 0x278
	bool bRightMouseDown; // 0x279
	FLinearColor CurrentColour; // 0x27c
	int32_t CurrentThickness; // 0x28c
	int32_t CurrentColourNum; // 0x290
	int32_t CurrentLineIndex; // 0x294
	TArray<FLineData> Lines; // 0x298
	UImage* ExampleLineStartPointImage; // 0x2a8
	FVector2D ExampleLineStartPoint; // 0x2b0
};

struct UNUIRoundStartCountdown {
	int32_t CountdownTimer; // 0x278
	FText CountdownTimerText; // 0x280
};

struct ABP_SnapshotFireUp_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
	float FadeOut_Strength_F99265084DA38B5D1574AFA4A94F343C; // 0x3d0
	ETimelineDirection FadeOut__Direction_F99265084DA38B5D1574AFA4A94F343C; // 0x3d4
	UTimelineComponent* FadeOut; // 0x3d8
	float RadiusExpansion_Radius_4C8283D04D5C8A1BD6C3F2AB0438B159; // 0x3e0
	ETimelineDirection RadiusExpansion__Direction_4C8283D04D5C8A1BD6C3F2AB0438B159; // 0x3e4
	UTimelineComponent* RadiusExpansion; // 0x3e8
	float MaxRange; // 0x3f0
	FCharacterAnim ReleaseAnimation; // 0x3f8
	float GrenadeThrowAnimEndTime; // 0x408
	float GrenadeThrowTime; // 0x40c
	FVector ScanLocation; // 0x410
	TArray<AActor*> EnemiesInsideScanRange; // 0x420
	int32_t OwningTeamNum; // 0x430
	UAkComponent* GrenadeAkComp; // 0x438
	TArray<FString> DetectedPCsAudio; // 0x440
	ABP_SnapshotGrenade_C* Grenade; // 0x450
	AStaticMeshActor* SnapshotSphereMesh; // 0x458
	UStaticMesh* SphereStaticMesh; // 0x460
	bool ShowEnemiesToAllies ; // 0x468
	bool PlayedServerSoundDetected; // 0x469
	bool PlayedServerSoundAlert; // 0x46a
	bool bHit; // 0x46b
	bool bDartIsFiring; // 0x46c
};

struct UBoxComponent {
	FVector BoxExtent; // 0x458
	float LineThickness; // 0x464
};

struct UBack-Legend-button-Promod_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Default; // 0x268
	UWidgetAnimation* Clicked; // 0x270
	UWidgetAnimation* Unselected; // 0x278
	UWidgetAnimation* Selected; // 0x280
	UImage* Image_405; // 0x288
	UTextBlock* Text; // 0x290
	UButton* Wish-Button; // 0x298
	FMulticastInlineDelegate ButtonClicked; // 0x2a0
};

struct UAnimBoneCompressionSettings {
	TArray<UAnimBoneCompressionCodec*> Codecs; // 0x28
};

struct UMaterialExpressionNormalize {
	FExpressionInput VectorInput; // 0x40
};

struct AWartideGameState {
	TArray<FTeamLedger> TeamLedgers; // 0x530
};

struct UVirtualTextureBuilder {
	UVirtualTexture2D* Texture; // 0x28
	uint64_t BuildHash; // 0x30
};

struct UConsole {
	ULocalPlayer* ConsoleTargetPlayer; // 0x38
	UTexture2D* DefaultTexture_Black; // 0x40
	UTexture2D* DefaultTexture_White; // 0x48
	TArray<FString> HistoryBuffer; // 0x68
};

struct ABattalionFlashGrenade {
	FVector2D EffectivenessRange; // 0x3d0
	FVector2D AngleOverride; // 0x3d8
	float DirectionFactorInfluencePercentage; // 0x3e0
	UMaterialInterface* DecalMaterialPtr; // 0x3e8
	FVector DecalSize; // 0x3f0
	float DecalLifeTime; // 0x3fc
	float ObjectLifeSpan; // 0x400
	bool bShowDebugFlashRange; // 0x404
};

struct UARLifeCycleComponent {
	FMulticastInlineDelegate OnARActorSpawnedDelegate; // 0x1f8
	FMulticastInlineDelegate OnARActorToBeDestroyedDelegate; // 0x208
};

struct USMStateMachineComponent {
	FMulticastInlineDelegate OnStateMachineInitializedEvent; // 0xc0
	FMulticastInlineDelegate OnStateMachineStartedEvent; // 0xd0
	FMulticastInlineDelegate OnStateMachineUpdatedEvent; // 0xe0
	FMulticastInlineDelegate OnStateMachineStoppedEvent; // 0xf0
	FMulticastInlineDelegate OnStateMachineTransitionTakenEvent; // 0x100
	FMulticastInlineDelegate OnStateMachineStateChangedEvent; // 0x110
	USMInstance* StateMachineClass; // 0x120
	ESMNetworkConfigurationType NetworkTickConfiguration; // 0x128
	ESMNetworkConfigurationType NetworkTransitionConfiguration; // 0x129
	ESMNetworkConfigurationType NetworkStateConfiguration; // 0x12a
	bool bIncludeSimulatedProxies; // 0x12b
	bool bTakeTransitionsFromServerOnly; // 0x12c
	float TransitionResetTimeSeconds; // 0x130
	bool bReplicateStatesOnLoad; // 0x134
	bool bDiscardTransitionsBeforeInitialize; // 0x135
	float MaxTimeToWaitForTransitionUpdate; // 0x138
	bool bInitializeOnBeginPlay; // 0x13c
	bool bStartOnBeginPlay; // 0x13d
	bool bLetInstanceManageTick; // 0x13e
	TArray<FSMNetworkedTransaction> R_NetworkedTransactions; // 0x140
	TArray<FSMNetworkedTransaction> PendingTransactions; // 0x150
	USMInstance* R_Instance; // 0x160
	USMInstance* InstanceTemplate; // 0x168
	bool bOverrideTick; // 0x170
	bool bCanEverTick; // 0x171
	bool bOverrideTickInterval; // 0x172
	float TickInterval; // 0x174
	bool R_bShuttingDown; // 0x178
	bool bCanInstanceNetworkTick; // 0x179
};

struct UMaterialExpressionDynamicParameter {
	TArray<FString> ParamNames; // 0x40
	FLinearColor DefaultValue; // 0x50
	uint32_t ParameterIndex; // 0x60
};

struct USphereReflectionCaptureComponent {
	float InfluenceRadius; // 0x270
	float CaptureDistanceScale; // 0x274
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
};

struct UDragDropOperation {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FMulticastInlineDelegate OnDrop; // 0x58
	FMulticastInlineDelegate OnDragCancelled; // 0x68
	FMulticastInlineDelegate OnDragged; // 0x78
};

struct UGameEngine {
	float MaxDeltaTime; // 0xde0
	float ServerFlushLogInterval; // 0xde4
	UGameInstance* GameInstance; // 0xde8
};

struct UInterpTrackFloatParticleParam {
	FName ParamName; // 0x90
};

struct APointLight {
	UPointLightComponent* PointLightComponent; // 0x230
};

struct UBattalionStatManager {
	UBattalionGameInstance* BattInstance; // 0x28
	UPFPlayerDataManager* PFPlayerData; // 0x30
	UPFPlayerIdCache* PFPlayerCache; // 0x38
	float UpdateFrequency; // 0x40
	float UpdateClientFrequency; // 0x138
};

struct UNUIFpsCounter {
	FText FpsText; // 0x278
};

struct UVariantSet {
	FText DisplayText; // 0x28
	bool bExpanded; // 0x58
	TArray<UVariant*> Variants; // 0x60
	UTexture2D* Thumbnail; // 0x70
};

struct UCombo_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_1; // 0x268
	UMenuAnchor* MenuAnchor_1; // 0x270
	UTextBlock* NameText; // 0x278
	TArray<FString> Options; // 0x280
	FString SelectedOption; // 0x290
	int32_t SelectedIndex; // 0x2a0
	FButtonStyle ComboSelected; // 0x2a8
	FButtonStyle ComboUnselected; // 0x520
	FSlateBrush BrushSelected; // 0x798
	FSlateBrush BrushNotSelected; // 0x820
	FMulticastInlineDelegate ComboChanged; // 0x8a8
	FSlateBrush BrushGrey; // 0x8b8
};

struct UPawnAction_Repeat {
	UPawnAction* ActionToRepeat; // 0x98
	UPawnAction* RecentActionCopy; // 0xa0
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
};

struct UNUITwoTeamScores {
	int32_t TeamOneScore; // 0x278
	int32_t TeamTwoScore; // 0x27c
	FLinearColor TeamOneColor; // 0x280
	FLinearColor TeamTwoColor; // 0x290
	ENationType TeamOneNation; // 0x2a0
	ENationType TeamTwoNation; // 0x2a1
};

struct UAB_WW2Knife_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x350
};

struct USndGameOverviewWidget {
	FText TimerText; // 0x268
	FText CurrentRoundText; // 0x280
	FText LeftTeamSCoreText; // 0x298
	FText RightTeamScoreText; // 0x2b0
	FText BombTimerText; // 0x2c8
	FText ReadyUpText; // 0x2e0
	FText PlayersNotReadyText; // 0x2f8
	TArray<APlayerState*> Players_Team0; // 0x310
	TArray<APlayerState*> Players_Team1; // 0x320
	FString AttackTeamName; // 0x330
	FString DefenceTeamName; // 0x340
	ESlateVisibility LeftTeamScoreVisibility; // 0x350
	ESlateVisibility RightTeamScoreVisibility; // 0x351
	ESlateVisibility BombPlantedVisibility; // 0x352
	ESlateVisibility ReadyUpVisibility; // 0x353
	ESlateVisibility NotReadyPlayersVisibility; // 0x354
	APromodGameState* pGameState; // 0x358
	APromodPlayerController* pOwningPlayercontroller; // 0x360
	UBattalionTeam* Team01Ptr; // 0x368
	UBattalionTeam* Team02Ptr; // 0x370
	bool HasHitShootoutOnce; // 0x378
	int32_t CachedTotalAlivePlayers; // 0x37c
};

struct UObjectReferencer {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct UMaterialExpressionDepthFade {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct ABP_RegenFireUp_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
	float Timeline_1_Radius_1BFD34F14D572B9401AD02965A2FA8E2; // 0x3d0
	ETimelineDirection Timeline_1__Direction_1BFD34F14D572B9401AD02965A2FA8E2; // 0x3d4
	UTimelineComponent* Timeline_2; // 0x3d8
	float AddChromatic_Amount_C2DCFAAF4794AEEAF741A8ADE5DD6E8F; // 0x3e0
	ETimelineDirection AddChromatic__Direction_C2DCFAAF4794AEEAF741A8ADE5DD6E8F; // 0x3e4
	UTimelineComponent* AddChromatic; // 0x3e8
	float EffectRadius_Radius_A70328C64838421A0AD619850B530030; // 0x3f0
	ETimelineDirection EffectRadius__Direction_A70328C64838421A0AD619850B530030; // 0x3f4
	UTimelineComponent* EffectRadius; // 0x3f8
	float RemoveFOV_RemoveFOVTrack_192FCA6A427F5632425A678DB5E46D52; // 0x400
	ETimelineDirection RemoveFOV__Direction_192FCA6A427F5632425A678DB5E46D52; // 0x404
	UTimelineComponent* RemoveFOV; // 0x408
	float AddFOV_AddFOVTrack_1277EDAF42CDA01525AEEFAC726DFEDF; // 0x410
	ETimelineDirection AddFOV__Direction_1277EDAF42CDA01525AEEFAC726DFEDF; // 0x414
	UTimelineComponent* AddFOV; // 0x418
	float MaxChromaticAberration; // 0x420
	UBP_RegenCameraModifier_C* CameraModifier; // 0x428
	float MaxFovAddition; // 0x430
	FTimerHandle TH_ReverseEffects; // 0x438
	float ReverseEffectsTime; // 0x440
	bool PlayingReverseEffects; // 0x444
	bool WasAborted; // 0x445
	UAkComponent* Component; // 0x448
};

struct UAnimNotifyState_Trail {
	UParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	ETrailWidthMode WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	char bRecycleSpawnedSystems : 1; // 0x54
};

struct UPlayFabClientAPI {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xaa8
	UPlayFabJsonObject* RequestJsonObj; // 0xab0
	UPlayFabJsonObject* ResponseJsonObj; // 0xab8
};

struct USoundWave {
	int32_t CompressionQuality; // 0x1b8
	int32_t StreamingPriority; // 0x1bc
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x1c0
	ESoundGroup SoundGroup; // 0x1c2
	char bLooping : 1; // 0x1c3
	char bStreaming : 1; // 0x1c3
	char bSeekableStreaming : 1; // 0x1c3
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x1c4
	char bMature : 1; // 0x1c5
	char bManualWordWrap : 1; // 0x1c5
	char bSingleLine : 1; // 0x1c6
	char bIsAmbisonics : 1; // 0x1c6
	TArray<float> FrequenciesToAnalyze; // 0x1c8
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x1d8
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x1e8
	int32_t InitialChunkSize; // 0x1f8
	FString SpokenText; // 0x240
	float SubtitlePriority; // 0x250
	float Volume; // 0x254
	float Pitch; // 0x258
	int32_t NumChannels; // 0x25c
	int32_t SampleRate; // 0x260
	TArray<FSubtitleCue> Subtitles; // 0x270
	UCurveTable* Curves; // 0x280
	UCurveTable* InternalCurves; // 0x288
};

struct AInteractiveFoliageActor {
	UCapsuleComponent* CapsuleComponent; // 0x230
	FVector TouchingActorEntryPosition; // 0x238
	FVector FoliageVelocity; // 0x244
	FVector FoliageForce; // 0x250
	FVector FoliagePosition; // 0x25c
	float FoliageDamageImpulseScale; // 0x268
	float FoliageTouchImpulseScale; // 0x26c
	float FoliageStiffness; // 0x270
	float FoliageStiffnessQuadratic; // 0x274
	float FoliageDamping; // 0x278
	float MaxDamageImpulse; // 0x27c
	float MaxTouchImpulse; // 0x280
	float MaxForce; // 0x284
	float Mass; // 0x288
};

struct ADatasmithAreaLightActor {
	EDatasmithAreaLightActorType LightType; // 0x220
	EDatasmithAreaLightActorShape LightShape; // 0x221
	FVector2D Dimensions; // 0x224
	float Intensity; // 0x22c
	ELightUnits IntensityUnits; // 0x230
	FLinearColor Color; // 0x234
	float Temperature; // 0x244
	UTextureLightProfile* IESTexture; // 0x248
	bool bUseIESBrightness; // 0x250
	float IESBrightnessScale; // 0x254
	FRotator Rotation; // 0x258
	float SourceRadius; // 0x264
	float SourceLength; // 0x268
	float AttenuationRadius; // 0x26c
	float SpotlightInnerAngle; // 0x270
	float SpotlightOuterAngle; // 0x274
};

struct ANavModifierVolume {
	UNavArea* AreaClass; // 0x260
	bool bMaskFillCollisionUnderneathForNavmesh; // 0x268
};

struct UGizmoTransformChangeStateTarget {
	TScriptInterface<IToolContextTransactionProvider> TransactionManager; // 0x50
};

struct UAIPerceptionSystem {
	TArray<UAISense*> Senses; // 0x88
	float PerceptionAgingRate; // 0x98
};

struct AGameMode {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct UGameInstance {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
	FMulticastInlineDelegate OnPawnControllerChangedDelegates; // 0x78
};

struct UHierarchicalLODSetup {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UNUIScoreboardRow {
	UNUIScoreboardGroup* ParentWidget; // 0x278
	ABattalionPlayerState* PlayerState; // 0x288
	FLinearColor TextColor; // 0x290
	FLinearColor DefaultBackgroundColor; // 0x2a0
	FLinearColor BackgroundColor; // 0x2b0
	FText PlayerName; // 0x2c0
	FText PlayerLatency; // 0x2d8
	int32_t PlayerLatencyValue; // 0x2f0
	int32_t PlayerId; // 0x2f4
	bool bHighlighted; // 0x2f8
	bool bFocused; // 0x2f9
	bool bDev; // 0x2fa
	FText playerLevel; // 0x300
	UTexture2D* LevelIcon; // 0x318
};

struct UMinimap_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* Canvas_Backgrounds; // 0x268
	UCanvasPanel* Canvas_IconsAboveFog; // 0x270
	UCanvasPanel* Canvas_IconsBelowFog; // 0x278
	UImage* Image_OpaqueBackground; // 0x280
	UOverlay* Overlay_Fogs; // 0x288
	URetainerBox* RetainerBox_Minimap; // 0x290
	UWidgetSwitcher* Switcher_MapActive; // 0x298
	UMinimapInternal_Camera_C* Widget_Camera; // 0x2a0
	UMapViewComponent* MapViewComp; // 0x2a8
	UMapTrackerComponent* MapTrackerComp; // 0x2b0
	FGeometry InitialMapGeo; // 0x2b8
	FVector2D InitialMapSize; // 0x2f0
	EMapViewSearchOption AutoLocateMapView; // 0x2f8
	bool bIsCircular; // 0x2f9
	bool bDrawCamera; // 0x2fa
	float FloorDistance; // 0x2fc
	FMulticastInlineDelegate OnMapClicked; // 0x300
	FVector2D InitialViewExtent; // 0x310
	FLinearColor FillColor; // 0x318
	TArray<UMinimapInternal_Icon_C*> Icons; // 0x328
	TArray<UMinimapInternal_Background_C*> Backgrounds; // 0x338
	TArray<UMinimapInternal_Fog_C*> Fogs; // 0x348
	FMulticastInlineDelegate OnViewChanged; // 0x358
	float IconScale; // 0x368
	FMulticastInlineDelegate OnBoxSelected; // 0x370
	bool bEnableBoxSelect; // 0x380
	FLinearColor BoxSelectColor; // 0x384
};

struct UInputSettings {
	TArray<FInputAxisConfigEntry> AxisConfig; // 0x28
	char bAltEnterTogglesFullscreen : 1; // 0x38
	char bF11TogglesFullscreen : 1; // 0x38
	char bUseMouseForTouch : 1; // 0x38
	char bEnableMouseSmoothing : 1; // 0x38
	char bEnableFOVScaling : 1; // 0x38
	char bCaptureMouseOnLaunch : 1; // 0x38
	char bDefaultViewportMouseLock : 1; // 0x38
	char bAlwaysShowTouchInterface : 1; // 0x38
	char bShowConsoleOnFourFingerTap : 1; // 0x39
	char bEnableGestureRecognizer : 1; // 0x39
	bool bUseAutocorrect; // 0x3a
	TArray<FString> ExcludedAutocorrectOS; // 0x40
	TArray<FString> ExcludedAutocorrectCultures; // 0x50
	TArray<FString> ExcludedAutocorrectDeviceModels; // 0x60
	EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x70
	EMouseLockMode DefaultViewportMouseLockMode; // 0x71
	float FOVScale; // 0x74
	float DoubleClickTime; // 0x78
	TArray<FInputActionKeyMapping> ActionMappings; // 0x80
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x90
	TArray<FInputActionSpeechMapping> SpeechMappings; // 0xa0
	TSoftClassPtr<UObject> DefaultPlayerInputClass; // 0xb0
	TSoftClassPtr<UObject> DefaultInputComponentClass; // 0xd8
	FSoftObjectPath DefaultTouchInterface; // 0x100
	FKey ConsoleKey; // 0x118
	TArray<FKey> ConsoleKeys; // 0x130
};

struct UAISense_Sight {
	int32_t MaxTracesPerTick; // 0x148
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c
	double MaxTimeSlicePerTick; // 0x150
	float HighImportanceQueryDistanceThreshold; // 0x158
	float MaxQueryImportance; // 0x160
	float SightLimitQueryImportance; // 0x164
};

struct AInfectionPlayerState {
	bool bIsPlayerInfected; // 0x5a8
	bool bCanRegenHealth; // 0x5a9
};

struct UPromodCharacterMovementComponent {
	bool bADSState; // 0xbb0
	bool bPrevADSState; // 0xbb1
	bool bPrevWantsToADS; // 0xbb2
	float ADSInTimestamp; // 0xbb4
	float ADSOutTimestamp; // 0xbb8
	float CurrADSTransition; // 0xbbc
	float LastMoveTimestamp; // 0xbc0
	FVector RelWishMove; // 0xbe0
	float RelWishMoveThreshold; // 0xbec
	FVector2D AbsWishMove; // 0xbf0
	float ControllerAirStrafingAssistance; // 0xbf8
	float CurrentServerMoveTime; // 0xbfc
	bool bCanSprint; // 0xc0c
	float InfiniteSprintRemaining; // 0xc10
	bool bInfiniteSprintEnabled; // 0xc14
	float SprintEnergyRemaining; // 0xc18
	FStaminaEvent CurrentStaminaEvent; // 0xc34
	FFindFloorResult PrevFloor; // 0xc5c
	bool bUseAccurateLandingVelocity; // 0xcf4
	bool bDebugLogFallDamage; // 0xcf5
	ALadder* CurrentLadder; // 0xd10
	TArray<ALadder*> PossibleLaddersInWorld; // 0xd18
	bool bIsSlidingAlongSurface; // 0xd2a
	bool Jumped; // 0xd2c
	float JumpStartZ; // 0xd30
	bool bQueueJump; // 0xd34
	FVector AirWishVelocity; // 0xd40
	bool bCrashLanded; // 0xd5d
	FVaultData LastVault; // 0xd60
	bool bIsVaulting; // 0xdb0
	bool bWantsToSlide; // 0xdb8
	bool bIsCurrentlySlideMoving; // 0xdb9
	float CurrentSlideTime; // 0xdbc
	float SlideStepTime; // 0xdc0
	float CurrentSlideStepFriction; // 0xdc4
	float SlideTimeSinceEnded; // 0xdc8
	float SlideDistance; // 0xdcc
	float SlideIntoADSMomentumTlPlayhead; // 0xdd0
	float ViewHeightLerpTimeStamp; // 0xdd4
	float ViewHeightLerpDeltaTime; // 0xdd8
	float ViewHeightLerpTarget; // 0xddc
	int32_t ViewHeightLerpDown; // 0xde0
	bool ViewHeightSprintOut; // 0xde4
	float ViewHeightTarget; // 0xde8
	float ViewHeightCurrent; // 0xdec
	float ProneChange; // 0xdf0
	float ProneDirection; // 0xdf4
	bool ProneBlocked; // 0xe00
	bool bIsMovementEnabled; // 0xe02
	char bWantsToProne : 1; // 0xe08
	char bWantsToSprint : 1; // 0xe08
	bool bIsSprinting; // 0xe0a
	char bWasWantingToSprint : 1; // 0xe0b
	char bWantsToLeanLeft : 1; // 0xe0b
	char bWantsToLeanRight : 1; // 0xe0b
	char bWantsToADS : 1; // 0xe0b
	char bHoldingADS : 1; // 0xe0b
	APromodCharacter* PromodCharacterOwner; // 0xe28
	bool bEncodeCompressedFlags; // 0xe4c
	float Friction; // 0xe50
	float GroundStopSpeed; // 0xe54
	float GroundAcceleration; // 0xe58
	float GroundMaxSpeed; // 0xe5c
	float InertiaMax; // 0xe60
	float InertiaAngle; // 0xe64
	float BackSpeedScale; // 0xe68
	float StrafeSpeedScale; // 0xe6c
	float JumpCooldown; // 0xe70
	float AirAccelerate; // 0xe74
	float JumpHeight; // 0xe78
	bool JumpSlowdownEnabled; // 0xe7c
	float JumpLandSlowdownTime; // 0xe80
	float HotDropSlowdownTime; // 0xe84
	float HotDropVelocityMultiplier; // 0xe88
	float JumpStepUpHeight; // 0xe8c
	float JumpLadderPushOffVelocity; // 0xe90
	bool bTreatInputAsAcceleration; // 0xe94
	bool bEncodeYawIntoAccelZ; // 0xe95
	bool bUseCameraViewForMovement; // 0xe96
	float Gravity; // 0xe98
	float GravityLinearDilation; // 0xe9c
	float GravityLogDilation; // 0xea0
	float MovementScale; // 0xea4
	float SprintSpeedScale; // 0xea8
	float SprintStrafeSpeedScale; // 0xeac
	float SprintRechargePause; // 0xeb0
	float SprintTime; // 0xeb4
	float SprintDurationScale; // 0xeb8
	float SprintMinTime; // 0xebc
	bool bForceAllowStartSprintInAir; // 0xec0
	float MinSpeedToUseStamina; // 0xec4
	float LeanSpeedScale; // 0xec8
	bool bSmoothSteps; // 0xecc
	float StepLerpTime; // 0xed0
	float StepLerpThreshold; // 0xed4
	float StepLerpMaxChange; // 0xed8
	float MaxLadderZSpeed; // 0xedc
	float LadderYawLimit; // 0xee0
	float LadderAttachmentWidth; // 0xee4
	float LadderDetachmentDistBottom; // 0xee8
	float LadderDetachmentDistTop; // 0xeec
	bool bAllowSliding; // 0xef0
	float MaxSlideDistance; // 0xef4
	bool bADSStopsSlide; // 0xef8
	bool bMaxSlideDistance3D; // 0xef9
	float SlideCooldown; // 0xefc
	UCurveFloat* SlidingFovCurveAddition; // 0xf00
	float SlidingFovEaseInSpeed; // 0xf08
	float SlidingFovEaseOutSpeed; // 0xf0c
	bool bForceSlideCancelUponADS; // 0xf10
	bool bForceStandWhenSlideEnds; // 0xf11
	bool bStopSlidingWhenFallingOffLedge; // 0xf12
	UCurveFloat* SlideRampFrictionScalarCurve; // 0xf18
	UCurveFloat* SlideStepFrictionHeightCurveMap; // 0xf20
	UCurveFloat* SlideStepFrictionFalloff; // 0xf28
	bool bCanJumpDirectlyOutOfSlide; // 0xf30
	bool bCanInitiateSlideWhileInAir; // 0xf31
	float MinGroundSpeedForSliding; // 0xf34
	float StopSlideGroundSpeedThreshold; // 0xf38
	float SlideMoveScaleScalar; // 0xf3c
	UCurveFloat* SlideMoveScaleScalarCurve; // 0xf40
	float SlideFriction; // 0xf48
	UCurveFloat* SlideFrictionCurve; // 0xf50
	float SlideAcceleration; // 0xf58
	UCurveFloat* SlideAccelerationCurve; // 0xf60
	float SlideYawClamp; // 0xf68
	UCurveFloat* SlideIntoADSMomentum; // 0xf70
	float SlideIntoADSMomentumPlayrate; // 0xf78
	float SlideStaminaRegenSpeed; // 0xf7c
	UCurvePromodStandCrouch* StandCrouchLerp; // 0xf80
	UCurvePromodCrouchStand* CrouchStandLerp; // 0xf88
	UCurvePromodCrouchProne* CrouchProneLerp; // 0xf90
	UCurvePromodProneCrouch* ProneCrouchLerp; // 0xf98
	float ColliderHeightStanding; // 0xfa0
	float ColliderHeightCrouching; // 0xfa4
	float ColliderHeightProning; // 0xfa8
	float ColliderProneFeetDist; // 0xfac
	float ProneFeetSkin; // 0xfb0
	float StandingCheckCapsuleHeightAdjust; // 0xfb4
	float LadderSweepDist; // 0xfb8
	bool bUseNewFloorCheck; // 0xfbc
	float FloorSweepWidthScalar; // 0xfc0
	float FloorSweepStartOffset; // 0xfc4
	float FloorSweepEndOffset; // 0xfc8
	float FloorSweepColliderHeight; // 0xfcc
	float AdjustFloorSweepWidthScalar; // 0xfd0
	float AdjustFloorStartOffset; // 0xfd4
	float AdjustFloorEndOffset; // 0xfd8
	float AdjustFloorColliderHeight; // 0xfdc
	bool bConserveLedgeVelocity; // 0xfe0
	float FallDamageMinHeight; // 0xfe4
	float FallDamageMaxHeight; // 0xfe8
	float FallDamageLinearDilation; // 0xfec
	float FallDamageLogDilation; // 0xff0
	FMulticastInlineDelegate OnClearedCrashLand; // 0xff8
	UBattalionDamageType* FallDmgTypeClass; // 0x1008
	float MeshLocationStanding; // 0x1010
	float MeshLocationCrouching; // 0x1014
	float MeshLocationProning; // 0x1018
	bool bIsDashing; // 0x107c
};

struct UParticleModuleLight {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct UCompositionGraphCaptureProtocol {
	FCompositionGraphCapturePasses IncludeRenderPasses; // 0x58
	bool bCaptureFramesInHDR; // 0x68
	int32_t HDRCompressionQuality; // 0x6c
	EHDRCaptureGamut CaptureGamut; // 0x70
	FSoftObjectPath PostProcessingMaterial; // 0x78
	bool bDisableScreenPercentage; // 0x90
	UMaterialInterface* PostProcessingMaterialPtr; // 0x98
};

struct UBTNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UAkPlayerSound_C {
	UAkAudioEvent* AkEvent; // 0x38
	FString EventName; // 0x40
	FString AttachName; // 0x50
	bool Follow; // 0x60
	bool ThirdPerson; // 0x61
};

struct UScrollBoxSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UNiagaraDataInterfaceGrid2DCollectionReader {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UPromodActionPrompt {
	ESlateVisibility PromptVisibility; // 0x260
	FText PromptDescriptionText; // 0x268
	bool PromptShowing; // 0x280
};

struct USaveDataManager {
	TArray<FSaveDataInfo> DataInfo; // 0x28
	TArray<USaveGame*> SavedGameData; // 0x38
};

struct AAtmosphericFog {
	UAtmosphericFogComponent* AtmosphericFogComponent; // 0x220
};

struct UAkWwiseTreeSelector {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct UEditableTextBox {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FEditableTextBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x928
	FText HintText; // 0x930
	FDelegate HintTextDelegate; // 0x948
	FSlateFontInfo Font; // 0x958
	FLinearColor ForegroundColor; // 0x9b0
	FLinearColor BackgroundColor; // 0x9c0
	FLinearColor ReadOnlyForegroundColor; // 0x9d0
	bool IsReadOnly; // 0x9e0
	bool IsPassword; // 0x9e1
	float MinimumDesiredWidth; // 0x9e4
	FMargin Padding; // 0x9e8
	bool IsCaretMovedWhenGainFocus; // 0x9f8
	bool SelectAllTextWhenFocused; // 0x9f9
	bool RevertTextOnEscape; // 0x9fa
	bool ClearKeyboardFocusOnCommit; // 0x9fb
	bool SelectAllTextOnCommit; // 0x9fc
	bool AllowContextMenu; // 0x9fd
	EVirtualKeyboardType KeyboardType; // 0x9fe
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9ff
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa00
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa01
	ETextJustify Justification; // 0xa02
	FShapedTextOptions ShapedTextOptions; // 0xa03
	FMulticastInlineDelegate OnTextChanged; // 0xa08
	FMulticastInlineDelegate OnTextCommitted; // 0xa18
};

struct UNUISpectatorLoadoutScreen {
	UNUISpectatorTeamLoadout* TeamLoadoutWidgetClass; // 0x278
	TArray<UNUISpectatorTeamLoadout*> TeamLoadoutWidgets; // 0x280
	FText HeadingText; // 0x290
};

struct UDirectionalLightComponent {
	float ShadowCascadeBiasDistribution; // 0x328
	char bEnableLightShaftOcclusion : 1; // 0x32c
	float OcclusionMaskDarkness; // 0x330
	float OcclusionDepthRange; // 0x334
	FVector LightShaftOverrideDirection; // 0x338
	float WholeSceneDynamicShadowRadius; // 0x344
	float DynamicShadowDistanceMovableLight; // 0x348
	float DynamicShadowDistanceStationaryLight; // 0x34c
	int32_t DynamicShadowCascades; // 0x350
	float CascadeDistributionExponent; // 0x354
	float CascadeTransitionFraction; // 0x358
	float ShadowDistanceFadeoutFraction; // 0x35c
	char bUseInsetShadowsForMovableObjects : 1; // 0x360
	int32_t FarShadowCascadeCount; // 0x364
	float FarShadowDistance; // 0x368
	float DistanceFieldShadowDistance; // 0x36c
	float LightSourceAngle; // 0x370
	float LightSourceSoftAngle; // 0x374
	float ShadowSourceAngleFactor; // 0x378
	float TraceDistance; // 0x37c
	char bUsedAsAtmosphereSunLight : 1; // 0x380
	int32_t AtmosphereSunLightIndex; // 0x384
	FLinearColor AtmosphereSunDiskColorScale; // 0x388
	char bPerPixelAtmosphereTransmittance : 1; // 0x398
	char bCastShadowsOnClouds : 1; // 0x398
	char bCastShadowsOnAtmosphere : 1; // 0x398
	char bCastCloudShadows : 1; // 0x398
	float CloudShadowStrength; // 0x39c
	float CloudShadowOnAtmosphereStrength; // 0x3a0
	float CloudShadowOnSurfaceStrength; // 0x3a4
	float CloudShadowDepthBias; // 0x3a8
	float CloudShadowExtent; // 0x3ac
	float CloudShadowMapResolutionScale; // 0x3b0
	float CloudShadowRaySampleCountScale; // 0x3b4
	FLinearColor CloudScatteredLuminanceScale; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3c8
	char bCastModulatedShadows : 1; // 0x3d8
	FColor ModulatedShadowColor; // 0x3dc
	float ShadowAmount; // 0x3e0
};

struct ULevelSequencePlayer {
	FMulticastInlineDelegate OnCameraCut; // 0x680
};

struct UAkComponent {
	bool bUseSpatialAudio; // 0x218
	ECollisionChannel OcclusionCollisionChannel; // 0x220
	char EnableSpotReflectors : 1; // 0x224
	UAkAuxBus* EarlyReflectionAuxBus; // 0x228
	FString EarlyReflectionAuxBusName; // 0x230
	int32_t EarlyReflectionOrder; // 0x240
	float EarlyReflectionBusSendGain; // 0x244
	float EarlyReflectionMaxPathLength; // 0x248
	float roomReverbAuxBusGain; // 0x24c
	int32_t diffractionMaxEdges; // 0x250
	int32_t diffractionMaxPaths; // 0x254
	float diffractionMaxPathLength; // 0x258
	char DrawFirstOrderReflections : 1; // 0x25c
	char DrawSecondOrderReflections : 1; // 0x25c
	char DrawHigherOrderReflections : 1; // 0x25c
	char DrawDiffraction : 1; // 0x25c
	bool StopWhenOwnerDestroyed; // 0x260
	float AttenuationScalingFactor; // 0x264
	float OcclusionRefreshInterval; // 0x268
	bool bUseReverbVolumes; // 0x26c
};

struct UClickDragInputBehavior {
	bool bUpdateModifiersDuringDrag; // 0x120
};

struct UNUIScreen {
	bool IsEntering; // 0x260
	float CurrentAnalogValue; // 0x264
	bool bAllowedToNavigate; // 0x268
	bool IsExiting; // 0x269
	bool ShouldBeRemovedFromViewport; // 0x26a
	UNUIScreen* PreviousScreen; // 0x270
	UPromodGamePadSettingsDataAsset* GamePadSettingsDataAsset; // 0x278
	UBattalionGameInstance* BattInstance; // 0x280
	UBattalionSettings* BattSettings; // 0x288
};

struct UBoundsCopyComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct AGrenadeFollowActor {
	UBoxComponent* RootBox; // 0x220
	ABattalionGrenade* LinkedGrenade; // 0x228
	bool BeginDestroyTimer; // 0x230
	float DestroyTime; // 0x234
	float DestroyTimer; // 0x238
};

struct UAIAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate OnFail; // 0x38
};

struct UParticleModuleAttractorParticle {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct UBodySetupCore {
	FName BoneName; // 0x28
	EPhysicsType PhysicsType; // 0x30
	ECollisionTraceFlag CollisionTraceFlag; // 0x31
	EBodyCollisionResponse CollisionReponse; // 0x32
};

struct UAB_UNDCSniper_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x350
	FAnimNode_Slot AnimGraphNode_Slot; // 0x3d0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x418
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x4e0
	float Targeting; // 0x530
};

struct UInterpTrackDirector {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct UConstantQNRTSettings {
	float StartingFrequency; // 0x28
	int32_t NumBands; // 0x2c
	float NumBandsPerOctave; // 0x30
	float AnalysisPeriod; // 0x34
	bool bDownmixToMono; // 0x38
	EConstantQFFTSizeEnum FFTSize; // 0x39
	EFFTWindowType WindowType; // 0x3a
	EAudioSpectrumType SpectrumType; // 0x3b
	float BandWidthStretch; // 0x3c
	EConstantQNormalizationEnum CQTNormalization; // 0x40
	float NoiseFloorDb; // 0x44
};

struct USoundNode {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UOnsetNRTSettings {
	bool bDownmixToMono; // 0x28
	float GranularityInSeconds; // 0x2c
	float Sensitivity; // 0x30
	float MinimumFrequency; // 0x34
	float MaximumFrequency; // 0x38
};

struct ULevelCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UMaterialExpressionLandscapeGrassOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct UNUIRoundResult {
	FText ResultText; // 0x278
	FText ReasonText; // 0x290
	FLinearColor ResultColor; // 0x2a8
};

struct UDialogueVoice {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UVectorFieldAnimated {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UNiagaraPreviewAxis_InterpParamVector2D {
	FVector2D Min; // 0x38
	FVector2D Max; // 0x40
};

struct UNiagaraDataInterfaceChaosDestruction {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x38
	EDataSourceTypeEnum DataSourceType; // 0x88
	int32_t DataProcessFrequency; // 0x8c
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90
	bool DoSpawn; // 0x94
	FVector2D SpawnMultiplierMinMax; // 0x98
	float SpawnChance; // 0xa0
	FVector2D ImpulseToSpawnMinMax; // 0xa4
	FVector2D SpeedToSpawnMinMax; // 0xac
	FVector2D MassToSpawnMinMax; // 0xb4
	FVector2D ExtentMinToSpawnMinMax; // 0xbc
	FVector2D ExtentMaxToSpawnMinMax; // 0xc4
	FVector2D VolumeToSpawnMinMax; // 0xcc
	FVector2D SolverTimeToSpawnMinMax; // 0xd4
	int32_t SurfaceTypeToSpawn; // 0xdc
	ELocationFilteringModeEnum LocationFilteringMode; // 0xe0
	ELocationXToSpawnEnum LocationXToSpawn; // 0xe1
	FVector2D LocationXToSpawnMinMax; // 0xe4
	ELocationYToSpawnEnum LocationYToSpawn; // 0xec
	FVector2D LocationYToSpawnMinMax; // 0xf0
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf8
	FVector2D LocationZToSpawnMinMax; // 0xfc
	EDataSortTypeEnum DataSortingType; // 0x104
	bool bGetExternalCollisionData; // 0x105
	bool DoSpatialHash; // 0x106
	FVector SpatialHashVolumeMin; // 0x108
	FVector SpatialHashVolumeMax; // 0x114
	FVector SpatialHashVolumeCellSize; // 0x120
	int32_t MaxDataPerCell; // 0x12c
	bool bApplyMaterialsFilter; // 0x130
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138
	bool bGetExternalBreakingData; // 0x188
	bool bGetExternalTrailingData; // 0x189
	FVector2D RandomPositionMagnitudeMinMax; // 0x18c
	float InheritedVelocityMultiplier; // 0x194
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198
	FVector2D RandomVelocityMagnitudeMinMax; // 0x19c
	float SpreadAngleMax; // 0x1a4
	FVector VelocityOffsetMin; // 0x1a8
	FVector VelocityOffsetMax; // 0x1b4
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0
	float MaxLatency; // 0x1c8
	EDebugTypeEnum DebugType; // 0x1cc
	int32_t LastSpawnedPointID; // 0x1d0
	float LastSpawnTime; // 0x1d4
	float SolverTime; // 0x1e8
	float TimeStampOfLastProcessedData; // 0x1ec
};

struct UMaterialExpressionTextureSample {
	FExpressionInput Coordinates; // 0x48
};

struct UDatasmithImportOptions {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x28
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x29
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x2a
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x2b
	EDatasmithImportActorPolicy LightImportPolicy; // 0x2c
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x2d
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x2e
	EDatasmithImportMaterialQuality MaterialQuality; // 0x2f
	FDatasmithImportBaseOptions BaseOptions; // 0x34
	FDatasmithReimportOptions ReimportOptions; // 0x48
	FString Filename; // 0x50
	FString FilePath; // 0x60
};

struct UGeometryCacheCodecBase {
	TArray<int32_t> TopologyRanges; // 0x28
};

struct UNiagaraDataInterfaceCurve {
	FRichCurve Curve; // 0x70
};

struct USubsurfaceProfile {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UNUICTFFlagStates {
	int32_t LocalPlayerTeam; // 0x278
	TArray<ACTFPlayerState*> FlagCarrierPlayerStates; // 0x280
	TArray<int32_t> FlagStates; // 0x290
	TArray<FText> FlagStateTexts; // 0x2a0
	TArray<FLinearColor> FlagStateColors; // 0x2b0
};

struct UMaterialExpressionLandscapeVisibilityMask {
	FGuid ExpressionGUID; // 0x40
};

struct UDamageType {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UParticleModuleTypeDataAnimTrail {
	char bDeadTrailsOnDeactivate : 1; // 0x30
	char bEnablePreviousTangentRecalculation : 1; // 0x30
	char bTangentRecalculationEveryFrame : 1; // 0x30
	float TilingDistance; // 0x34
	float DistanceTessellationStepSize; // 0x38
	float TangentTessellationStepSize; // 0x3c
	float WidthTessellationStepSize; // 0x40
};

struct UNUIVault {
	FText BindName; // 0x278
	FString ButtonProfile; // 0x290
};

struct UAITask_MoveTo {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UParticleModuleTypeDataRibbon {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
