// Created by BlueFire1337
// Updated 2022-01-18
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x4bf5140;
	constexpr auto GObjects = 0x4c0d6d8;
	constexpr auto GWorld = 0x4d42f18;
}

struct ABP_ClientBeacon_C : APropnightOnlineBeaconClient {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	USceneComponent* DefaultSceneRoot; // 0x2b8
	UObject* ServerEntry; // 0x2c0
	int32_t Players; // 0x2c8
	FDateTime SendTime; // 0x2d0
	FDateTime ReceiveTime; // 0x2d8
	UBP_SessionData_C* session; // 0x2e0
};

struct UParticleModuleLocationEmitterDirect : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
};

struct UOnsetNRT : UAudioSynesthesiaNRT {
	UOnsetNRTSettings* Settings; // 0x78
};

struct UEOSCoreAuthLogin : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x230
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x240
	UNavLinkCustomComponent* SmartLinkComp; // 0x250
	bool bSmartLinkIsRelevant; // 0x258
	FMulticastInlineDelegate OnSmartLinkReached; // 0x260
};

struct UMediaSoundComponent : USynthComponent {
	EMediaSoundChannels Channels; // 0x6c0
	bool DynamicRateAdjustment; // 0x6c4
	float RateAdjustmentFactor; // 0x6c8
	FFloatRange RateAdjustmentRange; // 0x6cc
	UMediaPlayer* MediaPlayer; // 0x6e0
};

struct UAlarmsWidgetSize_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AActor* Actor; // 0xb8
	TArray<ANewAlarmBP_C*> Alarms; // 0xc0
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct APhysicsThruster : ARigidBodyBase {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x220
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UJumpShakeForProps_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
	FVOscillator ShakeLoc; // 0x1ac
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xb0
};

struct UWBP_HitMarkComponent_KillerAlarm_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ShowAnim; // 0x268
	UImage* Image; // 0x270
	UImage* Image_2; // 0x278
	UImage* Image_38; // 0x280
	USizeBox* SizeBox_2; // 0x288
	UWidgetSwitcher* WidgetSwitcher_ColorArrow; // 0x290
	float LifeTime; // 0x298
	FMulticastInlineDelegate OnRemoved; // 0x2a0
	FVector InstigatorLocation; // 0x2b0
	ASurvivorMasterBP_C* PlayerRef; // 0x2c0
	bool Tutorial?; // 0x2c8
};

struct UParticleModuleSizeScaleBySpeed : UParticleModuleSizeBase {
	FVector2D SpeedScale; // 0x30
	FVector2D MaxScale; // 0x38
};

struct UBansheeScreamShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UMaterialExpressionConstant4Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UMaterialInterface : UObject {
	USubsurfaceProfile* SubsurfaceProfile; // 0x38
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x50
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x358
	float OuterConeAngle; // 0x35c
};

struct UWBP_LastChance_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* CanvasPanel_1; // 0x268
	UImage* Image_2; // 0x270
	UImage* Image_3; // 0x278
	UImage* Image_4; // 0x280
	UImage* Image_Many_3; // 0x288
	UImage* Image_Many_5; // 0x290
	UImage* Image_Ref; // 0x298
	UTextBlock* TextBlock_Count; // 0x2a0
	UTextBlock* TextBlock_Count_2; // 0x2a8
	UWidgetSwitcher* WidgetSwitcher_1; // 0x2b0
	int32_t Counter; // 0x2b8
	bool IsHidden; // 0x2bc
};

struct USkillPoints_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BG; // 0x268
	UTextBlock* Description; // 0x270
	UImage* Image; // 0x278
	UImage* Image_397; // 0x280
	UProgressBar* ProgressBar_164; // 0x288
	UImage* Skill1BG; // 0x290
	UImage* Skill1Image; // 0x298
	UImage* Skill2BG; // 0x2a0
	UImage* Skill2CDBG; // 0x2a8
	UTextBlock* Skill2CDText; // 0x2b0
	UImage* Skill2Image; // 0x2b8
	UImage* Skill3BG; // 0x2c0
	UImage* Skill3Image; // 0x2c8
	UTextBlock* TextBlock_2; // 0x2d0
	UTextBlock* TextBlock_75; // 0x2d8
	UTextBlock* TextBlock_87; // 0x2e0
	UTextBlock* TextBlock_155; // 0x2e8
	UTextBlock* TextBlock_251; // 0x2f0
	UTextBlock* Title; // 0x2f8
	UWidgetSwitcher* WidgetSwitcher_2; // 0x300
	UWidgetSwitcher* WidgetSwitcher_93; // 0x308
	ASurvivorMasterBP_C* Surv; // 0x310
	AKillerMasterBP_C* Killer; // 0x318
	bool Open?; // 0x320
	TArray<FString> Skills; // 0x328
	int32_t SelectedSkill; // 0x338
	bool Start?; // 0x33c
	TArray<bool> SkillsPassive?; // 0x340
	int32_t PrevLevel; // 0x350
	bool LevelUp?; // 0x354
};

struct ULocalizedOverlays : UOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct UDoppelganger_AnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x420
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x4a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x560
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x600
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x628
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x6c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x6f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x7b0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x7d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x930
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x958
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x980
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x9a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x9d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x9f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xa20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xa48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xa70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xa98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xac0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xae8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xb10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xb38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xb60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xb88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xbb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0xbd8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0xc00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0xc28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0xc50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xc78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xca0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0xcc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xcf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xd18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xd40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xd68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xd90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xdb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xde0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xe08
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xe30
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xe58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xe80
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xf00
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0xf30
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1018
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x10d8
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1158
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x1188
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1270
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1330
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x13b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x13e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x14c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x1588
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1608
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x1638
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x16d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1758
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x17d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1858
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x18f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1928
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x19a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x19d8
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1a58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1a88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1b08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1b88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1c08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1c88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1d08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1d88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1e08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1e88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1f28
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1fc8
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2068
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2108
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x21a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x2268
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2350
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2380
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2400
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2430
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x24b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2578
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x25f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2628
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x26a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2770
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x27f0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2820
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x28e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2968
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x29e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2a18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2a98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x2b18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2bb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2c38
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2cb8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x2d58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x2e18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x2f00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2fe8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3068
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x30e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x3188
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x3228
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x3310
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x33d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x3498
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3580
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3668
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x3698
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3748
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3808
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x38a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x38d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3950
	FAnimNode_Root AnimGraphNode_Root; // 0x39f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3a20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3aa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x3ac8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3af0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x3b70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3ba0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3c50
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3cd0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3d00
	int32_t KillerType; // 0x3db0
	float IsHolded; // 0x3db4
	bool IsOnAir?; // 0x3db8
	float Speed; // 0x3dbc
	float SpeedChek; // 0x3dc0
	int32_t TypeAttack; // 0x3dc4
	bool Attak; // 0x3dc8
	float Direction; // 0x3dcc
	bool JumpEndChek; // 0x3dd0
	bool FIRE; // 0x3dd1
	bool Plant; // 0x3dd2
	bool Flashed; // 0x3dd3
	bool Drop; // 0x3dd4
	bool ChairDrop; // 0x3dd5
	bool Catch; // 0x3dd6
	bool MarioStun; // 0x3dd7
	bool Runaway; // 0x3dd8
	FRotator HeadR; // 0x3ddc
	float Vertical rotation; // 0x3de8
	float HorizontalValue; // 0x3dec
	bool bTurnL; // 0x3df0
	bool bTurnR; // 0x3df1
	bool IsOwner?; // 0x3df2
	bool GrabbedChar?; // 0x3df3
	bool SchoolBell?; // 0x3df4
	bool HiddenAttack?; // 0x3df5
	bool HardHit?; // 0x3df6
	float Blend Weights 0; // 0x3df8
	float Delta Time X; // 0x3dfc
	bool Get Ready; // 0x3e00
	bool PropHunt?; // 0x3e01
	float SpeedRateF; // 0x3e04
	bool Broke Anim; // 0x3e08
};

struct USequenceCameraShake : UCameraShakeBase {
	UCameraAnimationSequence* Sequence; // 0x98
	float PlayRate; // 0xa0
	float Scale; // 0xa4
	float BlendInTime; // 0xa8
	float BlendOutTime; // 0xac
	float RandomSegmentDuration; // 0xb0
	bool bRandomSegment; // 0xb4
	USequenceCameraShakeSequencePlayer* Player; // 0xb8
	USequenceCameraShakeCameraStandIn* CameraStandIn; // 0xc0
};

struct AOnlineBeaconClient : AOnlineBeacon {
	AOnlineBeaconHostObject* BeaconOwner; // 0x250
	UNetConnection* BeaconConnection; // 0x258
	EBeaconConnectionState ConnectionState; // 0x260
};

struct UMainchar1_AnimBP_FPP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x368
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x3e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x410
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x438
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x460
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x488
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x4b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x4d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x500
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x528
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x550
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x578
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x5a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x5c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x5f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x618
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x640
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x668
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x6e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x768
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x7e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x868
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x8e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x968
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x9e8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xa68
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xb18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0xb48
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xbc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xbf8
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0xc78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xca8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0xd28
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0xd58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0xe40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0xf28
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x1010
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x10f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x11e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x12c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x13b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1460
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1548
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1578
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1660
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x1690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x1730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x17b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1830
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x18b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1930
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x19b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1a30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1ab0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1b30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1be0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1c60
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1c90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1d30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1db0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1e30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1eb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1f30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1fb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x2030
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x20b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2130
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x21e0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2260
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2290
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2330
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x23b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2430
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x24b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2530
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x25b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2630
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x26b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x2730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x27e0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2860
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2890
	FAnimNode_Root AnimGraphNode_Root; // 0x2940
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2970
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x29f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2a90
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2be8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2d40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2d68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2d90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2e10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2e90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2f30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x2fb0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x3050
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x30f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3170
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3210
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3290
	bool IsOwner?; // 0x3330
	bool IsInAir?; // 0x3331
	float Speed; // 0x3334
	float Direction; // 0x3338
	bool Crawl?; // 0x333c
	bool FPP?; // 0x333d
	bool OnChair?; // 0x333e
	bool Grapple?; // 0x333f
	bool EndJump?; // 0x3340
	float HasItem; // 0x3344
	ItemType ItemType; // 0x3348
	bool UseFlashlight?; // 0x3349
	SurvStateEnum SurvStateEnum; // 0x334a
	MovementTypeEnum MovementType; // 0x334b
	bool ItemTake?; // 0x334c
	bool ItemSwap?; // 0x334d
	FVector NewVar_1; // 0x3350
	float XYSpeed; // 0x335c
	SurvChars Surv Char; // 0x3360
	bool Energy Drnk Anim B; // 0x3361
	bool KBook Anim B; // 0x3362
	bool Painkiller; // 0x3363
	bool ThrowGrenade; // 0x3364
	bool TakeRune; // 0x3365
	bool Is Tool Activated; // 0x3366
};

struct UParticleModuleBeamModifier : UParticleModuleBeamBase {
	BeamModifierType ModifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector Position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UWidgetAnimationPlayCallbackProxy : UObject {
	FMulticastInlineDelegate Finished; // 0x28
};

struct UCheckInteractable_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	ASurvivorMasterBP_C* Survivor; // 0xb8
	AActor* InteractableActor; // 0xc0
	bool Alarm?; // 0xc8
	bool Chair?; // 0xc9
	bool Exit?; // 0xca
	bool Lootbox?; // 0xcb
	bool Survivor?; // 0xcc
	bool FindedSurvivor?; // 0xcd
	bool LootboxCanOpen?; // 0xce
	TArray<ALootBox_C*> LootBoxs; // 0xd0
};

struct APlayerController : AController {
	UPlayer* Player; // 0x298
	APawn* AcknowledgedPawn; // 0x2a0
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2a8
	AHUD* MyHUD; // 0x2b0
	APlayerCameraManager* PlayerCameraManager; // 0x2b8
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2c0
	bool bAutoManageActiveCameraTarget; // 0x2c8
	FRotator TargetViewRotation; // 0x2cc
	float SmoothTargetViewRotationSpeed; // 0x2e4
	TArray<AActor*> HiddenActors; // 0x2f0
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300
	float LastSpectatorStateSynchTime; // 0x314
	FVector LastSpectatorSyncLocation; // 0x318
	FRotator LastSpectatorSyncRotation; // 0x324
	int32_t ClientCap; // 0x330
	UCheatManager* CheatManager; // 0x338
	UCheatManager* CheatClass; // 0x340
	UPlayerInput* PlayerInput; // 0x348
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350
	char bPlayerIsWaiting : 1; // 0x3d0
	char NetPlayerIndex; // 0x3d4
	UNetConnection* PendingSwapConnection; // 0x410
	UNetConnection* NetConnection; // 0x418
	float InputYawScale; // 0x42c
	float InputPitchScale; // 0x430
	float InputRollScale; // 0x434
	char bShowMouseCursor : 1; // 0x438
	char bEnableClickEvents : 1; // 0x438
	char bEnableTouchEvents : 1; // 0x438
	char bEnableMouseOverEvents : 1; // 0x438
	char bEnableTouchOverEvents : 1; // 0x438
	char bForceFeedbackEnabled : 1; // 0x438
	float ForceFeedbackScale; // 0x43c
	TArray<FKey> ClickEventKeys; // 0x440
	EMouseCursor DefaultMouseCursor; // 0x450
	EMouseCursor CurrentMouseCursor; // 0x451
	ECollisionChannel DefaultClickTraceChannel; // 0x452
	ECollisionChannel CurrentClickTraceChannel; // 0x453
	float HitResultTraceDistance; // 0x454
	uint16_t SeamlessTravelCount; // 0x458
	uint16_t LastCompletedSeamlessTravelCount; // 0x45a
	UInputComponent* InactiveStateInputComponent; // 0x4d0
	char bShouldPerformFullTickWhenPaused : 1; // 0x4d8
	UTouchInterface* CurrentTouchInterface; // 0x4f0
	ASpectatorPawn* SpectatorPawn; // 0x548
	bool bIsLocalPlayerController; // 0x554
	FVector SpawnLocation; // 0x558
};

struct URadialIntMask : UFieldNodeInt {
	float Radius; // 0xb0
	FVector Position; // 0xb4
	int32_t InteriorValue; // 0xc0
	int32_t ExteriorValue; // 0xc4
	ESetMaskConditionType SetMaskCondition; // 0xc8
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UATPCCameraModeScript_ChangeMovementSpeed : UATPCCameraModeScript {
	float NewMaxMovementSpeed; // 0x40
	bool bRestoreOldMovementSpeedOnExitCameraMode; // 0x44
	float OldMaxMovementSpeed; // 0x48
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
	FMulticastInlineDelegate OnPawnControllerChangedDelegates; // 0x78
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance : UMaterialExpression {
	int32_t LightIndex; // 0x40
	FExpressionInput WorldPosition; // 0x44
};

struct UWBP_LootboxMain_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Throbber_AnimByScrap; // 0x268
	UWidgetAnimation* Throbber_AnimByCoins; // 0x270
	UWidgetAnimation* FadeIn; // 0x278
	UWidgetAnimation* HideViewer_Anim; // 0x280
	UWidgetAnimation* ShowViewerUI_Anim; // 0x288
	UWidgetAnimation* HideLootboxUI_Anim; // 0x290
	UButton* Button_Add; // 0x298
	UButton* Button_Clear; // 0x2a0
	UButton* Button_start; // 0x2a8
	UButton* Button_start_BuyByScraps; // 0x2b0
	UButton* ButtonCont; // 0x2b8
	UImage* FadeBG; // 0x2c0
	UHorizontalBox* HorizontalBox_ButtonContent; // 0x2c8
	UHorizontalBox* HorizontalBox_ButtonContentByScraps; // 0x2d0
	UImage* Image_Hovered_Buy; // 0x2d8
	UImage* Image_Hovered_Buy_Scraps; // 0x2e0
	UImage* Image_Hovered_Remaining; // 0x2e8
	UImage* Image_Normal_Buy; // 0x2f0
	UImage* Image_Normal_Buy_Scraps; // 0x2f8
	UImage* Image_Normal_Remaining; // 0x300
	UImage* Image_start; // 0x308
	UImage* Image_start_Scraps; // 0x310
	UImage* Image_Throbber; // 0x318
	UImage* Image_Throbber_Scraps; // 0x320
	UOverlay* Overlay_BuyButtonByCoins; // 0x328
	UOverlay* Overlay_BuyButtonByScraps; // 0x330
	UOverlay* Overlay_RemainingButton; // 0x338
	UTextBlock* Text_Money; // 0x340
	UTextBlock* Text_Money_Scrap; // 0x348
	UTextBlock* TextBlock_BuyLabel; // 0x350
	UTextBlock* TextBlock_BuyLabel_ByScraps; // 0x358
	UW_Path_C* W_Path; // 0x360
	UWBP_LootViewerUI_C* WBP_LootViewerUI; // 0x368
	UW_MainMenu_C* W_MainMenu; // 0x370
	bool IsViewerMode; // 0x378
	FS_LootBoxSkin Current Loot; // 0x380
	ABP_PrizeActor_C* PrizeActor; // 0x3b0
	ABP_LootBoxOriginal_C* lootbox; // 0x3b8
	bool AfterRowOpen; // 0x3c0
	bool IsThrobberAnim; // 0x3c1
	bool isEscapeBlocked; // 0x3c2
	bool IsCoinsEnough; // 0x3c3
	bool IsScapsEnough; // 0x3c4
	UButton* FocusedButton; // 0x3c8
};

struct UMovieSceneStringSection : UMovieSceneSection {
	FMovieSceneStringChannel StringCurve; // 0xe8
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x9c
	FSubmixEffectDelaySettings DynamicSettings; // 0xa8
};

struct UMovieSceneByteTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct ASurv4_C : ASurvivorMasterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1830
};

struct UMaterialExpressionArctangent2 : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct AGS_PropHunt_C : AGameStateBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UBP_ItemsManager_C* BP_ItemsManager; // 0x278
	USceneComponent* DefaultSceneRoot; // 0x280
	int32_t Seconds; // 0x288
	bool IsLobby; // 0x28c
	FMiniLobbyState LobbyState; // 0x290
	int32_t AlarmsCount; // 0x2e8
	TArray<ASurvivorMasterBP_C*> SurvArrayRef; // 0x2f0
	bool IsKillerWin; // 0x300
	TArray<APlayerStart*> PlayerStarts; // 0x308
	TArray<AActor*> AliveSurvivors; // 0x318
	TArray<AActor*> ReadyPlayers; // 0x328
	TArray<AHypnoChairBP_C*> ChairRef; // 0x338
	TArray<ANewAlarmBP_C*> AlarmsRef; // 0x348
	bool IsGameSession; // 0x358
	int32_t SurvsOnChair; // 0x35c
	int32_t NeedAlarmRelaoding; // 0x360
	int32_t EndGameAlarmCount; // 0x364
	bool DoorOpened?; // 0x368
	int32_t EscapedSurvCount; // 0x36c
	bool GameStart?; // 0x370
	TArray<FItemSnapshot> ItemSnapshots; // 0x378
	int32_t FloorsCount; // 0x388
	int32_t Score; // 0x38c
	bool GameEnd?; // 0x390
	TMap<AActor*, FString> VoteMap; // 0x398
	bool IsGranny; // 0x3e8
	int32_t Random; // 0x3ec
	TArray<bool> RemoveSurvs?; // 0x3f0
	int32_t CurrentCountCoins; // 0x400
	int32_t MaxCountCoins; // 0x404
	TArray<FTransform> CoinsPositions; // 0x408
	TArray<FTransform> FreeSpaceCoinsPositions; // 0x418
	float DeltaSeconds; // 0x428
	SurvClass SurvClass; // 0x42c
	bool IsPublic; // 0x42d
	FTimerHandle StartGameTimer; // 0x430
	bool BoostModeON?; // 0x438
	KillerType KillerType; // 0x439
	FVector Temp1; // 0x43c
	FRotator Temp2; // 0x448
	bool TimerStart?; // 0x454
	int32_t MaxScore_AlarmGame; // 0x458
	int32_t MaxScore_REVIVE; // 0x45c
	int32_t MaxScore_OutChair; // 0x460
	int32_t MaxScore_FLASH; // 0x464
	int32_t MaxScore_HealALLY; // 0x468
	int32_t MaxScore_HealSELF; // 0x46c
	int32_t MaxScore_OutGrip; // 0x470
	int32_t MaxScore_HIT; // 0x474
	int32_t MaxScore_DOWNED; // 0x478
	int32_t MaxScore_CHAIR; // 0x47c
	int32_t MaxScore_Stun; // 0x480
	int32_t MAXSCOREBLOCK_AlarmGame; // 0x484
	int32_t MAXSCOREBLOCK_REVIVE; // 0x488
	int32_t MAXSCOREBLOCK_OutChair; // 0x48c
	int32_t MAXSCOREBLOCK_FLASH; // 0x490
	int32_t MAXSCOREBLOCK_HealALLY; // 0x494
	int32_t MAXSCOREBLOCK_HealSELF; // 0x498
	int32_t MAXSCOREBLOCK_OutGrip; // 0x49c
	int32_t MAXSCOREBLOCK_Stun; // 0x4a0
	int32_t MAXSCOREBLOCK_HIT; // 0x4a4
	int32_t MAXSCOREBLOCK_DOWNED; // 0x4a8
	int32_t MAXSCOREBLOCK_CHAIR; // 0x4ac
	int32_t KillScoreCounter; // 0x4b0
	bool PropHuntMode?; // 0x4b4
	bool CaptureMode?; // 0x4b5
	TArray<ACoinActor_C*> coins; // 0x4b8
	FS_GameSettings GameSettings; // 0x4c8
	int32_t FartSeconds; // 0x4e8
	bool IsLobbyStateAccepted?; // 0x4ec
	int32_t TempCategory; // 0x4f0
	APlayerState* IgnoredPlayer; // 0x4f8
	TArray<APlayerState*> TempPlayerStates; // 0x500
	APlayerState* SurvFirstCategory; // 0x510
	APlayerState* SurvSecondCategory; // 0x518
	APlayerState* KillerCategory; // 0x520
	int32_t TempSwap1; // 0x528
	int32_t TempSwap2; // 0x52c
	TMap<MapVote, int32_t> ReadingMapVotesMap; // 0x530
	TMap<PlayerCategoryVote, int32_t> ReadingPlayersCategoryVotes; // 0x580
	int32_t VoteCountMap1; // 0x5d0
	int32_t VoteCountMap2; // 0x5d4
	int32_t VoteCountMap3; // 0x5d8
	int32_t VoteCountPlayerCategory1; // 0x5dc
	int32_t VoteCountPlayerCategory2; // 0x5e0
	int32_t VoteCountPlayerCategory3; // 0x5e4
	TArray<FName> TempMapNames; // 0x5e8
	int32_t IntTemp; // 0x5f8
	FName Map1; // 0x5fc
	FName Map2; // 0x604
	FName Map3; // 0x60c
	int32_t NextGameTimer; // 0x614
	TArray<int32_t> IntArrayTemp; // 0x618
	bool AllAlarmsReady?; // 0x628
	int32_t MatchTime; // 0x62c
	TArray<APlayerState*> TempPlayerStates2; // 0x630
	bool bPlayerStart; // 0x640
	FString TempSlotName1; // 0x648
	FString TempSlotName2; // 0x658
	bool Tutorial?; // 0x668
	FS_ServerSettings ServerSettings; // 0x670
	int32_t CountKillers; // 0x698
	int32_t CountSurvs; // 0x69c
	bool IsLobbyWait; // 0x6a0
	bool SoloMode?; // 0x6a1
	int32_t OnChairSurvs; // 0x6a4
	int32_t KillerPoints; // 0x6a8
	int32_t SurvPoints; // 0x6ac
	int32_t LobbyTime; // 0x6b0
	bool LobbyBlockRdy?; // 0x6b4
	int32_t TempMvp; // 0x6b8
	APS_PropHunt_C* MvpSurv; // 0x6c0
	bool MvpPlayerReady?; // 0x6c8
	APS_PropHunt_C* TempSwap; // 0x6d0
	int32_t INDX_Slots; // 0x6d8
	CoinEnum PointsType; // 0x6dc
	AActor* TempPlayer; // 0x6e0
	FTimerHandle WaitPlayersTimerHandle; // 0x6e8
	bool SomeoneLeftAfterFullLobby; // 0x6f0
	bool FullLobbyWasReached; // 0x6f1
	bool CanAssign; // 0x6f2
	bool KillerLeave?; // 0x6f3
	TArray<FName> TempPerks; // 0x6f8
	int32_t TempInt; // 0x708
	TMap<FString, int32_t> ReadingPlayersCategoryVotes_v2; // 0x710
	TArray<int32_t> VotesArray; // 0x760
	FMulticastInlineDelegate OnVoted; // 0x770
	int32_t MaxScore_DoorOpen; // 0x780
	int32_t MaxScore_ExitDoor; // 0x784
	TArray<FEndGamePlayerData> HighlightPlayerInformation; // 0x788
	TArray<FST_BannerInfo> BannerInfo; // 0x798
	FTimerHandle HandlerAddBanerInfo; // 0x7a8
	FMulticastInlineDelegate OnLogin; // 0x7b0
	int32_t LeftSurvsCounter; // 0x7c0
	TArray<APS_PropHunt_C*> ActivityPlayers; // 0x7c8
	FMulticastInlineDelegate UpdateActivityPlayers; // 0x7d8
	bool HaveDyingChars?; // 0x7e8
	TArray<FST_LeavePlayers_Tab_Stats> LeavePlayers; // 0x7f0
	FMulticastInlineDelegate UpdateLeavePlayers; // 0x800
	bool IsPlayerReloadingAlarmOvertime; // 0x810
};

struct UParticleModuleAccelerationBase : UParticleModule {
	char bAlwaysInWorldSpace : 1; // 0x30
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct UMovieSceneCameraAnimSection : UMovieSceneSection {
	FMovieSceneCameraAnimSectionData AnimData; // 0xe8
	UCameraAnim* CameraAnim; // 0x108
	float PlayRate; // 0x110
	float PlayScale; // 0x114
	float BlendInTime; // 0x118
	float BlendOutTime; // 0x11c
	bool bLooping; // 0x120
};

struct UNiagaraDataInterfaceExport : UNiagaraDataInterface {
	FNiagaraUserParameterBinding CallbackHandlerParameter; // 0x38
	ENDIExport_GPUAllocationMode GPUAllocationMode; // 0x58
	int32_t GPUAllocationFixedSize; // 0x5c
	float GPUAllocationPerParticleSize; // 0x60
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraShakePlaySpace PlaySpace; // 0x78
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct USpacer : UWidget {
	FVector2D Size; // 0x108
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UDirectionalLightComponent : ULightComponent {
	float ShadowCascadeBiasDistribution; // 0x328
	char bEnableLightShaftOcclusion : 1; // 0x32c
	float OcclusionMaskDarkness; // 0x330
	float OcclusionDepthRange; // 0x334
	FVector LightShaftOverrideDirection; // 0x338
	float WholeSceneDynamicShadowRadius; // 0x344
	float DynamicShadowDistanceMovableLight; // 0x348
	float DynamicShadowDistanceStationaryLight; // 0x34c
	int32_t DynamicShadowCascades; // 0x350
	float CascadeDistributionExponent; // 0x354
	float CascadeTransitionFraction; // 0x358
	float ShadowDistanceFadeoutFraction; // 0x35c
	char bUseInsetShadowsForMovableObjects : 1; // 0x360
	int32_t FarShadowCascadeCount; // 0x364
	float FarShadowDistance; // 0x368
	float DistanceFieldShadowDistance; // 0x36c
	float LightSourceAngle; // 0x370
	float LightSourceSoftAngle; // 0x374
	float ShadowSourceAngleFactor; // 0x378
	float TraceDistance; // 0x37c
	char bUsedAsAtmosphereSunLight : 1; // 0x380
	int32_t AtmosphereSunLightIndex; // 0x384
	FLinearColor AtmosphereSunDiskColorScale; // 0x388
	char bPerPixelAtmosphereTransmittance : 1; // 0x398
	char bCastShadowsOnClouds : 1; // 0x398
	char bCastShadowsOnAtmosphere : 1; // 0x398
	char bCastCloudShadows : 1; // 0x398
	float CloudShadowStrength; // 0x39c
	float CloudShadowOnAtmosphereStrength; // 0x3a0
	float CloudShadowOnSurfaceStrength; // 0x3a4
	float CloudShadowDepthBias; // 0x3a8
	float CloudShadowExtent; // 0x3ac
	float CloudShadowMapResolutionScale; // 0x3b0
	float CloudShadowRaySampleCountScale; // 0x3b4
	FLinearColor CloudScatteredLuminanceScale; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3c8
	char bCastModulatedShadows : 1; // 0x3d8
	FColor ModulatedShadowColor; // 0x3dc
	float ShadowAmount; // 0x3e0
};

struct UInterpGroupCamera : UInterpGroup {
	UCameraAnim* CameraAnimInst; // 0x50
	float CompressTolerance; // 0x58
};

struct UMaterialExpressionTruncate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPaperTileSet : UObject {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct USpyEyes_C : UKillerSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	bool CD; // 0xf0
	int32_t Ammo; // 0xf4
	TArray<ASpyEye_C*> EyesRef; // 0xf8
	TArray<ASurvivorMasterBP_C*> SurvsRef; // 0x108
	TArray<AActor*> IgnorActors; // 0x118
	int32_t Count; // 0x128
	bool Reloading; // 0x12c
	float Radius; // 0x130
};

struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x98
};

struct UReflectionCaptureComponent : USceneComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct UAC_BattlEye_Client_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UO_BEClient_C* BEClient; // 0xb8
	bool IsTicketSent; // 0xc0
	bool IsInited; // 0xc1
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UMaterialExpressionCrossProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct UScrollBox : UPanelWidget {
	FScrollBoxStyle WidgetStyle; // 0x120
	FScrollBarStyle WidgetBarStyle; // 0x348
	USlateWidgetStyleAsset* Style; // 0x818
	USlateWidgetStyleAsset* BarStyle; // 0x820
	EOrientation Orientation; // 0x828
	ESlateVisibility ScrollBarVisibility; // 0x829
	EConsumeMouseWheel ConsumeMouseWheel; // 0x82a
	FVector2D ScrollbarThickness; // 0x82c
	FMargin ScrollbarPadding; // 0x834
	bool AlwaysShowScrollbar; // 0x844
	bool AlwaysShowScrollbarTrack; // 0x845
	bool AllowOverscroll; // 0x846
	bool bAnimateWheelScrolling; // 0x847
	EDescendantScrollDestination NavigationDestination; // 0x848
	float NavigationScrollPadding; // 0x84c
	EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x850
	bool bAllowRightClickDragScrolling; // 0x851
	float WheelScrollMultiplier; // 0x854
	FMulticastInlineDelegate OnUserScrolled; // 0x858
};

struct UWBP_HitMarkComponent_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ShowAnim; // 0x268
	UImage* Image_38; // 0x270
	float LifeTime; // 0x278
	FMulticastInlineDelegate OnRemoved; // 0x280
	FVector InstigatorLocation; // 0x290
	ASurvivorMasterBP_C* PlayerRef; // 0x2a0
};

struct UAmmoKillerWBP_C : UUserWidget {
	UImage* Image; // 0x260
	UTextBlock* TextBlock_3; // 0x268
	int32_t Ammo; // 0x270
	int32_t Eyes; // 0x274
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x220
	FColor BrushColor; // 0x224
	int32_t PolyFlags; // 0x228
	char bColored : 1; // 0x22c
	char bSolidWhenSelected : 1; // 0x22c
	char bPlaceableFromClassBrowser : 1; // 0x22c
	char bNotForClientOrServer : 1; // 0x22c
	UModel* Brush; // 0x230
	UBrushComponent* BrushComponent; // 0x238
	char bInManipulation : 1; // 0x240
	TArray<FGeomSelection> SavedSelections; // 0x248
};

struct UMaterialExpressionTemporalSobol : UMaterialExpression {
	FExpressionInput Index; // 0x40
	FExpressionInput Seed; // 0x54
	uint32_t ConstIndex; // 0x68
	FVector2D ConstSeed; // 0x6c
};

struct USoundNodeGroupControl : USoundNode {
	TArray<int32_t> GroupSizes; // 0x48
};

struct UBTNode : UObject {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x90
	FName TrackName; // 0xa0
};

struct UWBP_MiniFriendEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Hide_Anim; // 0x268
	UButton* Button_124; // 0x270
	UImage* Image_Avatar; // 0x278
	UImage* Image_BG; // 0x280
	UImage* Image_BG_2; // 0x288
	UImage* Image_Hover; // 0x290
	UImage* Image_LeaderLobby; // 0x298
	UOverlay* Overlay_Nickname; // 0x2a0
	URetainerBox* RetainerBox_52; // 0x2a8
	UTextBlock* TextBlock_Nickname; // 0x2b0
	FVector2D AvatarSize; // 0x2b8
	FString SteamId; // 0x2c0
	UMaterialInstanceDynamic* Material; // 0x2d0
	FString Username; // 0x2d8
	bool IsOwner; // 0x2e8
};

struct UDistributionVectorUniform : UDistributionVector {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct AChaosSolverActor : AActor {
	FChaosSolverConfiguration Properties; // 0x220
	float TimeStepMultiplier; // 0x288
	int32_t CollisionIterations; // 0x28c
	int32_t PushOutIterations; // 0x290
	int32_t PushOutPairIterations; // 0x294
	float ClusterConnectionFactor; // 0x298
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x29c
	bool DoGenerateCollisionData; // 0x29d
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2a0
	bool DoGenerateBreakingData; // 0x2b0
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x2b4
	bool DoGenerateTrailingData; // 0x2c4
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x2c8
	float MassScale; // 0x2d8
	bool bGenerateContactGraph; // 0x2dc
	bool bHasFloor; // 0x2dd
	float FloorHeight; // 0x2e0
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x2e4
	UBillboardComponent* SpriteComponent; // 0x2e8
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x308
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UComboBox : UWidget {
	TArray<UObject*> Items; // 0x108
	FDelegate OnGenerateWidgetEvent; // 0x118
	bool bIsFocusable; // 0x128
};

struct UNetDriver : UObject {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t NetServerMaxTickRate; // 0x58
	int32_t MaxNetTickRate; // 0x5c
	int32_t MaxInternetClientRate; // 0x60
	int32_t MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	UNetConnection* ServerConnection; // 0x88
	TArray<UNetConnection*> ClientConnections; // 0x90
	int32_t RecentlyDisconnectedTrackingTime; // 0x100
	UWorld* World; // 0x140
	UPackage* WorldPackage; // 0x148
	UObject* NetConnectionClass; // 0x170
	UObject* ReplicationDriverClass; // 0x178
	FName NetDriverName; // 0x190
	TArray<FChannelDefinition> ChannelDefinitions; // 0x198
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1a8
	TArray<UChannel*> ActorChannelPool; // 0x1f8
	float Time; // 0x210
	UReplicationDriver* ReplicationDriver; // 0x6e8
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x268
	float DamagePerSec; // 0x26c
	UDamageType* DamageType; // 0x270
	float PainInterval; // 0x278
	char bEntryPain : 1; // 0x27c
	char BACKUP_bPainCausing : 1; // 0x27c
	AController* DamageInstigator; // 0x280
};

struct UBrainComponent : UActorComponent {
	UBlackboardComponent* BlackboardComp; // 0xb8
	AAIController* AIOwner; // 0xc0
};

struct UNiagaraDataInterfaceFieldSystem : UNiagaraDataInterface {
	UBlueprint* BlueprintSource; // 0x38
	AActor* SourceActor; // 0x40
	FIntVector FieldDimensions; // 0x48
	FVector MinBounds; // 0x54
	FVector MaxBounds; // 0x60
};

struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	FBlackboardKeySelector ActorToCheck; // 0x68
	EGameplayContainerMatchType TagsToMatch; // 0x90
	FGameplayTagContainer GameplayTags; // 0x98
	FString CachedDescription; // 0xb8
};

struct UMaterialExpressionFontSampleParameter : UMaterialExpressionFontSample {
	FName ParameterName; // 0x50
	FGuid ExpressionGUID; // 0x58
	FName Group; // 0x68
};

struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UBP_SessionData_C : UObject {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
	FBlueprintSessionResult session; // 0x30
	FString Map; // 0x138
	FString Mode; // 0x148
	int32_t Capacity; // 0x158
	int32_t Players; // 0x15c
	bool IsEos; // 0x160
	FString HostAddress; // 0x168
	FString Status; // 0x178
	FString Owner; // 0x188
	UObject* Widget; // 0x198
	bool IsFake; // 0x1a0
	FString ServerId; // 0x1a8
	int32_t BeaconPort; // 0x1b8
	int32_t Ping; // 0x1bc
	UObject* Browser; // 0x1c0
	bool IsCanceled; // 0x1c8
	bool ShouldDelete; // 0x1c9
};

struct UTransformGizmo : UInteractiveGizmo {
	UTransformProxy* ActiveTarget; // 0x40
	bool bSnapToWorldGrid; // 0x48
	bool bGridSizeIsExplicit; // 0x49
	FVector ExplicitGridSize; // 0x4c
	bool bRotationGridSizeIsExplicit; // 0x58
	FRotator ExplicitRotationGridSize; // 0x5c
	bool bSnapToWorldRotGrid; // 0x68
	bool bUseContextCoordinateSystem; // 0x69
	EToolContextCoordinateSystem CurrentCoordinateSystem; // 0x6c
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x100
	TArray<UPrimitiveComponent*> NonuniformScaleComponents; // 0x110
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x120
	UGizmoConstantFrameAxisSource* CameraAxisSource; // 0x140
	UGizmoComponentAxisSource* AxisXSource; // 0x148
	UGizmoComponentAxisSource* AxisYSource; // 0x150
	UGizmoComponentAxisSource* AxisZSource; // 0x158
	UGizmoComponentAxisSource* UnitAxisXSource; // 0x160
	UGizmoComponentAxisSource* UnitAxisYSource; // 0x168
	UGizmoComponentAxisSource* UnitAxisZSource; // 0x170
	UGizmoTransformChangeStateTarget* StateTarget; // 0x178
	UGizmoScaledTransformSource* ScaledTransformSource; // 0x180
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x2]; // 0xf8
	FMovieSceneFloatChannel Rotation; // 0x238
	FMovieSceneFloatChannel Scale[0x2]; // 0x2d8
	FMovieSceneFloatChannel Shear[0x2]; // 0x418
};

struct UInheritableComponentHandler : UObject {
	TArray<FComponentOverrideRecord> Records; // 0x28
	TArray<UActorComponent*> UnnecessaryComponents; // 0x38
};

struct UBrokenTime_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ANewAlarmBP_C*> Out Actors; // 0x128
};

struct UGeometryCollection : UObject {
	TArray<FGeometryCollectionSource> GeometrySource; // 0x30
	TArray<UMaterialInterface*> Materials; // 0x40
	ECollisionTypeEnum CollisionType; // 0x50
	EImplicitTypeEnum ImplicitType; // 0x51
	int32_t MinLevelSetResolution; // 0x54
	int32_t MaxLevelSetResolution; // 0x58
	int32_t MinClusterLevelSetResolution; // 0x5c
	int32_t MaxClusterLevelSetResolution; // 0x60
	float CollisionObjectReductionPercentage; // 0x64
	bool bMassAsDensity; // 0x68
	float Mass; // 0x6c
	float MinimumMassClamp; // 0x70
	float CollisionParticlesFraction; // 0x74
	int32_t MaximumCollisionParticles; // 0x78
	TArray<FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0x80
	bool EnableRemovePiecesOnFracture; // 0x90
	TArray<UMaterialInterface*> RemoveOnFractureMaterials; // 0x98
	FGuid PersistentGuid; // 0xa8
	FGuid StateGuid; // 0xb8
	int32_t BoneSelectedMaterialIndex; // 0xc8
};

struct UMovieSceneObjectPropertyTrack : UMovieScenePropertyTrack {
	UObject* PropertyClass; // 0xb0
};

struct UW_Tutorial_Quest_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UBackgroundBlur* BackgroundBlur_1; // 0x270
	UCanvasPanel* CanvasPanel_Main; // 0x278
	UImage* Image; // 0x280
	UImage* Image_2; // 0x288
	UImage* Image_3; // 0x290
	UImage* Image_4; // 0x298
	UImage* Image_5; // 0x2a0
	UImage* Image_6; // 0x2a8
	UImage* Image_7; // 0x2b0
	UImage* Image_8; // 0x2b8
	UImage* Image_9; // 0x2c0
	UImage* Image_10; // 0x2c8
	UImage* Image_11; // 0x2d0
	UImage* Image_12; // 0x2d8
	UImage* Image_13; // 0x2e0
	UImage* Image_14; // 0x2e8
	UImage* Image_15; // 0x2f0
	UImage* Image_16; // 0x2f8
	UImage* Image_17; // 0x300
	UImage* Image_18; // 0x308
	UImage* Image_19; // 0x310
	UImage* Image_20; // 0x318
	UImage* Image_23; // 0x320
	UImage* Image_24; // 0x328
	UImage* Image_25; // 0x330
	UImage* Image_26; // 0x338
	UImage* Image_27; // 0x340
	UImage* Image_28; // 0x348
	UImage* Image_29; // 0x350
	UImage* Image_30; // 0x358
	UImage* Image_31; // 0x360
	UImage* Image_32; // 0x368
	UImage* Image_33; // 0x370
	UImage* Image_34; // 0x378
	UImage* Image_35; // 0x380
	UImage* Image_36; // 0x388
	UImage* Image_37; // 0x390
	UImage* Image_38; // 0x398
	UImage* Image_39; // 0x3a0
	UImage* Image_40; // 0x3a8
	UImage* Image_41; // 0x3b0
	UImage* Image_42; // 0x3b8
	UImage* Image_43; // 0x3c0
	UImage* Image_44; // 0x3c8
	UImage* Image_45; // 0x3d0
	UImage* Image_46; // 0x3d8
	UImage* Image_47; // 0x3e0
	UImage* Image_48; // 0x3e8
	UImage* Image_49; // 0x3f0
	UImage* Image_50; // 0x3f8
	UImage* Image_110; // 0x400
	UImage* Image_157; // 0x408
	UImage* Image_666; // 0x410
	UImage* Image_BG; // 0x418
	UImage* Image_BG_2; // 0x420
	UImage* Image_Separator; // 0x428
	UImage* Image_SS; // 0x430
	UImage* Image_SS_2; // 0x438
	UImage* Image_SS_3; // 0x440
	UImage* Image_SS_4; // 0x448
	UImage* Image_SS_5; // 0x450
	UImage* Image_SS_6; // 0x458
	UImage* Image_SS_7; // 0x460
	UImage* Image_SS_8; // 0x468
	UImage* Image_SS_9; // 0x470
	UImage* Image_SS_10; // 0x478
	UImage* Image_SS_11; // 0x480
	UImage* Image_SS_12; // 0x488
	UImage* Image_SS_13; // 0x490
	UImage* Image_SS_14; // 0x498
	UImage* Image_SS_15; // 0x4a0
	UImage* Image_SS_16; // 0x4a8
	UOverlay* Overlay_111; // 0x4b0
	UOverlay* Overlay_112; // 0x4b8
	UOverlay* Overlay_113; // 0x4c0
	UOverlay* Overlay_122; // 0x4c8
	UOverlay* Overlay_123; // 0x4d0
	UOverlay* Overlay_127; // 0x4d8
	USizeBox* SizeBox_Button; // 0x4e0
	USizeBox* SizeBox_Button_2; // 0x4e8
	USizeBox* SizeBox_Button_3; // 0x4f0
	USizeBox* SizeBox_Button_4; // 0x4f8
	USizeBox* SizeBox_Button_5; // 0x500
	USizeBox* SizeBox_Button_6; // 0x508
	USizeBox* SizeBox_Button_7; // 0x510
	USizeBox* SizeBox_Button_8; // 0x518
	USizeBox* SizeBox_Button_9; // 0x520
	USizeBox* SizeBox_Button_10; // 0x528
	USizeBox* SizeBox_Button_11; // 0x530
	USizeBox* SizeBox_Button_12; // 0x538
	USizeBox* SizeBox_Button_13; // 0x540
	USizeBox* SizeBox_Button_14; // 0x548
	USizeBox* SizeBox_Button_15; // 0x550
	USizeBox* SizeBox_Button_16; // 0x558
	USizeBox* SizeBox_Button_17; // 0x560
	USizeBox* SizeBox_Button_18; // 0x568
	UTextBlock* Text_Header; // 0x570
	UTextBlock* TextBlock_5; // 0x578
	UTextBlock* TextBlock_6; // 0x580
	UTextBlock* TextBlock_7; // 0x588
	UTextBlock* TextBlock_8; // 0x590
	UTextBlock* TextBlock_9; // 0x598
	UTextBlock* TextBlock_10; // 0x5a0
	UTextBlock* TextBlock_13; // 0x5a8
	UTextBlock* TextBlock_14; // 0x5b0
	UTextBlock* TextBlock_15; // 0x5b8
	UTextBlock* TextBlock_35; // 0x5c0
	UTextBlock* TextBlock_73; // 0x5c8
	UTextBlock* TextBlock_113; // 0x5d0
	UTextBlock* TextBlock_159; // 0x5d8
	UTextBlock* TextBlock_Q1; // 0x5e0
	UTextBlock* TextBlock_Q1_3; // 0x5e8
	UTextBlock* TextBlock_Q1_4; // 0x5f0
	UTextBlock* TextBlock_Q1_6; // 0x5f8
	UTextBlock* TextBlock_Q1_7; // 0x600
	UTextBlock* TextBlock_Q1_8; // 0x608
	UTextBlock* TextBlock_Q1_9; // 0x610
	UTextBlock* TextBlock_Q1_10; // 0x618
	UTextBlock* TextBlock_Q1_11; // 0x620
	UTextBlock* TextBlock_Q1_12; // 0x628
	UTextBlock* TextBlock_Q1_13; // 0x630
	UTextBlock* TextBlock_Q1_14; // 0x638
	UTextBlock* TextBlock_Q1_15; // 0x640
	UTextBlock* TextBlock_Q1_16; // 0x648
	UTextBlock* TextBlock_Q1_17; // 0x650
	UTextBlock* TextBlock_Q1_18; // 0x658
	UTextBlock* TextBlock_Q1_19; // 0x660
	UTextBlock* TextBlock_Q1_20; // 0x668
	UTextBlock* TextBlock_Q1_21; // 0x670
	UTextBlock* TextBlock_Q1_22; // 0x678
	UTextBlock* TextBlock_Q1_23; // 0x680
	UTextBlock* TextBlock_Q1_24; // 0x688
	UTextBlock* TextBlock_Q1_25; // 0x690
	UTextBlock* TextBlock_Q1_26; // 0x698
	UTextBlock* TextBlock_Q1_27; // 0x6a0
	UTextBlock* TextBlock_Q1_28; // 0x6a8
	UTextBlock* TextBlock_Q1_29; // 0x6b0
	UTextBlock* TextBlock_Q1_30; // 0x6b8
	UTextBlock* TextBlock_Q1_31; // 0x6c0
	UTextBlock* TextBlock_Q1_32; // 0x6c8
	UTextBlock* TextBlock_Q1_34; // 0x6d0
	UTextBlock* TextBlock_Q1_35; // 0x6d8
	UTextBlock* TextBlock_Q1_36; // 0x6e0
	UTextBlock* TextBlock_Q1_37; // 0x6e8
	UTextBlock* TextBlock_Q1_59; // 0x6f0
	UTextBlock* TextBlock_Q1_62; // 0x6f8
	UTextBlock* TextBlock_Q1_77; // 0x700
	UTextBlock* TextBlock_Q1_81; // 0x708
	UTextBlock* TextBlock_Q1_83; // 0x710
	UTextBlock* TextBlock_Q1_84; // 0x718
	UTextBlock* TextBlock_Q1_87; // 0x720
	UTextBlock* TextBlock_Q1_91; // 0x728
	UTextBlock* TextBlock_Q1_92; // 0x730
	UTextBlock* TextBlock_Q1_93; // 0x738
	UTextBlock* TextBlock_Q1_96; // 0x740
	UTextBlock* TextBlock_Q1_97; // 0x748
	UTextBlock* TextBlock_Q1_99; // 0x750
	UTextBlock* TextBlock_Q1_101; // 0x758
	UTextBlock* TextBlock_Q1_104; // 0x760
	UTextBlock* TextBlock_Q1_105; // 0x768
	UTextBlock* TextBlock_Q1_106; // 0x770
	UTextBlock* TextBlock_Q1_113; // 0x778
	UTextBlock* TextBlock_Q1_115; // 0x780
	UTextBlock* TextBlock_Q1_118; // 0x788
	UTextBlock* TextBlock_Q1_119; // 0x790
	UTextBlock* TextBlock_Q1_120; // 0x798
	UTextBlock* TextBlock_Q1_121; // 0x7a0
	UTextBlock* TextBlock_Q1_124; // 0x7a8
	UTextBlock* TextBlock_Q1_128; // 0x7b0
	UTextBlock* TextBlock_Q1_131; // 0x7b8
	UTextBlock* TextBlock_StepCount; // 0x7c0
	UWidgetSwitcher* WidgetSwitcher_366; // 0x7c8
	UWidgetSwitcher* WidgetSwitcher_QCheck; // 0x7d0
	UWidgetSwitcher* WidgetSwitcher_QCheck_2; // 0x7d8
	UWidgetSwitcher* WidgetSwitcher_QCheck_3; // 0x7e0
	UWidgetSwitcher* WidgetSwitcher_QCheck_4; // 0x7e8
	UWidgetSwitcher* WidgetSwitcher_QCheck_5; // 0x7f0
	UWidgetSwitcher* WidgetSwitcher_QCheck_6; // 0x7f8
	UWidgetSwitcher* WidgetSwitcher_QCheck_7; // 0x800
	UWidgetSwitcher* WidgetSwitcher_QCheck_8; // 0x808
	UWidgetSwitcher* WidgetSwitcher_QCheck_9; // 0x810
	UWidgetSwitcher* WidgetSwitcher_QCheck_10; // 0x818
	UWidgetSwitcher* WidgetSwitcher_QCheck_11; // 0x820
	UWidgetSwitcher* WidgetSwitcher_QCheck_12; // 0x828
	UWidgetSwitcher* WidgetSwitcher_QCheck_13; // 0x830
	UWidgetSwitcher* WidgetSwitcher_QCheck_14; // 0x838
	UWidgetSwitcher* WidgetSwitcher_QCheck_15; // 0x840
	UWidgetSwitcher* WidgetSwitcher_QCheck_16; // 0x848
	UWidgetSwitcher* WidgetSwitcher_Quest; // 0x850
	TArray<float> Array; // 0x858
	int32_t IndexQuest; // 0x868
	FSlateBrush In Brush; // 0x870
	FSlateBrush In Brush_Full; // 0x8f8
	int32_t NewVar_1; // 0x980
	bool IsSurvTutorEnded; // 0x984
	int32_t StepCounter; // 0x988
};

struct USoundCue : USoundBase {
	char bPrimeOnLoad : 1; // 0x1b8
	USoundNode* FirstNode; // 0x1c0
	float VolumeMultiplier; // 0x1c8
	float PitchMultiplier; // 0x1cc
	FSoundAttenuationSettings AttenuationOverrides; // 0x1d0
	float SubtitlePriority; // 0x570
	char bOverrideAttenuation : 1; // 0x578
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x578
	int32_t CookedQualityIndex; // 0x57c
	char bHasPlayWhenSilent : 1; // 0x580
};

struct UMaterialExpressionAdd : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UEOSCoreEcomQueryOffers : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x148
};

struct UAvoidanceManager : UObject {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct UMicroTransactionBase : UPlatformInterfaceBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x38
	FString LastError; // 0x48
	FString LastErrorSolution; // 0x58
};

struct URuntimeVirtualTexture : UObject {
	int32_t TileCount; // 0x28
	int32_t TileSize; // 0x2c
	int32_t TileBorderSize; // 0x30
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x34
	bool bCompressTextures; // 0x35
	bool bClearTextures; // 0x36
	bool bSinglePhysicalSpace; // 0x37
	bool bPrivateSpace; // 0x38
	bool bAdaptive; // 0x39
	bool bContinuousUpdate; // 0x3a
	int32_t RemoveLowMips; // 0x3c
	TextureGroup LODGroup; // 0x40
	int32_t Size; // 0x44
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
};

struct UFMODAudioComponent : USceneComponent {
	UFMODEvent* Event; // 0x1f8
	TMap<FName, float> ParameterCache; // 0x200
	FString ProgrammerSoundName; // 0x258
	char bEnableTimelineCallbacks : 1; // 0x268
	char bAutoDestroy : 1; // 0x280
	char bStopWhenOwnerDestroyed : 1; // 0x280
	FMulticastInlineDelegate OnEventStopped; // 0x288
	FMulticastInlineDelegate OnTimelineMarker; // 0x298
	FMulticastInlineDelegate OnTimelineBeat; // 0x2a8
	FFMODAttenuationDetails AttenuationDetails; // 0x2b8
	FFMODOcclusionDetails OcclusionDetails; // 0x2c4
};

struct UW_SurvonChair_Banned_C : UUserWidget {
	UProgressBar* HealthProgress; // 0x260
	UImage* Image_148; // 0x268
	USafeZone* SafeZone_235; // 0x270
};

struct UMaterialExpressionScalarParameter : UMaterialExpressionParameter {
	float DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x5c
	char PrimitiveDataIndex; // 0x5d
};

struct ALevelScriptActor : AActor {
	char bInputEnabled : 1; // 0x220
};

struct UListViewBase : UWidget {
	UUserWidget* EntryWidgetClass; // 0x108
	float WheelScrollMultiplier; // 0x110
	bool bEnableScrollAnimation; // 0x114
	bool bEnableFixedLineOffset; // 0x115
	float FixedLineScrollOffset; // 0x118
	FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120
	FMulticastInlineDelegate BP_OnEntryReleased; // 0x130
	FUserWidgetPool EntryWidgetPool; // 0x140
};

struct UAsianGirlIntroAnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x320
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x348
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3f8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x478
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4a8
	bool MvpAnim?; // 0x558
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct USoundfieldEffectBase : UObject {
	USoundfieldEffectSettingsBase* Settings; // 0x28
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x840
	float CheckpointSaveMaxMSPerFrame; // 0x9ec
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xa10
	bool bIsLocalReplay; // 0xa20
	TArray<APlayerController*> SpectatorControllers; // 0xa28
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UInputTouchDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x28
};

struct UMeshSimplificationSettings : UDeveloperSettings {
	FName MeshReductionModuleName; // 0x38
};

struct UDatasmithSpotLightComponentTemplate : UDatasmithObjectTemplate {
	float InnerConeAngle; // 0x30
	float OuterConeAngle; // 0x34
};

struct ULoudnessNRT : UAudioSynesthesiaNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UInputBehaviorSet : UObject {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct UVoiceChatWindow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* VerticalBox_191; // 0x268
	UVoiceChatWindowComponent_C* VoiceChatWindowComponent; // 0x270
	UVoiceChatWindowComponent_C* VoiceChatWindowComponent_2; // 0x278
	UVoiceChatWindowComponent_C* VoiceChatWindowComponent_3; // 0x280
	TArray<APlayerState*> Players; // 0x288
	TArray<UVoiceChatWindowComponent_C*> PlayersVoice; // 0x298
};

struct UVOIPTalker : UActorComponent {
	FVoiceSettings Settings; // 0xb0
};

struct UPaperGroupedSpriteComponent : UMeshComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x468
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x478
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct USourceEffectEnvelopeFollowerPreset : USoundEffectSourcePreset {
	FSourceEffectEnvelopeFollowerSettings Settings; // 0x9c
};

struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x4d0
	int32_t NumCustomDataFloats; // 0x4e0
	TArray<float> PerInstanceSMCustomData; // 0x4e8
	int32_t InstancingRandomSeed; // 0x4f8
	int32_t InstanceStartCullDistance; // 0x4fc
	int32_t InstanceEndCullDistance; // 0x500
	TArray<int32_t> InstanceReorderTable; // 0x508
	int32_t NumPendingLightmaps; // 0x560
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x568
};

struct APaperFlipbookActor : AActor {
	UPaperFlipbookComponent* RenderComponent; // 0x220
};

struct UAsyncTask_LoadXRDeviceVisComponent : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnModelLoaded; // 0x30
	FMulticastInlineDelegate OnLoadFailure; // 0x40
	UPrimitiveComponent* SpawnedComponent; // 0x58
};

struct UFieldSystemMetaDataIteration : UFieldSystemMetaData {
	int32_t Iterations; // 0xb0
};

struct ULevelVariantSets : UObject {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct UMaterialExpressionLandscapeLayerCoords : UMaterialExpression {
	ETerrainCoordMappingType MappingType; // 0x40
	ELandscapeCustomizedCoordType CustomUVType; // 0x41
	float MappingScale; // 0x44
	float MappingRotation; // 0x48
	float MappingPanU; // 0x4c
	float MappingPanV; // 0x50
};

struct AFMODEventLooper_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UFMODAudioComponent* FmodAudio; // 0x228
	float Delay; // 0x230
	UFMODEvent* Event; // 0x238
	bool WithDelay; // 0x240
	bool OverrideAttenuation; // 0x241
	float MinDistance; // 0x244
	float MaxDistance; // 0x248
};

struct UPauseMenu_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ShowNotification; // 0x268
	UWidgetAnimation* HideAllButtons_Anim; // 0x270
	UWidgetAnimation* MoveExit; // 0x278
	UWidgetAnimation* MoveSettings; // 0x280
	UWidgetAnimation* MoveContinue; // 0x288
	UWidgetAnimation* ShowButtons; // 0x290
	UWidgetAnimation* ChangeButtonText_Anim; // 0x298
	UWidgetAnimation* HideMenu_Anim; // 0x2a0
	UWidgetAnimation* FadeAnim; // 0x2a8
	UImage* Background_Mask; // 0x2b0
	UImage* Background_Mask_2; // 0x2b8
	UButton* Button_212; // 0x2c0
	UButton* Button_Back; // 0x2c8
	UButton* Button_DefaultCfg; // 0x2d0
	UCanvasPanel* CanvasPanel_1; // 0x2d8
	UButton* ContinueButton; // 0x2e0
	UButton* ExitButton; // 0x2e8
	UHorizontalBox* HorizontalBox_144; // 0x2f0
	UImage* Image_2; // 0x2f8
	UImage* Image_67; // 0x300
	UImage* Image_93; // 0x308
	UImage* Image_119; // 0x310
	UImage* Image_BackIcon; // 0x318
	UImage* Image_CHover; // 0x320
	UImage* Image_EHover; // 0x328
	UImage* Image_FadeScreen; // 0x330
	UImage* Image_SHover; // 0x338
	UOverlay* Overlay_1; // 0x340
	UOverlay* Overlay_45; // 0x348
	UOverlay* Overlay_89; // 0x350
	UOverlay* Overlay_107; // 0x358
	UOverlay* Overlay_221; // 0x360
	UProgressBar* ProgressBar_109; // 0x368
	UProgressBar* ProgressBar_125; // 0x370
	USafeZone* SafeZone; // 0x378
	USafeZone* SafeZone_4; // 0x380
	USafeZone* SafeZone_5; // 0x388
	USafeZone* SafeZone_6; // 0x390
	USafeZone* SafeZone_7; // 0x398
	USafeZone* SafeZone_8; // 0x3a0
	USafeZone* SafeZone_9; // 0x3a8
	USafeZone* SafeZone_126; // 0x3b0
	UButton* SettingsButton; // 0x3b8
	USizeBox* SizeBox_BackButton; // 0x3c0
	USizeBox* SizeBox_Buttons; // 0x3c8
	UTextBlock* TextBlock_2; // 0x3d0
	UTextBlock* TextBlock_183; // 0x3d8
	UTextBlock* TextBlock_354; // 0x3e0
	UTextBlock* TextBlock_501; // 0x3e8
	UTextBlock* TextBlock_BackButton; // 0x3f0
	UWBP_QuitDialog_C* WBP_QuitDialog; // 0x3f8
	bool Paused?; // 0x400
	bool SettingsOpen?; // 0x401
	UButton* LastKnowFocused; // 0x408
	TArray<UButton*> StyleButtonArray; // 0x410
	TArray<UObject*> StyleButton; // 0x420
	FVector2D ImageSizeButton; // 0x430
	TArray<UTextBlock*> textArray; // 0x438
	bool IsBackButtonHovered; // 0x448
	UButton* HoveredButton; // 0x450
	UWidgetAnimation* Hide All Buttons Anim; // 0x458
	bool BlockPause; // 0x460
	float SliderValueFocus; // 0x464
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct UEdGraphNode_Documentation : UEdGraphNode {
	FString Link; // 0x98
	FString Excerpt; // 0xa8
};

struct AGM_PropHunt_Tutorial_C : AGM_PropHunt_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x370
};

struct UPerkManager_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UPerk_C* Perk1; // 0xb8
	UPerk_C* Perk2; // 0xc0
	UPerk_C* Perk3; // 0xc8
	FString PerksName; // 0xd0
};

struct AGlueOfJarItemsBP_Rare_C : AItemsBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f8
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UChannel : UObject {
	UNetConnection* Connection; // 0x28
};

struct UStaticMeshSimulationComponent : UActorComponent {
	bool Simulating; // 0xb8
	bool bNotifyCollisions; // 0xb9
	EObjectStateTypeEnum ObjectType; // 0xba
	float Mass; // 0xbc
	ECollisionTypeEnum CollisionType; // 0xc0
	EImplicitTypeEnum ImplicitType; // 0xc1
	int32_t MinLevelSetResolution; // 0xc4
	int32_t MaxLevelSetResolution; // 0xc8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xcc
	FVector InitialLinearVelocity; // 0xd0
	FVector InitialAngularVelocity; // 0xdc
	float DamageThreshold; // 0xe8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xf0
	AChaosSolverActor* ChaosSolverActor; // 0xf8
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x100
	TArray<UPrimitiveComponent*> SimulatedComponents; // 0x120
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xde0
	float ServerFlushLogInterval; // 0xde4
	UGameInstance* GameInstance; // 0xde8
};

struct UNiagaraPreviewAxis_InterpParamBase : UNiagaraPreviewAxis {
	FName Param; // 0x28
	int32_t Count; // 0x30
};

struct UIsaacLobbyAnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x320
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x348
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3f8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x478
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x4a8
	ALobbyPlayerMesh_C* LPM; // 0x558
	bool MvpAnim?; // 0x560
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x690
	UAnimInstance* AnimClass; // 0x698
	UAnimInstance* AnimScriptInstance; // 0x6a0
	UAnimInstance* PostProcessAnimInstance; // 0x6a8
	FSingleAnimationPlayData AnimationData; // 0x6b0
	FVector RootBoneTranslation; // 0x6d8
	FVector LineCheckBoundsScale; // 0x6e4
	TArray<UAnimInstance*> LinkedInstances; // 0x720
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x730
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x740
	float GlobalAnimRateScale; // 0x8a0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8a4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8a5
	EAnimationMode AnimationMode; // 0x8a7
	char bDisablePostProcessBlueprint : 1; // 0x8a9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8a9
	char bHasValidBodies : 1; // 0x8a9
	char bBlendPhysics : 1; // 0x8a9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8a9
	char bUpdateJointsFromAnimation : 1; // 0x8a9
	char bDisableClothSimulation : 1; // 0x8aa
	char bDisableRigidBodyAnimNode : 1; // 0x8b0
	char bAllowAnimCurveEvaluation : 1; // 0x8b0
	char bDisableAnimCurves : 1; // 0x8b0
	char bCollideWithEnvironment : 1; // 0x8b0
	char bCollideWithAttachedChildren : 1; // 0x8b1
	char bLocalSpaceSimulation : 1; // 0x8b1
	char bResetAfterTeleport : 1; // 0x8b1
	char bDeferKinematicBoneUpdate : 1; // 0x8b1
	char bNoSkeletonUpdate : 1; // 0x8b1
	char bPauseAnims : 1; // 0x8b1
	char bUseRefPoseOnInitAnim : 1; // 0x8b1
	char bEnablePerPolyCollision : 1; // 0x8b2
	char bForceRefpose : 1; // 0x8b2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8b2
	char bIsAutonomousTickPose : 1; // 0x8b2
	char bOldForceRefPose : 1; // 0x8b2
	char bShowPrePhysBones : 1; // 0x8b2
	char bRequiredBonesUpToDate : 1; // 0x8b2
	char bAnimTreeInitialised : 1; // 0x8b2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8b3
	char bEnableLineCheckWithBounds : 1; // 0x8b3
	char bUseBendingElements : 1; // 0x8b3
	char bUseTetrahedralConstraints : 1; // 0x8b3
	char bUseThinShellVolumeConstraints : 1; // 0x8b3
	char bUseSelfCollisions : 1; // 0x8b3
	char bUseContinuousCollisionDetection : 1; // 0x8b3
	char bPropagateCurvesToSlaves : 1; // 0x8b3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8b4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8b4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8b4
	uint16_t CachedAnimCurveUidVersion; // 0x8b6
	EClothMassMode MassMode; // 0x8b8
	float UniformMass; // 0x8bc
	float TotalMass; // 0x8c0
	float Density; // 0x8c4
	float MinPerParticleMass; // 0x8c8
	float ClothBlendWeight; // 0x8cc
	float EdgeStiffness; // 0x8d0
	float BendingStiffness; // 0x8d4
	float AreaStiffness; // 0x8d8
	float VolumeStiffness; // 0x8dc
	float StrainLimitingStiffness; // 0x8e0
	float ShapeTargetStiffness; // 0x8e4
	bool bWaitForParallelClothTask; // 0x8e8
	TArray<FName> DisallowedAnimCurves; // 0x8f0
	UBodySetup* BodySetup; // 0x900
	FMulticastInlineDelegate OnConstraintBroken; // 0x910
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x920
	float TeleportDistanceThreshold; // 0x9f8
	float TeleportRotationThreshold; // 0x9fc
	uint32_t LastPoseTickFrame; // 0xa08
	UClothingSimulationInteractor* ClothingInteractor; // 0xa60
	FMulticastInlineDelegate OnAnimInitialized; // 0xb30
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x220
	UPrimitiveComponent* TranslateY; // 0x228
	UPrimitiveComponent* TranslateZ; // 0x230
	UPrimitiveComponent* TranslateYZ; // 0x238
	UPrimitiveComponent* TranslateXZ; // 0x240
	UPrimitiveComponent* TranslateXY; // 0x248
	UPrimitiveComponent* RotateX; // 0x250
	UPrimitiveComponent* RotateY; // 0x258
	UPrimitiveComponent* RotateZ; // 0x260
	UPrimitiveComponent* UniformScale; // 0x268
	UPrimitiveComponent* AxisScaleX; // 0x270
	UPrimitiveComponent* AxisScaleY; // 0x278
	UPrimitiveComponent* AxisScaleZ; // 0x280
	UPrimitiveComponent* PlaneScaleYZ; // 0x288
	UPrimitiveComponent* PlaneScaleXZ; // 0x290
	UPrimitiveComponent* PlaneScaleXY; // 0x298
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UAudioAnalyzerNRT : UAudioAnalyzerAsset {
	USoundWave* Sound; // 0x28
	float DurationInSeconds; // 0x30
};

struct UEditableGameplayTagQueryExpression_NoExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UNiagaraDataInterfaceArrayFloat : UNiagaraDataInterfaceArray {
	TArray<float> FloatData; // 0x50
};

struct UWBP_CustomComboBoxEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_Entry; // 0x268
	UCheckBox* CheckBox_MultiValue; // 0x270
	UImage* Image_Selected; // 0x278
	UTextBlock* Text_EntryName; // 0x280
	FText EntryName; // 0x288
	FMulticastInlineDelegate OnClicked; // 0x2a0
	bool IsSelected; // 0x2b0
	FCheckBoxStyle CheckerStyle; // 0x2b8
	FButtonStyle DefaultButtonStyle; // 0x838
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct ULobbyEffectsHUD_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UWidgetAnimation* FadeIn; // 0x270
	UImage* Black; // 0x278
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UGizmoCircleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x460
	float Radius; // 0x46c
	float Thickness; // 0x470
	int32_t NumSides; // 0x474
	bool bViewAligned; // 0x478
	bool bOnlyAllowFrontFacingHits; // 0x479
};

struct AGameModeBase : AInfo {
	FString OptionsString; // 0x220
	AGameSession* GameSessionClass; // 0x230
	AGameStateBase* GameStateClass; // 0x238
	APlayerController* PlayerControllerClass; // 0x240
	APlayerState* PlayerStateClass; // 0x248
	AHUD* HUDClass; // 0x250
	APawn* DefaultPawnClass; // 0x258
	ASpectatorPawn* SpectatorClass; // 0x260
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x268
	AServerStatReplicator* ServerStatReplicatorClass; // 0x270
	AGameSession* GameSession; // 0x278
	AGameStateBase* GameState; // 0x280
	AServerStatReplicator* ServerStatReplicator; // 0x288
	FText DefaultPlayerName; // 0x290
	char bUseSeamlessTravel : 1; // 0x2a8
	char bStartPlayersAsSpectators : 1; // 0x2a8
	char bPauseable : 1; // 0x2a8
};

struct UVampireMaxWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct USurvivorSoundsMaster-2D_C : USurvivorSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf8
	FFMODEventInstance ChasingFMODSound; // 0x100
	FFMODEventInstance LevelAmbient; // 0x108
	float KillerAmbientValue; // 0x110
	float DeltaSeconds; // 0x114
	float NewDelay; // 0x118
	AKillerMasterBP_C* KillerActor; // 0x120
	bool NewCall?; // 0x128
	USoundBase* HeartbeatSound1; // 0x130
	USoundBase* HeartbeatSound2; // 0x138
	bool Stop; // 0x140
	bool chase; // 0x141
	bool chaseb; // 0x142
	bool StopMusic?; // 0x143
	bool NewVar_1; // 0x144
	bool change?; // 0x145
	float ChaseParameter; // 0x148
	float NewChaseParameter; // 0x14c
	bool bAfterChase; // 0x150
	bool AllSoundsCustomStop?; // 0x151
	float Volume; // 0x154
	TArray<AKillerMasterBP_C*> Killers; // 0x158
	float TempFloat1; // 0x168
	float TempFloat2; // 0x16c
	float VolumeZ; // 0x170
	bool bZ; // 0x174
	float DeltaTime; // 0x178
	float KillerRange; // 0x17c
	FFMODEventInstance KillerClose; // 0x180
	float CloseKiller; // 0x188
	float MaxNoiseValue; // 0x18c
	bool NoiseB; // 0x190
	bool LvlAmbBlock; // 0x191
	float NoiseSoundFloat; // 0x194
	float HeartbeatFloat; // 0x198
	FFMODEventInstance HeartBeatFmod; // 0x1a0
	FFMODEventInstance SurvShoulder; // 0x1a8
	FVector KillerLoc; // 0x1b0
	bool LastMan; // 0x1bc
	FFMODEventInstance checkeree228; // 0x1c0
	bool Spectator?; // 0x1c8
};

struct USynthComponent : USceneComponent {
	char bAutoDestroy : 1; // 0x1f8
	char bStopWhenOwnerDestroyed : 1; // 0x1f8
	char bAllowSpatialization : 1; // 0x1f8
	char bOverrideAttenuation : 1; // 0x1f8
	char bOutputToBusOnly : 1; // 0x1fc
	USoundAttenuation* AttenuationSettings; // 0x200
	FSoundAttenuationSettings AttenuationOverrides; // 0x208
	USoundConcurrency* ConcurrencySettings; // 0x5a8
	TSet<USoundConcurrency*> ConcurrencySet; // 0x5b0
	USoundClass* SoundClass; // 0x600
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x608
	USoundSubmixBase* SoundSubmix; // 0x610
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x618
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x628
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x638
	char bIsUISound : 1; // 0x648
	char bIsPreviewSound : 1; // 0x648
	int32_t EnvelopeFollowerAttackTime; // 0x64c
	int32_t EnvelopeFollowerReleaseTime; // 0x650
	FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x658
	USynthSound* Synth; // 0x688
	UAudioComponent* AudioComponent; // 0x690
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x250
	TArray<AOnlineBeaconClient*> ClientActors; // 0x258
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct AVolumetricLightmapDensityVolume : AVolume {
	FInt32Interval AllowedMipLevelRange; // 0x258
};

struct UArchVisCharMovementComponent : UCharacterMovementComponent {
	FRotator RotationalAcceleration; // 0xb00
	FRotator RotationalDeceleration; // 0xb0c
	FRotator MaxRotationalVelocity; // 0xb18
	float MinPitch; // 0xb24
	float MaxPitch; // 0xb28
	float WalkingFriction; // 0xb2c
	float WalkingSpeed; // 0xb30
	float WalkingAcceleration; // 0xb34
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	float ResetFloat; // 0x58
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UProceduralMeshComponent : UMeshComponent {
	bool bUseComplexAsSimpleCollision; // 0x470
	bool bUseAsyncCooking; // 0x471
	UBodySetup* ProcMeshBodySetup; // 0x478
	TArray<FProcMeshSection> ProcMeshSections; // 0x480
	TArray<FKConvexElem> CollisionConvexElems; // 0x490
	FBoxSphereBounds LocalBounds; // 0x4a0
	TArray<UBodySetup*> AsyncBodySetupQueue; // 0x4c0
};

struct USkeletalMeshSimulationComponent : UActorComponent {
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xb8
	AChaosSolverActor* ChaosSolverActor; // 0xc0
	UPhysicsAsset* OverridePhysicsAsset; // 0xc8
	bool bSimulating; // 0xd0
	bool bNotifyCollisions; // 0xd1
	EObjectStateTypeEnum ObjectType; // 0xd2
	float Density; // 0xd4
	float MinMass; // 0xd8
	float MaxMass; // 0xdc
	ECollisionTypeEnum CollisionType; // 0xe0
	float ImplicitShapeParticlesPerUnitArea; // 0xe4
	int32_t ImplicitShapeMinNumParticles; // 0xe8
	int32_t ImplicitShapeMaxNumParticles; // 0xec
	int32_t MinLevelSetResolution; // 0xf0
	int32_t MaxLevelSetResolution; // 0xf4
	int32_t CollisionGroup; // 0xf8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xfc
	FVector InitialLinearVelocity; // 0x100
	FVector InitialAngularVelocity; // 0x10c
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x118
};

struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct APaperTerrainActor : AActor {
	USceneComponent* DummyRoot; // 0x220
	UPaperTerrainSplineComponent* SplineComponent; // 0x228
	UPaperTerrainComponent* RenderComponent; // 0x230
};

struct UBTTaskNode : UBTNode {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct UFMODEventControlSection : UMovieSceneSection {
	FFMODEventControlChannel ControlKeys; // 0xe8
};

struct USequenceCameraShakeCameraStandIn : UObject {
	float FieldOfView; // 0x30
};

struct UFindEOSSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnCallback; // 0x30
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct UDatasmithActorTemplate : UDatasmithObjectTemplate {
	TSet<FName> Layers; // 0x30
	TSet<FName> Tags; // 0x80
};

struct UMovieSceneEventSection : UMovieSceneSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct UWrapBox : UPanelWidget {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	float WrapSize; // 0x12c
	bool bExplicitWrapWidth; // 0x130
	bool bExplicitWrapSize; // 0x131
	EOrientation Orientation; // 0x132
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct UNewATPCCameraFOVObject : UATPCCameraFOVObject {
	bool IsOverride; // 0x38
};

struct UbansheeAnimBp_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0x2f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x318
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x340
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x368
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x390
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x3b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x3e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x408
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x430
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x458
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x480
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x4a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x4d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x4f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x520
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x548
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x570
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x598
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x5c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x5e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x610
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x638
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x660
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x688
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x6b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x6d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x700
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x728
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x750
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x778
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x7a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x7c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x7f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x818
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x840
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x868
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x890
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x8b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x8e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x908
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x930
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x958
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x980
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x9a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x9d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x9f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0xa20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0xa48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0xa70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0xa98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0xac0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0xae8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xb10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xb38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xb60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xb88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xbb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xbd8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xc00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xc28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xc50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xc78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0xca0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0xcc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0xcf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0xd18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0xd40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0xd68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0xd90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xdb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xde0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xe08
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xe30
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xe58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xe80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xea8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xed0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xef8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0xf20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0xf48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xf70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xf98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0xfc0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0xfe8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x1010
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1038
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1060
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1088
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x10b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x10d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1100
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1128
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1150
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1178
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x11a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x11c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x11f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1218
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1240
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1268
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1290
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x12b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x12e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1308
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1388
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x13b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1438
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x14b8
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1558
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1588
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1608
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1638
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1720
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1750
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x17d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1800
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1880
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x18b0
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1930
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1960
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x19e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1a10
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1a90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1ac0
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1b40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1b70
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1bf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1c20
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1ca0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1cd0
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1d50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1d80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1e00
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x1e80
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1f20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1f50
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1fd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2000
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2080
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2120
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x21a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x21d0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2250
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2280
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2300
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x23a0
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2420
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2450
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x24d0
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2500
	FAnimNode_Root AnimGraphNode_Root; // 0x25b0
	float keepSurv; // 0x25e0
	bool IsInAir; // 0x25e4
	float Speed; // 0x25e8
	float Direction; // 0x25ec
	bool AttackBool; // 0x25f0
	bool JumpEndChek; // 0x25f1
	bool FIRE; // 0x25f2
	bool Plant; // 0x25f3
	bool MarioStun; // 0x25f4
	int32_t TypeAttack; // 0x25f8
	bool KnifeIn; // 0x25fc
	bool KnifeSpawn; // 0x25fd
	bool Astral; // 0x25fe
	bool Fly; // 0x25ff
	bool Flashed; // 0x2600
	bool PropHunt?; // 0x2601
	float SpeedRateF; // 0x2604
	float Delta Time X; // 0x2608
	float TimeRun; // 0x260c
	bool Broke Anim; // 0x2610
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UW_PlayCardContent_QuickPlay_C : UW_PlayCardContent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* Button_SearchGame; // 0x270
	UImage* Image; // 0x278
	UImage* Image_90; // 0x280
	UImage* Image_CG_Icon; // 0x288
	UOverlay* Overlay_TeamLeaderOnly; // 0x290
	UOverlay* Overlay_TeamLeaderOnly_2; // 0x298
	USizeBox* SizeBox_54; // 0x2a0
	UTextBlock* Text_Description; // 0x2a8
	UTextBlock* Text_Header; // 0x2b0
	UTextBlock* TextBlock; // 0x2b8
	UTextBlock* TextBlock_4; // 0x2c0
	UW_RoleSelector_C* W_RoleSelector; // 0x2c8
	UBP_BanManager_C* BP Ban Manager; // 0x2d0
	bool Is Banned; // 0x2d8
	float RandomFloat; // 0x2dc
	FButtonStyle SearchGame_DefaultStyle; // 0x2e0
	bool IsSearchGameHovered; // 0x558
};

struct UParticleModuleLocationBoneSocket : UParticleModuleLocationBase {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x5c
	int32_t NumPreSelectedIndices; // 0x64
};

struct ULightPropagationVolumeBlendable : UObject {
	FLightPropagationVolumeSettings Settings; // 0x30
	float BlendWeight; // 0x70
};

struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x428
	char bDrawPolyEdges : 1; // 0x428
	char bDrawFilledPolys : 1; // 0x428
	char bDrawNavMeshEdges : 1; // 0x428
	char bDrawTileBounds : 1; // 0x428
	char bDrawPathCollidingGeometry : 1; // 0x428
	char bDrawTileLabels : 1; // 0x428
	char bDrawPolygonLabels : 1; // 0x428
	char bDrawDefaultPolygonCost : 1; // 0x429
	char bDrawLabelsOnPathNodes : 1; // 0x429
	char bDrawNavLinks : 1; // 0x429
	char bDrawFailedNavLinks : 1; // 0x429
	char bDrawClusters : 1; // 0x429
	char bDrawOctree : 1; // 0x429
	char bDrawOctreeDetails : 1; // 0x429
	char bDrawMarkedForbiddenPolys : 1; // 0x429
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x42a
	float DrawOffset; // 0x42c
	char bFixedTilePoolSize : 1; // 0x430
	int32_t TilePoolSize; // 0x434
	float TileSizeUU; // 0x438
	float CellSize; // 0x43c
	float CellHeight; // 0x440
	float AgentRadius; // 0x444
	float AgentHeight; // 0x448
	float AgentMaxSlope; // 0x44c
	float AgentMaxStepHeight; // 0x450
	float MinRegionArea; // 0x454
	float MergeRegionSize; // 0x458
	float MaxSimplificationError; // 0x45c
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x460
	int32_t TileNumberHardLimit; // 0x464
	int32_t PolyRefTileBits; // 0x468
	int32_t PolyRefNavPolyBits; // 0x46c
	int32_t PolyRefSaltBits; // 0x470
	FVector NavMeshOriginOffset; // 0x474
	float DefaultDrawDistance; // 0x480
	float DefaultMaxSearchNodes; // 0x484
	float DefaultMaxHierarchicalSearchNodes; // 0x488
	ERecastPartitioning RegionPartitioning; // 0x48c
	ERecastPartitioning LayerPartitioning; // 0x48d
	int32_t RegionChunkSplits; // 0x490
	int32_t LayerChunkSplits; // 0x494
	char bSortNavigationAreasByCost : 1; // 0x498
	char bPerformVoxelFiltering : 1; // 0x498
	char bMarkLowHeightAreas : 1; // 0x498
	char bUseExtraTopCellWhenMarkingAreas : 1; // 0x498
	char bFilterLowSpanSequences : 1; // 0x498
	char bFilterLowSpanFromTileCache : 1; // 0x498
	char bDoFullyAsyncNavDataGathering : 1; // 0x498
	char bUseBetterOffsetsFromCorners : 1; // 0x498
	char bStoreEmptyTileLayers : 1; // 0x499
	char bUseVirtualFilters : 1; // 0x499
	char bAllowNavLinkAsPathEnd : 1; // 0x499
	char bUseVoxelCache : 1; // 0x499
	float TileSetUpdateInterval; // 0x49c
	float HeuristicScale; // 0x4a0
	float VerticalDeviationFromGroundCompensation; // 0x4a4
};

struct USourceEffectPhaserPreset : USoundEffectSourcePreset {
	FSourceEffectPhaserSettings Settings; // 0xa0
};

struct UMaterialExpressionSign : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UEOSCoreTitleStorageDeleteCache : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x38
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct UMovieSceneSlomoSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct UMovieSceneCaptureProtocolBase : UObject {
	EMovieSceneCaptureProtocolState State; // 0x50
};

struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bInInteraction; // 0x88
	FVector RotationOrigin; // 0x8c
	FVector RotationAxis; // 0x98
	FVector RotationPlaneX; // 0xa4
	FVector RotationPlaneY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	float InteractionStartAngle; // 0xd4
	float InteractionCurAngle; // 0xd8
};

struct UNiagaraEventReceiverEmitterAction_SpawnParticles : UNiagaraEventReceiverEmitterAction {
	uint32_t NumParticles; // 0x28
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	TArray<FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo; // 0x368
	char bIsLayerThumbnail : 1; // 0x378
	char bDisableTessellation : 1; // 0x378
	char bMobile : 1; // 0x378
	char bEditorToolUsage : 1; // 0x378
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UGrannyKillerWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UMovieSceneTrackInstance : UObject {
	UObject* AnimatedObject; // 0x28
	bool bIsMasterTrackInstance; // 0x30
	UMovieSceneEntitySystemLinker* Linker; // 0x38
	TArray<FMovieSceneTrackInstanceInput> Inputs; // 0x40
};

struct UMaterialExpressionSceneColor : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput OffsetFraction; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct AHDRIBackdrop_C : AActor {
	USkyLightComponent* SkyLight; // 0x220
	UStaticMeshComponent* Geometry; // 0x228
	USceneComponent* SceneComponent; // 0x230
	UTextureCube* Cubemap; // 0x238
	UMaterialInstanceDynamic* MaterialInstance; // 0x240
	float Intensity; // 0x248
	float Size; // 0x24c
	float LightingDistanceFactor; // 0x250
	bool UseCameraProjection; // 0x254
	UStaticMesh* Mesh; // 0x258
	FVector ProjectionCenter; // 0x260
};

struct UMaterialExpressionVertexInterpolator : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UModularSynthComponent : USynthComponent {
	int32_t VoiceCount; // 0x6c0
};

struct UMaterialExpressionHairColor : UMaterialExpression {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct ULuminARCandidateImage : UARCandidateImage {
	bool bUseUnreliablePose; // 0x58
	bool bImageIsStationary; // 0x59
	EMagicLeapImageTargetOrientation AxisOrientation; // 0x5a
};

struct AExit_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* ExitDoor_Lock; // 0x228
	UStaticMeshComponent* ExitDoor_Frame; // 0x230
	UFMODAudioComponent* FMODLoopAudio3; // 0x238
	UBoxComponent* Box4; // 0x240
	UFMODAudioComponent* FMODAudioMus; // 0x248
	UBoxComponent* Box3; // 0x250
	UFMODAudioComponent* FMODDoorOpening; // 0x258
	UFMODAudioComponent* survEnter; // 0x260
	USceneComponent* Scene2; // 0x268
	USceneComponent* Scene1; // 0x270
	UFMODAudioComponent* CurseAudio; // 0x278
	UBoxComponent* KillerBlock; // 0x280
	USceneComponent* StartPoint; // 0x288
	USceneComponent* EndPoint; // 0x290
	UCineCameraComponent* CineCamera; // 0x298
	UBoxComponent* ExitColliderForProps; // 0x2a0
	USceneComponent* ExitPoint; // 0x2a8
	UBoxComponent* CameraBlock; // 0x2b0
	UParticleSystemComponent* FloorSmoke; // 0x2b8
	UParticleSystemComponent* DoorSmoke4; // 0x2c0
	UParticleSystemComponent* DoorSmoke3; // 0x2c8
	UParticleSystemComponent* DoorSmoke2; // 0x2d0
	UParticleSystemComponent* DoorSmoke1; // 0x2d8
	UFMODAudioComponent* FMODChainsAudio; // 0x2e0
	UPointLightComponent* CurseLight; // 0x2e8
	UBoxComponent* Box2; // 0x2f0
	UFMODAudioComponent* FMODLoopAudio2; // 0x2f8
	UFMODAudioComponent* FMODLoopAudio1; // 0x300
	UBoxComponent* Box1; // 0x308
	UStaticMeshComponent* ExitDoor_CHAINS; // 0x310
	USceneComponent* SurvOpenPointHasItem; // 0x318
	USceneComponent* SurvOpenPoint; // 0x320
	UStaticMeshComponent* ExitDoor; // 0x328
	UStaticMeshComponent* ExitDoor_2; // 0x330
	UStaticMeshComponent* ExitDoor_Static; // 0x338
	USceneComponent* Scene; // 0x340
	UFMODAudioComponent* FmodAudio; // 0x348
	UBoxComponent* ExitCollider; // 0x350
	UBoxComponent* Box; // 0x358
	USceneComponent* DefaultSceneRoot; // 0x360
	float DoorLock_Alpha_321FCDA846EA928116F9F48F49B95BE7; // 0x368
	ETimelineDirection DoorLock__Direction_321FCDA846EA928116F9F48F49B95BE7; // 0x36c
	UTimelineComponent* DoorLock; // 0x370
	float Timeline_0_alpha_C016DF65404DECEA15D0BDA804B2F155; // 0x378
	ETimelineDirection Timeline_0__Direction_C016DF65404DECEA15D0BDA804B2F155; // 0x37c
	UTimelineComponent* Timeline_1; // 0x380
	float CameraLerp_Alpha_092B50C44E8C1F47954A0EA779D48FA5; // 0x388
	ETimelineDirection CameraLerp__Direction_092B50C44E8C1F47954A0EA779D48FA5; // 0x38c
	UTimelineComponent* CameraLerp; // 0x390
	float OpenDoorAnimTimeline_Alpha_0AA21B4245F607E33C0455AE3978165C; // 0x398
	ETimelineDirection OpenDoorAnimTimeline__Direction_0AA21B4245F607E33C0455AE3978165C; // 0x39c
	UTimelineComponent* OpenDoorAnimTimeline; // 0x3a0
	float OpenProgress; // 0x3a8
	bool Opens?; // 0x3ac
	bool Opened?; // 0x3ad
	AActor* Actor; // 0x3b0
	bool Block?; // 0x3b8
	float FullOpenProgress; // 0x3bc
	float BoostModeValue; // 0x3c0
	float DeltaSeconds; // 0x3c4
	UMaterialInstanceDynamic* ChainsMaterial; // 0x3c8
	bool TransitionOn; // 0x3d0
	bool TransitionOff; // 0x3d1
	float TransitionTime; // 0x3d4
	float TurnOnDuration; // 0x3d8
	float TurnOffDuration; // 0x3dc
	float InvisRefraction; // 0x3e0
	float InvisRefractionZero; // 0x3e4
	float Float1; // 0x3e8
	float ErodeSubtractDef; // 0x3ec
	float LoopAudioVolume1; // 0x3f0
	float LoopAudioVolume2; // 0x3f4
	float Speed; // 0x3f8
	float SurvBoost; // 0x3fc
	bool Cursed; // 0x400
	TArray<ASurvivorMasterBP_C*> EscapedSurvs; // 0x408
	bool CameraLerp?; // 0x418
	bool Find?; // 0x419
	bool Tutorial?; // 0x41a
	AActor* TeleportPoint; // 0x420
	bool TutorialEnd; // 0x428
	ATutorialTrigger_C* TutorialTrigger; // 0x430
	UMaterialInstanceDynamic* DoorFrame; // 0x438
	int32_t AlarmCount; // 0x440
	bool BlockExit?; // 0x444
};

struct ALightmassPortal : AActor {
	ULightmassPortalComponent* PortalComponent; // 0x220
};

struct UNiagaraDataInterfaceRenderTarget2D : UNiagaraDataInterfaceRWBase {
	FIntPoint Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe0
	char bOverrideFormat : 1; // 0xe1
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x108
};

struct UParticleSystemComponent : UFXSystemComponent {
	UParticleSystem* Template; // 0x440
	TArray<UMaterialInterface*> EmitterMaterials; // 0x448
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x458
	char bResetOnDetach : 1; // 0x469
	char bUpdateOnDedicatedServer : 1; // 0x469
	char bAllowRecycling : 1; // 0x469
	char bAutoManageAttachment : 1; // 0x469
	char bAutoAttachWeldSimulatedBodies : 1; // 0x469
	char bWarmingUp : 1; // 0x46a
	char bOverrideLODMethod : 1; // 0x46a
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x46a
	ParticleSystemLODMethod LODMethod; // 0x475
	EParticleSignificanceLevel RequiredSignificance; // 0x476
	TArray<FParticleSysParam> InstanceParameters; // 0x478
	FMulticastInlineDelegate OnParticleSpawn; // 0x488
	FMulticastInlineDelegate OnParticleBurst; // 0x498
	FMulticastInlineDelegate OnParticleDeath; // 0x4a8
	FMulticastInlineDelegate OnParticleCollide; // 0x4b8
	bool bOldPositionValid; // 0x4c8
	FVector OldPosition; // 0x4cc
	FVector PartSysVelocity; // 0x4d8
	float WarmupTime; // 0x4e4
	float WarmupTickRate; // 0x4e8
	float SecondsBeforeInactive; // 0x4f0
	float MaxTimeBeforeForceUpdateTransform; // 0x4f8
	TArray<UParticleSystemReplay*> ReplayClips; // 0x518
	float CustomTimeDilation; // 0x530
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x588
	FName AutoAttachSocketName; // 0x590
	EAttachmentRule AutoAttachLocationRule; // 0x598
	EAttachmentRule AutoAttachRotationRule; // 0x599
	EAttachmentRule AutoAttachScaleRule; // 0x59a
	FMulticastInlineDelegate OnSystemFinished; // 0x5c8
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UPlaneFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector Position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct UInterpGroup : UObject {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct UPlayMontageCallbackProxy : UObject {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct USoundGroups : UObject {
	TArray<FSoundGroup> SoundGroupProfiles; // 0x28
};

struct UChatWindowText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UWidgetAnimation* FadeIn; // 0x270
	UInvalidationBox* InvalidationBox_85; // 0x278
	UHorizontalBox* MessageBox; // 0x280
	URichTextBlock* Text; // 0x288
	UTextBlock* TypeMessage; // 0x290
	FText NicknameText; // 0x298
	FText MessageText; // 0x2b0
	FText ChatTypeMessage; // 0x2c8
	bool Killer?; // 0x2e0
	FSlateColor Normal; // 0x2e8
	FSlateColor Killer; // 0x310
	FTimerHandle HidingTimerHandler; // 0x338
	FTimerHandle DisplayingTimerHandler; // 0x340
	bool Interrupt; // 0x348
	float HiddenTimeAnimation; // 0x34c
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x30
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x40
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x50
	FSolverIterations SolverIterations; // 0x60
	char bNotForDedicatedServer : 1; // 0x7c
	UThumbnailInfo* ThumbnailInfo; // 0x120
	TArray<UBodySetup*> BodySetup; // 0x128
};

struct UInteractiveToolPropertySet : UObject {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct ASpotLight : ALight {
	USpotLightComponent* SpotLightComponent; // 0x230
};

struct UModelComponent : UPrimitiveComponent {
	UBodySetup* ModelBodySetup; // 0x458
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0xf8
	EARDepthAccuracy DepthAccuracy; // 0xf9
	bool bIsTemporallySmoothed; // 0xfa
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct ANiagaraActor : AActor {
	UNiagaraComponent* NiagaraComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
};

struct UMaterialExpressionGIReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct UBaseBrushTool : UMeshSurfacePointTool {
	UBrushBaseProperties* BrushProperties; // 0xc0
	bool bInBrushStroke; // 0xc8
	float WorldToLocalScale; // 0xcc
	FBrushStampData LastBrushStamp; // 0xd0
	TSoftClassPtr<UObject> PropertyClass; // 0x190
	UBrushStampIndicator* BrushStampIndicator; // 0x1b8
};

struct UMaterialExpressionAtmosphericFogColor : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x448
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x88
	char bNRScaleEmitterTime : 1; // 0xb8
	FRawDistributionVector NoiseSpeed; // 0xc0
	char bSmooth : 1; // 0x108
	float NoiseLockRadius; // 0x10c
	char bNoiseLock : 1; // 0x110
	char bOscillate : 1; // 0x110
	float NoiseLockTime; // 0x114
	float NoiseTension; // 0x118
	char bUseNoiseTangents : 1; // 0x11c
	FRawDistributionFloat NoiseTangentStrength; // 0x120
	int32_t NoiseTessellation; // 0x150
	char bTargetNoise : 1; // 0x154
	float FrequencyDistance; // 0x158
	char bApplyNoiseScale : 1; // 0x15c
	FRawDistributionFloat NoiseScale; // 0x160
};

struct UMaterialExpressionHairAttributes : UMaterialExpression {
	char bUseTangentSpace : 1; // 0x40
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UGeometryCollectionDebugDrawComponent : UActorComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x220
	bool bAutoUpdateBounds; // 0x228
};

struct UBait_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ANewAlarmBP_C*> AlarmsRef; // 0x128
};

struct UW_VictoryScreenText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	USizeBox* SizeBox_1; // 0x268
	UTextBlock* TextBlock_53; // 0x270
	float Alpha; // 0x278
	bool Start?; // 0x27c
};

struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UEndpointSubmix : USoundSubmixBase {
	FName EndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	UAudioEndpointSettingsBase* EndpointSettings; // 0x48
};

struct ARabbit_C : AKillerMasterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1318
	UChargeSpell_C* ChargeSpell; // 0x1320
	UNiagaraComponent* NiagaraChainsawVroom; // 0x1328
	UNiagaraComponent* NiagaraChainsawMain; // 0x1330
	UStaticMeshComponent* RadioFpp; // 0x1338
	UStaticMeshComponent* Radio; // 0x1340
	UFMODAudioComponent* FMODAudio3; // 0x1348
	UBoxComponent* ChainCollusion; // 0x1350
	UFMODAudioComponent* FMODAudio2_1; // 0x1358
	USkeletalMeshComponent* ChainsawFPPMesh; // 0x1360
	USkeletalMeshComponent* ChainsawMesh; // 0x1368
	UToyBomb_C* ToyBomb; // 0x1370
	UChainsaw_C* Chainsaw; // 0x1378
	bool ChargeAttack; // 0x1380
	UFMODAudioComponent* ChargeSound; // 0x1388
	AActor* ChainCollisionActor; // 0x1390
	FFMODEventInstance FmodChainsawTerr; // 0x1398
	bool BChainsawTerror; // 0x13a0
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UGizmoLineHandleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x460
	float HandleSize; // 0x46c
	float Thickness; // 0x470
	FVector Direction; // 0x474
	float Length; // 0x480
	bool bImageScale; // 0x484
};

struct UAnimNotify_PlaySound : UAnimNotify {
	USoundBase* Sound; // 0x38
	float VolumeMultiplier; // 0x40
	float PitchMultiplier; // 0x44
	char bFollow : 1; // 0x48
	FName AttachName; // 0x4c
};

struct UEOSCoreConnectCreateUser : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x258
};

struct UCompositionGraphCaptureProtocol : UMovieSceneImageCaptureProtocolBase {
	FCompositionGraphCapturePasses IncludeRenderPasses; // 0x58
	bool bCaptureFramesInHDR; // 0x68
	int32_t HDRCompressionQuality; // 0x6c
	EHDRCaptureGamut CaptureGamut; // 0x70
	FSoftObjectPath PostProcessingMaterial; // 0x78
	bool bDisableScreenPercentage; // 0x90
	UMaterialInterface* PostProcessingMaterialPtr; // 0x98
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UInterpToMovementComponent : UMovementComponent {
	float Duration; // 0xf0
	char bPauseOnImpact : 1; // 0xf4
	bool bSweep; // 0xf8
	ETeleportType TeleportType; // 0xf9
	EInterpToBehaviourType BehaviourType; // 0xfa
	bool bCheckIfStillInWorld; // 0xfb
	char bForceSubStepping : 1; // 0xfc
	FMulticastInlineDelegate OnInterpToReverse; // 0x100
	FMulticastInlineDelegate OnInterpToStop; // 0x110
	FMulticastInlineDelegate OnWaitBeginDelegate; // 0x120
	FMulticastInlineDelegate OnWaitEndDelegate; // 0x130
	FMulticastInlineDelegate OnResetDelegate; // 0x140
	float MaxSimulationTimeStep; // 0x150
	int32_t MaxSimulationIterations; // 0x154
	TArray<FInterpControlPoint> ControlPoints; // 0x158
};

struct UEOSCoreSessionsRejectInvite : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1a0
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct UVariantObjectBinding : UObject {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct UThrobber : UWidget {
	int32_t NumberOfPieces; // 0x108
	bool bAnimateHorizontally; // 0x10c
	bool bAnimateVertically; // 0x10d
	bool bAnimateOpacity; // 0x10e
	USlateBrushAsset* PieceImage; // 0x110
	FSlateBrush Image; // 0x118
};

struct UW_LoadingScreen_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UWidgetAnimation* FadeIn; // 0x270
	UWidgetAnimation* loading; // 0x278
	UImage* BootScreenich; // 0x280
	UImage* Image; // 0x288
	UImage* Image_2; // 0x290
	UImage* Image_3; // 0x298
	UImage* Image_4; // 0x2a0
	UImage* Image_5; // 0x2a8
	UImage* Image_6; // 0x2b0
	UImage* Image_7; // 0x2b8
	UImage* Image_8; // 0x2c0
	UImage* Image_9; // 0x2c8
	UImage* Image_58; // 0x2d0
	UImage* Image_100; // 0x2d8
	UImage* Image_112; // 0x2e0
	UImage* Image_144; // 0x2e8
	UImage* Image_320; // 0x2f0
	UImage* Image_353; // 0x2f8
	UImage* Image_BG; // 0x300
	UImage* Image_BG_2; // 0x308
	UImage* Image_FadeFilter; // 0x310
	UImage* Image_FirstFrame; // 0x318
	UImage* Image_FirstFrame_2; // 0x320
	UImage* Image_FirstFrame_3; // 0x328
	UImage* Image_FirstFrame_4; // 0x330
	UImage* Image_FirstFrame_5; // 0x338
	UImage* Image_LoadBG; // 0x340
	UImage* Image_Progress; // 0x348
	UImage* Image_ProphuntRef; // 0x350
	UProgressBar* ProgressBar_Loading; // 0x358
	USafeZone* SafeZone; // 0x360
	USafeZone* SafeZone_600; // 0x368
	UTextBlock* TextBlock_2; // 0x370
	UTextBlock* TextBlock_3; // 0x378
	UTextBlock* TextBlock_4; // 0x380
	UTextBlock* TextBlock_Des1; // 0x388
	UTextBlock* TextBlock_Des2; // 0x390
	UTextBlock* TextBlock_Des3; // 0x398
	UTextBlock* TextBlock_GameMode; // 0x3a0
	UTextBlock* TextBlock_gameName; // 0x3a8
	UTextBlock* TextBlock_MapName; // 0x3b0
	UWidgetSwitcher* WidgetSwitcher_1; // 0x3b8
	TMap<FString, UTexture2D*> Maps; // 0x3c0
	bool Delete; // 0x410
	FText MapName; // 0x418
	FText ModeName; // 0x430
	FString Map; // 0x448
	TArray<FText> Surv Tips; // 0x458
	TMap<FString, UPaperSprite*> ScreenTips; // 0x468
	UMaterialInstanceDynamic* ProgressMaterial; // 0x4b8
	UTexture2D* Texture; // 0x4c0
	UMediaPlayer* Boot; // 0x4c8
	FFMODEventInstance LoadingSound; // 0x4d0
	FString Map Name; // 0x4d8
};

struct UWBP_PlayWindow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_Cancel; // 0x268
	UCircularThrobber* CircularThrobber_152; // 0x270
	UImage* Image_139; // 0x278
	UImage* Image_248; // 0x280
	UTextBlock* TextBlock_320; // 0x288
};

struct UKillerWalkGrabbedShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UDodger_C : UPerkSurv_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf8
};

struct ABP_ItemSpawnPoint_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UStaticMeshComponent* Cube; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
	UBP_ItemsManager_C* Manager; // 0x238
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct USurvRole_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* NeedHeal; // 0x268
	UImage* Image; // 0x270
	UImage* Image_58; // 0x278
	ASurvivorMasterBP_C* Surv; // 0x280
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct ALootboxShop_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UWidgetComponent* Widget1; // 0x228
	UWidgetComponent* Widget; // 0x230
	USceneComponent* IconPoint; // 0x238
	UFMODAudioComponent* FMODAudioLoop; // 0x240
	UBoxComponent* Box; // 0x248
	UFMODAudioComponent* FMODAudioCloseDoor; // 0x250
	UFMODAudioComponent* FMODAudioBeep; // 0x258
	UFMODAudioComponent* FMODAudioLever; // 0x260
	UStaticMeshComponent* LeverArm; // 0x268
	UStaticMeshComponent* DownDoor; // 0x270
	UStaticMeshComponent* UpDoor; // 0x278
	USceneComponent* SpawnItemPoint; // 0x280
	UStaticMeshComponent* Machine; // 0x288
	USceneComponent* DefaultSceneRoot; // 0x290
	TArray<FName> ItemsName; // 0x298
	TArray<FName> RarityName; // 0x2a8
	TArray<float> ItemsChance; // 0x2b8
	TArray<float> RarityChance; // 0x2c8
	float Random; // 0x2d8
	int32_t FirstIndex; // 0x2dc
	int32_t SecondIndex; // 0x2e0
	int32_t TempInt; // 0x2e4
	FName GetItemName; // 0x2e8
	FName GetRarityName; // 0x2f0
	FName DroppedItem; // 0x2f8
	bool Block?; // 0x300
	AActor* SpawnedItem; // 0x308
	bool ItemSpawned?; // 0x310
	int32_t NeedPoints; // 0x314
	float DeltaTime; // 0x318
	bool ArmDown?; // 0x31c
	bool DoorOpen?; // 0x31d
	UMaterialInstanceDynamic* Lamp1; // 0x320
	UMaterialInstanceDynamic* Lamp2; // 0x328
	UMaterialInstanceDynamic* Lamp3; // 0x330
	UMaterialInstanceDynamic* Lamp4; // 0x338
	UMaterialInstanceDynamic* Lamp5; // 0x340
	UMaterialInstanceDynamic* Lamp6; // 0x348
	UMaterialInstanceDynamic* Moon1; // 0x350
	UMaterialInstanceDynamic* Moon2; // 0x358
	bool MaterialsReady?; // 0x360
	float UpLampsSpeed; // 0x364
	float MoonLampSpeed; // 0x368
	float RandomFlickerValue; // 0x36c
	bool AllOff?; // 0x370
	bool ItemDropped?; // 0x371
	bool First?; // 0x372
	bool Second?; // 0x373
	bool Third?; // 0x374
};

struct UEOSCoreFriendsQueryFriends : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UBPA_RHG_Lobby_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x3a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x3d0
	FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x480
	FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x500
	FAnimNode_StateMachine AnimGraphNode_StateMachine_20; // 0x530
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x5e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x608
	FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x688
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x6b8
	FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x738
	FAnimNode_StateMachine AnimGraphNode_StateMachine_19; // 0x768
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x840
	FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x8c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x8f0
	FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x970
	FAnimNode_StateMachine AnimGraphNode_StateMachine_18; // 0x9a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0xa50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xa78
	FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0xaf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0xb28
	FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0xba8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_17; // 0xbd8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0xc88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xcb0
	FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0xd30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xd60
	FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0xde0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0xe10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xec0
	FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0xf40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xf70
	FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0xff0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0x1020
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x10d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1170
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1220
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1248
	FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x12c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x12f8
	FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0x1378
	FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x13a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1458
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1480
	FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0x1500
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1530
	FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0x15b0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x15e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x16b8
	FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0x1738
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1768
	FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x17e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x1818
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x18c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x18f0
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x1970
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x19a0
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x1a20
	FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x1a50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1b00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1b28
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x1ba8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1bd8
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1c58
	FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x1c88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1d38
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1db8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1de8
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1e68
	FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x1e98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1f48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1fe8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2010
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x2090
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x20c0
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x2140
	FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x2170
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2220
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x22c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x22e8
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x2368
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2398
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x2418
	FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x2448
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x24f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x2598
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x25c0
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2640
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2670
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x26f0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x2720
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x27d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x2870
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2898
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2918
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2948
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x29c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x29f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x2aa8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2b48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2b70
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2bf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2c20
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2ca0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x2cd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2d80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x2e20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2e48
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2ec8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2ef8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2f78
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x2fa8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3058
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x30f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x3198
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x31c0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x3240
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3270
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x32f0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x3320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x33d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x33f8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x3478
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x34a8
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3528
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3558
	SurvChars survChar; // 0x3608
	bool Reset?; // 0x3609
	bool AmericanFootball?; // 0x360a
	bool IsSunshinechris; // 0x360b
	bool IsStreetIrArtist; // 0x360c
	bool IsBaseball; // 0x360d
};

struct UShootProphunt_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AKillerMasterBP_C* Killer; // 0xb8
	bool CD; // 0xc0
	int32_t Ammo; // 0xc4
	bool FIRE; // 0xc8
	FRotator targetRotat; // 0xcc
	float InterpSpeed; // 0xd8
	float ReloadDelay; // 0xdc
	int32_t FullAMMO; // 0xe0
	bool AimRDY; // 0xe4
	float DeltaSec; // 0xe8
	float timeFire; // 0xec
	int32_t Damage; // 0xf0
	float Radius; // 0xf4
	float ReloadTimeA; // 0xf8
	FString SpellName; // 0x100
	bool Shoot?; // 0x110
	bool ShootCD?; // 0x111
};

struct UIpNetDriver : UNetDriver {
	char LogPortUnreach : 1; // 0x748
	char AllowPlayerPortUnreach : 1; // 0x748
	uint32_t MaxPortCountToTry; // 0x74c
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x75c
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x760
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x764
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x768
	double MaxSecondsInReceive; // 0x770
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x778
	float ResolutionConnectionTimeout; // 0x77c
};

struct USynthComponentMonoWaveTable : USynthComponent {
	FMulticastInlineDelegate OnTableAltered; // 0x6c0
	FMulticastInlineDelegate OnNumTablesChanged; // 0x6d0
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x6e0
};

struct UDrDolittle_C : UPerkSurv_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf8
};

struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UAudioSettings : UDeveloperSettings {
	FSoftObjectPath DefaultSoundClassName; // 0x38
	FSoftObjectPath DefaultMediaSoundClassName; // 0x50
	FSoftObjectPath DefaultSoundConcurrencyName; // 0x68
	FSoftObjectPath DefaultBaseSoundMix; // 0x80
	FSoftObjectPath VoiPSoundClass; // 0x98
	FSoftObjectPath MasterSubmix; // 0xb0
	FSoftObjectPath ReverbSubmix; // 0xc8
	FSoftObjectPath EQSubmix; // 0xe0
	EVoiceSampleRate VoiPSampleRate; // 0xf8
	float DefaultReverbSendLevel; // 0xfc
	int32_t MaximumConcurrentStreams; // 0x100
	float GlobalMinPitchScale; // 0x104
	float GlobalMaxPitchScale; // 0x108
	TArray<FAudioQualitySettings> QualityLevels; // 0x110
	char bAllowPlayWhenSilent : 1; // 0x120
	char bDisableMasterEQ : 1; // 0x120
	char bAllowCenterChannel3DPanning : 1; // 0x120
	uint32_t NumStoppingSources; // 0x124
	EPanningMethod PanningMethod; // 0x128
	EMonoChannelUpmixMethod MonoChannelUpmixMethod; // 0x129
	FString DialogueFilenameFormat; // 0x130
};

struct UARTrackedQRCode : UARTrackedImage {
	FString QRCode; // 0x108
	int32_t Version; // 0x118
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x598
};

struct UAnimNotifyState_Trail : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	ETrailWidthMode WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	char bRecycleSpawnedSystems : 1; // 0x54
};

struct UFPGrannyAnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_127; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_126; // 0x320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_125; // 0x348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_124; // 0x370
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_123; // 0x398
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_122; // 0x3c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_121; // 0x3e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_120; // 0x410
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0x438
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0x460
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0x488
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0x4b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0x4d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0x500
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0x528
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0x550
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0x578
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0x5a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0x5c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0x5f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0x618
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0x640
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0x668
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0x690
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0x6b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0x6e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0x708
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0x730
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0x758
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0x780
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x7a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x7d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x7f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x820
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x848
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x870
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x898
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x8c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x8e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x910
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x938
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x960
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x988
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x9b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x9d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0xa00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0xa28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0xa50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0xa78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0xaa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0xac8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0xaf0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0xb18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0xb40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0xb68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0xb90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0xbb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0xbe0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0xc08
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0xc30
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0xc58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0xc80
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0xca8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0xcd0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0xcf8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0xd20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0xd48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0xd70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0xd98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0xdc0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0xde8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0xe10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0xe38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0xe60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0xe88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0xeb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xed8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xf00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xf28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xf50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xf78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xfa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xfc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xff0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0x1018
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0x1040
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0x1068
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0x1090
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0x10b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0x10e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0x1108
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0x1130
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0x1158
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0x1180
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0x11a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0x11d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0x11f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x1220
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x1248
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x1270
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x1298
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x12c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x12e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x1310
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x1338
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x1360
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x1388
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x13b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x13d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x1400
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x1428
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x1450
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1478
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x14a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x14c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x14f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1518
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1540
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1568
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1590
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x15b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x15e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1608
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1630
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1658
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1680
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x16d0
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x1750
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x1780
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x1800
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x1830
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x18b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x18e0
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1960
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1990
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x1a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1a40
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1ac0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x1af0
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x1b70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x1ba0
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1c20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1c50
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x1cd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1d00
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1d80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1db0
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x1e30
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x1ed0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1f98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x2018
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x2098
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x20c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2148
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x21e8
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x2268
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x2298
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x2318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x23e0
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x2460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2490
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x2510
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x2540
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2608
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2688
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x2708
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2738
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x27b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x27e8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2868
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2898
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2918
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2948
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x29c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2a68
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2ae8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2b18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x2b98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2c18
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2cb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x2d58
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2dd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x2e08
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x2e88
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2f28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x2ff0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3070
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x30f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x3120
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x3208
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x3238
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x32e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3388
	float keepSurv; // 0x3408
	bool IsInAir; // 0x340c
	float Speed; // 0x3410
	bool AttackBool; // 0x3414
	bool JumpEndChek; // 0x3415
	bool FIRE; // 0x3416
	bool Plant; // 0x3417
	bool KnifeIn; // 0x3418
	bool KnifeSpawn; // 0x3419
	float Direction; // 0x341c
	bool MarioStun; // 0x3420
	int32_t TypeAttack; // 0x3424
	bool Astral; // 0x3428
	bool Flashed; // 0x3429
	bool PropHunt?; // 0x342a
	float SpeedRateF; // 0x342c
	float TimeRun; // 0x3430
	float Delta Time X; // 0x3434
	bool Broke Anim; // 0x3438
};

struct A3DLobbyMesh_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USkeletalMeshComponent* HammerIntro; // 0x228
	USkeletalMeshComponent* Surv_RedGirls; // 0x230
	USkeletalMeshComponent* Surv_Mable; // 0x238
	USkeletalMeshComponent* Surv_Chris; // 0x240
	USkeletalMeshComponent* Surv_Taiga; // 0x248
	USceneCaptureComponent2D* SceneCaptureComponent2DMasked; // 0x250
	URectLightComponent* RectLight1; // 0x258
	URectLightComponent* RectLight; // 0x260
	USkeletalMeshComponent* Banshee; // 0x268
	UNiagaraComponent* Niagara; // 0x270
	USkeletalMeshComponent* knife; // 0x278
	USkeletalMeshComponent* Doppelganger; // 0x280
	USkeletalMeshComponent* SkeletalMesh; // 0x288
	UPointLightComponent* PointLight; // 0x290
	USkeletalMeshComponent* Surv_Isaac; // 0x298
	USkeletalMeshComponent* Keymaster; // 0x2a0
	USkeletalMeshComponent* Granny; // 0x2a8
	USpringArmComponent* SpringArm; // 0x2b0
	USceneCaptureComponent2D* SceneCaptureComponent2D; // 0x2b8
	USceneComponent* DefaultSceneRoot; // 0x2c0
	bool Killer?; // 0x2c8
	KillerType KillerType; // 0x2c9
	int32_t SurvSkin; // 0x2cc
	SurvChars survChar; // 0x2d0
	SurvChars TrueSurvSkin; // 0x2d1
};

struct UNiagaraDataInterfaceArrayColor : UNiagaraDataInterfaceArray {
	TArray<FLinearColor> ColorData; // 0x50
};

struct UParticleModuleColorScaleOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct USynth2DSlider : UWidget {
	float ValueX; // 0x108
	float ValueY; // 0x10c
	FDelegate ValueXDelegate; // 0x110
	FDelegate ValueYDelegate; // 0x120
	FSynth2DSliderStyle WidgetStyle; // 0x130
	FLinearColor SliderHandleColor; // 0x3e8
	bool IndentHandle; // 0x3f8
	bool Locked; // 0x3f9
	float StepSize; // 0x3fc
	bool IsFocusable; // 0x400
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x408
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x418
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x428
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x438
	FMulticastInlineDelegate OnValueChangedX; // 0x448
	FMulticastInlineDelegate OnValueChangedY; // 0x458
};

struct UWBP_HelpTip_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_Tip; // 0x268
	USizeBox* SizeBox_Content; // 0x270
	UTextBlock* TextBlock_Description; // 0x278
	UTextBlock* TextBlock_Header; // 0x280
	int32_t HintNumber; // 0x288
	bool Killer; // 0x28c
};

struct UInteractiveToolManager : UObject {
	UInteractiveTool* ActiveLeftTool; // 0x30
	UInteractiveTool* ActiveRightTool; // 0x38
	TMap<FString, UInteractiveToolBuilder*> ToolBuilders; // 0x90
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UButtonStyleAsset : UObject {
	FButtonStyle ButtonStyle; // 0x28
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
};

struct USteamNetConnection : UIpConnection {
	bool bIsPassthrough; // 0x1b90
};

struct AMagicLeapARPinRenderer : AActor {
	bool bInfoActorsVisibilityOverride; // 0x220
	TMap<FGuid, AMagicLeapARPinInfoActorBase*> AllInfoActors; // 0x228
	AMagicLeapARPinInfoActorBase* ClassToSpawn; // 0x280
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x220
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UStreamMediaSource : UBaseMediaSource {
	FString StreamUrl; // 0x88
};

struct UGizmoLocalFloatParameterSource : UGizmoBaseFloatParameterSource {
	float Value; // 0x48
	FGizmoFloatParameterChange LastChange; // 0x4c
};

struct USaveUserData_C : USaveGame {
	int32_t SurvSkinID; // 0x28
	TArray<int32_t> SurvSkinArray; // 0x30
	int32_t Exp; // 0x40
	TMap<int32_t, int32_t> CharSelectedSkinIds; // 0x48
	TArray<int32_t> ArrayOfSkinsThatPlayerOwn; // 0x98
	int32_t coins; // 0xa8
	int32_t lootbox; // 0xac
	int32_t OpenedLootBoxCount; // 0xb0
	int32_t SelectedBannerID; // 0xb4
	int32_t GLOBAL_XP; // 0xb8
	int32_t MMR_SURV; // 0xbc
	int32_t MMR_KILLER; // 0xc0
	int32_t TagID; // 0xc4
	bool IsNewSkin; // 0xc8
	bool IsNewBanner; // 0xc9
	bool IsNewTag; // 0xca
	bool IsNewAvatar; // 0xcb
	TMap<int32_t, bool> IsSkinCustomNew; // 0xd0
	TArray<int32_t> BannerThatPlayerOwnArr; // 0x120
	TArray<int32_t> TagsThatPlayerOwnArr; // 0x130
	TArray<int32_t> AvatarThatPlayerOwnArr; // 0x140
	TMap<int32_t, bool> IsAvatarCustomNew; // 0x150
	TMap<int32_t, bool> IsBannerCustomNew; // 0x1a0
	TMap<int32_t, bool> IsTagsCustomNew; // 0x1f0
	int32_t AvatarID; // 0x240
	bool UnlockAllSkins; // 0x244
	bool DisableAllSkin; // 0x245
	bool DltSkin; // 0x246
	bool ResetDot; // 0x247
	int32_t Scrap; // 0x248
	int32_t Mmr; // 0x24c
	int32_t MatchesPlayed; // 0x250
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UDamageTypeMasterBP_C : UDamageType {
	DamageTypeEnum Type; // 0x40
};

struct UEOSCoreLeaderboardsQueryLeaderboardRanks : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct AStunCoin_C : ACoinActor_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f8
};

struct UAnimCurveCompressionSettings : UObject {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct UEnvQueryManager : UAISubsystem {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct UNavMovementComponent : UMovementComponent {
	FNavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x124
	char bUseAccelerationForPaths : 1; // 0x124
	char bUseFixedBrakingDistanceForPaths : 1; // 0x124
	FMovementProperties MovementState; // 0x125
	UObject* PathFollowingComp; // 0x128
};

struct UMaterialBillboardComponent : UPrimitiveComponent {
	TArray<FMaterialSpriteElement> Elements; // 0x440
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct UCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x120
	FDelegate CheckedStateDelegate; // 0x124
	FCheckBoxStyle WidgetStyle; // 0x138
	USlateWidgetStyleAsset* Style; // 0x6b8
	USlateBrushAsset* UncheckedImage; // 0x6c0
	USlateBrushAsset* UncheckedHoveredImage; // 0x6c8
	USlateBrushAsset* UncheckedPressedImage; // 0x6d0
	USlateBrushAsset* CheckedImage; // 0x6d8
	USlateBrushAsset* CheckedHoveredImage; // 0x6e0
	USlateBrushAsset* CheckedPressedImage; // 0x6e8
	USlateBrushAsset* UndeterminedImage; // 0x6f0
	USlateBrushAsset* UndeterminedHoveredImage; // 0x6f8
	USlateBrushAsset* UndeterminedPressedImage; // 0x700
	EHorizontalAlignment HorizontalAlignment; // 0x708
	FMargin Padding; // 0x70c
	FSlateColor BorderBackgroundColor; // 0x720
	EButtonClickMethod ClickMethod; // 0x748
	EButtonTouchMethod TouchMethod; // 0x749
	EButtonPressMethod PressMethod; // 0x74a
	bool IsFocusable; // 0x74b
	FMulticastInlineDelegate OnCheckStateChanged; // 0x750
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	FGuid ObjectGuid; // 0x88
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UW_Banner_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ShowHide_Anim; // 0x268
	UImage* Image_Avatar; // 0x270
	UImage* Image_AvatarBG; // 0x278
	UImage* Image_AvatarFrameBG; // 0x280
	UImage* Image_Banner; // 0x288
	URetainerBox* RetainerBox_1; // 0x290
	USizeBox* SizeBox_38; // 0x298
	UTextBlock* TextBlock_Name; // 0x2a0
	UTextBlock* TextBlock_Tag; // 0x2a8
	UVerticalBox* VerticalBox_text; // 0x2b0
	TSoftObjectPtr<UDataTable> DataTableBanner; // 0x2b8
	TSoftObjectPtr<UDataTable> DataTableAvatar; // 0x2e0
	TSoftObjectPtr<UDataTable> DTTags; // 0x308
	int32_t randomnumber; // 0x330
	UObject* Object_Avatar; // 0x338
	UObject* Object_Banner; // 0x340
	UObject* Object_Tag; // 0x348
	UTexture2D* DefaultBanner; // 0x350
};

struct UGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FGameplayTagTableRow> GameplayTagList; // 0x38
};

struct UDoppelgangerSpell2_C : UKillerSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	TArray<ANewAlarmBP_C*> Alarms; // 0xf0
	TArray<AActor*> SpottedSurvs; // 0x100
};

struct UDoppelgangerSpell1_C : UKillerSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	USkeletalMesh* DefaultSkeletalMesh; // 0xf0
	USkeletalMesh* DefaultSkeletalMeshFPP; // 0xf8
	UAnimInstance* DefaultAnimClassFPP; // 0x100
	UAnimInstance* DefaultAnimClass; // 0x108
	TArray<UMaterialInterface*> DefaultMaterialsFPP; // 0x110
	TArray<UMaterialInterface*> DefaultMaterials; // 0x120
	FTransform DefaultMeshTransform; // 0x130
	FTransform DefaultMeshTransformFPP; // 0x160
	AActor* GetSurvPawn; // 0x190
};

struct UMovieSceneEntitySystemLinker : UObject {
	FMovieSceneEntitySystemGraph SystemGraph; // 0x238
};

struct UQuietHour_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ANewAlarmBP_C*> Alarms; // 0x128
};

struct AWindDirectionalSource : AInfo {
	UWindDirectionalSourceComponent* Component; // 0x220
};

struct UCurveFloat : UCurveBase {
	FRichCurve FloatCurve; // 0x30
	bool bIsEventCurve; // 0xb0
};

struct UEOSCoreEcomQueryEntitlements : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UTextureRenderTargetVolume : UTextureRenderTarget {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t SizeZ; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct UVariant : UObject {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x200
	float LDMaxDrawDistance; // 0x204
	float CachedMaxDrawDistance; // 0x208
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x20c
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x20d
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x20e
	ELightmapType LightmapType; // 0x20f
	char bUseMaxLODAsImposter : 1; // 0x210
	char bBatchImpostersAsInstances : 1; // 0x210
	char bNeverDistanceCull : 1; // 0x210
	char bAlwaysCreatePhysicsState : 1; // 0x210
	char bGenerateOverlapEvents : 1; // 0x211
	char bMultiBodyOverlap : 1; // 0x211
	char bTraceComplexOnMove : 1; // 0x211
	char bReturnMaterialOnMove : 1; // 0x211
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x211
	char bAllowCullDistanceVolume : 1; // 0x211
	char bHasMotionBlurVelocityMeshes : 1; // 0x211
	char bVisibleInReflectionCaptures : 1; // 0x211
	char bVisibleInRealTimeSkyCaptures : 1; // 0x212
	char bVisibleInRayTracing : 1; // 0x212
	char bRenderInMainPass : 1; // 0x212
	char bRenderInDepthPass : 1; // 0x212
	char bReceivesDecals : 1; // 0x212
	char bOwnerNoSee : 1; // 0x212
	char bOnlyOwnerSee : 1; // 0x212
	char bTreatAsBackgroundForOcclusion : 1; // 0x212
	char bUseAsOccluder : 1; // 0x213
	char bSelectable : 1; // 0x213
	char bForceMipStreaming : 1; // 0x213
	char bHasPerInstanceHitProxies : 1; // 0x213
	char CastShadow : 1; // 0x213
	char bAffectDynamicIndirectLighting : 1; // 0x213
	char bAffectDistanceFieldLighting : 1; // 0x213
	char bCastDynamicShadow : 1; // 0x213
	char bCastStaticShadow : 1; // 0x214
	char bCastVolumetricTranslucentShadow : 1; // 0x214
	char bCastContactShadow : 1; // 0x214
	char bSelfShadowOnly : 1; // 0x214
	char bCastFarShadow : 1; // 0x214
	char bCastInsetShadow : 1; // 0x214
	char bCastCinematicShadow : 1; // 0x214
	char bCastHiddenShadow : 1; // 0x214
	char bCastShadowAsTwoSided : 1; // 0x215
	char bLightAsIfStatic : 1; // 0x215
	char bLightAttachmentsAsGroup : 1; // 0x215
	char bExcludeFromLightAttachmentGroup : 1; // 0x215
	char bReceiveMobileCSMShadows : 1; // 0x215
	char bSingleSampleShadowFromStationaryLights : 1; // 0x215
	char bIgnoreRadialImpulse : 1; // 0x215
	char bIgnoreRadialForce : 1; // 0x215
	char bApplyImpulseOnDamage : 1; // 0x216
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x216
	char bFillCollisionUnderneathForNavmesh : 1; // 0x216
	char AlwaysLoadOnClient : 1; // 0x216
	char AlwaysLoadOnServer : 1; // 0x216
	char bUseEditorCompositing : 1; // 0x216
	char bRenderCustomDepth : 1; // 0x216
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x217
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x219
	FLightingChannels LightingChannels; // 0x21a
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x21b
	int32_t CustomDepthStencilValue; // 0x21c
	FCustomPrimitiveData CustomPrimitiveData; // 0x220
	FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x230
	int32_t TranslucencySortPriority; // 0x248
	int32_t VisibilityId; // 0x24c
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x250
	int8_t VirtualTextureLodBias; // 0x260
	int8_t VirtualTextureCullMips; // 0x261
	int8_t VirtualTextureMinCoverage; // 0x262
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x263
	float LpvBiasMultiplier; // 0x268
	float BoundsScale; // 0x274
	TArray<AActor*> MoveIgnoreActors; // 0x288
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x298
	FBodyInstance BodyInstance; // 0x2b8
	FMulticastSparseDelegate OnComponentHit; // 0x410
	FMulticastSparseDelegate OnComponentBeginOverlap; // 0x411
	FMulticastSparseDelegate OnComponentEndOverlap; // 0x412
	FMulticastSparseDelegate OnComponentWake; // 0x413
	FMulticastSparseDelegate OnComponentSleep; // 0x414
	FMulticastSparseDelegate OnBeginCursorOver; // 0x416
	FMulticastSparseDelegate OnEndCursorOver; // 0x417
	FMulticastSparseDelegate OnClicked; // 0x418
	FMulticastSparseDelegate OnReleased; // 0x419
	FMulticastSparseDelegate OnInputTouchBegin; // 0x41a
	FMulticastSparseDelegate OnInputTouchEnd; // 0x41b
	FMulticastSparseDelegate OnInputTouchEnter; // 0x41c
	FMulticastSparseDelegate OnInputTouchLeave; // 0x41d
	UPrimitiveComponent* LODParentPrimitive; // 0x438
};

struct UMovieSceneCompiledDataManager : UObject {
	TMap<int32_t, FMovieSceneSequenceHierarchy> Hierarchies; // 0xd8
	TMap<int32_t, FMovieSceneEvaluationTemplate> TrackTemplates; // 0x128
	TMap<int32_t, FMovieSceneEvaluationField> TrackTemplateFields; // 0x178
	TMap<int32_t, FMovieSceneEntityComponentField> EntityComponentFields; // 0x1c8
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle ButtonStyle; // 0x30
};

struct UNoiseField : UFieldNodeFloat {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct UCrawlShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct ULuminRuntimeSettings : UObject {
	FString PackageName; // 0x28
	FString ApplicationDisplayName; // 0x38
	ELuminFrameTimingHint FrameTimingHint; // 0x48
	bool bProtectedContent; // 0x49
	bool bManualCallToAppReady; // 0x4a
	bool bUseMobileRendering; // 0x4b
	bool bUseVulkan; // 0x4c
	FFilePath Certificate; // 0x50
	FDirectoryPath IconModelPath; // 0x60
	FDirectoryPath IconPortalPath; // 0x70
	FLocalizedIconInfos LocalizedIconInfos; // 0x80
	int32_t VersionCode; // 0x90
	int32_t MinimumAPILevel; // 0x94
	TArray<ELuminPrivilege> AppPrivileges; // 0x98
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8
	FString SpatializationPlugin; // 0xc8
	FString ReverbPlugin; // 0xd8
	FString OcclusionPlugin; // 0xe8
	int32_t SoundCueCookQualityIndex; // 0xf8
	bool bRemoveDebugInfo; // 0xfc
	FDirectoryPath VulkanValidationLayerLibs; // 0x100
	bool bFrameVignette; // 0x110
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x440
	UNavAreaBase* AreaClass; // 0x448
	FColor ShapeColor; // 0x450
	char bDrawOnlyIfSelected : 1; // 0x454
	char bShouldCollideWhenPlacing : 1; // 0x454
	char bDynamicObstacle : 1; // 0x454
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct USmoothSync : UActorComponent {
	float interpolationBackTime; // 0xfc
	ExtrapolationMode ExtrapolationMode; // 0x100
	bool useExtrapolationTimeLimit; // 0x101
	float extrapolationTimeLimit; // 0x104
	bool useExtrapolationDistanceLimit; // 0x108
	float extrapolationDistanceLimit; // 0x10c
	float sendPositionThreshold; // 0x110
	float sendRotationThreshold; // 0x114
	float sendScaleThreshold; // 0x118
	float sendVelocityThreshold; // 0x11c
	float sendAngularVelocityThreshold; // 0x120
	float receivedPositionThreshold; // 0x124
	float receivedRotationThreshold; // 0x128
	float positionSnapThreshold; // 0x12c
	float rotationSnapThreshold; // 0x130
	float scaleSnapThreshold; // 0x134
	float timeSmoothing; // 0x138
	float positionLerpSpeed; // 0x13c
	float rotationLerpSpeed; // 0x140
	float scaleLerpSpeed; // 0x144
	SyncMode syncPosition; // 0x148
	SyncMode syncRotation; // 0x149
	SyncMode syncScale; // 0x14a
	SyncMode syncVelocity; // 0x14b
	SyncMode syncAngularVelocity; // 0x14c
	bool syncMovementMode; // 0x14d
	bool isPositionCompressed; // 0x14e
	bool isRotationCompressed; // 0x14f
	bool isScaleCompressed; // 0x150
	bool isVelocityCompressed; // 0x151
	bool isAngularVelocityCompressed; // 0x152
	float sendRate; // 0x154
	bool isUsingOriginRebasing; // 0x158
	bool alwaysSendOrigin; // 0x159
	USceneComponent* realComponentToSync; // 0x1f8
	float InterpolationTime; // 0x218
	float atRestPositionThreshold; // 0x350
	float atRestRotationThreshold; // 0x354
};

struct UEOSCoreConnectCreateDeviceId : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UTestMovieSceneSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UGenlockedTimecodeProvider : UTimecodeProvider {
	bool bUseGenlockToCount; // 0x30
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x220
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x228
};

struct UDatasmithCineCameraActorTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x30
};

struct UAC_BattlEye_Server_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UO_BEServer_C* BEServer; // 0xb8
	TMap<int32_t, APC_PropHunt_C*> BEPlayers; // 0xc0
};

struct UClothPhysicalMeshDataBase_Legacy : UObject {
	TArray<FVector> Vertices; // 0x28
	TArray<FVector> Normals; // 0x38
	TArray<uint32_t> Indices; // 0x48
	TArray<float> InverseMasses; // 0x58
	TArray<FClothVertBoneData> BoneData; // 0x68
	int32_t NumFixedVerts; // 0x78
	int32_t MaxBoneWeights; // 0x7c
	TArray<uint32_t> SelfCollisionIndices; // 0x80
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	TArray<FSkeletalMaterial> Materials; // 0xd8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xe8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xf8
	FPerPlatformInt MinLOD; // 0x158
	FPerPlatformBool DisableBelowMinLodStripping; // 0x15c
	EAxis SkelMirrorAxis; // 0x15d
	EAxis SkelMirrorFlipAxis; // 0x15e
	char bUseFullPrecisionUVs : 1; // 0x15f
	char bUseHighPrecisionTangentBasis : 1; // 0x15f
	char bHasBeenSimplified : 1; // 0x15f
	char bHasVertexColors : 1; // 0x15f
	char bEnablePerPolyCollision : 1; // 0x15f
	UBodySetup* BodySetup; // 0x160
	UPhysicsAsset* PhysicsAsset; // 0x168
	UPhysicsAsset* ShadowPhysicsAsset; // 0x170
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x178
	TArray<UMorphTarget*> MorphTargets; // 0x188
	UAnimInstance* PostProcessAnimBlueprint; // 0x310
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x318
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x328
	TArray<UAssetUserData*> AssetUserData; // 0x358
	TArray<USkeletalMeshSocket*> Sockets; // 0x368
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x388
};

struct UImgMediaSource : UBaseMediaSource {
	FFrameRate FrameRateOverride; // 0x88
	FString ProxyOverride; // 0x90
	FDirectoryPath SequencePath; // 0xa0
};

struct USplineMeshComponent : UStaticMeshComponent {
	FSplineMeshParams SplineParams; // 0x4d8
	FVector SplineUpDir; // 0x530
	float SplineBoundaryMin; // 0x53c
	FGuid CachedMeshBodySetupGuid; // 0x540
	UBodySetup* BodySetup; // 0x550
	float SplineBoundaryMax; // 0x558
	char bAllowSplineEditingPerInstance : 1; // 0x55c
	char bSmoothInterpRollScale : 1; // 0x55c
	char bMeshDirty : 1; // 0x55c
	ESplineMeshAxis ForwardAxis; // 0x55d
	float VirtualTextureMainPassMaxDrawDistance; // 0x560
};

struct USkeletalMeshSocket : UObject {
	FName SocketName; // 0x28
	FName BoneName; // 0x30
	FVector RelativeLocation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale; // 0x50
	bool bForceAlwaysAnimated; // 0x5c
};

struct UMaterialExpressionFunctionOutput : UMaterialExpression {
	FName OutputName; // 0x40
	FString Description; // 0x48
	int32_t SortPriority; // 0x58
	FExpressionInput A; // 0x5c
	char bLastPreviewed : 1; // 0x70
	FGuid ID; // 0x74
};

struct ATextRenderActor : AActor {
	UTextRenderComponent* TextRender; // 0x220
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct UEOSCoreConnectLinkAccount : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct AHUD_PropHunt_C : AHUD {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	USceneComponent* DefaultSceneRoot; // 0x318
	float Timeline_0_Alpha_BD8370D34F8ED99EECACF0A572FB9267; // 0x320
	ETimelineDirection Timeline_0__Direction_BD8370D34F8ED99EECACF0A572FB9267; // 0x324
	UTimelineComponent* Timeline_1; // 0x328
	USurvivalProgressBarWidget_C* SurvivorProgress; // 0x330
	USurvivalSkillCheckWidget_C* SurvivorSkillCheck; // 0x338
	UCoolDownWBP_C* KillerCooldown; // 0x340
	UW_MiniLobby_C* MiniLobby; // 0x348
	UAlarmsCountWBP_C* AlarmWidget; // 0x350
	USurvStatusWBP_C* SurvStatus; // 0x358
	USurvivalInventoryWidget_C* SurvivorInventory; // 0x360
	UCoolDownWBP_C* SurvivorAbility; // 0x368
	UW_GameResult_C* GameResult; // 0x370
	UW_DevLab_C* DevLab; // 0x378
	UInteractableButtonsWidget_C* InteractableButtonSurv; // 0x380
	UFlashWidget_C* KillerFlash; // 0x388
	UAmmoKillerWBP_C* AmmoKiller; // 0x390
	UInteractableButtonsWidget_C* InteractableButtonKiller; // 0x398
	UCrossHairWBP_C* CrosshairKiller; // 0x3a0
	UWaypointWidget_C* WaypointWidget; // 0x3a8
	UKillerMarked_C* KillerMarked; // 0x3b0
	UPlayersScore_Tab_Stats_C* PlayerScore; // 0x3b8
	UChatWindow_C* ChatWindow; // 0x3c0
	UGeneralSettingWBP_C* Settings; // 0x3c8
	UVoiceChatWindow_C* VoiceChat; // 0x3d0
	UPauseMenu_C* PauseMenu; // 0x3d8
	USurvivalEffectsUI_C* SurvEffectsUI; // 0x3e0
	USurvivalStaminaBarWidget_C* SurvStaminaBar; // 0x3e8
	bool bLocked; // 0x3f0
	UWBP_EffectsWindow_C* EffectWindow; // 0x3f8
	USoundChat_C* SoundChat; // 0x400
	UEffectsHUDWidget_C* EffectsHUD; // 0x408
	UWBP_BDRush_Killer_C* EffectBloodLast; // 0x410
	ULobbyEffectsHUD_C* LobbyEffects; // 0x418
	UFartTimer_C* FartTimer; // 0x420
	UW_VictoryScreen_C* VictoryScreen; // 0x428
	UW_LoadingScreen_C* NewVar_1; // 0x430
	UW_LoadingScreen_C* LoadingScreen; // 0x438
	UWBP_Tip_C* WidgetTip; // 0x440
	UWBP_EliminatedScreen_C* WidgetEliminationScreen; // 0x448
	UWB_Spectator_C* Spectator; // 0x450
	UWBP_LastChance_C* LastChanceWidget; // 0x458
	UWBP_HitMark_KillerAlarm_C* Killer_HitmarkAlarmDone; // 0x460
	UWBP_MVPScreen_C* MVPScreen; // 0x468
	UW_MatchCanceled_C* MatchCanceled; // 0x470
	bool Tutorial?; // 0x478
	UW_VictoryScreen_Tutorial_C* VictoryScreenTutorial; // 0x480
	bool IsGameLoading; // 0x488
	UWBP_InGameBannerScreen_C* InGameBannerScreen; // 0x490
	UWBP_IntroUI_C* IntroUI; // 0x498
	FMulticastInlineDelegate IsGameLoaded; // 0x4a0
};

struct UGameplayTagsDeveloperSettings : UDeveloperSettings {
	FString DeveloperConfigName; // 0x38
	FName FavoriteTagSource; // 0x48
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct UFontImportOptions : UObject {
	FFontImportOptionsData Data; // 0x28
};

struct UVaRestRequestJSON : UObject {
	FMulticastInlineDelegate OnRequestComplete; // 0x28
	FMulticastInlineDelegate OnRequestFail; // 0x38
	int32_t ResponseSize; // 0x88
	FString ResponseContent; // 0x90
	bool bIsValidJsonResponse; // 0xa0
	UVaRestJsonObject* RequestJsonObj; // 0xb0
	UVaRestJsonObject* ResponseJsonObj; // 0xe8
	UVaRestJsonValue* ResponseJsonValue; // 0xf0
};

struct UWBP_FriendEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Throbber_Anim; // 0x268
	UWidgetAnimation* LeftLobby_Hovered_Anim; // 0x270
	UWidgetAnimation* LeftLobby_Anim; // 0x278
	UWidgetAnimation* RejectedHovered_Anim; // 0x280
	UWidgetAnimation* Rejected_Anim; // 0x288
	UWidgetAnimation* StopWaiting_Anim_Delayed; // 0x290
	UWidgetAnimation* StopWaiting_Anim; // 0x298
	UWidgetAnimation* Hover_Anim_Waiting; // 0x2a0
	UWidgetAnimation* Hover_Anim; // 0x2a8
	UWidgetAnimation* Click_Anim; // 0x2b0
	UButton* Button_FriendList; // 0x2b8
	UButton* Button_FriendList_2; // 0x2c0
	UImage* Image_BG; // 0x2c8
	UImage* Image_ButtonIcon; // 0x2d0
	UImage* Image_FriendHover; // 0x2d8
	UImage* Image_TeamMember; // 0x2e0
	UImage* Image_Throbber; // 0x2e8
	URetainerBox* RetainerBox_1; // 0x2f0
	UScrollBox* ScrollBox_1; // 0x2f8
	UTextBlock* Text_Nickname; // 0x300
	UWBP_MiniFriendEntry_ForList_C* WBP_MiniFriendEntry_ForList; // 0x308
	FSteamFriend SteamStruct; // 0x310
	bool IsSendingRequest; // 0x338
	bool IsUnhovered; // 0x339
	bool IsDelayed; // 0x33a
	FMulticastInlineDelegate onAfterDelay; // 0x340
	bool IsForwardDirection; // 0x350
	FTimerHandle AnimTimer; // 0x358
	bool IsInvitationAccepted; // 0x360
	FTimerHandle WaitingTimer; // 0x368
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x220
};

struct UGI_BattlEye_Prophunt_C : UGI_Prophunt_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x8f0
	FString CurrentServerAddress; // 0x8f8
	UO_BEClient_C* BEClient; // 0x908
	bool IsBEInited; // 0x910
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x458
	float CapsuleRadius; // 0x45c
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct UEOSCoreLeaderboardsQueryLeaderboardUserScores : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct AInteractableDoor_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USphereComponent* Sphere; // 0x228
	UBoxComponent* GlassBox_Spell; // 0x230
	UArrowComponent* Arrow; // 0x238
	UBoxComponent* GlassBox; // 0x240
	UParticleSystemComponent* Glass; // 0x248
	UStaticMeshComponent* GlassMesh; // 0x250
	UBoxComponent* InteractableBox; // 0x258
	UWidgetComponent* DoorMark; // 0x260
	UStaticMeshComponent* DoorFrame; // 0x268
	USceneComponent* ParticlePositions; // 0x270
	UParticleSystemComponent* hit; // 0x278
	UParticleSystemComponent* Break; // 0x280
	UBoxComponent* CheckKillerBox; // 0x288
	UDestructibleComponent* door_window_DM; // 0x290
	UBoxComponent* Box; // 0x298
	UStaticMeshComponent* StaticMesh; // 0x2a0
	USceneComponent* DefaultSceneRoot; // 0x2a8
	float OpeningTimeline_DoorOffset_E85DBBC74771E564B66C5393B7E80CEA; // 0x2b0
	float OpeningTimeline_Alpha_E85DBBC74771E564B66C5393B7E80CEA; // 0x2b4
	ETimelineDirection OpeningTimeline__Direction_E85DBBC74771E564B66C5393B7E80CEA; // 0x2b8
	UTimelineComponent* OpeningTimeline; // 0x2c0
	float ClosingTimeline_DoorOffset_C50BA6A345065B62E7B28CA2A9430BC0; // 0x2c8
	float ClosingTimeline_Alpha_C50BA6A345065B62E7B28CA2A9430BC0; // 0x2cc
	ETimelineDirection ClosingTimeline__Direction_C50BA6A345065B62E7B28CA2A9430BC0; // 0x2d0
	UTimelineComponent* ClosingTimeline; // 0x2d8
	bool Closed?; // 0x2e0
	FRotator Rotation; // 0x2e4
	int32_t DoorHP; // 0x2f0
	bool DoorDestroyed?; // 0x2f4
	bool EndAnim?; // 0x2f5
	ASurvivorMasterBP_C* Surv; // 0x2f8
	FRotator RotationTemp; // 0x300
	bool NoChangeDamagedMesh?; // 0x30c
	bool InvertRotation?; // 0x30d
	FVector SurvLocation; // 0x310
	float Impulse Strength; // 0x31c
	bool Glass?; // 0x320
	int32_t CountGlass; // 0x324
	UFMODEvent* Open; // 0x328
	UFMODEvent* Close; // 0x330
	bool TempBool; // 0x338
	UStaticMesh* DamagedMesh; // 0x340
	UStaticMesh* NormalMesh; // 0x348
	bool KillerStun?; // 0x350
	bool IsDelayed; // 0x351
	ASurvivorMasterBP_C* OverlappedSurv; // 0x358
	UStaticMesh* DamegedGlass; // 0x360
	FTimerHandle MaterialEffectEvent; // 0x368
	TArray<UMaterialInstanceDynamic*> Materials; // 0x370
	float EffectTime; // 0x380
	float EffectDuration; // 0x384
	float Float1; // 0x388
};

struct UMovieSceneNiagaraVectorParameterTrack : UMovieSceneNiagaraParameterTrack {
	int32_t ChannelsUsed; // 0xb0
};

struct UChildConnection : UNetConnection {
	UNetConnection* Parent; // 0x1af0
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x68
};

struct UObjectReferencer : UObject {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x440
	FInterpCurveVector SplineInfo; // 0x4b0
	FInterpCurveQuat SplineRotInfo; // 0x4c8
	FInterpCurveVector SplineScaleInfo; // 0x4e0
	FInterpCurveFloat SplineReparamTable; // 0x4f8
	bool bAllowSplineEditingPerInstance; // 0x510
	int32_t ReparamStepsPerSegment; // 0x514
	float Duration; // 0x518
	bool bStationaryEndpoints; // 0x51c
	bool bSplineHasBeenEdited; // 0x51d
	bool bModifiedByConstructionScript; // 0x51e
	bool bInputSplinePointsToConstructionScript; // 0x51f
	bool bDrawDebug; // 0x520
	bool bClosedLoop; // 0x521
	bool bLoopPositionOverride; // 0x522
	float LoopPosition; // 0x524
	FVector DefaultUpVector; // 0x528
};

struct UAnimationDataSourceRegistry : UObject {
	TMap<FName, TWeakObjectPtr<UObject>> DataSources; // 0x28
};

struct UInteractableButtonsWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UHorizontalBox* ButtonsHorizontalBox; // 0x268
	UCanvasPanel* CanvasPanel_1; // 0x270
	TArray<UInteractableButtonsComponentWidget_C*> InteractableButtons; // 0x278
	int32_t DeleteIndex; // 0x288
	bool Found?; // 0x28c
	ASurvivorMasterBP_C* Player; // 0x290
	TArray<AActor*> Actors; // 0x298
	TArray<FString> ActorsText; // 0x2a8
	bool ActorFound?; // 0x2b8
	int32_t DeleteActorIndex; // 0x2bc
	bool PicklockFound?; // 0x2c0
	TArray<UInteractableButtonsComponentWidget_C*> CheckInteractableButtons; // 0x2c8
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct ABanshee_Tutorial_C : ABanshee_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x13e8
	UW_Tutorial_Quest_C* QuestWidget; // 0x13f0
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x340
	float LightFalloffExponent; // 0x344
	float SourceRadius; // 0x348
	float SoftSourceRadius; // 0x34c
	float SourceLength; // 0x350
};

struct UARTrackedPose : UARTrackedGeometry {
	FARPose3D TrackedPose; // 0xf8
};

struct UNightmare_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ANewAlarmBP_C*> Alarms; // 0x128
	TArray<int32_t> RandomAlarmIndex; // 0x138
	TArray<ANewAlarmBP_C*> RandomAlarmsRef; // 0x148
};

struct UParticleModule : UObject {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x270
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x278
	APlayerCameraManager* BaseCamera; // 0x280
	FTransform RelativeTransform; // 0x290
	float BaseFOV; // 0x2c0
	char bAllowMultipleInstances : 1; // 0x2c4
	char bResetWhenRetriggered : 1; // 0x2c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x2c8
	float DistFromCamera; // 0x2d8
};

struct UW_Lobby_ButtonChangeCharacter_C : UUserWidget {
	UTextBlock* ButtonTextBlock; // 0x260
	UHorizontalBox* HorizontalBox_2; // 0x268
	UImage* Image_152; // 0x270
	UTextBlock* Text; // 0x278
	UTextBlock* Text_2; // 0x280
};

struct UProceduralFoliageSpawner : UObject {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct USingleClickInputBehavior : UAnyButtonInputBehavior {
	bool HitTestOnRelease; // 0xc0
};

struct UWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	FGameplayTagQuery TagQueryToMatch; // 0x1f8
	bool bUpdatedToUseQuery; // 0x240
	EGameplayContainerMatchType TagsToMatch; // 0x241
	FGameplayTagContainer GameplayTags; // 0x248
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UChaosDestructionListener : USceneComponent {
	char bIsCollisionEventListeningEnabled : 1; // 0x1f8
	char bIsBreakingEventListeningEnabled : 1; // 0x1f8
	char bIsTrailingEventListeningEnabled : 1; // 0x1f8
	FChaosCollisionEventRequestSettings CollisionEventRequestSettings; // 0x1fc
	FChaosBreakingEventRequestSettings BreakingEventRequestSettings; // 0x214
	FChaosTrailingEventRequestSettings TrailingEventRequestSettings; // 0x22c
	TSet<AChaosSolverActor*> ChaosSolverActors; // 0x248
	TSet<AGeometryCollectionActor*> GeometryCollectionActors; // 0x298
	FMulticastInlineDelegate OnCollisionEvents; // 0x2e8
	FMulticastInlineDelegate OnBreakingEvents; // 0x2f8
	FMulticastInlineDelegate OnTrailingEvents; // 0x308
};

struct ABandwidthTestActor : AActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x220
};

struct URabbitMaxWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UDeadMansChest_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ALootBox_C*> LootboxArray; // 0x128
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct USpell_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	float Cooldown; // 0xb8
	bool Usable; // 0xbc
	FString Name; // 0xc0
	float CurrentCooldown; // 0xd0
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct USafeZone : UContentWidget {
	bool PadLeft; // 0x120
	bool PadRight; // 0x121
	bool PadTop; // 0x122
	bool PadBottom; // 0x123
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x468
	EWidgetTimingPolicy TimingPolicy; // 0x469
	UUserWidget* WidgetClass; // 0x470
	FIntPoint DrawSize; // 0x478
	bool bManuallyRedraw; // 0x480
	bool bRedrawRequested; // 0x481
	float RedrawTime; // 0x484
	FIntPoint CurrentDrawSize; // 0x490
	bool bDrawAtDesiredSize; // 0x498
	FVector2D Pivot; // 0x49c
	bool bReceiveHardwareInput; // 0x4a4
	bool bWindowFocusable; // 0x4a5
	EWindowVisibility WindowVisibility; // 0x4a6
	bool bApplyGammaCorrection; // 0x4a7
	ULocalPlayer* OwnerPlayer; // 0x4a8
	FLinearColor BackgroundColor; // 0x4b0
	FLinearColor TintColorAndOpacity; // 0x4c0
	float OpacityFromTexture; // 0x4d0
	EWidgetBlendMode BlendMode; // 0x4d4
	bool bIsTwoSided; // 0x4d5
	bool TickWhenOffscreen; // 0x4d6
	UBodySetup* BodySetup; // 0x4d8
	UMaterialInterface* TranslucentMaterial; // 0x4e0
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4e8
	UMaterialInterface* OpaqueMaterial; // 0x4f0
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x4f8
	UMaterialInterface* MaskedMaterial; // 0x500
	UMaterialInterface* MaskedMaterial_OneSided; // 0x508
	UTextureRenderTarget2D* RenderTarget; // 0x510
	UMaterialInstanceDynamic* MaterialInstance; // 0x518
	bool bAddedToScreen; // 0x520
	bool bEditTimeUsable; // 0x521
	FName SharedLayerName; // 0x524
	int32_t LayerZOrder; // 0x52c
	EWidgetGeometryMode GeometryMode; // 0x530
	float CylinderArcAngle; // 0x534
	ETickMode TickMode; // 0x538
	UUserWidget* Widget; // 0x560
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UWBP_EffectsWindow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_50; // 0x268
	UImage* Image_145; // 0x270
	UVerticalBox* VerticalBox_84; // 0x278
};

struct UParticleModuleVelocityCone : UParticleModuleVelocityBase {
	FRawDistributionFloat Angle; // 0x38
	FRawDistributionFloat Velocity; // 0x68
	FVector Direction; // 0x98
};

struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; // 0x38
	bool bRequireCurrentFrameData; // 0x3c
};

struct UChaosGameplayEventDispatcher : UChaosEventListenerComponent {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	FAIDistanceType GeometricDistanceType; // 0xd0
	char bUseParametrizedRadius : 1; // 0xd4
	char bUseNavAgentGoalLocation : 1; // 0xd4
	char bPathFindingBasedTest : 1; // 0xd4
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x440
	char bEnableMaterialParameterCaching : 1; // 0x460
};

struct UEOSCoreSessionsUpdateSession : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UGeometryCollectionCache : UObject {
	FRecordedTransformTrack RecordedData; // 0x28
	UGeometryCollection* SupportedCollection; // 0x38
	FGuid CompatibleCollectionState; // 0x40
};

struct UNiagaraComponent : UFXSystemComponent {
	UNiagaraSystem* Asset; // 0x440
	ENiagaraTickBehavior TickBehavior; // 0x448
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x450
	char bForceSolo : 1; // 0x518
	char bEnableGpuComputeDebug : 1; // 0x518
	char bAutoDestroy : 1; // 0x544
	char bRenderingEnabled : 1; // 0x544
	char bAutoManageAttachment : 1; // 0x544
	char bAutoAttachWeldSimulatedBodies : 1; // 0x544
	float MaxTimeBeforeForceUpdateTransform; // 0x548
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x550
	FMulticastInlineDelegate OnSystemFinished; // 0x568
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x578
	FName AutoAttachSocketName; // 0x580
	EAttachmentRule AutoAttachLocationRule; // 0x588
	EAttachmentRule AutoAttachRotationRule; // 0x589
	EAttachmentRule AutoAttachScaleRule; // 0x58a
};

struct APC_PropnightMainMenu : APlayerController {
	FString CBuildID; // 0x5b0
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct AGranny_C : AKillerMasterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1318
	USkeletalMeshComponent* FPPSMInvis; // 0x1320
	USkeletalMeshComponent* MeshInvis; // 0x1328
	UAstral_C* Astral; // 0x1330
	USkeletalMeshComponent* SkeletalMesh; // 0x1338
	UMineSpell_C* MineSpell; // 0x1340
	UFMODAudioComponent* FMODAudio2_1; // 0x1348
	UKnifeShoot_C* KnifeShoot; // 0x1350
	UGrannyAstral_C* GrannyAstral; // 0x1358
	float Timeline_6_0_NewTrack_0_8F17A98B4A22CE5C14557F88A7B533A0; // 0x1360
	ETimelineDirection Timeline_6_0__Direction_8F17A98B4A22CE5C14557F88A7B533A0; // 0x1364
	UTimelineComponent* Timeline_6_1; // 0x1368
	float AstralTimeline_Alpha_5454405F4AD75BD4D8210CA26B2BE808; // 0x1370
	ETimelineDirection AstralTimeline__Direction_5454405F4AD75BD4D8210CA26B2BE808; // 0x1374
	UTimelineComponent* AstralTimeline; // 0x1378
	bool RMB; // 0x1380
	bool AstralBuild; // 0x1381
	bool Move?; // 0x1382
	UMaterialInstanceDynamic* AstralMaterial; // 0x1388
	bool bKSS; // 0x1390
};

struct UNiagaraDataInterfaceLandscape : UNiagaraDataInterface {
	AActor* SourceLandscape; // 0x38
};

struct UGameplayTasksComponent : UActorComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x110
};

struct UMovieSceneSequencePlayer : UObject {
	FMulticastInlineDelegate OnPlay; // 0x410
	FMulticastInlineDelegate OnPlayReverse; // 0x420
	FMulticastInlineDelegate OnStop; // 0x430
	FMulticastInlineDelegate OnPause; // 0x440
	FMulticastInlineDelegate OnFinished; // 0x450
	EMovieScenePlayerStatus Status; // 0x460
	char bReversePlayback : 1; // 0x464
	UMovieSceneSequence* Sequence; // 0x468
	FFrameNumber StartTime; // 0x470
	int32_t DurationFrames; // 0x474
	float DurationSubFrames; // 0x478
	int32_t CurrentNumLoops; // 0x47c
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x480
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x498
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x5e8
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x5f8
	UMovieSceneSequenceTickManager* TickManager; // 0x608
};

struct UTextLayoutWidget : UWidget {
	FShapedTextOptions ShapedTextOptions; // 0x108
	ETextJustify Justification; // 0x10b
	ETextWrappingPolicy WrappingPolicy; // 0x10c
	char AutoWrapText : 1; // 0x10d
	float WrapTextAt; // 0x110
	FMargin Margin; // 0x114
	float LineHeightPercentage; // 0x124
};

struct UWB_KeyBindings_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* Button_DefaultCfg; // 0x268
	UProgressBar* ProgressBar_109; // 0x270
	UScrollBox* ScrollBox_Main; // 0x278
	UTextBlock* TextBlock_6; // 0x280
	TArray<FName> Array_Movement; // 0x288
	TArray<FName> Array_Surv; // 0x298
	TArray<FName> Array_Killers; // 0x2a8
	TArray<FName> Array_Spectator; // 0x2b8
	TArray<FName> Array_Commons; // 0x2c8
	FTransCfgInput_ACTION DefaultCfgActionKeys; // 0x2d8
	FTransCfgInput_AXIS DefaultCfgAxisKeys; // 0x2e8
	TArray<FInputActionKeyMapping> Jump; // 0x2f8
	UWB_BindOverlayHeader_C* W_MovementHeader; // 0x308
	UMouseSensivity_C* W_MouseSens; // 0x310
	float CounterBackspace; // 0x318
	FTimerHandle TimerHandle; // 0x320
	bool isCounterFull?; // 0x328
	UWidget* FocusHovered; // 0x330
	FMulticastInlineDelegate BlockedBind; // 0x338
	TMap<FName, FText> Array_Surv+Killer_MapKeys; // 0x348
};

struct USoundSubmixWithParentBase : USoundSubmixBase {
	USoundSubmixBase* ParentSubmix; // 0x38
};

struct UMaterialExpressionSquareRoot : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UCompositeDataTable : UDataTable {
	TArray<UDataTable*> ParentTables; // 0xb0
	TArray<UDataTable*> OldParentTables; // 0xc0
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UFlashWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOut; // 0x268
	UImage* FlashImage; // 0x270
	UImage* SceneTexture; // 0x278
};

struct UMaterialExpressionParameter : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
};

struct AMine_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UFMODAudioComponent* FmodAudio; // 0x228
	UFMODAudioComponent* Spawn; // 0x230
	UStaticMeshComponent* StaticMesh; // 0x238
	UBoxComponent* Box; // 0x240
	UStaticMeshComponent* Mine; // 0x248
	USceneComponent* DefaultSceneRoot; // 0x250
	float ShootDelay_Lerp_D4090CCF4B323182DE8FF4B79A93D459; // 0x258
	ETimelineDirection ShootDelay__Direction_D4090CCF4B323182DE8FF4B79A93D459; // 0x25c
	UTimelineComponent* ShootDelay; // 0x260
	TArray<ASurvivorMasterBP_C*> Survs; // 0x268
	TArray<ASurvivorMasterBP_C*> TargetSurvs; // 0x278
	bool Block?; // 0x288
	ASurvivorMasterBP_C* Target; // 0x290
	AKillerMasterBP_C* Killer; // 0x298
	float LocalZ; // 0x2a0
	float EaseAlpha; // 0x2a4
	bool EaseUp; // 0x2a8
	TArray<AActor*> Overlapping Actors; // 0x2b0
	float TransitionTime; // 0x2c0
	float TurnOnDuration; // 0x2c4
	float ErodeSubtractDef; // 0x2c8
	float TurnOffDuration; // 0x2cc
	UMaterialInstanceDynamic* matRef; // 0x2d0
	float Float1; // 0x2d8
	bool TurnOff; // 0x2dc
	bool TurnOn; // 0x2dd
};

struct UAISubsystem : UObject {
	UAISystem* AISystem; // 0x30
};

struct URestrictedGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FRestrictedGameplayTagTableRow> RestrictedGameplayTagList; // 0x38
};

struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	ENiagaraSystemSpawnSectionStartBehavior SectionStartBehavior; // 0xe8
	ENiagaraSystemSpawnSectionEvaluateBehavior SectionEvaluateBehavior; // 0xec
	ENiagaraSystemSpawnSectionEndBehavior SectionEndBehavior; // 0xf0
	ENiagaraAgeUpdateMode AgeUpdateMode; // 0xf4
};

struct UBookMark : UBookmarkBase {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct UFixedFrameRateCustomTimeStep : UEngineCustomTimeStep {
	FFrameRate FixedFrameRate; // 0x28
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe8
	UAnimSequence* AnimSequence; // 0x1c0
	UAnimSequenceBase* Animation; // 0x1c8
	float StartOffset; // 0x1d0
	float EndOffset; // 0x1d4
	float PlayRate; // 0x1d8
	char bReverse : 1; // 0x1dc
	FName SlotName; // 0x1e0
	FVector StartLocationOffset; // 0x1e8
	FRotator StartRotationOffset; // 0x1f4
	bool bMatchWithPrevious; // 0x200
	FName MatchedBoneName; // 0x204
	FVector MatchedLocationOffset; // 0x20c
	FRotator MatchedRotationOffset; // 0x218
	bool bMatchTranslation; // 0x224
	bool bMatchIncludeZHeight; // 0x225
	bool bMatchRotationYaw; // 0x226
	bool bMatchRotationPitch; // 0x227
	bool bMatchRotationRoll; // 0x228
};

struct UCrossHairWBP_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* HitAnim; // 0x268
	UWidgetAnimation* ToBigCross; // 0x270
	UCanvasPanel* CanvasPanel_1; // 0x278
	UImage* CrossHair; // 0x280
	UImage* CrossHair_3; // 0x288
	UImage* CrossHair_4; // 0x290
	UImage* CrossHair_5; // 0x298
	UImage* CrossHair_6; // 0x2a0
	UImage* Crosshair_Hit; // 0x2a8
	UImage* Crosshair_Hit_2; // 0x2b0
	UImage* Crosshair_Hit_3; // 0x2b8
	UImage* Crosshair_Hit_4; // 0x2c0
	UImage* Crosshair_Hit_5; // 0x2c8
	UImage* Image_80; // 0x2d0
	bool Hitted?; // 0x2d8
	float Time; // 0x2dc
	AKillerMasterBP_C* KillerRef; // 0x2e0
	float Time_Attak; // 0x2e8
	bool Attack?; // 0x2ec
};

struct UMaterialExpressionBlackBody : UMaterialExpression {
	FExpressionInput Temp; // 0x40
};

struct UTimeSynchronizableMediaSource : UBaseMediaSource {
	bool bUseTimeSynchronization; // 0x88
	int32_t FrameDelay; // 0x8c
	double TimeDelay; // 0x90
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t Row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t Column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct UDatasmithLightComponentTemplate : UDatasmithObjectTemplate {
	char bVisible : 1; // 0x30
	char CastShadows : 1; // 0x34
	char bUseTemperature : 1; // 0x34
	char bUseIESBrightness : 1; // 0x34
	float Intensity; // 0x38
	float Temperature; // 0x3c
	float IESBrightnessScale; // 0x40
	FLinearColor LightColor; // 0x44
	UMaterialInterface* LightFunctionMaterial; // 0x58
	UTextureLightProfile* IESTexture; // 0x60
};

struct UNamedInterfaces : UObject {
	TArray<FNamedInterface> NamedInterfaces; // 0x28
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x38
};

struct UEOSCoreConnectQueryProductUserIdMappings : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UShoot_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AKillerMasterBP_C* Killer; // 0xb8
	bool CD; // 0xc0
	int32_t Ammo; // 0xc4
	bool NewVar_1; // 0xc8
	float DeltaSec; // 0xcc
	bool FIRE; // 0xd0
	bool AimRDY; // 0xd1
	float timeFire; // 0xd4
	FRotator targetRotat; // 0xd8
	float InterpSpeed; // 0xe4
	int32_t Damage; // 0xe8
	float Radius; // 0xec
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct USoundNodeSwitch : USoundNode {
	FName IntParameterName; // 0x48
};

struct ULandscapeGrassType : UObject {
	TArray<FGrassVariety> GrassVarieties; // 0x28
	char bEnableDensityScaling : 1; // 0x38
	UStaticMesh* GrassMesh; // 0x40
	float GrassDensity; // 0x48
	float PlacementJitter; // 0x4c
	int32_t StartCullDistance; // 0x50
	int32_t EndCullDistance; // 0x54
	bool RandomRotation; // 0x58
	bool AlignToSurface; // 0x59
};

struct APartyBeaconHost : AOnlineBeaconHostObject {
	UPartyBeaconState* State; // 0x248
	bool bLogoutOnSessionTimeout; // 0x2b0
	float SessionTimeoutSecs; // 0x2b4
	float TravelSessionTimeoutSecs; // 0x2b8
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7a0
};

struct UInteractiveToolsContext : UObject {
	UInputRouter* InputRouter; // 0x58
	UInteractiveToolManager* ToolManager; // 0x60
	UInteractiveGizmoManager* GizmoManager; // 0x68
	TSoftClassPtr<UObject> ToolManagerClass; // 0x70
};

struct USurvivalEffectsUI_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* StartFadeOut; // 0x268
	UWidgetAnimation* StartFadeIn; // 0x270
	UWidgetAnimation* HitAnim; // 0x278
	UImage* Bleeding; // 0x280
	UImage* Fade; // 0x288
	UImage* hit; // 0x290
	bool Bleeding?; // 0x298
	FLinearColor Bleeding1; // 0x29c
	FLinearColor Bleeding2; // 0x2ac
	bool change?; // 0x2bc
	FLinearColor Normal; // 0x2c0
	bool Faded?; // 0x2d0
};

struct UWBP_SoundChatMiniCooldDown_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* CD_Anim; // 0x268
	float CoolDownTime; // 0x270
};

struct UFieldSystemMetaDataProcessingResolution : UFieldSystemMetaData {
	EFieldResolutionType ResolutionType; // 0xb0
};

struct UTouchInterface : UObject {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UMaterialFunction : UMaterialFunctionInterface {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct UToyBomb_C : UKillerSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	bool BAnim; // 0xf0
};

struct URadialForceComponent : USceneComponent {
	float Radius; // 0x1f8
	ERadialImpulseFalloff Falloff; // 0x1fc
	float ImpulseStrength; // 0x200
	char bImpulseVelChange : 1; // 0x204
	char bIgnoreOwningActor : 1; // 0x204
	float ForceStrength; // 0x208
	float DestructibleDamage; // 0x20c
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x210
};

struct UObservation_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
};

struct UBP_ItemsManager_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	TArray<ABP_ItemSpawnPoint_C*> SpawnPoints; // 0xb8
	TMap<AItemsBP_C*, float> SupportItems; // 0xc8
	TMap<AItemsBP_C*, float> ToolItems; // 0x118
	TArray<FString> SupportItemNames; // 0x168
	TArray<FString> ToolItemNames; // 0x178
	TArray<FS_SpawnItemChanceRange> SupportItemsV2; // 0x188
	TArray<FS_SpawnItemChanceRange> ToolItemsV2; // 0x198
	float Temp; // 0x1a8
};

struct UMaterialExpressionLandscapeLayerWeight : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Layer; // 0x54
	FName ParameterName; // 0x68
	float PreviewWeight; // 0x70
	FVector ConstBase; // 0x74
	FGuid ExpressionGUID; // 0x80
};

struct ALight : AActor {
	ULightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct UPaperSpriteComponent : UMeshComponent {
	UPaperSprite* SourceSprite; // 0x468
	UMaterialInterface* MaterialOverride; // 0x470
	FLinearColor SpriteColor; // 0x478
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28
	uint32_t PoolPrimeSize; // 0x2c
};

struct UDynamicEntryBox : UDynamicEntryBoxBase {
	UUserWidget* EntryWidgetClass; // 0x1d8
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x198
	TArray<FString> ActorGuidStrings; // 0x218
};

struct ULandscapeSplineControlPoint : UObject {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	float Width; // 0x40
	float LayerWidthRatio; // 0x44
	float SideFalloff; // 0x48
	float LeftSideFalloffFactor; // 0x4c
	float RightSideFalloffFactor; // 0x50
	float LeftSideLayerFalloffFactor; // 0x54
	float RightSideLayerFalloffFactor; // 0x58
	float EndFalloff; // 0x5c
	TArray<FLandscapeSplineConnection> ConnectedSegments; // 0x60
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	UControlPointMeshComponent* LocalMeshComponent; // 0xa0
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct UDefaultLevelSequenceInstanceData : UObject {
	AActor* TransformOriginActor; // 0x30
	FTransform TransformOrigin; // 0x40
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct AGlueJarThrow_C : AGrenade_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UStaticMeshComponent* StaticMesh; // 0x240
};

struct UWBP_User_Message_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	FText Messsage; // 0x268
	float ShowAnimationTime; // 0x280
	float ShowTime; // 0x284
};

struct UMaterialExpressionMakeMaterialAttributes : UMaterialExpression {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Metallic; // 0x54
	FExpressionInput Specular; // 0x68
	FExpressionInput Roughness; // 0x7c
	FExpressionInput Anisotropy; // 0x90
	FExpressionInput EmissiveColor; // 0xa4
	FExpressionInput Opacity; // 0xb8
	FExpressionInput OpacityMask; // 0xcc
	FExpressionInput Normal; // 0xe0
	FExpressionInput Tangent; // 0xf4
	FExpressionInput WorldPositionOffset; // 0x108
	FExpressionInput WorldDisplacement; // 0x11c
	FExpressionInput TessellationMultiplier; // 0x130
	FExpressionInput SubsurfaceColor; // 0x144
	FExpressionInput ClearCoat; // 0x158
	FExpressionInput ClearCoatRoughness; // 0x16c
	FExpressionInput AmbientOcclusion; // 0x180
	FExpressionInput Refraction; // 0x194
	FExpressionInput CustomizedUVs[0x8]; // 0x1a8
	FExpressionInput PixelDepthOffset; // 0x248
	FExpressionInput ShadingModel; // 0x25c
};

struct UPhysicsConstraintTemplate : UObject {
	FConstraintInstance DefaultInstance; // 0x28
	TArray<FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1e8
	FConstraintProfileProperties DefaultProfile; // 0x1f8
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct USphereReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadius; // 0x270
	float CaptureDistanceScale; // 0x274
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
};

struct UChainAnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x2f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x370
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x398
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x418
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x448
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x568
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x5e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x618
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x698
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6c8
	bool Charge; // 0x778
	bool Move!; // 0x779
	bool Charge Attack; // 0x77a
	bool BAnim; // 0x77b
	bool FP?; // 0x77c
};

struct UW_PlayCardContent_CustomGame_C : UW_PlayCardContent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UButton* Button_CreateGame; // 0x270
	UButton* Button_ServerBrowser; // 0x278
	UImage* Image_90; // 0x280
	UImage* Image_CG_Icon; // 0x288
	UImage* Image_CG_Icon_2; // 0x290
	UOverlay* Overlay_TeamLeaderOnly; // 0x298
	USizeBox* SizeBox; // 0x2a0
	USizeBox* SizeBox_54; // 0x2a8
	UTextBlock* Text_Description; // 0x2b0
	UTextBlock* Text_Header; // 0x2b8
	UTextBlock* TextBlock; // 0x2c0
	UTextBlock* TextBlock_4; // 0x2c8
	FMulticastInlineDelegate CreateGame_OnClicked; // 0x2d0
	FMulticastInlineDelegate ServerBrowser_OnClicked; // 0x2e0
	bool IsCreateGameHovered; // 0x2f0
	FButtonStyle CreateGame_DefaultStyle; // 0x2f8
};

struct UInterpTrackDirector : UInterpTrack {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x340
	float SourceHeight; // 0x344
	float BarnDoorAngle; // 0x348
	float BarnDoorLength; // 0x34c
	UTexture* SourceTexture; // 0x350
};

struct UEOSCoreSessionsSendInvite : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct USynthComponentToneGenerator : USynthComponent {
	float Frequency; // 0x6c0
	float Volume; // 0x6c4
};

struct UWBP_GameResultHighlight_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Opacity_Anim; // 0x268
	UWidgetAnimation* HoverPosition_Anim; // 0x270
	UWidgetAnimation* ToVoted_Killer_Hovered_Anim; // 0x278
	UWidgetAnimation* ToVoted_Surv_Hovered_Anim; // 0x280
	UWidgetAnimation* VotedPressed_Killer_Anim; // 0x288
	UWidgetAnimation* VotedPressed_Surv_Anim; // 0x290
	UWidgetAnimation* HoverVoted_Killer_Anim_Voted; // 0x298
	UWidgetAnimation* HoverVoted_Surv_Anim_Voted; // 0x2a0
	UWidgetAnimation* HoverVoted_Killer_Anim; // 0x2a8
	UWidgetAnimation* HoverSelf_Killer_Anim; // 0x2b0
	UWidgetAnimation* ToVoted_NotHovered_Anim; // 0x2b8
	UWidgetAnimation* HoverVoted_Surv_Anim; // 0x2c0
	UWidgetAnimation* HoverSelf_Surv_Anim; // 0x2c8
	UButton* Button_Vote; // 0x2d0
	UButton* Button_VoteButton; // 0x2d8
	UImage* Image_Arrow; // 0x2e0
	UImage* Image_AvatarIcon; // 0x2e8
	UImage* Image_BG; // 0x2f0
	UImage* Image_BG_Line; // 0x2f8
	UImage* Image_ButtonClass; // 0x300
	UImage* Image_ButtonDef; // 0x308
	UImage* Image_ButtonDef_2; // 0x310
	UImage* Image_ButtonHovered; // 0x318
	UImage* Image_MVPBorder; // 0x320
	UImage* Image_MVPCrown; // 0x328
	UImage* Image_MVPCrownCircle; // 0x330
	UImage* Image_Separator; // 0x338
	URetainerBox* RetainerBox_Nickname; // 0x340
	URichTextBlock* RichTextBlock_Obj_Killer_2; // 0x348
	URichTextBlock* RichTextBlock_Obj_Killer_3; // 0x350
	URichTextBlock* RichTextBlock_Obj_Killer_4; // 0x358
	URichTextBlock* RichTextBlock_Obj_Surv_2; // 0x360
	URichTextBlock* RichTextBlock_Obj_Surv_3; // 0x368
	URichTextBlock* RichTextBlock_Obj_Surv_4; // 0x370
	UScrollBox* ScrollBox_Nickname; // 0x378
	UTextBlock* Text_Nickname; // 0x380
	UTextBlock* Text_SelfCounter; // 0x388
	UTextBlock* Text_VotedCounter; // 0x390
	bool isKiller; // 0x398
	bool IsSelf; // 0x399
	bool IsVoted; // 0x39a
	bool IsMVP; // 0x39b
	APS_PropHunt_C* PlayerState; // 0x3a0
	bool Hovered; // 0x3a8
	int32_t VoteCounter; // 0x3ac
	bool WasPressed; // 0x3b0
	FMulticastInlineDelegate Voted; // 0x3b8
	FTimerHandle AnimTimer; // 0x3c8
	bool IsForwardDirection; // 0x3d0
	FEndGamePlayerData PlayerInfo; // 0x3d8
};

struct UDistributionVectorConstant : UDistributionVector {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct UW_HelpWindow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* bgblack; // 0x268
	UImage* Image; // 0x270
	UImage* Image_2; // 0x278
	UImage* Image_3; // 0x280
	UImage* Image_4; // 0x288
	UImage* Image_5; // 0x290
	UImage* Image_75; // 0x298
	UImage* Image_150; // 0x2a0
	UImage* Image_189; // 0x2a8
	UImage* Image_297; // 0x2b0
	UImage* Image_586; // 0x2b8
	UImage* Image_Abil1; // 0x2c0
	UImage* Image_Abil1_2; // 0x2c8
	UImage* Image_Abil2; // 0x2d0
	UImage* Image_Abil2_2; // 0x2d8
	UImage* Image_Abil2_3; // 0x2e0
	UImage* Image_Abil3; // 0x2e8
	UImage* Image_Abil3_2; // 0x2f0
	UImage* Image_Abil3_3; // 0x2f8
	UImage* Image_Abil3_4; // 0x300
	UImage* Image_Abil3_5; // 0x308
	UImage* Image_btAbil1; // 0x310
	UImage* Image_btAbil2; // 0x318
	UImage* Image_btAbil3; // 0x320
	UImage* Image_Killer_Ref; // 0x328
	UImage* Image_Surv_Ref; // 0x330
	UTextBlock* TextAbil1; // 0x338
	UTextBlock* TextAbil1_2; // 0x340
	UTextBlock* TextAbil2; // 0x348
	UTextBlock* TextAbil2_2; // 0x350
	UTextBlock* TextAbil2_3; // 0x358
	UTextBlock* TextAbil3; // 0x360
	UTextBlock* TextAbil3_2; // 0x368
	UTextBlock* TextAbil3_3; // 0x370
	UTextBlock* TextAbil3_4; // 0x378
	UTextBlock* TextAbil3_5; // 0x380
	UTextBlock* TextBlock_532; // 0x388
	UTextBlock* TextBlock_696; // 0x390
	UTextBlock* TextDesc1; // 0x398
	UTextBlock* TextDesc1_2; // 0x3a0
	UTextBlock* TextDesc2; // 0x3a8
	UTextBlock* TextDesc2_2; // 0x3b0
	UTextBlock* TextDesc2_3; // 0x3b8
	UTextBlock* TextDesc3; // 0x3c0
	UTextBlock* TextDesc3_2; // 0x3c8
	UTextBlock* TextDesc3_3; // 0x3d0
	UTextBlock* TextDesc3_4; // 0x3d8
	UTextBlock* TextDesc3_5; // 0x3e0
	UWBP_HelpTip_C* WBP_HelpTip_Killer_2; // 0x3e8
	UWBP_HelpTip_C* WBP_HelpTip_Killer_3; // 0x3f0
	UWBP_HelpTip_C* WBP_HelpTip_Killer_4; // 0x3f8
	UWBP_HelpTip_C* WBP_HelpTip_Surv_2; // 0x400
	UWBP_HelpTip_C* WBP_HelpTip_Surv_3; // 0x408
	UWBP_HelpTip_C* WBP_HelpTip_Surv_4; // 0x410
	UWidgetSwitcher* WidgetSwitcher_103; // 0x418
};

struct UParticleModuleTypeDataAnimTrail : UParticleModuleTypeDataBase {
	char bDeadTrailsOnDeactivate : 1; // 0x30
	char bEnablePreviousTangentRecalculation : 1; // 0x30
	char bTangentRecalculationEveryFrame : 1; // 0x30
	float TilingDistance; // 0x34
	float DistanceTessellationStepSize; // 0x38
	float TangentTessellationStepSize; // 0x3c
	float WidthTessellationStepSize; // 0x40
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UPlayerScoreComponentButtonSound_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Click_Anim; // 0x268
	UWidgetAnimation* Hover_Anim; // 0x270
	UImage* Image_Icon_Pressed; // 0x278
	UImage* Image_Icon_Unpressed; // 0x280
	FMulticastInlineDelegate Clicked; // 0x288
	bool IsEnabled; // 0x298
	UPaperSprite* DefaultIcon; // 0x2a0
	UPaperSprite* PressedIcon; // 0x2a8
};

struct UCameraShakeSourceComponent : USceneComponent {
	ECameraShakeAttenuation Attenuation; // 0x1f8
	float InnerAttenuationRadius; // 0x1fc
	float OuterAttenuationRadius; // 0x200
	UCameraShakeBase* CameraShake; // 0x208
	bool bAutoStart; // 0x210
};

struct UARObjectComponent : UARComponent {
	FARObjectUpdatePayload ReplicatedPayload; // 0x280
};

struct UWBP_EndGameLevel_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Opacity_Anim; // 0x268
	UWidgetAnimation* PropboxCoinsAppearance_Anim; // 0x270
	UWidgetAnimation* NewSkin_Anim; // 0x278
	UWidgetAnimation* TotalScoreAppearance_Anim; // 0x280
	UImage* Image; // 0x288
	UImage* Image_43; // 0x290
	UImage* Image_152; // 0x298
	UImage* Image_Lock; // 0x2a0
	UImage* Image_SkinPreview; // 0x2a8
	UOverlay* Overlay_PropboxCoins; // 0x2b0
	URetainerBox* RetainerBox_SkinPreview; // 0x2b8
	UTextBlock* Text_CharacterName; // 0x2c0
	UTextBlock* Text_SkinName; // 0x2c8
	UTextBlock* TextBlock_Level; // 0x2d0
	UTextBlock* TextBlock_PropboxCoins; // 0x2d8
	UTextBlock* TextBlock_TotalScore; // 0x2e0
	UVerticalBox* VerticalBox_Categories; // 0x2e8
	UWBP_LevelProgress_C* WBP_LevelProgress; // 0x2f0
	UMaterialInstanceDynamic* MaterialInstance; // 0x2f8
	FMulticastInlineDelegate OnCalculationFinished; // 0x300
};

struct UPlayFabInsightsAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xe8
	UPlayFabJsonObject* RequestJsonObj; // 0xf0
	UPlayFabJsonObject* ResponseJsonObj; // 0xf8
};

struct AVampire_C : AKillerMasterBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1318
	UNiagaraComponent* NiagaraShadow; // 0x1320
	USpyEyes_C* SpyEyes; // 0x1328
	UFMODAudioComponent* FMODAudio2; // 0x1330
	USphereComponent* BladeDanceSphere; // 0x1338
	UVampireSpell3_C* VampireSpell3; // 0x1340
	USkeletalMeshComponent* WeaponTP; // 0x1348
	USkeletalMeshComponent* WeaponFP; // 0x1350
	UVampireSpell1_C* VampireSpell1; // 0x1358
	UVampireSpell2_C* VampireSpell2; // 0x1360
	float Timeline_7_alpha_350AB93E425F2173709E42BB2943C6BB; // 0x1368
	ETimelineDirection Timeline_7__Direction_350AB93E425F2173709E42BB2943C6BB; // 0x136c
	UTimelineComponent* Timeline_8; // 0x1370
	bool AltAttackAnim?; // 0x1378
	bool AltAttackas; // 0x1379
	UMaterialInstanceDynamic* BloodlustMat; // 0x1380
	TArray<AActor*> BladeDanceSurvs; // 0x1388
};

struct UVirtualTextureBuilder : UObject {
	UVirtualTexture2D* Texture; // 0x28
	uint64_t BuildHash; // 0x30
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x78
};

struct UPerkSurv_C : UPerk_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xd0
	ASurvivorMasterBP_C* Surv; // 0xd8
	bool Perk1Activated; // 0xe0
	bool Perk2Activated; // 0xe1
	bool Perk3Activated; // 0xe2
	int32_t Perk1LVL; // 0xe4
	int32_t Perk2LVL; // 0xe8
	int32_t Perk3LVL; // 0xec
	bool KillerToAll; // 0xf0
	bool bDelayedStun; // 0xf1
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct UGrannyKillerMaxWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UPhysicsConstraintComponent : USceneComponent {
	AActor* ConstraintActor1; // 0x1f8
	FConstrainComponentPropName ComponentName1; // 0x200
	AActor* ConstraintActor2; // 0x208
	FConstrainComponentPropName ComponentName2; // 0x210
	UPhysicsConstraintTemplate* ConstraintSetup; // 0x228
	FMulticastInlineDelegate OnConstraintBroken; // 0x230
	FConstraintInstance ConstraintInstance; // 0x240
};

struct UParticleModuleLocationSkelVertSurface : UParticleModuleLocationBase {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct UMovieSceneSequenceTickManager : UObject {
	TArray<AActor*> SequenceActors; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x38
};

struct USurvivalStaminaBarWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* HUD_JumpOut; // 0x268
	UWidgetAnimation* HUD_JumpIn; // 0x270
	UWidgetAnimation* HideAnim; // 0x278
	UWidgetSwitcher* ButtonsSwitcher; // 0x280
	UImage* Image_327; // 0x288
	UImage* Image_BG; // 0x290
	UProgressBar* Progress; // 0x298
	UProgressBar* Progress_2; // 0x2a0
	USafeZone* SafeZone_167; // 0x2a8
	UW_Lobby_ButtonChangeCharacter_C* W_Lobby_ButtonChangeCharacter; // 0x2b0
	UW_Lobby_WaitPlayers_C* W_Lobby_WaitPlayers; // 0x2b8
	UWBP_Tip_C* WBP_Tip; // 0x2c0
	bool IsAnimPlaying; // 0x2c8
	bool IsAnimInterrupted; // 0x2c9
};

struct UGarbageCollectionSettings : UDeveloperSettings {
	float TimeBetweenPurgingPendingKillObjects; // 0x38
	char FlushStreamingOnGC : 1; // 0x3c
	char AllowParallelGC : 1; // 0x3c
	char IncrementalBeginDestroyEnabled : 1; // 0x3c
	char MultithreadedDestructionEnabled : 1; // 0x3c
	char CreateGCClusters : 1; // 0x3c
	char AssetClusteringEnabled : 1; // 0x3c
	char ActorClusteringEnabled : 1; // 0x3c
	char BlueprintClusteringEnabled : 1; // 0x3c
	char UseDisregardForGCOnDedicatedServers : 1; // 0x3d
	int32_t MinGCClusterSize; // 0x40
	int32_t NumRetriesBeforeForcingGC; // 0x44
	int32_t MaxObjectsNotConsideredByGC; // 0x48
	int32_t SizeOfPermanentObjectPool; // 0x4c
	int32_t MaxObjectsInGame; // 0x50
	int32_t MaxObjectsInEditor; // 0x54
};

struct UParticleModuleAttractorPoint : UParticleModuleAttractorBase {
	FRawDistributionVector Position; // 0x30
	FRawDistributionFloat Range; // 0x78
	FRawDistributionFloat Strength; // 0xa8
	char StrengthByDistance : 1; // 0xd8
	char bAffectBaseVelocity : 1; // 0xd8
	char bOverrideVelocity : 1; // 0xd8
	char bUseWorldSpacePosition : 1; // 0xd8
	char Positive_X : 1; // 0xd8
	char Positive_Y : 1; // 0xd8
	char Positive_Z : 1; // 0xd8
	char Negative_X : 1; // 0xd8
	char Negative_Y : 1; // 0xd9
	char Negative_Z : 1; // 0xd9
};

struct UScaleBox : UContentWidget {
	EStretch Stretch; // 0x120
	EStretchDirection StretchDirection; // 0x121
	float UserSpecifiedScale; // 0x124
	bool IgnoreInheritedScale; // 0x128
};

struct AMagicLeapARPinInfoActor_C : AMagicLeapARPinInfoActorBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UStaticMeshComponent* Right; // 0x240
	UStaticMeshComponent* Forward; // 0x248
	UStaticMeshComponent* Up; // 0x250
	USphereComponent* ValidRadiusVisualizer; // 0x258
	USceneComponent* AxisRoot; // 0x260
	USceneComponent* VisualizerRoot; // 0x268
	UTextRenderComponent* TypeValue; // 0x270
	UTextRenderComponent* TransErrValue; // 0x278
	UTextRenderComponent* RotErrValue; // 0x280
	UTextRenderComponent* ConfidenceValue; // 0x288
	UTextRenderComponent* TransErrLabel; // 0x290
	UTextRenderComponent* RotErrLabel; // 0x298
	UTextRenderComponent* ConfidenceLabel; // 0x2a0
	UTextRenderComponent* PinIDValue; // 0x2a8
	USceneComponent* InfoRoot; // 0x2b0
	USceneComponent* Root; // 0x2b8
	float RotationSmoothSpeed; // 0x2c0
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UMaterialExpressionStep : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct UAnimSingleNodeInstance : UAnimInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2b0
	float FOVAngle; // 0x2b4
	float OrthoWidth; // 0x2b8
	UTextureRenderTarget2D* TextureTarget; // 0x2c0
	ESceneCaptureCompositeMode CompositeMode; // 0x2c8
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x820
	char bOverride_CustomNearClippingPlane : 1; // 0x824
	float CustomNearClippingPlane; // 0x828
	bool bUseCustomProjectionMatrix; // 0x82c
	FMatrix CustomProjectionMatrix; // 0x830
	bool bEnableClipPlane; // 0x870
	FVector ClipPlaneBase; // 0x874
	FVector ClipPlaneNormal; // 0x880
	char bCameraCutThisFrame : 1; // 0x88c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x88c
	bool bDisableFlipCopyGLES; // 0x890
};

struct UBP_ServerReporter_C : UBP_HTTP_Wrapper_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xc0
	FTimerHandle TimerHandle; // 0xc8
	int32_t Players; // 0xd0
	FString Seed; // 0xd8
};

struct UBrushStampIndicator : UInteractiveGizmo {
	float BrushRadius; // 0x38
	float BrushFalloff; // 0x3c
	FVector BrushPosition; // 0x40
	FVector BrushNormal; // 0x4c
	bool bDrawIndicatorLines; // 0x58
	bool bDrawRadiusCircle; // 0x59
	int32_t SampleStepCount; // 0x5c
	FLinearColor LineColor; // 0x60
	float LineThickness; // 0x70
	bool bDepthTested; // 0x74
	bool bDrawSecondaryLines; // 0x75
	float SecondaryLineThickness; // 0x78
	FLinearColor SecondaryLineColor; // 0x7c
	UPrimitiveComponent* AttachedComponent; // 0x90
};

struct USoundSourceBus : USoundWave {
	ESourceBusChannels SourceBusChannels; // 0x370
	float SourceBusDuration; // 0x374
	UAudioBus* AudioBus; // 0x378
	char bAutoDeactivateWhenSilent : 1; // 0x380
};

struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	UVectorField* Field; // 0x38
	bool bTileX; // 0x40
	bool bTileY; // 0x41
	bool bTileZ; // 0x42
};

struct UParticleModuleVelocity_Seeded : UParticleModuleVelocity {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct URegeneration_C : USurvivorSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf8
	bool TestMode?; // 0x100
};

struct ALobbyPlayerMesh_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UNiagaraComponent* NiagaraChainsaw; // 0x228
	USkeletalMeshComponent* VampireWeapon; // 0x230
	USkeletalMeshComponent* Vampire; // 0x238
	USkeletalMeshComponent* Chainsaw; // 0x240
	USkeletalMeshComponent* Rabbit; // 0x248
	USkeletalMeshComponent* EndGameMesh; // 0x250
	USkeletalMeshComponent* RedGirl; // 0x258
	USkeletalMeshComponent* GreenGirl; // 0x260
	USkeletalMeshComponent* NewSurv; // 0x268
	USkeletalMeshComponent* Surv; // 0x270
	USkeletalMeshComponent* AsianGirl; // 0x278
	USkeletalMeshComponent* Hammer_SkeletalMeshComponent0; // 0x280
	USkeletalMeshComponent* Keymaster; // 0x288
	USkeletalMeshComponent* knife_SkeletalMeshComponent0; // 0x290
	USkeletalMeshComponent* Granny; // 0x298
	USkeletalMeshComponent* Doppel_A_Pose_propnight_doppelganger_batterfly_knife_lock_low_SkeletalMeshComponent0; // 0x2a0
	UNiagaraComponent* DoppelNiagaraSystemV3_NiagaraComponent0; // 0x2a8
	USkeletalMeshComponent* Doppel; // 0x2b0
	USkeletalMeshComponent* Banshee; // 0x2b8
	USceneComponent* DefaultSceneRoot; // 0x2c0
	APS_PropHunt_C* Player; // 0x2c8
	LobbyCharacter Character; // 0x2d0
	bool LocalBlock?; // 0x2d1
	bool GameStarted?; // 0x2d2
	bool Surv?; // 0x2d3
	int32_t SkinID; // 0x2d4
	LobbyCharacter Char; // 0x2d8
	bool Scale Lock?; // 0x2d9
	bool DevCheatLBM; // 0x2da
	LobbyCharacter Character_1; // 0x2db
};

struct UGizmoWorldAxisSource : UObject {
	FVector Origin; // 0x30
	int32_t AxisIndex; // 0x3c
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UGizmoLocalVec2ParameterSource : UGizmoBaseVec2ParameterSource {
	FVector2D Value; // 0x48
	FGizmoVec2ParameterChange LastChange; // 0x50
};

struct UPlayer : UObject {
	APlayerController* PlayerController; // 0x30
	int32_t CurrentNetSpeed; // 0x38
	int32_t ConfiguredInternetSpeed; // 0x3c
	int32_t ConfiguredLanSpeed; // 0x40
};

struct UVirtualTexture2D : UTexture2D {
	FVirtualTextureBuildSettings Settings; // 0x100
	bool bContinuousUpdate; // 0x10c
	bool bSinglePhysicalSpace; // 0x10d
};

struct UChaosSolverSettings : UDeveloperSettings {
	FSoftClassPath DefaultChaosSolverActorClass; // 0x40
};

struct ULevelSystem_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AKillerMasterBP_C* KillerRef; // 0xb8
	ASurvivorMasterBP_C* SurvivorRef; // 0xc0
	int32_t LvlNew; // 0xc8
	TArray<int32_t> LvlExp; // 0xd0
	int32_t LvlReal; // 0xe0
	TArray<int32_t> SkillLvl; // 0xe8
	bool UpLvl; // 0xf8
	bool BLvlCalc; // 0xf9
	int32_t MaxLVL; // 0xfc
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x58
};

struct UCreateEOSSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FPartyReservation PendingReservation; // 0x2f0
	EClientRequestType RequestType; // 0x340
	bool bPendingReservationSent; // 0x341
	bool bCancelReservation; // 0x342
};

struct UAISenseConfig_Hearing : UAISenseConfig {
	UAISense_Hearing* Implementation; // 0x48
	float HearingRange; // 0x50
	float LoSHearingRange; // 0x54
	char bUseLoSHearing : 1; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UNiagaraSettings : UDeveloperSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xb8
};

struct UMaterialExpressionMaterialProxyReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct UMaxWalkShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
};

struct UPlayerScoreComponentAddedScore_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Spawn; // 0x268
	UWidgetAnimation* Hide; // 0x270
	UTextBlock* AddScore; // 0x278
	UImage* Image_573; // 0x280
	UTextBlock* WhatScore; // 0x288
	FText Score; // 0x290
	FText Text; // 0x2a8
	bool Block?; // 0x2c0
};

struct AAlarmCoin_C : ACoinActor_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f8
};

struct UScreamSpell_C : UKillerSpell_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe8
	float ShakeDuration; // 0xf0
};

struct UW_MiniLobby_Role_C : UUserWidget {
	UImage* Image; // 0x260
	UImage* Image_2; // 0x268
	UImage* Image_3; // 0x270
	UImage* Image_4; // 0x278
	UImage* Image_5; // 0x280
	UImage* Image_6; // 0x288
	UImage* Image_7; // 0x290
	UImage* Image_8; // 0x298
	UImage* Image_9; // 0x2a0
	UImage* Image_10; // 0x2a8
	UImage* Image_11; // 0x2b0
	UImage* Image_12; // 0x2b8
	UImage* Image_13; // 0x2c0
	UImage* Image_14; // 0x2c8
	UImage* Image_15; // 0x2d0
	UImage* Image_16; // 0x2d8
	UImage* Image_17; // 0x2e0
	UImage* Image_18; // 0x2e8
	UImage* Image_19; // 0x2f0
	UImage* Image_20; // 0x2f8
	UImage* Image_21; // 0x300
	UImage* Image_22; // 0x308
	UImage* Image_23; // 0x310
	UImage* Image_24; // 0x318
	UImage* Image_25; // 0x320
	UImage* Image_26; // 0x328
	UImage* Image_27; // 0x330
	UImage* Image_28; // 0x338
	UImage* Image_29; // 0x340
	UImage* Image_30; // 0x348
	UImage* Image_31; // 0x350
	UImage* Image_32; // 0x358
	UImage* Image_33; // 0x360
	UImage* Image_34; // 0x368
	UImage* Image_35; // 0x370
	UImage* Image_36; // 0x378
	UImage* Image_37; // 0x380
	UImage* Image_38; // 0x388
	UImage* Image_39; // 0x390
	UImage* Image_40; // 0x398
	UImage* Image_41; // 0x3a0
	UImage* Image_42; // 0x3a8
	UImage* Image_43; // 0x3b0
	UImage* Image_44; // 0x3b8
	UImage* Image_45; // 0x3c0
	UImage* Image_46; // 0x3c8
	UImage* Image_47; // 0x3d0
	UImage* Image_48; // 0x3d8
	UImage* Image_49; // 0x3e0
	UImage* Image_50; // 0x3e8
	UImage* Image_51; // 0x3f0
	UImage* Image_52; // 0x3f8
	UImage* Image_53; // 0x400
	UImage* Image_54; // 0x408
	UImage* Image_55; // 0x410
	UImage* Image_56; // 0x418
	UImage* Image_57; // 0x420
	UImage* Image_58; // 0x428
	UImage* Image_59; // 0x430
	UImage* Image_60; // 0x438
	UImage* Image_61; // 0x440
	UImage* Image_62; // 0x448
	UImage* Image_63; // 0x450
	UImage* Image_64; // 0x458
	UImage* Image_65; // 0x460
	UImage* Image_66; // 0x468
	UImage* Image_67; // 0x470
	UImage* Image_68; // 0x478
	UImage* Image_69; // 0x480
	UImage* Image_70; // 0x488
	UImage* Image_71; // 0x490
	UImage* Image_72; // 0x498
	UImage* Image_73; // 0x4a0
	UImage* Image_74; // 0x4a8
	UImage* Image_75; // 0x4b0
	UImage* Image_76; // 0x4b8
	UImage* Image_77; // 0x4c0
	UImage* Image_78; // 0x4c8
	UImage* Image_79; // 0x4d0
	UImage* Image_80; // 0x4d8
	UImage* Image_81; // 0x4e0
	UImage* Image_82; // 0x4e8
	UImage* Image_83; // 0x4f0
	UImage* Image_84; // 0x4f8
	UImage* Image_85; // 0x500
	UImage* Image_86; // 0x508
	UImage* Image_87; // 0x510
	UImage* Image_88; // 0x518
	UImage* Image_89; // 0x520
	UImage* Image_90; // 0x528
	UImage* Image_91; // 0x530
	UImage* Image_92; // 0x538
	UImage* Image_93; // 0x540
	UImage* Image_94; // 0x548
	UImage* Image_95; // 0x550
	UImage* Image_96; // 0x558
	UImage* Image_97; // 0x560
	UImage* Image_98; // 0x568
	UImage* Image_99; // 0x570
	UImage* Image_100; // 0x578
	UImage* Image_113; // 0x580
	UImage* Image_412; // 0x588
	UWidgetSwitcher* WidgetSwitcher_BG; // 0x590
	UWidgetSwitcher* WidgetSwitcher_Role; // 0x598
};

struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
};

struct UMovieSceneCameraShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x80
};

struct UWidgetAnimation : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x68
	bool bLegacyFinishOnStop; // 0x78
	FString DisplayLabel; // 0x80
};

struct UJumpShake_C : UMatineeCameraShake {
	FPointerToUberGraphFrame UberGraphFrame; // 0x180
	FROscillator ShakeRot; // 0x188
	FVOscillator ShakeLoc; // 0x1ac
};

struct UARPoseComponent : UARComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct URichTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	UDataTable* TextStyleSet; // 0x140
	TArray<URichTextBlockDecorator*> DecoratorClasses; // 0x148
	bool bOverrideDefaultStyle; // 0x158
	FTextBlockStyle DefaultTextStyleOverride; // 0x160
	float MinDesiredWidth; // 0x3d0
	ETextTransformPolicy TextTransformPolicy; // 0x3d4
	FTextBlockStyle DefaultTextStyle; // 0x3d8
	TArray<URichTextBlockDecorator*> InstanceDecorators; // 0x648
};

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x288
};

struct UGraffityMaker_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	bool Busy; // 0xb8
};

struct UDatasmithPostProcessVolumeTemplate : UDatasmithObjectTemplate {
	FDatasmithPostProcessSettingsTemplate Settings; // 0x30
	char bEnabled : 1; // 0x70
	char bUnbound : 1; // 0x70
};

struct APS_PropHunt_C : APlayerState {
	FPointerToUberGraphFrame UberGraphFrame; // 0x320
	USceneComponent* DefaultSceneRoot; // 0x328
	bool IsDead; // 0x330
	bool isKiller; // 0x331
	FString NamePS; // 0x338
	E_SurvivorStatus Status; // 0x348
	FString NickNamePS; // 0x350
	int32_t KillerType; // 0x360
	int32_t PlayerScore; // 0x364
	FText ScoreText; // 0x368
	SurvClass SurvClass; // 0x380
	UTexture2D* AvatarPS; // 0x388
	int32_t PlayerFinalScore; // 0x390
	bool Ready?; // 0x394
	FPlayerInfo Info; // 0x398
	int32_t SurvSkinID; // 0x3b0
	TArray<int32_t> SurvSkinArray; // 0x3b8
	int32_t Exp; // 0x3c8
	int32_t Lvl; // 0x3cc
	TArray<AActor*> AliveSurvivors; // 0x3d0
	int32_t Scores; // 0x3e0
	int32_t MaxScore_AlarmGame; // 0x3e4
	int32_t MaxScore_REVIVE; // 0x3e8
	int32_t MaxScore_OutChair; // 0x3ec
	int32_t MaxScore_OutChair_Self; // 0x3f0
	int32_t MaxScore_OutChair_Self_PickLock; // 0x3f4
	int32_t MaxScore_OutGrip; // 0x3f8
	int32_t MaxScore_FLASH; // 0x3fc
	int32_t MaxScore_HealALLY; // 0x400
	int32_t MaxScore_HealSELF; // 0x404
	int32_t MaxScore_HIT; // 0x408
	int32_t MaxScore_DOWNED; // 0x40c
	int32_t MaxScore_CHAIR; // 0x410
	int32_t MaxScore_Stun; // 0x414
	int32_t MaxScore_ChaseSurv; // 0x418
	int32_t MaxScore_ChaseKiller; // 0x41c
	int32_t MaxScore_DoorOpen; // 0x420
	int32_t MaxScore_ExitDoor; // 0x424
	int32_t MAXSCOREBLOCK_AlarmGame; // 0x428
	int32_t MAXSCOREBLOCK_REVIVE; // 0x42c
	int32_t MAXSCOREBLOCK_OutChair; // 0x430
	int32_t MAXSCOREBLOCK_OutChair_Self; // 0x434
	int32_t MAXSCOREBLOCK_OutChair_Self_PickLock; // 0x438
	int32_t MAXSCOREBLOCK_OutGrip; // 0x43c
	int32_t MAXSCOREBLOCK_FLASH; // 0x440
	int32_t MAXSCOREBLOCK_HealALLY; // 0x444
	int32_t MAXSCOREBLOCK_HealSELF; // 0x448
	int32_t MAXSCOREBLOCK_Stun; // 0x44c
	int32_t MAXSCOREBLOCK_HIT; // 0x450
	int32_t MAXSCOREBLOCK_DOWNED; // 0x454
	int32_t MAXSCOREBLOCK_CHAIR; // 0x458
	int32_t KillScoreCounter; // 0x45c
	SurvChars survChar; // 0x460
	int32_t Assists; // 0x464
	int32_t ObjectivesDone; // 0x468
	int32_t DamageTaken; // 0x46c
	int32_t DamageDone; // 0x470
	int32_t PointsGained; // 0x474
	SurvCategory SurvCategory; // 0x478
	bool TopCategory?; // 0x479
	KillerCategory KillerCategory; // 0x47a
	int32_t CategoryValue; // 0x47c
	int32_t SurvivalTime; // 0x480
	int32_t Stuns; // 0x484
	int32_t Kills; // 0x488
	TArray<SurvCategory> SurvAllCategory; // 0x490
	TArray<KillerCategory> KillerAllCategory; // 0x4a0
	TArray<int32_t> AllCategoryValue; // 0x4b0
	bool TopSeveralCategory?; // 0x4c0
	APawn* SwapSender; // 0x4c8
	int32_t Alarms; // 0x4d0
	int32_t TempRandom; // 0x4d4
	int32_t Likes; // 0x4d8
	KillerCategory KillerSecondCategory; // 0x4dc
	int32_t SecondCategoryValue; // 0x4e0
	SurvCategory SurvSecondCategory; // 0x4e4
	TArray<APawn*> SwapSenders; // 0x4e8
	int32_t DistanceTraveled; // 0x4f8
	KillerType KillerChar; // 0x4fc
	float BonusCounter; // 0x500
	int32_t MvpCategory; // 0x504
	int32_t MvpAllCategory; // 0x508
	SurvCategory MvpCategoryEnum; // 0x50c
	int32_t ID; // 0x510
	bool IsTalking; // 0x514
	bool SkinCheat; // 0x515
	int32_t PerkIndex; // 0x518
	int32_t CurrentLVL; // 0x51c
	int32_t MaxLVL; // 0x520
	bool IsLVlAdded; // 0x524
	int32_t PointsForPerks; // 0x528
	TMap<int32_t, USkeletalMesh*> Skin; // 0x530
	TArray<int32_t> SkinArr; // 0x580
	int32_t TagID; // 0x590
	int32_t BannerID; // 0x594
	int32_t DiamondsCount; // 0x598
	int32_t MaxScore_AlarmGame_Coin; // 0x59c
	int32_t MAXSCOREBLOCK_AlarmGame_Coin; // 0x5a0
	int32_t MaxScore_AlarmFull_Coin; // 0x5a4
	int32_t MAXSCOREBLOCK_AlarmFull_Coin; // 0x5a8
	int32_t MaxScore_Reanimate_Coin; // 0x5ac
	int32_t MAXSCOREBLOCK_Reanimate_Coin; // 0x5b0
	int32_t MaxScore_OutChair_Coin; // 0x5b4
	int32_t MAXSCOREBLOCK_OutChair_Coin; // 0x5b8
	int32_t MaxScore_StunKiller_Coin; // 0x5bc
	int32_t MAXSCOREBLOCK_StunKiller_Coin; // 0x5c0
	int32_t MaxScore_FlashKiller_Coin; // 0x5c4
	int32_t MAXSCOREBLOCK_FlashKiller_Coin; // 0x5c8
	int32_t MAXSCOREBLOCK_ChaseSurv; // 0x5cc
	int32_t MAXSCOREBLOCK_ChaseKiller; // 0x5d0
	int32_t Sum_Assists_Surv; // 0x5d4
	int32_t Sum_Objectives_Surv; // 0x5d8
	int32_t Sum_KillerAction_Surv; // 0x5dc
	int32_t Sum_Chase_Killer; // 0x5e0
	int32_t Avatar; // 0x5e4
	int32_t Sum_Hit_Killer; // 0x5e8
	int32_t Sum_Captured_Killer; // 0x5ec
	int32_t Sum_Downed_Killer; // 0x5f0
	int32_t Sum_Kills_Killer; // 0x5f4
	FString SteamPlayerID; // 0x5f8
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x30
	USkeleton* TargetSkeleton; // 0x40
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x48
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x58
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xa8
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xb8
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xc8
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xe8
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x108
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x128
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x148
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x168
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x188
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1a8
	TArray<FName> SyncGroupNames; // 0x1f8
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x208
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x218
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x268
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct USoundEffectSourcePresetChain : UObject {
	TArray<FSourceEffectChainEntry> Chain; // 0x28
	char bPlayEffectChainTails : 1; // 0x38
};

struct UAIAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate OnFail; // 0x38
};

struct UGI_Prophunt_C : UProphuntGameInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	FString PlayFabUserID; // 0x2c0
	FString Nickname; // 0x2d0
	FName HostLevel; // 0x2e0
	TArray<FBlueprintSessionResult> NewVar_1; // 0x2e8
	USaveGame* NewVar_2; // 0x2f8
	float Sensivity; // 0x300
	bool BAdvertise; // 0x304
	TArray<FBlueprintSessionResult> Sessions; // 0x308
	FS_AudioHandles AudioHandles; // 0x318
	bool ShouldJoin; // 0x338
	UTexture2D* Avatar; // 0x340
	int32_t MapIndex; // 0x348
	TArray<FString> Blacklist; // 0x350
	bool SuccessJoin; // 0x360
	bool DelayedSearch; // 0x361
	FString SessionId; // 0x368
	bool afterMenu; // 0x378
	FString MapName; // 0x380
	FPlayerInfo PlayerInfo; // 0x390
	bool LoggedIn; // 0x3a8
	int32_t SurvSkinID; // 0x3ac
	int32_t Exp; // 0x3b0
	int32_t Lvl; // 0x3b4
	float PercentageLVL; // 0x3b8
	TArray<int32_t> SurvSkinArray; // 0x3c0
	USaveGame* UserDataSave; // 0x3d0
	FString SaveName; // 0x3d8
	bool LoginSuccess; // 0x3e8
	FS_GameSettings ServerGameSettings; // 0x3f0
	FS_ServerSettings ServerSettings; // 0x410
	bool NeedMainMenuFadeOut; // 0x438
	float XAxis; // 0x43c
	float YAxis; // 0x440
	UPerk_C* SurvPerk1; // 0x448
	UPerk_C* SurvPerk2; // 0x450
	UPerk_C* SurvPerk3; // 0x458
	UPerk_C* KillerPerk1; // 0x460
	UPerk_C* KillerPerk2; // 0x468
	UPerk_C* KillerPerk3; // 0x470
	FString ServiceAddress; // 0x478
	FString ServerRegion; // 0x488
	bool IsActualServer; // 0x498
	int32_t BuildNumber; // 0x49c
	FString ServerName; // 0x4a0
	FString ID; // 0x4b0
	bool ServerError?; // 0x4c0
	FString TitlePlayerID; // 0x4c8
	FString SteamUserID; // 0x4d8
	bool IsPlayfabServer; // 0x4e8
	FString KillerID; // 0x4f0
	bool IsMatchmaking; // 0x500
	TArray<int32_t> Char Selected Skin Ids; // 0x508
	bool SteamLoggedIn; // 0x518
	bool SteamLobbyCreated; // 0x519
	FMulticastInlineDelegate OnComeOnline; // 0x520
	FMulticastInlineDelegate OnGoneOffline; // 0x530
	bool AmILobbyMember; // 0x540
	FString UserToInvite; // 0x548
	TArray<UPlayFabJsonObject*> PlayfabMatchPlayers; // 0x558
	FMulticastInlineDelegate OnEnterLobby; // 0x568
	FMulticastInlineDelegate OnLeftLobby; // 0x578
	TArray<FPingQoSInfo> Pings; // 0x588
	E_MenuReason OpenMenuReason; // 0x598
	bool GoingToMenu; // 0x599
	bool JoinSteamLobbyAtStartup; // 0x59a
	FString JoinLobbyID; // 0x5a0
	bool DevCheat?; // 0x5b0
	TMap<int32_t, USkeletalMesh*> SkinsAndId; // 0x5b8
	TArray<int32_t> SkinIDThatsPlayerOwns; // 0x608
	int32_t LootBoxCount; // 0x618
	TMap<int32_t, int32_t> SelectedSkinIDs; // 0x620
	int32_t coins; // 0x670
	int32_t OpenedLootBoxCount; // 0x674
	int32_t SelectedBannerID; // 0x678
	int32_t GLOBAL_XP; // 0x67c
	int32_t MMR_SURV; // 0x680
	int32_t MMR_KILLER; // 0x684
	int32_t TagID; // 0x688
	int32_t XP_ForNextLVL; // 0x68c
	int32_t XP_ForLvl; // 0x690
	TArray<FPingQoSInfo> CachedSortedPings; // 0x698
	bool IsNewSkin; // 0x6a8
	bool IsNewBanner; // 0x6a9
	bool IsNewAvatar; // 0x6aa
	bool IsNewTags; // 0x6ab
	TMap<int32_t, bool> IsSkinCustomizationNew; // 0x6b0
	TArray<int32_t> ArrAvatarPlayerOwn; // 0x700
	TArray<int32_t> ArrBannerPlayerOwn; // 0x710
	TArray<int32_t> ArrTagsPlayerOwn; // 0x720
	TMap<int32_t, bool> IsAvatarCustomizationNew; // 0x730
	TMap<int32_t, bool> IsBannerCustomizationNew; // 0x780
	TMap<int32_t, bool> IsTagsCustomizationNew; // 0x7d0
	int32_t AvatarID; // 0x820
	bool UnlockAllSkins; // 0x824
	FString CachedBuildId; // 0x828
	bool DisableAllSkins; // 0x838
	FString CS_SessionId; // 0x840
	FString CS_Region; // 0x850
	bool ShouldCreateLobby; // 0x860
	FString LD_CustomGameAddress; // 0x868
	bool Invert Mouse Y?; // 0x878
	UVaRestRequestJSON* SessionAuthRequest; // 0x880
	UW_LoadingScreen_C* LoadingScreenWidget; // 0x888
	FMulticastInlineDelegate ClearLobbyUI; // 0x890
	FString CurrentLobbyID; // 0x8a0
	bool DltSkinsFromLB; // 0x8b0
	bool UploadingSaveData; // 0x8b1
	bool TriedUploadSave; // 0x8b2
	FString SteamSessinTicket; // 0x8b8
	bool ResetRedDot; // 0x8c8
	bool FirstEOSLoad; // 0x8c9
	bool CheatsEnabled; // 0x8ca
	int32_t Scrap; // 0x8cc
	int32_t Mmr; // 0x8d0
	int32_t MatchesPlayed; // 0x8d4
	FMulticastInlineDelegate OnEOSLoad; // 0x8d8
	bool GamepadInput; // 0x8e8
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x470
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x478
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x480
	TArray<FVertexOffsetUsage> VertexOffsetUsage; // 0x490
	UPhysicsAsset* PhysicsAssetOverride; // 0x598
	int32_t ForcedLodModel; // 0x5a0
	int32_t MinLodModel; // 0x5a4
	float StreamingDistanceMultiplier; // 0x5b0
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x5c0
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x5f4
	char bOverrideMinLod : 1; // 0x5f6
	char bUseBoundsFromMasterPoseComponent : 1; // 0x5f6
	char bForceWireframe : 1; // 0x5f6
	char bDisplayBones : 1; // 0x5f6
	char bDisableMorphTarget : 1; // 0x5f6
	char bHideSkin : 1; // 0x5f7
	char bPerBoneMotionBlur : 1; // 0x5f7
	char bComponentUseFixedSkelBounds : 1; // 0x5f7
	char bConsiderAllBodiesForBounds : 1; // 0x5f7
	char bSyncAttachParentLOD : 1; // 0x5f7
	char bCanHighlightSelectedSections : 1; // 0x5f7
	char bRecentlyRendered : 1; // 0x5f7
	char bCastCapsuleDirectShadow : 1; // 0x5f7
	char bCastCapsuleIndirectShadow : 1; // 0x5f8
	char bCPUSkinning : 1; // 0x5f8
	char bEnableUpdateRateOptimizations : 1; // 0x5f8
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x5f8
	char bRenderStatic : 1; // 0x5f8
	char bIgnoreMasterPoseComponentLOD : 1; // 0x5f8
	char bCachedLocalBoundsUpToDate : 1; // 0x5f9
	char bForceMeshObjectUpdate : 1; // 0x5f9
	float CapsuleIndirectShadowMinVisibility; // 0x5fc
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x610
	FMatrix CachedWorldToLocalTransform; // 0x630
};

struct UPlaneReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadiusScale; // 0x270
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UVerticalBoxSlot : UPanelSlot {
	FSlateChildSize Size; // 0x38
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct USubsurfaceProfile : UObject {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UMovieSceneGeometryCacheTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct ULandscapeSettings : UDeveloperSettings {
	int32_t MaxNumberOfLayers; // 0x38
};

struct UPlatformGameInstance : UGameInstance {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0x1a8
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0x1b8
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0x1c8
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0x1d8
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0x1e8
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x1f8
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x208
	FMulticastInlineDelegate ApplicationRegisteredForRemoteNotificationsDelegate; // 0x218
	FMulticastInlineDelegate ApplicationRegisteredForUserNotificationsDelegate; // 0x228
	FMulticastInlineDelegate ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x238
	FMulticastInlineDelegate ApplicationReceivedRemoteNotificationDelegate; // 0x248
	FMulticastInlineDelegate ApplicationReceivedLocalNotificationDelegate; // 0x258
	FMulticastInlineDelegate ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x268
};

struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	TSet<int32_t> OutputShaderStages; // 0x38
	TSet<int32_t> IterationShaderStages; // 0x88
};

struct UMovieSceneMaterialParameterCollectionTrack : UMovieSceneMaterialTrack {
	UMaterialParameterCollection* MPC; // 0x90
};

struct UWBP_HitMark_KillerAlarm_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* CanvasPanel_HitMarks; // 0x268
	UOverlay* Overlay_38; // 0x270
	ASurvivorMasterBP_C* PlayerRef; // 0x278
	TArray<UWBP_HitMarkComponent_C*> HitMarks; // 0x280
	UWBP_HitMarkComponent_KillerAlarm_C* TutorialHitMark; // 0x290
};

struct ULevelStreamingDynamic : ULevelStreaming {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct UEnvQueryGenerator_BlueprintBase : UEnvQueryGenerator {
	FText GeneratorsActionDescription; // 0x50
	UEnvQueryContext* Context; // 0x68
	UEnvQueryItemType* GeneratedItemType; // 0x70
};

struct UARCandidateImage : UDataAsset {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UMagicLeapLightingTrackingComponent : UActorComponent {
	bool UseGlobalAmbience; // 0xb0
	bool UseColorTemp; // 0xb1
};

struct UParticleModuleAccelerationDragScaleOverLife : UParticleModuleAccelerationBase {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct UParticleModuleRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionFloat LifeMultiplier; // 0x30
};

struct UCharacterMovementComponent : UPawnMovementComponent {
	ACharacter* CharacterOwner; // 0x148
	float GravityScale; // 0x150
	float MaxStepHeight; // 0x154
	float JumpZVelocity; // 0x158
	float JumpOffJumpZFactor; // 0x15c
	float WalkableFloorAngle; // 0x160
	float WalkableFloorZ; // 0x164
	EMovementMode MovementMode; // 0x168
	char CustomMovementMode; // 0x169
	ENetworkSmoothingMode NetworkSmoothingMode; // 0x16a
	float GroundFriction; // 0x16c
	float MaxWalkSpeed; // 0x18c
	float MaxWalkSpeedCrouched; // 0x190
	float MaxSwimSpeed; // 0x194
	float MaxFlySpeed; // 0x198
	float MaxCustomMovementSpeed; // 0x19c
	float MaxAcceleration; // 0x1a0
	float MinAnalogWalkSpeed; // 0x1a4
	float BrakingFrictionFactor; // 0x1a8
	float BrakingFriction; // 0x1ac
	float BrakingSubStepTime; // 0x1b0
	float BrakingDecelerationWalking; // 0x1b4
	float BrakingDecelerationFalling; // 0x1b8
	float BrakingDecelerationSwimming; // 0x1bc
	float BrakingDecelerationFlying; // 0x1c0
	float AirControl; // 0x1c4
	float AirControlBoostMultiplier; // 0x1c8
	float AirControlBoostVelocityThreshold; // 0x1cc
	float FallingLateralFriction; // 0x1d0
	float CrouchedHalfHeight; // 0x1d4
	float Buoyancy; // 0x1d8
	float PerchRadiusThreshold; // 0x1dc
	float PerchAdditionalHeight; // 0x1e0
	FRotator RotationRate; // 0x1e4
	char bUseSeparateBrakingFriction : 1; // 0x1f0
	char bApplyGravityWhileJumping : 1; // 0x1f0
	char bUseControllerDesiredRotation : 1; // 0x1f0
	char bOrientRotationToMovement : 1; // 0x1f0
	char bSweepWhileNavWalking : 1; // 0x1f0
	char bMovementInProgress : 1; // 0x1f0
	char bEnableScopedMovementUpdates : 1; // 0x1f0
	char bEnableServerDualMoveScopedMovementUpdates : 1; // 0x1f1
	char bForceMaxAccel : 1; // 0x1f1
	char bRunPhysicsWithNoController : 1; // 0x1f1
	char bForceNextFloorCheck : 1; // 0x1f1
	char bShrinkProxyCapsule : 1; // 0x1f1
	char bCanWalkOffLedges : 1; // 0x1f1
	char bCanWalkOffLedgesWhenCrouching : 1; // 0x1f1
	char bNetworkSkipProxyPredictionOnNetUpdate : 1; // 0x1f2
	char bNetworkAlwaysReplicateTransformUpdateTimestamp : 1; // 0x1f2
	char bDeferUpdateMoveComponent : 1; // 0x1f2
	char bEnablePhysicsInteraction : 1; // 0x1f2
	char bTouchForceScaledToMass : 1; // 0x1f2
	char bPushForceScaledToMass : 1; // 0x1f2
	char bPushForceUsingZOffset : 1; // 0x1f2
	char bScalePushForceToVelocity : 1; // 0x1f3
	USceneComponent* DeferredUpdatedMoveComponent; // 0x1f8
	float MaxOutOfWaterStepHeight; // 0x200
	float OutofWaterZ; // 0x204
	float Mass; // 0x208
	float StandingDownwardForceScale; // 0x20c
	float InitialPushForceFactor; // 0x210
	float PushForceFactor; // 0x214
	float PushForcePointZOffsetFactor; // 0x218
	float TouchForceFactor; // 0x21c
	float MinTouchForce; // 0x220
	float MaxTouchForce; // 0x224
	float RepulsionForce; // 0x228
	FVector Acceleration; // 0x22c
	FQuat LastUpdateRotation; // 0x240
	FVector LastUpdateLocation; // 0x250
	FVector LastUpdateVelocity; // 0x25c
	float ServerLastTransformUpdateTimeStamp; // 0x268
	float ServerLastClientGoodMoveAckTime; // 0x26c
	float ServerLastClientAdjustmentTime; // 0x270
	FVector PendingImpulseToApply; // 0x274
	FVector PendingForceToApply; // 0x280
	float AnalogInputModifier; // 0x28c
	float MaxSimulationTimeStep; // 0x29c
	int32_t MaxSimulationIterations; // 0x2a0
	int32_t MaxJumpApexAttemptsPerSimulation; // 0x2a4
	float MaxDepenetrationWithGeometry; // 0x2a8
	float MaxDepenetrationWithGeometryAsProxy; // 0x2ac
	float MaxDepenetrationWithPawn; // 0x2b0
	float MaxDepenetrationWithPawnAsProxy; // 0x2b4
	float NetworkSimulatedSmoothLocationTime; // 0x2b8
	float NetworkSimulatedSmoothRotationTime; // 0x2bc
	float ListenServerNetworkSimulatedSmoothLocationTime; // 0x2c0
	float ListenServerNetworkSimulatedSmoothRotationTime; // 0x2c4
	float NetProxyShrinkRadius; // 0x2c8
	float NetProxyShrinkHalfHeight; // 0x2cc
	float NetworkMaxSmoothUpdateDistance; // 0x2d0
	float NetworkNoSmoothUpdateDistance; // 0x2d4
	float NetworkMinTimeBetweenClientAckGoodMoves; // 0x2d8
	float NetworkMinTimeBetweenClientAdjustments; // 0x2dc
	float NetworkMinTimeBetweenClientAdjustmentsLargeCorrection; // 0x2e0
	float NetworkLargeClientCorrectionDistance; // 0x2e4
	float LedgeCheckThreshold; // 0x2e8
	float JumpOutOfWaterPitch; // 0x2ec
	FFindFloorResult CurrentFloor; // 0x2f0
	EMovementMode DefaultLandMovementMode; // 0x388
	EMovementMode DefaultWaterMovementMode; // 0x389
	EMovementMode GroundMovementMode; // 0x38a
	char bMaintainHorizontalGroundVelocity : 1; // 0x38b
	char bImpartBaseVelocityX : 1; // 0x38b
	char bImpartBaseVelocityY : 1; // 0x38b
	char bImpartBaseVelocityZ : 1; // 0x38b
	char bImpartBaseAngularVelocity : 1; // 0x38b
	char bJustTeleported : 1; // 0x38b
	char bNetworkUpdateReceived : 1; // 0x38b
	char bNetworkMovementModeChanged : 1; // 0x38b
	char bIgnoreClientMovementErrorChecksAndCorrection : 1; // 0x38c
	char bServerAcceptClientAuthoritativePosition : 1; // 0x38c
	char bNotifyApex : 1; // 0x38c
	char bCheatFlying : 1; // 0x38c
	char bWantsToCrouch : 1; // 0x38c
	char bCrouchMaintainsBaseLocation : 1; // 0x38c
	char bIgnoreBaseRotation : 1; // 0x38c
	char bFastAttachedMove : 1; // 0x38c
	char bAlwaysCheckFloor : 1; // 0x38d
	char bUseFlatBaseForFloorChecks : 1; // 0x38d
	char bPerformingJumpOff : 1; // 0x38d
	char bWantsToLeaveNavWalking : 1; // 0x38d
	char bUseRVOAvoidance : 1; // 0x38d
	char bRequestedMoveUseAcceleration : 1; // 0x38d
	char bWasSimulatingRootMotion : 1; // 0x38d
	char bAllowPhysicsRotationDuringAnimRootMotion : 1; // 0x38e
	char bHasRequestedVelocity : 1; // 0x38e
	char bRequestedMoveWithMaxSpeed : 1; // 0x38e
	char bWasAvoidanceUpdated : 1; // 0x38e
	char bProjectNavMeshWalking : 1; // 0x38e
	char bProjectNavMeshOnBothWorldChannels : 1; // 0x38e
	float AvoidanceConsiderationRadius; // 0x3a0
	FVector RequestedVelocity; // 0x3a4
	int32_t AvoidanceUID; // 0x3b0
	FNavAvoidanceMask AvoidanceGroup; // 0x3b4
	FNavAvoidanceMask GroupsToAvoid; // 0x3b8
	FNavAvoidanceMask GroupsToIgnore; // 0x3bc
	float AvoidanceWeight; // 0x3c0
	FVector PendingLaunchVelocity; // 0x3c4
	float NavMeshProjectionInterval; // 0x474
	float NavMeshProjectionTimer; // 0x478
	float NavMeshProjectionInterpSpeed; // 0x47c
	float NavMeshProjectionHeightScaleUp; // 0x480
	float NavMeshProjectionHeightScaleDown; // 0x484
	float NavWalkingFloorDistTolerance; // 0x488
	FCharacterMovementComponentPostPhysicsTickFunction PostPhysicsTickFunction; // 0x490
	float MinTimeBetweenTimeStampResets; // 0x4d8
	FRootMotionSourceGroup CurrentRootMotion; // 0x988
	FRootMotionSourceGroup ServerCorrectionRootMotion; // 0x9c0
	FRootMotionMovementParams RootMotionParams; // 0xa90
	FVector AnimRootMotionVelocity; // 0xad0
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UItemWorker_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	int32_t HealpackCharge; // 0xb8
	bool IsPressed; // 0xbc
	ItemType ItemType; // 0xbd
	ASurvivorMasterBP_C* Player; // 0xc0
	float HealDuration; // 0xc8
	float SpentTime; // 0xcc
	AItemsBPHand_C* CurrentItem; // 0xd0
	bool IsHealing; // 0xd8
	ASurvivorMasterBP_C* HealTarget; // 0xe0
	UFMODAudioComponent* HealSoundComponent; // 0xe8
	TArray<FItemStructure> ItemsInventory; // 0xf0
	FTransform SpawnItemLocation; // 0x100
	AItemsBPHand_C* ClassItemToSpawn; // 0x130
	int32_t InventoryIndex; // 0x138
	AActor* Item; // 0x140
	bool ItemFound?; // 0x148
	TArray<AActor*> PickUpItems; // 0x150
	UMaterialInstanceDynamic* SurvDynMat1; // 0x160
	UMaterialInstanceDynamic* SurvDynMat2; // 0x168
	UMaterialInstanceDynamic* SurvDynMat3; // 0x170
	UMaterialInstanceDynamic* SurvDynMatFPP; // 0x178
	UMaterialInstanceDynamic* SurvDynMatInvis; // 0x180
	UMaterialInstanceDynamic* SurvDynMatInvisFPP; // 0x188
	bool TransitionOn; // 0x190
	bool TransitionOff; // 0x191
	float TransitionTime; // 0x194
	float TurnOffDuration; // 0x198
	float TurnOnDuration; // 0x19c
	float InvisRefractionZero; // 0x1a0
	float InvisRefractionFPP; // 0x1a4
	float InvisRefractionTPP; // 0x1a8
	float Float1; // 0x1ac
	float ErodeSubtractDef; // 0x1b0
	float CurrentTimerInvis; // 0x1b4
	bool Casted?; // 0x1b8
	FPostProcessSettings postProcessNormal; // 0x1c0
	FPostProcessSettings postProcessMonochrome; // 0x710
	float TimerInvis; // 0xc60
	ALootboxShop_C* LootboxShop; // 0xc68
	bool CanUsePicklock?; // 0xc70
	int32_t SkillCheckCount; // 0xc74
	float DeltaSecond; // 0xc78
	float CurrentPicklockProgress; // 0xc7c
	float FullPicklockProgress; // 0xc80
	bool Block?; // 0xc84
	bool UsePicklock?; // 0xc85
	FText PicklockText; // 0xc88
	bool ItemTake?; // 0xca0
	FItemStructure Medic; // 0xca8
	FItemStructure Reporter; // 0xcd8
	FItemStructure Alchemist; // 0xd08
	FItemStructure Gamer; // 0xd38
	FItemStructure Apprentice; // 0xd68
	FItemStructure Thief; // 0xd98
	bool TakeAnim?; // 0xdc8
	FText UseItemText; // 0xdd0
	FText SelfHealText; // 0xde8
	FText ItemName; // 0xe00
	bool ItemSwap?; // 0xe18
	AActor* Lotbox; // 0xe20
	bool DropItemBlock?; // 0xe28
	bool FirstItem?; // 0xe29
	FItemStructure Slot1; // 0xe30
	FItemStructure Slot2; // 0xe60
	FItemStructure Slot3; // 0xe90
	int32_t TempInt; // 0xec0
	FItemStructure TempDrop; // 0xec8
	bool FlashlightCanUse?; // 0xef8
	TArray<UMaterialInstanceDynamic*> SurvDynMaterialsTPP; // 0xf00
	TArray<UMaterialInstanceDynamic*> SurvDynMaterialsFPP; // 0xf10
	bool HoudiniPerk?; // 0xf20
	FText HoudiniText; // 0xf28
	FItemStructure CurrentSlot; // 0xf40
	bool InventoryFull?; // 0xf70
	AActor* ItemMesh; // 0xf78
	TArray<UMaterialInstanceDynamic*> MeshMaterInst; // 0xf80
	TArray<UMaterialInstanceDynamic*> MeshInvisMaterInst; // 0xf90
	AKillerMasterBP_C* StunKiller; // 0xfa0
	int32_t TempRandom; // 0xfa8
	int32_t TotemOfBraveryCharge; // 0xfac
	bool IsTotemOfBravery; // 0xfb0
	bool IsTotemOfConcentration; // 0xfb1
	int32_t TotemOfConcentrationCharge; // 0xfb4
	bool IsTotemOfFriemdship; // 0xfb8
	int32_t TotemOfFriendshipCharge; // 0xfbc
	FTimerHandle PainkillerTimer; // 0xfc0
	int32_t PainKillerT; // 0xfc8
	int32_t TotemOfGravityCharge; // 0xfcc
	bool IsTotemOfGravity; // 0xfd0
	TArray<AItemsBPHand_C*> HealpackArr; // 0xfd8
	bool IsHealthpack; // 0xfe8
	FTimerHandle TotemOfGravityTimer; // 0xff0
	FTimerHandle TotemOfConcentrationTimer; // 0xff8
	FTimerHandle TotemOfFriendshipTime; // 0x1000
	FTimerHandle TotemOfBraveryTimer; // 0x1008
	FTimerHandle TotemOfEnduranceTimer; // 0x1010
	int32_t ToolCharges; // 0x1018
	FTimerHandle ToolTimer; // 0x1020
	FText GemOfEndurance; // 0x1028
	FText Gem of Friendship; // 0x1040
	FText Gem of Bravery; // 0x1058
	FText Gem of Gravity; // 0x1070
	bool Condition; // 0x1088
	bool IsPainkillerActivated; // 0x1089
	bool IsToolActivated; // 0x108a
	bool ToolsAnim; // 0x108b
	AItemsBP_C* ItemToPickUpReference; // 0x1090
	int32_t ItemWorkerSpawnIndex; // 0x1098
	bool FPressed?; // 0x109c
	bool BlockSwap; // 0x109d
	bool BlockPropItem; // 0x109e
	bool BlockDropDup; // 0x109f
};

struct UTimeIsTicking_C : UPerkKiller_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x120
	TArray<ANewAlarmBP_C*> Alarms; // 0x128
	TArray<ANewAlarmBP_C*> AlarmsRDY; // 0x138
};

struct ACrystalRune_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UParticleSystemComponent* P_RuneGlow; // 0x228
	UPointLightComponent* PointLight; // 0x230
	USphereComponent* Sphere; // 0x238
	UStaticMeshComponent* Cube; // 0x240
	USceneComponent* DefaultSceneRoot; // 0x248
	float RotationSpeed; // 0x250
	bool Block?; // 0x254
	bool EaseUp; // 0x255
	float EaseAlpha; // 0x258
	float LocalZ; // 0x25c
	ItemType Totem; // 0x260
	FFMODEventInstance Ambience; // 0x268
	UFMODEvent* Event; // 0x270
	UMaterialInstanceDynamic* DynMat; // 0x278
	float EaseSpeed; // 0x280
	float UpPosOffset; // 0x284
};

struct UMovieSceneEnumSection : UMovieSceneSection {
	FMovieSceneByteChannel EnumCurve; // 0xe8
};

struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	FSourceEffectWaveShaperSettings Settings; // 0x98
};

struct UStereoLayerShapeEquirect : UStereoLayerShape {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UMaterialExpressionLogarithm2 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UEOSCoreAuthVerifyUserAuth : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UW_VictoryScreen_Tutorial_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* TexAnim; // 0x268
	UWidgetAnimation* NewVictoryAnimation; // 0x270
	UWidgetAnimation* Fade; // 0x278
	UWidgetAnimation* VictoryAnimation; // 0x280
	UHorizontalBox* HorizontalBox_46; // 0x288
	UImage* Image_37; // 0x290
	UImage* Image_102; // 0x298
	UImage* Image_114; // 0x2a0
	UImage* Image_254; // 0x2a8
	USizeBox* SizeBox_3; // 0x2b0
	UTextBlock* Text_EndGameState; // 0x2b8
	bool Finished; // 0x2c0
	FText DefeatText; // 0x2c8
	FText VictoryText; // 0x2e0
};

struct UGizmoBaseComponent : UPrimitiveComponent {
	FLinearColor Color; // 0x440
	float HoverSizeMultiplier; // 0x450
	float PixelHitDistanceThreshold; // 0x454
};

struct USubmixEffectConvolutionReverbPreset : USoundEffectSubmixPreset {
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	FSubmixEffectConvolutionReverbSettings Settings; // 0x70
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x98
	bool bEnableHardwareAcceleration; // 0x99
};

struct AMatineeActorCameraAnim : AMatineeActor {
	UCameraAnim* CameraAnim; // 0x2c8
};

struct USafeZoneSlot : UPanelSlot {
	bool bIsTitleSafe; // 0x38
	FMargin SafeAreaScale; // 0x3c
	EHorizontalAlignment HAlign; // 0x4c
	EVerticalAlignment VAlign; // 0x4d
	FMargin Padding; // 0x50
};

struct UReverbEffect : UObject {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UEOSCorePlayerDataStorageWriteFile : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct ATemplateSequenceActor : AActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x228
	UTemplateSequencePlayer* SequencePlayer; // 0x240
	FSoftObjectPath TemplateSequence; // 0x248
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x260
};

struct UChatWindow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* CanvasPanel_2; // 0x268
	UScrollBox* ChatLog; // 0x270
	UButton* HiddenCloseChatButton; // 0x278
	UImage* Image_77; // 0x280
	UImage* Image_91; // 0x288
	UImage* Image_104; // 0x290
	UImage* Image_192; // 0x298
	UImage* Image_Fake; // 0x2a0
	UImage* Image_Ref; // 0x2a8
	UImage* Image_ScrollBG; // 0x2b0
	UImage* Image_ScrollThumb; // 0x2b8
	UMultiLineEditableText* MultiLineChatEntry; // 0x2c0
	UOverlay* OverlayChatEntry; // 0x2c8
	USizeBox* SB_ScrollRail; // 0x2d0
	UTextBlock* TypeMessage; // 0x2d8
	UBorder* Window; // 0x2e0
	bool Global?; // 0x2e8
	FLinearColor VisibleWindow; // 0x2ec
	FLinearColor HiddenWindow; // 0x2fc
	bool CustomOpen?; // 0x30c
	bool IsChatVisible; // 0x30d
	bool IsShiftPressed; // 0x30e
	float CurrentScrollOffset; // 0x310
	float EndScrollOffset; // 0x314
	bool NeedAutoScroll; // 0x318
	float AutoScrollSpeed; // 0x31c
	float ChatLogHeight; // 0x320
	bool FakeRemoved; // 0x324
	float DefaultTimeOffset; // 0x328
	float CurrentTimeOffset; // 0x32c
	TArray<UChatWindowText_C*> ArrayHiddenMessages; // 0x330
	FTimerHandle HandlerHiddenMessages; // 0x340
	float MessageVisibilityTime; // 0x348
	int32_t MaxCountSumbol; // 0x34c
};

struct UEOSCoreSessionsRegisterPlayers : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UEOSCoreTitleStorageQueryFileList : UEOSCoreAsyncAction {
	FMulticastInlineDelegate OnCallback; // 0x38
};

struct UARCandidateObject : UDataAsset {
	TArray<char> CandidateObjectData; // 0x30
	FString FriendlyName; // 0x40
	FBox BoundingBox; // 0x50
};

struct UIconAbilityCooldownWBP_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* IconOpacityBackward_Anim; // 0x268
	UWidgetAnimation* IconOpacityForward_Anim; // 0x270
	UWidgetAnimation* CoolDown_Time_Is_Over; // 0x278
	UWidgetAnimation* CoolDown_End_Short_Anim; // 0x280
	UWidgetAnimation* CoolDown_ShowTimer_Anim; // 0x288
	UWidgetAnimation* CoolDown_Begin_Anim; // 0x290
	UImage* BG; // 0x298
	UBorder* Border_AbilityIcon; // 0x2a0
	UOverlay* CDOverlay; // 0x2a8
	UTextBlock* CDTextBox; // 0x2b0
	UTextBlock* Count; // 0x2b8
	UHorizontalBox* HorizontalBox_Counter; // 0x2c0
	UImage* Image_ChargeIconFake; // 0x2c8
	UImage* Image_RBM; // 0x2d0
	UImage* Image_Substrate; // 0x2d8
	UProgressBar* ProgressBar_CD; // 0x2e0
	UTextBlock* TextBlock_KeyName; // 0x2e8
	UTextBlock* TextBlock_Multiplier; // 0x2f0
	float CoolDownTime; // 0x2f8
	float CurrentTime; // 0x2fc
	FText CdText; // 0x300
	int32_t RemainTime; // 0x318
	bool abilityUse?; // 0x31c
	UCoolDownWBP_C* CDWBPRef; // 0x320
	FText Key; // 0x328
	AKillerMasterBP_C* Owner; // 0x340
	bool charge?; // 0x348
	UMaterialInstanceDynamic* CircleMat; // 0x350
	float FillTime; // 0x358
	FText Name; // 0x360
};

struct AMapStormBP_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	UAudioComponent* Thunder; // 0x228
	UFMODAudioComponent* FmodAudio; // 0x230
	USceneComponent* DefaultSceneRoot; // 0x238
	float Timeline_1_NewTrack_0_D67461CE416563FB2B48E2B80652FA43; // 0x240
	ETimelineDirection Timeline_1__Direction_D67461CE416563FB2B48E2B80652FA43; // 0x244
	UTimelineComponent* Timeline_2; // 0x248
	float Timeline_0_NewTrack_0_A19B948C4F191372C1CF8DB1F06EA309; // 0x250
	ETimelineDirection Timeline_0__Direction_A19B948C4F191372C1CF8DB1F06EA309; // 0x254
	UTimelineComponent* Timeline_1; // 0x258
	TArray<AStormLight_Blueprint_C*> Lights; // 0x260
	TArray<AStaticMeshActor*> Windows; // 0x270
	TArray<ABP_LightBeam_C*> LightBeams; // 0x280
	float RandomTime; // 0x290
	float Time; // 0x294
	float LightsIntense; // 0x298
	float BeamsBrightness; // 0x29c
	UMaterialInstanceDynamic* NewVar_1; // 0x2a0
	UMaterialInterface* NewVar_2; // 0x2a8
	FLinearColor NewVar_3; // 0x2b0
	int32_t ThunderType; // 0x2c0
	float Volume; // 0x2c4
	bool JustSound; // 0x2c8
	bool Block; // 0x2c9
};

struct UBTDecorator_ConeCheck : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector ConeDirection; // 0x98
	FBlackboardKeySelector Observed; // 0xc0
};

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct USkyLightComponent : ULightComponentBase {
	bool bRealTimeCapture; // 0x228
	ESkyLightSourceType SourceType; // 0x229
	UTextureCube* Cubemap; // 0x230
	float SourceCubemapAngle; // 0x238
	int32_t CubemapResolution; // 0x23c
	float SkyDistanceThreshold; // 0x240
	bool bCaptureEmissiveOnly; // 0x244
	bool bLowerHemisphereIsBlack; // 0x245
	FLinearColor LowerHemisphereColor; // 0x248
	float OcclusionMaxDistance; // 0x258
	float Contrast; // 0x25c
	float OcclusionExponent; // 0x260
	float MinOcclusion; // 0x264
	FColor OcclusionTint; // 0x268
	char bCloudAmbientOcclusion : 1; // 0x26c
	float CloudAmbientOcclusionStrength; // 0x270
	float CloudAmbientOcclusionExtent; // 0x274
	float CloudAmbientOcclusionMapResolutionScale; // 0x278
	float CloudAmbientOcclusionApertureScale; // 0x27c
	EOcclusionCombineMode OcclusionCombineMode; // 0x280
	UTextureCube* BlendDestinationCubemap; // 0x338
};

struct UVectorFieldComponent : UPrimitiveComponent {
	UVectorField* VectorField; // 0x440
	float Intensity; // 0x448
	float Tightness; // 0x44c
	char bPreviewVectorField : 1; // 0x450
};

struct ARadialForceActor : ARigidBodyBase {
	URadialForceComponent* ForceComponent; // 0x220
};

struct UDrawFrustumComponent : UPrimitiveComponent {
	FColor FrustumColor; // 0x440
	float FrustumAngle; // 0x444
	float FrustumAspectRatio; // 0x448
	float FrustumStartDist; // 0x44c
	float FrustumEndDist; // 0x450
	UTexture* Texture; // 0x458
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct ABP_AudioActor_SoundSpawner_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USphereComponent* Sphere; // 0x228
	USceneComponent* DefaultSceneRoot; // 0x230
	USoundBase* SoundToSpawn; // 0x238
	int32_t NumberOfSpawns; // 0x240
	float MinTimer; // 0x244
	float MaxTimer; // 0x248
	int32_t MinSpawns; // 0x24c
	int32_t MaxSpawns; // 0x250
	bool bAutoStart; // 0x254
	bool bRepeat; // 0x255
	float VolumeScale; // 0x258
	float PitchScale; // 0x25c
	int32_t SpawnCounter; // 0x260
	float MinStepDuration; // 0x264
	float MaxStepDuration; // 0x268
	float MinVolumeRange; // 0x26c
	float MaxVolumeRange; // 0x270
	float MinPitchRange; // 0x274
	float MaxPitchRange; // 0x278
	USoundAttenuation* AttenuationSettings; // 0x280
	USoundConcurrency* ConcurrencySettings; // 0x288
	bool bIncludeHeight; // 0x290
	float SpawnRadius; // 0x294
	bool bContinueSpawner; // 0x298
	FVector PhraseLocation; // 0x29c
	bool bDelayFirstTime; // 0x2a8
};

struct UFieldSystemComponent : UPrimitiveComponent {
	UFieldSystem* FieldSystem; // 0x440
	TArray<TSoftObjectPtr<AChaosSolverActor>> SupportedSolvers; // 0x458
};

struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression {
	FExpressionInput TextureSize; // 0x40
	float ConstWidth; // 0x54
	float ConstHeight; // 0x58
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct UPhysicalMaterialMask : UObject {
	int32_t UVChannelIndex; // 0x28
	TextureAddress AddressX; // 0x2c
	TextureAddress AddressY; // 0x2d
};

struct UNiagaraDataInterfaceArrayQuat : UNiagaraDataInterfaceArray {
	TArray<FQuat> QuatData; // 0x50
};

struct UPaperFlipbookComponent : UMeshComponent {
	UPaperFlipbook* SourceFlipbook; // 0x468
	UMaterialInterface* Material; // 0x470
	float PlayRate; // 0x478
	char bLooping : 1; // 0x47c
	char bReversePlayback : 1; // 0x47c
	char bPlaying : 1; // 0x47c
	float AccumulatedTime; // 0x480
	int32_t CachedFrameIndex; // 0x484
	FLinearColor SpriteColor; // 0x488
	UBodySetup* CachedBodySetup; // 0x498
	FMulticastInlineDelegate OnFinishedPlaying; // 0x4a0
};

struct UBlackboardKeyType_String : UBlackboardKeyType {
	FString StringValue; // 0x30
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct UMaterialExpressionSceneDepthWithoutWater : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FVector2D ConstInput; // 0x58
	float FallbackDepth; // 0x60
};

struct UAISenseConfig_Blueprint : UAISenseConfig {
	UAISense_Blueprint* Implementation; // 0x48
};

struct ALuminAROrigin : AAROriginActor {
	UMRMeshComponent* MRMeshComponent; // 0x220
	UMaterialInterface* PlaneSurfaceMaterial; // 0x228
	UMaterialInterface* WireframeMaterial; // 0x230
};

struct UNiagaraDataInterfaceCurveBase : UNiagaraDataInterface {
	TArray<float> ShaderLUT; // 0x38
	float LUTMinTime; // 0x48
	float LUTMaxTime; // 0x4c
	float LUTInvTimeRange; // 0x50
	float LUTNumSamplesMinusOne; // 0x54
	char bUseLUT : 1; // 0x58
	char bExposeCurve : 1; // 0x58
	FName ExposedName; // 0x5c
	UTexture2D* ExposedTexture; // 0x68
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
