namespace off {
	constexpr auto GNames = 0x523d080;
	constexpr auto GObjects = 0x52793e0;
	constexpr auto GWorld = 0x53c0d60;
}
struct UIntSerialization {
	uint16_t UnsignedInt16Variable; // 0x28
	uint32_t UnsignedInt32Variable; // 0x2c
	uint64_t UnsignedInt64Variable; // 0x30
	int8_t SignedInt8Variable; // 0x38
	int16_t SignedInt16Variable; // 0x3a
	int64_t SignedInt64Variable; // 0x40
	char UnsignedInt8Variable; // 0x48
	int32_t SignedInt32Variable; // 0x4c
};

struct UANIMBP_Zipcuffs_Placed_FP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2c8
	FAnimNode_Root AnimGraphNode_Root; // 0x348
};

struct AReadyOrNotLevelScript {
	EGenerationType WorldGenerationType; // 0x228
	UMaterial* TAASharpenFilter; // 0x230
	TArray<AActor*> SpawnedFromNotifyActors; // 0x238
	ACoverGenerator* CoverGenerator; // 0x248
	float FlashlightIntensity; // 0x250
	TArray<ABlockingVolume*> BlockingVolumesInLevel; // 0x258
	TArray<AOneWayBlockingVolume*> OneWayBlockingVolumesInLevel; // 0x268
	AConversationManager* ConversationManager; // 0x278
	TMap<ELightType, FName> LightingScenarios; // 0x280
	ELightType LightingType; // 0x2d0
	bool bDrawCoverDebug; // 0x2d1
	FLevelDataLookupTable LevelData; // 0x2d8
	UMusicData* MusicData; // 0x8d8
	UItemData* ItemData; // 0x8e0
	USoundData* SoundData; // 0x8e8
	FMulticastInlineDelegate Delegate_OnOutOfBoundsTimeLimitEnded; // 0x8f0
	float OutOfBounds_MaxTimeLimit; // 0x900
	float OutOfBoundsTimeRemaining; // 0x904
	TArray<AAmbientSound*> AudioSourcesInLevel; // 0x910
	TArray<AFMODAmbientSound*> FMODAudioSourcesInLevel; // 0x920
	bool bUseDarkness; // 0x940
	float MinimumLightIntensityForSource; // 0x944
	float DarknessSightRangeMultiplier; // 0x948
	bool bIncludeWorldLightsAsSources; // 0x94c
	bool bRaining; // 0x94d
	bool bSpawnOfficerAI; // 0x94e
	ULevelSequence* LevelSequenceMVP; // 0x950
	ULevelSequence* LevelSequenceTeam; // 0x958
	ULevelSequencePlayer* LastPlayedSequence; // 0x960
};

struct UTemplateSequence {
	UMovieScene* MovieScene; // 0x60
	TSoftClassPtr<UObject> BoundActorClass; // 0x68
	TSoftObjectPtr<AActor> BoundPreviewActor; // 0x90
	TMap<FGuid, FName> BoundActorComponents; // 0xb8
};

struct UGeometryCacheCodecBase {
	TArray<int32_t> TopologyRanges; // 0x28
};

struct USoundSourceBus {
	ESourceBusChannels SourceBusChannels; // 0x370
	float SourceBusDuration; // 0x374
	UAudioBus* AudioBus; // 0x378
	char bAutoDeactivateWhenSilent : 1; // 0x380
};

struct UCreateSessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UW_MissionEndBonus_C {
	UTextBlock* BonusAmount; // 0x260
	UTextBlock* BonusName; // 0x268
	UTextBlock* BonusScoreAmount; // 0x270
	FText BonusTxt; // 0x278
	FText BonusAmountTxt; // 0x290
	FText ScoreAmountTxt; // 0x2a8
};

struct AReadyOrNotAudioVolume {
	UBillboardComponent* BillboardComponent; // 0x258
	TArray<UFMODEvent*> ReverbEvents; // 0x260
	TArray<FFMODEventInstance> EventInstances; // 0x270
	bool bReverbActivated; // 0x280
	TArray<UFMODAudioComponent*> AttachedAudioComponents; // 0x288
};

struct AOptiwand {
	UAnimMontage* Montage_StartOptiwandADS; // 0x8f8
	UAnimMontage* Montage_EndOptiwandADS; // 0x900
	float CollisionTraceDistance; // 0x908
	UFMODEvent* FMODOptiwandMove; // 0x910
	UFMODEvent* FMODOptiwandEnterView; // 0x918
	UFMODEvent* FMODOptiwandExitView; // 0x920
	UMaterialInstance* MI_AIOutline; // 0x928
	USceneCaptureComponent2D* SceneCapture2D; // 0x938
	UTextureRenderTarget2D* CameraRenderTarget; // 0x940
	ACameraActor* CameraActor; // 0x948
	FVector LookAtPosition; // 0x950
	FRotator LookAtRotation; // 0x95c
	FRotator OptiwandCaptureRotation; // 0x968
	char bMirorring : 1; // 0x974
	bool bRepMirroring; // 0x975
	char bInUse : 1; // 0x976
	ADoor* LastUsedDoor; // 0x978
	UFMODAudioComponent* FMODOptiwandMoveAudioComp; // 0x980
	UFMODAudioComponent* FMODOptiwandEnterViewComp; // 0x988
	UFMODAudioComponent* FMODOptiwandExitViewComp; // 0x990
};

struct UPawnAction_Move {
	AActor* GoalActor; // 0x90
	FVector GoalLocation; // 0x98
	float AcceptableRadius; // 0xa4
	UNavigationQueryFilter* FilterClass; // 0xa8
	char bAllowStrafe : 1; // 0xb0
	char bFinishOnOverlap : 1; // 0xb0
	char bUsePathfinding : 1; // 0xb0
	char bAllowPartialPath : 1; // 0xb0
	char bProjectGoalToNavigation : 1; // 0xb0
	char bUpdatePathToGoal : 1; // 0xb0
	char bAbortChildActionOnPathChange : 1; // 0xb0
};

struct UMaterialParameterCollection {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct ULoudnessNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UParticleModuleVectorFieldRotation {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UAIPerceptionComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xb0
	UAISense* DominantSense; // 0xc0
	AAIController* AIOwner; // 0xd8
	FMulticastInlineDelegate OnPerceptionUpdated; // 0x160
	FMulticastInlineDelegate OnTargetPerceptionUpdated; // 0x170
	FMulticastInlineDelegate OnTargetPerceptionInfoUpdated; // 0x180
};

struct UParticleModuleVelocityBase {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct UInterpTrackFloatProp {
	FName PropertyName; // 0x90
};

struct ALastKnownPositionActor {
	USceneComponent* SceneRoot; // 0x220
};

struct UIpConnection {
	float SocketErrorDisconnectDelay; // 0x1bf8
};

struct USourceEffectEnvelopeFollowerPreset {
	FSourceEffectEnvelopeFollowerSettings Settings; // 0x9c
};

struct UTextBlockWidgetStyle {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UFieldSystemComponent {
	UFieldSystem* FieldSystem; // 0x450
	bool bIsWorldField; // 0x458
	bool bIsChaosField; // 0x459
	TArray<TSoftObjectPtr<AChaosSolverActor>> SupportedSolvers; // 0x460
	FFieldObjectCommands ConstructionCommands; // 0x470
	FFieldObjectCommands BufferCommands; // 0x4a0
};

struct UFXSystemAsset {
	uint32_t MaxPoolSize; // 0x28
	uint32_t PoolPrimeSize; // 0x2c
};

struct UInterpTrackInstAnimControl {
	float LastUpdatePosition; // 0x28
};

struct UMagicLeapPlanesComponent {
	TArray<EMagicLeapPlaneQueryFlags> QueryFlags; // 0x1f8
	UBoxComponent* SearchVolume; // 0x208
	int32_t MaxResults; // 0x210
	float MinHolePerimeter; // 0x214
	float MinPlaneArea; // 0x218
	EMagicLeapPlaneQueryType QueryType; // 0x21c
	float SimilarityThreshold; // 0x220
	FMulticastInlineDelegate OnPlanesQueryResult; // 0x228
	FMulticastInlineDelegate OnPersistentPlanesQueryResult; // 0x238
};

struct UMaterialExpressionTextureSample {
	FExpressionInput Coordinates; // 0x48
};

struct ULandscapeSplineSegment {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct UGameplayTask {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UW_KeyDisplay_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* keyDisplayName; // 0x268
	UTextBlock* KeyName; // 0x270
	FInputEntry InputEntry; // 0x278
};

struct UPhysicsThrusterComponent {
	float ThrustStrength; // 0x1f8
};

struct UMaterialExpressionReflectionCapturePassSwitch {
	FExpressionInput Default; // 0x40
	FExpressionInput reflection; // 0x54
};

struct UMaterialExpressionAtmosphericFogColor {
	FExpressionInput WorldPosition; // 0x40
};

struct ULandscapeMeshProxyComponent {
	FGuid LandscapeGuid; // 0x4e0
	TArray<FIntPoint> ProxyComponentBases; // 0x4f0
	int8_t ProxyLOD; // 0x500
};

struct UCoverComponent {
	bool bDrawDebugCover; // 0xb0
};

struct AGS_SearchAndDestroy_C {
	USceneComponent* DefaultSceneRoot; // 0x6d0
};

struct UInterpTrackVectorBase {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UEnvQueryGenerator_BlueprintBase {
	FText GeneratorsActionDescription; // 0x50
	UEnvQueryContext* Context; // 0x68
	UEnvQueryItemType* GeneratedItemType; // 0x70
};

struct UIntervalGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UAnimNotify_SpawnWeapon {
	TArray<ABaseMagazineWeapon*> PotentialWeapons; // 0x38
};

struct UMaterialExpressionDepthFade {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct UInputComponent {
	TArray<FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x120
};

struct UAnimNotify_AIThrowPendingItem {
	FName BoneToSpawnOn; // 0x38
	FTransform RelativeTransform; // 0x40
	char bCustomThrowDirection : 1; // 0x70
	FRotator ThrowDirection; // 0x74
};

struct UGameplayTask_TimeLimitedExecution {
	FMulticastInlineDelegate OnFinished; // 0x68
	FMulticastInlineDelegate OnTimeExpired; // 0x78
};

struct UInterpTrackColorProp {
	FName PropertyName; // 0x90
};

struct ASecondary_Tec9_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
	UPointLightComponent* PointLight; // 0x1138
	USpotLightComponent* SpotLight; // 0x1140
};

struct USubmixEffectConvolutionReverbPreset {
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	FSubmixEffectConvolutionReverbSettings Settings; // 0x70
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x98
	bool bEnableHardwareAcceleration; // 0x99
};

struct AC2Explosive {
	bool bIsValidPlacement; // 0x8f8
	FHitResult LastGoodPlacement; // 0x8fc
	APlacedC2Explosive* LastPlacedC2Explosive; // 0x988
	float MaxPlacementDistance; // 0x990
	AActor* CurrentActorPlacement; // 0x998
	APlacedC2Explosive* PlacedC2Class; // 0x9a0
};

struct UMaterialExpressionTextureSampleParameterSubUV {
	char bBlend : 1; // 0x80
};

struct UW_DebugInfo_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* DebugName_Text; // 0x268
	UTextBlock* DebugValue_Text; // 0x270
	UImage* Image_54; // 0x278
	FText DebugName; // 0x280
	FSlateFontInfo DebugNameFont; // 0x298
	FSlateFontInfo DebugValueFont; // 0x2f0
};

struct UAnimSharingStateInstance {
	UAnimSequence* AnimationToPlay; // 0x2b8
	float PermutationTimeOffset; // 0x2c0
	float PlayRate; // 0x2c4
	bool bStateBool; // 0x2c8
	UAnimSharingInstance* Instance; // 0x2d0
};

struct APlacedZipcuffs {
	USkeletalMeshComponent* ZipcuffMesh; // 0x220
};

struct UNiagaraDataInterfaceGrid3D {
	FIntVector NumCells; // 0xd8
	float CellSize; // 0xe4
	int32_t NumCellsMaxAxis; // 0xe8
	ESetResolutionMethod SetResolutionMethod; // 0xec
	FVector WorldBBoxSize; // 0xf0
};

struct UMaterialExpressionArcsineFast {
	FExpressionInput Input; // 0x40
};

struct UMotivityTweakData {
	FMotivityTimeData PredictionData; // 0x28
	FMotivityCalibrationData CalibrationData; // 0x38
};

struct UEnvQueryGenerator_Donut {
	FAIDataProviderFloatValue InnerRadius; // 0x80
	FAIDataProviderFloatValue OuterRadius; // 0xb8
	FAIDataProviderIntValue NumberOfRings; // 0xf0
	FAIDataProviderIntValue PointsPerRing; // 0x128
	FEnvDirection ArcDirection; // 0x160
	FAIDataProviderFloatValue ArcAngle; // 0x180
	bool bUseSpiralPattern; // 0x1b8
	UEnvQueryContext* Center; // 0x1c0
	char bDefineArc : 1; // 0x1c8
};

struct UPlatformInterfaceWebResponse {
	FString OriginalURL; // 0x28
	int32_t ResponseCode; // 0x38
	int32_t Tag; // 0x3c
	FString StringResponse; // 0x40
	TArray<char> BinaryResponse; // 0x50
};

struct UInterpTrackLinearColorProp {
	FName PropertyName; // 0x90
};

struct ALOBBY_START_Blueprint_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
};

struct UANIMBP_MP5A2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x350
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x518
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x688
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x708
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x788
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x808
	float Mag01Alpha; // 0x888
	char CurrentFireMode; // 0x88c
};

struct UNiagaraBaselineController_Basic {
	int32_t NumInstances; // 0x68
	TArray<UNiagaraComponent*> SpawnedComponents; // 0x70
};

struct UFriendsList_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UScrollBox* ScrollBox_1; // 0x2a8
	float LastScrolloffset; // 0x2b0
};

struct UW_LoadoutClass_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* Anim_ButtonPressed; // 0x280
	UW_StandardButton_C* Button; // 0x288
	UImage* CollapseIcon_Image; // 0x290
	UWidgetSwitcher* ExpandCollapse_Switcher; // 0x298
	UImage* ExpandIcon_Image; // 0x2a0
	UVerticalBox* MainContainer; // 0x2a8
	UOverlay* SelectedItemInfo_Container; // 0x2b0
	UW_Text_C* txt_ItemName; // 0x2b8
	UW_Text_C* txt_LoadoutClass; // 0x2c0
	FLoadoutCategory LoadoutCategory; // 0x2c8
	TArray<UW_LoadoutItem_C*> LoadoutItems; // 0x330
	bool bCollapsed; // 0x340
	FMulticastInlineDelegate OnButtonClicked; // 0x348
	FMulticastInlineDelegate OnButtonHovered; // 0x358
	FMulticastInlineDelegate OnChildButtonClicked; // 0x368
	UW_LoadoutCategory_C* Owner; // 0x378
	bool bInMenuBounds; // 0x380
	bool bChildSelected; // 0x381
	bool bAnyKeyDown; // 0x382
	int32_t SelectedRow; // 0x384
	int32_t SelectedColumn; // 0x388
	FText DirectoryName; // 0x390
	UW_LoadoutItem_C* SelectedLoadoutItem; // 0x3a8
};

struct UBTService_RunEQS {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UNiagaraDataInterfaceChaosDestruction {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x38
	EDataSourceTypeEnum DataSourceType; // 0x88
	int32_t DataProcessFrequency; // 0x8c
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x90
	bool DoSpawn; // 0x94
	FVector2D SpawnMultiplierMinMax; // 0x98
	float SpawnChance; // 0xa0
	FVector2D ImpulseToSpawnMinMax; // 0xa4
	FVector2D SpeedToSpawnMinMax; // 0xac
	FVector2D MassToSpawnMinMax; // 0xb4
	FVector2D ExtentMinToSpawnMinMax; // 0xbc
	FVector2D ExtentMaxToSpawnMinMax; // 0xc4
	FVector2D VolumeToSpawnMinMax; // 0xcc
	FVector2D SolverTimeToSpawnMinMax; // 0xd4
	int32_t SurfaceTypeToSpawn; // 0xdc
	ELocationFilteringModeEnum LocationFilteringMode; // 0xe0
	ELocationXToSpawnEnum LocationXToSpawn; // 0xe1
	FVector2D LocationXToSpawnMinMax; // 0xe4
	ELocationYToSpawnEnum LocationYToSpawn; // 0xec
	FVector2D LocationYToSpawnMinMax; // 0xf0
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf8
	FVector2D LocationZToSpawnMinMax; // 0xfc
	EDataSortTypeEnum DataSortingType; // 0x104
	bool bGetExternalCollisionData; // 0x105
	bool DoSpatialHash; // 0x106
	FVector SpatialHashVolumeMin; // 0x108
	FVector SpatialHashVolumeMax; // 0x114
	FVector SpatialHashVolumeCellSize; // 0x120
	int32_t MaxDataPerCell; // 0x12c
	bool bApplyMaterialsFilter; // 0x130
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x138
	bool bGetExternalBreakingData; // 0x188
	bool bGetExternalTrailingData; // 0x189
	FVector2D RandomPositionMagnitudeMinMax; // 0x18c
	float InheritedVelocityMultiplier; // 0x194
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x198
	FVector2D RandomVelocityMagnitudeMinMax; // 0x19c
	float SpreadAngleMax; // 0x1a4
	FVector VelocityOffsetMin; // 0x1a8
	FVector VelocityOffsetMax; // 0x1b4
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1c0
	float MaxLatency; // 0x1c8
	EDebugTypeEnum DebugType; // 0x1cc
	int32_t LastSpawnedPointID; // 0x1d0
	float LastSpawnTime; // 0x1d4
	float SolverTime; // 0x1e8
	float TimeStampOfLastProcessedData; // 0x1ec
};

struct APrimary_G36C_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
};

struct ADoorwayWithoutDoor {
	UDoorwayComponent* Doorway; // 0x220
};

struct UInterpTrackAnimControl {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct USkeleton {
	TArray<FBoneNode> BoneTree; // 0x38
	TArray<FTransform> RefLocalPoses; // 0x48
	FGuid VirtualBoneGuid; // 0x170
	TArray<FVirtualBone> VirtualBones; // 0x180
	TArray<USkeletalMeshSocket*> Sockets; // 0x190
	FSmartNameContainer SmartNames; // 0x1f0
	TArray<UBlendProfile*> BlendProfiles; // 0x270
	TArray<FAnimSlotGroup> SlotGroups; // 0x280
	TArray<UAssetUserData*> AssetUserData; // 0x380
};

struct USteamRequestGroupOfficersCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UParticleModuleMeshRotationRateMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x30
};

struct AFlashLightTrackingPoint {
	UStaticMeshComponent* MeshComp; // 0x220
	UAIPerceptionStimuliSourceComponent* PerceptionStimuliComp; // 0x228
};

struct APickupEvidenceByTag {
	FName EvidenceTag; // 0x278
};

struct UDatasmithSpotLightComponentTemplate {
	float InnerConeAngle; // 0x30
	float OuterConeAngle; // 0x34
};

struct UParticleModuleKillBox {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct UUserDefinedStruct {
	EUserDefinedStructureStatus Status; // 0xc0
	FGuid Guid; // 0xc4
};

struct UMovieSceneSkeletalAnimationTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
	bool bUseLegacySectionIndexBlend; // 0xa8
	FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams; // 0xb0
	bool bBlendFirstChildOfRoot; // 0xe0
};

struct UEditableText {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FText HintText; // 0x130
	FDelegate HintTextDelegate; // 0x148
	FEditableTextStyle WidgetStyle; // 0x158
	USlateWidgetStyleAsset* Style; // 0x378
	USlateBrushAsset* BackgroundImageSelected; // 0x380
	USlateBrushAsset* BackgroundImageComposing; // 0x388
	USlateBrushAsset* CaretImage; // 0x390
	FSlateFontInfo Font; // 0x398
	FSlateColor ColorAndOpacity; // 0x3f0
	bool IsReadOnly; // 0x418
	bool IsPassword; // 0x419
	float MinimumDesiredWidth; // 0x41c
	bool IsCaretMovedWhenGainFocus; // 0x420
	bool SelectAllTextWhenFocused; // 0x421
	bool RevertTextOnEscape; // 0x422
	bool ClearKeyboardFocusOnCommit; // 0x423
	bool SelectAllTextOnCommit; // 0x424
	bool AllowContextMenu; // 0x425
	EVirtualKeyboardType KeyboardType; // 0x426
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x427
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x428
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x429
	ETextJustify Justification; // 0x42a
	FShapedTextOptions ShapedTextOptions; // 0x42b
	FMulticastInlineDelegate OnTextChanged; // 0x430
	FMulticastInlineDelegate OnTextCommitted; // 0x440
};

struct USynthSound {
	USynthComponent* OwningSynthComponent; // 0x3c0
};

struct UMaterialExpressionBlackBody {
	FExpressionInput Temp; // 0x40
};

struct UPropertyValue {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct UBP_GameInstance_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x570
	TArray<FString> StreamedLevels; // 0x578
	FString ModeURL; // 0x588
};

struct UPhononGeometryComponent {
	bool ExportAllChildren; // 0x1f8
	uint32_t NumVertices; // 0x1fc
	uint32_t NumTriangles; // 0x200
};

struct AGM_GunGame_C {
	USceneComponent* DefaultSceneRoot; // 0x830
};

struct UVectorFieldAnimated {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UTextRenderComponent {
	FText Text; // 0x450
	UMaterialInterface* TextMaterial; // 0x468
	UFont* Font; // 0x470
	EHorizTextAligment HorizontalAlignment; // 0x478
	EVerticalTextAligment VerticalAlignment; // 0x479
	FColor TextRenderColor; // 0x47c
	float XScale; // 0x480
	float YScale; // 0x484
	float WorldSize; // 0x488
	float InvDefaultSize; // 0x48c
	float HorizSpacingAdjust; // 0x490
	float VertSpacingAdjust; // 0x494
	char bAlwaysRenderAsText : 1; // 0x498
};

struct UBlendRagdollAnimNotifyState {
	float TotalBlendDuration; // 0x30
	float CurrentBlendAmount; // 0x34
	float AngularVelocityStrength; // 0x38
	float OrientationStrength; // 0x3c
	float MaxAngularForce; // 0x40
	bool bDisableLimitsDuringTransition; // 0x44
	TArray<FConstraintLimitData> ConstraintLimitCaches; // 0x48
};

struct UMovieSceneEasingExternalCurve {
	UCurveFloat* Curve; // 0x30
};

struct UClothPhysicalMeshDataBase_Legacy {
	TArray<FVector> Vertices; // 0x28
	TArray<FVector> Normals; // 0x38
	TArray<uint32_t> Indices; // 0x48
	TArray<float> InverseMasses; // 0x58
	TArray<FClothVertBoneData> BoneData; // 0x68
	int32_t NumFixedVerts; // 0x78
	int32_t MaxBoneWeights; // 0x7c
	TArray<uint32_t> SelfCollisionIndices; // 0x80
};

struct UW_SkinItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* Anim_ButtonPressed; // 0x280
	UImage* BottonBorder_Image; // 0x288
	UW_StandardButton_C* Button; // 0x290
	UImage* ItemIcon_Image; // 0x298
	UImage* LeftBorder_Image; // 0x2a0
	USizeBox* RadioIcon_SizeBox; // 0x2a8
	UImage* RightBorder_Image; // 0x2b0
	UImage* SelectedRadioIcon_Image; // 0x2b8
	UImage* TopBorder_Image; // 0x2c0
	UW_Text_C* txt_ItemClassName; // 0x2c8
	UW_Text_C* txt_ItemName; // 0x2d0
	UImage* UnselectedRadioIcon_Image; // 0x2d8
	FText ItemName; // 0x2e0
	USkinComponent* SkinClass; // 0x2f8
	UW_SkinCategory_C* Owner; // 0x300
	bool bSelected; // 0x308
	FMulticastInlineDelegate OnButtonClicked; // 0x310
	FMulticastInlineDelegate OnButtonHovered; // 0x320
	FMulticastInlineDelegate OnButtonUnhovered; // 0x330
};

struct UPrimitiveComponent {
	float MinDrawDistance; // 0x200
	float LDMaxDrawDistance; // 0x204
	float CachedMaxDrawDistance; // 0x208
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x20c
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x20d
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x20e
	ELightmapType LightmapType; // 0x20f
	char bUseMaxLODAsImposter : 1; // 0x210
	char bBatchImpostersAsInstances : 1; // 0x210
	char bNeverDistanceCull : 1; // 0x210
	char bAlwaysCreatePhysicsState : 1; // 0x210
	char bGenerateOverlapEvents : 1; // 0x211
	char bMultiBodyOverlap : 1; // 0x211
	char bTraceComplexOnMove : 1; // 0x211
	char bReturnMaterialOnMove : 1; // 0x211
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x211
	char bAllowCullDistanceVolume : 1; // 0x211
	char bHasMotionBlurVelocityMeshes : 1; // 0x211
	char bVisibleInReflectionCaptures : 1; // 0x211
	char bVisibleInRealTimeSkyCaptures : 1; // 0x212
	char bVisibleInRayTracing : 1; // 0x212
	char bRenderInMainPass : 1; // 0x212
	char bRenderInDepthPass : 1; // 0x212
	char bReceivesDecals : 1; // 0x212
	char bOwnerNoSee : 1; // 0x212
	char bOnlyOwnerSee : 1; // 0x212
	char bTreatAsBackgroundForOcclusion : 1; // 0x212
	char bUseAsOccluder : 1; // 0x213
	char bSelectable : 1; // 0x213
	char bForceMipStreaming : 1; // 0x213
	char bHasPerInstanceHitProxies : 1; // 0x213
	char CastShadow : 1; // 0x213
	char bAffectDynamicIndirectLighting : 1; // 0x213
	char bAffectDistanceFieldLighting : 1; // 0x213
	char bCastDynamicShadow : 1; // 0x213
	char bCastStaticShadow : 1; // 0x214
	char bCastVolumetricTranslucentShadow : 1; // 0x214
	char bCastContactShadow : 1; // 0x214
	char bSelfShadowOnly : 1; // 0x214
	char bCastFarShadow : 1; // 0x214
	char bCastInsetShadow : 1; // 0x214
	char bCastCinematicShadow : 1; // 0x214
	char bCastHiddenShadow : 1; // 0x214
	char bCastShadowAsTwoSided : 1; // 0x215
	char bLightAsIfStatic : 1; // 0x215
	char bLightAttachmentsAsGroup : 1; // 0x215
	char bExcludeFromLightAttachmentGroup : 1; // 0x215
	char bReceiveMobileCSMShadows : 1; // 0x215
	char bSingleSampleShadowFromStationaryLights : 1; // 0x215
	char bIgnoreRadialImpulse : 1; // 0x215
	char bIgnoreRadialForce : 1; // 0x215
	char bApplyImpulseOnDamage : 1; // 0x216
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x216
	char bFillCollisionUnderneathForNavmesh : 1; // 0x216
	char AlwaysLoadOnClient : 1; // 0x216
	char AlwaysLoadOnServer : 1; // 0x216
	char bUseEditorCompositing : 1; // 0x216
	char bRenderCustomDepth : 1; // 0x216
	char bVisibleInSceneCaptureOnly : 1; // 0x216
	char bHiddenInSceneCapture : 1; // 0x217
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x218
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x21a
	FLightingChannels LightingChannels; // 0x21b
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x21c
	int32_t CustomDepthStencilValue; // 0x220
	FCustomPrimitiveData CustomPrimitiveData; // 0x228
	FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x238
	int32_t TranslucencySortPriority; // 0x250
	float TranslucencySortDistanceOffset; // 0x254
	int32_t VisibilityId; // 0x258
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x260
	int8_t VirtualTextureLodBias; // 0x270
	int8_t VirtualTextureCullMips; // 0x271
	int8_t VirtualTextureMinCoverage; // 0x272
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x273
	float LpvBiasMultiplier; // 0x278
	float BoundsScale; // 0x284
	TArray<AActor*> MoveIgnoreActors; // 0x298
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2a8
	FBodyInstance BodyInstance; // 0x2c8
	FMulticastSparseDelegate OnComponentHit; // 0x420
	FMulticastSparseDelegate OnComponentBeginOverlap; // 0x421
	FMulticastSparseDelegate OnComponentEndOverlap; // 0x422
	FMulticastSparseDelegate OnComponentWake; // 0x423
	FMulticastSparseDelegate OnComponentSleep; // 0x424
	FMulticastSparseDelegate OnBeginCursorOver; // 0x426
	FMulticastSparseDelegate OnEndCursorOver; // 0x427
	FMulticastSparseDelegate OnClicked; // 0x428
	FMulticastSparseDelegate OnReleased; // 0x429
	FMulticastSparseDelegate OnInputTouchBegin; // 0x42a
	FMulticastSparseDelegate OnInputTouchEnd; // 0x42b
	FMulticastSparseDelegate OnInputTouchEnter; // 0x42c
	FMulticastSparseDelegate OnInputTouchLeave; // 0x42d
	UPrimitiveComponent* LODParentPrimitive; // 0x448
};

struct ACableActor {
	UCableComponent* CableComponent; // 0x220
};

struct UStereoLayerShapeEquirect {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UNavigationGraphNodeComponent {
	FNavGraphNode Node; // 0x1f8
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x210
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x218
};

struct UW_MissionEnd_Rating_Progress_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* GradeReveal; // 0x268
	UImage* Fade; // 0x270
	UImage* ProgressMeter; // 0x278
	UW_Text_C* txt_Debug; // 0x280
	UW_Text_C* txt_Debug_2; // 0x288
	UW_Text_C* txt_Debug_3; // 0x290
	UW_Text_C* txt_Grade; // 0x298
	UW_Text_C* txt_PlusMinus; // 0x2a0
	UW_Text_C* txt_Score; // 0x2a8
	UVerticalBox* VB_DEBUG; // 0x2b0
	float HighScore; // 0x2b8
	float ScorePercent; // 0x2bc
	FString Grades; // 0x2c0
	float Score; // 0x2d0
	UMaterialInstanceDynamic* ProgressDynMat; // 0x2d8
	FString Grade; // 0x2e0
	UW_MissionEnd_Rating_ScorePanel_C* ScorePanel; // 0x2f0
	UW_MissionEnd_Rating_ScorePanel_C* PenaltyPanel; // 0x2f8
	FScoreGroup ScoreData; // 0x300
	FScorePenaltyData PenaltyData; // 0x338
	int32_t CurrentScore; // 0x350
	int32_t TargetScore; // 0x354
	int32_t MaxScore; // 0x358
	bool AddingScore; // 0x35c
	bool Failed; // 0x35d
	bool Penalty; // 0x35e
	float AnimTime; // 0x360
	float AnimDuration; // 0x364
	float AnimProgress; // 0x368
	int32_t DEBUG COUNT; // 0x36c
	bool playingSound; // 0x370
	UFMODEvent* PenaltyCount; // 0x378
	UFMODEvent* scoreCount; // 0x380
	UFMODEvent* scoreGrade; // 0x388
	FFMODEventInstance countEvent; // 0x390
};

struct UInterpTrackInstProperty {
	TFieldPath<FProperty> InterpProperty; // 0x28
	UObject* PropertyOuterObjectInst; // 0x48
};

struct UMovieSceneSequenceTickManager {
	TArray<FMovieSceneSequenceActorPointers> SequenceActors; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x38
};

struct UHierarchicalLODSetup {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UMaterialExpressionClearCoatNormalCustomOutput {
	FExpressionInput Input; // 0x40
};

struct AFlareImpactEffects_C {
	USceneComponent* DefaultSceneRoot; // 0xcb0
};

struct ULandscapeSplinesComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x450
	TArray<ULandscapeSplineSegment*> Segments; // 0x460
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x470
};

struct UDisarmStandaloneTrapActivity {
	ATrapActor* TrapToDisarm; // 0x1a8
};

struct UParticleModuleMeshRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UCameraComponent {
	float FieldOfView; // 0x1f8
	float OrthoWidth; // 0x1fc
	float OrthoNearClipPlane; // 0x200
	float OrthoFarClipPlane; // 0x204
	float AspectRatio; // 0x208
	char bConstrainAspectRatio : 1; // 0x20c
	char bUseFieldOfViewForLOD : 1; // 0x20c
	char bLockToHmd : 1; // 0x20c
	char bUsePawnControlRotation : 1; // 0x20c
	ECameraProjectionMode ProjectionMode; // 0x20d
	float PostProcessBlendWeight; // 0x240
	FPostProcessSettings PostProcessSettings; // 0x270
};

struct UVectorFieldStatic {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
};

struct UNodeMappingContainer {
	TMap<FName, FNodeItem> SourceItems; // 0x28
	TMap<FName, FNodeItem> TargetItems; // 0x78
	TMap<FName, FName> SourceToTarget; // 0xc8
	TSoftObjectPtr<UObject> SourceAsset; // 0x118
	TSoftObjectPtr<UObject> TargetAsset; // 0x140
};

struct APainCausingVolume {
	char bPainCausing : 1; // 0x268
	float DamagePerSec; // 0x26c
	UDamageType* DamageType; // 0x270
	float PainInterval; // 0x278
	char bEntryPain : 1; // 0x27c
	char BACKUP_bPainCausing : 1; // 0x27c
	AController* DamageInstigator; // 0x280
};

struct UWidgetAnimationPlayCallbackProxy {
	FMulticastInlineDelegate Finished; // 0x28
};

struct UAnimNotify_CollectEvidence {
	char bCollectFinished : 1; // 0x38
};

struct AAllImpactEffects_C {
	USceneComponent* DefaultSceneRoot; // 0xcb0
};

struct UMaterialExpressionArctangent {
	FExpressionInput Input; // 0x40
};

struct UDamageType {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct USoundEffectSourcePresetChain {
	TArray<FSourceEffectChainEntry> Chain; // 0x28
	char bPlayEffectChainTails : 1; // 0x38
};

struct UInvalidationBox {
	bool bCanCache; // 0x120
	bool CacheRelativeTransforms; // 0x121
};

struct UBorderSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct AArmor_Light_V2_C {
	UCapsuleComponent* Collision; // 0xa30
};

struct UNiagaraDataInterfaceArrayFloat4 {
	TArray<FVector4> FloatData; // 0x50
};

struct UParticleModuleMeshRotation {
	FRawDistributionVector StartRotation; // 0x30
	char bInheritParent : 1; // 0x78
};

struct UFieldSystemMetaDataFilter {
	EFieldFilterType FilterType; // 0xb0
};

struct UW_StandardTabControl_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UHorizontalBox* ButtonContainer; // 0x268
	UNamedSlot* Slot1; // 0x270
	UNamedSlot* Slot2; // 0x278
	UNamedSlot* Slot3; // 0x280
	UNamedSlot* Slot4; // 0x288
	UNamedSlot* Slot5; // 0x290
	UNamedSlot* Slot6; // 0x298
	UNamedSlot* Slot7; // 0x2a0
	UNamedSlot* Slot8; // 0x2a8
	UWidgetSwitcher* SlotSwitcher; // 0x2b0
	UTextBlock* DescriptionWidget; // 0x2b8
	TArray<FText> DescriptionTexts; // 0x2c0
	TArray<FText> ButtonNames; // 0x2d0
	int32_t StartingSlot; // 0x2e0
	ETextJustify TabTextJustification; // 0x2e4
	int32_t TabTextSize; // 0x2e8
	UFont* TabTextFont; // 0x2f0
	FMargin TabTextPadding; // 0x2f8
	FName TabTextTypeface; // 0x308
	StandardButtonStyles TabDisplayType; // 0x310
	bool TabForceUppercase; // 0x311
	bool TabForceUppercaseDescription; // 0x312
	FSlateColor TabTextColor; // 0x318
	FMulticastInlineDelegate OnTabSelected; // 0x340
	int32_t CurrentSlot; // 0x350
	TArray<UW_StandardRadioButton_C*> Buttons; // 0x358
	FMargin TabButtonPadding; // 0x368
	FSlateChildSize TabButtonSize; // 0x378
	EVerticalAlignment ContentVerticalAlignment; // 0x380
	EHorizontalAlignment ContentHorizontalAlignment; // 0x381
};

struct UDistributionVectorParameterBase {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UMaterialExpressionBumpOffset {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UObjectiveMarkerComponent {
	char bEnabled : 1; // 0x5a0
	char bStartHidden : 1; // 0x5a0
	char bCustomLocation : 1; // 0x5a0
	char bFadeOffscreen : 1; // 0x5a0
	char bDistanceScaleIcon : 1; // 0x5a0
	char bCompletelyFadeWhenOverlappingOtherWidgets : 1; // 0x5a0
	char bCompletelyFadeWhenClose : 1; // 0x5a0
	float FadeAtDistance_Close; // 0x5a4
	char bCompletelyFadeWhenFar : 1; // 0x5a8
	float FadeAtDistance_Far; // 0x5ac
	char bHideDistanceInfo : 1; // 0x5b0
	float HideDistanceInfoAtDistance; // 0x5b4
	char bHideDirectionalArrow : 1; // 0x5b8
	char bDisplayMarkerText : 1; // 0x5b8
	FText MarkerText; // 0x5c0
	UObjectiveMarkerWidget* MarkerWidgetClass; // 0x5d8
	FSlateBrush IconBrush; // 0x5e0
	FLinearColor IconColorAndOpacity; // 0x668
	FVector2D IconSize; // 0x678
	char bDebug : 1; // 0x680
	UObjectiveMarkerWidget* ObjectiveMarkerWidget_Offscreen; // 0x688
	UObjectiveMarkerWidget* ObjectiveMarkerWidget_Onscreen; // 0x690
	bool bIsOffscreen; // 0x698
	bool bRequestingFadeOut; // 0x699
};

struct AEQSTestingPawn {
	UEnvQuery* QueryTemplate; // 0x4c0
	TArray<FEnvNamedValue> QueryParams; // 0x4c8
	TArray<FAIDynamicParam> QueryConfig; // 0x4d8
	float TimeLimitPerStep; // 0x4e8
	int32_t StepToDebugDraw; // 0x4ec
	EEnvQueryHightlightMode HighlightMode; // 0x4f0
	char bDrawLabels : 1; // 0x4f4
	char bDrawFailedItems : 1; // 0x4f4
	char bReRunQueryOnlyOnFinishedMove : 1; // 0x4f4
	char bShouldBeVisibleInGame : 1; // 0x4f4
	char bTickDuringGame : 1; // 0x4f4
	EEnvQueryRunMode QueryingMode; // 0x4f8
	FNavAgentProperties NavAgentProperties; // 0x500
};

struct UMaterialExpressionPerInstanceCustomData {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct AFormationActor {
	AActor* FollowActor; // 0x220
	int32_t MaxPositions; // 0x228
	float MaxRange; // 0x22c
	UCapsuleComponent* AlphaCapsule; // 0x230
	TArray<UBillboardComponent*> Positions; // 0x238
};

struct UThrowItemThroughDoorActivity {
	ABaseItem* ThrowItemClass; // 0x1d8
	FMulticastInlineDelegate OnThrowReady; // 0x1e0
	FMulticastInlineDelegate OnThrowingItem; // 0x1f0
	ABaseItem* ThrownItem; // 0x208
};

struct ACoverGenerator {
	bool ForceRefresh; // 0x220
	bool bRegenerateAtBeginPlay; // 0x221
	bool bRegenerateAtNavigationRebuilt; // 0x222
	float SegmentLength; // 0x224
	float MaxSegDist; // 0x228
	float CharHeight; // 0x22c
	float StepDistTrace; // 0x230
	float TraceLength; // 0x234
	float MinSpaceBetweenValidPoints; // 0x238
	float SphereSize; // 0x23c
	float WidthMaxAgent; // 0x240
	float HeightMaxCrouching; // 0x244
	float HeightMaxStanding; // 0x248
	float OffsetWhenLeaningSides; // 0x24c
	float OffsetFrontAim; // 0x250
	bool bDraw1AllSegmentPointsTested; // 0x254
	bool bDraw2SegmentPointsWithinBounds; // 0x255
	bool bDraw3SimpleCoverGeometryTest; // 0x256
	bool bDraw4SecondPassTracesSides; // 0x257
	bool bDraw4SecondPassTracesSidesFrontAndBottom; // 0x258
	bool bDraw5SecondPassArrows; // 0x259
	bool DebugDrawAllPoints; // 0x25a
	bool DebugDrawAllBusyPoints; // 0x25b
	bool DebugDisplayLog; // 0x25c
	float DebugDistance; // 0x260
	bool bDrawOctreeBounds; // 0x264
	TArray<UCoverPoint*> AllCoverPoints; // 0x270
	TArray<UCoverPoint*> CoverPointsCurrentlyUsed; // 0x280
};

struct UNiagaraRendererProperties {
	FNiagaraPlatformSet Platforms; // 0x28
	int32_t SortOrderHint; // 0x58
	ENiagaraRendererMotionVectorSetting MotionVectorSetting; // 0x5c
	bool bIsEnabled; // 0x60
	bool bMotionBlurEnabled; // 0x61
};

struct UMotoSynthSource {
	bool bConvertTo8Bit; // 0x28
	float DownSampleFactor; // 0x2c
	FRuntimeFloatCurve RPMCurve; // 0x30
	TArray<float> SourceData; // 0xb8
	TArray<int16_t> SourceDataPCM; // 0xc8
	int32_t SourceSampleRate; // 0xd8
	TArray<FGrainTableEntry> GrainTable; // 0xe0
};

struct UPlaneFalloff {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector Position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct UW_SpectatorCharacter_HUD_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* CenterPrintShow; // 0x280
	UWidgetAnimation* CenterPrintHide; // 0x288
	UWidgetAnimation* ShowReinforcements; // 0x290
	UWidgetAnimation* ShowDeathView; // 0x298
	UW_RichChatBox_C* BP_RichChatBox; // 0x2a0
	UTextBlock* CenterprintText; // 0x2a8
	UCanvasPanel* DeathViewCanvasCOOP; // 0x2b0
	UCanvasPanel* DeathViewCanvasPvP; // 0x2b8
	UWidgetSwitcher* DeathViewSwitcher; // 0x2c0
	UTextBlock* HeadCamTxt; // 0x2c8
	UVerticalBox* SpectatingBox; // 0x2d0
	UTextBlock* SpectatingNameText; // 0x2d8
	UTextBlock* TextBlock_119; // 0x2e0
	UTextBlock* TextBlock_198; // 0x2e8
	UTextBlock* Vote_Hotkeys; // 0x2f0
	UTextBlock* Vote_StarterName; // 0x2f8
	UTextBlock* Vote_TimeLeft; // 0x300
	UTextBlock* Vote_VoteName; // 0x308
	UTextBlock* Vote_Voters; // 0x310
	UVerticalBox* VotingDisplay; // 0x318
	UW_COOPDeathScreen_C* W_COOPDeathScreen; // 0x320
	UW_PvPDeathScreen_C* W_PvPDeathScreen; // 0x328
	FText SpectateControlsFormat; // 0x330
	FText SpectateControlsOnlyPrevious; // 0x348
	FText SpectateControlsOnlyNext; // 0x360
	float TimeUntilDeathViewAppears; // 0x378
	bool bStartedSpectating; // 0x37c
	bool bShownDeathView; // 0x37d
	float DeltaTime; // 0x380
	bool StartedShowingCenterPrint; // 0x384
	float CenterPrintTime; // 0x388
	bool CancelTick; // 0x38c
};

struct UEdGraph {
	UEdGraphSchema* Schema; // 0x28
	TArray<UEdGraphNode*> Nodes; // 0x30
	char bEditable : 1; // 0x40
	char bAllowDeletion : 1; // 0x40
	char bAllowRenaming : 1; // 0x40
};

struct UDistributionFloat {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UBTTask_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct USynthComponentMonoWaveTable {
	FMulticastInlineDelegate OnTableAltered; // 0x6c0
	FMulticastInlineDelegate OnNumTablesChanged; // 0x6d0
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x6e0
};

struct APlayerStart_VIP_Spawn {
	char bHasVisited : 1; // 0x250
	FText VIPSpawnDescriptor; // 0x258
	int32_t SuffixNumber; // 0x270
	UBoxComponent* SpawnBox; // 0x278
	UTextRenderComponent* TextRender; // 0x280
	UArrowComponent* SpawnDirection; // 0x288
};

struct APlayerHUD {
	UUserWidget* PlayerHUD; // 0x310
};

struct UNiagaraDataInterfaceVolumeTexture {
	UVolumeTexture* Texture; // 0x38
};

struct UW_WeaponWheel_ItemStat_Range_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x840
};

struct UMatineeCameraShake {
	float OscillationDuration; // 0xa8
	float OscillationBlendInTime; // 0xac
	float OscillationBlendOutTime; // 0xb0
	FROscillator RotOscillation; // 0xb4
	FVOscillator LocOscillation; // 0xd8
	FFOscillator FOVOscillation; // 0xfc
	float AnimPlayRate; // 0x108
	float AnimScale; // 0x10c
	float AnimBlendInTime; // 0x110
	float AnimBlendOutTime; // 0x114
	float RandomAnimSegmentDuration; // 0x118
	UCameraAnim* Anim; // 0x120
	UCameraAnimationSequence* AnimSequence; // 0x128
	char bRandomAnimSegment : 1; // 0x130
	float OscillatorTimeRemaining; // 0x134
	UCameraAnimInst* AnimInst; // 0x138
	USequenceCameraShakePattern* SequenceShakePattern; // 0x180
};

struct UBrainComponent {
	UBlackboardComponent* BlackboardComp; // 0xb8
	AAIController* AIOwner; // 0xc0
};

struct UEditableGameplayTagQueryExpression_AllExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct ANavLinkProxy {
	TArray<FNavigationLink> PointLinks; // 0x230
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x240
	UNavLinkCustomComponent* SmartLinkComp; // 0x250
	bool bSmartLinkIsRelevant; // 0x258
	FMulticastInlineDelegate OnSmartLinkReached; // 0x260
};

struct ABP_BallisticShield_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x940
	UFMODAudioComponent* FMOD_3P_Hit; // 0x948
	float GlassPhaseParam; // 0x950
};

struct UInputSettings {
	TArray<FInputAxisConfigEntry> AxisConfig; // 0x28
	char bAltEnterTogglesFullscreen : 1; // 0x38
	char bF11TogglesFullscreen : 1; // 0x38
	char bUseMouseForTouch : 1; // 0x38
	char bEnableMouseSmoothing : 1; // 0x38
	char bEnableFOVScaling : 1; // 0x38
	char bCaptureMouseOnLaunch : 1; // 0x38
	char bDefaultViewportMouseLock : 1; // 0x38
	char bAlwaysShowTouchInterface : 1; // 0x38
	char bShowConsoleOnFourFingerTap : 1; // 0x39
	char bEnableGestureRecognizer : 1; // 0x39
	bool bUseAutocorrect; // 0x3a
	TArray<FString> ExcludedAutocorrectOS; // 0x40
	TArray<FString> ExcludedAutocorrectCultures; // 0x50
	TArray<FString> ExcludedAutocorrectDeviceModels; // 0x60
	EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x70
	EMouseLockMode DefaultViewportMouseLockMode; // 0x71
	float FOVScale; // 0x74
	float DoubleClickTime; // 0x78
	TArray<FInputActionKeyMapping> ActionMappings; // 0x80
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x90
	TArray<FInputActionSpeechMapping> SpeechMappings; // 0xa0
	TSoftClassPtr<UObject> DefaultPlayerInputClass; // 0xb0
	TSoftClassPtr<UObject> DefaultInputComponentClass; // 0xd8
	FSoftObjectPath DefaultTouchInterface; // 0x100
	FKey ConsoleKey; // 0x118
	TArray<FKey> ConsoleKeys; // 0x130
};

struct UBTTaskNode {
	TArray<UBTService*> Services; // 0x58
	char bIgnoreRestartSelf : 1; // 0x68
};

struct ALODActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<FHLODInstancingKey, UInstancedStaticMeshComponent*> InstancedStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct UReadyOrNotGameUserSettings {
	float MasterSoundVolume; // 0x120
	float MusicSoundVolume; // 0x124
	float UISoundVolume; // 0x128
	float SFXSoundVolume; // 0x12c
	float VOIPVolume; // 0x130
	bool bHitmarkerSfxEnabled; // 0x134
	float MouseSensitivity; // 0x138
	float FreelookSensitivity; // 0x13c
	FString TargetLocale; // 0x140
	float FieldOfView; // 0x150
	float LadderRollSensitivity; // 0x154
	bool bToggleADS; // 0x158
	int32_t MaxShellsInWorld; // 0x15c
	float MaxShellLifeTime; // 0x160
	bool bUseMeshPainting; // 0x164
	FString LastConnectedServerIP; // 0x168
	float IconScale; // 0x178
	float QuickThrowScale; // 0x17c
	int32_t FireModeDisplayOption; // 0x180
	int32_t TeamViewFPS; // 0x184
	bool bShowFPS; // 0x188
	bool bShowHUD; // 0x189
	bool bShowCompass; // 0x18a
	bool bShowWeaponHUD; // 0x18b
	bool bShowMagazineHUD; // 0x18c
	bool bShowChat; // 0x18d
	bool bEnableHUDSwaying; // 0x18e
	bool bShowHotkeyHints; // 0x18f
	bool bShowHealthIcons; // 0x190
	bool bShowCommandContextHint; // 0x191
	bool bZoomADS; // 0x192
	EScoreReadoutMode ScoreReadoutMode; // 0x193
	ESwatCommand DefaultCommand; // 0x194
	ESwatCommand DefaultDoorUnknownCommand; // 0x195
	ESwatCommand DefaultDoorOpenCommand; // 0x196
	ESwatCommand DefaultDoorLockedCommand; // 0x197
	ESwatCommand DefaultDoorUnlockedCommand; // 0x198
	int32_t DefaultCommandOption; // 0x19c
	int32_t DefaultDoorUnknownCommandOption; // 0x1a0
	int32_t DefaultDoorOpenCommandOption; // 0x1a4
	int32_t DefaultDoorLockedCommandOption; // 0x1a8
	int32_t DefaultDoorUnlockedCommandOption; // 0x1ac
	bool bCurvedHUD; // 0x1b0
	bool b2DReloadIcons; // 0x1b1
	bool bShowPlayerNames; // 0x1b2
	bool bShowPlayerIcon; // 0x1b3
	bool bShowMultiplayerSpeeds; // 0x1b4
	bool bShowCommandMarkers; // 0x1b5
	bool bShowTeamStatus; // 0x1b6
	float PiPFPS; // 0x1b8
	bool bDepthOfField; // 0x1bc
	bool bMotionBlur; // 0x1bd
	int32_t MotionBlurQuality; // 0x1c0
	float PiPResolutionScale; // 0x1c4
	float SafeZoneX; // 0x1c8
	float SafeZoneY; // 0x1cc
	int32_t GraphicsPresetIndex; // 0x1d0
	bool bShowButtonPrompts; // 0x1d4
	bool bInvertMousePitch; // 0x1d5
	bool bInvertMouseYaw; // 0x1d6
	bool bExperimentalFeatures; // 0x1d7
	bool bShowControlsOnScreen; // 0x1d8
	bool bShowHesitationBar; // 0x1d9
	bool bRTXEnabled; // 0x1da
	bool bRTXReflectionsEnabled; // 0x1db
	bool bRTXShadowsEnabled; // 0x1dc
	bool bRTXAmbientOcclusionEnabled; // 0x1dd
	int32_t DlssQualitySetting; // 0x1e0
	int32_t FSRQualitySetting; // 0x1e4
	float MicInputGain; // 0x1e8
	bool bFrameLimitEnabled; // 0x1ec
	EItemSelectionInterfaceType ItemSelectionInterface; // 0x1ed
	EGrenadeThrowSettingType GrenadeThrowType; // 0x1ee
	EShotgunReloadType ShotgunLoadType; // 0x1ef
	EEmptyMagReloadType EmptyMagReloadType; // 0x1f0
	EOptiwandViewMode OptiwandViewMode; // 0x1f1
	FString DMOAddress; // 0x1f8
	FString DMOGameMode; // 0x208
	ETeamType DMOTeamType; // 0x218
	bool bBounceLightEnabled; // 0x219
	bool bFlashlightShadowsEnabled; // 0x21a
};

struct UMovieSceneColorSection {
	FMovieSceneFloatChannel RedCurve; // 0xf0
	FMovieSceneFloatChannel GreenCurve; // 0x190
	FMovieSceneFloatChannel BlueCurve; // 0x230
	FMovieSceneFloatChannel AlphaCurve; // 0x2d0
};

struct UMaterialExpressionSphereMask {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct AKingOfTheHostageGM {
	TArray<APawn*> SpawnedHostages; // 0x6d8
	float Start_RoundTime; // 0x6f8
	bool bBlueTeamOnAttack; // 0x6fc
};

struct UCrowdFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UParticleModuleLight {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct AImpactEffect {
	TArray<UParticleSystemComponent*> SpawnedParticles; // 0x220
	bool bPlayDefaultIfNull; // 0x340
	float DecalScale; // 0x344
	float DecalMinSize; // 0x350
	float DecalMaxSize; // 0x354
	UFMODEvent* FMODSoundFx; // 0x358
	UFMODEvent* FMODHitmarker; // 0x360
	float DecalMeshScaleMultiplier; // 0x368
	bool bBulletGoneThroughPlayer; // 0x36c
	bool bArmorImpact; // 0x36d
	TArray<UMaterialInterface*> BloodExitDecals; // 0x370
	FImpactFx DefaultImpactFx; // 0x380
	FImpactFx RON_Aluminium; // 0x3b0
	FImpactFx RON_Asphalt; // 0x3e0
	FImpactFx RON_Brick; // 0x410
	FImpactFx RON_CarbonFibre; // 0x440
	FImpactFx RON_Cardboard; // 0x470
	FImpactFx RON_Ceramic; // 0x4a0
	FImpactFx RON_ConcreteSoft; // 0x4d0
	FImpactFx RON_ConcreteStrong; // 0x500
	FImpactFx RON_Dirt; // 0x530
	FImpactFx RON_Drywall; // 0x560
	FImpactFx RON_Electrical; // 0x590
	FImpactFx RON_EnergyShield; // 0x5c0
	FImpactFx RON_Fabric_Carpet; // 0x5f0
	FImpactFx RON_Fabric_Stuffing; // 0x620
	FImpactFx RON_Fabric_Thin; // 0x650
	FImpactFx RON_Flesh; // 0x680
	FImpactFx RON_Galvanized; // 0x6b0
	FImpactFx RON_Glass_Plate; // 0x6e0
	FImpactFx RON_Glass_Windshield; // 0x710
	FImpactFx RON_Grass; // 0x740
	FImpactFx RON_Gravel; // 0x770
	FImpactFx RON_Ice; // 0x7a0
	FImpactFx RON_Lava; // 0x7d0
	FImpactFx RON_Lead; // 0x800
	FImpactFx RON_Leaves; // 0x830
	FImpactFx RON_Limestone; // 0x860
	FImpactFx RON_Mahogany; // 0x890
	FImpactFx RON_Marble_Coated; // 0x8c0
	FImpactFx RON_Marble_Thick; // 0x8f0
	FImpactFx RON_Mud; // 0x920
	FImpactFx RON_Oil; // 0x950
	FImpactFx RON_Paper; // 0x980
	FImpactFx RON_Pine; // 0x9b0
	FImpactFx RON_Plaster; // 0x9e0
	FImpactFx RON_Plastic; // 0xa10
	FImpactFx RON_Plywood; // 0xa40
	FImpactFx RON_Polystyrene; // 0xa70
	FImpactFx RON_Powder; // 0xaa0
	FImpactFx RON_Rock; // 0xad0
	FImpactFx RON_Rubber; // 0xb00
	FImpactFx RON_Sand; // 0xb30
	FImpactFx RON_Snow; // 0xb60
	FImpactFx RON_Soil; // 0xb90
	FImpactFx RON_Steel; // 0xbc0
	FImpactFx RON_Tin; // 0xbf0
	FImpactFx RON_Treewood; // 0xc20
	FImpactFx RON_Wallpaper; // 0xc50
	FImpactFx RON_Water; // 0xc80
};

struct USynthSamplePlayer {
	USoundWave* SoundWave; // 0x6c0
	FMulticastInlineDelegate OnSampleLoaded; // 0x6c8
	FMulticastInlineDelegate OnSamplePlaybackProgress; // 0x6d8
};

struct ANightvisionGoggles {
	UUserWidget* SpawnedWidget; // 0x1548
	UUserWidget* NightVisionFirstPersonWidget; // 0x1550
	FPostProcessSettings NightVisionPostProcess; // 0x1560
	bool bNVGOn; // 0x1ac0
	bool bTogglingNVG; // 0x1ac1
	TArray<UDamageType*> BlockDamageTypesWhileActive; // 0x1ac8
};

struct UNoiseField {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct ACyberneticCharacter {
	URoNMoveStyleComponent* MoveStyle; // 0x2150
	TArray<EBehaviourMods> Rep_BehaviourMods; // 0x2190
	UFMODEvent* VoiceLineEventMask; // 0x21a0
	TArray<UStaticMeshComponent*> SimulatingAttachedStaticMeshes; // 0x21b0
	TArray<FAttachedMeshData> AttachedMeshData; // 0x21c0
	TArray<FAttachedSkeletalMeshData> AttachedSkeletalMeshData; // 0x21d0
	bool bIsTrackingEnemy; // 0x21e0
	uint32_t TimeSinceLastSeenEnemy; // 0x21e4
	uint32_t TimeSinceLastHeardAggresiveNoise; // 0x21e8
	bool bIsMoving; // 0x21ec
	ABaseItem* LastEquippedBreachItem; // 0x2208
	UTextRenderComponent* NoBuenoTextRender; // 0x2220
	int32_t AbuseCount; // 0x2228
	TArray<FString> ReasonsToSprint; // 0x2230
	TArray<FString> ReasonsToStandStill; // 0x2240
	TArray<FString> ReasonsToWalk; // 0x2250
	float ShootingYellCoolDownDuration; // 0x2270
	UPhysicsAsset* KnockedOutPhysicsAsset; // 0x2278
	TArray<EItemClass> PickupRulesLVL1; // 0x2280
	TArray<EItemClass> PickupRulesLVL2; // 0x2290
	TArray<EItemClass> PickupRulesLVL3; // 0x22a0
	bool bOrientated; // 0x22b0
	FVector2D AimOffset; // 0x22b4
	float LeanAmount; // 0x22c4
	char bIsFollowing : 1; // 0x22c8
	bool bCowering; // 0x22e0
	TMap<ECyberneticsLevel, float> AILevelToLeanStrength; // 0x22e8
	UInteractionsData* HostageTakingInteractionStart; // 0x2338
	UInteractionsData* HostageTakingInteractionIdle; // 0x2340
	UInteractionsData* HostageTakingInteractionEnd; // 0x2348
	ECyberneticsLevel CyberneticsLevel; // 0x2350
	float TimeSurrendered; // 0x2354
	char bIsComplying : 1; // 0x2358
	char bIsWaiting : 1; // 0x2358
	float PepperSprayAbuseLevel; // 0x235c
	float TimeSinceLastTasered; // 0x2360
	int32_t TimesTasered; // 0x2364
	TArray<UWorldBuildingActivity*> CivilianCowerActivities; // 0x2370
	UWorldBuildingActivity* CurrentCivilianCowerActivity; // 0x2388
	float CivilianCowerActivityDuration; // 0x2390
	FString DefaultUnarmedStyle; // 0x23a0
	FString DefaultUnarmedStyle_Female; // 0x23b0
	FString DefaultStunnedStyle; // 0x23c0
	FString DefaultLoweredTwoHandedStyle; // 0x23d0
	FString DefaultRaisedTwoHandedStyle; // 0x23e0
	FString DefaultArrestedStyle; // 0x23f0
	FString DefaultSurrenderedStyle; // 0x2400
};

struct UARSessionConfig {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct UPhysicalAnimationComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UW_RadialSelectionBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	ABasePlayer_C* PlayerCharacter; // 0x268
	int32_t CurrentSelectionIndex; // 0x270
	int32_t PreviousSelectionIndex; // 0x274
};

struct UANIMBP_G19_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x308
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x328
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x430
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x450
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x498
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x538
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x690
	FAnimNode_Slot AnimGraphNode_Slot; // 0x750
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x798
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x868
	float Mag01Alpha; // 0x8e8
};

struct UW_Briefing_Transcript_Entry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeIn; // 0x268
	UImage* div_001; // 0x270
	UW_Text_C* txt_Dialogue; // 0x278
	UW_Text_C* txt_SpeakerName; // 0x280
	UW_Text_C* txt_SpeakerTitle; // 0x288
	UW_Text_C* txt_Timestamp; // 0x290
	UVerticalBox* VB_Timestamp; // 0x298
	UW_Button_C* W_Button; // 0x2a0
	FText SpeakerName; // 0x2a8
	FText Dialogue; // 0x2c0
	FText Timestamp; // 0x2d8
	FMulticastInlineDelegate TranscriptEntryClicked; // 0x2f0
	float EntryID; // 0x300
	FText SpeakerTitle; // 0x308
};

struct UW_AG_MapRotation_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_RadioContainer_C* MapRotation; // 0x268
	UW_StandardRadioButton_C* Overview_RadioButton_MapsModes; // 0x270
	UW_StandardRadioButton_C* Overview_RadioButton_Players; // 0x278
	UVerticalBox* VerticalBox_1; // 0x280
	FString LastSelectedMapString; // 0x288
	StandardButtonStyles StandardDisplayButtonStyle; // 0x298
};

struct AGS_FreeMode_C {
	USceneComponent* DefaultSceneRoot; // 0x6c0
};

struct UBlackboardComponent {
	UBrainComponent* BrainComp; // 0xb0
	UBlackboardData* DefaultBlackboardAsset; // 0xb8
	UBlackboardData* BlackboardAsset; // 0xc0
	TArray<UBlackboardKeyType*> KeyInstances; // 0xe8
};

struct UW_BriefingMain_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	UTextBlock* BriefingText; // 0x2d8
	UVerticalBox* CivilianBios; // 0x2e0
	UTextBlock* LevelNickname; // 0x2e8
	UTextBlock* ObjectiveString; // 0x2f0
	UVerticalBox* SuspectBios; // 0x2f8
	UTextBlock* TimelineString; // 0x300
	UW_BriefingTaskButton_C* W_BriefingTaskButton; // 0x308
	UW_BriefingTaskButton_C* W_BriefingTaskButton_2; // 0x310
	UW_BriefingTaskButton_C* W_BriefingTaskButton_3; // 0x318
	UW_BriefingTaskButton_C* W_BriefingTaskButton_4; // 0x320
	UPreMissionPlanning* PreMissionPlanning; // 0x328
	TArray<UW_BriefingTaskButton_C*> BriefingTaskButtons; // 0x330
};

struct AGrenadeProjectile {
	URadialForceComponent* DetonationRadialForce; // 0x398
	float DetonationTime; // 0x3a0
	float DetonationBetweenTime; // 0x3a4
	float ElapsedTime; // 0x3a8
	int32_t DetonationCount; // 0x3ac
	int32_t DetonationMax; // 0x3b0
	bool bTriggersActionMusic; // 0x3b4
	TArray<FGrenadeDamage> GrenadeDamage; // 0x3b8
	bool bIncreaseRadiusOverTime; // 0x3c8
};

struct UDatasmithCommonTessellationOptions {
	FDatasmithTessellationOptions Options; // 0x28
};

struct UUpdateSessionCallbackProxyAdvanced {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UCharacterHealthComponent {
	FMulticastInlineDelegate OnLimbFullHealth; // 0x108
	FMulticastInlineDelegate OnLimbLowHealth; // 0x118
	FMulticastInlineDelegate OnLimbNoHealth; // 0x128
	FMulticastInlineDelegate OnLimbBroken; // 0x138
	FMulticastInlineDelegate OnLimbFullTickets; // 0x148
	FMulticastInlineDelegate OnLimbNoTickets; // 0x158
	EPlayerHealthStatus HealthStatus; // 0x168
	FLimbHealthData RightLeg; // 0x16c
	FLimbHealthData LeftLeg; // 0x1a0
	FLimbHealthData RightArm; // 0x1d4
	FLimbHealthData LeftArm; // 0x208
	FLimbHealthData Head; // 0x23c
	char bUnlimitedRevives : 1; // 0x270
	int32_t MaxRevives; // 0x274
	float ReviveTime; // 0x278
	float ReviveTimeDecrement; // 0x27c
	float ReviveOperatingTime; // 0x280
	float MaxReviveHealth; // 0x284
	int32_t RemainingRevives; // 0x288
	float RemainingReviveTime; // 0x28c
	float RemainingReviveHealth; // 0x290
};

struct AGS_VIPEscort_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x730
};

struct ALightningGenerator {
	USceneComponent* SceneRoot; // 0x230
	UAudioComponent* Thunder; // 0x238
	UParticleSystemComponent* ParticleComponent; // 0x240
	float ParticleSpawnChance; // 0x248
	TArray<UParticleSystem*> ParticleTemplates; // 0x250
	TArray<USoundBase*> ThunderSounds; // 0x260
	UDirectionalLightComponent* Lightning; // 0x270
	float ThunderDelayMin; // 0x278
	float ThunderDelayMax; // 0x27c
	FLinearColor LightningColorMin; // 0x280
	FLinearColor LightningColorMax; // 0x290
	float LightningDelayMin; // 0x2a0
	float LightningDelayMax; // 0x2a4
	float LightningIntensityMin; // 0x2a8
	float LightningIntensityMax; // 0x2ac
	float LightningIntensityDecay; // 0x2b0
	float LightningIntensityJitterMin; // 0x2b4
	float LightningIntensityJitterMax; // 0x2b8
	float LightningIntensityJitterTimeMin; // 0x2bc
	float LightningIntensityJitterTimeMax; // 0x2c0
	float LightningJitterTimeRemaining; // 0x2c4
};

struct UParticleModuleLocationPrimitiveCylinder {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bHidden : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bForceNetAddressable : 1; // 0x58
	char bExchangedRoles : 1; // 0x59
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bCanBeDamaged : 1; // 0x5a
	char bBlockInput : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5b
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x170
	FMulticastSparseDelegate OnTakeAnyDamage; // 0x180
	FMulticastSparseDelegate OnTakePointDamage; // 0x181
	FMulticastSparseDelegate OnTakeRadialDamage; // 0x182
	FMulticastSparseDelegate OnActorBeginOverlap; // 0x183
	FMulticastSparseDelegate OnActorEndOverlap; // 0x184
	FMulticastSparseDelegate OnBeginCursorOver; // 0x185
	FMulticastSparseDelegate OnEndCursorOver; // 0x186
	FMulticastSparseDelegate OnClicked; // 0x187
	FMulticastSparseDelegate OnReleased; // 0x188
	FMulticastSparseDelegate OnInputTouchBegin; // 0x189
	FMulticastSparseDelegate OnInputTouchEnd; // 0x18a
	FMulticastSparseDelegate OnInputTouchEnter; // 0x18b
	FMulticastSparseDelegate OnInputTouchLeave; // 0x18c
	FMulticastSparseDelegate OnActorHit; // 0x18d
	FMulticastSparseDelegate OnDestroyed; // 0x18e
	FMulticastSparseDelegate OnEndPlay; // 0x18f
	TArray<UActorComponent*> InstanceComponents; // 0x1f0
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x200
};

struct AHUD_CaptureTheFlag_C {
	USceneComponent* DefaultSceneRoot; // 0x318
};

struct UMaterialExpressionCurveAtlasRowParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UMaterialExpressionWorldPosition {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x40
};

struct UMaterialExpressionSubtract {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMovieSceneSpawnTrack {
	TArray<UMovieSceneSection*> Sections; // 0x90
	FGuid ObjectGuid; // 0xa0
};

struct APrimary_870mcs_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1190
	UPointLightComponent* PointLight; // 0x1198
	USpotLightComponent* PointLight1; // 0x11a0
	UAnimMontage* LightToggle1P; // 0x11a8
};

struct AHelmet_UpArmor_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1550
	APlayerState* PlayerState; // 0x1558
};

struct UW_PlaceholderTutorialMenu_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UW_TutorialMissionButton_C* W_ArrestButton; // 0x288
	UW_TutorialMissionButton_C* W_ArrestButton_2; // 0x290
	UW_TutorialMissionButton_C* W_GrenadesButton; // 0x298
	UW_TutorialMissionButton_C* W_MirrorgunButton; // 0x2a0
	UW_TutorialMissionButton_C* W_MovementButton; // 0x2a8
	UW_TutorialMissionButton_C* W_ShootingRangeButton; // 0x2b0
	UW_TutorialMissionButton_C* W_StackUpButton; // 0x2b8
};

struct UMovieSceneFloatSection {
	FMovieSceneFloatChannel FloatCurve; // 0xf0
};

struct UNavLinkDefinition {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UMaterialExpressionLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Alpha; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstAlpha; // 0x84
};

struct AClearPoint {
	UBillboardComponent* SpriteComponent; // 0x220
};

struct UMovieSceneAudioTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x98
};

struct AReadyOrNotCharacter {
	USkeletalMeshComponent* MeshGearSlot; // 0x548
	FRotator ReplicatedControlRotation; // 0x56c
	APlayerState* LastPlayerStateForCharacter; // 0x578
	FMulticastInlineDelegate OnPlayerKilled; // 0x580
	FMulticastInlineDelegate OnCharacterKilled; // 0x590
	FMulticastInlineDelegate OnWeaponFire; // 0x5a0
	FMulticastInlineDelegate OnWeaponDryFire; // 0x5b0
	FMulticastInlineDelegate OnPlayerDowned; // 0x5c0
	FMulticastInlineDelegate OnGenericDamageReceived; // 0x5d0
	FMulticastInlineDelegate OnPointDamageReceived; // 0x5e0
	FMulticastInlineDelegate OnStunDamageReceived; // 0x5f0
	FMulticastInlineDelegate OnPlayerFreed; // 0x600
	FMulticastInlineDelegate OnPlayerHit; // 0x610
	FMulticastInlineDelegate OnPlayerArmorHit; // 0x620
	FMulticastInlineDelegate OnItemThrown_FromAnimNotify; // 0x630
	FMulticastInlineDelegate OnDoorLockPickBegin_FromAnimNotify; // 0x640
	FMulticastInlineDelegate OnDoorLockPickEnd_FromAnimNotify; // 0x650
	FMulticastInlineDelegate OnDoorChecked_FromAnimNotify; // 0x660
	FMulticastInlineDelegate OnC2Placed_FromAnimNotify; // 0x670
	FMulticastInlineDelegate OnC2Detonate_FromAnimNotify; // 0x680
	FMulticastInlineDelegate OnTrapDisarmBegin_FromAnimNotify; // 0x690
	FMulticastInlineDelegate OnTrapDisarmEnd_FromAnimNotify; // 0x6a0
	FMulticastInlineDelegate OnMirrorDoorStarted_FromAnimNotify; // 0x6b0
	FMulticastInlineDelegate OnMirrorDoorFinished_FromAnimNotify; // 0x6c0
	FMulticastInlineDelegate OnStartDoorWedgePlacement_FromAnimNotify; // 0x6d0
	FMulticastInlineDelegate OnEndDoorWedgePlacement_FromAnimNotify; // 0x6e0
	TArray<AImpactEffect*> BloodImpactEffects; // 0x6f0
	TArray<FBleedoutWound> BleedoutWounds; // 0x710
	bool bBulletForceTransferred; // 0x722
	float MinimumBodyFallImpulse; // 0x724
	UFMODEvent* BodyFallEvent; // 0x728
	float BlendInterpAmount; // 0x73c
	float TimeDowned; // 0x74c
	float FinalBlendInTime; // 0x750
	float BlendInTime; // 0x758
	float BlendInAfterStartOfAnim; // 0x75c
	char bIsPreviewCharacter : 1; // 0x760
	AReadyOrNotCharacter* ArrestedBy; // 0x768
	AReadyOrNotCharacter* KilledBy; // 0x770
	ECharacterDeathReason DeathReason; // 0x778
	FMulticastInlineDelegate OnPlayerTakeDamage; // 0x780
	FMulticastInlineDelegate OnPlayerAttacked; // 0x790
	TArray<FName> HeadBones; // 0x7d0
	TArray<FName> UpperBody; // 0x7e0
	TArray<FName> LowerBody; // 0x800
	TArray<FName> R_Leg; // 0x810
	TArray<FName> L_Leg; // 0x820
	TArray<FName> L_Foot; // 0x830
	TArray<FName> R_Foot; // 0x840
	TArray<FName> L_Arm; // 0x850
	TArray<FName> R_Arm; // 0x860
	TArray<FName> L_Hand; // 0x870
	TArray<FName> R_Hand; // 0x880
	bool bLowReadyPointUp; // 0x890
	bool bLowReadyPointDown; // 0x891
	float LowReadyDistance; // 0x894
	TArray<UCapsuleComponent*> LowReadyIgnoredCapsules; // 0x8a0
	ESquadPosition SquadPosition; // 0x8b0
	ETeamType DefaultTeam; // 0x8b1
	UFMODEvent* FPMeleeImpactFMODEvent; // 0x8b8
	UFMODEvent* TPMeleeImpactFMODEvent; // 0x8c0
	TSoftClassPtr<UObject> MeleeCameraShake; // 0x8c8
	AReadyOrNotCharacter* RecentMeleeVictim; // 0x8f0
	float MeleeRange; // 0x8f8
	float MeleeDamage; // 0x8fc
	TSoftClassPtr<UObject> MeleeDamageType; // 0x900
	FMulticastInlineDelegate OnPlayerArrested; // 0x928
	FMulticastInlineDelegate OnPlayerArrestStart; // 0x938
	FMulticastInlineDelegate OnPlayerArrestedCanceled; // 0x948
	char bOrderedToRotateForArrest : 1; // 0x958
	APlacedZipcuffs* PlacedZipcuffs; // 0x960
	APlacedZipcuffs* SpawnedZipcuffsClass; // 0x968
	APlacedZipcuffs* SpawnedFPZipcuffsClass; // 0x970
	FName ZipcuffBone; // 0x978
	bool bIsBeingArrested; // 0x980
	AReadyOrNotCharacter* LastCharacterMakingArrest; // 0x988
	AReadyOrNotCharacter* CurrentlyArresting; // 0x990
	bool bArrestComplete; // 0x998
	bool bPrimed; // 0x999
	bool bOverarmThrow; // 0x99a
	FMulticastInlineDelegate OnQuickThrowStart; // 0x9a0
	FMulticastInlineDelegate OnQuickThrowEnd; // 0x9b0
	UReadyOrNotCharacterAnimData* AnimationData; // 0x9c0
	bool bIsStrafing; // 0x9c9
	TMap<FString, UAnimMontage*> PlayedTableMontageMap3P; // 0x9f0
	FCharacterLookOverride CharacterLookOverride; // 0xaa8
	FString Rep_CharacterLookOverride; // 0xb78
	TMap<ABaseArmour*, USkeletalMesh*> ArmorOverrideMapTP; // 0xb88
	USkeletalMesh* Rep_BodyMesh; // 0xbd8
	USkeletalMesh* Rep_FaceMesh; // 0xbe0
	USkeletalMesh* Rep_FPMesh; // 0xbe8
	TMap<UAnimMontage*, float> AnimMontageCooldown; // 0xbf0
	UPoseAsset* CurrentFaceROM; // 0xc40
	ATOCManager* TOCManager; // 0xc60
	UMatineeCameraShake* ReportToTOC_PVP_CameraShake; // 0xc68
	char bReportedToTOC_Killed_PVP : 1; // 0xc70
	char bReportedToTOC_Arrested_PVP : 1; // 0xc70
	FString TOCLine; // 0xc78
	FString SpeechCharacterName; // 0xc88
	bool bHasBeenReported; // 0xca0
	float SpeakCooldown; // 0xca4
	UFMODEvent* ReportPlayerDeadFMODEvent; // 0xca8
	UFMODEvent* ReportPlayerArrestedFMODEvent; // 0xcb0
	UFMODEvent* ReportPlayerGeneralFMODEvent; // 0xcb8
	TMap<FString, float> CooldownMap; // 0xcd0
	UFMODEvent* FMODVoiceLine2D; // 0xd20
	UFMODEvent* FMODVoiceLineSpatalized; // 0xd28
	FMulticastInlineDelegate OnBoneDamaged; // 0xd30
	FMulticastInlineDelegate OnBodyPartDamaged; // 0xd40
	char bBodyHit : 1; // 0xd50
	char bRightFootHit : 1; // 0xd50
	char bLeftFootHit : 1; // 0xd50
	char bBlockedByBodyArmor : 1; // 0xd50
	char bBlockedByHeadArmor : 1; // 0xd50
	float GasDamageAccumulated; // 0xd5c
	float GasDamageDecay; // 0xd60
	TArray<USceneComponent*> SpawnedBloodComponents; // 0xd68
	bool bGodMode; // 0xd78
	bool bNoTarget; // 0xd79
	UParticleSystem* ArmorImpactEffect; // 0xd80
	UBloodData* Blood; // 0xd88
	TArray<AReadyOrNotCharacter*> DamagedByCharacters; // 0xd90
	TArray<ABaseWeapon*> DamagedByWeapons; // 0xda0
	bool bRepStunned; // 0xdb8
	EStunType RepStunnedWith; // 0xdb9
	char bHasEverBeenStunned : 1; // 0xe10
	AActor* PendingEvidence; // 0xe20
	bool bIsCollectingEvidence; // 0xe28
	bool bCollectionAnimHasTriggered; // 0xe29
	UAnimMontage* CollectingLoopAnim1P; // 0xe30
	UAnimMontage* CollectingLoopAnim3P; // 0xe38
	ACollectedEvidenceActor* CollectedEvidenceClass; // 0xe40
	UFMODEvent* Reward; // 0xe48
	bool bMovementLocked; // 0xe50
	bool bAimLocked; // 0xe51
	bool bActionsLocked; // 0xe52
	ADoor* QueuedDoorToOpen; // 0xe58
	ADoor* QueuedDoorToClose; // 0xe60
	ADoor* LastKickedDoor; // 0xe68
	UInteractionsData* DoorKickInteractionFront; // 0xe70
	UInteractionsData* DoorKickInteractionBack; // 0xe78
	UInteractionsData* DoorKickFailureInteractionFront; // 0xe80
	UInteractionsData* DoorKickFailureInteractionBack; // 0xe88
	UInteractionsData* DoorKickBreakInteractionFront; // 0xe90
	UInteractionsData* DoorKickBreakInteractionBack; // 0xe98
	bool bShouldPlayFootstepFoley; // 0xec0
	bool bPlayEveryStep; // 0xec1
	AImpactEffect* FootstepImpactEffectFast; // 0xec8
	AImpactEffect* FootstepImpactEffectSlow; // 0xed0
	UFMODEvent* CurrentFootstepFoleyEvent; // 0xed8
	UFMODEvent* CurrentFootstepFoleyEventRemote; // 0xee0
	UFMODEvent* FootstepsLocal; // 0xee8
	UFMODEvent* FootstepsRemote; // 0xef0
	UPhysicsAsset* DefaultRagdollPhysAsset; // 0xef8
	UPhysicsAsset* DefaultAlivePhysAsset; // 0xf00
	UPhysicsAsset* CuffedRagdollPhysAsset; // 0xf08
	UPhysicsAsset* Rep_ActiveRagdollPhysAsset; // 0xf10
	ANeutralizeSuspectByTag* NeutralizeSuspectTag; // 0xf28
	UInventoryComponent* InventoryComp; // 0xf30
	UFMODAudioPropagationComponent* FMODAudioPropagationComp; // 0xf38
	UItemVisualizationComponent* PrimaryItemVisualizationComponent; // 0xf40
	UItemVisualizationComponent* SecondaryItemVisualizationComponent; // 0xf48
	UItemVisualizationComponent* LongTacticalVisualizationComponent; // 0xf50
	UCharacterHealthComponent* CharacterHealth; // 0xf58
	USkeletalMeshComponent* FaceMesh; // 0xf60
	UPawnNoiseEmitterComponent* NoiseEmitter; // 0xf68
	UAIPerceptionStimuliSourceComponent* PerceptionStimuliComp; // 0xf70
	UFMODAudioComponent* FMODFoleyComp; // 0xf78
	UFMODAudioComponent* FMODVoiceAudioComp; // 0xf80
	UInteractableComponent* InteractableComponent; // 0xf88
	UObjectiveMarkerComponent* PlayerMarkerComponent; // 0xf90
	UMapActorComponent* MapActorComponent; // 0xf98
};

struct USoundNodeLooping {
	int32_t LoopCount; // 0x48
	char bLoopIndefinitely : 1; // 0x4c
};

struct UGeometryCache {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
	int32_t StartFrame; // 0x60
	int32_t EndFrame; // 0x64
	uint64_t Hash; // 0x68
};

struct UParticleModuleOrbit {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UParticleModuleLocationWorldOffset_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UARTrackableNotifyComponent {
	FMulticastInlineDelegate OnAddTrackedGeometry; // 0xb0
	FMulticastInlineDelegate OnUpdateTrackedGeometry; // 0xc0
	FMulticastInlineDelegate OnRemoveTrackedGeometry; // 0xd0
	FMulticastInlineDelegate OnAddTrackedPlane; // 0xe0
	FMulticastInlineDelegate OnUpdateTrackedPlane; // 0xf0
	FMulticastInlineDelegate OnRemoveTrackedPlane; // 0x100
	FMulticastInlineDelegate OnAddTrackedPoint; // 0x110
	FMulticastInlineDelegate OnUpdateTrackedPoint; // 0x120
	FMulticastInlineDelegate OnRemoveTrackedPoint; // 0x130
	FMulticastInlineDelegate OnAddTrackedImage; // 0x140
	FMulticastInlineDelegate OnUpdateTrackedImage; // 0x150
	FMulticastInlineDelegate OnRemoveTrackedImage; // 0x160
	FMulticastInlineDelegate OnAddTrackedFace; // 0x170
	FMulticastInlineDelegate OnUpdateTrackedFace; // 0x180
	FMulticastInlineDelegate OnRemoveTrackedFace; // 0x190
	FMulticastInlineDelegate OnAddTrackedEnvProbe; // 0x1a0
	FMulticastInlineDelegate OnUpdateTrackedEnvProbe; // 0x1b0
	FMulticastInlineDelegate OnRemoveTrackedEnvProbe; // 0x1c0
	FMulticastInlineDelegate OnAddTrackedObject; // 0x1d0
	FMulticastInlineDelegate OnUpdateTrackedObject; // 0x1e0
	FMulticastInlineDelegate OnRemoveTrackedObject; // 0x1f0
};

struct UW_ControlsBind_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* BindingText; // 0x268
	UImage* Button_Disabled; // 0x270
	UImage* Button_Dn; // 0x278
	UImage* Button_Hi; // 0x280
	UImage* Button_Selected; // 0x288
	UImage* Button_Up; // 0x290
	UButton* KeybindButton; // 0x298
	UTextBlock* DescriptionWidget; // 0x2a0
	FText DescriptionText; // 0x2a8
	FText ChangeBindFormat; // 0x2c0
	FActionMappingStruct ActionMappingData; // 0x2d8
	FAxisMappingStruct AxisMappingData; // 0x300
	bool bIsAxis; // 0x328
	int32_t BindIndex; // 0x32c
	FText UnboundText; // 0x330
	FKey Key; // 0x348
	TArray<KeyModifiers> KeyModifiers; // 0x360
	FMulticastInlineDelegate OnHovered; // 0x370
	FMulticastInlineDelegate OnUnhovered; // 0x380
	FMulticastInlineDelegate OnPressed; // 0x390
	FMulticastInlineDelegate OnReleased; // 0x3a0
	FMulticastInlineDelegate OnBindingStarted; // 0x3b0
	FMulticastInlineDelegate OnBindingCanceled; // 0x3c0
	FMulticastInlineDelegate OnBindingCommitted; // 0x3d0
	FName BindName; // 0x3e0
	FText Mod_Shift; // 0x3e8
	FText Mod_Ctrl; // 0x400
	FText Mod_Alt; // 0x418
	FText Mod_Cmd; // 0x430
	bool bListeningForKeystrokes; // 0x448
	FText BindFriendlyName; // 0x450
	UTextBlock* BindNotificationWidget; // 0x468
	float AxisScale; // 0x470
	UW_ControlsBind_C* PairedKeybind; // 0x478
	UFMODEvent* KeybindHoveredSoundEffect; // 0x480
	UFMODEvent* KeybindStartBindingSoundEffect; // 0x488
	FMulticastInlineDelegate OnConflictingBindDetected; // 0x490
	FKey PendingNewKey; // 0x4a0
	EInputKeyCategory KeyCategory; // 0x4b8
	UW_SettingsMenu_C* SettingsMenu; // 0x4c0
	TArray<FText> ConflictBindFriendlyNamesList; // 0x4c8
	TArray<FAxisMappingStruct> ConflictingAxes; // 0x4d8
	TArray<FActionMappingStruct> ConflictingActions; // 0x4e8
	FMulticastInlineDelegate OnUnbindableKeyReboundAttempted; // 0x4f8
	bool bIsReadOnly; // 0x508
};

struct ARoNMoveStyleCharacter {
	USpringArmComponent* CameraBoom; // 0x4b8
	UCameraComponent* FollowCamera; // 0x4c0
	URoNMoveStyleComponent* MoveStyle; // 0x4c8
	float BaseTurnRate; // 0x4d0
	float BaseLookUpRate; // 0x4d4
};

struct UMaterialFunctionInterface {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UNiagaraDataInterfaceGrid2DCollectionReader {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UDeviceProfile {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x88
};

struct UBlueprintGeneratedClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct UAISenseConfig {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UTeamStatusWidget {
	UImage* TeamEmblem_Image_LeftAligned; // 0x278
	UHorizontalBox* Teammates_Container_LeftAligned; // 0x280
	UImage* TeamEmblem_Image_RightAligned; // 0x288
	UHorizontalBox* Teammates_Container_RightAligned; // 0x290
	EHorizontalAlignment Alignment; // 0x298
	FSlateBrush TeamEmblemBrush; // 0x2a0
	ETeamType Team; // 0x328
	UTeamPaperdollWidget* PaperdollWidgetClass; // 0x330
	FText EmptyTeamText; // 0x338
	FSlateColor EmptyTeamTextColor; // 0x350
	FSlateFontInfo EmptyTeamTextFont; // 0x378
	TArray<UTeamPaperdollWidget*> TeamPaperdolls; // 0x3d0
	UTextBlock* EmptyTeam_Text; // 0x3e0
};

struct UInterpTrackInstToggle {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct UAchievementWriteCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UGizmoAxisScaleParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	float Parameter; // 0x6c
	FGizmoFloatParameterChange LastChange; // 0x70
	FVector CurScaleAxis; // 0x78
	FVector CurScaleOrigin; // 0x84
	FTransform InitialTransform; // 0x90
};

struct UARTextureCameraDepth {
	EARDepthQuality DepthQuality; // 0x198
	EARDepthAccuracy DepthAccuracy; // 0x199
	bool bIsTemporallySmoothed; // 0x19a
};

struct UW_ScoreboardFill_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Arrests; // 0x268
	UScrollBox* BlueTeam; // 0x270
	UScrollBox* BlueTeamCoop; // 0x278
	UTextBlock* BlueTeamScore; // 0x280
	UTextBlock* Damage; // 0x288
	UTextBlock* Deaths; // 0x290
	UScrollBox* FreeplayMode; // 0x298
	UTextBlock* HoldVIPTimeRemaining; // 0x2a0
	UHorizontalBox* HorizontalBox_2; // 0x2a8
	UTextBlock* Incapacitations; // 0x2b0
	UTextBlock* Kills; // 0x2b8
	UOverlay* LeaderCoop; // 0x2c0
	UWidgetSwitcher* ModeSwitcher; // 0x2c8
	UTextBlock* Name; // 0x2d0
	UTextBlock* Ping; // 0x2d8
	UScrollBox* RedTeam; // 0x2e0
	UScrollBox* RedTeamCoop; // 0x2e8
	UTextBlock* RedTeamScore; // 0x2f0
	UTextBlock* ReinforcementTimeRemaining; // 0x2f8
	UScaleBox* ScaleBox_66; // 0x300
	UScaleBox* ScaleBox_72; // 0x308
	UTextBlock* Score; // 0x310
	UTextBlock* ScoreboardHeader; // 0x318
	UTextBlock* Status; // 0x320
	UTextBlock* Timelimit; // 0x328
	UTextBlock* TimesArrested; // 0x330
	FSlateFontInfo TableHeaderFont; // 0x338
	FSlateFontInfo ColumnHeaderFont; // 0x390
	bool bFreeForAll; // 0x3e8
	TArray<AReadyOrNotPlayerState*> FFAPlayerStates; // 0x3f0
	bool HideHealthStatus; // 0x400
	bool ShowScoreboardHeader; // 0x401
	bool bHideReadyCheckbox; // 0x402
	bool ShowReinforcementsTimer; // 0x403
	bool ShowTimelimitTimer; // 0x404
	bool ShowHoldVIPTimer; // 0x405
	float NextUpdateTime; // 0x408
	int32_t NumberArrestedTeammatesRed; // 0x40c
	int32_t NumberArrestedTeammatesBlue; // 0x410
	int32_t NumberTeammatesTotalRed; // 0x414
	int32_t NumberTeammatesTotalBlue; // 0x418
};

struct APrimary_G3A3_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
};

struct UMovieSceneNiagaraTrack {
	TArray<UMovieSceneSection*> Sections; // 0x90
};

struct AEnvironmentVolume {
	UBoxComponent* Bounds; // 0x220
	float WetnessRate; // 0x228
};

struct UTimeSynchronizableMediaSource {
	bool bUseTimeSynchronization; // 0x88
	int32_t FrameDelay; // 0x8c
	double TimeDelay; // 0x90
};

struct UW_AnimatedIcon_Imprint_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UWidgetAnimation* Anim_Interact; // 0x270
	UImage* BlipHalfwayLower; // 0x278
	UImage* BlipHalfwayUpper; // 0x280
	UImage* ProgressCircle_Image; // 0x288
};

struct UMaterialExpressionSceneDepth {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput Coordinates; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct UProceduralFoliageSpawner {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct UGameplayTagsSettings {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool ClearInvalidTags; // 0x4a
	bool FastReplication; // 0x4b
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct UOpenDoorTeamQuestNode {
	bool bMustBeFullyOpen; // 0x278
};

struct UMaterialExpressionSkyAtmosphereLightDiskLuminance {
	int32_t LightIndex; // 0x40
};

struct UMatchStatusCardWidget {
	UMatchTimeRemainingWidget* MatchTimeRemaining; // 0x278
	UCurrentMatchRoundWidget* CurrentMatchRound; // 0x280
};

struct USoundCue {
	char bPrimeOnLoad : 1; // 0x170
	USoundNode* FirstNode; // 0x178
	float VolumeMultiplier; // 0x180
	float PitchMultiplier; // 0x184
	FSoundAttenuationSettings AttenuationOverrides; // 0x188
	float SubtitlePriority; // 0x528
	char bOverrideAttenuation : 1; // 0x530
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x530
	int32_t CookedQualityIndex; // 0x534
	char bHasPlayWhenSilent : 1; // 0x538
};

struct UMoveIntoLOSActivity {
	AActor* LOSActor; // 0x1a8
};

struct ASceneCapture {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UCheatManager {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
	TArray<UCheatManagerExtension*> CheatManagerExtensions; // 0x78
};

struct UNavigationDataChunk {
	FName NavigationDataName; // 0x28
};

struct UNiagaraDataInterfaceRenderTargetCube {
	int32_t Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xdc
	char bInheritUserParameterSettings : 1; // 0xdd
	char bOverrideFormat : 1; // 0xdd
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe0
	TMap<uint64_t, UTextureRenderTargetCube*> ManagedRenderTargets; // 0x100
};

struct UParticleSystemComponent {
	UParticleSystem* Template; // 0x450
	TArray<UMaterialInterface*> EmitterMaterials; // 0x458
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x468
	char bResetOnDetach : 1; // 0x479
	char bUpdateOnDedicatedServer : 1; // 0x479
	char bAllowRecycling : 1; // 0x479
	char bAutoManageAttachment : 1; // 0x479
	char bAutoAttachWeldSimulatedBodies : 1; // 0x479
	char bWarmingUp : 1; // 0x47a
	char bOverrideLODMethod : 1; // 0x47a
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x47a
	ParticleSystemLODMethod LODMethod; // 0x485
	EParticleSignificanceLevel RequiredSignificance; // 0x486
	TArray<FParticleSysParam> InstanceParameters; // 0x488
	FMulticastInlineDelegate OnParticleSpawn; // 0x498
	FMulticastInlineDelegate OnParticleBurst; // 0x4a8
	FMulticastInlineDelegate OnParticleDeath; // 0x4b8
	FMulticastInlineDelegate OnParticleCollide; // 0x4c8
	bool bOldPositionValid; // 0x4d8
	FVector OldPosition; // 0x4dc
	FVector PartSysVelocity; // 0x4e8
	float WarmupTime; // 0x4f4
	float WarmupTickRate; // 0x4f8
	float SecondsBeforeInactive; // 0x500
	float MaxTimeBeforeForceUpdateTransform; // 0x508
	TArray<UParticleSystemReplay*> ReplayClips; // 0x528
	float CustomTimeDilation; // 0x540
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x598
	FName AutoAttachSocketName; // 0x5a0
	EAttachmentRule AutoAttachLocationRule; // 0x5a8
	EAttachmentRule AutoAttachRotationRule; // 0x5a9
	EAttachmentRule AutoAttachScaleRule; // 0x5aa
	FMulticastInlineDelegate OnSystemFinished; // 0x5d8
};

struct UAnimNotify_EquipItemOfClass {
	ABaseItem* ItemClass; // 0x38
	char bInstant : 1; // 0x40
	char bAIOnly : 1; // 0x40
};

struct UW_Map_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UOverlay* Main_Overlay; // 0x268
	UOverlay* Map_Overlay; // 0x270
	UOverlay* MapActors_Overlay; // 0x278
	UW_MapFloors_C* MapFloors; // 0x280
	UTextBlock* MapName_Text; // 0x288
	UImage* MapOverview_Image; // 0x290
	TArray<UMapActorWidget*> MapActorWidgets; // 0x298
	AIncriminationGS* IncrimGS; // 0x2a8
	FVector2D MapOrigin; // 0x2b0
	float MapSize; // 0x2b8
	TArray<UW_MapCell_C*> MapCells; // 0x2c0
	TArray<AActor*> Actors; // 0x2d0
};

struct UWidgetSwitcher {
	int32_t ActiveWidgetIndex; // 0x120
};

struct UScrollBar {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct USlateVectorArtData {
	TArray<FSlateMeshVertex> VertexData; // 0x28
	TArray<uint32_t> IndexData; // 0x38
	UMaterialInterface* Material; // 0x48
	FVector2D ExtentMin; // 0x50
	FVector2D ExtentMax; // 0x58
};

struct ABaseMagPouch {
	USkeletalMeshComponent* MagazineMesh; // 0x8f8
	UAnimationAsset* OpenPouchAnim; // 0x900
	UAnimationAsset* ClosedPouchAnim; // 0x908
	FName MagSocket; // 0x910
};

struct UOpenDoorQuestNode {
	bool bMustBeFullyOpen; // 0x278
};

struct AReportReportableByTag {
	FName ReportTag; // 0x278
};

struct UInputKeyDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UPlatformEventsComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct ALevelStreamingVolume {
	TArray<FName> StreamingLevelNames; // 0x258
	char bEditorPreVisOnly : 1; // 0x268
	char bDisabled : 1; // 0x268
	EStreamingVolumeUsage StreamingUsage; // 0x26c
};

struct UNiagaraDataInterfaceRWBase {
	TSet<int32_t> OutputShaderStages; // 0x38
	TSet<int32_t> IterationShaderStages; // 0x88
};

struct UNiagaraDataInterfaceGrid2DCollection {
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xf8
	ENiagaraGpuBufferFormat OverrideBufferFormat; // 0x118
	char bOverrideFormat : 1; // 0x119
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x170
};

struct UARTrackedPose {
	FARPose3D TrackedPose; // 0xf8
};

struct ALauncherProjectile_Gas_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d8
	bool FiredOffEffect; // 0x3e0
};

struct UMaterialExpressionAdd {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UBTNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UW_PlayerActionText_C {
	UInvalidationBox* InvalidationBox_1; // 0x2a8
	UImage* RedLine_Image; // 0x2b0
	FPlayerActionPromptSlot ActionPrompt; // 0x2b8
};

struct APlayerStart {
	FName PlayerStartTag; // 0x248
};

struct UParticleModuleRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct AMissionPortal {
	UInteractableComponent* InteractableComponent; // 0x268
	TArray<AReadyOrNotGameMode*> SelectableGameModes; // 0x270
	UReadyOrNotProfile* Profile; // 0x280
	UTextRenderComponent* WhiteboardText; // 0x288
	FString MissionURL; // 0x298
	FString ModeURL; // 0x2a8
	TArray<UStaticMeshComponent*> CompsToOutline; // 0x2b8
	TArray<ULightComponent*> LightsToEnable; // 0x2c8
	TArray<UStaticMeshComponent*> CompsToOutlineMissionSelected; // 0x2d8
	TArray<ULightComponent*> LightsToEnableMissionSelected; // 0x2e8
};

struct UMaterialExpressionSamplePhysicsIntegerField {
	FExpressionInput WorldPosition; // 0x40
	EFieldIntegerType FieldTarget; // 0x54
};

struct ABP_ReverbSetter_C {
	UStaticMeshComponent* Cube; // 0x220
	USceneComponent* DefaultSceneRoot; // 0x228
	Enum_Reverb reverbType; // 0x230
};

struct UAIDataProvider_QueryParams {
	FName paramName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct AStaticReportable {
	FString DesiredTocReport; // 0x228
	bool bReportedToToc; // 0x238
};

struct UMaterialExpressionTransform {
	FExpressionInput Input; // 0x40
	EMaterialVectorCoordTransformSource TransformSourceType; // 0x54
	EMaterialVectorCoordTransform TransformType; // 0x55
};

struct AThrownEvidenceActor {
	UBoxComponent* BoxComponent; // 0x220
	FVector Rep_Location; // 0x228
	FRotator Rep_Rotation; // 0x234
};

struct UANIMBP_HK416_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x308
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x328
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x430
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x538
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x640
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x660
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x720
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x768
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x790
	FAnimNode_Slot AnimGraphNode_Slot; // 0x7b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x800
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x9f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xb80
	float CarrierHandleAlpha; // 0xc00
	bool bIsSemi; // 0xc04
	float Mag01Alpha; // 0xc08
	float Mag02Alpha; // 0xc0c
	float ScopeAdjustAlpha; // 0xc10
};

struct UFoliageType_InstancedStaticMesh {
	UStaticMesh* Mesh; // 0x3b0
	TArray<UMaterialInterface*> OverrideMaterials; // 0x3b8
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x3c8
};

struct UW_VOIPTalker_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* VerticalBox_65; // 0x268
	bool PlayerStateFound; // 0x270
};

struct UBTTask_GameplayTaskBase {
	char bWaitForGameplayTask : 1; // 0x70
};

struct UPaperSprite {
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FVector2D BakedSourceUV; // 0x48
	FVector2D BakedSourceDimension; // 0x50
	UTexture2D* BakedSourceTexture; // 0x58
	UMaterialInterface* DefaultMaterial; // 0x60
	UMaterialInterface* AlternateMaterial; // 0x68
	TArray<FPaperSpriteSocket> Sockets; // 0x70
	ESpriteCollisionMode SpriteCollisionDomain; // 0x80
	float PixelsPerUnrealUnit; // 0x84
	UBodySetup* BodySetup; // 0x88
	int32_t AlternateMaterialSplitIndex; // 0x90
	TArray<FVector4> BakedRenderData; // 0x98
};

struct AVote_EndRound_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a8
	USceneComponent* DefaultSceneRoot; // 0x2b0
};

struct UAnimNotify_MirrorDoor {
	char bMirrorFinish : 1; // 0x38
};

struct UMovieSceneGeometryCollectionTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
};

struct UGeometryCollectionCache {
	FRecordedTransformTrack RecordedData; // 0x28
	UGeometryCollection* SupportedCollection; // 0x38
	FGuid CompatibleCollectionState; // 0x40
};

struct UNiagaraBaselineController {
	float TestDuration; // 0x28
	UNiagaraEffectType* EffectType; // 0x30
	ANiagaraPerfBaselineActor* Owner; // 0x38
	TSoftObjectPtr<UNiagaraSystem> System; // 0x40
};

struct UW_Briefing_TimelineEvents_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UVerticalBox* VB_Events; // 0x268
	UW_Header_C* W_Header; // 0x270
	TMap<float, FTimelineEvent> EventEntries; // 0x278
	UCanvasPanel* TimelineEntryCanvas; // 0x2c8
	float Spacing; // 0x2d0
	FMulticastInlineDelegate OnEventClicked; // 0x2d8
};

struct UNavigationSystemV1 {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	ENavDataGatheringModeConfig DataGatheringMode; // 0x70
	float DirtyAreaWarningSizeThreshold; // 0x74
	TArray<FNavDataConfig> SupportedAgents; // 0x78
	FNavAgentSelector SupportedAgentsMask; // 0x88
	TArray<ANavigationData*> NavDataSet; // 0x90
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa0
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc0
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd0
	FNavigationSystemRunMode OperationMode; // 0x1bc
	float DirtyAreasUpdateFreq; // 0x15bc
};

struct ANavigationObjectBase {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UBillboardComponent* GoodSprite; // 0x230
	UBillboardComponent* BadSprite; // 0x238
	char bIsPIEPlayerStart : 1; // 0x240
};

struct UDemoNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x858
	float CheckpointSaveMaxMSPerFrame; // 0xa04
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xa28
	bool bIsLocalReplay; // 0xa38
	TArray<APlayerController*> SpectatorControllers; // 0xa40
};

struct UWeaponAttachment {
	TArray<UMaterialInstanceDynamic*> SkinMaterials; // 0xec8
	EWeaponAttachmentType WeaponAttachmentType; // 0xed8
	TArray<EWeaponAttachmentType> RemovesWeaponAttachmentTypes; // 0xee0
	EWeaponUnderbarrelAnimationType UnderbarrelAnimationType; // 0xef0
	bool bNeedNotAttach; // 0xef1
	bool bNullAttachmentOnly; // 0xef2
	FName SocketAttachment; // 0xef4
	FText ItemName; // 0xf00
	int32_t PointCost; // 0xf18
	FAttachmentUIElements UIElements; // 0xf20
	TArray<EItemAttachment> AdditionalAttachments; // 0xf38
	float AttachmentWeight; // 0xf48
	float VerticalRecoilMultiplier; // 0xf4c
	float HorizontalRecoilMultiplier; // 0xf50
	float SpreadMultiplier; // 0xf54
	float DeadzoneMultiplier; // 0xf58
	float MuzzleVelocityMultiplier; // 0xf5c
	float LowReadyLengthMultiplier; // 0xf60
	bool bShouldSupressWeapon; // 0xf64
	bool bHidesMuzzleFlash; // 0xf65
	bool bOverrideMuzzleFlash; // 0xf66
	UParticleSystem* MuzzleFlashParticle; // 0xf68
	UParticleSystem* MuzzleSmokeParticle; // 0xf70
	int32_t MagazineAmmoIncrease; // 0xf7c
	FName HideBoneOnMesh; // 0xf80
	float CameraBobAdditionFactor; // 0xf88
	float ADS_Speed_Multiplier; // 0xf8c
	UFMODEvent* ToggleSound; // 0xf90
};

struct USignificanceManager {
	FSoftClassPath SignificanceManagerClassName; // 0x108
};

struct ULevelStreamingDynamic {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct APepperballImpactEffects_C {
	USceneComponent* DefaultSceneRoot; // 0xcb0
};

struct AMotivityCharacter {
	USpringArmComponent* CameraBoom; // 0x4b8
	UCameraComponent* FollowCamera; // 0x4c0
	float BaseTurnRate; // 0x4c8
	float BaseLookUpRate; // 0x4cc
	FTrajectoryData Goal; // 0x4f0
	float MaxSpeed; // 0x578
	FVector CurInputVector; // 0x5c8
	float SampleRate; // 0x5e0
	float posBias; // 0x5e4
	float dirBias; // 0x5e8
	float posBiasMultiplier; // 0x5ec
	float dirBiasMultiplier; // 0x5f0
	EMotivityInputMode CurrentInputMode; // 0x5f4
	EMotivityMovementMode CurrentMovementMode; // 0x5f6
	bool bIsStrafing; // 0x5f7
	bool bIsMoving; // 0x5f8
	bool bIsNearlyAtDestination; // 0x600
	bool bUseDecoupling; // 0x620
	float maxDecouple; // 0x63c
	float maxAngleDecouple; // 0x640
	FVector LastInputVector_Replicated; // 0x644
	FVector StickInput_Replicated; // 0x650
	UDataTable* CurrentMoveDatabase; // 0x660
	int32_t DefaultMoveStyleIndex; // 0x668
	FMovementStyle CurrentMoveStyle; // 0x670
	int32_t CurMoveStyleIndex; // 0x698
	int32_t CurrentGaitIndex; // 0x69c
	bool bhasInputThisFrame; // 0x6a0
	FName CurrentMotivityTag; // 0x6a4
	float TrajectoryGoalReachTolerance; // 0x704
	float DestinationRotation_Replicated; // 0x708
	bool bHasOverridenGait; // 0x70c
	bool bHasReachedLastPoint; // 0x70d
	bool bEnableTrajErrorWarping; // 0x70e
	float WarpRate; // 0x710
	float MinTrajectoryLength; // 0x714
	FVector2D ErrorActivationRange; // 0x718
};

struct UNiagaraSettings {
	FSoftObjectPath DefaultEffectType; // 0x38
	TArray<FText> QualityLevels; // 0x50
	TMap<FString, FText> ComponentRendererWarningsPerClass; // 0x60
	ETextureRenderTargetFormat DefaultRenderTargetFormat; // 0xb0
	ENiagaraGpuBufferFormat DefaultGridFormat; // 0xb1
	ENiagaraDefaultRendererMotionVectorSetting DefaultRendererMotionVectorSetting; // 0xb4
	ENDISkelMesh_GpuMaxInfluences NDISkelMesh_GpuMaxInfluences; // 0xb8
	ENDISkelMesh_GpuUniformSamplingFormat NDISkelMesh_GpuUniformSamplingFormat; // 0xb9
	ENDISkelMesh_AdjacencyTriangleIndexFormat NDISkelMesh_AdjacencyTriangleIndexFormat; // 0xba
	UNiagaraEffectType* DefaultEffectTypePtr; // 0xc0
};

struct UParticleModuleAttractorLine {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct ASplineTrigger {
	FMulticastInlineDelegate Delegate_OnSplineEnclosureEntered; // 0x220
	FMulticastInlineDelegate Delegate_OnSplineEnclosureExited; // 0x230
	char bEnabled : 1; // 0x240
	char bDrawDebugElements : 1; // 0x240
	FVector AverageSplinePointLocation; // 0x244
	char bIsOutsideSplineEnclosure : 1; // 0x250
	USplineComponent* SplineComponent; // 0x258
};

struct UMovieSceneNiagaraParameterTrack {
	FNiagaraVariable Parameter; // 0xa0
};

struct UMaterialExpressionSceneDepthWithoutWater {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FVector2D ConstInput; // 0x58
	float FallbackDepth; // 0x60
};

struct UParticleModuleCollision {
	FRawDistributionVector DampingFactor; // 0x30
	FRawDistributionVector DampingFactorRotation; // 0x78
	FRawDistributionFloat MaxCollisions; // 0xc0
	EParticleCollisionComplete CollisionCompletionOption; // 0xf0
	TArray<EObjectTypeQuery> CollisionTypes; // 0xf8
	char bApplyPhysics : 1; // 0x110
	char bIgnoreTriggerVolumes : 1; // 0x110
	FRawDistributionFloat ParticleMass; // 0x118
	float DirScalar; // 0x148
	char bPawnsDoNotDecrementCount : 1; // 0x14c
	char bOnlyVerticalNormalsDecrementCount : 1; // 0x14c
	float VerticalFudgeFactor; // 0x150
	FRawDistributionFloat DelayAmount; // 0x158
	char bDropDetail : 1; // 0x188
	char bCollideOnlyIfVisible : 1; // 0x188
	char bIgnoreSourceActor : 1; // 0x188
	float MaxCollisionDistance; // 0x18c
};

struct UBTDecorator_CompareBBEntries {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UPhysicsCollisionHandler {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct UMaterialFunctionInstance {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct UForceFeedbackComponent {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x1f8
	char bAutoDestroy : 1; // 0x200
	char bStopWhenOwnerDestroyed : 1; // 0x200
	char bLooping : 1; // 0x200
	char bIgnoreTimeDilation : 1; // 0x200
	char bOverrideAttenuation : 1; // 0x200
	float IntensityMultiplier; // 0x204
	UForceFeedbackAttenuation* AttenuationSettings; // 0x208
	FForceFeedbackAttenuationSettings AttenuationOverrides; // 0x210
	FMulticastInlineDelegate OnForceFeedbackFinished; // 0x2c0
};

struct UCapsuleComponent {
	float CapsuleHalfHeight; // 0x468
	float CapsuleRadius; // 0x46c
};

struct UParticleModuleTypeDataRibbon {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct ABloodPool {
	UDecalComponent* Decal; // 0x220
};

struct UChallenge {
	FText ChallengeName; // 0x28
	FText ChallengeDescription; // 0x40
	FName ChallengeProgressName; // 0x58
	int32_t ChallengeProgressCurrent; // 0x60
	int32_t ChallengeProgressMax; // 0x64
	bool bHiddenChallenge; // 0x68
	bool bChallengeComplete; // 0x69
	bool bLevelSpecificChallenge; // 0x6a
};

struct UMaterialExpressionRuntimeVirtualTextureSample {
	FExpressionInput Coordinates; // 0x40
	FExpressionInput WorldPosition; // 0x54
	FExpressionInput MipValue; // 0x68
	URuntimeVirtualTexture* VirtualTexture; // 0x80
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x88
	bool bSinglePhysicalSpace; // 0x89
	bool bAdaptive; // 0x8a
	ERuntimeVirtualTextureMipValueMode MipValueMode; // 0x8b
	ERuntimeVirtualTextureTextureAddressMode TextureAddressMode; // 0x8c
};

struct UMovieSceneEventSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData EventData; // 0x160
};

struct UAREnvironmentProbeComponent {
	FAREnvironmentProbeUpdatePayload ReplicatedPayload; // 0x280
};

struct UEngineMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct UReadyOrNotMetaProfile {
	FString SaveSlotName; // 0x28
	uint32_t UserIndex; // 0x38
	TArray<FString> SingleplayerProfiles; // 0x40
	FString CurrentProfile; // 0x50
};

struct ALandscapeProxy {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char CastShadow : 1; // 0x38c
	char bCastDynamicShadow : 1; // 0x38c
	char bCastStaticShadow : 1; // 0x38c
	char bCastFarShadow : 1; // 0x390
	char bCastHiddenShadow : 1; // 0x394
	char bCastShadowAsTwoSided : 1; // 0x398
	char bAffectDistanceFieldLighting : 1; // 0x39c
	FLightingChannels LightingChannels; // 0x39d
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a0
	char bRenderCustomDepth : 1; // 0x3a0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3a4
	int32_t CustomDepthStencilValue; // 0x3a8
	float LDMaxDrawDistance; // 0x3ac
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b0
	int32_t CollisionMipLevel; // 0x3c8
	int32_t SimpleCollisionMipLevel; // 0x3cc
	float CollisionThickness; // 0x3d0
	FBodyInstance BodyInstance; // 0x3d8
	char bGenerateOverlapEvents : 1; // 0x530
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x530
	int32_t ComponentSizeQuads; // 0x534
	int32_t SubsectionSizeQuads; // 0x538
	int32_t NumSubsections; // 0x53c
	char bUsedForNavigation : 1; // 0x540
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x540
	bool bUseDynamicMaterialInstance; // 0x544
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x545
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x546
	bool bHasLayersContent; // 0x547
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x548
};

struct UWorldComposition {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct ALobbyGM {
	TArray<AReadyOrNotPlayerController*> InitalizedPlayerControllers; // 0x678
};

struct UReverbEffect {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UMaterialExpressionLogarithm10 {
	FExpressionInput X; // 0x40
};

struct UAnimNotify_ItemSwitchSocket {
	EItemSocket DesiredItemSocket; // 0x38
};

struct USafeZoneSlot {
	bool bIsTitleSafe; // 0x38
	FMargin SafeAreaScale; // 0x3c
	EHorizontalAlignment HAlign; // 0x4c
	EVerticalAlignment VAlign; // 0x4d
	FMargin Padding; // 0x50
};

struct UParticleModuleMeshRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct UAnimCompress_PerTrackCompression {
	float MaxZeroingThreshold; // 0x60
	float MaxPosDiffBitwise; // 0x64
	float MaxAngleDiffBitwise; // 0x68
	float MaxScaleDiffBitwise; // 0x6c
	TArray<AnimationCompressionFormat> AllowedRotationFormats; // 0x70
	TArray<AnimationCompressionFormat> AllowedTranslationFormats; // 0x80
	TArray<AnimationCompressionFormat> AllowedScaleFormats; // 0x90
	char bResampleAnimation : 1; // 0xa0
	float ResampledFramerate; // 0xa4
	int32_t MinKeysForResampling; // 0xa8
	char bUseAdaptiveError : 1; // 0xac
	char bUseOverrideForEndEffectors : 1; // 0xac
	int32_t TrackHeightBias; // 0xb0
	float ParentingDivisor; // 0xb4
	float ParentingDivisorExponent; // 0xb8
	char bUseAdaptiveError2 : 1; // 0xbc
	float RotationErrorSourceRatio; // 0xc0
	float TranslationErrorSourceRatio; // 0xc4
	float ScaleErrorSourceRatio; // 0xc8
	float MaxErrorPerTrackRatio; // 0xcc
	float PerturbationProbeSize; // 0xd0
};

struct UPaperTerrainComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x450
	bool bClosedSpline; // 0x458
	bool bFilledSpline; // 0x459
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x460
	int32_t RandomSeed; // 0x468
	float SegmentOverlapAmount; // 0x46c
	FLinearColor TerrainColor; // 0x470
	int32_t ReparamStepsPerSegment; // 0x480
	ESpriteCollisionMode SpriteCollisionDomain; // 0x484
	float CollisionThickness; // 0x488
	UBodySetup* CachedBodySetup; // 0x490
};

struct UNamedInterfaces {
	TArray<FNamedInterface> NamedInterfaces; // 0x28
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x38
};

struct UEnvQueryGenerator_CurrentLocation {
	UEnvQueryContext* QueryContext; // 0x50
};

struct AHUD_COOP_C {
	USceneComponent* DefaultSceneRoot; // 0x318
};

struct UCancelFindSessionsCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UW_ItemSelection_ItemGroupList_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UHorizontalBox* ItemList_Container; // 0x280
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_2; // 0x288
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_3; // 0x290
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_4; // 0x298
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_5; // 0x2a0
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_6; // 0x2a8
	UW_ItemSelection_ItemGroup_C* W_ItemSelection_ItemGroup_75; // 0x2b0
	int32_t SelectedColumn; // 0x2b8
	int32_t PreviousSelectedColumn; // 0x2bc
	TArray<UW_ItemSelection_ItemList_C*> ItemLists; // 0x2c0
	TArray<FItemSelectionPanelSetting_ItemGroup> ItemGroups; // 0x2d0
	APlayerCharacter* PlayerCharacter; // 0x2e0
	bool bNVGOn; // 0x2e8
};

struct UMotivityProcessedData {
	float PoseInterval; // 0x28
	TArray<FMotionCandidate> PoseCandidates; // 0x30
	TArray<FMotionCandidate> IdlePoseCandidates; // 0x40
	TArray<FName> ReferencedBones; // 0x50
	TArray<UAnimSequence*> AnimationsInMemory; // 0x60
	TArray<UAnimSequence*> IdleAnimationsInMemory; // 0x70
	USkeleton* ReferencedSkeleton; // 0x80
	FMotivityTimeData PredictionData; // 0x88
	FMotivityCalibrationData CalibrationData; // 0x98
};

struct ANiagaraActor {
	UNiagaraComponent* NiagaraComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
};

struct UAnimCurveCompressionSettings {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct USkyLightComponent {
	bool bRealTimeCapture; // 0x228
	ESkyLightSourceType SourceType; // 0x229
	UTextureCube* Cubemap; // 0x230
	float SourceCubemapAngle; // 0x238
	int32_t CubemapResolution; // 0x23c
	float SkyDistanceThreshold; // 0x240
	bool bCaptureEmissiveOnly; // 0x244
	bool bLowerHemisphereIsBlack; // 0x245
	FLinearColor LowerHemisphereColor; // 0x248
	float OcclusionMaxDistance; // 0x258
	float Contrast; // 0x25c
	float OcclusionExponent; // 0x260
	float MinOcclusion; // 0x264
	FColor OcclusionTint; // 0x268
	char bCloudAmbientOcclusion : 1; // 0x26c
	float CloudAmbientOcclusionStrength; // 0x270
	float CloudAmbientOcclusionExtent; // 0x274
	float CloudAmbientOcclusionMapResolutionScale; // 0x278
	float CloudAmbientOcclusionApertureScale; // 0x27c
	EOcclusionCombineMode OcclusionCombineMode; // 0x280
	UTextureCube* BlendDestinationCubemap; // 0x328
};

struct UParticleModuleLocationEmitter {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UDatasmithCineCameraActorTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x30
};

struct UW_ControlsResetBinding_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Button_Disabled; // 0x268
	UImage* Button_Dn; // 0x270
	UImage* Button_Hi; // 0x278
	UImage* Button_Up; // 0x280
	UButton* ResetButton; // 0x288
	FName BindName; // 0x290
	FMulticastInlineDelegate OnResetClicked; // 0x298
	FMulticastInlineDelegate OnResetHovered; // 0x2a8
	FMulticastInlineDelegate OnResetUnhovered; // 0x2b8
	FMulticastInlineDelegate OnResetPressed; // 0x2c8
	FMulticastInlineDelegate OnResetReleased; // 0x2d8
	bool bAxis; // 0x2e8
	UTextBlock* DescriptionText; // 0x2f0
	FText Description; // 0x2f8
	TArray<UW_ControlsBind_C*> BindingButtons; // 0x310
	UFMODEvent* ResetBindingClickedSound; // 0x320
	UFMODEvent* ResetBindingHoveredSound; // 0x328
	TArray<FAxisMappingStruct> AxisMappings; // 0x330
	TArray<FActionMappingStruct> ActionMappings; // 0x340
	TArray<FAxisMappingStruct> TempRemoveAxisMappings; // 0x350
	TArray<FActionMappingStruct> TempRemoveActionMappings; // 0x360
};

struct UFont {
	EFontCacheType FontCacheType; // 0x30
	TArray<FFontCharacter> Characters; // 0x38
	TArray<UTexture2D*> Textures; // 0x48
	int32_t IsRemapped; // 0x58
	float EmScale; // 0x5c
	float Ascent; // 0x60
	float Descent; // 0x64
	float Leading; // 0x68
	int32_t Kerning; // 0x6c
	FFontImportOptionsData ImportOptions; // 0x70
	int32_t NumCharacters; // 0x120
	TArray<int32_t> MaxCharHeight; // 0x128
	float ScalingFactor; // 0x138
	int32_t LegacyFontSize; // 0x13c
	FName LegacyFontName; // 0x140
	FCompositeFont CompositeFont; // 0x148
};

struct AArrestXSuspects {
	int32_t RequiredArrests; // 0x278
};

struct UMaterialExpressionBlendMaterialAttributes {
	FMaterialAttributesInput A; // 0x40
	FMaterialAttributesInput B; // 0x58
	FExpressionInput Alpha; // 0x70
	EMaterialAttributeBlend PixelAttributeBlendType; // 0x84
	EMaterialAttributeBlend VertexAttributeBlendType; // 0x85
};

struct UNiagaraDataInterfaceAudioOscilloscope {
	USoundSubmix* Submix; // 0x38
	int32_t Resolution; // 0x40
	float ScopeInMilliseconds; // 0x44
};

struct UAsyncActionLoadPrimaryAssetClass {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UHesitationBarWidget {
	UImage* HesitationBar_Image; // 0x260
	UWidgetAnimation* BreakAnim; // 0x268
	UMaterialInterface* HesitationBarMaterial; // 0x270
	FName ProgressParamName; // 0x278
	FName ComplianceStartParamName; // 0x280
	FName ComplianceEndParamName; // 0x288
	FName ComplianceColorParamName; // 0x290
	FName DefianceStartParamName; // 0x298
	FName DefianceEndParamName; // 0x2a0
	FName DefianceColorParamName; // 0x2a8
	float PercentageFilled; // 0x2b0
	UMaterialInstanceDynamic* MID_HesitationBar; // 0x2b8
};

struct UPawnAction_Repeat {
	UPawnAction* ActionToRepeat; // 0x90
	UPawnAction* RecentActionCopy; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
};

struct UUserInterfaceSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	TMap<EMouseCursor, FHardwareCursorReference> HardwareCursors; // 0x40
	TMap<EMouseCursor, FSoftClassPath> SoftwareCursors; // 0x90
	FSoftClassPath DefaultCursor; // 0xe0
	FSoftClassPath TextEditBeamCursor; // 0xf8
	FSoftClassPath CrosshairsCursor; // 0x110
	FSoftClassPath HandCursor; // 0x128
	FSoftClassPath GrabHandCursor; // 0x140
	FSoftClassPath GrabHandClosedCursor; // 0x158
	FSoftClassPath SlashedCircleCursor; // 0x170
	float ApplicationScale; // 0x188
	EUIScalingRule UIScaleRule; // 0x18c
	FSoftClassPath CustomScalingRuleClass; // 0x190
	FRuntimeFloatCurve UIScaleCurve; // 0x1a8
	bool bAllowHighDPIInGameMode; // 0x230
	FIntPoint DesignScreenSize; // 0x234
	bool bLoadWidgetsOnDedicatedServer; // 0x23c
	TArray<UObject*> CursorClasses; // 0x240
	UObject* CustomScalingRuleClassInstance; // 0x250
	UDPICustomScalingRule* CustomScalingRule; // 0x258
};

struct UW_FireMode_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* FireMode_Icon_Image; // 0x268
	UTextBlock* FireMode_Text; // 0x270
	FSlateBrush Icon; // 0x278
	FLinearColor SelectedColor; // 0x300
	FText FireModeText; // 0x310
};

struct UInAppPurchaseComponent {
	FMulticastInlineDelegate InAppPurchaseLogMessage; // 0xb0
	FMulticastInlineDelegate GetItemsDetailsSuccess; // 0xc0
	FMulticastInlineDelegate GetItemsDetailsFailure; // 0xd0
	FMulticastInlineDelegate PurchaseConfirmationSuccess; // 0xe0
	FMulticastInlineDelegate PurchaseConfirmationFailure; // 0xf0
	FMulticastInlineDelegate GetPurchaseHistorySuccess; // 0x100
	FMulticastInlineDelegate GetPurchaseHistoryFailure; // 0x110
};

struct UW_Briefing_Timeline_TrackWave_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_Text_C* txt_Debug; // 0x268
	UVerticalBox* VB_Waveform; // 0x270
	bool bIsDesignTime; // 0x278
	bool bIsPlaying; // 0x279
	bool bIsEvent; // 0x27a
	bool bEventInProgress; // 0x27b
	bool bIsFinished; // 0x27c
	float CurrentPlayTime; // 0x280
	float Duration; // 0x284
	USoundWave* SoundWaveAsset; // 0x288
	float ProgressMade; // 0x290
	float AmpUpdateFrequency; // 0x294
	TMap<float, FTimelineEvent> EventEntries; // 0x298
	FMulticastInlineDelegate TimelineEventFired; // 0x2e8
	FMulticastInlineDelegate TimelineEventEnded; // 0x2f8
	float CurrentEventID; // 0x308
	TMap<float, UW_Briefing_Timeline_TrackWaveElement_C*> EventWaveSegments; // 0x310
	float TickInterval; // 0x360
};

struct UMaterialExpressionClamp {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UBehaviorTree {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UMaterialExpressionLogarithm2 {
	FExpressionInput X; // 0x40
};

struct UANIMBP_Player_TP_V2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe20
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0xe28
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0xf30
	FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1038
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x1130
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x1238
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x1390
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x13d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x14e0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x15e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x16f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x1718
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24; // 0x1798
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_8; // 0x1860
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23; // 0x18d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x19a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x1a20
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x1ad0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x1c28
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x1ca8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x1d58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x1eb0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x1f30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x1fd0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x2128
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x2280
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x22a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x22d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x22f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2320
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x2348
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x2370
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x2398
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x23c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x23e8
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x2468
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x2498
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2518
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x2548
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x25c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x25f8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22; // 0x2678
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x2740
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x2768
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x2790
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x27b8
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_7; // 0x27e0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21; // 0x2858
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x2920
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x2970
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x29c0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x2a10
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x2ac0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_6; // 0x2af0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20; // 0x2b68
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x2c30
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x2c80
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x2cd0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x2d20
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x2dd0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x2e00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x2e28
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x2e50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2ef0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2f18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2f40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2f68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x2f90
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x3010
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x3040
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x3090
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x30c0
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x30e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x3118
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x31c8
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x3290
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x32c0
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x3370
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x33a0
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x3420
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x3450
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x34d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x3598
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x35c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x35e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3610
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_5; // 0x3638
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x36b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x3778
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x37c8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x3818
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x3868
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x3918
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x3948
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x3998
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x39e8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x3a38
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x3b00
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4; // 0x3bb0
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3c28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x3c58
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x3c80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x3d20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3d48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x3de8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x3e10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x3eb0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x3ed8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x3fa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3fc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x3ff0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x4018
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x4040
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x4068
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x4090
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x40e0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x4110
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x4160
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x4190
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x41b8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x41e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x4298
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x4360
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x4390
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4440
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x4470
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x4520
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x45e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x46a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x4728
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x47a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x4870
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x4910
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x49b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x4a30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x4ab0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x4c08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x4c30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x4c58
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x4c80
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x4dd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x4e88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x4eb0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x4ed8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x5068
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x51c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x5260
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x5288
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x5328
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x5480
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x54a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x5638
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x56d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x5778
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x57a0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x58f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x5a88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x5ab0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x5ad8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x5b00
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x5c58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x5d18
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x5d40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x5e08
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x5e30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x5f88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x6028
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x6050
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x6078
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x6138
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x6160
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x6228
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x6380
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x6400
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x64a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x64c8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x65d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x6728
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x67d0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x69b0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x6b90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x6d20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x6da0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x6e20
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3; // 0x6ee8
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2; // 0x6f60
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x6fd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x70a0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x7120
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7198
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x71c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7350
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x7378
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x7508
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x7530
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_6; // 0x76c0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x7828
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x79b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x7a38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x7ab8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x7b38
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x7bb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x7d10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x7db0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x7e30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x7eb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x7f30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7fb0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x8108
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x8210
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x8290
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x8310
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x8390
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x8410
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x8568
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x8670
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x86f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x8770
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x87f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x8870
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x89c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x8ad0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x8b50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x8bd0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x8c50
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x8cd0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x8e28
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x8f30
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x8ff8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x9048
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x90f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x91a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x9228
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x92a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x9328
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x93a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x9458
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x94d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x9558
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x95d8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x9658
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x9708
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x9788
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x9808
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x9888
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x9908
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x99b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x9a68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x9ae8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x9b68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x9be8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x9c68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x9ce8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x9d68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x9de8
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_5; // 0x9e68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x9fd0
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_4; // 0x9ff8
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_3; // 0xa160
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_2; // 0xa2c8
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver; // 0xa430
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0xa598
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0xa638
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0xa6b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0xa738
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0xa7b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0xa838
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0xa8b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0xa938
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0xa9b8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xaa38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0xaae8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0xab68
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0xabe8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xacb0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0xacd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xad78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xadf8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xae78
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0xaf80
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xafc8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0xb018
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0xb0d8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0xb1a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0xb268
	FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0xb2e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0xb510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xb5b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0xb630
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xb6f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0xb778
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xb818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xb898
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0xb918
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0xb9b8
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0xba38
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xba80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xbaa0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xbbf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0xbca8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xbd28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xbda8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xbe28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xbea8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xbf28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xbfa8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xc028
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xc0a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xc170
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xc198
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xc1c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc1e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc210
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xc238
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xc2b8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xc2e8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc338
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xc368
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc3e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc418
	FAnimNode_Root AnimGraphNode_Root; // 0xc4c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xc4f8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xc518
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xc6a8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xc758
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0xc818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xc8b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xc938
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xc9b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xc9e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xca08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xcb60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xcb88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0xcbb0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xcc50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xcd10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xcd38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xcdb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xce38
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0xced8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xcf20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xcfc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xd040
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xd0c0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xd140
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xd1f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xd348
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xd370
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xd430
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xd458
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xd4e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xd588
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xd628
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xd6a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xd768
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xd790
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xd858
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xd880
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xd8a8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xd970
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xda30
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xda58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xdb20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xdb48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xdb70
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xdc10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xdd68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xdd90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xddb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xde38
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xded8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xdf88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xe008
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xe088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xe108
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xe188
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xe250
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xe2f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xe318
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xe3e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xe408
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xe430
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xe4f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xe590
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xe630
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xe6b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xe760
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xe7e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xe860
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe900
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xe9c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xea90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xeab8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xeae0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xeba0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xebc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xec90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xecb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xece0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xed60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xee00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xee28
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xee50
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0xefa8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0xeff0
	FAnimNode_Slot AnimGraphNode_Slot; // 0xf038
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xf080
	FRotator AimDeltaRot; // 0xf140
	float LeanTransitionSpeeds; // 0xf14c
	float DirectionBlendTime; // 0xf150
	float WeaponUpBlendTime; // 0xf154
	float AnimSpeedForward; // 0xf158
	float AnimSpeedRight; // 0xf15c
	float AnimWarpPlayrateThreshold; // 0xf160
	FVector LeftJointLoc; // 0xf164
	FVector RightJoinLoc; // 0xf170
	float CharSpeed; // 0xf17c
	float InputUpDown; // 0xf180
	FPoseSnapshot DeathPose; // 0xf188
	float TurnRemainingStartTime; // 0xf1c0
	float SlopeWarpingAlpha; // 0xf1c4
	bool bIsVIP1911; // 0xf1c8
	bool bIsCustomizing; // 0xf1c9
	bool bHoldingVIPWeapon; // 0xf1ca
	bool bHoldingWeaponAsMLO; // 0xf1cb
	bool bCanTurnInPlace; // 0xf1cc
	bool IsItemOrPistolMotionBlock; // 0xf1cd
	bool IsRifleMotionBlock; // 0xf1ce
	bool bIsCrouchingWithShield; // 0xf1cf
	float IsNotCustomizing_AsFloat; // 0xf1d0
	float CrouchHighPoseAdditiveAlpha; // 0xf1d4
	float StandHighPoseAdditiveAlpha; // 0xf1d8
	float LeftHandIKAlpha_ItemBased; // 0xf1dc
	FVector ZHeightLeanAdjustment; // 0xf1e0
	float IsCrouchingWithShield_AsFloat; // 0xf1ec
};

struct UARComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct ACTF_Flag {
	USceneComponent* SceneComponent; // 0x220
	UStaticMeshComponent* FlagMeshComponent; // 0x228
	UBoxComponent* CaptureBoxComponent; // 0x230
	UObjectiveMarkerComponent* ObjectiveMarkerComponent; // 0x238
	FName BoneToAttach; // 0x240
};

struct UReloadSafelyActivity {
	TArray<ACoverActor*> CoverActors; // 0x1b8
};

struct AArmor_Heavy_V2_C {
	UCapsuleComponent* Collision; // 0xa30
};

struct ULandscapeInfo {
	LazyObjectProperty LandscapeActor; // 0x28
	FGuid LandscapeGuid; // 0x44
	int32_t ComponentSizeQuads; // 0x54
	int32_t SubsectionSizeQuads; // 0x58
	int32_t ComponentNumSubsections; // 0x5c
	FVector DrawScale; // 0x60
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x110
};

struct USequenceCameraShakePattern {
	UCameraAnimationSequence* Sequence; // 0x28
	float PlayRate; // 0x30
	float Scale; // 0x34
	float BlendInTime; // 0x38
	float BlendoutTime; // 0x3c
	float RandomSegmentDuration; // 0x40
	bool bRandomSegment; // 0x44
	USequenceCameraShakeSequencePlayer* Player; // 0x48
	USequenceCameraShakeCameraStandIn* CameraStandIn; // 0x50
};

struct UReadyOrNotProfile {
	FString SaveSlotName; // 0x28
	uint32_t UserIndex; // 0x38
	TMap<FString, FBasicLevelStats> LevelStats; // 0x40
	TMap<FName, int32_t> ChallengeProgress; // 0x90
	TMap<FString, float> CourseTimes; // 0xe0
	float Cash; // 0x130
};

struct ARectLight {
	URectLightComponent* RectLightComponent; // 0x230
};

struct UPaperGroupedSpriteComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x478
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x488
};

struct APlayerController {
	UPlayer* Player; // 0x298
	APawn* AcknowledgedPawn; // 0x2a0
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2a8
	AHUD* MyHUD; // 0x2b0
	APlayerCameraManager* PlayerCameraManager; // 0x2b8
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2c0
	bool bAutoManageActiveCameraTarget; // 0x2c8
	FRotator TargetViewRotation; // 0x2cc
	float SmoothTargetViewRotationSpeed; // 0x2e4
	TArray<AActor*> HiddenActors; // 0x2f0
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300
	float LastSpectatorStateSynchTime; // 0x314
	FVector LastSpectatorSyncLocation; // 0x318
	FRotator LastSpectatorSyncRotation; // 0x324
	int32_t ClientCap; // 0x330
	UCheatManager* CheatManager; // 0x338
	UCheatManager* CheatClass; // 0x340
	UPlayerInput* PlayerInput; // 0x348
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350
	char bPlayerIsWaiting : 1; // 0x3d0
	char NetPlayerIndex; // 0x3d4
	UNetConnection* PendingSwapConnection; // 0x410
	UNetConnection* NetConnection; // 0x418
	float InputYawScale; // 0x42c
	float InputPitchScale; // 0x430
	float InputRollScale; // 0x434
	char bShowMouseCursor : 1; // 0x438
	char bEnableClickEvents : 1; // 0x438
	char bEnableTouchEvents : 1; // 0x438
	char bEnableMouseOverEvents : 1; // 0x438
	char bEnableTouchOverEvents : 1; // 0x438
	char bForceFeedbackEnabled : 1; // 0x438
	float ForceFeedbackScale; // 0x43c
	TArray<FKey> ClickEventKeys; // 0x440
	EMouseCursor DefaultMouseCursor; // 0x450
	EMouseCursor CurrentMouseCursor; // 0x451
	ECollisionChannel DefaultClickTraceChannel; // 0x452
	ECollisionChannel CurrentClickTraceChannel; // 0x453
	float HitResultTraceDistance; // 0x454
	uint16_t SeamlessTravelCount; // 0x458
	uint16_t LastCompletedSeamlessTravelCount; // 0x45a
	UInputComponent* InactiveStateInputComponent; // 0x4d0
	char bShouldPerformFullTickWhenPaused : 1; // 0x4d8
	UTouchInterface* CurrentTouchInterface; // 0x4f0
	ASpectatorPawn* SpectatorPawn; // 0x548
	bool bIsLocalPlayerController; // 0x554
	FVector SpawnLocation; // 0x558
};

struct UMotivityMoveData {
	TArray<FMovementStyle> MovementStyles; // 0x30
};

struct AGameMode {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct UThrobber {
	int32_t NumberOfPieces; // 0x108
	bool bAnimateHorizontally; // 0x10c
	bool bAnimateVertically; // 0x10d
	bool bAnimateOpacity; // 0x10e
	USlateBrushAsset* PieceImage; // 0x110
	FSlateBrush Image; // 0x118
};

struct UStereoLayerComponent {
	char bLiveTexture : 1; // 0x1f8
	char bSupportsDepth : 1; // 0x1f8
	char bNoAlphaChannel : 1; // 0x1f8
	UTexture* Texture; // 0x200
	UTexture* LeftTexture; // 0x208
	char bQuadPreserveTextureRatio : 1; // 0x210
	FVector2D QuadSize; // 0x214
	FBox2D UVRect; // 0x21c
	float CylinderRadius; // 0x230
	float CylinderOverlayArc; // 0x234
	int32_t CylinderHeight; // 0x238
	FEquirectProps EquirectProps; // 0x23c
	EStereoLayerType StereoLayerType; // 0x284
	EStereoLayerShape StereoLayerShape; // 0x285
	UStereoLayerShape* Shape; // 0x288
	int32_t Priority; // 0x290
};

struct UUserDefinedCaptureProtocol {
	UWorld* World; // 0x58
};

struct UW_TutorialMessageEntry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_54; // 0x268
	UTextBlock* MessageContent; // 0x270
	FText MessageContentText; // 0x278
	FSlateFontInfo FontInfo; // 0x290
};

struct AHelmet_BallisticMask_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1550
	APlayerState* PlayerState; // 0x1558
};

struct ADefaultImpactEffects_C {
	USceneComponent* DefaultSceneRoot; // 0xcb0
};

struct UPlatformMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct AKingOfTheHostageGS {
	float RedTeam_RoundTimeRemaining; // 0x6c0
	float BlueTeam_RoundTimeRemaining; // 0x6c4
};

struct UW_Header_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UNamedSlot* AugmentSlot; // 0x268
	UW_Button_C* btn_Header; // 0x270
	UHorizontalBox* HB_Header; // 0x278
	UW_Text_C* txt_Label; // 0x280
	FText LabelText; // 0x288
	bool bIsButton; // 0x2a0
	ETextFlowDirection Layout; // 0x2a1
};

struct UW_PersonalizationCategory_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_StandardButton_C* Button; // 0x268
	UUniformGridPanel* GridPanel; // 0x270
	UOverlay* SelectedItemInfo_Container; // 0x278
	UW_Text_C* txt_CategoryName; // 0x280
	FText Category; // 0x288
	StandardButtonStyles ButtonStyle; // 0x2a0
	FMulticastInlineDelegate OnClicked; // 0x2a8
};

struct ULandscapeMeshCollisionComponent {
	FGuid MeshGuid; // 0x530
};

struct UMaterialExpressionInverseLinearInterpolate {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UW_Briefing_Intel_Entry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_Button_C* btn_Intel; // 0x268
	UImage* img_IntelThumbnail; // 0x270
	UBorder* SelectionBorder; // 0x278
	FSlateBrush DocumentThumbnail; // 0x280
	E_Briefing_Intel_Types DocumentType; // 0x308
	FCharacterBio Bio; // 0x310
	FMulticastInlineDelegate BioIntelClicked; // 0x430
	FST_Briefing_Evidence Media; // 0x440
	bool bIsBio; // 0x4e0
	bool bIsMedia; // 0x4e1
	bool bIsHovered; // 0x4e2
	FMulticastInlineDelegate MediaIntelClicked; // 0x4e8
	bool bIsActive; // 0x4f8
	FLinearColor colTintActive; // 0x4fc
	FSlateBrush BorderActiveBrush; // 0x510
	FSlateBrush BorderNormalBrush; // 0x598
};

struct UNiagaraDataInterfaceVectorCurve {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
};

struct UMaterialExpressionMapARPassthroughCameraUV {
	FExpressionInput Coordinates; // 0x40
};

struct UMaterialExpressionVectorParameter {
	FLinearColor DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x68
	char PrimitiveDataIndex; // 0x69
};

struct UMapActorWidget {
	UTextBlock* MapActor_Text; // 0x278
	AActor* ActorToTrack; // 0x280
	bool bUseActorRotation; // 0x288
	bool bUseLocation; // 0x289
	FVector LocationToTrack; // 0x28c
	float RotationOffset; // 0x298
	float MapSize; // 0x29c
	float MapTextureSize; // 0x2a0
	FVector2D MapOrigin; // 0x2a4
};

struct UConversation {
	TArray<FConversationData> ConversationData; // 0x40
	FMulticastInlineDelegate OnConversationContinuing; // 0x60
	FMulticastInlineDelegate OnEndConversation; // 0x70
};

struct UInAppPurchaseQueryCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UNiagaraDataInterfaceRenderTarget2DArray {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bInheritUserParameterSettings : 1; // 0xe5
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2DArray*> ManagedRenderTargets; // 0x108
};

struct UPlatformGameInstance {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0x1a8
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0x1b8
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0x1c8
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0x1d8
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0x1e8
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x1f8
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x208
	FMulticastInlineDelegate ApplicationRegisteredForRemoteNotificationsDelegate; // 0x218
	FMulticastInlineDelegate ApplicationRegisteredForUserNotificationsDelegate; // 0x228
	FMulticastInlineDelegate ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x238
	FMulticastInlineDelegate ApplicationReceivedRemoteNotificationDelegate; // 0x248
	FMulticastInlineDelegate ApplicationReceivedLocalNotificationDelegate; // 0x258
	FMulticastInlineDelegate ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x268
};

struct UEdGraphNode {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UUniformGridPanel {
	FMargin SlotPadding; // 0x120
	float MinDesiredSlotWidth; // 0x130
	float MinDesiredSlotHeight; // 0x134
};

struct UReflectionCaptureComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch {
	FGameplayTagContainer Tags; // 0x28
};

struct UAxisPositionGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bInInteraction; // 0x89
	FVector InteractionOrigin; // 0x8c
	FVector InteractionAxis; // 0x98
	FVector InteractionStartPoint; // 0xa4
	FVector InteractionCurPoint; // 0xb0
	float InteractionStartParameter; // 0xbc
	float InteractionCurParameter; // 0xc0
	float ParameterSign; // 0xc4
};

struct UGizmoPlaneScaleParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct UGetFriendsCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieScenePropertyTrack {
	UMovieSceneSection* SectionToKey; // 0x90
	FMovieScenePropertyBinding PropertyBinding; // 0x98
	TArray<UMovieSceneSection*> Sections; // 0xb0
};

struct USkyAtmosphereComponent {
	ESkyAtmosphereTransformMode TransformMode; // 0x1f8
	float BottomRadius; // 0x1fc
	FColor GroundAlbedo; // 0x200
	float AtmosphereHeight; // 0x204
	float MultiScatteringFactor; // 0x208
	float TraceSampleCountScale; // 0x20c
	float RayleighScatteringScale; // 0x210
	FLinearColor RayleighScattering; // 0x214
	float RayleighExponentialDistribution; // 0x224
	float MieScatteringScale; // 0x228
	FLinearColor MieScattering; // 0x22c
	float MieAbsorptionScale; // 0x23c
	FLinearColor MieAbsorption; // 0x240
	float MieAnisotropy; // 0x250
	float MieExponentialDistribution; // 0x254
	float OtherAbsorptionScale; // 0x258
	FLinearColor OtherAbsorption; // 0x25c
	FTentDistribution OtherTentDistribution; // 0x26c
	FLinearColor SkyLuminanceFactor; // 0x278
	float AerialPespectiveViewDistanceScale; // 0x288
	float HeightFogContribution; // 0x28c
	float TransmittanceMinLightElevationAngle; // 0x290
	float AerialPerspectiveStartDepth; // 0x294
	FGuid bStaticLightingBuiltGUID; // 0x2bc
};

struct UPhysicalMaterial {
	float Friction; // 0x28
	float StaticFriction; // 0x2c
	EFrictionCombineMode FrictionCombineMode; // 0x30
	bool bOverrideFrictionCombineMode; // 0x31
	float Restitution; // 0x34
	EFrictionCombineMode RestitutionCombineMode; // 0x38
	bool bOverrideRestitutionCombineMode; // 0x39
	float Density; // 0x3c
	float SleepLinearVelocityThreshold; // 0x40
	float SleepAngularVelocityThreshold; // 0x44
	int32_t SleepCounterThreshold; // 0x48
	float RaiseMassToPower; // 0x4c
	float DestructibleDamageThresholdScale; // 0x50
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x58
	EPhysicalSurface surfaceType; // 0x60
};

struct UProjectileMovementComponent {
	float InitialSpeed; // 0xf0
	float MaxSpeed; // 0xf4
	char bRotationFollowsVelocity : 1; // 0xf8
	char bRotationRemainsVertical : 1; // 0xf8
	char bShouldBounce : 1; // 0xf8
	char bInitialVelocityInLocalSpace : 1; // 0xf8
	char bForceSubStepping : 1; // 0xf8
	char bSimulationEnabled : 1; // 0xf8
	char bSweepCollision : 1; // 0xf8
	char bIsHomingProjectile : 1; // 0xf8
	char bBounceAngleAffectsFriction : 1; // 0xf9
	char bIsSliding : 1; // 0xf9
	char bInterpMovement : 1; // 0xf9
	char bInterpRotation : 1; // 0xf9
	float PreviousHitTime; // 0xfc
	FVector PreviousHitNormal; // 0x100
	float ProjectileGravityScale; // 0x10c
	float Buoyancy; // 0x110
	float Bounciness; // 0x114
	float Friction; // 0x118
	float BounceVelocityStopSimulatingThreshold; // 0x11c
	float MinFrictionFraction; // 0x120
	FMulticastInlineDelegate OnProjectileBounce; // 0x128
	FMulticastInlineDelegate OnProjectileStop; // 0x138
	float HomingAccelerationMagnitude; // 0x148
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x14c
	float MaxSimulationTimeStep; // 0x154
	int32_t MaxSimulationIterations; // 0x158
	int32_t BounceAdditionalIterations; // 0x15c
	float InterpLocationTime; // 0x160
	float InterpRotationTime; // 0x164
	float InterpLocationMaxLagDistance; // 0x168
	float InterpLocationSnapToTargetDistance; // 0x16c
};

struct UAnimNotify_PlayMontage {
	UAnimMontage* Montage; // 0x38
};

struct UEndTurnCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UWidgetsData {
	UUserWidget* MagCheckUI; // 0x30
	TSoftClassPtr<UObject> FireModeUI; // 0x38
	TSoftClassPtr<UObject> StartupMenu; // 0x60
	TSoftClassPtr<UObject> AuthenticationMenu; // 0x88
	TSoftClassPtr<UObject> MainMenu; // 0xb0
	TSoftClassPtr<UObject> OptionsMenu; // 0xd8
	TSoftClassPtr<UObject> CustomizationMenu; // 0x100
	TSoftClassPtr<UObject> ChatBox; // 0x128
	TArray<TSoftClassPtr<UObject>> Overlays; // 0x150
	TSoftClassPtr<UObject> Scoreboard; // 0x160
	UUserWidget* LoadingScreen; // 0x188
	TSoftClassPtr<UObject> MessageDisplayBoxClass; // 0x190
	TSoftClassPtr<UObject> Leaderboards; // 0x1b8
	TSoftClassPtr<UObject> CrosshairOverlay; // 0x1e0
	TArray<USoundBase*> UISoundClasses; // 0x208
	TSoftClassPtr<UObject> EscapeMenu; // 0x218
	TSoftClassPtr<UObject> TacticalAuthorityWidget; // 0x240
	UWeaponWheelWidget* WeaponWheelWidget; // 0x268
	UBaseWidget* ItemSelectionWidget; // 0x270
};

struct UNiagaraDataInterfaceRenderTargetVolume {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bInheritUserParameterSettings : 1; // 0xe5
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTargetVolume*> ManagedRenderTargets; // 0x108
};

struct UUserWidget {
	FLinearColor ColorAndOpacity; // 0x110
	FDelegate ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	FDelegate ForegroundColorDelegate; // 0x158
	FMulticastInlineDelegate OnVisibilityChanged; // 0x168
	FMargin Padding; // 0x190
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x1a0
	UUMGSequenceTickManager* AnimationTickManager; // 0x1b0
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x1b8
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x1c8
	UWidgetTree* WidgetTree; // 0x1d8
	int32_t Priority; // 0x1e0
	char bSupportsKeyboardFocus : 1; // 0x1e4
	char bIsFocusable : 1; // 0x1e4
	char bStopAction : 1; // 0x1e4
	char bHasScriptImplementedTick : 1; // 0x1e4
	char bHasScriptImplementedPaint : 1; // 0x1e4
	EWidgetTickFrequency TickFrequency; // 0x1f0
	UInputComponent* InputComponent; // 0x1f8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x200
};

struct UW_Briefing_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	UWidgetAnimation* animHide; // 0x2d8
	UWidgetAnimation* Fade; // 0x2e0
	UW_Briefing_Audio_C* Audio; // 0x2e8
	UW_Briefing_Intel_C* Intel; // 0x2f0
	UW_Briefing_Objectives_C* Objectives; // 0x2f8
	UPreMissionPlanning* PreMissionPlanning; // 0x300
	TArray<UW_BriefingTaskButton_C*> BriefingTaskButtons; // 0x308
	TArray<FST_Briefing_Evidence> DocumentsPlaceholder; // 0x318
	FLevelDataLookupTable LevelData; // 0x328
};

struct UObjectiveMarkerWidget {
	UObjectiveMarkerComponent* ParentComponent; // 0x278
	UCanvasPanel* RootCanvasPanel; // 0x280
	USizeBox* Icon_SizeBox; // 0x288
	UImage* Icon_Image; // 0x290
	UImage* DirectionalArrow_Image; // 0x298
	UTextBlock* DistanceInMeters_Text; // 0x2a0
	UTextBlock* MarkerName_Text; // 0x2a8
	FVector Location; // 0x2b0
	float DistanceToLocalPlayer; // 0x2bc
	float DirectionAngle; // 0x2c0
	char bHideDistance : 1; // 0x2c4
};

struct URoNAnimInstance_PlayerFP {
	UReadyOrNotWeaponAnimData* LastWeaponAnimData; // 0x520
	UReadyOrNotWeaponAnimData* EditorWeaponAnimData; // 0x528
	float LeanAngleY; // 0x530
	float LeanAngleZ; // 0x534
	FRotator MeshControlRotation; // 0x538
	FVector MeshPostureLeanOffset; // 0x544
	FVector MeshWeaponOffset; // 0x550
	FRotator MeshWeaponRotation; // 0x55c
	FRotator MeshWeaponFreeAimRotation; // 0x568
	FVector MeshWeaponLeanOffset; // 0x574
	FRotator MeshWeaponLeanRotation; // 0x580
	USkeletalMeshComponent* TPMeshReference; // 0x590
	float LazySpringStrength; // 0x598
	float ADS_Movement_Weight; // 0x59c
	float InteractionSlotAlpha; // 0x5a0
	float DefaultSlotAlpha; // 0x5a4
	float RollMoveInput; // 0x5a8
	float PelvisMovementBobAlpha; // 0x5ac
};

struct UFieldSystemMetaDataIteration {
	int32_t Iterations; // 0xb0
};

struct UAnimatedIconWidget {
	TArray<UImage*> IconImages; // 0x260
	int32_t CurrentIndex; // 0x270
	float ElapsedTime; // 0x274
	char bPaused : 1; // 0x278
	UOverlay* InteractCircle_Overlay; // 0x280
	USizeBox* InteractIcon_SizeBox; // 0x288
	UWidgetSwitcher* IconSwitcher; // 0x290
	UImage* ProgressCircle_Image; // 0x298
	UWidgetAnimation* Anim_Interact; // 0x2a0
	UWidgetAnimation* Anim_Focus; // 0x2a8
	FLinearColor InteractionInvalidTintColor; // 0x2b0
	UMaterialInterface* ProgressCircleMaterial; // 0x2c0
	FName ProgressParamName; // 0x2c8
	UInteractableComponent* ParentComponent; // 0x2d0
	UMaterialInstanceDynamic* MID_ProgressCircle; // 0x2d8
};

struct ASpawnGenerator {
	USceneComponent* SceneComponent; // 0x220
	UBillboardComponent* BillboardComponent; // 0x228
	ETeamType SpawnTeam; // 0x230
	uint16_t Rows; // 0x232
	uint16_t Columns; // 0x234
	float RowSpacing; // 0x238
	float ColumnSpacing; // 0x23c
	char bShowNodes : 1; // 0x240
	TArray<APlayerStart*> PlayerStarts; // 0x258
};

struct UCanvasPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UFMODEventControlTrack {
	TArray<UMovieSceneSection*> ControlSections; // 0x98
};

struct UBTTask_Wait {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct UAnimSharingTransitionInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct USoundNodeConcatenator {
	TArray<float> InputVolume; // 0x48
};

struct UMaterialExpressionStaticComponentMaskParameter {
	char DefaultR : 1; // 0x58
	char DefaultG : 1; // 0x58
	char DefaultB : 1; // 0x58
	char DefaultA : 1; // 0x58
};

struct UBTDecorator_TagCooldown {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct UCurveLinearColor {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct AMessagePromptActor {
	FString MessageMapID; // 0x220
	bool bIsBigPopUp; // 0x230
	bool bHasDisplayedMessage; // 0x231
	FText MessageTitle; // 0x238
	TArray<FText> MessageContent; // 0x250
	TArray<FMessagePromptContent> MessageActions; // 0x260
};

struct UW_Briefing_TImeline_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_Header_C* h_Timeline; // 0x268
	UHorizontalBox* HB_Timeline; // 0x270
	UCanvasPanel* TimelineEntryCanvas; // 0x278
	UW_Briefing_Timeline_TrackWave_C* W_Briefing_Timeline_TrackWave; // 0x280
	UWidget* AudioControlWidget; // 0x288
	TMap<float, FTimelineEvent> EventEntries; // 0x290
	E_Briefing_Audio_PlayStates PlayState; // 0x2e0
	float AudioCurrentTime; // 0x2e4
};

struct ADebugCameraController {
	char bShowSelectedInfo : 1; // 0x570
	char bIsFrozenRendering : 1; // 0x570
	char bIsOrbitingSelectedActor : 1; // 0x570
	char bOrbitPivotUseCenter : 1; // 0x570
	char bEnableBufferVisualization : 1; // 0x570
	char bEnableBufferVisualizationFullMode : 1; // 0x570
	char bIsBufferVisualizationInputSetup : 1; // 0x570
	char bLastDisplayEnabled : 1; // 0x570
	UDrawFrustumComponent* DrawFrustum; // 0x578
	AActor* SelectedActor; // 0x580
	UPrimitiveComponent* SelectedComponent; // 0x588
	FHitResult SelectedHitPoint; // 0x590
	APlayerController* OriginalControllerRef; // 0x618
	UPlayer* OriginalPlayer; // 0x620
	float SpeedScale; // 0x628
	float InitialMaxSpeed; // 0x62c
	float InitialAccel; // 0x630
	float InitialDecel; // 0x634
};

struct UCompositeDataTable {
	TArray<UDataTable*> ParentTables; // 0xb0
	TArray<UDataTable*> OldParentTables; // 0xc0
};

struct UParticleSystem {
	float UpdateTime_FPS; // 0x30
	float UpdateTime_Delta; // 0x34
	float WarmupTime; // 0x38
	float WarmupTickRate; // 0x3c
	TArray<UParticleEmitter*> Emitters; // 0x40
	UParticleSystemComponent* PreviewComponent; // 0x50
	UInterpCurveEdSetup* CurveEdSetup; // 0x58
	float LODDistanceCheckTime; // 0x60
	float MacroUVRadius; // 0x64
	TArray<float> LODDistances; // 0x68
	TArray<FParticleSystemLOD> LODSettings; // 0x78
	FBox FixedRelativeBoundingBox; // 0x88
	float SecondsBeforeInactive; // 0xa4
	float Delay; // 0xa8
	float DelayLow; // 0xac
	char bOrientZAxisTowardCamera : 1; // 0xb0
	char bUseFixedRelativeBoundingBox : 1; // 0xb0
	char bShouldResetPeakCounts : 1; // 0xb0
	char bHasPhysics : 1; // 0xb0
	char bUseRealtimeThumbnail : 1; // 0xb0
	char ThumbnailImageOutOfDate : 1; // 0xb0
	char bUseDelayRange : 1; // 0xb1
	char bAllowManagedTicking : 1; // 0xb1
	char bAutoDeactivate : 1; // 0xb1
	char bRegenerateLODDuplicate : 1; // 0xb1
	EParticleSystemUpdateMode SystemUpdateMode; // 0xb2
	ParticleSystemLODMethod LODMethod; // 0xb3
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xb4
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0xb5
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xb7
	uint32_t MinTimeBetweenTicks; // 0xb8
	float InsignificanceDelay; // 0xbc
	FVector MacroUVPosition; // 0xc0
	FBox CustomOcclusionBounds; // 0xcc
	TArray<FLODSoloTrack> SoloTracking; // 0xe8
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0xf8
};

struct APrimary_TAC700_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1150
};

struct UChaosGameplayEventDispatcher {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct AGM_VIPEscort_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x728
	USceneComponent* DefaultSceneRoot; // 0x730
	TArray<FVector> HostageSpawns; // 0x738
	bool bSidesSwapped; // 0x748
	float TargetTimeDilation; // 0x74c
	FMulticastInlineDelegate OnRoundResetComplete; // 0x750
};

struct UCompressedImageSequenceProtocol {
	int32_t CompressionQuality; // 0xd8
};

struct UDistributionVectorUniform {
	FVector Max; // 0x38
	FVector Min; // 0x44
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x55
	char bUseExtremes : 1; // 0x58
};

struct AIncriminationGM {
	char MaxCluesToFind; // 0x6d8
	ASpawnGenerator* ChosenSpawnGroup_BlueTeam; // 0x6e0
	ASpawnGenerator* ChosenSpawnGroup_RedTeam; // 0x6e8
};

struct UMaterialFunction {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
};

struct UEnvQueryTest_Pathfinding {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct ADoor {
	AActor* DoorBlockerActor; // 0x268
	AActor* DoorBlockerActorInst; // 0x270
	UTeamBreachAndClearActivity* CurrentTeamBreachActivity; // 0x2a0
	FMulticastInlineDelegate OnDoorOpened; // 0x2a8
	FMulticastInlineDelegate OnSubDoorOpened; // 0x2b8
	FMulticastInlineDelegate OnDoorClosed; // 0x2c8
	FMulticastInlineDelegate OnDoorBroken; // 0x2d8
	TArray<AThreatAwarenessActor*> FrontThreatAwarenessPoints; // 0x2e8
	TArray<AThreatAwarenessActor*> BackThreatAwarenessPoints; // 0x2f8
	TArray<AStackUpActor*> FrontLeftStackUpPoints; // 0x308
	TArray<AStackUpActor*> FrontRightStackUpPoints; // 0x318
	TArray<AStackUpActor*> BackLeftStackUpPoints; // 0x328
	TArray<AStackUpActor*> BackRightStackUpPoints; // 0x338
	TArray<AThreatAwarenessActor*> RedTeamFrontClearPoints; // 0x348
	TArray<AThreatAwarenessActor*> BlueTeamFrontClearPoints; // 0x358
	TArray<AThreatAwarenessActor*> RedTeamBackClearPoints; // 0x368
	TArray<AThreatAwarenessActor*> BlueTeamBackClearPoints; // 0x378
	char bDoorJammed : 1; // 0x388
	TArray<int32_t> DestroyedChunkIdxs; // 0x390
	EStackupGenType StackupGenType; // 0x3a0
	EStackupGenArea StackupGenArea; // 0x3a1
	bool bShouldInvertTrap; // 0x3a2
	USceneComponent* RootScene; // 0x3b8
	UStaticMeshComponent* DoorStatic; // 0x3c0
	UStaticMeshComponent* DoorHandleFront; // 0x3c8
	UStaticMeshComponent* DoorHandleBack; // 0x3d0
	UMirrorPortalComponent* FrontMirrorPoint; // 0x3d8
	UMirrorPortalComponent* BackMirrorPoint; // 0x3e0
	UDestructibleDoorChunkComponent* DoorChunk0; // 0x3e8
	UDestructibleDoorChunkComponent* DoorChunk1; // 0x3f0
	UDestructibleDoorChunkComponent* DoorChunk2; // 0x3f8
	UDestructibleDoorChunkComponent* DoorChunk3; // 0x400
	UDestructibleDoorChunkComponent* DoorChunk4; // 0x408
	UDestructibleDoorChunkComponent* DoorChunk5; // 0x410
	UDestructibleDoorChunkComponent* DoorChunk6; // 0x418
	UDestructibleDoorChunkComponent* DoorChunk7; // 0x420
	UDestructibleDoorChunkComponent* DoorChunk8; // 0x428
	UInteractableComponent* DoorOpenInteractableComp; // 0x430
	UInteractableComponent* DoorSublinkOpenInteractableComp; // 0x438
	UInteractableComponent* DoorSublinkPushInteractableComp; // 0x440
	UInteractableComponent* DoorPushInteractableComp; // 0x448
	UInteractableComponent* DoorKickInteractableComp; // 0x450
	UInteractableComponent* DoorSublinkKickInteractableComp; // 0x458
	UInteractableComponent* LockpickInteractableComponent; // 0x460
	UInteractableComponent* C2InteractableComponent; // 0x468
	UInteractableComponent* WedgeInteractableComponent; // 0x470
	UInteractableComponent* OptiwandInteractableComponent; // 0x478
	UInteractableComponent* BSGInteractableComponent; // 0x480
	UInteractableComponent* BSGInteractableComponent_3; // 0x488
	UInteractableComponent* DoorRamInteractableComponent; // 0x490
	UFMODAudioPropagationComponent* FMODAudioPropagationComp; // 0x498
	ANavLinkProxy* NavLinkProxy; // 0x4a0
	USceneComponent* LockpickArea; // 0x4a8
	USceneComponent* DoorArea; // 0x4b0
	USceneComponent* C2Area; // 0x4b8
	USceneComponent* BSGArea; // 0x4c0
	USceneComponent* MirrorgunArea; // 0x4c8
	USceneComponent* WedgeArea; // 0x4d0
	USceneComponent* BatteringRamArea; // 0x4d8
	char bHasEverBeenOpenedBySwat : 1; // 0x4e0
	char bEnabled : 1; // 0x4e0
	FDataTableRowHandle TypeOfDoor; // 0x4e8
	FDataTableRowHandle TypeOfTrap; // 0x4f8
	ETrapSetup TrapSetup; // 0x508
	char bNoSpawnTrap : 1; // 0x509
	FName DoorName; // 0x50c
	char bOneWay : 1; // 0x514
	char bCanOpenFromOppositeSide : 1; // 0x514
	char bCanPlayerInteract : 1; // 0x514
	char bCanMirrorGun : 1; // 0x514
	TMap<EDoorDamageType, float> DoorKillDistance; // 0x518
	TMap<EDoorDamageType, float> DoorStunDistance; // 0x568
	float MaxOpenClose; // 0x5b8
	float OpenThreshold; // 0x5bc
	float CloseThreshold; // 0x5c0
	float IncrementAngle; // 0x5c4
	float MultitoolUseTime; // 0x5c8
	float GrenadeDamageToBreakDoor; // 0x5cc
	float MoveAndClearRequiredAmount; // 0x5d0
	float PhysicalPushAmount; // 0x5d4
	bool bCanIssueOrdersOnFrontSide; // 0x5d8
	bool bCanIssueOrdersOnBackSide; // 0x5d9
	FPingData PingData; // 0x5e0
	ADoor* DriveSubDoor; // 0x688
	ADoor* MatchOpenCloseDoor; // 0x690
	char bMainSubDoor : 1; // 0x698
	char bKickAlwaysFails : 1; // 0x698
	float DoorKickSuccessChance; // 0x69c
	int32_t NumSuccessfulKicksToBreakDown; // 0x6a0
	UMaterialInterface* C2ExplosionDecal; // 0x6a8
	bool bDisableStackUpOnFront; // 0x6b0
	bool bDisableStackUpOnBack; // 0x6b1
	float LockedChance; // 0x6b4
	UCurveFloat* DoorPushCurve; // 0x6b8
	UCurveFloat* DoorOpenCurve; // 0x6c0
	UCurveFloat* DoorCloseCurve; // 0x6c8
	UCurveFloat* DoorKickSuccessCurve; // 0x6d0
	UCurveFloat* DoorKickFailCurve; // 0x6d8
	UCurveFloat* DoorLockedCurve; // 0x6e0
	UCurveFloat* DoorRamCurve; // 0x6e8
	UCurveFloat* DoorExplodeCurve; // 0x6f0
	UCurveFloat* DoorBreachCurve; // 0x6f8
	UCurveFloat* DoorHandleOpenCurve; // 0x700
	UCurveFloat* DoorHandlePushCurve; // 0x708
	UCurveFloat* DoorHandleLockedCurve; // 0x710
	APlacedC2Explosive* PlacedC2; // 0x718
	TArray<UDestructibleDoorChunkComponent*> ChunkComponents; // 0x720
	char bPendingSubDoorKick : 1; // 0x730
	AReadyOrNotCharacter* LastDoorUser; // 0x738
	EDoorDamageType LastDoorDamage; // 0x740
	ATrapActorAttachedToDoor* AttachedTrap; // 0x748
	ADoorJam* AttachedWedge; // 0x750
	float OpenCloseAmount; // 0x758
	float DoorHandlePitchAmount; // 0x75c
	char bC2Placed : 1; // 0x760
	char bSWATKnowsLockState : 1; // 0x760
	char bSuspectKnowsLockState : 1; // 0x760
	char bSWATKnowsTrapState : 1; // 0x760
	char bSuspectKnowsTrapState : 1; // 0x760
	char Blocked : 1; // 0x760
	char bDoorBroken : 1; // 0x760
	char bTrapInFront : 1; // 0x760
	char bClientReset : 1; // 0x761
	char bDoorHandlesBroken : 1; // 0x761
	TArray<AReadyOrNotCharacter*> CharactersOverlappingDoor; // 0x1028
};

struct UW_SubObjective_Entry_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* div; // 0x268
	UBorder* ObjectiveNotice; // 0x270
	UW_Text_C* txt_Instruction; // 0x278
	UW_Text_C* txt_ObjState; // 0x280
	FST_SubObjective_Entry EntryData; // 0x288
	bool Complete; // 0x2a0
	bool Failed; // 0x2a1
	bool LastEntry; // 0x2a2
	bool bHideInstruction; // 0x2a3
	float CompletedIndent; // 0x2a4
	float CompletedTextOpacity; // 0x2a8
	FText ObjectiveDescription; // 0x2b0
	FLinearColor col_FontFailed; // 0x2c8
	FLinearColor col_FontNormal; // 0x2d8
	FLinearColor col_FontInProgress; // 0x2e8
	FLinearColor col_FontComplete; // 0x2f8
};

struct APrimary_BRN180_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
};

struct ACaptureTheFlagGS {
	ACTF_Flag* Flag; // 0x6c0
	APlayerCharacter* FlagBearer; // 0x6c8
	ETeamType FlagBearerTeam; // 0x6d0
	char bFlagCaptured : 1; // 0x6d1
	char bGameWon : 1; // 0x6d1
};

struct UCollectEvidenceActivity {
	AActor* EvidenceItem; // 0x1a8
};

struct ADatasmithImportedSequencesActor {
	TArray<ULevelSequence*> ImportedSequences; // 0x220
};

struct UW_CurrentMatchRound_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	UWidgetSwitcher* StyleSwitcher; // 0x290
	int32_t Style; // 0x298
};

struct UNavRelevantComponent {
	char bAttachToOwnersRoot : 1; // 0xd4
	UObject* CachedNavParent; // 0xd8
};

struct UBTDecorator_DoesPathExist {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct UDialogueVoice {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UChildConnection {
	UNetConnection* Parent; // 0x1ba8
};

struct UMovieScene3DAttachSection {
	FName AttachSocketName; // 0x118
	FName AttachComponentName; // 0x120
	EAttachmentRule AttachmentLocationRule; // 0x128
	EAttachmentRule AttachmentRotationRule; // 0x129
	EAttachmentRule AttachmentScaleRule; // 0x12a
	EDetachmentRule DetachmentLocationRule; // 0x12b
	EDetachmentRule DetachmentRotationRule; // 0x12c
	EDetachmentRule DetachmentScaleRule; // 0x12d
};

struct USourceEffectSimpleDelayPreset {
	FSourceEffectSimpleDelaySettings Settings; // 0xa8
};

struct UMovieSceneColorTrack {
	bool bIsSlateColor; // 0xc0
};

struct UW_LoadingScreen_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UWidgetAnimation* BlinkSpaceToContinue; // 0x2c0
	UImage* Image_1; // 0x2c8
	UTextBlock* Loading; // 0x2d0
	UTextBlock* Tips; // 0x2d8
	UW_PageHeader_C* W_PageHeader; // 0x2e0
	FString Out Map; // 0x2e8
	FString Out Mode; // 0x2f8
};

struct UMaterialExpressionLandscapeLayerSample {
	FName ParameterName; // 0x40
	float PreviewWeight; // 0x48
	FGuid ExpressionGUID; // 0x4c
};

struct UAnimNotify_PlayMontageNotifyWindow {
	FName NotifyName; // 0x30
};

struct USoundNodeDelay {
	float DelayMin; // 0x48
	float DelayMax; // 0x4c
};

struct UTcpMessagingSettings {
	bool EnableTransport; // 0x28
	FString ListenEndpoint; // 0x30
	TArray<FString> ConnectToEndpoints; // 0x40
	int32_t ConnectionRetryDelay; // 0x50
	bool bStopServiceWhenAppDeactivates; // 0x54
};

struct UMovieSceneSection {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UMovieSceneObjectPropertySection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe8
};

struct UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnPlay; // 0x260
	FMulticastInlineDelegate OnPlayReverse; // 0x270
	FMulticastInlineDelegate OnStop; // 0x280
	FMulticastInlineDelegate OnPause; // 0x290
	FMulticastInlineDelegate OnFinished; // 0x2a0
	EMovieScenePlayerStatus Status; // 0x2b0
	char bReversePlayback : 1; // 0x2b4
	UMovieSceneSequence* Sequence; // 0x2b8
	FFrameNumber StartTime; // 0x2c0
	int32_t DurationFrames; // 0x2c4
	float DurationSubFrames; // 0x2c8
	int32_t CurrentNumLoops; // 0x2cc
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x2d0
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x2e8
	FMovieSceneSequenceReplProperties NetSyncProps; // 0x438
	TScriptInterface<IMovieScenePlaybackClient> PlaybackClient; // 0x448
	UMovieSceneSequenceTickManager* TickManager; // 0x458
};

struct UW_ScoreboardHeader_C {
	UTextBlock* Arrested_Text; // 0x260
	UTextBlock* Arrests_Text; // 0x268
	UImage* BG_Image; // 0x270
	UTextBlock* BoardRank_Text; // 0x278
	UTextBlock* Damage_Text; // 0x280
	UTextBlock* Deaths_Text; // 0x288
	UTextBlock* Incapacitations_Text; // 0x290
	UTextBlock* Kills_Text; // 0x298
	UTextBlock* Ping_Text; // 0x2a0
	UTextBlock* PlayerName_Text; // 0x2a8
	UTextBlock* PlayerRank_Text; // 0x2b0
	UTextBlock* Score_Text; // 0x2b8
	UTextBlock* Status_Text; // 0x2c0
};

struct UANIMBP_Mirrorgun_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x350
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4d8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x518
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x598
	bool bEquipped; // 0x638
};

struct UInterpTrackEvent {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct APaperGroupedSpriteActor {
	UPaperGroupedSpriteComponent* RenderComponent; // 0x220
};

struct UInterpGroup {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct AChemlight {
	UAmmoComponent* Ammo; // 0x908
	FName SocketSpawnName; // 0x910
};

struct USoundNodeSoundClass {
	USoundClass* SoundClassOverride; // 0x48
};

struct UGizmoPlaneTranslationParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	FVector2D Parameter; // 0xb0
	FGizmoVec2ParameterChange LastChange; // 0xb8
	FVector CurTranslationOrigin; // 0xc8
	FVector CurTranslationNormal; // 0xd4
	FVector CurTranslationAxisX; // 0xe0
	FVector CurTranslationAxisY; // 0xec
	FTransform InitialTransform; // 0x100
};

struct UANIMBP_AK102_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x308
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x410
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x430
	FAnimNode_Slot AnimGraphNode_Slot; // 0x450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x498
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x518
	float Mag01Alpha; // 0x620
	bool bIsSemi; // 0x624
};

struct UW_BriefingBio_ProfileRight_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* BioDescription; // 0x268
	UTextBlock* BioText; // 0x270
	UImage* ProfilePicture; // 0x278
	UImage* ProfilePicture_2; // 0x280
	FText Bio; // 0x288
	FText Description; // 0x2a0
	UTexture2D* ProfileImage; // 0x2b8
};

struct UW_MatchEndScreen_TeamGame_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* FadeOutMVP; // 0x268
	UWidgetAnimation* FadeInMVP; // 0x270
	UWidgetAnimation* FadeInScoreboard; // 0x278
	UImage* Image_2; // 0x280
	UImage* Image_278; // 0x288
	URichTextBlock* MatchScoreCounter; // 0x290
	UTextBlock* MatchWinnerText; // 0x298
	UTextBlock* MVPPlayerName; // 0x2a0
	UTextBlock* NextMap; // 0x2a8
	UTextBlock* NextMode; // 0x2b0
	UTextBlock* RoundCounter; // 0x2b8
	UTextBlock* RoundWinnerText; // 0x2c0
	UVerticalBox* ScoreBoardDisplay; // 0x2c8
	UVerticalBox* SWATWinTeam; // 0x2d0
	UTextBlock* TextBlock_3; // 0x2d8
	UTextBlock* TextBlock_4; // 0x2e0
	UTextBlock* TextBlock_46; // 0x2e8
	UTextBlock* TextBlock_48; // 0x2f0
	UTextBlock* TextBlock_67; // 0x2f8
	UVerticalBox* VerticalBox_34; // 0x300
	UW_ScoreboardFill_C* W_ScoreboardFill; // 0x308
	bool SkippedMVP; // 0x310
	bool ToggleScoreboard; // 0x311
	TArray<AReadyOrNotGameMode*> ModeArray; // 0x318
	UObject* MainMenuRef; // 0x328
};

struct ASkyLight {
	USkyLightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct UDatasmithDecalComponentTemplate {
	int32_t SortOrder; // 0x30
	FVector DecalSize; // 0x34
	UMaterialInterface* Material; // 0x40
};

struct USynthKnob {
	float Value; // 0x108
	float StepSize; // 0x10c
	float MouseSpeed; // 0x110
	float MouseFineTuneSpeed; // 0x114
	char ShowTooltipInfo : 1; // 0x118
	FText ParameterName; // 0x120
	FText ParameterUnits; // 0x138
	FDelegate ValueDelegate; // 0x150
	FSynthKnobStyle WidgetStyle; // 0x160
	bool Locked; // 0x398
	bool IsFocusable; // 0x399
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x3a0
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x3b0
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x3c0
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x3d0
	FMulticastInlineDelegate OnValueChanged; // 0x3e0
};

struct UPhysicsConstraintTemplate {
	FConstraintInstance DefaultInstance; // 0x28
	TArray<FPhysicsConstraintProfileHandle> ProfileHandles; // 0x1f0
	FConstraintProfileProperties DefaultProfile; // 0x200
};

struct UPostProcessEffectData {
	UMaterial* PostProcess_Material; // 0x30
	TArray<FPostProcessSetting_FloatParam> ScalarParameters; // 0x38
	TArray<FPostProcessSetting_VectorParam> VectorParameters; // 0x48
	char bDebug : 1; // 0x58
	FText Note; // 0x60
};

struct UAISense_Team {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct UNiagaraPreviewAxis_InterpParamVector {
	FVector Min; // 0x38
	FVector Max; // 0x44
};

struct UNiagaraDataInterfaceVector4Curve {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
	FRichCurve WCurve; // 0x1f0
};

struct UMaterialExpressionComponentMask {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UEndpointSubmix {
	FName EndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	UAudioEndpointSettingsBase* EndpointSettings; // 0x48
};

struct UCameraAnim {
	UInterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	FBox BoundingBox; // 0x34
	char bRelativeToInitialTransform : 1; // 0x50
	char bRelativeToInitialFOV : 1; // 0x50
	float BaseFOV; // 0x54
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5c0
};

struct ULightComponent {
	float Temperature; // 0x228
	float MaxDrawDistance; // 0x22c
	float MaxDistanceFadeRange; // 0x230
	char bUseTemperature : 1; // 0x234
	int32_t ShadowMapChannel; // 0x238
	float MinRoughness; // 0x240
	float SpecularScale; // 0x244
	float ShadowResolutionScale; // 0x248
	float ShadowBias; // 0x24c
	float ShadowSlopeBias; // 0x250
	float ShadowSharpen; // 0x254
	float ContactShadowLength; // 0x258
	char ContactShadowLengthInWS : 1; // 0x25c
	char InverseSquaredFalloff : 1; // 0x25c
	char CastTranslucentShadows : 1; // 0x25c
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x25c
	char bAffectDynamicIndirectLighting : 1; // 0x25c
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x25c
	FLightingChannels LightingChannels; // 0x260
	UMaterialInterface* LightFunctionMaterial; // 0x268
	FVector LightFunctionScale; // 0x270
	UTextureLightProfile* IESTexture; // 0x280
	char bUseIESBrightness : 1; // 0x288
	float IESBrightnessScale; // 0x28c
	float LightFunctionFadeDistance; // 0x290
	float DisabledBrightness; // 0x294
	char bEnableLightShaftBloom : 1; // 0x298
	float BloomScale; // 0x29c
	float BloomThreshold; // 0x2a0
	float BloomMaxBrightness; // 0x2a4
	FColor BloomTint; // 0x2a8
	bool bUseRayTracedDistanceFieldShadows; // 0x2ac
	float RayStartOffsetDepthScale; // 0x2b0
};

struct UMaterialExpressionSobol {
	FExpressionInput Cell; // 0x40
	FExpressionInput Index; // 0x54
	FExpressionInput Seed; // 0x68
	uint32_t ConstIndex; // 0x7c
	FVector2D ConstSeed; // 0x80
};

struct UCOOPScorePopUp {
	UFMODEvent* Reward; // 0x260
};

struct UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UMaterialExpressionArccosineFast {
	FExpressionInput Input; // 0x40
};

struct AWindDirectionalSource {
	UWindDirectionalSourceComponent* Component; // 0x220
};

struct AIncriminationGS {
	FMulticastInlineDelegate OnIntelStateChanged; // 0x6c0
	FMulticastInlineDelegate OnIntelSearchAreaChosen; // 0x6d0
	FMulticastInlineDelegate OnIntelBuildingChosen; // 0x6e0
	FMulticastInlineDelegate OnActiveClueChanged; // 0x6f0
	FMulticastInlineDelegate OnPreviousActiveClueChanged; // 0x700
	FMulticastInlineDelegate OnCluesChanged; // 0x710
	AEvidenceSpawnPoint* ChosenEvidenceSpawn; // 0x720
	AEvidenceActor* ChosenEvidenceActor; // 0x728
	AEvidenceExtractionDevice_Incrim* ChosenExtractionDevice; // 0x730
	TArray<AIncriminationClue*> Clues; // 0x738
	TArray<AIncriminationClueSpawnPoint*> ClueSpawnPoints; // 0x748
	AIncriminationClue* ActiveClue; // 0x758
	AIncriminationClue* PreviousActiveClue; // 0x760
	ASplineTrigger_Incrimination* ChosenEvidenceSearchArea; // 0x768
	ABuildingTrigger_Incrimination* ChosenEvidenceBuilding; // 0x770
	TArray<ASplineTrigger_Incrimination*> NonMainIntelSearchZones; // 0x778
	AEvidenceExtractionDevice* CurrentExtractionDevice; // 0x788
	ETeamType PickupTeam; // 0x790
	EEvidenceActorState IntelState; // 0x791
	bool bIntelExtracted; // 0x792
};

struct UNiagaraDataInterfaceArrayColor {
	TArray<FLinearColor> ColorData; // 0x50
};

struct UNiagaraComponentSettings {
	TSet<FName> SuppressActivationList; // 0x28
	TSet<FName> ForceAutoPooolingList; // 0x78
	TSet<FNiagaraEmitterNameSettingsRef> SuppressEmitterList; // 0xc8
};

struct UW_DebugMenu_Tablet_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UW_DebugInfoContainer_C* DebugInfo_Player; // 0x268
};

struct AVIPPlayer_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2150
};

struct UDatasmithStaticMeshGLTFImportData {
	FString SourceMeshName; // 0x28
};

struct AScenarioGenerator {
	TMap<FString, FScenarioDataArray> ScenarioMap; // 0x258
	FString ScenarioName; // 0x2a8
	bool bSpawnWhenEntered; // 0x2b8
	AScenarioCoverActivator* CurrentScenarioCoverActivator; // 0x2c0
	EScenarioImportance ScenarioImportance; // 0x2c8
	TArray<ACoverActor*> ScenarioCover; // 0x2d0
	TArray<ACoverActor*> ScenarioSwatCover; // 0x2e0
	TArray<AThreatAwarenessActor*> ScenarioThreats; // 0x2f0
	TArray<AScenarioCoverActivator*> ScenarioCoverActivators; // 0x308
	TArray<AAICharacter*> SpawnedCharacters; // 0x318
};

struct UCameraShakeSourceComponent {
	ECameraShakeAttenuation Attenuation; // 0x1f8
	float InnerAttenuationRadius; // 0x1fc
	float OuterAttenuationRadius; // 0x200
	UCameraShakeBase* CameraShake; // 0x208
	bool bAutoStart; // 0x210
};

struct UScrollBarWidgetStyle {
	FScrollBarStyle ScrollBarStyle; // 0x30
};

struct UDestructibleDoorChunkComponent {
	bool bIsDoorHandle; // 0x4e0
	bool bIsHinge; // 0x4e1
	float Health; // 0x4e4
	bool bCannotKickIfDestroyed; // 0x4e8
	TArray<UDestructibleDoorChunkComponent*> SupportChunks; // 0x4f0
};

struct UMaterialExpressionSceneTexture {
	FExpressionInput Coordinates; // 0x40
	ESceneTextureId SceneTextureId; // 0x54
	bool bFiltered; // 0x55
};

struct ABP_TabletCapture_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x220
	USkeletalMeshComponent* SkeletalMesh; // 0x228
	USceneCaptureComponent2D* SceneCaptureComponent2D; // 0x230
	UW_TabletHUD_C* TabletHUD; // 0x238
};

struct APrimary_MP5A2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
};

struct UPathFollowingComponent {
	UNavMovementComponent* MovementComp; // 0xe8
	ANavigationData* MyNavData; // 0xf8
};

struct UNiagaraBakerSettings {
	float StartSeconds; // 0x28
	float DurationSeconds; // 0x2c
	int32_t FramesPerSecond; // 0x30
	char bPreviewLooping : 1; // 0x34
	FIntPoint FramesPerDimension; // 0x38
	TArray<FNiagaraBakerTextureSettings> OutputTextures; // 0x40
	ENiagaraBakerViewMode CameraViewportMode; // 0x50
	FVector CameraViewportLocation[0x7]; // 0x54
	FRotator CameraViewportRotation[0x7]; // 0xa8
	float CameraOrbitDistance; // 0xfc
	float CameraFOV; // 0x100
	float CameraOrthoWidth; // 0x104
	char bUseCameraAspectRatio : 1; // 0x108
	float CameraAspectRatio; // 0x10c
	char bRenderComponentOnly : 1; // 0x110
};

struct ADestructibleVehicle {
	UStaticMeshComponent* CarBody; // 0x220
	UStaticMeshComponent* FrontLeftDoor; // 0x228
	UStaticMeshComponent* FrontRightDoor; // 0x230
	UStaticMeshComponent* BackLeftDoor; // 0x238
	UStaticMeshComponent* BackRightDoor; // 0x240
	UDestructibleComponent* RearWindshield; // 0x248
	UDestructibleComponent* FrontWindshield; // 0x250
	UDestructibleComponent* RearSideWindowLeft; // 0x258
	UDestructibleComponent* RearSideWindowRight; // 0x260
	UDestructibleComponent* RearDoorWindowLeft; // 0x268
	UDestructibleComponent* RearDoorWindowRight; // 0x270
	UDestructibleComponent* FrontDoorWindowLeft; // 0x278
	UDestructibleComponent* FrontDoorWindowRight; // 0x280
	UStaticMeshComponent* Boot; // 0x288
	UStaticMeshComponent* RearVisionMirror; // 0x290
	UStaticMeshComponent* AirBag; // 0x298
	UStaticMeshComponent* LeftSideMirror; // 0x2a0
	UStaticMeshComponent* RightSideMirror; // 0x2a8
	UStaticMeshComponent* FrontLeftTyre; // 0x2b0
	UStaticMeshComponent* FrontRightTyre; // 0x2b8
	UStaticMeshComponent* RearLeftTyre; // 0x2c0
	UStaticMeshComponent* RearRightTyre; // 0x2c8
	USphereComponent* LeftLightCollision; // 0x2d0
	USphereComponent* RightLightCollision; // 0x2d8
	USpotLightComponent* LeftHeadLight; // 0x2e0
	USpotLightComponent* RightHeadLight; // 0x2e8
	UAudioComponent* CarAlarmAudio; // 0x2f0
	bool bLightsOn; // 0x2fa
	float AlarmHeadLightsFlashInterval; // 0x2fc
	UMaterialInstance* FrontLightsOnMaterial; // 0x300
	int32_t FrontLeftLightsMaterialIndex; // 0x308
	int32_t FrontRightLightsMaterialIndex; // 0x30c
	UMaterialInstance* RearLightsOnMaterial; // 0x310
	UMaterialInstance* FrontLightsOffMaterial; // 0x318
	UMaterialInstance* RearLightsOffMaterial; // 0x320
	int32_t RearLeftLightsMaterialIndex; // 0x328
	int32_t RearRightLightsMaterialIndex; // 0x32c
	float RollAmountOnTyreDamage; // 0x330
	float PitchAmountOnTyreDamage; // 0x334
	float SinkAmountOnTyreDamage; // 0x338
	FRotator AppliedRotation; // 0x354
	bool bFrontLeftTyreDestroyed; // 0x360
	bool bFrontRightTyreDestroyed; // 0x361
	bool bRearLeftTyreDestroyed; // 0x362
	bool bRearRightTyreDestroyed; // 0x363
	bool bForceLightsOn; // 0x364
	bool bLeftLightDestroyed; // 0x365
	bool bRightLightDestroyed; // 0x366
	float FrontLeftDoorOpenAmount; // 0x368
	float FrontRightDoorOpenAmount; // 0x36c
	float BackLeftDoorOpenAmount; // 0x370
	float BackRightDoorOpenAmount; // 0x374
	float BootOpenAmount; // 0x378
	float PlayerRotationMultiplier; // 0x37c
	float ChanceToCauseAirbagToDeployOnDamage; // 0x380
	USoundCue* AirbagDeploySound; // 0x388
	float ChanceToCauseAlarmOnDamage; // 0x390
	float AlarmPlayLength; // 0x394
	float BootMaxOpen; // 0x398
	float LeftDoorMaxOpen; // 0x39c
	float RightDoorMaxOpen; // 0x3a0
	TArray<UMaterialInstance*> RandomShatteredGlassMaterial; // 0x3a8
	FMulticastInlineDelegate OnApplyDamageToWindow; // 0x3b8
};

struct UGlasses_Widget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UInvalidationBox* InvalidationBox_1; // 0x268
	bool bBreathIn; // 0x270
};

struct UGeometryCollectionComponent {
	AChaosSolverActor* ChaosSolverActor; // 0x480
	UGeometryCollection* RestCollection; // 0x568
	TArray<AFieldSystemActor*> InitializationFields; // 0x570
	bool Simulating; // 0x580
	EObjectStateTypeEnum ObjectType; // 0x588
	bool EnableClustering; // 0x589
	int32_t ClusterGroupIndex; // 0x58c
	int32_t MaxClusterLevel; // 0x590
	TArray<float> DamageThreshold; // 0x598
	EClusterConnectionTypeEnum ClusterConnectionType; // 0x5a8
	int32_t CollisionGroup; // 0x5ac
	float CollisionSampleFraction; // 0x5b0
	float LinearEtherDrag; // 0x5b4
	float AngularEtherDrag; // 0x5b8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0x5c0
	EInitialVelocityTypeEnum InitialVelocityType; // 0x5c8
	FVector InitialLinearVelocity; // 0x5cc
	FVector InitialAngularVelocity; // 0x5d8
	UPhysicalMaterial* PhysicalMaterialOverride; // 0x5e8
	FGeomComponentCacheParameters CacheParameters; // 0x5f0
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsStateChange; // 0x640
	FMulticastInlineDelegate NotifyGeometryCollectionPhysicsLoadingStateChange; // 0x650
	FMulticastInlineDelegate OnChaosBreakEvent; // 0x678
	float DesiredCacheTime; // 0x688
	bool CachePlayback; // 0x68c
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x690
	bool bNotifyBreaks; // 0x6a0
	bool bNotifyCollisions; // 0x6a1
	bool bEnableReplication; // 0x6a2
	bool bEnableAbandonAfterLevel; // 0x6a3
	int32_t ReplicationAbandonClusterLevel; // 0x6a4
	FGeometryCollectionRepData RepData; // 0x6a8
	UBodySetup* DummyBodySetup; // 0x8d8
};

struct AEvidenceSpawnPoint {
	AEvidenceActor* EvidenceActorClass; // 0x238
	ASplineTrigger_Incrimination* EvidenceSearchArea; // 0x240
	ABuildingTrigger_Incrimination* EvidenceBuilding; // 0x248
};

struct UW_LoadoutItem_Preset_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UImage* BG_Image; // 0x280
	UW_StandardButton_C* Button; // 0x288
	UW_Text_C* lbl_CannotEdit; // 0x290
	UEditableText* LoadoutItemPresetNameEdit_Text; // 0x298
	USizeBox* RadioIcon_SizeBox; // 0x2a0
	UW_StandardButton_C* ResetButton; // 0x2a8
	UImage* SelectedRadioIcon_Image; // 0x2b0
	UWidgetSwitcher* TextSwitcher; // 0x2b8
	UW_Text_C* txt_PresetName; // 0x2c0
	UImage* UnselectedRadioIcon_Image; // 0x2c8
	FText OriginalPresetName; // 0x2d0
	FLinearColor DefaultColor; // 0x2e8
	FMulticastInlineDelegate OnButtonClicked; // 0x2f8
	bool bIsDefault; // 0x308
	FText PresetName; // 0x310
	bool bSelected; // 0x328
	bool bHovered; // 0x329
	bool bAnyKeyDown; // 0x32a
	bool bResetButtonHovered; // 0x32b
	UW_LoadoutItem_Presets_C* Owner; // 0x330
	FMulticastInlineDelegate OnButtonHovered; // 0x338
	FMulticastInlineDelegate OnButtonUnhovered; // 0x348
	int32_t Index; // 0x358
	int32_t MinPresetNameCharacters; // 0x35c
	int32_t MaxPresetNameCharacters_WithoutSpaces; // 0x360
	int32_t MaxPresetNameCharacters_WithSpaces; // 0x364
	TArray<FString> ItemPresetNameAsStringArray; // 0x368
	FTimerHandle TH_FocusOnEditableText; // 0x378
	UWeaponAttachment* ScopeAttachmentClass; // 0x380
	UWeaponAttachment* MuzzleAttachmentClass; // 0x388
	UWeaponAttachment* UnderbarrelAttachmentClass; // 0x390
	UWeaponAttachment* OverbarrelAttachmentClass; // 0x398
	UWeaponAttachment* StockAttachmentClass; // 0x3a0
	UWeaponAttachment* GripAttachmentClass; // 0x3a8
	UWeaponAttachment* IlluminatorAttachmentClass; // 0x3b0
	UWeaponAttachment* AmmunitionAttachmentClass; // 0x3b8
	USkinComponent* SkinClass; // 0x3c0
	USkinComponent* FactorySkinClass; // 0x3c8
};

struct UAnimSingleNodeInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UAISense_Damage {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x80
};

struct UMovieSceneGeometryCacheTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x98
};

struct AGS_TugOfWar_C {
	USceneComponent* DefaultSceneRoot; // 0x6c8
};

struct UAnimInstance {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct AGM_Lobby_C {
	USceneComponent* DefaultSceneRoot; // 0x688
};

struct UParticleModuleVectorFieldLocal {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UPaperTileSet {
	FIntPoint TileSize; // 0x28
	UTexture2D* TileSheet; // 0x30
	TArray<UTexture*> AdditionalSourceTextures; // 0x38
	FIntMargin BorderMargin; // 0x48
	FIntPoint PerTileSpacing; // 0x58
	FIntPoint DrawingOffset; // 0x60
	int32_t WidthInTiles; // 0x68
	int32_t HeightInTiles; // 0x6c
	int32_t AllocatedWidth; // 0x70
	int32_t AllocatedHeight; // 0x74
	TArray<FPaperTileMetadata> PerTileData; // 0x78
	TArray<FPaperTileSetTerrain> Terrains; // 0x88
	int32_t TileWidth; // 0x98
	int32_t TileHeight; // 0x9c
	int32_t Margin; // 0xa0
	int32_t Spacing; // 0xa4
};

struct UJoinSessionCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AWorldSettings {
	int32_t VisibilityCellSize; // 0x228
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x22c
	char bPrecomputeVisibility : 1; // 0x22d
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x22d
	char bEnableWorldBoundsChecks : 1; // 0x22d
	char bEnableNavigationSystem : 1; // 0x22d
	char bEnableAISystem : 1; // 0x22d
	char bEnableWorldComposition : 1; // 0x22d
	char bUseClientSideLevelStreamingVolumes : 1; // 0x22d
	char bEnableWorldOriginRebasing : 1; // 0x22d
	char bWorldGravitySet : 1; // 0x22e
	char bGlobalGravitySet : 1; // 0x22e
	char bMinimizeBSPSections : 1; // 0x22e
	char bForceNoPrecomputedLighting : 1; // 0x22e
	char bHighPriorityLoading : 1; // 0x22e
	char bHighPriorityLoadingLocal : 1; // 0x22e
	char bOverrideDefaultBroadphaseSettings : 1; // 0x22e
	UNavigationSystemConfig* NavigationSystemConfig; // 0x230
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x238
	float WorldToMeters; // 0x240
	float KillZ; // 0x244
	UDamageType* KillZDamageType; // 0x248
	float WorldGravityZ; // 0x250
	float GlobalGravityZ; // 0x254
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x258
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x260
	AGameModeBase* DefaultGameMode; // 0x268
	AGameNetworkManager* GameNetworkManagerClass; // 0x270
	int32_t PackedLightAndShadowMapTextureSize; // 0x278
	FVector DefaultColorScale; // 0x27c
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x288
	float GlobalDistanceFieldViewDistance; // 0x28c
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x290
	FReverbSettings DefaultReverbSettings; // 0x298
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2b8
	USoundMix* DefaultBaseSoundMix; // 0x2e0
	float TimeDilation; // 0x2e8
	float MatineeTimeDilation; // 0x2ec
	float DemoPlayTimeDilation; // 0x2f0
	float MinGlobalTimeDilation; // 0x2f4
	float MaxGlobalTimeDilation; // 0x2f8
	float MinUndilatedFrameTime; // 0x2fc
	float MaxUndilatedFrameTime; // 0x300
	FBroadphaseSettings BroadphaseSettings; // 0x304
	APlayerState* Pauser; // 0x348
	TArray<FNetViewer> ReplicationViewers; // 0x350
	TArray<UAssetUserData*> AssetUserData; // 0x360
	APlayerState* PauserPlayerState; // 0x370
	int32_t MaxNumberOfBookmarks; // 0x378
	UBookmarkBase* DefaultBookmarkClass; // 0x380
	TArray<UBookmarkBase*> BookmarkArray; // 0x388
	UBookmarkBase* LastBookmarkClass; // 0x398
};

struct UNiagaraSystem {
	bool bDumpDebugSystemInfo; // 0x30
	bool bDumpDebugEmitterInfo; // 0x31
	bool bRequireCurrentFrameData; // 0x33
	char bFixedBounds : 1; // 0x34
	UNiagaraEffectType* EffectType; // 0x38
	bool bOverrideScalabilitySettings; // 0x40
	TArray<FNiagaraSystemScalabilityOverride> ScalabilityOverrides; // 0x48
	FNiagaraSystemScalabilityOverrides SystemScalabilityOverrides; // 0x58
	TArray<FNiagaraEmitterHandle> EmitterHandles; // 0x68
	TArray<UNiagaraParameterCollectionInstance*> ParameterCollectionOverrides; // 0x78
	UNiagaraScript* SystemSpawnScript; // 0x88
	UNiagaraScript* SystemUpdateScript; // 0x90
	FNiagaraSystemCompiledData SystemCompiledData; // 0xa8
	FNiagaraUserRedirectionParameterStore ExposedParameters; // 0x2c0
	FBox FixedBounds; // 0x388
	bool bAutoDeactivate; // 0x3a4
	float WarmupTime; // 0x3a8
	int32_t WarmupTickCount; // 0x3ac
	float WarmupTickDelta; // 0x3b0
	bool bHasSystemScriptDIsWithPerInstanceData; // 0x3b4
	bool bNeedsGPUContextInitForDataInterfaces; // 0x3b5
	TArray<FName> UserDINamesReadInSystemScripts; // 0x3b8
};

struct ATriggerBase {
	UShapeComponent* CollisionComponent; // 0x220
};

struct UIssueCommandQuestNode {
	ESwatCommand SwatCommand; // 0x270
	ETeamType TeamType; // 0x271
	bool bHasIssueCommand; // 0x272
};

struct ACaptureTheFlagGM {
	FMulticastInlineDelegate OnFlagCaptured; // 0x6d8
	FMulticastInlineDelegate OnFlagDropped; // 0x6e8
	ACTF_Flag* FlagClassToSpawn; // 0x6f8
};

struct UHumanCharacterHUD {
	FVector2D LastImpulse; // 0x278
};

struct UW_MapFloor_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Floor_Text; // 0x268
	UImage* Selected_Image; // 0x270
	FText FloorText; // 0x278
};

struct UGameMapsSettings {
	FString LocalMapOptions; // 0x28
	FSoftObjectPath TransitionMap; // 0x38
	bool bUseSplitscreen; // 0x50
	ETwoPlayerSplitScreenType TwoPlayerSplitscreenLayout; // 0x51
	EThreePlayerSplitScreenType ThreePlayerSplitscreenLayout; // 0x52
	EFourPlayerSplitScreenType FourPlayerSplitscreenLayout; // 0x53
	bool bOffsetPlayerGamepadIds; // 0x54
	FSoftClassPath GameInstanceClass; // 0x58
	FSoftObjectPath GameDefaultMap; // 0x70
	FSoftObjectPath ServerDefaultMap; // 0x88
	FSoftClassPath GlobalDefaultGameMode; // 0xa0
	FSoftClassPath GlobalDefaultServerGameMode; // 0xb8
	TArray<FGameModeName> GameModeMapPrefixes; // 0xd0
	TArray<FGameModeName> GameModeClassAliases; // 0xe0
};

struct UGraphNodeContextMenuContext {
	UBlueprint* Blueprint; // 0x28
	UEdGraph* Graph; // 0x30
	UEdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48
};

struct UMockDataMeshTrackerComponent {
	FMulticastInlineDelegate OnMeshTrackerUpdated; // 0x1f8
	bool ScanWorld; // 0x208
	bool RequestNormals; // 0x209
	bool RequestVertexConfidence; // 0x20a
	EMeshTrackerVertexColorMode VertexColorMode; // 0x20b
	TArray<FColor> BlockVertexColors; // 0x210
	FLinearColor VertexColorFromConfidenceZero; // 0x220
	FLinearColor VertexColorFromConfidenceOne; // 0x230
	float UpdateInterval; // 0x240
	UMRMeshComponent* MRMesh; // 0x248
};

struct UANIMBP_P99_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x308
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x328
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x430
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x450
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x498
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x538
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x690
	FAnimNode_Slot AnimGraphNode_Slot; // 0x750
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x798
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x7e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x868
	float Mag01Alpha; // 0x8e8
};

struct UMaterialInterface {
	USubsurfaceProfile* SubsurfaceProfile; // 0x38
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x50
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x70
};

struct UW_2DMap_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* img_Map; // 0x268
	UMaterialInstanceDynamic* MapDynMat; // 0x270
};

struct UForceFeedbackEffect {
	TArray<FForceFeedbackChannelDetails> ChannelDetails; // 0x28
	float Duration; // 0x38
};

struct UParticleModuleEventReceiverBase {
	EParticleEventType EventGeneratorType; // 0x30
	FName EventName; // 0x34
};

struct AWorldBuildingPlacementActor {
	USceneComponent* DefaultScene; // 0x220
	UWorldBuildingActivity* Activity; // 0x228
	bool bDropGunBeforeActivity; // 0x230
	bool bReturnToOriginalSpot; // 0x231
	AAISpawn* LinkedToSpawner; // 0x238
	ACyberneticController* InUseByController; // 0x240
};

struct UBlackboardKeyType_Object {
	UObject* BaseClass; // 0x30
};

struct UStreamingSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UNiagaraDataInterfaceArrayFloat2 {
	TArray<FVector2D> FloatData; // 0x50
};

struct UW_MagCheckOverview_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_OnMagCheck; // 0x268
	UHorizontalBox* Mags_Container; // 0x270
	TArray<UW_MagCheck_MagStatus_C*> MagCheckStatusWidgets; // 0x278
};

struct UMedicalHealWidget {
	float CurrentHealth; // 0x278
	FString PrefixHealerString; // 0x280
	FString PostfixHealeeString; // 0x290
	FString PostfixHealeeMortallyWoundedString; // 0x2a0
	FString PostfixNoBrokenLimbsString; // 0x2b0
	FName HealerName; // 0x2c0
	FName HealeeName; // 0x2c8
	float MinHealth; // 0x2d0
	float MaxHealth; // 0x2d4
	UWidgetSwitcher* HealingWidgetSwitcher; // 0x2d8
	UProgressBar* HealingProgressBar_Healer; // 0x2e0
	UProgressBar* HealingProgressBar_Healee; // 0x2e8
	UTextBlock* HealerText; // 0x2f0
	UTextBlock* HealeeText; // 0x2f8
	UTextBlock* HealeeMortallyWoundedText; // 0x300
	UTextBlock* HealeeNoBrokenLimbsText; // 0x308
	UTextBlock* HealerHealthValueText; // 0x310
	UTextBlock* HealeeHealthValueText; // 0x318
	UTextBlock* HealeeMortallyWoundedHealthValueText; // 0x320
	UWidgetAnimation* FadeIn; // 0x328
	UWidgetAnimation* FadeOut; // 0x330
	UWidgetAnimation* HealComplete; // 0x338
};

struct UEnvQueryGenerator_ActorsOfClass {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct UCursor_Pen_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetSwitcher* Cursor_Switcher; // 0x268
	UImage* Image_8; // 0x270
	UImage* Mouse; // 0x278
	UOverlay* MouseOverlay; // 0x280
	UWidgetSwitcher* PenColorSwitcher; // 0x288
};

struct UParticleModuleAccelerationDragScaleOverLife {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct ACameraActor {
	EAutoReceiveInput AutoActivateForPlayer; // 0x220
	UCameraComponent* CameraComponent; // 0x228
	USceneComponent* SceneComponent; // 0x230
	char bConstrainAspectRatio : 1; // 0x240
	float AspectRatio; // 0x244
	float FOVAngle; // 0x248
	float PostProcessBlendWeight; // 0x24c
	FPostProcessSettings PostProcessSettings; // 0x250
};

struct ABaseArmour {
	UMaterialInstance* LastSetMeshGearSlotMaterial; // 0x948
	EArmourType ArmourType; // 0x950
	TArray<float> FrontPlateWeights; // 0x958
	TArray<float> BackPlateWeights; // 0x968
	TArray<float> SidePlateWeights; // 0x978
	int32_t BlockHeadshotCount; // 0x988
	bool bUnlockMoreSlots; // 0x98c
	bool bHalfStingerDuration; // 0x98d
	float ScaleLensFlare; // 0x990
	TArray<USkeletalMesh*> Variations; // 0x998
	UParticleSystem* ArmourHitParticle; // 0x9a8
	UFMODEvent* ArmourHitSound; // 0x9b0
	UTexture2D* PaperdollTexture; // 0x9b8
	UMatineeCameraShake* InterceptShakeFront; // 0x9c0
	UMatineeCameraShake* InterceptShakeBack; // 0x9c8
	UMatineeCameraShake* InterceptShakeLeft; // 0x9d0
	UMatineeCameraShake* InterceptShakeRight; // 0x9d8
	bool bDebugArmorHitDebug; // 0x9e0
	bool bUseLightbar; // 0x9e1
	FLinearColor LeaderLightbarColour; // 0x9e4
	FLinearColor RedTeamLightbarColour; // 0x9f4
	FLinearColor BlueTeamLightbarColour; // 0xa04
	float LightbarIntensity; // 0xa14
	UArmourResourceComponent* ArmourHealth; // 0xa18
	EArmourCoverage SpawnedCoverageLevel; // 0xa20
	EArmourLevel SpawnedArmourLevel; // 0xa21
	USkeletalMesh* LastGeneratedMaterialsOnSkelMesh; // 0xa28
};

struct UInterpTrackInstVisibility {
	EVisibilityTrackAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
};

struct AHighgroundVolume {
	float AudioDebounce; // 0x228
	UBoxComponent* Bounds; // 0x230
	UAudioComponent* AudioComp; // 0x238
	bool bWatching; // 0x240
	int32_t SierraDesignation; // 0x244
	FName VolumeLabel; // 0x248
	TArray<USoundBase*> ContactEnteredVolumeAudio; // 0x250
	TArray<USoundBase*> ContactExitedVolumeAudio; // 0x260
	TArray<USoundBase*> SwatEnteredVolumeAudio; // 0x270
	TArray<USoundBase*> SwatExitedVolumeAudio; // 0x280
};

struct UAnimNotify_ChangeCombatMove {
	TArray<UBaseCombatMoveActivity*> PossibleCombatMoves; // 0x38
};

struct UBoundsCopyComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UDatasmithStaticMeshTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UParticleModuleAttractorParticle {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct UTeamActivityProxy {
	ETeamType CommandTeam; // 0x38
	FVector CommandLocation; // 0x3c
};

struct UAudioComponent {
	USoundBase* Sound; // 0x1f8
	TArray<FAudioComponentParam> InstanceParameters; // 0x200
	USoundClass* SoundClassOverride; // 0x210
	char bAutoDestroy : 1; // 0x218
	char bStopWhenOwnerDestroyed : 1; // 0x218
	char bShouldRemainActiveIfDropped : 1; // 0x218
	char bAllowSpatialization : 1; // 0x218
	char bOverrideAttenuation : 1; // 0x218
	char bOverrideSubtitlePriority : 1; // 0x218
	char bIsUISound : 1; // 0x218
	char bEnableLowPassFilter : 1; // 0x218
	char bOverridePriority : 1; // 0x219
	char bSuppressSubtitles : 1; // 0x219
	char bAutoManageAttachment : 1; // 0x21a
	FName AudioComponentUserID; // 0x220
	float PitchModulationMin; // 0x228
	float PitchModulationMax; // 0x22c
	float VolumeModulationMin; // 0x230
	float VolumeModulationMax; // 0x234
	float VolumeMultiplier; // 0x238
	int32_t EnvelopeFollowerAttackTime; // 0x23c
	int32_t EnvelopeFollowerReleaseTime; // 0x240
	float Priority; // 0x244
	float SubtitlePriority; // 0x248
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x250
	float PitchMultiplier; // 0x258
	float LowPassFilterFrequency; // 0x25c
	USoundAttenuation* AttenuationSettings; // 0x268
	FSoundAttenuationSettings AttenuationOverrides; // 0x270
	USoundConcurrency* ConcurrencySettings; // 0x610
	TSet<USoundConcurrency*> ConcurrencySet; // 0x618
	EAttachmentRule AutoAttachLocationRule; // 0x674
	EAttachmentRule AutoAttachRotationRule; // 0x675
	EAttachmentRule AutoAttachScaleRule; // 0x676
	FSoundModulationDefaultRoutingSettings ModulationRouting; // 0x678
	FMulticastInlineDelegate OnAudioPlayStateChanged; // 0x6c0
	FMulticastInlineDelegate OnAudioVirtualizationChanged; // 0x6e8
	FMulticastInlineDelegate OnAudioFinished; // 0x710
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x738
	FMulticastInlineDelegate OnAudioSingleEnvelopeValue; // 0x760
	FMulticastInlineDelegate OnAudioMultiEnvelopeValue; // 0x788
	FDelegate OnQueueSubtitles; // 0x7b0
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x7c0
	FName AutoAttachSocketName; // 0x7c8
};

struct UParticleModuleOrbitBase {
	char bUseEmitterTime : 1; // 0x30
};

struct UBTDecorator_ConeCheck {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector ConeDirection; // 0x98
	FBlackboardKeySelector Observed; // 0xc0
};

struct UFriendsList {
	FMulticastInlineDelegate OnSuccess; // 0x260
	FMulticastInlineDelegate OnFailure; // 0x270
	TArray<FFriend> FriendsList; // 0x280
};

struct UNiagaraDataInterfaceTexture {
	UTexture* Texture; // 0x38
};

struct UAndroidPermissionCallbackProxy {
	FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate; // 0x28
};

struct UMovieSceneGeometryCollectionSection {
	FMovieSceneGeometryCollectionParams Params; // 0xe8
};

struct UImgMediaSettings {
	FFrameRate DefaultFrameRate; // 0x28
	float CacheBehindPercentage; // 0x30
	float CacheSizeGB; // 0x34
	int32_t CacheThreads; // 0x38
	int32_t CacheThreadStackSizeKB; // 0x3c
	float GlobalCacheSizeGB; // 0x40
	bool UseGlobalCache; // 0x44
	uint32_t ExrDecoderThreads; // 0x48
	FString DefaultProxy; // 0x50
	bool UseDefaultProxy; // 0x60
};

struct UParticleLODLevel {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UAnimNotify_DisarmTrap {
	char bDisarmFinished : 1; // 0x38
};

struct ULightPropagationVolumeBlendable {
	FLightPropagationVolumeSettings Settings; // 0x30
	float BlendWeight; // 0x70
};

struct UANIMBP_UMP45_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x308
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x350
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x470
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x4f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x648
	FAnimNode_Slot AnimGraphNode_Slot; // 0x708
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x750
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x778
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x7a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x7c0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x8c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x8e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x998
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0xa58
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xb60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xb80
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xc00
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xc20
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xd28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xd48
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xdc8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xde8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xef0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xf10
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xf90
	float Mag01Alpha; // 0xfb0
	char CurrentFireMode; // 0xfb4
	bool bIsSemi; // 0xfb5
	float FoldedStockAlpha; // 0xfb8
};

struct UMaterialExpressionDepthOfFieldFunction {
	EDepthOfFieldFunctionValue FunctionValue; // 0x40
	FExpressionInput Depth; // 0x44
};

struct UNiagaraDataInterfaceStaticMesh {
	ENDIStaticMesh_SourceMode SourceMode; // 0x38
	UStaticMesh* DefaultMesh; // 0x40
	AActor* Source; // 0x48
	UStaticMeshComponent* SourceComponent; // 0x50
	FNDIStaticMeshSectionFilter SectionFilter; // 0x58
	bool bUsePhysicsBodyVelocity; // 0x68
	TArray<FName> FilteredSockets; // 0x70
};

struct UFindSessionsCallbackProxy {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UQuartzClockHandle {
	UQuartzSubsystem* QuartzSubsystem; // 0x168
	UWorld* WorldPtr; // 0x188
};

struct USkeletalMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x6a0
	UAnimInstance* AnimClass; // 0x6a8
	UAnimInstance* AnimScriptInstance; // 0x6b0
	UAnimInstance* PostProcessAnimInstance; // 0x6b8
	FSingleAnimationPlayData AnimationData; // 0x6c0
	FVector RootBoneTranslation; // 0x6e8
	FVector LineCheckBoundsScale; // 0x6f4
	TArray<UAnimInstance*> LinkedInstances; // 0x730
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x740
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x750
	float GlobalAnimRateScale; // 0x8b0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8b4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8b5
	EAnimationMode AnimationMode; // 0x8b7
	char bDisablePostProcessBlueprint : 1; // 0x8b9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8b9
	char bHasValidBodies : 1; // 0x8b9
	char bBlendPhysics : 1; // 0x8b9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8b9
	char bUpdateJointsFromAnimation : 1; // 0x8b9
	char bDisableClothSimulation : 1; // 0x8ba
	char bDisableRigidBodyAnimNode : 1; // 0x8c0
	char bAllowAnimCurveEvaluation : 1; // 0x8c0
	char bDisableAnimCurves : 1; // 0x8c0
	char bCollideWithEnvironment : 1; // 0x8c0
	char bCollideWithAttachedChildren : 1; // 0x8c1
	char bLocalSpaceSimulation : 1; // 0x8c1
	char bResetAfterTeleport : 1; // 0x8c1
	char bDeferKinematicBoneUpdate : 1; // 0x8c1
	char bNoSkeletonUpdate : 1; // 0x8c1
	char bPauseAnims : 1; // 0x8c1
	char bUseRefPoseOnInitAnim : 1; // 0x8c1
	char bEnablePerPolyCollision : 1; // 0x8c2
	char bForceRefpose : 1; // 0x8c2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8c2
	char bIsAutonomousTickPose : 1; // 0x8c2
	char bOldForceRefPose : 1; // 0x8c2
	char bShowPrePhysBones : 1; // 0x8c2
	char bRequiredBonesUpToDate : 1; // 0x8c2
	char bAnimTreeInitialised : 1; // 0x8c2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8c3
	char bEnableLineCheckWithBounds : 1; // 0x8c3
	char bPropagateCurvesToSlaves : 1; // 0x8c3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8c3
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8c3
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8c3
	uint16_t CachedAnimCurveUidVersion; // 0x8c6
	float ClothBlendWeight; // 0x8c8
	bool bWaitForParallelClothTask; // 0x8cc
	TArray<FName> DisallowedAnimCurves; // 0x8d0
	UBodySetup* BodySetup; // 0x8e0
	FMulticastInlineDelegate OnConstraintBroken; // 0x8f0
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x900
	float TeleportDistanceThreshold; // 0x9d8
	float TeleportRotationThreshold; // 0x9dc
	uint32_t LastPoseTickFrame; // 0x9e8
	UClothingSimulationInteractor* ClothingInteractor; // 0xa40
	FMulticastInlineDelegate OnAnimInitialized; // 0xb10
};

struct UMaterialExpressionMin {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct AARSharedWorldGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct ANavModifierVolume {
	UNavArea* AreaClass; // 0x260
	bool bMaskFillCollisionUnderneathForNavmesh; // 0x268
};

struct UPostProcessComponent {
	FPostProcessSettings Settings; // 0x200
	float Priority; // 0x760
	float BlendRadius; // 0x764
	float BlendWeight; // 0x768
	char bEnabled : 1; // 0x76c
	char bUnbound : 1; // 0x76c
};

struct UAnimationSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct USoundNodeDistanceCrossFade {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct UPlanningMapWidget {
	bool bDrawable; // 0x260
	TArray<FFloorMapPointData> DrawPointData; // 0x268
};

struct UMaterialExpressionStaticBoolParameter {
	char DefaultValue : 1; // 0x58
};

struct UARPin {
	UARTrackedGeometry* TrackedGeometry; // 0x28
	USceneComponent* PinnedComponent; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	FMulticastInlineDelegate OnARTrackingStateChanged; // 0xc0
	FMulticastInlineDelegate OnARTransformUpdated; // 0xd0
};

struct UMaterialExpressionVertexInterpolator {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionReflectionVectorWS {
	FExpressionInput CustomWorldNormal; // 0x40
	char bNormalizeCustomWorldNormal : 1; // 0x54
};

struct UBTDecorator_Loop {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UClothingAssetBase {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct UCoverPoint {
	FVector Location; // 0x28
	FVector _DirectionToWall; // 0x34
	FRotator RotatorXToWall; // 0x40
	bool bLeftCoverStanding; // 0x4c
	bool bRightCoverStanding; // 0x4d
	bool bLeftCoverCrouched; // 0x4e
	bool bRightCoverCrouched; // 0x4f
	bool bFrontCoverCrouched; // 0x50
	bool bCrouchedCover; // 0x51
};

struct UChildActorComponent {
	AActor* ChildActorClass; // 0x1f8
	AActor* ChildActor; // 0x200
	AActor* ChildActorTemplate; // 0x208
};

struct UNiagaraDataInterfaceIntRenderTarget2D {
	FIntPoint Size; // 0xd8
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe0
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x100
};

struct UBorder {
	EHorizontalAlignment HorizontalAlignment; // 0x120
	EVerticalAlignment VerticalAlignment; // 0x121
	char bShowEffectWhenDisabled : 1; // 0x122
	FLinearColor ContentColorAndOpacity; // 0x124
	FDelegate ContentColorAndOpacityDelegate; // 0x134
	FMargin Padding; // 0x144
	FSlateBrush Background; // 0x158
	FDelegate BackgroundDelegate; // 0x1e0
	FLinearColor BrushColor; // 0x1f0
	FDelegate BrushColorDelegate; // 0x200
	FVector2D DesiredSizeScale; // 0x210
	bool bFlipForRightToLeftFlowDirection; // 0x218
	FDelegate OnMouseButtonDownEvent; // 0x21c
	FDelegate OnMouseButtonUpEvent; // 0x22c
	FDelegate OnMouseMoveEvent; // 0x23c
	FDelegate OnMouseDoubleClickEvent; // 0x24c
};

struct ULiveLinkCurveRemapSettings {
	FLiveLinkCurveConversionSettings CurveConversionSettings; // 0xa0
};

struct ARosterScenarioSpawner {
	TMap<FName, FDataTableRowHandle> ObjectiveSpawns; // 0x220
	TArray<FObjectiveSpawn> Objectives; // 0x270
	TArray<AWeaponCacheActor*> WeaponCacheActors; // 0x280
	TArray<ABaseMagazineWeapon*> PossibleWeapons; // 0x290
	float MaxPatrolRadiusDistance; // 0x2a0
	float TimeBetweenTargetingCivilians; // 0x2a4
	float TimeUntilBombExplodes; // 0x2a8
	TArray<APatrolPoint*> UsedPatrolPoints; // 0x2b0
};

struct UStaticMeshSimulationComponent {
	bool Simulating; // 0xb8
	bool bNotifyCollisions; // 0xb9
	EObjectStateTypeEnum ObjectType; // 0xba
	float Mass; // 0xbc
	ECollisionTypeEnum CollisionType; // 0xc0
	EImplicitTypeEnum ImplicitType; // 0xc1
	int32_t MinLevelSetResolution; // 0xc4
	int32_t MaxLevelSetResolution; // 0xc8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xcc
	FVector InitialLinearVelocity; // 0xd0
	FVector InitialAngularVelocity; // 0xdc
	float DamageThreshold; // 0xe8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xf0
	AChaosSolverActor* ChaosSolverActor; // 0xf8
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x100
	TArray<UPrimitiveComponent*> SimulatedComponents; // 0x120
};

struct ADevice_C2_Placed_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x358
	UBoxComponent* Box; // 0x360
};

struct UGizmoAxisRotationParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Angle; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurRotationAxis; // 0xbc
	FVector CurRotationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct AAICharacter {
	UHesitationBarComponent* HesitationBarComponent; // 0x1ac0
	bool bDeactivated; // 0x1ac8
	bool bHasEverShot; // 0x1aca
	FMulticastInlineDelegate OnDoorShotgunBreach_FromAnimNotify; // 0x1ad0
	FMulticastInlineDelegate OnDoorKickBreach_FromAnimNotify; // 0x1ae0
	FMulticastInlineDelegate OnPendingItemThrown_FromAnimNotify; // 0x1af0
	ABaseItem* PendingThrownItem; // 0x1b00
	FMulticastInlineDelegate OnAITakenDamage; // 0x1b08
	FMulticastInlineDelegate OnAIFire; // 0x1b18
	FMulticastInlineDelegate OnAIKilled; // 0x1b28
	FMulticastInlineDelegate OnCollectPendingEvidenceBegin_FromAnimNotify; // 0x1b38
	FMulticastInlineDelegate OnCollectPendingEvidenceEnd_FromAnimNotify; // 0x1b48
	bool bSurrendered; // 0x1b58
	bool bSurrenderComplete; // 0x1b78
	AAICharacter* BeingRestrainedBy; // 0x1b80
	ABaseItem* ThrownWeapon; // 0x1b88
	UScoringComponent* ScoringComponent; // 0x1b90
	UPawnSensingComponent* PawnSensingComp; // 0x1b98
	FAIDataLookupTable AssignedAIData; // 0x1ba0
	AAISpawn* SpawnedFromSpawner; // 0x1df0
	FActivityRouteCollection ActivityRouteCollection; // 0x1df8
	FVector Rep_FocalPoint; // 0x1e18
	FVector Rep_HeadFocalPoint; // 0x1e24
	AActor* Rep_FocalActor; // 0x1e30
	char bHeardYellFromOfficer : 1; // 0x1e38
	float ArrestedTime; // 0x1e3c
	bool bFemale; // 0x1e40
	bool bChild; // 0x1e41
	bool bHitOnceByBeanbag; // 0x1e42
	bool bKnockoutFacingUp; // 0x1e43
	bool bIsKnockedOut; // 0x1e44
	FString GetBackupMontageName; // 0x1e48
	bool bFinishedKnockout; // 0x1e58
	bool bFinishedKnockoutMontage; // 0x1e59
	UReadyOrNotCharacterAnimData* Unarmed_Calm_AD; // 0x1e70
	UReadyOrNotCharacterAnimData* Unarmed_Sr_AD; // 0x1e78
	UReadyOrNotCharacterAnimData* Unarmed_Ar_AD; // 0x1e80
	UReadyOrNotCharacterAnimData* Unarmed_Ar_Crouch_AD; // 0x1e88
	UReadyOrNotCharacterAnimData* Unarmed_Alert_AD; // 0x1e90
	UReadyOrNotCharacterAnimData* Rifle_AD; // 0x1e98
	UReadyOrNotCharacterAnimData* Pistol_AD; // 0x1ea0
	UReadyOrNotCharacterAnimData* Pistol_OneHanded_AD; // 0x1ea8
	EWeaponType CurActiveWeaponType; // 0x1eb0
	EPseudoSpeedType DesiredPseudoSpeed; // 0x1eb1
	FAIMoveDataBlock MoveDataOverride; // 0x1eb8
	FAIMoveDataBlock CurMoveDataBlock; // 0x1f50
	float TimeSinceLastShot; // 0x1fec
	float TimeSinceArrest; // 0x1ff0
	bool bHasPlayedSurrenderAnim; // 0x1ff4
	bool bIsFakeSurrender; // 0x1ff5
	bool bHasEverFakeSurrendered; // 0x1ff6
	bool bFinishedEquippingLoadout; // 0x1ff7
	bool bForceFiringEnabled; // 0x1ff8
	FCharacterMesh CharacterMeshData; // 0x2000
	FMulticastInlineDelegate OnAimedAt; // 0x2060
	char bAimingAtTarget : 1; // 0x2070
	char bHasEverAimedAtTarget : 1; // 0x2070
	char bIsFleeing : 1; // 0x2070
	char bDrawingWeapon : 1; // 0x2070
	char bPickingUpWeapon : 1; // 0x2070
	char bHasDamagedSWATTeam : 1; // 0x2070
	char bHitScannedFriendly : 1; // 0x2070
	FHitResult CachedHitScanResult; // 0x2074
	FWorldBuildingAnimState Rep_WorldBuildingAnimState; // 0x2100
	ASuspectsAndCivilianManager* SuspectsAndCivilianManager; // 0x2120
};

struct UEdGraphNode_Documentation {
	FString Link; // 0x98
	FString Excerpt; // 0xa8
};

struct USoundNodeModulator {
	float PitchMin; // 0x48
	float PitchMax; // 0x4c
	float VolumeMin; // 0x50
	float VolumeMax; // 0x54
};

struct AAITest {
	UBillboardComponent* BillboardComponent; // 0x220
	APlayerCharacter* TestCharacter; // 0x228
	int32_t GiveToNearestXAI; // 0x230
};

struct USubtitlesCache {
	TMap<FName, FLipSync_Pause> Data; // 0x28
};

struct AGrenadeLauncher {
	TArray<AGrenadeProjectile*> AppliedGrenadeProjectilePaths; // 0x1128
	AGrenadeProjectile* LastSimulatedGrenade; // 0x1138
	float LaunchDistance; // 0x1140
	float GrenadeBounciness; // 0x1144
	UParticleSystem* BounceParticleEffect; // 0x1150
	UFMODEvent* BounceFMODEvent; // 0x1158
	TArray<FVector> FirstBouncePath; // 0x1160
	FHitResult FirstBounceHit; // 0x1170
	TArray<FVector> SecondBouncePath; // 0x1200
	FHitResult SecondBounceHit; // 0x1210
	TArray<FVector> ThirdBouncePath; // 0x12a0
	FHitResult ThirdBounceHit; // 0x12b0
	TArray<FVector_NetQuantize> CompletePath; // 0x1340
	int32_t BouncePt1; // 0x1350
	int32_t BouncePt2; // 0x1354
	int32_t BouncePt3; // 0x1358
};

struct AFirePointActor {
	TArray<FString> CustomFireArray; // 0x220
	ECoverFireType CoverType; // 0x230
	char bIsCrouchCover : 1; // 0x231
	ACyberneticController* InUseByController; // 0x238
	USceneComponent* DefaultScene; // 0x240
};

struct UBehaviorTreeComponent {
	TArray<UBTNode*> NodeInstances; // 0x128
	UBehaviorTree* DefaultBehaviorTreeAsset; // 0x278
};

struct APrimary_S590_Beanbag_V2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1190
	UPointLightComponent* PointLight; // 0x1198
	USpotLightComponent* PointLight1; // 0x11a0
	UAnimMontage* LightToggle1P; // 0x11a8
};

struct UTimelineTemplate {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	ETickingGroup TimelineTickGroup; // 0x90
	FName VariableName; // 0x94
	FName DirectionPropertyName; // 0x9c
	FName UpdateFunctionName; // 0xa4
	FName FinishedFunctionName; // 0xac
};

struct UMatchTimeRemainingWidget {
	UTextBlock* MatchTimeRemaining_Text; // 0x278
	float RoundTimeRemaining; // 0x280
};

struct UInterpTrackFloatMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName paramName; // 0xa0
};

struct UMaterialExpressionNormalize {
	FExpressionInput VectorInput; // 0x40
};

struct UStereoLayerShapeCylinder {
	float Radius; // 0x28
	float OverlayArc; // 0x2c
	int32_t Height; // 0x30
};

struct AStackUpActor {
	USceneComponent* DefaultScene; // 0x220
	ESquadPosition StackUpPosition; // 0x228
	AThreatAwarenessActor* BreachLookAtPoint; // 0x230
	AThreatAwarenessActor* StackupLookAtPoint; // 0x238
	ADoor* LinkedDoor; // 0x240
	AStackUpActor* OppositeStackUpActor; // 0x248
};

struct UMovieSceneCameraCutSection {
	bool bLockPreviousCamera; // 0xf0
	FGuid CameraGuid; // 0xf4
	FMovieSceneObjectBindingID CameraBindingID; // 0x104
	FTransform InitialCameraCutTransform; // 0x120
	bool bHasInitialCameraCutTransform; // 0x150
};

struct UCheckBoxStyleAsset {
	FCheckBoxStyle CheckBoxStyle; // 0x28
};

struct USoundNodeQualityLevel {
	int32_t CookedQualityLevelIndex; // 0x48
};

struct AMainMenu_V2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x978
};

struct UNetDriver {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t NetServerMaxTickRate; // 0x58
	int32_t MaxNetTickRate; // 0x5c
	int32_t MaxInternetClientRate; // 0x60
	int32_t MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	UNetConnection* ServerConnection; // 0x88
	TArray<UNetConnection*> ClientConnections; // 0x90
	int32_t RecentlyDisconnectedTrackingTime; // 0x100
	UWorld* World; // 0x140
	UPackage* WorldPackage; // 0x148
	UObject* NetConnectionClass; // 0x170
	UObject* ReplicationDriverClass; // 0x178
	FName NetDriverName; // 0x190
	TArray<FChannelDefinition> ChannelDefinitions; // 0x198
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1a8
	TArray<UChannel*> ActorChannelPool; // 0x1f8
	float Time; // 0x210
	UReplicationDriver* ReplicationDriver; // 0x700
};

struct UMaterialExpressionNamedRerouteDeclaration {
	FExpressionInput Input; // 0x40
	FName Name; // 0x54
	FGuid VariableGuid; // 0x5c
};

struct AFlankingAvoidanceVolume {
	UBoxComponent* Bounds; // 0x220
};

struct UDistributionVector {
	char bCanBeBaked : 1; // 0x30
	char bIsDirty : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct URichTextBlockImageDecorator {
	UDataTable* ImageSet; // 0x28
};

struct UNiagaraDataInterfaceParticleRead {
	FString EmitterName; // 0xd8
};

struct UEnvQueryTest_PathfindingBatch {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UANIMBP_AI_TempTest_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0xe20
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0xe28
	FAnimNode_LegIK AnimGraphNode_LegIK; // 0xf30
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x1028
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x1130
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x1288
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x12d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x13d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x14e0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x15e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x16f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_24; // 0x1770
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_8; // 0x1838
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_23; // 0x18b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x1978
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x19f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x1aa8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x1c00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x1c80
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x1ca8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x1d58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x1eb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x1f30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x2088
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x21e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x2208
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x2230
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x2258
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2280
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x22a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x22d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x22f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2320
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x2348
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x23c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x23f8
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x2478
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x24a8
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x2528
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x2558
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_22; // 0x25d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x26a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x26c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x26f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x2718
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_7; // 0x2740
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_21; // 0x27b8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18; // 0x2880
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17; // 0x28d0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16; // 0x2920
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x2970
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x2a20
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_6; // 0x2a50
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_20; // 0x2ac8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15; // 0x2b90
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14; // 0x2be0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13; // 0x2c30
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x2c80
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x2d30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x2d60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x2d88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2db0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x2e50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x2e78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x2ea0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x2ec8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x2ef0
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x2f70
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12; // 0x2fa0
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x2ff0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x3020
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x3048
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x3078
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x3128
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x31f0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x3220
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x32d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x3300
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x3380
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x33b0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_19; // 0x3430
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x34f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x3520
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x3548
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x3570
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_5; // 0x3598
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_18; // 0x3610
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11; // 0x36d8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10; // 0x3728
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9; // 0x3778
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x37c8
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x3878
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0x38a8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0x38f8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x3948
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x3998
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x3a60
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4; // 0x3b10
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x3b88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x3bb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x3be0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x3c80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x3ca8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x3d48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3d70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x3e10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x3e38
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x3f00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x3f28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x3f50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x3f78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x3fa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x3fc8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x3ff0
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x4040
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x4070
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x40c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x40f0
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x4118
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x4148
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x41f8
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x42c0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x42f0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x43a0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x43d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x4480
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x4520
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x45e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x4668
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x46e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x47b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x4850
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x48f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x4970
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x49f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x4b48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x4c08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x4c30
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x4c58
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x4db0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x4e60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x4e88
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x4eb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x5040
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x5198
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x5238
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x5260
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x5300
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x5328
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x5480
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x54a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x5638
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x56d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x5700
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x5858
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x59e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x5a10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x5a38
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x5a60
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x5b00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x5bc0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x5be8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x5cb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x5cd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x5e30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x5ed0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x5ef8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x5f20
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x6078
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x6138
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x6160
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x6228
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x6380
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x6400
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x64a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x64c8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x65d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x6728
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x67d0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x69b0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x6b90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x6d20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x6da0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0x6e20
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3; // 0x6ee8
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2; // 0x6f60
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0x6fd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x70a0
	FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer; // 0x7120
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7198
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x71c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7350
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x7378
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x7508
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x7530
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_6; // 0x76c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x7828
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x78a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x7928
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x79a8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x7a28
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x7b80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x7d10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x7d90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x7e10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x7e90
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x7f10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x8068
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x8108
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x8188
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x8208
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x8288
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x8308
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x8460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x8568
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x85e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x8668
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x86e8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x8768
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x88c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x89c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x8a48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x8ac8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x8b48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x8bc8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x8d20
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x8e28
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x8ef0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0x8f40
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0x8ff0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x90a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x9120
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x91a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x9220
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x92a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x9350
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x93d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x9450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x94d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x9550
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x9600
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x9680
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x9700
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x9780
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x9800
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x98b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x9960
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x99e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x9a60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x9ae0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x9b60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x9be0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x9c60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x9ce0
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_5; // 0x9d60
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x9ec8
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_4; // 0x9fd0
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_3; // 0xa138
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xa2a0
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver_2; // 0xa2c8
	FAnimNode_PoseDriver AnimGraphNode_PoseDriver; // 0xa430
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0xa598
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0xa618
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0xa698
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0xa718
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0xa798
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0xa818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0xa898
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0xa918
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0xa998
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0xaa48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0xaac8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0xab48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xac10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0xac38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0xacd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0xad58
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xadd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0xaee0
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0xaf80
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0xafc8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0xb018
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0xb0d8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0xb1a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0xb268
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0xb2e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0xb388
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0xb408
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0xb4d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0xb550
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xb5f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0xb670
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0xb6f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0xb790
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0xb810
	FAnimNode_SlopeWarping AnimGraphNode_SlopeWarping; // 0xb858
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xba80
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0xbbd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0xbc88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0xbd08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0xbd88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0xbe08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0xbe88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xbf08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xbf88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xc008
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0xc088
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xc150
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xc178
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xc1a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xc1c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc1f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xc218
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xc298
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0xc2c8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xc348
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0xc3c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xc3f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xc4a8
	FAnimNode_Root AnimGraphNode_Root; // 0xc4c8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xc4f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xc688
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0xc6a8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0xc758
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0xc818
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xc8b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xc938
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xc9b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xc9e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xca08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0xcb60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0xcb88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0xcbb0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0xcc50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0xcd10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xcd38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0xcdb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xce38
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0xced8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xcf20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xcfc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xd040
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xd0c0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0xd140
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xd1f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0xd348
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0xd370
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0xd430
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0xd458
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xd4e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xd588
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0xd608
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xd6c8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xd6f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xd7b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xd7e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xd808
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0xd8a8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0xd970
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xda30
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xda58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xdb20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xdb48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xdb70
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xdc10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xdd68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xdd90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xddb8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0xde58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xdf08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0xdf88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xe008
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xe088
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xe108
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0xe188
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xe250
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xe2f0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0xe318
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xe3e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xe408
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xe430
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xe4f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xe590
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xe610
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xe6c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xe740
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xe7c0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0xe860
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xe928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xe9f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xea18
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0xea40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xeb00
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xeb28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xebf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xec18
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xec40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xece0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xed60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xee00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xee28
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0xee50
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0xee98
	FAnimNode_Slot AnimGraphNode_Slot; // 0xeee0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0xef28
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xefe8
	FRotator AimDeltaRot; // 0xf140
	float LeanTransitionSpeeds; // 0xf14c
	float DirectionBlendTime; // 0xf150
	float WeaponUpBlendTime; // 0xf154
	float AnimSpeedForward; // 0xf158
	float AnimSpeedRight; // 0xf15c
	float AnimWarpPlayrateThreshold; // 0xf160
	FVector LeftJointLoc; // 0xf164
	FVector RightJoinLoc; // 0xf170
	float CharSpeed; // 0xf17c
	float InputUpDown; // 0xf180
	FPoseSnapshot DeathPose; // 0xf188
	float TurnRemainingStartTime; // 0xf1c0
	float SlopeWarpingAlpha; // 0xf1c4
	bool bIsVIP1911; // 0xf1c8
	bool bIsCustomizing; // 0xf1c9
	bool bHoldingVIPWeapon; // 0xf1ca
	bool bHoldingWeaponAsMLO; // 0xf1cb
	bool bCanTurnInPlace; // 0xf1cc
	bool IsItemOrPistolMotionBlock; // 0xf1cd
	bool IsRifleMotionBlock; // 0xf1ce
	bool bIsCrouchingWithShield; // 0xf1cf
	float IsNotCustomizing_AsFloat; // 0xf1d0
	float CrouchHighPoseAdditiveAlpha; // 0xf1d4
	float StandHighPoseAdditiveAlpha; // 0xf1d8
	float LeftHandIKAlpha_ItemBased; // 0xf1dc
	FVector ZHeightLeanAdjustment; // 0xf1e0
	float IsCrouchingWithShield_AsFloat; // 0xf1ec
};

struct UReplaySubsystem {
	bool bLoadDefaultMapOnStop; // 0x30
};

struct USubmixEffectReverbPluginPreset {
	FSubmixEffectReverbPluginSettings Settings; // 0x91
};

struct UBulletDamageType {
	UUserWidget* HitVisuals; // 0x40
	UMatineeCameraShake* HitShake; // 0x48
	bool bArmorPiercing; // 0x50
	bool bNonLethal; // 0x51
	float AggressionChangeInAI; // 0x54
	float HeadDamageMultiplier; // 0x58
	float UpperBodyDamageMultiplier; // 0x5c
	float LowerBodyDamageMultiplier; // 0x60
	float ArmDamageMultiplier; // 0x64
	float LegDamageMultiplier; // 0x68
	float FootDamageMultiplier; // 0x6c
};

struct USoundNodeWaveParam {
	FName WaveParameterName; // 0x48
};

struct ASphereReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x228
};

struct UInterpTrackInstParticleReplay {
	float LastUpdatePosition; // 0x28
};

struct UPlayableCharacterData {
	FText CharacterNameUI; // 0x30
	FText CharacterName; // 0x48
	FText CharacterRole; // 0x60
	FText CharacterBio; // 0x78
	FText CharacterRealName; // 0x90
	FText CharacterYearsOfService; // 0xa8
	FText CharacterDateOfBirth; // 0xc0
	FName HandleName; // 0xd8
	TSoftObjectPtr<USkeletalMesh> FaceMesh; // 0xe0
	TSoftObjectPtr<UPoseAsset> FaceROM; // 0x108
};

struct ASecondary_P99_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
};

struct UAnimNotifyState_TimedParticleEffect {
	UParticleSystem* PSTemplate; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct USubmixEffectStereoDelayPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct ABulletTracer {
	USceneComponent* RootComp; // 0x220
	UParticleSystemComponent* ParticleComponent; // 0x248
	UParticleSystem* TracerParticle; // 0x250
	UParticleSystem* SmokeParticle; // 0x258
};

struct ADroneVehicle {
	UBoxComponent* FlightBox; // 0x2c8
	USkeletalMeshComponent* Mesh; // 0x2d0
	UAudioComponent* Audio; // 0x2d8
	UCameraComponent* FirstPersonCamera; // 0x2e0
	USpringArmComponent* ThirdPersonSpringArm; // 0x2e8
	UCameraComponent* ThirdPersonCamera; // 0x2f0
	UFloatingPawnMovement* FloatingMovementComponent; // 0x2f8
	float MaxTilt; // 0x300
	float MaxRPM; // 0x304
	float IdleRPM; // 0x308
	float RPMForceScale; // 0x30c
	float RPMThrottleMultiplier; // 0x310
	float ThrottleInterpSpeed; // 0x314
	float RotationInterpSpeed; // 0x318
	float TurnSpeed; // 0x31c
	float RotationInterpSpeedWhenSteady; // 0x320
	float TurnSpeedWhenSteady; // 0x324
	float MinSpeed; // 0x328
	float MaxSpeed; // 0x32c
	float SpeedIncrementRate; // 0x330
	float InvincibilityTimeAfterDamageApplied; // 0x334
	float RPM; // 0x338
	FRotator RotorRotation; // 0x33c
	float CurrentAltitude; // 0x348
	float CurrentPilotDistance; // 0x34c
	FTransform DroneTransform; // 0x350
	FRotator TargetRotation; // 0x380
	bool bApplyingInput; // 0x3c0
	bool bSteadyDrone; // 0x3c1
	APlayerCharacter* DroneOwner; // 0x3e8
	UWorld* World; // 0x3f0
};

struct UReadyOrNotCharacterAnimData {
	TArray<FCharacterTPAnim> Surrender; // 0x30
	TArray<FCharacterTPAnim> FakeSurrender; // 0x40
	TArray<FCharacterTPAnim> Spooked_Front; // 0x50
	TArray<FCharacterTPAnim> Spooked_Right; // 0x60
	TArray<FCharacterTPAnim> Spooked_Left; // 0x70
	TArray<FCharacterTPAnim> Spooked_Back; // 0x80
	TArray<FCharacterTPAnim> Arrested; // 0x90
	TArray<FCharacterTPAnim> Decision; // 0xa0
	TArray<FCharacterTPAnim> StandRelaxedFidget; // 0xb0
	TArray<FCharacterTPAnim> StandAlertFidget; // 0xc0
	TArray<FCharacterTPAnim> HitReaction_Head; // 0xd0
	TArray<FCharacterTPAnim> HitReaction_UpperBody; // 0xe0
	TArray<FCharacterTPAnim> HitReaction_LowerBody; // 0xf0
	TArray<FCharacterTPAnim> HitReaction_LeftArm; // 0x100
	TArray<FCharacterTPAnim> HitReaction_RightArm; // 0x110
	TArray<FCharacterTPAnim> HitReaction_LeftLeg; // 0x120
	TArray<FCharacterTPAnim> HitReaction_RightLeg; // 0x130
	TArray<FCharacterTPAnim> HitReaction_LeftFoot; // 0x140
	TArray<FCharacterTPAnim> HitReaction_RightFoot; // 0x150
	TArray<FCharacterTPAnim> HitReaction_DropWeapon; // 0x160
	FCharacterTPAnim FireWeapon; // 0x170
	FCharacterTPAnim DrawWeapon; // 0x178
	FCharacterTPAnim HolsterWeapon; // 0x180
	FCharacterTPAnim ReloadWeapon; // 0x188
	TArray<FCharacterTPAnim> Death_Head_Front; // 0x190
	TArray<FCharacterTPAnim> Death_Head_Back; // 0x1a0
	TArray<FCharacterTPAnim> Death_Arm_Left_Front; // 0x1b0
	TArray<FCharacterTPAnim> Death_Arm_Left_Back; // 0x1c0
	TArray<FCharacterTPAnim> Death_Arm_Right_Front; // 0x1d0
	TArray<FCharacterTPAnim> Death_Arm_Right_Back; // 0x1e0
	TArray<FCharacterTPAnim> Death_Leg_Left_Front; // 0x1f0
	TArray<FCharacterTPAnim> Death_Leg_Left_Back; // 0x200
	TArray<FCharacterTPAnim> Death_Leg_Right_Front; // 0x210
	TArray<FCharacterTPAnim> Death_Leg_Right_Back; // 0x220
	TArray<FCharacterTPAnim> Death_Front; // 0x230
	TArray<FCharacterTPAnim> Death_Back; // 0x240
	TArray<FCharacterTPAnim> Death_Bleedout_Head; // 0x250
	TArray<FCharacterTPAnim> Death_Bleedout_Chest; // 0x260
	TArray<FCharacterTPAnim> Death_Bleedout_Stomach; // 0x270
	TArray<FCharacterTPAnim> Death_Bleedout_Left_Arm; // 0x280
	TArray<FCharacterTPAnim> Death_Bleedout_Right_Arm; // 0x290
	TArray<FCharacterTPAnim> Death_Bleedout_Left_Leg; // 0x2a0
	TArray<FCharacterTPAnim> Death_Bleedout_Right_Leg; // 0x2b0
	TArray<FCharacterTPAnim> Flashbanged; // 0x2c0
	TArray<FCharacterTPAnim> Stingballed; // 0x2d0
	TArray<FCharacterTPAnim> Gassed; // 0x2e0
	TArray<FCharacterTPAnim> Sprayed; // 0x2f0
	TArray<FCharacterTPAnim> Tasered; // 0x300
	TArray<FCharacterTPAnim> Meleed; // 0x310
	FCharacterTPAnim OpenDoor; // 0x320
	FCharacterTPAnim CloseDoor; // 0x328
	FCharacterTPAnim Flinches; // 0x330
	UAnimSequence* Calm_Turn90Left; // 0x338
	UAnimSequence* Calm_Turn90Right; // 0x340
	UAnimSequence* Calm_Turn180Left; // 0x348
	UAnimSequence* Calm_Turn180Right; // 0x350
	UAnimSequence* Alert_Turn90Left; // 0x358
	UAnimSequence* Alert_Turn90Right; // 0x360
	UAnimSequence* Alert_Turn180Left; // 0x368
	UAnimSequence* Alert_Turn180Right; // 0x370
	TArray<FCharacterTPAnim> AllAnimsList; // 0x378
};

struct UDropWeaponAnimNotify {
	float ThrowForce; // 0x38
	bool bEquipLastItem; // 0x3c
	bool bFastHolster; // 0x3d
	bool bMarkAsEvidence; // 0x3e
};

struct AThrownItem {
	AReadyOrNotCharacter* ThrowInstigator; // 0x220
	USceneComponent* SceneComponent; // 0x228
	UStaticMeshComponent* StaticMesh; // 0x230
	UAIPerceptionStimuliSourceComponent* PerceptionStimuliComp; // 0x238
	float TurnPhysicsOffDelay; // 0x240
	float ThrowDistance; // 0x244
	TArray<FVector> FirstBouncePath; // 0x248
	FHitResult FirstBounceHit; // 0x258
	TArray<FVector> SecondBouncePath; // 0x2e8
	FHitResult SecondBounceHit; // 0x2f8
	TArray<FVector> ThirdBouncePath; // 0x388
	FHitResult ThirdBounceHit; // 0x398
	TArray<FVector_NetQuantize> CompletePath; // 0x428
	int32_t BouncePt1; // 0x438
	int32_t BouncePt2; // 0x43c
	int32_t BouncePt3; // 0x440
	float ThrowSpeed; // 0x448
	float ThrowBounciness; // 0x454
};

struct USteamNetConnection {
	bool bIsPassthrough; // 0x1c48
};

struct ULevel {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x258
	TArray<UAssetUserData*> AssetUserData; // 0x268
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x288
};

struct UARPointComponent {
	FARPointUpdatePayload ReplicatedPayload; // 0x278
};

struct UPrimaryAssetLabel {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct APaperTileMapActor {
	UPaperTileMapComponent* RenderComponent; // 0x220
};

struct UDatasmithDeltaGenSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bRemoveInvisibleNodes; // 0x4a
	bool bSimplifyNodeHierarchy; // 0x4b
	bool bImportVar; // 0x4c
	FString VarPath; // 0x50
	bool bImportPos; // 0x60
	FString PosPath; // 0x68
	bool bImportTml; // 0x78
	FString TmlPath; // 0x80
};

struct UW_SkinCategory_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* Anim_ButtonPressed; // 0x280
	UW_StandardButton_C* Button; // 0x288
	UUniformGridPanel* GridPanel; // 0x290
	UOverlay* SelectedItemInfo_Container; // 0x298
	UW_Text_C* txt_CategoryName; // 0x2a0
	UW_Text_C* txt_ItemName; // 0x2a8
	FText ItemName; // 0x2b0
	FText SkinCategoryName; // 0x2c8
	TArray<UW_SkinItem_C*> SkinItemWidgets; // 0x2e0
	bool bCollapsed; // 0x2f0
	FMulticastInlineDelegate OnButtonClicked; // 0x2f8
	FMulticastInlineDelegate OnButtonHovered; // 0x308
	FMulticastInlineDelegate OnButtonUnhovered; // 0x318
	FMulticastInlineDelegate OnSkinItemButtonClicked; // 0x328
	TArray<USkinComponent*> SkinAttachments; // 0x338
	USkinComponent* NullSkinAttachment; // 0x348
	UW_QuartermasterMenu_C* Owner; // 0x350
	bool bChildSelected; // 0x358
	bool bInMenuBounds; // 0x359
	bool bHovered; // 0x35a
	bool bAnyKeyDown; // 0x35b
	int32_t SelectedRow; // 0x35c
	int32_t SelectedColumn; // 0x360
	int32_t NumOfColumns; // 0x364
};

struct UMonoWaveTableSynthPreset {
	FString PresetName; // 0x28
	char bLockKeyframesToGridBool : 1; // 0x38
	int32_t LockKeyframesToGrid; // 0x3c
	int32_t WaveTableResolution; // 0x40
	TArray<FRuntimeFloatCurve> WaveTable; // 0x48
	char bNormalizeWaveTables : 1; // 0x58
};

struct UW_AttachmentItem_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UWidgetAnimation* Anim_ButtonPressed; // 0x280
	UImage* BottonBorder_Image; // 0x288
	UW_StandardButton_C* Button; // 0x290
	UImage* ItemIcon_Image; // 0x298
	UImage* LeftBorder_Image; // 0x2a0
	USizeBox* RadioIcon_SizeBox; // 0x2a8
	UImage* RightBorder_Image; // 0x2b0
	UImage* SelectedRadioIcon_Image; // 0x2b8
	UImage* TopBorder_Image; // 0x2c0
	UW_Text_C* txt_ItemClassName; // 0x2c8
	UW_Text_C* txt_ItemName; // 0x2d0
	UImage* UnselectedRadioIcon_Image; // 0x2d8
	FText ItemName; // 0x2e0
	UWeaponAttachment* WeaponAttachmentClass; // 0x2f8
	UW_AttachmentCategory_C* Owner; // 0x300
	bool bSelected; // 0x308
	FMulticastInlineDelegate OnButtonClicked; // 0x310
	FMulticastInlineDelegate OnButtonHovered; // 0x320
	FMulticastInlineDelegate OnButtonUnhovered; // 0x330
};

struct UDirectionalLightComponent {
	float ShadowCascadeBiasDistribution; // 0x328
	char bEnableLightShaftOcclusion : 1; // 0x32c
	float OcclusionMaskDarkness; // 0x330
	float OcclusionDepthRange; // 0x334
	FVector LightShaftOverrideDirection; // 0x338
	float WholeSceneDynamicShadowRadius; // 0x344
	float DynamicShadowDistanceMovableLight; // 0x348
	float DynamicShadowDistanceStationaryLight; // 0x34c
	int32_t DynamicShadowCascades; // 0x350
	float CascadeDistributionExponent; // 0x354
	float CascadeTransitionFraction; // 0x358
	float ShadowDistanceFadeoutFraction; // 0x35c
	char bUseInsetShadowsForMovableObjects : 1; // 0x360
	int32_t FarShadowCascadeCount; // 0x364
	float FarShadowDistance; // 0x368
	float DistanceFieldShadowDistance; // 0x36c
	float LightSourceAngle; // 0x370
	float LightSourceSoftAngle; // 0x374
	float ShadowSourceAngleFactor; // 0x378
	float TraceDistance; // 0x37c
	char bUsedAsAtmosphereSunLight : 1; // 0x380
	int32_t AtmosphereSunLightIndex; // 0x384
	FLinearColor AtmosphereSunDiskColorScale; // 0x388
	char bPerPixelAtmosphereTransmittance : 1; // 0x398
	char bCastShadowsOnClouds : 1; // 0x398
	char bCastShadowsOnAtmosphere : 1; // 0x398
	char bCastCloudShadows : 1; // 0x398
	float CloudShadowStrength; // 0x39c
	float CloudShadowOnAtmosphereStrength; // 0x3a0
	float CloudShadowOnSurfaceStrength; // 0x3a4
	float CloudShadowDepthBias; // 0x3a8
	float CloudShadowExtent; // 0x3ac
	float CloudShadowMapResolutionScale; // 0x3b0
	float CloudShadowRaySampleCountScale; // 0x3b4
	FLinearColor CloudScatteredLuminanceScale; // 0x3b8
	FLightmassDirectionalLightSettings LightmassSettings; // 0x3c8
	char bCastModulatedShadows : 1; // 0x3d8
	FColor ModulatedShadowColor; // 0x3dc
	float ShadowAmount; // 0x3e0
};

struct USpringArmComponent {
	float TargetArmLength; // 0x1f8
	FVector SocketOffset; // 0x1fc
	FVector TargetOffset; // 0x208
	float ProbeSize; // 0x214
	ECollisionChannel ProbeChannel; // 0x218
	char bDoCollisionTest : 1; // 0x21c
	char bUsePawnControlRotation : 1; // 0x21c
	char bInheritPitch : 1; // 0x21c
	char bInheritYaw : 1; // 0x21c
	char bInheritRoll : 1; // 0x21c
	char bEnableCameraLag : 1; // 0x21c
	char bEnableCameraRotationLag : 1; // 0x21c
	char bUseCameraLagSubstepping : 1; // 0x21c
	char bDrawDebugLagMarkers : 1; // 0x21d
	float CameraLagSpeed; // 0x220
	float CameraRotationLagSpeed; // 0x224
	float CameraLagMaxTimeStep; // 0x228
	float CameraLagMaxDistance; // 0x22c
};

struct UTextLayoutWidget {
	FShapedTextOptions ShapedTextOptions; // 0x108
	ETextJustify Justification; // 0x10b
	ETextWrappingPolicy WrappingPolicy; // 0x10c
	char AutoWrapText : 1; // 0x10d
	float WrapTextAt; // 0x110
	FMargin Margin; // 0x114
	float LineHeightPercentage; // 0x124
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch {
	FGameplayTagContainer Tags; // 0x28
};

struct USubmixEffectSubmixEQPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0xa0
};

struct AGeometryCollectionActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x220
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x228
};

struct UEnvQueryInstanceBlueprintWrapper {
	int32_t QueryID; // 0x30
	UEnvQueryItemType* ItemType; // 0x58
	int32_t OptionIndex; // 0x60
	FMulticastInlineDelegate OnQueryFinishedEvent; // 0x68
};

struct AIntervalGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x220
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x228
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x230
};

struct USkeletalMeshSimplificationSettings {
	FName SkeletalMeshReductionModuleName; // 0x38
};

struct UWheeledVehicleMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x140
	char bReverseAsBrake : 1; // 0x140
	char bUseRVOAvoidance : 1; // 0x140
	char bRawHandbrakeInput : 1; // 0x140
	char bRawGearUpInput : 1; // 0x140
	char bRawGearDownInput : 1; // 0x140
	char bWasAvoidanceUpdated : 1; // 0x144
	float Mass; // 0x148
	TArray<FWheelSetup> WheelSetups; // 0x150
	float DragCoefficient; // 0x160
	float ChassisWidth; // 0x164
	float ChassisHeight; // 0x168
	float DragArea; // 0x16c
	float EstimatedMaxEngineSpeed; // 0x170
	float MaxEngineRPM; // 0x174
	float DebugDragMagnitude; // 0x178
	FVector InertiaTensorScale; // 0x17c
	float MinNormalizedTireLoad; // 0x188
	float MinNormalizedTireLoadFiltered; // 0x18c
	float MaxNormalizedTireLoad; // 0x190
	float MaxNormalizedTireLoadFiltered; // 0x194
	float ThresholdLongitudinalSpeed; // 0x198
	int32_t LowForwardSpeedSubStepCount; // 0x19c
	int32_t HighForwardSpeedSubStepCount; // 0x1a0
	TArray<UVehicleWheel*> Wheels; // 0x1a8
	float RVOAvoidanceRadius; // 0x1d0
	float RVOAvoidanceHeight; // 0x1d4
	float AvoidanceConsiderationRadius; // 0x1d8
	float RVOSteeringStep; // 0x1dc
	float RVOThrottleStep; // 0x1e0
	int32_t AvoidanceUID; // 0x1e4
	FNavAvoidanceMask AvoidanceGroup; // 0x1e8
	FNavAvoidanceMask GroupsToAvoid; // 0x1ec
	FNavAvoidanceMask GroupsToIgnore; // 0x1f0
	float AvoidanceWeight; // 0x1f4
	FVector PendingLaunchVelocity; // 0x1f8
	FReplicatedVehicleState ReplicatedState; // 0x204
	float RawSteeringInput; // 0x21c
	float RawThrottleInput; // 0x220
	float RawBrakeInput; // 0x224
	float SteeringInput; // 0x228
	float ThrottleInput; // 0x22c
	float BrakeInput; // 0x230
	float HandbrakeInput; // 0x234
	float IdleBrakeInput; // 0x238
	float StopThreshold; // 0x23c
	float WrongDirectionThreshold; // 0x240
	FVehicleInputRate ThrottleInputRate; // 0x244
	FVehicleInputRate BrakeInputRate; // 0x24c
	FVehicleInputRate HandbrakeInputRate; // 0x254
	FVehicleInputRate SteeringInputRate; // 0x25c
	AController* OverrideController; // 0x288
};

struct UGameplayTagsList {
	FString ConfigFileName; // 0x28
	TArray<FGameplayTagTableRow> GameplayTagList; // 0x38
};

struct UInputAxisDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct ASecondary_Taser_V2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x13b0
	float OverallTaserWireLength; // 0x13b8
	FVector LastLocation; // 0x13bc
};

struct UWidget {
	UPanelSlot* Slot; // 0x28
	FDelegate bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	FDelegate ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	FDelegate ToolTipWidgetDelegate; // 0x70
	FDelegate VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	EMouseCursor Cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct UW_PlayerDetailsWidget_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270
	UScaleBox* Arrested; // 0x278
	UImage* ArrestedIcon; // 0x280
	UScaleBox* Clues; // 0x288
	UImage* CluesIcon; // 0x290
	UWidgetSwitcher* IconSwitcher; // 0x298
	UTextBlock* Name; // 0x2a0
};

struct UAnimBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct UMaterialExpressionConstant4Vector {
	FLinearColor Constant; // 0x40
};

struct UPhononReverbSourceSettings {
	EIplSimulationType SourceReverbSimulationType; // 0x28
	float SourceReverbContribution; // 0x2c
};

struct AInteractionActor {
	USceneComponent* SceneRoot; // 0x228
	USphereComponent* UseIconRadius; // 0x230
	UStaticMeshComponent* Mesh_Static; // 0x238
	USkeletalMeshComponent* Mesh_Skeletal; // 0x240
	bool bCanUseNow; // 0x248
	bool bAvailableForUse; // 0x249
	bool bCompleteIcon; // 0x24a
	bool bButtonPushAnimation; // 0x24b
	bool bHoldButtonPrompt; // 0x24c
	bool bOverrideButtonPrompt; // 0x24d
	FText OverrideButtonPromptText; // 0x250
};

struct UMaterialExpressionPanner {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	FExpressionInput Speed; // 0x68
	float SpeedX; // 0x7c
	float SpeedY; // 0x80
	uint32_t ConstCoordinate; // 0x84
	bool bFractionalPart; // 0x88
};

struct ATextRenderActor {
	UTextRenderComponent* TextRender; // 0x220
};

struct UNiagaraDataInterfaceAudioSpectrum {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct UCameraShakeBase {
	bool bSingleInstance; // 0x28
	float ShakeScale; // 0x2c
	UCameraShakePattern* RootShakePattern; // 0x30
	APlayerCameraManager* CameraManager; // 0x38
};

struct UParticleModulePivotOffset {
	FVector2D PivotOffset; // 0x30
};

struct UViewport {
	FLinearColor BackgroundColor; // 0x120
};

struct UStreamMediaSource {
	FString StreamUrl; // 0x88
};

struct ABombActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x230
	UInteractableComponent* InteractableComponent; // 0x238
	UParticleSystemComponent* ExplosionParticleComponent; // 0x240
	float MultitoolUseTime; // 0x248
	EBombState BombState; // 0x24c
	UFMODEvent* BombTickEvent; // 0x258
	UFMODEvent* BombExplodeEvent; // 0x260
};

struct UParticleModuleColorScaleOverLife {
	FRawDistributionVector ColorScaleOverLife; // 0x30
	FRawDistributionFloat AlphaScaleOverLife; // 0x78
	char bEmitterTime : 1; // 0xa8
};

struct UGetGeoLocationAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UMaterialExpressionFmod {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UObjectReferencer {
	TArray<UObject*> ReferencedObjects; // 0x28
};

struct UInheritableComponentHandler {
	TArray<FComponentOverrideRecord> Records; // 0x28
	TArray<UActorComponent*> UnnecessaryComponents; // 0x38
};

struct UMaterialExpressionFresnel {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UAudioAnalyzerNRT {
	USoundWave* Sound; // 0x28
	float DurationInSeconds; // 0x30
};

struct UParticleSystemReplay {
	int32_t ClipIDNumber; // 0x28
};

struct UMaterialExpressionDistanceFieldsRenderingSwitch {
	FExpressionInput No; // 0x40
	FExpressionInput Yes; // 0x54
};

struct UBlackboardKeyType_NativeEnum {
	FString EnumName; // 0x30
	UEnum* EnumType; // 0x40
};

struct UMovieSceneCameraShakeSourceTriggerSection {
	FMovieSceneCameraShakeSourceTriggerChannel Channel; // 0xe8
};

struct UMovieSceneParticleTrack {
	TArray<UMovieSceneSection*> ParticleSections; // 0x98
};

struct UANIMBP_Taser_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FAnimNode_Root AnimGraphNode_Root; // 0x2d8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x308
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x350
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x3d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x4d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x4f8
	float Mag01Alpha; // 0x518
};

struct UChannel {
	UNetConnection* Connection; // 0x28
};

struct ASecondary_Makarov_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1130
	UPointLightComponent* PointLight; // 0x1138
	USpotLightComponent* SpotLight; // 0x1140
};

struct UCurveFloat {
	FRichCurve FloatCurve; // 0x30
	bool bIsEventCurve; // 0xb0
};

struct AObjective {
	UScoringComponent* ScoringComponent; // 0x220
	UFMODEvent* ObjectiveCompleteAudio; // 0x228
	UFMODEvent* ObjectiveFailedAudio; // 0x230
	EObjectiveStatus ObjectiveStatus; // 0x238
	FText ObjectiveName; // 0x240
	FText ObjectiveDescription; // 0x258
	ECOOPMode LockedToMode; // 0x270
	bool bFailureEndsMission; // 0x271
	bool bHiddenObjective; // 0x272
};

struct UMaterialExpressionMaterialProxyReplace {
	FExpressionInput Realtime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct UNavModifierComponent {
	UNavArea* AreaClass; // 0xe0
	FVector FailsafeExtent; // 0xe8
	char bIncludeAgentHeight : 1; // 0xf4
};

struct ALevelSequenceActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x238
	ULevelSequencePlayer* SequencePlayer; // 0x250
	FSoftObjectPath LevelSequence; // 0x258
	FLevelSequenceCameraSettings CameraSettings; // 0x270
	ULevelSequenceBurnInOptions* BurnInOptions; // 0x278
	UMovieSceneBindingOverrides* BindingOverrides; // 0x280
	char bAutoPlay : 1; // 0x288
	char bOverrideInstanceData : 1; // 0x288
	char bReplicatePlayback : 1; // 0x288
	UObject* DefaultInstanceData; // 0x290
	ULevelSequenceBurnIn* BurnInInstance; // 0x298
	bool bShowBurnin; // 0x2a0
};

struct UFoliageType_Actor {
	AActor* ActorClass; // 0x3b0
	bool bShouldAttachToBaseComponent; // 0x3b8
};

struct UW_Scoreboard_V2_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BG_Footer_Image; // 0x268
	UVerticalBox* BlueTeam_Box; // 0x270
	UVerticalBox* BlueTeam_Entries; // 0x278
	UTextBlock* BlueTeamPlayerCount_Text; // 0x280
	UTextBlock* BlueTeamText; // 0x288
	UTextBlock* CurrentRound_Text; // 0x290
	UTextBlock* MLO_Score_Text; // 0x298
	UVerticalBox* RedTeam_Box; // 0x2a0
	UVerticalBox* RedTeam_Entries; // 0x2a8
	UTextBlock* RedTeamPlayerCount_Text; // 0x2b0
	UTextBlock* RedTeamText; // 0x2b8
	UTextBlock* SWAT_Score_Text; // 0x2c0
	UTextBlock* TimeRemaining_Text; // 0x2c8
	UW_ScoreboardEntry_C* W_ScoreboardEntry_2; // 0x2d0
	UW_ScoreboardEntry_C* W_ScoreboardEntry_3; // 0x2d8
	UW_ScoreboardEntry_C* W_ScoreboardEntry_4; // 0x2e0
	UW_ScoreboardEntry_C* W_ScoreboardEntry_5; // 0x2e8
	UW_ScoreboardEntry_C* W_ScoreboardEntry_6; // 0x2f0
	UW_ScoreboardEntry_C* W_ScoreboardEntry_7; // 0x2f8
	UW_ScoreboardEntry_C* W_ScoreboardEntry_8; // 0x300
	UW_ScoreboardEntry_C* W_ScoreboardEntry_9; // 0x308
	UW_ScoreboardEntry_C* W_ScoreboardEntry_10; // 0x310
	UW_ScoreboardEntry_C* W_ScoreboardEntry_11; // 0x318
	UW_ScoreboardEntry_C* W_ScoreboardEntry_12; // 0x320
	UW_ScoreboardEntry_C* W_ScoreboardEntry_13; // 0x328
	UW_ScoreboardEntry_C* W_ScoreboardEntry_14; // 0x330
	UW_ScoreboardEntry_C* W_ScoreboardEntry_15; // 0x338
	UW_ScoreboardEntry_C* W_ScoreboardEntry_16; // 0x340
	UW_ScoreboardEntry_C* W_ScoreboardEntry_17; // 0x348
	UW_ScoreboardEntry_C* W_ScoreboardEntry_18; // 0x350
	UW_ScoreboardEntry_C* W_ScoreboardEntry_19; // 0x358
	UW_ScoreboardEntry_C* W_ScoreboardEntry_20; // 0x360
	UW_ScoreboardEntry_C* W_ScoreboardEntry_130; // 0x368
	UW_ScoreboardHeader_C* W_ScoreboardHeader; // 0x370
	UW_TeamStatus_C* W_TeamStatus; // 0x378
	UW_TeamStatus_C* W_TeamStatus_2; // 0x380
	TArray<UW_ScoreboardEntry_C*> BlueTeamEntryWidgets; // 0x388
	TArray<UW_ScoreboardEntry_C*> RedTeamEntryWidgets; // 0x398
	bool bPreviewMode; // 0x3a8
};

struct UW_Briefing_AudioControls_Button_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Hover; // 0x268
	UW_Button_C* btn_Play; // 0x270
	UImage* img_Icon; // 0x278
	UW_Text_C* txt_Label; // 0x280
	bool Active; // 0x288
	bool Hovered; // 0x289
	bool FlipIcon(Horiz); // 0x28a
	FText LabelText; // 0x290
