namespace off {
	constexpr auto GNames = 0x2cec03c;
	constexpr auto GObjects = 0x2cec0ac;
}
struct UCameraAnimInst {
	ObjectProperty CamAnim; // 0x60
	ObjectProperty InterpGroupInst; // 0x68
	float CurTime; // 0x70
	char bLooping : 1; // 0x74
	char bFinished : 1; // 0x74
	char bAutoReleaseWhenFinished : 1; // 0x74
	char bBlendingIn : 1; // 0x74
	char bBlendingOut : 1; // 0x74
	float BlendInTime; // 0x78
	float BlendOutTime; // 0x7c
	float CurBlendInTime; // 0x80
	float CurBlendOutTime; // 0x84
	float PlayRate; // 0x88
	float BasePlayScale; // 0x8c
	float TransientScaleModifier; // 0x90
	float CurrentBlendWeight; // 0x94
	float RemainingTime; // 0x98
	ObjectProperty MoveTrack; // 0x9c
	ObjectProperty MoveInst; // 0xa4
	ObjectProperty SourceAnimNode; // 0xac
	ECameraAnimPlaySpace PlaySpace; // 0xb4
	FMatrix UserPlaySpaceMatrix; // 0xc0
	FPostProcessSettings LastPPSettings; // 0x100
	float LastPPSettingsAlpha; // 0x280
	FVector LastCameraLoc; // 0x284
};

struct UUIData_Quest {
	int32_t m_nQuestId; // 0x60
	Fdword m_dwActivityId; // 0x64
	Fdword m_dwPrevActivityId; // 0x68
	Fdword m_dwGroupingNumber; // 0x6c
	Fdword m_eStatus; // 0x70
	FQWord m_dtReceivedDatetime; // 0x74
	char m_bIsDirty : 1; // 0x7c
	char m_bHasSeen : 1; // 0x7c
	char m_bIsNew : 1; // 0x7c
	char m_bCanAbandon : 1; // 0x7c
	char m_bCompletionAck : 1; // 0x7c
	char m_bGoalsInitialized : 1; // 0x7c
	QuestType m_eQuestType; // 0x80
	TArray<ObjectProperty> m_Goals; // 0x84
};

struct UUIComponent_AcquisitionCarousel {
	ObjectProperty m_mcLeftArrow; // 0x140
	ObjectProperty m_mcRightArrow; // 0x148
	ObjectProperty m_mcLeftButtonPrompt; // 0x150
	ObjectProperty m_mcRightButtonPrompt; // 0x158
	TArray<FUIAcquiredItem> m_CarouselItems; // 0x160
	TArray<ObjectProperty> m_mcNavDots; // 0x170
	int32_t m_nIndex; // 0x180
	float m_fNavDotCenter; // 0x184
	TArray<int32_t> m_ItemIdList; // 0x188
	TArray<int32_t> m_ItemQuantityList; // 0x198
	float m_fDotPlacementX; // 0x1a8
	float m_fDotWidth; // 0x1ac
	float m_fDotPadding; // 0x1b0
};

struct UTgInventoryObject_Listen_ActiveWhileDeployableInactive {
	int32_t m_nActiveDeployableCount; // 0xcc
};

struct UUIDataProvider_OnlineFriendMessages {
	TArray<FOnlineFriendMessage> Messages; // 0x74
	FString SendingPlayerNameCol; // 0x84
	FString bIsFriendInviteCol; // 0x94
	FString bWasAcceptedCol; // 0xa4
	FString bWasDeniedCol; // 0xb4
	FString MessageCol; // 0xc4
	FString LastInviteFrom; // 0xd4
};

struct AGameCrowdAgent {
	FPointer VfTable_IInterface_RVO; // 0x288
	ObjectProperty MyGroup; // 0x290
	FVector PreferredVelocity; // 0x298
	FVector PendingVelocity; // 0x2a4
	ObjectProperty CurrentDestination; // 0x2b0
	ObjectProperty BehaviorDestination; // 0x2b8
	ObjectProperty PreviousDestination; // 0x2c0
	float InterpZTranslation; // 0x2c8
	int32_t Health; // 0x2cc
	float DeadBodyDuration; // 0x2d0
	ComponentProperty LightEnvironment; // 0x2d4
	int32_t ConformTraceFrameCount; // 0x2dc
	TArray<FNearbyDynamicItem> NearbyDynamics; // 0x2e0
	char bUniformScale : 1; // 0x2f0
	char bCheckForObstacles : 1; // 0x2f0
	char bUseNavMeshPathing : 1; // 0x2f0
	char bWantsSeePlayerNotification : 1; // 0x2f0
	char bAllowPitching : 1; // 0x2f0
	char bHitObstacle : 1; // 0x2f0
	char bBadHitNormal : 1; // 0x2f0
	char bSimulateThisTick : 1; // 0x2f0
	char bPotentialEncounter : 0; // 0x2f0
	char bIsPanicked : 0; // 0x2f0
	char bWantsGroupIdle : 0; // 0x2f0
	char bPreferVisibleDestination : 0; // 0x2f0
	char bPreferVisibleDestinationOnSpawn : 0; // 0x2f0
	char bHasNotifiedSpawner : 0; // 0x2f0
	char bIsInSpawnPool : 0; // 0x2f0
	char bPaused : 0; // 0x2f0
	EConformType ConformType; // 0x2f4
	float ConformTraceDist; // 0x2f8
	int32_t ConformTraceInterval; // 0x2fc
	int32_t CurrentConformTraceInterval; // 0x300
	float LastGroundZ; // 0x304
	float AwareRadius; // 0x308
	float AvoidOtherRadius; // 0x30c
	TArray<FAvoidOtherSampleItem> AvoidOtherSampleList; // 0x310
	float PENALTY_COEFF_ANGLETOGOAL; // 0x320
	float PENALTY_COEFF_ANGLETOVEL; // 0x324
	float PENALTY_COEFF_MAG; // 0x328
	float MIN_PENALTY_THRESHOLD; // 0x32c
	float LastProgressTime; // 0x330
	float LastFallbackActiveTime; // 0x334
	float MaxPathLaneValue; // 0x338
	float CurrentPathLaneValue; // 0x33c
	int32_t ExtraPathCost; // 0x340
	float RotateToTargetSpeed; // 0x344
	float MaxYawRate; // 0x348
	FVector MeshMinScale3D; // 0x34c
	FVector MeshMaxScale3D; // 0x358
	float EyeZOffset; // 0x364
	float ProximityLODDist; // 0x368
	float VisibleProximityLODDist; // 0x36c
	FVector LastKnownGoodPosition; // 0x370
	float GroundOffset; // 0x37c
	FVector IntermediatePoint; // 0x380
	FVector SearchExtent; // 0x38c
	UNavigationHandle* NavigationHandleClass; // 0x398
	ObjectProperty NavigationHandle; // 0x3a0
	int32_t ObstacleCheckCount; // 0x3a8
	float WalkableFloorZ; // 0x3ac
	float LastPathingAttempt; // 0x3b0
	float LastUpdateTime; // 0x3b4
	float NotVisibleLifeSpan; // 0x3b8
	ObjectProperty MyArchetype; // 0x3bc
	float MaxWalkingSpeed; // 0x3c4
	float MaxRunningSpeed; // 0x3c8
	float MaxSpeed; // 0x3cc
	TArray<FRecentInteraction> RecentInteractions; // 0x3d0
	float BeaconMaxDist; // 0x3e0
	FVector BeaconOffset; // 0x3e4
	ObjectProperty BeaconTexture; // 0x3f0
	FLinearColor BeaconColor; // 0x3f8
	ObjectProperty AmbientSoundCue; // 0x408
	ComponentProperty AmbientSoundComponent; // 0x410
	ObjectProperty CurrentBehavior; // 0x418
	float CurrentBehaviorActivationTime; // 0x420
	TArray<FBehaviorEntry> EncounterAgentBehaviors; // 0x424
	TArray<FBehaviorEntry> SeePlayerBehaviors; // 0x434
	float MaxSeePlayerDistSq; // 0x444
	float SeePlayerInterval; // 0x448
	TArray<FBehaviorEntry> SpawnBehaviors; // 0x44c
	TArray<FBehaviorEntry> UneasyBehaviors; // 0x45c
	TArray<FBehaviorEntry> AlertBehaviors; // 0x46c
	TArray<FBehaviorEntry> PanicBehaviors; // 0x47c
	TArray<FBehaviorEntry> RandomBehaviors; // 0x48c
	TArray<FBehaviorEntry> TakeDamageBehaviors; // 0x49c
	float RandomBehaviorInterval; // 0x4ac
	float ForceUpdateTime; // 0x4b0
	float ReachThreshold; // 0x4b4
	TArray<FBehaviorEntry> GroupWaitingBehaviors; // 0x4b8
	float DesiredGroupRadius; // 0x4c8
	float DesiredGroupRadiusSq; // 0x4cc
	float MaxLOSLifeDistanceSq; // 0x4d0
	TScriptInterface<Class> MySpawner; // 0x4d4
	FVector SpawnOffset; // 0x4e4
	float InitialLastRenderTime; // 0x4f0
	FColor DebugAgentColor; // 0x4f4
	ObjectProperty DebugSpawnDest; // 0x4f8
};

struct UUIData_Queue {
	TArray<Fdword> dwQueues; // 0x60
	int32_t nForcedBotId; // 0x70
	EUIDQCallToAction eCTA; // 0x74
	char bSelected : 1; // 0x78
};

struct UPComPositionHistoryServerComponent {
	int32_t CurrentIndex; // 0x88
	float ServerTimeStamps[0x1e]; // 0x8c
	float ClientTimeStamps[0x1e]; // 0x104
	FVector Positions[0x1e]; // 0x17c
	FVector Velocities[0x1e]; // 0x2e4
	FRotator Rotations[0x1e]; // 0x44c
	char bJustTeleported[0x1e]; // 0x5b4
	char bCollideActors[0x1e]; // 0x5d2
	char bBlockActors[0x1e]; // 0x5f0
	EPhysics Physics[0x1e]; // 0x60e
};

struct UTgAnimNodeEmoteSequence {
	EEmote ActiveEmote; // 0x1bc
	float BlendSpeed; // 0x1c0
	char InterpWeights : 1; // 0x1c4
};

struct ATgStartPoint {
	int32_t m_nMapObjectId; // 0x388
	int32_t m_nStartGroup; // 0x38c
	int32_t m_nReturnMapType; // 0x390
	float m_fStartRating; // 0x394
	float m_fCurrentRating; // 0x398
	float m_fResetRating; // 0x39c
	float m_fDecreaseRate; // 0x3a0
	TArray<ATgTeleporter*> m_ArrayOfFloats; // 0x3a4
	ObjectProperty m_TgTeleporter; // 0x3b4
};

struct UNavMeshGoal_WithinDistanceEnvelope {
	float MaxDistance; // 0x7c
	float MinDistance; // 0x80
	float MinTraversalDist; // 0x84
	FVector EnvelopeTestPoint; // 0x88
};

struct UMorphNodeMultiPose {
	TArray<ObjectProperty> Targets; // 0x74
	TArray<FName> MorphNames; // 0x84
	TArray<float> Weights; // 0x94
};

struct UTgAIBehaviorAction_UseAltFire {
	TG_EQUIP_POINT DeviceToUse; // 0x94
	char Start : 1; // 0x98
};

struct USVehicleSimCar {
	float ChassisTorqueScale; // 0xc0
	FInterpCurveFloat MaxSteerAngleCurve; // 0xc4
	float SteerSpeed; // 0xd8
	float ReverseThrottle; // 0xdc
	float EngineBrakeFactor; // 0xe0
	float MaxBrakeTorque; // 0xe4
	float StopThreshold; // 0xe8
	char bIsDriving : 1; // 0xec
	float ActualSteering; // 0xf0
	float TimeSinceThrottle; // 0xf4
};

struct UAnalyticEventsBase {
	char bSessionInProgress : 1; // 0x80
	char bAutoStartSession : 1; // 0x80
	int32_t SessionPauseThresholdSec; // 0x84
	FString UserId; // 0x88
};

struct ATgLobbyHUD {
	char m_bCurrentlyQueuedForInitialTutorial : 1; // 0x62c
	char m_bJoiningTraining : 1; // 0x62c
	char m_bShouldResetCamera : 1; // 0x62c
	int32_t m_nQueue; // 0x630
	int32_t m_nQueueState; // 0x634
	int32_t m_nLobbyState; // 0x638
	int32_t m_nPlayerState; // 0x63c
	int32_t m_nModelPose; // 0x640
	int32_t m_nModelSkin; // 0x644
	int32_t m_nModelHead; // 0x648
	int32_t m_nModelClass; // 0x64c
	int32_t m_nModelDevice; // 0x650
	int32_t m_nModelDeviceSkin; // 0x654
	int32_t m_nModelContrailSkin; // 0x658
	ObjectProperty c_CurrentCamera; // 0x65c
	TArray<FString> m_sAdditionalNeededScenes; // 0x664
	TArray<int32_t> m_CTAItemIds; // 0x674
	FString m_PlayerCTAName; // 0x684
	FString m_SavedLoginVersion; // 0x694
	FString m_LastLoginVersion; // 0x6a4
	ObjectProperty m_FrontLinePedestalMeshActor; // 0x6b4
	ObjectProperty m_FlankPedestalMeshActor; // 0x6bc
	ObjectProperty m_SupportPedestalMeshActor; // 0x6c4
	ObjectProperty m_DamagerPedestalMeshActor; // 0x6cc
	float m_fOriginalCollisionHeight; // 0x6d4
	float m_fOriginalCollisionRadius; // 0x6d8
};

struct UTgAIBehaviorCondition_DistanceFromSelectedTarget {
	char bMustBeEnemy : 1; // 0x9c
	char bIgnoreTaskforce : 1; // 0x9c
	ETargetSelector TargetSelector; // 0xa0
	ECombatTargetType TargetType; // 0xa1
	int32_t DeployableId; // 0xa4
};

struct UUIComponent_CustomPlayer {
	ObjectProperty m_pCrossplayIcon; // 0x120
	ObjectProperty m_pPlayerAvatar; // 0x128
	ObjectProperty m_mcName; // 0x130
	ObjectProperty m_mcTitle; // 0x138
	ObjectProperty m_mcTaskforce; // 0x140
};

struct UTgAnimNodeBlendByKnockdown {
	char m_bAdjustPlayRateByVelocity : 1; // 0x168
	float m_fVelocityMultiplier; // 0x16c
	float m_PreviewVelocity; // 0x170
	ObjectProperty m_TgPawn; // 0x174
	FName m_FaceDownAnimName; // 0x17c
	FName m_FaceUpAnimName; // 0x184
	FName m_FaceDownRecoverAnimName; // 0x18c
	FName m_FaceUpRecoverAnimName; // 0x194
};

struct UTgAimAssistKeyframe {
	FName KeyframeName; // 0x60
	FRawDistributionFloat AimAssistCurve; // 0x68
	char bMirrored : 1; // 0x8c
};

struct UTgGameDC_Effect {
	int32_t m_nGroup; // 0x16c
	int32_t m_nIcon; // 0x170
	int32_t m_bBuff; // 0x174
	int32_t m_bActive; // 0x178
	int32_t m_nStacks; // 0x17c
	float m_fTimer; // 0x180
	FString m_sIcon; // 0x184
	FString m_sName; // 0x194
	FString m_sDescription; // 0x1a4
	ObjectProperty m_lifeTimer; // 0x1b4
};

struct URB_ConstraintSetup {
	FName JointName; // 0x60
	FName ConstraintBone1; // 0x68
	FName ConstraintBone2; // 0x70
	FVector Pos1; // 0x78
	FVector PriAxis1; // 0x84
	FVector SecAxis1; // 0x90
	FVector Pos2; // 0x9c
	FVector PriAxis2; // 0xa8
	FVector SecAxis2; // 0xb4
	FVector PulleyPivot1; // 0xc0
	FVector PulleyPivot2; // 0xcc
	char bEnableProjection : 1; // 0xd8
	char m_bBreakOnOwnersDeath : 1; // 0xd8
	char m_bDoBreak : 1; // 0xd8
	char bLinearLimitSoft : 1; // 0xd8
	char bLinearBreakable : 1; // 0xd8
	char bSwingLimited : 1; // 0xd8
	char bTwistLimited : 1; // 0xd8
	char bSwingLimitSoft : 1; // 0xd8
	char bTwistLimitSoft : 0; // 0xd8
	char bAngularBreakable : 0; // 0xd8
	char bIsPulley : 0; // 0xd8
	char bMaintainMinDistance : 0; // 0xd8
	FLinearDOFSetup LinearXSetup; // 0xdc
	FLinearDOFSetup LinearYSetup; // 0xe4
	FLinearDOFSetup LinearZSetup; // 0xec
	float LinearLimitStiffness; // 0xf4
	float LinearLimitDamping; // 0xf8
	float LinearBreakThreshold; // 0xfc
	float Swing1LimitAngle; // 0x100
	float Swing2LimitAngle; // 0x104
	float TwistLimitAngle; // 0x108
	float SwingLimitStiffness; // 0x10c
	float SwingLimitDamping; // 0x110
	float TwistLimitStiffness; // 0x114
	float TwistLimitDamping; // 0x118
	float AngularBreakThreshold; // 0x11c
	float PulleyRatio; // 0x120
};

struct USoundNodeEnveloper {
	float LoopStart; // 0x74
	float LoopEnd; // 0x78
	float DurationAfterLoop; // 0x7c
	int32_t LoopCount; // 0x80
	char bLoopIndefinitely : 1; // 0x84
	char bLoop : 1; // 0x84
	ComponentProperty VolumeInterpCurve; // 0x88
	ComponentProperty PitchInterpCurve; // 0x90
};

struct UUIScene_UIPopupPartyManager {
	ObjectProperty m_pCloseButton; // 0x154
	ObjectProperty m_pBlocker; // 0x15c
	ObjectProperty m_pList; // 0x164
	TArray<ObjectProperty> m_mcTitle; // 0x16c
	ObjectProperty m_pSelectAllAction; // 0x17c
	ObjectProperty m_pPromptInviteByNameKeyboardAction; // 0x184
	ObjectProperty m_pPromptInviteByNameGamePadAction; // 0x18c
	ObjectProperty m_pPromptAddByNameKeyboardAction; // 0x194
	ObjectProperty m_pPromptAddByNameGamePadAction; // 0x19c
};

struct UTgSeqAct_ForceClientTutorialAction {
	eForcedClientTutorialAction ForcedAction; // 0x108
	eTutorialForceableElements GameUIElement; // 0x109
};

struct UUIComponent_Item_Card {
	ObjectProperty m_mcCooldown; // 0x18c
	ObjectProperty m_mcChampion; // 0x194
	ObjectProperty m_mcChampionIcon; // 0x19c
	ObjectProperty m_mcRank; // 0x1a4
	ObjectProperty m_mcRarity; // 0x1ac
	ObjectProperty m_mcProgressBack; // 0x1b4
	ObjectProperty m_pProgress; // 0x1bc
	char m_bShowChampion : 1; // 0x1c4
	int32_t m_nQuantityOverride; // 0x1c8
	float m_fAnimationProgress; // 0x1cc
	int32_t m_nLastCachedLevel; // 0x1d0
};

struct ATgProj_DemonTeleport {
	char m_bStopped : 1; // 0x51c
	char m_bTriggerExplosion : 1; // 0x51c
};

struct UUIComponent_DailyRewardDay {
	ObjectProperty m_mcIcon; // 0x120
	ObjectProperty m_mcDayTF; // 0x128
	ObjectProperty m_mcCheckmark; // 0x130
};

struct UTgInventoryObject_Listen_UseWhileCCed {
	char m_bIsActive : 1; // 0xd0
};

struct UTgAnimBlendByTeleportBeacon {
	char m_bDeployed : 1; // 0x168
};

struct UTgAIBehaviorNode {
	ObjectProperty Parent; // 0x64
	float InvTickFrequency; // 0x6c
	FString TitleName; // 0x70
	FString FriendlyName; // 0x80
	char bShownInMenu : 1; // 0x90
};

struct ATgGame {
	UObject* m_ContentPackageReference; // 0x4dc
	GAME_WIN_STATE m_GameWinState; // 0x4e4
	TG_GAME_TYPE m_GameType; // 0x4e5
	float m_fSpawnProtectionTime; // 0x4e8
	float m_fMaxRepawnTime; // 0x4ec
	float m_fUnpauseCountdownRemaining; // 0x4f0
	int32_t s_nBotPlayerCount; // 0x4f4
	char s_bSpawnOfflinePawns : 1; // 0x4f8
	char s_bGameInitialized : 1; // 0x4f8
	char s_bGameEndMissionProcessed : 1; // 0x4f8
	char s_bMissionSealed : 1; // 0x4f8
	char m_bForceUsePRISpawnPoint : 1; // 0x4f8
	char m_bRewardCalculated : 1; // 0x4f8
	char m_bStatsCanTie : 1; // 0x4f8
	char m_bStatsIsSymmetric : 1; // 0x4f8
	char m_bIsTutorialGametype : 0; // 0x4f8
	char m_bIsPracticeGametype : 0; // 0x4f8
	char m_bEnableHeadShots : 0; // 0x4f8
	char m_bAlliances : 0; // 0x4f8
	char m_bPlayOfTheGameLocked : 0; // 0x4f8
	char m_bSpawnDisconnectedPlayersStunned : 0; // 0x4f8
	char m_bPlayersCanOnlyDieOnce : 0; // 0x4f8
	char m_bUseKillEmotes : 0; // 0x4f8
	char m_bNotifyKillCombos : 0; // 0x4f8
	char m_bFirstBloodAwarded : 0; // 0x4f8
	int32_t s_nNextActorInstanceId; // 0x4fc
	int32_t s_nNextProjectileInstanceId; // 0x500
	TArray<ObjectProperty> s_AIVolumes; // 0x504
	TArray<int32_t> s_Taskforce1AIVolumesIndices; // 0x514
	TArray<int32_t> s_Taskforce2AIVolumesIndices; // 0x524
	TArray<ObjectProperty> s_FortressVolumes; // 0x534
	TMap<None, None> s_AIAnnotations; // 0x544
	TArray<ObjectProperty> s_DeviceVolumes; // 0x58c
	TArray<ObjectProperty> s_ActorFactories; // 0x59c
	float s_fXPModifier; // 0x5ac
	float m_fGlobalCooldownTime; // 0x5b0
	TArray<int32_t> m_ClientLogins; // 0x5b4
	float m_fOcclusionCalcPeriod; // 0x5c4
	float m_fOcclusionMaxDeviation; // 0x5c8
	float m_fReadyPercent; // 0x5cc
	FPlayOfTheGameInfo m_PlayOfTheGame; // 0x5d0
	float m_fPlayOfTheGameLength; // 0x5dc
	float m_fPlayOfTheGameIntroBufferLength; // 0x5e0
	float m_fPlayOfTheGameOuttroBufferLength; // 0x5e4
	TArray<FPlayOfTheGameEventConfig> m_PlayOfTheGameEventConfigs; // 0x5e8
	TArray<ObjectProperty> m_PlayerSpawnExits; // 0x5f8
	TArray<ObjectProperty> m_ReadyPlayers; // 0x608
	TArray<FCachedTalentTree> s_TalentTrees; // 0x618
};

struct UPhysicsAsset {
	TArray<ObjectProperty> BodySetup; // 0x60
	FMap_Mirror BodySetupIndexMap; // 0x70
	TArray<int32_t> BoundsBodies; // 0xb8
	TArray<ObjectProperty> ConstraintSetup; // 0xc8
	ObjectProperty DefaultInstance; // 0xd8
};

struct UAnimSet {
	char bAnimRotationOnly : 1; // 0x60
	char m_bUsesHandIK : 1; // 0x60
	char m_bCompressOutFacialBones : 1; // 0x60
	char m_bHasStrippedBones : 1; // 0x60
	TArray<FName> TrackBoneNames; // 0x64
	TArray<ObjectProperty> Sequences; // 0x74
	TMap<None, None> SequenceCache; // 0x84
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0xcc
	TArray<char> BoneUseAnimTranslation; // 0xdc
	TArray<char> ForceUseMeshTranslation; // 0xec
	TArray<FName> UseTranslationBoneNames; // 0xfc
	TArray<FName> ForceMeshTranslationBoneNames; // 0x10c
	FName PreviewSkelMeshName; // 0x11c
	FName BestRatioSkelMeshName; // 0x124
	TArray<FName> m_FacialFilteredBones; // 0x12c
};

struct UTgAnimMetaData_MICScalarParameterExtended {
	char bSearchSelf : 1; // 0x8c
	char bSearchSiblings : 1; // 0x8c
	char bSearchChildren : 1; // 0x8c
	char bIncludeSearchParticles : 1; // 0x8c
	char bIncludeSearchMeshes : 1; // 0x8c
	char bForceAllMaterials : 1; // 0x8c
	char bFindAllMatchingMaterials : 1; // 0x8c
	char bHasSetMICs : 1; // 0x8c
	ObjectProperty MaterialToFind; // 0x90
	ObjectProperty MaterialToReplace; // 0x98
	TArray<FAlternateMaterialOverride> AlternateMaterialList; // 0xa0
	TArray<FName> TexturesToHarvest; // 0xb0
	TArray<FSwappedMeshResetInfo> MaterialsToReset; // 0xc0
	TArray<ObjectProperty> CurrentModifiedMICs; // 0xd0
};

struct UTgAnimBlendBy1P3P {
	ObjectProperty m_TgPawn; // 0x168
};

struct ATgSkeletalMeshActor_Posture {
	TG_POSTURE r_CurrentPosture; // 0x2e8
	TArray<ObjectProperty> m_PostureBlendNodes; // 0x2ec
};

struct ATgDevice_HexaFire {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xaf4
	FVector m_vProjectileSpawnOffset2; // 0xafc
	char m_bFireLeftWeapon : 1; // 0xb08
};

struct UFracturedBaseComponent {
	FPointer ComponentBaseResources; // 0x310
	FRenderCommandFence_Mirror ReleaseResourcesFence; // 0x318
	TArray<char> VisibleFragments; // 0x31c
	char bVisibilityHasChanged : 1; // 0x32c
	char bVisibilityReset : 1; // 0x32c
	char bInitialVisibilityValue : 1; // 0x32c
	char bUseDynamicIndexBuffer : 1; // 0x32c
	char bUseDynamicIBWithHiddenFragments : 1; // 0x32c
	int32_t NumResourceIndices; // 0x330
	int32_t bResetStaticMesh; // 0x334
};

struct UTgControlModule {
	ObjectProperty Controller; // 0x60
	char m_bIsActive : 1; // 0x68
};

struct UUIData_PopupInput {
	FPointer VfTable_ITgCallbackInterface; // 0x60
	FString sTitle[0x2]; // 0x68
	FString sButtonName[0x2]; // 0x88
	FPointer pButtonValidate[0x2]; // 0xa8
	ObjectProperty m_CallbackContainer; // 0xb8
};

struct UUIScene {
	TArray<FUIAnimData> m_AnimObjects; // 0x120
	TArray<ObjectProperty> m_Interactables; // 0x130
	TArray<ObjectProperty> m_FocusedGroupStack; // 0x140
	char m_bAllowDuplicateData : 1; // 0x150
	char m_bUninitializing : 1; // 0x150
};

struct UTgDeviceForm_Vine {
	char m_bBeamActive : 1; // 0x2bc
	char m_bVineInterrupted : 1; // 0x2bc
	ObjectProperty m_BeamTarget; // 0x2c0
	FVector m_vBeamTargetLocation; // 0x2c8
	TArray<ObjectProperty> m_VineBlendList1P; // 0x2d4
	TArray<ObjectProperty> m_VineBlendList3P; // 0x2e4
};

struct UMorphNodeWeightByBoneAngle {
	float Angle; // 0x84
	float NodeWeight; // 0x88
	FName BaseBoneName; // 0x8c
	EAxis BaseBoneAxis; // 0x94
	EAxis AngleBoneAxis; // 0x95
	char bInvertBaseBoneAxis : 1; // 0x98
	char bInvertAngleBoneAxis : 1; // 0x98
	char bControlMaterialParameter : 1; // 0x98
	FName AngleBoneName; // 0x9c
	int32_t MaterialSlotId; // 0xa4
	FName ScalarParameterName; // 0xa8
	ObjectProperty MaterialInstanceConstant; // 0xb0
	TArray<FBoneAngleMorph> WeightArray; // 0xb8
};

struct UPBRuleNodeWindowWall {
	float CellMaxSizeX; // 0x70
	float CellMaxSizeZ; // 0x74
	float WindowSizeX; // 0x78
	float WindowSizeZ; // 0x7c
	float WindowPosX; // 0x80
	float WindowPosZ; // 0x84
	char bScaleWindowWithCell : 1; // 0x88
	float YOffset; // 0x8c
	ObjectProperty Material; // 0x90
};

struct UUIComponent_PlayerContextMenu {
	ObjectProperty m_mcFrame; // 0x120
	ObjectProperty m_pOptionsList; // 0x128
	ObjectProperty m_pBlocker; // 0x130
};

struct UUIComponent_PlayPanel {
	ObjectProperty m_mcFade; // 0x120
	ObjectProperty m_mcIcon; // 0x128
	ObjectProperty m_mcTitle; // 0x130
	ObjectProperty m_mcSubtitle; // 0x138
	ObjectProperty m_mcDelayText; // 0x140
	ObjectProperty m_mcModeCTA; // 0x148
	ObjectProperty m_mcFWOTDIcon; // 0x150
	ObjectProperty m_mcQuestCTA; // 0x158
	ObjectProperty m_mcCheckbox; // 0x160
	ObjectProperty m_mcModeTypeTF; // 0x168
	ObjectProperty m_mcFWOTDText; // 0x170
	ObjectProperty m_mcAchievements; // 0x178
	ObjectProperty m_mcLock; // 0x180
	ObjectProperty m_mcLockNew; // 0x188
	ObjectProperty m_mcLockInfo; // 0x190
	ObjectProperty m_mcLockInfoTF; // 0x198
	ObjectProperty m_mcProgressMask; // 0x1a0
	ObjectProperty m_mcInfoButtonIcon; // 0x1a8
	ObjectProperty m_mcRankedProgress; // 0x1b0
	ObjectProperty m_mcRankedProgressRankTF; // 0x1b8
	ObjectProperty m_mcRankedProgressRankIcon; // 0x1c0
	ObjectProperty m_mcRankedProgressProgressTF; // 0x1c8
	ObjectProperty m_pPanelButton; // 0x1d0
	ObjectProperty m_pInfoButton; // 0x1d8
	ObjectProperty m_pGamepadKey; // 0x1e0
	ObjectProperty m_pQueueOpensCountdown; // 0x1e8
	ObjectProperty m_pRating; // 0x1f0
	ObjectProperty m_pRatingTooltip; // 0x1f8
};

struct UTgInventoryObject_Listen_GiftGiver {
	char m_bHasActivated : 1; // 0xd0
};

struct UTgAudioConversations {
	TArray<FVoxConversation> m_Conversations; // 0x60
	char m_bInitialized : 1; // 0x70
	char m_bTF1Conversed : 1; // 0x70
	char m_bTF2Conversed : 1; // 0x70
	ObjectProperty m_GRI; // 0x74
	int32_t m_nConversationAttemptsRemaining; // 0x7c
};

struct ATgDevice_DreadSerpent {
	char s_bQueueVoodooDeploy : 1; // 0xaec
};

struct UTgDeviceFire {
	ObjectProperty m_Owner; // 0x60
	EWeaponFireType m_nFireType; // 0x68
	DeviceTargetMode m_eTargetingMode; // 0x69
	DeviceTargeterType m_eTargeterType; // 0x6a
	TargetSelectionType m_eTargetSelectionTypeOverride; // 0x6b
	char m_bIsAOE : 1; // 0x6c
	char m_bIsCone : 1; // 0x6c
	char m_bIsLinear : 1; // 0x6c
	char m_bContinuousFire : 1; // 0x6c
	char m_bRequireLOS : 1; // 0x6c
	char m_bVerifyTargetPlacement : 1; // 0x6c
	char m_bAllowMultiplePets : 1; // 0x6c
	char m_bUseAccurateEncroachment : 1; // 0x6c
	char m_bUseTargetingEncroachmentActor : 0; // 0x6c
	char m_bScaleEncroachmentWithRangeMod : 0; // 0x6c
	char m_bPassThroughShield : 0; // 0x6c
	char m_bPassThroughDeployWalls : 0; // 0x6c
	char m_bIgnoreDeployablesForBlocking : 0; // 0x6c
	char m_bAdjustDeployHeightToExtent : 0; // 0x6c
	char m_bDeployOnOwnerLocation : 0; // 0x6c
	char m_bAdjustToGround : 0; // 0x6c
	char m_bSpawnPetOnOwnerLocation : 0; // 0x6c
	char m_bCanTriggerCounter : 0; // 0x6c
	char m_bEnchroachmentFireLOSCheck : 0; // 0x6c
	char m_bEnchroachmentIgnorePitch : 0; // 0x6c
	char m_bEncroachmentDebug : 0; // 0x6c
	char m_bTreatAmmoAsCharges : 0; // 0x6c
	char m_bMaintainBurstTarget : 0; // 0x6c
	char m_bCanTargetStealthedTargets : 0; // 0x6c
	TArray<ObjectProperty> m_EffectGroupList; // 0x70
	TArray<FTgPropertyInstance> m_Properties; // 0x80
	FPointer m_pAmSetup; // 0x90
	FPointer m_pFireModeSetup; // 0x98
	int32_t m_nId; // 0xa0
	int32_t m_nAttackType; // 0xa4
	int32_t m_nMovementType; // 0xa8
	FName m_nmOffhandAnimationType; // 0xac
	int32_t m_nTargetAffectsType; // 0xb4
	int32_t m_nAllowUseWhileFlags; // 0xb8
	int32_t m_nDamageType; // 0xbc
	int32_t m_nArcingJumps; // 0xc0
	FMap_Mirror m_PropertyIndexMap; // 0xc4
	float m_fHealthCost; // 0x10c
	float m_fManaCost; // 0x110
	float m_fEnergyCost; // 0x114
	float m_fFireTime; // 0x118
	float m_fBuildupTime; // 0x11c
	float m_fFirePreHitDelay; // 0x120
	float m_fFirePostHitDelay; // 0x124
	int32_t m_nShotsPerFire; // 0x128
	FName m_nmDamageTypeClass; // 0x12c
	UTgDamageType* m_DamageTypeClass; // 0x134
	int32_t m_nMaxTargetCount; // 0x13c
	float m_fFireLockTime; // 0x140
	float m_fZoomTime; // 0x144
	float m_fZoomFOV; // 0x148
	int32_t m_nAmmoCarriedSize; // 0x14c
	int32_t m_nAmmoClipSize; // 0x150
	float m_fAmmoClipPreReloadTime; // 0x154
	float m_fAmmoClipPostReloadTime; // 0x158
	int32_t m_nAmmoCostPerShot; // 0x15c
	int32_t m_nAmmoEfficiency; // 0x160
	float m_fEncroachmentRayCastVerticalOffset; // 0x164
	int32_t m_nTargetingEncroachmentActorOverride; // 0x168
	ObjectProperty m_TargetingEncroachmentActor; // 0x16c
	FVector m_vActorEncroachmentBaseScale; // 0x174
	FName m_nmWhileFiringCameraAnim; // 0x180
	FRotator m_AdjustToGroundRotationOffset; // 0x188
	TArray<ObjectProperty> m_CachedRechargeBonusFlatAdditive; // 0x194
	TArray<ObjectProperty> m_CachedRechargeBonusFlatSubtractive; // 0x1a4
	TArray<ObjectProperty> m_CachedRechargeBonusPercentAdditive; // 0x1b4
	TArray<ObjectProperty> m_CachedRechargeBonusPercentSubtractive; // 0x1c4
	TArray<ObjectProperty> m_ModifiedEffects; // 0x1d4
	TArray<float> m_BaseValues; // 0x1e4
	TArray<ObjectProperty> m_ModifiedEGLifetimes; // 0x1f4
	TArray<float> m_BaseLifetimes; // 0x204
	TArray<ObjectProperty> m_ModifiedEGAppValues; // 0x214
	TArray<float> m_BaseAppValues; // 0x224
	TArray<ObjectProperty> m_ModifiedEGMaxStacks; // 0x234
	TArray<float> m_BaseMaxStacks; // 0x244
	TArray<ObjectProperty> m_CachedTargetList; // 0x254
	float m_fSelectTargetsExtent; // 0x264
	ObjectProperty m_GameplayCurves; // 0x268
};

struct UUIData_Actor {
	ObjectProperty m_pActor; // 0x60
};

struct UTgGameDC_DeviceList {
	ObjectProperty m_DeviceList[0x19]; // 0x16c
};

struct AStaticMeshCollectionActor {
	TArray<ComponentProperty> StaticMeshComponents; // 0x280
	int32_t MaxStaticMeshComponents; // 0x290
	TArray<ObjectProperty> GCExternalReferences; // 0x294
};

struct UUIComponent_CountdownText {
	int32_t m_nTickHandle; // 0x120
};

struct UTgInventoryObject_Listen_CooldownDelayer {
	float m_fDelayTime; // 0xd0
	TG_FIRE_FX_DUMMY_ON m_FireFxDummyOn; // 0xd4
};

struct AKeypoint {
	ComponentProperty SpriteComp; // 0x280
};

struct UUIDataStore_StringAliasMap {
	TArray<FUIMenuInputMap> MenuInputMapArray; // 0x98
	FMap_Mirror MenuInputSets; // 0xa8
	int32_t PlayerIndex; // 0xf0
};

struct UDistributionFloatConstant {
	float Constant; // 0x7c
};

struct UMaterialExpressionStaticComponentMaskParameter {
	FExpressionInput Input; // 0xd0
	char DefaultR : 1; // 0x104
	char DefaultG : 1; // 0x104
	char DefaultB : 1; // 0x104
	char DefaultA : 1; // 0x104
	FPointer InstanceOverride; // 0x108
};

struct UParticleModuleTypeDataMeshPhysX {
	ObjectProperty PhysXParSys; // 0x84
	EPhysXMeshRotationMethod PhysXRotationMethod; // 0x8c
	float FluidRotationCoefficient; // 0x90
	FPhysXEmitterVerticalLodProperties VerticalLod; // 0x94
	float ZOffset; // 0xa4
};

struct UWindowsClient {
	UAudioDevice* AudioDeviceClass; // 0x224
	int32_t AllowJoystickInput; // 0x264
};

struct ATgDevice_ToggleModeWithLockout {
	ObjectProperty m_CachedInhand; // 0xaf4
};

struct UActorFactoryStaticMesh {
	ObjectProperty StaticMesh; // 0x9c
	FVector DrawScale3D; // 0xa4
};

struct UTgDeviceForm_SpinnerWhileFiring {
	FName m_SpinnerName; // 0x2bc
	char m_bShouldSpinOnFire : 1; // 0x2c4
	TArray<ObjectProperty> m_SpinnerSkelControls1p; // 0x2c8
	TArray<ObjectProperty> m_SpinnerSkelControls3p; // 0x2d8
};

struct UTgDeviceForm_Smash {
	TArray<ObjectProperty> m_SmashBlendList1P; // 0x2bc
	TArray<ObjectProperty> m_SmashBlendList3P; // 0x2cc
};

struct ATgBotFactory_Minions {
	MinionFactoryType m_eFactoryType; // 0x384
	char m_OverrideShouldSpawnSuperMinions : 1; // 0x388
	int32_t m_nWaveNumber; // 0x38c
	int32_t m_nLastBonusWave; // 0x390
	int32_t m_nLanePushersInQueue; // 0x394
	float m_fLastBonusActivationTime; // 0x398
	float m_fSuperMinionEndTime; // 0x39c
};

struct UTgAIBehaviorCondition_NumberDevicesFiring {
	TG_EQUIP_POINT DeviceSlot; // 0x98
	char bMustBeEnemy : 1; // 0x9c
	char bIsFiring : 1; // 0x9c
	int32_t GodThreshold; // 0xa0
	float DistanceThreshold; // 0xa4
};

struct UTgSeqAct_GiveCredits {
	int32_t CreditsToGive; // 0x108
};

struct AStaticMeshActor {
	ComponentProperty StaticMeshComponent; // 0x280
	char bRenderElementsViaProxy : 1; // 0x288
	char bDisableAutoBaseOnProcBuilding : 1; // 0x288
	char bProxy : 1; // 0x288
	char bHiddenByProxy : 1; // 0x288
	char OldCastShadow : 1; // 0x288
	char OldAcceptsLights : 1; // 0x288
	char bCuttingMesh : 1; // 0x288
	ComponentProperty Silhouette; // 0x28c
	TArray<FVertexColorPhysicalMaterialMapping> VertexColorPhysicalMaterialMappings; // 0x294
};

struct UPhysicsAssetInstance {
	ObjectProperty Owner; // 0x60
	int32_t RootBodyIndex; // 0x68
	TArray<ObjectProperty> Bodies; // 0x6c
	TArray<ObjectProperty> Constraints; // 0x7c
	FMap_Mirror CollisionDisableTable; // 0x8c
	float LinearSpringScale; // 0xd4
	float LinearDampingScale; // 0xd8
	float LinearForceLimitScale; // 0xdc
	float AngularSpringScale; // 0xe0
	float AngularDampingScale; // 0xe4
	float AngularForceLimitScale; // 0xe8
	char bInitBodies : 1; // 0xec
	char m_bPreviewBreakingConstraintsOnDeath : 1; // 0xec
};

struct UFogVolumeSphericalDensityComponent {
	float MaxDensity; // 0xe0
	FVector SphereCenter; // 0xe4
	float SphereRadius; // 0xf0
	ComponentProperty PreviewSphereRadius; // 0xf4
};

struct UTgInventoryObject_Listen_Combo_Ruckus {
	int32_t m_nDamageReductionStacks; // 0xd0
	int32_t m_nBonusDamageStacks; // 0xd4
	float m_fDamageReductionStackTime; // 0xd8
	float m_fBonusDamageStackTime; // 0xdc
	char m_bEmitterActive : 1; // 0xe0
	char m_bComboEffectsOn : 1; // 0xe0
	float m_fComboBonusTime; // 0xe4
};

struct UMaterialExpression {
	int32_t EditorX; // 0x60
	int32_t EditorY; // 0x64
	char bRealtimePreview : 1; // 0x68
	char bNeedToUpdatePreview : 1; // 0x68
	char bIsParameterExpression : 1; // 0x68
	char bShowOutputNameOnPin : 1; // 0x68
	char bHidePreviewWindow : 1; // 0x68
	char bShowInputs : 1; // 0x68
	char bShowOutputs : 1; // 0x68
	char bUsedByStaticParameterSet : 1; // 0x68
	ObjectProperty Material; // 0x6c
	ObjectProperty Function; // 0x74
	FString Desc; // 0x7c
	FColor BorderColor; // 0x8c
	TArray<FName> MenuCategories; // 0x90
	TArray<FExpressionOutput> Outputs; // 0xa0
};

struct ATgPointOfInterest {
	int32_t m_nNameMsgId; // 0x380
	FString m_sDebugName; // 0x384
};

struct UMaterialExpressionDotProduct {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct ALiftExit {
	ObjectProperty MyLiftCenter; // 0x378
	char bExitOnly : 1; // 0x380
};

struct ALiftCenter {
	ObjectProperty MyLift; // 0x378
	float MaxDist2D; // 0x380
	FVector LiftOffset; // 0x384
	char bJumpLift : 1; // 0x390
	float CollisionHeight; // 0x394
	ObjectProperty LiftTrigger; // 0x398
};

struct UTgAnimBlendByDirection {
	ObjectProperty m_TgPawn; // 0x168
	EBlendByDirectionSpeedType m_SpeedType; // 0x170
	EBlendDirTypes LastDirection; // 0x171
	char bAdjustRateByVelocity : 1; // 0x174
	char bNoDirectionIsEnabled : 1; // 0x174
	char bResetLooping : 1; // 0x174
	char m_bDelayBlendOutToPlayAnim : 1; // 0x174
	char m_bIsAllowedToBlendOut : 1; // 0x174
	char m_bMirrorDirectionsWhenPawnMirrored : 1; // 0x174
	char m_bStopChildrenOnCeaseRelevant : 1; // 0x174
};

struct UTgAnimBlendByPosture {
	ObjectProperty m_TgPawn; // 0x168
	ObjectProperty m_TgPostureMesh; // 0x170
	TG_POSTURE m_LastPosture; // 0x178
	TG_POSTURE m_CurrentPosture; // 0x179
	TG_POSTURE m_TransitionFromPosture; // 0x17a
	char m_bEnableTransitionAnims : 1; // 0x17c
	char m_bCheckLowerPriorityPostures : 1; // 0x17c
	int32_t m_CurrentPostureChildIndex; // 0x180
	TArray<Fm_PostureProfile> m_PostureProfiles; // 0x184
	ObjectProperty m_TransitionAnimNodeSeq; // 0x194
};

struct ATgDevice_Blink {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xaec
	FVector m_vTeleportLocation; // 0xaf4
};

struct ATgWeaponMeshActor_TyraInhand {
	float m_fWeaponZoomFOV; // 0x504
	float m_fWeaponFOVDefault; // 0x508
	float m_fDoFMultiplier; // 0x50c
};

struct UTgMiniMap {
	int32_t m_nMiniMapMode; // 0x60
	char m_bShouldDisplayMiniMap : 1; // 0x64
	char m_bHasMiniMapTexture : 1; // 0x64
	char m_bRequiresLOS : 1; // 0x64
	char m_bUseFlashSizing : 1; // 0x64
	char m_bSpectating : 1; // 0x64
	float m_fLastUpdateTime; // 0x68
	ObjectProperty m_MiniMapBaseMIC; // 0x6c
	ObjectProperty m_MiniMapMIC; // 0x74
	ObjectProperty m_DynamicMask; // 0x7c
	int32_t m_nMaskSize; // 0x84
	float m_fIconScale; // 0x88
	FVector2D m_vMapLocation; // 0x8c
	int32_t m_nMapSize; // 0x94
	FPointer m_MiniMapRender; // 0x98
	ObjectProperty m_OwnerPC; // 0xa0
	int32_t m_nWorldMapSize; // 0xa8
	ObjectProperty m_MICPinging; // 0xac
	ObjectProperty m_MICPingingEnemy; // 0xb4
	ObjectProperty m_MICRetreat; // 0xbc
	ObjectProperty m_MICRetreatEnemy; // 0xc4
	ObjectProperty m_MICAlert; // 0xcc
	ObjectProperty m_MICAlertEnemy; // 0xd4
	ObjectProperty m_MICAlertSilent; // 0xdc
	ObjectProperty m_MICLocalPlayer; // 0xe4
	ObjectProperty m_MICLocalSpectator; // 0xec
	TArray<ObjectProperty> m_TextureRefs; // 0xf4
	ObjectProperty m_MICPlayer[0x6]; // 0x104
	ObjectProperty m_MICMinion[0x6]; // 0x134
	ObjectProperty m_MICTower[0x6]; // 0x164
	ObjectProperty m_MICTitan[0x6]; // 0x194
	ObjectProperty m_MICPhoenix[0x6]; // 0x1c4
	ObjectProperty m_MICCapturePoint[0x6]; // 0x1f4
	ObjectProperty m_MICLanePusher[0x6]; // 0x224
	ObjectProperty m_MICTowerOlympus[0x3]; // 0x254
	ObjectProperty m_MICTitanOlympus[0x6]; // 0x26c
	ObjectProperty m_MICPhoenixOlympus[0x3]; // 0x29c
	ObjectProperty m_MICMonster; // 0x2b4
	FLinearColor m_PortalLinkColor[0x6]; // 0x2bc
	FBuffMonsterMIC m_MICBuffMonster[0xe]; // 0x31c
	ObjectProperty m_MICTowerDestroyed; // 0x46c
	ObjectProperty m_PlayerBackground[0x6]; // 0x474
	ObjectProperty m_TowerAttackBackground[0x6]; // 0x4a4
	TMap<None, None> m_IconMap; // 0x4d4
	FBitArray_Mirror m_MaskPoints; // 0x51c
	TgMapOrientation m_Orientation; // 0x53c
	TgMapTeam m_LocalTeam; // 0x53d
	char bUpdateCapturePoint[0x5]; // 0x53e
	TMap<None, None> m_EntityMap; // 0x544
	TArray<FLayerIndex> m_PortalLayeringIdx; // 0x58c
	TArray<FLayerIndex> m_LayeringIdx; // 0x59c
	TArray<FMiniMapPingInfo> m_IndependentPings; // 0x5ac
};

struct UUIScene_UIBattlePass {
	ObjectProperty m_pBack; // 0x154
	ObjectProperty m_pTabs; // 0x15c
	ObjectProperty m_pHome; // 0x164
	ObjectProperty m_pChallenges; // 0x16c
	ObjectProperty m_pPicks; // 0x174
};

struct ATgCollisionProxy_Vortex {
	float m_fGroundSpeedStrafePct; // 0x2b4
	float m_fGroundSpeedToVortex; // 0x2b8
	float m_fGroundSpeedPctRetained; // 0x2bc
	float m_fInnerRadius; // 0x2c0
	char m_bEnabled : 1; // 0x2c4
	char m_bOnlyAffectCurrentTarget : 1; // 0x2c4
	ObjectProperty m_LastInstigator; // 0x2c8
};

struct USoundNodeDelay {
	float DelayMin; // 0x74
	float DelayMax; // 0x78
	FRawDistributionFloat DelayDuration; // 0x7c
};

struct UTranslatorTag {
	FName Tag; // 0x60
};

struct ASkeletalMeshActorMAT {
	TArray<ObjectProperty> SlotNodes; // 0x2e8
};

struct UInteractiveFoliageComponent {
	FPointer FoliageSceneProxy; // 0x310
};

struct UTgDevMenuMoviePlayer {
	ObjectProperty m_DevMenu; // 0x2a0
};

struct UMaterialExpressionStaticSwitch {
	char DefaultValue : 1; // 0xb0
	char ExtendedCaptionDisplay : 1; // 0xb0
	FExpressionInput A; // 0xb4
	FExpressionInput B; // 0xe8
	FExpressionInput Value; // 0x11c
};

struct UPBRuleNodeSplit {
	EProcBuildingAxis SplitAxis; // 0x70
	TArray<FRBSplitInfo> SplitSetup; // 0x74
};

struct UTgAnimNodeFitToDuration {
	float Duration; // 0x114
	float OverrideDuration; // 0x118
	char bAllowIncreasedPlayRate : 1; // 0x11c
	char bAllowDecreasedPlayRate : 1; // 0x11c
	char bClampDuration : 1; // 0x11c
	char m_bScaleByReload : 1; // 0x11c
	float ClampedMinDuration; // 0x120
	float ClampedMaxDuration; // 0x124
	TG_EQUIP_POINT m_EquipPoint; // 0x128
	float m_fDurationMultiplier; // 0x12c
};

struct AMutator {
	ObjectProperty NextMutator; // 0x280
	TArray<FString> GroupNames; // 0x288
	char bUserAdded : 1; // 0x298
};

struct UMobileMenuObjectProxy {
	DelegateProperty __OnTouchEvent__Delegate; // 0xdc
	DelegateProperty __OnRenderObject__Delegate; // 0xec
};

struct UTgAnimNodePlayTgCameraAnim {
	ObjectProperty m_CameraShake; // 0x114
	ObjectProperty m_TgPawn; // 0x11c
};

struct UUIData_CustomQueue {
	Fdword m_dwQueueId; // 0x60
	FString m_sDesc; // 0x64
	FString m_sShortDesc; // 0x74
	int32_t m_nTaskforceSize; // 0x84
	int32_t m_nSortOrder; // 0x88
};

struct UUIScene_UIPartyLobby {
	int32_t m_nOnTickCallbackHandle; // 0x154
	ObjectProperty m_mcSearching; // 0x158
	ObjectProperty m_mcSearchingTitle; // 0x160
	ObjectProperty m_mcSearchingSubtitle; // 0x168
	ObjectProperty m_pPlayerList; // 0x170
	ObjectProperty m_pInfoPanel; // 0x178
	ObjectProperty m_pPlayerMenu; // 0x180
	ObjectProperty m_pHoveredPlayer; // 0x188
	ObjectProperty m_pHoveredCustomPlayer; // 0x190
	ObjectProperty m_grInput; // 0x198
	ObjectProperty m_akPlayerReady; // 0x1a0
	ObjectProperty m_akPlayerUnready; // 0x1a8
	ObjectProperty m_akLeave; // 0x1b0
	ObjectProperty m_akMatch; // 0x1b8
};

struct UTgInvListener_CrackShot {
	TArray<FCrackShotBonusDamageTarget> m_Targets; // 0xc8
};

struct UTgSkelCon_Recoil {
	TArray<FRecoilProfile> m_Profiles; // 0x168
	int32_t m_nActiveProfileIndex; // 0x178
};

struct UStaticMeshComponent {
	int32_t ForcedLodModel; // 0x294
	int32_t PreviousLODLevel; // 0x298
	ObjectProperty StaticMesh; // 0x29c
	FColor WireframeColor; // 0x2a4
	char bIgnoreInstanceForTextureStreaming : 1; // 0x2a8
	char bOverrideLightMapResolution : 1; // 0x2a8
	char bOverrideLightMapRes : 1; // 0x2a8
	int32_t OverriddenLightMapResolution; // 0x2ac
	int32_t OverriddenLightMapRes; // 0x2b0
	float OverriddenLODMaxRange; // 0x2b4
	float StreamingDistanceMultiplier; // 0x2b8
	int32_t SubDivisionStepSize; // 0x2bc
	char bUseSubDivisions : 1; // 0x2c0
	char bForceStaticDecals : 1; // 0x2c0
	char bCanHighlightSelectedSections : 1; // 0x2c0
	char bUseSimpleLightmapModifications : 1; // 0x2c0
	ELightmapModificationFunction SimpleLightmapModificationFunction; // 0x2c4
	char bNeverBecomeDynamic : 1; // 0x2c8
	char bForceRenderAsDynamic : 1; // 0x2c8
	TArray<FGuid> IrrelevantLights; // 0x2cc
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x2dc
	int32_t VertexPositionVersionNumber; // 0x2ec
	int32_t ForcedElementIndex; // 0x2f0
	FLightmassPrimitiveSettings LightmassSettings; // 0x2f4
};

struct UTgSkelCon_OscillateRotation {
	float OscillationAmplitude; // 0x100
	float OscillationFrequency; // 0x104
	FVector OscillationAxis; // 0x108
	EBoneControlSpace OscillationAxisSpace; // 0x114
	FName OscillationAxisSpaceBoneName; // 0x118
	float Theta; // 0x120
};

struct UParticleModuleOrbitBase {
	char bUseEmitterTime : 1; // 0x68
};

struct UInterpTrackInstLinearColorProp {
	FPointer ColorProp; // 0x70
	FLinearColor ResetColor; // 0x78
};

struct USequenceOp {
	char bIsActivated : 1; // 0x98
	char bIsCurrentDebuggerOp : 1; // 0x98
	char bActive : 1; // 0x98
	char bLatentExecution : 1; // 0x98
	char bAutoActivateOutputLinks : 1; // 0x98
	char bHaveMovingVarConnector : 1; // 0x98
	char bHaveMovingInputConnector : 1; // 0x98
	char bHaveMovingOutputConnector : 1; // 0x98
	char bPendingVarConnectorRecalc : 0; // 0x98
	char bPendingInputConnectorRecalc : 0; // 0x98
	char bPendingOutputConnectorRecalc : 0; // 0x98
	char bIsBreakpointSet : 0; // 0x98
	char bIsHiddenBreakpointSet : 0; // 0x98
	TArray<FSeqOpInputLink> InputLinks; // 0x9c
	TArray<FSeqOpOutputLink> OutputLinks; // 0xac
	TArray<FSeqVarLink> VariableLinks; // 0xbc
	TArray<FSeqEventLink> EventLinks; // 0xcc
	int32_t PlayerIndex; // 0xdc
	char GamepadID; // 0xe0
	int32_t ActivateCount; // 0xe4
	int32_t SearchTag; // 0xe8
};

struct UTgAchievement_SurgeonGeneral {
	int32_t m_nHealing; // 0x90
};

struct UDistributionVectorUniform {
	FVector Max; // 0x7c
	FVector Min; // 0x88
	char bLockAxes : 1; // 0x94
	char bUseExtremes : 1; // 0x94
	EDistributionVectorLockFlags LockedAxes; // 0x98
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x99
};

struct ATgProj_Loogie {
	char m_bWasExplodedByRocket : 1; // 0x51c
	char m_bIgnoreRocketOwner : 1; // 0x51c
};

struct UMaterialInstanceConstant {
	TArray<FFontParameterValue> FontParameterValues; // 0x2f4
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x304
	TArray<FTextureParameterValue> TextureParameterValues; // 0x314
	TArray<FVectorParameterValue> VectorParameterValues; // 0x324
	TArray<FMICStateParams> StateParameters; // 0x334
};

struct UInterpTrackInstSlomo {
	float OldTimeDilation; // 0x60
};

struct UGameViewportClient {
	FPointer VfTable_FExec; // 0x68
	FPointer Viewport; // 0x70
	FPointer ViewportFrame; // 0x78
	TArray<ObjectProperty> GlobalInteractions; // 0x80
	UUIInteraction* UIControllerClass; // 0x90
	ObjectProperty UIController; // 0x98
	ObjectProperty ViewportConsole; // 0xa0
	FExportShowFlags_Mirror ShowFlags; // 0xa8
	FString LoadingMessage; // 0xb8
	FString SavingMessage; // 0xc8
	FString ConnectingMessage; // 0xd8
	FString PausedMessage; // 0xe8
	FString PrecachingMessage; // 0xf8
	char bShowTitleSafeZone : 1; // 0x108
	char bDisplayHardwareMouseCursor : 1; // 0x108
	char bOverrideDiffuseAndSpecular : 1; // 0x108
	char bIsPlayInEditorViewport : 1; // 0x108
	char bShowSystemMouseCursor : 1; // 0x108
	char bDisableWorldRendering : 1; // 0x108
	char bCapturedWorldRendering : 1; // 0x108
	char bDebugNoGFxUI : 1; // 0x108
	FTitleSafeZoneArea TitleSafeZone; // 0x10c
	TArray<FSplitscreenData> SplitscreenInfo; // 0x11c
	ESplitScreenType DesiredSplitscreenType; // 0x12c
	ESplitScreenType ActiveSplitscreenType; // 0x12d
	ESplitScreenType Default2PSplitType; // 0x12e
	ESplitScreenType Default3PSplitType; // 0x12f
	FString ProgressMessage[0x2]; // 0x130
	float ProgressTimeOut; // 0x150
	float ProgressFadeTime; // 0x154
	TArray<FDebugDisplayProperty> DebugProperties; // 0x158
	FPointer ScaleformInteraction; // 0x168
	FPointer PreviousFrameViewFamily; // 0x170
	DelegateProperty __HandleInputKey__Delegate; // 0x178
	DelegateProperty __HandleInputAxis__Delegate; // 0x188
	DelegateProperty __HandleInputChar__Delegate; // 0x198
};

struct UTgAIBehaviorCondition_IsInMinotaurRadius {
	char bMustBeEnemy : 1; // 0x98
};

struct UUIHudMinimap {
	int32_t m_nDepth; // 0x244
	int32_t m_nTeamsRemain; // 0x248
	int32_t m_nDeathFogTime; // 0x24c
	int32_t m_nPreConvergeTime; // 0x250
	int32_t m_nAlertTimePrevious; // 0x254
	int32_t m_nRemain[0x2]; // 0x258
	int32_t m_nLeaderboard[0x3]; // 0x260
	char m_bInit : 1; // 0x26c
	char m_bSnap : 1; // 0x26c
	char m_bDirection : 1; // 0x26c
	char m_bShowAlert : 1; // 0x26c
	char m_bShowHealth : 1; // 0x26c
	char m_bAnimateAlert : 1; // 0x26c
	char m_bFirstConverge : 1; // 0x26c
	char m_bDeathFogSpawned : 1; // 0x26c
	char m_bFirstPreConverge : 0; // 0x26c
	char m_bMinimapShouldShow : 0; // 0x26c
	char m_bDisableTextScaling : 0; // 0x26c
	char m_bResurrecting : 0; // 0x26c
	float m_fSize; // 0x270
	float m_fRadius; // 0x274
	float m_fOffsetX; // 0x278
	float m_fOffsetY; // 0x27c
	float m_fGameTime; // 0x280
	float m_fAlertTimer; // 0x284
	float m_fDirectionTimer; // 0x288
	float m_fChestPulseIn; // 0x28c
	float m_fChestPulseIOut; // 0x290
	float m_fConvergeRadius; // 0x294
	float m_fConvergeTarget; // 0x298
	float m_fConvergeTargetX; // 0x29c
	float m_fConvergeTargetY; // 0x2a0
	float m_fConvergeStartSize; // 0x2a4
	float m_fResurrectionTimer; // 0x2a8
	float m_fTotalResurrectionTime; // 0x2ac
	float m_fLootGoblinSpawnedTimer; // 0x2b0
	float m_fTotalLootGoblinSpawnedTime; // 0x2b4
	float m_fHealth[0x2]; // 0x2b8
	FString m_sForgeName; // 0x2c0
	FString m_sNamedAreaName; // 0x2d0
	FString m_sAlertTitle; // 0x2e0
	FVector m_vBoundsCenter; // 0x2f0
	FVector m_vBoundsExtents; // 0x2fc
	TArray<FUIPING_DATA> m_Chests; // 0x308
	TArray<FUIPING_DATA> m_Forges; // 0x318
	TArray<FUIPING_DATA> m_Catapults; // 0x328
	TArray<FUIPING_DATA> m_NamedAreas; // 0x338
	ObjectProperty m_mcMap; // 0x348
	ObjectProperty m_mcMapBackground; // 0x350
	ObjectProperty m_mcMapFog; // 0x358
	ObjectProperty m_mcMapMask; // 0x360
	ObjectProperty m_mcMapRect; // 0x368
	ObjectProperty m_mcMapMaskRect; // 0x370
	ObjectProperty m_mcMapFrame; // 0x378
	ObjectProperty m_mcMapInner; // 0x380
	ObjectProperty m_mcMapOuter; // 0x388
	ObjectProperty m_mcMapChests; // 0x390
	ObjectProperty m_mcMapDirection; // 0x398
	ObjectProperty m_mcMapDirectionWaypoint; // 0x3a0
	ObjectProperty m_mcMapDirectionDistance; // 0x3a8
	ObjectProperty m_mcMapDirectionDistanceTF[0x2]; // 0x3b0
	ObjectProperty m_mcMapDirectionAnim; // 0x3c0
	ObjectProperty m_mcMapDirectionLine; // 0x3c8
	ObjectProperty m_mcMapZeppelinA; // 0x3d0
	ObjectProperty m_mcMapNamedAreas; // 0x3d8
	ObjectProperty m_mcMapScrimmageDirection; // 0x3e0
	ObjectProperty m_mcMapScrimmageDirectionAnim; // 0x3e8
	ObjectProperty m_mcMapScrimmageDirectionLine; // 0x3f0
	ObjectProperty m_mcMapImage[0x3]; // 0x3f8
	ObjectProperty m_mcLocalPlayer; // 0x410
	ObjectProperty m_mcTeam[0x6]; // 0x418
	ObjectProperty m_mcAlliance[0x28]; // 0x448
	ObjectProperty m_mcWaypoint[0x6]; // 0x588
	ObjectProperty m_mcLeaderboard[0x3]; // 0x5b8
	ObjectProperty m_mcTime; // 0x5d0
	ObjectProperty m_mcTeamsRemain; // 0x5d8
	ObjectProperty m_mcRemain[0x2]; // 0x5e0
	ObjectProperty m_mcHealth[0x2]; // 0x5f0
	ObjectProperty m_mcHealthBar[0x2]; // 0x600
	ObjectProperty m_mcAlert; // 0x610
	ObjectProperty m_mcAlertIcon; // 0x618
	ObjectProperty m_mcAlertMini; // 0x620
	ObjectProperty m_mcAlertMiniBar; // 0x628
	ObjectProperty m_mcAlertMiniBarTip; // 0x630
	ObjectProperty m_mcAlertMiniFlash; // 0x638
	ObjectProperty m_mcAlertMiniFog; // 0x640
	ObjectProperty m_mcAlertMiniIcon; // 0x648
	ObjectProperty m_mcDailyQuests; // 0x650
	ObjectProperty m_mcQuestEntry[0x3]; // 0x658
	ObjectProperty m_mcQuestMask[0x3]; // 0x670
	ObjectProperty m_mcQuestTip[0x3]; // 0x688
	ObjectProperty m_mcQuestComplete[0x3]; // 0x6a0
	ObjectProperty m_mcQuestFillBar[0x3]; // 0x6b8
	ObjectProperty m_mcQuestEntryBG[0x3]; // 0x6d0
	ObjectProperty m_mcQuestRewardText; // 0x6e8
	ObjectProperty m_mcQuestReward1; // 0x6f0
	ObjectProperty m_mcQuestCompleteNotify; // 0x6f8
	ObjectProperty m_mcResurrectionNotify; // 0x700
	ObjectProperty m_mcResurrectionMini; // 0x708
	ObjectProperty m_mcResurrectionMiniBar; // 0x710
	ObjectProperty m_mcPOIMessage; // 0x718
	ObjectProperty m_mcPOIText0; // 0x720
	ObjectProperty m_mcPOIText1; // 0x728
	FString m_sCurrentPOIName; // 0x730
	FString m_sNextPOIName; // 0x740
	float m_fPOITimer; // 0x750
	float m_fPOIPreTime; // 0x754
	float m_fPOIShowTime; // 0x758
	float m_fPOIPostTime; // 0x75c
	POIMessageState m_ePOIMessageState; // 0x760
	ObjectiveClearState m_eObjectiveClearState; // 0x761
	ObjectProperty m_mcCurrentObjective; // 0x764
	ObjectProperty m_mcObjectives[0x5]; // 0x76c
	ObjectProperty m_mcObjectiveCheck[0x5]; // 0x794
	ObjectProperty m_mcObjectiveText[0x5]; // 0x7bc
	int32_t m_nCurrentObjMessageId; // 0x7e4
	int32_t m_nCurrentObjIndex; // 0x7e8
	float m_fClearObjectivesTimer; // 0x7ec
	ObjectProperty m_akEnterPOI; // 0x7f0
};

struct AMobileTouchInputVolume {
	char bEnabled : 1; // 0x2bc
};

struct UGameExplosionContent {
	char bAutoControllerVibration : 1; // 0x60
	char bOrientCameraShakeTowardsEpicenter : 1; // 0x60
	ObjectProperty ExplosionSound; // 0x64
	ObjectProperty CamShake; // 0x6c
	ObjectProperty CamShake_Left; // 0x74
	ObjectProperty CamShake_Right; // 0x7c
	ObjectProperty CamShake_Rear; // 0x84
	float CamShakeInnerRadius; // 0x8c
	float CamShakeOuterRadius; // 0x90
	float CamShakeFalloff; // 0x94
	AEmitterCameraLensEffectBase* CameraLensEffect; // 0x98
	float CameraLensEffectRadius; // 0xa0
	ComponentProperty ExploLight; // 0xa4
	float ExploLightFadeOutTime; // 0xac
	ComponentProperty ExploRadialBlur; // 0xb0
	float ExploRadialBlurFadeOutTime; // 0xb8
	float ExploRadialBlurMaxBlur; // 0xbc
	ObjectProperty ParticleEmitterTemplate; // 0xc0
	ObjectProperty FogVolumeArchetype; // 0xc8
};

struct USpeedTreeComponent {
	ObjectProperty SpeedTree; // 0x24c
	char bUseLeafCards : 1; // 0x254
	char bUseLeafMeshes : 1; // 0x254
	char bUseBranches : 1; // 0x254
	char bUseFronds : 1; // 0x254
	char bUseBillboards : 1; // 0x254
	float Lod3DStart; // 0x258
	float Lod3DEnd; // 0x25c
	float LodBillboardStart; // 0x260
	float LodBillboardEnd; // 0x264
	float LodLevelOverride; // 0x268
	ObjectProperty Branch1Material; // 0x26c
	ObjectProperty Branch2Material; // 0x274
	ObjectProperty FrondMaterial; // 0x27c
	ObjectProperty LeafCardMaterial; // 0x284
	ObjectProperty LeafMeshMaterial; // 0x28c
	ObjectProperty BillboardMaterial; // 0x294
	ObjectProperty Branch1MaterialNoScreenDoor; // 0x29c
	ObjectProperty Branch2MaterialNoScreenDoor; // 0x2a4
	ObjectProperty FrondMaterialNoScreenDoor; // 0x2ac
	ObjectProperty LeafCardMaterialNoScreenDoor; // 0x2b4
	ObjectProperty LeafMeshMaterialNoScreenDoor; // 0x2bc
	ObjectProperty BillboardMaterialNoScreenDoor; // 0x2c4
	TArray<FSpeedTreeStaticLight> StaticLights; // 0x2cc
	FLightMapRef BranchLightMap; // 0x2dc
	FLightMapRef FrondLightMap; // 0x2e4
	FLightMapRef LeafMeshLightMap; // 0x2ec
	FLightMapRef LeafCardLightMap; // 0x2f4
	FLightMapRef BillboardLightMap; // 0x2fc
	FMatrix RotationOnlyMatrix; // 0x310
	FLightmassPrimitiveSettings LightmassSettings; // 0x350
};

struct UUIComponent_CenteredHeaderTab {
	ObjectProperty m_mcSelectedTF; // 0x120
	ObjectProperty m_mcSelectedFrame; // 0x128
	ObjectProperty m_mcHighlightTF; // 0x130
	ObjectProperty m_mcShadowTF; // 0x138
	ObjectProperty m_mcFrame; // 0x140
	ObjectProperty m_pCTA; // 0x148
};

struct USeqCond_CompareBool {
	char bResult : 1; // 0xec
};

struct UUIDataProvider_OnlinePlayerDataBase {
	int32_t PlayerControllerId; // 0x70
};

struct UTgGameplayCurvesSet_AimAssistBounds {
	FRawDistributionFloat BoundsScaleHorizByDistance; // 0x64
	FRawDistributionFloat BoundsScaleVertByDistance; // 0x88
	char bUseHorizCurveForVert : 1; // 0xac
	float fBaseHorizMultiplier; // 0xb0
	float fBaseVertMultiplier; // 0xb4
};

struct UTgInventoryObject_Listen_HealthByPercent {
	int32_t m_iAppliedStacks; // 0xc8
};

struct UTgCameraModule_SpectatorOverview {
	FRotator WorldViewRotation; // 0x9c
	float FOV; // 0xa8
	float TargetZoomedFOV; // 0xac
	float ZoomIncrement; // 0xb0
	float MinZoom; // 0xb4
	float MaxZoom; // 0xb8
	float ZoomInterpTime; // 0xbc
	FVector CurrentSpringLocation; // 0xc0
	float PawnTargetSpringDamping; // 0xcc
	float FreeCamSpringDamping; // 0xd0
	float IgnoreSpringDistance; // 0xd4
	TArray<FCameraPitchInfo> CameraPitchData; // 0xd8
	char bFlippedSides : 1; // 0xe8
	char bJustBecameActive : 1; // 0xe8
	char bAutoZoomEnabled : 1; // 0xe8
	float OverviewCameraInfluenceDist; // 0xec
	TArray<ObjectProperty> OverviewCameras; // 0xf0
	FVector ObstacleTransparentExtent; // 0x100
	float fMinAutoZoomFOVAngle; // 0x10c
	float fMaxAutoZoomFOVAngle; // 0x110
	float fMinAutoZoomDistance; // 0x114
	float fMaxAutoZoomDistance; // 0x118
	float fAutoZoomDetectionRadius; // 0x11c
	float fAutoZoomInSpeed; // 0x120
	float fAutoZoomOutSpeed; // 0x124
	float fAutoZoomInLockOutTime; // 0x128
	float fAutoZoomOutLockOutTime; // 0x12c
	float m_RemainingAutoZoomInLockOutTime; // 0x130
	float m_RemainingAutoZoomOutLockOutTime; // 0x134
};

struct UParticleModuleTypeDataAnimTrail {
	FName ControlEdgeName; // 0x68
	int32_t SheetsPerTrail; // 0x70
	char bDeadTrailsOnDeactivate : 1; // 0x74
	char bClipSourceSegement : 1; // 0x74
	char bEnablePreviousTangentRecalculation : 1; // 0x74
	char bTangentRecalculationEveryFrame : 1; // 0x74
	char bRenderGeometry : 1; // 0x74
	char bRenderSpawnPoints : 1; // 0x74
	char bRenderTangents : 1; // 0x74
	char bRenderTessellation : 1; // 0x74
	float TilingDistance; // 0x78
	float DistanceTessellationStepSize; // 0x7c
	float TangentTessellationScalar; // 0x80
};

struct UMorphNodeWeightByBoneRotation {
	float Angle; // 0x84
	float NodeWeight; // 0x88
	FName BoneName; // 0x8c
	EAxis BoneAxis; // 0x94
	char bInvertBoneAxis : 1; // 0x98
	char bControlMaterialParameter : 1; // 0x98
	TArray<FBoneAngleMorph> WeightArray; // 0x9c
	int32_t MaterialSlotId; // 0xac
	FName ScalarParameterName; // 0xb0
	ObjectProperty MaterialInstanceConstant; // 0xb8
};

struct UTgControlModule_TopDown {
	float DefaultStartHeight; // 0x78
};

struct UUIComponent_BattlePassRewardLevel {
	ObjectProperty m_pItemIcon; // 0x120
	ObjectProperty m_pButton; // 0x128
	ObjectProperty m_mcLock; // 0x130
	ObjectProperty m_mcCheck; // 0x138
};

struct UDistributionVectorParameterBase {
	FName ParameterName; // 0x90
	FVector MinInput; // 0x98
	FVector MaxInput; // 0xa4
	FVector MinOutput; // 0xb0
	FVector MaxOutput; // 0xbc
	DistributionParamMode ParamModes[0x3]; // 0xc8
};

struct UUIComponent_ChampionSimple {
	ObjectProperty m_mcText; // 0x120
	ObjectProperty m_mcChampionIconWrapper; // 0x128
	ObjectProperty m_mcIconImage; // 0x130
};

struct UOnlineSubsystem {
	FPointer VfTable_FTickableObject; // 0x60
	TScriptInterface<Class> AccountInterface; // 0x68
	TScriptInterface<Class> PlayerInterface; // 0x78
	TScriptInterface<Class> PlayerInterfaceEx; // 0x88
	TScriptInterface<Class> MarketplaceInterface; // 0x98
	TScriptInterface<Class> SystemInterface; // 0xa8
	TScriptInterface<Class> GameInterface; // 0xb8
	TScriptInterface<Class> ContentInterface; // 0xc8
	TScriptInterface<Class> VoiceInterface; // 0xd8
	TScriptInterface<Class> StatsInterface; // 0xe8
	TScriptInterface<Class> NewsInterface; // 0xf8
	TScriptInterface<Class> PartyChatInterface; // 0x108
	TScriptInterface<Class> TitleFileInterface; // 0x118
	TScriptInterface<Class> TitleFileCacheInterface; // 0x128
	TScriptInterface<Class> UserCloudInterface; // 0x138
	TScriptInterface<Class> SharedCloudInterface; // 0x148
	TScriptInterface<Class> SocialInterface; // 0x158
	TScriptInterface<Class> ChatInterface; // 0x168
	TScriptInterface<Class> AuthInterface; // 0x178
	TScriptInterface<Class> GameDVRInterface; // 0x188
	TScriptInterface<Class> CommunityContentInterface; // 0x198
	TArray<DelegateProperty> OnLeaveStorefrontDelegates; // 0x1a8
	FUniqueNetId LoggedInPlayerNetId; // 0x1b8
	TArray<FNamedInterface> NamedInterfaces; // 0x1c0
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x1d0
	TArray<FNamedSession> Sessions; // 0x1e0
	TArray<FSessionMemberInfo> PartyMemberList; // 0x1f0
	TArray<FSessionMemberInfo> GameMemberList; // 0x200
	char bCameFromAutoLogin : 1; // 0x210
	char bUseBuildIdOverride : 1; // 0x210
	int32_t BuildIdOverride; // 0x214
	FString IniLocPatcherClassName; // 0x218
	ObjectProperty Patcher; // 0x228
	float AsyncMinCompletionTime; // 0x230
	FString DefaultSessionTemplateName; // 0x234
	FString PartySessionTemplateName; // 0x244
	DelegateProperty __OnLeaveStorefront__Delegate; // 0x254
};

struct UTgAnimNotify_PlayPetAnim {
	FName m_ChildSeqName; // 0x68
};

struct UMorphTargetSet {
	TArray<ObjectProperty> Targets; // 0x60
	ObjectProperty BaseSkelMesh; // 0x70
	FArray_Mirror RawWedgePointIndices; // 0x78
};

struct UPBRuleNodeQuad {
	ObjectProperty Material; // 0x70
	float RepeatMaxSizeX; // 0x78
	float RepeatMaxSizeZ; // 0x7c
	int32_t QuadLightmapRes; // 0x80
	float YOffset; // 0x84
	char bDisableMaterialRepeat : 1; // 0x88
};

struct UUIComponent_Interactable {
	ObjectProperty m_mcInteractable; // 0x118
	TArray<ObjectProperty> m_mcRolloverObjects; // 0x120
	ObjectProperty m_mcSelected; // 0x130
	char m_bSelected : 1; // 0x138
	UIDISPLAYTYPE m_eInteractionType; // 0x13c
};

struct UTgAchievement_Unstoppable {
	char m_bReachedKillstreak : 1; // 0x90
};

struct UMaterialExpressionTextureSample {
	ObjectProperty Texture; // 0xb0
	FExpressionInput Coordinates; // 0xb8
	FExpressionInput TextureObject; // 0xec
};

struct ATgSpectatorTempCam {
	char bIsViewTarget : 1; // 0x420
	char bIsBookmark : 1; // 0x420
};

struct UFracturedStaticMesh {
	float CoreMeshScale; // 0x1e4
	char bSliceUsingCoreCollision : 1; // 0x218
	ObjectProperty FragmentDestroyEffect; // 0x21c
	TArray<ObjectProperty> FragmentDestroyEffects; // 0x224
	float FragmentDestroyEffectScale; // 0x234
	float FragmentHealthScale; // 0x238
	float FragmentMinHealth; // 0x23c
	float FragmentMaxHealth; // 0x240
	char bUniformFragmentHealth : 1; // 0x244
	float ChunkLinVel; // 0x248
	float ChunkAngVel; // 0x24c
	float ChunkLinHorizontalScale; // 0x250
	float ExplosionVelScale; // 0x254
	char bCompositeChunksExplodeOnImpact : 1; // 0x258
	char bFixIsolatedChunks : 1; // 0x25c
	char bAlwaysBreakOffIsolatedIslands : 1; // 0x260
	char bSpawnPhysicsChunks : 1; // 0x264
	float ChanceOfPhysicsChunk; // 0x268
	float ExplosionChanceOfPhysicsChunk; // 0x26c
	float NormalPhysicsChunkScaleMin; // 0x270
	float NormalPhysicsChunkScaleMax; // 0x274
	float ExplosionPhysicsChunkScaleMin; // 0x278
	float ExplosionPhysicsChunkScaleMax; // 0x27c
	float MinConnectionSupportArea; // 0x280
	ObjectProperty DynamicOutsideMaterial; // 0x284
	ObjectProperty LoseChunkOutsideMaterial; // 0x28c
	int32_t OutsideMaterialIndex; // 0x294
};

struct UShadowMapTexture2D {
	int32_t ShadowmapFlags; // 0x208
};

struct UFogVolumeConeDensityComponent {
	float MaxDensity; // 0xe0
	FVector ConeVertex; // 0xe4
	float ConeRadius; // 0xf0
	FVector ConeAxis; // 0xf4
	float ConeMaxAngle; // 0x100
	ComponentProperty PreviewCone; // 0x104
};

struct UUIDataLeaguePlayer {
	ObjectProperty pPlayer; // 0x60
	ObjectProperty pLeague; // 0x68
	ObjectProperty pTier; // 0x70
	ObjectProperty pHighestTier; // 0x78
	int32_t nPointsEarned; // 0x80
	int32_t nPointsTrend; // 0x84
	Fdword dwRank; // 0x88
	Fdword dwRankPrev; // 0x8c
	Fdword dwWins; // 0x90
	Fdword dwLosses; // 0x94
	Fdword dwDodges; // 0x98
	Fdword dwMatchesPlayedInTier; // 0x9c
	Fdword dwRegion; // 0xa0
	Fdword dwRecommendedTierId; // 0xa4
	Fdword dwTitleId; // 0xa8
	FDateTimeWrapper dtLastPlayed; // 0xac
};

struct UFont {
	TArray<FFontCharacter> Characters; // 0x60
	TArray<ObjectProperty> Textures; // 0x70
	TMap<None, None> CharRemap; // 0x80
	int32_t IsRemapped; // 0xc8
	float EmScale; // 0xcc
	float Ascent; // 0xd0
	float Descent; // 0xd4
	float Leading; // 0xd8
	int32_t Kerning; // 0xdc
	FFontImportOptionsData ImportOptions; // 0xe0
	int32_t NumCharacters; // 0x188
	TArray<int32_t> MaxCharHeight; // 0x18c
	float ScalingFactor; // 0x19c
};

struct UUIComponent_BattlePassPurchasePanel {
	ObjectProperty m_mcLevel; // 0x120
	ObjectProperty m_mcDiamond; // 0x128
	ObjectProperty m_mcName; // 0x130
	ObjectProperty m_mcRarity; // 0x138
	ObjectProperty m_mcDesc; // 0x140
	ObjectProperty m_mcOwned; // 0x148
	ObjectProperty m_mcOwnedTF; // 0x150
	ObjectProperty m_mcUnlockCheck; // 0x158
	ObjectProperty m_mcTeaser; // 0x160
	ObjectProperty m_pButton; // 0x168
	ObjectProperty m_mcButtonDiamond; // 0x170
	ObjectProperty m_pPrompt; // 0x178
	Fdword m_dwRequiredLevel; // 0x180
	char m_bPremium : 1; // 0x184
	ObjectProperty m_InputPurchase; // 0x188
};

struct UUIPopupPurchase {
	int32_t m_nOffset; // 0x244
	int32_t m_nLootId; // 0x248
	int32_t m_nVendor; // 0x24c
	int32_t m_nHoverItem; // 0x250
	float m_fWaitTimeout; // 0x254
	float m_fPurchaseFlash; // 0x258
	float m_fConfirmationTime; // 0x25c
	float m_fConfirmationTimer; // 0x260
	char m_bControllerButtonHeld : 1; // 0x264
	TArray<int32_t> m_nItems; // 0x268
	ObjectProperty m_mcBlocker; // 0x278
	ObjectProperty m_mcPanel; // 0x280
	ObjectProperty m_mcPanelBack; // 0x288
	ObjectProperty m_mcPanelName; // 0x290
	ObjectProperty m_mcPanelDesc; // 0x298
	ObjectProperty m_mcPanelType; // 0x2a0
	ObjectProperty m_mcPanelIcon; // 0x2a8
	ObjectProperty m_mcPanelWait; // 0x2b0
	ObjectProperty m_mcPanelTotal; // 0x2b8
	ObjectProperty m_mcPanelTotalCrowns; // 0x2c0
	ObjectProperty m_mcPanelTotalTrophies; // 0x2c8
	ObjectProperty m_mcPanelHoverName; // 0x2d0
	ObjectProperty m_mcPanelHoverDesc; // 0x2d8
	ObjectProperty m_mcPanelCrowns; // 0x2e0
	ObjectProperty m_mcPanelCrownsPurchase; // 0x2e8
	ObjectProperty m_mcPanelCrownsPurchaseFlash; // 0x2f0
	ObjectProperty m_mcPanelCrownsPurchasePrice; // 0x2f8
	ObjectProperty m_mcPanelCrownsPurchasePriceDiscount; // 0x300
	ObjectProperty m_mcPanelPurchaseHold; // 0x308
	ObjectProperty m_mcPanelPurchaseMask; // 0x310
	ObjectProperty m_mcPanelPurchaseKey; // 0x318
	ObjectProperty m_mcPanelPurchaseKeyHoldBack; // 0x320
	ObjectProperty m_mcPanelTrophies; // 0x328
	ObjectProperty m_mcPanelTrophiesPurchase; // 0x330
	ObjectProperty m_mcPanelTrophiesPurchaseFlash; // 0x338
	ObjectProperty m_mcPanelTrophiesPurchasePrice; // 0x340
	ObjectProperty m_mcPanelTrophiesPurchasePriceDiscount; // 0x348
	ObjectProperty m_mcPanelArrow[0x2]; // 0x350
	ObjectProperty m_mcItem[0x5]; // 0x360
	ObjectProperty m_mcItemIcon[0x5]; // 0x388
	ObjectProperty m_mcItemFrame[0x5]; // 0x3b0
	ObjectProperty m_mcItemActive[0x5]; // 0x3d8
	ObjectProperty m_mcItemRarity[0x5]; // 0x400
	ObjectProperty m_mcItemTexture[0x5]; // 0x428
	ObjectProperty m_mcItemIconFrame[0x5]; // 0x450
	ObjectProperty m_pInputGroup; // 0x478
	ObjectProperty m_pPurchaseGroup; // 0x480
	ObjectProperty m_akPurchase; // 0x488
};

struct UMaterialExpressionFmod {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct UPBRuleNodeRandom {
	int32_t NumOutputs; // 0x70
	int32_t MinNumExecuted; // 0x74
	int32_t MaxNumExecuted; // 0x78
};

struct ATgAITaskforceBlockingVolume {
	int32_t BlockTaskforce; // 0x2bc
	char m_bHasRegisteredObstacle : 1; // 0x2c0
};

struct AFogVolumeDensityInfo {
	ComponentProperty DensityComponent; // 0x280
	ComponentProperty AutomaticMeshComponent; // 0x288
	char bEnabled : 1; // 0x290
};

struct UTgAIUtilityFilter_LoSToTargetLastKnownLocation {
	char bInverse : 1; // 0xc0
};

struct UMaterialExpressionFrac {
	FExpressionInput Input; // 0xb0
};

struct UTgEffectDamage_AstroDOT {
	TArray<float> m_EffectTimeStamps; // 0xc8
	TArray<float> m_EffectDamageValues; // 0xd8
	FPointer m_EffectInfo; // 0xe8
};

struct UDrawQuadComponent {
	ObjectProperty Texture; // 0x24c
	float Width; // 0x254
	float Height; // 0x258
};

struct UUIData_StringWithCount {
	int32_t m_nValue; // 0x70
};

struct UUIScene_UICustomGameList {
	ObjectProperty m_pList; // 0x154
	ObjectProperty m_pSelectedComp; // 0x15c
	ObjectProperty m_pSelectedGame; // 0x164
	ObjectProperty m_pCreateButton; // 0x16c
	ObjectProperty m_pJoinButton; // 0x174
	ObjectProperty m_mcRegionTF; // 0x17c
	ObjectProperty m_pCreateAction; // 0x184
	ObjectProperty m_pJoinAction; // 0x18c
	ObjectProperty m_pRefreshKeyboardAction; // 0x194
	ObjectProperty m_pRefreshGamePadAction; // 0x19c
	float m_fRefreshDisableTimer; // 0x1a4
};

struct APlayerCollectorGame {
	int32_t NumberOfClientsToWaitFor; // 0x4cc
	FString URLToLoad; // 0x4d0
};

struct ATgSilhouetteManager {
	ObjectProperty m_Owner; // 0x280
	char m_bSilhouettesEnabled : 1; // 0x288
	char m_bForceSilhouetteVisible : 1; // 0x288
	TArray<FTgSilhouetteInfo> m_SilhouetteInfos; // 0x28c
	UTgSilhouetteComponent* m_SilhouetteClass; // 0x29c
};

struct UUIData_Deck {
	ObjectProperty m_pDeckItems[0x5]; // 0x60
	int32_t m_nId; // 0x88
	char m_bIsTemplate : 1; // 0x8c
	FString m_sName; // 0x90
	FString m_sDisplayName; // 0xa0
	FString m_sDescription; // 0xb0
};

struct ATgPawn_Character {
	char c_bUpdatePlayerStatUI : 1; // 0x2fb4
	char m_bInHandFiring : 1; // 0x2fb4
	char r_bNearCapturePoint : 1; // 0x2fb4
	char r_bNearPayload : 1; // 0x2fb4
	char r_bNearSiegeMonster : 1; // 0x2fb4
	char r_bVisibleToEnemies : 1; // 0x2fb4
	char s_bAmmoReloadCheat : 1; // 0x2fb4
	char s_bAutomountProtection : 1; // 0x2fb4
	char m_bAttemptingAirJump : 0; // 0x2fb4
	char m_bDelayingStopSpecialJumpFx : 0; // 0x2fb4
	char m_bPendingBounce : 0; // 0x2fb4
	char s_bInitiatingJoin : 0; // 0x2fb4
	char s_bReplicateInhandAmmo : 0; // 0x2fb4
	char c_bShouldTickThisFrame : 0; // 0x2fb4
	char c_bShadowsVisible : 0; // 0x2fb4
	char c_bNeedsShadowLOSCheck : 0; // 0x2fb4
	float m_fLastCapturePointReclaimedTime; // 0x2fb8
	float m_fMinReclaimPointTime; // 0x2fbc
	float c_fUpdateAltitudeRTPCDelay; // 0x2fc0
	float m_fInHandStartFireTime; // 0x2fc4
	float m_fInHandStopFireTime; // 0x2fc8
	float m_fWallDamagePercent; // 0x2fcc
	float m_fSiegeDamagePercent; // 0x2fd0
	float r_fZoomAmt; // 0x2fd4
	char r_nCriticalHit; // 0x2fd8
	float m_fMountZoomOverride; // 0x2fdc
	ObjectProperty r_StuckBombs[0x6]; // 0x2fe0
	int32_t m_nCharacterRole; // 0x3010
	ComponentProperty m_CustomCharacterComponent; // 0x3014
	ComponentProperty m_MountedCollisionComponent; // 0x301c
	ComponentProperty m_MeshEncompassingCollisionComponent; // 0x3024
	TArray<TScriptInterface<Class>> m_CachedMoveSpeedModDevices; // 0x302c
	TArray<TScriptInterface<Class>> m_CachedAccelModDevices; // 0x303c
	TArray<TScriptInterface<Class>> m_CachedDeployModDevices; // 0x304c
	float m_fCachedGroundProximity; // 0x305c
	float m_fCachedGroundProximityTimestamp; // 0x3060
	int32_t m_nAirJumps; // 0x3064
	float m_fAirJumpZSpeed; // 0x3068
	FVector m_vBounceVelocity; // 0x306c
	ObjectProperty m_JoinTargetLocal; // 0x3078
	ObjectProperty m_JoinSourceLocal; // 0x3080
	ObjectProperty r_JoinTarget; // 0x3088
	FVector r_vJoinSourceLocation; // 0x3090
	FVector r_vJoinTargetLocation; // 0x309c
	float r_fJoinTweenDuration; // 0x30a8
	ObjectProperty r_JoinSource; // 0x30ac
	TArray<FForceFaceTargetActor> m_ForceFaceActors; // 0x30b4
	int32_t r_nInHandCurrentAmmo; // 0x30c4
	int32_t r_nInHandMaxAmmo; // 0x30c8
	int32_t s_nOppressorMineStackCount; // 0x30cc
	float c_fTickCatchup; // 0x30d0
	FWeaponDOF m_CurrentDOFSettings; // 0x30d4
	ObjectProperty s_pCaptureProxy; // 0x30fc
	float c_fShadowsVisibleChangeTimer; // 0x3104
	float c_fShadowsVisibleChangeDelay; // 0x3108
};

struct ATgTournamentObjective {
	ObjectProperty m_pDropPointA; // 0x280
	ObjectProperty m_pDropPointB; // 0x288
	float m_fFogRadius; // 0x290
	float m_fZeppelinDropHeight; // 0x294
	EObjectiveSize m_ObjectiveSize; // 0x298
	ObjectProperty m_pBotFactory; // 0x29c
	ComponentProperty BadSprite; // 0x2a4
};

struct USimpleSplineNonLoopAudioComponent {
	float DelayMin; // 0x31c
	float DelayMax; // 0x320
	float PitchMin; // 0x324
	float PitchMax; // 0x328
	float VolumeMin; // 0x32c
	float VolumeMax; // 0x330
	int32_t CurrentSlotIndex; // 0x334
	float UsedVolumeModulation; // 0x338
	float UsedPitchModulation; // 0x33c
	float NextSoundTime; // 0x340
};

struct UInterpTrack {
	FPointer VfTable_FInterpEdInputInterface; // 0x60
	FPointer CurveEdVTable; // 0x68
	TArray<ObjectProperty> SubTracks; // 0x70
	UInterpTrackInst* TrackInstClass; // 0x80
	ETrackActiveCondition ActiveCondition; // 0x88
	FString TrackTitle; // 0x8c
	char bOnePerGroup : 1; // 0x9c
	char bDirGroupOnly : 1; // 0x9c
	char bDisableTrack : 1; // 0x9c
	char bIsAnimControlTrack : 1; // 0x9c
	char bSubTrackOnly : 1; // 0x9c
	char bVisible : 1; // 0x9c
	char bIsSelected : 1; // 0x9c
	char bIsRecording : 1; // 0x9c
	char bIsCollapsed : 0; // 0x9c
};

struct USeqEvent_Input {
	char bTrapInput : 1; // 0x128
	int32_t AllowedPlayerIndex; // 0x12c
	TArray<FName> InputNames; // 0x130
};

struct UTgAIBehaviorAction_SelectLaneCombatTarget {
	char bMustBeEnemy : 1; // 0x94
	char bMustBeSameLane : 1; // 0x94
	char bMustHaveLineOfSight : 1; // 0x94
	char bMustHaveDamagedGod : 1; // 0x94
	char bMustNotBeImmune : 1; // 0x94
	char bMustBeInForwardCone : 1; // 0x94
	char bEffectGroupCategoryCheckInstigator : 1; // 0x94
	char bMustBeHittable : 1; // 0x94
	char bMustNotBeNearShield : 0; // 0x94
	ETargetSelector TargetSelector; // 0x98
	ECombatTargetType TargetType; // 0x99
	ECombatTargetType IgnoreTargetType; // 0x9a
	int32_t EffectCategoryId; // 0x9c
	float DistanceThreshold; // 0xa0
	float ForwardConeAngle; // 0xa4
};

struct UNavigationHandle {
	ObjectProperty AnchorPylon; // 0x60
	FPointer AnchorPoly; // 0x68
	FPathStore PathCache; // 0x70
	FPointer BestUnfinishedPathPoint; // 0x80
	FPointer CurrentEdge; // 0x88
	FPointer SubGoal_DestPoly; // 0x90
	FBasedPosition FinalDestination; // 0x98
	ObjectProperty FinalDestinationActor; // 0xd0
	char bSkipRouteCacheUpdates : 1; // 0xd8
	char bUseORforEvaluateGoal : 1; // 0xd8
	char bDebugConstraintsAndGoalEvals : 1; // 0xd8
	char bUltraVerbosePathDebugging : 1; // 0xd8
	char bVisualPathDebugging : 1; // 0xd8
	char bDebug_Breadcrumbs : 1; // 0xd8
	ObjectProperty PathConstraintList; // 0xdc
	ObjectProperty PathGoalList; // 0xe4
	FNavMeshPathParams CachedPathParams; // 0xec
	EPathFindingError LastPathError; // 0x124
	float LastPathFailTime; // 0x128
	FVector Breadcrumbs[0xa]; // 0x12c
	int32_t BreadCrumbMostRecentIdx; // 0x1a4
	float BreadCrumbDistanceInterval; // 0x1a8
	float m_fLastPathLength; // 0x1ac
};

struct ATgRepInfo_Player {
	int32_t r_nPlayerId; // 0x480
	int32_t r_nPawnId; // 0x484
	int32_t r_nPlayerGameID; // 0x488
	int32_t m_nUIDisplayIndex; // 0x48c
	float c_fLastUpdateTime; // 0x490
	int32_t r_nSupportWins; // 0x494
	int32_t r_nDamageWins; // 0x498
	int32_t r_nFlankWins; // 0x49c
	int32_t r_nFrontlineWins; // 0x4a0
	int32_t r_nEquippedTitleId; // 0x4a4
	int32_t r_nHealthCurrent; // 0x4a8
	int32_t r_nHealthMaximum; // 0x4ac
	int32_t r_nPowerCurrent; // 0x4b0
	int32_t r_nPowerMaximum; // 0x4b4
	int32_t r_nPacingType; // 0x4b8
	int32_t r_nShieldCurrent; // 0x4bc
	int32_t r_nShieldMaximum; // 0x4c0
	ObjectProperty r_MasterPrep; // 0x4c4
	ObjectProperty r_TaskForce; // 0x4cc
	int32_t r_nPartyId; // 0x4d4
	ObjectProperty r_SpawnPoint; // 0x4d8
	float r_fReviveSecs; // 0x4e0
	float r_fReviveSecsTotal; // 0x4e4
	char r_bMapHasLoaded : 1; // 0x4e8
	char r_bHasBeenSeenByEnemyTeam : 1; // 0x4e8
	char r_bSilhouettesBlocked : 1; // 0x4e8
	char r_bExtendedSilhouetteRange : 1; // 0x4e8
	char r_bSpeakingEmote : 1; // 0x4e8
	char r_bPlayingAnnouncer : 1; // 0x4e8
	char c_bSpeaking : 1; // 0x4e8
	char r_bDropped : 1; // 0x4e8
	char s_bFirstDrop : 0; // 0x4e8
	char r_bForceNotBot : 0; // 0x4e8
	char r_bDisconnected : 0; // 0x4e8
	char c_bIsDying : 0; // 0x4e8
	char r_IsRevealed : 0; // 0x4e8
	char r_bIsStealthed : 0; // 0x4e8
	char r_bIsVolumeStealthed : 0; // 0x4e8
	char r_bUltimateIsReady : 0; // 0x4e8
	char r_bCanUpgradeLegendary : 0; // 0x4e8
	char s_bAutoSelectCards : 0; // 0x4e8
	char c_bTrackedProjectileIdsJustChanged : 0; // 0x4e8
	char r_bBigHeadModeActive : 0; // 0x4e8
	char r_nSurrenderVote; // 0x4ec
	char r_bVisibleOnMap[0x3]; // 0x4ed
	char r_nVisibilityMask; // 0x4f0
	char r_nFlashUpdateAmmo; // 0x4f1
	DeployableOverlayIcon r_eDeployableOverlayIcon; // 0x4f2
	DeployableOverlayState r_eDeployableOverlayState; // 0x4f3
	DeployableOverlayIcon c_eDeployableOverlayIconOverride; // 0x4f4
	DeployableOverlayState c_eDeployableOverlayStateOverride; // 0x4f5
	GAME_MODE_INSTRUCTION r_eCurrentGameModeInstruction; // 0x4f6
	EPlayerDeployState r_PlayerDeployState; // 0x4f7
	TArray<ObjectProperty> m_PRIArray; // 0x4f8
	TArray<ObjectProperty> m_DRIArray; // 0x508
	ObjectProperty c_PriorMasterPrep; // 0x518
	ObjectProperty c_PriorTaskForce; // 0x520
	int32_t c_fLastHealth; // 0x528
	float c_fLastDamageTime; // 0x52c
	float r_fVisionRange; // 0x530
	FString r_ClanTag; // 0x534
	FString c_PlayerNameWithTag; // 0x544
	float c_fBarragePercent; // 0x554
	float m_fSyncAnnouncerFailsafe; // 0x558
	int32_t r_nRemainingLives; // 0x55c
	int32_t m_DeployPostureId; // 0x560
	float m_fMaxPingTime; // 0x564
	FSimulatedProjectileOverrides r_SimProjOverrides[0x8]; // 0x568
	int32_t r_PlayerItems[0x9]; // 0x628
	int32_t r_Scores[0x16]; // 0x64c
	FDeviceTeamInfo r_PlayerDevices[0x14]; // 0x6a4
	FAmmoCount r_PlayerDeviceAmmo[0x14]; // 0x9c4
	FAppliedStatEffect r_AppliedStatEffects[0x6]; // 0xa14
	float r_fStatEffectsDisableTimeStamp[0x6]; // 0xa5c
	float r_fStatEffectsDisableDuration[0x6]; // 0xa74
	int32_t r_nNextOpenStatEffect; // 0xa8c
	int32_t r_nLastEquippedStatEffect; // 0xa90
	FMarkedTargetInfo r_MarkedTargets[0x5]; // 0xa94
	float c_fLastSpeakingTime; // 0xabc
	int32_t r_nCredits; // 0xac0
	int32_t r_nEarnedCredits; // 0xac4
	int32_t r_nXp; // 0xac8
	int32_t r_nLevel; // 0xacc
	int32_t r_nPlayerScore; // 0xad0
	int32_t r_nCardHealth; // 0xad4
	int32_t r_nCardDamage; // 0xad8
	int32_t r_nPowerLevel; // 0xadc
	int32_t r_nPowerLevelCount; // 0xae0
	int32_t r_nProfileId; // 0xae4
	int32_t r_nSkinId; // 0xae8
	int32_t r_nVoicePackId; // 0xaec
	int32_t r_nKillstreak; // 0xaf0
	int32_t r_nHeadSkinId; // 0xaf4
	int32_t r_nWeaponSkinId; // 0xaf8
	int32_t r_nMountSkinId; // 0xafc
	int32_t r_nMarkerSkinId; // 0xb00
	int32_t r_nAssistScore; // 0xb04
	ObjectProperty r_PawnOwner; // 0xb08
	int32_t r_nLaneId; // 0xb10
	int32_t s_KillOrDeathStreakModifier; // 0xb14
	FsPingInfo r_PingInfo[0x4]; // 0xb18
	FVector c_DeathLocation; // 0xb98
	FVector s_vDeathLocation; // 0xba4
	FTG_HUD_INFO c_HudInfo; // 0xbb0
	float r_fUltReadyInSecs; // 0xbb4
	int32_t r_nUltimateCharge; // 0xbb8
	int32_t r_nRequiredUltimateCharge; // 0xbbc
	int32_t r_nPassiveMode; // 0xbc0
	int32_t r_nShards; // 0xbc4
	int32_t r_nNuggets; // 0xbc8
	int32_t r_nPendingShards; // 0xbcc
	int32_t r_nColorIndex; // 0xbd0
	int32_t r_nPerkCountKit; // 0xbd4
	int32_t r_nPerkCountArmor; // 0xbd8
	int32_t r_nPerkCountWeapon; // 0xbdc
	int32_t r_nPerkCountGeneral; // 0xbe0
	int32_t r_nCardsToDraw; // 0xbe4
	int32_t r_nDrawnCards[0x5]; // 0xbe8
	int32_t r_nDrawnPlayer[0x5]; // 0xbfc
	float s_fScoreTakenPool; // 0xc10
	float s_fScoreDamagePool; // 0xc14
	float s_fScoreCapturePool; // 0xc18
	float s_fScoreHealingPool; // 0xc1c
	float s_fScoreMitigatedPool; // 0xc20
	float s_fScoreTakenThreshold; // 0xc24
	float s_fScoreDamageThreshold; // 0xc28
	float s_fScoreCaptureThreshold; // 0xc2c
	float s_fScoreHealingThreshold; // 0xc30
	float s_fScoreMitigatedThreshold; // 0xc34
	TArray<FDeckCardData> s_CardDeckTier1; // 0xc38
	TArray<FDeckCardData> s_CardDeckTier2; // 0xc48
	TArray<FDeckCardData> s_CardDeckTier3; // 0xc58
	TArray<FDeckCardData> s_CardDeckTier4; // 0xc68
	TArray<FDeckCardData> s_CardDeckTier5; // 0xc78
	FTgAbilityInfo r_GeneralAbilityInfo; // 0xc88
	FTgAbilityInfo r_ArmorAbilityInfo; // 0xccc
	ObjectProperty s_LastKillerPRI; // 0xd10
	TArray<FPlayOfTheGameEventData> s_PlayOfTheGameEventList; // 0xd18
	TArray<FPlayOfTheGameEventCounter> s_PlayOfTheGameEventCounters; // 0xd28
	int32_t r_nDeployableOverlayDisplayMask; // 0xd38
	float r_fDeployableOverlayEnemyViewDist; // 0xd3c
	int32_t c_nDeployableOverlayDisplayMaskOverride; // 0xd40
	float c_fDeployableOverlayEnemyViewDistOverride; // 0xd44
	int32_t r_TrackedProjectileIds[0xf]; // 0xd48
	FTrackedProjectileInitData r_TrackedProjectilesInitData[0xf]; // 0xd84
	FTrackedProjectileUpdateData r_TrackedProjectilesUpdateData[0xf]; // 0x1054
	int32_t r_nRank; // 0x11f8
	FVector r_vDeploy; // 0x11fc
	FVector r_vWaypoint; // 0x1208
	FVector r_vPingLocation; // 0x1214
	FRotator r_rPingRotation; // 0x1220
	ObjectProperty m_WaypointEmitter; // 0x122c
	ObjectProperty m_PingEmitter; // 0x1234
	FVector r_vLocation; // 0x123c
	FRotator r_rRotation; // 0x1248
	int32_t r_nNumViewingPlayers; // 0x1254
};

struct UInteraction {
	DelegateProperty __OnReceivedNativeInputKey__Delegate; // 0x70
	DelegateProperty __OnReceivedNativeInputAxis__Delegate; // 0x80
	DelegateProperty __OnReceivedNativeInputChar__Delegate; // 0x90
	DelegateProperty __OnInitialize__Delegate; // 0xa0
};

struct UUIComponent_DisplayDevice {
	Fdword m_dwDeviceId; // 0x120
	ObjectProperty m_mcName; // 0x124
	ObjectProperty m_mcDesc; // 0x12c
	ObjectProperty m_mcType; // 0x134
	ObjectProperty m_mcIcon; // 0x13c
	ObjectProperty m_mcFrame; // 0x144
	ObjectProperty m_mcHighlight; // 0x14c
	ObjectProperty m_mcHighlightIcon; // 0x154
};

struct UTgSkelControlSingleBone {
	char SnapStrengthFromAnimNodes : 1; // 0x100
	char m_bIsWidescreen : 1; // 0x100
	float SnapStrengthThreshold; // 0x104
	TArray<EEmote> StrengthEmoteList; // 0x108
	TArray<ObjectProperty> CachedEmoteSequences; // 0x118
	FVector m_WidescreenBoneTranslationOffset; // 0x128
	FRotator m_WidescreenBoneRotationOffset; // 0x134
	float m_WidescreenBoneScaleOffset; // 0x140
};

struct UTgAIBehaviorAction_Wiggle {
	float WiggleIntensity; // 0x94
};

struct UMaterialExpressionTextureCoordinate {
	int32_t CoordinateIndex; // 0xb0
	float UTiling; // 0xb4
	float VTiling; // 0xb8
	char UnMirrorU : 1; // 0xbc
	char UnMirrorV : 1; // 0xbc
};

struct UVivoxClosure {
	ObjectProperty m_Connector; // 0x60
	ObjectProperty m_OnlineSub; // 0x68
};

struct UTgAnimNotify_AkEventMusic {
	ObjectProperty AkEventStop; // 0x7c
};

struct UTgAnimNodeChannelFire {
	TG_EQUIP_POINT m_EquipPoint; // 0x168
	char m_bResetOnRelevant : 1; // 0x16c
	char m_bCheckAnimSeqForAnim : 1; // 0x16c
	char m_bUseCooldownForEndChannel : 1; // 0x16c
	char m_bOnlyCallAnimEndWhenRelevant : 1; // 0x16c
	char m_bDoneChanneling : 1; // 0x16c
	float m_fMaxLoopTime; // 0x170
	float m_fPreCooldownEndTimeTrigger; // 0x174
	float m_fCooldownEndTime; // 0x178
	float m_fEndLoopTime; // 0x17c
};

struct UMaterialExpressionScalarParameter {
	float DefaultValue; // 0xd0
};

struct ATgSurvivalFogVolumeDensityInfo {
	char m_bFogOn : 1; // 0x294
	float m_fTargetStartDistance; // 0x298
	float m_fPreviousStartDistance; // 0x29c
	float m_fFogUpdateTimestamp; // 0x2a0
	float m_fFogUpdateInterval; // 0x2a4
	float m_fConvergenceRate; // 0x2a8
	float m_fFadeInRate; // 0x2ac
	float m_fFadeOutRate; // 0x2b0
	ComponentProperty SphericalDensityComponent; // 0x2b4
};

struct UMaterialExpressionDynamicParameter {
	TArray<FString> ParamNames; // 0xb0
};

struct UMaterialExpressionConstant4Vector {
	float R; // 0xb0
	float G; // 0xb4
	float B; // 0xb8
	float A; // 0xbc
};

struct UInterpTrackVisibility {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0xa0
	char bFireEventsWhenForwards : 1; // 0xb0
	char bFireEventsWhenBackwards : 1; // 0xb0
	char bFireEventsWhenJumpingForwards : 1; // 0xb0
};

struct UApexStaticDestructibleComponent {
	float SleepEnergyThreshold; // 0x2b0
	float SleepDamping; // 0x2b4
	FPointer ApexDestructibleActor; // 0x2b8
	FPointer ApexDestructiblePreview; // 0x2c0
	char bIsThumbnailComponent : 1; // 0x2c8
};

struct UUIComponent_CustomGame {
	ObjectProperty m_mcHighlight; // 0x120
	ObjectProperty m_mcFrame; // 0x128
	ObjectProperty m_mcLock; // 0x130
	ObjectProperty m_mcName; // 0x138
	ObjectProperty m_mcOwner; // 0x140
	ObjectProperty m_mcOwnerTF; // 0x148
	ObjectProperty m_mcQueueType; // 0x150
	ObjectProperty m_mcQueueTypeTF; // 0x158
	ObjectProperty m_mcPlayerCount; // 0x160
	ObjectProperty m_mcPlayerCountTF; // 0x168
	ObjectProperty m_mcErrorTF; // 0x170
};

struct UParticleModuleBeamTarget {
	Beam2SourceTargetMethod TargetMethod; // 0x68
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x69
	FName TargetName; // 0x6c
	FName TargetSocketName; // 0x74
	FRawDistributionVector Target; // 0x7c
	char bTargetAbsolute : 1; // 0xa0
	char bLockTarget : 1; // 0xa0
	char bLockTargetTangent : 1; // 0xa0
	char bLockTargetStength : 1; // 0xa0
	FRawDistributionVector TargetTangent; // 0xa4
	FRawDistributionFloat TargetStrength; // 0xc8
	float LockRadius; // 0xec
};

struct UParticleModuleParameterDynamic {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x68
	int32_t UpdateFlags; // 0x78
	char bUsesVelocity : 1; // 0x7c
};

struct UWebRequest {
	FString RemoteAddr; // 0x60
	FString URI; // 0x70
	FString UserName; // 0x80
	FString Password; // 0x90
	int32_t ContentLength; // 0xa0
	FString ContentType; // 0xa4
	ERequestType RequestType; // 0xb4
	FMap_Mirror HeaderMap; // 0xb8
	FMap_Mirror VariableMap; // 0x100
};

struct UTgAnimBlendByPercent {
	float m_fCurrentPercent; // 0x168
	TArray<FBlendByPercentValues> m_ChildParams; // 0x16c
};

struct USeqEvent_AnalogInput {
	char bTrapInput : 1; // 0x128
	int32_t AllowedPlayerIndex; // 0x12c
	TArray<FName> InputNames; // 0x130
};

struct UTgEffectModifyProperty {
	ObjectProperty m_TargetDeviceFire; // 0xa0
	int32_t m_eEquipPointTarget; // 0xa8
	TArray<float> m_fStaticValueOffsets; // 0xac
};

struct UTgAIBehaviorCondition_TeamDeathCount {
	char bMustBeEnemy : 1; // 0x98
	int32_t DeathThreshold; // 0x9c
};

struct UUIData_Index {
	Fdword m_dwValue; // 0x60
};

struct UUIComponent_CollectToUnlock {
	ObjectProperty m_mcContainter; // 0x120
	ObjectProperty m_mcTF0; // 0x128
	ObjectProperty m_mcIcon; // 0x130
	ObjectProperty m_mcTF1; // 0x138
};

struct UTgAchievement {
	ObjectProperty Controller; // 0x60
	char m_bCustomValue3IsBotId : 1; // 0x68
	char m_bAwardsAllowTriggering : 1; // 0x68
	int32_t m_nBotId; // 0x6c
	int32_t m_nActivityId; // 0x70
	int32_t m_nCustomValue1; // 0x74
	int32_t m_nCustomValue2; // 0x78
	int32_t m_nCustomValue3; // 0x7c
	int32_t m_nCustomValue4; // 0x80
	int32_t m_nCustomValue5; // 0x84
	int32_t m_nCurrentProgress; // 0x88
	int32_t m_nCurrentTarget; // 0x8c
};

struct UTgAIBehaviorCondition_CombatTargetPhysicsState {
	EPhysics PhysicsState; // 0x98
};

struct ANxGenericForceFieldBrush {
	int32_t ExcludeChannel; // 0x2bc
	FRBCollisionChannelContainer CollideWithChannels; // 0x2c0
	ERBCollisionChannel RBChannel; // 0x2c4
	FFB_ForceFieldCoordinates Coordinates; // 0x2c5
	FVector Constant; // 0x2c8
	FVector PositionMultiplierX; // 0x2d4
	FVector PositionMultiplierY; // 0x2e0
	FVector PositionMultiplierZ; // 0x2ec
	FVector PositionTarget; // 0x2f8
	FVector VelocityMultiplierX; // 0x304
	FVector VelocityMultiplierY; // 0x310
	FVector VelocityMultiplierZ; // 0x31c
	FVector VelocityTarget; // 0x328
	FVector Noise; // 0x334
	FVector FalloffLinear; // 0x340
	FVector FalloffQuadratic; // 0x34c
	float TorusRadius; // 0x358
	FPointer ForceField; // 0x35c
	TArray<FPointer> ConvexMeshes; // 0x364
	TArray<FPointer> ExclusionShapes; // 0x374
	TArray<FPointer> ExclusionShapePoses; // 0x384
	FPointer LinearKernel; // 0x394
};

struct USeqAct_CameraShake {
	ObjectProperty Shake; // 0x108
	float ShakeScale; // 0x110
	char bDoControllerVibration : 1; // 0x114
	char bRadialShake : 1; // 0x114
	char bOrientTowardRadialEpicenter : 1; // 0x114
	float RadialShake_InnerRadius; // 0x118
	float RadialShake_OuterRadius; // 0x11c
	float RadialShake_Falloff; // 0x120
	ECameraAnimPlaySpace PlaySpace; // 0x124
	ObjectProperty LocationActor; // 0x128
};

struct ATgProj_DrogozRocket {
	char m_bWasFromSalvo : 1; // 0x51c
};

struct USeqAct_ModifyHealth {
	UDamageType* DamageType; // 0x108
	float Momentum; // 0x110
	float Amount; // 0x114
	float Radius; // 0x118
	char bHeal : 1; // 0x11c
	char bRadial : 1; // 0x11c
	char bFalloff : 1; // 0x11c
	ObjectProperty Instigator; // 0x120
};

struct ATgPawn_Structure {
	float s_fLastDamageTime; // 0x2e78
	float s_fDamageNotificationDelay; // 0x2e7c
};

struct UMaterialExpressionFloor {
	FExpressionInput Input; // 0xb0
};

struct UUIData_String_Localized {
	FString m_sSection; // 0x60
	FString m_sKey; // 0x70
	char m_bCaps : 1; // 0x80
};

struct UTgAIBehaviorCondition_PetPhase {
	EPetPhase Phase; // 0x98
};

struct UGameplayEvents {
	FPointer Archive; // 0x60
	FString StatsFileName; // 0x68
	FGameplayEventsHeader Header; // 0x78
	FGameSessionInformation CurrentSessionInfo; // 0xa8
	TArray<FPlayerInformation> PlayerList; // 0x130
	TArray<FTeamInformation> TeamList; // 0x140
	TArray<FGameplayEventMetaData> SupportedEvents; // 0x150
	TArray<FWeaponClassEventData> WeaponClassArray; // 0x160
	TArray<FDamageClassEventData> DamageClassArray; // 0x170
	TArray<FProjectileClassEventData> ProjectileClassArray; // 0x180
	TArray<FPawnClassEventData> PawnClassArray; // 0x190
	TArray<FString> ActorArray; // 0x1a0
	TArray<FString> SoundCueArray; // 0x1b0
};

struct USeqAct_MITV_Activate {
	float DurationOfMITV; // 0x108
};

struct UMcpServiceConfig {
	FString Protocol; // 0x60
	FString Domain; // 0x70
	FString TitleId; // 0x80
	FString AppKey; // 0x90
	FString AppSecret; // 0xa0
};

struct UMcpIdMappingBase {
	FString McpIdMappingClassName; // 0x78
	DelegateProperty __OnAddMappingComplete__Delegate; // 0x88
	DelegateProperty __OnQueryMappingsComplete__Delegate; // 0x98
};

struct UParticleModuleCameraOffset {
	FRawDistributionFloat CameraOffset; // 0x68
	char bSpawnTimeOnly : 1; // 0x8c
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x90
};

struct UMobileInputZone {
	EZoneType Type; // 0x60
	char TouchpadIndex; // 0x61
	EZoneState State; // 0x62
	EZoneSlideType SlideType; // 0x63
	FString Caption; // 0x64
	FName InputKey; // 0x74
	FName HorizontalInputKey; // 0x7c
	FName TapInputKey; // 0x84
	FName DoubleTapInputKey; // 0x8c
	float VertMultiplier; // 0x94
	float HorizMultiplier; // 0x98
	float Acceleration; // 0x9c
	float Smoothing; // 0xa0
	float EscapeVelocityStrength; // 0xa4
	char bScalePawnMovement : 1; // 0xa8
	char bRelativeX : 1; // 0xa8
	char bRelativeY : 1; // 0xa8
	char bRelativeSizeX : 1; // 0xa8
	char bRelativeSizeY : 1; // 0xa8
	char bActiveSizeYFromX : 1; // 0xa8
	char bSizeYFromSizeX : 1; // 0xa8
	char bApplyGlobalScaleToActiveSizes : 1; // 0xa8
	char bCenterX : 0; // 0xa8
	char bCenterY : 0; // 0xa8
	char bIsInvisible : 0; // 0xa8
	char bQuickDoubleTap : 0; // 0xa8
	char bCenterOnEvent : 0; // 0xa8
	char bSliderHasTrack : 0; // 0xa8
	char bFloatingTiltZone : 0; // 0xa8
	char bUseGentleTransitions : 0; // 0xa8
	char bAllowFirstDeltaForTrackballZone : 0; // 0xa8
	char bRenderGuides : 0; // 0xa8
	char bIsDoubleTapAndHold : 0; // 0xa8
	float X; // 0xac
	float Y; // 0xb0
	float SizeX; // 0xb4
	float SizeY; // 0xb8
	float ActiveSizeX; // 0xbc
	float ActiveSizeY; // 0xc0
	float InitialX; // 0xc4
	float InitialY; // 0xc8
	float InitialSizeX; // 0xcc
	float InitialSizeY; // 0xd0
	float InitialActiveSizeX; // 0xd4
	float InitialActiveSizeY; // 0xd8
	float AuthoredGlobalScale; // 0xdc
	float Border; // 0xe0
	float ResetCenterAfterInactivityTime; // 0xe4
	float TapDistanceConstraint; // 0xe8
	float ActivateTime; // 0xec
	float DeactivateTime; // 0xf0
	FColor RenderColor; // 0xf4
	float InactiveAlpha; // 0xf8
	float CaptionXAdjustment; // 0xfc
	float CaptionYAdjustment; // 0x100
	ObjectProperty OverrideTexture1; // 0x104
	FString OverrideTexture1Name; // 0x10c
	FTextureUVs OverrideUVs1; // 0x11c
	ObjectProperty OverrideTexture2; // 0x12c
	FString OverrideTexture2Name; // 0x134
	FTextureUVs OverrideUVs2; // 0x144
	FVector2D InitialLocation; // 0x154
	FVector2D CurrentLocation; // 0x15c
	FVector2D CurrentCenter; // 0x164
	FVector2D InitialCenter; // 0x16c
	FVector2D PreviousLocations[0x6]; // 0x174
	float PreviousMoveDeltaTimes[0x6]; // 0x1a4
	int32_t PreviousLocationCount; // 0x1bc
	float LastTouchTime; // 0x1c0
	float TimeSinceLastTapRepeat; // 0x1c4
	float AnimatingFadeOpacity; // 0x1c8
	ObjectProperty InputOwner; // 0x1cc
	float TransitionTime; // 0x1d4
	FVector2D EscapeVelocity; // 0x1d8
	TArray<ObjectProperty> MobileSeqEventHandlers; // 0x1e0
	FVector2D LastAxisValues; // 0x1f0
	float TotalActiveTime; // 0x1f8
	float LastWentActiveTime; // 0x1fc
	DelegateProperty __OnProcessInputDelegate__Delegate; // 0x200
	DelegateProperty __OnTapDelegate__Delegate; // 0x210
	DelegateProperty __OnDoubleTapDelegate__Delegate; // 0x220
	DelegateProperty __OnProcessSlide__Delegate; // 0x230
	DelegateProperty __OnPreDrawZone__Delegate; // 0x240
	DelegateProperty __OnPostDrawZone__Delegate; // 0x250
};

struct ANxForceFieldSpawnable {
	ComponentProperty ForceFieldComponent; // 0x280
};

struct UMaterialExpressionMaterialFunctionCall {
	ObjectProperty MaterialFunction; // 0xb0
	TArray<FFunctionExpressionInput> FunctionInputs; // 0xb8
	TArray<FFunctionExpressionOutput> FunctionOutputs; // 0xc8
};

struct ATgDevice_Longbow {
	float s_fLastFireHoldPct; // 0xaec
	float m_fFireReleasePercent; // 0xaf0
	float m_fReticleReleaseAnimationDuration; // 0xaf4
};

struct AMobileHUD {
	char bShowGameHud : 1; // 0x5a0
	char bShowMobileHud : 1; // 0x5a0
	char bForceMobileHUD : 1; // 0x5a0
	char bShowMobileTilt : 1; // 0x5a0
	char bDebugTouches : 1; // 0x5a0
	char bDebugZones : 1; // 0x5a0
	char bDebugZonePresses : 1; // 0x5a0
	char bShowMotionDebug : 1; // 0x5a0
	ObjectProperty JoystickBackground; // 0x5a4
	FTextureUVs JoystickBackgroundUVs; // 0x5ac
	ObjectProperty JoystickHat; // 0x5bc
	FTextureUVs JoystickHatUVs; // 0x5c4
	ObjectProperty ButtonImages[0x2]; // 0x5d4
	FTextureUVs ButtonUVs[0x2]; // 0x5e4
	ObjectProperty ButtonFont; // 0x604
	FColor ButtonCaptionColor; // 0x60c
	ObjectProperty TrackballBackground; // 0x610
	FTextureUVs TrackballBackgroundUVs; // 0x618
	ObjectProperty TrackballTouchIndicator; // 0x628
	FTextureUVs TrackballTouchIndicatorUVs; // 0x630
	ObjectProperty SliderImages[0x4]; // 0x640
	FTextureUVs SliderUVs[0x4]; // 0x660
	float MobileTiltX; // 0x6a0
	float MobileTiltY; // 0x6a4
	float MobileTiltSize; // 0x6a8
	TArray<ObjectProperty> KismetRenderEvents; // 0x6ac
};

struct AKAsset {
	ComponentProperty SkeletalMeshComponent; // 0x280
	char bDamageAppliesImpulse : 1; // 0x288
	char bWakeOnLevelStart : 1; // 0x288
	char bBlockPawns : 1; // 0x288
	ObjectProperty ReplicatedMesh; // 0x28c
	ObjectProperty ReplicatedPhysAsset; // 0x294
};

struct ATgDevice_AuraPerTarget {
	int32_t m_nAppliedStacks; // 0xb34
};

struct UTgInventoryObject_Listen_Combo_Barik {
	TArray<FComboInfo> m_ComboInfoList; // 0xd0
	TArray<FUIMarkInfo> m_UIMarkInfoList; // 0xe0
	TArray<FBurningMarkInfo> m_BurningMarks; // 0xf0
};

struct UTgTutorialAnnouncer {
	TArray<ObjectProperty> TutorialSounds; // 0x60
	TArray<ObjectProperty> QueuedSounds; // 0x70
	ComponentProperty CurrentSoundAC; // 0x80
	ObjectProperty OwnerPC; // 0x88
};

struct USkelControl_Multiply {
	float Multiplier; // 0xd0
};

struct UNavMeshGoal_Filter {
	char bShowDebug : 1; // 0x60
	int32_t NumNodesThrownOut; // 0x64
	int32_t NumNodesProcessed; // 0x68
};

struct UKMeshProps {
	FVector COMNudge; // 0x60
	FKAggregateGeom AggGeom; // 0x6c
};

struct ATgProjectile {
	FPointer VfTable_ITgSkinnableInterface; // 0x2dc
	FPointer VfTable_ITgObserver_ViewTargetChanged; // 0x2e4
	ObjectProperty s_LastDefaultMode; // 0x2ec
	int32_t r_nProjectileId; // 0x2f4
	int32_t m_nFiringInstance; // 0x2f8
	float r_fDuration; // 0x2fc
	float m_fPostLandDuration; // 0x300
	float m_fLandZThreshold; // 0x304
	float m_fPersistTime; // 0x308
	float m_fPersistHitPulse; // 0x30c
	int32_t m_nTargetPhysicalType; // 0x310
	ComponentProperty c_Mesh; // 0x314
	ObjectProperty c_ExplosionFx; // 0x31c
	ObjectProperty c_ImpactFx; // 0x324
	char c_bRotationFollowsVelocity : 1; // 0x32c
	char m_bExplodeAtMaxRange : 1; // 0x32c
	char m_bDeployOnCharacter : 1; // 0x32c
	char m_bDeployOnTarget : 1; // 0x32c
	char m_bDeployOnGround : 1; // 0x32c
	char m_bAlwaysDeployUpwards : 1; // 0x32c
	char m_bStickToWalls : 1; // 0x32c
	char c_bIsAOE : 1; // 0x32c
	char m_bCountDirectHitForAOE : 0; // 0x32c
	char m_bUseAOEDirectHit : 0; // 0x32c
	char m_bHasExploded : 0; // 0x32c
	char m_bHitValidTarget : 0; // 0x32c
	char m_bIngoreBehindProjCollisions : 0; // 0x32c
	char m_bIsInitialized : 0; // 0x32c
	char m_bIsShutDown : 0; // 0x32c
	char m_bPIEInitialized : 0; // 0x32c
	char m_bHasPlayedFizzleFX : 0; // 0x32c
	char m_bHasPlayedHitWallFX : 0; // 0x32c
	char m_bHasPlayedHitTargetFX : 0; // 0x32c
	char m_bSuppressDeployableSpawn : 0; // 0x32c
	char m_bAltFireHit : 0; // 0x32c
	char m_bInvertTeam : 0; // 0x32c
	char m_bFirstShotAfterMovementAbility : 0; // 0x32c
	char m_bCanSpawnOnClientFirst : 0; // 0x32c
	char s_bIsClientTouch : 0; // 0x32c
	char m_bTrackToWorldLocation : 0; // 0x32c
	float r_fAccelRate; // 0x330
	float m_fTossZ; // 0x334
	float m_fFireAngle; // 0x338
	ObjectProperty r_Owner; // 0x33c
	int32_t r_nOwnerFireModeId; // 0x344
	ObjectProperty m_OwnerFireMode; // 0x348
	TArray<ObjectProperty> m_ExtraFireModes; // 0x350
	float r_fRange; // 0x360
	float m_fProximityDistance; // 0x364
	ObjectProperty m_CollisionProxy; // 0x368
	int32_t s_nSpawnBotId; // 0x370
	int32_t s_nSpawnDeployableId; // 0x374
	SpawnDeployableOrientation m_DeployableSpawnOrientation; // 0x378
	TG_EQUIP_POINT r_eEquippedAt; // 0x379
	float m_fDamageRadius; // 0x37c
	FVector r_vSpawnLocation; // 0x380
	FVector m_vSpawnRotation; // 0x38c
	FVector m_vLocationLastTick; // 0x398
	float m_fMinTravelRange; // 0x3a4
	float s_fSpawnTime; // 0x3a8
	int32_t m_nPostRenderIcon; // 0x3ac
	int32_t m_nUniqueId; // 0x3b0
	float m_fBaseDamageMultiplier; // 0x3b4
	FVector c_vHitWallVelocity; // 0x3b8
	ComponentProperty LightEnvironment; // 0x3c4
	FVector m_vSpawnPosition; // 0x3cc
	ComponentProperty m_DebugProximityDistancePSC; // 0x3d8
	float m_fStandingStillPercent; // 0x3e0
	int32_t m_nTargetsHitCount; // 0x3e4
	FCollisionSettingsProjectile m_CollisionSettings; // 0x3e8
	TArray<ObjectProperty> m_PassThroughTargets; // 0x3ec
	FTrackingSettings m_TrackingSettings; // 0x3fc
	float m_fDelayTrackSeconds; // 0x414
	float m_fExplosionOffsetDistance; // 0x418
	FTraceHitInfo m_BodyTraceResult; // 0x41c
	float s_fAoeRewindTime; // 0x444
	ObjectProperty m_AkActorUnoccluded; // 0x448
};

struct UTgGameDC_Player {
	int32_t m_nStatCount; // 0x170
	ObjectProperty m_ReviveTimer; // 0x174
	ObjectProperty m_UltimateTimer; // 0x17c
	float m_PrevUltTimer; // 0x184
	ObjectProperty m_StatsArray; // 0x188
	ObjectProperty m_ItemStoreArray; // 0x190
	ObjectProperty m_ActiveItemArray; // 0x198
	ObjectProperty m_ConsumableArray; // 0x1a0
	DelegateProperty __USC_ForceStatsUpdate_Delegate__Delegate; // 0x1a8
};

struct UUIData_EsportsDisplayGroup {
	FString m_sName; // 0x60
	TArray<int32_t> m_nGroupIds; // 0x70
};

struct UTgAIBehaviorAction_SelectThreatCombatTarget {
	char bMustBeHighestThreat : 1; // 0x94
	char bMustBeInLeash : 1; // 0x94
	char bMustBeInSightRadius : 1; // 0x94
	char bEffectGroupCategoryCheckInstigator : 1; // 0x94
	char bMustBeHittable : 1; // 0x94
	ECombatTargetType TargetType; // 0x98
	int32_t EffectCategoryId; // 0x9c
};

struct UUIData_String {
	FString m_sValue; // 0x60
};

struct UUIInteractable_Button_Purchase {
	char m_bHolding : 1; // 0x140
	char m_bPrimed : 1; // 0x140
	float m_fHoldTimer; // 0x144
	float m_fHoldDuration; // 0x148
	ObjectProperty m_mcTF; // 0x14c
	ObjectProperty m_mcRadialMask; // 0x154
	ObjectProperty m_mcKeyContainer; // 0x15c
	ObjectProperty m_pKey; // 0x164
	ObjectProperty m_pCurrency; // 0x16c
	ObjectProperty m_pRealMoneyPrice; // 0x174
	ObjectProperty m_PressAction; // 0x17c
	ObjectProperty m_ReleaseAction; // 0x184
};

struct ANxGenericForceField {
	FFG_ForceFieldCoordinates Coordinates; // 0x2d4
	FVector Constant; // 0x2d8
	FVector PositionMultiplierX; // 0x2e4
	FVector PositionMultiplierY; // 0x2f0
	FVector PositionMultiplierZ; // 0x2fc
	FVector PositionTarget; // 0x308
	FVector VelocityMultiplierX; // 0x314
	FVector VelocityMultiplierY; // 0x320
	FVector VelocityMultiplierZ; // 0x32c
	FVector VelocityTarget; // 0x338
	FVector Noise; // 0x344
	FVector FalloffLinear; // 0x350
	FVector FalloffQuadratic; // 0x35c
	float TorusRadius; // 0x368
	FPointer LinearKernel; // 0x36c
};

struct UTgExplosionLight {
	char bCheckFrameRate : 1; // 0x240
	char bInitialized : 1; // 0x240
	char bIsEnemy : 1; // 0x240
	char bIsLocal : 1; // 0x240
	char bIsLooping : 1; // 0x240
	float HighDetailFrameTime; // 0x244
	float Lifetime; // 0x248
	int32_t TimeShiftIndex; // 0x24c
	TArray<FLightValues> TimeShift; // 0x250
	int32_t LoopIndex; // 0x260
	DelegateProperty __OnLightFinished__Delegate; // 0x264
};

struct ATgPawn_Pet {
	float m_fOwnerPhysPowerItemPercent; // 0x2e78
	float m_fOwnerMagicalPowerItemPercent; // 0x2e7c
	float m_fOwnerUltilityPowerItemPercent; // 0x2e80
	EPetPhase s_PetPhase; // 0x2e84
	EPetPosition s_PetPosition; // 0x2e85
	FRotator s_LastPositionAdjustmentRotation; // 0x2e88
	FVector s_InterpolatedPetPosition; // 0x2e94
	FVector s_InterpolatedPetOwnerPosition; // 0x2ea0
	float s_fPetPositionDistanceMultiplier; // 0x2eac
	float s_fOwnerVelocityTime; // 0x2eb0
	float s_fSmoothedMaxSpeed; // 0x2eb4
	ObjectProperty c_BeamFX; // 0x2eb8
	FRotator r_InitialOrientation; // 0x2ec0
	ComponentProperty c_AimVisibilityMesh; // 0x2ecc
};

struct UMCPBase {
	FPointer VfTable_FTickableObject; // 0x78
};

struct UDOFAndBloomEffect {
	float BloomScale; // 0xb4
	float BloomThreshold; // 0xb8
	FColor BloomTint; // 0xbc
	float BloomScreenBlendThreshold; // 0xc0
	float SceneMultiplier; // 0xc4
	float BlurBloomKernelSize; // 0xc8
	char bEnableReferenceDOF : 1; // 0xcc
	EDOFType DepthOfFieldType; // 0xd0
	EDOFQuality DepthOfFieldQuality; // 0xd1
	ObjectProperty BokehTexture; // 0xd4
};

struct AGameExplosionActor {
	char bHasExploded : 1; // 0x280
	char bExplodeMoreThanOnce : 1; // 0x280
	char bTrackExplosionParticleSystemLifespan : 1; // 0x280
	char bDrawDebug : 1; // 0x280
	ComponentProperty ExplosionLight; // 0x284
	ComponentProperty ExplosionRadialBlur; // 0x28c
	float LightFadeTime; // 0x294
	float LightFadeTimeRemaining; // 0x298
	float LightInitialBrightness; // 0x29c
	float RadialBlurFadeTime; // 0x2a0
	float RadialBlurFadeTimeRemaining; // 0x2a4
	float RadialBlurMaxBlurAmount; // 0x2a8
	ObjectProperty ExplosionTemplate; // 0x2ac
	ComponentProperty RadialImpulseComponent; // 0x2b4
	ObjectProperty InstigatorController; // 0x2bc
	ObjectProperty HitActorFromPhysMaterialTrace; // 0x2c4
	FVector HitLocationFromPhysMaterialTrace; // 0x2cc
	ObjectProperty Attachee; // 0x2d8
	ObjectProperty AttacheeController; // 0x2e0
	float DirectionalExplosionMinDot; // 0x2e8
	FVector ExplosionDirection; // 0x2ec
};

struct UTgAnimMetaData_SkelControl_BoneScale {
	TArray<FName> SkelControlNameList; // 0x60
	float BoneScale; // 0x70
	char bFullControlOverController : 1; // 0x74
	FName SkelControlName; // 0x78
};

struct ATgRepInfo_Factory {
	ReplicatedFactoryState s_FactoryState; // 0x280
	ReplicatedFactoryState r_FactoryState[0x3]; // 0x281
	char r_bVisibleOnMap[0x3]; // 0x284
	char r_bRespawnVisible[0x3]; // 0x287
	MinimapFactoryType r_MinimapType; // 0x28a
	ObjectProperty r_FactoryOwner; // 0x28c
	ObjectProperty r_TaskforceInfo; // 0x294
	int32_t r_nFactoryId; // 0x29c
	ObjectProperty r_LastSpawnedRepInfo; // 0x2a0
	float r_fRespawnDelay; // 0x2a8
	float r_fRespawnTimer; // 0x2ac
};

struct ATgDevice_DragonSlam {
	char m_bHasHitTarget : 1; // 0xaec
	ObjectProperty m_CollisionProxy; // 0xaf0
	ObjectProperty m_DrogozLeg1; // 0xaf8
};

struct UTgSeqOp_MathCalc {
	float m_fResult; // 0xec
};

struct UTgAnimBlendByFire {
	char m_bSetToIdleOnCeaseRelevant : 1; // 0x168
	char m_bShouldReplayIfAlreadyActive : 1; // 0x168
	FDeviceParameters m_InHandDeviceParameters; // 0x16c
	FDeviceParameters m_OffHand1DeviceParameters; // 0x180
	FDeviceParameters m_OffHand2DeviceParameters; // 0x194
	FDeviceParameters m_OffHand3DeviceParameters; // 0x1a8
	FDeviceParameters m_OffHand4DeviceParameters; // 0x1bc
	FDeviceParameters m_RecallDeviceParameters; // 0x1d0
	ObjectProperty m_OwningPawn; // 0x1e4
};

struct UTgAnimNodeSequence_SyncToCooldown {
	TG_EQUIP_POINT m_EqpPoint; // 0x1bc
	float m_fMaxPlayRate; // 0x1c0
	float m_fPlayRateWaitForCooldown; // 0x1c4
	float m_fPctStartWaitForCooldown; // 0x1c8
	float fCooldownEndTime; // 0x1cc
	char bWaitForCooldown : 1; // 0x1d0
};

struct UTgAIUtilityFunction {
	float MinInput; // 0xbc
	float MaxInput; // 0xc0
	EGraphType FunctionType; // 0xc4
	float DesiredValue; // 0xc8
	float UtilityScale; // 0xcc
	char bInvert : 1; // 0xd0
};

struct UTgInventoryObject_Listen_Weaken {
	int32_t m_nAppliedCategoryCodeToCheck; // 0xd4
};

struct ATgInterpolatingCameraActor {
	TArray<FInterpolatingCameraInfo> m_CameraArray; // 0x420
	int32_t m_nCurrentCameraIndex; // 0x430
	float m_fCurrentInterpValue; // 0x434
	float m_fTargetInterpValue; // 0x438
};

struct UTgSeqAct_RespawnAllPlayers {
	char bResetLivingPlayers : 1; // 0x108
	char bResetDeadPlayers : 1; // 0x108
	char bResetHealth : 1; // 0x108
};

struct ATgPlayerStartRoyale {
	ERoyaleRegion m_Region; // 0x388
};

struct UInterpTrackLinearColorProp {
	FName PropertyName; // 0xb8
};

struct ATgDevice_Turret {
	int32_t m_FlameTurretID; // 0xaec
	int32_t m_MegaTurretID; // 0xaf0
	int32_t m_LockdownTurretID; // 0xaf4
	FVector m_SpawnLocationOverride; // 0xaf8
	char m_bLockdownIsOn : 1; // 0xb04
	char m_bHasFlamethrowerTurret : 1; // 0xb04
	char m_bHasMegaTurret : 1; // 0xb04
};

struct UTgSynchronizedTimer {
	char m_bPausedByGame : 1; // 0x118
	char m_bSuppressCallback : 1; // 0x118
	char m_bRunning : 1; // 0x118
	char m_bPaused : 1; // 0x118
	ObjectProperty m_MP; // 0x11c
	ObjectProperty m_TimerManager; // 0x124
};

struct UAnimNodeSlot {
	char bIsPlayingCustomAnim : 1; // 0x114
	char bEarlyAnimEndNotify : 1; // 0x114
	char bSkipBlendWhenNotRendered : 1; // 0x114
	char bAdditiveAnimationsOverrideSource : 1; // 0x114
	char bIsBeingUsedByInterpGroup : 1; // 0x114
	char bDontAddToAlwaysTickArray : 1; // 0x114
	float PendingBlendOutTime; // 0x118
	int32_t CustomChildIndex; // 0x11c
	int32_t TargetChildIndex; // 0x120
	TArray<float> TargetWeight; // 0x124
	float BlendTimeToGo; // 0x134
};

struct AReverbVolume {
	float Priority; // 0x2bc
	char bEnabled : 1; // 0x2c0
	char m_bUseAudioAltitude : 1; // 0x2c0
	FReverbSettings Settings; // 0x2c4
	FInteriorSettings AmbientZoneSettings; // 0x2d4
	ObjectProperty NextLowerPriorityVolume; // 0x304
	FName AuxBusName; // 0x30c
	float SendLevel; // 0x314
	float m_fAudioAltitudeCeiling; // 0x318
	float m_fAudioAltitudeFloor; // 0x31c
};

struct UUIDataStore_GameResource {
	TArray<FGameResourceDataProvider> ElementProviderTypes; // 0x98
	FMultiMap_Mirror ListElementProviders; // 0xa8
};

struct UParticleModuleSizeScale {
	FRawDistributionVector SizeScale; // 0x68
	char EnableX : 1; // 0x8c
	char EnableY : 1; // 0x8c
	char EnableZ : 1; // 0x8c
};

struct ULevelStreamingDistance {
	FVector Origin; // 0x100
	float MaxDistance; // 0x10c
};

struct USeqAct_GetVelocity {
	float VelocityMag; // 0x108
	FVector VelocityVect; // 0x10c
};

struct UTgBattleCheatManager {
	ObjectProperty m_DebugCameraController; // 0xa0
	TArray<ObjectProperty> m_DebugPlayerStarts; // 0xa8
	ObjectProperty m_LastGotoPRI; // 0xb8
};

struct UMaterialExpressionParameter {
	FName ParameterName; // 0xb0
	FGuid ExpressionGUID; // 0xb8
	FName Group; // 0xc8
};

struct UMcpClashMobManager {
	FString ChallengeListUrl; // 0xe8
	FString ChallengeStatusUrl; // 0xf8
	FString ChallengeMultiStatusUrl; // 0x108
	FString AcceptChallengeUrl; // 0x118
	FString UpdateChallengeProgressUrl; // 0x128
	FString UpdateRewardProgressUrl; // 0x138
	ObjectProperty HTTPRequestChallengeList; // 0x148
	TArray<FMcpChallengeUserRequest> ChallengeUserRequests; // 0x150
	TArray<FMcpClashMobChallengeEvent> ChallengeEvents; // 0x160
	TArray<FMcpClashMobChallengeUserStatus> ChallengeUserStatus; // 0x170
	FMcpClashMobChallengeUserStatus TempChallengeUserStatus; // 0x180
	TArray<FMcpClashMobChallengeUserStatus> TempChallengeUserStatusArray; // 0x200
	TScriptInterface<Class> FileCache; // 0x210
	ObjectProperty FileDownloader; // 0x220
};

struct UTgAIBehaviorCondition_CombatTargetHealthPercentAfterAttack {
	TG_EQUIP_POINT DeviceSlot; // 0x98
	float HealthPct; // 0x9c
};

struct UUIData_ItemQuest {
	Fdword m_dwPurchasePortion; // 0xb8
};

struct UTgInventoryObject_Listen_ForgeDevice {
	char bFirstItem : 1; // 0xc8
};

struct ATgRepInfo_Game {
	TArray<FGraphData> m_GraphData; // 0x2e8
	FGraphData r_LastDataPoint; // 0x2f8
	float m_GraphUpdateWaitTime; // 0x304
	TG_GAME_TYPE r_GameType; // 0x308
	EHUDType r_eHUDType; // 0x309
	INITIALIZEABLE_BOOL r_eTalentsEnabled; // 0x30a
	MissionTimerState r_nMissionTimerState; // 0x30b
	GameTimerState r_eGameTimerState; // 0x30c
	MissionTimerState r_nRoundLimitTimerState; // 0x30d
	MissionTimerState r_nSecondaryTimerState; // 0x30e
	char r_nLastRoundAttacker; // 0x30f
	char r_nLastRoundWinner; // 0x310
	EFlagState r_FlagState[0x2]; // 0x311
	EGameEnvironmentRule r_GameEnvironmentRule; // 0x313
	EGameRespawnRule r_GameRespawnRule; // 0x314
	EGameMode r_GameMode; // 0x315
	char r_bIsMission : 1; // 0x318
	char r_bGameHasSetup : 1; // 0x318
	char r_bGameAllowsAchievements : 1; // 0x318
	char r_bAllowSpawnGuardDuringDeviceFire : 1; // 0x318
	char r_bBlockCreditGain : 1; // 0x318
	char r_bBlockEnergyGain : 1; // 0x318
	char r_bDisablePlayerMovement : 1; // 0x318
	char r_bOvertime : 1; // 0x318
	char r_bCapturePointOvertime : 0; // 0x318
	char r_bLimitBurnCardsToOnePerCategory : 0; // 0x318
	char r_bRoundEnding : 0; // 0x318
	char r_bFadeOutAtRoundEnd : 0; // 0x318
	char r_bIntroPlayed : 0; // 0x318
	char r_bUsePointsMode : 0; // 0x318
	char r_bUltimatesLocked : 0; // 0x318
	char r_bSuddenDeath : 0; // 0x318
	char r_bEnableDistanceFOW : 0; // 0x318
	char r_bSpawnGatesOpen : 0; // 0x318
	char r_bAttackersSpawnGatesOpen : 0; // 0x318
	char r_bDefendersSpawnGatesOpen : 0; // 0x318
	char r_bForwardProgress : 0; // 0x318
	char r_bServerFlagSprint : 0; // 0x318
	char r_bServerFlagMinimapTeamVisibility : 0; // 0x318
	char r_bForce3P : 0; // 0x318
	char r_bForce1P : 0; // 0x318
	char r_bForceOutOfCombatSprint : 0; // 0x318
	char r_bAutoMelee : 0; // 0x318
	char r_bShowProjectileProximityDistance : 0; // 0x318
	char r_bDisableProjectileProximityDistance : 0; // 0x318
	char r_bShowHeadMesh : 0; // 0x318
	char r_bUseInstantFireMeshTrace : 0; // 0x318
	char r_bAllowWeaponLagPrediction : 0; // 0x318
	char r_bSiegeEngineRequiresAlliesToMove : 1; // 0x31c
	char r_bSiegeEngineMovementPaused : 1; // 0x31c
	char r_bSiegeEngineMovementPausedAfterDamagingGate : 1; // 0x31c
	char r_bFogConverging : 1; // 0x31c
	char r_bFogEnded : 1; // 0x31c
	char r_bCheckpoint1Reached : 1; // 0x31c
	char r_bCheckpoint2Reached : 1; // 0x31c
	char r_bEnableHeadshots : 1; // 0x31c
	char r_bAllowPlayerMounting : 0; // 0x31c
	char r_bKillCamEnabled : 0; // 0x31c
	char r_bAttackersKillCamEnabled : 0; // 0x31c
	char r_bDefendersKillCamEnabled : 0; // 0x31c
	char r_bBlockKillCam : 0; // 0x31c
	char r_bIsFirstRound : 0; // 0x31c
	char r_bSpawnGatesOpenedAtLeastOnce : 0; // 0x31c
	char r_bDeploying : 0; // 0x31c
	char r_bUseRespawns : 0; // 0x31c
	char m_bNameplatesRequireLOS : 0; // 0x31c
	char m_bTeamVGS : 0; // 0x31c
	char r_bAlliances : 0; // 0x31c
	float r_fMissionRemainingTime; // 0x320
	int32_t r_nMissionTimerStateChange; // 0x324
	float r_fMissionTime; // 0x328
	float c_fMissionTime; // 0x32c
	float c_fMissionTimeSeconds; // 0x330
	float c_fAIBotDelaySeconds; // 0x334
	float r_fRoundLimitElapsed; // 0x338
	float r_fRoundLimitDuration; // 0x33c
	float r_fSecondaryRemainingTime; // 0x340
	int32_t r_nSecondaryTimerStateChange; // 0x344
	float r_fSecondaryTime; // 0x348
	float c_fSecondaryMissionTime; // 0x34c
	float c_fSecondaryMissionTimeSeconds; // 0x350
	float r_fCapturePointOvertimeStartDuration; // 0x354
	int32_t r_nCapturePointOvertimeStateChange; // 0x358
	float r_fPayloadOvertimeStartDuration; // 0x35c
	int32_t r_nPayloadOvertimeStateChange; // 0x360
	float r_fTF1PayloadPushDistance; // 0x364
	int32_t r_nPurchaseTime; // 0x368
	float m_fPurchaseTimer; // 0x36c
	int32_t r_nGlobalItemPurchaseOverride; // 0x370
	int32_t r_nGlobalLoadoutChangeOverride; // 0x374
	ObjectProperty r_AttackingTaskForce; // 0x378
	ObjectProperty r_CapturingTaskForce; // 0x380
	int32_t r_nChaosRemainingAttackDefendTime; // 0x388
	ObjectProperty r_Winner; // 0x38c
	float r_fPhysicsThreshold; // 0x394
	FString r_sQueueName; // 0x398
	int32_t r_nPlayOfTheGamePawnId; // 0x3a8
	int32_t r_nPlayOfTheGameMapLane; // 0x3ac
	float r_fPlayOfTheGameTimeStamp; // 0x3b0
	ObjectProperty c_PlayOfTheGameCamera; // 0x3b4
	TArray<ObjectProperty> m_Deployables; // 0x3bc
	TArray<ObjectProperty> m_Projectiles; // 0x3cc
	TArray<ObjectProperty> m_Destructibles; // 0x3dc
	TArray<ObjectProperty> m_DRIArray; // 0x3ec
	TArray<ObjectProperty> m_CPRIArray; // 0x3fc
	TArray<ObjectProperty> m_CapturePoints; // 0x40c
	TArray<ObjectProperty> m_MovableProjBlockers; // 0x41c
	int32_t r_nCurrentCheckpoint[0x2]; // 0x42c
	int32_t c_nNextClientOnlyProjectileInstanceId; // 0x434
	ObjectProperty r_SquadTarget1; // 0x438
	ObjectProperty r_SquadTarget2; // 0x440
	float r_fLastSquadTargetUpdate1; // 0x448
	float r_fLastSquadTargetUpdate2; // 0x44c
	float r_fSpeedScale; // 0x450
	float r_fPayloadProgressPercent; // 0x454
	float r_fCheckpoint1Percent; // 0x458
	float r_fCheckpoint2Percent; // 0x45c
	float r_fServerFlagDamageMultiplier; // 0x460
	float r_fServerFlagGroundSpeedModifier; // 0x464
	float r_fServerFlagAutoHealingMultiplier; // 0x468
	float r_fFogDensity; // 0x46c
	float r_fFogStartDistance; // 0x470
	float r_fFogObscureDistance; // 0x474
	ObjectProperty c_Fog; // 0x478
	int32_t r_nPersistentTextID; // 0x480
	int32_t r_nRemainingObjectiveTime; // 0x484
	int32_t r_nTotalObjectiveTime; // 0x488
	float r_fPlayerViewDistance; // 0x48c
	float r_fVisibilityVolumeViewDistance; // 0x490
	float r_fPushTimer; // 0x494
	float r_fWeaponMaxLagCompensation; // 0x498
	float m_fVaultImmuneToSiegeEngineHealth; // 0x49c
	float r_fConvergeDistance; // 0x4a0
	float r_fConvergeStartDistance; // 0x4a4
	float r_fFogConvergeInterval; // 0x4a8
	float r_fFinalFogDirection; // 0x4ac
	int32_t r_nTaskForcePushSuccessful; // 0x4b0
	int32_t r_nTaskForceDefenseSuccessful; // 0x4b4
	int32_t r_nMapLane; // 0x4b8
	float r_fGlobalFrictionFalling; // 0x4bc
	float r_fGlobalFrictionFlying; // 0x4c0
	TArray<ObjectProperty> c_pForges; // 0x4c4
	TArray<ObjectProperty> c_pCatapults; // 0x4d4
	FBotDifficultyDebugData r_DifficultyDebugData; // 0x4e4
	int32_t r_nStartTime; // 0x548
	int32_t r_nDeployTime; // 0x54c
	int32_t r_nPrepareTime; // 0x550
	int32_t r_nDeathFogTime; // 0x554
	int32_t r_nRemainingTime; // 0x558
	int32_t r_nPreConvergeTime; // 0x55c
	int32_t r_nConvergeTime; // 0x560
	int32_t r_nTeamsTotal; // 0x564
	int32_t r_nTeamsAlive; // 0x568
	int32_t r_nPlayersAlive; // 0x56c
	int32_t r_nPlayersTotal; // 0x570
	float r_fReviveTotalTime; // 0x574
	ObjectProperty r_pFog; // 0x578
	float r_ScrimmageX; // 0x580
	float r_ScrimmageY; // 0x584
	float m_fMaxSilhouetteRange; // 0x588
	FInitialFogInfo r_InitialFogInfo; // 0x58c
	FLeaderboardTeam m_LeaderboardTeams[0x3]; // 0x59c
	int32_t r_nDisenchantValues[0x4]; // 0x674
	int32_t r_nPlayers[0x2]; // 0x684
	ObjectProperty r_pTeamZeppelins[0x2]; // 0x68c
	FVector r_vTeamZeppelinSpawnLoc; // 0x69c
	FRotator r_rTeamZeppelinSpawnRot; // 0x6a8
	TMap<None, None> m_TeamWaypoints; // 0x6b4
	TMap<None, None> m_TeamPings; // 0x6fc
};

struct AMobileDebugCameraHUD {
	char bDrawDebugText : 1; // 0x6bc
};

struct USequenceFrame {
	int32_t SizeX; // 0x98
	int32_t SizeY; // 0x9c
	int32_t BorderWidth; // 0xa0
	char bDrawBox : 1; // 0xa4
	char bFilled : 1; // 0xa4
	char bTileFill : 1; // 0xa4
	FColor BorderColor; // 0xa8
	FColor FillColor; // 0xac
};

struct UUIComponent {
	FPointer VfTable_ITgCallbackInterface; // 0x60
	UICOMPONENTTYPE m_ComponentType; // 0x68
	ObjectProperty m_Owner; // 0x6c
	ObjectProperty m_mcRoot; // 0x74
	FString m_sLoadName; // 0x7c
	int32_t m_nLoadIndex; // 0x8c
	FString m_sConstructName; // 0x90
	char m_bConstructed : 1; // 0xa0
	char m_bCenteredHorizontally : 1; // 0xa0
	char m_bCenteredVertically : 1; // 0xa0
	char m_bShouldCreateInput : 1; // 0xa0
	char m_bBlockInputFallThrough : 1; // 0xa0
	char m_bPushInputOnVisible : 1; // 0xa0
	int32_t m_nDeferredUpdateCallbackHandle; // 0xa4
	TArray<ObjectProperty> m_Components; // 0xa8
	FMultiMap_Mirror m_ComponentMap; // 0xb8
	ObjectProperty m_CallbackContainer; // 0x100
	int32_t m_nXBeforeCenter; // 0x108
	int32_t m_nYBeforeCenter; // 0x10c
	ObjectProperty m_InputContext; // 0x110
};

struct UForceFieldShapeSphere {
	ComponentProperty Shape; // 0x60
};

struct UAnimNodeMirror {
	char bEnableMirroring : 1; // 0x114
};

struct USeqVar_Named {
	USequenceVariable* ExpectedType; // 0xa0
	FName FindVarName; // 0xa8
	char bStatusIsOk : 1; // 0xb0
};

struct UTgAnimNodeBlendByAbilitySimple {
	char m_bBlendToActiveOnStartFire : 1; // 0x168
	char m_bBlendToActiveOnFire : 1; // 0x168
	char m_bDelayBlendToActiveUntilAnimEnd : 1; // 0x168
	char m_bDelayBlendToActiveUntilReplay : 1; // 0x168
	char m_bDelayBlendToIdleUntilAnimEnd : 1; // 0x168
	char m_bDelayBlendToIdleUntilReplay : 1; // 0x168
	char m_bBlendToIdleImmediatelyOnInterrupt : 1; // 0x168
	char m_bIsAbilityFiring : 1; // 0x168
	TG_EQUIP_POINT m_EqpPoint; // 0x16c
};

struct AHeightFog {
	ComponentProperty Component; // 0x280
	char bEnabled : 1; // 0x288
};

struct UTgGfxTeamInvite {
	int32_t m_nQueue; // 0x244
	float m_fTimerWidth; // 0x248
	float m_fTimeoutTime; // 0x24c
	float m_fTimeoutTimer; // 0x250
	ObjectProperty m_mcTimer; // 0x254
	ObjectProperty m_mcSubtitle; // 0x25c
	ObjectProperty m_mcButton[0x2]; // 0x264
	TMap<None, None> m_fInviteTimestamps; // 0x274
	ObjectProperty m_AkTeamInvite; // 0x2bc
};

struct UCloudStorageBase {
	TArray<FString> LocalCloudFiles; // 0x80
	char bSuppressDelegateCalls : 1; // 0x90
};

struct UMcpUserInventoryBase {
	FString McpUserInventoryClassName; // 0x78
	DelegateProperty __OnCreateSaveSlotComplete__Delegate; // 0x88
	DelegateProperty __OnDeleteSaveSlotComplete__Delegate; // 0x98
	DelegateProperty __OnQuerySaveSlotListComplete__Delegate; // 0xa8
	DelegateProperty __OnQueryInventoryItemsComplete__Delegate; // 0xb8
	DelegateProperty __OnPurchaseItemComplete__Delegate; // 0xc8
	DelegateProperty __OnSellItemComplete__Delegate; // 0xd8
	DelegateProperty __OnEarnItemComplete__Delegate; // 0xe8
	DelegateProperty __OnConsumeItemComplete__Delegate; // 0xf8
	DelegateProperty __OnDeleteItemComplete__Delegate; // 0x108
	DelegateProperty __OnRecordIapComplete__Delegate; // 0x118
};

struct UTgAIBehaviorCondition_InteractTargetOfType {
	int32_t ByteAlignment; // 0x98
	EInteractTargetType InteractTargetType; // 0x9c
};

struct UParticleModuleUberLTISIVCL {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartVelocity; // 0xc0
	FRawDistributionFloat StartVelocityRadial; // 0xe4
	FRawDistributionVector ColorOverLife; // 0x108
	FRawDistributionFloat AlphaOverLife; // 0x12c
};

struct UNavMeshPath_SameCoverLink {
	ObjectProperty TestLink; // 0x78
};

struct UTgAnimNodeBlendByIntroduction {
	char m_bIsRelevant : 1; // 0x168
};

struct UTgAIInfluenceMap {
	FPointer VfTable_FTickableObject; // 0x60
	TArray<int32_t> Influences; // 0x68
	FPointer FalloffTable; // 0x78
	ObjectProperty InfluenceGrid; // 0x80
	float TickFrequency; // 0x88
	float InvTickFrequency; // 0x8c
	float Decay; // 0x90
	float Momentum; // 0x94
};

struct UMaterialInstanceTimeVarying {
	char bAutoActivateAll : 1; // 0x2f4
	float Duration; // 0x2f8
	TArray<FFontParameterValueOverTime> FontParameterValues; // 0x2fc
	TArray<FScalarParameterValueOverTime> ScalarParameterValues; // 0x30c
	TArray<FTextureParameterValueOverTime> TextureParameterValues; // 0x31c
	TArray<FVectorParameterValueOverTime> VectorParameterValues; // 0x32c
	TArray<FLinearColorParameterValueOverTime> LinearColorParameterValues; // 0x33c
};

struct ATargetPoint {
	int32_t SpawnRefCount; // 0x288
};

struct UTgSeqAct_SetDisenchantEnabled {
	char bEnabled : 1; // 0x108
};

struct ATcpLink {
	ELinkState LinkState; // 0x2a4
	FIpAddr RemoteAddr; // 0x2a8
	ATcpLink* AcceptClass; // 0x2bc
	TArray<char> SendFIFO; // 0x2c4
	FString RecvBuf; // 0x2d4
};

struct UTgDataHandler {
	ObjectProperty m_MP; // 0x118
	TArray<ObjectProperty> m_DataChunkList; // 0x120
};

struct UWaveFormBase {
	ObjectProperty TheWaveForm; // 0x60
};

struct USeqVar_RandomInt {
	int32_t Min; // 0xa4
	int32_t Max; // 0xa8
};

struct UTgAIBehaviorAction_PlayVGS {
	int32_t VoicePackId; // 0x94
	int32_t VgsId; // 0x98
};

struct UForceFeedbackManager {
	char bAllowsForceFeedback : 1; // 0x60
	char bIsPaused : 1; // 0x60
	float ScaleAllWaveformsBy; // 0x64
	TArray<FForceFeedbackPlayingInfo> PlayingWaveforms; // 0x68
};

struct UTgAnimNotify_ToggleInvisibleWall {
	char TurnWallOn : 1; // 0x68
	char TurnOffOnCeaseRelevant : 1; // 0x68
	int32_t WallIndex; // 0x6c
	FVector WallPosition; // 0x70
	FVector WallNormal; // 0x7c
	FName WallEnableBaseName; // 0x88
	FName WallPositionBaseName; // 0x90
	FName WallNormalBaseName; // 0x98
};

struct ATgDevice_DivineWrath {
	FVector m_vLocalAimOffset; // 0xaec
};

struct UExponentialHeightFogComponent {
	char bEnabled : 1; // 0x88
	char bUseActorDirectionForLightDirection : 1; // 0x88
	float FogHeight; // 0x8c
	float FogDensity; // 0x90
	float FogHeightFalloff; // 0x94
	float FogMaxOpacity; // 0x98
	float StartDistance; // 0x9c
	float LightTerminatorAngle; // 0xa0
	float OppositeLightBrightness; // 0xa4
	FColor OppositeLightColor; // 0xa8
	float LightInscatteringBrightness; // 0xac
	FColor LightInscatteringColor; // 0xb0
	FVector DominantDirectionalLightDirection; // 0xb4
};

struct UTgAIBehaviorCondition_NumGodsInCapturePointRadius {
	char bGodsMustBeEnemy : 1; // 0x9c
	int32_t GodThreshold; // 0xa0
};

struct UWindPointSourceComponent {
	ComponentProperty PreviewRadiusComponent; // 0xa0
	float Radius; // 0xa8
};

struct ATgRepInfo_TaskForce {
	int32_t r_nTeamId; // 0x2a0
	int32_t r_nAlliance; // 0x2a4
	char r_bSpectator : 1; // 0x2a8
	FResurrectionInfo r_ResurrectionInfo; // 0x2ac
	ObjectProperty r_TeamZeppelin; // 0x2b4
	int32_t s_nColorIndex; // 0x2bc
	int32_t s_nGodVisionMask; // 0x2c0
	ObjectProperty s_NavTeamDeploy; // 0x2c4
	int32_t r_nScore; // 0x2cc
	int32_t r_nScorePercent; // 0x2d0
	char r_nTaskForce; // 0x2d4
	float r_fSecondaryScore; // 0x2d8
	FFoundLootGoblinInfo r_FoundLootGoblinInfo; // 0x2dc
	TArray<ObjectProperty> m_Factories; // 0x2e8
	TArray<ObjectProperty> m_TeamBots; // 0x2f8
	TArray<ObjectProperty> m_TeamPlayers; // 0x308
};

struct UMaterialExpressionCosine {
	FExpressionInput Input; // 0xb0
	float Period; // 0xe4
};

struct UMaterialExpressionSceneDepth {
	FExpressionInput Coordinates; // 0xb0
	char bNormalize : 1; // 0xe4
};

struct ATgDeploy_ShieldBarik {
	char r_bHasCapsule : 1; // 0x44c
	char r_bHasAcceleratorField : 1; // 0x44c
	char r_bHasImpede : 1; // 0x44c
	char r_bHasBunker : 1; // 0x44c
	char r_bHasFortify : 1; // 0x44c
	TArray<ObjectProperty> m_AcceleratedActors; // 0x450
	ObjectProperty m_CachedPawnOwner; // 0x460
};

struct UMobilePlayerInput {
	FTouchData Touches[0x5]; // 0x2d4
	ObjectProperty InteractiveObject; // 0x464
	FDouble InteractiveObjectLastTime; // 0x46c
	TArray<FMobileInputGroup> MobileInputGroups; // 0x474
	int32_t CurrentMobileGroup; // 0x484
	TArray<ObjectProperty> MobileInputZones; // 0x488
	TArray<FMobileInputZoneClassMap> MobileInputZoneClasses; // 0x498
	float MobilePitch; // 0x4a8
	float MobilePitchCenter; // 0x4ac
	float MobilePitchMultiplier; // 0x4b0
	float MobileYaw; // 0x4b4
	float MobileYawCenter; // 0x4b8
	float MobileYawMultiplier; // 0x4bc
	float MobilePitchDeadzoneSize; // 0x4c0
	float MobileYawDeadzoneSize; // 0x4c4
	float MobileDoubleTapTime; // 0x4c8
	float MobileMinHoldForTap; // 0x4cc
	float MobileTapRepeatTime; // 0x4d0
	char bAllowTouchesInCinematic : 1; // 0x4d4
	char bDisableTouchInput : 1; // 0x4d4
	char bAbsoluteTouchLocations : 1; // 0x4d4
	char bCollapseTouchInput : 1; // 0x4d4
	char bFakeMobileTouches : 1; // 0x4d4
	char bDisableSceneRender : 1; // 0x4d4
	float ZoneTimeout; // 0x4d8
	TArray<ObjectProperty> MobileMenuStack; // 0x4dc
	FString NativeDebugString; // 0x4ec
	float MobileInactiveTime; // 0x4fc
	TArray<ObjectProperty> MobileSeqEventHandlers; // 0x500
	TArray<ObjectProperty> MobileRawInputSeqEventHandlers; // 0x510
	FVector2D MobileViewportOffset; // 0x520
	FVector2D MobileViewportSize; // 0x528
	DelegateProperty __OnTouchNotHandledInMenu__Delegate; // 0x530
	DelegateProperty __OnPreviewTouch__Delegate; // 0x540
	DelegateProperty __OnInputTouch__Delegate; // 0x550
};

struct ASceneCaptureCubeMapActor {
	ComponentProperty StaticMesh; // 0x288
	ObjectProperty CubeMaterialInst; // 0x290
};

struct UPath_AvoidInEscapableNodes {
	int32_t Radius; // 0x6c
	int32_t Height; // 0x70
	int32_t MaxFallSpeed; // 0x74
	int32_t MoveFlags; // 0x78
};

struct UMaterialExpressionConstant2Vector {
	float R; // 0xb0
	float G; // 0xb4
};

struct UPComOpenBroadcaster {
	FPointer VfTable_FCallbackEventDevice; // 0x60
	FString FacebookAppId; // 0x68
	FString FacebookApprovedDomain; // 0x78
	FString FacebookLiveUrl; // 0x88
	EPComOpenBroadcasterState CurrentState; // 0x98
	FPComOpenBroadcasterSettings CurrentSettings; // 0x9c
	FPointer StreamerProcessHandle; // 0xa0
	DelegateProperty __PreloadWebBrowser__Delegate; // 0xa8
	DelegateProperty __IsWebBrowserLoaded__Delegate; // 0xb8
	DelegateProperty __OpenWebBrowser__Delegate; // 0xc8
	DelegateProperty __CloseWebBrowser__Delegate; // 0xd8
};

struct UTgAIBehaviorAction_LookAtFortress {
	char bMustBeEnemy : 1; // 0x94
};

struct USeqCond_SwitchClass {
	TArray<FSwitchClassInfo> ClassArray; // 0xec
};

struct UTgSavedMove {
	char m_byMoveSpeed; // 0x118
	char m_bJumpHeld : 1; // 0x11c
	char m_bUltHeld : 1; // 0x11c
	char m_bMounted : 1; // 0x11c
	char m_bInADS : 1; // 0x11c
	float m_fSimulatedModifiedMovementSpeed; // 0x120
	int32_t m_nBigTeleportCount; // 0x124
};

struct ATgAssaultPoint {
	EAssaultType AssaultPointType; // 0x394
	ELocationType LocationType; // 0x395
};

struct UUIComponent_Item {
	ObjectProperty m_mcName; // 0x120
	ObjectProperty m_mcType; // 0x128
	ObjectProperty m_mcDescription; // 0x130
	ObjectProperty m_mcArtIcon; // 0x138
	ObjectProperty m_mcFrame; // 0x140
	ObjectProperty m_Item; // 0x148
	char m_bCacheDirty : 1; // 0x150
	char m_bDataDirty : 1; // 0x150
	char m_bUseBaseName : 1; // 0x150
	FString m_sDescription; // 0x154
	FString m_sType; // 0x164
	FString m_sName; // 0x174
	float m_fDescriptionCenterOffset; // 0x184
	int32_t m_nTickCallback; // 0x188
};

struct USkelControlBase {
	FName ControlName; // 0x68
	float ControlStrength; // 0x70
	float BlendInTime; // 0x74
	float BlendOutTime; // 0x78
	AlphaBlendType BlendType; // 0x7c
	char bPostPhysicsController : 1; // 0x80
	char bSetStrengthFromAnimNode : 1; // 0x80
	char bInvertStrengthFromAnimNode : 1; // 0x80
	char bInitializedCachedNodeList : 1; // 0x80
	char bControlledByAnimMetada : 1; // 0x80
	char bInvertMetadataWeight : 1; // 0x80
	char bPropagateSetActive : 1; // 0x80
	char bIgnoreWhenNotRendered : 1; // 0x80
	char bShouldTickInScript : 0; // 0x80
	char bShouldTickOwner : 0; // 0x80
	char bEnableEaseInOut : 0; // 0x80
	float StrengthTarget; // 0x84
	float BlendTimeToGo; // 0x88
	TArray<FName> StrengthAnimNodeNameList; // 0x8c
	TArray<ObjectProperty> CachedNodeList; // 0x9c
	float AnimMetadataWeight; // 0xac
	int32_t AnimMetaDataUpdateTag; // 0xb0
	float BoneScale; // 0xb4
	int32_t ControlTickTag; // 0xb8
	int32_t IgnoreAtOrAboveLOD; // 0xbc
	ObjectProperty NextControl; // 0xc0
	int32_t ControlPosX; // 0xc8
	int32_t ControlPosY; // 0xcc
};

struct UTgAIBehaviorCondition_CombatTargetHealthPercent {
	float HealthPct; // 0x98
};

struct UTgSeqEvent_BurnCardPurchased {
	int32_t nFilledSlots; // 0x128
	char bAllBurnSlotsFull : 1; // 0x12c
};

struct ATgPickupFactory {
	char bRotatingPickup : 1; // 0x3a4
	float YawRotationRate; // 0x3a8
	ObjectProperty TeamOwner[0x4]; // 0x3ac
	ComponentProperty BaseMesh; // 0x3cc
};

struct ATgDevice_QuadWield {
	FVector m_vProjectileSpawnOffset3; // 0xafc
	FVector m_vProjectileSpawnOffset4; // 0xb08
	int32_t m_nWeaponFireNumber; // 0xb14
};

struct ACrowdAgentBase {
	FPointer VfTable_IInterface_NavigationHandle; // 0x280
};

struct UUIDataPlayer {
	FString sName; // 0x60
	FString sLFPMessage; // 0x70
	int32_t nLevel; // 0x80
	int32_t nMasteryLevel; // 0x84
	Fdword dwVIPTier; // 0x88
	Fdword dwPlayerId; // 0x8c
	FQWord qwUserId; // 0x90
	Fdword dwPortalId; // 0x98
	Fdword dwAvatarId; // 0x9c
	Fdword dwTitleId; // 0xa0
	char bIsSelf : 1; // 0xa4
	char bIsPortalReservedPartySlot : 1; // 0xa4
	char bIsVIP : 1; // 0xa4
	Fdword dwReferralPlayMinutes; // 0xa8
	Fdword dwReferralId; // 0xac
	TArray<ObjectProperty> pLeaguePlayers; // 0xb0
};

struct USeqAct_Timer {
	float ActivationTime; // 0x108
	float Time; // 0x10c
};

struct ATgDevice_HealthPack {
	int32_t m_nQueuedShots; // 0xaec
	float m_fQueueGracePeriod; // 0xaf0
	float m_fLastFire; // 0xaf4
};

struct UDownloadableContentManager {
	FPointer VfTable_FTickableObject; // 0x60
	TArray<FPointer> DLCConfigCacheChanges; // 0x68
	TArray<FString> InstalledDLC; // 0x78
	FMap_Mirror NonPackageFilePathMap; // 0x88
	TArray<UObject*> ClassesToReload; // 0xd0
	TArray<ObjectProperty> ObjectsToReload; // 0xe0
	TArray<FString> QueuedFullyLoadPackageInis; // 0xf0
	ObjectProperty GameEngine; // 0x100
	char bWantsToRefreshDLC : 1; // 0x108
	char bGameDidAuthorizedDLCRefresh : 1; // 0x108
	DelegateProperty __OnRefreshComplete__Delegate; // 0x10c
};

struct AWindPointSource {
	ComponentProperty Component; // 0x280
};

struct UParticleModuleTrailTaper {
	ETrailTaperMethod TaperMethod; // 0x68
	FRawDistributionFloat TaperFactor; // 0x6c
};

struct UMaterialExpressionOneMinus {
	FExpressionInput Input; // 0xb0
};

struct USeqAct_LevelStreaming {
	ObjectProperty Level; // 0x124
	FName LevelName; // 0x12c
	char bStatusIsOk : 1; // 0x134
};

struct UTgDeviceForm_GrapplingHook {
	char m_bBeamActive : 1; // 0x2bc
	char m_bHookInterrupted : 1; // 0x2bc
	ObjectProperty m_BeamTarget; // 0x2c0
	FVector m_vBeamTargetLocation; // 0x2c8
	TArray<ObjectProperty> m_HookBlendList1P; // 0x2d4
	TArray<ObjectProperty> m_HookBlendList3P; // 0x2e4
};

struct ATgAIController_BehaviorMapNpc {
	TArray<FThreatEntry> ThreatList; // 0x90c
	char bThreatListDecays : 1; // 0x91c
	char bOutsideLeash : 1; // 0x91c
	char bHadCombatTarget : 1; // 0x91c
	float LeashDistance; // 0x920
	ObjectProperty LeashVolume; // 0x924
	TArray<ObjectProperty> LeashActors; // 0x92c
};

struct UTgGameplayCurvesSet_Simple {
	FRawDistributionFloat PrimaryCurve; // 0x64
	FName PrimaryCurveTabName; // 0x88
	FName PrimaryCurveName; // 0x90
};

struct UUIData_LTIAggregate {
	TArray<ObjectProperty> m_Items; // 0x60
};

struct USeqAct_WaitForLevelsVisible {
	TArray<FName> LevelNames; // 0x120
	char bShouldBlockOnLoad : 1; // 0x130
};

struct UTgGameplayCurvesSet {
	ECurveSetTypes CurveSetType; // 0x60
};

struct UTgAIBehaviorCondition_CombatTargetPolymorphState {
	EPolymorphType PolymorphState; // 0x98
};

struct UInterpTrackMove {
	FInterpCurveVector PosTrack; // 0xa0
	FInterpCurveVector EulerTrack; // 0xb4
	FInterpLookupTrack LookupTrack; // 0xc8
	FName LookAtGroupName; // 0xd8
	float LinCurveTension; // 0xe0
	float AngCurveTension; // 0xe4
	char bUseQuatInterpolation : 1; // 0xe8
	char bShowArrowAtKeys : 1; // 0xe8
	char bDisableMovement : 1; // 0xe8
	char bShowTranslationOnCurveEd : 1; // 0xe8
	char bShowRotationOnCurveEd : 1; // 0xe8
	char bHide3DTrack : 1; // 0xe8
	char bUseRawActorTMforRelativeToInitial : 1; // 0xe8
	EInterpTrackMoveFrame MoveFrame; // 0xec
	EInterpTrackMoveRotMode RotMode; // 0xed
};

struct UTgAkAudioManagement {
	FAkMeterCallbackState m_MeterCallbackSlots[0x10]; // 0x60
	TArray<Fdword> dwAllBusses; // 0x160
	char m_bInitialized : 1; // 0x170
};

struct ULandscapeInfo {
	FGuid LandscapeGuid; // 0x60
	TMap<None, None> LayerInfoMap; // 0x70
	FPointer DataInterface; // 0xb8
	TMap<None, None> XYtoComponentMap; // 0xc0
	TMap<None, None> XYtoCollisionComponentMap; // 0x108
	ObjectProperty LandscapeProxy; // 0x150
	TMap<None, None> XYtoAddCollisionMap; // 0x158
	FSet_Mirror Proxies; // 0x1a0
	FSet_Mirror SelectedComponents; // 0x1e8
	FSet_Mirror SelectedCollisionComponents; // 0x230
	FSet_Mirror SelectedRegionComponents; // 0x278
	TMap<None, None> SelectedRegion; // 0x2c0
	char bIsValid : 1; // 0x308
};

struct USeqAct_SetFloat {
	float Target; // 0x108
	TArray<float> Value; // 0x10c
};

struct USeqEvent_MobileButton {
	char bWasActiveLastFrame : 1; // 0x138
	char bSendPressedOnlyOnTouchDown : 1; // 0x138
	char bSendPressedOnlyOnTouchUp : 1; // 0x138
};

struct UActorFactoryAkAmbientSound {
	ObjectProperty AmbientEvent; // 0x9c
};

struct UTgAnimNodeSimpleTransitioner {
	int32_t m_nDeviceId; // 0x144
	char m_bConfigureBasedOnDevice : 1; // 0x148
	char m_bIgnoreFireMode : 1; // 0x148
	int32_t m_nNumberOfStances; // 0x14c
	FName m_StanceBaseName; // 0x150
	FName m_TransitionBaseName; // 0x158
	float m_BlendTransitionDuration; // 0x160
};

struct ATgDeploy_EffectAura {
	float r_fRadiusScale; // 0x448
	TArray<ObjectProperty> m_TouchingActors; // 0x44c
	TArray<ObjectProperty> m_AffectedActors; // 0x45c
	float m_fLastBlockedByBlockersTime; // 0x46c
	float m_fMinBlockedByBlockersTime; // 0x470
	TArray<ObjectProperty> m_BlockedActors; // 0x474
	ObjectProperty m_CollisionProxy; // 0x484
};

struct ATgBotFactory {
	eBotSelection LocationSelection; // 0x2c0
	TArray<ObjectProperty> LocationList; // 0x2c4
	int32_t s_nCurLocationIndex; // 0x2d4
	ObjectProperty SafetyLocation; // 0x2d8
	char ShouldTraceSpawnLocationToFloor : 1; // 0x2e0
	char bUseSmiteStaggerSpawning : 1; // 0x2e0
	char bSpawnAsSquad : 1; // 0x2e0
	char bAutoSpawn : 1; // 0x2e0
	char m_bFirstSpawn : 1; // 0x2e0
	char bBulkSpawn : 1; // 0x2e0
	char bRespawn : 1; // 0x2e0
	char bStartBotsInIntroState : 1; // 0x2e0
	char bHasDifferentInitialIntro : 0; // 0x2e0
	char m_bFirstSpawnWave : 0; // 0x2e0
	char m_bIgnoreCollisionOnSpawn : 0; // 0x2e0
	char m_bUseCollisionHeightForSpawnPlacement : 0; // 0x2e0
	int32_t nBotCount; // 0x2e4
	int32_t nCurrentCount; // 0x2e8
	int32_t nActiveCount; // 0x2ec
	int32_t nTotalSpawns; // 0x2f0
	TArray<FBotSpawnCounter> CurrentBotSpawnCount; // 0x2f4
	int32_t nLane; // 0x304
	int32_t nNavPointsToSkipForPathing; // 0x308
	float fStaggerSpawnDelay; // 0x30c
	ObjectProperty s_CurrentSquad; // 0x310
	UTgAISquad* m_SquadClass; // 0x318
	int32_t m_nLocationId; // 0x320
	int32_t nSpawnTableId; // 0x324
	int32_t nDefaultSpawnTableId; // 0x328
	float fSpawnDelay; // 0x32c
	TArray<FSpawnQueueEntry> m_SpawnQueue; // 0x330
	ObjectProperty m_SpawnVolume; // 0x340
	int32_t m_nLastGroup; // 0x348
	float fSpawnHealthPercent; // 0x34c
	float m_fEncounterDespawnTime; // 0x350
	float fIntroductionDuration; // 0x354
	float fInitialIntroductionDuration; // 0x358
	ObjectProperty m_StartingSpline; // 0x35c
	ComponentProperty m_RespawnIndicator; // 0x364
	ObjectProperty m_RespawnIndicatorMIC; // 0x36c
	ObjectProperty m_TextureNormal; // 0x374
	float fLastKillTime; // 0x37c
	float fRespawnDelay; // 0x380
};

struct ATgAIController_BehaviorLaneNpc {
	ObjectProperty GoalTarget; // 0x90c
	char bDespawnOnLoseCombatTarget : 1; // 0x914
	char bIsBehindSquad : 1; // 0x914
	char bTooFarFromLane : 1; // 0x914
};

struct ATgPlayOfTheGameCamera {
	ObjectProperty m_ViewTarget; // 0x420
	char m_bActive : 1; // 0x428
	float m_fRemainingTweenTime; // 0x42c
	float m_fTotalTweenTime; // 0x430
	FTPOV m_TweenSourcePOV; // 0x434
	FVector m_vRelativeLocation; // 0x458
	FVector m_vRelativeRotation; // 0x464
	FVector m_vRelativeLocationOffset; // 0x470
	FVector m_vRelativeRotationOffset; // 0x47c
};

struct UUIScene_UIJoinCustomPopup {
	char m_bHaveInput : 1; // 0x154
	ObjectProperty m_mcInputMatchName; // 0x158
	ObjectProperty m_mcInputPass; // 0x160
	ObjectProperty m_mcInputJoin; // 0x168
	ObjectProperty m_mcError; // 0x170
};

struct UTgAnimNodeTargeting {
	TG_EQUIP_POINT m_EquipPoint; // 0x168
	char m_bResetOnRelevant : 1; // 0x16c
	char m_bDoneTargeting : 1; // 0x16c
};

struct ATgDeploy_TurretLinked {
	ObjectProperty m_ParentTurret; // 0x448
};

struct UUIComponent_Avatar {
	ObjectProperty m_mcTexture; // 0x120
	ObjectProperty m_mcLoadingSpinner; // 0x128
};

struct USeqAct_AkLoadBank {
	char Async : 1; // 0x120
	char bWaitingCallback : 1; // 0x120
	ObjectProperty Bank; // 0x124
	int32_t Signal; // 0x12c
};

struct UTgAnimNodeBlendByPhysics {
	ObjectProperty m_TgPawn; // 0x144
	EPhysics m_LastPhysics; // 0x14c
	EPhysics m_CurrentPhysics; // 0x14d
	int32_t m_CurrentPhysicsChildIndex; // 0x150
	TArray<EPhysics> m_PhysicsChildren; // 0x154
	char m_bDirectUnspecifiedPhysicsThroughChild0 : 1; // 0x164
	float DefaultBlendTime; // 0x168
	TArray<FChildrenBlendInfo> m_ChildrenBlendInfo; // 0x16c
};

struct ATgDeploy_ChurchillTurret {
	FVector m_vDroneSocketOffset; // 0x448
	char r_bLeftDrone : 1; // 0x454
	FVector m_vCurrentAccumulatedVelocity; // 0x458
};

struct UTgRealmArmor {
	ObjectProperty ArmorArmArch; // 0x60
	ObjectProperty ArmorChestArch; // 0x68
	ObjectProperty ArmorHeadArch; // 0x70
	ObjectProperty ArmorLegArch; // 0x78
	float fHeadTransitionTime; // 0x80
	float fChestTransitionTime; // 0x84
	float fArmTransitionTime; // 0x88
	float fLegTransitionTime; // 0x8c
	TArray<FArmorTransitionInfo> m_TransitionInfo; // 0x90
	ObjectProperty m_pBaseMIC; // 0xa0
	ObjectProperty m_pArmorMIC; // 0xa8
};

struct ATgDevice_DualFire {
	DelegateProperty __InterruptFiringDelegate__Delegate; // 0xaf4
};

struct ATgVisibilityVolume {
	ObjectProperty m_PlayerCameraParticleSystem; // 0x2bc
	ObjectProperty m_PlayerCameraInvisibleParticleSystem; // 0x2c4
};

struct UMaterialExpressionParticleMacroUV {
	char bUseViewSpace : 1; // 0xb0
};

struct UActorFactoryDynamicSM {
	ObjectProperty StaticMesh; // 0x9c
	FVector DrawScale3D; // 0xa4
	char bNoEncroachCheck : 1; // 0xb0
	char bNotifyRigidBodyCollision : 1; // 0xb0
	char bBlockRigidBody : 1; // 0xb0
	char bUseCompartment : 1; // 0xb0
	char bCastDynamicShadow : 1; // 0xb0
	ECollisionType CollisionType; // 0xb4
};

struct UUIComponent_BoosterItemInfo {
	int32_t m_nDisplayedItemId; // 0x120
	char m_bUseRentalOffset : 1; // 0x124
	ObjectProperty m_mcTitle; // 0x128
	ObjectProperty m_mcTitleIcon; // 0x130
	ObjectProperty m_mcDesc; // 0x138
	ObjectProperty m_mcRentalText; // 0x140
	ObjectProperty m_mcRentalDuration; // 0x148
	ObjectProperty m_pBenefits; // 0x150
};

struct UUIComponent_ItemGeneric {
	ObjectProperty m_mcName; // 0x120
	ObjectProperty m_mcOwned; // 0x128
	ObjectProperty m_mcSale; // 0x130
	ObjectProperty m_mcTexture; // 0x138
	ObjectProperty m_mcRarity; // 0x140
	ObjectProperty m_mcFrame; // 0x148
	ObjectProperty m_mcValueBanner; // 0x150
	ObjectProperty m_pPrices; // 0x158
	ObjectProperty m_pRealMoneyPrice; // 0x160
};

struct UUIComponent_ReferralReward {
	ObjectProperty m_mcTitle; // 0x120
	ObjectProperty m_mcIcon; // 0x128
	ObjectProperty m_mcAddition; // 0x130
	ObjectProperty m_mcCurrency; // 0x138
	ObjectProperty m_mcAmount; // 0x140
	ObjectProperty m_mcFrame; // 0x148
};

struct UTgAIObstacleAvoidance {
	FPointer ObstacleGrid; // 0x60
	FObstacleQueryCache CachedAvoidance; // 0x68
	TArray<ObjectProperty> CachedBlockers; // 0x94
	TArray<ObjectProperty> CachedLandscapes; // 0xa4
	ObjectProperty OuterController; // 0xb4
	char bRenderingIsDirty : 1; // 0xbc
};

struct USeqEvent_ParticleEvent {
	EParticleEventOutputType EventType; // 0x128
	FVector EventPosition; // 0x12c
	float EventEmitterTime; // 0x138
	FVector EventVelocity; // 0x13c
	float EventParticleTime; // 0x148
	FVector EventNormal; // 0x14c
	char UseRelfectedImpactVector : 1; // 0x158
};

struct ATgDevice_LongbowInhand {
	float s_fLastFireHoldPct; // 0xaec
	float m_fFireReleasePercent; // 0xaf0
	float m_fImpalerReticleAnimationTimer; // 0xaf4
	float m_fReticleReleaseAnimationDuration; // 0xaf8
	float m_fImpalerReticleFadeInDuration; // 0xafc
	float m_fImpalerReticleFadeOutDuration; // 0xb00
	float m_fImpalerReticleGrowth; // 0xb04
	FVector m_vProjectileSpawnOffsetPlanted; // 0xb08
};

struct UNavMeshPath_WithinDistanceEnvelope {
	float MaxDistance; // 0x78
	float MinDistance; // 0x7c
	char bSoft : 1; // 0x80
	char bOnlyThrowOutNodesThatLeaveEnvelope : 1; // 0x80
	float SoftStartPenalty; // 0x84
	FVector EnvelopeTestPoint; // 0x88
};

struct UPBRuleNodeExtractTopBottom {
	float ExtractTopZ; // 0x70
	float ExtractNotTopZ; // 0x74
	float ExtractBottomZ; // 0x78
	float ExtractNotBottomZ; // 0x7c
};

struct UUIComponent_EsportsMatchupEntry {
	ObjectProperty m_mcTitle; // 0x120
	ObjectProperty m_mcTeam[0x2]; // 0x128
	ObjectProperty m_mcTeamName[0x2]; // 0x138
	ObjectProperty m_mcTeamCheck[0x2]; // 0x148
	ObjectProperty m_mcTeamScore[0x2]; // 0x158
	ObjectProperty m_mcAvailable; // 0x168
	ObjectProperty m_pWinnings; // 0x170
	char m_bShowSpoilers : 1; // 0x178
};

struct UTgAIBehaviorAction_UseConsumable {
	EConsumableType ConsumableType; // 0x94
};

struct UUIDataAcquisitionQueue {
	TArray<ObjectProperty> m_Acquisitions; // 0x60
};

struct UTgInventoryObject_Listen_ActiveDuringAbility_WhileOutOfCombat {
	char m_bPawnInCombat : 1; // 0xd8
};

struct UTgAnimTurnInPlace_Rotator {
	TArray<ObjectProperty> c_TurnInPlaceNodes; // 0x114
	ObjectProperty m_TgPawn; // 0x124
};

struct ASplineLoftActor {
	float ScaleX; // 0x2e8
	float ScaleY; // 0x2ec
	TArray<ComponentProperty> SplineMeshComps; // 0x2f0
	ObjectProperty DeformMesh; // 0x300
	TArray<ObjectProperty> DeformMeshMaterials; // 0x308
	float Roll; // 0x318
	FVector WorldXDir; // 0x31c
	FVector2D Offset; // 0x328
	char bSmoothInterpRollAndScale : 1; // 0x330
	char bAcceptsLights : 1; // 0x330
	ComponentProperty MeshLightEnvironment; // 0x334
	float MeshMaxDrawDistance; // 0x33c
};

struct UParticleModuleVelocityInheritParent {
	FRawDistributionVector Scale; // 0x6c
};

struct ATgPlayerCountVolume {
	int32_t PlayerCountTarget; // 0x2bc
	int32_t TaskForceNumber; // 0x2c0
	int32_t MessageId; // 0x2c4
	TArray<ObjectProperty> Players; // 0x2c8
	char Enabled : 1; // 0x2d8
};

struct UDecalComponent {
	ObjectProperty DecalMaterial; // 0x24c
	float Width; // 0x254
	float Height; // 0x258
	float TileX; // 0x25c
	float TileY; // 0x260
	float OffsetX; // 0x264
	float OffsetY; // 0x268
	float DecalRotation; // 0x26c
	float FieldOfView; // 0x270
	float NearPlane; // 0x274
	float FarPlane; // 0x278
	FVector Location; // 0x27c
	FRotator Orientation; // 0x288
	FVector HitLocation; // 0x294
	FVector HitNormal; // 0x2a0
	FVector HitTangent; // 0x2ac
	FVector HitBinormal; // 0x2b8
	char bNoClip : 1; // 0x2c4
	char bFadeOutAtFarPlane : 1; // 0x2c4
	char bStaticDecal : 1; // 0x2c4
	char m_bIsGameplayDecal : 1; // 0x2c4
	char bProjectOnBackfaces : 1; // 0x2c4
	char bProjectOnHidden : 1; // 0x2c4
	char bProjectOnBSP : 1; // 0x2c4
	char bProjectOnStaticMeshes : 1; // 0x2c4
	char bProjectOnSkeletalMeshes : 0; // 0x2c4
	char bProjectOnTerrain : 0; // 0x2c4
	char bFlipBackfaceDirection : 0; // 0x2c4
	char bMovableDecal : 0; // 0x2c4
	char bHasBeenAttached : 0; // 0x2c4
	char bDecalMaterialSetAtRunTime : 0; // 0x2c4
	ComponentProperty HitComponent; // 0x2c8
	FName HitBone; // 0x2d0
	int32_t HitNodeIndex; // 0x2d8
	int32_t HitLevelIndex; // 0x2dc
	int32_t FracturedStaticMeshComponentIndex; // 0x2e0
	TArray<int32_t> HitNodeIndices; // 0x2e4
	TArray<FDecalReceiver> DecalReceivers; // 0x2f4
	TArray<FPointer> StaticReceivers; // 0x304
	FPointer ReleaseResourcesFence; // 0x314
	TArray<FPlane> Planes; // 0x31c
	float DepthBias; // 0x32c
	float SlopeScaleDepthBias; // 0x330
	float OrbisDepthBias; // 0x334
	float OrbisSlopeScaleDepthBias; // 0x338
	int32_t SortOrder; // 0x33c
	float BackfaceAngle; // 0x340
	FVector2D BlendRange; // 0x344
	float StreamingDistanceMultiplier; // 0x34c
	EDecalTransform DecalTransform; // 0x350
	EFilterMode FilterMode; // 0x351
	TArray<ObjectProperty> Filter; // 0x354
	TArray<ComponentProperty> ReceiverImages; // 0x364
	FVector ParentRelativeLocation; // 0x374
	FRotator ParentRelativeOrientation; // 0x380
	FMatrix ParentRelLocRotMatrix; // 0x390
};

struct UTexture2DComposite {
	TArray<FSourceTexture2DRegion> SourceRegions; // 0x100
	int32_t MaxTextureSize; // 0x110
	int32_t DestSizeX; // 0x114
	int32_t DestSizeY; // 0x118
};

struct APComPerformanceCaptureGame {
	ObjectProperty BasePerformanceCapture; // 0x4cc
	EPComPerformanceCaptureState CurrentCaptureState; // 0x4d4
	TArray<ObjectProperty> NodesToCapture; // 0x4d8
	TArray<FPComPerformanceCaptureStatsPerNode> StatsPerNode; // 0x4e8
};

struct UUIComponent_Quest {
	ObjectProperty m_pQuestPanelButton; // 0x120
	ObjectProperty m_pQuestDiscardButton; // 0x128
	ObjectProperty m_mcProgressFrame; // 0x130
	ObjectProperty m_mcQuestReward; // 0x138
	ObjectProperty m_mcQuestProgressBar; // 0x140
	ObjectProperty m_mcQuestProgressMask; // 0x148
	ObjectProperty m_mcQuestTitle; // 0x150
	ObjectProperty m_mcQuestType; // 0x158
	ObjectProperty m_mcQuestIconRendered; // 0x160
	ObjectProperty m_mcQuestIcon; // 0x168
	ObjectProperty m_mcFWOTDIcon; // 0x170
	ObjectProperty m_mcGlow; // 0x178
	ObjectProperty m_mcNew; // 0x180
	ObjectProperty m_mcGoalSequences[0x7]; // 0x188
	ObjectProperty m_GoalSequenceBar; // 0x1c0
	ObjectProperty m_mcQuestChestIcon; // 0x1c8
	ObjectProperty m_mcRewardItem; // 0x1d0
	ObjectProperty m_mcRewardItemRarity; // 0x1d8
	ObjectProperty m_mcRewardItemIcon; // 0x1e0
	ObjectProperty m_mcRewardItemImageStack; // 0x1e8
	ObjectProperty m_mcRewardItemTexture; // 0x1f0
	ObjectProperty m_mcRewardItemName; // 0x1f8
	ObjectProperty m_mcRewardSubtitle; // 0x200
	ObjectProperty m_mcQuestProgressText; // 0x208
	ObjectProperty m_mcQuestDescription; // 0x210
	ObjectProperty m_mcQuestRewardAmount; // 0x218
	ObjectProperty m_mcQuestRewardCurrency1; // 0x220
	ObjectProperty m_mcQuestRewardAmount1; // 0x228
	float m_fSequenceOrigX; // 0x230
	float m_fSequenceOrigY; // 0x234
	float m_fSequenceOrigWidth; // 0x238
};

struct UTgAIBehaviorAction_FollowCombatTarget {
	TG_EQUIP_POINT DeviceSlot; // 0x9c
};

struct UTgSeqAct_SetSkelPosture {
	TG_POSTURE m_Posture; // 0x108
};

struct UUIComponent_ShopListSectionHeader {
	FString m_sTimeLeft; // 0x120
	ObjectProperty m_mcTF; // 0x130
	ObjectProperty m_mcTimeLeft; // 0x138
	ObjectProperty m_mcFrame; // 0x140
	ObjectProperty m_pCTA; // 0x148
};

struct ASceneCaptureReflectActor {
	ComponentProperty StaticMesh; // 0x288
	ObjectProperty ReflectMaterialInst; // 0x290
};

struct USeqAct_CastToFloat {
	int32_t Value; // 0x108
	float FloatResult; // 0x10c
};

struct UParticleModuleTypeDataBeam {
	EBeamMethod BeamMethod; // 0x68
	EBeamEndPointMethod EndPointMethod; // 0x69
	FRawDistributionFloat Distance; // 0x6c
	FRawDistributionVector EndPoint; // 0x90
	int32_t TessellationFactor; // 0xb4
	FRawDistributionFloat EmitterStrength; // 0xb8
	FRawDistributionFloat TargetStrength; // 0xdc
	FRawDistributionVector EndPointDirection; // 0x100
	int32_t TextureTile; // 0x124
	char RenderGeometry : 1; // 0x128
	char RenderDirectLine : 1; // 0x128
	char RenderLines : 1; // 0x128
	char RenderTessellation : 1; // 0x128
};

struct ATgDevice_WYRMJets {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xaec
	ObjectProperty m_CachedBoosterDevice; // 0xaf4
};

struct UTgAIBehaviorAction_StopDevice {
	TG_EQUIP_POINT DeviceToUse; // 0x94
};

struct ATgGameLaunch {
	FString LoginName; // 0x4cc
	FString LoginPwd; // 0x4dc
	char SaveLoginName : 1; // 0x4ec
};

struct UTgAIBehaviorAction_LookAtCombatTarget {
	char bAllowAimNose : 1; // 0x94
	char bHeadShot : 1; // 0x94
};

struct ATgProj_GrumpyBomb {
	ComponentProperty m_Silhouette; // 0x56c
	char m_bSilhouetteInitialized : 1; // 0x574
	char m_bSilhouetteAllowed : 1; // 0x574
	float m_fPostLandDurationAccelerant; // 0x578
};

struct USeqAct_MobileRemoveInputZone {
	FString ZoneName; // 0x108
};

struct UGFxEngine {
	TArray<FGCReference> GCReferences; // 0x60
	int32_t RefCount; // 0x70
	TArray<FName> ForceGarbageCollectUponReleaseTextures; // 0x74
};

struct USeqAct_SetSkelControlTarget {
	FName SkelControlName; // 0x108
	TArray<ObjectProperty> TargetActors; // 0x110
};

struct UTgImpactFx {
	float c_fMaxFxDistance; // 0x60
	char c_bAlignToSurfaceNormal : 1; // 0x64
	FIMPACT_FX c_EmptyImpact; // 0x68
	TArray<FIMPACT_FX> c_Impacts; // 0x9c
};

struct ATgDevice_ChainLightning {
	ObjectProperty m_CachedInhand; // 0xb04
};

struct UTgEffectGroup {
	int32_t m_nType; // 0x60
	ObjectProperty m_Target; // 0x64
	ObjectProperty m_Instigator; // 0x6c
	int32_t m_nEffectGroupId; // 0x74
	float m_fLifeTime; // 0x78
	float m_fModLifeTime; // 0x7c
	float m_fLifeTimeIncreaseFromInstigator; // 0x80
	float m_fApplyInterval; // 0x84
	TArray<ObjectProperty> m_Effects; // 0x88
	int32_t m_nDamageType; // 0x98
	AttackType m_eAttackType; // 0x9c
	EStunType m_StunType; // 0x9d
	char m_bIsManaged : 1; // 0xa0
	char m_bHasStealthEffect : 1; // 0xa0
	char m_bDoesDamage : 1; // 0xa0
	char m_bDoesDamageOverTime : 1; // 0xa0
	char m_bContagious : 1; // 0xa0
	char s_bActiveFlag : 1; // 0xa0
	char s_bCriticalHitFlag : 1; // 0xa0
	char m_bDeviceSpecificFlag : 1; // 0xa0
	char m_bHasVisual : 0; // 0xa0
	char m_bSupportsEffectSimulation : 0; // 0xa0
	float m_fPercAbsorbedDamage; // 0xa4
	int32_t m_nApplicationType; // 0xa8
	float m_fApplicationValue; // 0xac
	float m_fApplicationChance; // 0xb0
	int32_t m_nApplicationCategoryCode; // 0xb4
	int32_t m_nBehaviorCategoryCode; // 0xb8
	int32_t m_nReqDeviceInstanceId; // 0xbc
	float m_fBuffValue; // 0xc0
	float m_fPhysicalPowerScaling; // 0xc4
	float m_fMagicalPowerScaling; // 0xc8
	float m_fLifetimeScaling; // 0xcc
	float m_fLifetimeMax; // 0xd0
	int32_t m_nScalingType; // 0xd4
	int32_t m_nTargetType; // 0xd8
	int32_t m_nTargetAffectsType; // 0xdc
	int32_t m_nHitSpecialSituationalType; // 0xe0
	int32_t m_nNumStacks; // 0xe4
	int32_t m_nNumMaxStacks; // 0xe8
	ObjectProperty s_NonContagiousEffectGroup; // 0xec
	FImpactInfo m_Impact; // 0xf4
	int32_t m_nPosture; // 0x174
	int32_t m_nFxAppliedId; // 0x178
	FName m_nmDisplayGroup; // 0x17c
	int32_t s_ManagedEffectListIndex; // 0x184
	ObjectProperty s_OwnerEffectManager; // 0x188
	FName m_nmDamageTypeClass; // 0x190
	int32_t m_nSourceDeviceInstId; // 0x198
	int32_t m_nSourceItemId; // 0x19c
	float s_fEGArmorHealth; // 0x1a0
	float s_fEGArmorHealthMax; // 0x1a4
	float s_fEGShieldHealth; // 0x1a8
	float s_fEGShieldHealthMax; // 0x1ac
	ObjectProperty m_Waveform; // 0x1b0
	FPointer m_pEffectGroupSetup; // 0x1b8
	FLifeTimeCalcInfo m_LastLifeTimeCalcInfo; // 0x1c0
};

struct UTgSeqAct_SetUITextBox {
	int32_t TextBox_MessageID; // 0x108
	char TextBox_TargetSecondary : 1; // 0x10c
	char TextBox_UseDuration : 1; // 0x10c
	char TextBox_AllowEscape : 1; // 0x10c
	AlertType TextBox_MessageType; // 0x110
};

struct ATgDeploy_WardersField {
	float r_fRadiusForFX; // 0x47c
	float r_fRadiusScaleForDecal; // 0x480
	char r_bEarthenGuardActive : 1; // 0x484
};

struct AGameCrowdInteractionPoint {
	char bIsEnabled : 1; // 0x280
	ComponentProperty CylinderComponent; // 0x284
};

struct UTgSeqAct_HackBot {
	ObjectProperty m_ControlPawn; // 0x108
};

struct UParticleModuleMeshRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x8c
};

struct USoundCue {
	FName SoundClass; // 0x60
	ESoundClassName SoundClassName; // 0x68
	char bDebug : 1; // 0x6c
	char m_bFadeOutWhenStopped : 1; // 0x6c
	ObjectProperty FirstNode; // 0x70
	TMap<None, None> EditorData; // 0x78
	float MaxAudibleDistance; // 0xc0
	float VolumeMultiplier; // 0xc4
	float PitchMultiplier; // 0xc8
	float Duration; // 0xcc
	ObjectProperty FaceFXAnimSetRef; // 0xd0
	FString FaceFXGroupName; // 0xd8
	FString FaceFXAnimName; // 0xe8
	int32_t MaxConcurrentPlayCount; // 0xf8
	int32_t CurrentPlayCount; // 0xfc
	FName SoundGroup; // 0x100
	float m_fFadeOutTime; // 0x108
	float m_fFadeToPct; // 0x10c
	float m_fFadePitchToPct; // 0x110
	ObjectProperty m_StereoSoundCue; // 0x114
};

struct UTgInventoryObject_Listen_NearObjective {
	char m_bIsActive : 1; // 0xc8
	ObjectProperty m_CachedCharacterPawn; // 0xcc
};

struct UParticleModuleTypeDataRibbon {
	int32_t MaxTessellationBetweenParticles; // 0x68
	int32_t SheetsPerTrail; // 0x6c
	int32_t MaxTrailCount; // 0x70
	int32_t MaxParticleInTrailCount; // 0x74
	char bDeadTrailsOnDeactivate : 1; // 0x78
	char bDeadTrailsOnSourceLoss : 1; // 0x78
	char bClipSourceSegement : 1; // 0x78
	char bEnablePreviousTangentRecalculation : 1; // 0x78
	char bTangentRecalculationEveryFrame : 1; // 0x78
	char bSpawnInitialParticle : 1; // 0x78
	char bRenderGeometry : 1; // 0x78
	char bRenderSpawnPoints : 1; // 0x78
	char bRenderTangents : 0; // 0x78
	char bRenderTessellation : 0; // 0x78
	char bEnableTangentDiffInterpScale : 0; // 0x78
	ETrailsRenderAxisOption RenderAxis; // 0x7c
	float TangentSpawningScalar; // 0x80
	float TilingDistance; // 0x84
	float DistanceTessellationStepSize; // 0x88
	float TangentTessellationScalar; // 0x8c
};

struct UTgAnimNotify_ToggleSocketSpecialFX {
	FName m_DisplayGroupName; // 0x68
	int32_t m_EquipSlot; // 0x70
	char m_bActivateFxGroup : 1; // 0x74
};

struct UDistributionVectorUniformRange {
	FVector MaxHigh; // 0x7c
	FVector MaxLow; // 0x88
	FVector MinHigh; // 0x94
	FVector MinLow; // 0xa0
};

struct UMaterialInterface {
	FRenderCommandFence_Mirror ParentRefFence; // 0x60
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x64
	char bHasQualitySwitch : 1; // 0x80
	char bRunTrimmingTool : 1; // 0x80
	char bUseCachedCircleVerts : 1; // 0x80
	char bScanRedChannel : 1; // 0x80
	char bScanGreenChannel : 1; // 0x80
	char bScanBlueChannel : 1; // 0x80
	char bScanAlphaChannel : 1; // 0x80
	char bClearData : 1; // 0x80
	char bAutoFlattenMobile : 0; // 0x80
	char bAutoFlattenMobileNormalTexture : 0; // 0x80
	char bMobileAllowFog : 0; // 0x80
	char bGenerateSubUV : 0; // 0x80
	char bUseMobileSpecular : 0; // 0x80
	char bUseMobileVertexSpecular : 0; // 0x80
	char bUseMobilePixelSpecular : 0; // 0x80
	char bUseMobileBumpOffset : 0; // 0x80
	char bLockColorBlending : 0; // 0x80
	char bUseMobileUniformColorMultiply : 0; // 0x80
	char bUseMobileVertexColorMultiply : 0; // 0x80
	char bUseMobileDetailNormal : 0; // 0x80
	char bBaseTextureTransformed : 0; // 0x80
	char bEmissiveTextureTransformed : 0; // 0x80
	char bNormalTextureTransformed : 0; // 0x80
	char bMaskTextureTransformed : 0; // 0x80
	char bDetailTextureTransformed : 0; // 0x80
	char bUseMobileWaveVertexMovement : 0; // 0x80
	char bMobileEnableBounceLight : 0; // 0x80
	char bUseMobileLandscapeMonochromeLayerBlending : 0; // 0x80
	TArray<FVector2D> TrimmedVertices; // 0x84
	FColor FlattenBackgroundColor; // 0x94
	ObjectProperty MobileBaseTexture; // 0x98
	ObjectProperty FlattenedTexture; // 0xa0
	EMobileTexCoordsSource MobileBaseTextureTexCoordsSource; // 0xa8
	EMobileAmbientOcclusionSource MobileAmbientOcclusionSource; // 0xa9
	EMobileSpecularMask MobileSpecularMask; // 0xaa
	EMobileEmissiveColorSource MobileEmissiveColorSource; // 0xab
	EMobileValueSource MobileEmissiveMaskSource; // 0xac
	EMobileValueSource MobileEnvironmentMaskSource; // 0xad
	EMobileEnvironmentBlendMode MobileEnvironmentBlendMode; // 0xae
	EMobileValueSource MobileRimLightingMaskSource; // 0xaf
	EMobileTexCoordsSource MobileMaskTextureTexCoordsSource; // 0xb0
	EMobileAlphaValueSource MobileAlphaValueSource; // 0xb1
	EMobileTexCoordsSource MobileDetailTextureTexCoordsSource; // 0xb2
	EMobileTextureBlendFactorSource MobileTextureBlendFactorSource; // 0xb3
	EMobileColorMultiplySource MobileColorMultiplySource; // 0xb4
	ObjectProperty MobileNormalTexture; // 0xb8
	float SubUVFrameRate; // 0xc0
	int32_t SubUVFrameCountAlongAxes; // 0xc4
	float SubUVFrameSize; // 0xc8
	FLinearColor MobileSpecularColor; // 0xcc
	float MobileSpecularPower; // 0xdc
	ObjectProperty MobileEmissiveTexture; // 0xe0
	FLinearColor MobileEmissiveColor; // 0xe8
	ObjectProperty MobileEnvironmentTexture; // 0xf8
	float MobileEnvironmentAmount; // 0x100
	FLinearColor MobileEnvironmentColor; // 0x104
	float MobileEnvironmentFresnelAmount; // 0x114
	float MobileEnvironmentFresnelExponent; // 0x118
	float MobileRimLightingStrength; // 0x11c
	float MobileRimLightingExponent; // 0x120
	FLinearColor MobileRimLightingColor; // 0x124
	float MobileBumpOffsetReferencePlane; // 0x134
	float MobileBumpOffsetHeightRatio; // 0x138
	ObjectProperty MobileMaskTexture; // 0x13c
	float MobileOpacityMultiplier; // 0x144
	ObjectProperty MobileDetailTexture; // 0x148
	ObjectProperty MobileDetailTexture2; // 0x150
	ObjectProperty MobileDetailTexture3; // 0x158
	FLinearColor DefaultUniformColor; // 0x160
	FLinearColor MobileDefaultUniformColor; // 0x170
	float TransformCenterX; // 0x180
	float MobileTransformCenterX; // 0x184
	float TransformCenterY; // 0x188
	float MobileTransformCenterY; // 0x18c
	float PannerSpeedX; // 0x190
	float MobilePannerSpeedX; // 0x194
	float PannerSpeedY; // 0x198
	float MobilePannerSpeedY; // 0x19c
	float RotateSpeed; // 0x1a0
	float MobileRotateSpeed; // 0x1a4
	float FixedScaleX; // 0x1a8
	float MobileFixedScaleX; // 0x1ac
	float FixedScaleY; // 0x1b0
	float MobileFixedScaleY; // 0x1b4
	float SineScaleX; // 0x1b8
	float MobileSineScaleX; // 0x1bc
	float SineScaleY; // 0x1c0
	float MobileSineScaleY; // 0x1c4
	float SineScaleFrequencyMultipler; // 0x1c8
	float MobileSineScaleFrequencyMultipler; // 0x1cc
	float FixedOffsetX; // 0x1d0
	float MobileFixedOffsetX; // 0x1d4
	float FixedOffsetY; // 0x1d8
	float MobileFixedOffsetY; // 0x1dc
	float MobileTangentVertexFrequencyMultiplier; // 0x1e0
	float MobileVerticalFrequencyMultiplier; // 0x1e4
	float MobileMaxVertexMovementAmplitude; // 0x1e8
	float MobileSwayFrequencyMultiplier; // 0x1ec
	float MobileSwayMaxAngle; // 0x1f0
	FVector MobileDirectionalLightDirection; // 0x1f4
	float MobileDirectionalLightBrightness; // 0x200
	FColor MobileDirectionalLightColor; // 0x204
	FVector MobileBounceLightDirection; // 0x208
	float MobileBounceLightBrightness; // 0x214
	FColor MobileBounceLightColor; // 0x218
	float MobileSkyLightBrightness; // 0x21c
	FColor MobileSkyLightColor; // 0x220
	FName MobileLandscapeLayerNames[0x4]; // 0x224
	FColor MobileLandscapeMonochomeLayerColors[0x4]; // 0x244
};

struct USeqAct_ModifyCover {
	TArray<int32_t> Slots; // 0x108
	ECoverType ManualCoverType; // 0x118
	char bManualAdjustPlayersOnly : 1; // 0x11c
};

struct ATgRepInfo_Deployable {
	int32_t r_nHealthCurrent; // 0x280
	int32_t r_nHealthMaximum; // 0x284
	float r_fDeployMaxHealthPCT; // 0x288
	int32_t r_nDeployableId; // 0x28c
	int32_t r_nUniqueDeployableId; // 0x290
	float r_fLifespanInitial; // 0x294
	float r_fLifespanSync; // 0x298
	ObjectProperty r_DeployableOwner; // 0x29c
	ObjectProperty r_InstigatorInfo; // 0x2a4
	ObjectProperty r_TaskforceInfo; // 0x2ac
	char r_bOwnedByTaskforce : 1; // 0x2b4
	char c_bReceivedOwner : 1; // 0x2b4
	char r_bMinimapOnlyOwnerSee : 1; // 0x2b4
	char r_bInDestroyedState : 1; // 0x2b4
	char c_bShowHUDLifespanTimer : 1; // 0x2b4
	FVector r_ApproxLocation; // 0x2b8
	FTG_HUD_INFO c_HudInfo; // 0x2c4
	char r_bVisibleOnMap[0x3]; // 0x2c8
	DeployableOverlayIcon r_eDeployableOverlayIcon; // 0x2cb
	DeployableOverlayState r_eDeployableOverlayState; // 0x2cc
	float r_fVisionRange; // 0x2d0
	int32_t r_nDeployableOverlayDisplayMask; // 0x2d4
	float r_fDeployableOverlayEnemyViewDist; // 0x2d8
	float c_fBarragePercent; // 0x2dc
};

struct ATgDevice_Failsafe {
	ObjectProperty m_RocketBootsDevice; // 0xaec
};

struct UTgDeviceForm_Stasis {
	char m_bNeedsLoopActivation : 1; // 0x2bc
	float m_fFireStartTime; // 0x2c0
	float m_fLoopDelay; // 0x2c4
};

struct ATgDeploy_OppressorMine {
	ObjectProperty m_CachedPawnOwner; // 0x448
	ObjectProperty m_CachedEnemyTaskForce; // 0x450
	ObjectProperty r_CurrentTargets[0x5]; // 0x458
	int32_t m_nBeamFXID; // 0x480
	ObjectProperty m_BeamFXs[0x5]; // 0x484
	char m_bNeedsNetDirtyUpdate : 1; // 0x4ac
	FRotator r_StuckRotation; // 0x4b0
	FVector r_CartOffset; // 0x4bc
	float m_fAmplitudeRadiusScale; // 0x4c8
};

struct UTgAIBehaviorCondition_DistanceFromDamagingDeployable {
	char bMustBeEnemy : 1; // 0x9c
};

struct UUIData_List {
	TArray<ObjectProperty> pData; // 0x60
};

struct UFracturedStaticMeshComponent {
	TArray<char> FragmentNeighborsVisible; // 0x338
	FBox VisibleBox; // 0x348
	char bUseSkinnedRendering : 1; // 0x364
	char bUseVisibleVertsForBounds : 1; // 0x364
	char bTopFragmentsRootNonDestroyable : 1; // 0x364
	char bBottomFragmentsRootNonDestroyable : 1; // 0x364
	float TopBottomFragmentDistThreshold; // 0x368
	ObjectProperty LoseChunkOutsideMaterialOverride; // 0x36c
	float FragmentBoundsMaxZ; // 0x374
	float FragmentBoundsMinZ; // 0x378
	ComponentProperty SkinnedComponent; // 0x37c
};

struct USeqAct_Trace {
	char bTraceActors : 1; // 0x108
	char bTraceWorld : 1; // 0x108
	FVector TraceExtent; // 0x10c
	FVector StartOffset; // 0x118
	FVector EndOffset; // 0x124
	ObjectProperty HitObject; // 0x130
	float Distance; // 0x138
	FVector HitLocation; // 0x13c
};

struct UTgAIBehaviorSensor_Fog {
	float UnsafeRatio; // 0x94
	float SafePercent; // 0x98
};

struct UUIBattlePassLevelUp {
	int32_t m_nOffset; // 0x244
	int32_t m_nHoverItem; // 0x248
	int32_t m_nBundleLevels; // 0x24c
	int32_t m_nPurchaseLevels; // 0x250
	float m_fWaitTime; // 0x254
	float m_fWaitTimer; // 0x258
	float m_fPurchaseFlash; // 0x25c
	float m_fConfirmationTime; // 0x260
	float m_fConfirmationTimer; // 0x264
	char m_bControllerButtonHeld : 1; // 0x268
	char m_bIsShopLevelsBundle : 1; // 0x268
	TArray<int32_t> m_nItems; // 0x26c
	ObjectProperty m_mcBlocker; // 0x27c
	ObjectProperty m_mcPanel; // 0x284
	ObjectProperty m_mcPanelBack; // 0x28c
	ObjectProperty m_mcPanelName; // 0x294
	ObjectProperty m_mcPanelDesc; // 0x29c
	ObjectProperty m_mcPanelType; // 0x2a4
	ObjectProperty m_mcPanelIcon; // 0x2ac
	ObjectProperty m_mcPanelFrame; // 0x2b4
	ObjectProperty m_mcPanelImage; // 0x2bc
	ObjectProperty m_mcPanelLevel; // 0x2c4
	ObjectProperty m_mcPanelTotal; // 0x2cc
	ObjectProperty m_mcPanelTotalCrowns; // 0x2d4
	ObjectProperty m_mcPanelHoverName; // 0x2dc
	ObjectProperty m_mcPanelHoverDesc; // 0x2e4
	ObjectProperty m_mcPanelIconLevelA; // 0x2ec
	ObjectProperty m_mcPanelIconLevelB; // 0x2f4
	ObjectProperty m_mcPanelIconLevelC; // 0x2fc
	ObjectProperty m_mcPanelPurchase; // 0x304
	ObjectProperty m_mcPanelPurchaseFlash; // 0x30c
	ObjectProperty m_mcPanelPurchasePrice; // 0x314
	ObjectProperty m_mcPanelPurchasePriceDiscount; // 0x31c
	ObjectProperty m_mcPanelPurchaseHold; // 0x324
	ObjectProperty m_mcPanelPurchaseMask; // 0x32c
	ObjectProperty m_mcPanelPurchaseKey; // 0x334
	ObjectProperty m_mcPanelPurchaseKeyHoldBack; // 0x33c
	ObjectProperty m_mcPanelArrow[0x2]; // 0x344
	ObjectProperty m_mcItem[0x5]; // 0x354
	ObjectProperty m_mcItemIcon[0x5]; // 0x37c
	ObjectProperty m_mcItemFrame[0x5]; // 0x3a4
	ObjectProperty m_mcItemActive[0x5]; // 0x3cc
	ObjectProperty m_mcItemRarity[0x5]; // 0x3f4
	ObjectProperty m_mcItemTexture[0x5]; // 0x41c
	ObjectProperty m_mcItemIconFrame[0x5]; // 0x444
	ObjectProperty m_pInputGroup; // 0x46c
	ObjectProperty m_pPurchaseGroup; // 0x474
};

struct UParticleModuleRotationRate {
	FRawDistributionFloat StartRotationRate; // 0x68
};

struct UTgAIBehaviorAction_SelectLaneMoveTarget {
	char bMustBeEnemy : 1; // 0x94
	char bMustBePhoenix : 1; // 0x94
	char bMustBeSameLane : 1; // 0x94
};

struct UPComMusicTheme {
	FMusicTrackStruct DefaultTrack; // 0x60
	TArray<FMusicEvent> MusicEvents; // 0x8c
};

struct UUIComponent_ItemStatsEntry {
	FString m_sItemStatsLabels[0x7]; // 0x120
	ObjectProperty m_mcIcon; // 0x190
	ObjectProperty m_mcTF; // 0x198
};

struct ALandscapeProxy {
	FGuid LandscapeGuid; // 0x280
	int32_t MaxLODLevel; // 0x290
	ObjectProperty DefaultPhysMaterial; // 0x294
	float StreamingDistanceMultiplier; // 0x29c
	ObjectProperty LandscapeMaterial; // 0x2a0
	float LODDistanceFactor; // 0x2a8
	TArray<ComponentProperty> LandscapeComponents; // 0x2ac
	TArray<ComponentProperty> CollisionComponents; // 0x2bc
	TMap<None, None> MaterialInstanceConstantMap; // 0x2cc
	TMap<None, None> WeightmapUsageMap; // 0x314
	float StaticLightingResolution; // 0x35c
	ObjectProperty LandscapeActor; // 0x360
	char bIncludeInManualZPrepass : 1; // 0x368
	char bIsProxy : 1; // 0x368
	char bIsSetup : 1; // 0x368
	char bResetup : 1; // 0x368
	char bIsMovingToLevel : 1; // 0x368
	TArray<FName> ActorLayerNames; // 0x36c
	FLightmassPrimitiveSettings LightmassSettings; // 0x37c
	int32_t CollisionMipLevel; // 0x398
	int32_t MobileLODBias; // 0x39c
	TArray<FLandscapeLayerStruct> LayerInfoObjs; // 0x3a0
	int32_t ComponentSizeQuads; // 0x3b0
	int32_t SubsectionSizeQuads; // 0x3b4
	int32_t NumSubsections; // 0x3b8
};

struct UTgSkelCon_CCD_IK_FootPlacement {
	int32_t NumBones; // 0xd0
	int32_t MaxPerBoneIterations; // 0xd4
	int32_t IterationsCount; // 0xd8
	float Precision; // 0xdc
	char bStartFromTail : 1; // 0xe0
	char bNoTurnOptimization : 1; // 0xe0
	char bAllowStretching : 1; // 0xe0
	char bInvertFootUpAxis : 1; // 0xe0
	char bOrientFootToGround : 1; // 0xe0
	char bOnlyEnableForUpAdjustment : 1; // 0xe0
	char m_bUseCachedFootOffset : 1; // 0xe0
	TArray<FJointConstraintInformation> JointConstraints; // 0xe4
	float MaxAngleSteps; // 0xf4
	float MaxStretchSteps; // 0xf8
	float FootOffset; // 0xfc
	EAxis FootUpAxis; // 0x100
	FRotator FootRotOffset; // 0x104
	float MaxUpAdjustment; // 0x110
	float MaxDownAdjustment; // 0x114
	float MaxFootOrientAdjust; // 0x118
	FVector EffectorLocation; // 0x11c
	FVector m_vCachedFootOffset; // 0x128
};

struct UTgAchievement_FromTheGrave {
	int32_t KillerPawnId; // 0x90
};

struct UInterpTrackInstSound {
	float LastUpdatePosition; // 0x60
	ComponentProperty PlayAudioComp; // 0x64
};

struct UGFxAction_GetVariable {
	ObjectProperty Movie; // 0x108
	FString Variable; // 0x110
};

struct UTgDeviceForm_CombatSlide {
	float m_fTransitionTime; // 0x2bc
};

struct UGFxObject {
	FPointer VfTable_FCallbackEventDevice; // 0x60
	int32_t Value[0xc]; // 0x68
	int32_t m_nIndex; // 0x98
	int32_t m_nFunction; // 0x9c
	char m_bMuteSound : 1; // 0xa0
	char m_bOrigVisible : 1; // 0xa0
	char m_bUseCachedDisplayInfo : 1; // 0xa0
	char m_bHasCallbacksBound : 1; // 0xa0
	float m_fAnimSize; // 0xa4
	float m_fOrigX; // 0xa8
	float m_fOrigY; // 0xac
	float m_fOrigWidth; // 0xb0
	float m_fOrigHeight; // 0xb4
	float m_fOrigScaleX; // 0xb8
	float m_fOrigScaleY; // 0xbc
	float m_fOrigAlpha; // 0xc0
	FName m_DebugName; // 0xc4
	FASDisplayInfo m_CachedDisplayInfo; // 0xcc
	TArray<FGFxWidgetBinding> SubWidgetBindings; // 0xf8
	TArray<FGFxObjectPoolEntry> m_GFxObjectPool; // 0x108
};

struct UCloudStorageBaseCloudSaveSystemKVS {
	ObjectProperty CloudStorage; // 0x60
};

struct UApexDestructibleDamageParameters {
	TArray<FDamagePair> DamageMap; // 0x60
};

struct ATgWeaponMeshActor {
	ObjectProperty m_OwningPawn; // 0x280
	UTgSkeletalMeshComponent_Weapon* m_WeaponMesh1PClass; // 0x288
	ComponentProperty m_WeaponMesh1P; // 0x290
	UTgSkeletalMeshComponent_Weapon* m_WeaponMesh3PClass; // 0x298
	ComponentProperty m_WeaponMesh3P; // 0x2a0
	TArray<ObjectProperty> m_SimpleTransitionerNodes1P; // 0x2a8
	TArray<ObjectProperty> m_DeviceModeBlendNodes; // 0x2b8
	TArray<ObjectProperty> m_FitToDurationNodes; // 0x2c8
	TArray<ObjectProperty> m_RealmCharacterNodes; // 0x2d8
	TArray<ObjectProperty> m_TriggerCameraAnimNodes; // 0x2e8
	ObjectProperty PoseTransitioner; // 0x2f8
	ObjectProperty m_PrimaryWeaponBlendNode; // 0x300
	TArray<ObjectProperty> m_PawnMeshRecoilBlendNode; // 0x308
	TArray<ObjectProperty> m_PawnMeshSimpleTransitionerNodes; // 0x318
	TArray<ObjectProperty> m_PawnMeshFitToDurationNodes; // 0x328
	TArray<ObjectProperty> m_PawnMeshRealmCharacterNodes; // 0x338
	TArray<ObjectProperty> m_PawnMeshTriggerCameraAnimNodes; // 0x348
	TArray<ObjectProperty> m_PawnDeviceModeBlendNodes; // 0x358
	TArray<ObjectProperty> m_PawnMeshBlendByFireTypeNodes; // 0x368
	TArray<ObjectProperty> m_PawnMeshAimOffsets; // 0x378
	TArray<ObjectProperty> m_PawnMovementAbilityNodes; // 0x388
	TArray<ObjectProperty> m_PawnWeaponSwapNodes; // 0x398
	TArray<ObjectProperty> m_WeaponRealmCharacterNodes; // 0x3a8
	int32_t m_nEquipSlot; // 0x3b8
	int32_t m_nDeviceId; // 0x3bc
	int32_t m_MeshAsmId1P; // 0x3c0
	int32_t m_MeshAsmId3P; // 0x3c4
	ATgDevice* m_WeaponClass; // 0x3c8
	TG_PLAY_FIRE_EFFECT_ON m_PlayFireEffectsOn[0x14]; // 0x3d0
	TG_EQUIP_POINT m_ActiveEquipPoint; // 0x3e4
	EFirstPersonWeaponAttachState Current1pAttachState; // 0x3e5
	char m_bShouldLoopingMuzzleTrace : 1; // 0x3e8
	char m_bUseSocketForCameraAttach : 1; // 0x3e8
	char m_bProceduralBob : 1; // 0x3e8
	char m_bIsFOVZoomed : 1; // 0x3e8
	char m_bFlourishBlocked : 1; // 0x3e8
	char m_bIsHoldingBeacon : 1; // 0x3e8
	char m_bWasViewTargetLastTick : 1; // 0x3e8
	char m_bUseCameraAnims : 1; // 0x3e8
	char c_bEnemyMatLoaded : 0; // 0x3e8
	char m_bFullScreenScope : 0; // 0x3e8
	float m_fBobMult1; // 0x3ec
	float m_fBobMult2; // 0x3f0
	ComponentProperty m_HandsMesh; // 0x3f4
	ComponentProperty m_HeadMesh1P; // 0x3fc
	FVector2D m_v2WeaponLagAimOffset; // 0x404
	FVector2D m_nMaxWeaponLag; // 0x40c
	FVector2D m_v2WeaponLagInterpSpeed; // 0x414
	FVector2D m_v2WeaponLagSmoothingFactor; // 0x41c
	FRotator m_rLastRotation; // 0x424
	FVector2D m_fSmoothedAimOffset; // 0x430
	float m_fSmoothAimFactor; // 0x438
	ObjectProperty m_FireCameraShake; // 0x43c
	int32_t m_nTracerCounter; // 0x444
	int32_t m_nTracerFrequency; // 0x448
	FName m_TracerName; // 0x44c
	float m_fTracerLifetime; // 0x454
	FName m_HitTargetName; // 0x458
	FName m_HitWallName; // 0x460
	FName m_WhizbyName; // 0x468
	float m_BeamEmitterEndPointOffset; // 0x470
	int32_t m_nBeaconMeshId; // 0x474
	TArray<ObjectProperty> m_HitReactionSkelControls; // 0x478
	TArray<FQueuedImpactEffect> m_QueuedImpactEffects; // 0x488
	ObjectProperty m_LandSkelControl; // 0x498
	ObjectProperty m_GameplayCurves; // 0x4a0
	ObjectProperty m_FlyingSkelControl; // 0x4a8
	ObjectProperty m_WeaponDownSkelControl; // 0x4b0
	ObjectProperty m_JumpSkelControl; // 0x4b8
	ObjectProperty m_DoubleJumpSkelControl; // 0x4c0
	float m_fDesiredZoomMeshFOV; // 0x4c8
	float m_fDesiredZoomViewFOV; // 0x4cc
	float m_fADSZoomInTime; // 0x4d0
	float m_fADSZoomOutTime; // 0x4d4
	FVector m_vZoomMeshOffset; // 0x4d8
	ComponentProperty m_MuzzleFlashLight; // 0x4e4
	TArray<ObjectProperty> m_RecoilSkelControls; // 0x4ec
	FName m_nAnimSetPackageName; // 0x4fc
};

struct ATgDevice_MarkAndRecall {
	FVector m_markedLocation; // 0xaec
	FRotator m_markedRotation; // 0xaf8
	char m_bMarked : 1; // 0xb04
};

struct UParticleModuleLocation {
	FRawDistributionVector StartLocation; // 0x68
	float DistributeOverNPoints; // 0x8c
	float DistributeThreshold; // 0x90
};

struct ATgPhysAnimTestActor {
	TArray<FName> LowerBoneNames; // 0x280
	TArray<FName> LinearBoneSpringNames; // 0x290
	TArray<FName> AngularBoneSpringNames; // 0x2a0
	ComponentProperty SkeletalMeshComponent; // 0x2b0
	EPATAState CurrentState; // 0x2b8
	char bBlendToGetUp : 1; // 0x2bc
	char bBlendingBack : 1; // 0x2bc
	char bRampingDownMotors : 1; // 0x2bc
	char bNextPokeKnocksDown : 1; // 0x2bc
	float GetUpBlendStartTime; // 0x2c0
	float GetUpBlendTime; // 0x2c4
	float GetUpToIdleTime; // 0x2c8
	float ActorOriginHeight; // 0x2cc
	float PokePauseTime; // 0x2d0
	float PokeBlendTime; // 0x2d4
	float BlendBackStartTime; // 0x2d8
	float MotorDownStartTime; // 0x2dc
	float MotorDownTime; // 0x2e0
	float MotorDownAnimTime; // 0x2e4
	float BlendStaggerAnimTime; // 0x2e8
	float StaggerSpeedAdj; // 0x2ec
	float StaggerVel; // 0x2f0
	FVector MoveDir; // 0x2f4
	float AngularHipDriveScale; // 0x300
	float StaggerMuscleScale; // 0x304
	ObjectProperty blendNode; // 0x308
	ObjectProperty GetUpNode; // 0x310
	ObjectProperty RunNode; // 0x318
	ObjectProperty HipBody; // 0x320
};

struct UTexture {
	char SRGB : 1; // 0x60
	char RGBE : 1; // 0x60
	char bIsSourceArtUncompressed : 1; // 0x60
	char CompressionNoAlpha : 1; // 0x60
	char CompressionNone : 1; // 0x60
	char CompressionNoMipmaps : 1; // 0x60
	char CompressionFullDynamicRange : 1; // 0x60
	char DeferCompression : 1; // 0x60
	char NeverStream : 0; // 0x60
	char bDitherMipMapAlpha : 0; // 0x60
	char bPreserveBorderR : 0; // 0x60
	char bPreserveBorderG : 0; // 0x60
	char bPreserveBorderB : 0; // 0x60
	char bPreserveBorderA : 0; // 0x60
	char bNoTiling : 0; // 0x60
	char bForcePVRTC4 : 0; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 0; // 0x60
	char bUseCinematicMipLevels : 0; // 0x60
	float UnpackMin[0x4]; // 0x64
	float UnpackMax[0x4]; // 0x74
	FUntypedBulkData_Mirror SourceArt; // 0x84
	TextureCompressionSettings CompressionSettings; // 0xc4
	TextureFilter Filter; // 0xc5
	TextureGroup LODGroup; // 0xc6
	TextureGroup CachedLODGroup; // 0xc7
	TextureMipGenSettings MipGenSettings; // 0xc8
	int32_t LODBias; // 0xcc
	int32_t CachedCombinedLODBias; // 0xd0
	int32_t NumCinematicMipLevels; // 0xd4
	FPointer Resource; // 0xd8
	float AdjustBrightness; // 0xe0
	float AdjustBrightnessCurve; // 0xe4
	float AdjustVibrance; // 0xe8
	float AdjustSaturation; // 0xec
	float AdjustRGBCurve; // 0xf0
	float AdjustHue; // 0xf4
	int32_t InternalFormatLODBias; // 0xf8
	int32_t RequiredCreationFlags; // 0xfc
};

struct UTgDropShadowDecalComponent {
	float LastCachedZ; // 0x310
	FVector LastOwnerPos; // 0x314
};

struct UTgInventoryObject_Listen_Conduit {
	int32_t m_nDeviceIdShockPulseMain; // 0xc8
	int32_t m_nDeviceIdShockPulseSupport; // 0xcc
	TArray<ObjectProperty> m_EnemiesHitThisPulse; // 0xd0
};

struct UUIData_CustomGame {
	Fdword m_dwOriginalQueueId; // 0x60
	Fdword m_dwMatchId; // 0x64
	FString m_sQueueName; // 0x68
	Fdword m_dwOwnerPlayerId; // 0x78
	FString m_sOwnerName; // 0x7c
	char m_bHasPassword : 1; // 0x8c
	Fdword m_dwSiteId; // 0x90
	int32_t m_nMinPlayers; // 0x94
	int32_t m_nMaxPlayers; // 0x98
	int32_t m_nNumPlayers; // 0x9c
};

struct UPBRuleNodeMesh {
	TArray<FBuildingMeshInfo> BuildingMeshes; // 0x70
	FBuildingMeshInfo PartialOccludedBuildingMesh; // 0x80
	char bDoOcclusionTest : 1; // 0xcc
	char bBlockAll : 1; // 0xcc
};

struct UUIComponent_ProgressBarHorizontal {
	char m_bHideFillWhenEmpty : 1; // 0x120
	char m_bHideTipWhenEmpty : 1; // 0x120
	ObjectProperty m_mcBackground; // 0x124
	ObjectProperty m_mcFill; // 0x12c
	ObjectProperty m_mcTip; // 0x134
};

struct ATgPawn_LootGoblin {
	EGoblinState r_eCurrentState; // 0x310c
	float m_fGoblinStateTimer; // 0x3110
	float m_fEscapeTimer; // 0x3114
	float m_fTotalDamage; // 0x3118
	TArray<ObjectProperty> m_RoyaleObjectivesVisited; // 0x311c
	float m_fSpawnTime; // 0x312c
	float m_fMovementTime; // 0x3130
	float m_fStopTime; // 0x3134
	float m_fStartEscapeTime; // 0x3138
	float m_fEscapeTime; // 0x313c
	float m_fDamageTime; // 0x3140
	float m_fMaxDamage; // 0x3144
	TArray<FGoblinLootInfo> m_GoblinLootInfo; // 0x3148
	TArray<FGoblinLootInfo> m_GoblinFlinchLootInfo; // 0x3158
	ObjectProperty m_pNormalizerEffectGroup; // 0x3168
	ObjectProperty m_pMIC; // 0x3170
	FName m_nWallEnableName; // 0x3178
	FName m_nWallPositionName; // 0x3180
	char m_bTickMaskingPlane : 1; // 0x3188
	char m_bHasDespawned : 1; // 0x3188
};

struct ATgDevice_RocketLauncher {
	FVector m_vProjectileSpawnOffset2; // 0xaec
	int32_t m_nFireCount; // 0xaf8
};

struct UTcpNetDriver {
	char AllowPlayerPortUnreach : 1; // 0x208
	char LogPortUnreach : 1; // 0x20c
};

struct UHeightFogComponent {
	char bEnabled : 1; // 0x88
	float Height; // 0x8c
	float Density; // 0x90
	float LightBrightness; // 0x94
	FColor LightColor; // 0x98
	float ExtinctionDistance; // 0x9c
	float StartDistance; // 0xa0
};

struct UActorFactoryApexClothing {
	TArray<ObjectProperty> ClothingAssets; // 0xb4
	ERBCollisionChannel ClothingRBChannel; // 0xc4
	FRBCollisionChannelContainer ClothingRBCollideWithChannels; // 0xc8
};

struct UPath_TowardPoint {
	FVector GoalPoint; // 0x6c
};

struct UUIComponent_IconTF {
	ObjectProperty m_mcIcon; // 0x120
};

struct UActorFactoryArchetype {
	ObjectProperty ArchetypeActor; // 0x9c
};

struct UCodecMovieFallback {
	float CurrentTime; // 0x64
};

struct UAnimNodeScaleRateBySpeed {
	float BaseSpeed; // 0x118
	float MinScaleValue; // 0x11c
};

struct UInterpTrackVectorMaterialParam {
	TArray<FMaterialReferenceList> Materials; // 0xb8
	ObjectProperty Material; // 0xc8
	FName ParamName; // 0xd0
	char bNeedsMaterialRefsUpdate : 1; // 0xd8
};

struct USeqAct_PlaySound {
	ObjectProperty PlaySound; // 0x120
	float ExtraDelay; // 0x128
	char bDelayReached : 1; // 0x12c
	char bSuppressSubtitles : 1; // 0x12c
	char bStopped : 1; // 0x12c
	float SoundDuration; // 0x130
	float FadeInTime; // 0x134
	float FadeOutTime; // 0x138
	float VolumeMultiplier; // 0x13c
	float PitchMultiplier; // 0x140
	float BeforeEndTime; // 0x144
};

struct UTgSkelCon_RotateToVelocity {
	float m_fRotationSpeed; // 0x100
	char m_bUseConstantSpeed : 1; // 0x104
	char m_bVelocity2DOnly : 1; // 0x104
	float m_fMinVelocity; // 0x108
	FRotator m_rTargetRotation; // 0x10c
};

struct UUIComponent_ShopList {
	int32_t m_nCurrentSection; // 0x120
	float m_fScrollX; // 0x124
	float m_fTargetScrollX; // 0x128
	int32_t m_nSymbolInstanceIndex; // 0x12c
	FString m_sContainerSymbolName; // 0x130
	FString m_sHeaderSymbolName; // 0x140
	FString m_sItemFeaturedSymbolName; // 0x150
	FString m_sItemMajorSymbolName; // 0x160
	FString m_sItemMinorSymbolName; // 0x170
	FString m_sItemDailySymbolName; // 0x180
	float m_fItemFeaturedWidth; // 0x190
	float m_fItemFeaturedHeight; // 0x194
	float m_fItemMajorWidth; // 0x198
	float m_fItemMajorHeight; // 0x19c
	float m_fItemMinorWidth; // 0x1a0
	float m_fItemMinorHeight; // 0x1a4
	float m_fItemDailyWidth; // 0x1a8
	float m_fItemDailyHeight; // 0x1ac
	int32_t m_nSelectedSectionIndex; // 0x1b0
	int32_t m_nSelectedItemIndex; // 0x1b4
	TArray<FUICShopListSection> m_ListSections; // 0x1b8
	ObjectProperty m_pScrollbar; // 0x1c8
	ObjectProperty m_grList; // 0x1d0
};

struct UNavMeshGoalFilter_OutOfViewFrom {
	FPointer GoalPoly; // 0x6c
	FVector OutOfViewLocation; // 0x74
};

struct UParticleModuleSize {
	FRawDistributionVector StartSize; // 0x68
};

struct ALandscapeGizmoActiveActor {
	TMap<None, None> SelectedData; // 0x280
};

struct UUIProfileMini {
	int32_t m_nTitle; // 0x244
	int32_t m_nCrowns; // 0x248
	int32_t m_nTrophies; // 0x24c
	char m_bSearching : 1; // 0x250
	char m_bShowMinimize : 1; // 0x250
	ObjectProperty m_mcExit; // 0x254
	ObjectProperty m_mcPlayer; // 0x25c
	ObjectProperty m_mcPlayerTitle; // 0x264
	ObjectProperty m_mcMinimize; // 0x26c
	ObjectProperty m_mcCrowns; // 0x274
	ObjectProperty m_mcCrownsText; // 0x27c
	ObjectProperty m_mcCrownsButton; // 0x284
	ObjectProperty m_mcTrophies; // 0x28c
	ObjectProperty m_mcTrophiesText; // 0x294
	ObjectProperty m_mcSearching; // 0x29c
	ObjectProperty m_mcSearchingTitle; // 0x2a4
	ObjectProperty m_mcSearchingSubtitle; // 0x2ac
	ObjectProperty m_mcMember[0x4]; // 0x2b4
	ObjectProperty m_mcMemberIcon[0x4]; // 0x2d4
	ObjectProperty m_mcMemberLogo[0x4]; // 0x2f4
	ObjectProperty m_mcMemberFrame[0x4]; // 0x314
};

struct UMobileMenuButton {
	ObjectProperty Images[0x2]; // 0xdc
	FUVCoords ImagesUVs[0x2]; // 0xec
	FLinearColor ImageColor; // 0x114
	FString Caption; // 0x124
	FLinearColor CaptionColor; // 0x134
};

struct UUIDataEsportsManager {
	TArray<ObjectProperty> m_EventArray; // 0x70
	TMap<None, None> m_Events; // 0x80
	TMap<None, None> m_Teams; // 0xc8
	Fdword m_dwRewardMultiplier; // 0x110
};

struct ATgAIController {
	ObjectProperty m_pOwner; // 0x4e0
	FVector m_vSpawnLocation; // 0x4e8
	FRotator m_rSpawnDirection; // 0x4f4
	ObjectProperty m_pFactory; // 0x500
	int32_t m_nFactorySpawnGroup; // 0x508
	FPointer m_pBot; // 0x50c
	FPointer m_pSettings; // 0x514
	FPointer m_pSkin; // 0x51c
	int32_t m_iAssignedLane; // 0x524
	TMap<None, None> m_SeePawnCache; // 0x528
	float LastSeePawnCacheTime; // 0x570
	float SeePawnClearTime; // 0x574
	ObjectProperty m_pLastAttacker; // 0x578
	ObjectProperty m_Squad; // 0x580
	float LastDamageTakenTime; // 0x588
	FVector LastDamageTakenPosition; // 0x58c
	TMap<None, None> m_LoSCache; // 0x598
	float LastLoSCacheTime; // 0x5e0
	EHavokNavigationMeshType m_eNavmeshType; // 0x5e4
	EPhysics WalkingPhysics; // 0x5e5
	float m_fAILevelUpSecs; // 0x5e8
	float VisionDistance; // 0x5ec
	float VisionDistanceBonus; // 0x5f0
	char bUsesObstacleAvoidance : 1; // 0x5f4
	char bIsPaused : 1; // 0x5f4
	char bIsAIFrozen : 1; // 0x5f4
	ObjectProperty ObstacleAvoidance; // 0x5f8
	float ObstacleAvoidanceGridPointSize; // 0x600
	float ObstacleAvoidanceGridExtents; // 0x604
	FVector SpreadLocation; // 0x608
	ObjectProperty CachedPRI; // 0x614
	TMap<None, None> DeviceTargetingCache; // 0x61c
	float LastCheckStuckTime; // 0x664
	float CheckStuckTime; // 0x668
	FVector LastCachedStuckPosition; // 0x66c
	float LastCheckFlungTime; // 0x678
	float CheckFlungTime; // 0x67c
	FVector LastCachedFlungPosition; // 0x680
};

struct USeqEvent_LOS {
	float ScreenCenterDistance; // 0x128
	float TriggerDistance; // 0x12c
	char bCheckForObstructions : 1; // 0x130
};

struct ATgDevice_Soar {
	float m_fPrevCollisionHeight; // 0xaec
};

struct UOnlinePlaylistProvider {
	int32_t PlaylistId; // 0x94
	TArray<FName> PlaylistGameTypeNames; // 0x98
	FString DisplayName; // 0xa8
	int32_t Priority; // 0xb8
};

struct UTgDataManager {
	ObjectProperty m_EOMData; // 0x60
	ObjectProperty m_CardData; // 0x68
	ObjectProperty m_NotificationData; // 0x70
	TArray<ObjectProperty> m_DataSets; // 0x78
	TArray<ObjectProperty> m_Callbacks; // 0x88
};

struct UTgSeqAct_PingMinimap {
	ObjectProperty m_PingTarget; // 0x108
};

struct UParticleModuleRequired {
	ObjectProperty Material; // 0x68
	EParticleScreenAlignment ScreenAlignment; // 0x70
	EParticleSortMode SortMode; // 0x71
	EParticleBurstMethod ParticleBurstMethod; // 0x72
	EParticleSubUVInterpMethod InterpolationMethod; // 0x73
	EEmitterNormalsMode EmitterNormalsMode; // 0x74
	char bAllowImageFlipping : 1; // 0x78
	char bSquareImageFlipping : 1; // 0x78
	char bUseLocalSpace : 1; // 0x78
	char bKillOnDeactivate : 1; // 0x78
	char bKillOnCompleted : 1; // 0x78
	char bRequiresSorting : 1; // 0x78
	char bUseLegacyEmitterTime : 1; // 0x78
	char bEnableNearParticleCulling : 1; // 0x78
	char bEnableFarParticleCulling : 0; // 0x78
	char bEnableParticleTrimming : 0; // 0x78
	char bEmitterDurationUseRange : 0; // 0x78
	char bDurationRecalcEachLoop : 0; // 0x78
	char bEmitterDelayUseRange : 0; // 0x78
	char bDelayFirstLoopOnly : 0; // 0x78
	char bScaleUV : 0; // 0x78
	char bDirectUV : 0; // 0x78
	char bOverrideSystemMacroUV : 0; // 0x78
	char bUseMaxDrawCount : 0; // 0x78
	char bOrbitModuleAffectsVelocityAlignment : 0; // 0x78
	float NearCullDistance; // 0x7c
	float NearFadeDistance; // 0x80
	float FarFadeDistance; // 0x84
	float FarCullDistance; // 0x88
	TArray<FVector2D> TrimmedVertices; // 0x8c
	float EmitterDuration; // 0x9c
	float EmitterDurationLow; // 0xa0
	int32_t EmitterLoops; // 0xa4
	FRawDistributionFloat SpawnRate; // 0xa8
	TArray<FParticleBurst> BurstList; // 0xcc
	float EmitterDelay; // 0xdc
	float EmitterDelayLow; // 0xe0
	int32_t SubImages_Horizontal; // 0xe4
	int32_t SubImages_Vertical; // 0xe8
	float RandomImageTime; // 0xec
	int32_t RandomImageChanges; // 0xf0
	FVector MacroUVPosition; // 0xf4
	float MacroUVRadius; // 0x100
	int32_t MaxDrawCount; // 0x104
	float DownsampleThresholdScreenFraction; // 0x108
	FVector NormalsSphereCenter; // 0x10c
	FVector NormalsCylinderDirection; // 0x118
};

struct UTgSeqEvent_TaskForceScoreUpdated {
	int32_t DefenderTaskForce; // 0x128
	int32_t CurrentScore; // 0x12c
};

struct UUIComponent_MatchPlayerEntry {
	ObjectProperty m_mcEndCap; // 0x120
	ObjectProperty m_mcIcon; // 0x128
	ObjectProperty m_mcName; // 0x130
	ObjectProperty m_pPlayerName; // 0x138
	ObjectProperty m_mcTitle; // 0x140
	ObjectProperty m_mcBuild; // 0x148
	ObjectProperty m_mcBuild_Stat[0x2]; // 0x150
	ObjectProperty m_mcBuild_Talent; // 0x160
	ObjectProperty m_mcBuild_TalentIcon; // 0x168
	ObjectProperty m_mcBooster0; // 0x170
	ObjectProperty m_mcBooster0Tex; // 0x178
	ObjectProperty m_mcBooster1; // 0x180
	ObjectProperty m_mcBooster1Tex; // 0x188
	ObjectProperty m_Cards[0x5]; // 0x190
	ObjectProperty m_CardButtons[0x5]; // 0x1b8
	ObjectProperty m_Items[0x4]; // 0x1e0
	ObjectProperty m_ItemButtons[0x4]; // 0x200
	ObjectProperty m_mcStatsDetails; // 0x220
	ObjectProperty m_mcStatsDetails_Stat[0x7]; // 0x228
	ObjectProperty m_TalentButton; // 0x260
	ObjectProperty m_FrameButton; // 0x268
	ObjectProperty m_ReportButton; // 0x270
	ObjectProperty m_ImportButton; // 0x278
	ObjectProperty m_AddButton; // 0x280
	ObjectProperty m_pTooltip; // 0x288
	char m_bCanReport : 1; // 0x290
};

struct UUIComponent_Card {
	ObjectProperty m_mcCTA; // 0x120
	ObjectProperty m_mcChampion; // 0x128
	ObjectProperty m_mcChampionIcon; // 0x130
	ObjectProperty m_mcCooldown; // 0x138
	ObjectProperty m_mcCost; // 0x140
	ObjectProperty m_mcName; // 0x148
	ObjectProperty m_mcSkill; // 0x150
	ObjectProperty m_mcDesc; // 0x158
	ObjectProperty m_mcRarity; // 0x160
	ObjectProperty m_mcFrame; // 0x168
	ObjectProperty m_mcCooldownTimer; // 0x170
	ObjectProperty m_mcProgressBack; // 0x178
	ObjectProperty m_mcProgressCover; // 0x180
	ObjectProperty m_mcIcon; // 0x188
	ObjectProperty m_mcRarityGlow; // 0x190
	ObjectProperty m_pProgress; // 0x198
	float m_fOwnedOverride; // 0x1a0
	char m_bShowChampion : 1; // 0x1a4
	char m_bShowRarityGlow : 1; // 0x1a4
};

struct UActorFactoryLensFlare {
	ObjectProperty LensFlareObject; // 0x9c
};

struct USkeletalMesh {
	FBoxSphereBounds Bounds; // 0x60
	FVector LodCheckSphereOrigin; // 0x7c
	float LodCheckSphereRadius; // 0x88
	TArray<ObjectProperty> Materials; // 0x8c
	TArray<ObjectProperty> ClothingAssets; // 0x9c
	TArray<FApexClothingAssetInfo> ClothingLodMap; // 0xac
	FVector Origin; // 0xbc
	FRotator RotOrigin; // 0xc8
	TArray<int32_t> RefSkeleton; // 0xd4
	int32_t SkeletalDepth; // 0xe4
	TMap<None, None> NameIndexMap; // 0xe8
	FIndirectArray_Mirror LODModels; // 0x130
	FPointer SourceData; // 0x140
	TArray<FBoneAtom> RefBasesInvMatrix; // 0x148
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0x158
	EAxis SkelMirrorAxis; // 0x168
	EAxis SkelMirrorFlipAxis; // 0x169
	TArray<ObjectProperty> Sockets; // 0x16c
	TArray<FString> BoneBreakNames; // 0x17c
	TArray<BoneBreakOption> BoneBreakOptions; // 0x18c
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0x19c
	TArray<FSkeletalMeshOptimizationSettings> OptimizationSettings; // 0x1ac
	TArray<FName> PerPolyCollisionBones; // 0x1bc
	TArray<FName> AddToParentPerPolyCollisionBone; // 0x1cc
	TArray<int32_t> PerPolyBoneKDOPs; // 0x1dc
	char bStripkDOP : 1; // 0x1ec
	char bPerPolyUseSoftWeighting : 1; // 0x1ec
	char bUseSimpleLineCollision : 1; // 0x1ec
	char bUseSimpleBoxCollision : 1; // 0x1ec
	char bForceCPUSkinning : 1; // 0x1ec
	char bUseFullPrecisionUVs : 1; // 0x1ec
	char bHasBeenSimplified : 1; // 0x1ec
	ObjectProperty FaceFXAsset; // 0x1f0
	int32_t LODBiasPC; // 0x1f8
	int32_t LODBiasPS3; // 0x1fc
	int32_t LODBiasXbox360; // 0x200
	int32_t LODBiasOrbis; // 0x204
	TArray<FPointer> ClothMesh; // 0x208
	TArray<float> ClothMeshScale; // 0x218
	TArray<int32_t> ClothToGraphicsVertMap; // 0x228
	TArray<float> ClothMovementScale; // 0x238
	ClothMovementScaleGen ClothMovementScaleGenMode; // 0x248
	float ClothToAnimMeshMaxDist; // 0x24c
	char bLimitClothToAnimMesh : 1; // 0x250
	TArray<int32_t> ClothWeldingMap; // 0x254
	int32_t ClothWeldingDomain; // 0x264
	TArray<int32_t> ClothWeldedIndices; // 0x268
	char bForceNoWelding : 1; // 0x278
	int32_t NumFreeClothVerts; // 0x27c
	TArray<int32_t> ClothIndexBuffer; // 0x280
	TArray<FName> ClothBones; // 0x290
	int32_t ClothHierarchyLevels; // 0x2a0
	char bEnableClothBendConstraints : 1; // 0x2a4
	char bEnableClothDamping : 1; // 0x2a4
	char bUseClothCOMDamping : 1; // 0x2a4
	float ClothStretchStiffness; // 0x2a8
	float ClothBendStiffness; // 0x2ac
	float ClothDensity; // 0x2b0
	float ClothThickness; // 0x2b4
	float ClothDamping; // 0x2b8
	int32_t ClothIterations; // 0x2bc
	int32_t ClothHierarchicalIterations; // 0x2c0
	float ClothFriction; // 0x2c4
	float ClothRelativeGridSpacing; // 0x2c8
	float ClothPressure; // 0x2cc
	float ClothCollisionResponseCoefficient; // 0x2d0
	float ClothAttachmentResponseCoefficient; // 0x2d4
	float ClothAttachmentTearFactor; // 0x2d8
	float ClothSleepLinearVelocity; // 0x2dc
	float HardStretchLimitFactor; // 0x2e0
	char bHardStretchLimit : 1; // 0x2e4
	char bEnableClothOrthoBendConstraints : 1; // 0x2e4
	char bEnableClothSelfCollision : 1; // 0x2e4
	char bEnableClothPressure : 1; // 0x2e4
	char bEnableClothTwoWayCollision : 1; // 0x2e4
	TArray<FClothSpecialBoneInfo> ClothSpecialBones; // 0x2e8
	char bEnableClothLineChecks : 1; // 0x2f8
	char bClothMetal : 1; // 0x2f8
	float ClothMetalImpulseThreshold; // 0x2fc
	float ClothMetalPenetrationDepth; // 0x300
	float ClothMetalMaxDeformationDistance; // 0x304
	char bEnableClothTearing : 1; // 0x308
	float ClothTearFactor; // 0x30c
	int32_t ClothTearReserve; // 0x310
	char bEnableValidBounds : 1; // 0x314
	FVector ValidBoundsMin; // 0x318
	FVector ValidBoundsMax; // 0x324
	FMap_Mirror ClothTornTriMap; // 0x330
	TArray<int32_t> SoftBodySurfaceToGraphicsVertMap; // 0x378
	TArray<int32_t> SoftBodySurfaceIndices; // 0x388
	TArray<FVector> SoftBodyTetraVertsUnscaled; // 0x398
	TArray<int32_t> SoftBodyTetraIndices; // 0x3a8
	TArray<FSoftBodyTetraLink> SoftBodyTetraLinks; // 0x3b8
	TArray<FPointer> CachedSoftBodyMeshes; // 0x3c8
	TArray<float> CachedSoftBodyMeshScales; // 0x3d8
	TArray<FName> SoftBodyBones; // 0x3e8
	TArray<FSoftBodySpecialBoneInfo> SoftBodySpecialBones; // 0x3f8
	float SoftBodyVolumeStiffness; // 0x408
	float SoftBodyStretchingStiffness; // 0x40c
	float SoftBodyDensity; // 0x410
	float SoftBodyParticleRadius; // 0x414
	float SoftBodyDamping; // 0x418
	int32_t SoftBodySolverIterations; // 0x41c
	float SoftBodyFriction; // 0x420
	float SoftBodyRelativeGridSpacing; // 0x424
	float SoftBodySleepLinearVelocity; // 0x428
	char bEnableSoftBodySelfCollision : 1; // 0x42c
	float SoftBodyAttachmentResponse; // 0x430
	float SoftBodyCollisionResponse; // 0x434
	float SoftBodyDetailLevel; // 0x438
	int32_t SoftBodySubdivisionLevel; // 0x43c
	char bSoftBodyIsoSurface : 1; // 0x440
	char bEnableSoftBodyDamping : 1; // 0x440
	char bUseSoftBodyCOMDamping : 1; // 0x440
	float SoftBodyAttachmentThreshold; // 0x444
	char bEnableSoftBodyTwoWayCollision : 1; // 0x448
	float SoftBodyAttachmentTearFactor; // 0x44c
	char bEnableSoftBodyLineChecks : 1; // 0x450
	char bHasVertexColors : 1; // 0x450
	TArray<char> GraphicsIndexIsCloth; // 0x454
	TArray<float> CachedStreamingTextureFactors; // 0x464
	float StreamingDistanceMultiplier; // 0x474
	int32_t ReleaseResourcesFence; // 0x478
	FQWord SkelMeshRUID; // 0x47c
	char bUseClothingAssetMaterial : 1; // 0x484
};

struct UTgAchievement_HardCarry {
	int32_t nKills; // 0x90
};

struct UUIChatScene {
	int32_t m_nContextChangedCallbackHandle; // 0x244
	ObjectProperty m_KeyCapture; // 0x248
	int32_t m_nChannel; // 0x250
	int32_t m_nScroll; // 0x254
	int32_t m_nLineNumber; // 0x258
	int32_t m_nPrevIndex; // 0x25c
	float m_fBuffer; // 0x260
	float m_fOutputWidth; // 0x264
	FString m_sRecipient; // 0x268
	FString m_sRemaining; // 0x278
	FString m_sLastInput; // 0x288
	int32_t m_nCommand; // 0x298
	ObjectProperty m_pChatData; // 0x29c
	ObjectProperty m_mcInput; // 0x2a4
	TArray<FChatMessage> m_Messages; // 0x2ac
	TArray<FString> m_PrevChats; // 0x2bc
};

struct UTgSeqAct_ShowGameTip {
	int32_t GameTipId; // 0x108
	ObjectProperty TargetPlayer; // 0x10c
};

struct UTgAnimNotify_SetMICParam {
	FName m_nmParamName; // 0x68
	float m_fTargetValue; // 0x70
};

struct UTgSkelControlSingleBone_Ammo {
	ObjectProperty m_PawnOwner; // 0x144
	char m_bInvertStrengthFromAmmo : 1; // 0x14c
	float m_fFlatInterpolationRateDecrease; // 0x150
	float m_fInterpolationRateDecrease; // 0x154
	float m_fFlatInterpolationRateIncrease; // 0x158
	float m_fInterpolationRateIncrease; // 0x15c
	int32_t m_nMaxAmmoFallback; // 0x160
};

struct UGameThirdPersonCamera {
	float WorstLocBlockedPct; // 0x6c
	float WorstLocPenetrationExtentScale; // 0x70
	float PenetrationBlendOutTime; // 0x74
	float PenetrationBlendInTime; // 0x78
	float PenetrationBlockedPct; // 0x7c
	float PenetrationExtentScale; // 0x80
	FVector LastActualOriginOffset; // 0x84
	FVector LastActualCameraOrigin; // 0x90
	FRotator LastActualCameraOriginRot; // 0x9c
	float OriginOffsetInterpSpeed; // 0xa8
	FVector LastViewOffset; // 0xac
	float LastCamFOV; // 0xb8
	FVector LastIdealCameraOrigin; // 0xbc
	FRotator LastIdealCameraOriginRot; // 0xc8
	ObjectProperty ThirdPersonCamDefault; // 0xd4
	UGameThirdPersonCameraMode* ThirdPersonCamDefaultClass; // 0xdc
	ObjectProperty CurrentCamMode; // 0xe4
	float LastHeightAdjustment; // 0xec
	float LastPitchAdjustment; // 0xf0
	float LastYawAdjustment; // 0xf4
	float LeftoverPitchAdjustment; // 0xf8
	float Focus_BackOffStrength; // 0xfc
	float Focus_StepHeightAdjustment; // 0x100
	int32_t Focus_MaxTries; // 0x104
	float Focus_FastAdjustKickInTime; // 0x108
	float LastFocusChangeTime; // 0x10c
	FVector ActualFocusPointWorldLoc; // 0x110
	FVector LastFocusPointLoc; // 0x11c
	FCamFocusPointParams FocusPoint; // 0x128
	char bFocusPointSet : 1; // 0x160
	char bFocusPointSuccessful : 1; // 0x160
	char bDoingACameraTurn : 1; // 0x160
	char bTurnAlignTargetWhenFinished : 1; // 0x160
	char bDrawDebug : 1; // 0x160
	char bDoingDirectLook : 1; // 0x160
	char bDebugChangedCameraMode : 1; // 0x160
	char bDoSeamlessPivotTransition : 1; // 0x160
	float TurnCurTime; // 0x164
	int32_t TurnStartAngle; // 0x168
	int32_t TurnEndAngle; // 0x16c
	float TurnTotalTime; // 0x170
	float TurnDelay; // 0x174
	int32_t LastPostCamTurnYaw; // 0x178
	int32_t DirectLookYaw; // 0x17c
	float DirectLookInterpSpeed; // 0x180
	float WorstLocInterpSpeed; // 0x184
	FVector LastWorstLocationLocal; // 0x188
	FVector LastWorstLocation; // 0x194
	FVector LastPreModifierCameraLoc; // 0x1a0
	FRotator LastPreModifierCameraRot; // 0x1ac
	TArray<FPenetrationAvoidanceFeeler> PenetrationAvoidanceFeelers; // 0x1b8
	FVector LastOffsetAdjustment; // 0x1c8
};

struct UUIData_TreasureRoll_Item {
	ObjectProperty m_pRolledItem; // 0x60
	Fdword m_dwRolledItemQuantity; // 0x68
	ObjectProperty m_pReplacementItem; // 0x6c
	Fdword m_dwReplacementItemQuantity; // 0x74
	char m_bIsUnreceivedBoostedItem : 1; // 0x78
	TArray<ObjectProperty> m_pRolledSubItems; // 0x7c
	ObjectProperty m_pSubItemReplacementAggregate; // 0x8c
};

struct UCameraShake {
	char bSingleInstance : 1; // 0x60
	char bRandomAnimSegment : 1; // 0x60
	char bDoHUDShake : 1; // 0x60
	float OscillationDuration; // 0x64
	float OscillationBlendInTime; // 0x68
	float OscillationBlendOutTime; // 0x6c
	FROscillator RotOscillation; // 0x70
	FVOscillator LocOscillation; // 0x94
	FFOscillator FOVOscillation; // 0xb8
	ObjectProperty Anim; // 0xc4
	float AnimPlayRate; // 0xcc
	float AnimScale; // 0xd0
	float AnimBlendInTime; // 0xd4
	float AnimBlendOutTime; // 0xd8
	float RandomAnimSegmentDuration; // 0xdc
	FV2DOscillator HUDOscillation; // 0xe0
};

struct UActorFactoryAmbientSound {
	ObjectProperty AmbientSoundCue; // 0x9c
};

struct UDynamicSpriteComponent {
	FInterpCurveFloat AnimatedScale; // 0x26c
	FInterpCurveLinearColor AnimatedColor; // 0x280
	FInterpCurveVector2D AnimatedPosition; // 0x294
	FVector LocationOffset; // 0x2a8
	int32_t LoopCount; // 0x2b4
};

struct UTgAIBehaviorCondition_NearestTowerHealthPercent {
	char bMustBeEnemy : 1; // 0x98
	float HealthPct; // 0x9c
};

struct UUIData_MatchBoosterActivated {
	Fdword dwSourcePlayerId; // 0x60
	Fdword dwTaskForce; // 0x64
	Fdword eItemBoosterSubtype; // 0x68
	float fMultiplier; // 0x6c
	ObjectProperty pBoosterItem; // 0x70
};

struct ATgTrigger_Instance {
	int32_t m_nMapId; // 0x290
	char m_nPreload : 1; // 0x294
	char m_nTaskForce : 1; // 0x294
	FString m_SpawnPointName; // 0x298
};

struct ATgLobbyCamera {
	ObjectProperty m_ViewTarget; // 0x420
	TArray<ObjectProperty> m_FriendlyTargets; // 0x428
	TArray<ObjectProperty> m_EnemyTargets; // 0x438
	FVector m_RenderCenterPointOffset; // 0x448
	char m_bActive : 1; // 0x454
	char m_bAdjustCameraToTarget : 1; // 0x454
	char m_bFirstCameraEyeCheck : 1; // 0x454
	int32_t m_nPosition; // 0x458
	float m_fRemainingTweenTime; // 0x45c
	float m_fTotalTweenTime; // 0x460
	FTPOV m_TweenSourcePOV; // 0x464
	float m_fLateralOffsetMultiplier; // 0x488
	float m_fHorizontalOffsetMultiplier; // 0x48c
	float m_fViewLateralOffsetMultiplier; // 0x490
	float m_fViewHorizontalOffsetMultiplier; // 0x494
	float m_fMaxAdjustSpeedTranslation; // 0x498
	float m_fMaxAdjustSpeedRotation; // 0x49c
	FVector m_vViewOffset; // 0x4a0
	float m_fFirstCameraEyeCheckTimestamp; // 0x4ac
	ELobbyCameraTag m_CameraTag; // 0x4b0
};

struct UUIComponent_ItemRadialMenuBase {
	int32_t m_nSlot; // 0x120
	ObjectProperty m_mcSubEntry; // 0x124
	ObjectProperty m_mcTF; // 0x12c
	ObjectProperty m_mcItem; // 0x134
	ObjectProperty m_mcItemIcon; // 0x13c
	ObjectProperty m_mcHighlight; // 0x144
	ObjectProperty m_mcDisabledBG; // 0x14c
	ObjectProperty m_pFrameButton; // 0x154
	ObjectProperty m_akSliceSelect; // 0x15c
};

struct AKActor {
	char bDamageAppliesImpulse : 1; // 0x2d0
	char bWakeOnLevelStart : 1; // 0x2d0
	char bCurrentSlide : 1; // 0x2d0
	char bSlideActive : 1; // 0x2d0
	char bEnableStayUprightSpring : 1; // 0x2d0
	char bLimitMaxPhysicsVelocity : 1; // 0x2d0
	char bNeedsRBStateReplication : 1; // 0x2d0
	char bDisableClientSidePawnInteractions : 1; // 0x2d0
	char TgApplyHitImpulse : 0; // 0x2d0
	char TgApplyTouchImpulse : 0; // 0x2d0
	ComponentProperty ImpactEffectComponent; // 0x2d4
	ComponentProperty ImpactSoundComponent; // 0x2dc
	ComponentProperty ImpactSoundComponent2; // 0x2e4
	float LastImpactTime; // 0x2ec
	FPhysEffectInfo ImpactEffectInfo; // 0x2f0
	ComponentProperty SlideEffectComponent; // 0x308
	ComponentProperty SlideSoundComponent; // 0x310
	float LastSlideTime; // 0x318
	FPhysEffectInfo SlideEffectInfo; // 0x31c
	float StayUprightTorqueFactor; // 0x334
	float StayUprightMaxTorque; // 0x338
	float MaxPhysicsVelocity; // 0x33c
	FRigidBodyState RBState; // 0x340
	float AngErrorAccumulator; // 0x380
	FVector ReplicatedDrawScale3D; // 0x384
	FVector InitialLocation; // 0x390
	FRotator InitialRotation; // 0x39c
	float TgTouchMagnitude; // 0x3a8
	ObjectProperty TgTouchSound; // 0x3ac
};

struct UPhysicalMaterial {
	int32_t MaterialIndex; // 0x60
	float Friction; // 0x64
	float Restitution; // 0x68
	char bForceConeFriction : 1; // 0x6c
	char bEnableAnisotropicFriction : 1; // 0x6c
	FVector AnisoFrictionDir; // 0x70
	float FrictionV; // 0x7c
	float Density; // 0x80
	float AngularDamping; // 0x84
	float LinearDamping; // 0x88
	float MagneticResponse; // 0x8c
	float WindResponse; // 0x90
	float ImpactThreshold; // 0x94
	float ImpactReFireDelay; // 0x98
	ObjectProperty ImpactEffect; // 0x9c
	ObjectProperty ImpactSound; // 0xa4
	ObjectProperty DeviceImpactSound; // 0xac
	float SlideThreshold; // 0xb4
	float SlideReFireDelay; // 0xb8
	ObjectProperty SlideEffect; // 0xbc
	ObjectProperty SlideSound; // 0xc4
	ObjectProperty FractureSoundExplosion; // 0xcc
	ObjectProperty FractureSoundSingle; // 0xd4
	FName MaterialTypeName; // 0xdc
	ObjectProperty FootstepParticleSystem; // 0xe4
	ObjectProperty Parent; // 0xec
	ObjectProperty PhysicalMaterialProperty; // 0xf4
};

struct ATgDeploy_Transporter {
	FVector m_StartLocation; // 0x448
	FVector m_ProjectileEndLocation; // 0x454
	float m_fProjectileHeight; // 0x460
	ObjectProperty m_DeploymentFX; // 0x464
	FVector r_TeleportLocation; // 0x46c
};

struct UUIInteractable_Button_Price {
	ObjectProperty m_mcPrices[0x3]; // 0x140
	FString m_sPriceLoadNames[0x3]; // 0x158
	int32_t m_nPriceIndex; // 0x188
};

struct ATgDeploy_HealthNugget {
	char m_bRenderAsActive : 1; // 0x448
	char m_bIsActiveRendered : 1; // 0x448
	char m_bCountTowardsHealingStats : 1; // 0x448
	ObjectProperty c_HelpTipActor; // 0x44c
	float m_fHealOverride; // 0x454
	float m_fHoTOverride; // 0x458
	TArray<ObjectProperty> m_PendingTouches; // 0x45c
};

struct UParticleModuleAttractorPoint {
	FRawDistributionVector Position; // 0x68
	FRawDistributionFloat Range; // 0x8c
	FRawDistributionFloat Strength; // 0xb0
	char StrengthByDistance : 1; // 0xd4
	char bAffectBaseVelocity : 1; // 0xd4
	char bOverrideVelocity : 1; // 0xd4
	char bUseWorldSpacePosition : 1; // 0xd4
};

struct UMaterialExpressionClamp {
	FExpressionInput Input; // 0xb0
	FExpressionInput Min; // 0xe4
	FExpressionInput Max; // 0x118
};

struct ULevelStreamingAlwaysLoaded {
	char bIsProceduralBuildingLODLevel : 1; // 0x100
};

struct UTgSeqAct_DisplayTooltip {
	int32_t m_nMessageId; // 0x108
	char m_bLeftPlacement : 1; // 0x10c
};

struct UUIDataChatManager {
	char m_bSentReplyHelp : 1; // 0x70
	char m_bLoadedEOMLobby : 1; // 0x70
	TArray<FChannelChatData> m_AllChatData; // 0x74
	TArray<FString> m_ReplyTargets; // 0x84
};

struct UMaterialExpressionConstantBiasScale {
	FExpressionInput Input; // 0xb0
	float Bias; // 0xe4
	float Scale; // 0xe8
};

struct UUIComponent_PartyLobbyPlayer {
	int32_t m_nDisplaySlot; // 0x120
	int32_t m_nTickCallbackHandle; // 0x124
	float m_fDeclinedInviteTimer; // 0x128
	char m_bPlayerReady : 1; // 0x12c
	char m_bPromptsShown : 1; // 0x12c
	char m_bPreviewingEmoteWheel : 1; // 0x12c
	char m_bOldPlayerMutedState : 1; // 0x12c
	char m_bShouldRefreshPreview : 1; // 0x12c
	UIPARTYLOBBY_PLAYER_STATE m_eState; // 0x130
	ObjectProperty m_pPreviewItem; // 0x134
	ObjectProperty m_pOverrideSkin; // 0x13c
	ObjectProperty m_mcPlayer; // 0x144
	ObjectProperty m_mcPlayerName; // 0x14c
	ObjectProperty m_mcPlayerTitle; // 0x154
	ObjectProperty m_mcPlayerStatus; // 0x15c
	ObjectProperty m_mcPlayerPrompt[0x2]; // 0x164
	ObjectProperty m_mcPlayerPromptKey[0x2]; // 0x174
	ObjectProperty m_mcPlayerPromptButton[0x2]; // 0x184
	ObjectProperty m_mcPlayerPromptText[0x2]; // 0x194
	ObjectProperty m_mcPlayerClassIcon; // 0x1a4
	ObjectProperty m_mcPlayerStateIcon; // 0x1ac
	ObjectProperty m_mcPlayerBackground; // 0x1b4
	ObjectProperty m_mcPlayerTooltip; // 0x1bc
	ObjectProperty m_mcPlayerTooltipText; // 0x1c4
	ObjectProperty m_mcPlayerTooltipPrompt; // 0x1cc
	ObjectProperty m_mcPlayerSpeakIcon; // 0x1d4
	ObjectProperty m_pPlayerAvatar; // 0x1dc
	ObjectProperty m_pAddButton; // 0x1e4
	ObjectProperty m_pFrameButton; // 0x1ec
	ObjectProperty m_pCrossplayIcon; // 0x1f4
};

struct UTgAnimBlendByPhysics {
	int32_t PhysicsMap[0xe]; // 0x168
	int32_t LastPhysics; // 0x1a0
};

struct ATgDeploy_PoppyBomb {
	char r_bDetonated : 1; // 0x448
	ObjectProperty m_CachedPlayer; // 0x44c
	FVector r_HitNormal; // 0x454
	float m_fCachedCollisionRadius; // 0x460
	float m_fCachedCollisionHeight; // 0x464
	FRotator r_StuckRotation; // 0x468
	FVector r_CartOffset; // 0x474
};

struct ATgDevice_BurstRifle {
	float m_fQueueFireTime; // 0xaec
	float m_fQueueFireTimeThreshold; // 0xaf0
};

struct UTgAIBehaviorCondition_ManaPercent {
	float ManaPct; // 0x98
};

struct USceneCapture2DHitMaskComponent {
	ObjectProperty TextureTarget; // 0xd0
	ComponentProperty SkeletalMeshComp; // 0xd8
	int32_t MaterialIndex; // 0xe0
	int32_t ForceLOD; // 0xe4
	int32_t HitMaskCullDistance; // 0xe8
	float FadingStartTimeSinceHit; // 0xec
	float FadingPercentage; // 0xf0
	float FadingDurationTime; // 0xf4
	float FadingIntervalTime; // 0xf8
};

struct UTgInventoryObject_Listen_AuraMod {
	TArray<ObjectProperty> m_AffectedActors; // 0xc8
	char m_bAuraIsActive : 1; // 0xd8
	ObjectProperty m_CachedAuraDevice; // 0xdc
};

struct UTgAIBehaviorAction_MoveToRallyPoint {
	ESelectionArbitrator ArbitratorOnMultipleValid; // 0x9c
	char bMustBeSameLane : 1; // 0xa0
};

struct UUIComponent_RatingInteractable {
	ObjectProperty m_mcRatingIcon; // 0x140
};

struct USeqAct_SetVectorComponents {
	FVector OutVector; // 0x108
	float X; // 0x114
	float Y; // 0x118
	float Z; // 0x11c
};

struct ATgDeploy_Rune {
	int32_t r_nRunes[0x3]; // 0x4e0
};

struct UDynamicLightEnvironmentComponent {
	FPointer State; // 0xa8
	float InvisibleUpdateTime; // 0xb0
	float MinTimeBetweenFullUpdates; // 0xb4
	float VelocityUpdateTimeScale; // 0xb8
	float ShadowInterpolationSpeed; // 0xbc
	int32_t NumVolumeVisibilitySamples; // 0xc0
	float LightingBoundsScale; // 0xc4
	FLinearColor AmbientShadowColor; // 0xc8
	FVector AmbientShadowSourceDirection; // 0xd8
	FLinearColor AmbientGlow; // 0xe4
	float LightDistance; // 0xf4
	float ShadowDistance; // 0xf8
	char bCastShadows : 1; // 0xfc
	char bCompositeShadowsFromDynamicLights : 1; // 0xfc
	char bForceCompositeAllLights : 1; // 0xfc
	char bAffectedBySmallDynamicLights : 1; // 0xfc
	char bUseBooleanEnvironmentShadowing : 1; // 0xfc
	char bShadowFromEnvironment : 1; // 0xfc
	char bDynamic : 1; // 0xfc
	char bSynthesizeDirectionalLight : 1; // 0xfc
	char bSynthesizeSHLight : 0; // 0xfc
	char bRequiresNonLatentUpdates : 0; // 0xfc
	char bTraceFromClosestBoundsPoint : 0; // 0xfc
	char bIsCharacterLightEnvironment : 0; // 0xfc
	char bOverrideOwnerLightingChannels : 0; // 0xfc
	char bAlwaysInfluencedByDominantDirectionalLight : 0; // 0xfc
	float ModShadowFadeoutTime; // 0x100
	float ModShadowFadeoutExponent; // 0x104
	FLinearColor MaxModulatedShadowColor; // 0x108
	float DominantShadowTransitionStartDistance; // 0x118
	float DominantShadowTransitionEndDistance; // 0x11c
	float MinShadowAngle; // 0x120
	EDynamicLightEnvironmentBoundsMethod BoundsMethod; // 0x124
	FBoxSphereBounds OverriddenBounds; // 0x128
	FLightingChannelContainer OverriddenLightingChannels; // 0x144
	TArray<ComponentProperty> OverriddenLightComponents; // 0x148
};

struct UTgInventoryObject_Listen_HitWithPetDevice {
	char m_bSkipActiveCheck : 1; // 0xd0
	char m_bSkipStartCooldown : 1; // 0xd0
};

struct UMaterialExpressionConstant3Vector {
	float R; // 0xb0
	float G; // 0xb4
	float B; // 0xb8
};

struct UInterpTrackFaceFX {
	TArray<ObjectProperty> FaceFXAnimSets; // 0xa0
	TArray<FFaceFXTrackKey> FaceFXSeqs; // 0xb0
	ObjectProperty CachedActorFXAsset; // 0xc0
	TArray<FFaceFXSoundCueKey> FaceFXSoundCueKeys; // 0xc8
};

struct UUIComponent_PartyLobbyCustomPanel {
	TArray<ObjectProperty> m_CustomPlayersArray; // 0x120
	TMap<None, None> m_CustomPlayers; // 0x130
	ObjectProperty m_pCustomGame; // 0x178
	ObjectProperty m_pList; // 0x180
	ObjectProperty m_mcName; // 0x188
	ObjectProperty m_mcPlayerCount; // 0x190
	float m_fSpectatorUpdateTimer; // 0x198
	float m_fSpectatorUpdateRate; // 0x19c
};

struct UUIComponent_RankedProgress {
	ObjectProperty m_mcName; // 0x120
	ObjectProperty m_mcRank; // 0x128
	ObjectProperty m_mcWins; // 0x130
	ObjectProperty m_mcLosses; // 0x138
	ObjectProperty m_mcTier; // 0x140
	ObjectProperty m_mcTPLabel; // 0x148
	ObjectProperty m_mcTP; // 0x150
	ObjectProperty m_pProgress; // 0x158
};

struct UTgDataGroup_Game {
	ObjectProperty m_PlayerData; // 0x16c
	ObjectProperty m_TargetData; // 0x174
	ObjectProperty m_PlayerVitals; // 0x17c
	ObjectProperty m_GameData; // 0x184
	ObjectProperty m_DevicesData; // 0x18c
	ObjectProperty m_EffectData; // 0x194
};

struct UParticleModuleTypeDataPhysX {
	ObjectProperty PhysXParSys; // 0x68
	FPhysXEmitterVerticalLodProperties VerticalLod; // 0x70
};

struct ATgDoorMarker {
	DoorStatus r_eStatus; // 0x29c
	DoorStatus m_eInitStatus; // 0x29d
	ObjectProperty s_CollisionProxy; // 0x2a0
	float m_fProximity; // 0x2a8
	int32_t m_nTeamThatControlsDoor; // 0x2ac
	int32_t m_nMeshAssemblyId; // 0x2b0
	ComponentProperty m_DoorSMC; // 0x2b4
};

struct USeqAct_SetMaterial {
	ObjectProperty NewMaterial; // 0x108
	int32_t MaterialIndex; // 0x110
};

struct APlayerController {
	ObjectProperty Player; // 0x470
	ObjectProperty PlayerCamera; // 0x478
	ACamera* CameraClass; // 0x480
	char bFrozen : 1; // 0x488
	char bPressedJump : 1; // 0x488
	char bDoubleJump : 1; // 0x488
	char bUpdatePosition : 1; // 0x488
	char bUpdating : 1; // 0x488
	char bNeverSwitchOnPickup : 1; // 0x488
	char bCheatFlying : 1; // 0x488
	char bCameraPositionLocked : 1; // 0x488
	char bShortConnectTimeOut : 0; // 0x488
	char bPendingDestroy : 0; // 0x488
	char bWasSpeedHack : 0; // 0x488
	char bWasSaturated : 0; // 0x488
	char bAimingHelp : 0; // 0x488
	char bCameraCut : 0; // 0x488
	char bClientSimulatingViewTarget : 0; // 0x488
	char bHasVoiceHandshakeCompleted : 0; // 0x488
	char bCanPlayOnline : 0; // 0x488
	char bCanShareUserCreatedContent : 0; // 0x488
	char bCanCommunicateVoice : 0; // 0x488
	char bPrivilegesInitialized : 0; // 0x488
	char bCinematicMode : 0; // 0x488
	char bInteractiveMode : 0; // 0x488
	char bCinemaDisableInputMove : 0; // 0x488
	char bCinemaDisableInputLook : 0; // 0x488
	char bRenderHUDFullScreen : 0; // 0x488
	char bIgnoreNetworkMessages : 0; // 0x488
	char bShowKismetDrawText : 0; // 0x488
	char bAcceptSendCorrections : 0; // 0x488
	char bReplicateAllPawns : 0; // 0x488
	char bIsUsingStreamingVolumes : 0; // 0x488
	char bIsExternalUIOpen : 0; // 0x488
	char bIsControllerConnected : 0; // 0x488
	char bCheckSoundOcclusion : 1; // 0x48c
	char bDebugCameraAnims : 1; // 0x48c
	char bBlockCameraAnimsFromOverridingPostProcess : 1; // 0x48c
	char bLogHearSoundOverflow : 1; // 0x48c
	char bShowMoveErrors : 1; // 0x48c
	char bCheckRelevancyThroughPortals : 1; // 0x48c
	char bDebugClientAdjustPosition : 1; // 0x48c
	char bIsInTimelapse : 1; // 0x48c
	char bIsTimelapsePlayOfTheGame : 0; // 0x48c
	float MaxResponseTime; // 0x490
	float WaitDelay; // 0x494
	ObjectProperty AcknowledgedPawn; // 0x498
	EDoubleClickDir DoubleClickDir; // 0x4a0
	char bIgnoreMoveInput; // 0x4a1
	char bIgnoreLookInput; // 0x4a2
	char bRun; // 0x4a3
	char bDuck; // 0x4a4
	char NetPlayerIndex; // 0x4a5
	ObjectProperty ViewTarget; // 0x4a8
	ObjectProperty RealViewTarget; // 0x4b0
	ObjectProperty ControllingDirTrackInst; // 0x4b8
	float FOVAngle; // 0x4c0
	float DesiredFOV; // 0x4c4
	float DefaultFOV; // 0x4c8
	float LODDistanceFactor; // 0x4cc
	FRotator TargetViewRotation; // 0x4d0
	float TargetEyeHeight; // 0x4dc
	FRotator BlendedTargetViewRotation; // 0x4e0
	ObjectProperty myHUD; // 0x4ec
	ObjectProperty mySecondaryHUD; // 0x4f4
	USavedMove* SavedMoveClass; // 0x4fc
	ObjectProperty SavedMoves; // 0x504
	ObjectProperty FreeMoves; // 0x50c
	ObjectProperty PendingMove; // 0x514
	FVector LastAckedAccel; // 0x51c
	float CurrentTimeStamp; // 0x528
	float LastUpdateTime; // 0x52c
	float ServerTimeStamp; // 0x530
	float TimeMargin; // 0x534
	float ClientUpdateTime; // 0x538
	float MaxTimeMargin; // 0x53c
	float LastActiveTime; // 0x540
	int32_t ClientCap; // 0x544
	float DynamicPingThreshold; // 0x548
	float LastPingUpdate; // 0x54c
	float LastSpeedHackLog; // 0x550
	FClientAdjustment PendingAdjustment; // 0x554
	int32_t GroundPitch; // 0x58c
	ObjectProperty CheatManager; // 0x590
	UCheatManager* CheatClass; // 0x598
	ObjectProperty PlayerInput; // 0x5a0
	UPlayerInput* InputClass; // 0x5a8
	FVector FailedPathStart; // 0x5b0
	ComponentProperty CylinderComponent; // 0x5bc
	FString ForceFeedbackManagerClassName; // 0x5c4
	ObjectProperty ForceFeedbackManager; // 0x5d4
	TArray<ObjectProperty> Interactions; // 0x5dc
	TArray<FUniqueNetId> VoiceMuteList; // 0x5ec
	TArray<FUniqueNetId> GameplayVoiceMuteList; // 0x5fc
	TArray<FUniqueNetId> VoicePacketFilter; // 0x60c
	TArray<FConnectedPeerInfo> ConnectedPeers; // 0x61c
	TArray<FUniqueNetId> BestNextHostPeers; // 0x62c
	ObjectProperty MigratedSearchToJoin; // 0x63c
	ObjectProperty OnlineSub; // 0x644
	TScriptInterface<Class> VoiceInterface; // 0x64c
	ObjectProperty OnlinePlayerData; // 0x65c
	float InteractDistance; // 0x664
	FName DelayedJoinSessionName; // 0x668
	TArray<FInputMatchRequest> InputRequests; // 0x670
	float LastBroadcastTime; // 0x680
	FString LastBroadcastString[0x4]; // 0x684
	TArray<FName> PendingMapChangeLevelNames; // 0x6c4
	ObjectProperty MyCoverReplicator; // 0x6d4
	TArray<FDebugTextInfo> DebugTextList; // 0x6dc
	float SpectatorCameraSpeed; // 0x6ec
	ObjectProperty PendingSwapConnection; // 0x6f0
	float MinRespawnDelay; // 0x6f8
	int32_t MaxConcurrentHearSounds; // 0x6fc
	TArray<ComponentProperty> HearSoundActiveComponents; // 0x700
	TArray<ComponentProperty> HearSoundPoolComponents; // 0x710
	TArray<ObjectProperty> HiddenActors; // 0x720
	float m_RigidBodyMaxPositionErrorThreshold; // 0x730
	float LastSpectatorStateSynchTime; // 0x734
	FColor CurrentUpdateDebugColor; // 0x738
	DelegateProperty __OnMissingPeersUnregistered__Delegate; // 0x73c
	DelegateProperty __CanUnpause__Delegate; // 0x74c
	DelegateProperty __InputMatchDelegate__Delegate; // 0x75c
};

struct ADynamicPylon {
	char bMoving : 1; // 0x490
};

struct UPath_WithinDistanceEnvelope {
	float MaxDistance; // 0x6c
	float MinDistance; // 0x70
	char bSoft : 1; // 0x74
	char bOnlyThrowOutNodesThatLeaveEnvelope : 1; // 0x74
	float SoftStartPenalty; // 0x78
	FVector EnvelopeTestPoint; // 0x7c
};

struct UAnimNotify_ForceField {
	ComponentProperty ForceFieldComponent; // 0x68
	char bAttach : 1; // 0x70
	FName SocketName; // 0x74
	FName BoneName; // 0x7c
};

struct USkelControlSpline {
	int32_t SplineLength; // 0xd0
	EAxis SplineBoneAxis; // 0xd4
	ESplineControlRotMode BoneRotMode; // 0xd5
	char bInvertSplineBoneAxis : 1; // 0xd8
	float EndSplineTension; // 0xdc
	float StartSplineTension; // 0xe0
};

struct ADynamicTriggerVolume {
	char bEnabled : 1; // 0x2bc
};

struct UMcpGroupsBase {
	FString McpGroupsManagerClassName; // 0x78
	TArray<FMcpGroupList> GroupLists; // 0x88
	DelegateProperty __OnCreateGroupComplete__Delegate; // 0x98
	DelegateProperty __OnDeleteGroupComplete__Delegate; // 0xa8
	DelegateProperty __OnQueryGroupsComplete__Delegate; // 0xb8
	DelegateProperty __OnQueryGroupMembersComplete__Delegate; // 0xc8
	DelegateProperty __OnAddGroupMembersComplete__Delegate; // 0xd8
	DelegateProperty __OnRemoveGroupMembersComplete__Delegate; // 0xe8
	DelegateProperty __OnDeleteAllGroupsComplete__Delegate; // 0xf8
	DelegateProperty __OnQueryGroupInvitesComplete__Delegate; // 0x108
	DelegateProperty __OnAcceptGroupInviteComplete__Delegate; // 0x118
};

struct UPComImageDownloader {
	TArray<FPComImageDownload> DownloadImages; // 0x60
	DelegateProperty __OnPComImageDownloaded__Delegate; // 0x70
};

struct ATgDeployableFactory_DeviceChest {
	TArray<int32_t> m_nDeviceIds; // 0x2dc
};

struct UPath_MinDistBetweenSpecsOfType {
	float MinDistBetweenSpecTypes; // 0x6c
	FVector InitLocation; // 0x70
	UReachSpec* ReachSpecClass; // 0x7c
};

struct UTgAnimTurnInPlace {
	char bInitialized : 1; // 0x124
	char bRootRotInitialized : 1; // 0x124
	char m_bDisableRotation : 1; // 0x124
	char bDelayBlendOutToPlayAnim : 1; // 0x124
	char bPlayingTurnTransition : 1; // 0x124
	char m_bCanChooseNewTransition : 1; // 0x124
	char m_bOverrideInterpolationTime : 1; // 0x124
	char m_bMirrorOffsetWhenPawnMirrored : 1; // 0x124
	char m_bAlwaysUpdateYawOffset : 0; // 0x124
	char m_bIgnoreTransitionAnimations : 0; // 0x124
	char m_bOnlyUpdateRotationWhenMoving : 0; // 0x124
	char m_bTurnTowardsVelocity : 0; // 0x124
	char m_bUsePawnRotationAtZeroVelocity : 0; // 0x124
	char m_bUse180ShortestRoute : 0; // 0x124
	char m_bConstrictIdleYawOffset : 0; // 0x124
	char m_bDisableAllTurning : 0; // 0x124
	char m_bJustBecameRelevant : 0; // 0x124
	int32_t LastPawnYaw; // 0x128
	int32_t LastPawnPitch; // 0x12c
	float PawnRotationRate; // 0x130
	int32_t LastRootBoneYaw; // 0x134
	int32_t YawOffset; // 0x138
	int32_t PitchOffset; // 0x13c
	float RelativeOffset; // 0x140
	ObjectProperty m_TgPawn; // 0x144
	TArray<ObjectProperty> OffsetNodes2; // 0x14c
	TArray<FRotTransitionInfo> RotTransitions; // 0x15c
	float TransitionBlendTime; // 0x16c
	int32_t CurrentTransitionIndex; // 0x170
	float TransitionThresholdAngle; // 0x174
	ForcedTransitionAngle m_ForcedTransitionAngle; // 0x178
	float m_fChooseNewTransitionPercent; // 0x17c
	float m_fInterpolationTime; // 0x180
	float m_RemainingInterpolationTime; // 0x184
	TArray<ObjectProperty> PlayerNodes; // 0x188
	float m_fIgnoredTransitionTime; // 0x198
	float m_fTurnInterpTime; // 0x19c
	FRotator m_InterpRotation; // 0x1a0
};

struct UTgData_Notifications {
	TArray<FNotification> m_Notifications; // 0xbc
};

struct UTgAIBehaviorCondition_CombatTargetHasEffectCategory {
	char bEffectGroupCategoryCheckInstigator : 1; // 0x98
	int32_t EffectCategoryId; // 0x9c
	int32_t EffectGroupId; // 0xa0
};

struct UUIComponent_PopupManager {
	TArray<FSceneData> m_PopupStack; // 0x118
	int32_t m_nCloseCurrentPopupHandle; // 0x128
	char m_bAllowPopups : 1; // 0x12c
};

struct UInterpTrackInstFloatMaterialParam {
	TArray<FFloatMaterialParamMICData> MICInfos; // 0x60
	ObjectProperty InstancedTrack; // 0x70
};

struct USequenceAction {
	FName HandlerName; // 0xec
	char bCallHandler : 1; // 0xf4
	TArray<ObjectProperty> Targets; // 0xf8
};

struct UUILandingPanelManager {
	FPointer VfTable_ITgCallbackInterface; // 0x84
	ObjectProperty m_pMovie; // 0x8c
	TMap<None, None> m_JsonDiscountData; // 0x94
	ObjectProperty m_CallbackContainer; // 0xdc
};

struct UUIComponent_LeagueTierEntry {
	ObjectProperty m_mcTitle; // 0x120
	ObjectProperty m_mcSubtitle; // 0x128
	ObjectProperty m_mcIcon; // 0x130
	TArray<ObjectProperty> m_mcLegendIcons; // 0x138
};

struct UConsole {
	ObjectProperty ConsoleTargetPlayer; // 0xb0
	ObjectProperty DefaultTexture_Black; // 0xb8
	ObjectProperty DefaultTexture_White; // 0xc0
	FName ConsoleKey; // 0xc8
	FName TypeKey; // 0xd0
	int32_t MaxScrollbackSize; // 0xd8
	TArray<FString> Scrollback; // 0xdc
	int32_t SBHead; // 0xec
	int32_t SBPos; // 0xf0
	int32_t HistoryTop; // 0xf4
	int32_t HistoryBot; // 0xf8
	int32_t HistoryCur; // 0xfc
	FString History[0x10]; // 0x100
	char bNavigatingHistory : 1; // 0x200
	char bCaptureKeyInput : 1; // 0x200
	char bCtrl : 1; // 0x200
	char bEnableUI : 1; // 0x200
	char bAutoCompleteLocked : 1; // 0x200
	char bRequireCtrlToNavigateAutoComplete : 1; // 0x200
	char bIsRuntimeAutoCompleteUpToDate : 1; // 0x200
	FString TypedStr; // 0x204
	int32_t TypedStrPos; // 0x214
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x218
	TArray<FAutoCompleteCommand> AutoCompleteList; // 0x228
	int32_t AutoCompleteIndex; // 0x238
	FAutoCompleteNode AutoCompleteTree; // 0x23c
	TArray<int32_t> AutoCompleteIndices; // 0x260
};

struct UTgAIBehaviorCondition_ArmorPercent {
	float ArmorPct; // 0x98
};

struct USlotToSlotReachSpec {
	char SpecDirection; // 0xc8
};

struct UTgInventoryObject_Listen_LoogieExplodedHit {
	char m_bNeedToApplyCooldown : 1; // 0xd0
};

struct UTgHeadShotComponent {
	ComponentProperty m_SkelComp; // 0x25c
	FName m_HeadBone; // 0x264
	FVector m_vHeadOffset; // 0x26c
};

struct UTgAIBehaviorObject {
	int32_t NodeToken; // 0x60
};

struct UUIComponent_DeviceDetailsStat {
	ObjectProperty m_mcTF; // 0x120
	ObjectProperty m_mcBar; // 0x128
};

struct UNavMeshGoalFilter_NotNearOtherAI {
	float DistanceToCheck; // 0x6c
};

struct UTgAnimNodeTriggerCameraAnim {
	ObjectProperty CameraAnim; // 0x114
	float fBlendInTime; // 0x11c
	float fBlendOutTime; // 0x120
	char bLoopAnimation : 1; // 0x124
	char bBlendInOnBecomeRelevant : 1; // 0x124
	char bBlendInOnReplayAnim : 1; // 0x124
	char bBlendOutOnStopFire : 1; // 0x124
	char bPlayAnimInLocalSpace : 1; // 0x124
	TG_EQUIP_POINT m_StopFireEquipSlotTarget; // 0x128
	ObjectProperty CameraAnimInst; // 0x12c
};

struct USeqVar_Player {
	TArray<ObjectProperty> Players; // 0xc4
	char bAllPlayers : 1; // 0xd4
	int32_t PlayerIdx; // 0xd8
};

struct ATgDeployableFactory {
	int32_t nCurrentCount; // 0x2c0
	float s_fLastSpawnTime; // 0x2c4
	char s_bSpawnOnce : 1; // 0x2c8
	char bForcePreventDisenchant : 1; // 0x2c8
	int32_t s_nDeployableId; // 0x2cc
	int32_t s_SpawnGroupNum; // 0x2d0
	int32_t nShardCost; // 0x2d4
	float s_fDeployableLifeSpan; // 0x2d8
};

struct UUIDataLeagueManager {
	TArray<ObjectProperty> m_LeagueArray; // 0x70
	TMap<None, None> m_Leagues; // 0x80
	ObjectProperty m_EOM; // 0xc8
	ObjectProperty m_TierChange; // 0xd0
};

struct USeqAct_PlayCameraAnim {
	ObjectProperty CameraAnim; // 0x108
	char bLoop : 1; // 0x110
	char bRandomStartTime : 1; // 0x110
	float BlendInTime; // 0x114
	float BlendOutTime; // 0x118
	float Rate; // 0x11c
	float IntensityScale; // 0x120
	ECameraAnimPlaySpace PlaySpace; // 0x124
	ObjectProperty UserDefinedSpaceActor; // 0x128
};

struct UTgTargetAimTrackingCurves {
	FName SettingsName; // 0x60
	FRawDistributionFloat StrengthByAccuracyX; // 0x68
	FRawDistributionFloat StrengthByDesiredAngleX; // 0x8c
	FRawDistributionFloat StrengthByAccuracyY; // 0xb0
	FRawDistributionFloat StrengthByDesiredAngleY; // 0xd4
};

struct ATgDevice_AndroxusInhand {
	int32_t m_nAndroLeg2StackCount; // 0xaec
	float m_fQueueFireTime; // 0xaf0
	float m_fQueueFireTimeThreshold; // 0xaf4
};

struct UInterpTrackInstFaceFX {
	char bFirstUpdate : 1; // 0x60
	float LastUpdatePosition; // 0x64
};

struct UUIDataProvider_OnlinePlayerStorageArray {
	ObjectProperty PlayerStorage; // 0x70
	int32_t PlayerStorageId; // 0x78
	FString ColumnHeaderText; // 0x7c
	TArray<FName> Values; // 0x8c
};

struct UTgAIBehaviorAction_MoveToAvoidableProjectile {
	char bMustBeEnemy : 1; // 0x9c
	char bIgnoreInsideCollision : 1; // 0x9c
	char bMoveAway : 1; // 0x9c
};

struct UUIComponent_OwnershipProgress {
	ObjectProperty m_mcTitle; // 0x120
	ObjectProperty m_mcOwnedAmt; // 0x128
	ObjectProperty m_mcTotalAmt; // 0x130
	ObjectProperty m_mcProgress; // 0x138
};

struct UMcpClashMobBase {
	FString McpClashMobClassName; // 0x78
	DelegateProperty __OnQueryChallengeListComplete__Delegate; // 0x88
	DelegateProperty __OnDownloadChallengeFileComplete__Delegate; // 0x98
	DelegateProperty __OnAcceptChallengeComplete__Delegate; // 0xa8
	DelegateProperty __OnQueryChallengeUserStatusComplete__Delegate; // 0xb8
	DelegateProperty __OnUpdateChallengeUserProgressComplete__Delegate; // 0xc8
	DelegateProperty __OnUpdateChallengeUserRewardComplete__Delegate; // 0xd8
};

struct UTgAnimNodeFidget {
	float m_SelectedIdleTimeBeforeFidgeting; // 0x144
	float m_CurrentIdleTime; // 0x148
	float BlendToFidgetDuration; // 0x14c
	float BlendFromFidgetDuration; // 0x150
	EFidgetType FidgetType; // 0x154
	float MinimumIdleTimeBeforeFidgeting; // 0x158
	float MaximumIdleTimeBeforeFidgeting; // 0x15c
	char AllowIdleAnimToComplete : 1; // 0x160
	float ChanceToFidgetWhenIdleCompletes; // 0x164
};

struct UUIData_TreasureRoll {
	ObjectProperty m_pChestItem; // 0x60
	Fdword m_dwRollDelay; // 0x68
	TArray<ObjectProperty> m_pRolledItems; // 0x6c
};

struct UTgSeqAct_SetPlayerLevel {
	int32_t m_nLevel; // 0x108
};

struct UTgAnimNodeBlendByMeleeIdle {
	ObjectProperty m_TgPawn; // 0x168
};

struct ATgSpawnTeleporterExit {
	int32_t nTaskForce; // 0x280
	int32_t nLane; // 0x284
	int32_t nGamePhase; // 0x288
	int32_t nPriority; // 0x28c
	char bEnabled : 1; // 0x290
};

struct UTgAIBehaviorComposite_SubTree {
	ObjectProperty ChildTree; // 0xb8
};

struct UOnlineTitleFileDownloadMcp {
	TArray<FTitleFileMcp> TitleFiles; // 0x104
	int32_t DownloadCount; // 0x114
};

struct UTgAIBehaviorCondition_NearbyAllyAttacked {
	float TimeThreshold; // 0x98
	float AllyDistanceThreshold; // 0x9c
	float AttackerDistanceThreshold; // 0xa0
};

struct USeqAct_ConvertToString {
	char bIncludeVarComment : 1; // 0x108
	FString VarSeparator; // 0x10c
	int32_t NumberOfInputs; // 0x11c
};

struct UTgGameplayCurvesSet_Recoil {
	TArray<ObjectProperty> HorizRecoil; // 0x64
	TArray<ObjectProperty> VertRecoil; // 0x74
	EPaladinsRecoilType RecoilType; // 0x84
};

struct UTgAIUtilityFilter_DistanceFromPawn {
	float DistanceCutoff; // 0xc0
	char bInverse : 1; // 0xc4
};

struct UUIDataProvider_MenuItem {
	EMenuOptionType OptionType; // 0x94
	TArray<FName> OptionSet; // 0x98
	FString DataStoreMarkup; // 0xa8
	FString DescriptionMarkup; // 0xb8
	FName RequiredGameMode; // 0xc8
	FString FriendlyName; // 0xd0
	FString CustomFriendlyName; // 0xe0
	FString Description; // 0xf0
	char bEditableCombo : 1; // 0x100
	char bNumericCombo : 1; // 0x100
	char bKeyboardOrMouseOption : 1; // 0x100
	char bOnlineOnly : 1; // 0x100
	char bOfflineOnly : 1; // 0x100
	char bSearchAllInis : 1; // 0x100
	char bRemoveOn360 : 1; // 0x100
	char bRemoveOnPC : 1; // 0x100
	char bRemoveOnPS3 : 0; // 0x100
	char bRemoveOnDingo : 0; // 0x100
	int32_t EditBoxMaxLength; // 0x104
	FUIRangeData RangeData; // 0x108
	TArray<FName> SchemaCellFields; // 0x11c
	FString IniName; // 0x12c
};

struct UNavMeshGoalFilter_MinPathDistance {
	int32_t MinDistancePathShouldBe; // 0x6c
};

struct AWebServer {
	FString ServerName; // 0x2e4
	FString Applications[0xa]; // 0x2f4
	FString ApplicationPaths[0xa]; // 0x394
	char bEnabled : 1; // 0x434
	int32_t ListenPort; // 0x438
	int32_t MaxConnections; // 0x43c
	int32_t DefaultApplication; // 0x440
	int32_t ExpirationSeconds; // 0x444
	FString ServerURL; // 0x448
	ObjectProperty ApplicationObjects[0xa]; // 0x458
	int32_t ConnectionCount; // 0x4a8
	int32_t ConnID; // 0x4ac
};

struct ATgDevice_ChurchillInhand {
	float m_fADSRecoilMultiplier; // 0xaec
	float m_fAmmoRefundChanceADS; // 0xaf0
	float m_fAmmoRefundPercOnHit; // 0xaf4
	ObjectProperty m_CachedPawnOwner; // 0xaf8
};

struct ATgDeviceVolume {
	char bPainCausing : 1; // 0x2bc
	char BACKUP_bPainCausing : 1; // 0x2bc
	char s_bDeviceActive : 1; // 0x2bc
	ObjectProperty PainTimer; // 0x2c0
	ObjectProperty DamageInstigator; // 0x2c8
	int32_t m_nMapObjectId; // 0x2d0
	int32_t s_nDeviceId; // 0x2d4
	ObjectProperty s_DeviceFireMode; // 0x2d8
	char s_nTaskForce; // 0x2e0
};

struct UForceFeedbackWaveform {
	char bIsLooping : 1; // 0x60
	TArray<FWaveformSample> Samples; // 0x64
	float WaveformFalloffStartDistance; // 0x74
	float MaxWaveformDistance; // 0x78
};

struct USoundNodeWaveParam {
	FName WaveParameterName; // 0x74
};

struct UMaterialExpressionFontSampleParameter {
	FName ParameterName; // 0xbc
	FGuid ExpressionGUID; // 0xc4
	FName Group; // 0xd4
};

struct UUIComponent_GoalReward {
	ObjectProperty m_mcTitle; // 0x120
	ObjectProperty m_mcItemName; // 0x128
	ObjectProperty m_mcGoal; // 0x130
	ObjectProperty m_mcOwned; // 0x138
	ObjectProperty m_mcLock; // 0x140
	ObjectProperty m_mcIconRarity; // 0x148
	ObjectProperty m_mcIconIcon; // 0x150
	ObjectProperty m_mcIconChestIcon; // 0x158
	ObjectProperty m_Progress; // 0x160
};

struct UUIComponent_BattlePassPicks {
	ObjectProperty m_grGroup; // 0x120
	ObjectProperty m_mcPicksHeader; // 0x128
	ObjectProperty m_mcBPActiveThrough; // 0x130
	ObjectProperty m_mcBonusLabel; // 0x138
	ObjectProperty m_mcBonusAmount; // 0x140
	ObjectProperty m_pSpoilerToggle; // 0x148
	ObjectProperty m_pPickWeeks; // 0x150
	ObjectProperty m_pBecomeBP; // 0x158
};

struct UMaterialExpressionLandscapeLayerBlend {
	TArray<FLayerBlendInput> Layers; // 0xb0
	FGuid ExpressionGUID; // 0xc0
};

struct ATgDevice_Telepunch {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xaec
	ObjectProperty m_HitCharacter; // 0xaf4
	char m_bLiftApplied : 1; // 0xafc
	char m_bStealthApplied : 1; // 0xafc
	float m_fLerpTime; // 0xb00
	FVector m_vHitCharacterInitialLocation; // 0xb04
	float m_fHorizontalHitMaxDist; // 0xb10
	float m_fVerticalHitMaxDist; // 0xb14
	float m_fTeleportPreferedDistance; // 0xb18
	float m_fTargetLockTime; // 0xb1c
};

struct USeqAct_SetString {
	FString Target; // 0x108
	FString Value; // 0x118
};

struct UMaterialExpressionFluidNormal {
	FExpressionInput Coordinates; // 0xb0
};

struct ATgDevice_VanguardShield {
	DelegateProperty __InterruptFiringDelegate__Delegate; // 0xaec
};

struct ATgDevice_FragGrenade {
	char m_bThrownGrenade : 1; // 0xaec
};

struct UUIInteractable_NavPanel_Play {
	float m_fFlareScaleTime[0x4]; // 0x168
	float m_fFlareAlphaTime[0x5]; // 0x178
	float m_fFlareScaleTimer[0x4]; // 0x18c
	float m_fFlareAlphaTimer[0x5]; // 0x19c
	ObjectProperty m_mcFlare; // 0x1b0
	ObjectProperty m_mcQueueTF0; // 0x1b8
	ObjectProperty m_mcQueueTF1; // 0x1c0
	ObjectProperty m_mcPrompt; // 0x1c8
	ObjectProperty m_mcCTATF; // 0x1d0
};

struct UCameraModifier_CameraShake {
	TArray<FCameraShakeInstance> ActiveShakes; // 0x80
	float SplitScreenShakeScale; // 0x90
};

struct UTgSeqAct_ToggleStaticMeshSilhouette {
	ObjectProperty SMA; // 0x108
	char bIsEnabled : 1; // 0x110
};

struct UTgSeqEvent_PlayerMoved {
	int32_t ResultEnergy; // 0x128
};

struct ATgAIController_Behavior {
	TArray<FDeferredNode> DeferredNodes; // 0x68c
	int32_t BlackboardType; // 0x69c
	FName BehaviorTreeAsName; // 0x6a0
	FPointer SensorTree; // 0x6a8
	FPointer SensorDynamicMemory; // 0x6b0
	FPointer SensorStaticMemory; // 0x6b8
	FPointer WorkerTree; // 0x6c0
	FPointer WorkerTreeCachedStatus; // 0x6c8
	FPointer WorkerDynamicMemory; // 0x6d0
	FPointer WorkerStaticMemory; // 0x6d8
	int32_t SensorNodeCount; // 0x6e0
	int32_t WorkerNodeCount; // 0x6e4
	float LastUpdateTime; // 0x6e8
	TArray<FBehaviorStateData> CachedNodeData; // 0x6ec
	float m_fCooldownModifier; // 0x6fc
	float m_fLeadAccuracy; // 0x700
	float m_fDegreeMissedMagnitude; // 0x704
	float m_fMissLikelihood; // 0x708
	ObjectProperty LocalRepulsorSolver; // 0x70c
	UTgAILocalPositionSolver* LocalRepulsorSolverClass; // 0x714
	TArray<int32_t> m_IgnoredDeployableIds; // 0x71c
	FNavigationQueueEntry CurrentNavigation; // 0x72c
	float NavigationSearchModifier; // 0x758
	float NavigationSearchModifier_Max; // 0x75c
	float NavigationSearchModifier_Min; // 0x760
	float TimeStuck; // 0x764
	FFollowLaneState FollowLaneForwardState; // 0x768
	FFollowLaneState FollowLaneReverseState; // 0x770
	char bIsAlive : 1; // 0x778
	char m_bPaused : 1; // 0x778
	char bIsRotationLocked : 1; // 0x778
	char bIsStunned : 1; // 0x778
	char bInHostileAbility : 1; // 0x778
	char bIsSafeToRecall : 1; // 0x778
	char bInEnemyTowerRadius : 1; // 0x778
	char bInFriendlyTowerRadius : 1; // 0x778
	char bInEnemyMinotaurRadius : 0; // 0x778
	char bInFriendlyMinotaurRadius : 0; // 0x778
	char bIsTargetOfEnemyTowerOrMinotaur : 0; // 0x778
	char bCombatTargetInEnemyTowerRadius : 0; // 0x778
	char bCombatTargetInFriendlyTowerRadius : 0; // 0x778
	char bCombatTargetInEnemyMinotaurRadius : 0; // 0x778
	char bCombatTargetInFriendlyMinotaurRadius : 0; // 0x778
	char bCombatTargetIsTargetOfFriendlyTowerOrMinotaur : 0; // 0x778
	char bIsAtFortress : 0; // 0x778
	char bIsAtEnemyFortress : 0; // 0x778
	char bIsAtCachedRallyPoint : 0; // 0x778
	char bBtDebugSpawnPaused : 0; // 0x778
	char bBtDebugPaused : 0; // 0x778
	char bBtDebugStep : 0; // 0x778
	char bBtDebugClientOverlay : 0; // 0x778
	FVector NextFearDirection; // 0x77c
	float PawnCollisionHeight; // 0x788
	float PawnCollisionRadius; // 0x78c
	float DeviceRanges[0x14]; // 0x790
	ObjectProperty CombatTarget; // 0x7e0
	ObjectProperty CombatTargetAsPawn; // 0x7e8
	int32_t EnemyMinionsInEnemyTowerRadius; // 0x7f0
	int32_t FriendlyMinionsInEnemyTowerRadius; // 0x7f4
	int32_t EnemyMinionsInFriendlyTowerRadius; // 0x7f8
	int32_t FriendlyMinionsInFriendlyTowerRadius; // 0x7fc
	int32_t EnemyGodsInEnemyTowerRadius; // 0x800
	int32_t FriendlyGodsInEnemyTowerRadius; // 0x804
	int32_t EnemyGodsInFriendlyTowerRadius; // 0x808
	int32_t FriendlyGodsInFriendlyTowerRadius; // 0x80c
	float HealthOfNearestEnemyTower; // 0x810
	float HealthOfNearestFriendlyTower; // 0x814
	ObjectProperty LaneMoveTarget; // 0x818
	TArray<ObjectProperty> VisibleActorsToAvoid; // 0x820
	TArray<ObjectProperty> CachedTowers; // 0x830
	TArray<ObjectProperty> CachedGods; // 0x840
	TArray<ObjectProperty> EnemyControllersInSightRadius; // 0x850
	TArray<ObjectProperty> FriendlyControllersInSightRadius; // 0x860
	EBotDifficultyLevel Difficulty; // 0x870
	EUseDeviceAimType LastUseDeviceAimType; // 0x871
	FVector TargetLastKnownLocation; // 0x874
	ObjectProperty CurrentAssaultPoint; // 0x880
	float m_fUnstuckJumpFrequency; // 0x888
	float m_fLastUnstuckJumpTime; // 0x88c
	TArray<FIncomingDamageEntry> IncomingDamage; // 0x890
	ObjectProperty CachedRallyVolume; // 0x8a0
	int32_t RandomRallyPointIndex; // 0x8a8
	FVector AlliedFortressLookDir; // 0x8ac
	FVector EnemyFortressLookDir; // 0x8b8
	ObjectProperty AlliedFortress; // 0x8c4
	ObjectProperty EnemyFortress; // 0x8cc
	FVector StrafeDir; // 0x8d4
	float LastStrafeDirUpdate; // 0x8e0
	float StrafeDirUpdateTime; // 0x8e4
	UTgAIUtilityHandle* UtilityHandleClass; // 0x8e8
	ObjectProperty UtilityHandle; // 0x8f0
	ObjectProperty EscortActor; // 0x8f8
	float EscortMinDistance; // 0x900
	float EscortMaxDistance; // 0x904
	int32_t m_nDevicesLockingInput; // 0x908
};

struct UCloudSaveSystem {
	TScriptInterface<Class> KeyValueStore; // 0x60
	TScriptInterface<Class> DataBlobStore; // 0x70
	TArray<FGetSaveDataCallbackStruct> OnGetSaveDataCallbacks; // 0x80
	TArray<FSetSaveDataCallbackStruct> OnSetSaveDataCallbacks; // 0x90
	DelegateProperty DeleteSaveDataCallback; // 0xa0
	int32_t ActiveSlotForDelete; // 0xb0
	TArray<FSaveSlotOperation> ActiveSaveSlotOperations; // 0xb4
	DelegateProperty __OnGetSaveDataCallback__Delegate; // 0xc4
	DelegateProperty __SaveSystemCallback__Delegate; // 0xd4
};

struct UClient {
	float MinDesiredFrameRate; // 0x68
	float DisplayGamma; // 0x6c
	float InitialButtonRepeatDelay; // 0x70
	float ButtonRepeatDelay; // 0x74
};

struct USeqAct_GetLocationAndRotation {
	FVector Location; // 0x108
	FVector RotationVector; // 0x114
	FVector Rotation; // 0x120
	FName SocketOrBoneName; // 0x12c
};

struct UGameCheatManager {
	ObjectProperty DebugCameraControllerRef; // 0x80
	ADebugCameraController* DebugCameraControllerClass; // 0x88
	FString DebugCameraControllerClassName; // 0x90
};

struct UUIComponent_ShopItems {
	char m_bRealMoneyDataReady : 1; // 0x120
	ObjectProperty m_mcLoadingTF; // 0x124
	ObjectProperty m_pPrevArrow; // 0x12c
	ObjectProperty m_pNextArrow; // 0x134
	ObjectProperty m_pItemList; // 0x13c
	ObjectProperty m_grInput; // 0x144
	ObjectProperty m_akOwnedItemClicked; // 0x14c
};

struct UParticleModuleUberRainSplashB {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector ColorOverLife; // 0xc0
	FRawDistributionFloat AlphaOverLife; // 0xe4
	FRawDistributionVector LifeMultiplier; // 0x108
	char MultiplyX : 1; // 0x12c
	char MultiplyY : 1; // 0x12c
	char MultiplyZ : 1; // 0x12c
	FRawDistributionFloat StartRotationRate; // 0x130
};

struct UPBRuleNodeBase {
	TArray<FPBRuleLink> NextRules; // 0x60
};

struct UTgSkelCon_WheelSpinner {
	float m_fWheelRadius; // 0x100
	FVector m_vAxis; // 0x104
	float m_fVelocity; // 0x110
};

struct UTgDeviceForm_HexaFire {
	ObjectProperty m_LeftRocket1p; // 0x2bc
	ObjectProperty m_LeftRocket3p; // 0x2c4
	ObjectProperty m_RightRocket1p; // 0x2cc
	ObjectProperty m_RightRocket3p; // 0x2d4
	char m_bFiringRightRocket : 1; // 0x2dc
};

struct ATgDeploy_Molotov {
	TArray<FMolotovPointInfo> m_PointInfos; // 0x1a64
	FMolotovCenterInfo m_CenterInfo; // 0x1a74
	TArray<FMolotovTriangleInfo> m_TriInfos; // 0x1abc
	TArray<FMolotovStrandInfo> m_StrandInfos; // 0x1acc
	FMolotovGrowthInfo m_GrowthInfo; // 0x1adc
	FMolotovGeneralSettings m_Settings; // 0x1af8
};

struct UUIScene_UIClassSelect {
	Fdword m_dwHoveredClass; // 0x154
	ObjectProperty m_pClassList; // 0x158
	ObjectProperty m_pInfoPanel; // 0x160
	ObjectProperty m_grInput; // 0x168
};

struct USeqEvent_MobileLook {
	float Yaw; // 0x138
	float StickStrength; // 0x13c
	FVector RotationVector; // 0x140
};

struct USeqAct_CastToInt {
	char bTruncate : 1; // 0x108
	float Value; // 0x10c
	int32_t IntResult; // 0x110
};

struct UInterpTrackLinearColorBase {
	FInterpCurveLinearColor LinearColorTrack; // 0xa0
	float CurveTension; // 0xb4
};

struct UInterpGroup {
	FPointer VfTable_FInterpEdInputInterface; // 0x60
	TArray<ObjectProperty> InterpTracks; // 0x68
	FName GroupName; // 0x78
	FColor GroupColor; // 0x80
	TArray<ObjectProperty> GroupAnimSets; // 0x84
	char bCollapsed : 1; // 0x94
	char bVisible : 1; // 0x94
	char bIsFolder : 1; // 0x94
	char bIsParented : 1; // 0x94
	char bIsSelected : 1; // 0x94
};

struct UParticleModulePhysicsVolumes {
	FRawDistributionFloat GlobalInfluence; // 0x68
	EParticleLevelInfluenceType LevelInfluenceType; // 0x8c
};

struct USeqAct_MultiLevelStreaming {
	TArray<FLevelStreamingNameCombo> Levels; // 0x124
	char bUnloadAllOtherLevels : 1; // 0x134
	char bStatusIsOk : 1; // 0x134
};

struct UParticleModuleUberLTISIVCLILIRSSBLIRR {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartVelocity; // 0xc0
	FRawDistributionFloat StartVelocityRadial; // 0xe4
	FRawDistributionVector ColorOverLife; // 0x108
	FRawDistributionFloat AlphaOverLife; // 0x12c
	FRawDistributionVector StartLocation; // 0x150
	FRawDistributionFloat StartRotation; // 0x174
	FRawDistributionVector SizeLifeMultiplier; // 0x198
	char SizeMultiplyX : 1; // 0x1bc
	char SizeMultiplyY : 1; // 0x1bc
	char SizeMultiplyZ : 1; // 0x1bc
	FRawDistributionFloat StartRotationRate; // 0x1c0
};

struct UUISceneClient {
	FPointer VfTable_FExec; // 0x70
	FPointer RenderViewport; // 0x78
	FIntPoint MousePosition; // 0x80
	ObjectProperty DataStoreManager; // 0x88
	FMatrix CanvasToScreen; // 0x90
	FMatrix InvCanvasToScreen; // 0xd0
	ObjectProperty UIScenePostProcess; // 0x110
	char bEnablePostProcess : 1; // 0x118
};

struct USpeedTreeComponentFactory {
	ComponentProperty SpeedTreeComponent; // 0x64
};

struct UOnlineStatsRead {
	FString LeaderboardName; // 0x84
};

struct USeqEvent_Console {
	FName ConsoleEventName; // 0x128
	FString EventDesc; // 0x130
};

struct UMaterialExpressionSubtract {
	FExpressionInput A; // 0xb0
	FExpressionInput B; // 0xe4
};

struct UTextureRenderTarget {
	char bUpdateImmediate : 1; // 0x100
	char bNeedsTwoCopies : 1; // 0x100
	char bRenderOnce : 1; // 0x100
	float TargetGamma; // 0x104
};

struct UPBRuleNodeLODQuad {
	float MassiveLODDistanceScale; // 0x70
};

struct UOnlineAuthInterfaceImpl {
	FPointer VfTable_IOnlineAuthInterface; // 0x60
	ObjectProperty OwningSubsystem; // 0x68
	char bAuthReady : 1; // 0x70
	FSparseArray_Mirror ClientAuthSessions; // 0x74
	FSparseArray_Mirror ServerAuthSessions; // 0xac
	FSparseArray_Mirror PeerAuthSessions; // 0xe4
	FSparseArray_Mirror LocalClientAuthSessions; // 0x11c
	FSparseArray_Mirror LocalServerAuthSessions; // 0x154
	FSparseArray_Mirror LocalPeerAuthSessions; // 0x18c
	TArray<DelegateProperty> AuthReadyDelegates; // 0x1c4
	TArray<DelegateProperty> ClientAuthRequestDelegates; // 0x1d4
	TArray<DelegateProperty> ServerAuthRequestDelegates; // 0x1e4
	TArray<DelegateProperty> ClientAuthResponseDelegates; // 0x1f4
	TArray<DelegateProperty> ServerAuthResponseDelegates; // 0x204
	TArray<DelegateProperty> ClientAuthCompleteDelegates; // 0x214
	TArray<DelegateProperty> ServerAuthCompleteDelegates; // 0x224
	TArray<DelegateProperty> ClientAuthEndSessionRequestDelegates; // 0x234
	TArray<DelegateProperty> ServerAuthRetryRequestDelegates; // 0x244
	TArray<DelegateProperty> ClientConnectionCloseDelegates; // 0x254
	TArray<DelegateProperty> ServerConnectionCloseDelegates; // 0x264
	DelegateProperty __OnAuthReady__Delegate; // 0x274
	DelegateProperty __OnClientAuthRequest__Delegate; // 0x284
	DelegateProperty __OnServerAuthRequest__Delegate; // 0x294
	DelegateProperty __OnClientAuthResponse__Delegate; // 0x2a4
	DelegateProperty __OnServerAuthResponse__Delegate; // 0x2b4
	DelegateProperty __OnClientAuthComplete__Delegate; // 0x2c4
	DelegateProperty __OnServerAuthComplete__Delegate; // 0x2d4
	DelegateProperty __OnClientAuthEndSessionRequest__Delegate; // 0x2e4
	DelegateProperty __OnServerAuthRetryRequest__Delegate; // 0x2f4
	DelegateProperty __OnClientConnectionClose__Delegate; // 0x304
	DelegateProperty __OnServerConnectionClose__Delegate; // 0x314
};

struct UTgInventoryObject_Listen_Combo_Viktor {
	TArray<FTimedMarkedTarget> m_MarkedTargets; // 0xd0
};

struct UTgCached_LootItem {
	int32_t m_nId; // 0x60
	float m_fDropChance; // 0x64
	int32_t m_nQuantity; // 0x68
};

struct ATgDeploy_LootCrateBasic {
	char r_bIsChestOpened : 1; // 0x4b4
};

struct UTgAnimNotify_AkEvent {
	TArray<FPSE_SkinAk> m_SkinOverrideList; // 0x7c
};

struct ATgDevice_ArcingBeam {
	TArray<FArcingInfo> m_ArcingList; // 0xaec
	int32_t m_nMaxNumArcsPerTarget; // 0xafc
	char m_bCanTargetShields : 1; // 0xb00
	char m_bIsArcing : 1; // 0xb00
};

struct UTgInventoryObject_Listen_ArcingBeam {
	int32_t m_nDeviceId; // 0xc8
	TArray<ObjectProperty> m_MarkedTargets; // 0xcc
};

struct UTgIconGroup {
	ObjectProperty m_Manager; // 0x60
	ObjectProperty m_DataItem; // 0x68
	char m_bLoadByItemType : 1; // 0x70
	ObjectProperty m_ManifestGroup; // 0x74
	FMap_Mirror m_TextureObjects; // 0x7c
};

struct UFactory {
	UObject* SupportedClass; // 0x60
	UObject* ContextClass; // 0x68
	FString Description; // 0x70
	TArray<FString> Formats; // 0x80
	char bCreateNew : 1; // 0x90
	char bEditAfterNew : 1; // 0x90
	char bEditorImport : 1; // 0x90
	char bText : 1; // 0x90
	int32_t AutoPriority; // 0x94
	TArray<FString> ValidGameNames; // 0x98
};

struct ATerrain {
	TArray<FTerrainHeight> Heights; // 0x280
	TArray<FTerrainInfoData> InfoData; // 0x290
	TArray<FTerrainLayer> Layers; // 0x2a0
	int32_t NormalMapLayer; // 0x2b0
	TArray<FTerrainDecoLayer> DecoLayers; // 0x2b4
	TArray<FAlphaMap> AlphaMaps; // 0x2c4
	TArray<ComponentProperty> TerrainComponents; // 0x2d4
	int32_t NumSectionsX; // 0x2e4
	int32_t NumSectionsY; // 0x2e8
	TArray<FTerrainWeightedMaterial> WeightedMaterials; // 0x2ec
	TArray<ObjectProperty> WeightedTextureMaps; // 0x2fc
	int32_t MaxTesselationLevel; // 0x30c
	int32_t MinTessellationLevel; // 0x310
	float TesselationDistanceScale; // 0x314
	float TessellationCheckDistance; // 0x318
	int32_t CollisionTesselationLevel; // 0x31c
	FCachedTerrainMaterialArray CachedTerrainMaterials[0x2]; // 0x320
	int32_t NumVerticesX; // 0x340
	int32_t NumVerticesY; // 0x344
	int32_t NumPatchesX; // 0x348
	int32_t NumPatchesY; // 0x34c
	int32_t MaxComponentSize; // 0x350
	int32_t StaticLightingResolution; // 0x354
	char bIsOverridingLightResolution : 1; // 0x358
	char bBilinearFilterLightmapGeneration : 1; // 0x358
	char bCastShadow : 1; // 0x358
	char bForceDirectLightMap : 1; // 0x358
	char bCastDynamicShadow : 1; // 0x358
	char bEnableSpecular : 1; // 0x358
	char bBlockRigidBody : 1; // 0x358
	char bAllowRigidBodyUnderneath : 1; // 0x358
	char bAcceptsDynamicLights : 0; // 0x358
	char bMorphingEnabled : 0; // 0x358
	char bMorphingGradientsEnabled : 0; // 0x358
	char bLocked : 0; // 0x358
	char bHeightmapLocked : 0; // 0x358
	char bShowingCollision : 0; // 0x358
	char bUseWorldOriginTextureUVs : 0; // 0x358
	char bShowWireframe : 0; // 0x358
	ObjectProperty TerrainPhysMaterialOverride; // 0x35c
	FLightingChannelContainer LightingChannels; // 0x364
	FLightmassPrimitiveSettings LightmassSettings; // 0x368
	FPointer ReleaseResourcesFence; // 0x384
	int32_t EditorTessellationLevel; // 0x38c
	TArray<FSelectedTerrainVertex> SelectedVertices; // 0x390
	FColor WireframeColor; // 0x3a0
};

struct UTgAnimNotifySkinData {
	FString OwningNotify; // 0x60
	ObjectProperty SoundCueTemplate; // 0x70
	ObjectProperty ParticleSystemTemplate; // 0x78
	int32_t nSkinId; // 0x80
	int32_t nSkinLevel; // 0x84
};

struct UUIData_Challenge {
	Fdword m_dwActivityId; // 0x60
	Fdword m_eStatus; // 0x64
	char m_bIsDirty : 1; // 0x68
	char m_bCompletionAck : 1; // 0x68
	char m_bGoalsInitialized : 1; // 0x68
	TArray<ObjectProperty> m_pPrimaryGoals; // 0x6c
	TArray<ObjectProperty> m_pGatingGoals; // 0x7c
	TArray<ObjectProperty> m_pAllDoneGoals; // 0x8c
	TArray<ObjectProperty> m_pAuxiliaryGoals; // 0x9c
};

struct USeqVar_Object {
	ObjectProperty ObjValue; // 0xa0
	FVector ActorLocation; // 0xa8
	TArray<UObject*> SupportedClasses; // 0xb4
};

struct UTgSkeletalMeshComponent_Weapon {
	FName m_nmFire; // 0x86c
	FName m_nmFireLoop; // 0x874
	FName m_nmFireLoopTailSound; // 0x87c
	char m_bDoNotPlayFireParticlesIfHidden : 1; // 0x884
	char m_bKillFiringLoopParticlesOnHidden : 1; // 0x884
	char m_bCanPlayFireParticles : 1; // 0x884
	char m_bCanPlayFireLoopParticles : 1; // 0x884
	char m_bCanPlayFireSounds : 1; // 0x884
	char m_bCanPlayFireLoopSounds : 1; // 0x884
	int32_t m_nFireLoopActiveBitMask; // 0x888
};

struct USoundNodeAttenuationAndGain {
	char bAttenuate : 1; // 0x74
	char bSpatialize : 1; // 0x74
	char bAttenuateWithLPF : 1; // 0x74
	float dBAttenuationAtMax; // 0x78
	float OmniRadius; // 0x7c
	SoundDistanceModel GainDistanceAlgorithm; // 0x80
	SoundDistanceModel AttenuateDistanceAlgorithm; // 0x81
	ESoundDistanceCalc DistanceType; // 0x82
	float MinimalVolume; // 0x84
	float RadiusMin; // 0x88
	float RadiusPeak; // 0x8c
	float RadiusMax; // 0x90
	float LPFMinimal; // 0x94
	float LPFRadiusMin; // 0x98
	float LPFRadiusPeak; // 0x9c
	float LPFRadiusMax; // 0xa0
};

struct USeqAct_GameCrowdPopulationManagerToggle {
	float WarmupPopulationPct; // 0x108
	ObjectProperty CrowdAgentList; // 0x10c
	char bClearOldArchetypes : 1; // 0x114
	char bEnableCrowdLightEnvironment : 1; // 0x114
	char bCastShadows : 1; // 0x114
	char bFillPotentialSpawnPoints : 1; // 0x114
	char bForceObstacleChecking : 1; // 0x114
	char bForceNavMeshPathing : 1; // 0x114
	char bIndividualSpawner : 1; // 0x114
	int32_t MaxAgents; // 0x118
	float SpawnRate; // 0x11c
	FLightingChannelContainer AgentLightingChannel; // 0x120
	float MaxSpawnDist; // 0x124
	float MinBehindSpawnDist; // 0x128
	TArray<ObjectProperty> PotentialSpawnPoints; // 0x12c
	float AgentWarmupTime; // 0x13c
	int32_t NumAgentsToTickPerFrame; // 0x140
	TArray<ObjectProperty> LastSpawnedList; // 0x144
};

struct ATgDevice_HitPulse {
	char s_ShouldPayCostPerPulse : 1; // 0xaec
	char s_bCostPaid : 1; // 0xaec
	char m_bConsumeAmmoOnEachPulse : 1; // 0xaec
	int32_t m_CurrentPulseIndex; // 0xaf0
};

struct ATgRoyaleZeppelin {
	ComponentProperty m_SkeletalMeshComponent; // 0x280
	ComponentProperty m_LootCrateSkeletalMeshComponent; // 0x288
	ComponentProperty m_LightEnvironment; // 0x290
	ObjectProperty m_ZeppelinAnimNodeBlendList; // 0x298
	FVector m_vLootSpawnOffset; // 0x2a0
	FVector m_vLootSpawnLocation; // 0x2ac
	float m_fAirSpeed; // 0x2b8
	float m_fDeployTime; // 0x2bc
	FVector r_vRouteDir; // 0x2c0
	char r_bSpawnedEpicLootCrate : 1; // 0x2cc
	int32_t m_nZeppelinMeshAsmId; // 0x2d0
	int32_t m_nLootCrateMeshAsmId; // 0x2d4
};

struct ATgDevice_WeaponZoom {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xaf4
	ObjectProperty m_CachedInhand; // 0xafc
	char m_bDelayMoveSpeedPenalty : 1; // 0xb04
	char m_bIsZoomed : 1; // 0xb04
};

struct UTgEffectForm {
	int32_t c_nEffectGroupId; // 0x60
	int32_t c_nInstigatorID; // 0x64
	int32_t c_nType; // 0x68
	ObjectProperty c_Owner; // 0x6c
	FPointer c_pwzEffectName; // 0x74
	FPointer c_pwzDescription; // 0x7c
	int32_t c_nEffectIconId; // 0x84
	TArray<ObjectProperty> c_AppliedFxArray; // 0x88
	char c_bHiddenDueToStealth : 1; // 0x98
	char c_bHiddenDueToFirstPerson : 1; // 0x98
	char c_bMICApplied : 1; // 0x98
	char m_bSpawnAtHitLocation : 1; // 0x98
	char c_bIsDebuff : 1; // 0x98
	char c_bIsCrit : 1; // 0x98
	char c_bLocal : 1; // 0x98
	TG_POSTURE c_Posture; // 0x9c
	int32_t c_PostureID; // 0xa0
	ObjectProperty m_MaterialInstanceConstant; // 0xa4
	ObjectProperty m_OwnerPawn; // 0xac
	FVector m_HitLocation; // 0xb4
	FVector m_HitNormal; // 0xc0
	int32_t c_nSkinId; // 0xcc
	int32_t c_nWeaponSkinId; // 0xd0
	ObjectProperty c_CameraEffect; // 0xd4
	int32_t c_nStackCount; // 0xdc
	int32_t c_nBodyMeshMaterialHandle; // 0xe0
	int32_t c_nMountMeshMaterialHandle; // 0xe4
	int32_t c_nHeadMeshMaterialHandle; // 0xe8
	int32_t c_nWeaponMesh1PMaterialHandle; // 0xec
	int32_t c_nHandsMeshMaterialHandle; // 0xf0
	int32_t c_nHeadMesh1PMaterialHandle; // 0xf4
	int32_t c_nWeaponMesh3PMaterialHandle; // 0xf8
};

struct UTgAnimMetaData_MICScalarParameter {
	FName MICParameterName; // 0x80
	int32_t MaterialIndex; // 0x88
};

struct UParticleModuleLocationWorldOffset_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x94
};

struct USphericalHarmonicLightComponent {
	FSHVectorRGB WorldSpaceIncidentLighting; // 0x1b0
	char bRenderBeforeModShadows : 1; // 0x240
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x104
};

struct UUIComponent_RolledSubItem {
	ObjectProperty m_mcDuplicate; // 0x120
	ObjectProperty m_pReplacementCurrency; // 0x128
	ObjectProperty m_pItem; // 0x130
};

struct URB_Spring {
	ComponentProperty Component1; // 0x88
	FName BoneName1; // 0x90
	ComponentProperty Component2; // 0x98
	FName BoneName2; // 0xa0
	int32_t SceneIndex; // 0xa8
	char bInHardware : 1; // 0xac
	char bEnableForceMassRatio : 1; // 0xac
	FPointer SpringData; // 0xb0
	float TimeSinceActivation; // 0xb8
	float MinBodyMass; // 0xbc
	float SpringSaturateDist; // 0xc0
	float SpringMaxForce; // 0xc4
	float MaxForceMassRatio; // 0xc8
	FInterpCurveFloat SpringMaxForceTimeScale; // 0xcc
	float DampSaturateVel; // 0xe0
	float DampMaxForce; // 0xe4
};

struct UTgSeqAct_SetPlayerMeshVisible {
	char bIs1PMeshVisible : 1; // 0x108
	char bIs3PMeshVisible : 1; // 0x108
};

struct UTgAIBehaviorCondition_HasActive {
	EActiveType ActiveType; // 0x98
};

struct UParticleModuleTypeDataMesh {
	ObjectProperty Mesh; // 0x68
	char CastShadows : 1; // 0x70
	char DoCollisions : 1; // 0x70
	char bAllowMotionBlur : 1; // 0x70
	char bOverrideMaterial : 1; // 0x70
	char bCameraFacing : 1; // 0x70
	char bApplyParticleRotationAsSpin : 1; // 0x70
	EMeshScreenAlignment MeshAlignment; // 0x74
	EParticleAxisLock AxisLockOption; // 0x75
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x76
	EMeshCameraFacingOptions CameraFacingOption; // 0x77
	float Pitch; // 0x78
	float Roll; // 0x7c
	float Yaw; // 0x80
};

struct UTgDeviceForm_LongbowInhand {
	char m_bImpalerArrowFXIsActive : 1; // 0x2bc
	char m_bBowDrawing : 1; // 0x2bc
	float m_fBowDrawPercentage; // 0x2c0
	float m_fBowDrawStartPercentage; // 0x2c4
	float m_fBowDrawTime; // 0x2c8
	float m_fBowDrawTotalDuration; // 0x2cc
	TArray<ObjectProperty> m_BlendByPct1P; // 0x2d0
	TArray<ObjectProperty> m_BlendByPct3P; // 0x2e0
	ObjectProperty m_ArrowSkelControl1P; // 0x2f0
	ObjectProperty m_ImpalerSkelControl1P; // 0x2f8
};

struct UParticleModuleSpawnBase {
	char bProcessSpawnRate : 1; // 0x68
	char bProcessBurstList : 1; // 0x68
};

struct UUIComponent_ScrollBar {
	int32_t m_nPageHeight; // 0x140
	int32_t m_nPageWidth; // 0x144
	int32_t m_nNumElements; // 0x148
	float m_fScrollPos; // 0x14c
	int32_t m_nNavScrollCBHandle1; // 0x150
	int32_t m_nNavScrollCBHandle2; // 0x154
	ObjectProperty m_grScroll; // 0x158
	char m_bScrollVertical : 1; // 0x160
};

struct UUIHudOverlay {
	char ShowAllTeamAsParty : 1; // 0x244
	char m_bBringToFrontProcessed : 1; // 0x244
	char m_bCanVault : 1; // 0x244
	char m_bInteractingCatapult : 1; // 0x244
	char m_bEnteredCatapult : 1; // 0x244
	char m_bShowPrompt : 1; // 0x244
	char m_bTooltipVisible : 1; // 0x244
	char m_bSpectatorShowPlayerIcons : 1; // 0x244
	int32_t m_nDepth; // 0x248
	int32_t m_nCritCount; // 0x24c
	int32_t m_nLastTargetId; // 0x250
	char m_ePickupSlot; // 0x254
	char m_eLastTargetType; // 0x255
	EDamageNumbersType m_eDamageNumbersType; // 0x256
	float m_fDelta; // 0x258
	float m_fRange; // 0x25c
	float m_fScreenLocInterp; // 0x260
	float m_fWorldLocInterp; // 0x264
	float m_fCritSpeed; // 0x268
	float m_fCritBloom; // 0x26c
	float m_fCritTimer; // 0x270
	float m_fDamageSpeed; // 0x274
	float m_fDamageBloom; // 0x278
	float m_fDamageTimer; // 0x27c
	float m_fDamageFadeOutDuration; // 0x280
	float m_fStatusTimer; // 0x284
	float m_fStatusSpeed; // 0x288
	float m_fStatusBloom; // 0x28c
	float m_fHealingSpeed; // 0x290
	float m_fHealingBloom; // 0x294
	float m_fHealingTimer; // 0x298
	float m_fResolutionModX; // 0x29c
	float m_fResolutionModY; // 0x2a0
	float m_fRarityFadeTimer; // 0x2a4
	float m_fSearchStartX; // 0x2a8
	float m_fSearchStartY; // 0x2ac
	float m_fSearchAlignOffset; // 0x2b0
	float m_fPromptAlignOffset; // 0x2b4
	float m_fPromptOffsetY; // 0x2b8
	float m_fPointerOffsetX; // 0x2bc
	float m_fPointerOffsetY; // 0x2c0
	float m_fOverlayDefaultPadding; // 0x2c4
	float m_fOverlayYOffset; // 0x2c8
	float m_fOverlayRenderDist; // 0x2cc
	float m_fOverlayXMin; // 0x2d0
	float m_fOverlayXMax; // 0x2d4
	float m_fOverlayYMin; // 0x2d8
	float m_fOverlayYMax; // 0x2dc
	float m_fReviveYOffset; // 0x2e0
	float m_fReviveAlphaMin; // 0x2e4
	float m_fReviveAlphaMax; // 0x2e8
	float m_fReviveAlphaMinDist; // 0x2ec
	float m_fReviveAlphaMaxDist; // 0x2f0
	int32_t m_nCachedMaxShards; // 0x2f4
	int32_t m_nLootDevice; // 0x2f8
	ObjectProperty m_mcLoot; // 0x2fc
	ObjectProperty m_mcLootName; // 0x304
	ObjectProperty m_mcLootDesc; // 0x30c
	ObjectProperty m_mcLootType; // 0x314
	ObjectProperty m_mcLootClass; // 0x31c
	ObjectProperty m_mcLootFrame; // 0x324
	ObjectProperty m_mcLootIconA; // 0x32c
	ObjectProperty m_mcLootIconB; // 0x334
	ObjectProperty m_mcLootIconFrameA; // 0x33c
	ObjectProperty m_mcLootIconFrameB; // 0x344
	ObjectProperty m_mcLootIconTextureA; // 0x34c
	ObjectProperty m_mcLootIconTextureB; // 0x354
	ObjectProperty m_mcLootElement; // 0x35c
	ObjectProperty m_mcLootPromptA; // 0x364
	ObjectProperty m_mcLootPromptB; // 0x36c
	ObjectProperty m_mcLootDamage; // 0x374
	ObjectProperty m_mcLootDamageName; // 0x37c
	ObjectProperty m_mcLootDamageDesc; // 0x384
	ObjectProperty m_mcLootDamageArrow; // 0x38c
	ObjectProperty m_mcPickup; // 0x394
	ObjectProperty m_mcScopes; // 0x39c
	ObjectProperty m_mcScopeSniper; // 0x3a4
	ObjectProperty m_mcScopeSniperFrame; // 0x3ac
	ObjectProperty m_mcScopeSniperCrosshair; // 0x3b4
	ObjectProperty m_mcSearch; // 0x3bc
	ObjectProperty m_mcSearchKey; // 0x3c4
	ObjectProperty m_mcSearchName; // 0x3cc
	ObjectProperty m_mcIconVault; // 0x3d4
	ObjectProperty m_mcPrompt; // 0x3dc
	ObjectProperty m_mcBigHeadMode; // 0x3e4
	ObjectProperty m_mcBigHeadModePrompt; // 0x3ec
	TArray<FOverlayData> m_CritData; // 0x3f4
	TArray<FOverlayData> m_LockData; // 0x404
	TArray<FOverlayData> m_ForgeData; // 0x414
	TArray<FDamageOverlayData> m_DamageData; // 0x424
	TArray<FOverlayData> m_StatusData; // 0x434
	TArray<FOverlayData> m_HealingData; // 0x444
	TArray<FOverlayData> m_RevivingData; // 0x454
	TArray<FOverlayData> m_LootGoblinData; // 0x464
	int32_t m_nCurrentPromptMessageId; // 0x474
	ObjectProperty m_mcTutorialPrompt; // 0x478
	ObjectProperty m_mcTutorialPromptFrame; // 0x480
	int32_t m_nCurrentTooltipMessageId; // 0x488
	ObjectProperty m_mcTooltip; // 0x48c
	ObjectProperty m_mcTooltipText; // 0x494
	ObjectProperty m_mcTooltipBackground; // 0x49c
	float m_fMaxPingTime; // 0x4a4
	TArray<FUIPingOverlay> m_PingOverlays; // 0x4a8
	TArray<FUIPlayerOverlay> m_TeamOverlays; // 0x4b8
	TArray<FUIPlayerOverlay> m_EnemyOverlays; // 0x4c8
	ObjectProperty m_scPickup; // 0x4d8
	ObjectProperty m_akForgeComplete; // 0x4e0
	float m_fDamageNumberCombineDuration; // 0x4e8
};

struct UInterpTrackBoolProp {
	TArray<FBoolTrackKey> BoolTrack; // 0xa0
	FName PropertyName; // 0xb0
};

struct USaveGameSummary {
	FName BaseLevel; // 0x60
	FString Description; // 0x68
};

struct UParticleModuleTypeDataTrail {
	char RenderGeometry : 1; // 0x68
	char RenderLines : 1; // 0x68
	char RenderTessellation : 1; // 0x68
	char Tapered : 1; // 0x68
	char SpawnByDistance : 1; // 0x68
	int32_t TessellationFactor; // 0x6c
	FRawDistributionFloat Tension; // 0x70
	FVector SpawnDistance; // 0x94
};

struct UDOFBloomMotionBlurEffect {
	float MaxVelocity; // 0xdc
	float MotionBlurAmount; // 0xe0
	char FullMotionBlur : 1; // 0xe4
	float CameraRotationThreshold; // 0xe8
	float CameraTranslationThreshold; // 0xec
};

struct UPath_TowardGoal {
	ObjectProperty GoalActor; // 0x6c
};

struct AFluidInfluenceActor {
	ComponentProperty FlowDirection; // 0x280
	ComponentProperty Sprite; // 0x288
	ComponentProperty InfluenceComponent; // 0x290
	char bActive : 1; // 0x298
	char bToggled : 1; // 0x298
};

struct ULocalMessage {
	char bIsSpecial : 1; // 0x60
	char bIsUnique : 1; // 0x60
	char bIsPartiallyUnique : 1; // 0x60
	char bIsConsoleMessage : 1; // 0x60
	char bBeep : 1; // 0x60
	char bCountInstances : 1; // 0x60
	float Lifetime; // 0x64
	FColor DrawColor; // 0x68
	float PosY; // 0x6c
	int32_t FontSize; // 0x70
};

struct UTgAIUtilityFilter_StayInTargetFOV {
	char bInverse : 1; // 0xc0
};

struct UNavMeshGoal_Null {
	FPointer PartialGoal; // 0x7c
};

struct USeqVar_Group {
	FName GroupName; // 0xc4
	char bCachedList : 1; // 0xcc
	TArray<ObjectProperty> Actors; // 0xd0
};

struct UTgSeqEvent_SpawnLanePusher {
	int32_t Taskforce; // 0x128
};

struct ATgSiegePushActor {
	ObjectProperty s_CollisionProxy; // 0x280
	float m_fCollisionProxyRadius; // 0x288
	float m_fCollisionProxyHeight; // 0x28c
	ComponentProperty m_SkelMesh; // 0x290
	ComponentProperty m_RadiusMesh; // 0x298
	int32_t m_nTF1Count; // 0x2a0
	int32_t m_nTF2Count; // 0x2a4
	int32_t m_nDefenderTaskForce; // 0x2a8
	EPushState m_CurrentPushState; // 0x2ac
	float m_fPendingReverseTime; // 0x2b0
};

struct UInterpTrackInstFloatProp {
	FPointer FloatProp; // 0x70
	float ResetFloat; // 0x78
	FPointer DistributionProp; // 0x7c
};

struct USeqAct_ControlMovieTexture {
	ObjectProperty MovieTexture; // 0x108
};

struct UGameCrowdGroup {
	TArray<ObjectProperty> Members; // 0x60
};

struct UNavMeshPath_BiasAgainstPolysWithinDistanceOfLocations {
	FVector Location; // 0x78
	FVector Rotation; // 0x84
	float DistanceToCheck; // 0x90
	TArray<FVector> LocationsToCheck; // 0x94
};

struct ATgEmitter_TeamColor {
	int32_t nTaskForce; // 0x294
	FParticleChannelContainer DefaultParticleChannels; // 0x298
};

struct UTgInventoryObject_Listen_HealthPCT_In_Range {
	char m_bApplied : 1; // 0xc8
};

struct UTgSeqAct_BeginWaitForLookAt {
	FVector LocationToLookAt; // 0x108
	float MinOffsetDistance; // 0x114
};

struct ATgNavRouteIndicator {
	FPointer VfTable_IInterface_NavigationHandle; // 0x32c
	TArray<FVector> WayPoints; // 0x334
	int32_t Position; // 0x344
	float m_fPositionStartTime; // 0x348
	float m_fPositionMaxSeekTime; // 0x34c
	float m_fSpinUpTime; // 0x350
	float m_fSpinDownTime; // 0x354
	ObjectProperty m_SpinUpFx; // 0x358
	ObjectProperty m_PathingFx; // 0x360
	ObjectProperty m_SpinDownFx; // 0x368
	ObjectProperty NavigationHandle; // 0x370
};

struct UUIData_DailyRewardDay {
	int32_t m_nDayIndex; // 0x60
	int32_t m_nCurrentDay; // 0x64
	char m_bClaimed : 1; // 0x68
};

struct ABlockingVolume {
	char bBlockCamera : 1; // 0x2bc
};

struct UTgSkelControlSingleBone_DisplayGroup {
	TArray<FDisplayGroupInfo> DisplayGroupInfos; // 0x144
	char m_bPawnOwner : 1; // 0x154
};

struct UTgDeviceForm {
	FPointer VfTable_FCallbackEventDevice; // 0x60
	ObjectProperty PawnOwner; // 0x68
	FEquipDeviceInfo c_EquipDeviceInfo; // 0x70
	int32_t m_nDeviceType; // 0x84
	int32_t m_nDeviceSubtype; // 0x88
	DeviceTargetMode m_eTargetingMode; // 0x8c
	DeviceSubtype c_eDeviceSubtype; // 0x8d
	eMovementType c_eMovementType; // 0x8e
	ETargetingModeStatus c_eTargetingModeStatus; // 0x8f
	SCOPETYPE c_eScopeType; // 0x90
	char c_bDeployed : 1; // 0x94
	char c_bHandDevice : 1; // 0x94
	char c_bDisableDefaultTimelapseRecovery : 1; // 0x94
	char c_bIsTransitioningToNewMode : 1; // 0x94
	char c_bTargetingModeEnabled : 1; // 0x94
	char c_bTargeterInitializedThisTick : 1; // 0x94
	char c_bTargeterIsInWorldDPG : 1; // 0x94
	char c_bUseInstigatorMesh : 1; // 0x94
	char c_bIsInHand : 0; // 0x94
	char m_bInitializingAssets : 0; // 0x94
	char m_bLoopWhileFiringCameraAnim : 0; // 0x94
	char m_bUseImpactFXOverride : 0; // 0x94
	char m_bRecoilTimerActive : 0; // 0x94
	char m_bForceBlendOutOnAnimEnd : 0; // 0x94
	TArray<ObjectProperty> c_PawnAnimSetOverrideList; // 0x98
	TArray<FModeData> ModeDatas; // 0xa8
	FPointer m_pAmSetup; // 0xb8
	ComponentProperty c_Mesh; // 0xc0
	ComponentProperty c_AttachedMesh; // 0xc8
	ComponentProperty c_ThirdPersonMesh; // 0xd0
	ComponentProperty c_FirstPersonMesh; // 0xd8
	FName c_nmMountPoint; // 0xe0
	FName FormState; // 0xe8
	int32_t c_nFireMode; // 0xf0
	int32_t c_nEquipSlot; // 0xf4
	float c_fLastReceivedRefireTime; // 0xf8
	int32_t c_nLastFxMode; // 0xfc
	ObjectProperty c_TargetingModeMeshIndicator; // 0x100
	ObjectProperty c_TargetingModeFx; // 0x108
	FAimData c_TargetingAim; // 0x110
	int32_t c_nTargetingModeFxId; // 0x144
	float c_fRemainingTransitionTime; // 0x148
	float c_fTotalTransitionTime; // 0x14c
	ObjectProperty m_LockedTarget; // 0x150
	float m_fCachedZoomedFOV; // 0x158
	ObjectProperty m_AssetReference; // 0x15c
	ObjectProperty m_OwnerActor; // 0x164
	TArray<ObjectProperty> m_AbilityBlendList1P; // 0x16c
	TArray<ObjectProperty> m_AbilityBlendList3P; // 0x17c
	TArray<ObjectProperty> m_ChannelFireBlendList1P; // 0x18c
	TArray<ObjectProperty> m_ChannelFireBlendList3P; // 0x19c
	TArray<ObjectProperty> m_TargetingBlendList1P; // 0x1ac
	TArray<ObjectProperty> m_TargetingBlendList3P; // 0x1bc
	TArray<ObjectProperty> m_ToggleTransitionNodes1P; // 0x1cc
	TArray<ObjectProperty> m_ToggleTransitionNodes3P; // 0x1dc
	TArray<ObjectProperty> m_AmmoBlendList1P; // 0x1ec
	TArray<ObjectProperty> m_AmmoBlendList3P; // 0x1fc
	TArray<ObjectProperty> m_CooldownSyncNode1P; // 0x20c
	TArray<ObjectProperty> m_CooldownSyncNode3P; // 0x21c
	TArray<ObjectProperty> m_DeviceEquippedNode1P; // 0x22c
	TArray<ObjectProperty> m_DeviceEquippedNode3P; // 0x23c
	TArray<ObjectProperty> m_BlendByRecoilTimeNodes; // 0x24c
	ObjectProperty m_WhileFiringCameraAnimInst; // 0x25c
	float m_fWhileFiringCameraAnimBlendInTime; // 0x264
	float m_fWhileFiringCameraAnimBlendOutTime; // 0x268
	FPointer m_RandomShotSpreadStream; // 0x26c
	int32_t m_nLastSetShotSpreadSeed; // 0x274
	ObjectProperty m_GameplayCurves; // 0x278
	float m_fRecoilTimer; // 0x280
	float m_fTransitionAmount; // 0x284
	float m_fTransitionPerSec; // 0x288
	float m_fLastSetWorldFOVInterp; // 0x28c
	ObjectProperty m_pWeaponAnimSet; // 0x290
	ObjectProperty m_pPutAwayAnimSet; // 0x298
	ObjectProperty m_pBucketAnimSet; // 0x2a0
	FVector m_vZoomCameraOffset; // 0x2a8
	float m_fSimulatedDeviceCooldown; // 0x2b4
	int32_t m_nLastAmmoAmount; // 0x2b8
};

struct UTgInventoryObject_Listen_ApplyEffectOnDeviceBase {
	TArray<ObjectProperty> m_pEffectGroups; // 0xc8
	TArray<ObjectProperty> m_pAffectedPawns; // 0xd8
};

struct ATgHoldSpot {
	ObjectProperty HoldVehicle; // 0x3a4
};

struct UUIDataLeagueTier {
	ObjectProperty pLeague; // 0x60
	Fdword dwTierId; // 0x68
};

struct UMaterial {
	ObjectProperty PhysMaterial; // 0x254
	UPhysicalMaterial* PhysicalMaterial; // 0x25c
	ObjectProperty PhysMaterialMask; // 0x264
	int32_t PhysMaterialMaskUVChannel; // 0x26c
	ObjectProperty BlackPhysicalMaterial; // 0x270
	ObjectProperty WhitePhysicalMaterial; // 0x278
	FColorMaterialInput DiffuseColor; // 0x280
	FScalarMaterialInput DiffusePower; // 0x2bc
	FColorMaterialInput SpecularColor; // 0x2f8
	FScalarMaterialInput SpecularPower; // 0x334
	FVectorMaterialInput Normal; // 0x370
	FColorMaterialInput EmissiveColor; // 0x3b4
	FScalarMaterialInput Opacity; // 0x3f0
	FScalarMaterialInput OpacityMask; // 0x42c
	float OpacityMaskClipValue; // 0x468
	float ShadowDepthBias; // 0x46c
	FVector2MaterialInput Distortion; // 0x470
	EBlendMode BlendMode; // 0x4b0
	EMaterialLightingModel LightingModel; // 0x4b1
	EMaterialDepthModifier DepthModificationMode; // 0x4b2
	EMaterialTessellationMode D3D11TessellationMode; // 0x4b3
	FColorMaterialInput CustomLighting; // 0x4b4
	FColorMaterialInput CustomSkylightDiffuse; // 0x4f0
	FVectorMaterialInput AnisotropicDirection; // 0x52c
	FScalarMaterialInput TwoSidedLightingMask; // 0x570
	FColorMaterialInput TwoSidedLightingColor; // 0x5ac
	FVectorMaterialInput WorldPositionOffset; // 0x5e8
	FVectorMaterialInput WorldDisplacement; // 0x62c
	FScalarMaterialInput TessellationMultiplier; // 0x670
	FColorMaterialInput SubsurfaceInscatteringColor; // 0x6ac
	FColorMaterialInput SubsurfaceAbsorptionColor; // 0x6e8
	FScalarMaterialInput SubsurfaceScatteringRadius; // 0x724
	FVectorMaterialInput CustomPixelShaderVector; // 0x760
	FScalarMaterialInput PixelDepthModifier; // 0x7a4
	char EnableSubsurfaceScattering : 1; // 0x7e0
	char EnableSeparateTranslucency : 1; // 0x7e0
	char bEnableMaskedAntialiasing : 1; // 0x7e0
	char TwoSided : 1; // 0x7e0
	char TwoSidedFlipsNormals : 1; // 0x7e0
	char TwoSidedSeparatePass : 1; // 0x7e0
	char bDisableDepthTest : 1; // 0x7e0
	char bSceneTextureRenderBehindTranslucency : 1; // 0x7e0
	char bAllowFog : 0; // 0x7e0
	char bTranslucencyReceiveDominantShadowsFromStatic : 0; // 0x7e0
	char bTranslucencyInheritDominantShadowsFromOpaque : 0; // 0x7e0
	char bAllowTranslucencyDoF : 0; // 0x7e0
	char bUseOneLayerDistortion : 0; // 0x7e0
	char bUseLitTranslucencyDepthPass : 0; // 0x7e0
	char bUseLitTranslucencyPostRenderDepthPass : 0; // 0x7e0
	char bCastLitTranslucencyShadowAsMasked : 0; // 0x7e0
	char bUsedAsLightFunction : 0; // 0x7e0
	char bUsedWithFogVolumes : 0; // 0x7e0
	char bUsedAsSpecialEngineMaterial : 0; // 0x7e0
	char bUsedWithSkeletalMesh : 0; // 0x7e0
	char bUsedWithTerrain : 0; // 0x7e0
	char bUsedWithLandscape : 0; // 0x7e0
	char bUsedWithMobileLandscape : 0; // 0x7e0
	char bUsedWithFracturedMeshes : 0; // 0x7e0
	char bUsedWithParticleSystem : 0; // 0x7e0
	char bUsedWithParticleSprites : 0; // 0x7e0
	char bUsedWithBeamTrails : 0; // 0x7e0
	char bUsedWithParticleSubUV : 0; // 0x7e0
	char bUsedWithSpeedTree : 0; // 0x7e0
	char bUsedWithStaticLighting : 0; // 0x7e0
	char bUsedWithLensFlare : 0; // 0x7e0
	char bUsedWithGammaCorrection : 0; // 0x7e0
	char bUsedWithInstancedMeshParticles : 1; // 0x7e4
	char bUsedWithFluidSurfaces : 1; // 0x7e4
	char bUsedWithDecals : 1; // 0x7e4
	char bUsedWithMaterialEffect : 1; // 0x7e4
	char bUsedWithMorphTargets : 1; // 0x7e4
	char bUsedWithRadialBlur : 1; // 0x7e4
	char bUsedWithInstancedMeshes : 1; // 0x7e4
	char bUsedWithSplineMeshes : 1; // 0x7e4
	char bUsedWithAPEXMeshes : 0; // 0x7e4
	char bUsedWithScreenDoorFade : 0; // 0x7e4
	char bEnableCrackFreeDisplacement : 0; // 0x7e4
	char bTessellationFrustumCulling : 0; // 0x7e4
	char bTessellationBackfaceCulling : 0; // 0x7e4
	char bUseImageBasedReflections : 0; // 0x7e4
	char bForceMaskedPrepass : 0; // 0x7e4
	char bPreferMaskedPrepass : 0; // 0x7e4
	char Wireframe : 0; // 0x7e4
	char bPerPixelCameraVector : 0; // 0x7e4
	char bAllowLightmapSpecular : 0; // 0x7e4
	char bOverrideLowQualitySpecular : 0; // 0x7e4
	char bCleanupUnusedTextures : 0; // 0x7e4
	char bIsFallbackMaterial : 0; // 0x7e4
	char bUsesDistortion : 0; // 0x7e4
	char bIsMasked : 0; // 0x7e4
	char bIsPreviewMaterial : 0; // 0x7e4
	float ImageReflectionNormalDampening; // 0x7e8
	ObjectProperty CookedShaderCache; // 0x7ec
	FPointer MaterialResources[0x3]; // 0x7f4
	FPointer DefaultMaterialInstances[0x3]; // 0x80c
	int32_t EditorX; // 0x824
	int32_t EditorY; // 0x828
	int32_t EditorPitch; // 0x82c
	int32_t EditorYaw; // 0x830
	TArray<ObjectProperty> Expressions; // 0x834
	TArray<FMaterialFunctionInfo> MaterialFunctionInfos; // 0x844
	TMap<None, None> EditorParameters; // 0x854
	TArray<ObjectProperty> ReferencedTextures; // 0x89c
};

struct UTgGameplayCurvesSet_DamageFalloff {
	FRawDistributionFloat DamageFalloff; // 0x64
	char bIsRangeNormalized : 1; // 0x88
	char bExcludeEffectiveRange : 1; // 0x88
};

struct ATgClientHUD {
	int32_t m_nMapId; // 0x5a0
	char m_eState; // 0x5a4
	char m_ePromptType; // 0x5a5
	char m_eCaptureState; // 0x5a6
	char m_bCommitMap : 1; // 0x5a8
	char m_bShowCursor : 1; // 0x5a8
	char m_bCaptureKeys : 1; // 0x5a8
	float m_fFadeTime; // 0x5ac
	float m_fFadeTimer; // 0x5b0
	float m_fReturnTime; // 0x5b4
	float m_fReturnTimer; // 0x5b8
	float m_fControllerTime; // 0x5bc
	float m_fControllerTimer; // 0x5c0
	ObjectProperty m_pMovie; // 0x5c4
	TArray<FString> m_sNeededScenes; // 0x5cc
	TArray<FSceneInfo> m_ScenePreloads; // 0x5dc
	TArray<ObjectProperty> m_SceneStack; // 0x5ec
	TArray<ObjectProperty> m_PopupStack; // 0x5fc
	TArray<ObjectProperty> m_MoviePlayers; // 0x60c
	ObjectProperty m_GAPeach; // 0x61c
	ObjectProperty m_DevMenu; // 0x624
};

struct UUIScene_UIPopupRealMoneyPurchase {
	float m_fDisplayHeight; // 0x154
	int32_t m_nScrollOffset; // 0x158
	int32_t m_nMaxScrollOffset; // 0x15c
	ObjectProperty m_mcTitle; // 0x160
	ObjectProperty m_mcSubtitle; // 0x168
	ObjectProperty m_mcScrollingTF; // 0x170
	ObjectProperty m_mcScrollUpArrow; // 0x178
	ObjectProperty m_mcScrollDownArrow; // 0x180
	ObjectProperty m_DLCPackDisplay; // 0x188
};

struct USwatTurnReachSpec {
	char SpecDirection; // 0xc8
};

struct UMaterialInstance {
	ObjectProperty PhysMaterial; // 0x254
	ObjectProperty Parent; // 0x25c
	ObjectProperty PhysMaterialMask; // 0x264
	int32_t PhysMaterialMaskUVChannel; // 0x26c
	ObjectProperty BlackPhysicalMaterial; // 0x270
	ObjectProperty WhitePhysicalMaterial; // 0x278
	char bHasStaticPermutationResource : 1; // 0x280
	char bStaticPermutationDirty : 1; // 0x280
	char ReentrantFlag : 1; // 0x280
	char bNeedsMaterialFlattening : 1; // 0x280
	char bCleanupUnusedTextures : 1; // 0x280
	ObjectProperty CookedShaderCache; // 0x284
	FPointer StaticParameters[0x3]; // 0x28c
	FPointer StaticPermutationResources[0x3]; // 0x2a4
	FPointer Resources[0x3]; // 0x2bc
	TArray<ObjectProperty> ReferencedTextures; // 0x2d4
	FGuid ParentLightingGuid; // 0x2e4
};

struct ATgDestructibleFactory {
	ComponentProperty LightEnvironment; // 0x2c0
};

struct USeqEvent_AnimNotify {
	FName NotifyName; // 0x128
};

struct UParticleModuleUberRainImpacts {
	FRawDistributionFloat Lifetime; // 0x78
	FRawDistributionVector StartSize; // 0x9c
	FRawDistributionVector StartRotation; // 0xc0
	char bInheritParent : 1; // 0xe4
	char MultiplyX : 1; // 0xe4
	char MultiplyY : 1; // 0xe4
	char MultiplyZ : 1; // 0xe4
	char bIsUsingCylinder : 1; // 0xe4
	char bPositive_X : 1; // 0xe4
	char bPositive_Y : 1; // 0xe4
	char bPositive_Z : 1; // 0xe4
	char bNegative_X : 0; // 0xe4
	char bNegative_Y : 0; // 0xe4
	char bNegative_Z : 0; // 0xe4
	char bSurfaceOnly : 0; // 0xe4
	char bVelocity : 0; // 0xe4
	char bRadialVelocity : 0; // 0xe4
	FRawDistributionVector LifeMultiplier; // 0xe8
	FRawDistributionFloat PC_VelocityScale; // 0x10c
	FRawDistributionVector PC_StartLocation; // 0x130
	FRawDistributionFloat PC_StartRadius; // 0x154
	FRawDistributionFloat PC_StartHeight; // 0x178
	CylinderHeightAxis PC_HeightAxis; // 0x19c
	FRawDistributionVector ColorOverLife; // 0x1a0
	FRawDistributionFloat AlphaOverLife; // 0x1c4
};

struct UUIArmoryTalent {
	int32_t m_nBotId; // 0x244
	int32_t m_nTalent; // 0x248
	int32_t m_nEquippedDeviceId; // 0x24c
	ObjectProperty m_pTalentGroup; // 0x250
	ObjectProperty m_mcHeader; // 0x258
	ObjectProperty m_mcTalent[0x4]; // 0x260
	ObjectProperty m_mcTalentDesc[0x4]; // 0x280
	ObjectProperty m_mcTalentName[0x4]; // 0x2a0
	ObjectProperty m_mcTalentType[0x4]; // 0x2c0
	ObjectProperty m_mcTalentIcon[0x4]; // 0x2e0
	ObjectProperty m_mcTalentLock[0x4]; // 0x300
	ObjectProperty m_mcTalentTexture[0x4]; // 0x320
};

struct USeqAct_PlayMusicTrack {
	FMusicTrackStruct MusicTrack; // 0x108
};

struct UTgAIBehaviorCondition_AtJumpLocation {
	float Tolerance; // 0x98
};

struct ATgDevice_VanguardCharge {
	FPointer VfTable_ITgDeviceInterface_MoveSpeedMultiplier; // 0xb60
	DelegateProperty __InterruptFiringDelegate__Delegate; // 0xb68
};

struct UDistributionFloatConstantCurve {
	FInterpCurveFloat ConstantCurve; // 0x7c
};

struct USoundNodeModulator {
	float PitchMin; // 0x74
	float PitchMax; // 0x78
	float VolumeMin; // 0x7c
	float VolumeMax; // 0x80
	FRawDistributionFloat PitchModulation; // 0x84
	FRawDistributionFloat VolumeModulation; // 0xa8
};

struct USpeedTreeActorFactory {
	ObjectProperty SpeedTree; // 0x9c
};

struct ATgDeploy_Geometry {
	TArray<ObjectProperty> m_OverlappingActors; // 0x448
	TArray<FVector> m_DesiredPushDirection; // 0x458
	char m_bPushOverlappingActors : 1; // 0x468
	char m_bAllyPassthrough : 1; // 0x468
	char m_bEnemyPassthrough : 1; // 0x468
	float m_fPushFactor; // 0x46c
};

struct UParticleModuleMeshRotationRateMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x68
};

struct UTgTimerManager {
	FPointer VfTable_FTickableObject; // 0x60
	TMap<None, None> m_TimerMap; // 0x68
	char m_bActive : 1; // 0xb0
	char m_bGameWasPaused : 1; // 0xb0
};

struct UPComJsonHandler {
	ObjectProperty m_pImageDownloader; // 0x60
	FPointer m_pCallbackObject; // 0x68
	FString m_strUrl; // 0x70
	FString m_strDownloadDir; // 0x80
	FString m_strLocalDir; // 0x90
	FString m_strJson; // 0xa0
	FString m_strName; // 0xb0
	FPointer m_pHttp; // 0xc0
};

struct UTgAnimBlendBySpeed {
	ObjectProperty m_TgPawn; // 0x178
	ESpeedType m_SpeedType; // 0x180
	TArray<FResetSynchGroup> ResetSynchGroups; // 0x184
	char m_bIgnoreRootMotion : 1; // 0x194
	char m_bIgnoreZVelocity : 1; // 0x194
	char m_bNotifyOwnerOnChildChange : 1; // 0x194
	char m_bEnableClassOverrides : 1; // 0x194
	TArray<int32_t> m_WalkChildren; // 0x198
	TArray<int32_t> m_SprintChildren; // 0x1a8
	TArray<float> m_BaseSpeed; // 0x1b8
	TArray<EPhysics> m_IgnoredPhysics; // 0x1c8
	int32_t m_nIndexToOverride; // 0x1d8
	float m_fBaseSpeedRecon; // 0x1dc
	float m_fBaseSpeedRobotics; // 0x1e0
	float m_fBaseSpeedAssault; // 0x1e4
	float m_fBaseSpeedMedic; // 0x1e8
	float m_fBaseSpeedReconFemale; // 0x1ec
	float m_fBaseSpeedRoboticsFemale; // 0x1f0
	float m_fBaseSpeedAssaultFemale; // 0x1f4
	float m_fBaseSpeedMedicFemale; // 0x1f8
	float m_fBaseSpeedReconCity; // 0x1fc
	float m_fBaseSpeedRoboticsCity; // 0x200
	float m_fBaseSpeedAssaultCity; // 0x204
	float m_fBaseSpeedMedicCity; // 0x208
	float m_fBaseSpeedReconFemaleCity; // 0x20c
	float m_fBaseSpeedRoboticsFemaleCity; // 0x210
	float m_fBaseSpeedAssaultFemaleCity; // 0x214
	float m_fBaseSpeedMedicFemaleCity; // 0x218
};

struct USeqVar_Character {
	APawn* PawnClass; // 0xc4
};

struct USoundNodeModulatorContinuous {
	FRawDistributionFloat PitchModulation; // 0x74
	FRawDistributionFloat VolumeModulation; // 0x98
};

struct APortalTeleporter {
	ObjectProperty SisterPortal; // 0x298
	int32_t TextureResolutionX; // 0x2a0
	int32_t TextureResolutionY; // 0x2a4
	ObjectProperty MyMarker; // 0x2a8
	char bMovablePortal : 1; // 0x2b0
	char bAlwaysTeleportNonPawns : 1; // 0x2b0
	char bCanTeleportVehicles : 1; // 0x2b0
};

struct USeqAct_SetVelocity {
	FVector VelocityDir; // 0x108
	float VelocityMag; // 0x114
	char bVelocityRelativeToActorRotation : 1; // 0x118
};

struct UUIData_PlayerMatchRecord {
	int32_t nBotId; // 0x60
	int32_t nPlayerId; // 0x64
	Fdword dwCharacterId; // 0x68
	int32_t nLevel; // 0x6c
	int32_t nKills; // 0x70
	int32_t nDeaths; // 0x74
	int32_t nAssists; // 0x78
	int32_t nEarnedCredits; // 0x7c
	int32_t nHealingPlayer; // 0x80
	int32_t nHealingBot; // 0x84
	int32_t nHealingTotal; // 0x88
	int32_t nSelfHealing; // 0x8c
	int32_t nDmgTaken; // 0x90
	int32_t nDmgPlayer; // 0x94
	int32_t nDmgBot; // 0x98
	int32_t nDmgTotal; // 0x9c
	int32_t nSoloKills; // 0xa0
	int32_t nFlankKills; // 0xa4
	int32_t nMultikill; // 0xa8
	int32_t nKillstreak; // 0xac
	int32_t nDmgStructure; // 0xb0
	int32_t nDmgMitigated; // 0xb4
	int32_t nObjectiveTime; // 0xb8
	int32_t nCards[0x5]; // 0xbc
	int32_t nCardLevels[0x5]; // 0xd0
	int32_t nLegendary; // 0xe4
	int32_t nLegendaryLevel; // 0xe8
	int32_t nPurchasedItems[0x4]; // 0xec
	int32_t nPurchasedItemLevels[0x4]; // 0xfc
	int32_t nMountItemId; // 0x10c
	int32_t nEmoteItemId; // 0x110
	int32_t nMVPPoseItemId; // 0x114
	int32_t nSprayItemId; // 0x118
	int32_t nTitleItemId; // 0x11c
	int32_t nTaskForce; // 0x120
	char bAlly : 1; // 0x124
	char bLocal : 1; // 0x124
	char bReported : 1; // 0x124
	FString sPlayer; // 0x128
	FUniqueNetId ConsoleUniqueId; // 0x138
	Fdword dwPortalId; // 0x140
};

struct ATgTutorialVolume {
	char m_bHasLocalPawn : 1; // 0x2bc
	char m_bHasSeenLocalPawnBefore : 1; // 0x2bc
};

struct ADebugCameraController {
	FName PrimaryKey; // 0x77c
	FName SecondaryKey; // 0x784
	FName UnselectKey; // 0x78c
	char bShowSelectedInfo : 1; // 0x794
	char bDrawDebugText : 1; // 0x794
	char bIsFrozenRendering : 1; // 0x794
	AHUD* HUDClass; // 0x798
	ObjectProperty OriginalControllerRef; // 0x7a0
	ObjectProperty OriginalPlayer; // 0x7a8
	ComponentProperty DrawFrustum; // 0x7b0
	ObjectProperty SelectedActor; // 0x7b8
	ComponentProperty SelectedComponent; // 0x7c0
};

struct UTgGameDataHandler {
	ObjectProperty m_Game; // 0x130
};

struct UGFxMoviePlayer {
	FPointer pMovie; // 0x60
	FPointer pCaptureKeys; // 0x68
	FPointer pFocusIgnoreKeys; // 0x70
	TMap<None, None> ASUClasses; // 0x78
	TMap<None, None> ASUObjects; // 0xc0
	int32_t NextASUObject; // 0x108
	ObjectProperty MovieInfo; // 0x10c
	char bMovieIsOpen : 1; // 0x114
	char bDisplayWithHudOff : 1; // 0x114
	char bEnableGammaCorrection : 1; // 0x114
	char bWidgetsInitializedThisFrame : 1; // 0x114
	char bLogUnhandedWidgetInitializations : 1; // 0x114
	char bAllowInput : 1; // 0x114
	char bAllowFocus : 1; // 0x114
	char bAutoPlay : 1; // 0x114
	char bPauseGameWhileActive : 0; // 0x114
	char bDisableWorldRendering : 0; // 0x114
	char bCaptureWorldRendering : 0; // 0x114
	char bCloseOnLevelChange : 0; // 0x114
	char bOnlyOwnerFocusable : 0; // 0x114
	char bForceFullViewport : 0; // 0x114
	char bDiscardNonOwnerInput : 0; // 0x114
	char bCaptureInput : 0; // 0x114
	char bCaptureMouseInput : 0; // 0x114
	char bIgnoreMouseInput : 0; // 0x114
	char bAllowArrowKeyNav : 0; // 0x114
	char bIsSplitscreenLayoutModified : 0; // 0x114
	char bShowHardwareMouseCursor : 0; // 0x114
	char bBlurLesserMovies : 0; // 0x114
	char bHideLesserMovies : 0; // 0x114
	char bIsPriorityBlurred : 0; // 0x114
	char bIsPriorityHidden : 0; // 0x114
	char bIgnoreVisibilityEffect : 0; // 0x114
	char bIgnoreBlurEffect : 0; // 0x114
	ObjectProperty RenderTexture; // 0x118
	int32_t LocalPlayerOwnerIndex; // 0x120
	ObjectProperty ExternalInterface; // 0x124
	TArray<FName> CaptureKeys; // 0x12c
	TArray<FName> FocusIgnoreKeys; // 0x13c
	TArray<FExternalTexture> ExternalTextures; // 0x14c
	TArray<FSoundThemeBinding> SoundThemes; // 0x15c
	GFxTimingMode TimingMode; // 0x16c
	GFxRenderTextureMode RenderTextureMode; // 0x16d
	char Priority; // 0x16e
	TArray<FGFxWidgetBinding> WidgetBindings; // 0x170
	TMap<None, None> WidgetPathBindings; // 0x180
	ObjectProperty SplitscreenLayoutObject; // 0x1c8
	int32_t SplitscreenLayoutYAdjust; // 0x1d0
	FGFxStoredViewportParams m_StoredViewportParams; // 0x1d4
	DelegateProperty __OnPostAdvance__Delegate; // 0x1e8
};

struct UGameCrowdBehavior_RunFromPanic {
	ObjectProperty PanicFocus; // 0x9c
};

struct USkelControlLimb {
	FVector EffectorLocation; // 0xd0
	EBoneControlSpace EffectorLocationSpace; // 0xdc
	EBoneControlSpace JointTargetLocationSpace; // 0xdd
	EBoneControlSpace JointOffsetSpace; // 0xde
	EAxis BoneAxis; // 0xdf
	EAxis JointAxis; // 0xe0
	FName EffectorSpaceBoneName; // 0xe4
	FVector JointTargetLocation; // 0xec
	FName JointTargetSpaceBoneName; // 0xf8
	FVector JointOffset; // 0x100
	FName JointOffsetBoneName; // 0x10c
	char bInvertBoneAxis : 1; // 0x114
	char bInvertJointAxis : 1; // 0x114
	char bRotateJoint : 1; // 0x114
	char bMaintainEffectorRelRot : 1; // 0x114
	char bTakeRotationFromEffectorSpace : 1; // 0x114
	char bAllowStretching : 1; // 0x114
	char m_bSnapEffectorToBoneLocation : 1; // 0x114
	char bMaxLength : 1; // 0x114
	FVector2D StretchLimits; // 0x118
	FName StretchRollBoneName; // 0x120
	float MaxLengthPct; // 0x128
};

struct UTgAnimNodeAdditiveBlending {
	char m_bSetStrengthFromAnimNode : 1; // 0x128
	char m_bInvertStrengthFromAnimNode : 1; // 0x128
	char m_bInitializedCachedNodeList : 1; // 0x128
	TArray<FName> m_StrengthAnimNodeNameList; // 0x12c
	TArray<EEmote> m_StrengthEmoteList; // 0x13c
	TArray<ObjectProperty> m_CachedNodeList; // 0x14c
	TArray<ObjectProperty> m_CachedEmoteSequences; // 0x15c
};

struct UTgAchievement_Headshot {
	int32_t m_nHeadshotsWithoutMissing; // 0x90
};

struct UUIDataGoals {
	ObjectProperty m_GoldLimit; // 0x70
	ObjectProperty m_GoldLimitBoosted; // 0x78
	ObjectProperty m_VIPLimit; // 0x80
	ObjectProperty m_VIPLimitBoosted; // 0x88
	TArray<ObjectProperty> m_Ranked; // 0x90
	TMap<None, None> m_CurrencyStats; // 0xa0
	TMap<None, None> m_WOTDByBotId; // 0xe8
	ObjectProperty m_PlayedRankedTracker; // 0x130
	TMap<None, None> m_Goals; // 0x138
	TArray<ObjectProperty> m_ChallengeList; // 0x180
	TArray<ObjectProperty> m_QuestList; // 0x190
	ObjectProperty m_ChampionQuest; // 0x1a0
	ObjectProperty m_DailyLoginsQuest; // 0x1a8
	ObjectProperty m_LoreQuest; // 0x1b0
	TArray<ObjectProperty> m_QuestsCompleted; // 0x1b8
	char m_bQuestsSeenToday : 1; // 0x1c8
	char m_bPlayerLoggedIn : 1; // 0x1c8
	char m_bRewardClaimedToday : 1; // 0x1c8
	char m_bDayHasRolledOver : 1; // 0x1c8
	char m_bHasQuestProgress : 1; // 0x1c8
	char m_bHasQuestActivities : 1; // 0x1c8
	char m_bHasQuestRewards : 1; // 0x1c8
	char m_bFirstSpecialEventUpdate : 1; // 0x1c8
	char m_bFirstItemQuestUpdate : 0; // 0x1c8
	int32_t m_nConsecutiveRewardDays; // 0x1cc
	int32_t m_nLengthOfDay; // 0x1d0
	float m_fTimeTillNextDay; // 0x1d4
	float m_fTimeTillNextMonth; // 0x1d8
	FDateTimeWrapper m_dtLoginBonusReceived; // 0x1dc
	Fdword m_dwLastLoreQuestGoal; // 0x1e4
	int32_t m_nPlayerLevel; // 0x1e8
};

struct UNavMeshPath_AlongLine {
	FVector Direction; // 0x78
};

struct UUIComponent_AbilityPointsPool {
	char m_bDirty : 1; // 0x120
	int32_t m_nTickCallbackHandle; // 0x124
	ObjectProperty m_mcAbilityPointsPool; // 0x128
	ObjectProperty m_mcAbilityIcon[0x4]; // 0x130
	ObjectProperty m_mcPointsFill[0x4]; // 0x150
	ObjectProperty m_mcPointsText[0x4]; // 0x170
	ObjectProperty m_mcTalentFocusFrame[0x4]; // 0x190
	float m_fFillWidth; // 0x1b0
	int32_t m_nPoints[0x4]; // 0x1b4
	AbilityModifiedByDevice m_eFocusedAbility; // 0x1c4
};

struct UTgAIBehaviorAction_UseDevice {
	TG_EQUIP_POINT DeviceToUse; // 0x94
	EUseDeviceAimType aimType; // 0x95
	char bContinuousFire : 1; // 0x98
	char bPayNoEnergy : 1; // 0x98
};

struct UOnlineGameSearch {
	int32_t MaxSearchResults; // 0xa0
	FLocalizedStringSetting Query; // 0xa4
	char bIsLanQuery : 1; // 0xb0
	char bUsesArbitration : 1; // 0xb0
	char bIsSearchInProgress : 1; // 0xb0
	UOnlineGameSettings* GameSettingsClass; // 0xb4
	TArray<FOnlineGameSearchResult> Results; // 0xbc
	FOverrideSkill ManualSkillOverride; // 0xcc
	TArray<FNamedObjectProperty> NamedProperties; // 0x100
	FOnlineGameSearchQuery FilterQuery; // 0x110
	FString AdditionalSearchCriteria; // 0x130
	int32_t PingBucketSize; // 0x140
	int32_t NumPingProbes; // 0x144
	int32_t MaxPingBytes; // 0x148
	FString SessionTemplateName; // 0x14c
};

struct UUIScene_UIShop {
	UISHOP_STATE m_eState; // 0x154
	ObjectProperty m_pTabs; // 0x158
	ObjectProperty m_pBuyCrowns; // 0x160
	ObjectProperty m_pItems; // 0x168
	ObjectProperty m_pCrowns; // 0x170
	ObjectProperty m_pRotator; // 0x178
};

struct UInterpTrackFade {
	char bPersistFade : 1; // 0xb8
};

struct UTgAnimBlendByFlying {
	char bAdjustRateByVelocity : 1; // 0x168
	char m_bAdjustRateByAcceleration : 1; // 0x168
	char m_bPreviewJetpackPerBoneBlend : 1; // 0x168
	char m_bIsUsingHandsFreeJetpack : 1; // 0x168
	float m_fUpLoopStartTime; // 0x16c
	EFlyDirTypes LastDirection; // 0x170
	FName m_nmHandsFreeJetpackPerBoneBlendNodeName; // 0x174
	ObjectProperty m_HandsFreeJetpackPerBoneBlendNode; // 0x17c
	float m_fHandsFreeJetpackBlendBias; // 0x184
	FName m_nmHandsFreeJetpackBiasBlendNodeName; // 0x188
	ObjectProperty m_HandsFreeJetpackBiasBlendNode; // 0x190
	ObjectProperty m_TgPawn; // 0x198
};

struct USeqAct_ForceFeedback {
	ObjectProperty FFWaveform; // 0x108
	UWaveFormBase* PredefinedWaveForm; // 0x110
};

struct UTgAnimMetaData_InvisibleWallFailSafe {
	FName WallEnableBaseName; // 0x60
};

struct USeqEvent_MobileZoneBase {
	FString TargetZoneName; // 0x128
};

struct UTgAnimNodeBlendByCombat {
	ObjectProperty m_TgP; // 0x168
};

struct UTgSkelCon_Spinner {
	float m_fDegreesPerSecond; // 0x100
	FVector m_vAxis; // 0x104
	char m_PreviewStartStop : 1; // 0x110
	char m_bSpinDownToZero : 1; // 0x110
	char m_bIsSpinning : 1; // 0x110
	char m_bSpinningUp : 1; // 0x110
	char m_bSpinningDown : 1; // 0x110
	char m_bRotateToTargetRotation : 1; // 0x110
	float m_fSpinUpTime; // 0x114
	float m_fSpinDownTime; // 0x118
	float m_fCurrentDegreesPerSecond; // 0x11c
	float m_fLerpTime; // 0x120
	FRotator m_TargetRotation; // 0x124
	float m_TimeToInterpToTargetRotation; // 0x130
	int32_t m_nRotationSpeedState; // 0x134
	TArray<float> m_fRotationSpeedStateMultipliers; // 0x138
	TArray<DelegateProperty> m_OnSpinUpFinishedCallbacks; // 0x148
	TArray<DelegateProperty> m_OnSpinDownFinishedCallbacks; // 0x158
	DelegateProperty __OnSpinUpFinishedEvent__Delegate; // 0x168
	DelegateProperty __OnSpinDownFinishedEvent__Delegate; // 0x178
};

struct UTgAISquad {
	FPointer VfTable_FTickableObject; // 0x60
	char s_bOpen : 1; // 0x68
	char s_bShouldSpread : 1; // 0x68
	TArray<ObjectProperty> s_MemberList; // 0x6c
	ObjectProperty s_Factory; // 0x7c
	ObjectProperty s_CurrentTarget; // 0x84
	TArray<ObjectProperty> s_TargetList; // 0x8c
	ObjectProperty s_LastKiller; // 0x9c
	float s_fNextSpreadTime; // 0xa4
};

struct UDamageType {
	char bArmorStops : 1; // 0x60
	char bCausedByWorld : 1; // 0x60
	char bExtraMomentumZ : 1; // 0x60
	char bCausesFracture : 1; // 0x60
	char bRadialDamageVelChange : 1; // 0x60
	float KDamageImpulse; // 0x64
	float KDeathVel; // 0x68
	float KDeathUpKick; // 0x6c
	float RadialDamageImpulse; // 0x70
	float VehicleDamageScaling; // 0x74
	float VehicleMomentumScaling; // 0x78
	ObjectProperty DamagedFFWaveform; // 0x7c
	ObjectProperty KilledFFWaveform; // 0x84
	float FracturedMeshDamage; // 0x8c
};

struct UApexDynamicComponent {
	FPointer ComponentDynamicResources; // 0x2b0
};

struct UOnlinePlaylistManager {
	FPointer VfTable_FTickableObject; // 0x60
	TArray<FPlaylist> Playlists; // 0x68
	TArray<FString> PlaylistFileNames; // 0x78
	TArray<FName> DatastoresToRefresh; // 0x88
	int32_t DownloadCount; // 0x98
	int32_t SuccessfulCount; // 0x9c
	int32_t VersionNumber; // 0xa0
	TArray<FPlaylistPopulation> PopulationData; // 0xa4
	int32_t WorldwideTotalPlayers; // 0xb4
	int32_t RegionTotalPlayers; // 0xb8
	TScriptInterface<Class> TitleFileInterface; // 0xbc
	FString PopulationFileName; // 0xcc
	float NextPlaylistPopulationUpdateTime; // 0xdc
	float PlaylistPopulationUpdateInterval; // 0xe0
	int32_t MinPlaylistIdToReport; // 0xe4
	int32_t CurrentPlaylistId; // 0xe8
	FName EventsInterfaceName; // 0xec
	int32_t DataCenterId; // 0xf4
	FString DataCenterFileName; // 0xf8
	float LastPlaylistDownloadTime; // 0x108
	float PlaylistRefreshInterval; // 0x10c
	DelegateProperty __OnReadPlaylistComplete__Delegate; // 0x110
	DelegateProperty __OnPlaylistPopulationDataUpdated__Delegate; // 0x120
};

struct USeqCond_CompareInt {
	int32_t ValueA; // 0xec
	int32_t ValueB; // 0xf0
};

struct USeqVar_ObjectVolume {
	float LastUpdateTime; // 0xc4
	TArray<ObjectProperty> ContainedObjects; // 0xc8
	TArray<UObject*> ExcludeClassList; // 0xd8
	char bCollidingOnly : 1; // 0xe8
};

struct UActorFactoryPhysicsAsset {
	ObjectProperty PhysicsAsset; // 0x9c
	ObjectProperty SkeletalMesh; // 0xa4
	char bStartAwake : 1; // 0xac
	char bDamageAppliesImpulse : 1; // 0xac
	char bNotifyRigidBodyCollision : 1; // 0xac
	char bUseCompartment : 1; // 0xac
	char bCastDynamicShadow : 1; // 0xac
	FVector InitialVelocity; // 0xb0
	FVector DrawScale3D; // 0xbc
};

struct UScriptedTexture {
	char bNeedsUpdate : 1; // 0x128
	char bSkipNextClear : 1; // 0x128
	DelegateProperty __Render__Delegate; // 0x12c
};

struct UParticleModuleTrailSpawn {
	ComponentProperty SpawnDistanceMap; // 0x68
	float MinSpawnVelocity; // 0x70
};

struct UParticleModuleLifetime {
	FRawDistributionFloat Lifetime; // 0x68
};

struct USeqAct_ApplySoundNode {
	ObjectProperty PlaySound; // 0x108
	ObjectProperty ApplyNode; // 0x110
};

struct USeqAct_ChangeCollision {
	char bCollideActors : 1; // 0x108
	char bBlockActors : 1; // 0x108
	char bIgnoreEncroachers : 1; // 0x108
	ECollisionType CollisionType; // 0x10c
};

struct UUIDataStore_OnlinePlaylists {
	FString ProviderClassName; // 0x98
	UUIResourceDataProvider* ProviderClass; // 0xa8
	TArray<ObjectProperty> RankedDataProviders; // 0xb0
	TArray<ObjectProperty> UnrankedDataProviders; // 0xc0
	TArray<ObjectProperty> RecModeDataProviders; // 0xd0
	TArray<ObjectProperty> PrivateDataProviders; // 0xe0
	ObjectProperty PlaylistMan; // 0xf0
};

struct UTgSpecialFxLightManager {
	char c_FxLightsEnabled : 1; // 0x60
	char c_FxLightsUnconstrained : 1; // 0x60
	int32_t c_FxLightsMaxActive; // 0x64
	int32_t c_FxLightsMaxDying; // 0x68
	TArray<FPointer> m_ActiveEmitters; // 0x6c
	TArray<FPointer> m_DyingEmitters; // 0x7c
	ObjectProperty c_LocalPawn; // 0x8c
};

struct UTgSeqAct_SetUIClock {
	char ShowAlarmTexture : 1; // 0x108
	char UseProgressBar : 1; // 0x108
	char IsCountingDown : 1; // 0x108
};

struct UNavMeshGoal_At {
	FVector Goal; // 0x7c
	float GoalDist; // 0x88
	char bKeepPartial : 1; // 0x8c
	char bWeightPartialByDist : 1; // 0x8c
	char bGoalInSamePolyAsAnchor : 1; // 0x8c
	float PartialDistSq; // 0x90
	FPointer GoalPoly; // 0x94
	FPointer PartialGoal; // 0x9c
};

struct ATgCapturePoint {
	ObjectProperty s_CollisionProxy; // 0x280
	ObjectProperty r_RepInfo; // 0x288
	float m_fCollisionProxyRadius; // 0x290
	float m_fCollisionProxyHeight; // 0x294
	float m_fBaseTransitionSpeed; // 0x298
	float m_fTransitionSpeedBuff; // 0x29c
	float m_fCurrentTransitionSpeed; // 0x2a0
	ObjectProperty c_OwnershipChangedKismetNode; // 0x2a4
	ObjectProperty s_BotSpawners[0x2]; // 0x2ac
	ObjectProperty m_CurrentBotSpawners[0x2]; // 0x2bc
	ObjectProperty s_NeutralBotSpawner; // 0x2cc
	int32_t m_CapturePointIndex; // 0x2d4
	float s_fReplenishBotTime; // 0x2d8
	float s_fRemainingReplenishBotTime; // 0x2dc
	float s_fFriendlyReplenishBuffPct; // 0x2e0
	float m_fRegenUpdateTimer; // 0x2e4
	float m_fOwnedManaRegen; // 0x2e8
	float m_fOwnedHealthRegen; // 0x2ec
	ObjectProperty s_GameInfo; // 0x2f0
	int32_t m_nTF1Count; // 0x2f8
	int32_t m_nTF2Count; // 0x2fc
	float m_fLastEnemyKillVoxTimestamp; // 0x300
	int32_t m_nLaneNumber; // 0x304
	ComponentProperty m_WorldIconSprite; // 0x308
};

struct ATgDevice_OverGrowth {
	ObjectProperty m_VineDevice; // 0xaec
};

struct UTgAIBehaviorCondition_GameType {
	TG_GAME_TYPE GameType; // 0x98
};

struct UTgAIBehaviorCondition_NearbyTargetTypeDelta {
	int32_t TargetTypeThreshold; // 0x9c
	ECombatTargetType TargetType; // 0xa0
	char bMustBeInForwardCone : 1; // 0xa4
	float ForwardConeAngle; // 0xa8
};

struct UTgAnimNotify_PlayParticleEffect_Skinned {
	TArray<FPPE_Skin> m_SkinOverrideList; // 0x98
	char m_bApplyTeamColor : 1; // 0xa8
};

struct ATgStaticMeshActorGrass {
	float m_fTargetScale; // 0x2a4
	FVector m_TargetScale3D; // 0x2a8
	float m_fScaleTransitionTime; // 0x2b4
};

struct USeqAct_SubtractFloat {
	float ValueA; // 0x108
	float ValueB; // 0x10c
	float FloatResult; // 0x110
	int32_t IntResult; // 0x114
};

struct UPBRuleNodeAlternate {
	EProcBuildingAxis RepeatAxis; // 0x70
	float ASize; // 0x74
	float BMaxSize; // 0x78
	char bInvertPatternOrder : 1; // 0x7c
	char bEqualSizeAB : 1; // 0x7c
};

struct AAutoTestManager {
	char bAutomatedPerfTesting : 1; // 0x280
	char bAutoContinueToNextRound : 1; // 0x280
	char bUsingAutomatedTestingMapList : 1; // 0x280
	char bAutomatedTestingWithOpen : 1; // 0x280
	char bExitOnCyclesComplete : 1; // 0x280
	char bCheckingForFragmentation : 1; // 0x280
	char bCheckingForMemLeaks : 1; // 0x280
	char bIsDoingASimplePerfRun : 1; // 0x280
	char bDoingASentinelRun : 0; // 0x280
	char bSentinelRunInProgress : 0; // 0x280
	char bSentinelStreamingLevelStillLoading : 0; // 0x280
	int32_t AutomatedPerfRemainingTime; // 0x284
	int32_t AutomatedTestingMapIndex; // 0x288
	TArray<FString> AutomatedMapTestingList; // 0x28c
	int32_t NumAutomatedMapTestingCycles; // 0x29c
	int32_t NumberOfMatchesPlayed; // 0x2a0
	int32_t NumMapListCyclesDone; // 0x2a4
	FString AutomatedTestingExecCommandToRunAtStartMatch; // 0x2a8
	FString AutomatedTestingExecCommandToRunAtStartMatchOnPC; // 0x2b8
	FString AutomatedMapTestingTransitionMap; // 0x2c8
	FString SentinelTaskDescription; // 0x2d8
	FString SentinelTaskParameter; // 0x2e8
	FString SentinelTagDesc; // 0x2f8
	ObjectProperty SentinelPC; // 0x308
	TArray<FVector> SentinelTravelArray; // 0x310
	int32_t SentinelNavigationIdx; // 0x320
	int32_t SentinelIdx; // 0x324
	int32_t NumRotationsIncrement; // 0x328
	int32_t TravelPointsIncrement; // 0x32c
	int32_t NumMinutesPerMap; // 0x330
	int32_t TotalNumMinutesToRun; // 0x334
	float ProfilingInterval; // 0x338
	TArray<FString> CommandsToRunAtEachTravelTheWorldNode; // 0x33c
	FString CommandStringToExec; // 0x34c
};

struct UTgAnimTreeComment {
	char m_bDrawBox : 1; // 0x68
};

struct UParticleModuleMeshRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x90
};

struct ULensFlareComponent {
	ObjectProperty Template; // 0x24c
	ComponentProperty PreviewInnerCone; // 0x254
	ComponentProperty PreviewOuterCone; // 0x25c
	ComponentProperty PreviewRadius; // 0x264
	char bAutoActivate : 1; // 0x26c
	char bIsActive : 1; // 0x26c
	char bHasTranslucency : 1; // 0x26c
	char bHasUnlitTranslucency : 1; // 0x26c
	char bHasUnlitDistortion : 1; // 0x26c
	char bUsesSceneColor : 1; // 0x26c
	char bHasSeparateTranslucency : 1; // 0x26c
	char bUseTrueConeCalculation : 1; // 0x26c
	char bVisibleForMobile : 0; // 0x26c
	float OuterCone; // 0x270
	float InnerCone; // 0x274
	float ConeFudgeFactor; // 0x278
	float Radius; // 0x27c
	float MinStrength; // 0x280
	FLinearColor SourceColor; // 0x284
	TArray<FLensFlareElementMaterials> Materials; // 0x294
	FPointer ReleaseResourcesFence; // 0x2a4
	float NextTraceTime; // 0x2ac
};

struct UTgSeqAct_TutorialTips {
	int32_t nMsgId; // 0x108
};

struct UUIData_LeagueEOM {
	ObjectProperty m_pLeague; // 0x60
	ObjectProperty m_pTier; // 0x68
	int32_t m_nPointChange; // 0x70
	int32_t m_nCurrentPoints; // 0x74
	int32_t m_nWins; // 0x78
	int32_t m_nLosses; // 0x7c
	int32_t m_nMatchesPlayed; // 0x80
	ObjectProperty m_TierChange; // 0x84
};

struct AInventoryManager {
	ObjectProperty InventoryChain; // 0x280
	ObjectProperty PendingWeapon; // 0x288
	ObjectProperty LastAttemptedSwitchToWeapon; // 0x290
	char bMustHoldWeapon : 1; // 0x298
	TArray<int32_t> PendingFire; // 0x29c
};

struct UUIComponent_ChampionOverview {
	ObjectProperty m_mcDetailsTitle; // 0x120
	ObjectProperty m_mcDetailsSubtitle; // 0x128
	ObjectProperty m_mcDetailsClassIcon; // 0x130
	ObjectProperty m_mcDetailsChampionIcon; // 0x138
	ObjectProperty m_mcBioLock; // 0x140
	ObjectProperty m_mcBioText; // 0x148
	ObjectProperty m_mcBioLockText; // 0x150
	ObjectProperty m_pCollectionOverview; // 0x158
	ObjectProperty m_mcRentalText; // 0x160
	ObjectProperty m_mcRentalTextLabel; // 0x168
	ObjectProperty m_mcRentalTextDuration; // 0x170
	ObjectProperty m_mcUnlockPanel; // 0x178
	ObjectProperty m_mcUnlockPanelPurchase; // 0x180
	ObjectProperty m_mcUnlockPanelPurchasePrice0; // 0x188
	ObjectProperty m_mcUnlockPanelPurchasePrice0Currency; // 0x190
	ObjectProperty m_mcUnlockPanelPurchasePrice1; // 0x198
	ObjectProperty m_mcUnlockPanelPurchasePrice1Currency; // 0x1a0
	ObjectProperty m_mcUnlockPanelRent; // 0x1a8
	ObjectProperty m_mcUnlockPanelRentPrice0; // 0x1b0
	ObjectProperty m_mcUnlockPanelRentPrice0Currency; // 0x1b8
	ObjectProperty m_mcUnlockPanelFreeRotation; // 0x1c0
	ObjectProperty m_mcUnlockPanelInputPrompt; // 0x1c8
	ObjectProperty m_pUnlockChampionButton; // 0x1d0
	ObjectProperty m_pLeaderboardButton; // 0x1d8
};

struct USkelControl_CCD_IK {
	FVector EffectorLocation; // 0xd0
	EBoneControlSpace EffectorLocationSpace; // 0xdc
	FName EffectorSpaceBoneName; // 0xe0
	FVector EffectorTranslationFromBone; // 0xe8
	int32_t NumBones; // 0xf4
	int32_t MaxPerBoneIterations; // 0xf8
	int32_t IterationsCount; // 0xfc
	float Precision; // 0x100
	char bStartFromTail : 1; // 0x104
	char bNoTurnOptimization : 1; // 0x104
	TArray<float> AngleConstraint; // 0x108
	float MaxAngleSteps; // 0x118
};

struct ASplineActor {
	TArray<FSplineConnection> Connections; // 0x280
	FVector SplineActorTangent; // 0x290
	FColor SplineColor; // 0x29c
	char bDisableDestination : 1; // 0x2a0
	char bAlreadyVisited : 1; // 0x2a0
	TArray<ObjectProperty> LinksFrom; // 0x2a4
	ObjectProperty nextOrdered; // 0x2b4
	ObjectProperty prevOrdered; // 0x2bc
	ObjectProperty previousPath; // 0x2c4
	int32_t bestPathWeight; // 0x2cc
	int32_t visitedWeight; // 0x2d0
	FInterpCurveFloat SplineVelocityOverTime; // 0x2d4
};

struct UMcpMessageBase {
	FString McpMessageManagerClassName; // 0x78
	EMcpMessageCompressionType CompressionType; // 0x88
	TArray<FMcpMessageContents> MessageContentsList; // 0x8c
	TArray<FMcpMessageList> MessageLists; // 0x9c
	DelegateProperty __OnCreateMessageComplete__Delegate; // 0xac
	DelegateProperty __OnDeleteMessageComplete__Delegate; // 0xbc
	DelegateProperty __OnQueryMessagesComplete__Delegate; // 0xcc
	DelegateProperty __OnQueryMessageContentsComplete__Delegate; // 0xdc
};

struct UIpNetDriverSteamworks {
	char bSteamSocketsOnly : 1; // 0x228
};

struct USeqAct_GetVectorComponents {
	FVector InVector; // 0x108
	float X; // 0x114
	float Y; // 0x118
	float Z; // 0x11c
};

struct UTgCombinedPostProcessEffect {
	FColor HitEffectColor; // 0x88
	FVector SceneShadows; // 0x8c
	FVector SceneHighLights; // 0x98
	FVector SceneMidTones; // 0xa4
	float SceneDesaturation; // 0xb0
	FVector SceneColorize; // 0xb4
};

struct ATgDevice_Emote {
	ObjectProperty m_CachedPawnOwner; // 0xaec
	char m_bAccelerationInterruptsDevice : 1; // 0xaf4
	char m_bJumpingInterruptsDevice : 1; // 0xaf4
	UTgCameraModule* m_DefaultCameraModuleClass; // 0xaf8
	UTgCameraModule_ThirdPersonVariableHeight* m_FiringCameraModuleClass; // 0xb00
	ObjectProperty m_FiringCameraModule; // 0xb08
	float m_fCameraTweenInTime; // 0xb10
	float m_fCameraTweenOutTime; // 0xb14
	FVector m_vFiringCameraOffset; // 0xb18
};

struct UTgInventoryObject_Listen_MultipleHitBonus {
	TArray<ObjectProperty> pHitActors; // 0xc8
	char bAdjustDamage : 1; // 0xd8
};

struct UMaterialExpressionFresnel {
	float Exponent; // 0xb0
	FExpressionInput Normal; // 0xb4
};

struct UTgSeqEvent_Escort_Despawn_Success {
	int32_t DefendersTaskForce; // 0x128
};

struct USeqAct_PrepareMapChange {
	FName MainLevelName; // 0x120
	TArray<FName> InitiallyLoadedSecondaryLevelNames; // 0x128
	char bIsHighPriority : 1; // 0x138
	char bStatusIsOk : 1; // 0x138
};

struct ATgAIAnnotation {
	FPointer VfTable_IInterface_AIAnnotation; // 0x380
	EAIAnnotationType AnnotationType; // 0x388
	ObjectProperty m_pClaimedBy; // 0x38c
};

struct UTgNavMeshPath_AlongLane {
	int32_t m_nLane; // 0x78
};

struct UTgAnimNodeLockableChannelFire {
	char m_bPlayStartOnLock : 1; // 0x180
	char m_bPlayStartOnUnlock : 1; // 0x180
	char m_bPlayStartAfterLockLost : 1; // 0x180
	char m_bLocked : 1; // 0x180
};

struct UTgSeqAct_MarkSpawnReturn {
	ObjectProperty m_Teleporter; // 0x108
};

struct UUIDataEsportsEventMatchup {
	ObjectProperty pEvent; // 0x60
	ObjectProperty pTeam1; // 0x68
	ObjectProperty pTeam2; // 0x70
	ObjectProperty pSelectedTeam; // 0x78
	Fdword dwGroupId; // 0x80
	Fdword dwTeam1Wins; // 0x84
	Fdword dwTeam2Wins; // 0x88
	Fdword dwMatchCount; // 0x8c
	char bFeatured : 1; // 0x90
	FString sURL; // 0x94
	Fdword dwRoundTypeId; // 0xa4
	FDateTimeWrapper dtStartTime; // 0xa8
	Fdword dwRewardQuantity; // 0xb0
	ObjectProperty pReward; // 0xb4
};

struct UUIComponent_TitleTooltip {
	ObjectProperty m_mcIcon; // 0x120
	ObjectProperty m_mcDescription; // 0x128
	int32_t m_nLastSetItemID; // 0x130
	float m_fTooltipShowDelay; // 0x134
};

struct UTgAnimNodeSelfDestruct {
	int32_t NumberOfLoopsBeforeDestruct; // 0x1bc
	int32_t LoopsCompleted; // 0x1c0
	TArray<FName> ScaleOutSkelControlNames; // 0x1c4
	float TimeRemaingForScaleOut; // 0x1d4
	TArray<ObjectProperty> ScaleOutSkelControls; // 0x1d8
	TArray<float> ScaleOutStartScales; // 0x1e8
	float ScaleOutStartTime; // 0x1f8
};

struct UTgInventoryObject_Listen_ReduceInhandSelfDamage {
	float m_fCachedBaseDamage; // 0xcc
	float m_fCachedBaseKnockback; // 0xd0
};

struct UTgAnimNodeSequence {
	char bAutoPlay : 1; // 0x1ac
	char bResetOnActivate : 1; // 0x1ac
	char HasDynamicLength : 1; // 0x1ac
	char EnableFootControlsOnCease : 1; // 0x1ac
	char SynchronizeGroupOnReplay : 1; // 0x1ac
	char bRandomStartPosition : 1; // 0x1ac
	float ChainedSequenceDuration; // 0x1b0
	FName m_nmDisplayGroup; // 0x1b4
};

struct UUIComponent_StringTitle {
	ObjectProperty m_mcText; // 0x120
};

struct UUIPopupMatchFound {
	char m_bAnim : 1; // 0x244
	float m_fTime; // 0x248
	float m_fTimer; // 0x24c
	ObjectProperty m_mcDesc; // 0x250
	ObjectProperty m_mcName; // 0x258
	ObjectProperty m_mcFrame; // 0x260
	ObjectProperty m_mcTimer; // 0x268
	ObjectProperty m_mcPrompt[0x2]; // 0x270
	ObjectProperty m_mcButton[0x2]; // 0x280
	ObjectProperty m_mcBlocker; // 0x290
	ObjectProperty m_pInputGroup; // 0x298
};

struct UParticleModuleSizeScaleByTime {
	FRawDistributionVector SizeScaleByTime; // 0x68
	char bEnableX : 1; // 0x8c
	char bEnableY : 1; // 0x8c
	char bEnableZ : 1; // 0x8c
};

struct AProjectile {
	float Speed; // 0x280
	float MaxSpeed; // 0x284
	char bSwitchToZeroCollision : 1; // 0x288
	char bBlockedByInstigator : 1; // 0x288
	char bBegunPlay : 1; // 0x288
	char bRotationFollowsVelocity : 1; // 0x288
	char bIgnoreFoliageTouch : 1; // 0x288
	ObjectProperty ZeroCollider; // 0x28c
	ComponentProperty ZeroColliderComponent; // 0x294
	float Damage; // 0x29c
	float DamageRadius; // 0x2a0
	float MomentumTransfer; // 0x2a4
	UDamageType* MyDamageType; // 0x2a8
	ObjectProperty SpawnSound; // 0x2b0
	ObjectProperty ImpactSound; // 0x2b8
	ObjectProperty InstigatorController; // 0x2c0
	ObjectProperty ImpactedActor; // 0x2c8
	float NetCullDistanceSquared; // 0x2d0
	ComponentProperty CylinderComponent; // 0x2d4
};

struct UMaterialExpressionLightmassReplace {
	FExpressionInput Realtime; // 0xb0
	FExpressionInput Lightmass; // 0xe4
};

struct UTgDeviceForm_Minigun {
	char m_bIsADS : 1; // 0x2e8
	int32_t m_nDisplayGroupState; // 0x2ec
	ComponentProperty m_WeaponMesh; // 0x2f0
};

struct ATgGameTipManager {
	TArray<FTipSavedState> m_TipSavedState; // 0x280
	TArray<FGameTipInfo> m_GameTipQueue; // 0x290
	TArray<FGameTipInfo> m_GameTipWorldQueue; // 0x2a0
	TArray<FGameTipInfo> m_GameTipSpecialQueue; // 0x2b0
	char m_bIsActive : 1; // 0x2c0
	ComponentProperty m_AudioComponent; // 0x2c4
	int32_t m_nActiveTip; // 0x2cc
	int32_t m_nPlaySoundTip; // 0x2d0
};

struct UUIComponent_LobbyEquipSlotItem {
	ObjectProperty m_mcTypeIcon; // 0x120
	ObjectProperty m_mcRarity; // 0x128
	ObjectProperty m_mcAudio; // 0x130
	ObjectProperty m_mcIcon; // 0x138
	char m_bHovered : 1; // 0x140
	char m_bSelected : 1; // 0x140
};

struct ATgRoyaleConvergeActor_Plane {
	int32_t r_nConvergeSide; // 0x2d4
};

struct UInterpCurveEdSetup {
	TArray<FCurveEdTab> Tabs; // 0x60
	int32_t ActiveTab; // 0x70
};

struct UTgAIBehaviorAction_SetGoblinState {
	EGoblinState GoblinState; // 0x94
};

struct UMaterialEffect {
	ObjectProperty Material; // 0x88
};

struct UPostProcessChain {
	TArray<ObjectProperty> Effects; // 0x60
};

struct UTgInventoryObject_Listen_TagForLifesteal {
	TArray<ObjectProperty> m_TagActors; // 0xd0
	TArray<float> m_TagTimes; // 0xe0
	ObjectProperty m_CachedFiremode; // 0xf0
};

struct ATgTeleporter {
	int32_t m_nMapObjectId; // 0x3a4
	int32_t m_nMapId; // 0x3a8
	char m_nPreload : 1; // 0x3ac
	char m_bSetTaskForce : 1; // 0x3ac
	char m_bBalanceTaskForce : 1; // 0x3ac
	char m_bIgnoreNonMembers : 1; // 0x3ac
	char m_bUsePlayerStart : 1; // 0x3ac
	char m_bRequestMission : 1; // 0x3ac
	char m_nStartGroup; // 0x3b0
	char m_nTaskForce; // 0x3b1
};

struct UParticleModuleRotation {
	FRawDistributionFloat StartRotation; // 0x68
};

struct UTgAIBehaviorCondition_DistanceFromShield {
	char bMustBeEnemy : 1; // 0x9c
};

struct UTgSeasonTicketManager {
	ObjectProperty m_pMovie; // 0x84
	TArray<ObjectProperty> m_DisplayGroups; // 0x8c
	TMap<None, None> m_MatchupDescriptions; // 0x9c
	TMap<None, None> m_TeamImages; // 0xe4
};

struct USeqAct_SetDamageInstigator {
	ObjectProperty DamageInstigator; // 0x108
};

struct UGameEngine {
	ObjectProperty GPendingLevel; // 0x8a0
	FString PendingLevelPlayerControllerClassName; // 0x8a8
	FURL LastURL; // 0x8b8
	FURL LastRemoteURL; // 0x920
	TArray<FString> ServerActors; // 0x988
	FString TravelURL; // 0x998
	char TravelType; // 0x9a8
	char bWorldWasLoadedThisTick : 1; // 0x9ac
	char bWorldWasLoadedLastTick : 1; // 0x9ac
	char bCheckForMovieCapture : 1; // 0x9ac
	char bTriggerPostLoadMap : 1; // 0x9ac
	char bStartedLoadMapMovie : 1; // 0x9ac
	char bShouldCommitPendingMapChange : 1; // 0x9ac
	char bClearAnimSetLinkupCachesOnLoadMap : 1; // 0x9ac
	char bEnableSecondaryDisplay : 1; // 0x9ac
	char bEnableSecondaryViewport : 0; // 0x9ac
	ObjectProperty OnlineSubsystem; // 0x9b0
	ObjectProperty GamePadLightbarSubsystem; // 0x9b8
	ObjectProperty DLCEnumerator; // 0x9c0
	FString DownloadableContentEnumeratorClassName; // 0x9c8
	ObjectProperty DLCManager; // 0x9d8
	FString DownloadableContentManagerClassName; // 0x9e0
	TArray<FName> LevelsToLoadForPendingMapChange; // 0x9f0
	TArray<ObjectProperty> LoadedLevelsForPendingMapChange; // 0xa00
	FString PendingMapChangeFailureDescription; // 0xa10
	float MaxDeltaTime; // 0xa20
	FString SecondaryViewportClientClassName; // 0xa24
	TArray<ObjectProperty> SecondaryViewportClients; // 0xa34
	TArray<FPointer> SecondaryViewportFrames; // 0xa44
	TArray<FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0xa54
	TArray<ObjectProperty> ObjectReferencers; // 0xa64
	TArray<FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0xa74
	TArray<FNamedNetDriver> NamedNetDrivers; // 0xa84
	TArray<FAnimTag> AnimTags; // 0xa94
};

struct UPath_AlongLine {
	FVector Direction; // 0x6c
};

struct UParticleModuleAcceleration {
	FRawDistributionVector Acceleration; // 0x6c
	char bApplyOwnerScale : 1; // 0x90
};

struct ATgProj_ExtraColliders {
	ObjectProperty m_SecondaryCollisionProxies[0x2]; // 0x51c
	ComponentProperty m_SecondaryDebugProximityDistancePSC[0x2]; // 0x52c
	TArray<FTrackedCollision> m_TrackedCollisions; // 0x53c
};

struct ATgBotFactory_Realm {
	float m_fRefillInterval; // 0x384
	float m_fSpawnMinDist; // 0x388
	float m_fSpawnMaxViewAlignment; // 0x38c
};

struct UTgSeqAct_DisplayObjective {
	int32_t m_nMessageId; // 0x108
};

struct UTgAIBehaviorCondition_IsCombatTargetOfType {
	ECombatTargetType TargetType; // 0x98
};

struct ATgDevice_HealingPotion {
	char s_bQueueDetonation : 1; // 0xaec
	char m_bAttemptingToDetonate : 1; // 0xaec
};

struct UUIDataChampions {
	ObjectProperty m_pActiveChampion; // 0x70
	TArray<ObjectProperty> m_Champions; // 0x78
	TArray<ObjectProperty> m_PvEChampions; // 0x88
	TArray<ObjectProperty> m_Collections; // 0x98
	TMap<None, None> m_PerChampionCollections; // 0xa8
	TMap<None, None> m_ChampionIdToData; // 0xf0
	Fdword m_dwStoreVendorsRequestId; // 0x138
	Fdword m_dwRotationVendorRequestId; // 0x13c
};

struct UTgAnimNotify_AudioGroup {
	ObjectProperty c_PreviewSound; // 0x68
	FName c_SoundCueName; // 0x70
