namespace off {
	constexpr auto GNames = 0x21f0620;
	constexpr auto GObjects = 0x21f0668;
	constexpr auto UEngine = 0x2200158;
}
struct UBTAction_CatchBall {
	float FallTime; // 0x1e8
};

struct UMtxErrors_TA {
	ObjectProperty MicrotransactionFulfillmentRestrictedWallet; // 0x80
	ObjectProperty MicrotransactionFulfillmentRestrictedDaily; // 0x88
};

struct UHttpResponseWindows {
	FPointer Response; // 0x60
	TArray<char> Payload; // 0x68
};

struct UProductSlot_TA {
	FString Label; // 0x60
	FString PluralLabel; // 0x70
	FString Description; // 0x80
	FString OnlineLabel; // 0x90
	int32_t SlotIndex; // 0xa0
	ObjectProperty DefaultProduct_New; // 0xa8
	ObjectProperty ProductTemplate; // 0xb0
	ObjectProperty ProductAssetTemplate; // 0xb8
	ObjectProperty Icon; // 0xc0
	ObjectProperty IconLarge; // 0xc8
	uint32_t bReplicated : 1; // 0xd0
	uint32_t bAlwaysCooked : 1; // 0xd0
	uint32_t bDedicatedServerRelevant : 1; // 0xd0
	uint32_t bAlwaysLoaded : 1; // 0xd0
	uint32_t bDefaultProductAlwaysLoaded : 1; // 0xd0
	uint32_t bAllowLicensedEquip : 1; // 0xd0
	float DropWeight; // 0xd4
};

struct USeqAct_SetLocation {
	uint32_t bSetLocation : 1; // 0x160
	uint32_t bSetRotation : 1; // 0x160
	FVector LocationValue; // 0x164
	FRotator RotationValue; // 0x170
	ObjectProperty Target; // 0x180
};

struct USoundCue {
	FName SoundClass; // 0x60
	ESoundClassName SoundClassName; // 0x68
	uint32_t bDebug : 1; // 0x6c
	ObjectProperty FirstNode; // 0x70
	TMap<None, None> EditorData; // 0x78
	float MaxAudibleDistance; // 0xc8
	float VolumeMultiplier; // 0xcc
	float PitchMultiplier; // 0xd0
	float Duration; // 0xd4
	ObjectProperty FaceFXAnimSetRef; // 0xd8
	FString FaceFXGroupName; // 0xe0
	FString FaceFXAnimName; // 0xf0
	int32_t MaxConcurrentPlayCount; // 0x100
	int32_t CurrentPlayCount; // 0x104
	FName SoundGroup; // 0x108
};

struct AWorldAttractor {
	uint32_t bEnabled : 1; // 0x268
	float LoopDuration; // 0x26c
	float CurrentTime; // 0x270
	EWorldAttractorFalloffType FalloffType; // 0x274
	FMatineeRawDistributionFloat FalloffExponent; // 0x278
	FMatineeRawDistributionFloat Range; // 0x2a8
	FMatineeRawDistributionFloat Strength; // 0x2d8
	float CollisionRadius; // 0x308
	FMatineeRawDistributionFloat DragCoefficient; // 0x310
	FMatineeRawDistributionFloat DragRadius; // 0x340
};

struct ULevel {
	float LightmapTotalSize; // 0x1f8
	float ShadowmapTotalSize; // 0x1fc
};

struct UGFxData_Clubs_TA {
	QWordProperty LocalClubID; // 0x98
	uint32_t bClubOwner : 1; // 0xa0
	uint32_t bSyncedLocalClub : 1; // 0xa0
	uint32_t bHasSyncedClubInvites : 1; // 0xa0
	FString LocalClubSyncError; // 0xa8
	FString ExecutingClubAction; // 0xb8
	ObjectProperty PsyNet; // 0xc8
	ObjectProperty ClubProvider; // 0xd0
	ObjectProperty ClubsConfig; // 0xd8
	ObjectProperty Party; // 0xe0
	ObjectProperty PersonasData; // 0xe8
	ObjectProperty ClubManager; // 0xf0
	TArray<ObjectProperty> AllClubDetails; // 0xf8
	ObjectProperty CurrentClubAction; // 0x108
	FString TagTooShort; // 0x110
	FString TagTooLong; // 0x120
	FString TagHasInvalidCharacters; // 0x130
	FString NameTooShort; // 0x140
	FString NameTooLong; // 0x150
	FString NameHasInvalidCharacters; // 0x160
	DelegateProperty __FlashActionHandler__Delegate; // 0x170
};

struct UConsole {
	ObjectProperty ConsoleTargetPlayer; // 0xd0
	ObjectProperty DefaultTexture_Black; // 0xd8
	ObjectProperty DefaultTexture_White; // 0xe0
	FName ConsoleKey; // 0xe8
	FName TypeKey; // 0xf0
	int32_t MaxScrollbackSize; // 0xf8
	TArray<FString> Scrollback; // 0x100
	int32_t SBHead; // 0x110
	int32_t SBPos; // 0x114
	int32_t HistoryTop; // 0x118
	int32_t HistoryBot; // 0x11c
	int32_t HistoryCur; // 0x120
	FString History[0x10]; // 0x128
	uint32_t bNavigatingHistory : 1; // 0x228
	uint32_t bCaptureKeyInput : 1; // 0x228
	uint32_t bCtrl : 1; // 0x228
	uint32_t bEnableUI : 1; // 0x228
	uint32_t bAutoCompleteLocked : 1; // 0x228
	uint32_t bRequireCtrlToNavigateAutoComplete : 1; // 0x228
	uint32_t bIsRuntimeAutoCompleteUpToDate : 1; // 0x228
	FString TypedStr; // 0x230
	int32_t TypedStrPos; // 0x240
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x248
	TArray<FAutoCompleteCommand> AutoCompleteList; // 0x258
	int32_t AutoCompleteIndex; // 0x268
	FAutoCompleteNode AutoCompleteTree; // 0x270
	TArray<int32_t> AutoCompleteIndices; // 0x298
};

struct UBanSync_TA {
	TArray<ObjectProperty> BanMessages; // 0x60
	DelegateProperty __EventSyncedBanStatus__Delegate; // 0x70
};

struct UTourSettings_TA {
	QWordProperty Id; // 0x60
	QWordProperty ScheduleID; // 0x68
	FString Title; // 0x70
	FString CreatorName; // 0x80
	FUniqueNetId CreatorPlayerID; // 0x90
	QWordProperty StartTime; // 0xd8
	QWordProperty GenerateBracketTime; // 0xe0
	int32_t MaxBracketSize; // 0xe8
	int32_t TeamsRegistered; // 0xec
	int32_t RankMin; // 0xf0
	int32_t RankMax; // 0xf4
	FString Region; // 0xf8
	FString RegionName; // 0x108
	FString GameTags; // 0x118
	char GameMode; // 0x128
	EMatchTieBreaker TieBreaker; // 0x129
	ETourSeedType SeedingType; // 0x12a
	int32_t TeamSize; // 0x12c
	TArray<FName> DisabledMaps; // 0x130
	TArray<int32_t> SeriesRoundLengths; // 0x140
	int32_t SeriesLength; // 0x150
	int32_t FinalSeriesLength; // 0x154
	uint32_t bPublic : 1; // 0x158
	int32_t MinPlayersPerTeam; // 0x15c
	QWordProperty MatchExpireTimestamp; // 0x160
	TArray<FString> Platforms; // 0x168
};

struct UArenaSoundConfig_TA {
	TArray<ObjectProperty> Events; // 0x78
};

struct U__RPCQueue_X__CreateBatchSingleRPC_D558DA184FB02ECCD84DB49B2C5C4725 {
	ObjectProperty Batch; // 0x60
};

struct UUserCloudFileCloudSaveSystemDataBlobStore {
	TScriptInterface<Class> UserCloudFile; // 0x60
	DelegateProperty GetDataBlobCallback; // 0x70
	DelegateProperty SetDataBlobCallback; // 0x88
	DelegateProperty DeleteDataBlobCallback; // 0xa0
	DelegateProperty __GetDataBlobCallbackDelegate__Delegate; // 0xb8
	DelegateProperty __SetDataBlobCallbackDelegate__Delegate; // 0xd0
	DelegateProperty __DeleteDataBlobCallbackDelegate__Delegate; // 0xe8
};

struct UMcpUserManager {
	TArray<FMcpUserStatus> UserStatuses; // 0xe8
	FString RegisterUserMcpUrl; // 0xf8
	FString RegisterUserFacebookUrl; // 0x108
	FString QueryUserUrl; // 0x118
	FString QueryUsersUrl; // 0x128
	FString DeleteUserUrl; // 0x138
	FString FacebookAuthUrl; // 0x148
	FString McpAuthUrl; // 0x158
	TArray<ObjectProperty> RegisterUserRequests; // 0x168
	TArray<ObjectProperty> QueryUsersRequests; // 0x178
	TArray<FUserRequest> DeleteUserRequests; // 0x188
	TArray<ObjectProperty> AuthUserRequests; // 0x198
};

struct UGFxDataCallback_X {
	FName Table; // 0x90
	int32_t Row; // 0x98
	FName Column; // 0x9c
	EDataCallbackType Type; // 0xa4
};

struct USoundNodeWaveStreaming {
	TArray<char> QueuedAudio; // 0x4b8
	float InactiveDuration; // 0x4c8
	int32_t MaxGenerateSamples; // 0x4cc
};

struct U__OnlineClubProvider_X__SyncPlayerClubDetails_77282AD64474A57612078A956635B7FB {
	FUniqueNetId PlayerID; // 0x60
	ObjectProperty RPC; // 0xa8
};

struct UMaterialExpressionTextureObject {
	ObjectProperty Texture; // 0xc0
};

struct U__TourList_TA__GetTournamentResult_494738F94F0538F02A4C9297688FCC02 {
	QWordProperty TournamentID; // 0x60
};

struct USkeletalMesh {
	FBoxSphereBounds Bounds; // 0x60
	TArray<ObjectProperty> Materials; // 0x80
	TArray<ObjectProperty> ClothingAssets; // 0x90
	TArray<FApexClothingAssetInfo> ClothingLodMap; // 0xa0
	FVector Origin; // 0xb0
	FRotator RotOrigin; // 0xbc
	TArray<int32_t> RefSkeleton; // 0xc8
	int32_t SkeletalDepth; // 0xd8
	TMap<None, None> NameIndexMap; // 0xe0
	FIndirectArray_Mirror LODModels; // 0x130
	FPointer SourceData; // 0x140
	TArray<FBoneAtom> RefBasesInvMatrix; // 0x148
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0x158
	EAxis SkelMirrorAxis; // 0x168
	EAxis SkelMirrorFlipAxis; // 0x169
	TArray<ObjectProperty> Sockets; // 0x170
	TArray<FString> BoneBreakNames; // 0x180
	TArray<BoneBreakOption> BoneBreakOptions; // 0x190
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0x1a0
	TArray<FSkeletalMeshLODDistanceInfo> LODDistanceInfo; // 0x1b0
	TArray<FSkeletalMeshOptimizationSettings> OptimizationSettings; // 0x1c0
	TArray<FName> PerPolyCollisionBones; // 0x1d0
	TArray<FName> AddToParentPerPolyCollisionBone; // 0x1e0
	TArray<int32_t> PerPolyBoneKDOPs; // 0x1f0
	uint32_t bPerPolyUseSoftWeighting : 1; // 0x200
	uint32_t bUseSimpleLineCollision : 1; // 0x200
	uint32_t bUseSimpleBoxCollision : 1; // 0x200
	uint32_t bForceCPUSkinning : 1; // 0x200
	uint32_t bUseFullPrecisionUVs : 1; // 0x200
	uint32_t bHasBeenSimplified : 1; // 0x200
	ObjectProperty FaceFXAsset; // 0x208
	ObjectProperty BoundsPreviewAsset; // 0x210
	TArray<ObjectProperty> PreviewMorphSets; // 0x218
	int32_t LODBiasPC; // 0x228
	int32_t LODBiasPS3; // 0x22c
	int32_t LODBiasXbox360; // 0x230
	int32_t LODBiasPS4; // 0x234
	int32_t LODBiasNNX; // 0x238
	FString SourceFilePath; // 0x240
	FString SourceFileTimestamp; // 0x250
	TArray<FPointer> ClothMesh; // 0x260
	TArray<float> ClothMeshScale; // 0x270
	TArray<int32_t> ClothToGraphicsVertMap; // 0x280
	TArray<float> ClothMovementScale; // 0x290
	ClothMovementScaleGen ClothMovementScaleGenMode; // 0x2a0
	float ClothToAnimMeshMaxDist; // 0x2a4
	uint32_t bLimitClothToAnimMesh : 1; // 0x2a8
	TArray<int32_t> ClothWeldingMap; // 0x2b0
	int32_t ClothWeldingDomain; // 0x2c0
	TArray<int32_t> ClothWeldedIndices; // 0x2c8
	uint32_t bForceNoWelding : 1; // 0x2d8
	int32_t NumFreeClothVerts; // 0x2dc
	TArray<int32_t> ClothIndexBuffer; // 0x2e0
	TArray<FName> ClothBones; // 0x2f0
	int32_t ClothHierarchyLevels; // 0x300
	uint32_t bEnableClothBendConstraints : 1; // 0x304
	uint32_t bEnableClothDamping : 1; // 0x304
	uint32_t bUseClothCOMDamping : 1; // 0x304
	float ClothStretchStiffness; // 0x308
	float ClothBendStiffness; // 0x30c
	float ClothDensity; // 0x310
	float ClothThickness; // 0x314
	float ClothDamping; // 0x318
	int32_t ClothIterations; // 0x31c
	int32_t ClothHierarchicalIterations; // 0x320
	float ClothFriction; // 0x324
	float ClothRelativeGridSpacing; // 0x328
	float ClothPressure; // 0x32c
	float ClothCollisionResponseCoefficient; // 0x330
	float ClothAttachmentResponseCoefficient; // 0x334
	float ClothAttachmentTearFactor; // 0x338
	float ClothSleepLinearVelocity; // 0x33c
	float HardStretchLimitFactor; // 0x340
	uint32_t bHardStretchLimit : 1; // 0x344
	uint32_t bEnableClothOrthoBendConstraints : 1; // 0x344
	uint32_t bEnableClothSelfCollision : 1; // 0x344
	uint32_t bEnableClothPressure : 1; // 0x344
	uint32_t bEnableClothTwoWayCollision : 1; // 0x344
	TArray<FClothSpecialBoneInfo> ClothSpecialBones; // 0x348
	uint32_t bEnableClothLineChecks : 1; // 0x358
	uint32_t bClothMetal : 1; // 0x358
	float ClothMetalImpulseThreshold; // 0x35c
	float ClothMetalPenetrationDepth; // 0x360
	float ClothMetalMaxDeformationDistance; // 0x364
	uint32_t bEnableClothTearing : 1; // 0x368
	float ClothTearFactor; // 0x36c
	int32_t ClothTearReserve; // 0x370
	uint32_t bEnableValidBounds : 1; // 0x374
	FVector ValidBoundsMin; // 0x378
	FVector ValidBoundsMax; // 0x384
	FMap_Mirror ClothTornTriMap; // 0x390
	TArray<int32_t> SoftBodySurfaceToGraphicsVertMap; // 0x3e0
	TArray<int32_t> SoftBodySurfaceIndices; // 0x3f0
	TArray<FVector> SoftBodyTetraVertsUnscaled; // 0x400
	TArray<int32_t> SoftBodyTetraIndices; // 0x410
	TArray<FSoftBodyTetraLink> SoftBodyTetraLinks; // 0x420
	TArray<FPointer> CachedSoftBodyMeshes; // 0x430
	TArray<float> CachedSoftBodyMeshScales; // 0x440
	TArray<FName> SoftBodyBones; // 0x450
	TArray<FSoftBodySpecialBoneInfo> SoftBodySpecialBones; // 0x460
	float SoftBodyVolumeStiffness; // 0x470
	float SoftBodyStretchingStiffness; // 0x474
	float SoftBodyDensity; // 0x478
	float SoftBodyParticleRadius; // 0x47c
	float SoftBodyDamping; // 0x480
	int32_t SoftBodySolverIterations; // 0x484
	float SoftBodyFriction; // 0x488
	float SoftBodyRelativeGridSpacing; // 0x48c
	float SoftBodySleepLinearVelocity; // 0x490
	uint32_t bEnableSoftBodySelfCollision : 1; // 0x494
	float SoftBodyAttachmentResponse; // 0x498
	float SoftBodyCollisionResponse; // 0x49c
	float SoftBodyDetailLevel; // 0x4a0
	int32_t SoftBodySubdivisionLevel; // 0x4a4
	uint32_t bSoftBodyIsoSurface : 1; // 0x4a8
	uint32_t bEnableSoftBodyDamping : 1; // 0x4a8
	uint32_t bUseSoftBodyCOMDamping : 1; // 0x4a8
	float SoftBodyAttachmentThreshold; // 0x4ac
	uint32_t bEnableSoftBodyTwoWayCollision : 1; // 0x4b0
	float SoftBodyAttachmentTearFactor; // 0x4b4
	uint32_t bEnableSoftBodyLineChecks : 1; // 0x4b8
	uint32_t bHasVertexColors : 1; // 0x4b8
	TArray<char> GraphicsIndexIsCloth; // 0x4c0
	TArray<float> CachedStreamingTextureFactors; // 0x4d0
	float StreamingDistanceMultiplier; // 0x4e0
	int32_t ReleaseResourcesFence; // 0x4e4
	QWordProperty SkelMeshRUID; // 0x4e8
	uint32_t bUseClothingAssetMaterial : 1; // 0x4f0
};

struct ACollisionTestTrack_TA {
	ComponentProperty CollisionTestComponent; // 0x268
};

struct USaveObject_TA {
	int32_t Version; // 0x60
	DelegateProperty __EventDirtied__Delegate; // 0x68
	DelegateProperty __EventLoaded__Delegate; // 0x80
	DelegateProperty __EventUnloaded__Delegate; // 0x98
	DelegateProperty EventPropertyChange; // 0xb0
};

struct UClientJitterBuffer_TA {
	ObjectProperty JitterSettings; // 0x60
	float LastPacketTime; // 0x68
	float PacketTimeMu; // 0x6c
	float PacketTimeVariance; // 0x70
	float BufferTime; // 0x74
	int32_t BufferSize; // 0x78
};

struct ARB_ForceFieldExcludeVolume {
	int32_t ForceFieldChannel; // 0x2a8
	int32_t SceneIndex; // 0x2ac
};

struct UEngineAudioProfileREV_TA {
	FAkRevSimPhysicsControls Controls; // 0x70
	ObjectProperty PhysicsSim; // 0x90
	ComponentProperty RevLimiter; // 0x98
};

struct UCameraState_MenuCamActor_TA {
	FName CameraTag; // 0x210
};

struct U__SaveData_TA__HandleOnlineProductsReceived_8005369D4284F1BE9F4914816F3B43BF {
	ObjectProperty ProductsSave; // 0x60
};

struct UAnimNodeRandom {
	TArray<FRandomAnimInfo> RandomInfo; // 0x170
	ObjectProperty PlayingSeqNode; // 0x180
	int32_t PendingChildIndex; // 0x188
	uint32_t bPickedPendingChildIndex : 1; // 0x18c
};

struct UAkParamGroup {
	FPointer VfTable_IISetParameter; // 0xa0
	FAkParamSet StoredParameters; // 0xa8
	TArray<ComponentProperty> SoundSources; // 0x148
	int32_t ControllerId; // 0x158
	EReflectionSendType SendType; // 0x15c
	EAttenuationType AttenuationType; // 0x15d
};

struct UOnlinePlayerRegionRestrictions_X {
	TArray<ERegionRestriction> Restrictions; // 0x98
};

struct U__EpicLogin_X__TriggerAuthTicketDelegate_C57346524C10772CDC28A793049838B9 {
	DelegateProperty Callback; // 0x60
	FUniqueNetId NetId; // 0x78
};

struct UMaterialExpressionSine {
	FExpressionInput Input; // 0xc0
	float Period; // 0xf8
};

struct USeqAct_DelaySwitch {
	int32_t LinkCount; // 0x178
	int32_t CurrentIdx; // 0x17c
	float SwitchDelay; // 0x180
	float NextLinkTime; // 0x184
};

struct UUISceneClient {
	FPointer VfTable_FExec; // 0x70
	FPointer RenderViewport; // 0x78
	FIntPoint MousePosition; // 0x80
	ObjectProperty DataStoreManager; // 0x88
	FMatrix CanvasToScreen; // 0x90
	FMatrix InvCanvasToScreen; // 0xd0
	ObjectProperty UIScenePostProcess; // 0x110
	uint32_t bEnablePostProcess : 1; // 0x118
};

struct UProductAttribute_Painted_TA {
	int32_t PaintID; // 0x80
};

struct UStatGraphDrawer_TA {
	ComponentProperty History; // 0x60
	float MaxSampleAge; // 0x68
	float Scale; // 0x6c
	float PixelsPerSample; // 0x70
	float ValueStartX; // 0x74
	float MaxCharHeight; // 0x78
	float SpaceWidth; // 0x7c
	float LabelMaxWidth; // 0x80
	float ValueMaxWidth; // 0x84
	float GridCellWidth; // 0x88
	float GridCellHeight; // 0x8c
	float GraphWidth; // 0x90
	float GraphHeight; // 0x94
	float GraphStartX; // 0x98
	float GraphEndX; // 0x9c
	float X; // 0xa0
	float Y; // 0xa4
	ObjectProperty Canvas; // 0xa8
	TArray<FSummaryLabel> SummaryLabels; // 0xb0
	TArray<FGraphLine> GridLines; // 0xc0
	TArray<FGraphLine> SampleLines; // 0xd0
	int32_t SampleLineIndex; // 0xe0
};

struct ACameraSettingsActor_TA {
	float UploadCameraDelay; // 0x268
	ObjectProperty PRI; // 0x270
	FProfileCameraSettings ProfileSettings; // 0x278
	uint32_t bUsingSecondaryCamera : 1; // 0x294
	uint32_t bUsingBehindView : 1; // 0x294
	uint32_t bUsingFreecam : 1; // 0x294
	uint32_t bUsingSwivel : 1; // 0x294
	uint32_t bMouseCameraToggleEnabled : 1; // 0x294
	uint32_t bHoldMouseCamera : 1; // 0x294
	uint32_t bResetCamera : 1; // 0x294
	uint32_t bDirtySecondaryCamera : 1; // 0x294
	uint32_t bDirtyBehindView : 1; // 0x294
	char CameraPitch; // 0x298
	char CameraYaw; // 0x299
	float LastRotationChangeTime; // 0x29c
	float LastReplicateRotationTime; // 0x2a0
	DelegateProperty __EventCameraChanged__Delegate; // 0x2a8
	DelegateProperty __EventSecondaryCameraChanged__Delegate; // 0x2c0
};

struct USpecialEditionDatabase_TA {
	TArray<ObjectProperty> SpecialEditions; // 0x60
	FMap_Mirror EditionNameToEditionID; // 0x70
	uint32_t bClickToRebuild : 1; // 0xc0
};

struct AVoteActor_TA {
	EVoteSubject Subject; // 0x268
	int32_t TimeRemaining; // 0x26c
	uint32_t bUnanimousVote : 1; // 0x270
	uint32_t bAllowSplitscreenVoters : 1; // 0x270
	uint32_t bFilterIdleBannedPlayers : 1; // 0x270
	uint32_t bFinished : 1; // 0x270
	TArray<FVoter> Voters; // 0x278
	FVoter ReplicatedVoters[0x8]; // 0x288
	DelegateProperty __EventStarted__Delegate; // 0x308
	DelegateProperty __EventVotersChanged__Delegate; // 0x320
	DelegateProperty __EventTimeRemainingChanged__Delegate; // 0x338
	DelegateProperty __EventFinished__Delegate; // 0x350
	DelegateProperty __EventDestroyed__Delegate; // 0x368
};

struct UMusicTracklistBuildStep_RemoveStreamerUnsafeTracks_TA {
	TScriptInterface<Class> Source; // 0x60
	ObjectProperty Config; // 0x70
};

struct APlayerReplicatedEventInfo_TA {
	ObjectProperty OwnerPRI; // 0x268
};

struct UParticleModuleRotation {
	FRawDistributionFloat StartRotation; // 0x70
};

struct USeqVar_Object {
	ObjectProperty ObjValue; // 0xe0
	FVector ActorLocation; // 0xe8
	TArray<FNone*> SupportedClasses; // 0xf8
};

struct U__GFxData_Controls_TA__SetCurrentBinding_93B33D864420B2CB02C2C3B5872FB8FE {
	FName Key; // 0x60
	uint32_t bGamepad : 1; // 0x68
	EAxisSign AxisSign; // 0x6c
};

struct UOnlineSaveRecord_TA {
	int32_t Version; // 0x60
	QWordProperty TimeStamp; // 0x68
	int32_t SaveTick; // 0x70
	TArray<FOnlineSaveObject> SaveObjects; // 0x78
};

struct AGameEvent_Football_TA {
	int32_t LastScoredTeamIndex; // 0xc78
	FVector GoalPlayerSpawnOffset; // 0xc7c
	FVector BallKickOffDirection; // 0xc88
	FVector BallKickOffTorque; // 0xc94
	float BallKickOffScale; // 0xca0
	float SpawnRadiusCheck; // 0xca4
	float KickoffDelay; // 0xca8
};

struct UWebSocketConnection_X {
	float PingInterval; // 0x140
	FString ClosedReason; // 0x148
	int32_t ClosedCode; // 0x158
};

struct UGFxData_MenuStack_TA {
	TArray<FName> MenuNames; // 0x98
	FName LastButtonTriggered; // 0xa8
	DelegateProperty __EventTopMenuChanged__Delegate; // 0xb0
	DelegateProperty __EventMenuButtonTriggered__Delegate; // 0xc8
};

struct UCameraState_CarInverted_TA {
	FViewTargetTransitionParams StartBlendParams; // 0x1c0
	uint32_t bAllowBlendTimeOverride : 1; // 0x1d0
	float DelayFromSpawn; // 0x1d4
};

struct UCameraState_DirectorCountdownTailPass_TA {
	float DistanceFromCar; // 0x1b8
	FRotator InitialRotation; // 0x1bc
	FRotator RotationSpeed; // 0x1c8
	float FOV; // 0x1d4
};

struct UProductThumbnailAsset_Blueprint_TA {
	ObjectProperty RevealedThumbnail; // 0x78
};

struct UPsyNetClientServiceCollection_X {
	TArray<ObjectProperty> ServiceArchetypes; // 0x60
};

struct U__FirstTimeExperienceManager_TA__SetupTrigger_7652621846EC505580D261BBE5214CC0 {
	ObjectProperty Condition; // 0x60
	FFTEGroup Group; // 0x68
};

struct U__TaskGate_X__Add_C095A3AE4B65CA40D0C67196E5E03D06 {
	ObjectProperty Task; // 0x60
};

struct USoundNodeRandom {
	TArray<float> Weights; // 0x78
	int32_t PreselectAtLevelLoad; // 0x88
	uint32_t bRandomizeWithoutReplacement : 1; // 0x8c
	TArray<char> HasBeenUsed; // 0x90
	int32_t NumRandomUsed; // 0xa0
};

struct UInterpTrackInstMove {
	FVector ResetLocation; // 0x60
	FRotator ResetRotation; // 0x6c
	FMatrix InitialTM; // 0x80
	FQuat InitialQuat; // 0xc0
};

struct UParticleLightEnvironmentComponent {
	int32_t ReferenceCount; // 0x170
	int32_t NumPooledReuses; // 0x174
	ObjectProperty SharedInstigator; // 0x178
	ObjectProperty SharedParticleSystem; // 0x180
	uint32_t bAllowDLESharing : 1; // 0x188
};

struct UEngineAudioRevSimBoost_TA {
	float InterpTime; // 0x70
	float InterpScale; // 0x74
	float InterpExp; // 0x78
	float ActiveTime; // 0x7c
};

struct ULandscapeInfo {
	FGuid LandscapeGuid; // 0x60
	TMap<None, None> LayerInfoMap; // 0x70
	FPointer DataInterface; // 0xc0
	TMap<None, None> XYtoComponentMap; // 0xc8
	TMap<None, None> XYtoCollisionComponentMap; // 0x118
	ObjectProperty LandscapeProxy; // 0x168
	TMap<None, None> XYtoAddCollisionMap; // 0x170
	FSet_Mirror Proxies; // 0x1c0
	FSet_Mirror SelectedComponents; // 0x210
	FSet_Mirror SelectedCollisionComponents; // 0x260
	FSet_Mirror SelectedRegionComponents; // 0x2b0
	TMap<None, None> SelectedRegion; // 0x300
	FString HeightmapFilePath; // 0x350
	uint32_t bIsValid : 1; // 0x360
};

struct UArchetypePool {
	FMultiMap_Mirror ObjectArchetypeMap; // 0x70
};

struct UMaterialExpressionAppendVector {
	FExpressionInput A; // 0xc0
	FExpressionInput B; // 0xf8
};

struct UPsyNetService_FriendPsyTagUpdated_X {
	FUniqueNetId PlayerID; // 0x90
	FPsyTag PsyTag; // 0xd8
};

struct UBlogTileCache_TA {
	TArray<FString> UnreadTileIDs; // 0xc8
	TArray<FString> PreviouslyDisplayedTileIDs; // 0xd8
};

struct UMICParamDispenserComponent_X {
	FPointer VfTable_IISetParameter; // 0xa8
	int32_t MaterialIndex; // 0xb0
	FName AttachedComponentName; // 0xb4
	ComponentProperty MeshComp; // 0xc0
};

struct UOnlineGameInterfaceEOS {
	FPointer SessionsHandle; // 0x318
	FPointer CurrentSearchHandle; // 0x320
	ObjectProperty PlayerInterfaceEOS; // 0x328
	uint32_t bGameSessionUpdateInProgress : 1; // 0x330
};

struct UMaterialExpressionConstant4Vector {
	float R; // 0xc0
	float G; // 0xc4
	float B; // 0xc8
	float A; // 0xcc
};

struct UMotionBlurEffect {
	float MaxVelocity; // 0x88
	float MotionBlurAmount; // 0x8c
	uint32_t FullMotionBlur : 1; // 0x90
	float CameraRotationThreshold; // 0x94
	float CameraTranslationThreshold; // 0x98
};

struct U__RPC_X__CreateTask_381F4468441FFEAF750836A67AC88576 {
	DelegateProperty InCallback; // 0x60
};

struct AFlockActor_TA {
	ObjectProperty AgentMesh; // 0x268
	ComponentProperty FlockInstancedMesh; // 0x270
	int32_t FlockSize; // 0x278
	float SeperationWeight; // 0x27c
	FVector FlockRadius; // 0x280
	float AgentSpeed; // 0x28c
	float SeperationIdealDistance; // 0x290
	ObjectProperty Spline; // 0x298
	float SpawnSpreadDistanceAlongSpline; // 0x2a0
	uint32_t bRestartTimerEnabled : 1; // 0x2a4
	uint32_t UpdateFlockMovement : 1; // 0x2a4
	uint32_t ResetFlockOnToggleUpdateMovement : 1; // 0x2a4
	float WaitTimeInSeconds; // 0x2a8
	float MinAgentScale; // 0x2ac
	float MaxAgentScale; // 0x2b0
	float CurrentRestartTime; // 0x2b4
	TArray<FFlockAgent> Agents; // 0x2b8
	FVector AverageAgentPosition; // 0x2c8
};

struct UPitchTekDrawingComponent_TA {
	FVector PreviousOwnerPosition; // 0xa0
	EPitchTekDecalType DecalType; // 0xac
	TArray<FWheelContactData> WheelContacts; // 0xb0
	FPitchTekCarBodyContactData CarBodyContactData; // 0xc0
};

struct UGFxDataStore_X {
	TArray<FGFxDataStoreTable> Tables; // 0x70
	TArray<FGFxDirtyTable> DirtyTables; // 0x80
	FMap_Mirror ObjectNameToTable; // 0x90
	uint32_t bDebugGetValue : 1; // 0xe0
};

struct UGFxData_Koala_TA {
	ObjectProperty KoalaController; // 0x98
};

struct UCompleteTaskDropGroup_TA {
	ObjectProperty Icon; // 0xb0
	FString Title; // 0xb8
	int32_t Points; // 0xc8
};

struct UParticleModuleMaterialByParameter {
	TArray<FName> MaterialParameters; // 0x70
	TArray<ObjectProperty> DefaultMaterials; // 0x80
};

struct UStatusObserver_XPLevel_TA {
	int32_t LastGivenXp; // 0xa0
	int32_t LastGivenLevel; // 0xa4
};

struct USeqAct_SetVehicleInput_TA {
	FVehicleInputs Input; // 0x160
};

struct URPC_GetAllShops_TA {
	TArray<FShopData> Shops; // 0xe8
};

struct UCameraState_CarRef_TA {
	ObjectProperty Car; // 0x98
	ObjectProperty CameraSettings; // 0xa0
};

struct UGFxData_PlayerAvatarBorderPreview_TA {
	TArray<FGFxPlayerAvatarBorderRef> AvatarBorderPreviews; // 0x98
};

struct UParticleModuleCollision {
	FRawDistributionVector DampingFactor; // 0x70
	FRawDistributionVector DampingFactorRotation; // 0x98
	FRawDistributionFloat MaxCollisions; // 0xc0
	EParticleCollisionComplete CollisionCompletionOption; // 0xe8
	uint32_t bApplyPhysics : 1; // 0xec
	uint32_t bNoClip : 1; // 0xec
	uint32_t bPawnsDoNotDecrementCount : 1; // 0xec
	uint32_t bOnlyVerticalNormalsDecrementCount : 1; // 0xec
	uint32_t bDropDetail : 1; // 0xec
	uint32_t bCollideOnlyIfVisible : 1; // 0xec
	uint32_t bCollideWithWorld : 1; // 0xec
	uint32_t bCollideWithWorldAttractors : 1; // 0xec
	ObjectProperty DecalMaterial; // 0xf0
	float DecalWidth; // 0xf8
	float DecalHeight; // 0xfc
	float DecalThickness; // 0x100
	float DecalLifetime; // 0x104
	float DecalDepthBias; // 0x108
	FVector2D DecalBlendRange; // 0x10c
	FRawDistributionFloat ParticleMass; // 0x118
	float DirScalar; // 0x140
	float VerticalFudgeFactor; // 0x144
	FRawDistributionFloat DelayAmount; // 0x148
	float MaxCollisionDistance; // 0x170
	TArray<FParticleAttractorCollisionAction> ParticleAttractorCollisionActions; // 0x178
};

struct UAnimNodeBlendBoost_TA {
	float BlendTime; // 0x158
};

struct U__TourService_PsyNet_TA__GetMatch_16FDD59C4FAEFF929D8E27AED5C4D60F {
	DelegateProperty Callback; // 0x60
};

struct URPC_AutoTour_GetCompletedResult_TA {
	FUniqueNetId PlayerID; // 0xe8
	QWordProperty TournamentID; // 0x130
	FTournamentEndData EndOfTournamentData; // 0x138
};

struct UMtxConfig_TA {
	uint32_t bAllowMicroTransactions : 1; // 0x78
	uint32_t bAllowCurrencyTrading : 1; // 0x78
	uint32_t bAllowCurrencyGifting : 1; // 0x78
	uint32_t bAllowCurrencyForCurrencyTrades : 1; // 0x78
	uint32_t bEnablePlatformStartPurchase : 1; // 0x78
	int32_t MaxCurrencyWalletAmount; // 0x7c
	int32_t MaxCurrencyDailyAmount; // 0x80
	FString FulfillmentRestrictedWalletMessage; // 0x88
	FString FulfillmentRestrictedDailyMessage; // 0x98
	FString FulfillmentRestrictedTitle; // 0xa8
	FString CurrencyDelimeter; // 0xb8
};

struct UDistributionFloatUniformRange {
	float MaxHigh; // 0x80
	float MaxLow; // 0x84
	float MinHigh; // 0x88
	float MinLow; // 0x8c
	uint32_t bMirrorMaxMin : 1; // 0x90
};

struct AStaticMeshActor_TA {
	ComponentProperty StaticMeshComponent; // 0x268
};

struct UParticleModuleEventReceiverBase {
	EParticleEventType EventGeneratorType; // 0x70
	FName EventName; // 0x74
};

struct U__WebImageCache_X__HandleImageData_5A3CED78446BB35A48D185AC5DE99938 {
	ObjectProperty Download; // 0x60
};

struct UShopsService_Local_TA {
	float ServiceDelay; // 0x60
};

struct U__ConsecutiveMatchTracker_TA__HandleGameEnded_421FC02848C136E159D07582C6796A30 {
	ObjectProperty GameEvent; // 0x60
};

struct UOnlineGameLanReservations_X {
	ComponentProperty LanBeacon; // 0x98
	ComponentProperty Beacon; // 0xa0
	float ReservationTimeout; // 0xa8
	uint32_t bServerTraveling : 1; // 0xac
	DelegateProperty __EventReservationsTimeout__Delegate; // 0xb0
};

struct UPremiumGaragePreviewSet_TA {
	int32_t PreviewActorIndices[0x2]; // 0x60
	TArray<ObjectProperty> CarPreviewActors; // 0x68
	ObjectProperty OnlineParty; // 0x78
	ObjectProperty CurrentCar; // 0x80
	int32_t CurrentCarIdx; // 0x88
	uint32_t bFirstSet : 1; // 0x8c
	ObjectProperty QueuedSwapPack; // 0x90
	int32_t QueuedSwapSubIdx; // 0x98
	DelegateProperty __EventSwapFinished__Delegate; // 0xa0
	DelegateProperty __EventRevealComplete__Delegate; // 0xb8
};

struct U__UIConfig_TA__FindXPTier_82EC78A04C7D3273EED6BCA885DE7FB8 {
	int32_t XPAmount; // 0x60
};

struct U__EpicLogin_X__HandleLoginChanged_59DF40B64A498A4DC4188CB1C2BF054B {
	char InLocalPlayerNum; // 0x60
};

struct UProductOverride_StaticMesh_TA {
	ObjectProperty Mesh; // 0x60
};

struct AImageReflectionShadowPlane {
	uint32_t bEnabled : 1; // 0x268
	ComponentProperty ReflectionShadowComponent; // 0x270
};

struct UMaterialExpressionFrac {
	FExpressionInput Input; // 0xc0
};

struct UApexClothingAsset {
	TArray<FClothingLodInfo> LodMaterialInfo; // 0xb0
	FPointer MApexAsset; // 0xc0
	TArray<ObjectProperty> Materials; // 0xc8
	ObjectProperty ApexClothingLibrary; // 0xd8
	uint32_t bUseHardwareCloth : 1; // 0xe0
	uint32_t bFallbackSkinning : 1; // 0xe0
	uint32_t bSlowStart : 1; // 0xe0
	uint32_t bRecomputeNormals : 1; // 0xe0
	uint32_t bAllowAdaptiveTargetFrequency : 1; // 0xe0
	uint32_t bResetAfterTeleport : 1; // 0xe0
	uint32_t bUseLocalSpaceSimulation : 1; // 0xe0
	uint32_t bHasUniqueAssetMaterialNames : 1; // 0xe0
	uint32_t IgnoreInitialTrigger : 1; // 0xe0
	int32_t UVChannelForTangentUpdate; // 0xe4
	float MaxDistanceBlendTime; // 0xe8
	float ContinuousRotationThreshold; // 0xec
	float ContinuousDistanceThreshold; // 0xf0
	float LodWeightsMaxDistance; // 0xf4
	float LodWeightsDistanceWeight; // 0xf8
	float LodWeightsBias; // 0xfc
	float LodWeightsBenefitsBias; // 0x100
	float LODDecayTime; // 0x104
	ObjectProperty SoundOnMove; // 0x108
	ObjectProperty SoundOnRest; // 0x110
	ObjectProperty SoundWhileMoving; // 0x118
	float SpeedThresholdOnMove; // 0x120
	float SpeedThresholdOnRest; // 0x124
};

struct UEOSEvent_Presence_TA {
	FString PlayerLocation; // 0x68
};

struct ANxRadialForceField {
	ComponentProperty RenderComponent; // 0x2c0
	float ForceStrength; // 0x2c8
	float ForceRadius; // 0x2cc
	ERadialImpulseFalloff ForceFalloff; // 0x2d0
	FPointer LinearKernel; // 0x2d8
};

struct USeqAct_FeatureTest {
	FString FreezeAtParameters; // 0x188
	float ScreenShotDelay; // 0x198
	FString ScreenShotName; // 0x1a0
	float RemainingScreenShotDelay; // 0x1b0
};

struct UUIDataProvider_OnlinePlayerDataBase {
	int32_t PlayerControllerId; // 0x70
};

struct UPsyNetService_ClubsUpdate_TA {
	ObjectProperty ClubDetails; // 0x90
};

struct UFXTrait_BoostParticle_TA {
	ObjectProperty ParticlePreview; // 0x60
	ObjectProperty DuplicateParticle; // 0x68
	ObjectProperty DuplicateParticlePreview; // 0x70
	TArray<FParticleSysParam> SharedParameters; // 0x78
	TArray<FParticleSysParam> DuplicateParameters; // 0x88
	TArray<FParticleSysParam> PreviewOverrideParameters; // 0x98
	uint32_t bConvertedDuplicateParametersToSharedParameters : 1; // 0xa8
};

struct USeqEvent_StadiumTeamColorsChanged_TA {
	int32_t Team; // 0x180
	FVector Primary; // 0x184
	FVector Secondary; // 0x190
};

struct UWebRequest_X {
	uint32_t bZipRequest : 1; // 0x60
	uint32_t bZipResponse : 1; // 0x60
	uint32_t bLogRequest : 1; // 0x60
	uint32_t bLogResponse : 1; // 0x60
	uint32_t bConnectionReset : 1; // 0x60
	EWebRequestState RequestState; // 0x64
	FString URL; // 0x68
	ObjectProperty HTTPRequest; // 0x78
	ObjectProperty HttpResponse; // 0x80
	TArray<char> Content; // 0x88
	FString StringContent; // 0x98
	TArray<char> ResponseData; // 0xa8
	ObjectProperty Error; // 0xb8
	DelegateProperty __EventCompleted__Delegate; // 0xc0
};

struct UBTC_AreaClear {
	ObjectProperty Source; // 0x1d0
	float SourcePredictionTime; // 0x1d8
	float Radius; // 0x1dc
};

struct UCameraState_Replay_TA {
	uint32_t bLocalMovement : 1; // 0x98
	uint32_t bClipToField : 1; // 0x98
	uint32_t bUIHighlightFocus : 1; // 0x98
	ObjectProperty OldFocusActor; // 0xa0
	FVector OldFocusActorLocation; // 0xa8
};

struct U__SeqAct_SetLoadout_TA__ApplyNewChangesToProductAssets_D2D4A9FF4D0553B70FE878A58DC1747C {
	ComponentProperty Mesh; // 0x60
	ObjectProperty Paint; // 0x68
	ObjectProperty TeamEdition; // 0x70
	int32_t TeamID; // 0x78
};

struct UOnlineStatsWrite {
	TArray<FStringIdToStringMapping> StatMappings; // 0x70
	TArray<FSettingsProperty> Properties; // 0x80
	TArray<int32_t> ViewIds; // 0x90
	TArray<int32_t> ArbitratedViewIds; // 0xa0
	int32_t RatingId; // 0xb0
	DelegateProperty __OnStatsWriteComplete__Delegate; // 0xb8
};

struct UAnimationCompressionAlgorithm_RemoveLinearKeys {
	float MaxPosDiff; // 0x78
	float MaxAngleDiff; // 0x7c
	float MaxEffectorDiff; // 0x80
	float MinEffectorDiff; // 0x84
	float EffectorDiffSocket; // 0x88
	float ParentKeyScale; // 0x8c
	uint32_t bRetarget : 1; // 0x90
	uint32_t bActuallyFilterLinearKeys : 1; // 0x90
};

struct USeqEvent_PlayerSpawned {
	FVector SpawnLocation; // 0x180
	FRotator SpawnRotation; // 0x18c
};

struct UBTMoveModifier_Boost {
	float MinDistanceFromDestination; // 0x78
	float MaxAngleFromCar; // 0x7c
	float MaxAngleFromDestination; // 0x80
	ObjectProperty BoostPickup; // 0x88
	float LastCheckTime; // 0x90
};

struct UPremiumSkin_TA {
	ObjectProperty MIC; // 0x60
	EProductQuality Quality; // 0x68
	ESkinType SkinType; // 0x69
	FMaterialParams SkinParameters; // 0x70
	ObjectProperty Thumbnail; // 0xa0
	uint32_t bTeamFinishDisabled : 1; // 0xa8
	uint32_t bCustomFinishDisabled : 1; // 0xa8
	TArray<ObjectProperty> Attributes; // 0xb0
	TArray<ObjectProperty> SkinSets; // 0xc0
	ObjectProperty AssetTemplate; // 0xd0
	ObjectProperty ProductTemplate; // 0xd8
};

struct U__TourGameUpdateDispatcher_TA__Init_F3EF4E854AF453F66C8D8C9DBA33B30F {
	FTourServerSettings Settings; // 0x60
};

struct UPartyMessage_Kick_X {
	FUniqueNetId KickPlayer; // 0xa8
	ELobbyKickReason KickReason; // 0xf0
};

struct UGFxData_ProductAttribute_ShopItem_TA {
	ObjectProperty BackgroundImage; // 0xb0
	ObjectProperty ItemLogo; // 0xb8
};

struct U__GFxData_Friends_TA__DeliverUnblockedEpicFriendInvites_F3E988FC463DF2E58D724A86AD20FD7D {
	int32_t BlockedInviteIdx; // 0x60
};

struct USaveLock_X {
	ObjectProperty GFxEngine; // 0x60
};

struct URPC_TrainingEditor_GetTrainingData_TA {
	FString Code; // 0xe8
	ObjectProperty TrainingData; // 0xf8
};

struct U__TourRegistration_TA__Register_2A7B13BE447FDEEFC484AB96C82E7180 {
	DelegateProperty Callback; // 0x60
};

struct USeqAct_SetPostProcess_TA {
	TArray<ObjectProperty> Chains; // 0x160
	uint32_t bReplaceCurrentChain : 1; // 0x170
};

struct AGameEvent_TrainingEditor_TA {
	float MinRoundTime; // 0xce8
	float MaxRoundTime; // 0xcec
	uint32_t bNoEditor : 1; // 0xcf0
	uint32_t bDisplayedRedoPenaltyMessage : 1; // 0xcf0
	uint32_t bUnsavedChanges : 1; // 0xcf0
	int32_t PointsScoredThisRound; // 0xcf4
	ObjectProperty ResetModal; // 0xcf8
	int32_t ShotAttempt; // 0xd00
	int32_t RedoTotal; // 0xd04
	int32_t GoalieScore; // 0xd08
	EPlayTestType PlayTestType; // 0xd0c
	TArray<ObjectProperty> GoalMeshBlockers; // 0xd10
	ObjectProperty GoalMeshBlockerArchetype; // 0xd20
	ObjectProperty TrainingData; // 0xd28
	FName PrePlaytestState; // 0xd30
	float SaveDelayTime; // 0xd38
	float SaveCooldown; // 0xd3c
	FString TrainingFileName; // 0xd40
	DelegateProperty __EventRoundTimeChanged__Delegate; // 0xd50
	DelegateProperty __EventRoundChanged__Delegate; // 0xd68
	DelegateProperty __EventRoundFinished__Delegate; // 0xd80
	DelegateProperty __EventPlaytestStarted__Delegate; // 0xd98
	DelegateProperty __EventUnsavedChanges__Delegate; // 0xdb0
	DelegateProperty __EventSaveResult__Delegate; // 0xdc8
};

struct UPsyNetService_Reservation_X {
	FCheckReservationResponse Reservation; // 0x90
};

struct UProductAttribute_Licensed_TA {
	ObjectProperty ReplacementProduct; // 0x80
};

struct UAnimSet {
	uint32_t bAnimRotationOnly : 1; // 0x60
	TArray<FName> TrackBoneNames; // 0x68
	TArray<ObjectProperty> Sequences; // 0x78
	TMap<None, None> SequenceCache; // 0x88
	TArray<FAnimSetMeshLinkup> LinkupCache; // 0xd8
	TMap<None, None> SkelMesh2LinkupCache; // 0xe8
	TArray<char> BoneUseAnimTranslation; // 0x138
	TArray<char> ForceUseMeshTranslation; // 0x148
	TArray<FName> UseTranslationBoneNames; // 0x158
	TArray<FName> ForceMeshTranslationBoneNames; // 0x168
	FName PreviewSkelMeshName; // 0x178
	FName BestRatioSkelMeshName; // 0x180
};

struct U__TAsyncResult__array_ClubInvite_X__NotifyOnResult_B48145C84AC791102F353E8E6ED411BC {
	DelegateProperty Callback; // 0x60
};

struct U__PlayerController_TA__ClientNotifyChallengedToHonorDuel_5345A5534A1B5D09B37A379B8390F646 {
	FUniqueNetId PlayerID; // 0x60
};

struct UPsyNetService_AutoTourCompletedResultReceived_TA {
	FTournamentEndData EndOfTournamentData; // 0x90
};

struct UOnlineGameDLC_X {
	int32_t SyncInterval; // 0x98
	float PlayerOwnershipSyncInterval; // 0x9c
	TArray<FPlayerDLCInfo> PlayerDLCInfos; // 0xa0
	TArray<FSteamWebRequestData> SteamWebRequests; // 0xb0
	DelegateProperty __EventValidationReady__Delegate; // 0xc0
};

struct URPC_TrainingEditor_ListPlayerTrainingDataTimestamp_TA {
	TArray<FString> Codes; // 0xe8
	TArray<FCodeTimePair> TrainingData; // 0xf8
};

struct ABrush {
	ECsgOper CsgOper; // 0x268
	FColor BrushColor; // 0x26c
	int32_t PolyFlags; // 0x270
	uint32_t bColored : 1; // 0x274
	uint32_t bSolidWhenSelected : 1; // 0x274
	uint32_t bPlaceableFromClassBrowser : 1; // 0x274
	ObjectProperty Brush; // 0x278
	ComponentProperty BrushComponent; // 0x280
	TArray<FGeomSelection> SavedSelections; // 0x288
};

struct ARB_ConstraintActor {
	ObjectProperty ConstraintActor1; // 0x268
	ObjectProperty ConstraintActor2; // 0x270
	ObjectProperty ConstraintSetup; // 0x278
	ObjectProperty ConstraintInstance; // 0x280
	uint32_t bDisableCollision : 1; // 0x288
	uint32_t bUpdateActor1RefFrame : 1; // 0x288
	uint32_t bUpdateActor2RefFrame : 1; // 0x288
	ObjectProperty PulleyPivotActor1; // 0x290
	ObjectProperty PulleyPivotActor2; // 0x298
};

struct UOvertimeSettings_TA {
	EMatchTieBreaker TieBreaker; // 0x60
	int32_t OvertimeGameTime; // 0x64
};

struct ACamera_Edit_TA {
	FName CameraMode; // 0x7a8
	ObjectProperty CurrentCameraState; // 0x7b0
};

struct ASpecialPickup_Demolish_TA {
	EDemolishTarget DemolishTarget; // 0x388
	EDemolishSpeed DemolishSpeed; // 0x389
	EDemolishTarget OldTarget; // 0x38a
	EDemolishSpeed OldSpeed; // 0x38b
};

struct AHeightFog {
	ComponentProperty Component; // 0x268
	uint32_t bEnabled : 1; // 0x270
};

struct UClientReservationMessage_X {
	FServerReservationData Reservation; // 0x60
};

struct U__OnlineClubCache_X__GetPlayerClubDetails_28394E004666DE8CDDD3A38E1ECCFC0B {
	FUniqueNetId PlayerID; // 0x60
};

struct URPC_ProductsDebugAddRandom_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t Count; // 0x130
	int32_t SeriesID; // 0x134
	TArray<FOnlineProductData> Drops; // 0x138
	TArray<ObjectProperty> Products; // 0x148
};

struct ADynamicAnchor {
	ObjectProperty CurrentUser; // 0x388
};

struct ANavMeshObstacle {
	FPointer VfTable_IInterface_NavMeshPathObstacle; // 0x268
	uint32_t bEnabled : 1; // 0x270
	uint32_t bPreserveInternalGeo : 1; // 0x270
};

struct USeqAct_CameraLookAt {
	uint32_t bAffectCamera : 1; // 0x160
	uint32_t bAlwaysFocus : 1; // 0x160
	uint32_t bAdjustCamera : 1; // 0x160
	uint32_t bTurnInPlace : 1; // 0x160
	uint32_t bIgnoreTrace : 1; // 0x160
	uint32_t bAffectHead : 1; // 0x160
	uint32_t bRotatePlayerWithCamera : 1; // 0x160
	uint32_t bToggleGodMode : 1; // 0x160
	uint32_t bLeaveCameraRotation : 1; // 0x160
	uint32_t bDisableInput : 1; // 0x160
	uint32_t bUsedTimer : 1; // 0x160
	uint32_t bCheckLineOfSight : 1; // 0x160
	FVector2D InterpSpeedRange; // 0x164
	FVector2D InFocusFOV; // 0x16c
	FName FocusBoneName; // 0x174
	FString TextDisplay; // 0x180
	float TotalTime; // 0x190
	float CameraFOV; // 0x194
	float RemainingTime; // 0x198
};

struct UAimControl_TA {
	int32_t LevelCap; // 0x60
	FAimAssistSettings GroundBoost; // 0x64
	FAimAssistSettings BoostSteer; // 0x98
	FAimAssistSettings Throttle; // 0xcc
	FAimAssistSettings Steer; // 0x100
	FAimAssistSettings Jump; // 0x134
	FAimAssistSettings Dodge; // 0x168
	FAimAssistSettings AirTilt; // 0x19c
	FAimAssistSettings Handbrake; // 0x1d0
	FAimAssistSettings Aerial; // 0x204
	FAimAssistSettings AerialJump; // 0x238
	FAimAssistSettings AerialBoost; // 0x26c
	FAimAssistSettings FlipOver; // 0x2a0
};

struct UCacheTimer_X {
	float CacheTimeoutSeconds; // 0x70
	float CacheExpireTime; // 0x74
	uint32_t bEnabled : 1; // 0x78
	DelegateProperty __EventExpired__Delegate; // 0x80
};

struct UProductAttribute_RequiresOwnedProduct_TA {
	ObjectProperty Product; // 0x80
};

struct UPlayerReportComponent_TA {
	TArray<FUniqueNetId> ReportablePlayers; // 0xa0
	TArray<FReportedPlayerInfo> ReportedPlayers; // 0xb0
};

struct UParticleModuleSize {
	FRawDistributionVector StartSize; // 0x70
};

struct UPartyClubSync_TA {
	ObjectProperty Party; // 0x60
	ObjectProperty Clubs; // 0x68
	ObjectProperty PsyNet; // 0x70
	TArray<FUniqueNetId> PlayerIDs; // 0x78
};

struct UGFxData_TourMatchmaking_TA {
	ObjectProperty TourMatchmaking; // 0x98
	ObjectProperty GameVersion; // 0xa0
};

struct UCameraState_DirectorPlayerView_TA {
	ObjectProperty BallCameraState; // 0x180
	float MinimumHit; // 0x188
	float MinimumHitSeparation; // 0x18c
	float StaleDistance; // 0x190
	float MinimumTimeToBall; // 0x194
	float CarChangeTimePadding; // 0x198
	FViewTargetTransitionParams CarChangeBlendParams; // 0x19c
	FInterpCurveFloat CarChangeBlendTimeForDistance; // 0x1b0
	float MinBlendContinuity; // 0x1c8
	float MaxBlendDistance; // 0x1cc
	float MaintainCurrentDistance; // 0x1d0
	float MaintainCurrentHitBias; // 0x1d4
	float MaintainBallScorability; // 0x1d8
	float MaintainBallScorabilityViewRating; // 0x1dc
	FInterpCurveFloat ContinuityBias; // 0x1e0
	float MinimumViewRating; // 0x1f8
	float AttackerBias; // 0x1fc
	float AttackingGoalDistance; // 0x200
	float BadFocusDistance; // 0x204
	float BadFocusViewRating; // 0x208
	float BadFocusViewRatingDuration; // 0x20c
	ObjectProperty FocusCar; // 0x210
	float LastCarChangeTime; // 0x218
	uint32_t bIsRelevant : 1; // 0x21c
	uint32_t bBlending : 1; // 0x21c
	uint32_t bExceptionallyBadFocus : 1; // 0x21c
	uint32_t bBadViewRating : 1; // 0x21c
	float BlendTime; // 0x220
	FCameraOrientation SnapshotPOV; // 0x224
	float BadViewRatingStart; // 0x250
};

struct AAISwitchablePylon {
	uint32_t bOpen : 1; // 0x4a8
};

struct URPC_UpdateSkills_X {
	int32_t Playlist; // 0x170
	TArray<FUpdatedPlayerSkillRating> NewSkills; // 0x178
	TArray<FPlayerSeasonRewardProgress> NewRewardLevels; // 0x188
	ObjectProperty MatchData; // 0x198
};

struct UMaterialParamsSet_TA {
	TArray<FMaterialTextureParam> TextureParameters; // 0x60
	TArray<FMaterialVectorParam> VectorParameters; // 0x70
	TArray<FMaterialScalarParam> ScalarParameters; // 0x80
};

struct USphereCollisionShape_X {
	float StartRadius; // 0x80
	float EndRadius; // 0x84
};

struct AGameEvent_Team_TA {
	TArray<ObjectProperty> TeamArchetypes; // 0x720
	TArray<ObjectProperty> Teams; // 0x730
	int32_t MaxTeamSize; // 0x740
	int32_t NumBots; // 0x744
	uint32_t bMuteOppositeTeams : 1; // 0x748
	uint32_t bDisableMutingOtherTeam : 1; // 0x748
	uint32_t bForfeit : 1; // 0x748
	uint32_t bUnfairTeams : 1; // 0x748
	uint32_t bAlwaysAutoSelectTeam : 1; // 0x748
	ObjectProperty RematchVoteArchetype; // 0x750
	ObjectProperty RematchVote; // 0x758
	TArray<ObjectProperty> PreloadedBotAssets; // 0x760
	DelegateProperty __EventTeamsCreated__Delegate; // 0x770
};

struct UMaterialExpressionFloor {
	FExpressionInput Input; // 0xc0
};

struct UCrowdActorSettings_TA {
	float NoiseRiseRate; // 0x60
	float NoiseFallRate; // 0x64
	FRandomRange IdleNoise; // 0x68
	FRandomRange IdleNoiseDuration; // 0x70
	ObjectProperty CountdownStartNoise; // 0x78
	ObjectProperty CountdownEndNoise; // 0x80
	ObjectProperty OvertimeStartNoise; // 0x88
	ObjectProperty TimeAlmostOutNoise; // 0x90
	TArray<FStatCrowdNoise> StatNoises; // 0x98
	ObjectProperty RandomChantsSound; // 0xa8
	FRandomRange RandomChantsDelay; // 0xb0
	uint32_t UpdateStatNoises : 1; // 0xb8
	FInterpCurveFloat BallGoalDistanceNoiseCurve; // 0xc0
	FVector GoalDotDirection; // 0xd8
	float MinGoalDotAngle; // 0xe4
	TArray<FBallHitCrowdNoise> BallHitNoises; // 0xe8
	float BallHitNoiseDelay; // 0xf8
	TArray<ObjectProperty> CountDownSoundList; // 0x100
	TArray<ObjectProperty> RoundCountDownSoundList; // 0x110
	ObjectProperty OneMinRemaining; // 0x120
	ObjectProperty ThirtySecondsRemaining; // 0x128
	ObjectProperty CrowdStingerWin; // 0x130
	ObjectProperty CrowdStingerLose; // 0x138
	ObjectProperty CrowdStingerForfeit; // 0x140
	ObjectProperty CrowdStartOverTimeSound; // 0x148
	ObjectProperty MatchEndedEncore; // 0x150
	float MatchEndedEncoreDelay; // 0x158
	FCrowdDefenseSettings DefenseChant; // 0x160
};

struct UCameraTrackPoint_TA {
	int32_t frame; // 0x60
	float Time; // 0x64
	FVector Location; // 0x68
	FRotator Rotation; // 0x74
	float FOV; // 0x80
};

struct AStatFactory_Breakout_TA {
	ObjectProperty BreakoutDamage; // 0x458
	ObjectProperty BreakoutDamageLarge; // 0x460
	int32_t BreakoutSaveDamageThreshold; // 0x468
	int32_t BreakoutDamageLargeThreshold; // 0x46c
	float ShotGoalTimestep; // 0x470
	ObjectProperty BreakoutEvent; // 0x478
	FVector FieldCenter; // 0x480
};

struct U__GameEvent_Soccar_TA__ReportFps_4FDAB6914ADE9D0617A2A5AC61E56801 {
	int32_t TotalFrames; // 0x60
};

struct UGFxData_ServerPerformanceStats_TA {
	EConnectionQualityState ServerPerformanceStatus; // 0x98
	uint32_t bReportedServer : 1; // 0x9c
};

struct UDataStoreClient {
	TArray<FString> GlobalDataStoreClasses; // 0x70
	TArray<ObjectProperty> GlobalDataStores; // 0x80
	TArray<FString> PlayerDataStoreClassNames; // 0x90
	TArray<FNone*> PlayerDataStoreClasses; // 0xa0
	TArray<FPlayerDataStoreGroup> PlayerDataStores; // 0xb0
};

struct AGameEvent_GameEditor_TA {
	FNone* SaveDataClass; // 0xc78
	ObjectProperty SaveData; // 0xc80
	int32_t ActiveRoundNumber; // 0xc88
	TArray<FSpawnArchetypeData> SpawnableArchetypes; // 0xc90
	TArray<ObjectProperty> CarSpawnPoints; // 0xca0
	ObjectProperty EditorPawnArchetype; // 0xcb0
	int32_t MaxRounds; // 0xcb8
	TArray<FActorHistory> UndoHistory; // 0xcc0
	int32_t HistoryPosition; // 0xcd0
	int32_t MaxUndoHistory; // 0xcd4
	ObjectProperty FXActorArchetype; // 0xcd8
	ObjectProperty FXActor; // 0xce0
};

struct UTourRewards_TA {
	TArray<FRewardsResult> Results; // 0x60
	TArray<FRewardsRequest> Requests; // 0x70
	DelegateProperty __OnGetRewards__Delegate; // 0x80
};

struct USeqAct_SpawnActor_TA {
	ObjectProperty ActorArchetype; // 0x160
	ObjectProperty Transform; // 0x168
	ObjectProperty SpawnedActor; // 0x170
};

struct AStayAsPartyVoteYes_TA {
	ObjectProperty Voter; // 0x268
};

struct UBTC_Vehicle {
	uint32_t bOnBack : 1; // 0xe8
	uint32_t bNotOnBack : 1; // 0xe8
	uint32_t bWheelsOnGround : 1; // 0xe8
	uint32_t bWheelsNotOnGround : 1; // 0xe8
	float GroundNormalGreaterThan; // 0xec
	float GroundNormalLessThan; // 0xf0
	float ForwardSpeedGreaterThan; // 0xf4
	float ForwardSpeedLessThan; // 0xf8
};

struct UTradeErrors_TA {
	ObjectProperty AttemptedCurrencyGifting; // 0x80
	ObjectProperty AttemptedCurrencyExchange; // 0x88
	ObjectProperty UserTradeBanned; // 0x90
	ObjectProperty TradeNotAllowed; // 0x98
	ObjectProperty OtherPlayerTradeNotAllowed; // 0xa0
	ObjectProperty OtherPlayerBanned; // 0xa8
	ObjectProperty TradeMinLevelNotReached; // 0xb0
	ObjectProperty TradeMinPlayTimeNotReached; // 0xb8
	ObjectProperty TradeDailyLimitReached; // 0xc0
	ObjectProperty TradeExceedCurrencyLimit; // 0xc8
	ObjectProperty TradePlayerNotInParty; // 0xd0
};

struct UPartyMessage_SetPlatformParty_X {
	FUniqueLobbyId PlatformPartyID; // 0xa8
};

struct UIniLocPatcher {
	TArray<FIniLocFileEntry> Files; // 0x60
	uint32_t bRequestEmsFileList : 1; // 0x70
	int32_t MaxCachedFileAge; // 0x74
	TScriptInterface<Class> TitleFileInterface; // 0x78
	TScriptInterface<Class> TitleFileCacheInterface; // 0x88
	TArray<DelegateProperty> ReadTitleFileCompleteDelegates; // 0x98
	DelegateProperty __OnReadTitleFileComplete__Delegate; // 0xa8
	DelegateProperty __OnAllTitleFilesCompleted__Delegate; // 0xc0
};

struct U__BinaryUploader_TA__Upload_A5C269D2412C078A2ABAF982B33595D8 {
	ObjectProperty Request; // 0x60
};

struct UUIDataStore_OnlinePlayerData {
	ObjectProperty FriendsProvider; // 0xa0
	int32_t PlayerControllerId; // 0xa8
	FString PlayerNick; // 0xb0
	FString ProfileSettingsClassName; // 0xc0
	FNone* ProfileSettingsClass; // 0xd0
	ObjectProperty ProfileProvider; // 0xd8
	FString ProfileProviderClassName; // 0xe0
	FNone* ProfileProviderClass; // 0xf0
	FString PlayerStorageClassName; // 0xf8
	FNone* PlayerStorageClass; // 0x108
	ObjectProperty StorageProvider; // 0x110
	FString StorageProviderClassName; // 0x118
	FNone* StorageProviderClass; // 0x128
	ObjectProperty FriendMessagesProvider; // 0x130
	ObjectProperty AchievementsProvider; // 0x138
	FString FriendsProviderClassName; // 0x140
	FNone* FriendsProviderClass; // 0x150
	FString FriendMessagesProviderClassName; // 0x158
	FNone* FriendMessagesProviderClass; // 0x168
	FString AchievementsProviderClassName; // 0x170
	FNone* AchievementsProviderClass; // 0x180
	FString PartyChatProviderClassName; // 0x188
	FNone* PartyChatProviderClass; // 0x198
	ObjectProperty PartyChatProvider; // 0x1a0
};

struct USeqAct_AttachToActor {
	uint32_t bDetach : 1; // 0x160
	uint32_t bHardAttach : 1; // 0x160
	uint32_t bUseRelativeOffset : 1; // 0x160
	uint32_t bUseRelativeRotation : 1; // 0x160
	FName BoneName; // 0x164
	FVector RelativeOffset; // 0x16c
	FRotator RelativeRotation; // 0x178
};

struct UOnlineGameLanBrowser_X {
	FString StartSearchFailString; // 0x98
	FString SearchingString; // 0xa8
	FString FoundServerString; // 0xb8
	FCustomMatchSettings Filter; // 0xc8
	uint32_t bIsHostQuery : 1; // 0x158
	float SearchTimeout; // 0x15c
	ComponentProperty LanBeacon; // 0x160
	DelegateProperty __EventSearchNewResponse__Delegate; // 0x168
	DelegateProperty __EventSearchStatus__Delegate; // 0x180
	DelegateProperty __EventSearchStateChanged__Delegate; // 0x198
	DelegateProperty __EventSearchComplete__Delegate; // 0x1b0
	DelegateProperty __EventSearchError__Delegate; // 0x1c8
};

struct AProcBuilding {
	ObjectProperty Ruleset; // 0x2a8
	TArray<FPBMeshCompInfo> BuildingMeshCompInfos; // 0x2b0
	TArray<FPBFracMeshCompInfo> BuildingFracMeshCompInfos; // 0x2c0
	ComponentProperty SimpleMeshComp; // 0x2d0
	uint32_t bGenerateRoofMesh : 1; // 0x2d8
	uint32_t bGenerateFloorMesh : 1; // 0x2d8
	uint32_t bApplyRulesToRoof : 1; // 0x2d8
	uint32_t bApplyRulesToFloor : 1; // 0x2d8
	uint32_t bSplitWallsAtRoofLevels : 1; // 0x2d8
	uint32_t bSplitWallsAtWallEdges : 1; // 0x2d8
	uint32_t bQuickEdited : 1; // 0x2d8
	uint32_t bBuildingBrushCollision : 1; // 0x2d8
	uint32_t bDebugDrawEdgeInfo : 1; // 0x2d8
	uint32_t bDebugDrawScopes : 1; // 0x2d8
	TArray<ComponentProperty> LODMeshComps; // 0x2e0
	TArray<FPBFaceUVInfo> LODMeshUVInfos; // 0x2f0
	TArray<FPBScope2D> TopLevelScopes; // 0x300
	int32_t NumMeshedTopLevelScopes; // 0x310
	TArray<FPBFaceUVInfo> TopLevelScopeUVInfos; // 0x318
	TArray<FPBScopeProcessInfo> TopLevelScopeInfos; // 0x328
	TArray<FPBEdgeInfo> EdgeInfos; // 0x338
	float MaxFacadeZ; // 0x348
	float MinFacadeZ; // 0x34c
	TArray<ObjectProperty> OverlappingBuildings; // 0x350
	float SimpleMeshMassiveLODDistance; // 0x360
	float RenderToTexturePullBackAmount; // 0x364
	int32_t RoofLightmapRes; // 0x368
	int32_t NonRectWallLightmapRes; // 0x36c
	float LODRenderToTextureScale; // 0x370
	FName ParamSwatchName; // 0x374
	TArray<FPBMaterialParam> BuildingMaterialParams; // 0x380
	TArray<ObjectProperty> BuildingMatParamMICs; // 0x390
	ObjectProperty LowLODPersistentActor; // 0x3a0
	ComponentProperty CurrentSimpleMeshComp; // 0x3a8
	ObjectProperty CurrentSimpleMeshActor; // 0x3b0
	TArray<ObjectProperty> AttachedBuildings; // 0x3b8
	int32_t BuildingInstanceVersion; // 0x3c8
};

struct U__FXActor_TA__ApplyPaintToAttachment_15BE03FB441BF235E0767E9F2599E0A1 {
	ObjectProperty PaintSettings; // 0x60
	ObjectProperty Paint; // 0x68
};

struct UProductAttribute_LicenseGroup_TA {
	ELicenseGroup Group; // 0x80
	uint32_t bRequireSameLicenseGroupOnBody : 1; // 0x84
};

struct UParticleModuleTypeDataTrail {
	uint32_t RenderGeometry : 1; // 0x70
	uint32_t RenderLines : 1; // 0x70
	uint32_t RenderTessellation : 1; // 0x70
	uint32_t Tapered : 1; // 0x70
	uint32_t SpawnByDistance : 1; // 0x70
	int32_t TessellationFactor; // 0x74
	FRawDistributionFloat Tension; // 0x78
	FVector SpawnDistance; // 0xa0
};

struct U__GameViewportClient_TA__AllowTournamentSplitscreen_7815D83E4098ACE018CD0087D66CF39B {
	FUniqueNetId PlayerIDCompare; // 0x60
};

struct UGFxData_PrivateMatch_TA {
	TArray<FGFxRegion> Regions; // 0x118
	FString ServerName; // 0x128
	FString Password; // 0x138
	int32_t SelectedMaxPlayerCount; // 0x148
	uint32_t bPublicMatch : 1; // 0x14c
	int32_t MinServerNameLength; // 0x150
	FString AlreadySearchingMessage; // 0x158
	FString AlreadySearchingForPublicMessage; // 0x168
	FString ServerNameLengthError; // 0x178
	FString DuplicateLanServerMessage; // 0x188
	SearchStatusOwner SearchStatusOwner; // 0x198
	ECustomMatchSettingsType SettingsType; // 0x199
};

struct U__GFxData_Products_TA__SlotContainsNewProducts_EBA6303B45E317D7647630B66AF34751 {
	int32_t SlotIndex; // 0x60
};

struct UPhysicsLODVerticalEmitter {
	int32_t ParticlePercentage; // 0x60
};

struct USoundNodeEnveloper {
	float LoopStart; // 0x78
	float LoopEnd; // 0x7c
	float DurationAfterLoop; // 0x80
	int32_t LoopCount; // 0x84
	uint32_t bLoopIndefinitely : 1; // 0x88
	uint32_t bLoop : 1; // 0x88
	ComponentProperty VolumeInterpCurve; // 0x90
	ComponentProperty PitchInterpCurve; // 0x98
};

struct UErrors_X {
	ObjectProperty UnknownError; // 0x80
	ObjectProperty RequestError; // 0x88
	ObjectProperty HTTPError; // 0x90
	ObjectProperty SessionNotActive; // 0x98
	ObjectProperty OSCS_NotConnected; // 0xa0
	ObjectProperty OSCS_Connected; // 0xa8
	ObjectProperty OSCS_ConnectionDropped; // 0xb0
	ObjectProperty OSCS_NoNetworkConnection; // 0xb8
	ObjectProperty OSCS_ServiceUnavailable; // 0xc0
	ObjectProperty OSCS_UpdateRequired; // 0xc8
	ObjectProperty OSCS_ServersTooBusy; // 0xd0
	ObjectProperty OSCS_DuplicateLoginDetected; // 0xd8
	ObjectProperty OSCS_InvalidUser; // 0xe0
	ObjectProperty OSCS_InvalidResponse; // 0xe8
	ObjectProperty OSCS_EpicAccountRequired; // 0xf0
	ObjectProperty OSCS_EpicAccountLinkingFailed; // 0xf8
	ObjectProperty ConnectionStatusErrors[0xd]; // 0x100
	ObjectProperty VersionMismatch; // 0x168
	ObjectProperty NoServers; // 0x170
	ObjectProperty FileDoesNotExist; // 0x178
	ObjectProperty FileLoadFail; // 0x180
	ObjectProperty FileLoadCorrupt; // 0x188
	ObjectProperty FileMountCorrupt; // 0x190
	ObjectProperty FileSaveFail; // 0x198
	ObjectProperty FileSaveNoSpace; // 0x1a0
	ObjectProperty FileSaveCorrupt; // 0x1a8
	ObjectProperty UserAuthBanned; // 0x1b0
	ObjectProperty NotLoggedInToPsynet; // 0x1b8
	ObjectProperty FriendsList; // 0x1c0
	ObjectProperty InviteLimitReached; // 0x1c8
	ObjectProperty OutOfRetries; // 0x1d0
	ObjectProperty AuthenticationFailed; // 0x1d8
	ObjectProperty NoExportCountry; // 0x1e0
	ObjectProperty UnauthorizedAccess; // 0x1e8
	ObjectProperty ServiceNotFound; // 0x1f0
	ObjectProperty FeatureDisabled; // 0x1f8
	ObjectProperty OtherPlayerFeatureDisabled; // 0x200
	ObjectProperty MatchmakingDisabled; // 0x208
	ObjectProperty NoValidPlaylistsSelected; // 0x210
	ObjectProperty PlaylistNotAvailable; // 0x218
	ObjectProperty PlayerNameNotSet; // 0x220
	ObjectProperty PlayerNameAlreadyTaken; // 0x228
	ObjectProperty PlayerNameTooShort; // 0x230
	ObjectProperty PlayerNameTooLong; // 0x238
	ObjectProperty PlayerNameInappropriate; // 0x240
	ObjectProperty PlayerNameInvalidCharacter; // 0x248
	ObjectProperty PlayerNameFailed; // 0x250
	ObjectProperty NotAuthorized; // 0x258
	ObjectProperty SessionAlreadyActive; // 0x260
	ObjectProperty GameServerPending; // 0x268
	ObjectProperty CacheError; // 0x270
	ObjectProperty WordFilterEvil; // 0x278
	ObjectProperty WordFilterPlatformError; // 0x280
	ObjectProperty WordFilterPlatformChatError; // 0x288
	ObjectProperty InvalidSettings; // 0x290
	ObjectProperty Maintenance; // 0x298
	ObjectProperty PlatformAuthError; // 0x2a0
	ObjectProperty MicrotransactionAuthExpired; // 0x2a8
	ObjectProperty CannotFriendSelf; // 0x2b0
	ObjectProperty InvalidPlayer; // 0x2b8
	ObjectProperty FriendRequestNotFound; // 0x2c0
	ObjectProperty FriendRequestFailed; // 0x2c8
	ObjectProperty AlreadyFriends; // 0x2d0
	ObjectProperty FriendLimitReached; // 0x2d8
	ObjectProperty LocalFriendLimitReached; // 0x2e0
	ObjectProperty RemoteFriendLimitReached; // 0x2e8
	ObjectProperty LocalHostConnectionError; // 0x2f0
	ObjectProperty UGCRestricted; // 0x2f8
	ObjectProperty MicrotransactionServiceMaintenance; // 0x300
	ObjectProperty GenericStorageOutOfSync; // 0x308
	ObjectProperty GenericStorageSync_RequestNotFound; // 0x310
	ObjectProperty SignatureMismatch; // 0x318
	ObjectProperty JsonDeserialization; // 0x320
	ObjectProperty InvalidPlatform; // 0x328
	ObjectProperty InvalidPlatformForCodeRedemption; // 0x330
	ObjectProperty InvalidParameters; // 0x338
	ObjectProperty NotMatchmaking; // 0x340
	ObjectProperty AccessDenied; // 0x348
	ObjectProperty PerConDisconnected; // 0x350
	ObjectProperty AccountNotFound; // 0x358
	ObjectProperty ServerNotFound; // 0x360
	ObjectProperty ExpiredDsConnectToken; // 0x368
	ObjectProperty MatchmakingNoInternet; // 0x370
	ObjectProperty PartyRankDisparity; // 0x378
};

struct ACoverLink {
	uint32_t GLOBAL_bUseSlotMarkers : 1; // 0x388
	uint32_t bDisabled : 1; // 0x388
	uint32_t bClaimAllSlots : 1; // 0x388
	uint32_t bAutoSort : 1; // 0x388
	uint32_t bAutoAdjust : 1; // 0x388
	uint32_t bCircular : 1; // 0x388
	uint32_t bLooped : 1; // 0x388
	uint32_t bPlayerOnly : 1; // 0x388
	uint32_t bDynamicCover : 1; // 0x388
	uint32_t bFractureOnTouch : 1; // 0x388
	uint32_t bDebug_FireLinks : 1; // 0x388
	uint32_t bDebug_ExposedLinks : 1; // 0x388
	uint32_t bDebug_CoverGen : 1; // 0x388
	uint32_t bDoAutoSlotDensityFixup : 1; // 0x388
	float LeanTraceDist; // 0x38c
	TArray<FCoverSlot> Slots; // 0x390
	TArray<FDynamicLinkInfo> DynamicLinkInfos; // 0x3a0
	TArray<ObjectProperty> Claims; // 0x3b0
	float InvalidateDistance; // 0x3c0
	float MaxFireLinkDist; // 0x3c4
	FVector CircularOrigin; // 0x3c8
	float CircularRadius; // 0x3d4
	float AlignDist; // 0x3d8
	float AutoCoverSlotInterval; // 0x3dc
	float StandHeight; // 0x3e0
	float MidHeight; // 0x3e4
	FVector StandingLeanOffset; // 0x3e8
	FVector CrouchLeanOffset; // 0x3f4
	FVector PopupOffset; // 0x400
	float SlipDist; // 0x40c
	float TurnDist; // 0x410
	float DangerScale; // 0x414
	ObjectProperty NextCoverLink; // 0x418
	ECoverLocationDescription LocationDescription; // 0x420
};

struct UNavMeshGoal_PolyEncompassesAI {
	FVector OverrideExtentToCheck; // 0x80
};

struct UParticleModuleSpawn {
	FRawDistributionFloat Rate; // 0x78
	FRawDistributionFloat RateScale; // 0xa0
	EParticleBurstMethod ParticleBurstMethod; // 0xc8
	TArray<FParticleBurst> BurstList; // 0xd0
};

struct UDebugDrawer {
	FColor DefaultTextColor; // 0x60
	uint32_t bSilent : 1; // 0x64
	uint32_t bPrintActorsInline : 1; // 0x64
	int32_t Indentation; // 0x68
	FString IndentationString; // 0x70
	TArray<ObjectProperty> PrintedObjects; // 0x80
	TArray<ObjectProperty> QueuedObjects; // 0x90
	int32_t PrintObjectCount; // 0xa0
	DelegateProperty __LogFunc__Delegate; // 0xa8
};

struct UMorphNodeWeightBase {
	TArray<FMorphNodeConn> NodeConns; // 0xa0
};

struct URPCConfig_X {
	TArray<FNone*> DisabledClasses; // 0x78
	TArray<FString> DisabledServices; // 0x88
	int32_t MaxRPCsPerBatch; // 0x98
};

struct UOnlineGameDedicatedServer_X {
	QWordProperty GameServerID; // 0x180
	FString GameServerHost; // 0x188
	int32_t EnvironmentZone; // 0x198
	ObjectProperty GameStats; // 0x1a0
	ObjectProperty Registration; // 0x1a8
	ObjectProperty Reservations; // 0x1b0
	ObjectProperty Clanforge; // 0x1b8
	FString Region; // 0x1c0
	int32_t CurrentPlaylistId; // 0x1d0
	int32_t MutatorIndex; // 0x1d4
	float AverageMMR; // 0x1d8
	float AverageConservativeMMR; // 0x1dc
	int32_t MachineId; // 0x1e0
	FCustomMatchSettings CustomMatch; // 0x1e8
	FUniqueNetId CustomMatchOwner; // 0x278
	QWordProperty CustomMatchClubID; // 0x2c0
	uint32_t bQueuedShutdown : 1; // 0x2c8
	uint32_t bFindingReplacementServer : 1; // 0x2c8
	uint32_t bHasValidMigrationServer : 1; // 0x2c8
	uint32_t bDisableMatchmakingBan : 1; // 0x2c8
	uint32_t bBotTest : 1; // 0x2c8
	uint32_t bUseNetworkNextDriver : 1; // 0x2c8
	QWordProperty ReplacementServerID; // 0x2d0
	ComponentProperty PlayerTracker; // 0x2d8
	FNone* MatchRecorderClass; // 0x2e0
	ObjectProperty MatchRecorder; // 0x2e8
	ObjectProperty MatchLog; // 0x2f0
	ObjectProperty Config; // 0x2f8
	ObjectProperty PsyNetConfig; // 0x300
	DelegateProperty __EventFoundNewDedicatedServerForPlayers__Delegate; // 0x308
	DelegateProperty __EventAverageMMRChanged__Delegate; // 0x320
	DelegateProperty __EventPlaylistSet__Delegate; // 0x338
	DelegateProperty __EventPrivateMatchSettingsChanged__Delegate; // 0x350
	DelegateProperty __EventInactive__Delegate; // 0x368
	DelegateProperty __EventActive__Delegate; // 0x380
	DelegateProperty __EventMatchGUIDChanged__Delegate; // 0x398
};

struct UMatchBroadcastLog_TA {
	FPointer Log; // 0x60
};

struct UPSC_Constrained_TA {
	float WorldZ; // 0x3e0
	uint32_t bAttachedRotation : 1; // 0x3e4
};

struct UCameraState_LiveReplay_TA {
	FVector LocationOffset; // 0x90
	FInterpCurveFloat FocusSpeedOverTime; // 0xa0
	float CarBallFocusBlendDistance; // 0xb8
	float Distance; // 0xbc
	float FOV; // 0xc0
	float SlomoInterpTime; // 0xc4
	float SlomoDistance; // 0xc8
	float SlomoFOV; // 0xcc
	FVector VelocityPrediction; // 0xd0
	float InterpToFieldCenterRate; // 0xdc
	float InterpToFieldCenterOffset; // 0xe0
	float ExplosionFocusDelay; // 0xe4
	float ScorerOffsetInterpSpeed; // 0xe8
	ObjectProperty SoccarGame; // 0xf0
	ObjectProperty FocusCar; // 0xf8
	ObjectProperty FocusBall; // 0x100
	uint32_t bHasDoneFirstUpdate : 1; // 0x108
	uint32_t bCanUpdate : 1; // 0x108
	uint32_t bSetGoalScorerFocusOffset : 1; // 0x108
	float LastFocusChangeTime; // 0x10c
	float SlomoTime; // 0x110
	ComponentProperty Goal; // 0x118
	FVector GoalScorerFocusOffset; // 0x120
};

struct U__OnlineGameDedicatedServer_TA__InitMatchLogUpload_8B759C964A480E0897D0279F00D6200D {
	ObjectProperty Log; // 0x60
	ObjectProperty RPC; // 0x68
};

struct UPlaylistSkillDataSave_TA {
	TArray<FPlaylistSkillData> SkillData; // 0xc8
};

struct USeqAct_AttachFX_TA {
	ComponentProperty PSC; // 0x160
};

struct U__ProductOverride_MaterialParameter_TA__ApplyOverrideToMesh_CB30F80E444F630613C622B939475D81 {
	ObjectProperty MIC; // 0x60
};

struct USoundNodeMixer {
	TArray<float> InputVolume; // 0x78
};

struct UMenuSequencer_TA {
	TArray<ObjectProperty> Sequences; // 0xa8
	FName DefaultSequence; // 0xb8
	ObjectProperty CurrentSequence; // 0xc0
	ObjectProperty PendingSequence; // 0xc8
	ESequenceStatus Status; // 0xd0
	TArray<ObjectProperty> PendingSequenceQueue; // 0xd8
	DelegateProperty __EventSequenceChanged__Delegate; // 0xe8
};

struct U__GFxData_TradeLobby_TA__GetHashIDFromCurrencyID_32BF39F448C8229C946291BADE5C89BB {
	int32_t CurrencyID; // 0x60
};

struct UFogVolumeLinearHalfspaceDensityComponent {
	float PlaneDistanceFactor; // 0xf0
	FPlane HalfspacePlane; // 0x100
};

struct UOnlinePlayerStorage_X {
	ObjectProperty Queue; // 0x98
	ObjectProperty Sync; // 0xa0
	ObjectProperty Manifest; // 0xa8
};

struct UIntroCarTemplates_TA {
	TArray<FEditorIntroCar> IntroCars; // 0x60
};

struct UGFxData_MicroEvent_TA {
	ObjectProperty MicroEventConfig; // 0x98
	ObjectProperty MicroEvent; // 0xa0
	uint32_t bIsActive : 1; // 0xa8
};

struct UGameEngine_TA {
	ObjectProperty ServerConfig; // 0xb48
};

struct URPC_TrainingEditor_BrowseTrainingData_TA {
	uint32_t bFeaturedOnly : 1; // 0xe8
	TArray<ObjectProperty> TrainingData; // 0xf0
};

struct URPC_SchematicResourcesGet_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t TotalSchematicResources; // 0x130
};

struct UHttpRequestInterface {
	DelegateProperty __OnProcessRequestComplete__Delegate; // 0x60
};

struct UParticleModuleTrailTaper {
	ETrailTaperMethod TaperMethod; // 0x70
	FRawDistributionFloat TaperFactor; // 0x78
};

struct UUIDataStore_Registry {
	TArray<FRegistryKeyValuePair> RegistryData; // 0xa0
};

struct USeqAct_AddFloat {
	float ValueA; // 0x160
	float ValueB; // 0x164
	float FloatResult; // 0x168
	int32_t IntResult; // 0x16c
};

struct UWordFilterTypes_X {
	DelegateProperty __CommentSanitizedDelegate__Delegate; // 0x60
	DelegateProperty __CommentErrorDelegate__Delegate; // 0x78
};

struct URPC_FaceItFindMatchForPlayer2_TA {
	FUniqueNetId PlayerID; // 0xe8
};

struct ATerrain {
	TArray<FTerrainHeight> Heights; // 0x268
	TArray<FTerrainInfoData> InfoData; // 0x278
	TArray<FTerrainLayer> Layers; // 0x288
	int32_t NormalMapLayer; // 0x298
	TArray<FTerrainDecoLayer> DecoLayers; // 0x2a0
	TArray<FAlphaMap> AlphaMaps; // 0x2b0
	TArray<ComponentProperty> TerrainComponents; // 0x2c0
	int32_t NumSectionsX; // 0x2d0
	int32_t NumSectionsY; // 0x2d4
	TArray<FTerrainWeightedMaterial> WeightedMaterials; // 0x2d8
	TArray<ObjectProperty> WeightedTextureMaps; // 0x2e8
	int32_t MaxTesselationLevel; // 0x2f8
	int32_t MinTessellationLevel; // 0x2fc
	float TesselationDistanceScale; // 0x300
	float TessellationCheckDistance; // 0x304
	int32_t CollisionTesselationLevel; // 0x308
	FCachedTerrainMaterialArray CachedTerrainMaterials[0x2]; // 0x310
	int32_t NumVerticesX; // 0x330
	int32_t NumVerticesY; // 0x334
	int32_t NumPatchesX; // 0x338
	int32_t NumPatchesY; // 0x33c
	int32_t MaxComponentSize; // 0x340
	int32_t StaticLightingResolution; // 0x344
	uint32_t bIsOverridingLightResolution : 1; // 0x348
	uint32_t bBilinearFilterLightmapGeneration : 1; // 0x348
	uint32_t bCastShadow : 1; // 0x348
	uint32_t bForceDirectLightMap : 1; // 0x348
	uint32_t bCastDynamicShadow : 1; // 0x348
	uint32_t bEnableSpecular : 1; // 0x348
	uint32_t bBlockRigidBody : 1; // 0x348
	uint32_t bAllowRigidBodyUnderneath : 1; // 0x348
	uint32_t bAcceptsDynamicLights : 1; // 0x348
	uint32_t bMorphingEnabled : 1; // 0x348
	uint32_t bMorphingGradientsEnabled : 1; // 0x348
	uint32_t bLocked : 1; // 0x348
	uint32_t bHeightmapLocked : 1; // 0x348
	uint32_t bShowingCollision : 1; // 0x348
	uint32_t bUseWorldOriginTextureUVs : 1; // 0x348
	uint32_t bShowWireframe : 1; // 0x348
	ObjectProperty TerrainPhysMaterialOverride; // 0x350
	FLightingChannelContainer LightingChannels; // 0x358
	FLightmassPrimitiveSettings LightmassSettings; // 0x35c
	FPointer ReleaseResourcesFence; // 0x378
	int32_t EditorTessellationLevel; // 0x380
	TArray<FSelectedTerrainVertex> SelectedVertices; // 0x388
	FColor WireframeColor; // 0x398
	FGuid LightingGuid; // 0x39c
};

struct UProductAsset_Attachment_TA {
	TArray<FProductAttachment> Attachments; // 0xf8
	FName CustomAnimName; // 0x108
};

struct U__GFxData_PartyInvite_TA__HandlePlayerInvitePending_7B962B5A463CCB83D2894EA6E3F82367 {
	ObjectProperty Persona; // 0x60
};

struct USeqAct_SetObject {
	ObjectProperty DefaultValue; // 0x160
	ObjectProperty Value; // 0x168
};

struct U__WebImageCache_X__SyncUncachedImage_24E1EE9044B4E064F7A5DFAB3C26EB54 {
	ObjectProperty Task; // 0x60
};

struct UChallenge_TA {
	uint32_t bIsHidden : 1; // 0x1d8
	uint32_t bRewardsAvailable : 1; // 0x1d8
	uint32_t bNotifyNewInfo : 1; // 0x1d8
	uint32_t bComplete : 1; // 0x1d8
	int32_t CompleteCount; // 0x1dc
	QWordProperty ProgressResetTimeUTC; // 0x1e0
	TArray<ObjectProperty> RequirementProgress; // 0x1e8
};

struct UInterpTrackInstFloatProp {
	FPointer FloatProp; // 0x70
	float ResetFloat; // 0x78
	FPointer DistributionProp; // 0x80
};

struct UParticleModuleCollisionActor {
	TArray<FName> ActorsToCollideWith; // 0x188
	uint32_t bCheckPawnCollisions : 1; // 0x198
};

struct UParticleModuleEventReceiverKillParticles {
	uint32_t bStopSpawning : 1; // 0x80
};

struct UAddReservationMessagePrivate_X {
	FCustomMatchSettings Settings; // 0xd0
};

struct UClientConnectionTracker_TA {
	uint32_t bDisconnectedFromServer : 1; // 0xa8
	uint32_t bShowConnectionQualityIndicators : 1; // 0xa8
	EConnectionQualityState LatencyStatus; // 0xac
	EConnectionQualityState JitterStatus; // 0xad
	EConnectionQualityState PacketStatus; // 0xae
	float LatencyLastUpdateTime; // 0xb0
	float JitterRollingAverage; // 0xb4
	float JitterLastUpdateTime; // 0xb8
	float PacketLastUpdateTime; // 0xbc
	float NewPacketsRollingAverage; // 0xc0
	float PacketsLostRollingAverage; // 0xc4
	float RollingPercentLost; // 0xc8
	float PriorTotalPacketsInOut; // 0xcc
	float PriorTotalPacketsLost; // 0xd0
	float RollingBadPingTime; // 0xd4
	float RollingBadJitterTime; // 0xd8
	float RollingBadPacketLossTime; // 0xdc
	ObjectProperty ConnectionQualityConfig; // 0xe0
	ObjectProperty TrackedPRI; // 0xe8
	ObjectProperty ConnectionQualitySave; // 0xf0
	DelegateProperty __EventNetStatsPolled__Delegate; // 0xf8
};

struct UEffectsMap_X {
	TArray<FEffectsMapping> Effects; // 0x60
};

struct UPsyNetService_NewGame_X {
	int32_t Playlist; // 0xb0
	uint32_t IsBotMatch : 1; // 0xb4
	TArray<FString> BotNames; // 0xb8
	TArray<FPsyNetBeaconPartyReservation> Parties; // 0xc8
};

struct U__PartySequence_InvitedToPsyNetParty_X__HandlePlayerInvitedSilent_BD09F203446DE281B50761A9BB177F7A {
	FUniqueLobbyId InLobbyId; // 0x60
	FUniqueNetId InviterId; // 0x70
};

struct UProductAttribute_TeamForcedProduct_TA {
	ObjectProperty Teams[0x2]; // 0x80
};

struct UCarMeshComponentBase_TA {
	ObjectProperty BodyAsset; // 0x7b8
	ObjectProperty SkinAsset; // 0x7c0
	ObjectProperty WheelAsset; // 0x7c8
	FLinearColor TeamColorOverride; // 0x7d0
	FLinearColor CustomColorOverride; // 0x7e0
	int32_t Team; // 0x7f0
	int32_t TeamColorID; // 0x7f4
	int32_t CustomColorID; // 0x7f8
	ObjectProperty Logo; // 0x800
	uint32_t bSwapLogoColors : 1; // 0x808
	uint32_t bBoosting : 1; // 0x808
	uint32_t bLocalPlayer : 1; // 0x808
	ObjectProperty TeamFinish; // 0x810
	ObjectProperty CustomFinish; // 0x818
	FClubColorSet ClubColors; // 0x820
	TArray<ComponentProperty> Antennas; // 0x828
	TArray<ComponentProperty> WheelMeshes; // 0x838
	ObjectProperty BodyFX; // 0x848
	TArray<ObjectProperty> FXActors; // 0x850
	TArray<ObjectProperty> Behaviors; // 0x860
	ObjectProperty BodyFXActor; // 0x870
	FClientLoadoutOnlineData ProductAttributes; // 0x878
	TArray<FName> ProductAttachmentSockets; // 0x888
	int32_t QueuedTeamFinishID; // 0x898
	int32_t QueuedCustomFinishID; // 0x89c
	TArray<FInheritedObjects> ObjectsWithInheritedSettings; // 0x8a0
	DelegateProperty __EventPaintSettingsUpdated__Delegate; // 0x8b0
};

struct UGFxData_Replay_TA {
	FString FriendlyMapName; // 0x98
};

struct U__FXActor_TA__ApplyPaint_68391A964D76CB4B190631A6515FDC92 {
	ObjectProperty PaintSettings; // 0x60
	ObjectProperty Paint; // 0x68
};

struct UAppNotificationsBase {
	FLaunchNotificationInfo AppLaunchNotification; // 0x88
	DelegateProperty __OnReceivedLocalNotification__Delegate; // 0xc0
	DelegateProperty __OnReceivedRemoteNotification__Delegate; // 0xd8
};

struct UMCPBase {
	FPointer VfTable_FTickableObject; // 0x78
};

struct UPartyMetrics_X {
	FPartyMetricsData PartyData; // 0x80
};

struct UHandlingPreset_TA {
	FVehicleAxleData FrontAxle; // 0x60
	FVehicleAxleData BackAxle; // 0x74
	ObjectProperty PhysAsset; // 0x88
	FSimpleSpringSettings ChassisSpringDefaults; // 0x90
};

struct UDirectionalLightComponent {
	float TraceDistance; // 0x1c8
	float WholeSceneDynamicShadowRadius; // 0x1cc
	int32_t NumWholeSceneDynamicShadowCascades; // 0x1d0
	float CascadeDistributionExponent; // 0x1d4
	FLightmassDirectionalLightSettings LightmassSettings; // 0x1d8
};

struct UStatCategory_TA {
	TArray<ObjectProperty> Titles; // 0x60
	float Multiplier; // 0x70
};

struct UOnlineGameMatchmakingBase_X {
	ObjectProperty CheckReservation; // 0x98
	ObjectProperty StartMatchmakingTask; // 0xa0
	FString PingingRegionsString; // 0xa8
	DelegateProperty __EventFindGameComplete__Delegate; // 0xb8
	DelegateProperty __EventFindGameStatus__Delegate; // 0xd0
	DelegateProperty __EventFindGameError__Delegate; // 0xe8
	DelegateProperty __EventFindGameStateChanged__Delegate; // 0x100
};

struct URegionPingCache_TA {
	TArray<FCachedRegionPing> CachedRegionPings; // 0x60
	ObjectProperty OnlineGameRegionsRef; // 0x70
};

struct URPC_PsyNetSendIndividualChat_X {
	FUniqueNetId PlayerID; // 0xe8
	FString Message; // 0x130
};

struct UParticleModuleSizeMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x70
	uint32_t MultiplyX : 1; // 0x98
	uint32_t MultiplyY : 1; // 0x98
	uint32_t MultiplyZ : 1; // 0x98
};

struct AGreenScreen_TA {
	TArray<ComponentProperty> HiddenPrimitives; // 0x288
	uint32_t bOn : 1; // 0x298
};

struct USeqVar_ObjectVolume {
	float LastUpdateTime; // 0x108
	TArray<ObjectProperty> ContainedObjects; // 0x110
	TArray<FNone*> ExcludeClassList; // 0x120
	uint32_t bCollidingOnly : 1; // 0x130
};

struct UProductAssetReference_TA {
	ObjectProperty Asset; // 0x70
};

struct U__StayAsPartySystem_TA__FindHumanTeammatesOfID_E6A6DAF04F7194D380DA719AF2835499 {
	TArray<ObjectProperty> PRIs; // 0x60
	int32_t PlayerIndex; // 0x70
};

struct UCameraState_BreakoutLiveReplay_TA {
	float GoalVerticalOffset; // 0x130
};

struct USeqEvent_UIStateChange_TA {
	EUIMenuState UIState; // 0x180
};

struct UFeatureSystem {
	uint32_t Prime : 1; // 0x68
	uint32_t Matchmaking : 1; // 0x68
	uint32_t PrivateMatch : 1; // 0x68
	uint32_t SplitscreenMatch : 1; // 0x68
	uint32_t SplitscreenJoin : 1; // 0x68
	uint32_t SeasonMode : 1; // 0x68
	uint32_t Tutorial : 1; // 0x68
	uint32_t Garage : 1; // 0x68
	uint32_t Options : 1; // 0x68
	uint32_t ReplaySaves : 1; // 0x68
	uint32_t MainMenu : 1; // 0x68
	uint32_t MidgameMenu : 1; // 0x68
	uint32_t Party : 1; // 0x68
	uint32_t PsyNetParty : 1; // 0x68
	uint32_t PartyUpVoting : 1; // 0x68
	uint32_t Achievements : 1; // 0x68
	uint32_t Stats : 1; // 0x68
	uint32_t Leaderboards : 1; // 0x68
	uint32_t XP : 1; // 0x68
	uint32_t Chat : 1; // 0x68
	uint32_t LicenseAgreement : 1; // 0x68
	uint32_t FullCredits : 1; // 0x68
	uint32_t TrainingDifficulties : 1; // 0x68
	uint32_t Ads : 1; // 0x68
	uint32_t Microtransactions : 1; // 0x68
	uint32_t Spectator : 1; // 0x6c
	uint32_t CrossPlatformPrivateMatch : 1; // 0x6c
	uint32_t Lan : 1; // 0x6c
	uint32_t PlayerReporting : 1; // 0x6c
	uint32_t PodiumSpotlight : 1; // 0x6c
	uint32_t CustomTeamNames : 1; // 0x6c
	uint32_t CustomTeamColors : 1; // 0x6c
	uint32_t PlayerTrading : 1; // 0x6c
	uint32_t GaragePresets : 1; // 0x6c
	uint32_t PartyChat : 1; // 0x6c
	uint32_t OnlineServices : 1; // 0x6c
	uint32_t RemoveCrossPlatformProducts : 1; // 0x6c
	uint32_t Mutators : 1; // 0x6c
	uint32_t ProductValidation : 1; // 0x6c
	uint32_t PlayerTitle : 1; // 0x6c
	uint32_t DynamicThumbnails : 1; // 0x6c
	uint32_t MapPrefs : 1; // 0x6c
	uint32_t Workshop : 1; // 0x6c
	uint32_t Avatars : 1; // 0x6c
	uint32_t Tournaments : 1; // 0x6c
	uint32_t PreMatchLobby : 1; // 0x6c
	uint32_t Challenges : 1; // 0x6c
	uint32_t AntiAddiction : 1; // 0x70
	uint32_t Inventory : 1; // 0x70
	uint32_t TrainingEditor : 1; // 0x70
	uint32_t RedeemCode : 1; // 0x70
	uint32_t VoiceChat : 1; // 0x70
	uint32_t EditBindings : 1; // 0x70
	uint32_t UIScale : 1; // 0x70
	uint32_t SplitScreen : 1; // 0x70
	uint32_t Crossplay : 1; // 0x70
	uint32_t CompetitiveDivisions : 1; // 0x70
	uint32_t ControlPresets : 1; // 0x70
	uint32_t FreePlayMapSelection : 1; // 0x70
	uint32_t Clubs : 1; // 0x70
	uint32_t MatchAdmin : 1; // 0x70
	uint32_t FilterContent : 1; // 0x70
	uint32_t EncryptContent : 1; // 0x70
	uint32_t GarageSuperSonicTrail : 1; // 0x70
	uint32_t GarageBallExplosions : 1; // 0x70
	uint32_t GarageEngineAudio : 1; // 0x70
	uint32_t EsportsCamera : 1; // 0x70
	uint32_t OnlineXP : 1; // 0x70
	uint32_t PsyNetFriends : 1; // 0x70
	uint32_t ClanforgeReservation : 1; // 0x74
	uint32_t UserSettingObserver : 1; // 0x74
	uint32_t Metrics : 1; // 0x74
	uint32_t EOSMetrics : 1; // 0x74
	uint32_t MusicPlaylistSelection : 1; // 0x74
	uint32_t KeyboardAirPitchSafety : 1; // 0x74
	uint32_t SpecialEvents : 1; // 0x74
	uint32_t OnlineShop : 1; // 0x74
	uint32_t PlayerBannerCustomization : 1; // 0x74
	uint32_t AvatarBorder : 1; // 0x74
	uint32_t SecureUDP : 1; // 0x74
	uint32_t PsyNet : 1; // 0x74
	uint32_t OnlinePlayerStorage : 1; // 0x74
	uint32_t LocalSaveData : 1; // 0x74
	uint32_t CrowdV2 : 1; // 0x74
	uint32_t ChatBan : 1; // 0x74
	uint32_t BacktraceCrashDumps : 1; // 0x74
	uint32_t MusicStingers : 1; // 0x74
	uint32_t MonsterCarV2 : 1; // 0x74
	uint32_t SpotifyButton : 1; // 0x74
	uint32_t RocketPass : 1; // 0x74
	uint32_t PsyTag : 1; // 0x78
	uint32_t SeasonRewards : 1; // 0x78
	uint32_t BotDetection : 1; // 0x78
	uint32_t CrateRoulette : 1; // 0x78
	uint32_t FaceIt : 1; // 0x78
	uint32_t OnlinePlayerTitles : 1; // 0x78
	uint32_t RestrictByRegion : 1; // 0x78
	uint32_t FirstTimeExperience : 1; // 0x78
	uint32_t RLBot : 1; // 0x78
	uint32_t CarMatinee : 1; // 0x78
	uint32_t UserBugReport : 1; // 0x78
	uint32_t SteamInput : 1; // 0x78
	uint32_t ReplayFXControls : 1; // 0x78
	uint32_t ESportsShop : 1; // 0x78
	uint32_t TeamColoredBoostMeter : 1; // 0x78
	uint32_t GarageArchive : 1; // 0x78
	uint32_t DynamicRangeAudioSettings : 1; // 0x7c
	uint32_t AutoTour : 1; // 0x7c
	uint32_t QuickPlay : 1; // 0x7c
	uint32_t NewsPanelV2 : 1; // 0x7c
	uint32_t Blueprints : 1; // 0x7c
	uint32_t GodBall : 1; // 0x7c
	uint32_t RocketBucks : 1; // 0x7c
	uint32_t DiscordRichPresence : 1; // 0x7c
	uint32_t SupportACreator : 1; // 0x7c
	uint32_t CinematicIntro : 1; // 0x7c
	uint32_t TinyCrowd : 1; // 0x7c
	uint32_t CrumbTrail : 1; // 0x7c
	uint32_t EpicOnlineServices : 1; // 0x7c
	uint32_t EpicGameStoreBuild : 1; // 0x7c
	uint32_t XPGatedPlaylists : 1; // 0x7c
	uint32_t TradeInV2 : 1; // 0x7c
	uint32_t Football : 1; // 0x7c
	uint32_t RumbleSelection : 1; // 0x7c
	uint32_t UndersizedParty : 1; // 0x7c
	uint32_t StreamerSafeAudio : 1; // 0x7c
	uint32_t FreeplayCommands : 1; // 0x7c
	uint32_t Rumble_BM : 1; // 0x7c
	uint32_t EpicGameClips : 1; // 0x7c
	uint32_t Koala : 1; // 0x7c
	uint32_t PlayerReportingV2 : 1; // 0x7c
	uint32_t BlogScheduling : 1; // 0x7c
	uint32_t QuickPostMatchRequeue : 1; // 0x80
};

struct AGravityVolume {
	float GravityZ; // 0x2d8
};

struct U__TAsyncResult__PsyNetClientService_X__SetResultWhen_5DB4902A4D5452E22E257F9E53806E90 {
	DelegateProperty GetResultDelegate; // 0x60
};

struct UActorFactory {
	FNone* GameplayActorClass; // 0x60
	FString MenuName; // 0x68
	int32_t MenuPriority; // 0x78
	int32_t AlternateMenuPriority; // 0x7c
	FString NewActorClassName; // 0x80
	FNone* NewActorClass; // 0x90
	uint32_t bPlaceable : 1; // 0x98
	uint32_t bShowInEditorQuickMenu : 1; // 0x98
};

struct UGFxData_ShopCatalogue_TA {
	ObjectProperty ShopManager; // 0x98
	int32_t ShopID; // 0xa0
	FString ShopName; // 0xa8
	FString Type; // 0xb8
	FString Region; // 0xc8
	QWordProperty StartDate; // 0xd8
	QWordProperty EndDate; // 0xe0
	ObjectProperty ShopImage; // 0xe8
	FString ShopImageURL; // 0xf0
	uint32_t bLoaded : 1; // 0x100
	uint32_t bFailedToLoad : 1; // 0x100
	uint32_t bShopItemExpired : 1; // 0x100
	uint32_t bAutoReload : 1; // 0x100
	TArray<FShopItem> CachedItems; // 0x108
	float CacheDuration; // 0x118
	float LastCacheTime; // 0x11c
	float LastOwnedCacheTime; // 0x120
	ObjectProperty ShopTask; // 0x128
	ComponentProperty CatalogueSet; // 0x130
	ObjectProperty ExpirationHelper; // 0x138
	ObjectProperty AutoLoadHelper; // 0x140
	ObjectProperty ShopsConfig; // 0x148
	DelegateProperty __bLoaded__ChangeNotify; // 0x150
	DelegateProperty __bAutoReload__ChangeNotify; // 0x168
};

struct ULoadoutSequencer_TA {
	TArray<FSequenceData> SlotSequence; // 0x60
	uint32_t bDebug : 1; // 0x70
	ObjectProperty PreviewActor; // 0x78
	FLoadoutData FinalLoadout; // 0x80
	FLoadoutData CurrentLoadout; // 0xc0
	DelegateProperty __EventSequenceComplete__Delegate; // 0x100
};

struct UPlayerReportConfig_TA {
	TArray<FPlayerReportReason> Reasons; // 0x78
};

struct UMutator_Audio_TA {
	FName AudioSoundMode; // 0x68
};

struct ABreakOutActor_Platform_TA {
	int32_t Sides; // 0x268
	uint32_t bPrimaryPlayerStart : 1; // 0x26c
	int32_t TeamIndex; // 0x270
	int32_t MaxDamage; // 0x274
	ComponentProperty StaticMeshComponent; // 0x278
	ComponentProperty LightEnvironment; // 0x280
	ObjectProperty FXArchetype; // 0x288
	float NeighborRadius; // 0x290
	TArray<ObjectProperty> Neighbors; // 0x298
	float LastHitTime; // 0x2a8
	FBreakoutDamageState DamageState; // 0x2b0
	ObjectProperty FXActor; // 0x2d0
	FBreakoutDamageState PreReplayState; // 0x2d8
	DelegateProperty __EventDamageStateChanged__Delegate; // 0x2f8
	DelegateProperty __EventDamaged__Delegate; // 0x310
};

struct UFacebookWindows {
	FPointer VfTable_FTickableObject; // 0xe8
	FPointer ChildProcHandle; // 0xf0
};

struct U__GFxData_System_TA__OnShellSet_53C050AD49DE497E86150F966AD91216 {
	ObjectProperty EngineShare; // 0x60
};

struct U__OnlinePlayerStorageSync_X__SyncObjects_BC39D90744C33F34FDD16C93571F2AF7 {
	ObjectProperty ResponseTask; // 0x60
};

struct URPC_TourCreate_TA {
	FUniqueNetId PlayerID; // 0xe8
	FTourCreateSettings Settings; // 0x130
	ObjectProperty Tournament; // 0x168
};

struct ULevelStreaming {
	FName PackageName; // 0x60
	ObjectProperty LoadedLevel; // 0x68
	FVector Offset; // 0x70
	FMatrix LevelTransform; // 0x80
	FVector OldOffset; // 0xc0
	uint32_t bIsVisible : 1; // 0xcc
	uint32_t bHasLoadRequestPending : 1; // 0xcc
	uint32_t bHasUnloadRequestPending : 1; // 0xcc
	uint32_t bShouldBeVisibleInEditor : 1; // 0xcc
	uint32_t bBoundingBoxVisible : 1; // 0xcc
	uint32_t bLocked : 1; // 0xcc
	uint32_t bIsFullyStatic : 1; // 0xcc
	uint32_t bShouldBeLoaded : 1; // 0xcc
	uint32_t bShouldBeVisible : 1; // 0xcc
	uint32_t bShouldBlockOnLoad : 1; // 0xcc
	uint32_t bDrawOnLevelStatusMap : 1; // 0xcc
	uint32_t bIsRequestingUnloadAndRemoval : 1; // 0xcc
	FColor DrawColor; // 0xd0
	TArray<ObjectProperty> EditorStreamingVolumes; // 0xd8
	float MinTimeBetweenVolumeUnloadRequests; // 0xe8
	float LastVolumeUnloadRequestTime; // 0xec
	TArray<FString> Keywords; // 0xf0
	ObjectProperty EditorGridVolume; // 0x100
	int32_t GridPosition[0x3]; // 0x108
};

struct U__GFxData_Friends_TA__HideBlockedEpicFriendInvites_83C1C809421D9A7EDDEC2686E3B07276 {
	int32_t PendingIdx; // 0x60
};

struct UCameraState_DirectorCountdownRotate_TA {
	float FOV; // 0x1b8
	float Distance; // 0x1bc
	FRotator InitialRotation; // 0x1c0
	FRotator RotationSpeed; // 0x1cc
};

struct UAkAudioDevice {
	int32_t MaxNumMemoryPools; // 0x78
	int32_t DefaultMemoryPoolKB; // 0x7c
	int32_t DefaultEngineMemoryPoolKB; // 0x80
	int32_t WwiseBusSendBufferSamples; // 0x84
	uint32_t DebugRecordWwiseBusSends : 1; // 0x88
	float LowMemoryThreshold; // 0x8c
};

struct UNxForceFieldComponent {
	ObjectProperty Shape; // 0x258
	ComponentProperty DrawComponent; // 0x260
	int32_t ExcludeChannel; // 0x268
	uint32_t bForceActive : 1; // 0x26c
	uint32_t bDestroyWhenInactive : 1; // 0x26c
	FRBCollisionChannelContainer CollideWithChannels; // 0x270
	float Duration; // 0x274
	FPointer ForceField; // 0x278
	TArray<FPointer> ConvexMeshes; // 0x280
	TArray<FPointer> ExclusionShapes; // 0x290
	TArray<FPointer> ExclusionShapePoses; // 0x2a0
	int32_t SceneIndex; // 0x2b0
	float ElapsedTime; // 0x2b4
	ComponentProperty RenderComponent; // 0x2b8
	FPointer RBPhysScene; // 0x2c0
};

struct UShopErrors_TA {
	ObjectProperty ShopItemBadData; // 0x80
	ObjectProperty ShopItemDiscountBadData; // 0x88
	ObjectProperty ShopSyncedBadData; // 0x90
	ObjectProperty ShopNotEnoughCurrency; // 0x98
};

struct UDistributionVector {
	FPointer VfTable_FCurveEdInterface; // 0x70
	uint32_t bCanBeBaked : 1; // 0x78
	uint32_t bIsDirty : 1; // 0x78
};

struct UProductAsset_Logo_TA {
	ObjectProperty Texture; // 0xf8
	FLinearColor TeamColor; // 0x100
	FLinearColor CustomColor; // 0x110
	TArray<ObjectProperty> Bots2; // 0x120
};

struct URPC_ProductUpgradeLevel_TA {
	FUniqueNetId PlayerID; // 0xe8
	FProductInstanceID InstanceID; // 0x130
	int32_t DesiredLevel; // 0x140
	TArray<FOnlineProductData> ReceivedProducts; // 0x148
	TArray<ObjectProperty> Products; // 0x158
};

struct USeqAct_InstanceMaterial_TA {
	ObjectProperty MaterialInstance; // 0x160
	ObjectProperty SK; // 0x168
	ObjectProperty SM; // 0x170
	ObjectProperty InstancedMaterial; // 0x178
	int32_t MatIndex; // 0x180
};

struct ASpecialPickup_BallVelcro_TA {
	FVector BallOffset; // 0x388
	uint32_t bUseRealOffset : 1; // 0x394
	uint32_t bHit : 1; // 0x394
	uint32_t bBroken : 1; // 0x394
	float AfterHitDuration; // 0x398
	ObjectProperty Mesh; // 0x3a0
	FInterpCurveFloat MeshScaleCurve; // 0x3a8
	FInterpCurveFloat HitMeshScaleCurve; // 0x3c0
	FInterpCurveFloat BrokenScaleCurve; // 0x3d8
	float PostBreakDuration; // 0x3f0
	ObjectProperty BallHitSFX; // 0x3f8
	float MinBreakForce; // 0x400
	float MinBreakTime; // 0x404
	float CheckLastTouchRate; // 0x408
	ComponentProperty SMC; // 0x410
	ObjectProperty WeldedBall; // 0x418
	float OldBallMass; // 0x420
	float AttachTime; // 0x424
	float LastTouchCheckTime; // 0x428
	float BreakTime; // 0x42c
};

struct UChallengeDefaultManager_TA {
	TArray<ObjectProperty> DefaultChallenges; // 0x60
	TArray<ObjectProperty> Folders; // 0x70
	ObjectProperty ChallengeConfig; // 0x80
	TArray<ObjectProperty> NewChallengesNotifications; // 0x88
	DelegateProperty __EventChallengeAdded__Delegate; // 0x98
	DelegateProperty __EventChallengesSynced__Delegate; // 0xb0
	DelegateProperty __EventChallengesPushed__Delegate; // 0xc8
};

struct URocketPassBundleContainer_TA {
	FName RocketPassMenuName; // 0x70
	TArray<FRocketPassBundleInfo> Premium; // 0x78
	TArray<FRocketPassBundleInfo> Tier; // 0x88
	FString RocketPassPackageName; // 0x98
	FString TierBundleFileNameBase; // 0xa8
};

struct UMusicUrlConfig_TA {
	TArray<FMusicConfigTrack> Tracks; // 0x78
};

struct UProcBuildingRuleset {
	ObjectProperty RootRule; // 0x60
	uint32_t bBeingEdited : 1; // 0x68
	uint32_t bEnableInteriorTexture : 1; // 0x68
	uint32_t bLODOnlyRoof : 1; // 0x68
	uint32_t bPickRandomSwatch : 1; // 0x68
	ObjectProperty DefaultRoofMaterial; // 0x70
	ObjectProperty DefaultFloorMaterial; // 0x78
	ObjectProperty DefaultNonRectWallMaterial; // 0x80
	float RoofZOffset; // 0x88
	float NotRoofZOffset; // 0x8c
	float FloorZOffset; // 0x90
	float NotFloorZOffset; // 0x94
	float RoofPolyInset; // 0x98
	float FloorPolyInset; // 0x9c
	float BuildingLODSpecular; // 0xa0
	float RoofEdgeScopeRaise; // 0xa4
	ObjectProperty LODCubemap; // 0xa8
	ObjectProperty InteriorTexture; // 0xb0
	TArray<FPBVariationInfo> Variations; // 0xb8
	TArray<FPBParamSwatch> ParamSwatches; // 0xc8
	TArray<ObjectProperty> Comments; // 0xd8
};

struct U__ProfileVersions_TA__CarColors2_341DDCCE440C705F8E2E978833195395 {
	TArray<ObjectProperty> TeamArchetypes; // 0x60
};

struct UAkSoundSource {
	FVector Translation; // 0xa0
	FRotator Rotation; // 0xac
	uint32_t bDetachOnComplete : 1; // 0xb8
	uint32_t bRegistered : 1; // 0xb8
	uint32_t bUpdateOrientation : 1; // 0xb8
	FMatrix CachedParentToWorld; // 0xc0
	FVector WorldLocation; // 0x100
	FRotator WorldRotation; // 0x10c
	ComponentProperty Params; // 0x118
	TArray<FActiveSound> ActiveSounds; // 0x120
	EAkEnvironmentType EnvironmentType; // 0x130
	TArray<EAkCallbackType> CallbackTypes; // 0x138
	FPointer SoundSourceId; // 0x148
	DelegateProperty __EventFinished__Delegate; // 0x150
	DelegateProperty __EventMarker__Delegate; // 0x168
	DelegateProperty __EventDuration__Delegate; // 0x180
};

struct UClubInvite_X {
	QWordProperty ClubID; // 0x60
	FString ClubName; // 0x68
	FString ClubTag; // 0x78
	FClubMember InvitedBy; // 0x88
};

struct UGameUISceneClient {
	float LatestDeltaTime; // 0x120
	FDouble DoubleClickStartTime; // 0x128
	FIntPoint DoubleClickStartPosition; // 0x130
	FMap_Mirror InitialPressedKeys; // 0x138
	uint32_t bUpdateInputProcessingStatus : 1; // 0x188
	uint32_t bUpdateSceneViewportSizes : 1; // 0x188
	uint32_t bEnableDebugInput : 1; // 0x188
	uint32_t bRenderDebugInfo : 1; // 0x188
	uint32_t bCaptureUnprocessedInput : 1; // 0x188
	TArray<FName> NavAliases; // 0x190
	TArray<FName> AxisInputKeys; // 0x1a0
};

struct UMcpGroupsBase {
	FString McpGroupsManagerClassName; // 0x78
	TArray<FMcpGroupList> GroupLists; // 0x88
	DelegateProperty __OnCreateGroupComplete__Delegate; // 0x98
	DelegateProperty __OnDeleteGroupComplete__Delegate; // 0xb0
	DelegateProperty __OnQueryGroupsComplete__Delegate; // 0xc8
	DelegateProperty __OnQueryGroupMembersComplete__Delegate; // 0xe0
	DelegateProperty __OnAddGroupMembersComplete__Delegate; // 0xf8
	DelegateProperty __OnRemoveGroupMembersComplete__Delegate; // 0x110
	DelegateProperty __OnDeleteAllGroupsComplete__Delegate; // 0x128
	DelegateProperty __OnQueryGroupInvitesComplete__Delegate; // 0x140
	DelegateProperty __OnAcceptGroupInviteComplete__Delegate; // 0x158
};

struct UPlayerVanity_TA {
	FString MovieReference; // 0x70
	ObjectProperty ToPlayer; // 0x80
	ObjectProperty PaintableLayer; // 0x88
	ObjectProperty TintableLayer; // 0x90
	uint32_t bColorable : 1; // 0x98
	uint32_t bIsDirty : 1; // 0x98
	int32_t ColorID; // 0x9c
	FColor ColorValue; // 0xa0
	FColor DefaultColorValue; // 0xa4
	FColor PaintColor; // 0xa8
	FString InstanceID; // 0xb0
	int32_t ProductID; // 0xc0
	FProductHashID HashID; // 0xc4
	FColor RawDefaultColorValue; // 0xc8
	TArray<ObjectProperty> Attributes; // 0xd0
	FString PlayerName; // 0xe0
	FUniqueNetId PlayerID; // 0xf0
	ObjectProperty Profile; // 0x138
	ObjectProperty VanitySaveObject; // 0x140
	EVanityType VanityType; // 0x148
	DelegateProperty OnLoadCompleteCallback; // 0x150
	DelegateProperty __EventOnLoadComplete__Delegate; // 0x168
	DelegateProperty __EventEquipProduct__Delegate; // 0x180
};

struct U__StayAsPartyVote_TA__RemoveFollower_4F3E38EF41EC852DEF38E6BFAAC0B722 {
	FUniqueNetId FollowerID; // 0x60
};

struct UPsyNetService_AAS_X {
	int32_t AdtTime; // 0x90
	int32_t OnlineHours; // 0x94
};

struct UPBRuleNodeComment {
	int32_t SizeX; // 0x98
	int32_t SizeY; // 0x9c
	int32_t BorderWidth; // 0xa0
	FColor BorderColor; // 0xa4
	uint32_t bFilled : 1; // 0xa8
	FColor FillColor; // 0xac
};

struct URPC_ProductsDebugAddProduct_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t ProductID; // 0x130
	int32_t SeriesID; // 0x134
	int32_t TradeHoldTimestamp; // 0x138
	TArray<FAddProductAttribute> Attributes; // 0x140
	FOnlineProductData Product; // 0x150
	ObjectProperty OnlineProduct; // 0x190
};

struct UOnlineGameInvite_X {
	FUniqueNetId FriendJoinPlayerID; // 0x98
	FString UnableToFindFriendsGameString; // 0xe0
	FString AlreadyInSameServerString; // 0xf0
	FString FriendNotJoinable; // 0x100
	FString GameInviteBeaconAddress; // 0x110
	FString GameInviteCredentials; // 0x120
	FName ActionRequired; // 0x130
	DelegateProperty __EventGameInviteAccepted__Delegate; // 0x138
	DelegateProperty __EventGameInviteComplete__Delegate; // 0x150
	DelegateProperty __EventConfirmationRequired__Delegate; // 0x168
	DelegateProperty __EventPasswordRequired__Delegate; // 0x180
	DelegateProperty __EventPsyNetPartyInviteAccepted__Delegate; // 0x198
};

struct AWindPointSource {
	ComponentProperty Component; // 0x268
};

struct UDownloadableContentManager {
	TArray<FPointer> DLCConfigCacheChanges; // 0x60
	TArray<FString> InstalledDLC; // 0x70
	FMap_Mirror NonPackageFilePathMap; // 0x80
	TArray<FNone*> ClassesToReload; // 0xd0
	TArray<ObjectProperty> ObjectsToReload; // 0xe0
	TArray<FString> QueuedFullyLoadPackageInis; // 0xf0
	ObjectProperty GameEngine; // 0x100
	DelegateProperty __OnRefreshComplete__Delegate; // 0x108
};

struct UPrimitiveComponentFactory {
	uint32_t CollideActors : 1; // 0x60
	uint32_t BlockActors : 1; // 0x60
	uint32_t BlockZeroExtent : 1; // 0x60
	uint32_t BlockNonZeroExtent : 1; // 0x60
	uint32_t BlockRigidBody : 1; // 0x60
	uint32_t HiddenGame : 1; // 0x60
	uint32_t HiddenEditor : 1; // 0x60
	uint32_t CastShadow : 1; // 0x60
};

struct URecentPlayers_TA {
	TArray<FPersonaDataId> RecentList; // 0x70
	TArray<FPersonaDataId> RecentTradingPartners; // 0x80
	TArray<FPlayerGameID> RecentGameIDs; // 0x90
	ObjectProperty PersonaSave; // 0xa0
	int32_t MaxRecentPlayerCount; // 0xa8
	DelegateProperty __RecentList__ChangeNotify; // 0xb0
};

struct UPostProcessManager_TA {
	EPostProcessAAType PostProcessAAType; // 0xd0
	float DOF_DistanceLimit; // 0xd4
	float DOF_InnerRadiusLimit; // 0xd8
	float DOF_KernelDefault; // 0xdc
	float DOF_MaxFarDefault; // 0xe0
	float DOF_DistanceExtent; // 0xe4
};

struct UPointLightComponent_X {
	ComponentProperty BrightnessOverTime; // 0x268
	float AttachTime; // 0x270
};

struct U__SpecialEventConfig_TA__SyncImageForIndex_85E15C6542876EBA5104C4AF07027BB9 {
	int32_t I; // 0x60
};

struct UAnimNodeSynch {
	TArray<FSynchGroup> Groups; // 0x148
};

struct UForceFieldShapeBox {
	ComponentProperty Shape; // 0x60
};

struct USeqAct_LevelStreaming {
	ObjectProperty Level; // 0x180
	FName LevelName; // 0x188
	uint32_t bStatusIsOk : 1; // 0x190
};

struct UNavMeshGoalFilter_OutSideOfDotProductWedge {
	FVector Location; // 0x70
	FVector Rotation; // 0x7c
	float Epsilon; // 0x88
};

struct UParticleModuleLocation {
	FRawDistributionVector StartLocation; // 0x70
	float DistributeOverNPoints; // 0x98
	float DistributeThreshold; // 0x9c
};

struct UPBRuleNodeAlternate {
	EProcBuildingAxis RepeatAxis; // 0x98
	float ASize; // 0x9c
	float BMaxSize; // 0xa0
	uint32_t bInvertPatternOrder : 1; // 0xa4
	uint32_t bEqualSizeAB : 1; // 0xa4
};

struct UMaterialExpressionRotator {
	FExpressionInput Coordinate; // 0xc0
	FExpressionInput Time; // 0xf8
	float CenterX; // 0x130
	float CenterY; // 0x134
	float Speed; // 0x138
};

struct UPartyConfig_X {
	uint32_t bCompressMessages : 1; // 0x78
};

struct ULineBatchComponent {
	FPointer FPrimitiveDrawInterfaceVfTable; // 0x258
	FPointer FPrimitiveDrawInterfaceView; // 0x260
	TArray<FPointer> BatchedLines; // 0x268
	TArray<FPointer> BatchedPoints; // 0x278
	float DefaultLifeTime; // 0x288
};

struct U__CrossplayConfig_X__GetDisabledCrossplayGroup_E353A71548D1801F70BCEDA28962053E {
	OnlinePlatform PlayerPlatform; // 0x60
};

struct UOrbitHitHandler_TA {
	FVector RotationAxis; // 0x158
	float CarDistanceBeforeOrbit; // 0x164
	float StartAffectedRadius; // 0x168
	float EndAffectedRadius; // 0x16c
	float StartOrbitDistance; // 0x170
	float EndOrbitDistance; // 0x174
	float StartOrbitSpeed; // 0x178
	float EndOrbitSpeed; // 0x17c
	float FarAwayOrbitSpeedMultiplier; // 0x180
	float MaxDeactivationVelocity; // 0x184
	EOrbitCenterLocation OrbitCenterLocation; // 0x188
	EOrbitAxisBehavior OrbitAxisBehavior; // 0x189
	FColor AffectedAreaColor; // 0x18c
	FColor OrbitCenterColor; // 0x190
	FColor OrbitLocationColor; // 0x194
	TArray<FOrbitCarData> OrbitingCars; // 0x198
	FVector OrbitCenter; // 0x1a8
	FVector NormalizedRotationAxis; // 0x1b4
	float AffectedRadiusSquared; // 0x1c0
	float OrbitDistance; // 0x1c4
};

struct UImpactEffectsComponent_TA {
	int32_t SoundPriority; // 0xa8
	ObjectProperty ImpactEffectsMap; // 0xb0
	ObjectProperty AkImpactSound; // 0xb8
	ObjectProperty AkSlideSound; // 0xc0
	float AkSlideSoundDelay; // 0xc8
	float AkSlideMomentumMin; // 0xcc
	FName AkImpactTypeKey; // 0xd0
	FName AkImpactIntensityKey; // 0xd8
	float MinImpactMomentum; // 0xe0
	float MinImpactDelay; // 0xe4
	ObjectProperty ImpactCameraShake; // 0xe8
	ObjectProperty ImpactForceFeedback; // 0xf0
	FInterpCurveFloat ShakeScaleCurve; // 0xf8
	float LastWorldImpactTime; // 0x110
	float LastActorImpactTime; // 0x114
	float SlideTime; // 0x118
	ComponentProperty SlideParticleComponent; // 0x120
	ComponentProperty SlideAudioComponent; // 0x128
	ComponentProperty ShakeComponent; // 0x130
	FCollisionEffectData LastCollisionEffectData; // 0x138
	FCollisionEffectData SlideCollisionEffectData; // 0x190
	ObjectProperty SlidePhysMatProp; // 0x1e8
	ObjectProperty SlapbackManager; // 0x1f0
};

struct UProductAttribute_BlueprintCost_TA {
	int32_t Cost; // 0x80
};

struct UTourServerInfo_FaceIt_TA {
	FFaceItReservationMatchInfo ReservationMatchInfo; // 0x80
};

struct USeqEvent_Mover {
	float StayOpenTime; // 0x180
};

struct USeqVar_External {
	FNone* ExpectedType; // 0xe0
	FString VariableLabel; // 0xe8
};

struct UPBRuleNodeMesh {
	TArray<FBuildingMeshInfo> BuildingMeshes; // 0x98
	FBuildingMeshInfo PartialOccludedBuildingMesh; // 0xa8
	uint32_t bDoOcclusionTest : 1; // 0xf8
	uint32_t bBlockAll : 1; // 0xf8
};

struct UAddReservationMessagePublic_X {
	FJoinMatchSettings Settings; // 0xd0
	TArray<FOnlinePlayerMapPrefs> MapPrefs; // 0xf0
};

struct URPC_ReportCheater_X {
	FUniqueNetId PlayerID; // 0xe8
	FString Reason; // 0x130
};

struct UBTLock {
	ELockScope LockScope; // 0x88
	FName LockName; // 0x8c
	float Time; // 0x94
	float RandomTime; // 0x98
	ComponentProperty Locks; // 0xa0
	float LockTime; // 0xa8
};

struct UItemDropGroup_TA {
	TArray<FCurrency> Currency; // 0x60
	TArray<FProductDrop> Products; // 0x70
	int32_t XP; // 0x80
	FNone* GFxDataClass; // 0x88
	EDropGroupDisplayOrder DisplayOrder; // 0x90
	DelegateProperty __EventItemDropGroupHandled__Delegate; // 0x98
};

struct UOnlineConfigDispatcher_X {
	uint32_t bDebug : 1; // 0x60
};

struct UDrawCylinderComponent {
	FColor CylinderColor; // 0x258
	ObjectProperty CylinderMaterial; // 0x260
	float CylinderRadius; // 0x268
	float CylinderTopRadius; // 0x26c
	float CylinderHeight; // 0x270
	float CylinderHeightOffset; // 0x274
	int32_t CylinderSides; // 0x278
	uint32_t bDrawWireCylinder : 1; // 0x27c
	uint32_t bDrawLitCylinder : 1; // 0x27c
	uint32_t bDrawOnlyIfSelected : 1; // 0x27c
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x128
};

struct USeqEvent_Input {
	uint32_t bTrapInput : 1; // 0x180
	int32_t AllowedPlayerIndex; // 0x184
	TArray<FName> InputNames; // 0x188
};

struct U__MatchRecorder_X__GetPlayerData_B1CA791B45BCD1494AF31B9EB7C8305C {
	FUniqueNetId PlayerID; // 0x60
};

struct URPC_PartyJoin_X {
	FString JoinID; // 0xf8
	FPsyNetPartyInfo Info; // 0x108
	TArray<FPsyNetPartyMember> Members; // 0x178
};

struct URPC_RecordMatchStats_TA {
	FString MatchGUID; // 0xe8
	int32_t PlaylistId; // 0xf8
	TArray<FPlayerAggregateStats> Aggregates; // 0x100
};

struct UGFxInteraction {
	FPointer VfTable_FCallbackEventDevice; // 0xd0
	uint32_t bFakeMobileTouches : 1; // 0xd8
};

struct UEpicFriendsPlugin_X {
	FString ServerURL; // 0x60
	FString ProductionServerURL; // 0x70
	FString AddFriendURL; // 0x80
	FString RemoveFriendURL; // 0x90
	FString OutgoingFriendRequestsURL; // 0xa0
	FString IncomingFriendRequestsURL; // 0xb0
	FString BlockPlayerURL; // 0xc0
	FString BlockListURL; // 0xd0
	FString AccountSummaryURL; // 0xe0
	DelegateProperty __HTTPRequestCallback__Delegate; // 0xf0
	DelegateProperty __AddFriendCallback__Delegate; // 0x108
	DelegateProperty __GetOutgoingFriendsCallback__Delegate; // 0x120
};

struct UMatchType_AutoTournament_TA {
	ObjectProperty AutoTourConfig; // 0xd0
};

struct UPlaylistSettings_TA {
	int32_t XPLevelUnlocked; // 0x128
	TArray<FMapSkillSettings> MapSkillRequirements; // 0x130
	FNone* TourServerInfoClass; // 0x140
	uint32_t bAllowHonorDuelChallenges : 1; // 0x148
	TArray<FTeamColor> TeamColors; // 0x150
	FColorOverride BallSuperSonicColor; // 0x160
};

struct UScriptedTexture {
	uint32_t bNeedsUpdate : 1; // 0x190
	uint32_t bSkipNextClear : 1; // 0x190
	DelegateProperty __Render__Delegate; // 0x198
};

struct UMusicTheme_TA {
	TArray<ObjectProperty> Playlists; // 0x60
	TArray<FPlaylistTitleTrack> TitleTracks; // 0x70
	ObjectProperty NeverPlayInFirstTracklist; // 0x80
	FPlaylistTrack Credits; // 0x88
	FPlaylistTrack KonamiCode; // 0x98
	ObjectProperty DefaultIcon; // 0xa8
	TArray<FPlaylistTrack> AdditionalTracks; // 0xb0
};

struct UProductAttribute_LevelSettings_TA {
	TArray<FProductLevelData> Levels; // 0x80
};

struct UPsyNetMessengerHttp_X {
	FString URL; // 0x78
};

struct UGFxData_ProductAttribute_Anthem_TA {
	FString MusicTitle; // 0xb0
	FString ArtistTitle; // 0xc0
};

struct UActorFactoryRigidBody {
	uint32_t bStartAwake : 1; // 0xc0
	uint32_t bDamageAppliesImpulse : 1; // 0xc0
	uint32_t bLocalSpaceInitialVelocity : 1; // 0xc0
	uint32_t bEnableStayUprightSpring : 1; // 0xc0
	FVector InitialVelocity; // 0xc4
	ComponentProperty AdditionalVelocity; // 0xd0
	ComponentProperty InitialAngularVelocity; // 0xd8
	ERBCollisionChannel RBChannel; // 0xe0
	float StayUprightTorqueFactor; // 0xe4
	float StayUprightMaxTorque; // 0xe8
};

struct UArenaSoundManager_TA {
	ObjectProperty DefaultInGameMusicCue; // 0xa8
	ObjectProperty TrainingRoundEndCue; // 0xb0
	ObjectProperty ArenaMusicReplayStopCue; // 0xb8
	ObjectProperty Settings; // 0xc0
	ObjectProperty SoundPlayer; // 0xc8
	uint32_t bMatchBegan : 1; // 0xd0
	ObjectProperty SoccarGame; // 0xd8
	ObjectProperty ReflectionsManager; // 0xe0
	ObjectProperty GoalScoreStinger; // 0xe8
	ObjectProperty ActiveStinger; // 0xf0
	ObjectProperty Config; // 0xf8
	ObjectProperty StreamerSafeConfig; // 0x100
	ObjectProperty NextTimedEvent; // 0x108
	int32_t TimedEventPlayingID; // 0x110
	DelegateProperty __EventReflectionsManagerSet__Delegate; // 0x118
	DelegateProperty __EventActiveStingerUpdated__Delegate; // 0x130
	DelegateProperty __EventAnthemSoundStateUpdated__Delegate; // 0x148
};

struct USequenceOp {
	uint32_t bIsActivated : 1; // 0xd8
	uint32_t bIsCurrentDebuggerOp : 1; // 0xd8
	uint32_t bActive : 1; // 0xd8
	uint32_t bLatentExecution : 1; // 0xd8
	uint32_t bAutoActivateOutputLinks : 1; // 0xd8
	uint32_t bHaveMovingVarConnector : 1; // 0xd8
	uint32_t bHaveMovingInputConnector : 1; // 0xd8
	uint32_t bHaveMovingOutputConnector : 1; // 0xd8
	uint32_t bPendingVarConnectorRecalc : 1; // 0xd8
	uint32_t bPendingInputConnectorRecalc : 1; // 0xd8
	uint32_t bPendingOutputConnectorRecalc : 1; // 0xd8
	uint32_t bIsBreakpointSet : 1; // 0xd8
	uint32_t bIsHiddenBreakpointSet : 1; // 0xd8
	float PIEActivationTime; // 0xdc
	ObjectProperty ActivatorSeqOp; // 0xe0
	int32_t LastActivatedInputLink; // 0xe8
	int32_t LastActivatedOutputLink; // 0xec
	TArray<FSeqOpInputLink> InputLinks; // 0xf0
	TArray<FSeqOpOutputLink> OutputLinks; // 0x100
	TArray<FSeqVarLink> VariableLinks; // 0x110
	TArray<FSeqEventLink> EventLinks; // 0x120
	int32_t PlayerIndex; // 0x130
	char GamepadID; // 0x134
	int32_t ActivateCount; // 0x138
	int32_t SearchTag; // 0x13c
};

struct USeqAct_AkEnvironment {
	FAkEnvironment Environment; // 0x160
	EAkEnvironmentTarget Target; // 0x180
};

struct UGFxData_ProductAttribute_Blueprint_TA {
	ObjectProperty ProductThumbnail; // 0xb0
	ObjectProperty BlueprintThumbnail; // 0xb8
	int32_t Cost; // 0xc0
	uint32_t bRevealed : 1; // 0xc4
	FProductHashID PreviewProductHashID; // 0xc8
};

struct URPC_Challenge_FTECheckpointComplete_TA {
	FUniqueNetId PlayerID; // 0xe8
	FName GroupName; // 0x130
	FName CheckpointName; // 0x138
};

struct UProductAttribute_UserColorable_TA {
	FLinearColor DefaultColor; // 0x80
};

struct UEOSPermissions_TA {
	ObjectProperty EpicConfig; // 0x60
	ObjectProperty RetryConfig; // 0x68
	EChatPermissionLevel TextChatPermissionLevel; // 0x70
	ObjectProperty GameplaySettingsSave; // 0x78
	ObjectProperty DownloadedPermissions; // 0x80
	FString ServiceName; // 0x88
	TArray<float> RetryDelays; // 0x98
	int32_t PermissionRetryAttempts; // 0xa8
	ObjectProperty ActivePermissionsRequest; // 0xb0
	DelegateProperty __EventPlayerPermissionsSet__Delegate; // 0xb8
};

struct UDecodeObjectJson_X {
	ObjectProperty JsonSerializer; // 0x70
	FString Stream; // 0x78
};

struct U__StayAsPartySystem_TA__GFxPlayerJoinedParty_17C3AF70497504AEECDFD18E917A8D16 {
	ObjectProperty LeaderChanged; // 0x60
};

struct UFreeplayCommands_TA {
	ObjectProperty SoccarGame; // 0x60
	ObjectProperty FreeplayConfig; // 0x68
	TArray<FFreeplayCommandEvent> ActivatedCommands; // 0x70
};

struct U__TAsyncResult__PrivilegeCheck_X__NotifyOnResult_CD70A38D49C3AF8C81CF4B8B3D4361E6 {
	DelegateProperty Callback; // 0x60
};

struct UUserBugReportUploadResult_TA {
	FString ConfirmationCode; // 0x60
};

struct UUIDataStore_MenuItems {
	FName CurrentGameSettingsTag; // 0x100
	FMultiMap_Mirror OptionProviders; // 0x108
	TArray<ObjectProperty> DynamicProviders; // 0x158
};

struct UDebugHelpMenu_TA {
	float CategoryTextScale; // 0xd0
	float ItemTextScale; // 0xd4
	float KeyTextScale; // 0xd8
	TArray<FDebugCategory> HelpCategories; // 0xe0
	int32_t SelectedCategoryIdx; // 0xf0
	int32_t SelectedItemIdx; // 0xf4
	float ItemsWidth; // 0xf8
	float ItemsHeight; // 0xfc
	float Fade; // 0x100
	uint32_t bClosing : 1; // 0x104
};

struct UGFxData_ProductAttribute_Container_TA {
	uint32_t bUnlocked : 1; // 0xb0
	uint32_t bSkipRoulette : 1; // 0xb0
	uint32_t bGiftbox : 1; // 0xb0
};

struct U__OnlineGameParty_X__UpdatePartyInfo_C23118C24288BA0C011DACA7DBB77E2A {
	FActiveLobbyInfo Lobby; // 0x60
};

struct UMatchPlayerData_X {
	FUniqueNetId PlayerID; // 0x60
	FString PlayerName; // 0xa8
	QWordProperty ConnectTimestamp; // 0xb8
	QWordProperty JoinTimestamp; // 0xc0
	QWordProperty LeaveTimestamp; // 0xc8
	FUniqueNetId PartyLeaderID; // 0xd0
	uint32_t bAbandoned : 1; // 0x118
	uint32_t bMvp : 1; // 0x118
	int32_t LastTeam; // 0x11c
	float SecondsPlayed; // 0x120
	int32_t Goals; // 0x124
	int32_t Assists; // 0x128
	int32_t Saves; // 0x12c
	int32_t Shots; // 0x130
	int32_t Demolishes; // 0x134
	int32_t Score; // 0x138
	int32_t OwnGoals; // 0x13c
	int32_t ClubID; // 0x140
	FMatchSkillUpdate Skills; // 0x144
	int32_t ActorID; // 0x168
};

struct UAchievementUnlockedEvent_TA {
	EAchievementType Type; // 0x60
	int32_t LocalId; // 0x64
};

struct UCarPreviewAnim_TA {
	ObjectProperty Slot; // 0xa8
	TArray<FPreviewAnimKeyframe> KeyFrames; // 0xb0
	float Delay; // 0xc0
	uint32_t bDelayHidden : 1; // 0xc4
	uint32_t bLoop : 1; // 0xc4
	uint32_t bComponentWasAttached : 1; // 0xc4
	FName SkelControlName; // 0xc8
	ObjectProperty PreviewActor; // 0xd0
	ComponentProperty Component; // 0xd8
	FPreviewAnimKeyframe FinalKeyframe; // 0xe0
	float KeyframeTime; // 0x118
	int32_t KeyframeIndex; // 0x11c
	ObjectProperty SkelControl; // 0x120
};

struct UOnlineClubManager_X {
	ObjectProperty Connection; // 0x60
	DelegateProperty __EventClubChanged__Delegate; // 0x68
};

struct U__SaveData_TA__ValidateLoadoutsWithProduct_C7EBA5A646236A2BE58973881E1977D6 {
	FProductInstanceID OnlineID; // 0x60
};

struct U__TAsyncResult__UserBugReportUploadResult_TA__NotifyOnResultComplete_9D905371461F9FF44BE7028084BF9FB7 {
	DelegateProperty Callback; // 0x60
};

struct U__OnlineGameDedicatedServer_TA__HandleVoiceTokenCacheResponse_C79645CB49A4E0C39357F1BBCC55C3E4 {
	TArray<FUniqueNetId> RequestedPlayers; // 0x60
	FUniqueNetId PlayerID; // 0x70
};

struct UReplay_TA {
	FString ReplayName; // 0x60
	int32_t EngineVersion; // 0x70
	int32_t LicenseeVersion; // 0x74
	int32_t NetVersion; // 0x78
	int32_t ReplayVersion; // 0x7c
	int32_t ReplayLastSaveVersion; // 0x80
	int32_t GameVersion; // 0x84
	int32_t BuildID; // 0x88
	int32_t Changelist; // 0x8c
	FString BuildVersion; // 0x90
	int32_t ReserveMegabytes; // 0xa0
	float RecordFPS; // 0xa4
	float KeyframeDelay; // 0xa8
	int32_t MaxChannels; // 0xac
	int32_t MaxReplaySizeMB; // 0xb0
	TArray<FNone*> PlaybackClasses; // 0xb8
	TArray<FNone*> IgnoreClasses; // 0xc8
	FString FilePath; // 0xd8
	FString Id; // 0xe8
	FName MapName; // 0xf8
	FString Date; // 0x100
	int32_t NumFrames; // 0x110
	FName MatchType; // 0x114
	FString PlayerName; // 0x120
	uint32_t bFileCorrupted : 1; // 0x130
	uint32_t bForceKeyframe : 1; // 0x130
	uint32_t bLoadedNetPackages : 1; // 0x130
	uint32_t bDebug : 1; // 0x130
	TArray<char> Data; // 0x138
	TArray<FReplayKeyframe> KeyFrames; // 0x148
	EReplayState ReplayState; // 0x158
	int32_t CurrentFrame; // 0x15c
	int32_t NextKeyframe; // 0x160
	float CurrentTime; // 0x164
	TArray<FReplayActorChannel> Channels; // 0x168
	FMap_Mirror ChannelsMap; // 0x178
	ObjectProperty PackageMap; // 0x1c8
	TArray<FName> Levels; // 0x1d0
	TArray<int32_t> FreeChannels; // 0x1e0
	float AccumulatedDeltaTime; // 0x1f0
	float TimeToSkipTo; // 0x1f4
	int32_t FrameToSkipTo; // 0x1f8
	int32_t PlayersOnlyTicks; // 0x1fc
	FPointer WriterAr; // 0x200
	FPointer ReaderAr; // 0x208
	TArray<FReplayLogItem> Logs; // 0x210
	TArray<FTimelineKeyframe> TimelineKeyframes; // 0x220
	ObjectProperty CameraTrack; // 0x230
	DelegateProperty __EventPlaybackStopped__Delegate; // 0x238
	DelegateProperty __EventSpawned__Delegate; // 0x250
	DelegateProperty __EventPreTimeSkip__Delegate; // 0x268
	DelegateProperty __EventPostTimeSkip__Delegate; // 0x280
	DelegateProperty __EventPlayedFrame__Delegate; // 0x298
};

struct UWheelAssetGenerator_TA {
	TArray<ComponentProperty> Wheels; // 0x70
};

struct U__GFxData_PlayerAvatarPreview_TA__CreatePlayerAvatarPreview_ACAB8D824DBEB03C6E92109DBEC42516 {
	ComponentProperty AvatarPreview; // 0x60
	ObjectProperty OnlineProduct; // 0x68
	int32_t InColorID; // 0x70
};

struct U__ProductOverride_ParticleSystemColorParameter_TA__ApplyToObject_224C66C54BB85ED48CD798A4336A6109 {
	TScriptInterface<Class> ParamTarget; // 0x60
	ObjectProperty PaintSetting; // 0x70
};

struct UHeightFogComponent {
	uint32_t bEnabled : 1; // 0xa0
	float Height; // 0xa4
	float Density; // 0xa8
	float LightBrightness; // 0xac
	FColor LightColor; // 0xb0
	float ExtinctionDistance; // 0xb4
	float StartDistance; // 0xb8
};

struct URPC_GetPopulation_X {
	TArray<FGetPopulationData> Playlists; // 0xe8
};

struct UApexAsset {
	FString OriginalApexName; // 0x60
	TArray<ComponentProperty> ApexComponents; // 0x70
	TArray<ObjectProperty> NamedReferences; // 0x80
	FString SourceFilePath; // 0x90
	FString SourceFileTimestamp; // 0xa0
};

struct U__CarMeshComponentBase_TA__CreateWheelMesh_3E96EF5749CB91E8ACE401B99FE7813D {
	ObjectProperty Asset; // 0x60
	ComponentProperty WheelMesh; // 0x68
};

struct USaveData_TA {
	ObjectProperty SaveManager; // 0x60
	uint32_t bFromPreviousSave : 1; // 0x68
	uint32_t bShowLightShafts : 1; // 0x68
	uint32_t bTranslucentArenaShaders : 1; // 0x68
	uint32_t bVsync : 1; // 0x68
	uint32_t bShowWeatherFX : 1; // 0x68
	uint32_t bColorBlind : 1; // 0x68
	uint32_t bEnableOnlineData : 1; // 0x68
	uint32_t bUnloaded : 1; // 0x68
	float MasterVolume; // 0x6c
	float SoundVolume; // 0x70
	float MusicVolume; // 0x74
	float AmbientVolume; // 0x78
	float VoiceVolume; // 0x7c
	EAkOutputType OutputType; // 0x80
	EControllerSoundMode ControllerSoundMode; // 0x81
	EVoiceFilter VoiceFilter; // 0x82
	EVoiceFilter ChatFilter; // 0x83
	float ControllerVolume; // 0x84
	TArray<int32_t> UnlockedProducts; // 0x88
	TArray<int32_t> MatchCompleteCarBodies; // 0x98
	TArray<QWordProperty> NewProductIDs; // 0xa8
	TArray<QWordProperty> UnseenContainerProducts; // 0xb8
	QWordProperty LastUnlockDisplayId; // 0xc8
	TArray<int32_t> NewProducts; // 0xd0
	TArray<QWordProperty> NewOnlineProducts; // 0xe0
	TArray<FUISavedKeyValue> UISavedValues; // 0xf0
	TArray<FPlaylistSkillData> SkillData; // 0x100
	FString Resolution; // 0x110
	int32_t WindowMode; // 0x120
	TArray<FOptionsValue> VideoOptions; // 0x128
	int32_t MaxFPS; // 0x138
	float SafeZoneRatio; // 0x13c
	float UIScale; // 0x140
	ObjectProperty MusicPlayerSave; // 0x148
	ObjectProperty AchievementData; // 0x150
	ObjectProperty BlogTileCache; // 0x158
	FName SelectedFreeplayMap; // 0x160
	FString RankedReconnectBeacon; // 0x168
	QWordProperty RankedReconnectEpochTime; // 0x178
	TArray<ObjectProperty> OnlineProducts; // 0x180
	ComponentProperty OnlineProductSet; // 0x190
	ComponentProperty ProductTransactions; // 0x198
	TArray<ObjectProperty> Profiles; // 0x1a0
	TArray<float> XPGainPercentage; // 0x1b0
	int32_t CurrentLevel; // 0x1c0
	int32_t SchematicResources; // 0x1c4
	int32_t SaveDataVersion; // 0x1c8
	ComponentProperty SaveObjectProvider; // 0x1d0
	TArray<ObjectProperty> SaveObjects; // 0x1d8
	int32_t SaveTick; // 0x1e8
	ObjectProperty SyncOnlineStorageTask; // 0x1f0
	ObjectProperty StorageSyncManager; // 0x1f8
	ObjectProperty EOSStorageUploader; // 0x200
	ObjectProperty ExpirationHelper; // 0x208
	ObjectProperty CachedUnlockedProducts; // 0x210
	ObjectProperty OnlineDLCProductCache; // 0x218
	TArray<ObjectProperty> NewProductNotificationQueue; // 0x220
	DelegateProperty __EventOnlineXPInitialized__Delegate; // 0x230
	DelegateProperty __EventNewOnlineProduct__Delegate; // 0x248
	DelegateProperty __EventRemovedOnlineProduct__Delegate; // 0x260
	DelegateProperty __EventOnlineProductsSynced__Delegate; // 0x278
	DelegateProperty __EventOnlineSavedDataSynced__Delegate; // 0x290
	DelegateProperty __EventSchematicResourcesChanged__Delegate; // 0x2a8
	DelegateProperty __EventRedeemedOnlineProducts__Delegate; // 0x2c0
	DelegateProperty __EventReceivedUnseenContainerProduct__Delegate; // 0x2d8
	DelegateProperty __OnlineProducts__ChangeNotify; // 0x2f0
};

struct UPartyBeacon {
	FPointer VfTable_FTickableObject; // 0x60
	int32_t PartyBeaconPort; // 0x68
	FPointer Socket; // 0x70
	uint32_t bIsInTick : 1; // 0x78
	uint32_t bWantsDeferredDestroy : 1; // 0x78
	uint32_t bShouldTick : 1; // 0x78
	float HeartbeatTimeout; // 0x7c
	float ElapsedHeartbeatTime; // 0x80
	FName BeaconName; // 0x84
	DelegateProperty __OnDestroyComplete__Delegate; // 0x90
};

struct UClubsConfig_TA {
	int32_t TagLengthMin; // 0x78
	int32_t TagLengthMax; // 0x7c
	int32_t NameLengthMin; // 0x80
	int32_t NameLengthMax; // 0x84
};

struct URPC_TourFindPrivate_TA {
	FUniqueNetId PlayerID; // 0xe8
	FTourPrivateCredentials Credentials; // 0x130
	ObjectProperty Tournament; // 0x150
};

struct U__GameEvent_Soccar_TA__InitClubMatch_375BED524B6F99FCCC18B5A01297F3AF {
	ComponentProperty Cache; // 0x60
};

struct UEventsPageConfig_TA {
	uint32_t bEnabled : 1; // 0x78
	FString URL; // 0x80
	FString ButtonTextureURL_Default; // 0x90
	FString ButtonTextureURL_Hover; // 0xa0
	FString ButtonTextureURL_Click; // 0xb0
	ObjectProperty ButtonTexture_Default; // 0xc0
	ObjectProperty ButtonTexture_Hover; // 0xc8
	ObjectProperty ButtonTexture_Click; // 0xd0
};

struct UMaterialExpressionStaticComponentMaskParameter {
	FExpressionInput Input; // 0xe0
	uint32_t DefaultR : 1; // 0x118
	uint32_t DefaultG : 1; // 0x118
	uint32_t DefaultB : 1; // 0x118
	uint32_t DefaultA : 1; // 0x118
	FPointer InstanceOverride; // 0x120
};

struct UOnlinePlayerAuthentication_TA {
	ObjectProperty FreeToPlayConfig; // 0x1d8
	ObjectProperty TwoFactorAuthentication; // 0x1e0
};

struct UDistributionVectorUniformCurve {
	FInterpCurveTwoVectors ConstantCurve; // 0x80
	uint32_t bLockAxes1 : 1; // 0x98
	uint32_t bLockAxes2 : 1; // 0x98
	uint32_t bUseExtremes : 1; // 0x98
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x9c
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x9e
};

struct U__OnlineDLCProductCache_TA__GetOldGeneratedOnlineProduct_99466AD247864E8449BF1982317B0BC9 {
	FProductInstanceID InstanceID; // 0x60
};

struct UStopwatch {
	float StartTime; // 0x70
};

struct UGFxData_AutoTour_CompletedResults_TA {
	ObjectProperty PsyNet; // 0x98
	ObjectProperty Tournaments; // 0xa0
	ObjectProperty Config; // 0xa8
	ObjectProperty AutoTour; // 0xb0
	QWordProperty CycleID; // 0xb8
	int32_t WeekIndex; // 0xc0
	uint32_t bEliminatedFirstRound : 1; // 0xc4
	uint32_t bWeeksResultsChanged : 1; // 0xc4
	uint32_t bReceivedResults : 1; // 0xc4
	uint32_t bFailedToRetrieveResults : 1; // 0xc4
	FTournamentResult NewTournamentResult; // 0xc8
	TArray<FTournamentResult> OldWeeklyResults; // 0xd8
	TArray<FTournamentResult> NewWeeklyResults; // 0xe8
	TArray<FShopCurrencyInfo> CurrencyRewards; // 0xf8
	TArray<FShopCurrencyInfo> OldWeeklyCurrencies; // 0x108
	TArray<FShopCurrencyInfo> WeeklyCurrencies; // 0x118
	TArray<FShopCurrencyInfo> FinalCurrencies; // 0x128
	QWordProperty TournamentID; // 0x138
	QWordProperty ScheduleID; // 0x140
	QWordProperty RejoinTournamentTime; // 0x148
};

struct USkeletalMeshComponent_TA {
	float FOVOverride; // 0x7b0
	uint32_t bIgnoreScriptAttach : 1; // 0x7b4
};

struct UStatusTrigger_Numerical_TA {
	TriggerConditionNumericalType TCNType; // 0x80
	int32_t ConditionalValue; // 0x84
};

struct UTickComponent_X {
	FPointer VfTable_FTickableObject; // 0x80
	uint32_t bTickWhenGamePaused : 1; // 0x88
	uint32_t bTick : 1; // 0x88
	DelegateProperty __TickDelegate__Delegate; // 0x90
};

struct UGFxData_AutoTour_TA {
	ObjectProperty Config; // 0x98
	FString ScheduleRegionLabel; // 0xa0
	int32_t NumWeeksInCycle; // 0xb0
	int32_t CycleScore; // 0xb4
	int32_t CurrencyID; // 0xb8
	uint32_t bDisplayCompletedTourResults : 1; // 0xbc
	TArray<ObjectProperty> TourCards; // 0xc0
	TArray<ObjectProperty> Weeks; // 0xd0
	ObjectProperty EndOfTournamentResults; // 0xe0
	FString TournamentBanMessage; // 0xe8
	FString PartyMembersTournamentBanned; // 0xf8
	ObjectProperty PsyNet; // 0x108
	ObjectProperty Tournaments; // 0x110
	ObjectProperty AutoTourConfig; // 0x118
	ObjectProperty AutoTour; // 0x120
};

struct ASpecialAttachment_TA {
	FVector Offset; // 0x7a8
	ComponentProperty StaticMesh; // 0x7b8
	float BallHitMultiplier; // 0x7c0
	float CarHitMultiplier; // 0x7c4
	float CarHitVerticalMultiplier; // 0x7c8
	float CarHitTorque; // 0x7cc
	uint32_t bUseCarsBump : 1; // 0x7d0
	uint32_t bDemolishOnHit : 1; // 0x7d0
	uint32_t bDemolishTeam : 1; // 0x7d0
	ObjectProperty AttachedCar; // 0x7d8
};

struct AMaterialInstanceActor {
	ObjectProperty MatInst; // 0x268
};

struct UStatTitle_TA {
	FString PrimaryTitle; // 0x60
	FString SecondaryTitle; // 0x70
	int32_t Points; // 0x80
	int32_t MinStatValueRequired; // 0x84
	int32_t MaxStatValueAllowed; // 0x88
	ObjectProperty Stat; // 0x90
	uint32_t bPerStat : 1; // 0x98
	uint32_t bInverseStat : 1; // 0x98
	uint32_t bClampStatToOne : 1; // 0x98
	EStatTrackingUnitType StatUnitType; // 0x9c
};

struct URPC_TourGetMatchServer_TA {
	FUniqueNetId PlayerID; // 0xe8
	QWordProperty TournamentID; // 0x130
	int32_t MatchID; // 0x138
	FCheckReservationResponse Reservation; // 0x140
};

struct UPlayerSpawnConfig_TA {
	int32_t RespawnDelaySeconds; // 0x60
};

struct USeqAct_ToggleCinematicMode {
	uint32_t bDisableMovement : 1; // 0x160
	uint32_t bDisableTurning : 1; // 0x160
	uint32_t bHidePlayer : 1; // 0x160
	uint32_t bDisableInput : 1; // 0x160
	uint32_t bHideHUD : 1; // 0x160
	uint32_t bDeadBodies : 1; // 0x160
	uint32_t bDroppedPickups : 1; // 0x160
};

struct URPC_TourGetRewards_TA {
	FUniqueNetId PlayerID; // 0xe8
	QWordProperty TournamentID; // 0x130
	TArray<FTourReward> Rewards; // 0x138
};

struct UAnimNodeAimOffset {
	FVector2D Aim; // 0x148
	FVector2D AngleOffset; // 0x150
	uint32_t bForceAimDir : 1; // 0x158
	uint32_t bBakeFromAnimations : 1; // 0x158
	uint32_t bPassThroughWhenNotRendered : 1; // 0x158
	uint32_t bSynchronizeNodesInEditor : 1; // 0x158
	int32_t PassThroughAtOrAboveLOD; // 0x15c
	EAnimAimDir ForcedAimDir; // 0x160
	TArray<char> RequiredBones; // 0x168
	TArray<char> AimCpntIndexLUT; // 0x178
	ObjectProperty TemplateNode; // 0x188
	TArray<FAimOffsetProfile> Profiles; // 0x190
	int32_t CurrentProfileIndex; // 0x1a0
};

struct UUIDataStore_OnlinePlaylists {
	FString ProviderClassName; // 0xa0
	FNone* ProviderClass; // 0xb0
	TArray<ObjectProperty> RankedDataProviders; // 0xb8
	TArray<ObjectProperty> UnrankedDataProviders; // 0xc8
	TArray<ObjectProperty> RecModeDataProviders; // 0xd8
	TArray<ObjectProperty> PrivateDataProviders; // 0xe8
	ObjectProperty PlaylistMan; // 0xf8
};

struct U__MenuSequencer_TA__GetSequence_5664C01B4BF2A1BAEFA54BBB8B4B2E81 {
	FName SequenceName; // 0x60
};

struct U__GFxData_SpecialEvents_TA__PurchaseRewardFromStore_F8AFFC384DCFCD577EF122AA27B459E2 {
	ObjectProperty SaveData; // 0x60
	ObjectProperty WalletReference; // 0x68
};

struct UMaterialExpressionMin {
	FExpressionInput A; // 0xc0
	FExpressionInput B; // 0xf8
};

struct ADecalManager {
	ComponentProperty DecalTemplate; // 0x268
	TArray<ComponentProperty> PoolDecals; // 0x270
	int32_t MaxActiveDecals; // 0x280
	float DecalLifeSpan; // 0x284
	float DecalDepthBias; // 0x288
	FVector2D DecalBlendRange; // 0x28c
	TArray<FActiveDecalInfo> ActiveDecals; // 0x298
};

struct URPC_UnblockPlayer_X {
	FUniqueNetId PlayerID; // 0xe8
};

struct USeqCond_SwitchObject {
	TArray<FSwitchObjectCase> SupportedValues; // 0x140
};

struct URPC_FilterContent_X {
	TArray<FString> Content; // 0xe8
	TArray<FString> FilteredContent; // 0xf8
	TArray<DelegateProperty> Callbacks; // 0x108
	TArray<FUniqueNetId> PlayerIDs; // 0x118
};

struct URuntimeParameterBase_X {
	FName ParameterName; // 0x60
};

struct UStaticMesh {
	TArray<FStaticMeshLODInfo> LODInfo; // 0x70
	float LODDistanceRatio; // 0x80
	float LODMaxRange; // 0x84
	int32_t LightMapResolution; // 0x98
	int32_t LightMapCoordinateIndex; // 0x9c
	ObjectProperty BodySetup; // 0xf8
	uint32_t UseSimpleLineCollision : 1; // 0x140
	uint32_t UseSimpleBoxCollision : 1; // 0x144
	uint32_t UseSimpleRigidBodyCollision : 1; // 0x148
	uint32_t UseFullPrecisionUVs : 1; // 0x14c
	uint32_t bUsedForInstancing : 1; // 0x150
	int32_t ConsolePreallocateInstanceCount; // 0x154
	uint32_t bUseMaximumStreamingTexelRatio : 1; // 0x158
	uint32_t bPartitionForEdgeGeometry : 1; // 0x15c
	uint32_t bCanBecomeDynamic : 1; // 0x160
	uint32_t bStripComplexCollisionForConsole : 1; // 0x168
	uint32_t bPerLODStaticLightingForInstancing : 1; // 0x16c
	float StreamingDistanceMultiplier; // 0x170
	ObjectProperty FoliageDefaultSettings; // 0x1a0
	FString SourceFilePath; // 0x1a8
	FString SourceFileTimestamp; // 0x1b8
};

struct UEncodeObjectUObject_X {
	ObjectProperty ObjectSerializer; // 0x78
};

struct UBallTrajectoryComponent_Line_TA {
	uint32_t bTrajectoryPointsNeedUpdated : 1; // 0x110
	FColor LineColor; // 0x114
};

struct U__GameInfo_GFxMenu_TA__Destroyed_BC1AF6B442ECE65877FDB2B0D07B0ED3 {
	ObjectProperty GFxEngine; // 0x60
};

struct UConnectionInfoMessage_X {
	FServerConnectionInfo ConnectionInfo; // 0x68
};

struct AGameEvent_TA {
	ComponentProperty RegistryGroup; // 0x268
	ObjectProperty MatchType; // 0x270
	FNone* MatchTypeClass; // 0x278
	FName EventType; // 0x280
	FName AudioSoundMode; // 0x288
	FName MatchTypeName; // 0x290
	ObjectProperty CarArchetype; // 0x298
	FNone* PREIClass; // 0x2a0
	int32_t CountdownTime; // 0x2a8
	int32_t FinishTime; // 0x2ac
	uint32_t bMultiplayer : 1; // 0x2b0
	uint32_t bCountdownMessagesDisabled : 1; // 0x2b0
	uint32_t bFillWithAI : 1; // 0x2b0
	uint32_t bAllowQueueSaveReplay : 1; // 0x2b0
	uint32_t bAllowReadyUp : 1; // 0x2b0
	uint32_t bRestartingMatch : 1; // 0x2b0
	uint32_t bRandomizedBotLoadouts : 1; // 0x2b0
	uint32_t bHasLeaveMatchPenalty : 1; // 0x2b0
	uint32_t bCanVoteToForfeit : 1; // 0x2b0
	uint32_t bDisableAimAssist : 1; // 0x2b0
	uint32_t bAwardAchievements : 1; // 0x2b0
	uint32_t bIsBotMatch : 1; // 0x2b0
	int32_t MinPlayers; // 0x2b4
	int32_t MaxPlayers; // 0x2b8
	TArray<ObjectProperty> SpawnPoints; // 0x2c0
	ObjectProperty AIManagerArchetype; // 0x2d0
	ObjectProperty AIManager; // 0x2d8
	ObjectProperty Pylon; // 0x2e0
	ObjectProperty BotArchetype; // 0x2e8
	float BotSkill; // 0x2f0
	TArray<ObjectProperty> DefaultMutators; // 0x2f8
	TArray<ObjectProperty> Mutators; // 0x308
	float MatchTimeDilation; // 0x318
	ObjectProperty HUDArchetype; // 0x320
	ObjectProperty Activator; // 0x328
	ObjectProperty ActivatorCar; // 0x330
	TArray<ObjectProperty> Players; // 0x338
	TArray<ObjectProperty> PRIs; // 0x348
	TArray<ObjectProperty> Cars; // 0x358
	TArray<ObjectProperty> LocalPlayers; // 0x368
	int32_t StartPointIndex; // 0x378
	char ReplicatedStateIndex; // 0x37c
	TArray<FName> DeprecatedIndexToState; // 0x380
	FName ReplicatedStateName; // 0x390
	ObjectProperty GameFullMessage; // 0x398
	ObjectProperty OtherActiveMessage; // 0x3a0
	ObjectProperty NotEnoughPlayersMessage; // 0x3a8
	ObjectProperty TooManyPlayersMessage; // 0x3b0
	ObjectProperty NotPartyLeaderMessage; // 0x3b8
	TArray<ObjectProperty> CountdownMessages; // 0x3c0
	ObjectProperty GoMessage; // 0x3d0
	TArray<ObjectProperty> ReplacingBotCountdownMessages; // 0x3d8
	ObjectProperty ReplacingBotGoMessage; // 0x3e8
	TArray<FPlayerChatMessage> ChatHistory; // 0x3f0
	int32_t GameStateTimeRemaining; // 0x400
	int32_t ReplicatedGameStateTimeRemaining; // 0x404
	ObjectProperty BotConfig; // 0x408
	TArray<FUniqueNetId> ForfeitInitiatorIDs; // 0x410
	TArray<FUniqueNetId> BannedPlayers; // 0x420
	ObjectProperty GameOwner; // 0x430
	FCustomMatchSettings MatchSettings; // 0x438
	FString RichPresenceString; // 0x4c8
	ObjectProperty MatchAdmin; // 0x4d8
	ObjectProperty ListenServer; // 0x4e0
	int32_t ReplicatedRoundCountDownNumber; // 0x4e8
	ObjectProperty MatchRecorder; // 0x4f0
	TArray<ObjectProperty> RandomizedBots; // 0x4f8
	TArray<ObjectProperty> GameStates; // 0x508
	ObjectProperty GameState; // 0x518
	ObjectProperty PauseInstance; // 0x520
	DelegateProperty __EventMatchStarted__Delegate; // 0x528
	DelegateProperty __EventGameStateChanged__Delegate; // 0x540
	DelegateProperty __EventGameStateTimeUpdated__Delegate; // 0x558
	DelegateProperty __EventFinished__Delegate; // 0x570
	DelegateProperty __EventDestroyed__Delegate; // 0x588
	DelegateProperty __EventPlayerRestarted__Delegate; // 0x5a0
	DelegateProperty __EventPlayerAdded__Delegate; // 0x5b8
	DelegateProperty __EventPlayerRemoved__Delegate; // 0x5d0
	DelegateProperty __EventCarAdded__Delegate; // 0x5e8
	DelegateProperty __EventCarRemoved__Delegate; // 0x600
	DelegateProperty __EventReplicatedDemolish__Delegate; // 0x618
	DelegateProperty __EventPenaltyChanged__Delegate; // 0x630
	DelegateProperty __EventCanVoteForfeitChanged__Delegate; // 0x648
	DelegateProperty __EventCountDownTimeUpdated__Delegate; // 0x660
	DelegateProperty __EventGameOwnerUpdated__Delegate; // 0x678
	DelegateProperty __EventMatchTypeSet__Delegate; // 0x690
	DelegateProperty __EventLocalPlayersChanged__Delegate; // 0x6a8
	DelegateProperty __EventMatchSettingsChanged__Delegate; // 0x6c0
	DelegateProperty __EventPlayerResetTraining__Delegate; // 0x6d8
	DelegateProperty __EventGameEventCommand__Delegate; // 0x6f0
	DelegateProperty __Pylon__ChangeNotify; // 0x708
};

struct U__GFxData_MultiItemDrops_TA__GetDropsByType_45F174FE4D8EAD57C443279BEC79F984 {
	FName DropType; // 0x60
};

struct USeqAct_SetVelocity {
	FVector VelocityDir; // 0x160
	float VelocityMag; // 0x16c
	uint32_t bVelocityRelativeToActorRotation : 1; // 0x170
};

struct UGFxData_TourSubscriptions_TA {
	ObjectProperty Tournaments; // 0x98
	ObjectProperty Subscriptions; // 0xa0
	TArray<FSubscriptionInfo> Created; // 0xa8
	TArray<FSubscriptionInfo> AdminOf; // 0xb8
	TArray<FSubscriptionInfo> RegisteredTo; // 0xc8
};

struct U__GameEventProductAssetCache_TA__HandlePlayerAdded_816D868C4C2E5551C83B80BAE1EA72D7 {
	ObjectProperty PRI; // 0x60
};

struct UNavigationHandle_TA {
	FVector OldDriveLocation; // 0x1a8
};

struct UParticleModuleMeshRotationRateOverLife {
	FRawDistributionVector RotRate; // 0x70
	uint32_t bScaleRotRate : 1; // 0x98
};

struct ABlockingVolume {
	uint32_t bBlockCamera : 1; // 0x2a8
};

struct AFXActor_TA {
	ObjectProperty HideWorldUIState; // 0x328
	ObjectProperty PreviewState; // 0x330
	ObjectProperty PaintedState; // 0x338
	ObjectProperty BoostEndEvent; // 0x340
	TArray<ObjectProperty> TeamStates; // 0x348
	ComponentProperty LocalPlayerAudioParamsComponent; // 0x358
};

struct USeqAct_SetBallMaterial_TA {
	ObjectProperty Ball; // 0x160
	ObjectProperty Material; // 0x168
	int32_t MaterialID; // 0x170
};

struct URPC_UploadIntroCars_TA {
	TArray<FRPCIntroCar> LoadoutTemplates; // 0xe8
};

struct UInterpTrackFloatProp {
	FName PropertyName; // 0xe8
};

struct UGameSettingCategory_X {
	TArray<FName> SelectedNames; // 0x60
	uint32_t bHidden : 1; // 0x70
	uint32_t bUseableWhileHidden : 1; // 0x70
	TArray<ObjectProperty> GameSettings; // 0x78
};

struct UMusicThemeConfig_TA {
	ObjectProperty Theme; // 0x78
};

struct U__OnlinePlayerInterfaceEOS__RequestNativePlatformAuthTicket_91AF5DE0482236CAF88DF88FB62EC2D0 {
	int32_t LocalUserNum; // 0x60
	DelegateProperty Callback; // 0x68
};

struct U__TAsyncResult__array_LanServerRecord_X__SetResultWhen_318D3B404C2D7E35F1FF4997F494F9CF {
	DelegateProperty GetResultDelegate; // 0x60
};

struct UProductAttribute_UserColor_TA {
	FColor ColorValue; // 0x80
};

struct UStoredChatData_TA {
	EChatChannel ChatChannel; // 0x60
	FUniqueNetId SenderId; // 0x68
	QWordProperty LastChatUpdate; // 0xb0
	TArray<FGFxChatMessage> Messages; // 0xb8
	uint32_t bIsActive : 1; // 0xc8
};

struct U__ProductAttribute_Painted_TA__ApplyPaintOverridesToObject_3DA2B58345CE277C73A9828030D81D9F {
	ObjectProperty Paint; // 0x60
	ObjectProperty Target; // 0x68
};

struct UDSR_DSToDSMessage_X {
	FString MessageType; // 0x90
	FString MessagePayload; // 0xa0
};

struct ULoadingProduct_TA {
	int32_t ProductID; // 0x60
	FProductHashID HashID; // 0x64
	TArray<int32_t> ReferencedViews; // 0x68
	ObjectProperty OnlineProduct; // 0x78
	EProductThumbnailSize ThumbnailSize; // 0x80
	ObjectProperty ThumbnailAsset; // 0x88
	ObjectProperty Asset; // 0x90
	ObjectProperty Thumbnail; // 0x98
	uint32_t bUpdateProductData : 1; // 0xa0
	uint32_t bIgnoreEquipped : 1; // 0xa0
	TArray<ObjectProperty> AdditionalProductReferences; // 0xa8
};

struct UGFxData_TourPlatforms_TA {
	TArray<FGFxTourPlatformGroup> Groups; // 0x98
	ObjectProperty OnlineSub; // 0xa8
	DelegateProperty __EventSelectionChange__Delegate; // 0xb0
};

struct UGFxData_ChallengePage_TA {
	FNone* ChallengeFilter; // 0xf0
};

struct URPC_CustomGameServerGet_X {
	FString ServerName; // 0xe8
	FString Password; // 0xf8
	TArray<FFindPrivateServerResult> Servers; // 0x108
	TArray<FServerResult> Results; // 0x118
};

struct UInterpTrackInstProperty {
	ObjectProperty PropertyUpdateCallback; // 0x60
	ObjectProperty PropertyOuterObjectInst; // 0x68
};

struct USeqAct_SetStadiumTeamColors_TA {
	TArray<FLinearColor> BlueColors; // 0x160
	TArray<FLinearColor> OrangeColors; // 0x170
};

struct UAnimNodeBlendBase {
	TArray<FAnimBlendChild> Children; // 0x130
	uint32_t bFixNumChildren : 1; // 0x140
	AlphaBlendType BlendType; // 0x144
};

struct U__PlaylistSkillDataSave_TA__Reconcile_6A19F92749C6C2C63B8317B131A24667 {
	ObjectProperty Other; // 0x60
};

struct UDistributionVectorConstant {
	FVector Constant; // 0x80
	uint32_t bLockAxes : 1; // 0x8c
	EDistributionVectorLockFlags LockedAxes; // 0x90
};

struct UInterpTrackFade {
	uint32_t bPersistFade : 1; // 0xe8
};

struct U__TourSubscriptions_TA__GetTournament_13A37238486C1A3217E92F8FD65EA4AF {
	QWordProperty TourID; // 0x60
};

struct UEngineAudioBaseComponent_TA {
	ComponentProperty EngineAudio; // 0xa8
	ComponentProperty ExhaustAudio; // 0xb0
	ComponentProperty BlowoffComponent; // 0xb8
	ComponentProperty WheelSpeed; // 0xc0
	ComponentProperty ThrottleComponent; // 0xc8
	ObjectProperty GearChangeSound; // 0xd0
	ComponentProperty MaxActorsGroup; // 0xd8
	ObjectProperty Car; // 0xe0
	DelegateProperty __GetNormalizedRpmDelegate__Delegate; // 0xe8
};

struct UNavMeshGoal_Filter {
	uint32_t bShowDebug : 1; // 0x60
	int32_t NumNodesThrownOut; // 0x64
	int32_t NumNodesProcessed; // 0x68
};

struct USkelControlWheel {
	float WheelDisplacement; // 0x130
	float WheelMaxRenderDisplacement; // 0x134
	float WheelRoll; // 0x138
	EAxis WheelRollAxis; // 0x13c
	EAxis WheelSteeringAxis; // 0x13d
	float WheelSteering; // 0x140
	uint32_t bInvertWheelRoll : 1; // 0x144
	uint32_t bInvertWheelSteering : 1; // 0x144
};

struct USeqAct_HeadTrackingControl {
	TArray<FName> TrackControllerName; // 0x160
	float LookAtActorRadius; // 0x170
	uint32_t bDisableBeyondLimit : 1; // 0x174
	uint32_t bLookAtPawns : 1; // 0x174
	float MaxLookAtTime; // 0x178
	float MinLookAtTime; // 0x17c
	float MaxInterestTime; // 0x180
	TArray<FNone*> ActorClassesToLookAt; // 0x188
	TArray<FName> TargetBoneNames; // 0x198
	TArray<ObjectProperty> LookAtTargets; // 0x1a8
	TMap<None, None> ActorToComponentMap; // 0x1b8
};

struct UNavMeshGoalFilter_NotNearOtherAI {
	float DistanceToCheck; // 0x70
};

struct UExplosionComponent_X {
	float RBVelocityChange; // 0xa8
	float StartRadius; // 0xac
	float EndRadius; // 0xb0
	float Speed; // 0xb4
	float Falloff; // 0xb8
	uint32_t bPassThroughWorldGeometry : 1; // 0xbc
	uint32_t bIgnoreInstigator : 1; // 0xbc
	uint32_t bDebug : 1; // 0xbc
	FVector MomentumOffset; // 0xc0
	float LifeTime; // 0xcc
	TArray<ObjectProperty> DamagedActors; // 0xd0
};

struct APlayerController_X {
	ObjectProperty CameraArchetype; // 0x7b8
	ObjectProperty HUDArchetype; // 0x7c0
	ObjectProperty OldPawnReference; // 0x7c8
	ObjectProperty LockedDebugActor; // 0x7d0
	uint32_t bPausedForExternalUI : 1; // 0x7d8
	ObjectProperty NetConnection; // 0x7e0
	DelegateProperty __EventReceivedPRI__Delegate; // 0x7e8
	DelegateProperty __EventPawnChange__Delegate; // 0x800
	DelegateProperty __EventReceivedPlayer__Delegate; // 0x818
	DelegateProperty __EventDestroyed__Delegate; // 0x830
	DelegateProperty __EventPlayerCameraChange__Delegate; // 0x848
};

struct URegionConfig_X {
	TArray<ObjectProperty> SuperRegions; // 0x78
	TArray<ObjectProperty> Regions; // 0x88
};

struct AAIController_TA {
	ObjectProperty Car; // 0x4a0
	ObjectProperty Vehicle; // 0x4a8
	ComponentProperty BT; // 0x4b0
	ObjectProperty SelfProxyType; // 0x4b8
	ObjectProperty NoneProxyType; // 0x4c0
	ObjectProperty DebugProxyType; // 0x4c8
	ObjectProperty TeamCarsProxyType; // 0x4d0
	ObjectProperty EnemyCarsProxyType; // 0x4d8
	ObjectProperty PlayerControlledCarsProxyType; // 0x4e0
	ObjectProperty OtherCarsProxyType; // 0x4e8
	ObjectProperty BoostPillsProxyType; // 0x4f0
	ObjectProperty SelectedProxyType; // 0x4f8
	ObjectProperty SelfTarget; // 0x500
	ObjectProperty NoneTarget; // 0x508
	ObjectProperty IteratorTarget; // 0x510
	ObjectProperty TeamCarsTarget; // 0x518
	ObjectProperty SelectedTarget; // 0x520
	ObjectProperty ContextTarget; // 0x528
	ObjectProperty DebugBTNode; // 0x530
	ComponentProperty Locks; // 0x538
	FSkillRange SkillSteerError; // 0x540
	FSkillRange SkillSteerSpeed; // 0x54c
	FSkillRange SkillThrottleSpeed; // 0x558
	ObjectProperty GameEvent; // 0x568
	ObjectProperty AIManager; // 0x570
	FVehicleInputs Input; // 0x578
	FVector ForwardDir; // 0x598
	FRotator ForwardRotation; // 0x5a4
	FVector GroundNormal; // 0x5b0
	TArray<FCachedProxyData> CachedProxyDatas; // 0x5c0
	TArray<FCachedTargetData> CachedTargetDatas; // 0x5d0
	FMap_Mirror TargetFilterMap; // 0x5e0
	TArray<ObjectProperty> CachedTargetFilters; // 0x630
	FVector DebugDriveDestination; // 0x640
	FCachedObstaclesData CachedObstacles; // 0x650
	TArray<ObjectProperty> TeamCars; // 0x678
	TArray<ObjectProperty> EnemyCars; // 0x688
	TArray<ObjectProperty> PlayerControlledCars; // 0x698
	TArray<ObjectProperty> OtherCars; // 0x6a8
	uint32_t bForceUpdateConditions : 1; // 0x6b8
	uint32_t bCanUseBoost : 1; // 0x6b8
	uint32_t bBeingReplaced : 1; // 0x6b8
	ObjectProperty GameShare; // 0x6c0
	ObjectProperty SelectedActor; // 0x6c8
	float FieldScalar; // 0x6d0
	char ForcedTeam; // 0x6d4
	DelegateProperty __EventNamedEvent__Delegate; // 0x6d8
	DelegateProperty __EventSkillChanged__Delegate; // 0x6f0
};

struct AGRI_X {
	int32_t ReplicatedGamePlaylist; // 0x2d8
	int32_t ReplicatedGameMutatorIndex; // 0x2dc
	FReplicatedReservationData Reservations[0x8]; // 0x2e0
	QWordProperty GameServerID; // 0x5e0
	uint32_t bGameStarted : 1; // 0x5e8
	uint32_t bGameEnded : 1; // 0x5e8
	FString MatchGUID; // 0x5f0
	DelegateProperty __EventSpawned__Delegate; // 0x600
	DelegateProperty __EventGameDataSelected__Delegate; // 0x618
	DelegateProperty __EventReservationsUpdated__Delegate; // 0x630
	DelegateProperty __EventServerNameChanged__Delegate; // 0x648
	DelegateProperty __EventGameStarted__Delegate; // 0x660
	DelegateProperty __EventMatchGUIDChanged__Delegate; // 0x678
};

struct U__OnlineGameSkill_X__HandleSyncedPlayerSkill_42CACBB343F5565DC937089ECF0EA238 {
	TArray<FPlayerSkillRating> PlayerSkillRatings; // 0x60
	FUniqueNetId PlayerID; // 0x70
};

struct ASceneCaptureActor {
	ComponentProperty SceneCapture; // 0x268
};

struct UPlayerAvatar_TA {
	ObjectProperty Asset; // 0x198
};

struct UNavMeshPath_WithinTraversalDist {
	float MaxTraversalDist; // 0x78
	uint32_t bSoft : 1; // 0x7c
	float SoftStartPenalty; // 0x80
};

struct U__PlayerController_TA__InitNetworkSave_FE145733450BE62291E998BA1CF0E2F6 {
	ObjectProperty NetworkSave; // 0x60
};

struct UScriptedTextureComponent_TA {
	FVector Resolution; // 0xa8
	float Height; // 0xb4
	uint32_t bFaceCamera : 1; // 0xb8
	ComponentProperty Mesh; // 0xc0
	ObjectProperty TextureTarget; // 0xc8
	ObjectProperty Viewer; // 0xd0
};

struct U__Wallet_TA__GetCurrency_1E190AE5448CCB80554ADB907B05694F {
	int32_t InCurrencyID; // 0x60
};

struct U__TourBracketCache_TA__RequestCached_3C4BD5DE4C1037794488DA95D056A429 {
	int32_t BracketIndex; // 0x60
	DelegateProperty Callback; // 0x68
};

struct UInterpTrackInstAkEvent {
	float LastUpdatePosition; // 0x60
};

struct UPsyNetService_PersonaInfo_X {
	FOnlinePersonaData FromPlayer; // 0x90
};

struct UReservationBeacon_X {
	TArray<FBeaconMessageHandler> MessageHandlers; // 0x70
	ComponentProperty TcpBeacon; // 0x80
	ComponentProperty PsyNetBeacon; // 0x88
	DelegateProperty __MessageReceivedDelegate__Delegate; // 0x90
	DelegateProperty __EventConnected__Delegate; // 0xa8
	DelegateProperty __EventDisconnected__Delegate; // 0xc0
};

struct UOnlineGameVersion_X {
	uint32_t bUpdateRequired : 1; // 0x98
};

struct UCameraState_IntroMenu_TA {
	float FOV; // 0x90
	FVector Offset; // 0x94
	float BlendRate; // 0xa0
	ObjectProperty Focus; // 0xa8
	TArray<ObjectProperty> FocusActors; // 0xb0
	DelegateProperty __EventFocusChanged__Delegate; // 0xc0
};

struct URB_Handle {
	ComponentProperty GrabbedComponent; // 0xa0
	FName GrabbedBoneName; // 0xa8
	int32_t SceneIndex; // 0xb0
	uint32_t bInHardware : 1; // 0xb4
	uint32_t bRotationConstrained : 1; // 0xb4
	uint32_t bInterpolating : 1; // 0xb4
	FPointer HandleData; // 0xb8
	FPointer KinActorData; // 0xc0
	float LinearDamping; // 0xc8
	float LinearStiffness; // 0xcc
	FVector LinearStiffnessScale3D; // 0xd0
	FVector LinearDampingScale3D; // 0xdc
	float AngularDamping; // 0xe8
	float AngularStiffness; // 0xec
	FVector Destination; // 0xf0
	FVector StepSize; // 0xfc
	FVector Location; // 0x108
};

struct ASpecialPickup_CarGravity_TA {
	float GravityScale; // 0x388
	FVector AddedForce; // 0x38c
	float OrigGravityScale; // 0x398
};

struct UMorphNodeWeightByBoneRotation {
	float Angle; // 0xb0
	float NodeWeight; // 0xb4
	FName BoneName; // 0xb8
	EAxis BoneAxis; // 0xc0
	uint32_t bInvertBoneAxis : 1; // 0xc4
	uint32_t bControlMaterialParameter : 1; // 0xc4
	TArray<FBoneAngleMorph> WeightArray; // 0xc8
	int32_t MaterialSlotId; // 0xd8
	FName ScalarParameterName; // 0xdc
	ObjectProperty MaterialInstanceConstant; // 0xe8
};

struct USeqAct_MoveActor_TA {
	ObjectProperty Actor; // 0x178
	ObjectProperty MoveTransform; // 0x180
	float InterpSpeed; // 0x188
	uint32_t bConstantInterpSpeed : 1; // 0x18c
	uint32_t bMove : 1; // 0x18c
};

struct USeqCond_CompareString_TA {
	uint32_t bIgnoreCase : 1; // 0x140
	FString StringA; // 0x148
	FString StringB; // 0x158
};

struct URPC_UpdateTwoFactorStatus_TA {
	FString EpicAuthTicket; // 0xe8
};

struct AGameInfo_GFxMenu_TA {
	ObjectProperty CarPreviewSet; // 0x4d8
	ObjectProperty PremiumPreviewSet; // 0x4e0
	ComponentProperty ExplosionPreviewer; // 0x4e8
	ComponentProperty MenuSequencer; // 0x4f0
	FString UIStateNames[0x2]; // 0x4f8
	FName UISoundState_MainMenu; // 0x518
	TArray<ObjectProperty> CinematicSequences; // 0x520
	DelegateProperty __EventIntroCarsInPosition__Delegate; // 0x530
	DelegateProperty __EventUIStateChanged__Delegate; // 0x548
};

struct USpeechRecognition {
	FString Language; // 0x60
	float ConfidenceThreshhold; // 0x70
	TArray<FRecogVocabulary> Vocabularies; // 0x78
	TArray<char> VoiceData; // 0x88
	TArray<char> WorkingVoiceData; // 0x98
	TArray<char> UserData; // 0xa8
	FRecogUserData InstanceData[0x4]; // 0xb8
	uint32_t bDirty : 1; // 0x118
	uint32_t bInitialised : 1; // 0x118
	FPointer FnxVoiceData; // 0x120
};

struct USoundClass {
	FSoundClassProperties Properties; // 0x60
	TArray<FName> ChildClassNames; // 0x80
	uint32_t bIsChild : 1; // 0x90
	int32_t MenuID; // 0x94
	TMap<None, None> EditorData; // 0x98
};

struct UParticleSystemReplay {
	int32_t ClipIDNumber; // 0x60
	TArray<FParticleSystemReplayFrame> Frames; // 0x68
};

struct USoundNodeOscillator {
	uint32_t bModulateVolume : 1; // 0x78
	uint32_t bModulatePitch : 1; // 0x78
	float AmplitudeMin; // 0x7c
	float AmplitudeMax; // 0x80
	float FrequencyMin; // 0x84
	float FrequencyMax; // 0x88
	float OffsetMin; // 0x8c
	float OffsetMax; // 0x90
	float CenterMin; // 0x94
	float CenterMax; // 0x98
	FRawDistributionFloat Amplitude; // 0xa0
	FRawDistributionFloat Frequency; // 0xc8
	FRawDistributionFloat Offset; // 0xf0
	FRawDistributionFloat Center; // 0x118
};

struct UMaterialExpressionConstant {
	float R; // 0xc0
};

struct UParticleModuleSizeScaleOverDensity {
	FRawDistributionVector SizeScaleOverDensity; // 0x70
};

struct UMaterialExpressionDynamicParameter {
	TArray<FString> ParamNames; // 0xc0
};

struct UPBRuleNodeSize {
	EProcBuildingAxis SizeAxis; // 0x98
	float DecisionSize; // 0x9c
	uint32_t bUseTopLevelScopeSize : 1; // 0xa0
};

struct U__WebCache_X__DownloadData_380C54494951F93BA9C5C0936FE5BDFA {
	ObjectProperty WebRequest; // 0x60
};

struct URPC_UpdateClubColors_X {
	int32_t PrimaryColor; // 0xf8
	int32_t AccentColor; // 0xfc
};

struct UBTRandomSelector {
	TArray<float> ChildWeights; // 0xc8
	TArray<int32_t> RemainingChildren; // 0xd8
};

struct UGameplaySettingsSave_TA {
	EVoiceFilter VoiceFilter; // 0xc8
	EVoiceFilter ChatFilter; // 0xc9
	EEffectsIntensity EffectIntensity; // 0xca
	EStatEventDisplayLevels StatEventDisplayLevel; // 0xcb
	EStatGraphLevel StatGraphLevel; // 0xcc
	float SafeZoneRatio; // 0xd0
	float UIScale; // 0xd4
	uint32_t bColorBlind : 1; // 0xd8
	uint32_t bForceDefaultColors : 1; // 0xd8
	uint32_t bEnableHorizontalSplitscreen : 1; // 0xd8
	uint32_t bEnableFreeplayUnlimitedBoost : 1; // 0xd8
	uint32_t bUseSteamInput : 1; // 0xd8
	float NameplateScale; // 0xdc
	DelegateProperty __VoiceFilter__ChangeNotify; // 0xe0
	DelegateProperty __ChatFilter__ChangeNotify; // 0xf8
	DelegateProperty __bEnableFreeplayUnlimitedBoost__ChangeNotify; // 0x110
	DelegateProperty __bUseSteamInput__ChangeNotify; // 0x128
};

struct AEmitterCameraLensEffectBase {
	ObjectProperty PS_CameraEffect; // 0x280
	ObjectProperty PS_CameraEffectNonExtremeContent; // 0x288
	float BaseFOV; // 0x290
	float DistFromCamera; // 0x294
	uint32_t bAllowMultipleInstances : 1; // 0x298
	TArray<FNone*> EmittersToTreatAsSame; // 0x2a0
	ObjectProperty BaseCamera; // 0x2b0
};

struct USeqAct_StreamInTextures {
	uint32_t bLocationBased : 1; // 0x178
	uint32_t bStreamingActive : 1; // 0x178
	uint32_t bHasTriggeredAllLoaded : 1; // 0x178
	float Seconds; // 0x17c
	float StreamingDistanceMultiplier; // 0x180
	int32_t NumWantingResourcesID; // 0x184
	float StopTimestamp; // 0x188
	TArray<ObjectProperty> LocationActors; // 0x190
	TArray<ObjectProperty> ForceMaterials; // 0x1a0
	FTextureGroupContainer CinematicTextureGroups; // 0x1b0
	int32_t SelectedCinematicTextureGroups; // 0x1b4
};

struct UReplayPackageMap_TA {
	ObjectProperty Replay; // 0x120
	TArray<ObjectProperty> ObjectTable; // 0x148
};

struct UGetUploadUrlsPlayer_TA {
	FUniqueNetId PlayerID; // 0x60
	int32_t ActorID; // 0xa8
};

struct USeqAct_SetParticleSysParam {
	TArray<FParticleSysParam> InstanceParameters; // 0x160
	uint32_t bOverrideScalar : 1; // 0x170
	uint32_t bOverrideVector : 1; // 0x170
	float ScalarValue; // 0x174
	FVector VectorValue; // 0x178
};

struct ACarComponent_FlipCar_TA {
	float FlipCarImpulse; // 0x2e0
	float FlipCarTorque; // 0x2e4
	float FlipCarTime; // 0x2e8
	uint32_t bFlipRight : 1; // 0x2ec
};

struct UBuildInfo_TA {
	FString VersionString; // 0x60
	int32_t Changelist; // 0x70
	FString Branch; // 0x78
	FString Label; // 0x88
};

struct U__MatchSeries_TA__GetSeriesWinnerFromData_6F0B4806435F51077B6C12BA9EE9D63D {
	int32_t HalfMatchGames; // 0x60
};

struct UAnimNodeSequence {
	FName AnimSeqName; // 0x130
	float Rate; // 0x138
	uint32_t bPlaying : 1; // 0x13c
	uint32_t bLooping : 1; // 0x13c
	uint32_t bCauseActorAnimEnd : 1; // 0x13c
	uint32_t bCauseActorAnimPlay : 1; // 0x13c
	uint32_t bZeroRootRotation : 1; // 0x13c
	uint32_t bZeroRootTranslation : 1; // 0x13c
	uint32_t bDisableWarningWhenAnimNotFound : 1; // 0x13c
	uint32_t bNoNotifies : 1; // 0x13c
	uint32_t bForceRefposeWhenNotPlaying : 1; // 0x13c
	uint32_t bIsIssuingNotifies : 1; // 0x13c
	uint32_t bForceAlwaysSlave : 1; // 0x13c
	uint32_t bSynchronize : 1; // 0x13c
	uint32_t bReverseSync : 1; // 0x13c
	uint32_t bShowTimeLineSlider : 1; // 0x13c
	uint32_t bLoopCameraAnim : 1; // 0x13c
	uint32_t bRandomizeCameraAnimLoopStartTime : 1; // 0x13c
	uint32_t bEditorOnlyAddRefPoseToAdditiveAnimation : 1; // 0x13c
	uint32_t bCheckForFinishAnimEarly : 1; // 0x13c
	uint32_t bBlendingOut : 1; // 0x13c
	float CurrentTime; // 0x140
	float PreviousTime; // 0x144
	float EndTime; // 0x148
	ObjectProperty AnimSeq; // 0x150
	int32_t AnimLinkupIndex; // 0x158
	float NotifyWeightThreshold; // 0x15c
	FName SynchGroupName; // 0x160
	float SynchPosOffset; // 0x168
	ObjectProperty CameraAnim; // 0x170
	ObjectProperty ActiveCameraAnimInstance; // 0x178
	float CameraAnimScale; // 0x180
	float CameraAnimPlayRate; // 0x184
	float CameraAnimBlendInTime; // 0x188
	float CameraAnimBlendOutTime; // 0x18c
	ERootBoneAxis RootBoneOption[0x3]; // 0x190
	ERootRotationOption RootRotationOption[0x3]; // 0x193
	TArray<ObjectProperty> MetaDataSkelControlList; // 0x198
};

struct URPC_UpdateGameServer_X {
	QWordProperty ServerId; // 0xe8
	int32_t Playlist; // 0xf0
	int32_t MaxPlayers; // 0xf4
	int32_t NumPlayersTeam1; // 0xf8
	int32_t NumPlayersTeam2; // 0xfc
	int32_t ReservationsTeam1; // 0x100
	int32_t ReservationsTeam2; // 0x104
	uint32_t bIsPostGame : 1; // 0x108
	uint32_t bIsBotMatch : 1; // 0x108
	int32_t TimeRemaining; // 0x10c
	FString ExclusivePlatform; // 0x110
	TArray<FString> PlayersPlatforms; // 0x120
	TArray<FUniqueNetId> PlayerIDs; // 0x130
	TArray<FUniqueNetId> AbandonedPlayerIDs; // 0x140
	FString CustomServerName; // 0x150
	FString CustomServerPassword; // 0x160
	int32_t ScoreTeam1; // 0x170
	int32_t ScoreTeam2; // 0x174
	int32_t ClubID; // 0x178
};

struct ACar_TA {
	TArray<ObjectProperty> DefaultCarComponents; // 0x8a0
	ComponentProperty EngineAudio; // 0x8b0
	ComponentProperty EngineAudioRev; // 0x8b8
	ComponentProperty ThrottleShake; // 0x8c0
	ObjectProperty FlipComponent; // 0x8c8
	EDemolishTarget DemolishTarget; // 0x8d0
	EDemolishSpeed DemolishSpeed; // 0x8d1
	ComponentProperty Loadout; // 0x8d8
	uint32_t bLoadoutSet : 1; // 0x8e0
	uint32_t bDemolishOnOpposingGround : 1; // 0x8e0
	uint32_t bWasOnOpposingGround : 1; // 0x8e0
	uint32_t bDemolishOnGoalZone : 1; // 0x8e0
	uint32_t bWasInGoalZone : 1; // 0x8e0
	uint32_t bOverrideHandbrakeOn : 1; // 0x8e0
	uint32_t bTeamBumpsUseCarForceMultiplier : 1; // 0x8e0
	uint32_t bOverrideBoostOn : 1; // 0x8e0
	uint32_t bUseDefaultLoadout : 1; // 0x8e0
	ObjectProperty ExitFXArchetype; // 0x8e8
	ObjectProperty DemolishExplosionArchetype; // 0x8f0
	ObjectProperty DemolishExplosion; // 0x8f8
	ComponentProperty BallIndicatorArchetype; // 0x900
	ComponentProperty BallIndicator; // 0x908
	float MaxTimeForDodge; // 0x910
	float LastWheelsHitBallTime; // 0x914
	FLoadoutTeamPaint TeamPaint; // 0x918
	FClubColorSet ClubColors; // 0x928
	float ReplicatedCarScale; // 0x930
	FDemolishData ReplicatedDemolish; // 0x938
	FDemolishData2 ReplicatedDemolish_CustomFX; // 0x960
	FDemolishDataGoalExplosion ReplicatedDemolishGoalExplosion; // 0x990
	ObjectProperty BodyFXActor; // 0x9c0
	ObjectProperty AttackerPRI; // 0x9c8
	FVector MouseAccel; // 0x9d0
	FVector MouseAirAccel; // 0x9dc
	ObjectProperty AttachedPickup; // 0x9e8
	ObjectProperty RumblePickups; // 0x9f0
	FVector ReplayFocusOffset; // 0x9f8
	float AddedBallForceMultiplier; // 0xa04
	float AddedCarForceMultiplier; // 0xa08
	ComponentProperty CarTrajectoryComponent; // 0xa10
	ObjectProperty GameEvent; // 0xa18
	ComponentProperty NameplateComponentCar; // 0xa20
	ComponentProperty ExplosionHitHandler; // 0xa28
	float ReplicatedCarMaxLinearSpeedScale; // 0xa30
	DelegateProperty __EventVehicleSetup__Delegate; // 0xa38
	DelegateProperty __EventBumpedCar__Delegate; // 0xa50
	DelegateProperty __EventDemolished__Delegate; // 0xa68
	DelegateProperty __EventTeamSet__Delegate; // 0xa80
	DelegateProperty __EventTeamPaintChanged__Delegate; // 0xa98
	DelegateProperty __EventHitBall__Delegate; // 0xab0
	DelegateProperty __EventLanded__Delegate; // 0xac8
	DelegateProperty __EventSuperSonicChanged__Delegate; // 0xae0
	DelegateProperty __EventHitWorld__Delegate; // 0xaf8
	DelegateProperty __RumblePickups__ChangeNotify; // 0xb10
};

struct UIdleFeature_TA {
	float IdleActionTime; // 0x60
	float IdleWarningTime; // 0x64
};

struct UGFxData_ESportConfig_TA {
	ObjectProperty ESportEvents; // 0x98
};

struct U__ProductAsset_Attachment_TA__ModifyThumbnailScene_91BD11E94F8240C8CAEB51BCB7D60FB1 {
	ComponentProperty AttachSKC; // 0x60
};

struct U__GFxData_PlayerBanners_TA__CreatePlayerBannerPreview_4AC0023D4F40255EE98F778B29D2509B {
	ObjectProperty OnlineProduct; // 0x60
	int32_t InColorID; // 0x68
	FProductHashID HashID; // 0x6c
};

struct UGFxData_MapPrefs_TA {
	TArray<FGFxPlaylistType> PlaylistTypes; // 0x98
	TArray<FGFxMapType> MapTypes; // 0xa8
	TArray<FGFxMapPlaylist> Playlists; // 0xb8
	TArray<FGFxMapPreference> Maps; // 0xc8
	ObjectProperty MapPrefsConfig; // 0xd8
	ObjectProperty MapPrefsSave; // 0xe0
	ObjectProperty MapsConfig; // 0xe8
};

struct URPC_PlatformAuth_TA {
	FString NintendoAccountID; // 0xe8
};

struct UOnlineSubsystem {
	FPointer VfTable_FTickableObject; // 0x60
	TScriptInterface<Class> AccountInterface; // 0x68
	TScriptInterface<Class> PlayerInterface; // 0x78
	TScriptInterface<Class> PlayerInterfaceEx; // 0x88
	TScriptInterface<Class> MarketplaceInterface; // 0x98
	TScriptInterface<Class> SystemInterface; // 0xa8
	TScriptInterface<Class> GameInterface; // 0xb8
	TScriptInterface<Class> ContentInterface; // 0xc8
	TScriptInterface<Class> VoiceInterface; // 0xd8
	TScriptInterface<Class> StatsInterface; // 0xe8
	TScriptInterface<Class> NewsInterface; // 0xf8
	TScriptInterface<Class> PartyChatInterface; // 0x108
	TScriptInterface<Class> TitleFileInterface; // 0x118
	TScriptInterface<Class> TitleFileCacheInterface; // 0x128
	TScriptInterface<Class> UserCloudInterface; // 0x138
	TScriptInterface<Class> SharedCloudInterface; // 0x148
	TScriptInterface<Class> SocialInterface; // 0x158
	TScriptInterface<Class> AuthInterface; // 0x168
	TScriptInterface<Class> PersistentAuthInterface; // 0x178
	TScriptInterface<Class> GameDVRInterface; // 0x188
	TScriptInterface<Class> CommunityContentInterface; // 0x198
	TScriptInterface<Class> PurchaseInterface; // 0x1a8
	TScriptInterface<Class> LobbyInterface; // 0x1b8
	TScriptInterface<Class> FriendsInterface; // 0x1c8
	FNone* SearchClass; // 0x1d8
	uint32_t bSupportsMultiSignin : 1; // 0x1e0
	uint32_t bSupportsMultiVoice : 1; // 0x1e0
	uint32_t bShowPrivilegeCheckErrors : 1; // 0x1e0
	TArray<ComponentProperty> AccountSettings; // 0x1e8
	TArray<FSteamDLCInfo> SteamDLC; // 0x1f8
	TArray<FPS4DLCInfo> PS4DLC; // 0x208
	TArray<FXboxOneDLCInfo> XboxOneDLC; // 0x218
	TArray<FSwitchDLCInfo> SwitchDLC; // 0x228
	TArray<FEpicDLCInfo> EpicDLC; // 0x238
	OnlinePlatform OnlinePlatformType; // 0x248
	EOnlineServerConnectionStatus CurrentConnectionStatus; // 0x249
	TArray<FString> OnlineSubsystemNames; // 0x250
	TArray<FNamedInterface> NamedInterfaces; // 0x260
	TArray<FNamedInterfaceDef> NamedInterfaceDefs; // 0x270
	TArray<FNamedSession> Sessions; // 0x280
	FString IniLocPatcherClassName; // 0x290
	ObjectProperty Patcher; // 0x2a0
	float AsyncMinCompletionTime; // 0x2a8
	DelegateProperty __FeaturePrivilegeLevelUpdated__Delegate; // 0x2b0
	DelegateProperty __EventPlatformAccountSettingsCreated__Delegate; // 0x2c8
	DelegateProperty __OnReadOnlineAvatarComplete__Delegate; // 0x2e0
	DelegateProperty __OnSystemUserControllerPairingChanged__Delegate; // 0x2f8
};

struct UGFxData_QuickChatBindings_TA {
	TArray<FLocalizedQuickChat> AllQuickChats; // 0x98
	TArray<FLocalizedQuickChatBinding> Bindings; // 0xa8
	TArray<FName> QuickChats; // 0xb8
	TArray<FName> PostGameQuickChats; // 0xc8
	TArray<FName> PreGameQuickChats; // 0xd8
	ObjectProperty QuickChatSave; // 0xe8
};

struct UInterpTrackInstSlomo {
	float OldTimeDilation; // 0x60
};

struct UEpicConfig_X {
	uint32_t bPollDuringAccountLinking : 1; // 0x78
	int32_t SecondsBetweenPolling; // 0x7c
	int32_t SecondsBeforeRequestsTimeout; // 0x80
	int32_t SecondsToWaitBeforeRetryingAuth; // 0x84
	int32_t SecondsToWaitBeforeUpdatingFriendsList; // 0x88
	TArray<ObjectProperty> AccountLinkURLOverrides; // 0x90
	FString DefaultAccountLinkURL; // 0xa0
	FString ProductionPermissionServerURL; // 0xb0
	FString AccountPermissionsURL; // 0xc0
	TArray<FPermissionPair> ChatPermissionPairs; // 0xd0
	EChatPermissionLevel DefaultPermissionLevel; // 0xe0
	FString SandboxId; // 0xe8
	FString DeploymentId; // 0xf8
};

struct AInteractiveFoliageActor {
	ComponentProperty CylinderComponent; // 0x288
	FVector TouchingActorEntryPosition; // 0x290
	FVector FoliageVelocity; // 0x29c
	FVector FoliageForce; // 0x2a8
	FVector FoliagePosition; // 0x2b4
	float FoliageDamageImpulseScale; // 0x2c0
	float FoliageTouchImpulseScale; // 0x2c4
	float FoliageStiffness; // 0x2c8
	float FoliageStiffnessQuadratic; // 0x2cc
	float FoliageDamping; // 0x2d0
	float MaxDamageImpulse; // 0x2d4
	float MaxTouchImpulse; // 0x2d8
	float MaxForce; // 0x2dc
	float Mass; // 0x2e0
};

struct UProductAttribute_UnlockForcedProducts_TA {
	uint32_t bUnlockTeamColor : 1; // 0x80
	uint32_t bUnlockCustomColor : 1; // 0x80
	TArray<ObjectProperty> SlotsToUnlock; // 0x88
};

struct USave_TA {
	ObjectProperty SaveObjectManager; // 0x60
	FString DirectoryPath; // 0x68
	FString SaveType; // 0x78
	FString SaveExt; // 0x88
	uint32_t bExactFileMatch : 1; // 0x98
};

struct UUIDataStore_DynamicResource {
	ObjectProperty ProfileProvider; // 0xa0
	ObjectProperty GameResourceDataStore; // 0xa8
	TArray<FDynamicResourceProviderDefinition> ResourceProviderDefinitions; // 0xb0
	FMultiMap_Mirror ResourceProviders; // 0xc0
};

struct UCameraState_TA {
	uint32_t bShowCarHUD : 1; // 0x90
	uint32_t bAllowRearCamera : 1; // 0x90
	float StateStartTime; // 0x94
};

struct UMaterialExpressionMusicAnalysisParameter {
	EMusicAnalysisShaderParameterType MusicAnalysisShaderParamType; // 0xc0
};

struct ULensFlare {
	FLensFlareElement SourceElement; // 0x60
	ObjectProperty SourceMesh; // 0x228
	ESceneDepthPriorityGroup SourceDPG; // 0x230
	ESceneDepthPriorityGroup ReflectionsDPG; // 0x231
	TArray<FLensFlareElement> Reflections; // 0x238
	float OuterCone; // 0x248
	float InnerCone; // 0x24c
	float ConeFudgeFactor; // 0x250
	float Radius; // 0x254
	uint32_t bUseTrueConeCalculation : 1; // 0x258
	uint32_t bUseFixedRelativeBoundingBox : 1; // 0x258
	uint32_t bRenderDebugLines : 1; // 0x258
	uint32_t ThumbnailImageOutOfDate : 1; // 0x258
	float MinStrength; // 0x25c
	FRawDistributionFloat ScreenPercentageMap; // 0x260
	FBox FixedRelativeBoundingBox; // 0x288
	ObjectProperty CurveEdSetup; // 0x2a8
	int32_t ReflectionCount; // 0x2b0
	FRotator ThumbnailAngle; // 0x2b4
	float ThumbnailDistance; // 0x2c0
	ObjectProperty ThumbnailImage; // 0x2c8
};

struct ABall_TA {
	ComponentProperty StaticMesh; // 0x7a8
	ComponentProperty TranslucentStaticMesh; // 0x7b0
	float MeshTranslucency; // 0x7b8
	TArray<ObjectProperty> TranslucentMaterials; // 0x7c0
	FCarBallInteractionSettings CarInteraction; // 0x7d0
	ObjectProperty EndOfGameFXArchetype; // 0x808
	ObjectProperty ExplosionArchetype; // 0x810
	ObjectProperty NoGoalExplosionArchetype; // 0x818
	uint32_t bAllowPlayerExplosionOverride : 1; // 0x820
	uint32_t bNotifyGroundHit : 1; // 0x820
	uint32_t bEndOfGameHidden : 1; // 0x820
	uint32_t bFadeIn : 1; // 0x820
	uint32_t bFadeOut : 1; // 0x820
	uint32_t bPredictionOnGround : 1; // 0x820
	uint32_t bCanBeAttached : 1; // 0x820
	uint32_t bItemFreeze : 1; // 0x820
	FVector MagnusCoefficient; // 0x824
	ComponentProperty BallCamTarget; // 0x830
	float Radius; // 0x838
	float VisualRadius; // 0x83c
	TArray<FBallHitInfo> Touches; // 0x840
	float LastCalculateCarHit; // 0x850
	FVector InitialLocation; // 0x854
	FRotator InitialRotation; // 0x860
	float LastHitWorldTime; // 0x86c
	float ReplicatedBallScale; // 0x870
	ObjectProperty ReplicatedBallMesh; // 0x878
	float ReplicatedWorldBounceScale; // 0x880
	float ReplicatedBallGravityScale; // 0x884
	float ReplicatedBallMaxLinearSpeedScale; // 0x888
	float ReplicatedAddedCarBounceScale; // 0x88c
	float AdditionalCarGroundBounceScaleZ; // 0x890
	float AdditionalCarGroundBounceScaleXY; // 0x894
	ObjectProperty ReplicatedPhysMatOverride; // 0x898
	char HitTeamNum; // 0x8a0
	ObjectProperty GameEvent; // 0x8a8
	FExplosionData ReplicatedExplosionData; // 0x8b0
	FExplosionDataExtended ReplicatedExplosionDataExtended; // 0x8c8
	ObjectProperty Explosion; // 0x8e8
	float ExplosionTime; // 0x8f0
	FVector OldLocation; // 0x8f4
	TArray<ObjectProperty> FadeMaterials; // 0x900
	float PredictionTimestep; // 0x910
	TArray<FPredictedPosition> PredictedPositions; // 0x918
	float LastPredictionTime; // 0x928
	FGoalPenetrationData GoalPenetration; // 0x930
	float GroundForce; // 0x958
	ObjectProperty CurrentAffector; // 0x960
	ComponentProperty TrajectoryComponent; // 0x968
	ComponentProperty PitchTekComponent; // 0x970
	ObjectProperty GoalExplosionOrientation; // 0x978
	DelegateProperty __EventCarTouch__Delegate; // 0x980
	DelegateProperty __EventHitWorld__Delegate; // 0x998
	DelegateProperty __EventHitGround__Delegate; // 0x9b0
	DelegateProperty __EventHitGoal__Delegate; // 0x9c8
	DelegateProperty __EventGameEventSet__Delegate; // 0x9e0
	DelegateProperty __EventExploded__Delegate; // 0x9f8
	DelegateProperty __EventHitTeamNumChanged__Delegate; // 0xa10
	DelegateProperty __EventTrailIntensityChanged__Delegate; // 0xa28
};

struct AFXActor_BreakoutPlatform_TA {
	ObjectProperty PlatformMaterial; // 0x360
	ObjectProperty RaysMaterial; // 0x368
	FName LocationParam; // 0x370
	TArray<FPlatformParam> DamagedParams; // 0x378
	TArray<FPlatformParam> BrokenParams; // 0x388
	ObjectProperty DamageSFX; // 0x398
	ObjectProperty DirectBreakSFX; // 0x3a0
	ObjectProperty IndirectBreakSFX; // 0x3a8
	float DamageDistanceSpeed; // 0x3b0
	ObjectProperty DamagedState; // 0x3b8
	ObjectProperty BrokenState; // 0x3c0
	ObjectProperty BreakoutPlatform; // 0x3c8
	ObjectProperty MIC; // 0x3d0
	ObjectProperty RaysMIC; // 0x3d8
	char DamageState; // 0x3e0
	float DamageTime; // 0x3e4
	float BrokenTime; // 0x3e8
	float RemainingTime; // 0x3ec
};

struct USeqAct_SetReplayFX_TA {
	float FocusDistance; // 0x160
	int32_t FocusBlur; // 0x164
	float FocusStrength; // 0x168
	uint32_t bUseGreenScreen : 1; // 0x16c
	uint32_t bUseVignetteOverlay : 1; // 0x16c
	FLinearColor GreenScreenColor; // 0x170
	EImageFilterOptions ImageFilterIndex; // 0x180
	float ImageFilterIntensity; // 0x184
	float Vignette; // 0x188
};

struct UMatchBroadcastComponent_TA {
	ObjectProperty MatchLog; // 0x70
	ObjectProperty OnlineGame; // 0x78
};

struct UMapDataLoader_TA {
	TArray<FMapSelectorPair> MapSelectors; // 0x60
	TArray<FMapImageLoadRequest> MapImageLoadRequests; // 0x70
};

struct UPartyMessage_PartyMemberJoinGame_X {
	FPartyMemberServer Server; // 0xa8
};

struct URPC_ProductsTradeAllowed_TA {
	FUniqueNetId PlayerID; // 0xe8
	FUniqueNetId OtherPlayerID; // 0x130
	int32_t MaxCurrencyTradeAmount; // 0x178
};

struct UGFxData_ClubInvite_TA {
	FString ClubName; // 0x128
	FString ClubTag; // 0x138
	ObjectProperty Invite; // 0x148
};

struct ARoute {
	FPointer VfTable_IEditorLinkSelectionInterface; // 0x268
	ERouteType RouteType; // 0x270
	TArray<FActorReference> RouteList; // 0x278
	float FudgeFactor; // 0x288
	int32_t RouteIndexOffset; // 0x28c
};

struct UCameraState_ReplayAutoCam_TA {
	float FOVInterpSpeed; // 0xb8
	float StartViewFocusTime; // 0xbc
	float FocusPitchInterpSpeed; // 0xc0
	float FocusYawInterpSpeed; // 0xc4
	float AerialFOV; // 0xc8
	float CountDownFOV; // 0xcc
	float CountDownPanSpeed; // 0xd0
	float CountDownRotateSpeed; // 0xd4
	float CountDownPanBlendAmount; // 0xd8
	float CountDownFocusActorStartTime; // 0xdc
	float LocationBlendSpeed; // 0xe0
	float BallAerialZStartTime; // 0xe4
	float MinBallAerialZHeight; // 0xe8
	float MinPlayerAerialZHeight; // 0xec
	float MinFocusActorViewTime; // 0xf0
	float BallFloorFocusPercent; // 0xf4
	float LocationAngleInterpSpeed; // 0xf8
	float LastLocationAngleUpdateTime; // 0xfc
	float MinStartRadiusForPlayerAerial; // 0x100
	float MaxStartRadiusForPlayerAerial; // 0x104
	float DesiredCameraDistance; // 0x108
	float ResetToMapDefaultTime; // 0x10c
	float MaxWaitTimeTillBallHit; // 0x110
	float FocusActorZViewOffset; // 0x114
	float FloorTraceDistance; // 0x118
	float BackAwayFromWallDistance; // 0x11c
	float NoCarsNearBallDistance; // 0x120
	float MinPlayerCameraFloorHeight; // 0x124
	float FocusPointInterpSpeed; // 0x128
	float MinMaxPitch; // 0x12c
	float LastDesiredLocationBlendSpeed; // 0x130
	float AdditionalFocusZ; // 0x134
	float TimeSinceIgnoredGoalFocusExtent; // 0x138
	float LastTimeAPlayerWasNearBall; // 0x13c
	float AdditionalBackAwayFromBallSpeed; // 0x140
	float GoalScorerFocusDistance; // 0x144
	float MapResetStartDistance; // 0x148
	float MapResetStartHeight; // 0x14c
	float GoalScoredDistance; // 0x150
	float MaxGoalYZoomOutDistance; // 0x154
	float MaxGoalXZoomOutDistance; // 0x158
	float MinCameraDistanceToBall; // 0x15c
	uint32_t bSnapFOV : 1; // 0x160
	uint32_t bSnapToFocus : 1; // 0x160
	uint32_t bBallHasBeenHit : 1; // 0x160
	uint32_t bHasGoalScorerFocus : 1; // 0x160
	uint32_t bHitWallLastFrame : 1; // 0x160
	FVector BallFloorLocation; // 0x164
	FVector BallFloorNormal; // 0x170
	FVector LastCarFocusOffset; // 0x17c
	FVector CountDownPanDirection; // 0x188
	FVector CountDownPanStartOffset; // 0x194
	FVector CountDownRotateOffset; // 0x1a0
	FVector LastFocusOffset; // 0x1ac
	FVector LastFocusLocation; // 0x1b8
	FVector LastDesiredLocation; // 0x1c4
	FRotator LocationAngle; // 0x1d0
	FRotator DesiredLocationAngle; // 0x1dc
	FRotator DesiredRotation; // 0x1e8
	FRotator MapResetStartRotation; // 0x1f4
	ObjectProperty FocusActor; // 0x200
	ObjectProperty LastScorer; // 0x208
	TArray<ObjectProperty> AerialPRIs; // 0x210
	TArray<ObjectProperty> CountDownPRIs; // 0x220
	ComponentProperty GoalFocus; // 0x230
	ECountDownFocus CountDownFocusType; // 0x238
	ObjectProperty Ball; // 0x240
	ObjectProperty SoccarGame; // 0x248
	ObjectProperty ReplayCameraState; // 0x250
	FProfileSliderLimits CameraDistanceLimits; // 0x258
	FProfileSliderLimits CameraZLimits; // 0x264
	FProfileSliderLimits CameraMoveSpeedLimits; // 0x270
	FProfileSliderLimits CameraMoveSpeedZLimits; // 0x27c
	FProfileSliderLimits PlayerCameraDistanceLimits; // 0x288
	FProfileSliderLimits RotateSpeedLimits; // 0x294
	FProfileSliderLimits PlayerFocusBlendSpeedLimits; // 0x2a0
	FProfileSliderLimits AerialPredictionLimits; // 0x2ac
	ObjectProperty CameraSave; // 0x2b8
};

struct UGFxClubAction_TA {
	ObjectProperty Task; // 0x60
	FString ErrorMessage; // 0x68
	DelegateProperty __StartTaskDelegate__Delegate; // 0x78
	DelegateProperty __EventComplete__Delegate; // 0x90
};

struct U__TourService_PsyNet_TA__CheckIn_1A41B52542B0AB088538329DE63FB3AC {
	DelegateProperty Callback; // 0x60
	ObjectProperty TourSettings; // 0x78
	FCustomMatchTeamSettings Settings; // 0x80
	TArray<FUniqueNetId> AllTeamMemberIDs; // 0xa0
};

struct USupportACreatorErrors_TA {
	ObjectProperty InvalidSupportACreatorCode; // 0x80
};

struct USeqEvent_GarageComplexState_TA {
	FString GarageState; // 0x180
	FString PreviousGarageState; // 0x190
};

struct ASpecialPickup_GrapplingHook_TA {
	float Impulse; // 0x3c0
	float Force; // 0x3c4
	float MaxRopeLength; // 0x3c8
	float PredictionSpeed; // 0x3cc
	uint32_t bDeactivateOnTouch : 1; // 0x3d0
	uint32_t bInstant : 1; // 0x3d0
	uint32_t bBlocked : 1; // 0x3d0
	uint32_t bAttachedToBall : 1; // 0x3d0
	FInterpCurveFloat RopeLengthCurve; // 0x3d8
	ObjectProperty RopeMesh; // 0x3f0
	FVector RopeMeshScale; // 0x3f8
	float RopeMeshInitialSize; // 0x404
	FRotator RopeRotationOffset; // 0x408
	FName RopeMeshSlackParam; // 0x414
	FName RopeMeshGravityParam; // 0x41c
	ObjectProperty HookMesh; // 0x428
	FVector HookMeshScale; // 0x430
	FVector HookMeshOffset; // 0x43c
	FRotator HookRotationOffset; // 0x448
	float HitDistanceOffset; // 0x454
	float AfterAttachDuration; // 0x458
	ObjectProperty HookAnimSet; // 0x460
	FName HookClosedAnim; // 0x468
	FName HookOpenAnim; // 0x470
	float BlockedRequiredMoveDistance; // 0x478
	float BlockedRequiredMoveTime; // 0x47c
	float BlockedStartTime; // 0x480
	FVector BlockedStartPos; // 0x484
	ComponentProperty RMC; // 0x490
	ObjectProperty RMI; // 0x498
	ComponentProperty HMC; // 0x4a0
	ObjectProperty Ball; // 0x4a8
	FVector RopeOrigin; // 0x4b0
	float RopeToTime; // 0x4bc
	float CurrentRopeLength; // 0x4c0
	float AttachTime; // 0x4c4
};

struct UCameraStateSelector_Priority_TA {
	TArray<FStateParams> PriorityStates; // 0x88
	uint32_t bSelectFirst : 1; // 0x98
};

struct ASpecialPickup_BallCarSpring_TA {
	FName SpringMeshDistanceParam; // 0x568
};

struct UWebApplication {
	ObjectProperty WorldInfo; // 0x60
	ObjectProperty WebServer; // 0x68
	FString Path; // 0x70
};

struct ANxForceField {
	int32_t ExcludeChannel; // 0x268
	uint32_t bForceActive : 1; // 0x26c
	FRBCollisionChannelContainer CollideWithChannels; // 0x270
	ERBCollisionChannel RBChannel; // 0x274
	FPointer ForceField; // 0x278
	TArray<FPointer> ConvexMeshes; // 0x280
	TArray<FPointer> ExclusionShapes; // 0x290
	TArray<FPointer> ExclusionShapePoses; // 0x2a0
	FPointer U2NRotation; // 0x2b0
	int32_t SceneIndex; // 0x2b8
};

struct UMultiCueSplineAudioComponent {
	TArray<FMultiCueSplineSoundSlot> SoundSlots; // 0x320
	int32_t CurrentSlotIndex; // 0x330
};

struct UGameMode_TA {
	ObjectProperty GameArchetype; // 0x60
	ObjectProperty MapSet; // 0x68
	ObjectProperty FreeplayMapSet; // 0x70
	ObjectProperty StandardMapSet; // 0x78
	TArray<FName> DisallowedMutatorCategories; // 0x80
	uint32_t bEnabled : 1; // 0x90
	FNone* GameInfoClass; // 0x98
	FString GameArchetypePath; // 0xa0
};

struct U__OnlineProductExpirationHelper_TA__HandleNotificationSaveAdded_AB3D01A5487075DE45DBF0B687604BA0 {
	ObjectProperty OnlineProduct; // 0x60
};

struct UBTC_TeamSize {
	int32_t MinTeamSize; // 0x90
	int32_t MaxTeamSize; // 0x94
};

struct UGFxData_RewardDrop_XP_TA {
	uint32_t bCanDropOnlineRewards : 1; // 0xa0
};

struct USeqAct_DivideInt {
	int32_t ValueA; // 0x160
	int32_t ValueB; // 0x164
	float FloatResult; // 0x168
	int32_t IntResult; // 0x16c
};

struct USeqEvent_Console {
	FName ConsoleEventName; // 0x180
	FString EventDesc; // 0x188
};

struct UBTC_GameScore {
	float ScoreDeltaGreaterThan; // 0x90
	float ScoreDeltaLessThan; // 0x94
	int32_t ScoreDelta; // 0x98
};

struct UGFxData_LegacyStatus_TA {
	ELegacyBoxStatus LegacyStatus; // 0x98
	ELegacyStatusSetState LegacySetState; // 0x99
};

struct AStaticMeshRBActor_TA {
	ComponentProperty StaticMesh; // 0x7a8
	EApplyForceTo ApplyCollisionForceFrom; // 0x7b0
	float TouchBounceForce; // 0x7b4
	float SpeedBounchForceMultiplier; // 0x7b8
	FVector LinearConstraintsLower; // 0x7bc
	FVector LinearConstraintsUpper; // 0x7c8
	FVector AngularConstraintsLower; // 0x7d4
	FVector AngularConstraintsUpper; // 0x7e0
};

struct U__BotConfig_TA__RefreshIDs_F9A52CA34861048A1451C885D1FFF92D {
	int32_t ProductID; // 0x60
};

struct UInterpTrackInstEvent {
	float LastUpdatePosition; // 0x60
};

struct ALiftExit {
	ObjectProperty MyLiftCenter; // 0x388
	uint32_t bExitOnly : 1; // 0x390
};

struct UParticleModuleRotationRate {
	FRawDistributionFloat StartRotationRate; // 0x70
};

struct UPBRuleNodeRepeat {
	EProcBuildingAxis RepeatAxis; // 0x98
	float RepeatMaxSize; // 0x9c
};

struct USkeletalMeshSocket {
	FName SocketName; // 0x60
	FName BoneName; // 0x68
	FVector RelativeLocation; // 0x70
	FRotator RelativeRotation; // 0x7c
	FVector RelativeScale; // 0x88
	ObjectProperty PreviewSkelMesh; // 0x98
	ComponentProperty PreviewSkelComp; // 0xa0
	ObjectProperty PreviewStaticMesh; // 0xa8
	ObjectProperty PreviewParticleSystem; // 0xb0
};

struct UPlatformInterfaceBase {
	TArray<FDelegateArray> AllDelegates; // 0x60
	DelegateProperty __PlatformInterfaceDelegate__Delegate; // 0x70
};

struct USpecialEventConfig_TA {
	TArray<FSpecialEventStoreConfigs> StoreConfigs; // 0x78
	TArray<FDebugMicroEventPlaylistID> DebugMicroEventPlaylistIDs; // 0x88
	int32_t CurrencyID; // 0x98
	int32_t ShopID; // 0x9c
	FString Title; // 0xa0
	FString Subtitle; // 0xb0
	FString RedemptionTitle; // 0xc0
	FString Description; // 0xd0
	FString RedemptionDescription; // 0xe0
	FString CurrencyName; // 0xf0
	FString CurrencyImageURL; // 0x100
	FString CurrencyImageLargeURL; // 0x110
	FString BackgroundImageURL; // 0x120
	FString LogoImageURL; // 0x130
	int32_t CurrencyColor; // 0x140
	int32_t BackgroundColor; // 0x144
	QWordProperty StartTime; // 0x148
	FString StartTimeString; // 0x150
	QWordProperty EndTime; // 0x160
	FString EndTimeString; // 0x168
	QWordProperty RedemptionEndTime; // 0x178
	FString RedemptionEndTimeString; // 0x180
	ObjectProperty BackgroundImage; // 0x190
	ObjectProperty CurrencyImage; // 0x198
	ObjectProperty CurrencyImageLarge; // 0x1a0
	ObjectProperty LogoImage; // 0x1a8
	uint32_t bApplied : 1; // 0x1b0
	DelegateProperty __CurrencyID__ChangeNotify; // 0x1b8
	DelegateProperty __CurrencyImage__ChangeNotify; // 0x1d0
	DelegateProperty __CurrencyImageLarge__ChangeNotify; // 0x1e8
	DelegateProperty __bApplied__ChangeNotify; // 0x200
};

struct U__CrowdActorManager_TA__StopCrowdSound_81DFC77F45DD31C8D65397B5E497A7C1 {
	DelegateProperty GetSoundDelegate; // 0x60
};

struct UWindDirectionalSourceComponent {
	FPointer SceneProxy; // 0xa0
	float Strength; // 0xa8
	float Phase; // 0xac
	float Frequency; // 0xb0
	float Speed; // 0xb4
};

struct UFakeData_X {
	int32_t RandomSeed; // 0x60
	FFakeData1 Data1; // 0x68
	FFakeData2 Data2; // 0xa0
	FFakeData3 Data3; // 0x130
	FFakeData4 Data4; // 0x260
};

struct U__AsyncTask__All_0AA348B54A3459915BE4E0ADF77FC3DC {
	int32_t DependentsCount; // 0x60
	ObjectProperty Parent; // 0x68
};

struct UOnlinePlayerMTX_TA {
	uint32_t bEntitlementsDirty : 1; // 0x60
	uint32_t bClaimingEntitlements : 1; // 0x60
	uint32_t bMtxCodeExpired : 1; // 0x60
	uint32_t bAllowEntitlements : 1; // 0x60
	DelegateProperty __EventClaimedEntitlements__Delegate; // 0x68
	DelegateProperty __EventEntitlementsError__Delegate; // 0x80
};

struct AGameEvent_GodBall_TA {
	int32_t LastScoredTeamIndex; // 0xc78
	FVector GoalBallSpawnOffset; // 0xc7c
	FVector GoalPlayerSpawnOffset; // 0xc88
	FVector BallKickOffDirection; // 0xc94
	float BallKickOffScale; // 0xca0
	float SpawnRadiusCheck; // 0xca4
};

struct UProductAttribute_TA {
	FName Typename; // 0x60
	uint32_t bReplicated : 1; // 0x68
	uint32_t bRequiresDynamicThumbnail : 1; // 0x68
	FString Label; // 0x70
};

struct UBoostMesh_TA {
	FRandomRange FadeInTime; // 0x60
	FRandomRange FadeOutTime; // 0x68
	TArray<FAnimatedMaterialMesh> MaterialParams; // 0x70
	float MaxMaterialTime; // 0x80
};

struct UMutatorGameSettingPreset_TA {
	ObjectProperty Presets; // 0x68
};

struct AGameInfo_TrainingEditor_TA {
	uint32_t bCanExportMatinee : 1; // 0x550
};

struct USeqAct_GetGameBall_TA {
	ObjectProperty Ball; // 0x160
};

struct URPC_PurchaseItemFromShop_TA {
	int32_t ShopItemCostID; // 0xe8
	int32_t ShopID; // 0xec
	int32_t ShopDiscountID; // 0xf0
	FUniqueNetId PlayerID; // 0xf8
	int32_t Count; // 0x140
	TArray<FOnlineProductData> ProductData; // 0x148
	TArray<FCurrency> CurrencyData; // 0x158
};

struct UMaterialExpressionPower {
	FExpressionInput Base; // 0xc0
	FExpressionInput Exponent; // 0xf8
};

struct UTextureRenderTargetCube {
	int32_t SizeX; // 0x158
	EPixelFormat Format; // 0x15c
};

struct UAkMusicDevice {
	DelegateProperty __EventTrackStart__Delegate; // 0x60
	DelegateProperty __EventTrackEnd__Delegate; // 0x78
};

struct U__TAsyncResult__PsyNetMessage_X__Copy_529C42EE40A7358E4202E297AD847CB0 {
	ObjectProperty Instance; // 0x60
};

struct UEngineAudioRevSimResistance_TA {
	float Clutched; // 0x70
	float ZScale; // 0x74
	FInterpCurveFloat SideSpeedCurve; // 0x78
	float SideFriction; // 0x90
	float ZFriction; // 0x94
	float SideAngle; // 0x98
};

struct UDefaultHitHandler_TA {
	float ImpulseVelocityMultiplier; // 0x150
};

struct UProductAttribute_UnlockMethod_TA {
	EUnlockMethod UnlockMethod; // 0x80
};

struct ARLBot_SessionRecorder_TA {
	int32_t MaxRecordSizeMB; // 0x268
	TArray<char> Data; // 0x270
	FPointer Archive; // 0x280
	TArray<FPlayerActorIDPair> PlayerActorIDMap; // 0x288
};

struct UNameplateComponent_TA {
	FString PlayerName; // 0xa8
	int32_t Team; // 0xb8
	uint32_t bIsLocalPlayer : 1; // 0xbc
	uint32_t bIsReady : 1; // 0xbc
	uint32_t bLocalizeName : 1; // 0xbc
	int32_t SpectatorShortcut; // 0xc0
	DelegateProperty __EventPlayerNameSet__Delegate; // 0xc8
};

struct UMutator_TA {
	uint32_t bRecordMetrics : 1; // 0x60
};

struct UFirstTimeExperienceSave_TA {
	TArray<FCompletedFTEInfo> CompletedFTEs; // 0xc8
	FTEVersioning Versioning; // 0xd8
	FTELegacyGroupType LegacyGroupType; // 0xd9
	FName ActiveGroup; // 0xdc
	FName ActiveCheckpoint; // 0xe4
	uint32_t bTentativelyComplete : 1; // 0xec
};

struct ULightmassPrimitiveSettingsObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x60
};

struct URotateComponent_TA {
	float Momentum; // 0xa8
	float LastMomentum; // 0xac
	float RotationSpeed; // 0xb0
	FRotator CurrentRotation; // 0xb4
	float TurntableDirection; // 0xc0
	ObjectProperty SFX_Rotating; // 0xc8
	ObjectProperty SFX_Reversing; // 0xd0
	FInterpCurveFloat FallOffCurve; // 0xd8
	FInterpCurveFloat YawSpeedCurveMouse; // 0xf0
	FInterpCurveFloat YawSpeedCurveGamepad; // 0x108
	uint32_t bGrabbed : 1; // 0x120
	uint32_t bDeterminedSnapRotation : 1; // 0x120
	uint32_t bUsingGamepad : 1; // 0x120
	FRotator SnapRotation; // 0x124
	float SnapAngle; // 0x130
	int32_t TotalSnaps; // 0x134
	FRotator SnapStartRotation; // 0x138
	float MinStopMomentum; // 0x144
	float SnapBlendSpeed; // 0x148
	float Input; // 0x14c
	DelegateProperty __EventRotationChanged__Delegate; // 0x150
};

struct UGFxData_ProductAttribute_Currency_TA {
	int32_t CurrencyID; // 0xb0
};

struct UInterpTrackInstVectorProp {
	FPointer VectorProp; // 0x70
	FVector ResetVector; // 0x78
};

struct ANxForceFieldCapsule_TA {
	ComponentProperty InnerDrawComponent; // 0x2c0
	ComponentProperty OuterDrawComponent; // 0x2c8
	float InnerRadius; // 0x2d0
	float OuterRadius; // 0x2d4
	float Length; // 0x2d8
	float InnerStrength; // 0x2dc
	float OuterStrength; // 0x2e0
	float InnerMaxSpeed; // 0x2e4
	float OuterMaxSpeed; // 0x2e8
	FPointer Kernel; // 0x2f0
};

struct URPC_PurchaseSpecialEventReward_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t StoreProductID; // 0x130
	FRocketPassInfo RocketPassInfo; // 0x134
	TArray<FOnlineProductData> ProductData; // 0x140
	TArray<FOnlineXPReward> RewardDrops; // 0x150
	TArray<FCurrency> CurrencyData; // 0x160
	TArray<FCurrency> WalletCurrencies; // 0x170
};

struct UCameraState_DirectorMoving_TA {
	FVector StartOffset; // 0x180
	FVector EndOffset; // 0x18c
	FRotator StartRotation; // 0x198
	FRotator EndRotation; // 0x1a4
	FViewTargetTransitionParams PanBlend; // 0x1b0
	float StartFOV; // 0x1c0
	float EndFOV; // 0x1c4
	ECameraLoopType LoopType; // 0x1c8
	FVector CachedStart; // 0x1cc
	FVector CachedEnd; // 0x1d8
};

struct UEOSUserPermissionsError_TA {
	FString ErrorCode; // 0x60
	FString Message; // 0x70
};

struct UPsyNetUrl_X {
	uint32_t bUseSubsystemURL : 1; // 0x60
	FString URL; // 0x68
	FString URLv2; // 0x78
};

struct URPC_SetPlayerSkill_X {
	int32_t Playlist; // 0xe8
	float Mu; // 0xec
	float Sigma; // 0xf0
	int32_t MatchesPlayed; // 0xf4
};

struct U__CarMeshComponentBase_TA__ApplyPaintToObject_9B4609D14F9DFE53CBFB6AAB6146F081 {
	ObjectProperty ProductPaint; // 0x60
	ObjectProperty PaintSettings; // 0x68
	ObjectProperty ObjectToPaint; // 0x70
	ObjectProperty Product; // 0x78
};

struct U__TAsyncResult__array_LanServerRecord_X__NotifyOnResult_82BDDFEF4EE8CFC2BC230CAEC49DC27F {
	DelegateProperty Callback; // 0x60
};

struct U__EpicFriendsConverterSystem_TA__SetupEpicFriendsConverter_F781DD8646867CC4F2211FB44982030E {
	ObjectProperty Converter; // 0x60
};

struct UCDN_X {
	FString URL; // 0x60
	FString BlogURL; // 0x70
};

struct UInteractiveFoliageComponent {
	FPointer FoliageSceneProxy; // 0x308
};

struct AAutoTestManager {
	uint32_t bAutomatedPerfTesting : 1; // 0x268
	uint32_t bAutoContinueToNextRound : 1; // 0x268
	uint32_t bUsingAutomatedTestingMapList : 1; // 0x268
	uint32_t bAutomatedTestingWithOpen : 1; // 0x268
	uint32_t bExitOnCyclesComplete : 1; // 0x268
	uint32_t bCheckingForFragmentation : 1; // 0x268
	uint32_t bCheckingForMemLeaks : 1; // 0x268
	uint32_t bDoingASentinelRun : 1; // 0x268
	uint32_t bSentinelStreamingLevelStillLoading : 1; // 0x268
	int32_t AutomatedPerfRemainingTime; // 0x26c
	int32_t AutomatedTestingMapIndex; // 0x270
	TArray<FString> AutomatedMapTestingList; // 0x278
	int32_t NumAutomatedMapTestingCycles; // 0x288
	int32_t NumberOfMatchesPlayed; // 0x28c
	int32_t NumMapListCyclesDone; // 0x290
	FString AutomatedTestingExecCommandToRunAtStartMatch; // 0x298
	FString AutomatedMapTestingTransitionMap; // 0x2a8
	FString SentinelTaskDescription; // 0x2b8
	FString SentinelTaskParameter; // 0x2c8
	FString SentinelTagDesc; // 0x2d8
	ObjectProperty SentinelPC; // 0x2e8
	TArray<FVector> SentinelTravelArray; // 0x2f0
	int32_t SentinelNavigationIdx; // 0x300
	int32_t SentinelIdx; // 0x304
	int32_t NumRotationsIncrement; // 0x308
	int32_t TravelPointsIncrement; // 0x30c
	int32_t NumMinutesPerMap; // 0x310
	TArray<FString> CommandsToRunAtEachTravelTheWorldNode; // 0x318
	FString CommandStringToExec; // 0x328
};

struct U__ProductTransactions_TA__GetEquippedProducts_48181BFD464AAC16885B53BDCA1DC7C4 {
	TArray<FProductInstanceID> AllEquippedInstanceIDs; // 0x60
};

struct U__GFxData_ProductTradeIn_TA__UpdateTradeInQuantity_4AC4CE3F4AC1A1CC64563CB1696C3EF3 {
	FProductHashID HashID; // 0x60
};

struct UPsyNetService_PlayerUnfriended_X {
	FUniqueNetId PlayerID; // 0x90
};

struct ULocalPlayer_TA {
	ObjectProperty SaveGameManager; // 0x4d8
	ObjectProperty Profile; // 0x4e0
	ComponentProperty ProfileObjectProvider; // 0x4e8
	ESplitScreenPosition SplitScreenPosition; // 0x4f0
	QWordProperty SuspendingEventToken; // 0x4f8
	QWordProperty SignoutStartedEventToken; // 0x500
	uint32_t bOpenedStartMenu : 1; // 0x508
	uint32_t bPendingBroadcastLoadout : 1; // 0x508
	uint32_t bPendingBroadcastProfile : 1; // 0x508
	ObjectProperty ControllerLayouts; // 0x510
	DelegateProperty __EventProfileSet__Delegate; // 0x518
	DelegateProperty __EventSplitScreenPositionChanged__Delegate; // 0x530
};

struct URPC_AutoTour_GetSchedule_TA {
	FUniqueNetId PlayerID; // 0xe8
	FString Region; // 0x130
	TArray<FScheduledTournament> Schedules; // 0x140
};

struct UCrossplayConfig_X {
	TArray<FCrossplayGroup> Groups; // 0x78
	TArray<FCrossplayGroup> DisabledCrossplayGroups; // 0x88
};

struct USeqAct_Log {
	uint32_t bOutputToScreen : 1; // 0x160
	uint32_t bIncludeObjComment : 1; // 0x160
	float TargetDuration; // 0x164
	FVector TargetOffset; // 0x168
	FString LogMessage; // 0x178
};

struct AGameInfo_Tutorial_TA {
	uint32_t bAutoEntered : 1; // 0x550
	TArray<FString> TutorialTypes; // 0x558
};

struct UProductAsset_ESportsTeam_TA {
	FName TeamName; // 0xf8
	ObjectProperty TeamLogo; // 0x100
};

struct UGFxData_FirstTimeExperience_TA {
	FName CurrentCheckpoint; // 0x98
	FName CurrentGroup; // 0xa0
	uint32_t bActive : 1; // 0xa8
	ObjectProperty FTEManager; // 0xb0
};

struct URPC_GetShopCatalogue_TA {
	int32_t ShopID; // 0xe8
	TArray<FShopItem> ShopItems; // 0xf0
};

struct UVanitySetManager_TA {
	ObjectProperty OnlineGame; // 0x60
	FMap_Mirror VanityMap; // 0x68
	ComponentProperty VanityQuery; // 0xb8
	DelegateProperty __VanitiesUpdated__Delegate; // 0xc0
};

struct UTcpBeacon {
	FPointer VfTable_FTickableObject; // 0x70
	int32_t MaxConnections; // 0x78
	FString ConnectionClassName; // 0x80
	FNone* ConnectionClass; // 0x90
	FPointer ListenSocket; // 0x98
	TArray<ObjectProperty> Connections; // 0xa0
	DelegateProperty __EventConnected__Delegate; // 0xb0
	DelegateProperty __EventDisconnected__Delegate; // 0xc8
};

struct UBTC_Boost {
	float BoostAmountLessThan; // 0xe8
	float BoostAmountGreaterThan; // 0xec
	uint32_t bFull : 1; // 0xf0
	uint32_t bNotFull : 1; // 0xf0
};

struct ACamera {
	ObjectProperty PCOwner; // 0x268
	FName CameraStyle; // 0x270
	float DefaultFOV; // 0x278
	uint32_t bLockedFOV : 1; // 0x27c
	uint32_t bConstrainAspectRatio : 1; // 0x27c
	uint32_t bEnableFading : 1; // 0x27c
	uint32_t bFadeAudio : 1; // 0x27c
	uint32_t bForceDisableTemporalAA : 1; // 0x27c
	uint32_t bEnableColorScaling : 1; // 0x27c
	uint32_t bEnableColorScaleInterp : 1; // 0x27c
	uint32_t bUseClientSideCameraUpdates : 1; // 0x27c
	uint32_t bDebugClientSideCamera : 1; // 0x27c
	uint32_t bShouldSendClientSideCameraUpdate : 1; // 0x27c
	float LockedFOV; // 0x280
	float ConstrainedAspectRatio; // 0x284
	float DefaultAspectRatio; // 0x288
	float OffAxisYawAngle; // 0x28c
	float OffAxisPitchAngle; // 0x290
	FColor FadeColor; // 0x294
	float FadeAmount; // 0x298
	float CamOverridePostProcessAlpha; // 0x29c
	FPostProcessSettings CamPostProcessSettings; // 0x2a0
	FRenderingPerformanceOverrides RenderingOverrides; // 0x408
	FVector ColorScale; // 0x40c
	FVector DesiredColorScale; // 0x418
	FVector OriginalColorScale; // 0x424
	float ColorScaleInterpDuration; // 0x430
	float ColorScaleInterpStartTime; // 0x434
	FTCameraCache CameraCache; // 0x438
	FTCameraCache LastFrameCameraCache; // 0x458
	FTViewTarget ViewTarget; // 0x478
	FTViewTarget PendingViewTarget; // 0x4b0
	float BlendTimeToGo; // 0x4e8
	FViewTargetTransitionParams BlendParams; // 0x4ec
	TArray<ObjectProperty> ModifierList; // 0x500
	float FreeCamDistance; // 0x510
	FVector FreeCamOffset; // 0x514
	FVector2D FadeAlpha; // 0x520
	float FadeTime; // 0x528
	float FadeTimeRemaining; // 0x52c
	TArray<ObjectProperty> CameraLensEffects; // 0x530
	ObjectProperty CameraShakeCamMod; // 0x540
	FNone* CameraShakeCamModClass; // 0x548
	ObjectProperty AnimInstPool[0x8]; // 0x550
	TArray<ObjectProperty> ActiveAnims; // 0x590
	TArray<ObjectProperty> FreeAnims; // 0x5a0
	ObjectProperty AnimCameraActor; // 0x5b0
};

struct U__OnlineProductStore_TA__FindProductsFromHash_3459AAAF48254857B0B9C9A582F1E895 {
	FProductHashID HashID; // 0x60
};

struct UTourMatchInfoMessage_TA {
	FTourServerSettings TourSettings; // 0x68
	int32_t Playlist; // 0x150
	FString ReservationID; // 0x158
	FString JoinName; // 0x168
	FString JoinPassword; // 0x178
};

struct U__GFxData_ReplayManager_TA__DownloadReplay_C0B8B13048A51F16938FC48988EEDFD7 {
	ObjectProperty Request; // 0x60
};

struct UInterpFilter_Classes {
	FNone* ClassToFilterBy; // 0x70
	TArray<FNone*> TrackClasses; // 0x78
};

struct UPlayerSpawnTicket_TA {
	ObjectProperty Controller; // 0x60
	ObjectProperty PRI; // 0x68
	float SecondsRemaining; // 0x70
};

struct UUserBugReportErrors_TA {
	ObjectProperty ReportTooSoon; // 0x80
};

struct ACarPreviewActor_TA {
	int32_t ControllerId; // 0x268
	ComponentProperty ProductLoader; // 0x270
	ComponentProperty CarMesh; // 0x278
	ComponentProperty LightEnvironment; // 0x280
	ComponentProperty CarMeshSilhouette; // 0x288
	TArray<ComponentProperty> AttachmentPreviewAnims; // 0x290
	TArray<ComponentProperty> WheelAnims; // 0x2a0
	ComponentProperty BodyAnim; // 0x2b0
	ComponentProperty EngineAudioAnim; // 0x2b8
	ComponentProperty EngineAudioAnimInstance; // 0x2c0
	float SupersonicFakeSpeed; // 0x2c8
	ObjectProperty TurntableActor; // 0x2d0
	FLoadoutData Loadout; // 0x2d8
	FLoadoutData OldLoadout; // 0x318
	TArray<ObjectProperty> PreviewProducts; // 0x358
	ObjectProperty BoostFX; // 0x368
	ObjectProperty PreviewSlot; // 0x370
	ObjectProperty TeamArchetype; // 0x378
	FString PlayerName; // 0x380
	ObjectProperty BodyFX; // 0x390
	ObjectProperty BoostAsset; // 0x398
	ObjectProperty SupersonicAsset; // 0x3a0
	uint32_t bLockLoadout : 1; // 0x3a8
	uint32_t bSpinWheelsFromBoost : 1; // 0x3a8
	uint32_t bAddToCarPreviewList : 1; // 0x3a8
	TArray<ObjectProperty> SupersonicFX; // 0x3b0
	ObjectProperty EngineAudioAsset; // 0x3c0
	ObjectProperty EngineAudioPreview; // 0x3c8
	ObjectProperty MusicStingersArchetype; // 0x3d0
	ObjectProperty MusicStingersPreview; // 0x3d8
	int32_t PreviewTeam; // 0x3e0
	int32_t LinkedControllerId; // 0x3e4
	ObjectProperty RootFXActor; // 0x3e8
	ComponentProperty Ak; // 0x3f0
	DelegateProperty __EventInitializeComponents__Delegate; // 0x3f8
	DelegateProperty __ProductApplicatorDelegate__Delegate; // 0x410
	DelegateProperty __EventCarSetupFinished__Delegate; // 0x428
};

struct UMaterialExpression {
	int32_t EditorX; // 0x60
	int32_t EditorY; // 0x64
	int32_t MaterialExpressionEditorX; // 0x68
	int32_t MaterialExpressionEditorY; // 0x6c
	uint32_t bRealtimePreview : 1; // 0x70
	uint32_t bNeedToUpdatePreview : 1; // 0x70
	uint32_t bIsParameterExpression : 1; // 0x70
	uint32_t bShowOutputNameOnPin : 1; // 0x70
	uint32_t bHidePreviewWindow : 1; // 0x70
	uint32_t bShowInputs : 1; // 0x70
	uint32_t bShowOutputs : 1; // 0x70
	uint32_t bUsedByStaticParameterSet : 1; // 0x70
	ObjectProperty Material; // 0x78
	ObjectProperty Function; // 0x80
	FString Desc; // 0x88
	FColor BorderColor; // 0x98
	TArray<FName> MenuCategories; // 0xa0
	TArray<FExpressionOutput> Outputs; // 0xb0
};

struct USeqAct_SetMatInstVectorParam {
	ObjectProperty MatInst; // 0x160
	FName ParamName; // 0x168
	FLinearColor VectorValue; // 0x170
};

struct USaveGameSummary {
	FName BaseLevel; // 0x60
	FString Description; // 0x68
};

struct UPartyMessage_InviteToTradeError_X {
	FName ErrorTypeName; // 0xa8
};

struct UInterpTrackBoostToggle_TA {
	ObjectProperty OverrideBoost; // 0xe0
	TArray<ComponentProperty> AttachedParticleSystems; // 0xe8
	TArray<FName> AttachedSocketNames; // 0xf8
	ObjectProperty CurrentActor; // 0x108
	ObjectProperty CurrentBoostFX; // 0x110
	uint32_t bIsBoostActive : 1; // 0x118
};

struct U__FXActor_Boost_TA__DuplicateAttachment_351C22B843438AF270BCB6A38C9F9A53 {
	TArray<ComponentProperty> ComponentsToUse; // 0x60
	int32_t AttachmentIdx; // 0x70
};

struct UHttpRequestWindows {
	FPointer Request; // 0x78
	FString RequestVerb; // 0x80
	FPointer RequestURL; // 0x90
	TArray<char> Payload; // 0x98
};

struct ULanBeacon_X {
	FPointer VfTable_FTickableObject; // 0x70
	FPointer LanBeacon; // 0x78
	int32_t LanAnnouncePort; // 0x80
	QWordProperty QueryNonce; // 0x88
	ELanBeaconState BeaconState; // 0x90
	ComponentProperty MessageComponent; // 0x98
	int32_t MaxPacketSize; // 0xa0
};

struct AGameEditor_Trigger_TA {
	uint32_t bEnabled : 1; // 0x2b0
	DelegateProperty __OnTriggerTouched__Delegate; // 0x2b8
};

struct URPC_RocketPassGetRewardContent_TA {
	int32_t RocketPassID; // 0xe8
	int32_t TierCap; // 0xec
	TArray<FRocketPassRewardData> FreeRewards; // 0xf0
	TArray<FRocketPassRewardData> PremiumRewards; // 0x100
};

struct U__UserBugReportGeneratedData_TA__Init_6B5BD18D4D62BBDF4160AA9B0734B5E0 {
	DelegateProperty CompleteCallback; // 0x60
};

struct URPC_Challenge_ResetChallengeProgress_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t ChallengeID; // 0x130
};

struct URPC_TourGetPublic_TA {
	FUniqueNetId PlayerID; // 0xe8
	FTourSearchSettings Search; // 0x130
	TArray<FUniqueNetId> TeamMembers; // 0x190
	TArray<ObjectProperty> Tournaments; // 0x1a0
};

struct ABall_Trajectory_TA {
	TArray<FVector> AccurateTrajectoryPoints; // 0xa40
	TArray<FVector> AllPoints; // 0xa50
	float LastCalculateTime; // 0xa60
	float FixedDeltaTime; // 0xa64
	float TotalPathDistance; // 0xa68
	int32_t FrameCount; // 0xa6c
	int32_t TotalStepCount; // 0xa70
	int32_t TotalFrameCount; // 0xa74
	int32_t CurrentStepCount; // 0xa78
	int32_t StepToPutAPointAt; // 0xa7c
	FVector LastLocation; // 0xa80
	FVector LastVelocity; // 0xa8c
	FVector LastAngularVelocity; // 0xa98
	FRotator LastRotation; // 0xaa4
	FTrajectorySetup TrajectorySettings; // 0xab0
	ComponentProperty TrajectoryComponentToUpdate; // 0xac8
};

struct USeqAct_AttachToEvent {
	uint32_t bPreferController : 1; // 0x160
};

struct USeqAct_ApplyCarProducts_TA {
	TArray<ObjectProperty> Assets; // 0x160
	FLinearColor TeamColor; // 0x170
	FLinearColor AccentColor; // 0x180
	ObjectProperty TeamFinish; // 0x190
	ObjectProperty CustomFinish; // 0x198
	ObjectProperty CarPreviewActor; // 0x1a0
};

struct U__TourService_PsyNet_TA__CreateTournament_E8AC64BA4C6C0E1EA987DA8D4A3CECB4 {
	DelegateProperty Callback; // 0x60
};

struct U__TaskGate_X__AddWithTimeout_85F27427482C6CB2E9EF52B7CD817320 {
	ObjectProperty Task; // 0x60
	ObjectProperty TimeoutError; // 0x68
	FString ErrorMessage; // 0x70
	DelegateProperty TimeoutDelegate; // 0x80
};

struct UThumbnailScene_TA {
	TArray<FThumbnailComponent> SceneComponents; // 0x60
	FVector ViewTranslation; // 0x70
	FRotator ViewRotation; // 0x7c
	uint32_t bForceAllUsedMipsResident : 1; // 0x88
	ObjectProperty Background; // 0x90
	FPointer RenderScene; // 0x98
	float CameraFOV; // 0xa0
};

struct UMaterialExpressionDistance {
	FExpressionInput A; // 0xc0
	FExpressionInput B; // 0xf8
};

struct UParticleModuleAttractorLine {
	FVector EndPoint0; // 0x70
	FVector EndPoint1; // 0x7c
	FRawDistributionFloat Range; // 0x88
	FRawDistributionFloat Strength; // 0xb0
};

struct U____ConsecutiveMatchTracker_TA__HandleGameEnded_421FC02848C136E159D07582C6796A30____ConsecutiveMatchTracker_TA__HandleGameEnded_421FC02848C136E159D07582C6796A30_549DD4E14EB3D1D763AD018418EBCE69 {
	FMatchData Player; // 0x60
};

struct UGFxRawData {
	TArray<char> RawData; // 0x60
	TArray<FString> ReferencedSwfs; // 0x70
	TArray<ObjectProperty> References; // 0x80
	TArray<ObjectProperty> UserReferences; // 0x90
};

struct UNotification_AchievementProgress_TA {
	int32_t Id; // 0x110
	ObjectProperty Icon; // 0x118
	float Progress; // 0x120
	float MaxProgress; // 0x124
};

struct UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0x138
	FGuid ExpressionGUID; // 0x140
	FName Group; // 0x150
};

struct USeqAct_AndGate {
	uint32_t bOpen : 1; // 0x160
	TArray<char> LinkedOutputFiredStatus; // 0x168
	TArray<FPointer> LinkedOutputs; // 0x178
};

struct U__ProductsHashSave_TA__UpdateInstanceIDs_9BC316C54FD415462B0F1A90448AE204 {
	TArray<FProductInstanceID> Instances; // 0x60
};

struct UGFxData_ProductLevelUpgrade_TA {
	int32_t ProductLevel; // 0x98
	FProductInstanceID ProductInstanceID; // 0xa0
	TArray<FProductLevelData> Levels; // 0xb0
	ObjectProperty ModalProcessing; // 0xc0
};

struct UGFxData_TourCheckInError_TA {
	ObjectProperty Tournaments; // 0x98
};

struct UActorFactoryApexDestructible {
	uint32_t bStartAwake : 1; // 0xa0
	ERBCollisionChannel RBChannel; // 0xa4
	FRBCollisionChannelContainer CollideWithChannels; // 0xa8
	ObjectProperty DestructibleAsset; // 0xb0
};

struct UParticleModuleRotationRate_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x98
};

struct U__TAsyncResult__array_ClubInvite_X__NotifyOnResultComplete_1907A4654D3979D7D9273CAB89BB5CB4 {
	DelegateProperty Callback; // 0x60
};

struct U__TAsyncResult__Texture2DDynamic__SetResultWhen_0068CFBD4061690806BEE3B1E2985135 {
	DelegateProperty GetResultDelegate; // 0x60
};

struct URBHistory_TA {
	TArray<int32_t> FrameSnapshots; // 0x70
	TArray<char> ServerSnapshots; // 0x80
	TArray<FRBPhysicsSnapshot> RBPhysicsSnapshots; // 0x90
};

struct UProductOverride_StopAttachmentBehaviors_TA {
	TArray<FNone*> BehaviorsToZeroOut; // 0x60
};

struct URandomStream_X {
	FRandomStream_Mirror Stream; // 0x60
	int32_t CurrentSeed; // 0x64
};

struct U__OnlineStorageSyncManager_TA__SyncCloudData_06A2C42B4B87B10B3E77F1B3D997885F {
	ObjectProperty ProductsPlayerGet; // 0x60
};

struct UCameraState_Edit_TA {
	uint32_t bLocalMovement : 1; // 0x98
};

struct UInterpTrackInstFaceFX {
	uint32_t bFirstUpdate : 1; // 0x60
	float LastUpdatePosition; // 0x64
};

struct UGFxData_ReplayManager_TA {
	FString ReplaySaveID; // 0x98
	FString ReplaySaveError; // 0xa8
	TArray<ObjectProperty> ReplayData; // 0xb8
	ObjectProperty ModalProcessing; // 0xc8
	FString PendingSaveName; // 0xd0
};

struct AGFxHUD_Replay_TA {
	ObjectProperty Game; // 0x598
	float PrevKeyframeBufferTime; // 0x5a0
	uint32_t bUserPaused : 1; // 0x5a4
	uint32_t bPausedForEndOfReplay : 1; // 0x5a4
	TArray<ObjectProperty> ReferencedProducts; // 0x5a8
};

struct U__GFxData_TourSearch_TA__FindPrivate_C8C087284B073A5343029B8AB59E2FFC {
	FTourPrivateCredentials Credentials; // 0x60
};

struct UReservationsReadyMessage_X {
	FString ServerAddress; // 0x60
	FString BeaconAddress; // 0x70
	FString PingAddress; // 0x80
	TArray<int32_t> ProductIDs; // 0x90
	ObjectProperty Keys; // 0xa0
	uint32_t bUseNetworkNextDriver : 1; // 0xa8
};

struct URPC_RocketPassPurchaseTiers_TA {
	FUniqueNetId PlayerID; // 0xe8
	TArray<FProductInstanceID> InstanceIDs; // 0x130
	int32_t PurchasableID; // 0x140
	int32_t TierLevel; // 0x144
	TArray<FRocketPassUnlock> Unlocks; // 0x148
	TArray<FCurrency> WalletCurrencies; // 0x158
};

struct UInterpTrackFloatParticleParam {
	FName ParamName; // 0xe8
};

struct UFirstTimeExperienceManager_TA {
	FTEVersioning Versioning; // 0x60
	TArray<FFTEGroup> FTEGroups; // 0x68
	TArray<FFTELevelData> FTELevelInfo; // 0x78
	ObjectProperty FTERedefine; // 0x88
	FFTEGroup CurrentActiveGroup; // 0x90
	int32_t CurrentCheckpointIndex; // 0xd8
	FName CurrentCheckpoint; // 0xdc
	ObjectProperty FTESave; // 0xe8
	ObjectProperty LegacySave; // 0xf0
	TArray<FFTEChallengeInfo> ChallengeCompleteInfo; // 0xf8
	TArray<ObjectProperty> ActiveTriggers; // 0x108
	uint32_t bEnabled : 1; // 0x118
	DelegateProperty __EventFTEChanged__Delegate; // 0x120
	DelegateProperty __EventFTECheckpointCompleted__Delegate; // 0x138
	DelegateProperty __EventFTEGroupCompleted__Delegate; // 0x150
};

struct USeqAct_SetGreenScreen_TA {
	FLinearColor ColorToUse; // 0x160
};

struct UPlaylistSettings_X {
	FString Title; // 0x60
	FString Description; // 0x70
	FString BadgeTitle; // 0x80
	int32_t PlaylistId; // 0x90
	int32_t PlayerCount; // 0x94
	uint32_t bStandard : 1; // 0x98
	uint32_t bRanked : 1; // 0x98
	uint32_t bCheckRankedMatchReservationID : 1; // 0x98
	uint32_t bSolo : 1; // 0x98
	uint32_t bHidden : 1; // 0x98
	uint32_t bExtraMode : 1; // 0x98
	uint32_t bPrivate : 1; // 0x98
	uint32_t bTournament : 1; // 0x98
	uint32_t bApplyQuitPenalty : 1; // 0x98
	uint32_t bAllowForfeit : 1; // 0x98
	uint32_t bDisableRankedReconnect : 1; // 0x98
	uint32_t bIgnoreAssignTeams : 1; // 0x98
	uint32_t bKickOnMigrate : 1; // 0x98
	uint32_t bAllowBotFills : 1; // 0x98
	uint32_t bServerBroadcastCancellations : 1; // 0x98
	uint32_t bSkipGameModeVerification : 1; // 0x98
	uint32_t bIsMicroEventPlaylist : 1; // 0x98
	uint32_t bHasVariablePlayerCount : 1; // 0x98
	uint32_t bNew : 1; // 0x98
	uint32_t bAllowClubs : 1; // 0x98
	uint32_t bAllowStayAsParty : 1; // 0x98
	FString PlaylistImageURL; // 0xa0
	FString PlaylistImageTexture; // 0xb0
	FString PlaylistIconActiveURL; // 0xc0
	FString PlaylistIconInactiveURL; // 0xd0
	ObjectProperty PlaylistTimeWindow; // 0xe0
	TArray<ObjectProperty> PresetMutators; // 0xe8
	FName MapName; // 0xf8
	FString ServerCommand; // 0x100
	FName MapSetName; // 0x110
	TArray<int32_t> PopulationBuckets; // 0x118
};

struct U__CarComponent_Boost_TA__SetUnlimitedBoostDelayed_88F323674A29AEC42D2C7AA89BA4F7B2 {
	uint32_t Enabled : 1; // 0x60
};

struct UMutator_GameEvent_TA {
	ObjectProperty StatFactoryArchetype; // 0x68
	ObjectProperty BotArchetype; // 0x70
	ComponentProperty EndRoundComponentArchetype; // 0x78
};

struct UGameplayEventsWriterBase {
	ObjectProperty Game; // 0x210
};

struct USubscription {
	DelegateProperty __SubscriberCallback__Delegate; // 0x60
};

struct USeqAct_CameraFade {
	FColor FadeColor; // 0x160
	FVector2D FadeAlpha; // 0x164
	float FadeOpacity; // 0x16c
	float FadeTime; // 0x170
	uint32_t bPersistFade : 1; // 0x174
	uint32_t bFadeAudio : 1; // 0x174
	float FadeTimeRemaining; // 0x178
	TArray<ObjectProperty> CachedPCs; // 0x180
};

struct UGFxShell_X {
	ObjectProperty MoviePlayerArchetype; // 0x98
	ObjectProperty Player; // 0xa0
	uint32_t bGamePaused : 1; // 0xa8
	uint32_t bWasFullscreen : 1; // 0xa8
	float LeftX; // 0xac
	float LeftY; // 0xb0
	float RightX; // 0xb4
	float RightY; // 0xb8
	TArray<ObjectProperty> Movies; // 0xc0
	ComponentProperty DataStore; // 0xd0
	EInputPlatformType InputType; // 0xd8
	OnlinePlatform OnlinePlatformType; // 0xd9
	ObjectProperty OnlineSub; // 0xe0
	DelegateProperty __EventInputCaptureChanged__Delegate; // 0xe8
	DelegateProperty __EventInputTypeChanged__Delegate; // 0x100
	DelegateProperty __EventReceivedInput__Delegate; // 0x118
};

struct USeqAct_SetFloat {
	float Target; // 0x160
	TArray<float> Value; // 0x168
};

struct UMaterialExpressionParticleMacroUV {
	uint32_t bUseViewSpace : 1; // 0xc0
};

struct U__TAsyncResult__PsyNetClientService_X__NotifyOnResultComplete_791EAB7D47DD7E6AB8D0CB9B6BA7D1F0 {
	DelegateProperty Callback; // 0x60
};

struct UClubSettings_X {
	FString ClubName; // 0x60
	FString ClubTag; // 0x70
	int32_t PrimaryColor; // 0x80
	int32_t AccentColor; // 0x84
};

struct UInterpTrackAkRTPC {
	FString Param; // 0xe8
};

struct UOnlinePlayerStorage {
	int32_t VersionNumber; // 0x60
	int32_t VersionSettingsId; // 0x64
	int32_t SaveCountSettingId; // 0x68
	TArray<FOnlineProfileSetting> ProfileSettings; // 0x70
	TArray<FSettingsPropertyPropertyMetaData> ProfileMappings; // 0x80
	EOnlinePlayerStorageAsyncState AsyncState; // 0x90
	int32_t DeviceID; // 0x94
};

struct URPC_GetPlayerSkill_X {
	FUniqueNetId PlayerID; // 0xe8
	TArray<FPlayerSkillRating> Skills; // 0x130
	FPlayerSeasonRewardProgress RewardLevels; // 0x140
};

struct UBTC_TargetBase {
	ObjectProperty Target; // 0xe8
	float TargetPredictionTime; // 0xf0
	uint32_t bFlattenToDrivePlane : 1; // 0xf4
	FAIProxyData TargetData; // 0xf8
	FAIProxyData SelfData3D; // 0x140
	FAIProxyData TargetData3D; // 0x188
};

struct UBallIndicator_TA {
	float MinTranslationX; // 0x310
	float MaxTranslationX; // 0x314
	float MinDistance; // 0x318
	float MaxDistance; // 0x31c
	float ZTranslationOffset; // 0x320
	ObjectProperty Ball; // 0x328
};

struct UProfileStatsSave_TA {
	TArray<FStatValue> StatValues; // 0xc8
	TArray<FProductStat> ProductStats; // 0xd8
	DelegateProperty __EventStatValuesChanged__Delegate; // 0xe8
};

struct UGFxData_TeamInfo_TA {
	FString TeamName; // 0x98
	FColor TeamColor; // 0xa8
	int32_t Score; // 0xac
	ObjectProperty TeamLogo; // 0xb0
	int32_t SeriesScore; // 0xb8
	ObjectProperty Team; // 0xc0
	int32_t Difficulty; // 0xc8
};

struct UPartyMessage_TradeCurrencyUpdate_TA {
	FUniqueNetId TradingMemberId; // 0xa8
	FCurrency CurrencyData; // 0xf0
};

struct USeqEvent_Used {
	uint32_t bAimToInteract : 1; // 0x180
	float InteractDistance; // 0x184
	FString InteractText; // 0x188
	ObjectProperty InteractIcon; // 0x198
	TArray<FNone*> ClassProximityTypes; // 0x1a0
	TArray<FNone*> IgnoredClassProximityTypes; // 0x1b0
};

struct UMaterialExpressionFunctionInput {
	FExpressionInput Preview; // 0xc0
	FString InputName; // 0xf8
	FString Description; // 0x108
	FGuid Id; // 0x118
	EFunctionInputType InputType; // 0x128
	FVector4 PreviewValue; // 0x130
	uint32_t bUsePreviewValueAsDefault : 1; // 0x140
	uint32_t bCompilingFunctionPreview : 1; // 0x140
	int32_t SortPriority; // 0x144
};

struct U__ESportConfig_TA__GetNextEventTime_013705DC40AFBBFF91AB5091E82BC011 {
	QWordProperty CurrentTime; // 0x60
};

struct U__GFxData_ProductFilter_TA__SetProhibitedAttributeTypeSelected_56667EDE41CCA57DE30EBE9ACE1E6814 {
	FName Typename; // 0x60
};

struct UAkSoundCue {
	ObjectProperty RequiredBank; // 0x60
	FString StartEvent; // 0x68
	FString StopEvent; // 0x78
};

struct U__GFxData_ProductFilter_TA__GetProductAttributeFilters_AF00CDBE41657221C5E3D5902190B535 {
	EProductFilterType FilterType; // 0x60
};

struct UGFxData_ProductAttribute_Painted_TA {
	FColor ProductPaintColor; // 0xb0
	FString ProductPaintColorName; // 0xb8
	ObjectProperty ProductPaintMask; // 0xc8
	float ProductPaintDiffHue; // 0xd0
	float ProductPaintDiffSaturation; // 0xd4
	float ProductPaintDiffLightness; // 0xd8
};

struct U__GFxData_MTXGarage_TA__HandleUnlockContainersResponse_8AE127A94A5EB239C9C38E81B9249DD2 {
	ObjectProperty PCSaveData; // 0x60
};

struct U__OnlineGameTourServer_TA__GetTeamScore_EB049310499CDA06736BA4844306BA88 {
	int32_t TeamIndex; // 0x60
};

struct UGFxData_RewardDrop_TA {
	ComponentProperty RewardDrops; // 0x98
};

struct UShopAutoLoadHelper_TA {
	int32_t SyncRequestRange; // 0x60
	ComponentProperty AutoLoadDelayer; // 0x68
	ObjectProperty AutoLoadAsyncTask; // 0x70
	TArray<FShopItem> AutoLoadedItems; // 0x78
	ObjectProperty AutoLoadExpirationHelper; // 0x88
	QWordProperty MinEndDateOffset; // 0x90
	QWordProperty MaxEndDateOffset; // 0x98
	QWordProperty RandomEndDateOffset; // 0xa0
};

struct UTournamentCompletedEvent_TA {
	QWordProperty TourID; // 0x60
	QWordProperty ScheduleID; // 0x68
	uint32_t bEliminatedFirstRound : 1; // 0x70
};

struct UGFxData_AdHoc_TA {
	EAdHocState AdHocDesiredState; // 0x98
	EAdHocState AdHocState; // 0x99
};

struct URPC_BanSelf_TA {
	int32_t DurationSeconds; // 0xe8
	FString ReasonID; // 0xf0
	FString BanType; // 0x100
};

struct USeqAct_MultiLevelStreaming {
	TArray<FLevelStreamingNameCombo> Levels; // 0x180
	uint32_t bUnloadAllOtherLevels : 1; // 0x190
	uint32_t bStatusIsOk : 1; // 0x190
};

struct UWebImageCache_X {
	ObjectProperty Decoder; // 0x60
	ComponentProperty Downloads; // 0x68
	DelegateProperty __ImageSyncCallback__Delegate; // 0x70
};

struct UGFxData_LoadoutSets_TA {
	TArray<FGFxLoadoutSet> LoadoutSets; // 0x98
	ObjectProperty Profile; // 0xa8
	FLoadoutData RandomLoadouts[0x2]; // 0xb0
	ComponentProperty RandomLoadoutLoader; // 0x130
	ComponentProperty PreviousLoadoutSetLoader; // 0x138
	ComponentProperty NextLoadoutSetLoader; // 0x140
	ObjectProperty LoadoutSequencer; // 0x148
	ObjectProperty SavedSlot; // 0x150
	int32_t PreviousBodyProductID; // 0x158
	ObjectProperty LoadoutSave; // 0x160
};

struct USeqAct_SetBreakoutBallCharge_TA {
	ObjectProperty BallObj; // 0x160
	int32_t Charge; // 0x168
	int32_t Team; // 0x16c
};

struct UGFxData_SpecialEventStore_TA {
	int32_t EventID; // 0x98
	TArray<FGFxSpecialEventReward> Rewards; // 0xa0
	ComponentProperty SpecialEventsSet; // 0xb0
};

struct URPC_Challenge_ClearNewInfo_TA {
	FUniqueNetId PlayerID; // 0xe8
	TArray<int32_t> ChallengeIDs; // 0x130
};

struct UOnlinePersistentAuthInterfaceEOS {
	ObjectProperty PlayerInterfaceEOS; // 0xb8
};

struct UBTAction_Target {
	ObjectProperty Target; // 0xc0
	float TargetPredictionTime; // 0xc8
	FAIProxyData SelfData; // 0xd0
	FAIProxyData TargetData; // 0x118
};

struct URPC_TourGetBracket_TA {
	FUniqueNetId PlayerID; // 0xe8
	QWordProperty TournamentID; // 0x130
	FTourBracket Bracket; // 0x138
};

struct UProductsArchiveSave_TA {
	TArray<FProductHashID> ArchivedHashIDs; // 0x110
	DelegateProperty __EventProductArchived__Delegate; // 0x120
};

struct UPartyMessage_PlayerTradeComplete_X {
	FUniqueNetId TradingMemberId; // 0xa8
};

struct UFaceIt_TA {
	FFaceItMatchInfo MatchInfo; // 0x60
	FServerReservationData ReservationData; // 0xe0
	ObjectProperty JoinTask; // 0x160
	ObjectProperty Config; // 0x168
	ObjectProperty OnlineGame; // 0x170
	ObjectProperty OnlineGameParty; // 0x178
	ObjectProperty PendingFindMatchTask; // 0x180
	DelegateProperty __EventJoiningReservation__Delegate; // 0x188
	DelegateProperty __EventAddReservation__Delegate; // 0x1a0
	DelegateProperty __EventError__Delegate; // 0x1b8
};

struct UProductAsset_PaintFinish_TA {
	ObjectProperty LightCurveType; // 0xf8
	ObjectProperty DetailNormal; // 0x100
	float SpecularTint; // 0x108
	float RimLightTint; // 0x10c
	float DiffuseDetailNormalStrength; // 0x110
	float SpecularDetailNormalStrength; // 0x114
	float SpecularStrength; // 0x118
	float EnvironmentStrength; // 0x11c
	float SparkleStrength; // 0x120
	float PearlescentStrength; // 0x124
	TArray<FTextureParameterValue> TextureParameterValues; // 0x128
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x138
	TArray<FVectorParameterValue> VectorParameterValues; // 0x148
};

struct USeqAct_SetLoadout_TA {
	TArray<ObjectProperty> Products; // 0x160
	TArray<FProductWithSettings> ProductsWithPaint; // 0x170
	ObjectProperty TeamFinish; // 0x180
	ObjectProperty AccentFinish; // 0x188
	uint32_t bUseInGameColors : 1; // 0x190
	uint32_t bOverwriteCurrent : 1; // 0x190
	uint32_t bUseDefaultLoadout : 1; // 0x190
	uint32_t bApplyToAllCars : 1; // 0x190
	FLinearColor TeamColor; // 0x194
	FLinearColor AccentColor; // 0x1a4
	EForcedTeamOverride ForcedTeamOverride; // 0x1b4
	ObjectProperty BodyPaint; // 0x1b8
	ObjectProperty SkinPaint; // 0x1c0
	ObjectProperty WheelPaint; // 0x1c8
	ObjectProperty BoostPaint; // 0x1d0
	ObjectProperty SSTrailPaint; // 0x1d8
	ObjectProperty AntennaPaint; // 0x1e0
	ObjectProperty HatPaint; // 0x1e8
	ObjectProperty GoalExplosionPaint; // 0x1f0
	ObjectProperty ParentCar; // 0x1f8
};

struct UFractureMaterial {
	ObjectProperty FractureEffect; // 0x60
	ObjectProperty FractureSound; // 0x68
};

struct U__EpicAccountSave_TA__GetLastConvertPlatformFriendsPromptTime_AC4F58324184745134D068AEAAC709E9 {
	ObjectProperty OSS; // 0x60
};

struct ACameraActor {
	uint32_t bConstrainAspectRatio : 1; // 0x268
	uint32_t bCamOverridePostProcess : 1; // 0x268
	float AspectRatio; // 0x26c
	float FOVAngle; // 0x270
	float CamOverridePostProcessAlpha; // 0x274
	FPostProcessSettings CamOverridePostProcess; // 0x278
	ObjectProperty CameraShakeCamMod; // 0x3e0
	ComponentProperty DrawFrustum; // 0x3e8
	ComponentProperty MeshComp; // 0x3f0
};

struct U__Eula_TA__RequiresAcceptance_2E46658348FD4C7EA79B149E75CC9054 {
	OnlinePlatform PlayerPlatform; // 0x60
};

struct UInputBufferGraph_TA {
	ComponentProperty Buffer; // 0x90
	ComponentProperty BufferTarget; // 0x98
	ComponentProperty OverUnderFrames; // 0xa0
	ComponentProperty PhysicsRate; // 0xa8
	float MaxPhysicsRate; // 0xb0
	float MinPhysicsRate; // 0xb4
};

struct U____OnlineGameParty_X__UpdatePartyInfo_C23118C24288BA0C011DACA7DBB77E2A____OnlineGameParty_X__UpdatePartyInfo_C23118C24288BA0C011DACA7DBB77E2A_DC26386843623A559A260EA6A70BD2D1 {
	FPartyMember PM; // 0x60
};

struct UMaterialExpressionConstantClamp {
	FExpressionInput Input; // 0xc0
	float Min; // 0xf8
	float Max; // 0xfc
};

struct UMutator_RespawnTime_TA {
	int32_t RespawnTime; // 0x68
	uint32_t bDisableGoalDelay : 1; // 0x6c
	float BallRespawnTime; // 0x70
};

struct ATraceableSpawnPoint_TA {
	ComponentProperty CylinderComp; // 0x268
};

struct UStaticMeshComponent_TA {
	uint32_t bIgnoreScriptAttach : 1; // 0x308
};

struct UPhysicalMaterialProperty_TA {
	FName AkSwitchValue; // 0x60
	uint32_t bStickyWheels : 1; // 0x68
	uint32_t bConsiderForGround : 1; // 0x68
	float GroundToleranceZ; // 0x6c
};

struct U__GFxData_Friends_TA__CreateEpicFriendInviteNotification_70A077554BD6EAD5B9AD219C8CA00652 {
	ObjectProperty InPersona; // 0x60
	uint32_t bSuppressPopup : 1; // 0x68
};

struct U__ShopsService_Local_TA__GetAllShops_A764326E41C3D4038ADCB29DF5BFD1C7 {
	DelegateProperty Callback; // 0x60
	TArray<FShopData> Shops; // 0x78
};

struct U__MapSet_TA__GetMap_8847BDF242AF9B8D6F88D19B626D5850 {
	FName MapName; // 0x60
};

struct UGarageArchiveSlot_TA {
	ObjectProperty ArchiveSave; // 0x60
};

struct UMaterialFunction {
	FGuid StateId; // 0x60
	ObjectProperty ParentFunction; // 0x70
	FString Description; // 0x78
	uint32_t bExposeToLibrary : 1; // 0x88
	uint32_t bReentrantFlag : 1; // 0x88
	TArray<FString> LibraryCategories; // 0x90
	TArray<ObjectProperty> FunctionExpressions; // 0xa0
	TArray<ObjectProperty> FunctionEditorComments; // 0xb0
};

struct UTAsyncResult__PsyTagCheckResult_X {
	ObjectProperty Result; // 0xd0
	DelegateProperty __EventResult__Delegate; // 0xd8
	DelegateProperty __EventResultComplete__Delegate; // 0xf0
	DelegateProperty __ResultDelegate__Delegate; // 0x108
};

struct URPC_AddPlayerToRole_X {
	int32_t RoleID; // 0xe8
};

struct U__SaveData_TA__GetOnlineProductQuantity_3BCF2D9041011E91F5EBF49F41428453 {
	TArray<FProductInstanceID> EquippedOnlineProducts; // 0x60
	TArray<FProfileProduct> EquippedProfileProducts; // 0x70
};

struct UPsyNetWordFilter_X {
	ObjectProperty Config; // 0x70
	ObjectProperty PendingFilterRPC; // 0x78
};

struct UAnimNodeSeries_X {
	uint32_t bActive : 1; // 0x190
	uint32_t bInitialized : 1; // 0x190
	ObjectProperty IntroAnim; // 0x198
	ObjectProperty OutroAnim; // 0x1a0
};

struct UMaterialInterface {
	FRenderCommandFence_Mirror ParentRefFence; // 0x60
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x64
	FString PreviewMesh; // 0x80
	FGuid LightingGuid; // 0x90
	uint32_t bHasQualitySwitch : 1; // 0xa0
	uint32_t bHasHandheldQualityConnection : 1; // 0xa0
	uint32_t bStoredHandheldQuality : 1; // 0xa0
	uint32_t bAutoFlattenMobile : 1; // 0xa0
	uint32_t bAutoFlattenMobileNormalTexture : 1; // 0xa0
	uint32_t bMobileAllowFog : 1; // 0xa0
	uint32_t bGenerateSubUV : 1; // 0xa0
	uint32_t bUseMobileSpecular : 1; // 0xa0
	uint32_t bUseMobileVertexSpecular : 1; // 0xa0
	uint32_t bUseMobilePixelSpecular : 1; // 0xa0
	uint32_t bUseMobileBumpOffset : 1; // 0xa0
	uint32_t bLockColorBlending : 1; // 0xa0
	uint32_t bUseMobileUniformColorMultiply : 1; // 0xa0
	uint32_t bUseMobileVertexColorMultiply : 1; // 0xa0
	uint32_t bUseMobileDetailNormal : 1; // 0xa0
	uint32_t bBaseTextureTransformed : 1; // 0xa0
	uint32_t bEmissiveTextureTransformed : 1; // 0xa0
	uint32_t bNormalTextureTransformed : 1; // 0xa0
	uint32_t bMaskTextureTransformed : 1; // 0xa0
	uint32_t bDetailTextureTransformed : 1; // 0xa0
	uint32_t bUseMobileWaveVertexMovement : 1; // 0xa0
	uint32_t bMobileEnableBounceLight : 1; // 0xa0
	uint32_t bUseMobileLandscapeMonochromeLayerBlending : 1; // 0xa0
	uint32_t bHandheldDisableDiffuse : 1; // 0xa0
	uint32_t bHandheldDisableDiffusePower : 1; // 0xa0
	uint32_t bHandheldDisableEmissive : 1; // 0xa0
	uint32_t bHandheldDisableSpecular : 1; // 0xa0
	uint32_t bHandheldDisableSpecualrPower : 1; // 0xa0
	uint32_t bHandheldDisableOpacity : 1; // 0xa0
	uint32_t bHandheldDisableOpacityMasks : 1; // 0xa0
	uint32_t bHandheldDisableDistortion : 1; // 0xa0
	uint32_t bHandheldDisableTransmissionMask : 1; // 0xa0
	uint32_t bHandheldDisableTransmissionColor : 1; // 0xa4
	uint32_t bHandheldDisableNormal : 1; // 0xa4
	uint32_t bHandheldDisableCustomLighting : 1; // 0xa4
	uint32_t bHandheldDisableAnisotropicDirection : 1; // 0xa4
	uint32_t bHandheldDisableWorldPositionOffset : 1; // 0xa4
	uint32_t bHandheldDisableWorldDisplacement : 1; // 0xa4
	uint32_t bHandheldDisableTessellationMultiplier : 1; // 0xa4
	uint32_t bHandheldDisableSubsurfaceInscatteringColor : 1; // 0xa4
	uint32_t bHandheldDisableSubsurfaceAbsorptionColor : 1; // 0xa4
	uint32_t bHandheldDisableSubsurfaceScatteringRadius : 1; // 0xa4
	FColor FlattenBackgroundColor; // 0xa8
	ObjectProperty MobileBaseTexture; // 0xb0
	ObjectProperty FlattenedTexture; // 0xb8
	EMobileTexCoordsSource MobileBaseTextureTexCoordsSource; // 0xc0
	EMobileAmbientOcclusionSource MobileAmbientOcclusionSource; // 0xc1
	EMobileSpecularMask MobileSpecularMask; // 0xc2
	EMobileEmissiveColorSource MobileEmissiveColorSource; // 0xc3
	EMobileValueSource MobileEmissiveMaskSource; // 0xc4
	EMobileValueSource MobileEnvironmentMaskSource; // 0xc5
	EMobileEnvironmentBlendMode MobileEnvironmentBlendMode; // 0xc6
	EMobileValueSource MobileRimLightingMaskSource; // 0xc7
	EMobileTexCoordsSource MobileMaskTextureTexCoordsSource; // 0xc8
	EMobileAlphaValueSource MobileAlphaValueSource; // 0xc9
	EMobileTexCoordsSource MobileDetailTextureTexCoordsSource; // 0xca
	EMobileTextureBlendFactorSource MobileTextureBlendFactorSource; // 0xcb
	EMobileColorMultiplySource MobileColorMultiplySource; // 0xcc
	ObjectProperty MobileNormalTexture; // 0xd0
	float SubUVFrameRate; // 0xd8
	int32_t SubUVFrameCountAlongAxes; // 0xdc
	float SubUVFrameSize; // 0xe0
	FLinearColor MobileSpecularColor; // 0xe4
	float MobileSpecularPower; // 0xf4
	ObjectProperty MobileEmissiveTexture; // 0xf8
	FLinearColor MobileEmissiveColor; // 0x100
	ObjectProperty MobileEnvironmentTexture; // 0x110
	float MobileEnvironmentAmount; // 0x118
	FLinearColor MobileEnvironmentColor; // 0x11c
	float MobileEnvironmentFresnelAmount; // 0x12c
	float MobileEnvironmentFresnelExponent; // 0x130
	float MobileRimLightingStrength; // 0x134
	float MobileRimLightingExponent; // 0x138
	FLinearColor MobileRimLightingColor; // 0x13c
	float MobileBumpOffsetReferencePlane; // 0x14c
	float MobileBumpOffsetHeightRatio; // 0x150
	ObjectProperty MobileMaskTexture; // 0x158
	float MobileOpacityMultiplier; // 0x160
	ObjectProperty MobileDetailTexture; // 0x168
	ObjectProperty MobileDetailTexture2; // 0x170
	ObjectProperty MobileDetailTexture3; // 0x178
	FLinearColor DefaultUniformColor; // 0x180
	FLinearColor MobileDefaultUniformColor; // 0x190
	float TransformCenterX; // 0x1a0
	float MobileTransformCenterX; // 0x1a4
	float TransformCenterY; // 0x1a8
	float MobileTransformCenterY; // 0x1ac
	float PannerSpeedX; // 0x1b0
	float MobilePannerSpeedX; // 0x1b4
	float PannerSpeedY; // 0x1b8
	float MobilePannerSpeedY; // 0x1bc
	float RotateSpeed; // 0x1c0
	float MobileRotateSpeed; // 0x1c4
	float FixedScaleX; // 0x1c8
	float MobileFixedScaleX; // 0x1cc
	float FixedScaleY; // 0x1d0
	float MobileFixedScaleY; // 0x1d4
	float SineScaleX; // 0x1d8
	float MobileSineScaleX; // 0x1dc
	float SineScaleY; // 0x1e0
	float MobileSineScaleY; // 0x1e4
	float SineScaleFrequencyMultipler; // 0x1e8
	float MobileSineScaleFrequencyMultipler; // 0x1ec
	float FixedOffsetX; // 0x1f0
	float MobileFixedOffsetX; // 0x1f4
	float FixedOffsetY; // 0x1f8
	float MobileFixedOffsetY; // 0x1fc
	float MobileTangentVertexFrequencyMultiplier; // 0x200
	float MobileVerticalFrequencyMultiplier; // 0x204
	float MobileMaxVertexMovementAmplitude; // 0x208
	float MobileSwayFrequencyMultiplier; // 0x20c
	float MobileSwayMaxAngle; // 0x210
	FVector MobileDirectionalLightDirection; // 0x214
	float MobileDirectionalLightBrightness; // 0x220
	FColor MobileDirectionalLightColor; // 0x224
	FVector MobileBounceLightDirection; // 0x228
	float MobileBounceLightBrightness; // 0x234
	FColor MobileBounceLightColor; // 0x238
	float MobileSkyLightBrightness; // 0x23c
	FColor MobileSkyLightColor; // 0x240
	FName MobileLandscapeLayerNames[0x4]; // 0x244
	FColor MobileLandscapeMonochomeLayerColors[0x4]; // 0x264
};

struct ANxGenericForceFieldBrush {
	int32_t ExcludeChannel; // 0x2a8
	FRBCollisionChannelContainer CollideWithChannels; // 0x2ac
	ERBCollisionChannel RBChannel; // 0x2b0
	FFB_ForceFieldCoordinates Coordinates; // 0x2b1
	FVector Constant; // 0x2b4
	FVector PositionMultiplierX; // 0x2c0
	FVector PositionMultiplierY; // 0x2cc
	FVector PositionMultiplierZ; // 0x2d8
	FVector PositionTarget; // 0x2e4
	FVector VelocityMultiplierX; // 0x2f0
	FVector VelocityMultiplierY; // 0x2fc
	FVector VelocityMultiplierZ; // 0x308
	FVector VelocityTarget; // 0x314
	FVector Noise; // 0x320
	FVector FalloffLinear; // 0x32c
	FVector FalloffQuadratic; // 0x338
	float TorusRadius; // 0x344
	FPointer ForceField; // 0x348
	TArray<FPointer> ConvexMeshes; // 0x350
	TArray<FPointer> ExclusionShapes; // 0x360
	TArray<FPointer> ExclusionShapePoses; // 0x370
	FPointer LinearKernel; // 0x380
};

struct UPsyNetStaticData_X {
	FString PsyConfigTemplateURL; // 0x70
	float LocalCacheTimeoutSeconds; // 0x80
	float SyncDataTimeoutSeconds; // 0x84
	ObjectProperty PsyNet; // 0x88
	ObjectProperty OnlineSub; // 0x90
	ObjectProperty WebConfig; // 0x98
	uint32_t bDebug : 1; // 0xa0
	uint32_t bLoaded : 1; // 0xa0
	uint32_t bBlockingSync : 1; // 0xa0
	ComponentProperty CacheTimer; // 0xa8
	ComponentProperty WebData; // 0xb0
	TArray<ObjectProperty> DefaultObjects; // 0xb8
	TArray<ObjectProperty> DownloadedObjects; // 0xc8
	TArray<ObjectProperty> RegisteredObjects; // 0xd8
	ComponentProperty SyncDataStopwatch; // 0xe8
	FString PsyConfigQueryParams; // 0xf0
	FString PsyConfigSecret; // 0x100
	FString PsyConfigAltEnv; // 0x110
	DelegateProperty __EventLoaded__Delegate; // 0x120
};

struct UWordFilterConfig_X {
	uint32_t bSanitizeEntirePhrase : 1; // 0x78
	uint32_t PsyNetFilterEnabled : 1; // 0x78
	int32_t NameHistoryCacheLength; // 0x7c
	TArray<EWordFilterUsage> IgnoreFilterList; // 0x80
	TArray<EWordFilterUsage> PlatformFilterList; // 0x90
	float PsyNetWordFilterBatchDelay; // 0xa0
	int32_t PsyNetWordFilterBatchMaxSize; // 0xa4
};

struct ADynamicPylon {
	uint32_t bMoving : 1; // 0x4a8
};

struct UFracturedStaticMesh {
	ObjectProperty SourceCoreMesh; // 0x200
	float CoreMeshScale; // 0x208
	uint32_t bSliceUsingCoreCollision : 1; // 0x23c
	ObjectProperty FragmentDestroyEffect; // 0x240
	TArray<ObjectProperty> FragmentDestroyEffects; // 0x248
	float FragmentDestroyEffectScale; // 0x258
	float FragmentHealthScale; // 0x25c
	float FragmentMinHealth; // 0x260
	float FragmentMaxHealth; // 0x264
	uint32_t bUniformFragmentHealth : 1; // 0x268
	float ChunkLinVel; // 0x26c
	float ChunkAngVel; // 0x270
	float ChunkLinHorizontalScale; // 0x274
	float ExplosionVelScale; // 0x278
	uint32_t bCompositeChunksExplodeOnImpact : 1; // 0x27c
	uint32_t bFixIsolatedChunks : 1; // 0x280
	uint32_t bAlwaysBreakOffIsolatedIslands : 1; // 0x284
	uint32_t bSpawnPhysicsChunks : 1; // 0x288
	float ChanceOfPhysicsChunk; // 0x28c
	float ExplosionChanceOfPhysicsChunk; // 0x290
	float NormalPhysicsChunkScaleMin; // 0x294
	float NormalPhysicsChunkScaleMax; // 0x298
	float ExplosionPhysicsChunkScaleMin; // 0x29c
	float ExplosionPhysicsChunkScaleMax; // 0x2a0
	float MinConnectionSupportArea; // 0x2a4
	ObjectProperty DynamicOutsideMaterial; // 0x2a8
	ObjectProperty LoseChunkOutsideMaterial; // 0x2b0
	int32_t OutsideMaterialIndex; // 0x2b8
};

struct UParticleModuleTrailSource {
	ETrail2SourceMethod SourceMethod; // 0x70
	EParticleSourceSelectionMethod SelectionMethod; // 0x71
	FName SourceName; // 0x74
	FRawDistributionFloat SourceStrength; // 0x80
	uint32_t bLockSourceStength : 1; // 0xa8
	uint32_t bInheritRotation : 1; // 0xa8
	int32_t SourceOffsetCount; // 0xac
	TArray<FVector> SourceOffsetDefaults; // 0xb0
};

struct USoundNodeWave {
	int32_t CompressionQuality; // 0x78
	uint32_t bForceRealTimeDecompression : 1; // 0x7c
	uint32_t bLoopingSound : 1; // 0x7c
	uint32_t bDynamicResource : 1; // 0x7c
	uint32_t bUseTTS : 1; // 0x7c
	uint32_t bProcedural : 1; // 0x7c
	uint32_t bMature : 1; // 0x7c
	uint32_t bManualWordWrap : 1; // 0x7c
	uint32_t bSingleLine : 1; // 0x7c
	ETTSSpeaker TTSSpeaker; // 0x80
	EDecompressionType DecompressionType; // 0x81
	EDetailMode MobileDetailMode; // 0x82
	FString SpokenText; // 0x88
	float Volume; // 0x98
	float Pitch; // 0x9c
	float Duration; // 0xa0
	int32_t NumChannels; // 0xa4
	int32_t SampleRate; // 0xa8
	TArray<int32_t> ChannelOffsets; // 0xb0
	TArray<int32_t> ChannelSizes; // 0xc0
	FUntypedBulkData_Mirror RawData; // 0xd0
	FPointer VorbisDecompressor; // 0x128
	FPointer RawPCMData; // 0x130
	int32_t RawPCMDataSize; // 0x138
	FUntypedBulkData_Mirror CompressedPCData; // 0x140
	FUntypedBulkData_Mirror CompressedXbox360Data; // 0x198
	FUntypedBulkData_Mirror CompressedDingoData; // 0x1f0
	FUntypedBulkData_Mirror CompressedPS3Data; // 0x248
	FUntypedBulkData_Mirror CompressedWiiUData; // 0x2a0
	FUntypedBulkData_Mirror CompressedIPhoneData; // 0x2f8
	FUntypedBulkData_Mirror CompressedFlashData; // 0x350
	FUntypedBulkData_Mirror CompressedPS4Data; // 0x3a8
	FUntypedBulkData_Mirror CompressedNNXData; // 0x400
	int32_t ResourceID; // 0x458
	int32_t ResourceSize; // 0x45c
	FPointer ResourceData; // 0x460
	TArray<FSubtitleCue> Subtitles; // 0x468
	FString Comment; // 0x478
	TArray<FLocalizedSubtitle> LocalizedSubtitles; // 0x488
	FString SourceFilePath; // 0x498
	FString SourceFileTimestamp; // 0x4a8
};

struct UGFxData_PlayerVanity_TA {
	ObjectProperty VanityMgr; // 0x98
	ObjectProperty GFxPlayerAvatarBorder; // 0xa0
	ObjectProperty GFxPlayerBanner; // 0xa8
};

struct UGameSettingPlaylist_X {
	FString Title; // 0x68
	FString Description; // 0x78
	FString BadgeTitle; // 0x88
	int32_t PlayerCount; // 0x98
	uint32_t bStandard : 1; // 0x9c
	uint32_t bRanked : 1; // 0x9c
	uint32_t bSolo : 1; // 0x9c
	uint32_t bExtraMode : 1; // 0x9c
	uint32_t bPrivate : 1; // 0x9c
	uint32_t bTournament : 1; // 0x9c
	uint32_t bApplyQuitPenalty : 1; // 0x9c
	uint32_t bAllowForfeit : 1; // 0x9c
	uint32_t bDisableRankedReconnect : 1; // 0x9c
	uint32_t bIgnoreAssignTeams : 1; // 0x9c
	uint32_t bAllowBotFills : 1; // 0x9c
	uint32_t bKickOnMigrate : 1; // 0x9c
	uint32_t bCheckRankedMatchReservationID : 1; // 0x9c
	uint32_t bServerBroadcastCancellations : 1; // 0x9c
	uint32_t bSkipGameModeVerification : 1; // 0x9c
	uint32_t bIsMicroEventPlaylist : 1; // 0x9c
	uint32_t bHasVariablePlayerCount : 1; // 0x9c
	uint32_t bNew : 1; // 0x9c
	uint32_t bAllowClubs : 1; // 0x9c
	uint32_t bAllowStayAsParty : 1; // 0x9c
	FString PlaylistImageURL; // 0xa0
	FString PlaylistImageTexture; // 0xb0
	FString PlaylistIconActiveURL; // 0xc0
	FString PlaylistIconInactiveURL; // 0xd0
	int32_t PlaylistId; // 0xe0
	ObjectProperty PlaylistTimeWindow; // 0xe8
	TArray<ObjectProperty> PresetMutators; // 0xf0
	FName MapName; // 0x100
	FString ServerCommand; // 0x108
	FName MapSetName; // 0x118
	TArray<int32_t> PopulationBuckets; // 0x120
};

struct UChallengeManager_TA {
	TArray<ObjectProperty> Challenges; // 0x60
	TArray<int32_t> ChallengeProgressSyncIDs; // 0x70
	TArray<int32_t> ClearNewInfoChallengeIDQueue; // 0x80
	TArray<ObjectProperty> RemovedChallenges; // 0x90
	TArray<int32_t> PendingNewChallengeIDs; // 0xa0
	TArray<int32_t> PendingRemovedChallengeIDs; // 0xb0
	FString NewChallengesTitle; // 0xc0
	FString NewChallengesDesc; // 0xd0
	FString ExpiredChallengesTitle; // 0xe0
	FString ExpiredChallengesDesc; // 0xf0
	FString MixedChallengesDesc; // 0x100
	DelegateProperty __EventChallengeAdded__Delegate; // 0x110
	DelegateProperty __EventChallengeCompleted__Delegate; // 0x128
	DelegateProperty __EventChallengeRewardCollected__Delegate; // 0x140
	DelegateProperty __EventChallengeProgressChanged__Delegate; // 0x158
};

struct UEventRecorderConfig_X {
	uint32_t bEnabled : 1; // 0x78
	uint32_t bSeparatePlayerIDs : 1; // 0x78
	uint32_t bExcludePlayerIDs : 1; // 0x78
	TArray<FName> DisabledEvents; // 0x80
	FNone* EventRecorderClass; // 0x90
	float PlayerNetMetricsPeriod; // 0x98
	int32_t MaxUnstableConnections; // 0x9c
	int32_t UnstableConnectionsTimePeriodSeconds; // 0xa0
};

struct USkyLightVolumeComponent_TA {
	float BlendDistance; // 0x1d0
	ObjectProperty LightToOverride; // 0x1d8
	ComponentProperty BrushComponent; // 0x1e0
	FMatrix CachedParentToWorld; // 0x1f0
};

struct UGFxData_Stats_TA {
	TArray<FGFxStatData> Events; // 0x98
	TArray<ObjectProperty> StatEvents; // 0xa8
};

struct U__EpicFriendsPlugin_X__RemoveFriend_A356D65E46619E4AF702EC991E84E824 {
	FUniqueNetId FriendId; // 0x60
};

struct UAntiAddiction_TA {
	int32_t Hours; // 0x60
};

struct UExclusiveInteraction_TA {
	TArray<int32_t> ControllersWithExclusiveInputEnabled; // 0xd0
};

struct UDSR_DSMessage_X {
	FString PlayerID; // 0x90
	FString ReservationID; // 0xa0
	FString MessageType; // 0xb0
	FString MessagePayload; // 0xc0
};

struct UParticleModuleLocationEmitter {
	FName EmitterName; // 0x70
	ELocationEmitterSelectionMethod SelectionMethod; // 0x78
	uint32_t InheritSourceVelocity : 1; // 0x7c
	uint32_t bInheritSourceRotation : 1; // 0x7c
	float InheritSourceVelocityScale; // 0x80
	float InheritSourceRotationScale; // 0x84
};

struct UGFxAction_SetVariable {
	ObjectProperty Movie; // 0x160
	FString Variable; // 0x168
};

struct UMaterialExpressionCeil {
	FExpressionInput Input; // 0xc0
};

struct ULightComponent {
	FPointer SceneInfo; // 0xa0
	FMatrix WorldToLight; // 0xb0
	FMatrix LightToWorld; // 0xf0
	FGuid LightGuid; // 0x130
	FGuid LightmapGuid; // 0x140
	float Brightness; // 0x150
	FColor LightColor; // 0x154
	ObjectProperty Function; // 0x158
	uint32_t bEnabled : 1; // 0x160
	uint32_t CastShadows : 1; // 0x160
	uint32_t CastStaticShadows : 1; // 0x160
	uint32_t CastDynamicShadows : 1; // 0x160
	uint32_t bCastCompositeShadow : 1; // 0x160
	uint32_t bAffectCompositeShadowDirection : 1; // 0x160
	uint32_t bNonModulatedSelfShadowing : 1; // 0x160
	uint32_t bSelfShadowOnly : 1; // 0x160
	uint32_t bAllowPreShadow : 1; // 0x160
	uint32_t bForceDynamicLight : 1; // 0x160
	uint32_t UseDirectLightMap : 1; // 0x160
	uint32_t bHasLightEverBeenBuiltIntoLightMap : 1; // 0x160
	uint32_t bCanAffectDynamicPrimitivesOutsideDynamicChannel : 1; // 0x160
	uint32_t bRenderLightShafts : 1; // 0x160
	uint32_t bUseImageReflectionSpecular : 1; // 0x160
	uint32_t bPrecomputedLightingIsValid : 1; // 0x160
	uint32_t bExplicitlyAssignedLight : 1; // 0x160
	uint32_t bAllowCompositingIntoDLE : 1; // 0x160
	ComponentProperty LightEnvironment; // 0x168
	FLightingChannelContainer LightingChannels; // 0x170
	ELightAffectsClassification LightAffectsClassification; // 0x174
	ELightShadowMode LightShadowMode; // 0x175
	FLinearColor ModShadowColor; // 0x178
	float ModShadowFadeoutTime; // 0x188
	float ModShadowFadeoutExponent; // 0x18c
	int32_t LightListIndex; // 0x190
	EShadowProjectionTechnique ShadowProjectionTechnique; // 0x194
	EShadowFilterQuality ShadowFilterQuality; // 0x195
	int32_t MinShadowResolution; // 0x198
	int32_t MaxShadowResolution; // 0x19c
	int32_t ShadowFadeResolution; // 0x1a0
	float OcclusionDepthRange; // 0x1a4
	float BloomScale; // 0x1a8
	float BloomThreshold; // 0x1ac
	float BloomScreenBlendThreshold; // 0x1b0
	FColor BloomTint; // 0x1b4
	float RadialBlurPercent; // 0x1b8
	float OcclusionMaskDarkness; // 0x1bc
	float ReflectionSpecularBrightness; // 0x1c0
};

struct UParticleModuleUberRainSplashB {
	FRawDistributionFloat LifeTime; // 0x80
	FRawDistributionVector StartSize; // 0xa8
	FRawDistributionVector ColorOverLife; // 0xd0
	FRawDistributionFloat AlphaOverLife; // 0xf8
	FRawDistributionVector LifeMultiplier; // 0x120
	uint32_t MultiplyX : 1; // 0x148
	uint32_t MultiplyY : 1; // 0x148
	uint32_t MultiplyZ : 1; // 0x148
	FRawDistributionFloat StartRotationRate; // 0x150
};

struct U__GFxData_TourPlatforms_TA__InitPlatformGroups_AF61504245EF7F3B368A7081D50C29B5 {
	OnlinePlatform PlayerPlatform; // 0x60
};

struct USeqAct_ForceFeedback {
	ObjectProperty FFWaveform; // 0x160
	FNone* PredefinedWaveForm; // 0x168
};

struct UDataAsset_ESportsTeam_TA {
	int32_t TeamID; // 0x60
	ObjectProperty ESportsTeamReference; // 0x68
};

struct UProductAttribute_Indestructible_TA {
	uint32_t bIndestructible : 1; // 0x80
};

struct UFaceItErrors_TA {
	ObjectProperty MatchHasBeenCancelled; // 0x80
	ObjectProperty CannotJoinCrossPlatformMatch; // 0x88
	ObjectProperty CannotJoinWhileInParty; // 0x90
	ObjectProperty CannotJoinWhilePlayingSplitscreen; // 0x98
	ObjectProperty CannotJoinWhileOnline; // 0xa0
	ObjectProperty ReturnToMainMenuToJoin; // 0xa8
	ObjectProperty JoinGameFailed; // 0xb0
	ObjectProperty NoFaceItMatchFound; // 0xb8
	ObjectProperty FaceItGameServerPending; // 0xc0
	ObjectProperty ExternalMatchServerNotFound; // 0xc8
	ObjectProperty ReservationSentToIncorrectPlayer; // 0xd0
};

struct UOnlineRecentPlayersList {
	TArray<FUniqueNetId> RecentPlayers; // 0x60
	TArray<FFriendHistoryKey> RecentPlayerKeys; // 0x70
	TArray<FRecentParty> RecentParties; // 0x80
	FRecentParty LastParty; // 0x90
	int32_t MaxRecentPlayers; // 0xe8
	int32_t MaxRecentParties; // 0xec
	int32_t RecentPlayersAddIndex; // 0xf0
	int32_t RecentPartiesAddIndex; // 0xf4
	TArray<FCurrentPlayerMet> CurrentPlayers; // 0xf8
};

struct U__ShopsService_Local_TA__GetCrateShop_6DCE6FE24570168A20D7AAB1186B9E27 {
	DelegateProperty Callback; // 0x60
	TArray<FShopItem> Items; // 0x78
};

struct UOnlineNewsInterfaceMcp {
	TArray<FNewsCacheEntry> NewsItems; // 0x80
	TArray<DelegateProperty> ReadNewsDelegates; // 0x90
	uint32_t bNeedsTicking : 1; // 0xa0
	DelegateProperty __OnReadNewsCompleted__Delegate; // 0xa8
};

struct UPsyNetConnection_X {
	ObjectProperty PsyNet; // 0x60
	ObjectProperty OnlineSub; // 0x68
	ObjectProperty Config; // 0x70
	ObjectProperty RetryConfig; // 0x78
	ObjectProperty URL; // 0x80
	ComponentProperty Headers; // 0x88
	ObjectProperty RequestQue; // 0x90
	ComponentProperty RPCQueue; // 0x98
	ObjectProperty ServiceProvider; // 0xa0
	ObjectProperty HttpMessenger; // 0xa8
	ObjectProperty PerConMessenger; // 0xb0
	ObjectProperty PerCon; // 0xb8
	ComponentProperty PerConMetrics; // 0xc0
	uint32_t bAuthorized : 1; // 0xc8
	uint32_t bConnected : 1; // 0xc8
	uint32_t bFreshConnection : 1; // 0xc8
	uint32_t bPerConConnected : 1; // 0xc8
	float ConnectedChangeTime; // 0xcc
	ObjectProperty DisabledError; // 0xd0
	TArray<ObjectProperty> DisabledErrorStack; // 0xd8
	ObjectProperty MaintenanceError; // 0xe8
	ObjectProperty DuplicateLoginError; // 0xf0
	ObjectProperty NoInternetError; // 0xf8
	ObjectProperty NoUrlError; // 0x100
	ObjectProperty AuthDisabledError; // 0x108
	TArray<float> AuthRetryDelays; // 0x110
	int32_t ConsecutiveAuthFailures; // 0x120
	DelegateProperty __EventConnected__Delegate; // 0x128
	DelegateProperty __EventDisconnected__Delegate; // 0x140
	DelegateProperty __EventConnectFailed__Delegate; // 0x158
	DelegateProperty __EventPerConConnected__Delegate; // 0x170
	DelegateProperty __EventPerConDisconnected__Delegate; // 0x188
	DelegateProperty __EventEnabled__Delegate; // 0x1a0
	DelegateProperty __EventDisabled__Delegate; // 0x1b8
};

struct UProductAttribute_Quality_TA {
	EProductQuality Quality; // 0x80
};

struct URPC_MicroTransactions_GetCatalog_TA {
	FUniqueNetId PlayerID; // 0xe8
	FName Category; // 0x130
	TArray<FMTCatalogInfo> MTXProducts; // 0x138
	FString Currency; // 0x148
};

struct USeqAct_SetString {
	FString Target; // 0x160
	FString Value; // 0x170
};

struct U__AdHocInterface_X__EnableAdHoc_9BD138A7426F4D25669E2DB8EA4B7FE1 {
	ObjectProperty Task; // 0x60
	DelegateProperty InitDelegate; // 0x68
};

struct UGFxData_PersonaGroup_TA {
	FString GroupTitle; // 0x98
	int32_t GroupId; // 0xa8
	uint32_t bPsyNetGroup : 1; // 0xac
	EPersonaInfoOrigin GroupOrigin; // 0xb0
};

struct UNavMeshGoal_Random {
	int32_t MinDist; // 0x80
	float BestRating; // 0x84
	FPointer PartialGoal; // 0x88
};

struct UGFxData_RedeemCodes_TA {
	ObjectProperty RedeemTask; // 0x98
	FString RedeemingTitleString; // 0xa0
	FString RedeemingBodyString; // 0xb0
};

struct U__ShopsService_Local_TA__GetShopCatalogue_44A4BEE8481B339340E0E0ACA506ADFB {
	DelegateProperty Callback; // 0x60
	TArray<FShopItem> Items; // 0x78
};

struct UShopMetrics_TA {
	TArray<FShopTabData> CurrentShopTabMetrics; // 0x80
	int32_t CurrentBrowseSourceID; // 0x90
};

struct U__StayAsPartySystem_TA__HandlePartyChanged_AADC73F343AFA00AEAC842A54D74238C {
	ObjectProperty PartyEvent; // 0x60
};

struct UNetConnection {
	TArray<ObjectProperty> Children; // 0xb1a8
	uint32_t bUseSessionUID : 1; // 0xb1d4
	float BadConnectionPingThreshold; // 0xb1e0
	float BadConnectionReceiveTimeThreshold; // 0xb1e4
};

struct UActorFactoryArchetype {
	ObjectProperty ArchetypeActor; // 0xa0
};

struct UAnimNode {
	uint32_t bRelevant : 1; // 0x90
	uint32_t bJustBecameRelevant : 1; // 0x90
	uint32_t bTickDuringPausedAnims : 1; // 0x90
	uint32_t bEditorOnly : 1; // 0x90
	uint32_t bDisableCaching : 1; // 0x90
	uint32_t bCallScriptEventOnInit : 1; // 0x90
	uint32_t bCallScriptEventOnBecomeRelevant : 1; // 0x90
	uint32_t bCallScriptEventOnCeaseRelevant : 1; // 0x90
	int32_t NodeTickTag; // 0x94
	int32_t NodeInitTag; // 0x98
	int32_t NodeEndEventTick; // 0x9c
	int32_t TickArrayIndex; // 0xa0
	int32_t NodeCachedAtomsTag; // 0xa4
	float NodeTotalWeight; // 0xa8
	TArray<ObjectProperty> ParentNodes; // 0xb0
	FName NodeName; // 0xc0
	TArray<FBoneAtom> CachedBoneAtoms; // 0xc8
	char CachedNumDesiredBones; // 0xd8
	FBoneAtom CachedRootMotionDelta; // 0xe0
	int32_t bCachedHasRootMotion; // 0x100
	TArray<FCurveKey> CachedCurveKeys; // 0x108
	int32_t SearchTag; // 0x118
	TArray<FCurveKey> LastUpdatedAnimMorphKeys; // 0x120
};

struct UPath_TowardPoint {
	FVector GoalPoint; // 0x70
};

struct UObjectProvider {
	FPointer VfTable_FObjectDestructionSubscriber; // 0x70
	TArray<ObjectProperty> MyObjects; // 0x78
	FMap_Mirror ObjectRefs; // 0x88
	TArray<ObjectProperty> TreeObjects; // 0xd8
	TArray<FObjectProviderSubscription> SubscribedToAdds; // 0xe8
	TArray<FObjectProviderSubscription> SubscribedToRemoves; // 0xf8
	TArray<FObjectProviderSubscription> SubscribedToLists; // 0x108
	FArray_Mirror Injections; // 0x118
	FArray_Mirror InterfaceInjections; // 0x128
	TArray<FNone*> PendingInjectionClasses; // 0x138
	TArray<FObjectProviderPendingCallback> PendingCallbacks; // 0x148
	char bTriggeringCallbacks; // 0x158
	ComponentProperty Parent; // 0x160
	TArray<ComponentProperty> Children; // 0x168
	TArray<ComponentProperty> Proxies; // 0x178
	TArray<FObjectProviderPendingCallback> PendingInjectionCallbacks; // 0x188
	DelegateProperty __ObjectSubscriptionCallback__Delegate; // 0x198
	DelegateProperty __ObjectListSubscriptionCallback__Delegate; // 0x1b0
	DelegateProperty __ObjectChangeCallback__Delegate; // 0x1c8
};

struct USoundNodeConcatenator {
	TArray<float> InputVolume; // 0x78
};

struct UTAsyncResult__array_LanServerRecord_X {
	TArray<ObjectProperty> Result; // 0xd0
	DelegateProperty __EventResult__Delegate; // 0xe0
	DelegateProperty __EventResultComplete__Delegate; // 0xf8
	DelegateProperty __ResultDelegate__Delegate; // 0x110
};

struct URimSpinner_TA {
	float AccelRate; // 0x78
	float DecelRate; // 0x7c
	float MaxSpeed; // 0x80
	FName BoneControlName; // 0x84
	float SpinScale; // 0x8c
	int32_t WheelIndex; // 0x90
	float CurrentSpeed; // 0x94
	int32_t CurrentRotation; // 0x98
	ComponentProperty SkelMeshComponent; // 0xa0
	ObjectProperty SpinBoneController; // 0xa8
	ObjectProperty WheelBoneController; // 0xb0
	ComponentProperty Wheel; // 0xb8
	uint32_t bIsMainMenu : 1; // 0xc0
};

struct UTerrainMaterial {
	FMatrix LocalToMapping; // 0x60
	ETerrainMappingType MappingType; // 0xa0
	float MappingScale; // 0xa4
	float MappingRotation; // 0xa8
	float MappingPanU; // 0xac
	float MappingPanV; // 0xb0
	ObjectProperty Material; // 0xb8
	ObjectProperty DisplacementMap; // 0xc0
	float DisplacementScale; // 0xc8
};

struct UStatEvent_TA {
	int32_t Points; // 0x60
	float CooldownSeconds; // 0x64
	uint32_t bAddToScore : 1; // 0x68
	uint32_t bIsLeaderboardStat : 1; // 0x68
	uint32_t bNotifyTicker : 1; // 0x68
	uint32_t bShowOnHUD : 1; // 0x68
	uint32_t bPrimaryStat : 1; // 0x68
	uint32_t bSkipReplication : 1; // 0x68
	uint32_t bCanMute : 1; // 0x68
	uint32_t bCountMultiplied : 1; // 0x68
	ObjectProperty Group; // 0x70
	ObjectProperty Texture; // 0x78
	FName UISound; // 0x80
	FNone* DisplayProductStatClass; // 0x88
	FString Label; // 0x90
	FString PluralLabel; // 0xa0
	FString Description; // 0xb0
};

struct UGFxData_Mutators_TA {
	FName SelectedMapName; // 0x98
	int32_t SelectedGameMode; // 0xa0
	int32_t SelectedBotDifficulty; // 0xa4
	TArray<FGameModeData> GameModes; // 0xa8
	TArray<FCustomGameSetting> CustomGameSettings; // 0xb8
	TArray<ObjectProperty> GameSettingCategories; // 0xc8
	int32_t PresetCategoryIndex; // 0xd8
	TArray<FModeMapPair> ModeMaps; // 0xe0
	ECustomMatchSettingsType SettingsType; // 0xf0
	ObjectProperty Profile; // 0xf8
	ObjectProperty GameModeObj; // 0x100
	ObjectProperty GameTags; // 0x108
};

struct URegionPingMessage_X {
	uint32_t bIsResponse : 1; // 0x60
};

struct USeqAct_SetMesh {
	ObjectProperty NewSkeletalMesh; // 0x160
	ObjectProperty NewStaticMesh; // 0x168
	EMeshType MeshType; // 0x170
	uint32_t bIsAllowedToMove : 1; // 0x174
	uint32_t bAllowDecalsToReattach : 1; // 0x174
};

struct UGFxData_TourCheckIn_TA {
	ObjectProperty Tournaments; // 0x98
	FString TeamName; // 0xa0
	FCustomMatchTeamSettings TeamSettings; // 0xb0
	ObjectProperty SaveData; // 0xd0
	FString TournamentJoinTitle; // 0xd8
	FString MatchmakingCancelledOnCheckIn; // 0xe8
};

struct URPC_TestPlayerID_X {
	FUniqueNetId PlayerID; // 0xe8
	FUniqueNetId ResponsePlayerID; // 0x130
};

struct UInterpTrackHeadTracking {
	TArray<FHeadTrackingKey> HeadTrackingTrack; // 0xc8
	TArray<FName> TrackControllerName; // 0xd8
	float LookAtActorRadius; // 0xe8
	uint32_t bDisableBeyondLimit : 1; // 0xec
	uint32_t bLookAtPawns : 1; // 0xec
	float MaxLookAtTime; // 0xf0
	float MinLookAtTime; // 0xf4
	float MaxInterestTime; // 0xf8
	TArray<FNone*> ActorClassesToLookAt; // 0x100
	TArray<FName> TargetBoneNames; // 0x110
};

struct UOSSConfig_X {
	uint32_t bEnablePresence : 1; // 0x78
};

struct ULanMessage_HostQuery_X {
	FCustomMatchSettings Filter; // 0x68
	int32_t BuildID; // 0xf8
	uint32_t bHost : 1; // 0xfc
};

struct UOnlinePlayerStorageQueue_X {
	ObjectProperty Config; // 0x60
	TArray<FPendingStorage> QueuedObjects; // 0x68
	TArray<FPendingStorage> PendingObjects; // 0x78
	float DefaultStorageMaxSizeBytes; // 0x88
	TArray<FStorageMaxSize> StorageMaxSizes; // 0x90
	DelegateProperty __EventStorageSuccess__Delegate; // 0xa0
	DelegateProperty __EventOutOfSync__Delegate; // 0xb8
	DelegateProperty __EventStorageError__Delegate; // 0xd0
};

struct UDistributionVectorUniformRange {
	FVector MaxHigh; // 0x80
	FVector MaxLow; // 0x8c
	FVector MinHigh; // 0x98
	FVector MinLow; // 0xa4
};

struct UStatusTrigger_X {
	uint32_t bTriggered : 1; // 0x60
	DelegateProperty EventPropertyChange; // 0x68
};

struct U__OnlineProduct_TA__RemoveAttributes_F59789804B4D646A4749D7998FA68F2E {
	FNone* AttributeClass; // 0x60
};

struct USeqAct_ReinitPhys_TA {
	ObjectProperty RBObj; // 0x160
};

struct ULevelStreamingAlwaysLoaded {
	uint32_t bIsProceduralBuildingLODLevel : 1; // 0x118
};

struct URPC_RecordMatchResults_X {
	FString MatchGUID; // 0xe8
	FSkillMatchData Match; // 0xf8
	FString MatchName; // 0x118
	TArray<FSkillMatchPlayer> Winners; // 0x128
	TArray<FSkillMatchPlayer> Losers; // 0x138
	FGuid AppSessionID; // 0x148
	FGuid LevelSessionID; // 0x158
	uint32_t bIsBotMatch : 1; // 0x168
};

struct U__CarMeshComponentBase_TA__CreateWheelAttachment_AB96541F483D0D5F64FB2AAEF3F8E940 {
	ObjectProperty Asset; // 0x60
	ComponentProperty PrimComp; // 0x68
};

struct U__OnlineGameParty_TA__IsProductValidAfterVerify_CC7F162743F333DEE8191C882E0CAD87 {
	FOnlineProductData OPD; // 0x60
};

struct UCodecMovie {
	float PlaybackDuration; // 0x60
};

struct UPBRuleNodeTransform {
	ComponentProperty Translation; // 0x98
	ComponentProperty Rotation; // 0xa0
	ComponentProperty Scale; // 0xa8
};

struct UClientXPSave_TA {
	int32_t TotalXP; // 0xc8
	int32_t Level; // 0xcc
	int32_t CurrentLevelXPThreshold; // 0xd0
	int32_t NextLevelXPThreshold; // 0xd4
	DelegateProperty __EventXPUpdated__Delegate; // 0xd8
	DelegateProperty __EventLevelUpdated__Delegate; // 0xf0
};

struct UEngineAudioRevSimGearManager_TA {
	int32_t RealGear; // 0x70
	int32_t FakeGear; // 0x74
	uint32_t bPendingSilentDownShift : 1; // 0x78
	float TimeRemaining; // 0x7c
	float SilentDownShiftDelay; // 0x80
};

struct UGFxData_TourSubscription_TA {
	ObjectProperty TourSettings; // 0x98
	ComponentProperty TourList; // 0xa0
	int32_t Difficulty; // 0xa8
	int32_t Placement; // 0xac
};

struct UPsyNetService_FaceItMatchComplete_TA {
	int32_t MatchID; // 0x90
};

struct UContentSave_TA {
	ObjectProperty Config; // 0xc8
	TArray<FContentPair> ContentMap2; // 0xd0
};

struct UBeamTraceComponent_TA {
	TArray<ComponentProperty> BeamSystems; // 0xa8
	float TraceDistance; // 0xb8
	float MinRetraceRate; // 0xbc
	float MaxRetraceRate; // 0xc0
	TArray<FBeamTraceProps> Beams; // 0xc8
	ObjectProperty FXOwner; // 0xd8
};

struct USeqAct_PlayFaceFXAnim {
	ObjectProperty FaceFXAnimSetRef; // 0x160
	FString FaceFXGroupName; // 0x168
	FString FaceFXAnimName; // 0x178
	ObjectProperty SoundCueToPlay; // 0x188
	ObjectProperty AkEventToPlay; // 0x190
};

struct AAmbientSound {
	uint32_t bAutoPlay : 1; // 0x270
	uint32_t bIsPlaying : 1; // 0x270
	ComponentProperty AudioComponent; // 0x278
};

struct AGameInfo_X {
	ObjectProperty GameReplicationInfoArchetype; // 0x470
	ObjectProperty PlayerControllerArchetype; // 0x478
	ObjectProperty PawnArchetype; // 0x480
	TArray<FPauserData> PCPausers; // 0x488
	DelegateProperty __EventSpawned__Delegate; // 0x498
	DelegateProperty __EventInit__Delegate; // 0x4b0
};

struct UOnlineClubServerList_X {
	TArray<ObjectProperty> Servers; // 0x60
	ObjectProperty RPC; // 0x70
	ObjectProperty Error; // 0x78
};

struct UBallTrajectoryComponent_Mesh_TA {
	TArray<FMeshInfo> InterpMeshes; // 0x110
	ObjectProperty MIC; // 0x120
	ObjectProperty StaticMesh; // 0x128
	FColor BeamColor_Max; // 0x130
	FColor BeamColor_Mid; // 0x134
	FColor BeamColor_Min; // 0x138
	float MinInterpSpeed; // 0x13c
	float MeshScale; // 0x140
	float MeshMoveSpeed; // 0x144
	float MeshRotateSpeed; // 0x148
	float TrajectoryPlayTestScale; // 0x14c
};

struct U__CarPreviewActor_TA__UpdateTranslations_5CE1B6FC493B033868BCFA9BE417A53E {
	ObjectProperty BodyAsset; // 0x60
};

struct UGFxData_Playlist_TA {
	ObjectProperty Playlist; // 0x98
	int32_t Id; // 0xa0
	FString KeyName; // 0xa8
	FString FriendlyName; // 0xb8
	FString Description; // 0xc8
	FString BadgeTitle; // 0xd8
	int32_t TeamSize; // 0xe8
	uint32_t bStandardMatch : 1; // 0xec
	uint32_t bRanked : 1; // 0xec
	uint32_t bSolo : 1; // 0xec
	uint32_t bSelected : 1; // 0xec
	uint32_t bEnabled : 1; // 0xec
	uint32_t bRestricted : 1; // 0xec
	uint32_t bNew : 1; // 0xec
	uint32_t bIsMicroEventPlaylist : 1; // 0xec
	uint32_t bTournament : 1; // 0xec
	uint32_t bCompletedPlacementMatches : 1; // 0xec
	uint32_t bPlaylistAllowsStayAsParty : 1; // 0xec
	uint32_t bUndersizedPartyWithRankDisparity : 1; // 0xec
	uint32_t bIsTimeRestricted : 1; // 0xec
	ObjectProperty PlaylistBackgroundTexture; // 0xf0
	ObjectProperty PlaylistIconActiveTexture; // 0xf8
	ObjectProperty PlaylistIconInactiveTexture; // 0x100
	EPlaylistPopulationBucket PlayerCountBucket; // 0x108
	int32_t SkillTier; // 0x10c
	int32_t SkillDivision; // 0x110
	int32_t SkillMatchesPlayed; // 0x114
	int32_t SkillPlacementMatchesPlayed; // 0x118
	float SkillMMR; // 0x11c
	int32_t PrevSkillTier; // 0x120
	int32_t PrevSkillDivision; // 0x124
	int32_t XPLevelUnlocked; // 0x128
	int32_t MaximumRankDisparity; // 0x12c
	QWordProperty StartTime; // 0x130
	QWordProperty EndTime; // 0x138
	ObjectProperty MicroEventConfig; // 0x140
};

struct UPath_WithinTraversalDist {
	float MaxTraversalDist; // 0x70
	uint32_t bSoft : 1; // 0x74
	float SoftStartPenalty; // 0x78
};

struct UBlogTile_X {
	FString Title; // 0x60
	FString DescriptionHeader; // 0x70
	FString Description; // 0x80
	FString WebURL; // 0x90
	FString CarName; // 0xa0
	FString ImageURL; // 0xb0
	FString StartTime; // 0xc0
	QWordProperty StartTimeEpoch; // 0xd0
	FString EndTime; // 0xd8
	QWordProperty EndTimeEpoch; // 0xe8
	ELinkType LinkType; // 0xf0
	int32_t ShopID; // 0xf4
	int32_t ShopItemID; // 0xf8
	int32_t ProductID; // 0xfc
	int32_t CategoryID; // 0x100
	int32_t PlaylistId; // 0x104
	FString InfoURL; // 0x108
};

struct USwfMovie {
	uint32_t bUsesFontlib : 1; // 0xa0
	uint32_t bSetSRGBOnImportedTextures : 1; // 0xa0
	uint32_t bPackTextures : 1; // 0xa0
	uint32_t bForceSquarePacking : 1; // 0xa0
	FString SourceFile; // 0xa8
	int32_t PackTextureSize; // 0xb8
	FlashTextureRescale TextureRescale; // 0xbc
	FString TextureFormat; // 0xc0
	FString SourceFileTimestamp; // 0xd0
	int32_t SourceFileCRC; // 0xe0
	TArray<EEdition> Editions; // 0xe8
	TArray<FName> Features; // 0xf8
	int32_t RTTextures; // 0x108
	int32_t RTVideoTextures; // 0x10c
	QWordProperty ImportTimeStamp; // 0x110
};

struct UClubErrors_X {
	ObjectProperty ClubNotFound; // 0x80
	ObjectProperty PlayerAlreadyInClub; // 0x88
	ObjectProperty PlayerInSameClub; // 0x90
	ObjectProperty PlayerInDifferentClub; // 0x98
	ObjectProperty NotClubOwner; // 0xa0
	ObjectProperty ClubNameChangeNotAllowed; // 0xa8
	ObjectProperty ClubFull; // 0xb0
	ObjectProperty ClubMemberNotFound; // 0xb8
	ObjectProperty ClubInviteNotFound; // 0xc0
	ObjectProperty ClubInvalidParameters; // 0xc8
	ObjectProperty ClubNameInvalid; // 0xd0
	ObjectProperty ClubTagInvalid; // 0xd8
	ObjectProperty ClubTagPlusNameInvalid; // 0xe0
	ObjectProperty ClubMotdInvalid; // 0xe8
	ObjectProperty ClubNameTaken; // 0xf0
	ObjectProperty ClubOwnerCannotLeaveUnlessEmpty; // 0xf8
	ObjectProperty CrossPlatformClubsDisabled; // 0x100
	ObjectProperty ClubInviteCrossPlatformClubsDisabled; // 0x108
	ObjectProperty ClubBanned; // 0x110
};

struct UGameSettingPlaylist_TA {
	int32_t XPLevelUnlocked; // 0x130
	TArray<FMapSkillSettings> MapSkillRequirements; // 0x138
	FNone* TourServerInfoClass; // 0x148
	uint32_t bAllowHonorDuelChallenges : 1; // 0x150
	TArray<FTeamColor> TeamColors; // 0x158
	FColorOverride BallSuperSonicColor; // 0x168
};

struct ULoadoutRenderer_TA {
	ObjectProperty ThumbnailRenderer; // 0x60
	ComponentProperty Loader; // 0x68
	ObjectProperty TeamArchetype; // 0x70
	DelegateProperty __EventLoadoutRendered__Delegate; // 0x78
};

struct URPC_BuildBlueprint_TA {
	FUniqueNetId PlayerID; // 0xe8
	FProductInstanceID InstanceID; // 0x130
	int32_t ExpectedPrice; // 0x140
	FOnlineProductData ProductData; // 0x148
	TArray<FCurrency> WalletCurrencies; // 0x188
};

struct USeqAct_SetMotionBlurParams {
	float MotionBlurAmount; // 0x178
	float InterpolateSeconds; // 0x17c
	float InterpolateElapsed; // 0x180
	float OldMotionBlurAmount; // 0x184
};

struct ANxCylindricalForceField {
	float RadialStrength; // 0x2c0
	float RotationalStrength; // 0x2c4
	float LiftStrength; // 0x2c8
	float ForceRadius; // 0x2cc
	float ForceTopRadius; // 0x2d0
	float LiftFalloffHeight; // 0x2d4
	float EscapeVelocity; // 0x2d8
	float ForceHeight; // 0x2dc
	float HeightOffset; // 0x2e0
	uint32_t UseSpecialRadialForce : 1; // 0x2e4
	FPointer Kernel; // 0x2e8
};

struct UActorComponent {
	TArray<ObjectProperty> LocalViewers; // 0x70
	char BulletSceneGroup; // 0x80
	FPointer Scene; // 0x88
	ObjectProperty Owner; // 0x90
	uint32_t bAttached : 1; // 0x98
	uint32_t bTickInEditor : 1; // 0x98
	uint32_t bNeedsReattach : 1; // 0x98
	uint32_t bNeedsUpdateTransform : 1; // 0x98
	ETickingGroup TickGroup; // 0x9c
};

struct UParticleModuleAccelerationBase {
	uint32_t bAlwaysInWorldSpace : 1; // 0x70
};

struct USeqAct_GetDistance {
	float Distance; // 0x160
};

struct UTerrainLayerSetup {
	TArray<FTerrainFilteredMaterial> Materials; // 0x60
};

struct UOnlinePlaylistManager {
	FPointer VfTable_FTickableObject; // 0x60
	TArray<FPlaylist> Playlists; // 0x68
	TArray<FString> PlaylistFileNames; // 0x78
	TArray<FName> DatastoresToRefresh; // 0x88
	int32_t DownloadCount; // 0x98
	int32_t SuccessfulCount; // 0x9c
	int32_t VersionNumber; // 0xa0
	TArray<FPlaylistPopulation> PopulationData; // 0xa8
	int32_t WorldwideTotalPlayers; // 0xb8
	int32_t RegionTotalPlayers; // 0xbc
	TScriptInterface<Class> TitleFileInterface; // 0xc0
	FString PopulationFileName; // 0xd0
	float NextPlaylistPopulationUpdateTime; // 0xe0
	float PlaylistPopulationUpdateInterval; // 0xe4
	int32_t MinPlaylistIdToReport; // 0xe8
	int32_t CurrentPlaylistId; // 0xec
	FName EventsInterfaceName; // 0xf0
	int32_t DataCenterId; // 0xf8
	FString DataCenterFileName; // 0x100
	float LastPlaylistDownloadTime; // 0x110
	float PlaylistRefreshInterval; // 0x114
	DelegateProperty __OnReadPlaylistComplete__Delegate; // 0x118
	DelegateProperty __OnPlaylistPopulationDataUpdated__Delegate; // 0x130
};

struct UExplosionHitHandler_X {
	float StartTime; // 0xa8
	float EndTime; // 0xac
	ComponentProperty CollisionInformation; // 0xb0
	uint32_t bIgnoreInstigator : 1; // 0xb8
	uint32_t bPassThroughWorldGeometry : 1; // 0xb8
	uint32_t bOnlyApplyImpulseOnce : 1; // 0xb8
	uint32_t bDebug : 1; // 0xb8
	uint32_t bPullTowardHitLocation : 1; // 0xb8
	float Falloff; // 0xbc
	float RBVelocityChange; // 0xc0
	float Speed; // 0xc4
	FVector MomentumOffset; // 0xc8
	FBox GoalWorldBox; // 0xd4
	float LifeTime; // 0xf0
};

struct UTAsyncResult__array_ClubInvite_X {
	TArray<ObjectProperty> Result; // 0xd0
	DelegateProperty __EventResult__Delegate; // 0xe0
	DelegateProperty __EventResultComplete__Delegate; // 0xf8
	DelegateProperty __ResultDelegate__Delegate; // 0x110
};

struct UMcpUserInventoryBase {
	FString McpUserInventoryClassName; // 0x78
	DelegateProperty __OnCreateSaveSlotComplete__Delegate; // 0x88
	DelegateProperty __OnDeleteSaveSlotComplete__Delegate; // 0xa0
	DelegateProperty __OnQuerySaveSlotListComplete__Delegate; // 0xb8
	DelegateProperty __OnQueryInventoryItemsComplete__Delegate; // 0xd0
	DelegateProperty __OnPurchaseItemComplete__Delegate; // 0xe8
	DelegateProperty __OnSellItemComplete__Delegate; // 0x100
	DelegateProperty __OnEarnItemComplete__Delegate; // 0x118
	DelegateProperty __OnConsumeItemComplete__Delegate; // 0x130
	DelegateProperty __OnDeleteItemComplete__Delegate; // 0x148
	DelegateProperty __OnRecordIapComplete__Delegate; // 0x160
};

struct UArenaReflectionsManager_TA {
	ObjectProperty SoccarGame; // 0x60
	TArray<FSlapbackActorSetup> SlapbackSetups; // 0x68
	TArray<FSlapbackActorSetup> ArenaReverbSetups; // 0x78
	TArray<ObjectProperty> SlapBackActors; // 0x88
	TArray<ObjectProperty> ArenaReverbEmitters; // 0x98
	FName ImpactIntensityKey; // 0xa8
	FName SlapbackDistanceKey; // 0xb0
	FName ReverbBalanceKey; // 0xb8
	float BallListenerOffset; // 0xc0
};

struct UDataAssetDatabase_TA {
	FNone* DataAssetClass; // 0x60
	TArray<ObjectProperty> DataAssets; // 0x68
	FMap_Mirror NameToId; // 0x78
	uint32_t bClickToRebuild : 1; // 0xc8
};

struct UPlayerTitleConfig_X {
	TArray<FPlayerTitleCategory> Categories; // 0x78
	TArray<FPlayerTitleData> Titles; // 0x88
	FString DefaultColorHexCode; // 0x98
};

struct UProfile_TA {
	int32_t LocalId; // 0x60
	FString ProfileName; // 0x68
	ObjectProperty SaveData; // 0x78
	int32_t ControllerId; // 0x80
	uint32_t bMetric : 1; // 0x84
	uint32_t bMuteStatEvents : 1; // 0x84
	uint32_t bDisableDivisions : 1; // 0x84
	uint32_t bAlternateNameplates : 1; // 0x84
	uint32_t bAlwaysShowNameplates : 1; // 0x84
	uint32_t bPushToTalk : 1; // 0x84
	uint32_t bUseBallIndicator : 1; // 0x84
	uint32_t bUseBallCamIndicator : 1; // 0x84
	uint32_t bInvertSwivelPitch : 1; // 0x84
	uint32_t bInvertSpectatorPitch : 1; // 0x84
	uint32_t bPrefersSecondaryCamera : 1; // 0x84
	uint32_t bToggleSecondaryCamera : 1; // 0x84
	uint32_t bToggleRearCamera : 1; // 0x84
	uint32_t bFreecam : 1; // 0x84
	uint32_t bLockSpecatorBallCam : 1; // 0x84
	uint32_t bEnableCameraShake : 1; // 0x84
	uint32_t bEnableHorizontalSplitscreen : 1; // 0x84
	uint32_t bDisableCrossPlay : 1; // 0x84
	uint32_t bAimAssistEnabled : 1; // 0x84
	uint32_t bBallTrajectoryEnabled : 1; // 0x84
	uint32_t bShouldRandomizeLoadoutEachGame : 1; // 0x84
	TArray<FUISavedKeyValue> UISavedValues; // 0x88
	TArray<FPlaylistMapPrefs> MapPrefs; // 0x98
	ObjectProperty Tutorial; // 0xa8
	EForceFeedbackType ForceFeedbackType; // 0xb0
	EMatchmakingViewTab MatchmakingViewTab; // 0xb1
	ECameraSettingsPreset CameraSettingsPreset; // 0xb2
	FName ControlsPresetName; // 0xb4
	TArray<FPlayerBinding> PCBindings; // 0xc0
	float MouseSensitivity; // 0xd0
	float MouseXDeadZone; // 0xd4
	float MouseYDeadZone; // 0xd8
	float MouseXDeadZoneAir; // 0xdc
	float MouseYDeadZoneAir; // 0xe0
	float KeyboardAxisBlendTime; // 0xe4
	TArray<FName> QuickMatchPlaylists; // 0xe8
	TArray<FString> QuickMatchRegions; // 0xf8
	FProfileCameraSettings Camera; // 0x108
	FProfileAutoCamSettings AutoCam; // 0x124
	TArray<FName> QuickChatBindings; // 0x150
	int32_t TotalXP; // 0x160
	FName PlayerTitle; // 0x164
	int32_t PreviewTeamIndex; // 0x16c
	TArray<ObjectProperty> LoadoutSets; // 0x170
	ObjectProperty EquippedLoadoutSet; // 0x180
	FTourSearchSettings TourSearchSettings; // 0x188
	FTourCreateSettings TourCreateSettings; // 0x1e8
	TArray<ObjectProperty> Seasons; // 0x220
	TArray<FPlayerBinding> GamepadBindings; // 0x230
	float ControllerDeadzone; // 0x240
	float DodgeInputThreshold; // 0x244
	float SteeringSensitivity; // 0x248
	float AirControlSensitivity; // 0x24c
	ObjectProperty PlayerBannerData; // 0x250
	ObjectProperty Loadout; // 0x258
	FCustomMatchSettings PrivateMatchSettings; // 0x260
	FCustomMatchSettings SplitscreenMatchSettings; // 0x2f0
	FCustomMatchSettings ServerBrowserSettings; // 0x380
	FCustomMatchSettings CustomMatchSettings; // 0x410
	TArray<FKeyValuePair> CustomMatchGameTags; // 0x4a0
	FString CustomMatchRegion; // 0x4b0
	TArray<ObjectProperty> GameTags; // 0x4c0
	TArray<FStatValue> StatValues; // 0x4d0
	TArray<FProductStat> ProductStats; // 0x4e0
	int32_t AimAssistLevelOverride; // 0x4f0
	int32_t MaxAimAssistLevelOverride; // 0x4f4
	FString BugReportEmail; // 0x4f8
	int32_t ProfileVersion; // 0x508
	int32_t EditLoadoutSetIndex; // 0x50c
	ComponentProperty SaveObjectProvider; // 0x510
	TArray<ObjectProperty> SaveObjects; // 0x518
	ObjectProperty LoadoutSave; // 0x528
	DelegateProperty __EventPreEquipProductToLoadouts__Delegate; // 0x530
	DelegateProperty __EventActiveBindingsChanged__Delegate; // 0x548
	DelegateProperty __EventProfileProductChanged__Delegate; // 0x560
};

struct AGameEvent_Lobby_TA {
	ObjectProperty BallArchetype; // 0x720
	ObjectProperty Ball; // 0x728
};

struct UOnlineDLCProductCache_TA {
	TArray<ObjectProperty> GeneratedProducts; // 0x60
	TArray<FNone*> AllowedAttributes; // 0x70
	TArray<ObjectProperty> PreviousGeneratedProducts; // 0x80
	DelegateProperty __EventDLCChange__Delegate; // 0x90
};

struct UOnlineGameLanServer_TA {
	TArray<ObjectProperty> AllRelevantProducts; // 0x260
};

struct UGFxShell_TA {
	float BugReportDelay; // 0x130
	ObjectProperty ChampionshipTrophyArchetype; // 0x138
	ObjectProperty TAPlayer; // 0x140
	ObjectProperty SystemData; // 0x148
	ObjectProperty LocalPlayerData; // 0x150
	FString BugReportEmail; // 0x158
	uint32_t bEnableFocusDebugger : 1; // 0x168
	uint32_t bDisableStartupMovies : 1; // 0x168
	uint32_t bAllowOnlineStorageResyncModal : 1; // 0x168
	ObjectProperty CurrentBugReport; // 0x170
	FString EOSReconnectMessage; // 0x178
	FString EOSNotConnectedMessage; // 0x188
	FString SaveReplayMessage; // 0x198
	FString BugReportWaitMessage; // 0x1a8
	FString DefaultDisconnectionTitle; // 0x1b8
	FString PsyNetReconnectMessage; // 0x1c8
	FString PSPlusTipTitle; // 0x1d8
	FString PSPlusTipMessage; // 0x1e8
	FString RankedReconnectTitle; // 0x1f8
	FString RankedReconnectBody; // 0x208
	FString BannedTimeRemainingMessage; // 0x218
	FString PermaBannedMessage; // 0x228
	TArray<ObjectProperty> ActiveModals; // 0x238
	EProgressMessageType PendingMessageType; // 0x248
	FString PendingErrorTitle; // 0x250
	FString PendingErrorMessage; // 0x260
	float LastPsyNetReconnectTime; // 0x270
	ObjectProperty ModalKick; // 0x278
	FString BuildEdition; // 0x280
	DelegateProperty __EventBanButtonClicked__Delegate; // 0x290
};

struct URPC_RemoveQuitter_X {
	FUniqueNetId PlayerID; // 0xe8
	int32_t PlaylistId; // 0x130
};

struct UVideoSettingsSaveConsole_TA {
	EConsoleQualityMode VideoQualityMode; // 0xe0
};

struct UGoal_TA {
	ObjectProperty GoalOrientation; // 0xa8
	ObjectProperty ReplayOrientation; // 0xb0
	TArray<ObjectProperty> OverrideGoalIndicatorOrientations; // 0xb8
	FVector SaveCheckDirectionOffset; // 0xc8
	float EpicSaveMinSpeed; // 0xd4
	float EpicSaveArriveTime; // 0xd8
	char TeamNum; // 0xdc
	ObjectProperty ScoreFX; // 0xe0
	FString GoalIndicatorArchetype; // 0xe8
	uint32_t bNoGoalIndicator : 1; // 0xf8
	uint32_t bOnlyGoalsFromDirection : 1; // 0xf8
	uint32_t bAllowPostMatchLobbyReset : 1; // 0xf8
	uint32_t bEnabled : 1; // 0xf8
	uint32_t bShowFocusExtent : 1; // 0xf8
	ObjectProperty GoalDirection; // 0x100
	int32_t PointsToAward; // 0x108
	FVector AutoCamFocusExtent; // 0x10c
	FVector GoalFocusLocationOffset; // 0x118
	float MaxGoalScorerAttachRadius; // 0x124
	FVector GoalScoredDotDirection; // 0x128
	float MinAttachGoalToScorerDot; // 0x134
	FVector Location; // 0x138
	FVector Direction; // 0x144
	FVector Right; // 0x150
	FVector Up; // 0x15c
	FRotator Rotation; // 0x168
	FVector LocalExtent; // 0x174
	FVector WorldCenter; // 0x180
	FVector WorldExtent; // 0x18c
	FVector WorldFrontCenter; // 0x198
	FBox WorldBox; // 0x1a4
};

struct USeqAct_DrawText {
	float DisplayTimeSeconds; // 0x160
	uint32_t bDisplayOnObject : 1; // 0x164
	FKismetDrawTextInfo DrawTextInfo; // 0x168
};

struct UWebConfig_X {
	uint32_t bCacheWebImages : 1; // 0x78
	uint32_t bZipPsyNetStaticData : 1; // 0x78
	float PsyNetStaticDataCacheMinutes; // 0x7c
};

struct U__GFxData_MusicPlayer_TA__MergePlaylists_508302224D9360438483F1898882DFAB {
	TArray<FGFxMusicPlaylist> NewPlaylists; // 0x60
};

struct URPC_SetRichPresence_X {
	FString PresenceInfo; // 0xe8
	FString PresenceState; // 0xf8
};

struct UObject {
	FPointer VfTableObject; // 0x0
	FPointer HashNext; // 0x8
	QWordProperty ObjectFlags; // 0x10
	FPointer HashOuterNext; // 0x18
	FPointer StateFrame; // 0x20
	ObjectProperty Linker; // 0x28
	FPointer LinkerIndex; // 0x30
	int32_t ObjectInternalInteger; // 0x38
	int32_t NetIndex; // 0x3c
	ObjectProperty Outer; // 0x40
	FName Name; // 0x48
	FNone* Class; // 0x50
	ObjectProperty ObjectArchetype; // 0x58
};

struct UProductExpirationNotification_TA {
	FProductHashID HashID; // 0x110
	FString ExpiredTitle; // 0x118
	FString ExpiredBody; // 0x128
	ObjectProperty OnlineProduct; // 0x138
};

struct ANetworkInputBuffer_STS_TA {
	ObjectProperty JitterBuffer; // 0x2c8
	float ExtraSimTimeRemaining; // 0x2d0
	FSimTimeAdjustDebugData Debug; // 0x2d4
	float TimeLastSimTimeAdjustment; // 0x2dc
	float TimeClientAckdAdjustSimTime; // 0x2e0
	char ReplicatedInputBufferSize; // 0x2e4
	uint32_t bAdjustingSimTime : 1; // 0x2e8
	int32_t BufferSizeLowWatermark; // 0x2ec
	float TimeLastMissedInput; // 0x2f0
	float TimeLastTightenUpBufferCheck; // 0x2f4
};

struct UGFxData_AutoTour_TourCard_TA {
	ObjectProperty OnlineGameTournaments; // 0x98
	TArray<ObjectProperty> Settings; // 0xa0
	QWordProperty StartTime; // 0xb0
	QWordProperty LastTournamentTime; // 0xb8
	FString Title; // 0xc0
	FString Description; // 0xd0
	QWordProperty ScheduleID; // 0xe0
	int32_t TeamSize; // 0xe8
	char GameMode; // 0xec
	uint32_t bIsIneligible : 1; // 0xf0
	uint32_t bCanCheckIn : 1; // 0xf0
	uint32_t bRegistered : 1; // 0xf0
	uint32_t bUpdateSkill : 1; // 0xf0
	uint32_t bIsInitialized : 1; // 0xf0
};

struct UMaterialExpressionTerrainLayerWeight {
	FPointer InstanceOverride; // 0xc0
	FExpressionInput Base; // 0xc8
	FExpressionInput Layer; // 0x100
	FName ParameterName; // 0x138
	float PreviewWeight; // 0x140
	FGuid ExpressionGUID; // 0x144
};

struct UPartyMessage_JoinGame_X {
	FPartyJoinMatchSettings Settings; // 0xa8
};

struct UParticleModuleColorByParameter {
	FName ColorParam; // 0x70
	FColor DefaultColor; // 0x78
};

struct URPC_InviteToClub_X {
	FUniqueNetId PlayerID; // 0xe8
};

struct UCameraState_ReplayFollow_TA {
	float FollowDistance; // 0xb8
	float MinFollowDistance; // 0xbc
	float MaxFollowDistance; // 0xc0
	FInterpCurveFloat FollowRotationRateCurve; // 0xc8
	uint32_t bFirstExecution : 1; // 0xe0
};

struct UProductAsset_Skin_TA {
	ObjectProperty Skin; // 0xf8
	TArray<FSkinBodySettings> BodySettings; // 0x100
	TArray<FBodyChassisOverride> BodyChassisOverrides; // 0x110
	ESkinType SkinType; // 0x120
	FLinearColor ThumbnailTeamColor; // 0x124
	FLinearColor ThumbnailCustomColor; // 0x134
	uint32_t bTeamFinishDisabled : 1; // 0x144
	uint32_t bCustomFinishDisabled : 1; // 0x144
	FParameterInformation TeamFinishToApply; // 0x148
	FParameterInformation CustomFinishToApply; // 0x180
	FLinearColor ForcedTeamColors[0x2]; // 0x1b8
	FLinearColor ForcedCustomColor[0x2]; // 0x1d8
};

struct USeqAct_SetBool {
	uint32_t DefaultValue : 1; // 0x160
};

struct UCarPreviewMeshComponent_TA {
	ObjectProperty BoostAsset; // 0x8c8
	ObjectProperty BoostFX; // 0x8d0
	ObjectProperty AntennaAsset; // 0x8d8
	ObjectProperty HatAsset; // 0x8e0
};

struct USpawnPointCluster_TA {
	TArray<ObjectProperty> SpawnTeams; // 0x60
};

struct UFriendRequestNotification_TA {
	FUniqueNetId PlayerID; // 0x110
};

struct ACarComponent_AirControl_Robin_TA {
	FWaveParams RandomPitch; // 0x300
	FWaveParams RandomYaw; // 0x308
	FWaveParams RandomRoll; // 0x310
};

struct UCameraStateSelector_TA {
	TArray<ObjectProperty> States; // 0x70
	ObjectProperty Camera; // 0x80
};

struct UFaceItConfig_TA {
	uint32_t bEnabled : 1; // 0x78
	TArray<FPartnerMapping> PartnerNames; // 0x80
	FString DefaultPartnerName; // 0x90
};

struct U__GFxData_NotificationManager_TA__HandleNotificationRemoved_6A78923A45515E496DFA9D942EF29303 {
	ObjectProperty Notification; // 0x60
};

struct UGFxAction_OpenMovie {
	ObjectProperty Movie; // 0x160
	FNone* MoviePlayerClass; // 0x168
	ObjectProperty MoviePlayer; // 0x170
	uint32_t bTakeFocus : 1; // 0x178
	uint32_t bCaptureInput : 1; // 0x178
	uint32_t bStartPaused : 1; // 0x178
	uint32_t bEnableGammaCorrection : 1; // 0x178
	uint32_t bDisplayWithHudOff : 1; // 0x178
	GFxRenderTextureMode RenderTextureMode; // 0x17c
	ObjectProperty RenderTexture; // 0x180
	TArray<FName> CaptureKeys; // 0x188
	TArray<FName> FocusIgnoreKeys; // 0x198
};

struct UGFxData_TourEvent_TA {
	ObjectProperty Tournaments; // 0x98
	ObjectProperty TourMatchmaking; // 0xa0
	ObjectProperty TourConfig; // 0xa8
	FString Title; // 0xb0
	QWordProperty Id; // 0xc0
	QWordProperty ScheduleID; // 0xc8
	int32_t SecondsRemaining; // 0xd0
	QWordProperty GenerateBracketTime; // 0xd8
	ETourEventStatus Status; // 0xe0
	QWordProperty LocalTeamID; // 0xe8
	int32_t Round; // 0xf0
	int32_t TotalRounds; // 0xf4
	FString NextOpponent; // 0xf8
	QWordProperty EndGameWarningEpochTime; // 0x108
	QWordProperty EndGameEpochTime; // 0x110
	uint32_t bTroubleJoining : 1; // 0x118
	ObjectProperty ActiveTournament; // 0x120
	int32_t MatchID; // 0x128
};

struct UReplayManager_TA {
	FString ReplaysPath; // 0x60
	TArray<FPointer> ExportTasks; // 0x70
	TArray<FPointer> ClassTasks; // 0x80
	TArray<FPointer> ImportTasks; // 0x90
	FPointer HeadersCountTask; // 0xa0
	TArray<FPointer> HeaderLoadTasks; // 0xa8
	TArray<FReplayExportCallbackData> ExportCallbacks; // 0xb8
	TArray<FReplayImportCallbackData> ImportCallbacks; // 0xc8
	DelegateProperty __EventPreLoadReplay__Delegate; // 0xd8
	DelegateProperty __EventExportFinished__Delegate; // 0xf0
	DelegateProperty __EventImportFinished__Delegate; // 0x108
	DelegateProperty __EventHeadersLoaded__Delegate; // 0x120
};

struct UOnlinePersistentAuthInterfaceImpl {
	FPointer VfTable_IOnlinePersistentAuthInterface; // 0x60
	TArray<DelegateProperty> RequestPinGrantCodeDelegates; // 0x68
	TArray<DelegateProperty> UnderageUserDetectedDelegates; // 0x78
	DelegateProperty __OnReceievedPinGrantCode__Delegate; // 0x88
	DelegateProperty __OnUnderageUserDetected__Delegate; // 0xa0
};

struct UTourErrors_TA {
	ObjectProperty TournamentFull; // 0x80
	ObjectProperty TournamentPaused; // 0x88
	ObjectProperty TournamentsDisabled; // 0x90
	ObjectProperty InActiveTournament; // 0x98
	ObjectProperty SplitScreenIsInActiveTournament; // 0xa0
	ObjectProperty NoMatchFound; // 0xa8
	ObjectProperty TeamEliminated; // 0xb0
	ObjectProperty AlreadyRegistered; // 0xb8
	ObjectProperty NotAdmin; // 0xc0
	ObjectProperty NotEligible; // 0xc8
	ObjectProperty AlreadyStarted; // 0xd0
	ObjectProperty InvalidTournamentState; // 0xd8
	ObjectProperty InvalidCredentials; // 0xe0
	ObjectProperty TournamentNotFound; // 0xe8
	ObjectProperty TournamentHasConcluded; // 0xf0
	ObjectProperty CheckInRankIneligible; // 0xf8
	ObjectProperty CheckInNotOpen; // 0x100
	ObjectProperty CheckInRequiresPartyLeader; // 0x108
	ObjectProperty TooManyPlayersCheckingIn; // 0x110
	ObjectProperty CannotMatchmakeIfRegistered; // 0x118
	ObjectProperty CannotCheckInWhileOnline; // 0x120
	ObjectProperty CannotCancelAfterRegistration; // 0x128
	ObjectProperty TournamentHasBeenCancelled; // 0x130
	ObjectProperty TeamSizeTooLarge; // 0x138
	ObjectProperty TeamSizeTooSmall; // 0x140
	ObjectProperty PlayerNotRegistered; // 0x148
	ObjectProperty TeamNameNotAllowed; // 0x150
	ObjectProperty TournamentNameNotAllowed; // 0x158
	ObjectProperty TournamentCreateLimitReached; // 0x160
	ObjectProperty AutoTournamentNoTeamFound; // 0x168
	ObjectProperty AutoTournamentRequiresCrossplatform; // 0x170
	ObjectProperty AutoTourmamentRequiresCrossplatformNotLeader; // 0x178
	ObjectProperty AutoTournamentBanned; // 0x180
	ObjectProperty AutoTournamentResultsRevoked; // 0x188
	ObjectProperty IneligibleForLateTournament; // 0x190
	ObjectProperty PlayerNotInTourTeam; // 0x198
	ObjectProperty PartyMembersNotInTourTeam; // 0x1a0
	ObjectProperty KickedNotInPartyTour; // 0x1a8
	ObjectProperty KickedPartyIsCheckingIn; // 0x1b0
	ObjectProperty NoSplitscreenDuringCheckin; // 0x1b8
	ObjectProperty NoInvitesWhileCheckingIn; // 0x1c0
	ObjectProperty NoJoiningWhileCheckingIn; // 0x1c8
	ObjectProperty SkillRequirementsNotMet; // 0x1d0
	ObjectProperty PartySkillRequirementsNotMet; // 0x1d8
	ObjectProperty ScheduleRegionIsLocked; // 0x1e0
	ObjectProperty ScheduleRegionIsInvalid; // 0x1e8
	ObjectProperty ScheduleRegionNotSet; // 0x1f0
	ObjectProperty TourCreateCrossplatformDisabled; // 0x1f8
	ObjectProperty CustomTourmamentRequiresCrossplatform; // 0x200
	ObjectProperty CannotSpectateWhileInParty; // 0x208
	ObjectProperty TourRankDisparity; // 0x210
	ObjectProperty TourTroubleConnectingToServer; // 0x218
};

struct UAkMusicAnalysis {
	FPointer VfTable_FTickableObject; // 0x60
	int32_t BPM; // 0x68
	FMusicAnalysisInfo MusicInfo; // 0x70
	FMusicAnalysisInfo MusicInfoSmoothed; // 0x90
	float AttackSpeed; // 0xb0
	float ReleaseSpeed; // 0xb4
	uint32_t bDebugPrintMusicAnalysisValues : 1; // 0xb8
	ObjectProperty MusicAnalysisSilentLoop; // 0xc0
	DelegateProperty __EventNewMusicTrack__Delegate; // 0xc8
	DelegateProperty __EventMusicBeat__Delegate; // 0xe0
	DelegateProperty __EventMusicBar__Delegate; // 0xf8
};

struct ULegalText_TA {
	int32_t LegalHash; // 0x60
	DelegateProperty __EventLegalTextUpdated__Delegate; // 0x68
};

struct UMaterialExpressionQualitySwitch {
	FExpressionInput High; // 0xc0
	FExpressionInput Low; // 0xf8
	FExpressionInput HandheldQuality; // 0x130
};

struct UMutator_Attachment_TA {
	ObjectProperty AttachmentArchetype; // 0x68
	ObjectProperty Team1AttachmentArchetype; // 0x70
};

struct U__TAsyncResult__ClubDetails_X__NotifyOnResultComplete_6CFB22B94B04498042E93AAF245F960F {
	DelegateProperty Callback; // 0x60
};

struct USeqAct_GameURLHasOption_TA {
	FString Option; // 0x160
};

struct ASpecialPickup_CarFreeze_TA {
	ObjectProperty OtherCarFXArchetype; // 0x3c0
	float TireFrictionScale; // 0x3c8
	float AddAngularVelocity; // 0x3cc
	ObjectProperty OtherCarFX; // 0x3d0
	ObjectProperty OtherCar; // 0x3d8
};

struct UStatusObserver_X {
	TArray<ObjectProperty> TriggerTypes; // 0x60
	TArray<FNone*> AcceptedTypes; // 0x70
	uint32_t bInitComplete : 1; // 0x80
	DelegateProperty __bInitComplete__ChangeNotify; // 0x88
};

struct UCameraStateSelector_Sequence_TA {
	uint32_t bResetIndexOnActive : 1; // 0x88
	int32_t StateIdx; // 0x8c
};

struct AVehiclePickup_Item_TA {
	TArray<ObjectProperty> ItemArchetypes; // 0x2f0
	ObjectProperty ReplicatedFXActorArchetype; // 0x300
};

struct ACullDistanceVolume {
	TArray<FCullDistanceSizePair> CullDistances; // 0x2a8
	uint32_t bEnabled : 1; // 0x2b8
};

struct UAudioParamsSuperSonicReplayComponent_TA {
	ObjectProperty ReplayFocus; // 0xa8
};

struct UPartyBeaconHost {
	TArray<FClientBeaconConnection> Clients; // 0xa8
	int32_t NumTeams; // 0xb8
	int32_t NumPlayersPerTeam; // 0xbc
	int32_t NumReservations; // 0xc0
	int32_t NumConsumedReservations; // 0xc4
	TArray<FPartyReservation> Reservations; // 0xc8
	FName OnlineSessionName; // 0xd8
	int32_t ConnectionBacklog; // 0xe0
	int32_t ForceTeamNum; // 0xe4
	int32_t ReservedHostTeamNum; // 0xe8
	uint32_t bBestFitTeamAssignment : 1; // 0xec
	EPartyBeaconHostState BeaconState; // 0xf0
	DelegateProperty __OnReservationChange__Delegate; // 0xf8
	DelegateProperty __OnReservationsFull__Delegate; // 0x110
	DelegateProperty __OnClientCancellationReceived__Delegate; // 0x128
};

struct USeqAct_SetMatInstVectorParam_TA {
	ObjectProperty MatInst; // 0x160
	FName ParamName; // 0x168
	FVector VectorValue; // 0x170
};

struct UOnlineStatsInterfaceEOS {
	FPointer StatsHandle; // 0x60
	ObjectProperty PlayerInterfaceEOS; // 0x68
	TArray<DelegateProperty> ReadStatsDelegates; // 0x70
	DelegateProperty __OnReadOnlineStatsComplete__Delegate; // 0x80
	DelegateProperty __OnFlushOnlineStatsComplete__Delegate; // 0x98
	DelegateProperty __OnRegisterHostStatGuidComplete__Delegate; // 0xb0
};

struct ALandscapeProxy {
	FGuid LandscapeGuid; // 0x268
	int32_t MaxLODLevel; // 0x278
	ObjectProperty DefaultPhysMaterial; // 0x280
	float StreamingDistanceMultiplier; // 0x288
	ObjectProperty LandscapeMaterial; // 0x290
	float LODDistanceFactor; // 0x298
	TArray<ComponentProperty> LandscapeComponents; // 0x2a0
	TArray<ComponentProperty> CollisionComponents; // 0x2b0
	TMap<None, None> MaterialInstanceConstantMap; // 0x2c0
	TMap<None, None> WeightmapUsageMap; // 0x310
	float StaticLightingResolution; // 0x360
	ObjectProperty LandscapeActor; // 0x368
	uint32_t bIsProxy : 1; // 0x370
	uint32_t bIsSetup : 1; // 0x370
	uint32_t bResetup : 1; // 0x370
	uint32_t bIsMovingToLevel : 1; // 0x370
	FLightmassPrimitiveSettings LightmassSettings; // 0x374
	int32_t CollisionMipLevel; // 0x390
	int32_t MobileLODBias; // 0x394
	TArray<FLandscapeLayerStruct> LayerInfoObjs; // 0x398
	int32_t ComponentSizeQuads; // 0x3a8
	int32_t SubsectionSizeQuads; // 0x3ac
	int32_t NumSubsections; // 0x3b0
};

struct UWebRequest {
	FString RemoteAddr; // 0x60
	FString URI; // 0x70
	FString Username; // 0x80
	FString Password; // 0x90
	int32_t ContentLength; // 0xa0
	FString ContentType; // 0xa8
	ERequestType RequestType; // 0xb8
	FMap_Mirror HeaderMap; // 0xc0
	FMap_Mirror VariableMap; // 0x110
};

struct UCrowdNoiseModifier_TA {
	float ValueMin; // 0x60
	float ValueMax; // 0x64
	float DurationMin; // 0x68
	float DurationMax; // 0x6c
	ObjectProperty OneShotSound; // 0x70
};

struct UPartyMessage_CrossPlayTextChat_X {
	ECrossPlatformChatState CrossChatState; // 0xa8
};

struct UDrawConeComponent {
	FColor ConeColor; // 0x258
	float ConeRadius; // 0x25c
	float ConeAngle; // 0x260
	int32_t ConeSides; // 0x264
};

struct UBTCondition {
	float UpdateDelay; // 0x80
	uint32_t bFlipResult : 1; // 0x84
	uint32_t bDirty : 1; // 0x84
	uint32_t CachedResult : 1; // 0x84
	float NextUpdateTime; // 0x88
};

struct UMaterialExpressionTime {
	uint32_t bIgnorePause : 1; // 0xc0
};

struct UGFxEngine_TA {
	TArray<FSoundStateItem> UISoundStates; // 0x190
	uint32_t bViewingOnlineScene : 1; // 0x1a0
	ObjectProperty LoadingScreen; // 0x1a8
	ObjectProperty OnlineSubsystem; // 0x1b0
};

struct URPC_GetBanStatus_TA {
	TArray<FUniqueNetId> Players; // 0xe8
	TArray<ObjectProperty> BanMessages; // 0xf8
};

struct UGFxData_ProductAttribute_Title_TA {
	FName TitleId; // 0xb0
};

struct UMutator_Robin_TA {
	FStickyForceData StickyForce; // 0x60
	FAutoFlipData AutoFlip; // 0x68
	ComponentProperty VehicleSim; // 0x70
	TArray<ObjectProperty> OverrideCarComponents; // 0x78
};

struct UParticleModuleAttractorPoint {
	FRawDistributionVector Position; // 0x70
	FRawDistributionFloat Range; // 0x98
	FRawDistributionFloat Strength; // 0xc0
	uint32_t StrengthByDistance : 1; // 0xe8
	uint32_t bAffectBaseVelocity : 1; // 0xe8
	uint32_t bOverrideVelocity : 1; // 0xe8
	uint32_t bUseWorldSpacePosition : 1; // 0xe8
};

struct UExplosionHitHandler_TA {
	uint32_t bApplyToAllCars : 1; // 0xf8
	uint32_t bIsActive : 1; // 0xf8
	FMap_Mirror VehicleToContactInfo; // 0x100
};

struct USkyLightComponent {
	float LowerBrightness; // 0x1c8
	FColor LowerColor; // 0x1cc
};

struct UMatchCompleteMetrics_TA {
	TArray<FMatchCompleteHistory> History; // 0x80
};

struct UStringMap {
	FMap_Mirror Map; // 0x70
	DelegateProperty __PairCallback__Delegate; // 0xc0
};

struct UParticleModuleLocationPrimitiveSphere_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xf0
};

struct UGFxData_Privileges_TA {
	uint32_t bCheckingPrivileges : 1; // 0x98
	ObjectProperty OnlineGame; // 0xa0
};

struct AAIController_Breakout_TA {
	FVector ClosestEnemyGoalLocation; // 0x7c0
	int32_t DefaultSoccarSize; // 0x7cc
};

struct UTexture2D {
	FIndirectArray_Mirror Mips; // 0x150
	FIndirectArray_Mirror CachedPVRTCMips; // 0x160
	FIndirectArray_Mirror CachedATITCMips; // 0x170
	FIndirectArray_Mirror CachedETCMips; // 0x180
	int32_t CachedFlashMipsMaxResolution; // 0x190
	FUntypedBulkData_Mirror CachedFlashMips; // 0x198
	int32_t SizeX; // 0x1f0
	int32_t SizeY; // 0x1f4
	int32_t OriginalSizeX; // 0x1f8
	int32_t OriginalSizeY; // 0x1fc
	EPixelFormat Format; // 0x200
	TextureAddress AddressX; // 0x201
	TextureAddress AddressY; // 0x202
	uint32_t bIsEditorOnly : 1; // 0x204
	uint32_t bIsStreamable : 1; // 0x204
	uint32_t bHasCancelationPending : 1; // 0x204
	uint32_t bHasBeenLoadedFromPersistentArchive : 1; // 0x204
	uint32_t bForceMiplevelsToBeResident : 1; // 0x204
	uint32_t bGlobalForceMipLevelsToBeResident : 1; // 0x204
	uint32_t bIsCompositingSource : 1; // 0x204
	uint32_t bHasBeenPaintedInEditor : 1; // 0x204
	uint32_t bUseAlphaInThumbnail : 1; // 0x204
	float ForceMipLevelsToBeResidentTimestamp; // 0x208
	FName TextureFileCacheName; // 0x20c
	FGuid TextureFileCacheGuid; // 0x214
	int32_t RequestedMips; // 0x224
	int32_t ResidentMips; // 0x228
	int32_t MipsToRemoveOnCompress; // 0x22c
	FThreadSafeCounter PendingMipChangeRequestStatus; // 0x230
	TArray<char> SystemMemoryData; // 0x238
	ObjectProperty RenderTarget2DRef; // 0x248
	FTextureLinkedListMirror StreamableTexturesLink; // 0x250
	int32_t StreamingIndex; // 0x268
	int32_t MipTailBaseIdx; // 0x26c
	FPointer ResourceMem; // 0x270
	int32_t FirstResourceMemMip; // 0x278
	float Timer; // 0x27c
};

struct UPsyNetService_FaceItSearchStarted_TA {
	int32_t PartnerID; // 0x90
};

struct UDistributionFloatConstant {
	float Constant; // 0x80
};

struct UTourEventMatch_TA {
	ObjectProperty Tournaments; // 0x60
	ObjectProperty Config; // 0x68
	ObjectProperty TourMatchmaking; // 0x70
	ObjectProperty PsyNet; // 0x78
	FUniqueNetId PlayerID; // 0x80
	QWordProperty TournamentID; // 0xc8
	QWordProperty TeamID; // 0xd0
	FTourMatch DependentMatch; // 0xd8
	FTourMatch NextMatch; // 0x108
	int32_t PrevMatchID; // 0x138
	ObjectProperty Error; // 0x140
	ObjectProperty GetMatchTask; // 0x148
	FString ReceivedByeTitle; // 0x150
	FString ReceivedByeBody; // 0x160
	DelegateProperty __EventDependentMatchUpdated__Delegate; // 0x170
	DelegateProperty __EventNextMatchReady__Delegate; // 0x188
	DelegateProperty __EventError__Delegate; // 0x1a0
	DelegateProperty __EventCurrentMatchUpdated__Delegate; // 0x1b8
};

struct UMaterialExpressionCustom {
	FString Code; // 0xc0
	ECustomMaterialOutputType OutputType; // 0xd0
	FString Description; // 0xd8
	TArray<FCustomInput> Inputs; // 0xe8
};

struct USystemSettingsManager_TA {
	int32_t NumPlayers; // 0x60
};

struct UBallLocationComponent_TA {
	ObjectProperty MaterialToApplyBallLocationTo; // 0xa0
};

struct UGFxData_TourDetails_TA {
	ObjectProperty Settings; // 0x98
	ComponentProperty OnlineProductSet; // 0xa0
	ObjectProperty DetailsSync; // 0xa8
	ObjectProperty TourSettings; // 0xb0
	ObjectProperty Tournaments; // 0xb8
	TArray<FGFxTournamentReward> Rewards; // 0xc0
	ObjectProperty CreatorAvatar; // 0xd0
	FString CreatorPlatform; // 0xd8
	uint32_t bRegistered : 1; // 0xe8
	uint32_t bAdmin : 1; // 0xe8
	uint32_t bCanCheckIn : 1; // 0xe8
};

struct USpriteComponent {
	ObjectProperty Sprite; // 0x258
	uint32_t bIsScreenSizeScaled : 1; // 0x260
	float ScreenSize; // 0x264
	float U; // 0x268
	float UL; // 0x26c
	float V; // 0x270
	float VL; // 0x274
	FName SpriteCategoryName; // 0x278
};

struct URPC_Challenge_SetProgress_TA {
	FUniqueNetId PlayerID; // 0xe8
	int32_t ChallengeID; // 0x130
	int32_t Count; // 0x134
};

struct UParticleModuleMeshRotationRateMultiplyLife {
	FRawDistributionVector LifeMultiplier; // 0x70
};

struct UParticleModuleTypeDataApex {
	ObjectProperty ApexIOFX; // 0x70
	ObjectProperty ApexEmitter; // 0x78
};

struct USequenceFrame {
	int32_t SizeX; // 0xd8
	int32_t SizeY; // 0xdc
	int32_t BorderWidth; // 0xe0
	uint32_t bDrawBox : 1; // 0xe4
	uint32_t bFilled : 1; // 0xe4
	uint32_t bTileFill : 1; // 0xe4
	FColor BorderColor; // 0xe8
	FColor FillColor; // 0xec
	ObjectProperty FillTexture; // 0xf0
	ObjectProperty FillMaterial; // 0xf8
};

struct URPC_GetClubDetails_X {
	int32_t ClubID; // 0xf8
};

struct UProductAttribute_Tiered_TA {
	int32_t TierIndex; // 0x80
};

struct UAkRTPCDecayComponent {
	FName RTPC; // 0xa0
	float GrowValue; // 0xa8
	float MaxValue; // 0xac
	FInterpCurveFloat DecayPerSecond; // 0xb0
	ComponentProperty SoundSource; // 0xc8
	float CurrentValue; // 0xd0
	float LastAttachTime; // 0xd4
	uint32_t bWasAttached : 1; // 0xd8
};

struct UGFxData_Vote_TA {
	EVoteSubject Subject; // 0x98
	EVoteStatus VoteStatus; // 0x99
	EVoteStatus LocalVoteStatus; // 0x9a
	int32_t YesVotes; // 0x9c
	int32_t NoVotes; // 0xa0
	int32_t RequiredVotes; // 0xa4
	int32_t TimeRemaining; // 0xa8
	ObjectProperty VoteActor; // 0xb0
};

struct U__GFxData_Products_TA__HandleProductThumbnailRendered_7719E5054B6E9F6A1FC08CA528058D12 {
	ObjectProperty LoadingProduct; // 0x60
};

struct URPC_TourCancelCreated_TA {
	FUniqueNetId PlayerID; // 0xe8
	QWordProperty TournamentID; // 0x130
};

struct U__ShopsService_PsyNet_TA__GetCrateShop_17FBCC66491E6084CA6BFE9C538217CC {
	DelegateProperty Callback; // 0x60
	DelegateProperty FailedCallback; // 0x78
};

struct UEventRecorder_X {
	FPointer VfTable_FTickableObject; // 0x70
	ObjectProperty Config; // 0x78
	int32_t MaxQueuedEvents; // 0x80
	int32_t MaxQueuedMinutes; // 0x84
	uint32_t bPaused : 1; // 0x88
	TArray<FMetricsEvent> QueuedEvents; // 0x90
	FGuid AppSessionID; // 0xa0
	FGuid LevelSessionID; // 0xb0
	float NextSendTime; // 0xc0
	float FloodPreventionTimeSeconds; // 0xc4
	float LastFullSendTime; // 0xc8
	int32_t AppEventCount; // 0xcc
};

struct UPartyMessage_DisableCrossPlay_X {
	uint32_t bDisableCrossPlay : 1; // 0xa8
};

struct UMatchmakingViewFilter_RankedSports_TA {
	TScriptInterface<Class> Playlists; // 0x60
};

struct USeqAct_RandomSwitch {
	TArray<int32_t> AutoDisabledIndices; // 0x180
};

struct UParticleModuleTypeDataTrail2 {
	int32_t TessellationFactor; // 0x70
	float TessellationFactorDistance; // 0x74
	float TessellationStrength; // 0x78
	int32_t TextureTile; // 0x7c
	int32_t Sheets; // 0x80
	int32_t MaxTrailCount; // 0x84
	int32_t MaxParticleInTrailCount; // 0x88
	uint32_t bClipSourceSegement : 1; // 0x8c
	uint32_t bClearTangents : 1; // 0x8c
	uint32_t RenderGeometry : 1; // 0x8c
	uint32_t RenderDirectLine : 1; // 0x8c
	uint32_t RenderLines : 1; // 0x8c
	uint32_t RenderTessellation : 1; // 0x8c
};

struct UCameraState_Countdown_TA {
	int32_t MaxCarsShown; // 0x180
	float TimePerCar; // 0x184
	uint32_t bSwitchTeamsEveryCar : 1; // 0x188
	TArray<ObjectProperty> ShownCars; // 0x190
	ObjectProperty CurrentCar; // 0x1a0
	ObjectProperty NextCar; // 0x1a8
	int32_t LastTeam; // 0x1b0
	float LastChangeCarTime; // 0x1b4
};

struct UGetPlayerStorageResult_X {
	TArray<ObjectProperty> Items; // 0x60
};

struct UGFxData_LocalPlayer_TA {
	uint32_t bOpenedStartMenu : 1; // 0x98
	uint32_t bCheckedStartupEvents : 1; // 0x98
	uint32_t bSaveDataLoaded : 1; // 0x98
	uint32_t bBallcam : 1; // 0x98
	uint32_t bUseHoldBallCam : 1; // 0x98
	uint32_t bUseBallCamIndicator : 1; // 0x98
	uint32_t bAlternateNameplates : 1; // 0x98
	uint32_t bMetric : 1; // 0x98
	uint32_t bTeamColoredBoostMeter : 1; // 0x98
	uint32_t bPrimaryPlayer : 1; // 0x98
	uint32_t bPartyLeader : 1; // 0x98
	uint32_t bIsInParty : 1; // 0x98
	uint32_t bIsPlayerTrading : 1; // 0x98
	uint32_t bDemoBuild : 1; // 0x98
	uint32_t bForceSplitScreenUI : 1; // 0x98
	uint32_t bPrivateMatchGameOwner : 1; // 0x98
	uint32_t bAgeRestricted : 1; // 0x98
	uint32_t bPendingIdleKick : 1; // 0x98
	uint32_t bStartVoteToForfeitDisabled : 1; // 0x98
	uint32_t bDisableCrossPlay : 1; // 0x98
	uint32_t bReplacingBot : 1; // 0x98
	uint32_t bDisableDivisions : 1; // 0x98
	uint32_t bDisableDivisionsSports : 1; // 0x98
	uint32_t bCheckedBootMessage : 1; // 0x98
	uint32_t bUseSteamInput : 1; // 0x98
	FString SaveDataError; // 0xa0
	FString OnlineError; // 0xb0
	FString PlayerName; // 0xc0
	ObjectProperty PlayerAvatarTexture; // 0xd0
	int32_t XpLevel; // 0xd8
	FString XPTitle; // 0xe0
	int32_t XPTotal; // 0xf0
	int32_t XPProgressInCurrentLevel; // 0xf4
	int32_t XPRequiredForNextLevel; // 0xf8
	int32_t Team; // 0xfc
	float CameraYaw; // 0x100
	int32_t SplitScreenPosition; // 0x104
	int32_t ControllerId; // 0x108
	int32_t LocalPlayerIndex; // 0x10c
	FName LastMatchType; // 0x110
	float IdleKickSeconds; // 0x118
	FProductHashID ContainerToOpenId; // 0x11c
	char OrphanedControllerId; // 0x120
	ObjectProperty PersonaSave; // 0x128
	FUniqueNetId PlayerID; // 0x130
	ObjectProperty Player; // 0x178
	ObjectProperty ModalOrphaned; // 0x180
};

struct UGFxData_ProductSlot_TA {
	uint32_t bEnabled : 1; // 0x98
	uint32_t bCanUnequip : 1; // 0x98
	FName SlotName; // 0x9c
	FString Label; // 0xa8
	FString PluralLabel; // 0xb8
	ObjectProperty Icon; // 0xc8
	int32_t SlotIndex; // 0xd0
	FProductHashID EquippedHashID0; // 0xd4
	FProductHashID EquippedHashID1; // 0xd8
	FProductHashID EquippedPack; // 0xdc
	int32_t DefaultProductID; // 0xe0
	int32_t MatchesNeededToUnlock; // 0xe4
};

struct UInstancedStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceData; // 0x308
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x318
	int32_t NumPendingLightmaps; // 0x328
	int32_t ComponentJoinKey; // 0x32c
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x330
	int32_t InstancingRandomSeed; // 0x340
	int32_t InstanceStartCullDistance; // 0x344
	int32_t InstanceEndCullDistance; // 0x348
	FBitArray_Mirror SelectedInstances; // 0x350
	uint32_t bDontResolveInstancedLightmaps : 1; // 0x370
};

struct USettings {
	TArray<FLocalizedStringSetting> LocalizedSettings; // 0x60
	TArray<FSettingsProperty> Properties; // 0x70
	TArray<FLocalizedStringSettingMetaData> LocalizedSettingsMappings; // 0x80
	TArray<FSettingsPropertyPropertyMetaData> PropertyMappings; // 0x90
};

struct UParticleModuleColor {
	FRawDistributionVector StartColor; // 0x70
	FRawDistributionFloat StartAlpha; // 0x98
	uint32_t bClampAlpha : 1; // 0xc0
};

struct UParticleModuleSizeScale {
	FRawDistributionVector SizeScale; // 0x70
	uint32_t EnableX : 1; // 0x98
	uint32_t EnableY : 1; // 0x98
	uint32_t EnableZ : 1; // 0x98
};

struct ULevelStreamingDistance {
	FVector Origin; // 0x118
	float MaxDistance; // 0x124
};

struct UProductAsset_Boost_TA {
	ObjectProperty FXActor; // 0xf8
	ObjectProperty PaintedFXActor; // 0x100
	float PreviewFrontWheelSpinSpeed; // 0x108
	float PreviewBackWheelSpinSpeed; // 0x10c
};

struct ANetworkInputBuffer_TA {
	ObjectProperty PhysicsConfig; // 0x268
	ObjectProperty JitterSettings; // 0x270
	ObjectProperty EngineShare; // 0x278
	ObjectProperty PrimaryClient; // 0x280
	TArray<ObjectProperty> Clients; // 0x288
	float TimeSinceLastMovePacket; // 0x298
	int32_t MaxInputFramesPerPacket; // 0x29c
	TArray<float> PingTimestamps; // 0x2a0
	float LastTickTime; // 0x2b0
	FInputBufferStats Stats; // 0x2b4
	ObjectProperty PingEvent; // 0x2c0
};

struct UTeamColorPreferences_TA {
	uint32_t bColorBlind : 1; // 0x60
	uint32_t bForceDefaultColors : 1; // 0x60
	DelegateProperty EventPropertyChange; // 0x68
};

struct U__OnlineGameDLC_TA__GetDlcIdFromName_F389331D44C49087E754C5A451A01F21 {
	FName DLCName; // 0x60
};

struct AHauntedBallTrapTrigger_TA {
	ObjectProperty LensFlare; // 0x270
	int32_t TeamIndex; // 0x278
	ObjectProperty GoalVolume; // 0x280
	float TrapResetTime; // 0x288
	float MinLensFlareColorValue; // 0x28c
	FName MICParamName; // 0x290
	ObjectProperty MIC_TrapVolumeMat; // 0x298
	ObjectProperty MIC_TrapOutlineMat; // 0x2a0
	uint32_t bIsActive : 1; // 0x2a8
	ObjectProperty HauntedBall; // 0x2b0
	ObjectProperty SoccarEvent; // 0x2b8
	ComponentProperty BeamPSC; // 0x2c0
	ObjectProperty BeamPSArchetype; // 0x2c8
	FName BeamPSParam; // 0x2d0
};

struct UGFxData_UserBugReport_TA {
	ObjectProperty Config; // 0x98
	uint32_t bEnabled : 1; // 0xa0
	TArray<FGFxUserBugReportCategory> Categories; // 0xa8
	TArray<FGFxUserBugReportCategory> SelectedCategories; // 0xb8
	FString UserMessage; // 0xc8
	EUserBugReportSubmitStatus Status; // 0xd8
	FString SubmitError; // 0xe0
	FString ConfirmationCode; // 0xf0
	ObjectProperty PendingData; // 0x100
	ObjectProperty UploadTask; // 0x108
};

struct U__GFxData_MusicPlayer_TA__GetTitleTrackBuilder_0F51B9DD43FEEB6B7694CBA4FCBEBA60 {
	TScriptInterface<Class> PreviousBuilder; // 0x60
};

struct UFaceFXAsset {
	ObjectProperty DefaultSkelMesh; // 0x60
	FPointer FaceFXActor; // 0x68
	TArray<char> RawFaceFXActorBytes; // 0x70
	TArray<char> RawFaceFXSessionBytes; // 0x80
	TArray<ObjectProperty> PreviewMorphSets; // 0x90
	TArray<ObjectProperty> MountedFaceFXAnimSets; // 0xa0
	TArray<ObjectProperty> ReferencedSoundCues; // 0xb0
	TArray<ObjectProperty> ReferencedAkEvents; // 0xc0
	int32_t NumLoadErrors; // 0xd0
};

struct UClubServerResult_X {
	FString Host; // 0x60
	int32_t Port; // 0x70
	FString ServerName; // 0x78
	FString CustomServerName; // 0x88
	FString CustomServerPassword; // 0x98
};

struct ABallRadiusVolume_TA {
	float Radius; // 0x268
	ComponentProperty PreviewRadius; // 0x270
	TArray<ObjectProperty> InRadius; // 0x278
};

struct ADynamicBlockingVolume {
	uint32_t bEnabled : 1; // 0x2b0
};

struct UDistributionVectorConstantCurve {
	FInterpCurveVector Curve; // 0xa0
};

struct URPC_CreateGameServer_X {
	FString ServerName; // 0xe8
	int32_t MachineId; // 0xf8
	FString IP; // 0x100
	FString Region; // 0x110
	int32_t BuildID; // 0x120
	FString ServerType; // 0x128
	QWordProperty ServerId; // 0x138
	FString Host; // 0x140
	int32_t Zone; // 0x150
	uint32_t UseWebSocket : 1; // 0x154
	FString PerConURL; // 0x158
	FString PerConURLv2; // 0x168
	FString PsyToken; // 0x178
};

struct UBTConditionalNode {
	TArray<ObjectProperty> PreConditions; // 0x80
	TArray<ObjectProperty> Conditions; // 0x90
	TArray<ObjectProperty> SuccessConditions; // 0xa0
};

struct UAvatarDownload {
	FUniqueNetId PlayerID; // 0x60
	FString URL; // 0xa8
	AvatarSize AvatarSize; // 0xb8
	ObjectProperty Texture; // 0xc0
	DelegateProperty Callbacks; // 0xc8
};

struct UProductAttribute_SpecialEditionSettings_TA {
	TArray<FSpecialEditionConfig> Editions; // 0x80
	TArray<ObjectProperty> SupportedEditions; // 0x90
};

struct UAnimationCompressionAlgorithm {
	FString Description; // 0x60
	uint32_t bNeedsSkeleton : 1; // 0x70
	AnimationCompressionFormat TranslationCompressionFormat; // 0x74
	AnimationCompressionFormat RotationCompressionFormat; // 0x75
};

struct UEpicErrors_X {
	ObjectProperty EpicAccountNotFound; // 0x80
	ObjectProperty EpicAccountLinkingFailed; // 0x88
	ObjectProperty EOSFailedToConnect; // 0x90
	ObjectProperty EOSFailedToConnectSplitscreen; // 0x98
	ObjectProperty NotLoggedInToEOS; // 0xa0
	ObjectProperty EOSUpdateRequired; // 0xa8
	ObjectProperty PinGrantCodeExpired; // 0xb0
	ObjectProperty PrimaryAccountNotSet; // 0xb8
	ObjectProperty EpicInvalidPlayer; // 0xc0
	ObjectProperty EpicRemoteFriendLimitReached; // 0xc8
	ObjectProperty EpicMaxOutgoingInvitesReached; // 0xd0
	ObjectProperty EpicLocalFriendLimitReached; // 0xd8
	ObjectProperty EpicAccountLookupFailed; // 0xe0
	ObjectProperty EpicAccountCreationFailed; // 0xe8
	ObjectProperty EpicAccountRestricted; // 0xf0
	ObjectProperty EpicPartyInviteFailed; // 0xf8
	ObjectProperty IncorrectSaveLoaded; // 0x100
	ObjectProperty EpicSocialBanned; // 0x108
	ObjectProperty MaxPendingFriendInvitesReached; // 0x110
};

struct UProductsConfig_TA {
	TArray<FReplacementProduct> ProhibitedProducts; // 0x78
	TArray<FProductTradeInFilter> TradeInFilters; // 0x88
	TArray<FSeriesGroup> ItemSeries_AllowTradeIn; // 0x98
	TArray<FSeriesGroup> ItemSeries_PreventP2PTrade; // 0xa8
	TArray<FProductTradeHoldOverride> ProductTradeHoldOverrides; // 0xb8
};

struct UGFxData_LanMatch_TA {
	FString ServerName; // 0x98
	FString Password; // 0xa8
	int32_t SelectedMaxPlayerCount; // 0xb8
	ECustomMatchSettingsType SettingsType; // 0xbc
};

struct URPC_GetGameServerPingList_X {
	TArray<FRegionSecret> Regions; // 0xe8
	TArray<FGetGameServerPingListData> Servers; // 0xf8
};

struct UInterpTrackLinearColorProp {
	FName PropertyName; // 0xe8
};

struct UClubInviteNotification_TA {
	FUniqueNetId PlayerID; // 0x110
	QWordProperty ClubID; // 0x158
	FString ClubName; // 0x160
	FString ClubTag; // 0x170
};

struct USeqAct_SetSkelMATLoadout_TA {
	ObjectProperty ActorMAT; // 0x160
	ObjectProperty ControllerOrPawn; // 0x168
	int32_t LoadoutIndex; // 0x170
};

struct ASpecialPickup_CarSpeed_TA {
	float SpeedMultiplier; // 0x388
	float MaxLinearSpeedMultiplier; // 0x38c
	FInterpCurveFloat DriveTorqueCurve; // 0x390
	float OriginalTorque; // 0x3a8
	float OriginalMaxLinearSpeed; // 0x3ac
	FInterpCurveFloat OriginalDriveTorqueCurve; // 0x3b0
};

struct UUIGameInfoSummary {
	FString ClassName; // 0xa0
	FString GameAcronym; // 0xb0
	FString MapPrefix; // 0xc0
	uint32_t bIsTeamGame : 1; // 0xd0
	uint32_t bIsDisabled : 1; // 0xd0
	FString GameSettingsClassName; // 0xd8
	FString GameName; // 0xe8
	FString Description; // 0xf8
};

struct AAkBusActor {
	ComponentProperty SoundSource; // 0x268
	FName TargetBusName; // 0x270
	EPinnedAxisType PinnedAxis; // 0x278
};

struct ASpecialPickup_Football_TA {
	ObjectProperty BallHitSFX; // 0x388
	ObjectProperty DeactivateSFX; // 0x390
	float AttachTime; // 0x398
	float DetachTime; // 0x39c
	TArray<FThrowSetting> ThrowSettings; // 0x3a0
	FVector AttachOffset; // 0x3b0
	float CarFumbleForce; // 0x3bc
	float DoubleJumpUpForce; // 0x3c0
	float DemolishUpForce; // 0x3c4
	float MinBreakTime; // 0x3c8
	float MinAttachTime; // 0x3cc
	float CheckLastTouchRate; // 0x3d0
	float OutOfBoundsZ; // 0x3d4
	ObjectProperty WeldedBall; // 0x3d8
	float LastTouchCheckTime; // 0x3e0
	ObjectProperty PendingBall; // 0x3e8
	FVector PendingBallDodge; // 0x3f0
};

struct UActorFactoryApexClothing {
	TArray<ObjectProperty> ClothingAssets; // 0xb8
	ERBCollisionChannel ClothingRBChannel; // 0xc8
	FRBCollisionChannelContainer ClothingRBCollideWithChannels; // 0xcc
};

struct URPCQueue_X {
	FPointer VfTable_FTickableObject; // 0x70
	float AuthTimeoutSeconds; // 0x78
	ObjectProperty RPCConfig; // 0x80
	ObjectProperty RetryConfig; // 0x88
	ObjectProperty PsyNetUrl; // 0x90
	TArray<FPendingRPC> PendingRPCs; // 0x98
	TArray<ObjectProperty> PendingBatches; // 0xa8
	FMap_Mirror ServiceFailureDelayTimes; // 0xb8
	uint32_t bAuthorized : 1; // 0x108
	DelegateProperty __EventRPCSuccess__Delegate; // 0x110
	DelegateProperty __EventRPCError__Delegate; // 0x128
	DelegateProperty __EventBatchError__Delegate; // 0x140
	DelegateProperty __SendRequestDelegate__Delegate; // 0x158
};

struct UTAsyncResult__UserBugReportUploadResult_TA {
	ObjectProperty Result; // 0xd0
	DelegateProperty __EventResult__Delegate; // 0xd8
	DelegateProperty __EventResultComplete__Delegate; // 0xf0
	DelegateProperty __ResultDelegate__Delegate; // 0x108
};

struct USeqAct_SetInt {
	int32_t Target; // 0x160
	TArray<int32_t> Value; // 0x168
};

struct UGenericParamListStatEntry {
	FPointer StatEvent; // 0x60
	ObjectProperty Writer; // 0x68
};

struct AExplosion_X {
	ComponentProperty ExplosionComponent; // 0x268
	ObjectProperty FXActorArchetype; // 0x270
	ObjectProperty FXActor; // 0x278
};

struct U__GFxData_Friends_TA__IsFriendInParty_D091D9BC4218F03AF9A6C8A1CF4BEC80 {
	FUniqueNetId UniqueId; // 0x60
};

struct ACamera_GameEditor_TA {
	FName CameraMode; // 0x7a8
	ObjectProperty CurrentCameraState; // 0x7b0
};

struct UApexDestructibleDamageParameters {
	TArray<FDamagePair> DamageMap; // 0x60
};

struct UEpicFriendsConverterConfig_TA {
	float DaysBetweenPrompts; // 0x78
	float SecondsBetweenInvites; // 0x7c
	int32_t MaxNumberOfAttemptsPerUser; // 0x80
};

struct USeqAct_SpawnArchetype_X {
	ObjectProperty ActorArchetype; // 0x160
	FVector Velocity; // 0x168
	float Speed; // 0x174
	TArray<ObjectProperty> SpawnOwners; // 0x178
	TArray<ObjectProperty> SpawnPoints; // 0x188
	ObjectProperty Spawned; // 0x198
};

struct UMaterialExpressionRotateAboutAxis {
	FExpressionInput NormalizedRotationAxisAndAngle; // 0xc0
	FExpressionInput PositionOnAxis; // 0xf8
	FExpressionInput Position; // 0x130
};

struct APlayerReplicationInfo {
	ComponentProperty ObjectProvider; // 0x268
	ComponentProperty RegistryGroup; // 0x270
	int32_t Score; // 0x278
	int32_t Deaths; // 0x27c
	char Ping; // 0x280
	ETTSSpeaker TTSSpeaker; // 0x281
	int32_t NumLives; // 0x284
	FString PlayerName; // 0x288
	FString OldName; // 0x298
	int32_t PlayerID; // 0x2a8
	ObjectProperty Team; // 0x2b0
	uint32_t bAdmin : 1; // 0x2b8
	uint32_t bIsSpectator : 1; // 0x2b8
	uint32_t bOnlySpectator : 1; // 0x2b8
	uint32_t bWaitingPlayer : 1; // 0x2b8
	uint32_t bReadyToPlay : 1; // 0x2b8
	uint32_t bOutOfLives : 1; // 0x2b8
	uint32_t bBot : 1; // 0x2b8
	uint32_t bIsInactive : 1; // 0x2b8
	uint32_t bFromPreviousLevel : 1; // 0x2b8
	uint32_t bTimedOut : 1; // 0x2b8
	uint32_t bUnregistered : 1; // 0x2b8
	int32_t StartTime; // 0x2bc
	FString StringSpectating; // 0x2c0
	FString StringUnknown; // 0x2d0
	int32_t Kills; // 0x2e0
	float ExactPing; // 0x2e4
	FString SavedNetworkAddress; // 0x2e8
	FUniqueNetId UniqueId; // 0x2f8
	FName SessionName; // 0x340
	FAutomatedTestingDatum AutomatedTestingData; // 0x348
	ObjectProperty Avatar; // 0x350
	FNetPacketStats PacketStats; // 0x358
	FNetPacketStats PrevPacketStats; // 0x374
	FClientConnectionStats NetStats; // 0x390
	FPRIRemoteUserData RemoteUserData; // 0x3e8
	DelegateProperty __EventTeamChanged__Delegate; // 0x3f8
};

struct UInterpTrackFloatBase {
	FInterpCurveFloat FloatTrack; // 0xc8
	float CurveTension; // 0xe0
};

struct UCameraState_PremiumGarage_TA {
	FViewTargetTransitionParams BetweenPremiumCameraBlend; // 0x100
	float FadeInFromBlackTime; // 0x110
	float FadeToBlackTime; // 0x114
	float PitchDeadzone; // 0x118
	float PitchSensitivity; // 0x11c
	FInterpCurveFloat PitchAutocorrectCurve; // 0x120
	float PitchMaxSpeed; // 0x138
	float PitchBlendbackModifier; // 0x13c
	float PitchBlendbackMin; // 0x140
	FInterpCurveFloat CameraReturnBlendCurve; // 0x148
	float LastAdjustTime; // 0x160
	ObjectProperty TurntableActor; // 0x168
	ObjectProperty Shell; // 0x170
};

struct URPC_MicroTransactions_ClaimEntitlements_TA {
	FUniqueNetId PlayerID; // 0xe8
	FString AuthCode; // 0x130
	TArray<FOnlineProductData> Products; // 0x140
	TArray<FCurrency> Currencies; // 0x150
	TArray<FCurrency> WalletCurrencies; // 0x160
};

struct USkelControlHandlebars {
	EAxis WheelRollAxis; // 0x130
	EAxis HandlebarRotateAxis; // 0x131
	FName WheelBoneName; // 0x134
	uint32_t bInvertRotation : 1; // 0x13c
	int32_t SteerWheelBoneIndex; // 0x140
};

struct UParticleModuleLifetime_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x98
};

struct U__ShopsService_Local_TA__Purchase_8F20EAE344CF202E96956D8535F63BAE {
	DelegateProperty SuccessCallback; // 0x60
};

struct UMaterialExpressionSubtract {
	FExpressionInput A; // 0xc0
	FExpressionInput B; // 0xf8
};

struct UBTAction {
	float FinishTime; // 0xb0
	float AbortTime; // 0xb4
	float StartTime; // 0xb8
};

struct UPBRuleNodeCycle {
	EProcBuildingAxis RepeatAxis; // 0x98
	float RepeatSize; // 0x9c
	int32_t CycleSize; // 0xa0
	uint32_t bFixRepeatSize : 1; // 0xa4
};

struct U__Car_TA__QueueDemolish_CB62EE9F47C73A498639CB95C005542B {
	FDemolishData Data; // 0x60
	ObjectProperty GoalExplosionDemoFxArchetype; // 0x88
};

struct UEula_TA {
	ObjectProperty EulaConfig; // 0x80
};

struct UStayAsPartyLeader_TA {
	FUniqueNetId LeaderID; // 0x60
};

struct UGFxData_ClientPerformanceStats_TA {
	uint32_t bIsGameRecordingEnabled : 1; // 0x98
};

struct URPC_MicroTransactions_FinalizePurchase_TA {
	QWordProperty OrderId; // 0xe8
	uint32_t Authorized : 1; // 0xf0
	FUniqueNetId PlayerID; // 0xf8
	TArray<FOnlineProductData> Products; // 0x140
	TArray<FCurrency> Currencies; // 0x150
	TArray<FCurrency> WalletCurrencies; // 0x160
};

struct UGFxData_TourBracketMatchTeamDetails_TA {
	QWordProperty TeamID; // 0x98
	TArray<FTeamGameStats> GameStats; // 0xa0
	TArray<FTourMatchPlayerStats> PlayerStats; // 0xb0
};

struct USeqAct_MatchCountdown_TA {
	int32_t CountdownTime; // 0x160
};

struct U__OnlineGameParty_TA__IsPrimaryMemberForPlayer_B1B39FF64091BDE5DE8133A6248B264B {
	FUniqueNetId UserId; // 0x60
};

struct UPBRuleNodeLODQuad {
	float MassiveLODDistanceScale; // 0x98
};

struct UAdManager_TA {
	QWordProperty CacheDuration; // 0x60
	TArray<FCachedAdImageData> CachedAdImages; // 0x68
	TArray<FBillboardData> BillboardZoneMapping; // 0x78
	TArray<FBillboardUpdateRequestData> BillboardMeshUpdateRequests; // 0x88
	ObjectProperty ImageDownloader; // 0x98
	int32_t CurrentAdIndex; // 0xa0
	ObjectProperty CurrentRPC; // 0xa8
};

struct U__StayAsPartySystem_TA__CreateVoteStartEvent_F843CB8A4B6A0D53DF67338E8E345B64 {
	ObjectProperty StartEvent; // 0x60
	ObjectProperty Team; // 0x68
};

struct UFloppyBits_TA {
	ObjectProperty PhysAsset; // 0x78
	FRBCollisionChannelContainer CollisionChannels; // 0x80
	ComponentProperty SkelMesh; // 0x88
};

struct UAnimNodeSlot {
	uint32_t bIsPlayingCustomAnim : 1; // 0x148
	uint32_t bEarlyAnimEndNotify : 1; // 0x148
	uint32_t bSkipBlendWhenNotRendered : 1; // 0x148
	uint32_t bAdditiveAnimationsOverrideSource : 1; // 0x148
	uint32_t bIsBeingUsedByInterpGroup : 1; // 0x148
	uint32_t bDontAddToAlwaysTickArray : 1; // 0x148
	float PendingBlendOutTime; // 0x14c
	int32_t CustomChildIndex; // 0x150
	int32_t TargetChildIndex; // 0x154
	TArray<float> TargetWeight; // 0x158
	float BlendTimeToGo; // 0x168
};

struct UGFxEngine {
	TArray<FGCReference> GCReferences; // 0x60
	int32_t RefCount; // 0x70
	FLoadingMovieMapInfo LoadingScreenInfo; // 0x78
};

struct UAddReservationMessage_X {
	TArray<FReservationPlayerData> Players; // 0x60
	FUniqueNetId PartyLeaderID; // 0x70
	FString ReservationID; // 0xb8
	uint32_t bDisableCrossPlay : 1; // 0xc8
	uint32_t bMarkSplitscreenAsRemote : 1; // 0xc8
};

struct UPsyNetService_TourKicked_TA {
	QWordProperty TournamentID; // 0x90
	ObjectProperty Reason; // 0x98
};

struct USeqAct_SetMaterial {
	ObjectProperty NewMaterial; // 0x160
	int32_t MaterialIndex; // 0x168
};

struct ULanMessage_X {
	QWordProperty Nonce; // 0x60
};

struct UCameraState_Car_TA {
	float InterpToAirRate; // 0xa8
	float InterpToGroundRate; // 0xac
	FInterpVector FocusInterp; // 0xb0
	FInterpVector FocusOffsetInterp; // 0xd8
	FInterpVector DistanceInterp; // 0x100
	float GroundRotationInterpRate; // 0x128
	float GroundRotationInterpRateWall; // 0x12c
	float AirVelocityInfluence; // 0x130
	float AirVelocityInfluenceMaxSpeed; // 0x134
	float DistanceSpeedScale; // 0x138
	float DistanceOffsetMin; // 0x13c
	float MaxSpeedFOV; // 0x140
	float FOVInterpSpeed; // 0x144
	float SupersonicFOV; // 0x148
	float SupersonicFOVInterpSpeed; // 0x14c
	float BouncyChassisScale; // 0x150
	float RollScale; // 0x154
	float GroundNormalInterpRate; // 0x158
	float AirGroundBlend; // 0x15c
	FCameraOrientation ViewOffset; // 0x160
	uint32_t bFirstExecution : 1; // 0x18c
	uint32_t bFullRotationJustChanged : 1; // 0x18c
	uint32_t bFullRotationActive : 1; // 0x18c
	uint32_t bOnGround : 1; // 0x18c
	uint32_t bLastHoldMouseCamera : 1; // 0x18c
	FVector GroundNormal; // 0x190
	float MouseCameraDeadzone; // 0x19c
	float MouseCameraLockWindowInDegrees; // 0x1a0
	int32_t PitchMin; // 0x1a4
	int32_t PitchMax; // 0x1a8
	float MouseCameraLockTimeWindow; // 0x1ac
	float TimeOfLastCameraInput; // 0x1b0
	ObjectProperty Config; // 0x1b8
};

struct UListenServer_TA {
	ObjectProperty GRI; // 0x60
	ObjectProperty AdHocBeacon; // 0x68
	ObjectProperty GameEvent; // 0x70
	TArray<FLoadingPlayer> LoadingPlayers; // 0x78
	uint32_t bRegistered : 1; // 0x88
};

struct ATrigger_LOS {
	TArray<ObjectProperty> PCsWithLOS; // 0x278
};

struct UShopsManager_TA {
	ObjectProperty ServiceArchetype; // 0x60
	ObjectProperty Service; // 0x68
	int32_t ActiveShopID; // 0x70
	DelegateProperty __EventShopItemTextureLoaded__Delegate; // 0x78
	DelegateProperty __OnGetAllShopsResult__Delegate; // 0x90
	DelegateProperty __OnGetCatalogueResult__Delegate; // 0xa8
	DelegateProperty __OnGetCrateShopResult__Delegate; // 0xc0
	DelegateProperty __OnPurchaseResultSuccess__Delegate; // 0xd8
	DelegateProperty __OnFailed__Delegate; // 0xf0
};

struct USavedMove {
	ObjectProperty NextMove; // 0x60
	float TimeStamp; // 0x68
	float delta; // 0x6c
	uint32_t bRun : 1; // 0x70
	uint32_t bDuck : 1; // 0x70
	uint32_t bPressedJump : 1; // 0x70
	uint32_t bDoubleJump : 1; // 0x70
	uint32_t bPreciseDestination : 1; // 0x70
	uint32_t bForceRMVelocity : 1; // 0x70
	uint32_t bForceMaxAccel : 1; // 0x70
	uint32_t bRootMotionFromInterpCurve : 1; // 0x70
	EDoubleClickDir DoubleClickMove; // 0x74
	EPhysics SavedPhysics; // 0x75
	ERootMotionMode RootMotionMode; // 0x76
	FVector StartLocation; // 0x78
	FVector StartRelativeLocation; // 0x84
	FVector StartVelocity; // 0x90
	FVector StartFloor; // 0x9c
	FVector SavedLocation; // 0xa8
	FVector SavedVelocity; // 0xb4
	FVector SavedRelativeLocation; // 0xc0
	FVector RMVelocity; // 0xcc
	FVector Acceleration; // 0xd8
	FRotator Rotation; // 0xe4
	ObjectProperty StartBase; // 0xf0
	ObjectProperty EndBase; // 0xf8
	float CustomTimeDilation; // 0x100
	float AccelDotThreshold; // 0x104
	float RootMotionInterpCurrentTime; // 0x108
	FVector RootMotionInterpCurveLastValue; // 0x10c
};

struct U__TourCheckIn_TA__CheckIn_AC4EB0004B74E0BE758D768B25D537B8 {
