// Created by BlueFire1337
// Updated 2022-01-17
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x672d200;
	constexpr auto GObjects = 0x6759478;
	constexpr auto GWorld = 0x689be48;
}

struct AKSAgent_RevealDrone : AKSAgentBase {
	float MaxFlightSpeed; // 0x320
	float DistanceToFly; // 0x324
	float TimeBetweenPings; // 0x328
	float RevealPeriodDuration; // 0x32c
	FPGame_ReplicatedTimer ReplicatedRevealTimer; // 0x330
	float UpdateReplicatedTimerPeriod; // 0x368
	bool bAppliesScrambleEffectToEnemies; // 0x36c
	TArray<AKSCharacter*> CurrentSweepFoundChars; // 0x3b0
};

struct UDatasmithActorTemplate : UDatasmithObjectTemplate {
	TSet<FName> Layers; // 0x30
	TSet<FName> Tags; // 0x80
};

struct UKSWeaponAttachmentInst_Reactive : UKSWeaponAttachmentInstance {
	uint16_t PersistentStateData; // 0x140
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UANotifyState_WeaponHide_C : UAnimNotifyState {
	bool Is DodgeRollReload Montage; // 0x30
	bool Reverse; // 0x31
	bool Only Hide; // 0x32
	bool Only Unhide; // 0x33
	bool For Emote; // 0x34
	bool Hide Left Prop Only; // 0x35
	bool Hide Right Prop Only; // 0x36
};

struct UWBP_BoxStroke_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* Image_E; // 0x240
	UImage* Image_N; // 0x248
	UImage* Image_S; // 0x250
	UImage* Image_W; // 0x258
	USizeBox* SB_E; // 0x260
	USizeBox* SB_N; // 0x268
	USizeBox* SB_S; // 0x270
	USizeBox* SB_W; // 0x278
	float StrokeSize; // 0x280
	FLinearColor StrokeColor; // 0x284
};

struct UWBP_RogueBioPanel_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_ItemDescSlotNew_C* AbilitySlot; // 0x528
	UImage* background; // 0x530
	UImage* Background_Dimmer; // 0x538
	UImage* EndDecro; // 0x540
	UVerticalBox* FreeRotation; // 0x548
	UWBP_KeyCallout_C* GamepadCallout; // 0x550
	UImage* GradientImage; // 0x558
	UImage* Image_2; // 0x560
	UImage* Image_643; // 0x568
	UVerticalBox* JobPrices; // 0x570
	UImage* Linerule; // 0x578
	UVerticalBox* LockedRogueLabel; // 0x580
	UWBP_ItemDescSlotNew_C* PassiveSlot; // 0x588
	USizeBox* PurchaseButton; // 0x590
	URichTextBlock* RichTextBlock_257; // 0x598
	URichTextBlock* RoleText; // 0x5a0
	UTextBlock* ShortBio; // 0x5a8
	UTextBlock* Text; // 0x5b0
	UTextBlock* Text_2; // 0x5b8
	UWBP_StandardButtonLarge_C* UnlockButton; // 0x5c0
	UWBP_RoguePanelHeader_C* WBP_RoguePanelHeader; // 0x5c8
	UKSRogueDetailsWidget* RogueDetailsWidget; // 0x5d0
	UPUMG_StoreItem* StoreItem; // 0x5d8
	bool IsPurchasable; // 0x5e0
};

struct UWBP_VoucherAcquisition_C : UKSVoucherAcquisition {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnShow; // 0x528
	UWBP_StandardButtonMedium_C* ClaimButton; // 0x530
	UKSAsyncImage* DLCImage; // 0x538
	UScaleBox* FullSplashBG; // 0x540
	UImage* Image; // 0x548
	UImage* Image_139; // 0x550
	UHorizontalBox* MultipleVoucherContainer; // 0x558
	UScrollBox* MultipleVoucherScrollBox; // 0x560
	UOverlay* Overlay_52; // 0x568
	UCanvasPanel* RedeemingOverlay; // 0x570
	UTextBlock* Subtitle; // 0x578
	UThrobber* Throbber_164; // 0x580
	UWBP_Header1_C* WBP_Header1; // 0x588
	UWBP_ModalPopupContainer_C* WBP_ModalPopupContainer; // 0x590
	UPUMG_StoreItem* DLCVoucher; // 0x598
	bool IsRedeeming; // 0x5a0
	UAkAudioEvent* ShowVoucherAcquisitionSFX; // 0x5a8
	TArray<UPUMG_StoreItem*> VoucherItems; // 0x5b0
	float ScrollDirection; // 0x5c0
};

struct UMovieScene : UMovieSceneSignedObject {
	TArray<FMovieSceneSpawnable> Spawnables; // 0x50
	TArray<FMovieScenePossessable> Possessables; // 0x60
	TArray<FMovieSceneBinding> ObjectBindings; // 0x70
	TMap<FName, FMovieSceneObjectBindingIDs> BindingGroups; // 0x80
	TArray<UMovieSceneTrack*> MasterTracks; // 0xd0
	UMovieSceneTrack* CameraCutTrack; // 0xe0
	FMovieSceneFrameRange SelectionRange; // 0xe8
	FMovieSceneFrameRange PlaybackRange; // 0xf8
	FFrameRate TickResolution; // 0x108
	FFrameRate DisplayRate; // 0x110
	EMovieSceneEvaluationType EvaluationType; // 0x118
	EUpdateClockSource ClockSource; // 0x119
	FSoftObjectPath CustomClockSourcePath; // 0x120
	TArray<FMovieSceneMarkedFrame> MarkedFrames; // 0x138
};

struct UANotifyState_ShowTablet_C : UAnimNotifyState {
	bool bReverse; // 0x30
	bool bKeepTabletUnhidden; // 0x31
};

struct UTextureLightProfile : UTexture2D {
	float Brightness; // 0xe8
	float TextureMultiplier; // 0xec
};

struct UWBP_CosmeticItem_Banner_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_ButtonSlot_Cosmetic_C* Button; // 0x528
	UWBP_AsyncIcon_C* WBP_AsyncIcon; // 0x530
	FMulticastInlineDelegate OnItemHovered; // 0x538
	FMulticastInlineDelegate OnItemUnhovered; // 0x548
	FMulticastInlineDelegate OnItemClicked; // 0x558
	UPlatformInventoryItem* PlatformItem; // 0x568
	UAkAudioEvent* HoverBannerItemSFX; // 0x570
	UAkAudioEvent* ClickBannerItemSFX; // 0x578
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x430
	char bEnableMaterialParameterCaching : 1; // 0x450
};

struct UGizmoAxisTranslationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Parameter; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurTranslationAxis; // 0xbc
	FVector CurTranslationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct AKSKillCamObjectCamera : AActor {
	UKSSpringArmComponent* MainCameraBoom; // 0x220
	UCameraComponent* MainCameraComponent; // 0x228
	USceneComponent* EmptyComponent; // 0x230
};

struct UMovieSceneBoolSection : UMovieSceneSection {
	bool DefaultValue; // 0xe0
	FMovieSceneBoolChannel BoolCurve; // 0xe8
};

struct UPGameBTTask_AlwaysReturn : UBTTaskNode {
	EBTNodeResult AlwaysReturn; // 0x70
};

struct USkyLightComponent : ULightComponentBase {
	ESkyLightSourceType SourceType; // 0x238
	UTextureCube* Cubemap; // 0x240
	float SourceCubemapAngle; // 0x248
	int32_t CubemapResolution; // 0x24c
	float SkyDistanceThreshold; // 0x250
	bool bCaptureEmissiveOnly; // 0x254
	bool bLowerHemisphereIsBlack; // 0x255
	FLinearColor LowerHemisphereColor; // 0x258
	float OcclusionMaxDistance; // 0x268
	float Contrast; // 0x26c
	float OcclusionExponent; // 0x270
	float MinOcclusion; // 0x274
	FColor OcclusionTint; // 0x278
	EOcclusionCombineMode OcclusionCombineMode; // 0x27c
	UTextureCube* BlendDestinationCubemap; // 0x328
};

struct UKSQuip : UKSRadialMenuItem {
	FName OverriddenAudioEventName; // 0x2b8
	TSoftObjectPtr<UAkAudioEvent> QuipAudioEvent; // 0x2c0
};

struct UKSModInst_ApplyDebuffOnDamage : UKSModInst_OnDamageOther {
	TArray<UKSPlayerMod*> DebuffsToApply; // 0x1d0
	bool bGiveDebuffsUniquely; // 0x1e0
	float DebuffDuration; // 0x1e4
};

struct UKSAnnouncementQueueWidget : UKSWidget {
	bool IsBusy; // 0x520
	FMulticastInlineDelegate OnReadyForNextAnnouncement; // 0x528
};

struct UKSViewedPawnDamageDisplay : UKSViewedPawnWidget {
	float StackingWait; // 0x550
	bool TetherToEventLocation; // 0x554
	int32_t MaxNumDamageWidgetsOnScreen; // 0x558
	UCanvasPanel* DamageNumberContainer; // 0x560
	TMap<UDamageType*, FSpecialDamageColors> SpecialDamageTypes; // 0x568
	TArray<UDamageNumberDisplayWidget*> CurrentDamageNumbersOnScreen; // 0x5b8
	TArray<UDamageNumberDisplayWidget*> DamageNumbersPool; // 0x5c8
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct UPhysicsCollisionHandler : UObject {
	float ImpactThreshold; // 0x28
	float ImpactReFireDelay; // 0x2c
	USoundBase* DefaultImpactSound; // 0x30
	float LastImpactSoundTime; // 0x38
};

struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x588
	char bIsFrozenRendering : 1; // 0x588
	char bIsOrbitingSelectedActor : 1; // 0x588
	char bOrbitPivotUseCenter : 1; // 0x588
	char bEnableBufferVisualization : 1; // 0x588
	char bEnableBufferVisualizationFullMode : 1; // 0x588
	char bIsBufferVisualizationInputSetup : 1; // 0x588
	char bLastDisplayEnabled : 1; // 0x588
	UDrawFrustumComponent* DrawFrustum; // 0x590
	AActor* SelectedActor; // 0x598
	UPrimitiveComponent* SelectedComponent; // 0x5a0
	FHitResult SelectedHitPoint; // 0x5a8
	APlayerController* OriginalControllerRef; // 0x630
	UPlayer* OriginalPlayer; // 0x638
	float SpeedScale; // 0x640
	float InitialMaxSpeed; // 0x644
	float InitialAccel; // 0x648
	float InitialDecel; // 0x64c
};

struct UWBP_PurchaseConfirmationButton_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnGamepadHover; // 0x528
	UWBP_StoreDiscountTagPriceButton_C* DiscountTag; // 0x530
	UWBP_KeyCallout_C* GamepadPrompt; // 0x538
	UOverlay* GamepadPromptHolder; // 0x540
	UWBP_ButtonStacked_C* MainButton; // 0x548
	UOverlay* PressAndHoldWrapper; // 0x550
	UWBP_StorePriceTag_C* PriceTag; // 0x558
	UImage* ProgressCircle; // 0x560
	UTextBlock* UnlockText; // 0x568
	bool InHoverState; // 0x570
	UPUMG_PortalOffer* PortalOffer; // 0x578
	UPUMG_StoreItemPrice* StorePrice; // 0x580
	FMulticastInlineDelegate PurcaseItemWithPrice; // 0x588
	FMulticastInlineDelegate PurcaseItemWithPortalOffer; // 0x598
	bool IsHoldingConfirm; // 0x5a8
	FMulticastInlineDelegate OnRawClick; // 0x5b0
	int32_t PurchaseQuantity; // 0x5c0
	UPUMG_StoreItem* StoreItem; // 0x5c8
	bool IsSingleAction; // 0x5d0
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FPartyReservation PendingReservation; // 0x2f0
	EClientRequestType RequestType; // 0x340
	bool bPendingReservationSent; // 0x341
	bool bCancelReservation; // 0x342
};

struct UWBP_RogueMasteryPortrait_C : UUserWidget {
	UKSAsyncImage* JobIcon; // 0x238
	UImage* MasteryBorder_1to4; // 0x240
	UImage* MasteryBorder_5to9; // 0x248
	UImage* MasteryBorder_Max; // 0x250
	UWidgetSwitcher* MasteryFrameSwitcher; // 0x258
	UWBP_RogueMasteryIcon_C* MasteryIcon; // 0x260
	AKSPlayerState* PlayerOwner; // 0x268
	UKSJobItem* JobItem; // 0x270
	UKSPersistentPlayerData* PersistentPlayerOwner; // 0x278
};

struct UWBP_BattlePass_Upsell_Button_C : UKSBattlepassUpsellWidgetButton {
	FPointerToUberGraphFrame UberGraphFrame; // 0x580
	UWidgetAnimation* Elite_Button_Focus; // 0x588
	UWidgetAnimation* Base_Button_Focus; // 0x590
	UWidgetAnimation* Confirmation_Elite_Button_Focus; // 0x598
	UWBP_KeyCallout_C* GamepadPrompt; // 0x5a0
	UButton* HitTarget; // 0x5a8
	UOverlay* PressAndHoldWrapper; // 0x5b0
	UImage* ProgressCircle; // 0x5b8
	USizeBox* SizeBox_2; // 0x5c0
	UThrobber* Throbber_117; // 0x5c8
	int32_t ButtonLayoutIndex; // 0x5d0
	FMulticastInlineDelegate OnClickedEvt; // 0x5d8
	UPUMG_StoreItem* MyStoreItem; // 0x5e8
	bool IsHoldingConfirm; // 0x5f0
	UAkAudioEvent* Click Upsell Button SFX; // 0x5f8
	UAkAudioEvent* Hover Upsell Button SFX; // 0x600
	bool Confirm Purchase Active Enabled; // 0x608
	UAkAudioEvent* Click Purchase Upsell Button SFX; // 0x610
	float Text Width; // 0x618
};

struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bIsDirty : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UPlayerInfoPrevwLoadoutComponent : UPreviewActorLoadoutComponent {
	UKSJobItem* CurrentJob; // 0xb8
	TSoftObjectPtr<UKSJobItem> FailSafeJob; // 0xc0
	TMap<UKSItem*, UKSItem*> SkinMap; // 0xe8
	TWeakObjectPtr<UKSPlayerInfo> WeakPlayerInfo; // 0x138
};

struct UKSOverlayTabHubRouteData : UObject {
	FName RedirectViewName; // 0x28
	UPUMG_Widget* LandingWidgetInView; // 0x30
};

struct UParticleModuleVectorFieldScaleOverLife : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScaleOverLife; // 0x30
	FRawDistributionFloat VectorFieldScaleOverLifeRaw; // 0x38
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct UMovieSceneMediaTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> MediaSections; // 0x58
};

struct UKSActivityRewardCondition_DamageHistoryCount : UKSActivityRewardCondition {
	int32_t MinDamageHistoryEntries; // 0x30
	int32_t MaxDamageHistoryEntries; // 0x34
};

struct UKSCustomizationSelection : UKSWidget {
	TArray<FRogueCustomizationRelatedInfo> RogueCustomizationRelatedInfos; // 0x528
	TArray<EMercCosmeticSlot> ActiveCosmeticSlots; // 0x538
	int32_t TabIndex; // 0x548
};

struct UAnimNotify_PlaySkinnedParticleEffect : UAnimNotify_PlayParticleEffect {
	FName SkinKeyword; // 0x90
};

struct UKSTeamKillTracker : UKSAccoladeTracker {
	TArray<FPlayerTeamTracker> PlayerTeamKillTracker; // 0xa0
	int32_t TeamKillRequirement; // 0xb0
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x280
	UBoxComponent* PreviewInfluenceBox; // 0x288
	UBoxComponent* PreviewCaptureBox; // 0x290
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UGizmoComponentWorldTransformSource : UGizmoBaseTransformSource {
	USceneComponent* Component; // 0x48
	bool bModifyComponentOnTransform; // 0x50
};

struct UKSWeaponSkeletalMeshComponent : UKSSkeletalMeshComponent {
	bool bApplySkeletalMeshBoundsParameterToMaterials; // 0xda0
	FName SkeletalMeshBoundsParameterName; // 0xda4
	bool bApplySkeletalLengthParameterToMaterials; // 0xdac
	FName SkeletalMeshLengthParameterName; // 0xdb0
	bool bApplySkeletalWidthParameterToMaterials; // 0xdb8
	FName SkeletalMeshWidthParameterName; // 0xdbc
	bool bApplySkeletalHeightParameterToMaterials; // 0xdc4
	FName SkeletalMeshHeightParameterName; // 0xdc8
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x40
};

struct UKSPlayerMod_Charge : UKSPlayerMod {
	bool bIsMultiplier; // 0x330
	float ChargeMultiplier; // 0x334
	bool bIsDiscount; // 0x338
	int32_t ChargeDiscount; // 0x33c
};

struct UKSBTD_DestructibleState : UBTDecorator_BlackboardBase {
	FKSDestructibleStateFilter DestructibleStateFilter; // 0x90
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UKSLimitDeployablesRuleComponent : UKSGameRuleComponent {
	uint32_t LimitThreshold; // 0xb0
	bool bLimitPerAsset; // 0xb4
};

struct UKSPlayerMod_StartingEquipment : UKSPlayerMod {
	TSoftObjectPtr<UKSItem> EquipmentAsset; // 0x330
};

struct UPUMG_FriendDataFactory : UPUMG_DataFactory {
	FMulticastInlineDelegate OnFriendDataUpdated; // 0x38
	FMulticastInlineDelegate OnFriendAddSuccess; // 0x48
	FMulticastInlineDelegate OnFriendAddError; // 0x58
	FMulticastInlineDelegate FriendInviteReceived; // 0x68
	FMulticastInlineDelegate OnFriendAdded; // 0x78
	FMulticastInlineDelegate OnFriendRejected; // 0x88
	int32_t OnlineFriends; // 0x98
	int32_t TotalFriends; // 0x9c
	TArray<FPUMG_FriendData> CachedFriends; // 0xa0
	TArray<FPUMG_FriendData> CachedPendingFriends; // 0xb0
	TArray<FPUMG_FriendData> CachedFriendRequests; // 0xc0
	float FriendsListUpdatePollInterval; // 0x100
	FTimerHandle FriendsListUpdatePollingTimerHandle; // 0x108
	bool IsFriendsListUpdatePollingEnabled; // 0x110
};

struct UTablet_Animinstance_C : UKSTabletAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
	FAnimNode_Root AnimGraphNode_Root; // 0x368
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x418
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x488
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x550
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x618
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x6a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6e0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x768
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x7a8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x868
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x980
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9b0
	bool Is Fully Opened; // 0x9e0
	bool Is Fully Closed; // 0x9e1
};

struct UWBP_WeaponMilestoneEntry_C : UKSWeaponMilestoneEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x528
	UWidgetAnimation* animHover; // 0x530
	UHorizontalBox* CardContent; // 0x538
	UWidgetSwitcher* CardContentStateSwitcher; // 0x540
	UImage* ChallengeBkg_2; // 0x548
	UImage* ChallengeBkg_3; // 0x550
	UWidgetSwitcher* ChallengeBkg_Switcher; // 0x558
	UTextBlock* ChallengeDescription; // 0x560
	UWBP_ProgressEarnedBar_C* ChallengeProgressBar; // 0x568
	UTextBlock* ChallengeProgressText; // 0x570
	UVerticalBox* Content_active; // 0x578
	UButton* HitTarget; // 0x580
	UImage* Image_181; // 0x588
	UImage* Image_370; // 0x590
	UOverlay* Locked; // 0x598
	UOverlay* LockedBkg; // 0x5a0
	UTextBlock* LockedDescription; // 0x5a8
	UTextBlock* LockedTierText; // 0x5b0
	UHorizontalBox* ProgressGroup; // 0x5b8
	UKSAsyncImage* RewardImage; // 0x5c0
	UTextBlock* RewardQtyText; // 0x5c8
	UWidgetSwitcher* RewardSwitcher; // 0x5d0
	UOverlay* Root; // 0x5d8
	UImage* SelectionFrame; // 0x5e0
	UImage* TopLineRule; // 0x5e8
	UOverlay* UnlockedBkg; // 0x5f0
	EChallengeEntry_Card_State CurrentVisualState; // 0x5f8
	FName WeekTableRowName; // 0x5fc
	FActivitySequenceRow CurrentActivitySequence; // 0x608
	FMulticastInlineDelegate OnMilestoneSelected; // 0x638
	UAkAudioEvent* ButtonClickSound; // 0x648
	UAkAudioEvent* ButtonHoverSound; // 0x650
	int32_t MilestoneIndex; // 0x658
};

struct ATemplateSequenceActor : AActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x228
	UTemplateSequencePlayer* SequencePlayer; // 0x240
	FSoftObjectPath TemplateSequence; // 0x248
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x260
};

struct UWBP_RogueListingOfferPanel_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnHoverAnim; // 0x528
	UVerticalBox* BannerContainer; // 0x530
	UImage* BtnFill; // 0x538
	UImage* BtnStroke; // 0x540
	UWBP_StoreDiscountTag_C* DiscountTag; // 0x548
	UTextBlock* DLCDesc; // 0x550
	UTextBlock* DLCName; // 0x558
	UVerticalBox* DLCNameWrapper; // 0x560
	UWBP_KeyCallout_C* GamepadPrompt; // 0x568
	UImage* Image_326; // 0x570
	UWBP_AsyncIcon_C* ItemImage; // 0x578
	UImage* RarityDecro_2; // 0x580
	UTextBlock* RefundTotal_2; // 0x588
	UBorder* RepRefund; // 0x590
	UWBP_StorePanelButton_C* WBP_StorePanelButton; // 0x598
	UPUMG_StoreItem* StoreItem; // 0x5a0
	FMulticastInlineDelegate OnOfferClicked; // 0x5a8
};

struct UAISenseConfig_Blueprint : UAISenseConfig {
	UAISense_Blueprint* Implementation; // 0x48
};

struct UWBP_PlayerIdentity_Avatar_C : UKSWidget {
	UWBP_AsyncIcon_C* AvatarIcon; // 0x520
};

struct AKSLootDrop : AKSItemDrop {
	int32_t Amount; // 0x3b0
};

struct UDragDropOperation : UObject {
	FString Tag; // 0x28
	UObject* Payload; // 0x38
	UWidget* DefaultDragVisual; // 0x40
	EDragPivot Pivot; // 0x48
	FVector2D Offset; // 0x4c
	FMulticastInlineDelegate OnDrop; // 0x58
	FMulticastInlineDelegate OnDragCancelled; // 0x68
	FMulticastInlineDelegate OnDragged; // 0x78
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x430
	UNavAreaBase* AreaClass; // 0x438
	FColor ShapeColor; // 0x440
	char bDrawOnlyIfSelected : 1; // 0x444
	char bShouldCollideWhenPlacing : 1; // 0x444
	char bDynamicObstacle : 1; // 0x444
};

struct UWBP_AmmoCount_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* AmmoActive; // 0x240
	UImage* AmmoInactive; // 0x248
	UTexture2D* AmmoTexture; // 0x250
	UTexture2D* InactiveAmmoTexture; // 0x258
};

struct UPUMG_PopupManager : UPUMG_Widget {
	TArray<FPUMG_PopupConfig> PopupQueue; // 0x4d0
	int32_t m_nPopupId; // 0x4e0
	FText CommittedText; // 0x5c8
};

struct UPUMG_SafeZone : USafeZone {
	bool bBorderLeft; // 0x140
	bool bBorderRight; // 0x141
	bool bBorderTop; // 0x142
	bool bBorderBottom; // 0x143
	bool bForceDrawBorders; // 0x144
};

struct USteamNetConnection : UIpConnection {
	bool bIsPassthrough; // 0x1b20
};

struct UKSActivityRequirement_Experiment : UKSActivityRequirement {
	FString ExperimentName; // 0x30
	bool RequireEnabled; // 0x40
};

struct ULevelSequenceDirector : UObject {
	ULevelSequencePlayer* Player; // 0x28
};

struct AKSDefensePoint : AKSMapPoint {
	AKSObjectiveBase* RelevantObjective; // 0x258
	TArray<AActor*> AssignedDefenders; // 0x260
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x680
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x690
	FGuid GenerationGuid; // 0x6a0
};

struct UGameplayTasksComponent : UActorComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x110
};

struct UBakedOcclusionLUT : UObject {
	TSet<uint32_t> LUT; // 0x28
	TArray<uint16_t> OctreeSampleMap; // 0x78
	TArray<FIntVector> OctreeLocations; // 0x88
};

struct ULandscapeSettings : UDeveloperSettings {
	int32_t MaxNumberOfLayers; // 0x38
};

struct ALobbyPlayerController : APGame_PlayerController {
	AHUD* PendingHUDClass; // 0x6b8
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x220
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x228
};

struct UKSEquipmentManagerComponent : UActorComponent {
	TMap<FGameplayTag, AKSEquipment*> EquippedInventory; // 0xb0
	TArray<AKSEquipment*> SlotlessInventory; // 0x150
	FGameplayTagContainer MultiUseEquipPoints; // 0x160
	TScriptInterface<IKSEquipmentManagerOwner> EquipmentManagerOwner; // 0x180
	FMulticastInlineDelegate OnEquipmentAddedDel; // 0x190
	FMulticastInlineDelegate OnEquipmentRemovedDel; // 0x1b8
	float EmoteCooldownExpireTime; // 0x208
	float QuipCooldownExpireTime; // 0x20c
	float CommunicationCooldownExpireTime; // 0x210
	float RadialMenuItemCooldownExpireTime; // 0x214
};

struct UKSActivityBehavior : UObject {
	TWeakObjectPtr<AKSPlayerController> PlayerController; // 0x28
	TWeakObjectPtr<UKSActivityInstance> WeakActivityInstance; // 0x30
};

struct UPersistentPlayerLoadoutComponent : UPreviewActorLoadoutComponent {
	TMap<UKSItem*, UKSItem*> SkinMap; // 0xc8
	UKSJobItem* JobToUse; // 0x118
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UKSNoFlyZoneTracker : UKSAccoladeTracker {
	int32_t QuantityDowns; // 0xa0
	TMap<AKSPlayerState*, int32_t> PlayerDowns; // 0xa8
};

struct AKSGameMode_RoundGame : AKSGameMode {
	bool bRunRespawnAndEliminationLogicBetweenRounds; // 0xf88
	float PostRoundDuration; // 0xf8c
	float FinalPostRoundDuration; // 0xf90
	bool bSkipSelectionCinematicAfterFirstRound; // 0xf94
	FName RoundStateSetupComplete; // 0xf98
	int32_t RoundNumber; // 0xfa0
	int32_t RoundsNeededToWin; // 0xfa4
	int32_t TotalNumberOfRounds; // 0xfa8
	bool bPlayersCanRestartDuringRoundInProgress; // 0xfac
	bool bHoldPlayerRestartUntilFirstRoundSetup; // 0xfad
	bool bWinRoundByElimination; // 0xfae
	bool bAwardPointOnDraw; // 0xfaf
	float RoundSetupTime; // 0xfb0
	float RoundDuration; // 0xfb4
	FName RoundStartPhase; // 0xfb8
	bool bNewPawnOnRoundStart; // 0xfc0
	AKSTeamState* WinByEliminationTeam; // 0xfd0
	int32_t NumberOfConsecutiveLossesToEnableEpicGroupSiteGuarantees; // 0xff4
	bool bKillDownedPlayersAtEndOfRound; // 0xff8
	bool bSpareWinningDownedPlayers; // 0xff9
	EPlayerInfoInventoryRestoreType InventoryRestore; // 0xffb
	bool bAllowPlayersToKeepInventoryBetweenRounds; // 0xffc
	bool bRequirePlayerToBeAlive; // 0xffd
	bool bRequirePlayerToBeStanding; // 0xffe
	bool bRequirePlayerToBeOnWinningTeam; // 0xfff
	bool bSideSwapWipesEquipment; // 0x1000
	bool bRestoreEquipment; // 0x1001
	FGameplayTagQuery InventoryRestoreEquipPointRequirements; // 0x1008
	bool bRestoreSlotlessEquipment; // 0x1050
	bool bRestoreNonEquipment; // 0x1051
	TArray<FInventoryRestoreInfo> GuaranteedInventory; // 0x1058
	int32_t FlipTeamSideFrequency; // 0x1068
	int32_t MaxTeamSideFlipsPerMatch; // 0x106c
	bool bSideSwapClearsConsecutiveLosses; // 0x1070
	int32_t TeamSideFlipsThisMatch; // 0x1074
	int32_t LatestTeamSideFlipRoundNumber; // 0x1078
	bool bBlockWeaponsPostRound; // 0x107c
};

struct UKSMediaPlayerWidget : UKSWidget {
	UDataTable* MediaPlayerPlaylistEntries; // 0x520
	bool bOnlyWatchFirstEntry; // 0x538
};

struct UKSItem : UPlatformInventoryItem {
	TSoftClassPtr<UObject> ItemDropClass; // 0x1b8
	int32_t ItemPrice; // 0x1e0
	FGameplayTag ItemType; // 0x1e4
	bool bUsePreviewIconInfo; // 0x1ec
	UImageIconInfo* PreviewIconInfo; // 0x1f0
	UTexture2D* DefaultItemIcon; // 0x1f8
	TSoftClassPtr<UObject> SpecialItemWidgetClass; // 0x200
	FColor ColorCode; // 0x228
	FPrimaryAssetRules Rules; // 0x22c
	TArray<FGameplayTag> ItemTags; // 0x238
	int32_t AlsoInBundleLootId; // 0x248
};

struct UKSSortableVerticalBox : UVerticalBox {
	FDelegate OnSortCompareChildrenEvent; // 0x138
};

struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	FGameplayTag InjectionTag; // 0x70
	UBehaviorTree* DefaultBehaviorAsset; // 0x78
	UBehaviorTree* BehaviorAsset; // 0x80
};

struct UAkTVOSInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkAudioSession AudioSession; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa0
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xc8
};

struct UBlackboardKeyType_Object : UBlackboardKeyType {
	UObject* BaseClass; // 0x30
};

struct UMaterialExpressionDDY : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct UWBP_QuickPlay_QueueTypeHeader_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UTextBlock* QueueType; // 0x240
};

struct UParticleModuleAccelerationDragScaleOverLife : UParticleModuleAccelerationBase {
	UDistributionFloat* DragScale; // 0x38
	FRawDistributionFloat DragScaleRaw; // 0x40
};

struct UPCom_SimpleTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
};

struct ULiveLinkComponent : UActorComponent {
	FMulticastInlineDelegate OnLiveLinkUpdated; // 0xb0
};

struct AKSCinematicSequenceManager : AActor {
	ALevelSequenceActor* SequenceActor; // 0x220
	ULevelSequence* Sequence; // 0x228
	TArray<AKSCinematicCharacterManager*> CinematicCharacterHandles; // 0x230
	AKSLobbyCharacter* CinematicCharacterClass; // 0x240
};

struct URecoilProfileAsset : UDataAsset {
	FRecoilProfile RecoilProfile; // 0x30
	bool DontPlayRecoilMontage; // 0x21c
};

struct UKSPlayerJobSelectWidgetBase : UKSWidget {
	UKSJobSelectionManager* JobSelectionManager; // 0x520
	UKSJobSelectionComponent* JobSelectionComponent; // 0x528
	TArray<UJobSelectionEntryDetails*> JobDetailEntries; // 0x530
	EPlayerSelectionState CurrentPlayerSelectionState; // 0x540
	TArray<UJobSelectionEntryDetails*> EnemyJobDetailsEntries; // 0x548
	TWeakObjectPtr<UKSJobSelectionComponent> BoundEnemyJobSelectionComponent; // 0x558
	TWeakObjectPtr<UKSJobSelectionComponent> BoundLocalJobSelectionComponent; // 0x560
};

struct ANavSystemConfigOverride : AActor {
	UNavigationSystemConfig* NavigationSystemConfig; // 0x220
	ENavSystemOverridePolicy OverridePolicy; // 0x228
	char bLoadOnClient : 1; // 0x229
};

struct UGranularSynth : USynthComponent {
	USoundWave* GranulatedSoundWave; // 0x6e0
};

struct UKSLOSEvaluator : UKSActorEvaluator {
	bool MatchOnLOSBlocked; // 0x28
	ECollisionChannel LOSChannel; // 0x29
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct AWaypointBeacon_C : AKSPingBeaconBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UParticleSystemComponent* ParticleSystem; // 0x2e8
};

struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	FBlackboardKeySelector ActorToCheck; // 0x68
	EGameplayContainerMatchType TagsToMatch; // 0x90
	FGameplayTagContainer GameplayTags; // 0x98
	FString CachedDescription; // 0xb8
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x220
};

struct UKSAcquisitionManager : UPUMG_AcquisitionManager {
	FMulticastInlineDelegate OnAcquisitionReady; // 0x58
	TArray<UKSAcquisition*> QueuedAcquisitions; // 0x78
	UKSAcquisition* PendingAcquisition; // 0x88
	TArray<UKSEquipOnAcquisitionData*> PendingEquipables; // 0x90
};

struct UComboButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct USlateVectorArtData : UObject {
	TArray<FSlateMeshVertex> VertexData; // 0x28
	TArray<uint32_t> IndexData; // 0x38
	UMaterialInterface* Material; // 0x48
	FVector2D ExtentMin; // 0x50
	FVector2D ExtentMax; // 0x58
};

struct UMaterialExpressionMaterialFunctionCall : UMaterialExpression {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UKSJobSelectionRules_Casual : UKSJobSelectionRules {
	float TimeToPick; // 0xd8
};

struct AKSProjectile_ProximityGrenade : AKSProjectile_Grenade {
	UKSProximityComponent* ProximityComponent; // 0x9f8
	bool bInitializeProximityCheckingOnStopped; // 0xa00
};

struct UKSFloatTickLerpWidgetBase : UUserWidget {
	FMulticastInlineDelegate OnLerpComplete; // 0x238
	float LerpTime; // 0x248
	float LerpPower; // 0x24c
};

struct UMaterialBillboardComponent : UPrimitiveComponent {
	TArray<FMaterialSpriteElement> Elements; // 0x430
};

struct UMovieSceneVectorSection : UMovieSceneSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe0
	int32_t ChannelsUsed; // 0x360
};

struct UTickAnimationManager : UObject {
	TMap<FName, FTickAnimationParams> AnimsByName; // 0x28
};

struct UWBP_LoginRewardItem_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* ClaimAnim; // 0x528
	UImage* BorderGlow; // 0x530
	UImage* ClaimedBottomDecro; // 0x538
	UImage* ClaimedBottomDecro_2; // 0x540
	UImage* ClaimedCheckmarkEpic; // 0x548
	UImage* ClaimedCheckmarkLegendary; // 0x550
	UImage* ClaimedCheckmarkRare; // 0x558
	UWidgetSwitcher* ClaimedCheckmarkSwitcher; // 0x560
	UImage* ClaimedCheckmarkUncommon; // 0x568
	UImage* ClaimedDimmer; // 0x570
	UOverlay* ClaimedOverlay; // 0x578
	UOverlay* CurrentReward; // 0x580
	UImage* EdgeFlareLeft; // 0x588
	UImage* EdgeFlareRight; // 0x590
	UOverlay* EffectContainer; // 0x598
	UImage* Gradient; // 0x5a0
	UButton* HitTarget; // 0x5a8
	UImage* IconOverlayGlow; // 0x5b0
	UBorder* RewardLabel; // 0x5b8
	UTextBlock* RewardLabelText; // 0x5c0
	UImage* RewardStroke; // 0x5c8
	UImage* SelectedGlow; // 0x5d0
	UImage* UnclaimedDimmer; // 0x5d8
	UOverlay* UnclaimedOverlay; // 0x5e0
	UWBP_KSCosmeticItemDisplay_C* WBP_KSCosmeticItemDisplay; // 0x5e8
	FMulticastInlineDelegate ClaimAnimationComplete; // 0x5f0
	FLoginRewardItem RewardItem; // 0x600
	float AnimationCompleteDelay; // 0x610
	TMap<int32_t, UDataTable*> CustomRarity; // 0x618
	bool AllowToClaim; // 0x668
	FMulticastInlineDelegate OnRewardHovered; // 0x670
	FMulticastInlineDelegate OnRewardUnhovered; // 0x680
	UAkAudioEvent* AKHoverRewardListEntry; // 0x690
	FMulticastInlineDelegate OnRewardClicked; // 0x698
	FGameplayTagContainer CustomRarityTag; // 0x6a8
};

struct UCensorTable : UObject {
	FSoftObjectPath CensorTablePath; // 0x28
};

struct UKSPlayerMod_DamageTaken : UKSPlayerMod {
	TArray<UDamageType*> ValidDamageTypes; // 0x330
	TArray<EHitLocationType> ValidHitLocations; // 0x340
	float DamageTakenMultiplier; // 0x350
	TSoftObjectPtr<UParticleSystem> DamageTakenParticle; // 0x358
	bool ImmuneToNonDamageEffects; // 0x380
	bool NotifyDamageReduction; // 0x381
	TSoftObjectPtr<UAkAudioEvent> HitBodyAudioEvent; // 0x388
	TSoftObjectPtr<UAkAudioEvent> HitHeadAudioEvent; // 0x3b0
	TSoftObjectPtr<UAkAudioEvent> HitByAudioEvent; // 0x3d8
};

struct UWBP_MatchSummary_StatEntry_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UTextBlock* StatNameText; // 0x528
	UTextBlock* StatValueText; // 0x530
	bool NewVar_1; // 0x538
	FText StatName; // 0x540
	FText StatValue; // 0x558
};

struct UKSBTTask_SetWaypointDefenseTimer : UBTTaskNode {
	FBlackboardKeySelector WayPoint; // 0x70
	FBlackboardKeySelector DefenseTimer; // 0x98
};

struct UKSShopSoundLibrary : UKSUISoundLibrary {
	UAkAudioEvent* ShopOpen; // 0x28
	UAkAudioEvent* ShopClose; // 0x30
	UAkAudioEvent* PurchaseSucceeded; // 0x38
	UAkAudioEvent* PurchaseFailed; // 0x40
};

struct UNetworkSettings : UDeveloperSettings {
	char bVerifyPeer : 1; // 0x38
	char bEnableMultiplayerWorldOriginRebasing : 1; // 0x38
	int32_t MaxRepArraySize; // 0x3c
	int32_t MaxRepArrayMemory; // 0x40
	TArray<FNetworkEmulationProfileDescription> NetworkEmulationProfiles; // 0x48
};

struct UWBP_StandardButtonSmall_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* ShowButton; // 0x528
	UWidgetAnimation* OnClick; // 0x530
	UWidgetAnimation* Highlight; // 0x538
	UImage* BtnBkg; // 0x540
	UImage* BtnBkgHover; // 0x548
	UImage* BtnBkgRedButton; // 0x550
	UImage* BtnClickImage; // 0x558
	UImage* BtnEdge; // 0x560
	UImage* BtnEdgeHover; // 0x568
	UImage* BtnFrame; // 0x570
	UImage* BtnFrameHover; // 0x578
	UOverlay* BtnStandardWrapper; // 0x580
	UTextBlock* ButtonText; // 0x588
	UButton* HitTarget; // 0x590
	UOverlay* HoverWrapper; // 0x598
	UImage* KeyPrompt; // 0x5a0
	UCanvasPanel* KeyPromptContainer; // 0x5a8
	USizeBox* SizeWrapper; // 0x5b0
	FMulticastInlineDelegate OnClicked; // 0x5b8
	FMulticastInlineDelegate OnHovered; // 0x5c8
	FMulticastInlineDelegate OnUnhovered; // 0x5d8
	FText DefaultButtonText; // 0x5e8
	float DefaultWidth; // 0x600
	bool ShowPromptOnFocus; // 0x604
	bool IsRedButton; // 0x605
	float DefaultHeight; // 0x608
	UAkAudioEvent* ClickSmallBtnSFX; // 0x610
	UAkAudioEvent* HoverSmallBtnSFX; // 0x618
	FKey PromptKey; // 0x620
	bool IsConfirm; // 0x638
	bool IsCancel; // 0x639
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UTracerStaticMeshComponent : UStaticMeshComponent {
	FVector start; // 0x4f0
	FVector end; // 0x4fc
	float TravelSpeed; // 0x508
	bool bDestroyOnDestinationReached; // 0x50c
	bool bEnableTravel; // 0x50d
	FMulticastInlineDelegate OnTracerParticleReachedDestiniationDel; // 0x510
};

struct UGuidedMenuCalloutsViewRedirector : UPUMG_ViewRedirecter {
	UDataTable* GuidedCalloutsTable; // 0x28
};

struct UKSModInst_PilotOnActivation : UKSModInst_Activated {
	float RepossessionDelay; // 0x478
	float VehicleDestroyDelay; // 0x47c
	bool bDisplayTransitionPPE; // 0x480
	FKSSpecialEffect TransitionPPE; // 0x488
	bool bDisplayFadeOnUnpossessCharacter; // 0x4d8
	float FadeOnUnpossessDuration; // 0x4dc
	bool bRestrictCharacterRotation; // 0x4e0
	bool bShouldCrouchOnActivation; // 0x4e1
	TArray<UKSPlayerMod*> ModsToGive; // 0x4e8
	AKSVehicleBase* SpawnedVehicle; // 0x508
	bool bIsVehiclePossessed; // 0x510
	TArray<AActor*> DeployableActors; // 0x518
};

struct UMovieSceneParticleTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> ParticleSections; // 0x58
};

struct AKSDestructibleBase : AActor {
	bool bRenderTrueCollisionUntilDestruction; // 0x228
	USceneComponent* SceneRoot; // 0x230
	UDestructibleComponent* VisualMesh; // 0x238
	UStaticMeshComponent* TrueCollision; // 0x240
	UBoxComponent* SpeedOverlap; // 0x248
	bool bAllowDestructibleMeshSimulation; // 0x250
	bool bAllowPlayerToWalkOnSurface; // 0x251
	bool bAllowDestructionAudio; // 0x252
	UAkAudioEvent* DefaultDestructionEvent; // 0x258
	bool bSpawnBreakParticleAtActorLocation; // 0x260
	UParticleSystem* BreakParticles; // 0x268
	UParticleSystem* ImpactParticles; // 0x270
	UParticleSystem* FakeHitDecalParticle; // 0x278
	UCameraShake* CharacterSpeedOverlapCameraShake; // 0x280
	FMulticastInlineDelegate OnDestructibleDestroyed; // 0x288
	float MaxHealth; // 0x298
	float Health; // 0x29c
	float LocalHealth; // 0x2a0
	bool bResetOnRoundChange; // 0x2a4
	bool bAllowsWeaponPenetration; // 0x2a5
	bool bCanBreakWithSpeed; // 0x2a6
	bool bAllProjectilesInstantBreak; // 0x2a7
	float SpeedBreakThreshold; // 0x2a8
	bool bTransparentDestructible; // 0x2ac
	TMap<EDamageCategory, float> DamageTypeMultipliers; // 0x2b0
	float BreakingDamage; // 0x300
	float BreakingImpulse; // 0x304
	bool bUseRadialDestruction; // 0x308
	float BreakingRadius; // 0x30c
	float ImpactImpulseOffset; // 0x310
	bool bIgnoreCharacterVerticalSpeed; // 0x314
	float BadDestroyCheckTime; // 0x318
	float EventlessDestroyWaitTime; // 0x31c
	bool MeshDestroyed; // 0x320
	UPhysicalMaterial* PhysicalMaterialOverride; // 0x328
	UDestructibleMesh* MeshAsset; // 0x330
	FVector LastHitLocation; // 0x338
	FVector LastHitDirection; // 0x344
	FVector LastHitNormal; // 0x350
	TArray<UParticleSystemComponent*> FakeHitDecals; // 0x360
	UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x380
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UKSModInst_FilterComponent : UKSPlayerModInstance {
	FMulticastInlineDelegate OnFilterActorAddedDel; // 0x1b8
	FMulticastInlineDelegate OnFilterActorRemovedDel; // 0x1c8
	FKSActorFilterConfig ActorFilterConfig; // 0x1d8
	UKSActorFilterComponent* ManagedFilterComponent; // 0x200
};

struct UFoliageType_InstancedStaticMesh : UFoliageType {
	UStaticMesh* Mesh; // 0x360
	TArray<UMaterialInterface*> OverrideMaterials; // 0x368
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x378
};

struct UWBP_StoreButtonMedium_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* SlideLeftToPrimary; // 0x528
	UWidgetAnimation* SlideLeftToSecondary; // 0x530
	UWBP_StoreItemInterior_C* PrimaryStoreItem; // 0x538
	UWBP_StoreItemInterior_C* SecondaryStoreItem; // 0x540
	UWBP_StoreItemRotator_C* StoreItemRotator; // 0x548
	UWBP_StorePanelButton_C* WBP_StorePanelButton; // 0x550
	UKSStoreSectionItem* MyStoreSection; // 0x558
	int32_t CurrentStoreIndex; // 0x560
	bool IsRotating; // 0x564
	float TimeVisible; // 0x568
	float MaxTimeVisible; // 0x56c
	float NewVar_1; // 0x570
	float ROTATION_TIMER_INTERVAL; // 0x574
};

struct UKSBTD_CompareKeyToObjective : UBTDecorator_BlackboardBase {
	UKSBTObjective* Objective; // 0x90
};

struct UKSWeaponPropManagerComponent : UActorComponent {
	TArray<FActiveWeaponProp> ActiveNamelessProps; // 0x188
	TMap<FPropIdentifier, FActiveWeaponProp> ActiveProps; // 0x198
	TMap<FPropIdentifier, FLegacyWeaponProp> LegacyProps; // 0x1e8
	bool bAllowAnimNotifyStatesToCreatePropSpawners; // 0x288
};

struct UWBP_WeaponMasteryTrack_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UTextBlock* MasteryLevel; // 0x528
	UWBP_MasteryPointsCount_C* WBP_MasteryPointsCount; // 0x530
	UWBP_WeaponMasteryTrackSection_C* WeaponMasterySection; // 0x538
	UHorizontalBox* XPWrapper; // 0x540
	FMulticastInlineDelegate OnMasteryLevelSelectedEvent; // 0x548
	FMulticastInlineDelegate OnPrestiegeSelected; // 0x558
};

struct UMaterialParameterCollection : UObject {
	FGuid StateId; // 0x28
	TArray<FCollectionScalarParameter> ScalarParameters; // 0x38
	TArray<FCollectionVectorParameter> VectorParameters; // 0x48
};

struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	FSourceEffectChorusSettings Settings; // 0x80
};

struct UKSSettingsColorOptionsAsset : UDataAsset {
	TArray<FColorOptions> ColorOptions; // 0x30
};

struct UWBP_CustomizeTitle_C : UKSPlayerCosmeticWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* ShowAnim; // 0x528
	UKSSortableGridPanel* ItemContainer; // 0x530
	UScrollBox* ScrollBox_1; // 0x538
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_1; // 0x540
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_2; // 0x548
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_3; // 0x550
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_4; // 0x558
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_5; // 0x560
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_6; // 0x568
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_7; // 0x570
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_8; // 0x578
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_9; // 0x580
	UWBP_CosmeticItem_Title_C* WBP_CosmeticItem_Title_C_10; // 0x588
	UWBP_PlayerIDCustomize_C* WBP_PlayerIDCustomize; // 0x590
	FMargin EntryPadding; // 0x598
	TArray<UWBP_CosmeticItem_Title_C*> TitleItems; // 0x5a8
	UWBP_CosmeticItem_Title_C* EquippedTitle; // 0x5b8
	UKSLoadoutDataFactory* LoadoutDataFactory; // 0x5c0
	UPlatformInventoryItem* HoveredItem; // 0x5c8
	int32_t VisibleGridRows; // 0x5d0
	int32_t VisibleGridColumns; // 0x5d4
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UWBP_ChallengeEntry_Event_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* animHover; // 0x528
	UHorizontalBox* CardContent; // 0x530
	UImage* ChallengeBkg_2; // 0x538
	UImage* ChallengeBkg_4; // 0x540
	UImage* ChallengeBkg_Complete; // 0x548
	UWidgetSwitcher* ChallengeBkg_Switcher; // 0x550
	UWidgetSwitcher* ChallengeContentSwitcher; // 0x558
	UTextBlock* ChallengeDescription; // 0x560
	UWBP_ProgressEarnedBar_C* ChallengeProgressBar; // 0x568
	UTextBlock* ChallengeProgressText; // 0x570
	UOverlay* CompletedChallengeBG; // 0x578
	UImage* CompletedCheck; // 0x580
	UOverlay* CompletedIcons; // 0x588
	UVerticalBox* Content_active; // 0x590
	USizeBox* HeightControl; // 0x598
	UButton* HitTarget; // 0x5a0
	UImage* Image; // 0x5a8
	UImage* Image_390; // 0x5b0
	UWBP_Challenge_Rewards_Badge_C* RewardBadge_EXAMPLE; // 0x5b8
	UWBP_Challenge_Rewards_Badge_C* RewardBadge_EXAMPLE_01; // 0x5c0
	UHorizontalBox* RewardsActive; // 0x5c8
	UWidgetSwitcher* RewardSwitcher; // 0x5d0
	UImage* SelectionFrame; // 0x5d8
	EChallengeEntry_Card_State CurrentVisualState; // 0x5e0
	FActivitySequenceRow CurrentActivitySequence; // 0x5e8
	FMulticastInlineDelegate OnClicked; // 0x618
	UAkAudioEvent* ButtonClickSound; // 0x628
	UAkAudioEvent* ButtonHoverSound; // 0x630
	float Height; // 0x638
	UKSActivityInstance* Displayed Challenge; // 0x640
	float RewardScale; // 0x648
};

struct UKSRadialMenuItem : UKSItem {
	TSoftClassPtr<UObject> RadialMenuItemInstanceClass; // 0x258
	TArray<FSoftDataTableInfo> AssetDataTables; // 0x280
	TArray<TSoftObjectPtr<UKSJobItem>> JobAllowList; // 0x290
	float GlobalRadialMenuItemCooldownTime; // 0x2a0
	ERadialMenuItemInterruptNotifyBehaviorType InterruptNotifyBehavior; // 0x2a4
	float RadialMenuItemIsPlayingTimeout; // 0x2a8
	FKSRadialMenuItemInterruptRules InterruptRules; // 0x2ac
	bool bLockPawnRotationWhilePlaying; // 0x2b0
	EKSEmotion Emotion; // 0x2b1
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UHapticFeedbackEffect_Buffer : UHapticFeedbackEffect_Base {
	TArray<char> Amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UKSPlayerMod_Undetectable : UKSPlayerMod {
	FKSPlayerModOverridePropertyStatBool HiddenFromReveals; // 0x330
	FKSPlayerModOverridePropertyStatBool HiddenOnRadar; // 0x33c
	FKSPlayerModOverridePropertyStatBool HiddenFromRemoteExplosives; // 0x348
	FKSPlayerModOverridePropertyStatBool HiddenFromThermal; // 0x354
	FKSPlayerModOverridePropertyStatBool HiddenFromShotDetection; // 0x360
	FKSPlayerModOverridePropertyStatBool HideFootprints; // 0x36c
	FKSPlayerModOverridePropertyStatBool Camouflaged; // 0x378
	FKSPlayerModOverridePropertyStatFloat RevealTimeMultiplier; // 0x384
};

struct ASwitchActor : AActor {
	USceneComponent* SceneComponent; // 0x238
	int32_t LastSelectedOption; // 0x240
};

struct UMaterialExpressionStaticBool : UMaterialExpression {
	char Value : 1; // 0x40
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct UKSActivityRewardCondition_Sequence : UKSActivityRewardCondition {
	FName ActivitySequenceName; // 0x30
	UDataTable* ActivitySequenceTable; // 0x38
};

struct UWBP_subscreen_header_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* Image_65; // 0x240
	UImage* Image_219; // 0x248
	UTextBlock* TextBlock_126; // 0x250
	FText HeaderText; // 0x258
};

struct UCheckbox_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetSwitcher* background; // 0x528
	UImage* Check; // 0x530
	UButton* HitTarget; // 0x538
	UImage* Hovered; // 0x540
	UImage* Unhovered; // 0x548
	bool Checked; // 0x550
	FMulticastInlineDelegate OnCheckChanged; // 0x558
	UAkAudioEvent* HoverCheckboxSFX; // 0x568
	UAkAudioEvent* ClickCheckboxSFX; // 0x570
};

struct UMorphTarget : UObject {
	USkeletalMesh* BaseSkelMesh; // 0x28
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x208
	float OrthoWidth; // 0x20c
	float OrthoNearClipPlane; // 0x210
	float OrthoFarClipPlane; // 0x214
	float AspectRatio; // 0x218
	float MaxAspectRatio; // 0x21c
	char bConstrainAspectRatio : 1; // 0x220
	char bUseFieldOfViewForLOD : 1; // 0x220
	char bLockToHmd : 1; // 0x220
	char bUsePawnControlRotation : 1; // 0x220
	ECameraProjectionMode ProjectionMode; // 0x221
	float PostProcessBlendWeight; // 0x260
	FPostProcessSettings PostProcessSettings; // 0x290
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct UWBP_BattlePassAcquisitionTitle_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UTextBlock* BattlePassSeasonName; // 0x528
	UImage* Image; // 0x530
	UImage* Image_183; // 0x538
	UImage* Image_533; // 0x540
	UTextBlock* TitleText; // 0x548
	UWidgetSwitcher* TypeSwitcher; // 0x550
	UTextBlock* UpsellSubtitle; // 0x558
	UWBP_BattlePassEmblem_C* WBP_BattlePassEmblem; // 0x560
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UKSHoveringInteractorManagerComponent : UActorComponent {
	FMulticastInlineDelegate OnHoveringInteractorsChanged; // 0xb0
	TArray<AActor*> HoveringInteractors; // 0xc0
};

struct UKSInteractableComponent : UActorComponent {
	int32_t InteractionPriority; // 0xb0
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	FVector Min; // 0x38
	FVector Max; // 0x44
};

struct UKSPlayerMod_AdjustCashRewards : UKSPlayerMod {
	int32_t BonusCashPerDown; // 0x330
};

struct UKSGameShopItemComponent_Job : UKSGameShopItemComponent {
	EKSGameShopJobItemType GameShopJobItemType; // 0x130
	UKSJobItem* JobItem; // 0x138
};

struct UBTDecorator_DoesPathExist : UBTDecorator {
	FBlackboardKeySelector BlackboardKeyA; // 0x68
	FBlackboardKeySelector BlackboardKeyB; // 0x90
	char bUseSelf : 1; // 0xb8
	EPathExistanceQueryType PathQueryType; // 0xbc
	UNavigationQueryFilter* FilterClass; // 0xc0
};

struct ULightmassPrimitiveSettingsObject : UObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x28
};

struct UMaterialExpressionMin : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UKSGameUserSettingsDefault : UObject {
	TArray<FSettingConfigPair> SettingsConfig; // 0x28
};

struct UNiagaraPrecompileContainer : UObject {
	TArray<UNiagaraScript*> Scripts; // 0x28
	UNiagaraSystem* System; // 0x38
};

struct UKSPlayerMod_HealOnEvent : UKSPlayerMod {
	bool bHealUpTo; // 0x330
	bool bHealAsPercentage; // 0x331
	float HealthPercentage; // 0x334
	float HealthAmount; // 0x338
	float HealDelay; // 0x33c
	float HealPeriod; // 0x340
	int32_t HealTickCount; // 0x344
	bool bFirstTickImmediately; // 0x348
};

struct UKSWeaponAttachment_ScopeMultiply : UKSWeaponAttachment_Scope {
	float ScopeMultiplier; // 0x2f8
};

struct UKSNewsRotatorWidget : UKSWidget {
	FString JsonSection; // 0x520
	float TimePerSection; // 0x530
};

struct UKSWhatsNewPanel : UKSJsonData {
	FText Header; // 0x80
	FText SubHeader; // 0x98
	ENewsHeaderAlignment HeaderAlignment; // 0xb0
	TArray<FSubPanel> SubPanels; // 0xb8
	ESubPanelAlignment Alignment; // 0xc8
	int32_t BgBoxOpacity; // 0xcc
	UTexture2DDynamic* Image; // 0xd0
	FString URL; // 0xd8
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	EARWorldAlignment WorldAlignment; // 0x37
	EARSessionType SessionType; // 0x38
	EARPlaneDetectionMode PlaneDetectionMode; // 0x39
	bool bHorizontalPlaneDetection; // 0x3a
	bool bVerticalPlaneDetection; // 0x3b
	bool bEnableAutoFocus; // 0x3c
	EARLightEstimationMode LightEstimationMode; // 0x3d
	EARFrameSyncMode FrameSyncMode; // 0x3e
	bool bEnableAutomaticCameraOverlay; // 0x3f
	bool bEnableAutomaticCameraTracking; // 0x40
	bool bResetCameraTracking; // 0x41
	bool bResetTrackedObjects; // 0x42
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8c
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8d
	TArray<char> SerializedARCandidateImageDatabase; // 0x90
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa0
};

struct UWBP_navtab_C : UKSNavTabWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x560
	UWidgetAnimation* Unhover; // 0x568
	UWidgetAnimation* Selected; // 0x570
	UWidgetAnimation* Hovered; // 0x578
	UImage* BackFill; // 0x580
	UImage* BackFill_Free; // 0x588
	UImage* BackFill_Holiday; // 0x590
	UImage* BackFill_Premium; // 0x598
	UImage* BottomEdge; // 0x5a0
	UImage* BottomEdge_Free; // 0x5a8
	UImage* BottomEdge_Holiday; // 0x5b0
	UImage* BottomEdge_Premium; // 0x5b8
	UOverlay* Container; // 0x5c0
	UImage* DividerLeft; // 0x5c8
	UImage* DividerRight; // 0x5d0
	UImage* LockIcon; // 0x5d8
	UImage* LockIcon_2; // 0x5e0
	UImage* LockIcon_3; // 0x5e8
	UImage* LockIcon_4; // 0x5f0
	UImage* SelectedGradient; // 0x5f8
	UImage* SelectedGradient_Free; // 0x600
	UImage* SelectedGradient_Holiday; // 0x608
	UImage* SelectedGradient_Premium; // 0x610
	UImage* SnowMaterial; // 0x618
	UButton* TabButton; // 0x620
	UWidgetSwitcher* TabColorSwitcher; // 0x628
	UTextBlock* text_TabFree; // 0x630
	UTextBlock* text_TabHoliday; // 0x638
	UTextBlock* text_TabPremium; // 0x640
	UTextBlock* text_TabStandard; // 0x648
	TSoftClassPtr<UObject> CalloutClass; // 0x650
	UWidget* CalloutWidget; // 0x678
	EHorizontalAlignment CalloutWidget_HorizontalAlignment; // 0x680
	EVerticalAlignment CalloutWidget_VerticalAlignment; // 0x681
	FMargin CalloutWidget_Padding; // 0x684
	UAkAudioEvent* HoverSubscreenNavTabSFX; // 0x698
	UAkAudioEvent* ClickSubscreenNavTabSFX; // 0x6a0
	bool UsesBattlePassColoring; // 0x6a8
	bool UsesHolidayColoring; // 0x6a9
};

struct UWBP_WeaponCategoryMasteryBadge_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWBP_AsyncIcon_C* Mastered; // 0x240
	UWBP_AsyncIcon_C* Standard; // 0x248
	UWidgetSwitcher* WidgetSwitcher_74; // 0x250
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UWBP_RogueCustomizationSelector_C : UKSCustomizationSelection {
	FPointerToUberGraphFrame UberGraphFrame; // 0x550
	UWidgetAnimation* Show; // 0x558
	UTextBlock* ActionBtnText; // 0x560
	UKSSortableGridPanel* CommunicationCosmeticItemContainer; // 0x568
	UKSScrollBox* CommunicationScrollbox; // 0x570
	UHorizontalBox* CompleteCosmeticSlotNavBar; // 0x578
	UWidgetSwitcher* CosmeticSwitcher; // 0x580
	UKSSortableGridPanel* EmoteCosmeticItemContainer; // 0x588
	UKSScrollBox* EmoteScrollbox; // 0x590
	UWBP_ButtonStacked_C* EquipCosmeticBtn; // 0x598
	UImage* EquippedGamepadIcon; // 0x5a0
	UImage* FakeFill; // 0x5a8
	UKSSortableGridPanel* OutfitCosmeticItemContainer; // 0x5b0
	UKSScrollBox* OutfitScrollbox; // 0x5b8
	UKSSortableGridPanel* QuipCosmeticItemContainer; // 0x5c0
	UKSScrollBox* QuipScrollbox; // 0x5c8
	UKSAsyncImage* RogueIcon; // 0x5d0
	UKSSortableGridPanel* SprayCosmeticItemContainer; // 0x5d8
	UWBP_AsyncIcon_C* SprayImage; // 0x5e0
	USizeBox* SprayImageContainer; // 0x5e8
	UKSScrollBox* SprayScrollbox; // 0x5f0
	UImage* TabLeftButtonImage; // 0x5f8
	UImage* TabRightButtonImage; // 0x600
	UWBP_CosmeticSlotNavTab_C* WBP_CommunicationsCosmeticSlotNavTab; // 0x608
	UWBP_CosmeticSlotNavTab_C* WBP_EmotesCosmeticSlotNavTab; // 0x610
	UWBP_ItemInfoContainer_Description_C* WBP_ItemInfoContainer_Description; // 0x618
	UWBP_CosmeticSlotNavTab_C* WBP_OutfitsCosmeticSlotNavTab; // 0x620
	UWBP_CosmeticSlotNavTab_C* WBP_QuipsCosmeticSlotNavTab; // 0x628
	UWBP_CosmeticSlotNavTab_C* WBP_SpraysCosmeticSlotNavTab; // 0x630
	UWBP_CosmeticSlotNavTab_C* WBP_WingsuitsCosmeticSlotNavTab; // 0x638
	UWBP_CosmeticSlotNavTab_C* WBP_WrapsCosmeticSlotNavTab; // 0x640
	UKSSortableGridPanel* WingsuitCosmeticItemContainer; // 0x648
	UKSScrollBox* WingsuitScrollbox; // 0x650
	UKSSortableGridPanel* WrapCosmeticItemContainer; // 0x658
	UKSScrollBox* WrapScrollbox; // 0x660
	TArray<UWBP_KSCosmeticItemSelector_C*> CosmeticItems; // 0x668
	FMulticastInlineDelegate OnEquipCosmeticItem; // 0x678
	FCosmeticSlotDetails CosmeticSlotDetail; // 0x688
	UKSMercManager* MercManager; // 0x6a0
	UKSLoadoutDataFactory* LoadoutDataFactory; // 0x6a8
	AKSLobbyCharacter* MercSelectionCharacter; // 0x6b0
	UKSItem* SelectedCosmeticKSItem; // 0x6b8
	UKSWeaponAsset* WingSuitAsset; // 0x6c0
	UWBP_KSCosmeticItemSelector_C* EquippedSlot; // 0x6c8
	UKSItem* HoveredItem; // 0x6d0
	UAkAudioEvent* ShowEquipAllRogueCustomSelectSFX; // 0x6d8
	UAkAudioEvent* WingsuitEquipSound; // 0x6e0
	UAkAudioEvent* SprayEquipSound; // 0x6e8
	UAkAudioEvent* WrapEmoteEquipSound; // 0x6f0
	FKSVoicelineEvent Skin Preview Line; // 0x6f8
	UAkAudioEvent* SkinEquipSound; // 0x730
	UPUMG_StoreItem* SelectedStoreItem; // 0x738
	UPUMG_StoreItem* ReturnToItemSelection; // 0x740
	UPUMG_StoreItem* HoveredStoreItem; // 0x748
};

struct AKSWeapon_RemoteVehicle : AKSWeapon {
	AKSVehicle_Remote* RemoteVehicleToSpawn; // 0x6d8
	FTransform RemoteVehicleRelativeTransform; // 0x6e0
	AKSVehicle_Remote* SpawnedRemoteVehicle; // 0x710
};

struct UKSBattlepassUpsellWidget : UKSWidget {
	UKSBattlepassUpsellWidgetButton* BaseBundleButton; // 0x530
	UKSBattlepassUpsellWidgetButton* EliteBundleButton; // 0x538
	UKSBattlepassUpsellWidgetButton* ConfirmPurchaseButton; // 0x540
	UKSCurrencyDisplay* CurrencySummary; // 0x548
	UTextBlock* BattlepassTimeRemaining; // 0x550
	UTextBlock* ConfirmationBundleName; // 0x558
	UImage* background; // 0x560
	UImage* ShadeOverlay; // 0x568
	UImage* OutfitsModule; // 0x570
	UImage* WingsuitModule; // 0x578
	UImage* WeaponWrapModule; // 0x580
	UImage* ChaseModule; // 0x588
	UImage* SmokeModule; // 0x590
	UImage* CurrencyModule; // 0x598
	float PurchasingTimeoutTime; // 0x5a8
};

struct UDecalComponent : USceneComponent {
	UMaterialInterface* DecalMaterial; // 0x208
	int32_t SortOrder; // 0x210
	float FadeScreenSize; // 0x214
	float FadeStartDelay; // 0x218
	float FadeDuration; // 0x21c
	float FadeInDuration; // 0x220
	float FadeInStartDelay; // 0x224
	char bDestroyOwnerAfterFade : 1; // 0x228
	FVector DecalSize; // 0x22c
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct UMovieSceneParameterSection : UMovieSceneSection {
	TArray<FBoolParameterNameAndCurve> BoolParameterNamesAndCurves; // 0xe0
	TArray<FScalarParameterNameAndCurve> ScalarParameterNamesAndCurves; // 0xf0
	TArray<FVector2DParameterNameAndCurves> Vector2DParameterNamesAndCurves; // 0x100
	TArray<FVectorParameterNameAndCurves> VectorParameterNamesAndCurves; // 0x110
	TArray<FColorParameterNameAndCurves> ColorParameterNamesAndCurves; // 0x120
	TArray<FTransformParameterNameAndCurves> TransformParameterNamesAndCurves; // 0x130
};

struct UKSBTTask_InteractWith : UBTTask_BlackboardBase {
	bool ShouldHold; // 0x98
};

struct ULightmassPortalComponent : USceneComponent {
	UBoxComponent* PreviewBox; // 0x208
};

struct AKSJobSelectPrvwActor_RogueScrn : AKSJobSelectPreviewActor_Lobby {
	URogueScreenLoadoutComponent* RogueScreenLoadoutComponent; // 0x5c8
};

struct UOnlineSessionClient : UOnlineSession {
	bool bIsFromInvite; // 0x1d8
	bool bHandlingDisconnect; // 0x1d9
};

struct UWBP_news_screen_C : UKSWhatsNewModal {
	FPointerToUberGraphFrame UberGraphFrame; // 0x538
	UWBP_StandardButtonLarge_C* CloseButton; // 0x540
	UImage* FeaturedImage; // 0x548
	USizeBox* FooterBackground; // 0x550
	UVerticalBox* HeaderBlock; // 0x558
	UImage* HeaderBreak; // 0x560
	UOverlay* HeaderOverlay; // 0x568
	UTextBlock* HeaderText; // 0x570
	UHorizontalBox* HorizontalContainer; // 0x578
	UTextBlock* SubheaderText; // 0x580
	UVerticalBox* VerticalLeftContainer; // 0x588
	UVerticalBox* VerticalRightContainer; // 0x590
	EPUMG_LoginState LoginState; // 0x598
	TArray<UKSWhatsNewPanel*> CachedPanels; // 0x5a0
};

struct UWBP_Header2_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* Decro; // 0x240
	UTextBlock* Text; // 0x248
	FText TextValue; // 0x250
	ETextJustify Justification; // 0x268
};

struct UTextureRenderTarget2D : UTextureRenderTarget {
	int32_t SizeX; // 0xc0
	int32_t SizeY; // 0xc4
	FLinearColor ClearColor; // 0xc8
	TextureAddress AddressX; // 0xd8
	TextureAddress AddressY; // 0xd9
	char bForceLinearGamma : 1; // 0xda
	char bHDR : 1; // 0xda
	char bGPUSharedFlag : 1; // 0xda
	ETextureRenderTargetFormat RenderTargetFormat; // 0xdb
	char bAutoGenerateMips : 1; // 0xdc
	TextureFilter MipsSamplerFilter; // 0xdd
	TextureAddress MipsAddressU; // 0xde
	TextureAddress MipsAddressV; // 0xdf
	EPixelFormat OverrideFormat; // 0xe0
};

struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x30
	int32_t EventID; // 0x34
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe0
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UKSMassInviteModal : UKSWidget {
	TArray<UKSPlayerInfo*> SelectedPlayers; // 0x520
	UKSDataMassInviteBase* RouteData; // 0x530
};

struct UWBP_RoundRecap_Entry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* BG_Enemy; // 0x240
	UImage* BG_Friendly; // 0x248
	UImage* Eliminated_Enemy; // 0x250
	UImage* Eliminated_Friendly; // 0x258
	UWidgetSwitcher* IconSwitcher_Enemy; // 0x260
	UWidgetSwitcher* IconSwitcher_Friendly; // 0x268
	UImage* Objective_Enemy; // 0x270
	UImage* Objective_Friendly; // 0x278
	UTextBlock* RoundLabelText_Enemy; // 0x280
	UTextBlock* RoundLabelText_Friendly; // 0x288
	UImage* TimeExpired_Enemy; // 0x290
	UImage* TimeExpired_Friendly; // 0x298
	UWBP_BoxStroke_C* WinStroke_Enemy; // 0x2a0
	UWBP_BoxStroke_C* WinStroke_Friendly; // 0x2a8
	bool FriendlyTeamWin; // 0x2b0
	FText RoundName; // 0x2b8
	E_RoundEndReason RoundEndReason; // 0x2d0
};

struct UWBP_RoguePanelHeader_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UTextBlock* Text; // 0x240
	FText HeaderText; // 0x248
};

struct USceneCaptureComponentCube : USceneCaptureComponent {
	UTextureRenderTargetCube* TextureTarget; // 0x2a0
	bool bCaptureRotation; // 0x2a8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2b0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2b8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2c0
	float IPD; // 0x2c8
};

struct UBlackboardKeyType_String : UBlackboardKeyType {
	FString StringValue; // 0x30
};

struct UBackgroundBlur : UContentWidget {
	FMargin Padding; // 0x128
	EHorizontalAlignment HorizontalAlignment; // 0x138
	EVerticalAlignment VerticalAlignment; // 0x139
	bool bApplyAlphaToBlur; // 0x13a
	float BlurStrength; // 0x13c
	bool bOverrideAutoRadiusCalculation; // 0x140
	int32_t BlurRadius; // 0x144
	FSlateBrush LowQualityFallbackBrush; // 0x148
};

struct UKSAccoladeTracker : UObject {
	FAccoladeDisplayInfo AccoladeDisplayInfo; // 0x38
};

struct UKSProjectileMovementComponent : UProjectileMovementComponent {
	FMulticastInlineDelegate OnProjectilePenetrated; // 0x1d0
	FVector PreStopVelocity; // 0x1e0
	float LifetimeUponStop; // 0x1ec
	float ProjectileVelocityDeflectDampener; // 0x1f0
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct ULiveLinkSourceSettings : UObject {
	ELiveLinkSourceMode Mode; // 0x28
	FLiveLinkSourceBufferManagementSettings BufferSettings; // 0x30
	FString ConnectionString; // 0x80
	ULiveLinkSourceFactory* Factory; // 0x90
};

struct AKSOutOfBoundsRecoveryPoint : ANavigationObjectBase {
	int32_t SideNum; // 0x248
};

struct UReticleBase_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* LoneDot; // 0x240
	float LowAmmoThreshold; // 0x248
	float CriticallyLowAmmoThreshold; // 0x24c
	UKSSettingsColorOptionsAsset* SettingsColorOptionAsset; // 0x250
};

struct AKSWeapon_ReviveDrone : AKSWeapon_Targeted {
	AKSAgent_RevivalDrone* DroneClass; // 0x718
	TWeakObjectPtr<AKSAgent_RevivalDrone> DroneActor; // 0x720
};

struct UWBP_RegionSelectRedirect_C : UKSRegionSelectModal {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_RegionSelect_C* WBP_RegionSelect; // 0x528
	UAkAudioEvent* ShowSFX; // 0x530
};

struct AKSWeapon_RemoteRocket : AKSWeapon {
	float CameraBlendTime; // 0x6d8
	EViewTargetBlendFunction CameraBlendFunction; // 0x6dc
	float CameraBlendExp; // 0x6e0
	bool CameraLockOutgoing; // 0x6e4
	float PostDestroyDelay; // 0x6e8
	AKSRocket* RemoteRocketToSpawn; // 0x6f0
	FVector RemoteRocketRelativeLocation; // 0x6f8
	AKSRocket* SpawnedRemoteRocket; // 0x708
	AController* RocketController; // 0x710
};

struct UMaterialExpressionBlendMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput A; // 0x40
	FMaterialAttributesInput B; // 0x58
	FExpressionInput Alpha; // 0x70
	EMaterialAttributeBlend PixelAttributeBlendType; // 0x84
	EMaterialAttributeBlend VertexAttributeBlendType; // 0x85
};

struct UBorder : UContentWidget {
	EHorizontalAlignment HorizontalAlignment; // 0x128
	EVerticalAlignment VerticalAlignment; // 0x129
	char bShowEffectWhenDisabled : 1; // 0x12a
	FLinearColor ContentColorAndOpacity; // 0x12c
	FDelegate ContentColorAndOpacityDelegate; // 0x13c
	FMargin Padding; // 0x14c
	FSlateBrush background; // 0x160
	FDelegate BackgroundDelegate; // 0x1e8
	FLinearColor BrushColor; // 0x1f8
	FDelegate BrushColorDelegate; // 0x208
	FVector2D DesiredSizeScale; // 0x218
	bool bFlipForRightToLeftFlowDirection; // 0x220
	FDelegate OnMouseButtonDownEvent; // 0x224
	FDelegate OnMouseButtonUpEvent; // 0x234
	FDelegate OnMouseMoveEvent; // 0x244
	FDelegate OnMouseDoubleClickEvent; // 0x254
};

struct AKSWeaponAssetDrop_MacGuffin : AKSWeaponAssetDrop {
	FKSObjectiveInfo ObjectiveInfo; // 0x880
	FKSObjectiveTimerInfo ObjectiveTimerInfo; // 0x8e8
	FKSObjectiveCaptureInfo ObjectiveCaptureInfo; // 0x920
	AActor* PointOfInterest; // 0x938
};

struct UARTrackedQRCode : UARTrackedImage {
	FString QRCode; // 0xf8
	int32_t Version; // 0x108
};

struct UKSBTTask_SetBetweenBlackboards : UBTTaskNode {
	FBlackboardKeySelector SourceBlackboardActor; // 0x70
	FBlackboardKeySelector SourceKey; // 0x98
	FBlackboardKeySelector TargetBlackboardActor; // 0xc0
	FBlackboardKeySelector TargetKey; // 0xe8
};

struct UNetAnalyticsAggregatorConfig : UObject {
	TArray<FNetAnalyticsDataConfig> NetAnalyticsData; // 0x28
};

struct USkelPropManagerComponent : UActorComponent {
	TArray<FActiveSkelProp> ActiveNamelessProps; // 0x188
	TMap<FPropIdentifier, FActiveSkelProp> ActiveProps; // 0x198
	bool bAllowSpawnerPooling; // 0x1e8
	float SpawnerPoolingLifespan; // 0x1ec
};

struct UBlueprintCore : UObject {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	FGuid BlueprintGuid; // 0x3c
};

struct UMaterialExpressionSkyAtmosphereLightDiskLuminance : UMaterialExpression {
	int32_t LightIndex; // 0x40
};

struct USoundNodeModulatorContinuous : USoundNode {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UPlaneReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadiusScale; // 0x280
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x288
	UBoxComponent* PreviewCaptureBox; // 0x290
};

struct UProceduralFoliageTile : UObject {
	UProceduralFoliageSpawner* FoliageSpawner; // 0x28
	TArray<FProceduralFoliageInstance> InstancesArray; // 0xd0
};

struct ASmoothRepTimelineActor : AActor {
	FTimelineSimulationHandler SmoothTimeline; // 0x220
	UTimelineComponent* TimelineComponentToSimulate; // 0x238
};

struct UKSContextMenuButton : UKSWidget {
	EPlayerContextOptions ContextOption; // 0x520
};

struct UKSStoreSectionItemWithPurchaseData : UKSPurchaseData {
	UKSStoreSectionItem* StoreSectionItem; // 0x58
};

struct UClickDragInputBehavior : UAnyButtonInputBehavior {
	bool bUpdateModifiersDuringDrag; // 0x120
};

struct UKSMilestoneCompletedSummary : UObject {
	TArray<FKSMilestoneCompletedSummaryEntry> MilestoneEntries; // 0x28
	TArray<UKSWeaponAsset*> WeaponKeys; // 0x38
	TMap<UKSWeaponAsset*, int32_t> WeaponXpCounts; // 0x48
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UKSPhaseRuleComponent : UKSGameRuleComponent {
	FMulticastInlineDelegate PhaseCompletedDel; // 0xb0
	float ScoringScalar; // 0xd0
	float LastInitiatedPhaseTime; // 0xd4
	bool bRejectPhaseTimerExpiredForPostRound; // 0xd8
	bool bUseInitialSpawnPoints; // 0xd9
	FName LastPhaseName; // 0xdc
	bool bPhaseActive; // 0xe4
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat Lifetime; // 0x30
};

struct UPInv_AssetManagerSettings : UDeveloperSettings {
	bool bQuickCook; // 0x38
	TArray<FName> PrimaryTypesToIgnoreQuickCook; // 0x40
	TSet<FName> QuickCookTypeIgnoreSet; // 0x50
	TArray<FString> PrimaryAssetsToIgnoreQuickCook; // 0xa0
	TSet<FPrimaryAssetId> QuickCookAssetIgnoreSet; // 0xb0
	TSet<FPrimaryAssetType> QuickCookAssetIngoreSetTypes; // 0x100
	TArray<FString> PrimaryAssetsToIncludeQuickCook; // 0x150
};

struct UAnimSequenceBase : UAnimationAsset {
	TArray<FAnimNotifyEvent> Notifies; // 0x80
	float SequenceLength; // 0x90
	float RateScale; // 0x94
	FRawCurveTracks RawCurveData; // 0x98
};

struct UKSContextualPingMarkerWidget : UKSMapIconWidgetBase {
	FMulticastInlineDelegate OnPingRemovedCalled; // 0x318
	FMulticastInlineDelegate OnPingChangedCalled; // 0x328
	FPingInfo CurrentPingInfo; // 0x338
	UKSPingManager* PingManager; // 0x3e8
};

struct UKSSpawnRule_Proximity : UKSSpawnRule {
	float OuterRadius; // 0x40
	float InnerRadius; // 0x44
};

struct UKSAmmoWidget : UKSWeaponWidget {
	int32_t CachedAmmoInClip; // 0x528
	int32_t CachedClipSize; // 0x52c
	int32_t CachedInReserve; // 0x530
	bool CachedIsReloading; // 0x534
};

struct UWBP_ReticleHair_C : UUserWidget {
	UImage* CrosshairImage; // 0x238
	TArray<UTexture2D*> CrosshairTextures; // 0x240
};

struct USoundNodeOscillator : USoundNode {
	char bModulateVolume : 1; // 0x48
	char bModulatePitch : 1; // 0x48
	float AmplitudeMin; // 0x4c
	float AmplitudeMax; // 0x50
	float FrequencyMin; // 0x54
	float FrequencyMax; // 0x58
	float OffsetMin; // 0x5c
	float OffsetMax; // 0x60
	float CenterMin; // 0x64
	float CenterMax; // 0x68
};

struct UBP_GameInstance_C : UKSGameInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x550
};

struct UKSSettingsMenuConfigAsset : UDataAsset {
	TArray<UKSSettingsPageConfigAsset*> SettingsPageConfigs; // 0x30
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct UWBP_WeaponHub_C : UKSWeaponHubBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x550
	UWidgetAnimation* Anim_OnShow; // 0x558
	UImage* BG; // 0x560
	UHorizontalBox* ButtonContainer; // 0x568
	UHorizontalBox* LowerButtonContainer; // 0x570
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton; // 0x578
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton_2; // 0x580
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton_3; // 0x588
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton_4; // 0x590
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton_5; // 0x598
	UWBP_WeaponCategoryButton_C* WBP_WeaponCategoryButton_6; // 0x5a0
	UWBP_WeaponCategoryButton_Horizontal_C* WBP_WeaponCategoryButton_Horizontal; // 0x5a8
	UWBP_WeaponCategoryButton_Horizontal_C* WBP_WeaponCategoryButton_Horizontal_2; // 0x5b0
	UWBP_WeaponCategoryButton_Horizontal_C* WBP_WeaponCategoryButton_Horizontal_3; // 0x5b8
	UAkAudioEvent* GamePad_FaceButtonTOP_SFX; // 0x5c0
	FName ArmoryTabSeen; // 0x5c8
};

struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28
};

struct UCloudStorageBase : UPlatformInterfaceBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct UInputTouchDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x28
};

struct UInterpTrackVectorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UAsyncTaskDownloadImage : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct UKSAvenger : UKSAccoladeTracker {
	TArray<FPlayerCombatInfo> PlayerTrackers; // 0xa8
	float MaxTrackerTimer; // 0xb8
};

struct USettingsInfo_GlobalQuality_C : UKSSettingsInfo_Generic {
	FPointerToUberGraphFrame UberGraphFrame; // 0x118
	TArray<FName> QualityNames; // 0x120
};

struct ULoggedInInventoryCheck_C : UKSLoginInventoryCheck {
	FPointerToUberGraphFrame UberGraphFrame; // 0x538
	UImage* background; // 0x540
	UWBP_StandardButtonMedium_C* DisconnectButton; // 0x548
	UGamepadPromptBasic_C* DisconnectPrompt; // 0x550
	UProgressBar* LoadingBar; // 0x558
	UWidgetSwitcher* PromptSwitcher; // 0x560
	UWBP_EpilepsyWarning_C* WBP_EpilepsyWarning; // 0x568
	UWBP_ThrobberShield_C* WBP_ThrobberShield; // 0x570
	float CurrentProgress; // 0x578
	float CurrentSeconds; // 0x57c
};

struct UKSSettingsWidget : UKSWidget {
	FKSSettingsWidgetConfig WidgetConfig; // 0x520
	FText WidgetContainerTitle; // 0x530
	FText WidgetContainerDescription; // 0x548
	bool bHasPreview; // 0x560
	UKSSettingsPreview* WidgetContainerPreviewWidget; // 0x568
	UKSSettingsInfoBase* SettingsInfo; // 0x570
};

struct UMovieSceneEasingExternalCurve : UObject {
	UCurveFloat* Curve; // 0x30
};

struct UBrushStampIndicator : UInteractiveGizmo {
	float BrushRadius; // 0x38
	float BrushFalloff; // 0x3c
	FVector BrushPosition; // 0x40
	FVector BrushNormal; // 0x4c
	bool bDrawIndicatorLines; // 0x58
	bool bDrawRadiusCircle; // 0x59
	bool bDrawFalloffCircle; // 0x5a
	int32_t SampleStepCount; // 0x5c
	FLinearColor LineColor; // 0x60
	float LineThickness; // 0x70
	bool bDepthTested; // 0x74
	bool bDrawSecondaryLines; // 0x75
	float SecondaryLineThickness; // 0x78
	FLinearColor SecondaryLineColor; // 0x7c
	UPrimitiveComponent* AttachedComponent; // 0x90
};

struct UMaterialParameterCollectionInstance : UObject {
	UMaterialParameterCollection* Collection; // 0x30
};

struct UTextLayoutWidget : UWidget {
	FShapedTextOptions ShapedTextOptions; // 0x110
	ETextJustify Justification; // 0x113
	ETextWrappingPolicy WrappingPolicy; // 0x114
	char AutoWrapText : 1; // 0x115
	float WrapTextAt; // 0x118
	FMargin Margin; // 0x11c
	float LineHeightPercentage; // 0x12c
};

struct UKSSocialSearchPanel : UKSSocialPanelBase {
	FMulticastInlineDelegate OnOpen; // 0x580
	FMulticastInlineDelegate OnClose; // 0x590
};

struct USubsurfaceProfile : UObject {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UPUMG_AcquisitionManager : UObject {
	FMulticastInlineDelegate OnAcquisitionSuccess; // 0x28
	FMulticastInlineDelegate OnAcquisitionFailed; // 0x38
	UPUMG_StoreItemHelper* StoreItemHelper; // 0x48
};

struct UKSEasyAntiCheatSettings : UDeveloperSettings {
	uint16_t AbilityEACWeaponTypeId; // 0x38
	TArray<FWeaponTypeToAntiCheatId> WeaponTypeToAntiCheatId; // 0x40
	TMap<FGameplayTag, uint16_t> WeaponTypeToAntiCheatIdMap; // 0x50
};

struct UKSPlayerMod_GiveItemOnEvent : UKSPlayerMod {
	TSoftObjectPtr<UKSItem> ItemToGive; // 0x330
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x148
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UMaterialFunction : UMaterialFunctionInterface {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
	char bReentrantFlag : 1; // 0x50
};

struct UKSBTD_AnyActorPerceived : UBTDecorator {
	TArray<UAISense*> SensesToUse; // 0x68
	FKSPerceptionFilter PerceptionFilter; // 0x78
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x50
	FExpressionInput TextureObject; // 0x64
	FExpressionInput MipValue; // 0x78
	FExpressionInput CoordinatesDX; // 0x8c
	FExpressionInput CoordinatesDY; // 0xa0
	FExpressionInput AutomaticViewMipBiasValue; // 0xb4
	ETextureMipValueMode MipValueMode; // 0xc8
	ESamplerSourceMode SamplerSource; // 0xc9
	char AutomaticViewMipBias : 1; // 0xca
	char ConstCoordinate; // 0xcb
	int32_t ConstMipValue; // 0xcc
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct AKSBlueprintableInteractable : AActor {
	UKSInteractionBlockerManager* InteractionBlockerManager; // 0x228
	UKSInteractableComponent* InteractableComponent; // 0x230
	float Duration; // 0x238
	bool bUseCollisionForInteractionDistance; // 0x23c
	bool bCanInteractFromBehind; // 0x23d
	bool bCanInteractWhileDowned; // 0x23e
	bool bShouldDisplayInteractionProgress; // 0x23f
	FName InteractionName; // 0x240
	int32_t MaxNumberOfInteractors; // 0x248
	int32_t InteractionPriority; // 0x24c
	bool bInteractionAllowed; // 0x250
	UKSInteractionType* InteractionType; // 0x258
	TArray<UPrimitiveComponent*> OutlinedComponents; // 0x260
	TArray<UKSInteractionManager*> ActiveInteractions; // 0x280
	int32_t NumActiveInteractions; // 0x290
	FText ProgressText; // 0x298
	FText PromptText; // 0x2b0
	FMulticastInlineDelegate OnInteractionStarted; // 0x2c8
	FMulticastInlineDelegate OnInteractionEnded; // 0x2d8
	FMulticastInlineDelegate OnInteractionComplete; // 0x2e8
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FVector ResetVector; // 0x60
};

struct AKSGameMode : APGame_GameMode {
	float PlayerReadyTimeoutTime; // 0x538
	UKSPlayerJoinRuleComponent* KSPlayerJoinRuleComponentClass; // 0x540
	UKSPlayerJoinRuleComponent* KSPlayerJoinRuleComponent; // 0x548
	UKSChargeRuleComponent* ChargeRuleComponent; // 0x550
	UKSBackfillRuleComponent* BackfillRuleComponent; // 0x558
	bool bCachedShouldPlayersStartSpectatingDefaultCamera; // 0x568
	FKSRespawnConfig RespawnConfiguration; // 0x570
	FMulticastInlineDelegate OnPhaseChangeDel; // 0x588
	FMulticastInlineDelegate OnPhaseTimerExpired; // 0x598
	FMatchPhase MatchPhase; // 0x5b8
	bool bUseMatchTimer; // 0x5cc
	float MatchSetupTime; // 0x5d0
	bool bUseSelectionPhase; // 0x5d4
	float PreSelectionPhaseTime; // 0x5d8
	float SelectionPhaseTime; // 0x5dc
	float PostSelectionPhaseTime; // 0x5e0
	float PostSelectionPhaseMinTime; // 0x5e4
	bool bSkipPostSelectionCinematic; // 0x5e8
	float PostSelectionCinematicPhaseTime; // 0x5ec
	bool bUsePostMatchMVPLineup; // 0x5f0
	float TimeBeforeMVPLineupCinematicBegins; // 0x5f4
	float PostMatchMVPLineupPhaseTime; // 0x5f8
	float MatchDefaultPhaseTime; // 0x5fc
	float MatchTimerUpdatePeriod; // 0x630
	UKSSpawnSelectorComponent* KSSpawnSelectorComponentClass; // 0x648
	TSoftClassPtr<UObject> KSSpawnSelectorComponentSoftClass; // 0x650
	UKSSpawnSelectorComponent* KSSpawnSelectorComponent; // 0x678
	bool bAllowFindInactivePlayer; // 0x680
	bool bUseLoginStartSpotForPawn; // 0x681
	bool bAIPlayersUseLoginStartSpotForPawn; // 0x682
	int32_t DefaultTeamCount; // 0x6b8
	EKSTeamAssignmentType TeamAssignmentType; // 0x6bc
	bool bFirstDebugPlayerIsOnlySpectator; // 0x6bd
	AKSRevealManager* RevealManager; // 0x730
	AKSRevealManager* RevealManagerClass; // 0x738
	FMulticastInlineDelegate MatchStatsFinalizedDelegate; // 0x750
	float MatchStartTime; // 0x778
	float MatchEndTime; // 0x77c
	bool bIsTutorial; // 0x780
	bool bIsPractice; // 0x781
	bool bIsAiPvpMode; // 0x782
	bool bIsPlayerSpectateOnlyMode; // 0x783
	float DefaultMinimapWidth; // 0x784
	AKSTeamState* DefaultTeamState; // 0x788
	float ReverseFriendlyFireStartThreshold; // 0x790
	float FriendlyFireModiferBase; // 0x794
	float ReverseFriendlyFireModiferBase; // 0x798
	bool bCanDownPlayers; // 0x79c
	bool bCanDownBots; // 0x79d
	bool bCreditInstantKillWithDown; // 0x79e
	bool bCreditSuicideWithDown; // 0x79f
	bool bImmediateDeathForLastManStanding; // 0x7a0
	bool bEliminatePlayerOnDeath; // 0x7a1
	bool bPivotToKillerOnDeath; // 0x7a2
	bool bTrackKillerOnDeath; // 0x7a3
	bool bRevealKillerOnDeath; // 0x7a4
	bool bShouldRandomizeSides; // 0x7a5
	bool bStartJobSelectionOnSideSwap; // 0x7a6
	AKSGlobalShotListener* ShotListener; // 0x7a8
	FMulticastInlineDelegate OnTeamSidesFlipped; // 0x7b8
	bool bClearObjectivesMarkedUsedOnSidesFlipped; // 0x7c8
	AActor* Winner; // 0x7d0
	AActor* CheatWinner; // 0x7d8
	UKSRewardsCalculator* DefaultRewardsCalculatorClass; // 0x7e0
	bool bIncludeInitialInventoryFromDefaultPawnInStartingInventory; // 0x7e8
	TArray<UKSItem*> StartingInventory; // 0x7f0
	bool bGiveStartingInventoryToBots; // 0x800
	TArray<UKSItem*> PlayerSpawnInventory; // 0x808
	TArray<UKSItem*> PlayerInitialSpawnInventory; // 0x818
	TArray<UKSItem*> PlayerRespawnInventory; // 0x828
	TArray<UKSPlayerMod*> PlayerSpawnMods; // 0x838
	TArray<UKSPlayerMod*> PlayerInitialSpawnMods; // 0x848
	TArray<UKSPlayerMod*> PlayerRespawnMods; // 0x858
	UKSPlayerMod* FreefallMod; // 0x868
	bool bIsBotMatch; // 0x8a0
	int32_t StartingCash; // 0x8a4
	FMulticastInlineDelegate OnSpecialtyItemVendorLoaded; // 0x8a8
	bool bUsePlayerLoadouts; // 0x8bc
	bool bDisableLoadoutValidation; // 0x8bd
	float WaitForPlayersTimeout; // 0xb08
	TMap<TSoftObjectPtr<UKSWeaponAsset>, int32_t> LoadingLoot; // 0xb20
	bool bPopulateLootSites; // 0xb70
	TMap<ELootSiteRarity, FKSLootGroupGuaranteeMap> LootGroupGuarantees; // 0xb78
	bool bSpawnLootOnMatchStart; // 0xbc8
	TArray<FKSLootRaritySwapInfo> LootRaritySwaps; // 0xc20
	EKSLootRespawnMode LootRespawnMode; // 0xc30
	TMap<ELootSiteRarity, float> LootSiteRespawnPeriods; // 0xc38
	UKSAIActorCollection* AIActorCollection; // 0xcd8
	bool bRecordKillCam; // 0xce0
	float AFKIdleTime; // 0xce4
	UDataTable* AccoladeTrackerDataTable; // 0xd20
	TArray<UKSAccoladeTracker*> AccoladeTrackerInstances; // 0xd28
	TArray<UKSAccoladeTracker*> AccoladeTrackerClasses; // 0xd38
	FKSGameHUDSettings GameModeHUDSettings; // 0xd48
	TArray<TSoftObjectPtr<AActor>> InteractiveObjectCache; // 0xd60
	UKSOutOfBoundsManager* OutOfBoundsManagerClass; // 0xd70
	UKSMatchDataRecorder* MatchDataRecorder; // 0xd78
	bool ShouldForceCompetitiveLogic; // 0xd88
	EKSPerSecondChargeMode PerSecondChargeMode; // 0xd89
	float PerSecondChargePercent; // 0xd8c
	TArray<UKSGameRuleComponent*> GameRules; // 0xd90
	TMap<FName, FString> EditorPropertyMap; // 0xda0
	FString FriendlyAudioName; // 0xe40
	AKSAnnouncer* KSAnnouncerClass; // 0xe50
	int32_t BurnTestNumberOfRoundToWin; // 0xe58
	FMulticastInlineDelegate OnCharacterControlTransferred; // 0xe70
	bool bUseLegacyJobSelectionTech; // 0xe80
	bool bAllowPlayersToUseUnownedJobs; // 0xe81
	TArray<int32_t> AllowedUnownedJobIds; // 0xe88
	EJobUniquenessRule EnforcedJobUniqueness; // 0xe98
	bool bUseJobSelectionByDraft; // 0xe99
	bool bSkipDraftMidMatch; // 0xe9a
	bool bDraftAlternateTeams; // 0xe9b
	int32_t DraftNumPlayersSelecting; // 0xe9c
	int32_t DraftFirstSelectionNumOverride; // 0xea0
	float DraftPostSelectionPhaseTime; // 0xea4
	bool bDraftIncludesBans; // 0xea8
	bool bDraftBanAlternateTeams; // 0xea9
	int32_t DraftBanNumPlayersBanning; // 0xeac
	TArray<int32_t> DraftBanTurns; // 0xeb0
	UKSJobSelectionRules* JobSelectionRules; // 0xec0
	AKSJobSelectionAuthority* JobSelectionAuthority; // 0xec8
	int32_t CurrentDraftTurnNum; // 0xed0
	int32_t CurrentTeamNumSelecting; // 0xed4
	bool bCurrentlyBanning; // 0xed8
	bool bWasBanning; // 0xed9
	int32_t LastTeamNumToBan; // 0xedc
	bool bHasEverCompletedJobSelection; // 0xee0
	bool bFubarIfNoVendorsByMatchStart; // 0xee1
	bool bOnlyFubarIfNoJobVendor; // 0xee2
	bool bFubarIfAbsentPlayers; // 0xee3
	EKSBotNameGeneration BotNamingMethod; // 0xee6
	bool bUseIntraScoring; // 0xef0
	FText GameModeDisplayName; // 0xef8
	AKSEmoteMusicManager* EmoteMusicManagerClass; // 0xf10
	bool bRequireJobToEnterPlay; // 0xf18
	UKSCinematicDataContainer* CinematicDataContainer; // 0xf20
	UKSMVPDeterminant* MVPDeterminant; // 0xf28
	UKSSeamlessTravelTransferInfo* SeamlessTravelInfo; // 0xf30
	FKSSeamlessTravelSettings SeamlessTravelSettings; // 0xf38
	TArray<FGameplayTag> GameModeTags; // 0xf50
	int32_t NumericId; // 0xf60
	bool bAbandonPlayersOnLogOut; // 0xf64
	bool bGlobalDisableAIBackfill; // 0xf65
	bool bAllowAIBackfill; // 0xf66
	UKSBotDefinition* BackfillBotDefinition; // 0xf68
	char NextPawnId; // 0xf80
};

struct UKSBTD_IsWeaponFiring : UBTDecorator {
	FGameplayTag EquipPoint; // 0x68
};

struct UKSArmorAsset : UKSWeaponAsset {
	float Durability; // 0x908
	float StartingDurability; // 0x90c
	float DamageAbsorbPercent; // 0x910
	int32_t DisplayLevel; // 0x914
	bool bAbsorbsHeadDamage; // 0x918
	bool bAbsorbsBreakingHit; // 0x919
	bool bArmorIsRepairable; // 0x91a
	bool bDestroyOnBreak; // 0x91b
	bool bRepairableByInteract; // 0x91c
};

struct UChaosGameplayEventDispatcher : UChaosEventListenerComponent {
	TMap<UPrimitiveComponent*, FChaosHandlerSet> CollisionEventRegistrations; // 0x1c8
	TMap<UPrimitiveComponent*, FBreakEventCallbackWrapper> BreakEventRegistrations; // 0x218
};

struct UAISense : UObject {
	float DefaultExpirationAge; // 0x28
	EAISenseNotifyType NotifyType; // 0x2c
	char bWantsNewPawnNotification : 1; // 0x30
	char bAutoRegisterAllPawnsAsSources : 1; // 0x30
	UAIPerceptionSystem* PerceptionSystemInstance; // 0x38
};

struct AKSIngressPoint : AKSMapPoint {
	AKSObjectiveBase* RelevantObjective; // 0x258
	AActor* AssignedBot; // 0x260
};

struct UMasterLobby_ABP_C : UKSCharacterAnimInst {
	FPointerToUberGraphFrame UberGraphFrame; // 0x10f0
	FAnimNode_Root AnimGraphNode_Root; // 0x10f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1138
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned; // 0x11c0
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1320
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1360
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1420
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1450
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1480
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1550
	FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x15d8
	FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x16d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x17d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x18a0
	bool __CustomProperty_bIsLobby_90FBADB5424A5A00D7B0F4B018D67A66; // 0x18d8
	bool __CustomProperty_bIsServer_90FBADB5424A5A00D7B0F4B018D67A66; // 0x18d9
	FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x18e0
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1990
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x19e8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1a98
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x1ac8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x1af8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1c10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1cd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1d10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1d48
	FAnimNode_RigidBodySkipServer AnimGraphNode_RigidBodySkipServer; // 0x1e00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x23b0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x23e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2410
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x24d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2510
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2548
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x25a0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x26b8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x26e8
	float R_Prop_Lock_Alpha; // 0x2718
	float L_Prop_Lock_Alpha; // 0x271c
	bool bIsServer; // 0x2720
	bool SkinUseCharacterScale; // 0x2721
	FVector CharacterScale; // 0x2724
	bool ChildPhysicsAssetEnable; // 0x2730
	bool RemoveHeadAccessory; // 0x2731
};

struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x4e8
	int32_t NumCustomDataFloats; // 0x4f8
	TArray<float> PerInstanceSMCustomData; // 0x500
	int32_t InstancingRandomSeed; // 0x510
	int32_t InstanceStartCullDistance; // 0x514
	int32_t InstanceEndCullDistance; // 0x518
	TArray<int32_t> InstanceReorderTable; // 0x520
	int32_t NumPendingLightmaps; // 0x578
	TArray<FInstancedStaticMeshMappingInfo> CachedMappings; // 0x580
};

struct ULiveLinkTransformAxisSwitchPreProcessor : ULiveLinkFramePreProcessor {
	ELiveLinkAxis OrientationAxisX; // 0x28
	ELiveLinkAxis OrientationAxisY; // 0x29
	ELiveLinkAxis OrientationAxisZ; // 0x2a
	ELiveLinkAxis TranslationAxisX; // 0x2b
	ELiveLinkAxis TranslationAxisY; // 0x2c
	ELiveLinkAxis TranslationAxisZ; // 0x2d
};

struct UKSCharacterCameraHandler : USceneComponent {
	FMulticastInlineDelegate OnShoulderSwapChanged; // 0x208
	UKSSmoothingComponent* CameraRootComponent; // 0x218
	UKSSpringArmComponent* MainCameraBoom; // 0x220
	UCameraComponent* MainCameraComponent; // 0x228
	UKSSpringArmComponent* SprintCameraBoom; // 0x230
	UCameraComponent* SprintCameraComponent; // 0x238
	UKSSpringArmComponent* TransitionCameraBoom; // 0x240
	UCameraComponent* TransitionCameraComponent; // 0x248
	UKSSpringArmComponent* ShoulderCameraBoom; // 0x250
	UCameraComponent* ShoulderCameraComponent; // 0x258
	UCameraComponent* FirstPersonCameraComponent; // 0x260
	UKSSpringArmComponent* TabletCameraBoom; // 0x268
	UCameraComponent* TabletCameraComponent; // 0x270
	UKSSpringArmComponent* ActionCameraBoom1; // 0x278
	UCameraComponent* ActionCameraComponent; // 0x280
	UKSSpringArmComponent* SwimCameraBoom; // 0x288
	UCameraComponent* SwimCameraComponent; // 0x290
	UKSSpringArmComponent* MountedCameraBoom; // 0x298
	UCameraComponent* MountedCameraComponent; // 0x2a0
	UCameraComponent* ActiveCameraComponent; // 0x2a8
	UCameraComponent* PendingCameraComponent; // 0x2b8
	ECameraShoulder CameraShoulder; // 0x2c8
	ECameraShoulder DesiredCameraShoulder; // 0x2c9
	float NextShoulderSwapTime; // 0x2cc
	float ShoulderSwapCooldownTime; // 0x2d0
	float AutoShoulderSwapTime; // 0x2d4
	FName MeshADSPitchPivotBoneName; // 0x2d8
	float CameraFocualThreshold; // 0x2e0
	float MinimumFocalPointMaintenanceDistance; // 0x2e4
	float AimSnapThrottleTime; // 0x2e8
	float ShoulderSwapTime; // 0x2ec
	float ZipLineShoulderCameraBoomLength; // 0x2f0
	float ZipLineShoulderBoomLengthChangeTime; // 0x2f4
	float CrouchCameraShiftInterpSpeed; // 0x2f8
	float CrouchCameraBoomLengthScale; // 0x2fc
	float SprintCameraChangeDuration; // 0x300
	float SprintOutCameraChangeDuration; // 0x304
	float AimDownSightsScopeInterpSpeed; // 0x308
	bool bMantainFocualPointOnCameraTransition; // 0x30c
	bool bUseAdvancedFocalPointTracking; // 0x30d
	float ShoulderSwapProgress; // 0x310
	float ZiplineAOSCamVertOffset; // 0x314
	float CrouchAOSCamVertOffset; // 0x318
	float SwimCameraBoomFloatHeight; // 0x31c
	float ShoulderSwapBlendExponent; // 0x320
	bool bUseFocalPointDoubleCheck; // 0x324
	float FocalPointDoubleCheckAllowedBlockDistance; // 0x328
	bool bFocalPointMaintenanceEnabled; // 0x32c
	FVector LastManualShoulderSwapLocation; // 0x330
	float LastShoulderSwapTimestamp; // 0x33c
	float CurrentShoulderSwapTime; // 0x340
	FRotator CameraTransitionRotationDelta; // 0x344
	FRotator CameraTransitionRotationDeltaRemaining; // 0x350
	float NextValidAimSnapTime; // 0x35c
	AActor* CameraPivotTargetActor; // 0x360
	bool bPivotCameraToActorNotLocation; // 0x36a
	bool bTrackTargetAfterPivotingToIt; // 0x36b
	UKSAimAssistAnchorComponent* CachedSnapAnchor; // 0x370
	FRotator AppliedFocalPointCorrection; // 0x378
	UCurveFloat* CameraPivotCurve; // 0x3a8
	float StandEmoteCameraVertOffset; // 0x3b0
	float CrouchEmoteCameraVertOffset; // 0x3b4
	float ProneEmoteCameraVertOffset; // 0x3b8
	float StandEmoteCameraInterpSpeed; // 0x3bc
	float CrouchEmoteCameraInterpSpeed; // 0x3c0
	float ProneEmoteCameraInterpSpeed; // 0x3c4
	FVector RelativeFocalPoint; // 0x3e4
	FRotator NonFocalPointRotation; // 0x3f0
	FRotator AppliedFocalPointYawRotation; // 0x3fc
	float CachedPrimaryWeaponFieldOfView; // 0x418
	float CameraInterpSpeed; // 0x438
	float CurrentEmoteCameraVertOffset; // 0x43c
	float CurrentEmoteCameraInterpSpeed; // 0x440
	bool bUsingEmoteCamera; // 0x444
	float CachedCameraFOV; // 0x448
	FVector2D CachedViewPortSize; // 0x44c
	float CachedHalfTanFOV; // 0x454
};

struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb0
	char bProjectVectorGoalToNavigation : 1; // 0xb0
	char bUpdatedDeprecatedProperties : 1; // 0xb0
};

struct UKSPlayerMod_MedPackSpeed : UKSPlayerMod {
	float MedPackSpeedMultiplier; // 0x330
};

struct UWBP_KeyCallout_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWBP_AsyncIcon_C* CalloutIcon; // 0x240
	FKey Key; // 0x248
	FName KeyBind; // 0x260
	bool DisplayKeybind; // 0x268
	bool SecondaryKey; // 0x269
	bool FallbackToDefaults; // 0x26a
	bool GamepadDoubleTap; // 0x26b
};

struct UMaterialExpressionSteppedShadowSkinCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UGameplayTaskResource : UObject {
	int32_t ManualResourceID; // 0x28
	int8_t AutoResourceID; // 0x2c
	char bManuallySetID : 1; // 0x30
};

struct UWBP_SettingsSlider_C : UKSSettingsWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x578
	UWidgetAnimation* Hover; // 0x580
	UTextBlock* DisplayText; // 0x588
	UButton* HoverButton; // 0x590
	UImage* hoverstroke; // 0x598
	USlider* SettingsSlider; // 0x5a0
	UProgressBar* SliderBar; // 0x5a8
	bool bIsHovered; // 0x5b0
	float CurrentAcceleration; // 0x5b4
	float MaxAcceleration; // 0x5b8
	float MinAcceleration; // 0x5bc
	float LinearAccelerationCoeff; // 0x5c0
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct UParticleModuleBeamSource : UParticleModuleBeamBase {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct UBTTask_PlayAnimation : UBTTaskNode {
	UAnimationAsset* AnimationToPlay; // 0x70
	char bLooping : 1; // 0x78
	char bNonBlocking : 1; // 0x78
	UBehaviorTreeComponent* MyOwnerComp; // 0x80
	USkeletalMeshComponent* CachedSkelMesh; // 0x88
};

struct UAkSurfaceReflectorSetComponent : USceneComponent {
	char bEnableSurfaceReflectors : 1; // 0x208
	TArray<FAkPoly> AcousticPolys; // 0x210
	char bEnableDiffraction : 1; // 0x220
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x220
	AActor* AssociatedRoom; // 0x228
};

struct UKSDataSocialPlayer : UObject {
	FMulticastInlineDelegate OnDataUpdate; // 0x28
	UKSPlayerInfo* Info; // 0x38
};

struct UWBP_StoreSection_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	USizeBox* CTAWrapper; // 0x528
	UImage* Image_147; // 0x530
	UHorizontalBox* RemainingContainer; // 0x538
	UGridPanel* SectionContents; // 0x540
	UTextBlock* SectionName; // 0x548
	UScaleBox* TaxContainer; // 0x550
	UTextBlock* TaxSub; // 0x558
	UTextBlock* TimeRemaining; // 0x560
	UWBP_CallToAction_C* WBP_CallToAction; // 0x568
	UWBP_Store_C* OwningStore; // 0x570
	UKSStoreSection* SectionMetaData; // 0x578
	float SectionRemainingTime; // 0x580
	float Overflow; // 0x584
	FTimerHandle TickTimer; // 0x588
	float STORE_TIMER_INTERVAL; // 0x590
	USizeBox* CTAWrapper_1; // 0x598
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x2c0
	char bDelayedStart : 1; // 0x2c8
	int32_t NumSpectators; // 0x2cc
	int32_t NumPlayers; // 0x2d0
	int32_t NumBots; // 0x2d4
	float MinRespawnDelay; // 0x2d8
	int32_t NumTravellingPlayers; // 0x2dc
	ULocalMessage* EngineMessageClass; // 0x2e0
	TArray<APlayerState*> InactivePlayerArray; // 0x2e8
	float InactivePlayerStateLifeSpan; // 0x2f8
	int32_t MaxInactivePlayers; // 0x2fc
	bool bHandleDedicatedServerReplays; // 0x300
};

struct UKSSettingsSection : UKSWidget {
	TArray<UKSSettingsGroup*> SettingsGroups; // 0x520
	UKSSettingsGroup* SettingsGroupClass; // 0x530
	UKSSettingsSectionConfigAsset* SectionConfigAsset; // 0x538
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x68
};

struct UKSActivityRewardCondition_Backfilling : UKSActivityRewardCondition {
	bool bCheckIsBackfilling; // 0x30
};

struct UKSCheatComponent : UPGame_CheatComponent {
	float WeaponStatDisplayTime; // 0xb0
	float DifficultyLevelsDisplayTime; // 0xb4
	char r_bNoCooldown : 1; // 0xb8
	char r_bNoEnergyUsage : 1; // 0xb8
	char r_bNoDamageTaken : 1; // 0xb8
	char r_CanViewHealth : 1; // 0xb8
	char r_CanViewLocation : 1; // 0xb8
	char r_HudVisible : 1; // 0xb8
	TArray<FString> CachedWeaponStats; // 0xc0
	float WeaponDisplayStartTime; // 0xd0
	TArray<FString> CachedDifficultyLevels; // 0xd8
	float DifficultyLevelsDisplayStartTime; // 0xe8
	FVector2D BaseDrawPosition; // 0xec
};

struct UPUMG_LoadoutDataFactory : UObject {
	FMulticastInlineDelegate OnLoadoutsInitialized; // 0x30
	FMulticastInlineDelegate OnLoadoutsUpdatedFromServer; // 0x40
	FMulticastInlineDelegate OnLoadoutFactoryReadyNoLoadouts; // 0x50
	FMulticastInlineDelegate OnLoadoutChanged; // 0x60
	FMulticastInlineDelegate OnLoadoutAdded; // 0x70
	FMulticastInlineDelegate OnLoadoutDeleted; // 0x80
	TArray<UPUMG_Loadout*> Loadouts; // 0x98
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2a0
	float FOVAngle; // 0x2a4
	float OrthoWidth; // 0x2a8
	UTextureRenderTarget2D* TextureTarget; // 0x2b0
	ESceneCaptureCompositeMode CompositeMode; // 0x2b8
	FPostProcessSettings PostProcessSettings; // 0x2c0
	float PostProcessBlendWeight; // 0x810
	char bOverride_CustomNearClippingPlane : 1; // 0x814
	float CustomNearClippingPlane; // 0x818
	bool bUseCustomProjectionMatrix; // 0x81c
	FMatrix CustomProjectionMatrix; // 0x820
	bool bEnableClipPlane; // 0x860
	FVector ClipPlaneBase; // 0x864
	FVector ClipPlaneNormal; // 0x870
	char bCameraCutThisFrame : 1; // 0x87c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x87c
	bool bDisableFlipCopyGLES; // 0x880
};

struct UPUMG_ViewLayer : UObject {
	UCanvasPanel* DisplayTarget; // 0x28
	UPUMG_ViewManager* MyManager; // 0x30
	EViewManagerTransitionState CurrentTransitionState; // 0x38
	TArray<FName> CurrentRouteStack; // 0x40
	TArray<FName> CurrentTransitionRouteStack; // 0x50
	TMap<FName, UPUMG_Widget*> RouteWidgetMap; // 0x60
	FName DefaultRoute; // 0xb0
	TMap<FName, UObject*> PendingRouteData; // 0xc0
	UDataTable* Routes; // 0x110
};

struct UWBP_RewardsTrackMeterSegment_C : UKSRewardsTrackMeterSegmentBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x540
	UImage* BarBackgroundFill; // 0x548
	UCanvasPanel* CanvasPanel_1; // 0x550
	UImage* MeterBase; // 0x558
	UImage* MeterGlow; // 0x560
	USpacer* MeterSpacer; // 0x568
	UBorder* ProgressBarColor; // 0x570
	UOverlay* ProgressBarContainer; // 0x578
	UTextBlock* SegmentLabel; // 0x580
	USpacer* ShearSpacerL; // 0x588
	USpacer* ShearSpacerR; // 0x590
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct AKSRefillZone : AActor {
	FGameplayTagQuery ReequipWeaponsTypeQuery; // 0x228
	FGameplayTagQuery ReloadWeaponsTypeQuery; // 0x270
	int32_t AbilityChargeToRestore; // 0x2b8
	float HealthToRestore; // 0x2bc
	bool bRefundAllShopPurchases; // 0x2c0
	float InteractTime; // 0x2c4
	UKSInteractionType* InteractionType; // 0x2c8
	FName InteractionMode; // 0x2d0
	bool bCanInteractFromBehind; // 0x2d8
	bool bForceLOS; // 0x2d9
	FText InteractPromptText; // 0x2e0
	TSet<AKSCharacter*> CurrentZoneUsers; // 0x2f8
	UKSInteractionBlockerManager* InteractionBlockerManager; // 0x348
	UKSInteractableComponent* InteractableComponent; // 0x350
};

struct UAnimInstance : UObject {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x38
	FMulticastInlineDelegate OnMontageStarted; // 0x48
	FMulticastInlineDelegate OnMontageEnded; // 0x58
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
	float SubAnimInstanceWeight; // 0x180
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct AEQSTestingPawn : ACharacter {
	UEnvQuery* QueryTemplate; // 0x4c0
	TArray<FEnvNamedValue> QueryParams; // 0x4c8
	TArray<FAIDynamicParam> QueryConfig; // 0x4d8
	float TimeLimitPerStep; // 0x4e8
	int32_t StepToDebugDraw; // 0x4ec
	EEnvQueryHightlightMode HighlightMode; // 0x4f0
	char bDrawLabels : 1; // 0x4f4
	char bDrawFailedItems : 1; // 0x4f4
	char bReRunQueryOnlyOnFinishedMove : 1; // 0x4f4
	char bShouldBeVisibleInGame : 1; // 0x4f4
	char bTickDuringGame : 1; // 0x4f4
	EEnvQueryRunMode QueryingMode; // 0x4f8
	FNavAgentProperties NavAgentProperties; // 0x500
};

struct UKSHUDComponent_GameInfo : UKSHUDComponent {
	FText Header; // 0xb0
	bool bShowTopHUDBar; // 0xc8
};

struct AKSLootCrate : AKSBlueprintableInteractable {
	int32_t SideAlignment; // 0x300
	bool bRequiresSideAlignmentToLoot; // 0x304
	bool bIsEnabled; // 0x328
	bool bIsActive; // 0x329
	bool bIsOpen; // 0x32a
	FMulticastInlineDelegate OnLootcrateInfoChangedDel; // 0x330
	FKSLootCrateInfo LootCrateInfo; // 0x340
	TArray<FKSLootItemInfo> LootItemInfos; // 0x368
};

struct UKSSwapHandlerProfile : UObject {
	TArray<FEquipPointDefinition> EquipPointDefinitions; // 0x28
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x220
	bool bAutoUpdateBounds; // 0x228
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	bool bCanBlend; // 0x58
	TArray<UMovieSceneSection*> Sections; // 0x60
};

struct UBoxFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	FTransform Transform; // 0xc0
	EFieldFalloffType Falloff; // 0xf0
};

struct UWBP_BulletedListEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	URichTextBlock* TextBlock; // 0x240
	FText Text; // 0x248
};

struct UWBP_BundleUpsellButton_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Anim_OnClick; // 0x528
	UWidgetAnimation* Anim_OnHover; // 0x530
	UImage* BtnFill; // 0x538
	UImage* BtnStroke; // 0x540
	UWBP_StoreDiscountTag_C* DiscountTag; // 0x548
	UButton* HitTarget; // 0x550
	UWBP_AsyncIcon_C* Icon; // 0x558
	UImage* Image; // 0x560
	UImage* Image_120; // 0x568
	UVerticalBox* LabelVerticalBox; // 0x570
	UTextBlock* Name; // 0x578
	FMulticastInlineDelegate OnRawClick; // 0x580
	UPUMG_StoreItem* StoreItem; // 0x590
	UAkAudioEvent* ClickSound; // 0x598
	UAkAudioEvent* HoverSound; // 0x5a0
};

struct UPGame_Effect : UObject {
	FPGame_Property m_Property; // 0x28
	bool m_bApplyOnInternal; // 0x4c
};

struct AKSProjectile_Grenade : AKSProjectile {
	TSoftClassPtr<UObject> OverlayWarningDisplayWidget; // 0x960
	FMulticastInlineDelegate OnGrenadeProximity; // 0x988
	EMarkerTeamVisibility MarkerTeamVisibility; // 0x998
	bool bTakeOverOnStopped; // 0x999
	float RepFuseTimeRemaining; // 0x99c
	float CurrentFuseTime; // 0x9a4
	FTimerHandle FuseTimerHandle; // 0x9a8
	FTimerHandle FuseCookPauseTimerHandle; // 0x9b0
	float ProximityWarningDelay; // 0x9b8
	bool bSetFuseOnBounce; // 0x9c8
	float BounceFuseTime; // 0x9cc
	bool bSetFuseOnStopped; // 0x9d0
	float StoppedFuseTime; // 0x9d4
	bool bExplodesOnStopped; // 0x9d8
	USphereComponent* DetectionSphere; // 0x9e0
	bool bGeneratesTouchSenseEvents; // 0x9e9
	UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x9f0
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UWBP_SidePanel_Left_C : UUserWidget {
	UNamedSlot* PanelContent; // 0x238
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UKSKillLeaderTracker : UKSAccoladeTracker {
	FTrackedPlayers CurrentLeader; // 0xa0
	FTrackedPlayers TempNewLeader; // 0xb8
	int32_t HighestKillCount; // 0xd0
	TArray<FTrackedPlayers> TrackedPlayers; // 0xd8
};

struct USpinBox : UWidget {
	float Value; // 0x110
	FDelegate ValueDelegate; // 0x114
	FSpinBoxStyle WidgetStyle; // 0x128
	USlateWidgetStyleAsset* Style; // 0x410
	int32_t MinFractionalDigits; // 0x418
	int32_t MaxFractionalDigits; // 0x41c
	bool bAlwaysUsesDeltaSnap; // 0x420
	float Delta; // 0x424
	float SliderExponent; // 0x428
	FSlateFontInfo Font; // 0x430
	ETextJustify Justification; // 0x480
	float MinDesiredWidth; // 0x484
	bool ClearKeyboardFocusOnCommit; // 0x488
	bool SelectAllTextOnCommit; // 0x489
	FSlateColor ForegroundColor; // 0x490
	FMulticastInlineDelegate OnValueChanged; // 0x4b8
	FMulticastInlineDelegate OnValueCommitted; // 0x4c8
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d8
	FMulticastInlineDelegate OnEndSliderMovement; // 0x4e8
	char bOverride_MinValue : 1; // 0x4f8
	char bOverride_MaxValue : 1; // 0x4f8
	char bOverride_MinSliderValue : 1; // 0x4f8
	char bOverride_MaxSliderValue : 1; // 0x4f8
	float MinValue; // 0x4fc
	float MaxValue; // 0x500
	float MinSliderValue; // 0x504
	float MaxSliderValue; // 0x508
};

struct UInterpTrackInstAkAudioRTPC : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UKSToastNotificationWidgetBase : UKSWidget {
	FMulticastInlineDelegate OnToastReceived; // 0x520
	int32_t MaxToastNotification; // 0x530
	int32_t CurrentToastCount; // 0x534
	bool IsBusy; // 0x538
	TArray<FToastData> ToastQueue; // 0x540
	TArray<FToastData> PostMatchToasts; // 0x550
};

struct UKSModInst_ProximityComponent : UKSPlayerModInstance {
	FMulticastInlineDelegate OnProximityActorAddedDel; // 0x1b8
	FMulticastInlineDelegate OnProximityActorRemovedDel; // 0x1c8
	float SphereRadius; // 0x1d8
	FKSProximityFilter ProximityFilter; // 0x1e0
	bool bDebugShowSphere; // 0x208
	USphereComponent* ManagedSphereComponent; // 0x210
	UKSProximityComponent* ManagedProximityComponent; // 0x218
	TArray<TWeakObjectPtr<AActor>> RepOverlappedActors; // 0x230
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x58
	FRichCurve YCurve; // 0xd8
	FRichCurve ZCurve; // 0x158
	FRichCurve WCurve; // 0x1d8
};

struct UWBP_WeaponMasteryBadge_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UTextBlock* LevelText; // 0x240
	UImage* Mastered; // 0x248
	UImage* MasteryMax; // 0x250
	UImage* Unmastered; // 0x258
	UWidgetSwitcher* WidgetSwitcher_88; // 0x260
};

struct UGameViewportClient : UScriptViewportClient {
	UConsole* ViewportConsole; // 0x40
	TArray<FDebugDisplayProperty> DebugProperties; // 0x48
	int32_t MaxSplitscreenPlayers; // 0x68
	UWorld* World; // 0x78
	UGameInstance* GameInstance; // 0x80
};

struct UParticleModuleRotationRate_Seeded : UParticleModuleRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UKSWeaponMasteryLevelUpSummary : UObject {
	TArray<FKSWeaponMasteryLevelUpSummaryEntry> MasteryEntries; // 0x28
};

struct UKSPayBackTracker : UKSAccoladeTracker {
	TArray<FTrackPlayerElim> PlayerElimTracker; // 0xa0
};

struct UANotifyState_MeleeCombo_C : UAnimNotifyState {
	FName ComboTarget; // 0x30
	bool IsQuickMelee; // 0x38
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct AKillCamController_C : AKSKillCamController {
	FPointerToUberGraphFrame UberGraphFrame; // 0xf30
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0xe8
	TWeakObjectPtr<UWorld> World; // 0xf8
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x100
};

struct UKSActiveDurationBar : UKSWidget {
	UKSPlayerModInstance* BoundPlayerMod; // 0x550
};

struct UKSPlayerInventoryHelper : UPUMG_PlayerInventoryHelper {
	TMap<FInventoryId, FMulticastInlineDelegate> DynamicCallbacksPerInventoryId; // 0x118
	TMap<FInventoryTypeId, FMulticastInlineDelegate> DynamicCallbacksPerInventoryTypeId; // 0x168
};

struct UKSPlayerAmmoLoaderWidget : UKSViewedActiveWeaponWidget {
	TSoftClassPtr<UObject> PendingAmmoWidgetClass; // 0x538
	UKSAmmoWidget* LoadedAmmoWidgetClass; // 0x560
};

struct USocialChatManager : UObject {
	TMap<TWeakObjectPtr<USocialUser>, USocialPrivateMessageChannel*> DirectChannelsByTargetUser; // 0x78
	TMap<FString, USocialChatRoom*> ChatRoomsById; // 0xc8
	TMap<FString, USocialReadOnlyChatChannel*> ReadOnlyChannelsByDisplayName; // 0x118
	bool bEnableChatSlashCommands; // 0x168
	TMap<FUniqueNetIdRepl, USocialGroupChannel*> GroupChannels; // 0x170
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UKSMapWidgetBase : UKSWidget {
	EDisplayType MapDisplayType; // 0x520
	bool bWasVisible; // 0x521
	uint64_t LastUpdateFrame; // 0x528
	TArray<FMapIconWidgetConfig> MapIconWidgetsToPool; // 0x530
	TArray<UKSMapIconWidgetPool*> MapIconWidgetPool; // 0x540
	TArray<UKSMapIconWidgetBase*> MapIconWidgetPoolShown; // 0x550
	TMap<AKSPlayerState*, UKSMapIconWidgetBase*> PlayerIconMap; // 0x5b0
	bool AbsoluteRotation; // 0x640
	bool CanBeScrambled; // 0x641
	bool IsScrambled; // 0x642
	bool bAffectedByScramble; // 0x643
};

struct UKSPlayerBehaviorRuleComponent : UKSBehaviorRuleBaseComponent {
	AController* FilteredPlayer; // 0xb0
	AKSTeamState* FilteredTeam; // 0xb8
	EPlayerBehaviorChangeReact PlayerSetChangeReaction; // 0xc0
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7a0
};

struct UKSBTTask_SetWeaponRanges : UBTTaskNode {
	UDataTable* WeaponRangeConfigTable; // 0x70
	FGameplayTag EquipPoint; // 0x78
	FBlackboardKeySelector IdealAttackRangeKey; // 0x80
	FBlackboardKeySelector StartAttackRangeKey; // 0xa8
};

struct UAutomationTestSettings : UObject {
	TArray<FString> EngineTestModules; // 0x28
	TArray<FString> EditorTestModules; // 0x38
	FSoftObjectPath AutomationTestmap; // 0x48
	TArray<FEditorMapPerformanceTestDefinition> EditorPerformanceTestMaps; // 0x60
	TArray<FSoftObjectPath> AssetsToOpen; // 0x70
	FBuildPromotionTestSettings BuildPromotionTest; // 0x80
	FMaterialEditorPromotionSettings MaterialEditorPromotionTest; // 0x270
	FParticleEditorPromotionSettings ParticleEditorPromotionTest; // 0x2a0
	FBlueprintEditorPromotionSettings BlueprintEditorPromotionTest; // 0x2b0
	TArray<FString> TestLevelFolders; // 0x2e0
	TArray<FExternalToolDefinition> ExternalTools; // 0x2f0
	TArray<FEditorImportExportTestDefinition> ImportExportTestDefinitions; // 0x300
	TArray<FLaunchOnTestSettings> LaunchOnSettings; // 0x310
	FIntPoint DefaultScreenshotResolution; // 0x320
};

struct URadialForceComponent : USceneComponent {
	float Radius; // 0x208
	ERadialImpulseFalloff Falloff; // 0x20c
	float ImpulseStrength; // 0x210
	char bImpulseVelChange : 1; // 0x214
	char bIgnoreOwningActor : 1; // 0x214
	float ForceStrength; // 0x218
	float DestructibleDamage; // 0x21c
	TArray<EObjectTypeQuery> ObjectTypesToAffect; // 0x220
};

struct UClothConfigNv : UClothConfigCommon {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	FVector LinearDrag; // 0x90
	FVector AngularDrag; // 0x9c
	FVector LinearInertiaScale; // 0xa8
	FVector AngularInertiaScale; // 0xb4
	FVector CentrifugalInertiaScale; // 0xc0
	float SolverFrequency; // 0xcc
	float StiffnessFrequency; // 0xd0
	float GravityScale; // 0xd4
	FVector GravityOverride; // 0xd8
	bool bUseGravityOverride; // 0xe4
	float TetherStiffness; // 0xe8
	float TetherLimit; // 0xec
	float CollisionThickness; // 0xf0
	float AnimDriveSpringStiffness; // 0xf4
	float AnimDriveDamperStiffness; // 0xf8
	EClothingWindMethod_Legacy WindMethod; // 0xfc
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x100
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x110
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x120
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x130
};

struct AMaterialInstanceActor : AActor {
	TArray<AActor*> TargetActors; // 0x220
};

struct UKSBTTask_MakeNoiseEvent : UBTTaskNode {
	float Loudness; // 0x70
	FName EventTag; // 0x74
};

struct AKSDropshipInterior : AActor {
	USceneComponent* DefaultSceneRoot; // 0x220
	USceneComponent* SharedRoot; // 0x228
	FVector StartingDoorLocation; // 0x230
	FVector StartingMeshLocation1; // 0x23c
	FVector StartingMeshLocation2; // 0x248
	FRotator StartingDoorRotator; // 0x254
	FRotator StartingMeshRotator1; // 0x260
	FRotator StartingMeshRotator2; // 0x26c
};

struct UNavigationQueryFilter : UObject {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UKSAIActorCollection : UActorComponent {
	TArray<AKSDropLocation*> DropLocations; // 0xb0
	UDataTable* BotNameTable; // 0xc0
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	ELightingScenarioQuality LightingScenarioQuality; // 0x1f4
	char bIsLightingScenario : 1; // 0x1f5
	char bTextureStreamingRotationChanged : 1; // 0x1f5
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f5
	char bIsVisible : 1; // 0x1f5
	AWorldSettings* WorldSettings; // 0x248
	TArray<UAssetUserData*> AssetUserData; // 0x258
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x278
};

struct UPlatformInterfaceWebResponse : UObject {
	FString OriginalURL; // 0x28
	int32_t ResponseCode; // 0x38
	int32_t Tag; // 0x3c
	FString StringResponse; // 0x40
	TArray<char> BinaryResponse; // 0x50
};

struct UKSWeaponAttachment_ExtMagazine : UKSWeaponAttachment {
	int32_t ClipSize; // 0x2f8
};

struct UKSBTTask_FindGrenadeTarget : UBTTaskNode {
	FBlackboardKeySelector TargetKey; // 0x70
	FBlackboardKeySelector WeaponOverrideKey; // 0x98
	FBlackboardKeySelector OutTargetLocationKey; // 0xc0
	FBlackboardKeySelector OutIntendedTargetLocationKey; // 0xe8
	bool bDrawDebug; // 0x110
};

struct UScrollBox : UPanelWidget {
	FScrollBoxStyle WidgetStyle; // 0x128
	FScrollBarStyle WidgetBarStyle; // 0x350
	USlateWidgetStyleAsset* Style; // 0x820
	USlateWidgetStyleAsset* BarStyle; // 0x828
	EOrientation Orientation; // 0x830
	ESlateVisibility ScrollBarVisibility; // 0x831
	EConsumeMouseWheel ConsumeMouseWheel; // 0x832
	FVector2D ScrollbarThickness; // 0x834
	FMargin ScrollbarPadding; // 0x83c
	bool AlwaysShowScrollbar; // 0x84c
	bool AlwaysShowScrollbarTrack; // 0x84d
	bool AllowOverscroll; // 0x84e
	bool bAnimateWheelScrolling; // 0x84f
	EDescendantScrollDestination NavigationDestination; // 0x850
	float NavigationScrollPadding; // 0x854
	EScrollWhenFocusChanges ScrollWhenFocusChanges; // 0x858
	bool bAllowRightClickDragScrolling; // 0x859
	float WheelScrollMultiplier; // 0x85c
	FMulticastInlineDelegate OnUserScrolled; // 0x860
};

struct UStandardButtonNoArt_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Highlight; // 0x528
	UNamedSlot* HighlightGroup; // 0x530
	UButton* LoadoutButton; // 0x538
	UNamedSlot* NamedSlot_1; // 0x540
	UNamedSlot* TextGroup; // 0x548
	FMulticastInlineDelegate OnClicked; // 0x550
	FMulticastInlineDelegate OnHovered; // 0x560
	FMulticastInlineDelegate OnUnhovered; // 0x570
	UAkAudioEvent* ClickStandardButtonNoArtSFX; // 0x580
	UAkAudioEvent* HoverStandardButtonNoArtSFX; // 0x588
};

struct UKSTitle : UKSItem {
	FText TitleText; // 0x250
};

struct UWindDirectionalSourceComponent : USceneComponent {
	float Strength; // 0x208
	float Speed; // 0x20c
	float MinGustAmount; // 0x210
	float MaxGustAmount; // 0x214
	float Radius; // 0x218
	char bPointWind : 1; // 0x21c
};

struct UWBP_WeaponHubCosmeticItem_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* animOnHover; // 0x528
	UImage* BtnBkg; // 0x530
	UImage* BtnBkgHover; // 0x538
	UImage* BtnFrame; // 0x540
	UOverlay* buttonwrapper; // 0x548
	UImage* Click; // 0x550
	UButton* HitTarget; // 0x558
	UWBP_KSCosmeticItemDisplay_C* ItemDisplay; // 0x560
	UWBP_ItemInfoContainer_C* ItemInfo; // 0x568
	UHorizontalBox* Root; // 0x570
	FMulticastInlineDelegate onSelected; // 0x578
};

struct UMovieSceneCameraShakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraShakeSections; // 0x58
};

struct UKSPlayerMod_Revive : UKSPlayerMod {
	float ReviveTimeMultiplier; // 0x330
	bool bHasTextOverride; // 0x334
	FText ReviveText; // 0x338
	FName ReviveInteractionMode; // 0x350
	float HealChargeMultiplier; // 0x358
};

struct UWBP_AdditiveImage_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* Texture; // 0x240
	FSlateBrush DefaultBrush; // 0x248
	UMaterialInterface* BrushMaterial; // 0x2d0
	FName ParameterName; // 0x2d8
};

struct UBloodEffectCurveComponent_C : UKSBloodSplatterComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x138
};

struct UParticleChannelContainerWrapper : UObject {
	FParticleChannelContainer Channels; // 0x28
};

struct AKSDropshipExterior : AActor {
	USceneComponent* DefaultSceneRoot; // 0x220
	USceneComponent* SharedRoot; // 0x228
	FVector StartingDoorLocation; // 0x230
	FVector StartingMeshLocation1; // 0x23c
	FVector StartingMeshLocation2; // 0x248
	FRotator StartingDoorRotator; // 0x254
	FRotator StartingMeshRotator1; // 0x260
	FRotator StartingMeshRotator2; // 0x26c
};

struct UKSDailyChallengeViewBase : UKSWidget {
	float ChallengeTimerRefreshRate; // 0x520
};

struct UKSActivityRewardCondition_WeaponUsed_OriginalAffiliation : UKSActivityRewardCondition {
	FKSAffiliationFilter AffiliationFilter; // 0x30
};

struct UKSBTTask_UpdateCachedWeapon : UBTTaskNode {
	FBlackboardKeySelector CachedWeaponClassKey; // 0x70
};

struct UWBP_RoguePerksPanel_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot; // 0x528
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot_2; // 0x530
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot_3; // 0x538
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot_4; // 0x540
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot_5; // 0x548
	UWBP_PerkDescSlot_C* WBP_PerkDescSlot_6; // 0x550
	UWBP_PerkTierHeader_C* WBP_PerkTierHeader; // 0x558
	UWBP_PerkTierHeader_C* WBP_PerkTierHeader_2; // 0x560
	UWBP_PerkTierHeader_C* WBP_PerkTierHeader_3; // 0x568
	UWBP_RoguePanelHeader_C* WBP_RoguePanelHeader; // 0x570
	UKSRogueDetailsWidget* RogueDetailsWidget; // 0x578
	UPUMG_StoreItem* StoreItem; // 0x580
};

struct ACameraShakeSourceActor : AActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x220
};

struct USoundNodeSoundClass : USoundNode {
	USoundClass* SoundClassOverride; // 0x48
};

struct UMaterialExpressionPreviousFrameSwitch : UMaterialExpression {
	FExpressionInput CurrentFrame; // 0x40
	FExpressionInput PreviousFrame; // 0x54
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
};

struct AKSTeamState : AInfo {
	int32_t r_TeamNum; // 0x220
	bool bTeamEliminated; // 0x224
	bool bTeamEliminatedOrDowned; // 0x225
	FMulticastInlineDelegate OnTeamEliminated; // 0x228
	FMulticastInlineDelegate OnTeamEliminatedOrDowned; // 0x238
	FMulticastInlineDelegate OnTeamMemberEliminatedDel; // 0x248
	FMulticastInlineDelegate OnTeamMemberDownedDel; // 0x258
	TArray<AKSPlayerState*> AllMembers; // 0x280
	TArray<AKSPlayerState*> PlayerMembers; // 0x290
	FMulticastInlineDelegate OnMemberAdded; // 0x2b0
	FMulticastInlineDelegate OnMemberRemoved; // 0x2d8
	FKSRespawnConfig RespawnConfig; // 0x300
	int32_t Respawns; // 0x318
	FMulticastInlineDelegate OnRespawnsChangedDel; // 0x320
	FMulticastInlineDelegate OnRespawnQueueChangedDel; // 0x330
	FMulticastInlineDelegate OnRespawnConfigChangedDel; // 0x340
	TArray<AKSPlayerState*> RespawnQueue; // 0x350
	TArray<UKSPersistentPlayerData*> PersistentRespawnQueue; // 0x360
	int32_t Score; // 0x370
	int32_t IntraScore; // 0x374
	int32_t IntraScoreGoal; // 0x378
	int32_t RoundWins; // 0x37c
	int32_t RoundLosses; // 0x380
	FMulticastInlineDelegate OnScoreChanged; // 0x388
	FMulticastInlineDelegate OnIntraScoreChanged; // 0x398
	FMulticastInlineDelegate OnIntraScoreGoalChanged; // 0x3a8
	FMulticastInlineDelegate OnObjectiveRoleChanged; // 0x3b8
	EExtractionTeamType TeamType; // 0x3c8
	FMulticastInlineDelegate OnPingAdded; // 0x3d0
	FMulticastInlineDelegate OnPingRemoved; // 0x3e0
	FMulticastInlineDelegate OnPingChanged; // 0x3f0
	UKSJobSelectionComponent* JobSelectionClass; // 0x400
	UKSJobSelectionComponent* JobSelectionComponent; // 0x408
	FMulticastInlineDelegate OnJobSelectionComponentReady; // 0x410
	int32_t TotalKills; // 0x468
	int32_t TotalDeaths; // 0x46c
	int32_t TotalAssists; // 0x470
	int32_t SideNum; // 0x474
	int32_t LocalSideNum; // 0x478
	TArray<UKSPersistentPlayerData*> PersistentTeamMembers; // 0x480
	FMulticastInlineDelegate OnPersistentTeamMemberAdded; // 0x490
	FMulticastInlineDelegate OnPersistentTeamMemberRemoved; // 0x4b8
	FMulticastInlineDelegate OnTeamCanSurrenderChanged; // 0x4e0
	bool bTeamCanProposeSurrender; // 0x4f0
	FMultiPlayerSkinMapReplicator SkinMapReplicator; // 0x518
};

struct AKSVehicle : AWheeledVehicle {
	UKSVehicleMovementComponent4W* KSVehicleMovementComponent; // 0x2a0
	UKSInteractionBlockerManager* InteractionBlockerManager; // 0x2a8
	UKSInteractableComponent* InteractableComponent; // 0x2b0
	TArray<UKSVehicleSeatComponent*> Seats; // 0x2b8
	TMap<AKSCharacter*, UKSVehicleSeatComponent*> RiderMap; // 0x2c8
	FMulticastInlineDelegate OnVehicleSeatingChanged; // 0x318
	FText VehicleName; // 0x328
	float TimeToGetIn; // 0x340
	float MaxSpeedToEnter; // 0x344
	float MaxAngleFromVehicleToInteract; // 0x348
	float SwapToDriverSeatHoldTime; // 0x34c
	AKSCharacter* Driver; // 0x350
	TArray<FKSRiderSeatPair> Riders; // 0x358
	TArray<AKSCharacter*> Interacters; // 0x368
	bool PreventRiderSilhouette; // 0x379
	float DetachedParachuteLinearDamping; // 0x37c
	float TimeUntilParachuteDestroyed; // 0x380
	FVector ParachuteDetachImpulse; // 0x384
	TArray<FName> ParachuteImpulseBoneNames; // 0x390
	USkeletalMeshComponent* ParachuteMesh; // 0x3a0
	FMulticastInlineDelegate OnManualDetachmentAvailable; // 0x3e8
	FMulticastInlineDelegate OnManualDetachmentUnavailable; // 0x3f8
	TArray<FName> ValidInteractionTypes; // 0x410
	USpringArmComponent* SpringArm; // 0x420
	UCameraComponent* MainCamera; // 0x428
	float RiderCameraBlendTime; // 0x448
	float RiderCameraBlendExponent; // 0x44c
	float CameraXTurnRate; // 0x450
	float CameraYTurnRate; // 0x454
	float CameraDeadZoneRate; // 0x458
	float CameraMinHorizontalAngle; // 0x45c
	float CameraMaxHorizontalAngle; // 0x460
	float CameraMinVerticalAngle; // 0x464
	float CameraMaxVerticalAngle; // 0x468
	FReplicatedViewInfo ViewInfo; // 0x46c
	float MaxHealth; // 0x474
	float CurrentHealth; // 0x478
	float CurrentHealthStage; // 0x480
	FMulticastInlineDelegate OnVehicleHealthChanged; // 0x488
	bool Destroyed; // 0x498
	FVector LocalImpulsePosition; // 0x49c
	UStaticMeshComponent* DestroyedMesh; // 0x4a8
	TArray<UPrimitiveComponent*> DamageableComponents; // 0x4b0
	TMap<float, FKSVehicleDestructionStage> HealthStages; // 0x4c8
	TMap<EDamageCategory, float> Vulnerabilities; // 0x518
	float DamageImpulseMultiplier; // 0x568
	UKSWeaponAsset* DestructionDamageWeapon; // 0x570
	UDamageType* DestructionDamageTypeClass; // 0x578
	float MinSpeedToDamageHitPlayer; // 0x5c0
	float MaxSpeedToDamageHitPlayer; // 0x5c4
	float MinPlayerDamageMultiplier; // 0x5c8
	float MaxPlayerDamageMultiplier; // 0x5cc
	float PlayerDamageCooldown; // 0x5d0
	float MinSpeedForImpactDamage; // 0x5d4
	float MaxSpeedForImpactDamage; // 0x5d8
	float MinImpactDamage; // 0x5dc
	float MaxImpactDamage; // 0x5e0
	float VehicleDamageCooldown; // 0x5e4
	float MinImpactAngleFromVehicleUp; // 0x5e8
	float MaxImpactAngleFromVehicleUp; // 0x5ec
	float MinAngleToSlideCorrect; // 0x5f0
	float MaxAngleToSlideCorrect; // 0x5f4
	float MaxSlideCorrectionSpeed; // 0x5f8
	UKSWeaponAsset* ImpactDamageWeapon; // 0x608
	UDamageType* ImpactDamageTypeClass; // 0x610
	UCapsuleComponent* PlayerHitComponent; // 0x618
};

struct UAttachmentCollection : UItemCollection {
	FText AttachmentCollectionName; // 0x98
	FText AttachmentCollectionDescription; // 0xb0
};

struct UNiagaraComponentPool : UObject {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x60
	FBoxSphereBounds ImportedBounds; // 0x68
	FBoxSphereBounds ExtendedBounds; // 0x84
	FVector PositiveBoundsExtension; // 0xa0
	FVector NegativeBoundsExtension; // 0xac
	TArray<FSkeletalMaterial> Materials; // 0xb8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xc8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xd8
	FPerPlatformInt MinLOD; // 0x138
	FPerPlatformInt MaxLod; // 0x13c
	FPerPlatformBool DisableBelowMinLodStripping; // 0x140
	EAxis SkelMirrorAxis; // 0x141
	EAxis SkelMirrorFlipAxis; // 0x142
	char bWillNeverMergeMesh : 1; // 0x143
	char bUseFullPrecisionUVs : 1; // 0x143
	char bUseHighPrecisionTangentBasis : 1; // 0x143
	char bSmoothNormalsInVertexColor : 1; // 0x143
	char bVertexCurvature : 1; // 0x143
	char bHasBeenSimplified : 1; // 0x143
	char bHasVertexColors : 1; // 0x143
	char bEnablePerPolyCollision : 1; // 0x144
	UBodySetup* BodySetup; // 0x148
	UPhysicsAsset* PhysicsAsset; // 0x150
	UPhysicsAsset* ShadowPhysicsAsset; // 0x158
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x160
	TArray<UMorphTarget*> MorphTargets; // 0x170
	UAnimInstance* PostProcessAnimBlueprint; // 0x2f8
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x300
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x310
	TArray<UAssetUserData*> AssetUserData; // 0x340
	TArray<USkeletalMeshSocket*> Sockets; // 0x358
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x378
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UMovieSceneAkAudioRTPCSection : UMovieSceneSection {
	UAkRtpc* RTPC; // 0xe0
	FString Name; // 0xe8
	FRichCurve FloatCurve; // 0xf8
	FMovieSceneFloatChannelSerializationHelper FloatChannelSerializationHelper; // 0x178
	FMovieSceneFloatChannel RTPCChannel; // 0x1a8
};

struct UKSEmoteCosmeticComponent : UKSEquipmentCosmeticComponent {
	char PawnRotationLockId; // 0x120
	int32_t EmotionInstanceId; // 0x124
	UKSEmote* EmoteAsset; // 0x158
	uint16_t PlayTicker; // 0x160
	UMultiSkinObject* SkinObject; // 0x168
	UDynamicSkinTable* SkinTable; // 0x170
	bool bIsInitialized; // 0x218
	bool bIsPlaying; // 0x219
	bool bShouldLoop; // 0x21a
	FVector LastEmotePlayedLocation; // 0x21c
	FKSEmoteInterruptTickFunction InterruptTick; // 0x230
	TArray<UKSEmoteCosmeticSubInstance*> SubInstances; // 0x288
};

struct UParticleModuleColor_Seeded : UParticleModuleColor {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UKSPollBase : UObject {
	EPollAudience PollAudience; // 0x28
	FText PollTitle; // 0x30
	FText PollSuccessfulMessage; // 0x48
	FText PollUnsuccessfulMessage; // 0x60
	FText AffirmativeOption; // 0x78
	FText NegativeOption; // 0x90
	FText AffirmativeOptionVoteCastMessage; // 0xa8
	FText NegativeOptionVoteCastMessage; // 0xc0
	float PollLengthInSeconds; // 0xd8
};

struct UKSRoundedSquareDeadZoneFilter : UKSAnalogStickFilter {
	float CardinalSize; // 0x38
	float CornerRadius; // 0x3c
};

struct UEdGraphNode_Documentation : UEdGraphNode {
	FString Link; // 0x98
	FString Excerpt; // 0xa8
};

struct UKSWeaponAttachment_VarScope : UKSWeaponAttachment_Scope {
	TArray<float> ScopeSettings; // 0x2f8
	EKSVariableScopeType ScopeType; // 0x308
};

struct UWBP_LoginRewards_ClaimScreen_C : UKSLoginRewardsModal {
	FPointerToUberGraphFrame UberGraphFrame; // 0x548
	UWidgetAnimation* TransitionIn; // 0x550
	UWidgetAnimation* TransitionOut; // 0x558
	UImage* background; // 0x560
	UImage* Decro; // 0x568
	UImage* Image_213; // 0x570
	UImage* Image_221; // 0x578
	UTextBlock* Text; // 0x580
	UTextBlock* TimeFrame; // 0x588
	UWBP_LoginRewardsGrid_C* WBP_LoginRewardsGrid; // 0x590
	UWBP_PanelDefault_C* WBP_PanelDefault; // 0x598
	UWBP_StandardButtonLarge_C* WBP_StandardButtonLarge; // 0x5a0
	UWBP_Subtitle_C* WBP_Subtitle; // 0x5a8
	UAkAudioEvent* Sound_ClaimedItem; // 0x5b0
};

struct UWBP_ChallengeEntry_SeasonalMastery_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UImage* background; // 0x240
	UTextBlock* ChallengeDescription; // 0x248
	UTextBlock* ChallengeProgressText; // 0x250
	UTextBlock* CompletedText; // 0x258
	UImage* HeaderBG; // 0x260
	UWBP_ProgressEarnedBar_C* ProgressBar; // 0x268
	UWidgetSwitcher* ProgressTextSwitcher; // 0x270
	UWBP_Challenge_Rewards_Badge_C* RewardBadge_EXAMPLE; // 0x278
	UWBP_Challenge_Rewards_Badge_C* RewardBadge_EXAMPLE_01; // 0x280
	UHorizontalBox* RewardsContainer; // 0x288
	UHorizontalBox* TimeRemainingWrapper; // 0x290
	bool IsComplete; // 0x298
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UKSActivityRewardCondition_TimeSinceReload : UKSActivityRewardCondition {
	float MinSecondsSinceLastReload; // 0x30
	float MaxSecondsSinceLastReload; // 0x34
	bool SucceedIfNeverReloaded; // 0x38
};

struct UWBP_CreateCustomGame_MapButton_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnHover; // 0x528
	UImage* ActiveFrame; // 0x530
	UButton* HitTarget; // 0x538
	UWBP_QuickPlay_MapThumbnail_C* WBP_QuickPlay_MapThumbnail; // 0x540
	FMulticastInlineDelegate OnMapSelected; // 0x548
	FMapDetail MapInfo; // 0x558
	int32_t MapId; // 0x5a0
	FMulticastInlineDelegate OnMapHovered; // 0x5a8
};

struct UMaterialExpressionArctangent2Fast : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct UWBP_CompareFoundersRow_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UOverlay* StandardCheck; // 0x240
	UOverlay* StarterCheck; // 0x248
	UNamedSlot* TextSlot; // 0x250
	bool InStarter; // 0x258
	bool InStandard; // 0x259
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x110
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x58
	char bFireEventsWhenBackwards : 1; // 0x58
	EFireEventsAtPosition EventPosition; // 0x5c
	TArray<FMovieSceneObjectBindingID> EventReceivers; // 0x60
	TArray<UMovieSceneSection*> Sections; // 0x70
};

struct UUMGSequencePlayer : UObject {
	UWidgetAnimation* Animation; // 0x408
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UKSAnimInstance : USkinnedAnimInstance {
	bool bIsInLobbyViewer; // 0x2c8
	bool bRecordAnimStats; // 0x2c9
	UKSAnimationAuditComponent* AuditingComponent; // 0x2d0
	bool bPlayingMirrorTransition; // 0x2e8
	bool bAnimMirrorDelay; // 0x2e9
	bool bDisableMirrorPose; // 0x2ea
	bool bWantsMirroredPoseCosmetic; // 0x2eb
	float PoseMirrorAlphaCosmetic; // 0x2ec
	float MirrorInterpSpeed; // 0x2f0
	float MirrorInterpSpeedEngaged; // 0x2f4
	float ShoulderSwapProgress; // 0x2f8
	ECameraShoulder CurrentShoulderCosmetic; // 0x2fc
	FBoneMirrorConfig BoneMirrorConfig; // 0x300
	ECameraShoulder CurrentShoulder; // 0x320
	bool bWantsMirroredPose; // 0x321
	float PoseMirrorAlpha; // 0x324
	bool bIsShieldActive; // 0x328
};

struct UKSDamageTypeFire : UKSDamageTypeBase {
	float FireDuration; // 0x138
};

struct UAkAuxBus : UAkAssetBase {
	UAkAudioBank* RequiredBank; // 0x58
};

struct UWBP_CustomGameConfirmation_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UHorizontalBox* buttonwrapper; // 0x528
	UPopupButton_C* CancelButton; // 0x530
	UPopupButton_C* CreateButton; // 0x538
	UTextBlock* CustomMatchMsg; // 0x540
	UImage* Decro; // 0x548
	UImage* Image_114; // 0x550
	UKSAsyncImage* MapImage; // 0x558
	USizeBox* MapImageContainer; // 0x560
	UTextBlock* Title; // 0x568
	UWBP_ModalPopupContainer_C* WBP_ModalPopupContainer; // 0x570
	FMulticastInlineDelegate OnCancelLobby; // 0x578
	FMulticastInlineDelegate OnCreateLobby; // 0x588
	UKSQueueDataFactory* QueueDataFactory; // 0x598
	int32_t QueueId; // 0x5a0
	int32_t MapId; // 0x5a4
};

struct AKSAimAssistActor : AActor {
	int32_t TeamNumOverride; // 0x230
	UKSAimAssistAnchorComponent* AimAssistAnchor; // 0x238
	TMap<FName, EHitLocationType> BoneToHitLocationTypeMap; // 0x248
	bool bCanBeKilled; // 0x298
	float MaxHealth; // 0x29c
	bool bLocallyKilled; // 0x2a0
	FAimAssistActorHealthInfo HealthInfo; // 0x2a4
};

struct AKSPlayerModManager : AInfo {
	bool bOnlyChargeModsWhenAlive; // 0x220
	AKSPlayerState* PlayerStateOwner; // 0x228
	TArray<UKSPlayerModInstance*> ActiveMods; // 0x248
};

struct UOnlineHotfixManager : UObject {
	FString OSSName; // 0x1e0
	FString HotfixManagerClassName; // 0x1f0
	FString DebugPrefix; // 0x200
	TArray<UObject*> AssetsHotfixedFromIniFiles; // 0x210
};

struct USoundClass : UObject {
	FSoundClassProperties Properties; // 0x28
	TArray<USoundClass*> ChildClasses; // 0x88
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0x98
	FSoundModulation Modulation; // 0xa8
	USoundClass* ParentClass; // 0xb8
};

struct USoundfieldEndpointSubmix : USoundSubmixBase {
	FName SoundfieldEndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	USoundfieldEndpointSettingsBase* EndpointSettings; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x58
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x60
};

struct AAkSpotReflector : AActor {
	UAkAuxBus* EarlyReflectionAuxBus; // 0x220
	FString EarlyReflectionAuxBusName; // 0x228
	UAkAcousticTexture* AcousticTexture; // 0x238
	float DistanceScalingFactor; // 0x240
	float Level; // 0x244
};

struct USkeletalMeshComponentBudgeted : USkeletalMeshComponent {
	char bAutoRegisterWithBudgetAllocator : 1; // 0xba8
	char bAutoCalculateSignificance : 1; // 0xba8
	char bShouldUseActorRenderedFlag : 1; // 0xba8
};

struct UCullingField : UFieldNodeBase {
	UFieldNodeBase* Culling; // 0xb0
	UFieldNodeBase* Field; // 0xb8
	EFieldCullingOperationType Operation; // 0xc0
};

struct UAvoidanceManager : UObject {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct UWBP_SettingsRadio_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Hover_Selected; // 0x528
	UWidgetAnimation* Hover; // 0x530
	UWidgetAnimation* Select; // 0x538
	UButton* RadioButton; // 0x540
	UTextBlock* RadioText; // 0x548
	FText DisplayText; // 0x550
	FMulticastInlineDelegate On Radio Button Selected; // 0x568
	bool bSelected; // 0x578
	UAkAudioEvent* HoverSettingsRadioSFX; // 0x580
	UAkAudioEvent* ClickSettingsRadioSFX; // 0x588
};

struct UKSAkComponent : UAkComponent {
	EOcclusionType OcclusionType; // 0x3f0
	float MinTimeBetweenOcclusionUpdates; // 0x3f4
	float OcclusionDistanceMultiplier; // 0x3f8
	int32_t OcclusionInterpolationMilliseconds; // 0x3fc
	float CurrentObstruction; // 0x400
	float CurrentOcclusion; // 0x404
	bool RequiresListenerDistance; // 0x40c
	float MinTimeBetweenDistanceUpdates; // 0x410
	bool RequiresListenerDirection; // 0x418
	float MinTimeBetweenDirectionUpdates; // 0x41c
	UBakedOcclusionLUT* LUT; // 0x428
	TArray<UAkAudioEvent*> PendingStopEvents; // 0x430
	TMap<int32_t, UAkAudioEvent*> LoopIdToStopEventMap; // 0x440
};

struct AFavoritePreviewActor_C : AKSJobSelectPreviewActor_Lobby {
	UFavoritePreviewLoadoutComponent* FavoritePreviewLoadout; // 0x5c8
};

struct UBrightLobbyHeader_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	TArray<EPUMG_LoginState> LoggedOutStates; // 0x528
	UPUMG_LoginDataFactory* LoginDataFactory; // 0x538
};

struct UJobLoadout : UObject {
	UKSJobItem* JobItem; // 0x28
	TMap<EJobLoadoutSlot, UKSItem*> SlotItems; // 0x30
};

struct UWBP_Social_Header_Cosmetic_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_AsyncIcon_C* AvatarIcon; // 0x528
	UButton* DNDToggleBtn; // 0x530
	UTextBlock* NameLabel; // 0x538
	UKSAsyncImage* PlayerBanner; // 0x540
	UWBP_ControllerPrompt_C* PlayerStatusGamepadCallout; // 0x548
	UWBP_PlayerStatus_ContextMenu_C* WBP_PlayerStatus_ContextMenu; // 0x550
	UKSPlayerInfo* CurrentPlayerInfo; // 0x558
	FMulticastInlineDelegate OnNavigationReady; // 0x560
	FMulticastInlineDelegate OnMenuShown; // 0x570
	FMulticastInlineDelegate OnMenuHidden; // 0x580
	UAkAudioEvent* ClickSocialHeaderCosmeticSFX; // 0x590
};

struct UPGameBTComposite_Random : UBTCompositeNode {
	TArray<float> Probabilities; // 0x90
};

struct UAkItemProperties : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x110
	FMulticastInlineDelegate OnPropertyDragged; // 0x120
};

struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x148
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c
	double MaxTimeSlicePerTick; // 0x150
	float HighImportanceQueryDistanceThreshold; // 0x158
	float MaxQueryImportance; // 0x160
	float SightLimitQueryImportance; // 0x164
};

struct ABP_LobbyMode_C : APGame_GameModeBase {
	USceneComponent* DefaultSceneRoot; // 0x3c8
};

struct UEditableGameplayTagQueryExpression_NoExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
	EMaterialSamplerType SamplerType; // 0x48
	char IsDefaultMeshpaintTexture : 1; // 0x49
};

struct UGameplayTask : UObject {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UKSPlayerShotListener : UActorComponent {
	FMulticastInlineDelegate MinimapShotNofify; // 0xb0
	TArray<FString> EnemyShotPingWidgetPools; // 0x118
	TSoftClassPtr<UObject> OverlayDisplayWidget; // 0x128
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	bool bDisplayHelpInAutoComplete; // 0x55
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct USourceEffectEQPreset : USoundEffectSourcePreset {
	FSourceEffectEQSettings Settings; // 0x78
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct UPlaneFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Distance; // 0xc0
	FVector Position; // 0xc4
	FVector Normal; // 0xd0
	EFieldFalloffType Falloff; // 0xdc
};

struct UPhysicsSettings : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableShapeSharing; // 0x50
	bool bEnablePCM; // 0x51
	bool bEnableStabilization; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0x58
	ESettingsLockedAxis LockedAxis; // 0x8c
	ESettingsDOF DefaultDegreesOfFreedom; // 0x8d
	float BounceThresholdVelocity; // 0x90
	EFrictionCombineMode FrictionCombineMode; // 0x94
	EFrictionCombineMode RestitutionCombineMode; // 0x95
	float MaxAngularVelocity; // 0x98
	float MaxDepenetrationVelocity; // 0x9c
	float ContactOffsetMultiplier; // 0xa0
	float MinContactOffset; // 0xa4
	float MaxContactOffset; // 0xa8
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0xac
	ECollisionTraceFlag DefaultShapeComplexity; // 0xad
	bool bDefaultHasComplexCollision; // 0xae
	bool bSuppressFaceRemapTable; // 0xaf
	bool bSupportUVFromHitResults; // 0xb0
	bool bDisableActiveActors; // 0xb1
	bool bDisableKinematicStaticPairs; // 0xb2
	bool bDisableKinematicKinematicPairs; // 0xb3
	bool bDisableCCD; // 0xb4
	bool bEnableEnhancedDeterminism; // 0xb5
	float AnimPhysicsMinDeltaTime; // 0xb8
	bool bSimulateAnimPhysicsAfterReset; // 0xbc
	float MaxPhysicsDeltaTime; // 0xc0
	bool bSubstepping; // 0xc4
	bool bSubsteppingAsync; // 0xc5
	float MaxSubstepDeltaTime; // 0xc8
	int32_t MaxSubsteps; // 0xcc
	float SyncSceneSmoothingFactor; // 0xd0
	float InitialAverageFrameRate; // 0xd4
	int32_t PhysXTreeRebuildRate; // 0xd8
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0xe0
	FBroadphaseSettings DefaultBroadphaseSettings; // 0xf0
	FChaosPhysicsSettings ChaosSettings; // 0x130
};

struct UKSPlayerMod_ShowTeamHovers : UKSPlayerMod {
	bool ShowTeamHovers; // 0x330
	int32_t Priority_ShowTeamHovers; // 0x334
	float HoverCharacterLingerExtraTime; // 0x338
	int32_t Priority_HoverCharacterLingerExtraTime; // 0x33c
};

struct UWBP_PlayerProfileScreen_AwardEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWidgetAnimation* OnHover; // 0x240
	UWidgetAnimation* FadeIn; // 0x248
	UOverlay* AwardPanelWrapper; // 0x250
	USizeBox* AwardSizeControl; // 0x258
	UOverlay* BarWrapper; // 0x260
	UWBP_KSCosmeticItemDisplay_C* BundleItem1; // 0x268
	UImage* Fill; // 0x270
	UWBP_AdditiveImage_C* Glow; // 0x278
	UImage* GlowFIll; // 0x280
	UButton* HitTarget; // 0x288
	USizeBox* IconSizeBox; // 0x290
	UImage* Image_232; // 0x298
	UImage* Image_825; // 0x2a0
	UWBP_AsyncIcon_C* ImgIcon; // 0x2a8
	UImage* PanelBG; // 0x2b0
	UImage* PanelHighlight; // 0x2b8
	USizeBox* PercentComplete; // 0x2c0
	UCanvasPanel* PnlMain; // 0x2c8
	UOverlay* RewardItemWrapper; // 0x2d0
	UHorizontalBox* RewardNameWrapper; // 0x2d8
	UTextBlock* TextBlock_160; // 0x2e0
	UWidgetSwitcher* TextSwitcher; // 0x2e8
	UTextBlock* TxtActivityDesc; // 0x2f0
	UTextBlock* TxtActivityName; // 0x2f8
	UTextBlock* TxtDate; // 0x300
	UTextBlock* TxtProgress; // 0x308
	UWBP_ProgressEarnedBar_C* WBP_ProgressEarnedBar; // 0x310
	FPlayerAwardsPanelData ActivityInstance; // 0x318
	UKSActivity* Activity; // 0x328
	bool CompactMode; // 0x330
	UAkAudioEvent* HoverAwardEntrySFX; // 0x338
};

struct UMaterialExpressionRotator : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct UBTService : UBTAuxiliaryNode {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x430
	UBodySetup* BrushBodySetup; // 0x438
};

struct UAkMediaAssetData : UObject {
	bool IsStreamed; // 0x28
	bool UseDeviceMemory; // 0x29
};

struct AKSDropshipLights : AActor {
	USceneComponent* DefaultSceneRoot; // 0x220
	USceneComponent* SharedRoot; // 0x228
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UAISense_Team : UAISense {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct UKSGroundSpreadRule : UKSGrenadeSpreadRule {
	TArray<FVector> GroundSpreadVectors; // 0x28
};

struct UGeometryCollectionCache : UObject {
	FRecordedTransformTrack RecordedData; // 0x28
	UGeometryCollection* SupportedCollection; // 0x38
	FGuid CompatibleCollectionState; // 0x40
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UWBP_ActiveBoosterShelf_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Hover; // 0x528
	UHorizontalBox* ActiveBoostContainer; // 0x530
	UImage* Bottom; // 0x538
	UButton* HitTarget; // 0x540
	UImage* Middle; // 0x548
	UCanvasPanel* Root; // 0x550
	UImage* Top; // 0x558
	UWBP_ActiveBoosterEntry_C* WBP_ActiveBoosterEntry; // 0x560
	UWBP_ActiveBoosterEntry_C* WBP_ActiveBoosterEntry_2; // 0x568
	UWBP_ActiveBoosterEntry_C* WBP_ActiveBoosterEntry_3; // 0x570
};

struct UKSPlayerInput : UPGame_PlayerInput {
	TMap<FName, FString> SavedSettingsConfig; // 0x12f0
	FVector2D GamepadLookAcceleration; // 0x1434
	float MinMouseSenseScaling; // 0x143c
	float MaxMouseSenseScaling; // 0x1440
	float TouchLookSensitivityADS; // 0x1444
	FMulticastInlineDelegate OnKeyMappingsUpdated; // 0x1450
	TMap<FName, FKSCustomInputActionKeyMappings> KSCustomActionKeyMappings; // 0x1460
	TMap<FName, FKSCustomInputAxisKeyMappings> KSCustomAxisKeyMappings; // 0x1500
	UKSAnalogStickFilter* KSLeftAnalogStickFilterClass; // 0x15a0
	UKSAnalogStickFilter* KSRightAnalogStickFilterClass; // 0x15a8
	UKSAnalogStickFilter* LeftAnalogStickFilter; // 0x15b0
	UKSAnalogStickFilter* RightAnalogStickFilter; // 0x15c8
};

struct UKSModInst_OnDamageOther : UKSPlayerModInstance {
	float MinimumDamage; // 0x1b8
	bool bUseActualDamageDone; // 0x1bc
	TArray<EDamageCategory> ValidDamageCategories; // 0x1c0
};

struct UMaterialExpressionTemporalSobol : UMaterialExpression {
	FExpressionInput Index; // 0x40
	FExpressionInput Seed; // 0x54
	uint32_t ConstIndex; // 0x68
	FVector2D ConstSeed; // 0x6c
};

struct UParticleModuleLocationSkelVertSurface : UParticleModuleLocationBase {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
	TArray<FName> PrimaryAssetTypeWrangleWhitelist; // 0x100
	bool bForceUseAllBundlesDuringLoadRecursive; // 0x110
};

struct UKSHudEditorSettings : UObject {
	bool bIsLayoutDirty; // 0x38
	TArray<FHudEditableData> HudEditableData; // 0x40
};

struct UWBP_CallToAction_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWidgetAnimation* CTAAnim; // 0x240
	UWBP_AdditiveImage_C* AdditiveBlur_Pulse; // 0x248
	UImage* BlurFar; // 0x250
	UImage* BlurNear; // 0x258
	UImage* Square; // 0x260
	UImage* Stroke; // 0x268
};

struct UKSVehicleBaseMovementComponent : UCharacterMovementComponent {
	AKSVehicleBase* VehicleBaseOwner; // 0x680
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	char bProxyIsJumpForceApplied : 1; // 0x330
	char bPressedJump : 1; // 0x330
	char bClientUpdating : 1; // 0x330
	char bClientWasFalling : 1; // 0x330
	char bClientResimulateRootMotion : 1; // 0x330
	char bClientResimulateRootMotionSources : 1; // 0x330
	char bSimGravityDisabled : 1; // 0x330
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331
	char bServerMoveIgnoreRootMotion : 1; // 0x331
	char bWasJumping : 1; // 0x331
	float JumpKeyHoldTime; // 0x334
	float JumpForceTimeRemaining; // 0x338
	float ProxyJumpForceStartedTime; // 0x33c
	float JumpMaxHoldTime; // 0x340
	int32_t JumpMaxCount; // 0x344
	int32_t JumpCurrentCount; // 0x348
	int32_t JumpCurrentCountPreJump; // 0x34c
	FMulticastInlineDelegate OnReachedJumpApex; // 0x358
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x378
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x388
	FRootMotionSourceGroup SavedRootMotion; // 0x398
	FRootMotionMovementParams ClientRootMotionParams; // 0x3d0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410
	FRepRootMotionMontage RepRootMotion; // 0x420
};

struct UAnimNotifyState_SkinnedSkelProp : UAnimNotifyState_SkinnedPropBase {
	FName AnimClassSkinKeyword; // 0x88
	UAnimMontage* ActivationMontage; // 0x90
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct UAsyncActionLoadPrimaryAssetClassList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UQosRegionManager : UObject {
	int32_t NumTestsPerRegion; // 0x28
	float PingTimeout; // 0x2c
	TArray<FQosRegionInfo> RegionDefinitions; // 0x30
	TArray<FQosDatacenterInfo> DatacenterDefinitions; // 0x40
	FDateTime LastCheckTimestamp; // 0x50
	UQosEvaluator* Evaluator; // 0x58
	EQosCompletionResult QosEvalResult; // 0x60
	TArray<FRegionQosInstance> RegionOptions; // 0x68
	FString ForceRegionId; // 0x78
	bool bRegionForcedViaCommandline; // 0x88
	FString SelectedRegionId; // 0x90
};

struct AARSkyLight : ASkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x230
};

struct UWBP_CosmeticItemTags_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWrapBox* TagsContainer; // 0x528
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry; // 0x530
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry_2; // 0x538
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry_3; // 0x540
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry_4; // 0x548
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry_5; // 0x550
	UWBP_CosmeticItemTagEntry_C* WBP_CosmeticItemTagEntry_6; // 0x558
	ETextJustify Alignment; // 0x560
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float Alpha; // 0x40
};

struct USkeletalMeshSocket : UObject {
	FName SocketName; // 0x28
	FName BoneName; // 0x30
	FVector RelativeLocation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale; // 0x50
	bool bForceAlwaysAnimated; // 0x5c
};

struct AFriendlyLobbyCharacter_C : ALobbyMainCharacter_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3ec8
	UWidgetComponent* WidgetNameplate; // 0x3ed0
	bool NeedsToSetNameplate; // 0x3ed8
	UKSPlayerInfo* PendingPlayerInfo; // 0x3ee0
};

struct UWBP_BattlePassLobbyDisplay_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* animCTALoop; // 0x528
	UWidgetAnimation* animOnHover; // 0x530
	UWidgetAnimation* animOnClick; // 0x538
	UTextBlock* BattlePassName; // 0x540
	UImage* BorderShimmer; // 0x548
	UImage* Btn_BkgHoverGradient; // 0x550
	UImage* Btn_BkgPress; // 0x558
	UImage* Btn_Fill; // 0x560
	UImage* Btn_HoverStroke; // 0x568
	UImage* Btn_Stroke; // 0x570
	UImage* BtnShimmer; // 0x578
	UOverlay* ButtonBackground; // 0x580
	UImage* CheckMark_2; // 0x588
	UWBP_ProgressEarnedBar_C* EventProgress; // 0x590
	UWBP_Header3_C* EventsHeader; // 0x598
	UImage* Fill; // 0x5a0
	UImage* Fill_2; // 0x5a8
	UImage* FillInterior_2; // 0x5b0
	UCanvasPanel* FillShimmer; // 0x5b8
	UOverlay* FinishedItemIcon_2; // 0x5c0
	UButton* HitTarget; // 0x5c8
	UOverlay* NormalItemIcon; // 0x5d0
	UWBP_KSCosmeticItemDisplay_C* RewardItem; // 0x5d8
	UWBP_BattlePassEmblem_C* WBP_BattlePassEmblem; // 0x5e0
	UWBP_CallToAction_C* WBP_CallToAction; // 0x5e8
	FName BattlePassViewed; // 0x5f0
};

struct AKSOutOfBoundsZone : AActor {
	float TickDamage; // 0x228
	float WarningDuration; // 0x22c
	bool ShouldDisableCollisionAtRoundEnd; // 0x230
};

struct UCircularThrobber : UWidget {
	int32_t NumberOfPieces; // 0x110
	float Period; // 0x114
	float Radius; // 0x118
	USlateBrushAsset* PieceImage; // 0x120
	FSlateBrush Image; // 0x128
	bool bEnableRadius; // 0x1b0
};

struct UKSPlayerMod_ActionRestrictor : UKSPlayerMod {
	bool bRestrictSprint; // 0x330
	bool bRestrictDodgeRoll; // 0x331
	bool bRestrictMantleAndVault; // 0x332
	bool bRestrictQuickMelee; // 0x333
	bool bRestrictGadgetUse; // 0x334
	bool bRestrictInteracting; // 0x335
	bool bRestrictJumping; // 0x336
	bool bRestrictCrouching; // 0x337
	bool bRestrictEmotesAndSprays; // 0x338
};

struct UPUMG_AsyncImage : UImage {
	UWidget* WaitingWidget; // 0x218
	FMulticastInlineDelegate OnAsyncImageLoadStarted; // 0x220
	FMulticastInlineDelegate OnAsyncImageLoadComplete; // 0x230
	FMulticastInlineDelegate OnAsyncImageLoadCanceled; // 0x240
	FMulticastInlineDelegate OnAsyncImageBrushChanged; // 0x250
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x670
	UAnimInstance* AnimClass; // 0x678
	UAnimInstance* AnimScriptInstance; // 0x680
	UAnimInstance* PostProcessAnimInstance; // 0x688
	FSingleAnimationPlayData AnimationData; // 0x690
	FVector RootBoneTranslation; // 0x6b8
	FVector LineCheckBoundsScale; // 0x6c4
	TArray<UAnimInstance*> LinkedInstances; // 0x710
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x720
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x730
	float GlobalAnimRateScale; // 0x760
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x764
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x765
	EAnimationMode AnimationMode; // 0x767
	char bDisablePostProcessBlueprint : 1; // 0x769
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x769
	char bHasValidBodies : 1; // 0x769
	char bBlendPhysics : 1; // 0x769
	char bEnablePhysicsOnDedicatedServer : 1; // 0x769
	char bUpdateJointsFromAnimation : 1; // 0x76a
	char bDisableClothSimulation : 1; // 0x76a
	char bDisableRigidBodyAnimNode : 1; // 0x76a
	char bAllowAnimCurveEvaluation : 1; // 0x76a
	char bDisableAnimCurves : 1; // 0x76a
	char bCollideWithEnvironment : 1; // 0x76b
	char bCollideWithAttachedChildren : 1; // 0x76b
	char bLocalSpaceSimulation : 1; // 0x76b
	char bResetAfterTeleport : 1; // 0x76b
	char bDeferKinematicBoneUpdate : 1; // 0x76b
	char bNoSkeletonUpdate : 1; // 0x76b
	char bPauseAnims : 1; // 0x76b
	char bUseRefPoseOnInitAnim : 1; // 0x76c
	char bEnablePerPolyCollision : 1; // 0x76c
	char bForceRefpose : 1; // 0x76c
	char bOnlyAllowAutonomousTickPose : 1; // 0x76c
	char bIsAutonomousTickPose : 1; // 0x76c
	char bOldForceRefPose : 1; // 0x76c
	char bShowPrePhysBones : 1; // 0x76c
	char bRequiredBonesUpToDate : 1; // 0x76c
	char bAnimTreeInitialised : 1; // 0x76d
	char bIncludeComponentLocationIntoBounds : 1; // 0x76d
	char bEnableLineCheckWithBounds : 1; // 0x76d
	char bUseBendingElements : 1; // 0x76d
	char bUseTetrahedralConstraints : 1; // 0x76d
	char bUseThinShellVolumeConstraints : 1; // 0x76d
	char bUseSelfCollisions : 1; // 0x76d
	char bUseContinuousCollisionDetection : 1; // 0x76d
	char bPropagateCurvesToSlaves : 1; // 0x76e
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x76e
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x76e
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x76e
	uint16_t CachedAnimCurveUidVersion; // 0x770
	EClothMassMode MassMode; // 0x772
	float UniformMass; // 0x774
	float TotalMass; // 0x778
	float Density; // 0x77c
	float MinPerParticleMass; // 0x780
	float ClothBlendWeight; // 0x784
	float EdgeStiffness; // 0x788
	float BendingStiffness; // 0x78c
	float AreaStiffness; // 0x790
	float VolumeStiffness; // 0x794
	float StrainLimitingStiffness; // 0x798
	float ShapeTargetStiffness; // 0x79c
	TArray<FName> DisallowedAnimCurves; // 0x7a0
	UBodySetup* BodySetup; // 0x7b0
	FMulticastInlineDelegate OnConstraintBroken; // 0x7c0
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x7d0
	float TeleportDistanceThreshold; // 0x8a8
	float TeleportRotationThreshold; // 0x8ac
	uint32_t LastPoseTickFrame; // 0x8b8
	bool bDelayedAnimTaskValid; // 0x8c8
	bool bDisableDelayedAnimTask; // 0x8c9
	UClothingSimulationInteractor* ClothingInteractor; // 0x920
	FMulticastInlineDelegate OnAnimInitialized; // 0xa50
};

struct UMaterialExpressionSphereMask : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct UAkXboxOneGDKInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXboxOneGDKApuHeapInitializationSettings ApuHeapSettings; // 0x88
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkXboxOneGDKAdvancedInitializationSettings AdvancedSettings; // 0xb8
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x48
};

struct UEnvQueryManager : UAISubsystem {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct UWBP_HolidayBundleItem_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UImage* background_image; // 0x528
	UCanvasPanel* BonusProgressWrapper; // 0x530
	UOverlay* Bundle_FREEOverlay; // 0x538
	UImage* Image; // 0x540
	UImage* Image_91; // 0x548
	UImage* Image_410; // 0x550
	UOverlay* Overlay_1; // 0x558
	UWBP_StoreItemInterior_C* PrimaryStoreItem; // 0x560
	UImage* ProgressFill; // 0x568
	UOverlay* ProgressFillWrapper; // 0x570
	UTextBlock* UnlockedPercent; // 0x578
	UWBP_AdditiveImage_C* WBP_AdditiveImage; // 0x580
	UWBP_AdditiveImage_C* WBP_AdditiveImage_C_2; // 0x588
	UWBP_StorePanelButton_C* WBP_StorePanelButton; // 0x590
	FMulticastInlineDelegate OnBundleItemClicked; // 0x598
	UKSStoreItem* StoreItem; // 0x5a8
	bool bIsCollectionReward; // 0x5b0
	float UnlockProgress; // 0x5b4
};

struct UKSModInst_OnProjectileBounce : UKSPlayerModInstance {
	bool bTrackEnemyProjectile; // 0x1b8
	bool bTrackFriendlyProjectile; // 0x1b9
	bool bTrackSelfProjectile; // 0x1ba
	bool bListenToBounce; // 0x1bb
	bool bListenToStop; // 0x1bc
};

struct UPCM_Hero_ABP_C : UKSCharacterAnimInst {
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_44; // 0x10f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_96; // 0x1208
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0x12b8
	FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_4; // 0x12f0
	FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_3; // 0x14f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x16f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_95; // 0x17e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1890
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x1980
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_73; // 0x19c0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_72; // 0x1b20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x1c80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x1d08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_94; // 0x1d90
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x1e40
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x1e80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x1f40
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x2058
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_31; // 0x2170
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_156; // 0x2240
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_30; // 0x2278
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_56; // 0x2348
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_155; // 0x2410
	FAnimNode_Slot AnimGraphNode_Slot_16; // 0x2448
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_154; // 0x24a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x24d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_55; // 0x25f0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x26b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x27d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x28e8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x2a00
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_29; // 0x2b18
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_54; // 0x2be8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_153; // 0x2cb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_53; // 0x2ce8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_93; // 0x2db0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_92; // 0x2e60
	FAnimNode_Slot AnimGraphNode_Slot_15; // 0x2f10
	FAnimNode_Slot AnimGraphNode_Slot_14; // 0x2f68
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_52; // 0x2fc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_152; // 0x3088
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_151; // 0x30c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_91; // 0x30f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_33; // 0x31a8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_33; // 0x31d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x3208
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32; // 0x3320
	FAnimNode_Fabrik AnimGraphNode_Fabrik_4; // 0x3350
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x34f0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x3608
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x3720
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_90; // 0x3838
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32; // 0x38e8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31; // 0x3918
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_89; // 0x3948
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30; // 0x39f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31; // 0x3a28
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88; // 0x3a58
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x3b08
	FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x3b40
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x3be0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x3c20
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x3ca8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x3ce8
	bool __CustomProperty_StringMantlesTogether_461224144FFC5A148A9487A371F95429; // 0x3da8
	float __CustomProperty_Max2StoryMantleHt_461224144FFC5A148A9487A371F95429; // 0x3dac
	float __CustomProperty_MaxMantleHt_461224144FFC5A148A9487A371F95429; // 0x3db0
	FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_4; // 0x3db8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x3e68
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_51; // 0x3f28
	bool __CustomProperty_EnableLayeredHandAdditives_E3950B524F93AEA4F112E2B3A71E8E86; // 0x3ff0
	bool __CustomProperty_UseHuntingRifleHold_E3950B524F93AEA4F112E2B3A71E8E86; // 0x3ff1
	bool __CustomProperty_Enable Zipline Eng Aims_E3950B524F93AEA4F112E2B3A71E8E86; // 0x3ff2
	FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_2; // 0x3ff8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_16; // 0x40a8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_15; // 0x4268
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_14; // 0x4428
	EKSMovementDirection __CustomProperty_MeleeLowerBodyDirection_3741820D49F2DBC1518975A785322FAF; // 0x45e8
	bool __CustomProperty_bEnableMeleeLowerBody_3741820D49F2DBC1518975A785322FAF; // 0x45e9
	bool __CustomProperty_bCanTransitionDirections_3741820D49F2DBC1518975A785322FAF; // 0x45ea
	bool __CustomProperty_PrototypeLocomotionGraphEnable_3741820D49F2DBC1518975A785322FAF; // 0x45eb
	bool __CustomProperty_MasterWeaponIsGrenade_3741820D49F2DBC1518975A785322FAF; // 0x45ec
	float __CustomProperty_CachedPivotAngle_3741820D49F2DBC1518975A785322FAF; // 0x45f0
	float __CustomProperty_Cached Stop Angle_3741820D49F2DBC1518975A785322FAF; // 0x45f4
	bool __CustomProperty_Dodge Rolling BP_3741820D49F2DBC1518975A785322FAF; // 0x45f8
	bool __CustomProperty_Starting a Pivot_3741820D49F2DBC1518975A785322FAF; // 0x45f9
	bool __CustomProperty_StringMantlesTogether_3741820D49F2DBC1518975A785322FAF; // 0x45fa
	float __CustomProperty_MaxMantleHt_3741820D49F2DBC1518975A785322FAF; // 0x45fc
	FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_3; // 0x4600
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_87; // 0x46b0
	FAnimNode_Slot AnimGraphNode_Slot_13; // 0x4760
	FAnimNode_Slot AnimGraphNode_Slot_12; // 0x47b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x4810
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_28; // 0x4928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_150; // 0x49f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_50; // 0x4a30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_149; // 0x4af8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30; // 0x4b30
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x4b60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x4c78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x4cb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x4ce8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x4d20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x4d58
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_71; // 0x4d90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x4ef0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_86; // 0x4f78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x5028
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_70; // 0x50b0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_69; // 0x5210
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x5370
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_68; // 0x53f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x5558
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_67; // 0x55e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x5740
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x57c8
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x5888
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_66; // 0x58c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x5a28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x5ab0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_65; // 0x5b38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x5c98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x5d20
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_64; // 0x5da8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x5f08
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85; // 0x5f90
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_63; // 0x6040
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_62; // 0x61a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x6300
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_61; // 0x6388
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_60; // 0x64e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x6648
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x66d0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_59; // 0x6758
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_84; // 0x68b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x6968
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x6a18
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x6ac8
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x6b88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x6bc8
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x6c50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x6c90
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x6d18
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x6d58
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0x6e18
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x6f30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x6fe0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_49; // 0x7090
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x7158
	FAnimNode_Slot AnimGraphNode_Slot_11; // 0x7208
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x7260
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0x7310
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x7428
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_48; // 0x74d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x75a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_47; // 0x7650
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x7718
	FAnimNode_Slot AnimGraphNode_Slot_10; // 0x77c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_148; // 0x7820
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_46; // 0x7858
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x7920
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0x79d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29; // 0x7a80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0x7ab0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29; // 0x7bc8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0x7bf8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_45; // 0x7cc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_147; // 0x7d90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_146; // 0x7dc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_145; // 0x7e00
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_44; // 0x7e38
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0x7f00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28; // 0x8018
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28; // 0x8048
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_144; // 0x8078
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0x80b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0x81c8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27; // 0x8278
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26; // 0x82a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0x82d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0x8388
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27; // 0x84a0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26; // 0x84d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0x8500
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0x8618
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25; // 0x8730
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25; // 0x8760
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_13; // 0x8790
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_143; // 0x8950
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x8988
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_142; // 0x8a58
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_7; // 0x8a90
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x8b70
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_43; // 0x8c40
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0x8d08
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_58; // 0x8db8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x8f18
	FAnimNode_Fabrik AnimGraphNode_Fabrik_3; // 0x8fa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_141; // 0x9140
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_42; // 0x9178
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_12; // 0x9240
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_41; // 0x9400
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_140; // 0x94c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_139; // 0x9500
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x9538
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_40; // 0x96d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_138; // 0x9798
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x97d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x9968
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x9a28
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x9bc0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x9d58
	FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x9e30
	FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x9f30
	FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0xa030
	FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0xa130
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_39; // 0xa230
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_137; // 0xa2f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_136; // 0xa330
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0xa368
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24; // 0xa430
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_135; // 0xa460
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_134; // 0xa498
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24; // 0xa4d0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0xa500
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0xa5c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_133; // 0xa678
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0xa6b0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23; // 0xa778
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_132; // 0xa7a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_131; // 0xa7e0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23; // 0xa818
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0xa848
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0xa910
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_130; // 0xa9d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0xaa10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0xaa48
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_57; // 0xaa80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0xabe0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_56; // 0xac68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0xadc8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0xae50
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xaf00
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xaf40
	FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_2; // 0xb030
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xb230
	FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned; // 0xb320
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0xb520
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xb5d0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0xb610
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0xb6d0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6; // 0xb798
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_129; // 0xb878
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_128; // 0xb8b0
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0xb8e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0xb9c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0xba98
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0xbb68
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0xbc30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_127; // 0xbcf8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_126; // 0xbd30
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_11; // 0xbd68
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22; // 0xbf28
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22; // 0xbf58
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_10; // 0xbf88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_125; // 0xc148
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_124; // 0xc180
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0xc1b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0xc2d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_123; // 0xc3e8
	FAnimNode_Slot AnimGraphNode_Slot_9; // 0xc420
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_122; // 0xc478
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0xc4b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_121; // 0xc578
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_120; // 0xc5b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0xc5e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xc698
	FKSAnimNode_Mirror KSAnimGraphNode_Mirror; // 0xc830
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21; // 0xc950
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21; // 0xc980
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0xc9b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_119; // 0xca60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_118; // 0xca98
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0xcad0
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0xcb98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0xcbf0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0xccc0
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_9; // 0xccf0
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_8; // 0xceb0
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_7; // 0xd070
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_6; // 0xd230
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0xd3f0
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_5; // 0xd4c0
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_4; // 0xd680
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_3; // 0xd840
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0xda00
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0xdab0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_117; // 0xdae0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0xdb18
	FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0xdbe0
	FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0xdd80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0xdf20
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0xdfd0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0xe000
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0xe030
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil_2; // 0xe060
	FKSAnimNode_Recoil KSAnimGraphNode_Recoil; // 0xe220
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0xe3e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0xe490
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0xe4c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0xe590
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_116; // 0xe658
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_55; // 0xe690
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xe7f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0xe8c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0xe990
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0xea18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_115; // 0xeae0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0xeb18
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0xeb50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0xec10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0xec48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0xec80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0xed48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0xedf8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0xeec0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0xeef0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0xef28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0xef58
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0xef90
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0xefc0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0xf088
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0xf0b8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0xf0f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0xf120
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0xf158
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0xf188
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0xf1c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0xf1f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0xf2c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0xf2f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0xf330
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0xf368
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0xf3a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0xf460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0xf4e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0xf570
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0xf5f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0xf6a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0xf758
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0xf808
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0xf890
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0xf918
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0xf9a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0xf9d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0xfaa0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_54; // 0xfad8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_53; // 0xfc38
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_52; // 0xfd98
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_51; // 0xfef8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_50; // 0x10058
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_49; // 0x101b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x10318
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0x103e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x10498
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x104d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x10508
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x10540
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x10610
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x10648
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0x10680
	bool __CustomProperty_bIsLobby_9FDD1A7146055937A755E6ACD99BC318; // 0x10758
	bool __CustomProperty_bIsServer_9FDD1A7146055937A755E6ACD99BC318; // 0x10759
	FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0x10760
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x10810
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x108d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x10910
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x10948
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0x10980
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x10a30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x10a68
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x10aa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x10af8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x10b30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x10b68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x10ba0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0x10bd8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0x10c88
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_48; // 0x10d38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x10e98
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_47; // 0x10f20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x11080
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x11108
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0x11140
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x11200
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0x11238
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x112e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x11320
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x113f0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x11428
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x11540
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0x11570
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x11688
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x116c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x116f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x117b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x11880
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x118b8
	FAnimNode_RigidBodySkipServer AnimGraphNode_RigidBodySkipServer; // 0x11980
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x11f30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x11f60
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x11f98
	FAnimNode_BlendByLOD AnimGraphNode_BlendByLOD_2; // 0x11fc8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x12078
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x120b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x120e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x12120
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x12158
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x12190
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x121c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x12200
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x12238
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x12270
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x122a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x122e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x12318
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x12350
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x12388
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x123c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x123f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x12430
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x12468
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x124a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x12560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x125e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x12670
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x126f8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_46; // 0x12780
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_45; // 0x128e0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_44; // 0x12a40
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_43; // 0x12ba0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x12d00
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0x12dd8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x12e88
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0x12f60
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x13010
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0x130e8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x13198
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x13270
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0x13320
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x133d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x13458
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x134e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x13568
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_42; // 0x135f0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_41; // 0x13750
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_40; // 0x138b0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_39; // 0x13a10
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x13b70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x13c48
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x13cf8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x13dd0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x13e80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x13f58
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x14008
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x140e0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x14190
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x14250
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x14290
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x142c0
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_7; // 0x142f0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x14410
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x14440
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_6; // 0x14470
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x14590
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x14650
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x146d8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_38; // 0x14760
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_37; // 0x148c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x14a20
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_36; // 0x14aa8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x14c08
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_35; // 0x14c90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x14df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x14ea0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x14f28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x14fb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x15038
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_34; // 0x150c0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_33; // 0x15220
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_32; // 0x15380
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_31; // 0x154e0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x15640
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x15700
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x15818
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x15848
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x15878
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x158b8
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x15940
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_30; // 0x15980
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x15ae0
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x15b68
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x15ba8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x15c30
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x15cb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x15d40
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x15dc8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x15ee0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x15f10
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x16028
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x160e8
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_5; // 0x16118
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_4; // 0x16238
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_3; // 0x16358
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x16478
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x16590
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x165c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x166d8
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_2; // 0x16708
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x16828
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x16858
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x16888
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x168b8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_29; // 0x168e8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_28; // 0x16a48
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_27; // 0x16ba8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_26; // 0x16d08
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x16e68
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_25; // 0x16ea8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x17008
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x17090
	FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x170d0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x17190
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x17240
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x17278
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x17390
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x17458
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x17490
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x17540
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x17578
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x17658
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_24; // 0x176e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x17840
	FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp; // 0x17908
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x17a28
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x17a60
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x17a90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x17ac0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x17b70
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x17ba8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x17cc0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x17dd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x17ef0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x17f28
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x17fd8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x180a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x18170
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x181a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x18258
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x18290
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x182c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x18398
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x183d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x18480
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x184b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x184f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x18528
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x18560
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x18610
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x186d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x18710
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x18748
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x18780
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x18830
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x188f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x18930
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x18968
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x18a38
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x18b50
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x18b80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x18bb0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x18cc8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x18de0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x18ea8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x18ee0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x18f18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x18f50
	FAnimNode_BlendByLOD AnimGraphNode_BlendByLOD; // 0x18f88
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x19038
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x19070
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x19138
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0x191e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x192c8
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x19300
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x19358
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x193e0
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x19490
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x194e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x195b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x195e8
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x19620
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x19678
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x19728
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_12; // 0x197e8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_11; // 0x199a8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_10; // 0x19b68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x19d28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x19d60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x19d98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x19dd0
	FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x19e80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x19f30
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x19f68
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x19fa0
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_9; // 0x19ff8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1a1b8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1a2d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x1a300
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x1a330
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_23; // 0x1a3e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1a540
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x1a5c8
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1a678
	FAnimNode_Slot AnimGraphNode_Slot; // 0x1a6d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x1a728
	FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel; // 0x1a760
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x1a7d8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x1a8b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x1a970
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x1aa20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x1aad0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1ab80
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_22; // 0x1ac08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x1ad68
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_21; // 0x1adf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1af50
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_20; // 0x1afd8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1b138
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_19; // 0x1b1c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1b320
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_18; // 0x1b3a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1b508
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_17; // 0x1b590
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x1b6f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x1b7a0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x1b850
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x1b920
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x1b958
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x1b990
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_8; // 0x1ba68
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_7; // 0x1bc28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x1bde8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x1be20
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1be58
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x1bf20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x1bff0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x1c028
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x1c0d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x1c1a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x1c1e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x1c218
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x1c2e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x1c398
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x1c448
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x1c4f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x1c530
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x1c568
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x1c638
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x1c670
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x1c720
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x1c7f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1c830
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x1c8f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x1c930
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1c9e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x1ca90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x1cb40
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_16; // 0x1cbc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x1cd28
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_15; // 0x1cdb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1cf10
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_14; // 0x1cf98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1d0f8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_13; // 0x1d180
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x1d2e0
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_12; // 0x1d368
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1d4c8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_11; // 0x1d550
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x1d6b0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x1d770
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x1d840
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1d878
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1d928
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x1d9f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1da30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x1daf8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x1dba8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1dbe0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x1dcb0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x1dd60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x1dd98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1ddd0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1dea0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1ded8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1df10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1df48
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_10; // 0x1df80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1e0e0
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1e168
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1e1a8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_9; // 0x1e230
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1e390
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_8; // 0x1e460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1e5c0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1e648
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_7; // 0x1e688
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1e7e8
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1e870
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_6; // 0x1e8b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1ea10
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ea98
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ead8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1eb98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1ec48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1ed18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x1ede0
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_6; // 0x1ee18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x1efd8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_5; // 0x1f010
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x1f1d0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x1f208
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x1f240
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x1f278
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x1f2b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1f360
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1f3e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x1f4b0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1f4e8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1f598
	FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1f6b0
	FAnimNode_Root AnimGraphNode_Root; // 0x1f7b8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_5; // 0x1f7f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1f958
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_4; // 0x1f9e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1fb40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x1fbf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1fc28
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x1fc60
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1fc98
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1fcd0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1fd08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1fdb8
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_3; // 0x1fe40
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x1ffa0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x20050
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_2; // 0x200d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x20238
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x20270
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x202a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x20378
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x20428
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x204d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x205a8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x20670
	FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned; // 0x20748
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x208b8
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_4; // 0x20940
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x20b00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x20be0
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_3; // 0x20c18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x20dd8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x20e10
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x20e48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x20e80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x20eb8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x20ef0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x20f28
	FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x20f60
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x21010
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x210d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x21188
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x21238
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x21260
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x21288
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x213a0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x213d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x21400
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x21518
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x21630
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x21748
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x21778
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x217a8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x21858
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x21890
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x21940
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x21978
	FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned; // 0x21a00
	FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x21b60
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x21c40
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_2; // 0x21d18
	FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned; // 0x21ed8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x22098
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x22158
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x22190
	float Time; // 0x221c8
	float Movement Direction; // 0x221cc
	float Save Last Yaw; // 0x221d0
	float Turn Value; // 0x221d4
	AKSCharacter* Character; // 0x221d8
	FRotator ADS Rotator; // 0x221e0
	FName Step Type; // 0x221ec
	FName Material Type; // 0x221f4
	FName Shoe Type; // 0x221fc
	FName Clothing Type; // 0x22204
	FName Roll Direction; // 0x2220c
	UAnimMontage* Cached Dodge Roll; // 0x22218
	FRotator Control Rotation; // 0x22220
	UAnimSequence* TurnWounded; // 0x22230
	float Cached Angle; // 0x22238
	float AimYawInterpSpeed; // 0x2223c
	bool bCanResetAimYaw; // 0x22240
	float AimYawInterpSpeedTarget; // 0x22244
	FTimerHandle AimYawResetTimer; // 0x22248
	float Cached Stop Angle; // 0x22250
	FMulticastInlineDelegate OnMagThrow; // 0x22258
	bool bIsAdjustingAimYaw; // 0x22268
	bool Dodge Rolling BP; // 0x22269
	UKSWeaponComponent* Master Weapon Ref; // 0x22270
	TArray<UMaster_WeaponComponent_C*> Back Holster Inventory; // 0x22278
	bool bInteraction; // 0x22288
	EKSMovementDirection locoStartDir; // 0x22289
	UAnimSequenceBase* Stop Disable Moving A; // 0x22290
	UAnimSequenceBase* Stop Disable Moving B; // 0x22298
	UAnimSequenceBase* Current Stop Disable Moving; // 0x222a0
	UAnimMontage* InteractionMontage; // 0x222a8
	float InitialDistanceFromJumpLand; // 0x222b0
	EKSMovementDirection locoStopDir; // 0x222b4
	bool Starting a Pivot; // 0x222b5
	float MaxMantleHt; // 0x222b8
	float Max2StoryMantleHt; // 0x222bc
	bool StringMantlesTogether; // 0x222c0
	bool CatchingWeapon; // 0x222c1
	FRotator StoppedRootRotation; // 0x222c4
	FVector StoppedRootLocation; // 0x222d0
	float RagdollToMontageTime; // 0x222dc
	UAnimSequence* GetUpSequence; // 0x222e0
	UAnimMontage* GetUpMontage; // 0x222e8
	FTransform RagdollPelvisTransform; // 0x222f0
	float RagdollPelvisTransformAlpha; // 0x22320
	bool EnableRagdollPelvisTransform; // 0x22324
	UAnimMontage* DownedMontage; // 0x22328
	bool Disable upper body lands; // 0x22330
	bool bWantsToNoseDive; // 0x22331
	bool bCanChangeNoseDiveState; // 0x22332
	bool bFreeFallIntroComplete; // 0x22333
	float FreeFallDiveAlpha; // 0x22334
	bool DisableTurnInPlaceCounterRotate; // 0x22338
	bool bIsInPowerSlideBP; // 0x22339
	float ExitPowerSlideBlendTime; // 0x2233c
	FRotator RootMantleWallFacing; // 0x22340
	float HitDirectionPrimary_Fwd; // 0x2234c
	float HitDirectionPrimary_Right; // 0x22350
	float HitDirectionSecondary_Fwd; // 0x22354
	float HitDirectionSecondary_Right; // 0x22358
	float CachedPivotAngle; // 0x2235c
	FRecoilInfo Melee Recoil; // 0x22360
	int32_t Melee Recoil Counter; // 0x223c0
	float HitReactionAlpha; // 0x223c4
	bool Any Grip Override Active; // 0x223c8
	bool Left Hand Grip Override; // 0x223c9
	bool Right Hand Grip Override; // 0x223ca
	bool bIsHitReacting; // 0x223cb
	bool bIsServer; // 0x223cc
	bool bUseCollar; // 0x223cd
	float CollarDirection; // 0x223d0
	bool Use EngHeadMod; // 0x223d4
	bool Master Weapon Is Grenade; // 0x223d5
	FVector ADS Hand Position L; // 0x223d8
	FVector ADS Hand Position R; // 0x223e4
	FRotator ADS Hand Rotation L; // 0x223f0
	FRotator ADS Hand Rotation R; // 0x223fc
	ADSRollControlsEnum ADS Roll Controls; // 0x22408
	float ADS Roll Interp speed; // 0x2240c
	float ADS Bump Looping Speed; // 0x22410
	float ADS Bump Interp speed; // 0x22414
	float Stop Max; // 0x22418
	float Stop Min; // 0x2241c
	float ADS Bump Time; // 0x22420
	bool ADS Bump Start; // 0x22424
	float Ads Bump Start Time Delay; // 0x22428
	float Ads Bump Stop Time Delay; // 0x2242c
	bool ADS Bump Stop; // 0x22430
	FTimerHandle ADS Bump start Run Timer; // 0x22438
	FTimerHandle ADS Bump stop Run Timer; // 0x22440
	float NonComOffset; // 0x22448
	bool ChildPhysicsAssetEnable; // 0x2244c
	bool SkinUseCharacterScale; // 0x2244d
	FVector CharacterScale; // 0x22450
	float ExitWoundedBlendOutTime; // 0x2245c
	float Constant_2; // 0x22460
	bool EngHeadAdditiveSecondaryActive; // 0x22464
	bool UseHuntingRifleHold; // 0x22465
	bool PrototypeLocomotionGraphEnable; // 0x22466
	bool Enable Zipline Eng Aims; // 0x22467
	bool EnableLayeredHandAdditives; // 0x22468
	bool DisableHand; // 0x22469
	bool UseRightWristGadgetAdditive; // 0x2246a
	bool bActiveWeaponUsesCollar; // 0x2246b
	bool DisableEngHeadAdditiveSecondary; // 0x2246c
	bool DisableEngHeadAdditivePrimary; // 0x2246d
	bool RemoveHeadAccessory; // 0x2246e
	float HeadAccessoryScaleAlphaBP; // 0x22470
	FName K2Node_CustomEvent_NotifyName_5; // 0x22474
	int32_t K2Node_CustomEvent_MontageInstanceID_5; // 0x2247c
	FName K2Node_CustomEvent_NotifyName_4; // 0x22480
	int32_t K2Node_CustomEvent_MontageInstanceID_4; // 0x22488
	FDelegate K2Node_CreateDelegate_OutputDelegate; // 0x2248c
	FName K2Node_CustomEvent_NotifyName_3; // 0x2249c
	int32_t K2Node_CustomEvent_MontageInstanceID_3; // 0x224a4
	FDelegate K2Node_CreateDelegate_OutputDelegate_2; // 0x224a8
	FName K2Node_CustomEvent_NotifyName_2; // 0x224b8
	int32_t K2Node_CustomEvent_MontageInstanceID_2; // 0x224c0
	FDelegate K2Node_CreateDelegate_OutputDelegate_3; // 0x224c4
	FName K2Node_CustomEvent_NotifyName; // 0x224d4
	int32_t K2Node_CustomEvent_MontageInstanceID; // 0x224dc
	FDelegate K2Node_CreateDelegate_OutputDelegate_4; // 0x224e0
	int32_t Temp_int_Variable; // 0x224f0
	FName Temp_name_Variable; // 0x224f4
	FName K2Node_CustomEvent_NotifyName_22; // 0x224fc
	int32_t K2Node_CustomEvent_MontageInstanceID_22; // 0x22504
	FDelegate K2Node_CreateDelegate_OutputDelegate_5; // 0x22508
	FName K2Node_CustomEvent_NotifyName_23; // 0x22518
	int32_t K2Node_CustomEvent_MontageInstanceID_23; // 0x22520
	FDelegate K2Node_CreateDelegate_OutputDelegate_6; // 0x22524
	FDelegate K2Node_CreateDelegate_OutputDelegate_7; // 0x22534
	FName K2Node_CustomEvent_NotifyName_24; // 0x22544
	int32_t K2Node_CustomEvent_MontageInstanceID_24; // 0x2254c
	FDelegate K2Node_CreateDelegate_OutputDelegate_8; // 0x22550
	FName K2Node_CustomEvent_NotifyName_25; // 0x22560
	int32_t K2Node_CustomEvent_MontageInstanceID_25; // 0x22568
	FDelegate K2Node_CreateDelegate_OutputDelegate_9; // 0x2256c
	FName Temp_name_Variable_2; // 0x2257c
	int32_t Temp_int_Variable_2; // 0x22584
	FName K2Node_CustomEvent_NotifyName_26; // 0x22588
	int32_t K2Node_CustomEvent_MontageInstanceID_26; // 0x22590
	FDelegate K2Node_CreateDelegate_OutputDelegate_10; // 0x22594
	FName K2Node_CustomEvent_NotifyName_27; // 0x225a4
	int32_t K2Node_CustomEvent_MontageInstanceID_27; // 0x225ac
	FDelegate K2Node_CreateDelegate_OutputDelegate_11; // 0x225b0
	FName Temp_name_Variable_3; // 0x225c0
	FName K2Node_CustomEvent_NotifyName_28; // 0x225c8
	int32_t K2Node_CustomEvent_MontageInstanceID_28; // 0x225d0
	FDelegate K2Node_CreateDelegate_OutputDelegate_12; // 0x225d4
	int32_t Temp_int_Variable_3; // 0x225e4
	FName K2Node_CustomEvent_NotifyName_29; // 0x225e8
	int32_t K2Node_CustomEvent_MontageInstanceID_29; // 0x225f0
	FDelegate K2Node_CreateDelegate_OutputDelegate_13; // 0x225f4
	FName K2Node_CustomEvent_NotifyName_30; // 0x22604
	int32_t K2Node_CustomEvent_MontageInstanceID_30; // 0x2260c
	FDelegate K2Node_CreateDelegate_OutputDelegate_14; // 0x22610
	FName Temp_name_Variable_4; // 0x22620
	int32_t Temp_int_Variable_4; // 0x22628
	FName K2Node_CustomEvent_NotifyName_6; // 0x2262c
	int32_t K2Node_CustomEvent_MontageInstanceID_6; // 0x22634
	FName K2Node_CustomEvent_NotifyName_31; // 0x22638
	int32_t K2Node_CustomEvent_MontageInstanceID_31; // 0x22640
	FDelegate K2Node_CreateDelegate_OutputDelegate_15; // 0x22644
	FName K2Node_CustomEvent_NotifyName_32; // 0x22654
	int32_t K2Node_CustomEvent_MontageInstanceID_32; // 0x2265c
	FDelegate K2Node_CreateDelegate_OutputDelegate_16; // 0x22660
	FName K2Node_CustomEvent_NotifyName_33; // 0x22670
	int32_t K2Node_CustomEvent_MontageInstanceID_33; // 0x22678
	FDelegate K2Node_CreateDelegate_OutputDelegate_17; // 0x2267c
	FName K2Node_CustomEvent_NotifyName_34; // 0x2268c
	int32_t K2Node_CustomEvent_MontageInstanceID_34; // 0x22694
	FDelegate K2Node_CreateDelegate_OutputDelegate_18; // 0x22698
	FName K2Node_CustomEvent_NotifyName_35; // 0x226a8
	int32_t K2Node_CustomEvent_MontageInstanceID_35; // 0x226b0
	FDelegate K2Node_CreateDelegate_OutputDelegate_19; // 0x226b4
	FDelegate K2Node_CreateDelegate_OutputDelegate_20; // 0x226c4
	FName Temp_name_Variable_5; // 0x226d4
	int32_t Temp_int_Variable_5; // 0x226dc
	float CallFunc_BreakVector2D_X; // 0x226e0
	float CallFunc_BreakVector2D_Y; // 0x226e4
	FName K2Node_CustomEvent_NotifyName_36; // 0x226e8
	int32_t K2Node_CustomEvent_MontageInstanceID_36; // 0x226f0
	FDelegate K2Node_CreateDelegate_OutputDelegate_21; // 0x226f4
	FName K2Node_CustomEvent_NotifyName_37; // 0x22704
	int32_t K2Node_CustomEvent_MontageInstanceID_37; // 0x2270c
	FDelegate K2Node_CreateDelegate_OutputDelegate_22; // 0x22710
	FName K2Node_CustomEvent_NotifyName_38; // 0x22720
	int32_t K2Node_CustomEvent_MontageInstanceID_38; // 0x22728
	FName K2Node_CustomEvent_NotifyName_39; // 0x2272c
	int32_t K2Node_CustomEvent_MontageInstanceID_39; // 0x22734
	FDelegate K2Node_CreateDelegate_OutputDelegate_23; // 0x22738
	FDelegate K2Node_CreateDelegate_OutputDelegate_24; // 0x22748
	FName K2Node_CustomEvent_NotifyName_40; // 0x22758
	int32_t K2Node_CustomEvent_MontageInstanceID_40; // 0x22760
	FDelegate K2Node_CreateDelegate_OutputDelegate_25; // 0x22764
	FName Temp_name_Variable_6; // 0x22774
	int32_t Temp_int_Variable_6; // 0x2277c
	FName K2Node_CustomEvent_NotifyName_41; // 0x22780
	int32_t K2Node_CustomEvent_MontageInstanceID_41; // 0x22788
	FDelegate K2Node_CreateDelegate_OutputDelegate_26; // 0x2278c
	FName K2Node_CustomEvent_NotifyName_7; // 0x2279c
	int32_t K2Node_CustomEvent_MontageInstanceID_7; // 0x227a4
	FName K2Node_CustomEvent_NotifyName_42; // 0x227a8
	int32_t K2Node_CustomEvent_MontageInstanceID_42; // 0x227b0
	FDelegate K2Node_CreateDelegate_OutputDelegate_27; // 0x227b4
	FName K2Node_CustomEvent_NotifyName_43; // 0x227c4
	int32_t K2Node_CustomEvent_MontageInstanceID_43; // 0x227cc
	FDelegate K2Node_CreateDelegate_OutputDelegate_28; // 0x227d0
	FName K2Node_CustomEvent_NotifyName_44; // 0x227e0
	int32_t K2Node_CustomEvent_MontageInstanceID_44; // 0x227e8
	FDelegate K2Node_CreateDelegate_OutputDelegate_29; // 0x227ec
	FName K2Node_CustomEvent_NotifyName_45; // 0x227fc
	int32_t K2Node_CustomEvent_MontageInstanceID_45; // 0x22804
	FDelegate K2Node_CreateDelegate_OutputDelegate_30; // 0x22808
	FName Temp_name_Variable_7; // 0x22818
	int32_t Temp_int_Variable_7; // 0x22820
	FName K2Node_CustomEvent_NotifyName_46; // 0x22824
	int32_t K2Node_CustomEvent_MontageInstanceID_46; // 0x2282c
	FDelegate K2Node_CreateDelegate_OutputDelegate_31; // 0x22830
	FDelegate K2Node_CreateDelegate_OutputDelegate_32; // 0x22840
	FName K2Node_CustomEvent_NotifyName_47; // 0x22850
	int32_t K2Node_CustomEvent_MontageInstanceID_47; // 0x22858
	FDelegate K2Node_CreateDelegate_OutputDelegate_33; // 0x2285c
	FName K2Node_CustomEvent_NotifyName_48; // 0x2286c
	int32_t K2Node_CustomEvent_MontageInstanceID_48; // 0x22874
	FDelegate K2Node_CreateDelegate_OutputDelegate_34; // 0x22878
	FName K2Node_CustomEvent_NotifyName_49; // 0x22888
	int32_t K2Node_CustomEvent_MontageInstanceID_49; // 0x22890
	FDelegate K2Node_CreateDelegate_OutputDelegate_35; // 0x22894
	FName K2Node_CustomEvent_NotifyName_50; // 0x228a4
	int32_t K2Node_CustomEvent_MontageInstanceID_50; // 0x228ac
	FDelegate K2Node_CreateDelegate_OutputDelegate_36; // 0x228b0
	bool Temp_bool_Variable; // 0x228c0
	bool Temp_bool_Variable_2; // 0x228c1
	float Temp_float_Variable; // 0x228c4
	bool Temp_bool_Variable_3; // 0x228c8
	bool Temp_bool_Has_Been_Initd_Variable; // 0x228c9
	FName K2Node_CustomEvent_NotifyName_8; // 0x228cc
	int32_t K2Node_CustomEvent_MontageInstanceID_8; // 0x228d4
	float Temp_float_Variable_2; // 0x228d8
	bool Temp_bool_Variable_4; // 0x228dc
	float Temp_float_Variable_3; // 0x228e0
	bool Temp_bool_IsClosed_Variable; // 0x228e4
	float Temp_float_Variable_4; // 0x228e8
	bool Temp_bool_Variable_5; // 0x228ec
	float K2Node_Select_Default; // 0x228f0
	FDelegate K2Node_CreateDelegate_OutputDelegate_37; // 0x228f4
	FName K2Node_CustomEvent_NotifyName_9; // 0x22904
	int32_t K2Node_CustomEvent_MontageInstanceID_9; // 0x2290c
	FDelegate K2Node_CreateDelegate_OutputDelegate_38; // 0x22910
	float K2Node_Select_Default_2; // 0x22920
	float K2Node_Select_Default_3; // 0x22924
	float K2Node_Select_Default_4; // 0x22928
	float K2Node_Select_Default_5; // 0x2292c
	AKSCharacter* K2Node_DynamicCast_AsKSCharacter; // 0x22930
	bool K2Node_DynamicCast_bSuccess; // 0x22938
	float K2Node_Event_Duration; // 0x2293c
	FVector2D K2Node_Event_Direction; // 0x22940
	FName K2Node_Event_NewInteractState; // 0x22948
	float K2Node_Event_NewInteractHeight; // 0x22950
	float K2Node_Event_NewInteractTime; // 0x22954
	bool K2Node_SwitchName_CmpSuccess; // 0x22958
	FName K2Node_Event_OldInteractState; // 0x2295c
	bool K2Node_SwitchName_CmpSuccess_2; // 0x22964
	FVector K2Node_Event_PivotLocation; // 0x22968
	TArray<USkeletalMeshComponent*> CallFunc_GetAncillaryMeshes_ReturnValue; // 0x22978
	TArray<USkeletalMeshComponent*> CallFunc_GetAncillaryMeshes_ReturnValue_2; // 0x22988
	USkeletalMeshComponent* CallFunc_Array_Get_Item; // 0x22998
	USkeletalMeshComponent* CallFunc_Array_Get_Item_2; // 0x229a0
	UMasterWeapon_ABP_C* K2Node_DynamicCast_AsMaster_Weapon_ABP; // 0x229a8
	bool K2Node_DynamicCast_bSuccess_2; // 0x229b0
	FVector K2Node_CustomEvent_RootLocation; // 0x229b4
	FRotator K2Node_CustomEvent_RootRotation; // 0x229c0
	FVector K2Node_Event_StopLocation; // 0x229cc
	FVector K2Node_Event_StartLocation; // 0x229d8
	EKSMovementDirection K2Node_Event_OldDirection; // 0x229e4
	EKSMovementDirection K2Node_Event_NewDirection; // 0x229e5
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID; // 0x229e8
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x229f0
	bool CallFunc_IsValid_ReturnValue; // 0x229f8
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_2; // 0x229fc
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x22a00
	bool CallFunc_IsValid_ReturnValue_2; // 0x22a08
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_3; // 0x22a0c
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x22a10
	bool CallFunc_IsValid_ReturnValue_3; // 0x22a18
	float K2Node_Event_InMantleHeight; // 0x22a1c
	bool K2Node_Event_bInVault; // 0x22a20
	float K2Node_Event_InVaultDrop; // 0x22a24
	float K2Node_Event_InUpDuration; // 0x22a28
	float K2Node_Event_InAcrossDuration; // 0x22a2c
	float K2Node_Event_InDownDuration; // 0x22a30
	FName K2Node_Event_InMantleName; // 0x22a34
	FName K2Node_CustomEvent_NotifyName_10; // 0x22a3c
	int32_t K2Node_CustomEvent_MontageInstanceID_10; // 0x22a44
	float K2Node_Event_DeltaTimeX; // 0x22a48
	FDelegate K2Node_CreateDelegate_OutputDelegate_39; // 0x22a4c
	FDelegate K2Node_CreateDelegate_OutputDelegate_40; // 0x22a5c
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_4; // 0x22a6c
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x22a70
	FDelegate K2Node_CreateDelegate_OutputDelegate_41; // 0x22a78
	bool CallFunc_IsValid_ReturnValue_5; // 0x22a88
	FDelegate K2Node_CreateDelegate_OutputDelegate_42; // 0x22a8c
	FDelegate K2Node_CreateDelegate_OutputDelegate_43; // 0x22a9c
	FName Temp_name_Variable_8; // 0x22aac
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_5; // 0x22ab4
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_5; // 0x22ab8
	FName Temp_name_Variable_9; // 0x22ac0
	bool CallFunc_IsValid_ReturnValue_6; // 0x22ac8
	FName Temp_name_Variable_10; // 0x22acc
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride; // 0x22ad4
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_6; // 0x22ad8
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_6; // 0x22ae0
	bool CallFunc_IsValid_ReturnValue_8; // 0x22ae8
	UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst; // 0x22af0
	bool K2Node_DynamicCast_bSuccess_3; // 0x22af8
	UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst_2; // 0x22b00
	bool K2Node_DynamicCast_bSuccess_4; // 0x22b08
	EKSPowerSlideEndReason K2Node_Event_EndReason; // 0x22b09
	bool K2Node_SwitchEnum_CmpSuccess; // 0x22b0a
	UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst_3; // 0x22b10
	bool K2Node_DynamicCast_bSuccess_5; // 0x22b18
	FName Temp_name_Variable_11; // 0x22b1c
	EKSMovementDirection K2Node_CustomEvent_NewMoveDirection_2; // 0x22b24
	EKSMovementDirection K2Node_CustomEvent_NewMoveDirection; // 0x22b25
	FName Temp_name_Variable_12; // 0x22b28
	UKSCharacterAnimInst* CallFunc_Map_Find_Value; // 0x22b30
	int32_t Temp_int_Variable_8; // 0x22b38
	ECombatState K2Node_Event_NewCombatState; // 0x22b3c
	bool K2Node_Event_bBlockCooldown; // 0x22b3d
	bool K2Node_Event_bForce; // 0x22b3e
	UAnimMontage* K2Node_Event_ReviveMontage; // 0x22b40
	bool K2Node_Event_bIsInAir; // 0x22b48
	UKSWeaponComponent* K2Node_Event_Weapon_2; // 0x22b50
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_7; // 0x22b58
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_7; // 0x22b60
	UKSWeaponComponent* K2Node_Event_Weapon; // 0x22b68
	bool CallFunc_IsValid_ReturnValue_12; // 0x22b70
	AKSCharacter* K2Node_CustomEvent_In_Character; // 0x22b78
	AKSCharacterFoundation* K2Node_CustomEvent_Character; // 0x22b80
	FDamageEffect K2Node_CustomEvent_Response; // 0x22b88
	AKSCharacter* K2Node_DynamicCast_AsKSCharacter_2; // 0x22bd8
	bool K2Node_DynamicCast_bSuccess_6; // 0x22be0
	FVector CallFunc_ProcessTakePointHitDamage_WorldHitLocation; // 0x22be4
	FVector CallFunc_ProcessTakePointHitDamage_WorldHitNormal; // 0x22bf0
	FVector CallFunc_ProcessTakePointHitDamage_VectorToHitSource; // 0x22bfc
	EKSMovementDirection CallFunc_ProcessTakePointHitDamage_HitDirection; // 0x22c08
	FName K2Node_CustomEvent_NotifyName_11; // 0x22c0c
	int32_t K2Node_CustomEvent_MontageInstanceID_11; // 0x22c14
	FDelegate K2Node_CreateDelegate_OutputDelegate_44; // 0x22c18
	FName K2Node_CustomEvent_NotifyName_12; // 0x22c28
	int32_t K2Node_CustomEvent_MontageInstanceID_12; // 0x22c30
	FDelegate K2Node_CreateDelegate_OutputDelegate_45; // 0x22c34
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_2; // 0x22c44
	UAnimMontage* CallFunc_GetDownedTransitionMontage_OutAnimMontage; // 0x22c48
	EKSTurnInPlaceAnimationVariant K2Node_Event_AnimationVariant; // 0x22c50
	float K2Node_Event_DelayTime; // 0x22c54
	bool K2Node_SwitchEnum_CmpSuccess_2; // 0x22c58
	FName K2Node_CustomEvent_NotifyName_13; // 0x22c5c
	int32_t K2Node_CustomEvent_MontageInstanceID_13; // 0x22c64
	FDelegate K2Node_CreateDelegate_OutputDelegate_46; // 0x22c68
	FName K2Node_CustomEvent_NotifyName_14; // 0x22c78
	int32_t K2Node_CustomEvent_MontageInstanceID_14; // 0x22c80
	FDelegate K2Node_CreateDelegate_OutputDelegate_47; // 0x22c84
	TSet<FName> K2Node_CustomEvent_Keywords; // 0x22c98
	FName K2Node_CustomEvent_NotifyName_15; // 0x22ce8
	int32_t K2Node_CustomEvent_MontageInstanceID_15; // 0x22cf0
	FDelegate K2Node_CreateDelegate_OutputDelegate_48; // 0x22cf4
	FName Temp_name_Variable_13; // 0x22d04
	int32_t Temp_int_Variable_9; // 0x22d0c
	FName K2Node_CustomEvent_NotifyName_16; // 0x22d10
	int32_t K2Node_CustomEvent_MontageInstanceID_16; // 0x22d18
	FDelegate K2Node_CreateDelegate_OutputDelegate_49; // 0x22d1c
	FName K2Node_CustomEvent_NotifyName_17; // 0x22d2c
	int32_t K2Node_CustomEvent_MontageInstanceID_17; // 0x22d34
	FDelegate K2Node_CreateDelegate_OutputDelegate_50; // 0x22d38
	bool Temp_bool_Has_Been_Initd_Variable_2; // 0x22d48
	bool CallFunc_UpdateCollarDisableLogic_PlayCollarForWepType; // 0x22d49
	FName K2Node_CustomEvent_NotifyName_18; // 0x22d4c
	int32_t K2Node_CustomEvent_MontageInstanceID_18; // 0x22d54
	FDelegate K2Node_CreateDelegate_OutputDelegate_51; // 0x22d58
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_3; // 0x22d68
	FName K2Node_CustomEvent_NotifyName_19; // 0x22d6c
	int32_t K2Node_CustomEvent_MontageInstanceID_19; // 0x22d74
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_4; // 0x22d78
	bool K2Node_CustomEvent_IsSprinting; // 0x22d79
	FDelegate K2Node_CreateDelegate_OutputDelegate_52; // 0x22d7c
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_5; // 0x22d8c
	TSet<FName> CallFunc_GetAllSkinKeywords_InOutKeywords; // 0x22d90
	FDelegate K2Node_CreateDelegate_OutputDelegate_53; // 0x22de0
	FName K2Node_CustomEvent_NotifyName_20; // 0x22df0
	int32_t K2Node_CustomEvent_MontageInstanceID_20; // 0x22df8
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_6; // 0x22dfc
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_7; // 0x22dfd
	FDelegate K2Node_CreateDelegate_OutputDelegate_54; // 0x22e00
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_8; // 0x22e10
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_9; // 0x22e11
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_8; // 0x22e14
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_8; // 0x22e18
	bool CallFunc_IsValid_ReturnValue_14; // 0x22e20
	UAnimMontage* CallFunc_Get_Roll_Animation_Set_Cached; // 0x22e28
	FName Temp_name_Variable_14; // 0x22e30
	int32_t Temp_int_Variable_10; // 0x22e38
	bool CallFunc_GetSkinnedAnimSequence_bHasOverride; // 0x22e3c
	bool Temp_bool_IsClosed_Variable_2; // 0x22e3d
	FName K2Node_CustomEvent_NotifyName_21; // 0x22e40
	int32_t K2Node_CustomEvent_MontageInstanceID_21; // 0x22e48
	bool K2Node_Event_bSetIsShieldActive; // 0x22e4c
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_9; // 0x22e50
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_9; // 0x22e58
	bool CallFunc_IsValid_ReturnValue_16; // 0x22e60
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_10; // 0x22e64
	UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_10; // 0x22e68
	bool CallFunc_IsValid_ReturnValue_17; // 0x22e70
	FDelegate K2Node_CreateDelegate_OutputDelegate_55; // 0x22e74
};

struct UMaterialExpressionArctangentFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPGame_GameInstance : UGameInstance {
	bool bLogoffOnAppSuspend; // 0x1e8
	bool bLogoffOnAppResume; // 0x1e9
	FString LastSonyMatchId; // 0x1f0
	bool bStartHotfixProcessingOnUpdateAppSettings; // 0x240
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UAkAudioType : UObject {
	uint32_t ShortID; // 0x28
	TArray<UObject*> UserData; // 0x30
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UNavCollisionBase : UObject {
	char bIsDynamicObstacle : 1; // 0x28
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UKSAudioManager : UObject {
	UKSAudioPlayerStateParameterData* AudioPlayerStateParameters; // 0x28
	TMap<FString, UDataTable*> LoadedAudioDataTables; // 0x50
	TWeakObjectPtr<UKSGameInstance> WeakGameInstance; // 0x120
};

struct AKSBotFactory : AActor {
	bool bFinishPrecacheOnBeginPlay; // 0x220
	bool bUseTeamInsteadOfSide; // 0x221
	int32_t SideNum; // 0x224
	int32_t TeamNum; // 0x228
	ECharacterBehaviorState InitialBehaviorState; // 0x22c
	bool bUseInlineSpawnCollection; // 0x22d
	UKSBotDefinitionCollection* SpawnCollectionAsset; // 0x230
	UKSBotDefinitionCollection* SpawnCollectionInline; // 0x238
	bool bSpawnHidden; // 0x240
	bool bRandomBot; // 0x241
	bool bWithoutReplacement; // 0x242
	bool bRandomLoadout; // 0x243
	bool bPreserveAIControllers; // 0x244
	bool OverrideTeamSizeFromQueue; // 0x245
	int32_t FillTeamTo; // 0x248
	bool bUseAutoWayPointSets; // 0x24c
	AKSWayPointSet* WayPointSet; // 0x250
	bool ShouldReverseWayPointSetDirection; // 0x258
	TArray<APlayerStart*> SpawnPoints; // 0x260
	int32_t SpawnOnBeginPlay; // 0x270
	int32_t SpawnOnRoundStart; // 0x274
	int32_t SpawnOnRoundSetup; // 0x278
	int32_t SpawnOnCollectionTimeout; // 0x27c
	int32_t SpawnOnHackTimeout; // 0x280
	int32_t SpawnOnEscapeTimeout; // 0x284
	int32_t SpawnOnDownloadStart; // 0x288
	int32_t SpawnOnAlarm; // 0x28c
	int32_t MinSpawnCount; // 0x290
	int32_t MaxSpawnCount; // 0x294
	bool bMaintainCountOnBotDeath; // 0x298
	TArray<AKSAIController*> ActiveBots; // 0x2a0
	AKSTeamState* TeamState; // 0x2b0
	int32_t NextSequentialSpawnStart; // 0x2b8
	int32_t CurrentLoadoutSeed; // 0x2bc
	TArray<FName> RelevantObjectiveStates; // 0x2c0
	TArray<FName> RelevantGameStatesForObjectiveSpawning; // 0x2d0
	int32_t NumberOfTimesToSpawnForObjectiveRelevancy; // 0x2e0
	UBoxComponent* RelevancyVolume; // 0x2e8
	TArray<AKSCharacter*> ContainedPlayers; // 0x2f0
	TArray<AKSObjectiveBase*> ContainedObjectives; // 0x300
};

struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UKSStoreItemWithWeaponData : UKSPurchaseData {
	UKSWeaponAsset* AssociatedWeaponAsset; // 0x58
};

struct UKSActivityRewardCondition_WeaponUsed : UKSActivityRewardCondition {
	TArray<TSoftObjectPtr<UKSItem>> MatchingWeapons; // 0x30
};

struct ULogoutCallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x58
	FRichCurve YCurve; // 0xd8
	FRichCurve ZCurve; // 0x158
};

struct UKSJobItem : UKSItem {
	bool IsStarterJob; // 0x250
	bool IsRandomJob; // 0x251
	bool AllowDuplicates; // 0x252
	TSoftObjectPtr<UKSSkinBundle> JobDefaultSkin; // 0x258
	int32_t JobSkinBundleLootTableId; // 0x280
	TSoftObjectPtr<UKSJobRole> JobRoleItem; // 0x288
	TSoftObjectPtr<UKSItem> UniqueItem; // 0x2b0
	TSoftObjectPtr<UKSItem> PrimaryWeaponOptionOne; // 0x2d8
	TSoftObjectPtr<UKSWeaponCategoryAsset> PrimaryWeaponCategoryOptionOne; // 0x300
	bool PrimaryWeaponOptionOneIsDefault; // 0x328
	TSoftObjectPtr<UKSItem> PrimaryWeaponOptionTwo; // 0x330
	TSoftObjectPtr<UKSWeaponCategoryAsset> PrimaryWeaponCategoryOptionTwo; // 0x358
	bool PrimaryWeaponOptionTwoIsDefault; // 0x380
	TSoftObjectPtr<UKSItem> SecondaryWeaponOptionOne; // 0x388
	bool SecondaryWeaponOptionOneIsDefault; // 0x3b0
	TSoftObjectPtr<UKSItem> SecondaryWeaponOptionTwo; // 0x3b8
	bool SecondaryWeaponOptionTwoIsDefault; // 0x3e0
	TSoftObjectPtr<UKSItem> MeleeWeapon; // 0x3e8
	TSoftObjectPtr<UKSItem> QuickMeleeWeapon; // 0x410
	TArray<TSoftObjectPtr<UKSItem>> Passives; // 0x438
	TSoftObjectPtr<UKSItem> GadgetOptionOne; // 0x448
	bool GadgetOptionOneIsDefault; // 0x470
	TSoftObjectPtr<UKSItem> GadgetOptionTwo; // 0x478
	bool GadgetOptionTwoIsDefault; // 0x4a0
	TSoftObjectPtr<UKSItem> PerkOptionOne; // 0x4a8
	bool PerkOptionOneIsDefault; // 0x4d0
	TSoftObjectPtr<UKSItem> PerkOptionTwo; // 0x4d8
	bool PerkOptionTwoIsDefault; // 0x500
	TSoftObjectPtr<UKSItem> PerkOptionThree; // 0x508
	bool PerkOptionThreeIsDefault; // 0x530
	TSoftObjectPtr<UKSItem> PerkOptionFour; // 0x538
	bool PerkOptionFourIsDefault; // 0x560
	TSoftObjectPtr<UKSItem> PerkOptionFive; // 0x568
	bool PerkOptionFiveIsDefault; // 0x590
	TSoftObjectPtr<UKSItem> PerkOptionSix; // 0x598
	bool PerkOptionSixIsDefault; // 0x5c0
	TSoftObjectPtr<UKSItem> GambitOptionOne; // 0x5c8
	bool GambitOptionOneIsDefault; // 0x5f0
	TSoftObjectPtr<UKSItem> GambitOptionTwo; // 0x5f8
	bool GambitOptionTwoIsDefault; // 0x620
	TSoftObjectPtr<UKSItem> GambitOptionThree; // 0x628
	bool GambitOptionThreeIsDefault; // 0x650
	TSoftObjectPtr<UKSItem> GambitOptionFour; // 0x658
	bool GambitOptionFourIsDefault; // 0x680
	TSoftObjectPtr<UKSItem> GambitOptionFive; // 0x688
	bool GambitOptionFiveIsDefault; // 0x6b0
	TSoftObjectPtr<UKSItem> GambitOptionSix; // 0x6b8
	bool GambitOptionSixIsDefault; // 0x6e0
	TArray<TSoftObjectPtr<UKSEmote>> DefaultEmotes; // 0x6e8
	TArray<TSoftObjectPtr<UKSQuip>> DefaultQuips; // 0x6f8
	TArray<TSoftObjectPtr<UKSCommunication>> DefaultCommunications; // 0x708
	TArray<TSoftObjectPtr<UKSSpray>> DefaultSprays; // 0x718
	TSoftObjectPtr<UKSItem> DefaultWingsuit; // 0x728
	TArray<FSoftObjectPath> LobbyPropsToPreload; // 0x750
	TSoftObjectPtr<UTexture2D> SmallJobIcon; // 0x760
	TSoftObjectPtr<UTexture2D> JobPortrait; // 0x788
	TSoftObjectPtr<UTexture2D> JobDiamondPortrait; // 0x7b0
	TSoftObjectPtr<UTexture2D> JobSquarePortrait; // 0x7d8
};

struct UKSComponentReticleWidgetBase : UKSActiveWeaponComponentWidget {
	float ShrinkAnimationTime; // 0x5e8
	float BlockedShotIconMaxScale; // 0x5ec
	float BlockedShotIconMinScale; // 0x5f0
	float BlockedShotMinScaleSqDist; // 0x5f4
	bool bGrenadeCooking; // 0x5f8
	bool bInADS; // 0x5f9
	bool bCachedBlockIconVisible; // 0x5fa
	float CachedWeaponAccuracy; // 0x5fc
	float CachedReticleOffset; // 0x600
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct UMovieSceneStringSection : UMovieSceneSection {
	FMovieSceneStringChannel StringCurve; // 0xe0
};

struct AKSInspectableMusicManagerActor : AActor {
	UAkAudioEvent* AkEvent; // 0x220
	TArray<FName> NamesForRtpcQueries; // 0x228
	TArray<FName> NamesForSwitchQueries; // 0x238
	bool bQueryResultsReady; // 0x2f0
	int32_t StaleCounter; // 0x2f4
};

struct UVerticalBoxSlot : UPanelSlot {
	FSlateChildSize Size; // 0x38
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UPUMG_PlayerWhoDataFactory : UPUMG_DataFactory {
	FMulticastInlineDelegate OnSearchByNameResultsUpdated; // 0x38
	TArray<UPUMG_PlayerInfo*> CachedSearchByNameResults; // 0x48
};

struct UTextPropertyTestObject : UObject {
	FText DefaultedText; // 0x28
	FText UndefaultedText; // 0x40
	FText TransientText; // 0x58
};

struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; // 0x90
	float FloatValue; // 0x94
	FString StringValue; // 0x98
	FString CachedDescription; // 0xa8
	char OperationType; // 0xb8
	EBTBlackboardRestart NotifyObserver; // 0xb9
};

struct UKSPlayerMod_HideFromTeam : UKSPlayerMod {
	bool bHideFriendlyStencil; // 0x330
	bool bNoFriendlyDrone; // 0x331
};

struct UKSEquipAllWidget : UKSWidget {
	UKSEquipAllData* EquipAllData; // 0x520
};

struct UWBP_LerpingBar_C : UKSFloatTickLerpWidgetBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* BarImage; // 0x268
	FLinearColor BarColor; // 0x270
};

struct UWBP_EventScreen_HolidayY1_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* AnimOnShown; // 0x528
	UBorder* BonusTooltip; // 0x530
	UVerticalBox* ChallengesContainer; // 0x538
	UImage* Image_148; // 0x540
	UImage* Image_334; // 0x548
	UImage* Image_497; // 0x550
	UImage* Image_683; // 0x558
	UHorizontalBox* RemainingContainer; // 0x560
	URichTextBlock* RichTextBlock_1; // 0x568
	UTextBlock* TimeRemaining; // 0x570
	UTextBlock* TimeRemainingVal; // 0x578
	UWBP_ChallengeEntry_Event_C* WBP_ChallengeEntry_Event; // 0x580
	UWBP_ChallengeEntry_Event_C* WBP_ChallengeEntry_Event_2; // 0x588
	UWBP_ChallengeEntry_Event_C* WBP_ChallengeEntry_Event_3; // 0x590
	UWBP_Header1_C* WBP_Header1_2; // 0x598
	UWBP_Header2_C* WBP_Header2; // 0x5a0
	UWBP_HolidayBundleItem_C* WBP_HolidayBundleItem_2; // 0x5a8
	UWBP_HolidayBundleItem_C* WBP_HolidayBundleItem_3; // 0x5b0
	UWBP_HolidayBundleItem_C* WBP_HolidayBundleItem_Free; // 0x5b8
	FName Current Challenge Data Table Row; // 0x5c0
	FGameplayTag Current Challenge Data Table Tag; // 0x5c8
	int32_t BundleFocusGroup; // 0x5d0
	int32_t ChallengesFocusGroup; // 0x5d4
	int32_t SnowPatrolScorchBundleID; // 0x5d8
	int32_t DoctorFrostySaintBundleID; // 0x5dc
	int32_t MistletoeVyBundleID; // 0x5e0
	FName HolidayEventLocalAction; // 0x5e4
	int32_t CurrentFocusGroup; // 0x5ec
	int32_t EventTimeRemaining; // 0x5f0
	float Time Count; // 0x5f4
};

struct UWBP_PlayerContextMenu_C : UKSContextMenu {
	FPointerToUberGraphFrame UberGraphFrame; // 0x570
	UWidgetAnimation* ShowAnim; // 0x578
	UOverlay* AliasContainer; // 0x580
	UImage* Image_160; // 0x588
	UVerticalBox* MenuContainer; // 0x590
	UImage* OptionsBgA; // 0x598
	UImage* OptionsBgB; // 0x5a0
	UVerticalBox* OptionsContainerA; // 0x5a8
	UVerticalBox* OptionsContainerB; // 0x5b0
	USizeBox* OuterMenuContainer; // 0x5b8
	UWBP_player_card_module_C* PlayerCard; // 0x5c0
	UCanvasPanel* ScreenCanvas; // 0x5c8
	UVerticalBox* VerticalBox_1; // 0x5d0
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID; // 0x5d8
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID_2; // 0x5e0
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID_3; // 0x5e8
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID_4; // 0x5f0
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID_5; // 0x5f8
	UWBP_Social_Platform_ID_C* WBP_Social_Platform_ID_6; // 0x600
	UWBP_VoiceActivityContainer_C* WBP_VoiceActivityContainer; // 0x608
	FMulticastInlineDelegate OnReadyForNavigation; // 0x610
	FMulticastInlineDelegate OnMenuHidden; // 0x620
	FMulticastInlineDelegate OnMenuStart; // 0x630
	TArray<FKey> KeysToAllow; // 0x640
	TScriptInterface<IIKSContextMenuTarget_C> Last Interacted Target; // 0x650
	FMulticastInlineDelegate OnReportPlayer_1; // 0x660
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UAISenseEvent_Hearing : UAISenseEvent {
	FAINoiseEvent Event; // 0x28
};

struct UMaterialExpressionSpeedTree : UMaterialExpression {
	FExpressionInput GeometryInput; // 0x40
	FExpressionInput WindInput; // 0x54
	FExpressionInput LODInput; // 0x68
	FExpressionInput ExtraBendWS; // 0x7c
	ESpeedTreeGeometryType GeometryType; // 0x90
	ESpeedTreeWindType WindType; // 0x91
	ESpeedTreeLODType LODType; // 0x92
	float BillboardThreshold; // 0x94
	bool bAccurateWindVelocities; // 0x98
};

struct AFriendlyLobbyPreviewActor_C : AKSJobSelectPreviewActor_Lobby {
	UPlayerInfoPrevwLoadoutComponent* PlayerInfoLoadoutComponent; // 0x5c8
};

struct UWBP_Guided_Tutorial_Tips_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnHidden; // 0x528
	UWidgetAnimation* OnShow; // 0x530
	UWidgetAnimation* hover_anim; // 0x538
	UOverlay* background; // 0x540
	UWBP_StandardButtonLarge_C* GotItButton; // 0x548
	UImage* Image_1; // 0x550
	UImage* Image_3; // 0x558
	UImage* Image_130; // 0x560
	UWBP_Guided_Tutorial_Card_C* WBP_Guided_Tutorial_Card; // 0x568
	UWBP_Guided_Tutorial_Card_C* WBP_Guided_Tutorial_Card_2; // 0x570
	UWBP_Guided_Tutorial_Card_C* WBP_Guided_Tutorial_Card_3; // 0x578
	UWBP_Header1_C* WBP_Header1; // 0x580
	UWBP_panel_bevel_C* WBP_panel_bevel; // 0x588
	UWBP_panel_bevel_C* WBP_panel_bevel_C_1; // 0x590
	EPUMG_LoginState LoginState; // 0x598
	EConfigPropertyGuidedCalloutScenes CurrentTipScreen; // 0x599
	UAkAudioEvent* ShowGuidedTutorialTipsSFX; // 0x5a0
	UAkAudioEvent* NavBackGuidedTutorialTipsSFX; // 0x5a8
};

struct UAkWwiseTree : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x110
	FMulticastInlineDelegate OnItemDragged; // 0x120
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct UDatasmithDeltaGenSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bRemoveInvisibleNodes; // 0x4a
	bool bSimplifyNodeHierarchy; // 0x4b
	bool bImportVar; // 0x4c
	FString VarPath; // 0x50
	bool bImportPos; // 0x60
	FString PosPath; // 0x68
	bool bImportTml; // 0x78
	FString TmlPath; // 0x80
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UTestMovieSceneTrack : UMovieSceneTrack {
	bool bHighPassFilter; // 0x58
	TArray<UMovieSceneSection*> SectionArray; // 0x60
};

struct UEnvQueryGenerator_ProjectedPoints : UEnvQueryGenerator {
	FEnvTraceData ProjectionData; // 0x50
};

struct UKSBTTask_RandomizeWayPointDefensePoint : UBTTaskNode {
	FBlackboardKeySelector WayPoint; // 0x70
	FBlackboardKeySelector DefensePoint; // 0x98
};

struct AKSProjectile_Pierce : AKSProjectile {
	float ProjectileEdgeTolerance; // 0x950
	ETraceTypeQuery TraceChannel; // 0x954
	TArray<EObjectTypeQuery> ObjectTypes; // 0x958
	bool bDrawDebugLine; // 0x968
	TArray<AActor*> AlreadyHitActors; // 0x970
	bool bHasHitWall; // 0x980
	bool bHasHitEnemy; // 0x981
};

struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UMaterialExpressionPerInstanceCustomData : UMaterialExpression {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct UBrainComponent : UActorComponent {
	UBlackboardComponent* BlackboardComp; // 0xb8
	AAIController* AIOwner; // 0xc0
};

struct UKSPlayerMod_Activated : UKSPlayerMod {
	bool bIsCharacterAbility; // 0x330
	int32_t RequiredCharge; // 0x334
	int32_t MaximumCharge; // 0x338
	int32_t DefaultCharge; // 0x33c
	bool bRemoveIfExhausted; // 0x340
	float RefundFactor; // 0x344
	bool bHasLockout; // 0x348
	float LockoutTime; // 0x34c
	bool bCanActivateBeforeRoundStart; // 0x350
	bool bIgnoreNoFireZone; // 0x351
	bool bIgnoreWeaponFireCheck; // 0x352
	bool bEndOnDown; // 0x353
	bool bEndOnDeath; // 0x354
	TArray<TSoftObjectPtr<UKSPlayerMod>> BuffsGivenOnActivation; // 0x358
	bool bKeepsTeamAliveIfUsable; // 0x368
	bool bKeepsTeamAliveIfActive; // 0x369
	float AbilitySetupDuration; // 0x36c
	bool bSetupLagCompensation; // 0x370
	float AbilityDuration; // 0x374
	float MaximumBonusDuration; // 0x378
	bool bCapBonusDuration; // 0x37c
	float AbilityEndWarningTime; // 0x380
	float AbilityRecoveryDuration; // 0x384
	bool bSelectableNormally; // 0x388
	bool bSelectableWhileDowned; // 0x389
	float ChargePerSecond; // 0x38c
	float ChargePerHundredPoints; // 0x390
	UCameraShake* CameraShake; // 0x398
	FText ActivateWhileDownedPromptText; // 0x3a0
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UParticleModuleOrbitBase : UParticleModule {
	char bUseEmitterTime : 1; // 0x30
};

struct UProceduralMeshComponent : UMeshComponent {
	bool bUseComplexAsSimpleCollision; // 0x460
	bool bUseAsyncCooking; // 0x461
	UBodySetup* ProcMeshBodySetup; // 0x468
	TArray<FProcMeshSection> ProcMeshSections; // 0x470
	TArray<FKConvexElem> CollisionConvexElems; // 0x480
	FBoxSphereBounds LocalBounds; // 0x490
	TArray<UBodySetup*> AsyncBodySetupQueue; // 0x4b0
};

struct UWBP_ButtonSlot_Cosmetic_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* hoverNoZoom; // 0x528
	UWidgetAnimation* OnSelect; // 0x530
	UWidgetAnimation* HueShiftRed; // 0x538
	UWidgetAnimation* OnHover; // 0x540
	UImage* ActiveFrame; // 0x548
	UImage* ActiveFrame_Locked; // 0x550
	UBorder* BaseColorWrapper; // 0x558
	UImage* BaseStroke; // 0x560
	UNamedSlot* ButtonContent; // 0x568
	UImage* ClickFill; // 0x570
	UImage* EquippedFrame; // 0x578
	UImage* GradientFill; // 0x580
	UImage* GradientFillLight; // 0x588
	UBorder* HighlightColorWrapper; // 0x590
	UImage* highlightstroke; // 0x598
	UButton* HitTarget; // 0x5a0
	UImage* Image_115; // 0x5a8
	UImage* LockedDimmer; // 0x5b0
	UImage* LockIcon; // 0x5b8
	UBorder* MythicFrame_ColorWrapper; // 0x5c0
	UImage* SelectedFrame; // 0x5c8
	UWidgetSwitcher* SelectedFrameSwitcher; // 0x5d0
	FMulticastInlineDelegate OnBtnClicked; // 0x5d8
	FMulticastInlineDelegate OnBtnHovered; // 0x5e8
	FMulticastInlineDelegate OnBtnUnhovered; // 0x5f8
	bool bIsDisable; // 0x608
	bool bIsActive; // 0x609
	FLinearColor TintColor; // 0x60c
	bool bColorOverride; // 0x61c
	UAkAudioEvent* ClickBtnSlotCosmeticSFX; // 0x620
	UAkAudioEvent* HoverBtnSlotCosmeticSFX; // 0x628
};

struct UWrapBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	bool bFillEmptySpace; // 0x48
	float FillSpanWhenLessThan; // 0x4c
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UAISense_Prediction : UAISense {
	TArray<FAIPredictionEvent> RegisteredEvents; // 0x80
};

struct USpacer : UWidget {
	FVector2D Size; // 0x110
};

struct UDatasmithCineCameraComponentTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraFilmbackSettingsTemplate FilmbackSettings; // 0x30
	FDatasmithCameraLensSettingsTemplate LensSettings; // 0x38
	FDatasmithCameraFocusSettingsTemplate FocusSettings; // 0x3c
	float CurrentFocalLength; // 0x44
	float CurrentAperture; // 0x48
	FDatasmithPostProcessSettingsTemplate PostProcessSettings; // 0x50
};

struct UAISystemBase : UObject {
	FSoftClassPath AISystemClassName; // 0x28
	FName AISystemModuleName; // 0x40
	bool bInstantiateAISystemOnClient; // 0x50
};

struct UInputRouter : UObject {
	bool bAutoInvalidateOnHover; // 0x28
	bool bAutoInvalidateOnCapture; // 0x29
	UInputBehaviorSet* ActiveInputBehaviors; // 0x38
};

struct UGizmoAxisScaleParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	float Parameter; // 0x6c
	FGizmoFloatParameterChange LastChange; // 0x70
	FVector CurScaleAxis; // 0x78
	FVector CurScaleOrigin; // 0x84
	FTransform InitialTransform; // 0x90
};

struct UWBP_SettingsPreview_ReticleSize_C : UKSSettingsPreview {
	FPointerToUberGraphFrame UberGraphFrame; // 0x538
	UImage* Image_42; // 0x540
	UImage* Image_305; // 0x548
	URifleReticle_C* RifleReticle; // 0x550
	UKSSettingsDataFactory* SettingsDataFactory; // 0x558
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x110
	USlateWidgetStyleAsset* Style; // 0x5e0
	bool bAlwaysShowScrollbar; // 0x5e8
	bool bAlwaysShowScrollbarTrack; // 0x5e9
	EOrientation Orientation; // 0x5ea
	FVector2D Thickness; // 0x5ec
	FMargin Padding; // 0x5f4
};

struct USourceEffectSimpleDelayPreset : USoundEffectSourcePreset {
	FSourceEffectSimpleDelaySettings Settings; // 0x80
};

struct UWBP_ProgressionTally_C : UKSProgressionTallyWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x690
	UWBP_ProgressionTally_Entry_C* BackfillBonus_Horizontal; // 0x698
	UWBP_ProgressionTally_Entry_C* BackfillBonus_Vertical; // 0x6a0
	UWBP_ProgressionTally_Entry_C* EventBonus_Horizontal; // 0x6a8
	UWBP_ProgressionTally_Entry_C* EventBonus_Vertical; // 0x6b0
	UWidgetSwitcher* LayoutSwitcher; // 0x6b8
	UWBP_ProgressionTally_Entry_C* MiscBonus_Horizontal; // 0x6c0
	UWBP_ProgressionTally_Entry_C* MiscBonus_Vertical; // 0x6c8
	UHorizontalBox* TallyContainer_Horizontal; // 0x6d0
	UVerticalBox* TallyContainer_Vertical; // 0x6d8
	UWBP_ProgressionTally_Entry_C* WinBonus_Horizontal; // 0x6e0
	UWBP_ProgressionTally_Entry_C* WinBonus_Vertical; // 0x6e8
	bool UseHorizontalLayout; // 0x6f0
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UWBP_CompareFoundersEditions_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnShow; // 0x528
	UWBP_StandardButton_02_C* ConfirmButton; // 0x530
	UImage* Image; // 0x538
	UImage* Image_2; // 0x540
	UImage* Image_3; // 0x548
	UImage* Image_4; // 0x550
	UImage* Image_156; // 0x558
	UImage* Image_525; // 0x560
	UImage* Image_947; // 0x568
	UImage* Image_1104; // 0x570
	UWBP_ModalPopupContainer_C* PopupContainer; // 0x578
	UImage* RBIcon_2; // 0x580
};

struct UWBP_RadialMenuEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UTextBlock* BigItemNameText; // 0x240
	UImage* DisabledIcon; // 0x248
	UWidgetSwitcher* DisplayTypeSwitcher; // 0x250
	UOverlay* HoverOverlay; // 0x258
	UTextBlock* ItemNameText; // 0x260
	UWBP_AsyncIcon_C* WBP_AsyncIcon; // 0x268
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x438
};

struct UInAppPurchaseCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UNiagaraPreviewAxis_InterpParamLinearColor : UNiagaraPreviewAxis_InterpParamBase {
	FLinearColor Min; // 0x38
	FLinearColor Max; // 0x48
};

struct UKSActivityRewardCondition_Affiliation : UKSActivityRewardCondition {
	FKSAffiliationFilter AffiliationFilter; // 0x30
};

struct UStreamingSettings : UDeveloperSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UWBP_StandardButtonLarge_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* OnClick; // 0x528
	UWidgetAnimation* Highlight; // 0x530
	UImage* BtnBkg; // 0x538
	UImage* BtnBkgHover; // 0x540
	UImage* BtnBkgRedButton; // 0x548
	UImage* BtnClickImage; // 0x550
	UImage* BtnEdge; // 0x558
	UImage* BtnEdgeHover; // 0x560
	UImage* BtnFrame; // 0x568
	UImage* BtnFrameHover; // 0x570
	UOverlay* BtnStandardWrapper; // 0x578
	UTextBlock* ButtonText; // 0x580
	UButton* HitTarget; // 0x588
	UOverlay* HoverWrapper; // 0x590
	UWBP_KeyCallout_C* KeyPrompt; // 0x598
	UCanvasPanel* KeyPromptContainer; // 0x5a0
	UNamedSlot* NamedSlot_66; // 0x5a8
	USizeBox* SizeWrapper; // 0x5b0
	FMulticastInlineDelegate OnClicked; // 0x5b8
	FMulticastInlineDelegate OnHovered; // 0x5c8
	FMulticastInlineDelegate OnUnhovered; // 0x5d8
	UAkAudioEvent* ClickLrgBtnSFX; // 0x5e8
	FText DefaultButtonText; // 0x5f0
	float DefaultWidth; // 0x608
	bool ShowPromptOnFocus; // 0x60c
	FKey PromptKey; // 0x610
	bool IsRedButton; // 0x628
	bool IsConfirm; // 0x629
	bool IsCancel; // 0x62a
	float DefaultHeight; // 0x62c
	UAkAudioEvent* HoverLrgBtnSFX; // 0x630
	E_ButtonFontStyle EFontStyle; // 0x638
	bool IsDisabled; // 0x639
};

struct UKSAISense_Player : UAISense {
	TArray<FKSAIPlayerStimulusEvent> RegisteredEvents; // 0x80
};

struct USettingsInfo_Language_C : UKSSettingsInfoBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x108
	UDataTable* CultureFriendlyNames; // 0x110
};

struct UWBP_TextChat_ChatEntry_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWidgetAnimation* FadeOut; // 0x240
	UWidgetAnimation* Show; // 0x248
	UButton* NameButton; // 0x250
	UTextBlock* NameText; // 0x258
	UCanvasPanel* Panel; // 0x260
	UTextBlock* Text; // 0x268
	FPUMG_ChatData ChatDataCopy; // 0x270
	bool IsWindowCollapsed; // 0x2b0
	bool IsInitialShowFinished; // 0x2b1
	float ChatMessageDisplayDuration; // 0x2b4
};

struct UParticleSystemPoolComponentBase : UBasePoolComponent {
	UParticleSystemComponent* PooledParticleSystemComponentClass; // 0xd8
	TArray<UParticleSystemComponent*> UnusedComponentsArray; // 0xe0
	TSet<UParticleSystemComponent*> UsedComponentsSet; // 0xf0
	UParticleSystemComponent* PeekedParticleSystemComponent; // 0x140
	bool bClearTemplateWhenReturnedToPool; // 0x148
};

struct UKSAvatar : UKSItem {
	TSoftObjectPtr<UTexture2D> LargeAvatarIcon; // 0x250
	UIconInfo* LargeAvatarIconInfo; // 0x278
};

struct USkinnedAnimInstance : UAnimInstance {
	UMultiSkinObject* SkinObject; // 0x2b8
};

struct UKSBTD_CheckUniqueAbilityType : UBTDecorator {
	UDataTable* AbilityValidatorTable; // 0x68
	EAbilityExecutionType AbilityExecutionType; // 0x70
};

struct UKSBTD_InteractableState : UBTDecorator_BlackboardBase {
	FKSInteractableStateFilter InteractableStateFilter; // 0x90
};

struct UKSActivityRewardCondition_TimeSinceFireStarted : UKSActivityRewardCondition {
	float MinSecondsSinceFireStarted; // 0x30
	float MaxSecondsSinceFireStarted; // 0x34
};

struct UKSQuickPlay : UKSWidget {
	FMulticastInlineDelegate OnSelectedQueueChanged; // 0x520
	bool CanCurrentlyJoinQueue; // 0x530
	bool CanControlQueue; // 0x531
	int32_t DefaultSelectedQueueId; // 0x534
	int32_t ChunksInstallingQueueId; // 0x538
	bool ReadyForQueueing; // 0x550
};

struct UWBP_CustomKickButton_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UWidgetAnimation* Hovered; // 0x240
	UButton* KickButton; // 0x248
	FMulticastInlineDelegate OnClicked; // 0x250
};

struct UParticleModuleRequired : UParticleModule {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct UWidgetBlueprintGeneratedClass : UBlueprintGeneratedClass {
	UWidgetTree* WidgetTree; // 0x328
	char bAllowTemplate : 1; // 0x330
	char bAllowDynamicCreation : 1; // 0x330
	char bValidTemplate : 1; // 0x330
	char bTemplateInitialized : 1; // 0x330
	char bCookedTemplate : 1; // 0x330
	char bClassRequiresNativeTick : 1; // 0x330
	TArray<FDelegateRuntimeBinding> Bindings; // 0x338
	TArray<UWidgetAnimation*> Animations; // 0x348
	TArray<FName> NamedSlots; // 0x358
	TSoftObjectPtr<UUserWidget> TemplateAsset; // 0x368
	UUserWidget* Template; // 0x390
};

struct UWBP_QuickPlay_C : UKSQuickPlay {
	FPointerToUberGraphFrame UberGraphFrame; // 0x558
	UWidgetAnimation* ShowDetail; // 0x560
	UOverlay* BattleZoneinfo; // 0x568
	UTextBlock* ButtonText; // 0x570
	UWidgetSwitcher* ContentSwitcher; // 0x578
	UWBP_panel_bevel_C* Divider; // 0x580
	UWBP_panel_bevel_C* Divider_2; // 0x588
	UCanvasPanel* EmptyContent; // 0x590
	UNewBackButton_C* EmptyContentBackButton; // 0x598
	UScaleBox* ErrorContainer; // 0x5a0
	UTextBlock* ErrorLabel; // 0x5a8
	UTextBlock* GrandmasterText; // 0x5b0
	UImage* Image; // 0x5b8
	UImage* Image_2; // 0x5c0
	UImage* Image_3; // 0x5c8
	UImage* Image_4; // 0x5d0
	UImage* Image_5; // 0x5d8
	UImage* Image_6; // 0x5e0
	UImage* Image_7; // 0x5e8
	UImage* Image_8; // 0x5f0
	UImage* Image_9; // 0x5f8
	UImage* Image_10; // 0x600
	UImage* Image_11; // 0x608
	UImage* Image_12; // 0x610
	UImage* Image_13; // 0x618
	UImage* Image_14; // 0x620
	UImage* Image_15; // 0x628
	UImage* Image_110; // 0x630
	UImage* Image_142; // 0x638
	UImage* Image_222; // 0x640
	UImage* Image_329; // 0x648
	UImage* Image_392; // 0x650
	UWBP_QuickPlay_QueueTypeHeader_C* MapRotationHeader; // 0x658
	UScrollBox* MapScrollBox; // 0x660
	UWBP_ControllerPrompt_C* MapScrollPrompt; // 0x668
	USizeBox* MapScrollPromptContainer; // 0x670
	UUniformGridPanel* MapThumbnailGrid; // 0x678
	UWBP_Graphic_Button_C* MobileSelectQueueBtn; // 0x680
	UTextBlock* ObjectiveTxt; // 0x688
	UTextBlock* PartyMaxLabel; // 0x690
	UTextBlock* PartyMinLabel; // 0x698
	UTextBlock* PlayerCount; // 0x6a0
	UWidgetSwitcher* QueueDataSwitcher; // 0x6a8
	UTextBlock* QueueDescription; // 0x6b0
	USizeBox* QueueDescWrapper; // 0x6b8
	UWidgetSwitcher* QueueDetailsDisplay; // 0x6c0
	UWidgetSwitcher* QueueDetailSwitcher; // 0x6c8
	UOverlay* QueueDetailWrapper; // 0x6d0
	UTextBlock* QueueName; // 0x6d8
	UScrollBox* QueueScrollBox; // 0x6e0
	UVerticalBox* QueueSectionContainer; // 0x6e8
	UHorizontalBox* QueueSelectContainer; // 0x6f0
	UOverlay* QueueSelectPanel; // 0x6f8
	UOverlay* RankedDetailContainer22; // 0x700
	UWBP_StandardButtonMedium_C* RankedInfoButton; // 0x708
	UWBP_RankedIcon_C* RankedProgressBadge; // 0x710
	UTextBlock* RankedProgressText; // 0x718
	UWidgetSwitcher* RegionSwitcher; // 0x720
	URichTextBlock* RichTextBlock; // 0x728
	URichTextBlock* RichTextBlock_2; // 0x730
	URichTextBlock* RichTextBlock_3; // 0x738
	URichTextBlock* RichTextBlock_4; // 0x740
	URichTextBlock* RichTextBlock_5; // 0x748
	URichTextBlock* RichTextBlock_6; // 0x750
	URichTextBlock* RichTextBlock_7; // 0x758
	URichTextBlock* RichTextBlock_8; // 0x760
	URichTextBlock* RichTextBlock_9; // 0x768
	URichTextBlock* RichTextBlock_10; // 0x770
	UTextBlock* SeasonLabel; // 0x778
	UWBP_panel_bevel_C* WBP_panel_bevel; // 0x780
	UWBP_ProgressEarnedBar_C* WBP_ProgressEarnedBar; // 0x788
	UWBP_QueueSelection_RegionSelectButton_C* WBP_QueueSelection_RegionSelectButton; // 0x790
	UWBP_QuickPlay_MapThumbnail_C* WBP_QuickPlay_MapThumbnail; // 0x798
	UWBP_QuickPlay_QueueTypeSection_C* WBP_QuickPlay_QueueTypeSection; // 0x7a0
	UWBP_QuickPlay_QueueTypeSection_C* WBP_QuickPlay_QueueTypeSection_129; // 0x7a8
	UWBP_RegionSelect_C* WBP_RegionSelect; // 0x7b0
	UWBP_ThrobberHorizontal_C* WBP_ThrobberHorizontal; // 0x7b8
	TArray<UKSWidget*> NavigationButtons; // 0x7c0
	TArray<UWBP_QuickPlay_QueueButton_C*> AllQueueButtons; // 0x7d0
	int32_t MaxColumn; // 0x7e0
	UKSQueueDataFactory* QueueDataFactory; // 0x7e8
	FClientQueueInfo SelectedQueueInfo; // 0x7f0
	UWidget* CurrentScreen; // 0x8c8
	TMap<UWidget*, int32_t> ScreenToWidget; // 0x8d0
	float MapScrollSpeed; // 0x920
	UAkAudioEvent* ShowQuickPlaySFX; // 0x928
	UKSWidget* CustomMatchButton; // 0x930
	bool FoundQueueToFocus; // 0x938
	UWidget* TopQueueButton; // 0x940
};

struct APGame_GameState : AGameState {
	FString r_SonyMatchIdForPlayerFeedback; // 0x290
};

struct UMultiSkinObject : UObject {
	TArray<UMultiSkinObject*> ParentSkinnedObjects; // 0x28
	TArray<TWeakObjectPtr<UMultiSkinObject>> ChildSkinnedObjects; // 0x38
	TSet<FName> SubscribedKeywords; // 0x48
	TSet<FName> SubscribedMaterialPrefixes; // 0x98
	char bSubscribeToAllKeywords : 1; // 0xe8
	char bWantsToBeRecycled : 1; // 0xe8
	FMulticastInlineDelegate OnFinishedAllPendingLoadsDel; // 0x108
	TMap<int32_t, FDynamicSkinTableMapEntry> DynamicSkinTables; // 0x130
	TMap<FName, FCachedRowsEntry> CachedRows; // 0x180
};

struct UGizmoComponentHitTarget : UObject {
	UPrimitiveComponent* Component; // 0x30
};

struct UInterpTrackFloatAnimBPParam : UInterpTrackFloatBase {
	UObject* AnimBlueprintClass; // 0x90
	UAnimInstance* AnimClass; // 0x98
	FName ParamName; // 0xa0
};

struct UImmunityModInst_C : UDamageResistModInst_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1c0
};

struct UKSNavigationQueryFilter : UNavigationQueryFilter {
	UNavigationQueryFilter* DefaultFilter; // 0x48
	UNavigationQueryFilter* NoJumpFilter; // 0x50
	UNavigationQueryFilter* NoZiplineFilter; // 0x58
	UNavigationQueryFilter* NoJumpNoZiplineFilter; // 0x60
	uint32_t MaxSearchNodes; // 0x68
};

struct UWBP_Social_Search_bar_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Hover; // 0x528
	UImage* background; // 0x530
	UImage* bottomborder; // 0x538
	UKSEditableTextBox* InputText; // 0x540
	UImage* leftborder; // 0x548
	UImage* RightBorder; // 0x550
	UWBP_StandardButtonInner_C* SubmitButton; // 0x558
	UImage* topborder; // 0x560
	FMulticastInlineDelegate OnSearchTermChange; // 0x568
	bool TextIsDirty; // 0x578
	FMulticastInlineDelegate OnHovered; // 0x580
	FMulticastInlineDelegate OnUnhovered; // 0x590
};

struct AKSFlightPoint : ATargetPoint {
	USplineComponent* SplineComponent; // 0x220
	ESplinePointType SplinePointType; // 0x228
	bool bIsEndPoint; // 0x229
};

struct UAREnvironmentCaptureProbe : UARTrackedGeometry {
	UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture; // 0xf8
};

struct ULoginEula_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* MobileLayout; // 0x528
	UWBP_StandardButtonLarge_C* AcceptNew; // 0x530
	UImage* ArrowDown; // 0x538
	UImage* ArrowUp; // 0x540
	UWBP_StandardButtonLarge_C* BackNew; // 0x548
	UImage* bkg; // 0x550
	UCheckbox_C* CheckBox; // 0x558
	UImage* Divider; // 0x560
	UScrollBox* EulaContainer; // 0x568
	UTextBlock* EulaText_Mobile; // 0x570
	UTextBlock* EulaText_PC; // 0x578
	UImage* Image_190; // 0x580
	UInvalidationBox* InvalidationBox_Mobile; // 0x588
	UInvalidationBox* InvalidationBox_PC; // 0x590
	UWidgetSwitcher* NextSwitcher; // 0x598
	UPUMG_UnsafeZone* PUMG_UnsafeZone_1; // 0x5a0
	UImage* ScrollCalloutDown; // 0x5a8
	UWidgetSwitcher* ScrollCalloutSwitcher; // 0x5b0
	UImage* ScrollCalloutUp; // 0x5b8
	UImage* StudioLogo; // 0x5c0
	UImage* TitleLogo; // 0x5c8
	UVerticalBox* VerticalBox_1; // 0x5d0
	UWBP_PanelDefault_C* WBP_PanelDefault; // 0x5d8
	FTimerHandle CalloutTimer; // 0x5e0
};

struct UKSLoginRewardsModal : UKSWidget {
	FMulticastInlineDelegate OnLoginRewardsReady; // 0x520
	TArray<FLoginRewardItem> LoginRewardItems; // 0x530
	int32_t nDefaultItemsPerRow; // 0x540
};

struct UOutlineContainer_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UImage* BG; // 0x528
	UNamedSlot* ContentSlot; // 0x530
	UButton* HitTarget; // 0x538
	UImage* Hover; // 0x540
	UImage* Outline; // 0x548
	UObject* OutlineTexture; // 0x550
	FMargin OutlineMargin; // 0x558
	FMulticastInlineDelegate Gamepad Confirm; // 0x568
	UAkAudioEvent* ClickOutlineContainerSFX; // 0x578
	UAkAudioEvent* HoverOutlineContainerSFX; // 0x580
};

struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x58
	FRichCurve YCurve; // 0xd8
};

struct USCS_Node : UObject {
	UObject* ComponentClass; // 0x28
	UActorComponent* ComponentTemplate; // 0x30
	FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x38
	FName AttachToName; // 0x80
	FName ParentComponentOrVariableName; // 0x88
	FName ParentComponentOwnerClassName; // 0x90
	bool bIsParentComponentNative; // 0x98
	TArray<USCS_Node*> ChildNodes; // 0xa0
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xb0
	FGuid VariableGuid; // 0xc0
	FName InternalVariableName; // 0xd0
};

struct UDestroySessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x228
};

struct UWBP_ShearedButton_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	USizeBox* BeginSizedPadding_SizeWrapper; // 0x528
	UImage* ButtonBorderImage; // 0x530
	UImage* ButtonIcon; // 0x538
	UOverlay* ButtonTopLayer; // 0x540
	USizeBox* EndSizedPadding_SizeWrapper; // 0x548
	UWidgetSwitcher* HeaderSwitcher; // 0x550
	UButton* HitTarget; // 0x558
	UOverlay* HitTarget_Overlay; // 0x560
	USizeBox* HitTargetSizeWrapper; // 0x568
	UOverlay* IconOverlay; // 0x570
	USizeBox* IconSizeWrapper; // 0x578
	UImage* PrimaryBorderBottomBegin_Image; // 0x580
	UImage* PrimaryBorderBottomEnd_Image; // 0x588
	UImage* PrimaryButtonImage; // 0x590
	UImage* PrimaryTriangleBegin_Image; // 0x598
	USizeBox* PrimaryTriangleBegin_SizeWrapper; // 0x5a0
	UImage* PrimaryTriangleEnd_Image; // 0x5a8
	USizeBox* PrimaryTriangleEnd_SizeWrapper; // 0x5b0
	UOverlay* Shadow_Overlay; // 0x5b8
	UImage* ShadowImage; // 0x5c0
	USizeBox* ShadowSizeWrapper; // 0x5c8
	UImage* ShadowTriangleBegin_Image; // 0x5d0
	USizeBox* ShadowTriangleBegin_SizeWrapper; // 0x5d8
	UImage* ShadowTriangleEnd_Image; // 0x5e0
	USizeBox* ShadowTriangleEnd_SizeWrapper; // 0x5e8
	USizeBox* SizeWrapper; // 0x5f0
	UTextBlock* TitleText; // 0x5f8
	UOverlay* TitleText_Overlay; // 0x600
	USizeBox* TitleTextSizeWrapper; // 0x608
	bool ShowDropShadow; // 0x610
	bool ShowOnlyLowerDropShadow; // 0x611
	bool bDisableReleaseAnim; // 0x612
	bool ShowIcon; // 0x613
	FLinearColor Idle_PrimaryColor; // 0x614
	FLinearColor Idle_SecondaryColor; // 0x624
	FText Title; // 0x638
	FLinearColor DropshadowColor; // 0x650
	float Width; // 0x660
	float ShadowOffset; // 0x664
	float Height; // 0x668
	FMulticastInlineDelegate OnClicked; // 0x670
	FMulticastInlineDelegate OnHovered; // 0x680
	FMulticastInlineDelegate OnUnhovered; // 0x690
	bool IsActive; // 0x6a0
	bool IsDisabled; // 0x6a1
	float HoverAnimationDurationMS; // 0x6a4
	FSlateFontInfo Idle_FontInfo; // 0x6a8
	FSlateFontInfo Hover_FontInfo; // 0x6f8
	FSlateFontInfo Active_FontInfo; // 0x748
	FLinearColor Hover_PrimaryColor; // 0x798
	FLinearColor Active_PrimaryColor; // 0x7a8
	FLinearColor Hover_SecondaryColor; // 0x7b8
	FLinearColor Active_SecondaryColor; // 0x7c8
	bool IsCurrentlyHovered; // 0x7d8
	FLinearColor Disabled_PrimaryColor; // 0x7dc
	FLinearColor Disabled_SecondaryColor; // 0x7ec
	FSlateFontInfo Disabled_FontInfo; // 0x800
	UTexture2D* IconTexture; // 0x850
	UKSButtonSoundLibrary* ButtonSound; // 0x858
};

struct UWBP_StoreItemRotator_C : UKSWidget {
	UTextBlock* ActiveTick; // 0x520
	UProgressBar* Progress; // 0x528
	UHorizontalBox* RotatorTickBox; // 0x530
	UWBP_StoreRotatorTick_C* TickExample1; // 0x538
	UWBP_StoreRotatorTick_C* TickExample2; // 0x540
	TArray<UWBP_StoreRotatorTick_C*> RotatorObjects; // 0x548
	int32_t NumTicks; // 0x558
};

struct UStreamableRenderAsset : UObject {
	double ForceMipLevelsToBeResidentTimestamp; // 0x28
	int32_t NumCinematicMipLevels; // 0x30
	int32_t StreamingIndex; // 0x34
	int32_t CachedCombinedLODBias; // 0x38
	char CachedNumResidentLODs; // 0x3c
	char bCachedReadyForStreaming : 1; // 0x3d
	char NeverStream : 1; // 0x3d
	char bGlobalForceMipLevelsToBeResident : 1; // 0x3d
	char bIsStreamable : 1; // 0x3d
	char bHasStreamingUpdatePending : 1; // 0x3d
	char bForceMiplevelsToBeResident : 1; // 0x3d
	char bIgnoreStreamingMipBias : 1; // 0x3d
	char bUseCinematicMipLevels : 1; // 0x3d
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x30
	USkeleton* TargetSkeleton; // 0x40
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x48
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x58
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xa8
	TArray<FAnimBlueprintFunctionData> AnimBlueprintFunctionData; // 0xb8
	TArray<TFieldPath<FStructProperty>> AnimNodeProperties; // 0xc8
	TArray<TFieldPath<FStructProperty>> LinkedAnimGraphNodeProperties; // 0xe8
	TArray<TFieldPath<FStructProperty>> LinkedAnimLayerNodeProperties; // 0x108
	TArray<TFieldPath<FStructProperty>> PreUpdateNodeProperties; // 0x128
	TArray<TFieldPath<FStructProperty>> DynamicResetNodeProperties; // 0x148
	TArray<TFieldPath<FStructProperty>> StateMachineNodeProperties; // 0x168
	TArray<TFieldPath<FStructProperty>> InitializationNodeProperties; // 0x188
	TMap<FName, FGraphAssetPlayerInformation> GraphNameAssetPlayers; // 0x1a8
	TArray<FName> SyncGroupNames; // 0x1f8
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x208
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x218
};

struct ADatasmithAreaLightActor : AActor {
	EDatasmithAreaLightActorType LightType; // 0x220
	EDatasmithAreaLightActorShape LightShape; // 0x221
	FVector2D Dimensions; // 0x224
	float Intensity; // 0x22c
	ELightUnits IntensityUnits; // 0x230
	FLinearColor Color; // 0x234
	float Temperature; // 0x244
	UTextureLightProfile* IESTexture; // 0x248
	bool bUseIESBrightness; // 0x250
	float IESBrightnessScale; // 0x254
	FRotator Rotation; // 0x258
	float SourceRadius; // 0x264
	float SourceLength; // 0x268
	float AttenuationRadius; // 0x26c
	float SpotlightInnerAngle; // 0x270
	float SpotlightOuterAngle; // 0x274
};

struct UMaterialExpressionFontSample : UMaterialExpression {
	UFont* Font; // 0x40
	int32_t FontTexturePage; // 0x48
};

struct UInAppPurchaseRestoreCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct UAISubsystem : UObject {
	UAISystem* AISystem; // 0x30
};

struct UKSPlayerStimulusComponentBase : UActorComponent {
	FMulticastInlineDelegate OnStartStimulatingPlayer; // 0xb0
	FMulticastInlineDelegate OnStopStimulatingPlayer; // 0xc0
	EKSStimulateTarget StimulateTarget; // 0xd0
	bool bRegisterOnBeginPlay; // 0xd1
};

struct UParticleModuleVectorFieldRotationRate : UParticleModuleVectorFieldBase {
	FVector RotationRate; // 0x30
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UWBP_CustomGameLobby_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_CustomGameActionLog_C* ActionLog; // 0x528
	UButton* Blocker; // 0x530
	UWBP_PlayerContextMenu_C* ContextMenu; // 0x538
	UWBP_Subtitle_C* GameName; // 0x540
	UImage* Image; // 0x548
	UImage* Image_2; // 0x550
	UImage* Image_112; // 0x558
	UImage* Image_379; // 0x560
	UImage* Image_498; // 0x568
	UWBP_StandardButtonLarge_C* JoiningButton; // 0x570
	UWBP_ThrobberHorizontal_C* Loading; // 0x578
	USizeBox* LoadingState; // 0x580
	UVerticalBox* LoadingWrapper; // 0x588
	UHorizontalBox* LobbyState; // 0x590
	UWidgetSwitcher* LobbySwitcher; // 0x598
	UWBP_StandardButtonLarge_C* SpectateButton; // 0x5a0
	UVerticalBox* Spectator; // 0x5a8
	UVerticalBox* SpectatorContainer; // 0x5b0
	UWBP_StandardButtonLarge_C* StartButton; // 0x5b8
	UWidgetSwitcher* StartGameSwitcher; // 0x5c0
	UVerticalBox* TeamA; // 0x5c8
	UVerticalBox* TeamB; // 0x5d0
	UWBP_Header1_C* Title; // 0x5d8
	UWBP_VoiceActivityContainer_C* VoiceActivity; // 0x5e0
	UImage* WarningIcon; // 0x5e8
	UTextBlock* WarningMessage; // 0x5f0
	UHorizontalBox* WarningWrapper; // 0x5f8
	UWBP_GameModeInfoPanel_Lobby_C* WBP_GameModeInfoPanel_Lobby; // 0x600
	TMap<int32_t, FFBP_CustomMatchTeam> TeamDataMap; // 0x608
	FTimerHandle DataChangeTimer; // 0x658
	FText FmtAdded; // 0x660
	FText FmtRemoved; // 0x678
	FText FmtPromoted; // 0x690
	FText FmtDemoted; // 0x6a8
	FText FmtInvited; // 0x6c0
	FText FmtMovedTeam; // 0x6d8
	TMap<UKSPlayerInfo*, FFBP_CustomPendingLogEntry> PendingLogs; // 0x6f0
	FText FmtLobbyCreated; // 0x740
	TArray<UPUMG_PlayerInfo*> TEMP_Invites; // 0x758
	FText FmtGameName; // 0x768
	UAkAudioEvent* ShowCustomGameLobbySFX; // 0x780
	int32_t FocusGroup_TeamsAndButtons; // 0x788
	int32_t FocusGroup_ContextMenu; // 0x78c
	bool MembersPopulated; // 0x790
	int32_t MaxSpectators; // 0x794
};

struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x50
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x58
	ENiagaraSpriteAlignment Alignment; // 0x80
	ENiagaraSpriteFacingMode FacingMode; // 0x81
	FVector2D PivotInUVSpace; // 0x84
	ENiagaraSortMode SortMode; // 0x8c
	FVector2D SubImageSize; // 0x90
	char bSubImageBlend : 1; // 0x98
	char bRemoveHMDRollInVR : 1; // 0x98
	char bSortOnlyWhenTranslucent : 1; // 0x98
	float MinFacingCameraBlendDistance; // 0x9c
	float MaxFacingCameraBlendDistance; // 0xa0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xa8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x120
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x210
	FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x288
	FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x300
	FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x378
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x3f0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x468
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x4e0
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x558
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x5d0
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x648
	FNiagaraVariableAttributeBinding UVScaleBinding; // 0x6c0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x738
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x7b0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x828
};

struct UDatasmithAreaLightActorTemplate : UDatasmithObjectTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UMaterialExpressionQualitySwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x3]; // 0x54
};

struct UKSApparelAsset_CustomComponent : UKSApparelAsset_SkinDataTables {
	TSoftClassPtr<UObject> CustomComponentClass; // 0x2e0
};

struct UKSLocalPlayer : UPCom_LocalPlayer {
	FMulticastInlineDelegate OnLocalViewedPawnChangedDel; // 0x260
	UKSKillCam* KillCam; // 0x288
	AKSKillCamController* KillCamControllerClass; // 0x290
};

struct UKSPlayerModInst_Omniscience : UKSPlayerModInstance {
	bool bHandleEnemiesOnly; // 0x1b8
};

struct UHitDecalConfig_C : UObject {
	FHitDecalInfo Info; // 0x28
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xe0
};

struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	char bPositionCorrected : 1; // 0x148
};

struct UKSPlayerMod_GiveEquipPoints : UKSPlayerMod {
	FGameplayTagContainer EquipPointsToGive; // 0x330
};

struct UWBP_RogueStatsScreen_TabEntry_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWidgetAnimation* Hover; // 0x528
	UImage* ActiveIconOverlay; // 0x530
	UButton* BtnSelect; // 0x538
	UImage* Highlight; // 0x540
	UKSAsyncImage* KSAsyncImage_1; // 0x548
	UImage* Selected; // 0x550
	UWBP_AsyncIcon_C* StatIcon; // 0x558
	UTextBlock* StatName; // 0x560
	UTextBlock* StatValue; // 0x568
	UKSAsyncImage* TopDivider; // 0x570
	FMulticastInlineDelegate onSelected; // 0x578
	bool IsSelected; // 0x588
	UAkAudioEvent* ClickRogueStatsScreenTabEntrySFX; // 0x590
	UAkAudioEvent* HoverRogueStatsScreenTabEntrySFX_1; // 0x598
	UKSStatWrapper* PlayerStat; // 0x5a0
	UKSStatWrapper* PlayerStatObject; // 0x5a8
	UKSStatWrapper* RogueStat; // 0x5b0
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UNiagaraDataInterfaceColorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve RedCurve; // 0x58
	FRichCurve GreenCurve; // 0xd8
	FRichCurve BlueCurve; // 0x158
	FRichCurve AlphaCurve; // 0x1d8
};

struct UKSBTTask_GetNavigationInteractTarget : UBTTaskNode {
	FBlackboardKeySelector InteractTarget; // 0x70
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueId; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UKSTabletAnimInstance : UKSAnimInstance {
	bool bIsClosed; // 0x330
};

struct UPGame_EffectGroup : UObject {
	FGameplayTagContainer m_EffectGroupTypes; // 0x28
	FGameplayTagContainer m_BehaviorCategories; // 0x48
	TArray<UPGame_Effect*> m_Effects; // 0x68
	UPGame_EffectAttachment* m_AttachmentClass; // 0x78
};

struct UPlatformEventsComponent : UActorComponent {
	FMulticastInlineDelegate PlatformChangedToLaptopModeDelegate; // 0xb0
	FMulticastInlineDelegate PlatformChangedToTabletModeDelegate; // 0xc0
};

struct UPartyMember : UObject {
	USocialUser* SocialUser; // 0x68
};

struct UMovieSceneObjectPropertyTrack : UMovieScenePropertyTrack {
	UObject* PropertyClass; // 0x88
};

struct UKSWeaponMasteryManager : UKSActivityManagerBase {
	UDataTable* MiscRewardsTable; // 0x228
};

struct AKSInteractableLootSite : AKSLootSiteBase {
	UKSInteractionBlockerManager* InteractionBlockerManager; // 0x350
	FText LootBoxName; // 0x358
	bool bChoosesBeforeInteraction; // 0x370
	bool bPressAndHoldPrompt; // 0x371
	UKSInteractableComponent* InteractableComponent; // 0x378
	bool bLooted; // 0x380
	FLootSiteDropInfo ChosenLoot; // 0x388
	TArray<AKSCharacter*> Looters; // 0x3b8
	TArray<UKSInteractionManager*> LooterManagers; // 0x3c8
	TArray<FLootSiteDropInfo> PossibleLoot; // 0x3d8
};

struct UKSAutoPickupComponent : UActorComponent {
	float AutoPickupMinPickupTimeSinceCreation; // 0xb0
	float AutoPickupDistance; // 0xb4
	float AutoPickupQueryInterval; // 0xb8
	bool bActivateAutoPickups; // 0xbc
	TMap<UKSItem*, int32_t> ItemPriorityMap; // 0xc0
	bool bAutoPickupClusivityEnabled; // 0x110
	FGameplayTagQuery ClusivityQuery; // 0x118
};

struct UWBP_BattlePassUpsellPanel_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UVerticalBox* AdditionalUnlocks; // 0x528
	UTextBlock* AlsoUnlockText; // 0x530
	UTextBlock* IconText; // 0x538
	UImage* Image_613; // 0x540
	UTextBlock* InstantUnlocksText; // 0x548
	UTextBlock* PremiumRewardsText; // 0x550
	UVerticalBox* RogueBucksStack; // 0x558
	UTextBlock* RogueBucksText; // 0x560
	UTextBlock* TitleText; // 0x568
	UWBP_PanelDefault_C* WBP_PanelDefault; // 0x570
	UWBP_YellowButton_C* WBP_YellowButton; // 0x578
	FMulticastInlineDelegate OnButtonClicked; // 0x580
};

struct UWBP_CosmeticItem_Title_C : UKSWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	UWBP_ButtonSlot_Cosmetic_C* Button; // 0x528
	UImage* Gradient; // 0x530
	UBorder* RarityElementWrapper; // 0x538
	UImage* ScanLines; // 0x540
	UTextBlock* Title; // 0x548
	UPlatformInventoryItem* PlatformItem; // 0x550
	FMulticastInlineDelegate OnItemHovered; // 0x558
	FMulticastInlineDelegate OnItemUnhovered; // 0x568
	FMulticastInlineDelegate OnItemClicked; // 0x578
