// Created by BlueFire1337
// Updated 2021-12-23
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x5b53240;
	constexpr auto GObjects = 0x5b6ba08;
	constexpr auto GWorld = 0x5ca6630;
	constexpr auto DecryptionDword = 0x5a9aab0;
	constexpr auto DecryptionX = 0x5a9aa98;
	constexpr auto DecryptionXPlus10 = 0x5a9aaa8;
}

struct UUI_AdjustableHorizontalSeparator_C : UAdjustableSeparator {
	UNamedSlot* Content; // 0x280
};

struct USCUE4Settings : UObject {
	FString KeyGeneratorPath; // 0x28
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xde0
	float ServerFlushLogInterval; // 0xde4
	UGameInstance* GameInstance; // 0xde8
};

struct USpacer : UWidget {
	FVector2D Size; // 0x108
};

struct UPaperTerrainComponent : UPrimitiveComponent {
	UPaperTerrainMaterial* TerrainMaterial; // 0x448
	bool bClosedSpline; // 0x450
	bool bFilledSpline; // 0x451
	UPaperTerrainSplineComponent* AssociatedSpline; // 0x458
	int32_t randomSeed; // 0x460
	float SegmentOverlapAmount; // 0x464
	FLinearColor TerrainColor; // 0x468
	int32_t ReparamStepsPerSegment; // 0x478
	ESpriteCollisionMode SpriteCollisionDomain; // 0x47c
	float CollisionThickness; // 0x480
	UBodySetup* CachedBodySetup; // 0x488
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xf0
};

struct UPrisonerBodyEffect_ForeignSubstance : UPrisonerBodyEffect {
	float _substanceMaxAmount; // 0x40
	float _substanceDiscardRate; // 0x44
	float _substanceDiscardRateMultiplierPerOverflow; // 0x48
	float _substanceAmount; // 0x4c
};

struct UUI_DropdownMenuTextureSelectionWidget_C : UDropdownMenuSelectionWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	UUI_CustomBorder_C* SelectionBorder; // 0x2a0
	UImage* SelectionImage; // 0x2a8
	UTexture2D* Texture; // 0x2b0
};

struct UUI_ItemStatusWidget_C : UItemStatusWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	UEditableTextBox* _titleText; // 0x318
	UImage* baseImage; // 0x320
	UImage* outlineImage; // 0x328
	UOverlay* TitleOverlay; // 0x330
};

struct UDialogButton : UUserWidget {
	bool PreviewSelectedState; // 0x2b8
	UButton* _button; // 0x2c0
	UTextBlock* _text; // 0x2c8
	USizeBox* _sizeBox; // 0x2d0
	FText _initialTitle; // 0x2d8
	FTabButtonStyle _selectedButtonStyle; // 0x2f0
	FTabButtonStyle _deselectedButtonStyle; // 0x578
	FTabTextStyle _selectedTextStyle; // 0x800
	FTabTextStyle _deselectedTextStyle; // 0x898
};

struct UMonoWaveTableSynthPreset : UObject {
	FString PresetName; // 0x28
	char bLockKeyframesToGridBool : 1; // 0x38
	int32_t LockKeyframesToGrid; // 0x3c
	int32_t WaveTableResolution; // 0x40
	TArray<FRuntimeFloatCurve> WaveTable; // 0x48
	char bNormalizeWaveTables : 1; // 0x58
};

struct UUI_JournalPanel_C : UJournalPanelWidget {
	UImage* _background; // 0x2f0
};

struct UAnimNotifyState_WeaponRevolverDrumRotationDirection : UAnimNotifyState {
	ERotationDirection RotationDirection; // 0x30
};

struct USynth2DSlider : UWidget {
	float ValueX; // 0x108
	float ValueY; // 0x10c
	FDelegate ValueXDelegate; // 0x110
	FDelegate ValueYDelegate; // 0x120
	FSynth2DSliderStyle WidgetStyle; // 0x130
	FLinearColor SliderHandleColor; // 0x3e8
	bool IndentHandle; // 0x3f8
	bool Locked; // 0x3f9
	float StepSize; // 0x3fc
	bool IsFocusable; // 0x400
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x408
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x418
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x428
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x438
	FMulticastInlineDelegate OnValueChangedX; // 0x448
	FMulticastInlineDelegate OnValueChangedY; // 0x458
};

struct UAirplaneDriverMountSlot : UAirplaneMountSlot {
	UBlendSpace* _forwardIdleAnimation; // 0x138
	UAnimSequenceBase* _forwardSteeringAnimation; // 0x140
	UAnimSequenceBase* _forwardSteeringAnimationFP; // 0x148
};

struct UInventoryItemWidget2Test : UUserWidget {
	UImage* _itemIcon; // 0x260
	UTextBlock* _itemCaption; // 0x268
};

struct UConvertToPolygonsToolProperties : UInteractiveToolPropertySet {
	EConvertToPolygonsMode ConversionMode; // 0x60
	float AngleTolerance; // 0x64
	bool bCalculateNormals; // 0x68
	bool bShowGroupColors; // 0x69
};

struct ADistantLevelManager : AActor {
	USceneComponent* _rootComponent; // 0x220
	float _minCameraLocationChangeToUpdateDistantLevels; // 0x228
	float _distantMeshPreloadDistance; // 0x22c
	int32_t _maxNumSimultaneouslyStreamedDistantMeshLODs; // 0x230
	float _distantCollisionMeshUnloadDistance; // 0x234
	int32_t _maxNumSimultaneouslyStreamedDistantCollisionMeshes; // 0x238
	TArray<FDistantLevelDescription> _distantLevelDescriptions; // 0x240
};

struct ULakeCollisionComponent : UPrimitiveComponent {
	UBodySetup* CachedBodySetup; // 0x448
	FVector BoxExtent; // 0x450
};

struct UUI_QuickAccessItemSwitcher3_C : UQuickAccessItemSwitcher3 {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UImage* Image_1; // 0x2f0
	UImage* Image_2; // 0x2f8
	UTextBlock* IndexText; // 0x300
};

struct UMeshSculptToolBase : UMeshSurfacePointTool {
	USculptBrushProperties* BrushProperties; // 0xc0
	UWorkPlaneProperties* GizmoProperties; // 0xc8
	TMap<int32_t, UMeshSculptBrushOpProps*> BrushOpPropSets; // 0x1b0
	TMap<int32_t, UMeshSculptBrushOpProps*> SecondaryBrushOpPropSets; // 0x250
	UMeshEditingViewProperties* ViewProperties; // 0x870
	UMaterialInstanceDynamic* ActiveOverrideMaterial; // 0x878
	UBrushStampIndicator* BrushIndicator; // 0x880
	UMaterialInstanceDynamic* BrushIndicatorMaterial; // 0x888
	UPreviewMesh* BrushIndicatorMesh; // 0x890
	UTransformGizmo* PlaneTransformGizmo; // 0x898
	UTransformProxy* PlaneTransformProxy; // 0x8a0
};

struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue GridSize; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	UEnvQueryContext* GenerateAround; // 0xf0
};

struct UVectorFieldStatic : UVectorField {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
	bool bAllowCPUAccess; // 0x54
};

struct UMaterialExpressionTextureProperty : UMaterialExpression {
	FExpressionInput TextureObject; // 0x40
	EMaterialExposedTextureProperty Property; // 0x54
};

struct UUI_CraftingInfoInWorld_C : UCraftingInfoWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368
	UImage* BackgroundImage; // 0x370
	UImage* CraftingTitle; // 0x378
	UTextBlock* DescriptionText; // 0x380
	UImage* Image_1; // 0x388
	UImage* Image_2; // 0x390
	UTextBlock* TitleText; // 0x398
};

struct UParticleModuleLocationPrimitiveSphere_Seeded : UParticleModuleLocationPrimitiveSphere {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xe0
};

struct USoundNodeDialoguePlayer : USoundNode {
	FDialogueWaveParameter DialogueWaveParameter; // 0x48
	char bLooping : 1; // 0x68
};

struct UMaterialFunction : UMaterialFunctionInterface {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
};

struct UVirtualTexture2D : UTexture2D {
	FVirtualTextureBuildSettings Settings; // 0x100
	bool bContinuousUpdate; // 0x10c
	bool bSinglePhysicalSpace; // 0x10d
};

struct UWidgetSwitcherSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UInterpTrackLinearColorProp : UInterpTrackLinearColorBase {
	FName PropertyName; // 0x90
};

struct UDoorUnlockItemComponent : UItemComponent {
	int64_t _expirationTimeSeconds; // 0xb8
	EDoorUnlockDataType _unlockDataType; // 0xc0
	UDoorUnlockData* _doorUnlockData; // 0xc8
	int64_t _itemCreatedTimestamp; // 0xd0
};

struct USelectionOverlayWidget : UUserWidget {
	UImage* _solidShown; // 0x278
	UImage* _gradientShown; // 0x280
	UImage* _solidSelected; // 0x288
	UImage* _gradientSelected; // 0x290
	FDataTableRowHandle _highlightColorRef; // 0x298
	float _solidWidth; // 0x2a8
};

struct UGeometryCollectionDebugDrawComponent : UActorComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct ABP_Survival_Tutorial_TakeKnifeInHands_C : AObtainItemObjective {
	USceneComponent* DefaultSceneRoot; // 0x378
};

struct AVDWindDirectionalSourceActor : AInfo {
	UVDWindDirectionalSourceComponent* Component; // 0x220
};

struct UUI_GameEventPanelWidget_C : UGameEventPanelWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UUI_ComboBoxWrapper_C* AllEventsComboBox; // 0x288
	UUI_ComboBoxWrapper_C* CurrentEventsComboBox; // 0x290
	UOverlay* EventArea; // 0x298
	UOverlay* LeaderboardSlot; // 0x2a0
	UUI_ComboBoxWrapper_C* NextEventsComboBox; // 0x2a8
	USizeBox* StatsPanel; // 0x2b0
	UVerticalBox* VerticalBox_5; // 0x2b8
	TArray<AGameEventBase*> CurrentEvents; // 0x2c0
	TArray<AGameEventBase*> NextEvents; // 0x2d0
	FString SelectedCurrent; // 0x2e0
	FString SelectedNext; // 0x2f0
	bool HighlightedCurrent; // 0x300
	TArray<AGameEventBase*> AllEvents; // 0x308
};

struct ATeamDeathmatchGameEvent : AGameEventBase {
	FTeamDeathmatchParameters _teamDeathmatchParameters; // 0x598
};

struct AWeaponAttachmentSight : AWeaponAttachment {
	FName ViewCenterSocketName; // 0x7e0
	FVector AimingDownTheSightsLocationOffset; // 0x7e8
};

struct UAnimNotify_MagazineUpdateAmmunitionMeshes : UAnimNotify {
	bool showReversed; // 0x38
	TArray<int32_t> ammoIndices; // 0x40
};

struct UWeaponScopeWidget : UDesignableUserWidget {
	UTexture2D* ReticleTexture; // 0x278
	UTextureRenderTarget2D* TextRenderTarget; // 0x280
	float FadeFactor; // 0x288
	float OnHideDelay; // 0x28c
};

struct UUI_WeaponOverviewTooltipPanelAbsolute_C : UItemTooltipPanel {
	UImage* Image_9; // 0x2c8
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_1; // 0x2d0
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_2; // 0x2d8
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_3; // 0x2e0
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_4; // 0x2e8
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_5; // 0x2f0
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_6; // 0x2f8
	UUI_TooltipOverviewElement_C* UI_TooltipOverviewElement_C_7; // 0x300
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FSlateColor ColorAndOpacity; // 0x150
	FDelegate ColorAndOpacityDelegate; // 0x178
	FSlateFontInfo Font; // 0x188
	FSlateBrush StrikeBrush; // 0x1e0
	FVector2D ShadowOffset; // 0x268
	FLinearColor ShadowColorAndOpacity; // 0x270
	FDelegate ShadowColorAndOpacityDelegate; // 0x280
	float MinDesiredWidth; // 0x290
	bool bWrapWithInvalidationPanel; // 0x294
	bool bAutoWrapText; // 0x295
	ETextTransformPolicy TextTransformPolicy; // 0x296
	bool bSimpleTextMode; // 0x297
};

struct UVDMeshClothComponent : UBaseVDComponent {
	UStaticMesh* HullMesh; // 0x678
	float StretchStiffness; // 0x680
	float BendStiffness; // 0x684
	float Mass; // 0x688
	float DragCoefficient; // 0x68c
	bool PreserveVolume; // 0x690
	float CurrentVolume; // 0x694
	float OverrideRestVolume; // 0x698
	char UseVertexColorDataForSetup : 1; // 0x6a0
	float MaxBendConstraintDistance; // 0x6a4
	TArray<UVDParticleSpringConstraint*> StretchConstraints; // 0x6d0
	TArray<UVDParticleSpringConstraint*> BendConstraints; // 0x6e0
	UVDMeshVolumeConstraint* VolumeConstraint; // 0x6f0
};

struct UGizmoComponentWorldTransformSource : UGizmoBaseTransformSource {
	USceneComponent* Component; // 0x48
	bool bModifyComponentOnTransform; // 0x50
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0xe8
	ANavigationData* MyNavData; // 0xf8
};

struct AGuardedZoneManager : AActor {
	UBillboardComponent* _sprite; // 0x220
	TArray<ASentrySpawner2*> _sentrySpawners; // 0x228
	TArray<FSentrySpawnerDescription> _sentrySpawnerDescriptions; // 0x238
};

struct UUI_TooltipOverviewTextElement_C : UItemTooltipPanelElement {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UExtendedRichTextBlock* ExtendedRichTextBlock_1; // 0x288
	FText TextFormat; // 0x290
	FTextBlockStyle TextStyle; // 0x2a8
	FSlateColor Color; // 0x518
	int32_t MinimumIntegralDigits; // 0x540
	int32_t MaximumIntegralDigits; // 0x544
	int32_t MinimumFractionalDigits; // 0x548
	int32_t MaximumFractionalDigits; // 0x54c
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct USmoothHoleFillProperties : UInteractiveToolPropertySet {
	bool bConstrainToHoleInterior; // 0x60
	int32_t RemeshingExteriorRegionWidth; // 0x64
	int32_t SmoothingExteriorRegionWidth; // 0x68
	int32_t SmoothingInteriorRegionWidth; // 0x6c
	float InteriorSmoothness; // 0x70
	double FillDensityScalar; // 0x78
	bool bProjectDuringRemesh; // 0x80
};

struct UBTTask_PlayAnimation : UBTTaskNode {
	UAnimationAsset* AnimationToPlay; // 0x70
	char bLooping : 1; // 0x78
	char bNonBlocking : 1; // 0x78
	UBehaviorTreeComponent* MyOwnerComp; // 0x80
	USkeletalMeshComponent* CachedSkelMesh; // 0x88
};

struct UMeshBoundaryToolBase : USingleSelectionTool {
	UPolygonSelectionMechanic* SelectionMechanic; // 0x138
	USingleClickInputBehavior* LoopSelectClickBehavior; // 0x140
};

struct ADroneAIController : AAIController {
	float _followingDuration; // 0x328
	float _followingTargetSpeedThreshold; // 0x32c
	float _forcedSelfDestructTime; // 0x330
	float _followingHeight; // 0x334
	float _followingDistance; // 0x338
	float _resumeFollowingExtraDistance; // 0x33c
	float _resumeFollowingSeconds; // 0x340
	float _resumeFollowingExtendedSeconds; // 0x344
	float _followingCirclingMinTime; // 0x34c
	float _followingCirclingMaxTime; // 0x350
	float _followingCirclingNewDirectionMinTime; // 0x354
	float _followingCirclingNewDirectionMaxTime; // 0x358
	float _switchFollowingTargetsMaxDistance; // 0x35c
	float _flybyHorizontalDistanceFromTarget; // 0x390
	float _flybyVerticalDistanceFromTarget; // 0x394
	float _flybyPathLength; // 0x398
	float _minFlybyAngleDeg; // 0x39c
	float _maxFlybyAngleDeg; // 0x3a0
	float _crashingDistance; // 0x3b8
	float _leavingForwardDistance; // 0x3c0
	float _leavingVerticalDistance; // 0x3c4
	float _minimumNavigationProximityPerState[0x6]; // 0x3c8
	float _boundsInflation; // 0x3e0
	float _bypassAccelerationScale; // 0x3e4
	float _bypassTurningSpeed; // 0x3e8
	float _findPathBypassMultiplier; // 0x3ec
	float _maxTimePerDestinationMultiplier; // 0x3f0
	float _droneTurningSpeed; // 0x3f4
	float _maxPathSegment; // 0x3f8
	float _flyUpwardsDistance; // 0x3fc
	int32_t _maximumAttemptedHeightGains; // 0x400
	FVector _randomMovementExtent; // 0x408
	float _repeatChooseLocationTime; // 0x414
	float _highAccelerationScaleMultiplier; // 0x418
	float _distanceForHighAcceleration; // 0x41c
	float _brakingDecelerationFlyingMovementRestore; // 0x428
};

struct AOnlineBeaconClient : AOnlineBeacon {
	AOnlineBeaconHostObject* BeaconOwner; // 0x250
	UNetConnection* BeaconConnection; // 0x258
	EBeaconConnectionState ConnectionState; // 0x260
};

struct UUI_GameEventInfoWidget_C : UGameEventInfoWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UTextBlock* DescriptionText; // 0x280
	UTextBlock* MinPlayersText; // 0x288
	UTextBlock* NumTeamsText; // 0x290
	UTextBlock* PrerequisitesText; // 0x298
	UTextBlock* RespawnText; // 0x2a0
	UTextBlock* RewardsText; // 0x2a8
	UTextBlock* WeaponsText; // 0x2b0
};

struct UCameraShakeSourceComponent : USceneComponent {
	ECameraShakeAttenuation Attenuation; // 0x1f8
	float InnerAttenuationRadius; // 0x1fc
	float OuterAttenuationRadius; // 0x200
	UCameraShakeBase* CameraShake; // 0x208
	bool bAutoStart; // 0x210
};

struct UInventoryPanelWidget2Test : UInventoryContainerWidget2 {
	UScrollBox* _itemContainer; // 0x278
};

struct UUI_Metabolism_BodyStats_C : UMetabolismBodyStatsPanel {
	UUI_CollapsableContainer_C* UI_CollapsableContainer; // 0x2d8
};

struct UPlanePositionGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoVec2ParameterSource> ParameterSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bEnableSignedAxis; // 0x88
	bool bFlipX; // 0x89
	bool bFlipY; // 0x8a
	bool bInInteraction; // 0x8b
	FVector InteractionOrigin; // 0x8c
	FVector InteractionNormal; // 0x98
	FVector InteractionAxisX; // 0xa4
	FVector InteractionAxisY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	FVector2D InteractionStartParameter; // 0xd4
	FVector2D InteractionCurParameter; // 0xdc
	FVector2D ParameterSigns; // 0xe4
};

struct UPhysicsInspectorTool : UMultiSelectionTool {
	UCollisionGeometryVisualizationProperties* VizSettings; // 0x90
	TArray<UPhysicsObjectToolPropertySet*> ObjectData; // 0x98
	UMaterialInterface* LineMaterial; // 0xa8
	TArray<UPreviewGeometry*> PreviewElements; // 0xb0
};

struct UMaterialExpressionSkyAtmosphereLightIlluminance : UMaterialExpression {
	int32_t LightIndex; // 0x40
	FExpressionInput WorldPosition; // 0x44
};

struct UAnimBP_ImprovisedRifle9mm_C : UWeaponAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	FAnimNode_Root AnimGraphNode_Root; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x338
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x380
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x410
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x458
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x508
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x530
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x558
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x580
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6d8
};

struct UBP_SphereMotionTriggerComponent_C : USphereMotionTriggerComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x540
};

struct UAITask_MoveTo : UAITask {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UPrisonerSoundComponent : UCharacterSoundComponent {
	float MinBreathingRateToPostPeriodicInhaleExhaleAudioEvents; // 0xd8
	float MaxDistanceToListenerToPostPeriodicInhaleExhaleAudioEvents; // 0xdc
	UAkAudioEvent* PeriodicInhaleAudioEvent; // 0xe0
	UAkAudioEvent* PeriodicExhaleAudioEvent; // 0xe8
	UAkAudioEvent* HoldBreathInhaleAudioEvent; // 0xf0
	UAkAudioEvent* HoldBreathExhaleAudioEvent; // 0xf8
	UAkAudioEvent* HoldBreathBreathlessExhaleAudioEvent; // 0x100
	float MinHeartRateToPostHeartbeatAudioEvent; // 0x108
	UAkAudioEvent* HeartbeatAudioEvent; // 0x110
	UAkAudioEvent* FootstepsAudioEvent; // 0x118
	UAkAudioEvent* FootstepsEnhancerAudioEvent; // 0x120
	float MovingThroughFoliageGateDuration; // 0x128
	UAkAudioEvent* StartGenericMovingThroughFoliageAudioEvent; // 0x130
	UAkAudioEvent* StopGenericMovingThroughFoliageAudioEvent; // 0x138
	UAkAudioEvent* GenericOneShotMovingThroughFoliageAudioEvent; // 0x140
	UAkAudioEvent* GearNoiseAudioEvent; // 0x148
	UAkAudioEvent* GearNoiseAudioEventWhenInWater; // 0x150
	float ItemMotionNoiseTimeToLive; // 0x158
	UAkAudioEvent* StartGenericEatItemAudioEvent; // 0x160
	UAkAudioEvent* StopGenericEatItemAudioEvent; // 0x168
	UAkAudioEvent* StartGenericDrinkItemAudioEvent; // 0x170
	UAkAudioEvent* StopGenericDrinkItemAudioEvent; // 0x178
	UAkAudioEvent* StartGenericDrinkWaterAudioEvent; // 0x180
	UAkAudioEvent* StopGenericDrinkWaterAudioEvent; // 0x188
	UAkAudioEvent* StartGenericExamineObjectAudioEvent; // 0x190
	UAkAudioEvent* StopGenericExamineObjectAudioEvent; // 0x198
	UAkAudioEvent* StartGenericCraftAudioEvent; // 0x1a0
	UAkAudioEvent* StopGenericCraftAudioEvent; // 0x1a8
	UAkAudioEvent* StartGenericUncraftAudioEvent; // 0x1b0
	UAkAudioEvent* StopGenericUncraftAudioEvent; // 0x1b8
	UAkAudioEvent* StartGenericVehicleRepairAudioEvent; // 0x1c0
	UAkAudioEvent* StopGenericVehicleRepairAudioEvent; // 0x1c8
	UAkAudioEvent* StartWashClothAudioEvent; // 0x1d0
	UAkAudioEvent* StopWashClothAudioEvent; // 0x1d8
	UAkAudioEvent* StartInGameAudioEvent; // 0x1e0
	UAkAudioEvent* StopInGameAudioEvent; // 0x1e8
	UAkAudioEvent* CalmStateAudioEvent; // 0x1f0
	UAkAudioEvent* IntenseStateAudioEvent; // 0x1f8
	UAkAudioEvent* CombatStateAudioEvent; // 0x200
	USoundCue* OutOfBoundsSound; // 0x208
	UAkAudioEvent* ChipExplosionSound; // 0x210
	TArray<FActiveMovingThroughFoliageSounds> _activeMovingThroughFoliageSounds; // 0x260
	int32_t _maxNumberOfFootstepsToPlayFootstepEnhancerSound; // 0x28c
	int32_t _minNumberOfFootstepsToPlayFootstepEnhancerSound; // 0x290
};

struct UViewAlignedPlaneBrushOpProps : UBasePlaneBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
	float Depth; // 0x68
	EPlaneBrushSideMode WhichSide; // 0x6c
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct ULayer : UObject {
	FName LayerName; // 0x28
	char bIsVisible : 1; // 0x30
	TArray<FLayerActorStats> ActorStats; // 0x38
};

struct UMissionPrompt : UUserWidget {
	UTextBlock* _description; // 0x260
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x6a0
	UAnimInstance* AnimClass; // 0x6a8
	UAnimInstance* AnimScriptInstance; // 0x6b0
	UAnimInstance* PostProcessAnimInstance; // 0x6b8
	FSingleAnimationPlayData AnimationData; // 0x6c0
	FVector RootBoneTranslation; // 0x6e8
	FVector LineCheckBoundsScale; // 0x6f4
	TArray<UAnimInstance*> LinkedInstances; // 0x730
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x740
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x750
	float GlobalAnimRateScale; // 0x8b0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8b4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8b5
	EAnimationMode AnimationMode; // 0x8b7
	char bDisablePostProcessBlueprint : 1; // 0x8b9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8b9
	char bHasValidBodies : 1; // 0x8b9
	char bBlendPhysics : 1; // 0x8b9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8b9
	char bUpdateJointsFromAnimation : 1; // 0x8b9
	char bDisableClothSimulation : 1; // 0x8ba
	char bDisableRigidBodyAnimNode : 1; // 0x8c0
	char bAllowAnimCurveEvaluation : 1; // 0x8c0
	char bDisableAnimCurves : 1; // 0x8c0
	char bCollideWithEnvironment : 1; // 0x8c0
	char bCollideWithAttachedChildren : 1; // 0x8c1
	char bLocalSpaceSimulation : 1; // 0x8c1
	char bResetAfterTeleport : 1; // 0x8c1
	char bDeferKinematicBoneUpdate : 1; // 0x8c1
	char bNoSkeletonUpdate : 1; // 0x8c1
	char bPauseAnims : 1; // 0x8c1
	char bUseRefPoseOnInitAnim : 1; // 0x8c1
	char bEnablePerPolyCollision : 1; // 0x8c2
	char bForceRefpose : 1; // 0x8c2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8c2
	char bIsAutonomousTickPose : 1; // 0x8c2
	char bOldForceRefPose : 1; // 0x8c2
	char bShowPrePhysBones : 1; // 0x8c2
	char bRequiredBonesUpToDate : 1; // 0x8c2
	char bAnimTreeInitialised : 1; // 0x8c2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8c3
	char bEnableLineCheckWithBounds : 1; // 0x8c3
	char bUseBendingElements : 1; // 0x8c3
	char bUseTetrahedralConstraints : 1; // 0x8c3
	char bUseThinShellVolumeConstraints : 1; // 0x8c3
	char bUseSelfCollisions : 1; // 0x8c3
	char bUseContinuousCollisionDetection : 1; // 0x8c3
	char bPropagateCurvesToSlaves : 1; // 0x8c3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8c4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8c4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8c4
	uint16_t CachedAnimCurveUidVersion; // 0x8c6
	EClothMassMode MassMode; // 0x8c8
	float UniformMass; // 0x8cc
	float TotalMass; // 0x8d0
	float Density; // 0x8d4
	float MinPerParticleMass; // 0x8d8
	float ClothBlendWeight; // 0x8dc
	float EdgeStiffness; // 0x8e0
	float BendingStiffness; // 0x8e4
	float AreaStiffness; // 0x8e8
	float VolumeStiffness; // 0x8ec
	float StrainLimitingStiffness; // 0x8f0
	float ShapeTargetStiffness; // 0x8f4
	bool bWaitForParallelClothTask; // 0x8f8
	TArray<FName> DisallowedAnimCurves; // 0x900
	UBodySetup* BodySetup; // 0x910
	FMulticastInlineDelegate OnConstraintBroken; // 0x920
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x930
	float TeleportDistanceThreshold; // 0xa08
	float TeleportRotationThreshold; // 0xa0c
	uint32_t LastPoseTickFrame; // 0xa18
	UClothingSimulationInteractor* ClothingInteractor; // 0xa70
	FMulticastInlineDelegate OnAnimInitialized; // 0xb40
};

struct UInsertMagazineInsertCartridge : UWeaponActionReloadSequence {
	FName MontageEndSectionName; // 0x90
};

struct UARTexture : UTexture {
	EARTextureType TextureType; // 0xd8
	float Timestamp; // 0xdc
	FGuid ExternalTextureGuid; // 0xe0
	FVector2D Size; // 0xf0
};

struct URendererOverrideSettings : UDeveloperSettings {
	char bSupportAllShaderPermutations : 1; // 0x38
	char bForceRecomputeTangents : 1; // 0x38
};

struct AConZWaterSplineRiver : AConZWaterSpline {
	UStaticMesh* SplineMesh; // 0x2b8
	UMaterialInterface* SplineMeshMaterialOverride; // 0x2c0
	float SplineMeshCullingDistance; // 0x2c8
	bool ClearRoll; // 0x2cc
	bool AutoCalculateMeshCount; // 0x2cd
	int32_t SplineMeshCount; // 0x2d0
	bool RefreshMesh; // 0x2d4
	bool ArmBatchEditWidth; // 0x2d5
	float BatchEditWidth; // 0x2d8
	bool ArmBatchEditMaxDepth; // 0x2dc
	float BatchEditMaxDepth; // 0x2e0
	bool ArmBatchEditSpeed; // 0x2e4
	float BatchEditSpeed; // 0x2e8
	bool ArmBatchEditOpacity; // 0x2ec
	float BatchEditOpacity; // 0x2f0
	bool ArmBatchEdit; // 0x2f4
	bool BatchEditReplace; // 0x2f5
	bool BatchEditAdd; // 0x2f6
	bool BatchEditMultiply; // 0x2f7
	bool BatchEditFlattenZ; // 0x2f8
	TArray<USplineMeshComponent*> _splineMeshComponents; // 0x300
};

struct USignificanceManager : UObject {
	FSoftClassPath SignificanceManagerClassName; // 0x108
};

struct ARadioStation : AActor {
	FName _stationName; // 0x250
	TArray<FRadioProgramData> _programsData; // 0x258
	int32_t _maxTracksToQueue; // 0x268
	int32_t _currentIndex; // 0x26c
	TArray<URadioTrack*> _playlist; // 0x270
	float _elapsedTime; // 0x280
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct AControlPointMeshActor : AActor {
	UControlPointMeshComponent* ControlPointMeshComponent; // 0x220
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4d8
};

struct ABP_WeaponBullet_cal22_C : AProjectile {
	FPointerToUberGraphFrame UberGraphFrame; // 0x418
};

struct UUI_CriminalRecordText_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UBorder* MainBorder; // 0x280
	UTextBlock* TitleText; // 0x288
	UTextBlock* ValueText; // 0x290
	bool HasLeftBorder; // 0x298
	FText Title; // 0x2a0
	FText Value; // 0x2b8
	int32_t TitleFontSize; // 0x2d0
	int32_t ValueFontSize; // 0x2d4
	FMargin TitlePadding; // 0x2d8
	FMargin ValuePadding; // 0x2e8
	EHorizontalAlignment ValueAlignment; // 0x2f8
};

struct AChristmasGhost : AActor {
	TArray<TSoftClassPtr<UObject>> _possibleGifts; // 0x220
	TSoftObjectPtr<UParticleSystem> _giftSpawnParticles; // 0x230
	TSoftObjectPtr<UAkAudioEvent> _giftSpawnAudioEvent; // 0x258
	FTransform _giftSpawnParticlesRelativeTransform; // 0x280
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct UAdminCommand_SpawnReflectionSphere : UAdminCommand {
	UObject* _actorClass; // 0x80
};

struct UPrisonerBodySymptom_BlurredVision : UPrisonerBodySymptom_PeriodicAffect {
	FRuntimeFloatCurve _intensityVsElapsedTimeRatio; // 0xe8
};

struct UGizmoComponentHitTarget : UObject {
	UPrimitiveComponent* Component; // 0x30
};

struct ULuminRuntimeSettings : UObject {
	FString PackageName; // 0x28
	FString ApplicationDisplayName; // 0x38
	ELuminFrameTimingHint FrameTimingHint; // 0x48
	bool bProtectedContent; // 0x49
	bool bManualCallToAppReady; // 0x4a
	bool bUseMobileRendering; // 0x4b
	bool bUseVulkan; // 0x4c
	FFilePath Certificate; // 0x50
	FDirectoryPath IconModelPath; // 0x60
	FDirectoryPath IconPortalPath; // 0x70
	FLocalizedIconInfos LocalizedIconInfos; // 0x80
	int32_t VersionCode; // 0x90
	int32_t MinimumAPILevel; // 0x94
	TArray<ELuminPrivilege> AppPrivileges; // 0x98
	TArray<FLuminComponentSubElement> ExtraComponentSubElements; // 0xa8
	TArray<FLuminComponentElement> ExtraComponentElements; // 0xb8
	FString SpatializationPlugin; // 0xc8
	FString ReverbPlugin; // 0xd8
	FString OcclusionPlugin; // 0xe8
	int32_t SoundCueCookQualityIndex; // 0xf8
	bool bRemoveDebugInfo; // 0xfc
	FDirectoryPath VulkanValidationLayerLibs; // 0x100
	bool bFrameVignette; // 0x110
	TArray<FLocalizedAppName> LocalizedAppNames; // 0x118
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct ULuminARCandidateImage : UARCandidateImage {
	bool bUseUnreliablePose; // 0x58
	bool bImageIsStationary; // 0x59
	EMagicLeapImageTargetOrientation AxisOrientation; // 0x5a
};

struct UCustomZoneSettingsApplyNotification : UUserWidget {
	UTextBlock* _text; // 0x260
};

struct UPrisonerBodySymptom_FeelingCold : UPrisonerBodySymptom {
	float _maxSeverity; // 0xb8
	float _temperatureDeltaAtMaxSeverity; // 0xbc
};

struct UEdgeLoopInsertionProperties : UInteractiveToolPropertySet {
	EEdgeLoopPositioningMode PositionMode; // 0x60
	EEdgeLoopInsertionMode InsertionMode; // 0x64
	int32_t NumLoops; // 0x68
	double ProportionOffset; // 0x70
	double DistanceOffset; // 0x78
	bool bInteractive; // 0x80
	bool bFlipOffsetDirection; // 0x81
	bool bWireframe; // 0x82
	double VertexTolerance; // 0x88
};

struct ADummyPawn_C : APawn {
	USceneComponent* DefaultSceneRoot; // 0x280
};

struct UBehaviorTreeManager : UObject {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct UUI_Lockpicking_C : ULockpickingWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UImage* Image_1; // 0x2c0
	UImage* Image_2; // 0x2c8
	UImage* Image_3; // 0x2d0
	UImage* Image_11; // 0x2d8
	UImage* Image_21; // 0x2e0
	UTextBlock* LockpicksCountText; // 0x2e8
	UImage* progress; // 0x2f0
	UTextBlock* RemainingTimeText; // 0x2f8
	UTextBlock* TensionToolCountText; // 0x300
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UARObjectComponent : UARComponent {
	FARObjectUpdatePayload ReplicatedPayload; // 0x280
};

struct UProceduralBoxToolProperties : UProceduralRectangleToolProperties {
	float Height; // 0x80
	int32_t HeightSubdivisions; // 0x84
};

struct UMovieScene3DConstraintSection : UMovieSceneSection {
	FGuid ConstraintId; // 0xe8
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf8
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x90
	FName TrackName; // 0xa0
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct ULiveLinkComponent : UActorComponent {
	FMulticastInlineDelegate OnLiveLinkUpdated; // 0xb0
};

struct UUI_PlaceableElement_C : UPlaceableElementWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	UButton* Button_1; // 0x290
	UImage* Image_106; // 0x298
	UImage* Image_bg_black; // 0x2a0
	URetainerBox* RetainerBox_1; // 0x2a8
};

struct UContainerDisplay : UUserWidget {
	UImage* _containerImage; // 0x2c8
	UImage* _containerImage2; // 0x2d0
	USizeBox* _sizeBox; // 0x2d8
	UTextBlock* _name; // 0x2e0
	UTextBlock* _name2; // 0x2e8
	UTextBlock* _durability; // 0x2f0
	UTextBlock* _durability2; // 0x2f8
	UProgressBar* _durabilityProgressBar; // 0x300
	UProgressBar* _durabilityProgressBar2; // 0x308
	UWidgetSwitcher* _selectionSwitcher; // 0x310
	float _width; // 0x318
	float _height; // 0x31c
};

struct UPrisonerViewComponent : UActorComponent {
	float DefaultSubviewBlendDuration; // 0xb0
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	FSourceEffectWaveShaperSettings Settings; // 0x98
};

struct UMalfunctionsContainerWidget : UDesignableUserWidget {
	FSlateColor HotkeyTextColorUnhovered; // 0x278
	FSlateColor HotkeyTextColorHovered; // 0x2a0
	UCircularMenuWidget* _malfunctionsCircularMenu; // 0x2c8
	UWidgetSwitcher* _hotkeyDisplaySwitcher; // 0x2d0
	UTextBlock* _twoOp_2; // 0x2d8
	UTextBlock* _twoOp_3; // 0x2e0
	UTextBlock* _threeOp_2; // 0x2e8
	UTextBlock* _threeOp_3; // 0x2f0
	UTextBlock* _threeOp_4; // 0x2f8
	UTextBlock* _fourOp_2; // 0x300
	UTextBlock* _fourOp_3; // 0x308
	UTextBlock* _fourOp_4; // 0x310
	UTextBlock* _fourOp_5; // 0x318
};

struct USearchItemDataAsset : UDataAsset {
	FText Caption; // 0x30
	float Duration; // 0x48
	TArray<FSearchPerItemData> SearchData; // 0x50
	UAkAudioEvent* StartSearchAudioEvent; // 0x60
	UAkAudioEvent* StopSearchAudioEvent; // 0x68
	ENoiseLevel noiseLevel; // 0x70
};

struct UClientSettingsUIController : UObject {
	UInputWidget* InputWidget; // 0x70
};

struct UUVLayoutPreviewProperties : UInteractiveToolPropertySet {
	bool bVisible; // 0x60
	float ScaleFactor; // 0x64
	EUVLayoutPreviewSide WhichSide; // 0x68
	bool bShowWireframe; // 0x6c
	FVector2D Shift; // 0x70
};

struct UTrapData : UDataAsset {
	USphereMotionTriggerComponent* SphereMotionTriggerComponentClass; // 0x30
	UBoxMotionTriggerComponent* BoxMotionTriggerComponentClass; // 0x38
	ULaserTriggerComponent* LaserTriggerComponentClass; // 0x40
	UTimedTriggerComponent* TimedTriggerComponentClass; // 0x48
};

struct AWeaponBow : AWeapon {
	FBodyWeaponAnimation InsertArrowAnimations; // 0x2dd0
	FBodyWeaponAnimation RemoveArrowAnimations; // 0x2de0
	FBodyWeaponAnimation UnableToDrawAnimations; // 0x2df0
	FBodyWeaponAnimation DrawAnimations2[0x3]; // 0x2e00
	FBodyWeaponAnimation DrawWhileAnticipatingDrawAnimations2[0x3]; // 0x2e30
	FBodyWeaponAnimation CancelDrawAnimations2[0x3]; // 0x2e60
	FBodyWeaponAnimation LooseAnimations2[0x3]; // 0x2e90
	FBodyWeaponAnimation LooseLastShotAnimations2[0x3]; // 0x2ec0
	FWeaponBowAimOffsets AimOffsets[0x7]; // 0x2ef0
	FWeaponBowArmsShake ArmsShakeAnimamtion[0x4]; // 0x2f98
	FBodyWeaponAnimation DrawAnimations; // 0x3058
	FBodyWeaponAnimation DrawWhileAnticipatingDrawAnimations; // 0x3068
	FBodyWeaponAnimation CancelDrawAnimations; // 0x3078
	FBodyWeaponAnimation LooseAnimations; // 0x3088
	FBodyWeaponAnimation LooseLastShotAnimations; // 0x3098
	UAnimSequenceBase* WeaponAimingDownTheSightsAnimationPose; // 0x30a8
	UAnimSequenceBase* WeaponAimingDownTheSightsStillAnimationPose; // 0x30b0
	UWeaponState* AnticipateDrawState2; // 0x30b8
	UWeaponState* DrawState3; // 0x30c0
	UWeaponState* CancelFiringState; // 0x30c8
	UWeaponState* AnticipateFiringState; // 0x30d0
	UWeaponState* FireState; // 0x30d8
	UWeaponState* FireAndInsertArrowState; // 0x30e0
	UAkAudioEvent* _fireNoArrowAudioEvent; // 0x30e8
	FName _arrowSocketName; // 0x30f0
	float _muzzleVelocity; // 0x30f8
	float _drawWeight; // 0x30fc
	float _compoundBowFullDrawHoldTime; // 0x3100
	float _armShakeTimerDecreaseRate; // 0x3104
	float _damageOnUsage; // 0x3108
	UWeaponState* _bowActiveState2; // 0x3110
	UWeaponState* _bowInsertArrowState; // 0x3118
	UWeaponState* _bowRemoveArrowState; // 0x3120
	UWeaponStateFiring* _bowFiringState2; // 0x3128
	EWeaponBowState _bowState; // 0x3160
	FWeaponBowStateDataReplicated _weaponBowStateDataReplicated; // 0x3164
	UStaticMeshComponent* _arrowMeshComponent; // 0x3170
	FProjectileArrowData _projectileArrowData; // 0x3178
	bool _isCompound; // 0x31e8
	UStaticMeshComponent* _handTriggerMeshComponent; // 0x31f0
	bool _ignoreArrowStiffness; // 0x31f8
	float _letOff; // 0x31fc
	FName _handTriggerBoneName; // 0x3200
};

struct UUI_CharacterSelection_C : UCharacterSelectionWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UUI_TrashMenuButton_C* BackButton; // 0x268
	UOverlay* CharacterSlotsOverlay; // 0x270
	UVerticalBox* CharacterSlotsVerticalBox; // 0x278
	UUI_TrashMenuButton_C* CreateButton; // 0x280
	UUI_CriminalRecord_C* CriminalRecord; // 0x288
	UOverlay* CriminalRecordOverlay; // 0x290
	UUI_YesNoMenuConfirmation_C* DeleteCharacterConfirmation; // 0x298
	UImage* Image_1; // 0x2a0
	UImage* Image_5; // 0x2a8
	UImage* Image_351; // 0x2b0
	UCanvasPanel* MainCanvasPanel; // 0x2b8
	UScrollBox* MainScrollBox; // 0x2c0
	UUI_TrashMenuButton_C* SelectButton; // 0x2c8
	UUI_CharacterSlot_C* _deletingCharSlot; // 0x2d0
	UUserProfile* _selectedUserProfile; // 0x2d8
};

struct UUI_CC_SkillSlider_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UTextBlock* T_SkillName; // 0x280
	UUI_CC_NonSelectableText_C* UI_CC_NonSelectableText; // 0x288
	UUI_Trash_Slider_Widget_C* UI_Trash_Slider_Widget; // 0x290
	bool EnabledState; // 0x298
	FSkillTemplate SkillTemplate; // 0x2a0
	FMulticastInlineDelegate SliderChanged; // 0x2d8
	FMulticastInlineDelegate SliderSelected; // 0x2e8
	FMulticastInlineDelegate SliderDeselected; // 0x2f8
};

struct UTrashNamedCarouselWidget : UUserWidget {
	FMulticastInlineDelegate ValueChangedTemp_DONOTUSE; // 0x290
	USizeBox* _nameBox; // 0x2a0
	UTextBlock* _name; // 0x2a8
	UTrashCarouselWidget* _carousel; // 0x2b0
	USelectionOverlayWidget* _focusBackground; // 0x2b8
	FString _label; // 0x2c0
	FText _mainLabel; // 0x2d0
	FSlateFontInfo _defaultFont; // 0x2e8
	TArray<FString> _possibleValues; // 0x398
	TArray<FText> _carouselValues; // 0x3a8
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x460
	float CapsuleRadius; // 0x464
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UComboBox : UWidget {
	TArray<UObject*> Items; // 0x108
	FDelegate OnGenerateWidgetEvent; // 0x118
	bool bIsFocusable; // 0x128
};

struct UFishingContainerWidget : UUserWidget {
	UFishingBarWidget* _castingBarWidget; // 0x260
	UFishingBarWidget* _fishingBarWidget; // 0x268
	float _tensionBarInterpSpeed; // 0x270
};

struct USharpPullKelvinletBrushOpProps : UBaseKelvinletBrushOpProps {
	float Falloff; // 0x70
	float Depth; // 0x74
};

struct ULevelSequencePlayer : UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnCameraCut; // 0x680
};

struct UCircularProgressBarSprites_C : UBaseProgressBar_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UWidgetAnimation* OuterCircleAlarmAnimation; // 0x2f0
	UImage* BackgroundGradient; // 0x2f8
	UImage* CentralBackgroundDark; // 0x300
	UImage* Fill_Value_BCG; // 0x308
	UImage* Icon; // 0x310
	UImage* Image_219; // 0x318
	UImage* ImageSpentFiller; // 0x320
	UImage* IndicatorOutlinesWhite; // 0x328
	UImage* OuternWarningIndicator; // 0x330
	UHorizontalBox* ProgressTextBox; // 0x338
	UTextBlock* TPercentage; // 0x340
	UTextBlock* TPercentSign; // 0x348
	UTextBlock* TTitle; // 0x350
	UMaterialInstanceDynamic* CircularMaterial; // 0x358
	FLinearColor AlarmColor; // 0x360
	FLinearColor NormalColor; // 0x370
	FLinearColor outerCircleColor; // 0x380
	FLinearColor circularBarColor; // 0x390
	float _currentPercentageToShow; // 0x3a0
	UTexture2D* Image; // 0x3a8
	bool ShouldProgressTextBeVisible; // 0x3b0
	FLinearColor TextColor; // 0x3b4
	float _speedChange; // 0x3c4
};

struct UMaterialExpressionShaderStageSwitch : UMaterialExpression {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct UMagicLeapARPinSaveGame : USaveGame {
	FGuid PinnedID; // 0x28
	FTransform ComponentWorldTransform; // 0x40
	FTransform PinTransform; // 0x70
	bool bShouldPinActor; // 0xa0
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	ENavDataGatheringModeConfig DataGatheringMode; // 0x70
	float DirtyAreaWarningSizeThreshold; // 0x74
	TArray<FNavDataConfig> SupportedAgents; // 0x78
	FNavAgentSelector SupportedAgentsMask; // 0x88
	TArray<ANavigationData*> NavDataSet; // 0x90
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa0
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc0
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd0
	FNavigationSystemRunMode OperationMode; // 0x1fc
	float DirtyAreasUpdateFreq; // 0x15fc
};

struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct UABP_ImprovisedFishingReel_C : UFishingReelAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x2f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3a8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x458
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x4a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x540
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x698
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x6c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x818
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x840
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x868
};

struct UPrisonerActionTuneBow : UPrisonerAction {
	UAkAudioEvent* _tuneBowAudioEvent; // 0x108
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct UMeleeDetectHitCollisionCapsule : UCapsuleComponent {
	EDetectHitCollisionType DetectHitCollisionType; // 0x468
};

struct UInputTouchDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputTouchDelegateBinding> InputTouchDelegateBindings; // 0x28
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UPlanarReflectionComponent : USceneCaptureComponent {
	UBoxComponent* PreviewBox; // 0x2b0
	float NormalDistortionStrength; // 0x2b8
	float PrefilterRoughness; // 0x2bc
	float PrefilterRoughnessDistance; // 0x2c0
	int32_t ScreenPercentage; // 0x2c4
	float ExtraFOV; // 0x2c8
	float DistanceFromPlaneFadeStart; // 0x2cc
	float DistanceFromPlaneFadeEnd; // 0x2d0
	float DistanceFromPlaneFadeoutStart; // 0x2d4
	float DistanceFromPlaneFadeoutEnd; // 0x2d8
	float AngleFromPlaneFadeStart; // 0x2dc
	float AngleFromPlaneFadeEnd; // 0x2e0
	bool bShowPreviewPlane; // 0x2e4
	bool bRenderSceneTwoSided; // 0x2e5
};

struct USeamSculptToolProperties : UInteractiveToolPropertySet {
	bool bShowWireframe; // 0x60
	bool bHitBackFaces; // 0x61
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
	float PointOfViewBackwardOffset; // 0x64
	float NearClippingRadius; // 0x68
};

struct UVehicleHitZoneManager : UMeshHitZones {
	FName _vehicleHitMeshName; // 0xd0
	TArray<UMaterialInterface*> _engineBlock; // 0xd8
	TArray<FVehicleHitZoneData> _doors; // 0xe8
	TArray<FVehicleHitZoneData> _doorWindows; // 0xf8
	TArray<FVehicleHitZoneData> _wheelTires; // 0x108
};

struct UWeaponBowAnimInstance : UWeaponAnimInstance {
	float _armsShakeValue; // 0x300
	bool _useArrowLookAt; // 0x304
	UAnimSequenceBase* _aimingDownTheSightsAnimation; // 0x308
	UAnimSequenceBase* _aimingDownTheSightsStillAnimation; // 0x310
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UABP_Prisoner_Fishing_C : UPrisonerAnimInstance_Fishing {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x318
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x4a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x660
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x6e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x780
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x800
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x880
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x920
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0xab0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xc40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xdd0
};

struct UItemSpawnerComponent : USceneComponent {
	int32_t ItemSpawnLimit; // 0x1f8
	TArray<FItemSpawnerMarker> SpawnerMarkers; // 0x200
	FString SpawnerGroupName; // 0x210
};

struct UStatisticsListRow : UUserWidget {
	UTextBlock* _statNameTextBox; // 0x260
	UTextBlock* _statValueTextBox; // 0x268
	UTextBlock* _statUnitTextBox; // 0x270
};

struct UMovieSceneLiveLinkSection : UMovieSceneSection {
	FLiveLinkSubjectPreset SubjectPreset; // 0xe8
	TArray<bool> ChannelMask; // 0x120
	TArray<UMovieSceneLiveLinkSubSection*> SubSections; // 0x130
	FName SubjectName; // 0x150
	FLiveLinkFrameData TemplateToPush; // 0x158
	FLiveLinkRefSkeleton RefSkeleton; // 0x1e8
	TArray<FName> CurveNames; // 0x208
	TArray<FMovieSceneFloatChannel> PropertyFloatChannels; // 0x218
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x340
	float LightFalloffExponent; // 0x344
	float SourceRadius; // 0x348
	float SoftSourceRadius; // 0x34c
	float SourceLength; // 0x350
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct UAkItemBoolProperties : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnPropertyDragged; // 0x118
};

struct UUI_DropdownMenuColorSelectionWidget_C : UDropdownMenuSelectionWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	UUI_CustomBorder_C* SelectionBorder; // 0x2a0
	UImage* SelectionImage; // 0x2a8
	FLinearColor Color; // 0x2b0
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UFontFace : UObject {
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42
};

struct ABP_WeaponBullet_50BMG_Crafted_C : AProjectile {
	FPointerToUberGraphFrame UberGraphFrame; // 0x418
};

struct UAudioAnalyzerNRT : UAudioAnalyzerAsset {
	USoundWave* Sound; // 0x28
	float DurationInSeconds; // 0x30
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UAnimNotifyState_PhysicalAnimation : UAnimNotifyState {
	bool GotoRagdollOnEnd; // 0x30
	FName BodyProfileName; // 0x34
	FName ConstraintProfileName; // 0x3c
	FName BoneName; // 0x44
	FName StrengthBlendCurveName; // 0x4c
	FName PhysicsBlendCurveName; // 0x54
};

struct UCharacterSpawnerPreset : UObject {
	FCharacterSpawnerData SpawnerData; // 0x28
};

struct UCTFParticipantStats : UGameEventParticipantStats {
	int32_t Pickups; // 0x48
	int32_t Captures; // 0x4c
	int32_t Returns; // 0x50
};

struct AFishingAttachment : AItem {
	UStaticMesh* _staticMeshWhenAttached; // 0x7c0
};

struct UParticleModuleVectorFieldRotationRate : UParticleModuleVectorFieldBase {
	FVector RotationRate; // 0x30
};

struct UVariant : UObject {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct AProjectileArrow : AProjectile {
	USceneComponent* _tempSceneComponent; // 0x418
	USceneComponent* _relativeRotationSceneComponent; // 0x420
	FProjectileArrowData _projectileArrowData; // 0x428
};

struct UUI_Metabolism_BodyEffect_ProgressBar_C : UMetabolismBodyEffectProgressBar {
	UImage* PaddedBackground; // 0x308
};

struct UPrisonerBodyConditionOrSymptomUIData : UPrisonerBodyEffectUIData {
	bool _isVisibleByDefault; // 0x38
	FText _name; // 0x40
	FText _description; // 0x58
	TArray<UPrisonerBodyConditionOrSymptomSideEffectUIData*> _sideEffectsUIData; // 0x80
};

struct AWaterBody : AActor {
	UPhysicalMaterial* PhysicalMaterial; // 0x230
	float TargetWaveMaskDepth; // 0x238
	float MaxWaveHeightOffset; // 0x23c
	int32_t WaterBodyIndex; // 0x240
	bool bFillCollisionUnderWaterBodiesForNavmesh; // 0x244
	FUnderwaterPostProcessSettings UnderwaterPostProcessSettings; // 0x250
	EWaterBodyType WaterBodyType; // 0x7c0
	FWaterCurveSettings CurveSettings; // 0x7c8
	UMaterialInterface* WaterMaterial; // 0x7e8
	UMaterialInterface* UnderwaterPostProcessMaterial; // 0x7f0
	bool bAffectsLandscape; // 0x7f8
	bool bGenerateCollisions; // 0x7f9
	bool bOverrideWaterMesh; // 0x7fa
	UStaticMesh* WaterMeshOverride; // 0x800
	int32_t OverlapMaterialPriority; // 0x808
	FName CollisionProfileName; // 0x80c
	UWaterSplineComponent* SplineComp; // 0x818
	UWaterSplineMetadata* WaterSplineMetadata; // 0x820
	UMaterialInstanceDynamic* WaterMID; // 0x828
	UMaterialInstanceDynamic* UnderwaterPostProcessMID; // 0x830
	TArray<LazyObjectProperty> Islands; // 0x838
	TArray<LazyObjectProperty> ExclusionVolumes; // 0x848
	TWeakObjectPtr<ALandscapeProxy> Landscape; // 0x858
	FPostProcessSettings CurrentPostProcessSettings; // 0x860
	bool bCanAffectNavigation; // 0xdb0
	UNavAreaBase* WaterNavAreaClass; // 0xdb8
	UWaterWavesBase* WaterWaves; // 0xdc0
	bool bHasWaveSpectrumSettings; // 0xdc8
	bool bHasTerrainCarvingSettingsSettings; // 0xdc9
};

struct UNewMeshMaterialProperties : UInteractiveToolPropertySet {
	TWeakObjectPtr<UMaterialInterface> Material; // 0x60
	float UVScale; // 0x68
	bool bWorldSpaceUVScale; // 0x6c
	bool bWireframe; // 0x6d
	bool bShowExtendedOptions; // 0x6e
};

struct UConsole : UObject {
	ULocalPlayer* ConsoleTargetPlayer; // 0x38
	UTexture2D* DefaultTexture_Black; // 0x40
	UTexture2D* DefaultTexture_White; // 0x48
	TArray<FString> HistoryBuffer; // 0x68
};

struct ABP_Survival_Blueprints_CompleteShelter_Objective_C : ABlueprintableItemObjective {
	USceneComponent* DefaultSceneRoot; // 0x368
};

struct UGerstnerWaterWaveGeneratorSpectrum : UGerstnerWaterWaveGeneratorBase {
	EWaveSpectrumType SpectrumType; // 0x28
	TArray<FGerstnerWaveOctave> Octaves; // 0x30
};

struct UInterpTrackInstColorProp : UInterpTrackInstProperty {
	FColor ResetColor; // 0x58
};

struct AOnlineBeacon : AActor {
	float BeaconConnectionInitialTimeout; // 0x228
	float BeaconConnectionTimeout; // 0x22c
	UNetDriver* NetDriver; // 0x230
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct USourceEffectDynamicsProcessorPreset : USoundEffectSourcePreset {
	FSourceEffectDynamicsProcessorSettings Settings; // 0xb8
};

struct UTextureLightProfile : UTexture2D {
	float Brightness; // 0x100
	float TextureMultiplier; // 0x104
};

struct UMaterialExpressionLogarithm2 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UDualArcedProgressBar : UUserWidget {
	UImage* _frontFillImage; // 0x260
	UImage* _backFillImage; // 0x268
	UMaterialInstanceConstant* _frontFillMaterial; // 0x270
	UMaterialInstanceConstant* _backFillMaterial; // 0x278
	FLinearColor _frontFillColor; // 0x280
	FLinearColor _backFillColor; // 0x290
};

struct USourceEffectMidSideSpreaderPreset : USoundEffectSourcePreset {
	FSourceEffectMidSideSpreaderSettings Settings; // 0x98
};

struct UInventoryItemComponent : UItemComponent {
	int32_t _sizeX; // 0xc0
	int32_t _sizeY; // 0xc4
	int32_t _maxRowsPerPage; // 0xc8
	TArray<UInventoryItemComponentReplicatedPage*> _replicatedPages; // 0xe0
};

struct UEnvQueryTest_Project : UEnvQueryTest {
	FEnvTraceData ProjectionData; // 0x1f8
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x470
	EWidgetTimingPolicy TimingPolicy; // 0x471
	UUserWidget* WidgetClass; // 0x478
	FIntPoint DrawSize; // 0x480
	bool bManuallyRedraw; // 0x488
	bool bRedrawRequested; // 0x489
	float RedrawTime; // 0x48c
	FIntPoint CurrentDrawSize; // 0x498
	bool bDrawAtDesiredSize; // 0x4a0
	FVector2D Pivot; // 0x4a4
	bool bReceiveHardwareInput; // 0x4ac
	bool bWindowFocusable; // 0x4ad
	EWindowVisibility WindowVisibility; // 0x4ae
	bool bApplyGammaCorrection; // 0x4af
	ULocalPlayer* OwnerPlayer; // 0x4b0
	FLinearColor BackgroundColor; // 0x4b8
	FLinearColor TintColorAndOpacity; // 0x4c8
	float OpacityFromTexture; // 0x4d8
	EWidgetBlendMode BlendMode; // 0x4dc
	bool bIsTwoSided; // 0x4dd
	bool TickWhenOffscreen; // 0x4de
	UBodySetup* BodySetup; // 0x4e0
	UMaterialInterface* TranslucentMaterial; // 0x4e8
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4f0
	UMaterialInterface* OpaqueMaterial; // 0x4f8
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x500
	UMaterialInterface* MaskedMaterial; // 0x508
	UMaterialInterface* MaskedMaterial_OneSided; // 0x510
	UTextureRenderTarget2D* RenderTarget; // 0x518
	UMaterialInstanceDynamic* MaterialInstance; // 0x520
	bool bAddedToScreen; // 0x528
	bool bEditTimeUsable; // 0x529
	FName SharedLayerName; // 0x52c
	int32_t LayerZOrder; // 0x534
	EWidgetGeometryMode GeometryMode; // 0x538
	float CylinderArcAngle; // 0x53c
	ETickMode TickMode; // 0x540
	UUserWidget* Widget; // 0x568
};

struct ACableActor : AActor {
	UCableComponent* CableComponent; // 0x220
};

struct UChoppingRecipeDataAsset : UDataAsset {
	FChoppingRecipe ChoppingRecipe; // 0x30
};

struct UPreviousNextSwitchWidget : UDesignableUserWidget {
	FMulticastInlineDelegate IndexChanged; // 0x278
	UButton* PreviousButton; // 0x288
	UButton* NextButton; // 0x290
	int32_t _index; // 0x2a0
};

struct UVisualOverlayItemTag : UBaseItemTag {
	UMaterialInterface* OverlayMaterial; // 0x30
	int32_t Priority; // 0x38
	bool ShouldBeVisibleInFirstPersonView; // 0x3c
	bool ShouldBeVisibleInThirdPersonView; // 0x3d
};

struct ULiveLinkVirtualSubjectSourceSettings : ULiveLinkSourceSettings {
	FName SourceName; // 0xa0
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char CastShadow : 1; // 0x38c
	char bCastDynamicShadow : 1; // 0x38c
	char bCastStaticShadow : 1; // 0x38c
	char bCastFarShadow : 1; // 0x390
	char bCastHiddenShadow : 1; // 0x394
	char bCastShadowAsTwoSided : 1; // 0x398
	char bAffectDistanceFieldLighting : 1; // 0x39c
	FLightingChannels LightingChannels; // 0x39d
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a0
	char bRenderCustomDepth : 1; // 0x3a0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3a4
	int32_t CustomDepthStencilValue; // 0x3a8
	float LDMaxDrawDistance; // 0x3ac
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b0
	int32_t CollisionMipLevel; // 0x3c8
	int32_t SimpleCollisionMipLevel; // 0x3cc
	float CollisionThickness; // 0x3d0
	FBodyInstance BodyInstance; // 0x3d8
	char bGenerateOverlapEvents : 1; // 0x530
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x530
	int32_t ComponentSizeQuads; // 0x534
	int32_t SubsectionSizeQuads; // 0x538
	int32_t NumSubsections; // 0x53c
	char bUsedForNavigation : 1; // 0x540
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x540
	bool bUseDynamicMaterialInstance; // 0x544
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x545
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x546
	bool bHasLayersContent; // 0x547
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x548
};

struct UMaterialExpressionArctangent2 : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
};

struct AGlobalAnimalSpawner : AActor {
	TMap<AAnimal2*, FGlobalAnimalSpawnInfo> SpawnInfo; // 0x220
	float SpawnAnythingChance; // 0x270
	TArray<EPhysicalSurface> AllowedSurfaces; // 0x278
	int32_t MaxCarcassesAllowed; // 0x288
	TArray<AAnimalSpawner2*> AnimalSpawners; // 0x290
	UBillboardComponent* Sprite; // 0x2a0
};

struct UPrisonerBodyEffect_Limping : UPrisonerBodyEffect {
	float _duration; // 0x40
	float _elapsedTime; // 0x44
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UPositionPlaneGizmo : UInteractiveGizmo {
	UPreviewMesh* CenterBallShape; // 0x88
	UMaterialInstance* CenterBallMaterial; // 0x90
};

struct USpawnScreen : UDesignableUserWidget {
	UOverlay* Screen; // 0x278
	UButton* _mainMenuButton; // 0x280
	UVerticalBox* _messageBoxPanel; // 0x288
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UUI_DoorUpgradeSlot_C : UUpgradeSlotWidget {
	UImage* _backgroundImage_2; // 0x2f8
};

struct UUI_StatisticsDetailsWidget_C : UStatisticsDetailsWidget {
	UImage* _verticalLine; // 0x390
};

struct AWater_Bucket_C : AItem {
	UBasicGameResourceContainerComponent* WaterBucketGameResourceContainer; // 0x7c0
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct USoundNodeModulatorContinuous : USoundNode {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UInventorySlotUserWidget : UDesignableUserWidget {
	bool HasItem; // 0x278
	UImage* ImageWidget; // 0x280
	USizeBox* SizeBoxWrapper; // 0x288
	UBaseItemContainerWidget* ParentContainerWidget; // 0x290
};

struct UFishingRodAnimInstance : UAnimInstance {
	bool IsInMinigame; // 0x2b8
	FVector RodTipLocation; // 0x2bc
	FVector BentRodTipLocation; // 0x2c8
	FVector BendDirection; // 0x2d4
	float BendAmount; // 0x2e0
};

struct ABP_Survival_Tutorial_CraftStoneKnifeObjective_C : ACraftingObjective {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	USceneComponent* DefaultSceneRoot; // 0x350
	AMissionDialogueManager* DialogueManager; // 0x358
	bool _firstTimeOpened; // 0x360
	UCraftableItem* CraftableItem; // 0x368
	UDialogueData* DialogueData; // 0x370
};

struct APlayerState : AInfo {
	float Score; // 0x220
	int32_t PlayerId; // 0x224
	char ping; // 0x228
	char bShouldUpdateReplicatedPing : 1; // 0x22a
	char bIsSpectator : 1; // 0x22a
	char bOnlySpectator : 1; // 0x22a
	char bIsABot : 1; // 0x22a
	char bIsInactive : 1; // 0x22a
	char bFromPreviousLevel : 1; // 0x22a
	int32_t StartTime; // 0x22c
	ULocalMessage* EngineMessageClass; // 0x230
	FString SavedNetworkAddress; // 0x240
	FUniqueNetIdRepl UniqueId; // 0x250
	APawn* PawnPrivate; // 0x280
	FString PlayerNamePrivate; // 0x300
};

struct UTriggerItemTag : UBaseItemTag {
	ETrapTriggerType TriggerType; // 0x30
};

struct UBaseCreateFromSelectedTool : UMultiSelectionTool {
	UTransformInputsToolProperties* TransformProperties; // 0x98
	UBaseCreateFromSelectedHandleSourceProperties* HandleSourcesProperties; // 0xa0
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xa8
	TArray<UTransformProxy*> TransformProxies; // 0xb0
	TArray<UTransformGizmo*> TransformGizmos; // 0xc0
	TArray<FVector> TransformInitialScales; // 0xd0
};

struct UFont : UObject {
	EFontCacheType FontCacheType; // 0x30
	TArray<FFontCharacter> Characters; // 0x38
	TArray<UTexture2D*> Textures; // 0x48
	int32_t IsRemapped; // 0x58
	float EmScale; // 0x5c
	float Ascent; // 0x60
	float Descent; // 0x64
	float Leading; // 0x68
	int32_t Kerning; // 0x6c
	FFontImportOptionsData ImportOptions; // 0x70
	int32_t NumCharacters; // 0x120
	TArray<int32_t> MaxCharHeight; // 0x128
	float ScalingFactor; // 0x138
	int32_t LegacyFontSize; // 0x13c
	FName LegacyFontName; // 0x140
	FCompositeFont CompositeFont; // 0x148
};

struct UCurveLinearColorAtlas : UTexture2D {
	uint32_t TextureSize; // 0x100
	TArray<UCurveLinearColor*> GradientCurves; // 0x108
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UParticleModuleCollision : UParticleModuleCollisionBase {
	FRawDistributionVector DampingFactor; // 0x30
	FRawDistributionVector DampingFactorRotation; // 0x78
	FRawDistributionFloat MaxCollisions; // 0xc0
	EParticleCollisionComplete CollisionCompletionOption; // 0xf0
	TArray<EObjectTypeQuery> CollisionTypes; // 0xf8
	char bApplyPhysics : 1; // 0x110
	char bIgnoreTriggerVolumes : 1; // 0x110
	FRawDistributionFloat ParticleMass; // 0x118
	float DirScalar; // 0x148
	char bPawnsDoNotDecrementCount : 1; // 0x14c
	char bOnlyVerticalNormalsDecrementCount : 1; // 0x14c
	float VerticalFudgeFactor; // 0x150
	FRawDistributionFloat DelayAmount; // 0x158
	char bDropDetail : 1; // 0x188
	char bCollideOnlyIfVisible : 1; // 0x188
	char bIgnoreSourceActor : 1; // 0x188
	float MaxCollisionDistance; // 0x18c
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x2d0
	char bStopAILogicOnUnposses : 1; // 0x2d0
	char bLOSflag : 1; // 0x2d0
	char bSkipExtraLOSChecks : 1; // 0x2d0
	char bAllowStrafe : 1; // 0x2d0
	char bWantsPlayerState : 1; // 0x2d0
	char bSetControlRotationFromPawnOrientation : 1; // 0x2d0
	UPathFollowingComponent* PathFollowingComponent; // 0x2d8
	UBrainComponent* BrainComponent; // 0x2e0
	UAIPerceptionComponent* PerceptionComponent; // 0x2e8
	UPawnActionsComponent* ActionsComp; // 0x2f0
	UBlackboardComponent* Blackboard; // 0x2f8
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x300
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x308
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x310
};

struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct UExplosionFailurePenalty : UFailurePenalty {
	float _explosionBaseDamage; // 0x30
	float _minimumDamage; // 0x34
	float _damageInnerRadius; // 0x38
	float _damageOuterRadius; // 0x3c
	float _damageFalloff; // 0x40
	UParticleSystem* _explosionPS; // 0x48
	UAkAudioEvent* _explosionAudioEvent; // 0x50
};

struct UMasterMenu : UUserWidget {
	UWidgetSwitcher* _menuSwitcher; // 0x290
	TMap<EConZMenu, UBaseMenu*> _menuClasses; // 0x298
	EConZMenu _menuToPreview; // 0x2e8
};

struct UPrisonerResponseIdle : UObject {
	TArray<UAnimMontage*> Montages; // 0x28
	float PreMontageDelay; // 0x38
	float PostMontageDelay; // 0x3c
	float CooldownDuration; // 0x40
	bool CanBeUsedWhenItemIsInHands; // 0x44
	TSet<EPrisonerAnimationSet> CombatibleAnimationsSets; // 0x48
};

struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	UVectorField* Field; // 0x38
	bool bTileX; // 0x40
	bool bTileY; // 0x41
	bool bTileZ; // 0x42
};

struct ASmokeGrenadeItem : AGrenadeItem {
	UParticleSystem* _smokeParticle; // 0x850
	UAkAudioEvent* _smokeStartedAudioEvent; // 0x858
	UAkAudioEvent* _smokeStoppedAudioEvent; // 0x860
	float _smokeSoundDuration; // 0x868
	UAkComponent* _smokeAudioComponent; // 0x870
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector position; // 0xb4
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x220
};

struct UReverbEffect : UObject {
	bool bBypassEarlyReflections; // 0x28
	float ReflectionsDelay; // 0x2c
	float GainHF; // 0x30
	float ReflectionsGain; // 0x34
	bool bBypassLateReflections; // 0x38
	float LateDelay; // 0x3c
	float DecayTime; // 0x40
	float Density; // 0x44
	float Diffusion; // 0x48
	float AirAbsorptionGainHF; // 0x4c
	float DecayHFRatio; // 0x50
	float LateGain; // 0x54
	float Gain; // 0x58
	float RoomRolloffFactor; // 0x5c
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct AMetalDetector : AItem {
	UBasicGameResourceContainerComponent* _resourceContainerComponent; // 0x7c0
	float _minDetectionRadius; // 0x7c8
	float _maxDetectionRadius; // 0x7cc
	float _updatePeriod; // 0x7d0
	float _detectionFactor; // 0x7d4
	UAkAudioEvent* _startEvent; // 0x7d8
	UAkAudioEvent* _stopEvent; // 0x7e0
	FName _RTPCName; // 0x7e8
	int32_t _soundInterpolationTimeMs; // 0x7f0
	FName _detectionSourceSocketName; // 0x800
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x80
	ENiagaraRendererSourceDataMode SourceMode; // 0x88
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x90
	ENiagaraSpriteAlignment Alignment; // 0xb0
	ENiagaraSpriteFacingMode FacingMode; // 0xb1
	FVector2D PivotInUVSpace; // 0xb4
	ENiagaraSortMode SortMode; // 0xbc
	FVector2D SubImageSize; // 0xc0
	char bSubImageBlend : 1; // 0xc8
	char bRemoveHMDRollInVR : 1; // 0xc8
	char bSortOnlyWhenTranslucent : 1; // 0xc8
	char bGpuLowLatencyTranslucency : 1; // 0xc8
	float MinFacingCameraBlendDistance; // 0xcc
	float MaxFacingCameraBlendDistance; // 0xd0
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x248
	FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x2a0
	FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x2f8
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x400
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x458
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4b0
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x508
	FNiagaraVariableAttributeBinding UVScaleBinding; // 0x560
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x5b8
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x610
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x668
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x6c0
	TArray<FNiagaraMaterialAttributeBinding> MaterialParameterBindings; // 0x718
};

struct AConZSquad : AActor {
	FDbIntegerId squadId; // 0x220
	FString SquadName; // 0x228
	FString SquadMessage; // 0x238
	FString SquadInformation; // 0x248
	FConZSquadEmblem SquadEmblem; // 0x258
	TArray<FConZSquadPendingMember> _pendingMembers; // 0x260
	TArray<FConZSquadMember> _members; // 0x270
	TArray<FConZSquadMember> _oldMembers; // 0x280
	uint64_t _repEmblem; // 0x290
	int32_t _maxAllowedSquadMembers; // 0x298
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UCCAttributeSpinnerWidget : UUserWidget {
	UTextBlock* _valueTextBlock; // 0x278
	UButton* _increaseValueButton; // 0x280
	UButton* _decreaseValueButton; // 0x288
};

struct ULineSetComponent : UMeshComponent {
	UMaterialInterface* LineMaterial; // 0x470
	FBoxSphereBounds Bounds; // 0x478
	bool bBoundsDirty; // 0x494
};

struct UAkCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x4b8
	FDelegate CheckedStateDelegate; // 0x4bc
	FCheckBoxStyle WidgetStyle; // 0x4d0
	EHorizontalAlignment HorizontalAlignment; // 0xa50
	bool IsFocusable; // 0xa51
	FAkBoolPropertyToControl ThePropertyToControl; // 0xa58
	FAkWwiseItemToControl ItemToControl; // 0xa68
	FMulticastInlineDelegate AkOnCheckStateChanged; // 0xaa8
	FMulticastInlineDelegate OnItemDropped; // 0xab8
	FMulticastInlineDelegate OnPropertyDropped; // 0xac8
};

struct UMovieSceneFadeSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
	FLinearColor FadeColor; // 0x188
	char bFadeAudio : 1; // 0x198
};

struct UMinigameConfiguration : UObject {
	AMinigame* MinigameClass; // 0x28
};

struct UPrisonerActionFillGameResourceContainerWithInfiniteResourceDescription : UPrisonerActionFillGameResourceContainerDescription {
	UGameResourceContainerProxyForInfiniteResource* ProxyForInfiniteResource; // 0xd8
};

struct UPrisonerBodySymptom_NeedToUrinate : UPrisonerBodySymptom {
	FRuntimeFloatCurve _severityVsBladderFullness; // 0xb8
};

struct URadioTrack : UDataAsset {
	UAkAudioEvent* audio; // 0x30
	float Duration; // 0x38
	FName TrackName; // 0x3c
};

struct ULandscapeSplineSegment : UObject {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct UMovieSceneSkeletalAnimationTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
	bool bUseLegacySectionIndexBlend; // 0x90
	FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams; // 0x98
	bool bBlendFirstChildOfRoot; // 0xc8
};

struct UNiagaraDataInterfaceAudioOscilloscope : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
	int32_t Resolution; // 0x40
	float ScopeInMilliseconds; // 0x44
};

struct USoundNodeLooping : USoundNode {
	int32_t LoopCount; // 0x48
	char bLoopIndefinitely : 1; // 0x4c
};

struct AConZCharacter : ACharacter {
	ACorpse* CorpseClass; // 0x4f8
	UChoppingRecipeDataAsset* ChoppingRecipeDataAsset; // 0x500
	bool IterativeChopping; // 0x508
	AItem* ItemRepresentation; // 0x510
	FName HeadBoneName; // 0x518
	TMap<FName, EBodyPart> BodyPartByBoneName; // 0x520
	float HeadHeight; // 0x570
	float TorsoHeight; // 0x574
	bool ShouldAutoUpdateEnvironmentDescription; // 0x578
	float EnvironmentDescriptionAutoUpdateInterval; // 0x57c
	UAkAudioEvent* EnteredIndoorEnvironmentAudioEvent; // 0x580
	UAkAudioEvent* EnteredOutdoorEnvironmentAudioEvent; // 0x588
	UAkAudioEvent* EnteredUndergroundAudioEvent; // 0x590
	UAkAudioEvent* LeftUndergroundAudioEvent; // 0x598
	float _kockoutChanceModifier; // 0x5c0
	UCharacterSoundComponent* SoundComponent; // 0x5c8
	EGender _gender; // 0x5f0
	EConZPxDominanceGroup _physicsDominanceGroup; // 0x610
	float _activeHitTimeToLive; // 0x614
	UCurveFloat* _hitDamageVsVehicleSpeedInKph; // 0x618
	FHitEffects _effectsOnVehicleHit[0x5]; // 0x620
	UPhysicsAsset* _physicsAssetOnServer; // 0x748
	EAITeam _aiTeam; // 0x750
	TArray<UCharacterAction*> _actionsList; // 0x758
	float _characterActionPlayRateMultiplier; // 0x788
	UGrappleActionComponent* _grappleActionComponent; // 0x790
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UDatasmithAreaLightActorTemplate : UDatasmithObjectTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct UGizmoAxisTranslationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Parameter; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurTranslationAxis; // 0xbc
	FVector CurTranslationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct UUniformVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Direction; // 0xb4
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AFlashbangItemEffects : AActor {
	UParticleSystem* _explosionParticles; // 0x220
	UMatineeCameraShake* _explosionCameraShakeClass; // 0x228
	UAkAudioEvent* _explosionAudioEvent; // 0x230
	UAkAudioEvent* _startStunnedSoundEffectsAudioEvent; // 0x238
	UAkAudioEvent* _stopStunnedSoundEffectsAudioEvent; // 0x240
	float _minFlashbangDurationToStartStunnedSoundEffects; // 0x248
	float _fullFlashDuration; // 0x24c
	float _flashFadeOutDuration; // 0x250
	float _flashRadius; // 0x254
	float _flashLineTraceDistance; // 0x258
};

struct AMedicationItem : AItem {
	EMedicationUsage usage; // 0x7c0
	EMedicationType Type; // 0x7c1
	float DailyDoses; // 0x7c4
	float TimeToAbsorbSeconds; // 0x7c8
	float EffectTimeMultiplier; // 0x7cc
	float ReuseEffectTimeIncrease; // 0x7d0
	float MaxEffectTime; // 0x7d4
	EMedicationRepeatedAbuseReaction RepeatedAbuseReaction; // 0x7d8
};

struct UParticleModuleSourceMovement : UParticleModuleLocationBase {
	FRawDistributionVector SourceMovementScale; // 0x30
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct AWeaponAttachmentFlashlight : AWeaponAttachment {
	UAkAudioEvent* _lightActivatedAudioEvent; // 0x7e0
	FName _lightSocketName; // 0x7e8
	FName _materialEmissiveParameterName; // 0x7f0
	UBasicGameResourceContainerComponent* _resourceContainerComponent; // 0x800
};

struct UMovieSceneByteTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct AFlagAreaVisualizer : AActor {
	UStaticMeshComponent* _staticMeshComponent; // 0x220
};

struct UUVProjectionOperatorFactory : UObject {
	UUVProjectionTool* Tool; // 0x30
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x1f8
	FVector SocketOffset; // 0x1fc
	FVector TargetOffset; // 0x208
	float ProbeSize; // 0x214
	ECollisionChannel ProbeChannel; // 0x218
	char bDoCollisionTest : 1; // 0x21c
	char bUsePawnControlRotation : 1; // 0x21c
	char bInheritPitch : 1; // 0x21c
	char bInheritYaw : 1; // 0x21c
	char bInheritRoll : 1; // 0x21c
	char bEnableCameraLag : 1; // 0x21c
	char bEnableCameraRotationLag : 1; // 0x21c
	char bUseCameraLagSubstepping : 1; // 0x21c
	char bDrawDebugLagMarkers : 1; // 0x21d
	float CameraLagSpeed; // 0x220
	float CameraRotationLagSpeed; // 0x224
	float CameraLagMaxTimeStep; // 0x228
	float CameraLagMaxDistance; // 0x22c
};

struct UUI_SquadConfirmation_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* AcceptButton; // 0x268
	UButton* CancelButton; // 0x270
	UExtendedRichTextBlock* DialogText; // 0x278
	FMulticastInlineDelegate OnConfirm; // 0x280
	FMulticastInlineDelegate OnCancel; // 0x290
	FText TextFormat; // 0x2a0
	FTextBlockStyle TextStyle; // 0x2b8
	FSlateColor Color; // 0x528
};

struct ADoubleDoor : ADoor {
	UMeshComponent* Mesh1; // 0x408
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	TArray<FSkeletalMaterial> Materials; // 0xd8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xe8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xf8
	FPerPlatformInt MinLOD; // 0x158
	FPerPlatformBool DisableBelowMinLodStripping; // 0x15c
	EAxis SkelMirrorAxis; // 0x15d
	EAxis SkelMirrorFlipAxis; // 0x15e
	char bUseFullPrecisionUVs : 1; // 0x15f
	char bUseHighPrecisionTangentBasis : 1; // 0x15f
	char bHasBeenSimplified : 1; // 0x15f
	char bHasVertexColors : 1; // 0x15f
	char bEnablePerPolyCollision : 1; // 0x15f
	UBodySetup* BodySetup; // 0x160
	UPhysicsAsset* PhysicsAsset; // 0x168
	UPhysicsAsset* ShadowPhysicsAsset; // 0x170
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x178
	TArray<UMorphTarget*> MorphTargets; // 0x188
	UAnimInstance* PostProcessAnimBlueprint; // 0x310
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x318
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x328
	TArray<UAssetUserData*> AssetUserData; // 0x358
	TArray<USkeletalMeshSocket*> Sockets; // 0x368
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x388
};

struct UParticleModuleColorOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorOverLife; // 0x30
	FRawDistributionFloat AlphaOverLife; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat LifeTime; // 0x30
};

struct UEditPivotToolProperties : UInteractiveToolPropertySet {
	bool bEnableSnapDragging; // 0x60
	EEditPivotSnapDragRotationMode RotationMode; // 0x61
};

struct UWaterWavesAssetReference : UWaterWavesBase {
	UWaterWavesAsset* WaterWavesAsset; // 0x28
};

struct UGranularSynth : USynthComponent {
	USoundWave* GranulatedSoundWave; // 0x6c0
};

struct UEdGraphNode : UObject {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x448
	char bEnableMaterialParameterCaching : 1; // 0x468
};

struct UMaterialExpressionSmoothStep : UMaterialExpression {
	FExpressionInput Min; // 0x40
	FExpressionInput Max; // 0x54
	FExpressionInput Value; // 0x68
	float ConstMin; // 0x7c
	float ConstMax; // 0x80
	float ConstValue; // 0x84
};

struct UGeometryCacheTrackStreamable : UGeometryCacheTrack {
	UGeometryCacheCodecBase* Codec; // 0x58
	float StartSampleTime; // 0xc8
};

struct UItemComponentStateBase : UObject {
	FDbIntegerId ID; // 0x28
	FString ComponentName; // 0x30
};

struct UDoorLockingRegistry : UActorComponent {
	TMap<EDoorUnlockDataType, FDoorUnlockDataCollection> _doorUnlockDataByType; // 0xb0
	int32_t _countNormalizationThreshold; // 0x100
};

struct UMetabolism_ICU_GraphWidget : UGraph2DWidget {
	UCurveFloat* BaseCurve; // 0x1f0
	float CurvePeriodBaseDuration; // 0x1f8
	int32_t MinSamplesForSingleCurvePeriod; // 0x1fc
};

struct UMetabolismBodyStatsPanel : UUserWidget {
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Protein; // 0x260
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Carbs; // 0x268
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Fat; // 0x270
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Minerals; // 0x278
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Vitamins; // 0x280
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Water; // 0x288
	UMetabolismTitleAndAPB* _tapb_NutrientAbsorption_Alcohol; // 0x290
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Bones; // 0x298
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Blood; // 0x2a0
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Intestines; // 0x2a8
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Skin; // 0x2b0
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Organs; // 0x2b8
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Fat; // 0x2c0
	UMetabolismTitleAndAPB* _tapb_BodyMassDistribution_Muscle; // 0x2c8
};

struct UCheckBoxStyleAsset : UObject {
	FCheckBoxStyle CheckBoxStyle; // 0x28
};

struct UProceduralSphereToolProperties : UProceduralShapeToolProperties {
	float Radius; // 0x70
	int32_t LatitudeSlices; // 0x74
	int32_t LongitudeSlices; // 0x78
};

struct UMagicLeapARPinSettings : UObject {
	float UpdateCheckFrequency; // 0x28
	FMagicLeapARPinState OnUpdatedEventTriggerDelta; // 0x2c
};

struct UClearStovePipe : UWeaponActionClearMalfunctionSequence {
	FName MontageEndSectionName; // 0xb8
};

struct ARackItem : AChestItem {
	UStaticMesh* _lockStaticMesh; // 0x870
};

struct UWeaponAnimInstance : UItemAnimInstance {
	float _owningPrisonerWeaponBreathFactor; // 0x2d0
	float _owningPrisonerWeaponAimDownTheSightsStillBlendFactor; // 0x2d4
	bool _isOwningPrisonerAimingDownTheSights; // 0x2d8
	bool _isChamberOpened; // 0x2d9
	int32_t _ammoCount; // 0x2dc
	bool _shouldPlayChamberOpenedIdle; // 0x2e0
	bool _isInGameEvent; // 0x2e1
	EWeaponMalfunction _malfunction; // 0x2e2
	bool _useFiringModeBoneRotation; // 0x2e3
	FRotator _firingModeBoneRotation; // 0x2e4
	float _hideBoneCurveValue; // 0x2f0
};

struct UCurveLinearColor : UCurveBase {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct UNiagaraDataInterfaceHairStrands : UNiagaraDataInterface {
	UGroomAsset* DefaultSource; // 0x38
	AActor* SourceActor; // 0x40
};

struct UBTComposite_SimpleParallel : UBTCompositeNode {
	EBTParallelMode FinishMode; // 0x90
};

struct A1H_Wooden_club_C : AWeaponItem {
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsule; // 0x7f0
};

struct UUI_SortByButton_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UButton* Button_1; // 0x280
	USizeBox* SizeBox_1; // 0x288
	UTextBlock* TextBlock_1; // 0x290
	float Size; // 0x298
	FText Text; // 0x2a0
	SortByTypes Type; // 0x2b8
	FMulticastInlineDelegate OnClicked; // 0x2c0
};

struct ABP_WeaponBullet_WoodenArrow_C : AProjectileArrow {
	FPointerToUberGraphFrame UberGraphFrame; // 0x458
	UParticleSystemComponent* ParticleSystem; // 0x460
};

struct UEditNormalsOperatorFactory : UObject {
	UEditNormalsTool* Tool; // 0x30
};

struct UAISubsystem : UObject {
	UAISystem* AISystem; // 0x30
};

struct AAkSpatialAudioVolume : AVolume {
	UAkSurfaceReflectorSetComponent* SurfaceReflectorSet; // 0x258
	UAkLateReverbComponent* LateReverb; // 0x260
	UAkRoomComponent* Room; // 0x268
};

struct UWaypointWidget : UDesignableUserWidget {
	UTexture2D* IconTexture; // 0x278
	UTexture2D* AccentTexture; // 0x280
	FLinearColor AccentColor; // 0x288
	float BarValue; // 0x298
	FLinearColor BarColor; // 0x29c
	float HeightOffset; // 0x2ac
	bool Emphasized; // 0x2b0
	FLinearColor EmphasisColor; // 0x2b4
	FString LabelText; // 0x2c8
};

struct UEnvQueryTest_PathfindingBatch : UEnvQueryTest_Pathfinding {
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x280
};

struct UDcxVehicleDriveComponentTank : UDcxVehicleDriveComponent {
	EDcxVehicleDriveControlModelTank DriveModel; // 0x3b8
};

struct UAnimNotify_ConditionalPlayParticleEffectForItem : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0xb0
};

struct UPlaneCutTool : UMultiSelectionTool {
	UPlaneCutToolProperties* BasicProperties; // 0x98
	UAcceptOutputProperties* AcceptProperties; // 0xa0
	FVector CutPlaneOrigin; // 0xa8
	FQuat CutPlaneOrientation; // 0xc0
	TArray<UMeshOpPreviewWithBackgroundCompute*> Previews; // 0xd0
	TArray<UDynamicMeshReplacementChangeTarget*> MeshesToCut; // 0xe0
	UTransformGizmo* PlaneTransformGizmo; // 0x158
	UTransformProxy* PlaneTransformProxy; // 0x160
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct APrecomputedVisibilityOverrideVolume : AVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x258
	TArray<AActor*> OverrideInvisibleActors; // 0x268
	TArray<FName> OverrideInvisibleLevels; // 0x278
};

struct UGameEventScoreboardWidget : UDesignableUserWidget {
	UGameEventRoundInfoWidget* RoundInfoWidgetClass; // 0x278
	UGameEventTeamHeaderWidget* TeamHeaderWidgetClass; // 0x280
	UGameEventParticipantStatsWidget* StatWidgetClass; // 0x288
	TArray<UGameEventParticipantStatsWidget*> StatWidgets; // 0x290
	AGameEventBase* _gameEvent; // 0x2a0
	int32_t _selected; // 0x2a8
};

struct UMetabolismAdvancedProgressBar : UUserWidget {
	FText Title; // 0x260
	URetainerBox* _progressBarEffect; // 0x278
	UTextBlock* _titleText; // 0x280
	UTextBlock* _valueText; // 0x288
	USizeBox* _apbSize; // 0x290
	UImage* _progressBarBackground; // 0x298
	FText _defaultValue; // 0x2a0
	FMetabolismAPBFontStyle _fontStyle; // 0x2b8
	FMargin _progressBarPadding; // 0x2e8
	FVector2D _size; // 0x2f8
	FSlateBrush _backgroundImageBrush; // 0x300
	FDataTableRowHandle _normalBackgroundColor; // 0x388
	FDataTableRowHandle _normalForegroundColor; // 0x398
	FDataTableRowHandle _normalTextColorEmpty; // 0x3a8
	FDataTableRowHandle _normalTextColorFilled; // 0x3b8
	FDataTableRowHandle _alertedBackgroundColor; // 0x3c8
	FDataTableRowHandle _alertedForegroundColor; // 0x3d8
	FDataTableRowHandle _alertedTextColorEmpty; // 0x3e8
	FDataTableRowHandle _alertedTextColorFilled; // 0x3f8
	FDataTableRowHandle _badBackgroundColor; // 0x408
	FDataTableRowHandle _badForegroundColor; // 0x418
	FDataTableRowHandle _badTextColorEmpty; // 0x428
	FDataTableRowHandle _badTextColorFilled; // 0x438
	FDataTableRowHandle _goodBackgroundColor; // 0x448
	FDataTableRowHandle _goodForegroundColor; // 0x458
	FDataTableRowHandle _goodTextColorEmpty; // 0x468
	FDataTableRowHandle _goodTextColorFilled; // 0x478
};

struct UMagicLeapSettings : UObject {
	bool bEnableZI; // 0x28
	bool bUseVulkanForZI; // 0x29
	bool bUseMLAudioForZI; // 0x2a
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct APlayerController : AController {
	UPlayer* Player; // 0x298
	APawn* AcknowledgedPawn; // 0x2a0
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2a8
	AHUD* MyHUD; // 0x2b0
	APlayerCameraManager* PlayerCameraManager; // 0x2b8
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2c0
	bool bAutoManageActiveCameraTarget; // 0x2c8
	FRotator TargetViewRotation; // 0x2cc
	float SmoothTargetViewRotationSpeed; // 0x2e4
	TArray<AActor*> HiddenActors; // 0x2f0
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x300
	float LastSpectatorStateSynchTime; // 0x314
	FVector LastSpectatorSyncLocation; // 0x318
	FRotator LastSpectatorSyncRotation; // 0x324
	int32_t ClientCap; // 0x330
	UCheatManager* CheatManager; // 0x338
	UCheatManager* CheatClass; // 0x340
	UPlayerInput* PlayerInput; // 0x348
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x350
	char bPlayerIsWaiting : 1; // 0x3d0
	char NetPlayerIndex; // 0x3d4
	UNetConnection* PendingSwapConnection; // 0x410
	UNetConnection* NetConnection; // 0x418
	float InputYawScale; // 0x42c
	float InputPitchScale; // 0x430
	float InputRollScale; // 0x434
	char bShowMouseCursor : 1; // 0x438
	char bEnableClickEvents : 1; // 0x438
	char bEnableTouchEvents : 1; // 0x438
	char bEnableMouseOverEvents : 1; // 0x438
	char bEnableTouchOverEvents : 1; // 0x438
	char bForceFeedbackEnabled : 1; // 0x438
	float ForceFeedbackScale; // 0x43c
	TArray<FKey> ClickEventKeys; // 0x440
	EMouseCursor DefaultMouseCursor; // 0x450
	EMouseCursor CurrentMouseCursor; // 0x451
	ECollisionChannel DefaultClickTraceChannel; // 0x452
	ECollisionChannel CurrentClickTraceChannel; // 0x453
	float HitResultTraceDistance; // 0x454
	uint16_t SeamlessTravelCount; // 0x458
	uint16_t LastCompletedSeamlessTravelCount; // 0x45a
	UInputComponent* InactiveStateInputComponent; // 0x4d0
	char bShouldPerformFullTickWhenPaused : 1; // 0x4d8
	UTouchInterface* CurrentTouchInterface; // 0x4f0
	ASpectatorPawn* SpectatorPawn; // 0x548
	bool bIsLocalPlayerController; // 0x554
	FVector SpawnLocation; // 0x558
};

struct UAnimNotify_WaterPaddle : UAnimNotify {
	UParticleSystem* ParticleSystem; // 0x38
	UAkAudioEvent* AudioEvent; // 0x40
	float VolumeMultiplier; // 0x48
	float PitchMultiplier; // 0x4c
	bool IsUnderwater; // 0x50
	bool IsAttached; // 0x51
	FName AttachPointName; // 0x54
	bool DebugMode; // 0x5c
};

struct UNameableItemComponent : UItemComponent {
	FString _name; // 0xd8
	TWeakObjectPtr<UItemStatusWidget> _nameWidget; // 0xe8
	TWeakObjectPtr<UChangeTextWidget> _editNameWidget; // 0xf0
};

struct ABird2AIController : AAIController {
	float FlyDurationMin; // 0x328
	float FlyDurationMax; // 0x32c
	float RemainOnGroundDurationMin; // 0x330
	float RemainOnGroundDurationMax; // 0x334
	float TurnSpeed; // 0x338
	float FlightSegmentDistance; // 0x33c
	float LandingDistance; // 0x340
};

struct AConZBase : AActor {
	TWeakObjectPtr<AConZBaseElement> _baseElementActor; // 0x220
	bool _overrideBlockStackingRules; // 0x2c0
	float _debugRenderingDistance; // 0x2c4
	int32_t _decayProcessingNumberOfFrames; // 0x2c8
	int32_t _decayProcessingMaxDestroyedElementsPerUpdate; // 0x2cc
};

struct UMaterialExpressionShadowReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Shadow; // 0x54
};

struct UAREnvironmentCaptureProbe : UARTrackedGeometry {
	FVector Extent; // 0xf8
	UAREnvironmentCaptureProbeTexture* EnvironmentCaptureTexture; // 0x108
};

struct UInventoryPanelSideLayerWidget : UDesignableUserWidget {
	UItemWidget2* _itemWidget; // 0x278
};

struct UMaterialExpressionVectorNoise : UMaterialExpression {
	FExpressionInput position; // 0x40
	EVectorNoiseFunction NoiseFunction; // 0x54
	int32_t Quality; // 0x58
	char bTiling : 1; // 0x5c
	uint32_t TileSize; // 0x60
};

struct UAndroidPermissionCallbackProxy : UObject {
	FMulticastInlineDelegate OnPermissionsGrantedDynamicDelegate; // 0x28
};

struct UAsyncActionChangePrimaryAssetBundles : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate completed; // 0x78
};

struct UBasicPrisonerBodySymptomNotifier : UPrisonerBodySymptomNotifier {
	FFloatInterval _triggerDelay; // 0x30
	bool _shouldDisplayNotificationOnChangeForWorse; // 0x38
	bool _shouldResetNotificationTimerOnSeverityChange; // 0x39
	TArray<FBasicPrisonerBodySymptomNotificationParameters> _notificationParameters; // 0x40
};

struct UTestMovieSceneTrack : UMovieSceneTrack {
	bool bHighPassFilter; // 0x80
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct UOceanGenerator : UWaterBodyGenerator {
	TArray<UOceanBoxCollisionComponent*> CollisionBoxes; // 0x28
	TArray<UOceanCollisionComponent*> CollisionHullSets; // 0x38
};

struct URewardItemWidget : UUserWidget {
	UImage* _bulletImage; // 0x260
	UTextBlock* _rewardItemText; // 0x268
};

struct AWeaponAttachmentScope : AWeaponAttachmentSight {
	FVector ScopeViewOffset; // 0x7f8
	UMaterialInterface* ScopeLensPostProcess; // 0x808
	FName LensZoomParameterName; // 0x810
	bool FrontFocalPlane; // 0x818
	bool HasCrosshairParallax; // 0x819
	UStaticMesh* ScopeViewMesh; // 0x820
	UStaticMesh* ScopeViewLensMesh; // 0x828
	bool _canToggleDownTheSightsMode; // 0x830
	UTextureRenderTarget2D* TextRenderTarget; // 0x838
	UWeaponScopeWidget* WeaponScopeWidget; // 0x840
	FName GlassCenterSocketName; // 0x848
	int32_t WindageInitialOffset; // 0x850
	UAkAudioEvent* WindageClickAudioEvent; // 0x858
	UScopeableItemComponent* _scopableItemComponent; // 0x860
	UStaticMeshComponent* _scopeViewMesh; // 0x868
	UStaticMeshComponent* _scopeViewLensMesh; // 0x870
	float _fakeGlassMinOpacity; // 0x878
	float _displayBrightnessMultiplier; // 0x8ec
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
	FMulticastInlineDelegate OnPawnControllerChangedDelegates; // 0x78
};

struct UMovieSceneCompiledData : UObject {
	FMovieSceneEvaluationTemplate EvaluationTemplate; // 0x28
	FMovieSceneSequenceHierarchy Hierarchy; // 0x188
	FMovieSceneEntityComponentField EntityComponentField; // 0x2a0
	FMovieSceneEvaluationField TrackTemplateField; // 0x390
	TArray<FFrameTime> DeterminismFences; // 0x3c0
	FGuid CompiledSignature; // 0x3d0
	FGuid CompilerVersion; // 0x3e0
	FMovieSceneSequenceCompilerMaskStruct AccumulatedMask; // 0x3f0
	FMovieSceneSequenceCompilerMaskStruct AllocatedMask; // 0x3f1
	EMovieSceneSequenceFlags AccumulatedFlags; // 0x3f2
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x30
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x38
};

struct AFishingZoneIndicator : AActor {
	USceneComponent* _sceneComponent; // 0x220
	UParticleSystemComponent* _fishIconParticles; // 0x228
	UParticleSystemComponent* _rippleParticles; // 0x230
	float _radius; // 0x238
	UFishSpawningPreset* _fishSpawningPreset; // 0x240
};

struct UGameViewportClient : UScriptViewportClient {
	UConsole* ViewportConsole; // 0x40
	TArray<FDebugDisplayProperty> DebugProperties; // 0x48
	int32_t MaxSplitscreenPlayers; // 0x68
	UWorld* World; // 0x78
	UGameInstance* GameInstance; // 0x80
};

struct AUseItemObjective : AObjective {
	TMap<TSoftObjectPtr<AActor>, FUsableObjectiveItem> _targetMeshes; // 0x320
};

struct UWaterMeshComponent : UMeshComponent {
	int32_t ForceCollapseDensityLevel; // 0x470
	float TileSize; // 0x474
	FIntPoint ExtentInTiles; // 0x478
	UMaterialInterface* FarDistanceMaterial; // 0x480
	float FarDistanceMeshExtent; // 0x488
	FVector RTWorldLocation; // 0x48c
	FVector RTWorldSizeVector; // 0x498
	int32_t TessellationFactor; // 0x588
	float LODScale; // 0x58c
};

struct APlayerCameraManager : AActor {
	APlayerController* PCOwner; // 0x220
	USceneComponent* TransformComponent; // 0x228
	float DefaultFOV; // 0x238
	float DefaultOrthoWidth; // 0x240
	float DefaultAspectRatio; // 0x248
	FCameraCacheEntry CameraCache; // 0x290
	FCameraCacheEntry LastFrameCameraCache; // 0x880
	FTViewTarget ViewTarget; // 0xe70
	FTViewTarget PendingViewTarget; // 0x1470
	FCameraCacheEntry CameraCachePrivate; // 0x1aa0
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x2090
	TArray<UCameraModifier*> ModifierList; // 0x2680
	TArray<UCameraModifier*> DefaultModifiers; // 0x2690
	float FreeCamDistance; // 0x26a0
	FVector FreeCamOffset; // 0x26a4
	FVector ViewTargetOffset; // 0x26b0
	FMulticastInlineDelegate OnAudioFadeChangeEvent; // 0x26c0
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x26e0
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x26f0
	UCameraAnimInst* AnimInstPool[0x8]; // 0x26f8
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2738
	TArray<UCameraAnimInst*> ActiveAnims; // 0x2758
	TArray<UCameraAnimInst*> FreeAnims; // 0x2768
	ACameraActor* AnimCameraActor; // 0x2778
	char bIsOrthographic : 1; // 0x2780
	char bDefaultConstrainAspectRatio : 1; // 0x2780
	char bClientSimulatingViewTarget : 1; // 0x2780
	char bUseClientSideCameraUpdates : 1; // 0x2780
	char bGameCameraCutThisFrame : 1; // 0x2781
	float ViewPitchMin; // 0x2784
	float ViewPitchMax; // 0x2788
	float ViewYawMin; // 0x278c
	float ViewYawMax; // 0x2790
	float ViewRollMin; // 0x2794
	float ViewRollMax; // 0x2798
	float ServerUpdateCameraTimeout; // 0x27a0
};

struct ARadialForceActor : ARigidBodyBase {
	URadialForceComponent* ForceComponent; // 0x220
};

struct ALandscapeMeshProxyActor : AActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x220
};

struct UMaterialExpressionStep : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct UMRMeshComponent : UPrimitiveComponent {
	UMaterialInterface* Material; // 0x458
	UMaterialInterface* WireframeMaterial; // 0x460
	bool bCreateMeshProxySections; // 0x468
	bool bUpdateNavMeshOnMeshUpdate; // 0x469
	bool bNeverCreateCollisionMesh; // 0x46a
	UBodySetup* CachedBodySetup; // 0x470
	TArray<UBodySetup*> BodySetups; // 0x478
};

struct UConZBoatComboMountSlot : UConZBoatDriverMountSlot {
	UBlendSpace* _idleAnimation; // 0x168
	FName _passengerSocketName; // 0x170
	UVehicleWeaponAimingParameters* _vehiclePassengerWeaponAimingParameters; // 0x178
};

struct USubmixEffectReverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbSettings Settings; // 0xd0
};

struct UMeshSelectionSet : USelectionSet {
	TArray<int32_t> Vertices; // 0x40
	TArray<int32_t> Edges; // 0x50
	TArray<int32_t> Faces; // 0x60
	TArray<int32_t> Groups; // 0x70
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x220
	UPrimitiveComponent* TranslateY; // 0x228
	UPrimitiveComponent* TranslateZ; // 0x230
	UPrimitiveComponent* TranslateYZ; // 0x238
	UPrimitiveComponent* TranslateXZ; // 0x240
	UPrimitiveComponent* TranslateXY; // 0x248
	UPrimitiveComponent* RotateX; // 0x250
	UPrimitiveComponent* RotateY; // 0x258
	UPrimitiveComponent* RotateZ; // 0x260
	UPrimitiveComponent* UniformScale; // 0x268
	UPrimitiveComponent* AxisScaleX; // 0x270
	UPrimitiveComponent* AxisScaleY; // 0x278
	UPrimitiveComponent* AxisScaleZ; // 0x280
	UPrimitiveComponent* PlaneScaleYZ; // 0x288
	UPrimitiveComponent* PlaneScaleXZ; // 0x290
	UPrimitiveComponent* PlaneScaleXY; // 0x298
};

struct UAdminCommand : UObject {
	FString _verb; // 0x28
	TArray<FAdminCommandArgumentDescription> _argumentDescriptions; // 0x38
	int32_t _numberOfRequiredArguments; // 0x48
	bool _isEnabled; // 0x4c
	bool _isEnabledInShippingBuild; // 0x4d
	bool _isAdminStatusRequired; // 0x4e
	bool _isDeveloperStatusRequired; // 0x4f
	bool _shouldExecuteOnServer; // 0x50
	bool _shouldExecuteOnClient; // 0x51
	bool _shouldDisableSingleplayerAchievementsIfExecuted; // 0x52
	FString _description; // 0x58
};

struct AFishSchoolActor : AActor {
	EFishBehavior _currentState; // 0x220
	UCapsuleComponent* _capsuleComponent; // 0x250
	UFishInstancedStaticMeshComponent* _schoolInstancedStaticMeshComponent; // 0x258
	float _minDistanceToTarget; // 0x28c
	float _boundsInflation; // 0x290
	float _findPathBypassMultiplier; // 0x294
	int32_t _maxTimesSameDestinationAllowed; // 0x298
	float _maxTimePerDestinationMultiplier; // 0x29c
	float _schoolMovementRecoveryTurningSpeed; // 0x2a4
	float _schoolMovementRecoveryAcceleration; // 0x2a8
	float _schoolMovementRecoveryDeceleration; // 0x2ac
	float _schoolCloseToSurfaceTurningSpeed; // 0x2b0
	float _schoolCloseToSurfaceAcceleration; // 0x2b4
	float _schoolCloseToSurfaceDeceleration; // 0x2b8
	float _surfaceOffset; // 0x2bc
	float _upperForbiddenZoneDepthPercentage; // 0x2c0
	float _swimmingDepthPercentage; // 0x2c4
	float _lowerForbiddenZoneDepthPercentage; // 0x2c8
	UParticleSystem* _waterParticles; // 0x2d0
	float _waterParticlesInterval; // 0x2d8
	UParticleSystemComponent* _waterParticlesComponent; // 0x2e0
	int32_t _forcedNumberOfGroups; // 0x2ec
	float _groupSpeed; // 0x2f0
	float _groupSeparationSpeed; // 0x2f4
	float _groupCatchUpSpeed; // 0x2f8
	float _groupSeparationDistance; // 0x2fc
	float _groupSeparationTime; // 0x304
	int32_t _minNumberOfFish; // 0x308
	int32_t _maxNumberOfFish; // 0x30c
	float _maxFishDistance; // 0x314
	float _fishSeparationDistance; // 0x31c
	float _fishSeparationTime; // 0x320
	float _fishTurnSpeedRangeModifier; // 0x328
	float _fishMinScale; // 0x32c
	float _fishMaxScale; // 0x330
	float _fishNormalSpeed; // 0x334
	float _fishSeparationSpeed; // 0x338
	float _fishCatchUpSpeed; // 0x33c
	float _fishMaxSpeed; // 0x340
	float _fishAcceleration; // 0x344
	float _fishDeceleration; // 0x348
	FVector _moveToLocationRep; // 0x398
	TMap<EFishBehavior, FFishStateParameters> _behaviorMap; // 0x3b0
	FVector _randomMovementExtent; // 0x400
	float _fleeingDistanceFromEnemy; // 0x40c
	float _fleeingPathLength; // 0x410
	float _returnToNormalBehaviorDistance; // 0x414
	float _schoolInternalMovementRelevancyDistanceSquared; // 0x418
	float _fadeInTime; // 0x42c
	float _fadeOutTime; // 0x434
};

struct AKillBoxC4SpawnPoint : AActor {
	TArray<AItem*> _possibleSpawnClasses; // 0x220
};

struct UMetabolismNutritionPanel : UUserWidget {
	UMetabolismRadialProgressBar* _rpb_Calories; // 0x260
	UMetabolismRadialProgressBar* _rpb_Water; // 0x268
};

struct USedentaryNPCBackgroundInteraction : UObject {
	EBackgroundInteractionType _backgroundInteractionType; // 0x28
	bool _canEverTick; // 0x29
	FFloatRange _newBackgroundInteractionInterval; // 0x2c
	TArray<UAnimMontage*> _animationVariationsBegin; // 0x48
	TArray<UAnimMontage*> _animationVariationsTick; // 0x58
	TArray<UAnimMontage*> _animationVariationsEnd; // 0x68
	TArray<UAnimMontage*> _animationVariationsOneShot; // 0x78
	TArray<UAkAudioEvent*> _soundVariationsBegin; // 0x88
	TArray<UAkAudioEvent*> _soundVariationsTick; // 0x98
	TArray<UAkAudioEvent*> _soundVariationsEnd; // 0xa8
	TArray<UAkAudioEvent*> _soundVariationsOneShot; // 0xb8
};

struct A1H_Little_Spade_C : AWeaponItem {
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsule1; // 0x7f0
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsule; // 0x7f8
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate completed; // 0x78
};

struct UUI_Objective_C : UObjectivesWidget {
	UImage* _icon; // 0x2c0
};

struct ABP_WeaponBullet_ExplosiveArrow_Metal_C : AProjectileExplosiveArrow {
	UParticleSystemComponent* P_ArrowTrail; // 0x458
};

struct UUI_LockpickingMinigame_C : ULockpickingWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UWidgetAnimation* ShowFailure; // 0x2c0
	UWidgetAnimation* BlurWaitingForPlayer; // 0x2c8
	UWidgetAnimation* ShowSuccess; // 0x2d0
	UWidgetAnimation* InfoFade; // 0x2d8
	UImage* _infiniteLockpicks; // 0x2e0
	UImage* _infiniteScrewdrivers; // 0x2e8
	UImage* _lockDifficultyHardImage; // 0x2f0
	UImage* _lockDifficultyMediumImage; // 0x2f8
	UImage* _lockDifficultyNormalImage; // 0x300
	UImage* _lockDifficultyWarning; // 0x308
	UImage* BlackOverlay; // 0x310
	UTextBlock* FamePointsText; // 0x318
	UImage* Image_1; // 0x320
	UImage* Image_2; // 0x328
	UImage* Image_3; // 0x330
	UImage* Image_11; // 0x338
	UImage* Image_21; // 0x340
	UTextBlock* LockpicksCountText; // 0x348
	UImage* progress; // 0x350
	UTextBlock* RemainingTimeText; // 0x358
	UTextBlock* TensionToolCountText; // 0x360
	UImage* TextBackground; // 0x368
	UTextBlock* TextBlock_1; // 0x370
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct UUdpMessagingSettings : UObject {
	bool EnabledByDefault; // 0x28
	bool EnableTransport; // 0x29
	bool bAutoRepair; // 0x2a
	bool bStopServiceWhenAppDeactivates; // 0x2b
	FString UnicastEndpoint; // 0x30
	FString MulticastEndpoint; // 0x40
	EUdpMessageFormat MessageFormat; // 0x50
	char MulticastTimeToLive; // 0x51
	TArray<FString> StaticEndpoints; // 0x58
	bool EnableTunnel; // 0x68
	FString TunnelUnicastEndpoint; // 0x70
	FString TunnelMulticastEndpoint; // 0x80
	TArray<FString> RemoteTunnelEndpoints; // 0x90
};

struct UGroomComponent : UMeshComponent {
	UGroomAsset* GroomAsset; // 0x478
	TArray<UNiagaraComponent*> NiagaraComponents; // 0x480
	USkeletalMesh* SourceSkeletalMesh; // 0x490
	UGroomBindingAsset* BindingAsset; // 0x498
	UPhysicsAsset* PhysicsAsset; // 0x4a0
	UMaterialInterface* Strands_DebugMaterial; // 0x4a8
	UMaterialInterface* Strands_DefaultMaterial; // 0x4b0
	UMaterialInterface* Cards_DefaultMaterial; // 0x4b8
	UMaterialInterface* Meshes_DefaultMaterial; // 0x4c0
	UNiagaraSystem* AngularSpringsSystem; // 0x4c8
	UNiagaraSystem* CosseratRodsSystem; // 0x4d0
	FString AttachmentName; // 0x4d8
	TArray<FHairGroupDesc> GroomGroupsDesc; // 0x530
};

struct UMinimizableWidget_C : UWindowsContent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	UWidgetAnimation* HeaderImageAnimation; // 0x2c0
	UBorder* Border_2; // 0x2c8
	UImage* HeaderImage; // 0x2d0
	UImage* MaximizeImage; // 0x2d8
	UImage* MinimizeImage; // 0x2e0
	UNamedSlot* NamedSlotContent; // 0x2e8
	UTextBlock* TitleTextBlock; // 0x2f0
	FMulticastInlineDelegate WidgetSizeChangedEventDispatcher; // 0x2f8
	bool isAlarmOn; // 0x308
	FMulticastInlineDelegate NotifyAlarmSwitchedOnEventDispatcher; // 0x310
	FMulticastInlineDelegate NotifyAlarmSwitchedOffEventDispatcher; // 0x320
	FVector2D _minimizableWidgetSize; // 0x330
	FMulticastInlineDelegate NotifyMinimizableWidgetSizeChangedEventDispatcher; // 0x338
	bool _shouldRefreshSize; // 0x348
	bool isMinimized; // 0x349
};

struct AWeatherAmbientSounds : AActor {
	float WeatherRTPCsUpdateInterval; // 0x220
	float TimeOfDayRTPCUpdateInterval; // 0x224
	float TimeOfDayRTPCInterpolationSpeed; // 0x228
	UAkAudioEvent* RainAudioEvent; // 0x230
	UAkAudioEvent* WindAudioEvent; // 0x238
};

struct UMovieSceneCameraAnimSection : UMovieSceneSection {
	FMovieSceneCameraAnimSectionData AnimData; // 0xe8
	UCameraAnim* CameraAnim; // 0x108
	float PlayRate; // 0x110
	float PlayScale; // 0x114
	float BlendInTime; // 0x118
	float BlendOutTime; // 0x11c
	bool bLooping; // 0x120
};

struct UUI_TabModeSwitcher_C : UTabModeSwitcherWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UImage* Arc1; // 0x288
	UImage* Arc2; // 0x290
	UImage* Arc3; // 0x298
	UImage* Center; // 0x2a0
	UTextBlock* ModeText; // 0x2a8
	int32_t _hoveredArcIndex; // 0x2b0
	ETabMode _selectedTabMode; // 0x2b4
};

struct UNiagaraDataInterfaceVolumeTexture : UNiagaraDataInterface {
	UVolumeTexture* Texture; // 0x38
};

struct UVectorFieldComponent : UPrimitiveComponent {
	UVectorField* VectorField; // 0x448
	float Intensity; // 0x450
	float Tightness; // 0x454
	char bPreviewVectorField : 1; // 0x458
};

struct UFortificationComponent : UStaticMeshComponent {
	UParticleSystem* _destructionParticles; // 0x4e0
	UAkAudioEvent* _destructionAudio; // 0x4e8
	ABuilding* _parentBuilding; // 0x4f0
	int32_t _markerIndex; // 0x4f8
	float _health; // 0x4fc
	float _collisionEnergyResistance; // 0x500
	float _explosionResistance; // 0x504
	float _hardness; // 0x508
};

struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	FGameplayTag InjectionTag; // 0x70
	UBehaviorTree* DefaultBehaviorAsset; // 0x78
	UBehaviorTree* BehaviorAsset; // 0x80
};

struct AConZCameraManager : APlayerCameraManager {
	float _introCinematicDuration; // 0x27cc
};

struct UUI_WaypointWidget_C : UWaypointWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x310
	UImage* Accent; // 0x318
	UImage* Background; // 0x320
	UImage* Bar; // 0x328
	UImage* BarBG; // 0x330
	UImage* BigPointer; // 0x338
	UTextBlock* Distance; // 0x340
	UImage* Emphasis; // 0x348
	UImage* Icon; // 0x350
	UTextBlock* Label; // 0x358
	UImage* SmallPointer; // 0x360
};

struct ADeathmatchGameEvent : AGameEventBase {
	FDeathmatchParameters _deathmatchParameters; // 0x598
};

struct APracticeLockpickingItem : AItem {
	TArray<FLockData> _possibleLocks; // 0x7c8
};

struct UForceFeedbackAttenuation : UObject {
	FForceFeedbackAttenuationSettings Attenuation; // 0x28
};

struct UPrisonerUIDataController : UObject {
	UPrisonerBodySimulationUIController* BodySimulationUIController; // 0x28
	UPrisonerSkillComponentUIController* SkillComponentUIController; // 0x30
	UPrisonerTreatmentUIController* TreatmentUIController; // 0x38
	UPrisonerUIData* _prisonerUIData; // 0x58
	UPrisonerUITooltipCache* _tooltipCache; // 0x60
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct ADropZoneKey : AItem {
	USphereComponent* SphereComponent; // 0x7c0
	ADropZoneGameEvent* _gameEvent; // 0x7c8
};

struct ACameraRig_Rail : AActor {
	float CurrentPositionOnRail; // 0x220
	bool bLockOrientationToRail; // 0x224
	USceneComponent* TransformComponent; // 0x228
	USplineComponent* RailSplineComponent; // 0x230
	USceneComponent* RailCameraMount; // 0x238
};

struct ACTFGameEvent : AGameEventBase {
	ACTFFlag* FlagClass; // 0x598
	ACTFBase* CaptureBaseClass; // 0x5a0
	ACTFFlagStand* FlagStandClass; // 0x5a8
	UTexture2D* FlagIconTexture; // 0x5b0
	UTexture2D* FlagAccentTexture; // 0x5b8
	UTexture2D* BaseIconTexture; // 0x5c0
	UTexture2D* BaseAccentTexture; // 0x5c8
	UTexture2D* EmptyBaseIconTexture; // 0x5d0
	UTexture2D* EmptyBaseAccentTexture; // 0x5d8
	FLinearColor TeamColorA; // 0x5e0
	FLinearColor TeamColorB; // 0x5f0
	UAkAudioEvent* BlueTeamPickedUpFlagAnnouncement; // 0x600
	UAkAudioEvent* BlueTeamCapturedFlagAnnouncement; // 0x608
	UAkAudioEvent* BlueTeamFlagDroppedAnnouncement; // 0x610
	UAkAudioEvent* BlueTeamFlagReturnedAnnouncement; // 0x618
	UAkAudioEvent* RedTeamPickedUpFlagAnnouncement; // 0x620
	UAkAudioEvent* RedTeamCapturedFlagAnnouncement; // 0x628
	UAkAudioEvent* RedTeamFlagDroppedAnnouncement; // 0x630
	UAkAudioEvent* RedTeamFlagReturnedAnnouncement; // 0x638
	FCTFParameters _CTFParameters; // 0x640
	ACTFFlag* _flagA; // 0x670
	ACTFFlag* _flagB; // 0x678
	ACTFBase* _baseA; // 0x680
	ACTFBase* _baseB; // 0x688
};

struct UDemolitionSkill : UDexteritySkill {
	FDemolitionSkillParametersPerSkillLevel NoSkillParameters; // 0xa8
	FDemolitionSkillParametersPerSkillLevel BasicSkillParameters; // 0x120
	FDemolitionSkillParametersPerSkillLevel MediumSkillParameters; // 0x198
	FDemolitionSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x210
	FDemolitionSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x288
};

struct UPrisonerBodyCondition_BleedingInjury : UPrisonerBodyCondition_Injury {
	FRuntimeFloatCurve _selfStabilizationDurationVsSeverity; // 0xa8
	FRuntimeFloatCurve _stabilizationDurationVsBloodLossRatio; // 0x130
	float _stabilizationDurationBiasVsSkillLevel[0x5]; // 0x1b8
	FRuntimeFloatCurve _destabilizationActionDifficultyRatioVsSeverity; // 0x1d0
	UNotificationDescription* _destabilizationNotification; // 0x258
	float _destabilizationNotificationCooldown; // 0x260
	FRuntimeFloatCurve _recoveryDurationVsBloodLossRatio; // 0x268
	float _baseTreatmentDuration; // 0x2f0
	FFloatRange _treatmentDurationLimits; // 0x2f4
	float _stopBleedingBaseExperienceGainVsSkillLevel[0x5]; // 0x304
	UPrisonerBodySymptom_Bleeding* _bleedingSymptomClass; // 0x318
	UPrisonerBodySymptom_Pain* _painSymptomClass; // 0x320
	FRuntimeFloatCurve _painIntensityVsSeverity; // 0x328
	float _limpingIntensityPerLegsDamageRatio; // 0x3b0
	float _legsBleedingSeverityThresholdToLimp; // 0x3b4
	EPrisonerBodyMuscleGroup _bodyPart; // 0x3b8
	EPrisonerBodyMuscleGroup _muscleGroup; // 0x3b9
	float _damage; // 0x410
	float _damageToRecover; // 0x414
	float _bloodLoss; // 0x418
	float _bloodLossToRecover; // 0x41c
	float _bloodLossRate; // 0x420
	float _bloodLossRateUntreated; // 0x424
	float _treatmentProgress; // 0x428
	float _stabilizationDurationReductionByItems; // 0x42c
	ESkillLevel _physicianSkillLevel; // 0x430
	EPrisonerBodyConditionState _state; // 0x431
	float _timerElapsedTime; // 0x43c
	float _timerDuration; // 0x440
	UPrisonerBodySymptomCause_Bleeding* _bleedingSymptomCause; // 0x448
	UPrisonerBodySymptomCause_Pain* _painSymptomCause; // 0x450
};

struct UChatSuggestionWidget : UDesignableUserWidget {
	UBorder* _border; // 0x278
	UChatText* _textBlock; // 0x280
	FLinearColor _defaultColor; // 0x288
	FLinearColor _highlightedColor; // 0x298
};

struct UDisplaceMeshTextureMapProperties : UInteractiveToolPropertySet {
	UTexture2D* DisplacementMap; // 0x60
};

struct USoundBase : UObject {
	USoundClass* SoundClassObject; // 0x30
	char bDebug : 1; // 0x38
	char bOverrideConcurrency : 1; // 0x38
	char bOutputToBusOnly : 1; // 0x38
	char bHasDelayNode : 1; // 0x38
	char bHasConcatenatorNode : 1; // 0x38
	char bBypassVolumeScaleForPriority : 1; // 0x38
	EVirtualizationMode VirtualizationMode; // 0x39
	TSet<USoundConcurrency*> ConcurrencySet; // 0x90
	FSoundConcurrencySettings ConcurrencyOverrides; // 0xe0
	float Duration; // 0x108
	float MaxDistance; // 0x10c
	float TotalSamples; // 0x110
	float Priority; // 0x114
	USoundAttenuation* AttenuationSettings; // 0x118
	FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x120
	USoundSubmixBase* SoundSubmixObject; // 0x168
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x170
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x180
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x188
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x198
	TArray<UAssetUserData*> AssetUserData; // 0x1a8
};

struct AItemSpawnerGroup : AActor {
	UItemSpawnerComponent* SpawnerComponent; // 0x220
};

struct UToFloatField : UFieldNodeFloat {
	UFieldNodeInt* IntField; // 0xb0
};

struct UUI_Item2VicinityContainer_C : UVicinityContainerRowItemWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x448
	UImage* AmmoIcon; // 0x450
	UImage* BackgroundBorder; // 0x458
	UImage* BackgroundHighlight; // 0x460
	UImage* Image_1; // 0x468
	UImage* Image_3; // 0x470
	UImage* Image_10; // 0x478
	UTextBlock* LowerLeftTextFirst; // 0x480
	UTextBlock* LowerLeftTextSecond; // 0x488
	UTextBlock* LowerRightText; // 0x490
	UOverlay* Overlay_5; // 0x498
	UTextBlock* PlayerGivenName; // 0x4a0
	UProgressBar* ProgressBarDurability; // 0x4a8
	UProgressBar* ProgressBarLeftFirst; // 0x4b0
	UProgressBar* ProgressBarLeftSecond; // 0x4b8
	UProgressBar* ProgressBarUses; // 0x4c0
	USizeBox* SizeBox_1; // 0x4c8
	UTextBlock* TextBlock_1; // 0x4d0
	UTextBlock* TextBlock_2; // 0x4d8
	UTextBlock* TextBlock_21; // 0x4e0
	UUI_Border_C* UI_Border; // 0x4e8
	UUI_Border_C* UI_Border_C_1; // 0x4f0
	UImage* UpperLeftIcon; // 0x4f8
	UTextBlock* UpperLeftText; // 0x500
	UTextBlock* UpperRightText; // 0x508
};

struct UAkItemProperties : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnPropertyDragged; // 0x118
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	TArray<FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo; // 0x368
	char bIsLayerThumbnail : 1; // 0x378
	char bDisableTessellation : 1; // 0x378
	char bMobile : 1; // 0x378
	char bEditorToolUsage : 1; // 0x378
};

struct UInterpTrackInstFloatParticleParam : UInterpTrackInst {
	float ResetFloat; // 0x28
};

struct UUMGSequenceTickManager : UObject {
	TSet<TWeakObjectPtr<UUserWidget>> WeakUserWidgets; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x78
};

struct UTrashMenuButton : UDesignableUserWidget {
	UButton* MainButton; // 0x278
};

struct UMatineeCameraShake : UCameraShakeBase {
	float OscillationDuration; // 0x98
	float OscillationBlendInTime; // 0x9c
	float OscillationBlendOutTime; // 0xa0
	FROscillator RotOscillation; // 0xa4
	FVOscillator LocOscillation; // 0xc8
	FFOscillator FOVOscillation; // 0xec
	float AnimPlayRate; // 0xf8
	float AnimScale; // 0xfc
	float AnimBlendInTime; // 0x100
	float AnimBlendOutTime; // 0x104
	float RandomAnimSegmentDuration; // 0x108
	UCameraAnim* Anim; // 0x110
	char bRandomAnimSegment : 1; // 0x118
	float OscillatorTimeRemaining; // 0x11c
	UCameraAnimInst* AnimInst; // 0x120
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UClothConfigNv : UClothConfigCommon {
	EClothingWindMethodNv ClothingWindMethod; // 0x28
	FClothConstraintSetupNv VerticalConstraint; // 0x2c
	FClothConstraintSetupNv HorizontalConstraint; // 0x3c
	FClothConstraintSetupNv BendConstraint; // 0x4c
	FClothConstraintSetupNv ShearConstraint; // 0x5c
	float SelfCollisionRadius; // 0x6c
	float SelfCollisionStiffness; // 0x70
	float SelfCollisionCullScale; // 0x74
	FVector Damping; // 0x78
	float Friction; // 0x84
	float WindDragCoefficient; // 0x88
	float WindLiftCoefficient; // 0x8c
	float WindIntensityScale; // 0x90
	FVector LinearDrag; // 0x94
	FVector AngularDrag; // 0xa0
	FVector LinearInertiaScale; // 0xac
	FVector AngularInertiaScale; // 0xb8
	FVector CentrifugalInertiaScale; // 0xc4
	float SolverFrequency; // 0xd0
	float StiffnessFrequency; // 0xd4
	float GravityScale; // 0xd8
	FVector GravityOverride; // 0xdc
	bool bUseGravityOverride; // 0xe8
	float TetherStiffness; // 0xec
	float TetherLimit; // 0xf0
	float CollisionThickness; // 0xf4
	float AnimDriveSpringStiffness; // 0xf8
	float AnimDriveDamperStiffness; // 0xfc
	EClothingWindMethod_Legacy WindMethod; // 0x100
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x104
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x114
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x124
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x134
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UMissionRewardWidget : UUserWidget {
	UImage* _rewardImage; // 0x260
	UTextBlock* _rewardAmount; // 0x268
};

struct UHudWidget : UDesignableUserWidget {
	UQuickAccessBarWidget* _quickAccessBar; // 0x278
	UThrowingQuickAccessItemWidget* _throwingAccess; // 0x280
	UQuickAccessItemWidget* _handQuickAccessItemWidget; // 0x288
	UVicinityPanel3* _vicinityPanel; // 0x290
	UVicinityContainer3* _vicinityContainer; // 0x298
	UChatWidget* _chatWidget; // 0x2a0
	bool _chatOpen; // 0x2a8
	UObjectivesContainerWidget* _objectivesContainer; // 0x2c8
	UMissionResult* _missionResultWidget; // 0x2d0
	UDialogueContainerWidget* _dialogueContainerWidget; // 0x2d8
	UJournalPanelWidget* _journalPanelWidget; // 0x2e0
	USquadPanelWidget* _squadPanelWidget; // 0x2e8
	UHandPanel3* _handPanel; // 0x2f0
	UScreenSpaceHealthWidget* _screenSpaceHealthWidget; // 0x2f8
	UResourceIndicatorWidget* _nightVisionGogglesBatteryWidget; // 0x300
	UShotsFiredTrackerWidget* _shotsFiredTrackerWidget; // 0x308
	UFishingContainerWidget* _fishingContainerWidget; // 0x310
	UGrapplingWidget* _grapplingWidget; // 0x318
	UMusicPlayerDisplayWidget* _musicPlayerDisplayWidget; // 0x320
	UFishingTrophyWidget* _fishingTrophyWidget; // 0x328
	UMetabolismLeftPanel* _metabolismLeftPanel; // 0x330
	UMetabolismRightPanel* _metabolismRightPanel; // 0x338
	UMetabolismTreatmentItemsPanel* _metabolismTreatmentItemsPanel; // 0x340
	UVehicleHudWidget* _vehicleHUD; // 0x348
	UCanvasPanel* _chatCanvas; // 0x350
	UWidgetSwitcher* _masterSwitcher; // 0x358
	UMasterMenu* _masterMenu; // 0x360
	UPanelWidget* _masterHUD; // 0x368
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct UPrisonerBodySymptom_Thirst : UPrisonerBodySymptom {
	FRuntimeFloatCurve _severityVsHydrationRatio; // 0xb8
};

struct URadioComponent : UAkComponent {
	float _volume; // 0x3d8
	int32_t _currentStationIndex; // 0x3dc
	bool _isHiFi; // 0x3e4
	bool _isReachableFromSkyWhenMounted; // 0x3e5
	float _attenuationScale; // 0x3e8
	bool _turnedOn; // 0x3ec
};

struct ABP_MenuPlayerController_C : AMenuPlayerController {
	FPointerToUberGraphFrame UberGraphFrame; // 0x570
	APrisoner* Prisoner; // 0x578
	bool _isMouseDown; // 0x580
	float PrisonerRotationSpeed; // 0x584
};

struct UAnimNotify_WeaponEjectCasing : UAnimNotify {
	FName EmitterSocketName; // 0x38
	bool AttachEmitter; // 0x40
};

struct UVoxelBlendMeshesTool : UBaseVoxelTool {
	UVoxelBlendMeshesToolProperties* BlendProperties; // 0x108
};

struct UMotionTriggerComponent : UTriggerComponent {
	FVector TriggerForwardVector; // 0x4d0
	float TriggerAngle; // 0x4dc
	float MotionDetectionSensitivity; // 0x4e0
	float MotionDetectionDepletionSpeed; // 0x4e4
	float _motionDetector; // 0x4e8
	UAkAudioEvent* _motionDetectorStartSound; // 0x4f0
	UAkAudioEvent* _motionDetectorEndSound; // 0x4f8
};

struct UGameNetworkManagerSettings : UObject {
	int32_t MinDynamicBandwidth; // 0x28
	int32_t MaxDynamicBandwidth; // 0x2c
	int32_t TotalNetBandwidth; // 0x30
	int32_t BadPingThreshold; // 0x34
	char bIsStandbyCheckingEnabled : 1; // 0x38
	float StandbyRxCheatTime; // 0x3c
	float StandbyTxCheatTime; // 0x40
	float PercentMissingForRxStandby; // 0x44
	float PercentMissingForTxStandby; // 0x48
	float PercentForBadPing; // 0x4c
	float JoinInProgressStandbyWaitTime; // 0x50
};

struct ALightmassPortal : AActor {
	ULightmassPortalComponent* PortalComponent; // 0x220
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct ALockpickingMinigame : AMinigame {
	UStaticMeshComponent* _outerRing; // 0x2e0
	UStaticMeshComponent* _movableRing; // 0x2e8
	USceneComponent* _lockpickingSetAnchor; // 0x2f0
	USceneComponent* _lockpickManipulator; // 0x2f8
	USceneComponent* _lockpickAnchor; // 0x300
	UStaticMeshComponent* _lockpick; // 0x308
	USceneComponent* _tensionToolManipulator; // 0x310
	USceneComponent* _tensionToolAnchor; // 0x318
	UStaticMeshComponent* _tensionTool; // 0x320
	FVector _zoomStartLocation; // 0x328
	FVector _zoomEndLocation; // 0x334
	FTransform _protectionParticlesTransform; // 0x340
	UCurveFloat* _zoomCurve; // 0x370
	UCurveFloat* _fadeCurve; // 0x378
	float _pickBreakingMultiplierForMediumDifficulty; // 0x380
	float _pickBreakingMultiplierForHardDifficulty; // 0x384
	UAkAudioEvent* _lockpickingLockpickMovementStartAudioEvent; // 0x3b8
	UAkAudioEvent* _lockpickingLockpickMovementStopAudioEvent; // 0x3c0
	UAkAudioEvent* _lockpickingLockTensionStartAudioEvent; // 0x3c8
	UAkAudioEvent* _lockpickingLockTensionStopAudioEvent; // 0x3d0
	UAkAudioEvent* _lockpickingLockTurningStartAudioEvent; // 0x3d8
	UAkAudioEvent* _lockpickingLockTurningStopAudioEvent; // 0x3e0
	UAkAudioEvent* _lockpickingSuccessAudioEvent; // 0x3e8
	UAkAudioEvent* _lockpickingFailedAudioEvent; // 0x3f0
	UAkAudioEvent* _lockpickingResetAudioEvent; // 0x3f8
	float _rotatingStartAngle; // 0x404
	float _duration; // 0x408
	float _angleTolerance; // 0x40c
	float _pickBreakingMultiplier; // 0x410
};

struct AMission : AActor {
	AObjective* _activeObjective; // 0x2b0
	TArray<AObjective*> _missionObjectiveClasses; // 0x2b8
	TMap<FString, AObjective*> _missionObjectiveAssets; // 0x2c8
	TArray<AObjective*> _missionObjectives; // 0x318
	FText _missionName; // 0x328
	FText _missionCategory; // 0x340
	FText _missionDescription; // 0x358
	EMissionType _missionType; // 0x370
	int32_t _missionOrdinalNumber; // 0x374
	EMissionState _missionState; // 0x378
	EFaction _missionFaction; // 0x379
	TSoftObjectPtr<UWorld> _missionLevel; // 0x380
	FMissionReward _missionRewards; // 0x3a8
	UTexture2D* _missionBannerImage; // 0x3c0
	TArray<TSoftObjectPtr<ALocationTrigger>> _missionStartingLocations; // 0x3c8
	int32_t _intendedNumberOfPlayers; // 0x3d8
	float _missionCooldownTime; // 0x3dc
	AMissionItemSpawner* _missionItemSpawnerClass; // 0x3e8
	TArray<FDialogueInfo> _missionIntroDialogues; // 0x3f0
	TArray<FDialogueInfo> _missionOutroSuccessDialogues; // 0x400
	TArray<FDialogueInfo> _missionOutroFailDialogues; // 0x410
	TArray<FDialogueInfo> _missionOutroBelatedDialogues; // 0x420
	bool _canInterruptDialogue; // 0x430
};

struct AMissionManager : AActor {
	TMap<AMission*, FMissionData> _mainStoryMissions; // 0x240
	TMap<AMission*, FMissionData> _sideStoryMissions; // 0x290
	TMap<AMission*, FMissionData> _tutorialMissions; // 0x2e0
	bool _tutorialEnabled; // 0x34b
	float _tutorialDelay; // 0x34c
	AMission* _activeMainStoryMission; // 0x358
	AMission* _activeSideStoryMission; // 0x360
	AMission* _activeTutorialMission; // 0x368
	AMission* _availableMission; // 0x370
	EMissionManagerState _missionManagerState; // 0x378
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct ADatasmithImportedSequencesActor : AActor {
	TArray<ULevelSequence*> ImportedSequences; // 0x220
};

struct UThieverySkill : UDexteritySkill {
	UCurveFloat* _lockpickingDurationModifierCurve; // 0xa8
	UCurveFloat* _lockpickingStartAngleModifierCurve; // 0xb0
	UCurveFloat* _lockpickingAngleModifierCurve; // 0xb8
	UCurveFloat* _lockpickingDurabilityModifierCurve; // 0xc0
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x280
	UCharacterMovementComponent* CharacterMovement; // 0x288
	UCapsuleComponent* CapsuleComponent; // 0x290
	FBasedMovementInfo BasedMovement; // 0x298
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2c8
	float AnimRootMotionTranslationScale; // 0x2f8
	FVector BaseTranslationOffset; // 0x2fc
	FQuat BaseRotationOffset; // 0x310
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320
	float ReplayLastTransformUpdateTimeStamp; // 0x324
	char ReplicatedMovementMode; // 0x328
	bool bInBaseReplication; // 0x329
	float CrouchedEyeHeight; // 0x32c
	char bIsCrouched : 1; // 0x330
	uint32_t ReplicatedCrouchedStateAndCapsuleHalfHeight; // 0x334
	char bProxyIsJumpForceApplied : 1; // 0x338
	char bPressedJump : 1; // 0x338
	char bClientUpdating : 1; // 0x338
	char bClientWasFalling : 1; // 0x338
	char bClientResimulateRootMotion : 1; // 0x338
	char bClientResimulateRootMotionSources : 1; // 0x338
	char bSimGravityDisabled : 1; // 0x338
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x338
	char bServerMoveIgnoreRootMotion : 1; // 0x339
	char bWasJumping : 1; // 0x339
	float JumpKeyHoldTime; // 0x33c
	float JumpForceTimeRemaining; // 0x340
	float ProxyJumpForceStartedTime; // 0x344
	float JumpMaxHoldTime; // 0x348
	int32_t JumpMaxCount; // 0x34c
	int32_t JumpCurrentCount; // 0x350
	int32_t JumpCurrentCountPreJump; // 0x354
	FMulticastInlineDelegate OnReachedJumpApex; // 0x360
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x380
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x390
	FRootMotionSourceGroup SavedRootMotion; // 0x3a0
	FRootMotionMovementParams ClientRootMotionParams; // 0x3e0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x420
	FRepRootMotionMontage RepRootMotion; // 0x430
};

struct UModularTooltipElementData_AffectedBy : UModularTooltipElementData {
	UModularTooltipElementData* Affect; // 0x40
};

struct UAdminCommand_ListPrimaryAssets : UAdminCommand {
	FPrimaryAssetType _primaryAssetType; // 0x80
	TSet<FPrimaryAssetId> _primaryAssetsToExclude; // 0x88
};

struct UChildConnection : UNetConnection {
	UNetConnection* Parent; // 0x1af0
};

struct UPhysicsSettingsCore : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableShapeSharing; // 0x50
	bool bEnablePCM; // 0x51
	bool bEnableStabilization; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	bool bDefaultHasComplexCollision; // 0x55
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	float ContactOffsetMultiplier; // 0x68
	float MinContactOffset; // 0x6c
	float MaxContactOffset; // 0x70
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x74
	ECollisionTraceFlag DefaultShapeComplexity; // 0x75
	FChaosSolverConfiguration SolverOptions; // 0x78
};

struct UMeshAttributePaintToolProperties : UInteractiveToolPropertySet {
	TArray<FName> Attributes; // 0x60
	int32_t SelectedAttribute; // 0x70
	FString AttributeName; // 0x78
};

struct URemoveOccludedTrianglesOperatorFactory : UObject {
	URemoveOccludedTrianglesTool* Tool; // 0x30
};

struct ANiagaraPreviewGrid : AActor {
	UNiagaraSystem* System; // 0x220
	ENiagaraPreviewGridResetMode ResetMode; // 0x228
	UNiagaraPreviewAxis* PreviewAxisX; // 0x230
	UNiagaraPreviewAxis* PreviewAxisY; // 0x238
	ANiagaraPreviewBase* PreviewClass; // 0x240
	float SpacingX; // 0x248
	float SpacingY; // 0x24c
	int32_t NumX; // 0x250
	int32_t NumY; // 0x254
	TArray<UChildActorComponent*> PreviewComponents; // 0x258
};

struct UPhotoModeMainPanel : UUserWidget {
	UPanelWidget* _mainPanelContainer; // 0x260
	UTabGroup* _coreMenuTabButtons; // 0x268
	UWidgetSwitcher* _coreMenu; // 0x270
	UOverlay* _inputLegend; // 0x278
	UImage* _gridLine0; // 0x280
	UImage* _gridLine1; // 0x288
	UImage* _gridLine2; // 0x290
	UImage* _gridLine3; // 0x298
	UImage* _frameDisplay; // 0x2a0
	UImage* _logoDisplay; // 0x2a8
	FText _cameraTabTitle; // 0x2b0
	FText _effectsTabTitle; // 0x2c8
	FText _frameTabTitle; // 0x2e0
	FText _bodyTabTitle; // 0x2f8
	TArray<TSoftObjectPtr<UTexture>> _frames; // 0x310
	UTabButton* _buttonClass; // 0x328
	UCarouselWithLabel* _cameraMode; // 0x330
	USliderWithLabelAndNumber* _cameraTilt; // 0x338
	USliderWithLabelAndNumber* _fieldOfView; // 0x340
	USliderWithLabelAndNumber* _depthOfField; // 0x348
	USliderWithLabelAndNumber* _focusDistance; // 0x350
	USliderWithLabelAndNumber* _selfieLight; // 0x358
	USliderWithLabelAndNumber* _exposure; // 0x360
	USliderWithLabelAndNumber* _contrast; // 0x368
	USliderWithLabelAndNumber* _vignette; // 0x370
	USliderWithLabelAndNumber* _chromaticAberration; // 0x378
	USliderWithLabelAndNumber* _grain; // 0x380
	USliderWithLabelAndNumber* _time; // 0x388
	UCarouselWithLabel* _frame; // 0x390
	UCarouselWithLabel* _logo; // 0x398
	UCarouselWithLabel* _aspectRatio; // 0x3a0
	UCarouselWithLabel* _lookAtCamera; // 0x3a8
	UCarouselWithLabel* _upperBodyPose; // 0x3b0
	UCarouselWithLabel* _lowerBodyPose; // 0x3b8
	UTextBlock* _selfieModeNote; // 0x3c0
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct ABP_WeaponScope_M82A1_C : AWeaponAttachmentScope {
	UDummyCollisionCapsule* ScopeViewCollision; // 0x950
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct ABP_Survival_Blueprints_PlaceShelter_Objective_C : ABlueprintableItemObjective {
	FPointerToUberGraphFrame UberGraphFrame; // 0x368
	USceneComponent* DefaultSceneRoot; // 0x370
	UDialogueData* DialogueData; // 0x378
	AMissionDialogueManager* DialogueManager; // 0x380
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe8
};

struct UItemUserWidget : UBaseItemWidget {
	FMulticastInlineDelegate OnClicked; // 0x298
	UUserWidget* _uiBorder; // 0x2a8
	bool _isSelected; // 0x2b0
	bool _isHovered; // 0x2b1
};

struct UGeometryCollectionCache : UObject {
	FRecordedTransformTrack RecordedData; // 0x28
	UGeometryCollection* SupportedCollection; // 0x38
	FGuid CompatibleCollectionState; // 0x40
};

struct UGroomCreateStrandsTexturesOptions : UObject {
	int32_t Resolution; // 0x28
	EStrandsTexturesTraceType TraceType; // 0x2c
	float TraceDistance; // 0x30
	EStrandsTexturesMeshType MeshType; // 0x34
	UStaticMesh* StaticMesh; // 0x38
	USkeletalMesh* SkeletalMesh; // 0x40
	int32_t LODIndex; // 0x48
	int32_t SectionIndex; // 0x4c
	int32_t UVChannelIndex; // 0x50
	TArray<int32_t> GroupIndex; // 0x58
};

struct ABP_Survival_Storage_CutTree_Objective_C : ACuttingObjective {
	USceneComponent* DefaultSceneRoot; // 0x360
};

struct UMeshOpPreviewWithBackgroundCompute : UObject {
	UPreviewMesh* PreviewMesh; // 0x58
	TArray<UMaterialInterface*> StandardMaterials; // 0x60
	UMaterialInterface* OverrideMaterial; // 0x70
	UMaterialInterface* WorkingMaterial; // 0x78
};

struct UARMeshComponent : UARComponent {
	FARMeshUpdatePayload ReplicatedPayload; // 0x280
};

struct AReflectionCapture : AActor {
	UReflectionCaptureComponent* CaptureComponent; // 0x220
};

struct UBTTask_BlueprintBase : UBTTaskNode {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	FIntervalCountdown TickInterval; // 0x80
	char bShowPropertyDetails : 1; // 0xa0
};

struct UBasicNotificationDescription : UNotificationDescription {
	FString Message; // 0x40
	float Duration; // 0x50
	bool ping; // 0x54
};

struct UDerivedWidgetsData : UDataAsset {
	UUserWidget* CraftingPanel; // 0x30
	UUserWidget* CraftingInfo; // 0x38
	UUserWidget* CraftingSectionContainer; // 0x40
	UUserWidget* CraftableItem; // 0x48
	UUserWidget* CraftingIngredient; // 0x50
	UUserWidget* CraftingPossibleItem; // 0x58
	UUserWidget* StripedFiller; // 0x60
	UUserWidget* AvailableItem; // 0x68
	UWorldCraftingMarkerWidget* WorldCraftingMarker; // 0x70
	ULoadingScreen* LoadingScreen; // 0x78
	UUserWidget* InteractionWidgetClass; // 0x80
	UUserWidget* InteractionGroupWidgetClass; // 0x88
	UUserWidget* InteractionContainerWidgetClass; // 0x90
	UUserWidget* ItemWidgetClass; // 0x98
	UUserWidget* InventoryWidgetClass; // 0xa0
	UUserWidget* InventorySlotWidgetClass; // 0xa8
	UUserWidget* WarningWidgetClass; // 0xb0
	UUserWidget* HudWidgetClass; // 0xb8
	UUserWidget* LoadingWidgetClass; // 0xc0
	UUserWidget* LoadingIconWidgetClass; // 0xc8
	UUserWidget* SpawnScreenWidgetClass; // 0xd0
	UUserWidget* WaypointScreenWidgetClass; // 0xd8
	UUserWidget* HoverPanelWidgetClass; // 0xe0
	UUserWidget* ActionProgressWidgetClass; // 0xe8
	UUserWidget* ItemSelectionWidgetClass; // 0xf0
	UUserWidget* ExamineWidgetClass; // 0xf8
	UUserWidget* HandsInventoryWidgetClass; // 0x100
	UUserWidget* GenericItemInventoryWidgetClass; // 0x108
	UUserWidget* InventoryContainersWidgetClass; // 0x110
	UUserWidget* CombinedInventoryWidgetClass; // 0x118
	UUserWidget* TeamInvitationWidgetClass; // 0x120
	UUserWidget* CraftingInfoWidgetClass; // 0x128
	UUserWidget* CraftingComponentWidgetClass; // 0x130
	UUserWidget* CraftingRecipeWidgetClass; // 0x138
	UUserWidget* EmptySlotWidgetClass; // 0x140
	UUserWidget* TeamInfoWidgetClass; // 0x148
	UUserWidget* TeammateNameWidgetClass; // 0x150
	UUserWidget* PreviousNextSwitchWidgetClass; // 0x158
	UUserWidget* VicinityItemContainerWidgetClass; // 0x160
	UUserWidget* QuickAccessItemWidget; // 0x168
	UChangeTextWidget* ChangeTextWidgetClass; // 0x170
	UItemStatusWidget* ItemStatusWidgetClass; // 0x178
	UHealthWidget* HealthWidgetClass; // 0x180
	UUserWidget* GameEventPanelWidgetClass; // 0x188
	UUserWidget* GameEventCardWidgetClass; // 0x190
	UUserWidget* GameEventScoreboardWidgetClass; // 0x198
	UUserWidget* GameEventMiniScoreboardWidgetClass; // 0x1a0
	UUserWidget* TournamentScoreboardWidgetClass; // 0x1a8
	UUserWidget* CircularMenuWidgetClass; // 0x1b0
	UUserWidget* CircularMenuSegmentWidgetClass; // 0x1b8
	UUserWidget* LockpickingWidgetClass; // 0x1c0
	UDoorUpgradeWidget* DoorUpgradeWidgetClass; // 0x1c8
	UUserWidget* UpgradeWidgetClass; // 0x1d0
	UUserWidget* InventoryContainerWidget2Test; // 0x1d8
	UUserWidget* InventoryItemWidget2Test; // 0x1e0
	UUserWidget* ItemInventoryWidget2; // 0x1e8
	UUserWidget* InventoryPanelSideLayerWidget; // 0x1f0
	UUserWidget* ItemSplittingWidgetClass; // 0x1f8
	TMap<EWidgetType, UUserWidget*> Widgets; // 0x200
	UUserWidget* ObjectivesWidgetClass; // 0x250
	UUserWidget* MissionPromptClass; // 0x258
	UUserWidget* MissionResultClass; // 0x260
	UUserWidget* MissionItemClass; // 0x268
	UUserWidget* ObjectiveItemClass; // 0x270
	UUserWidget* MissionRewardClass; // 0x278
	UUserWidget* RewardItemWidgetClass; // 0x280
	UUserWidget* StatisticsListRow; // 0x288
	TArray<FTooltipPanelData> ItemTooltipPanels; // 0x290
	UUserWidget* MalfunctionsContainerClass; // 0x2a0
	UUserWidget* WeaponAmmoCountContainerClass; // 0x2a8
	UUserWidget* PlaceableElementWidgetClass; // 0x2b0
};

struct UBaseBuildingComponent : UStaticMeshComponent {
	FString _name; // 0x4d8
	EBaseElementType _baseElementType; // 0x4e8
	bool _isClimbable; // 0x4ea
	bool _isBlockingItemPlacement; // 0x4eb
	TArray<UStaticMesh*> _staticMeshVariations; // 0x4f0
	UChoppingRecipeDataAsset* _choppingRecipeAsset; // 0x500
	float _healthPoints; // 0x508
	bool _canBeDamaged; // 0x50c
	float _hoursToDecay; // 0x510
	bool _isUsedForRespawn; // 0x514
	float _explosionResistance; // 0x518
	float _collisionEnergyResistance; // 0x51c
	UCurveFloat* _collisionDamageModifierFromEnergy; // 0x520
	UStaticMesh* _weatherMaskMesh; // 0x528
	int32_t _maxInstancesPerFlagArea; // 0x530
	UPlaceableCraftableItem* _upgradeRecipe; // 0x538
	bool _cascadeDestroySnappedElementsOnUpgrade; // 0x540
	bool _isTileable; // 0x541
	bool _mustBePlacedOnFoundation; // 0x542
	bool _canEverBePlacedOnFoundation; // 0x543
	bool _canBePlacedOnOtherBaseElements; // 0x544
	bool _canBePlacedWithoutSnapping; // 0x545
	bool _shouldIgnoreSelfWhilePlacing; // 0x546
	bool _canBeGroundedOnOtherElements; // 0x547
	char _maxHeightLevel; // 0x548
	float _maxHeightDifference; // 0x54c
	bool _addRandomRotation; // 0x550
	bool _mustGroundAllPoints; // 0x551
	bool _traceComplexWhilePlacing; // 0x552
	bool _mustBePlacedUpright; // 0x553
	EConZPlacementHeightType _placementHeightType; // 0x554
	bool _useSimpleCollisionForOverlaps; // 0x555
	FRotator _maxRotationWhilePlacing; // 0x558
	TArray<FElementSnapMarker> _elementSnapMarkers; // 0x568
	bool _useEncapsulationTestWhenSnapping; // 0x578
	TArray<FBaseBuildingSizeVariation> _sizeVariations; // 0x580
	float _sizeVariationsSpacing; // 0x594
	float _repairTime; // 0x598
	FRepairableParams _repairableParams; // 0x5a0
	float _experienceAwardForBuilding; // 0x5d8
	TArray<UParticleSystem*> _destructionParticles; // 0x5e0
	TArray<FTransform> _destructionParticlesSpawnTransforms; // 0x5f0
	UAkAudioEvent* _destructionSound; // 0x600
	bool _isDoor; // 0x608
	ADoor* _doorClass; // 0x610
	bool _hasLadder; // 0x618
	TArray<FLadderMarker> _ladderMarkers; // 0x620
	TArray<FBaseElementDamageZone> _damageZones; // 0x630
	bool _shouldDestroyElementsOnTopWhenDestroyed; // 0x640
	float _destructionTime; // 0x644
	bool _shouldRemoveIntersectingElementsOnDestroy; // 0x648
	TArray<FBaseElementDestructionZone> _destructionZones; // 0x650
	bool _useAsReplenishableResource; // 0x660
	FReplenishableResourceDescription _replenishableResourceDescription; // 0x668
};

struct UCloudStorageBase : UPlatformInterfaceBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct UNiagaraComponentPool : UObject {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UInventoryItemDataIcon : UInventoryItemData {
	UTexture2D* Icon; // 0x30
};

struct UNiagaraRibbonRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x80
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x88
	ENiagaraRibbonFacingMode FacingMode; // 0xa8
	FNiagaraRibbonUVSettings UV0Settings; // 0xac
	FNiagaraRibbonUVSettings UV1Settings; // 0xd0
	ENiagaraRibbonDrawDirection DrawDirection; // 0xf4
	float CurveTension; // 0xf8
	ENiagaraRibbonTessellationMode TessellationMode; // 0xfc
	int32_t TessellationFactor; // 0x100
	bool bUseConstantFactor; // 0x104
	float TessellationAngle; // 0x108
	bool bScreenSpaceTessellation; // 0x10c
	FNiagaraVariableAttributeBinding PositionBinding; // 0x110
	FNiagaraVariableAttributeBinding ColorBinding; // 0x168
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x1c0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x218
	FNiagaraVariableAttributeBinding RibbonTwistBinding; // 0x270
	FNiagaraVariableAttributeBinding RibbonWidthBinding; // 0x2c8
	FNiagaraVariableAttributeBinding RibbonFacingBinding; // 0x320
	FNiagaraVariableAttributeBinding RibbonIdBinding; // 0x378
	FNiagaraVariableAttributeBinding RibbonLinkOrderBinding; // 0x3d0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x428
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x480
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x4d8
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x530
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x588
	FNiagaraVariableAttributeBinding U0OverrideBinding; // 0x5e0
	FNiagaraVariableAttributeBinding V0RangeOverrideBinding; // 0x638
	FNiagaraVariableAttributeBinding U1OverrideBinding; // 0x690
	FNiagaraVariableAttributeBinding V1RangeOverrideBinding; // 0x6e8
};

struct UUI_Border_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UImage* Image_1; // 0x280
	UNamedSlot* NamedSlot_1; // 0x288
	BorderSizes BorderSize; // 0x290
	FLinearColor Color; // 0x294
	float _padding; // 0x2a4
};

struct UPreviewMesh : UObject {
	bool bBuildSpatialDataStructure; // 0x40
	bool bDrawOnTop; // 0x41
	USimpleDynamicMeshComponent* DynamicMeshComponent; // 0x50
};

struct UActorChannel : UChannel {
	AActor* Actor; // 0x70
	TArray<UObject*> CreateSubObjects; // 0x160
};

struct UCreateSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int32_t row; // 0x4c
	int32_t RowSpan; // 0x50
	int32_t column; // 0x54
	int32_t ColumnSpan; // 0x58
	int32_t Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct AKillBoxDetectionField : APlaceableActorBlocker {
	UBoxComponent* BoxCollisionComponent; // 0x220
};

struct UUI_WeaponAmmoDisplayContainer_C : UWeaponAmmoDisplayContainerWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UWidgetAnimation* FadeOut; // 0x2a8
	UWidgetAnimation* FadeIn; // 0x2b0
};

struct URemoveMagazineInsertMagazineInsertCartridge : UWeaponActionReloadSequence {
	FName MontageEndSectionName; // 0x90
};

struct UPlayEffectsWhenParticleCollides : UParticleModuleEventSendToGame {
	UProjectileImpactEffects* ImpactEffects; // 0x28
};

struct UConZVehicleDriveComponent4W : UDcxVehicleDriveComponent4W {
	float _maxArtificialBrakingForce; // 0x3d8
	float _speedLimiterMaxSpeed; // 0x3dc
	float _speedLimiterMaxBrakingForce; // 0x3e0
	float _speedLimiterInfluenceCoefficient; // 0x3e4
	TArray<FConZVehicleFlatTireWheelConfiguration> _flatTireWheelConfigurations; // 0x3e8
};

struct UUI_SquadEditor_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* AcceptButton; // 0x268
	UUI_DropdownMenuWidget_C* BackgroundDropdownMenu; // 0x270
	UUniformGridPanel* BackgroundGrid; // 0x278
	UUI_DropdownMenuColorSelectionWidget_C* BackgroundPrimaryColorSelector; // 0x280
	UUI_DropdownMenuColorSelectionWidget_C* BackgroundSecondaryColorSelector; // 0x288
	UUI_DropdownMenuTextureSelectionWidget_C* BackgroundSelector; // 0x290
	UUI_DropdownMenuColorSelectionWidget_C* BackgroundTertiaryColorSelector; // 0x298
	UButton* CancelButton; // 0x2a0
	UUI_DropdownMenuWidget_C* ColorDropdownMenu; // 0x2a8
	UUniformGridPanel* ColorGrid; // 0x2b0
	UVerticalBox* EmblemBox; // 0x2b8
	UImage* Image_2; // 0x2c0
	UImage* Image_3; // 0x2c8
	UImage* Image_4; // 0x2d0
	UImage* Image_5; // 0x2d8
	UImage* Image_8; // 0x2e0
	UImage* Image_9; // 0x2e8
	UVerticalBox* InformationBox; // 0x2f0
	UImage* InformationBoxBG; // 0x2f8
	UMultiLineEditableText* InformationTextBox; // 0x300
	UVerticalBox* MessageBox; // 0x308
	UImage* MessageBoxBG; // 0x310
	UMultiLineEditableText* MessageTextBox; // 0x318
	UEditableTextBox* NameTextBox; // 0x320
	UUI_DropdownMenuWidget_C* SymbolDropdownMenu; // 0x328
	UUniformGridPanel* SymbolGrid; // 0x330
	UUI_DropdownMenuColorSelectionWidget_C* SymbolPrimaryColorSelector; // 0x338
	UUI_DropdownMenuColorSelectionWidget_C* SymbolSecondaryColorSelector; // 0x340
	UUI_DropdownMenuTextureSelectionWidget_C* SymbolSelector; // 0x348
	UUI_DropdownMenuColorSelectionWidget_C* SymbolTertiaryColorSelector; // 0x350
	UUI_SquadEmblem_C* UI_SquadEmblem; // 0x358
	int32_t SymbolColumnCount; // 0x360
	int32_t ColorRowCount; // 0x364
	int32_t BackgroundColumnCount; // 0x368
	int32_t MaxInformationLen; // 0x36c
	int32_t MaxMessageLen; // 0x370
};

struct AWaypointGroup : AAnimalSpawner2 {
	FColor DebugColor; // 0x330
	EWaypointTraverseType WaypointTraverseType; // 0x334
	int32_t MaxSpawnInstancesPerWaypoint; // 0x338
	float WaypointSpawningResetTime; // 0x33c
	TArray<FWaypoint> Waypoints; // 0x340
};

struct ANavModifierVolume : AVolume {
	UNavArea* AreaClass; // 0x260
	bool bMaskFillCollisionUnderneathForNavmesh; // 0x268
};

struct UBTDecorator_IsAtLocation : UBTDecorator_BlackboardBase {
	float AcceptableRadius; // 0x90
	FAIDataProviderFloatValue ParametrizedAcceptableRadius; // 0x98
	FAIDistanceType GeometricDistanceType; // 0xd0
	char bUseParametrizedRadius : 1; // 0xd4
	char bUseNavAgentGoalLocation : 1; // 0xd4
	char bPathFindingBasedTest : 1; // 0xd4
};

struct UUI_GameEventLeaderboardRow_C : UUserWidget {
	UTextBlock* Assists; // 0x260
	UBorder* Background; // 0x268
	UTextBlock* Deaths; // 0x270
	UTextBlock* Fame; // 0x278
	UTextBlock* KD; // 0x280
	UTextBlock* Kills; // 0x288
	UTextBlock* Player; // 0x290
	UTextBlock* RankText; // 0x298
	UTextBlock* Score; // 0x2a0
	FLinearColor BackgroundColor; // 0x2a8
	int32_t Rank; // 0x2b8
};

struct UCrowdManager : UCrowdManagerBase {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct UPropertyValue : UObject {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct UWidgetTree : UObject {
	UWidget* RootWidget; // 0x28
};

struct UMagicLeapPlanesComponent : USceneComponent {
	TArray<EMagicLeapPlaneQueryFlags> QueryFlags; // 0x1f8
	UBoxComponent* SearchVolume; // 0x208
	int32_t MaxResults; // 0x210
	float MinHolePerimeter; // 0x214
	float MinPlaneArea; // 0x218
	EMagicLeapPlaneQueryType QueryType; // 0x21c
	float SimilarityThreshold; // 0x220
	FMulticastInlineDelegate OnPlanesQueryResult; // 0x228
	FMulticastInlineDelegate OnPersistentPlanesQueryResult; // 0x238
};

struct UInterpToMovementComponent : UMovementComponent {
	float Duration; // 0xf0
	char bPauseOnImpact : 1; // 0xf4
	bool bSweep; // 0xf8
	ETeleportType TeleportType; // 0xf9
	EInterpToBehaviourType BehaviourType; // 0xfa
	bool bCheckIfStillInWorld; // 0xfb
	char bForceSubStepping : 1; // 0xfc
	FMulticastInlineDelegate OnInterpToReverse; // 0x100
	FMulticastInlineDelegate OnInterpToStop; // 0x110
	FMulticastInlineDelegate OnWaitBeginDelegate; // 0x120
	FMulticastInlineDelegate OnWaitEndDelegate; // 0x130
	FMulticastInlineDelegate OnResetDelegate; // 0x140
	float MaxSimulationTimeStep; // 0x150
	int32_t MaxSimulationIterations; // 0x154
	TArray<FInterpControlPoint> ControlPoints; // 0x158
};

struct URetainerBox : UContentWidget {
	bool bRetainRender; // 0x120
	bool RenderOnInvalidation; // 0x121
	bool RenderOnPhase; // 0x122
	int32_t Phase; // 0x124
	int32_t PhaseCount; // 0x128
	UMaterialInterface* EffectMaterial; // 0x130
	FName TextureParameter; // 0x138
};

struct UARLifeCycleComponent : USceneComponent {
	FMulticastInlineDelegate OnARActorSpawnedDelegate; // 0x1f8
	FMulticastInlineDelegate OnARActorToBeDestroyedDelegate; // 0x208
};

struct USourceEffectStereoDelayPreset : USoundEffectSourcePreset {
	FSourceEffectStereoDelaySettings Settings; // 0xb4
};

struct UPrisonerBodyConditionUIData_NutrientDeficiency : UPrisonerBodyConditionUIData {
	EConZUnit NutrientUnit; // 0x19c
};

struct UFlareItemState : UItemState {
	int64_t IgnitedTimeStamp; // 0xf8
};

struct UMaterialExpressionSquareRoot : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AZombieAIController2 : AAIController {
	UAISenseConfig_Sight* _lyingSightSenseConfig; // 0x328
	UAISenseConfig_Hearing* _lyingHearingSenseConfig; // 0x330
	float _stateMachineTickIntervalWhenInRelaxedState; // 0x338
	bool _shouldWander; // 0x33c
	bool _shouldWanderAroundWanderOrigin; // 0x33d
	float _maxWanderingRadius; // 0x340
	float _minTimeToRestBeforeWandering; // 0x344
	float _maxTimeToRestBeforeWandering; // 0x348
	bool _shouldBecomeAlertedBySight; // 0x34c
	float _minLineOfSightDurationToBecomeAlerted; // 0x350
	float _maxLineOfSightDurationToBecomeAlerted; // 0x354
	bool _shouldBecomeAlertedByHearing; // 0x358
	float _minDelayBeforeBecomingAlertedByHearing; // 0x35c
	float _maxDelayBeforeBecomingAlertedByHearing; // 0x360
	UAISenseConfig_Sight* _relaxedIdleSightSenseConfig; // 0x368
	UAISenseConfig_Hearing* _relaxedIdleHearingSenseConfig; // 0x370
	UAISenseConfig_Sight* _relaxedWanderSightSenseConfig; // 0x378
	UAISenseConfig_Hearing* _relaxedWanderHearingSenseConfig; // 0x380
	float _stateMachineTickIntervalWhenInAlertedState; // 0x388
	float _minObservingForLineOfSightStartDelay; // 0x38c
	float _maxObservingForLineOfSightStartDelay; // 0x390
	float _minInvestigateStimulusDelay; // 0x394
	float _maxInvestigateStimulusDelay; // 0x398
	float _minEnterCombatModeDelay; // 0x39c
	float _maxEnterCombatModeDelay; // 0x3a0
	float _distanceAtWhichToIgnoreEnterCombatModeDelay; // 0x3a4
	UCurveVector* _observingCurve; // 0x3a8
	float _observingCurvePeriod; // 0x3b0
	float _observingCurveMaxYaw; // 0x3b4
	float _observingCurveMaxPitch; // 0x3b8
	UAISenseConfig_Sight* _alertedSightSenseConfig; // 0x3c0
	UAISenseConfig_Hearing* _alertedHearingSenseConfig; // 0x3c8
	float _stateMachineTickIntervalWhenInCombatState; // 0x3d0
	bool _shouldAttack; // 0x3d4
	bool _shouldBackOffIfTooCloseToFoe; // 0x3d5
	bool _shouldPredictFoeLocation; // 0x3d6
	UCurveFloat* _foeLocationPredictionStrengthVsDistanceToFoe; // 0x3d8
	float _attackDistance; // 0x3e0
	int32_t _minNumConsecutiveInflictedMeleeHitsToIntimidate; // 0x3e4
	int32_t _maxNumConsecutiveInflictedMeleeHitsToIntimidate; // 0x3e8
	float _minTimeBeforeFoeIsConsideredUnreachable; // 0x3ec
	float _maxTimeBeforeFoeIsConsideredUnreachable; // 0x3f0
	float _minTimeSinceLastAttackWhileFoeIsInLineOfSightToIntimidate; // 0x3f4
	float _maxTimeSinceLastAttackWhileFoeIsInLineOfSightToIntimidate; // 0x3f8
	float _costOfJumpingInPathLength; // 0x3fc
	float _minPathPointDistance; // 0x400
	FDetectionDelayTimerData _detectionDelayTimerData; // 0x404
	AZombie2* _zombie; // 0x418
};

struct UResizableWindow_C : UCustomGUIWindow_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	UBorderFilled_C* BorderFilled; // 0x2a0
	UBorderFilled_C* BorderOutlineFilled; // 0x2a8
	UBorder* BorderOutlineUpperPart; // 0x2b0
	UCanvasPanel* ContentArea; // 0x2b8
	UNamedSlot* ContentAreaSlot; // 0x2c0
	UFooterV2_C* FooterV2; // 0x2c8
	UBorder* HeaderArea; // 0x2d0
	UTextBlock* HeaderTextWidget; // 0x2d8
	UImage* IRMaximize; // 0x2e0
	UImage* IRMinimize; // 0x2e8
	UBorder* ResizeArea; // 0x2f0
	USizeBox* ResizeAreaBox; // 0x2f8
	UImage* ResizeImage; // 0x300
	UHoveredEventWidget_C* ResizeWidget; // 0x308
	bool DragEnabled; // 0x310
	FSlateFontInfo HeaderFont; // 0x318
	bool IsMouseButtonDown; // 0x370
	FVector2D LastMousePosition; // 0x374
	bool MouseDownAndMoving; // 0x37c
	bool IsDrag; // 0x37d
	bool IsResize; // 0x37e
	UCanvasPanelSlot* ParentSlot; // 0x380
	bool ResizeEnabled; // 0x388
	FLinearColor ResizeColorHover; // 0x38c
	FLinearColor ResizeColorNormal; // 0x39c
	FLinearColor HeaderColorNormal; // 0x3ac
	FLinearColor HeaderColorHovered; // 0x3bc
	bool IsResizeColoredHover; // 0x3cc
	bool IsHeaderColoredHover; // 0x3cd
	bool IsResizeColoredNormal; // 0x3ce
	bool IsHeaderColoredNormal; // 0x3cf
	FVector2D PreResizeAlignment; // 0x3d0
	FVector2D PreResizeOffset; // 0x3d8
	bool IsAlignmentAccountedFor; // 0x3e0
	FVector2D PreDragSize; // 0x3e4
	bool IsResizeHovered; // 0x3ec
	bool IsHeaderHovered; // 0x3ed
	FVector2D ResizeAreaSize; // 0x3f0
	FSlateBrush ResizeAreaBrush; // 0x3f8
	FSlateBrush DragAppearanceBrush; // 0x480
	FLinearColor DragAppearanceColor; // 0x508
	FText HeaderText; // 0x518
	float SafetyZoneY; // 0x530
	float SafetyZoneX; // 0x534
	float MinWidth; // 0x538
	float MinHeight; // 0x53c
	float MaxWidth; // 0x540
	float MaxHeight; // 0x544
	FLinearColor HeaderContentNormal; // 0x548
	FSlateColor HeaderTextColorNormal; // 0x558
	FSlateColor HeaderTextColorHovered; // 0x580
	bool isMinimized; // 0x5a8
	UWindowsContent_C* _contentWidgetClass; // 0x5b0
	FVector2D _curentContentAreaSlotSize; // 0x5b8
	FMulticastInlineDelegate ContentSizeChangedEventDispatcher; // 0x5c0
	bool isFooterV2Active; // 0x5d0
	UWindowsContent_C* _windowsContentWidget; // 0x5d8
	bool ResizeEnabledLocked; // 0x5e0
	FMulticastInlineDelegate ContentMaximizedEventDispatcher; // 0x5e8
	bool _shouldRefreshSize; // 0x5f8
	FMulticastInlineDelegate OnHeaderDoubleClickDispatcher; // 0x600
	UHUD_C* ParentHUD; // 0x610
};

struct UTimedTriggerComponentState : UTriggerComponentState {
	float CountdownRemainingTime; // 0x28
};

struct UDataAsset : UObject {
	UDataAsset* NativeClass; // 0x28
};

struct UMetabolismHumanBodyPanel : UUserWidget {
	FLinearColor ColdBodyColor; // 0x260
	FLinearColor HotBodyColor; // 0x270
	float BodyTemperaturePreview; // 0x280
	UImage* _img_BodyGlow_Male; // 0x288
	UImage* _img_BodyScan_Male; // 0x290
	UImage* _img_BodyGlow_Female; // 0x298
	UImage* _img_BodyScan_Female; // 0x2a0
	UImage* _img_Head_Male; // 0x2a8
	UImage* _img_Ear_Left_Male; // 0x2b0
	UImage* _img_Ear_Right_Male; // 0x2b8
	UImage* _img_Neck_Male; // 0x2c0
	UImage* _img_Trapezius_Male; // 0x2c8
	UImage* _img_Shoulder_Left_Male; // 0x2d0
	UImage* _img_Shoulder_Right_Male; // 0x2d8
	UImage* _img_Chest_Male; // 0x2e0
	UImage* _img_Arm_Left_Male; // 0x2e8
	UImage* _img_Arm_Right_Male; // 0x2f0
	UImage* _img_Forearm_Left_Male; // 0x2f8
	UImage* _img_Forearm_Right_Male; // 0x300
	UImage* _img_Hand_Left_Male; // 0x308
	UImage* _img_Hand_Right_Male; // 0x310
	UImage* _img_Umbilicus_Male; // 0x318
	UImage* _img_Abdomen_Male; // 0x320
	UImage* _img_Thigh_Left_Male; // 0x328
	UImage* _img_Thigh_Right_Male; // 0x330
	UImage* _img_Kneecap_Left_Male; // 0x338
	UImage* _img_Kneecap_Right_Male; // 0x340
	UImage* _img_Leg_Left_Male; // 0x348
	UImage* _img_Leg_Right_Male; // 0x350
	UImage* _img_Foot_Left_Male; // 0x358
	UImage* _img_Foot_Right_Male; // 0x360
	UImage* _img_Footbones_Left_Male; // 0x368
	UImage* _img_Footbones_Right_Male; // 0x370
	UImage* _img_Legbones_Left_Male; // 0x378
	UImage* _img_Legbones_Right_Male; // 0x380
	UImage* _img_Thighbone_Left_Male; // 0x388
	UImage* _img_Thighbone_Right_Male; // 0x390
	UImage* _img_Pelvis_Male; // 0x398
	UImage* _img_Spine_Male; // 0x3a0
	UImage* _img_Handbones_Left_Male; // 0x3a8
	UImage* _img_Handbones_Right_Male; // 0x3b0
	UImage* _img_Forearmbones_Left_Male; // 0x3b8
	UImage* _img_Forearmbones_Right_Male; // 0x3c0
	UImage* _img_Armbone_Left_Male; // 0x3c8
	UImage* _img_Armbone_Right_Male; // 0x3d0
	UImage* _img_Scapula_Left_Male; // 0x3d8
	UImage* _img_Scapula_Right_Male; // 0x3e0
	UImage* _img_Ribcage_Male; // 0x3e8
	UImage* _img_Skull_Male; // 0x3f0
	UImage* _img_Head_Female; // 0x3f8
	UImage* _img_Ear_Left_Female; // 0x400
	UImage* _img_Ear_Right_Female; // 0x408
	UImage* _img_Neck_Female; // 0x410
	UImage* _img_Trapezius_Female; // 0x418
	UImage* _img_Shoulder_Left_Female; // 0x420
	UImage* _img_Shoulder_Right_Female; // 0x428
	UImage* _img_Chest_Female; // 0x430
	UImage* _img_Arm_Left_Female; // 0x438
	UImage* _img_Arm_Right_Female; // 0x440
	UImage* _img_Forearm_Left_Female; // 0x448
	UImage* _img_Forearm_Right_Female; // 0x450
	UImage* _img_Hand_Left_Female; // 0x458
	UImage* _img_Hand_Right_Female; // 0x460
	UImage* _img_Umbilicus_Female; // 0x468
	UImage* _img_Abdomen_Female; // 0x470
	UImage* _img_Thigh_Left_Female; // 0x478
	UImage* _img_Thigh_Right_Female; // 0x480
	UImage* _img_Kneecap_Left_Female; // 0x488
	UImage* _img_Kneecap_Right_Female; // 0x490
	UImage* _img_Leg_Left_Female; // 0x498
	UImage* _img_Leg_Right_Female; // 0x4a0
	UImage* _img_Foot_Left_Female; // 0x4a8
	UImage* _img_Foot_Right_Female; // 0x4b0
	UImage* _img_Footbones_Left_Female; // 0x4b8
	UImage* _img_Footbones_Right_Female; // 0x4c0
	UImage* _img_Legbones_Left_Female; // 0x4c8
	UImage* _img_Legbones_Right_Female; // 0x4d0
	UImage* _img_Thighbone_Left_Female; // 0x4d8
	UImage* _img_Thighbone_Right_Female; // 0x4e0
	UImage* _img_Pelvis_Female; // 0x4e8
	UImage* _img_Spine_Female; // 0x4f0
	UImage* _img_Handbones_Left_Female; // 0x4f8
	UImage* _img_Handbones_Right_Female; // 0x500
	UImage* _img_Forearmbones_Left_Female; // 0x508
	UImage* _img_Forearmbones_Right_Female; // 0x510
	UImage* _img_Armbone_Left_Female; // 0x518
	UImage* _img_Armbone_Right_Female; // 0x520
	UImage* _img_Scapula_Left_Female; // 0x528
	UImage* _img_Scapula_Right_Female; // 0x530
	UImage* _img_Ribcage_Female; // 0x538
	UImage* _img_Skull_Female; // 0x540
	UImage* _img_SpinalCord; // 0x548
	UImage* _img_Lungs; // 0x550
	UImage* _img_RespiratorySystem; // 0x558
	UImage* _img_CirculatorySystem; // 0x560
	UImage* _img_Colon; // 0x568
	UImage* _img_Intestine; // 0x570
	UImage* _img_Bladder; // 0x578
	UImage* _img_Liver; // 0x580
	UImage* _img_Kidneys; // 0x588
	UImage* _img_AdrenalGlands; // 0x590
	UImage* _img_Gallbladder; // 0x598
	UImage* _img_Pancreas; // 0x5a0
	UImage* _img_Stomach; // 0x5a8
	UImage* _img_Heart; // 0x5b0
	UImage* _img_Spleen; // 0x5b8
	UImage* _img_Brain; // 0x5c0
	UImage* _img_Reproductive_Male; // 0x5c8
	UImage* _img_Reproductive_Female; // 0x5d0
	UButton* _btn_EntireBody; // 0x5d8
	UButton* _btn_HeadRegion; // 0x5e0
	UButton* _btn_RightLegRegion; // 0x5e8
	UButton* _btn_LeftLegRegion; // 0x5f0
	UButton* _btn_TorsoRegion; // 0x5f8
	UButton* _btn_RightArmRegion; // 0x600
	UButton* _btn_LeftArmRegion; // 0x608
	UOverlay* _mainOverlay; // 0x610
	UOverlay* _maleOverlay; // 0x618
	UOverlay* _femaleOverlay; // 0x620
	UOverlay* _bothOverlay; // 0x628
	UWidgetAnimation* _focusBodyRegion_Head; // 0x630
	UWidgetAnimation* _focusBodyRegion_Torso; // 0x638
	UWidgetAnimation* _focusBodyRegion_LeftArm; // 0x640
	UWidgetAnimation* _focusBodyRegion_RightArm; // 0x648
	UWidgetAnimation* _focusBodyRegion_LeftLeg; // 0x650
	UWidgetAnimation* _focusBodyRegion_RightLeg; // 0x658
	UImage* _vignette; // 0x660
};

struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct UUI_TextInput_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UImage* Image_1; // 0x280
	UImage* Image_2; // 0x288
	UImage* InputImage; // 0x290
	USizeBox* InputSizeBox; // 0x298
	UButton* MainButton; // 0x2a0
	UTextBlock* TextBlock_1; // 0x2a8
	UEditableTextBox* TextBox; // 0x2b0
	USizeBox* TitleSizeBox; // 0x2b8
	int32_t InputFontSize; // 0x2c0
	int32_t TitleFontSize; // 0x2c4
	int32_t TitleFontSizeHighlighted; // 0x2c8
	float TitleWidth; // 0x2cc
	float InputWidth; // 0x2d0
	float Height; // 0x2d4
	FText Title; // 0x2d8
	FText DefaultValue; // 0x2f0
	float InputPadding; // 0x308
	TextInputType InputType; // 0x30c
	FMulticastInlineDelegate OnTextCommitted; // 0x310
	EHorizontalAlignment ValueJustification; // 0x320
	FLinearColor InputBackgroundColor; // 0x324
};

struct UTexture2DDynamic : UTexture {
	EPixelFormat Format; // 0xe0
};

struct URevolveBoundaryTool : UMeshBoundaryToolBase {
	URevolveBoundaryToolProperties* Settings; // 0x160
	UNewMeshMaterialProperties* MaterialProperties; // 0x168
	UConstructionPlaneMechanic* PlaneMechanic; // 0x170
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0x178
};

struct UProceduralRectangleToolProperties : UProceduralShapeToolProperties {
	float Width; // 0x70
	float Depth; // 0x74
	int32_t WidthSubdivisions; // 0x78
	int32_t DepthSubdivisions; // 0x7c
};

struct USliderWithLabelAndNumber : UConZSlider {
	UTextBlock* _name; // 0xdb8
	UTextBlock* _valueDisplay; // 0xdc0
	UImage* _focusBackgroundImage; // 0xdc8
	FSliderWithLabelAndNumberStyle _selectedAndFocusedSWNANStyle; // 0xdd0
	FSliderWithLabelAndNumberStyle _selectedAndUnfocusedSWNANStyle; // 0xf28
	FSliderWithLabelAndNumberStyle _unselectedSWNANStyle; // 0x1080
	FSliderWithLabelAndNumberStyle _highlightedSWNANStyle; // 0x11d8
	FSliderWithLabelAndNumberStyle _disabledSWNANStyle; // 0x1330
	FText _label; // 0x1488
	int32_t _decimalPlacesShown; // 0x14a0
	int32_t _decimalPlacesShifted; // 0x14a4
};

struct UClothesItemState : UItemState {
	float dirtiness; // 0xf8
	bool IsPatched; // 0xfc
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UParticleModuleSize : UParticleModuleSizeBase {
	FRawDistributionVector StartSize; // 0x30
};

struct UProceduralPuncturedDiscToolProperties : UProceduralDiscToolProperties {
	float HoleRadius; // 0x80
};

struct UDrawPolygonToolStandardProperties : UInteractiveToolPropertySet {
	EDrawPolygonDrawMode PolygonType; // 0x60
	EDrawPolygonOutputMode OutputMode; // 0x61
	float FeatureSizeRatio; // 0x64
	float ExtrudeHeight; // 0x68
	int32_t Steps; // 0x6c
	bool bAllowSelfIntersections; // 0x70
	bool bShowGizmo; // 0x71
};

struct USourceEffectFoldbackDistortionPreset : USoundEffectSourcePreset {
	FSourceEffectFoldbackDistortionSettings Settings; // 0x9c
};

struct UStandardSculptBrushOpProps : UMeshSculptBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
};

struct UParticleModulePivotOffset : UParticleModuleLocationBase {
	FVector2D PivotOffset; // 0x30
};

struct ADoubleRegularDoorStatic : ADoubleDoor {
	FRotator _openRotation0; // 0x410
	FRotator _openRotation1; // 0x41c
	FRotator _closedRotation0; // 0x428
	FRotator _closedRotation1; // 0x434
};

struct UInsertCartridgeIntoMagazine : UWeaponActionReloadSequence {
	FName MontageEndSectionName; // 0x90
};

struct USubtitleWidget : UUserWidget {
	UTextBlock* _subtitle; // 0x260
	UOverlay* _subtitleOverlay; // 0x268
};

struct USceneCaptureComponentCube : USceneCaptureComponent {
	UTextureRenderTargetCube* TextureTarget; // 0x2b0
	bool bCaptureRotation; // 0x2b8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2c0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2c8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2d0
	float IPD; // 0x2d8
};

struct URadialFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Radius; // 0xc0
	FVector position; // 0xc4
	EFieldFalloffType Falloff; // 0xd0
};

struct APot1_C : AEquipmentItem {
	UBasicGameResourceContainerComponent* BasicGameResourceContainer; // 0x7e0
	URainCollectorComponent* RainCollector; // 0x7e8
};

struct ABP_Prisoner_C : APrisoner {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1e50
	UPrisonerThirdPersonAerialSubviewComponent* TPV_Falling; // 0x1e58
	UStaticMeshComponent* Ears; // 0x1e60
	UPrisonerThirdPersonSubviewComponent* TPV_Grappled; // 0x1e68
	USkeletalMeshComponent* Waist; // 0x1e70
	UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAimingDownTheSights; // 0x1e78
	UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAimingDownTheSights; // 0x1e80
	UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedLeaningStanceAiming; // 0x1e88
	UPrisonerFirstPersonVehicleAimingSubviewComponent* FPV_MountedDefaultStanceAiming; // 0x1e90
	USceneComponent* FPViewsMouintedAiming; // 0x1e98
	UPrisonerThirdPersonSubviewComponent* TPV_Throwing; // 0x1ea0
	UPrisonerFirstPersonSubviewComponent* FPV_Lying; // 0x1ea8
	UPrisonerFirstPersonSubviewComponent* FPV_Mounted; // 0x1eb0
	USkeletalMeshComponent* FacialHairMesh; // 0x1eb8
	UPrisonerThirdPersonSubviewComponent* TPV_Swimming; // 0x1ec0
	USkeletalMeshComponent* HairMesh; // 0x1ec8
	UStaticMeshComponent* RightBreastCensor; // 0x1ed0
	UStaticMeshComponent* LeftBreastCensor; // 0x1ed8
	USphereComponent* DangerDetectionSphere; // 0x1ee0
	UStaticMeshComponent* PenisCensor; // 0x1ee8
	UStaticMeshComponent* GenitalsCensor; // 0x1ef0
	USkeletalMeshComponent* Neck; // 0x1ef8
	USkeletalMeshComponent* Penis; // 0x1f00
	UVoiceAudioComponent* VoiceAudio; // 0x1f08
	UVoiceChatComponent* VoiceChat; // 0x1f10
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_R; // 0x1f18
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleFoot_L; // 0x1f20
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHead; // 0x1f28
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_R; // 0x1f30
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleLeg_L; // 0x1f38
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_R; // 0x1f40
	UMeleeAttackCollisionCapsule* MeleeAttackCollisionCapsuleHand_L; // 0x1f48
	USphereComponent* BulletFlyBySoundCollision; // 0x1f50
	UVisionEffectsComponent* VisionEffectsComponent; // 0x1f58
	UStaticMeshComponent* Eyewear; // 0x1f60
	UStaticMeshComponent* UpperHead; // 0x1f68
	UStaticMeshComponent* LowerHead; // 0x1f70
	UStaticMeshComponent* Chip; // 0x1f78
	UStaticMeshComponent* LowerMouth; // 0x1f80
	UStaticMeshComponent* UpperMouth; // 0x1f88
	UStaticMeshComponent* REye; // 0x1f90
	UStaticMeshComponent* LEye; // 0x1f98
	USkeletalMeshComponent* UpperHeadSkeletal; // 0x1fa0
	USkeletalMeshComponent* BodyArmor; // 0x1fa8
	USkeletalMeshComponent* Backpack; // 0x1fb0
	USkeletalMeshComponent* Feet; // 0x1fb8
	USkeletalMeshComponent* Legs; // 0x1fc0
	USkeletalMeshComponent* Head; // 0x1fc8
	USkeletalMeshComponent* Hands; // 0x1fd0
	USkeletalMeshComponent* Arms; // 0x1fd8
	USkeletalMeshComponent* Torso; // 0x1fe0
	UPrisonerThirdPersonSubviewComponent* TPV_Defecating; // 0x1fe8
	UPrisonerFirstPersonSubviewComponent* FPV_ClimbingWindow; // 0x1ff0
	UPrisonerThirdPersonSubviewComponent* TPV_ClimbingWindow; // 0x1ff8
	UPrisonerThirdPersonSubviewComponent* TPV_Diving; // 0x2000
	USceneComponent* TPViews; // 0x2008
	UPrisonerThirdPersonSubviewComponent* TPV_NarrowLadder; // 0x2010
	UPrisonerThirdPersonSubviewComponent* TPV_Ragdoll; // 0x2018
	UWidgetComponent* NameWidget; // 0x2020
	UPrisonerThirdPersonSubviewComponent* TPV_StandingMelee; // 0x2028
	UPrisonerFirstPersonSubviewComponent* FPV_StandingMelee; // 0x2030
	UPrisonerFirstPersonSubviewComponent* FPV_ProneAimingDownTheSights; // 0x2038
	UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAimingDownTheSights; // 0x2040
	UPrisonerFirstPersonSubviewComponent* FPV_StandingAimingDownTheSights; // 0x2048
	UPrisonerFirstPersonSubviewComponent* FPV_ProneAiming; // 0x2050
	UPrisonerFirstPersonSubviewComponent* FPV_CrouchingAiming; // 0x2058
	UPrisonerFirstPersonSubviewComponent* FPV_StandingAiming; // 0x2060
	USceneComponent* FPViewsAiming; // 0x2068
	UPrisonerThirdPersonSubviewComponent* TPV_ProneAiming; // 0x2070
	UPrisonerThirdPersonSubviewComponent* TPV_CrouchingAiming; // 0x2078
	UPrisonerThirdPersonSubviewComponent* TPV_StandingAiming; // 0x2080
	UPrisonerFirstPersonSubviewComponent* FPV_Prone; // 0x2088
	UPrisonerFirstPersonSubviewComponent* FPV_Crouching; // 0x2090
	UPrisonerFirstPersonSubviewComponent* FPV_Standing; // 0x2098
	USceneComponent* FPViews; // 0x20a0
	UPrisonerThirdPersonSubviewComponent* TPV_Standing; // 0x20a8
	UPrisonerThirdPersonSubviewComponent* TPV_Prone; // 0x20b0
	UPrisonerThirdPersonSubviewComponent* TPV_Crouching; // 0x20b8
	UPrisonerFirstPersonViewComponent* FirstPersonView; // 0x20c0
	UPrisonerThirdPersonViewComponent* ThirdPersonView; // 0x20c8
	UCurveFloat* ShortHairCurve; // 0x20d0
	float IKoffsetLeftFootToRemove; // 0x20d8
	float IKoffsetRightFootToRemove; // 0x20dc
	float IKInterpSpeedToRemove; // 0x20e0
	FName LeftFootSocket; // 0x20e4
	FName RightFootSocket; // 0x20ec
	ABP_FootstepTracker_C* FootstepTracker; // 0x20f8
	bool IsHoldingObject; // 0x2100
	UPrimitiveComponent* BodyToMove; // 0x2108
	float TargetDistance; // 0x2110
	float TargetDistanceStep; // 0x2114
	float MaxVoiceDistance; // 0x2118
	bool IsVoiceActive; // 0x211c
	bool IgnorePenisPhysics; // 0x211d
	UCurveFloat* MediumHairCurve; // 0x2120
	UCurveFloat* MediumHairCurvePDO; // 0x2128
	UCurveFloat* MediumHairCurveTopOpacity; // 0x2130
	UCurveFloat* LongHairCurve; // 0x2138
	UCurveFloat* LongHairCurvePDO; // 0x2140
	UCurveFloat* LongHairCurveTopOpacity; // 0x2148
	UCurveFloat* ShortFacialHairCurve; // 0x2150
	UCurveFloat* MediumFacialHairCurve; // 0x2158
	UCurveFloat* MediumFacialHairCurvePDO; // 0x2160
	UCurveFloat* MediumFacialHairCurveTopOpacity; // 0x2168
	UCurveFloat* LongFacialHairCurve; // 0x2170
	UCurveFloat* LongFacialHairCurvePDO; // 0x2178
	UCurveFloat* LongFacialHairCurveTopOpacity; // 0x2180
	UCurveFloat* AfroMediumHairCurve; // 0x2188
};

struct UAlignObjectsTool : UMultiSelectionTool {
	UAlignObjectsToolProperties* AlignProps; // 0x98
};

struct UABP_SVD_Magazine_C : UWeaponAttachmentMagazineAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x318
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x398
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x3e0
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x428
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x470
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x4b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x568
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x590
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x5b8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x5e0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x680
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x730
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x778
	FAnimNode_Slot AnimGraphNode_Slot; // 0x7c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x808
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x830
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x858
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x880
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x9d8
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0xa58
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xaf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xba8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xc28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xca8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xd28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xda8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xec8
};

struct UPrisonerBodyCondition_BasicInjury : UPrisonerBodyCondition_Injury {
	FRuntimeFloatCurve _severityVsDamageRatio; // 0xa8
	float _healingRate; // 0x130
	float _damage; // 0x134
	float _damageToRecover; // 0x138
};

struct UParticleModuleTypeDataMesh : UParticleModuleTypeDataBase {
	UStaticMesh* Mesh; // 0x30
	float LODSizeScale; // 0x40
	char bUseStaticMeshLODs : 1; // 0x44
	char CastShadows : 1; // 0x44
	char DoCollisions : 1; // 0x44
	EMeshScreenAlignment MeshAlignment; // 0x45
	char bOverrideMaterial : 1; // 0x46
	char bOverrideDefaultMotionBlurSettings : 1; // 0x46
	char bEnableMotionBlur : 1; // 0x46
	FRawDistributionVector RollPitchYawRange; // 0x48
	EParticleAxisLock AxisLockOption; // 0x90
	char bCameraFacing : 1; // 0x91
	EMeshCameraFacingUpAxis CameraFacingUpAxisOption; // 0x92
	EMeshCameraFacingOptions CameraFacingOption; // 0x93
	char bApplyParticleRotationAsSpin : 1; // 0x94
	char bFaceCameraDirectionRatherThanPosition : 1; // 0x94
	char bCollisionsConsiderPartilceSize : 1; // 0x94
};

struct UThrowingSkill : UDexteritySkill {
	float _minPlayRate; // 0xac
	float _maxPlayRate; // 0xb0
};

struct ABP_Survival_BagCrafting_CutRags_Objective_C : AChoppingObjective {
	USceneComponent* DefaultSceneRoot; // 0x368
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct UInventoryPositionDataSelection : UInventoryPositionData {
	int32_t position; // 0x28
};

struct UFishSpeciesPreset : UDataAsset {
	TArray<FFishSpawnData> FishSpawnData; // 0x30
};

struct ACuttingObjective : ARequirementObjective {
	TArray<TSoftClassPtr<UObject>> _targetMeshes; // 0x330
	bool _specificItem; // 0x340
	AItem* _itemToFound; // 0x348
	int32_t _itemAmount; // 0x350
};

struct UActionProgressWidget : UDesignableUserWidget {
	FMulticastInlineDelegate ActionProgressFinishedEvent; // 0x278
	FMulticastInlineDelegate ActionProgressCancelledEvent; // 0x288
	bool CanCancel; // 0x298
	float _currentTime; // 0x2a4
	float _duration; // 0x2a8
	bool _manualMode; // 0x2ac
};

struct UVDColliderComponent : UActorComponent {
	UVDSimulation* SimulationInstance; // 0xb0
	TArray<FComponentReference> AssociatedVDComponents; // 0xb8
	char bAddAllComponents : 1; // 0xc8
	char bIgnoreConvexShapes : 1; // 0xc8
	TArray<FName> SpecificColliders; // 0xd0
};

struct URuntimeVirtualTexture : UObject {
	int32_t TileCount; // 0x28
	int32_t TileSize; // 0x2c
	int32_t TileBorderSize; // 0x30
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x34
	bool bCompressTextures; // 0x35
	bool bClearTextures; // 0x36
	bool bSinglePhysicalSpace; // 0x37
	bool bPrivateSpace; // 0x38
	bool bAdaptive; // 0x39
	bool bContinuousUpdate; // 0x3a
	int32_t RemoveLowMips; // 0x3c
	TextureGroup LODGroup; // 0x40
	int32_t Size; // 0x44
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
};

struct UPrisonerAnimNotify_PlayGearSound : UAnimNotify {
	EMotionIntensity motionIntensity; // 0x38
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UInterpFilter : UObject {
	FString Caption; // 0x28
};

struct UUI_SquadTooltip_C : UUserWidget {
	URetainerBox* RetainerBox_3; // 0x260
	UUI_SquadEmblem_C* SquadEmblem; // 0x268
	UTextBlock* SquadInformation; // 0x270
	UTextBlock* SquadName; // 0x278
};

struct UPrisonerAnimInstance : UAnimInstance {
	float SlowPaceLoopAnimSpeeds[0x16]; // 0x2b8
	float MediumPaceLoopAnimSpeeds[0x16]; // 0x310
	float FastPaceLoopAnimSpeeds[0x16]; // 0x368
	float MeleeCombatWalkUsageRadius; // 0x3c0
	float MeleeExhaustionFactorInterpSpeed; // 0x3c4
	float UpperEyelidsLookLeftFactor; // 0x3c8
	float LowerEyelidsLookLeftFactor; // 0x3cc
	float UpperEyelidsLookRightFactor; // 0x3d0
	float LowerEyelidsLookRightFactor; // 0x3d4
	float UpperEyelidsLookUpFactor; // 0x3d8
	float LowerEyelidsLookUpFactor; // 0x3dc
	float UpperEyelidsLookDownFactor; // 0x3e0
	float LowerEyelidsLookDownFactor; // 0x3e4
	bool AutoBlinkEnabled; // 0x3e8
	bool _fallWithStyle; // 0x488
	bool _isPrisonerCompletelyInitialized; // 0x489
	bool _isOwnerLocallyControlled; // 0x48a
	bool _isOwnerPlayerControlled; // 0x48b
	bool _isInFirstPersonView; // 0x48c
	bool _shouldOverrideIsInFirstPersonView; // 0x48d
	bool _isInFirstPersonViewOverride; // 0x48e
	bool _isAimingWeapon; // 0x48f
	bool _isAbleToFireWeapon; // 0x490
	EWeaponAimingType _weaponAimingType; // 0x491
	FVector _supportingHandIKLocation; // 0x494
	float _weaponAimYaw; // 0x4a0
	float _weaponAimPitch; // 0x4a4
	UAnimSequenceBase* _meleeSkill_PrimaryIdleAnimationTP; // 0x4a8
	UAnimSequenceBase* _meleeSkill_PrimaryIdleAnimationFP; // 0x4b0
	UAnimSequenceBase* _meleeSkill_TiredIdleAnimationTP; // 0x4b8
	UAnimSequenceBase* _meleeSkill_TiredIdleAnimationFP; // 0x4c0
	UAnimSequenceBase* _meleeSkill_WalkingIdleAnimationTP; // 0x4c8
	UAnimSequenceBase* _meleeSkill_WalkingIdleAnimationFP; // 0x4d0
	UAnimSequenceBase* _meleeSkill_BlockIdleAnimationTP; // 0x4d8
	UAnimSequenceBase* _meleeSkill_BlockIdleAnimationFP; // 0x4e0
	UBlendSpace* _meleeSkill_AimOffsetBlendSpaceTP; // 0x4e8
	UBlendSpace* _meleeSkill_AimOffsetBlendSpaceFP; // 0x4f0
	float _meleeSkill_IdleToBlockBlendDuration; // 0x4f8
	float _meleeSkill_BlockToIdleBlendDuration; // 0x4fc
	float _meleeSkill_ExhaustionFactor; // 0x500
	bool _shouldUseUnarmedCombatWalk; // 0x504
	bool _isHoldingBlock; // 0x505
	float _stamina; // 0x508
	float _bellyJiggleAmount; // 0x50c
	float _breastJiggleAmount; // 0x510
	FRotator _eyesRotationDelta; // 0x514
	float _minEyesRotationPitch; // 0x520
	float _maxEyesRotationPitch; // 0x524
	bool _shouldUseWeaponAnimationPose; // 0x528
	bool _shouldIgnoreSupportingHandIK; // 0x610
	float _firstPersonAimPitch; // 0x614
	float _firstPersonAimYawDelta; // 0x618
	bool _shouldAimDownTheSights; // 0x61c
	FVector _aimingDownTheSightsLocationOffset; // 0x620
	FVector _scopeViewArmDislocationOffset; // 0x62c
	FRotator _armsLagRotation; // 0x638
	float _armsLagPitch; // 0x644
	float _armsLagYaw; // 0x648
	EPrisonerStance _stance; // 0x64c
	float _crouchStage; // 0x650
	float _targetCrouchStage; // 0x654
	bool _isFreeLookEnabled; // 0x658
	bool _shouldIgnoreHeadTurning; // 0x659
	FRotator _aimOffset; // 0x65c
	float _leanAmount; // 0x668
	bool _shouldLookAtMeleeTarget; // 0x66c
	FRotator _lookAtMeleeTargetAimOffset; // 0x670
	EPrisonerAnimationSet _animationSet; // 0x67c
	bool _isInRagdoll; // 0x67d
	bool _isMovingOnGround; // 0x67e
	bool _isFalling; // 0x67f
	bool _isSwimming; // 0x680
	FVector _acceleration; // 0x684
	bool _wantsToMove; // 0x690
	bool _wantsToMoveHorizontallyOnly; // 0x691
	bool _wantsToMoveVerticallyOnly; // 0x692
	bool _wantsToWalk; // 0x693
	bool _wantsToJog; // 0x694
	bool _wantsToRun; // 0x695
	FVector _velocity; // 0x698
	float _speed; // 0x6a8
	float _speedXY; // 0x6ac
	float _maxSpeed; // 0x6b0
	float _stoppingDistance; // 0x6b4
	float _leftHandIKAmount; // 0x728
	float _desiredCourseAngle; // 0x72c
	float _desiredCoursePitchAngle; // 0x730
	float _actualCourseAngle; // 0x734
	EPrisonerMovementPace _desiredMovementPace; // 0x738
	EPrisonerMovementPace _clampedDesiredMovementPace; // 0x739
	EPrisonerMovementPace _movementPaceBeforeGroundStart; // 0x73a
	float _groundStartAnimPlayRate; // 0x73c
	float _legsPoseBeforeGroundStop; // 0x740
	ECardinalDirection _movementDirectionBeforeGroundStop; // 0x744
	EPrisonerMovementPace _movementPaceBeforeGroundStop; // 0x745
	EPrisonerAnimationSet _animationSetBeforeGroundStop; // 0x746
	bool _shouldUseLUGroundStopAnimation; // 0x747
	EHitReactState _hitReactState; // 0x748
	float _weightLoadFactor; // 0x74c
	bool _shouldUseJogStartForRunStart; // 0x750
	bool _useLocomotionAdditiveAnimations; // 0x751
	float _disorientation; // 0x754
	float _disorientationMultiplier; // 0x758
	bool _isLimping; // 0x75c
	bool _shouldRotateBonesWithFirstPersonAimPitch; // 0x75d
	float _jumpApex; // 0x764
	float _distanceToJumpApex; // 0x768
	float _legsPoseBeforeJump; // 0x76c
	EPrisonerMovementPace _movementPaceBeforeJump; // 0x770
	EPrisonerAnimationSet _animationSetBeforeJump; // 0x771
	bool _shouldJumpGoToFallingLoop; // 0x772
	float _waterImmersionDepth; // 0x774
	FVector _meshOffsetWhenInWater; // 0x778
	bool _wantsToDiveIn; // 0x784
	bool _isClimbing; // 0x858
	bool _isClimbingAnchoring; // 0x859
	UAnimSequenceBase* _climbAnchoringAnimation; // 0x8e8
	float _climbAnchoringAnimationTime; // 0x8f0
	bool _isClimbingLadder; // 0x8f4
	FVector _ladderClimbingRootBoneOffset; // 0x9b0
	float _ladderClimbingLoopState; // 0x9bc
	float _ladderClimbingLoopStateForPeeking; // 0x9c0
	float _ladderClimbingPeekState; // 0x9c4
	bool _isClimbingWindow; // 0x9c8
	bool _isClimbingWindowAnchoring; // 0x9c9
	UAnimSequenceBase* _windowClimbingAnchoringAnimation; // 0x9d0
	float _windowClimbingAnchoringAnimationTime; // 0x9d8
	EWeaponType _weaponType; // 0x9dc
	bool _isDedicatedServer; // 0x9dd
	UAnimSequenceBase* _itemFirstPersonUpperBodyStandIdle; // 0xd28
	UBlendSpace1D* _itemFirstPersonUpperBodyStandWalk; // 0xd30
	UBlendSpace1D* _itemFirstPersonUpperBodyStandWalkLimping; // 0xd38
	UBlendSpace1D* _itemFirstPersonUpperBodyStandJog; // 0xd40
	UBlendSpace1D* _itemFirstPersonUpperBodyStandJogLimping; // 0xd48
	UAnimSequenceBase* _itemFirstPersonUpperBodyStandRun; // 0xd50
	UAnimSequenceBase* _itemFirstPersonUpperBodyCrouchIdle; // 0xd58
	UBlendSpace1D* _itemFirstPersonUpperBodyCrouchWalk; // 0xd60
	UBlendSpace1D* _itemFirstPersonUpperBodyCrouchWalkLimping; // 0xd68
	UAnimSequenceBase* _itemFirstPersonUpperBodyProneIdle; // 0xd70
	UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyStandIdle; // 0xd78
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandWalk; // 0xd80
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandWalkLimping; // 0xd88
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandJog; // 0xd90
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyStandJogLimping; // 0xd98
	UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyStandRun; // 0xda0
	UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyCrouchIdle; // 0xda8
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyCrouchWalk; // 0xdb0
	UBlendSpace1D* _weaponAimingHipFirstPersonUpperBodyCrouchWalkLimping; // 0xdb8
	UAnimSequenceBase* _weaponAimingHipFirstPersonUpperBodyProneIdle; // 0xdc0
	bool _shouldUseItemFirstPersonAimOffsets; // 0xdc8
	UBlendSpace* _itemFirstPersonAimOffsetStanding; // 0xdd0
	UBlendSpace* _itemFirstPersonAimOffsetCrouching; // 0xdd8
	UBlendSpace* _itemFirstPersonAimOffsetProne; // 0xde0
	UAnimSequenceBase* _rightHandCorrectionPoseStanding; // 0xde8
	UAnimSequenceBase* _rightHandCorrectionPoseCrouching; // 0xdf0
	UAnimSequenceBase* _rightHandCorrectionPoseProne; // 0xdf8
	UAnimSequenceBase* _rightFistCorrectionPoseStanding; // 0xe00
	UAnimSequenceBase* _rightFistCorrectionPoseStandingInCombatMode; // 0xe08
	UAnimSequenceBase* _rightFistCorrectionPoseCrouching; // 0xe10
	UAnimSequenceBase* _rightFistCorrectionPoseProne; // 0xe18
	float _rightHandToIdleBlendAlphaStanding; // 0xe20
	float _rightHandToIdleBlendAlphaCrouching; // 0xe24
	UAnimSequenceBase* _leftHandCorrectionPoseStanding; // 0xe28
	UAnimSequenceBase* _leftHandCorrectionPoseCrouching; // 0xe30
	UAnimSequenceBase* _leftHandCorrectionPoseProne; // 0xe38
	UAnimSequenceBase* _leftFistCorrectionPoseStanding; // 0xe40
	UAnimSequenceBase* _leftFistCorrectionPoseStandingInCombatMode; // 0xe48
	UAnimSequenceBase* _leftFistCorrectionPoseCrouching; // 0xe50
	UAnimSequenceBase* _leftFistCorrectionPoseProne; // 0xe58
	float _leftHandToIdleBlendAlphaStanding; // 0xe60
	float _leftHandToIdleBlendAlphaCrouching; // 0xe64
	bool _hasItemInHands; // 0xe70
	FVector _itemInHandsLeftHandLocationInRightHandSpace; // 0xe74
	FRotator _itemInHandsLeftHandRotationInRightHandSpace; // 0xe80
	float _itemInHandsObstructionDepth; // 0xe8c
	float _itemInHandsObstructionDepthSmoothed; // 0xe90
	bool _isItemInHandsObstructed; // 0xe94
	bool _isItemInHandsCompletelyObstructed; // 0xe95
	float _itemInHandsObstructionSide; // 0xe98
	UAnimSequenceBase* _itemInHandsLeftObstructedIdleFP; // 0xea0
	UAnimSequenceBase* _itemInHandsRightObstructedIdleFP; // 0xea8
	UAnimSequenceBase* _itemInHandsObstructedIdleTP; // 0xeb0
	UAnimSequenceBase* _itemInHandsObstructedIdleProneTP; // 0xeb8
	bool _isInCombatMode; // 0xec0
	bool _shouldUseHandCorrections; // 0xec1
	bool _shouldUseFistCorrections; // 0xec2
	bool _overrideFingersOnlyInProne; // 0xec3
	bool _ignoreAimOffsets; // 0xec4
	EPrisonerMontageBlendType _prisonerMontageBlendType; // 0xec5
	bool _isAimingBow; // 0xec6
	float _bowArmsShakeValue; // 0xec8
	bool _isScoping; // 0xecc
	TSet<UPrisonerResponseIdle*> _responseIdleClassReferences; // 0xf20
	bool _shouldUpperBodyBeUsedAsFullBodyInIdle; // 0xfa0
	bool _isPlayingInstrument; // 0xfa1
	UAnimSequenceBase* _playingInstrumentIdleAnimation; // 0xfa8
	UAnimSequenceBase* _playingInstrumentPlayAnimation; // 0xfb0
	EPlayingInstrumentState _playingInstrumentState; // 0xfb8
	bool _isCarryingItem; // 0xfb9
	UAnimSequenceBase* _carryingItemIdleFPAnimation; // 0xfc0
	UAnimSequenceBase* _carryingItemIdleTPAnimation; // 0xfc8
	ECarryingItemState _carryingItemState; // 0xfd0
	bool _isMounted; // 0xfd1
	EPrisonerAnimationMountType _mountType; // 0xfd2
	UAnimSequenceBase* _mountedAnimation; // 0xfd8
	bool _isVehicleDriver; // 0xfe0
	UBlendSpace* _vehicleDriverForwardIdleAnimation; // 0xfe8
	UAnimSequenceBase* _vehicleDriverForwardSteeringAnimation; // 0xff0
	UAnimSequenceBase* _vehicleDriverForwardSteeringAnimationFP; // 0xff8
	UBlendSpace* _vehicleDriverReverseIdleAnimation; // 0x1000
	UAnimSequenceBase* _vehicleDriverReverseSteeringAnimation; // 0x1008
	UAnimSequenceBase* _vehicleDriverReverseSteeringAnimationFP; // 0x1010
	UBlendSpace* _vehiclePassengerIdleAnimation; // 0x1018
	float _vehicleSpeed; // 0x1020
	float _vehicleSpeedKph; // 0x1024
	float _vehicleBumpiness; // 0x1028
	float _vehicleDriverSteeringAnimationTime; // 0x102c
	float _vehicleDriverSteeringAnimationTimeInterpSpeed; // 0x1030
	float _vehicleThrottleAmount; // 0x1034
	float _vehicleBrakeAmount; // 0x1038
	float _vehicleHandbrakeAmount; // 0x103c
	float _vehicleSteerAmount; // 0x1040
	bool _isSledgeAcceleratingForward; // 0x1044
	bool _isSledgeAcceleratingBackward; // 0x1045
	float _sledgeSlidingThresholdSpeed; // 0x1048
	bool _isSledgeSliding; // 0x104c
	UAnimSequenceBase* _bowArmsShakeAnimation; // 0x1050
	float _weaponBreathFactor; // 0x1058
	float _weaponAimDownTheSightsStillBlendFactor; // 0x105c
	bool _areHandsBound; // 0x1060
	UAnimSequenceBase* _handsBoundIdleFPAnimation; // 0x1068
	UAnimSequenceBase* _handsBoundIdleTPAnimation; // 0x1070
	bool _isResting; // 0x1078
	UAnimSequenceBase* _restingAnimation; // 0x1080
	float _restingFeetOffset; // 0x1088
	float _cameraToActorRotationDeltaYaw; // 0x108c
	float _cameraToActorRotationDeltaPitch; // 0x1090
	EVehicleWeaponAimingStance _vehicleWeaponAimingStance; // 0x1094
	bool _useMountedFirstPersonWeaponAimingParameters; // 0x1095
	FVector _vehicleWAPLocationOffsetDefaultStanceFP; // 0x1098
	FVector _vehicleWAPLocationOffsetLeaningStanceFP; // 0x10a4
	bool _useMountedThirdPersonWeaponAimingParameters; // 0x10b0
	UBlendSpace* _vehicleWAPAimOffsetTP; // 0x10b8
	bool _useVehicleWAPAimOffsetTP; // 0x10c0
	UBlendSpace* _vehicleWAPAimOffsetDefaultStanceTP; // 0x10c8
	bool _useVehicleWAPAimOffsetDefaultStanceTP; // 0x10d0
	UBlendSpace* _vehicleWAPAimOffsetLeaningStanceTP; // 0x10d8
	bool _useVehicleWAPAimOffsetLeaningStanceTP; // 0x10e0
	bool _useVehicleWAPUpperBodyIdleTP; // 0x10e1
	UAnimSequenceBase* _vehicleWAPUpperBodyIdleRelaxedTP; // 0x10e8
	UAnimSequenceBase* _vehicleWAPUpperBodyIdleAimingTP; // 0x10f0
	bool _useVehicleWAPLowerBodyIdleTP; // 0x10f8
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedTP; // 0x1100
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingTP; // 0x1108
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedDefaultTP; // 0x1110
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingDefaultTP; // 0x1118
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleRelaxedLeaningTP; // 0x1120
	UAnimSequenceBase* _vehicleWAPLowerBodyIdleAimingLeaningTP; // 0x1128
	bool _isPlayingWAPStanceTransitionMontage; // 0x1130
	bool _isActivelyFishing; // 0x1131
	bool _isBaitingFish; // 0x1132
	bool _isGrappled; // 0x1133
};

struct UInterpData : UObject {
	float InterpLength; // 0x28
	float PathBuildTime; // 0x2c
	TArray<UInterpGroup*> InterpGroups; // 0x30
	UInterpCurveEdSetup* CurveEdSetup; // 0x40
	float EdSectionStart; // 0x48
	float EdSectionEnd; // 0x4c
	char bShouldBakeAndPrune : 1; // 0x50
	UInterpGroupDirector* CachedDirectorGroup; // 0x58
	TArray<FName> AllEventNames; // 0x60
};

struct UMIDIDeviceOutputController : UObject {
	int32_t DeviceID; // 0x28
	FString DeviceName; // 0x30
};

struct AAudioVolume : AVolume {
	float Priority; // 0x258
	char bEnabled : 1; // 0x25c
	FReverbSettings Settings; // 0x260
	FInteriorSettings AmbientZoneSettings; // 0x280
	TArray<FAudioVolumeSubmixSendSettings> SubmixSendSettings; // 0x2a8
	TArray<FAudioVolumeSubmixOverrideSettings> SubmixOverrideSettings; // 0x2b8
};

struct UMaterialExpressionDistance : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UCurveControlPointsMechanic : UInteractionMechanic {
	USingleClickInputBehavior* ClickBehavior; // 0x40
	UMouseHoverBehavior* HoverBehavior; // 0x48
	APreviewGeometryActor* PreviewGeometryActor; // 0x4e8
	UPointSetComponent* DrawnControlPoints; // 0x4f0
	ULineSetComponent* DrawnControlSegments; // 0x4f8
	UPointSetComponent* PreviewPoint; // 0x500
	ULineSetComponent* PreviewSegment; // 0x508
	UTransformProxy* PointTransformProxy; // 0x588
	UTransformGizmo* PointTransformGizmo; // 0x590
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x220
};

struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; // 0x38
	bool bRequireCurrentFrameData; // 0x3c
};

struct AFogSphere : AActor {
	bool _shouldExistOnDedicatedServer; // 0x220
	UCurveFloat* _densityVersusTimeOfDay; // 0x228
};

struct AHUD_John : AHUD {
	UFont* NormalFont; // 0x318
};

struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UFoliageType_InstancedStaticMesh : UFoliageType {
	UStaticMesh* Mesh; // 0x3a8
	TArray<UMaterialInterface*> OverrideMaterials; // 0x3b0
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x3c0
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	bool bRestrictCrossConsole; // 0x50
	bool bEnableRemovalRequests; // 0x51
	TArray<FPartyReservation> Reservations; // 0x58
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x78
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x68
};

struct UMaterialExpressionTemporalSobol : UMaterialExpression {
	FExpressionInput Index; // 0x40
	FExpressionInput Seed; // 0x54
	uint32_t ConstIndex; // 0x68
	FVector2D ConstSeed; // 0x6c
};

struct UWmfMediaSettings : UObject {
	bool AllowNonStandardCodecs; // 0x28
	bool LowLatency; // 0x29
	bool NativeAudioOut; // 0x2a
	bool HardwareAcceleratedVideoDecoding; // 0x2b
};

struct UDatasmithStaticMeshComponentTemplate : UDatasmithObjectTemplate {
	UStaticMesh* StaticMesh; // 0x30
	TArray<UMaterialInterface*> OverrideMaterials; // 0x38
};

struct ABP_Survival_BagCrafting_CutUndershirt_Objective_C : AChoppingObjective {
	USceneComponent* DefaultSceneRoot; // 0x368
};

struct UMovieSceneColorSection : UMovieSceneSection {
	FMovieSceneFloatChannel RedCurve; // 0xe8
	FMovieSceneFloatChannel GreenCurve; // 0x188
	FMovieSceneFloatChannel BlueCurve; // 0x228
	FMovieSceneFloatChannel AlphaCurve; // 0x2c8
};

struct ABP_Survival_Tutorial_CutBushObjective_C : ACuttingObjective {
	USceneComponent* DefaultSceneRoot; // 0x360
};

struct UUI_ScrollBar_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* SliderImage; // 0x268
	FVector2D Size; // 0x270
	float _currentValue; // 0x278
	float _currentMaxCountOnScreen; // 0x27c
	float _currentMaxValue; // 0x280
	bool _shouldUpdate; // 0x284
	float _scrollBarHeight; // 0x288
	FMulticastInlineDelegate OnSliderMoved; // 0x290
};

struct UPrisonerBodyCondition_Hypothermia : UPrisonerBodyCondition {
	float _maxSeverity; // 0xa8
	float _bodyTemperatureToDie; // 0xac
	float _bodyTemperatureToExist; // 0xb0
	float _bodyTemperatureToRecover; // 0xb4
	float _bodyTemperatureSampleInterval; // 0xbc
	float _bodyTemperatureAtUntreatedStart; // 0xc8
	float _bodyTemperatureAtStabilizationStart; // 0xcc
	float _bodyTemperatureAtRecoveryStart; // 0xd0
	EPrisonerBodyConditionState _state; // 0xd4
	float _severityRatio; // 0xdc
	float _severityRatioAtUntreatedStart; // 0xe0
	float _severityRatioAtRecoveryStart; // 0xe4
	float _severityRatioInterpSpeed; // 0xec
};

struct UUI_WeaponAmmoDisplay_C : UWeaponAmmoDisplayWidget {
	UImage* Image; // 0x288
	UImage* Image_641; // 0x290
};

struct AAirplane : APawn {
	USkeletalMeshComponent* _meshComponent; // 0x2a8
	ULiftComponent* _liftComponent; // 0x2b0
	TMap<EAerodynamicSurfaceType, char> _aerodynamicSurfaceMap; // 0x2b8
	float _currentThrottleAmount; // 0x308
	float _maxThrottle; // 0x30c
	float _maxVelocity; // 0x310
	UPhysicsConstraintComponent* _rightWheelConstraint; // 0x328
	UPhysicsConstraintComponent* _leftWheelConstraint; // 0x330
	UPhysicsConstraintComponent* _rearWheelConstraint; // 0x338
	AProjectile* _projectileClass; // 0x348
	TArray<UAirplaneMountSlot*> _mountSlots; // 0x350
	float _maxDriveOrBoardAngle; // 0x3c0
	EConZPxDominanceGroup _physicsDominanceGroup; // 0x3c4
	FTimerHandle _physicsConstraintStabilizationTimerHandle; // 0x480
	float _fireInterval; // 0x490
	float _pushImpulseMagnitude; // 0x494
	UCurveFloat* _pushIntensityCurve; // 0x498
	float _pushDirectionRatioBetweenForwardAndUp; // 0x4a0
	float _maxDistanceToAllowThePush; // 0x4a4
	float _maxDistanceToAllowThePushStart; // 0x4a8
	float _pushStartAccelerationChange; // 0x4ac
	float _pushStartSpeedThresholdKph; // 0x4b0
	float _maxHealth; // 0x4c8
	float _engineBlockMaxHealth; // 0x4d0
	float _autoHealthDrainThreshold; // 0x4d4
	float _autoHealthDrain; // 0x4d8
	FRepairableParams _repairableParams; // 0x4e0
	TArray<FVehicleDamagedEffectsParameters> _damagedEffects; // 0x518
	FName _damageMaterialParameterName; // 0x538
	UVehicleHitZoneManager* _hitZones; // 0x540
	uint32_t _vehiclePartsStateFlags; // 0x548
	float _activeHitTimeToLive; // 0x550
	FVehicleImpactEffects _impactEffects[0x5]; // 0x558
	UCurveFloat* ImpactDamageVsNormalImpulse; // 0x670
	FVehicleSpawnParameters _spawnParameters; // 0x688
	FText _healthBarCaption; // 0x6d0
	UUserWidget* _mountSlotIndicatorsWidget; // 0x6e8
	AVehicleItemContainer* _itemContainerClass; // 0x6f0
	bool _shouldDropItemsWhenDestroyed; // 0x6f8
	AVehicleItemContainer* _itemContainer; // 0x700
	URadioComponent* _radioComponent; // 0x718
	bool _hasEngine; // 0x720
	float _engineIdleRpm; // 0x724
	float _engineMaxRpm; // 0x728
	EVehicleEngineState _engineState; // 0x738
	float _engineStallingForceMagnitude; // 0x748
	bool _canEngineBeStalledByAcceleration; // 0x7b0
	float _engineStallingByAccelerationSpeedThreshold; // 0x7b4
	float _engineStallingByAccelerationOccurrenceInterval; // 0x7b8
	UAkAudioEvent* _engineStallingByAccelerationAudioEvent; // 0x7c0
	TArray<float> _engineStallingByAccelerationAudioEventTriggerTimeRatios; // 0x7c8
	bool _canEngineBeStalledByUpShift; // 0x7d8
	float _engineStallingByUpShiftOccurrenceInterval; // 0x7dc
	UAkAudioEvent* _engineStallingByUpShiftAudioEvent; // 0x7e8
	TArray<float> _engineStallingByUpShiftAudioEventTriggerTimeRatios; // 0x7f0
	UAkAudioEvent* _engineStallingWhenStartingViaMotionAudioEvent; // 0x800
	TArray<float> _engineStallingWhenStartingViaMotionAudioEventTriggerTimeRatios; // 0x808
	bool _hasFuel; // 0x818
	UGameResourceType* _fuelResourceType; // 0x820
	float _maxFuelAmount; // 0x828
	float _fuelDrainWhenStartingEngine; // 0x82c
	FRuntimeFloatCurve _engineFuelDrainPerRpm; // 0x830
	float _engineFuelDrainPerRpmScale; // 0x8b8
	FRuntimeFloatCurve _engineFuelDrainPerRpmUnderLoad; // 0x8c0
	float _engineFuelDrainPerRpmUnderLoadScale; // 0x948
	float _fuelDrainWhenInactive; // 0x94c
	float _fuelFillingBaseDuration; // 0x950
	float _fillingDurationPerFuelAmountFilled; // 0x954
	float _experienceAwardedPerFuelAmountFilled; // 0x958
	UAnimMontage* _prisonerFillingFuelMontage; // 0x960
	UAkAudioEvent* _startFillingFuelAudioEvent; // 0x968
	UAkAudioEvent* _stopFillingFuelAudioEvent; // 0x970
	UAkAudioEvent* _startFillingFuelWithReplenishableResourceAudioEvent; // 0x978
	UAkAudioEvent* _stopFillingFuelWithReplenishableResourceAudioEvent; // 0x980
	FVector _fillFuelWithReplenishableResourceOverlapBoxExtent; // 0x988
	float _fuelDrainingBaseDuration; // 0x994
	float _drainingDurationPerFuelAmountDrained; // 0x998
	float _experienceAwardedPerFuelAmountDrained; // 0x99c
	UAnimMontage* _prisonerDrainingFuelMontage; // 0x9a0
	UAkAudioEvent* _startDrainingFuelAudioEvent; // 0x9a8
	UAkAudioEvent* _stopDrainingFuelAudioEvent; // 0x9b0
	FVehicleEngineStallingParameters _engineStallingParametersWhenOutOfFuel; // 0x9b8
	float _fuelUpdateInterval; // 0xa14
	bool _hasBattery; // 0xa20
	UGameResourceType* _batteryResourceType; // 0xa28
	float _maxBatteryAmount; // 0xa30
	float _batteryDrainWhenStartingEngine; // 0xa34
	float _batteryDrainWhenHornIsActive; // 0xa38
	float _batteryDrainWhenLightsAreActive; // 0xa3c
	float _batteryDrainWhenRadioIsTurnedOn; // 0xa40
	float _batteryDrainWhenInactive; // 0xa44
	FRuntimeFloatCurve _batteryDynamoChargePerKph; // 0xa48
	float _batteryDynamoChargePerKphScale; // 0xad0
	FRuntimeFloatCurve _batteryAlternatorChargePerRpm; // 0xad8
	float _batteryAlternatorChargePerRpmScale; // 0xb60
	float _batteryPowerReductionThreshold; // 0xb64
	float _startEngineDurationPenaltyWhenBatteryReducedInPower; // 0xb68
	float _batteryChargingBaseDuration; // 0xb6c
	float _chargingDurationPerBatteryAmountCharged; // 0xb70
	float _experienceAwardedPerBatteryAmountCharged; // 0xb74
	UAnimMontage* _prisonerChargingBatteryMontage; // 0xb78
	UAkAudioEvent* _startChargingBatteryAudioEvent; // 0xb80
	UAkAudioEvent* _stopChargingBatteryAudioEvent; // 0xb88
	float _batteryUpdateInterval; // 0xb94
	UAkAudioEvent* _engineStartingAudioEvent; // 0xbb0
	UAkAudioEvent* _engineStartedAudioEvent; // 0xbb8
	UAkAudioEvent* _engineTurnedOffAudioEvent; // 0xbc0
	UAkAudioEvent* _engineFailedToStartAudioEvent; // 0xbc8
	UAkAudioEvent* _engineFailedToStartNoFuelAudioEvent; // 0xbd0
	UAkAudioEvent* _engineFailedToStartNoBatteryAudioEvent; // 0xbd8
	UAkAudioEvent* _engineStalledAudioEvent; // 0xbe0
	UAkAudioEvent* _noFuelToStartEngineAudioEvent; // 0xbe8
	UAkAudioEvent* _noBatteryToStartEngineAudioEvent; // 0xbf0
	UAkAudioEvent* _hornStartAudioEvent; // 0xbf8
	UAkAudioEvent* _hornStopAudioEvent; // 0xc00
	UAkAudioEvent* _noBatteryToActivateHornAudioEvent; // 0xc08
	UAkAudioEvent* _lightsActivatedAudioEvent; // 0xc10
	UAkAudioEvent* _lightsDeactivatedAudioEvent; // 0xc18
	UAkAudioEvent* _noBatteryToActivateLightsAudioEvent; // 0xc20
	UAkAudioEvent* _noBatteryToTurnOnRadioAudioEvent; // 0xc28
	UAkAudioEvent* _gearUpAudioEvent; // 0xc30
	UAkAudioEvent* _gearDownAudioEvent; // 0xc38
	float _rpmScaleForSoundWhenSpeedIsEqualOrGreaterThanZero; // 0xc40
	float _rpmScaleForSoundWhenSpeedIsLessThanZero; // 0xc44
	float _soundCullDistance; // 0xc48
	float _vehicleRPMRTPCInterpolationTime; // 0xc4c
	float _vehicleLoadRTPCInterpolationTime; // 0xc50
	float _vehicleSpeedRTPCInterpolationTime; // 0xc54
	int32_t _numAudioObjectsForTires; // 0xc58
	FRepairableParams _repairableTireParams; // 0xc60
	float _tireEffectUpdateRange; // 0xc98
	TArray<FVehicleTireEffectProperties> _tireEffectProperties; // 0xcb8
	FVehicleExhaustEffects _exhaustEffects; // 0xce0
	bool _hornActive; // 0xd28
	bool _lightsActive; // 0xd29
	FVehicleMaterialParameterDescription _headlightsMaterialParameter; // 0xd2c
	FVehicleMaterialParameterDescription _reverseLightsMaterialParameter; // 0xd3c
	FVehicleMaterialParameterDescription _brakeLightsMaterialParameter; // 0xd4c
	float _brakeLightsAlwaysOnIfLightsAreActivated; // 0xd5c
	AVehicleCorpse* _corpseClass; // 0xd78
	float _sendStateInterval; // 0xd84
	float _makeNoiseInterval; // 0xd88
	float _maxNoiseLoudnessFromEngine; // 0xd8c
	float _maxNoiseLoudnessFromSpeed; // 0xd90
	float _speedThresholdInKphToAffectNavigation; // 0xd98
	float _allowedWaterImmersionDepth; // 0xda0
	float _disallowedWaterImmersionDepth; // 0xda4
	float _waterImmersionDepthToForceEvictMountees; // 0xda8
	float _timeToEvictMounteesWhenImmersedIntoWater; // 0xdac
	float _timeToForceEvictMounteesWhenImmersedIntoWater; // 0xdb0
	float _timeToAutoDestructWhenImmersedIntoWater; // 0xdb4
	float _explosionDamage; // 0xdb8
	float _explosionForce; // 0xdbc
	uint32_t _repHealthFuelBatteryAmount; // 0xe40
	uint64_t _repPackedSimulationState; // 0xe48
	EAITeam _aiTeam; // 0xe60
};

struct UPlaceableOnRackItemTag : UBaseItemTag {
	FName SocketName; // 0x30
};

struct UAnimMontage : UAnimCompositeBase {
	FAlphaBlend BlendIn; // 0xa8
	float BlendInTime; // 0xd8
	FAlphaBlend BlendOut; // 0xe0
	float BlendOutTime; // 0x110
	float BlendOutTriggerTime; // 0x114
	FName SyncGroup; // 0x118
	int32_t SyncSlotIndex; // 0x120
	FMarkerSyncData MarkerData; // 0x128
	TArray<FCompositeSection> CompositeSections; // 0x148
	TArray<FSlotAnimationTrack> SlotAnimTracks; // 0x158
	TArray<FBranchingPoint> BranchingPoints; // 0x168
	bool bEnableRootMotionTranslation; // 0x178
	bool bEnableRootMotionRotation; // 0x179
	bool bEnableAutoBlendOut; // 0x17a
	ERootMotionRootLock RootMotionRootLock; // 0x17b
	TArray<FBranchingPointMarker> BranchingPointMarkers; // 0x180
	TArray<int32_t> BranchingPointStateNotifyIndices; // 0x190
	FTimeStretchCurve TimeStretchCurve; // 0x1a0
	FName TimeStretchCurveName; // 0x1c8
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct APhysicsConstraintActor : ARigidBodyBase {
	UPhysicsConstraintComponent* ConstraintComp; // 0x220
	AActor* ConstraintActor1; // 0x228
	AActor* ConstraintActor2; // 0x230
	char bDisableCollision : 1; // 0x238
};

struct UItemClassWidget : UDesignableUserWidget {
	AItem* _itemClass; // 0x278
};

struct UJournalMissionContainer : UUserWidget {
	UVerticalBox* _missionItemWidgetsContainer; // 0x260
	UVerticalBox* _completedMissionItemWidgetsContainer; // 0x268
	UOverlay* _completedMissionsOverlay; // 0x270
	UTextBlock* _noContentText; // 0x278
	TMap<AMission*, TWeakObjectPtr<UMissionItemWidget>> _missionItemWidgets; // 0x288
	TMap<AMission*, TWeakObjectPtr<UMissionItemWidget>> _completedMissionItemWidgets; // 0x2d8
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UABP_Chainsaw_C : UChainsawAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x318
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x398
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x3e0
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x538
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x580
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x5c8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x610
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x6c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x6e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x710
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x738
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x7d8
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x888
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x8d0
	FAnimNode_Slot AnimGraphNode_Slot; // 0x918
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x960
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x988
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x9b0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x9d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x9f8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xa20
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xf00
};

struct ABP_FishingRod_C : AFishingRod {
	FPointerToUberGraphFrame UberGraphFrame; // 0xac0
};

struct UUI_CC_NonSelectableText_C : UDesignableUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UImage* Image_1; // 0x280
	URetainerBox* RetainerBox_1; // 0x288
	USizeBox* SizeBox_1; // 0x290
	UTextBlock* TextBlock_1; // 0x298
	FText Text; // 0x2a0
	int32_t FontSize; // 0x2b8
	FMargin TextPadding; // 0x2bc
	FVector2D SizeOverride; // 0x2cc
	EHorizontalAlignment TextHorizontalAlignment; // 0x2d4
	FLinearColor TextColour; // 0x2d8
};

struct UInterpTrackInstSlomo : UInterpTrackInst {
	float OldTimeDilation; // 0x28
};

struct UConZGameInstance : UGameInstance {
	FCommonMapNames CommonMapNames; // 0x1a8
	FCharacterCreationMenuContext CharacterCreationMenuContext; // 0x1c0
	bool NetworkFailed; // 0x1f0
	bool WasKickedFromGameSession; // 0x1f1
	UGameplayLog* GameplayLogLogin; // 0x208
	UGameplayLog* GameplayLogAdmin; // 0x210
	UGameplayLog* GameplayLogKill; // 0x218
	UGameplayLog* GameplayLogViolations; // 0x220
	UGameplayLog* GameplayLogChat; // 0x228
	UGameplayLog* GameplayLogMine; // 0x230
	TMap<uint32_t, UDbConnection*> _databaseConnections; // 0x258
	UDedicatedServerRequest* _dedicatedServerRequest; // 0x2e0
	UUserManager* _userManager; // 0x2e8
	UUser* _currentUser; // 0x2f0
	UUserProfile* _currentUserProfile; // 0x2f8
	UTexture2D* _loadingScreenTexture; // 0x300
	ULoadingScreen* _loadingScreen; // 0x308
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	EFireEventsAtPosition EventPosition; // 0x84
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UMaterialExpressionDeriveNormalZ : UMaterialExpression {
	FExpressionInput InXY; // 0x40
};

struct AActor : UObject {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bNetTemporary : 1; // 0x58
	char bNetStartup : 1; // 0x58
	char bOnlyRelevantToOwner : 1; // 0x58
	char bAlwaysRelevant : 1; // 0x58
	char bReplicateMovement : 1; // 0x58
	char bHidden : 1; // 0x58
	char bTearOff : 1; // 0x58
	char bExchangedRoles : 1; // 0x58
	char bNetLoadOnClient : 1; // 0x59
	char bNetUseOwnerRelevancy : 1; // 0x59
	char bRelevantForNetworkReplays : 1; // 0x59
	char bRelevantForLevelBounds : 1; // 0x59
	char bReplayRewindable : 1; // 0x59
	char bAllowTickBeforeBeginPlay : 1; // 0x59
	char bAutoDestroyWhenFinished : 1; // 0x59
	char bCanBeDamaged : 1; // 0x59
	char bBlockInput : 1; // 0x5a
	char bCollideWhenPlacing : 1; // 0x5a
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a
	char bIgnoresOriginShifting : 1; // 0x5a
	char bEnableAutoLODGeneration : 1; // 0x5a
	char bIsEditorOnlyActor : 1; // 0x5a
	char bActorSeamlessTraveled : 1; // 0x5a
	char bReplicates : 1; // 0x5b
	char bCanBeInCluster : 1; // 0x5b
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b
	char bActorEnableCollision : 1; // 0x5c
	char bActorIsBeingDestroyed : 1; // 0x5c
	EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5d
	EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5e
	ENetRole RemoteRole; // 0x5f
	FRepMovement ReplicatedMovement; // 0x60
	float InitialLifeSpan; // 0x94
	float CustomTimeDilation; // 0x98
	FRepAttachment AttachmentReplication; // 0xa0
	AActor* Owner; // 0xe0
	FName NetDriverName; // 0xe8
	ENetRole Role; // 0xf0
	ENetDormancy NetDormancy; // 0xf1
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xf2
	EAutoReceiveInput AutoReceiveInput; // 0xf3
	int32_t InputPriority; // 0xf4
	UInputComponent* InputComponent; // 0xf8
	float NetCullDistanceSquared; // 0x100
	int32_t NetTag; // 0x104
	float NetUpdateFrequency; // 0x108
	float MinNetUpdateFrequency; // 0x10c
	float NetPriority; // 0x110
	APawn* Instigator; // 0x118
	TArray<AActor*> Children; // 0x120
	USceneComponent* RootComponent; // 0x130
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x138
	TArray<FName> Layers; // 0x150
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x160
	TArray<FName> Tags; // 0x170
	FMulticastSparseDelegate OnTakeAnyDamage; // 0x180
	FMulticastSparseDelegate OnTakePointDamage; // 0x181
	FMulticastSparseDelegate OnTakeRadialDamage; // 0x182
	FMulticastSparseDelegate OnActorBeginOverlap; // 0x183
	FMulticastSparseDelegate OnActorEndOverlap; // 0x184
	FMulticastSparseDelegate OnBeginCursorOver; // 0x185
	FMulticastSparseDelegate OnEndCursorOver; // 0x186
	FMulticastSparseDelegate OnClicked; // 0x187
	FMulticastSparseDelegate OnReleased; // 0x188
	FMulticastSparseDelegate OnInputTouchBegin; // 0x189
	FMulticastSparseDelegate OnInputTouchEnd; // 0x18a
	FMulticastSparseDelegate OnInputTouchEnter; // 0x18b
	FMulticastSparseDelegate OnInputTouchLeave; // 0x18c
	FMulticastSparseDelegate OnActorHit; // 0x18d
	FMulticastSparseDelegate OnDestroyed; // 0x18e
	FMulticastSparseDelegate OnEndPlay; // 0x18f
	TArray<UActorComponent*> InstanceComponents; // 0x1f0
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x200
};

struct UMaterialExpressionTransform : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialVectorCoordTransformSource TransformSourceType; // 0x54
	EMaterialVectorCoordTransform TransformType; // 0x55
};

struct AGroomActor : AActor {
	UGroomComponent* GroomComponent; // 0x220
};

struct UNiagaraDataInterfaceArrayFloat4 : UNiagaraDataInterfaceArray {
	TArray<FVector4> FloatData; // 0x50
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
	ANavigationData* NavigationDataToUpdate; // 0xb8
};

struct UInterpTrackColorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct UFishingReelAnimInstance : UAnimInstance {
	float _reelHandleRotationAnimationExplicitTime; // 0x2b8
	EPrisonerStance _owningPrisonerStance; // 0x2bc
	bool _isOwningPrisonerInFirstPersonView; // 0x2bd
	bool _isLocked; // 0x2be
	bool _isCasting; // 0x2bf
};

struct UInteractiveGizmo : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x30
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0xe0
	FVector FailsafeExtent; // 0xe8
	char bIncludeAgentHeight : 1; // 0xf4
};

struct UABP_UMP45_C : UWeaponAttachmentMagazineAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	FAnimNode_Root AnimGraphNode_Root; // 0x2e8
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x318
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x360
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x3a8
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x3f0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x438
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x4e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x510
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x538
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x560
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x600
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x6b0
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x6f8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x740
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x788
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x7b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x7d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x800
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x958
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x9f8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0xa78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0xb28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0xba8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0xc28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xca8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xd28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xda8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xec8
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct UMaterialExpressionIf : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput AGreaterThanB; // 0x68
	FExpressionInput AEqualsB; // 0x7c
	FExpressionInput ALessThanB; // 0x90
	float EqualsThreshold; // 0xa4
	float ConstB; // 0xa8
	float ConstAEqualsB; // 0xac
};

struct AVolumetricCloud : AInfo {
	UVolumetricCloudComponent* VolumetricCloudComponent; // 0x220
};

struct UMotoSynthPreset : UObject {
	FMotoSynthRuntimeSettings Settings; // 0x28
};

struct UPolygonSelectionMechanicProperties : UInteractiveToolPropertySet {
	bool bSelectFaces; // 0x60
	bool bSelectEdges; // 0x61
	bool bSelectVertices; // 0x62
	bool bPreferProjectedElement; // 0x63
	bool bSelectDownRay; // 0x64
	bool bIgnoreOcclusion; // 0x65
};

struct UMaterialExpressionSubtract : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UMaterialExpressionTextureCoordinate : UMaterialExpression {
	int32_t CoordinateIndex; // 0x40
	float UTiling; // 0x44
	float VTiling; // 0x48
	char UnMirrorU : 1; // 0x4c
	char UnMirrorV : 1; // 0x4c
};

struct ULoudnessNRT : UAudioSynesthesiaNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UFishSpawningPreset : UDataAsset {
	float SpawningChance; // 0x30
	TMap<EAquaticIndividualSize, float> SpawningChanceBySizeMultiplier; // 0x38
};

struct UPrisonerLifeIndicatorsSprite_C : UPrisonerLifeIndicatorsSprite {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* NewAnimation_2; // 0x2f8
	UImage* AbdomenInjury; // 0x300
	UImage* ArmLeftLowerInjury; // 0x308
	UImage* ArmLeftUpperInjury; // 0x310
	UImage* ArmRightLowerInjury; // 0x318
	UImage* ArmRightUpperInjury; // 0x320
	UScaleBox* BloodDropBox; // 0x328
	UImage* ChestInjury; // 0x330
	UCircularProgressBarSprites_C* CircularProgressBarSpritesAIPerception; // 0x338
	UCircularProgressBarSprites_C* CircularProgressBarSpritesHLTH; // 0x340
	UCircularProgressBarSprites_C* CircularProgressBarSpritesHYD; // 0x348
	UCircularProgressBarSprites_C* CircularProgressBarSpritesNoise; // 0x350
	UCircularProgressBarSprites_C* CircularProgressBarSpritesNRG; // 0x358
	UCircularProgressBarSprites_C* CircularProgressBarSpritesSTA; // 0x360
	UImage* HeadInjury; // 0x368
	UImage* Image_1; // 0x370
	UImage* Image_2; // 0x378
	UImage* LegLeftLowerInjury; // 0x380
	UImage* LegLeftUpperInjury; // 0x388
	UImage* LegRightLowerInjury; // 0x390
	UImage* LegRightUpperInjury; // 0x398
	UCanvasPanel* MPI_CanvasPanel; // 0x3a0
	APrisoner* _prisoner; // 0x3a8
	bool _isPrisonerSet; // 0x3b0
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UMetabolismMacronutrientReservesPanel : UUserWidget {
	UMetabolismMacronutrientReserve* _reserve_Protein; // 0x260
	UMetabolismMacronutrientReserve* _reserve_Carbs; // 0x268
	UMetabolismMacronutrientReserve* _reserve_Fat; // 0x270
	UMetabolismMacronutrientReserve* _reserve_Fiber; // 0x278
	UMetabolismMacronutrientReserve* _reserve_Sugar; // 0x280
	UMetabolismMacronutrientReserve* _reserve_SaturatedFat; // 0x288
	UMetabolismMacronutrientReserve* _reserve_Alcohol; // 0x290
};

struct UTimecodeProvider : UObject {
	float FrameDelay; // 0x28
};

struct UMeshSpaceDeformerTool : UMeshSurfacePointTool {
	ENonlinearOperationType SelectedOperationType; // 0xc0
	float UpperBoundsInterval; // 0xc4
	float LowerBoundsInterval; // 0xc8
	float ModifierPercent; // 0xcc
	bool bSnapToWorldGrid; // 0xd0
	UGizmoTransformChangeStateTarget* StateTarget; // 0xd8
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xe8
	FVector GizmoCenter; // 0x110
	FQuat GizmoOrientation; // 0x120
	UIntervalGizmo* IntervalGizmo; // 0x130
	UTransformGizmo* TransformGizmo; // 0x138
	UTransformProxy* TransformProxy; // 0x140
	UGizmoLocalFloatParameterSource* UpIntervalSource; // 0x148
	UGizmoLocalFloatParameterSource* DownIntervalSource; // 0x150
	UGizmoLocalFloatParameterSource* ForwardIntervalSource; // 0x158
};

struct UPrisonerBuryComponent : UCharacterActionComponent {
	EBuryState _buryState; // 0xc0
};

struct AWeaponAutoCrossbow : AWeapon {
	UWeaponStateFiring* FireState; // 0x2dd8
	float _muzzleVelocity; // 0x2de0
	float _probabilityForLaughingSoundEffect; // 0x2de4
	FCharacterAndItemAnimation _autoCrossbowFireAnimation; // 0x2de8
	UAkAudioEvent* _autoCrossbowLaughingAudioEvent; // 0x2df8
	UWeaponState* _autoCrossbowActiveState; // 0x2e00
	UGameResourceType* _fuelType; // 0x41a8
	FGameplayTagContainer _inFuelingSocketTypes; // 0x41b0
	float _maxFuelAmount; // 0x41d0
	float _fuelUsagePerHour; // 0x41d4
	float _fuelUsagePerHourWhenDamaged; // 0x41d8
	float _fuelFillingDurationPerAmountFilled; // 0x41dc
	float _fuelFillingDurationPerAmountFilledWhenDamaged; // 0x41e0
	float _fuelFillingExperiencePerAmount; // 0x41e4
	float _currentFuelAmount; // 0x41e8
};

struct UParticleModuleAccelerationOverLifetime : UParticleModuleAccelerationBase {
	FRawDistributionVector AccelOverLife; // 0x38
};

struct UMetabolismRadialAttributeProgressBar : UUserWidget {
	FMetabolismRadialAttributeProgressBarColor BackgroundColor; // 0x260
	FMetabolismRadialAttributeProgressBarColor BarColor; // 0x290
	FMetabolismRadialAttributeProgressBarColor BarGlowColor; // 0x2c0
	FMetabolismRadialAttributeProgressBarColor InnerGlowColor; // 0x2f0
	FMetabolismRadialAttributeProgressBarColor OuterGlowColor; // 0x320
	FMetabolismRadialAttributeProgressBarColor FontColor; // 0x350
	EDisposition PreviewState; // 0x380
	UImage* _coloredBackground; // 0x388
	UImage* _radialProgressBar; // 0x390
	URetainerBox* _fontEffectPass1; // 0x398
	URetainerBox* _fontEffectPass2; // 0x3a0
	UTextBlock* _attributeValueTextBlock; // 0x3a8
};

struct USafeZone : UContentWidget {
	bool PadLeft; // 0x120
	bool PadRight; // 0x121
	bool PadTop; // 0x122
	bool PadBottom; // 0x123
};

struct UCamouflageSkill : UIntelligenceSkill {
	float _activationTime; // 0xa8
	float _standingPenalty; // 0xac
	float _crouchingPenalty; // 0xb0
	float _pronePenalty; // 0xb4
	float _slowMovingStandingPenalty; // 0xb8
	float _slowMovingCrouchingPenalty; // 0xbc
	float _slowMovingPronePenalty; // 0xc0
	float _mediumMovingStandingPenalty; // 0xc4
	float _mediumMovingCrouchingPenalty; // 0xc8
	float _fastMovingStandingPenalty; // 0xcc
	float _standingAIPerceptionMultiplier; // 0xd0
	float _crouchingAIPerceptionMultiplier; // 0xd4
	float _proneAIPerceptionMultiplier; // 0xd8
	float _maxRelevantAIPerceptionRadius; // 0xdc
	FCamouflageSkillExperienceAwards NoSkillExperienceAwards; // 0x14c
	FCamouflageSkillExperienceAwards BasicSkillExperienceAwards; // 0x150
	FCamouflageSkillExperienceAwards MediumSkillExperienceAwards; // 0x154
	FCamouflageSkillExperienceAwards AdvancedSkillExperienceAwards; // 0x158
	FCamouflageSkillExperienceAwards AboveAdvancedSkillExperienceAwards; // 0x15c
	FCamouflageSkillParametersPerSkillLevel NoSkillParameters; // 0x160
	FCamouflageSkillParametersPerSkillLevel BasicSkillParameters; // 0x170
	FCamouflageSkillParametersPerSkillLevel MediumSkillParameters; // 0x180
	FCamouflageSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x190
	FCamouflageSkillParametersPerSkillLevel AboveAdvancedSkillParameters; // 0x1a0
};

struct UAnimNotify_WeaponActionNotify : UAnimNotify {
	EWeaponActionNotifyType WeaponActionNotifyType; // 0x38
};

struct UStreamableRenderAsset : UObject {
	double ForceMipLevelsToBeResidentTimestamp; // 0x40
	int32_t NumCinematicMipLevels; // 0x48
	int32_t StreamingIndex; // 0x4c
	int32_t CachedCombinedLODBias; // 0x50
	char NeverStream : 1; // 0x54
	char bGlobalForceMipLevelsToBeResident : 1; // 0x54
	char bHasStreamingUpdatePending : 1; // 0x54
	char bForceMiplevelsToBeResident : 1; // 0x54
	char bIgnoreStreamingMipBias : 1; // 0x54
	char bUseCinematicMipLevels : 1; // 0x54
};

struct ASwitchActor : AActor {
	USceneComponent* SceneComponent; // 0x238
	int32_t LastSelectedOption; // 0x240
};

struct UDcxVehicleNoDriveComponent : UDcxVehicleWheelsComponent {
	bool bUseRawInput; // 0x240
	float MaxDriveTorque; // 0x244
};

struct UEditPivotToolActionPropertySet : UInteractiveToolPropertySet {
	bool bUseWorldBox; // 0x68
};

struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle ButtonStyle; // 0x30
};

struct UVoxelMorphologyMeshesToolProperties : UInteractiveToolPropertySet {
	EMorphologyOperation Operation; // 0x60
	double Distance; // 0x68
	bool bSolidifyInput; // 0x70
	bool bRemoveInternalsAfterSolidify; // 0x71
	double OffsetSolidifySurface; // 0x78
};

struct UPrisonerDebugUI_SkillEntryWidget : UUserWidget {
	UTextBlock* _nameTextBlock; // 0x268
};

struct UMovieSceneVectorTrack : UMovieScenePropertyTrack {
	int32_t NumChannelsUsed; // 0xb0
};

struct AWorldEventManager : AActor {
	TArray<AWorldEvent*> EventTypes; // 0x220
	float TimeBetweenEventsMin; // 0x230
	float TimeBetweenEventsMax; // 0x234
	TArray<AWorldEvent*> _events; // 0x240
};

struct UM1887_InsertShellLoopEmpty_C : UInsertCartridge {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa0
	int32_t RequestedAmmoCount; // 0xa8
	int32_t InsertedAmmoCount; // 0xac
	bool FinalSectionReached; // 0xb0
};

struct UInventoryItemComponentState : UItemComponentStateBase {
	TArray<FDbIntegerId> ContainedElementsIds; // 0x40
	TArray<FInv2021_InventoryPosition2D> ContainedElementsPositions; // 0x50
	float ContainedItemsWeight; // 0x60
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UEditableTextBox : UWidget {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FEditableTextBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x928
	FText HintText; // 0x930
	FDelegate HintTextDelegate; // 0x948
	FSlateFontInfo Font; // 0x958
	FLinearColor ForegroundColor; // 0x9b0
	FLinearColor BackgroundColor; // 0x9c0
	FLinearColor ReadOnlyForegroundColor; // 0x9d0
	bool IsReadOnly; // 0x9e0
	bool IsPassword; // 0x9e1
	float MinimumDesiredWidth; // 0x9e4
	FMargin Padding; // 0x9e8
	bool IsCaretMovedWhenGainFocus; // 0x9f8
	bool SelectAllTextWhenFocused; // 0x9f9
	bool RevertTextOnEscape; // 0x9fa
	bool ClearKeyboardFocusOnCommit; // 0x9fb
	bool SelectAllTextOnCommit; // 0x9fc
	bool AllowContextMenu; // 0x9fd
	EVirtualKeyboardType KeyboardType; // 0x9fe
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9ff
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa00
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa01
	ETextJustify Justification; // 0xa02
	FShapedTextOptions ShapedTextOptions; // 0xa03
	FMulticastInlineDelegate OnTextChanged; // 0xa08
	FMulticastInlineDelegate OnTextCommitted; // 0xa18
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UWaterSplineComponent : USplineComponent {
	FWaterSplineCurveDefaults WaterSplineDefaults; // 0x540
	FWaterSplineCurveDefaults PreviousWaterSplineDefaults; // 0x550
};

struct UProceduralCylinderToolProperties : UProceduralShapeToolProperties {
	float Radius; // 0x70
	float Height; // 0x74
	int32_t RadialSlices; // 0x78
	int32_t HeightSubdivisions; // 0x7c
};

struct USubmixEffectStereoDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct UWeaponActionReloadSequence : UWeaponAction {
	FBodyWeaponAnimation AnimationStandAndCrouch; // 0x28
	FBodyWeaponAnimation AnimationProne; // 0x38
	bool CanBeInterrupted; // 0x48
};

struct ADrone : AConZCharacter {
	UAkAudioEvent* _engineAudioEvent; // 0x798
	UAkAudioEvent* _engineStopAudioEvent; // 0x7a0
	TArray<float> _speedSteps; // 0x7a8
	float _movementInertiaAI; // 0x7b8
	float _movementRotationSpeedExpFactor; // 0x7bc
	float _engineParticlesChangeSpeedExpFactor; // 0x7c0
	UCurveFloat* _engineVolumeFromSpeed; // 0x7c8
	float _movementBreathingInterval; // 0x7d0
	float _movementBreathingIntensity; // 0x7d4
	UParticleSystem* _selfDestructParticles; // 0x7d8
	UParticleSystem* _smokeParticles; // 0x7e0
	UParticleSystemComponent* _smokeParticleSystemComponent; // 0x7e8
	UAkAudioEvent* _selfDestructAudioEvent; // 0x7f0
	char _currentSpeedStep; // 0x810
	float _movementInertia; // 0x814
	UStaticMeshComponent* _cameraMesh; // 0x820
	UParticleSystemComponent* _engineParticlesM; // 0x828
	UParticleSystemComponent* _engineParticlesML; // 0x830
	UParticleSystemComponent* _engineParticlesMR; // 0x838
	UParticleSystemComponent* _engineParticlesLL; // 0x840
	UParticleSystemComponent* _engineParticlesLR; // 0x848
	USpotLightComponent* _lightComponent; // 0x850
	float _health; // 0x894
};

struct UAddPatchTool : USingleClickTool {
	UAddPatchToolProperties* ShapeSettings; // 0x90
	UNewMeshMaterialProperties* MaterialProperties; // 0x98
	UPreviewMesh* PreviewMesh; // 0xa0
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x9c
	FSubmixEffectDelaySettings DynamicSettings; // 0xa8
};

struct UDropdownMenuWidget : UUserWidget {
	FDelegate OnUpdate; // 0x260
	UNamedSlot* _panelSlot; // 0x278
};

struct UEmblemData : UDataAsset {
	TArray<UTexture2D*> BackgroundTextures; // 0x30
	TArray<UTexture2D*> SymbolTextures; // 0x40
	TArray<FLinearColor> ColorPalette; // 0x50
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct UInvalidationBox : UContentWidget {
	bool bCanCache; // 0x120
	bool CacheRelativeTransforms; // 0x121
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x258
	TArray<UAssetUserData*> AssetUserData; // 0x268
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x288
};

struct AConZGameMode : AGameMode {
	UDoorLockingRegistry* _doorLockingRegistry; // 0x338
	APrisoner* _prisonerClassToSpawn; // 0x340
	ADrone* _droneClassToSpawn; // 0x348
	AItemSpawningManager* _itemSpawningManagerClass; // 0x460
	AItemSpawningManager* _itemSpawningManager; // 0x468
	AItemVirtualizationManager* _itemVirtualizationManagerClass; // 0x470
	AItemVirtualizationManager* _itemVirtualizationManager; // 0x478
	AGlobalAnimalSpawner* _globalAnimalSpawner; // 0x480
	AGlobalBirdSpawner2* _globalBirdSpawner; // 0x488
	AVehicleSpawningManager* _vehicleSpawningManagerClass; // 0x490
	AVehicleSpawningManager* _vehicleSpawningManager; // 0x498
	AReportingManager* _reportingManagerClass; // 0x4a0
	AReportingManager* _reportingManager; // 0x4a8
	ACharacterSpawningManager* _characterSpawningManagerClass; // 0x4b0
	ACharacterSpawningManager* _characterSpawningManager; // 0x4b8
	AGlobalAquaticLifeManager* _globalAquaticLifeManagerClass; // 0x4c0
	AGlobalAquaticLifeManager* _globalAquaticLifeManager; // 0x4c8
	AGlobalGuardedZoneManager* _globalGuardedZoneManagerClass; // 0x4d0
	AGlobalGuardedZoneManager* _globalGuardedZoneManager; // 0x4d8
	AAchievementsManagerServer* _achievementsManagerServerClass; // 0x4e0
	AAchievementsManagerServer* _achievementsManagerServer; // 0x4e8
	AMissionLevelManager* _missionLevelManagerClass; // 0x4f0
	AMissionLevelManager* _missionLevelManager; // 0x4f8
	AMissionScheduler* _missionSchedulerClass; // 0x500
	AMissionScheduler* _missionScheduler; // 0x508
	ASurvivalStatsHandler* _survivalStatsHandlerClass; // 0x510
	ASurvivalStatsHandler* _survivalStatsHandler; // 0x518
	AHeatSourceManager* _heatSourceManagerClass; // 0x520
	AHeatSourceManager* _heatSourceManager; // 0x528
	AConZBaseManager* _baseManagerClass; // 0x530
	AConZBaseManager* _baseManager; // 0x538
	URainCollectionManager* _rainCollectionManager; // 0x540
	ALadderMarkersReplicator* _ladderMarkersReplicatorClass; // 0x548
	ALadderMarkersReplicator* _ladderMarkersReplicator; // 0x550
	AEffectOverTimeDealer* _effectOverTimeDealerClass; // 0x558
	AEffectOverTimeDealer* _effectOverTimeDealer; // 0x560
	ANotificationsManager* _notificationManagerClass; // 0x568
	ANotificationsManager* _notificationManager; // 0x570
	AVoteSystemManager* _voteSystemManagerClass; // 0x578
	AVoteSystemManager* _voteSystemManager; // 0x580
	AServerAnalyticsManager* _serverAnalyticsManagerClass; // 0x588
	AServerAnalyticsManager* _serverAnalyticsManager; // 0x590
	AAIDetectionTimerHandler* _aiDetectionTimerHandlerClass; // 0x598
	AAIDetectionTimerHandler* _aiDetectionTimerHandler; // 0x5a0
	UDedicatedServerResponse* _serverResponse; // 0x5a8
};

struct UExplosiveProtectionItemComponent : UItemComponent {
	AMinigame* _minigameClass; // 0xc0
	UBaseItemTag* _minigameToolTag; // 0xc8
	FLockData _lockData; // 0xd0
	UParticleSystem* _explosionParticles; // 0x158
	FVector _explosionParticlesLocation; // 0x160
	UAkAudioEvent* _explosionAudioEvent; // 0x170
	float _explosionBaseDamage; // 0x178
	float _explosionMinimalDamage; // 0x17c
	float _explosionDamagePositionOffset; // 0x180
	float _explosionDamageFalloff; // 0x184
	float _explosionInnerRadius; // 0x188
	float _explosionOuterRadius; // 0x18c
	float _hearingDamageRadius; // 0x190
	UMatineeCameraShake* _explosionCameraShakeClass; // 0x198
	bool _isArmed; // 0x1a0
};

struct UReplicationGraphNode_AlwaysRelevant : UReplicationGraphNode {
	UReplicationGraphNode* ChildNode; // 0x50
};

struct UClothLODDataCommon_Legacy : UObject {
	UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData; // 0x28
	FClothPhysicalMeshData ClothPhysicalMeshData; // 0x30
	FClothCollisionData CollisionData; // 0x128
};

struct UMeleeSkillAnimationsPreset : UDataAsset {
	FMeleeSkillAnimations NoSkillAnimations; // 0x30
	FMeleeSkillAnimations BasicSkillAnimations; // 0xc8
	FMeleeSkillAnimations MediumSkillAnimations; // 0x160
	FMeleeSkillAnimations AdvancedSkillAnimations; // 0x1f8
	FMeleeSkillParametersPerSkillLevel NoSkillParameters; // 0x290
	FMeleeSkillParametersPerSkillLevel BasicSkillParameters; // 0x318
	FMeleeSkillParametersPerSkillLevel MediumSkillParameters; // 0x3a0
	FMeleeSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x428
	float NoSkillDamageMultiplier; // 0x4b0
	float BasicSkillDamageMultiplier; // 0x4b4
	float MediumSkillDamageMultiplier; // 0x4b8
	float AdvancedSkillDamageMultiplier; // 0x4bc
	float AboveAdvancedSkillDamageMultiplier; // 0x4c0
};

struct ANotificationsManager : AActor {
	TMap<FDbIntegerId, UNotificationDescription*> _queuedNotifications; // 0x220
	int64_t _notificationTimeout; // 0x2c0
};

struct AStaticMeshActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	bool bStaticMeshReplicateMovement; // 0x228
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x229
};

struct UObjectiveItemWidget : UUserWidget {
	UTextBlock* _objectiveItemText; // 0x260
	UImage* _bullet; // 0x268
	UImage* _bulletCompleted; // 0x270
	FLinearColor _objectiveActiveColor; // 0x278
	FLinearColor _objectiveCompletedColor; // 0x288
	FLinearColor _objectiveFailedColor; // 0x298
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UNavigationGraphNodeComponent : USceneComponent {
	FNavGraphNode Node; // 0x1f8
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x210
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x218
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	bool bDisplayHelpInAutoComplete; // 0x55
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x220
	USceneComponent* SceneComponent; // 0x228
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct AIntervalGizmoActor : AGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x220
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x228
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x230
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x60
};

struct UInteractionContainerUserWidget : UDesignableUserWidget {
	UVerticalBox* _actionContainer; // 0x290
	TWeakObjectPtr<AActor> _underlyingInteractableActor; // 0x2a4
};

struct UDialogueWave : UObject {
	char bMature : 1; // 0x28
	char bOverride_SubtitleOverride : 1; // 0x28
	FString SpokenText; // 0x30
	FString SubtitleOverride; // 0x40
	TArray<FDialogueContextMapping> ContextMappings; // 0x50
	FGuid LocalizationGUID; // 0x60
};

struct ASlidingDoorDestructible : ADoor {
	USceneComponent* ClosedPositionComponent; // 0x408
	USceneComponent* OpenPositionComponent; // 0x410
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UTabButton : UUserWidget {
	bool PreviewSelectedState; // 0x2c8
	UButton* _button; // 0x2d0
	UTextBlock* _text; // 0x2d8
	USizeBox* _sizeBox; // 0x2e0
	FText _initialTitle; // 0x2e8
	FTabButtonStyle _selectedButtonStyle; // 0x300
	FTabButtonStyle _selectedUnfocusedButtonStyle; // 0x588
	FTabButtonStyle _deselectedButtonStyle; // 0x810
	FTabTextStyle _selectedTextStyle; // 0xa98
	FTabTextStyle _selectedUnfocusedTextStyle; // 0xb30
	FTabTextStyle _deselectedTextStyle; // 0xbc8
};

struct AWaterMeshActor : AActor {
	UTexture2D* WaterVelocityTexture; // 0x220
	UWaterMeshComponent* WaterMesh; // 0x228
};

struct AAnimalContinuousChargeAttackAIController : AComplexAnimalAIController {
	float LockAttackDirectionDistance; // 0x4d8
	float ContinueAttackDistance; // 0x4dc
};

struct UABP_Prisoner_SpineLeaning_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x2f8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x410
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x518
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x620
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x728
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x830
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x938
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x958
	float LeanAmount; // 0x978
	float Spine1LeanAngle; // 0x97c
	float Spine2LeanAngle; // 0x980
	float Spine3LeanAngle; // 0x984
	float RibcageLeanAngle; // 0x988
};

struct UUI_PlacedPlaceablesWidget_C : UPlacedPlaceableWidget {
	TArray<UUI_PlacedPlaceableIcon_C*> _icons; // 0x2d0
	int32_t _placeableIndex; // 0x2e0
};

struct UCraftingAvailableItemWidget : UDesignableUserWidget {
	FMulticastInlineDelegate OnClicked; // 0x278
	bool _isSelected; // 0x288
	bool _isOptional; // 0x289
	EOptionalState _optionalState; // 0x28a
	AItem* _item; // 0x290
	UAkAudioEvent* _clickSound; // 0x298
};

struct UVehicle2WDriverMountSlot : UVehicle2WMountSlot {
	UBlendSpace* _forwardIdleAnimation; // 0x148
	UAnimSequenceBase* _forwardSteeringAnimation; // 0x150
	UAnimSequenceBase* _forwardSteeringAnimationFP; // 0x158
	UBlendSpace* _reverseIdleAnimation; // 0x160
	UAnimSequenceBase* _reverseSteeringAnimation; // 0x168
	UAnimSequenceBase* _reverseSteeringAnimationFP; // 0x170
	UAnimSequence* _standUpStartAnimation; // 0x178
	UAnimSequence* _standUpLoopAnimation; // 0x180
	UAnimSequence* _standUpEndAnimation; // 0x188
	UAnimSequence* _startEngineStartAnimation; // 0x190
	UAnimSequence* _startEngineLoopAnimation; // 0x198
	UAnimSequence* _startEngineLongLoopAnimation; // 0x1a0
	UAnimSequence* _startEngineEndAnimation; // 0x1a8
};

struct UGrappleActionComponent : UActorComponent {
	AConZCharacter* _grappler; // 0xb0
	APrisoner* _prisonerVictim; // 0xb8
	UGrappleActionParameters* _grappleActionParameters; // 0xc0
};

struct UPrisonerBodyConditionOrSymptomSideEffect_DoubleVision : UPrisonerBodyConditionOrSymptomSideEffect {
	UPrisonerBodySymptom_DoubleVision* _symptomClass; // 0x30
	UPrisonerBodySymptomCause_DoubleVision* _symptomCause; // 0x38
	FRuntimeFloatCurve _intensityVsSeverity; // 0x40
};

struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x200
	bool UseHLODMinDrawDistance; // 0x204
	float LDMaxDrawDistance; // 0x208
	float CachedMaxDrawDistance; // 0x20c
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x210
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x211
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x212
	ELightmapType LightmapType; // 0x213
	char bUseMaxLODAsImposter : 1; // 0x214
	char bBatchImpostersAsInstances : 1; // 0x214
	char bNeverDistanceCull : 1; // 0x214
	char bAlwaysCreatePhysicsState : 1; // 0x214
	char bGenerateOverlapEvents : 1; // 0x215
	char bMultiBodyOverlap : 1; // 0x215
	char bTraceComplexOnMove : 1; // 0x215
	char bReturnMaterialOnMove : 1; // 0x215
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x215
	char bAllowCullDistanceVolume : 1; // 0x215
	char bHasMotionBlurVelocityMeshes : 1; // 0x215
	char bVisibleInReflectionCaptures : 1; // 0x215
	char bVisibleInRealTimeSkyCaptures : 1; // 0x216
	char bVisibleInRayTracing : 1; // 0x216
	char bRenderInMainPass : 1; // 0x216
	char bRenderInDepthPass : 1; // 0x216
	char bReceivesDecals : 1; // 0x216
	char bOwnerNoSee : 1; // 0x216
	char bOnlyOwnerSee : 1; // 0x216
	char bTreatAsBackgroundForOcclusion : 1; // 0x216
	char bUseAsOccluder : 1; // 0x217
	char bSelectable : 1; // 0x217
	char bForceMipStreaming : 1; // 0x217
	char bHasPerInstanceHitProxies : 1; // 0x217
	char CastShadow : 1; // 0x217
	char bAffectDynamicIndirectLighting : 1; // 0x217
	char bAffectDistanceFieldLighting : 1; // 0x217
	char bCastDynamicShadow : 1; // 0x217
	char bCastStaticShadow : 1; // 0x218
	char bCastVolumetricTranslucentShadow : 1; // 0x218
	char bCastContactShadow : 1; // 0x218
	char bSelfShadowOnly : 1; // 0x218
	char bCastFarShadow : 1; // 0x218
	char bCastInsetShadow : 1; // 0x218
	char bCastCinematicShadow : 1; // 0x218
	char bCastHiddenShadow : 1; // 0x218
	char bCastShadowAsTwoSided : 1; // 0x219
	char bLightAsIfStatic : 1; // 0x219
	char bLightAttachmentsAsGroup : 1; // 0x219
	char bExcludeFromLightAttachmentGroup : 1; // 0x219
	char bReceiveMobileCSMShadows : 1; // 0x219
	char bSingleSampleShadowFromStationaryLights : 1; // 0x219
	char bIgnoreRadialImpulse : 1; // 0x219
	char bIgnoreRadialForce : 1; // 0x219
	char bApplyImpulseOnDamage : 1; // 0x21a
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x21a
	char bFillCollisionUnderneathForNavmesh : 1; // 0x21a
	char AlwaysLoadOnClient : 1; // 0x21a
	char AlwaysLoadOnServer : 1; // 0x21a
	char bUseEditorCompositing : 1; // 0x21a
	char bRenderCustomDepth : 1; // 0x21a
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x21b
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x21d
	FLightingChannels LightingChannels; // 0x21e
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x21f
	int32_t CustomDepthStencilValue; // 0x220
	FCustomPrimitiveData CustomPrimitiveData; // 0x228
	FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x238
	int32_t TranslucencySortPriority; // 0x250
	int32_t VisibilityId; // 0x254
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x258
	int8_t VirtualTextureLodBias; // 0x268
	int8_t VirtualTextureCullMips; // 0x269
	int8_t VirtualTextureMinCoverage; // 0x26a
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x26b
	float LpvBiasMultiplier; // 0x270
	float BoundsScale; // 0x27c
	TArray<AActor*> MoveIgnoreActors; // 0x290
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2a0
	FBodyInstance BodyInstance; // 0x2c0
	FMulticastSparseDelegate OnComponentHit; // 0x418
	FMulticastSparseDelegate OnComponentBeginOverlap; // 0x419
	FMulticastSparseDelegate OnComponentEndOverlap; // 0x41a
	FMulticastSparseDelegate OnComponentWake; // 0x41b
	FMulticastSparseDelegate OnComponentSleep; // 0x41c
	FMulticastSparseDelegate OnBeginCursorOver; // 0x41e
	FMulticastSparseDelegate OnEndCursorOver; // 0x41f
	FMulticastSparseDelegate OnClicked; // 0x420
	FMulticastSparseDelegate OnReleased; // 0x421
	FMulticastSparseDelegate OnInputTouchBegin; // 0x422
	FMulticastSparseDelegate OnInputTouchEnd; // 0x423
	FMulticastSparseDelegate OnInputTouchEnter; // 0x424
	FMulticastSparseDelegate OnInputTouchLeave; // 0x425
	UPrimitiveComponent* LODParentPrimitive; // 0x440
};

struct UUI_CraftingComponent_C : UCraftingComponentWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UTextBlock* CountText; // 0x2a8
	UImage* OptionalBackgroundImage; // 0x2b0
	UTextBlock* OrderNumberText; // 0x2b8
	UImage* TypeImage; // 0x2c0
	UUI_Border_C* UI_Border; // 0x2c8
	bool isOptional; // 0x2d0
};

struct UBakedCurvatureMapToolProperties : UInteractiveToolPropertySet {
	EBakedCurvatureTypeMode CurvatureType; // 0x60
	EBakedCurvatureColorMode ColorMode; // 0x64
	float RangeMultiplier; // 0x68
	float MinRangeMultiplier; // 0x6c
	EBakedCurvatureClampMode Clamping; // 0x70
	bool bGaussianBlur; // 0x74
	float BlurRadius; // 0x78
};

struct UBakeMeshAttributeMapsTool : UMultiSelectionTool {
	UBakeMeshAttributeMapsToolProperties* Settings; // 0x90
	UBakedNormalMapToolProperties* NormalMapProps; // 0x98
	UBakedOcclusionMapToolProperties* OcclusionMapProps; // 0xa0
	UBakedCurvatureMapToolProperties* CurvatureMapProps; // 0xa8
	UBakedTexture2DImageProperties* Texture2DProps; // 0xb0
	UBakedOcclusionMapVisualizationProperties* VisualizationProps; // 0xb8
	UMaterialInstanceDynamic* PreviewMaterial; // 0xd0
	UTexture2D* CachedNormalMap; // 0x430
	UTexture2D* CachedOcclusionMap; // 0x450
	UTexture2D* CachedCurvatureMap; // 0x480
	UTexture2D* CachedMeshPropertyMap; // 0x498
	UTexture2D* CachedTexture2DImageMap; // 0x4b0
	UTexture2D* EmptyNormalMap; // 0x4b8
	UTexture2D* EmptyColorMapBlack; // 0x4c0
	UTexture2D* EmptyColorMapWhite; // 0x4c8
};

struct UPolyEditExtrudeProperties : UInteractiveToolPropertySet {
	EPolyEditExtrudeDirection Direction; // 0x60
	bool bShellsToSolids; // 0x64
};

struct AFireplace1_C : AFireplaceItem {
	UBoxComponent* BoxCollider; // 0x8a0
	UPointLightComponent* PointLight; // 0x8a8
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct AWaterBodyLake : AWaterBody {
	ULakeGenerator* LakeGenerator; // 0xdd0
};

struct UPrisonerBodySimulationData : UDataAsset {
	FRuntimeFloatCurve StrengthGainPerHourOfActivityVsStrength; // 0x30
	float StrengthLossPerMissingProtein; // 0xb8
	float ConstitutionGainPerKilometerMoved; // 0xbc
	float ConstitutionLossPerHourOfNotMoving; // 0xc0
	float DexterityChangePerStorageFatEnergy; // 0xc4
	float MaxBleedingSeverity; // 0xc8
	FFloatInterval BleedOutDurationVsBleedingSeverity; // 0xcc
	FFloatInterval BleedOutDurationMultiplierVsConstitution; // 0xd4
	FRuntimeFloatCurve DamageRatioVsBloodLossRatio; // 0xe0
	FRuntimeFloatCurve HealingSpeedMultiplierVsActionDifficultyRatio; // 0x168
	FPrisonerActionDifficultyCurve StaminaChangeRateVsActionDifficulty; // 0x1f0
	FPrisonerActionDifficultyCurve HeartRateRatioVsActionDifficulty; // 0x208
	float HeartRateRaiseInterpSpeed; // 0x220
	float HeartRateFallRate; // 0x224
	float BreathingRateInterpSpeed; // 0x228
	FPrisonerActionDifficultyCurve OxygenSaturationRaiseRateVsActionDifficutly; // 0x22c
	FPrisonerActionDifficultyCurve OxygenSaturationFallRateVsActionDifficutly; // 0x244
	float PreferredEnvironmentTemperatureWhenNaked; // 0x25c
	float BodyHeatGroupWeight[0x5]; // 0x260
	FPrisonerBodySimulationData_BodyHeatGroupClothesLayerFactors BodyHeatGroupClothesLayerFactors[0x5]; // 0x278
	UMetabolism* MetabolismClass; // 0x2c8
	float MetabolismUpdateInterval; // 0x2d0
	float CaloriesConsumptionMultiplier; // 0x2d4
	FRuntimeFloatCurve CaloriesConsumptionMultiplierVsHeartRateRatio; // 0x2d8
	float WaterConsumptionMultiplier; // 0x360
	FRuntimeFloatCurve WaterConsumptionMultiplierVsHeartRateRatio; // 0x368
	FFloatInterval NutrientsConsumptionFactorVsConstitutionRatio; // 0x3f0
	FFloatInterval ConsumptionDurationMultiplierVsEatingSpeed; // 0x3f8
	float StomachFullnessToBeAbleToVomit; // 0x400
	float BladderFullnessToBeAbleToUrinate; // 0x404
	float ColonFullnessToBeAbleToDefecate; // 0x408
	float ColonWaterContentRatioToHaveDiarrhea; // 0x40c
	FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRanges DigestionHandlersPerConsumableHealthRatios; // 0x410
	FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRanges DigestionHandlersPerConsumableFatsContentRatios; // 0x420
	TMap<ENutrient, FPrisonerBodySimulationData_ConsumableDigestionHandlersForValueRanges> DigestionHandlersPerConsumableNutrientContentRatios; // 0x430
	FPrisonerBodySimulationData_Effects Effects; // 0x480
};

struct UAnimal2SoundComponent : UCharacterSoundComponent {
	UAkAudioEvent* IdleAudioEvent; // 0xd8
	UAkAudioEvent* AngryAudioEvent; // 0xe0
	UAkAudioEvent* AttackAudioEvent; // 0xe8
	UAkAudioEvent* ScaredAudioEvent; // 0xf0
	UAkAudioEvent* AlertedAudioEvent; // 0xf8
	UAkAudioEvent* TakeDamageAudioEvent; // 0x100
	UAkAudioEvent* KillAudioEvent; // 0x108
	UAkAudioEvent* AnimalFootstep; // 0x110
	float FootstepSoundOverlap; // 0x118
	float FixedFootstepVolume; // 0x11c
	float SpeedFootstepVolume; // 0x120
	float MinSilenceTimeout; // 0x124
	float MaxSilenceTimeout; // 0x128
};

struct UTransformMeshesTool : UMultiSelectionTool {
	UTransformMeshesToolProperties* TransformProps; // 0x98
	TArray<FTransformMeshesTarget> ActiveGizmos; // 0xb0
};

struct USoundNotificationDescription : UNotificationDescription {
	UAkAudioEvent* AudioEvent; // 0x40
	AActor* Actor; // 0x48
	bool stopWhenAttachedToDestroyed; // 0x50
};

struct USubsurfaceProfile : UObject {
	FSubsurfaceProfileStruct Settings; // 0x28
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	char bAllowDifferentItemTypes : 1; // 0x60
	char bHasMatchingItemType : 1; // 0x60
	UEnvQueryItemType* ForcedItemType; // 0x68
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct UMonitoredWindowsContent_C : UWindowsContent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b8
	APrisoner* _prisoner; // 0x2c0
	bool _isPrisonerSet; // 0x2c8
	FTimerHandle _updateContentTimer; // 0x2d0
	bool HasToolTip; // 0x2d8
	FText ToolTip; // 0x2e0
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct UPhysicsSpringComponent : USceneComponent {
	float SpringStiffness; // 0x1f8
	float SpringDamping; // 0x1fc
	float SpringLengthAtRest; // 0x200
	float SpringRadius; // 0x204
	ECollisionChannel SpringChannel; // 0x208
	bool bIgnoreSelf; // 0x209
	float SpringCompression; // 0x20c
};

struct UAnimBP_M1887_C : UWeaponAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	FAnimNode_Root AnimGraphNode_Root; // 0x308
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x338
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x380
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x3c8
	FAnimNode_Slot AnimGraphNode_Slot; // 0x410
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x458
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x508
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x660
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x688
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x6b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x6d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x758
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7f8
};

struct USmoothFillBrushOpProps : UBaseSmoothBrushOpProps {
	float Strength; // 0x60
	float Falloff; // 0x64
	bool bPreserveUVFlow; // 0x68
};

struct UMaterialExpressionCrossProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct USoundNode : UObject {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UBehaviorTreeComponent : UBrainComponent {
	TArray<UBTNode*> NodeInstances; // 0x128
	UBehaviorTree* DefaultBehaviorTreeAsset; // 0x278
};

struct UCharacterAction : UObject {
	TArray<UCharacterActionDescription*> PreActionsDescriptions; // 0x58
	TArray<UCharacterActionDescription*> PostActionsDescriptions; // 0x68
	UCharacterAction* ParentAction; // 0x78
	TArray<UCharacterAction*> _preActions; // 0x80
	TArray<UCharacterAction*> _postActions; // 0x90
	UActionProgressWidget* _progressWidget; // 0xa0
	UCharacterActionDescription* _description; // 0xb0
};

struct UMIDIDeviceController : UObject {
	FMulticastInlineDelegate OnMidiEvent; // 0x28
	int32_t DeviceID; // 0x38
	FString DeviceName; // 0x40
};

struct UNiagaraDataInterfacePhysicsAsset : UNiagaraDataInterface {
	UPhysicsAsset* DefaultSource; // 0x38
	AActor* SourceActor; // 0x40
};

struct UEdgeLoopInsertionOperatorFactory : UObject {
	UEdgeLoopInsertionTool* Tool; // 0x30
};

struct UNiagaraEffectType : UObject {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	UNiagaraSignificanceHandler* SignificanceHandler; // 0x30
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x38
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x48
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x58
};

struct AWaterBodyOcean : AWaterBody {
	UOceanGenerator* OceanGenerator; // 0xdd0
	FVector CollisionExtents; // 0xdd8
	float HeightOffset; // 0xde4
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct UNiagaraParameterCollection : UObject {
	FName Namespace; // 0x28
	TArray<FNiagaraVariable> parameters; // 0x30
	UMaterialParameterCollection* SourceMaterialCollection; // 0x40
	UNiagaraParameterCollectionInstance* DefaultInstance; // 0x48
	FGuid CompileId; // 0x50
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct UDoorUnlockData : UObject {
	EDoorUnlockDataType Type; // 0x28
	FString Description; // 0x30
};

struct UTraderSellListEntry : UUserWidget {
	UImage* _entryIcon; // 0x260
	UImage* _deselectionForeground; // 0x268
	UTextBlock* _entryCaption; // 0x270
	UWidgetSwitcher* _buttonSwitcher; // 0x278
	UButton* _btnCancel; // 0x280
	UButton* _btnConfirm; // 0x288
};

struct UCSGMeshesTool : UBaseCreateFromSelectedTool {
	UCSGMeshesToolProperties* CSGProperties; // 0xf0
	ULineSetComponent* DrawnLineSet; // 0x108
};

struct UMovieSceneSubTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UWeaponDamageGroup : UDataAsset {
	float Head; // 0x30
	float Neck; // 0x34
	float Torso; // 0x38
	float ArmUpper; // 0x3c
	float Abdomen; // 0x40
	float LegUpper; // 0x44
	float OtherLimbs; // 0x48
};

struct UNiagaraDataInterfaceVector2DCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
};

struct UPolyEditInsetProperties : UInteractiveToolPropertySet {
	bool bReproject; // 0x60
	float Softness; // 0x64
	bool bBoundaryOnly; // 0x68
	float AreaScale; // 0x6c
};

struct UModularTooltip : UUserWidget {
	UModularTooltipSection* _sectionClass; // 0x260
	UTextBlock* _descriptionTextBlock; // 0x268
	UVerticalBox* _sectionsVerticalBox; // 0x270
	UTextBlock* _advancedDisplayHintTextBlock; // 0x278
};

struct UTradeablePricesRequest : UPlayerRpcChannelServerDataRequest {
	TArray<UObject*> _tradeableClasses; // 0x30
};

struct UTradeablePricesResponse : UPlayerRpcChannelServerDataResponse {
	TArray<FEconomyManagerRequestResponseData> _payload; // 0x28
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x448
	int32_t SectionBaseY; // 0x44c
	int32_t ComponentSizeQuads; // 0x450
	int32_t SubsectionSizeQuads; // 0x454
	int32_t NumSubsections; // 0x458
	UMaterialInterface* OverrideMaterial; // 0x460
	UMaterialInterface* OverrideHoleMaterial; // 0x468
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x470
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x480
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x490
	TArray<int8_t> LODIndexToMaterialIndex; // 0x4a0
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4b0
	UTexture2D* XYOffsetmapTexture; // 0x4c0
	FVector4 WeightmapScaleBias; // 0x4d0
	float WeightmapSubsectionOffset; // 0x4e0
	FVector4 HeightmapScaleBias; // 0x4f0
	FBox CachedLocalBox; // 0x500
	LazyObjectProperty CollisionComponent; // 0x51c
	UTexture2D* HeightmapTexture; // 0x538
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x540
	TArray<UTexture2D*> WeightmapTextures; // 0x550
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x560
	FGuid MapBuildDataId; // 0x568
	TArray<FGuid> IrrelevantLights; // 0x578
	int32_t CollisionMipLevel; // 0x588
	int32_t SimpleCollisionMipLevel; // 0x58c
	float NegativeZBoundsExtension; // 0x590
	float PositiveZBoundsExtension; // 0x594
	float StaticLightingResolution; // 0x598
	int32_t ForcedLOD; // 0x59c
	int32_t LODBias; // 0x5a0
	FGuid StateId; // 0x5a4
	FGuid BakedTextureMaterialGuid; // 0x5b4
	UTexture2D* GIBakedBaseColorTexture; // 0x5c8
	char MobileBlendableLayerMask; // 0x5d0
	UMaterialInterface* MobileMaterialInterface; // 0x5d8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5e0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5f0
};

struct UBaseBrushTool : UMeshSurfacePointTool {
	UBrushBaseProperties* BrushProperties; // 0xc0
	bool bInBrushStroke; // 0xc8
	float WorldToLocalScale; // 0xcc
	FBrushStampData LastBrushStamp; // 0xd0
	TSoftClassPtr<UObject> PropertyClass; // 0x190
	UBrushStampIndicator* BrushStampIndicator; // 0x1b8
};

struct ASledge : AItem {
	UVehicleCameraStabilizerComponent* _cameraStabilizer; // 0x7c8
	FVehicleSpawnParameters _spawnParameters; // 0x7d0
	TArray<USledgeMountSlot*> _mountSlots; // 0x800
	float _floorTraceDistance; // 0x89c
	float _tiltAngleToUnmountMountees; // 0x8a0
	float _accelerationForceMagnitude; // 0x8a8
	float _decelerationForceMagnitude; // 0x8ac
	float _steeringForceMagnitude; // 0x8b0
	FVector _steeringForceOffset; // 0x8b4
	float _sidewaysBrakingForceMagnitude; // 0x8c0
	UCurveFloat* _dragForceMagnitudeVsSpeed; // 0x8c8
	UCurveFloat* _maxSpeedVsGroundSlopeAngle; // 0x8d0
	UPhysicsAsset* _physicsAssetWhenBoarded; // 0x8d8
	UParticleSystem* _defaultMovementParticleSystem; // 0x8e0
	TMap<UPhysicalMaterial*, UParticleSystem*> _movementParticleSystems; // 0x8e8
	float _movementParticlesActivationSpeed; // 0x938
	float _movementParticlesDeleteDelay; // 0x93c
	float _rigidBodyStatePositionErrorTolerance; // 0x940
	float _rigidBodyStateRotationErrorTolerance; // 0x944
	float _distanceErrorToHardSnapToRemoteLocation; // 0x948
	UAkAudioEvent* _sledgeMovementStartAudioEvent; // 0x950
	UAkAudioEvent* _sledgeMovementStopAudioEvent; // 0x958
	float _velocityUpdateInterval; // 0x960
	float _maxSledgeEnterAngle; // 0x964
	float _allowedWaterImmersionDepth; // 0x968
	float _disallowedWaterImmersionDepth; // 0x96c
	float _waterImmersionDepthToForceEvictMountees; // 0x970
	float _timeToEvictMounteesWhenImmersedIntoWater; // 0x974
	float _timeToForceEvictMounteesWhenImmersedIntoWater; // 0x978
	float _timeToAutoDestructWhenImmersedIntoWater; // 0x97c
	UUserWidget* _mountSlotIndicatorsWidget; // 0x988
	uint32_t _controls; // 0x9a4
	FVector _movementParticlesPosition; // 0x9c0
	FText _healthBarCaption; // 0x9d0
};

struct UUI_GameEventLeaderboardWidget_C : UGameEventLeaderboardWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a8
	UCircularThrobber* CircularThrobber_Ranking; // 0x2b0
	UCircularThrobber* CircularThrobber_TopPlayers; // 0x2b8
	UVerticalBox* PlayerRanking; // 0x2c0
	UVerticalBox* TopPlayers; // 0x2c8
	UUI_GameEventLeaderboardRow_C* UI_GameEventLeaderboardRow_C_1; // 0x2d0
	int32_t MaxStats; // 0x2d8
};

struct UBreathingBarLungsWidget : UUserWidget {
	UImage* _lungs; // 0x268
	UImage* _lungsCritical; // 0x270
};

struct AFishingAttachmentBait : AFishingAttachment {
	TMap<EAquaticIndividualSize, float> _baitCatchingChanceMultiplier; // 0x7e0
};

struct UEventInsertCartridge : UWeaponActionReloadSequence {
	FName MontageEndSectionName; // 0x90
};

struct UBP_M1_OpenEjectBulletInsertClipInsertBulletLoop_C : UInsertMagazineInsertCartridge {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa0
	int32_t LoadedAmmoCount; // 0xa8
};

struct UNiagaraDataInterfaceArrayInt32 : UNiagaraDataInterfaceArray {
	TArray<int32_t> IntData; // 0x50
};

struct ULiveLinkInstance : UAnimInstance {
	ULiveLinkRetargetAsset* CurrentRetargetAsset; // 0x2b8
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x140
	char bReverseAsBrake : 1; // 0x140
	char bUseRVOAvoidance : 1; // 0x140
	char bRawHandbrakeInput : 1; // 0x140
	char bRawGearUpInput : 1; // 0x140
	char bRawGearDownInput : 1; // 0x140
	char bWasAvoidanceUpdated : 1; // 0x144
	float Mass; // 0x148
	TArray<FWheelSetup> WheelSetups; // 0x150
	float DragCoefficient; // 0x160
	float ChassisWidth; // 0x164
	float ChassisHeight; // 0x168
	float DragArea; // 0x16c
	float EstimatedMaxEngineSpeed; // 0x170
	float MaxEngineRPM; // 0x174
	float DebugDragMagnitude; // 0x178
	FVector InertiaTensorScale; // 0x17c
	float MinNormalizedTireLoad; // 0x188
	float MinNormalizedTireLoadFiltered; // 0x18c
	float MaxNormalizedTireLoad; // 0x190
	float MaxNormalizedTireLoadFiltered; // 0x194
	float ThresholdLongitudinalSpeed; // 0x198
	int32_t LowForwardSpeedSubStepCount; // 0x19c
	int32_t HighForwardSpeedSubStepCount; // 0x1a0
	TArray<UVehicleWheel*> Wheels; // 0x1a8
	float RVOAvoidanceRadius; // 0x1d0
	float RVOAvoidanceHeight; // 0x1d4
	float AvoidanceConsiderationRadius; // 0x1d8
	float RVOSteeringStep; // 0x1dc
	float RVOThrottleStep; // 0x1e0
	int32_t AvoidanceUID; // 0x1e4
	FNavAvoidanceMask AvoidanceGroup; // 0x1e8
	FNavAvoidanceMask GroupsToAvoid; // 0x1ec
	FNavAvoidanceMask GroupsToIgnore; // 0x1f0
	float AvoidanceWeight; // 0x1f4
	FVector PendingLaunchVelocity; // 0x1f8
	FReplicatedVehicleState ReplicatedState; // 0x204
	float RawSteeringInput; // 0x21c
	float RawThrottleInput; // 0x220
	float RawBrakeInput; // 0x224
	float SteeringInput; // 0x228
	float ThrottleInput; // 0x22c
	float BrakeInput; // 0x230
	float HandbrakeInput; // 0x234
	float IdleBrakeInput; // 0x238
	float StopThreshold; // 0x23c
	float WrongDirectionThreshold; // 0x240
	FVehicleInputRate ThrottleInputRate; // 0x244
	FVehicleInputRate BrakeInputRate; // 0x24c
	FVehicleInputRate HandbrakeInputRate; // 0x254
	FVehicleInputRate SteeringInputRate; // 0x25c
	AController* OverrideController; // 0x288
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct AGlassBottle04_C : ADrinkItem {
	URainCollectorComponent* RainCollector; // 0x920
};

struct UARBasicLightEstimate : UARLightEstimate {
	float AmbientIntensityLumens; // 0x28
	float AmbientColorTemperatureKelvin; // 0x2c
	FLinearColor AmbientColor; // 0x30
};

struct USynthSamplePlayer : USynthComponent {
	USoundWave* SoundWave; // 0x6c0
	FMulticastInlineDelegate OnSampleLoaded; // 0x6c8
	FMulticastInlineDelegate OnSamplePlaybackProgress; // 0x6d8
};

struct UWeaponActionClearMalfunctionSequence : UWeaponAction {
	int32_t SortIndex; // 0x28
	EWeaponMalfunction MalfunctionType; // 0x2c
	FText Description; // 0x30
	UCircularMenuSegmentWeaponMalfunctionInfo* CircularMenuSegmentInfo; // 0x48
	TMap<EWeaponMalfunction, FClearMalfunctionData> Malfunctions; // 0x50
	bool CanBeInterrupted; // 0xa0
	bool AllowBeginFiringSequence; // 0xa1
};

struct UGizmoComponentAxisSource : UObject {
	USceneComponent* Component; // 0x30
	int32_t AxisIndex; // 0x38
	bool bLocalAxes; // 0x3c
};

struct UAirplanePassengerMountSlot : UAirplaneMountSlot {
	UBlendSpace* _idleAnimation; // 0x138
};

struct UNiagaraDataInterfaceArrayFloat3 : UNiagaraDataInterfaceArray {
	TArray<FVector> FloatData; // 0x50
};

struct UChannel : UObject {
	UNetConnection* Connection; // 0x28
};

struct UGroupEdgeInsertionTool : USingleSelectionTool {
	UGroupEdgeInsertionProperties* Settings; // 0x98
	UMeshOpPreviewWithBackgroundCompute* Preview; // 0xa0
};

struct UAddPatchToolProperties : UInteractiveToolPropertySet {
	float Width; // 0x60
	float Rotation; // 0x64
	int32_t Subdivisions; // 0x68
	float Shift; // 0x6c
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AWorldEvent : AActor {
	FVector Location; // 0x220
	float Radius; // 0x22c
	UTexture* IconTexture; // 0x230
};

struct UConZBoatDriverMountSlot : UConZBoatMountSlot {
	UBlendSpace* _forwardIdleAnimation; // 0x118
	UBlendSpace* _paddlingLHandAnimation; // 0x120
	UBlendSpace* _paddlingRHandAnimation; // 0x128
	UAnimSequence* _paddlingLToRAnimation; // 0x130
	UAnimSequence* _paddlingRToLAnimation; // 0x138
	UAnimSequence* _startEngineStartAnimation; // 0x140
	UAnimSequence* _startEngineLoopAnimation; // 0x148
	UAnimSequence* _startEngineLongLoopAnimation; // 0x150
	UAnimSequence* _startEngineEndAnimation; // 0x158
	UVehicleWeaponAimingParameters* _vehicleDriverWeaponAimingParameters; // 0x160
};

struct UParticleModuleVelocity_Seeded : UParticleModuleVelocity {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x30
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x40
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x50
	FSolverIterations SolverIterations; // 0x60
	char bNotForDedicatedServer : 1; // 0x7c
	UThumbnailInfo* ThumbnailInfo; // 0x120
	TArray<UBodySetup*> BodySetup; // 0x128
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct UMaterialExpressionReflectionVectorWS : UMaterialExpression {
	FExpressionInput CustomWorldNormal; // 0x40
	char bNormalizeCustomWorldNormal : 1; // 0x54
};

struct UARTrackedObject : UARTrackedGeometry {
	UARCandidateObject* DetectedObject; // 0xf8
};

struct AItemDropPlaceholder : AActor {
	UBoxComponent* BoxCollisionComponent; // 0x220
	UStaticMeshComponent* StaticMeshComponent; // 0x228
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x230
	USceneComponent* _rootComponent; // 0x240
};

struct UMovieSceneTakeTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UFishingBarWidget : UUserWidget {
	FLinearColor TopSegmentGradientColorBottom; // 0x260
	FLinearColor TopSegmentGradientColorTop; // 0x270
	float BarBoxesTotalHeight; // 0x280
	float BarSegmentsTotalHeight; // 0x284
	int32_t BarSegmentNum; // 0x288
	FSlateBrush ProgressBarBackgroundBoxBrush; // 0x290
	FLinearColor ProgressBarBackgroundBoxColorAndOpacity; // 0x318
	float ProgressBarBackgroundBoxPadding; // 0x328
	FSlateBrush ProgressBarSegmentBrush; // 0x330
	FLinearColor ProgressBarSegmentColorAndOpacity; // 0x3b8
	float ProgressBarSegmentPadding; // 0x3c8
	UVerticalBox* _progressBarSegmentBackgroundBoxesContainer; // 0x3d0
	UVerticalBox* _progressBarSegmentsContainer; // 0x3d8
	USizeBox* _simulatedProgressBar; // 0x3e0
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct UMaterialExpressionSceneTexture : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
	ESceneTextureId SceneTextureId; // 0x54
	bool bFiltered; // 0x55
};

struct ULevelStreamingDynamic : ULevelStreaming {
	char bInitiallyLoaded : 1; // 0x148
	char bInitiallyVisible : 1; // 0x148
};

struct APlayerStart : ANavigationObjectBase {
	FName PlayerStartTag; // 0x248
};

struct UAutoDestroySubsystem : UWorldSubsystem {
	TArray<AActor*> ActorsToPoll; // 0x38
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UMaterialExpressionSphereMask : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct UDestroySessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UAnimComposite : UAnimCompositeBase {
	FAnimTrack AnimationTrack; // 0xa8
};

struct UBodySetupCore : UObject {
	FName BoneName; // 0x28
	EPhysicsType PhysicsType; // 0x30
	ECollisionTraceFlag CollisionTraceFlag; // 0x31
	EBodyCollisionResponse CollisionReponse; // 0x32
};

struct UVDSimulatedParticle : UObject {
	bool IsAttached; // 0x28
	FVDParticleAttachment Attachment; // 0x30
};

struct UGloveStatsTag : UBaseItemTag {
	float ElectricalDamageModifier; // 0x30
	float LockpkickingPressureModifier; // 0x34
};

struct UMetabolismTreatmentItemsPanel : UUserWidget {
	UMetabolismLightItemDisplayPanel* _inventoryItems; // 0x260
	UMetabolismLightItemDisplayPanel* _vicinityItems; // 0x268
	UMetabolismContainerSetDisplayPanel* _vicinityContainers; // 0x270
	UTabButton* _buttonWidgetClass; // 0x278
	FString _inventoryName; // 0x280
	FString _vicinityName; // 0x290
};

struct UPlacedPlaceableWidget : UDesignableUserWidget {
	UVerticalBox* _container; // 0x2c8
};

struct URadioCategory : UObject {
	TArray<URadioTrack*> Tracks; // 0x28
	int32_t _index; // 0x38
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UMagicLeapLightingTrackingComponent : UActorComponent {
	bool UseGlobalAmbience; // 0xb0
	bool UseColorTemp; // 0xb1
};

struct UAnimNotify_CharacterActionNotify : UAnimNotify {
	ECharacterActionNotifyType CharacterActionNotifyType; // 0x38
};

struct UBombDefusalWidget : UMinigameWidget {
	UTextBlock* _remainingTimeMinutes1; // 0x290
	UTextBlock* _remainingTimeMinutes2; // 0x298
	UTextBlock* _remainingTimeSeconds1; // 0x2a0
	UTextBlock* _remainingTimeSeconds2; // 0x2a8
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
	UMatineeCameraShake* ShakeClass; // 0x108
	float PlayScale; // 0x110
	ECameraShakePlaySpace PlaySpace; // 0x114
	FRotator UserDefinedPlaySpace; // 0x118
};

struct AQuiver : AClothesItem {
	USkeletalMesh* AlternativeSkeletalMesh; // 0x920
	FName ArrowsBoneName; // 0x928
	TArray<UStaticMeshComponent*> _arrowMeshComponentsArray2; // 0x930
	USkeletalMeshComponent* _alternativeEquippedMesh; // 0x940
	float _containerDepth; // 0x94c
};

struct UNavigationSystemModuleConfig : UNavigationSystemConfig {
	char bStrictlyStatic : 1; // 0x50
	char bCreateOnClient : 1; // 0x50
	char bAutoSpawnMissingNavData : 1; // 0x50
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x50
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct UWeaponRevolverAnimInstance : UWeaponAnimInstance {
	bool _useDrumRotation; // 0x300
	float _drumRotation; // 0x304
};

struct UScaleBox : UContentWidget {
	EStretch Stretch; // 0x120
	EStretchDirection StretchDirection; // 0x121
	float UserSpecifiedScale; // 0x124
	bool IgnoreInheritedScale; // 0x128
};

struct UUI_Chat_C : UChatWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
	UImage* Image_1; // 0x368
	UButton* MuteButton; // 0x370
	UTextBlock* MuteText; // 0x378
	TArray<FString> ActiveSuggestions; // 0x380
	int32_t CurrentSuggestion; // 0x390
	TArray<UUI_ChatSuggestion_C*> ActiveSuggestionWidgets; // 0x398
	bool SuggestionsUpdated; // 0x3a8
	bool SuggestionSelected; // 0x3a9
	bool IsInHistoryMode; // 0x3aa
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x308
};

struct UInventoryContainer2D : UActorComponent {
	FInventoryContainer2DRepData _data; // 0xb8
	FInventoryContainer2DRepData _oldData; // 0xd8
	TArray<UInventoryContainerWidget2*> _widgets; // 0xf8
	TScriptInterface<IInventoryNode> _parent; // 0x108
	UInventoryContainerWidget2* _widget; // 0x118
	TArray<bool> _grid; // 0x120
	TArray<bool> _gridDamaged; // 0x130
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	char bPersistFade : 1; // 0x90
	char bFadeAudio : 1; // 0x90
	FLinearColor FadeColor; // 0x94
};

struct UConZSlider : UUserWidget {
	int32_t _minValue; // 0x280
	int32_t _maxValue; // 0x284
	int32_t _stepSize; // 0x288
	bool _controlWithKeyboard; // 0x28c
	UOverlay* _progressBarOverlay; // 0x2a8
	UImage* _sliderThumb; // 0x2b0
	UProgressBar* _progressBar; // 0x2b8
	FConZSliderStyle _selectedAndFocusedSliderStyle; // 0x2c0
	FConZSliderStyle _selectedAndUnfocusedSliderStyle; // 0x4e8
	FConZSliderStyle _unselectedSliderStyle; // 0x710
	FConZSliderStyle _highlightedSliderStyle; // 0x938
	FConZSliderStyle _disabledSliderStyle; // 0xb60
	float _stepSpeedStartTreshold; // 0xd88
	float _stepSpeedThreshold; // 0xd8c
	float _stepSpeedAtStart; // 0xd90
	float _stepSpeedSlow; // 0xd94
	float _stepSpeedFast; // 0xd98
	bool _controlWithMouseClick; // 0xd9c
	bool _controlWithMouseWheel; // 0xd9d
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x80
	bool bAdditivePose; // 0x110
	int32_t BasePoseIndex; // 0x114
	FName RetargetSource; // 0x118
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UReplicationGraphNode_GridCell : UReplicationGraphNode_ActorList {
	UReplicationGraphNode* DynamicNode; // 0x140
	UReplicationGraphNode_DormancyNode* DormancyNode; // 0x148
};

struct UMetabolismSkillProgressBar : UUserWidget {
	TArray<FSlateBrush> SkillRankIcons; // 0x260
	FText SkillTitle; // 0x270
	UImage* _skillRankIcon; // 0x298
	UMetabolismAdvancedProgressBar* _apb_SkillProgress; // 0x2a0
	USkill* _skillClass; // 0x2a8
};

struct UProjectileImpactEffects : UDataAsset {
	float MinDecalSize; // 0x30
	float MaxDecalSize; // 0x34
	float MinDecalLifetime; // 0x38
	float MaxDecalLifetime; // 0x3c
	float DecalFadeFactor; // 0x40
	float ParticleEffectsInitialScale; // 0x44
	float ParticleEffectsScaleDistanceStart; // 0x48
	float ParticleEffectsScaleDistanceRange; // 0x4c
	float ParticleEffectsScaleByDistanceFactor; // 0x50
	UParticleSystem* BulletPenetrationExitParticlesDaytime; // 0x58
	UParticleSystem* BulletPenetrationExitParticlesNighttime; // 0x60
	UMaterial* DayTimePenetrationDecal; // 0x68
	UMaterial* NightTimePenetrationDecal; // 0x70
	UAkAudioEvent* AudioEvent; // 0x78
	FImpactEffectData Default; // 0x80
	FImpactEffectData grass; // 0x90
	FImpactEffectData ForrestGroundCoastal; // 0xa0
	FImpactEffectData ForrestGroundContinental; // 0xb0
	FImpactEffectData Rock; // 0xc0
	FImpactEffectData Stone; // 0xd0
	FImpactEffectData Gravel; // 0xe0
	FImpactEffectData GravelBeach; // 0xf0
	FImpactEffectData Pebbles; // 0x100
	FImpactEffectData Snow; // 0x110
	FImpactEffectData Ice; // 0x120
	FImpactEffectData Sand; // 0x130
	FImpactEffectData Asphalt; // 0x140
	FImpactEffectData Dirt; // 0x150
	FImpactEffectData Water; // 0x160
	FImpactEffectData WaterOcean; // 0x170
	FImpactEffectData Cloth; // 0x180
	FImpactEffectData Metal; // 0x190
	FImpactEffectData Aluminium; // 0x1a0
	FImpactEffectData Concrete; // 0x1b0
	FImpactEffectData Brick; // 0x1c0
	FImpactEffectData Wood; // 0x1d0
	FImpactEffectData Plastic; // 0x1e0
	FImpactEffectData Rubber; // 0x1f0
	FImpactEffectData Glass; // 0x200
	FImpactEffectData Folliage; // 0x210
	FImpactEffectData Bark; // 0x220
	FImpactEffectData Flesh; // 0x230
	FImpactEffectData RoofTile; // 0x240
	FImpactEffectData CeramicsTiles; // 0x250
	FImpactEffectData Scrap; // 0x260
	FImpactEffectData Trunk; // 0x270
	FImpactEffectData Leaves; // 0x280
	FImpactEffectData Cardboard; // 0x290
	FImpactEffectData Plaster; // 0x2a0
	FImpactEffectData Kevlar; // 0x2b0
	FImpactEffectData ForceField; // 0x2c0
	FImpactEffectData NoEffect; // 0x2d0
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x48
	FSoundAttenuationSettings AttenuationOverrides; // 0x50
	char bOverrideAttenuation : 1; // 0x3f0
};

struct UUI_AdjustableSeparator_C : UUserWidget {
	UImage* Image_1; // 0x260
	UImage* Image_2; // 0x268
	UImage* Image_3; // 0x270
	UNamedSlot* UnderSlot; // 0x278
	USizeBox* UpperSizeBox; // 0x280
	UNamedSlot* UpperSlot; // 0x288
	bool _shouldMove; // 0x290
	float MinHeight; // 0x294
};

struct ULandscapeSplinesComponent : UPrimitiveComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x448
	TArray<ULandscapeSplineSegment*> Segments; // 0x458
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x468
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x38
};

struct ABP_WeaponBullet_ShotgunSlug_C : AProjectileShotgun {
	FPointerToUberGraphFrame UberGraphFrame; // 0x428
};

struct UWeaponActionCheckAmmoSequence : UWeaponAction {
	FBodyWeaponAnimation Animations; // 0x28
	bool CanBeInterrupted; // 0x38
};

struct UButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x120
	FButtonStyle WidgetStyle; // 0x128
	FLinearColor ColorAndOpacity; // 0x3a0
	FLinearColor BackgroundColor; // 0x3b0
	EButtonClickMethod ClickMethod; // 0x3c0
	EButtonTouchMethod TouchMethod; // 0x3c1
	EButtonPressMethod PressMethod; // 0x3c2
	bool IsFocusable; // 0x3c3
	FMulticastInlineDelegate OnClicked; // 0x3c8
	FMulticastInlineDelegate OnPressed; // 0x3d8
	FMulticastInlineDelegate OnReleased; // 0x3e8
	FMulticastInlineDelegate OnHovered; // 0x3f8
	FMulticastInlineDelegate OnUnhovered; // 0x408
};

struct UMetabolismRadialProgressBar : UUserWidget {
	bool PreviewedAlertedState; // 0x260
	float PrimaryPercentageMinDisplayedValue; // 0x264
	float PrimaryPercentageMaxDisplayedValue; // 0x268
	UScaleBox* _scaleBox; // 0x280
	UImage* _coloredBackground; // 0x288
	UImage* _radialProgressBar; // 0x290
	URetainerBox* _fontEffectPass1; // 0x298
	URetainerBox* _fontEffectPass2; // 0x2a0
	URichTextBlock* _percentage; // 0x2a8
	UTextBlock* _value; // 0x2b0
	UTextBlock* _title; // 0x2b8
	FMetabolismRadialProgressBarColorScheme _defaultColorScheme; // 0x2c0
	FMetabolismRadialProgressBarColorScheme _alertedColorScheme; // 0x340
	FMetabolismRadialProgressBarFontSettings _percentageFontSettings; // 0x3c0
	float _widgetScale; // 0x3d4
	bool _isTitleVisible; // 0x3d8
};

struct UUI_Mission_C : UMissionContainerWidget {
	UWidgetAnimation* CompleteObjectiveAnim; // 0x288
	UWidgetAnimation* StartObjectiveAnim; // 0x290
	UImage* _background; // 0x298
	UUI_Objective_C* UI_Objective; // 0x2a0
};

struct UMovieSceneAkTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	char bIsAMasterTrack : 1; // 0x88
};

struct ABP_WeaponBullet_ExplosiveArrow_C : AProjectileExplosiveArrow {
	UParticleSystemComponent* P_ArrowTrail; // 0x458
};

struct AServerStatReplicator : AInfo {
	bool bUpdateStatNet; // 0x220
	bool bOverwriteClientStats; // 0x221
	uint32_t Channels; // 0x224
	uint32_t InRate; // 0x228
	uint32_t OutRate; // 0x22c
	uint32_t MaxPacketOverhead; // 0x234
	uint32_t InRateClientMax; // 0x238
	uint32_t InRateClientMin; // 0x23c
	uint32_t InRateClientAvg; // 0x240
	uint32_t InPacketsClientMax; // 0x244
	uint32_t InPacketsClientMin; // 0x248
	uint32_t InPacketsClientAvg; // 0x24c
	uint32_t OutRateClientMax; // 0x250
	uint32_t OutRateClientMin; // 0x254
	uint32_t OutRateClientAvg; // 0x258
	uint32_t OutPacketsClientMax; // 0x25c
	uint32_t OutPacketsClientMin; // 0x260
	uint32_t OutPacketsClientAvg; // 0x264
	uint32_t NetNumClients; // 0x268
	uint32_t InPackets; // 0x26c
	uint32_t OutPackets; // 0x270
	uint32_t InBunches; // 0x274
	uint32_t OutBunches; // 0x278
	uint32_t OutLoss; // 0x27c
	uint32_t InLoss; // 0x280
	uint32_t VoiceBytesSent; // 0x284
	uint32_t VoiceBytesRecv; // 0x288
	uint32_t VoicePacketsSent; // 0x28c
	uint32_t VoicePacketsRecv; // 0x290
	uint32_t PercentInVoice; // 0x294
	uint32_t PercentOutVoice; // 0x298
	uint32_t NumActorChannels; // 0x29c
	uint32_t NumConsideredActors; // 0x2a0
	uint32_t PrioritizedActors; // 0x2a4
	uint32_t NumRelevantActors; // 0x2a8
	uint32_t NumRelevantDeletedActors; // 0x2ac
	uint32_t NumReplicatedActorAttempts; // 0x2b0
	uint32_t NumReplicatedActors; // 0x2b4
	uint32_t NumActors; // 0x2b8
	uint32_t NumNetActors; // 0x2bc
	uint32_t NumDormantActors; // 0x2c0
	uint32_t NumInitiallyDormantActors; // 0x2c4
	uint32_t NumNetGUIDsAckd; // 0x2c8
	uint32_t NumNetGUIDsPending; // 0x2cc
	uint32_t NumNetGUIDsUnAckd; // 0x2d0
	uint32_t ObjPathBytes; // 0x2d4
	uint32_t NetGUIDOutRate; // 0x2d8
	uint32_t NetGUIDInRate; // 0x2dc
	uint32_t NetSaturated; // 0x2e0
};

struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; // 0x90
	float FloatValue; // 0x94
	FString StringValue; // 0x98
	FString CachedDescription; // 0xa8
	char OperationType; // 0xb8
	EBTBlackboardRestart NotifyObserver; // 0xb9
};

struct UFixedPlaneBrushProperties : UInteractiveToolPropertySet {
	bool bPropertySetEnabled; // 0x60
	bool bShowGizmo; // 0x61
	bool bSnapToGrid; // 0x62
	FVector position; // 0x64
	FQuat Rotation; // 0x70
};

struct UUI_QuickAccessItemWidget_C : UQuickAccessItemWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x370
	UWidgetAnimation* AdditionalIconFadeOut; // 0x378
	UWidgetAnimation* AdditionalIconFadeIn; // 0x380
	UWidgetAnimation* BlinkingBackground; // 0x388
	UWidgetAnimation* LowerLeftBoxFadeOut; // 0x390
	UWidgetAnimation* LowerLeftBoxFadeIn; // 0x398
	UImage* _imageBackground; // 0x3a0
	UImage* AmmoIcon; // 0x3a8
	UImage* LeftSquareBracketImage; // 0x3b0
	UOverlay* Overlay_5; // 0x3b8
	UImage* RightSquareBracketImage; // 0x3c0
	USizeBox* SizeBox_1; // 0x3c8
	UTextBlock* TextBlockItemSlotNumber; // 0x3d0
	FLinearColor TextColor; // 0x3d8
	FText _itemSlotNumber; // 0x3e8
	FLinearColor _alarmColor; // 0x400
};

struct UConZCharacterMovementComponent : UCharacterMovementComponent {
	ECollisionResponse _navWalkingCollisionResponseToWorldStatic; // 0xb00
	ECollisionResponse _navWalkingCollisionResponseToWorldDynamic; // 0xb01
	float _maxClimbHeight; // 0xb04
	bool _queryWaterSplinesEveryFrame; // 0xb08
	float _angularVelocityFilteringInterpolationSpeed; // 0xc00
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x220
	float CraneYaw; // 0x224
	float CraneArmLength; // 0x228
	bool bLockMountPitch; // 0x22c
	bool bLockMountYaw; // 0x22d
	USceneComponent* TransformComponent; // 0x230
	USceneComponent* CraneYawControl; // 0x238
	USceneComponent* CranePitchControl; // 0x240
	USceneComponent* CraneCameraMount; // 0x248
};

struct UNetDriver : UObject {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t bClampBandwithDeltaTime; // 0x58
	float MinBandwithDeltaTime; // 0x5c
	float DeltaBitsMultiplier; // 0x60
	int32_t NetServerMaxTickRate; // 0x64
	int32_t MaxNetTickRate; // 0x68
	int32_t MaxInternetClientRate; // 0x6c
	int32_t MaxClientRate; // 0x70
	float ServerTravelPause; // 0x74
	float SpawnPrioritySeconds; // 0x78
	float RelevantTimeout; // 0x7c
	float KeepAliveTime; // 0x80
	float InitialConnectTimeout; // 0x84
	float ConnectionTimeout; // 0x88
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x8c
	bool bNoTimeouts; // 0x90
	bool bNeverApplyNetworkEmulationSettings; // 0x91
	UNetConnection* ServerConnection; // 0x98
	TArray<UNetConnection*> ClientConnections; // 0xa0
	int32_t RecentlyDisconnectedTrackingTime; // 0x110
	UWorld* World; // 0x150
	UPackage* WorldPackage; // 0x158
	UObject* NetConnectionClass; // 0x180
	UObject* ReplicationDriverClass; // 0x188
	FName NetDriverName; // 0x1a0
	TArray<FChannelDefinition> ChannelDefinitions; // 0x1a8
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1b8
	TArray<UChannel*> ActorChannelPool; // 0x208
	float Time; // 0x220
	UReplicationDriver* ReplicationDriver; // 0x6f8
};

struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x270
	UBoxComponent* PreviewInfluenceBox; // 0x278
	UBoxComponent* PreviewCaptureBox; // 0x280
};

struct UDcxVehicleWheelsComponent : UPawnMovementComponent {
	float ChassisMass; // 0x140
	FVector InertiaTensorScale; // 0x144
	TArray<FDcxVehicleWheelConfiguration> WheelConfigurations; // 0x150
	FDcxVehicleTireLoadFilterData TireLoadFilter; // 0x160
	bool bUseAvoidance; // 0x170
	float AvoidanceWeight; // 0x174
	int32_t AvoidanceUID; // 0x178
	FNavAvoidanceMask AvoidanceGroup; // 0x17c
	FNavAvoidanceMask GroupsToAvoid; // 0x180
	FNavAvoidanceMask GroupsToIgnore; // 0x184
	float ThresholdLongitudinalSpeed; // 0x188
	int32_t LowForwardSpeedSubStepCount; // 0x18c
	int32_t HighForwardSpeedSubStepCount; // 0x190
	float DragCoefficient; // 0x194
	float DragArea; // 0x198
	FDcxVehicleDriveInputRate ThrottleRate; // 0x19c
	FDcxVehicleDriveInputRate BrakeRate; // 0x1a4
	FDcxVehicleDriveInputRate HandbrakeRate; // 0x1ac
	FDcxVehicleDriveInputRate SteerRate; // 0x1b4
	float AvoidanceRadius; // 0x1bc
	float AvoidanceHeight; // 0x1c0
	float AvoidanceConsiderationRadius; // 0x1c4
	float AvoidanceThrottleStep; // 0x1c8
	float AvoidanceBrakeStep; // 0x1cc
	float AvoidanceSteerStep; // 0x1d0
	bool bRecreateRequired; // 0x1d4
	UDcxVehicleWheelsRawInput* RawInput; // 0x1d8
	TArray<float> SmoothAnalogControls; // 0x1e0
	FDcxVehicleDriveState ReplicatedState; // 0x1f0
	bool bWasAvoidanceUpdated; // 0x208
	FVector AvoidanceVelocity; // 0x20c
	FVector AvoidanceLockVelocity; // 0x218
	float AvoidanceLockTimer; // 0x224
};

struct UCircularMenuSegmentThrowingInfo : UCircularMenuSegmentInfo {
	FDelegate Action; // 0x80
	int32_t Index; // 0x90
};

struct UPacketHandlerProfileConfig : UObject {
	TArray<FString> Components; // 0x28
};

struct UCollisionProfile : UDeveloperSettings {
	TArray<FCollisionResponseTemplate> Profiles; // 0x38
	TArray<FCustomChannelSetup> DefaultChannelResponses; // 0x48
	TArray<FCustomProfile> EditProfiles; // 0x58
	TArray<FRedirector> ProfileRedirects; // 0x68
	TArray<FRedirector> CollisionChannelRedirects; // 0x78
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput Max; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraShakePlaySpace PlaySpace; // 0x78
};

struct UUI_GameEventScoreboardWidget_C : UGameEventScoreboardWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	UBorder* RoundInfo; // 0x2b8
	UUniformGridPanel* TeamGrid; // 0x2c0
	UTextBlock* TextBlock_1; // 0x2c8
	UUI_GameEventParticipantInfoCardWidget_C* UI_GameEventParitcipantInfoCardWidget; // 0x2d0
	TArray<UWidget*> List; // 0x2d8
	UUI_GameEventTeamHeaderWidget_C* TeamHeaderWidgetClass_1; // 0x2e8
	TArray<UUI_GameEventTeamInfoWidget_C*> TeamWidgets; // 0x2f0
	TArray<FText> TeamNames; // 0x300
	TArray<FGameEventTeamColours> TeamColors; // 0x310
};

struct UInventoryContainerClothes : UObject {
	UInventoryContainerWidget2* _widget; // 0x30
	FInventoryContainerClothesData _data; // 0x48
	FInventoryContainerClothesData _oldData; // 0x68
};

struct ATournament : AActor {
	UAkAudioEvent* StartAnnouncement; // 0x230
	UAkAudioEvent* SuddenDeathAnnouncement; // 0x238
	UAkAudioEvent* EndAnnouncement; // 0x240
	bool _inProgress; // 0x248
	bool _inSuddenDeath; // 0x249
	bool _hasEnded; // 0x24a
	TArray<FTournamentStats> _stats; // 0x250
	UTournamentScoreboardWidget* _scoreboardWidget; // 0x260
};

struct UProceduralFoliageSpawner : UObject {
	int32_t randomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct UFieldSystemMetaDataProcessingResolution : UFieldSystemMetaData {
	EFieldResolutionType ResolutionType; // 0xb0
};

struct ABP_WeaponBullet_ShotgunShell_Crafted_C : AProjectileShotgun {
	FPointerToUberGraphFrame UberGraphFrame; // 0x428
};

struct UUI_ScreenSpaceHealthWidget_C : UScreenSpaceHealthWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Background; // 0x268
	UImage* DisabledBar; // 0x270
	UImage* HealthBar; // 0x278
	UMaterialInstanceDynamic* _healthBarMat; // 0x280
	UMaterialInstanceDynamic* _disabledBarMat; // 0x288
	UCurveFloat* ColorCurve; // 0x290
	FLinearColor ColorMaxHP; // 0x298
	FLinearColor ColorMinHP; // 0x2a8
};

struct UEnduranceSkill : UConstitutionSkill {
	FEnduranceSkillParametersPerSkillLevel NoSkillParameters; // 0xc0
	FEnduranceSkillParametersPerSkillLevel BasicSkillParameters; // 0xd8
	FEnduranceSkillParametersPerSkillLevel MediumSkillParameters; // 0xf0
	FEnduranceSkillParametersPerSkillLevel AdvancedSkillParameters; // 0x108
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x250
	TArray<AOnlineBeaconClient*> ClientActors; // 0x258
};

struct USoundMix : UObject {
	char bApplyEQ : 1; // 0x28
	float EQPriority; // 0x2c
	FAudioEQEffect EQSettings; // 0x30
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x70
	float InitialDelay; // 0x80
	float FadeInTime; // 0x84
	float Duration; // 0x88
	float FadeOutTime; // 0x8c
};

struct UGizmoBoxComponent : UGizmoBaseComponent {
	FVector Origin; // 0x468
	FQuat Rotation; // 0x480
	FVector Dimensions; // 0x490
	float LineThickness; // 0x49c
	bool bRemoveHiddenLines; // 0x4a0
	bool bEnableAxisFlip; // 0x4a1
};

struct UNiagaraPreviewAxis_InterpParamLinearColor : UNiagaraPreviewAxis_InterpParamBase {
	FLinearColor Min; // 0x38
	FLinearColor Max; // 0x48
};

struct UDefaultDamageCustomization : UDamageCustomization {
	TArray<FPrisonerInjuryTypeLikelihoods> PrisonerInjuryTypeLikelihoodsPerBodyPart; // 0x28
