// Created by BlueFire1337
// Updated 2022-01-20
// Generated 2022-01-23

#pragma once

struct FNonVerbalPageData {
	TArray<FNonVerbalPhraseData> Phrases; // 0x0
	FText PageName; // 0x10
};

struct FStructSerializerBooleanTestStruct {
	bool BoolFalse; // 0x0
	bool BoolTrue; // 0x1
	uint32_t Bitfield; // 0x4
};

struct FRepairObjectActionStateConstructionInfo : FActorActionStateConstructionInfo {
	FNetSubObjectPtr RepairableObject; // 0x30
	FNetActorPtr WieldedItem; // 0x44
	UNotificationInputId* InputID; // 0x58
};

struct FDiscoveryNotificationEvent {
	int32_t Count; // 0x0
	TArray<FString> Images; // 0x8
	FString Background; // 0x18
	FText Text; // 0x28
};

struct FTimelineVectorTrack {
	UCurveVector* VectorCurve; // 0x0
	DelegateProperty InterpFunc; // 0x8
	FName VectorPropertyName; // 0x18
	UStructProperty* VectorProperty; // 0x20
};

struct FTranslationTrack {
	TArray<FVector> PosKeys; // 0x0
	TArray<float> Times; // 0x10
};

struct FActiveLightning {
	FLightningImpact Impact; // 0x0
};

struct FCharacterSocketCollisionResult {
	bool HasHit; // 0x0
	FHitResult HitResult; // 0x4
	FVector SocketVelocity; // 0x84
	FTransform SocketTransform; // 0x90
};

struct FAIDamageEvent {
	float Amount; // 0x0
	FVector Location; // 0x4
	FVector HitLocation; // 0x10
	AActor* DamagedActor; // 0x20
	AActor* Instigator; // 0x28
};

struct FFrameTypeTelemetryFragment {
	uint64_t NumLoadingScreenFrames; // 0x0
	uint64_t NumFullyOccludedFrames; // 0x8
	uint64_t NumFullScreenUIFrames; // 0x10
};

struct FSetFrontEndSelection {
	bool IsAdventureActive; // 0x0
	bool IsArenaActive; // 0x1
	bool IsTutorialActive; // 0x2
	bool IsCreativeActive; // 0x3
	bool IsBeachNPCSpawnActive; // 0x4
};

struct FItemSpawnWeightedType {
	UObject* Type; // 0x0
	FName Feature; // 0x8
	int32_t Weight; // 0x10
	TArray<USpawnRequirement*> Requirements; // 0x18
};

struct FServerProjectileHitRegInfoTelemetryEvent {
	FGuid AttackId; // 0x0
	FString ProjectileId; // 0x10
	FString HitObjectId; // 0x20
	FString HitObjectType; // 0x30
	FString HitActorName; // 0x40
	FString InstigatorName; // 0x50
	FVector HitLocation; // 0x60
};

struct FPlayerRequiresMermaidCustomServerEvent : FGlobalCustomServerEvent {
	FName EventID; // 0x8
	FDateTime ServerTimeUTC; // 0x10
};

struct FWeightedFireworkVFXData {
	UObject* VFX; // 0x0
	UWwiseEvent* Sfx; // 0x8
	UWwiseEvent* SecondarySFX; // 0x10
	float Weight; // 0x18
	FLinearColor AmbientLightColour; // 0x1c
};

struct FAthenaAICharacterControllerItemCategoryProjectileEffectivenessProperties {
	UItemCategory* ItemCategory; // 0x0
	UCurveFloat* DistanceInMToProjectileHitChanceCurve; // 0x8
};

struct FTreasureMapDataCaptureParams {
	FVector CameraPosition; // 0x0
	FRotator CameraOrientation; // 0xc
	FVector WorldSpaceCameraPosition; // 0x18
	float CameraFOV; // 0x24
	float CameraAspect; // 0x28
	float CameraOrthoWidth; // 0x2c
	float CameraNearClip; // 0x30
	float CameraFarClip; // 0x34
	int32_t TextureWidth; // 0x38
	int32_t TextureHeight; // 0x3c
};

struct FKrakenShipWrappingBehaviourHeavyAttackParams {
	FWeightedProbabilityRangeOfRanges AttackDuration; // 0x0
	float ChanceOfEnteringHeavyAttack; // 0x30
	FKnockBackInfo ExteriorKnockbackParams; // 0x34
	FKnockBackInfo InteriorKnockbackParams; // 0x84
};

struct FAggressiveGhostShipEncounterWaveDesc {
	bool BackfillActive; // 0x0
	int32_t NumGrunts; // 0x4
	int32_t NumGruntsToKill; // 0x8
	TArray<FAggressiveGhostShipEncounterWaveFormationDesc> Formations; // 0x10
	FWeightedProbabilityRangeOfRanges SpawnDelay; // 0x20
	FWeightedProbabilityRangeOfRanges TimeBetweenBackfillSpawns; // 0x50
	TArray<FAggressiveGhostShipEncounterShipDesc> GruntShipDescs; // 0x80
	AActor* WaveMusicZoneActorClass; // 0x90
	FAggressiveGhostShipEncounterWaveProgressAnnounceMusicType WaveAnnouncementType; // 0x98
	bool PreventGoingToNextWaveUntilNotified; // 0x99
};

struct FContestMatchmakingCrewModel {
	FGuid CrewId; // 0x0
	FUniqueNetIdRepl UserId; // 0x10
	int32_t SessionType; // 0x28
};

struct FUseMountedWeaponActionStateParams : FControlObjectActionStateParams {
	float CameraDockTime; // 0x18
	UForceFeedbackEffect* FireForceFeedbackEffect; // 0x20
	UCameraShake* FireCameraShake; // 0x28
	UNotificationInputId* FireInputId; // 0x30
	TArray<UAnalogInputId*> AimYawInputId; // 0x38
	TArray<UAnalogInputId*> AimPitchInputId; // 0x48
};

struct FBootFlowUpdateTaskStatusEvent {
	FString Message; // 0x0
};

struct FEventShipDestroyed {
	AActor* Ship; // 0x0
};

struct FRestrictedClueType {
	UClueSiteType* Type; // 0x0
	int32_t Max; // 0x8
};

struct FWheelAdditiveProperties {
	float RightHandOnHandleAMin; // 0x0
	float RightHandOnHandleAMax; // 0x4
	float RightHandOnHandleBMin; // 0x8
	float RightHandOnHandleBMax; // 0xc
	float LeftHandOnHandleAMin; // 0x10
	float LeftHandOnHandleAMax; // 0x14
	float LeftHandOnHandleBMin; // 0x18
	float LeftHandOnHandleBMax; // 0x1c
};

struct FDelegateRuntimeBinding {
	FString ObjectName; // 0x0
	FName PropertyName; // 0x10
	FName FunctionName; // 0x18
	FDynamicPropertyPath SourcePath; // 0x20
	EBindingKind Kind; // 0x30
};

struct FRewardGrantedEvent {
	FString RewardId; // 0x0
	EWalletCurrencyId CurrencyId; // 0x10
	uint32_t CurrencyAmount; // 0x14
	FString CompanyId; // 0x18
	uint32_t Xp; // 0x28
	uint32_t NumLevels; // 0x2c
	TArray<FString> Entitlements; // 0x30
	FGuid RequestID; // 0x40
	FString DeferralReason; // 0x50
};

struct FEnterTunnelOfTheDamnedActionStateParams {
	float FadeDuration; // 0x0
	float FadeEventTimeout; // 0x4
	float FadeServerTimeout; // 0x8
	FLinearColor FadeColour; // 0xc
	bool FadeAudio; // 0x1c
};

struct FStorageContainerUnregisterServerEventsRpc : FBoxedRpc {
	UObject* InStorageContainerOwnerObject; // 0x10
};

struct FKrakenShipWrappingTentacleVFXParams {
	UParticleSystem* VFX; // 0x0
	float TriggerTime; // 0x8
	FVector Location; // 0xc
	FRotator Rotation; // 0x18
};

struct FEventStatueThreatWasDefeated {
	AActor* Instigator; // 0x0
	AActor* DirectInstigator; // 0x8
};

struct FCrewCompletedEmergentVoyageEvent {
	FGuid CrewId; // 0x0
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x10
};

struct FPromptsCounterIncrementEvent {
	UPromptCounterAccessKey* AccessKey; // 0x0
};

struct FActiveGameplayEffectHandle {
	int32_t Handle; // 0x0
};

struct FWaterSlideParams {
	float ForwardSpeed; // 0x0
	float IncreaseForwardSpeedMultiplier; // 0x4
	float DecreaseForwardSpeedMultiplier; // 0x8
	float VeeringSpeed; // 0xc
	float LeftVeeringDistance; // 0x10
	float RightVeeringDistance; // 0x14
	FPlayerStat StatToFireForRouteChange; // 0x18
	UParticleSystem* PlayerSplashingVFXOverride; // 0x20
};

struct FServerMigrationHeartbeatEvent {
	FGuid ServerId; // 0x0
	FString ServerLocation; // 0x10
	FString GameEndpoint; // 0x20
	FString MigrationEndpoint; // 0x30
	TArray<FServerMigrationCrewMigrationStatus> CrewsMigrationStatus; // 0x40
	int32_t SequenceId; // 0x50
	FTimespan ServerUptime; // 0x58
	FTimespan ExpectedServerLifetime; // 0x60
	FTimespan MessageInterval; // 0x68
	bool ContestMatchmaking; // 0x70
};

struct FSpawnRequests {
	TArray<FSalvageSpawnCompRequest> Requests; // 0x0
};

struct FSetShouldSkipFerryOfTheDamnedData {
	int32_t PlayerNetGUID; // 0x0
	bool bShouldSkipFerryOfTheDamned; // 0x4
};

struct FEventMeleeAttackHit {
	FMeleeAttackHitResponseData HitResponseData; // 0x0
};

struct FPlayerAggregatePositionTelemetryFragmentInput : FTelemetryFragmentInput {
	TArray<FVector> PositionData; // 0x0
};

struct FGameplayTagQuery {
	int32_t TokenStreamVersion; // 0x0
	TArray<FGameplayTag> TagDictionary; // 0x8
	TArray<char> QueryTokenStream; // 0x18
	FString UserDescription; // 0x28
	FString AutoDescription; // 0x38
};

struct FServerTelemetryConfigurationSettings {
	float PlayerHeartbeatInterval; // 0x0
	float PlayerHeartbeatAggregatePositionInterval; // 0x4
	bool TelemetryEnabled_ItemEquip; // 0x8
	bool TelemetryEnabled_ItemUsageEnd; // 0x9
	bool TelemetryEnabled_ItemUsageStart; // 0xa
	bool TelemetryEnabled_ObjectUsageEnd; // 0xb
	bool TelemetryEnabled_ObjectUsageStart; // 0xc
	bool TelemetryEnabled_PlayerAction; // 0xd
	bool TelemetryEnabled_PlayerChangedLoadout; // 0xe
	bool TelemetryEnabled_PlayerChangedShipLoadout; // 0xf
	bool TelemetryEnabled_PlayerHeartbeat; // 0x10
	bool TelemetryEnabled_PlayerPerformedEmote; // 0x11
};

struct FCampaignPopUpNotificationInfo {
	FName Name; // 0x0
	UPopUpMessageDesc* PopUp; // 0x8
};

struct FAnimSetMeshLinkup {
	TArray<int32_t> BoneToTrackTable; // 0x0
};

struct FNPCCustomAnimationBlueprintPlayingAnimations {
	UAnimSequenceBase* OneShot; // 0x0
	UAnimSequenceBase* ContinouousIn; // 0x8
	UAnimSequenceBase* ContinouousLoop_A; // 0x10
	UAnimSequenceBase* ContinouousLoop_B; // 0x18
	UAnimSequenceBase* ContinouousOut; // 0x20
};

struct FAssetDelayLoadEntry {
	FString Comment; // 0x0
	EDelayLoadPhase LoadAtPhase; // 0x10
	ELoadPersistance Persistence; // 0x11
	bool LoadForClient; // 0x12
	bool LoadForServer; // 0x13
	TArray<FStringAssetReference> AssetsToLoad; // 0x18
	TArray<UClass*> BlueprintsToLoad; // 0x28
};

struct FWorldEventSnapshotV1 {
	FString EventID; // 0x0
	FString Status; // 0x10
};

struct FTrackedActorTelemetryFragment {
	FJsonObjectWrapper Json; // 0x0
};

struct FInterpCurveVector {
	TArray<FInterpCurvePointVector> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FFeatureToggledChapters {
	FName Feature; // 0x0
	TArray<FChapterQuests> Chapters; // 0x8
};

struct FRenderToTextureTestChangeEvent {
	AActor* Object; // 0x0
};

struct FQueryServerMemoryRpc : FBoxedRpc {
	AAthenaPlayerController* AthenaPlayerController; // 0x10
};

struct FTestActorActionStateConstructionInfo : FActorActionStateConstructionInfo {
	int32_t IntProp; // 0x30
};

struct FKrakenTentacleParams {
	FWeightedProbabilityRangeOfRanges TentacleHealth; // 0x0
	FFloatRange InactiveToActiveTentacleTimeout; // 0x30
	float InactiveToActiveTentacleTimeoutThresholdInSeconds; // 0x40
	float ChanceOfInactiveToActiveTentacle; // 0x44
	float ChanceOfInactiveToActiveTentacleOnDeathOrFlee; // 0x48
};

struct FServerContestScoreUpdateTelemetryEvent {
	EScoreReason ReasonForScoreChange; // 0x0
	int32_t CurrentCrewScore; // 0x4
	int32_t ScoreChangeAmount; // 0x8
	FString ScoreContext; // 0x10
	FGuid InstigatorId; // 0x20
};

struct FPremiumStoreOffersEvent {
	FPremiumStoreLandingPage Data; // 0x0
	int64_t TimeLimitedExpiresInSeconds; // 0x10
	FString CurrencyCode; // 0x18
};

struct FPlayerRadialChatCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FNavigationSegmentLink : FNavigationLinkBase {
	FVector LeftStart; // 0x30
	FVector LeftEnd; // 0x3c
	FVector RightStart; // 0x48
	FVector RightEnd; // 0x54
};

struct FQuestVariableLinkEQSContext : FQuestVariable {
	FName ParamName; // 0x8
};

struct FGameServiceCoordinator {
	TArray<FGameServiceCoordinatorUnit> Services; // 0x0
};

struct FMovieSceneEditorData {
	TMap<FString, FMovieSceneExpansionState> ExpansionStates; // 0x0
	FFloatRange WorkingRange; // 0x50
	FFloatRange ViewRange; // 0x60
};

struct FMovieSceneLevelVisibilitySharedTrack : FMovieSceneEvalTemplate {
	EMovieSceneCompletionMode CompletionMode; // 0x10
};

struct FPocketWatchDateDisplay {
	UWwiseEvent* DateSwitchSFX; // 0x0
	UMaterialInstanceDynamic* FirstPersonMeshDynamicMaterialInstance; // 0x8
	UMaterialInstanceDynamic* ThirdPersonMeshDynamicMaterialInstance; // 0x10
};

struct FStorageContainerWeightedItemListEntry {
	float Weight; // 0x0
	UItemDesc* ItemDesc; // 0x8
};

struct FEventShipSpawnLocationDestroyed {
	AShipSpawnLocation* SpawnLocation; // 0x0
};

struct FGameTime {
	FDateTime DateTimeRepresentation; // 0x0
};

struct FQuestVariableMerchantItem : FQuestVariable {
	FName ParamName; // 0x8
};

struct FShroudBreakerActivatedEvent {
	FGuid ShroudBreakerId; // 0x0
};

struct FDropItemParams {
	TArray<UClass*> AttachOnDropParentTypes; // 0x0
	FVector DropItemOffset; // 0x10
	float MaxShallowWaterHeightToAllowItemDrop; // 0x1c
	ECollisionChannel DropItemPosTestTraceChannel; // 0x20
	float WaterVolumeOverlapRadius; // 0x24
	float MaxDroppedItemPitchRoll; // 0x28
	float ItemWorldProxyCapsuleCastRadius; // 0x2c
	float ItemWorldProxyCapsuleCastHeight; // 0x30
	float ItemWorldProxyCapsuleDownCastRadiusModifier; // 0x34
	float LineTraceDepth; // 0x38
	float SweepPercentageOnHit; // 0x3c
	float HitDiffTolerance; // 0x40
	float LineTraceOffsetUpwardsFromStart; // 0x44
};

struct FShantyPuzzlePlayerEnterInteractionZoneEvent {
	AActor* Player; // 0x0
};

struct FSpawnerTypeMapping {
	UItemCategory* Type; // 0x0
	UStorageContainerContentSpawner* Spawner; // 0x8
};

struct FEventItemTransmuted {
	AItemInfo* NewItem; // 0x0
};

struct FAthenaAnimationAsyncLoadedObjectJumpingAnimations {
	UBlendSpace* Start; // 0x0
	UBlendSpace* Cycle; // 0x20
	UBlendSpace* PreImpact; // 0x40
	UBlendSpace* LandLight; // 0x60
};

struct FMovieSceneSectionEvalOptions {
	bool bCanEditCompletionMode; // 0x0
	EMovieSceneCompletionMode CompletionMode; // 0x1
};

struct FCriticalActorWrapper {
	AActor* CriticalActor; // 0x0
};

struct FRopeCatenaryDynamicsParams {
	float CatenaryToTautLengthRatioToConsiderCatenary; // 0x0
	bool ReactsToWind; // 0x4
};

struct FAnimNode_HIKBase : FAnimNode_Base {
	FComponentSpacePoseLink HIKSettings; // 0x30
};

struct FEventReceiveTankardRefillerComponentState {
	UTankardRefillerComponent* Source; // 0x0
};

struct FSpikeMechanismMaterialAnimationContext : FMechanismMaterialAnimationContext {
	UMeshComponent* Mesh; // 0x8
	TArray<UMaterialInstanceDynamic*> DynamicMaterials; // 0x10
};

struct FPredictionKey {
	int16_t Current; // 0x0
	int16_t Base; // 0x2
	UPackageMap* PredictiveConnection; // 0x8
	bool bIsStale; // 0x10
	bool bIsServerInitiated; // 0x11
};

struct FGameplayAttribute {
	UProperty* Attribute; // 0x0
};

struct FWhatsNewArticleClientResponseModel {
	TArray<FWhatsNewArticleModel> WhatsNewArticleList; // 0x0
};

struct FAIDataProviderValue {
	UProperty* CachedProperty; // 0x8
	UAIDataProvider* DataBinding; // 0x10
	FName DataField; // 0x18
};

struct FSpinBoxStyle : FSlateWidgetStyle {
	FSlateBrush BackgroundBrush; // 0x8
	FSlateBrush HoveredBackgroundBrush; // 0x98
	FSlateBrush ActiveFillBrush; // 0x128
	FSlateBrush InactiveFillBrush; // 0x1b8
	FSlateBrush ArrowsImage; // 0x248
	FSlateColor ForegroundColor; // 0x2d8
	FMargin TextPadding; // 0x308
};

struct FEventStatusScreenSpaceParticleEffectEnded {
	UObject* ParticleSystem; // 0x0
};

struct FCollectionScalarParameter : FCollectionParameterBase {
	float DefaultValue; // 0x18
};

struct FModulatorContinuousParams {
	FName ParameterName; // 0x0
	float Default; // 0x8
	float MinInput; // 0xc
	float MaxInput; // 0x10
	float MinOutput; // 0x14
	float MaxOutput; // 0x18
	ModulationParamMode ParamMode; // 0x1c
};

struct FEventNewPlayerStartedPlayingShanty {
	AActor* Player; // 0x0
	AActor* Instrument; // 0x8
	AActor* Ensemble; // 0x10
};

struct FRowboatDamageEffectData {
	UMaterialInstanceDynamic* DynamicMaterialInstance; // 0x0
	float FadeInDuration; // 0x8
};

struct FGameplayCueParameters {
	float NormalizedMagnitude; // 0x0
	float RawMagnitude; // 0x4
	FGameplayEffectContextHandle EffectContext; // 0x8
	FName MatchedTagName; // 0x28
	FGameplayTag OriginalTag; // 0x30
	FGameplayTagContainer AggregatedSourceTags; // 0x38
	FGameplayTagContainer AggregatedTargetTags; // 0x60
};

struct FGameplayTargetDataFilter {
	AActor* SelfActor; // 0x8
	ETargetDataFilterSelf SelfFilter; // 0x10
	AActor* RequiredActorClass; // 0x18
	bool bReverseFilter; // 0x20
};

struct FEmissaryGlobalActionRewardBoostServiceEvent {
	UGameEventType* FinishedEventType; // 0x0
	FGuid AssociatedCrew; // 0x8
};

struct FEmblemId {
	FName Name; // 0x0
	FGuid Id; // 0x8
};

struct FPluginRedirect {
	FString OldPluginName; // 0x0
	FString NewPluginName; // 0x10
};

struct FShipSnapshotV1 {
	int32_t Id; // 0x0
	FVector Position; // 0x4
	FWheelSnapshot Wheel; // 0x10
	FCapstanSnapshot Capstan; // 0x18
	TArray<FMastSnapshot> Masts; // 0x20
	TArray<FCannonStateData> Cannons; // 0x30
	TArray<FStorageContainerStateData> StorageContainers; // 0x40
};

struct FRainZoneParametersAndLocation {
	FRainZoneParameters RainZoneParameters; // 0x0
	FVector2D Location; // 0xc
};

struct FURL {
	FString Protocol; // 0x0
	FString Host; // 0x10
	int32_t Port; // 0x20
	FString Map; // 0x28
	FString RedirectURL; // 0x38
	TArray<FString> Op; // 0x48
	FString Portal; // 0x58
	int32_t Valid; // 0x68
};

struct FPetTurnRateModifier {
	UAIStrategyId* Strategy; // 0x0
	float TurnRateModifier; // 0x8
};

struct FUseMapTableActionStateParams : FControlObjectActionStateParams {
	float CameraDockTime; // 0x18
};

struct FQueryContendedResourcesRpc : FBoxedRpc {
	UScriptStruct* Type; // 0x8
};

struct FMastDamageAudioParams {
	FWwiseEmitter MastHingeAudioEmitter; // 0x0
	UWwiseObjectPoolWrapper* MastHingeAudioPool; // 0x20
	FWwiseEmitter MastImpactAudioEmitter; // 0x28
	UWwiseObjectPoolWrapper* MastImpactAudioPool; // 0x48
	UWwiseEvent* MastDamaged; // 0x50
	UWwiseEvent* MastFallingStart; // 0x58
	UWwiseEvent* MastFallingStop; // 0x60
	UWwiseEvent* MasthHoistingStart; // 0x68
	UWwiseEvent* MastHoistingStop; // 0x70
	UWwiseEvent* MastHoistingComplete; // 0x78
	UWwiseEvent* MastFallComplete; // 0x80
	UWwiseEvent* MastFallenStop; // 0x88
	FName MastDamageLevelAudioSwitch; // 0x90
	FName MastHoistingSpeedAudioSwitch; // 0x98
	FName MastAngleRTPC; // 0xa0
	FName MastFallingSpeedRTPC; // 0xa8
};

struct FTunnelOfTheDamnedBaseTelemetryFragment {
	FGuid TunnelInstanceId; // 0x0
};

struct FVaultLock {
	int32_t Tier; // 0x0
	FLockData VaultLock; // 0x10
	UStaticMeshMemoryConstraintComponent* MeshComponent; // 0x580
};

struct FMeleeAttackHitResponses {
	char DecalsParticlesAudio : 1; // 0x0
	char Animation : 1; // 0x0
	char CameraShake : 1; // 0x0
	char GamepadRumble : 1; // 0x0
	char HitIndicator : 1; // 0x0
};

struct FBlueprintInputActionDelegateBinding : FBlueprintInputDelegateBinding {
	FName InputActionName; // 0x4
	EInputEvent InputKeyEvent; // 0xc
	FName FunctionNameToBind; // 0x10
};

struct FNavigationLink : FNavigationLinkBase {
	FVector Left; // 0x30
	FVector Right; // 0x3c
};

struct FSwimmingCreatureAIStrategyMovementProperties {
	UAIStrategyId* AIStrategy; // 0x0
	ESwimRotationMode SwimRotationMode; // 0x8
	float RotationRate; // 0xc
	float CorrectingMaxSpeed; // 0x10
	float CorrectingYawTurnRate; // 0x14
	float MaxAbsPitch; // 0x18
	float MaxSpeed; // 0x1c
	float VelocitySmoothingFactor; // 0x20
	float TrackedActorVelocityScaling; // 0x24
	float TrackedActorVelocityScalingSmoothingFactor; // 0x28
};

struct FBootFlowErrorMessageQueryResponseEvent {
	FString ErrorMessage; // 0x0
};

struct FActorVelocityData {
	FVector ActorsVelocityVector; // 0x0
	float ActorSpeed; // 0xc
	bool IsCharacterMoving; // 0x10
	float WantedMovementSpeed; // 0x14
};

struct FScrollBoxStyle : FSlateWidgetStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x98
	FSlateBrush LeftShadowBrush; // 0x128
	FSlateBrush RightShadowBrush; // 0x1b8
};

struct FKeySequence {
	UItemDesc* VaultKeyDesc; // 0x0
	TArray<FMechanismCheckpoint> ActiveToInactiveSequenceCheckpoints; // 0x8
	TArray<FMechanismCheckpoint> InactiveToActiveSequenceCheckpoints; // 0x18
};

struct FWieldablePetHungerAnimationData {
	EAthenaAnimationPetHeldReactionState AnimState; // 0x0
	float AnimTimeout; // 0x4
};

struct FCrewSessionLeaveTelemetryEvent : FCrewSessionBaseTelemetryEvent {
	FGuid CrewId; // 0x0
};

struct FPlayerItemEquipTelemetryEvent {
	FString ItemId; // 0x0
};

struct FDistanceDatum {
	float FadeInDistanceStart; // 0x0
	float FadeInDistanceEnd; // 0x4
	float FadeOutDistanceStart; // 0x8
	float FadeOutDistanceEnd; // 0xc
	float Volume; // 0x10
};

struct FAIBountySpawnerArchive : FAISpawnerArchive {
	int32_t CurrentWaveIndex; // 0x8
	TArray<FAIBountySpawnerArchiveWaveGroupEntry> WaveGroupEntries; // 0x10
	float BountyAudioIntensity; // 0x20
};

struct FContestShipLiverySet {
	FGuid OwningCrewID; // 0x0
	TMap<UShipSize*, FGuid> ShipLiveryTeamSet; // 0x10
};

struct FPlayerAddedToEmissaryCrew {
	int32_t EmissaryLevel; // 0x0
	float EmissaryLevelProgress; // 0x4
	FName EmissaryCompany; // 0x8
};

struct FNotificationStickiness {
	EStickinessType Type; // 0x0
	uint32_t StickDurationMs; // 0x4
};

struct FPetChestCloseRequestEvent {
	FRequestClosePossessionsChestEvent ClosePossessionsChestEvent; // 0x0
};

struct FFortDespawnTelemetryEvent {
	FGuid FortId; // 0x0
	ESkellyFortDestructionReason DestructionReason; // 0x10
	FName FortType; // 0x14
};

struct FEventAthenaLocalPlayerRequestRequiredControllersConnectedResponse {
	bool ControllerConnected; // 0x0
};

struct FObjectMessagingHandle {
	UStruct* EventType; // 0x8
};

struct FEmblemCriteria {
	FPlayerStat PlayerStat; // 0x0
	uint64_t Threshold; // 0x8
	EPlayerStatsOperator Operator; // 0x10
};

struct FStoryInfo {
	FName Name; // 0x0
	int64_t StartTimeTicks; // 0x8
	int64_t EndTimeTicks; // 0x10
};

struct FImportFactorySettingValues {
	FString SettingName; // 0x0
	FString Value; // 0x10
};

struct FTransientActorEntry {
	AActor* Actor; // 0x0
};

struct FIPGData {
	TArray<FIPGDynamicSliderName> DynamicSliderNames; // 0x0
	TArray<FIPGBlendingMethod> BlendingMethods; // 0x10
	TArray<FIPGSetGroup> Groups; // 0x20
	int32_t CurrentVersion; // 0x30
	TArray<FIPGSetsData> Versions; // 0x38
};

struct FEmissaryCompanyQuestIcons {
	UCompany* Company; // 0x0
	FStringAssetReference Background; // 0x8
	TArray<FStringAssetReference> Icons; // 0x18
};

struct FAthenaAIEngageEnemyData {
	UAICharacterEngageEnemyMethod* EngageEnemyMethod; // 0x0
	float BestTargetRange; // 0x8
};

struct FEventGhostShipDoorDestroyed {
	AGhostShipDoor* GhostShipDoor; // 0x0
};

struct FAthenaAnimationLocomotionTurningAnimDataPitchOverride {
	UBlendSpace1D* Turn90; // 0x0
};

struct FInterpCurveVector2D {
	TArray<FInterpCurvePointVector2D> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FEventRegisterSettingsGroup {
	FName SettingsGroupName; // 0x0
	TArray<FName> SettingsGroupSettings; // 0x8
};

struct FQuestVariableBool : FQuestVariable {
	FName ParamName; // 0x8
};

struct FAthenaAnimationCharacterSelect {
	UAnimSequence* Idle; // 0x0
	UAnimSequence* IntoHighlight; // 0x8
	UAnimSequence* Highlighted; // 0x10
	UAnimSequence* OutOfHighlight; // 0x18
	UAnimSequence* Selected; // 0x20
};

struct FEventKrakenShipWrappingTentacleStateChanged {
	EKrakenShipWrappingTentacleState PreviousState; // 0x0
	EKrakenShipWrappingTentacleState NewState; // 0x1
};

struct FTelemetryStepContext {
	FQuestVariableName Name; // 0x0
	FQuestVariableDataAsset Asset; // 0x10
	FQuestVariableAsset AssetRef; // 0x20
	FQuestVariableClass Type; // 0x30
	FQuestVariableActor Actor; // 0x40
};

struct FEventOnlineAthenaPlayerControllerUnpossessed {
	APlayerController* PlayerController; // 0x0
};

struct FPropertyPathSegment {
	FName Name; // 0x0
	int32_t ArrayIndex; // 0x8
	UStruct* Struct; // 0x10
	UField* Field; // 0x18
};

struct FPlayerModerationReportablePlayerDetails {
	FString ReportableGamertag; // 0x0
	FString ScrambledGamertag; // 0x10
	FString XUID; // 0x20
};

struct FWWiseEmitterCreationRTPCSetting {
	FName RTPCName; // 0x0
	float RTPCValue; // 0x8
};

struct FMermaidAnimMapping {
	EMermaidState State; // 0x0
	FName MontageLabel; // 0x4
};

struct FTestStringMapSerializationObject {
	TMap<FString, FString> StringMap; // 0x0
};

struct FCatalogOfferBundleDataAsset {
	UCatalogOfferDataAsset* OwningBundle; // 0x0
	uint32_t TileSize; // 0x8
	FStringAssetReference TileImage; // 0x10
};

struct FProjectileQueuedEffect {
	int32_t HitCount; // 0x0
	FHitResult HitResult; // 0x4
	FWeaponProjectileEffectParams Effects; // 0x84
	FVector InitialShootingPosition; // 0xec
	UDamagerType* DamagerType; // 0xf8
};

struct FBasedPosition {
	AActor* Base; // 0x0
	FVector Position; // 0x8
	FVector CachedBaseLocation; // 0x14
	FRotator CachedBaseRotation; // 0x20
	FVector CachedTransPosition; // 0x2c
};

struct FVoyageChestDiscovered {
	FNetActorPtr PlayerStateOfDiscoverer; // 0x0
	bool IsDiscovererMe; // 0x14
	FName ChestRarity; // 0x18
	bool PlayAudio; // 0x20
	UPopUpMessageDesc* PopUpDesc; // 0x28
};

struct FEventPlayerControllerPossess {
	APawn* Pawn; // 0x0
};

struct FWalletBalanceItem {
	EWalletCurrencyId CurrencyId; // 0x0
	uint32_t Balance; // 0x4
};

struct FEventSessionCodeTextboxFocusRequest {
	bool ShouldFocusSessionCodeTextbox; // 0x0
};

struct FNPCOnSurfaceCannonManagerCrewSizeSettings {
	int32_t CrewSize; // 0x0
	FWeightedProbabilityRangeOfRanges TimeBetweenShots; // 0x8
	float ChanceOfNearMiss; // 0x38
};

struct FEventSetFishingAnimationState {
	EFishingState State; // 0x0
};

struct FBoxedRpc {
	UScriptStruct* Type; // 0x8
};

struct FShipConfigurationSettings {
	float MetresSailedStatSendFrequency; // 0x0
	float MinimumDistanceSailedBeforeSendingUpdate; // 0x4
	float MaxVelocityAllowedForServerMigration; // 0x8
	float MaxAngularVelocityAllowedForServerMigration; // 0xc
	float ShipHeartbeatFrequencySeconds; // 0x10
	bool MigrationBasedOnVelocityEnabled; // 0x14
};

struct FAggressiveGhostShipShotSelection {
	float Weight; // 0x0
	ALaunchableProjectile* ProjectileClass; // 0x8
	TArray<FAggressiveGhostShipDifficultyShipSizeTargetSelection> ShipSizeTargetSelection; // 0x10
	TArray<FAggressiveGhostShipDifficultyTargetSelection> LongRangeTargetSelection; // 0x20
};

struct FPortalSpawningInfo {
	uint32_t ResourceId; // 0x0
	APortalLocatorActor* Locator; // 0x8
};

struct FAchievementDefinition {
	FName DevCenterId; // 0x0
	TArray<FAchievementCriteria> UnlockCriteria; // 0x8
};

struct FHitResult {
	char bBlockingHit : 1; // 0x0
	char bStartPenetrating : 1; // 0x0
	float Time; // 0x4
	float Distance; // 0x8
	FVector_NetQuantize Location; // 0xc
	FVector_NetQuantize ImpactPoint; // 0x18
	FVector_NetQuantizeNormal Normal; // 0x24
	FVector_NetQuantizeNormal ImpactNormal; // 0x30
	FVector_NetQuantize TraceStart; // 0x3c
	FVector_NetQuantize TraceEnd; // 0x48
	float PenetrationDepth; // 0x54
	int32_t Item; // 0x58
	TWeakObjectPtr<UPhysicalMaterial> PhysMaterial; // 0x5c
	TWeakObjectPtr<AActor> Actor; // 0x64
	TWeakObjectPtr<UPrimitiveComponent> Component; // 0x6c
	FName BoneName; // 0x74
	int32_t FaceIndex; // 0x7c
};

struct FObjectLeakDetectionDataReceivedEvent {
	UNetConnection* Connection; // 0x0
	TArray<char> DataBlob; // 0x8
};

struct FServerMigrationCompletedDevTelemetryEvent {
	FGuid MigrationId; // 0x0
	TArray<FServerMigrationCompletedTelemetryActorData> ActorDetails; // 0x10
	float TotalTime; // 0x20
	int32_t NumClients; // 0x24
	int32_t NumActorsMigrated; // 0x28
	int32_t ActorSerialisationBytes; // 0x2c
};

struct FPrioritisedPromptWithHandle {
	FPrioritisedPromptHandle PromptHandle; // 0x0
	FPrioritisedPrompt Prompt; // 0x10
};

struct FStopNpcAnimationNetworkEvent : FBoxedRpc {
	AActor* TargetActor; // 0x10
	APlaceableReaction* PlaceableReaction; // 0x18
};

struct FAthenaAnimationAI {
	bool SpawnAnimationActive; // 0x0
	bool SpawnAnimationReadyToBegin; // 0x1
	UAnimSequence* AISpawn; // 0x8
	UAnimSequence* AIDespawn; // 0x10
	float AIAnimationSpawnTime; // 0x18
	bool AISpawnOnLand; // 0x1c
	bool AIFleeActive; // 0x1d
	FAthenaAnimationSkeletonSensingParams AISensing; // 0x20
	FAthenaAnimationSkeletonEmoteActionParams AIEmoteActions; // 0x58
	FAthenaAnimationSkeletonShipCaptainParams SkeletonShipCaptainParams; // 0x90
};

struct FAIStategyControllerMovementMod {
	UAIStrategyId* AIStrategy; // 0x0
	float OverrideControlRotationInterpSpeed; // 0x8
};

struct FPresortedBillboardsParams {
	EPresortedBillboardsMode Mode; // 0x0
	int32_t NumDirections; // 0x4
};

struct FResponseServerMemoryNetworkEvent : FNetworkEventStruct {
	FMemoryCommonData MemoryData; // 0x10
	TArray<FMemoryVisualiserCategory> VisualiserCategories; // 0x60
};

struct FToggleCinematicModeRpc : FBoxedRpc {
	bool bInCinematicMode; // 0x10
	APlayerController* PlayerController; // 0x18
};

struct FChaliceStatuePhaseUpdate {
	int32_t NewLevel; // 0x0
};

struct FEventBuoyantSpawnedObjectOwnershipTransferred {
	TScriptInterface<Class> BuoyancyInterface; // 0x0
};

struct FMastFallenAngleChangedEvent {
	float Angle; // 0x0
};

struct FGetNPCsDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FNPCStateData> Data; // 0x8
};

struct FCollectionLimits {
	FName CollectionName; // 0x0
	ECollectionAuditType AuditType; // 0x8
	bool IsOnlyParentCollection; // 0x9
	FCollectionTotalsLimits CollectionTotals; // 0xc
	FCollectionStaticMeshLimits StaticMeshLimits; // 0x1c
	FCollectionSkeleMeshLimits SkeleMeshLimits; // 0x24
	FCollectionAnimSequenceLimits AnimLimits; // 0x2c
	bool CanUseComplexCollisionAsSimple; // 0x30
	bool CanUseLOD0Collision; // 0x31
};

struct FClothingLoadoutUpdatedEvent {
	AActor* Character; // 0x0
};

struct FGhostPlayModeParameters {
	EPlayMode Playmode; // 0x0
	float RotationPerSecond; // 0x4
	float DisplacementPerSecond; // 0x8
};

struct FQuestVariableGuid : FQuestVariable {
	FName ParamName; // 0x8
};

struct FIPGBlendShape {
	FName Name; // 0x0
	FName NodeName; // 0x8
	float Value; // 0x10
};

struct FShipCreatureManagerCreatureInstance {
	UMeshComponent* CreatureMeshComponent; // 0x0
	UWwiseEvent* StopCreatureSounds; // 0x8
};

struct FTQStructGenSelection {
	UTaleQuestDescAsset* TaleQuestDesc; // 0x0
	UPLQuestLocationDataAsset* LocationData; // 0x8
};

struct FAthenaAnimationSkeletonEmoteActionParams {
	TArray<FAthenaAnimationSkeletonEmoteActionAnimations> AllLoadedAIEmoteActionAnimations; // 0x0
	ESkeletonEmoteActionState CurrentEmoteActionState; // 0x10
	UAnimSequence* TauntAnimation; // 0x18
	UAnimSequence* CheerAnimation; // 0x20
	UAnimSequence* TauntAnimationB; // 0x28
	UAnimSequence* CheerAnimationB; // 0x30
};

struct FTreasureData {
	FTreasureLocationData TreasureLocation; // 0x0
	UItemDesc* TreasureChestDesc; // 0x20
	UItemSpawnData* TreasureSpawnData; // 0x28
	float DigRadius; // 0x30
};

struct FEventExitedWatercraft {
	AActor* Watercraft; // 0x0
	AActor* Actor; // 0x8
};

struct FPLSectionBundleEntry {
	UPirateLegendSection* Section; // 0x0
	float Weight; // 0x8
};

struct FGameplayAbilitySpec : FFastArraySerializerItem {
	FGameplayAbilitySpecHandle Handle; // 0x8
	UGameplayAbility* Ability; // 0x10
	int32_t Level; // 0x18
	int32_t InputID; // 0x1c
	UObject* SourceObject; // 0x20
	bool InputPressed; // 0x28
	char ActiveCount; // 0x29
	bool RemoveAfterActivation; // 0x2a
	FGameplayAbilityActivationInfo ActivationInfo; // 0x30
	TArray<UGameplayAbility*> NonReplicatedInstances; // 0x50
	TArray<UGameplayAbility*> ReplicatedInstances; // 0x60
	FActiveGameplayEffectHandle GameplayEffectHandle; // 0x70
	bool PendingRemove; // 0x74
};

struct FBountyQuestParams : FQuestTypeParams {
	UAIBountySpawner* Spawner; // 0x30
	FBountyQuestRandomSpawnGeneratorParams BountyQuestRandomSpawnGeneratorParams; // 0x38
};

struct FPremiumStoreCardsView {
	FGuid Id; // 0x0
	FString PageTitle; // 0x10
	FString PageIcon; // 0x20
	TArray<FPremiumStoreCardView> CardViews; // 0x30
	FString TopBannerUrl; // 0x40
	FString BottomBannerUrl; // 0x50
};

struct FNotificationInputDisplayName {
	UNotificationInputId* InputID; // 0x0
	FText Name; // 0x8
};

struct FMerchantQuestRequiredItemsGroup {
	TArray<UMerchantQuestItemData*> RequiredItems; // 0x0
};

struct FRewardDefinition {
	FName RewardIdentifier; // 0x0
	UPopUpMessageDesc* PopUp; // 0x8
	bool IgnorePopUp; // 0x10
	TArray<UReward*> Rewards; // 0x18
	TArray<UEntitlementDesc*> PrerequisiteEntitlements; // 0x28
	bool AllowedFromInsecureSources; // 0x38
	bool AwardToAccountAndNotJustToPirate; // 0x39
	bool EmissaryExempt; // 0x3a
};

struct FClientBannedHandlerRetrieveDataResponse {
	bool Success; // 0x0
};

struct FEventAthenaAISpawnActive {
	EAthenaAISpawnType SpawnType; // 0x0
	bool SpawnActive; // 0x1
};

struct FWrappedStringElement {
	FString Value; // 0x0
	FVector2D LineExtent; // 0x10
};

struct FAshenWindsSkullMissfireParams {
	float ChargeThreshold; // 0x0
	FFloatRange SecondsBetweenMissfires; // 0x4
	FFloatRange MissfireDurationInSeconds; // 0x14
	UWwiseEvent* MissfireStartedSFX; // 0x28
	UWwiseEvent* MissfireStoppedSFX; // 0x30
};

struct FCarouselPirateDesc {
	int32_t Seed; // 0x0
	EIPGGender Gender; // 0x4
	EIPGEthnicity Ethnicity; // 0x5
	float Age; // 0x8
	FRadialCoordinate BodyShape; // 0xc
	float Dirtiness; // 0x14
	float Wonkiness; // 0x18
	TArray<UClothingDesc*> Outfit; // 0x20
};

struct FWorldMapShipLocation {
	FGuid CrewId; // 0x0
	UShipSize* ShipSize; // 0x10
	FVector2D Location; // 0x18
	float Rotation; // 0x20
	char ReplicatedRotation; // 0x24
	EWorldMapShipType Flags; // 0x25
	UTexture* CrewLiveryOverlayIcon; // 0x28
	char ReapersMarkLevel; // 0x30
	char EmissaryLevel; // 0x31
};

struct FEmissaryLevelRankChange {
	int32_t NewLevel; // 0x0
	FName CompanyName; // 0x4
};

struct FFeatureToggledLevels {
	FName Feature; // 0x0
	TArray<FStringAssetReference> Levels; // 0x8
};

struct FBuildPromotionNewProjectSettings {
	FDirectoryPath NewProjectFolderOverride; // 0x0
	FString NewProjectNameOverride; // 0x10
};

struct FVoyageParticipantView {
	FText Title; // 0x0
	FGuid Id; // 0x38
	int32_t ChapterIndex; // 0x48
	int32_t ChapterCount; // 0x4c
	int32_t ActiveQuestCount; // 0x50
	EVoyageChangeReason History; // 0x54
	UCompany* Company; // 0x58
	bool IsEmergent; // 0x60
	bool IsTale; // 0x61
	EEmergentVoyageSource EmergentSource; // 0x62
	FViewVoyageBanners ViewVoyageBanners; // 0x63
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x65
	int32_t Rank; // 0x68
	FNetActorPtr PlayerStateOfDiscoverer; // 0x6c
	bool IsDiscovererMe; // 0x80
	FName ChestRarity; // 0x84
	bool PlayAudio; // 0x8c
	int32_t ChestDiscoveredId; // 0x90
	UPopUpMessageDesc* PopUpDesc; // 0x98
	int32_t CollectCratesPopUpId; // 0xa0
	TArray<FPlayerStat> VoyageCompletionStats; // 0xa8
	TArray<FPlayerStat> ReapersMarkCompletionStats; // 0xb8
};

struct FClassFunctionSelectionType {
	UObject* Class; // 0x0
	FName Function; // 0x8
};

struct FHiddenActionStateConstructionInfo : FActorActionStateConstructionInfo {
	TWeakObjectPtr<AActor> ActorOwner; // 0x28
};

struct FVoyageAndTaleProposalsUpdatedEvent {
	TArray<FVoyageProposalDescViewModel> VoyageProposalEntitlements; // 0x0
	TArray<FVoyageProposalDescViewModel> TaleProposalEntitlements; // 0x10
	bool VoyageIsActive; // 0x20
	bool TaleIsActive; // 0x21
};

struct FPlayerFinishedInteractingWithNPCDialog {
	AActor* Interactee; // 0x0
};

struct FEventEmoteRequested {
	FEmoteData EmoteData; // 0x0
	FName ForcedEmoteIdentifier; // 0x98
	bool ForcedEmote; // 0xa0
};

struct FSingleNPCCompanyRedirectionData {
	UCompany* Company; // 0x0
	FText VisitNPCTooltip; // 0x8
};

struct FMovieSceneEvaluationTrack {
	FGuid ObjectBindingId; // 0x0
	uint16_t EvaluationPriority; // 0x10
	EEvaluationMethod EvaluationMethod; // 0x12
	TArray<FMovieSceneSegment> Segments; // 0x18
	TArray<FMovieSceneEvalTemplatePtr> ChildTemplates; // 0x28
	FMovieSceneTrackImplementationPtr TrackTemplate; // 0x38
	FName EvaluationGroup; // 0x70
	char bEvaluateInPreroll : 1; // 0x78
	char bEvaluateInPostroll : 1; // 0x78
};

struct FFFTWaterComponentParticleParams {
	int32_t MaxParticlesPerFrame; // 0x0
	FFFTWaterComponentWaveParticleType WaveParticles[0x4]; // 0x8
	FFFTWaterComponentIntersectParticleType IntersectionParticles[0x4]; // 0xe8
};

struct FEventClearCrewProgressOverride {
	FGuid CrewId; // 0x0
};

struct FCharacterActionStateConstructionInfo : FActionStateConstructionInfo {
	AAthenaCharacter* CharacterOwner; // 0x28
};

struct FSendMarketingOptInResponse {
	bool OptedIn; // 0x0
};

struct FCampaignCompletedNetworkEvent : FNetworkEventStruct {
	FName Name; // 0x10
};

struct FStatus {
	TArray<UStatusBase*> Type; // 0x0
	FStatusDescriptor Descriptor; // 0x10
};

struct FClientPawnDetails {
	TArray<APawn*> Pawns; // 0x0
};

struct FAthenaAIControllerSenseSettings {
	bool EnableSight; // 0x0
	bool EnableHearing; // 0x1
	bool EnableDamage; // 0x2
	float SightRadius; // 0x4
	float LoseSightRadius; // 0x8
	float PeripheralVisionAngleDegrees; // 0xc
	float MaxHearingRange; // 0x10
};

struct FBoxedRpcDiscardVoyage : FBoxedRpc {
	UVoyageProposalDesc* VoyageToDiscard; // 0x10
};

struct FCrewCompletedTaleEvent {
	FGuid CrewId; // 0x0
	bool DontNotifyParticipants; // 0x10
};

struct FEventFaunaAnimationImpact {
	float ImpactStrength; // 0x0
};

struct FRequestCompanyProgressEvent {
	FPirateIdentity PirateIdentity; // 0x0
	FGuid RequestID; // 0x78
};

struct FRewardIdCount {
	FName RewardId; // 0x0
	int32_t Count; // 0x8
};

struct FClientRequestExitConcealingObjectNetworkEvent : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FWreckEvictionAfterMigrationFailedTelemetryEvent {
	FVector Location; // 0x0
};

struct FShipCurseSpawnedFXObject {
	UWwiseEvent* StopAudioLoopEvent; // 0x28
};

struct FPlayerXpGrantedTelemetryEvent {
	uint64_t XpAmount; // 0x0
	FName CompanyId; // 0x8
	FGuid BootyId; // 0x10
};

struct FQuestVariableArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FLinearTransitionActionStateConstructionInfo : FActorActionStateConstructionInfo {
	USceneComponent* SceneComponent; // 0x30
	FVector TargetLocation; // 0x38
	FQuat TargetRotation; // 0x50
};

struct FAthenaAnimationTalking {
	bool Talking; // 0x0
	TWeakObjectPtr<APawn> Owner; // 0x4
	TScriptInterface<Class> VoiceChatEmitter; // 0x10
};

struct FFastArraySerializerItem {
	int32_t ReplicationID; // 0x0
	int32_t ReplicationKey; // 0x4
};

struct FAnimTickRecord {
	UAnimationAsset* SourceAsset; // 0x0
};

struct FAimSensitivitySettingParams {
	FFloatInterval Range; // 0x0
	float Default; // 0x8
};

struct FClearRadialInventory : FRadialInventoryEvent {
	int32_t RadialIdentifier; // 0x0
};

struct FEventStormLightningImpact {
	FVector ImpactPoint; // 0x0
	float TimeTillImpact; // 0xc
};

struct FInputSequencePair {
	UNotificationInputId* InputID; // 0x0
	UAnimMontage* Sequence; // 0x8
};

struct FQuestVariableName : FQuestVariable {
	FName ParamName; // 0x8
};

struct FContextualTutorialPromptDesc {
	AActor* PromptActorClass; // 0x0
	UPromptCounterAccessKey* AccessKey; // 0x8
	FName FeatureName; // 0x10
	int32_t MustBeUnderCount; // 0x18
};

struct FVaultTreasureRarity {
	UItemDesc* VaultKeyDesc; // 0x0
	FItemSpawnParams SpawnParams; // 0x8
	UWeightedItemDescSpawnDataAsset* ReferencedSpawnDistributionAsset; // 0x30
};

struct FMastSailLoweredProportionChangedEvent {
	float Proportion; // 0x0
	float DeltaTime; // 0x4
	float MovementRate; // 0x8
};

struct FCannonEnchantmentDesc {
	UObject* MuzzleFlashVfxFirstPerson; // 0x0
	UObject* MuzzleFlashVfxThirdPerson; // 0x8
	UWwiseEvent* FireSfx; // 0x10
};

struct FInlineVotingParameterSet {
	float HoldTime; // 0x0
	UVoteConsumerInlineBase* Consumer; // 0x8
	UVoteValidatorInlineBase* Validator; // 0x10
};

struct FAIAmmoRankMapping {
	UAthenaAIAmmoDataAsset* Ammo; // 0x0
	TArray<float> Weights; // 0x8
};

struct FServerAllocationSessionCookie {
	FString ServerLocation; // 0x0
	FString PrivateServerId; // 0x10
	FPlayModeDefiniton PlayModeDefinition; // 0x20
	int32_t CrewCountBucket; // 0x48
	FString TitleVersion; // 0x50
	uint32_t FeatureHash; // 0x60
	FString StampId; // 0x68
	bool ProgressionEnabled; // 0x78
};

struct FEventUserGameSettingsBooleanChanged {
	FName KeyName; // 0x0
	bool Value; // 0x8
};

struct FMermaidUsedEvent : FNetworkEventStruct {
	AMermaid* Mermaid; // 0x10
};

struct FEventItemWielded {
	AWieldableItem* WieldedItem; // 0x0
	AActor* Wielder; // 0x8
};

struct FEventShipwreckDiscoveredNotification {
	FText WreckName; // 0x0
};

struct FKrakenSpawnLocationParams {
	float KrakenRadius; // 0x0
	float MinDistanceFromExistingLocations; // 0x4
};

struct FActorFireDamageParams {
	UClass* ActorClass; // 0x0
	FFloatRange TimeInFireBeforeDamage; // 0x20
	int32_t LevelsOfDamage; // 0x30
};

struct FAnimationTransitionRule {
	FName RuleToExecute; // 0x0
	bool TransitionReturnVal; // 0x8
	int32_t TransitionIndex; // 0xc
};

struct FFaunaAnimationBaseStructure {
	TArray<UAnimSequence*> Idle; // 0x0
	TArray<UBlendSpace1D*> Locomotion; // 0x10
	FFaunaAnimationTurningStructure Turning; // 0x20
	FFaunaAnimationStartledStructure Startled; // 0x30
	TArray<UBlendSpace1D*> Impact; // 0x48
	TArray<UAnimSequence*> DyingLoop; // 0x58
	TArray<UAnimSequence*> Death; // 0x68
	TArray<UAnimSequence*> Special; // 0x78
	FFaunaAnimationPigStarvingStructure PigStarving; // 0x88
	FFaunaAnimationEatingStructure Eating; // 0xb8
	FFaunaAnimationSnakeAttack SnakeAttack; // 0xc8
};

struct FPirateDescription {
	EIPGPirateType Type; // 0x0
	int32_t Version; // 0x4
	EIPGGender Gender; // 0x8
	EIPGEthnicity Ethnicity; // 0x9
	FRadialCoordinate BodyShapeCoordinate; // 0xc
	TArray<FIPGBlendShape> BlendShapes; // 0x18
	TArray<FIPGDynamicSlider> DynamicSliders; // 0x28
	int32_t Seed; // 0x38
	TArray<FName> Items; // 0x40
	TArray<FName> TextureReferences; // 0x50
	TArray<FName> MaterialReferences; // 0x60
	TArray<FIPGScalarParameter> ScalarParameters; // 0x70
};

struct FNPCOnSurfaceLocationGroup {
	FName GroupName; // 0x0
	TArray<FNPCOnSurfaceLocationsEntry> LocationsEntries; // 0x8
};

struct FStowAllItemsToContainerRPC : FBoxedRpc {
	FNetSubObjectPtr Container; // 0x10
	UItemDesc* ItemDescToStow; // 0x28
};

struct FEjectFromTunnelOfTheDamnedActionStateConstructionInfo : FActorActionStateConstructionInfo {
	int32_t TunnelId; // 0x30
	int32_t TunnelStreamingLevelId; // 0x34
	FTeleportLocation TeleportLocation; // 0x38
};

struct FAIShipWeightedSize {
	FName Feature; // 0x0
	int32_t Weight; // 0x8
	UShipSize* ShipSize; // 0x10
};

struct FEmissaryCompanyCampaignSettings {
	UCompany* Company; // 0x0
	TArray<FEmissaryCompanyCampaignKillPlayer> KillPlayers; // 0x8
	TArray<FEmissaryCompanyCampaignGameEvent> GameEvents; // 0x18
};

struct FCargoRunQuestCategoryGroup {
	float Weight; // 0x0
	FName GroupName; // 0x4
	TArray<FCargoRunQuestRandomRequiredItemsEntry> RequiredItemEntries; // 0x10
};

struct FReplacementDialogue {
	FText ReplacementText; // 0x0
};

struct FWeightedAIShipCrewFormType {
	int32_t Weight; // 0x0
	FAIShipCrewFormType Params; // 0x8
};

struct FEmissarySessionEndTelemetryEvent {
	FGuid EmissarySessionId; // 0x0
	FName EmissaryCompany; // 0x10
	EEmissaryDeactivateReason DisbandedReason; // 0x18
};

struct FEventStorageContainerCreated {
	UObject* Replenishable; // 0x0
};

struct FTutorialStepEatBanana : FTutorialStep {
	FTutorialStepDependencies Dependencies; // 0x20
};

struct FRequestCompanyProgressFailedEvent {
	FGuid RequestID; // 0x0
};

struct FSetVaultDoorStateData {
	int32_t ActorId; // 0x0
	char DoorType; // 0x4
	char DoorState; // 0x5
};

struct FNetworkEventStruct : FBoxedRpc {
	UScriptStruct* Type; // 0x8
};

struct FSittingActionStateSerialisableData : FControlObjectActionStateSerialisableData {
	FVector UndockLocation; // 0x30
	bool UndockRequested; // 0x3c
};

struct FWieldablePetFoodSourceEntry {
	AActor* FoodSourceActor; // 0x0
	float TimeUntilConsumption; // 0x8
};

struct FKrakenAnimatedTentacleHitReactAnimation {
	int32_t CollisionBoneIndex; // 0x0
	UAnimSequence* HitReactAnimation; // 0x8
};

struct FUseItemActionStateConstructionInfo : FActorActionStateConstructionInfo {
	FNetActorPtr UsableObject; // 0x30
	UNotificationInputId* InputID; // 0x48
};

struct FConsumedIngestibleTelemetryEvent {
	FString ItemName; // 0x0
	ECookingState CookState; // 0x10
	TArray<FString> StatusesApplied; // 0x18
};

struct FShipMastCollapseStateTelemetryEvent {
	bool MastCollapsedState; // 0x0
};

struct FShipActiveCurseFXData {
	FShipCurseFXData CurseFXData; // 0x0
	FTimerHandle TimerHandle; // 0x30
};

struct FShipDamagedTelemetryEvent {
	FString DamageType; // 0x0
	FVector DamageLocation; // 0x10
	FString DamagedShipPart; // 0x20
	int32_t DamageLevel; // 0x30
	FGuid AttackId; // 0x34
};

struct FStorageContainerHealthChangedCloseInventoryRpc : FBoxedRpc {
	UScriptStruct* Type; // 0x8
};

struct FEmissaryStoleLootNetworkEvent : FNetworkEventStruct {
	FName CompanyName; // 0x10
};

struct FCreatePirateRequestFailedEvent {
	FUniqueNetIdRepl UserId; // 0x0
	FGuid RequestID; // 0x18
};

struct FActorPtr {
	AActor* Actor; // 0x0
};

struct FDamageEvent {
	UDamageType* DamageTypeClass; // 0x8
};

struct FSleepingActionStateConstructionInfo : FControlObjectActionStateConstructionInfo {
	FSleepingActionStateParams SleepingActionStateParams; // 0x48
};

struct FAIShipContextDescGenerationSharedParams {
	TArray<EAIShipEncounterType> EncounterTypes; // 0x0
	TArray<FWeightedAIShipCrewFormType> SkeletonForms; // 0x10
	TArray<FWeightedAIShipCrewAmmoType> SkeletonAmmoTypes; // 0x20
	TArray<FColor> SailColours; // 0x30
	TArray<FAIShipCaptainParams> Captains; // 0x40
	TArray<UAIClassId*> CaptainGenders; // 0x50
};

struct FSailWithFlameOfFateColoursAboardStatData {
	uint32_t NumberOfUniqueFlameColoursAboard; // 0x0
	FPlayerStat DefaultStatToFire; // 0x4
	FPlayerStat AllianceStatToFire; // 0x8
};

struct FRewardRequestFailedMessage {
	TArray<FPirateIdentity> PirateIdentities; // 0x0
	FGuid RequestID; // 0x10
	FGuid CrewId; // 0x20
	ERewardRequestFailureReason FailureReason; // 0x30
};

struct FCutsceneGroup {
	float GroupCooldown; // 0x0
	TArray<FCutscenePool> Pools; // 0x8
};

struct FPlayerBriggedEndTelemetryEvent {
	FGuid BriggedId; // 0x0
	FDateTime BriggedStartDateTime; // 0x10
	EBrigReleaseReason ReleaseReason; // 0x18
};

struct FPremiumStoreLandingPage {
	TArray<FPremiumStoreLandingPageTab> Tabs; // 0x0
};

struct FMovieSceneVector4KeyStruct : FMovieSceneVectorKeyStructBase {
	FVector4 Vector; // 0x50
};

struct FEntitlementToRedeemItems {
	UEntitlementDesc* RequiredEntitlement; // 0x0
	TArray<FCommodityDescWithRedeemId> RedeemItems; // 0x8
};

struct FUICompanyShopInfo {
	bool ShouldShowCompanyInfo; // 0x0
	FText InfoTitle; // 0x8
	TArray<FText> InfoTips; // 0x40
};

struct FMerchantCrateItemInfoFaunaBreedRarityEntry {
	UFaunaBreed* FaunaBreed; // 0x0
	FName Rarity; // 0x8
	TArray<FCompanySpecificBootyReward> CompanySpecificHandInRewardIds; // 0x10
};

struct FWheelDesc {
	USkeletalMesh* WheelMesh; // 0x0
};

struct FPressurePlateAnimationComponent {
	USceneComponent* Component; // 0x0
	UTransformBlendCurveComponent* Curve; // 0x8
};

struct FCookableComponentSmokeFeedbackTimingEntry {
	float StateDuration; // 0x0
	ECookingSmokeFeedbackLevel StateFeedbackLevel; // 0x4
};

struct FExposureSettings {
	int32_t LogOffset; // 0x0
	bool bFixed; // 0x4
};

struct FTQStructGenWeightedContainer {
	FName Name; // 0x0
	float Weight; // 0x8
	int32_t MaxOccurrences; // 0xc
};

struct FActionStateMessage {
	UScriptStruct* Type; // 0x8
};

struct FImpactDamageEvent {
	FGuid AttackId; // 0x0
	UDamagerType* DamagerType; // 0x10
	AActor* DirectInstigator; // 0x18
	AActor* RootInstigator; // 0x20
	FVector Location; // 0x28
	FVector SurfaceNormal; // 0x34
	FVector Velocity; // 0x40
	float DamageAmount; // 0x4c
	int32_t DamageSpread; // 0x50
	EHealthChangedReason Reason; // 0x54
	bool DealFriendlyFireDamage; // 0x55
};

struct FPlayerBaseTelemetryFragmentInput : FTelemetryFragmentInput {
	TWeakObjectPtr<APlayerState> PlayerState; // 0x0
};

struct FCrewManagementMatchmakingVisibilityData {
	bool Voted; // 0x0
	int32_t VotesCast; // 0x4
	int32_t VotesRequired; // 0x8
	EMatchmakingVisibilityState State; // 0xc
};

struct FColorMaterialInput : FMaterialInput {
	char UseConstant : 1; // 0x38
	FColor Constant; // 0x3c
};

struct FPremiumCatalogLandingPageTab {
	FGuid Id; // 0x0
	FText DisplayName; // 0x10
	TArray<UPremiumCatalogLandingPageItemDataAsset*> Children; // 0x48
	FName FeatureToggle; // 0x58
	FName IncludeForPromotion; // 0x60
	FName ExcludeFromPromotion; // 0x68
	bool RealMoneyOnly; // 0x70
};

struct FLootToRangeDist {
	FWeightedProbabilityRange NumberOfLootItemsToSpawn; // 0x0
	UWeightedTreasureChestDescAsset* WeightedLootDescAsset; // 0x20
};

struct FPlayerGameFishingTelemetryEvent {
	float FishingDuration; // 0x0
	EFishSpawnTimeOfDay TimeOfDay; // 0x4
	bool InPool; // 0x5
	bool CloseToActiveFortOrSkellyShip; // 0x6
	bool InStorm; // 0x7
	bool CloseToShipwreck; // 0x8
	FString Sea; // 0x10
	FString IslandInRange; // 0x20
	EBaitType BaitType; // 0x30
	FString RewardId; // 0x38
	EFishingRodServerState ServerState; // 0x48
};

struct FEventInGameUISetPhotoMode {
	bool PhotoModeEnabled; // 0x0
};

struct FVoteSessionData {
	TArray<FVotersByOption> Votes; // 0x0
	FGuid SessionId; // 0x10
	bool IsLocked; // 0x20
};

struct FAnimSlotGroup {
	FName GroupName; // 0x0
	TArray<FName> SlotNames; // 0x8
};

struct FInterpEdSelKey {
	UInterpGroup* Group; // 0x0
	UInterpTrack* Track; // 0x8
	int32_t KeyIndex; // 0x10
	float UnsnappedPosition; // 0x14
};

struct FRequestShopOffersEvent {
	FString CatalogName; // 0x0
};

struct FSwimmingCreatureLoadedMaterial {
	UMaterialInstance* MaterialInstance; // 0x0
	bool CastShadows; // 0x8
};

struct FCheatPerformedByClientNetworkEvent : FNetworkEventStruct {
	FString CheatSource; // 0x10
	FString CheatFunction; // 0x20
	FString CheatArguments; // 0x30
};

struct FTradeRouteMapData : FRegionMapData {
	FInterpCurveVector2D TradeRoutePath; // 0x48
	FVector2D TradeRoutePathOffset; // 0x60
	float TradeRoutePathSpacing; // 0x68
	float TradeRoutePathSegmentTextureWidth; // 0x6c
	float TradeRoutePathSegmentTextureLength; // 0x70
	bool NormalizeSplinePointSpacing; // 0x74
	float NormalizeAdjustment; // 0x78
	bool IgnoreFirstPoint; // 0x7c
};

struct FAthenaAnimationFishingAnimations {
	UAnimSequence* CastIntoHoldBack; // 0x0
	UBlendSpace* CastHoldBackLoop; // 0x8
	UAnimSequence* CastForwards; // 0x10
	UAnimSequence* CastHoldLoop; // 0x18
	UAnimSequence* CastToFishing; // 0x20
	UAnimSequence* CastFail; // 0x28
	UBlendSpace* Fishing; // 0x30
	UBlendSpace1D* FishingAdditive; // 0x38
	UBlendSpace1D* IntoFighting; // 0x40
	UBlendSpace* FightingCentral; // 0x48
	UBlendSpace1D* FightingAdditive; // 0x50
	UBlendSpace1D* Linesnap; // 0x58
	UAnimSequence* SuccessReelIn; // 0x60
	UAnimSequence* ComedyItemSuccessReelIn; // 0x68
	UAnimSequence* ShakingAdditive; // 0x70
	UAnimSequence* LineSnapShakingAdditive; // 0x78
	UAnimSequence* FishingToIdle; // 0x80
	UAnimSequence* FishingToUnequip; // 0x88
};

struct FGameplayEventData {
	FGameplayTag EventTag; // 0x0
	AActor* Instigator; // 0x8
	AActor* Target; // 0x10
	UObject* OptionalObject; // 0x18
	UObject* OptionalObject2; // 0x20
	FGameplayEffectContextHandle ContextHandle; // 0x28
	FGameplayTagContainer InstigatorTags; // 0x48
	FGameplayTagContainer TargetTags; // 0x70
	float EventMagnitude; // 0x98
};

struct FIslandMaterialZoneStatusMapping {
	UPhysicalMaterial* SurfaceMaterial; // 0x0
	bool ActivateOnStart; // 0x8
	TArray<FStatus> Status; // 0x10
};

struct FAthenaAICharacterCannonTarget {
	float Weight; // 0x0
	FName TargetLocation; // 0x4
};

struct FRewardRequestMessage {
	TArray<FPirateIdentity> Pirates; // 0x0
	FGuid RequestID; // 0x10
	FGuid CrewId; // 0x20
	FName RewardId; // 0x30
	FName CompanyAffiliation; // 0x38
	FName EmissaryAffiliation; // 0x40
	int32_t EmissaryLevel; // 0x48
	bool NotifyPlayer; // 0x4c
	EPlayMode Playmode; // 0x4d
	EPlayModeVariant PlayModeVariant; // 0x4e
};

struct FPetBreedViewModel {
	FString Name; // 0x0
	FString Icon; // 0x10
	FString Description; // 0x20
	bool HasNewStuff; // 0x30
	bool IsOwned; // 0x31
	TArray<FShopOffer> Offers; // 0x38
	TArray<FCategoryTab> Categories; // 0x48
};

struct FEventPlayerLoggedOut {
	AOnlineAthenaPlayerController* OnlineAthenaPlayerController; // 0x0
};

struct FBasedMovementInfo {
	UPrimitiveComponent* MovementBase; // 0x0
	FName BoneName; // 0x8
	FVector_NetQuantize100 Location; // 0x10
	FRotator Rotation; // 0x1c
	bool bServerHasBaseComponent; // 0x28
	bool bRelativeRotation; // 0x29
	FVector LinearVelocity; // 0x2c
};

struct FEventPlayerEnteredIslandVicinity {
	AActor* Player; // 0x0
	FName IslandName; // 0x10
};

struct FPlayerTalkingSettings {
	FLinearColor IconTint; // 0x0
	UTexture2D* Icon; // 0x10
	float ScreenEdgePadding; // 0x18
	float Scale; // 0x1c
	float FadeInTimeInSeconds; // 0x20
};

struct FAnimNode_HIKResist : FAnimNode_HIKBase {
	float Alpha; // 0x48
	EHIKEffector Effector; // 0x4c
};

struct FSetTotalItemsOnRadialInventorySlot {
	int32_t SlotIndex; // 0x0
	int32_t TotalItems; // 0x4
	int32_t Capacity; // 0x8
};

struct FPlayerStatusEffectDeactivatedCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
	FString Effect; // 0x28
};

struct FEdGraphSchemaAction_NewNode : FEdGraphSchemaAction {
	UEdGraphNode* NodeTemplate; // 0xc8
};

struct FShipTypeAIShipEncounterParams {
	UShipSize* ShipSize; // 0x0
	UAIShipEncounterParamsDataAsset* Params; // 0x8
};

struct FShipCustomizationLoadoutPartCustomizations {
	TArray<FPartDesc> Parts; // 0x0
};

struct FShipPartsCatalogue {
	TArray<FShipPartsCataloguePartCustomisations> Parts; // 0x0
};

struct FLaunchableProjectileDamageEvent {
	AActor* Instigator; // 0x0
	AActor* ProjectileActor; // 0x8
	AActor* ActorHit; // 0x10
};

struct FAggressiveGhostShipFixedSpline {
	float StartAngleOffset; // 0x0
	TArray<float> Offsets; // 0x8
};

struct FAIDataProviderIntValue : FAIDataProviderTypedValue {
	int32_t DefaultValue; // 0x28
};

struct FTutorialEventControlledObjectDestroyed {
	ATutorialEventControlledObject* TutorialEventControlledObject; // 0x0
};

struct FUILiveCampaignDataErrorEvent {
	FString ErrorMessage; // 0x0
	FString ErrorStack; // 0x10
};

struct FGameplayTagResponseTableEntry {
	FGameplayTagReponsePair Positive; // 0x0
	FGameplayTagReponsePair Negative; // 0x10
};

struct FMaterialInput {
	UMaterialExpression* Expression; // 0x0
	int32_t OutputIndex; // 0x8
	FString InputName; // 0x10
	int32_t Mask; // 0x20
	int32_t MaskR; // 0x24
	int32_t MaskG; // 0x28
	int32_t MaskB; // 0x2c
	int32_t MaskA; // 0x30
	int32_t GCC64_Padding; // 0x34
};

struct FCircleElement2D {
	FVector2D Center; // 0x0
	float Radius; // 0x8
};

struct FRecentlyInteractedWithPlayer {
	FString GamerTag; // 0x0
	FString ScrambledGamertag; // 0x10
	FString XUID; // 0x20
	FDateTime LastInteractionTime; // 0x30
};

struct FSlateSound {
	UObject* ResourceObject; // 0x0
};

struct FServiceMessagingTestMessage {
	int32_t Data; // 0x0
};

struct FEquipmentChestEquipItemEvent {
	UItemDesc* ItemDesc; // 0x0
};

struct FLevelProgressionEvent {
	FGuid SeasonId; // 0x0
	FGuid SourceGoalId; // 0x10
	int32_t XpChange; // 0x20
	int32_t CurrentXP; // 0x24
	int32_t CurrentTier; // 0x28
	int32_t CurrentLevel; // 0x2c
};

struct FMovieSceneEnumPropertySectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x18
	FIntegralCurve EnumCurve; // 0x38
};

struct FFuseComponentMetaWrapper : FItemMetaBase {
	TWeakObjectPtr<AActor> Instigator; // 0x18
	bool FuseEnabled; // 0x20
	float FuseTimeScale; // 0x24
};

struct FEmissaryCompanyCosmetics {
	TArray<UCostumeDesc*> CompanyCostumeCosmetics; // 0x0
	TArray<UShipCustomizationDesc*> CompanyShipCosmetics; // 0x10
};

struct FCargoRunQuestParams : FQuestTypeParams {
	FWeightedProbabilityRange NumberOfRequiredItems; // 0x30
	FWeightedProbabilityRangeOfRanges TimeLimitInMinutes; // 0x50
	UCargoRunQuestRandomRequiredItemsDataAsset* RequiredItemsDataAsset; // 0x80
};

struct FNameActiveStatePair {
	FName StateName; // 0x0
	bool IsActive; // 0x8
};

struct FTransitionLadderActionStateParams : FDockToObjectActionStateParams {
	float DockTime; // 0x0
	float DelayAfterDockingTime; // 0x4
	float ForcedFieldOfView; // 0x8
	bool ForceStash; // 0xc
};

struct FTutorialDialogEvent {
	ETutorialDialogStep StepStarted; // 0x0
};

struct FEventAthenaLoadingScreenStateResponse {
	bool IsVisible; // 0x0
};

struct FMovieScene2DTransformSectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x18
	FRichCurve Translation[0x2]; // 0x38
	FRichCurve Rotation; // 0x128
	FRichCurve Scale[0x2]; // 0x1a0
	FRichCurve Shear[0x2]; // 0x290
};

struct FEventSpawnLocationDestroyed {
	ASpawnLocation* SpawnLocation; // 0x0
};

struct FMigrationActionPair {
	FTaleResourceHandle AllocatedResourceHandle; // 0x0
	UTaleMigrationAction* MigrationAction; // 0x8
};

struct FPirateRemoteServiceModel {
	TArray<FPirateProfile> Pirates; // 0x0
};

struct FTimedDoorLandmarkReactions {
	TArray<FLandmarkReactionKeyFrame> Reactions; // 0x0
};

struct FVoyageCompleteAnimationEvent {
	FText VoyageTitle; // 0x0
	FString AudioSwitchName; // 0x38
	FString AudioSwitchValue; // 0x48
	FName CompanyId; // 0x58
};

struct FStatusActivatedEvent {
	FGuid Id; // 0x0
	FName StatusName; // 0x10
};

struct FShipDamageEntry {
	UShipSize* OtherShipSize; // 0x0
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x8
	FInt32Range NumZonesToDamageForInstigator; // 0x10
	FInt32Range DamageLevelForInstigator; // 0x20
	FInt32Range NumZonesToDamageForReceiver; // 0x30
	FInt32Range DamageLevelForReceiver; // 0x40
};

struct FPurchaseConfigurationSettings {
	float BackOffTimeInSeconds; // 0x0
	float BackOffTimeGain; // 0x4
};

struct FEmissaryNonQuestCompanyActionRewardBoostEvent {
	EEmisaryCompanyActionType CompanyActionType; // 0x0
};

struct FAthenaAnimationLocomotion {
	FVector CharacterVelocity; // 0x0
	float WantedMovementSpeed; // 0xc
	float HalfWantedMovementSpeed; // 0x10
	bool CharacterMoving; // 0x14
	bool RunStopWanted; // 0x15
	float TurnRate; // 0x18
	float CurrentYaw; // 0x1c
	float CurrentDirection; // 0x20
	bool TurningActive; // 0x24
	bool TurningLeft; // 0x25
	bool IsSwimming; // 0x26
	bool IsUnderwaterSwimming; // 0x27
	float BlendedTurnRate; // 0x28
	float MinimumMoveSpeedToTriggerRunStop; // 0x2c
	float InterpSpeed; // 0x30
	float TurnRateToDisableTurns; // 0x34
	float TurningAnimationExplicitTime; // 0x38
	float FixedBlendedTurnRateForAI; // 0x3c
	bool IsInAITurn; // 0x40
	UAthenaAnimationInstance* CachedOwner; // 0x58
};

struct FVoteAddedNetworkEvent : FBoxedRpc {
	FName CompanyId; // 0x10
	FGuid CrewId; // 0x18
};

struct FTestProjectileWeaponParameters {
	bool PassCanTrigger; // 0x0
};

struct FAISwimmingCreatureDeadActionStateEventMapItem {
	ESwimmingCreatureDeathCustomEventEnum Event; // 0x0
	float FireAtTimeLeftInState; // 0x4
};

struct FHttpResponseTelemetryFragment {
	FString Method; // 0x0
	FString Endpoint; // 0x10
	FString Context; // 0x20
	EHttpRequestTelemetryResult Result; // 0x30
	int32_t StatusCode; // 0x34
	int32_t DurationMS; // 0x38
	FString ResponseBody; // 0x40
	TArray<FString> ResponseHeaders; // 0x50
	int32_t Attempts; // 0x60
};

struct FLODSoloTrack {
	TArray<char> SoloEnableSetting; // 0x0
};

struct FEventStarvingAmountChanged {
	float PercentageStarved; // 0x0
};

struct FGameplayAbilityActivationInfo {
	EGameplayAbilityActivationMode ActivationMode; // 0x0
	bool bCanBeEndedByOtherInstance; // 0x1
	FPredictionKey PredictionKeyWhenActivated; // 0x8
};

struct FSuspensionStatusResponse {
	int32_t StrikeCount; // 0x0
};

struct FAIStrategySpeedOverride {
	UAIStrategyId* Strategy; // 0x0
	float Speed; // 0x8
};

struct FInterpCurveQuat {
	TArray<FInterpCurvePointQuat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FEventUserGameSettingsSingleChange {
	FName SettingName; // 0x0
};

struct FPetDespawnActionStateParams {
	float TakeOffHeight; // 0x0
	float TakeOffTime; // 0x4
	float TotalGhostShaderTime; // 0x8
	float TimeToTriggerVFX; // 0xc
	UObject* DespawnVFX; // 0x10
	FLinearColor DespawnVFXColour; // 0x18
	UWwiseEvent* DespawnSFX; // 0x28
	UWwiseEvent* StopDespawnSFX; // 0x30
	float TotalDespawningTime; // 0x38
};

struct FCollisionImpactData {
	TArray<FRigidBodyContactInfo> ContactInfos; // 0x0
	FVector TotalNormalImpulse; // 0x10
	FVector TotalFrictionImpulse; // 0x1c
};

struct FKrakenShipWrappingBehaviourWarningParams {
	AKrakenAnimatedTentacle* TentacleType; // 0x0
	float TickDuration; // 0x8
	FFloatRange TentacleTimeoutRange; // 0xc
	FWeightedProbabilityRangeOfRanges TentacleHealthRange; // 0x20
	TArray<FKrakenShipWrappingBehaviourNamedTransform> TentacleLocations; // 0x50
	float TentacleTimeout; // 0x60
	float TentacleHealth; // 0x64
	FTransform TentacleLocation; // 0x70
};

struct FDebugMenuDataAssetEntry {
	FString MenuPath; // 0x0
	FString DisplayName; // 0x10
	FString ConsoleCommand; // 0x20
	bool CloseMenuWhenExecuted; // 0x30
	bool AvailableInShippingBuilds; // 0x31
	bool AddToCommonlyUsedMenu; // 0x32
};

struct FTeleportLocation {
	bool Valid; // 0x0
	USceneComponent* TeleportBase; // 0x8
	FVector TeleportLocation; // 0x10
	FRotator TeleportRotation; // 0x1c
};

struct FWwiseBinkTrackMappings {
	EWwiseLanguageOrder mLanguage; // 0x0
	TArray<FWwiseBinkTrackMapping> mChannels; // 0x8
};

struct FAdditionalWave {
	TArray<FAdditionalCaptainTarget> TargetOptions; // 0x0
	FWeightedProbabilityRange NumberOfTargets; // 0x10
	bool RandomSelect; // 0x30
	UAICombatDialogue* AICombatDialogue; // 0x38
};

struct FAddAITypeSpawnRuleData {
	FString TypeName; // 0x0
	FString Region; // 0x10
	bool Enabled; // 0x20
};

struct FVoyageProposalWonVotingSessionTelemetryEvent {
	FGuid VoyageProposalSessionId; // 0x0
	FString VoyageProposalEntitlementId; // 0x10
	int32_t NumberOfVotes; // 0x20
	int32_t SessionLength; // 0x24
};

struct FTwoVectors {
	FVector v1; // 0x0
	FVector v2; // 0xc
};

struct FEventOptimalInteractionObjectChanged {
	UObject* PreviousFocusObject; // 0x0
	UObject* NewFocusObject; // 0x8
};

struct FClientBootFlowExistingSessionTelemetry {
	FString SessionId; // 0x0
	FString Playmode; // 0x10
	FString SessionType; // 0x20
	FString OwningUserId; // 0x30
};

struct FPetRoamingAnimationStateDefinition {
	EPetMontageAnimationType AnimationType; // 0x0
	UAnimMontage* MontageData; // 0x8
	FPetAnimationCycleMontage CycleData; // 0x10
	EWieldAnimationLocation CurrentWieldableLocation; // 0x28
	EWieldAnimationLocation ResetWieldableLocation; // 0x29
	float BlendInTime; // 0x2c
	float BlendOutTime; // 0x30
	bool Uninterruptable; // 0x34
	bool ResetWieldableIfInterrupted; // 0x35
	bool AllowHappyReact; // 0x36
};

struct FCompanyProgressUpdateEvent {
	FCompanyReputationProgressModel CompanyProgress; // 0x0
};

struct FPetLoadoutContainer {
	FPetLoadout Loadout; // 0x0
	bool HasBeenSet; // 0x18
};

struct FSetRadialItemsAggregate : FRadialInventoryEvent {
	TArray<FSetItemOnRadialInventorySlot> Items; // 0x8
	TArray<FSetTotalItemsOnRadialInventorySlot> Quantities; // 0x18
	TArray<FSetMapTypeOnRadialInventorySlot> Maps; // 0x28
};

struct FPurchasePremiumCurrencyErrorEvent {
	FString Message; // 0x0
};

struct FEventResetSettingsGroup {
	FName SettingsGroupNameToReset; // 0x0
};

struct FMovieSceneSequencePlaybackSettings {
	int32_t LoopCount; // 0x0
	float PlayRate; // 0x4
	bool bRandomStartTime; // 0x8
	float StartTime; // 0xc
	bool bRestoreState; // 0x10
	TScriptInterface<Class> BindingOverrides; // 0x18
};

struct FTimelineFloatTrack {
	UCurveFloat* FloatCurve; // 0x0
	DelegateProperty InterpFunc; // 0x8
	FName FloatPropertyName; // 0x18
	UFloatProperty* FloatProperty; // 0x20
};

struct FGetGeysersDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FGeyserStateData> Data; // 0x8
};

struct FServerRegionModel {
	FVector2D Position; // 0x0
	float Radius; // 0x8
};

struct FNPCCustomAnimationBlueprintPlayingMontage {
	UAnimMontage* OneShot; // 0x0
	UAnimMontage* ContinouousIn; // 0x8
	UAnimMontage* ContinouousLoop_A; // 0x10
	UAnimMontage* ContinouousLoop_B; // 0x18
	UAnimMontage* ContinouousOut; // 0x20
};

struct FAICustomClassIdNameOverrides {
	TArray<UAIClassId*> ClassIds; // 0x0
	TArray<FText> Names; // 0x10
};

struct FEventPlayerControllerHitNotification {
	bool PlaySfx; // 0x0
};

struct FNamedPointsCollectionGroup {
	FName GroupName; // 0x0
	TArray<FOrientedPoint> GroupPoints; // 0x8
	TArray<ENamedPointGroupSearchTag> GroupTags; // 0x18
};

struct FKrakenShipWrappingBehaviourTentacleHeadParams {
	AKrakenAnimatedTentacle* TentacleType; // 0x0
	FWeightedProbabilityRangeOfRanges DamageRequiredToRelocate; // 0x8
	float RelocationThreshold; // 0x38
	float ChanceOfSwitchingSides; // 0x3c
	float ChanceOfSelectingNearLocationAfterSwitchingSides; // 0x40
	float ChanceOfSelectingSelectingDifferentDistanceFromShipWhenRemaningOnSameSide; // 0x44
};

struct FGameServerWebSocketEntityEvent {
	FString EventID; // 0x0
	FString ServerId; // 0x10
	FDateTime ServerTimeUTC; // 0x20
};

struct FRadialInventoryEvent {
	int32_t RadialIdentifier; // 0x0
};

struct FMaterialQualityOverrides {
	bool bEnableOverride; // 0x0
	bool bForceFullyRough; // 0x1
	bool bForceNonMetal; // 0x2
	bool bForceDisableLMDirectionality; // 0x3
};

struct FEventCrewReleasedCapstan {
	FGuid CrewId; // 0x0
};

struct FWeightedContestZone {
	FName ContestZoneName; // 0x0
	int32_t Weight; // 0x8
};

struct FWeightedSpawnDirection {
	float DirectionAngle; // 0x0
	float DirectionWidth; // 0x4
	float Weight; // 0x8
	TArray<FWeightedSpawnOffset> SpawnOffsets; // 0x10
};

struct FTreasureSoldCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
	FString CrewId; // 0x28
	FString TreasureType; // 0x38
	FString VendorId; // 0x48
	FString CompanyId; // 0x58
};

struct FPlayerItemAddToContainerCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FPlayModeLevelArray {
	TArray<FStringAssetReference> PlayModeLevels; // 0x0
	TArray<FSubModeLevel> SubModes; // 0x10
};

struct FAttackTimingWindow {
	float StartTime; // 0x0
	float EndTime; // 0x4
};

struct FUIKeyBindingOptionSelectedTelemetryEvent {
	FString BindingSet; // 0x0
	FKeyBinding Value; // 0x10
};

struct FAthenaAnimationObjectEquipAnimations {
	UAnimSequence* Equip; // 0x0
	UBlendSpace* EquipAsBlendSpace; // 0x8
	UBlendSpace* EquipSwimming; // 0x10
	UAnimSequence* UnEquip; // 0x18
	UBlendSpace* UnEquipAsBlendSpace; // 0x20
	UAnimSequence* Pickup; // 0x28
	UAnimSequence* Drop; // 0x30
	bool UseEquipBlendSpace; // 0x38
	bool UseUnequipBlendSpace; // 0x39
};

struct FAchievementSailThroughStormAtNightWithLightsOff {
	uint32_t RequiredTravelDistance; // 0x0
	AShip* Ship; // 0x50
};

struct FCharacterAnimationIKUpdateParams {
	float CurrentAlpha; // 0x0
	float TranslationStrength; // 0x4
	float RotationStrength; // 0x8
	FVector Location; // 0xc
	FQuat Orientation; // 0x20
	EHIKEffectorSpace EffectorSpace; // 0x30
	FName ParentBone; // 0x34
};

struct FBuildPromotionTestSettings {
	FFilePath DefaultStaticMeshAsset; // 0x0
	FBuildPromotionImportWorkflowSettings ImportWorkflow; // 0x10
	FBuildPromotionOpenAssetSettings OpenAssets; // 0x160
	FBuildPromotionBlueprintSettings BlueprintSettings; // 0x1c0
	FBuildPromotionNewProjectSettings NewProjectSettings; // 0x1e0
	FFilePath SourceControlMaterial; // 0x200
};

struct FEngineServiceAuthDeny {
	FString UserName; // 0x0
	FString UserToDeny; // 0x10
};

struct FEventAthenaLoadingScreenBlockUntilUIIntialisedClear {
	FString Description; // 0x0
};

struct FCustomAnimationMontageId {
	FName CustomAnimationMontageId; // 0x0
};

struct FSessionTypeSelectionResponseEvent {
	ECrewSessionType SessionType; // 0x0
};

struct FEventAmmoChanged {
	int32_t Ammo; // 0x0
};

struct FQuestVariableAISpawnerArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FPremiumCatalogOfferGroup {
	FText Title; // 0x0
	TArray<FGuid> Children; // 0x38
};

struct FExitTunnelOfTheDamnedActionStateParams {
	float ClientSetupResponseTimeout; // 0x0
	float CameraAnimationRate; // 0x4
	float CameraAnimationScale; // 0x8
	float CameraAnimationBlendInTime; // 0xc
	float CameraAnimationBlendOutTime; // 0x10
};

struct FThrowGrenadeMulticastRpc : FBoxedRpc {
	AActor* Wielder; // 0x10
	AGrenade* Grenade; // 0x18
	FVector ServerThrowLocation; // 0x20
	FVector LaunchVelocity; // 0x2c
	AActor* ThrownProjectileType; // 0x38
	float FirstPersonScaleModifier; // 0x40
	float ProjectileGravityScale; // 0x44
	FVector FirstPersonThrowOffset; // 0x48
	bool UseVisualThrowOffset; // 0x54
};

struct FShipAnnouncementCinematicEvent {
	FText ShipName; // 0x0
	FText ShipTitle; // 0x38
};

struct FEventPlayerFellDistance {
	float FallDamage; // 0x0
	float LandingSpeed; // 0x4
};

struct FEventPetRefusedFood : FEventPetFoodBase {
	AActor* FeedingActor; // 0x10
};

struct FPlayerKillAICustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FTextBlockStyle : FSlateWidgetStyle {
	FSlateFontInfo Font; // 0x8
	FSlateColor ColorAndOpacity; // 0x48
	FVector2D ShadowOffset; // 0x78
	FLinearColor ShadowColorAndOpacity; // 0x80
	FSlateColor SelectedBackgroundColor; // 0x90
	FLinearColor HighlightColor; // 0xc0
	FSlateBrush HighlightShape; // 0xd0
};

struct FAthenaAnimationAsyncLoadedObjectIdleAnimations {
	UAnimSequence* Idle1; // 0x0
	UAnimSequence* Idle2; // 0x20
	UAnimSequence* Idle3; // 0x40
};

struct FEventStartedBeingFed {
	AActor* FedBy; // 0x0
};

struct FWaterModifierZoneParametersAndLocation {
	FWaterModifierZoneParameters WaterModifierZoneParameters; // 0x0
	FVector Location; // 0x78
};

struct FFractureMaterial {
	FVector2D UVScale; // 0x0
	FVector2D UVOffset; // 0x8
	FVector Tangent; // 0x10
	float UAngle; // 0x1c
	int32_t InteriorElementIndex; // 0x20
};

struct FMeshProxySettings {
	int32_t ScreenSize; // 0x0
	FMaterialSimplificationSettings Material; // 0x4
	int32_t TextureWidth; // 0x48
	int32_t TextureHeight; // 0x4c
	bool bExportNormalMap; // 0x50
	bool bExportMetallicMap; // 0x51
	bool bExportRoughnessMap; // 0x52
	bool bExportSpecularMap; // 0x53
	bool bRecalculateNormals; // 0x54
	float HardAngleThreshold; // 0x58
	int32_t MergeDistance; // 0x5c
	bool bUseClippingPlane; // 0x60
	float ClippingLevel; // 0x64
	int32_t AxisIndex; // 0x68
	bool bPlaneNegativeHalfspace; // 0x6c
};

struct FEventPlayerEnteredAISpawnRegion {
	AActor* Player; // 0x0
};

struct FEventPlayerCharacterEnteredShip {
	AActor* PlayerCharacter; // 0x0
};

struct FCosmeticItems {
	TArray<AActor*> CosmeticItemArray; // 0x0
};

struct FGameEventExclusionZone {
	FVector2D Location; // 0x0
	float Radius; // 0x8
};

struct FConvexElement2D {
	TArray<FVector2D> VertexData; // 0x0
};

struct FVectorParameterNameAndCurves {
	FName ParameterName; // 0x0
	int32_t Index; // 0x8
	FRichCurve XCurve; // 0x10
	FRichCurve YCurve; // 0x88
	FRichCurve ZCurve; // 0x100
};

struct FTaleQuestChecklistItem {
	FText Description; // 0x0
	int32_t NumCurrentCompletions; // 0x38
	int32_t NumRequiredCompletions; // 0x3c
	UTexture* UnfulfilledIcon; // 0x40
	UTexture* FulfilledIcon; // 0x48
};

struct FDialogueWaveParameter {
	UDialogueWave* DialogueWave; // 0x0
	FDialogueContext Context; // 0x8
};

struct FModalInteractionActionStateSerialisableData : FActionStateSerialisableData {
	FNetActorPtr Interaction; // 0x30
};

struct FExpandableAreaStyle : FSlateWidgetStyle {
	FSlateBrush CollapsedImage; // 0x8
	FSlateBrush ExpandedImage; // 0x98
};

struct FRewardRequestCrew {
	FGuid CrewId; // 0x0
	TArray<FPirateIdentity> Pirates; // 0x10
	FName EmissaryAffiliation; // 0x20
	uint32_t EmissaryLevel; // 0x28
};

struct FAthenaAnimationCannonAnimData {
	UBlendSpace1D* Into; // 0x0
	TArray<UBlendSpace1D*> Idle; // 0x8
	UBlendSpace1D* Fire; // 0x18
	UBlendSpace1D* Outof; // 0x20
};

struct FSessionVisibilityChangedTelemetryEvent {
	FString SessionVisibility; // 0x0
};

struct FGameNarrationOverrideStateChangeEvent {
	int32_t Status; // 0x0
};

struct FBranchingPoint : FAnimLinkableElement {
	FName EventName; // 0x30
	float DisplayTime; // 0x38
	float TriggerTimeOffset; // 0x3c
};

struct FSoundClassAdjuster {
	USoundClass* SoundClassObject; // 0x0
	float VolumeAdjuster; // 0x8
	float PitchAdjuster; // 0xc
	char bApplyToChildren : 1; // 0x10
	float VoiceCenterChannelVolumeAdjuster; // 0x14
};

struct FAthenaAIAbilityDamageStage {
	TArray<UAthenaAIAbilityStageParams*> AbilitiesInStage; // 0x0
};

struct FRequestCreateItemPreviewEvent {
	int32_t ResolutionX; // 0x0
	int32_t ResolutionY; // 0x4
};

struct FEventPopUpQueueServicePaused {
	bool Paused; // 0x0
	int32_t Reason; // 0x4
};

struct FFireCellAudioParams {
	UWwiseObjectPoolWrapper* EmitterPool; // 0x0
	UWwiseObjectPoolWrapper* DousePool; // 0x8
	UWwiseEvent* FirePlay; // 0x10
	UWwiseEvent* FireStop; // 0x18
	UWwiseEvent* FireDouse; // 0x20
	FName FireSwitchGroup; // 0x28
	FName FireSwitchBurning; // 0x30
	FName FireSwitchKindled; // 0x38
};

struct FPlayerStartedDiggingEvent {
	AActor* ActorBeingDugUp; // 0x0
};

struct FPlayerHealthChangeCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FServerMigrationSetServerConfigMessage {
	FTimespan ExpectedServerLifetime; // 0x0
};

struct FWwiseAudioAcousticSurfaceParams {
	float Thickness; // 0x0
	float Reflectivity; // 0x4
};

struct FEmissaryLeaderboardScoreUpdatedNetworkEvent : FNetworkEventStruct {
	FName EmissaryAffiliation; // 0x10
	int64_t From; // 0x18
	int64_t To; // 0x20
};

struct FAthenaAnimationRowboatParams {
	bool InLeftArmRow; // 0x0
	bool InLeftArmRecover; // 0x1
	bool InRightArmRow; // 0x2
	bool InRightArmRecover; // 0x3
	float LeftArmForce; // 0x4
	float LeftArmRecover; // 0x8
	float RightArmForce; // 0xc
	float RightArmRecover; // 0x10
	ERowBraking Braking; // 0x14
	bool BrakingLeftOrBoth; // 0x15
	bool BrakingRightOrBoth; // 0x16
	int32_t Direction; // 0x18
	bool PlayIdle; // 0x1c
	bool LeftArmInactive; // 0x1d
	bool RightArmInactive; // 0x1e
	FVector CameraAdjustment; // 0x20
	bool IsSeated; // 0x2c
	FAthenaAnimationRowboatAnimationsFirstPerson RowBoatAnimationsFirstPerson; // 0x30
	FAthenaAnimationRowboatAnimationsThirdPerson RowBoatAnimationsThirdPerson; // 0x60
	FAthenaAnimationRowboatAnimationsPassenger RowBoatAnimationsPassenger; // 0xb0
};

struct FEventLocalPlayerEnteredSittingState {
	bool SeatSupportsThirdPersonCamera; // 0x0
};

struct FAggressiveGhostShipRewardData {
	TArray<FGhostShipRewardData> Rewards; // 0x0
	float SpawnRate; // 0x10
};

struct FTableRowStyle : FSlateWidgetStyle {
	FSlateBrush SelectorFocusedBrush; // 0x8
	FSlateBrush ActiveHoveredBrush; // 0x98
	FSlateBrush ActiveBrush; // 0x128
	FSlateBrush InactiveHoveredBrush; // 0x1b8
	FSlateBrush InactiveBrush; // 0x248
	FSlateBrush EvenRowBackgroundHoveredBrush; // 0x2d8
	FSlateBrush EvenRowBackgroundBrush; // 0x368
	FSlateBrush OddRowBackgroundHoveredBrush; // 0x3f8
	FSlateBrush OddRowBackgroundBrush; // 0x488
	FSlateColor TextColor; // 0x518
	FSlateColor SelectedTextColor; // 0x548
	FSlateBrush DropIndicator_Above; // 0x578
	FSlateBrush DropIndicator_Onto; // 0x608
	FSlateBrush DropIndicator_Below; // 0x698
};

struct FKrakenShipWrappingBehaviourParamsCollection {
	TArray<UKrakenShipWrappingBehaviourParamsDataAsset*> Params; // 0x0
};

struct FContestMapContents {
	FString VoyageName; // 0x0
	FString ScoreboardTitle; // 0x10
	TArray<FContestMapCrewData> CrewsData; // 0x20
	TArray<EScoreReason> ScoreReasonsToShowInfo; // 0x30
};

struct FMovieSceneStringPropertySectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x18
	FStringCurve StringCurve; // 0x38
};

struct FServerShutdownRequestFilter {
	FDateTime ShutdownTimeUtc; // 0x0
	FString VersionNumber; // 0x8
	EPlayMode Playmode; // 0x18
	EPlayModeVariant PlayModeVariant; // 0x19
	EServerEnvironmentShutdownStatus ServerEnvironmentStatus; // 0x1a
	FString FeatureHash; // 0x20
	FString BuildId; // 0x30
	uint32_t AgeOverSeconds; // 0x40
	FGuid SessionId; // 0x44
};

struct FEnableRadialInventoryMouseControl : FRadialInventoryEvent {
	int32_t RadialIdentifier; // 0x0
};

struct FWeightedTallTaleContestRecipe {
	UTallTaleContestRecipeDataAsset* TallTaleContest; // 0x0
	int32_t WeightedChance; // 0x8
};

struct FOutgoingServerMigrationCompletedEvent : FServerMigrationInstanceEventBase {
	FGuid ServerId; // 0x0
	FGuid MigrationId; // 0x10
};

struct FCleanlinessInfo {
	EDirtinessType DirtinessType; // 0x0
	float Strength; // 0x4
	float QuickClean; // 0x8
};

struct FBlendSample {
	UAnimSequence* Animation; // 0x0
	FVector SampleValue; // 0x8
};

struct FProjectileHitTelemetryEvent {
	FGuid AttackId; // 0x0
	FString ProjectileId; // 0x10
	FString HitObjectId; // 0x20
	FString HitObjectType; // 0x30
};

struct FEventClientPlayerSpawnedBeforeGameState : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FPlane : FVector {
	float W; // 0xc
};

struct FWeightedSpawnOffset {
	float MinSpawnDistance; // 0x0
	float MaxSpawnDistance; // 0x4
	float Weight; // 0x8
	FWeightedProbabilityRangeOfRanges SpawnRotations; // 0x10
};

struct FNotesManagementAddNoteResponseModel {
	bool Success; // 0x0
	FGuid NoteId; // 0x4
};

struct FResetCustomConfigForPlayerData {
	int32_t PlayerNetGUID; // 0x0
};

struct FCustomCalculationBasedFloat {
	UGameplayModMagnitudeCalculation* CalculationClassMagnitude; // 0x0
	FScalableFloat Coefficient; // 0x8
	FScalableFloat PreMultiplyAdditiveValue; // 0x28
	FScalableFloat PostMultiplyAdditiveValue; // 0x48
};

struct FShockwaveDamagerShipDamage {
	float MaxDistanceInMetres; // 0x0
	int32_t MinNumHoles; // 0x4
	int32_t MaxNumHoles; // 0x8
	int32_t LevelOfHoleDamage; // 0xc
};

struct FCrewSessionLeaveCustomServerEvent : FGlobalCustomServerEvent {
	FString CrewId; // 0x18
};

struct FUIReturnedToPlayerEvent : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FEditorImportExportTestDefinition {
	FFilePath ImportFilePath; // 0x0
	FString ExportFileExtension; // 0x10
	bool bSkipExport; // 0x20
	TArray<FImportFactorySettingValues> FactorySettings; // 0x28
};

struct FPendingInviteViewModel {
	FString XUID; // 0x0
	FString GamerTag; // 0x10
};

struct FVoyageProposalDescViewModel : FVoyageDisplayInformation {
	FString ProposalDesc; // 0x98
	EVoyageDisplayState State; // 0xa8
	int32_t VoyageIndex; // 0xac
};

struct FBeamTargetData {
	FName TargetName; // 0x0
	float TargetPercentage; // 0x8
};

struct FCampfireDamageLightingChance {
	UDamagerType* DamageType; // 0x0
	float Chance; // 0x8
};

struct FAggressiveGhostShipEncounterFormationDesc {
	TArray<FAggressiveGhostShipEncounterFormationLocationDesc> Locations; // 0x0
};

struct FActiveGameplayCueContainer : FFastArraySerializer {
	TArray<FActiveGameplayCue> GameplayCues; // 0xa8
	UAbilitySystemComponent* Owner; // 0xb8
};

struct FWeightedRewardTable {
	TArray<FWeightedRewardTableUnit> Rewards; // 0x0
};

struct FDebugCrewContestInfo {
	FGuid CrewId; // 0x0
	FString ShipName; // 0x10
	int32_t Score; // 0x20
};

struct FSeasonRewardEarnedEvent {
	FGuid SeasonId; // 0x0
	bool MultipleRewards; // 0x10
	TArray<FSeasonReward> Rewards; // 0x18
};

struct FIslandEventTooltipData {
	FVoyageDisplayInformation DisplayInfo; // 0x0
	FGuid EventID; // 0x98
};

struct FAthenaAnimationWaterPump {
	AActor* WaterPump; // 0x10
};

struct FEventUserGameSettingsSetKeyBindingToInvalid {
	EBindingSet BindingSet; // 0x0
	FString BindingName; // 0x8
	EInputControllerType ControllerType; // 0x18
};

struct FLargeSessionEncounterDevTelemetryEvent {
	FString EncounteredUserId; // 0x0
	bool TaskSucceeded; // 0x10
};

struct FEventSpawnLocationCreated {
	ASpawnLocation* SpawnLocation; // 0x0
};

struct FTTFloatTrack : FTTTrackBase {
	UCurveFloat* CurveFloat; // 0x10
};

struct FEventWheelStoppedMoving {
	bool IsAtEnd; // 0x0
};

struct FEventCharacterInert {
	bool bIsInert; // 0x0
};

struct FNullActionStateConstructionInfo : FActorActionStateConstructionInfo {
	TWeakObjectPtr<AActor> ActorOwner; // 0x28
};

struct FIgnoreActorInfo {
	TWeakObjectPtr<AActor> Actor; // 0x0
	float TimeRemaining; // 0x8
};

struct FClothingAssetData {
	FName AssetName; // 0x0
	FString ApexFileName; // 0x8
	bool bClothPropertiesChanged; // 0x18
	FClothPhysicsProperties PhysicsProperties; // 0x1c
};

struct FCommerceRemoteServiceWalletBalanceResponse {
	TMap<FString, uint32_t> Balances; // 0x0
};

struct FAthenaAnimationEmoteAnimgraphStructure {
	TArray<FAthenaAnimationEmoteAnimations> EmoteAnimationArray; // 0x0
	UAnimSequence* OneShotAnimationToUse; // 0x10
	UAnimSequence* ContinuousInAnimationToUse; // 0x18
	UAnimSequence* ContinuousLoopAnimationToUseA; // 0x20
	UAnimSequence* ContinuousLoopAnimationToUseB; // 0x28
	bool EmoteActive; // 0x30
	bool OneShotEmoteActive; // 0x31
	bool ContinuousEmoteActive; // 0x32
	bool ContinuousEmoteLoopExit; // 0x33
};

struct FKrakenDynamicsParams {
	FKrakenDynamicsStateParams AmbientWobble; // 0x0
	FKrakenDynamicsStateParams EnteringShakeAttack; // 0x10
	FKrakenDynamicsStateParams ShakeAttack; // 0x20
	FKrakenDynamicsStateParams ExitingShakeAttack; // 0x30
	FKrakenDynamicsStateParams HeavyAttack; // 0x40
};

struct FFloatRange {
	FFloatRangeBound LowerBound; // 0x0
	FFloatRangeBound UpperBound; // 0x8
};

struct FMemoryVisualiserStat {
	FName StatName; // 0x0
	FString DisplayName; // 0x8
	float MemoryUsageMB; // 0x18
};

struct FHierarchicalSimplification {
	bool bSimplifyMesh; // 0x0
	float DrawDistance; // 0x4
	float DesiredBoundRadius; // 0x8
	float DesiredFillingPercentage; // 0xc
	int32_t MinNumberOfActorsToBuild; // 0x10
	FMeshProxySettings ProxySetting; // 0x14
	FMeshMergingSettings MergeSetting; // 0x88
};

struct FParticleSysParam {
	FName Name; // 0x0
	EParticleSysParamType ParamType; // 0x8
	float Scalar; // 0xc
	float Scalar_Low; // 0x10
	FVector Vector; // 0x14
	FVector Vector_Low; // 0x20
	FColor Color; // 0x2c
	AActor* Actor; // 0x30
	UMaterialInterface* Material; // 0x38
	TArray<FEmitterPointData> EmitterPoints; // 0x40
};

struct FCompressedOffsetData {
	TArray<int32_t> OffsetData; // 0x0
	int32_t StripSize; // 0x10
};

struct FEarthquakeForceFeedback {
	TArray<FEarthquakeForceFeedbackOption> ForceFeedbackOptions; // 0x0
	FWeightedProbabilityRangeOfRanges TimeBetweenRumbles; // 0x10
};

struct FTaleResourceHandle {
	int32_t ResourceHandle; // 0x0
	int32_t ValidationId; // 0x4
};

struct FPartsCustomisation {
	TArray<FPartDesc> Parts; // 0x0
	TArray<UShipCustomizationDesc*> InitialEntitlements; // 0x10
};

struct FAthenaAnimationFallbackLocomotionAnimations {
	UBlendSpace* FallbackLocomotionMovement; // 0x0
	UAnimSequence* FallbackTurningLeft; // 0x8
	UAnimSequence* FallbackTurningRight; // 0x10
	UBlendSpace* FallbackLocomotionSwimming; // 0x18
};

struct FVFXHandlerComponentParams {
	UParticleSystem* ParticleSystem; // 0x0
	FVector VFXRelativeOffset; // 0x8
	FVector VFXScale; // 0x14
	FRotator VFXRotationOffset; // 0x20
	FName VFXAttachSocket; // 0x2c
	float VFXDrivingCurveValue; // 0x34
	EVfxCustomLocalSpaceMode VFXCustomLocalSpaceMode; // 0x38
};

struct FKrakenShipHittingBehaviourImpactParams {
	int32_t Weight; // 0x0
	FTransform TentacleTransform; // 0x10
	FVector ImpactLocation; // 0x40
	FVector ImpactForce; // 0x4c
	FVector DamageLocation; // 0x58
	FWeightedProbabilityRangeOfRanges NumZonesToDamage; // 0x68
};

struct FCanvasWorldMapShipLocation {
	FGuid CrewId; // 0x0
	UShipSize* ShipSize; // 0x10
	FVector2D Location; // 0x18
	float Rotation; // 0x20
	FCanvasLerpData LerpData; // 0x24
	bool IsInAlliance; // 0x34
	char ReapersMarkLevel; // 0x35
	char EmissaryLevel; // 0x36
	bool IsContestShip; // 0x37
	UTexture* CrewLiveryOverlayIcon; // 0x38
	bool IsReapersTrackedShip; // 0x40
	bool IsInTunnel; // 0x41
};

struct FScalarMaterialInput : FMaterialInput {
	char UseConstant : 1; // 0x38
	float Constant; // 0x3c
};

struct FShipLeak {
	FShipLeakParams Params; // 0x0
	UParticleSystemComponent* SplashParticleSystem; // 0x40
};

struct FPremiumCurrencyItemsErrorEvent {
	FString Message; // 0x0
};

struct FClientEndEngagementMessageTelemetryEvent {
	float ScreenDuration; // 0x0
	FString EndedScreen; // 0x8
};

struct FAthenaAnimationSkeletonEmoteActionAnimations {
	UWieldableItemAnimationStoreId* UseWithObject; // 0x0
	TArray<UAnimSequence*> Taunt; // 0x8
	TArray<UAnimSequence*> Cheer; // 0x18
};

struct FHUDBlur {
	UMaterialParameterCollectionInstance* ScreenEffectsMaterialParameterCollectionInstance; // 0x0
};

struct FNPCStateData : FActorStateData {
	FString Name; // 0x20
};

struct FVoyageBegunAnimationEvent {
	FText ShipName; // 0x0
	TArray<FString> CrewMembers; // 0x38
	int32_t ChapterIndex; // 0x48
	int32_t ChapterCount; // 0x4c
	FText VoyageTitle; // 0x50
	FString AudioSwitchName; // 0x88
	FString AudioSwitchValue; // 0x98
	FName CompanyId; // 0xa8
};

struct FStatusDeactivatedEvent {
	FGuid Id; // 0x0
	FName StatusName; // 0x10
};

struct FWorldRegionMapping {
	USeaId* SeaId; // 0x0
	EWorldRegion WorldRegion; // 0x8
};

struct FShipwreckSiteRotation {
	FRotator Base; // 0x0
	FRotator MaxVariance; // 0xc
};

struct FDamageInstance {
	FGuid AttackId; // 0x0
	AActor* DirectInstigator; // 0x10
	AActor* RootInstigator; // 0x18
	float Amount; // 0x20
	EHealthChangedReason Reason; // 0x24
};

struct FMovieSceneSequenceCachedSignature {
	TWeakObjectPtr<UMovieSceneSequence> Sequence; // 0x0
	FGuid CachedSignature; // 0x8
};

struct FSeasonTierInfo {
	int32_t Number; // 0x0
	FString LocalizedTitle; // 0x8
};

struct FPrimitiveSphereEmitterAngleRanges {
	FVector2D HorizontalAngle; // 0x0
	FVector2D VerticalAngle; // 0x8
};

struct FVomitVFXObject {
	FName VFXName; // 0x0
	UObject* FirstPerson; // 0x8
	UObject* ThirdPerson; // 0x10
};

struct FVectorParameterValue {
	FName ParameterName; // 0x0
	FLinearColor ParameterValue; // 0x8
	FGuid ExpressionGUID; // 0x18
};

struct FAssetEditorOrbitCameraPosition {
	bool bIsSet; // 0x0
	FVector CamOrbitPoint; // 0x4
	FVector CamOrbitZoom; // 0x10
	FRotator CamOrbitRotation; // 0x1c
};

struct FWreckSpawnQueryPriorityData {
	TArray<FWreckQueryPriorityEntry> PriorityTable; // 0x0
};

struct FMovieScenePossessable {
	FGuid Guid; // 0x0
	FString Name; // 0x10
	UObject* PossessedObjectClass; // 0x20
	FGuid ParentGuid; // 0x28
};

struct FTestTextObject {
	FText TestText; // 0x0
	FText TestTextExport; // 0x38
};

struct FQuestVariableNotificationDesc : FQuestVariable {
	FName ParamName; // 0x8
};

struct FEndPhysicsTickFunction : FTickFunction {
	ETickingGroup TickGroup; // 0x30
	char bTickEvenWhenPaused : 1; // 0x32
	char bCanEverTick : 1; // 0x32
	char bStartWithTickEnabled : 1; // 0x32
	char bAllowTickOnDedicatedServer : 1; // 0x32
	float TickInterval; // 0x40
};

struct FEventTeleportLocationCreated {
	FTeleportLocation TeleportLocation; // 0x0
};

struct FWeightedAnimationData {
	FStringAssetReference Animation; // 0x0
	float Weighting; // 0x10
};

struct FAIActorTimeout {
	AActor* AIActor; // 0x0
	float Timer; // 0x8
};

struct FEventPlayerRemovedFromCrew {
	APlayerState* UniqueId; // 0x10
};

struct FServiceStatusNotificationCollectionModel {
	TArray<FServiceStatusNotificationModel> Notifications; // 0x0
};

struct FRemoveStatusesData {
	int32_t ActorId; // 0x0
	TArray<FString> Statuses; // 0x8
};

struct FAnimNode_ObserveBone : FAnimNode_SkeletalControlBase {
	FBoneReference BoneToObserve; // 0x58
	EBoneControlSpace DisplaySpace; // 0x64
	bool bRelativeToRefPose; // 0x65
	FVector Translation; // 0x68
	FRotator Rotation; // 0x74
	FVector Scale; // 0x80
};

struct FAshenLordFireShroudParams {
	AStatusEffectOverlapZone* FireShroudZoneClass; // 0x0
	FVector FireShroudCollisionVolume; // 0x8
};

struct FEventTinySharkSpawned {
	FString TinySharkPartTag; // 0x0
	FGuid SpawnConfigId; // 0x10
};

struct FScoreReasonIcons {
	EScoreReason ReasonForScore; // 0x0
	FStringAssetReference ScoringIconAssetReference; // 0x8
	UTexture* ScoreScrollScoringIcon; // 0x18
};

struct FEventOverMemoryThreshold {
	FString EventID; // 0x0
	FDateTime ServerTimeUTC; // 0x10
	int32_t MemoryUsedPercentage; // 0x18
};

struct FInputChord {
	FKey Key; // 0x0
	char bShift : 1; // 0x20
	char bCtrl : 1; // 0x20
	char bAlt : 1; // 0x20
	char bCmd : 1; // 0x20
};

struct FCommandData {
	FString Command; // 0x0
	FString Params; // 0x10
};

struct FStunnedActionStateParams {
	float StunDuration; // 0x0
	bool LockCameraMovement; // 0x4
	bool TriggerStunScreenSpaceVFX; // 0x5
	bool ApplyStunAnim; // 0x6
	EStunAnimationType StunAnimType; // 0x7
	bool InterruptMeleeAttacks; // 0x8
	EStunnedActionStateDurationType DurationType; // 0x9
	EStunnedActionStateItemWielding IsItemWieldingAllowed; // 0xa
	UDamagerType* DamagerType; // 0x10
};

struct FDeferralReasonPopUpNotificationInfo {
	FString DeferralReason; // 0x0
	UPopUpMessageDesc* PopUp; // 0x10
};

struct FKrakenTentacleBehaviourParams {
	UEnvQuery* InactiveSpawnQueryTemplate; // 0x0
	float ChanceOfCannonSideSpawn; // 0x8
	UEnvQuery* ActiveCannonSideSpawnQueryTemplate; // 0x10
	UEnvQuery* ActiveNonCannonSideSpawnQueryTemplate; // 0x18
	AKrakenAnimatedTentacle* TentacleClass; // 0x20
	float MinScale; // 0x28
	float MaxScale; // 0x2c
	float MinPlayRateScale; // 0x30
	float MaxPlayRateScale; // 0x34
	float PanicDespawnShipRangeRadius; // 0x38
	float PanicDespawnWatercraftRangeRadius; // 0x3c
	float PanicDespawnTentacleRadius; // 0x40
	float PanicDespawnAnimationPlayRateScale; // 0x44
	float PreDeathAnimationPlayRateScale; // 0x48
	TArray<FKrakenTentacleBehaviourActionChances> OnDamageActionChances; // 0x50
	FWeightedProbabilityRangeOfRanges TimeToSpendInInactiveState; // 0x60
	FWeightedProbabilityRangeOfRanges TimeToSpendInActiveState; // 0x90
};

struct FVoyageLocationParams {
	EVoyageLocationType Type; // 0x0
	FVoyageLocationFixedParams Fixed; // 0x4
	FVoyageLocationRandomParams Random; // 0x10
};

struct FBeamModifierOptions {
	char bModify : 1; // 0x0
	char bScale : 1; // 0x0
	char bLock : 1; // 0x0
};

struct FAnimNode_LookAt : FAnimNode_SkeletalControlBase {
	FBoneReference BoneToModify; // 0x58
	FBoneReference LookAtBone; // 0x64
	FVector LookAtLocation; // 0x70
	EAxisOption LookAtAxis; // 0x7c
	bool bUseLookUpAxis; // 0x7d
	EAxisOption LookUpAxis; // 0x7e
	float LookAtClamp; // 0x80
	EInterpolationBlend InterpolationType; // 0x84
	float InterpolationTime; // 0x88
	float InterpolationTriggerThreashold; // 0x8c
	bool bEnableDebug; // 0x90
};

struct FEventToComponentMapping {
	UWwiseEvent* PlayEvent; // 0x0
	UWwiseEvent* StopEvent; // 0x8
	TArray<UWwiseEmitterComponent*> WwiseEmitterComponents; // 0x10
};

struct FPetChestNamePetFeedbackEvent {
	bool bSuccess; // 0x0
};

struct FActorActionStateConstructionInfo : FActionStateConstructionInfo {
	TWeakObjectPtr<AActor> ActorOwner; // 0x28
};

struct FSwimAttackTargetShipImpulseData {
	UShipSize* ShipSize; // 0x0
	float PushImpulseForce; // 0x8
	FVector PushImpulseLocation; // 0xc
	float PushForceScalingFactorForeAndAftOfShipLowerBound; // 0x18
	float PushForceScalingFactorForeAndAftOfShipUpperBound; // 0x1c
	float RollImpulseForce; // 0x20
	FVector RollImpulseLocation; // 0x24
	float RollForceScalingFactorForeAndAftOfShipLowerBound; // 0x30
	float RollForceScalingFactorForeAndAftOfShipUpperBound; // 0x34
};

struct FWeightedQuestParams {
	float Weight; // 0x0
	FQuestParams Params; // 0x8
};

struct FCrewSessionMemberTelemetry {
	FString UserId; // 0x0
	FString StatusString; // 0x10
	bool IsSessionHost; // 0x20
};

struct FSeasonGoalPopupAsset {
	FName Category; // 0x0
	FStringAssetReference GlowIcon; // 0x8
	FStringAssetReference Icon; // 0x18
	FStringAssetReference ChatIcon; // 0x28
	FString ToastSfxEventName; // 0x38
	FString ToastEventName; // 0x48
	FString ToastSwitchName; // 0x58
	FString ToastSwitchValue; // 0x68
	float ToastHoldDuration; // 0x78
};

struct FGameplayCuePendingExecute {
	FGameplayTag GameplayCueTag; // 0x0
	FPredictionKey PredictionKey; // 0x8
	EGameplayCuePayloadType PayloadType; // 0x20
	UAbilitySystemComponent* OwningComponent; // 0x28
	FGameplayEffectSpecForRPC FromSpec; // 0x30
	FGameplayCueParameters CueParameters; // 0xc0
};

struct FEventCharacterBeginTeleport {
	AActor* Character; // 0x0
	bool PlayOnTeleportBeginSounds; // 0x8
	ETeleportNotificationSource TeleportNotificationSource; // 0x9
};

struct FTreasureChestSoldInAllianceNetworkEvent : FNetworkEventStruct {
	FName RewardId; // 0x10
	FStringAssetReference AllianceIcon; // 0x18
};

struct FAnimNode_LayeredBoneBlend : FAnimNode_Base {
	FPoseLink BasePose; // 0x30
	TArray<FPoseLink> BlendPoses; // 0x48
	TArray<FInputBlendPose> LayerSetup; // 0x58
	TArray<float> BlendWeights; // 0x68
	bool bMeshSpaceRotationBlend; // 0x78
	ECurveBlendOption CurveBlendOption; // 0x79
};

struct FMysteriousNotesCompletionEventsModel {
	FName CompletionIdent; // 0x0
};

struct FProjectile {
	FVector Origin; // 0x0
	FVector Direction; // 0xc
	float MaxDistance; // 0x18
};

struct FInputAxisProperties {
	float DeadZone; // 0x0
	float Sensitivity; // 0x4
	float Exponent; // 0x8
	char bInvert : 1; // 0xc
};

struct FPlayerEntitlements : FEntitlements {
	EEntitlementStatus EntitlementsStatus; // 0x78
};

struct FGuid {
	int32_t A; // 0x0
	int32_t B; // 0x4
	int32_t C; // 0x8
	int32_t D; // 0xc
};

struct FQuestDistributionParams {
	EQuestDistributionMethod Method; // 0x0
	FQuestDistributionAllAtOnceParams AllAtOnce; // 0x8
	FQuestDistributionPerChapterParams PerChapter; // 0x48
	FQuestDistributionFixedChaptersParams FixedChapters; // 0xb0
};

struct FBaseTelemetryFragment {
	FString DateLogged; // 0x0
	FString Sandbox; // 0x10
	FString FeatureConfigHash; // 0x20
	FString StampId; // 0x30
};

struct FUIPremiumStorePanelHighlightEvent {
	FString CurrentPage; // 0x0
	FString CurrentPanel; // 0x10
	FString SessionId; // 0x20
	float TimeOnPanel; // 0x30
};

struct FStorageContainerWeightedItemListFeatureGroup {
	FName Feature; // 0x0
	TArray<FStorageContainerWeightedItemListEntry> Entries; // 0x8
};

struct FFishingMiniGameData {
	UFishingMiniGameSetupDataAsset* SetupDataAsset; // 0x0
	UFishingMiniGameFishDataAsset* FishDataAsset; // 0x8
};

struct FTestUStructMapSerializationObject {
	TMap<FString, FTestSerializationObject> StructMap; // 0x0
};

struct FLightningStrikeFrequency {
	float MinStrength; // 0x0
	FWeightedProbabilityRangeOfRanges TimePerStrike; // 0x8
};

struct FChanceAndBlackboardKeyPair {
	FAIDataProviderFloatValue Chance; // 0x0
	FBlackboardKeySelector BlackboardKey; // 0x30
};

struct FTinySharkParams {
	ATinySharkExperience* TinySharkType; // 0x0
	float TargetRadius; // 0x8
	FVector SpawnOffset; // 0xc
	UClass* TinySharkAIType; // 0x18
	UAthenaAIControllerParamsDataAsset* TinySharkSkillset; // 0x38
	ULoadoutAsset* TinySharkLoadout; // 0x58
	UAIClassId* TinySharkClassID; // 0x78
	FWeightedProbabilityRangeOfRanges LifetimeTimeout; // 0x80
	float TrackedShipDistanceThreshold; // 0xb0
	float RepositionTime; // 0xb4
};

struct FTutorialStepDependencies {
	AAthenaPlayerController* Controller; // 0x0
};

struct FCompanyLevelClaim {
	uint32_t Level; // 0x0
	FString Sig; // 0x8
};

struct FEventPickupableObjectDropped {
	EPhysicalSurface SurfaceType; // 0x0
};

struct FPremiumStoreBundleSetView {
	FGuid Id; // 0x0
	FString PageTitle; // 0x10
	FString PageIcon; // 0x20
	FPremiumStoreBundleView Bundle; // 0x30
	FPremiumStoreItemsView Items; // 0x268
	FString TopBannerUrl; // 0x2a8
	FString BottomBannerUrl; // 0x2b8
};

struct FEventMarkNoteRead {
	APlayerController* PlayerController; // 0x0
	FGuid NoteId; // 0x8
};

struct FCutsceneResponseData {
	FName CutsceneName; // 0x0
};

struct FHealthChange {
	float From; // 0x0
	float To; // 0x4
	EHealthChangedReason Reason; // 0x8
	AActor* DirectInstigator; // 0x10
	AActor* RootInstigator; // 0x18
	FGuid IncidentId; // 0x20
	FVector_NetQuantize10 DirectInstigatorLocation; // 0x30
};

struct FPartCustomisation {
	FString Category; // 0x0
	FStringAssetReference Customisation; // 0x10
};

struct FPoseLink : FPoseLinkBase {
	int32_t LinkID; // 0x0
};

struct FMaterialFunctionInfo {
	FGuid StateId; // 0x0
	UMaterialFunction* Function; // 0x10
};

struct FClothingChestRandomFilter {
	UClothingCategory* Category; // 0x0
	float Likelihood; // 0x8
};

struct FCrewSessionCreatedTelemetryEvent : FCrewSessionBaseSessionTelemetryEvent {
	TArray<FCrewSessionQoSMeasurementTelemetry> QoSTelemetry; // 0x50
};

struct FComboButtonStyle : FSlateWidgetStyle {
	FButtonStyle ButtonStyle; // 0x8
	FSlateBrush DownArrowImage; // 0x2b0
	FSlateBrush MenuBorderBrush; // 0x340
	FMargin MenuBorderPadding; // 0x3d0
};

struct FAchievementUpdatedEvent {
	FString AchievementId; // 0x0
	uint32_t Progress; // 0x10
	bool Successful; // 0x14
	FString Reason; // 0x18
	FString Platform; // 0x28
};

struct FEventPetNameTextboxFocusRequest {
	bool ShouldFocusPetNameTextbox; // 0x0
};

struct FPlayerStatusEffectDeactivatedTelemetryEvent {
	FGuid Id; // 0x0
	FName StatusName; // 0x10
};

struct FBuoyancySampleMovement {
	TArray<FBuoyancySampleMovementConfiguration> Configurations; // 0x0
	UCurveFloat* BuoyancyScalarCurve; // 0x50
	UCurveFloat* ProbeMovementCurve; // 0x58
};

struct FHullDamagePersistenceModel : FPersistenceModel {
	TArray<FHullDamageZoneInfo> DamageZones; // 0x0
};

struct FMovieSceneActorReferenceSectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x18
	FIntegralCurve ActorGuidIndexCurve; // 0x38
	TArray<FGuid> ActorGuids; // 0xa8
};

struct FForkedStep {
	int32_t Index; // 0x0
	FGuid Id; // 0x4
	UTaleQuestStep* Step; // 0x18
};

struct FNPCReactionVOEntry {
	UClass* ActorToReactTo; // 0x0
	FName VOGroupName; // 0x20
	FWeightedProbabilityRangeOfRanges VOCooldown; // 0x28
};

struct FClientEndEngagementMessageEvent {
	float ScreenDuration; // 0x0
	FString EndedScreen; // 0x8
};

struct FBatchedLine {
	FVector Start; // 0x0
	FVector End; // 0xc
	FLinearColor Color; // 0x18
	float Thickness; // 0x28
	float RemainingLifeTime; // 0x2c
	char DepthPriority; // 0x30
};

struct FPlayerEncounterStartTelemetryEvent {
	FGuid EncounterId; // 0x0
	FString EncounteredObjectId; // 0x10
	EEncounterType EncounterType; // 0x20
	EShipRegion ShipRegion; // 0x21
	float EncounterDistance; // 0x24
};

struct FFlameSpecificDataEntry {
	EFlameOfFateType FlameType; // 0x0
	FStringAssetReference TextureAsset; // 0x8
	FPlayerStat StatToFireWhenKilled; // 0x18
};

struct FMeshMemoryConstraintRegistrationFailedTelemetryEvent {
	FString MeshReference; // 0x0
};

struct FItemDiggingAnimationOverride {
	TArray<UClass*> Classes; // 0x0
	UItemDiggingAnimationConfig* DiggingAnimationConfig; // 0x10
};

struct FTavernBoardTakeMapSuccessEvent {
	FCappedCount TakeLimit; // 0x0
};

struct FKrakenAnimatedTentacleAnimationBoneTrack {
	TArray<FKrakenAnimatedTentacleAnimationBoneFrame> Frames; // 0x0
};

struct FDropNoteInfo {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	FString Comment; // 0x18
};

struct FGetCannonsDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FCannonStateData> Data; // 0x8
};

struct FEmissaryVoteAddedEvent {
	FName Company; // 0x0
};

struct FApplyStatusEvent {
	FStatus StatusToApply; // 0x0
};

struct FRequestEquipClothingPiratePreviewEvent {
	FString ClothingDesc; // 0x0
};

struct FEventCharacterDiedDuringReviving {
	ACharacter* OwningCharacter; // 0x0
};

struct FHoleItemToSpawn {
	float Weight; // 0x0
	UItemDesc* ItemDesc; // 0x8
	TArray<EPhysicalSurface> RestrictToSurface; // 0x10
	FName FeatureFlag; // 0x20
};

struct FSoundGroup {
	ESoundGroup SoundGroup; // 0x0
	FString DisplayName; // 0x8
	char bAlwaysDecompressOnLoad : 1; // 0x18
	float DecompressedDuration; // 0x1c
};

struct FPickupObjectActionStateConstructionInfo : FActorActionStateConstructionInfo {
	FNetActorPtr PickupableObject; // 0x30
};

struct FBountySpawnerNewWaveGroupSpawnedEvent {
	bool IsFinalWave; // 0x0
};

struct FNameCurve : FIndexedCurve {
	TArray<FNameCurveKey> Keys; // 0x58
};

struct FLightningTargetSelector {
	TArray<FLightningTarget> Targets; // 0x0
};

struct FQuestVariableTextArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FVolcanoActorStateData : FActorStateData {
	EVolcanoState State; // 0x20
};

struct FEventReceiveExplosiveComponentState {
	UExplosiveComponent* Source; // 0x0
};

struct FKBoxElem : FKShapeElem {
	FVector Center; // 0x20
	FQuat Orientation; // 0x30
	float X; // 0x40
	float Y; // 0x44
	float Z; // 0x48
};

struct FStreamersResponse {
	TArray<FStreamingStatusModel> StreamingStatuses; // 0x0
};

struct FInventoryInteractionTakeRequestEvent {
	int32_t Index; // 0x0
};

struct FVotersByOption {
	int32_t VoteOption; // 0x0
	TArray<UObject*> Voters; // 0x8
};

struct FCaptainedSessionChangedEvent {
	bool IsCaptainedSession; // 0x0
};

struct FMovieSceneSequenceHierarchy {
	TMap<uint32_t, FMovieSceneSubSequenceData> SubSequences; // 0x0
	TMap<uint32_t, FMovieSceneSequenceHierarchyNode> Hierarchy; // 0x50
};

struct FShipHullDamageParams {
	TArray<FShipHullDamageLevel> DamageLevels; // 0x0
};

struct FPetFedTelemetryEvent {
	FString FedWithItemId; // 0x0
	FString FeedingPlayerId; // 0x10
	FGuid FeedingInteractionId; // 0x20
};

struct FGameplayEventExclusionInfo {
	UGameEventType* Type; // 0x0
	float ExclusionRadius; // 0x8
};

struct FTransformBase {
	FName Node; // 0x0
	FTransformBaseConstraint Constraints[0x2]; // 0x8
};

struct FAnimNode_ConvertComponentToLocalSpace : FAnimNode_Base {
	FComponentSpacePoseLink ComponentPose; // 0x30
};

struct FAnimNode_TwoBoneIK : FAnimNode_SkeletalControlBase {
	FBoneReference IKBone; // 0x58
	FVector EffectorLocation; // 0x64
	FVector JointTargetLocation; // 0x70
	FVector2D StretchLimits; // 0x7c
	FName EffectorSpaceBoneName; // 0x84
	char bTakeRotationFromEffectorSpace : 1; // 0x8c
	char bMaintainEffectorRelRot : 1; // 0x8c
	char bAllowStretching : 1; // 0x8c
	EBoneControlSpace EffectorLocationSpace; // 0x90
	EBoneControlSpace JointTargetLocationSpace; // 0x91
	FName JointTargetSpaceBoneName; // 0x94
};

struct FClientInputBlockedTelemetryEvent {
	FString BlockedKey; // 0x0
};

struct FServerMigrationInstanceEventBase {
	FGuid ServerId; // 0x0
	FGuid MigrationId; // 0x10
};

struct FCookStartTelemetryEvent {
	FString ItemName; // 0x0
	ECookingState CookState; // 0x10
	FVector Location; // 0x14
	FGuid CookId; // 0x20
};

struct FPlayersSpawningInTavern {
	APlayerState* PlayerState; // 0x0
};

struct FLevelCancelRequestedTelemetryEvent : FStreamingTelemetryBaseEvent {
	float TimeCancelRequested; // 0x30
};

struct FSeagullManagerFormationOffset {
	TArray<FVector> Offsets; // 0x0
};

struct FEventPlayerTextChatMessageUINotification : FEventUINotification {
	FPlayerTextChatMessage PlayerTextChatMessage; // 0x0
};

struct FCompanyProgressIcon {
	FStringAssetReference Icon; // 0x0
};

struct FEventScreenSizeInfo {
	int32_t ScreenWidth; // 0x0
	int32_t ScreenHeight; // 0x4
	int32_t WindowWidth; // 0x8
	int32_t WindowHeight; // 0xc
	int32_t AutoDetectedMaxVerticalResolution; // 0x10
	int32_t AutoDetectedMachineSpec; // 0x14
	bool IsFullScreen; // 0x18
};

struct FMovieSceneSequenceHierarchyNode {
	FMovieSceneSequenceID ParentID; // 0x0
	TArray<FMovieSceneSequenceID> Children; // 0x8
};

struct FEventCosmeticItemSpawned {
	AActor* Owner; // 0x0
	UCosmeticItemAnimationSetDataAsset* CosmeticData; // 0x8
};

struct FRadialInventoryCenterUpdated : FRadialInventoryEvent {
	float X; // 0x4
	float Y; // 0x8
};

struct FUpdateInteractionEvent {
	FInteractionDefinition Definition; // 0x0
};

struct FPoolableCollectionMapConfigurationEntry {
	UClass* Type; // 0x0
	int32_t Size; // 0x20
};

struct FWaterModifierDrowningParams {
	FBlendableDrowningParams BlendableDrowningParams; // 0x0
};

struct FQuestVariableSharkPawn : FQuestVariable {
	FName ParamName; // 0x8
};

struct FBountyQuestDesc : FQuestDesc {
	UAIBountySpawner* Spawner; // 0x28
	UBountyMapLayout* Layout; // 0x30
	FTreasureMapTextDesc Location; // 0x38
	TArray<FTreasureMapTextDesc> Descriptions; // 0x80
	TArray<FBountyMapTargetDesc> Targets; // 0x90
	TArray<UItemDesc*> BountyRewards; // 0xa0
	TArray<UItemSpawnData*> BountyRewardsSpawnData; // 0xb0
	ALandmark* Landmark; // 0xc0
	float IslandRotation; // 0xc8
	UTexture* MapInventoryTexture; // 0xd0
	FAIBountySpawnerParams SpawnerGeneratedData; // 0xf0
	UTreasureMapItemDesc* OverrideTreasureMapItemDesc; // 0x1b8
};

struct FAICustomNameTitleMapping {
	UAIClassId* AIClassId; // 0x0
	FText Title; // 0x8
};

struct FGetShipwrecksDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FShipwreckStateData> Data; // 0x8
};

struct FAthenaAnimationWheelArmOverlayAnimData {
	UBlendSpace1D* ArmLower; // 0x0
	UBlendSpace1D* ArmRaise; // 0x8
};

struct FActorActivationRequested {
	bool Reset; // 0x0
	float ActivationDuration; // 0x4
};

struct FLandscapeSplineMeshEntry {
	UStaticMesh* Mesh; // 0x0
	TArray<UMaterialInterface*> MaterialOverrides; // 0x8
	char bCenterH : 1; // 0x18
	FVector2D CenterAdjust; // 0x1c
	char bScaleToWidth : 1; // 0x24
	FVector Scale; // 0x28
	LandscapeSplineMeshOrientation Orientation; // 0x34
	ESplineMeshAxis ForwardAxis; // 0x35
	ESplineMeshAxis UpAxis; // 0x36
};

struct FPurchasePremiumCurrencyRequestEvent {
	FString Id; // 0x0
};

struct FLightmassDirectionalLightSettings : FLightmassLightSettings {
	float LightSourceAngle; // 0xc
};

struct FPremiumStoreBundleOffer : FShopOffer {
	FString Saving; // 0x1e0
	FString AccentUrl; // 0x1f0
	FPremiumStoreTimeLimited TimeLimited; // 0x200
	FString RealMoneyPrice; // 0x208
};

struct FHideoutRevealedEvent {
	FText HideoutName; // 0x0
};

struct FTunnelOfTheDamnedInitializedTelemetryEvent {
	FString RequestedMatchmakingPlayModeTag; // 0x0
};

struct FEventPlayerUseItemStart {
	UNotificationInputId* InputID; // 0x0
	AActor* UsedItem; // 0x8
};

struct FEmissaryLevelChanged {
	int32_t NewLevel; // 0x0
	FGuid AssociatedCrew; // 0x4
	FName CompanyName; // 0x14
};

struct FItemSpawnTelemetryEvent {
	FGuid ItemId; // 0x0
	FName SpawnedClass; // 0x10
	ESpawnedItemSource Source; // 0x18
	FString SourceId; // 0x20
	FVector SpawnLocation; // 0x30
};

struct FMerchantContractDeliveryRequest {
	int32_t Id; // 0x0
	FMerchantContractItemDesc ItemDesc; // 0x8
	int32_t NumToAllocate; // 0x30
	int32_t NumToCollect; // 0x34
	int32_t NumToDeliver; // 0x38
};

struct FVoyageQuestsBegun {
	int32_t QuestCount; // 0x0
};

struct FPlayerRecieveFlameTelemetryEvent {
	FString LightSourceId; // 0x0
	FString LightSourceType; // 0x10
	FString FlameColour; // 0x20
};

struct FCannonStateData : FActorStateData {
	FString LoadedItemId; // 0x20
};

struct FEventEncounterEnd : FEventEncounterBase {
	FGuid EncounterId; // 0x0
	AActor* EncounterActor; // 0x10
	EEncounterType EncounterType; // 0x18
	float EncounterRadiusSquared; // 0x1c
};

struct FStructRedirect {
	FString OldStructName; // 0x0
	FString NewStructName; // 0x10
};

struct FEventShopOffersEvent {
	TArray<FShopOffer> Offers; // 0x0
	TArray<FString> Categories; // 0x10
	TArray<FShopOffer> GildedVoyages; // 0x20
};

struct FFirstInteractableTelemetryEvent {
	float StartTime; // 0x0
	float FirstSpinnerShownTime; // 0x4
	float StartEntryLevelLoadTime; // 0x8
	float StartLegalSplashTime; // 0xc
	float EndLegalSplashTime; // 0x10
	float FirstInteractableTime; // 0x14
};

struct FPlayerHideoutInfo {
	APlayerState* PlayerState; // 0x0
	TArray<ASpawnLocation*> ExitPoints; // 0x8
};

struct FClientConditionsCompleteNetworkEvent : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FNavGraphNode {
	UObject* Owner; // 0x0
};

struct FEditableTextStyle : FSlateWidgetStyle {
	FSlateFontInfo Font; // 0x8
	FSlateColor ColorAndOpacity; // 0x48
	FSlateBrush BackgroundImageSelected; // 0x78
	FSlateBrush BackgroundImageComposing; // 0x108
	FSlateBrush CaretImage; // 0x198
};

struct FSetTimeData {
	int32_t Hours; // 0x0
};

struct FPlayerGameStartTelemetryEvent {
	FGuid TitleSession; // 0x0
	bool IsMigration; // 0x10
};

struct FVoyageMembershipInfo {
	FText Title; // 0x0
	FGuid Id; // 0x38
	TArray<FQuestInfo> QuestStatus; // 0x48
	UCompany* Company; // 0x58
	bool IsEmergent; // 0x60
	bool IsTale; // 0x61
	EEmergentVoyageSource EmergentSource; // 0x62
	FViewVoyageBanners ViewVoyageBanners; // 0x63
	bool DoNotNotifyParticipantsOnVoyageComplete; // 0x65
	int32_t Rank; // 0x68
	TArray<FPlayerStat> VoyageCompletionStats; // 0x70
	TArray<FPlayerStat> ReapersMarkCompletionStats; // 0x80
};

struct FAggressiveGhostShipDifficultyTargetSelection {
	float Weight; // 0x0
	EAggressiveGhostShipTarget Target; // 0x4
};

struct FAudioQualitySettings {
	FText DisplayName; // 0x0
	int32_t MaxChannels; // 0x38
};

struct FRootMotionExtractionStep {
	UAnimSequence* AnimSequence; // 0x0
	float StartPosition; // 0x8
	float EndPosition; // 0xc
};

struct FDockableCutsceneActionStateParams : FControlObjectActionStateParams {
	FLookAtOffsetParams LookAtOffsetParams; // 0x18
};

struct FBootFlowSessionDetailsEvent {
	ESessionVisibility SessionVisibility; // 0x0
	ECrewSessionType SessionType; // 0x1
	EPlayMode SelectedPlayMode; // 0x2
	bool CrossInput; // 0x3
};

struct FStatBatchMessage {
	FPirateIdentity PirateIdentity; // 0x0
	EPlayMode Playmode; // 0x78
	EPlayModeVariant PlayModeVariant; // 0x79
	TMap<uint32_t, FStatBatchMessageValues> StatIds; // 0x80
};

struct FSingleStickMappingUserSettingsInteger {
	FName SettingName; // 0x0
	int32_t Value; // 0x8
};

struct FWeightedItemDescSpawner {
	ESpawnedItemSource SpawnSource; // 0x0
	TArray<FSpawnerData> SpawnList; // 0x8
	TArray<TWeakObjectPtr<AActor>> SpawnedItems; // 0x18
};

struct FRequestArmoryItemEntitlementsEvent {
	FString ItemCategory; // 0x0
};

struct FFunctionExpressionInput {
	UMaterialExpressionFunctionInput* ExpressionInput; // 0x0
	FGuid ExpressionInputId; // 0x8
	FExpressionInput Input; // 0x18
};

struct FInviteFriendsEvent {
	bool IsFromCreatorMode; // 0x0
};

struct FRiddleTextPhrasebookEntry {
	FName Id; // 0x0
	URiddleTextPhraseDataAsset* Phrase; // 0x8
};

struct FCrowdAvoidanceSamplingPattern {
	TArray<float> Angles; // 0x0
	TArray<float> Radii; // 0x10
};

struct FIPGTestSimpleType {
	FName StringTest; // 0x0
	int32_t IntTest; // 0x8
};

struct FSlateChildSize {
	float Value; // 0x0
	ESlateSizeRule SizeRule; // 0x4
};

struct FClueSiteLootRestriction {
	UClueSiteType* SiteType; // 0x0
	int32_t LootMax; // 0x8
};

struct FSeasonProgressionUIEventTypeTelemetryFragment {
	FString EventName; // 0x0
	int32_t NumReceivedEvents; // 0x10
};

struct FQuestVariableTransform : FQuestVariable {
	FName SocketName; // 0x10
};

struct FRiggingSystemPulleyParams {
	FSocketId Anchor; // 0x0
	float OffsetFromAnchor; // 0x20
	FPulleyVisualParams Visuals; // 0x28
	FRiggingSystemPulleyAttachmentParams AttachmentRope; // 0x38
};

struct FMysteriousNotesCompletionEventsModelEntry {
	FName CompletionIdent; // 0x0
};

struct FEventPlayerStartedSwimming {
	AActor* Player; // 0x0
};

struct FOfferPurchasedEvent {
	FShopOffer Purchase; // 0x0
	FName NPCName; // 0x1e0
};

struct FInterpCurvePointQuat {
	float InVal; // 0x0
	FQuat OutVal; // 0x10
	FQuat ArriveTangent; // 0x20
	FQuat LeaveTangent; // 0x30
	EInterpCurveMode InterpMode; // 0x40
};

struct FItemLoadoutItemCategoryRemovedEvent {
	UItemCategory* ItemCategory; // 0x0
};

struct FInputScaleBias {
	float Scale; // 0x0
	float Bias; // 0x4
};

struct FPlayerChangedLoadoutTelemetryEvent {
	FString EquippedItemType; // 0x0
	FString EquippedItemName; // 0x10
};

struct FPeriodicResponse {
	FFloatRange PeriodRange; // 0x0
	UObject* Owner; // 0x10
};

struct FAIShipEncounterRevealNetEvent : FBoxedRpc {
	int32_t BattleIdx; // 0x10
	int32_t SkellyCrewIdx; // 0x14
	ECannonballIconType CannonballIconType; // 0x18
	ESkellyFormIconType SkellyFormIconType; // 0x19
};

struct FAthenaAnimationFishing {
	bool AnimationOverride; // 0x0
	AActor* FishingRodActor; // 0x320
	AActor* FishingFloat; // 0x328
	UAthenaAnimationInstance* OwningAnimationInstance; // 0x330
};

struct FProjectileShotParams {
	int32_t Seed; // 0x0
	float ProjectileDistributionMaxAngle; // 0x4
	int32_t NumberOfProjectiles; // 0x8
	float ProjectileMaximumRange; // 0xc
	float ProjectileDamage; // 0x10
	float ProjectileDamageMultiplierAtMaximumRange; // 0x14
};

struct FAimSensitivityRuntimeDataEntry {
	FAimSensitivitySettingParams SettingParams; // 0x0
	float CurrentAimSensitivity; // 0xc
};

struct FSpikeStatEntry {
	TArray<FFuncStatEntry> WorstRPCs; // 0x0
	uint32_t TotalRPCCount; // 0x10
	char SpikeDetected; // 0x14
};

struct FCompanySpecificBootyReward {
	UCompany* CompanyId; // 0x0
	FRewardId RewardId; // 0x8
	bool RequirePirateLegend; // 0x10
};

struct FIndividualMeshScoringToRemove {
	FName MeshName; // 0x0
	FGuid RegistrationToken; // 0x8
};

struct FPhraseData {
	FText TextToBroadcast; // 0x0
	bool RequiresWieldedItemObjectNameAsArgument; // 0x38
	bool WieldedItemObjectNameIsNotLocalised; // 0x39
};

struct FLightingControllerLightingParams {
	float SunYaw; // 0x0
	float SunElevation; // 0x4
	float UnderworldSunElevation; // 0x8
	float MinSunAngle; // 0xc
	float UnderworldZThreshold; // 0x10
	float HideoutZThreshold; // 0x14
	float UnderwaterInsideShipBrightnessInBoatSpace; // 0x18
	float UnderwaterInsideShipBrightnessOutsideBoatSpace; // 0x1c
	float UnderwaterBrightnessInBoatSpace; // 0x20
	float UnderwaterDepthDarkenStart; // 0x24
	float UnderwaterDepthDarkenRange; // 0x28
	float UnderwaterDepthDarkenMin; // 0x2c
	float UnderwaterMurkDensity; // 0x30
	float SecondaryLPVCascadeOcclusionIntensityScale; // 0x34
	int32_t LPVPropagationSteps; // 0x38
	int32_t DefaultLightingSet; // 0x3c
	bool EnableGodRays; // 0x40
};

struct FMaterialRelevance {
	char bOpaque : 1; // 0x0
	char bMasked : 1; // 0x0
	char bDistortion : 1; // 0x0
	char bSeparateTranslucency : 1; // 0x0
	char bNormalTranslucency : 1; // 0x0
	char bDisableDepthTest : 1; // 0x0
	char bOutputsVelocityInBasePass : 1; // 0x0
	char bUsesGlobalDistanceField : 1; // 0x0
	uint16_t ShadingModelMask; // 0x4
	char bOITTranslucencyRelevance : 1; // 0x8
	char bOITAfterTranslucencyRelevance : 1; // 0x8
	char bLowResTranslucencyRelevance : 1; // 0x8
	char bLowResCloudsRelevance : 1; // 0x8
	char bMaskPassRelevance : 1; // 0x8
	char bTranslucentBeforeTranslucency : 1; // 0x8
	char bTranslucentBeforeVolumeFog : 1; // 0x8
	char bTranslucentWithDepthWrite : 1; // 0x8
};

struct FColorTextureSwitchSeedEntry {
	FName ReferenceName; // 0x0
	FLinearColor Color; // 0x8
};

struct FRequestArmoryItemLoadoutEvent {
	TArray<FString> Categories; // 0x0
};

struct FAIBountySpawnerArchiveWaveGroupEntry {
	int32_t NumNonTargetAIKills; // 0x0
	int32_t NumTargetAIKills; // 0x4
	TArray<FAIBountySpawnerArchiveWaveEntry> WaveEntries; // 0x8
};

struct FAthenaAnimationRowboatAnimationsThirdPerson {
	UAnimSequence* SitDown; // 0x0
	UAnimSequence* Stand; // 0x8
	UAnimSequence* Idle; // 0x10
	UBlendSpace1D* Row; // 0x18
	UBlendSpace1D* Recover; // 0x20
	UBlendSpace1D* IntoRow; // 0x28
	UBlendSpace1D* IntoRowBrake; // 0x30
	UBlendSpace1D* BrakeRow; // 0x38
	UBlendSpace1D* BrakeRecover; // 0x40
	UBlendSpace1D* BrakeIdle; // 0x48
};

struct FPlatformInterfaceData {
	FName DataName; // 0x0
	EPlatformInterfaceDataType Type; // 0x8
	int32_t IntValue; // 0xc
	float FloatValue; // 0x10
	FString StringValue; // 0x18
	UObject* ObjectValue; // 0x28
};

struct FCoordinatedKrakenHeadAction {
	UKrakenHeadState* State; // 0x0
	float TimeOffset; // 0x8
};

struct FBuildPromotionBlueprintSettings {
	FFilePath FirstMeshPath; // 0x0
	FFilePath SecondMeshPath; // 0x10
};

struct FDrawDebugItemBox {
	FName GroupName; // 0x0
	bool ReplaceInGroup; // 0x8
	FVector CentrePos; // 0xc
	FVector Box; // 0x18
	FQuat Rotation; // 0x30
	FColor Colour; // 0x40
};

struct FStaggerModifiers {
	float StaggerSpeedModifierX; // 0x0
	float StaggerSpeedModifierY; // 0x4
	float StaggerAmplitudeModifierX; // 0x8
	float StaggerAmplitudeModifierY; // 0xc
};

struct FShipHullDamageTypeEntry {
	EShipHullDamageType DamageType; // 0x0
	FShipHullLandscapeDamageEntry LandscapeDamageParams; // 0x8
	FShipHullRammingSpurDamageEntry RammingSpurDamageParams; // 0x38
};

struct FUseItemNoParamsOnServerRpc : FUseItemOnServerRpc {
	AWieldableItem* Item; // 0x10
};

struct FOpenPremiumStoreFrontEvent {
	FShopDefinition ShopDefinition; // 0x0
};

struct FAchievementSinkAnotherCrewsShip {
	float CrewRange; // 0x0
};

struct FWeightedGoldReward {
	FRewardId RewardId; // 0x0
	float Weight; // 0x8
};

struct FClientMarkerRepresentation {
	UBaseWorldMarker* MarkerPtr; // 0x0
	UObject* MarkerVisualObjectPtr; // 0x8
};

struct FPartialClientHitRegProjectileSnapshotData {
	AActor* SendingPlayer; // 0x0
	TArray<FHitRegSnapshotProjectileRecord> AttackRecords; // 0x8
};

struct FAthenaAnimationWheelTurnsAnimData {
	UAnimSequence* Turn; // 0x0
	UAnimSequence* TurnFast; // 0x8
	UAnimSequence* TurnFast180; // 0x10
};

struct FMovieSceneEventSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneEventSectionData EventData; // 0x18
	char bFireEventsWhenForwards : 1; // 0x38
	char bFireEventsWhenBackwards : 1; // 0x38
};

struct FMovieSceneIntegerPropertySectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x18
	FIntegralCurve IntegerCurve; // 0x38
};

struct FTinySharkShipSpawnData {
	UShipSize* ShipSize; // 0x0
	FWeightedProbabilityRangeOfRanges Timer; // 0x8
	TArray<UAthenaAIControllerParamsDataAsset*> ControllerParams; // 0x38
	FWeightedProbabilityRange ControllerParamsToUse; // 0x48
};

struct FShipCreatureManagerCreatureInstanceModifierCurves {
	UCurveFloat* SpeedModifierCurve; // 0x0
	UCurveFloat* RollCurve; // 0x8
	UCurveVector* OffsetCurve; // 0x10
};

struct FContestCrewPositionTelemetryFragmentInput : FTelemetryFragmentInput {
	FGuid CrewId; // 0x0
};

struct FPremiumStoreLandingPageTab {
	FGuid Id; // 0x0
	FString DisplayName; // 0x10
	TArray<FPremiumStoreLandingPageItem> Children; // 0x20
	bool RealMoneyOnly; // 0x30
};

struct FHttpClientComponentRequestEvent {
	FString Uri; // 0x0
	FString Body; // 0x10
	bool ShouldEncrypt; // 0x20
	bool ShouldAuthorize; // 0x21
	FString Method; // 0x28
	TMap<FString, FString> Headers; // 0x38
	FString Id; // 0x88
};

struct FEventKilledCharacter {
	AActor* KilledCharacter; // 0x0
};

struct FCompanyRankData {
	TArray<FCompanyRankGradeData> RankGradeData; // 0x0
};

struct FLobbyCrewMember {
	FString XUID; // 0x0
	FString GamerTag; // 0x10
};

struct FAtmosphericPressureZoneParameters {
	float Radius; // 0x0
	float TargetPressure; // 0x4
	float PushForce; // 0x8
	float TwistForce; // 0xc
	float Weight; // 0x10
};

struct FEventJustBeenFed {
	AActor* FedBy; // 0x0
};

struct FSplineTransitionLadderActionStateParams : FTransitionLadderActionStateParams {
	float DockTime; // 0x0
	float DelayAfterDockingTime; // 0x4
	float ForcedFieldOfView; // 0x8
	bool ForceStash; // 0xc
};

struct FWielderInfo {
	AAthenaPlayerCharacter* Character; // 0x0
	AAthenaPlayerController* Controller; // 0x8
	AAthenaPlayerState* State; // 0x10
};

struct FTavernBoardCreateMapRequestEvent {
	FITavernBoardMap Map; // 0x0
};

struct FExpireCustomWreckEvent {
	FGuid CrewOwner; // 0x0
};

struct FRotationTrack {
	TArray<FQuat> RotKeys; // 0x0
	TArray<float> Times; // 0x10
};

struct FFallingIntoWaterEvent {
	float FallingSpeed; // 0x0
};

struct FNPCBeckonGestureEntry {
	FString BeckonGesture; // 0x0
	FStringAssetReference BeckonGestureDataAsset; // 0x10
};

struct FMovieSceneCameraAnimSectionData {
	UCameraAnim* CameraAnim; // 0x0
	float PlayRate; // 0x8
	float PlayScale; // 0xc
	float BlendInTime; // 0x10
	float BlendOutTime; // 0x14
	bool bLooping; // 0x18
};

struct FAnimNode_BlendListByEnum : FAnimNode_BlendListBase {
	TArray<int32_t> EnumToPoseIndex; // 0xa8
	char ActiveEnumValue; // 0xb8
};

struct FCoordinatedKrakenExplosionEvent {
	int32_t ExplosionPointIndex; // 0x0
	float TimeOffset; // 0x4
};

struct FRadialDamageParams {
	float BaseDamage; // 0x0
	float MinimumDamage; // 0x4
	float InnerRadius; // 0x8
	float OuterRadius; // 0xc
	float DamageFalloff; // 0x10
};

struct FAnimMontageInstance {
	UAnimMontage* Montage; // 0x0
	float DesiredWeight; // 0x8
	float Weight; // 0xc
	float BlendTime; // 0x10
	float DefaultBlendTimeMultiplier; // 0x14
	TArray<int32_t> NextSections; // 0x18
	TArray<int32_t> PrevSections; // 0x28
	bool bPlaying; // 0x38
	TArray<FAnimNotifyEvent> ActiveStateBranchingPoints; // 0x68
	float Position; // 0x78
	float PlayRate; // 0x7c
};

struct FQuestSelectionParams {
	EQuestPoolSelectionMethod PoolSelectionMethod; // 0x0
	EQuestLocationSelectionMethod LocationSelectionMethod; // 0x1
	bool UseChapterBasedVoyageHistory; // 0x2
	int32_t MaxNumberOfPoolRetries; // 0x4
};

struct FRiddleTextRenderer {
	float MaskSizeScale; // 0x0
	UFont* Font; // 0x8
	float FontScale; // 0x10
	float FontMaxScale; // 0x14
	float FontScaleChange; // 0x18
	float FontLineSpacingScale; // 0x1c
	TArray<FString> DroppedTextCharacters; // 0x20
	bool VerticallyCentredText; // 0x30
	bool HorizontallyCentredText; // 0x31
	float MaxTextHeightRatioForRiddleText; // 0x34
	float MarginSize; // 0x38
	FVector2D OriginRatio; // 0x3c
	float StepSpacingRatio; // 0x44
	float StepSpacingWithDroppedTailInLastLineRatio; // 0x48
	float MaskOffsetRatio; // 0x4c
	FVector2D MaskBorderRatio; // 0x50
};

struct FEventCustomizableActorChanged {
	AActor* CustomizableActor; // 0x0
	bool StripOverrideMaterials; // 0x8
};

struct FStreamersRequest {
	TArray<FStreamingStatusModel> StreamingStatuses; // 0x0
};

struct FItemSnapshotSwapInstigatedEvent {
	FGuid SnapshotID; // 0x0
	TScriptInterface<Class> NewInstagator; // 0x10
	AActor* WorldContextObject; // 0x20
};

struct FEventEmoteStarted {
	FEmoteData EmoteData; // 0x0
};

struct FDominanceGroupName {
	EDominanceGroup Type; // 0x0
	FName Name; // 0x4
};

struct FVolcanoTarget {
	EVolcanoTargetType Type; // 0x0
	EVolcanoTargetHitType HitType; // 0x1
	AActor* Target; // 0x8
	int32_t NumExtraShots; // 0x10
};

struct FTiledCloudProperties {
	FVector2D TilePosition; // 0x0
	int32_t CloudTypeIndex; // 0x8
	float RelativeRadius; // 0xc
	float Scale; // 0x10
	float PressureThreshold; // 0x14
	float RotationYaw; // 0x18
	float OverlapTolerance; // 0x1c
};

struct FBountyQuestWaveCompletedTelemetryEvent {
	FString LandmarkName; // 0x0
	int32_t BountyWaveIndex; // 0x10
	int32_t TotalBountyWaves; // 0x14
};

struct FLevelLoadCompletedCustomServerEvent : FGlobalCustomServerEvent {
	FName EventID; // 0x8
	FDateTime ServerTimeUTC; // 0x10
};

struct FEventPlayerDockToObjectEnd {
	TScriptInterface<Class> ObjectBeingUsed; // 0x0
	bool CanLookAtBeDisabledWhenDockedToObject; // 0x10
};

struct FOpenableItemMaterialAnimationReactionComponentAnimationNameAndSfxCueSet {
	FName Open; // 0x0
	FName OpeningFirstTime; // 0x8
	UWwiseEvent* OpeningFirstTimeSfx; // 0x10
	FName Opening; // 0x18
	UWwiseEvent* OpeningSfx; // 0x20
	FName Closing; // 0x28
	UWwiseEvent* ClosingSfx; // 0x30
	FName Closed; // 0x38
};

struct FInterpolationParameter {
	float InterpolationTime; // 0x0
	EFilterInterpolationType InterpolationType; // 0x4
};

struct FTavernBoardTakeMapRequestEvent {
	FITavernBoardMap Map; // 0x0
};

struct FAnimNode_ApplyAdditive : FAnimNode_Base {
	FPoseLink Base; // 0x30
	FPoseLink Additive; // 0x48
	float Alpha; // 0x60
	FInputScaleBias AlphaScaleBias; // 0x64
};

struct FAthenaAnimationLocomotionTurningAnimData {
	UAnimSequence* Turn90; // 0x0
};

struct FActiveHitRegSnapshot {
	AActor* AttackingActor; // 0x0
	AActor* SnapshotActor; // 0x8
	UHitRegSnapshotComponent* SnapshotComponent; // 0x10
};

struct FGenericPartDesc {
	UStaticMesh* Mesh; // 0x0
};

struct FBountyQuestTargetDefeatedNetworkEvent : FNetworkEventStruct {
	FText TargetName; // 0x10
	UPopUpMessageDesc* PopUpDesc; // 0x48
};

struct FNamedInterface {
	FName InterfaceName; // 0x0
	UObject* InterfaceObject; // 0x8
};

struct FBucketContentsInfo {
	EThrowableLiquidType ThrowableLiquidType; // 0x0
	ALiquidProjectile* ProjectileClassToSpawn; // 0x8
	ALiquidProjectile* ProjectileClassToSpawnAtWielder; // 0x10
	UWwiseEvent* ThrowSfx; // 0x18
	UObject* ThrowVfxFirstPerson; // 0x20
	UObject* ThrowVfxThirdPerson; // 0x28
	UObject* DrenchWielderVfxThirdPerson; // 0x30
	UObject* BucketContentsParticleSystemFirstPerson; // 0x38
	UObject* BucketContentsParticleSystemThirdPerson; // 0x40
	FName SwitchState; // 0x48
	float LiquidLevel; // 0x50
};

struct FNPCDialogFormattedHeaderByConditionText {
	FText Text; // 0x0
	FString ParameterName; // 0x38
	TArray<UNPCDialogConditional*> Conditions; // 0x48
};

struct FCapstanParams {
	float MaxVelocityPerPlayer; // 0x0
	float MaxFreeLoweringVelocity; // 0x4
	float MaxError; // 0x8
	float CorrectiveForceMultiplier; // 0xc
	float PlayerAnimationOnCapstanMultiplier; // 0x10
};

struct FEventWithinRainZoneChanged {
	bool IsWithinRainZone; // 0x0
};

struct FCrewBaseTelemetryFragment {
	FGuid CrewId; // 0x0
	FGuid CrewSessionId; // 0x10
	FGuid AllianceId; // 0x20
	int32_t CurrentCrewCount; // 0x30
	FString SessionType; // 0x38
	FString CrewType; // 0x48
};

struct FStartInteractionEvent {
	FInteractionDefinition Definition; // 0x0
};

struct FAnchors {
	FVector2D Minimum; // 0x0
	FVector2D Maximum; // 0x8
};

struct FPlayerChangedLoadoutEvent {
	FString EquippedType; // 0x0
	FString EquippedName; // 0x10
};

struct FBoneReference {
	FName BoneName; // 0x0
};

struct FContestCrewManagementMemberData {
	FString XUID; // 0x0
	FString GamerTag; // 0x10
	EMuteState Muted; // 0x20
	FString CrewIcon; // 0x28
};

struct FMaterialInformationAudioData : FTableRowBase {
	FName SurfaceSwitch; // 0x0
	FWwiseAudioAcousticSurfaceParams Acoustics; // 0x8
};

struct FRewardRuntimeDefinition {
	UPopUpMessageDesc* PopUp; // 0x8
	TArray<UEntitlementDesc*> PrerequisiteEntitlements; // 0x20
};

struct FInvertRadialYInputEvent {
	bool InvertRadialYInputEvent; // 0x0
};

struct FQuestVariableClueSite : FQuestVariable {
	FName ParamName; // 0x8
};

struct FAthenaAnimationWaterPumpParams {
	float WaterPumpHandlePosition; // 0x0
	float WaterPumpHandlePreviousPosition; // 0x4
	bool WaterPumpHandleInMotion; // 0x8
};

struct FEventUserGameSettingsRadialMappings {
	FName RadialSlotIndex0SelectedKeyboard; // 0x0
	FName RadialSlotIndex1SelectedKeyboard; // 0x8
	FName RadialSlotIndex2SelectedKeyboard; // 0x10
	FName RadialSlotIndex3SelectedKeyboard; // 0x18
	FName RadialSlotIndex4SelectedKeyboard; // 0x20
	FName RadialSlotIndex5SelectedKeyboard; // 0x28
	FName RadialSlotIndex6SelectedKeyboard; // 0x30
	FName RadialSlotIndex7SelectedKeyboard; // 0x38
	FName RadialSlotClockwise; // 0x40
	FName RadialSlotCounterClockwise; // 0x48
};

struct FCustomWreckEntry {
	FGuid OwningCrewID; // 0x0
	TWeakObjectPtr<ACustomShipwreck> WreckObject; // 0x10
	bool WreckExpired; // 0x18
};

struct FEmissaryMaxLevelReachedNetworkEvent : FNetworkEventStruct {
	UDataAsset* PopUpDesc; // 0x10
};

struct FRandomStream {
	int32_t InitialSeed; // 0x0
	int32_t Seed; // 0x4
};

struct FFrameDurationDataTelemetryFragment {
	uint32_t Num02ms; // 0x0
	uint32_t Num04ms; // 0x4
	uint32_t Num06ms; // 0x8
	uint32_t Num08ms; // 0xc
	uint32_t Num10ms; // 0x10
	uint32_t Num12ms; // 0x14
	uint32_t Num14ms; // 0x18
	uint32_t Num16ms; // 0x1c
	uint32_t Num18ms; // 0x20
	uint32_t Num20ms; // 0x24
	uint32_t Num22ms; // 0x28
	uint32_t Num24ms; // 0x2c
	uint32_t Num26ms; // 0x30
	uint32_t Num28ms; // 0x34
	uint32_t Num30ms; // 0x38
	uint32_t Num32ms; // 0x3c
	uint32_t Num34ms; // 0x40
	uint32_t Num36ms; // 0x44
	uint32_t Num38ms; // 0x48
	uint32_t Num40ms; // 0x4c
	uint32_t Num42ms; // 0x50
	uint32_t Num44ms; // 0x54
	uint32_t Num46ms; // 0x58
	uint32_t Num48ms; // 0x5c
	uint32_t Num50ms; // 0x60
	uint32_t Num52ms; // 0x64
	uint32_t Num54ms; // 0x68
	uint32_t Num56ms; // 0x6c
	uint32_t Num58ms; // 0x70
	uint32_t Num60ms; // 0x74
	uint32_t Num62ms; // 0x78
	uint32_t Num64ms; // 0x7c
	uint32_t Num66ms; // 0x80
	uint32_t NumOver66ms; // 0x84
	float Min; // 0x88
	float Max; // 0x8c
	float Average; // 0x90
};

struct FQuestBaseTelemetryFragment {
	FGuid QuestId; // 0x0
	FGuid VoyageId; // 0x10
};

struct FAggressiveGhostShipNameBucket {
	FName Key; // 0x0
	TArray<FText> Names; // 0x8
};

struct FAthenaAnimationHarpoonLauncherAnimData {
	TArray<UBlendSpace1D*> Idle; // 0x0
	UBlendSpace1D* FireInto; // 0x10
	UBlendSpace1D* FireOutOf; // 0x18
	UBlendSpace1D* FireAction; // 0x20
};

struct FPlayerEmoteTelemetryEvent {
	FString EmoteName; // 0x0
	uint32_t EmoteDuration; // 0x10
};

struct FAthenaAnimationFire {
	float MinimumDistanceToStartCoughing; // 0x0
	char Coughing : 1; // 0x4
};

struct FPlayerBucketEmptyTelemetryEvent {
	FGuid ScoopID; // 0x0
	FString EmptyBucketTo; // 0x10
};

struct FSqueakyWheelEnabledEvent {
	bool SqueakyWheelEnabled; // 0x0
};

struct FEventDockedToObject {
	EControllableObjectType ObjectType; // 0x0
};

struct FPersistentUserGameSettings {
	bool InvertYAxisGamepad; // 0x0
	bool InvertYAxisMouse; // 0x1
	bool InvertXAxisGamepad; // 0x2
	bool InvertXAxisMouse; // 0x3
	bool UseVirtualKeyboard; // 0x4
	bool UsePlatformForUnattenuatedChat; // 0x5
	bool UsePushToTalk; // 0x6
	bool UseProximityChatDirection; // 0x7
	float ForceFeedbackIntensity; // 0x8
	float FieldOfView; // 0xc
	float MouseSensitivity; // 0x10
	float MasterVolume; // 0x14
	float SfxVolume; // 0x18
	float MusicVolume; // 0x1c
	float ShantyVolume; // 0x20
	float CrewChatVolume; // 0x24
	float NonCrewChatVolume; // 0x28
	float Brightness; // 0x2c
	int32_t VSync; // 0x30
	int32_t MaxFPS; // 0x34
	bool Fullscreen; // 0x38
	int32_t MaxVerticalResolution; // 0x3c
	int32_t DefaultDetail; // 0x40
	int32_t ShadowDetail; // 0x44
	int32_t ModelDetail; // 0x48
	int32_t TextureDetail; // 0x4c
	int32_t WaterDetail; // 0x50
	int32_t AnimationQuality; // 0x54
	int32_t MMCThresholdScale; // 0x58
	int32_t ParticleEmitterQuality; // 0x5c
	int32_t ParticleResolutionQuality; // 0x60
	float ResolutionScaling; // 0x64
	int32_t LightingDetail; // 0x68
	int32_t BackBufferCount; // 0x6c
	float ControllerSensitivity; // 0x70
	float ControllerDeadzone; // 0x74
	float ControllerNonLinearity; // 0x78
	float MouseSensitivity_Blunderbuss; // 0x7c
	float ControllerSensitivity_Blunderbuss; // 0x80
	float MouseSensitivity_Flintlock; // 0x84
	float ControllerSensitivity_Flintlock; // 0x88
	float MouseSensitivity_EyeOfReach; // 0x8c
	float ControllerSensitivity_EyeOfReach; // 0x90
	float MouseSensitivity_Spyglass; // 0x94
	float ControllerSensitivity_Spyglass; // 0x98
	float MouseSensitivity_TridentOfDarkTides; // 0x9c
	float ControllerSensitivity_TridentOfDarkTides; // 0xa0
	TArray<FKeyBinding> ActionBindings; // 0xa8
	TArray<FKeyBinding> AxisBindings; // 0xb8
	int32_t ShowPerformanceCounters; // 0xc8
	int32_t NumberOfLogins; // 0xcc
	bool OptedInToMarketing; // 0xd0
	int32_t KeyboardLayout; // 0xd4
	int32_t GameLanguage; // 0xd8
	bool ShowPlayerTalkingIndicator; // 0xdc
	bool MuteCopyrightedAudio; // 0xdd
	bool UseAltMapMarkTexture; // 0xde
	bool VariableRefreshRate; // 0xdf
	float HighDynamicRangeCalib; // 0xe0
	bool HDR; // 0xe4
	int32_t CVDMode; // 0xe8
	float CVDStrength; // 0xec
	float ColorSaturationScale; // 0xf0
	float NotificationScale; // 0xf4
	bool Joinable; // 0xf8
	bool ShowOwnCrewNameplates; // 0xf9
	bool ShowOtherCrewNameplates; // 0xfa
	bool ShowOwnCrewStatusTags; // 0xfb
	bool ScrambleGamertags; // 0xfc
	bool ShowTallTalesOnMapTable; // 0xfd
	bool AutoVoteOnProposedVoyage; // 0xfe
	bool NotificationsInMenus; // 0xff
	bool ToggleRadialMenu; // 0x100
	bool StickyRadialItems; // 0x101
	bool EnableMovementDuringRadial; // 0x102
	bool EnableLookWhenControllingObject; // 0x103
	bool EnableAutoCentreLook; // 0x104
	float AutoCentreLookTimeDelay; // 0x108
	float AutoCentreLookSpeed; // 0x10c
	bool HoldActionsDontRequireHold; // 0x110
	bool HoldActionsWithHeldItemsDontRequireHold; // 0x111
	int32_t TTSOverride; // 0x114
	int32_t STTOverride; // 0x118
	int32_t LGRTMOverride; // 0x11c
	bool TranslateOtherPlayers; // 0x120
	bool ScreenSpaceTooltips; // 0x121
	bool NarrateToasts; // 0x122
	float ToastHoldDurationMultiplier; // 0x124
	bool NarrateOnHover; // 0x128
	bool NarrateChangeOnly; // 0x129
	bool EscapeAsBackAccessibilityOption; // 0x12a
	bool CrossInputPreference; // 0x12b
	bool AdventureCrossInputPreference; // 0x12c
	int32_t AdventureIslandBanners; // 0x130
	int32_t ArenaIslandBanners; // 0x134
	bool OutpostLocationBanners; // 0x138
	int32_t UseSingleStick; // 0x13c
	int32_t UseSingleStickSettingsApplied; // 0x140
	int32_t UseSingleStickCameraToggle; // 0x144
	int32_t SingleStickState; // 0x148
	bool DisableControllerOnPC; // 0x14c
	bool RecenterMouseInMenus; // 0x14d
	bool AutoFloatInWater; // 0x14e
	int32_t PushToTalkMode; // 0x150
	bool CircularUINavigation; // 0x154
	bool Enable120Hz; // 0x155
	bool AlwaysSkipMapTableAnimation; // 0x156
	bool AudioMonoMix; // 0x157
	bool AudioOutputHeadphones; // 0x158
	bool AudioOutputSpatialAudio; // 0x159
	bool DisableSeasonsNotifications; // 0x15a
	bool DisableInviteNotifications; // 0x15b
	bool ControlledTextAlignment; // 0x15c
	bool ControlledLineHeight; // 0x15d
	int32_t OtherCrewsMuteState; // 0x160
	int32_t NauticalNarrationEnabled; // 0x164
	float ContinuousNarrationDelay; // 0x168
	bool DisableFlashes; // 0x16c
	bool DisableBlur; // 0x16d
	bool DisableScreenShake; // 0x16e
	bool DisableOnScreenEffects; // 0x16f
	bool EnchantedCompassProximityAnnouncerEnabled; // 0x170
	bool DisableRats; // 0x171
	bool EnableSqueakyWheel; // 0x172
	float SqueakyWheelVolume; // 0x174
};

struct FSimplygonRemeshingSettings {
	bool bActive; // 0x0
	int32_t ScreenSize; // 0x4
	bool bRecalculateNormals; // 0x8
	float HardAngleThreshold; // 0xc
	int32_t MergeDistance; // 0x10
	bool bUseClippingPlane; // 0x14
	float ClippingLevel; // 0x18
	int32_t AxisIndex; // 0x1c
	bool bPlaneNegativeHalfspace; // 0x20
	bool bUseMassiveLOD; // 0x21
	bool bUseAggregateLOD; // 0x22
	FSimplygonMaterialLODSettings MaterialLODSettings; // 0x28
};

struct FLevelSequenceObject {
	UObject* ObjectOrOwner; // 0x0
	FString ComponentName; // 0x20
	TWeakObjectPtr<UObject> CachedComponent; // 0x30
};

struct FEventItemConsumed {
	AActor* Consumer; // 0x0
};

struct FDebugTeleportDestinationEntry {
	FString DebugMenuSubPath; // 0x0
	FVector Destination; // 0x10
	FGuid AssociatedCrew; // 0x1c
	FGuid Id; // 0x2c
};

struct FDecalEntry {
	UDecalComponent* DecalComponent; // 0x0
	UMaterialInstanceDynamic* DecalMaterial; // 0x8
	FLinearColor DecalColour; // 0x10
	int32_t LocationIndex; // 0x20
};

struct FEventShipRemovedFromCrew {
	FGuid CrewId; // 0x0
};

struct FPlayerGameEndTelemetryEvent {
	uint32_t IdleDuration; // 0x0
	uint32_t ActiveDuration; // 0x4
	uint32_t VoiceChatDuration; // 0x8
	bool IsMigration; // 0xc
	bool HadSTTEnabled; // 0xd
	bool HadTTSEnabled; // 0xe
	bool HadTranslationEnabled; // 0xf
};

struct FRequestJoinSessionEvent {
	FString SessionCode; // 0x0
};

struct FMovieSceneAkAudioRTPCSectionData {
	FString RTPCName; // 0x0
	FRichCurve RTPCCurve; // 0x10
};

struct FActorSequenceObjectReference {
	EActorSequenceObjectReferenceType Type; // 0x0
	FGuid ActorId; // 0x4
	FString PathToComponent; // 0x18
};

struct FKrakenShipWrappingTentacleAnimationState {
	uint32_t EpochId; // 0x0
	EKrakenShipWrappingTentacleState State; // 0x4
	double EndTime; // 0x8
};

struct FClientCargoRunCrewDataUnit {
	FGuid CrewId; // 0x0
	TArray<FGuid> NPCPickUpPoints; // 0x10
};

struct FEquipmentChestItemEntitlementsUpdatedEvent {
	TArray<FChestEntitlementViewModel> ItemEntitlements; // 0x0
};

struct FItemInfoTogglePair {
	FName Toggle; // 0x0
	FStringClassReference ItemInfo; // 0x8
};

struct FAIExclusionZone {
	FVector Location; // 0x0
	float RadiusSquared; // 0xc
	float Radius; // 0x10
	float Height; // 0x14
};

struct FCarouselPirateGeneratorParams {
	int32_t MinNumOfEachGender; // 0x0
	int32_t MinNumOfEachEthnicity; // 0x4
	TArray<FCarouselPirateGroup> Groups; // 0x8
	FCarouselPirateGroup Default; // 0x18
	FCarouselPirateClothing MaleClothing; // 0x88
	FCarouselPirateClothing FemaleClothing; // 0xa8
};

struct FCurveEdTab {
	FString TabName; // 0x0
	TArray<FCurveEdEntry> Curves; // 0x10
	float ViewStartInput; // 0x20
	float ViewEndInput; // 0x24
	float ViewStartOutput; // 0x28
	float ViewEndOutput; // 0x2c
};

struct FOceanCrawlerSporeBreathAnimationData {
	UBlendSpace1D* Into; // 0x0
	UBlendSpace1D* Locomotion; // 0x8
	UBlendSpace1D* Outof; // 0x10
};

struct FEventPlayerEnteredProximity {
	AActor* Player; // 0x0
};

struct FCrewMuteOthersVoiceEvent {
	bool IsMuted; // 0x0
};

struct FAthenaAnimationSkeletonKnockbackLocomotionStrength {
	FAthenaAnimationSkeletonKnockbackLocomotion LowStrength; // 0x0
	FAthenaAnimationSkeletonKnockbackLocomotion HighStrength; // 0x10
};

struct FServerHeartbeatTelemetryEvent {
	FTimespan ServerUptime; // 0x0
	FTimespan ServerTimeToLive; // 0x8
	FString ServerAddress; // 0x10
	bool ForcingShutdown; // 0x20
};

struct FTutorialStepEndOfTutorial : FTutorialStep {
	FTutorialStepDependencies Dependencies; // 0x20
};

struct FStoreTokenModel {
	FString AccessToken; // 0x0
	FString WsidToken; // 0x10
};

struct FSetNonVerbalOptionWithImages : FRadialInventoryEvent {
	TArray<FNonVerbalRadialSlot> Slots; // 0x8
};

struct FWeaponProjectileMaxIterationsTelemetryEvent {
	int32_t MaxSimulationIterations; // 0x0
	float MinTickTimeSecs; // 0x4
	float MaxSimulationTimeStep; // 0x8
	FGuid TelemetryAttackId; // 0xc
};

struct FOtherPartyTelemetryFragmentInput : FTelemetryFragmentInput {
	TWeakObjectPtr<AActor> OtherParty; // 0x0
};

struct FAthenaAnimationIKLimbStretch {
	float IKStretchArms; // 0x0
	float IKStretchLegs; // 0x4
	float IKStretchSpine; // 0x8
};

struct FGenericPopupAudioDescriptor {
	FString SfxEventName; // 0x0
	FString EventName; // 0x10
	FString SwitchName; // 0x20
	FString SwitchValue; // 0x30
};

struct FAthenaAnimationWheelAnimData {
	UAnimSequence* Into; // 0x0
	FAthenaAnimationWheelTurnsAnimData LeftTurn; // 0x8
	FAthenaAnimationWheelTurnsAnimData RightTurn; // 0x20
	FAthenaAnimationWheelArmOverlayAnimData LeftArm; // 0x38
	FAthenaAnimationWheelArmOverlayAnimData RightArm; // 0x48
	TArray<UAnimSequence*> Idles; // 0x58
	TArray<UAnimSequence*> LeftFingerIdles; // 0x68
	TArray<UAnimSequence*> RightFingerIdles; // 0x78
};

struct FRewardRequestSucceededMessage {
	FGuid RequestID; // 0x0
};

struct FEmergentContestVoyageRecipe : FVoyageRecipe {
	bool IsSharableVoyage; // 0x140
	FContestZoneDistribution WeightedContestZonesToActivate; // 0x148
	FContestTimerData ContestVoyageTime; // 0x158
	FStringClassReference ScoreSystemToLoad; // 0x170
	FText ContestArenaName; // 0x180
};

struct FDetailAppearenceMaterialDesc {
	FStringAssetReference Material; // 0x0
	int32_t MaterialIndex; // 0x10
};

struct FQuestVariableRotator : FQuestVariable {
	FName ParamName; // 0x8
};

struct FGrassVariety {
	UStaticMesh* GrassMesh; // 0x0
	float GrassDensity; // 0x8
	bool bUseGrid; // 0xc
	float PlacementJitter; // 0x10
	int32_t StartCullDistance; // 0x14
	int32_t EndCullDistance; // 0x18
	int32_t MinLOD; // 0x1c
	bool RandomRotation; // 0x20
	float AlignToSurface; // 0x24
	float ScaleVariationMin; // 0x28
	float ScaleVariationMax; // 0x2c
};

struct FSetRadialTitleText : FRadialInventoryEvent {
	FText Text; // 0x8
};

struct FCrewMemberVotes {
	FGuid CrewId; // 0x0
	TArray<FPerCompanyVotes> CompanyVotes; // 0x10
};

struct FTaleQuestDeliveryRequest {
	int32_t Id; // 0x0
	FMerchantContractItemDesc Item; // 0x8
	int32_t NumToDeliver; // 0x30
	int32_t NumToAllocate; // 0x34
};

struct FEventAIOnDelayedAssignedMeshConsumed {
	USkeletalMeshComponent* MeshComponent; // 0x0
	USkeletalMesh* ConsumedMesh; // 0x8
};

struct FUseSingleStickCameraToggleModeChangedEvent {
	EToggleOrHoldMode UseSingleStickCameraToggleMode; // 0x0
};

struct FCurveTrack {
	FName CurveName; // 0x0
	TArray<float> CurveWeights; // 0x8
};

struct FRigConfiguration {
	URig* Rig; // 0x0
	TArray<FNameMapping> BoneMappingTable; // 0x8
};

struct FPlayerStat {
	uint32_t StatId; // 0x0
};

struct FFishingActionStateConstructionInfo : FActorActionStateConstructionInfo {
	TWeakObjectPtr<AActor> ActorOwner; // 0x28
};

struct FStructSerializerBuiltinTestStruct {
	FGuid Guid; // 0x0
	FName Name; // 0x10
	FString String; // 0x18
	FRotator Rotator; // 0x28
	FVector Vector; // 0x34
};

struct FShowPendingInviteEvent {
	FString XUID; // 0x0
};

struct FAnimExtractContext {
	bool bExtractRootMotion; // 0x0
	float CurrentTime; // 0x4
};

struct FVoyageCreatedTelemetryEvent {
	FString VoyageRecipeAsset; // 0x0
	FString VoyageGenerationLocation; // 0x10
	int32_t VoyageRank; // 0x20
	int32_t NumIslandsToAvoid; // 0x24
	uint32_t VoyageGenerationSeed; // 0x28
	TArray<FRewardIdCount> GeneratedRewards; // 0x30
};

struct FAggressiveGhostShipVisualsMaterialOverride {
	int32_t MaterialIndexToReplace; // 0x0
	FStringAssetReference OriginalMaterial; // 0x8
	FStringAssetReference ReplacementMaterial; // 0x18
};

struct FEnvFloatParam_DEPRECATED {
	float Value; // 0x0
	FName ParamName; // 0x4
};

struct FMaterialAttributesInput : FExpressionInput {
	UMaterialExpression* Expression; // 0x0
	int32_t OutputIndex; // 0x8
	FString InputName; // 0x10
	int32_t Mask; // 0x20
	int32_t MaskR; // 0x24
	int32_t MaskG; // 0x28
	int32_t MaskB; // 0x2c
	int32_t MaskA; // 0x30
	int32_t GCC64_Padding; // 0x34
};

struct FLoadout {
	FItemLoadout ItemLoadout; // 0x0
	FClothingLoadout ClothingLoadout; // 0x20
	FPetLoadout PetLoadout; // 0x30
};

struct FVector_NetQuantize : FVector {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
};

struct FSkelMeshComponentLODInfo {
	TArray<bool> HiddenMaterials; // 0x0
};

struct FVector2D {
	float X; // 0x0
	float Y; // 0x4
};

struct FFindFloorResult {
	char bBlockingHit : 1; // 0x0
	char bWalkableFloor : 1; // 0x0
	char bLineTrace : 1; // 0x0
	float FloorDist; // 0x4
	float LineDist; // 0x8
	FHitResult HitResult; // 0xc
};

struct FAeolusIncorrectAchievementsRemovedTelemetry {
	FString UserId; // 0x0
	FString PirateId; // 0x10
	bool Success; // 0x20
	int32_t AchievementsRemovedCount; // 0x24
};

struct FSetAdventureIslandBanners {
	int32_t Value; // 0x0
};

struct FPetAnimationDataBeingHeld {
	FWeightedPetAnimations WeightedBaseIdle; // 0x0
	FWeightedAnimationTimeoutSelector WeightedIdleTimeouts; // 0x10
	UAnimSequenceBase* DefaultIdle; // 0x20
	UAnimSequenceBase* Equip; // 0x28
	UAnimSequenceBase* Drop; // 0x30
	UAnimSequenceBase* Chew; // 0x38
	UAnimSequenceBase* PositiveFeedingReact; // 0x40
	UAnimSequenceBase* PositiveFeedingReactShown; // 0x48
	UAnimSequenceBase* NegativeFeedingReact; // 0x50
	UAnimSequenceBase* NegativeFeedingReactShown; // 0x58
	UAnimSequenceBase* RefuseFeedingReact; // 0x60
	UAnimSequenceBase* RefuseFeedingReactShown; // 0x68
	FPetAnimationCycle Stroke; // 0x70
	FPetAnimationCycle StrokeAlternate; // 0x88
	FPetAnimationCycle Give; // 0xa0
	UBlendSpace* Locomotion; // 0xb8
	UBlendSpace* ShowingLocomotion; // 0xc0
	UAnimSequenceBase* Underwater; // 0xc8
	UAnimSequenceBase* ShowingUnderwater; // 0xd0
	FPetAnimationDataJump Jump; // 0xd8
	FPetAnimationDataJump JumpAlternateStroke; // 0xf8
	FPetAnimationDataJump JumpShowing; // 0x118
	FJumpHeldAdditiveBlendWeight JumpHeldAdditiveBlendWeight; // 0x138
	FAlternateHeldPose AlternateHeldPose; // 0x150
};

struct FTreasureMapWidget {
	FVector2D Position; // 0x0
	ETreasureMapHorizontalAlignment HorizontalAlignment; // 0x8
	ETreasureMapVerticalAlignment VerticalAlignment; // 0x9
	float Angle; // 0xc
	float Width; // 0x10
	float Opacity; // 0x14
};

struct FMechanismTransformAnimationCurve {
	UMechanismAnimationCurve_Transform* CurveAsset; // 0x0
};

struct FEngineServiceAuthGrant {
	FString UserName; // 0x0
	FString UserToGrant; // 0x10
};

struct FGhostPawnEntry {
	float TimeRemaining; // 0x0
	APawn* Pawn; // 0x8
	bool RespawnCompleted; // 0x10
	bool IsDoorOpen; // 0x11
	FObjectMessagingHandle FinishedSpawningHandle; // 0x18
};

struct FWatercraftRolloverCorrector {
	float RollThresholdToConsiderRolledOver; // 0x0
	float TorqueScalar; // 0x4
};

struct FRequestEmblemProgressFailedEvent {
	FGuid RequestID; // 0x0
};

struct FTaleQuestTaskStartedTelemetryEvent {
	FString Description; // 0x0
	TArray<FString> Context; // 0x10
	FGuid TaskId; // 0x20
};

struct FCrewPlayerLeftCustomServerEvent : FGlobalCustomServerEvent {
	FString CrewId; // 0x18
};

struct FBoxElement2D {
	FVector2D Center; // 0x0
	float Width; // 0x8
	float Height; // 0xc
	float Angle; // 0x10
};

struct FPlayerDeathTelemetryEvent {
	FGuid AttackId; // 0x0
	FString Location; // 0x10
	int32_t LifetimeInSeconds; // 0x20
	uint32_t PossessCount; // 0x24
	double SecondsSinceSpawned; // 0x28
};

struct FAIShipBattleParams {
	FText Name; // 0x0
	FVector2D Location; // 0x38
	float Radius; // 0x40
};

struct FAwardGoldMessage {
	FGuid CrewId; // 0x0
	TArray<FPirateGoldReward> Rewards; // 0x10
	FGuid TransactionId; // 0x20
	FString Source; // 0x30
};

struct FShipHeartbeatTelemetryEvent {
	float Speed; // 0x0
	float Yaw; // 0x4
	float InternalWaterLevel; // 0x8
	int32_t FireCellsActive; // 0xc
};

struct FEventShipExitedSafeZone {
	AActor* Ship; // 0x0
};

struct FPlayerItemRetrievalFromContainerTelemetryEvent {
	FString ContainerId; // 0x0
	FString ItemType; // 0x10
	int32_t NumberOfItemsRemainingInContainer; // 0x20
};

struct FExplosionForceFeedbackInfo {
	UDamagerType* DamagerType; // 0x0
	UForceFeedbackEffect* Effect; // 0x8
	UForceFeedbackEffect* EffectLower; // 0x10
	float LowerTriggerPercentage; // 0x18
	FName Tag; // 0x1c
	float ShakeOuterRadius; // 0x24
};

struct FChainLink {
	AActor* Source; // 0x0
	AActor* Target; // 0x8
	FVector_NetQuantize LastSourceLocation; // 0x10
	FVector_NetQuantize LastTargetLocation; // 0x1c
};

struct FWeightedVoyageLocationParams {
	float Weight; // 0x0
	TArray<FVoyageLocationParams> Locations; // 0x8
};

struct FMerchantMapLayoutItem {
	FTreasureMapWidgetText Name; // 0x0
	FTreasureMapWidgetTexture IconImage; // 0x20
};

struct FAggressiveGhostShipProjectileShotTelemetryEvent {
	FGuid ShipId; // 0x0
	FGuid ProjectileAttackId; // 0x10
	FString ProjectileType; // 0x20
	EAggressiveGhostShipTarget Target; // 0x30
};

struct FFragileComponentHealthScalarEntry {
	EHealthChangedReason HealthChangedReason; // 0x0
	float HealthChangeScalar; // 0x4
};

struct FAnimNode_TransitionResult : FAnimNode_Base {
	bool bCanEnterTransition; // 0x30
};

struct FXMarksTheSpotMapMark {
	FVector2D Position; // 0x0
	float Rotation; // 0x8
	bool IsUnderground; // 0xc
};

struct FSetContestShipTypes {
	bool IsGalleonEnabled; // 0x0
	bool IsBrigantineEnabled; // 0x1
	bool IsSloopEnabled; // 0x2
	bool IsSloopDuoEnabled; // 0x3
	bool IsMixedGalleonBrigantineEnabled; // 0x4
};

struct FFishAnimationSwimmingLoopAnimations {
	UAnimMontage* IdleLoopEndingForwards; // 0x0
	UAnimMontage* IdleLoopEndingRight; // 0x8
	UAnimMontage* IdleLoopEndingLeft; // 0x10
	UAnimMontage* IdleLoopEndingBackwards; // 0x18
};

struct FEventPlayerControllerDestroyedCalled {
	AAthenaPlayerController* Controller; // 0x0
};

struct FServerMigrationRequestEvent {
	FGuid MigrationId; // 0x0
	FString DestinationAddress; // 0x10
	FGuid CrewId; // 0x20
	FString SubMode; // 0x30
};

struct FFireGridCharringManager {
	TArray<UMaterialInterface*> OwnerMaterials; // 0x0
	FVector AdditionalGridOffsetForCharring; // 0x10
	UTexture2DDynamic* FireGridTexture; // 0x20
};

struct FInputAxisConfigEntry {
	FName AxisKeyName; // 0x0
	FInputAxisProperties AxisProperties; // 0x8
};

struct FPetLoadoutItem {
	UPetEntitlementBaseDesc* PetEntitlementDesc; // 0x0
	UPetEntitlementBaseDesc* PetCustomizationDesc; // 0x8
	FString PetName; // 0x10
};

struct FIPGDynamicSliderName {
	int32_t AffectedPriority; // 0x0
	FName Name; // 0x4
};

struct FMermaidUsedCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FMerchantQuestRequiredItemsGroupList {
	int32_t NumRequiredItems; // 0x0
	TArray<FMerchantQuestRequiredItemsGroup> RequiredItemsGroups; // 0x8
};

struct FNetViewer {
	AActor* InViewer; // 0x0
	AActor* ViewTarget; // 0x8
	FVector ViewLocation; // 0x10
	FVector ViewDir; // 0x1c
};

struct FDelegateArray {
	TArray<DelegateProperty> Delegates; // 0x0
};

struct FPuzzleVaultKeyUsedTelemetryEvent {
	FGuid VaultId; // 0x0
	FName VaultType; // 0x10
	FName VaultKeyUsed; // 0x18
};

struct FShippingStatsTelemetryFragment {
	FJsonObjectWrapper Json; // 0x0
};

struct FMaterialVisualisation {
	FActorComponentSelector TargetMesh; // 0x0
	float TransitionTime; // 0x10
	int32_t MaterialIndex; // 0x14
	FName ParameterName; // 0x18
	float ActiveValue; // 0x20
	float InactiveValue; // 0x24
	UMaterialInstanceDynamic* DynamicMaterial; // 0x28
};

struct FInterpCurveTwoVectors {
	TArray<FInterpCurvePointTwoVectors> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FExternalToolDefinition {
	FString ToolName; // 0x0
	FFilePath ExecutablePath; // 0x10
	FString CommandLineOptions; // 0x20
	FDirectoryPath WorkingDirectory; // 0x30
	FString ScriptExtension; // 0x40
	FDirectoryPath ScriptDirectory; // 0x50
};

struct FBountyQuestApproachesLandmarkTelemetryEvent {
	FString LandmarkName; // 0x0
};

struct FCanvasLOD {
	bool IsCanvasCountLimited; // 0x0
	int32_t MaxNumCanvasesAtThisLOD; // 0x4
	float ResolutionScaler; // 0x8
};

struct FContestMigrationRequestMessage {
	FGuid MigrationId; // 0x0
	FString DestinationEndpoint; // 0x10
	TArray<FGuid> CrewIds; // 0x20
};

struct FEventStartStow {
	TScriptInterface<Class> Object; // 0x0
	bool FastStow; // 0x10
	EStowMethod StowMethod; // 0x11
};

struct FEventWieldableStashedToStashPoint {
	UPrimitiveComponent* StashPointAttachParent; // 0x0
	bool Visible; // 0x8
};

struct FEventPlayerEnteredSittingState {
	USeatAnimationId* SeatAnimationId; // 0x0
};

struct FKrakenIdleBehaviourParams : FKrakenTentacleBehaviourParams {
	UEnvQuery* InactiveSpawnQueryTemplate; // 0x0
	float ChanceOfCannonSideSpawn; // 0x8
	UEnvQuery* ActiveCannonSideSpawnQueryTemplate; // 0x10
	UEnvQuery* ActiveNonCannonSideSpawnQueryTemplate; // 0x18
	AKrakenAnimatedTentacle* TentacleClass; // 0x20
	float MinScale; // 0x28
	float MaxScale; // 0x2c
	float MinPlayRateScale; // 0x30
	float MaxPlayRateScale; // 0x34
	float PanicDespawnShipRangeRadius; // 0x38
	float PanicDespawnWatercraftRangeRadius; // 0x3c
	float PanicDespawnTentacleRadius; // 0x40
	float PanicDespawnAnimationPlayRateScale; // 0x44
	float PreDeathAnimationPlayRateScale; // 0x48
	TArray<FKrakenTentacleBehaviourActionChances> OnDamageActionChances; // 0x50
	FWeightedProbabilityRangeOfRanges TimeToSpendInInactiveState; // 0x60
	FWeightedProbabilityRangeOfRanges TimeToSpendInActiveState; // 0x90
};

struct FQuestTypeParams {
	UWeightedTreasureChestDescAsset* ReferencedRewards; // 0x8
	TArray<FWeightedTreasureChestDesc> Rewards; // 0x10
	UWeightedItemDescSpawnDataAsset* RewardsAsset; // 0x20
	UTreasureMapItemDesc* OverrideTreasureMapItemDesc; // 0x28
};

struct FRankOffer {
	FShopOffer ShopOffer; // 0x0
	int32_t LevelRequirement; // 0x1e0
};

struct FWheelAdditiveAlphaSets {
	float IsAdditiveRightFingerIdle; // 0x0
	float IsAdditiveLeftFingerIdle; // 0x4
	float IsAdditiveIdle; // 0x8
	float LeftFingerAdditiveValue; // 0xc
	float RightFingerAdditiveValue; // 0x10
	float fullBodyAdditiveValue; // 0x14
	float RHandAdditiveBlendValue; // 0x18
	float LHandAdditiveBlendValue; // 0x1c
	float FullBodyAdditiveBlendValue; // 0x20
};

struct FCutScenePlayData {
	int32_t PlayIndex; // 0x0
	double StartTimeInSeconds; // 0x8
	USceneDialogueData* DialogueData; // 0x10
	TArray<FText> LocalisableNames; // 0x18
	TArray<FPossessableSequence> PossessableSequences; // 0x28
};

struct FCustomAnimationMontageStagedLoopingData {
	UAnimMontage* Into; // 0x0
	TArray<UAnimMontage*> LoopAnims; // 0x8
	TArray<UAnimMontage*> OutOfAnims; // 0x18
};

struct FUIRankSkin {
	FString DisplayName; // 0x0
	FString Description; // 0x10
	FString RibbonImageUrl; // 0x20
};

struct FGamerTagUpdated {
	FString GamerTag; // 0x0
};

struct FKrakenAnimatedTentacleHeldTargetVomittingChance {
	float Chance; // 0x0
	UKrakenAnimatedTentacleState* CurrentState; // 0x8
};

struct FClientTelemetryFragment {
	FGuid TitleSession; // 0x0
	FString UserId; // 0x10
	char PlatformId; // 0x20
	char DeviceSpecScore; // 0x21
	FString DeviceID; // 0x28
	FGuid PlayerGameId; // 0x38
	FString BuildId; // 0x48
	FString ClientPlayMode; // 0x58
	FString PlayModeState; // 0x68
};

struct FEmissaryStateUpdateEvent {
	float CurrentRepTotal; // 0x0
	FName CompanyId; // 0x4
};

struct FParticleCurvePair {
	FString CurveName; // 0x0
	UObject* CurveObject; // 0x10
};

struct FSerialisedRpc {
	UScriptStruct* ContentsType; // 0x18
};

struct FClientPanicGarbageCollectionTelemetryEvent {
	int32_t GCPanicMemThreshold; // 0x0
	uint32_t PercentMemUsedBefore; // 0x4
	uint64_t UsedPhysicalBefore; // 0x8
	uint32_t PercentMemUsedAfter; // 0x10
	uint64_t UsedPhysicalAfter; // 0x18
};

struct FUIFrameDurationDataTelemetryFragment {
	uint32_t Num02ms; // 0x0
	uint32_t Num04ms; // 0x4
	uint32_t Num06ms; // 0x8
	uint32_t Num08ms; // 0xc
	uint32_t Num10ms; // 0x10
	uint32_t Num12ms; // 0x14
	uint32_t Num14ms; // 0x18
	uint32_t Num16ms; // 0x1c
	uint32_t Num18ms; // 0x20
	uint32_t Num20ms; // 0x24
	uint32_t Num22ms; // 0x28
	uint32_t Num24ms; // 0x2c
	uint32_t Num26ms; // 0x30
	uint32_t Num28ms; // 0x34
	uint32_t Num30ms; // 0x38
	uint32_t Num32ms; // 0x3c
	uint32_t Num34ms; // 0x40
	uint32_t Num36ms; // 0x44
	uint32_t Num38ms; // 0x48
	uint32_t Num40ms; // 0x4c
	uint32_t Num42ms; // 0x50
	uint32_t Num44ms; // 0x54
	uint32_t Num46ms; // 0x58
	uint32_t Num48ms; // 0x5c
	uint32_t Num50ms; // 0x60
	uint32_t Num52ms; // 0x64
	uint32_t Num54ms; // 0x68
	uint32_t Num56ms; // 0x6c
	uint32_t Num58ms; // 0x70
	uint32_t Num60ms; // 0x74
	uint32_t Num62ms; // 0x78
	uint32_t Num64ms; // 0x7c
	uint32_t Num66ms; // 0x80
	uint32_t NumOver66ms; // 0x84
	float Min; // 0x88
	float Max; // 0x8c
	float Average; // 0x90
};

struct FNamedStateSelector {
	TArray<FNameActiveStatePair> NamedStates; // 0x0
	FName DefaultStateName; // 0x10
};

struct FEventSwimmingCreatureShipBite {
	AShip* Ship; // 0x0
	FVector BiteLocation; // 0x8
};

struct FSoundClassProperties {
	float Volume; // 0x0
	float Pitch; // 0x4
	float StereoBleed; // 0x8
	float LFEBleed; // 0xc
	float VoiceCenterChannelVolume; // 0x10
	float RadioFilterVolume; // 0x14
	float RadioFilterVolumeThreshold; // 0x18
	char bApplyEffects : 1; // 0x1c
	char bAlwaysPlay : 1; // 0x1c
	char bIsUISound : 1; // 0x1c
	char bIsMusic : 1; // 0x1c
	char bReverb : 1; // 0x1c
	char bCenterChannelOnly : 1; // 0x1c
	char bApplyAmbientVolumes : 1; // 0x1c
	EAudioOutputTarget OutputTarget; // 0x20
};

struct FRegionMapIslandData {
	FIslandSelectionType Island; // 0x0
	bool RenderToMap; // 0x8
	float Scale; // 0xc
	float RotationOffset; // 0x10
	FVector2D LocationOffset; // 0x14
	bool Selectable; // 0x1c
	int32_t MaxNumSelections; // 0x20
};

struct FCapstanNetState {
	float TargetRatio; // 0x0
	bool IsLocked; // 0x4
};

struct FEventMeleeAttackStarted {
	UMeleeAttackDataAsset* AttackData; // 0x0
};

struct FPiratePreviewGeneratePirateEvent {
	FPirateDescription PirateDescription; // 0x0
	FPiratePreviewView View; // 0x80
	bool ForceRebuild; // 0xa0
};

struct FDamageParamWeights {
	float StrainUpperBound; // 0x0
	float ArenaStrainUpperBound; // 0x4
	FWeightedProbabilityRangeOfRanges MinMaxRanges; // 0x8
	FWeightedProbabilityRangeOfRanges AnticipationRanges; // 0x38
	FWeightedProbabilityRangeOfRanges DamageRanges; // 0x68
	float BottomDeckWeight; // 0x98
	float ExistingHoleWeight; // 0x9c
};

struct FLandClueCreationChoice {
	UClueSiteType* ClueSiteType; // 0x0
	FName IslandIdentifier; // 0x8
	ULandClueCreator* ClueCreator; // 0x10
};

struct FTreasuryWaveEncounter {
	ETreasuryEncounterType EncounterType; // 0x0
	ASpawnAIWaveMechanismAction* SpawnerMechanism; // 0x8
	AActor* MechanismTrigger; // 0x10
	ASpawnAIWaveMechanismAction* SpawnerMechanismVaultMaster; // 0x18
	AActor* MechanismTriggerVaultMaster; // 0x20
	UTreasuryWaveDataAsset* Waves; // 0x28
	UTreasuryWaveDataAsset* FinalWaves; // 0x30
	UTreasuryWaveDataAsset* FinalWavesVaultMaster; // 0x38
	bool NeedsRoomFlooded; // 0x40
};

struct FRopeCatenaryLengthPair {
	float Taut; // 0x0
	float Catenary; // 0x4
};

struct FAlphaBlend {
	EAlphaBlendOption BlendOption; // 0x0
	float BeginValue; // 0x4
	float DesiredValue; // 0x8
	float BlendTime; // 0xc
	UCurveFloat* CustomCurve; // 0x10
	float AlphaLerp; // 0x18
	float AlphaBlend; // 0x1c
	float AlphaTarget; // 0x20
	float BlendTimeRemaining; // 0x24
	float BlendedValue; // 0x28
};

struct FEnableMoreButtonEvent {
	EMoreButtonSource MoreButtonSource; // 0x0
	FNavigationDesc Navigation; // 0x4
};

struct FEmissarySecuredLootOnShipNetworkEvent : FNetworkEventStruct {
	FName CompanyName; // 0x10
};

struct FWaterInformation {
	UWaterId* WaterType; // 0x0
	bool CanSwim; // 0x8
};

struct FGameplayEffectAttributeCaptureDefinition {
	FGameplayAttribute AttributeToCapture; // 0x0
	EGameplayEffectAttributeCaptureSource AttributeSource; // 0x8
	bool bSnapshot; // 0x9
};

struct FGameplayAbilitySpecDef {
	UGameplayAbility* Ability; // 0x0
	int32_t Level; // 0x8
	int32_t InputID; // 0xc
	EGameplayEffectGrantedAbilityRemovePolicy RemovalPolicy; // 0x10
	UObject* SourceObject; // 0x18
	FGameplayAbilitySpecHandle AssignedHandle; // 0x20
};

struct FLobbyServiceModel {
	FLobbyInviteCode InviteCode; // 0x0
	FString HostXuid; // 0x20
	FLobbyCreationRequestModel LobbyCreationRequest; // 0x30
	FString CreationTimeUtc; // 0x40
};

struct FRepAttachment {
	AActor* AttachParent; // 0x0
	FVector_NetQuantize100 LocationOffset; // 0x8
	FVector_NetQuantize100 RelativeScale3D; // 0x14
	FRotator RotationOffset; // 0x20
	FName AttachSocket; // 0x2c
	USceneComponent* AttachComponent; // 0x38
};

struct FCollisionResponseContainer {
	ECollisionResponse WorldStatic; // 0x0
	ECollisionResponse WorldDynamic; // 0x1
	ECollisionResponse Pawn; // 0x2
	ECollisionResponse Visibility; // 0x3
	ECollisionResponse Camera; // 0x4
	ECollisionResponse PhysicsBody; // 0x5
	ECollisionResponse Vehicle; // 0x6
	ECollisionResponse Destructible; // 0x7
	ECollisionResponse EngineTraceChannel1; // 0x8
	ECollisionResponse EngineTraceChannel2; // 0x9
	ECollisionResponse EngineTraceChannel3; // 0xa
	ECollisionResponse EngineTraceChannel4; // 0xb
	ECollisionResponse EngineTraceChannel5; // 0xc
	ECollisionResponse EngineTraceChannel6; // 0xd
	ECollisionResponse GameTraceChannel1; // 0xe
	ECollisionResponse GameTraceChannel2; // 0xf
	ECollisionResponse GameTraceChannel3; // 0x10
	ECollisionResponse GameTraceChannel4; // 0x11
	ECollisionResponse GameTraceChannel5; // 0x12
	ECollisionResponse GameTraceChannel6; // 0x13
	ECollisionResponse GameTraceChannel7; // 0x14
	ECollisionResponse GameTraceChannel8; // 0x15
	ECollisionResponse GameTraceChannel9; // 0x16
	ECollisionResponse GameTraceChannel10; // 0x17
	ECollisionResponse GameTraceChannel11; // 0x18
	ECollisionResponse GameTraceChannel12; // 0x19
	ECollisionResponse GameTraceChannel13; // 0x1a
	ECollisionResponse GameTraceChannel14; // 0x1b
	ECollisionResponse GameTraceChannel15; // 0x1c
	ECollisionResponse GameTraceChannel16; // 0x1d
	ECollisionResponse GameTraceChannel17; // 0x1e
	ECollisionResponse GameTraceChannel18; // 0x1f
};

struct FPlayerCapstanUsageEndTelemetryEvent {
	int32_t NumCurrentUsers; // 0x0
	float CapstanVelocity; // 0x4
	float CapstanState; // 0x8
};

struct FActorInsideFlameInformation {
	TScriptInterface<Class> DamageableInterface; // 0x0
	TScriptInterface<Class> StatusEffectRecipientInterface; // 0x10
	AActor* ActorWithFirePropagationInterface; // 0x20
};

struct FEmoteDiceOutcomeTelemetryEvent {
	int32_t MaxLimit; // 0x0
	int32_t RollNumber; // 0x4
	FVector OrientationUsed; // 0x8
};

struct FDestructibleDamageParameters {
	float DamageThreshold; // 0x0
	float DamageSpread; // 0x4
	bool bEnableImpactDamage; // 0x8
	float ImpactDamage; // 0xc
	int32_t DefaultImpactDamageDepth; // 0x10
	bool bCustomImpactResistance; // 0x14
	float ImpactResistance; // 0x18
};

struct FIslandSnapshotV1 {
	int32_t Id; // 0x0
	FVector Position; // 0x4
	FString Name; // 0x10
};

struct FActorSequenceObjectReferences {
	TArray<FActorSequenceObjectReference> Array; // 0x0
};

struct FEventFaunaThreatLevelChanged {
	EAIThreatLevel ThreatLevel; // 0x0
};

struct FShipMetadata {
	FString Name; // 0x0
	UShipType* ShipTypeObject; // 0x10
	UShipCategory* ShipCategoryObject; // 0x18
};

struct FHangoutSpotPosition {
	FHangoutSpotId Id; // 0x0
	FTransform Transform; // 0x10
	EHangoutRotationMode RotationMode; // 0x40
	EShipDeck ShipDeck; // 0x41
	APawn* Occupier; // 0x48
	bool IsPerch; // 0x60
	bool NeedOverrideInteractionPoint; // 0x61
	FVector OverrideInteractionPointPosition; // 0x64
	bool BlockPetEmoteReactions; // 0x70
	bool IgnorePickupFromHangoutTooltipDisplayOffset; // 0x71
};

struct FLiquidContents {
	AShip* LiquidSource; // 0x0
	TArray<AShip*> LiquidTargets; // 0x8
	AActor* Container; // 0x18
	float LiquidVolume; // 0x20
	FGuid ScoopID; // 0x24
	float LiquidTransferFillAmountModifier; // 0x34
	EContainerType ContainerType; // 0x38
};

struct FReviveGhostAnimations {
	UAnimSequence* ReviveInto; // 0x0
	UAnimSequence* SwimmingReviveInto; // 0x8
	UAnimSequence* ReviveLoop; // 0x10
	UAnimSequence* ReviveOutOf; // 0x18
	UAnimSequence* ReviveOutOfLoop; // 0x20
};

struct FEventPawnStartedDying {
	APawn* AIPawn; // 0x0
	ECharacterDeathType DeathType; // 0x8
	AActor* Instigator; // 0x10
};

struct FNarrationStateEvent {
	bool IsEnabled; // 0x0
};

struct FDigAnimParams {
	EShovelDigType DigType; // 0x0
	float Duration; // 0x4
	float TimeStampOfUnlockingWielderMovement; // 0x8
	float TimeStampOfEnterGround; // 0xc
	float TimeStampOfLeaveGround; // 0x10
	EWieldableItemAnimVariant AnimVariant; // 0x14
};

struct FShipDesc {
	FShipMetadata MetaData; // 0x0
	FShipTemplate Template; // 0x20
	FPartsCustomisation Customisation; // 0x28
};

struct FCanLoadItemCategoryEntry {
	UItemCategory* CanLoadItemCategory; // 0x0
	FName FeatureToggle; // 0x8
};

struct FEventRelinquishedControlOfObject {
	UObject* RelinquishedObject; // 0x0
};

struct FStoreCatalog {
	TArray<FStoreCatalogItem> Items; // 0x0
};

struct FAthenaAnimationObjectActionContinuousStruct {
	UAnimSequence* MainInto; // 0x0
	UBlendSpace* MainIntoLocomotion; // 0x8
	UAnimSequence* OneShotInto; // 0x10
	UAnimSequence* MainCycleIdle; // 0x18
	UBlendSpace* MainCycleLocomotion; // 0x20
	bool UseMainCycleJump; // 0x28
	FAthenaAnimationObjectJumpingAnimations MainCycleJump; // 0x30
	UAnimSequence* MainOutOf; // 0x50
	UBlendSpace* MainOutOfLocomotion; // 0x58
	FAthenaAnimationObjectActionContinuousSwimming MainSwimming; // 0x60
	FAthenaAnimationLocomotionTurningAnimData TurningLeftAlt; // 0x80
	FAthenaAnimationLocomotionTurningAnimData TurningRightAlt; // 0x88
	UAnimSequence* TurnOutAlt; // 0x90
	bool IgnoreOverlayHandAdditiveForAction; // 0x98
	UAnimSequence* CustomAdditiveForAction; // 0xa0
};

struct FMeleeAIAbilityAngleChecker {
	TScriptInterface<Class> PawnCharacterOrientationInterface; // 0x0
};

struct FEventAIPawnRemovedFromAIRegion {
	APawn* AIPawn; // 0x0
};

struct FDebugFishSelectionBreed {
	FString BreedName; // 0x0
	TArray<FDebugFishSelectionColour> FishColours; // 0x10
};

struct FRammableDamageSpeedEntry {
	UShipSpeedBand* SpeedBand; // 0x0
	TArray<FRammableDamageEntry> DamageRammerTypes; // 0x8
};

struct FTaleQuestNotificationStepEvent : FNetworkEventStruct {
	UPopUpMessageDesc* PopUpDesc; // 0x10
	FNetActorPtr DiscoveringPlayerStateNetPtr; // 0x18
};

struct FLocalGameChatStatusEvent {
	ELocalGameChatStatus Status; // 0x0
};

struct FKrakenHeadTransitionAnimation {
	UKrakenHeadState* FromState; // 0x0
	UAnimSequence* TransitionAnimation; // 0x8
};

struct FShipPartLevelsOfDamage {
	UClass* ActorClass; // 0x0
	TArray<FDistanceAndLevelOfDamage> DamagePerDistance; // 0x20
};

struct FAnimationDataStoreAssetWeakReferenceEntry {
	UAnimationDataStoreId* AnimDataId; // 0x0
	UClass* AnimData; // 0x8
};

struct FMeshMemoryConstraintTelemetryFragment {
	TArray<FMeshMemoryConstraintTelemetryBudgetFragment> BudgetData; // 0x0
};

struct FWidgetAnimationBinding {
	FName WidgetName; // 0x0
	FName SlotWidgetName; // 0x8
	FGuid AnimationGuid; // 0x10
	bool bIsRootWidget; // 0x20
};

struct FGameEventSchedulerConfigTelemetry {
	EGameEventSchedulerEventType TrackedActorType; // 0x0
	int32_t NumAllowed; // 0x4
};

struct FMovieSceneSkeletalAnimationParams {
	UAnimSequenceBase* Animation; // 0x0
	float StartOffset; // 0x8
	float EndOffset; // 0xc
	float PlayRate; // 0x10
	char bReverse : 1; // 0x14
	FName SlotName; // 0x18
	FRichCurve Weight; // 0x20
};

struct FAISpawnContextIdEncounterSettingsPair {
	TArray<UAISpawnContextId*> SpawnContexts; // 0x0
	bool DisableSpawning; // 0x10
	UAIEncounterSettings* EncounterSettings; // 0x18
	UAISpawnWaveSequenceRankProgression* SpawnWaveProgression; // 0x20
	TArray<FAIEncounterAndWaveSettingsOverride> EncounterAndWaveSettingsOverride; // 0x28
};

struct FGenericLightTemplate {
	ELightTemplateType LightType; // 0x0
	FBaseLightData BaseLightData; // 0x8
	FPointLightData PointLightData; // 0x88
	FSpotLightData SpotLightData; // 0xc4
};

struct FPlayerBuriedItemServiceMapTakenFromTavernBoardEvent {
	FString PlayerName; // 0x0
	UPopUpMessageDesc* PopUpDesc; // 0x10
};

struct FLaunchableActiveProjectileData {
	FLaunchableProjectileData Projectile; // 0x0
};

struct FCrewMutePlayerVoiceEvent {
	FString XUID; // 0x0
	bool IsMuted; // 0x10
};

struct FLevelLoadCompletedTelemetryEvent : FStreamingTelemetryBaseEvent {
	bool WasCancelRequested; // 0x30
	bool WasCancelActioned; // 0x31
	float DistancePlayerTravelledSinceLoadRequest; // 0x34
	float TimeSinceLoadRequested; // 0x38
};

struct FAIShipEncounterZoneExitedNetworkEvent : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FLevelCompletionMessage {
	FPirateIdentity Pirate; // 0x0
	FGuid SeasonId; // 0x78
	int32_t Level; // 0x88
	int32_t TimeSpentInLevel; // 0x8c
	int32_t Tier; // 0x90
	int32_t TimeSpentInTier; // 0x94
	bool TierCompleted; // 0x98
	bool SeasonCompleted; // 0x99
};

struct FCoordinatedKrakenAction {
	FName ActionName; // 0x0
	float ActionLength; // 0x8
	ECoordinatedKrakenActionType ActionType; // 0xc
	TArray<FCoordinatedKrakenSpecialEvent> SpecialEvents; // 0x10
	TArray<FCoordinatedKrakenTentacleAction> TentacleActions; // 0x20
	TArray<FCoordinatedKrakenHeadAction> HeadActions; // 0x30
	TArray<FCoordinatedKrakenExplosionEvent> ExplosionEvents; // 0x40
	FRuntimeVectorCurve TargetActorLocationAnimation; // 0x50
	FRuntimeVectorCurve TargetActorRotationAnimation; // 0x1c0
};

struct FContestTimerData {
	float Time; // 0x0
	FString ServicesConfigRetrievalString; // 0x8
};

struct FOceanCrawlerBuffAudioSettings {
	UWwiseEvent* GiveBuffAudioEvent; // 0x0
	UWwiseEvent* ReceiveBuffAudioEvent; // 0x8
};

struct FCapturedByKrakenActionStateParams {
	UCurveFloat* MovementAlphaXY; // 0x0
	UCurveFloat* MovementAlphaZ; // 0x8
	UCurveFloat* MovementRotation; // 0x10
	float MovementTime; // 0x18
	float DistanceFromTentacleToStartFade; // 0x1c
	float FadeInDuration; // 0x20
	float ClientConditionsCompleteTimeout; // 0x24
	float MinCameraPitch; // 0x28
	float MaxCameraPitch; // 0x2c
	float MinCameraYaw; // 0x30
	float MaxCameraYaw; // 0x34
	float AnimationProgressionToStopCameraFade; // 0x38
	float BlockInteractInputTime; // 0x3c
};

struct FRiddleTextPhraseId {
	FName PhraseId; // 0x0
	int32_t VariantIndex; // 0x8
};

struct FAdditionalSpawnerBehaviour {
	USpawnerBehaviourStrategy* BehaviourStrategy; // 0x0
};

struct FVirtualActionBindingDefinition {
	TArray<FName> ActionNames; // 0x0
	FString BindingName; // 0x10
};

struct FEventFriendsListResponse {
	TArray<FString> FriendsList; // 0x0
};

struct FGameTimeRange {
	FGameTime Start; // 0x0
	FGameTime End; // 0x8
};

struct FMerchantQuestParams : FQuestTypeParams {
	FWeightedProbabilityRange NumberOfRequiredItems; // 0x30
	FWeightedProbabilityRangeOfRanges TimeLimitInMinutes; // 0x50
	UMerchantQuestRequiredItemsDataAsset* RequiredItemsDataAsset; // 0x80
	UMerchantQuestRandomRequiredItemsDataAsset* RandomRequiredItemsDataAsset; // 0x88
	FWeightedProbabilityRange NumberOfGroups; // 0x90
	TArray<FMerchantQuestCategoryGroupBounds> CategoryGroupBounds; // 0xb0
};

struct FEventHdrSettingsVisible {
	bool Visible; // 0x0
};

struct FVoyageProposalLostVotingSessionTelemetryEvent {
	FGuid VoyageProposalSessionId; // 0x0
	FString VoyageProposalEntitlementId; // 0x10
	int32_t NumberOfVotes; // 0x20
};

struct FEnvBoolParam_DEPRECATED {
	bool Value; // 0x0
	FName ParamName; // 0x4
};

struct FEventKeybindCaptureRequest {
	EInputControllerType ControllerTypeKeyToExpect; // 0x0
};

struct FAthenaAnimationLODSettings {
	EIKState IKState; // 0x0
	EIKSolverType IKSolverType; // 0x1
	EIKFootPlantingState IKFootPlantingState; // 0x2
};

struct FRequestedLoopAnims {
	FName RequestedLoopingAnimName; // 0x0
	int32_t RequestedOutOfAnimIndex; // 0x8
};

struct FAthenaAnimationIdleVariantChange {
	float CurrentTime; // 0x0
	float TriggerTime; // 0x4
	int32_t VariantID; // 0x8
	bool VariantCompleted; // 0xc
};

struct FInlineTextImageStyle : FSlateWidgetStyle {
	FSlateBrush Image; // 0x8
	int16_t Baseline; // 0x98
};

struct FCarouselPirateGroup {
	FName Name; // 0x0
	int32_t Count; // 0x8
	FFloatRange Age; // 0xc
	FFloatRange Wonkiness; // 0x1c
	FFloatRange Dirt; // 0x2c
	FCarouselPirateBodyshape MaleBodyShape; // 0x3c
	FCarouselPirateBodyshape FemaleBodyShape; // 0x54
};

struct FRemoteLocalizationData {
	TArray<FLocText> LocDictionary; // 0x0
	FString Locale; // 0x10
};

struct FCompanyShopSkin {
	FStringAssetReference TopBanner; // 0x0
	FStringAssetReference BottomBanner; // 0x10
};

struct FEventEncounterStart : FEventEncounterBase {
	FGuid EncounterId; // 0x0
	AActor* EncounterActor; // 0x10
	EEncounterType EncounterType; // 0x18
	float EncounterRadiusSquared; // 0x1c
};

struct FEventMeleeWeaponAttackTriggered {
	EMeleeWeaponAttackType AttackType; // 0x0
	int32_t AttackIndex; // 0x4
};

struct FPlayerCheatTelemetryEvent {
	FString CheatSource; // 0x0
	FString CheatFunction; // 0x10
	FString CheatArguments; // 0x20
};

struct FAthenaAnimationOverrideEntry {
	FName Name; // 0x0
	FStringAssetReference MeshFirstPerson; // 0x8
	FStringAssetReference MeshThirdPerson; // 0x18
	FStringAssetReference AnimationDataStore; // 0x28
	UAnimationDataStoreId* ALKFirstPerson; // 0x38
	UAnimationDataStoreId* ALKThirdPerson; // 0x40
};

struct FEventCharacterLanded {
	FHitResult HitResult; // 0x0
	float VerticalSpeed; // 0x80
};

struct FStatColorMapping {
	FString StatName; // 0x0
	TArray<FStatColorMapEntry> ColorMap; // 0x10
	char DisableBlend : 1; // 0x20
};

struct FHealthUI {
	float MinVisibleHealth; // 0x0
	float ContinuousTimePerUpdate; // 0x4
	APawn* TargetPawn; // 0x20
};

struct FCloudWeatherParameters {
	FVector2D DefaultCloudVelocity; // 0x0
	UMaterialParameterCollection* AtmosphericMaterialParams; // 0x8
	float GlobalAtmosphericPressure; // 0x10
	float AtmosphericPressureThresholdSize; // 0x14
	float MaxWindDelayLength; // 0x18
	float WindSpeedMultiplier; // 0x1c
	char UsesGlobalWindService : 1; // 0x20
	char UsesPressureZones : 1; // 0x20
	char CloudsCastShadows : 1; // 0x20
	char PressureIsControlledByParameterCollection : 1; // 0x20
};

struct FWeaponProjectileCreator {
	FGuid Id; // 0x0
	FGuid AttackId; // 0x10
	TWeakObjectPtr<AActor> Instigator; // 0x20
	FVector Origin; // 0x28
	FVector Direction; // 0x34
	FProjectileAim AimData; // 0x40
	TArray<AActor*> IgnoredActors; // 0x90
	FWeaponProjectileParams Params; // 0xa0
	UDamagerType* DamagerType; // 0x150
	FGuid TelemetryAttackId; // 0x158
	int32_t SubAttackGroupId; // 0x168
	FTransform WeaponMeshTransform; // 0x170
	UObject* WeaponMesh; // 0x1a0
	float DistanceBeforeGravity; // 0x1a8
};

struct FClueSiteTypeToMarkId {
	UClueSiteType* ClueSiteType; // 0x0
	UMapMarkId* MapMarkId; // 0x8
};

struct FQuestVariablePlayerActor : FQuestVariable {
	FName ParamName; // 0x8
};

struct FEventCharacterEndTeleport {
	AActor* Character; // 0x0
	bool PlayOnTeleportEndSounds; // 0x8
	ETeleportNotificationSource TeleportNotificationSource; // 0x9
};

struct FRemoteProjectileAim {
	FProjectileAim AimData; // 0x0
	bool IsRelativeAim; // 0x50
	FProjectileTimeStamp TimeStamp; // 0x58
};

struct FAIWeightedProbabilityRangeOfRangesRankMapping {
	UAIWeightedProbabilityRangeOfRangesAsset* RangeOfRanges; // 0x0
	TArray<float> Weights; // 0x8
};

struct FAthenaAnimationSkeletonCurseAnimations {
	UAnimSequence* SkeletonDrunk; // 0x0
	UAnimSequence* SkeletonDance; // 0x8
	UAnimSequence* SkeletonSleepInto; // 0x10
	UAnimSequence* SkeletonSleepLoop; // 0x18
	UAnimSequence* SkeletonSleepOut; // 0x20
};

struct FStandardSailDynamicsParameters {
	float ForceGeneratedByWindSpeedPerMPS; // 0x0
	float AirDragPerSailPerMPS; // 0x4
	float PowerRatioOfSailForwardForceToFullForce; // 0x8
};

struct FEventOnCrewStorageFull {
	FGuid CrewStoring; // 0x0
	int16_t IslandHash; // 0x10
};

struct FInputActionKeyMapping {
	FName ActionName; // 0x0
	FKey Key; // 0x8
	char bShift : 1; // 0x28
	char bCtrl : 1; // 0x28
	char bAlt : 1; // 0x28
	char bCmd : 1; // 0x28
};

struct FAggressiveGhostShipEncounterEndTelemetryEvent {
	FGuid EncounterId; // 0x0
	bool WasSuccessfullyCompleted; // 0x10
};

struct FHitRegSnapshotDisplaySettings {
	bool DisplaySnapshot; // 0x0
	bool DisplayAttackingClientData; // 0x1
	bool DisplayServerData; // 0x2
	bool ShowDetailedExplanations; // 0x3
};

struct FEventTinySharkDespawned {
	ETinySharkDespawnReason DespawnReason; // 0x0
};

struct FNotesManagementRemoteServiceNoteTextModel {
	FString Locale; // 0x0
	FString Title; // 0x10
	FString Text; // 0x20
};

struct FShipwreckStateData : FActorStateData {
	FString Name; // 0x20
};

struct FSleepingActionStateParams : FControlObjectActionStateParams {
	EControllableObjectType ControllableObjectType; // 0x18
	USeatAnimationId* BedAnimationId; // 0x20
	float CameraFadeDuration; // 0x28
	float TooltipDelay; // 0x2c
	float HealthRegenDelay; // 0x30
	float HealthRegenTickInterval; // 0x34
	float HealthRegenTickAmount; // 0x38
	bool ShouldHideFirstPersonMesh; // 0x3c
	ESleepingActionStateDockingMode DockingMode; // 0x3d
	float SleepingSfxDelay; // 0x40
	float SleepingAudioStateDelay; // 0x44
	bool NeverFartWhileSleeping; // 0x48
	float UnderwaterDepthThreshold; // 0x4c
};

struct FDeepSeaRegionData {
	float DeepSeaRegionRadius; // 0x8
	float MaxSwimDepth; // 0xc
	bool ShouldUseDeepSeaSwimmingBounds; // 0x10
	float SwimmingBoundsRadius; // 0x14
	float SlowDownZoneWidth; // 0x18
};

struct FMargin {
	float Left; // 0x0
	float Top; // 0x4
	float Right; // 0x8
	float Bottom; // 0xc
};

struct FEventPlayerTakenControlOfControllable {
	AActor* ControllableObject; // 0x0
};

struct FMeshScoring {
	FName MeshName; // 0x0
	TArray<FIndividualMeshScoring> RegisteredComponents; // 0x8
};

struct FLandscapeInfoLayerSettings {
	ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
	FName LayerName; // 0x8
};

struct FShantyPuzzleSingleInteractionZoneUnlockEvent {
	AActor* Player; // 0x0
	int32_t InteractionZoneIdx; // 0x8
};

struct FMemoryDataTelemetryFragment {
	uint64_t MemAvailPhyAvg; // 0x0
	uint64_t MemAvailPhyMin; // 0x8
	uint64_t MemAvailPhyMax; // 0x10
	uint64_t MemAvailVirAvg; // 0x18
	uint64_t MemAvailVirMin; // 0x20
	uint64_t MemAvailVirMax; // 0x28
	uint64_t MemUsedPhyAvg; // 0x30
	uint64_t MemUsedPhyMin; // 0x38
	uint64_t MemUsedPhyMax; // 0x40
	uint64_t MemUsedVirAvg; // 0x48
	uint64_t MemUsedVirMin; // 0x50
	uint64_t MemUsedVirMax; // 0x58
	uint64_t MemAvailPhyUIAvg; // 0x60
	uint64_t MemAvailPhyUIMin; // 0x68
	uint64_t MemAvailPhyUIMax; // 0x70
	uint64_t MemAvailVirUIAvg; // 0x78
	uint64_t MemAvailVirUIMin; // 0x80
	uint64_t MemAvailVirUIMax; // 0x88
	uint64_t MemUsedPhyUIAvg; // 0x90
	uint64_t MemUsedPhyUIMin; // 0x98
	uint64_t MemUsedPhyUIMax; // 0xa0
	uint64_t MemUsedVirUIAvg; // 0xa8
	uint64_t MemUsedVirUIMin; // 0xb0
	uint64_t MemUsedVirUIMax; // 0xb8
	uint64_t MemUsedMallocCurrent; // 0xc0
	uint64_t MemUsedMallocPeak; // 0xc8
	TArray<FMemoryTableData> TableInfo; // 0xd0
	uint64_t NumLargeAllocations; // 0xe0
	uint64_t PeakLargeAllocations; // 0xe8
	uint64_t MemUsedCachedPagesCurrent; // 0xf0
	uint64_t MemUsedCachedPagesPeak; // 0xf8
	uint64_t MemUsedAsyncLoadingRegularMax; // 0x100
	uint64_t MemUsedAsyncLoadingOverflowMax; // 0x108
	uint64_t MemUsedAsyncLoadingExtraOverflowMax; // 0x110
	int32_t HighMemoryThresholdPercentage; // 0x118
	uint64_t MemUsedTexturePoolAvg; // 0x120
	uint64_t MemUsedTexturePoolMin; // 0x128
	uint64_t MemUsedTexturePoolMax; // 0x130
	uint64_t MemUsedTextureUnstreamedAvg; // 0x138
	uint64_t MemUsedTextureUnstreamedMin; // 0x140
	uint64_t MemUsedTextureUnstreamedMax; // 0x148
	uint64_t MemUsedRenderTargetAvg; // 0x150
	uint64_t MemUsedRenderTargetMin; // 0x158
	uint64_t MemUsedRenderTargetMax; // 0x160
};

struct FItemBlockingParameters {
	float BlockingHalfAngle; // 0x0
};

struct FLightingControllerAssetParams {
	UMaterialParameterCollection* AtmosphericMaterialParams; // 0x0
	UMaterialParameterCollection* CloudMaterialParams; // 0x8
	UMaterialParameterCollection* ScreenEffectsMaterialParams; // 0x10
	UMaterialParameterCollection* IslandDangerMaterialParams; // 0x18
	ULightingControllerSettings* UnderworldLightingSet; // 0x20
	ULightingControllerSettings* HideoutLightingSet; // 0x28
	ULightingControllerSettings* ArenaTavernLightingSet; // 0x30
	UStaticMesh* SkyDomeMesh; // 0x38
	UStaticMesh* NorthStarMesh; // 0x40
	UStaticMesh* MoonMesh; // 0x48
};

struct FSeasonsChatNotificationEvent {
	FSeasonsChatNotification SeasonsChatNotification; // 0x0
};

struct FGiveEmergentVoyageData {
	int32_t PlayerNetGUID; // 0x0
	FString VoyageAssetPath; // 0x8
};

struct FVoyageLocationFixedParams {
	FName Name; // 0x0
};

struct FSetVulnerabilityData {
	int32_t ActorId; // 0x0
	FString DamagerType; // 0x8
	float DamageMultipler; // 0x18
};

struct FBountyQuestTargetKilledTelemetryEvent {
	FString BountyTargetName; // 0x0
	FGuid BootyId; // 0x10
};

struct FQuestVariableOrientedPoint : FQuestVariable {
	FName ParamName; // 0x8
};

struct FRiddleActionLocation {
	float Weight; // 0x0
	ERiddleLocations RiddleLocation; // 0x4
	ERiddleActionLocationOffsets RiddleActionLocationOffset; // 0x5
};

struct FAnimNode_Slot : FAnimNode_Base {
	FPoseLink Source; // 0x30
	FName SlotName; // 0x48
	int16_t LastSlotNodeInitializationCounter; // 0x58
};

struct FMaterialReferencesEntry {
	FName Name; // 0x0
	TArray<FMaterialReferenceEntry> References; // 0x8
};

struct FDigEventFxParams {
	UObject* Particles; // 0x0
	bool bAttachParticlesToShovel; // 0x8
	UForceFeedbackEffect* Rumble; // 0x10
};

struct FNavAgentProperties : FMovementProperties {
	FName Name; // 0x4
	float AgentRadius; // 0xc
	float AgentHeight; // 0x10
	float AgentStepHeight; // 0x14
	float NavWalkingSearchHeightScale; // 0x18
	float NavWalkingSearchRadiusScale; // 0x1c
	float NavWalkingSearchRadiusScaleOffMesh; // 0x20
	float AgentMaxSlope; // 0x24
	float MinRegionArea; // 0x28
};

struct FWindZoneParams {
	float OuterRadius; // 0x0
	float InnerRadius; // 0x4
	float TurbulenceScalar; // 0x8
	bool WindOnlyAffectsTrees; // 0xc
};

struct FEmissaryDeactivatedNetworkEvent : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FEventCharacterStartedDrowning {
	float TimeTillDrown; // 0x0
};

struct FPhysicalSurfaceName {
	EPhysicalSurface Type; // 0x0
	FName Name; // 0x4
};

struct FEventGameNarrationClientNotificationMessage {
	ENotificationType NotificationType; // 0x0
	FString Sender; // 0x8
	FString Text; // 0x18
};

struct FCustomAnimationMontageStateMachine {
	UCustomAnimationMontageDefinitionDataAsset* ActiveState; // 0x0
	UCustomAnimationMontageDefinitionDataAsset* PendingState; // 0x8
	UAnimMontage* ActiveMontage; // 0x10
};

struct FIslandDioramas {
	TArray<TScriptInterface<Class>> Entries; // 0x0
};

struct FInvalidFireRequestDetected {
	UObject* RequestingObject; // 0x0
};

struct FEventAIFormSelected {
	UAthenaAIFormDataAsset* Form; // 0x0
};

struct FMatineeActorSetPositionNetworkEvent : FNetworkEventStruct {
	AMatineeActor* MatineeActor; // 0x10
	float InterpolationPosition; // 0x18
	bool Jump; // 0x1c
};

struct FEventShipTopDeckBlocked {
	FGuid BlockerId; // 0x0
};

struct FAISpawnActionStateParams {
	float SpawnTimeMax; // 0x0
	bool BeginInvis; // 0x4
	float InvisTime; // 0x8
	bool SkipAnimTimeCheck; // 0xc
};

struct FVaultPuzzleSolutionPositions {
	TArray<int32_t> SolutionPositions; // 0x0
};

struct FWheelPartsScales {
	FVector FractureWestScale; // 0x0
	FVector FractureEastScale; // 0xc
	FVector FractureSouthScale; // 0x18
	FVector PlankWestScale; // 0x24
	FVector PlankEastScale; // 0x30
	FVector PlankSouthScale; // 0x3c
};

struct FShipPartDamagePersistenceModel : FPersistenceModel {
	TArray<ERepairableState> ComponentRepairableStates; // 0x0
	FString Id; // 0x10
};

struct FPlayerBuriedItemsMapBundlePickedUpTelemetryEvent {
	FGuid MapBundleId; // 0x0
	FGuid OwningCrewID; // 0x10
	FGuid PickedUpByPlayerId; // 0x20
	FGuid PickedUpByCrewId; // 0x30
	FGuid OwningCrewSessionId; // 0x40
	FGuid PickedUpByCrewSessionId; // 0x50
	TArray<FGuid> PlayerBuriedItemMapIds; // 0x60
	TArray<FGuid> MapIdsOriginalOwners; // 0x70
};

struct FQuestVariableTexture : FQuestVariable {
	FName ParamName; // 0x8
};

struct FPrioritisedPromptHandle {
	FGuid Id; // 0x0
};

struct FExposedValueHandler {
	FName BoundFunction; // 0x0
	TArray<FExposedValueCopyRecord> CopyRecords; // 0x8
};

struct FCompositeSection : FAnimLinkableElement {
	FName SectionName; // 0x30
	float StartTime; // 0x38
	FName NextSectionName; // 0x3c
	TArray<UAnimMetaData*> MetaData; // 0x48
};

struct FSceneDialogueStartNetworkEvent : FSceneDialogueBaseNetworkEvent {
	UScriptStruct* Type; // 0x8
};

struct FPlayerActionCannonTelemetryEvent {
	FString ProjectileId; // 0x0
	FGuid AttackId; // 0x10
};

struct FQuestVariableMerchantItemArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FEventPlayerTeleportComplete {
	AAthenaPlayerState* PlayerState; // 0x0
};

struct FMermaidServiceMermaidSpawnParams {
	float MinDistFromSpawnOrigin; // 0x0
	float MinDistFromSpawnOriginForDestroyedShip; // 0x4
	float MaxDistFromSpawnOriginBeforeGivingUp; // 0x8
	float DistIncrementPerFailedSpawnCircle; // 0xc
	int32_t NumSamplesInSpawnCircle; // 0x10
	float SpawnCastStartZ; // 0x14
	float MinSpawnDepth; // 0x18
	float SpawnHalfConeAngleRestrictIfSpawningForPlayer; // 0x1c
	ECollisionChannel HitTestTraceChannel; // 0x20
	float AssumedMermaidRadius; // 0x24
	float MinDistanceOfFinalSpawnPosToAnyActiveMermaid; // 0x28
	float MinDistanceOfFinalSpawnPosToAnyActiveMermaidWhenNearEnemyShip; // 0x2c
	float MinDistFromEdgeOfWorld; // 0x30
	float MinAngularStepSize; // 0x34
	float MaxAngularStepSize; // 0x38
	float MinDistanceIncrementPerFail; // 0x3c
	float MaxDistanceIncrementPerFail; // 0x40
	float AdditionalDistanceFromOriginMultiplierPerMeter; // 0x44
};

struct FFireGridCellSelectionParams {
	AActor* ActorClassFilter; // 0x0
	float ChanceToAffectTheActor; // 0x8
	FFireGridCellSelection FireGridCellSelectionParams; // 0xc
};

struct FExpressionOutput {
	FString OutputName; // 0x0
	int32_t Mask; // 0x10
	int32_t MaskR; // 0x14
	int32_t MaskG; // 0x18
	int32_t MaskB; // 0x1c
	int32_t MaskA; // 0x20
};

struct FClientRequestAsyncLoadingCompleteAckNetworkEvent : FNetworkEventStruct {
	int32_t StreamOutLevelId; // 0x10
	int32_t StreamInLevelId; // 0x14
};

struct FClientPirateDeleteTelemetryEvent {
	FString PirateId; // 0x0
};

struct FPlaySoundRpc : FBoxedRpc {
	UWwiseEvent* WwiseEvent; // 0x10
	bool PlayOnTarget; // 0x18
};

struct FBlueprintLiveStreamInfo {
	FString GameName; // 0x0
	FString StreamName; // 0x10
	FString URL; // 0x20
};

struct FServerCrewModel {
	FGuid CrewId; // 0x0
	FUniqueNetIdRepl UserId; // 0x10
	FGuid ServerId; // 0x28
	int32_t SessionType; // 0x38
	TArray<FVector2D> Positions; // 0x40
	TArray<uint32_t> Resources; // 0x50
};

struct FEventRepairableObjectRepairEndedEvent {
	UObject* Repairable; // 0x0
	FVector Position; // 0x8
	AActor* RepairerActor; // 0x18
	float RepairPercentage; // 0x20
};

struct FCachedMovieSceneEvaluationTemplate : FMovieSceneEvaluationTemplate {
	TMap<uint32_t, FMovieSceneEvaluationTrack> Tracks; // 0x0
	FMovieSceneEvaluationField EvaluationField; // 0xa0
	FMovieSceneSequenceHierarchy Hierarchy; // 0xd0
	FMovieSceneGenerationLedger Ledger; // 0x170
	char bHasLegacyTrackInstances : 1; // 0x218
	char bKeepStaleTracks : 1; // 0x218
};

struct FCreateBoxTriggerData {
	FVector Location; // 0x0
	FVector Extent; // 0xc
};

struct FItemInfoHealthMetaWrapper : FItemMetaBase {
	float CurrentHealth; // 0x18
	float MaxHealth; // 0x1c
};

struct FOpenForListEntry {
	APawn* Pawn; // 0x0
	float TimeUntilDoorFullyOpen; // 0x8
};

struct FAthenaAnimationFirstPersonTurnDelay {
	float MaxAngle; // 0x0
	float DelayOutSpeed; // 0x4
	float DelayInSpeed; // 0x8
};

struct FStartGameNarrative {
	FString TexturePath; // 0x0
	FString Text; // 0x10
	float EnterDurationSeconds; // 0x20
	float HoldDurationSeconds; // 0x24
	float ExitDurationSeconds; // 0x28
	EStartGameNarrativePositionX AlignX; // 0x2c
	EStartGameNarrativePositionY AlignY; // 0x2d
	EStartGameNarrativeMediaSize Size; // 0x2e
};

struct FContestMatchmakingClientRequestModel {
	TArray<FString> PlayModeTags; // 0x0
	TArray<FString> PlayModeStates; // 0x10
	TMap<FString, FString> OptionalPlayModeInfo; // 0x20
	TArray<FContestMatchmakingCrewModel> Crews; // 0x70
	FString ServerLocation; // 0x80
	uint32_t FeatureHash; // 0x90
	FString PrivateServerId; // 0x98
	FGuid RequestCorrelationId; // 0xa8
};

struct FNPCInitialSpawnedCosmeticItems {
	AActor* CosmeticItemObject; // 0x0
	FName AttachSocketName; // 0x8
};

struct FScrollBarStyle : FSlateWidgetStyle {
	FSlateBrush HorizontalBackgroundImage; // 0x8
	FSlateBrush VerticalBackgroundImage; // 0x98
	FSlateBrush VerticalTopSlotImage; // 0x128
	FSlateBrush HorizontalTopSlotImage; // 0x1b8
	FSlateBrush VerticalBottomSlotImage; // 0x248
	FSlateBrush HorizontalBottomSlotImage; // 0x2d8
	FSlateBrush NormalThumbImage; // 0x368
	FSlateBrush HoveredThumbImage; // 0x3f8
	FSlateBrush DraggedThumbImage; // 0x488
};

struct FNPCReactionDualActorVOEntry {
	UClass* Actor1ToReactTo; // 0x0
	UClass* Actor2ToReactTo; // 0x20
	FName VOGroupName; // 0x40
	FWeightedProbabilityRangeOfRanges VOCooldown; // 0x48
};

struct FTinySharkDespawnTelemetryEvent {
	FString TinySharkId; // 0x0
	ETinySharkDespawnReason TinySharkDespawnReason; // 0x10
};

struct FContestMatchmakingLocationsResponseModel {
	TArray<FString> Locations; // 0x0
	int32_t MaxHops; // 0x10
};

struct FHitReactionAnimationState {
	float Yaw; // 0x0
	float AdditiveBlend; // 0x4
	ECharacterHitReactionAnimType ReactType; // 0x8
	bool ActivateNewHitReact; // 0x9
};

struct FPlayerMysteriousNoteItem {
	FGuid OriginalNoteID; // 0x0
	FString LocalisedTitle; // 0x10
	FString LocalisedBody; // 0x20
	FString NoteType; // 0x30
};

struct FHDRTelemetryFragment {
	bool HDR; // 0x0
};

struct FGameplayEffectAttributeCaptureSpecContainer {
	TArray<FGameplayEffectAttributeCaptureSpec> SourceAttributes; // 0x0
	TArray<FGameplayEffectAttributeCaptureSpec> TargetAttributes; // 0x10
	bool bHasNonSnapshottedAttributes; // 0x20
};

struct FAthenaCharacterSwimSpeed {
	float SprintSpdAmp; // 0x0
	float SprintAccelAmp; // 0x4
	float TurnSpeedScalar; // 0x8
};

struct FAnimNode_ConvertLocalToComponentSpace : FAnimNode_Base {
	FPoseLink LocalPose; // 0x30
};

struct FSeasonProgressionUITelemetryFragment {
	TArray<FSeasonProgressionUIEventTypeTelemetryFragment> ReceivedEventsData; // 0x0
	int32_t TotalNumReceivedEvents; // 0x10
};

struct FFormatTextArgument {
	FText ArgumentName; // 0x0
	FText TextValue; // 0x38
};

struct FExposedValueCopyRecord {
	UProperty* SourceProperty; // 0x0
	FName SourcePropertyName; // 0x8
	TArray<FName> SourceSubPropertyNames; // 0x10
	int32_t SourceArrayIndex; // 0x20
	UProperty* DestProperty; // 0x28
	int32_t DestArrayIndex; // 0x30
	int32_t Size; // 0x34
	EPostCopyOperation PostCopyOperation; // 0x38
	UBoolProperty* CachedBoolSourceProperty; // 0x40
	UBoolProperty* CachedBoolDestProperty; // 0x48
};

struct FAnimNode_HIKFloorContact : FAnimNode_HIKBase {
	bool FeetContact; // 0x48
	bool HandsContact; // 0x49
	bool FingersContact; // 0x4a
	bool ToesContact; // 0x4b
	EHIKFeetContactType FeetContactType; // 0x4c
	EHIKHandsContactType HandsContactType; // 0x4d
	float DistanceUp; // 0x50
	float DistanceDown; // 0x54
	int32_t NbRays; // 0x58
	float FootRadius; // 0x5c
	float DeltaTime; // 0x60
	float Smoothing; // 0x64
	FCollisionResponseContainer OverrideRaycastCollisionResponse; // 0x68
	float FeetHeight; // 0x88
	float FeetBack; // 0x8c
	float FeetMiddle; // 0x90
	float FeetFront; // 0x94
	float FeetInSide; // 0x98
	float FeetOutSide; // 0x9c
	float HandsHeight; // 0xa0
	float HandsBack; // 0xa4
	float HandsMiddle; // 0xa8
	float HandsFront; // 0xac
	float HandsInSide; // 0xb0
	float HandsOutSide; // 0xb4
};

struct FAIDebugVisualisationLine {
	FVector From; // 0x0
	FVector To; // 0xc
	float LifeTime; // 0x18
	EAIDebugColour Colour; // 0x1c
};

struct FMarkerVariantDesc {
	UWorldMarkerVariant* Variant; // 0x0
	UBaseWorldMarker* MarkerType; // 0x8
	bool UseActorMarker; // 0x10
	FStringAssetReference MarkerVfx; // 0x18
	FStringClassReference MarkerClass; // 0x28
};

struct FWidgetNavigationData {
	EUINavigationRule Rule; // 0x0
	FName WidgetToFocus; // 0x4
};

struct FLevelLoadRequestedTelemetryEvent : FStreamingTelemetryBaseEvent {
	FString LevelName; // 0x0
	int32_t LodLevel; // 0x10
	FVector PlayerPosition; // 0x14
	float DistanceFromPlayer; // 0x20
	float DistanceFromBoundsToPlayer; // 0x24
	bool PlayerIsWaitingToSpawn; // 0x28
	bool PlayerIsTeleporting; // 0x29
};

struct FLeaderboardScoreUpdateMessage {
	FPirateIdentity PirateIdentity; // 0x0
	FName EmissaryAffiliation; // 0x78
	int64_t Before; // 0x80
	int64_t After; // 0x88
};

struct FInteriorSettings {
	char bIsWorldSettings : 1; // 0x0
	float ExteriorVolume; // 0x4
	float ExteriorTime; // 0x8
	float ExteriorLPF; // 0xc
	float ExteriorLPFTime; // 0x10
	float InteriorVolume; // 0x14
	float InteriorTime; // 0x18
	float InteriorLPF; // 0x1c
	float InteriorLPFTime; // 0x20
};

struct FEventCharacterFootExitWater {
	FCharacterFootWaterImpactResult Result; // 0x0
};

struct FCampaignGoalModel {
	FGuid Id; // 0x0
	FDateTime ActiveFrom; // 0x10
	FDateTime ActiveUntil; // 0x18
	TMap<FString, FString> Meta; // 0x20
};

struct FEventUseItemStopped {
	UNotificationInputId* InputID; // 0x0
	AActor* ActionSource; // 0x8
	AActor* Usable; // 0x10
	EActionStateMachineTrackId TrackToUse; // 0x18
};

struct FPacketDiscardStats {
	int32_t DiscardCounts[0x7]; // 0x0
	int32_t BytesDiscarded; // 0x1c
};

struct FEventPlayerStatePawnPossessed {
	APlayerState* PlayerState; // 0x0
	APawn* PossessedPawn; // 0x8
	bool IsLocalPlayer; // 0x10
};

struct FDrawDebugItemString {
	FName GroupName; // 0x0
	bool ReplaceInGroup; // 0x8
	FString String; // 0x10
	FColor Colour; // 0x20
	FVector StringPos; // 0x24
};

struct FMakeFriendsEmoteParams {
	TArray<FName> TriggerEmoteNames; // 0x0
	float TriggerDistanceThreshold; // 0x10
};

struct FUndoRepairActionStateConstructionInfo : FActorActionStateConstructionInfo {
	FNetSubObjectPtr RepairableObject; // 0x30
	UNotificationInputId* InputID; // 0x48
};

struct FTrackCommodityPurchaseOnServerRpc : FBoxedRpc {
	UObject* CommodityDemandStorageObject; // 0x10
	FName NPCName; // 0x18
	FGuid ItemOfferId; // 0x20
	FString ItemClientId; // 0x30
};

struct FRopeVisualParams {
	float Thickness; // 0x0
	float UVScale; // 0x4
	float Roughness; // 0x8
};

struct FEventTakenControlOfObject {
	TScriptInterface<Class> ControlledObject; // 0x0
	EControllableObjectType ControllableType; // 0x10
};

struct FCookStartCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
	FString FoodType; // 0x28
};

struct FGameplayEffectExecutionScopedModifierInfo {
	FGameplayEffectAttributeCaptureDefinition CapturedAttribute; // 0x0
	EGameplayModOp ModifierOp; // 0x10
	FGameplayEffectModifierMagnitude ModifierMagnitude; // 0x18
	FGameplayTagRequirements SourceTags; // 0x188
	FGameplayTagRequirements TargetTags; // 0x1d8
};

struct FMechanismCheckpoint {
	FMechanismTransformAnimationCurve AnimationCurve; // 0x0
	float StartDelay; // 0x8
	ETimedDoorCheckpointState ClosingState; // 0xc
};

struct FFishingMiniGamePlayerInput {
	EFishingMiniGamePlayerInputDirection InputDirection; // 0x0
	char BattlingDirection; // 0x1
	bool IsReeling; // 0x2
};

struct FGhostShipCoordinator {
	TArray<FGhostPawnEntry> GhostPawns; // 0x0
	UObject* Parent; // 0x10
	AGhostShipPlayerSpawnLocation* SpawnLocation; // 0x20
	AGhostShipDoor* GhostShipDoor; // 0x28
};

struct FIslandItemSpawnLocationData {
	FVector SpawnLocation; // 0x0
	FVector SpawnLocationNormal; // 0xc
};

struct FEmergentVoyageSourceIconInfo {
	EQuestMapIcon IconType; // 0x0
	EEmergentVoyageSource VoyageSource; // 0x1
};

struct FAthenaAIControllerWeightedRangesParamValue {
	FName ParamName; // 0x0
	FWeightedProbabilityRangeOfRanges Value; // 0x8
};

struct FEventMastSailsBillowed {
	EMastType MastType; // 0x0
	AActor* ParentShip; // 0x8
};

struct FContestNotificationNetworkEvent : FNetworkEventStruct {
	UPopUpMessageDesc* PopUpDesc; // 0x10
};

struct FEventEmblemUnlockedNotification {
	FName CompanyName; // 0x0
	FName FriendlyName; // 0x8
	FText EmblemName; // 0x10
	FString EmblemUrl; // 0x48
};

struct FFeatureLockedCampaignParams {
	FName Feature; // 0x0
	UCursedSailsCampaignDataAsset* CampaignDataAsset; // 0x8
};

struct FBattleElevatorEventRoomPhase {
	FName PhaseName; // 0x0
	bool IsFinalPhase; // 0x8
	FName NextPhaseName; // 0xc
	TArray<UBattleElevatorEventRoomBasePolicy*> Policies; // 0x18
	TArray<UElevatorActionBase*> Actions; // 0x28
};

struct FAmmoEffectState {
	FEventAmmoChanged LastAmmoEvent; // 0x0
	bool ShouldSkipUpdates; // 0x4
};

struct FSinkShipData {
	int32_t ShipNetGUID; // 0x0
};

struct FStructSerializerObjectTestStruct {
	UObject* Class; // 0x0
	UObject* ObjectPtr; // 0x8
};

struct FPetRelationship {
	APetItemInfo* PetInfo; // 0x0
};

struct FCustomPlayerNoteList {
	TArray<FNotesRemoteServiceNoteDetailModel> Notes; // 0x0
};

struct FGameplayAbilityTargetData_SingleTargetHit : FGameplayAbilityTargetData {
	FHitResult HitResult; // 0x8
};

struct FHitRegProjectileSnapshotData {
	FHitRegProjectileAttackData AttackerClientData; // 0x0
	FHitRegProjectileAttackData ServerData; // 0x70
};

struct FTriangleSortSettings {
	ETriangleSortOption TriangleSorting; // 0x0
	ETriangleSortAxis CustomLeftRightAxis; // 0x1
	FName CustomLeftRightBoneName; // 0x4
};

struct FFireworkDebugListByFireworkType {
	TArray<UItemDescSpawnData*> Rockets; // 0x0
	TArray<UItemDescSpawnData*> Cakes; // 0x10
};

struct FUpdatedEntitlementsAvailableEvent {
	FPirateIdentity PirateIdentity; // 0x0
};

struct FQuestVariableAsset : FQuestVariable {
	FName ParamName; // 0x8
};

struct FBlockDecalMaterials {
	TArray<UMaterialInterface*> BlockMaterials; // 0x0
};

struct FEventFaunaAnimationAgitated {
	bool Agitated; // 0x0
};

struct FAthenaAnimationActiveItemComplexAnimData {
	UAnimSequence* WarmUp; // 0x0
	UAnimSequence* HeavyWarmUp; // 0x8
	UAnimSequence* Action; // 0x10
	UAnimSequence* Recover; // 0x18
	UAnimSequence* HeavyAttackStunRecover; // 0x20
	EWieldableItemComplexOneShotAnimType AnimType; // 0x28
	float WarmUpPlaySpeed; // 0x2c
	char IsHeavyAttackActive : 1; // 0x30
};

struct FWalkConditionsParams {
	float WalkSpeedMultiplier; // 0x0
	float WalkStopThreshold; // 0x4
};

struct FEmissaryActionRewardData {
	TArray<FEmissaryEventAward> OwnershipChangedRewards; // 0x0
	TArray<FEmissaryEventAward> PlacedOnShipRewards; // 0x10
	FEmissaryKillPlayerReward KillPlayerReward; // 0x20
	TArray<FEmissaryGameEventsReward> GameEventsRewards; // 0x48
	TArray<FEmissaryEventAward> HandinRewards; // 0x58
	TArray<FEmissaryCompanyActionReward> CompanyActionRewards; // 0x68
};

struct FBTCompositeChild {
	UBTCompositeNode* ChildComposite; // 0x0
	UBTTaskNode* ChildTask; // 0x8
	TArray<UBTDecorator*> Decorators; // 0x10
	TArray<FBTDecoratorLogic> DecoratorOps; // 0x20
};

struct FEmissaryProgressUpdatedNetworkEvent : FNetworkEventStruct {
	float OldRepTotal; // 0x10
	float NewRepTotal; // 0x14
	FName CompanyId; // 0x18
};

struct FCloudTileParameters {
	TArray<FCloudTypeDefinition> Meshes; // 0x0
	int32_t Samples; // 0x10
	int32_t Seed; // 0x14
	float MeshScaleMultiplier; // 0x18
	bool ShouldCloudTileBeGenerated; // 0x1c
};

struct FEventCapstanDamageLevelChanged {
	AActor* Capstan; // 0x0
	int32_t DamageLevel; // 0x8
};

struct FContestShipSinkNetworkEvent : FNetworkEventStruct {
	FGuid CrewLiveryId; // 0x10
};

struct FBehaviorTreeTemplateInfo {
	UBehaviorTree* Asset; // 0x0
	UBTCompositeNode* Template; // 0x8
};

struct FNotifyFrontendOfCurrentPirateStatus {
	bool Locked; // 0x0
};

struct FVoyageProposalsUpdatedEvent {
	TArray<FVoyageProposalDescViewModel> Entitlements; // 0x0
};

struct FSeasonProgressionUITelemetryFragmentInput : FTelemetryFragmentInput {
	TWeakObjectPtr<APlayerController> PlayerController; // 0x0
};

struct FEventDisableInteractionPoints {
	EShipCurseTag ShipCurseTag; // 0x0
	ECurseTag CurseTag; // 0x1
	TArray<AInteractableBase*> InteractionPointsToDisable; // 0x8
	float DurationToDisableFor; // 0x18
};

struct FShipPartsCataloguePartCustomisation {
	FString FriendlyName; // 0x0
	TArray<FPartCustomisation> Customisation; // 0x10
};

struct FAISpawnTypeParamsCollection {
	TArray<FWeightedAISpawnTypeParams> SpawnParams; // 0x8
};

struct FItemProxyImpactVfxParams {
	EPhysicalSurface SurfaceType; // 0x0
	UObject* Particles; // 0x8
};

struct FGeyserSpawnAngleOption {
	float Weight; // 0x0
	float Direction; // 0x4
	float Range; // 0x8
};

struct FCrewLeftAllianceTelemetryEvent {
	FGuid AllianceId; // 0x0
	FGuid LeavingCrewSessionId; // 0x10
};

struct FActorComponentSelector {
	FName ComponentName; // 0x0
	UActorComponent* CachedComponent; // 0x8
};

struct FPlayerDoesNotRequireMermaidTelemetryEvent {
	EPlayerAbandonedReason Reason; // 0x0
};

struct FClientNoteData {
	bool NotifyArrival; // 0x0
	TArray<FMysteriousNoteInfo> PendingNotes; // 0x8
};

struct FRequestPremiumShopOffersEvent {
	FString CatalogName; // 0x0
};

struct FTreasureSpawnedCustomServerEvent : FGlobalCustomServerEvent {
	FName EventID; // 0x8
	FDateTime ServerTimeUTC; // 0x10
};

struct FAthenaAnimationKeyedInstrumentAnimData {
	UAnimSequence* Into; // 0x0
	UAnimSequence* Action; // 0x8
	UAnimSequence* Outof; // 0x10
};

struct FXMarksTheSpotQuestDesc : FQuestDesc {
	TArray<FTreasureData> Treasure; // 0x28
	UTexture* MapTexture; // 0x38
	UTexture* MapInventoryTexture; // 0x58
	float RotationFromNorth; // 0x78
	FGuid MapGroupGuid; // 0x7c
	TArray<UAIBoobyTrapSpawner*> BoobyTrapSpawners; // 0x90
	UTreasureMapItemDesc* OverrideTreasureMapItemDesc; // 0xa0
};

struct FKrakenTentacleDestroyedTelemetryEvent {
	FString KrakenId; // 0x0
};

struct FContestResultMessage {
	FGuid SessionId; // 0x0
	FString ContestType; // 0x10
	FString ShipType; // 0x20
	TArray<FContestCrewResultModel> CrewResults; // 0x30
	FDateTime TimestampUtc; // 0x40
};

struct FWaterSplashProbesContainer {
	TArray<FWaterSplashProbe> Probes; // 0x0
	float ProbeSamplingTime; // 0x10
};

struct FAttenuationSettings {
	char bAttenuate : 1; // 0x0
	char bSpatialize : 1; // 0x0
	char bAttenuateWithLPF : 1; // 0x0
	ESoundDistanceModel DistanceAlgorithm; // 0x4
	FRuntimeFloatCurve CustomAttenuationCurve; // 0x8
	ESoundDistanceCalc DistanceType; // 0x88
	EAttenuationShape AttenuationShape; // 0x89
	float dBAttenuationAtMax; // 0x8c
	float OmniRadius; // 0x90
	ESoundSpatializationAlgorithm SpatializationAlgorithm; // 0x94
	float RadiusMin; // 0x98
	float RadiusMax; // 0x9c
	FVector AttenuationShapeExtents; // 0xa0
	float ConeOffset; // 0xac
	float FalloffDistance; // 0xb0
	float LPFRadiusMin; // 0xb4
	float LPFRadiusMax; // 0xb8
};

struct FAIShipSingleWaveEncounterDescGenerationParams {
	TArray<FAIShipClassWeightedSizes> ShipClassWeightedSizes; // 0x0
};

struct FRawDistributionVector : FRawDistribution {
	float MinValue; // 0x28
	float MaxValue; // 0x2c
	UDistributionVector* Distribution; // 0x30
};

struct FNoteDeletedEvent {
	FPirateIdentity PirateIdentity; // 0x0
	FGuid NoteId; // 0x78
};

struct FAthenaAICharacterControllerSpawnItemDescForItemCategory {
	UItemCategory* ItemCategory; // 0x0
	UItemDesc* ItemDesc; // 0x8
};

struct FPlayerTextChatMessage {
	FUniqueNetIdRepl SenderNetId; // 0x0
	FString GamerTag; // 0x18
	FString Text; // 0x28
	ENotificationType NotificationType; // 0x38
	FNotificationStickiness Stickiness; // 0x3c
};

struct FBellPlayerStats {
	TArray<FPlayerStat> StatsToFireUponBellRing; // 0x0
};

struct FAthenaAnimationDeath {
	FAthenaAnimationDeathData DeathData; // 0x8
	FAthenaAnimationDeathAnimData DeathAnimData; // 0x38
	UAthenaAnimationDeathDataAsset* DeathDataAsset; // 0x78
};

struct FCustomServerEvent {
	FName EventID; // 0x8
	FDateTime ServerTimeUTC; // 0x10
};

struct FKrakenTentaclesChanceParams {
	int32_t NumberOfTentaclesSpawned; // 0x0
	FWeightedProbabilityRange ProbabilityRange; // 0x8
};

struct FWeightedProjectileMeshAnimationData {
	FRuntimeVectorCurve AnimationCurve; // 0x0
	float Weight; // 0x170
};

struct FEntitlementsUpdatedMessage {
	FPirateIdentity Identity; // 0x0
};

struct FEmblemDefinitionActiveDuration {
	bool HasActiveDuration; // 0x0
	FDateTime ActiveFrom; // 0x8
	FDateTime ActiveUntil; // 0x10
};

struct FSwallowedByKrakenActionStateParams {
	float FadeToBlackDuration; // 0x0
	float DeathDelayTime; // 0x4
};

struct FSittingActionStateConstructionInfo : FControlObjectActionStateConstructionInfo {
	FSittingActionStateParams SittingActionStateParams; // 0x48
};

struct FItemRequirementData {
	int32_t RequiredNumberToMatch; // 0x0
	TArray<UItemDesc*> RequiredItemsInLoadout; // 0x8
};

struct FDialogueContextMapping {
	FDialogueContext Context; // 0x0
	USoundWave* SoundWave; // 0x18
	UDialogueSoundWaveProxy* Proxy; // 0x20
};

struct FDetailAppearenceDesc {
	FStringAssetReference Mesh; // 0x0
	TArray<FDetailAppearenceMaterialDesc> Materials; // 0x10
	FStringAssetReference CustomDepthMaterial; // 0x20
};

struct FMovieSceneSlomoSectionTemplate : FMovieSceneEvalTemplate {
	FRichCurve SlomoCurve; // 0x18
};

struct FAggressiveGhostShipAnchorDropTelemetryEvent {
	FGuid ShipId; // 0x0
};

struct FPetReactedToFoodTelemetryEvent {
	FGuid FeedingInteractionId; // 0x0
	EPetFeedingReactionType FeedingReaction; // 0x10
};

struct FMinMaxAbilityRange {
	float MinDistanceToTarget; // 0x0
	float MaxDistanceToTarget; // 0x4
};

struct FWwiseNetworkRelationship {
	FName SwitchGroupName; // 0x0
	FName RemotePlayerSwitchValue; // 0x8
	FName LocalPlayerSwitchValue; // 0x10
};

struct FAddWorldEventData {
	FString EventType; // 0x0
	TMap<FString, FString> Parameters; // 0x10
};

struct FVoyageDisplayInformation {
	FText Title; // 0x0
	FText Description; // 0x38
	FString KeyArtUrl; // 0x70
	FString IconUrl; // 0x80
	int32_t RumouredHaulMin; // 0x90
	bool Locked; // 0x94
};

struct FProgressPoint {
	float Progress; // 0x0
	FString Image; // 0x8
};

struct FShroudBreakerSoftTearDownEvent {
	FGuid ShroudBreakerId; // 0x0
};

struct FMatrix {
	FPlane XPlane; // 0x0
	FPlane YPlane; // 0x10
	FPlane ZPlane; // 0x20
	FPlane WPlane; // 0x30
};

struct FTestTelemetryFragmentWithInt {
	uint32_t ExampleFragmentProperty; // 0x0
};

struct FAthenaAnimationWeapon {
	FAthenaAnimationActiveItemComplexAnimData AnimData; // 0x18
	bool Attacking; // 0x50
	bool NewAttack; // 0x51
	FAthenaAnimationWeaponData WeaponData; // 0x58
};

struct FBootFlowStateQueryResponseEvent {
	FString StateName; // 0x0
};

struct FTaleQuestStateTelemetryEvent {
	FString TaleState; // 0x0
};

struct FEventCosmeticItemSpawnedOwnerNotification {
	AActor* CosmeticItemActor; // 0x0
};

struct FPlayerHeartbeatCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FPlayerActionCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
	FString Action; // 0x28
};

struct FBPVariableDescription {
	FName VarName; // 0x0
	FGuid VarGuid; // 0x8
	FEdGraphPinType VarType; // 0x18
	FString FriendlyName; // 0x68
	FText Category; // 0x78
	uint64_t PropertyFlags; // 0xb0
	FName RepNotifyFunc; // 0xb8
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xc0
	FString DefaultValue; // 0xd0
};

struct FTriMeshCollisionData {
	TArray<FVector> Vertices; // 0x0
	TArray<FTriIndices> Indices; // 0x10
	char bFlipNormals : 1; // 0x20
};

struct FAIDioramaPawn {
	APawn* Pawn; // 0x0
};

struct FPlayerNonVerbalComponentTelemetry {
	AAthenaPlayerController* PlayerController; // 0x0
};

struct FEventPlayerPinnedMapTable {
	FVector2D PinWorldLocation; // 0x0
};

struct FControlPulleyActionStateConstructionInfo : FControlObjectActionStateConstructionInfo {
	EControllableObjectType ControllableType; // 0x48
	UAnalogInputId* AnalogInputId; // 0x50
	FControlPulleyActionStateParams ActionStateParamsOverride; // 0x58
	bool UseActionStateParamsOverride; // 0x8c
};

struct FCatalogTab {
	FString CatalogName; // 0x0
	FString CatalogDisplayName; // 0x10
	FString CatalogTabImageUrl; // 0x20
};

struct FMapTablePersistenceModel : FPersistenceModel {
	TArray<FVector2D> MapPins; // 0x0
};

struct FMermaidActivatedLocally {
	AMermaid* Mermaid; // 0x0
	bool IsForLocalPlayer; // 0x8
};

struct FCinematicEmissaryEvent {
	int32_t Level; // 0x0
	FName Tag; // 0x4
};

struct FEventOceanCrawlerAIBuffAudioRequest {
	bool IsBuffGiver; // 0x0
};

struct FOtherCrewMuteStateResponse {
	EMuteState MuteState; // 0x0
};

struct FUpdateSnapshotVersionData {
	FName Version; // 0x0
};

struct FLandscapeSplineInterpPoint {
	FVector Center; // 0x0
	FVector Left; // 0xc
	FVector Right; // 0x18
	FVector FalloffLeft; // 0x24
	FVector FalloffRight; // 0x30
	float StartEndFalloff; // 0x3c
};

struct FLayerBlendInput {
	FName LayerName; // 0x0
	ELandscapeLayerBlendType BlendType; // 0x8
	FExpressionInput LayerInput; // 0x10
	FExpressionInput HeightInput; // 0x48
	float PreviewWeight; // 0x80
	FVector ConstLayerInput; // 0x84
	float ConstHeightInput; // 0x90
};

struct FEmissaryLevelMultiplierModel {
	int32_t Level; // 0x0
	float Multiplier; // 0x4
};

struct FNPCBeckonGroupEntry {
	FString NPCGroup; // 0x0
	TArray<FNPCBeckonGestureEntry> NPCBeckonGestures; // 0x10
};

struct FActiveNPCDemands {
	TArray<uint32_t> NPCIdHashes; // 0x0
	TArray<FActiveCommodityDemands> NPCDemands; // 0x10
};

struct FScalableFloat {
	float Value; // 0x0
	FCurveTableRowHandle Curve; // 0x8
};

struct FWaterSlideActionStateConstructionInfo : FActorActionStateConstructionInfo {
	USceneComponent* SceneComponent; // 0x30
};

struct FAthenaCharacterDodgeParams {
	float DodgeCooldown; // 0x0
	float DodgeForce; // 0x4
	float GroundLaunchAngle; // 0x8
	bool DodgePerpendicularToGround; // 0xc
	bool Disabled; // 0xd
};

struct FVaultStateData : FActorStateData {
	bool IsActive; // 0x20
	float RewardPlinthSpawnX; // 0x24
	float RewardPlinthSpawnY; // 0x28
	float RewardPlinthSpawnZ; // 0x2c
};

struct FRawAnimSequenceTrack {
	TArray<FVector> PosKeys; // 0x0
	TArray<FQuat> RotKeys; // 0x10
	TArray<FVector> ScaleKeys; // 0x20
};

struct FOptionalPlayModeModel {
	TMap<FString, FString> OptionalPlayModeMap; // 0x0
};

struct FRequestEmblemProgressMessage {
	FPirateIdentity PirateIdentity; // 0x0
};

struct FFaunaAnimationCurrentPlayingAnimations {
	UBlendSpace1D* LandLocomotionA; // 0x0
	UBlendSpace1D* LandLocomotionB; // 0x8
	UBlendSpace1D* SeaLocomotionA; // 0x10
	UBlendSpace1D* SeaLocomotionB; // 0x18
	UBlendSpace1D* UnderwaterLocomotionA; // 0x20
	UBlendSpace1D* UnderwaterLocomotionB; // 0x28
	UAnimSequence* LandIdleA; // 0x30
	UAnimSequence* LandIdleB; // 0x38
	UAnimSequence* SeaIdleA; // 0x40
	UAnimSequence* SeaIdleB; // 0x48
	UAnimSequence* UnderwaterIdleA; // 0x50
	UAnimSequence* UnderwaterIdleB; // 0x58
};

struct FVomitScreenFX {
	float EnterDuration; // 0x0
	float FullOnDuration; // 0x4
	float ExitDuration; // 0x8
	float DebugInterval; // 0xc
};

struct FHeldStateSpecificBlendWeight {
	EAthenaAnimationPetHeldState HeldState; // 0x0
	float BlendWeight; // 0x4
};

struct FServiceMessagingUnsubscribedEvent {
	FString RoutingKey; // 0x0
};

struct FUpdateEmissaryValueForCompany {
	FGuid SessionId; // 0x0
	FName Company; // 0x10
	FGuid AssociatedCrew; // 0x18
	EBootyRewardType RewardType; // 0x28
	int32_t UpdateAmount; // 0x2c
};

struct FForcePlayerRespawnData {
	int32_t PlayerNetGUID; // 0x0
	bool bRespawnAsGhost; // 0x4
};

struct FPlayerPromptTelemetryEvent {
	FString Message; // 0x0
	FString Key; // 0x10
};

struct FTextureRenderData {
	UTexture* RenderTexture; // 0x0
	FVector2D ScreenPosition; // 0x8
	FVector2D ScreenSize; // 0x10
	FVector2D CoordinatePosition; // 0x18
	FVector2D CoordinateSize; // 0x20
	FLinearColor RenderColor; // 0x28
	EBlendMode BlendMode; // 0x38
	float Rotation; // 0x3c
	FVector2D PivotPoint; // 0x40
};

struct FContestScoreTelemetryFragment {
	TArray<FCrewScore> CrewScores; // 0x0
};

struct FClothingChestEquipClothingEvent {
	UClothingDesc* Desc; // 0x0
};

struct FFrontendCrewDefinition {
	TArray<FFrontendCrewMember> CrewMembers; // 0x0
};

struct FOrientedPoint {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
};

struct FNavigationFilterFlags {
	char bNavFlag0 : 1; // 0x0
	char bNavFlag1 : 1; // 0x0
	char bNavFlag2 : 1; // 0x0
	char bNavFlag3 : 1; // 0x0
	char bNavFlag4 : 1; // 0x0
	char bNavFlag5 : 1; // 0x0
	char bNavFlag6 : 1; // 0x0
	char bNavFlag7 : 1; // 0x0
	char bNavFlag8 : 1; // 0x1
	char bNavFlag9 : 1; // 0x1
	char bNavFlag10 : 1; // 0x1
	char bNavFlag11 : 1; // 0x1
	char bNavFlag12 : 1; // 0x1
	char bNavFlag13 : 1; // 0x1
	char bNavFlag14 : 1; // 0x1
	char bNavFlag15 : 1; // 0x1
};

struct FSkeletalMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	bool bEnableShadowCasting; // 0x8
};

struct FMastSnapshot {
	float Length; // 0x0
	float Angle; // 0x4
	float Damage; // 0x8
};

struct FSwimmingCreatureImpactAnimData {
	UAnimSequenceBase* ImpactAnim; // 0x0
	float MinDamageRange; // 0x8
	float MaxDamageRange; // 0xc
};

struct FWeaponProjectileParams {
	float Damage; // 0x0
	float DamageMultiplierAtMaximumRange; // 0x4
	float LifeTime; // 0x8
	float TrailFadeOutTime; // 0xc
	float Velocity; // 0x10
	float TimeBeforeApplyingGravity; // 0x14
	float DownForceVelocityFractionPerSecond; // 0x18
	float VelocityDampeningPerSecond; // 0x1c
	FLinearColor Color; // 0x20
	UImpactProjectileId* ProjectileId; // 0x30
	EHealthChangedReason HealthChangeReason; // 0x38
	FWeaponProjectileEffectParams ProjectileEffects; // 0x3c
	int32_t SuggestedMaxSimulationIterations; // 0xa4
	float SuggestedMinTickTimeSecs; // 0xa8
	float SuggestedMaxSimulationTimeStep; // 0xac
};

struct FHealthRegenState {
	float CurrentPoolAmount; // 0x0
	ERegenerationState State; // 0x4
};

struct FNamedSlotBinding {
	FName Name; // 0x0
	UWidget* Content; // 0x8
};

struct FRegionAssetsList {
	ENetworkRegion Region; // 0x0
	TArray<FStringAssetReference> CachedAssetsForRegion; // 0x8
};

struct FInteractableLightParams {
	bool DebugDraw; // 0x0
	bool IsSpotlight; // 0x1
	FName LightTag; // 0x4
	FInteractableLightState OnParameters; // 0x10
	FInteractableLightState OffParameters; // 0x90
};

struct FCharacterFootWaterImpactResult {
	FCharacterSocketFootWaterImpactResult SocketFootImpactResult; // 0x0
	int32_t FootIndex; // 0x1c
};

struct FEventAttachedRetractableToItemProxy {
	AActor* Item; // 0x0
};

struct FWalkableSlopeOverride {
	EWalkableSlopeBehavior WalkableSlopeBehavior; // 0x0
	float WalkableSlopeAngle; // 0x4
};

struct FWorldMapRequestWorldResponse {
	FWorldMapWorldData WorldData; // 0x0
};

struct FTestLevelMetadataEntry {
	FString Property; // 0x0
	FString Value; // 0x10
};

struct FWorldLocationBannerEvent {
	FGenericPopupAudioDescriptor Audio; // 0x0
	FString IconPath; // 0x40
	FString Text; // 0x50
};

struct FAutoCompleteCommand {
	FString Command; // 0x0
	FString Desc; // 0x10
	FString Keywords; // 0x20
};

struct FAchievementRemoteServiceLogTelemetry {
	FString UserId; // 0x0
	FString PirateId; // 0x10
	TArray<FString> LogLines; // 0x20
};

struct FPlayerRevivalCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FSirenAnimationDataStructure {
	FSirenAnimationLocomotion LocomotionAnims; // 0x0
	UCustomAnimationMontageDefinitionListingDataAsset* FullBodyMontageListings; // 0x48
	UAthenaAnimationWeaponDataAsset* AttackAnimationAsset; // 0x50
	FHitReactionAnimationData HitReactAnimationData; // 0x58
};

struct FCompanySkin {
	FStringAssetReference BackgroundImage; // 0x0
	FStringAssetReference RibbonImage; // 0x10
	EProgressStyle Style; // 0x20
	FString RankIncreaseAudioCue; // 0x28
	FString RankIncreaseStopAudioCue; // 0x38
	FString RankLevelUpAudioCue; // 0x48
	FString RankTriggerAudioCue; // 0x58
	FString EmissaryRankIncreaseAudioCue; // 0x68
	FString EmissaryRankIncreaseStopAudioCue; // 0x78
	FString EmissaryRankLevelUpAudioCue; // 0x88
	FString EmissaryRankTriggerAudioCue; // 0x98
	FString EmissaryRankLevelUpMusicCue; // 0xa8
};

struct FIngestedByKrakenActionStateParams {
	float StowItemsProgressThreshold; // 0x0
};

struct FViewVoyageBanners {
	EShowVoyageBannersState ShowIntroBanners; // 0x0
	EShowVoyageBannersState ShowOutroBanners; // 0x1
};

struct FEventShipSetSail {
	AActor* Ship; // 0x0
};

struct FEventCompanyDataResponse {
	TArray<FUICompanyData> CompanyData; // 0x0
};

struct FPetTurnToFaceData {
	FQuat EndRotation; // 0x0
	float RotationTime; // 0x10
};

struct FTreasureMapTextDesc {
	FText Pattern; // 0x0
	TArray<FTreasureMapTextEntry> Substitutions; // 0x38
};

struct FMessageInABottleVoyageEntry {
	FName FeatureFlag; // 0x0
	UVoyageRecipeDataAsset* VoyageRecipe; // 0x8
};

struct FEventShipEnteredSafeZone {
	AActor* Ship; // 0x0
};

struct FCollectorsChestItemSlotDefinition {
	TArray<UClass*> TargetObjectTypes; // 0x0
	FTransform RelativeTransform; // 0x10
};

struct FCookEndTelemetryEvent {
	FString ItemName; // 0x0
	ECookingState CookState; // 0x10
	FVector Location; // 0x14
	FGuid CookId; // 0x20
};

struct FDigSurfaceTypeParams {
	EPhysicalSurface SurfaceType; // 0x0
	FDigEventFxParams EnterGroundFx; // 0x8
	FDigEventFxParams LeaveGroundFx; // 0x20
};

struct FEventPetLeftHangout {
	AActor* Pet; // 0x0
};

struct FTestMessageInt64 {
	int64_t TestInt; // 0x0
};

struct FChecklistMapItemData {
	FTreasureMapTextDesc Description; // 0x0
	UTexture* IconImage; // 0x48
};

struct FNPCOnSurfaceFloodedLevel {
	float NormalisedWaterLevel; // 0x0
	ENPCOnSurfaceFloodedLevel FloodedLevel; // 0x4
};

struct FCargoRunItemDropOffData {
	FGuid PickUpId; // 0x0
	FGuid DeliveryLocationId; // 0x10
	int64_t DeliveryDeadlineTicks; // 0x20
};

struct FCharacterMovementComponentPreClothTickFunction : FTickFunction {
	ETickingGroup TickGroup; // 0x30
	char bTickEvenWhenPaused : 1; // 0x32
	char bCanEverTick : 1; // 0x32
	char bStartWithTickEnabled : 1; // 0x32
	char bAllowTickOnDedicatedServer : 1; // 0x32
	float TickInterval; // 0x40
};

struct FParticleEventGPU_GenerateInfo {
	EParticleEventType Type; // 0x0
	int32_t Frequency; // 0x4
	FName CustomName; // 0x8
	EGPUParticleCollisionEventLimit CollisionEventLimit; // 0x10
	TArray<UParticleModuleEventSendToGame*> ParticleModuleEventsToSendToGame; // 0x18
};

struct FFaunaAnimationSnakeCharmStructure {
	UAnimSequence* CharmIn; // 0x0
	UAnimSequence* CharmLoop; // 0x8
	UAnimSequence* CharmOut; // 0x10
};

struct FAthenaAnimationDebugTrackingParams {
	bool TrackObjectActive; // 0x0
	bool TrackOverlayState; // 0x1
	bool TrackActiveAnimations; // 0x2
	bool TrackOverlayFlags; // 0x3
};

struct FPetFlyingStrategyProperties {
	UAIStrategyId* Strategy; // 0x0
	float ChanceOfFlying; // 0x8
	float MinFlyingMeshZOffset; // 0xc
	float MaxFlyingMeshZOffset; // 0x10
};

struct FEventSingleCompanyProgressUpdate {
	FUICompanyProgress Progress; // 0x0
};

struct FEventApplySingleStickSettings {
	EUseSingleStick UseSingleStick; // 0x0
};

struct FCompanyRankGradeData {
	URankDesc* Rank; // 0x0
	FStringAssetReference Ribbon; // 0x8
};

struct FCustomTriggerOverlap : FGameServerWebSocketEntityEvent {
	int32_t TriggerNetId; // 0x28
	int32_t OtherNetId; // 0x2c
};

struct FAthenaAnimationEmoteAnimations {
	FName EmoteName; // 0x0
	EEmoteSequenceType EmoteSequenceType; // 0x8
	UAnimSequence* OneShotSequence; // 0x10
	UAnimSequence* ContinuousIn; // 0x30
	TArray<UAnimSequence*> ContinuousCycle; // 0x50
	UAnimSequenceBase* EmotePreviewSequence; // 0x60
	UWieldableItemAnimationStoreId* UseWithObject; // 0x80
};

struct FEventPlayerCharacterInPuzzleVaultChanged {
	bool IsInPuzzleVault; // 0x0
	float CurrentWaterLevel; // 0x4
};

struct FAddStatusesData {
	int32_t ActorId; // 0x0
	TArray<FString> Statuses; // 0x8
};

struct FApplyDamageData {
	int32_t ActorId; // 0x0
	float Damage; // 0x4
	int32_t InstigatorId; // 0x8
	EHealthChangedReason Reason; // 0xc
};

struct FAggressiveGhostShipEncounterFormationLocationDesc {
	float ForwardOffsetInMetres; // 0x0
	FWeightedProbabilityRangeOfRanges ForwardOffsetVarianceInMetres; // 0x8
	float SidewaysOffsetInMetres; // 0x38
	FWeightedProbabilityRangeOfRanges SidewaysOffsetVarianceInMetres; // 0x40
};

struct FAthenaAnimationItemListingMappings {
	UAnimationDataStoreId* AnimDataBodyTypeID; // 0x0
	UAthenaAnimationItemListingAsset* ItemListing; // 0x8
};

struct FAthenaAnimationCapstanAnimData {
	UAnimSequence* Attach; // 0x0
	UAnimSequence* Detach; // 0x8
	TArray<UBlendSpace1D*> NeutralForce; // 0x10
	TArray<UBlendSpace1D*> PushForce; // 0x20
	TArray<UBlendSpace1D*> PullForce; // 0x30
	UBlendSpace1D* PullToNeutral; // 0x40
	UBlendSpace1D* PushToPull; // 0x48
	UBlendSpace1D* PullToPush; // 0x50
	float RemapSpeed; // 0x58
	UBlendSpace1D* UpperIntent; // 0x60
};

struct FAthenaAnimationObjectActionOneShotPlayingStruct {
	UAnimSequence* Action; // 0x0
	UAnimSequence* ActionVariant1; // 0x8
	UAnimSequence* ActionVariant2; // 0x10
	UAnimSequence* ActionVariant3; // 0x18
	UAnimSequence* ActionVariant4; // 0x20
};

struct FCompanyReputationProgressModel {
	FName CompanyId; // 0x0
	uint32_t Level; // 0x8
	uint32_t Xp; // 0xc
	FCompanyLevelDefinition NextCompanyLevel; // 0x10
	FString Sig; // 0x18
};

struct FAthenaAnimationHandHeldItemParams {
	bool LeftArmOverlayActive; // 0x0
	bool RightArmOverlayActive; // 0x1
	bool UpperBodyOverlayActive; // 0x2
	bool FullBodyOverlayActive; // 0x3
	bool SpineOverlayActive; // 0x4
	bool SpineLockActive; // 0x5
	bool ObjectActive; // 0x6
	bool ObjectOverrideStateActive; // 0x7
	FString OverlayAnimationName; // 0x8
	EItemPassiveState ObjectPassiveState; // 0x18
	bool QuickStow; // 0x19
	bool Reload; // 0x1a
	bool ContinuousInteractionCustomLocomotionEnabled; // 0x1b
};

struct FMovieSceneEvaluationTemplate {
	TMap<uint32_t, FMovieSceneEvaluationTrack> Tracks; // 0x0
	FMovieSceneEvaluationField EvaluationField; // 0xa0
	FMovieSceneSequenceHierarchy Hierarchy; // 0xd0
	FMovieSceneGenerationLedger Ledger; // 0x170
	char bHasLegacyTrackInstances : 1; // 0x218
	char bKeepStaleTracks : 1; // 0x218
};

struct FRadialDamageEvent : FDamageEvent {
	FRadialDamageParams Params; // 0x10
	FVector Origin; // 0x24
	TArray<FHitResult> ComponentHits; // 0x30
};

struct FAIDeadActionStateParams {
	float DeathDelay; // 0x0
};

struct FEventPetOwnerAssigned {
	AActor* Owner; // 0x0
};

struct FGameplayEffectSpecForRPC {
	UGameplayEffect* Def; // 0x0
	TArray<FGameplayEffectModifiedAttribute> ModifiedAttributes; // 0x8
	FGameplayEffectContextHandle EffectContext; // 0x18
	FGameplayTagContainer AggregatedSourceTags; // 0x38
	FGameplayTagContainer AggregatedTargetTags; // 0x60
	float Level; // 0x88
};

struct FAggressiveGhostShipMineFormation {
	TArray<FVector2D> OffsetsInMetres; // 0x0
};

struct FLiquidProjectileImpactEvent {
	UImpactProjectileId* ProjectileType; // 0x0
};

struct FServerCameraFadeCompleteAckNetworkEvent : FNetworkEventStruct {
	EServerCameraFadeAckReason Reason; // 0x10
};

struct FToggleableAIShipServiceDataAssetFileLocation {
	FName ToggleName; // 0x0
	FStringAssetReference Location; // 0x8
};

struct FAggressiveGhostShipsEncounterHeightPerIslandOffsets {
	FName IslandName; // 0x0
	float EventSignalHeightOffset; // 0x8
};

struct FFuncStatEntry {
	FString Name; // 0x0
	uint64_t RPCId; // 0x10
	uint32_t Count; // 0x18
};

struct FEventKrakenAnimatedTentacleTakenDamage {
	int32_t TentacleIndex; // 0x0
};

struct FBuoyantObjectSpawnGroup {
	TArray<FBuoyantObjectSpawnDesc> Objects; // 0x0
};

struct FCurrentHealthInfo {
	float Health; // 0x0
	EHealthChangedReason LastChangedReason; // 0x4
	FVector_NetQuantize10 LastInstigatorLocation; // 0x8
	uint32_t HealthChangeCount; // 0x14
};

struct FTransform {
	FQuat Rotation; // 0x0
	FVector Translation; // 0x10
	FVector Scale3D; // 0x20
};

struct FClientBootFlowStampSwapResultTelemetryEvent {
	FString FromStampId; // 0x0
	FString ToStampId; // 0x10
	bool StampSwapOccurred; // 0x20
};

struct FAchievementSailWithFlameOfFateColoursAboard {
	uint32_t RequiredTravelDistanceInMetres; // 0x0
	AShip* Ship; // 0x8
	TArray<AShipInteractableLight*> ShipLights; // 0x10
};

struct FShipLiveryRGBSwap {
	UMaterialInterface* TargetMaterial; // 0x0
	FName TargetParameterName; // 0x8
	FLinearColor TargetRGBValue; // 0x10
};

struct FAutomaticInstancingMeshComponentArray {
	TArray<UInstancedStaticMeshComponent*> Array; // 0x0
};

struct FPremiumCurrencyItemsResponseEvent {
	TArray<FPremiumCurrencyItem> PremiumCurrencyItems; // 0x0
};

struct FClientBootFlowExistingSessionsRetrievedTelemetryEvent {
	int32_t OfferedSessionIndex; // 0x0
	TArray<FClientBootFlowExistingSessionTelemetry> ExistingSessions; // 0x8
};

struct FEnvTraceData {
	int32_t VersionNum; // 0x0
	UNavigationQueryFilter* NavigationFilter; // 0x8
	FName OverrideNavMesh; // 0x10
	float ProjectDown; // 0x18
	float ProjectUp; // 0x1c
	float ExtentX; // 0x20
	float ExtentY; // 0x24
	float ExtentZ; // 0x28
	float PostProjectionVerticalOffset; // 0x2c
	ETraceTypeQuery TraceChannel; // 0x30
	ECollisionChannel SerializedChannel; // 0x31
	EEnvTraceShape TraceShape; // 0x32
	EEnvQueryTrace TraceMode; // 0x33
	char bTraceComplex : 1; // 0x34
	char bOnlyBlockingHits : 1; // 0x34
	char bCanTraceOnNavMesh : 1; // 0x34
	char bCanTraceOnGeometry : 1; // 0x34
	char bCanDisableTrace : 1; // 0x34
	char bCanProjectDown : 1; // 0x34
	bool bUseUpDownAsAbsoluteZStartAndEnd; // 0x38
	bool bUseSourceZAsEnd; // 0x39
};

struct FNavigationOptions {
	int32_t UpKeyID; // 0x0
	int32_t DownKeyID; // 0x4
	int32_t LeftKeyID; // 0x8
	int32_t RightKeyID; // 0xc
};

struct FThrottledProjectileTickPool {
	int32_t MaxNumberToTickPerFrame; // 0x0
	TArray<UImpactProjectileId*> Projectiles; // 0x8
};

struct FWwiseBinkSettings {
	FStringAssetReference PlayEvent; // 0x0
	FStringAssetReference StopEvent; // 0x10
	int32_t PreBufferCount; // 0x20
	TArray<FWwiseBinkTrackMappings> Mappings; // 0x28
};

struct FKrakenShipWrappingBehaviourWrapLocationParams {
	AKrakenShipWrappingTentacle* TentacleType; // 0x0
	FVector WrapLocationAnchorPoint; // 0x8
	FTransform TentacleHeadHoldShipLocation; // 0x20
	FKrakenShipWrappingBehaviourTentacleHeadLocations PortTentacleHeadLocations; // 0x50
	FKrakenShipWrappingBehaviourTentacleHeadLocations StarboardTentacleHeadLocations; // 0x70
	FKrakenDynamicsParams DynamicsParams; // 0x90
};

struct FMovieSceneBinding {
	FGuid ObjectGuid; // 0x0
	FString BindingName; // 0x10
	TArray<UMovieSceneTrack*> Tracks; // 0x20
};

struct FPlayerBucketScoopCustomServerEvent : FGlobalCustomServerEvent {
	FString UserId; // 0x18
};

struct FLootSpawnedAtClueSite {
	UClueSiteType* SiteType; // 0x0
	FVector SiteLocation; // 0x8
	int32_t NumLoot; // 0x14
};

struct FMigrationActionStateParams {
	float ClientSetupResponseTimeout; // 0x0
};

struct FPlayerGeneratedMapsContainerUnregisterServerEventsRpc : FBoxedRpc {
	UObject* InPlayerGeneratedMapsContainerOwnerObject; // 0x10
};

struct FEventCurseCapstan {
	float DurationToToggleCapstanPosition; // 0x0
};

struct FQuestVariableAIDioramaDesc : FQuestVariable {
	FName ParamName; // 0x8
};

struct FIslandEventIconData {
	FIslandEventData EventData; // 0x0
	FIslandEventIcons IslandIcons; // 0x38
	FIslandEventIcons HeaderIcons; // 0x48
};

struct FNPCDialogOverrideTypeWithConditionalsUnit {
	UNPCDialogOverrideType* OverrideType; // 0x0
	TArray<UNPCDialogConditional*> Conditionals; // 0x8
};

struct FBPVariableMetaDataEntry {
	FName DataKey; // 0x0
	FString DataValue; // 0x8
};

struct FPlayerBuriedItemServiceDataAssetMapStorePopulationHaul {
	float Weight; // 0x0
	FName MapName; // 0x4
	UVoyageLocationOnlyNamedIslandListDataAsset* NamedIslands; // 0x10
	FWeightedProbabilityRange NumXs; // 0x18
	UWeightedItemDescSpawnDataAsset* WeightedItemDescSpawnDataAsset; // 0x38
};

struct FServerPerformanceHeartbeatTelemetryEvent {
	float FrameMSAverage; // 0x0
	float FrameMSMin; // 0x4
	float FrameMSMax; // 0x8
	float FPSAverage; // 0xc
	float FPSMin; // 0x10
	float FPSMax; // 0x14
	uint64_t MemAvailPhyAvg; // 0x18
	uint64_t MemAvailPhyMin; // 0x20
	uint64_t MemAvailPhyMax; // 0x28
	uint64_t MemAvailVirAvg; // 0x30
	uint64_t MemAvailVirMin; // 0x38
	uint64_t MemAvailVirMax; // 0x40
	uint64_t MemUsedPhyAvg; // 0x48
	uint64_t MemUsedPhyMin; // 0x50
	uint64_t MemUsedPhyMax; // 0x58
	uint64_t MemUsedVirAvg; // 0x60
	uint64_t MemUsedVirMin; // 0x68
	uint64_t MemUsedVirMax; // 0x70
	int32_t NumOfPlayers; // 0x78
	int32_t NumOfAI; // 0x7c
};

struct FMovieSceneParameterSectionTemplate : FMovieSceneEvalTemplate {
	TArray<FScalarParameterNameAndCurve> Scalars; // 0x18
	TArray<FVectorParameterNameAndCurves> Vectors; // 0x28
	TArray<FColorParameterNameAndCurves> Colors; // 0x38
};

struct FCanShowTertiaryActionButton : FRadialInventoryEvent {
	bool CanShow; // 0x4
	FText Text; // 0x8
};

struct FSetToastHoldDurationMultiplier {
	float Multiplier; // 0x0
};

struct FAIBountySpawnerArchiveWaveEntry {
	int32_t NumPawnsToSpawn; // 0x0
};

struct FVoyageHandInEntry {
	UVoyageRecipeDataAsset* VoyageRecipe; // 0x0
	UItemDesc* Item; // 0x8
};

struct FStringAssetClassPairFeatureOverride {
	FName FeatureName; // 0x0
	UClass* AssetClass; // 0x8
};

struct FPlayerHeartbeatTelemetryEvent {
	FString MovementMode; // 0x0
	FString LocationOnShip; // 0x10
	float CurrentHealth; // 0x20
	int32_t ActiveTime; // 0x24
	int32_t IdleTime; // 0x28
	int32_t CurrentStateTime; // 0x2c
	int32_t MoveTimeStampReset; // 0x30
	int32_t MoveTimeStampExpired; // 0x34
	int32_t MoveDiscrepancyCorrections; // 0x38
	int32_t AverageNetActorConsiderCount; // 0x3c
	int32_t AverageNetActorEvaluatedCount; // 0x40
	int32_t AverageNetActorDormantCount; // 0x44
};

struct FInlineUserDefinedStructDetails {
	UScriptStruct* Struct; // 0x0
};

struct FAnimationLODParameters {
	int32_t MaxIKEntities; // 0x0
	float MaxIKDistance; // 0x4
	float MinLODSolverDistance; // 0x8
	float MinFootPlantingActiveDistance; // 0xc
};

struct FRequestCompanyShopOffersEvent {
	FString CatalogName; // 0x0
	FString CompanyId; // 0x10
};

struct FItemSpawnCustomServerEvent : FGlobalCustomServerEvent {
	FString ItemId; // 0x18
	FString ItemType; // 0x28
};

struct FEnvQueryResult {
	UEnvQueryItemType* ItemType; // 0x10
	int32_t OptionIndex; // 0x2c
	int32_t QueryID; // 0x30
};

struct FEventPetReactedToFood : FEventPetFoodBase {
	EPetFeedingReactionType ReactionType; // 0x10
};

struct FAnimNotifyWwiseObserver {
	UWwiseEvent* OnEventPosted; // 0x0
	bool PreventPlayingPostedEvent; // 0x8
	TArray<UWwiseEvent*> AdditionalEventsToTrigger; // 0x10
};

struct FTeleportActionStateParams {
	float FadeDuration; // 0x0
	float FadeEventTimeout; // 0x4
	float FadeServerTimeout; // 0x8
	FLinearColor FadeColour; // 0xc
	bool FadeAudio; // 0x1c
	float CharacterFadeCompleteTimeout; // 0x20
	float TeleportCompleteTimeout; // 0x24
	float TeleportNetRelevancyTimeout; // 0x28
};

struct FRequestJoinCrewEvent {
	int32_t CrewId; // 0x0
};

struct FEventCharacterStartedContinuousUse {
	UNotificationInputId* InputID; // 0x0
};

struct FAggressiveGhostShipSplineDataOffsets {
	float FormationForwardOffsetInMetres; // 0x0
	float FormationForwardOffsetVarianceInMetres; // 0x4
	float FormationForwardOffsetVarianceSpeed; // 0x8
	float FormationSidewaysOffsetInMetres; // 0xc
	float FormationSidewaysOffsetVarianceInMetres; // 0x10
	float FormationSidewaysOffsetVarianceSpeed; // 0x14
};

struct FFeatureToggledLevel {
	FName Feature; // 0x0
	FStringAssetReference Level; // 0x8
};

struct FSyncLoadPackageTelemetryEvent {
	FString ObjectName; // 0x0
	FString PackageName; // 0x10
};

struct FKrakenShipWrappingBehaviourDamageParams {
	float ChanceOfDamagingBottomDeckDamageHoles; // 0x0
	float ChanceThatExistingHolesWillBeDamaged; // 0x4
	int32_t LevelsOfDamage; // 0x8
	FWeightedProbabilityRangeOfRanges NumHolesToDamageRange; // 0x10
	FWeightedProbabilityRangeOfRanges DamageIntervalRange; // 0x40
};

struct FPlayerGeneratedMapsContainerHealthChangedCloseInventoryRpc : FBoxedRpc {
	UScriptStruct* Type; // 0x8
};

struct FShipLiveryCatalogueEntry {
	FGuid Id; // 0x0
	FStringAssetReference Desc; // 0x10
	FStringAssetReference RowboatLiveryDesc; // 0x20
	TArray<FText> Names; // 0x30
	UShipSize* ShipSize; // 0x40
	bool AvailableToGame; // 0x48
	FName FeatureName; // 0x4c
	FText ShipTeamName; // 0x58
	FText ArenaCrewWelcomeMessage; // 0x90
	FText ShipUINotificationTeamName; // 0xc8
	UTexture* ShipScrollTeamIcon; // 0x100
	FStringAssetReference ShipToastTeamIcon; // 0x108
	FStringAssetReference ShipToastTeamBackgroundImage; // 0x118
	FStringAssetReference ShipToastForegroundArtWork; // 0x128
	FStringAssetReference ShipTeamBackgroundImage; // 0x138
	FName AudioEventName; // 0x148
	FStringAssetReference TeamTavernBannerTexture; // 0x150
	UTexture* CrewLiveryOverlayIcon; // 0x160
	bool AvailableWhenFeatureEnabled; // 0x168
	bool AvailableWhenFeatureDisabled; // 0x169
};

struct FRadialInventoryClearHighlight : FRadialInventoryEvent {
	int32_t RadialIdentifier; // 0x0
};

struct FUIPremiumStoreOpenEvent {
	bool IsFrontend; // 0x0
	FString SessionId; // 0x8
};

struct FEventExitedShip {
	AActor* Ship; // 0x0
	AActor* Actor; // 0x8
};

struct FDestroyAllExistingActorsByClassData {
	TArray<FString> ActorClassNames; // 0x0
};

struct FTaleQuestSelectWreckLocationTelemetryEvent {
	FString EventIdent; // 0x0
	int32_t NumLocations; // 0x10
	int32_t LocationIndex; // 0x14
	int32_t KeyIndex; // 0x18
	TArray<int32_t> FlagResponses; // 0x20
};

struct FQuestVariableBountyTargetArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FHttpResponseTelemetryFragmentInput : FTelemetryFragmentInput {
	FString Method; // 0x0
	FString Endpoint; // 0x10
	FString Context; // 0x20
	EHttpRequestTelemetryResult Result; // 0x30
	int32_t StatusCode; // 0x34
	int32_t DurationMS; // 0x38
	FString ResponseBody; // 0x40
	TArray<FString> ResponseHeaders; // 0x50
	int32_t Attempts; // 0x60
};

struct FEmissaryFlagMeshReferences {
	FStringAssetReference BackOfShipEmissaryFlagMeshAssetReference; // 0x0
	FStringAssetReference MastEmissaryFlagMeshAssetReference; // 0x10
};

struct FRumbleParameters {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x0
	UCameraShake* CameraShakeEffect; // 0x8
	bool Looping; // 0x10
	FName Tag; // 0x14
};

struct FTableColumnHeaderStyle : FSlateWidgetStyle {
	FSlateBrush SortPrimaryAscendingImage; // 0x8
	FSlateBrush SortPrimaryDescendingImage; // 0x98
	FSlateBrush SortSecondaryAscendingImage; // 0x128
	FSlateBrush SortSecondaryDescendingImage; // 0x1b8
	FSlateBrush NormalBrush; // 0x248
	FSlateBrush HoveredBrush; // 0x2d8
	FSlateBrush MenuDropdownImage; // 0x368
	FSlateBrush MenuDropdownNormalBorderBrush; // 0x3f8
	FSlateBrush MenuDropdownHoveredBorderBrush; // 0x488
};

struct FPlayerSetFlameOfFateEvent {
	AAthenaPlayerCharacter* PlayerCharacter; // 0x0
	UObject* Target; // 0x8
	EFlameOfFateType FlameOfFateType; // 0x10
};

struct FBlackboardEntry {
	FName EntryName; // 0x0
	UBlackboardKeyType* KeyType; // 0x8
	char bInstanceSynced : 1; // 0x10
};

struct FServerTelemetryFragment {
	uint32_t ServerSequenceId; // 0x0
	FGuid ServerSessionId; // 0x4
	FString ServerBuildId; // 0x18
	FString ServerLocation; // 0x28
	FString ServerPlayMode; // 0x38
	FString PlayModeState; // 0x48
	bool ServerIsActive; // 0x58
	bool ServerIsXboxPadOnlySession; // 0x59
};

struct FLightningTarget {
	ELightningHitTarget TargetType; // 0x0
	float Chance; // 0x4
};

struct FInventoryInteractionUpdateEvent {
	TArray<FIInventoryItem> Current; // 0x0
	TArray<FIInventoryItem> Available; // 0x10
	TArray<FIInventoryItemDescription> Descriptions; // 0x20
};

struct FEventStatusMaterialEffectEnded {
	FName MaterialParamName; // 0x0
	FName CanShowMaterialParam; // 0x8
	float FadeOutAcceleration; // 0x10
};

struct FMinimalViewInfo {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x28
	float OrthoWidth; // 0x2c
	float OrthoNearClipPlane; // 0x30
	float OrthoFarClipPlane; // 0x34
	float AspectRatio; // 0x38
	char bConstrainAspectRatio : 1; // 0x3c
	char bUseFieldOfViewForLOD : 1; // 0x3c
	ECameraProjectionMode ProjectionMode; // 0x40
	float PostProcessBlendWeight; // 0x44
	FPostProcessSettings PostProcessSettings; // 0x50
};

struct FPoseLinkBase {
	int32_t LinkID; // 0x0
};

struct FEventStartWield {
	TScriptInterface<Class> Object; // 0x0
};

struct FWeightedItemDescSpawnDataWithRandomQuantityResult {
	UItemSpawnData* ItemSpawnData; // 0x0
	bool CustomLifetimeManagement; // 0xc
};

struct FTypedStorageContainerContentTypeSelectorEntry {
	float Weight; // 0x0
	int32_t MinimumUses; // 0x4
	int32_t MaximumUses; // 0x8
	UItemCategory* ContentSpawnerType; // 0x10
};

struct FGetVolcanoesDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FVolcanoActorStateData> Data; // 0x8
};

struct FIconCaptureDataRow : FTableRowBase {
	UClass* CategoryClass; // 0x0
	FString MapToPositionIn; // 0x20
	UClass* CaptureProxyActor; // 0x30
	UClass* WieldableActorParent; // 0x50
	FName FolderPath; // 0x70
	TArray<FName> AssetSearchFolderPaths; // 0x78
};

struct FGameplayAbilityLocalAnimMontage {
	UAnimMontage* AnimMontage; // 0x0
	bool PlayBit; // 0x8
	FPredictionKey PredictionKey; // 0x10
	UGameplayAbility* AnimatingAbility; // 0x28
};

struct FSingleStickMappingAxis {
	FString BindingName; // 0x0
	bool Invert; // 0x10
};

struct FClientMeleeHitRegInfoTelemetryEvent {
	FGuid AttackId; // 0x0
	int32_t NumHits; // 0x10
	FString HitObjectId; // 0x18
	FString HitObjectType; // 0x28
	FString HitActorName; // 0x38
	bool IsDamageBlocked; // 0x48
};

struct FCrewServiceParams {
	float MinSafeDistanceToShip; // 0x0
	float SpawnDistAroundSunkenShip; // 0x4
	TArray<int32_t> VotesRequiredForSendToBrig; // 0x8
	TArray<int32_t> VotesRequiredForReleaseFromBrig; // 0x18
	TArray<int32_t> VotesRequiredForScuttleShip; // 0x28
	TArray<int32_t> VotesRequiredForChangeMatchmakingVisibility; // 0x38
	TArray<int32_t> VotesRequiredForArenaRivalVote; // 0x48
	float BrigMinReleaseTime; // 0x58
	float BrigServerTimeToRememberPastCrewMates; // 0x5c
};

struct FGameplayAbilityTargetingLocationInfo {
	EGameplayAbilityTargetingLocationType LocationType; // 0x10
	FTransform LiteralTransform; // 0x20
	AActor* SourceActor; // 0x50
	UMeshComponent* SourceComponent; // 0x58
	UGameplayAbility* SourceAbility; // 0x60
	FName SourceSocketName; // 0x68
};

struct FDirectorSettingEntry {
	UVoyageDescDataAsset* VoyageDesc; // 0x0
};

struct FPetPickedUpTelemetryEvent {
	bool IsOnPerch; // 0x0
};

struct FAnimNode_HIKPull : FAnimNode_HIKBase {
	float Alpha; // 0x48
	EHIKEffector Effector; // 0x4c
};

struct FSlotAnimationTrack {
	FName SlotName; // 0x0
	FAnimTrack AnimTrack; // 0x8
};

struct FAthenaAIControllerTargetPickingData {
	FString TargetName; // 0x0
	bool BestTargetByScore; // 0x10
	bool IsCurrentTargetActor; // 0x11
	float TargetScore; // 0x14
	float DistScore; // 0x18
	float FacingScore; // 0x1c
	float TargetWeightScore; // 0x20
	float DamageScore; // 0x24
	float TargetDistance; // 0x28
	float TargetAngle; // 0x2c
	int32_t NumTargeting; // 0x30
	float RecentDamage; // 0x34
};

struct FTrackItemOwnershipEvent {
	AActor* TrackedItem; // 0x0
	TScriptInterface<Class> CrewMembershipInterface; // 0x8
};

struct FAnimSegment {
	UAnimSequenceBase* AnimReference; // 0x0
	float StartPos; // 0x8
	float AnimStartTime; // 0xc
	float AnimEndTime; // 0x10
	float AnimPlayRate; // 0x14
	int32_t LoopingCount; // 0x18
};

struct FEnableMovementDuringRadialEvent {
	bool EnableMovementDuringRadial; // 0x0
};

struct FAchievementUnlockedMessage {
	FPirateIdentity PirateIdentity; // 0x0
	FString AchievementId; // 0x78
};

struct FKrakenShipHittingBehaviourParams {
	UShipSize* ShipSize; // 0x0
	AKrakenAnimatedTentacle* TentacleType; // 0x8
	FWeightedProbabilityRangeOfRanges DamageRequiredToCancelImpact; // 0x10
	float CancellationThreshold; // 0x40
	float ImpactTime; // 0x44
	int32_t LevelsOfDamage; // 0x48
	TArray<FKrakenShipHittingBehaviourImpactParams> Configurations; // 0x50
};

struct FAISpawnerWave {
	float SpawnChance; // 0x0
	FWeightedProbabilityRange NumOfSpawnsInWave; // 0x8
	FAISpawnTypeParamsCollection SpawnTypeParamsOverride; // 0x28
	FWeightedProbabilityRangeOfRanges DelayBeforeWave; // 0x70
	FWeightedProbabilityRangeOfRanges DelayBetweenSpawns; // 0xa0
	FWeightedProbabilityRangeOfRanges DelayBeforeNextWaveIfSuccessful; // 0xd0
};

struct FAnimNode_Base {
	FExposedValueHandler EvaluateGraphExposedInputs; // 0x8
};

struct FAIShipGenerationParams {
	EAIShipEncounterType EncounterType; // 0x0
	EAIShipType ShipType; // 0x1
	UAthenaAIShipControllerParamsDataAsset* ShipControllerParams; // 0x8
	TArray<FAIShipSkeletonSkillsetOverride> SkillsetOverrides; // 0x10
	TArray<FWeightedAIShipCrewAmmoType> SkeletonAmmoTypeOverrides; // 0x20
	FAIShipContextDescDamageParams DamageParams; // 0x30
};

struct FSetShouldUseRevivalFlowData {
	int32_t PlayerNetGUID; // 0x0
	bool bShouldUseRevivalFlow; // 0x4
};

struct FContinuousHealthChange {
	float Rate; // 0x0
	float ChangeApplied; // 0x4
	EHealthChangedReason Reason; // 0x8
};

struct FInstancedRopeParams {
	FVector Start; // 0x0
	FVector End; // 0xc
	float Thickness; // 0x18
	float UVScale; // 0x1c
	float UVBase; // 0x20
	float UVOffset; // 0x24
	float Roughness; // 0x28
	FRopeCatenaryShapeParams Shape; // 0x2c
	FRopeCatenarySwingParams Swing; // 0x44
	FRopeCatenaryDynamicsParams Dynamics; // 0x4c
};

struct FAnimNode_HIKSolve : FAnimNode_HIKBase {
	float Alpha; // 0x48
	FComponentSpacePoseLink InputFKPose; // 0x50
	bool enablePullEngine; // 0x68
	bool enableBodyPartSolving; // 0x69
	bool enableLODSolver; // 0x6a
	bool enableLegsSNS; // 0x6b
	bool enableArmsSNS; // 0x6c
	bool boneLengthFromInputPose; // 0x6d
	bool bodyPartSolveLeftShoulder; // 0x6e
	bool bodyPartSolveRightShoulder; // 0x6f
	bool bodyPartSolveLeftArm; // 0x70
	bool bodyPartSolveRightArm; // 0x71
	bool bodyPartSolveLeftLeg; // 0x72
	bool bodyPartSolveRightLeg; // 0x73
	bool bodyPartSolveLeftHand; // 0x74
	bool bodyPartSolveRightHand; // 0x75
	bool bodyPartSolveLeftFoot; // 0x76
	bool bodyPartSolveRightFoot; // 0x77
	bool bodyPartSolveHead; // 0x78
	bool bodyPartSolveSpine; // 0x79
	bool checkOutputPoseContainsNaNs; // 0x7a
};

struct FCutsceneStateChangedEvent {
	ECutsceneActivatonState NewState; // 0x0
};

struct FKeyTakenEvent {
	AItemInfo* KeyTaken; // 0x0
};

struct FHttpClientComponentResponseEvent {
	bool Success; // 0x0
	FString Body; // 0x8
	FString Id; // 0x18
};

struct FSeaRock {
	FVector2D Location; // 0x0
	float Radius; // 0x8
};

struct FITavernBoardMap {
	TArray<FString> Creators; // 0x0
	FString IconPath; // 0x10
	float IconRotation; // 0x20
	FGuid Id; // 0x24
	bool IsAvailable; // 0x34
	FString Name; // 0x38
	EWorldRegion WorldRegion; // 0x48
};

struct FAmmoChangeEffectParams {
	float InputRangeMin; // 0x0
	float InputRangeMax; // 0x4
	float OutputRangeMin; // 0x8
	float OutputRangeMax; // 0xc
	float OutputRangeThreshold; // 0x10
	bool UseThresholdValueAsNewOutputRangeMax; // 0x14
	UCurveFloat* LerpSpeedCurve; // 0x18
	FScalarParameterValue ScalarParameterValue; // 0x20
};

struct FMerchantContract {
	TArray<FMerchantContractDeliveryRequest> DeliveryRequests; // 0x18
};

struct FEventCurrentWaterPlaneChange {
	UBaseWaterComponent* FormerWaterPlane; // 0x0
	UBaseWaterComponent* NewWaterPlane; // 0x8
};

struct FAggregateGeometry2D {
	TArray<FCircleElement2D> CircleElements; // 0x0
	TArray<FBoxElement2D> BoxElements; // 0x10
	TArray<FConvexElement2D> ConvexElements; // 0x20
};

struct FControlObjectActionStateParams : FDockToObjectActionStateParams {
	bool UndockToLastKnownLocation; // 0x10
	float UndockDuration; // 0x14
};

struct FMultipleNPCCompaniesRedirectionData {
	TArray<UCompany*> Companies; // 0x0
	FText VisitNPCTooltip; // 0x10
};

struct FCreateFogBankData {
	FVector2D Location; // 0x0
	float Density; // 0x8
	FVector SizeInKm; // 0xc
	float FadeDuration; // 0x18
};

struct FActiveGameplayCue : FFastArraySerializerItem {
	FGameplayTag GameplayCueTag; // 0x8
	FPredictionKey PredictionKey; // 0x10
	bool bPredictivelyRemoved; // 0x28
};

struct FMeshMergingSettings {
	bool bGenerateLightMapUV; // 0x0
	int32_t TargetLightMapUVChannel; // 0x4
	int32_t TargetLightMapResolution; // 0x8
	bool bImportVertexColors; // 0xc
	bool bPivotPointAtZero; // 0xd
	bool bMergePhysicsData; // 0xe
	bool bMergeMaterials; // 0xf
	bool bExportNormalMap; // 0x10
	bool bExportMetallicMap; // 0x11
	bool bExportRoughnessMap; // 0x12
	bool bExportSpecularMap; // 0x13
	int32_t MergedMaterialAtlasResolution; // 0x14
	bool bEnableCollisionMerging; // 0x18
	bool bUseRelativeTransform; // 0x19
	bool bMergeRelativeToFirstComponent; // 0x1a
	bool bDuplicateLODs; // 0x1b
	TArray<float> LODScreenSizes; // 0x20
	int32_t LODForCollision; // 0x30
};

struct FLobbyInviteCode {
	FString Code; // 0x0
	FString CreatedUtc; // 0x10
};

struct FHapticFeedbackDetails {
	FRuntimeFloatCurve Frequency; // 0x0
	FRuntimeFloatCurve Amplitude; // 0x80
};

struct FCargoRunQuestCrateEntries {
	FString Rarity; // 0x0
	int32_t CargoCount; // 0x10
};

struct FEventStorageContainerContentsChanged {
	UStorageContainerComponent* Source; // 0x0
};

struct FLoadoutPetCategory {
	FString PetEntitlementId; // 0x0
	FString PetCustomizationEntitlementId; // 0x10
	FString PetName; // 0x20
};

struct FEventCompanyScreenDisplayInformationResponse {
	FCompanyScreenInformation CompanyData; // 0x0
};

struct FFaunaAnimationEatingStructure {
	UAnimSequence* EatingNormal; // 0x0
	UAnimSequence* EatingStarving; // 0x8
};

struct FBarrelsOfPlentyDebugLocationEntry {
	FVector WorldSpacePosition; // 0x0
	float SinkTime; // 0xc
};

struct FSetCustomPlayerStartData {
	int32_t PlayerNetGUID; // 0x0
	int32_t PlayerStartActorNetID; // 0x4
};

struct FLightVisualisation {
	FActorComponentSelector TargetLight; // 0x0
	float TransitionTime; // 0x10
	float ActiveValue; // 0x14
	float InactiveValue; // 0x18
	ULightComponent* Light; // 0x20
};

struct FPlayerBuriedItemServiceItemDigUpRadiusSurfaceOverride {
	EPhysicalSurface SurfaceType; // 0x0
	float ItemDigUpRadius; // 0x4
};

struct FMainTutorialSequence : FTutorialSequence {
	FTutorialStepPlayIntroAnimatic PlayIntro; // 0xb8
	FTutorialStepEatBanana EatBanana; // 0x160
	FTutorialStepUseMap UseMap; // 0x2c0
	FTutorialStepBuyVoyage BuyVoyage; // 0x430
	FTutorialStepCycleWeapons CycleWeapons; // 0x548
	FTutorialStepSellTreasure SellTreasure; // 0x5c8
	FTutorialStepBuyClothes BuyClothes; // 0x850
	FTutorialStepReturnToStranger ReturnToStranger; // 0x8e8
	FTutorialStepBeginTallTale BeginTallTale; // 0xa48
	FTutorialStepEndOfTutorial EndOfTutorial; // 0xb10
};

struct FEventCompanyReputationCampaignInformation {
	FString CampaignId; // 0x0
	FString Title; // 0x10
	FString Description; // 0x20
	FCappedCount Progress; // 0x30
	FString ImageUrl; // 0x38
	bool MarkAsNew; // 0x48
	bool Locked; // 0x49
	FMoreInfoDetails MoreInfo; // 0x50
};

struct FContestUIDescriptions {
	UPopUpMessageDesc* NewMapDesc; // 0x0
	UPopUpMessageDesc* ShipSunkDesc; // 0x8
	FText ContestStartBlindText; // 0x10
	FText ContestEndBlindText; // 0x48
};

struct FMerchantItemGroupDesc {
	TArray<UMerchantQuestItemData*> Items; // 0x0
};

struct FWaterBarrelFeedbackLevel {
	float Strength; // 0x0
	UForceFeedbackEffect* Effect; // 0x8
};

struct FInteractableMechanismIslandData {
	FName IslandName; // 0x0
};

struct FKrakenShipWrappingBehaviourTentacleHeadLocations {
	TArray<FKrakenShipWrappingBehaviourNamedTransform> Near; // 0x0
	TArray<FKrakenShipWrappingBehaviourNamedTransform> Far; // 0x10
};

struct FTestMessageDateTime {
	FDateTime DateTime; // 0x0
};

struct FEntityCustomServerEvent : FCustomServerEvent {
	int32_t EntityNetId; // 0x18
};

struct FGameplayAbilitySpecHandle {
	int32_t Handle; // 0x0
};

struct FTrackedPlayerKillEntry {
	FString KilledPlayer; // 0x0
	int32_t KillCount; // 0x10
	float KillTime; // 0x14
};

struct FVoyageProposalCompanyAssetData {
	UCompany* Company; // 0x0
	FStringAssetReference OpenVoyageProposalMesh; // 0x8
	TArray<FVoyageProposalAssetData> Ranks; // 0x18
};

struct FBuoyancySampleMovementConfiguration {
	UCurveVector* CenterOfMassOffsetCurve; // 0x0
	TArray<FBuoyancySampleMovementConfigurationEntry> SampleMoveData; // 0x8
	float OverallBuoyancyScalar; // 0x18
	UCurveFloat* OverallBuoyancyScalarBlendCurve; // 0x20
	UCurveFloat* ProbeMovementBlendCurve; // 0x28
	float Duration; // 0x30
};

struct FFoliageTypeObject {
	UObject* FoliageTypeObject; // 0x0
	UFoliageType_InstancedStaticMesh* TypeInstance; // 0x8
	bool bIsAsset; // 0x10
	UFoliageType_InstancedStaticMesh* Type; // 0x18
};

struct FEventUserGameSettingsSetKeyBinding {
	EBindingSet BindingSet; // 0x0
	FString BindingName; // 0x8
	FString KeyName; // 0x18
};

struct FHIKBoneTransform {
	int32_t BoneID; // 0x0
	FVector Translation; // 0x4
	FQuat Orientation; // 0x10
	FVector Scale; // 0x20
};

struct FEventAthenaPlayerControllerEndingPlay {
	AAthenaPlayerController* Controller; // 0x0
};

struct FMobileInstancedStaticMeshLOD {
	float LODReduction; // 0x0
	float DistanceToLOD; // 0x4
};

struct FEventKrakenAnimatedTentacleAnimationStarted {
	UAnimSequence* Animation; // 0x0
};

struct FInitRHIDiagnosticTelemetryEvent {
	FString ErrorMessage; // 0x0
};

struct FSubstringAuditQueryData {
	TArray<FString> QueryStringArray; // 0x0
	int32_t SearchSetSize; // 0x10
	int32_t MemoryLimitForSet; // 0x14
};

struct FCrewMemberData {
	bool Vote; // 0x0
	char NumVotes; // 0x1
	EBrigState BrigState; // 0x2
	APlayerState* PlayerState; // 0x8
};

struct FEventVolcanoStateChanged {
	EVolcanoState State; // 0x0
};

struct FContestVoyageIslandData {
	FName IslandName; // 0x0
	int32_t MaxItemCountForIsland; // 0x8
};

struct FClassRedirect {
	FString ObjectName; // 0x0
	FString OldClassName; // 0x10
	FString NewClassName; // 0x20
	FString OldSubobjName; // 0x30
	FString NewSubobjName; // 0x40
	bool InstanceOnly; // 0x50
};

struct FPlayerGameStartVoyageTelemetryEvent {
	FString VoyageTitle; // 0x0
	FGuid VoyageId; // 0x10
	EVoyageJoinStatus JoinStatus; // 0x20
	bool IsTale; // 0x21
	bool IsStarlightTale; // 0x22
};

struct FFeatureLockedAIShipEncounterBattleGenerationParams {
	FName Feature; // 0x0
	FAIShipEncounterBattleGenerationParams Params; // 0x8
};

struct FUIPremiumStorePageTransitionTelemetryEvent {
	FString CurrentPage; // 0x0
	FString PreviousHighlight; // 0x10
	FString PreviousPage; // 0x20
	FString SessionId; // 0x30
	float TimeOnPreviousPage; // 0x40
};

struct FEventLocalPlayerSuperheatedWaterZoneChanged {
	bool IsInSuperheatedWaterZone; // 0x0
};

struct FEventBeginningToSink {
	AActor* Ship; // 0x0
};

struct FPreviewAssetAttachContainer {
	TArray<FPreviewAttachedObjectPair> AttachedObjects; // 0x0
};

struct FCanShowQuaternaryActionButton : FRadialInventoryEvent {
	bool CanShow; // 0x4
	FText Text; // 0x8
};

struct FEventOwnedPawnFinishedDying {
	ECharacterDeathType DeathType; // 0x0
};

struct FHealthChangeAudio {
	EHealthChangedReason Reason; // 0x0
	UWwiseEvent* Sfx; // 0x8
};

struct FQuestDistributionFixedChaptersParams {
	bool UseProceduralQuestRewards; // 0x0
	int32_t NumChapters; // 0x4
	TArray<FChapterDataEntry> Chapters; // 0x8
};

struct FPlayerBuriedItemServiceHaulSizeEntry {
	FText Title; // 0x0
	int32_t MinHaulSize; // 0x38
};

struct FEventGhostShipDoorCreated {
	AGhostShipDoor* GhostShipDoor; // 0x0
};

struct FBountySpawnerAudioChangedNetworkEvent : FNetworkEventStruct {
	EBountySpawnerAudioState AudioState; // 0x10
	float Intensity; // 0x14
	EBountySpawnerType BountyType; // 0x18
	FVector BountyPosition; // 0x1c
};

struct FVelocityConeGroupParams {
	FRawDistributionFloat Angle; // 0x0
	FRawDistributionFloat Velocity; // 0x38
	FVector Direction; // 0x70
};

struct FCrewSessionOperationFailedTelemetryEvent {
	FString ErrorMessage; // 0x0
	int32_t OperationTypeCode; // 0x10
	bool WasCancelled; // 0x14
};

struct FDestructibleParameters {
	FDestructibleDamageParameters DamageParameters; // 0x0
	FDestructibleDebrisParameters DebrisParameters; // 0x1c
	FDestructibleAdvancedParameters AdvancedParameters; // 0x48
	FDestructibleSpecialHierarchyDepths SpecialHierarchyDepths; // 0x58
	TArray<FDestructibleDepthParameters> DepthParameters; // 0x70
	FDestructibleParametersFlag Flags; // 0x80
};

struct FEdGraphSchemaAction {
	FText MenuDescription; // 0x8
	FString TooltipDescription; // 0x40
	FText Category; // 0x50
	FText Keywords; // 0x88
	int32_t Grouping; // 0xc0
	int32_t SectionID; // 0xc4
};

struct FClientRequestCameraFadeCompleteAckNetworkEvent : FNetworkEventStruct {
	float AckTimeout; // 0x10
};

struct FLightingControllerPostProcessParams {
	FRainPostProcessSettings RainPostProcessParams; // 0x0
	FRainPostProcessSettings UnderwaterPostProcessParams; // 0xc0
	UMaterialInterface* PostProcessUnderWaterPrelightingMaterial; // 0x180
	UMaterialInterface* PostProcessUnderwaterCausticsMaterial; // 0x188
	UMaterialInterface* PostProcessDistortionMaterial; // 0x190
	UMaterialInterface* PostProcessColourOverlayMaterial; // 0x198
};

struct FPlayerReservation {
	FUniqueNetIdRepl UniqueId; // 0x0
	FString ValidationStr; // 0x18
	float ElapsedTime; // 0x28
};

struct FEventExplosionIgnitedActor {
	AActor* IgnitedActor; // 0x0
};

struct FDockTabStyle : FSlateWidgetStyle {
	FButtonStyle CloseButtonStyle; // 0x8
	FSlateBrush NormalBrush; // 0x2b0
	FSlateBrush ActiveBrush; // 0x340
	FSlateBrush ColorOverlayBrush; // 0x3d0
	FSlateBrush ForegroundBrush; // 0x460
	FSlateBrush HoveredBrush; // 0x4f0
	FSlateBrush ContentAreaBrush; // 0x580
	FSlateBrush TabWellBrush; // 0x610
	FMargin TabPadding; // 0x6a0
	float OverlapWidth; // 0x6b0
	FSlateColor FlashColor; // 0x6b8
};

struct FMergedCollisionActorsSimplification {
	FCollisionMergingSettings MergeCollisionSettings; // 0x0
	float MaxBoundRadius; // 0x4
	int32_t MinNumberOfComponentsToMerge; // 0x8
};

struct FUpdateScoreBalanceHUDEvent : FNetworkEventStruct {
	TArray<FContestLeaderboardEntry> ContestLeaderboard; // 0x10
};

struct FCreateStormData {
	FVector2D StormCentre; // 0x0
	float StormStrength; // 0x8
};

struct FLightmassWorldInfoSettings {
	float StaticLightingLevelScale; // 0x0
	int32_t NumIndirectLightingBounces; // 0x4
	float IndirectLightingQuality; // 0x8
	float IndirectLightingSmoothness; // 0xc
	FColor EnvironmentColor; // 0x10
	float EnvironmentIntensity; // 0x14
	float EmissiveBoost; // 0x18
	float DiffuseBoost; // 0x1c
	char bUseAmbientOcclusion : 1; // 0x20
	char bGenerateAmbientOcclusionMaterialMask : 1; // 0x20
	float DirectIlluminationOcclusionFraction; // 0x24
	float IndirectIlluminationOcclusionFraction; // 0x28
	float OcclusionExponent; // 0x2c
	float FullyOccludedSamplesFraction; // 0x30
	float MaxOcclusionDistance; // 0x34
	char bVisualizeMaterialDiffuse : 1; // 0x38
	char bVisualizeAmbientOcclusion : 1; // 0x38
	float VolumeLightSamplePlacementScale; // 0x3c
	char bCompressLightmaps : 1; // 0x40
};

struct FEventWieldableItemUseStoppedAndFullyHidden {
	AActor* Item; // 0x0
	EPerspectiveTypes PerspectiveType; // 0x8
};

struct FAggressiveGhostShipDroppedMineTelemetryEvent {
	FGuid ShipId; // 0x0
};

struct FEventPetPickedUp {
	bool IsOnPerch; // 0x0
};

struct FSessionJoinThroughServiceRequestModel {
	FString OwningUserId; // 0x0
	FString SessionTemplateName; // 0x10
};

struct FConstraintInstance {
	USceneComponent* OwnerComponent; // 0x8
	FName JointName; // 0x1c
	FName ConstraintBone1; // 0x24
	FName ConstraintBone2; // 0x2c
	FVector Pos1; // 0x34
	FVector PriAxis1; // 0x40
	FVector SecAxis1; // 0x4c
	FVector Pos2; // 0x58
	FVector PriAxis2; // 0x64
	FVector SecAxis2; // 0x70
	char bDisableCollision : 1; // 0x7c
	char bEnableProjection : 1; // 0x7c
	float ProjectionLinearTolerance; // 0x80
	float ProjectionAngularTolerance; // 0x84
	ELinearConstraintMotion LinearXMotion; // 0x88
	ELinearConstraintMotion LinearYMotion; // 0x89
	ELinearConstraintMotion LinearZMotion; // 0x8a
	float LinearLimitSize; // 0x8c
	char bLinearLimitSoft : 1; // 0x90
	float LinearLimitStiffness; // 0x94
	float LinearLimitDamping; // 0x98
	char bLinearBreakable : 1; // 0x9c
	float LinearBreakThreshold; // 0xa0
	EAngularConstraintMotion AngularSwing1Motion; // 0xa4
	EAngularConstraintMotion AngularTwistMotion; // 0xa5
	EAngularConstraintMotion AngularSwing2Motion; // 0xa6
	char bSwingLimitSoft : 1; // 0xa8
	char bTwistLimitSoft : 1; // 0xa8
	float Swing1LimitAngle; // 0xac
	float TwistLimitAngle; // 0xb0
	float Swing2LimitAngle; // 0xb4
	float SwingLimitStiffness; // 0xb8
	float SwingLimitDamping; // 0xbc
	float TwistLimitStiffness; // 0xc0
	float TwistLimitDamping; // 0xc4
	FRotator AngularRotationOffset; // 0xc8
	char bAngularBreakable : 1; // 0xd4
	float AngularBreakThreshold; // 0xd8
	char bLinearXPositionDrive : 1; // 0xdc
	char bLinearXVelocityDrive : 1; // 0xdc
	char bLinearYPositionDrive : 1; // 0xdc
	char bLinearYVelocityDrive : 1; // 0xdc
	char bLinearZPositionDrive : 1; // 0xdc
	char bLinearZVelocityDrive : 1; // 0xdc
	char bLinearPositionDrive : 1; // 0xdc
	char bLinearVelocityDrive : 1; // 0xdc
	FVector LinearPositionTarget; // 0xe0
	FVector LinearVelocityTarget; // 0xec
	float LinearDriveSpring; // 0xf8
	float LinearDriveDamping; // 0xfc
	float LinearDriveForceLimit; // 0x100
	char bSwingPositionDrive : 1; // 0x104
	char bSwingVelocityDrive : 1; // 0x104
	char bTwistPositionDrive : 1; // 0x104
	char bTwistVelocityDrive : 1; // 0x104
	char bAngularSlerpDrive : 1; // 0x104
	char bAngularOrientationDrive : 1; // 0x104
	char bEnableSwingDrive : 1; // 0x104
	char bEnableTwistDrive : 1; // 0x104
	char bAngularVelocityDrive : 1; // 0x105
	FQuat AngularPositionTarget; // 0x110
	EAngularDriveMode AngularDriveMode; // 0x120
	FRotator AngularOrientationTarget; // 0x124
	FVector AngularVelocityTarget; // 0x130
	float AngularDriveSpring; // 0x13c
	float AngularDriveDamping; // 0x140
	float AngularDriveForceLimit; // 0x144
};

struct FEventItemUseAINoiseEvent {
	float NoiseRange; // 0x0
	FName NoiseTag; // 0x4
};

struct FPlayerBuriedItemsMapTakenFromStoreTelemetryEvent {
	FGuid MapBundleId; // 0x0
	FGuid TakingCrewId; // 0x10
	FGuid TakingCrewSessionId; // 0x20
	FGuid MapId; // 0x30
	bool IsPlayerGenerated; // 0x40
};

struct FVoyageBaseTelemetryFragmentInput : FTelemetryFragmentInput {
	FGuid VoyageId; // 0x0
};

struct FShantyPuzzleInteractionZoneDefinition {
	FVector Location; // 0x0
	float Radius; // 0xc
	EMusicalInstrumentType RequiredMusicalInstrumentType; // 0x10
	int32_t RequiredNumInteractors; // 0x14
};

struct FEventGhostShipLevelLoaded {
	int32_t LevelId; // 0x0
};

struct FCloudDomeParameters {
	float Width; // 0x0
	float DomeToTileProportion; // 0x4
	float Height; // 0x8
	float HighPressureExtraHeight; // 0xc
	float FadeProportion; // 0x10
	float DistanceCurvatureOvershoot; // 0x14
	float DistantStreetCloudRotation; // 0x18
	float ProportionOfCloudDomeToAlwaysUpdate; // 0x1c
	int32_t SplitRemainingCloudsOverThisManyUpdates; // 0x20
	bool UpdateClosestProportionEveryOtherFrame; // 0x24
	bool EnableDistanceCurvature; // 0x25
};

struct FEventAthenaLocalPlayerSetControllerId {
	int32_t ControllerId; // 0x0
};

struct FLandscapeWeightmapUsage {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x0
};

struct FCatalogOfferCommodity {
	UCompany* RequiredEmissary; // 0x0
	FCommoditySelectionType Type; // 0x8
	ECommodityDemand Demand; // 0x10
};

struct FCustomModeInfoModel {
	FString GameModeId; // 0x0
	FString UserId; // 0x10
	FString Name; // 0x20
	FString Description; // 0x30
	FString ControllerAddress; // 0x40
	bool ProgressionEnabled; // 0x50
};

struct FRetrieveAllPiratesRequestSuccessEvent {
	FUniqueNetIdRepl UserId; // 0x0
	TArray<FPirateProfile> PirateProfiles; // 0x18
	FGuid RequestID; // 0x28
};

struct FEventOwnedPawnStartedDying {
	ECharacterDeathType DeathType; // 0x0
	AActor* Instigator; // 0x8
};

struct FRewardGroupList {
	int32_t NumRewards; // 0x0
	TArray<FRewardGroup> RewardGroups; // 0x8
};

struct FTextboxFocusRequest {
	bool ShouldFocusTextbox; // 0x0
};

struct FInterpLookupTrack {
	TArray<FInterpLookupPoint> Points; // 0x0
};

struct FFireGridCellSelection {
	int32_t NumberOfAffectedCells; // 0x0
	int32_t AdjacencyRadius; // 0x4
	float ChanceToAffectCellsAbove; // 0x8
	float ChanceToAffectCellsBelow; // 0xc
	bool TreatDiagonalsAsAdjacent; // 0x10
	bool OverrideFirePropagationTimesForAffectedCells; // 0x11
	FFloatRange SidewaysPropagationTimeOverride; // 0x14
	FFloatRange UpwardPropagationTimeOverride; // 0x24
	FFloatRange DownwardPropagationTimeOverride; // 0x34
};

struct FServerTenancyTelemetryFragment {
	FString VmId; // 0x0
	FString InstanceId; // 0x10
	FString ClusterId; // 0x20
	FString GsiId; // 0x30
};

struct FEventFriendsListChanged {
	TArray<FString> FriendsList; // 0x0
};

struct FLevelSimplificationDetails {
	bool bCreatePackagePerAsset; // 0x0
	float ProxyPixelSize; // 0x4
	FMaterialSimplificationSettings StaticMeshMaterial; // 0x8
	bool bOverrideLandscapeExportLOD; // 0x4c
	int32_t LandscapeExportLOD; // 0x50
	FMaterialSimplificationSettings LandscapeMaterial; // 0x54
	bool bRemoveDownwardFacingTriangles; // 0x98
	float CullAngleThreshold; // 0x9c
	bool bBakeFoliageToLandscape; // 0xa0
	bool bBakeGrassToLandscape; // 0xa1
	bool bGenerateMeshNormalMap; // 0xa2
	bool bGenerateMeshMetallicMap; // 0xa3
	bool bGenerateMeshRoughnessMap; // 0xa4
	bool bGenerateMeshSpecularMap; // 0xa5
	bool bGenerateLandscapeNormalMap; // 0xa6
	bool bGenerateLandscapeMetallicMap; // 0xa7
	bool bGenerateLandscapeRoughnessMap; // 0xa8
	bool bGenerateLandscapeSpecularMap; // 0xa9
};

struct FProjectileWeaponFiredTelemetryEvent {
	FGuid AttackId; // 0x0
	FGuid TelemetryAttackId; // 0x10
	FString DamagerType; // 0x20
	FString WeaponName; // 0x30
	bool WasLoaded; // 0x40
	bool WasAiming; // 0x41
	float RequesterLatencyMs; // 0x44
	float RequesterTimeOffset; // 0x48
};

struct FShowDeedProgressEvent {
	FDeedProgressDesc DeedProgressDesc; // 0x0
};

struct FVolcanoTargetChances {
	float OnTarget; // 0x0
	float NearMiss; // 0x4
	float Random; // 0x8
	FWeightedProbabilityRange OnTargetNumExtraShots; // 0x10
	FWeightedProbabilityRange NearMissNumExtraShots; // 0x30
	float CoolDownDuration; // 0x50
};

struct FLoadoutRepairTelemetryEventBase {
	int32_t PirateSeed; // 0x0
};

struct FBuriedBuriable {
	FVector Location; // 0x18
	float Radius; // 0x24
};

struct FTakeMapFromContainerRPC : FBoxedRpc {
	FNetSubObjectPtr Container; // 0x10
	FGuid MapToTake; // 0x24
};

struct FNonVerbalPhraseData {
	FText TextToBroadcast; // 0x0
	bool RequiresWieldedItemObjectNameAsArgument; // 0x38
	bool WieldedItemObjectNameIsNotLocalised; // 0x39
};

struct FGetCampfiresDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FCampfireStateData> Data; // 0x8
};

struct FGameplayAbilityRepAnimMontage {
	UAnimMontage* AnimMontage; // 0x0
	float PlayRate; // 0x8
	float Position; // 0xc
	float BlendTime; // 0x10
	char NextSectionID; // 0x14
	char IsStopped : 1; // 0x15
	char ForcePlayBit : 1; // 0x15
	FPredictionKey PredictionKey; // 0x18
};

struct FEventFinishedSpawning {
	ECharacterType SpawnType; // 0x10
};

struct FEventStatueThreatWasDamaged {
	FImpactDamageEvent ImpactDamageEvent; // 0x0
};

struct FAthenaAnimationObjectMeleeV2 {
	TArray<FAthenaAnimationObjectComplexOneShot> ComboAttacks; // 0x0
	TArray<FAthenaAnimationObjectComplexOneShot> ComboAttacksStatic; // 0x10
	TArray<FAthenaAnimationObjectComplexOneShot> SwimmingComboAttacks; // 0x20
	FAthenaAnimationObjectComplexOneShot HeavyAttack; // 0x30
	FAthenaAnimationObjectComplexOneShot SwimmingHeavyAttack; // 0x58
	TArray<FAthenaAnimationObjectMeleeV2SpecialAttack> SpecialAttacks; // 0x80
	UAnimSequence* BlockingMainInto; // 0x90
	UAnimSequence* BlockingIntoFromCombat; // 0x98
	UBlendSpace* BlockingMainBlendSpace; // 0xa0
	TArray<UAnimSequence*> BlockingFeedbackSequences; // 0xa8
	UAnimSequence* BlockingOut; // 0xb8
	UAnimSequence* BlockingMainIntoSwimming; // 0xc0
	UBlendSpace* BlockingMainBlendSpaceSwimming; // 0xc8
	TArray<UAnimSequence*> BlockingFeedbackSequencesSwimming; // 0xd0
	UAnimSequence* BlockingOutSwimming; // 0xe0
	FAthenaAnimationObjectJumpingAnimations BlockingJump; // 0xe8
	UBlendSpace* CombatLocomotion; // 0x108
	UAnimSequence* CombatLocomotionTurningLeft; // 0x110
	UAnimSequence* CombatLocomotionTurningRight; // 0x118
	UAnimSequence* CombatLocomotionTurnOut; // 0x120
	UBlendSpace* Dodge; // 0x128
	UBlendSpace* LungeWarmupLocomotion; // 0x130
	char AttacksRespectFullBodyFlag : 1; // 0x138
};

struct FTaleQuestToggledDefinition {
	FName FeatureToggle; // 0x0
	UObject* Definition; // 0x8
};

struct FSupplementalLoadout {
	FName Feature; // 0x0
	FStringAssetReference LoadoutAsset; // 0x8
};

struct FWaterSimPlane {
	UWaterId* WaterId; // 0x0
	UObject* WaterOwner; // 0x8
	FPlane NonFFTPlane; // 0x10
	bool bUseFFT; // 0x20
	bool bActive; // 0x21
	float FFTBasePlaneHeight; // 0x24
};

struct FDestructibleSpecialHierarchyDepths {
	int32_t SupportDepth; // 0x0
	int32_t MinimumFractureDepth; // 0x4
	bool bEnableDebris; // 0x8
	int32_t DebrisDepth; // 0xc
	int32_t EssentialDepth; // 0x10
};

struct FRemoveFogBankData {
	int32_t ActorId; // 0x0
};

struct FStaticMeshActorList {
	TArray<AStaticMeshActor*> Actors; // 0x0
};

struct FControlPulleyActionStateParams : FControlObjectActionStateParams {
	FLookAtOffsetParams LookAtOffsetParams; // 0x18
};

struct FPlayCutsceneNetworkEvent : FBoxedRpc {
	UCutsceneComponent* TargetComponent; // 0x10
	int32_t GroupIdx; // 0x18
	int32_t PoolIdx; // 0x1c
	int32_t VariantIdx; // 0x20
};

struct FWalletBalance {
	TArray<FWalletBalanceItem> Balances; // 0x0
};

struct FClothingChestUnequipClothingEvent {
	UClothingDesc* Desc; // 0x0
};

struct FShowInviteErrorModalEvent {
	FString Message; // 0x0
};

struct FExistingNPCToPhasedNPC {
	UClass* ExistingNPC; // 0x0
	UClass* PhasedNPC; // 0x20
};

struct FEventUseAlternateIdle {
	bool UseAlternateIdle; // 0x0
};

struct FFireCellStateTimingParams {
	FFloatRange KindleTime; // 0x0
	FFloatRange BurningTime; // 0x10
	FFloatRange RainExposureTime; // 0x20
	float CharringTime; // 0x30
	FFloatRange SmoulderingTime; // 0x34
	FFloatRange SteamingTime; // 0x44
	FFloatRange WetTime; // 0x54
	FFloatRange SidewaysPropagationTime; // 0x64
	FFloatRange UpwardPropagationTime; // 0x74
	FFloatRange DownwardPropagationTime; // 0x84
};

struct FEventReceiveAmmoStoreComponentState {
	UAmmoStoreComponent* Source; // 0x0
};

struct FLandmarkTreasureLocationEntry {
	FString LandmarkName; // 0x0
	TArray<FVector> Locations; // 0x10
};

struct FDistanceThrottledRandomParticleSystemPickerSurfaceTypeEntry {
	EPhysicalSurface SurfaceType; // 0x0
	FRandomParticleSystemPicker Effect; // 0x8
};

struct FBlendAdditiveValues {
	float HandAdditiveBlendValueON; // 0x0
	float HandAdditiveBlendValueOFF; // 0x4
	float FullBodyAdditiveBlendValueON; // 0x8
	float FullBodyAdditiveBlendValueOFF; // 0xc
};

struct FEventPetReactCancellation {
	AActor* ReactSource; // 0x0
	FName ReactId; // 0x8
};

struct FBeaconStateData : FActorStateData {
	EFlameOfFateType FlameOfFate; // 0x20
	bool IsLit; // 0x21
};

struct FEventUserGameSettingsFloatChanged {
	FName KeyName; // 0x0
	float Value; // 0x8
};

struct FLargeSessionServerEncounterDevTelemetryEvent {
	FString InitiatingUserId; // 0x0
	FString EncounteredUserId; // 0x10
	bool TaskSucceeded; // 0x20
};

struct FMovieSceneEventSectionData {
	TArray<float> KeyTimes; // 0x0
	TArray<FEventPayload> KeyValues; // 0x10
};

struct FEnvBoolParam : FEnvBoolParam_DEPRECATED {
	bool Value; // 0x0
	FName ParamName; // 0x4
};

struct FActiveForceFeedbackEffect {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x0
};

struct FCommodityDescWithRedeemId {
	FCommoditySelectionType RedeemId; // 0x0
	UItemDesc* RedeemItemDesc; // 0x8
};

struct FAnimNode_BlendListByInt : FAnimNode_BlendListBase {
	int32_t ActiveChildIndex; // 0xa8
};

struct FVaultKeyMapping {
	UItemDesc* VaultKey; // 0x0
	UItemDesc* VaultMedallion; // 0x8
};

struct FInventoryInteractionStowAllRequestEvent {
	FString ItemDesc; // 0x0
};

struct FAIShipSkeletonSkillsetOverride {
	FName SpawnLocationType; // 0x0
	FStringAssetReference Skillset; // 0x8
};

struct FHullDamageNamedParamSet {
	FName Name; // 0x0
	FHullDamageParamSet Params; // 0x10
};

struct FPlayerActionBaseTelemetryFragment {
	FString ObjectId; // 0x0
	FString ActionName; // 0x10
};

struct FTreasureSpawnedTelemetryEvent {
	FGuid BootyId; // 0x0
	EBootyTypes BootyType; // 0x10
	FString Rarity; // 0x18
	ESpawnedItemSource Source; // 0x28
	FString SourceId; // 0x30
	FVector TreasureLocation; // 0x40
};

struct FStaticMeshSourceModel {
	FMeshBuildSettings BuildSettings; // 0x0
	FMeshReductionSettings ReductionSettings; // 0x40
	FSimplygonRemeshingSettings RemeshingSettings; // 0x98
	int32_t OverriddenLightMapRes; // 0xe8
	float LODDistance; // 0xec
	float ScreenSize; // 0xf0
	float MaxDeviation; // 0xf4
};

struct FAthenaAnimationObjectActionOneShotPlayingStructPitchOverride {
	UBlendSpace1D* Action; // 0x0
	UBlendSpace1D* ActionVariant1; // 0x8
	UBlendSpace1D* ActionVariant2; // 0x10
	UBlendSpace1D* ActionVariant3; // 0x18
	UBlendSpace1D* ActionVariant4; // 0x20
};

struct FTestSerializationObject {
	bool TestBool; // 0x0
	int32_t TestInt; // 0x4
	FString TestString; // 0x8
	FGuid TestGuid; // 0x18
};

struct FSteamAccountLinkRequest {
	FString NetworkToken; // 0x0
	FString NetworkAppId; // 0x10
	FString AppId; // 0x20
};

struct FClientReachedInGameTelemetryEvent {
	FGuid PlayerGameId; // 0x0
	FString SessionType; // 0x10
	FGuid MatchmakingAttemptId; // 0x20
};

struct FCompanySkillsetProgressions {
	UCompany* Company; // 0x0
	FTargetSkillsetProgressionPair TargetSkillsets; // 0x8
};

struct FSerialisedConstructionInfoStore {
	FSerialisedActionStateInfo SerialisedConstructionInfo[0x5]; // 0x0
};

struct FSwimmingCreatureMovementReplicatedData {
	FVector CurrentServerGoalLocation; // 0x0
	FRotationUpdateResult CurrentServerRotationData; // 0xc
	float CurrentServerMaxSpeed; // 0x24
	float CurrentServerVelocitySmoothingFactor; // 0x28
	bool CurrentServerIsSharkArcCorrectionTurn; // 0x2c
};

struct FGameplayTag {
	FName TagName; // 0x0
};

struct FWaterSpout {
	FTransform SpoutLocatorTransform; // 0x0
	UParticleSystemComponent* SpoutParticleSystem; // 0x30
	UParticleSystemComponent* SplashParticleSystem; // 0x38
};

struct FSingleAnimationPlayData {
	UAnimationAsset* AnimToPlay; // 0x0
	UVertexAnimation* VertexAnimToPlay; // 0x8
	char bSavedLooping : 1; // 0x10
	char bSavedPlaying : 1; // 0x10
	float SavedPosition; // 0x14
	float SavedPlayRate; // 0x18
};

struct FROscillator {
	FFOscillator Pitch; // 0x0
	FFOscillator Yaw; // 0xc
	FFOscillator Roll; // 0x18
};

struct FAthenaAnimationWheel {
	FSocketId LeftHandMaleSocket; // 0x0
	FSocketId RightHandMaleSocket; // 0x20
	FSocketId LeftHandFemaleSocket; // 0x40
	FSocketId RightHandFemaleSocket; // 0x60
	float TranslationStrength; // 0x80
	float RotationStrength; // 0x84
	float BlendInSpeed; // 0x88
	float BlendOutSpeed; // 0x8c
	FHandOnWheelAnimationRanges HandOnWheelAnimationRanges; // 0x90
	FWheelIKActivationRanges WheelArmIKDownWithinRange; // 0xd0
	EWheelAnimationType WheelAnimationType; // 0x110
	float WheelTime; // 0x114
	float WheelDirection; // 0x118
	float RightFingerAlpha; // 0x11c
	float LeftFingerAlpha; // 0x120
	float FullBodyAlpha; // 0x124
	float WheelDockingHandClaspAlpha; // 0x128
	bool LeftWheelArmDown; // 0x12c
	bool RightWheelArmDown; // 0x12d
	AActor* ControlledObject; // 0x130
};

struct FMastSailAngleChangedEvent {
	float Angle; // 0x0
	float DeltaTime; // 0x4
	float SailTurnRate; // 0x8
};

struct FCanvasWorldMapGeneric {
	AActor* MarkerActor; // 0x0
	UTexture* Icon; // 0x8
	FVector Location; // 0x10
};

struct FNavAgentSelector {
	char bSupportsAgent0 : 1; // 0x0
	char bSupportsAgent1 : 1; // 0x0
	char bSupportsAgent2 : 1; // 0x0
	char bSupportsAgent3 : 1; // 0x0
	char bSupportsAgent4 : 1; // 0x0
	char bSupportsAgent5 : 1; // 0x0
	char bSupportsAgent6 : 1; // 0x0
	char bSupportsAgent7 : 1; // 0x0
	char bSupportsAgent8 : 1; // 0x1
	char bSupportsAgent9 : 1; // 0x1
	char bSupportsAgent10 : 1; // 0x1
	char bSupportsAgent11 : 1; // 0x1
	char bSupportsAgent12 : 1; // 0x1
	char bSupportsAgent13 : 1; // 0x1
	char bSupportsAgent14 : 1; // 0x1
	char bSupportsAgent15 : 1; // 0x1
};

struct FContestRequestScoreBoardData : FNetworkEventStruct {
	UScriptStruct* Type; // 0x8
};

struct FEmblemRuntimeDefinition {
	UPopUpMessageDesc* UnlockPopUp; // 0x130
	UPopUpAudioDesc* UnlockPopUpAudioOverrides; // 0x138
};

struct FTunnelOfTheDamnedInstance {
	TScriptInterface<Class> Locator; // 0x0
	TScriptInterface<Class> ActiveInstance; // 0x10
};

struct FDestroyingUnsafeWreckEvent {
	FVector Location; // 0x0
	FGuid CrewId; // 0xc
	bool IsCustomWreck; // 0x1c
};

struct FAthenaAnimationActionRelevancy {
	bool UsePrimary; // 0x0
	bool UsePrimaryAlt; // 0x1
	bool UseSecondary; // 0x2
	bool UseSecondaryAlt; // 0x3
};

struct FCrewWinEvent {
	EContestScoreId ScoreId; // 0x0
	FGuid CrewId; // 0x4
	int32_t CrewScore; // 0x14
	EScoreReason ReasonForScoring; // 0x18
};

struct FCutsceneTriggerEditorOnlyData {
	bool AlwaysShowCutsceneName; // 0x0
	bool AlwaysShowShapeComponentOutlines; // 0x1
	bool PrintStateChangesToScreen; // 0x2
};

struct FAthenaAnimationSitting {
	FAthenaAnimationSittingAnimData SittingAnimData; // 0x0
	bool AnimationLoaded; // 0x10
	UAthenaAnimationSittingDataAsset* SittingDataAsset; // 0x18
};

struct FSkeletalMeshLODInfo {
	float ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	TArray<int32_t> LODMaterialMap; // 0x8
	TArray<FTriangleSortSettings> TriangleSortSettings; // 0x18
	char bHasBeenSimplified : 1; // 0x28
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x30
	FSimplygonRemeshingSettings RemeshingSettings; // 0xa0
};

struct FKrakenAnimatedTentacleStateAnimationMapping {
	UKrakenAnimatedTentacleState* State; // 0x0
	UAnimSequence* Animation; // 0x8
	bool Loop; // 0x10
	TArray<FKrakenAnimatedTentacleTransitionAnimation> Transitions; // 0x18
};

struct FAthenaStreamedLevelData {
	int32_t LevelId; // 0x0
	FName PackagePath; // 0x4
	TArray<ULevelStreaming*> Levels; // 0x10
	TMap<FString, FName> LevelPaths; // 0x20
};

struct FToggledSpawnerOverride {
	UAISpawner* Spawner; // 0x0
	FName Toggle; // 0x8
};

struct FConditionalHandInStat {
	FPlayerStat Stat; // 0x18
};

struct FQuestBootyItemPopUpEntry {
	FName BootyItemIdentifier; // 0x0
	UPopUpMessageDesc* PopUp; // 0x8
};

struct FFogVolumeInfo {
	UFogVolumeComponent* Component; // 0x0
	UTexture* VolumeTexture; // 0x100
	UTexture* MeshFogVolumeTexture; // 0x108
};

struct FRequestRealMoneyPurchasePremiumShopOfferEvent {
	FGuid OfferId; // 0x0
	FString CatalogName; // 0x10
};

struct FPhasedItem {
	AItemProxy* ItemProxy; // 0x0
	AItemInfo* ItemInfo; // 0x8
	bool Tracked; // 0x10
};

struct FSoundBankFailureTelemetryEntry {
	uint32_t BankID; // 0x0
	uint32_t FailureReason; // 0x4
};

struct FEventPlayerLeftIslandVicinity {
	AActor* Player; // 0x0
	FName IslandName; // 0x10
};

struct FRadialInstance {
	FText Name; // 0x8
	URadialContentRule* Content; // 0x40
	URadialAction* PrimaryAction; // 0x48
	URadialAction* SecondaryAction; // 0x50
	URadialAction* TertiaryAction; // 0x58
	URadialAction* QuaternaryAction; // 0x60
	URadialManagerInputComponent* InputComponent; // 0x68
	URadialInputBinder* RadialInputBinder; // 0x70
	bool ShouldActionsUpdateWhenContextChanges; // 0x90
	bool ShouldContentUpdateWhenContextChanges; // 0x91
	bool ShouldRadialCloseWhenWieldingNewItem; // 0x92
	bool ShouldRadialCloseWhenStowingWieldedItem; // 0x93
};

struct FRewindPhysicsServiceEntry {
	URewindComponent* Rewindable; // 0x0
};

struct FPromptCountersModel {
	TMap<FString, int32_t> PromptCounters; // 0x0
};

struct FActionStatePriorityRelationship {
	UActionStateId* State; // 0x0
	EActionStatePriority Priority; // 0x8
};

struct FCrewSessionBaseSessionTelemetryEvent : FCrewSessionBaseTelemetryEvent {
	FCrewSessionTelemetry Session; // 0x10
};

struct FTreasureLocationData {
	FVector WorldSpaceLocation; // 0x0
	FVector IslandSpaceLocation; // 0xc
	FVector2D MapSpaceLocation; // 0x18
};

struct FGenericNotificationUIEvent {
	TArray<FText> Text; // 0x0
	TArray<FString> Images; // 0x10
	FString Background; // 0x20
	TArray<FString> FlagIcons; // 0x30
	FGenericPopupAudioDescriptor Audio; // 0x40
	TArray<EStyleModifiers> StyleModifiers; // 0x80
	bool OnlyPlayAudio; // 0x90
	bool PlayAudio; // 0x91
	float HoldDuration; // 0x94
	int32_t Multiplier; // 0x98
};

struct FEventKrakenDespawned {
	EKrakenDespawnReason DespawnReason; // 0x0
};

struct FRowboatStrainDamageData {
	float StormDamageScalar; // 0x0
	float WaterStrengthToCountAsStorm; // 0x4
	float StormStrengthThresholdForDamage; // 0x8
	float MinStormDamageFrequencyInSeconds; // 0xc
	float MaxStormDamageFrequencyInSeconds; // 0x10
	float WorldEdgeDamageScalar; // 0x14
	float MinWorldEdgeDamageFrequencyInSeconds; // 0x18
	float MaxWorldEdgeDamageFrequencyInSeconds; // 0x1c
};

struct FAssetAuditConstants {
	TArray<FAssetAuditConstantEntry> AssetAuditConstants; // 0x0
};

struct FEventFallWithDamageLegNotBroken {
	FName RumbleTag; // 0x0
};

struct FCollectorsChestStoredItemInfo {
	AItemInfo* ItemInfo; // 0x0
	TWeakObjectPtr<USceneComponent> SourceAttachParent; // 0x8
	FName SourceAttachSocket; // 0x10
	int64_t ItemStoreTimestamp; // 0x18
	FItemSnapshot StoredItemSnapshot; // 0x20
};

struct FCollectorsChestMetaWrapper : FItemMetaBase {
	TArray<FItemSnapshot> StoredItemSnapshots; // 0x18
};

struct FAthenaAnimationSkeletonSensingParams {
	TArray<FAthenaAnimationSkeletonSensingAnimations> AllLoadedAISensingAnimations; // 0x0
	ESkeletonSensingState CurrentSensingState; // 0x10
	UAnimSequence* InitialReactionAnimation; // 0x18
	UBlendSpace1D* SearchingAnimation; // 0x20
	UAnimSequence* AlertingOthersAnimation; // 0x28
	UBlendSpace1D* PursuitAnimation; // 0x30
};

struct FEventNamedProgressLocationCreated {
	AProgressSpawnLocation* SpawnLocation; // 0x0
};

struct FEventReceiveQuestBookPagesInContainerComponentState {
	UQuestBookPagesInContainerComponent* Source; // 0x0
};

struct FServerMigrationTelemetryActorData {
	UClass* ActorClass; // 0x0
	int32_t Count; // 0x20
};

struct FTaleActorSpawnParameters {
	bool Tracked; // 0x0
	bool GatherForMigration; // 0x1
	bool DeferredSpawning; // 0x2
};

struct FDestroyMysteriousNoteData {
	int32_t PlayerNetGUID; // 0x0
	FGuid NoteGUID; // 0x4
};

struct FClothPhysicsProperties {
	float BendResistance; // 0x0
	float ShearResistance; // 0x4
	float StretchLimit; // 0x8
	float Friction; // 0xc
	float Damping; // 0x10
	float Drag; // 0x14
	float GravityScale; // 0x18
	float InertiaBlend; // 0x1c
	float SelfCollisionThickness; // 0x20
};

struct FCrewMutePlayerChatEvent {
	FString XUID; // 0x0
	bool IsMuted; // 0x10
};

struct FAITypeData {
	FName AITypeName; // 0x0
	FStringClassReference AIPawnClass; // 0x8
	FStringAssetReference DefaultDebugSkillset; // 0x18
	FStringAssetReference DefaultDebugLoadout; // 0x28
	UAIClassId* DefaultDebugAIClassId; // 0x38
	bool RequireNavMesh; // 0x40
	int32_t AIRegionCostUnits; // 0x44
	int32_t AIWorldCostUnits; // 0x48
	FName FeatureToggle; // 0x4c
};

struct FQuestVariableActorAssetTypeArray : FQuestVariable {
	FName ParamName; // 0x8
};

struct FTestActionStateSerialisableData : FActionStateSerialisableData {
	int32_t IntProp; // 0x30
};

struct FInviteFriendRequest {
	FString XUID; // 0x0
	EPlatformId Platform; // 0x10
};

struct FVisibleSessionTypeSelectionResponseEvent {
	ESessionVisibility SessionVisibility; // 0x0
	ECrewSessionType SessionType; // 0x1
	EPlayMode SelectedPlayMode; // 0x2
	ESessionGrouping SessionGrouping; // 0x3
	ESessionStyle SessionStyle; // 0x4
};

struct FKrakenServiceSpawnParams {
	float SpawnLocationDistributionRadius; // 0x0
	float SpawnLocationDistributionMinDistanceBetweenPoints; // 0x4
	float SpawnDistanceInFrontOfShip; // 0x8
	FWeightedProbabilityRangeOfRanges TimeBetweenSpawnAttemptsRange; // 0x10
	FWeightedProbabilityRangeOfRanges TimeBetweenSpawnAttemptsPostSpawnFailure; // 0x40
	float SpawnChance; // 0x70
	int32_t MaxConsecutiveFailedSpawnAttempts; // 0x74
	UEnvQuery* SpawnLocationQuery; // 0x78
};

struct FIPGCompatibleSet {
	FName SetName; // 0x0
};

struct FVolcanoSetupDataEmbersEntry {
	float MaxDistanceInMetres; // 0x0
	UObject* Effect; // 0x8
};

struct FLayerActorStats {
	UObject* Type; // 0x0
	int32_t Total; // 0x8
};

struct FPirateCreationEvent_UserConfirmationResponse {
	bool ShouldSavePirate; // 0x0
};

struct FTestInvalidStringMapSerializationObject {
	TMap<int32_t, FString> StringMap; // 0x0
};

struct FIndividualMeshConsumer {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x18
	TArray<UMaterialInterface*> OverrideFallbackMaterials; // 0x28
};

struct FGameplayEffectAttributeCaptureSpec {
	FGameplayEffectAttributeCaptureDefinition BackingDefinition; // 0x0
};

struct FNPCCustomAnimationBlueprintData {
	bool SequenceActive; // 0x0
	bool LoopActive; // 0x1
	int32_t ActiveSequenceIndex; // 0x4
	bool IsOneShot; // 0x8
	FNPCCustomAnimationBlueprintPlayingAnimations BlueprintPlayingAnimations; // 0x10
	FNPCCustomAnimationBlueprintPlayingMontage BlueprintPlayingFacialMontages; // 0x38
	ENPCCustomAnimationState CustomAnimationState; // 0x60
};

struct FFriendsListResponse {
	TArray<FFriendViewModel> Friends; // 0x0
};

struct FCompanyReputationProgressModelCollection {
	TArray<FCompanyReputationProgressModel> CompanyProgress; // 0x0
};

struct FAthenaAnimationMountedWeapon {
	bool IsFiring; // 0x0
	float Pitch; // 0x4
	float Yaw; // 0x8
	AActor* ControlledObject; // 0x10
};

struct FTakeAllItemsFromContainerRPC : FBoxedRpc {
	FNetSubObjectPtr Container; // 0x10
	int32_t IndexToTake; // 0x24
};

struct FIntentPredictorParams {
	float MaxError; // 0x0
	float MinError; // 0x4
	float MinCorrectionVelocity; // 0x8
	float MinValue; // 0xc
	float MaxValue; // 0x10
	bool WrapCorrectionToValueRange; // 0x14
};

struct FSeaClueCreationChoice {
	UClueSiteType* SiteType; // 0x0
	USeaClueCreator* ClueCreator; // 0x8
};

struct FInterpCurvePointFloat {
	float InVal; // 0x0
	float OutVal; // 0x4
	float ArriveTangent; // 0x8
	float LeaveTangent; // 0xc
	EInterpCurveMode InterpMode; // 0x10
};

struct FEventWieldableItemDropped {
	UItemCategory* DroppedItemCategory; // 0x0
	AActor* ContactActor; // 0x8
	float DropDistance; // 0x10
	bool InDeepWater; // 0x14
};

struct FAIFormDamageResponse {
	UDamagerType* DamagerType; // 0x0
	float DamageMultiplier; // 0x8
	ECharacterHitReactionAnimType HitReaction; // 0xc
	bool IsKnockbackDisabled; // 0xd
	bool IsStunDisabled; // 0xe
};

struct FAITargetBounds {
	FVector Offset; // 0x0
	FVector Extents; // 0xc
};

struct FSnapshottedActorData {
	TScriptInterface<Class> Instagator; // 0x0
	FGuid SnapshotID; // 0x10
	bool ActorWasCritical; // 0x20
	bool ActorWasTracked; // 0x21
	FText FailureMessage; // 0x28
};

struct FContestMapCrewData {
	FGuid CrewId; // 0x0
	bool IsLocalCrew; // 0x10
	UTexture* CrewIcon; // 0x18
	UTexture* ScoreIcon; // 0x20
	UTexture* UnderlineIcon; // 0x28
	FName CrewName; // 0x30
	int32_t Score; // 0x38
};

struct FPlayerBaseTelemetryFragment {
	FGuid PlayerGameId; // 0x0
	FString UserId; // 0x10
	FString PirateId; // 0x20
	char PlatformId; // 0x30
	FString DeviceID; // 0x38
};

struct FMemberReference {
	UObject* MemberParent; // 0x0
	FString MemberScope; // 0x8
	FName MemberName; // 0x18
	FGuid MemberGuid; // 0x20
	bool bSelfContext; // 0x30
	bool bWasDeprecated; // 0x31
};

struct FShipBaseTelemetryFragment {
	FString ShipObjectId; // 0x0
	FVector Position; // 0x10
	FGuid CrewId; // 0x1c
	FGuid CrewSessionId; // 0x2c
	FGuid ShipId; // 0x3c
	FString ShipSize; // 0x50
};

struct FRadialActionBindings {
	FName PrimaryActionKeyBinding; // 0x0
	FName SecondaryActionKeyBinding; // 0x8
	FName TertiaryActionKeyBinding; // 0x10
	FName QuaternaryActionKeyBinding; // 0x18
};

struct FAnimControlTrackKey {
	float StartTime; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	float AnimStartOffset; // 0x10
	float AnimEndOffset; // 0x14
	float AnimPlayRate; // 0x18
	char bLooping : 1; // 0x1c
	char bReverse : 1; // 0x1c
};

struct FShipHullLandscapeDamageEntry {
	EPhysicalSurface PhysicalSurface; // 0x0
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x8
	FInt32Range NumZonesToDamage; // 0x10
	FInt32Range DamageLevel; // 0x20
};

struct FVoyageProposalCompletedNetworkEvent : FNetworkEventStruct {
	TArray<FString> VoyageProposalIds; // 0x10
};

struct FIInventoryItemDescription {
	FString ThumbnailImageUrl; // 0x0
	FString PreviewImageUrl; // 0x10
	FString DisplayName; // 0x20
	FString Description; // 0x30
	FString ItemDesc; // 0x40
	UItemDesc* DescKey; // 0x50
};

struct FAggressiveGhostShipLocationEntryDesc {
	float Weight; // 0x0
	UAggressiveGhostShipLocationDataAsset* Location; // 0x8
};

struct FAthenaAnimationFirstPersonTurnDelayStates {
	FAthenaAnimationFirstPersonTurnDelay PassiveState; // 0x0
	FAthenaAnimationFirstPersonTurnDelay ContinuousUse; // 0xc
	float TurnDelayAngle; // 0x18
	float InvTurnDelayAngle; // 0x1c
};

struct FPlayerJoinCrewInProgressRequestMessage {
	FGuid CrewId; // 0x0
	FUniqueNetIdRepl UserId; // 0x10
	FString PirateId; // 0x28
	ECrewSessionType SessionType; // 0x38
};

struct FPlayerVoyageProposalVoteTelemetryEvent {
	FGuid VoyageProposalSessionId; // 0x0
	int32_t VoyageProposalSlot; // 0x10
	FString VoyageProposalEntitlementId; // 0x18
};

struct FBeingRetractedActionStateConstructionInfo : FActorActionStateConstructionInfo {
	USceneComponent* RetractingComponent; // 0x30
};

struct FShipCustomizationChestUnequipShipCustomizationEvent {
	UShipCustomizationDesc* Desc; // 0x0
};

struct FVector4 {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
	float W; // 0xc
};

struct FWheelSnapshot {
	float Angle; // 0x0
	float MaxAngle; // 0x4
};

struct FRevivedActionStateConstructionInfo : FActorActionStateConstructionInfo {
	TWeakObjectPtr<AActor> ActorOwner; // 0x28
};

struct FDynamicMaterialsList {
	TArray<TWeakObjectPtr<UMaterialInstanceDynamic>> Materials; // 0x0
};

struct FReplicatedFireCellCharringData {
	float MaxCharringTime; // 0x0
	TArray<float> TimeSpentCharring; // 0x8
};

struct FAudioDataTelemetryFragment {
	uint32_t WwiseDefaultPoolMemoryUsage; // 0x0
	uint32_t WwiseTotalMemoryUsage; // 0x4
	uint32_t WwiseTotalMediaMemoryUsage; // 0x8
	uint32_t TritonMemoryUsage; // 0xc
	uint8_t WwiseKWeightedOutput; // 0x10
	uint32_t OutputClippingCount; // 0x14
	uint8_t NonUIBusKWeightedOutput; // 0x18
	TArray<uint32_t> WwiseStateGroups; // 0x20
	TArray<uint32_t> WwiseStateValues; // 0x30
	TArray<uint32_t> PeakProxyCountsPools; // 0x40
	TArray<uint32_t> PeakProxyCounts; // 0x50
	TArray<uint32_t> StreamFindFailedIDs; // 0x60
	TArray<uint32_t> StreamOpenFailedIDs; // 0x70
	TArray<uint32_t> StreamReadFailedIDs; // 0x80
	TArray<FSoundBankFailureTelemetryEntry> FailedToLoadBankIDs; // 0x90
	uint32_t FailedPostEventCount; // 0xa0
	uint32_t IODeviceMemUsage; // 0xa4
	uint32_t PeakIOBytesRead; // 0xa8
	float AverageIOBytesPerSecondRead; // 0xac
};

struct FCompanySpecificCargoRunStats {
	UCompany* CompanyId; // 0x0
	TArray<FPlayerStat> StatsToFireUponPerfectOnTimeHandIn; // 0x8
};

struct FParticleRandomSeedInfo {
	FName ParameterName; // 0x0
	char bGetSeedFromInstance : 1; // 0x8
	char bInstanceSeedIsIndex : 1; // 0x8
	char bResetSeedOnEmitterLooping : 1; // 0x8
	char bRandomlySelectSeedArray : 1; // 0x8
	TArray<int32_t> RandomSeeds; // 0x10
};

struct FUIAdventuresDataErrorEvent {
	FString ErrorMessage; // 0x0
	FString ErrorStack; // 0x10
};

struct FAthenaAnimationHitReactsSelectedAnimations {
	UBlendSpace1D* SelectedHitReact0; // 0x0
	UBlendSpace1D* SelectedHitReactItem0; // 0x8
	UBlendSpace1D* SelectedHitReactItemAction0; // 0x10
	UBlendSpace1D* SelectedHitReactSubtle0; // 0x18
	UBlendSpace1D* SelectedHitReact1; // 0x20
	UBlendSpace1D* SelectedHitReactItem1; // 0x28
	UBlendSpace1D* SelectedHitReactItemAction1; // 0x30
	UBlendSpace1D* SelectedHitReactSubtle1; // 0x38
	UBlendSpace1D* SelectedOverrideHitReact; // 0x40
};

struct FCategorisedLoadout {
	TArray<FLoadoutCategory> ItemLoadout; // 0x0
	TArray<FLoadoutCategory> ClothingLoadout; // 0x10
	TArray<FLoadoutPetCategory> PetLoadout; // 0x20
	bool PetNamingDisallowed; // 0x30
	bool InitialLoadout; // 0x31
	FString Hash; // 0x38
};

struct FTrackedObjectiveCompletionMessage {
	FGuid ObjectiveId; // 0x0
	FPirateIdentity PirateIdentity; // 0x10
	FPlayerBaseTelemetryFragment PlayerInfo; // 0x88
	EPlayMode Playmode; // 0xd0
	EPlayModeVariant PlayModeVariant; // 0xd1
	double CreatedAt; // 0xd8
};

struct FEnterTunnelOfTheDamnedActionStateConstructionInfo : FActorActionStateConstructionInfo {
	int32_t TunnelId; // 0x30
	int32_t TunnelStreamingLevelId; // 0x34
	FTeleportLocation TeleportLocation; // 0x38
};

struct FPetReactedTelemetryEvent {
	FString ReactId; // 0x0
	EAthenaAnimationPetRoamingState AnimationState; // 0x10
};

struct FServerMigrateFromTelemetryEvent {
	FGuid MigrationId; // 0x0
};

struct FLoadingTelemetryEvent {
	FString LoadingEvent; // 0x0
	FString MapName; // 0x10
	float StartTime; // 0x20
	float EndTime; // 0x24
};

struct FCrew {
	FGuid CrewId; // 0x0
	FGuid SessionId; // 0x10
	TArray<APlayerState*> Players; // 0x20
	FCrewSessionTemplate CrewSessionTemplate; // 0x30
	FGuid LiveryID; // 0x68
	TArray<AActor*> AssociatedActors; // 0x80
};

struct FLevelMadeHiddenTelemetryEvent : FStreamingTelemetryBaseEvent {
	FString LevelName; // 0x0
	int32_t LodLevel; // 0x10
	FVector PlayerPosition; // 0x14
	float DistanceFromPlayer; // 0x20
	float DistanceFromBoundsToPlayer; // 0x24
	bool PlayerIsWaitingToSpawn; // 0x28
	bool PlayerIsTeleporting; // 0x29
};

struct FPremiumStoreOffer : FShopOffer {
	bool IsSuperPremium; // 0x1e0
	FString LockedReason; // 0x1e8
	FPremiumStoreTimeLimited TimeLimited; // 0x1f8
	FString RealMoneyPrice; // 0x200
};

struct FCatalog {
	FString DisplayName; // 0x0
	FString DisplayDescription; // 0x10
	TArray<FCatalogOffer> Offers; // 0x20
};

struct FFeaturedShipCustomisationCategory {
	UShipCustomizationCategory* Category; // 0x0
	FName Feature; // 0x8
};

struct FVfxSelectorRange {
	float MinValue; // 0x0
	float MaxValue; // 0x4
	FVfxSelectorEntry EffectParams; // 0x8
};

struct FProjectileImpactTelemetryEvent {
	FGuid AttackId; // 0x0
	FString ProjectileId; // 0x10
	FString DamagerTypeId; // 0x20
	FString InstigatorObjectId; // 0x30
	FString InstigatorObjectType; // 0x40
};

struct FDebugMenuOptionExecutedEvent {
	FString DebugMenuItemName; // 0x0
	FString ConsoleCommand; // 0x10
};

struct FAthenaAnimationObjectActionContinuousStructPitchOverride {
	UBlendSpace1D* MainInto; // 0x0
	UBlendSpace1D* MainCycleIdle; // 0x8
	UBlendSpace1D* MainCycleLocomotion; // 0x10
	TArray<UBlendSpace1D*> VariantCycleIdle; // 0x18
	bool UseMainCycleJump; // 0x28
	bool IgnoreFullBody; // 0x29
	FAthenaAnimationObjectJumpingAnimationsPitchOverride MainCycleJump; // 0x30
	UBlendSpace1D* MainOutOf; // 0x50
	FAthenaAnimationObjectActionContinuousSwimming MainSwimming; // 0x58
};

struct FStrongholdKeyInfo {
	USkellyFortGameEventType* SkellyFortEventType; // 0x0
	UItemDesc* StrongholdKey; // 0x8
};

struct FAnimNode_HandIKRetargeting : FAnimNode_SkeletalControlBase {
	FBoneReference RightHandFK; // 0x58
	FBoneReference LeftHandFK; // 0x64
	FBoneReference RightHandIK; // 0x70
	FBoneReference LeftHandIK; // 0x7c
	TArray<FBoneReference> IKBonesToMove; // 0x88
	float HandFKWeight; // 0x98
};

struct FSpeechAccessibilityModel {
	TArray<FSpeechAccessibilityProfileUser> ProfileUsers; // 0x0
};

struct FLookAtOffset {
	float LookAtPitchRate; // 0x0
	float LookAtYawRate; // 0x4
	float LookAtYawRawScale; // 0x8
	float LookAtPitchRawScale; // 0xc
};

struct FOrbitOptions {
	char bProcessDuringSpawn : 1; // 0x0
	char bProcessDuringUpdate : 1; // 0x0
	char bUseEmitterTime : 1; // 0x0
};

struct FCrewManagementEvent {
	FCrewManagementData CrewDefinition; // 0x0
};

struct FCrewSnapshotV1 {
	FGuid CrewId; // 0x0
	FString ShipSize; // 0x10
	int32_t ShipId; // 0x20
	TArray<FPlayerStateSnapshot> Players; // 0x28
	TArray<FCollectedBootySnapshot> Booty; // 0x38
};

struct FSetHealthData {
	int32_t ActorId; // 0x0
	float Health; // 0x4
	EHealthChangedReason Reason; // 0x8
};

struct FSessionCreationCrewMemberModel {
	FString XUID; // 0x0
};

struct FSirenAnimationLocomotion {
	UAnimSequence* TreadwaterSequence; // 0x0
	UAnimSequence* AggressiveTreadwaterSequence; // 0x8
	UBlendSpace1D* LongwaysLocomotionBlendSpace; // 0x10
	UBlendSpace1D* AggressiveLongwaysLocomotionBlendSpace; // 0x18
	UBlendSpace1D* AlternativeAggressiveLongwaysLocomotionBlendSpace; // 0x20
	UBlendSpace1D* LocomotionTurningAdditiveBlendSpace; // 0x28
	UBlendSpace1D* LocomotionSpinningAdditiveBlendSpace; // 0x30
	UAnimSequence* DivingFromSurfaceSequence; // 0x38
	UAnimSequence* EmergingToSurfaceSequence; // 0x40
};

struct FPlayerMusicController {
	UPlayerMusicControllerParams* PlayerMusicParams; // 0x0
	AActor* LocalPlayerActor; // 0x38
	UPlayerOceanAudioComponent* PlayerOceanAudioComponent; // 0x40
	UPlayerAtmosphericsAudioComponent* AtmosphericsAudioComponent; // 0x48
	AAthenaPlayerCharacter* AthenaPlayerCharacter; // 0x50
	AAthenaWorldSettings* AthenaWorldSettings; // 0x58
	TArray<FAudioStingRelevantShips> RelevantAudioStingShips; // 0x198
	TArray<FAudioStingShipsSpotted> AudioStingShipsSpottedRecently; // 0x1a8
};

struct FPetWieldableReactMapping {
	AWieldableItem* WieldableType; // 0x0
	FName ReactId; // 0x8
};

struct FPetDangerHearingThreatResponse {
	EPetDangerHearingResponseType Type; // 0x0
	EPetDangerHearingTarget IgnoredTarget; // 0x1
	bool InvertIgnoredTarget; // 0x2
};

struct FAISpawnCustomServerEvent : FGlobalCustomServerEvent {
	FString AIId; // 0x18
	FString AIType; // 0x28
};

struct FProposedTaleEntry {
	UVoyageDescDataAsset* TaleData; // 0x0
	AActor* ProposingObject; // 0x8
	bool CanStartTale; // 0x10
};

struct FBuoyancyComponentSinkingParams {
	float BuoyancyBlendTimeWhenSinking; // 0x0
	EBuoyancyBlend FloatingToSinkingBuoyancyCurveTransition; // 0x4
	float FloatingToSinkingBuoyancyCurveBlendTime; // 0x8
	float FinalSinkingBuoyancy; // 0xc
	float SinkingTimeUntilDestroy; // 0x10
	float DisappearingTime; // 0x14
	bool AutomaticSinkingEnabled; // 0x18
	FFloatRange TimeInFloatingStateBeforeSinking; // 0x1c
	float WaterDepthToAllowItemToSink; // 0x2c
	ECollisionChannel WorldHitsTraceChannel; // 0x30
};

struct FWorldMapSetMapLabelsRotation {
	float Rotation; // 0x0
};

struct FEmissaryEntitlementPurchasedEvent {
	FGuid OfferId; // 0x0
};

struct FCrewVoteToBrigEvent {
	FString XUID; // 0x0
};

struct FLevelStreamingStatusUpdateInfo {
	FString PackageName; // 0x0
	int32_t LODIndex; // 0x10
	char bNewShouldBeLoaded : 1; // 0x14
	char bNewShouldBeVisible : 1; // 0x14
	char bNewShouldBlockOnLoad : 1; // 0x14
};

struct FPartDesc {
	FString Name; // 0x0
	TArray<FPartCustomisation> Customisations; // 0x10
};

struct FAthenaAnimationLoadObjectsWrapper {
	FAthenaAnimationCoreObjectAnimations ObjectAnimation; // 0x0
	FAthenaAnimationPitchControlStates ObjectTargeting3rdPerson; // 0x9a0
	FAthenaAnimationFirstPersonTurnDelayStates FirstPersonTurnDelay; // 0xb08
	UWieldableItemAnimationStoreId* ObjectId; // 0xb28
};

struct FAchievementCriteria {
	FPlayerStat PlayerStat; // 0x0
	uint64_t Threshold; // 0x8
	EPlayerStatsOperator Operator; // 0x10
};

struct FAnimNode_CopyPoseFromMesh : FAnimNode_Base {
	USkeletalMeshComponent* SourceMeshComponent; // 0x30
	bool bUseAttachedParent; // 0x38
};

struct FActiveNoteData {
	TArray<FNotesRemoteServiceNoteModel> NotesRemoteServiceNoteModels; // 0x0
	TArray<FNoteCompletionEntry> PendingCompletionEntries; // 0x10
	TArray<FGuid> PendingDetailRequestIDs; // 0x20
};

struct FCannonAILocation {
	FVector Centre; // 0x0
	FVector Direction; // 0xc
};

struct FMerchantQuestContractCompleteNetworkEvent : FNetworkEventStruct {
	UPopUpMessageDesc* PopUpDesc; // 0x10
};

struct FEventFishingFishCaught {
	AActor* CaughtActor; // 0x0
};

struct FLocationGeneratorSample {
	ELocationGeneratorSampleType Type; // 0x0
	FVector Location; // 0x4
	FVector Normal; // 0x10
};

struct FTaleQuestVariableMapMarkType : FQuestVariable {
	FName ParamName; // 0x8
};

struct FDockToObjectActionStateParams {
	float DockTime; // 0x0
	float DelayAfterDockingTime; // 0x4
	float ForcedFieldOfView; // 0x8
	bool ForceStash; // 0xc
};

struct FDebugFishSelectionColour {
	int32_t ColourIndex; // 0x0
	TArray<FDebugFishSelectionSize> FishSizes; // 0x8
};

struct FVoyageWithdrawnEvent {
	APlayerState* Proposer; // 0x0
};

struct FWeightedRewardDistribution {
	TArray<FWeightedRewardEntry> RewardWeightings; // 0x0
};

struct FHitRegProjectileAttackData {
	bool HasValidData; // 0x0
	FVector AimDirection; // 0x4
	FVector AimPosition; // 0x10
	FTransform WeaponMeshTransform; // 0x20
	UObject* WeaponMesh; // 0x50
	TArray<FHitRegTrailData> ProjectileTrails; // 0x58
};

struct FItemAndReward {
	UItemDesc* ItemDesc; // 0x0
	FRewardId HandInOnTimeRewardId; // 0x8
};

struct FEventClientItemUseSpeedScaled {
	float ClientTimeStamp; // 0x0
	bool bItemUseSlowed; // 0x4
};

struct FControlWheelActionStateParams : FControlObjectActionStateParams {
	FLookAtOffsetParams LookAtOffsetParams; // 0x18
};

struct FShipSpecificData {
	UShipSize* ShipSize; // 0x0
	ULevelSequence* VignetteSequence; // 0x8
};

struct FEventSpawnedAsGhostNotification {
	FText NotificationText; // 0x0
};

struct FWeightedPetAnimation {
	UAnimSequence* Animation; // 0x0
	float Weighting; // 0x8
};

struct FRequestArmoryEquipSlotEvent {
	FString ItemDesc; // 0x0
	int32_t SlotId; // 0x10
};

struct FEventShipWaterAddedOnOffEvent {
	AActor* Ship; // 0x0
	float WaterAdded; // 0x8
	float PrevWaterAdded; // 0xc
};

struct FBox {
	FVector Min; // 0x0
	FVector Max; // 0xc
	char IsValid; // 0x18
};

struct FPremiumStoreTimeLimited {
	bool Item; // 0x0
	bool Price; // 0x1
};

struct FCategorySpec {
	UItemCategory* ItemCategory; // 0x0
	TArray<UItemCategory*> FallbackCategories; // 0x8
	FString DefaultSlotIconURL; // 0x18
};

struct FActivateEmissaryForCrew {
	FGuid SessionId; // 0x0
	FName Company; // 0x10
	FGuid AssociatedCrew; // 0x18
};

struct FTTEventTrack : FTTTrackBase {
	UCurveFloat* CurveKeys; // 0x10
};

struct FCrewScoreAppendedEvent {
	EContestScoreId ScoreId; // 0x0
	FGuid CrewId; // 0x4
	int32_t CrewScore; // 0x14
	EScoreReason ScoreReason; // 0x18
	FStringAssetReference ScoringIconAssetReference; // 0x20
};

struct FRadialActionGroup {
	URadialAction* PrimaryAction; // 0x0
	URadialAction* SecondaryAction; // 0x8
	URadialAction* TertiaryAction; // 0x10
	URadialAction* QuaternaryAction; // 0x18
};

struct FBootyItemDroppedOnShipEvent {
	AActor* Ship; // 0x0
	AItemInfo* ItemOnShip; // 0x8
	bool FirstTimeDroppedOnOwnOrAnotherShipByCrew; // 0x10
};

struct FRequestSilverEvent {
	FGuid CrewId; // 0x0
	AWieldableItem* WieldableItemSold; // 0x10
};

struct FDebugStoryInfoModelSchedule {
	TArray<FStoryInfoModel> Stories; // 0x0
	FTimespan RepeatDuration; // 0x10
	FTimespan RepeatDelay; // 0x18
	bool AlwaysRelevant; // 0x20
};

struct FStartUpdatingShipAnnouncementVisibility {
	ACharacter* Character; // 0x0
};

struct FLightmassLightSettings {
	float IndirectLightingSaturation; // 0x0
	float ShadowExponent; // 0x4
	bool bUseAreaShadowsForStationaryLight; // 0x8
};

struct FAnimUpdateRateParameters {
	int32_t UpdateRate; // 0x4
	int32_t EvaluationRate; // 0x8
	bool bInterpolateSkippedFrames; // 0xc
	bool bSkipUpdate; // 0xd
	bool bSkipEvaluation; // 0xe
	float TickedPoseOffestTime; // 0x10
	float AdditionalTime; // 0x14
	int32_t BaseNonRenderedUpdateRate; // 0x1c
	TArray<float> BaseVisibleDistanceFactorThesholds; // 0x28
};

struct FEventShipAddedToCrew {
	FGuid CrewId; // 0x0
	AActor* ShipActor; // 0x10
};

struct FQuestVariableActorAssetType : FQuestVariable {
	FName ParamName; // 0x8
};

struct FAthenaAnimationObjectJumpingAnimationsPitchOverride {
	UBlendSpace1D* Start; // 0x0
	UBlendSpace1D* Cycle; // 0x8
	UBlendSpace1D* PreImpact; // 0x10
	UBlendSpace1D* LandLight; // 0x18
};

struct FRopeCatenaryShapeParams {
	FRopeCatenaryLengthParams Length; // 0x0
	FRopeCatenarySlopeBlendParams Slope; // 0x10
};

struct FRopeStyleParams {
	UStaticMesh* Mesh; // 0x0
	UTexture2D* DiffuseTexture; // 0x8
	UTexture2D* NormalTexture; // 0x10
	int32_t ShadowLOD; // 0x18
};

struct FShipOnFireEndCustomServerEvent : FGlobalCustomServerEvent {
	FString ShipId; // 0x18
};

struct FAIShipEncounterZoneEnteredNetworkEvent : FNetworkEventStruct {
	int32_t RemainingAIShips; // 0x10
	int32_t TotalAIShips; // 0x14
	int32_t TotalAIShipsInFinalWave; // 0x18
};

struct FNPCOnSurfaceCannonManagerCannon {
	ACannon* Cannon; // 0x0
	FTransform NearestLocation; // 0x10
};

struct FQuestVariablePrioritisedPrompt : FQuestVariable {
	FName ParamName; // 0x8
};

struct FRevivePlayerActionStateConstructionInfo : FActorActionStateConstructionInfo {
	FNetActorPtr CharacterReviving; // 0x30
	FNetSubObjectPtr CharacterBeingRevived; // 0x44
	UNotificationInputId* InputID; // 0x58
};

struct FInlineEditableTextBlockStyle : FSlateWidgetStyle {
	FEditableTextBoxStyle EditableTextBoxStyle; // 0x8
	FTextBlockStyle TextStyle; // 0x868
};

struct FMerchantCrateSfx {
	UWwiseEvent* EquipSfx; // 0x0
	UWwiseEvent* UnequipSfx; // 0x8
	UWwiseEvent* WielderLandedJumpSfx; // 0x10
	UWwiseEvent* WielderFootstepLayerOneshot; // 0x18
};

struct FItemSnapshotOwnerDestroyed {
	FGuid SnapshotID; // 0x0
	TScriptInterface<Class> CurrentInstagator; // 0x10
};

struct FAnimationState : FAnimationStateBase {
	TArray<FAnimationTransitionRule> Transitions; // 0x8
	int32_t StateRootNodeIndex; // 0x18
	int32_t StartNotify; // 0x1c
	int32_t EndNotify; // 0x20
	int32_t FullyBlendedNotify; // 0x24
};

struct FEventRequestSayPhrase {
	FString PhraseKey; // 0x0
};

struct FCampfireStateData : FActorStateData {
	bool IsBuilt; // 0x20
	bool IsOnFire; // 0x21
	bool IsPartiallyBurned; // 0x22
};

struct FTextboxTextFromVirtualKeyboard {
	FString Text; // 0x0
};

struct FContestTavernStagingTelemetryFragment {
	int32_t CrewCountNeeded; // 0x0
	int32_t OpenCrewMemberCountNeeded; // 0x4
	bool TickingCountdown; // 0x8
	bool HasServerRecruitmentTimeEnded; // 0x9
	int32_t TavernPlayersAwaitingSpawn; // 0xc
	bool AreCrewsReadyToStart; // 0x10
};

struct FTextureSwitchEthnicityEntry {
	EIPGEthnicity Ethnicity; // 0x0
	FStringAssetReference Texture; // 0x8
};

struct FSphereData {
	FVector Location; // 0x0
	float Radius; // 0xc
	int32_t Segments; // 0x10
	FColor Colour; // 0x14
};

struct FEditorMapPerformanceTestDefinition {
	FFilePath PerformanceTestmap; // 0x0
	int32_t TestTimer; // 0x10
};

struct FMapTableStateForTunnel {
	AActor* Table; // 0x0
	bool Enabled; // 0x8
};

struct FMovieSceneAkAudioEventTemplate : FMovieSceneEvalTemplate {
	UMovieSceneAkAudioEventSection* Section; // 0x18
};

struct FEarthquakeForceFeedbackOption {
	TArray<FLandmarkReactionEventPlayForceFeedbackEntry> ForceFeedback; // 0x0
};

struct FEventAISkeletalShipCaptainAnimState {
	ESkeletonShipCaptainDockedAnimationState ActiveAnimationState; // 0x0
};

struct FCustomPlayerStartConfigData {
	FVector Location; // 0x0
	FQuat Rotation; // 0x10
	TArray<FString> Tags; // 0x20
};

struct FTrackToSkeletonMap {
	int32_t BoneTreeIndex; // 0x0
};

struct FSeasonGoalProgressionEvent {
	int32_t PreviousProgress; // 0x0
	int32_t CurrentProgress; // 0x4
	int32_t CompletionThreshold; // 0x8
	FGuid SeasonId; // 0xc
	FGuid GoalId; // 0x1c
	ESeasonGoalType GoalType; // 0x2c
	FGuid GoalGroupId; // 0x30
};

struct FGetSkeletonThronesDataResponse : FGetActorsInRadiusDataResponse {
	TArray<FSkeletonThroneStateData> Data; // 0x8
};

struct FVectorMaterialInput : FMaterialInput {
	char UseConstant : 1; // 0x38
	FVector Constant; // 0x3c
};

struct FPremiumCatalogItemSet {
	FText Title; // 0x0
	TArray<FPremiumShopOfferItem> Items; // 0x38
};

struct FStoreOnlinePurchaseResult {
	bool Success; // 0x0
	FString ProductId; // 0x8
};

struct FCanShowSecondaryActionButton : FRadialInventoryEvent {
	bool CanShow; // 0x4
	FText Text; // 0x8
};

struct FFlamesOfFateShipInfo {
	UShipSize* ShipSize; // 0x0
	uint32_t NumLanterns; // 0x8
};

struct FPirateProfileImageModel {
	FString Hash; // 0x0
};

struct FRequestClothingChestClothingEntitlementsEvent {
	FString ItemCategory; // 0x0
};

struct FFortStartedTelemetryEvent {
	FGuid FortId; // 0x0
	FName FortIsland; // 0x10
	FName FortType; // 0x18
};

struct FBuoyantObjectSpawnDesc {
	float LifeTime; // 0x0
	float SpawnDepth; // 0x4
	FVector2D Location; // 0x8
	UObject* Type; // 0x10
};

struct FEnableDefaultGameEventSchedulerData {
	bool Enabled; // 0x0
};

struct FCutsceneAnimationElement {
	FName SequenceName; // 0x0
	TArray<UAnimSequenceBase*> OneShotSequences; // 0x8
};

struct FRewardGroup {
	TArray<UItemDesc*> Rewards; // 0x0
};

struct FRewardHandInPopupNetworkEvent : FNetworkEventStruct {
	UPopUpMessageDesc* PopUpDesc; // 0x10
	UPopUpAudioDesc* AudioOverride; // 0x18
	FText FormattingText; // 0x20
	TArray<FString> Images; // 0x58
};

struct FMerchantContractItemDesc {
	UItemDesc* AllocatedCrate; // 0x0
	TArray<FItemAndReward> ItemData; // 0x8
