namespace off {
	constexpr auto GNames = 0x76598a8;
	constexpr auto GObjects = 0x765df50;
	constexpr auto GWorld = 0x771e470;
}
struct ALevelBounds {
	bool bAutoUpdateBounds; // 0x3d0
};

struct UShipCustomizationInfo {
	UShipCustomizationCategory* Category; // 0x28
	TArray<FShipSizePartCustomizationInfo> ShipSizeCustomizations; // 0x30
};

struct UAthenaAIAbilityComponent {
	TArray<UAthenaAIAbility*> AIAbilities; // 0xd0
	TArray<UAthenaAIAbility*> ActivatableAbilitiesInCurrentStage; // 0xe0
	UAthenaAIAbility* CurrentAIAbility; // 0xf0
	UAthenaAIAbilityType* QueuedAbilityType; // 0xf8
	UAthenaAIAbilityType* DebugAlwaysOnAbility; // 0x100
	TArray<FAthenaAIAbilityDamageStage> AbilityDamageStages; // 0x108
};

struct UMovieSceneByteSection {
	FIntegralCurve ByteCurve; // 0xa0
};

struct UMovieSceneLevelVisibilitySection {
	ELevelVisibility Visibility; // 0x98
	TArray<FName> LevelNames; // 0xa0
};

struct UKrakenServiceParamsDataAsset {
	FKrakenServiceParams Params; // 0x28
};

struct UHealthGemComponent {
	TArray<UMaterialInstanceDynamic*> OverridenMaterials; // 0x1e0
	FName EmissiveMaterialParameterName; // 0x1f0
	bool BuildMaterialMapOnBeginPlay; // 0x1f8
};

struct UBoobyTrapSpawnerDataAsset {
	TArray<FBoobyTrapSpawnerRankEntry> RankEntries; // 0x28
};

struct UNavRelevantComponent {
	char bNavigationRelevant : 1; // 0xec
	char bAttachToOwnersRoot : 1; // 0xec
	UObject* CachedNavParent; // 0xf0
};

struct UFragileComponentDataAsset {
	float DefaultDamageScalar; // 0x28
	UCurveFloat* DropDistanceToDamageCurve; // 0x30
	UCurveFloat* FallSpeedToDamageCurve; // 0x38
	UWwiseEvent* DamageSound; // 0x40
	FName ObjectDamageRTPCName; // 0x48
	UObject* DamageVfx; // 0x50
	FName DamageVfxSocketName; // 0x58
	float SignificantHealthChangeAbsolute; // 0x60
	TMap<UDamagerType*, float> ShipDamageTypeMappings; // 0x68
	TArray<FFragileComponentShipDamageTypeEntry> ShipDamageTypeValues; // 0x158
	TArray<FFragileComponentHealthScalarEntry> DamageTypeScalars; // 0x168
	TArray<EHealthChangedReason> BlockedHealthChangedReasons; // 0x178
};

struct UMovieSceneCameraCutTrack {
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UQuestItemCategory_C {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UBTTask_SpawnItemForCategory {
	bool EnableOverrideItemCategory; // 0x88
	UItemCategory* OverrideItemCategory; // 0x90
	FBlackboardKeySelector BlackboardKey; // 0x98
};

struct UPoseableMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x598
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x5a0
	UMaterialInterface* CustomDepthMaterial; // 0x5e8
	char bUseBoundsFromMasterPoseComponent : 1; // 0x600
	TArray<FActiveVertexAnim> ActiveVertexAnims; // 0x608
	UPhysicsAsset* PhysicsAssetOverride; // 0x618
	int32_t ForcedLodModel; // 0x620
	int32_t MinLodModel; // 0x624
	int32_t PredictedLODLevel; // 0x628
	int32_t OldPredictedLODLevel; // 0x62c
	float MaxDistanceFactor; // 0x630
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x638
	float StreamingDistanceMultiplier; // 0x648
	FColor WireframeColor; // 0x64c
	char bForceWireframe : 1; // 0x650
	char bDisplayBones : 1; // 0x650
	char bDisplayBoneCollisions : 1; // 0x650
	char bDisableMorphTarget : 1; // 0x650
	char bHideSkin : 1; // 0x650
	char bPerBoneMotionBlur : 1; // 0x668
	char bComponentUseFixedSkelBounds : 1; // 0x668
	char bConsiderAllBodiesForBounds : 1; // 0x668
	EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0x66c
	char bForceMeshObjectUpdate : 1; // 0x670
	char bChartDistanceFactor : 1; // 0x670
	char bCanHighlightSelectedSections : 1; // 0x670
	char bRecentlyRendered : 1; // 0x670
	float ProgressiveDrawingFraction; // 0x674
	char CustomSortAlternateIndexMode; // 0x678
	FBoxSphereBounds CachedLocalBounds; // 0x68c
	bool bCachedLocalBoundsUpToDate; // 0x6a8
	bool bEnableUpdateRateOptimizations; // 0x6a9
	bool bDisplayDebugUpdateRateOptimizations; // 0x6aa
};

struct UDiggingEffectsDataAsset {
	TArray<FItemDiggingEffectsOverride> EffectsOverrides; // 0x28
	UItemDiggingEffectsConfig* Default; // 0x38
};

struct UMaterialExpressionVertexID {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct URowboatDescDataAsset {
	FPartDesc PartDesc; // 0x28
};

struct UResourceCache {
	TArray<FResourceCacheEntry> Cache; // 0x28
};

struct UAISpawner {
	bool HasSpawnerLevelEncounters; // 0x38
	FAISpawnTypeParamsCollection SpawnTypeParamsCollection; // 0x40
	UAIEncounterSettings* DefaultEncounterSettings; // 0x88
	UAISpawnWaveSequenceRankProgression* DefaultSpawnWaveProgression; // 0x90
	TArray<FAISpawnContextIdEncounterSettingsPair> SpawnContextSpecificEncounterSettings; // 0x98
	bool ShouldSpawnFacingRegionCentre; // 0xa8
	EAthenaAISpawnType DefaultSpawnType; // 0xa9
	UEnvQuery* FindSpawnPosQuery; // 0xb0
	EEnvQueryRunMode FindSpawnPosQueryRunMode; // 0xb8
	FName SpawnLocationType; // 0xbc
	int32_t MaxNumOfSpawnedPawns; // 0xc4
	int32_t PriorityForSpawnedPawns; // 0xc8
	TArray<FConditionalAISpawnOverride> SpawnOverrides; // 0xd0
	TArray<FAdditionalSpawnerBehaviour> AdditionalBehaviours; // 0xe0
	UAthenaAISettings* AthenaAISettings; // 0x360
};

struct UHitRegSnapshotComponent {
	FHitRegProjectileSnapshotData SnapshotData; // 0xd0
	FHitRegSnapshotDisplaySettings ServerDisplaySettings; // 0x1b0
	TMap<UObject*, FMeshVertexData> ExtractedMeshes; // 0x1b8
	float DistanceToDisplayMessages; // 0x208
};

struct ULightingControllerSettings {
	UCurveFloat* FogDensityCurve; // 0x28
	UCurveFloat* FogStartDistanceCurve; // 0x30
	UCurveFloat* LightIntensityCurve; // 0x38
	UCurveFloat* SkyDomeBrightnessCurve; // 0x40
	UCurveFloat* SkyDomeMoonVisibilityCurve; // 0x48
	UCurveFloat* SkyDomeStarBrightnessCurve; // 0x50
	UCurveFloat* SkyDomeSunBrightnessCurve; // 0x58
	UCurveFloat* PostLPVIntensityCurve; // 0x60
	UCurveFloat* PostExposureBiasCurve; // 0x68
	UCurveFloat* PostLPVOcclusionIntensityCurve; // 0x70
	UCurveFloat* SkyLightIntensityCurve; // 0x78
	UCurveFloat* FogBrightnessNearCurve; // 0x80
	UCurveFloat* FogBrightnessFarCurve; // 0x88
	UCurveFloat* PostBloomIntensityCurve; // 0x90
	UCurveFloat* PostBloomThresholdCurve; // 0x98
	UCurveFloat* SkyDomeAuraBrightnessCurve; // 0xa0
	UCurveFloat* PostReflectionProbeBrightnessCurve; // 0xa8
	UCurveFloat* PostReflectionProbeShadowBrightnessCurve; // 0xb0
	UCurveFloat* VfxControllerCurve; // 0xb8
	UCurveFloat* FogMaxOpacityCurve; // 0xc0
	UCurveFloat* FogScatterExpCurve; // 0xc8
	UCurveFloat* FogUnderwaterDensityCurve; // 0xd0
	UCurveFloat* PostLensFlareIntensityCurve; // 0xd8
	UCurveFloat* EmissiveFoliageCurve; // 0xe0
	UCurveFloat* EmissiveLightsCurve; // 0xe8
	UCurveFloat* PostExposureMinBrightnessCurve; // 0xf0
	UCurveFloat* PostExposureMaxBrightnessCurve; // 0xf8
	UCurveFloat* SkyDomeMoonBrightnessCurve; // 0x100
	UCurveFloat* SkyDomeHorizonCloudBrightnessCurve; // 0x108
	UCurveFloat* SkyDomeGreenFlashStrengthCurve; // 0x110
	UCurveFloat* PostSaturationCurve; // 0x118
	UCurveFloat* PostContrastCurve; // 0x120
	UCurveFloat* CloudRimlightScaleCurve; // 0x128
	UCurveFloat* CloudSkylightScaleCurve; // 0x130
	UCurveFloat* CloudSunlightScaleCurve; // 0x138
	UCurveFloat* CloudGlobalPressureCurve; // 0x140
	UCurveFloat* PostUnderWaterBrightnessCurve; // 0x148
	UCurveFloat* VfxCloudBrightnessCurve; // 0x150
	UCurveFloat* LightGodRayIntensityCurve; // 0x158
	UCurveFloat* CloudBottomBrightnessCurve; // 0x160
	UCurveFloat* CloudSunlightShadowingCurve; // 0x168
	UCurveFloat* SunDiscScaleCurve; // 0x170
	UCurveFloat* WaterSpecularBrightnessCurve; // 0x178
	UCurveFloat* VfxAmbientScaleCurve; // 0x180
	UCurveFloat* CloudShadowBrightnessCurve; // 0x188
	UCurveFloat* StormCloudShadowBrightnessCurve; // 0x190
	UCurveFloat* StormPostBloomIntensityCurve; // 0x198
	UCurveFloat* StormPostBloomThresholdCurve; // 0x1a0
	UCurveFloat* DirectionalLightShadowSteppingRateCurve; // 0x1a8
	UCurveFloat* SkullBrightnessCurve; // 0x1b0
	UCurveLinearColor* FogColourAwayCurve; // 0x1b8
	UCurveLinearColor* FogColourTowardsCurve; // 0x1c0
	UCurveLinearColor* LightSunColourCurve; // 0x1c8
	UCurveLinearColor* SkyDomeHorizonColourCurve; // 0x1d0
	UCurveLinearColor* SkyDomeZenithColourCurve; // 0x1d8
	UCurveLinearColor* SkyLightColourCurve; // 0x1e0
	UCurveLinearColor* PostAmbientShadowColourCurve; // 0x1e8
	UCurveLinearColor* FogColourAwayFarCurve; // 0x1f0
	UCurveLinearColor* FogColourUnderwaterCurve; // 0x1f8
	UCurveLinearColor* FogColourAwayUnderwaterCurve; // 0x200
	UCurveLinearColor* WaterColourCurve; // 0x208
	UCurveLinearColor* WaterColourShallowCurve; // 0x210
	UCurveLinearColor* WaterBackLitColourCurve; // 0x218
	UCurveLinearColor* WaterFoamColourCurve; // 0x220
	UCurveLinearColor* WaterFoamHighlightColourCurve; // 0x228
	UCurveLinearColor* WaterAmbientColourCurve; // 0x230
	UCurveLinearColor* PostReflectionProbeTintCurve; // 0x238
	UCurveLinearColor* CloudRimlightColourCurve; // 0x240
	UCurveLinearColor* CloudSkylightColourCurve; // 0x248
	UCurveLinearColor* CloudSunlightColourCurve; // 0x250
	UCurveLinearColor* PostUnderWaterTintCurve; // 0x258
	UCurveLinearColor* SkyDomeMoonColourCurve; // 0x260
	UCurveLinearColor* PostGammaCurve; // 0x268
	UCurveLinearColor* SkyDomeSunColourCurve; // 0x270
	UCurveLinearColor* VFXFoamColourCurve; // 0x278
	UCurveLinearColor* VFXWindColourCurve; // 0x280
	UCurveLinearColor* VFXUnderwaterTintCurve; // 0x288
	UCurveLinearColor* StormRainColourCurve; // 0x290
	UCurveLinearColor* StormSkyLightColourCurve; // 0x298
	UCurveLinearColor* StormPostGammaCurve; // 0x2a0
	UCurveLinearColor* StormFogColourUnderwaterCurve; // 0x2a8
	UCurveLinearColor* StormFogColourAwayUnderwaterCurve; // 0x2b0
	UCurveLinearColor* StormWaterColourCurve; // 0x2b8
	UCurveLinearColor* StormWaterColourShallowCurve; // 0x2c0
	UCurveLinearColor* StormWaterBackLitColourCurve; // 0x2c8
	UCurveLinearColor* StormWaterFoamColourCurve; // 0x2d0
	UCurveLinearColor* StormWaterFoamHighlightColourCurve; // 0x2d8
	UCurveLinearColor* StormWaterAmbientColourCurve; // 0x2e0
	UCurveLinearColor* StormPostReflectionProbeTintCurve; // 0x2e8
	UCurveLinearColor* SkullEyeColourCurve; // 0x2f0
	FLinearColor SandColourStatic; // 0x2f8
	float FogUnderwaterMaxOpacityStatic; // 0x308
	float FogUnderwaterScatterExpStatic; // 0x30c
	float FogUnderwaterStartDistanceStatic; // 0x310
	float FogUnderwaterBrightnessNearStatic; // 0x314
	float FogUnderwaterBrightnessFarStatic; // 0x318
	float FogDirectionalInscatteringStartStatic; // 0x31c
	float FogUnderwaterDirectionalInscatteringStartStatic; // 0x320
	float UnderwaterDirectionalLightMinBrightnessStatic; // 0x324
};

struct UParticleModuleSize {
	char bUseGroupAForAll : 1; // 0x50
	FRawDistributionVector StartSize; // 0x58
	FRawDistributionVector AdditionalStartSizes[0x5]; // 0x90
	char bKeepAspectRatio : 1; // 0x1a8
	char bIgnoreComponentScale : 1; // 0x1a8
};

struct UGameNarrationCoordinator {
	UWwiseEvent* NarrationSpeakEvent; // 0x28
	FWwiseEmitter Emitter; // 0x30
	FString CachedPreferredVoice; // 0x178
	FString CachedLanguage; // 0x188
	int32_t CachedGender; // 0x198
	bool IsNarrationSettingEnabled; // 0x19c
	int32_t NarrationOverride; // 0x1a0
};

struct ULightComponentBase {
	FGuid LightGuid; // 0x2b0
	float Brightness; // 0x2c0
	float Intensity; // 0x2c4
	FColor LightColor; // 0x2c8
	char bAffectsWorld : 1; // 0x2cc
	char CastShadows : 1; // 0x2cc
	char CastStaticShadows : 1; // 0x2cc
	char CastDynamicShadows : 1; // 0x2cc
	char bAffectTranslucentLighting : 1; // 0x2cc
	char bPrecomputedLightingIsValid : 1; // 0x2cc
	char RainOcclusion : 1; // 0x2cc
	float IndirectLightingIntensity; // 0x2d0
	float ScaleForTranslucency; // 0x2d4
	float CapForTranslucency; // 0x2d8
};

struct UMaterialExpressionDistanceFieldGradient {
	FExpressionInput Position; // 0x70
};

struct UNPCDialogConditionalText {
	FText Text; // 0x28
	UNPCDialogExpression* Expression; // 0x60
};

struct APocketWatch {
	UInventoryItemComponent* InventoryItem; // 0x798
	UNamedNotificationInputComponent* NamedNotificationInputComponent; // 0x7a0
	UUsableWieldableComponent* UsableWieldableComponent; // 0x7a8
	UWwiseEmitterComponent* AudioEmitter; // 0x7b0
	FPocketWatchHandParams MinuteHandParams; // 0x7b8
	FPocketWatchHandParams HourHandParams; // 0x820
	FPocketWatchDateDisplay DateDisplay; // 0x888
	UMaterialInstanceDynamic* FirstPersonMeshDynamicMaterialInstance; // 0x8c0
	UMaterialInstanceDynamic* ThirdPersonMeshDynamicMaterialInstance; // 0x8c8
	UWwiseEvent* DateSwitchSFX; // 0x8d0
	UWwiseEvent* MinuteHandTickSFX; // 0x8d8
	UPocketWatchAnimationInstance* FirstPersonMeshAnimator; // 0x8f0
	UPocketWatchAnimationInstance* ThirdPersonMeshAnimator; // 0x8f8
	UPocketWatchAnimationInstance* CurrentMeshAnimator; // 0x900
};

struct URainZoneService {
	TArray<TScriptInterface<Class>> RegisteredRainZones; // 0x30
};

struct UDevilsRoar_C {
	FName SeaName; // 0x28
};

struct UParticleModuleSubUV {
	FRawDistributionFloat SubImageIndex; // 0x50
	char bUseRealTime : 1; // 0x88
};

struct USirenEncounterSpawnBlockingBehaviourStrategy {
	float ChanceToSpawn; // 0x48
};

struct UInheritableComponentHandler {
	TArray<FComponentOverrideRecord> Records; // 0x28
};

struct AArenaVendorShip {
	USceneComponent* ArenaVendorShipRootComponent; // 0x3d0
	UContestMerchantSpawnerComponent* ContestMerchantSpawnerComponent; // 0x3d8
	UGenericWorldMapMarker* VendorShipWorldMarkerComponent; // 0x3e0
	USphereComponent* VendorDeadZoneComponent; // 0x3e8
	float VendorShipDeadZoneRadius; // 0x3f0
};

struct UItemDesc {
	char CanBeAddedToLoadout : 1; // 0xd8
	char IsTransient : 1; // 0xd8
	FString PreviousItem; // 0xe0
	FString NextItem; // 0xf0
	FStringAssetReference IconRadPath; // 0x100
	FStringClassReference InstanceClassType; // 0x110
	TArray<FItemInfoTogglePair> ItemInfoOverrides; // 0x120
};

struct UCloudStorageBase {
	TArray<FString> LocalCloudFiles; // 0x38
	char bSuppressDelegateCalls : 1; // 0x48
};

struct UGetVoyageDifficultyFromRankStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UBTDecorator_CurrentAIStrategy {
	TArray<UAIStrategyId*> Strategies; // 0x68
};

struct USailManipulatorAudioParams {
	UWwiseEvent* PlaySailManipulator; // 0x28
	UWwiseEvent* StopSailManipulator; // 0x30
	UWwiseEvent* PlaySailManipulatorEndExtremity; // 0x38
};

struct UItemDiggingBuryConfig {
	int32_t MaxSmallCrewSizeForNumDigsSelection; // 0x28
	FWeightedProbabilityRange NumDigsRequiredForSmallCrewSize; // 0x30
	FWeightedProbabilityRange NumDigsRequiredForBiggerCrewSize; // 0x50
	int32_t DefaultNumDigsIfNotInCrew; // 0x70
};

struct UUniformGridSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int32_t Row; // 0x3c
	int32_t Column; // 0x40
};

struct UMediaSoundWave {
	int32_t AudioTrackIndex; // 0x218
	UMediaPlayer* MediaPlayer; // 0x220
	TWeakObjectPtr<UMediaPlayer> CurrentMediaPlayer; // 0x258
};

struct UTaleQuestSetCompassTargetToActorStepDesc {
	FQuestVariableActor TargetActor; // 0x88
};

struct UPlantAIFormDataAsset {
	float WetCooldown; // 0x90
	float WetHealPerSecond; // 0x94
	float RelativeWaterLevelToGetWet; // 0x98
	float RainStrengthToGetWet; // 0x9c
	float WeakMovementSpeedMultiplier; // 0xa0
};

struct ABroadcasterPuzzleStatue {
	UStaticMeshComponent* ArmStaticMesh; // 0x458
	TArray<AActor*> ReceiverStatues; // 0x460
	TArray<FConfigurationComboAndTrigger> ValidConfigurationCombos; // 0x470
	FReactionSequenceStateInfo ReactionSequenceState; // 0x480
	UIslandVisitorCallbackComponent* IslandVisitorCallbackComponent; // 0x4d8
	float DelayBeforeReactionSequenceCheck; // 0x4e0
	float DelayPerStatueDuringReactionSequenceCheck; // 0x4e4
	float DelayAfterReactionSequenceCheck; // 0x4e8
	float DelayBeforeActivatingTriggerDuringReactionSequenceSuccess; // 0x4ec
	UParticleSystemComponent* ShockwaveParticleSystem; // 0x4f8
	UParticleSystemComponent* HornDustParticleSystem; // 0x500
	UBroadcasterPuzzleStatueAudioParamsDataAsset* BroadcasterAudioParams; // 0x508
	float ShockwaveEffectDelay; // 0x5b4
	bool ShouldResetWhenIslandIsEmpty; // 0x5b8
	float TimeBeforeIslandResetWhenEmpty; // 0x5bc
	float StatueResetCooldownInSeconds; // 0x5c0
};

struct UIsWieldingItemOfTypeStatCondition {
	TArray<UItemCategory*> TargetItemCategories; // 0x30
};

struct UFaceTargetComponent {
	float BlendRotationInterpSpeed; // 0xc8
	bool BlendRotationUseConstantInterp; // 0xcc
	AActor* TargetActorToFace; // 0xe8
	float ClampYawRange; // 0x138
	float ClampYawCentre; // 0x13c
	float ClampYawRate; // 0x140
};

struct UTaleQuestBreakStructStepDesc {
	UScriptStruct* Struct; // 0x80
	TMap<FName, FName> PropertyMappings; // 0x88
};

struct UMaterialExpressionSpeedTree {
	ESpeedTreeGeometryType GeometryType; // 0x70
	ESpeedTreeWindType WindType; // 0x71
	ESpeedTreeLODType LODType; // 0x72
	float BillboardThreshold; // 0x74
	bool bAccurateWindVelocities; // 0x78
};

struct UMovieSceneColorSection {
	FRichCurve RedCurve; // 0xa0
	FRichCurve GreenCurve; // 0x118
	FRichCurve BlueCurve; // 0x190
	FRichCurve AlphaCurve; // 0x208
};

struct UTestPlayerTelemetryComponentNoEvents {
	float HeartbeatInterval; // 0x128
	FDateTime SpawnTimestamp; // 0x270
};

struct UPlayerBuriedItemServiceMapStorePopulatorDataAsset {
	int32_t MinNumberMapsPerSeaRegion; // 0x28
	float MinSeparationBetweenXs; // 0x2c
	TArray<FPlayerBuriedItemServiceDataAssetMapStorePopulationSeaRegion> SeaRegions; // 0x30
};

struct UDestroySpawnedActorStepDesc {
	FQuestVariableActor ActorVar; // 0x80
};

struct UTaleQuestCompassService {
	FEnchantedCompassTarget CurrentTarget; // 0x120
};

struct UChainLightningReceiverComponent {
	float ShockDuration; // 0xd0
};

struct UAnimationDataStoreWeakReferenceAsset {
	TArray<FAnimationDataStoreAssetWeakReferenceEntry> AssetWeakRefs; // 0x28
};

struct UOverlaySlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UConsumableItemCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UInteractableService {
	TArray<UInteractableArea*> InteractableAreas; // 0x38
};

struct ASail {
	USkeletalMeshComponent* Mesh; // 0x3d8
	TArray<UMaterialInstanceDynamic*> DynamicMaterials; // 0x3e0
	FVector PositionForSailDynamicsRelativeToSailActor; // 0x3f0
	UBaseSailDynamicsDesc* SailDynamicsDesc; // 0x400
	float MinRelativeWindSpdForFullVisibleInflation; // 0x408
	float BaseWindStrength; // 0x40c
	UCurveFloat* WindToSailAngleEfficiencyCurve; // 0x410
	float NormalBillowLimit; // 0x418
	float PerfectBillowValue; // 0x41c
	float PerfectBillowThreshold; // 0x420
	float SailLoweredPerfectWindThreshold; // 0x424
	float BlendSpeed; // 0x428
	FName FurlMaterialParameterName; // 0x42c
	float AnimationSailHeightScalar; // 0x434
	float DamageScalar; // 0x53c
};

struct UItemSnapshotSettings {
	TArray<UItemSnapshotMetaGenerator*> Generators; // 0x38
};

struct UMechanismMaterialMap {
	TArray<FMechanismMaterialMapEntry> MaterialClusters; // 0x28
};

struct UTaleQuestEmissaryCompanyActionRewardBoostStepDesc {
	EEmisaryCompanyActionType CompanyActionType; // 0x80
};

struct AGenericMarkerService {
	TArray<FCanvasWorldMapGeneric> GenericMarkers; // 0x3f8
};

struct UBTTask_SetVelocity {
	bool UseBlackboardKey; // 0x88
	FVector NewVelocity; // 0x8c
};

struct ATestDockableObject {
	USceneComponent* SceneComponent; // 0x3f8
	EInteractableState CurrentInteractionState; // 0x4b9
	bool CanSetInteractionState; // 0x4ba
};

struct UBootyCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct AOneShotToggleCollisionAction {
	USceneComponent* CollisionActionRoot; // 0x3d0
	UPrimitiveComponent* BlockingPrimitive; // 0x3d8
	UMechanismActionComponent* MechanismActionComponent; // 0x3e0
	UArrowComponent* KnockbackArrowComponent; // 0x3e8
	bool UseInactiveCollisionProfileByDefault; // 0x3f0
	FKnockBackInfo KnockBackInfo; // 0x3f4
	float KnockbackGracePeriod; // 0x444
	FCollisionProfileName InactiveCollisionProfileName; // 0x448
	FCollisionProfileName ActiveCollisionProfileName; // 0x450
	FOneShotToggleCollisionAudioParams AudioParams; // 0x458
};

struct AEmitter {
	UParticleSystemComponent* ParticleSystemComponent; // 0x3d0
	char bDestroyOnSystemFinish : 1; // 0x3d8
	char bPostUpdateTickGroup : 1; // 0x3d8
	char bCurrentlyActive : 1; // 0x3d8
	FScriptMulticastDelegate OnParticleSpawn; // 0x3e0
	FScriptMulticastDelegate OnParticleBurst; // 0x3f0
	FScriptMulticastDelegate OnParticleDeath; // 0x400
	FScriptMulticastDelegate OnParticleCollide; // 0x410
};

struct USummonAbilityStageParams {
	float NumToSpawnMultiplier; // 0x40
};

struct UNavModifierComponent {
	UNavArea* AreaClass; // 0xf8
	FVector FailsafeExtent; // 0x100
};

struct UCatchFaunaConditionalStatTrigger {
	FName UniqueTextIdentifier; // 0x28
};

struct UNPCDialogFormattedHeaderByCondition {
	TArray<FNPCDialogFormattedHeaderByConditionText> Substitutes; // 0x28
	TArray<FString> ExpectedParameters; // 0x38
	FText FormattedText; // 0x48
	FText DefaultText; // 0x80
};

struct UShipTelemetrySubjectComponent {
	FString SubjectName; // 0xd0
	FString SubjectID; // 0xe0
};

struct UStatusResponseActivateElectricShield {
	float Duration; // 0x30
};

struct AChainLightningVisualActor {
	FWwiseEmitter Emitter; // 0x3d0
	FChainData Data; // 0x3f8
	TArray<UMaterialInstanceDynamic*> CachedChainMaterials; // 0x410
	TArray<UStaticMeshComponent*> CachedChainComponents; // 0x420
	UChainLightningVisualActorSettingsAsset* SettingsAsset; // 0x470
	USceneComponent* RootSceneComponent; // 0x478
	TArray<TWeakObjectPtr<UParticleSystemComponent>> LightningVFXComponents; // 0x498
};

struct UParticleModuleSpawnRepeatPerPoint {
	char bProcessSpawnRate : 1; // 0x50
	char bProcessBurstList : 1; // 0x50
};

struct UAIFormItemSpawnRequirement {
	TArray<UAthenaAIFormDataAsset*> AllowedForms; // 0x50
};

struct ACompassWieldableReplica {
	UCompassSpinComponent* SpinComponent; // 0x518
};

struct AToggleAnimatedMechanismAction {
	FMechanismTransformAnimationCurve InactiveToActiveAnimation; // 0x560
	FMechanismTransformAnimationCurve ActiveToInactiveAnimation; // 0x568
};

struct UIslandDataDefaultAssetEntry {
	EIslandType IslandType; // 0x28
	UAISpawner* AISpawner; // 0x30
	TArray<FToggledSpawnerOverride> AISpawnerOverrides; // 0x38
	UAISpawner* CannonsAISpawner; // 0x48
	TArray<FToggledSpawnerOverride> CannonsAISpawnerOverrides; // 0x50
	UAISpawner* EmergentCaptainSpawner; // 0x60
	TArray<FToggledSpawnerOverride> EmergentCaptainSpawnerOverrides; // 0x68
};

struct UTextBlock {
	USlateWidgetStyleAsset* Style; // 0x138
	FText Text; // 0x140
	DelegateProperty TextDelegate; // 0x178
	FSlateColor ColorAndOpacity; // 0x188
	DelegateProperty ColorAndOpacityDelegate; // 0x1b8
	FSlateFontInfo Font; // 0x1c8
	FVector2D ShadowOffset; // 0x208
	FLinearColor ShadowColorAndOpacity; // 0x210
	DelegateProperty ShadowColorAndOpacityDelegate; // 0x220
	ETextJustify Justification; // 0x230
	bool AutoWrapText; // 0x231
	float WrapTextAt; // 0x234
	float MinDesiredWidth; // 0x238
	FMargin Margin; // 0x23c
	float LineHeightPercentage; // 0x24c
};

struct UGameplayTaskResource {
	int32_t ManualResourceID; // 0x28
	char bManuallySetID : 1; // 0x30
};

struct UAISenseConfig_Team {
	float MaxAge; // 0x28
	char bStartsEnabled : 1; // 0x2c
};

struct ALevelScriptActor {
	char bInputEnabled : 1; // 0x3d0
};

struct UGiveItemUponConsumptionComponent {
	UItemDesc* ItemToGive; // 0xd0
};

struct UAutomatedLevelSequenceCapture {
	FCaptureProtocolID CaptureType; // 0x38
	UMovieSceneCaptureProtocolSettings* ProtocolSettings; // 0x40
	FMovieSceneCaptureSettings Settings; // 0x48
	bool bUseSeparateProcess; // 0x98
	bool bCloseEditorWhenCaptureStarts; // 0x99
	FString AdditionalCommandLineArguments; // 0xa0
	FString InheritedCommandLineArguments; // 0xb0
};

struct UBTDecorator_IsOccupiedHangoutSpotStillAvailable {
	char bInverseCondition : 1; // 0x60
	EBTFlowAbortMode FlowAbortMode; // 0x64
};

struct UParticleModuleRotationRate {
	char bUseGroupARotationRateForAllGroups : 1; // 0x50
	FRawDistributionFloat StartRotationRate; // 0x58
	FRawDistributionFloat AdditionalStartRotationRate[0x5]; // 0x90
};

struct UDiggingBaseParamsDataAsset {
	TArray<FItemDiggingBaseOverride> BaseOverrides; // 0x28
	UItemDiggingBaseConfig* Default; // 0x38
};

struct UBlueprint {
	char bRecompileOnLoad : 1; // 0x50
	UObject* ParentClass; // 0x58
	UObject* PRIVATE_InnermostPreviousCDO; // 0x60
	char bHasBeenRegenerated : 1; // 0x68
	char bIsRegeneratingOnLoad : 1; // 0x68
	USimpleConstructionScript* SimpleConstructionScript; // 0x70
	TArray<UActorComponent*> ComponentTemplates; // 0x78
	TArray<UTimelineTemplate*> Timelines; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
	EBlueprintType BlueprintType; // 0xa0
	int32_t BlueprintSystemVersion; // 0xa4
};

struct UTaleQuestToolServiceDesc {
	bool GiveToolsOnStart; // 0x28
};

struct UFireBreathAIAbilityParams {
	FAthenaAIAbilityPlayerBasedRanges FireBreathDuration; // 0xc8
	AStatusEffectOverlapZone* FireBreathObject; // 0xd8
	FVFXHandlerComponentParams FireBreathVFXParams; // 0xe0
	FVector FireCollisionVolumeSize; // 0x120
	float FireBreathZoneStartOffset; // 0x12c
	float FireStartDelay; // 0x130
	float FireEndPreWarn; // 0x134
	UVFXSpawnerComponent* VfxSpawner; // 0x138
};

struct USeaRegionComponent {
	USeaId* SeaId; // 0x2f0
};

struct UBTTaskNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UGetNumberOfCollectedTornMapPiecesStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UTaleLoadSpireStepDesc {
	bool Fork; // 0x28
	TMap<FName, FQuestVariableAny> PromotedPropertyVariables; // 0x30
};

struct UInvalidPetEntitlementCategory {
	FName PetPreviewCamera; // 0x80
};

struct UInterpTrackVectorMaterialParam {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct UBlueprintCore {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	bool bLegacyGeneratedClassIsAuthoritative; // 0x39
	FGuid BlueprintGuid; // 0x3c
};

struct UMaterialExpressionViewProperty {
	EMaterialExposedViewProperty Property; // 0x70
};

struct UBTTask_IncrementBlackboardIntValue {
	FAIDataProviderIntValue IntegerValueDelta; // 0x88
};

struct UAbilityTask_WaitAbilityCommit {
	FScriptMulticastDelegate OnCommit; // 0x68
};

struct UIsWieldedCommodityItemInDemandStatCondition {
	ECommodityDemand CommodityDemand; // 0x30
};

struct AAggressiveGhostShipAnchorDrop {
	FScriptMulticastDelegate StartShockwaveEvent; // 0x3d8
};

struct UDefaultOnlineEnvironmentSettings {
	FString EnvironmentId; // 0x28
	uint32_t TitleId; // 0x38
	FString ServiceConfigId; // 0x40
	FString ClientCertificateThumbprint; // 0x50
};

struct USwordItemCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UWidgetReflectorNodeBase {
	FGeometry Geometry; // 0x28
	TArray<UWidgetReflectorNodeBase*> ChildNodes; // 0x60
	FLinearColor Tint; // 0x70
};

struct UFishingLineRenderComponent {
	FLinearColor LineColour; // 0x630
};

struct UAthenaDebugSettings {
	FStringAssetReference Dioramas; // 0x28
};

struct UMovieSceneFadeTrack {
	FName PropertyName; // 0x88
	FString PropertyPath; // 0x90
	TArray<UMovieSceneSection*> Sections; // 0xa0
};

struct UStartEmissaryVoyageInlineVoteConsumer {
	FText EmissaryVotingCastVote; // 0x128
	FText EmissaryVotingCantVote; // 0x160
	FText EmissaryVotingCantVoteReasonCrewShipOutsideRange; // 0x198
	FText EmissaryVotingCantVoteReasonNoEmissaryEntitlement; // 0x1d0
	FText EmissaryVotingCantVoteReasonHasActiveVoteForDifferentCompany; // 0x208
	FText EmissaryVotingRemoveVote; // 0x240
	FText EmissaryVotingCantRemoveVote; // 0x278
};

struct UCatalogDiscountDataAsset {
	FGuid DiscountId; // 0x28
	FText DisplayName; // 0x38
	EWalletCurrencyId CurrencyType; // 0x70
	uint32_t PercentOff; // 0x74
};

struct UEllipsoidComponent {
	float SphereRadius; // 0x5a8
};

struct UNPCDialogOptionGiveReward {
	FText Text; // 0x80
	FRewardId RewardId; // 0xb8
	UCompany* Company; // 0xc0
	int32_t LinkedDialog; // 0xc8
};

struct UBurpComponent {
	float MinGasToTriggerBurp; // 0xc8
	float MinRandomBurpDelay; // 0xcc
	float MaxRandomBurpDelay; // 0xd0
	float GasDecayPerSecond; // 0xd4
	UWwiseObjectPoolWrapper* BurpComponentPool; // 0xd8
	UWwiseEvent* BurpSfx; // 0xe0
	FName PlayerSizeRTPCName; // 0xe8
	FName BurpLengthRTPCName; // 0xf0
};

struct UInterpTrackInstLinearColorProp {
	FLinearColor ResetColor; // 0x40
};

struct UInterpTrackInstFloatProp {
	float ResetFloat; // 0x40
};

struct UFireGridVFXParamsDataAsset {
	FFireGridVFXParams Params; // 0x28
};

struct UDebugMenuDataAsset {
	TArray<UDebugMenuDataAsset*> DataAssets; // 0x28
	TArray<FDebugMenuDataAssetEntry> MenuEntires; // 0x38
	TArray<FDebugMenuButtonShortcut> ButtonShortcuts; // 0x48
	TArray<UDebugMenuEntryGenerator*> MenuEntryGenerators; // 0x58
};

struct UKrakenTelemetryComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UAIShipEncounterParamsDataAsset {
	UAIShipEncounterSpawnParamsDataAsset* SpawnParams; // 0x28
	UAIShipContextParamsDataAsset* ContextParams; // 0x30
	UAIShipContextDescDataAsset* DefaultContextDesc; // 0x38
	AShipProxyPawn* ShipPawnClass; // 0x40
	UBuoyantObjectSpawnProfileDataAsset* BuoyantObjectSpawnProfileAsset; // 0x48
	AGameplayEventSignal* EventSignalAssetClass; // 0x50
	float EventSignalHeight; // 0x58
	FText EncounterCompleteText; // 0x60
	float OuterRadiusMultiplier; // 0x98
	float MigrationRadiusMultiplier; // 0x9c
	float InitialEncounterEntryDelay; // 0xa0
	float MinEngagedDistanceFromPlayers; // 0xa4
	bool EnableMusicWhenShipsHaveNoTarget; // 0xa8
	int32_t SecondsUntilEncounterEndsAfterLastCrewLeft; // 0xac
	int32_t MaximumEncounterDuration; // 0xb0
};

struct UEnvQueryTest_Random {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x35
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x36
	EEnvTestFilterType FilterType; // 0x37
	FAIDataProviderBoolValue BoolValue; // 0x38
	FAIDataProviderFloatValue FloatValueMin; // 0x68
	FAIDataProviderFloatValue FloatValueMax; // 0x98
	EEnvTestScoreEquation ScoringEquation; // 0xc9
	EEnvQueryTestClamping ClampMinType; // 0xca
	EEnvQueryTestClamping ClampMaxType; // 0xcb
	FAIDataProviderFloatValue ScoreClampMin; // 0xd0
	FAIDataProviderFloatValue ScoreClampMax; // 0x100
	FAIDataProviderFloatValue ScoringFactor; // 0x130
	char bWorkOnFloatValues : 1; // 0x168
};

struct UParticleModuleLocationSkelVertSurface {
	ELocationSkelVertSurfaceSource SourceType; // 0x50
	FVector UniversalOffset; // 0x54
	char bUpdatePositionEachFrame : 1; // 0x60
	char bOrientMeshEmitters : 1; // 0x60
	char bInheritBoneVelocity : 1; // 0x60
	FName SkelMeshActorParamName; // 0x64
	TArray<FName> ValidAssociatedBones; // 0x70
	char bEnforceNormalCheck : 1; // 0x80
	FVector NormalToCompare; // 0x84
	float NormalCheckToleranceDegrees; // 0x90
	float NormalCheckTolerance; // 0x94
	TArray<int32_t> ValidMaterialIndices; // 0x98
	char bInheritVertexColor : 1; // 0xa8
};

struct UEnvQueryGenerator_Composite {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	bool bHasMatchingItemType; // 0x60
};

struct UInGameAdManager {
	char bShouldPauseWhileAdOpen : 1; // 0x38
	TArray<DelegateProperty> ClickedBannerDelegates; // 0x40
	TArray<DelegateProperty> ClosedAdDelegates; // 0x50
};

struct UTaleQuestAwaitEventStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UPhysicsSpringComponent {
	float SpringStiffness; // 0x2b0
	float SpringDamping; // 0x2b4
	float SpringLengthAtRest; // 0x2b8
	float SpringRadius; // 0x2bc
	ECollisionChannel SpringChannel; // 0x2c0
	bool bIgnoreSelf; // 0x2c1
	float SpringCompression; // 0x2c4
};

struct AMemoryTestPawn {
	float Speed; // 0x448
	FScriptMulticastDelegate OnIslandVisited; // 0x450
};

struct AGameNetworkManager {
	int32_t AdjustedNetSpeed; // 0x3d0
	float LastNetSpeedUpdateTime; // 0x3d4
	int32_t TotalNetBandwidth; // 0x3d8
	int32_t MinDynamicBandwidth; // 0x3dc
	int32_t MaxDynamicBandwidth; // 0x3e0
	char bIsStandbyCheckingEnabled : 1; // 0x3e4
	char bHasStandbyCheatTriggered : 1; // 0x3e4
	float StandbyRxCheatTime; // 0x3e8
	float StandbyTxCheatTime; // 0x3ec
	int32_t BadPingThreshold; // 0x3f0
	float PercentMissingForRxStandby; // 0x3f4
	float PercentMissingForTxStandby; // 0x3f8
	float PercentForBadPing; // 0x3fc
	float JoinInProgressStandbyWaitTime; // 0x400
	float MoveRepSize; // 0x404
	float MAXPOSITIONERRORSQUARED; // 0x408
	float MAXNEARZEROVELOCITYSQUARED; // 0x40c
	float CLIENTADJUSTUPDATECOST; // 0x410
	float MAXCLIENTUPDATEINTERVAL; // 0x414
	float MaxMoveDeltaTime; // 0x418
	bool ClientAuthorativePosition; // 0x41c
	float ClientErrorUpdateRateLimit; // 0x420
	bool bMovementTimeDiscrepancyDetection; // 0x424
	bool bMovementTimeDiscrepancyResolution; // 0x425
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x428
	float MovementTimeDiscrepancyMinTimeMargin; // 0x42c
	float MovementTimeDiscrepancyResolutionRate; // 0x430
	float MovementTimeDiscrepancyDriftAllowance; // 0x434
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x438
	bool bUseDistanceBasedRelevancy; // 0x439
};

struct UGameplayAbilityBlueprintGeneratedClass {
	int32_t NumReplicatedProperties; // 0x1c0
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x1c8
	TArray<UActorComponent*> ComponentTemplates; // 0x1d8
	TArray<UTimelineTemplate*> Timelines; // 0x1e8
	USimpleConstructionScript* SimpleConstructionScript; // 0x1f8
	UInheritableComponentHandler* InheritableComponentHandler; // 0x200
	UStructProperty* UberGraphFramePointerProperty; // 0x208
	UFunction* UberGraphFunction; // 0x210
	TArray<FEventGraphFastCallPair> FastCallPairs; // 0x218
};

struct ASpawnLocation {
	FString Description; // 0x400
};

struct UWaitForCrewToCollectCollectorsChestPagesStep {
	UWaitForCrewToCollectCollectorsChestPagesStepDesc* StepDesc; // 0x90
};

struct UBTTask_SpawnAndWieldItem {
	UItemDesc* ItemDesc; // 0x68
};

struct UPiratePreviewComponentPirateProfileRTT {
	AController* OwningPlayerController; // 0x2b8
};

struct UActorFlammableComponent {
	UParticleSystem* FireVFX; // 0xf8
	UParticleSystem* SteamVFX; // 0x100
	float FireVFXIntensity; // 0x108
};

struct UEelThrowAIAbilityParams {
	FWeightedProbabilityRange MinMaxNumberOfAttacksBeforeEnd; // 0xc8
};

struct UClueFactoryConfig {
	TArray<ULandClueCreator*> LandClueCreators; // 0x28
	TArray<USeaClueCreator*> SeaClueCreators; // 0x38
	UClueChoiceSelectionStrategy* ChoiceStrategy; // 0x48
	TArray<FRestrictedClueType> RestrictedClueTypes; // 0x50
};

struct UMaterialExpressionLightmassReplace {
	FExpressionInput Realtime; // 0x70
	FExpressionInput Lightmass; // 0xa8
};

struct USetSpawnProgressStep {
	USetSpawnProgressStepDesc* StepDesc; // 0x90
};

struct UTaleQuestParallelForeachStepDesc {
	uint32_t Count; // 0x80
	bool CanEditCount; // 0x84
	TMap<FName, FName> InputMappings; // 0x88
	UTaleQuestStepDesc* BodyDesc; // 0xd8
	UTaleQuestParallelForeachStep* Generator; // 0xe0
	UScriptStruct* Variables; // 0xe8
};

struct UVomitComponent {
	float VomitFxDurationWhenSpewingIntoBucket; // 0x5b0
	FVomitVFX VomitVFX; // 0x5b8
	FVomitSFX VomitSFX; // 0x7b8
	FVomitScreenFX VomitScreenFX; // 0x7f0
	FVomitProjectiles VomitProjectiles; // 0x820
	float ImmunityAgainstContractingAfterVomiting; // 0x870
	float ChanceForContractingVomitingIfBeingVomitedOn; // 0x874
	FFloatRange ContractedVomitingSpewDuration; // 0x878
	FFloatRange ContractedVomitingSpewDelay; // 0x888
	FName ContractedVomitVFXType; // 0x898
	float DebugInterval; // 0x8a0
	UVomitBoutData* BoutData; // 0x8a8
};

struct ALogVisualizerCameraController {
	AActor* PickedActor; // 0x778
};

struct UDeliverableCompanyRequirement {
	TArray<UCompany*> AcceptedCompanies; // 0x30
};

struct AProjectileService {
	TArray<FWeaponProjectile> DeadProjectiles; // 0x3f0
	TArray<FProjectileAttackGroup> ProjectileAttackGroups; // 0x448
	UAthenaProjectilesThrottledTickCollectionAsset* ProjectileThrottledTickData; // 0x4d8
};

struct USkyLightComponent {
	ESkyLightSourceType SourceType; // 0x2e0
	UTextureCube* Cubemap; // 0x2e8
	float SkyDistanceThreshold; // 0x2f0
	bool bLowerHemisphereIsBlack; // 0x2f4
	float OcclusionMaxDistance; // 0x2f8
	float Contrast; // 0x2fc
	float MinOcclusion; // 0x300
	FColor OcclusionTint; // 0x304
	float ScaleForInteriors; // 0x308
	UTextureCube* BlendDestinationCubemap; // 0x3b8
};

struct UAthenaGameSettings {
	int32_t NumberOfDaysInEachMonth; // 0x28
	FString EntryMap; // 0x30
	FString FrontendMap; // 0x40
	FString InGameMap; // 0x50
	FString TutorialMap; // 0x60
	FStringAssetReference PlayModeLevels; // 0x70
	FStringAssetReference FeatureToggledLevels; // 0x80
	FString OverrideServerURL; // 0x90
	float LoadLevelTimeoutTime; // 0xa0
	float ServiceBridgeConnectTimeout; // 0xa4
	UClass* VoiceChatRendererClass; // 0xa8
	UClass* GameNarrationCoordinatorClass; // 0xc8
	UClass* ApplicationSettingsClass; // 0xe8
	FStringAssetReference CinematicCameraControllerClass; // 0x108
	FStringAssetReference CinematicCameraSpectatorPawnClass; // 0x118
	FStringAssetReference MaterialTranslationTableFileLocation; // 0x128
	FStringAssetReference MaterialAudioTableFileLocation; // 0x138
	FStringAssetReference MaterialVFXTableFileLocation; // 0x148
	FStringAssetReference ShipAssetClassDatabaseFileLocation; // 0x158
	FStringAssetReference AIPersistentPartsServiceAssetClassFileLocation; // 0x168
	FStringAssetReference AIPartsServiceAssetClassFileLocation; // 0x178
	FStringAssetReference DebugMenuFileLocation; // 0x188
	FStringAssetReference SpawnLocationKeywordPriorityListLocation; // 0x198
	FStringAssetReference CrewSpawnLocationVariablesListAsset; // 0x1a8
	FStringAssetReference SkellyFortDataFileLocation; // 0x1b8
	FStringAssetReference SkellyFortListDataFileLocation; // 0x1c8
	FStringAssetReference AIShipServiceDataAssetFileLocation; // 0x1d8
	FToggleableAIShipServiceDataAssetFileLocation AIShipServiceDataAssetFileLocationOverride; // 0x1e8
	FStringAssetReference ProjectileServiceDataFileLocation; // 0x200
	FStringAssetReference ThrottledProjectileTickDataAssetLocation; // 0x210
	FStringAssetReference HoleDataFileLocation; // 0x220
	FStringAssetReference PlayerBuriedItemServiceDataFileLocation; // 0x230
	FStringAssetReference ItemLifetimeIslandCapsDataFileLocation; // 0x240
	FStringAssetReference CursedCannonballDataAsset; // 0x250
	FStringAssetReference Throwables; // 0x260
	UItemCategory* ThrowablesItemCategory; // 0x270
	FStringAssetReference SpawnableItemsDataAssetLocation; // 0x278
	FStringAssetReference FireworksDebugSpawnItemsDataAsset; // 0x288
	FStringAssetReference UnlockableEntitlementsDataAssetLocation; // 0x298
	FStringAssetReference DebugWieldablesDataAsset; // 0x2a8
	FStringAssetReference StrongholdKeyDataAsset; // 0x2b8
	FStringAssetReference MigrationUIContentsFileLocation; // 0x2c8
	FStringAssetReference ArenaMigrationUIContentsFileLocation; // 0x2d8
	FStringAssetReference InventoryRemappingAssetLocation; // 0x2e8
	FStringAssetReference AllianceSettingsAssetLocation; // 0x2f8
	FStringAssetReference ReapersMarkSettingsAssetLocation; // 0x308
	FStringAssetReference EmissaryLevelSettingsAssetLocation; // 0x318
	FStringAssetReference EmissaryRewardSettingsAssetLocation; // 0x328
	FStringAssetReference FlamesOfFateSettingsAssetLocation; // 0x338
	FStringAssetReference DiggingConfigResolverAssetLocation; // 0x348
	FStringAssetReference ContestSettingsDataAsset; // 0x358
	FStringAssetReference ContestEventsDataAsset; // 0x368
	FStringAssetReference CrewNotificationToastSettings; // 0x378
	FStringAssetReference FireSettingsDataAsset; // 0x388
	FString InventoryDefaultItemURL; // 0x398
	float CheatFlyingSpeedSlow; // 0x3a8
	float CheatFlyingSpeedDefault; // 0x3ac
	float CheatFlyingSpeedFast; // 0x3b0
	float CheatFlyingAcceleration; // 0x3b4
	FEncounterServiceParams EncounterServiceParams; // 0x3b8
	FWindServiceParams WindParams; // 0x3d8
	FCrewServiceParams CrewServiceParams; // 0x400
	FSharedShovelParams SharedShovelParams; // 0x460
	FMermaidServiceParams MermaidServiceParams; // 0x4c0
	FMermaidServiceParams ContestSpecificMermaidServiceParamsToggleLocked; // 0x548
	FMakeFriendsEmoteParams MakeFriendsEmoteParams; // 0x5d0
	FMermaidRespawnConfig MermaidRespawnConfiguration; // 0x5e8
	FCharacterSocketCollisionServiceParams CharacterSocketCollisionServiceParams; // 0x610
	FAthenaAICharacterParams AAthenaAICharacterParams; // 0x618
	int32_t AssumedMaxFPSOnServer; // 0x62c
	FName WwiseObjectUnderwaterStateSwitchGroup; // 0x630
	FName WwiseObjectUnderwaterSwitchDefaultState; // 0x638
	FName WwiseObjectUnderwaterSwitchUnderwaterState; // 0x640
	float StormQuantisePrecision; // 0x648
	FStringAssetReference ShipLiveryCatalogueDataAssetLocation; // 0x650
	FStringAssetReference ShipPartsCatalogueDataAssetLocation; // 0x660
	FStringAssetReference RowboatSpawnParamsDataAssetLocation; // 0x670
	FStringAssetReference KrakenTentacleClassLocation; // 0x680
	FStringAssetReference KrakenShipTentacleClassLocation; // 0x690
	FStringAssetReference KrakenServiceParamsDataAssetLocation; // 0x6a0
	FStringAssetReference AmbientTinySharkServiceParamsDataAssetLocation; // 0x6b0
	FStringAssetReference SunkenIslandSettings; // 0x6c0
	FStringAssetReference CompanyDataListAssetLocation; // 0x6d0
	FStringAssetReference CoherentUIGTAssetRootLocation; // 0x6e0
	FStringAssetReference CoherentUIGTPersistentDataAssetLocation; // 0x6f0
	FStringAssetReference CoherentContentEngagementMessageLocation; // 0x700
	FStringAssetReference NestedWorldRootDataAssetLocation; // 0x710
	FStringAssetReference AshenLordEncounterServiceParams; // 0x720
	FStringAssetReference PortalServiceParams; // 0x730
	FStringAssetReference AggressiveGhostShipsEncounterServiceParams; // 0x740
	TArray<UClass*> RequiredLoadoutCategories; // 0x750
	FStringAssetReference CarouselGenerationParams; // 0x760
	float SinkingShipDestructionDistanceThreshold; // 0x770
	FStringAssetReference DefaultItemsToBeDisplayedOnInventoryPanel; // 0x778
	AFogBank* DefaultFogBank; // 0x788
	AFogBankManager* DefaultFogBankManager; // 0x790
	FStringAssetReference TunnelsOfTheDamnedServiceParamsDataAssetLocation; // 0x798
	FPlayerModerationParams PlayerModerationParams; // 0x7a8
	FStringAssetReference SpireServiceParamsDataAssetLocation; // 0x7b8
};

struct ATestShipActorPhysicsErrorCorrection {
	FScriptMulticastDelegate OnGetPhysicsErrorCorrection; // 0x14d0
};

struct UAnimCompress_LeastDestructive {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct URadialContentRule {
	FText RadialTitle; // 0x28
	TArray<UNotificationInputId*> NotificationInputsToBlock; // 0x68
};

struct UMaterialExpressionLandscapeVisibilityMask {
	FGuid ExpressionGUID; // 0x70
};

struct AWieldableMysteriousNote {
	UMaybeCompressedCanvasRenderTarget2D* RenderTarget; // 0x7a0
	UWieldableMysteriousNoteLayout* NoteLayout; // 0x7a8
	int32_t CanvasWidth; // 0x7b0
	int32_t CanvasHeight; // 0x7b4
	float FontScale; // 0x7b8
	UNamedNotificationInputComponent* NamedNotificationInputComponent; // 0x810
	UUsableWieldableComponent* UsableWieldableComponent; // 0x818
	UInventoryItemComponent* InventoryItemComponent; // 0x820
};

struct USplashProbeVFXComponent {
	USplashProbeDataAsset* Probes; // 0xf0
	USplashProbeDataAsset* ProbesInstance; // 0xf8
	FActorComponentSelector AttachProbesToOwner; // 0x100
	USceneComponent* AttachProbesToComponent; // 0x110
};

struct UItemRadialContentRule {
	float RadialIconScale; // 0xd0
	FVector2D RadialIconOffset; // 0xd4
	UInventoryItemCategoryToSlotRemappingAsset* RemappingAsset; // 0xe0
	TArray<AItemInfo*> RemappedSlots; // 0xe8
};

struct UControllableObjectNonVerbalContentRule {
	UPhrasesRadialDataAsset* CurrentPhrases; // 0xa8
	UObject* ControlledObject; // 0xc0
};

struct UCoherentUIGTAssetContainer {
	TArray<UTexture2D*> TextureAssets; // 0x28
};

struct UMovieSceneNameableTrack {
	FMovieSceneTrackEvalOptions EvalOptions; // 0x80
};

struct ABootyProxy {
	URetractableComponent* RetractableComponent; // 0x7a8
	UItemProxyShipTrackerComponent* ItemProxyShipTrackerComponent; // 0x7b0
};

struct AVectorFieldVolume {
	UVectorFieldComponent* VectorFieldComponent; // 0x3d0
};

struct UParticleModuleMeshRotationRateOverLife {
	FRawDistributionVector RotRate; // 0x50
	char bScaleRotRate : 1; // 0x88
};

struct ULightingZoneService {
	TArray<TScriptInterface<Class>> RegisteredLightingZones; // 0x30
};

struct UWaitForAnimationStateExitProxy {
	FScriptMulticastDelegate OnStateExit; // 0x28
};

struct UOceanCrawlerAudioParamsDataAsset {
	UWwiseObjectPoolWrapper* WwiseObjectPoolWrapper; // 0x28
	TArray<FOceanCrawlerAudioKeyPair> AudioKeyPairs; // 0x30
	FWeightedProbabilityRangeOfRanges BuffThankDelay; // 0x40
	FOceanCrawlerBuffAudioSettings CrabBuffAudioSettings; // 0x70
	FOceanCrawlerBuffAudioSettings EelBuffAudioSettings; // 0x80
	FOceanCrawlerBuffAudioSettings HermitBuffAudioSettings; // 0x90
};

struct UBTTask_SetAIStrategy {
	UAIStrategyId* NewStrategy; // 0x60
};

struct UGenericWorldMapMarker {
	FCanvasWorldMapGeneric Marker; // 0xd0
	bool RegisterOnSpawn; // 0xf0
};

struct UAIPerCrewSpawner {
	UAIWeightedProbabilityRangeOfRangesRankProgression* DefaultRespawnTimerRanges; // 0x428
	int32_t MaxNumOfCrewsToSpawnFor; // 0x430
	bool ActivateBySettingFootOnIsland; // 0x434
	bool UseRespawnTimerForFirstSpawn; // 0x435
	bool AssociateSpawnsWithSpecificCrews; // 0x436
	bool PerceiveTriggerActorOnSpawn; // 0x437
	bool EnforceRespawnTimeAfterCrewLeaves; // 0x438
	bool IgnoreSpawningGracePeriodForNewCrew; // 0x439
};

struct UCutsceneMechanismActionComponent {
	FName CutsceneName; // 0x158
	AActor* CutSceneActor; // 0x160
};

struct UOpenableItemMetaGenerator {
	UScriptStruct* MetaWrapper; // 0x28
};

struct UBTTask_FlushQueuedAIAbility {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UKnockbackAIAbilityTriggerComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct ABurrowEruptBase {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct AStreamingProbe {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UInputActionDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct UPhysicsSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableAsyncScene; // 0x50
	bool bEnableShapeSharing; // 0x51
	bool bEnablePCM; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	ESettingsLockedAxis LockedAxis; // 0x55
	ESettingsDOF DefaultDegreesOfFreedom; // 0x56
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x68
	bool bDefaultHasComplexCollision; // 0x69
	float MaxPhysicsDeltaTime; // 0x6c
	bool bSubstepping; // 0x70
	bool bSubsteppingAsync; // 0x71
	float MaxSubstepDeltaTime; // 0x74
	int32_t MaxSubsteps; // 0x78
	float SyncSceneSmoothingFactor; // 0x7c
	float AsyncSceneSmoothingFactor; // 0x80
	float InitialAverageFrameRate; // 0x84
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x88
	TArray<FDominanceGroupPair> DominanceGroups; // 0x98
	TArray<FDominanceGroupName> DominanceGroupNames; // 0xa8
	EDominanceGroup DefaultStaticDominanceGroup; // 0xb8
	EDominanceGroup DefaultMovableDominanceGroup; // 0xb9
	bool bEnableMBP; // 0xba
	int32_t MBPSubdivisions; // 0xbc
	float MBPWorldHalfExtentInCM; // 0xc0
};

struct UAppearComponent {
	bool AppearOnStart; // 0xd0
	TArray<FAppearMaterialParams> MaterialParams; // 0xd8
	FScriptMulticastDelegate OnTriggerAppear; // 0xe8
	FScriptMulticastDelegate OnTriggerDisappear; // 0xf8
	FScriptMulticastDelegate OnSnapHidden; // 0x108
	bool IsVisible; // 0x118
	TArray<UMaterialInstanceDynamic*> DynamicMaterials; // 0x120
};

struct URammableDamageDataAsset {
	TArray<FRammableDamageSpeedEntry> DamageSpeedParams; // 0x28
};

struct UTaleQuestStructStepBase {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UTaleQuestGenerateClueSiteOnIslandStepDesc {
	FQuestVariableName IslandName; // 0x80
	FQuestVariableClueSite ClueSite; // 0x90
	UClueFactoryConfig* ClueGenerationConfiguration; // 0xa0
};

struct UCommodityPurchaseTrackingComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UTaleQuestAddCargoRunMapStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct ULevelSequence {
	UMovieScene* MovieScene; // 0x2a8
	FLevelSequenceObjectReferenceMap ObjectReferences; // 0x2b0
	TMap<FString, FLevelSequenceObject> PossessedObjects; // 0x350
};

struct UBTTask_ChangeHangoutAnimation {
	FBlackboardKeySelector BlackboardKey; // 0x60
};

struct UAbilityTask_WaitInputPress {
	FScriptMulticastDelegate OnPress; // 0x68
};

struct UMovieScene2DTransformSection {
	FRichCurve Translation[0x2]; // 0xa0
	FRichCurve Rotation; // 0x190
	FRichCurve Scale[0x2]; // 0x208
	FRichCurve Shear[0x2]; // 0x2f8
};

struct UCharacterPossessedEventTestComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UPickUpObjectConditionalStatTrigger {
	FName UniqueTextIdentifier; // 0x28
};

struct APulleyMechanism {
	UStaticMeshComponent* PulleyMesh; // 0x518
	UIntentBasedMechanismTriggerComponent* PulleyMechanismTriggerComponent; // 0x520
	UInteractableComponent* InteractableComponent; // 0x528
	bool CameraTracksMechanismsBeingPulled; // 0x530
	AActor* UnconnectedActorToTrack; // 0x538
	FVector DefaultLookAtLocation; // 0x540
	FLookAtOffsetParams CameraLookAtParams; // 0x54c
	UAnalogInputId* AnalogControls; // 0x568
	FText PulleyInteractionPrompt; // 0x570
	FText PulleyInteractionDisabledPrompt; // 0x5a8
};

struct ACampaignService {
	TArray<FActiveCampaignInfo> ActiveCampaigns; // 0x3e0
};

struct UMockPostPhysicsTickerComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UBTTask_FlushQueuedEngageEnemyMethod {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct UClothingLoadoutContainsItemRadialContext {
	UClothingDesc* TargetItem; // 0x28
};

struct UParticleModuleMeshRotation_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x90
};

struct UHttpClientComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UGatedHealthComponent {
	uint32_t NumOfGates; // 0x240
};

struct UShipCustomizationLoadoutComponent {
	FShipCustomizationLoadout Loadout; // 0xe0
	AShip* Ship; // 0x108
	UShipSize* ShipSize; // 0x110
	FShipCustomizationLoadoutPartCustomizations ActivePartCustomizations; // 0x148
};

struct UCursor_C {
	UImage* Image_158; // 0x230
};

struct UMovieSceneSkeletalAnimationSection {
	FMovieSceneSkeletalAnimationParams Params; // 0x98
	UAnimSequence* AnimSequence; // 0x130
	UAnimSequenceBase* Animation; // 0x138
	float StartOffset; // 0x140
	float EndOffset; // 0x144
	float PlayRate; // 0x148
	char bReverse : 1; // 0x14c
	FName SlotName; // 0x150
};

struct UEmblemService {
	TArray<UPopUpMessageDesc*> GarbageCollectorVisiblePopups; // 0x30
	TArray<UPopUpAudioDesc*> GarbageCollectorPopupAudioOverrides; // 0x40
};

struct AEquipmentChestInteraction {
	TArray<UItemCategory*> Categories; // 0x438
	bool AllTab; // 0x448
};

struct ULiquidContainerTestMaterial {
	UPhysicalMaterial* PhysMaterial; // 0x58
	FColorMaterialInput DiffuseColor; // 0x60
	FColorMaterialInput SpecularColor; // 0xa0
	FColorMaterialInput BaseColor; // 0xe0
	FScalarMaterialInput Metallic; // 0x120
	FScalarMaterialInput Specular; // 0x160
	FScalarMaterialInput Roughness; // 0x1a0
	FVectorMaterialInput Normal; // 0x1e0
	FColorMaterialInput EmissiveColor; // 0x228
	FScalarMaterialInput Opacity; // 0x268
	FScalarMaterialInput OpacityMask; // 0x2a8
	EMaterialDomain MaterialDomain; // 0x2e8
	EBlendMode BlendMode; // 0x2e9
	EDecalBlendMode DecalBlendMode; // 0x2ea
	bool bDecalNoEmissiveOrRoughness; // 0x2eb
	bool bDecalEnableStencil; // 0x2ec
	EMaterialDecalResponse MaterialDecalResponse; // 0x2ed
	EMaterialShadingModel ShadingModel; // 0x2ee
	float OpacityMaskClipValue; // 0x2f0
	float DepthWeightScale; // 0x2f4
	float DepthWeightExponent; // 0x2f8
	float DepthWeightBase; // 0x2fc
	char bBlendedOITAfterTranslucency : 1; // 0x300
	char bForceResolution : 1; // 0x300
	ELowResTranslucencyCascade ForcedResolution; // 0x304
	float FirstSplitDistance; // 0x308
	float SecondSplitDistance; // 0x30c
	float FullResInFrontMaxDistance; // 0x310
	char FullResInFront : 1; // 0x314
	char PopPerParticle : 1; // 0x314
	FVectorMaterialInput WorldPositionOffset; // 0x318
	FVectorMaterialInput WorldDisplacement; // 0x360
	FScalarMaterialInput TessellationMultiplier; // 0x3a8
	FColorMaterialInput SubsurfaceColor; // 0x3e8
	FScalarMaterialInput ClearCoat; // 0x428
	FScalarMaterialInput ClearCoatRoughness; // 0x468
	FScalarMaterialInput AmbientOcclusion; // 0x4a8
	FScalarMaterialInput Refraction; // 0x4e8
	FColorMaterialInput BillboardColor; // 0x528
	FVectorMaterialInput BillboardParams; // 0x568
	FVector2MaterialInput CustomizedUVs[0x8]; // 0x5b0
	FMaterialAttributesInput MaterialAttributes; // 0x7f0
	FScalarMaterialInput PixelDepthOffset; // 0x838
	char bTranslucentBeforeTranslucency : 1; // 0x878
	char bTranslucentBeforeVolumeFog : 1; // 0x878
	char bTranslucentWithDepthWrite : 1; // 0x878
	char bEnableSeparateTranslucency : 1; // 0x878
	char bEnableResponsiveAA : 1; // 0x878
	char bScreenSpaceReflections : 1; // 0x878
	char TwoSided : 1; // 0x878
	char DitheredLODTransition : 1; // 0x878
	EConstantMaterial ConstantMaterial; // 0x87c
	float SkyLightWhenOccluded; // 0x880
	float CloudShadowsInfluence; // 0x884
	int32_t NumCustomizedUVs; // 0x888
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x88c
	float TranslucencyDirectionalLightingIntensity; // 0x890
	float LightColorInfluence; // 0x894
	float AmbientLightColorInfluence; // 0x898
	float LightIntensityInfluence; // 0x89c
	float AmbientLightIntensityInfluence; // 0x8a0
	float AlternativeAmbientLightColorInfluence; // 0x8a4
	float AlternativeAmbientLightIntensityInfluence; // 0x8a8
	char bEvaluateLightningAtParticleCenter : 1; // 0x8ac
	float TranslucencyScaleForReflection; // 0x8b0
	char bObjectFadeEnabled : 1; // 0x8b4
	float ObjectFadeRate; // 0x8b8
	float ObjectFadeDistanceThreshold; // 0x8bc
	float TranslucentShadowDensityScale; // 0x8c0
	float TranslucentSelfShadowDensityScale; // 0x8c4
	float TranslucentSelfShadowSecondDensityScale; // 0x8c8
	float TranslucentSelfShadowSecondOpacity; // 0x8cc
	float TranslucentBackscatteringExponent; // 0x8d0
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x8d4
	float TranslucentShadowStartOffset; // 0x8e4
	float VolumeFogScale; // 0x8e8
	char DistanceFog : 1; // 0x8ec
	char bDisableDepthTest : 1; // 0x8ec
	char bGenerateSphericalParticleNormals : 1; // 0x8ec
	char bDontRenderWhenPlayerInsideShip : 1; // 0x8ec
	char bTangentSpaceNormal : 1; // 0x8ec
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x8ec
	char bBlockGI : 1; // 0x8ec
	char bUsedAsSpecialEngineMaterial : 1; // 0x8ec
	char bUsedWithSkeletalMesh : 1; // 0x8ed
	char bUsedWithEditorCompositing : 1; // 0x8ed
	char bUsedWithLandscape : 1; // 0x8ed
	char bUsedWithParticleSprites : 1; // 0x8ed
	char bUsedWithCPUParticleSprites : 1; // 0x8ed
	char bUsedWithStaticMesh : 1; // 0x8ed
	char bUsedWithCoverage : 1; // 0x8ed
	char bUsedWithGPUInstanceCulling : 1; // 0x8ed
	char bUsedWithBeamTrails : 1; // 0x8ee
	char bUsedWithMeshParticles : 1; // 0x8ee
	char bUsedWithStaticLighting : 1; // 0x8ee
	char bUsedWithFluidSurfaces : 1; // 0x8ee
	char bUsedWithMorphTargets : 1; // 0x8ee
	char bUsedWithSplineMeshes : 1; // 0x8ee
	char bUsedWithInstancedStaticMeshes : 1; // 0x8ee
	char bUsesDistortion : 1; // 0x8ee
	char bUsedWithClothing : 1; // 0x8ef
	char bUsedWithDeformables : 1; // 0x8ef
	char bUsedWithFFTWaterMask : 1; // 0x8ef
	char bUsedWithVolumeFogMask : 1; // 0x8ef
	char bUsedWithDynamicObjectFading : 1; // 0x8ef
	char bUsedWithWaterBoundary : 1; // 0x8ef
	char bUsedWithClouds : 1; // 0x8ef
	char bUsedWithInstancedRopes : 1; // 0x8ef
	char bUsedWithPlanarReflection : 1; // 0x8f0
	char bUsedWithPointLightShadows : 1; // 0x8f0
	char bUsedWithMaskPass : 1; // 0x8f0
	char bUsedWithUI : 1; // 0x8f0
	char bAutomaticallySetUsageInEditor : 1; // 0x8f0
	char bAllowEmissiveOnLandscape : 1; // 0x8f0
	char bApplyWaterMask : 1; // 0x8f0
	char bUseReZ : 1; // 0x8f0
	char bFullyRough : 1; // 0x8f1
	char bUseLightmapDirectionality : 1; // 0x8f1
	EMaterialGeometryMode GeometryMode; // 0x8f4
	EMaterialTessellationMode D3D11TessellationMode; // 0x8f5
	char bEnableCrackFreeDisplacement : 1; // 0x8f8
	char bEnableAdaptiveTessellation : 1; // 0x8f8
	float MaxDisplacement; // 0x8fc
	char Wireframe : 1; // 0x900
	char bOutputVelocityOnBasePass : 1; // 0x900
	float NormalOffsetShadowBiasScale; // 0x904
	int32_t EditorX; // 0x908
	int32_t EditorY; // 0x90c
	int32_t EditorPitch; // 0x910
	int32_t EditorYaw; // 0x914
	TArray<UMaterialExpression*> Expressions; // 0x918
	TArray<FMaterialFunctionInfo> MaterialFunctionInfos; // 0x928
	TArray<FMaterialParameterCollectionInfo> MaterialParameterCollectionInfos; // 0x938
	char bCanMaskedBeAssumedOpaque : 1; // 0x948
	char bIsMasked : 1; // 0x948
	char bIsPreviewMaterial : 1; // 0x948
	char bUseMaterialAttributes : 1; // 0x948
	char bUseTranslucencyVertexFog : 1; // 0x948
	char bUseDensityMapOnTranslucencyVertexFog : 1; // 0x948
	char bAllowDevelopmentShaderCompile : 1; // 0x948
	char bIsMaterialEditorStatsMaterial : 1; // 0x948
	uint32_t UsageFlagWarnings; // 0x94c
	EBlendableLocation BlendableLocation; // 0x950
	int32_t BlendablePriority; // 0x954
	char bIsAlphaBlended : 1; // 0x958
	float RefractionDepthBias; // 0x95c
	FGuid StateId; // 0x960
	int32_t UnwrappedUVSet; // 0x970
	TArray<UTexture*> ExpressionTextureReferences; // 0xa00
};

struct UMovieSceneParticleParameterTrack {
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct AMerchantCrate {
	FMerchantCrateSfx FullCrateSfx; // 0x790
	TScriptInterface<Class> MountpointInterface; // 0x7b0
};

struct UTaleQuestParallelStep {
	TArray<UTaleQuestStep*> Steps; // 0x98
	UTaleQuestParallelStepDesc* Desc; // 0xa8
};

struct UGoldInContainerComponent {
	FRewardId GoldRewardId; // 0x620
};

struct AMapFixtureTestGameMode {
	char bDisableAsyncOcclusionChecking : 1; // 0x3d8
	char bUseSeamlessTravel : 1; // 0x3d8
	char bPauseable : 1; // 0x3d8
	char bStartPlayersAsSpectators : 1; // 0x3d8
	char bDelayedStart : 1; // 0x3d8
	FString OptionsString; // 0x3e0
	APawn* DefaultPawnClass; // 0x3f0
	AHUD* HUDClass; // 0x3f8
	int32_t NumSpectators; // 0x400
	int32_t NumPlayers; // 0x404
	int32_t NumBots; // 0x408
	float MinRespawnDelay; // 0x40c
	AGameSession* GameSession; // 0x410
	int32_t NumTravellingPlayers; // 0x418
	FText DefaultPlayerName; // 0x420
	ULocalMessage* EngineMessageClass; // 0x458
	APlayerController* PlayerControllerClass; // 0x460
	ASpectatorPawn* SpectatorClass; // 0x468
	APlayerController* ReplaySpectatorPlayerControllerClass; // 0x470
	APlayerState* PlayerStateClass; // 0x478
	AGameState* GameStateClass; // 0x480
	AGameState* GameState; // 0x488
	TArray<APlayerState*> InactivePlayerArray; // 0x490
	TArray<FGameClassShortName> GameModeClassAliases; // 0x4b0
	float InactivePlayerStateLifeSpan; // 0x4c0
	bool bHandleDedicatedServerReplays; // 0x4c4
};

struct UAIShipTelemetryComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct AGameSession {
	int32_t MaxSpectators; // 0x3d0
	int32_t MaxPlayers; // 0x3d4
	char MaxSplitscreensPerConnection; // 0x3d8
	bool bRequiresPushToTalk; // 0x3d9
	FName SessionName; // 0x3dc
};

struct UNPCOnShipDataAsset {
	UNPCOnSurfaceDataAsset* NPCOnSurfaceDataAsset; // 0x28
	TArray<FName> RestrictedIslands; // 0x30
	FWeightedProbabilityRangeOfRanges PlayersLeftShipRespawnCooldown; // 0x40
	float TimeBetweenShipStateChecks; // 0x70
	float TimeBetweenNPCUnderwaterChecks; // 0x74
	float TimeBetweenNPCOnFireChecks; // 0x78
	float EnemyShipNearbyDistanceXYInMetres; // 0x7c
	float TimeBetweenRadialStateChecks; // 0x80
	float TimeBetweenHideWhenInDangerChecks; // 0x84
};

struct ULockOnCameraModifier {
	ULockOnCameraModifierSettings* Settings; // 0x48
	bool IsYawLocked; // 0x50
	bool OwnerInputsIgnored; // 0x51
	AActor* TargetActor; // 0x58
};

struct UDoesNameContainsStatCondition {
	FName TargetNameSubString; // 0x30
};

struct AVolumeMechanismTrigger {
	UMechanismTriggerComponent* MechanismTriggerComponent; // 0x3d0
	UBoxComponent* TriggerVolume; // 0x3d8
	bool UsePerCrewOverlaps; // 0x3e0
	int32_t PerCrewOverlapCooldownTimeInSeconds; // 0x3e4
};

struct UPirateGeneratorMaterials {
	TArray<UMaterialInterface*> Materials; // 0x28
};

struct UMaterialExpressionBlackBody {
	FExpressionInput Temp; // 0x70
};

struct UBTTask_PetWaitForAnimationRoamingState {
	TArray<EAthenaAnimationPetRoamingState> SuccessRoamingStates; // 0x60
	TArray<EAthenaAnimationPetRoamingState> FailRoamingStates; // 0x70
};

struct ACookingPot {
	UStaticMeshComponent* MeshComponent; // 0x400
	UActionRulesInteractableComponent* InteractableComponent; // 0x408
	UCookerComponent* CookerComponent; // 0x410
	float HoldToInteractTime; // 0x418
	FText NotWieldingCookableItemTooltip; // 0x420
	FText WieldingCookableItemTooltip; // 0x458
	FText TakeItemTooltip; // 0x490
	FText CannotTakeItemTooltip; // 0x4c8
	FText MixInItemTooltip; // 0x500
};

struct UTaleQuestLocationMapChestFoundStepDesc {
	FName MapId; // 0x80
};

struct UInterpTrackInstMove {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UMaterialExpressionObjectOrientation {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UCrowdManager {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	char bResolveCollisions : 1; // 0x68
};

struct UIsDrunkStatCondition {
	float MinimumDrunkennessRequired; // 0x30
};

struct UZoomMapParamsDataAsset {
	float Offset; // 0x28
	float ZoomLevel; // 0x2c
	float XMarkSizeModifier; // 0x30
	float MaxDistanceFromCentreToDigspot; // 0x34
};

struct UDrumItemCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UPlanarReflectionPlaneComponent {
	USceneComponent* AttachParent; // 0xc8
	TArray<USceneComponent*> AttachChildren; // 0xd0
	FName AttachSocketName; // 0xe0
	char bRequiresCustomLocation : 1; // 0xe8
	char bAbsoluteLocation : 1; // 0xe8
	char bAbsoluteTranslation : 1; // 0xe8
	char bAbsoluteRotation : 1; // 0xe8
	char bAbsoluteScale : 1; // 0xe8
	char bVisible : 1; // 0xe8
	char bHiddenInGame : 1; // 0xe8
	char bShouldUpdatePhysicsVolume : 1; // 0xe8
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0xe9
	char bUseAttachParentBound : 1; // 0xe9
	char bComponentIsUnionOfChildren : 1; // 0xe9
	char bJitterReduction : 1; // 0xe9
	char CacheRootVelocity : 1; // 0xe9
	char bWorldToComponentUpdated : 1; // 0xe9
	TWeakObjectPtr<APhysicsVolume> PhysicsVolume; // 0xf8
	FVector RelativeScale3D; // 0x11c
	FVector RelativeLocation; // 0x128
	FRotator RelativeRotation; // 0x134
	EComponentMobility Mobility; // 0x220
	EDetailMode DetailMode; // 0x221
	FVector ComponentVelocity; // 0x22c
	FScriptMulticastDelegate PhysicsVolumeChangedDelegate; // 0x238
	TArray<FName> SocketVelocitiesToCache; // 0x258
};

struct UReflectionCaptureComponent {
	bool bLockSettings; // 0x2b0
	float Brightness; // 0x2b4
	float ShadowBrightness; // 0x2b8
	float LPVOcclusionBrightness; // 0x2bc
	FLinearColor ReflectionTint; // 0x2c0
	FGuid StateId; // 0x2dc
};

struct AOnlineAthenaPlayerController {
	FMysteriousNotesCompletionEventsModelEntry LogoutNoteCompletionIdent; // 0x1490
	FIdleTimeTracker IdleTimeTracker; // 0x1498
	bool IdleDisconnectEnabled; // 0x14d1
};

struct UCameraComponent {
	float FieldOfView; // 0x2b0
	float OrthoWidth; // 0x2b4
	float OrthoNearClipPlane; // 0x2b8
	float OrthoFarClipPlane; // 0x2bc
	float AspectRatio; // 0x2c0
	char bConstrainAspectRatio : 1; // 0x2c4
	char bUseFieldOfViewForLOD : 1; // 0x2c4
	char bUsePawnControlRotation : 1; // 0x2c4
	ECameraProjectionMode ProjectionMode; // 0x2c8
	float PostProcessBlendWeight; // 0x2cc
	FPostProcessSettings PostProcessSettings; // 0x2d0
	char bUseControllerViewRotation : 1; // 0x810
};

struct UBTTask_BroadcastOceanCrawlerAbilityAudioEvent {
	EOceanCrawlerAbilityAudioKey OceanCrawlerAudioKeyToBroadcast; // 0x60
};

struct AContestManagerService {
	UContestServiceTelemetryComponent* ContestServiceTelemetryComponent; // 0x3e0
	UContestSpawnLocationsComponent* CrewSpawnLocationsComponent; // 0x3e8
	UContestRewardComponent* ContestRewardComponent; // 0x3f0
	UContestCeremoniesComponent* ContestCeremoniesComponent; // 0x3f8
	UContestUIComponent* ContestUIComponent; // 0x400
	UContestTeamAssignmentComponent* ContestTeamAssignmentComponent; // 0x410
	EContestState CurrentContestState; // 0x418
	int64_t StateEndTime; // 0x420
	TArray<FTrackedCrewInContest> TrackedCrewsInContest; // 0x580
	TArray<AAthenaPlayerState*> BackfilledPlayers; // 0x5d0
	TArray<FGuid> ContestsPlayedCountBlacklist; // 0x5e0
	UEmergentContestVoyageRecipeDataAsset* CurrentContestVoyageDataAsset; // 0x660
	UTallTaleContestRecipeDataAsset* CurrentTallTaleContestDataAsset; // 0x668
	FText ArenaName; // 0x6a8
	UContestVoyagesDataAsset* ContestVoyages; // 0x800
	FAchievementCompleteContest CompleteContestAchievementRewarder; // 0x888
	UContestScoreSystem* ScoreSystem; // 0x8b0
	UContestShipCatalogueDataAsset* ContestShipAppearences; // 0x8b8
	FContestUIDescriptions ContestUIDescriptions; // 0x8c0
	AAthenaContestTavern* ContestStagingTavern; // 0x940
	APawn* TavernPawnType; // 0x948
	UCompany* ArenaCompany; // 0x950
	UConditionalStatsTriggerType* StatTriggerForCompletingAContest; // 0x958
	UConditionalStatsTriggerType* StatTriggerForShipsCompletingContest; // 0x960
	FGuid ContestUniqueId; // 0x98c
	AContestManagerDebugRepActor* DebugRepActor; // 0x9a0
	TArray<AController*> PlayersNeedingTeleport; // 0x9b8
	TArray<AController*> PlayersAwaitingContestRespawn; // 0x9c8
	TArray<UItemCategory*> ItemsToReset; // 0x9d8
	TArray<FCrewScore> CachedLeaderboard; // 0xa08
	FContestCrewRequirementData InitialStagingRequirements; // 0xa20
	FContestCrewRequirementData FallbackStagingRequirements; // 0xa48
	FContestCrewRequirementData ContestRequirements; // 0xa70
	UItemDesc* ScoreScrollDesc; // 0xa98
	AItemInfo* ScoreScrollItem; // 0xaa0
	int32_t CurrentPeriod; // 0xad4
	TArray<FGuid> CrewsRequestingMigration; // 0xad8
};

struct UWieldableItemAnimationInstance {
	FObjectMessagingDispatcher MessagingDispatcher; // 0x450
	TArray<FInputSequencePair> OneShotAnimationSequence; // 0x4f0
	TArray<FInputSequencePair> OneShotAnimationAlternateSequence; // 0x500
	TArray<FInputMontagePair> ContinuousUseAnimationSequence; // 0x510
	TArray<FInputMontagePair> ContinuousUseAnimationAlternateSequence; // 0x520
	UAnimSequenceBase* EquipItemAnimationSequence; // 0x530
	UAnimSequenceBase* UnequipItemAnimationSequence; // 0x538
	bool OneShotIsAlternate; // 0x540
	bool ContinuousIsAlternate; // 0x541
	bool DisableBlending; // 0x542
	UAnimMontage* CurrentMontage; // 0x620
};

struct AGameState {
	AGameMode* GameModeClass; // 0x3d0
	AGameMode* AuthorityGameMode; // 0x3d8
	ASpectatorPawn* SpectatorClass; // 0x3e0
	FName MatchState; // 0x3e8
	FName PreviousMatchState; // 0x3f0
	int32_t ElapsedTime; // 0x3f8
	TArray<APlayerState*> PlayerArray; // 0x400
	float ReplicatedWorldTimeSeconds; // 0x410
	float ServerWorldTimeSecondsDelta; // 0x414
	float ServerWorldTimeSecondsUpdateFrequency; // 0x418
};

struct UPlayerActivityIconCatalogueDataAsset {
	TArray<FPlayerActivityIconInfo> PlayerActivityIcons; // 0x28
};

struct UParticleModuleVelocityCone {
	FRawDistributionFloat Angle; // 0x58
	FRawDistributionFloat Velocity; // 0x90
	FVector Direction; // 0xc8
	char bUseGroupAForAll : 1; // 0xd4
	FVelocityConeGroupParams AdditionalParams[0x5]; // 0xd8
	uint32_t VelocityDistributeOverNPoints; // 0x358
	float VelocityNPointsRandomness; // 0x35c
	FVector AdditiveVelocity; // 0x360
	float ConeDepthScale; // 0x36c
	char WorldSpaceOffset : 1; // 0x370
	FVector EmitterOriginOffset; // 0x374
	float PushAwayFromCenterFactor; // 0x380
};

struct UTallTaleIslandEventType {
	FIslandEventIcons IslandIcons; // 0x28
	FIslandEventIcons HeaderIcons; // 0x38
};

struct ALocationMap {
	TArray<FMapTextureRenderData> CachedRenderData; // 0x840
	TArray<UMapMarkId*> MarkIds; // 0x850
};

struct UObtainClueOnWieldComponent {
	UClueDescriptor* ClueToObtain; // 0x140
	UClueSiteType* ClueSiteType; // 0x148
};

struct UParticleModuleVelocityConeEmitterPoint {
	FRawDistributionFloat Angle; // 0x58
	FRawDistributionFloat VelocityScale; // 0x90
	uint32_t VelocityDistributeOverNPoints; // 0xc8
	float VelocityNPointsRandomness; // 0xcc
	FVector AdditiveVelocity; // 0xd0
};

struct APoseableMeshWieldableReplica {
	UPrimitiveComponent* MeshComponent; // 0x3d8
	UCosmeticItemAnimationSetDataAsset* CachedAnimationSet; // 0x3e0
	UItemCategory* ReplicaCategory; // 0x3e8
};

struct UTelemetryProgressStepDesc {
	FString Progression; // 0x80
	FTelemetryStepContext TelemetryContext; // 0x90
};

struct UAbilityTask_WaitConfirm {
	FScriptMulticastDelegate OnConfirm; // 0x68
};

struct UTaleEnchantedSpyglassServiceDesc {
	UItemDesc* EnchantedSpyglassDesc; // 0x30
};

struct UActorSequencePlayer {
	FScriptMulticastDelegate OnPlay; // 0x390
	FScriptMulticastDelegate OnStop; // 0x3a0
	FScriptMulticastDelegate OnPause; // 0x3b0
	char bIsPlaying : 1; // 0x3c0
	char bReversePlayback : 1; // 0x3c0
	char bPendingFirstUpdate : 1; // 0x3c0
	UMovieSceneSequence* Sequence; // 0x3c8
	float TimeCursorPosition; // 0x3d0
	float StartTime; // 0x3d4
	float EndTime; // 0x3d8
	int32_t CurrentNumLoops; // 0x3dc
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x3f0
};

struct UKrakenAICharacterAudioComponentParams {
	UWwiseEvent* PlayKrakenAmbience; // 0x28
	UWwiseEvent* StopKrakenAmbience; // 0x30
	UWwiseEvent* PlayKrakenTell; // 0x38
	float PlayKrakenTellCooldownMax; // 0x40
	float PlayKrakenTellCooldownMin; // 0x44
};

struct UFFTWaterComponent {
	FFFTWaterComponentParams WaterParams; // 0x598
	UModel* Brush; // 0x8a8
	UBodySetup* BrushBodySetup; // 0x8b0
	FVector PrePivot; // 0x8b8
	UMaterialInterface* LightFunctionMaterial; // 0x948
	UMaterial* DefaultLightFunctionMaterial; // 0x950
};

struct UBTDecorator_IsOccupyingHangoutSpotWithGivenId {
	TArray<FHangoutSpotId> SuccessIds; // 0x68
};

struct UDebugCreateAndPlayNpcAnimationStep {
	UDebugCreateAndPlayNpcAnimationStepDesc* StepDesc; // 0x90
	UNPCDialogComponent* NPCDialogComponent; // 0xa8
	ACutSceneActor* CutSceneActor; // 0xb0
	AActor* SpawnedActor; // 0xb8
	APlaceableReaction* PlaceableReactionActor; // 0xc0
};

struct AWaterSlide {
	USplineComponent* SlideSpline; // 0x3d8
	USceneComponent* Root; // 0x3e0
	UWaterSlideParamsDataAsset* WaterSlideParamsDataAsset; // 0x3e8
	UPrimitiveComponent* EntranceCollisionComponent; // 0x3f0
	AWaterSlide* ContinuedWaterSlideRoute; // 0x3f8
	AWaterSlide* LeftWaterSlideRoute; // 0x400
	AWaterSlide* RightWaterSlideRoute; // 0x408
	bool IsEndOfSlide; // 0x410
	FVector EndOfSlideLaunchForce; // 0x414
	UWaterSlideAudioParams* WaterSlideAudioParams; // 0x420
};

struct AReceiverPuzzleStatue {
	uint8_t CurrentStatueConfiguration; // 0x458
	char InitialStatueConfiguration; // 0x45a
	USceneComponent* ConfigurationPositionPivot; // 0x460
	UCurveFloat* PositionTransitionCurve; // 0x468
	TArray<FPuzzleStatueConfigurationPosition> Positions; // 0x470
	UReceiverPuzzleStatueAudioParamsDataAsset* ReceiverAudioParams; // 0x480
};

struct UAnimNotifyAdditionalEventsWwiseEmitterComponent {
	TArray<FAnimNotifyWwiseObserver> AnimNotifyObservers; // 0x2e0
};

struct UAnimationSwitchDataAsset {
	float Threshold; // 0x28
	TArray<FAnimationSwitchEntry> Entries; // 0x30
};

struct UParticleModuleOrbit {
	EOrbitChainMode ChainMode; // 0x58
	FRawDistributionVector OffsetAmount; // 0x60
	FOrbitOptions OffsetOptions; // 0x98
	FRawDistributionVector RotationAmount; // 0xa0
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x118
};

struct UCapstanMechanismTriggerComponent {
	EMechanismTriggerType TriggerType; // 0xd8
	FScriptMulticastDelegate OnMechanismActionRegisteredWithTriggerDelegate; // 0xe0
	FScriptMulticastDelegate OnMechanismActionUnregisteredWithTriggerDelegate; // 0xf0
	FScriptMulticastDelegate OnMechanismTriggerChangedMechanismActionStatesDelegate; // 0x100
	FScriptMulticastDelegate OnMechanismTriggerStateChangedDelegate; // 0x110
	FScriptMulticastDelegate OnMechanismTriggerResetDelegate; // 0x120
	EMechanismTriggerState TriggerState; // 0x140
};

struct UOpenableItemAnimationInstance {
	UAnimSequence* ClosedTransitionAnim; // 0x440
	UAnimSequence* ClosedLoopAnim; // 0x448
	UAnimSequence* OpenTransitionAnim; // 0x450
	UAnimSequence* FirstOpenTransitionAnim; // 0x458
	UAnimSequence* OpenLoopAnim; // 0x460
	float BlendInTime; // 0x468
	float BlendOutTime; // 0x46c
	UAnimMontage* CurrentMontage; // 0x470
	UAnimSequence* NextAnim; // 0x478
	EOpenableItemState CurrentAnimOpenState; // 0x480
};

struct UTaleQuestChooseLandOrSeaStepDesc {
	USeaClueSiteTypesDataAsset* SeaClueSiteTypes; // 0x80
	float ProjectionAngleInDegrees; // 0x88
	float MinProjectionProportion; // 0x8c
	float MaxProjectionProportion; // 0x90
	float LandClueChanceWhenPreviousClueWasSea; // 0x94
	float LandClueChanceWhenPreviousClueWasLand; // 0x98
	FQuestVariableVector ProjectionPoint; // 0xa0
	FQuestVariableTradeRouteData TradeRouteData; // 0xb0
	FQuestVariableBool IsSeaLocation; // 0xc0
	FQuestVariableNameArray ValidIslandNames; // 0xd0
};

struct UCameraAnim {
	UInterpGroup* CameraInterpGroup; // 0x28
	float AnimLength; // 0x30
	FBox BoundingBox; // 0x34
	char bRelativeToInitialTransform : 1; // 0x50
	float BaseFOV; // 0x54
	FPostProcessSettings BasePostProcessSettings; // 0x60
	float BasePostProcessBlendWeight; // 0x5a0
};

struct UNPCDialogPredicateAtHealthStage {
	int32_t ActorIdx; // 0x38
	int32_t HealthStage; // 0x3c
};

struct AMechanismsService {
	TArray<FInteractableMechanismIslandData> RegisteredMechanisms; // 0x3e8
	TArray<FActorsOverlappingMechanismData> OverlappingActors; // 0x3f8
};

struct UHorizontalBoxSlot {
	FMargin Padding; // 0x38
	FSlateChildSize Size; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UAIFormTypeList {
	TArray<UAthenaAIFormDataAsset*> AllForms; // 0x28
	UAthenaAIFormDataAsset* DefaultForm; // 0x38
};

struct UCharacterFlammableComponent {
	float FireFalloffDuration; // 0x140
	float FireRateOfFalloffInRain; // 0x144
	float FireFalloffMultiplier; // 0x148
	FName VfxSocketName; // 0x14c
	FTransform SocketRelativeOffset; // 0x160
	UWorld* CachedWorld; // 0x218
	UFireSettingsDataAsset* FireSettingsAsset; // 0x228
};

struct UDeliverableRedirectionNPCContext {
	FNPCData NPCData; // 0x28
};

struct UPeriodicAINoiseEventComponent {
	FName NoiseTag; // 0xc8
	bool NoiseRangeBasedOnMovementSpeed; // 0xd0
	float ConstantNoiseRange; // 0xd4
	UCurveFloat* MovementSpeedToNoiseRange; // 0xd8
	AActor* OwnerActor; // 0xe0
};

struct UContestServiceTelemetryComponent {
	AContestManagerService* ContestManagerParent; // 0xc8
	FString ServerId; // 0x128
};

struct ATargetPoint {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct ACursedCaptainsSkullWieldable {
	UPrimitiveComponent* FirstPersonMesh; // 0x428
	UPrimitiveComponent* ThirdPersonMesh; // 0x430
	UActionRulesComponent* ActionRulesComponent; // 0x438
	UWieldableItemAnimationStoreId* AnimationKey; // 0x440
	FObjectMessagingDispatcher MessagingDispatcher; // 0x448
	FTransform AnimationOffset; // 0x4f0
	UWwiseEvent* EquipSfx; // 0x520
	UWwiseEvent* UnequipSfx; // 0x528
	UWwiseEvent* WielderLandedJumpSfx; // 0x530
	UWwiseEvent* WielderFootstepLayerOneshot; // 0x538
	FName PlayerWalkSpeedRtpc; // 0x540
	UWwiseEvent* FirstTimeEquipSfx; // 0x548
	bool ForceUnequipSfx; // 0x550
	EWieldableItemSize ItemSize; // 0x551
	FDetailAppearenceDesc DetailAppearence; // 0x558
	bool PropagateVisibilityToChildren; // 0x588
	FName AINoiseTag; // 0x58c
	TArray<FName> ThirdPersonExtraMeshNames; // 0x598
	TArray<FName> StashedExtraMeshNames; // 0x5a8
	UMeshComponent* StashedMeshComponent; // 0x5b8
	FName StashedMeshAttachSocket; // 0x5c0
	FName ServerWieldAttachSocket; // 0x5c8
	UPhrasesRadialDataAsset* Phrases; // 0x5d0
	UObject* CachedFirstPersonProxyMesh; // 0x5d8
	UObject* CachedThirdPersonProxyMesh; // 0x5e0
	UItemCategory* ItemCategory; // 0x710
	AItemInfo* ItemInfo; // 0x718
	AInterpolatingItem* InterpolatingItem; // 0x720
	TWeakObjectPtr<AActor> LastKnownWielder; // 0x740
	UWieldableItemVfxComponent* WieldableItemVfxComponent; // 0x748
	TArray<UMeshComponent*> ThirdPersonExtraMeshes; // 0x750
	TArray<UMeshComponent*> StashedExtraMeshes; // 0x760
	bool OfferingEnabled; // 0x789
};

struct UFlamethrowerComponent {
	TArray<FStatus> DefaultStatusesToApplyOnOverlap; // 0x5b0
	TArray<FFlamethrowerStatusOverride> OverrideStatusesToApplyOnOverlap; // 0x5c0
	float DamageToApplyToWieldedItemsOnOverlap; // 0x5d0
	UMechanismAnimationCurve_Flamethrower* Animation; // 0x5d8
	UParticleSystem* ParticleSystem; // 0x5e0
	FRotator ParticleSystemRelativeRotation; // 0x5e8
	FMechanismAnimationEventContainer AnimationEvents; // 0x5f8
	UParticleSystemComponent* CachedParticleSystem; // 0x648
	UPrimitiveComponent* SimpleCollisionShape; // 0x650
	TScriptInterface<Class> AnimatedMechanismInterface; // 0x658
	TScriptInterface<Class> VirtualSceneComponentTransformInterface; // 0x668
};

struct UImpactDataAsset {
	UMaterialInterface* DecalMaterial; // 0x28
	TArray<UImpactDecalParamModifier*> DecalParamModifiers; // 0x30
	FVector DecalSize; // 0x40
	float FadeScreenSize; // 0x4c
	float DecalLifetime; // 0x50
	UObject* Particles; // 0x58
	UObject* TriggeredForClientParticles; // 0x60
	UObject* SplashParticles; // 0x68
	EVfxRegion ParticlesVfxRegion; // 0x70
	UWwiseEvent* WwiseEvent; // 0x78
	UWwiseEvent* WwiseEventLayer; // 0x80
	UWwiseObjectPoolWrapper* WwiseObjectPool; // 0x88
	bool ParticleSystemIsPerPoint; // 0x90
	bool AttachToPlayer; // 0x91
	bool EnableUnderWaterImpact; // 0x92
	float MaxDepthForSplash; // 0x94
};

struct ABeacon {
	UStaticMeshComponent* Mesh; // 0x470
	UParticleSystemComponent* BeaconActiveParticleSystem; // 0x478
	UPointLightComponent* PointLight; // 0x480
	bool EnableParticleSystemTint; // 0x488
	UInteractableComponent* InteractableComponent; // 0x490
	UObject* ExtinguishedVFX; // 0x498
	FName WwiseEmitterName; // 0x4a0
	UWwiseEvent* StartLoopFlameSfx; // 0x4a8
	UWwiseEvent* StopLoopFlameSfx; // 0x4b0
	UWwiseEvent* FlameTransferSfx; // 0x4b8
	UWwiseEvent* ExtinguishedSfx; // 0x4c0
	UWwiseObjectPoolWrapper* BeaconWwisePool; // 0x4c8
	float InteractionRadius; // 0x4d0
	FText TakeFlameTooltipText; // 0x4d8
	FText CannotTakeFlameTooltipText; // 0x510
	FText LanternNotRaisedToolTipText; // 0x548
	FText NotWieldingFlameTooltipText; // 0x580
	FText SetFlameTooltipText; // 0x5b8
	bool CanTakeFlameFromBeacon; // 0x5f0
	bool CanSetFlameOnBeacon; // 0x5f1
	bool StartLit; // 0x5f2
	EFlameOfFateType StartingType; // 0x5f3
	FPlayerStat StatToFire; // 0x5f4
	TArray<FBeaconLitWithFlameOfFateStatsToFire> StatMap; // 0x5f8
	UCurveLinearColor* ColourChangeCurveFX; // 0x608
	UCurveLinearColor* ColourChangeCurveLight; // 0x610
	float ExtinguishFadeTime; // 0x618
	FBeaconData BeaconData; // 0x61c
	UParticleSystemComponent* ExtinguishFXComponent; // 0x620
	FObjectMessagingDispatcher EventDispatcher; // 0x628
};

struct UColorBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x40
};

struct UOptInDamageableComponent {
	bool EnableDamageFilteringByType; // 0x180
	TArray<UDamagerType*> AllowedDamagers; // 0x188
};

struct UMaterialExpressionParticleColor {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct APuzzleMechanism {
	UInteractableComponent* InteractableComponent; // 0x468
};

struct UAIProjectileWeaponFiringIntentionComponent {
	APawn* PawnOwner; // 0xd0
	AAthenaAIControllerBase* AIController; // 0xd8
	float DefaultHitChance; // 0xfc
};

struct UTradeRouteMapSettings {
	FStringAssetReference TradeRouteLandscapeMapItemDescClass; // 0x38
	FStringAssetReference TradeRoutePortraitMapItemDescClass; // 0x48
	EBlendMode DefaultIslandBlendMode; // 0x58
	FStringAssetReference DefaultPathTexture; // 0x60
	EBlendMode DefaultPathBlendMode; // 0x70
	UMapMarkId* DefaultClueMarkId; // 0x78
	EBlendMode DefaultClueBlendMode; // 0x80
	float DefaultClueScale; // 0x84
};

struct UEnvQueryTest_InsideWorldBounds {
	FAIDataProviderFloatValue Radius; // 0x170
};

struct ULandmarkReactionEventStopParticleSystem {
	FName ComponentName; // 0x38
	int32_t ComponentIndex; // 0x40
	UWwiseEvent* AudioCue; // 0x48
};

struct UPlayerGeneratedMapsContainerComponentDataAsset {
	TArray<FWorldRegionMapping> WorldRegionMappings; // 0x28
	TArray<FName> IslandsToExcludeFromTavernBoardDisplay; // 0x38
};

struct UNPCDialogPredicateHasEmblem {
	FName EmblemName; // 0x38
};

struct UInteractionSettings {
	float MaximumInteractionAngleClient; // 0x28
	float MaximumInteractionAngleServer; // 0x2c
	float MaximumInteractionDistance; // 0x30
	float MaxInteractorsPlayerDistanceDelta; // 0x34
	float MaxInteractorsCenterDistanceDelta; // 0x38
};

struct UMysteriousNoteCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UStatusResponsePlayAudioLoopOnAllClients {
	UWwiseEvent* StartLoopEvent; // 0x30
	UWwiseEvent* StopLoopEvent; // 0x38
};

struct UAbilityTask_WaitTargetData {
	FScriptMulticastDelegate ValidData; // 0x68
	FScriptMulticastDelegate Cancelled; // 0x78
};

struct URowboatAudioComponent {
	URowboatAudioComponentParams* Params; // 0x2b0
	ARowboat* ParentRowboat; // 0x2b8
};

struct UKrakenHeadHitReactAnimationsDataAsset {
	TArray<FKrakenHeadHitReactAnimations> HitReactionAnimations; // 0x28
};

struct UStatSettings {
	FStringAssetReference ConditionalStatsServiceSettingsLocation; // 0x38
};

struct UNamedPointsComponent {
	UNamedPointsCollectionListDataAsset* NamedPointsAsset; // 0xe8
};

struct AModalInteractionProxy {
	UPrimitiveComponent* Mesh; // 0x400
	UInteractableComponent* InteractionRegion; // 0x408
	AModalInteraction* InteractionType; // 0x410
	FText DefaultTooltip; // 0x418
	FText DefaultDisplayName; // 0x450
	UNotificationInputId* NotificationInputId; // 0x488
	EActionDisplayPriority DisplayPriority; // 0x490
};

struct UMaterialExpressionFrac {
	FExpressionInput Input; // 0x70
};

struct AStaticDamageableCargoRunCrateItemProxy {
	UGatedHealthComponent* GatedHealthComponent; // 0x7e8
	UVisualHealthResponseComponent* VisualHealthResponseComponent; // 0x7f0
	ULightWeightStatusEffectManagerComponent* LightweightStatusEffectComponent; // 0x7f8
};

struct UParticleModuleOrbitBase {
	char bUseEmitterTime : 1; // 0x50
};

struct APlaceableReaction {
	TArray<FLandmarkReactionKeyFrame> ReactionEvents; // 0x3d0
	float TriggerRadiusInMetres; // 0x3e0
	USceneComponent* SceneComponent; // 0x3e8
	ALandmarkReactionPlayer* ReactionEventPlayer; // 0x3f0
};

struct ARareMerchantCrateItemInfoMock {
	TArray<FMerchantCrateItemInfoFaunaBreedRarityEntry> FaunaBreedRarity; // 0x710
	AActor* CurrentShip; // 0x778
};

struct UAthenaAIAbility {
	UAthenaAIAbilityParams* AbilityParams; // 0x28
	APawn* Pawn; // 0x30
	AAthenaAIController* Controller; // 0x38
	TScriptInterface<Class> AIPawnInterface; // 0x40
	UAthenaAIAbilityStageParams* CurrentAbilityStageParams; // 0x50
};

struct UBTTask_MoveToFailOnDistanceToSeenActors {
	bool FailOnDistanceBeingLess; // 0xb8
	float FailDistance; // 0xbc
};

struct UHitDetectionComponent {
	float MaxTimedSweepWaitTime; // 0xd0
};

struct AShipCustomizationChest {
	USphereComponent* ShipInteractionRadius; // 0x518
	float MaxShipSpeedXY; // 0x520
	bool DisableShipCheckRestrictions; // 0x560
	TArray<FShipCustomizationChestCrewMember> CrewMembersInteracting; // 0x568
};

struct USeaRockDataAsset {
	TArray<FSeaRock> SeaRocks; // 0x28
	TArray<FSeaRock> UnderseaRocks; // 0x38
};

struct UMechanismsSettings {
	UMechanismMaterialMap* MaterialMap; // 0x28
	TArray<FFlamethrowerStatusOverride> GlobalFlamethrowerStatusOverrides; // 0x30
};

struct UFishDataAsset {
	float CruisingDepthBeneathWaterHeight; // 0x28
	float RisingFromTheDepthsSpeed; // 0x2c
	float EscapingToTheDepthsSpeed; // 0x30
	FWeightedProbabilityRangeOfRanges TimeReelingWhenBattlingToSnapLine; // 0x38
	float ReelingCooldownMultiplier; // 0x68
	FWeightedProbabilityRange NumberOfLoopsBeforeBiting; // 0x70
	FWeightedProbabilityRangeOfRanges MinimumDistanceFromPlayer; // 0x90
	float DistanceFromPlayerToCatchFish; // 0xc0
	FFloatRange SecondsToRemainBeforeDespawning; // 0xc4
	float FloatBobDepthOnBeingHooked; // 0xd4
	float RodBendAmountWhenBiting; // 0xd8
	float RodBendAmountWhenBattling; // 0xdc
	float RodBendAmountWhenRecovering; // 0xe0
	UObject* SplashVFXWhenBeingTired; // 0xe8
	UObject* SplashVFXWhenBattling; // 0xf0
	UObject* SplashVFXWhenJumpingOutOfWater; // 0xf8
	UObject* SplashVFXWhenLandingInToWater; // 0x100
	float SplashZOffset; // 0x108
	float FloatReelingMoveSpeedWhenMovingToMinimumDistanceFromPlayer; // 0x10c
	float ReelingAnimationMaxSpeedWhenMovingToMinimumDistanceFromPlayer; // 0x110
	float FloatReelingMoveSpeedWhenBattling; // 0x114
	float ReelingAnimationMaxSpeedWhenBattling; // 0x118
	float FloatReelingMoveSpeedWhenNotBattling; // 0x11c
	float ReelingAnimationMaxSpeedWhenNotBattling; // 0x120
	float TimeBetweenIsBlockedHitChecksOnServer; // 0x124
	float TimeBeforeTurningOnHits; // 0x128
	ECollisionChannel HitTestTraceChannel; // 0x12c
	float HitDetectionHalfExtentXY; // 0x130
	float HitDetectionHalfExtentZ; // 0x134
	float HitDetectionZOffset; // 0x138
	UWwiseObjectPoolWrapper* FishingFishPool; // 0x140
	FName FishTiredSwitchGroup; // 0x148
	FName FishTiredSwitchDefault; // 0x150
	FName FishTiredSwitchTired; // 0x158
	UWwiseEvent* FishBiteAndStruggleStart; // 0x160
	UWwiseEvent* FishBiteAndStruggleStop; // 0x168
	UWwiseEvent* FishJumpOutOfWater; // 0x170
	UWwiseEvent* FishJumpIntoWater; // 0x178
	UForceFeedbackEffect* FishBitingForceFeedback; // 0x180
};

struct UTaleQuestAddChecklistMapStepDesc {
	FName MapId; // 0x80
	FQuestVariableText Title; // 0x88
	FQuestVariableText Description; // 0x98
	FQuestVariableChecklistItemArray Items; // 0xa8
	FQuestVariableText Afternote; // 0xb8
	UChecklistMapLayout* Layout; // 0xc8
};

struct UCharacterAudioFootfallControllerParams {
	FName PlayerSpeedRtpcName; // 0x28
	float MinPlayerSpeedRtpcValue; // 0x30
	float MaxPlayerSpeedRtpcValue; // 0x34
	FName WadingRtpcName; // 0x38
	float MinWadingWwiseRtpcValue; // 0x40
	float MaxWadingWwiseRtpcValue; // 0x44
	FName FootstepSquelchRtpcName; // 0x48
	FName PlayerPerspectiveRtpcName; // 0x50
	float PlayerPerspectiveRtpcValue; // 0x58
	float RemotePlayerPerspectiveRtpcValue; // 0x5c
	UWwiseEvent* FootfallEvent; // 0x60
	UWwiseEvent* FootfallPacingEvent; // 0x68
	UWwiseEvent* CharacterCleanLandEvent; // 0x70
	UWwiseEvent* CharacterJumpEvent; // 0x78
	UWwiseEvent* CharacterSplashEvent; // 0x80
	UWwiseObjectPoolWrapper* FootfallsPool; // 0x88
	FName VerticalSpeedRtpcName; // 0x90
	float MinVerticalSpeedRtpcValue; // 0x98
	float MaxVerticalSpeedRtpcValue; // 0x9c
	FName BrokenLegSwitchGroup; // 0xa0
	FName BrokenLegSwitchBroken; // 0xa8
	FName FootwareCategorySwitchGroup; // 0xb0
	FName FootwareCategoryBoots; // 0xb8
	FName FootwareCategoryBarefoot; // 0xc0
	FName FootwareCategoryPegleg; // 0xc8
	FName FootfallEmoteSwitchGroup; // 0xd0
	FName PlayingEmoteSwitch; // 0xd8
	FName HotFloorSwitchGroup; // 0xe0
	FName HotFloorActive; // 0xe8
	FName FootfallBuriedTreasureRTPCName; // 0xf0
	float DecalOverlapRadius; // 0xf8
	float SteppingOnDecalRTPCValue; // 0xfc
	float NotSteppingOnDecalRTPCValue; // 0x100
};

struct UTaleQuestMakeStructStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UContestMerchantSpawnerComponent {
	TArray<ACompanyShopkeeper*> SpawnedMerchantsArray; // 0xf8
	TArray<FMerchantSpawnData> MerchantSpawnDataArray; // 0x108
};

struct AShipBumperZone {
	bool UseInverseRightVector; // 0x3d0
	UBoxComponent* BumperZoneComponent; // 0x400
	USphereComponent* DistanceRadiusComponent; // 0x408
	bool ApplyAngularImpulse; // 0x410
	float AngularImpulse; // 0x414
	bool OverrideWheelControl; // 0x418
	bool ApplyWheelTurbulence; // 0x419
	float MinWheelTurbulence; // 0x41c
	float MaxWheelTurbulence; // 0x420
};

struct UControllableMock {
	AActor* ActorThatRequestedStateChange; // 0x38
	FText ObjectDisplayName; // 0x40
	FControlObjectActionRuleParams ControlObjectActionRuleParams; // 0x78
	ENetRole Role; // 0x88
	bool HasAController; // 0x89
	bool CanBeControlledByActorValue; // 0x8a
};

struct USequenceComponent {
	FScriptMulticastDelegate CorrectKeyPressedDelegate; // 0xc8
	FScriptMulticastDelegate IncorrectKeyPressedDelegate; // 0xd8
	FScriptMulticastDelegate SequenceCompleteDelegate; // 0xe8
	TArray<int32_t> Sequence; // 0xf8
	bool ResetOnError; // 0x108
	bool SequenceComplete; // 0x109
	TArray<FSequenceResponseContainer> Responses; // 0x110
};

struct UShipRolloverCorrector {
	UCurveFloat* TimeRolledOverVSCorrectiveTorque; // 0x28
	float RollThresholdToConsiderRolledOver; // 0x30
	float HullSubmersedThreshold; // 0x34
};

struct UDrunkenChestComponent {
	UWwiseEvent* OnPickedUpLocalPlayerOnlyEvent; // 0xc8
	UDrunkennessComponent* DrunkennessComponent; // 0xd0
	AActor* Wielder; // 0xd8
	float TargetDrunkenness; // 0xe0
};

struct UTextureProxy {
	UTexture* Texture; // 0x138
};

struct AHumanoidActionStateCreatorDefinition {
	FDebugSuperSailorActionStateParams DebugSuperSailorParams; // 0x3d0
	FControlWheelActionStateParams ControlWheelParams; // 0x3e0
	FControlCapstanArmActionStateParams ControlCapstanArmParams; // 0x414
	FControlPulleyActionStateParams ControlPulleyParams; // 0x448
	FUseLadderActionStateParams UseLadderParams; // 0x47c
	FClamberActionStateParams ClamberParams; // 0x4c8
	FUseCannonActionStateParams UseCannonParams; // 0x4f8
	FUseMountedWeaponActionStateParams UseHarpoonLauncherParams; // 0x558
	FUseMapTableActionStateParams UseMapTableParams; // 0x5b0
	FLinearTransitionLadderActionStateParams OffBottomTransitionLadderParams; // 0x5cc
	FLinearTransitionLadderActionStateParams OnBottomTransitionLadderParams; // 0x5e0
	FSplineTransitionLadderActionStateParams OffTopTransitionLadderParams; // 0x5f4
	FSplineTransitionLadderActionStateParams OnTopTransitionLadderParams; // 0x604
	FTeleportActionStateParams TeleportParams; // 0x614
	FWaitingToSpawnActionStateParams WaitingToSpawnParams; // 0x640
	FRepairObjectActionStateParams RepairObjectParams; // 0x654
	FUndoRepairActionStateParams UndoRepairParams; // 0x658
	FUseItemActionStateParams UseItemParams; // 0x65c
	FDeadActionStateParams DeadParams; // 0x660
	FRevivedActionStateParams PostReviveParameters; // 0x6b8
	FHideInObjectActionStateParams HideInObjectParams; // 0x6c8
	FLeaveGhostShipActionStateParams LeaveGhostShipParams; // 0x6f0
	FShovelDigActionStateParams ShovelDigParams; // 0x718
	FMigrationActionStateParams MigrationParams; // 0x728
	FFiredFromActorActionStateParams FiredFromCannonParams; // 0x72c
	FFiredFromActorActionStateParams LaunchedFromKrakenParams; // 0x754
	FFiredFromActorActionStateParams LaunchedFromGeyserParams; // 0x77c
	FWaitForDemoResetActionStateParams WaitForDemoResetParams; // 0x7a4
	FWaterBarrelActionStateParams WaterBarrelParams; // 0x7a8
	FDockableCutsceneActionStateParams DockableCutsceneParams; // 0x7dc
	FDockableBaseActionStateParams DockableBaseParams; // 0x810
	FPlayDockableKeyedInstrumentActionStateParams DockableMusicalInstrumentParams; // 0x844
	FControlObjectActionStateParams TavernPianoParams; // 0x860
	FCapturedByKrakenActionStateParams CapturedByKrakenParams; // 0x878
	FIngestedByKrakenActionStateParams IngestedByKrakenParams; // 0x8b8
	FSwallowedByKrakenActionStateParams SwallowedByKrakenParams; // 0x8bc
	FLinearTransitionActionStateParams LinearTransitionParams; // 0x8c4
	FWaterSlideActionStateParams WaterSlideParams; // 0x8d8
	FEnterTunnelOfTheDamnedActionStateParams EnterTunnelOfTheDamnedParams; // 0x8fc
	FEjectFromTunnelOfTheDamnedActionStateParams EjectFromTunnelOfTheDamnedParams; // 0x91c
	FExitTunnelOfTheDamnedActionStateParams ExitTunnelOfTheDamnedParams; // 0x93c
};

struct UMovieSceneCapture {
	FCaptureProtocolID CaptureType; // 0x38
	UMovieSceneCaptureProtocolSettings* ProtocolSettings; // 0x40
	FMovieSceneCaptureSettings Settings; // 0x48
	bool bUseSeparateProcess; // 0x98
	bool bCloseEditorWhenCaptureStarts; // 0x99
	FString AdditionalCommandLineArguments; // 0xa0
	FString InheritedCommandLineArguments; // 0xb0
};

struct UAggressiveGhostShipBannerDataAsset {
	UAggressiveGhostShipNamesDataAsset* Header; // 0x28
	UAggressiveGhostShipNamesDataAsset* Footer; // 0x30
	FName Tag; // 0x38
	bool DisableMusic; // 0x40
};

struct UScreenSpaceVfxComponent {
	UScreenSpaceVFXComponentParams* Params; // 0xc8
	TArray<UParticleSystemComponent*> ScreenSpaceParticleSystems; // 0xd8
};

struct APawn {
	char bUseControllerRotationPitch : 1; // 0x3d8
	char bUseControllerRotationYaw : 1; // 0x3d8
	char bUseControllerRotationRoll : 1; // 0x3d8
	char bCanAffectNavigationGeneration : 1; // 0x3d8
	float BaseEyeHeight; // 0x3dc
	EAutoReceiveInput AutoPossessPlayer; // 0x3e0
	EAutoPossessAI AutoPossessAI; // 0x3e1
	AController* AIControllerClass; // 0x3e8
	APlayerState* PlayerState; // 0x3f0
	char RemoteViewPitch; // 0x3f8
	AController* LastHitBy; // 0x400
	AController* Controller; // 0x408
	FVector ControlInputVector; // 0x428
	FVector LastControlInputVector; // 0x434
};

struct UVoyageModuleSettings {
	FStringAssetReference QuestsConfigAsset; // 0x38
	TArray<FEmergentVoyageSourceIconInfo> EmergentVoyageIconInfos; // 0x48
	int32_t NumVoyagesInAntiRepetitionHistory; // 0x58
};

struct ARomeBeacon {
	USceneComponent* BeaconRoot; // 0x3d8
	UStaticMeshComponent* RibbonComponent; // 0x3e0
	UStaticMeshComponent* UpperHalfRibbonComponent; // 0x3e8
	UStaticMeshComponent* LowerHalfRibbonComponent; // 0x3f0
	UStaticMeshComponent* TendrilComponent; // 0x3f8
	UStaticMeshComponent* BeamComponent; // 0x400
	bool EnableBend; // 0x410
	float MinDistFromPlayerToScale; // 0x414
	float MaxDistFromPlayerToScale; // 0x418
	float MinBeamScale; // 0x41c
	float MaxBeamScale; // 0x420
	float MarkerPositionBlendSpeed; // 0x424
	TArray<UMaterialInstanceDynamic*> DynamicMaterials; // 0x428
	TArray<FRomeBeaconVelocityMap> VelocityMap; // 0x438
	float FallbackVelocity; // 0x448
	float MaxOffset; // 0x44c
	float MinRibbonScale; // 0x450
	float MaxRibbonScale; // 0x454
	float RibbonBlendTime; // 0x458
	float BeamBlendTime; // 0x45c
	float StartBlendVal; // 0x460
	float EndBlendVal; // 0x464
	UArenaWorldMarker* MarkerDataObject; // 0x4a0
};

struct AWaterPuzzleAlterationMechanismAction {
	bool ShouldDrain; // 0x570
	AActor* PuzzleActor; // 0x578
	float WaterReactionDelay; // 0x580
	int32_t WaterLevelCapacity; // 0x584
	float MinimumMouthOpenDuration; // 0x588
	UWaterPuzzleAlterationMechanismAudioParams* AlterationMechanismAudioParams; // 0x598
	USceneComponent* MouthSFXPosition; // 0x5a0
	FWwiseEmitter MouthSFXEmitter; // 0x5a8
	FWwiseEmitter SplashSFXEmitter; // 0x5c8
	UWaterSpoutVFXComponent* WaterSpoutComponent; // 0x5e8
	UStoneFaceGlowComponent* GlowComponent; // 0x5f0
};

struct UMaterialExpressionSceneColor {
	EMaterialSceneAttributeInputMode InputMode; // 0x70
	FExpressionInput Input; // 0x78
	FExpressionInput OffsetFraction; // 0xb0
	FVector2D ConstInput; // 0xe8
};

struct UTaleQuestSpawnLootItemInClueSiteStepDesc {
	FQuestVariableClass LootItem; // 0x80
	FQuestVariableClueSite ClueSite; // 0x90
	FQuestVariableItemInfo SpawnedLootItem; // 0xa0
	bool Tracked; // 0xb0
};

struct ULocationMapParams {
	TArray<FLocationMapBannerParams> BannerParams; // 0x28
	UMapMarkId* ChestMarkId; // 0x38
	float ChestScale; // 0x40
	TArray<UMapMarkId*> CrossTextures; // 0x48
	float CrossScale; // 0x58
	FVector2D VaultSymbolCanvasOffset; // 0x5c
	float VaultSymbolScale; // 0x64
};

struct USpawnBarrelsOfPlentyStepDesc {
	FQuestVariableVector LocatorVar; // 0x80
};

struct AMusicZoneService {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UNPCDialogPredicateIntEquals {
	FName ParameterName; // 0x38
	int32_t Value; // 0x40
};

struct ASimpleAnimatedMechanismActionProxy {
	ESimpleAnimatedMechanismActionMode Mode; // 0x400
	bool AlwaysActive; // 0x401
	bool OnlyAnimateWhenActive; // 0x402
	bool OverrideAudioEmitterPool; // 0x403
	UWwiseObjectPoolWrapper* AudioEmitterPool; // 0x408
};

struct UBTTask_DetachFromHangout {
	float TaskDuration; // 0x88
};

struct UBTService_PlayCustomMontageId {
	FCustomAnimationMontageId CustomAnimationMontageId; // 0x70
};

struct UCosmeticItemAnimationComponent {
	TMap<USkeletalMeshComponent*, FCosmeticItems> CosmeticItems; // 0xd0
	UCosmeticItemAnimationDataAsset* DataAsset; // 0x120
};

struct AKrakenShipWrappingTentacle {
	USceneComponent* SceneRoot; // 0x508
	UStaticMeshComponent* TentacleCollisions; // 0x510
	UStaticMeshComponent* TentacleMesh; // 0x518
	UBoxComponent* DamageZone; // 0x520
	USceneComponent* InteractableBlockingRegions; // 0x528
	USceneComponent* KnockbackRegions; // 0x530
	UBoxComponent* TentacleHeadCollisions; // 0x538
	USceneComponent* TentacleHeadKnockbackRegions; // 0x540
	UKrakenShipWrappingTentacleAIAudioComponent* AudioComponent; // 0x548
	UStaticMesh* LowDetailTentacleMesh; // 0x550
	FStringAssetReference HighDetailTentacleMeshAsset; // 0x558
	FKrakenShipWrappingTentacleParams Params; // 0x568
	UMaterialInstanceDynamic* TentacleDynamicMaterialInstance; // 0x658
	UStaticMesh* HighDetailTentacleMesh; // 0x660
	FKrakenShipWrappingTentacleAnimationState CurrentServerAnimationState; // 0x668
	FKrakenShipWrappingTentacleAnimationState PendingServerAnimationState; // 0x678
};

struct UBaitItemCategory_C {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct UIsActorTypeStatCondition {
	TArray<UObject*> TargetActorClasses; // 0x30
};

struct AStaticCargoRunCrateItemProxy {
	UCargoRunCrateComponent* CargoRunCrateComponent; // 0x7d8
	UNPCDialogComponent* NPCDialogComponent; // 0x7e0
};

struct UCanvasRenderTarget2D {
	FScriptMulticastDelegate OnCanvasRenderTargetUpdate; // 0x168
	TWeakObjectPtr<UWorld> World; // 0x178
};

struct UOceanCrawlerAnimationData {
	FOceanCrawlerAnimationDataStructure OceanCrawlerAnimationDataStructure; // 0x28
};

struct UCollectorsChestShipOwnershipPropagationComponent {
	TWeakObjectPtr<AActor> ItemProxy; // 0xc8
};

struct ARigidBodyBase {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UActorChannel {
	AActor* Actor; // 0x68
	TArray<UObject*> ObjectsRequiredForQueuedBunches; // 0x158
};

struct UNotificationMessagesDataAsset {
	TArray<FText> NotificationMessages; // 0x28
};

struct UInputBinder {
	UInputComponent* InputComponent; // 0x28
};

struct UTaleQuestAddRiddleMapStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct AWoodPlank {
	UInventoryItemComponent* InventoryItem; // 0x798
	UConsumableWieldableComponent* ConsumableWieldable; // 0x7a0
};

struct UAIResource_Logic {
	int32_t ManualResourceID; // 0x28
	char bManuallySetID : 1; // 0x30
};

struct ASpawnContextProviderZone {
	TArray<FName> SpawnContextIDs; // 0x3d0
	UBoxComponent* BoundingBox; // 0x3e0
};

struct ADynamicOnlySwitchMechanismTrigger {
	USceneComponent* Root; // 0x410
	USceneComponent* Pivot; // 0x418
	UMechanismTriggerComponent* MechanismTriggerComponent; // 0x420
	bool ShowSwitchInteractionPrompt; // 0x428
	FText SwitchInteractionPromptText; // 0x430
	FText SwitchNameText; // 0x468
	bool SyncToConnectedActionStateOnChange; // 0x4a0
	bool DisableWhenActivated; // 0x4a1
	bool AutoDeactivateAfterActivation; // 0x4a2
	float TimeAfterActivationBeforeAutoDeactivating; // 0x4a4
	bool SelectRandomStartPositionOnSpawn; // 0x4a8
	ESwitchMechanismTriggerRandomSelectionMode RandomStartPositionSelectionMode; // 0x4a9
	int32_t FixedStartPositionIndex; // 0x4ac
	UCurveFloat* PositionTransitionCurve; // 0x4b0
	TArray<FSwitchMechanismTriggerPosition> Positions; // 0x4b8
	UWwiseObjectPoolWrapper* AudioEmitterPool; // 0x4c8
	UMechanismMaterialGroup* MaterialGroup; // 0x4d0
	int32_t CurrentPositionIndex; // 0x4d8
};

struct UMovieSceneBindingOverrides {
	TArray<FMovieSceneBindingOverrideData> BindingData; // 0x30
};

struct URig {
	TArray<FTransformBase> TransformBases; // 0x28
	TArray<FNode> Nodes; // 0x38
};

struct USkinnedMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x598
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x5a0
	UMaterialInterface* CustomDepthMaterial; // 0x5e8
	char bUseBoundsFromMasterPoseComponent : 1; // 0x600
	TArray<FActiveVertexAnim> ActiveVertexAnims; // 0x608
	UPhysicsAsset* PhysicsAssetOverride; // 0x618
	int32_t ForcedLodModel; // 0x620
	int32_t MinLodModel; // 0x624
	int32_t PredictedLODLevel; // 0x628
	int32_t OldPredictedLODLevel; // 0x62c
	float MaxDistanceFactor; // 0x630
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x638
	float StreamingDistanceMultiplier; // 0x648
	FColor WireframeColor; // 0x64c
	char bForceWireframe : 1; // 0x650
	char bDisplayBones : 1; // 0x650
	char bDisplayBoneCollisions : 1; // 0x650
	char bDisableMorphTarget : 1; // 0x650
	char bHideSkin : 1; // 0x650
	char bPerBoneMotionBlur : 1; // 0x668
	char bComponentUseFixedSkelBounds : 1; // 0x668
	char bConsiderAllBodiesForBounds : 1; // 0x668
	EMeshComponentUpdateFlag MeshComponentUpdateFlag; // 0x66c
	char bForceMeshObjectUpdate : 1; // 0x670
	char bChartDistanceFactor : 1; // 0x670
	char bCanHighlightSelectedSections : 1; // 0x670
	char bRecentlyRendered : 1; // 0x670
	float ProgressiveDrawingFraction; // 0x674
	char CustomSortAlternateIndexMode; // 0x678
	FBoxSphereBounds CachedLocalBounds; // 0x68c
	bool bCachedLocalBoundsUpToDate; // 0x6a8
	bool bEnableUpdateRateOptimizations; // 0x6a9
	bool bDisplayDebugUpdateRateOptimizations; // 0x6aa
};

struct ADebugWindService {
	AWindDirectionalSource* GlobalWindSource; // 0x3e0
	float CurrentWindAngle; // 0x3f8
	float CurrentWindMagnitude; // 0x3fc
	TArray<TScriptInterface<Class>> WindZones; // 0x4e8
};

struct UTaleVaultService {
	APuzzleVault* Vault; // 0x60
	UVaultPuzzleDataAsset* SolutionAsset; // 0x68
};

struct UBTDecorator_IsActorInExpectedActionState {
	UActionStateId* ExpectedActionState; // 0x68
	EActionStateMachineTrackId ExpectedTrackId; // 0x70
};

struct UBreakpoint {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UWwiseEmitterComponent {
	FWwiseEmitter Emitter; // 0x2b8
	UWwiseObjectPoolWrapper* WwiseObjectPoolWrapper; // 0x2d8
};

struct UCustomAnimationMontageComponent {
	FCustomAnimationMontageComponentReplicatedData ReplicatedData; // 0xd0
};

struct AWorldSettings {
	char bEnableWorldBoundsChecks : 1; // 0x3d8
	char bEnableNavigationSystem : 1; // 0x3d8
	EWorldCompositionSetting WorldCompositionSetting; // 0x3dc
	FStringAssetReference InstancedNavMeshesDataAssetOveride; // 0x3e0
	char bEnableWorldOriginRebasing : 1; // 0x3f0
	char bWorldGravitySet : 1; // 0x3f0
	char bGlobalGravitySet : 1; // 0x3f0
	float KillZ; // 0x3f4
	UDamageType* KillZDamageType; // 0x3f8
	float GlobalGravityZ; // 0x400
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x408
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x410
	AGameMode* DefaultGameMode; // 0x418
	TArray<FGameModePrefix> DefaultMapPrefixes; // 0x420
	AGameNetworkManager* GameNetworkManagerClass; // 0x430
	int32_t PackedLightAndShadowMapTextureSize; // 0x438
	char bMinimizeBSPSections : 1; // 0x43c
	FVector DefaultColorScale; // 0x440
	char bPrecomputeVisibility : 1; // 0x44c
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x44c
	int32_t VisibilityCellSize; // 0x450
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x454
	char bForceNoPrecomputedLighting : 1; // 0x458
	FLightmassWorldInfoSettings LightmassSettings; // 0x45c
	ELightingBuildQuality LevelLightingQuality; // 0x4a0
	FReverbSettings DefaultReverbSettings; // 0x4a8
	FInteriorSettings DefaultAmbientZoneSettings; // 0x4c0
	USoundMix* DefaultBaseSoundMix; // 0x4e8
	float WorldToMeters; // 0x4f0
	UBookMark* BookMarks[0xa]; // 0x4f8
	float TimeDilation; // 0x548
	float MatineeTimeDilation; // 0x54c
	float DemoPlayTimeDilation; // 0x550
	char bHighPriorityLoading : 1; // 0x554
	char bHighPriorityLoadingLocal : 1; // 0x554
	TArray<FNetViewer> ReplicationViewers; // 0x558
	TArray<UAssetUserData*> AssetUserData; // 0x568
	float WorldGravityZ; // 0x578
	APlayerState* Pauser; // 0x580
};

struct UEnvQueryTest_InsideTinySharkExperience {
	float BufferRadius; // 0x170
};

struct APet {
	UPetWieldableReactMappingsDataAsset* WieldableReactMappingsAsset; // 0x898
	float MaxVelocityForLocomotionAnimation; // 0x8a0
	bool CanFly; // 0x8a4
	TArray<FPetFlyingStrategyProperties> FlyingStrategyProperties; // 0x8a8
	float FlyingLandTime; // 0x8b8
	UCurveFloat* FlyingLandCurve; // 0x8c0
	float FlyingTakeOffTime; // 0x8c8
	UCurveFloat* FlyingTakeOffCurve; // 0x8d0
	FFloatRange MidFlightAdjustmentTimerRange; // 0x8d8
	UCurveFloat* MidFlightAdjustmentCurve; // 0x8e8
	UCurveFloat* MidFlightTimeToDistanceAdjustmentCurve; // 0x8f0
	FName FiredFromActorCollision; // 0x8f8
	UWwiseEvent* FiredFromActorSFX; // 0x900
	UPetDitherComponent* DitherComponent; // 0x908
	float MinimumDamageForHealthReact; // 0x910
	float MaxDistForWaterBucketToClean; // 0x914
	float MinimumDurationUntilPetCanDespawnConcealed; // 0x918
	float DefaultNamePlateHeight; // 0x91c
	float AlternateNamePlateHeight; // 0x920
	TArray<EAthenaAnimationPetRoamingState> StatesToUseAlternateNamePlatePos; // 0x928
	FFloatRange PetTimeSpentSad; // 0x938
	EDebugPetStateDescriptor DebugStateDescriptor; // 0x948
	UAINameplateComponent* AINameplateComponent; // 0x950
	UFeedingComponent* FeedingComponent; // 0x958
	UStarvingComponent* StarvingComponent; // 0x960
	UCleanlinessComponent* CleanlinessComponent; // 0x968
	UCannonSquashComponent* CannonSquashComponent; // 0x970
	FPetMovementRequest ReplicatedMovementRequest; // 0x978
	float TargetMeshRoll; // 0x984
	float DefaultShipTurnRateModifier; // 0x998
	TArray<FPetTurnRateModifier> TurnRateModifierList; // 0x9a0
	TArray<EAthenaAnimationPetRoamingState> LocomotingMovementStates; // 0x9b0
	TArray<EAthenaAnimationPetRoamingState> RequestIdleOrMovementValidMovementStates; // 0x9c0
	float MaxRollAngle; // 0x9d0
	float DelayForDisablingMovementOnIdle; // 0x9d4
	float IslandDustRatePerSecond; // 0x9d8
	FGuid CrewId; // 0x9dc
	bool InHangout; // 0x9ec
	bool PerchedInHangout; // 0x9ed
	bool ResetRollAndZOffset; // 0x9ee
	bool ShouldIgnoreTooltipDisplayOffset; // 0x9ef
	FPetTurnToFaceData PetTurnToFaceData; // 0x9f0
	UAIPartsRetrievalComponent* AIPartsRetrievalComponent; // 0xa28
	UPetPartCustomisationComponent* PetPartCustomisationComponent; // 0xa30
	ULightWeightStatusEffectManagerComponent* LightWeightStatusEffectManagerComponent; // 0xa38
	UPetTelemetryComponent* TelemetryComponent; // 0xa40
	UPetSicknessComponent* SicknessComponent; // 0xa48
	UWaterExposureComponent* WaterExposureComponent; // 0xa50
	UAnimationDataStoreComponent* AnimationDataStoreComponent; // 0xa58
	AActor* SpawnedForShip; // 0xa60
	AActor* PetOwner; // 0xa68
	AItemInfo* PetInfo; // 0xa70
	FDocker Docker; // 0xa80
	FStartPickupObjectActionRuleParams StartPickupObjectActionRuleParams; // 0xad0
	UParticleSystemComponent* CurrentlyPlayingParticleSystem; // 0xaf0
	UAIStrategyId* LandingStrategy; // 0xaf8
	UAIStrategyId* PursuitStrategy; // 0xb00
	float DefaultRollLerpTime; // 0xb08
	float LandingRollLerpTime; // 0xb0c
	bool IsBeingDismissed; // 0xb10
	bool IsInDisabledPetPerchHangout; // 0xbfc
	bool PetIsSad; // 0xbfd
};

struct UNPCOnSurfaceCannonManagerCrewSizeSettingsDataAsset {
	TArray<FNPCOnSurfaceCannonManagerCrewSizeSettings> CrewSizeSettings; // 0x28
};

struct UAshenLordAshCloudSetupDataAsset {
	FWeightedProbabilityRangeOfRanges AshCloudRadiusInMetres; // 0x28
	float AshCloudHeightCoefficient; // 0x58
	FWeightedProbabilityRangeOfRanges AshCloudLifetime; // 0x60
	UCurveFloat* ScaleUpSpeedCurve; // 0x90
	UCurveFloat* DissipationCurve; // 0x98
};

struct UTaleQuestSpawnWashedUpMessageInABottleClueStepDesc {
	FQuestVariableClueSite ClueSite; // 0x80
	FQuestVariableClueDescriptor ClueDescriptor; // 0x90
	FQuestVariableActor MessageInABottle; // 0xa0
};

struct UGameplayEffectExtension {
	TArray<FGameplayAttribute> RelevantSourceAttributes; // 0x28
	TArray<FGameplayAttribute> RelevantTargetAttributes; // 0x38
};

struct UWaitForTunnelOfTheDamnedMigrationTaleQuestStep {
	UWaitForTunnelOfTheDamnedMigrationTaleQuestStepDesc* Desc; // 0x90
};

struct USphereCollisionExtentAdjustOverTimeComponent {
	bool ShouldAdjustSphereRadius; // 0x108
	float PostAdjustmentSphereRadius; // 0x10c
	float ServerSizeScale; // 0x110
	USphereComponent* SphereCollisionToAdjust; // 0x118
};

struct UPlayerGeneratedMapsContainerComponent {
	FText ContainerDisplayName; // 0xd0
	FTransform InstanceTransform; // 0x110
	UItemDesc* MapDesc; // 0x140
	UPlayerGeneratedMapsContainerComponentDataAsset* ContainerDataAsset; // 0x148
	TArray<FPlayerGeneratedMapDisplayData> PlayerMapInventory; // 0x150
	TArray<FPlayerGeneratedMapDisplayData> StoreMapInventory; // 0x160
	UWwiseEvent* AddMapSFX; // 0x170
	UWwiseEvent* TakeMapSFX; // 0x178
	UWwiseEvent* OpenContainerSFX; // 0x180
	int32_t MaxNumStoreMapsToReplicate; // 0x188
	int32_t MaxNumPlayerMapsToReplicate; // 0x18c
	int32_t DailyMapLimit; // 0x190
	FStringAssetReference MapTakenBackgroundImage; // 0x198
	TArray<FStringAssetReference> MapTakenImages; // 0x1a8
	TArray<AActor*> ServerAttachedPlayers; // 0x1b8
	UWwiseObjectPoolWrapper* SfxPool; // 0x1c8
};

struct UParticleModuleVelocityBase {
	char bInWorldSpace : 1; // 0x50
	char bApplyOwnerScale : 1; // 0x50
};

struct UWieldedItemNamedContextualOpenRadialAction {
	TArray<FContextAction> RadialContexts; // 0x30
	URadialCreationRuleAsset* CanExecuteRadial; // 0x40
};

struct UBookMark {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct URegionalAssetCache {
	TMap<UObject*, FStringAssetReference> RegionAssetLists; // 0x30
	UObject* CurrentRegionKey; // 0x80
};

struct ATavernStepsTrigger {
	TArray<FLandmarkReactionKeyFrame> ReactionEventsOpen; // 0x3d0
	TArray<FLandmarkReactionKeyFrame> ReactionEventsCancel; // 0x3e0
	float ShantyDelayBeforeStepsOpen; // 0x3f0
	USceneComponent* CollisionRoot; // 0x3f8
	USphereComponent* StepsListenerTriggerComponent; // 0x400
	USphereComponent* PlayersInTavernTriggerComponent; // 0x408
	UWorldRegionComponent* ShantyWorldRegionComponent; // 0x410
	UWwiseEvent* PlayMagicEvent; // 0x418
	UWwiseEvent* StopMagicEvent; // 0x420
	FWwiseEmitter ShantyMagicEmitter; // 0x428
	ALandmarkReactionPlayer* ReactionEventPlayerOpen; // 0x448
	UAnimatedStepsComponent* AnimatedSteps; // 0x450
	EStepsTriggerState StepsState; // 0x458
	TArray<AActor*> ActorsPlayingInstruments; // 0x460
};

struct UBuriedTreasureDataAsset {
	TArray<FVector> Locations; // 0x28
};

struct ASkeletonActionStateCreatorDefinition {
	FAISpawnActionStateParams AISpawnParams; // 0x3d0
	FAIDeadActionStateParams AIDeadParams; // 0x3e0
	FUseItemActionStateParams UseItemParams; // 0x3e4
	FUseCannonActionStateParams UseCannonParams; // 0x3e8
	FRepairObjectActionStateParams RepairObjectParams; // 0x448
	FControlObjectActionStateParams ControlObjectParams; // 0x44c
	FHiddenActionStateParams HiddenStateParams; // 0x464
};

struct ADebugStatusTicketHolder {
	AActor* StatusRecipient; // 0x3d0
};

struct UWaitOnCollectableQuestObjectStepDesc {
	FQuestVariableActor CollectableActor; // 0x80
	FQuestVariablePlayerActor CollectingPlayerActor; // 0x90
};

struct UBTTask_SetBlackboardActor {
	AActor* Actor; // 0x88
};

struct UAIAmmoTypeList {
	TArray<UAthenaAIAmmoDataAsset*> AllAmmo; // 0x28
	UAthenaAIAmmoDataAsset* DefaultAmmo; // 0x38
};

struct UGlintComponent {
	UGlintComponentDataAsset* GlintComponentDataAsset; // 0x5f0
	TArray<AActor*> CurrentEnteredShips; // 0x5f8
	FGlintVisibilityLock GlintVisibilityLock; // 0x608
};

struct ARareHUD {
	FColor WhiteColor; // 0x3d0
	FColor GreenColor; // 0x3d4
	FColor RedColor; // 0x3d8
	APlayerController* PlayerOwner; // 0x3e0
	char bLostFocusPaused : 1; // 0x3e8
	char bShowHUD : 1; // 0x3e8
	char bShowDebugInfo : 1; // 0x3e8
	char bShowHitBoxDebugInfo : 1; // 0x3e8
	char bShowOverlays : 1; // 0x3e8
	char bEnableDebugTextShadow : 1; // 0x3e8
	TArray<AActor*> PostRenderedActors; // 0x3f0
	float LastHUDRenderTime; // 0x400
	float RenderDelta; // 0x404
	TArray<FName> DebugDisplay; // 0x408
	TArray<FName> ToggledDebugCategories; // 0x418
	UCanvas* Canvas; // 0x428
	UCanvas* DebugCanvas; // 0x430
	TArray<FDebugTextInfo> DebugTextList; // 0x438
	AActor* ShowDebugTargetDesiredClass; // 0x448
	AActor* ShowDebugTargetActor; // 0x450
};

struct ATavernBoard {
	UStaticMeshComponent* Mesh; // 0x468
	UInteractableComponent* InteractionRegion; // 0x470
	UBoxComponent* ContextualTutorialOverlap; // 0x478
};

struct USetMechanismActivationModeStepDesc {
	FQuestVariableActor Action; // 0x80
	EMechanismActionActivationMode ActivationMode; // 0x90
};

struct URiddleTextPhrasebookDataAsset {
	TArray<FRiddleTextPhrasebookEntry> Phrases; // 0x28
};

struct AStrongholdKeyProxy {
	FRigidBodyErrorCorrection PhysicsErrorCorrection; // 0x630
	UBoxComponent* BaseComponent; // 0x650
	FNetTimeStampCalculator MovementTimeStamp; // 0x688
	AActor* TutorialOwner; // 0x6f8
	bool IsTutorialProxy; // 0x700
	FReplicatedPhysicsState ReplicatedPhysicsState; // 0x708
	bool ForceKeepTickActive; // 0x758
	ECollisionChannel CachedAutoAimCollisionChannel; // 0x788
	ECollisionResponse CachedVehicleCollisionResponse; // 0x789
};

struct UContestVoyagesDataAsset {
	TArray<FContestVoyageInfo> Contests; // 0x28
	TArray<FTallTaleContestInfo> TallTaleContests; // 0x38
};

struct UMaterialParameterBlendBase {
	UMaterialInstanceDynamic* DynamicMaterial; // 0x38
	FName ParameterName; // 0x40
	FActorComponentSelector Mesh; // 0x48
	int32_t MaterialIndex; // 0x58
};

struct UDrawSphereComponent {
	float SphereRadius; // 0x5a8
};

struct UAthenaInputSettings {
	TArray<FName> AllowedInvertedYAxis; // 0x28
	TArray<FName> AllowedInvertedXAxis; // 0x38
	TArray<FName> AllowedInvertedCombinedAxis; // 0x48
	float RadialSelectionTimeout; // 0x58
	float RadialSelectionMagnitudeThreshold; // 0x5c
	float TimeToBlockInputsAfterRadialDeactivation; // 0x60
	float MinDeflectionToBlockInputsAfterRadialDeactivation; // 0x64
	float MinRadialSectorUnselectableFraction; // 0x68
	float MaxRadialSectorUnselectableFraction; // 0x6c
	float RadialActivationThreshold; // 0x70
	float RadialFastItemSwitchGracePeriod; // 0x74
	TArray<FActionMappingKeyLookupFallback> ActionMappingKeyLookupFallbacks; // 0x78
	TArray<FVirtualActionBindingDefinition> VirtualActionBindingDefinitions; // 0x88
	TArray<FVirtualAxisBindingDefinition> VirtualAxisBindingDefinitions; // 0x98
	float MouseSensitivityMin; // 0xa8
	float MouseSensitivityMax; // 0xac
	float ControllerSensitivityMin; // 0xb0
	float ControllerSensitivityMax; // 0xb4
	float ControllerDeadzoneMin; // 0xb8
	float ControllerDeadzoneMax; // 0xbc
	float ControllerNonLinearityMin; // 0xc0
	float ControllerNonLinearityMax; // 0xc4
	FSingleStickMapping SingleStickOffMappings; // 0xc8
	FSingleStickSettings SingleStickOffSettings; // 0x118
	FSingleStickMapping SingleStickLeftLookMappings; // 0x138
	FSingleStickMapping SingleStickRightLookMappings; // 0x188
	FSingleStickMapping SingleStickLeftMoveMappings; // 0x1d8
	FSingleStickMapping SingleStickRightMoveMappings; // 0x228
	FSingleStickMapping SingleStickLeftHybridMappings; // 0x278
	FSingleStickMapping SingleStickRightHybridMappings; // 0x2c8
	FSingleStickSettings SingleStickOnSettings; // 0x318
};

struct APlaceableReactionMechanismAction {
	UMechanismActionComponent* MechanismActionComponent; // 0x3f8
	float Delay; // 0x400
	bool LoopReactionsWhileActive; // 0x404
	FFloatRange DelayBetweenLoops; // 0x408
};

struct UParticleModuleSpawnBase {
	char bProcessSpawnRate : 1; // 0x50
	char bProcessBurstList : 1; // 0x50
};

struct AClueSiteCircleMapWieldable {
	UTexture2D* InventoryRadialBackgroundTexture; // 0x840
	FMapRadialIconData MapRadialIconData; // 0x860
};

struct ABucket {
	UInventoryItemComponent* InventoryItem; // 0x798
	TArray<FBucketContentsInfo> BucketContentsInfos; // 0x7a0
	UWwiseEvent* ScoopSfx; // 0x7b0
	FName ThrowSocketName; // 0x7b8
	FName DrenchWielderSocketName; // 0x7c0
	float ScoopActionTime; // 0x7c8
	float ScoopCompleteTime; // 0x7cc
	float ThrowActionTime; // 0x7d0
	float ThrowCompleteTime; // 0x7d4
	float DrenchWielderActionTime; // 0x7d8
	float DrenchWielderCompleteTime; // 0x7dc
	float RequestToleranceTimeOnServer; // 0x7e0
	float ProjectileSpeed; // 0x7e4
	float ProjectileAdditionalLiftAngle; // 0x7e8
	float WaterFillFromShip; // 0x7ec
	float WaterFillFromSea; // 0x7f0
	float WaterTransferFillAmountModifier; // 0x7f4
	float ScoopBufferDistance; // 0x7f8
	ECollisionChannel ScoopHitTestTraceChannel; // 0x7fc
	UWieldableItemCooldownBaseType* BucketScoopCooldownType; // 0x800
	UWieldableItemCooldownBaseType* BucketThrowCooldownType; // 0x808
	UWieldableItemCooldownBaseType* BucketDouseCooldownType; // 0x810
	float ThrowLiquidAINoiseRange; // 0x818
	UNamedNotificationInputComponent* NamedNotificationInputComponent; // 0x820
	ULiquidContainerComponent* LiquidContainer; // 0x828
	FLiquidContents Contents; // 0x830
	EThrowableLiquidType FillState; // 0x871
	UParticleSystemComponent* BucketContentsEffect; // 0x8e8
};

struct UEventBroadcastStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UPlayerAtmosphericsAudioComponentParams {
	UWwiseEvent* WindStartEvent; // 0x28
	UWwiseEvent* WindStopEvent; // 0x30
	UWwiseEvent* RainStartEvent; // 0x38
	UWwiseEvent* RainStopEvent; // 0x40
	FName GlobalWindSpeedRtpc; // 0x48
	FName PlayerWindAngleRtpc; // 0x50
	FName PlayerVerticalSpeedRtpc; // 0x58
	FName AtmosphericPressureFreqRtpc; // 0x60
	FName AtmosphericPressureVolRtpc; // 0x68
	float AtmosphericPressureFreqTimebase; // 0x70
	float AtmosphericPressureVolTimebase; // 0x74
	TArray<FPoolDensityData> PoolDensityWrapperData; // 0x78
};

struct UMurkWaterModifierZoneComponent {
	float MaximumInnerRadius; // 0x338
	float MaximumOuterRadius; // 0x33c
	UCurveFloat* ActivationCurve; // 0x340
	UCurveFloat* DeactivationCurve; // 0x348
	bool DeactivateActorWhenInactive; // 0x350
	EMurkWaterModifierZoneState State; // 0x351
};

struct UDelayStepDesc {
	float Delay; // 0x80
};

struct UWorldMarkerOnSpawnPositionComponent {
	float ZOffset; // 0xc8
	UWorldMarkerVariant* MarkerVariant; // 0xd0
};

struct UUnmanagedSalvageItemSpawnComponentMock {
	TArray<FIslandItemSpawnLocationData> IslandSalvageLocationData; // 0x4e0
	float GlobalIslandChanceToSpawn; // 0x4f0
	float MinimumZOffSet; // 0x4f4
	float MaximumZOffset; // 0x4f8
	float MinimumRoll; // 0x4fc
	float MaximumRoll; // 0x500
	float MinimumPitch; // 0x504
	float MaximumPitch; // 0x508
	bool SunkenItem; // 0x50c
	UIslandItemDataAsset* SpawnLocationType; // 0x510
	FWeightedProbabilityRangeOfRanges SpawnedContainerContents; // 0x518
};

struct UStatusResponseCancelStatus {
	TArray<UStatusBase*> Status; // 0x30
};

struct ATestableEnchantedSpyglass {
	UInventoryItemComponent* EnchantedInventoryItem; // 0x888
	AActor* ConstellationVisibilityEventActor; // 0x890
};

struct UTaleQuestActorServiceDesc {
	URunnable* ItemLostFailureRunnable; // 0x28
};

struct AOnlineBeacon {
	float BeaconConnectionInitialTimeout; // 0x3d8
	float BeaconConnectionTimeout; // 0x3dc
	UNetDriver* NetDriver; // 0x3e0
};

struct UItemQualityComponent {
	EEmissaryQualityLevel ItemQualityLevel; // 0xd0
	TArray<FPerComanyItemQualityEntry> CompanySpecificItemQualityLevels; // 0xd8
	TArray<FPerComanyComplexItemQualityEntry> CompanySpecificComplexItemQualityLevels; // 0xe8
	TArray<FPerComanyComplexItemQualityEntry> CompanySpecificComplexItemQualityLevelsHandin; // 0xf8
};

struct UFireworkDataAsset {
	FWeightedProbabilityRangeOfRanges PercentageTimeUntilTrailDisappears; // 0x28
	FWeightedProbabilityRangeOfRanges TimeUntilExplosion; // 0x58
	bool IsFlare; // 0x88
	bool ShouldCastAmbientLight; // 0x89
	FFireworkAmbientLightData FireworkAmbientLightData; // 0x8c
	TArray<FWeightedFireworkVFXData> Explosions; // 0xa0
	FWeightedProbabilityRange NumExplosions; // 0xb0
	FWeightedProbabilityRangeOfRanges TimeBetweenExplosions; // 0xd0
	FWeightedProbabilityRangeOfRanges ExplosionLocationOffset; // 0x100
	float FlashbangRadius; // 0x130
	UWwiseObjectPoolWrapper* ExplosionSfxPool; // 0x138
	UWwiseEvent* LaunchSfx; // 0x140
	UFireworkFeedbackDataAsset* FireworkFeedbackData; // 0x148
};

struct UAthenaAIAmmoDataAsset {
	TArray<FAthenaAICharacterControllerWeightedAmmoType> AmmoWeights; // 0xb8
	FName FeatureName; // 0xc8
};

struct UAbilityTask_SpawnActor {
	FScriptMulticastDelegate Success; // 0x68
	FScriptMulticastDelegate DidNotSpawn; // 0x78
};

struct UMaterialExpressionIfCondition {
	FExpressionInput A; // 0x70
	FExpressionInput B; // 0xa8
	FExpressionInput IfTrue; // 0xe0
	FExpressionInput IfFalse; // 0x118
	EIfExpressionCondition Condition; // 0x150
	EIfExpressionAttribute Attribute; // 0x151
	float ConstB; // 0x154
	float ConstIfTrue; // 0x158
	float ConstIfFalse; // 0x15c
};

struct UBTDecorator_IsPerchedInHangout {
	char bInverseCondition : 1; // 0x60
	EBTFlowAbortMode FlowAbortMode; // 0x64
};

struct UVulnerabilityDuringAIStrategyComponent {
	TArray<FAIStrategyVulnerabilityData> StrategyVulnerabilities; // 0xc8
	UHealthComponent* HealthComponent; // 0xd8
};

struct ATreasuryRoom {
	UBoxComponent* RoomAreaComponent; // 0x3d8
	float TreasuryInactiveDurationMinSeconds; // 0x3e0
	float TreasuryInactiveDurationMaxSeconds; // 0x3e4
	float RoomFailureDurationSeconds; // 0x3e8
	float WaveDelaySeconds; // 0x3ec
	float EncounterDelaySeconds; // 0x3f0
	float VaultDoorAnimDurationSeconds; // 0x3f4
	float VaultDoorOpenDurationSeconds; // 0x3f8
	int32_t MinWavesInEncounter; // 0x3fc
	int32_t MaxWavesInEncounter; // 0x400
	int32_t MaxEncounters; // 0x404
	TArray<FTreasuryWaveEncounter> WaveEncounters; // 0x408
	AActor* FloodMechanismActor; // 0x418
	AActor* FloodTriggerActor; // 0x420
	AActor* DrainMechanismActor; // 0x428
	AActor* DrainTriggerActor; // 0x430
	AActor* VaultMechanismActor; // 0x438
	AActor* VaultTriggerActor; // 0x440
	AActor* VaultLootSpawner; // 0x448
	AActor* VaultLootSpawnLocationActor; // 0x450
	AActor* Shimmer; // 0x458
	TArray<AActor*> OverlappingActors; // 0x478
	TArray<TWeakObjectPtr<AController>> CachedParticipantControllers; // 0x488
	AActor* VaultLootSpawnerActor; // 0x498
	FPlayerStat VaultOpenStat; // 0x4a0
	UMechanismActionComponent* FloodMechanismComponent; // 0x4a8
	UMechanismActionComponent* DrainMechanismComponent; // 0x4b0
	UMechanismActionComponent* VaultMechanismComponent; // 0x4b8
	TScriptInterface<Class> FloodTriggerComponent; // 0x4c0
	TScriptInterface<Class> DrainTriggerComponent; // 0x4d0
	TScriptInterface<Class> VaultTriggerComponent; // 0x4e0
};

struct UShipLiveryComponent {
	UShipLiveryDescAsset* DefaultLivery; // 0xc8
	TArray<FShipLivery> LiveryDescs; // 0xd0
};

struct UMovieScene3DPathTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x88
};

struct UWidgetTree {
	UWidget* RootWidget; // 0x28
	TArray<UWidget*> AllWidgets; // 0x30
};

struct ULandmarkReactionEventStartParticleSystem {
	FName ComponentName; // 0x38
	int32_t ComponentIndex; // 0x40
	UWwiseEvent* AudioCue; // 0x48
};

struct UPirateLegendTypeFilter {
	EPLSectionType AllowedType; // 0x28
};

struct UWaitForMechanismActionCompletionStep {
	UWaitForMechanismActionCompletionStepDesc* Desc; // 0x90
};

struct UParticleModuleSubUVMovie {
	char bUseEmitterTime : 1; // 0x90
	FRawDistributionFloat FrameRate; // 0x98
	int32_t StartingFrame; // 0xd0
};

struct UElectricShieldBuffComponent {
	UParticleSystem* ShieldVFXAsset; // 0xd0
	FName VfxSocketName; // 0xd8
	UWwiseEvent* StartAudioLoopEvent; // 0xe0
	UWwiseEvent* StopAudioLoopEvent; // 0xe8
	bool IsShieldActive; // 0xf0
	UParticleSystemComponent* ShieldEffectComponent; // 0xf8
};

struct UInstancedNavMeshComponent {
	FName NavMeshName; // 0x2b8
	bool UseAttachedParentAsPrimitiveBase; // 0x2c0
};

struct UVaultMaterialSetDataAsset {
	TArray<FBlockDecalMaterials> BlockConfigurations; // 0x28
};

struct UCharacterAnimaticSettingsComponent {
	bool HasPlayedWakeUpAnimation; // 0x138
};

struct UPersistentSalvageItemSpawnComponent {
	float RefreshItemsRate; // 0x548
};

struct URowingInputComponent {
	ARowingSeat* TargetOars; // 0x280
};

struct AWieldableMegalodonEffigy {
	ETinySharkTypes MegalodonSoulType; // 0x790
};

struct UAIProgressiveWavesSpawner {
	bool ApplyLocalisableNamesToNameplates; // 0x428
	TArray<FAIPersistentSpawnerWave> Waves; // 0x430
	AActor* TriggerActor; // 0x458
};

struct UMigrationInputComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UBTTask_DetermineFollowUpAIAbility {
	UAthenaAIAbilityType* AIAbilityTypeToFollowUp; // 0x60
};

struct AStaticMeshActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x3d0
	bool bStaticMeshReplicateMovement; // 0x3d8
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x3d9
};

struct UGhostCharacterAudioComponentParams {
	FName PlayerStateName; // 0x28
	FName PlayerStateGhostShip; // 0x30
	FName PlayerStateDefault; // 0x38
};

struct AStorySpawnedActorsService {
	TMap<FName, FSpawnedActorsList> SpawnedActors; // 0x3d8
	UStorySpawnedActorsCollectionDataAsset* Asset; // 0x428
};

struct UFlatWaterMeshComponent {
	int32_t RandomDropRate; // 0x5f0
	float RandomDropSize; // 0x5f4
	float RandomDropHeight; // 0x5f8
	float RestorationScale; // 0x5fc
	float ForceScale; // 0x600
	float DampHeight; // 0x604
	float NormalMapScale; // 0x608
	int32_t TextureWidth; // 0x60c
	int32_t TextureHeight; // 0x610
	UStaticMesh* ClippingHull; // 0x618
	float MaxSimulationDistance; // 0x620
	float InitialRandomHeight; // 0x624
	float InitialRandomVelocity; // 0x628
	UTexture* Texture; // 0x630
	UTexture* NormalTexture; // 0x638
	UTextureRenderTarget2D* WaterMaskTexture; // 0x640
	TArray<UMaterialInterface*> OriginalMaterials; // 0x660
	TArray<FFlatWaterMeshTextureOverride> TextureOverrides; // 0x670
};

struct UTaleQuestAddBountyMapStepDesc {
	FName MapId; // 0x80
	FQuestVariableName IslandName; // 0x88
	FQuestVariableText Location; // 0x98
	FQuestVariableTextArray Description; // 0xa8
	FQuestVariableBountyTargetArray CaptainTargets; // 0xb8
	FQuestVariableBountyTargetArray CrewTargets; // 0xc8
	UBountyMapLayout* CustomLayout; // 0xd8
	UTreasureMapItemDesc* OverrideTreasureMapItemDesc; // 0xe0
};

struct UShipLightComponent {
	TArray<EShipRegion> DormantShipRegions; // 0xd0
	bool ExposeToNetProxy; // 0xe0
	int32_t NetProxyBitIndex; // 0xe4
	UInteractableLightParameters* LightParameters; // 0xe8
	bool LightIsOn_Server; // 0xf1
	TArray<UPointLightComponent*> Lights; // 0x108
};

struct UBTTask_SetFollowUpAbility {
	UAthenaAIAbilityType* AIAbilityType; // 0x60
};

struct UAIEncounterSettingsRankProgression {
	FStringAssetReference SkillsetProgression; // 0x60
	FStringAssetReference LoadoutProgression; // 0x70
	FStringAssetReference FormProgression; // 0x80
	FStringAssetReference AmmoProgression; // 0x90
	FStringAssetReference ItemDropComponentProgression; // 0xa0
	FEncounterParams EncounterTrackingParams; // 0xb0
};

struct UMeshMemoryConstraintScoringNumberOfMeshes {
	FName ScoringName; // 0x28
	float ScoringFactor; // 0x30
};

struct UAnimNotify_SpawnCosmeticItem {
	AActor* ItemSpawnClass; // 0x38
	EWieldAnimationLocation SpawnLocation; // 0x40
	UCosmeticItemAnimationSetDataAsset* CosmeticItemAnimationDataSet; // 0x48
	bool SpawnHidden; // 0x50
	bool SpawnForRole; // 0x51
	ENetRole SpawnRole; // 0x52
};

struct UTaleResourceBrokerService {
	TScriptInterface<Class> ContendedResourceService; // 0x60
	TScriptInterface<Class> ResourceRegistry; // 0x70
	TArray<FMigrationActionPair> MigrationActions; // 0x80
};

struct UMaterialExpressionAdd {
	FExpressionInput A; // 0x70
	FExpressionInput B; // 0xa8
	float ConstA; // 0xe0
	float ConstB; // 0xe4
};

struct UPawnAction_Wait {
	float TimeToWait; // 0x90
};

struct UPhasedActorSourceComponent {
	AActor* PhasingSourceActor; // 0xc8
};

struct UCustomSkeletonAnimationDataList {
	TArray<FStringAssetReference> CustomAnimationAssets; // 0x28
};

struct UWrapBoxSlot {
	FMargin Padding; // 0x38
	bool bFillEmptySpace; // 0x48
	float FillSpanWhenLessThan; // 0x4c
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UAnimNotify_AthenaPlayParticleEffect {
	UObject* PSTemplate; // 0x38
	FName SocketName; // 0x40
	FVector LocationOffset; // 0x48
	FRotator RotationOffset; // 0x54
	FVector RelativeScale; // 0x60
	FLinearColor ColorTint; // 0x6c
	float CustomParameter; // 0x7c
	char Attached : 1; // 0x80
	char KeepWorldScale : 1; // 0x80
	char OwnerOnlySee : 1; // 0x80
	char OwnerNoSee : 1; // 0x80
	char OwnedByWorld : 1; // 0x80
	EAnimNotifyUnderwaterMode UnderwaterMode; // 0x84
	EVfxCustomLocalSpaceMode CustomLocalSpaceMode; // 0x85
};

struct UWashedUpMessageInABottleClueDestinationGenerator {
	UClueSiteData* RequiredClueSiteDataType; // 0x28
	TArray<FWeightedClueDestinationDescriptor> WeightedSupportedDescriptorTypes; // 0x30
};

struct UAddOpenContainerActionRuleComponent {
	UNotificationInputId* NotificationInputId; // 0xc8
	EActionDisplayPriority DisplayPriority; // 0xd0
};

struct ACustomizableShipService {
	TArray<FWeakActorHandle> ShipList; // 0x3e0
	TArray<FCrewShipEntry> CrewedShips; // 0x410
	FCrewShipPersistentDataManager PersistentCrewShipData; // 0x420
};

struct ACluster {
	TArray<UClusterStaticMeshComponent*> ClusterStaticMeshes; // 0x3d0
	TArray<UStaticMeshComponent*> AllComponents; // 0x3e0
	bool DoesContainDecorator; // 0x3f0
};

struct UAbandonedNoteClueDescriptorGenerator {
	UClueDescriptor* DescriptorType; // 0x28
	TArray<UClueDestinationDescriptor*> SupportedDestinationTypes; // 0x30
};

struct USoundCue {
	char bOverrideAttenuation : 1; // 0x50
	USoundNode* FirstNode; // 0x58
	float VolumeMultiplier; // 0x60
	float PitchMultiplier; // 0x64
	FAttenuationSettings AttenuationOverrides; // 0x68
};

struct UShipLiveryDescAsset {
	FShipLivery ShipLivery; // 0x28
};

struct UWorldMarkerRoutingComponent {
	AActor* DefaultListenerType; // 0xd0
	TScriptInterface<Class> MarkerListener; // 0xd8
};

struct UBTTask_AthenaWait {
	bool UseMinMax; // 0x60
	FAIDataProviderFloatValue Min; // 0x68
	FAIDataProviderFloatValue Max; // 0x98
	FAIDataProviderFloatValue FixedWaitTime; // 0xc8
};

struct UCheckBoxStyleAsset {
	FCheckBoxStyle CheckBoxStyle; // 0x28
};

struct URewardHandInComponent {
	UCompany* Company; // 0xd0
};

struct UTakesItemFromStorageContainerConditionalTrigger {
	FName UniqueTextIdentifier; // 0x28
};

struct UCompositionGraphCaptureSettings {
	FCompositionGraphCapturePasses IncludeRenderPasses; // 0x28
	bool bCaptureFramesInHDR; // 0x38
	int32_t HDRCompressionQuality; // 0x3c
	EHDRCaptureGamut CaptureGamut; // 0x40
	FStringAssetReference PostProcessingMaterial; // 0x48
};

struct UTaleRegisterSpireStepDesc {
	FQuestVariableVector SelectionOriginPoint; // 0x80
	FQuestVariableFloat PlayerExclusionSelectionRadius; // 0x90
	FQuestVariableTaleResourceHandle AllocatedSpireHandle; // 0xa0
	FQuestVariableVector AllocatedSpireLocation; // 0xb0
};

struct UMovieSceneEnumTrack {
	UEnum* Enum; // 0xb0
};

struct UAbilityTask_WaitVelocityChange {
	FScriptMulticastDelegate OnVelocityChage; // 0x68
	UMovementComponent* CachedMovementComponent; // 0x78
};

struct UBurrowAIAbilityParams {
	TArray<EPhysicalSurface> ValidBurrowSurfaceTypes; // 0xc8
	ABurrowCrack* BurrowCrackToSpawn; // 0xd8
	ABurrowEruptBase* BurrowEruptArea; // 0xe0
	UEnvQuery* EnvQueryLinesToTarget; // 0xe8
	UEnvQuery* EnvQueryAroundTarget; // 0xf0
	FVector OffsetPositionForStartTrace; // 0xf8
	float SurfaceDetectRaycastLength; // 0x104
	float BurrowAroundTargetRange; // 0x108
	float MaxSurfaceAngleForBurrow; // 0x10c
	bool bEruptFromClosestSpawn; // 0x110
	FMinMaxBurrowAbility EruptionDelayRndBetweenMinMaxSeconds; // 0x114
	FMinMaxBurrowAbility NumberOfCrackWavesMinMax; // 0x11c
	FMinMaxBurrowAbility RndSecondsBetweenCrackWaves; // 0x124
	FMinMaxBurrowAbility NumberOfCracksPerWaveMinMax; // 0x12c
	FMinMaxBurrowAbility RndSecondsBetweenEachCrackSpawn; // 0x134
};

struct AShroudBreakerService {
	UWorld* World; // 0x448
};

struct UAISpawnWaveSequence {
	TArray<FAISpawnerWave> Waves; // 0x28
	FName FeatureName; // 0x38
};

struct UVoyageRewardDataAsset {
	TArray<FPerChapterRankRewardEntry> RankEntries; // 0x28
};

struct UStopSuppressingCutsceneResponsesStepDesc {
	bool Fork; // 0x28
	TMap<FName, FQuestVariableAny> PromotedPropertyVariables; // 0x30
};

struct UContestRewardComponent {
	TWeakObjectPtr<AContestManagerService> CachedOwningContestManager; // 0x110
};

struct UWaitOnCollectableQuestObjectStep {
	UWaitOnCollectableQuestObjectStepDesc* StepDesc; // 0x98
};

struct UBlackboardKeyType_Enum {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UCoherentUIGTRenderToTextureLiveView {
	FString LinkName; // 0xc8
	UTextureRenderTarget2D* Texture; // 0xd8
};

struct AItemInfo {
	bool CanBeStoredInInventory; // 0x3f0
	FScriptMulticastDelegate OnItemPickedUpDelegate; // 0x3f8
	FScriptMulticastDelegate OnItemDroppedDeletage; // 0x408
	AWieldableItem* WieldableType; // 0x418
	AActor* ProxyType; // 0x420
	UWieldableItemPersistentCooldownComponent* WieldableItemPersistenceCooldownComponent; // 0x428
	UItemDesc* Desc; // 0x430
	EItemRepresentation CurrentRepresentation; // 0x438
	AActor* CurrentRepresentationInstance; // 0x440
	AActor* CurrentOwner; // 0x448
	AActor* TutorialOwner; // 0x450
	bool DoNotConsiderForMigrationGather; // 0x4f9
};

struct UDynamicFlowComponent {
	UTexture2D* FlowTexture; // 0x5f0
	int32_t TextureSizeX; // 0x5f8
	int32_t TextureSizeY; // 0x5fc
	float UpdateCullDistance; // 0x600
	FVector2D FlowUVScrollSpeed; // 0x604
	FVector4 WaterDepthDistances; // 0x610
	float NearFadeStart; // 0x620
	float NearFadeRange; // 0x624
	FVector2D FlowScale; // 0x628
	FVector2D FlowBias; // 0x630
	FVector4 BlurCentreWeights; // 0x640
	FVector4 BlurEdgeWeights; // 0x650
	FVector4 FadeWeights; // 0x660
	UTextureRenderTarget2D* RenderTargetTexture; // 0x670
	UTextureRenderTarget2D* RenderTargetTexturePingPong; // 0x678
};

struct UPlayerBuriedItemServiceDataAsset {
	UPopUpMessageDesc* TreasureDiscoveredMessage; // 0x28
	UPopUpMessageDesc* TreasureDiscoveredByYouMessage; // 0x30
	UPopUpMessageDesc* TreasureRetrievedMessage; // 0x38
	UPopUpMessageDesc* TreasureRetrievedByYouMessage; // 0x40
	UPopUpMessageDesc* TreasureBuriedMapAddedMessage; // 0x48
	float TreasureBuriedByYouMessageDelay; // 0x50
	UPopUpMessageDesc* TreasureBuriedByYouMapAddedMessage; // 0x58
	UPopUpMessageDesc* TreasureBuriedMapUpdatedMessage; // 0x60
	UPopUpMessageDesc* TreasureBuriedByYouMapUpdatedMessage; // 0x68
	UPopUpMessageDesc* TreasureBuriedXNotCreatedMessage; // 0x70
	UPopUpMessageDesc* TreasureBuriedByYouXNotCreatedMessage; // 0x78
	UPopUpMessageDesc* MapGiftedMessage; // 0x80
	UPopUpMessageDesc* MapGiftedByYouMessage; // 0x88
	UPopUpMessageDesc* MapGiftedToYourCrewMessage; // 0x90
	UPopUpMessageDesc* MapBundleStolenVictimMessage; // 0x98
	UPopUpMessageDesc* MapBundleStolenVictimWasYouMessage; // 0xa0
	UPopUpMessageDesc* MapBundleStolenPerpetratorMessage; // 0xa8
	UPopUpMessageDesc* MapBundleStolenPerpetratorWasYouMessage; // 0xb0
	UPopUpMessageDesc* MapBundlePlacedOnTableMessage; // 0xb8
	UPopUpMessageDesc* MapBundleRetrievedMessage; // 0xc0
	UPopUpMessageDesc* MapBundleWasSpawnedInSunkenShip; // 0xc8
	UPopUpMessageDesc* MapWasAddedToTavernBoard; // 0xd0
	UPopUpMessageDesc* MapWasTakenFromTavernBoard; // 0xd8
	TArray<EBootyTypes> PrioritiseUseRewardIdAsPopup; // 0xe0
	UTreasureMapItemDesc* PlayerBuriedItemMapItemDesc; // 0xf0
	UItemDesc* PlayerBuriedItemMapBundleItemDesc; // 0xf8
	float ItemDigUpRadius; // 0x100
	TArray<FPlayerBuriedItemServiceItemDigUpRadiusSurfaceOverride> ItemDigUpRadiusSurfaceOverride; // 0x108
	float IsUndergroundLineTraceLength; // 0x118
	ECollisionChannel IsUndergroundLineTraceChannel; // 0x11c
	TArray<EPhysicalSurface> IgnoreSurfaceTypes; // 0x120
	int32_t NumXsDonationCommendationThreshold; // 0x130
	int32_t DailyMapLimit; // 0x134
	UPlayerBuriedItemServiceMapStorePopulatorDataAsset* MapStorePopulatorDataAsset; // 0x138
	UPlayerBuriedItemServiceHaulSizeDataAsset* HaulSizeDataAsset; // 0x140
	float ServerShutdownCompensationRewardScalar; // 0x148
	float MapBundleLostByAnotherCrewCompensationRewardScalar; // 0x14c
	float SendRewardCompensationForItemsSecondsBeforeShutdown; // 0x150
	int32_t NumItemsRequiredOnMapForHoardStat; // 0x154
	float LineTraceHalfLength; // 0x158
	ECollisionChannel HitTestTraceChannel; // 0x15c
};

struct URumbleHandlerComponent {
	TArray<FRumbleParameters> RumbleParameters; // 0xc8
};

struct UBTTask_NOP {
	int32_t Id; // 0x60
};

struct ASceneCaptureCube {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x3d8
	UDrawFrustumComponent* DrawFrustum; // 0x3e0
};

struct UAnimSequenceBase {
	TArray<FAnimNotifyEvent> Notifies; // 0x50
	float SequenceLength; // 0x60
	float RateScale; // 0x64
	FRawCurveTracks RawCurveData; // 0x68
};

struct UMeshMemoryConstraintFallbackDataAsset {
	FName FallbackName; // 0x28
	UMeshMemoryConstraintBudget* ConstraintBudget; // 0x30
	TArray<UMeshMemoryConstraintFallbackCategoryDataAsset*> MeshFallbacks; // 0x38
	TArray<float> ThresholdsMB; // 0x48
	float ScoringIntervalInSeconds; // 0x58
	TArray<UMeshMemoryConstraintScoringObject*> ScoringData; // 0x60
};

struct AInstancedNavMeshBoundsVolume {
	FNavAgentSelector SupportedAgents; // 0x408
	FName OriginatingLevelName; // 0x40c
};

struct USoundNodeAttenuation {
	USoundAttenuation* AttenuationSettings; // 0x38
	FAttenuationSettings AttenuationOverrides; // 0x40
	char bOverrideAttenuation : 1; // 0x100
};

struct UGameAudioService {
	TArray<AShip*> ClientRegisteredShips; // 0x30
};

struct AMegalodonSummonZone {
	ETinySharkTypes MegType; // 0x3f8
	float SummonRadius; // 0x3fc
	float UpdateFrequency; // 0x400
};

struct UShipPartCustomizationComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct AFishingFish {
	UFishDataAsset* FishDataAsset; // 0x5f0
	UFishingMiniGameFishDataAsset* FishingMiniGameFishDataAsset; // 0x5f8
	FPlayerStat OnFishCaughtStat; // 0x600
	UParticleSystemComponent* BattlingVFX; // 0x608
	UParticleSystemComponent* BeingTiredVFX; // 0x610
	UWaterInteractionComponent* WaterInteractionComponent; // 0x618
	UItemDesc* CaughtFishItemDesc; // 0x620
	UDitherComponent* DitherComponent; // 0x8c0
	FVector MouthAttachLocation; // 0x8c8
	float AutoKillTime; // 0x8d4
	int32_t RandomAnimationLoopVal; // 0x8e0
};

struct UMaterialExpressionSquareRoot {
	FExpressionInput Input; // 0x70
};

struct UMeleeAttackProcessorComponent {
	int32_t MaxPlayerHitResponsesBroadcastPerAttack; // 0xd0
	int32_t MaxNonPlayerPawnHitResponsesBroadcastPerAttack; // 0xd4
	int32_t MaxOtherHitResponsesBroadcastPerAttack; // 0xd8
	float RewindInstigatorEstimationMaxSearchTime; // 0xdc
	float RewindInstigatorEstimationStepSize; // 0xe0
	FMeleeAttackHitResponses PredictiveHitResponses; // 0x114
	FMeleeAttackHitResponses ValidatedHitResponses; // 0x115
	FMeleeAttackHitResponses AuthoritativeHitResponses; // 0x116
	FMeleeAttackHitResponses ServerHitResponses; // 0x117
};

struct UTaleQuestGenericBannerStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UFireworksDebugSpawnItemsDataAsset {
	FClassicFireworkDebugList ClassicFireworks; // 0x28
	FFireworkDebugListByFireworkType ThemedFireworks; // 0x98
	TArray<UItemDescSpawnData*> Flares; // 0xb8
	TArray<UItemDescSpawnData*> AllFireworks; // 0xc8
};

struct UEventCatchStep {
	UEventCatchStepDesc* Desc; // 0x90
};

struct ATaleProgressStatue {
	UStaticMeshComponent* StaticMeshComponent; // 0x3d0
	FName InteractionSocketName; // 0x3d8
	UTaleProgressStatueInteractableComponent* InteractableComponent; // 0x3e0
	int32_t StatueProgressLevel; // 0x3e8
	bool HasReturnToShipInteraction; // 0x3ec
	TArray<FName> ValidTaleCampaignIds; // 0x3f0
	UMaterialInstanceDynamic* DynamicGlowMaterialInstance; // 0x400
	UParticleSystemComponent* ResumeFromTaleProgressParticleSystem; // 0x408
	FName GlowParamName; // 0x410
	int32_t GlowOffEmissiveScalarValue; // 0x418
	int32_t GlowOnEmissiveScalarValue; // 0x41c
};

struct UBountyMapLayout {
	FTreasureMapWidgetText Location; // 0x28
	TArray<FTreasureMapWidgetText> Descriptions; // 0x48
	TArray<FBountyMapLayoutTarget> Targets; // 0x58
	TArray<FTreasureMapWidgetTexture> Images; // 0x68
	TArray<FTreasureMapWidgetLocalisedText> GeneralText; // 0x78
};

struct UTextureSwitchByItem {
	FStringAssetReference FallbackTexture; // 0x220
	TArray<FTextureSwitchItemEntry> Entries; // 0x230
};

struct UEditableGameplayTagQueryExpression_NoExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UPlaySequencerAnimationOnCutsceneActorStep {
	UPlaySequencerAnimationOnCutsceneActorStepDesc* StepDesc; // 0x90
	ASequencerCutSceneActor* SequencerCutSceneActor; // 0x98
	TArray<FPossessableSequence> PossessableSequences; // 0xa0
};

struct UTaleQuestCheckpointServiceDesc {
	UPopUpMessageDesc* Notification; // 0x28
};

struct USpawnRewardStepDesc {
	FQuestVariableItemSpawnDataType ItemSpawnData; // 0x80
	FQuestVariableVector SpawnLocation; // 0x90
	FQuestVariableActor SpawnedActor; // 0xa0
	bool Tracked; // 0xb0
	bool Critical; // 0xb1
	bool DropOnSpawn; // 0xb2
	FText FailureMessage; // 0xb8
};

struct UGridSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int32_t Row; // 0x3c
	int32_t RowSpan; // 0x40
	int32_t Column; // 0x44
	int32_t ColumnSpan; // 0x48
	int32_t Layer; // 0x4c
	FVector2D Nudge; // 0x50
};

struct UGeyserItemSpawnComponent {
	bool SpawnOnStart; // 0x2b0
	FItemSpawnParams SpawnParams; // 0x2b8
	UWeightedItemDescSpawnDataAsset* ReferencedSpawnDistributionAsset; // 0x2e0
	UItemSpawnDistributionAsset* ReferencedSpawnDistribution; // 0x2e8
	TArray<FItemSpawnTransform> SpawnTransforms; // 0x2f0
	TArray<FItemSpawnTransformWithRandomQuantity> SpawnTransformsWithRandomQuantities; // 0x300
	FName FeatureToggle; // 0x310
	ESpawnedItemSource SpawnSource; // 0x318
	float SpawnRate; // 0x31c
	bool DestroyProxiesOnEndPlay; // 0x320
	bool SpawnWithPhysicsEnabled; // 0x321
	bool DoNotAttachToOwnerWhenSpawned; // 0x322
	bool DropItemsOnSpawn; // 0x323
	bool DropItemsUsingPriorityAIDropParams; // 0x324
	TArray<FSpawnInstance> SpawnList; // 0x328
	TArray<FSpawnInstance> SingleItemInstances; // 0x338
	TArray<FSpawnedItem> SpawnedItems; // 0x348
};

struct UGeneratedLocationsDataAsset {
	TArray<FVector> Locations; // 0x28
};

struct UAIShipContextParamsDataAsset {
	float TopDeckPlayerTrackerRadius; // 0x28
	float TimeSpentEmotingOnInitialSpawn; // 0x2c
	bool ForceAIToAlwaysSpawn; // 0x30
	float IntervalBetweenRepairDamageAssignments; // 0x34
	float IntervalBetweenUseCannonAssignments; // 0x38
	float DistForMinXYAIInteractableUtility; // 0x3c
	float DistForMaxXYAIInteractableUtility; // 0x40
	float MinXYAIInteractableUtility; // 0x44
	float MaxXYAIInteractableUtility; // 0x48
	float DistForMinZAIInteractableUtility; // 0x4c
	float DistForMaxZAIInteractableUtility; // 0x50
	float MinZAIInteractableUtility; // 0x54
	float MaxZAIInteractableUtility; // 0x58
	float MinInactiveRepairSpawnDelay; // 0x5c
	float MaxInactiveRepairSpawnDelay; // 0x60
	float SpawnSfxDistance; // 0x64
	float SinkSfxDistance; // 0x68
	int32_t MinCannonAttackersWhenBoarded; // 0x6c
	float StuckCheckInterval; // 0x70
	float StuckCheckDistance; // 0x74
	float MaxDistanceFromEncounter; // 0x78
	float ShipFlippedAngle; // 0x7c
	float SecondsUntilKillAIAfterShipDefeated; // 0x80
	float SecondsDelayForAIShipDefeatedNotification; // 0x84
	bool EnableShipSurfacingMusic; // 0x88
};

struct UAggressiveGhostShipVisualsDataAsset {
	TArray<FAggressiveGhostShipVisualsMaterialOverride> MaterialOverrides; // 0x28
	TArray<FAggressiveGhostShipVisualsExtraMesh> ExtraMeshes; // 0x38
	UAggressiveGhostShipAnimationDataAsset* AppearAnimation; // 0x48
	UAggressiveGhostShipAnimationDataAsset* DisappearAnimation; // 0x50
	UAggressiveGhostShipAnimationDataAsset* SinkingAnimation; // 0x58
};

struct USelectIslandsFromRegionStepDesc {
	FQuestVariableDataAsset Region; // 0x80
	FQuestVariableInt NumIslands; // 0x90
	FQuestVariableInt MaxDifferentIslands; // 0xa0
	FQuestVariableNameArray SelectedIslands; // 0xb0
	URegionIslandSelectionStrategyBase* SelectionStrategy; // 0xc0
	int32_t DefaultNumIslands; // 0xc8
	int32_t DefaultMaxDifferentIslands; // 0xcc
};

struct UTaleQuestFlameOfFateService {
	UTaleQuestFlameOfFateServiceDesc* ServiceDesc; // 0x60
};

struct UWoodPlankItemCategory {
	UNotificationInputId* NotificationInputId; // 0x78
};

struct ACollectableQuestObject {
	float InteractionPointRadius; // 0x488
	FName InteractionPointSocketName; // 0x48c
	FText InteractableObjectPickupName; // 0x498
	USceneComponent* ThirdPersonMesh; // 0x4d0
};

struct UMechanismAnimationEvent_OneShotAudio {
	float StartTime; // 0x60
};

struct UGameUserSettings {
	bool bUseVSync; // 0x28
	uint32_t ResolutionSizeX; // 0x48
	uint32_t ResolutionSizeY; // 0x4c
	uint32_t LastUserConfirmedResolutionSizeX; // 0x50
	uint32_t LastUserConfirmedResolutionSizeY; // 0x54
	int32_t WindowPosX; // 0x58
	int32_t WindowPosY; // 0x5c
	bool bUseDesktopResolutionForFullscreen; // 0x60
	int32_t FullscreenMode; // 0x64
	int32_t LastConfirmedFullscreenMode; // 0x68
	uint32_t Version; // 0x6c
	int32_t AudioQualityLevel; // 0x70
};

struct URecastFilter_UseDefaultArea {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UIsOnActiveVoyageNPCDialogConditional {
	EVoyageDifficultyScope VoyageType; // 0x30
};

struct APuzzleStatueBase {
	UStaticMeshComponent* StaticMeshComponent; // 0x3e0
	UPuzzleStatueInteractableComponent* InteractableComponent; // 0x3e8
	ULockComponent* LockComponent; // 0x3f0
	bool IsStatueDisabled; // 0x3f8
	bool IsStatueActive; // 0x3f9
	float MinDamageToTriggerStatue; // 0x3fc
	UPuzzleStatueBaseAudioParamsDataAsset* PuzzleStatueBaseAudioParams; // 0x408
	UPuzzleStatueVFXComponent* PuzzleStatueVFXComponent; // 0x410
	UParticleSystemComponent* LockPositionParticleSystem; // 0x418
	UParticleSystemComponent* OneShotLockPositionParticleSystem; // 0x420
};

struct UPuzzleStatueVFXComponent {
	UParticleSystemComponent* LockPositionParticleSystem; // 0x118
	UParticleSystemComponent* OneShotLockPositionParticleSystem; // 0x120
	UParticleSystemComponent* BroadcasterShockwaveParticleSystem; // 0x128
	UParticleSystemComponent* BroadcasterHornDustParticleSystem; // 0x130
	UObject* HornVFXTemplate; // 0x138
	UStaticMeshComponent* BroadcasterArmStaticMesh; // 0x140
	UCurveFloat* PulseGlowCurve; // 0x148
	float StatueInactiveIntensityThreshold; // 0x150
	float StatueActivatedIntensityThreshold; // 0x154
	float ReactionSequenceIntensityThreshold; // 0x158
	float SingingIntensityThreshold; // 0x15c
	float IntensityInterpolationSpeed; // 0x160
	TArray<FName> ScalarParameterNamesToOverride; // 0x168
};

struct UItemDescList {
	TArray<UItemDesc*> Items; // 0x28
};

struct UEmissaryVoyageVoteValidatorBase {
	UCompany* TargetCompany; // 0x30
	UEntitlementDesc* RequiredEntitlement; // 0x38
	UEmissaryVoyageInlineVoteConsumerBase* Consumer; // 0xa0
};

struct UBeckonDataAsset {
	TArray<FNPCBeckonGroupEntry> NPCBeckonGroups; // 0x28
	UWwiseObjectPoolWrapper* BeckonAudioPool; // 0x38
	float BeckonIntervalInSeconds; // 0x40
};

struct UBTTask_IncrementBlackboardFloatValue {
	FAIDataProviderFloatValue FloatValueDelta; // 0x88
};

struct UQuestBookPagesInContainerDataAsset {
	FTransform Transform; // 0x30
	UStaticMesh* PagesMesh; // 0x60
	FText ActionTooltipDisplayString; // 0x68
	FText ActionTooltipDisplayStringSentence; // 0xa0
};

struct UAggressiveGhostShipLocationDataAsset {
	float MinRadialSplineOffsetInMetres; // 0x28
	float MaxRadialSplineOffsetInMetres; // 0x2c
	bool UseAlternativeSplinePoints; // 0x30
	int32_t MinNumAlternativeSplinePoints; // 0x34
	int32_t MaxNumAlternativeSplinePoints; // 0x38
	float AlternativeMinRadialSplineOffsetInMetres; // 0x3c
	float AlternativeMaxRadialSplineOffsetInMetres; // 0x40
	float AlternativeMinRadialBlendValue1; // 0x44
	float AlternativeMinRadialBlendValue2; // 0x48
	float MinDistanceBetweenSplinePointsInMetres; // 0x4c
	float CacheDistanceInMetres; // 0x50
};

struct UWaterSensitiveComponent {
	UWaterSensitiveComponentDataAsset* WaterSensitiveData; // 0xc8
};

struct ULocatorContainer {
	TArray<FLocator> Locators; // 0x28
};

struct UMovieSceneByteTrack {
	UEnum* Enum; // 0xb0
};

struct UPetChestViewModelComponent {
	FStringAssetReference ClearIcon; // 0x170
	bool WithClearButtons; // 0x180
	TArray<UPetEntitlementBaseCategory*> Categories; // 0x198
	bool IncludeAllCategory; // 0x1a8
};

struct UMaterialExpressionStaticBoolParameter {
	char DefaultValue : 1; // 0x90
};

struct UMaterialExpressionClamp {
	FExpressionInput Input; // 0x70
	FExpressionInput Min; // 0xa8
	FExpressionInput Max; // 0xe0
	EClampMode ClampMode; // 0x118
	float MinDefault; // 0x11c
	float MaxDefault; // 0x120
};

struct UOnDigTriggerFuse {
	bool OnlyIfBuriedByPlayer; // 0x28
};

struct UTaleQuestFramedStepDesc {
	TArray<UTaleQuestServiceDesc*> Services; // 0x80
	UScriptStruct* Variables; // 0x90
	FInlineUserDefinedStructDetails GeneratedVariables; // 0x98
};

struct ALandscapeGizmoActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct AMapTableControlPoint {
	USceneComponent* SceneRootComponent; // 0x508
	UInteractableComponent* MyInteractable; // 0x510
	FName CameraSocketName; // 0x518
	bool InvertControls; // 0x520
};

struct UDemoNetConnection {
	TArray<UChildConnection*> Children; // 0x50
	UNetDriver* Driver; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	double LastReceiveTime; // 0x3a0
	int32_t MaxDormantActorsCheckedFromRelevancy; // 0x34468
	TArray<UChannel*> DeferredCloseChannels; // 0x344c0
};

struct UOnboardingIntroLocationComponent {
	FRotator SpawnRotation; // 0x2d8
};

struct UBehaviorTreeManager {
	int32_t MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct AIgnitableMechanismTrigger {
	USceneComponent* Root; // 0x3d8
	UTimedFlammableComponent* FlammableComponent; // 0x3e0
	ULightWeightStatusEffectManagerComponent* StatusEffectManagerComponent; // 0x3e8
	UMechanismTriggerComponent* MechanismTriggerComponent; // 0x3f0
};

struct UMaterialExpressionFloor {
	FExpressionInput Input; // 0x70
};

struct UMaterialExpressionCustomOutput {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UMeleeAttackLockOnComponentSettings {
	ULockOnCameraModifierSettings* CameraModifierSettings; // 0x28
	float BreakDistance; // 0x30
	bool DelayTargetEvaluationUntilEndOfStrike; // 0x34
	bool AllowTargetSwitching; // 0x35
	float MaxLockOnAngle; // 0x38
	float MaxLockOnDistance; // 0x3c
};

struct UTaleMakeSpireVisibleStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UWieldableItemCanvasRenderingComponent {
	int32_t CanvasWidth; // 0xd8
	int32_t CanvasHeight; // 0xdc
	FName PrimaryMaterialTextureParameterName; // 0xe0
	TScriptInterface<Class> OwningWieldable; // 0xe8
	UMaybeCompressedCanvasRenderTarget2D* PrimaryRenderTarget; // 0xf8
	TArray<UMaybeCompressedCanvasRenderTarget2D*> AdditionalRenderTargets; // 0x100
};

struct UMovieScene {
	TArray<FMovieSceneSpawnable> Spawnables; // 0x80
	TArray<FMovieScenePossessable> Possessables; // 0x90
	TArray<FMovieSceneBinding> ObjectBindings; // 0xa0
	TArray<UMovieSceneTrack*> MasterTracks; // 0xb0
	UMovieSceneTrack* CameraCutTrack; // 0xc0
	FFloatRange SelectionRange; // 0xc8
	FFloatRange PlaybackRange; // 0xd8
	bool bForceFixedFrameIntervalPlayback; // 0xe8
	float FixedFrameInterval; // 0xec
	float InTime; // 0xf0
	float OutTime; // 0xf4
	float StartTime; // 0xf8
	float EndTime; // 0xfc
};

struct UImage {
	USlateBrushAsset* Image; // 0x138
	FSlateBrush Brush; // 0x140
	DelegateProperty BrushDelegate; // 0x1d0
	FLinearColor ColorAndOpacity; // 0x1e0
	DelegateProperty ColorAndOpacityDelegate; // 0x1f0
	DelegateProperty OnMouseButtonDownEvent; // 0x200
};

struct UMaterialInformationService {
	UDataTable* MaterialTranslationTable; // 0x30
	UDataTable* MaterialAudioTable; // 0x38
	UDataTable* MaterialVFXTable; // 0x40
};

struct UServerNetworkedEventsWhitelistDefinition {
	TArray<UScriptStruct*> ValidEvents; // 0x28
};

struct UTaleQuestGetCrewShipManifestStepDesc {
	FQuestVariableGuid CrewId; // 0x80
	FQuestVariableCrewShipManifest CrewShipManifest; // 0x90
};

struct ATestInventoryAthenaGameMode {
	APawn* GhostShipPawnClass; // 0x4e0
	UNetworkedEventsWhitelistDefinition* ServerNetworkedEventsWhitelistDefinition; // 0x4e8
	FGhostShipCoordinator GhostShipCoordinator; // 0x688
	FStorageContainerRefresher StorageContainerRefresher; // 0x8b8
	URiddleQuestDescGeneratorData* RiddleQuestDescGeneratorData; // 0x990
	float RespawnTimer; // 0x998
	float ContestRespawnTimer; // 0x99c
	float StorageContainerRefreshInterval; // 0x9a0
	int32_t ContainerRefreshBatchSize; // 0x9a4
};

struct UMaterialExpressionPrecomputedAOMask {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UCrewSpawnLocationVariablesListAsset {
	float MinimumSafeShipDistance; // 0x28
	float MaximumSafeShipDistance; // 0x2c
	float SafeShipDistanceScore; // 0x30
	float SpawnIsNotOccupiedPenalty; // 0x34
	int32_t PenaltyResourceIsland; // 0x38
	int32_t PenaltyOutpostIsland; // 0x3c
	int32_t PenaltySmallIsland; // 0x40
	int32_t PenaltyMediumIsland; // 0x44
	int32_t PenaltyLargeIsland; // 0x48
	int32_t PenaltyFort; // 0x4c
	int32_t PenaltySeaPost; // 0x50
	int32_t PenaltyFortOfTheDamned; // 0x54
};

struct ASirenStatue {
	EAthenaAITeam Team; // 0x570
};

struct URammableComponent {
	URammableDamageDataAsset* DamageSettings; // 0xd0
	float MinIntervalBetweenRamDamage; // 0xd8
	TScriptInterface<Class> OwnerDamageable; // 0xe0
	TScriptInterface<Class> OwnerMovement; // 0xf0
};

struct UAggressiveGhostShipFixedSplinesDataAsset {
	TArray<FAggressiveGhostShipFixedSpline> Splines; // 0x28
};

struct ATestStaticWieldableInventoryItem {
	UInventoryItemComponent* InventoryItem; // 0x790
};

struct AInterruptibleProjectileActionItem {
	FStatus OnInterruptionStatus; // 0x950
	bool IsOneShotStatus; // 0x968
	float StatusDuration; // 0x96c
};

struct UConditionalStatsServiceSettings {
	TArray<FConditionalStatsTriggerUnit> ConditionalStats; // 0x28
	TArray<FConditionalStatsTriggerUnit> SeasonConditionalStats; // 0x38
};

struct UNavigationSystem {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	char bAutoCreateNavigationData : 1; // 0x38
	char bAllowClientSideNavigation : 1; // 0x38
	char bSupportRebuilding : 1; // 0x38
	char bInitialBuildingLocked : 1; // 0x38
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x38
	ENavDataGatheringModeConfig DataGatheringMode; // 0x3c
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x40
	float ActiveTilesUpdateInterval; // 0x44
	TArray<FNavDataConfig> SupportedAgents; // 0x48
	float DirtyAreasUpdateFreq; // 0x58
	TArray<ANavigationData*> NavDataSet; // 0x60
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0x70
	FScriptMulticastDelegate OnNavDataRegisteredEvent; // 0xe0
	FScriptMulticastDelegate OnNavigationGenerationFinishedDelegate; // 0xf0
	FNavigationSystemRunMode OperationMode; // 0x1cc
	FStringAssetReference InstancedNavMeshesDataAsset; // 0x3c0
	UInstancedNavMeshesDataAsset* InstancedNavMeshesData; // 0x3d0
};

struct URareGameEngine {
	float MaxDeltaTime; // 0x978
	float ServerFlushLogInterval; // 0x97c
};

struct UAthenaAnimationCustomSkeletonAnimationData {
	FSkeletonCustomAnimationDataStructure SkeletonCustomAnimData; // 0x28
};

struct USeatStat_SleepOnOtherCrewsBed {
	FPlayerStat Stat; // 0x28
};

struct UMegalodonSoulInteractableComponent {
	FText DisplayName; // 0x128
	FText TakeSoulTooltipText; // 0x160
	FText EffigyNotRaisedToolTipText; // 0x198
	FText NotWieldingEffigyTooltipText; // 0x1d0
	FText CannotEnchantEffigyTooltipText; // 0x208
	ETinySharkTypes MegalodonSoulType; // 0x240
	UNotificationInputId* ActivationInput; // 0x248
};

struct UBTDecorator_CompareBlackboardActorSpeed {
	FBlackboardKeySelector BlackboardKey; // 0xb8
};

struct ANetworkClusterEventRoom {
	bool ClearSpawnProgressOnRoomActivate; // 0x3d8
	TArray<AActor*> EntranceMechanisms; // 0x3e0
	TArray<AActor*> ExitMechanisms; // 0x3f0
	FScriptMulticastDelegate PlayerLeftRoomDelegate; // 0x400
	FScriptMulticastDelegate PlayerEnteredRoomDelegate; // 0x410
	UBoxComponent* RoomAreaComponent; // 0x420
	FScriptMulticastDelegate StartedDelegate; // 0x428
	FScriptMulticastDelegate FailDelegate; // 0x438
	FScriptMulticastDelegate CompletedDelegate; // 0x448
	FScriptMulticastDelegate AftermathStartedDelegate; // 0x458
};

struct USpawnPhasedActorWithTransformStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UAnimNotify_RumbleController {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x38
	FName ForceFeedbackTag; // 0x40
	UForceFeedbackCondition* ForceFeedbackCondition; // 0x48
};

struct UIslandSalvageSpawnerCollection {
	TArray<USalvageItemSpawnComponent*> SalvageSpawners; // 0x28
};

struct UTaleQuestClueSiteService {
	UTaleQuestClueSiteServiceDesc* Desc; // 0x60
	TArray<FClueSite> ClueSites; // 0x68
	TMap<EClueSiteLootType, FClueSiteLootHistory> SpawnedLoot; // 0x78
	TArray<FGuid> DebugClueSiteIds; // 0xc8
};

struct UCoherentUIGTNameplateComponent {
	int32_t MaxElements; // 0x3c8
	float NormalizedScreenSpaceVisibilityMargin; // 0x3cc
	UCurveFloat* DistanceScalingCurve; // 0x3d0
	float TitleFadeDistance; // 0x3d8
	FNameplateVisibilityFactors VisibilityFactors; // 0x3dc
};

struct UAIItemSpawnDataSourceComponent {
	UItemSpawnTransformWithRandomQuantityDataAssset* ItemSpawnDataAsset; // 0x2b8
};

struct UStatusResponseTriggerDrunkenness {
	float TargetDrunkenness; // 0x30
	EDrunkennessType SourceOfDrunkenness; // 0x34
};

struct UIsItemOfClassStatCondition {
	UItemDesc* ItemType; // 0x30
	bool ExactMatch; // 0x38
};

struct UTexture2D {
	int32_t RequestedMips; // 0x138
	int32_t ResidentMips; // 0x13c
	int32_t StreamingIndex; // 0x140
	int32_t FirstResourceMemMip; // 0x144
	FIntPoint ImportedSize; // 0x14c
	float ForceMipLevelsToBeResidentTimestamp; // 0x154
	char bTemporarilyDisableStreaming : 1; // 0x158
	char bIsStreamable : 1; // 0x158
	char bHasCancelationPending : 1; // 0x158
	char bForceMiplevelsToBeResident : 1; // 0x158
	char bGlobalForceMipLevelsToBeResident : 1; // 0x158
	TextureAddress AddressX; // 0x15c
	TextureAddress AddressY; // 0x15d
	int32_t MinimumLoadedMips; // 0x160
};

struct UInteractableComponent {
	FName FeatureFlag; // 0xd0
	FVector BoxExtent; // 0xd8
	FVector BoxOrigin; // 0xe4
	FRotator BoxRotation; // 0xf0
	char MayBeGrouped : 1; // 0xfc
	char ProxyForActorInteraction : 1; // 0xfc
	bool RequiresFacingFront; // 0x100
	bool RequiresNotAirborne; // 0x101
	bool RequiresNotSwimming; // 0x102
	float InteractionRadius; // 0x104
	UInteractableArea* InteractableArea; // 0x108
	EInteractableState CurrentInteractionState; // 0x110
};

struct UTextureCube {
	int32_t LODBias; // 0x28
	int32_t NumCinematicMipLevels; // 0x2c
	char SRGB : 1; // 0x30
	char NeverStream : 1; // 0x30
	char bNoTiling : 1; // 0x30
	char bUseCinematicMipLevels : 1; // 0x30
	char CompressionNone : 1; // 0x30
	char bUAV : 1; // 0x30
	uint32_t MaxQualityReduction; // 0x34
	int32_t CachedCombinedLODBias; // 0x38
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x3c
	TextureCompressionSettings CompressionSettings; // 0x40
	TextureFilter Filter; // 0x41
	TextureGroup LODGroup; // 0x42
	float StreamingPriorityBoost; // 0x44
	TArray<FExternalMip> ExternalMips; // 0xa0
};

struct UAnimNotify {
	bool PlayedWithSequencer; // 0x28
};

struct UMovieSceneAudioTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x88
};

struct UEnvQueryGenerator {
	FString OptionName; // 0x30
	bool NonShippingOnly; // 0x40
	UEnvQueryItemType* ItemType; // 0x48
};

struct UBTDecorator_CompareBlackboardClassValue {
	UObject* Class; // 0x90
	bool Invert; // 0x98
	FString CachedDescription; // 0xa0
	EBTBlackboardRestart NotifyObserver; // 0xb0
};

struct UDataTable {
	UScriptStruct* RowStruct; // 0x28
};

struct UTaleQuestLocationMapChestFoundStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UAISpawnContextTaleQuestService {
	UAISpawnContextTaleQuestServiceDesc* Desc; // 0x60
};

struct UXPReward {
	uint32_t Xp; // 0x28
};

struct ALargeWieldableMockActor {
	UInventoryItemComponent* InventoryItem; // 0x7b0
};

struct UMeleeSpinAbilityStageParams {
	float AbilityCooldownSpeedMultiplier; // 0x28
	float DamageRequiredForNextIntervalMultiplier; // 0x2c
	bool OverrideParams; // 0x30
	bool AutoActivateOnStageTransition; // 0x31
	UAthenaAIAbilityType* TypeClass; // 0x38
};

struct UAIPerceptionComponent {
	float HearingRange; // 0xc8
	float LoSHearingRange; // 0xcc
	float SightRadius; // 0xd0
	float LoseSightRadius; // 0xd4
	float PeripheralVisionAngle; // 0xd8
	TArray<UAISenseConfig*> SensesConfig; // 0xe0
	UAISense* DominantSense; // 0xf0
	AAIController* AIOwner; // 0x108
	FScriptMulticastDelegate OnPerceptionUpdated; // 0x190
	FScriptMulticastDelegate OnTargetPerceptionUpdated; // 0x1a0
};

struct ABootyStorageService {
	UBootyStorageSettings* BootyStorageSettings; // 0x450
	UBootyStorageSettingsAsset* BootyStorageSettingsAsset; // 0x458
	TArray<FCrewBootyStorage> Storage; // 0x460
	FEnvQueryRequest SpawnBootyEQSRequest; // 0x470
	FEnvQueryRequest SpawnRetrievalActorEQSRequest; // 0x5e0
};

struct USizeBoxSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct AMurk {
	UMurkWaterModifierZoneComponent* WaterModifierZone; // 0x3d0
	USceneComponent* SceneRootComponent; // 0x3d8
	UStaticMeshComponent* InnerSheet; // 0x3e0
	UStaticMeshComponent* OuterSheet; // 0x3e8
	float UnderwaterSheetHeightScale; // 0x3f0
	UMaterialInstanceDynamic* InnerSheetMaterialInstance; // 0x3f8
	UMaterialInstanceDynamic* OuterSheetMaterialInstance; // 0x400
};

struct UFireGridAudioManager {
	FFireCellAudioParams FireAudioParams; // 0x28
	AActor* OwningActor; // 0x68
	UFirePropagator* FirePropagator; // 0x70
};

struct UDiggingComponent {
	FScriptMulticastDelegate OnFinishedDigging; // 0xd0
	FScriptMulticastDelegate OnFinishedBurying; // 0xe0
	AActor* Discoverer; // 0xf0
	FBuriedFactor BuriedFactor; // 0xf8
	EDiggingState State; // 0x10c
	FVector StartingLocation; // 0x110
	FRotator StartingRotation; // 0x11c
	UMaterialInstanceDynamic* ItemDynamicMaterial; // 0x128
	FItemDiggingMergedConfig DiggingConfig; // 0x130
	UDiggingSettings* DiggingSettings; // 0x158
	UWwiseObjectPoolWrapper* CachedSfxPool; // 0x160
};

struct UAnimationDataStore {
	TArray<FAnimationDataStoreEntry> Data; // 0x40
	TArray<FAnimationDataStoreLoadingEntry> LoadingData; // 0x50
};

struct UItemHealthComponent {
	float MinTimeSinceLastPredictedHealthChangeToFireChangedEventAgain; // 0xd8
	bool PreventDamageFromAllSourcesExceptWhitelistedSources; // 0xdc
	float MaxHealth; // 0xe0
	FCurrentHealthInfo CurrentHealthInfo; // 0xe4
	TArray<FContinuousHealthChange> ContinuousHealthChangeSources; // 0x100
	bool IsHealthAdjustLocked; // 0x110
};

struct UPetCategory_C {
	FName PetPreviewCamera; // 0x80
};

struct UPhysicsHandleComponent {
	UPrimitiveComponent* GrabbedComponent; // 0xc8
	float LinearDamping; // 0xe0
	float LinearStiffness; // 0xe4
	float AngularDamping; // 0xe8
	float AngularStiffness; // 0xec
	float InterpolationSpeed; // 0x150
};

struct UEnvQueryTest_InSunkenIslandSurfaceZone {
	UGameEventType* ExclusionType; // 0x170
};

struct UAshenLordAIFormComponent {
	UWwiseEvent* AshenLordVulnerabilityDamageAudioEvent; // 0x138
	FName AshenLordHeartBeatShaderParamName; // 0x140
	UMaterial* AshenLordBaseMaterial; // 0x148
	UCameraShake* CameraShake; // 0x168
	float ShakeInnerRadius; // 0x170
	float ShakeOuterRadius; // 0x174
	UMaterialInstanceDynamic* AshenLordDynamicMaterialInstance; // 0x178
	float CachedNormalisedHealthScalar; // 0x180
	bool IsInVulnerability; // 0x184
};

struct AWheel {
	UReplicatedShipPartCustomizationComponent* CustomizationComponent; // 0x530
	FWheelAnimationProperties WheelAnimationProps; // 0x538
	FWheelEventProperties WheelEventProps; // 0x5b0
	UForceFeedbackEffect* CenteredForceFeedbackEffect; // 0x5b8
	UForceFeedbackEffect* TurbulenceForceFeedbackEffect; // 0x5c0
	FName TurbulenceForceFeedbackTag; // 0x5c8
	UForceFeedbackEffect* SteeringForceFeedbackEffect; // 0x5d0
	FName SteeringForceFeedbackTag; // 0x5d8
	UWwiseObjectPoolWrapper* EmitterPool; // 0x5e0
	UWwiseEvent* WheelStartedMovingEvent; // 0x5e8
	UWwiseEvent* WheelHasStoppedEvent; // 0x5f0
	UWwiseEvent* WheelIsStoppingEvent; // 0x5f8
	UWwiseEvent* DamagedWheelStartedMovingEvent; // 0x600
	UWwiseEvent* DamagedWheelHasStoppedEvent; // 0x608
	UWwiseEvent* DamagedWheelIsStoppingEvent; // 0x610
	UWwiseEvent* WheelCenteredEvent; // 0x618
	UWwiseEvent* FightingTurbulenceStartEvent; // 0x620
	UWwiseEvent* FightingTurbulenceStopEvent; // 0x628
	UWwiseEvent* SqueakyWheelEvent; // 0x630
	FName RTPCTurnRateName; // 0x638
	FName RTPCTurnAngleName; // 0x640
	FName WheelDamageRTPC; // 0x648
	bool DisableTurbulence; // 0x650
	FScriptMulticastDelegate OnWheelDamageStateChanged; // 0x658
	USceneComponent* RootSceneComponent; // 0x668
	UBoxComponent* PlayerCollisionComponent; // 0x670
	UShipDamageableComponent* WheelDamageComponent; // 0x678
	URepairableComponent* RepairableComponentWest; // 0x680
	URepairableComponent* RepairableComponentEast; // 0x688
	URepairableComponent* RepairableComponentSouth; // 0x690
	FVector ShipPartFireCellActorSpaceLocation; // 0x6e8
	float DamageSpeedMultiplierLevel1; // 0x718
	float DamageSpeedMultiplierLevel2; // 0x71c
	float DamageSpeedMultiplierLevel3; // 0x720
	UParticleSystem* WheelDamageParticleSystem; // 0x728
	float TurbulenceFactor; // 0x730
	float ServerWheelAngle; // 0x734
	float ServerWantedAngle; // 0x738
	float CenterJoltDuration; // 0x760
	float CenterJoltSlowDownFactor; // 0x764
	UDamageableShipPartAudioParams* WheelDamageLevelAudio; // 0x788
	float MaxWheelAngle; // 0x794
	float MinWheelAngle; // 0x798
	float SqueakAtAngle; // 0x79c
	EWheelDirection AllowedWheelDirection; // 0x7a0
	UNarratedShipDirectionComponent* NarratedShipDirectionComponent; // 0x7a8
};

struct AActorThatLogsErrorWhenTicked {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UTextureSwitchByGender {
	TArray<FTextureSwitchGenderEntry> Entries; // 0x220
};

struct UGameplayEffectExtension_ShieldTest {
	UGameplayEffect* ShieldRemoveGameplayEffect; // 0x48
};

struct UAddNPCOnShipStepDesc {
	UNPCOnShipDataAsset* NPCOnShipDataAsset; // 0x80
	FQuestVariableGuid NPCOnShipManager; // 0x88
};

struct UVotingInteractionComponent {
	UNotificationInputId* HoldInputId; // 0x120
	UNotificationInputId* ReleaseInputId; // 0x128
};

struct ALandscapeMeshProxyActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x3d0
};

struct UAggressiveGhostShipDifficultyDataAsset {
	FWeightedProbabilityRange NumShotsToDestroyShip; // 0x28
	float PersistentDamageScale; // 0x48
	TArray<FAggressiveGhostHealthToVfxLevel> HealthToVFxLevel; // 0x50
	FWeightedProbabilityRangeOfRanges Speed; // 0x60
	FWeightedProbabilityRangeOfRanges TimeBetweenShots; // 0x90
	FWeightedProbabilityRangeOfRanges WraithballCooldownTime; // 0xc0
	FWeightedProbabilityRangeOfRanges TimeBetweenCheckingIfAShipIsBehindYou; // 0xf0
	float MaxDistanceBehindShipToBeMineTargetInMetres; // 0x120
	float MaxMineTargetAngle; // 0x124
	float ChanceOfDroppingMines; // 0x128
	FWeightedProbabilityRange NumMinesToDrop; // 0x130
	FWeightedProbabilityRangeOfRanges MinTimeBetweenDroppingMoreMines; // 0x150
	bool CanAnchorDrop; // 0x180
	FWeightedProbabilityRangeOfRanges TimeBetweenAnchorDrops; // 0x188
	FWeightedProbabilityRangeOfRanges AnchorDropWarningTime; // 0x1b8
	float TimeBetweenPortalJumpChecks; // 0x1e8
	float MinDistanceFromAnyShipsToConsiderAPortalJumpInMetres; // 0x1ec
	float TimeToBeAwayFromAnyShipsToConsiderPortalJumping; // 0x1f0
	float ChanceOfPortalJumping; // 0x1f4
	FWeightedProbabilityRangeOfRanges PortalJumpDuration; // 0x1f8
	float PortalJumpCooldown; // 0x228
};

struct UMovieSceneAudioSection {
	USoundBase* Sound; // 0x98
	float StartOffset; // 0xa0
	float AudioStartTime; // 0xa4
	float AudioDilationFactor; // 0xa8
	float AudioVolume; // 0xac
	FRichCurve SoundVolume; // 0xb0
	FRichCurve PitchMultiplier; // 0x128
	bool bSuppressSubtitles; // 0x1a0
};

struct UNPCCustomAnimationDataAsset {
	FNPCCustomAnimationDataStructure NPCCustomAnimationData; // 0x30
};

struct ABaseMerchantCrateItemProxy {
	URewindComponent* RewindComponent; // 0x7b8
	TScriptInterface<Class> MountpointInterface; // 0x7c0
	UWwiseEvent* FullGroundImpactSfx; // 0x7d0
};

struct AStaticMerchantCrateItemProxy {
	URewindComponent* RewindComponent; // 0x7b8
	TScriptInterface<Class> MountpointInterface; // 0x7c0
	UWwiseEvent* FullGroundImpactSfx; // 0x7d0
};

struct UDeliverableRedirectionActionDataAsset {
	TArray<UDeliverableRedirectionContextHandlerBase*> Handlers; // 0x28
	FText RedirectionTooltip; // 0x38
	FText VisitSingleFemaleNPCTooltip; // 0x70
	FText VisitSingleMaleNPCTooltip; // 0xa8
	FText VisitSingleCompanyNPCTooltip; // 0xe0
	TArray<FSingleNPCCompanyRedirectionData> VisitSingleCompanyNPCTooltipOverride; // 0x118
	TArray<FMultipleNPCCompaniesRedirectionData> VisitMultipleNPCCompaniesTooltip; // 0x128
	FText GoToOutpostTooltip; // 0x138
};

struct AWaterEmissionVolume {
	UWaterEmissionVolumeComponent* WaterEmissionVolumeComponent; // 0x3d0
};

struct UEditableGameplayTagQueryExpression_AllExprMatch {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UPlayNpcAnimationResource {
	FName AnimationNameToPlay; // 0x28
	USceneDialogueData* DialogueData; // 0x30
	UMusicZoneComponent* LocalMusicZone; // 0x38
	TArray<FText> SpeakingActorLocalisableNames; // 0x40
};

struct UMysteriousNoteSettings {
	int32_t LookAheadInMinutes; // 0x28
	float RequestTimeout; // 0x2c
	FStringAssetReference MysteriousNotesCompletionStringsAsset; // 0x30
	FStringAssetReference WieldableNoteDataAsset; // 0x40
	FStringAssetReference Image; // 0x50
	FStringAssetReference NotificationBackground; // 0x60
};

struct USoundNodeSoundClass {
	USoundClass* SoundClassOverride; // 0x38
};

struct UWaitForMechanismActivationStep {
	UWaitForMechanismActivationStepDesc* Desc; // 0x90
};

struct UPlaySequencerAnimationOnCutsceneActorStepDesc {
	ULevelSequence* LevelSequence; // 0x80
	float Delay; // 0x88
	FQuestVariableActor DockableBaseActor; // 0x90
	FQuestVariableActor SequencerCutSceneActor; // 0xa0
	FQuestVariableActor ActorToPossess; // 0xb0
	FQuestVariableArray AdditionalPossessables; // 0xc0
	FQuestVariableActor InteractingActor; // 0xd0
	FString PossessableName; // 0xe0
	USceneDialogueData* DialogueData; // 0xf0
	TArray<FText> LocalisableNames; // 0xf8
	bool IsLevelSequenceActorAlwaysRelevant; // 0x108
	bool IsLooping; // 0x109
	float SubtitleSphereRadiusInCm; // 0x10c
	ULevelSequence* FemaleLevelSequence; // 0x110
};

struct USoundNodeEnveloper {
	float LoopStart; // 0x38
	float LoopEnd; // 0x3c
	float DurationAfterLoop; // 0x40
	int32_t LoopCount; // 0x44
	char bLoopIndefinitely : 1; // 0x48
	char bLoop : 1; // 0x48
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x50
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x58
	FRuntimeFloatCurve VolumeCurve; // 0x60
	FRuntimeFloatCurve PitchCurve; // 0xe0
	float PitchMin; // 0x160
	float PitchMax; // 0x164
	float VolumeMin; // 0x168
	float VolumeMax; // 0x16c
};

struct UQuestBookAnimationInstance {
	FObjectMessagingDispatcher MessagingDispatcher; // 0x450
	TArray<FInputSequencePair> OneShotAnimationSequence; // 0x4f0
	TArray<FInputSequencePair> OneShotAnimationAlternateSequence; // 0x500
	TArray<FInputMontagePair> ContinuousUseAnimationSequence; // 0x510
	TArray<FInputMontagePair> ContinuousUseAnimationAlternateSequence; // 0x520
	UAnimSequenceBase* EquipItemAnimationSequence; // 0x530
	UAnimSequenceBase* UnequipItemAnimationSequence; // 0x538
	bool OneShotIsAlternate; // 0x540
	bool ContinuousIsAlternate; // 0x541
	bool DisableBlending; // 0x542
	UAnimMontage* CurrentMontage; // 0x620
};

struct UImpactListDataAsset {
	int32_t MaxAudioEventsPerDischarge; // 0x28
	TArray<FImpactProjectileData> ProjectileList; // 0x30
};

struct UMechanismAnimationEvent_ContinuousAudio {
	UWwiseEvent* StartEvent; // 0x40
	UWwiseEvent* StopEvent; // 0x48
	float StartTime; // 0x50
	float StopTime; // 0x54
	TScriptInterface<Class> AudioEmitterInterface; // 0x58
};

struct UBTDecorator_TestRange {
	FAIDataProviderFloatValue EnterRange; // 0x80
	FAIDataProviderFloatValue ExitRange; // 0xb0
	bool TestForOutsideRange; // 0xe0
};

struct UMaterialExpressionLightVector {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UClearProgressSpawnStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct APlayerBuriedItemsMapBundleItemProxy {
	FRigidBodyErrorCorrection PhysicsErrorCorrection; // 0x630
	UBoxComponent* BaseComponent; // 0x650
	FNetTimeStampCalculator MovementTimeStamp; // 0x688
	AActor* TutorialOwner; // 0x6f8
	bool IsTutorialProxy; // 0x700
	FReplicatedPhysicsState ReplicatedPhysicsState; // 0x708
	bool ForceKeepTickActive; // 0x758
	ECollisionChannel CachedAutoAimCollisionChannel; // 0x788
	ECollisionResponse CachedVehicleCollisionResponse; // 0x789
};

struct UDistributionVectorUniformCurve {
	FInterpCurveTwoVectors ConstantCurve; // 0x38
	char bLockAxes1 : 1; // 0x50
	char bLockAxes2 : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x56
	char bUseExtremes : 1; // 0x5c
};

struct UBuoyancyComponent {
	FWaterBuoyancy BuoyancyParams; // 0xd0
	FBuoyancyComponentSinkingParams SinkingParams; // 0x200
	FBuoyancyComponentLockToSurfaceParams LockToSurfaceParams; // 0x234
	FBuoyancyComponentExclusionParams ExclusionParams; // 0x250
	bool DoClientSideSim; // 0x258
	UPrimitiveComponent* VisibleMesh; // 0x260
	float ChoppinessScalar; // 0x274
	EBuoyantObjectState State; // 0x278
};

struct UNPCDialogComponent {
	FText WelcomeMessage; // 0xd0
	UNPCDialogTreeData* Data; // 0x108
	UScriptStruct* DialogBlackboardSchema; // 0x110
	UNotificationInputId* InputID; // 0x118
	EActionDisplayPriority ActionDisplayPriority; // 0x120
	UWwiseObjectPoolWrapper* NpcDialoguePool; // 0x128
	UWwiseEvent* NpcDialogueWelcome; // 0x130
	UWwiseEvent* NpcDialogueBridge; // 0x138
	UWwiseEvent* NpcDialogueGoodbye; // 0x140
	bool CreateInteractionRules; // 0x148
	float DialogueInputFocusTimeout; // 0x14c
	FString TelemetryKey; // 0x150
	TArray<FMysteriousNotesCompletionEventsModelEntry> NoteCompletionIdents; // 0x160
	TArray<FPlayerStat> StatsToFireOnDialogStart; // 0x170
	TArray<UConditionalStatsTriggerType*> ConditionalStatsToFireOnDialogStart; // 0x180
	AController* InteractingController; // 0x298
	TArray<uint32_t> DialogOptionUsageCounter; // 0x2a0
	TArray<char> DialogBlackboard; // 0x2b0
	bool Disabled; // 0x2f4
	FGuid CurrentInteractionSessionId; // 0x2f8
};

struct UPersistenceIdentifierSettingsAsset {
	TArray<UPersistenceIdentifierMap*> PersistenceMapData; // 0x28
};

struct UBlendSpaceBase {
	FBlendParameter BlendParameters[0x3]; // 0x50
	FInterpolationParameter InterpolationParam[0x3]; // 0xb0
	float TargetWeightInterpolationSpeedPerSec; // 0xc8
	ENotifyTriggerMode NotifyTriggerMode; // 0xcc
	bool bRotationBlendInMeshSpace; // 0xcd
	int32_t NumOfDimension; // 0xd0
	float AnimLength; // 0xd4
	TArray<FPerBoneInterpolation> PerBoneBlend; // 0xd8
	TArray<FBlendSample> SampleData; // 0xe8
	TArray<FEditorElement> GridSamples; // 0xf8
};

struct UPhysicsConstraintTemplate {
	FName JointName; // 0x28
	FName ConstraintBone1; // 0x30
	FName ConstraintBone2; // 0x38
	FVector Pos1; // 0x40
	FVector PriAxis1; // 0x4c
	FVector SecAxis1; // 0x58
	FVector Pos2; // 0x64
	FVector PriAxis2; // 0x70
	FVector SecAxis2; // 0x7c
	char bEnableProjection : 1; // 0x88
	float ProjectionLinearTolerance; // 0x8c
	float ProjectionAngularTolerance; // 0x90
	ELinearConstraintMotion LinearXMotion; // 0x94
	ELinearConstraintMotion LinearYMotion; // 0x95
	ELinearConstraintMotion LinearZMotion; // 0x96
	float LinearLimitSize; // 0x98
	char bLinearLimitSoft : 1; // 0x9c
	float LinearLimitStiffness; // 0xa0
	float LinearLimitDamping; // 0xa4
	char bLinearBreakable : 1; // 0xa8
	float LinearBreakThreshold; // 0xac
	EAngularConstraintMotion AngularSwing1Motion; // 0xb0
	EAngularConstraintMotion AngularSwing2Motion; // 0xb1
	EAngularConstraintMotion AngularTwistMotion; // 0xb2
	char bSwingLimitSoft : 1; // 0xb4
	char bTwistLimitSoft : 1; // 0xb4
	float Swing1LimitAngle; // 0xb8
	float Swing2LimitAngle; // 0xbc
	float TwistLimitAngle; // 0xc0
	float SwingLimitStiffness; // 0xc4
	float SwingLimitDamping; // 0xc8
	float TwistLimitStiffness; // 0xcc
	float TwistLimitDamping; // 0xd0
	char bAngularBreakable : 1; // 0xd4
	float AngularBreakThreshold; // 0xd8
	FConstraintInstance DefaultInstance; // 0xe0
};

struct URareNetworkProfilerExporter {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int32_t PreferredFormatIndex; // 0x58
	int32_t TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
};

struct ULightWeightStatusEffectManagerComponent {
	UStatusRecipientResponseList* RecipientResponseList; // 0xe8
	TArray<FActiveStatusEffect> ActiveEffects; // 0xf0
};

struct UBTTask_RunBehaviorDynamic {
	FGameplayTag InjectionTag; // 0x60
	UBehaviorTree* DefaultBehaviorAsset; // 0x68
	UBehaviorTree* BehaviorAsset; // 0x70
};

struct USpawnActorAtPointStep {
	USpawnActorAtPointStepDesc* Desc; // 0x98
};

struct UIpNetDriver {
	char LogPortUnreach : 1; // 0x478
	char AllowPlayerPortUnreach : 1; // 0x478
	uint32_t MaxPortCountToTry; // 0x47c
};

struct UAIDioramaController {
	UAIDioramaDesc* AIDioramaDesc; // 0x30
	USceneDialogueData* DialogueData; // 0x38
	TArray<FAIDioramaPawn> SpawnedDioramaPawns; // 0x40
	AAIDiorama* AIDiorama; // 0x50
	UAISpawner* Spawner; // 0x58
};

struct UCapsuleComponent {
	float CapsuleHalfHeight; // 0x5a8
	float CapsuleRadius; // 0x5ac
};

struct UVoiceChatRenderer {
	UWwiseEvent* AttenuatedVoiceEvent; // 0x38
	UWwiseEvent* AttenuatedAndSpatialisedVoiceEvent; // 0x40
	UWwiseEvent* UnattenuatedVoiceEvent; // 0x48
	int32_t PreBufferInMilliseconds; // 0x50
	int32_t ChatRoutingListenerIndex; // 0x54
	float EmitterHoldInSeconds; // 0x58
};

struct UCommoditySourceComponent {
	FName NPCIdentifier; // 0xd0
};

struct UParticleModuleRotationOverLifetime {
	FRawDistributionFloat RotationOverLife; // 0x50
	char Scale : 1; // 0x88
};

struct UTaleRemoveStormAvoidanceAreaStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UObjectWithSettableWorld {
	UWorld* World; // 0x28
};

struct UPlayerWalletComponent {
	FWalletBalance LastKnownBalance; // 0xd0
};

struct UItemSnapshotMetaGenerator {
	UScriptStruct* MetaWrapper; // 0x28
};

struct USpawnItemStep {
	USpawnItemStepDesc* Desc; // 0x90
};

struct UMeshMemoryConstraintScoringPlayerDistance {
	float MaxDistanceSqr; // 0x40
};

struct USeatStat_SitOnSinkingShip {
	TWeakObjectPtr<AActor> WeakCurrentShip; // 0x48
};

struct AStorageCrateItemProxy {
	URetractableComponent* RetractableComponent; // 0x790
};

struct UTaleQuestChooseLandOrSeaStep {
	USeaClueSiteTypesDataAsset* SeaClueSiteTypes; // 0xa8
};

struct AOnlineAthenaGameMode {
	APawn* GhostShipPawnClass; // 0x4e0
	UNetworkedEventsWhitelistDefinition* ServerNetworkedEventsWhitelistDefinition; // 0x4e8
	FGhostShipCoordinator GhostShipCoordinator; // 0x688
	FStorageContainerRefresher StorageContainerRefresher; // 0x8b8
	URiddleQuestDescGeneratorData* RiddleQuestDescGeneratorData; // 0x990
	float RespawnTimer; // 0x998
	float ContestRespawnTimer; // 0x99c
	float StorageContainerRefreshInterval; // 0x9a0
	int32_t ContainerRefreshBatchSize; // 0x9a4
};

struct UNotInActionStateRadialContext {
	TArray<UActionStateId*> TargetActionStates; // 0x28
};

struct UWaterSpoutVFXComponent {
	TArray<FWaterSpout> WaterSpouts; // 0xc8
	FVector SplashEffectPointBottomZ; // 0xd8
	UObject* SpoutParticleSystem; // 0xe8
	UObject* SplashParticleSystem; // 0xf0
	float WaterSplashDelayMin; // 0xf8
	float WaterSplashDelayMax; // 0xfc
	float SplashEffectVFXOffset; // 0x100
	float SplashSweepRadius; // 0x104
	bool ShouldSpawnKillPlaneAtSplash; // 0x108
	UStaticMesh* SplashKillPlaneMesh; // 0x110
	FVector SplashKillPlaneScale; // 0x118
	UStaticMeshComponent* SplashKillPlane; // 0x128
	TArray<FWaterSpout> ActiveWaterSpouts; // 0x130
};

struct UActionStatePriorityTableData {
	TArray<FActionStatePriorityRelationship> StateDefaultValue; // 0x28
	TArray<FActionStatePriorityList> PriorityTableEntry; // 0x38
};

struct UPlatformInterfaceWebResponse {
	FString OriginalURL; // 0x28
	int32_t ResponseCode; // 0x38
	int32_t Tag; // 0x3c
	FString StringResponse; // 0x40
	TArray<char> BinaryResponse; // 0x50
};

struct UBlendedLightingZoneComponent {
	UCurveFloat* FadeCurveNormalised; // 0x2d8
	UCurveFloat* FadeOutCurveNormalised; // 0x2e0
};

struct UPickupablePlayerBuriedItemMapComponent {
	float PickupTime; // 0xd0
	FText PickupActionDisplayString; // 0xd8
	FText PickupActionDisplayStringWhenFull; // 0x110
	UNotificationInputId* StartPickupInputId; // 0x148
};

struct UBTService_BlueprintBase {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	char bShowPropertyDetails : 1; // 0x90
	char bShowEventDetails : 1; // 0x90
};

struct UBTDecorator_RandomDiceRoll {
	FAIDataProviderFloatValue Chance; // 0x68
};

struct UBTTask_CopyBlackboardVector {
	FBlackboardKeySelector SrcBlackboardKey; // 0x60
	FBlackboardKeySelector TargetBlackboardKey; // 0x88
};

struct UInputAxisKeyDelegateBinding {
	TArray<FBlueprintInputAxisKeyDelegateBinding> InputAxisKeyDelegateBindings; // 0x28
};

struct UCargoRunMapData {
	TArray<UCompany*> Companies; // 0x28
	UCargoRunMapLayout* Layout; // 0x38
};

struct AGhostShipDoor {
	FScriptMulticastDelegate OnDoorOpenedDelegate; // 0x3d8
	TArray<FOpenForListEntry> OpenForList; // 0x3e8
	float DoorFullyOpenTimer; // 0x3f8
	UClientSkeletalMeshComponent* DoorMesh; // 0x400
	TArray<UMaterialInstanceDynamic*> DynamicMaterialInstances; // 0x408
	UAnimSequence* DoorOpeningAnimation; // 0x418
	UWwiseEvent* DoorOpeningSfx; // 0x420
	FBox DoorBoundingVolume; // 0x428
	FVector MaxBoundingVolume; // 0x444
	float DoorDeformationWhenFullyOpen; // 0x450
	bool BlockPlayerLeftGhostshipDelegate; // 0x454
};

struct UWaterHeightProviderComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UTwitterIntegrationBase {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UWieldedItemComponent {
	UWieldableItemSetComponent* WieldableItemSetComponent; // 0x2b0
	AActor* ReplicatedCurrentlyWieldedItem; // 0x2b8
	AActor* CurrentlyWieldedItem; // 0x2c0
	int32_t EpochId; // 0x3a8
	FServerWieldSet PendingServerWieldSet; // 0x3b8
};

struct UHarbourComponent {
	float HarbourRadiusInCentimetres; // 0x2b8
};

struct ABurrowEruptArea {
	EBurrowEruptState BurrowState; // 0x3d0
	UExplosionComponent* ExplosionComponent; // 0x3d8
};

struct UMerchantQuestRequiredItemsDataAsset {
	TArray<FMerchantQuestRequiredItemsRankEntry> RankEntries; // 0x28
};

struct UContestMapLayout {
	FTreasureMapWidgetText CompanyName; // 0x28
	FTreasureMapWidgetText VoyageName; // 0x48
	FTreasureMapWidgetText ScoreboardTitle; // 0x68
	FTreasureMapWidgetText ScoreId; // 0x88
	TArray<FContestMapLayoutCrew> Crews; // 0xa8
	TArray<FContestMapLayoutScoreInfo> ScoreInfo; // 0xb8
	bool AutogenerateScoreboard; // 0xc8
	float ScoreboardTopOffset; // 0xcc
	float IconLeftOffset; // 0xd0
	float IconWidth; // 0xd4
	float NameLeftOffset; // 0xd8
	float NameScale; // 0xdc
	float ScoreLeftOffset; // 0xe0
	float ScoreScale; // 0xe4
	float ScoreboardSpacing; // 0xe8
	float UnderlineVerticalOffset; // 0xec
	float UnderlineScale; // 0xf0
	float ScoreReasonScale; // 0xf4
	float ScoreReasonTopOffset; // 0xf8
	float ScoreReasonLineStart; // 0xfc
	float ScoreReasonLineEnd; // 0x100
	float ScoreReasonTextRelativeTopOffset; // 0x104
	float ScoreReasonTextScale; // 0x108
};

struct UAggressiveGhostShipAnimationDataAsset {
	FRuntimeVectorCurve LocationCurve; // 0x28
	FRuntimeVectorCurve RotationCurve; // 0x198
	FRuntimeFloatCurve VelocityCurve; // 0x308
};

struct UActionStateMachineComponent {
	FScriptMulticastDelegate OnActionChangedOnTrack; // 0xe0
};

struct AVomitProjectile {
	bool CallParentFunctionalityOnImpactEffects; // 0x728
};

struct UFireGridCellSelectionParamsDataAsset {
	TArray<FFireGridCellSelectionParams> FireGridCellSelectionParams; // 0x28
};

struct UAnimNotifyState_HideMeshByBoneForDuration {
	FName BoneName; // 0x28
};

struct UVoteOnVoyageVotableComponent {
	float HoldToWithdrawVoyageTime; // 0x340
	UNotificationInputId* WithdrawActionInputId; // 0x348
	UNotificationInputId* WithdrawActionReleasedInputId; // 0x350
};

struct UMovieScene3DConstraintTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x88
};

struct UJwtAuthenticationTokenEditorSettings {
	FString TokenSecretKey; // 0x28
};

struct UMaterialExpressionReflectionVectorWS {
	FExpressionInput CustomWorldNormal; // 0x70
	char bNormalizeCustomWorldNormal : 1; // 0xa8
};

struct UNPCDialogOptionFireTutorialDialogOptionSelectedEvent {
	ETutorialDialogOption TutorialDialogOption; // 0x80
	FText Text; // 0x88
	bool CloseOnExectuted; // 0xc0
	int32_t LinkedDialog; // 0xc4
	bool RelevantOnServer; // 0xc8
};

struct ASeagulls {
	TArray<UMaterialInstanceDynamic*> DynamicMaterials; // 0x3e0
	float LifetimerTimer; // 0x3f0
	float FadeTimer; // 0x3f4
	FScriptMulticastDelegate TriggerFadeIn; // 0x3f8
	FScriptMulticastDelegate TriggerFadeOut; // 0x408
	TArray<TWeakObjectPtr<AActor>> CachedActors; // 0x418
};

struct UAthenaCharacterBaseInputComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct ULandscapeInfo {
	ALandscape* LandscapeActor; // 0x28
	FGuid LandscapeGuid; // 0x44
	int32_t ComponentSizeQuads; // 0x54
	int32_t SubsectionSizeQuads; // 0x58
	int32_t ComponentNumSubsections; // 0x5c
	FVector DrawScale; // 0x60
};

struct UVaultKeyMappingDataAsset {
	TArray<FVaultKeyMapping> KeyMappings; // 0x28
};

struct UCustomStatusesService {
	UWorld* World; // 0x30
};

struct UAIShipBattlesDataAsset {
	TArray<FAIShipBattleParams> Battles; // 0x28
	TArray<FText> SkellyCrewNames; // 0x38
	FText EncounterCompleteText; // 0x48
};

struct UAnimCompress_RemoveEverySecondKey {
	int32_t MinKeys; // 0x40
	char bStartAtSecondKey : 1; // 0x44
};

struct URadialManagerInputComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct AMessageInABottleItemProxy {
	TArray<FMessageInABottleVoyageEntry> VoyageRecipeList; // 0x798
	bool UsePremadeVoyages; // 0x7a8
	TArray<UVoyageDescDataAsset*> PremadeVoyages; // 0x7b0
	EEmergentVoyageSource EmergentSource; // 0x7c0
	UWwiseEvent* OnBottleOpenedSfx; // 0x7c8
};

struct UAITask {
	AAIController* OwnerController; // 0x58
};

struct USuperheatedWaterSetupDataAsset {
	float TimeBetweenHealthReduction; // 0x28
	float MinimumWaterDepthToCauseDamage; // 0x2c
	FWeightedProbabilityRangeOfRanges TimeBetweenLargeSurfaceEffects; // 0x30
	float LargeSurfaceEffectMinimumDistanceInMetres; // 0x60
	FRandomParticleSystemPicker LargeSurfaceEffects; // 0x68
	float EffectSpawnHeight; // 0x78
	float MurkStrengthToStartEffects; // 0x7c
	FWeightedProbabilityRangeOfRanges TimeBetweenSmallSurfaceEffects; // 0x80
	FWeightedProbabilityRange NumSmallSurfaceEffects; // 0xb0
	FDistanceThrottledRandomParticleSystemPicker SmallSurfaceEffects; // 0xd0
	float SmallSurfaceEffectNearbyPlayerRadiusInMetres; // 0xe0
	float SmallSurfaceEffectOffsetRadiusInMetres; // 0xe4
};

struct UShipHullDamageDataAsset {
	FShipHullDamageParams DamageParams; // 0x28
};

struct USpawnActorComponent {
	AActor* ChildActorClass; // 0x2b0
	AActor* ChildActor; // 0x2b8
};

struct UInstancedRopeComponent {
	UStaticMesh* StaticMesh; // 0x588
	TArray<FInstancedRopeParams> Ropes; // 0x590
	int32_t ShadowLOD; // 0x5a0
};

struct UMaterialExpressionActorPositionWS {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UTaleQuestAddRiddleMapUsingVariableStepDesc {
	FQuestVariableTextArray TextVariable; // 0x98
};

struct UAbandonedNoteWieldableRenderingComponent {
	int32_t CanvasWidth; // 0xc8
	int32_t CanvasHeight; // 0xcc
	UFont* BodyTextFont; // 0xd0
	UFont* TitleTextFont; // 0xd8
	float FontLineSpacing; // 0xe0
	float FontScale; // 0xe4
	FTreasureMapWidgetText BodyTextLayout; // 0xe8
	FTreasureMapWidgetText TitleTextLayout; // 0x108
	TArray<FTextEntryWithLayout> ExtraTextFields; // 0x128
	TScriptInterface<Class> WieldableRenderingInterface; // 0x138
};

struct UMeleeAttackDataAsset {
	FName AttackName; // 0x28
	float WarmUpDuration; // 0x30
	float StrikeDuration; // 0x34
	float RecoverMissDuration; // 0x38
	float RecoverHitDuration; // 0x3c
	float LungeMoveStartTime; // 0x40
	float LungeMoveDuration; // 0x44
	float LungeMoveMaxSpeed; // 0x48
	EMeleeWeaponMovementSpeed AttackMoveSpeed; // 0x4c
	float AttackMoveSpeedDeactivationAllowedWindow; // 0x50
	float ComboTime; // 0x54
	bool DefenderKnockbackEnabled; // 0x58
	FKnockBackInfo DefenderKnockback; // 0x5c
	bool DefenderKnockbackWhenBlockingEnabled; // 0xac
	FKnockBackInfo DefenderKnockbackWhenBlocking; // 0xb0
	bool AttackerKnockbackEnabled; // 0x100
	FKnockBackInfo AttackerKnockback; // 0x104
	bool AttackerKnockbackWhenBlockingEnabled; // 0x154
	FKnockBackInfo AttackerKnockbackWhenBlocking; // 0x158
	bool LockOnEnabled; // 0x1a8
	FAttackTimingWindow UninterruptableWindow; // 0x1ac
	float HitStartRange; // 0x1b4
	float HitEndRange; // 0x1b8
	float HitStartAngle; // 0x1bc
	float HitAngleDelta; // 0x1c0
	float HitSphereRadius; // 0x1c4
	float HitTimeOffset; // 0x1c8
	float HitDuration; // 0x1cc
	float AttackDamage; // 0x1d0
	UDamagerType* DamagerType; // 0x1d8
	EHealthChangedReason HealthChangeReason; // 0x1e0
	bool IsUnblockable; // 0x1e1
	bool StunOnMiss; // 0x1e2
	TArray<FStunAttackerOnHitSurfacePair> StunAttackerOnHitSurfaces; // 0x1e8
	bool StunOnHit; // 0x1f8
	float StunOnHitDurationPlayer; // 0x1fc
	float StunOnHitDurationCharacter; // 0x200
	EWieldableItemComplexOneShotLookUpType AnimationLookupType; // 0x204
	uint32_t AnimationLookupIndex; // 0x208
	EWieldableItemComplexOneShotAnimType AnimationType; // 0x20c
	UImpactProjectileId* ImpactId; // 0x210
	UCameraShake* AttackerHitLandedCameraShake; // 0x218
	UForceFeedbackEffect* AttackerHitLandedForceFeedbackEffect; // 0x220
	UCameraShake* DefenderHitReceivedCameraShake; // 0x228
	UForceFeedbackEffect* DefenderHitReceivedForceFeedbackEffect; // 0x230
	float ClampYawRange; // 0x238
	float ClampYawRate; // 0x23c
};

struct UTaleQuestLanternServiceDesc {
	UItemDesc* LanternDesc; // 0x30
};

struct UWidget {
	bool bIsVariable; // 0x28
	bool bCreatedByConstructionScript; // 0x29
	UPanelSlot* Slot; // 0x30
	bool bIsEnabled; // 0x38
	DelegateProperty bIsEnabledDelegate; // 0x3c
	FText ToolTipText; // 0x50
	DelegateProperty ToolTipTextDelegate; // 0x88
	UWidget* ToolTipWidget; // 0x98
	DelegateProperty ToolTipWidgetDelegate; // 0xa0
	ESlateVisibility Visiblity; // 0xb0
	ESlateVisibility Visibility; // 0xb1
	DelegateProperty VisibilityDelegate; // 0xb4
	char bOverride_Cursor : 1; // 0xc4
	EMouseCursor Cursor; // 0xc8
	bool bIsVolatile; // 0xc9
	FWidgetTransform RenderTransform; // 0xcc
	FVector2D RenderTransformPivot; // 0xe8
	UWidgetNavigation* Navigation; // 0xf0
	TArray<UPropertyBinding*> NativeBindings; // 0x128
};

struct UGameplayModMagnitudeCalculation {
	TArray<FGameplayEffectAttributeCaptureDefinition> RelevantAttributesToCapture; // 0x28
};

struct UMovieSceneAkAudioRTPCTrack {
	TArray<UMovieSceneSection*> Sections; // 0x88
	char bIsAMasterTrack : 1; // 0x98
};

struct ATreasureChest {
	UPrimitiveComponent* FirstPersonMesh; // 0x428
	UPrimitiveComponent* ThirdPersonMesh; // 0x430
	UActionRulesComponent* ActionRulesComponent; // 0x438
	UWieldableItemAnimationStoreId* AnimationKey; // 0x440
	FObjectMessagingDispatcher MessagingDispatcher; // 0x448
	FTransform AnimationOffset; // 0x4f0
	UWwiseEvent* EquipSfx; // 0x520
	UWwiseEvent* UnequipSfx; // 0x528
	UWwiseEvent* WielderLandedJumpSfx; // 0x530
	UWwiseEvent* WielderFootstepLayerOneshot; // 0x538
	FName PlayerWalkSpeedRtpc; // 0x540
	UWwiseEvent* FirstTimeEquipSfx; // 0x548
	bool ForceUnequipSfx; // 0x550
	EWieldableItemSize ItemSize; // 0x551
	FDetailAppearenceDesc DetailAppearence; // 0x558
	bool PropagateVisibilityToChildren; // 0x588
	FName AINoiseTag; // 0x58c
	TArray<FName> ThirdPersonExtraMeshNames; // 0x598
	TArray<FName> StashedExtraMeshNames; // 0x5a8
	UMeshComponent* StashedMeshComponent; // 0x5b8
	FName StashedMeshAttachSocket; // 0x5c0
	FName ServerWieldAttachSocket; // 0x5c8
	UPhrasesRadialDataAsset* Phrases; // 0x5d0
	UObject* CachedFirstPersonProxyMesh; // 0x5d8
	UObject* CachedThirdPersonProxyMesh; // 0x5e0
	UItemCategory* ItemCategory; // 0x710
	AItemInfo* ItemInfo; // 0x718
	AInterpolatingItem* InterpolatingItem; // 0x720
	TWeakObjectPtr<AActor> LastKnownWielder; // 0x740
	UWieldableItemVfxComponent* WieldableItemVfxComponent; // 0x748
	TArray<UMeshComponent*> ThirdPersonExtraMeshes; // 0x750
	TArray<UMeshComponent*> StashedExtraMeshes; // 0x760
	bool OfferingEnabled; // 0x789
};

struct UTimedFlammableComponent {
	bool UseExtinguishTimer; // 0xe0
	bool AllowFireToBeReplenishedBeforeExtinguishTimerExpired; // 0xe1
	float TimeInSecondsUntilFireExtinguished; // 0xe4
};

struct USeasonPassEntitlementDesc {
	FText Title; // 0x28
	FText Description; // 0x60
	FStringAssetReference IconPath; // 0x98
	FStringAssetReference IconInvPath; // 0xa8
	FStringAssetReference IconPrvPath; // 0xb8
	UCategoryBase* Category; // 0xc8
	UCompany* Company; // 0xd0
};

struct UAshenWindsFlamethrowerController {
	FFlamethrowerCollisionsParams FlamethrowerCollisionParams; // 0x30
	UFireGridCellSelectionParamsDataAsset* FlamethrowerFirePropagationIgnitionParams; // 0x98
	FStatus FlamethrowerCollisionStatusEffect; // 0xa0
	float TimeUntilApplyStatusEffect; // 0xb8
	float TimeUntilIgniteFirePropagation; // 0xbc
	float TimeToConsiderActorOutsideFlame; // 0xc0
	float FlamethrowerCollisionDamageAmount; // 0xc4
	float DamagePerSecondInsideFlame; // 0xc8
	AAshenWindsSkull* AshenWindsSkull; // 0xd0
	TMap<AActor*, FActorInsideFlameInformation> ActorsInsideFlame; // 0xd8
};

struct APhysicsThruster {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x3d0
};

struct UPlayerWorldLocationComponent {
	FName CurrentWorldLocation; // 0xc8
};

struct UQuestBookPageBundle {
	TArray<FStringAssetReference> Pages; // 0x28
};

struct UAdjustableWaterLevelPuzzleAudioParams {
	UWwiseObjectPoolWrapper* WaterLevelPuzzlePool; // 0x28
	UWwiseEvent* PuzzleWaterRiseStartEvent; // 0x30
	UWwiseEvent* PuzzleWaterRiseEndEvent; // 0x38
	UWwiseEvent* PuzzleWaterFallStartEvent; // 0x40
	UWwiseEvent* PuzzleWaterFallEndEvent; // 0x48
};

struct UInterpolatingMountpointComponent {
	float InterpolateSpeed; // 0x320
	float MaximumDistance; // 0x324
	FVector RelativeSnapLocation; // 0x328
	float RelativeYawToUseExtraTransform; // 0x334
	float RelativeYawRangeToUseExtraTransform; // 0x338
	FVector ExtraTranslation; // 0x33c
	FRotator ExtraRotation; // 0x348
	bool UseExtraTransform; // 0x354
};

struct UInterpTrackFloatParticleParam {
	FName ParamName; // 0x90
};

struct ABaseToggleAnimatedMechanismAction {
	USceneComponent* Root; // 0x528
	USceneComponent* Pivot; // 0x530
	UWwiseObjectPoolWrapper* AudioEmitterPool; // 0x538
	TArray<FMechanismAnimationEventContainer> AnimationEvents; // 0x550
};

struct UStatConditionTrackedShipTargetSelector {
	EStatConditionTarget Target; // 0x28
};

struct ULocationOnIslandClueDestinationDescriptor {
	FName IslandIdentifier; // 0x40
	FVector WorldPosition; // 0x48
};

struct UAsyncTaskDownloadImage {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFail; // 0x38
};

struct UEmissaryLevelSettingsAsset {
	TArray<FEmissaryLevelEntry> EmissaryLevelData; // 0x28
	FEmissaryPointBoostMultipliers BoostMultiplers; // 0x38
	FEmissaryFlagMeshReferences DefaultEmissaryFlagAssetReferences; // 0x40
	uint32_t NumberOfCustomisedShipPartsToGainBoost; // 0x60
};

struct UTutorial2019ContextualDelegatingComponent {
	UContextualTutorialComponent* ContextualTutorialComponent; // 0xd0
};

struct UBlackboardKeyType_Object {
	UObject* BaseClass; // 0x30
};

struct UBTTask_SailShipCircleTarget {
	FBlackboardKeySelector BlackboardKey; // 0x60
};

struct UParticleModuleEventGenerator {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x50
};

struct UEffectBlendControllerComponent {
	FVisualFeedbackList Effects; // 0xc8
};

struct UShroudBreakerComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UDebugTaleAddInstancedLevelStep {
	UDebugTaleAddInstancedLevelStepDesc* StepDesc; // 0x98
	FString InstancedLevelPath; // 0xa0
};

struct UTaleQuestAddXMarksMapStepDesc {
	FName MapId; // 0x80
	FQuestVariableName IslandName; // 0x88
	FQuestVariableVector Location; // 0x98
};

struct UParticleModuleAlignRotationToVelocity {
	FRawDistributionFloat AdditionalAngle; // 0x50
};

struct UMaterialExpressionObjectPositionWS {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct URetractorComponent {
	TScriptInterface<Class> AttachedRetractable; // 0xd0
	USceneComponent* RetractDestinationComponent; // 0x110
	USceneComponent* RetractingComponent; // 0x118
};

struct AAdjustableWaterLevelPuzzle {
	USceneComponent* RootComp; // 0x3d8
	UChildActorComponent* WaterVolumeComponent; // 0x3e0
	AVariableFillRateWaterVolume* WaterVolumeActor; // 0x3e8
	TArray<FWaterPuzzleWaterLevel> WaterLevels; // 0x3f0
	int32_t DefaultWaterLevelIndex; // 0x400
	UCurveFloat* FillCurve; // 0x408
	UCurveFloat* DrainCurve; // 0x410
	UCurveFloat* ResetCurve; // 0x418
	float PuzzleResetTimeout; // 0x420
	FWaterPuzzleRepData ReppedData; // 0x424
};

struct UInteractableMock {
	AActor* ActorThatInteracted; // 0x38
};

struct UTaleQuestSequenceStep {
	UTaleQuestSequenceStepDesc* Desc; // 0xd0
	UTaleQuestStep* CurrentStep; // 0xd8
	TArray<FForkedStep> ForkedSteps; // 0xe8
};

struct UParticleModuleColor_Seeded {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x308
};

struct UMerchantQuestDescData {
	TArray<UItemDesc*> AllMerchantCrates; // 0x28
	TArray<UItemDesc*> AllMerchantCargo; // 0x38
	TArray<UClass*> AllFauna; // 0x48
	TArray<UMerchantMapLayout*> MerchantMapLayouts; // 0x58
	FText DeliverByTimeTextFormat; // 0x68
	TArray<FText> DeliverByTimeHourFormat; // 0xa0
	TArray<FText> DeliverByTimeDayFormat; // 0xb0
	UPopUpMessageDesc* CollectCratesFromTraderPopupDesc; // 0xc0
	UCompany* MerchantCompany; // 0xc8
};

struct UBeachNPCSpawnFlowStarter {
	AAthenaPlayerController* AthenaPlayerController; // 0x28
	bool ShouldPlayIntroAnimatic; // 0x30
	bool ShouldDisableAllIntroBehaviour; // 0x31
	FFirstPersonAnimaticSettings IntroAnimationSettings; // 0x34
};

struct AModifyPlayerMovementOverlapActor {
	UStaticMeshComponent* MeshOverlapVolume; // 0x3d8
	UBoxComponent* BoxOverlapVolume; // 0x3e0
	EOverlapShapeType OverlapToUse; // 0x3e8
	float MaxSpeedScalar; // 0x3ec
	bool DisableSprint; // 0x3f0
	bool DisableJump; // 0x3f1
	USceneComponent* Root; // 0x3f8
	UPrimitiveComponent* OverlapVolume; // 0x400
};

struct URotatingAudioSourceComponent {
	UWwiseObjectPoolWrapper* RotatingObjectPool; // 0x110
	UWwiseEvent* PlayWwiseEvent; // 0x118
	UWwiseEvent* StopWwiseEvent; // 0x120
	FName PitchRtpcName; // 0x128
	FName RollRtpcName; // 0x130
	FName YawRtpcName; // 0x138
	float RtpcMax; // 0x140
};

struct ATestBeaconClient {
	AOnlineBeaconHostObject* BeaconOwner; // 0x3f8
	UNetConnection* BeaconConnection; // 0x400
	EBeaconConnectionState ConnectionState; // 0x408
};

struct UBTNode {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct AGeneratedMeshAreaLight {
	USpotLightComponent* SpotLightComponent; // 0x3e0
};

struct UDistributionVectorConstantCurve {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct UCharacterFootImpactComponent {
	TArray<FCharacterSocketCollisionDesc> SocketCollisionDesc; // 0xd0
	float SocketOffsetTolerance; // 0xe0
	float CapsuleOffsetTolerance; // 0xe4
};

struct UNavigationGraphNodeComponent {
	FNavGraphNode Node; // 0x2b0
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x2c8
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x2d0
};

struct UTransientActorService {
	UWorld* World; // 0x30
	TArray<DelegateProperty> TransientActorDestroyedCallbacks; // 0x50
	TArray<FTransientActorEntry> Entries; // 0x78
};

struct UCoherentUIGTSettings {
	bool EnableLiveReload; // 0x28
	int32_t InspectorPort; // 0x2c
	int32_t WebdriverPort; // 0x30
	bool EnableWebSecurity; // 0x34
	bool EnableLocalization; // 0x35
	bool RunAsynchronous; // 0x36
	bool bRecursivelyBindUStructs; // 0x37
	bool LoadSystemFonts; // 0x38
	bool AllowPerformanceWarningsInEditor; // 0x39
	bool ShowWarningsOnScreen; // 0x3a
	ECoherentUIGTSettingsSeverity LogSeverity; // 0x3b
	bool bPaintToBackBuffer; // 0x3c
	bool bRespectTitleSafeZone; // 0x3d
	bool bRespectLetterboxing; // 0x3e
	FString HUDMaterialName; // 0x40
	FString CoUIResourcesRoot; // 0x50
	bool TickWhileGameIsPaused; // 0x60
	ECoherentUIGTMSAA MSAA; // 0x61
};

struct UNPCHintDialogueClueCreator {
	UExistingToPhasedNPCIndexAssetMap* NPCMappingAsset; // 0x30
	int32_t LootItemSpawnXYDistanceFromClueIncrementMin; // 0x38
	int32_t LootItemSpawnXYDistanceFromClueIncrementMax; // 0x3c
	int32_t LootItemSpawnZOffset; // 0x40
};

struct UInteractiveFoliageComponent {
	int32_t ForcedLodModel; // 0x598
	bool bOverrideMinLOD; // 0x59c
	bool bOverrideNavigationToDefaultObstacle; // 0x59d
	int32_t MinLOD; // 0x5a0
	UStaticMesh* StaticMesh; // 0x5a8
	bool bOverrideWireframeColor; // 0x5b0
	FColor WireframeColorOverride; // 0x5b4
	char bIgnoreInstanceForTextureStreaming : 1; // 0x5b8
	char bOverrideLightMapRes : 1; // 0x5b8
	int32_t OverriddenLightMapRes; // 0x5bc
	float StreamingDistanceMultiplier; // 0x5c0
	TArray<FGuid> IrrelevantLights; // 0x5c8
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x5d8
	UMaterialInterface* CustomDepthMaterial; // 0x5e8
};

struct AHullDamage {
	USceneComponent* Root; // 0x3e8
	UMobileInstancedStaticMeshComponent* RepairPlanksMesh; // 0x3f0
	UShipDamageableComponent* ShipDamageComponent; // 0x3f8
	int32_t DamageZoneTickInterval; // 0x400
	AShipInternalWater* InternalWater; // 0x408
	TArray<ADamageZone*> DamageZones; // 0x410
	TArray<ADamageZone*> ActiveHullDamageZones; // 0x420
	TArray<ADamageZone*> BottomDeckDamageZones; // 0x430
	TArray<ADamageZone*> MiddleDeckDamageZones; // 0x440
	FWeightedProbabilityRange DamageZoneDeckDistribution; // 0x450
	UPersistenceIdentifierSettingsAsset* PersistenceIdentifierSettingsAsset; // 0x470
	TArray<URepairableComponent*> RepairablePoints; // 0x548
};

struct UTransientActorTaleService {
	TArray<AActor*> TrackedActors; // 0x80
	TArray<FTransientActorEntry> MigrationEntries; // 0x90
};

struct UPlayerStatsComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UContestWaitForItemHandInStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UGameplayTagsManager {
	TArray<UDataTable*> GameplayTagTables; // 0x140
};

struct UNPCLoadedOnClientService {
	TArray<FNPCData> AllNPCData; // 0x30
};

struct UAnimSingleNodeInstance {
	UAnimationAsset* CurrentAsset; // 0x440
	UVertexAnimation* CurrentVertexAnim; // 0x448
	FVector BlendSpaceInput; // 0x450
	TArray<FBlendSampleData> BlendSampleData; // 0x460
	FBlendFilter BlendFilter; // 0x470
	float CurrentTime; // 0x500
	float PlayRate; // 0x504
	DelegateProperty PostEvaluateAnimEvent; // 0x508
	char bLooping : 1; // 0x518
	char bPlaying : 1; // 0x518
	char bReverse : 1; // 0x518
};

struct UBoxReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x340
	UBoxComponent* PreviewInfluenceBox; // 0x348
	UBoxComponent* PreviewCaptureBox; // 0x350
};

struct AAthenaSwimmingAIController {
	USwimmingPathFollowingComponent* SwimmingPathFollowingComponent; // 0x8f8
	bool IgnoreTargetsOutOfWater; // 0x900
	UCurveFloat* DistOfAttackerVsChanceToPursue; // 0x908
	TArray<FName> TimersToZeroIfStartingRevengeAttack; // 0x910
	FName DespawnRequiredBlackboardKey; // 0x920
	FName DespawnRequiredReasonBlackboardKey; // 0x928
	float PathingFailedWeight; // 0x930
	float PathingFailedThresholdToDespawn; // 0x934
};

struct UPetPreviewDataObject {
	TWeakObjectPtr<UPetEntitlementBaseDesc> RootItemDesc; // 0x1b8
	UPetEntitlementDesc* CurrentPetDesc; // 0x1c0
};

struct AMockControllerWithSubjectInterface {
	APawn* Pawn; // 0x3d8
	ACharacter* Character; // 0x3e8
	APlayerState* PlayerState; // 0x3f0
	USceneComponent* TransformComponent; // 0x3f8
	FRotator ControlRotation; // 0x400
	char bAttachToPawn : 1; // 0x40c
	FName StateName; // 0x418
	FScriptMulticastDelegate OnInstigatedAnyDamage; // 0x420
};

struct UArmoryChestViewModelComponent {
	TArray<UWeaponItemCategory*> Categories; // 0x180
	bool IncludeAllCategory; // 0x190
};

struct UDioramaDebugMenuEntries {
	TArray<FDioramaDebugMenuEntry> Dioramas; // 0x28
};

struct UStandardHullDragDynamicsDesc {
	UCurveFloat* WaterDragScalarIfAllSailsUp; // 0x28
	UCurveFloat* WaterDragScalarIfInReef; // 0x30
	FStandardHullDragDynamicsParameters Parameters; // 0x38
};

struct UParticleModuleParametersOverVelocity {
	float MinSpeed; // 0x68
	float MaxSpeed; // 0x6c
	FVector VelocityComponentsWeights; // 0x70
	FRawDistributionFloat SpawnRateOverSpeedScale; // 0x80
	FRawDistributionFloat LifetimeOverSpeedScale; // 0xb8
	FRawDistributionFloat SizeOverSpeedScale; // 0xf0
	FRawDistributionFloat InitialVelocityOverSpeedScale; // 0x128
	FRawDistributionFloat OpacityOverSpeedScale; // 0x160
};

struct ATreasureMap {
	UWieldableItemCanvasRenderingComponent* WieldableCanvasRenderingComponent; // 0x7a0
	UInventoryItemComponent* InventoryItem; // 0x7a8
	UNamedNotificationInputComponent* NamedNotificationInputComponent; // 0x7b0
	UUsableWieldableComponent* UsableWieldableComponent; // 0x7b8
	EQuestMapIcon QuestMapIcon; // 0x7d2
};

struct UControllableIntentComponent {
	char AckToken; // 0xd8
	bool RequiresHandshake; // 0xd9
	float ServerIntent; // 0xdc
	float LocalIntent; // 0xe0
};

struct UTestWindZoneComponent {
	FWindTurbulenceParameters TurbulenceParams; // 0x2b8
	FWindZoneParams WindZoneParams; // 0x328
};

struct URiddleTextPhraseDataAsset {
	TArray<FText> Variants; // 0x28
};

struct UMaterialExpressionLogarithm2 {
	FExpressionInput X; // 0x70
};

struct AConstellationsService {
	float ViewBoundaryDegrees; // 0x3d8
	FStringAssetReference ConstellationsBespokeAudioEventsAssetRef; // 0x428
	UMaterialParameterCollectionInstance* AtmosphericMaterialParamsInstance; // 0x438
	UConstellationAudioEventsDataAsset* ConstellationBespokeAudioEventsListInstance; // 0x440
	FStringAssetReference AtmosphericMaterialParamsAssetRef; // 0x448
};

struct UBlockVolcanoTaleQuestService {
	UBlockVolcanoTaleQuestServiceDesc* Desc; // 0x60
};

struct UAILocomotionCompositeInputHandler {
	AActor* Owner; // 0x128
};

struct ATestWieldableInventoryItem {
	UInventoryItemComponent* InventoryItem; // 0x790
};

struct UAnimNotify_ToggleIK {
	TArray<ECharacterIKLimb> IKLimbsToAdjust; // 0x38
	bool Enabled; // 0x48
};

struct UEnvQueryGenerator_Donut {
	FAIDataProviderFloatValue InnerRadius; // 0x90
	FAIDataProviderFloatValue OuterRadius; // 0xc0
	FAIDataProviderIntValue NumberOfRings; // 0xf0
	FAIDataProviderIntValue PointsPerRing; // 0x120
	FEnvDirection ArcDirection; // 0x150
	FAIDataProviderFloatValue ArcAngle; // 0x170
	bool RandomiseRadius; // 0x1a0
	UEnvQueryContext* Center; // 0x1a8
	char bDefineArc : 1; // 0x1b0
};

struct USalvageItemSpawnComponent {
	TArray<FIslandItemSpawnLocationData> IslandSalvageLocationData; // 0x4e0
	float GlobalIslandChanceToSpawn; // 0x4f0
	float MinimumZOffSet; // 0x4f4
	float MaximumZOffset; // 0x4f8
	float MinimumRoll; // 0x4fc
	float MaximumRoll; // 0x500
	float MinimumPitch; // 0x504
	float MaximumPitch; // 0x508
	bool SunkenItem; // 0x50c
	UIslandItemDataAsset* SpawnLocationType; // 0x510
	FWeightedProbabilityRangeOfRanges SpawnedContainerContents; // 0x518
};

struct UClothingCategory {
	TArray<UClothingCategory*> PiratePreviewRemovals; // 0x78
	UAnimationAsset* PiratePreviewAnim; // 0x88
	FName PiratePreviewCamera; // 0x90
	bool PiratePreviewSpin; // 0x98
};

struct AMockCharacterWithAthenaPlayerCharacterMovementComponent {
	USkeletalMeshComponent* Mesh; // 0x448
	UCharacterMovementComponent* CharacterMovement; // 0x450
	UCapsuleComponent* CapsuleComponent; // 0x458
	FBasedMovementInfo BasedMovement; // 0x460
	FBasedMovementInfo ReplicatedBasedMovement; // 0x498
	FVector BaseTranslationOffset; // 0x4d0
	FQuat BaseRotationOffset; // 0x4e0
	char ReplicatedMovementMode; // 0x4f0
	bool bInBaseReplication; // 0x4f1
	float CrouchedEyeHeight; // 0x4f4
	char bIsCrouched : 1; // 0x4f8
	char bPressedJump : 1; // 0x4f8
	char bClientUpdating : 1; // 0x4f8
	char bClientWasFalling : 1; // 0x4f8
	char bClientResimulateRootMotion : 1; // 0x4f8
	char bSimGravityDisabled : 1; // 0x4f8
	char bServerMoveIgnoreRootMotion : 1; // 0x4f8
	float JumpKeyHoldTime; // 0x4fc
	float JumpMaxHoldTime; // 0x500
	FScriptMulticastDelegate OnReachedJumpApex; // 0x508
	FScriptMulticastDelegate OnCharacterMovementUpdated; // 0x528
	FRootMotionMovementParams ClientRootMotionParams; // 0x540
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x580
	FRepRootMotionMontage RepRootMotion; // 0x590
};

struct USetMechanismActionCutsceneNameStepDesc {
	FName CutsceneName; // 0x80
	FQuestVariableActor MechanismActor; // 0x88
};

struct USpawnPortalTaleStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct AAbilitySystemTestPawn {
	UAbilitySystemComponent* AbilitySystemComponent; // 0x488
};

struct UGameplayTask_SpawnActor {
	FScriptMulticastDelegate Success; // 0x58
	FScriptMulticastDelegate DidNotSpawn; // 0x68
	AActor* ClassToSpawn; // 0x90
};

struct ACoherentUIGTSystem {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UAIShipEncounterSpawnParamsDataAsset {
	float SpawnDepth; // 0x28
	float Radius; // 0x2c
	float MinSafeSpawnDistanceFromOtherShips; // 0x30
	float TimeDelayBetweenWaves; // 0x34
	FRelativeSpawnLocationGeneratorParams RelativeSpawnLocationParams; // 0x38
};

struct ABrushShape {
	EBrushType BrushType; // 0x3d0
	FColor BrushColor; // 0x3d4
	int32_t PolyFlags; // 0x3d8
	char bColored : 1; // 0x3dc
	char bSolidWhenSelected : 1; // 0x3dc
	char bPlaceableFromClassBrowser : 1; // 0x3dc
	char bNotForClientOrServer : 1; // 0x3dc
	UModel* Brush; // 0x3e0
	UBrushComponent* BrushComponent; // 0x3e8
	char bInManipulation : 1; // 0x3f0
	TArray<FGeomSelection> SavedSelections; // 0x3f8
};

struct ASimpleBootyItemProxy {
	URetractableComponent* RetractableComponent; // 0x7a8
	UItemProxyShipTrackerComponent* ItemProxyShipTrackerComponent; // 0x7b0
};

struct UParticleModuleColor {
	char bUseGroupAColorForAllGroups : 1; // 0x50
	FRawDistributionVector StartColor; // 0x58
	FRawDistributionVector AdditionalStartColor[0x5]; // 0x90
	char bUseGroupAAlphaForAllGroups : 1; // 0x1a8
	FRawDistributionFloat StartAlpha; // 0x1b0
	FRawDistributionFloat AdditionalStartAlpha[0x5]; // 0x1e8
	char bClampAlpha : 1; // 0x300
	char bIgnoreComponentColorTint : 1; // 0x300
};

struct AWorldEventZoneService {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UPlayfabPartyVoiceChannel {
	int32_t BandwidthPerSecondReservationInBytes; // 0x80
	float SaturationCooloffPeriodInSeconds; // 0x88
};

struct UMaterialExpressionWorldPosition {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x70
};

struct USirenTridentProjectileParams {
	ESirenTridentProjectileState ParameterState; // 0x28
	FExplosionInfo ExplosionParams; // 0x30
	float CollisionRadius; // 0x170
	float MaterialScale; // 0x174
	float MaterialScaleChangeDuration; // 0x178
	float LaunchSpeed; // 0x17c
	float ChargeTime; // 0x180
	float LifeSpan; // 0x184
	int32_t AmmoCost; // 0x188
	float VfxCustomParameterValue; // 0x18c
	FName ProjectileAudioSwitchState; // 0x190
	UWwiseEvent* TrailSfxEventStart; // 0x198
	UWwiseEvent* TrailSfxEventStop; // 0x1a0
	UImpactProjectileId* ImpactId; // 0x1a8
	UForceFeedbackEffect* FireForceFeedback; // 0x1b0
	UForceFeedbackEffect* SizeChangeForceFeedback; // 0x1b8
};

struct UOnTutorialStepNPCDialogConditional {
	FName TutorialStepName; // 0x30
};

struct UConditionalStatsAsset {
	TArray<FConditionalStat> ConditionalStats; // 0x28
};

struct UDistributionVectorConstant {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct UBTService_DetermineAIAbility {
	FBlackboardKeySelector BlockChangeAIAbilitiesKey; // 0x70
};

struct UMapIslandRenderResource {
	FName IslandName; // 0x28
};

struct UAggressiveGhostShipNamesDataAsset {
	TArray<FAggressiveGhostShipNameBucket> NameBuckets; // 0x28
};

struct UParticipatedInActorKillConditionalStatTrigger {
	FName UniqueTextIdentifier; // 0x28
};

struct UIsShipCustomizedWithStatCondition {
	FRequiredShipCustomizationData RequiredShipCustomizationData; // 0x28
};

struct UAnimNotify_PlayMontage {
	UAnimMontage* MontageToPlay; // 0x38
};

struct UBTService_UpdateViewPitchForWieldedProjectileToHitTarget {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UGroupedInteractableAreaComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UInterpTrackDirector {
	TArray<FDirectorTrackCut> CutTrack; // 0x70
	char bSimulateCameraCutsOnClients : 1; // 0x80
};

struct UBowSplashContainer {
	bool EnableProbes; // 0x28
	float VisibleCullDistance; // 0x2c
	float HiddenCullDistance; // 0x30
	float SpeedThreshold; // 0x34
	float BowSplashFieldOfViewAngleAddition; // 0x38
	TArray<FBowSplashProbe> Probes; // 0x40
};

struct UBTDecorator_BlackboardBase {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UAIEncounterGenerationRecipeRankOrderList {
	TArray<UAIEncounterGenerationRecipe*> Recipes; // 0x28
	TArray<FAIEncounterGenerationRecipeFeatureBasedRankOrderList> FeatureBasedRecipeLists; // 0x38
};

struct UInGamePremiumShopViewModelComponent {
	UPetShopDataAsset* PetShopDataAsset; // 0x270
};

struct UStandardAnchorDynamicsDesc {
	FStandardAnchorDynamicsParameters Parameters; // 0x28
};

struct UComponentWithTestInterface {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct UBuriedItemStepFromLocationDesc {
	FQuestVariableVector ItemLocation; // 0x128
};

struct USkeletonAnimationInstance {
	FAthenaAnimationSkeletonAIFastPathData SkeletonAIFastPathData; // 0x3cf0
	UNPCHeldObjectData* HeldObjectList; // 0x3cf8
	AActor* LeftHandObject; // 0x3d00
	AActor* RightHandObject; // 0x3d08
	float ObjectOverlayBlendOutTime; // 0x3d10
	UAthenaAnimationCustomSkeletonAnimationData* CustomAnimationData; // 0x3d18
	FAthenaAnimationCustomSkeletonAnimationBlueprintData CustomAnimationBlueprintData; // 0x3d20
	ENPCCustomAnimationState PreviousCustomAnimationState; // 0x3d78
	UAnimMontage* CustomAnimationCurrentMontage; // 0x3d80
};

struct APlayerLoadingInteractionPoint {
	FVector InteractionBounds; // 0x510
	FName ThirdPersonMeshSocketAttachName; // 0x51c
	FText LoadPlayerDisabledToolTipText; // 0x528
	FText LoadingDisabledToolTipText; // 0x560
	ULoadingPointComponent* LoadingPointComponent; // 0x598
	UInteractableComponent* InteractionRegion; // 0x5a0
	USceneComponent* SceneComponent; // 0x5a8
	UPlayerNameplateLocationOverrideComponent* PlayerNameplateLocationOverrideComponent; // 0x5b0
};

struct ULightComponent {
	float Temperature; // 0x2e0
	char bUseTemperature : 1; // 0x2e4
	int32_t ShadowMapChannel; // 0x2e8
	float SourceRadius; // 0x2f0
	float MinRoughness; // 0x2f4
	float ShadowBias; // 0x2f8
	float ShadowSharpen; // 0x2fc
	float ShadowResMaxDynamicDegradation; // 0x300
	char InverseSquaredFalloff : 1; // 0x304
	char CastTranslucentShadows : 1; // 0x304
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x304
	char bAffectDynamicIndirectLighting : 1; // 0x304
	UMaterialInterface* LightFunctionMaterial; // 0x308
	FVector LightFunctionScale; // 0x310
	UTextureLightProfile* IESTexture; // 0x320
	char bUseIESBrightness : 1; // 0x328
	float IESBrightnessScale; // 0x32c
	float LightFunctionFadeDistance; // 0x330
	float DisabledBrightness; // 0x334
	char bEnableLightShaftBloom : 1; // 0x338
	float BloomScale; // 0x33c
	float BloomThreshold; // 0x340
	FColor BloomTint; // 0x344
	bool bUseRayTracedDistanceFieldShadows; // 0x348
	float RayStartOffsetDepthScale; // 0x34c
};

struct UGetCurrentQuestInfoStep {
	UGetCurrentQuestInfoStepDesc* Desc; // 0x90
};

struct USelectionOfSirenStatues {
	TArray<UClass*> Statues; // 0x28
};

struct UStreamingSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	float AsyncIOBandwidthLimit; // 0x48
	char UseBackgroundLevelStreaming : 1; // 0x4c
	char AsyncLoadingUseFullTimeLimit : 1; // 0x4c
	float AsyncLoadingTimeLimit; // 0x50
	float PriorityAsyncLoadingExtraTime; // 0x54
	float LevelStreamingActorsUpdateTimeLimit; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
};

struct ADirectionalLight {
	ULightComponent* LightComponent; // 0x3d0
	char bEnabled : 1; // 0x3d8
};

struct UKnockbackAIAbilityParams {
	FExplosionInfo ExplosionInfo; // 0xc8
};

struct UFootstepIDAsset {
	FName FootstepName; // 0x28
};

struct UShipPointParticleComponent {
	TArray<EShipRegion> ValidShipRegions; // 0x868
	TArray<FVector> SpawnPts; // 0x878
	FName SpawnRateParam; // 0x888
	FVector2D ParamValueRange; // 0x890
	FVector2D TimePerEmitMin; // 0x898
	FVector2D TimePerEmitMax; // 0x8a0
	EShipParticleParam ParamType; // 0x8a8
};

struct UOpenableItemMaterialAnimationReactionComponent {
	TArray<FOpenableItemMaterialAnimationReactionComponentAnimationNameAndSfxCueSet> AnimNameSets; // 0xd8
	UMaterialAnimatorComponent* MaterialAnimatorComponent; // 0xe8
};

struct ANavigationObjectBase {
	UCapsuleComponent* CapsuleComponent; // 0x3d8
	UBillboardComponent* GoodSprite; // 0x3e0
	UBillboardComponent* BadSprite; // 0x3e8
	char bIsPIEPlayerStart : 1; // 0x3f0
};

struct UMaterialExpressionObjectBounds {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	FString Desc; // 0x38
	FColor BorderColor; // 0x48
	char bRealtimePreview : 1; // 0x4c
	char bNeedToUpdatePreview : 1; // 0x4c
	char bIsParameterExpression : 1; // 0x4c
	char bCommentBubbleVisible : 1; // 0x4c
	char bShowOutputNameOnPin : 1; // 0x4c
	char bHidePreviewWindow : 1; // 0x4c
	char bCollapsed : 1; // 0x4c
	char bShaderInputData : 1; // 0x4c
	char bShowInputs : 1; // 0x4d
	char bShowOutputs : 1; // 0x4d
	TArray<FText> MenuCategories; // 0x50
	TArray<FExpressionOutput> Outputs; // 0x60
};

struct UBTTask_SetBlackboardFloatValueFromWeightedArray {
	FAIDataProviderStructValue WeightedArrayFromParams; // 0x88
};

struct UMaterialExpressionPower {
	FExpressionInput Base; // 0x70
	FExpressionInput Exponent; // 0xa8
	float ConstExponent; // 0xe0
};

struct USceneDialoguePointWithConditional {
	USceneDialoguePoint* Point; // 0x28
	UNPCDialogConditional* Conditional; // 0x30
};

struct UMechanismAnimationEvent_ContinuousVFX {
	float StartTime; // 0x78
	float StopTime; // 0x7c
	FMechanismAnimationEvent_VFXParams VFXParams; // 0x80
};

struct AAsymmetricClientObject {
	UBoxComponent* BaseComponent; // 0x3e8
	UStaticMeshMemoryConstraintComponent* ThirdPersonMesh; // 0x3f0
	UWaterInteractionComponent* WaterInteractionComponent; // 0x3f8
	UBuoyancyComponent* BuoyancyComponent; // 0x400
	USpawnDependentTrackedOwnerComponent* SpawnDependentTrackedOwnerComponent; // 0x408
	FRotator RotationWhenPlacingWorldProxy; // 0x410
	float ZOffsetWhenPlacingWorldProxy; // 0x41c
};

struct UTaleQuestFramedStep {
	TArray<UTaleQuestService*> Services; // 0x98
	UTaleQuestFramedStepDesc* FrameDesc; // 0xa8
	UScriptStruct* StructForCollector; // 0xc0
	UScriptStruct* LocalStructForCollector; // 0xc8
};

struct UFoliageInstancedStaticMeshComponent {
	FScriptMulticastDelegate OnInstanceTakePointDamage; // 0x768
	FScriptMulticastDelegate OnInstanceTakeRadialDamage; // 0x778
};

struct UTunnelDesc {
	FString MatchmakingPlayModeTag; // 0x28
	ULevelSequence* VignetteSequence; // 0x38
	int32_t VignetteHeightCorrection; // 0x40
	TArray<FShipSpecificData> ShipSpecificVignettes; // 0x48
	bool EnableDynamicFogTransition; // 0x58
	float SecondsAfterVignetteSequenceStartsBeforeTransitioningFog; // 0x5c
	float SecondsAfterVignetteSequenceStartsBeforeTriggeringEndSequence; // 0x60
	TArray<FShipCameraAnimation> EndSequenceCameraAnimation; // 0x68
	USceneDialogueData* DialogueData; // 0x78
	TArray<FText> LocalisableNames; // 0x80
	AActor* Endpoint; // 0x90
	FVector EndPointOffset; // 0x98
	UWwiseEvent* MusicOfTheSeasEvent; // 0xa8
	UWwiseEvent* MusicOfTheSeasStop; // 0xb0
	UWwiseObjectPoolWrapper* MusicOfTheSeasPool; // 0xb8
	UWwiseEvent* AmbienceSfxEvent; // 0xc0
	UWwiseEvent* AmbienceSfxStop; // 0xc8
	UWwiseObjectPoolWrapper* AmbienceSfxPool; // 0xd0
	bool ForceRespawnPlayersOnShipInFailureScenarios; // 0xd8
	bool DropCapstanOnTunnelExit; // 0xd9
	FStringAssetReference SpawnLocation; // 0xe0
	bool SpawnShipOutsidePortalOnDestinationServer; // 0xf0
	bool SpawnShipOutsidePortalInFailureScenarios; // 0xf1
	AActor* ShipTeleportEffectsClass; // 0xf8
};

struct UAISpawnWaveSequenceRankProgression {
	TArray<FAISpawnWaveSequenceRankMapping> RankMappings; // 0x28
	int32_t NumberOfRanks; // 0x38
};

struct AShipwreckService {
	TArray<TScriptInterface<Class>> ToMoveList; // 0x3d8
	FWeightedProbabilityRange WreckProbRange; // 0x3e8
	AShipwreck* WreckClass; // 0x408
	UShipwreckSiteGeneratorComponent* SiteGenerator; // 0x410
	UShipwreckNameGeneratorAbstract* NameGenerator; // 0x418
	float ShipwreckLifetime; // 0x420
	float PlayerDistanceMoveThreshold; // 0x424
	float ShipDistanceMoveThreshold; // 0x428
	FWreckSpawnQueryPriorityData SpawnQueryData; // 0x480
	TArray<TScriptInterface<Class>> WreckList; // 0x490
	TArray<FCustomWreckEntry> ActiveCustomWreckList; // 0x4b0
};

struct UBTDecorator_KeepInCone {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct USafeZone {
	TArray<UPanelSlot*> Slots; // 0x138
};

struct AServerMigrationSerialisationDetailsTestsMigrationActorWithRootComponentSimulatePhysicsEnabledByDefault {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UCommodityDemandFrameworkSettings {
	float DemandRefreshFrequencyInSeconds; // 0x38
	FName DemandCollectionId; // 0x3c
	int32_t CommodityPurchaseLockoutInGameDays; // 0x44
	int32_t InGameHourWhenCommoditiesRestock; // 0x48
	FGameTime CommodityRedemptionTimeOutPeriodInDays; // 0x50
	FStringAssetReference NPCListAsset; // 0x58
};

struct UWieldablePetHungerDataAsset {
	float TimeToStartEating; // 0x28
	float EdibleCheckRadius; // 0x2c
	FWieldablePetHungerAnimationData EatingAnimData; // 0x30
	FWieldablePetHungerAnimationData FedAnimData; // 0x38
	FWieldablePetHungerAnimationData SickAnimData; // 0x40
	FWieldablePetHungerAnimationData RefuseAnimData; // 0x48
	ECollisionChannel CollisionChannel; // 0x50
};

struct UAthenaAIControllerSharedParamValuesDataAsset {
	bool OverrideMeshScale; // 0x28
	float MeshScale; // 0x2c
	bool OverrideCurrentTargetPerceivedNotVisibleAge; // 0x30
	float CurrentTargetPerceivedNotVisibleAge; // 0x34
	TArray<FAthenaAIControllerSenseSettingOverride> AIStrategySenseSettingOverrides; // 0x38
	FAthenaAIControllerHealthCustomisation HealthCustomisationValues; // 0x48
	TArray<FAthenaAIControllerParamValue> InitialBlackboardValues; // 0x58
	TArray<FAthenaAIControllerParamValue> NamedControllerParams; // 0x68
	TArray<FAthenaAIControllerWeightedRangesParamValue> NamedWeightedRangesControllerParams; // 0x78
};

struct UInputKeyDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UEnvQueryTest_InGameEventExclusionZone {
	float Radius; // 0x170
};

struct UAirBubbleComponent {
	float Radius; // 0x2b0
};

struct UVectorFieldStatic {
	int32_t SizeX; // 0x48
	int32_t SizeY; // 0x4c
	int32_t SizeZ; // 0x50
};

struct UStaticAISpawnCondition {
	bool ShouldApplyOverride; // 0x30
};

struct UAthenaAIWeightedRangesDataProvider {
	FName ParamName; // 0x28
	FWeightedProbabilityRangeOfRanges WeightedRangesValue; // 0x30
};

struct UAtmosphericPressureService {
	TArray<TScriptInterface<Class>> RegisteredAtmosphericPressureZones; // 0x30
};

struct UMapTableInputComponent {
	AMapTable* MapTable; // 0x280
};

struct UAIDataProvider_QueryParamFromCustomObjectProperty {
	FCustomDataProviderObjectPropertySelector ObjectProperty; // 0x28
	float FloatValue; // 0x38
	int32_t IntValue; // 0x3c
	bool BoolValue; // 0x40
};

struct UFireworkStatsComponent {
	float FlareRadius; // 0xc8
	int32_t NumberOfFireworksFiredAtNight; // 0xd0
	float FireworksFiredAtNightRadius; // 0xd4
	float FiredFireworksAtNightTimer; // 0xd8
};

struct UWwiseIDsDatabase {
	TArray<uint32_t> StateGroupIDs; // 0x28
	TArray<FName> StateGroupNames; // 0x38
	TArray<uint32_t> StateValueIDs; // 0x48
	TArray<FName> StateValueNames; // 0x58
	TArray<uint32_t> SwitchGroupIDs; // 0x68
	TArray<FName> SwitchGroupNames; // 0x78
	TArray<uint32_t> SwitchStateIDs; // 0x88
	TArray<FName> SwitchStateNames; // 0x98
};

struct UBTDecorator_MultipleRandomDiceRolls {
	TArray<FChanceAndBlackboardKeyPair> ChanceKeyPairs; // 0x68
};

struct UReviveEffectsDataAsset {
	UMaterialParameterCollection* ReviveMaterialParameterCollection; // 0x28
	FName AstralCordReviveInProgressMaterialCollectionScalarParameterName; // 0x30
	FName AstralCordFadeMaterialCollectionScalarParameterName; // 0x38
	FName AstralCordBorderMaterialCollectionScalarParameterName; // 0x40
	UCurveFloat* AstralCordBorderParamValueByAbsoluteTimeSinceDeath; // 0x48
	UMaterial* ReviveePostProcessMaterial; // 0x50
	float GhostShaderGhostEffectInterpolationValue; // 0x58
	float ReviveSuccessfulEffectDuration; // 0x5c
	UObject* ReviveSuccessfulOneShotVFX; // 0x60
	UObject* ReviveSuccessfulOneShotVFX_Revivee; // 0x68
	UObject* ReviveInProgressLoopingVFX; // 0x70
	float AstralCordReviveInProgressInterpolationSpeed; // 0x78
	float AstralCordReviveNotInProgressInterpolationSpeed; // 0x7c
	UObject* ContinuousBodyLoopingVFX; // 0x80
	float AstralCordFadeInInterpolationSpeed; // 0x88
	float AstralCordFadeOutInterpolationSpeed; // 0x8c
	float DefaultAstralCordHeight; // 0x90
	float AstralCordHeightOffsetFromTheGhost; // 0x94
	UObject* DeadPlayerBodyEvaporatesOneShotVFX; // 0x98
	UWwiseEvent* OtherPlayers_ReviveGhostAmbientStart; // 0xa0
	UWwiseEvent* OtherPlayers_ReviveGhostAmbientStop; // 0xa8
	UWwiseEvent* DeadPlayer_ReviveInProgressStart; // 0xb0
	UWwiseEvent* DeadPlayer_ReviveInProgressStop; // 0xb8
	UWwiseEvent* OtherPlayers_ReviveInProgressStart; // 0xc0
	UWwiseEvent* OtherPlayers_ReviveInProgressStop; // 0xc8
};

struct UVoyageLocationOnlyNamedIslandListDataAsset {
	TArray<FName> OnlyNamedIslandsList; // 0x28
	UVoyageLocationFeatureToggledOnlyNamedIslandListDataAsset* FeatureToggledOnlyNamedIslandsListAsset; // 0x38
};

struct AOneShotAnimatedMechanismAction {
	USceneComponent* Root; // 0x520
	USceneComponent* Pivot; // 0x528
	FMechanismTransformAnimationCurve Animation; // 0x530
	UWwiseObjectPoolWrapper* AudioEmitterPool; // 0x538
	FMechanismAnimationEventContainer AnimationEvents; // 0x540
};

struct AShipNetProxy {
	bool EmissaryFlagActive; // 0x400
	FStringAssetReference EmmissaryFlagTextureReference; // 0x408
	UMaterialInstanceDynamic* EmmissaryFlagMaterial; // 0x418
	TArray<AShipInteractableLight*> ShipLanterns; // 0x428
	int32_t LanternBits; // 0x448
};

struct UClueDescriptorGenerator {
	UClueDescriptor* DescriptorType; // 0x28
	TArray<UClueDestinationDescriptor*> SupportedDestinationTypes; // 0x30
};

struct UMaterialExpressionBumpOffset {
	FExpressionInput Coordinate; // 0x70
	FExpressionInput Height; // 0xa8
	FExpressionInput HeightRatioInput; // 0xe0
	float HeightRatio; // 0x118
	float ReferencePlane; // 0x11c
	uint32_t ConstCoordinate; // 0x120
};

struct ANavLinkProxy {
	TArray<FNavigationLink> PointLinks; // 0x3e0
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x3f0
	UNavLinkCustomComponent* SmartLinkComp; // 0x400
	bool bSmartLinkIsRelevant; // 0x408
	FScriptMulticastDelegate OnSmartLinkReached; // 0x410
};

struct UCoherentUIGTInstancedComponent {
	FString URL; // 0x310
	UMaterialInstanceDynamic* HUDMaterialInstance; // 0x328
	APlayerController* PlayerController; // 0x330
};

struct UMastRepairableComponent {
	FScriptMulticastDelegate OnRepairableStateChanged; // 0x130
	FScriptMulticastDelegate OnDamageLevelChanged; // 0x140
	FScriptMulticastDelegate OnRepairMounted; // 0x150
	float InteractionPointDepthOffset; // 0x160
	float MaximumRepairAngleToRepairer; // 0x164
	float MaximumRepairDistance; // 0x168
	float RepairTime; // 0x16c
	URepairTypeId* RepairType; // 0x170
	USceneComponent* RepairMountParent; // 0x178
	FTransform RepairMountOffset; // 0x180
	FName RepairMountSocket; // 0x1b0
	int32_t MaxDamageLevel; // 0x1b8
	UAIInteractableType* AIInteractionType; // 0x1c0
	FVector AIInteractionOffset; // 0x1c8
	FRepairableAuthoritiveRepairState AuthorityRepairableState; // 0x1d8
	ERepairableState RepairableState; // 0x1f0
	int32_t DamageLevel; // 0x1f4
	EInteractableState InteractionState; // 0x1f8
};

struct UCoherentContentEngagementMessage {
	TArray<FFeatureToggledStringAssetReferenceEntry> Entries; // 0x28
	UObject* ClassType; // 0x38
};

struct AContinuousAnimatedMechanismAction {
	UMechanismActionComponent* MechanismActionComponent; // 0xa20
};

struct UEmoteFlourishDesc {
	TArray<FEmoteFlourishCategoryMapping> FlourishMappings; // 0x110
	EEmoteFlourishType FlourishType; // 0x120
};

struct UCommandlet {
	FString HelpDescription; // 0x28
	FString HelpUsage; // 0x38
	FString HelpWebLink; // 0x48
	TArray<FString> HelpParamNames; // 0x58
	TArray<FString> HelpParamDescriptions; // 0x68
	char IsServer : 1; // 0x78
	char IsClient : 1; // 0x78
	char IsEditor : 1; // 0x78
	char LogToConsole : 1; // 0x78
	char ShowErrorCount : 1; // 0x78
};

struct UGetVoyageDifficultyFromRankStepDesc {
	EVoyageDifficultyScope VoyageType; // 0x80
	FQuestVariableInt Difficulty; // 0x88
};

struct UStatusResponseAIShipSetMaxSpeedMultiplier {
	float MaxSpeedMultiplier; // 0x30
};

struct UArenaWorldMarkerOnProxyComponent {
	UWorldMarkerVariant* MarkerVariant; // 0xc8
};

struct ULoadSequencerAnimationStep {
	ULoadSequencerAnimationStepDesc* StepDesc; // 0x90
	ASequencerCutSceneActor* SequencerCutSceneActor; // 0x98
	AActor* TargetToSpawnActor; // 0xa0
};

struct ADamageableCargoRunCrateItemProxy {
	UGatedHealthComponent* GatedHealthComponent; // 0x7e8
	UVisualHealthResponseComponent* VisualHealthResponseComponent; // 0x7f0
	ULightWeightStatusEffectManagerComponent* LightweightStatusEffectComponent; // 0x7f8
};

struct UActorCoherentViewComponent {
	FName TargetPrimitiveName; // 0x3e8
};

struct UPhrasesRadialDataAsset {
	TArray<FPhraseData> Phrases; // 0x28
};

struct UWieldableItemSetComponent {
	TArray<FWieldedItemData> WieldableItems; // 0xd0
	TArray<UItemCategory*> LockedCategories; // 0xe0
};

struct ALimpingTestActor {
	ULimpingComponent* Limping; // 0x3d0
};

struct UAddNPCOnShipStep {
	UTaleQuestStepDesc* TaleStepDesc; // 0x80
};

struct UCoralShieldAbilityParams {
	float ShieldEffectRadius; // 0xc8
	float DamageNeededToBreakShield; // 0xcc
	float ShieldLifeTime; // 0xd0
	FStatus CoralShieldStatusEffect; // 0xd8
	UDamageableVulnerabilityLayer* VulnerabilityToApplyToSelf; // 0xf0
	float DelayBeforeSFXPlays; // 0xf8
};

struct UFireSettingsDataAsset {
	float CharacterOnFireEffectRadius; // 0x28
	ECollisionChannel TraceChannel; // 0x2c
	float CharacterToCharacterPropagationInterval; // 0x30
	float MaxInitialPropagationOffset; // 0x34
	FStatus BurnStatus; // 0x38
	FStatus FirePropagationStatus; // 0x50
	uint32_t MaxComponentsToTickPerFrame; // 0x68
};

struct UAthenaUserSettingsDefaults {
	TArray<int32_t> MaxFPSOptions; // 0x28
	FAimSensitivitySettingsDefaults AimSensitivitySettings; // 0x38
};

struct AInteractableMockActor {
	AActor* ActorThatInteracted; // 0x3e8
	TArray<UNotificationInputId*> CanInteractNotifications; // 0x3f8
	UCapsuleComponent* PrimitiveComponent; // 0x408
	UInteractableComponent* InteractableComponent; // 0x410
	UActionRulesComponent* ActionRulesComponent; // 0x418
	EInteractableState CurrentInteractionState; // 0x420
	bool CanSetInteractionState; // 0x421
};

struct UMaterialExpressionCustom {
	FString Code; // 0x70
	ECustomMaterialOutputType OutputType; // 0x80
	FString Description; // 0x88
	TArray<FCustomInput> Inputs; // 0x98
	FString DeclarationCode; // 0xa8
};

struct UMaterialExpressionFontSample {
	UFont* Font; // 0x70
	int32_t FontTexturePage; // 0x78
};

struct UCargoRunCrateMetaGenerator {
	UScriptStruct* MetaWrapper; // 0x28
};

struct URegionMapDataAsset {
	FRegionMapData RegionData; // 0x28
};

struct UNPCDialogOptionShop {
	FText Text; // 0x80
	UShopDesc* ShopDesc; // 0xb8
	AController* Interactor; // 0xc0
};

struct ATestActionStateCreatorDefinition {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UMaterialParameterCollectionInstance {
	UMaterialParameterCollection* Collection; // 0x30
	UWorld* World; // 0x38
};

struct ATreasureVaultTable {
	UVaultKeyMappingDataAsset* VaultKeyMapping; // 0x3f8
};

struct UWidgetBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x40
};

struct UDialogueVoice {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UAbilitySystemComponent {
	TArray<FAttributeDefaults> DefaultStartingData; // 0x130
	TArray<UAttributeSet*> SpawnedAttributes; // 0x140
	FPredictionKey ReplicatedPredictionKey; // 0x150
	float OutgoingDuration; // 0x1e0
	float IncomingDuration; // 0x1e4
	FGameplayAbilitySpecContainer ActivatableAbilities; // 0x1e8
	TArray<UGameplayAbility*> AllReplicatedInstancedAbilities; // 0x2f8
	TArray<AGameplayAbilityTargetActor*> SpawnedTargetActors; // 0x4b8
	FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x4c8
	FGameplayAbilityLocalAnimMontage LocalAnimMontageInfo; // 0x4f8
	AActor* OwnerActor; // 0x5c8
	AActor* AvatarActor; // 0x5d0
	FActiveGameplayEffectsContainer ActiveGameplayEffects; // 0x5f0
	FActiveGameplayCueContainer ActiveGameplayCues; // 0x958
	TArray<char> BlockedAbilityBindings; // 0xb48
};

struct AGhostShipTickManager {
	TArray<AActor*> GhostShipActors; // 0x3d0
};

struct UBTDecorator_ActionState {
	EActionStateMachineTrackId TrackId; // 0x68
	UActionStateId* StateId; // 0x70
};

struct UIsTargetAllianceMemberStatCondition {
	UStatConditionTargetSelector* TargetSelector; // 0x28
};

struct UAshenLordVolcanoSetupDataAsset {
	FWeightedProbabilityRangeOfRanges ProjectileTriggerFrequency; // 0x28
	FWeightedProbabilityRange NumProjectilesToTrigger; // 0x58
	FWeightedProbabilityRangeOfRanges SpawnHeightInMetres; // 0x78
	FWeightedProbabilityRangeOfRanges TargetDistanceFromCenterInMetres; // 0xa8
	FWeightedProbabilityRangeOfRanges TimeBetweenSpawns; // 0xd8
	FWeightedProbabilityRangeOfRanges StartPositionOffsetInMetres; // 0x108
	TArray<FWeightedAshenLordVolcanoProjectile> Projectiles; // 0x138
	FPoolableCollectionMapConfiguration PoolableProjectilesConfig; // 0x148
	FVolcanoSetupDataEmbersEntry Embers; // 0x160
	float EmberSpawnHeightInMeters; // 0x170
	float TimeBetweenEmbers; // 0x174
};

struct UMaterialExpressionHash {
	FExpressionInput Input; // 0x70
};

struct UNameplateSettings {
	ECollisionChannel NameplateCollisionChannel; // 0x38
};

struct UTallTaleSpawnedActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x80
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0x90
	TArray<UAssetUserData*> AssetUserData; // 0xb0
	char bReplicates : 1; // 0xc0
	char bNetAddressable : 1; // 0xc0
	char bCreatedByConstructionScript : 1; // 0xc1
	char bInstanceComponent : 1; // 0xc1
	char bAutoActivate : 1; // 0xc2
	char bIsActive : 1; // 0xc2
	char bEditableWhenInherited : 1; // 0xc2
	char bNeedsLoadForClient : 1; // 0xc3
	char bNeedsLoadForServer : 1; // 0xc3
	EComponentNetDormancy TargetNetDormancy; // 0xc4
	EComponentCreationMethod CreationMethod; // 0xc5
};

struct AMockInputHandlerCharacter {
	USkeletalMeshComponent* Mesh; // 0x448
	UCharacterMovementComponent* CharacterMovement; // 0x450
	UCapsuleComponent* CapsuleComponent; // 0x458
	FBasedMovementInfo BasedMovement; // 0x460
	FBasedMovementInfo ReplicatedBasedMovement; // 0x498
	FVector BaseTranslationOffset; // 0x4d0
	FQuat BaseRotationOffset; // 0x4e0
	char ReplicatedMovementMode; // 0x4f0
	bool bInBaseReplication; // 0x4f1
	float CrouchedEyeHeight; // 0x4f4
	char bIsCrouched : 1; // 0x4f8
	char bPressedJump : 1; // 0x4f8
	char bClientUpdating : 1; // 0x4f8
	char bClientWasFalling : 1; // 0x4f8
	char bClientResimulateRootMotion : 1; // 0x4f8
	char bSimGravityDisabled : 1; // 0x4f8
	char bServerMoveIgnoreRootMotion : 1; // 0x4f8
	float JumpKeyHoldTime; // 0x4fc
	float JumpMaxHoldTime; // 0x500
	FScriptMulticastDelegate OnReachedJumpApex; // 0x508
	FScriptMulticastDelegate OnCharacterMovementUpdated; // 0x528
	FRootMotionMovementParams ClientRootMotionParams; // 0x540
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x580
	FRepRootMotionMontage RepRootMotion; // 0x590
};

struct UBTService_QueryPerceptionForTarget {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UDebugTeleportCrewStepDesc {
	FQuestVariableActor LocatorVar; // 0x80
};

struct UAIPartsDesc {
	FAIPartId AIPartId; // 0x28
};

struct USinkingComponent {
	FSinkingShipParams SinkingParams; // 0xd0
	AShip* Ship; // 0x108
	EShipState ShipState; // 0x110
	int32_t KeelOverConfigIndex; // 0x114
};

struct UCostumeDesc {
	bool CrewCostume; // 0xe0
};

struct UWieldablePetAnimNotifyWwiseEmitterComponent {
	FWwiseEmitter Emitter; // 0x2b8
	UWwiseObjectPoolWrapper* WwiseObjectPoolWrapper; // 0x2d8
};

struct UEndUserSettings {
	bool bSendAnonymousUsageDataToEpic; // 0x30
};

struct USoundNodeOscillator {
	char bModulateVolume : 1; // 0x38
	char bModulatePitch : 1; // 0x38
	float AmplitudeMin; // 0x3c
	float AmplitudeMax; // 0x40
	float FrequencyMin; // 0x44
	float FrequencyMax; // 0x48
	float OffsetMin; // 0x4c
	float OffsetMax; // 0x50
	float CenterMin; // 0x54
	float CenterMax; // 0x58
};

struct ANavigationGraphNode {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UPlayerInput {
	TArray<FKeyBind> DebugExecBindings; // 0x120
	TArray<FName> GamepadInvertedAxes; // 0x170
	TArray<FName> MouseInvertedAxes; // 0x180
	TArray<FName> InvertedCombinedAxisY; // 0x190
	TArray<FName> InvertedCombinedAxisX; // 0x1a0
};

struct UParticleModuleBeamNoise {
	char bLowFreq_Enabled : 1; // 0x50
	int32_t Frequency; // 0x54
	int32_t Frequency_LowRange; // 0x58
	FRawDistributionVector NoiseRange; // 0x60
	FRawDistributionFloat NoiseRangeScale; // 0x98
	char bNRScaleEmitterTime : 1; // 0xd0
	FRawDistributionVector NoiseSpeed; // 0xd8
	char bSmooth : 1; // 0x110
	float NoiseLockRadius; // 0x114
	char bNoiseLock : 1; // 0x118
	char bOscillate : 1; // 0x118
	float NoiseLockTime; // 0x11c
	float NoiseTension; // 0x120
	char bUseNoiseTangents : 1; // 0x124
	FRawDistributionFloat NoiseTangentStrength; // 0x128
	int32_t NoiseTessellation; // 0x160
	char bTargetNoise : 1; // 0x164
	float FrequencyDistance; // 0x168
	char bApplyNoiseScale : 1; // 0x16c
	FRawDistributionFloat NoiseScale; // 0x170
};

struct UTestAthenaDebugMenuComponent {
	UPlayerPermissionsComponent* TestPermissionComponent; // 0x128
};

struct UCoralShieldVFXComponent {
	UParticleSystem* VFXAsset; // 0xc8
	FName VfxSocketName; // 0xd0
	UParticleSystemComponent* SpawnedVFXSystem; // 0xd8
	ECoralShieldVFXRole CurrentCoralShieldRole; // 0xe0
	UCurveFloat* OffToOnCurve; // 0xe8
	float OffToOnDuration; // 0xf0
	UCurveFloat* OnToOffCurve; // 0xf8
	float OnToOffDuration; // 0x100
	FName OffToOnParamOverrideName; // 0x104
	FName OnToOffParamOverrideName; // 0x10c
	FName ReceiverMeshComponentName; // 0x114
	FName CasterMeshComponentName; // 0x11c
	TArray<UMaterialInstanceDynamic*> OverriddenMaterialsForReceive; // 0x128
	TArray<UMaterialInstanceDynamic*> OverriddenMaterialsForCast; // 0x138
};

struct AMythicalMerchantCrateItemInfoMock {
	TArray<FMerchantCrateItemInfoFaunaBreedRarityEntry> FaunaBreedRarity; // 0x710
	AActor* CurrentShip; // 0x778
};

struct UMeleeChargeAIAbilityParams {
	float MinAngleToTargetToActivate; // 0xc8
	float MaxAngleToTargetToActivate; // 0xcc
	float MinTimeBetweenCheck; // 0xd0
	float MaxTimeBetweenCheck; // 0xd4
	float ChanceOfActivation; // 0xd8
	float ChargeTime; // 0xdc
};

struct AGeyser {
	UGeyserSetupDataAsset* SetupData; // 0x3d8
	EGeyserState GeyserState; // 0x3e0
	UWwiseEvent* StartActiveAudioLoopEvent; // 0x3e8
	UWwiseEvent* StopActiveAudioLoopEvent; // 0x3f0
	UWwiseEvent* PlayEruptingAudioEvent; // 0x3f8
	UWwiseEmitterComponent* AudioEmitterComponent; // 0x400
	UExplosionComponent* ExplosionComponent; // 0x408
	UParticleSystemComponent* ActiveParticlesComponent; // 0x410
	UParticleSystemComponent* EruptingParticlesComponent; // 0x418
	ECollisionChannel HitTestTraceChannel; // 0x420
	AHole* GeyserHoleClass; // 0x428
	AHole* GeyserHole; // 0x430
};

struct APrototypeMultiTargetEnchantedCompass {
	TArray<FVector> Locations; // 0x870
	TArray<FGuid> LocationIds; // 0x880
	UInventoryItemComponent* InventoryItem; // 0x890
	UEnchantedCompassProximityAnnouncementComponent* ProximityAnnouncementComponent; // 0x898
};

struct UTaleQuestNotificationStepDesc {
	UPopUpMessageDesc* Notification; // 0x80
	FQuestVariablePlayerActor PreventNotificationForPlayer; // 0x88
	FQuestVariablePlayerActor Player; // 0x98
};

struct USoundNodeParamCrossFade {
	FName ParamName; // 0x48
};

struct UWaitForCrewToCollectCollectorsChestPagesStepDesc {
	FQuestVariablePlayerActor CollectingPlayer; // 0x90
};

struct UDamageType {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	float DamageImpulse; // 0x2c
	char bRadialDamageVelChange : 1; // 0x30
	float DestructibleImpulse; // 0x34
	float DestructibleDamageSpreadScale; // 0x38
	float DamageFalloff; // 0x3c
};

struct UTaleQuestChooseIslandFromWeightsStepDesc {
	FQuestVariableNameArray IslandsToChooseFrom; // 0x80
	FQuestVariableInt DifficultyRank; // 0x90
	FQuestVariableName ChosenIsland; // 0xa0
	UIslandTypeWeightsDataAsset* IslandTypeWeights; // 0xb0
};

struct USwimmingPathFollowingComponent {
	float DirectSwimmingDotToTarget; // 0xc8
	float ArcToTargetDotToTarget; // 0xcc
	float MaxTargetPitchFactor; // 0xd0
	float MinPosDeltaSqToRepathToMovingTarget; // 0xd4
	float MinPosDeltaSqToInvalidateFixedLocation; // 0xd8
	float PitchBezierControlPointsLengthFactor; // 0xdc
	float TimeMovingAwayFromTargetPosToFlagFailure; // 0xe0
	FName LineOfSightCollisionProfile; // 0xe4
	float LineOfSightSphereCastRadius; // 0xec
	float LineOfSightCheckInterval; // 0xf0
	float FirstLoSTriggerTimeInNewPath; // 0xf4
	float FirstLoSTriggerTimeInRePath; // 0xf8
	bool DrawDebugOnServer; // 0xfc
	TArray<ECollisionChannel> CollisionTypesToDoPathUpdate; // 0x100
	USwimmingCreatureMovementComponent* MovementComponent; // 0x110
	AAthenaSwimmingAIController* SwimmingAIController; // 0x118
	EArcFollowingMode ArcFollowingMode; // 0x120
	AActor* TargetActor; // 0x178
};

struct AActorWithTestInterface {
	FActorTickFunction PrimaryActorTick; // 0x28
	float CustomTimeDilation; // 0x78
	char bAllowRemovalFromServerWhenCollisionMerged : 1; // 0x7c
	char bAllowRemovalFromServerWhenAutomaticallyInstanced : 1; // 0x7c
	char bHidden : 1; // 0x7c
	char bNetTemporary : 1; // 0x7c
	char bNetStartup : 1; // 0x7c
	char bOnlyRelevantToOwner : 1; // 0x7c
	char bAlwaysRelevant : 1; // 0x7c
	char bReplicateMovement : 1; // 0x7c
	char bTearOff : 1; // 0x7d
	char bExchangedRoles : 1; // 0x7d
	char bPendingNetUpdate : 1; // 0x7d
	char bNetLoadOnClient : 1; // 0x7d
	char bNetUseOwnerRelevancy : 1; // 0x7d
	char bBlockInput : 1; // 0x7d
	char bCanBeInCluster : 1; // 0x7d
	char bActorEnableCollision : 1; // 0x7e
	char bReplicateAttachment : 1; // 0x7e
	char bReplicates : 1; // 0x7e
	FScriptMulticastDelegate OnPreNetOwnershipChange; // 0x80
	ENetRole RemoteRole; // 0x82
	AActor* Owner; // 0x88
	EActorSpawnRestrictions SpawnRestrictions; // 0x90
	FRepMovement ReplicatedMovement; // 0x94
	FRepAttachment AttachmentReplication; // 0xd0
	ENetRole Role; // 0x118
	EAutoReceiveInput AutoReceiveInput; // 0x11a
	int32_t InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int32_t NetTag; // 0x130
	float NetUpdateTime; // 0x134
	float NetUpdateFrequency; // 0x138
	float NetPriority; // 0x13c
	float LastNetUpdateTime; // 0x140
	FName NetDriverName; // 0x144
	char bAutoDestroyWhenFinished : 1; // 0x14c
	char bCanBeDamaged : 1; // 0x14c
	char bActorIsBeingDestroyed : 1; // 0x14c
	char bCollideWhenPlacing : 1; // 0x14c
	char bFindCameraComponentWhenViewTarget : 1; // 0x14c
	char bRelevantForNetworkReplays : 1; // 0x14c
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x150
	APawn* Instigator; // 0x158
	TArray<AActor*> Children; // 0x160
	USceneComponent* RootComponent; // 0x170
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x178
	float InitialLifeSpan; // 0x188
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x190
	TArray<FName> Layers; // 0x198
	FActorPtr ParentComponentActor; // 0x1a8
	TArray<TWeakObjectPtr<AActor>> ChildComponentActors; // 0x1b0
	char bActorSeamlessTraveled : 1; // 0x1c8
	char bIgnoresOriginShifting : 1; // 0x1c8
	char bEnableAutoLODGeneration : 1; // 0x1c8
	TArray<FName> Tags; // 0x1d0
	FName Feature; // 0x1e0
	uint64_t HiddenEditorViews; // 0x1e8
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1f0
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1f1
	FScriptMulticastDelegate OnActorHit; // 0x1f2
	FScriptMulticastDelegate OnDestroyed; // 0x1f3
	FScriptMulticastDelegate OnEndPlay; // 0x230
	bool bDoOverlapNotifiesOnLoad; // 0x231
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x328
	TArray<UActorComponent*> InstanceComponents; // 0x338
	TArray<AActor*> ChildActorInterfaceProviders; // 0x350
	double DormancyLingeringInSeconds; // 0x3c8
};

struct UMaterialStatusSusceptibilityComponent {
	UPhysicalMaterial* CurrentSurfaceMaterial; // 0xd0
	TScriptInterface<Class> CurrentMaterialStatusZone; // 0xd8
};

struct UPlayerNameDataAsset {
	TArray<FText> PlayerNameOverrides; // 0x28
};

struct UQuestBookPageList {
	TArray<FPageReference> Pages; // 0x28
	TArray<FStringAssetReference> InitialPages; // 0x38
};

struct UComboButtonWidgetStyle {
	FComboButtonStyle ComboButtonStyle; // 0x30
};

struct UItemDescSpawnData {
	UClass* ItemDesc; // 0x58
};

struct UPremiumCurrencyReward {
	uint32_t MinPremiumCurrency; // 0x28
	uint32_t MaxPremiumCurrency; // 0x2c
};

struct UBTTask_AIShipSurface {
	float MaxSpeed; // 0x88
	float PreSurfaceDelay; // 0x8c
};

struct UBootyItemInfoMetaGenerator {
	UScriptStruct* MetaWrapper; // 0x28
};

struct USpeakToActorConditionalStatTrigger {
	FName UniqueTextIdentifier; // 0x28
};

struct UAnimNotify_WwiseSound {
	UWwiseEvent* WwiseEvent; // 0x38
	bool OwnedByWorld; // 0x40
	EAnimNotify_WwiseSound_PerspectiveRestriction PerspectiveRestriction; // 0x41
	UWwiseObjectPoolWrapper* OwnedByWorldWisePoolToUse; // 0x48
};

struct UBullRushAIAbilityParams {
	float StaticCollisionWarmup; // 0xe0
	TArray<UEnvQuery*> ValidatorEQSystems; // 0xe8
	float TimeBetweenCanExecuteChecks; // 0xf8
};

struct UMaterialExpressionTextureObject {
	UTexture* Texture; // 0x70
	EMaterialSamplerType SamplerType; // 0x78
	char IsDefaultMeshpaintTexture : 1; // 0x7c
};

struct APrecomputedVisibilityOverrideVolume {
	TArray<AActor*> OverrideVisibleActors; // 0x408
	TArray<AActor*> OverrideInvisibleActors; // 0x418
	TArray<FName> OverrideInvisibleLevels; // 0x428
};

struct UMaterialExpressionAntialiasedTextureMask {
	float Threshold; // 0x1c8
	ETextureColorChannel Channel; // 0x1cc
};

struct APlayerManagerService {
	TArray<FWeakActorHandle> AllPlayerControllers; // 0x3e8
};

struct UItemProxyShipTrackerComponent {
	UItemProxyShipTrackerComponentDataAsset* ShipTrackingData; // 0xd8
	AActor* CurrentShip; // 0xe0
};

struct ATimedDoorMechanismAction {
	TArray<FKeySequence> KeySequences; // 0x568
	UMechanismTriggerComponent* InternalTrigger; // 0x578
	bool UseSameLandmarkEventsForAllJammedPhases; // 0x580
	bool UseSameLandmarkEventsForAllLoweringPhases; // 0x581
	FTimedDoorLandmarkReactions LandmarkReactionsWhenDoorOpens; // 0x588
	TArray<FTimedDoorLandmarkReactions> LandmarkReactionsWhenDoorLowers; // 0x598
	TArray<FTimedDoorLandmarkReactions> LandmarkReactionsWhenDoorJams; // 0x5a8
	ALandmarkReactionPlayer* LandmarkReactionPlayer; // 0x5b8
	UItemDesc* CurrentKeyDesc; // 0x5f0
	FTimedDoorState ServerDoorState; // 0x5f8
	FObjectMessagingDispatcher EventDispatcher; // 0x608
};

struct UActorSequence {
	UMovieScene* MovieScene; // 0x2a8
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x2b0
};

struct UVideprinterService {
	TArray<AVideprinter*> Videprinters; // 0x30
};

struct UBTTask_RunEQSQuery {
	UEnvQuery* QueryTemplate; // 0x88
	TArray<FEnvNamedValue> QueryParams; // 0x90
	EEnvQueryRunMode RunMode; // 0xa0
};

struct AServerMigrationSerialisationDetailsTestsMigrationReferenceActor {
	AActor* ActorReferenceWithMigrationMarkup; // 0x3d0
};

struct UNPCDialogOptionStorageContainerStore {
	FText Text; // 0x80
	FText FullText; // 0xb8
	FText NoItemInInventoryText; // 0xf0
};

struct UNPCDialogConditionalTextHeader {
	TArray<UNPCDialogConditionalText*> Text; // 0x28
	FText DefaultText; // 0x38
};

struct UAthenaCharacterMovementComponent {
	FAthenaCharacterSwimParams SwimParams; // 0x560
	float SprintSpdAmp; // 0x5fc
	float SprintAccelAmp; // 0x600
	float LookAtYawRate; // 0x604
	float LookAtPitchRate; // 0x608
	float MaxSpeedRatioWhenWalkingInNonSwimWater; // 0x610
	float MaxAccelerationRatioWhenWalkingInNonSwimWater; // 0x614
	char bCharacterCollisionSweepsEnabled : 1; // 0x618
	float CharacterCollisionRadius; // 0x61c
	FCollisionProfileName CharacterCollisionProfile; // 0x620
	FCollisionProfileName CollisionPanicFallbackProfileName; // 0x628
	float CharacterCollisionWalkingFriction; // 0x630
	float CharacterCollisionSwimmingFriction; // 0x634
	float CharacterCollisionUnderwaterOffset; // 0x638
	UAthenaCharacterMovementUnderwater* UnderwaterMovement; // 0x640
	bool bCreateDisturbance; // 0x648
	float DisturbanceSize; // 0x64c
	float DisturbanceVelocityScale; // 0x650
	bool UseAsRVOObstacleOnly; // 0x654
	float FanPushOutAngle; // 0x6b8
	int32_t FanPushOutNumSteps; // 0x6bc
	float MaxFanPushOutScalar; // 0x6c0
	UCurveFloat* UnderwaterVelocityToAnglePitchProjectileHitVolume; // 0x6c8
	UCurveFloat* UnderwaterVelocityToAngleRollProjectileHitVolume; // 0x6d0
	UCurveFloat* UnderwaterVelocityToZOffsetProjectileHitVolume; // 0x6d8
	UCurveFloat* OnLandVelocityToAnglePitchProjectileHitVolume; // 0x6e0
	UCurveFloat* OnLandVelocityToXOffsetProjectileHitVolume; // 0x6e8
