// Created by BlueFire1337
// Updated 2022-01-07
// Generated 2022-01-23

namespace off {
	constexpr auto GNames = 0x52607c0;
	constexpr auto GObjects = 0x529ccf0;
	constexpr auto GWorld = 0x53e10f0;
}

struct USlateSettings : UObject {
	bool bExplicitCanvasChildZOrder; // 0x28
};

struct APhysicsConstraintActor : ARigidBodyBase {
	UPhysicsConstraintComponent* ConstraintComp; // 0x220
	AActor* ConstraintActor1; // 0x228
	AActor* ConstraintActor2; // 0x230
	char bDisableCollision : 1; // 0x238
};

struct UPortalWarsRoundIntermissionWidget : UUserWidget {
	UTextBlock* NumRoundsText; // 0x260
	UTextBlock* CurrentRoundText; // 0x268
	URichTextBlock* RoundWinnerText; // 0x270
	UImage* LeftStarImage; // 0x278
	UImage* RightStarImage; // 0x280
	UTextBlock* CountdownText; // 0x288
};

struct APortalWarsRaceHUD : APortalWarsHUD {
	UPortalWarsRaceHUDOverlay* RaceHUDOverlayWidget; // 0x400
	UPortalWarsRaceHUDOverlay* RaceHUDOverlayWidgetClass; // 0x408
	UPortalWarsIndicatorWidget* GateIndicatorWidgetClass; // 0x410
};

struct APortalWarsGameMode : APortalWarsBaseGameMode {
	AActor* LastStartSpot; // 0x378
	int32_t KillScore; // 0x380
	int32_t AssistScore; // 0x384
	int32_t DeathScore; // 0x388
	int32_t SuicideScore; // 0x38c
	int32_t FriendlyFireScore; // 0x390
	int32_t TeabagScore; // 0x394
	int32_t NumAllowedSuicides; // 0x398
	TArray<TSoftClassPtr<UObject>> DefaultInventoryClasses; // 0x638
	bool bAllowReplayRecording; // 0x648
	bool bObjectiveGame; // 0x649
	TArray<FString> RelevantStats; // 0x650
};

struct UMovieSceneNiagaraSystemSpawnSection : UMovieSceneSection {
	ENiagaraSystemSpawnSectionStartBehavior SectionStartBehavior; // 0xe8
	ENiagaraSystemSpawnSectionEvaluateBehavior SectionEvaluateBehavior; // 0xec
	ENiagaraSystemSpawnSectionEndBehavior SectionEndBehavior; // 0xf0
	ENiagaraAgeUpdateMode AgeUpdateMode; // 0xf4
};

struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; // 0x38
};

struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x90
};

struct UProjectileMovementComponent : UMovementComponent {
	float InitialSpeed; // 0xf0
	float MaxSpeed; // 0xf4
	char bRotationFollowsVelocity : 1; // 0xf8
	char bRotationRemainsVertical : 1; // 0xf8
	char bShouldBounce : 1; // 0xf8
	char bInitialVelocityInLocalSpace : 1; // 0xf8
	char bForceSubStepping : 1; // 0xf8
	char bSimulationEnabled : 1; // 0xf8
	char bSweepCollision : 1; // 0xf8
	char bIsHomingProjectile : 1; // 0xf8
	char bBounceAngleAffectsFriction : 1; // 0xf9
	char bIsSliding : 1; // 0xf9
	char bInterpMovement : 1; // 0xf9
	char bInterpRotation : 1; // 0xf9
	float PreviousHitTime; // 0xfc
	FVector PreviousHitNormal; // 0x100
	float ProjectileGravityScale; // 0x10c
	float Buoyancy; // 0x110
	float Bounciness; // 0x114
	float Friction; // 0x118
	float BounceVelocityStopSimulatingThreshold; // 0x11c
	float MinFrictionFraction; // 0x120
	FMulticastInlineDelegate OnProjectileBounce; // 0x128
	FMulticastInlineDelegate OnProjectileStop; // 0x138
	float HomingAccelerationMagnitude; // 0x148
	TWeakObjectPtr<USceneComponent> HomingTargetComponent; // 0x14c
	float MaxSimulationTimeStep; // 0x154
	int32_t MaxSimulationIterations; // 0x158
	int32_t BounceAdditionalIterations; // 0x15c
	float InterpLocationTime; // 0x160
	float InterpRotationTime; // 0x164
	float InterpLocationMaxLagDistance; // 0x168
	float InterpLocationSnapToTargetDistance; // 0x16c
};

struct UPortalWarsComboBoxString : UComboBoxString {
	UAkAudioEvent* PressedEvent; // 0xe00
	UAkAudioEvent* SelectionChangedEvent; // 0xe08
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4e0
};

struct USourceEffectRingModulationPreset : USoundEffectSourcePreset {
	FSourceEffectRingModulationSettings Settings; // 0xb0
};

struct UInterpGroupCamera : UInterpGroup {
	UCameraAnim* CameraAnimInst; // 0x50
	float CompressTolerance; // 0x58
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x68
};

struct UDistributionVectorConstantCurve : UDistributionVector {
	FInterpCurveVector ConstantCurve; // 0x38
	char bLockAxes : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes; // 0x54
};

struct UMovieSceneNiagaraVectorParameterTrack : UMovieSceneNiagaraParameterTrack {
	int32_t ChannelsUsed; // 0xb0
};

struct UPortalWarsKillStackEntryWidget : UUserWidget {
	UWidgetAnimation* FadeInAnimation; // 0x268
	UWidgetAnimation* FadeOutAnimation; // 0x270
	URichTextBlock* KilledText; // 0x278
	UTextBlock* DamageText; // 0x280
};

struct APortalWarsTeamStart : APlayerStart {
	int32_t SpawnTeam; // 0x250
	bool bNotForPlayers; // 0x254
	bool bNotForBots; // 0x255
	bool bInitialSpawn; // 0x256
};

struct UTextureLightProfile : UTexture2D {
	float Brightness; // 0x1a0
	float TextureMultiplier; // 0x1a4
};

struct UPortalWarsCareerWidget : UPortalWarsMenuWidget {
	UPortalWarsMenuWidget* StatsWidget; // 0x338
	UPortalWarsButtonWidget* StatsButton; // 0x340
	UPortalWarsMenuWidget* LeaderboardsWidget; // 0x348
	UPortalWarsButtonWidget* LeaderboardsButton; // 0x350
	UPortalWarsMenuWidget* ReplaysWidget; // 0x358
	UPortalWarsButtonWidget* ReplaysButton; // 0x360
};

struct UPortalWarsRoundHUDOverlayWidget : UUserWidget {
	UHorizontalBox* TopPlayerStatusHorizontalBox; // 0x260
	UHorizontalBox* BottomPlayerStatusHorizontalBox; // 0x268
};

struct USlider : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	float MinValue; // 0x11c
	float MaxValue; // 0x120
	FSliderStyle WidgetStyle; // 0x128
	EOrientation Orientation; // 0x468
	FLinearColor SliderBarColor; // 0x46c
	FLinearColor SliderHandleColor; // 0x47c
	bool IndentHandle; // 0x48c
	bool locked; // 0x48d
	bool MouseUsesStep; // 0x48e
	bool RequiresControllerLock; // 0x48f
	float StepSize; // 0x490
	bool IsFocusable; // 0x494
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x498
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x4a8
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x4b8
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x4c8
	FMulticastInlineDelegate OnValueChanged; // 0x4d8
};

struct UPortalWarsServerEntryWidget : UPortalWarsEntryWidget {
	UTextBlock* ServerNameText; // 0x420
	UTextBlock* ServerTypeText; // 0x428
	UTextBlock* MapText; // 0x430
	UImage* MapImage; // 0x438
	UTextBlock* ModeText; // 0x440
	UTextBlock* RegionText; // 0x448
	UWidget* PrivateRoot; // 0x450
	UImage* PrivateImage; // 0x458
	UTextBlock* PlayersText; // 0x460
	UTextBlock* SpectatorsText; // 0x468
	UWidget* CrossplayIndicator; // 0x470
	UPanelWidget* CreatedByPanel; // 0x478
	UPortalWarsPlayerEntryWidget* CreatedByEntryWidgetClass; // 0x480
	UWidgetSwitcher* BackgroundSwitcher; // 0x5e8
};

struct UComponentDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintComponentDelegateBinding> ComponentDelegateBindings; // 0x28
};

struct UMaterialExpressionTextureProperty : UMaterialExpression {
	FExpressionInput TextureObject; // 0x40
	EMaterialExposedTextureProperty Property; // 0x54
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x220
};

struct UParticleModulePivotOffset : UParticleModuleLocationBase {
	FVector2D PivotOffset; // 0x30
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct APhysicsVolume : AVolume {
	float TerminalVelocity; // 0x258
	int32_t Priority; // 0x25c
	float FluidFriction; // 0x260
	char bWaterVolume : 1; // 0x264
	char bPhysicsOnContact : 1; // 0x264
};

struct UGizmoArrowComponent : UGizmoBaseComponent {
	FVector Direction; // 0x470
	float Gap; // 0x47c
	float Length; // 0x480
	float Thickness; // 0x484
};

struct UStereoLayerShapeEquirect : UStereoLayerShape {
	FBox2D LeftUVRect; // 0x28
	FBox2D RightUVRect; // 0x3c
	FVector2D LeftScale; // 0x50
	FVector2D RightScale; // 0x58
	FVector2D LeftBias; // 0x60
	FVector2D RightBias; // 0x68
};

struct UMaterialExpressionStaticSwitch : UMaterialExpression {
	char DefaultValue : 1; // 0x40
	FExpressionInput A; // 0x44
	FExpressionInput B; // 0x58
	FExpressionInput Value; // 0x6c
};

struct UAkWwiseTreeSelector : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct UMovieSceneCameraShakeSourceTriggerSection : UMovieSceneSection {
	FMovieSceneCameraShakeSourceTriggerChannel Channel; // 0xe8
};

struct AIntervalGizmoActor : AGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x220
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x228
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x230
};

struct UNoiseField : UFieldNodeFloat {
	float MinRange; // 0xb0
	float MaxRange; // 0xb4
	FTransform Transform; // 0xc0
};

struct AAkAcousticPortal : AVolume {
	AkAcousticPortalState InitialState; // 0x258
	float ObstructionRefreshInterval; // 0x25c
	ECollisionChannel ObstructionCollisionChannel; // 0x260
};

struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x468
	float CapsuleRadius; // 0x46c
};

struct UPawnMovementComponent : UNavMovementComponent {
	APawn* PawnOwner; // 0x130
};

struct UPortalWarsLobbyPlayerEntryWidget : UPortalWarsPlayerEntryWidget {
	UWidget* AdminIndicator; // 0x640
	UWidget* SpectatorIndicator; // 0x648
	UPortalWarsPlayerEntryWidget* PlayerEntry; // 0x878
	UBorder* TeamBorder; // 0x880
	UImage* TeamImage; // 0x888
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x40
};

struct UPortalWarsTeamCheckboxWidget : UPortalWarsInputWidget {
	UPortalWarsCheckBoxWidget* GlobalCheckbox; // 0x368
	UPortalWarsCheckBoxWidget* AlphaCheckbox; // 0x370
	UPortalWarsCheckBoxWidget* BravoCheckbox; // 0x378
	UPortalWarsCheckBox* TeamCheckbox; // 0x380
	FKey GamepadKey; // 0x390
	UImage* StandardIcon; // 0x3a8
	UImage* GamepadIcon; // 0x3b0
	UWidgetSwitcher* ConsoleSwitcher; // 0x3b8
	FLinearColor IconDefaultColor; // 0x3c0
	FLinearColor IconHoveredColor; // 0x3d0
};

struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x30
	int32_t EventId; // 0x34
};

struct UAkLateReverbComponent : USceneComponent {
	char bEnable : 1; // 0x1f8
	UAkAuxBus* AuxBus; // 0x200
	FString AuxBusName; // 0x208
	float SendLevel; // 0x218
	float FadeRate; // 0x21c
	float Priority; // 0x220
	UAkLateReverbComponent* NextLowerPriorityComponent; // 0x228
};

struct UMaterialExpressionNamedRerouteDeclaration : UMaterialExpressionNamedRerouteBase {
	FExpressionInput Input; // 0x40
	FName Name; // 0x54
	FGuid VariableGuid; // 0x5c
};

struct UMovieSceneFadeSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
	FLinearColor FadeColor; // 0x188
	char bFadeAudio : 1; // 0x198
};

struct UAISenseConfig_Blueprint : UAISenseConfig {
	UAISense_Blueprint* Implementation; // 0x48
};

struct UEnvQueryTest_GameplayTags : UEnvQueryTest {
	FGameplayTagQuery TagQueryToMatch; // 0x1f8
	bool bUpdatedToUseQuery; // 0x240
	EGameplayContainerMatchType TagsToMatch; // 0x241
	FGameplayTagContainer GameplayTags; // 0x248
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UARComponent : USceneComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UMaterialBillboardComponent : UPrimitiveComponent {
	TArray<FMaterialSpriteElement> Elements; // 0x450
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x220
};

struct UPortalWarsLowAmmoIndicatorWidget : UUserWidget {
	UWidgetAnimation* WarningFlashAnimation; // 0x260
	UTextBlock* AmmoText; // 0x268
	UPortalWarsInputDecoratorWidget* ActionInput; // 0x270
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct APortalWarsMediaSoundActor : AActor {
	UMediaSoundComponent* MediaSoundComponent; // 0x220
	float VolumeMultiplier; // 0x228
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct AMagicLeapARPinInfoActor_C : AMagicLeapARPinInfoActorBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x238
	UStaticMeshComponent* Right; // 0x240
	UStaticMeshComponent* Forward; // 0x248
	UStaticMeshComponent* Up; // 0x250
	USphereComponent* ValidRadiusVisualizer; // 0x258
	USceneComponent* AxisRoot; // 0x260
	USceneComponent* VisualizerRoot; // 0x268
	UTextRenderComponent* TypeValue; // 0x270
	UTextRenderComponent* TransErrValue; // 0x278
	UTextRenderComponent* RotErrValue; // 0x280
	UTextRenderComponent* ConfidenceValue; // 0x288
	UTextRenderComponent* TransErrLabel; // 0x290
	UTextRenderComponent* RotErrLabel; // 0x298
	UTextRenderComponent* ConfidenceLabel; // 0x2a0
	UTextRenderComponent* PinIDValue; // 0x2a8
	USceneComponent* InfoRoot; // 0x2b0
	USceneComponent* Root; // 0x2b8
	float RotationSmoothSpeed; // 0x2c0
};

struct ULevelSequencePlayer : UMovieSceneSequencePlayer {
	FMulticastInlineDelegate OnCameraCut; // 0x6a0
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UCurveLinearColor : UCurveBase {
	FRichCurve FloatCurves[0x4]; // 0x30
	float AdjustHue; // 0x230
	float AdjustSaturation; // 0x234
	float AdjustBrightness; // 0x238
	float AdjustBrightnessCurve; // 0x23c
	float AdjustVibrance; // 0x240
	float AdjustMinAlpha; // 0x244
	float AdjustMaxAlpha; // 0x248
};

struct UPortalWarsRaceMatchResultWidget : UPortalWarsMatchResultWidget {
	UTextBlock* FinalTimeText; // 0x2a8
	UTextBlock* MapNameText; // 0x2b0
};

struct APWReplayPlayerController : APortalWarsPlayerController {
	APlayerState* ReplayPlayerState; // 0x6d0
	UPortalWarsReplayHUDOverlayWidget* ReplayHUDWidget; // 0x6e0
	TSoftClassPtr<UObject> ReplayHUDWidgetClass; // 0x6f8
	USpringArmComponent* CameraBoom; // 0x790
	UCameraComponent* FollowCamera; // 0x798
	FLinearColor AlphaTeamColor; // 0x7a0
	FLinearColor BravoTeamColor; // 0x7b0
};

struct UInterpTrackFloatBase : UInterpTrack {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UAsyncActionLoadPrimaryAssetList : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xe8
	FMovieSceneFloatChannel LeftCurve; // 0x188
	FMovieSceneFloatChannel RightCurve; // 0x228
	FMovieSceneFloatChannel BottomCurve; // 0x2c8
};

struct UConstantQNRTSettings : UAudioSynesthesiaNRTSettings {
	float StartingFrequency; // 0x28
	int32_t NumBands; // 0x2c
	float NumBandsPerOctave; // 0x30
	float AnalysisPeriod; // 0x34
	bool bDownmixToMono; // 0x38
	EConstantQFFTSizeEnum FFTSize; // 0x39
	EFFTWindowType WindowType; // 0x3a
	EAudioSpectrumType SpectrumType; // 0x3b
	float BandWidthStretch; // 0x3c
	EConstantQNormalizationEnum CQTNormalization; // 0x40
	float NoiseFloorDb; // 0x44
};

struct AChaosSolverActor : AActor {
	FChaosSolverConfiguration Properties; // 0x220
	float TimeStepMultiplier; // 0x288
	int32_t CollisionIterations; // 0x28c
	int32_t PushOutIterations; // 0x290
	int32_t PushOutPairIterations; // 0x294
	float ClusterConnectionFactor; // 0x298
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x29c
	bool DoGenerateCollisionData; // 0x29d
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2a0
	bool DoGenerateBreakingData; // 0x2b0
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x2b4
	bool DoGenerateTrailingData; // 0x2c4
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x2c8
	float MassScale; // 0x2d8
	bool bGenerateContactGraph; // 0x2dc
	bool bHasFloor; // 0x2dd
	float FloorHeight; // 0x2e0
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x2e4
	UBillboardComponent* SpriteComponent; // 0x2e8
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x308
};

struct UMaterialExpressionSpeedTree : UMaterialExpression {
	FExpressionInput GeometryInput; // 0x40
	FExpressionInput WindInput; // 0x54
	FExpressionInput LODInput; // 0x68
	FExpressionInput ExtraBendWS; // 0x7c
	ESpeedTreeGeometryType GeometryType; // 0x90
	ESpeedTreeWindType WindType; // 0x91
	ESpeedTreeLODType LODType; // 0x92
	float BillboardThreshold; // 0x94
	bool bAccurateWindVelocities; // 0x98
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct USkeletalMeshSimplificationSettings : UDeveloperSettings {
	FName SkeletalMeshReductionModuleName; // 0x38
};

struct UNiagaraPreviewAxis_InterpParamFloat : UNiagaraPreviewAxis_InterpParamBase {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UBlendSpaceBase : UAnimationAsset {
	bool bRotationBlendInMeshSpace; // 0x88
	float AnimLength; // 0x8c
	FInterpolationParameter InterpolationParam[0x3]; // 0x90
	float TargetWeightInterpolationSpeedPerSec; // 0xa8
	ENotifyTriggerMode NotifyTriggerMode; // 0xac
	TArray<FPerBoneInterpolation> PerBoneBlend; // 0xb0
	int32_t SampleIndexWithMarkers; // 0xc0
	TArray<FBlendSample> SampleData; // 0xc8
	TArray<FEditorElement> GridSamples; // 0xd8
	FBlendParameter BlendParameters[0x3]; // 0xe8
};

struct UBTDecorator_CheckGameMode : UBTDecorator {
	APortalWarsGameMode* GameModeClass; // 0x68
};

struct UNavLinkDefinition : UObject {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UPortalWarsLeaderboardEntryWidget : UPortalWarsPlayerEntryWidget {
	UTextBlock* PositionText; // 0x640
	UImage* PositionImage; // 0x648
	UWidgetSwitcher* PositionSwitcher; // 0x650
	TMap<int32_t, UTexture2D*> PositionImages; // 0x658
	FButtonStyle DefaultButtonStyle; // 0x6a8
	FButtonStyle PlacementButtonStyle; // 0x920
};

struct UMovieSceneSlomoSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
};

struct USynthComponent : USceneComponent {
	char bAutoDestroy : 1; // 0x1f8
	char bStopWhenOwnerDestroyed : 1; // 0x1f8
	char bAllowSpatialization : 1; // 0x1f8
	char bOverrideAttenuation : 1; // 0x1f8
	char bEnableBusSends : 1; // 0x1fc
	char bEnableBaseSubmix : 1; // 0x1fc
	char bEnableSubmixSends : 1; // 0x1fc
	USoundAttenuation* AttenuationSettings; // 0x200
	FSoundAttenuationSettings AttenuationOverrides; // 0x208
	USoundConcurrency* ConcurrencySettings; // 0x5a8
	TSet<USoundConcurrency*> ConcurrencySet; // 0x5b0
	USoundClass* SoundClass; // 0x600
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x608
	USoundSubmixBase* SoundSubmix; // 0x610
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x618
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x628
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x638
	char bIsUISound : 1; // 0x648
	char bIsPreviewSound : 1; // 0x648
	int32_t EnvelopeFollowerAttackTime; // 0x64c
	int32_t EnvelopeFollowerReleaseTime; // 0x650
	FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x658
	USynthSound* Synth; // 0x688
	UAudioComponent* AudioComponent; // 0x690
};

struct UParticleModuleLocationBoneSocket : UParticleModuleLocationBase {
	ELocationBoneSocketSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	TArray<FLocationBoneSocketInfo> SourceLocations; // 0x40
	ELocationBoneSocketSelectionMethod SelectionMethod; // 0x50
	char bUpdatePositionEachFrame : 1; // 0x54
	char bOrientMeshEmitters : 1; // 0x54
	char bInheritBoneVelocity : 1; // 0x54
	float InheritVelocityScale; // 0x58
	FName SkelMeshActorParamName; // 0x5c
	int32_t NumPreSelectedIndices; // 0x64
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct UPortalWarsTutorialVideoReminderWidget : UPortalWarsUserWidget {
	UWidgetAnimation* FadeInAnimation; // 0x2a8
	UWidgetAnimation* FadeOutAnimation; // 0x2b0
};

struct UGizmoCircleComponent : UGizmoBaseComponent {
	FVector Normal; // 0x470
	float Radius; // 0x47c
	float Thickness; // 0x480
	int32_t NumSides; // 0x484
	bool bViewAligned; // 0x488
	bool bOnlyAllowFrontFacingHits; // 0x489
};

struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x200
	float LDMaxDrawDistance; // 0x204
	float CachedMaxDrawDistance; // 0x208
	ESceneDepthPriorityGroup DepthPriorityGroup; // 0x20c
	ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x20d
	EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x20e
	ELightmapType LightmapType; // 0x20f
	char bUseMaxLODAsImposter : 1; // 0x210
	char bBatchImpostersAsInstances : 1; // 0x210
	char bNeverDistanceCull : 1; // 0x210
	char bAlwaysCreatePhysicsState : 1; // 0x210
	char bGenerateOverlapEvents : 1; // 0x211
	char bMultiBodyOverlap : 1; // 0x211
	char bTraceComplexOnMove : 1; // 0x211
	char bReturnMaterialOnMove : 1; // 0x211
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x211
	char bAllowCullDistanceVolume : 1; // 0x211
	char bHasMotionBlurVelocityMeshes : 1; // 0x211
	char bVisibleInReflectionCaptures : 1; // 0x211
	char bVisibleInRealTimeSkyCaptures : 1; // 0x212
	char bVisibleInRayTracing : 1; // 0x212
	char bRenderInMainPass : 1; // 0x212
	char bRenderInDepthPass : 1; // 0x212
	char bReceivesDecals : 1; // 0x212
	char bOwnerNoSee : 1; // 0x212
	char bOnlyOwnerSee : 1; // 0x212
	char bTreatAsBackgroundForOcclusion : 1; // 0x212
	char bUseAsOccluder : 1; // 0x213
	char bSelectable : 1; // 0x213
	char bForceMipStreaming : 1; // 0x213
	char bHasPerInstanceHitProxies : 1; // 0x213
	char CastShadow : 1; // 0x213
	char bAffectDynamicIndirectLighting : 1; // 0x213
	char bAffectDistanceFieldLighting : 1; // 0x213
	char bCastDynamicShadow : 1; // 0x213
	char bCastStaticShadow : 1; // 0x214
	char bCastVolumetricTranslucentShadow : 1; // 0x214
	char bCastContactShadow : 1; // 0x214
	char bSelfShadowOnly : 1; // 0x214
	char bCastFarShadow : 1; // 0x214
	char bCastInsetShadow : 1; // 0x214
	char bCastCinematicShadow : 1; // 0x214
	char bCastHiddenShadow : 1; // 0x214
	char bCastShadowAsTwoSided : 1; // 0x215
	char bLightAsIfStatic : 1; // 0x215
	char bLightAttachmentsAsGroup : 1; // 0x215
	char bExcludeFromLightAttachmentGroup : 1; // 0x215
	char bReceiveMobileCSMShadows : 1; // 0x215
	char bSingleSampleShadowFromStationaryLights : 1; // 0x215
	char bIgnoreRadialImpulse : 1; // 0x215
	char bIgnoreRadialForce : 1; // 0x215
	char bApplyImpulseOnDamage : 1; // 0x216
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x216
	char bFillCollisionUnderneathForNavmesh : 1; // 0x216
	char AlwaysLoadOnClient : 1; // 0x216
	char AlwaysLoadOnServer : 1; // 0x216
	char bUseEditorCompositing : 1; // 0x216
	char bRenderCustomDepth : 1; // 0x216
	char bVisibleInSceneCaptureOnly : 1; // 0x216
	char bHiddenInSceneCapture : 1; // 0x217
	EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x218
	ECanBeCharacterBase CanCharacterStepUpOn; // 0x21a
	FLightingChannels LightingChannels; // 0x21b
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x21c
	int32_t CustomDepthStencilValue; // 0x220
	FCustomPrimitiveData CustomPrimitiveData; // 0x228
	FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x238
	int32_t TranslucencySortPriority; // 0x250
	float TranslucencySortDistanceOffset; // 0x254
	int32_t VisibilityId; // 0x258
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x260
	int8_t VirtualTextureLodBias; // 0x270
	int8_t VirtualTextureCullMips; // 0x271
	int8_t VirtualTextureMinCoverage; // 0x272
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x273
	float LpvBiasMultiplier; // 0x278
	float BoundsScale; // 0x284
	TArray<AActor*> MoveIgnoreActors; // 0x298
	TArray<UPrimitiveComponent*> MoveIgnoreComponents; // 0x2a8
	FBodyInstance BodyInstance; // 0x2c8
	FMulticastSparseDelegate OnComponentHit; // 0x420
	FMulticastSparseDelegate OnComponentBeginOverlap; // 0x421
	FMulticastSparseDelegate OnComponentEndOverlap; // 0x422
	FMulticastSparseDelegate OnComponentWake; // 0x423
	FMulticastSparseDelegate OnComponentSleep; // 0x424
	FMulticastSparseDelegate OnBeginCursorOver; // 0x426
	FMulticastSparseDelegate OnEndCursorOver; // 0x427
	FMulticastSparseDelegate OnClicked; // 0x428
	FMulticastSparseDelegate OnReleased; // 0x429
	FMulticastSparseDelegate OnInputTouchBegin; // 0x42a
	FMulticastSparseDelegate OnInputTouchEnd; // 0x42b
	FMulticastSparseDelegate OnInputTouchEnter; // 0x42c
	FMulticastSparseDelegate OnInputTouchLeave; // 0x42d
	UPrimitiveComponent* LODParentPrimitive; // 0x448
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UMovieSceneEntitySystem : UObject {
	UMovieSceneEntitySystemLinker* Linker; // 0x28
};

struct UMaterialExpressionCosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
};

struct AOnlineBeacon : AActor {
	float BeaconConnectionInitialTimeout; // 0x228
	float BeaconConnectionTimeout; // 0x22c
	UNetDriver* NetDriver; // 0x230
};

struct APortalWarsVotingGameState : APortalWarsLobbyGameState {
	TArray<APortalWarsVoteInfo*> VoteInfoList; // 0x840
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPortalWarsDailyCheckInWidget : UPortalWarsMenuWidget {
	UPanelWidget* RewardPanel; // 0x338
	UPortalWarsCheckInRewardWidget* Day7Reward; // 0x340
	UWidgetSwitcher* ActionSwitcher; // 0x348
	UPortalWarsButtonWidget* ClaimButton; // 0x350
	UPortalWarsRedeemableButtonWidget* RepairButton; // 0x358
	UPortalWarsCheckInDialogWidget* CheckInDialogWidgetClass; // 0x360
	UTextBlock* CurrentDayText; // 0x368
};

struct UNavCollision : UNavCollisionBase {
	TArray<FNavCollisionCylinder> CylinderCollision; // 0x80
	TArray<FNavCollisionBox> BoxCollision; // 0x90
	UNavArea* AreaClass; // 0xa0
	char bGatherConvexGeometry : 1; // 0xa8
	char bCreateOnClient : 1; // 0xa8
};

struct UIpConnection : UNetConnection {
	float SocketErrorDisconnectDelay; // 0x1bf8
};

struct UParticleModuleLocationPrimitiveCylinder_Seeded : UParticleModuleLocationPrimitiveCylinder {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x120
};

struct USourceEffectPannerPreset : USoundEffectSourcePreset {
	FSourceEffectPannerSettings Settings; // 0x98
};

struct UMovieSceneNiagaraParameterTrack : UMovieSceneNiagaraTrack {
	FNiagaraVariable Parameter; // 0x88
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x358
	float OuterConeAngle; // 0x35c
};

struct UBTTask_SetTagCooldown : UBTTaskNode {
	FGameplayTag CooldownTag; // 0x70
	bool bAddToExistingDuration; // 0x78
	float CooldownDuration; // 0x7c
};

struct UMovieSceneCompiledData : UObject {
	FMovieSceneEvaluationTemplate EvaluationTemplate; // 0x28
	FMovieSceneSequenceHierarchy Hierarchy; // 0x188
	FMovieSceneEntityComponentField EntityComponentField; // 0x2a0
	FMovieSceneEvaluationField TrackTemplateField; // 0x390
	TArray<FFrameTime> DeterminismFences; // 0x3c0
	FGuid CompiledSignature; // 0x3d0
	FGuid CompilerVersion; // 0x3e0
	FMovieSceneSequenceCompilerMaskStruct AccumulatedMask; // 0x3f0
	FMovieSceneSequenceCompilerMaskStruct AllocatedMask; // 0x3f1
	EMovieSceneSequenceFlags AccumulatedFlags; // 0x3f2
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x38
	float Max; // 0x3c
};

struct UTextPropertyTestObject : UObject {
	FText DefaultedText; // 0x28
	FText UndefaultedText; // 0x40
	FText TransientText; // 0x58
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct UPhysicalAnimationComponent : UActorComponent {
	float StrengthMultiplyer; // 0xb0
	USkeletalMeshComponent* SkeletalMeshComponent; // 0xb8
};

struct UBTDecorator_Cooldown : UBTDecorator {
	float CooldownTime; // 0x68
};

struct UGizmoComponentWorldTransformSource : UGizmoBaseTransformSource {
	USceneComponent* Component; // 0x48
	bool bModifyComponentOnTransform; // 0x50
};

struct UUMGSequenceTickManager : UObject {
	TSet<TWeakObjectPtr<UUserWidget>> WeakUserWidgets; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x78
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxis; // 0x40
	FExpressionInput RotationAngle; // 0x54
	FExpressionInput PivotPoint; // 0x68
	FExpressionInput Position; // 0x7c
	float Period; // 0x90
};

struct APortalWarsOddballHUD : APortalWarsHUD {
	UPortalWarsOddballIndicator* BallIndicator; // 0x400
	UPortalWarsIndicatorWidget* BallIndicatorWidgetClass; // 0x408
};

struct USpringArmComponent : USceneComponent {
	float TargetArmLength; // 0x1f8
	FVector SocketOffset; // 0x1fc
	FVector TargetOffset; // 0x208
	float ProbeSize; // 0x214
	ECollisionChannel ProbeChannel; // 0x218
	char bDoCollisionTest : 1; // 0x21c
	char bUsePawnControlRotation : 1; // 0x21c
	char bInheritPitch : 1; // 0x21c
	char bInheritYaw : 1; // 0x21c
	char bInheritRoll : 1; // 0x21c
	char bEnableCameraLag : 1; // 0x21c
	char bEnableCameraRotationLag : 1; // 0x21c
	char bUseCameraLagSubstepping : 1; // 0x21c
	char bDrawDebugLagMarkers : 1; // 0x21d
	float CameraLagSpeed; // 0x220
	float CameraRotationLagSpeed; // 0x224
	float CameraLagMaxTimeStep; // 0x228
	float CameraLagMaxDistance; // 0x22c
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UMeshSelectionSet : USelectionSet {
	TArray<int32_t> Vertices; // 0x40
	TArray<int32_t> Edges; // 0x50
	TArray<int32_t> Faces; // 0x60
	TArray<int32_t> Groups; // 0x70
};

struct UARPlaneComponent : UARComponent {
	FARPlaneUpdatePayload ReplicatedPayload; // 0x280
};

struct UParticleModuleVelocityInheritParent : UParticleModuleVelocityBase {
	FRawDistributionVector Scale; // 0x38
};

struct UPortalWarsProgressionUpdateDialogWidget : UPortalWarsDialogWidget {
	UPortalWarsXPUpdateWidget* XPUpdateWidget; // 0x390
};

struct UARPin : UObject {
	UARTrackedGeometry* TrackedGeometry; // 0x28
	USceneComponent* PinnedComponent; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	FMulticastInlineDelegate OnARTrackingStateChanged; // 0xc0
	FMulticastInlineDelegate OnARTransformUpdated; // 0xd0
};

struct APortalWarsTutorialGameMode : APortalWarsGameMode {
	TArray<FDefaultInventoryClass> TutorialDefaultInventoryClasses; // 0x6a8
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x48
	float LoopEnd; // 0x4c
	float DurationAfterLoop; // 0x50
	int32_t LoopCount; // 0x54
	char bLoopIndefinitely : 1; // 0x58
	char bLoop : 1; // 0x58
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x60
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x68
	FRuntimeFloatCurve VolumeCurve; // 0x70
	FRuntimeFloatCurve PitchCurve; // 0xf8
	float PitchMin; // 0x180
	float PitchMax; // 0x184
	float VolumeMin; // 0x188
	float VolumeMax; // 0x18c
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	FGuid UsageId; // 0x2c
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1c8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x2b8
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2c8
};

struct UEnvQueryInstanceBlueprintWrapper : UObject {
	int32_t QueryID; // 0x30
	UEnvQueryItemType* ItemType; // 0x58
	int32_t OptionIndex; // 0x60
	FMulticastInlineDelegate OnQueryFinishedEvent; // 0x68
};

struct APortalWarsRaceGameMode : APortalWarsGameMode {
	UAkAudioEvent* NewRecordEvent; // 0x6e0
};

struct UMaterialInstanceConstant : UMaterialInstance {
	UPhysicalMaterialMask* PhysMaterialMask; // 0x360
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UCompressedImageSequenceProtocol : UImageSequenceProtocol {
	int32_t CompressionQuality; // 0xd8
};

struct USkyLightComponent : ULightComponentBase {
	bool bRealTimeCapture; // 0x228
	ESkyLightSourceType SourceType; // 0x229
	UTextureCube* Cubemap; // 0x230
	float SourceCubemapAngle; // 0x238
	int32_t CubemapResolution; // 0x23c
	float SkyDistanceThreshold; // 0x240
	bool bCaptureEmissiveOnly; // 0x244
	bool bLowerHemisphereIsBlack; // 0x245
	FLinearColor LowerHemisphereColor; // 0x248
	float OcclusionMaxDistance; // 0x258
	float Contrast; // 0x25c
	float OcclusionExponent; // 0x260
	float MinOcclusion; // 0x264
	FColor OcclusionTint; // 0x268
	char bCloudAmbientOcclusion : 1; // 0x26c
	float CloudAmbientOcclusionStrength; // 0x270
	float CloudAmbientOcclusionExtent; // 0x274
	float CloudAmbientOcclusionMapResolutionScale; // 0x278
	float CloudAmbientOcclusionApertureScale; // 0x27c
	EOcclusionCombineMode OcclusionCombineMode; // 0x280
	UTextureCube* BlendDestinationCubemap; // 0x338
};

struct ALight : AActor {
	ULightComponent* LightComponent; // 0x220
	char bEnabled : 1; // 0x228
};

struct APortalWarsContaminationHUD : APortalWarsRoundHUD {
	UPortalWarsContaminationHUDOverlayWidget* ContaminationHUDOverlayWidget; // 0x440
	UPortalWarsIndicatorWidget* ContaminationNameIndicatorWidgetClass; // 0x448
};

struct UNiagaraBakerSettings : UObject {
	float StartSeconds; // 0x28
	float DurationSeconds; // 0x2c
	int32_t FramesPerSecond; // 0x30
	char bPreviewLooping : 1; // 0x34
	FIntPoint FramesPerDimension; // 0x38
	TArray<FNiagaraBakerTextureSettings> OutputTextures; // 0x40
	ENiagaraBakerViewMode CameraViewportMode; // 0x50
	FVector CameraViewportLocation[0x7]; // 0x54
	FRotator CameraViewportRotation[0x7]; // 0xa8
	float CameraOrbitDistance; // 0xfc
	float CameraFOV; // 0x100
	float CameraOrthoWidth; // 0x104
	char bUseCameraAspectRatio : 1; // 0x108
	float CameraAspectRatio; // 0x10c
	char bRenderComponentOnly : 1; // 0x110
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct UInputBehaviorSet : UObject {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct UPacketHandlerProfileConfig : UObject {
	TArray<FString> Components; // 0x28
};

struct UWorldComposition : UObject {
	TArray<ULevelStreaming*> TilesStreaming; // 0x48
	double TilesStreamingTimeThreshold; // 0x58
	bool bLoadAllTilesDuringCinematic; // 0x60
	bool bRebaseOriginIn3DSpace; // 0x61
	float RebaseOriginDistance; // 0x64
};

struct UStaticMeshSimulationComponent : UActorComponent {
	bool Simulating; // 0xb8
	bool bNotifyCollisions; // 0xb9
	EObjectStateTypeEnum ObjectType; // 0xba
	float Mass; // 0xbc
	ECollisionTypeEnum CollisionType; // 0xc0
	EImplicitTypeEnum ImplicitType; // 0xc1
	int32_t MinLevelSetResolution; // 0xc4
	int32_t MaxLevelSetResolution; // 0xc8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xcc
	FVector InitialLinearVelocity; // 0xd0
	FVector InitialAngularVelocity; // 0xdc
	float DamageThreshold; // 0xe8
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xf0
	AChaosSolverActor* ChaosSolverActor; // 0xf8
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x100
	TArray<UPrimitiveComponent*> SimulatedComponents; // 0x120
};

struct USignificanceManager : UObject {
	FSoftClassPath SignificanceManagerClassName; // 0x108
};

struct UPortalWarsDOMHillIndicator : UPortalWarsHillIndicatorWidget {
	float DisplayCaptureProgress; // 0x2f0
	UProgressBar* OnScreenProgressBar; // 0x2f8
	UProgressBar* OffScreenProgressBar; // 0x300
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct UMotionControllerComponent : UPrimitiveComponent {
	int32_t PlayerIndex; // 0x450
	EControllerHand Hand; // 0x454
	FName MotionSource; // 0x458
	char bDisableLowLatencyUpdate : 1; // 0x460
	ETrackingStatus CurrentTrackingStatus; // 0x464
	bool bDisplayDeviceModel; // 0x465
	FName DisplayModelSource; // 0x468
	UStaticMesh* CustomDisplayMesh; // 0x470
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x478
	UPrimitiveComponent* DisplayComponent; // 0x4f0
};

struct APortalWarsRoundGameState : APortalWarsGameState {
	int32_t CurrentRound; // 0x7c8
	int32_t ReplicatedElapsedServerTime; // 0x7d0
	TArray<int32_t> TeamRoundScores; // 0x7d8
	TArray<int32_t> RoundWinners; // 0x7e8
	ACameraActor* IntermissionCam; // 0x800
};

struct USoundSourceBus : USoundWave {
	ESourceBusChannels SourceBusChannels; // 0x370
	float SourceBusDuration; // 0x374
	UAudioBus* AudioBus; // 0x378
	char bAutoDeactivateWhenSilent : 1; // 0x380
};

struct UPortalWarsCustomGameWidget : UPortalWarsMenuWidget {
	UPortalWarsHostMenuWidget* HostWidget; // 0x338
	UPortalWarsServerBrowserWidget* BrowserWidget; // 0x340
	bool bUseLAN; // 0x348
};

struct UBTNode : UObject {
	FString NodeName; // 0x30
	UBehaviorTree* TreeAsset; // 0x40
	UBTCompositeNode* ParentNode; // 0x48
};

struct APortalWarsTutorialCharacter : APortalWarsCharacter {
	int32_t StageID; // 0xda0
	int32_t GoalID; // 0xda4
	TArray<APortalWarsTutorialGoal*> Goals; // 0xda8
	int32_t HiddenUntilGoal; // 0xdb8
	TArray<APortalWall*> PortalWalls; // 0xdc0
};

struct UAnimBlueprint : UBlueprint {
	USkeleton* TargetSkeleton; // 0xa8
	TArray<FAnimGroupInfo> Groups; // 0xb0
	bool bUseMultiThreadedAnimationUpdate; // 0xc0
	bool bWarnAboutBlueprintUsage; // 0xc1
};

struct UInterpTrackColorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct APortalWarsPlayerController : APortalWarsBasePlayerController {
	APortal* leftPortal; // 0x608
	APortal* rightPortal; // 0x610
	APortalSceneCapture2D* leftPortalSceneCapture; // 0x618
	APortalSceneCapture2D* rightPortalSceneCapture; // 0x620
	APortalSceneCapture2D* portalSceneCaptureClass; // 0x628
	UTextureRenderTarget2D* leftPortalRenderTarget; // 0x630
	UTextureRenderTarget2D* rightPortalRenderTarget; // 0x638
	UPortalWarsDialogWidget* PauseMenu; // 0x648
	UPortalWarsPauseMenuWidget* PauseMenuWidgetClass; // 0x650
	float PredictionFudgeFactor; // 0x658
	float MaxPredictionPing; // 0x65c
	float MaxMeleePredictionPing; // 0x660
	TArray<FActorOriginAndExtent> actorOriginAndExtentList; // 0x668
	UPortalWarsKillcam* Killcam; // 0x6a8
	UMaterial* OutlinePPMaterial; // 0x6c0
};

struct UAkWinGDKInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkWinGDKAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct USourceEffectSimpleDelayPreset : USoundEffectSourcePreset {
	FSourceEffectSimpleDelaySettings Settings; // 0xa8
};

struct UParticleModuleLocation : UParticleModuleLocationBase {
	FRawDistributionVector StartLocation; // 0x30
	float DistributeOverNPoints; // 0x78
	float DistributeThreshold; // 0x7c
};

struct UPortalWarsPickupZoneAnimInstance : UAnimInstance {
	bool bIsActive; // 0x2b8
	APortalWarsGunPickupZone* PickupZone; // 0x2c0
};

struct UMaterialFunctionInterface : UObject {
	FGuid StateId; // 0x28
	EMaterialFunctionUsage MaterialFunctionUsage; // 0x38
};

struct UGizmoRectangleComponent : UGizmoBaseComponent {
	FVector DirectionX; // 0x470
	FVector DirectionY; // 0x47c
	float OffsetX; // 0x488
	float OffsetY; // 0x48c
	float LengthX; // 0x490
	float LengthY; // 0x494
	float Thickness; // 0x498
	char SegmentFlags; // 0x49c
};

struct UPhysicsThrusterComponent : USceneComponent {
	float ThrustStrength; // 0x1f8
};

struct AAkAmbientSound : AActor {
	UAkAudioEvent* AkAudioEvent; // 0x220
	UAkComponent* AkComponent; // 0x228
	bool StopWhenOwnerIsDestroyed; // 0x230
	bool AutoPost; // 0x231
};

struct UBTDecorator_TimeLimit : UBTDecorator {
	float TimeLimit; // 0x68
};

struct USynthSound : USoundWaveProcedural {
	USynthComponent* OwningSynthComponent; // 0x3c0
};

struct UPortalWarsChallengeButtonWidget : UPortalWarsEntryWidget {
	EChallengeType ChallengeType; // 0x420
	int32_t ChallengeGroupId; // 0x424
	UTextBlock* ChallengeProgressText; // 0x428
	UProgressBar* ChallengeProgressBar; // 0x430
	UWidgetSwitcher* CompleteIndicatorSwitcher; // 0x438
	UPortalWarsClaimChallengeIndicatorWidget* ClaimIndicator; // 0x440
	UTextBlock* TimeDescriptionText; // 0x450
	UTextBlock* NoteText; // 0x458
	UWidget* NoteRoot; // 0x460
	UImage* ThumbnailImage; // 0x468
	UTexture2D* DefaultImage; // 0x470
};

struct ABat : AGun {
	float BatteryPercentagePerSwing; // 0x698
	UParticleSystem* MeleeImpact1PFX; // 0x6a8
	UParticleSystem* MeleeImpact3PFX; // 0x6b0
	FLinearColor ElectricityInEffectsRangeColor; // 0x6b8
	FLinearColor ElectricityInMeleeRangeColor; // 0x6c8
	FLinearColor BatInEffectsRangeEmissiveColor; // 0x6d8
	FLinearColor BatInMeleeRangeEmissiveColor; // 0x6e8
	float EffectsRange; // 0x6f8
	float MaxOpenPercentInEffectsRange; // 0x700
	float FullyOpenInterpSpeed; // 0x704
	float FullyClosedInterpSpeed; // 0x708
	float EffectsRangeInterpSpeed; // 0x70c
	float PlateInterpToVisibleSpeed; // 0x710
	float PlateInterpToHiddenSpeed; // 0x714
	UMaterialInstanceDynamic* BatDynamicMaterial; // 0x718
	UMaterialInstanceDynamic* ElectricityDynamicMaterial; // 0x720
	UMaterialInstanceDynamic* PlatesDynamicMaterial; // 0x728
	UMaterialInstanceDynamic* ThirdPersonBatDynamicMaterial; // 0x730
	UMaterialInstanceDynamic* ThirdPersonElectricityDynamicMaterial; // 0x738
	UAkAudioEvent* BatAmbientStartEvent; // 0x748
	UAkAudioEvent* BatAmbientStopEvent; // 0x750
	UAkAudioEvent* BatOpenedSFX; // 0x758
	UAkAudioEvent* OutOfAmmoMeleeHitSound; // 0x760
	UAkAudioEvent* OutOfAmmoSwingEvent; // 0x768
	UForceFeedbackEffect* OutOfAmmoMeleeForceFeedback; // 0x778
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
	char bPostUpdateTickGroup : 1; // 0x228
	char bCurrentlyActive : 1; // 0x228
	FMulticastInlineDelegate OnParticleSpawn; // 0x230
	FMulticastInlineDelegate OnParticleBurst; // 0x240
	FMulticastInlineDelegate OnParticleDeath; // 0x250
	FMulticastInlineDelegate OnParticleCollide; // 0x260
};

struct UMaterialExpressionChannelMaskParameter : UMaterialExpressionVectorParameter {
	EChannelMaskParameterColor MaskChannel; // 0x70
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct UDistributionVectorConstant : UDistributionVector {
	FVector Constant; // 0x38
	char bLockAxes : 1; // 0x44
	EDistributionVectorLockFlags LockedAxes; // 0x48
};

struct UPortalWarsChatEntryWidget : UUserWidget {
	UTextBlock* PlayerNameText; // 0x260
	UImage* AvatarImage; // 0x268
	UBorder* AvatarBorder; // 0x270
	UTextBlock* ChatText; // 0x278
	FTextChatData ChatData; // 0x288
};

struct UInterpGroupInst : UObject {
	UInterpGroup* Group; // 0x28
	AActor* GroupActor; // 0x30
	TArray<UInterpTrackInst*> TrackInst; // 0x38
};

struct APortalWarsGGHUD : APortalWarsHUD {
	UPortalWarsGGHUDOverlayWidget* GGHUDOverlayWidget; // 0x400
	UPortalWarsGGHUDOverlayWidget* GGHUDOverlayWidgetClass; // 0x408
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct AGun : ABaseGun {
	EBodyPart BodyPartTargetForBots; // 0x2b8
	float TimeBetweenShotsForBots; // 0x2bc
	FWeaponData WeaponConfig; // 0x2c0
	APortalWarsPickup* PickupClass; // 0x2f0
	char gunValue; // 0x2f8
	int32_t CurrentAmmo; // 0x2fc
	int32_t CurrentAmmoInClip; // 0x300
	float EquipTime; // 0x318
	char bAutoEquip : 1; // 0x31c
	bool bCanFirePortalsWhileEquipped; // 0x324
	bool bIsChargingWeapon; // 0x340
	FRecoilData recoilConfig; // 0x344
	UCameraShakeBase* SpectatorCameraShake; // 0x380
	UAkAudioEvent* MeleeSwingEvent; // 0x3b8
	UAkAudioEvent* MeleeHitEvent; // 0x3c0
	bool isMeleeWeapon; // 0x3d4
	UDamageType* MeleeDamageType; // 0x3d8
	float MinTimeBeforeApplyingMeleeDmg; // 0x3e0
	float MeleeRangeScaleOverride; // 0x3e4
	float MeleeHitCameraShakeScale; // 0x3e8
	float MeleeCameraShakeDelay; // 0x3ec
	UCameraShakeBase* MeleeHitCameraShake; // 0x3f8
	UCameraShakeBase* MeleeCameraShake; // 0x400
	int32_t GunID; // 0x410
	FString InternalName; // 0x418
	FText DisplayName; // 0x428
	FText ShortDisplayName; // 0x440
	UTexture2D* GunIcon; // 0x458
	FAutoAimData AutoAimConfig; // 0x460
	EWeaponState CurrentState; // 0x498
	FShotInfo ShotInfo; // 0x499
	UForceFeedbackEffect* FireForceFeedback; // 0x4a0
	UForceFeedbackEffect* MeleeForceFeedback; // 0x4a8
	FWeaponAnimMontage EquipAnim; // 0x4b0
	FWeaponAnimMontage FireAnim; // 0x4c0
	FWeaponAnimMontage ReloadAnim; // 0x4d0
	FWeaponAnimMontage ReloadShortAnim; // 0x4e0
	TArray<FWeaponAnimMontage> MeleeAnims; // 0x4f0
	FWeaponAnimMontage ThrowGrenadeAnim; // 0x500
	FWeaponAnimMontage FirePortalAnim; // 0x510
	FWeaponAnimMontage SprintingFirePortalAnim; // 0x520
	FWeaponAnimMontage ClosePortalAnim; // 0x530
	FWeaponAnimMontage SprintingClosePortalAnim; // 0x540
	FWeaponAnimMontage InspectWeaponAnim; // 0x550
	FWeaponAnimList WeaponSpecificAnimations; // 0x560
	UAkAudioEvent* FireEvent; // 0x5c8
	UAkAudioEvent* OutOfAmmoEvent; // 0x5d0
	UAkAudioEvent* FireStopEvent; // 0x5d8
	UAkAudioEvent* ZoomInEvent; // 0x5e0
	UAkAudioEvent* ZoomOutEvent; // 0x5e8
	UAkAudioEvent* AmmoPickupEvent; // 0x5f0
	UAkAudioEvent* GunCollisionEvent; // 0x5f8
	UAkAudioEvent* EquipEvent; // 0x600
	UAmmoCounterWidgetComponent* AmmoCounter; // 0x610
	FFuzzyConfig FuzzyConfig[0x9]; // 0x680
};

struct UMagicLeapARPinComponent : USceneComponent {
	FString ObjectUID; // 0x1f8
	int32_t UserIndex; // 0x208
	EMagicLeapAutoPinType AutoPinType; // 0x20c
	bool bShouldPinActor; // 0x20d
	UMagicLeapARPinSaveGame* PinDataClass; // 0x210
	TSet<EMagicLeapARPinType> SearchPinTypes; // 0x218
	USphereComponent* SearchVolume; // 0x268
	FMulticastInlineDelegate OnPersistentEntityPinned; // 0x270
	FMulticastInlineDelegate OnPersistentEntityPinLost; // 0x280
	FMulticastInlineDelegate OnPinDataLoadAttemptCompleted; // 0x290
	FGuid PinnedCFUID; // 0x2a0
	USceneComponent* PinnedSceneComponent; // 0x2b0
	UMagicLeapARPinSaveGame* PinData; // 0x2b8
};

struct UDatasmithMaterialInstanceTemplate : UDatasmithObjectTemplate {
	TSoftObjectPtr<UMaterialInterface> ParentMaterial; // 0x30
	TMap<FName, float> ScalarParameterValues; // 0x58
	TMap<FName, FLinearColor> VectorParameterValues; // 0xa8
	TMap<FName, TSoftObjectPtr<UTexture>> TextureParameterValues; // 0xf8
	FDatasmithStaticParameterSetTemplate StaticParameters; // 0x148
};

struct AAmbianceVolume : ATriggerVolume {
	UAkAudioEvent* EventOnEnter; // 0x258
	UAkAudioEvent* EventOnExit; // 0x260
	FString StateGroup; // 0x268
	FString StateOnEnter; // 0x278
	FString StateOnExit; // 0x288
};

struct ATriggerBase : AActor {
	UShapeComponent* CollisionComponent; // 0x220
};

struct UTextureLODSettings : UObject {
	TArray<FTextureLODGroup> TextureLODGroups; // 0x28
};

struct UMovieSceneCameraAnimTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x80
};

struct UEnvQueryGenerator_SimpleGrid : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue GridSize; // 0xb8
	FAIDataProviderFloatValue SpaceBetween; // 0xf0
	UEnvQueryContext* GenerateAround; // 0x128
};

struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x38
};

struct UPortalWarsGGNotificationWidget : UUserWidget {
	UImage* KillImage; // 0x260
	UHorizontalBox* RootHorizontalBox; // 0x268
	UTexture2D* BlueKillImage; // 0x270
};

struct UPortalWarsGamepadBindingMissingDialogWidget : UPortalWarsDialogWidget {
	FMulticastInlineDelegate OnWarningButtonClickedDelegate; // 0x390
	UPortalWarsButtonWidget* AcceptButton; // 0x3a0
	UTextBlock* TitleText; // 0x3a8
	UTextBlock* SubtitleText; // 0x3b0
	UTextBlock* MissingText; // 0x3b8
};

struct ULightmassPrimitiveSettingsObject : UObject {
	FLightmassPrimitiveSettings LightmassSettings; // 0x28
};

struct USoundSubmixBase : UObject {
	TArray<USoundSubmixBase*> ChildSubmixes; // 0x28
};

struct UPortalWarsInputDecoratorWidget : UPortalWarsUserWidget {
	UPanelWidget* MainPanel; // 0x2a8
	FText RichText; // 0x2b0
	TArray<FString> InputActions; // 0x2c8
	bool KeyboardBrackets; // 0x2d8
	FVector2D IconSize; // 0x2dc
	UDataTable* TextStyleSet; // 0x2e8
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct APortalWarsGameState : APortalWarsBaseGameState {
	UAnnouncerInterface* AnnouncerInterface; // 0x6d0
	UPortalWarsCustomAntiCheat* AntiCheat; // 0x6d8
	char bTeamGame : 1; // 0x6f8
	TArray<int32_t> TeamScores; // 0x700
	TArray<APortalWarsPickup*> Pickups; // 0x780
	TArray<AOutOfBoundsVolume*> OOBVolumes; // 0x790
	TArray<APlayAreaVolume*> PlayAreaVolumes; // 0x7a0
	APortalWarsCrowd* Crowd; // 0x7b0
	TArray<APortal*> Portals; // 0x7b8
};

struct UMaterialExpressionSceneDepth : UMaterialExpression {
	EMaterialSceneAttributeInputMode InputMode; // 0x40
	FExpressionInput Input; // 0x44
	FExpressionInput Coordinates; // 0x58
	FVector2D ConstInput; // 0x6c
};

struct ACullDistanceVolume : AVolume {
	TArray<FCullDistanceSizePair> CullDistances; // 0x258
	char bEnabled : 1; // 0x268
};

struct UPortalWarsRecentPlayersWidget : UPortalWarsMenuWidget {
	UPortalWarsButtonWidget* RefreshButton; // 0x340
	UPanelWidget* RecentPlayersPanel; // 0x348
	UPortalWarsSocialPlayerEntry* PlayerEntryWidgetClass; // 0x350
	UPortalWarsPlayerActionsWidget* PlayerActionsWidgetClass; // 0x358
	UTextBlock* ErrorText; // 0x368
};

struct UTcpMessagingSettings : UObject {
	bool EnableTransport; // 0x28
	FString ListenEndpoint; // 0x30
	TArray<FString> ConnectToEndpoints; // 0x40
	int32_t ConnectionRetryDelay; // 0x50
	bool bStopServiceWhenAppDeactivates; // 0x54
};

struct UFoliageType : UObject {
	FGuid UpdateGuid; // 0x28
	float Density; // 0x38
	float DensityAdjustmentFactor; // 0x3c
	float Radius; // 0x40
	bool bSingleInstanceModeOverrideRadius; // 0x44
	float SingleInstanceModeRadius; // 0x48
	EFoliageScaling Scaling; // 0x4c
	FFloatInterval ScaleX; // 0x50
	FFloatInterval ScaleY; // 0x58
	FFloatInterval ScaleZ; // 0x60
	FFoliageVertexColorChannelMask VertexColorMaskByChannel[0x4]; // 0x68
	FoliageVertexColorMask VertexColorMask; // 0x98
	float VertexColorMaskThreshold; // 0x9c
	char VertexColorMaskInvert : 1; // 0xa0
	FFloatInterval ZOffset; // 0xa4
	char AlignToNormal : 1; // 0xac
	float AlignMaxAngle; // 0xb0
	char RandomYaw : 1; // 0xb4
	float RandomPitchAngle; // 0xb8
	FFloatInterval GroundSlopeAngle; // 0xbc
	FFloatInterval Height; // 0xc4
	TArray<FName> LandscapeLayers; // 0xd0
	float MinimumLayerWeight; // 0xe0
	TArray<FName> ExclusionLandscapeLayers; // 0xe8
	float MinimumExclusionLayerWeight; // 0xf8
	FName LandscapeLayer; // 0xfc
	char CollisionWithWorld : 1; // 0x104
	FVector CollisionScale; // 0x108
	FBoxSphereBounds MeshBounds; // 0x114
	FVector LowBoundOriginRadius; // 0x130
	EComponentMobility Mobility; // 0x13c
	FInt32Interval CullDistance; // 0x140
	char bEnableStaticLighting : 1; // 0x148
	char CastShadow : 1; // 0x148
	char bAffectDynamicIndirectLighting : 1; // 0x148
	char bAffectDistanceFieldLighting : 1; // 0x148
	char bCastDynamicShadow : 1; // 0x148
	char bCastStaticShadow : 1; // 0x148
	char bCastShadowAsTwoSided : 1; // 0x148
	char bReceivesDecals : 1; // 0x148
	char bOverrideLightMapRes : 1; // 0x149
	int32_t OverriddenLightMapRes; // 0x14c
	ELightmapType LightmapType; // 0x150
	char bUseAsOccluder : 1; // 0x154
	char bVisibleInRayTracing : 1; // 0x158
	char bEvaluateWorldPositionOffset : 1; // 0x158
	FBodyInstance BodyInstance; // 0x160
	EHasCustomNavigableGeometry CustomNavigableGeometry; // 0x2b8
	FLightingChannels LightingChannels; // 0x2b9
	char bRenderCustomDepth : 1; // 0x2bc
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x2c0
	int32_t CustomDepthStencilValue; // 0x2c4
	int32_t TranslucencySortPriority; // 0x2c8
	float CollisionRadius; // 0x2cc
	float ShadeRadius; // 0x2d0
	int32_t NumSteps; // 0x2d4
	float InitialSeedDensity; // 0x2d8
	float AverageSpreadDistance; // 0x2dc
	float SpreadVariance; // 0x2e0
	int32_t SeedsPerStep; // 0x2e4
	int32_t DistributionSeed; // 0x2e8
	float MaxInitialSeedOffset; // 0x2ec
	bool bCanGrowInShade; // 0x2f0
	bool bSpawnsInShade; // 0x2f1
	float MaxInitialAge; // 0x2f4
	float MaxAge; // 0x2f8
	float OverlapPriority; // 0x2fc
	FFloatInterval ProceduralScale; // 0x300
	FRuntimeFloatCurve ScaleCurve; // 0x308
	int32_t ChangeCount; // 0x390
	char ReapplyDensity : 1; // 0x394
	char ReapplyRadius : 1; // 0x394
	char ReapplyAlignToNormal : 1; // 0x394
	char ReapplyRandomYaw : 1; // 0x394
	char ReapplyScaling : 1; // 0x394
	char ReapplyScaleX : 1; // 0x394
	char ReapplyScaleY : 1; // 0x394
	char ReapplyScaleZ : 1; // 0x394
	char ReapplyRandomPitchAngle : 1; // 0x395
	char ReapplyGroundSlope : 1; // 0x395
	char ReapplyHeight : 1; // 0x395
	char ReapplyLandscapeLayers : 1; // 0x395
	char ReapplyZOffset : 1; // 0x395
	char ReapplyCollisionWithWorld : 1; // 0x395
	char ReapplyVertexColorMask : 1; // 0x395
	char bEnableDensityScaling : 1; // 0x395
	char bEnableDiscardOnLoad : 1; // 0x396
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x398
	int32_t VirtualTextureCullMips; // 0x3a8
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x3ac
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	TArray<FLandscapeMaterialTextureStreamingInfo> TextureStreamingInfo; // 0x368
	char bIsLayerThumbnail : 1; // 0x378
	char bDisableTessellation : 1; // 0x378
	char bMobile : 1; // 0x378
	char bEditorToolUsage : 1; // 0x378
};

struct AProjectileGun : AGun {
	FProjectileWeaponData ProjectileConfig; // 0x698
	float LocalHitDetectionDuration; // 0x6b8
	bool bSpawnsLocalProjectiles; // 0x6bc
	TArray<AProjectile*> LocalProjectiles; // 0x6c8
};

struct UGizmoWorldAxisSource : UObject {
	FVector Origin; // 0x30
	int32_t AxisIndex; // 0x3c
};

struct ALODActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x220
	TMap<FHLODInstancingKey, UInstancedStaticMeshComponent*> InstancedStaticMeshComponents; // 0x228
	UHLODProxy* Proxy; // 0x278
	FName Key; // 0x280
	float LODDrawDistance; // 0x288
	int32_t LODLevel; // 0x28c
	TArray<AActor*> SubActors; // 0x290
	char CachedNumHLODLevels; // 0x2a0
};

struct APortalWarsPlayerState : APlayerState {
	char TeamNum; // 0x338
	char KillStreak; // 0x358
	char MultiKillCounter; // 0x359
	TMap<APortalWarsPlayerState*, float> DamagePlayers; // 0x3b8
	FPlayerStatsInfo_InDepth PlayerStats; // 0x4f8
	FEndGamePlayerInfo PostGameStats; // 0x5c0
	bool bIsAdmin; // 0x800
	TArray<FCustomizationId> PlayerCustomizations; // 0x808
	TArray<UObject*> CachedCustomizationObjects; // 0x830
	UTexture* PlayerAvatar; // 0x878
	UTexture* SavedPlayerAvatar; // 0x880
	UTexture* SavedBotAvatar; // 0x888
	TArray<FUserRankInfo> PlayerRanks; // 0x890
	FUserProgressionInfo Progression; // 0x8b8
	FUserDailyStreakInfo DailyStreak; // 0x8d8
	bool bHideNames; // 0x948
	char bAnonymousMode : 1; // 0x949
	char bPartyChatOnly : 1; // 0x949
	APortalWarsCharacter* CachedCharacter; // 0x970
	char bQuitter : 1; // 0x978
	int32_t InactiveTime; // 0x97c
	bool bJoinedInProgress; // 0x980
	bool bIsFlagged; // 0x9ad
	bool bIsReadyForNextMatch; // 0x9c8
	FBotProfileData DefaultProfile; // 0xa00
	float SimulatedFOV; // 0xac0
};

struct UPortalWarsChallengesInspectWidget : UPortalWarsInspectWidget {
	UWidget* ItemsRoot; // 0x3c0
	UPortalWarsCustomScrollWidget* ItemsPanel; // 0x3c8
	UPortalWarsChallengeEntryWidget* ItemEntryWidgetClass; // 0x3d0
	UPortalWarsChallengeEntryWidget* ChallengeEntry; // 0x3d8
};

struct APortalWarsTeabagZone : AActor {
	APlayerState* KilledPlayerState; // 0x220
	APortalWarsCharacter* KilledCharacter; // 0x228
	UStaticMeshComponent* TeabagMesh; // 0x250
};

struct UMasterAudioSubmixCaptureProtocol : UMovieSceneAudioCaptureProtocolBase {
	FString Filename; // 0x58
};

struct ARailGun : AMultiKillGun {
	FWeaponAnimMontage ChargeAnim; // 0x780
	FWeaponAnimMontage DischargeAnim; // 0x790
	UAkAudioEvent* ChargeStartEvent; // 0x7a0
	UAkAudioEvent* ChargeStopEvent; // 0x7a8
	UAkAudioEvent* DischargeEvent; // 0x7b0
	UParticleSystem* ChargeFX_1P; // 0x7b8
	UParticleSystem* ChargeFX_3P; // 0x7c0
	UParticleSystemComponent* ChargePSC_1P; // 0x7c8
	UParticleSystemComponent* ChargePSC_3P; // 0x7d0
	float timeToCharge; // 0x7d8
	float BatteryPercentagePerShot; // 0x7dc
	UAmmoCounterWidgetComponent* ChargeCounter; // 0x7e0
};

struct UPortalWarsCareerProgressWidget : UPortalWarsUserWidget {
	UTextBlock* PlayerNameText; // 0x2a8
	UImage* AvatarImage; // 0x2b0
	UPortalWarsProgressionIconWidget* ProgressionLevelIcon; // 0x2b8
	UTextBlock* ProgressionLevelText; // 0x2c0
	UProgressBar* ProgressionProgressBar; // 0x2c8
	UTextBlock* ProgressionLevelProgressText; // 0x2d0
	UTextBlock* ProgressionLevelTotalText; // 0x2d8
	UWidget* ProgressionProgressRoot; // 0x2e0
	UPortalWarsProgressionIconWidget* BattlePassLevelIcon; // 0x2f8
	UTextBlock* BattlePassLevelText; // 0x300
	UProgressBar* BattlePassProgressBar; // 0x308
	UTextBlock* BattlePassLevelProgressText; // 0x310
	UTextBlock* BattlePassLevelTotalText; // 0x318
	UWidget* BattlePassProgressRoot; // 0x320
	UWidgetSwitcher* BattlePassSwitcher; // 0x328
	UTextBlock* RankText; // 0x330
	UImage* RankIcon; // 0x338
	UWidget* RankRoot; // 0x340
	bool bShowRank; // 0x348
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x38
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueId; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UPortalWarsGateIndicatorWidget : UPortalWarsIndicatorWidget {
	UWidget* Pointer; // 0x2b8
	FVector Offset; // 0x2c0
};

struct UPortalWarsItemShopInspectWidget : UPortalWarsInspectWidget {
	UWidget* ItemsRoot; // 0x3c0
	UPortalWarsCustomScrollWidget* ItemsPanel; // 0x3c8
	UPortalWarsItemShopEntry* ItemEntryWidgetClass; // 0x3d0
	UPortalWarsItemShopPurchasePanel* PurchasePanel; // 0x3d8
	UPortalWarsItemShopPurchasePanel* IndividualPurchasePanel; // 0x3e0
	UWidget* PurchasableDescriptionRoot; // 0x3e8
	UTextBlock* PurchasableDescriptionText; // 0x3f0
	UPortalWarsItemPurchaseDialog* PurchaseDialogWidgetClass; // 0x3f8
};

struct UParticleModuleAccelerationConstant : UParticleModuleAccelerationBase {
	FVector Acceleration; // 0x38
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xf0
	FMovieSceneFloatChannel Translation[0x2]; // 0xf8
	FMovieSceneFloatChannel Rotation; // 0x238
	FMovieSceneFloatChannel Scale[0x2]; // 0x2d8
	FMovieSceneFloatChannel Shear[0x2]; // 0x418
};

struct UMaterialExpressionRotator : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	float CenterX; // 0x68
	float CenterY; // 0x6c
	float Speed; // 0x70
	uint32_t ConstCoordinate; // 0x74
};

struct AOddballItem : ASpecialItem {
	APortalWarsOddballGameState* OddballGameState; // 0x6a0
};

struct UInterpTrackSound : UInterpTrackVectorBase {
	TArray<FSoundTrackKey> Sounds; // 0x90
	char bPlayOnReverse : 1; // 0xa0
	char bContinueSoundOnMatineeEnd : 1; // 0xa0
	char bSuppressSubtitles : 1; // 0xa0
	char bTreatAsDialogue : 1; // 0xa0
	char bAttach : 1; // 0xa0
};

struct UPortalWarsStatsPlaylistWidget : UPortalWarsMenuWidget {
	UPortalWarsStatsEntryWidget* TotalStats; // 0x338
	UTextBlock* PlayerNameText; // 0x340
	UImage* AvatarImage; // 0x348
	UTextBlock* RankNameText; // 0x350
	UImage* RankIcon; // 0x358
	UTextBlock* RankXPText; // 0x360
	UWidget* RankRoot; // 0x368
	UTextBlock* PlaylistText; // 0x370
	UPortalWarsButtonWidget* ChangePlaylistButton; // 0x378
	UComboBoxString* PlaylistComboBox; // 0x380
	EPlaylistType PlaylistType; // 0x438
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x40
	FGuid ExpressionGUID; // 0x50
};

struct UBTTask_RunEQSQuery : UBTTask_BlackboardBase {
	UEnvQuery* QueryTemplate; // 0x98
	TArray<FEnvNamedValue> QueryParams; // 0xa0
	TArray<FAIDynamicParam> QueryConfig; // 0xb0
	EEnvQueryRunMode RunMode; // 0xc0
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0xc8
	bool bUseBBKey; // 0xf0
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0xf8
};

struct AARSharedWorldGameState : AGameState {
	TArray<char> PreviewImageData; // 0x290
	TArray<char> ARWorldData; // 0x2a0
	int32_t PreviewImageBytesTotal; // 0x2b0
	int32_t ARWorldBytesTotal; // 0x2b4
	int32_t PreviewImageBytesDelivered; // 0x2b8
	int32_t ARWorldBytesDelivered; // 0x2bc
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct UMovieSceneCinematicShotSection : UMovieSceneSubSection {
	FString ShotDisplayName; // 0x168
	FText DisplayName; // 0x178
};

struct AGameStateBase : AInfo {
	AGameModeBase* GameModeClass; // 0x220
	AGameModeBase* AuthorityGameMode; // 0x228
	ASpectatorPawn* SpectatorClass; // 0x230
	TArray<APlayerState*> PlayerArray; // 0x238
	bool bReplicatedHasBegunPlay; // 0x248
	float ReplicatedWorldTimeSeconds; // 0x24c
	float ServerWorldTimeSecondsDelta; // 0x250
	float ServerWorldTimeSecondsUpdateFrequency; // 0x254
};

struct UPortalWarsDOMControlledHillWidget : UUserWidget {
	UTextBlock* HillLetterText; // 0x260
	UImage* HillImage; // 0x268
	float PaddingBetweenEntries; // 0x270
};

struct UAnimBoneCompressionCodec : UObject {
	FString Description; // 0x28
};

struct UInputKeyDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputKeyDelegateBinding> InputKeyDelegateBindings; // 0x28
};

struct UCrowdFollowingComponent : UPathFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UShowLoginUICallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UNiagaraParameterCollectionInstance : UObject {
	UNiagaraParameterCollection* Collection; // 0x28
	TArray<FNiagaraVariable> OverridenParameters; // 0x30
	FNiagaraParameterStore ParameterStorage; // 0x40
};

struct APhysicsThruster : ARigidBodyBase {
	UPhysicsThrusterComponent* ThrusterComponent; // 0x220
};

struct UPortalWarsCustomGameFiltersWidget : UPortalWarsDialogWidget {
	UPortalWarsButtonWidget* ApplyButton; // 0x390
	FPWTableRowBase AnyOption; // 0x398
	UPortalWarsTextInputWidget* ServerName; // 0x410
	UPortalWarsRadioGroupWidget* RegionRadioGroup; // 0x418
	UPortalWarsGlobalCarouselWidget* MapSelector; // 0x420
	UPortalWarsGlobalCarouselWidget* ModeSelector; // 0x428
	UPortalWarsTextCarouselWidget* LobbySizeSelector; // 0x430
	TArray<FText> LobbySizeOptions; // 0x438
	UPortalWarsCheckBoxWidget* PrivateCheckBox; // 0x448
	UPortalWarsCheckBoxWidget* FullCheckBox; // 0x450
};

struct UPortalWarsCurrencyStoreWidget : UPortalWarsItemShopSectionWidget {
	UPortalWarsButtonWidget* RetryButton; // 0x398
	UWidgetSwitcher* StoreSwitcher; // 0x3a0
	TArray<UPortalWarsCurrencyStoreEntry*> StoreEntries; // 0x3a8
	UPortalWarsCurrencyPurchaseDialog* CurrencyDialogWidgetClass; // 0x3c0
};

struct UParticleModuleVelocity : UParticleModuleVelocityBase {
	FRawDistributionVector StartVelocity; // 0x38
	FRawDistributionFloat StartVelocityRadial; // 0x80
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UPortalWarsRaceHUDOverlay : UUserWidget {
	URaceBookmarkWidget* BookmarkWidget; // 0x260
	UTextBlock* CurrentGateNumText; // 0x268
	UTextBlock* MapNameText; // 0x270
	UTextBlock* CurrentTimeText; // 0x278
	UTextBlock* RecordHolderNameText; // 0x280
	UTextBlock* RecordTimeText; // 0x288
	UWidget* RaceRoot; // 0x2b8
};

struct UMaterialExpressionDDY : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UAnimStreamable : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	EAnimInterpolationType Interpolation; // 0xac
	FName RetargetSource; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xc8
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd0
	bool bEnableRootMotion; // 0xd8
	ERootMotionRootLock RootMotionRootLock; // 0xd9
	bool bForceRootLock; // 0xda
	bool bUseNormalizedRootMotionScale; // 0xdb
};

struct UPortalWarsGamepadBindingCustomizeButtonWidget : UPortalWarsUserWidget {
	FMulticastInlineDelegate OnCustomizeGamepadBinds; // 0x2a8
	UPortalWarsButton* CustomizeButton; // 0x2b8
	UTextBlock* ValueText; // 0x2c0
	UWidget* HoveredIndicator; // 0x2c8
	FSlateColor StandardColor; // 0x2d0
	FSlateColor ActiveColor; // 0x2f8
};

struct UPortalWarsScoreboardPlayerWidget : UPortalWarsUserWidget {
	UImage* BackgroundImage; // 0x2a8
	UTexture2D* BlueBackgroundImage; // 0x2b0
	UTexture2D* RedBackgroundImage; // 0x2b8
	UTexture2D* SelfBackgroundImage; // 0x2c0
	UImage* ArmorCustomizationImage; // 0x2c8
	UTextBlock* ScoreText; // 0x2d0
	UTextBlock* KillsText; // 0x2d8
	UTextBlock* DeathsText; // 0x2e0
	UTextBlock* DamageText; // 0x2e8
	UWidget* StatsRoot; // 0x2f0
	UImage* PrimaryWeaponImage; // 0x2f8
	UImage* SecondaryWeaponImage; // 0x300
	UWidget* InventoryPanel; // 0x308
	USizeBox* PrimaryWeaponImageSizeBox; // 0x310
	USizeBox* SecondaryWeaponImageSizeBox; // 0x318
	UTextBlock* RespawnTimeText; // 0x320
	UWidget* DeathRoot; // 0x328
	UWidget* PlayerRoot; // 0x330
	UImage* ZombieImage; // 0x338
	UTexture2D* BlueZombieImage; // 0x340
	UTexture2D* RedZombieImage; // 0x348
	UPortalWarsPlayerEntryWidget* PlayerEntry; // 0x350
};

struct UMRMeshComponent : UPrimitiveComponent {
	UMaterialInterface* Material; // 0x460
	UMaterialInterface* WireframeMaterial; // 0x468
	bool bCreateMeshProxySections; // 0x470
	bool bUpdateNavMeshOnMeshUpdate; // 0x471
	bool bNeverCreateCollisionMesh; // 0x472
	UBodySetup* CachedBodySetup; // 0x478
	TArray<UBodySetup*> BodySetups; // 0x480
};

struct UAnimationSharingManager : UObject {
	TArray<USkeleton*> Skeletons; // 0x28
	TArray<UAnimSharingInstance*> PerSkeletonData; // 0x38
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct UFileMediaSource : UBaseMediaSource {
	FString FilePath; // 0x88
	bool PrecacheFile; // 0x98
};

struct UARPoseComponent : UARComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression {
	FExpressionInput TextureSize; // 0x40
	float ConstWidth; // 0x54
	float ConstHeight; // 0x58
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UPortalWarsNumericCarouselWidget : UPortalWarsInputCarouselWidget {
	int32_t Value; // 0x3a0
	int32_t MinValue; // 0x3a4
	int32_t MaxValue; // 0x3a8
	int32_t StepSize; // 0x3ac
	bool bAllowWrap; // 0x3b0
	UTextBlock* ConsoleValueText; // 0x3b8
	UIntegerSpinBox* SpinBox; // 0x3c0
	bool bDisplayAsTime; // 0x3c8
};

struct UMaterialExpressionTextureSampleParameterSubUV : UMaterialExpressionTextureSampleParameter2D {
	char bBlend : 1; // 0x80
};

struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
	char bEnabled : 1; // 0x38
};

struct AFieldSystemActor : AActor {
	UFieldSystemComponent* FieldSystemComponent; // 0x220
};

struct USceneCaptureComponent : USceneComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x1f8
	ESceneCaptureSource CaptureSource; // 0x1f9
	char bCaptureEveryFrame : 1; // 0x1fa
	char bCaptureOnMovement : 1; // 0x1fa
	bool bAlwaysPersistRenderingState; // 0x1fb
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x200
	TArray<AActor*> HiddenActors; // 0x210
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x220
	TArray<AActor*> ShowOnlyActors; // 0x230
	float LODDistanceFactor; // 0x240
	float MaxViewDistanceOverride; // 0x244
	int32_t CaptureSortPriority; // 0x248
	bool bUseRayTracingIfEnabled; // 0x24c
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x250
	FString ProfilingEventName; // 0x2a0
};

struct UInterpTrackInstDirector : UInterpTrackInst {
	AActor* OldViewTarget; // 0x28
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	TArray<FTransform> RetargetSourceAssetReferencePose; // 0x170
	EAnimInterpolationType Interpolation; // 0x180
	bool bEnableRootMotion; // 0x181
	ERootMotionRootLock RootMotionRootLock; // 0x182
	bool bForceRootLock; // 0x183
	bool bUseNormalizedRootMotionScale; // 0x184
	bool bRootMotionSettingsCopiedFromMontage; // 0x185
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x188
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1b0
};

struct UTextureRenderTargetVolume : UTextureRenderTarget {
	int32_t SizeX; // 0x180
	int32_t SizeY; // 0x184
	int32_t SizeZ; // 0x188
	FLinearColor ClearColor; // 0x18c
	EPixelFormat OverrideFormat; // 0x19c
	char bHDR : 1; // 0x19d
	char bForceLinearGamma : 1; // 0x19d
};

struct ABurstLineTraceGun : ALineTraceGun {
	FBurstLineTraceGunData BurstLineTraceGunConfig; // 0x768
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x48
};

struct UPortalWarsRewardEntryWidget : UPortalWarsEntryWidget {
	UTextBlock* RewardTitleText; // 0x420
	UTextBlock* RewardValueText; // 0x428
	UTextBlock* RewardDescriptionText; // 0x430
	UImage* RarityIcon; // 0x438
	UImage* RarityBG; // 0x440
	UImage* RarityBorder; // 0x448
	UImage* RarityScrim; // 0x450
	TMap<ECustomizationRarity, UTexture2D*> RarityBackgrounds; // 0x458
	TMap<ECustomizationRarity, UTexture2D*> RarityScrims; // 0x4a8
	TMap<ECustomizationRarity, FLinearColor> RarityTitleColors; // 0x4f8
	TMap<ECustomizationRarity, FLinearColor> RarityBorderColors; // 0x548
	UImage* RewardImage; // 0x598
	UWidgetSwitcher* ThumbnailSwitcher; // 0x5c8
	UBorder* NameTagBorder; // 0x5d0
	UWidget* XPRewardRoot; // 0x5d8
	UWidget* DropRewardRoot; // 0x5e0
	TMap<ECustomizationType, FMargin> CustomizationThumbnailPaddings; // 0x5e8
	TMap<ERewardType, FMargin> RewardThumbnailPaddings; // 0x638
	TMap<ECustomizationType, float> CustomizationRenderAngles; // 0x688
	TMap<ERewardType, float> RewardRenderAngles; // 0x6d8
};

struct UPortalWarsChallengeDialogWidget : UPortalWarsDialogWidget {
	UPortalWarsChallengeEntryWidget* ChallengeEntryWidgetClass; // 0x390
	UPortalWarsChallengeEntryWidget* CompletedChallengeEntryWidgetClass; // 0x398
	UPanelWidget* EntriesPanel; // 0x3a0
	TArray<UPortalWarsChallengeEntryWidget*> ChallengeEntries; // 0x3b8
};

struct APortalWarsTakedown : APortalWarsRoundGameMode {
	APortalWarsTakedownGameState* TakedownGameState; // 0x6b8
	int32_t RespawnChangePerKill; // 0x6c0
	int32_t RespawnChangePerDeath; // 0x6c4
	int32_t MinRespawnTime; // 0x6c8
	int32_t MaxRespawnTime; // 0x6cc
	int32_t FinalKillScore; // 0x6d0
};

struct UPortalWarsRadioGroupWidget : UPortalWarsInputWidget {
	TArray<FText> DefaultOptions; // 0x370
	int32_t DefaultIndex; // 0x380
	UPanelWidget* RadioGroupPanel; // 0x388
	UPortalWarsEntryWidget* RadioButtonWidgetClass; // 0x390
};

struct UInterpTrackInstBoolProp : UInterpTrackInstProperty {
	bool ResetBool; // 0x60
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct UAnimSequenceBase : UAnimationAsset {
	TArray<FAnimNotifyEvent> Notifies; // 0x80
	float SequenceLength; // 0x90
	float RateScale; // 0x94
	FRawCurveTracks RawCurveData; // 0x98
};

struct UInterpTrackLinearColorBase : UInterpTrack {
	FInterpCurveLinearColor LinearColorTrack; // 0x70
	float CurveTension; // 0x88
};

struct UCompositeDataTable : UDataTable {
	TArray<UDataTable*> ParentTables; // 0xb0
	TArray<UDataTable*> OldParentTables; // 0xc0
};

struct APortalWarsDOMGameState : APortalWarsGameState {
	TArray<ADominationHill*> Hills; // 0x7c8
};

struct UVariantObjectBinding : UObject {
	FString CachedActorLabel; // 0x28
	FSoftObjectPath ObjectPtr; // 0x38
	LazyObjectProperty LazyObjectPtr; // 0x50
	TArray<UPropertyValue*> CapturedProperties; // 0x70
	TArray<FFunctionCaller> FunctionCallers; // 0x80
};

struct UWaveScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
	float Wavelength; // 0xc0
	float Period; // 0xc4
	EWaveFunctionType Function; // 0xc8
	EFieldFalloffType Falloff; // 0xc9
};

struct UInheritableComponentHandler : UObject {
	TArray<FComponentOverrideRecord> Records; // 0x28
	TArray<UActorComponent*> UnnecessaryComponents; // 0x38
};

struct UNiagaraComponent : UFXSystemComponent {
	UNiagaraSystem* Asset; // 0x450
	ENiagaraTickBehavior TickBehavior; // 0x458
	int32_t RandomSeedOffset; // 0x45c
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x460
	char bForceSolo : 1; // 0x528
	char bEnableGpuComputeDebug : 1; // 0x528
	char bAutoDestroy : 1; // 0x558
	char bRenderingEnabled : 1; // 0x558
	char bAutoManageAttachment : 1; // 0x558
	char bAutoAttachWeldSimulatedBodies : 1; // 0x558
	float MaxTimeBeforeForceUpdateTransform; // 0x55c
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x560
	FMulticastInlineDelegate OnSystemFinished; // 0x578
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x588
	FName AutoAttachSocketName; // 0x590
	EAttachmentRule AutoAttachLocationRule; // 0x598
	EAttachmentRule AutoAttachRotationRule; // 0x599
	EAttachmentRule AutoAttachScaleRule; // 0x59a
};

struct UARCandidateImage : UDataAsset {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UPortalWarsEvolutionGunStatusWidget : UPortalWarsUserWidget {
	UImage* WeaponImage; // 0x2b0
	USizeBox* IconSizeBox; // 0x2b8
};

struct UGizmoConstantAxisSource : UObject {
	FVector Origin; // 0x30
	FVector Direction; // 0x3c
};

struct UMaterialExpressionVolumetricAdvancedMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput PhaseG; // 0x40
	FExpressionInput PhaseG2; // 0x54
	FExpressionInput PhaseBlend; // 0x68
	FExpressionInput MultiScatteringContribution; // 0x7c
	FExpressionInput MultiScatteringOcclusion; // 0x90
	FExpressionInput MultiScatteringEccentricity; // 0xa4
	FExpressionInput ConservativeDensity; // 0xb8
	float ConstPhaseG; // 0xcc
	float ConstPhaseG2; // 0xd0
	float ConstPhaseBlend; // 0xd4
	bool PerSamplePhaseEvaluation; // 0xd8
	uint32_t MultiScatteringApproximationOctaveCount; // 0xdc
	float ConstMultiScatteringContribution; // 0xe0
	float ConstMultiScatteringOcclusion; // 0xe4
	float ConstMultiScatteringEccentricity; // 0xe8
	bool bGroundContribution; // 0xec
	bool bGrayScaleMaterial; // 0xed
	bool bRayMarchVolumeShadow; // 0xee
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x68
};

struct UPortalWarsUISettingsWidget : UPortalWarsSettingsSubWidget {
	UPortalWarsCheckBoxWidget* FPS; // 0x358
	UPortalWarsCheckBoxWidget* GPU; // 0x360
	UPortalWarsCheckBoxWidget* Ping; // 0x368
	UPortalWarsCheckBoxWidget* NetInfo; // 0x370
	UPortalWarsCheckBoxWidget* Subtitles; // 0x378
	UPortalWarsCheckBoxWidget* DamageNumbers; // 0x380
	UPortalWarsCheckBoxWidget* LowAmmo; // 0x388
	UPortalWarsColorPickerWidget* CrosshairColor; // 0x390
	UPortalWarsColorPickerWidget* EnemyCrosshairColor; // 0x398
	UPanelWidget* CrosshairPanel; // 0x3a0
	UPortalWarsCheckBoxWidget* SprintCrosshair; // 0x3a8
};

struct UMaterialExpressionSingleLayerWaterMaterialOutput : UMaterialExpressionCustomOutput {
	FExpressionInput ScatteringCoefficients; // 0x40
	FExpressionInput AbsorptionCoefficients; // 0x54
	FExpressionInput PhaseG; // 0x68
	FExpressionInput ColorScaleBehindWater; // 0x7c
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x230
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x240
	UNavLinkCustomComponent* SmartLinkComp; // 0x250
	bool bSmartLinkIsRelevant; // 0x258
	FMulticastInlineDelegate OnSmartLinkReached; // 0x260
};

struct UPortalWarsMedalEntryWidget : UUserWidget {
	UWidget* ContentRoot; // 0x280
	UTextBlock* LabelText; // 0x288
	UImage* MedalImage; // 0x290
	UWidgetAnimation* FadeInAnimation; // 0x298
	UWidgetAnimation* FadeInToMiddleAnimation; // 0x2a0
	UWidgetAnimation* FadeOutAnimation; // 0x2a8
	UWidgetAnimation* SlideToLeftAnimation; // 0x2b0
	UWidgetAnimation* SlideToMiddleAnimation; // 0x2b8
	float LifeTime; // 0x2c8
	FWidgetTransform LeftTransfrom; // 0x2d8
	FWidgetTransform MiddleTransform; // 0x2f4
	FWidgetTransform RightTransform; // 0x310
};

struct ADatasmithAreaLightActor : AActor {
	EComponentMobility Mobility; // 0x220
	EDatasmithAreaLightActorType LightType; // 0x221
	EDatasmithAreaLightActorShape LightShape; // 0x222
	FVector2D Dimensions; // 0x224
	float Intensity; // 0x22c
	ELightUnits IntensityUnits; // 0x230
	FLinearColor Color; // 0x234
	float Temperature; // 0x244
	UTextureLightProfile* IESTexture; // 0x248
	bool bUseIESBrightness; // 0x250
	float IESBrightnessScale; // 0x254
	FRotator Rotation; // 0x258
	float SourceRadius; // 0x264
	float SourceLength; // 0x268
	float AttenuationRadius; // 0x26c
	float SpotlightInnerAngle; // 0x270
	float SpotlightOuterAngle; // 0x274
};

struct APortal : ACullableActor {
	FVector PortalGrow_Scale_Start; // 0x228
	float portalGrow_TotalSeconds; // 0x234
	char DoRep_portalGrow_StartAnim; // 0x23c
	char DoRep_portalShrink_StartAnim; // 0x23d
	bool isLeftPortal; // 0x23e
	UPortalWarsAkComponent* AkPortal; // 0x240
	UAkAudioEvent* PortalAmb_PlayEvent; // 0x248
	UAkAudioEvent* PortalAmb_StopEvent; // 0x250
	UAkAudioEvent* PortalOpen_Event; // 0x258
	UAkAudioEvent* PortalClose_Event; // 0x260
	char DoRep_initPortalColor; // 0x269
	APortalWarsCharacter* MyPawn; // 0x270
	APortalWarsPlayerState* MyPlayerState; // 0x278
	APortal* linkedPortal; // 0x288
	FLinearColor UnlinkedPortalColor; // 0x290
	FLinearColor LeftPortalColor; // 0x2a0
	FLinearColor RightPortalColor; // 0x2b0
	UStaticMeshComponent* PortalMesh; // 0x2c0
	UStaticMeshComponent* portalCollisionFrameMesh; // 0x2c8
	UStaticMeshComponent* portalRingMesh; // 0x2d0
	UStaticMeshComponent* PortalThruPortalMesh; // 0x2d8
	APortalWall* PortalWall; // 0x2e0
	UStaticMeshComponent* smallPortalOverlapBox; // 0x2f0
	UStaticMeshComponent* largePortalOverlapBox; // 0x2f8
	UMaterialInstanceDynamic* portalDynamicMaterial; // 0x300
	UMaterialInstance* DefaultPortalMaterial; // 0x308
	UMaterialInstance* DefaultPortalRingMaterial; // 0x310
	UMaterial* renderedPortalMaterial; // 0x318
	FLinearColor EnemyPortalColor; // 0x334
	FLinearColor AlphaTeamPortalColor; // 0x344
	FLinearColor BravoTeamPortalColor; // 0x354
	UPortalWarsIndicatorWidget* PortalIndicatorWidget; // 0x388
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x48
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x220
};

struct UPortalWarsAnimInstance : UAnimInstance {
	EAnimationType AnimationType; // 0x2c8
	float AimPitch; // 0x2cc
	float Yaw; // 0x2d0
	float YawLastTick; // 0x2d4
	float YawChangeOverFrame; // 0x2d8
	bool bIsMoving; // 0x2dc
	bool bIsSprinting; // 0x2dd
	bool bIsJumping; // 0x2de
	bool bIsFalling; // 0x2df
	bool bIsCrouching; // 0x2e0
	bool bIsAccelerating; // 0x2e1
	FVector Velocity; // 0x2e4
	float MoveSpeed; // 0x2f0
	float NormalizedMoveSpeed; // 0x2f4
	float SpeedHorizontal; // 0x2f8
	float SpeedVertical; // 0x2fc
	float Direction; // 0x300
	float HeadScale; // 0x304
	float MovementModifier; // 0x308
	bool bIsPlayingEmote; // 0x30c
	UAnimSequence* EmoteAnimSequence; // 0x310
	UBlendSpace1D* WalkBlendSpace; // 0x318
	UAnimSequence* SprintAnim; // 0x320
	UAnimSequence* JumpStartAnim; // 0x328
	UAnimSequence* JumpLoopAnim; // 0x330
	UAnimSequence* JumpEndAnim; // 0x338
	UPortalWarsAkComponent* AkFoot; // 0x340
};

struct APortalWarsGG : APortalWarsGameMode {
	TArray<AGun*> WeaponClasses; // 0x6a8
	bool bHumiliationEnabled; // 0x6b8
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct UParticleModuleLocationSkelVertSurface : UParticleModuleLocationBase {
	ELocationSkelVertSurfaceSource SourceType; // 0x30
	FVector UniversalOffset; // 0x34
	char bUpdatePositionEachFrame : 1; // 0x40
	char bOrientMeshEmitters : 1; // 0x40
	char bInheritBoneVelocity : 1; // 0x40
	float InheritVelocityScale; // 0x44
	FName SkelMeshActorParamName; // 0x48
	TArray<FName> ValidAssociatedBones; // 0x50
	char bEnforceNormalCheck : 1; // 0x60
	FVector NormalToCompare; // 0x64
	float NormalCheckToleranceDegrees; // 0x70
	float NormalCheckTolerance; // 0x74
	TArray<int32_t> ValidMaterialIndices; // 0x78
	char bInheritVertexColor : 1; // 0x88
	char bInheritUV : 1; // 0x88
	uint32_t InheritUVChannel; // 0x8c
};

struct UGeometryCacheTrack_FlipbookAnimation : UGeometryCacheTrack {
	uint32_t NumMeshSamples; // 0x58
};

struct UMovieSceneAudioTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x80
};

struct UMapBuildDataRegistry : UObject {
	ELightingBuildQuality LevelLightingQuality; // 0x28
};

struct UAkCallbackInfo : UObject {
	UAkComponent* AkComponent; // 0x28
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct USynth2DSlider : UWidget {
	float ValueX; // 0x108
	float ValueY; // 0x10c
	FDelegate ValueXDelegate; // 0x110
	FDelegate ValueYDelegate; // 0x120
	FSynth2DSliderStyle WidgetStyle; // 0x130
	FLinearColor SliderHandleColor; // 0x3e8
	bool IndentHandle; // 0x3f8
	bool locked; // 0x3f9
	float StepSize; // 0x3fc
	bool IsFocusable; // 0x400
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x408
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x418
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x428
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x438
	FMulticastInlineDelegate OnValueChangedX; // 0x448
	FMulticastInlineDelegate OnValueChangedY; // 0x458
};

struct AProjectile : ACullableActor {
	UPWProjectileMovementComponent* MovementComp; // 0x220
	USphereComponent* CollisionComp; // 0x228
	USphereComponent* PawnCollisionComp; // 0x230
	char ProjectileID; // 0x238
	char bIsInitialProjectile : 1; // 0x239
	FVector_NetQuantize InitialProjectileCameraLocation; // 0x23c
	UPortalWarsAkComponent* AkComp; // 0x250
	UParticleSystemComponent* ParticleComp; // 0x258
	UStaticMeshComponent* MeshComp; // 0x260
	UParticleSystem* ExplosionFX; // 0x268
	UAkAudioEvent* ExplosionEvent; // 0x270
	UAkAudioEvent* ProjectileLoopStartEvent; // 0x278
	UAkAudioEvent* ProjectileLoopStopEvent; // 0x280
	FDecalData Decal; // 0x288
	bool canTeleport; // 0x298
	bool bExploded; // 0x2c8
	bool bDestroyed; // 0x2c9
	float OverlapSphereGrowthRate; // 0x2cc
	float MaxPawnOverlapSphereSize; // 0x2d0
};

struct UPortalWarsCustomAntiCheat : UObject {
	TMap<APortalWarsPlayerState*, FCheatViolations> PlayerViolations; // 0x28
};

struct UDatasmithPointLightComponentTemplate : UDatasmithObjectTemplate {
	ELightUnits IntensityUnits; // 0x30
	float SourceRadius; // 0x34
	float SourceLength; // 0x38
	float AttenuationRadius; // 0x3c
};

struct UVivoxSubsystem : ULocalPlayerSubsystem {
	TArray<UVivoxChannel*> Channels; // 0xa0
};

struct UFieldSystemMetaDataFilter : UFieldSystemMetaData {
	EFieldFilterType FilterType; // 0xb0
};

struct UParticleModuleTypeDataBeam2 : UParticleModuleTypeDataBase {
	EBeam2Method BeamMethod; // 0x30
	int32_t TextureTile; // 0x34
	float TextureTileDistance; // 0x38
	int32_t Sheets; // 0x3c
	int32_t MaxBeamCount; // 0x40
	float Speed; // 0x44
	int32_t InterpolationPoints; // 0x48
	char bAlwaysOn : 1; // 0x4c
	int32_t UpVectorStepSize; // 0x50
	FName BranchParentName; // 0x54
	FRawDistributionFloat Distance; // 0x60
	EBeamTaperMethod TaperMethod; // 0x90
	FRawDistributionFloat TaperFactor; // 0x98
	FRawDistributionFloat TaperScale; // 0xc8
	char RenderGeometry : 1; // 0xf8
	char RenderDirectLine : 1; // 0xf8
	char RenderLines : 1; // 0xf8
	char RenderTessellation : 1; // 0xf8
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct UMaterialExpressionShaderStageSwitch : UMaterialExpression {
	FExpressionInput PixelShader; // 0x40
	FExpressionInput VertexShader; // 0x54
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct APortalWarsGunPickupZone : APortalWarsGunPickup {
	float AmmoClips; // 0x2cc
	bool bIsActive; // 0x2d0
	int32_t TimeToSpawn; // 0x2d4
	int32_t ReplicatedTimeToSpawn; // 0x2d8
	int32_t TimeBetweenSpawns; // 0x2dc
	USkeletalMeshComponent* PickupPlatformMesh; // 0x2f8
	UAnimMontage* PlatformOpenMontage; // 0x300
	UAnimMontage* PlatformCloseMontage; // 0x308
	UParticleSystemComponent* PickupGlow; // 0x310
	UMaterialInterface* InactiveMaterial; // 0x318
	TArray<UMaterialInterface*> ActiveMaterials; // 0x320
	UPortalWarsPickupZoneIndicator* PickupIndicatorWidget; // 0x330
	UPortalWarsAkComponent* AkComponent; // 0x338
	UAkAudioEvent* PlayAmbientLoopEvent; // 0x340
	UAkAudioEvent* StopAmbientLoopEvent; // 0x348
	bool bHidePickupPlatform; // 0x354
};

struct UPortalWarsKeybindSettingsWidget : UPortalWarsSettingsSubWidget {
	TArray<UPortalWarsKeybindWidget*> KeybindItems; // 0x358
	UWidget* WarningRoot; // 0x368
	UTextBlock* WarningText; // 0x388
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x258
};

struct UWindowTitleBarArea : UContentWidget {
	bool bWindowButtonsEnabled; // 0x120
	bool bDoubleClickTogglesFullscreen; // 0x121
};

struct AGeometryCacheActor : AActor {
	UGeometryCacheComponent* GeometryCacheComponent; // 0x220
};

struct UVirtualTexturePoolConfig : UObject {
	int32_t DefaultSizeInMegabyte; // 0x28
	TArray<FVirtualTextureSpacePoolConfig> Pools; // 0x30
};

struct UPropertyValue : UObject {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x1f8
	float OrthoWidth; // 0x1fc
	float OrthoNearClipPlane; // 0x200
	float OrthoFarClipPlane; // 0x204
	float AspectRatio; // 0x208
	char bConstrainAspectRatio : 1; // 0x20c
	char bUseFieldOfViewForLOD : 1; // 0x20c
	char bLockToHmd : 1; // 0x20c
	char bUsePawnControlRotation : 1; // 0x20c
	ECameraProjectionMode ProjectionMode; // 0x20d
	float PostProcessBlendWeight; // 0x240
	FPostProcessSettings PostProcessSettings; // 0x270
};

struct UMaterialExpressionAtmosphericFogColor : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
};

struct UPortalWarsAddFriendsWidget : UPortalWarsMenuWidget {
	UPanelWidget* IncomingFriendRequestPanel; // 0x338
	UPanelWidget* OutgoingFriendRequestPanel; // 0x340
	UScrollBox* ItemsScrollBox; // 0x348
	UPortalWarsFriendRequestEntry* FriendRequestEntryWidgetClass; // 0x350
	UPortalWarsFriendRequestDialog* FriendRequestDialogWidgetClass; // 0x358
	UPortalWarsTextInputWidget* FriendCodeTextInput; // 0x360
	UTextBlock* FriendCodeText; // 0x368
	UPortalWarsButtonWidget* SendRequestButton; // 0x370
	UPortalWarsButtonWidget* CopyButton; // 0x378
	UTextBlock* ErrorText; // 0x380
};

struct UCrowdManager : UCrowdManagerBase {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct UMaterialExpressionQualitySwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct UScaleBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UPortalWarsTeamGlobalCarouselWidget : UPortalWarsInputWidget {
	UPortalWarsGlobalCarouselWidget* GlobalCarousel; // 0x368
	UPortalWarsGlobalCarouselWidget* AlphaCarousel; // 0x370
	UPortalWarsGlobalCarouselWidget* BravoCarousel; // 0x378
	UPortalWarsCheckBox* TeamCheckbox; // 0x380
	FKey GamepadKey; // 0x3c0
	UImage* StandardIcon; // 0x3d8
	UImage* GamepadIcon; // 0x3e0
	UWidgetSwitcher* ConsoleSwitcher; // 0x3e8
	FLinearColor IconDefaultColor; // 0x3f0
	FLinearColor IconHoveredColor; // 0x400
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FSpectatorReservation PendingReservation; // 0x2f0
	ESpectatorClientRequestType RequestType; // 0x368
	bool bPendingReservationSent; // 0x369
	bool bCancelReservation; // 0x36a
};

struct UPortalWarsChallengesSubWidget : UPortalWarsMenuWidget {
	UPortalWarsChallengeEntryWidget* ChallengeEntryWidgetClass; // 0x338
	UPortalWarsChallengeEntryWidget* FeaturedChallengeEntryWidgetClass; // 0x340
	UPortalWarsBPPurchaseDialogWidget* BuyPremiumDialogWidgetClass; // 0x348
	UPanelWidget* EntriesPanel; // 0x350
	UPanelWidget* PremiumEntriesPanel; // 0x358
	UPanelWidget* FeaturedEntriesPanel; // 0x360
	UPortalWarsChallengesInspectWidget* InspectWidget; // 0x368
	UTextBlock* TitleText; // 0x370
	UTextBlock* TimeDescriptionText; // 0x380
	UPortalWarsButtonWidget* BuyPremiumButton; // 0x388
	EChallengeType ChallengeType; // 0x391
	int32_t GroupId; // 0x394
};

struct UWrapBox : UPanelWidget {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	float WrapSize; // 0x12c
	bool bExplicitWrapWidth; // 0x130
	bool bExplicitWrapSize; // 0x131
	EOrientation Orientation; // 0x132
};

struct UPortalWarsRaceScoreboardWidget : UPortalWarsScoreboardWidget {
	UTextBlock* PlayerNameText; // 0x340
	UTextBlock* CurrentTimeText; // 0x348
	UTextBlock* RecordHolderNameText; // 0x350
	UTextBlock* RecordTimeText; // 0x358
};

struct AServerStatReplicator : AInfo {
	bool bUpdateStatNet; // 0x220
	bool bOverwriteClientStats; // 0x221
	uint32_t Channels; // 0x224
	uint32_t InRate; // 0x228
	uint32_t OutRate; // 0x22c
	uint32_t MaxPacketOverhead; // 0x234
	uint32_t InRateClientMax; // 0x238
	uint32_t InRateClientMin; // 0x23c
	uint32_t InRateClientAvg; // 0x240
	uint32_t InPacketsClientMax; // 0x244
	uint32_t InPacketsClientMin; // 0x248
	uint32_t InPacketsClientAvg; // 0x24c
	uint32_t OutRateClientMax; // 0x250
	uint32_t OutRateClientMin; // 0x254
	uint32_t OutRateClientAvg; // 0x258
	uint32_t OutPacketsClientMax; // 0x25c
	uint32_t OutPacketsClientMin; // 0x260
	uint32_t OutPacketsClientAvg; // 0x264
	uint32_t NetNumClients; // 0x268
	uint32_t InPackets; // 0x26c
	uint32_t OutPackets; // 0x270
	uint32_t InBunches; // 0x274
	uint32_t OutBunches; // 0x278
	uint32_t OutLoss; // 0x27c
	uint32_t InLoss; // 0x280
	uint32_t VoiceBytesSent; // 0x284
	uint32_t VoiceBytesRecv; // 0x288
	uint32_t VoicePacketsSent; // 0x28c
	uint32_t VoicePacketsRecv; // 0x290
	uint32_t PercentInVoice; // 0x294
	uint32_t PercentOutVoice; // 0x298
	uint32_t NumActorChannels; // 0x29c
	uint32_t NumConsideredActors; // 0x2a0
	uint32_t PrioritizedActors; // 0x2a4
	uint32_t NumRelevantActors; // 0x2a8
	uint32_t NumRelevantDeletedActors; // 0x2ac
	uint32_t NumReplicatedActorAttempts; // 0x2b0
	uint32_t NumReplicatedActors; // 0x2b4
	uint32_t NumActors; // 0x2b8
	uint32_t NumNetActors; // 0x2bc
	uint32_t NumDormantActors; // 0x2c0
	uint32_t NumInitiallyDormantActors; // 0x2c4
	uint32_t NumNetGUIDsAckd; // 0x2c8
	uint32_t NumNetGUIDsPending; // 0x2cc
	uint32_t NumNetGUIDsUnAckd; // 0x2d0
	uint32_t ObjPathBytes; // 0x2d4
	uint32_t NetGUIDOutRate; // 0x2d8
	uint32_t NetGUIDInRate; // 0x2dc
	uint32_t NetSaturated; // 0x2e0
};

struct UWidget : UVisual {
	UPanelSlot* Slot; // 0x28
	FDelegate bIsEnabledDelegate; // 0x30
	FText ToolTipText; // 0x40
	FDelegate ToolTipTextDelegate; // 0x58
	UWidget* ToolTipWidget; // 0x68
	FDelegate ToolTipWidgetDelegate; // 0x70
	FDelegate VisibilityDelegate; // 0x80
	FWidgetTransform RenderTransform; // 0x90
	FVector2D RenderTransformPivot; // 0xac
	char bIsVariable : 1; // 0xb4
	char bCreatedByConstructionScript : 1; // 0xb4
	char bIsEnabled : 1; // 0xb4
	char bShowDisabledEffects : 1; // 0xb4
	char bOverride_Cursor : 1; // 0xb4
	USlateAccessibleWidgetData* AccessibleWidgetData; // 0xb8
	char bIsVolatile : 1; // 0xc0
	char bCullEnabled : 1; // 0xc0
	EMouseCursor Cursor; // 0xc1
	EWidgetClipping Clipping; // 0xc2
	ESlateVisibility Visibility; // 0xc3
	float RenderOpacity; // 0xc4
	UWidgetNavigation* Navigation; // 0xc8
	EFlowDirectionPreference FlowDirectionPreference; // 0xd0
	TArray<UPropertyBinding*> NativeBindings; // 0xf8
};

struct UMaterialExpressionMax : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct APortalWarsGrenadePickupZone : APortalWarsGunPickupZone {
	FText GrenadeName; // 0x358
	UAkAudioEvent* PickupEvent; // 0x370
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
};

struct UMaterialExpressionSmoothStep : UMaterialExpression {
	FExpressionInput Min; // 0x40
	FExpressionInput Max; // 0x54
	FExpressionInput Value; // 0x68
	float ConstMin; // 0x7c
	float ConstMax; // 0x80
	float ConstValue; // 0x84
};

struct UPortalWarsRewardPassWidget : UPortalWarsInspectWidget {
	UPortalWarsRewardPassEntryWidget* EntryWidgetClass; // 0x3b8
	TMap<ECustomizationType, UPortalWarsRewardPassEntryWidget*> EntryWidgetClassOverrides; // 0x3c0
	UPortalWarsCustomScrollWidget* ItemsPanel; // 0x410
	TArray<FRewardPassEntryData> RewardPassEntries; // 0x418
	UTextBlock* CurrentLevelText; // 0x428
};

struct UMovieSceneCameraShakeSection : UMovieSceneSection {
	FMovieSceneCameraShakeSectionData ShakeData; // 0xe8
	UCameraShakeBase* ShakeClass; // 0x108
	float PlayScale; // 0x110
	ECameraShakePlaySpace PlaySpace; // 0x114
	FRotator UserDefinedPlaySpace; // 0x118
};

struct UPortalWarsGamepadBindingWidget : UPortalWarsUserWidget {
	FMulticastInlineDelegate OnGamepadKeyBound; // 0x2a8
	UPortalWarsButton* BindingButton; // 0x2b8
	UTextBlock* BindingText; // 0x2c0
	UImage* ButtonBackground; // 0x2c8
	UWidget* ButtonIconBox; // 0x2d0
	UWidget* HoveredIndicator; // 0x2d8
	FSlateColor StandardColor; // 0x2e0
	FSlateColor ActiveColor; // 0x308
	UPortalWarsGamepadBindingOverlayWidget* BindingOverlayClass; // 0x368
};

struct UMovieSceneCapture : UObject {
	FSoftClassPath ImageCaptureProtocolType; // 0x38
	FSoftClassPath AudioCaptureProtocolType; // 0x50
	UMovieSceneImageCaptureProtocolBase* ImageCaptureProtocol; // 0x68
	UMovieSceneAudioCaptureProtocolBase* AudioCaptureProtocol; // 0x70
	FMovieSceneCaptureSettings Settings; // 0x78
	bool bUseSeparateProcess; // 0xe8
	bool bCloseEditorWhenCaptureStarts; // 0xe9
	FString AdditionalCommandLineArguments; // 0xf0
	FString InheritedCommandLineArguments; // 0x100
};

struct URequestPermissionsAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct AAkSpotReflector : AActor {
	UAkAuxBus* AuxBus; // 0x220
	FString AuxBusName; // 0x228
	UAkAcousticTexture* AcousticTexture; // 0x238
	float DistanceScalingFactor; // 0x240
	float Level; // 0x244
};

struct UWidgetTree : UObject {
	UWidget* RootWidget; // 0x28
};

struct UBTService_RefreshFocus : UBTService {
	float MaxLongRangeRadius; // 0x70
	float MaxCloseRangeRadius; // 0x74
	float MaxAimAngle; // 0x78
};

struct UEnvQueryGenerator_PathGridOffset : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0x130
	UNavigationQueryFilter* NavigationFilter; // 0x168
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x170
	FAIDataProviderFloatValue OffsetSize; // 0x1a8
	FAIDataProviderBoolValue RandomizeProjectionData; // 0x1e0
	FAIDataProviderFloatValue ProjectDownRandomMultiplier; // 0x218
	FAIDataProviderFloatValue ProjectUpRandomMultiplier; // 0x250
	FAIDataProviderFloatValue ExtentXRandomMultiplier; // 0x288
};

struct UAISenseEvent_Hearing : UAISenseEvent {
	FAINoiseEvent Event; // 0x28
};

struct UMaterialExpressionHairAttributes : UMaterialExpression {
	char bUseTangentSpace : 1; // 0x40
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct UPortalWarsInputCarouselWidget : UPortalWarsInputWidget {
	UButton* LeftButton; // 0x368
	UButton* RightButton; // 0x370
	UPortalWarsButtonWidget* LeftGamepadButton; // 0x378
	UPortalWarsButtonWidget* RightGamepadButton; // 0x380
	FMulticastInlineDelegate OnCarouselValueChangedDelegate; // 0x388
	UWidgetSwitcher* ConsoleSwitcher; // 0x398
};

struct UPortalWarsUnlockDialogWidget : UPortalWarsDialogWidget {
	UTextBlock* TitleText; // 0x398
	UTextBlock* MessageText; // 0x3a0
	UImage* MedalImage; // 0x3a8
	UImage* UnlockImage; // 0x3b0
	UImage* IconImage; // 0x3b8
	UVerticalBox* NotesVerticalBox; // 0x3c0
	UPortalWarsButtonWidget* QueueButton; // 0x3c8
	UPortalWarsButtonWidget* ViewButton; // 0x3d0
	UWidgetSwitcher* ButtonWidgetSwitcher; // 0x3d8
	UPortalWarsUnlockNoteEntryWidget* NoteEntryWidgetClass; // 0x3e0
	float PaddingBetweenNoteEntries; // 0x3e8
	UAkAudioEvent* UnlockEvent; // 0x3f8
};

struct UAudioBus : UObject {
	EAudioBusChannels AudioBusChannels; // 0x28
	bool bIsAutomatic; // 0x29
};

struct APortalSceneCapture2D : ASceneCapture2D {
	APortal* Portal; // 0x238
};

struct UPortalWarsControllerPresetWidget : UPortalWarsUserWidget {
	FMulticastInlineDelegate OnSwapToCustomBindings; // 0x2a8
	UPortalWarsGamepadBindingWidget* FaceButtonBottomBinding; // 0x2b8
	UPortalWarsGamepadBindingWidget* FaceButtonTopBinding; // 0x2c0
	UPortalWarsGamepadBindingWidget* FaceButtonRightBinding; // 0x2c8
	UPortalWarsGamepadBindingWidget* FaceButtonLeftBinding; // 0x2d0
	UPortalWarsGamepadBindingWidget* RightShoulderBinding; // 0x2d8
	UPortalWarsGamepadBindingWidget* LeftShoulderBinding; // 0x2e0
	UPortalWarsGamepadBindingWidget* RightTriggerBinding; // 0x2e8
	UPortalWarsGamepadBindingWidget* LeftTriggerBinding; // 0x2f0
	UPortalWarsGamepadBindingWidget* DPadUpBinding; // 0x2f8
	UPortalWarsGamepadBindingWidget* DPadDownBinding; // 0x300
	UPortalWarsGamepadBindingWidget* DPadRightBinding; // 0x308
	UPortalWarsGamepadBindingWidget* DPadLeftBinding; // 0x310
	UTextBlock* SpecialRightText; // 0x318
	UPortalWarsGamepadBindingWidget* SpecialLeftBinding; // 0x320
	UTextBlock* LeftStickText; // 0x328
	UPortalWarsGamepadBindingWidget* LeftStickDownBinding; // 0x330
	UTextBlock* RightStickText; // 0x338
	UPortalWarsGamepadBindingWidget* RightStickDownBinding; // 0x340
};

struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x88
	ENiagaraRendererSourceDataMode SourceMode; // 0x90
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x98
	ENiagaraSpriteAlignment Alignment; // 0xb8
	ENiagaraSpriteFacingMode FacingMode; // 0xb9
	FVector2D PivotInUVSpace; // 0xbc
	ENiagaraSortMode SortMode; // 0xc4
	FVector2D SubImageSize; // 0xc8
	char bSubImageBlend : 1; // 0xd0
	char bRemoveHMDRollInVR : 1; // 0xd0
	char bSortOnlyWhenTranslucent : 1; // 0xd0
	char bGpuLowLatencyTranslucency : 1; // 0xd0
	float MinFacingCameraBlendDistance; // 0xd4
	float MaxFacingCameraBlendDistance; // 0xd8
	char bEnableCameraDistanceCulling : 1; // 0xdc
	float MinCameraDistance; // 0xe0
	float MaxCameraDistance; // 0xe4
	uint32_t RendererVisibility; // 0xe8
	FNiagaraVariableAttributeBinding PositionBinding; // 0xf0
	FNiagaraVariableAttributeBinding ColorBinding; // 0x148
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x1a0
	FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x1f8
	FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x250
	FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x2a8
	FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x300
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x358
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x3b0
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x408
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x460
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4b8
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x510
	FNiagaraVariableAttributeBinding UVScaleBinding; // 0x568
	FNiagaraVariableAttributeBinding PivotOffsetBinding; // 0x5c0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x618
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x670
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x6c8
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x720
	TArray<FNiagaraMaterialAttributeBinding> MaterialParameterBindings; // 0x778
	FNiagaraVariableAttributeBinding PrevPositionBinding; // 0x788
	FNiagaraVariableAttributeBinding PrevVelocityBinding; // 0x7e0
	FNiagaraVariableAttributeBinding PrevSpriteRotationBinding; // 0x838
	FNiagaraVariableAttributeBinding PrevSpriteSizeBinding; // 0x890
	FNiagaraVariableAttributeBinding PrevSpriteFacingBinding; // 0x8e8
	FNiagaraVariableAttributeBinding PrevSpriteAlignmentBinding; // 0x940
	FNiagaraVariableAttributeBinding PrevCameraOffsetBinding; // 0x998
	FNiagaraVariableAttributeBinding PrevPivotOffsetBinding; // 0x9f0
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x270
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x278
	APlayerCameraManager* BaseCamera; // 0x280
	FTransform RelativeTransform; // 0x290
	float BaseFOV; // 0x2c0
	char bAllowMultipleInstances : 1; // 0x2c4
	char bResetWhenRetriggered : 1; // 0x2c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x2c8
	float DistFromCamera; // 0x2d8
};

struct UBackgroundBlurSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UInterpTrackInstLinearColorProp : UInterpTrackInstProperty {
	FLinearColor ResetColor; // 0x58
};

struct UPortalWarsNewsFeedEntryWidget : UPortalWarsEntryWidget {
	UTextBlock* DescriptionText; // 0x420
	UImage* NewsImage; // 0x428
};

struct UParticleModuleAcceleration : UParticleModuleAccelerationBase {
	FRawDistributionVector Acceleration; // 0x38
	char bApplyOwnerScale : 1; // 0x80
};

struct UPortalWarsNotificationEntryWidget : UPortalWarsPlayerEntryWidget {
	UWidget* ButtonRoot; // 0x660
	UPortalWarsButtonWidget* AcceptButton; // 0x668
	UPortalWarsButtonWidget* DeclineButton; // 0x670
	UPortalWarsButtonWidget* ViewButton; // 0x678
	UWidgetSwitcher* SelectedSwitcher; // 0x680
	UTextBlock* DescriptionText; // 0x688
	float MaxLifetime; // 0x690
	UProgressBar* LifetimeProgressBar; // 0x698
};

struct UImgMediaPlaybackComponent : UActorComponent {
	float Width; // 0xb0
	float LODBias; // 0xb4
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraShakePlaySpace PlaySpace; // 0x78
};

struct UPortalWarsPlaylistActiveDialog : UPortalWarsDialogWidget {
	UTextBlock* TitleText; // 0x390
	UTextBlock* DescriptionText; // 0x398
	UTextBlock* XPBoostText; // 0x3a0
	UPortalWarsButtonWidget* QueueButton; // 0x3a8
};

struct APortalWarsVIPHUD : APortalWarsHUD {
	UPortalWarsVIPHUDOverlayWidget* VIPHUDOverlayWidget; // 0x400
	UPortalWarsVIPHUDOverlayWidget* VIPHUDOverlayWidgetClass; // 0x408
	UPortalWarsIndicatorWidget* VIPNameIndicatorWidgetClass; // 0x410
	UAkAudioEvent* VipAlertEvent; // 0x418
};

struct URetainerBox : UContentWidget {
	bool bRetainRender; // 0x120
	bool RenderOnInvalidation; // 0x121
	bool RenderOnPhase; // 0x122
	int32_t Phase; // 0x124
	int32_t PhaseCount; // 0x128
	UMaterialInterface* EffectMaterial; // 0x130
	FName TextureParameter; // 0x138
};

struct UPortalWarsSeasonRewardsWidget : UUserWidget {
	UHorizontalBox* GamesPanel; // 0x260
	UImage* RankIcon; // 0x268
	UTextBlock* RankText; // 0x270
	URichTextBlock* WinsText; // 0x278
	UTexture2D* IncompleteImage; // 0x280
	UTexture2D* CompleteImage; // 0x288
	UTexture2D* SeparatorImage; // 0x290
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct APortalWarsBot : APortalWarsCharacter {
	UBehaviorTree* BotBehavior; // 0xda8
	bool bUseNavRecovery; // 0xdb0
	ENavRecoveryType NavRecoveryType; // 0xdb1
	FNavRecoverySettings NavRecoverySettingsOffMesh; // 0xdb4
	FNavRecoverySettings NavRecoverySettingsOnIslands; // 0xdd8
	float NavRecoveryMaxLaunchSize; // 0xdfc
	float NavRecoveryMinJumpArc; // 0xe00
	float NavRecoveryMaxJumpArc; // 0xe04
	FVector NavRecoveryTestExtent; // 0xe08
	float StuckCheckInterval; // 0xe44
	float StuckDistanceTolerance; // 0xe48
	float WeaponSelectionFrequency; // 0xe58
	float WeaponSelectionCooldown; // 0xe5c
	FBotDebugInfo DebugInfo; // 0xe60
};

struct APortalWarsNeutralCTFGameState : APortalWarsGameState {
	AActor* Flag; // 0x7c8
	EFlagState FlagState; // 0x7d0
	float CapturedFlagRespawnTime; // 0x7d4
};

struct UPortalWarsKeybindWidget : UPortalWarsInputWidget {
	UButton* PrimaryButton; // 0x368
	UButton* SecondaryButton; // 0x370
	UTextBlock* PrimaryText; // 0x378
	UTextBlock* SecondaryText; // 0x380
	UPortalWarsKeybindOverlayWidget* KeybindOverlayClass; // 0x3b8
	FString KeyBindAction; // 0x450
};

struct UMaterialExpressionParameter : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
};

struct UAkXboxOneGDKInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXboxOneGDKApuHeapInitializationSettings ApuHeapSettings; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkXboxOneGDKAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UEnvQueryManager : UAISubsystem {
	TArray<FEnvQueryInstanceCache> InstanceCache; // 0xa8
	TArray<UEnvQueryContext*> LocalContexts; // 0xb8
	TArray<UEnvQueryInstanceBlueprintWrapper*> GCShieldedWrappers; // 0xc8
	float MaxAllowedTestingTime; // 0x12c
	bool bTestQueriesUsingBreadth; // 0x130
	int32_t QueryCountWarningThreshold; // 0x134
	double QueryCountWarningInterval; // 0x138
};

struct AWorldSettings : AInfo {
	int32_t VisibilityCellSize; // 0x228
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x22c
	char bPrecomputeVisibility : 1; // 0x22d
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x22d
	char bEnableWorldBoundsChecks : 1; // 0x22d
	char bEnableNavigationSystem : 1; // 0x22d
	char bEnableAISystem : 1; // 0x22d
	char bEnableWorldComposition : 1; // 0x22d
	char bUseClientSideLevelStreamingVolumes : 1; // 0x22d
	char bEnableWorldOriginRebasing : 1; // 0x22d
	char bWorldGravitySet : 1; // 0x22e
	char bGlobalGravitySet : 1; // 0x22e
	char bMinimizeBSPSections : 1; // 0x22e
	char bForceNoPrecomputedLighting : 1; // 0x22e
	char bHighPriorityLoading : 1; // 0x22e
	char bHighPriorityLoadingLocal : 1; // 0x22e
	char bOverrideDefaultBroadphaseSettings : 1; // 0x22e
	UNavigationSystemConfig* NavigationSystemConfig; // 0x230
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x238
	float WorldToMeters; // 0x240
	float KillZ; // 0x244
	UDamageType* KillZDamageType; // 0x248
	float WorldGravityZ; // 0x250
	float GlobalGravityZ; // 0x254
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x258
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x260
	AGameModeBase* DefaultGameMode; // 0x268
	AGameNetworkManager* GameNetworkManagerClass; // 0x270
	int32_t PackedLightAndShadowMapTextureSize; // 0x278
	FVector DefaultColorScale; // 0x27c
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x288
	float GlobalDistanceFieldViewDistance; // 0x28c
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x290
	FReverbSettings DefaultReverbSettings; // 0x298
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2b8
	float MonoCullingDistance; // 0x2dc
	USoundMix* DefaultBaseSoundMix; // 0x2e0
	float TimeDilation; // 0x2e8
	float MatineeTimeDilation; // 0x2ec
	float DemoPlayTimeDilation; // 0x2f0
	float MinGlobalTimeDilation; // 0x2f4
	float MaxGlobalTimeDilation; // 0x2f8
	float MinUndilatedFrameTime; // 0x2fc
	float MaxUndilatedFrameTime; // 0x300
	FBroadphaseSettings BroadphaseSettings; // 0x304
	APlayerState* Pauser; // 0x348
	TArray<FNetViewer> ReplicationViewers; // 0x350
	TArray<UAssetUserData*> AssetUserData; // 0x360
	APlayerState* PauserPlayerState; // 0x370
	int32_t MaxNumberOfBookmarks; // 0x378
	UBookmarkBase* DefaultBookmarkClass; // 0x380
	TArray<UBookmarkBase*> BookmarkArray; // 0x388
	UBookmarkBase* LastBookmarkClass; // 0x398
};

struct UMovieSceneEventRepeaterSection : UMovieSceneEventSectionBase {
	FMovieSceneEvent Event; // 0xf0
};

struct UBTTask_StrafeQuick : UBTTask_MoveTo {
	float MinStrafeDistance; // 0xb0
	float MaxStrafeDistance; // 0xb4
	float TolerableRadius; // 0xb8
	float ProbabilityToCrouch; // 0xbc
	float MinCrouchedTime; // 0xc0
	float MaxCrouchedTime; // 0xc4
	float MinTimeBetweenCrouch; // 0xc8
	float MaxTimeBetweenCrouch; // 0xcc
	float MaxAngleForAimedAtTest; // 0xd0
	float MinDifficultyForQuickStraffing; // 0xd4
	float MinDifficultyForOccasionalQuickStraffing; // 0xd8
	float ProbabilityForOccasionalQuickStraffing; // 0xdc
	bool bUseLazyWhenNotAimedAt; // 0xe0
	float IdealRangeForNonTraceWeapon; // 0xe4
	float MinStrafeDistanceLazy; // 0xe8
	float MaxStrafeDistanceLazy; // 0xec
	float RandomConeAngleLazy; // 0xf0
};

struct UDatasmithAssetUserData : UAssetUserData {
	TMap<FName, FString> MetaData; // 0x28
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UMaterialFunction : UMaterialFunctionInterface {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
};

struct UPortalWarsKillcamKilledByWidget : UUserWidget {
	UTextBlock* NameText; // 0x260
	UImage* AvatarImage; // 0x268
	UImage* RankImage; // 0x270
	UImage* WeaponImage; // 0x278
	float WeaponImageMaxWidth; // 0x288
};

struct UPortalWarsTrainingWidget : UPortalWarsMenuWidget {
	UPortalWarsButtonWidget* TutorialButton; // 0x338
	UPortalWarsButtonWidget* RangeButton; // 0x340
};

struct USizeBox : UContentWidget {
	float WidthOverride; // 0x130
	float HeightOverride; // 0x134
	float MinDesiredWidth; // 0x138
	float MinDesiredHeight; // 0x13c
	float MaxDesiredWidth; // 0x140
	float MaxDesiredHeight; // 0x144
	float MinAspectRatio; // 0x148
	float MaxAspectRatio; // 0x14c
	char bOverride_WidthOverride : 1; // 0x150
	char bOverride_HeightOverride : 1; // 0x150
	char bOverride_MinDesiredWidth : 1; // 0x150
	char bOverride_MinDesiredHeight : 1; // 0x150
	char bOverride_MaxDesiredWidth : 1; // 0x150
	char bOverride_MaxDesiredHeight : 1; // 0x150
	char bOverride_MinAspectRatio : 1; // 0x150
	char bOverride_MaxAspectRatio : 1; // 0x150
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x2d0
	char bStopAILogicOnUnposses : 1; // 0x2d0
	char bLOSflag : 1; // 0x2d0
	char bSkipExtraLOSChecks : 1; // 0x2d0
	char bAllowStrafe : 1; // 0x2d0
	char bWantsPlayerState : 1; // 0x2d0
	char bSetControlRotationFromPawnOrientation : 1; // 0x2d0
	UPathFollowingComponent* PathFollowingComponent; // 0x2d8
	UBrainComponent* BrainComponent; // 0x2e0
	UAIPerceptionComponent* PerceptionComponent; // 0x2e8
	UPawnActionsComponent* ActionsComp; // 0x2f0
	UBlackboardComponent* Blackboard; // 0x2f8
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x300
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x308
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x310
};

struct UAkXboxOneInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXboxOneApuHeapInitializationSettings ApuHeapSettings; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkXboxOneAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x38
};

struct ANiagaraActor : AActor {
	UNiagaraComponent* NiagaraComponent; // 0x220
	char bDestroyOnSystemFinish : 1; // 0x228
};

struct UMaterialExpressionFmod : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UParticleModuleBeamModifier : UParticleModuleBeamBase {
	BeamModifierType ModifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector Position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UPortalWarsButton : UButton {
	FMulticastInlineDelegate OnDoubleClicked; // 0x428
	bool bDebounce; // 0x464
	float DebounceTime; // 0x468
	UAkAudioEvent* PressedEvent; // 0x470
	UAkAudioEvent* HoveredEvent; // 0x478
};

struct UMaterialExpressionSobol : UMaterialExpression {
	FExpressionInput Cell; // 0x40
	FExpressionInput Index; // 0x54
	FExpressionInput Seed; // 0x68
	uint32_t ConstIndex; // 0x7c
	FVector2D ConstSeed; // 0x80
};

struct UAnimSingleNodeInstance : UAnimInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> Nodes; // 0x40
};

struct UNiagaraLightRendererProperties : UNiagaraRendererProperties {
	char bUseInverseSquaredFalloff : 1; // 0x88
	char bAffectsTranslucency : 1; // 0x88
	char bAlphaScalesBrightness : 1; // 0x88
	float RadiusScale; // 0x8c
	float DefaultExponent; // 0x90
	FVector ColorAdd; // 0x94
	int32_t RendererVisibility; // 0xa0
	FNiagaraVariableAttributeBinding LightRenderingEnabledBinding; // 0xa8
	FNiagaraVariableAttributeBinding LightExponentBinding; // 0x100
	FNiagaraVariableAttributeBinding PositionBinding; // 0x158
	FNiagaraVariableAttributeBinding ColorBinding; // 0x1b0
	FNiagaraVariableAttributeBinding RadiusBinding; // 0x208
	FNiagaraVariableAttributeBinding VolumetricScatteringBinding; // 0x260
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x2b8
};

struct UMovieSceneByteSection : UMovieSceneSection {
	FMovieSceneByteChannel ByteCurve; // 0xf0
};

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct UPortalWarsGamepadBindingActionWidget : UPortalWarsUserWidget {
	UPortalWarsButton* ActionButton; // 0x2a8
	UTextBlock* ActionText; // 0x2b0
	UImage* ButtonBackground; // 0x2b8
	UImage* ButtonIcon; // 0x2c0
	FMulticastInlineDelegate OnActionSelected; // 0x2c8
	FSlateColor StandardTextColor; // 0x2f8
	FSlateColor ActiveTextColor; // 0x320
	FLinearColor StandardBackgroundColor; // 0x348
	FLinearColor ActiveBackgroundColor; // 0x358
};

struct UPortalWarsNavButtonWidget : UPortalWarsEntryWidget {
	FLinearColor NewColor; // 0x420
};

struct UGridPanel : UPanelWidget {
	TArray<float> ColumnFill; // 0x120
	TArray<float> RowFill; // 0x130
};

struct UPhysicsHandleComponent : UActorComponent {
	UPrimitiveComponent* GrabbedComponent; // 0xb0
	char bSoftAngularConstraint : 1; // 0xc0
	char bSoftLinearConstraint : 1; // 0xc0
	char bInterpolateTarget : 1; // 0xc0
	float LinearDamping; // 0xc4
	float LinearStiffness; // 0xc8
	float AngularDamping; // 0xcc
	float AngularStiffness; // 0xd0
	float InterpolationSpeed; // 0x140
};

struct USoundNodeParamCrossFade : USoundNodeDistanceCrossFade {
	FName ParamName; // 0x58
};

struct UMaterialExpressionFunctionInput : UMaterialExpression {
	FExpressionInput Preview; // 0x40
	FName InputName; // 0x54
	FString Description; // 0x60
	FGuid ID; // 0x70
	EFunctionInputType InputType; // 0x80
	FVector4 PreviewValue; // 0x90
	char bUsePreviewValueAsDefault : 1; // 0xa0
	int32_t SortPriority; // 0xa4
	char bCompilingFunctionPreview : 1; // 0xa8
};

struct UMeshSimplificationSettings : UDeveloperSettings {
	FName MeshReductionModuleName; // 0x38
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct ULandscapeInfo : UObject {
	LazyObjectProperty LandscapeActor; // 0x28
	FGuid LandscapeGuid; // 0x44
	int32_t ComponentSizeQuads; // 0x54
	int32_t SubsectionSizeQuads; // 0x58
	int32_t ComponentNumSubsections; // 0x5c
	FVector DrawScale; // 0x60
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x110
};

struct UMediaComponent : UActorComponent {
	UMediaTexture* MediaTexture; // 0xb0
	UMediaPlayer* MediaPlayer; // 0xb8
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x1f8
	char bSupportsDepth : 1; // 0x1f8
	char bNoAlphaChannel : 1; // 0x1f8
	UTexture* Texture; // 0x200
	UTexture* LeftTexture; // 0x208
	char bQuadPreserveTextureRatio : 1; // 0x210
	FVector2D QuadSize; // 0x214
	FBox2D UVRect; // 0x21c
	float CylinderRadius; // 0x230
	float CylinderOverlayArc; // 0x234
	int32_t CylinderHeight; // 0x238
	FEquirectProps EquirectProps; // 0x23c
	EStereoLayerType StereoLayerType; // 0x284
	EStereoLayerShape StereoLayerShape; // 0x285
	UStereoLayerShape* Shape; // 0x288
	int32_t Priority; // 0x290
};

struct UGenlockedTimecodeProvider : UTimecodeProvider {
	bool bUseGenlockToCount; // 0x30
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x220
	FColor BrushColor; // 0x224
	int32_t PolyFlags; // 0x228
	char bColored : 1; // 0x22c
	char bSolidWhenSelected : 1; // 0x22c
	char bPlaceableFromClassBrowser : 1; // 0x22c
	char bNotForClientOrServer : 1; // 0x22c
	UModel* Brush; // 0x230
	UBrushComponent* BrushComponent; // 0x238
	char bInManipulation : 1; // 0x240
	TArray<FGeomSelection> SavedSelections; // 0x248
};

struct UMovieSceneSequenceTickManager : UObject {
	TArray<AActor*> SequenceActors; // 0x28
	UMovieSceneEntitySystemLinker* Linker; // 0x38
};

struct UMotoSynthSource : UObject {
	bool bConvertTo8Bit; // 0x28
	float DownSampleFactor; // 0x2c
	FRuntimeFloatCurve RPMCurve; // 0x30
	TArray<float> SourceData; // 0xb8
	TArray<int16_t> SourceDataPCM; // 0xc8
	int32_t SourceSampleRate; // 0xd8
	TArray<FGrainTableEntry> GrainTable; // 0xe0
};

struct APortalWarsKOTHGameState : APortalWarsGameState {
	APortalWarsKOTHHill* ActiveHill; // 0x7c8
	APortalWarsKOTHHill* NextHill; // 0x7d0
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct ULevelSequenceBurnInOptions : UObject {
	bool bUseBurnIn; // 0x28
	FSoftClassPath BurnInClass; // 0x30
	ULevelSequenceBurnInInitSettings* Settings; // 0x48
};

struct UNodeMappingContainer : UObject {
	TMap<FName, FNodeItem> SourceItems; // 0x28
	TMap<FName, FNodeItem> TargetItems; // 0x78
	TMap<FName, FName> SourceToTarget; // 0xc8
	TSoftObjectPtr<UObject> SourceAsset; // 0x118
	TSoftObjectPtr<UObject> TargetAsset; // 0x140
};

struct USoundNodeModulatorContinuous : USoundNode {
	FModulatorContinuousParams PitchModulationParams; // 0x48
	FModulatorContinuousParams VolumeModulationParams; // 0x68
};

struct ASkyAtmosphere : AInfo {
	USkyAtmosphereComponent* SkyAtmosphereComponent; // 0x220
};

struct UPortalWarsContaminationPlayerStatusWidget : UPortalWarsRoundPlayerStatusWidget {
	UTexture2D* SelfPlayerImage; // 0x2a8
	UTexture2D* RedZombieImage; // 0x2b0
	UTexture2D* BlueZombieImage; // 0x2b8
	UTexture2D* SelfZombieImage; // 0x2c0
};

struct UMaterialExpressionVirtualTextureFeatureSwitch : UMaterialExpression {
	FExpressionInput No; // 0x40
	FExpressionInput Yes; // 0x54
};

struct UReplaySubsystem : UGameInstanceSubsystem {
	bool bLoadDefaultMapOnStop; // 0x30
};

struct UPortalWarsChallengesWidget : UPortalWarsMenuWidget {
	UPortalWarsChallengesSubWidget* InspectWidget; // 0x338
	UPanelWidget* WeaponPanel; // 0x340
	UPortalWarsChallengeButtonWidget* WeaponChallengeButtonWidgetClass; // 0x348
	UPortalWarsChallengeButtonWidget* FeaturedChallengeButton; // 0x350
	TMap<EChallengeType, UPortalWarsChallengesSubWidget*> ChallengeInspectWidgetClasses; // 0x358
};

struct UPortalWarsDOMHUDOverlayWidget : UUserWidget {
	UPortalWarsDOMHillStatusWidget* DOMHillStatus; // 0x260
	UHorizontalBox* TopHills; // 0x268
	UHorizontalBox* BottomHills; // 0x270
	UPortalWarsDOMControlledHillWidget* ControlledHillWidgetClass; // 0x278
};

struct APortalWarsGGPlayerState : APortalWarsPlayerState {
	char CurrentWeaponIndex; // 0xac8
};

struct UAISenseConfig_Hearing : UAISenseConfig {
	UAISense_Hearing* Implementation; // 0x48
	float HearingRange; // 0x50
	float LoSHearingRange; // 0x54
	char bUseLoSHearing : 1; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
};

struct UMaterialExpressionNormalize : UMaterialExpression {
	FExpressionInput VectorInput; // 0x40
};

struct USpinBox : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	FSpinBoxStyle WidgetStyle; // 0x120
	USlateWidgetStyleAsset* Style; // 0x408
	int32_t MinFractionalDigits; // 0x410
	int32_t MaxFractionalDigits; // 0x414
	bool bAlwaysUsesDeltaSnap; // 0x418
	float Delta; // 0x41c
	float SliderExponent; // 0x420
	FSlateFontInfo Font; // 0x428
	ETextJustify Justification; // 0x480
	float MinDesiredWidth; // 0x484
	bool ClearKeyboardFocusOnCommit; // 0x488
	bool SelectAllTextOnCommit; // 0x489
	FSlateColor ForegroundColor; // 0x490
	FMulticastInlineDelegate OnValueChanged; // 0x4b8
	FMulticastInlineDelegate OnValueCommitted; // 0x4c8
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d8
	FMulticastInlineDelegate OnEndSliderMovement; // 0x4e8
	char bOverride_MinValue : 1; // 0x4f8
	char bOverride_MaxValue : 1; // 0x4f8
	char bOverride_MinSliderValue : 1; // 0x4f8
	char bOverride_MaxSliderValue : 1; // 0x4f8
	float MinValue; // 0x4fc
	float MaxValue; // 0x500
	float MinSliderValue; // 0x504
	float MaxSliderValue; // 0x508
};

struct AGameSession : AInfo {
	int32_t MaxSpectators; // 0x220
	int32_t MaxPlayers; // 0x224
	int32_t MaxPartySize; // 0x228
	char MaxSplitscreensPerConnection; // 0x22c
	bool bRequiresPushToTalk; // 0x22d
	FName SessionName; // 0x230
};

struct UBTDecorator_PortalIsNearSelf : UBTDecorator {
	float IdealXYRange; // 0x68
	bool bLinkedPortalsOnly; // 0x6c
};

struct UMediaPlaylist : UObject {
	TArray<UMediaSource*> Items; // 0x28
};

struct ALightmassPortal : AActor {
	ULightmassPortalComponent* PortalComponent; // 0x220
};

struct APWTutorialPlayerController : APortalWarsPlayerController {
	float TimeBetweenStages; // 0x6d0
	float TimeBeforeFreezingPlayer; // 0x6d4
	float TimeBeforeUnfreezingPlayer; // 0x6d8
	float TimeBeforeReturningToMainMenu; // 0x6dc
	float TimeBeforePlayingTutorialCompleteVideo; // 0x6e0
	FVector PlayableArea1; // 0x6e8
	FVector PlayableArea2; // 0x6f4
	FVector PlayableAreaLoc1; // 0x700
	FVector PlayableAreaLoc2; // 0x70c
	UMaterialParameterCollection* FloorMPC; // 0x718
	float FloorRevealStep; // 0x728
	TArray<float> SideRevealMax; // 0x730
	float RevealMax; // 0x740
};

struct UImgMediaSettings : UObject {
	FFrameRate DefaultFrameRate; // 0x28
	float CacheBehindPercentage; // 0x30
	float CacheSizeGB; // 0x34
	int32_t CacheThreads; // 0x38
	int32_t CacheThreadStackSizeKB; // 0x3c
	float GlobalCacheSizeGB; // 0x40
	bool UseGlobalCache; // 0x44
	uint32_t ExrDecoderThreads; // 0x48
	FString DefaultProxy; // 0x50
	bool UseDefaultProxy; // 0x60
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UParticleModuleMeshMaterial : UParticleModuleMaterialBase {
	TArray<UMaterialInterface*> MeshMaterials; // 0x30
};

struct UPortalWarsBattlePassWidget : UPortalWarsRewardPassWidget {
	UWidget* PremiumActiveRoot; // 0x438
	UPortalWarsBPRedeemableButton* PurchaseButton; // 0x440
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UPortalWarsCustomLobbyWidget : UPortalWarsLobbyWidget {
	UPortalWarsButtonWidget* StartGameButton; // 0x2f8
	UPortalWarsButtonWidget* InviteButton; // 0x300
	UPortalWarsDialogWidget* InviteDialogWidgetClass; // 0x308
	UPanelWidget* SettingsMenuPanel; // 0x310
	UWidgetAnimation* OpenSettingsAnimation; // 0x318
	UWidget* ActiveSettingsMenu; // 0x320
	UTextBlock* CustomGameText; // 0x330
	UPortalWarsLobbySelectorButtonWidget* SettingsSelectorButton; // 0x338
	UPortalWarsMenuWidget* SettingsMenuClass; // 0x340
	UPortalWarsLobbySelectorButtonWidget* MapSelectorButton; // 0x348
	UPortalWarsMenuWidget* MapSelectorMenuClass; // 0x350
	UPortalWarsLobbySelectorButtonWidget* ModeSelectorButton; // 0x358
	UPortalWarsMenuWidget* ModeSelectorMenuClass; // 0x360
	UPortalWarsLobbySelectorButtonWidget* LastUsedSelector; // 0x368
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct UAISense : UObject {
	float DefaultExpirationAge; // 0x28
	EAISenseNotifyType NotifyType; // 0x2c
	char bWantsNewPawnNotification : 1; // 0x30
	char bAutoRegisterAllPawnsAsSources : 1; // 0x30
	UAIPerceptionSystem* PerceptionSystemInstance; // 0x38
};

struct UClothingSimulationInteractor : UObject {
	TMap<FName, UClothingInteractor*> ClothingInteractors; // 0x28
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x30
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x38
};

struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x570
	char bIsFrozenRendering : 1; // 0x570
	char bIsOrbitingSelectedActor : 1; // 0x570
	char bOrbitPivotUseCenter : 1; // 0x570
	char bEnableBufferVisualization : 1; // 0x570
	char bEnableBufferVisualizationFullMode : 1; // 0x570
	char bIsBufferVisualizationInputSetup : 1; // 0x570
	char bLastDisplayEnabled : 1; // 0x570
	UDrawFrustumComponent* DrawFrustum; // 0x578
	AActor* SelectedActor; // 0x580
	UPrimitiveComponent* SelectedComponent; // 0x588
	FHitResult SelectedHitPoint; // 0x590
	APlayerController* OriginalControllerRef; // 0x618
	UPlayer* OriginalPlayer; // 0x620
	float SpeedScale; // 0x628
	float InitialMaxSpeed; // 0x62c
	float InitialAccel; // 0x630
	float InitialDecel; // 0x634
};

struct UPortalWarsMatchResultWidget : UUserWidget {
	UTextBlock* TitleText; // 0x260
	UImage* LeftStarImage; // 0x268
	UImage* RightStarImage; // 0x270
	UImage* TopBorderImage; // 0x278
	UImage* BottomBorderImage; // 0x280
	UWidgetAnimation* FadeInAnimation; // 0x2a0
};

struct UInterpTrackInstSlomo : UInterpTrackInst {
	float OldTimeDilation; // 0x28
};

struct UMaterialExpressionPreviousFrameSwitch : UMaterialExpression {
	FExpressionInput CurrentFrame; // 0x40
	FExpressionInput PreviousFrame; // 0x54
};

struct UMaterialExpressionStaticComponentMaskParameter : UMaterialExpressionParameter {
	char DefaultR : 1; // 0x58
	char DefaultG : 1; // 0x58
	char DefaultB : 1; // 0x58
	char DefaultA : 1; // 0x58
};

struct ULevelVariantSets : UObject {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct UMaterialExpressionLandscapePhysicalMaterialOutput : UMaterialExpressionCustomOutput {
	TArray<FPhysicalMaterialInput> Inputs; // 0x40
};

struct UMaterialExpressionVectorNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	EVectorNoiseFunction NoiseFunction; // 0x54
	int32_t Quality; // 0x58
	char bTiling : 1; // 0x5c
	uint32_t TileSize; // 0x60
};

struct UExporter : UObject {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int32_t PreferredFormatIndex; // 0x58
	int32_t TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
	UAssetExportTask* ExportTask; // 0x68
};

struct UInterpTrackFade : UInterpTrackFloatBase {
	char bPersistFade : 1; // 0x90
	char bFadeAudio : 1; // 0x90
	FLinearColor FadeColor; // 0x94
};

struct UPortalWarsPlaylistGameModeSelect : UPortalWarsMenuWidget {
	UPortalWarsPlaylistGameModeEntry* GameModeEntryWidgetClass; // 0x338
	UPanelWidget* ModesPanel; // 0x340
	UPortalWarsButtonWidget* PlayButton; // 0x348
	UTextBlock* NoteText; // 0x350
};

struct UMaterialParameterCollectionInstance : UObject {
	UMaterialParameterCollection* Collection; // 0x30
};

struct UPortalWarsStatsEntryWidget : UPortalWarsUserWidget {
	UTextBlock* GamesWonText; // 0x2a8
	UTextBlock* GamesPlayedText; // 0x2b0
	UTextBlock* KillsText; // 0x2b8
	UTextBlock* AssistsText; // 0x2c0
	UTextBlock* DeathsText; // 0x2c8
	UTextBlock* KdText; // 0x2d0
	UTextBlock* KadText; // 0x2d8
	UTextBlock* SuicidesText; // 0x2e0
	UTextBlock* TeabagsText; // 0x2e8
	UTextBlock* MeleeKillsText; // 0x2f0
	UTextBlock* PortalKillsText; // 0x2f8
	UTextBlock* KillsThruPortalText; // 0x300
	UTextBlock* DoubleKillsText; // 0x308
	UTextBlock* TripleKillsText; // 0x310
	UTextBlock* QuadKillsText; // 0x318
	UTextBlock* QuintKillsText; // 0x320
	UTextBlock* KillStreak1Text; // 0x328
	UTextBlock* KillStreak2Text; // 0x330
	UTextBlock* KillStreak3Text; // 0x338
	UTextBlock* KillStreak4Text; // 0x340
	UTextBlock* KillStreak5Text; // 0x348
	UTextBlock* KillStreak6Text; // 0x350
	UTextBlock* DamageDealtText; // 0x358
	bool bUseGoldStyle; // 0x3d0
	UImage* BackgroundImage; // 0x3d8
	UTexture2D* DefaultBackgroundImage; // 0x3e0
	UTexture2D* GoldBackgroundImage; // 0x3e8
	FLinearColor DefaultFeatureTextColor; // 0x3f0
	FLinearColor GoldFeatureTextColor; // 0x400
	FLinearColor DefaultTitleTextColor; // 0x410
	FLinearColor GoldTitleTextColor; // 0x420
	FLinearColor DefaultSmallTitleTextColor; // 0x430
	FLinearColor GoldSmallTitleTextColor; // 0x440
};

struct UPortalWarsVIPHUDOverlayWidget : UUserWidget {
	float TimeBeforeFading; // 0x260
	float SpectatorShowPopupMaxTimeAlive; // 0x264
	UWidgetAnimation* FadeOutAnimation; // 0x268
	UWidgetSwitcher* OvertimeSwitcher; // 0x270
	UScaleBox* NoticeScaleBox; // 0x278
	UScaleBox* BannerScaleBox; // 0x280
	UCanvasPanel* RootCanvas; // 0x288
};

struct UActorSequenceComponent : UActorComponent {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0xb0
	UActorSequence* Sequence; // 0xc8
	UActorSequencePlayer* SequencePlayer; // 0xd0
};

struct UBlueprintCore : UObject {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	FGuid BlueprintGuid; // 0x3c
};

struct URadialFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Radius; // 0xc0
	FVector Position; // 0xc4
	EFieldFalloffType Falloff; // 0xd0
};

struct ANavigationObjectBase : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x228
	UBillboardComponent* GoodSprite; // 0x230
	UBillboardComponent* BadSprite; // 0x238
	char bIsPIEPlayerStart : 1; // 0x240
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int32_t SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int32_t PeakActiveParticles; // 0x50
	int32_t InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32_t DetailModeBitmask; // 0x5c
};

struct UMaterialExpressionSquareRoot : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x1f8
	float Brightness; // 0x208
	float Intensity; // 0x20c
	FColor LightColor; // 0x210
	char bAffectsWorld : 1; // 0x214
	char CastShadows : 1; // 0x214
	char CastStaticShadows : 1; // 0x214
	char CastDynamicShadows : 1; // 0x214
	char bAffectTranslucentLighting : 1; // 0x214
	char bTransmission : 1; // 0x214
	char bCastVolumetricShadow : 1; // 0x214
	char bCastDeepShadow : 1; // 0x214
	char bCastRaytracedShadow : 1; // 0x215
	char bAffectReflection : 1; // 0x215
	char bAffectGlobalIllumination : 1; // 0x215
	float DeepShadowLayerDistribution; // 0x218
	float IndirectLightingIntensity; // 0x21c
	float VolumetricScatteringIntensity; // 0x220
	int32_t SamplesPerPixel; // 0x224
};

struct UPortalWarsOutOfBoundsWidget : UUserWidget {
	UCanvasPanel* OutOfBoundsPanel; // 0x260
	UTextBlock* CountdownText; // 0x268
};

struct UBackgroundBlur : UContentWidget {
	FMargin Padding; // 0x120
	EHorizontalAlignment HorizontalAlignment; // 0x130
	EVerticalAlignment VerticalAlignment; // 0x131
	bool bApplyAlphaToBlur; // 0x132
	float BlurStrength; // 0x134
	bool bOverrideAutoRadiusCalculation; // 0x138
	int32_t BlurRadius; // 0x13c
	FSlateBrush LowQualityFallbackBrush; // 0x140
};

struct UGizmoComponentAxisSource : UObject {
	USceneComponent* Component; // 0x30
	int32_t AxisIndex; // 0x38
	bool bLocalAxes; // 0x3c
};

struct UUniformVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Direction; // 0xb4
};

struct UGizmoBoxComponent : UGizmoBaseComponent {
	FVector Origin; // 0x470
	FQuat Rotation; // 0x480
	FVector Dimensions; // 0x490
	float LineThickness; // 0x49c
	bool bRemoveHiddenLines; // 0x4a0
	bool bEnableAxisFlip; // 0x4a1
};

struct UMaterialExpressionDotProduct : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct UPortalWarsServerBrowserWidget : UPortalWarsMenuWidget {
	UPortalWarsServerEntryWidget* ServerEntryWidgetClass; // 0x350
	UPanelWidget* ServerList; // 0x358
	UPortalWarsNumericCarouselWidget* PaginatorCarousel; // 0x360
	int32_t NumEntriesPerPage; // 0x368
	UPortalWarsButtonWidget* FilterButton; // 0x370
	UPortalWarsCustomGameFiltersWidget* ServerFiltersDialogWidgetClass; // 0x378
	UWidget* FilterIndicator; // 0x380
	UPortalWarsButtonWidget* RefreshButton; // 0x388
	FMulticastInlineDelegate OnCreateButtonClickedDelegate; // 0x390
	UPortalWarsButtonWidget* CreateButton; // 0x3a0
	UPortalWarsServerEntryWidget* PreviewServerEntry; // 0x3a8
	UPortalWarsButtonWidget* JoinButton; // 0x3b0
	UPortalWarsJoinServerDialogWidget* JoinServerDialogWidgetClass; // 0x3b8
	int32_t MaxVisibleEntries; // 0x3c4
};

struct URuntimeVirtualTexture : UObject {
	int32_t TileCount; // 0x28
	int32_t TileSize; // 0x2c
	int32_t TileBorderSize; // 0x30
	ERuntimeVirtualTextureMaterialType MaterialType; // 0x34
	bool bCompressTextures; // 0x35
	bool bClearTextures; // 0x36
	bool bSinglePhysicalSpace; // 0x37
	bool bPrivateSpace; // 0x38
	bool bAdaptive; // 0x39
	bool bContinuousUpdate; // 0x3a
	int32_t RemoveLowMips; // 0x3c
	TextureGroup LODGroup; // 0x40
	int32_t Size; // 0x44
	URuntimeVirtualTextureStreamingProxy* StreamingTexture; // 0x48
};

struct USynthKnob : UWidget {
	float Value; // 0x108
	float StepSize; // 0x10c
	float MouseSpeed; // 0x110
	float MouseFineTuneSpeed; // 0x114
	char ShowTooltipInfo : 1; // 0x118
	FText ParameterName; // 0x120
	FText ParameterUnits; // 0x138
	FDelegate ValueDelegate; // 0x150
	FSynthKnobStyle WidgetStyle; // 0x160
	bool locked; // 0x398
	bool IsFocusable; // 0x399
	FMulticastInlineDelegate OnMouseCaptureBegin; // 0x3a0
	FMulticastInlineDelegate OnMouseCaptureEnd; // 0x3b0
	FMulticastInlineDelegate OnControllerCaptureBegin; // 0x3c0
	FMulticastInlineDelegate OnControllerCaptureEnd; // 0x3d0
	FMulticastInlineDelegate OnValueChanged; // 0x3e0
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x220
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x228
};

struct UWidgetSwitcher : UPanelWidget {
	int32_t ActiveWidgetIndex; // 0x120
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x110
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1b0
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1b1
	char bFollow : 1; // 0x1b4
	char bReverse : 1; // 0x1b4
	char bForceUpright : 1; // 0x1b4
};

struct USpinBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FSpinBoxStyle SpinBoxStyle; // 0x30
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UPortalWarsJoinInProgressWidget : UUserWidget {
	UWidgetAnimation* FadeOutAnimation; // 0x260
	float TimeBeforeFadingOut; // 0x268
};

struct UGizmoAxisIntervalParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoFloatParameterSource> FloatParameterSource; // 0x48
	float MinParameter; // 0x58
	float MaxParameter; // 0x5c
};

struct UUMGSequencePlayer : UObject {
	UWidgetAnimation* Animation; // 0x418
	FMovieSceneRootEvaluationTemplateInstance RootTemplateInstance; // 0x428
};

struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	FVector Min; // 0x38
	FVector Max; // 0x44
};

struct APlanarReflection : ASceneCapture {
	UPlanarReflectionComponent* PlanarReflectionComponent; // 0x230
	bool bShowPreviewPlane; // 0x238
};

struct UNiagaraDataInterfaceVector4Curve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
	FRichCurve WCurve; // 0x1f0
};

struct UTransformGizmo : UInteractiveGizmo {
	UTransformProxy* ActiveTarget; // 0x40
	bool bSnapToWorldGrid; // 0x48
	bool bGridSizeIsExplicit; // 0x49
	FVector ExplicitGridSize; // 0x4c
	bool bRotationGridSizeIsExplicit; // 0x58
	FRotator ExplicitRotationGridSize; // 0x5c
	bool bSnapToWorldRotGrid; // 0x68
	bool bUseContextCoordinateSystem; // 0x69
	EToolContextCoordinateSystem CurrentCoordinateSystem; // 0x6c
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x100
	TArray<UPrimitiveComponent*> NonuniformScaleComponents; // 0x110
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x120
	UGizmoConstantFrameAxisSource* CameraAxisSource; // 0x140
	UGizmoComponentAxisSource* AxisXSource; // 0x148
	UGizmoComponentAxisSource* AxisYSource; // 0x150
	UGizmoComponentAxisSource* AxisZSource; // 0x158
	UGizmoComponentAxisSource* UnitAxisXSource; // 0x160
	UGizmoComponentAxisSource* UnitAxisYSource; // 0x168
	UGizmoComponentAxisSource* UnitAxisZSource; // 0x170
	UGizmoTransformChangeStateTarget* StateTarget; // 0x178
	UGizmoScaledTransformSource* ScaledTransformSource; // 0x180
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UMaterialExpressionSamplePhysicsScalarField : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
	EFieldScalarType FieldTarget; // 0x54
};

struct UPortalWarsTxnDialogWidget : UPortalWarsDialogWidget {
	UWidgetSwitcher* TransactionSwitcher; // 0x3a0
	UPortalWarsButtonWidget* ConfirmButton; // 0x3a8
	UTextBlock* ProcessingText; // 0x3b0
	UTextBlock* SuccessText; // 0x3b8
};

struct UHighlightsSummaryAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UAnimNotify_PlayMontageNotifyWindow : UAnimNotifyState {
	FName NotifyName; // 0x30
};

struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bIsDirty : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct UNiagaraPreviewAxis_InterpParamInt32 : UNiagaraPreviewAxis_InterpParamBase {
	int32_t Min; // 0x38
	int32_t Max; // 0x3c
};

struct APortalWarsVIP : APortalWarsGameMode {
	TArray<TSoftClassPtr<UObject>> VIPDefaultInventoryClasses; // 0x6a8
	int32_t VIPKillScore; // 0x6b8
	int32_t VIPSuicideScore; // 0x6bc
};

struct UPortalWarsRankLeaderboardWidget : UPortalWarsMenuWidget {
	UPortalWarsLeaderboardWidget* Leaderboard; // 0x338
	UTextBlock* PlaylistText; // 0x340
	UPortalWarsButtonWidget* ChangePlaylistButton; // 0x348
	UPortalWarsButtonWidget* ToggleCrossPlayButton; // 0x350
	UComboBoxString* PlaylistComboBox; // 0x358
	TArray<int32_t> PlaylistIDs; // 0x360
};

struct UMovieSceneCameraCutTrack : UMovieSceneNameableTrack {
	bool bCanBlend; // 0x78
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct UNiagaraDataInterfaceCurveBase : UNiagaraDataInterface {
	TArray<float> ShaderLUT; // 0x38
	float LUTMinTime; // 0x48
	float LUTMaxTime; // 0x4c
	float LUTInvTimeRange; // 0x50
	float LUTNumSamplesMinusOne; // 0x54
	char bUseLUT : 1; // 0x58
	char bExposeCurve : 1; // 0x58
	FName ExposedName; // 0x5c
	UTexture2D* ExposedTexture; // 0x68
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct UPortalWarsMapSelectorWidget : UPortalWarsMenuWidget {
	UPanelWidget* ItemsPanel; // 0x338
	UPortalWarsMapSelectorEntryWidget* MapSelectorEntryClass; // 0x340
	UImage* MapImage; // 0x348
	UTextBlock* MapName; // 0x350
	UTextBlock* MapDescription; // 0x358
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct UPortalWarsBPPurchaseDialogWidget : UPortalWarsTxnDialogWidget {
	UPanelWidget* RewardsPanel; // 0x3c8
	UPortalWarsBattlePassEntryWidget* RewardEntryWidgetClass; // 0x3d0
	UPortalWarsButtonWidget* BuyPremiumButton; // 0x3d8
	UPortalWarsButtonWidget* BuyBundleButton; // 0x3e0
	UPortalWarsButtonWidget* BuyLevelsButton; // 0x3e8
	UWidgetSwitcher* ActionSwitcher; // 0x3f0
	UPortalWarsButtonWidget* ViewBattlePassButton; // 0x3f8
};

struct UPortalWarsFileOptionsDialogWidget : UPortalWarsDialogWidget {
	UPortalWarsButtonWidget* SaveButton; // 0x390
	UPortalWarsButtonWidget* SaveAsButton; // 0x398
	UPortalWarsButtonWidget* RenameButton; // 0x3a0
	UPortalWarsButtonWidget* DeleteButton; // 0x3a8
	UTextBlock* ManageText; // 0x3b0
	UPortalWarsTextInputWidget* SaveAsInput; // 0x3b8
	UTextBlock* SaveAsText; // 0x3c0
	UPortalWarsTextInputWidget* RenameInput; // 0x3c8
	UTextBlock* RenameText; // 0x3d0
	UTextBlock* DeleteText; // 0x3d8
	UPortalWarsButtonWidget* AcceptButton; // 0x3e0
};

struct UMaterialExpressionSetMaterialAttributes : UMaterialExpression {
	TArray<FExpressionInput> Inputs; // 0x40
	TArray<FGuid> AttributeSetTypes; // 0x50
};

struct UInterpTrackInstVectorMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<FVector> ResetVectors; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackVectorMaterialParam* InstancedTrack; // 0x58
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int32_t RowIndex; // 0xa8
	int32_t OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UNavigationSystemV1 : UNavigationSystemBase {
	ANavigationData* MainNavData; // 0x28
	ANavigationData* AbstractNavData; // 0x30
	FName DefaultAgentName; // 0x38
	TSoftClassPtr<UObject> CrowdManagerClass; // 0x40
	char bAutoCreateNavigationData : 1; // 0x68
	char bSpawnNavDataInNavBoundsLevel : 1; // 0x68
	char bAllowClientSideNavigation : 1; // 0x68
	char bShouldDiscardSubLevelNavData : 1; // 0x68
	char bTickWhilePaused : 1; // 0x68
	char bSupportRebuilding : 1; // 0x68
	char bInitialBuildingLocked : 1; // 0x68
	char bSkipAgentHeightCheckWhenPickingNavData : 1; // 0x69
	char bGenerateNavigationOnlyAroundNavigationInvokers : 1; // 0x69
	float ActiveTilesUpdateInterval; // 0x6c
	ENavDataGatheringModeConfig DataGatheringMode; // 0x70
	float DirtyAreaWarningSizeThreshold; // 0x74
	TArray<FNavDataConfig> SupportedAgents; // 0x78
	FNavAgentSelector SupportedAgentsMask; // 0x88
	TArray<ANavigationData*> NavDataSet; // 0x90
	TArray<ANavigationData*> NavDataRegistrationQueue; // 0xa0
	FMulticastInlineDelegate OnNavDataRegisteredEvent; // 0xc0
	FMulticastInlineDelegate OnNavigationGenerationFinishedDelegate; // 0xd0
	FNavigationSystemRunMode OperationMode; // 0x1bc
	float DirtyAreasUpdateFreq; // 0x15bc
};

struct UBTService_RandomJump : UBTService {
	float MinDistanceToEnd; // 0x70
	float MinVelocity; // 0x74
	float EpsilonVelocityParallelToPath; // 0x78
};

struct UPortalWarsModeSelectorEntryWidget : UPortalWarsEntryWidget {
	UWidget* CustomIndicator; // 0x420
	UPortalWarsButton* EditButton; // 0x680
};

struct UMovieSceneCameraShakeSourceTriggerTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x80
};

struct UPortalWarsRoundScoreboardWidget : UUserWidget {
	UTextBlock* TopNameText; // 0x260
	UTextBlock* BottomNameText; // 0x268
	UTextBlock* TopScoreText; // 0x270
	UTextBlock* BottomScoreText; // 0x278
	UHorizontalBox* RoundEntries; // 0x280
	UPortalWarsRoundScoreboardEntryWidget* RoundEntryWidgetClass; // 0x288
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bInInteraction; // 0x88
	FVector RotationOrigin; // 0x8c
	FVector RotationAxis; // 0x98
	FVector RotationPlaneX; // 0xa4
	FVector RotationPlaneY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	float InteractionStartAngle; // 0xd4
	float InteractionCurAngle; // 0xd8
};

struct APortalWarsRaceLobbyGameMode : APortalWarsLobbyGameMode {
	FString RaceGameModeAlias; // 0x378
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UPawnNoiseEmitterComponent : UActorComponent {
	char bAIPerceptionSystemCompatibilityMode : 1; // 0xb0
	FVector LastRemoteNoisePosition; // 0xb4
	float NoiseLifetime; // 0xc0
	float LastRemoteNoiseVolume; // 0xc4
	float LastRemoteNoiseTime; // 0xc8
	float LastLocalNoiseVolume; // 0xcc
	float LastLocalNoiseTime; // 0xd0
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0x198
	EARDepthAccuracy DepthAccuracy; // 0x199
	bool bIsTemporallySmoothed; // 0x19a
};

struct ULandscapeWeightmapUsage : UObject {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x28
	FGuid LayerGuid; // 0x48
};

struct UDialogueVoice : UObject {
	EGrammaticalGender Gender; // 0x28
	EGrammaticalNumber Plurality; // 0x29
	FGuid LocalizationGUID; // 0x2c
};

struct UDistributionFloatUniformCurve : UDistributionFloat {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct UBodySetupCore : UObject {
	FName BoneName; // 0x28
	EPhysicsType PhysicsType; // 0x30
	ECollisionTraceFlag CollisionTraceFlag; // 0x31
	EBodyCollisionResponse CollisionReponse; // 0x32
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0x1a8
	TWeakObjectPtr<UWorld> World; // 0x1b8
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x1c0
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x9c
	FSubmixEffectDelaySettings DynamicSettings; // 0xa8
};

struct UPortalWarsPauseMenuWidget : UPortalWarsMenuSelectWidget {
	UPortalWarsButtonWidget* ResumeButton; // 0x3b0
	UPortalWarsButtonWidget* SettingsButton; // 0x3b8
	UPortalWarsButtonWidget* PlayersButton; // 0x3c0
	UPortalWarsButtonWidget* ExitButton; // 0x3c8
	UPortalWarsButtonWidget* SwitchTeamsButton; // 0x3d0
	UPortalWarsButtonWidget* EndMatchButton; // 0x3d8
	UPortalWarsButtonWidget* RestartRaceButton; // 0x3e0
	UPortalWarsButtonWidget* RestartStageButton; // 0x3e8
};

struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	ENDIStaticMesh_SourceMode SourceMode; // 0x38
	UStaticMesh* DefaultMesh; // 0x40
	AActor* Source; // 0x48
	UStaticMeshComponent* SourceComponent; // 0x50
	FNDIStaticMeshSectionFilter SectionFilter; // 0x58
	bool bUsePhysicsBodyVelocity; // 0x68
	TArray<FName> FilteredSockets; // 0x70
};

struct USlateWidgetStyleAsset : UObject {
	USlateWidgetStyleContainerBase* CustomStyle; // 0x28
};

struct UMovieScene3DConstraintSection : UMovieSceneSection {
	FGuid ConstraintId; // 0xe8
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf8
};

struct UInAppPurchaseRestoreCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UEditableText : UWidget {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FText HintText; // 0x130
	FDelegate HintTextDelegate; // 0x148
	FEditableTextStyle WidgetStyle; // 0x158
	USlateWidgetStyleAsset* Style; // 0x378
	USlateBrushAsset* BackgroundImageSelected; // 0x380
	USlateBrushAsset* BackgroundImageComposing; // 0x388
	USlateBrushAsset* CaretImage; // 0x390
	FSlateFontInfo Font; // 0x398
	FSlateColor ColorAndOpacity; // 0x3f0
	bool IsReadOnly; // 0x418
	bool IsPassword; // 0x419
	float MinimumDesiredWidth; // 0x41c
	bool IsCaretMovedWhenGainFocus; // 0x420
	bool SelectAllTextWhenFocused; // 0x421
	bool RevertTextOnEscape; // 0x422
	bool ClearKeyboardFocusOnCommit; // 0x423
	bool SelectAllTextOnCommit; // 0x424
	bool AllowContextMenu; // 0x425
	EVirtualKeyboardType KeyboardType; // 0x426
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x427
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0x428
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x429
	ETextJustify Justification; // 0x42a
	FShapedTextOptions ShapedTextOptions; // 0x42b
	FMulticastInlineDelegate OnTextChanged; // 0x430
	FMulticastInlineDelegate OnTextCommitted; // 0x440
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct AScoreboardComponent : ACullableActor {
	TArray<FString> TextArray; // 0x228
	UMaterialInterface* TextMaterial; // 0x238
	UDataTable* FontTable; // 0x240
	TArray<UStaticMesh*> AlwaysLoadedCharacterMeshes; // 0x248
	float FieldWidth; // 0x258
	float SpaceWidth; // 0x25c
	float Kerning; // 0x260
	float LineHeight; // 0x264
	ETextAlignment TextAlignment; // 0x268
	TArray<UStaticMeshComponent*> CharacterMeshComponents; // 0x270
};

struct UProceduralFoliageTile : UObject {
	UProceduralFoliageSpawner* FoliageSpawner; // 0x28
	TArray<FProceduralFoliageInstance> InstancesArray; // 0xd0
};

struct UTireConfig : UDataAsset {
	float FrictionScale; // 0x30
	TArray<FTireConfigMaterialFriction> TireFrictionScales; // 0x38
};

struct UNavigationSystemConfig : UObject {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct UBTDecorator_CompareBBEntries : UBTDecorator {
	EBlackBoardEntryComparison Operator; // 0x68
	FBlackboardKeySelector BlackboardKeyA; // 0x70
	FBlackboardKeySelector BlackboardKeyB; // 0x98
};

struct UMaterialExpressionDesaturation : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Fraction; // 0x54
	FLinearColor LuminanceFactors; // 0x68
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UMaterialExpressionDynamicParameter : UMaterialExpression {
	TArray<FString> ParamNames; // 0x40
	FLinearColor DefaultValue; // 0x50
	uint32_t ParameterIndex; // 0x60
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	bool bLockPreviousCamera; // 0xf0
	FGuid CameraGuid; // 0xf4
	FMovieSceneObjectBindingID CameraBindingID; // 0x104
	FTransform InitialCameraCutTransform; // 0x120
	bool bHasInitialCameraCutTransform; // 0x150
};

struct UEnvQueryGenerator_Cone : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue AlignedPointsDistance; // 0xb8
	FAIDataProviderFloatValue ConeDegrees; // 0xf0
	FAIDataProviderFloatValue AngleStep; // 0x128
	FAIDataProviderFloatValue Range; // 0x160
	UEnvQueryContext* CenterActor; // 0x198
	char bIncludeContextLocation : 1; // 0x1a0
};

struct UNiagaraDataInterfaceGrid3D : UNiagaraDataInterfaceRWBase {
	FIntVector NumCells; // 0xd8
	float CellSize; // 0xe4
	int32_t NumCellsMaxAxis; // 0xe8
	ESetResolutionMethod SetResolutionMethod; // 0xec
	FVector WorldBBoxSize; // 0xf0
};

struct UInterpTrackAnimControl : UInterpTrackFloatBase {
	FName SlotName; // 0x90
	TArray<FAnimControlTrackKey> AnimSeqs; // 0x98
	char bSkipAnimNotifiers : 1; // 0xa8
};

struct APortalWarsTakedownVIPHUD : APortalWarsTakedownHUD {
	UPortalWarsVIPHUDOverlayWidget* VIPHUDOverlayWidget; // 0x450
	UPortalWarsVIPHUDOverlayWidget* VIPHUDOverlayWidgetClass; // 0x458
	UPortalWarsIndicatorWidget* VIPNameIndicatorWidgetClass; // 0x460
	UAkAudioEvent* VipAlertEvent; // 0x468
};

struct UProgressWidgetStyle : USlateWidgetStyleContainerBase {
	FProgressBarStyle ProgressBarStyle; // 0x30
};

struct UNiagaraComponentSettings : UObject {
	TSet<FName> SuppressActivationList; // 0x28
	TSet<FName> ForceAutoPooolingList; // 0x78
	TSet<FNiagaraEmitterNameSettingsRef> SuppressEmitterList; // 0xc8
};

struct UMovieSceneAkAudioRTPCSection : UMovieSceneSection {
	FString Name; // 0xe8
	FRichCurve FloatCurve; // 0xf8
	FMovieSceneFloatChannelSerializationHelper FloatChannelSerializationHelper; // 0x178
};

struct UDecalComponent : USceneComponent {
	UMaterialInterface* DecalMaterial; // 0x1f8
	int32_t SortOrder; // 0x200
	float FadeScreenSize; // 0x204
	float FadeStartDelay; // 0x208
	float FadeDuration; // 0x20c
	float FadeInDuration; // 0x210
	float FadeInStartDelay; // 0x214
	char bDestroyOwnerAfterFade : 1; // 0x218
	FVector DecalSize; // 0x21c
};

struct UWmfMediaSettings : UObject {
	bool AllowNonStandardCodecs; // 0x28
	bool LowLatency; // 0x29
	bool NativeAudioOut; // 0x2a
	bool HardwareAcceleratedVideoDecoding; // 0x2b
};

struct UBTDecorator_BlackboardBase : UBTDecorator {
	FBlackboardKeySelector BlackboardKey; // 0x68
};

struct UPortalWarsBattlePassEntryWidget : UPortalWarsRewardPassEntryWidget {
	UProgressBar* XPProgressBar; // 0x798
	UWidget* FreeIndicator; // 0x7b0
};

struct UBTService_FindPickup : UBTService {
	float NearPickupRadius; // 0x70
	float NeedWeaponPickupRadius; // 0x74
	APortalWarsPickup* SubClassRestriction; // 0x78
	float MinDifficulty; // 0x80
};

struct UPortalWarsRadarWidget : UUserWidget {
	UPortalWarsRadarMarkerWidget* RadarMarkerWidgetClass; // 0x260
	float RadarRadius; // 0x268
	UCanvasPanel* RadarPanel; // 0x270
	UWidgetSwitcher* Quadrant1Switcher; // 0x278
	UWidgetSwitcher* Quadrant2Switcher; // 0x280
	UWidgetSwitcher* Quadrant3Switcher; // 0x288
	UWidgetSwitcher* Quadrant4Switcher; // 0x290
};

struct UNiagaraDataInterfaceGrid2D : UNiagaraDataInterfaceRWBase {
	int32_t NumCellsX; // 0xd8
	int32_t NumCellsY; // 0xdc
	int32_t NumCellsMaxAxis; // 0xe0
	int32_t NumAttributes; // 0xe4
	bool SetGridFromMaxAxis; // 0xe8
	FVector2D WorldBBoxSize; // 0xec
};

struct UConsoleSettings : UObject {
	int32_t MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	bool bDisplayHelpInAutoComplete; // 0x55
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UPortalWarsDialogWidget : UPortalWarsMenuWidget {
	FMulticastInlineDelegate OnDialogClosed; // 0x338
	FMulticastInlineDelegate OnDialogClosedPointer; // 0x348
	float MaxLifetime; // 0x358
	UProgressBar* LifetimeProgressBar; // 0x360
	float MinLifetime; // 0x370
	UPortalWarsButtonWidget* CloseButton; // 0x380
	UWidgetAnimation* OpenAnimation; // 0x388
};

struct UPortalWarsRespawnWidget : UUserWidget {
	UTextBlock* RespawnText; // 0x260
};

struct UWidgetAnimationPlayCallbackProxy : UObject {
	FMulticastInlineDelegate Finished; // 0x28
};

struct APawn : AActor {
	char bUseControllerRotationPitch : 1; // 0x228
	char bUseControllerRotationYaw : 1; // 0x228
	char bUseControllerRotationRoll : 1; // 0x228
	char bCanAffectNavigationGeneration : 1; // 0x228
	float BaseEyeHeight; // 0x22c
	EAutoReceiveInput AutoPossessPlayer; // 0x230
	EAutoPossessAI AutoPossessAI; // 0x231
	char RemoteViewPitch; // 0x232
	AController* AIControllerClass; // 0x238
	APlayerState* PlayerState; // 0x240
	AController* LastHitBy; // 0x250
	AController* Controller; // 0x258
	FVector ControlInputVector; // 0x264
	FVector LastControlInputVector; // 0x270
};

struct UBoxComponent : UShapeComponent {
	FVector BoxExtent; // 0x468
	float LineThickness; // 0x474
};

struct UPlayMontageCallbackProxy : UObject {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct UMoviePlayerSettings : UObject {
	bool bWaitForMoviesToComplete; // 0x28
	bool bMoviesAreSkippable; // 0x29
	TArray<FString> StartupMovies; // 0x30
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UTileView : UListView {
	float EntryHeight; // 0x368
	float EntryWidth; // 0x36c
	EListItemAlignment TileAlignment; // 0x370
	bool bWrapHorizontalNavigation; // 0x371
};

struct UNiagaraDataInterfaceMeshRendererInfo : UNiagaraDataInterface {
	UNiagaraMeshRendererProperties* MeshRenderer; // 0x38
};

struct UNiagaraComponentPool : UObject {
	TMap<UNiagaraSystem*, FNCPool> WorldParticleSystemPools; // 0x28
};

struct UPWVoiceNotifications : UUserWidget {
	UVerticalBox* PlayersVerticalBox; // 0x260
	UPWVoiceNotificationItem* VoiceNotificationItemClass; // 0x268
};

struct USubmixEffectConvolutionReverbPreset : USoundEffectSubmixPreset {
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	FSubmixEffectConvolutionReverbSettings Settings; // 0x70
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x98
	bool bEnableHardwareAcceleration; // 0x99
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x458
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct UMovieSceneLevelVisibilityTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UPortalWarsLoadingScreenWidget : UPortalWarsUserWidget {
	URichTextBlock* TipRichTextBlock; // 0x2a8
};

struct UParticleModuleSpawnPerUnit : UParticleModuleSpawnBase {
	float UnitScalar; // 0x38
	float MovementTolerance; // 0x3c
	FRawDistributionFloat SpawnPerUnit; // 0x40
	float MaxFrameDistance; // 0x70
	char bIgnoreSpawnRateWhenMoving : 1; // 0x74
	char bIgnoreMovementAlongX : 1; // 0x74
	char bIgnoreMovementAlongY : 1; // 0x74
	char bIgnoreMovementAlongZ : 1; // 0x74
};

struct UNiagaraDataInterfaceArray : UNiagaraDataInterface {
	int32_t MaxElements; // 0x40
};

struct UPortalWarsKillcam : UObject {
	UDemoNetDriver* DemoNetDriver; // 0x28
	APortalWarsPlayerController* OwningPlayerController; // 0x30
};

struct UEnvQueryGenerator : UEnvQueryNode {
	FString OptionName; // 0x30
	UEnvQueryItemType* ItemType; // 0x40
	char bAutoSortTests : 1; // 0x48
};

struct APortalWarsBaseGameState : AGameState {
	TArray<APlayerState*> InactivePlayerArray; // 0x2d8
	int32_t RemainingTime; // 0x300
	int32_t ReplicatedRemainingTime; // 0x304
	FString PlaylistType; // 0x308
	EServerType ServerType; // 0x318
	FGameConfig GameConfig; // 0x320
	int32_t MaxPlayers; // 0x47c
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct ASkeletalMeshActor : AActor {
	char bShouldDoAnimNotifies : 1; // 0x228
	char bWakeOnLevelStart : 1; // 0x228
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x230
	USkeletalMesh* ReplicatedMesh; // 0x238
	UPhysicsAsset* ReplicatedPhysAsset; // 0x240
	UMaterialInterface* ReplicatedMaterial0; // 0x248
	UMaterialInterface* ReplicatedMaterial1; // 0x250
};

struct APortalWarsLobbyGameMode : APortalWarsBaseGameMode {
	TArray<APortalWarsLobbyPlayerStart*> PlayerStarts; // 0x340
	TArray<APortalWarsLineUpCharacter*> LineUpCharacters; // 0x350
	APortalWarsLineUpCharacter* LineUpCharacterClass; // 0x360
	ACameraActor* LobbyCam; // 0x368
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x90
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
	UPawnAction* RecentActionCopy; // 0xa8
};

struct USoundfieldEndpointSubmix : USoundSubmixBase {
	FName SoundfieldEndpointType; // 0x38
	UAudioEndpointSettingsBase* EndpointSettingsClass; // 0x40
	USoundfieldEndpointSettingsBase* EndpointSettings; // 0x48
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x58
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x60
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct UPortalWarsDropsMenuWidget : UPortalWarsMenuWidget {
	UTextBlock* DropsText; // 0x338
	UPortalWarsButtonWidget* OpenButton; // 0x340
	UWidgetSwitcher* ActionSwitcher; // 0x348
};

struct UInputComponent : UActorComponent {
	TArray<FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x120
};

struct UPortalWarsReportPlayerWidget : UPortalWarsMenuWidget {
	UPortalWarsButtonWidget* ReportButton; // 0x338
	UPortalWarsDropdownWidget* ReportCategoryDropdown; // 0x340
	UPortalWarsTextInputWidget* ReportDescription; // 0x348
	UTextBlock* ReportTitleText; // 0x350
	UPortalWarsPlayerEntryWidget* PlayerEntry; // 0x358
};

struct AExplosiveProjectile : AProjectile {
	float ExplosionRadius; // 0x2d8
	float ExplosionInnerRadius; // 0x2dc
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UVirtualTexture2D : UTexture2D {
	FVirtualTextureBuildSettings Settings; // 0x1a0
	bool bContinuousUpdate; // 0x1ac
	bool bSinglePhysicalSpace; // 0x1ad
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct APortalWarsEvolutionGameState : APortalWarsShowdownGameState {
	TArray<char> TeamWeaponIndexes; // 0x838
};

struct UDatasmithDecalComponentTemplate : UDatasmithObjectTemplate {
	int32_t SortOrder; // 0x30
	FVector DecalSize; // 0x34
	UMaterialInterface* Material; // 0x40
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UBlackboardKeyType_Object : UBlackboardKeyType {
	UObject* BaseClass; // 0x30
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UFloatingPawnMovement : UPawnMovementComponent {
	float MaxSpeed; // 0x138
	float Acceleration; // 0x13c
	float Deceleration; // 0x140
	float TurningBoost; // 0x144
	char bPositionCorrected : 1; // 0x148
};

struct UAkXSXInitializationSettings : UObject {
	FAkCommonInitializationSettings CommonSettings; // 0x28
	FAkXSXApuHeapInitializationSettings ApuHeapSettings; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x98
	FAkXSXAdvancedInitializationSettings AdvancedSettings; // 0xc0
};

struct UIntervalGizmo : UInteractiveGizmo {
	UGizmoTransformChangeStateTarget* StateTarget; // 0x38
	UTransformProxy* TransformProxy; // 0x50
	TArray<UPrimitiveComponent*> ActiveComponents; // 0x58
	TArray<UInteractiveGizmo*> ActiveGizmos; // 0x68
	UGizmoComponentAxisSource* AxisYSource; // 0x90
	UGizmoComponentAxisSource* AxisZSource; // 0x98
};

struct UPortalWarsVIPNameIndicatorWidget : UPortalWarsNameIndicatorWidget {
	UWidget* Pointer; // 0x308
	USizeBox* OffscreenSizeBox; // 0x310
};

struct UInteractiveToolPropertySet : UObject {
	UInteractiveToolPropertySet* CachedProperties; // 0x38
	bool bIsPropertySetEnabled; // 0x40
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct APortalWarsPickup : ATeleportableActor {
	float PickupLifetime; // 0x22c
	float InitVelocityMultiplier; // 0x230
	bool validForAI; // 0x234
	bool AllowAutoPickup; // 0x235
	bool AllowManualPickup; // 0x236
	UStaticMeshComponent* PickupMesh; // 0x238
	bool bIsGravityEnabled; // 0x240
	float PickupDistance; // 0x244
	APortalWarsTutorialGoal* Goal; // 0x260
	int32_t HiddenUntilGoal; // 0x268
};

struct UMaterialExpressionOneMinus : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UDistributionFloatParameterBase : UDistributionFloatConstant {
	FName ParameterName; // 0x40
	float MinInput; // 0x48
	float MaxInput; // 0x4c
	float MinOutput; // 0x50
	float MaxOutput; // 0x54
	DistributionParamMode ParamMode; // 0x58
};

struct UNiagaraDataInterfaceAudioSpectrum : UNiagaraDataInterfaceAudioSubmix {
	int32_t Resolution; // 0x40
	float MinimumFrequency; // 0x44
	float MaximumFrequency; // 0x48
	float NoiseFloorDb; // 0x4c
};

struct AEQSTestingPawn : ACharacter {
	UEnvQuery* QueryTemplate; // 0x4c0
	TArray<FEnvNamedValue> QueryParams; // 0x4c8
	TArray<FAIDynamicParam> QueryConfig; // 0x4d8
	float TimeLimitPerStep; // 0x4e8
	int32_t StepToDebugDraw; // 0x4ec
	EEnvQueryHightlightMode HighlightMode; // 0x4f0
	char bDrawLabels : 1; // 0x4f4
	char bDrawFailedItems : 1; // 0x4f4
	char bReRunQueryOnlyOnFinishedMove : 1; // 0x4f4
	char bShouldBeVisibleInGame : 1; // 0x4f4
	char bTickDuringGame : 1; // 0x4f4
	EEnvQueryRunMode QueryingMode; // 0x4f8
	FNavAgentProperties NavAgentProperties; // 0x500
};

struct UFoliageInstancedStaticMeshComponent : UHierarchicalInstancedStaticMeshComponent {
	FMulticastInlineDelegate OnInstanceTakePointDamage; // 0x678
	FMulticastInlineDelegate OnInstanceTakeRadialDamage; // 0x688
	FGuid GenerationGuid; // 0x698
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x220
	float CraneYaw; // 0x224
	float CraneArmLength; // 0x228
	bool bLockMountPitch; // 0x22c
	bool bLockMountYaw; // 0x22d
	USceneComponent* TransformComponent; // 0x230
	USceneComponent* CraneYawControl; // 0x238
	USceneComponent* CranePitchControl; // 0x240
	USceneComponent* CraneCameraMount; // 0x248
};

struct USoundNodeSoundClass : USoundNode {
	USoundClass* SoundClassOverride; // 0x48
};

struct UPortalWarsFlagIndicatorWidget : UPortalWarsIndicatorWidget {
	UWidget* Pointer; // 0x2b8
	UTexture2D* NeutralBackground; // 0x2d0
	UTexture2D* RedBackground; // 0x2d8
	UTexture2D* BlueBackground; // 0x2e0
	UProgressBar* OnScreenProgressBar; // 0x2e8
	UProgressBar* OffScreenProgressBar; // 0x2f0
	float DisplayResetProgress; // 0x2f8
};

struct UNiagaraBaselineController : UObject {
	float TestDuration; // 0x28
	UNiagaraEffectType* EffectType; // 0x30
	ANiagaraPerfBaselineActor* Owner; // 0x38
	TSoftObjectPtr<UNiagaraSystem> System; // 0x40
};

struct UVOIPTalker : UActorComponent {
	FVoiceSettings Settings; // 0xb0
};

struct UARMeshComponent : UARComponent {
	FARMeshUpdatePayload ReplicatedPayload; // 0x280
};

struct UBrushBaseProperties : UInteractiveToolPropertySet {
	float BrushSize; // 0x60
	bool bSpecifyRadius; // 0x64
	float BrushRadius; // 0x68
	float BrushStrength; // 0x6c
	float BrushFalloffAmount; // 0x70
	bool bShowStrength; // 0x74
	bool bShowFalloff; // 0x75
};

struct UPortalWarsTeamSelectWidget : UPortalWarsInputCarouselWidget {
	int32_t Value; // 0x3a0
	FMulticastInlineDelegate OnTeamChangedDelegate; // 0x3a8
};

struct UMaterialExpressionConstant4Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct AHUD : AActor {
	APlayerController* PlayerOwner; // 0x220
	char bLostFocusPaused : 1; // 0x228
	char bShowHUD : 1; // 0x228
	char bShowDebugInfo : 1; // 0x228
	int32_t CurrentTargetIndex; // 0x22c
	char bShowHitBoxDebugInfo : 1; // 0x230
	char bShowOverlays : 1; // 0x230
	char bEnableDebugTextShadow : 1; // 0x230
	TArray<AActor*> PostRenderedActors; // 0x238
	TArray<FName> DebugDisplay; // 0x250
	TArray<FName> ToggledDebugCategories; // 0x260
	UCanvas* Canvas; // 0x270
	UCanvas* DebugCanvas; // 0x278
	TArray<FDebugTextInfo> DebugTextList; // 0x280
	AActor* ShowDebugTargetDesiredClass; // 0x290
	AActor* ShowDebugTargetActor; // 0x298
};

struct UNiagaraPreviewAxis_InterpParamVector2D : UNiagaraPreviewAxis_InterpParamBase {
	FVector2D Min; // 0x38
	FVector2D Max; // 0x40
};

struct ALevelScriptActor : AActor {
	char bInputEnabled : 1; // 0x220
};

struct UDataDrivenConsoleVariableSettings : UDeveloperSettings {
	TArray<FDataDrivenConsoleVariable> CVarsArray; // 0x50
};

struct UProceduralFoliageComponent : UActorComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xb0
	float TileOverlap; // 0xb8
	AVolume* SpawningVolume; // 0xc0
	FGuid ProceduralGuid; // 0xc8
};

struct UParticleModuleLight : UParticleModuleLightBase {
	bool bUseInverseSquaredFalloff; // 0x30
	bool bAffectsTranslucency; // 0x31
	bool bPreviewLightRadius; // 0x32
	float SpawnFraction; // 0x34
	FRawDistributionVector ColorScaleOverLife; // 0x38
	FRawDistributionFloat BrightnessOverLife; // 0x80
	FRawDistributionFloat RadiusScale; // 0xb0
	FRawDistributionFloat LightExponent; // 0xe0
	FLightingChannels LightingChannels; // 0x110
	float VolumetricScatteringIntensity; // 0x114
	bool bHighQualityLights; // 0x118
	bool bShadowCastingLights; // 0x119
};

struct USourceEffectPhaserPreset : USoundEffectSourcePreset {
	FSourceEffectPhaserSettings Settings; // 0xa0
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	UObject* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
	UEdGraphPin_Deprecated* ParentPin; // 0x108
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
};

struct UPortalWarsKilledByBannerWidget : UUserWidget {
	UOverlay* BannerOverlay; // 0x260
	UTextBlock* KilledByText; // 0x268
	UTextBlock* HealthText; // 0x270
	UWidgetAnimation* FadeOutAnimation; // 0x280
};

struct UPortalWarsGamepadBindingCategoryWidget : UUserWidget {
	UTextBlock* CategoryText; // 0x260
};

struct UMicroTransactionBase : UPlatformInterfaceBase {
	TArray<FPurchaseInfo> AvailableProducts; // 0x38
	FString LastError; // 0x48
	FString LastErrorSolution; // 0x58
};

struct UMaterialExpressionPower : UMaterialExpression {
	FExpressionInput Base; // 0x40
	FExpressionInput Exponent; // 0x54
	float ConstExponent; // 0x68
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb0
};

struct UPortalWarsKillFeedEntryWidget : UUserWidget {
	UTextBlock* KillerNameText; // 0x268
	UTextBlock* VictimNameText; // 0x270
	USizeBox* IconSizeBox; // 0x278
	UImage* KillIcon; // 0x280
	UImage* HeadshotIcon; // 0x288
	FLinearColor FriendlyTeamColor; // 0x290
	FLinearColor EnemyTeamColor; // 0x2a0
	FLinearColor OwnColor; // 0x2b0
	FLinearColor DefaultColor; // 0x2c0
	FLinearColor AlphaTeamColor; // 0x2d0
	FLinearColor BravoTeamColor; // 0x2e0
};

struct UPhysicsSettingsCore : UDeveloperSettings {
	float DefaultGravityZ; // 0x38
	float DefaultTerminalVelocity; // 0x3c
	float DefaultFluidFriction; // 0x40
	int32_t SimulateScratchMemorySize; // 0x44
	int32_t RagdollAggregateThreshold; // 0x48
	float TriangleMeshTriangleMinAreaThreshold; // 0x4c
	bool bEnableShapeSharing; // 0x50
	bool bEnablePCM; // 0x51
	bool bEnableStabilization; // 0x52
	bool bWarnMissingLocks; // 0x53
	bool bEnable2DPhysics; // 0x54
	bool bDefaultHasComplexCollision; // 0x55
	float BounceThresholdVelocity; // 0x58
	EFrictionCombineMode FrictionCombineMode; // 0x5c
	EFrictionCombineMode RestitutionCombineMode; // 0x5d
	float MaxAngularVelocity; // 0x60
	float MaxDepenetrationVelocity; // 0x64
	float ContactOffsetMultiplier; // 0x68
	float MinContactOffset; // 0x6c
	float MaxContactOffset; // 0x70
	bool bSimulateSkeletalMeshOnDedicatedServer; // 0x74
	ECollisionTraceFlag DefaultShapeComplexity; // 0x75
	FChaosSolverConfiguration SolverOptions; // 0x78
};

struct ANavModifierVolume : AVolume {
	UNavArea* AreaClass; // 0x260
	bool bMaskFillCollisionUnderneathForNavmesh; // 0x268
};

struct UVariant : UObject {
	TArray<FVariantDependency> Dependencies; // 0x28
	FText DisplayText; // 0x38
	TArray<UVariantObjectBinding*> ObjectBindings; // 0x68
	UTexture2D* Thumbnail; // 0x78
};

struct UViewport : UContentWidget {
	FLinearColor BackgroundColor; // 0x120
};

struct USoundNodeDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct UFontFace : UObject {
	FString SourceFilename; // 0x30
	EFontHinting Hinting; // 0x40
	EFontLoadingPolicy LoadingPolicy; // 0x41
	EFontLayoutMethod LayoutMethod; // 0x42
};

struct UMaterialExpressionSkyAtmosphereAerialPerspective : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
};

struct UAIAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFail; // 0x38
};

struct UPortalWarsMatchCanceledWidget : UUserWidget {
	UTextBlock* CountdownText; // 0x260
};

struct UPortalWarsReticleWidget : UUserWidget {
	float HitMarkerDisplayTime; // 0x268
	AGun* EquippedWeapon; // 0x270
	FReticleData CurrentReticleData; // 0x278
	UCanvasPanel* ReticlePanel; // 0x2f8
	UWidgetSwitcher* ReticleSwitcher; // 0x300
	UBorder* ReticleBorder; // 0x308
	UCanvasPanel* ReticleCanvas; // 0x310
	UImage* OuterCircle; // 0x318
	UImage* InnerCircle; // 0x320
	UImage* dot; // 0x328
	UCanvasPanel* CrosshairWrapper; // 0x330
	UImage* CrosshairRight; // 0x338
	UImage* CrosshairLeft; // 0x340
	UImage* CrosshairTop; // 0x348
	UImage* CrosshairBottom; // 0x350
	UWidgetSwitcher* MarkerSwitcher; // 0x358
	UImage* HitMarker; // 0x360
	UImage* HeadshotMarker; // 0x368
	UImage* KillMarker; // 0x370
	UImage* ZoomImage; // 0x378
	UCanvasPanel* ChargePanel; // 0x380
	UProgressBar* OverheatProgressBar; // 0x388
	UImage* SprintCrosshair; // 0x390
	float ChargeUpdateInterval; // 0x39c
	FLinearColor ReticleBaseColor; // 0x3a0
	FLinearColor ReticleAimColor; // 0x3b0
	float HitSoundDelayTime; // 0x3c0
	UAkAudioEvent* HitEnemyEvent; // 0x3c8
	UAkAudioEvent* HeadshotEnemyEvent; // 0x3d0
	UAkAudioEvent* KillEnemyEvent; // 0x3d8
	UAkAudioEvent* AssistKillEnemyEvent; // 0x3e0
	bool bPreviewOnly; // 0x3e8
};

struct UParticleModuleVectorFieldGlobal : UParticleModuleVectorFieldBase {
	char bOverrideGlobalVectorFieldTightness : 1; // 0x30
	float GlobalVectorFieldScale; // 0x34
	float GlobalVectorFieldTightness; // 0x38
};

struct UMovieSceneFolder : UObject {
	FName FolderName; // 0x28
	TArray<UMovieSceneFolder*> ChildFolders; // 0x30
	TArray<UMovieSceneTrack*> ChildMasterTracks; // 0x40
	TArray<FString> ChildObjectBindingStrings; // 0x50
};

struct ALineTraceGun : AGun {
	FLineTraceGunData LineTraceGunConfig; // 0x698
	AGunImpactEffectManager* ImpactTemplate; // 0x6d8
	AGunImpactEffectManager* ImpactManager; // 0x6e0
	float MaxImpactEffectDistance; // 0x6e8
	float MaxSimulatedImpactEffectDistance; // 0x6ec
	TArray<FLineTraceInfo> BulletNotify; // 0x6f0
	UParticleSystem* TrailFX; // 0x700
	FName TrailTargetParam; // 0x708
	FName ColorParam; // 0x710
	char tracerFrequency; // 0x718
	UAkAudioEvent* BulletWhizEvent; // 0x728
	float MaxBulletWhizDist; // 0x730
	float BulletWhizDelay; // 0x734
	FVector BulletWhizStart; // 0x738
	FVector BulletWhizEnd; // 0x744
	FVector BulletWhizClosestPoint; // 0x750
};

struct UMultiLineEditableTextBox : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FEditableTextBoxStyle WidgetStyle; // 0x168
	FTextBlockStyle TextStyle; // 0x960
	bool bIsReadOnly; // 0xbd0
	bool AllowContextMenu; // 0xbd1
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0xbd2
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xbd3
	USlateWidgetStyleAsset* Style; // 0xbd8
	FSlateFontInfo Font; // 0xbe0
	FLinearColor ForegroundColor; // 0xc38
	FLinearColor BackgroundColor; // 0xc48
	FLinearColor ReadOnlyForegroundColor; // 0xc58
	FMulticastInlineDelegate OnTextChanged; // 0xc68
	FMulticastInlineDelegate OnTextCommitted; // 0xc78
};

struct UBTDecorator_CheckGameplayTagsOnActor : UBTDecorator {
	FBlackboardKeySelector ActorToCheck; // 0x68
	EGameplayContainerMatchType TagsToMatch; // 0x90
	FGameplayTagContainer GameplayTags; // 0x98
	FString CachedDescription; // 0xb8
};

struct UAnimNotifyState_TimedNiagaraEffect : UAnimNotifyState {
	UNiagaraSystem* Template; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct UMaterialExpressionMaterialProxyReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput MaterialProxy; // 0x54
};

struct UParticleModuleLifetime : UParticleModuleLifetimeBase {
	FRawDistributionFloat LifeTime; // 0x30
};

struct APortalWarsRoundHUD : APortalWarsHUD {
	UPortalWarsRoundResultWidget* RoundResultWidget; // 0x400
	UPortalWarsRoundResultWidget* RoundResultWidgetClass; // 0x408
	UPortalWarsRoundIntermissionWidget* RoundIntermissionWidget; // 0x410
	UPortalWarsRoundIntermissionWidget* RoundIntermissionWidgetClass; // 0x418
	UPortalWarsRoundHUDOverlayWidget* RoundHUDOverlayWidget; // 0x420
	UPortalWarsRoundHUDOverlayWidget* RoundHUDOverlayWidgetClass; // 0x428
	UPortalWarsRoundPlayerStatusWidget* PlayerStatusWidgetClass; // 0x430
	bool bMinimalIntermissionScoreboard; // 0x438
};

struct UFoliageType_Actor : UFoliageType {
	AActor* ActorClass; // 0x3b0
	bool bShouldAttachToBaseComponent; // 0x3b8
};

struct UBaseMediaSource : UMediaSource {
	FName PlayerName; // 0x80
};

struct UPortalWarsItemShopPurchasePanel : UPortalWarsUserWidget {
	UTextBlock* TitleText; // 0x2a8
	UTextBlock* ItemTitleText; // 0x2b0
	UTextBlock* ItemSubtitleText; // 0x2b8
	UPortalWarsItemShopEntry* ItemShopEntry; // 0x2c0
	UWidgetSwitcher* OwnedSwitcher; // 0x2c8
	UPortalWarsPurchaseButtonWidget* PurchaseButton; // 0x2e0
	FKey GamepadKey; // 0x2e8
};

struct UPWProjectileMovementComponent : UProjectileMovementComponent {
	TArray<UPrimitiveComponent*> AddlUpdatedComponents; // 0x1d0
};

struct UPortalWarsWaitingAreaHUDWidget : UUserWidget {
	UTextBlock* SessionQueryTitleText; // 0x260
	UWidget* WaitingAreaPanel; // 0x268
	UPortalWarsGameInstance* GameInstanceRef; // 0x270
};

struct APreviewItem : AActor {
	USceneCaptureComponent2D* SceneCaptureComponent; // 0x268
	TMap<ECustomizationType, FTransform> SceneCaptureTransforms; // 0x270
	TMap<ERewardType, FTransform> SceneCaptureRewardTransforms; // 0x2c0
	USceneComponent* SceneRoot; // 0x310
	USceneComponent* CustomizationSceneComponent; // 0x318
	USkeletalMeshComponent* Suit; // 0x320
	USkeletalMeshComponent* JetpackAttached; // 0x328
	TArray<UStaticMeshComponent*> JetpackFlameMeshes; // 0x330
	USkeletalMeshComponent* JetpackAlone; // 0x340
	UStaticMeshComponent* PortalGun; // 0x348
	UStaticMeshComponent* PortalGunStandalone; // 0x350
	UAnimSequence* DefaultAnim; // 0x358
	UStaticMeshComponent* Weapon; // 0x360
	UStaticMeshComponent* Portal; // 0x368
	UStaticMeshComponent* PortalInside; // 0x370
	UStaticMeshComponent* PortalFrameBase; // 0x378
	UStaticMeshComponent* SprayMesh; // 0x380
	UDecalComponent* SprayDecal; // 0x388
	UStaticMeshComponent* XPMesh; // 0x390
	UStaticMeshComponent* CurrencyMesh; // 0x398
	UStaticMeshComponent* DropMesh; // 0x3a0
	UAnimSequence* JetpackOpenAnimation; // 0x3a8
	UAnimSequence* JetpackIdleAnimation; // 0x3b0
};

struct APortalWarsContamination : APortalWarsRoundGameMode {
	TArray<TSoftClassPtr<UObject>> ContaminationDefaultInventoryClasses; // 0x6c0
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x68
};

struct UPortalWarsLobbyWidget : UPortalWarsUserWidget {
	UPortalWarsButtonWidget* PrevGameStatsButton; // 0x2a8
	UPortalWarsPostGameStatsWidget* PostGameStatsWidgetClass; // 0x2b0
	UPortalWarsButtonWidget* EmoteButton; // 0x2b8
	UPortalWarsButtonWidget* SwitchWeaponButton; // 0x2c0
	UPortalWarsChatWidget* LobbyChat; // 0x2c8
	UPanelWidget* PlayersPanel; // 0x2e0
	UPortalWarsLobbyPlayerEntryWidget* LobbyPlayerWidgetClass; // 0x2e8
	UPortalWarsButtonWidget* SaveReplayButton; // 0x2f0
};

struct UPlatformInterfaceBase : UObject {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x230
	char bHasNativizedParent : 1; // 0x234
	char bHasCookedComponentInstancingData : 1; // 0x234
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x238
	TArray<UActorComponent*> ComponentTemplates; // 0x248
	TArray<UTimelineTemplate*> Timelines; // 0x258
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x268
	USimpleConstructionScript* SimpleConstructionScript; // 0x278
	UInheritableComponentHandler* InheritableComponentHandler; // 0x280
	UStructProperty* UberGraphFramePointerProperty; // 0x288
	UFunction* UberGraphFunction; // 0x298
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2a0
};

struct UPortalWarsPurchaseButtonWidget : UPortalWarsEntryWidget {
	bool bGoToStoreIfNotEnough; // 0x420
	UWidgetSwitcher* PurchaseSwitcher; // 0x428
	UTextBlock* CurrencyText; // 0x430
};

struct UBTTask_ChoosePortal : UBTTaskNode {
	float PortalTraceRadius; // 0x70
};

struct UNiagaraPreviewAxis_InterpParamBase : UNiagaraPreviewAxis {
	FName Param; // 0x28
	int32_t Count; // 0x30
};

struct UScaleBox : UContentWidget {
	EStretch Stretch; // 0x120
	EStretchDirection StretchDirection; // 0x121
	float UserSpecifiedScale; // 0x124
	bool IgnoreInheritedScale; // 0x128
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x30
	UBlackboardData* BlackboardAsset; // 0x38
	TArray<UBTDecorator*> RootDecorators; // 0x40
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x50
};

struct UBTService_AssignTarget : UBTService {
	float ShotByEnemyRelevantTime; // 0x70
	float PortalRelevantDistance; // 0x74
	float MinTimeBeforeSwitchingTargets; // 0x78
	float MinThreatDifferenceToSwitch; // 0x7c
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UEdGraph : UObject {
	UEdGraphSchema* Schema; // 0x28
	TArray<UEdGraphNode*> Nodes; // 0x30
	char bEditable : 1; // 0x40
	char bAllowDeletion : 1; // 0x40
	char bAllowRenaming : 1; // 0x40
};

struct UNavMovementComponent : UMovementComponent {
	FNavAgentProperties NavAgentProps; // 0xf0
	float FixedPathBrakingDistance; // 0x120
	char bUpdateNavAgentWithOwnersCollision : 1; // 0x124
	char bUseAccelerationForPaths : 1; // 0x124
	char bUseFixedBrakingDistanceForPaths : 1; // 0x124
	FMovementProperties MovementState; // 0x125
	UObject* PathFollowingComp; // 0x128
};

struct UPawnActionsComponent : UActorComponent {
	APawn* ControlledPawn; // 0xb0
	TArray<FPawnActionStack> ActionStacks; // 0xb8
	TArray<FPawnActionEvent> ActionEvents; // 0xc8
	UPawnAction* CurrentAction; // 0xd8
};

struct UPortalWarsTeamDecimalCarouselWidget : UPortalWarsInputWidget {
	UPortalWarsDecimalCarouselWidget* GlobalCarousel; // 0x368
	UPortalWarsDecimalCarouselWidget* AlphaCarousel; // 0x370
	UPortalWarsDecimalCarouselWidget* BravoCarousel; // 0x378
	UPortalWarsCheckBox* TeamCheckbox; // 0x380
	float Value; // 0x38c
	float MinValue; // 0x390
	float MaxValue; // 0x394
	float StepSize; // 0x398
	FKey GamepadKey; // 0x3a0
	UImage* StandardIcon; // 0x3b8
	UImage* GamepadIcon; // 0x3c0
	UWidgetSwitcher* ConsoleSwitcher; // 0x3c8
	FLinearColor IconDefaultColor; // 0x3d0
	FLinearColor IconHoveredColor; // 0x3e0
};

struct APortalWarsVoteInfo : AInfo {
	FVoteOption VoteOption; // 0x220
	TArray<APortalWarsPlayerState*> Voters; // 0x260
};

struct AARSkyLight : ASkyLight {
	UAREnvironmentCaptureProbe* CaptureProbe; // 0x230
};

struct ALandscapeMeshProxyActor : AActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x220
};

struct ULightmappedSurfaceCollection : UObject {
	UModel* SourceModel; // 0x28
	TArray<int32_t> Surfaces; // 0x30
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int32_t UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UPortalWarsIndicatorWidget : UUserWidget {
	float UpdateInterval; // 0x264
	float EdgePercentage; // 0x2a8
	float OpacityAtCenter; // 0x2ac
	UWidgetSwitcher* IndicatorSwitcher; // 0x2b0
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UHapticFeedbackEffect_SoundWave : UHapticFeedbackEffect_Base {
	USoundWave* SoundWave; // 0x28
};

struct UQuitMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct UEditableTextWidgetStyle : USlateWidgetStyleContainerBase {
	FEditableTextStyle EditableTextStyle; // 0x30
};

struct APortalWarsVIPGameState : APortalWarsGameState {
	TMap<int32_t, APortalWarsPlayerState*> VIPs; // 0x7c8
	TMap<int32_t, APortalWarsPlayerState*> PreviousVIPs; // 0x818
};

struct UNiagaraBaselineController_Basic : UNiagaraBaselineController {
	int32_t NumInstances; // 0x68
	TArray<UNiagaraComponent*> SpawnedComponents; // 0x70
};

struct UWaveOscillatorCameraShakePattern : USimpleCameraShakePattern {
	float LocationAmplitudeMultiplier; // 0x38
	float LocationFrequencyMultiplier; // 0x3c
	FWaveOscillator X; // 0x40
	FWaveOscillator Y; // 0x4c
	FWaveOscillator Z; // 0x58
	float RotationAmplitudeMultiplier; // 0x64
	float RotationFrequencyMultiplier; // 0x68
	FWaveOscillator Pitch; // 0x6c
	FWaveOscillator Yaw; // 0x78
	FWaveOscillator Roll; // 0x84
	FWaveOscillator FOV; // 0x90
};

struct USlateAccessibleWidgetData : UObject {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	FDelegate AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	FDelegate AccessibleSummaryTextDelegate; // 0x70
};

struct APortalWall : AActor {
	UStaticMeshComponent* PortalWallMesh; // 0x220
	bool validForAI; // 0x228
	bool isDoubleSided; // 0x229
	bool shouldDisableForCTF; // 0x22a
	APortalWarsTutorialGoal* Goal; // 0x230
	TArray<AStaticMeshActor*> Blocks; // 0x238
	int32_t HiddenUntilGoal; // 0x248
};

struct USynthComponentMoto : USynthComponent {
	UMotoSynthPreset* MotoSynthPreset; // 0x6c0
	float RPM; // 0x6c8
};

struct USoundWave : USoundBase {
	int32_t CompressionQuality; // 0x170
	int32_t StreamingPriority; // 0x174
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x178
	ESoundGroup SoundGroup; // 0x17a
	char bLooping : 1; // 0x17b
	char bStreaming : 1; // 0x17b
	char bSeekableStreaming : 1; // 0x17b
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x17c
	char bMature : 1; // 0x17d
	char bManualWordWrap : 1; // 0x17d
	char bSingleLine : 1; // 0x17e
	char bIsAmbisonics : 1; // 0x17e
	FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x180
	TArray<float> FrequenciesToAnalyze; // 0x1c8
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x1d8
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x1e8
	int32_t InitialChunkSize; // 0x1f8
	FString SpokenText; // 0x240
	float SubtitlePriority; // 0x250
	float Volume; // 0x254
	float Pitch; // 0x258
	int32_t NumChannels; // 0x25c
	int32_t SampleRate; // 0x260
	TArray<FSubtitleCue> Subtitles; // 0x270
	UCurveTable* Curves; // 0x280
	UCurveTable* InternalCurves; // 0x288
};

struct UPortalWarsVoteEntryWidget : UPortalWarsEntryWidget {
	UTextBlock* MapNameText; // 0x428
	UImage* MapImage; // 0x430
	UTexture2D* DefaultImage; // 0x438
	UTextBlock* ModeNameText; // 0x448
	UTextBlock* NumVotesText; // 0x450
	UTextBlock* VotesText; // 0x458
	UWidget* VotedIndicator; // 0x468
	UWidgetAnimation* VotedAnimation; // 0x470
	FButtonStyle DefaultButtonStyle; // 0x478
	FButtonStyle SelectedButtonStyle; // 0x6f0
	UImage* FadeScrim; // 0x968
	UTexture2D* DefaultFadeScrim; // 0x970
	UTexture2D* SelectedFadeScrim; // 0x978
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct UMaterialExpressionArctangentFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AVolumetricCloud : AInfo {
	UVolumetricCloudComponent* VolumetricCloudComponent; // 0x220
};

struct UPortalWarsStatsOverviewWidget : UPortalWarsMenuWidget {
	UPortalWarsCareerProgressWidget* CareerProgress; // 0x338
	UPortalWarsStatsEntryWidget* TotalStats; // 0x340
	UPortalWarsStatsEntryWidget* SeasonStats; // 0x348
	UTextBlock* SeasonText; // 0x350
	UPortalWarsButtonWidget* ChangeSeasonButton; // 0x358
	UComboBoxString* SeasonComboBox; // 0x360
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UGizmoScaledTransformSource : UGizmoBaseTransformSource {
	TScriptInterface<IGizmoTransformSource> ChildTransformSource; // 0x48
};

struct USoundNodeOscillator : USoundNode {
	char bModulateVolume : 1; // 0x48
	char bModulatePitch : 1; // 0x48
	float AmplitudeMin; // 0x4c
	float AmplitudeMax; // 0x50
	float FrequencyMin; // 0x54
	float FrequencyMax; // 0x58
	float OffsetMin; // 0x5c
	float OffsetMax; // 0x60
	float CenterMin; // 0x64
	float CenterMax; // 0x68
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct ANavSystemConfigOverride : AActor {
	UNavigationSystemConfig* NavigationSystemConfig; // 0x220
	ENavSystemOverridePolicy OverridePolicy; // 0x228
	char bLoadOnClient : 1; // 0x229
};

struct UFieldSystemMetaDataProcessingResolution : UFieldSystemMetaData {
	EFieldResolutionType ResolutionType; // 0xb0
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x220
};

struct UPortalWarsRoundPlayerStatusWidget : UUserWidget {
	bool bShowRespawnTimer; // 0x260
	UTextBlock* RespawnTimeText; // 0x268
	UImage* BackgroundImage; // 0x270
	UTexture2D* RedPlayerImage; // 0x288
	UTexture2D* BluePlayerImage; // 0x290
	UTexture2D* DeadPlayerImage; // 0x298
	float PaddingBetweenEntries; // 0x2a0
};

struct APlasmaRifle : AProjectileGun {
	float currentHeatLevel; // 0x6e0
	float heatIncreasePerShot; // 0x6e4
	float coolDownRate; // 0x6e8
	float totalHeatCapacity; // 0x6ec
	UAkAudioEvent* OverHeatChargeEvent; // 0x6f0
	UAkAudioEvent* OverHeatChargeStopEvent; // 0x6f8
};

struct UPortalWarsCrosshairSelectWidget : UPortalWarsInputWidget {
	UPortalWarsReticleWidget* ReticleWidget; // 0x368
	UPortalWarsComboBoxString* CrosshairComboBox; // 0x370
	int32_t WeaponID; // 0x378
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x450
	UNavAreaBase* AreaClass; // 0x458
	FColor ShapeColor; // 0x460
	char bDrawOnlyIfSelected : 1; // 0x464
	char bShouldCollideWhenPlacing : 1; // 0x464
	char bDynamicObstacle : 1; // 0x464
};

struct UImage : UWidget {
	FSlateBrush Brush; // 0x108
	FDelegate BrushDelegate; // 0x190
	FLinearColor ColorAndOpacity; // 0x1a0
	FDelegate ColorAndOpacityDelegate; // 0x1b0
	bool bFlipForRightToLeftFlowDirection; // 0x1c0
	FDelegate OnMouseButtonDownEvent; // 0x1c4
};

struct UInterpTrackFloatProp : UInterpTrackFloatBase {
	FName PropertyName; // 0x90
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x88
	char bNRScaleEmitterTime : 1; // 0xb8
	FRawDistributionVector NoiseSpeed; // 0xc0
	char bSmooth : 1; // 0x108
	float NoiseLockRadius; // 0x10c
	char bNoiseLock : 1; // 0x110
	char bOscillate : 1; // 0x110
	float NoiseLockTime; // 0x114
	float NoiseTension; // 0x118
	char bUseNoiseTangents : 1; // 0x11c
	FRawDistributionFloat NoiseTangentStrength; // 0x120
	int32_t NoiseTessellation; // 0x150
	char bTargetNoise : 1; // 0x154
	float FrequencyDistance; // 0x158
	char bApplyNoiseScale : 1; // 0x15c
	FRawDistributionFloat NoiseScale; // 0x160
};

struct UNiagaraDataInterfaceVectorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve XCurve; // 0x70
	FRichCurve YCurve; // 0xf0
	FRichCurve ZCurve; // 0x170
};

struct UAkSettingsPerUser : UObject {
	FDirectoryPath WwiseWindowsInstallationPath; // 0x28
	FFilePath WwiseMacInstallationPath; // 0x38
	FString WaapiIPAddress; // 0x48
	uint32_t WaapiPort; // 0x58
	bool SuppressWwiseProjectPathWarnings; // 0x5c
};

struct UInterpTrackFloatAnimBPParam : UInterpTrackFloatBase {
	UObject* AnimBlueprintClass; // 0x90
	UAnimInstance* AnimClass; // 0x98
	FName ParamName; // 0xa0
};

struct ULODSyncComponent : UActorComponent {
	int32_t NumLODs; // 0xb0
	int32_t ForcedLOD; // 0xb4
	TArray<FComponentSync> ComponentsToSync; // 0xb8
	TMap<FName, FLODMappingData> CustomLODMapping; // 0xc8
	int32_t CurrentLOD; // 0x118
	int32_t CurrentNumLODs; // 0x11c
	TArray<UPrimitiveComponent*> DriveComponents; // 0x120
	TArray<UPrimitiveComponent*> SubComponents; // 0x130
};

struct UAkSurfaceReflectorSetComponent : USceneComponent {
	char bEnableSurfaceReflectors : 1; // 0x1f8
	TArray<FAkPoly> AcousticPolys; // 0x200
	char bEnableDiffraction : 1; // 0x210
	char bEnableDiffractionOnBoundaryEdges : 1; // 0x210
	AActor* AssociatedRoom; // 0x218
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xf0
};

struct UMaterialExpressionStaticBool : UMaterialExpression {
	char Value : 1; // 0x40
};

struct UVolumetricCloudComponent : USceneComponent {
	float LayerBottomAltitude; // 0x1f8
	float LayerHeight; // 0x1fc
	float TracingStartMaxDistance; // 0x200
	float TracingMaxDistance; // 0x204
	float PlanetRadius; // 0x208
	FColor GroundAlbedo; // 0x20c
	UMaterialInterface* Material; // 0x210
	char bUsePerSampleAtmosphericLightTransmittance : 1; // 0x218
	float SkyLightCloudBottomOcclusion; // 0x21c
	float ViewSampleCountScale; // 0x220
	float ReflectionSampleCountScale; // 0x224
	float ShadowViewSampleCountScale; // 0x228
	float ShadowReflectionSampleCountScale; // 0x22c
	float ShadowTracingDistance; // 0x230
	float StopTracingTransmittanceThreshold; // 0x234
};

struct UMediaTimeStampInfo : UObject {
	FTimespan Time; // 0x28
	int64_t SequenceIndex; // 0x30
};

struct UMovieSceneColorTrack : UMovieScenePropertyTrack {
	bool bIsSlateColor; // 0xa8
};

struct UDatasmithAreaLightActorTemplate : UDatasmithObjectTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct UMatineeCameraShake : UCameraShakeBase {
	float OscillationDuration; // 0xa8
	float OscillationBlendInTime; // 0xac
	float OscillationBlendOutTime; // 0xb0
	FROscillator RotOscillation; // 0xb4
	FVOscillator LocOscillation; // 0xd8
	FFOscillator FOVOscillation; // 0xfc
	float AnimPlayRate; // 0x108
	float AnimScale; // 0x10c
	float AnimBlendInTime; // 0x110
	float AnimBlendOutTime; // 0x114
	float RandomAnimSegmentDuration; // 0x118
	UCameraAnim* Anim; // 0x120
	UCameraAnimationSequence* AnimSequence; // 0x128
	char bRandomAnimSegment : 1; // 0x130
	float OscillatorTimeRemaining; // 0x134
	UCameraAnimInst* AnimInst; // 0x138
	USequenceCameraShakePattern* SequenceShakePattern; // 0x180
};

struct USoundNodeQualityLevel : USoundNode {
	int32_t CookedQualityLevelIndex; // 0x48
};

struct UAsyncTaskDownloadImage : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFail; // 0x40
};

struct UMaterialExpressionSphericalParticleOpacity : UMaterialExpression {
	FExpressionInput Density; // 0x40
	float ConstantDensity; // 0x54
};

struct UCableComponent : UMeshComponent {
	bool bAttachStart; // 0x478
	bool bAttachEnd; // 0x479
	FComponentReference AttachEndTo; // 0x480
	FName AttachEndToSocketName; // 0x4a8
	FVector EndLocation; // 0x4b0
	float CableLength; // 0x4bc
	int32_t NumSegments; // 0x4c0
	float SubstepTime; // 0x4c4
	int32_t SolverIterations; // 0x4c8
	bool bEnableStiffness; // 0x4cc
	bool bUseSubstepping; // 0x4cd
	bool bSkipCableUpdateWhenNotVisible; // 0x4ce
	bool bSkipCableUpdateWhenNotOwnerRecentlyRendered; // 0x4cf
	bool bEnableCollision; // 0x4d0
	float CollisionFriction; // 0x4d4
	FVector CableForce; // 0x4d8
	float CableGravityScale; // 0x4e4
	float CableWidth; // 0x4e8
	int32_t NumSides; // 0x4ec
	float TileMaterial; // 0x4f0
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UGeometryCollectionDebugDrawComponent : UActorComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct AOddballSpawnPoint : AActor {
	UStaticMeshComponent* Mesh; // 0x220
	USceneComponent* BallSpawnPoint; // 0x228
	AOddballItemPickup* OddballPickupClass; // 0x230
	APortalWarsOddballGameState* OddballGameState; // 0x238
};

struct UDestroySessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UBTTask_Crouch : UBTTaskNode {
	bool shouldCrouch; // 0x70
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct APortalWarsCharacter : ACharacter {
	APortalWarsGameState* GameStateRef; // 0x4d8
	float Health; // 0x4ec
	float MaxHealth; // 0x4f0
	float healthRechargeDelay; // 0x4fc
	UAkAudioEvent* HealthRechargeStartEvent; // 0x500
	UAkAudioEvent* HealthRechargeStopEvent; // 0x508
	UAkAudioEvent* LowHealthStartEvent; // 0x510
	UAkAudioEvent* LowHealthStopEvent; // 0x518
	UAkAudioEvent* KillHealthLoopEvents; // 0x520
	FHitInfo LastCausedHitInfo; // 0x620
	UAnimMontage* upperBodyFlinchMontage; // 0x720
	UAnimMontage* lowerBodyFlinchMontage; // 0x728
	UAnimMontage* headFlinchMontage; // 0x730
	UDamageType* SuicideDamageType; // 0x740
	UDamageType* portalDamageType; // 0x748
	UAkAudioEvent* PlayerTakeDamageEvent; // 0x750
	UAkAudioEvent* RagdollCollisionEvent; // 0x758
	float RagdollImpactSFXThreshold; // 0x760
	float PostDeathPortalLifetime; // 0x764
	float RagdollLifetime; // 0x768
	TArray<APortalWarsAIController*> TargetingBots; // 0x770
	UCameraComponent* ThirdPersonCamera; // 0x780
	USpringArmComponent* ThirdPersonCameraArm; // 0x788
	UCameraComponent* SpectatorFirstPersonCamera; // 0x798
	USpringArmComponent* SpectatorFirstPersonCameraArm; // 0x7a0
	TArray<TSoftClassPtr<UObject>> DefaultInventoryClasses; // 0x7d0
	TArray<AGun*> Inventory; // 0x7e0
	AGun* CurrentWeapon; // 0x7f0
	AGun* Fists; // 0x800
	AGun* FistsClass; // 0x808
	AGun* CurrentWeaponClass; // 0x810
	FName WeaponAttachPoint; // 0x850
	FName GrendadeAttachPoint; // 0x858
	APortalLauncher* portalLauncherClass; // 0x860
	APortalLauncher* PortalLauncher; // 0x868
	FName PortalLauncherAttachPoint; // 0x870
	USceneComponent* FirstPersonArmsRoot; // 0x880
	USkeletalMeshComponent* Mesh1P; // 0x898
	USkeletalMeshComponent* Jetpack; // 0x8a0
	TMap<FName, UStaticMeshComponent*> JetpackFlameMeshes; // 0x8a8
	int32_t FriendlyStencilValue; // 0x910
	int32_t EnemyStencilValue; // 0x914
	int32_t AlphaTeamStencilValue; // 0x918
	int32_t BravoTeamStencilValue; // 0x91c
	FLinearColor BlueOutlineColor; // 0x920
	FLinearColor RedOutlineColor; // 0x930
	float ColorIntensity3P; // 0x940
	float ColorIntensity1P; // 0x944
	UMaterialInstance* EnemyCharacterMaterialOverride; // 0x948
	FCustomizationId EnemyCharacterCustomizationOverride; // 0x950
	UAnimSequence* EmoteSequenceCurrentlyPlayingInMenu; // 0x9d8
	float SprayRange; // 0x9e0
	float SprayLifetime; // 0x9e4
	float TimeBetweenSprays; // 0x9e8
	TArray<FSavedPosition> SavedPositions; // 0x9f0
	char bIsSprinting : 1; // 0xa08
	UMatineeCameraShake* SprintCamShake; // 0xa10
	float SprintingSpeedModifier; // 0xa1c
	APortalWarsTeabagZone* TeabagZone; // 0xa30
	float CrouchCameraSpeed; // 0xa40
	UAkAudioEvent* CrouchEvent; // 0xa48
	UAkAudioEvent* UncrouchEvent; // 0xa50
	float BaseTurnRate; // 0xa58
	float BaseLookUpRate; // 0xa5c
	float ControllerMaxAccelMultiplier; // 0xaf8
	AController* OwnerOfLastPortalUsed; // 0xb60
	float rotateToUprightSpeed; // 0xb6c
	char DoRep_collisionProfile; // 0xb70
	UAkAudioEvent* TeleportEvent; // 0xb88
	UAkAudioEvent* LocalPlayerTeleportEvent; // 0xb90
	AGrenadeLauncher* GrenadeLauncher; // 0xba8
	AGrenadeLauncher* GrenadeLauncherClass; // 0xbb0
	UAkAudioEvent* ThrowGrenadeEvent; // 0xbb8
	FIgnoreMovementCorrections IgnoreServerCorrections; // 0xbc0
	float MeleeApplyDmgRange; // 0xbc8
	float MeleeApplyDmgRangeXY; // 0xbcc
	float MeleeApplyDmgAngle; // 0xbd0
	float MeleeRange; // 0xbd4
	float TimeBetweenMelee; // 0xbd8
	float MeleeConeHalfAngle; // 0xbdc
	float MeleeMaxRotationAngle; // 0xc14
	UDamageType* MeleeDamageType; // 0xc28
	char bIsThrusting : 1; // 0xc39
	float thrustAmountPerTick; // 0xc3c
	float thrusterVelocityThreshhold; // 0xc40
	float thrusterRechargeDelay; // 0xc44
	float thrusterTotalTime; // 0xc48
	float thrusterCurrentTime; // 0xc4c
	UAkAudioEvent* JetPackStartEvent; // 0xc58
	UAkAudioEvent* JetPackEndEvent; // 0xc60
	UAnimSequence* JetpackOpenAnimation; // 0xc70
	UAnimSequence* JetpackIdleAnimation; // 0xc78
	char bIsClambering : 1; // 0xc80
	float ClamberCameraShakeDelay; // 0xc84
	UCameraShakeBase* ClamberCameraShake; // 0xc88
	char bIsZooming : 1; // 0xc90
	float maxTimeOutOfBounds; // 0xc94
	float curTimeOutOfBounds; // 0xc98
	UAkAudioEvent* OutOfBoundsStartEvent; // 0xca0
	UAkAudioEvent* OutofBoundsEndEvent; // 0xca8
	UPortalWarsAnimInstanceV2* Animation; // 0xcb8
	UAkAudioEvent* DeathEvent; // 0xce0
	UAkAudioEvent* RespawnEvent; // 0xce8
	UAkAudioEvent* SprayEvent; // 0xcf0
	UAkAudioEvent* Footstep3pEvent; // 0xcf8
	UAkAudioEvent* Footstep1pEvent; // 0xd00
	UAkAudioEvent* Land3pEvent; // 0xd08
	UAkAudioEvent* Land1pEvent; // 0xd10
	UAkAudioEvent* Jump3pEvent; // 0xd18
	UAkAudioEvent* Jump1pEvent; // 0xd20
	UPortalWarsAkComponent* AkFirstPerson; // 0xd28
	UPortalWarsAkComponent* AkThirdPerson; // 0xd30
	UPortalWarsAkComponent* AkFoot; // 0xd38
	UPortalWarsAkComponent* AkJetPack; // 0xd40
	UPortalWarsAkComponent* AkGunLocation; // 0xd48
	UPortalWarsAkComponent* AkMoveable; // 0xd50
	UAkAudioEvent* RespawnCountdownEvent; // 0xd58
	UAkAudioEvent* RespawnCountdownStopEvent; // 0xd60
	float FootstepLoudnessForBots; // 0xd68
	float ThrusterLoudnessForBots; // 0xd6c
	UPortalWarsIndicatorWidget* NameIndicatorWidget; // 0xd78
	UPortalWarsRadarMarkerWidget* RadarMarkerWidget; // 0xd80
	APortalWarsPlayerState* LastPlayerState; // 0xd88
	uint16_t RemotePitch; // 0xd94
	uint16_t RemoteYaw; // 0xd96
	uint16_t RemoteRoll; // 0xd98
};

struct UPortalWarsRadarMarkerWidget : UPortalWarsIndicatorWidget {
	UWidgetSwitcher* MarkerSwitcher; // 0x2d8
	float ZOffsetTrigger; // 0x2e0
	UImage* AboveImage; // 0x2e8
	UImage* BelowImage; // 0x2f0
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct UWidgetNavigation : UObject {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x4c
	FWidgetNavigationData Left; // 0x70
	FWidgetNavigationData Right; // 0x94
	FWidgetNavigationData Next; // 0xb8
	FWidgetNavigationData Previous; // 0xdc
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xf0
};

struct AMagicLeapSharedWorldGameState : AGameState {
	FMagicLeapSharedWorldSharedData SharedWorldData; // 0x290
	FMagicLeapSharedWorldAlignmentTransforms AlignmentTransforms; // 0x2a0
	FMulticastInlineDelegate OnSharedWorldDataUpdated; // 0x2b0
	FMulticastInlineDelegate OnAlignmentTransformsUpdated; // 0x2c0
};

struct UHighlightsSetVideoAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct USourceEffectFilterPreset : USoundEffectSourcePreset {
	FSourceEffectFilterSettings Settings; // 0xb0
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UPortalWarsMenuSelectWidget : UPortalWarsDialogWidget {
	UTextBlock* HoveredEntryText; // 0x390
	UWidget* HoveredEntryRoot; // 0x398
	UPanelWidget* NavPanel; // 0x3a8
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x48
	FSoundAttenuationSettings AttenuationOverrides; // 0x50
	char bOverrideAttenuation : 1; // 0x3f0
};

struct UNiagaraDataInterfaceRWBase : UNiagaraDataInterface {
	TSet<int32_t> OutputShaderStages; // 0x38
	TSet<int32_t> IterationShaderStages; // 0x88
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct USkeletalMeshSimulationComponent : UActorComponent {
	UChaosPhysicalMaterial* PhysicalMaterial; // 0xb8
	AChaosSolverActor* ChaosSolverActor; // 0xc0
	UPhysicsAsset* OverridePhysicsAsset; // 0xc8
	bool bSimulating; // 0xd0
	bool bNotifyCollisions; // 0xd1
	EObjectStateTypeEnum ObjectType; // 0xd2
	float Density; // 0xd4
	float MinMass; // 0xd8
	float MaxMass; // 0xdc
	ECollisionTypeEnum CollisionType; // 0xe0
	float ImplicitShapeParticlesPerUnitArea; // 0xe4
	int32_t ImplicitShapeMinNumParticles; // 0xe8
	int32_t ImplicitShapeMaxNumParticles; // 0xec
	int32_t MinLevelSetResolution; // 0xf0
	int32_t MaxLevelSetResolution; // 0xf4
	int32_t CollisionGroup; // 0xf8
	EInitialVelocityTypeEnum InitialVelocityType; // 0xfc
	FVector InitialLinearVelocity; // 0x100
	FVector InitialAngularVelocity; // 0x10c
	FMulticastInlineDelegate OnChaosPhysicsCollision; // 0x118
};

struct UAkAudioBank : UObject {
	bool AutoLoad; // 0x28
};

struct UBTDecorator_Blackboard : UBTDecorator_BlackboardBase {
	int32_t IntValue; // 0x90
	float FloatValue; // 0x94
	FString StringValue; // 0x98
	FString CachedDescription; // 0xa8
	char OperationType; // 0xb8
	EBTBlackboardRestart NotifyObserver; // 0xb9
};

struct UPortalWarsEvolutionHUDOverlayWidget : UPortalWarsTakedownHUDOverlayWidget {
	UPortalWarsEvolutionGunStatusWidget* EnemyGunStatus; // 0x280
};

struct UAchievementWriteCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UPortalWarsDropdownWidget : UPortalWarsInputWidget {
	TArray<FText> DefaultOptions; // 0x368
	int32_t DefaultIndex; // 0x378
	UComboBoxString* ComboBox; // 0x380
};

struct UNiagaraDataInterfaceIntRenderTarget2D : UNiagaraDataInterfaceRWBase {
	FIntPoint Size; // 0xd8
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe0
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x100
};

struct UVehicleAnimInstance : UAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0xa50
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	EFireEventsAtPosition EventPosition; // 0x84
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UGizmoAxisScaleParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	float Parameter; // 0x6c
	FGizmoFloatParameterChange LastChange; // 0x70
	FVector CurScaleAxis; // 0x78
	FVector CurScaleOrigin; // 0x84
	FTransform InitialTransform; // 0x90
};

struct UParticleModuleMeshRotation : UParticleModuleRotationBase {
	FRawDistributionVector StartRotation; // 0x30
	char bInheritParent : 1; // 0x78
};

struct UMaterialExpressionDistanceFieldsRenderingSwitch : UMaterialExpression {
	FExpressionInput No; // 0x40
	FExpressionInput Yes; // 0x54
};

struct UPortalWarsDOMHillStatusWidget : UUserWidget {
	UProgressBar* HillProgressBar; // 0x260
	UImage* OutlineImage; // 0x268
	UTextBlock* HillLetterText; // 0x270
	UTextBlock* HillStatusText; // 0x278
	UHorizontalBox* RootHorizontalBox; // 0x280
	UWidgetAnimation* RotateAnimation; // 0x288
	UTexture2D* BlueHillImage; // 0x290
	UTexture2D* WhiteHillImage; // 0x298
	UTexture2D* RedHillImage; // 0x2a0
	UTexture2D* BlueFillImage; // 0x2a8
	UTexture2D* RedFillImage; // 0x2b0
};

struct UHighlightsGetNumberAsync : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UGameplayTask_TimeLimitedExecution : UGameplayTask {
	FMulticastInlineDelegate OnFinished; // 0x68
	FMulticastInlineDelegate OnTimeExpired; // 0x78
};

struct AMagicLeapARPinInfoActorBase : AActor {
	FGuid PinId; // 0x220
	bool bVisibilityOverride; // 0x230
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x2e0
	FPartyReservation PendingReservation; // 0x2f0
	EClientRequestType RequestType; // 0x340
	bool bPendingReservationSent; // 0x341
	bool bCancelReservation; // 0x342
};

struct UMaterialExpressionReroute : UMaterialExpressionRerouteBase {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleColor_Seeded : UParticleModuleColor {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UAkMarkerCallbackInfo : UAkEventCallbackInfo {
	int32_t Identifier; // 0x38
	int32_t Position; // 0x3c
	FString Label; // 0x40
};

struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	TArray<FNiagaraMeshRendererMeshProperties> Meshes; // 0x88
	ENiagaraRendererSourceDataMode SourceMode; // 0x98
	ENiagaraSortMode SortMode; // 0x99
	char bOverrideMaterials : 1; // 0x9c
	char bSortOnlyWhenTranslucent : 1; // 0x9c
	char bSubImageBlend : 1; // 0x9c
	char bEnableFrustumCulling : 1; // 0x9c
	char bEnableCameraDistanceCulling : 1; // 0x9c
	char bEnableMeshFlipbook : 1; // 0x9c
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0xa0
	FVector2D SubImageSize; // 0xb0
	ENiagaraMeshFacingMode FacingMode; // 0xb8
	char bLockedAxisEnable : 1; // 0xbc
	FVector LockedAxis; // 0xc0
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0xcc
	float MinCameraDistance; // 0xd0
	float MaxCameraDistance; // 0xd4
	uint32_t RendererVisibility; // 0xd8
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe0
	FNiagaraVariableAttributeBinding ColorBinding; // 0x138
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x190
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x1e8
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x240
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x298
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x2f0
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x348
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x3a0
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x3f8
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x450
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x4a8
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x500
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x558
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x5b0
	FNiagaraVariableAttributeBinding MeshIndexBinding; // 0x608
	TArray<FNiagaraMaterialAttributeBinding> MaterialParameterBindings; // 0x660
	FNiagaraVariableAttributeBinding PrevPositionBinding; // 0x670
	FNiagaraVariableAttributeBinding PrevScaleBinding; // 0x6c8
	FNiagaraVariableAttributeBinding PrevMeshOrientationBinding; // 0x720
	FNiagaraVariableAttributeBinding PrevCameraOffsetBinding; // 0x778
	FNiagaraVariableAttributeBinding PrevVelocityBinding; // 0x7d0
	UStaticMesh* ParticleMesh; // 0x890
	FVector PivotOffset; // 0x898
	ENiagaraMeshPivotOffsetSpace PivotOffsetSpace; // 0x8a4
};

struct UPortalWarsKillcamWidget : UUserWidget {
	UPortalWarsKillcamKilledByWidget* KilledBy; // 0x260
	UPortalWarsKillPlayerEntryWidget* KillerPlayerEntry; // 0x268
	UUserWidget* KillcamSkip; // 0x270
};

struct UPortalWarsSaveGame : USaveGame {
	float FOV; // 0x34
	int32_t ColorblindMode; // 0x38
	float ColorblindModeIntensity; // 0x3c
	float MasterVolume; // 0x40
	float MusicVolume; // 0x44
	float GameplayVolume; // 0x48
	float AnnouncerVolume; // 0x4c
	float AmbientVolume; // 0x50
	float VOIPVolume; // 0x54
	bool bOpenMic; // 0x58
	bool bProximityEnabled; // 0x59
	FString VoiceChatInputDevice; // 0x60
	FString VoiceChatOutputDevice; // 0x70
	bool bMuteWhileMinimized; // 0x80
	bool ToggleCrouch; // 0x81
	bool ToggleZoom; // 0x82
	bool ToggleSprint; // 0x83
	float HorizontalMouseSensitivity; // 0x84
	float VerticalMouseSensitivity; // 0x88
	float MouseZoomSensitivityMultiplier; // 0x8c
	bool MouseInverted; // 0x90
	bool MouseAutosprint; // 0x91
	bool EnableMouseSmoothing; // 0x92
	TArray<FKeyConfigurationInfo> KeyBindings; // 0x98
	float HorizontalControllerSensitivity; // 0xa8
	float VerticalControllerSensitivity; // 0xac
	float ControllerAccelerationSensitivity; // 0xb0
	float ControllerZoomSensitivityMultiplier; // 0xb4
	float ControllerInnerDeadzone; // 0xb8
	float ControllerOuterDeadzone; // 0xbc
	float ControllerAimAssistStrength; // 0xc0
	bool ControllerInverted; // 0xc4
	bool ControllerAutosprint; // 0xc5
	bool ControllerVibrationEnabled; // 0xc6
	int32_t ControllerGameplayPreset; // 0xc8
	FControllerKeybindPreset CustomControllerBindings; // 0xd0
	bool ShouldShowBlood; // 0x140
	int32_t PlayKillcamMode; // 0x144
	bool ShouldPlayKillcam; // 0x148
	bool ShouldRecordReplay; // 0x149
	int32_t ClamberMode; // 0x14c
	int32_t InputDevice; // 0x150
	FLinearColor EnemyColor; // 0x154
	FLinearColor EnemyOutlineColor; // 0x164
	FLinearColor AllyOutlineColor; // 0x174
	FLinearColor AllyColorThroughWalls; // 0x184
	bool ShowFPS; // 0x194
	bool ShowLatency; // 0x195
	bool ShowPing; // 0x196
	bool ShowNetInfo; // 0x197
	bool ShowSubtitles; // 0x198
	bool ShowDamageNumbers; // 0x199
	bool ShowLowAmmo; // 0x19a
	bool ShowSprintCrosshair; // 0x19b
	TMap<int32_t, int32_t> CustomCrosshairs; // 0x1a0
	FLinearColor CustomCrosshairColor; // 0x1f0
	FLinearColor EnemyCustomCrosshairColor; // 0x200
	bool WantsToCrossPlay; // 0x210
	bool bAnonymousMode; // 0x211
	bool bHideNames; // 0x212
	bool bPartyChatOnly; // 0x213
	bool bHasCompletedTutorial; // 0x214
	int32_t TutorialStageID; // 0x218
	bool bHasWatchedIntroVideo; // 0x21c
	bool bHasSeenBattlePassDialog; // 0x21d
	TArray<FCustomizationId> EquippedCustomizations; // 0x220
	TArray<FCustomizationId> ViewedCustomizations; // 0x230
	TSet<FCustomizationCategory> ViewedCustomizationCategories; // 0x240
	bool bHasSeenLocker; // 0x290
	TSet<FCustomizationId> PrevNewCustomizations; // 0x298
	bool bHasSyncedNewCustomizations; // 0x2e8
	TArray<FStoreItemInfo> ViewedStoreItems; // 0x2f0
	TArray<FString> ViewedLimitedTimeOffers; // 0x300
	TArray<FStoreItemInfo> LastViewedStore; // 0x310
	TArray<FChallengeData> ViewedChallenges; // 0x320
	TArray<FString> MuteList; // 0x330
	FDateTime LastLoginTime; // 0x340
	FString LoginAuthToken; // 0x348
	int32_t PreferredMatchmakingRegionID; // 0x358
	int32_t PreferredCustomRegionID; // 0x35c
	TArray<FString> UnselectedPlaylists; // 0x360
	TMap<FString, FPlaylistPreference> PlaylistPreferences; // 0x370
	FCustomGameBrowserFilters CustomGamesFilters; // 0x3c0
	TMap<FString, FGameModeData> CustomGamePresets; // 0x3f0
	FString LastGameVersion; // 0x440
};

struct UInterpTrackMoveAxis : UInterpTrackFloatBase {
	EInterpMoveAxis MoveAxis; // 0x90
	FInterpLookupTrack LookupTrack; // 0x98
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x450
	FInterpCurveVector SplineInfo; // 0x4c0
	FInterpCurveQuat SplineRotInfo; // 0x4d8
	FInterpCurveVector SplineScaleInfo; // 0x4f0
	FInterpCurveFloat SplineReparamTable; // 0x508
	bool bAllowSplineEditingPerInstance; // 0x520
	int32_t ReparamStepsPerSegment; // 0x524
	float Duration; // 0x528
	bool bStationaryEndpoints; // 0x52c
	bool bSplineHasBeenEdited; // 0x52d
	bool bModifiedByConstructionScript; // 0x52e
	bool bInputSplinePointsToConstructionScript; // 0x52f
	bool bDrawDebug; // 0x530
	bool bClosedLoop; // 0x531
	bool bLoopPositionOverride; // 0x532
	float LoopPosition; // 0x534
	FVector DefaultUpVector; // 0x538
};

struct UInterpTrackInstAkAudioRTPC : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UProgressBar : UWidget {
	FProgressBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x2a8
	USlateBrushAsset* BackgroundImage; // 0x2b0
	USlateBrushAsset* FillImage; // 0x2b8
	USlateBrushAsset* MarqueeImage; // 0x2c0
	float Percent; // 0x2c8
	EProgressBarFillType BarFillType; // 0x2cc
	bool bIsMarquee; // 0x2cd
	FVector2D BorderPadding; // 0x2d0
	FDelegate PercentDelegate; // 0x2d8
	FLinearColor FillColorAndOpacity; // 0x2e8
	FDelegate FillColorAndOpacityDelegate; // 0x2f8
	FWidgetTransform FillRenderTransform; // 0x308
};

struct UMaterialExpressionConstantBiasScale : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Bias; // 0x54
	float Scale; // 0x58
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UNiagaraDataInterfaceRenderTarget2D : UNiagaraDataInterfaceRWBase {
	FIntPoint Size; // 0xd8
	ENiagaraMipMapGeneration MipMapGeneration; // 0xe0
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe1
	char bInheritUserParameterSettings : 1; // 0xe2
	char bOverrideFormat : 1; // 0xe2
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTarget2D*> ManagedRenderTargets; // 0x158
};

struct UParticleModuleMeshRotation_Seeded : UParticleModuleMeshRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UPortalWarsCheckBox : UCheckBox {
	UAkAudioEvent* CheckedEvent; // 0x770
	UAkAudioEvent* UncheckedEvent; // 0x778
	UAkAudioEvent* HoveredEvent; // 0x780
};

struct UMaterialExpressionLogarithm10 : UMaterialExpression {
	FExpressionInput X; // 0x40
};

struct UParticleModuleSourceMovement : UParticleModuleLocationBase {
	FRawDistributionVector SourceMovementScale; // 0x30
};

struct APortalWarsLobbyPlayerController : APortalWarsPlayerController {
	UPortalWarsLobbyWidget* LobbyMenuWidget; // 0x6c8
	UPortalWarsLobbyWidget* LobbyMenuWidgetClass; // 0x6d0
};

struct UBodySetup : UBodySetupCore {
	FKAggregateGeom AggGeom; // 0x48
	char bAlwaysFullAnimWeight : 1; // 0xa0
	char bConsiderForBounds : 1; // 0xa0
	char bMeshCollideAll : 1; // 0xa0
	char bDoubleSidedGeometry : 1; // 0xa0
	char bGenerateNonMirroredCollision : 1; // 0xa0
	char bSharedCookedData : 1; // 0xa0
	char bGenerateMirroredCollision : 1; // 0xa0
	char bSupportUVsAndFaceRemap : 1; // 0xa0
	UPhysicalMaterial* PhysMaterial; // 0xa8
	FWalkableSlopeOverride WalkableSlopeOverride; // 0xb0
	FBodyInstance DefaultInstance; // 0x128
	FVector BuildScale3D; // 0x288
};

struct UPortalWarsTextInputWidget : UPortalWarsInputWidget {
	UEditableTextBox* TextBox; // 0x368
	UMultiLineEditableTextBox* MultiLineTextBox; // 0x370
	FText HintText; // 0x378
	bool bIsPassword; // 0x390
	int32_t MaxTextLength; // 0x394
};

struct ATemplateSequenceActor : AActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x228
	UTemplateSequencePlayer* SequencePlayer; // 0x240
	FSoftObjectPath TemplateSequence; // 0x248
	FTemplateSequenceBindingOverrideData BindingOverride; // 0x260
};

struct UMovieSceneGeometryCollectionSection : UMovieSceneSection {
	FMovieSceneGeometryCollectionParams Params; // 0xe8
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xb0
	float TileRemovalRadius; // 0xb4
};

struct UTimeSynchronizableMediaSource : UBaseMediaSource {
	bool bUseTimeSynchronization; // 0x88
	int32_t FrameDelay; // 0x8c
	double TimeDelay; // 0x90
};

struct UGameEngine : UEngine {
	float MaxDeltaTime; // 0xde0
	float ServerFlushLogInterval; // 0xde4
	UGameInstance* GameInstance; // 0xde8
};

struct UBTDecorator_PortalIsNearTarget : UBTDecorator_BlackboardBase {
	float XYRange; // 0x90
	float MinZRange; // 0x94
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UDatasmithCineCameraActorTemplate : UDatasmithObjectTemplate {
	FDatasmithCameraLookatTrackingSettingsTemplate LookatTrackingSettings; // 0x30
};

struct UARBasicLightEstimate : UARLightEstimate {
	float AmbientIntensityLumens; // 0x28
	float AmbientColorTemperatureKelvin; // 0x2c
	FLinearColor AmbientColor; // 0x30
};

struct UBrushStampIndicator : UInteractiveGizmo {
	float BrushRadius; // 0x38
	float BrushFalloff; // 0x3c
	FVector BrushPosition; // 0x40
	FVector BrushNormal; // 0x4c
	bool bDrawIndicatorLines; // 0x58
	bool bDrawRadiusCircle; // 0x59
	int32_t SampleStepCount; // 0x5c
	FLinearColor LineColor; // 0x60
	float LineThickness; // 0x70
	bool bDepthTested; // 0x74
	bool bDrawSecondaryLines; // 0x75
	float SecondaryLineThickness; // 0x78
	FLinearColor SecondaryLineColor; // 0x7c
	UPrimitiveComponent* AttachedComponent; // 0x90
};

struct USubmixEffectFilterPreset : USoundEffectSubmixPreset {
	FSubmixEffectFilterSettings Settings; // 0x9c
};

struct URestrictedGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FRestrictedGameplayTagTableRow> RestrictedGameplayTagList; // 0x38
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UChaosPhysicalMaterial : UObject {
	float Friction; // 0x28
	float StaticFriction; // 0x2c
	float Restitution; // 0x30
	float LinearEtherDrag; // 0x34
	float AngularEtherDrag; // 0x38
	float SleepingLinearVelocityThreshold; // 0x3c
	float SleepingAngularVelocityThreshold; // 0x40
};

struct UMaterialExpressionSkyAtmosphereLightDirection : UMaterialExpression {
	int32_t LightIndex; // 0x40
};

struct UPortalWarsStreakIncreaseWidget : UPortalWarsDialogWidget {
	UPortalWarsPlayStreakRewardWidget* RewardEntry; // 0x390
	UWidget* RepairRoot; // 0x398
	UTextBlock* RepairStreakText; // 0x3a0
	UPortalWarsRedeemableButtonWidget* RepairButton; // 0x3a8
	UPortalWarsPlayStreakDialogWidget* PlayStreakDialogWidgetClass; // 0x3b0
	UAkAudioEvent* StreakIncreasedEvent; // 0x3c0
};

struct ULoudnessNRT : UAudioSynesthesiaNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	FSourceEffectWaveShaperSettings Settings; // 0x98
};

struct UAkSwitchInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettings CommunicationSettings; // 0x98
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UMediaSoundComponent : USynthComponent {
	EMediaSoundChannels Channels; // 0x6c0
	bool DynamicRateAdjustment; // 0x6c4
	float RateAdjustmentFactor; // 0x6c8
	FFloatRange RateAdjustmentRange; // 0x6cc
	UMediaPlayer* MediaPlayer; // 0x6e0
};

struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x228
	float MaxDrawDistance; // 0x22c
	float MaxDistanceFadeRange; // 0x230
	char bUseTemperature : 1; // 0x234
	int32_t ShadowMapChannel; // 0x238
	float MinRoughness; // 0x240
	float SpecularScale; // 0x244
	float ShadowResolutionScale; // 0x248
	float ShadowBias; // 0x24c
	float ShadowSlopeBias; // 0x250
	float ShadowSharpen; // 0x254
	float ContactShadowLength; // 0x258
	char ContactShadowLengthInWS : 1; // 0x25c
	char InverseSquaredFalloff : 1; // 0x25c
	char CastTranslucentShadows : 1; // 0x25c
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x25c
	char bAffectDynamicIndirectLighting : 1; // 0x25c
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x25c
	FLightingChannels LightingChannels; // 0x260
	UMaterialInterface* LightFunctionMaterial; // 0x268
	FVector LightFunctionScale; // 0x270
	UTextureLightProfile* IESTexture; // 0x280
	char bUseIESBrightness : 1; // 0x288
	float IESBrightnessScale; // 0x28c
	float LightFunctionFadeDistance; // 0x290
	float DisabledBrightness; // 0x294
	char bEnableLightShaftBloom : 1; // 0x298
	float BloomScale; // 0x29c
	float BloomThreshold; // 0x2a0
	float BloomMaxBrightness; // 0x2a4
	FColor BloomTint; // 0x2a8
	bool bUseRayTracedDistanceFieldShadows; // 0x2ac
	float RayStartOffsetDepthScale; // 0x2b0
};

struct UFoliageType_InstancedStaticMesh : UFoliageType {
	UStaticMesh* Mesh; // 0x3b0
	TArray<UMaterialInterface*> OverrideMaterials; // 0x3b8
	UFoliageInstancedStaticMeshComponent* ComponentClass; // 0x3c8
};

struct UProceduralFoliageSpawner : UObject {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x220
	FGuid LandscapeGuid; // 0x228
	FIntPoint LandscapeSectionOffset; // 0x238
	int32_t MaxLODLevel; // 0x240
	float LODDistanceFactor; // 0x244
	ELandscapeLODFalloff LODFalloff; // 0x248
	float ComponentScreenSizeToUseSubSections; // 0x24c
	float LOD0ScreenSize; // 0x250
	float LOD0DistributionSetting; // 0x254
	float LODDistributionSetting; // 0x258
	float TessellationComponentScreenSize; // 0x25c
	bool UseTessellationComponentScreenSizeFalloff; // 0x260
	float TessellationComponentScreenSizeFalloff; // 0x264
	int32_t OccluderGeometryLOD; // 0x268
	int32_t StaticLightingLOD; // 0x26c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x270
	float StreamingDistanceMultiplier; // 0x278
	UMaterialInterface* LandscapeMaterial; // 0x280
	UMaterialInterface* LandscapeHoleMaterial; // 0x2a8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2b0
	bool bMeshHoles; // 0x2c0
	char MeshHolesMaxLod; // 0x2c1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2c8
	int32_t VirtualTextureNumLods; // 0x2d8
	int32_t VirtualTextureLodBias; // 0x2dc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x2e0
	float NegativeZBoundsExtension; // 0x2e4
	float PositiveZBoundsExtension; // 0x2e8
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x2f0
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x300
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x310
	bool bHasLandscapeGrass; // 0x384
	float StaticLightingResolution; // 0x388
	char CastShadow : 1; // 0x38c
	char bCastDynamicShadow : 1; // 0x38c
	char bCastStaticShadow : 1; // 0x38c
	char bCastFarShadow : 1; // 0x390
	char bCastHiddenShadow : 1; // 0x394
	char bCastShadowAsTwoSided : 1; // 0x398
	char bAffectDistanceFieldLighting : 1; // 0x39c
	FLightingChannels LightingChannels; // 0x39d
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3a0
	char bRenderCustomDepth : 1; // 0x3a0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3a4
	int32_t CustomDepthStencilValue; // 0x3a8
	float LDMaxDrawDistance; // 0x3ac
	FLightmassPrimitiveSettings LightmassSettings; // 0x3b0
	int32_t CollisionMipLevel; // 0x3c8
	int32_t SimpleCollisionMipLevel; // 0x3cc
	float CollisionThickness; // 0x3d0
	FBodyInstance BodyInstance; // 0x3d8
	char bGenerateOverlapEvents : 1; // 0x530
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x530
	int32_t ComponentSizeQuads; // 0x534
	int32_t SubsectionSizeQuads; // 0x538
	int32_t NumSubsections; // 0x53c
	char bUsedForNavigation : 1; // 0x540
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x540
	bool bUseDynamicMaterialInstance; // 0x544
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x545
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x546
	bool bHasLayersContent; // 0x547
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x548
};

struct UPortalWarsKOTHHUDOverlayWidget : UUserWidget {
	UPortalWarsKOTHHillStatusWidget* KOTHHillStatus; // 0x260
};

struct ACameraShakeSourceActor : AActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x220
};

struct UOnlineSessionClient : UOnlineSession {
	bool bIsFromInvite; // 0x1c0
	bool bHandlingDisconnect; // 0x1c1
};

struct UParticleModuleRotation_Seeded : UParticleModuleRotation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x60
};

struct UTouchInterface : UObject {
	TArray<FTouchInputControl> Controls; // 0x28
	float ActiveOpacity; // 0x38
	float InactiveOpacity; // 0x3c
	float TimeUntilDeactive; // 0x40
	float TimeUntilReset; // 0x44
	float ActivationDelay; // 0x48
	bool bPreventRecenter; // 0x4c
	float StartupDelay; // 0x50
};

struct UIpNetDriver : UNetDriver {
	char LogPortUnreach : 1; // 0x758
	char AllowPlayerPortUnreach : 1; // 0x758
	uint32_t MaxPortCountToTry; // 0x75c
	uint32_t ServerDesiredSocketReceiveBufferBytes; // 0x76c
	uint32_t ServerDesiredSocketSendBufferBytes; // 0x770
	uint32_t ClientDesiredSocketReceiveBufferBytes; // 0x774
	uint32_t ClientDesiredSocketSendBufferBytes; // 0x778
	double MaxSecondsInReceive; // 0x780
	int32_t NbPacketsBetweenReceiveTimeTest; // 0x788
	float ResolutionConnectionTimeout; // 0x78c
};

struct UInAppPurchaseCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct ULandscapeSplinesComponent : UPrimitiveComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x450
	TArray<ULandscapeSplineSegment*> Segments; // 0x460
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x470
};

struct UForceFeedbackAttenuation : UObject {
	FForceFeedbackAttenuationSettings Attenuation; // 0x28
};

struct UGranularSynth : USynthComponent {
	USoundWave* GranulatedSoundWave; // 0x6c0
};

struct UPawnAction_Repeat : UPawnAction {
	UPawnAction* ActionToRepeat; // 0x90
	UPawnAction* RecentActionCopy; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa0
};

struct UPortalWarsTutorialBookmarkWidget : UUserWidget {
	UHorizontalBox* MarksHorizontalBox; // 0x260
	UTexture2D* CurrentMarkTexture; // 0x268
	UTexture2D* IncompleteMarkTexture; // 0x270
	UTexture2D* CompleteMarkTexture; // 0x278
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0xe8
	ANavigationData* MyNavData; // 0xf8
};

struct UFXSystemAsset : UObject {
	uint32_t MaxPoolSize; // 0x28
	uint32_t PoolPrimeSize; // 0x2c
};

struct UAnimCurveCompressionSettings : UObject {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct USingleClickInputBehavior : UAnyButtonInputBehavior {
	bool HitTestOnRelease; // 0xc0
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
	TArray<UCheatManagerExtension*> CheatManagerExtensions; // 0x78
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0x88
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xc8
	UEnum* StateEnum; // 0xe8
	AActor* SharingActor; // 0xf0
};

struct UGenlockedFixedRateCustomTimeStep : UGenlockedCustomTimeStep {
	FFrameRate FrameRate; // 0x28
};

struct UBTTask_FindPickup : UBTTaskNode {
	float NearPickupRadius; // 0x70
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USlateBrushAsset : UObject {
	FSlateBrush Brush; // 0x28
};

struct UNiagaraDataInterfaceRenderTargetVolume : UNiagaraDataInterfaceRWBase {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bInheritUserParameterSettings : 1; // 0xe5
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTargetVolume*> ManagedRenderTargets; // 0x108
};

struct UPortalWarsLeaderboardsWidget : UPortalWarsMenuWidget {
	UPortalWarsMenuWidget* RankLeaderboardWidget; // 0x338
};

struct UMovieSceneEventTriggerSection : UMovieSceneEventSectionBase {
	FMovieSceneEventChannel EventChannel; // 0xf0
};

struct AVolumetricLightmapDensityVolume : AVolume {
	FInt32Interval AllowedMipLevelRange; // 0x258
};

struct UListView : UListViewBase {
	EOrientation Orientation; // 0x2d8
	ESelectionMode SelectionMode; // 0x2d9
	EConsumeMouseWheel ConsumeMouseWheel; // 0x2da
	bool bClearSelectionOnClick; // 0x2db
	bool bIsFocusable; // 0x2dc
	float EntrySpacing; // 0x2e0
	bool bReturnFocusToSelection; // 0x2e4
	TArray<UObject*> ListItems; // 0x2e8
	FMulticastInlineDelegate BP_OnEntryInitialized; // 0x308
	FMulticastInlineDelegate BP_OnItemClicked; // 0x318
	FMulticastInlineDelegate BP_OnItemDoubleClicked; // 0x328
	FMulticastInlineDelegate BP_OnItemIsHoveredChanged; // 0x338
	FMulticastInlineDelegate BP_OnItemSelectionChanged; // 0x348
	FMulticastInlineDelegate BP_OnItemScrolledIntoView; // 0x358
};

struct UPortalWarsInspectWidget : UPortalWarsMenuWidget {
	float PreviewDelayTime; // 0x340
	UPortalWarsInspectItemWidget* InspectItemWidgetClass; // 0x350
	UCanvasPanel* InspectPanel; // 0x358
	UTextBlock* DisplayNameText; // 0x360
	UTextBlock* RarityText; // 0x368
	UImage* RarityIcon; // 0x370
	UWidget* ItemInfoRoot; // 0x378
	UPortalWarsButtonWidget* EquipButton; // 0x380
	UWidgetSwitcher* EquipSwitcher; // 0x388
	AMainMenuGameState* GameStateRef; // 0x3b0
};

struct UInputSettings : UObject {
	TArray<FInputAxisConfigEntry> AxisConfig; // 0x28
	char bAltEnterTogglesFullscreen : 1; // 0x38
	char bF11TogglesFullscreen : 1; // 0x38
	char bUseMouseForTouch : 1; // 0x38
	char bEnableMouseSmoothing : 1; // 0x38
	char bEnableFOVScaling : 1; // 0x38
	char bCaptureMouseOnLaunch : 1; // 0x38
	char bDefaultViewportMouseLock : 1; // 0x38
	char bAlwaysShowTouchInterface : 1; // 0x38
	char bShowConsoleOnFourFingerTap : 1; // 0x39
	char bEnableGestureRecognizer : 1; // 0x39
	bool bUseAutocorrect; // 0x3a
	TArray<FString> ExcludedAutocorrectOS; // 0x40
	TArray<FString> ExcludedAutocorrectCultures; // 0x50
	TArray<FString> ExcludedAutocorrectDeviceModels; // 0x60
	EMouseCaptureMode DefaultViewportMouseCaptureMode; // 0x70
	EMouseLockMode DefaultViewportMouseLockMode; // 0x71
	float FOVScale; // 0x74
	float DoubleClickTime; // 0x78
	TArray<FInputActionKeyMapping> ActionMappings; // 0x80
	TArray<FInputAxisKeyMapping> AxisMappings; // 0x90
	TArray<FInputActionSpeechMapping> SpeechMappings; // 0xa0
	TSoftClassPtr<UObject> DefaultPlayerInputClass; // 0xb0
	TSoftClassPtr<UObject> DefaultInputComponentClass; // 0xd8
	FSoftObjectPath DefaultTouchInterface; // 0x100
	FKey ConsoleKey; // 0x118
	TArray<FKey> ConsoleKeys; // 0x130
};

struct UPortalWarsKeybindOverlayWidget : UPortalWarsDialogWidget {
	UTextBlock* TitleText; // 0x3a0
};

struct UParticleModuleMeshRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionVector LifeMultiplier; // 0x30
};

struct UBTTask_Strafe : UBTTaskNode {
	float IdealRange; // 0x70
	float MinStrafeDistance; // 0x74
	float MaxStrafeDistance; // 0x78
	float RandomConeAngle; // 0x7c
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct UMovieSceneMediaTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> MediaSections; // 0x80
};

struct UVRNotificationsComponent : UActorComponent {
	FMulticastInlineDelegate HMDTrackingInitializingAndNeedsHMDToBeTrackedDelegate; // 0xb0
	FMulticastInlineDelegate HMDTrackingInitializedDelegate; // 0xc0
	FMulticastInlineDelegate HMDRecenteredDelegate; // 0xd0
	FMulticastInlineDelegate HMDLostDelegate; // 0xe0
	FMulticastInlineDelegate HMDReconnectedDelegate; // 0xf0
	FMulticastInlineDelegate HMDConnectCanceledDelegate; // 0x100
	FMulticastInlineDelegate HMDPutOnHeadDelegate; // 0x110
	FMulticastInlineDelegate HMDRemovedFromHeadDelegate; // 0x120
	FMulticastInlineDelegate VRControllerRecenteredDelegate; // 0x130
};

struct UAutoDestroySubsystem : UTickableWorldSubsystem {
	TArray<AActor*> ActorsToPoll; // 0x40
};

struct UButtonStyleAsset : UObject {
	FButtonStyle ButtonStyle; // 0x28
};

struct UPortalWarsGGHUDOverlayWidget : UUserWidget {
	UPortalWarsGGGunStatusWidget* GunStatus; // 0x260
	UPortalWarsGGNotificationWidget* GunGameNotification; // 0x268
};

struct UNiagaraDataInterfaceGrid2DCollectionReader : UNiagaraDataInterfaceGrid2D {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x60
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe8
};

struct UMovieSceneSkeletalAnimationTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
	bool bUseLegacySectionIndexBlend; // 0x90
	FMovieSceneSkeletalAnimRootMotionTrackParams RootMotionParams; // 0x98
	bool bBlendFirstChildOfRoot; // 0xc8
};

struct UTimelineTemplate : UObject {
	float TimelineLength; // 0x28
	ETimelineLengthMode LengthMode; // 0x2c
	char bAutoPlay : 1; // 0x2d
	char bLoop : 1; // 0x2d
	char bReplicated : 1; // 0x2d
	char bIgnoreTimeDilation : 1; // 0x2d
	TArray<FTTEventTrack> EventTracks; // 0x30
	TArray<FTTFloatTrack> FloatTracks; // 0x40
	TArray<FTTVectorTrack> VectorTracks; // 0x50
	TArray<FTTLinearColorTrack> LinearColorTracks; // 0x60
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0x70
	FGuid TimelineGuid; // 0x80
	ETickingGroup TimelineTickGroup; // 0x90
	FName VariableName; // 0x94
	FName DirectionPropertyName; // 0x9c
	FName UpdateFunctionName; // 0xa4
	FName FinishedFunctionName; // 0xac
};

struct UPortalWarsPriceWidget : UUserWidget {
	UPanelWidget* PricePanel; // 0x260
	UPortalWarsPriceEntryWidget* PriceEntryWidgetClass; // 0x268
	UWidget* DiscountRoot; // 0x270
	URichTextBlock* DiscountText; // 0x278
	bool bShowDiscounts; // 0x280
};

struct UClothingAssetBase : UObject {
	FString ImportedFilePath; // 0x28
	FGuid AssetGuid; // 0x38
};

struct UReflectionCaptureComponent : USceneComponent {
	UBillboardComponent* CaptureOffsetComponent; // 0x1f8
	EReflectionSourceType ReflectionSourceType; // 0x200
	EMobileReflectionCompression MobileReflectionCompression; // 0x201
	UTextureCube* Cubemap; // 0x208
	float SourceCubemapAngle; // 0x210
	float Brightness; // 0x214
	bool bModifyMaxValueRGBM; // 0x218
	float MaxValueRGBM; // 0x21c
	FVector CaptureOffset; // 0x220
	FGuid MapBuildDataId; // 0x22c
	UTextureCube* CachedEncodedHDRCubemap; // 0x250
};

struct AGameState : AGameStateBase {
	FName MatchState; // 0x270
	FName PreviousMatchState; // 0x278
	int32_t ElapsedTime; // 0x280
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct UPortalWarsQuitMenuWidget : UPortalWarsMenuWidget {
	UPortalWarsButtonWidget* QuitButton; // 0x338
	UWidget* WarningRoot; // 0x340
	UPortalWarsCheckBoxWidget* AcceptWarningCheckBox; // 0x348
	UPortalWarsButtonWidget* AcceptWarningButton; // 0x350
};

struct UVerticalBoxSlot : UPanelSlot {
	FSlateChildSize Size; // 0x38
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UParticleModuleVectorFieldLocal : UParticleModuleVectorFieldBase {
	UVectorField* VectorField; // 0x30
	FVector RelativeTranslation; // 0x38
	FRotator RelativeRotation; // 0x44
	FVector RelativeScale3D; // 0x50
	float Intensity; // 0x5c
	float Tightness; // 0x60
	char bIgnoreComponentTransform : 1; // 0x64
	char bTileX : 1; // 0x64
	char bTileY : 1; // 0x64
	char bTileZ : 1; // 0x64
	char bUseFixDT : 1; // 0x64
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x80
	bool bAdditivePose; // 0x110
	int32_t BasePoseIndex; // 0x114
	FName RetargetSource; // 0x118
	TArray<FTransform> RetargetSourceAssetReferencePose; // 0x120
};

struct UAkItemBoolProperties : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnPropertyDragged; // 0x118
};

struct UBTTask_RunBehaviorDynamic : UBTTaskNode {
	FGameplayTag InjectionTag; // 0x70
	UBehaviorTree* DefaultBehaviorAsset; // 0x78
	UBehaviorTree* BehaviorAsset; // 0x80
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialFunctionInstance : UMaterialFunctionInterface {
	UMaterialFunctionInterface* Parent; // 0x40
	UMaterialFunctionInterface* Base; // 0x48
	TArray<FScalarParameterValue> ScalarParameterValues; // 0x50
	TArray<FVectorParameterValue> VectorParameterValues; // 0x60
	TArray<FTextureParameterValue> TextureParameterValues; // 0x70
	TArray<FFontParameterValue> FontParameterValues; // 0x80
	TArray<FStaticSwitchParameter> StaticSwitchParameterValues; // 0x90
	TArray<FStaticComponentMaskParameter> StaticComponentMaskParameterValues; // 0xa0
	TArray<FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0xb0
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMapClass; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	FUniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray<UChannel*> ChannelsToTick; // 0x1510
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTextureEnableAutoImport : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char bReflectionCaptureCompression : 1; // 0x6c
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6d
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	char bEnableVRS : 1; // 0x88
	char bEnableImageVRS : 1; // 0x88
	EFixedFoveationLevels HMDFixedFoveationLevel; // 0x8c
	ECustomDepthStencil CustomDepthStencil; // 0x8d
	char bCustomDepthTaaJitter : 1; // 0x90
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x94
	char bDefaultFeatureBloom : 1; // 0x98
	char bDefaultFeatureAmbientOcclusion : 1; // 0x98
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x98
	char bDefaultFeatureAutoExposure : 1; // 0x98
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x9c
	float DefaultFeatureAutoExposureBias; // 0xa0
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa4
	char bUsePreExposure : 1; // 0xa4
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa4
	char bDefaultFeatureMotionBlur : 1; // 0xa4
	char bDefaultFeatureLensFlare : 1; // 0xa4
	char bTemporalUpsampling : 1; // 0xa4
	char bSSGI : 1; // 0xa4
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa8
	ELightUnits DefaultLightUnits; // 0xa9
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xaa
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xac
	char bStencilForLODDither : 1; // 0xac
	EEarlyZPass EarlyZPass; // 0xb0
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb4
	char bDBuffer : 1; // 0xb4
	EClearSceneOptions ClearSceneMethod; // 0xb8
	char bBasePassOutputsVelocity : 1; // 0xbc
	char bVertexDeformationOutputsVelocity : 1; // 0xbc
	char bSelectiveBasePassOutputs : 1; // 0xbc
	char bDefaultParticleCutouts : 1; // 0xbc
	int32_t GPUSimulationTextureSizeX; // 0xc0
	int32_t GPUSimulationTextureSizeY; // 0xc4
	char bGlobalClipPlane : 1; // 0xc8
	EGBufferFormat GBufferFormat; // 0xcc
	char bUseGPUMorphTargets : 1; // 0xd0
	char bNvidiaAftermathEnabled : 1; // 0xd0
	char bMultiView : 1; // 0xd0
	char bMobilePostProcessing : 1; // 0xd0
	char bMobileMultiView : 1; // 0xd0
	char bMobileUseHWsRGBEncoding : 1; // 0xd0
	char bRoundRobinOcclusion : 1; // 0xd0
	char bODSCapture : 1; // 0xd0
	char bMeshStreaming : 1; // 0xd1
	float WireframeCullThreshold; // 0xd4
	char bEnableRayTracing : 1; // 0xd8
	char bEnableRayTracingTextureLOD : 1; // 0xd8
	char bSupportStationarySkylight : 1; // 0xd8
	char bSupportLowQualityLightmaps : 1; // 0xd8
	char bSupportPointLightWholeSceneShadows : 1; // 0xd8
	char bSupportAtmosphericFog : 1; // 0xd8
	char bSupportSkyAtmosphere : 1; // 0xd8
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xd8
	char bSupportSkinCacheShaders : 1; // 0xd9
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xdc
	float SkinCacheSceneMemoryLimitInMB; // 0xe0
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe4
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe4
	char bMobileAllowDistanceFieldShadows : 1; // 0xe4
	char bMobileAllowMovableDirectionalLights : 1; // 0xe4
	uint32_t MobileNumDynamicPointLights; // 0xe8
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xec
	char bMobileAllowMovableSpotlights : 1; // 0xec
	char bMobileAllowMovableSpotlightShadows : 1; // 0xec
	char bSupport16BitBoneIndex : 1; // 0xec
	char bGPUSkinLimit2BoneInfluences : 1; // 0xec
	char bSupportDepthOnlyIndexBuffers : 1; // 0xec
	char bSupportReversedIndexBuffers : 1; // 0xec
	char bLPV : 1; // 0xec
	char bMobileAmbientOcclusion : 1; // 0xed
	char bUseUnlimitedBoneInfluences : 1; // 0xed
	int32_t UnlimitedBonInfluencesThreshold; // 0xf0
	FPerPlatformInt MaxSkinBones; // 0xf4
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf8
	char bMobileTemporalAAMethod : 1; // 0xfc
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0x100
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0x101
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0x108
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x120
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x138
};

struct UMaterialExpressionRuntimeVirtualTextureReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput VirtualTextureOutput; // 0x54
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int32_t NumTextureStreamingUnbuiltComponents; // 0xe0
	int32_t NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x258
	TArray<UAssetUserData*> AssetUserData; // 0x268
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x288
};

struct UDatasmithStaticMeshIFCImportData : UDatasmithStaticMeshImportData {
	FString SourceGlobalId; // 0x28
};

struct USourceEffectStereoDelayPreset : USoundEffectSourcePreset {
	FSourceEffectStereoDelaySettings Settings; // 0xb4
};

struct UPortalWarsDamageIndicatorWidget : UUserWidget {
	UImage* HitImage; // 0x260
	UMaterialInterface* ThruPortalMaterial; // 0x268
};

struct UNavigationGraphNodeComponent : USceneComponent {
	FNavGraphNode Node; // 0x1f8
	UNavigationGraphNodeComponent* NextNodeComponent; // 0x210
	UNavigationGraphNodeComponent* PrevNodeComponent; // 0x218
};

struct UAnimSharingAdditiveInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> BaseComponent; // 0x2b8
	TWeakObjectPtr<UAnimSequence> AdditiveAnimation; // 0x2c0
	float Alpha; // 0x2c8
	bool bStateBool; // 0x2cc
};

struct UPortalWarsNewsFeedWidget : UPortalWarsMenuCarouselWidget {
	UPortalWarsButtonWidget* ActionButton; // 0x310
	UWidget* NewsFeedRoot; // 0x318
	UPortalWarsNewsFeedEntryWidget* NewsFeedEntryWidgetClass; // 0x320
};

struct UNiagaraDataInterfaceSpline : UNiagaraDataInterface {
	AActor* Source; // 0x38
	FNiagaraUserParameterBinding SplineUserParameter; // 0x40
};

struct UHierarchicalLODSetup : UObject {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct URadialVector : UFieldNodeVector {
	float Magnitude; // 0xb0
	FVector Position; // 0xb4
};

struct APortalWarsBaseGameMode : AGameMode {
	int32_t MaxPlayers; // 0x308
	APawn* BotPawnClass; // 0x310
	APortalWarsAIController* AIControllerClass; // 0x318
};

struct UCheckBox : UContentWidget {
	ECheckBoxState CheckedState; // 0x120
	FDelegate CheckedStateDelegate; // 0x124
	FCheckBoxStyle WidgetStyle; // 0x138
	USlateWidgetStyleAsset* Style; // 0x6b8
	USlateBrushAsset* UncheckedImage; // 0x6c0
	USlateBrushAsset* UncheckedHoveredImage; // 0x6c8
	USlateBrushAsset* UncheckedPressedImage; // 0x6d0
	USlateBrushAsset* CheckedImage; // 0x6d8
	USlateBrushAsset* CheckedHoveredImage; // 0x6e0
	USlateBrushAsset* CheckedPressedImage; // 0x6e8
	USlateBrushAsset* UndeterminedImage; // 0x6f0
	USlateBrushAsset* UndeterminedHoveredImage; // 0x6f8
	USlateBrushAsset* UndeterminedPressedImage; // 0x700
	EHorizontalAlignment HorizontalAlignment; // 0x708
	FMargin Padding; // 0x70c
	FSlateColor BorderBackgroundColor; // 0x720
	EButtonClickMethod ClickMethod; // 0x748
	EButtonTouchMethod TouchMethod; // 0x749
	EButtonPressMethod PressMethod; // 0x74a
	bool IsFocusable; // 0x74b
	FMulticastInlineDelegate OnCheckStateChanged; // 0x750
};

struct UAsyncActionLoadPrimaryAssetClass : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct APortalWarsForcedTeleportTrigger : ATriggerBox {
	APortalWall* TargetPortalWall; // 0x228
};

struct APlayerState : AInfo {
	float Score; // 0x220
	int32_t PlayerId; // 0x224
	char Ping; // 0x228
	char bShouldUpdateReplicatedPing : 1; // 0x22a
	char bIsSpectator : 1; // 0x22a
	char bOnlySpectator : 1; // 0x22a
	char bIsABot : 1; // 0x22a
	char bIsInactive : 1; // 0x22a
	char bFromPreviousLevel : 1; // 0x22a
	int32_t StartTime; // 0x22c
	ULocalMessage* EngineMessageClass; // 0x230
	FString SavedNetworkAddress; // 0x240
	FUniqueNetIdRepl UniqueId; // 0x250
	APawn* PawnPrivate; // 0x280
	FString PlayerNamePrivate; // 0x300
};

struct UMaterialExpressionDepthOfFieldFunction : UMaterialExpression {
	EDepthOfFieldFunctionValue FunctionValue; // 0x40
	FExpressionInput Depth; // 0x44
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x598
};

struct UGizmoPlaneScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct URectLightComponent : ULocalLightComponent {
	float SourceWidth; // 0x340
	float SourceHeight; // 0x344
	float BarnDoorAngle; // 0x348
	float BarnDoorLength; // 0x34c
	UTexture* SourceTexture; // 0x350
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
	FMulticastInlineDelegate OnPawnControllerChangedDelegates; // 0x78
};

struct UMaterialExpressionGetMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x40
	TArray<FGuid> AttributeGetTypes; // 0x58
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x60
};

struct UNiagaraParameterCollection : UObject {
	FName Namespace; // 0x28
	TArray<FNiagaraVariable> Parameters; // 0x30
	UMaterialParameterCollection* SourceMaterialCollection; // 0x40
	UNiagaraParameterCollectionInstance* DefaultInstance; // 0x48
	FGuid CompileId; // 0x50
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0xb8
	FAIDataProviderFloatValue SpaceBetween; // 0xf0
	FAIDataProviderIntValue NumberOfPoints; // 0x128
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x160
	FEnvDirection ArcDirection; // 0x168
	FAIDataProviderFloatValue ArcAngle; // 0x188
	float AngleRadians; // 0x1c0
	UEnvQueryContext* CircleCenter; // 0x1c8
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x1d0
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1d8
	FEnvTraceData TraceData; // 0x210
	char bDefineArc : 1; // 0x240
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UMaterialExpressionStep : UMaterialExpression {
	FExpressionInput Y; // 0x40
	FExpressionInput X; // 0x54
	float ConstY; // 0x68
	float ConstX; // 0x6c
};

struct USourceEffectBitCrusherPreset : USoundEffectSourcePreset {
	FSourceEffectBitCrusherSettings Settings; // 0xc0
};

struct UNiagaraDataInterfaceArrayFloat2 : UNiagaraDataInterfaceArray {
	TArray<FVector2D> FloatData; // 0x50
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x220
	FName MatineeControllerName; // 0x228
	float PlayRate; // 0x230
	char bPlayOnLevelLoad : 1; // 0x234
	char bForceStartPos : 1; // 0x234
	float ForceStartPosition; // 0x238
	char bLooping : 1; // 0x23c
	char bRewindOnPlay : 1; // 0x23c
	char bNoResetOnRewind : 1; // 0x23c
	char bRewindIfAlreadyPlaying : 1; // 0x23c
	char bDisableRadioFilter : 1; // 0x23c
	char bClientSideOnly : 1; // 0x23c
	char bSkipUpdateIfNotVisible : 1; // 0x23c
	char bIsSkippable : 1; // 0x23c
	int32_t PreferredSplitScreenNum; // 0x240
	char bDisableMovementInput : 1; // 0x244
	char bDisableLookAtInput : 1; // 0x244
	char bHidePlayer : 1; // 0x244
	char bHideHud : 1; // 0x244
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x248
	char bShouldShowGore : 1; // 0x258
	TArray<UInterpGroupInst*> GroupInst; // 0x260
	TArray<FCameraCutInfo> CameraCuts; // 0x270
	char bIsPlaying : 1; // 0x280
	char bReversePlayback : 1; // 0x280
	char bPaused : 1; // 0x280
	char bPendingStop : 1; // 0x280
	float InterpPosition; // 0x284
	char ReplicationForceIsPlaying; // 0x28c
	FMulticastInlineDelegate OnPlay; // 0x290
	FMulticastInlineDelegate OnStop; // 0x2a0
	FMulticastInlineDelegate OnPause; // 0x2b0
};

struct UPortalWarsNotificationManager : UObject {
	UPortalWarsDialogWidget* MessageDialogWidgetClass; // 0x30
	UPortalWarsDialogWidget* RewardReceivedWidgetClass; // 0x38
	UPortalWarsDialogWidget* ChallengeDialogWidgetClass; // 0x40
	UPortalWarsDialogWidget* StreakIncreaseWidgetClass; // 0x48
	UPortalWarsUnlockDialogWidget* UnlockDialogWidgetClass; // 0x50
	UPortalWarsProgressionUpdateDialogWidget* ProgressionDialogWidgetClass; // 0x58
	UPortalWarsBPPurchaseDialogWidget* BattlePassPurchaseDialogWidgetClass; // 0x60
	UPortalWarsDialogWidget* HappyHourWidgetClass; // 0x68
	UPortalWarsDialogWidget* PlaylistActiveWidgetClass; // 0x70
	UPortalWarsDialogWidget* GameSessionReconnectWidgetClass; // 0x78
	UPortalWarsDialogWidget* LimitedTimeOfferWidgetClass; // 0x80
	UPortalWarsDialogWidget* PostGameOverviewWidgetClass; // 0x88
	UPortalWarsDialogWidget* RankUpdateWidgetClass; // 0x90
	TArray<UPortalWarsDialogWidget*> DialogObjects; // 0xa0
};

struct UPortalWarsPickupZoneIndicator : UPortalWarsPickupIndicatorWidget {
	UTextBlock* TimeText; // 0x2d0
};

struct UChildActorComponent : USceneComponent {
	AActor* ChildActorClass; // 0x1f8
	AActor* ChildActor; // 0x200
	AActor* ChildActorTemplate; // 0x208
};

struct UMaterialExpressionMaterialFunctionCall : UMaterialExpression {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UDatasmithGLTFSceneImportData : UDatasmithSceneImportData {
	FString Generator; // 0x28
	float Version; // 0x38
	FString Author; // 0x40
	FString License; // 0x50
	FString Source; // 0x60
};

struct APortalWarsTakedownPlayerState : APortalWarsRoundPlayerState {
	char RespawnTime; // 0xac8
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleBeamTarget : UParticleModuleBeamBase {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x88
	char bLockTarget : 1; // 0x88
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x8c
	FRawDistributionVector TargetTangent; // 0x90
	char bLockTargetTangent : 1; // 0xd8
	FRawDistributionFloat TargetStrength; // 0xe0
	char bLockTargetStength : 1; // 0x110
	float LockRadius; // 0x114
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UShaderPlatformQualitySettings : UObject {
	FMaterialQualityOverrides QualityOverrides[0x4]; // 0x28
};

struct UMaterialExpressionConstant : UMaterialExpression {
	float R; // 0x40
};

struct UPortalWarsCustomSettingsWidget : UPortalWarsMenuWidget {
	UPortalWarsTeamSelectWidget* TeamSelector; // 0x338
	UPortalWarsTextInputWidget* AlphaName; // 0x348
	UPortalWarsTextInputWidget* BravoName; // 0x350
	UPortalWarsTeamNumericCarouselWidget* ScoreLimitSelector; // 0x358
	UPortalWarsNumericCarouselWidget* TimeLimitSelector; // 0x360
	UPortalWarsTeamNumericCarouselWidget* RespawnTimeSelector; // 0x368
	UPortalWarsTeamGlobalCarouselWidget* PrimaryWeaponSelector; // 0x370
	UPortalWarsTeamGlobalCarouselWidget* SecondaryWeaponSelector; // 0x378
	UPortalWarsCheckBoxWidget* PickupsEnabledCheckBox; // 0x380
	UPortalWarsCheckBoxWidget* BotsEnabledCheckBox; // 0x388
	UPortalWarsDifficultySelectWidget* BotDifficultySelector; // 0x390
	UPortalWarsTeamCheckboxWidget* BoundariesEnabledCheckBox; // 0x398
	UPortalWarsTeamCheckboxWidget* RadarEnabledCheckBox; // 0x3a0
	UPortalWarsTeamCheckboxWidget* JetpackEnabledCheckBox; // 0x3a8
	UPortalWarsTeamCheckboxWidget* SprintEnabledCheckBox; // 0x3b0
	UPortalWarsTeamCheckboxWidget* PortalGunEnabledCheckBox; // 0x3b8
	UPortalWarsTeamCheckboxWidget* MeleeEnabledCheckBox; // 0x3c0
	UPortalWarsTeamCheckboxWidget* HeadshotsOnlyCheckBox; // 0x3c8
	UPortalWarsTeamCheckboxWidget* BigHeadModeCheckBox; // 0x3d0
	UPortalWarsTeamCheckboxWidget* UnlimitedAmmoCheckBox; // 0x3d8
	UPortalWarsTeamCheckboxWidget* UnlimitedClipSizeCheckBox; // 0x3e0
	UPortalWarsCheckBoxWidget* RandomHillsEnabledCheckBox; // 0x3e8
	UPortalWarsCheckBoxWidget* KillcamEnabledCheckBox; // 0x3f0
	UPortalWarsTeamCheckboxWidget* RandomWeaponsCheckBox; // 0x3f8
	UPortalWarsCheckBoxWidget* SwitchTeamsCheckBox; // 0x400
	UPortalWarsTeamCheckboxWidget* WeaponDropsCheckBox; // 0x408
	UPortalWarsTeamDecimalCarouselWidget* WalkSpeedModifier; // 0x410
	UPortalWarsTeamDecimalCarouselWidget* JumpHeightModifier; // 0x418
	UPortalWarsTeamDecimalCarouselWidget* GravityModifier; // 0x420
	UPortalWarsTeamDecimalCarouselWidget* JetpackFuelModifier; // 0x428
	UPortalWarsTeamDecimalCarouselWidget* JetpackBoostModifier; // 0x430
	UPortalWarsTeamDecimalCarouselWidget* MeleeDmgModifier; // 0x438
	UPortalWarsTeamDecimalCarouselWidget* HealthModifier; // 0x440
	UPortalWarsButtonWidget* PresetOptionsButton; // 0x448
	UPortalWarsFileOptionsDialogWidget* PresetOptionsDialogClass; // 0x450
	UPortalWarsButtonWidget* TeamNamesButton; // 0x458
	UPortalWarsButtonWidget* ModeSettingsButton; // 0x460
	UPortalWarsButtonWidget* BotSettingsButton; // 0x468
	UPortalWarsButtonWidget* MapOptionsButton; // 0x470
	UPortalWarsButtonWidget* ModeOptionsButton; // 0x478
	UPortalWarsButtonWidget* TeamOptionsButton; // 0x480
	UPortalWarsButtonWidget* WeaponOptionsButton; // 0x488
	UPortalWarsButtonWidget* PlayerAttributesButton; // 0x490
	UPortalWarsButtonWidget* AbilityOptionsButton; // 0x498
	UTextBlock* MatchOptionsText; // 0x4a0
	UScrollBox* SettingsScrollBox; // 0x4a8
};

struct UParticleModuleAccelerationDrag : UParticleModuleAccelerationBase {
	UDistributionFloat* DragCoefficient; // 0x38
	FRawDistributionFloat DragCoefficientRaw; // 0x40
};

struct UPortalWarsFlagZoneIndicator : UPortalWarsIndicatorWidget {
	UWidget* Pointer; // 0x2b8
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x450
	UBodySetup* BrushBodySetup; // 0x458
};

struct UMovieSceneEvaluationHookSystem : UMovieSceneEntitySystem {
	TMap<FMovieSceneEvaluationInstanceKey, FMovieSceneEvaluationHookEventContainer> PendingEventsByRootInstance; // 0x40
};

struct ASphereReflectionCapture : AReflectionCapture {
	UDrawSphereComponent* DrawCaptureRadius; // 0x228
};

struct UMediaTexture : UTexture {
	TextureAddress AddressX; // 0x178
	TextureAddress AddressY; // 0x179
	bool AutoClear; // 0x17a
	FLinearColor ClearColor; // 0x17c
	bool EnableGenMips; // 0x18c
	char NumMips; // 0x18d
	bool NewStyleOutput; // 0x18e
	MediaTextureOutputFormat OutputFormat; // 0x18f
	float CurrentAspectRatio; // 0x190
	MediaTextureOrientation CurrentOrientation; // 0x194
	UMediaPlayer* MediaPlayer; // 0x198
};

struct AMagicLeapARPinRenderer : AActor {
	bool bInfoActorsVisibilityOverride; // 0x220
	TMap<FGuid, AMagicLeapARPinInfoActorBase*> AllInfoActors; // 0x228
	AMagicLeapARPinInfoActorBase* ClassToSpawn; // 0x280
};

struct UEdGraphNode : UObject {
	TArray<UEdGraphPin_Deprecated*> DeprecatedPins; // 0x38
	int32_t NodePosX; // 0x48
	int32_t NodePosY; // 0x4c
	int32_t NodeWidth; // 0x50
	int32_t NodeHeight; // 0x54
	ENodeAdvancedPins AdvancedPinDisplay; // 0x58
	ENodeEnabledState EnabledState; // 0x59
	char bDisplayAsDisabled : 1; // 0x5b
	char bUserSetEnabledState : 1; // 0x5b
	char bIsNodeEnabled : 1; // 0x5b
	char bHasCompilerMessage : 1; // 0x5b
	FString NodeComment; // 0x60
	int32_t ErrorType; // 0x70
	FString ErrorMsg; // 0x78
	FGuid NodeGuid; // 0x88
};

struct UPortalWarsNavBarWidget : UPortalWarsUserWidget {
	FMulticastInlineDelegate OnNavBarStateChanged; // 0x2a8
	char CurrentState; // 0x2b8
	TArray<FNavBarItem> ItemArray; // 0x2c0
	FMargin ItemPadding; // 0x2d0
	UPanelWidget* ButtonPanel; // 0x2e0
	UPortalWarsNavButtonWidget* NavButtonWidgetClass; // 0x2e8
	UPortalWarsInputWidget* NavSubHeaderWidgetClass; // 0x2f0
	bool bSelectOnControllerHover; // 0x2f8
	TArray<UPortalWarsNavButtonWidget*> ButtonArray; // 0x300
	FLinearColor NewColor; // 0x310
	UPortalWarsButtonWidget* PrevGamepadButton; // 0x320
	UPortalWarsButtonWidget* NextGamepadButton; // 0x328
	FKey PrevGamepadKey; // 0x330
	FKey NextGamepadKey; // 0x348
	UAkAudioEvent* TabNextEvent; // 0x360
	UAkAudioEvent* TabPrevEvent; // 0x368
};

struct UMaterialExpressionNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	FExpressionInput FilterWidth; // 0x54
	float Scale; // 0x68
	int32_t Quality; // 0x6c
	ENoiseFunction NoiseFunction; // 0x70
	char bTurbulence : 1; // 0x74
	int32_t Levels; // 0x78
	float OutputMin; // 0x7c
	float OutputMax; // 0x80
	float LevelScale; // 0x84
	char bTiling : 1; // 0x88
	uint32_t RepeatSize; // 0x8c
};

struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	TArray<int32_t> SortedInstances; // 0x598
	int32_t NumBuiltInstances; // 0x5a8
	FBox BuiltInstanceBounds; // 0x5b0
	FBox UnbuiltInstanceBounds; // 0x5cc
	TArray<FBox> UnbuiltInstanceBoundsList; // 0x5e8
	char bEnableDensityScaling : 1; // 0x5f8
	int32_t OcclusionLayerNumNodes; // 0x600
	FBoxSphereBounds CacheMeshExtendedBounds; // 0x604
	bool bDisableCollision; // 0x620
	int32_t InstanceCountToRender; // 0x624
};

struct UDebugCameraControllerSettings : UDeveloperSettings {
	TArray<FDebugCameraControllerSettingsViewModeIndex> CycleViewModes; // 0x38
};

struct UComboBoxString : UWidget {
	TArray<FString> DefaultOptions; // 0x108
	FString SelectedOption; // 0x118
	FComboBoxStyle WidgetStyle; // 0x128
	FTableRowStyle ItemStyle; // 0x518
	FMargin ContentPadding; // 0xce0
	float MaxListHeight; // 0xcf0
	bool HasDownArrow; // 0xcf4
	bool EnableGamepadNavigationMode; // 0xcf5
	FSlateFontInfo Font; // 0xcf8
	FSlateColor ForegroundColor; // 0xd50
	bool bIsFocusable; // 0xd78
	FDelegate OnGenerateWidgetEvent; // 0xd7c
	FMulticastInlineDelegate OnSelectionChanged; // 0xd90
	FMulticastInlineDelegate OnOpening; // 0xda0
};

struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x6a0
	UAnimInstance* AnimClass; // 0x6a8
	UAnimInstance* AnimScriptInstance; // 0x6b0
	UAnimInstance* PostProcessAnimInstance; // 0x6b8
	FSingleAnimationPlayData AnimationData; // 0x6c0
	FVector RootBoneTranslation; // 0x6e8
	FVector LineCheckBoundsScale; // 0x6f4
	TArray<UAnimInstance*> LinkedInstances; // 0x730
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x740
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x750
	float GlobalAnimRateScale; // 0x8b0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8b4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8b5
	EAnimationMode AnimationMode; // 0x8b7
	char bDisablePostProcessBlueprint : 1; // 0x8b9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8b9
	char bHasValidBodies : 1; // 0x8b9
	char bBlendPhysics : 1; // 0x8b9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8b9
	char bUpdateJointsFromAnimation : 1; // 0x8b9
	char bDisableClothSimulation : 1; // 0x8ba
	char bDisableRigidBodyAnimNode : 1; // 0x8c0
	char bAllowAnimCurveEvaluation : 1; // 0x8c0
	char bDisableAnimCurves : 1; // 0x8c0
	char bCollideWithEnvironment : 1; // 0x8c0
	char bCollideWithAttachedChildren : 1; // 0x8c1
	char bLocalSpaceSimulation : 1; // 0x8c1
	char bResetAfterTeleport : 1; // 0x8c1
	char bDeferKinematicBoneUpdate : 1; // 0x8c1
	char bNoSkeletonUpdate : 1; // 0x8c1
	char bPauseAnims : 1; // 0x8c1
	char bUseRefPoseOnInitAnim : 1; // 0x8c1
	char bEnablePerPolyCollision : 1; // 0x8c2
	char bForceRefpose : 1; // 0x8c2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8c2
	char bIsAutonomousTickPose : 1; // 0x8c2
	char bOldForceRefPose : 1; // 0x8c2
	char bShowPrePhysBones : 1; // 0x8c2
	char bRequiredBonesUpToDate : 1; // 0x8c2
	char bAnimTreeInitialised : 1; // 0x8c2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8c3
	char bEnableLineCheckWithBounds : 1; // 0x8c3
	char bUseBendingElements : 1; // 0x8c3
	char bUseTetrahedralConstraints : 1; // 0x8c3
	char bUseThinShellVolumeConstraints : 1; // 0x8c3
	char bUseSelfCollisions : 1; // 0x8c3
	char bUseContinuousCollisionDetection : 1; // 0x8c3
	char bPropagateCurvesToSlaves : 1; // 0x8c3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8c4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8c4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8c4
	uint16_t CachedAnimCurveUidVersion; // 0x8c6
	EClothMassMode MassMode; // 0x8c8
	float UniformMass; // 0x8cc
	float TotalMass; // 0x8d0
	float Density; // 0x8d4
	float MinPerParticleMass; // 0x8d8
	float ClothBlendWeight; // 0x8dc
	float EdgeStiffness; // 0x8e0
	float BendingStiffness; // 0x8e4
	float AreaStiffness; // 0x8e8
	float VolumeStiffness; // 0x8ec
	float StrainLimitingStiffness; // 0x8f0
	float ShapeTargetStiffness; // 0x8f4
	bool bWaitForParallelClothTask; // 0x8f8
	TArray<FName> DisallowedAnimCurves; // 0x900
	UBodySetup* BodySetup; // 0x910
	FMulticastInlineDelegate OnConstraintBroken; // 0x920
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x930
	float TeleportDistanceThreshold; // 0xa08
	float TeleportRotationThreshold; // 0xa0c
	uint32_t LastPoseTickFrame; // 0xa18
	UClothingSimulationInteractor* ClothingInteractor; // 0xa70
	FMulticastInlineDelegate OnAnimInitialized; // 0xb40
};

struct UParticleModuleSize : UParticleModuleSizeBase {
	FRawDistributionVector StartSize; // 0x30
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct ATransformGizmoActor : AGizmoActor {
	UPrimitiveComponent* TranslateX; // 0x220
	UPrimitiveComponent* TranslateY; // 0x228
	UPrimitiveComponent* TranslateZ; // 0x230
	UPrimitiveComponent* TranslateYZ; // 0x238
	UPrimitiveComponent* TranslateXZ; // 0x240
	UPrimitiveComponent* TranslateXY; // 0x248
	UPrimitiveComponent* RotateX; // 0x250
	UPrimitiveComponent* RotateY; // 0x258
	UPrimitiveComponent* RotateZ; // 0x260
	UPrimitiveComponent* UniformScale; // 0x268
	UPrimitiveComponent* AxisScaleX; // 0x270
	UPrimitiveComponent* AxisScaleY; // 0x278
	UPrimitiveComponent* AxisScaleZ; // 0x280
	UPrimitiveComponent* PlaneScaleYZ; // 0x288
	UPrimitiveComponent* PlaneScaleXZ; // 0x290
	UPrimitiveComponent* PlaneScaleXY; // 0x298
};

struct UPortalWarsDropIndicatorWidget : UUserWidget {
	UTextBlock* DropsText; // 0x260
	bool bHideWhenEmpty; // 0x26c
};

struct UBTTask_FindTeabag : UBTTaskNode {
	float nearTeaBagRadius; // 0x70
};

struct UPlanarReflectionComponent : USceneCaptureComponent {
	UBoxComponent* PreviewBox; // 0x2c0
	float NormalDistortionStrength; // 0x2c8
	float PrefilterRoughness; // 0x2cc
	float PrefilterRoughnessDistance; // 0x2d0
	int32_t ScreenPercentage; // 0x2d4
	float ExtraFOV; // 0x2d8
	float DistanceFromPlaneFadeStart; // 0x2dc
	float DistanceFromPlaneFadeEnd; // 0x2e0
	float DistanceFromPlaneFadeoutStart; // 0x2e4
	float DistanceFromPlaneFadeoutEnd; // 0x2e8
	float AngleFromPlaneFadeStart; // 0x2ec
	float AngleFromPlaneFadeEnd; // 0x2f0
	bool bShowPreviewPlane; // 0x2f4
	bool bRenderSceneTwoSided; // 0x2f5
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct UAnimNotifyState_Trail : UAnimNotifyState {
	UParticleSystem* PSTemplate; // 0x30
	FName FirstSocketName; // 0x38
	FName SecondSocketName; // 0x40
	ETrailWidthMode WidthScaleMode; // 0x48
	FName WidthScaleCurve; // 0x4c
	char bRecycleSpawnedSystems : 1; // 0x54
};

struct UPortalWarsLineupAnimInstance : UAnimInstance {
	APortalWarsLineUpCharacter* Character; // 0x2b8
	bool bIsPlayingEmote; // 0x2c0
	UAnimSequence* EmoteAnimSequence; // 0x2c8
};

struct UMagicLeapARPinSettings : UObject {
	float UpdateCheckFrequency; // 0x28
	FMagicLeapARPinState OnUpdatedEventTriggerDelta; // 0x2c
};

struct UParticleModuleSizeScaleBySpeed : UParticleModuleSizeBase {
	FVector2D SpeedScale; // 0x30
	FVector2D MaxScale; // 0x38
};

struct USoundSubmixWithParentBase : USoundSubmixBase {
	USoundSubmixBase* ParentSubmix; // 0x38
};

struct UMovieSceneMediaPlayerPropertySection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLoop; // 0xf0
};

struct UPlayerInput : UObject {
	TArray<FKeyBind> DebugExecBindings; // 0x120
	TArray<FName> InvertedAxis; // 0x160
};

struct USubUVAnimation : UObject {
	UTexture2D* SubUVTexture; // 0x28
	int32_t SubImages_Horizontal; // 0x30
	int32_t SubImages_Vertical; // 0x34
	ESubUVBoundingVertexCount BoundingMode; // 0x38
	EOpacitySourceMode OpacitySourceMode; // 0x39
	float AlphaThreshold; // 0x3c
};

struct UPortalWarsLocalPlayer : ULocalPlayer {
	UTexture* PlayerAvatar; // 0x288
	TArray<UObject*> CachedCustomizationObjects; // 0x440
	UPortalWarsNotificationManager* NotificationManager; // 0x490
	UPortalWarsNotificationManager* NotificationManagerClass; // 0x498
	UPortalWarsInviteManager* InviteManager; // 0x4a0
	UPortalWarsInviteManager* InviteManagerClass; // 0x4a8
	UPortalWarsDialogWidget* ControllerDisconnectedWidget; // 0x4b8
	UPortalWarsDialogWidget* ControllerDisconnectWidgetClass; // 0x4c0
	UPortalWarsSaveGame* UserSaveGameData; // 0x500
};

struct UPortalWarsCTFHUDOverlayWidget : UUserWidget {
	UPortalWarsFlagResetStatusWidget* FlagResetStatus; // 0x260
};

struct UPortalWarsGoalIndicatorWidget : UPortalWarsIndicatorWidget {
	UWidget* Pointer; // 0x2b8
	FVector StandardOffset; // 0x2c0
	FVector DummyPlayerOffset; // 0x2cc
	FVector PortalWallOffset; // 0x2d8
};

struct UBehaviorTreeComponent : UBrainComponent {
	TArray<UBTNode*> NodeInstances; // 0x128
	UBehaviorTree* DefaultBehaviorTreeAsset; // 0x278
};

