// Created by BlueFire1337
// Updated 2021-11-26
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x4e66100;
	constexpr auto GObjects = 0x4e7d990;
	constexpr auto GWorld = 0x4f7fb38;
}

struct ASQWorldSettings : AWorldSettings {
	FVector2D MapGridSpacing; // 0x3c8
	AActor* MapTextureCornerZero; // 0x3d0
	AActor* MapTextureCornerOne; // 0x3d8
	FSQMinimapMakerSettings MinimapMakerSettings; // 0x3e0
	AActor* MapCameraLocation; // 0x930
	TArray<ASQGameRuleSet*> MapRulesets; // 0x938
	FText DisplayTitle; // 0x948
	FScriptMulticastDelegate OnMapTextureChange; // 0x960
	int SeaLevel; // 0x970
	int HelicoptersAltitudeThreshold; // 0x974
	bool bCanDriverSwitchTo3rdPerson; // 0x978
	UTexture* MapTexture; // 0x980
};

struct ABP_RPG7_Parent_C : ABP_GenericRocketLauncher_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UParticleSystemComponent* MuzzleFlashRearComponent3P; // 0x7b8
	UChildActorComponent* BackBlastComponent3P; // 0x7c0
	UParticleSystemComponent* MuzzleFlashRearComponent1P; // 0x7c8
	USQBlastComponent* SquadBlast; // 0x7d0
	UChildActorComponent* BackBlastComponent1P; // 0x7d8
	FName BackblastSocket; // 0x7e0
	UParticleSystem* BackblastEffect1P; // 0x7e8
	UParticleSystem* BackblastEffect3P; // 0x7f0
};

struct ABP_M9_Nickel_C : ABP_M9_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UParticleModuleRequired : UParticleModule {
	UMaterialInterface* Material; // 0x30
	FVector EmitterOrigin; // 0x38
	FRotator EmitterRotation; // 0x44
	EParticleScreenAlignment ScreenAlignment; // 0x50
	float MinFacingCameraBlendDistance; // 0x54
	float MaxFacingCameraBlendDistance; // 0x58
	char bUseLocalSpace : 1; // 0x5c
	char bKillOnDeactivate : 1; // 0x5c
	char bKillOnCompleted : 1; // 0x5c
	EParticleSortMode SortMode; // 0x60
	char bUseLegacyEmitterTime : 1; // 0x64
	char bRemoveHMDRoll : 1; // 0x64
	float EmitterDuration; // 0x68
	float EmitterDurationLow; // 0x6c
	char bEmitterDurationUseRange : 1; // 0x70
	char bDurationRecalcEachLoop : 1; // 0x70
	int EmitterLoops; // 0x74
	FRawDistributionFloat SpawnRate; // 0x78
	EParticleBurstMethod ParticleBurstMethod; // 0xb0
	TArray<FParticleBurst> BurstList; // 0xb8
	float EmitterDelay; // 0xc8
	float EmitterDelayLow; // 0xcc
	char bEmitterDelayUseRange : 1; // 0xd0
	char bDelayFirstLoopOnly : 1; // 0xd0
	EParticleSubUVInterpMethod InterpolationMethod; // 0xd4
	int SubImages_Horizontal; // 0xd8
	int SubImages_Vertical; // 0xdc
	char bScaleUV : 1; // 0xe0
	float RandomImageTime; // 0xe4
	int RandomImageChanges; // 0xe8
	char bOverrideSystemMacroUV : 1; // 0xec
	FVector MacroUVPosition; // 0xf0
	float MacroUVRadius; // 0xfc
	char bUseMaxDrawCount : 1; // 0x100
	int MaxDrawCount; // 0x104
	EParticleUVFlipMode UVFlippingMode; // 0x108
	UTexture2D* CutoutTexture; // 0x110
	ESubUVBoundingVertexCount BoundingMode; // 0x118
	EOpacitySourceMode OpacitySourceMode; // 0x119
	float AlphaThreshold; // 0x11c
	EEmitterNormalsMode EmitterNormalsMode; // 0x120
	FVector NormalsSphereCenter; // 0x124
	FVector NormalsCylinderDirection; // 0x130
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0x13c
	TArray<FName> NamedMaterialOverrides; // 0x140
};

struct UAnimSequencerInstance : UAnimCustomInstance {
	USkeleton* CurrentSkeleton; // 0x28
	ERootMotionMode RootMotionMode; // 0x30
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31
	char bUsingCopyPoseFromMesh : 1; // 0x31
	char bQueueMontageEvents : 1; // 0x31
	FScriptMulticastDelegate OnMontageBlendingOut; // 0x38
	FScriptMulticastDelegate OnMontageStarted; // 0x48
	FScriptMulticastDelegate OnMontageEnded; // 0x58
	FScriptMulticastDelegate OnAllMontageInstancesEnded; // 0x68
	FAnimNotifyQueue NotifyQueue; // 0x100
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170
};

struct USQBaseGameSubsystem : UObject {
	USQGameInstance* SQGameInstance; // 0x38
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x258
};

struct UAIPerceptionSystem : UAISubsystem {
	TArray<UAISense*> Senses; // 0x88
	float PerceptionAgingRate; // 0x98
};

struct UMaterialFunction : UMaterialFunctionInterface {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
	TArray<UMaterialExpression*> FunctionExpressions; // 0x58
	char bReentrantFlag : 1; // 0x68
};

struct UWindowTitleBarAreaSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct USQJoinSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
	UObject* WorldContextObject; // 0x120
};

struct UCheckBoxStyleAsset : UObject {
	FCheckBoxStyle CheckBoxStyle; // 0x28
};

struct ABP_AK74M_C : ABP_AK74_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	FExpressionInput Coordinates; // 0x50
	FExpressionInput TextureObject; // 0x64
	FExpressionInput MipValue; // 0x78
	FExpressionInput CoordinatesDX; // 0x8c
	FExpressionInput CoordinatesDY; // 0xa0
	FExpressionInput AutomaticViewMipBiasValue; // 0xb4
	ETextureMipValueMode MipValueMode; // 0xc8
	ESamplerSourceMode SamplerSource; // 0xc9
	uint32 ConstCoordinate; // 0xcc
	int ConstMipValue; // 0xd0
	char AutomaticViewMipBias : 1; // 0xd4
};

struct UMaterialExpressionLightmassReplace : UMaterialExpression {
	FExpressionInput Realtime; // 0x40
	FExpressionInput Lightmass; // 0x54
};

struct UBP_attachment_foregrip_founders_C : UBP_attachment_foregrip_C {
	FName SocketName; // 0x498
	ASQWeapon* AttachedWeapon; // 0x4a0
	bool bShowIn1P; // 0x4a8
	bool bShowIn3P; // 0x4a9
};

struct ALevelSequenceActor : AActor {
	FMovieSceneSequencePlaybackSettings PlaybackSettings; // 0x258
	ULevelSequencePlayer* SequencePlayer; // 0x270
	FSoftObjectPath LevelSequence; // 0x278
	TArray<AActor*> AdditionalEventReceivers; // 0x290
	ULevelSequenceBurnInOptions* BurnInOptions; // 0x2a0
	UMovieSceneBindingOverrides* BindingOverrides; // 0x2a8
	char bAutoPlay : 1; // 0x2b0
	char bOverrideInstanceData : 1; // 0x2b0
	char bReplicatePlayback : 1; // 0x2b0
	UObject* DefaultInstanceData; // 0x2b8
	ULevelSequenceBurnIn* BurnInInstance; // 0x2c0
	bool bShowBurnin; // 0x2c8
};

struct UMaterialExpressionParticleRadius : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UVisibilityBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct ASQObjectiveSpawnLocation : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x80
	char bNetTemporary : 1; // 0x80
	char bNetStartup : 1; // 0x80
	char bOnlyRelevantToOwner : 1; // 0x80
	char bAlwaysRelevant : 1; // 0x80
	char bReplicateMovement : 1; // 0x80
	char bTearOff : 1; // 0x80
	char bExchangedRoles : 1; // 0x80
	char bNetLoadOnClient : 1; // 0x81
	char bNetUseOwnerRelevancy : 1; // 0x81
	char bRelevantForNetworkReplays : 1; // 0x81
	char bRelevantForLevelBounds : 1; // 0x81
	char bReplayRewindable : 1; // 0x81
	char bAllowTickBeforeBeginPlay : 1; // 0x81
	char bAutoDestroyWhenFinished : 1; // 0x81
	char bBlockInput : 1; // 0x81
	char bCanBeDamaged : 1; // 0x82
	char bCollideWhenPlacing : 1; // 0x82
	char bFindCameraComponentWhenViewTarget : 1; // 0x82
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x82
	char bIgnoresOriginShifting : 1; // 0x82
	char bEnableAutoLODGeneration : 1; // 0x82
	char bIsEditorOnlyActor : 1; // 0x82
	char bActorSeamlessTraveled : 1; // 0x82
	char bReplicates : 1; // 0x83
	char bCanBeInCluster : 1; // 0x83
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x83
	char bActorEnableCollision : 1; // 0x84
	char bActorIsBeingDestroyed : 1; // 0x84
	ENetRole RemoteRole; // 0x85
	FRepMovement ReplicatedMovement; // 0x88
	float InitialLifeSpan; // 0xbc
	float CustomTimeDilation; // 0xc0
	FRepAttachment AttachmentReplication; // 0xc8
	AActor* Owner; // 0x108
	FName NetDriverName; // 0x110
	ENetRole Role; // 0x118
	ENetDormancy NetDormancy; // 0x119
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x11a
	EAutoReceiveInput AutoReceiveInput; // 0x11b
	int InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int NetTag; // 0x12c
	float NetUpdateFrequency; // 0x130
	float MinNetUpdateFrequency; // 0x134
	char bUseRelativeNetUpdateFrequency : 1; // 0x138
	char bUseOwnerRelativeNetUpdateFrequency : 1; // 0x138
	float MinRelativeNetUpdateEvaluationFrequency; // 0x13c
	float NetPriority; // 0x140
	APawn* Instigator; // 0x148
	TArray<AActor*> Children; // 0x150
	USceneComponent* RootComponent; // 0x160
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x168
	TArray<FName> Layers; // 0x180
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x190
	TArray<FName> Tags; // 0x198
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1a8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1a9
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x1aa
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1ab
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1ac
	FScriptMulticastDelegate OnBeginCursorOver; // 0x1ad
	FScriptMulticastDelegate OnEndCursorOver; // 0x1ae
	FScriptMulticastDelegate OnClicked; // 0x1af
	FScriptMulticastDelegate OnReleased; // 0x1b0
	FScriptMulticastDelegate OnInputTouchBegin; // 0x1b1
	FScriptMulticastDelegate OnInputTouchEnd; // 0x1b2
	FScriptMulticastDelegate OnInputTouchEnter; // 0x1b3
	FScriptMulticastDelegate OnInputTouchLeave; // 0x1b4
	FScriptMulticastDelegate OnActorHit; // 0x1b5
	FScriptMulticastDelegate OnDestroyed; // 0x1b6
	FScriptMulticastDelegate OnEndPlay; // 0x1b7
	TArray<UActorComponent*> InstanceComponents; // 0x218
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x228
};

struct ABP_L85A2AG36_ElcanLDS_UGL_Parent_C : ABP_L85A2AG36_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_AK74MGP25_Rifle_1P78_Desert_C : ABP_AK74MGP25_Rifle_1P78_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_AK74GP25_UGL_Smoke_Blue_Founders_C : ABP_AK74GP25_UGL_Smoke_Blue_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UCompositeCurveTable : UCurveTable {
	TArray<UCurveTable*> ParentTables; // 0xa0
	TArray<UCurveTable*> OldParentTables; // 0xb8
};

struct UCurveLinearColorAtlas : UTexture2D {
	uint32 TextureSize; // 0x100
	uint32 GradientPixelSize; // 0x104
	TArray<UCurveLinearColor*> GradientCurves; // 0x108
};

struct UBP_BasicHeatDamageType_C : USQDamageType {
	bool bCanCauseBleeding; // 0x40
};

struct ABP_40MM_VOG_Smoke_Blue_Proj2_C : ABP_40MM_VOG_Smoke_Proj2_C {
	UParticleSystemComponent* Effect; // 0x548
	UParticleSystem* SmokeEffect; // 0x550
	USoundCue* SmokeSound; // 0x558
};

struct USQInventoryWidget : USQUserWidget {
	TArray<USQInventoryGroupWidget*> GroupsArray; // 0x230
	ASQPlayerController* OwningController; // 0x240
	USQPawnInventoryComponent* RenderedInventory; // 0x248
	float MaxTranslucencyAlpha; // 0x25c
	float ItemSelectedAlpha; // 0x260
	float ItemUnselectedAlpha; // 0x264
	float FadeoutDuration; // 0x268
	float FadeoutDelay; // 0x26c
	USoundCue* ItemScrollSound; // 0x270
};

struct AAbilitySystemDebugHUD : AHUD {
	APlayerController* PlayerOwner; // 0x248
	char bLostFocusPaused : 1; // 0x250
	char bShowHUD : 1; // 0x250
	char bShowDebugInfo : 1; // 0x250
	int CurrentTargetIndex; // 0x254
	char bShowHitBoxDebugInfo : 1; // 0x258
	char bShowOverlays : 1; // 0x258
	char bEnableDebugTextShadow : 1; // 0x258
	TArray<AActor*> PostRenderedActors; // 0x260
	TArray<FName> DebugDisplay; // 0x278
	TArray<FName> ToggledDebugCategories; // 0x288
	UCanvas* Canvas; // 0x298
	UCanvas* DebugCanvas; // 0x2a0
	TArray<FDebugTextInfo> DebugTextList; // 0x2a8
	AActor* ShowDebugTargetDesiredClass; // 0x2b8
	AActor* ShowDebugTargetActor; // 0x2c0
};

struct USQRotorSetup : UDataAsset {
	FName RotorName; // 0x30
	USQRotor* RotorClass; // 0x38
	float Radius; // 0x40
	float Mass; // 0x44
	FVector ThrustAxis; // 0x48
	FVector ThrustVectoring; // 0x54
	float ThrustCoefficient; // 0x60
	FName ThrustSocketName; // 0x64
	float TorqueMultiplier; // 0x6c
	float RotationalTorqueMultiplier; // 0x70
	float ThrustMultiplier; // 0x74
	FName AnimatedSocketName; // 0x78
	float AnimationSpeedMultiplier; // 0x80
	ESQAxis AnimationAxis; // 0x84
	UCurveFloat* StartupAcceleration; // 0x88
	float StartupAccelerationFactor; // 0x90
	UCurveFloat* StoppingDeceleration; // 0x98
	float StoppingDecelerationFactor; // 0xa0
	UCurveFloat* NoInputDeceleration; // 0xa8
	float DecelerationMultiplier; // 0xb0
	UCurveFloat* InputAcceleration; // 0xb8
	float InputFactor; // 0xc0
	float MaxRPM; // 0xc4
	float IdleRPM; // 0xc8
	ESQRotorType RotorType; // 0xcc
};

struct ABP_AK74M_1P63_Tracer_Desert_C : ABP_AK74M_1P63_Tracer_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_AK74MGP25_1P63_UGL_Smoke_Red_C : ABP_AK74MGP25_1P63_UGL_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMaterialExpressionLandscapeLayerBlend : UMaterialExpression {
	TArray<FLayerBlendInput> Layers; // 0x40
	FGuid ExpressionGUID; // 0x50
};

struct USQSquadStateDataMapMarkerObjective : USQSquadStateDataMapMarker {
	UTexture2D* Texture; // 0x180
	FLinearColor Tint; // 0x188
	int FireTeamId; // 0x198
};

struct UGameInstance : UObject {
	TArray<ULocalPlayer*> LocalPlayers; // 0x38
	UOnlineSession* OnlineSession; // 0x48
	TArray<UObject*> ReferencedObjects; // 0x50
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x328
	int TextureCoordinateCount; // 0x340
	int PendingCompactCounter; // 0x48c
	int SubdivisionCount; // 0x490
};

struct UMaterialExpressionLandscapeLayerSample : UMaterialExpression {
	FName ParameterName; // 0x40
	float PreviewWeight; // 0x48
	FGuid ExpressionGUID; // 0x4c
};

struct ABP_RPG7V2_Thermo_Founders_C : ABP_RPG7V2_Thermo_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UParticleSystemComponent* MuzzleFlashRearComponent3P; // 0x7b8
	UChildActorComponent* BackBlastComponent3P; // 0x7c0
	UParticleSystemComponent* MuzzleFlashRearComponent1P; // 0x7c8
	USQBlastComponent* SquadBlast; // 0x7d0
	UChildActorComponent* BackBlastComponent1P; // 0x7d8
	FName BackblastSocket; // 0x7e0
	UParticleSystem* BackblastEffect1P; // 0x7e8
	UParticleSystem* BackblastEffect3P; // 0x7f0
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct ASQDeployable : AActor {
	ESQTeam InitialTeam; // 0x258
	ASQForwardBase* OwningFob; // 0x260
	float HalfBuiltTransitionHealth; // 0x268
	float FullyBuiltTransitionHealth; // 0x26c
	int Team; // 0x270
	bool bIsFob; // 0x274
	bool bPlaced; // 0x275
	UBoxComponent* StackingCollisionBox; // 0x278
	UBoxComponent* PlacementCollisionBox; // 0x280
	bool bUsePlacementCollisionBox; // 0x288
	USQCoreStateComponent* StateObject; // 0x290
	ESQExplosiveType ExplosiveType; // 0x298
	FSQUsableData UsableData; // 0x2a0
	USceneComponent* Completed; // 0x2e0
	USceneComponent* Unbuilt; // 0x2e8
	USceneComponent* HalfBuilt; // 0x2f0
	USphereComponent* SimpleDetectionSphere; // 0x2f8
	FScriptMulticastDelegate OnBuildStateChange; // 0x300
	FScriptMulticastDelegate OnDestroyedEvent; // 0x310
	ESQBuildState BuildState; // 0x320
	TArray<FSQDeployableChangeStateEffect> ChangeStateEffects; // 0x328
	TArray<FSQDeployableStateDamageEffect> DamageStateEffects; // 0x338
	int Cost; // 0x348
	float MaxHealth; // 0x34c
	float InitialHealth; // 0x350
	float Health; // 0x354
	bool bCanUnbuild; // 0x358
	TArray<FSQDamageModifier> AllowableDamageTypes; // 0x360
	ESQDeployableSize Size; // 0x370
	bool bIngoreNoResist; // 0x371
	bool bStartUnbuilt; // 0x372
	bool bTrackInFOB; // 0x373
	bool bTrackInPlayerState; // 0x374
	TArray<EObjectTypeQuery> ObjectTypesToStack; // 0x378
	bool bAllowStacking; // 0x388
	bool bAllowPlacementOnPawns; // 0x389
	bool bAllowPlacementOnSoldiers; // 0x38a
	bool bAllowPlacementOnVehicles; // 0x38b
	bool bAttachToUnderlyingActor; // 0x38c
	bool bDestroyWhenAttachedActorIsDestroyed; // 0x38d
	ESQInvalidPlacementReason bCachedPlacementResult; // 0x38e
	bool bAlignToGround; // 0x38f
	float ValidPitchRange; // 0x390
	float MaxCornerDifference; // 0x394
	bool bRequiresSameTeam; // 0x398
	bool bCantBePlacedInFOB; // 0x399
	FVector GhostOffset; // 0x39c
	ESQBuildState GhostBuildState; // 0x3a8
	UMaterialInterface* GhostMaterial; // 0x3b0
	bool bIsGhost; // 0x3b8
	float GhostRotationSpeed; // 0x3bc
	float GhostRotationDelta; // 0x3c0
	bool bAllowFireWeaponOverrideOnSQPlayerController; // 0x3c4
	bool bAllowAltFireWeaponOverrideOnSQPlayerController; // 0x3c5
	bool bRequiresFOB; // 0x3c6
	bool bDrawDebug; // 0x3c7
	UMaterialInstanceDynamic* DynGhostInstance; // 0x3d0
	USQDeployableSettings* Setting; // 0x3e8
	FDataTableRowHandle CachedInvalidPlacementReason; // 0x3f0
	UDataTable* ErrorTable; // 0x400
	bool WasEverBuilt; // 0x408
};

struct UAbilityTask_ApplyRootMotionMoveToActorForce : UAbilityTask_ApplyRootMotion_Base {
	FScriptMulticastDelegate OnFinished; // 0xb8
	FVector StartLocation; // 0xd0
	FVector TargetLocation; // 0xdc
	AActor* TargetActor; // 0xe8
	FVector TargetLocationOffset; // 0xf0
	ERootMotionMoveToActorTargetOffsetType OffsetAlignment; // 0xfc
	float Duration; // 0x100
	bool bDisableDestinationReachedInterrupt; // 0x104
	bool bSetNewMovementMode; // 0x105
	EMovementMode NewMovementMode; // 0x106
	bool bRestrictSpeedToExpected; // 0x107
	UCurveVector* PathOffsetCurve; // 0x108
	UCurveFloat* TimeMappingCurve; // 0x110
	UCurveFloat* TargetLerpSpeedHorizontalCurve; // 0x118
	UCurveFloat* TargetLerpSpeedVerticalCurve; // 0x120
};

struct UParticleModuleVectorFieldGlobal : UParticleModuleVectorFieldBase {
	char bOverrideGlobalVectorFieldTightness : 1; // 0x30
	float GlobalVectorFieldScale; // 0x34
	float GlobalVectorFieldTightness; // 0x38
};

struct ABP_AK74MGP25_UGL_HE_C : ABP_AK74MGP25_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ASpectatorPawn : ADefaultPawn {
	float BaseTurnRate; // 0x2a8
	float BaseLookUpRate; // 0x2ac
	UPawnMovementComponent* MovementComponent; // 0x2b0
	USphereComponent* CollisionComponent; // 0x2b8
	UStaticMeshComponent* MeshComponent; // 0x2c0
	char bAddDefaultMovementBindings : 1; // 0x2c8
};

struct UBP_Attachment_M4_FrontSight_Founders_C : UBP_Attachment_M4_FrontSight_C {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UDatasmithSpotLightComponentTemplate : UDatasmithObjectTemplate {
	float InnerConeAngle; // 0x30
	float OuterConeAngle; // 0x34
};

struct UMovieSceneLevelVisibilitySection : UMovieSceneSection {
	ELevelVisibility Visibility; // 0xe0
	TArray<FName> LevelNames; // 0xe8
};

struct UNetReplicationGraphConnection : UReplicationConnectionDriver {
	UNetConnection* NetConnection; // 0x28
	AReplicationGraphDebugActor* DebugActor; // 0x170
	TArray<FLastLocationGatherInfo> LastGatherLocations; // 0x190
	TArray<UReplicationGraphNode*> ConnectionGraphNodes; // 0x1a8
	UReplicationGraphNode_TearOff_ForConnection* TearOffNode; // 0x1b8
};

struct USQRestriction_Cost : USQRestriction {
	FName ID; // 0x30
	FDataTableRowHandle Data; // 0x38
	FString ModId; // 0x48
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct USQMapSoldierIconWidget : USQMapPawnIconWidget {
	bool bIsSelfMedic; // 0x268
	bool bIsWithinMedicRange; // 0x269
	float MedicRange; // 0x26c
	bool bIsMedic; // 0x270
	bool bIsAlive; // 0x271
	bool bIsBleeding; // 0x272
	bool bIsInVehicle; // 0x273
};

struct USQKickBanComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xac
	char bNetAddressable : 1; // 0xac
	char bAutoActivate : 1; // 0xad
	char bIsActive : 1; // 0xae
	char bEditableWhenInherited : 1; // 0xae
	char bCanEverAffectNavigation : 1; // 0xae
	char bIsEditorOnly : 1; // 0xae
	EComponentCreationMethod CreationMethod; // 0xb0
	FScriptMulticastDelegate OnComponentActivated; // 0xb1
	FScriptMulticastDelegate OnComponentDeactivated; // 0xb2
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xb8
};

struct UAISense_Damage : UAISense {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x80
};

struct USQMenuItemWidgetStyle : USlateWidgetStyleContainerBase {
	FSQMenuItemStyle MenuItemStyle; // 0x30
};

struct ABP_AK74M_Desert_C : ABP_AK74M_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UAnimationSettings : UDeveloperSettings {
	int CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	UAnimCompress* DefaultCompressionAlgorithm; // 0x50
	AnimationCompressionFormat RotationCompressionFormat; // 0x58
	AnimationCompressionFormat TranslationCompressionFormat; // 0x59
	float MaxCurveError; // 0x5c
	float AlternativeCompressionThreshold; // 0x60
	bool ForceRecompression; // 0x64
	bool bOnlyCheckForMissingSkeletalMeshes; // 0x65
	bool bForceBelowThreshold; // 0x66
	bool bFirstRecompressUsingCurrentOrDefault; // 0x67
	bool bRaiseMaxErrorToExisting; // 0x68
	bool bTryExhaustiveSearch; // 0x69
	bool bEnableSegmenting; // 0x6a
	bool bEnablePerformanceLog; // 0x6b
	bool bStripAnimationDataOnDedicatedServer; // 0x6c
	bool bTickAnimationOnSkeletalMeshInit; // 0x6d
};

struct UParticleModuleColor : UParticleModuleColorBase {
	FRawDistributionVector StartColor; // 0x30
	FRawDistributionFloat StartAlpha; // 0x80
	char bClampAlpha : 1; // 0xb8
};

struct UMaterialExpressionDivide : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct USQSquadStateMapData : USQSquadStateData {
	USQCoreStateMapWidget* MapWidgetClass; // 0x120
	float WorldLocationTolerance; // 0x128
	bool bInterpolateWorldLocation; // 0x12c
	bool bUseWorldRotation; // 0x12d
	float YawTolerance; // 0x130
	bool bInterpolateYaw; // 0x134
	FVector WorldLocation; // 0x138
	float Yaw; // 0x144
	char PackedYaw; // 0x148
	FVector_NetQuantize RepWorldLocation; // 0x154
};

struct UPlayFabGroupsAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x210
	UPlayFabJsonObject* RequestJsonObj; // 0x218
	UPlayFabJsonObject* ResponseJsonObj; // 0x220
};

struct UProceduralFoliageSpawner : UObject {
	int RandomSeed; // 0x28
	float TileSize; // 0x2c
	int NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
	bool bNeedsSimulation; // 0x50
};

struct USQWeaponAttachment_Scope : USQWeaponAttachment {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FScriptMulticastDelegate OnFinish; // 0x68
};

struct UUpdateManager : UObject {
	float HotfixCheckCompleteDelay; // 0x88
	float UpdateCheckCompleteDelay; // 0x8c
	float HotfixAvailabilityCheckCompleteDelay; // 0x90
	float UpdateCheckAvailabilityCompleteDelay; // 0x94
	bool bCheckPlatformOSSForUpdate; // 0x98
	bool bCheckOSSForUpdate; // 0x99
	int AppSuspendedUpdateCheckTimeSeconds; // 0x9c
	bool bPlatformEnvironmentDetected; // 0xa8
	bool bInitialUpdateFinished; // 0xa9
	bool bCheckHotfixAvailabilityOnly; // 0xaa
	EUpdateState CurrentUpdateState; // 0xab
	int WorstNumFilesPendingLoadViewed; // 0xac
	EPatchCheckResult LastPatchCheckResult; // 0xb0
	EHotfixResult LastHotfixResult; // 0xb1
	FDateTime LastUpdateCheck[0x2]; // 0xe0
	EUpdateCompletionStatus LastCompletionResult[0x2]; // 0xf0
	UEnum* UpdateStateEnum; // 0x108
	UEnum* UpdateCompletionEnum; // 0x110
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UAbilityTask_WaitGameplayEffectApplied_Self : UAbilityTask_WaitGameplayEffectApplied {
	FScriptMulticastDelegate OnApplied; // 0x1b8
};

struct ABP_RPG7V2_Frag_Founders_C : ABP_RPG7V2_Parent_Founders_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UParticleSystemComponent* MuzzleFlashRearComponent3P; // 0x7b8
	UChildActorComponent* BackBlastComponent3P; // 0x7c0
	UParticleSystemComponent* MuzzleFlashRearComponent1P; // 0x7c8
	USQBlastComponent* SquadBlast; // 0x7d0
	UChildActorComponent* BackBlastComponent1P; // 0x7d8
	FName BackblastSocket; // 0x7e0
	UParticleSystem* BackblastEffect1P; // 0x7e8
	UParticleSystem* BackblastEffect3P; // 0x7f0
};

struct UInteractiveFoliageComponent : UStaticMeshComponent {
	int ForcedLodModel; // 0x430
	int PreviousLODLevel; // 0x434
	int MinLOD; // 0x438
	int SubDivisionStepSize; // 0x43c
	UStaticMesh* StaticMesh; // 0x440
	FColor WireframeColorOverride; // 0x448
	char bOverrideWireframeColor : 1; // 0x44c
	char bOverrideMinLOD : 1; // 0x44c
	char bOverrideNavigationExport : 1; // 0x44c
	char bForceNavigationObstacle : 1; // 0x44c
	char bDisallowMeshPaintPerInstance : 1; // 0x44c
	char bIgnoreInstanceForTextureStreaming : 1; // 0x44c
	char bOverrideLightMapRes : 1; // 0x44c
	char bCastDistanceFieldIndirectShadow : 1; // 0x44c
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x44d
	char bUseSubDivisions : 1; // 0x44d
	char bUseDefaultCollision : 1; // 0x44d
	char bReverseCulling : 1; // 0x44d
	int OverriddenLightMapRes; // 0x450
	float DistanceFieldIndirectShadowMinVisibility; // 0x454
	float DistanceFieldSelfShadowBias; // 0x458
	float StreamingDistanceMultiplier; // 0x45c
	TArray<FStaticMeshComponentLODInfo> LODData; // 0x460
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x470
	FLightmassPrimitiveSettings LightmassSettings; // 0x480
};

struct ULeaderboardFlushCallbackProxy : UObject {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct ABP_M4M203_M68_UGL_Parent_C : ABP_Weapon2_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ULevelScriptBlueprint : UBlueprint {
	char bRecompileOnLoad : 1; // 0x50
	UObject* ParentClass; // 0x58
	char bHasBeenRegenerated : 1; // 0x60
	char bIsRegeneratingOnLoad : 1; // 0x60
	USimpleConstructionScript* SimpleConstructionScript; // 0x68
	TArray<UActorComponent*> ComponentTemplates; // 0x70
	TArray<UTimelineTemplate*> Timelines; // 0x80
	UInheritableComponentHandler* InheritableComponentHandler; // 0x90
	EBlueprintType BlueprintType; // 0x98
	int BlueprintSystemVersion; // 0x9c
	bool bNativize; // 0xd0
};

struct UMaterialExpressionDesaturation : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Fraction; // 0x54
	FLinearColor LuminanceFactors; // 0x68
};

struct ASQGameSpawn : APlayerStart {
	FScriptMulticastDelegate PreSiegedStateChangedSignal; // 0x280
	FScriptMulticastDelegate OnSiegedStateChangedSignal; // 0x290
	FScriptMulticastDelegate OnActivatedTimeStampChangedSignal; // 0x2a0
	FScriptMulticastDelegate PreSpawningEnabledStateChanged; // 0x2b0
	FScriptMulticastDelegate OnSpawningEnabledStateChanged; // 0x2c0
	float RespawnDelay; // 0x2d0
	float RespawnIncrease; // 0x2d4
	float SecondsOfSpawnProtection; // 0x2d8
	USQMapIconComponent* SpawnIconComponentClass; // 0x2e0
	float MaxTimeIntervalBetweenSpawnPointLocationEvaluations; // 0x2e8
	bool bSpawningEnabled; // 0x2ec
	bool bSieged; // 0x2ed
	float ActivatedTimeStamp; // 0x2f0
	USQCoreStateComponent* StateObject; // 0x2f8
	USQMapIconComponent* MapIcon; // 0x300
	USQMapIconWidget* DefaultMapIconWidget; // 0x308
	float SpawnSearchRadius; // 0x310
	float SpawnSearchHeight; // 0x314
	TArray<FVector> ValidSpawnLocations; // 0x318
	TArray<FVector> ValidOutOfSightSpawnPoints; // 0x328
	bool bHasValidSpawnLocation; // 0x338
	bool bCanEverDoNearbyEnemiesCheck; // 0x348
	bool bCanBeSiegedByVehicles; // 0x349
	float NearbyEnemiesRadius; // 0x34c
	float NearbyEnemiesCheckTickRate; // 0x350
	UCurveFloat* SiegeDistanceThreshold; // 0x358
	UCurveFloat* EnemyDistanceToRespawnDelay; // 0x360
	ESQTeam Team; // 0x3f0
	ESQSpawnPointType SpawnPointType; // 0x3f1
	float WaveIntervalTime; // 0x3f4
	float WaveSpawnStartTime; // 0x410
};

struct UAISenseConfig_Team : UAISenseConfig {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UEndTurnCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UMaterialFunctionMaterialLayer : UMaterialFunction {
	FString Description; // 0x40
	char bExposeToLibrary : 1; // 0x50
	char bPrefixParameterNames : 1; // 0x50
	TArray<UMaterialExpression*> FunctionExpressions; // 0x58
	char bReentrantFlag : 1; // 0x68
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x248
};

struct UEasyAntiCheatNetComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xac
	char bNetAddressable : 1; // 0xac
	char bAutoActivate : 1; // 0xad
	char bIsActive : 1; // 0xae
	char bEditableWhenInherited : 1; // 0xae
	char bCanEverAffectNavigation : 1; // 0xae
	char bIsEditorOnly : 1; // 0xae
	EComponentCreationMethod CreationMethod; // 0xb0
	FScriptMulticastDelegate OnComponentActivated; // 0xb1
	FScriptMulticastDelegate OnComponentDeactivated; // 0xb2
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xb8
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x248
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x250
};

struct UMovieSceneFloatSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe0
};

struct UMovieSceneFadeTrack : UMovieSceneFloatTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct USaveDataUIWrapper_C : USQSaveGameWrapper {
	USaveGame* SaveGameClass; // 0x28
	FString SlotName; // 0x30
	bool bClientOnly; // 0x40
	USaveGame* SaveGame; // 0x48
};

struct UBP_Attachment_SUSAT_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct ABP_RPG7V2_Frag_2Mag_C : ABP_RPG7V2_Parent_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UParticleSystemComponent* MuzzleFlashRearComponent3P; // 0x7b8
	UChildActorComponent* BackBlastComponent3P; // 0x7c0
	UParticleSystemComponent* MuzzleFlashRearComponent1P; // 0x7c8
	USQBlastComponent* SquadBlast; // 0x7d0
	UChildActorComponent* BackBlastComponent1P; // 0x7d8
	FName BackblastSocket; // 0x7e0
	UParticleSystem* BackblastEffect1P; // 0x7e8
	UParticleSystem* BackblastEffect3P; // 0x7f0
};

struct ASQConnectionCheckBeaconHostObj : AOnlineBeaconHostObject {
	FString BeaconTypeName; // 0x248
	AOnlineBeaconClient* ClientBeaconActorClass; // 0x258
	TArray<AOnlineBeaconClient*> ClientActors; // 0x260
};

struct UMaterialExpressionArccosineFast : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct ACableActor : AActor {
	UCableComponent* CableComponent; // 0x248
};

struct UForceFeedbackComponent : USceneComponent {
	UForceFeedbackEffect* ForceFeedbackEffect; // 0x218
	char bAutoDestroy : 1; // 0x220
	char bStopWhenOwnerDestroyed : 1; // 0x220
	char bLooping : 1; // 0x220
	char bIgnoreTimeDilation : 1; // 0x220
	char bOverrideAttenuation : 1; // 0x220
	float IntensityMultiplier; // 0x224
	UForceFeedbackAttenuation* AttenuationSettings; // 0x228
	FForceFeedbackAttenuationSettings AttenuationOverrides; // 0x230
	FScriptMulticastDelegate OnForceFeedbackFinished; // 0x2e0
};

struct UMaterialParameterCollectionInstance : UObject {
	UMaterialParameterCollection* Collection; // 0x30
};

struct USQBuffManager : UActorComponent {
	FSQBuffDesc Buffs[0x4]; // 0xd8
};

struct ASQRandomizer_SceneComponent : ASQRandomizer {
	USceneComponent* Root; // 0x248
	int RandomSeed; // 0x250
};

struct UMaterialExpressionTemporalSobol : UMaterialExpression {
	FExpressionInput Index; // 0x40
	FExpressionInput Seed; // 0x54
	uint32 ConstIndex; // 0x68
	FVector2D ConstSeed; // 0x6c
};

struct ABP_M4A1_M68_Foregrip_Tracer_Woodland_C : ABP_M4A1_M68_Foregrip_Tracer_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UBP_AK74MGP25_UGL_Parent_StaticInfo_C : UBP_AK74GP25_UGL_Parent_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct ABP_AK74_Recruit_C : ABP_AK74_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_AK74GP25_Rifle_Founders_C : ABP_AK74GP25_Rifle_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMaterialExpressionTransformPosition : UMaterialExpression {
	FExpressionInput Input; // 0x40
	EMaterialPositionTransformSource TransformSourceType; // 0x54
	EMaterialPositionTransformSource TransformType; // 0x55
};

struct USQCaptureZoneResourceComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xac
	char bNetAddressable : 1; // 0xac
	char bAutoActivate : 1; // 0xad
	char bIsActive : 1; // 0xae
	char bEditableWhenInherited : 1; // 0xae
	char bCanEverAffectNavigation : 1; // 0xae
	char bIsEditorOnly : 1; // 0xae
	EComponentCreationMethod CreationMethod; // 0xb0
	FScriptMulticastDelegate OnComponentActivated; // 0xb1
	FScriptMulticastDelegate OnComponentDeactivated; // 0xb2
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xb8
};

struct UParticleEmitter : UObject {
	FName EmitterName; // 0x28
	int SubUVDataOffset; // 0x30
	EEmitterRenderMode EmitterRenderMode; // 0x34
	EParticleSignificanceLevel SignificanceLevel; // 0x35
	char bUseLegacySpawningBehavior : 1; // 0x37
	char ConvertedModules : 1; // 0x37
	char bIsSoloing : 1; // 0x37
	char bCookedOut : 1; // 0x37
	char bDisabledLODsKeepEmitterAlive : 1; // 0x37
	char bDisableWhenInsignficant : 1; // 0x38
	TArray<UParticleLODLevel*> LODLevels; // 0x40
	int PeakActiveParticles; // 0x50
	int InitialAllocationCount; // 0x54
	float QualityLevelSpawnRateScale; // 0x58
	uint32 DetailModeBitmask; // 0x5c
	char bOWI_ResetOnDetailModeChanged : 1; // 0x60
};

struct ABP_L85A2_Classic_DarkEarth_SUSAT_C : ABP_L85A2_Classic_SUSAT_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UStaticMeshComponent* Scope; // 0x7b8
};

struct UBP_AK74MGP25_UGL_Optic_HE_StaticInfo_C : UBP_AK74MGP25_UGL_Optic_Parent_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USQRadialIconButton : USQRadialButton {
	FVector2D SmallOuterRimDistOffset; // 0x2f8
	FVector2D MediumOuterRimDistOffset; // 0x300
	FVector2D LargeOuterRimDistOffset; // 0x308
	FVector2D SmallIconDistOffset; // 0x310
	FVector2D MediumIconDistOffset; // 0x318
	FVector2D LargeIconDistOffset; // 0x320
	UImage* InnerHoverImage; // 0x328
	UImage* IconImage; // 0x330
	UImage* OuterRimImage; // 0x338
	UTexture2D* IconImageTexture; // 0x340
	FLinearColor IconImageActiveColor; // 0x348
	FLinearColor IconImageInactiveColor; // 0x358
	FLinearColor IconImageHoveredColor; // 0x368
	FLinearColor IconImagePressedColor; // 0x378
	UTexture2D* InnerHoverSmallImageTexture; // 0x388
	UTexture2D* InnerHoverMediumImageTexture; // 0x390
	UTexture2D* InnerHoverLargeImageTexture; // 0x398
	FLinearColor InnerHoverInactiveColor; // 0x3a0
	FLinearColor InnerHoverHoveredColor; // 0x3b0
	FLinearColor InnerHoverPressedColor; // 0x3c0
	UTexture2D* OuterRimSmallImageTexture; // 0x3d0
	UTexture2D* OuterRimMediumImageTexture; // 0x3d8
	UTexture2D* OuterRimLargeImageTexture; // 0x3e0
	FLinearColor OuterRimActiveColor; // 0x3e8
	FLinearColor OuterRimInactiveColor; // 0x3f8
	float IconSize; // 0x408
};

struct UParticleModuleLight_Seeded : UParticleModuleLight {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x140
};

struct ASQGroundVehicle : ASQVehicle {
	TArray<FSQVehicleEffectsQualitySetting> VehicleEffectsQualitySettings; // 0x820
	TArray<FSQVehicleEffectConfig> VehicleEffectsConfig; // 0x830
	FVector2D WheelFXSound_RPMRate; // 0x840
	FVector2D WheelFXSound_LongSlipRate; // 0x848
	FVector2D WheelFXSound_LatSlipRate; // 0x850
	bool bEjectOpenSeatsOnHardLanding; // 0x858
	bool bDrawDebugTraces; // 0x859
	FTimerHandle HardLandingCheckTimer; // 0x860
	FTimerHandle IsFlyingTimer; // 0x868
	float IsFlyingUpdateInterval; // 0x870
	float IsHardLandingUpdateInterval; // 0x874
	TArray<FName> LandingTraceSockets; // 0x878
	float LandingTraceLenght; // 0x888
	bool bIsFlying; // 0x88c
	float LastFlyingZVelocity; // 0x890
	float EjectZVelocityThreshold; // 0x894
	int EmergencyTeleportCooldownSeconds; // 0x898
	TArray<AActor*> LandingCheckActorsToIgnore; // 0x8a0
	USQVehicleCleanupComponent* VehicleCleanupComponent; // 0x8b0
	bool bShouldSimulate; // 0x8b8
	USoundCue* EngineRPMSound; // 0x8c0
	UAudioComponent* EngineRPMAC; // 0x8c8
	USoundCue* EngineExhaustSound; // 0x8d0
	UAudioComponent* EngineExhaustStartAC; // 0x8d8
	UAudioComponent* EngineExhaustAC; // 0x8e0
	UAudioComponent* EngineExhaustStopAC; // 0x8e8
	USoundCue* EngineStartSound; // 0x8f0
	UAudioComponent* EngineCompletedStartAC; // 0x8f8
	USoundCue* EngineCompletedStartSound; // 0x900
	UAudioComponent* EngineFailedStartAC; // 0x908
	USoundCue* EngineFailedStartSound; // 0x910
	UAudioComponent* EngineStartAC; // 0x918
	USoundCue* EngineStopSound; // 0x920
	UAudioComponent* EngineStopAC; // 0x928
	UAudioComponent* EngineSpeedAC; // 0x930
	UAudioComponent* WheelFXAC; // 0x938
	USoundCue* LandingSound; // 0x940
	float EngineIdleFadeInAfterEngineStartTime; // 0x948
	float EngineIdleFadeOutAfterEngineStopTime; // 0x94c
	float SpringCompressionLandingThreshold; // 0x950
	float SkidThresholdVelocity; // 0x954
	float LongSlipSkidThreshold; // 0x958
	float LateralSlipSkidThreshold; // 0x95c
	UParticleSystemComponent* ExhaustPSC; // 0x960
	bool bTiresTouchingGround; // 0x968
	bool bHandbrakeActive; // 0x969
	bool bIsEngineActive; // 0x96a
	bool bIsEngineToggleActive; // 0x96b
	bool bAllowEngineBoosting; // 0x96c
	float EngineBoostTorqueMultiplier; // 0x970
	bool bHasEngineBoostBeenPressed; // 0x974
	TArray<FSQEngineMovementSoundObject> EngineMovementSounds; // 0x978
	float ActivateEngineDelay; // 0x988
	float DeActivateEngineDelay; // 0x98c
	float GearChangingAlphaLerpSpeed; // 0x9a4
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x9a8
	UBoxComponent* VehicleRagdollOverlap; // 0x9b0
	float RagollOverlapTriggerSpeed; // 0x9b8
	int CollisionKillSpeedKPH; // 0x9bc
	bool bCollisionsKillSoldiers; // 0x9c0
	float WheelInflationRate; // 0x9c4
};

struct UParticleModuleMeshRotationRateOverLife : UParticleModuleRotationRateBase {
	FRawDistributionVector RotRate; // 0x30
	char bScaleRotRate : 1; // 0x80
};

struct UAIPerceptionComponent : UActorComponent {
	TArray<UAISenseConfig*> SensesConfig; // 0xd8
	UAISense* DominantSense; // 0xe8
	AAIController* AIOwner; // 0x100
	FScriptMulticastDelegate OnPerceptionUpdated; // 0x188
	FScriptMulticastDelegate OnTargetPerceptionUpdated; // 0x198
};

struct UBP_MedShockwave_C : USQShockwave {
	ESQShockwaveEffectType ShockwaveEffectType; // 0x28
	float Strength; // 0x2c
	TArray<FSQShockwaveQualitySetting> ShockwaveQualitySettings; // 0x30
	FSQCameraShake CameraShake; // 0x40
	FSQCameraShake SecondaryCameraShake; // 0x60
	int VerticalSteps; // 0x80
	int HorizontalSteps; // 0x84
	FRotator DefaultRotation; // 0x88
	FVector DefaultLocationOffset; // 0x94
	float Range; // 0xa0
	float PitchRange; // 0xa4
	float YawRange; // 0xa8
	float CullingDistance; // 0xac
	float NearbyExplosionEventRadius; // 0xb0
	int MaxSoundsToSpawn; // 0xb4
	int MaxDecalsToSpawn; // 0xb8
	bool bDebugLines; // 0xbc
	bool bDebugSpheres; // 0xbd
	UParticleSystem* Emitter; // 0xc0
	USQPhysicalMaterialEffects* DefaultEffectsClass; // 0xc8
};

struct ABP_M4_M150_Tracer_Founders_C : ABP_M4_M150_Tracer_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UCameraShake : UObject {
	char bSingleInstance : 1; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	FROscillator RotOscillation; // 0x38
	FVOscillator LocOscillation; // 0x5c
	FFOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	UCameraAnim* Anim; // 0xa0
	char bRandomAnimSegment : 1; // 0xa8
	APlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	UCameraAnimInst* AnimInst; // 0x150
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USQVehicleComponent : UStaticMeshComponent {
	float MaxHealth; // 0x498
	TArray<FSQDamageModifier> AllowableDamageTypes; // 0x4a0
	bool bCanBeDestroyed; // 0x4b0
	bool bCanBeRepairedAfterDestroyed; // 0x4b1
	float MaxRepairToolLimit; // 0x4b4
	UStaticMesh* FullyRepairedComponentMesh; // 0x4b8
	UStaticMesh* RepairedFromDestructionComponentMesh; // 0x4c0
	UStaticMesh* DestroyedComponentMesh; // 0x4c8
	ASQVehicle* ParentVehicle; // 0x4d0
	UParticleSystem* BurningEffect; // 0x4d8
	USoundCue* BurningSound; // 0x4e0
	UAudioComponent* BurningAudioComponent; // 0x4e8
	bool bBurningAudioInheritsScale; // 0x4f0
	UParticleSystem* DestroyedExplosion; // 0x4f8
	USoundCue* DestroyedSound; // 0x500
	FName DestructionDamageEffectSocket; // 0x508
	TArray<FSQDamageEffect> DestructionDamageEffects; // 0x510
	bool bLastingEffectInheritsScale; // 0x520
	UAudioComponent* DestroyedAudioComponent; // 0x528
	bool bDestroyedAudioInheritsScale; // 0x530
	UParticleSystemComponent* BurningParticleSystem; // 0x538
	bool bBurningEffectInheritsScale; // 0x540
	UParticleSystemComponent* DestructionParticleSystem; // 0x548
	bool bDestructionEffectInheritsScale; // 0x550
	float NormalizedHealth; // 0x554
	FScriptMulticastDelegate OnComponentDestroyedEvent; // 0x558
	FScriptMulticastDelegate OnComponentUndestroyedEvent; // 0x568
	float Health; // 0x578
	ESQVehicleComponentStates VehicleComponentState; // 0x57c
	UStaticMeshComponent* DecorativeMesh; // 0x580
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xe8
	UNavigationQueryFilter* NavigationFilter; // 0x118
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x120
};

struct UMovieSceneFadeSection : UMovieSceneFloatSection {
	FLinearColor FadeColor; // 0x180
	char bFadeAudio : 1; // 0x190
};

struct UWindDirectionalSourceComponent : USceneComponent {
	float Strength; // 0x218
	float Speed; // 0x21c
	float MinGustAmount; // 0x220
	float MaxGustAmount; // 0x224
	float Radius; // 0x228
	char bPointWind : 1; // 0x22c
};

struct USQFactionSetup : USQPrimaryData {
	FName FactionID; // 0x70
	USQFaction* OuterFaction; // 0x78
	USQRoleSettings* DefaultRole; // 0x80
	USQRoleSettings* DefaultSquadLeaderRole; // 0x88
	USQRoleSettings* LeaveSquadRole; // 0x90
	TArray<USQAvailability_Role*> Roles; // 0x98
	TArray<USQAvailability_Deployable*> Deployables; // 0xa8
	TArray<USQAvailability_Vehicle*> Vehicles; // 0xb8
	TArray<USQAvailability_Action*> Actions; // 0xc8
};

struct ABP_L85A2_DarkEarth_Recruit_C : ABP_L85A2_DarkEarth_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UAssetExportTask : UObject {
	UObject* Object; // 0x28
	UExporter* Exporter; // 0x30
	FString Filename; // 0x38
	bool bSelected; // 0x48
	bool bReplaceIdentical; // 0x49
	bool bPrompt; // 0x4a
	bool bAutomated; // 0x4b
	bool bUseFileArchive; // 0x4c
	bool bWriteEmptyFiles; // 0x4d
	TArray<UObject*> IgnoreObjectList; // 0x50
	UObject* Options; // 0x60
	TArray<FString> Errors; // 0x68
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xd8
};

struct ASQTeamActor : AActor {
	ESQTeam Team; // 0x250
};

struct UButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle ButtonStyle; // 0x30
};

struct ADetourCrowdAIController : AAIController {
	char bStopAILogicOnUnposses : 1; // 0x2f8
	char bLOSflag : 1; // 0x2f8
	char bSkipExtraLOSChecks : 1; // 0x2f8
	char bAllowStrafe : 1; // 0x2f8
	char bWantsPlayerState : 1; // 0x2f8
	char bSetControlRotationFromPawnOrientation : 1; // 0x2f8
	UPathFollowingComponent* PathFollowingComponent; // 0x300
	UBrainComponent* BrainComponent; // 0x308
	UAIPerceptionComponent* PerceptionComponent; // 0x310
	UPawnActionsComponent* ActionsComp; // 0x318
	UBlackboardComponent* Blackboard; // 0x320
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x328
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x330
	FScriptMulticastDelegate ReceiveMoveCompleted; // 0x338
};

struct APrecomputedVisibilityVolume : AVolume {
	EBrushType BrushType; // 0x248
	FColor BrushColor; // 0x24c
	int PolyFlags; // 0x250
	char bColored : 1; // 0x254
	char bSolidWhenSelected : 1; // 0x254
	char bPlaceableFromClassBrowser : 1; // 0x254
	char bNotForClientOrServer : 1; // 0x254
	UModel* Brush; // 0x258
	UBrushComponent* BrushComponent; // 0x260
	char bInManipulation : 1; // 0x268
	TArray<FGeomSelection> SavedSelections; // 0x270
};

struct USQSoundNodeWavePlayer : USoundNode {
	USoundWave* SoundWave; // 0x40
	char bLooping : 1; // 0x48
	char bRandomizeStartTime : 1; // 0x48
	float StartMin; // 0x4c
	float StartMax; // 0x50
};

struct USQAvailability : UObject {
	USQRestriction_Delay_Base* Delay; // 0x28
	USQRestriction_Cost* Cost; // 0x30
	USQRestriction_Count* LimitedCount; // 0x38
	TArray<USQRestriction_Boolean*> OtherRestrictions; // 0x40
};

struct USCS_Node : UObject {
	UObject* ComponentClass; // 0x28
	UActorComponent* ComponentTemplate; // 0x30
	FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x38
	FName AttachToName; // 0x88
	FName ParentComponentOrVariableName; // 0x90
	FName ParentComponentOwnerClassName; // 0x98
	bool bIsParentComponentNative; // 0xa0
	TArray<USCS_Node*> ChildNodes; // 0xa8
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xb8
	FGuid VariableGuid; // 0xc8
	FName InternalVariableName; // 0xd8
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x218
	char bSupportsDepth : 1; // 0x218
	char bNoAlphaChannel : 1; // 0x218
	UTexture* Texture; // 0x220
	UTexture* LeftTexture; // 0x228
	char bQuadPreserveTextureRatio : 1; // 0x230
	FVector2D QuadSize; // 0x234
	FBox2D UVRect; // 0x23c
	float CylinderRadius; // 0x250
	float CylinderOverlayArc; // 0x254
	int CylinderHeight; // 0x258
	EStereoLayerType StereoLayerType; // 0x25c
	EStereoLayerShape StereoLayerShape; // 0x25d
	int Priority; // 0x260
};

struct USQMapGrid : USQUserWidget {
	FLinearColor MajorGridColor; // 0x230
	FLinearColor MinorGridColor; // 0x240
	FLinearColor TinyGridColor; // 0x250
	UCurveFloat* MajorGridOpacityCurve; // 0x260
	UCurveFloat* MinorGridOpacityCurve; // 0x268
	UCurveFloat* TinyGridOpacityCurve; // 0x270
	int MajorGridWidth; // 0x278
	int MinorGridWidth; // 0x27c
	int TinyGridWidth; // 0x280
	FVector2D LegendPercentageLocation; // 0x284
	FVector2D LegendTextOffset; // 0x28c
	float MaxLegendPercentageSize; // 0x294
	FSlateFontInfo LegendScaleFontInfo; // 0x298
	USQMap* OwnerMap; // 0x2e8
	bool bDrawGridMarkers; // 0x2f0
	FVector2D RealMapSize; // 0x2f4
	FVector2D RealToPixel; // 0x2fc
	FVector2D PixelSize; // 0x304
	FVector2D LinesNeeded; // 0x30c
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UParticleModuleLifetimeBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2c
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> Links; // 0x410
};

struct UBP_Attachment_SUSAT_Blur_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct USQReplaySubsystem : UGameInstanceSubsystem {
	FString DatedReplaySubDirectory; // 0x30
	FString NamedReplaySubDirectory; // 0x40
	bool bUseMultithreading; // 0x50
};

struct UOnlineSessionClient : UOnlineSession {
	bool bIsFromInvite; // 0x188
	bool bHandlingDisconnect; // 0x189
};

struct ABP_L85A2_DarkEarth_SUSAT_C : ABP_L85A2_DarkEarth_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UStaticMeshComponent* Scope; // 0x7b8
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct UParticleModuleParameterDynamic : UParticleModuleParameterBase {
	TArray<FEmitterDynamicParameter> DynamicParams; // 0x30
	int UpdateFlags; // 0x40
	char bUsesVelocity : 1; // 0x44
};

struct UConsoleSettings : UObject {
	int MaxScrollbackSize; // 0x28
	TArray<FAutoCompleteCommand> ManualAutoCompleteList; // 0x30
	TArray<FString> AutoCompleteMapPaths; // 0x40
	float BackgroundOpacityPercentage; // 0x50
	bool bOrderTopToBottom; // 0x54
	FColor InputColor; // 0x58
	FColor HistoryColor; // 0x5c
	FColor AutoCompleteCommandColor; // 0x60
	FColor AutoCompleteCVarColor; // 0x64
	FColor AutoCompleteFadedColor; // 0x68
};

struct UPlaneFalloff : UFieldNodeFloat {
	float Magnitude; // 0xd8
	float MinRange; // 0xdc
	float MaxRange; // 0xe0
	float Default; // 0xe4
	float distance; // 0xe8
	FVector Position; // 0xec
	FVector Normal; // 0xf8
	EFieldFalloffType Falloff; // 0x104
};

struct ASQDeployableMortarVehicle : ASQDeployableVehicle {
	float CachedTubePitch; // 0x888
};

struct UAnimCompress_LeastDestructive : UAnimCompress {
	FString Description; // 0x28
	char bNeedsSkeleton : 1; // 0x38
	char bEnableSegmenting : 1; // 0x38
	uint32 IdealNumFramesPerSegment; // 0x3c
	uint32 MaxNumFramesPerSegment; // 0x40
	AnimationCompressionFormat TranslationCompressionFormat; // 0x44
	AnimationCompressionFormat RotationCompressionFormat; // 0x45
	AnimationCompressionFormat ScaleCompressionFormat; // 0x46
	float MaxCurveError; // 0x48
};

struct UMovieSceneStringSection : UMovieSceneSection {
	FMovieSceneStringChannel StringCurve; // 0xe0
};

struct UMasterAudioSubmixCaptureProtocol : UMovieSceneAudioCaptureProtocolBase {
	FString Filename; // 0x58
};

struct ABP_AK74MGP25_Rifle_Desert_C : ABP_AK74MGP25_Rifle_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMovieSceneNameableTrack : UMovieSceneTrack {
	FMovieSceneTrackEvalOptions EvalOptions; // 0x50
};

struct UBP_Attachment_1p63_Blur_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UBP_AK74M_StaticInfo_C : UBP_AK74_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USQDamageType_Explosive : USQDamageType {
	bool bCanCauseBleeding; // 0x40
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x68
};

struct UGeometryCacheTrack : UObject {
	float Duration; // 0x28
};

struct UMaterialInstanceDynamic : UMaterialInstance {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UMaterialInterface* Parent; // 0x90
	char bHasStaticPermutationResource : 1; // 0x9a
	char bOverrideSubsurfaceProfile : 1; // 0x9a
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xa0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xb0
	TArray<FTextureParameterValue> TextureParameterValues; // 0xc0
	TArray<FFontParameterValue> FontParameterValues; // 0xd0
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xe0
	TArray<UObject*> PermutationTextureReferences; // 0xf8
	FStaticParameterSet StaticParameters; // 0x108
};

struct UMovieSceneEnumTrack : UMovieScenePropertyTrack {
	UEnum* Enum; // 0x88
};

struct ABP_M4A1_Woodland_C : ABP_GenericRifle_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UGameplayCueManager : UDataAsset {
	FGameplayCueObjectLibrary RuntimeGameplayCueObjectLibrary; // 0x48
	FGameplayCueObjectLibrary EditorGameplayCueObjectLibrary; // 0x98
	TArray<UObject*> LoadedGameplayCueNotifyClasses; // 0x2b0
	TArray<AGameplayCueNotify_Actor*> GameplayCueClassesForPreallocation; // 0x2c0
	TArray<FGameplayCuePendingExecute> PendingExecuteCues; // 0x2d0
	int GameplayCueSendContextCount; // 0x2e0
	TArray<FPreallocationInfo> PreallocationInfoList_Internal; // 0x2e8
};

struct ASQRepairEquipable : ASQEquipableItem {
	float TraceLengthCentimeters; // 0x480
	ASQVehicle* RepairTarget; // 0x488
	UAudioComponent* AudioComponent; // 0x490
};

struct ULevelSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x348
	FLevelSequenceObjectReferenceMap ObjectReferences; // 0x350
	FLevelSequenceBindingReferences BindingReferences; // 0x3a0
	TMap<FString, FLevelSequenceObject> PossessedObjects; // 0x440
	UObject* DirectorClass; // 0x490
};

struct UBP_MaterialEffects_C : USQPhysicalMaterialEffects {
	TMap<USQPhysicalMaterial*, FSQEffectsSet> Effects; // 0x28
};

struct UMaterialExpressionRuntimeVirtualTextureReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput VirtualTextureOutput; // 0x54
};

struct USQChatWidgetStyle : USlateWidgetStyleContainerBase {
	FSQChatStyle ChatStyle; // 0x30
};

struct USQRestriction_VehicleInRange : USQRestriction_Boolean {
	float Range; // 0x58
	TSet<ESQTeamRelationShip> TargetTeams; // 0x60
	int TargetCount; // 0xb0
};

struct UBTDecorator_SetTagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
};

struct USoundNodeWavePlayer : USoundNodeAssetReferencer {
	USoundWave* SoundWaveAssetPtr; // 0x40
	USoundWave* SoundWave; // 0x68
	char bLooping : 1; // 0x70
};

struct UPropertyValue : UObject {
	TArray<UProperty*> properties; // 0x80
	TArray<int> PropertyIndices; // 0x90
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa0
	FString FullDisplayString; // 0xb0
	FName PropertySetterName; // 0xc0
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xc8
	bool bHasRecordedData; // 0x118
	UObject* LeafPropertyClass; // 0x120
	TArray<char> ValueBytes; // 0x128
	EPropertyValueCategory PropCategory; // 0x138
};

struct UMaterialExpressionAdd : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	float ConstA; // 0x68
	float ConstB; // 0x6c
};

struct UDatasmithActorTemplate : UDatasmithObjectTemplate {
	TSet<FName> Layers; // 0x30
	TSet<FName> Tags; // 0x80
};

struct UParticleModuleLocationPrimitiveSphere_Seeded : UParticleModuleLocationPrimitiveSphere {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xf8
};

struct USQDamageType_HeatExplosive : USQDamageType {
	bool bCanCauseBleeding; // 0x40
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueID; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct USQGameInstanceSubsystems : UGameInstanceSubsystem {
	TArray<FSQGameSubsystemObject> SquadGameSubsystemObjects; // 0x30
	TArray<UObject*> SubsystemInstances; // 0x40
};

struct USSGS_ColorEffectSpecificationRanges : USSGS_ColorEffectSpecification {
	TArray<FSSGS_ColorRange> Ranges; // 0x30
};

struct ABP_M4_M150_C : ABP_M4A1_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ATargetPoint : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x80
	char bNetTemporary : 1; // 0x80
	char bNetStartup : 1; // 0x80
	char bOnlyRelevantToOwner : 1; // 0x80
	char bAlwaysRelevant : 1; // 0x80
	char bReplicateMovement : 1; // 0x80
	char bTearOff : 1; // 0x80
	char bExchangedRoles : 1; // 0x80
	char bNetLoadOnClient : 1; // 0x81
	char bNetUseOwnerRelevancy : 1; // 0x81
	char bRelevantForNetworkReplays : 1; // 0x81
	char bRelevantForLevelBounds : 1; // 0x81
	char bReplayRewindable : 1; // 0x81
	char bAllowTickBeforeBeginPlay : 1; // 0x81
	char bAutoDestroyWhenFinished : 1; // 0x81
	char bBlockInput : 1; // 0x81
	char bCanBeDamaged : 1; // 0x82
	char bCollideWhenPlacing : 1; // 0x82
	char bFindCameraComponentWhenViewTarget : 1; // 0x82
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x82
	char bIgnoresOriginShifting : 1; // 0x82
	char bEnableAutoLODGeneration : 1; // 0x82
	char bIsEditorOnlyActor : 1; // 0x82
	char bActorSeamlessTraveled : 1; // 0x82
	char bReplicates : 1; // 0x83
	char bCanBeInCluster : 1; // 0x83
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x83
	char bActorEnableCollision : 1; // 0x84
	char bActorIsBeingDestroyed : 1; // 0x84
	ENetRole RemoteRole; // 0x85
	FRepMovement ReplicatedMovement; // 0x88
	float InitialLifeSpan; // 0xbc
	float CustomTimeDilation; // 0xc0
	FRepAttachment AttachmentReplication; // 0xc8
	AActor* Owner; // 0x108
	FName NetDriverName; // 0x110
	ENetRole Role; // 0x118
	ENetDormancy NetDormancy; // 0x119
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x11a
	EAutoReceiveInput AutoReceiveInput; // 0x11b
	int InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int NetTag; // 0x12c
	float NetUpdateFrequency; // 0x130
	float MinNetUpdateFrequency; // 0x134
	char bUseRelativeNetUpdateFrequency : 1; // 0x138
	char bUseOwnerRelativeNetUpdateFrequency : 1; // 0x138
	float MinRelativeNetUpdateEvaluationFrequency; // 0x13c
	float NetPriority; // 0x140
	APawn* Instigator; // 0x148
	TArray<AActor*> Children; // 0x150
	USceneComponent* RootComponent; // 0x160
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x168
	TArray<FName> Layers; // 0x180
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x190
	TArray<FName> Tags; // 0x198
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1a8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1a9
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x1aa
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1ab
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1ac
	FScriptMulticastDelegate OnBeginCursorOver; // 0x1ad
	FScriptMulticastDelegate OnEndCursorOver; // 0x1ae
	FScriptMulticastDelegate OnClicked; // 0x1af
	FScriptMulticastDelegate OnReleased; // 0x1b0
	FScriptMulticastDelegate OnInputTouchBegin; // 0x1b1
	FScriptMulticastDelegate OnInputTouchEnd; // 0x1b2
	FScriptMulticastDelegate OnInputTouchEnter; // 0x1b3
	FScriptMulticastDelegate OnInputTouchLeave; // 0x1b4
	FScriptMulticastDelegate OnActorHit; // 0x1b5
	FScriptMulticastDelegate OnDestroyed; // 0x1b6
	FScriptMulticastDelegate OnEndPlay; // 0x1b7
	TArray<UActorComponent*> InstanceComponents; // 0x218
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x228
};

struct ASQMortarProjectile : ASQProjectile {
	UParticleSystem* SmokeParticleEffect; // 0x4a0
	USoundCue* SmokeSoundCue; // 0x4a8
	FLinearColor SmokeColor; // 0x4b0
	float NearGroundTriggerDistance; // 0x4c0
	float MinFlightTime; // 0x4c4
	bool bWatchFlightTime; // 0x4c8
	bool bShouldDestroyByLifespan; // 0x4c9
	UObject* LastingEffectClass; // 0x4d0
	FName SocketName; // 0x4d8
	float ImpactDamageToApply; // 0x4e0
};

struct ABP_AK74MGP25_UGL_Smoke_Red_C : ABP_AK74MGP25_UGL_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UParticleSystem : UFXSystemAsset {
	EParticleSystemUpdateMode SystemUpdateMode; // 0x28
	float UpdateTime_FPS; // 0x2c
	float UpdateTime_Delta; // 0x30
	float WarmupTime; // 0x34
	float WarmupTickRate; // 0x38
	TArray<UParticleEmitter*> Emitters; // 0x40
	UParticleSystemComponent* PreviewComponent; // 0x50
	UInterpCurveEdSetup* CurveEdSetup; // 0x58
	char bOrientZAxisTowardCamera : 1; // 0x60
	float LODDistanceCheckTime; // 0x64
	ParticleSystemLODMethod LODMethod; // 0x68
	TArray<float> LODDistances; // 0x70
	char bRegenerateLODDuplicate : 1; // 0x80
	TArray<FParticleSystemLOD> LODSettings; // 0x88
	char bUseFixedRelativeBoundingBox : 1; // 0x98
	FBox FixedRelativeBoundingBox; // 0x9c
	float SecondsBeforeInactive; // 0xb8
	char bShouldResetPeakCounts : 1; // 0xbc
	char bHasPhysics : 1; // 0xbc
	char bUseRealtimeThumbnail : 1; // 0xbc
	char ThumbnailImageOutOfDate : 1; // 0xbc
	float Delay; // 0xc0
	float DelayLow; // 0xc4
	char bUseDelayRange : 1; // 0xc8
	char bAllowManagedTicking : 1; // 0xc8
	bool bAutoDeactivate; // 0xcc
	uint32 MinTimeBetweenTicks; // 0xd0
	TArray<uint32> LODBasedMinTimeBetweenTicks; // 0xd8
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xe8
	float InsignificanceDelay; // 0xec
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xf0
	uint32 MaxPoolSize; // 0xf4
	FVector MacroUVPosition; // 0xf8
	float MacroUVRadius; // 0x104
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0x108
	FBox CustomOcclusionBounds; // 0x10c
	TArray<FLODSoloTrack> SoloTracking; // 0x128
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0x138
};

struct AInstancedFoliageActor : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x80
	char bNetTemporary : 1; // 0x80
	char bNetStartup : 1; // 0x80
	char bOnlyRelevantToOwner : 1; // 0x80
	char bAlwaysRelevant : 1; // 0x80
	char bReplicateMovement : 1; // 0x80
	char bTearOff : 1; // 0x80
	char bExchangedRoles : 1; // 0x80
	char bNetLoadOnClient : 1; // 0x81
	char bNetUseOwnerRelevancy : 1; // 0x81
	char bRelevantForNetworkReplays : 1; // 0x81
	char bRelevantForLevelBounds : 1; // 0x81
	char bReplayRewindable : 1; // 0x81
	char bAllowTickBeforeBeginPlay : 1; // 0x81
	char bAutoDestroyWhenFinished : 1; // 0x81
	char bBlockInput : 1; // 0x81
	char bCanBeDamaged : 1; // 0x82
	char bCollideWhenPlacing : 1; // 0x82
	char bFindCameraComponentWhenViewTarget : 1; // 0x82
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x82
	char bIgnoresOriginShifting : 1; // 0x82
	char bEnableAutoLODGeneration : 1; // 0x82
	char bIsEditorOnlyActor : 1; // 0x82
	char bActorSeamlessTraveled : 1; // 0x82
	char bReplicates : 1; // 0x83
	char bCanBeInCluster : 1; // 0x83
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x83
	char bActorEnableCollision : 1; // 0x84
	char bActorIsBeingDestroyed : 1; // 0x84
	ENetRole RemoteRole; // 0x85
	FRepMovement ReplicatedMovement; // 0x88
	float InitialLifeSpan; // 0xbc
	float CustomTimeDilation; // 0xc0
	FRepAttachment AttachmentReplication; // 0xc8
	AActor* Owner; // 0x108
	FName NetDriverName; // 0x110
	ENetRole Role; // 0x118
	ENetDormancy NetDormancy; // 0x119
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x11a
	EAutoReceiveInput AutoReceiveInput; // 0x11b
	int InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int NetTag; // 0x12c
	float NetUpdateFrequency; // 0x130
	float MinNetUpdateFrequency; // 0x134
	char bUseRelativeNetUpdateFrequency : 1; // 0x138
	char bUseOwnerRelativeNetUpdateFrequency : 1; // 0x138
	float MinRelativeNetUpdateEvaluationFrequency; // 0x13c
	float NetPriority; // 0x140
	APawn* Instigator; // 0x148
	TArray<AActor*> Children; // 0x150
	USceneComponent* RootComponent; // 0x160
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x168
	TArray<FName> Layers; // 0x180
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x190
	TArray<FName> Tags; // 0x198
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1a8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1a9
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x1aa
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1ab
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1ac
	FScriptMulticastDelegate OnBeginCursorOver; // 0x1ad
	FScriptMulticastDelegate OnEndCursorOver; // 0x1ae
	FScriptMulticastDelegate OnClicked; // 0x1af
	FScriptMulticastDelegate OnReleased; // 0x1b0
	FScriptMulticastDelegate OnInputTouchBegin; // 0x1b1
	FScriptMulticastDelegate OnInputTouchEnd; // 0x1b2
	FScriptMulticastDelegate OnInputTouchEnter; // 0x1b3
	FScriptMulticastDelegate OnInputTouchLeave; // 0x1b4
	FScriptMulticastDelegate OnActorHit; // 0x1b5
	FScriptMulticastDelegate OnDestroyed; // 0x1b6
	FScriptMulticastDelegate OnEndPlay; // 0x1b7
	TArray<UActorComponent*> InstanceComponents; // 0x218
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x228
};

struct UProceduralMeshComponent : UMeshComponent {
	bool bUseComplexAsSimpleCollision; // 0x438
	bool bUseAsyncCooking; // 0x439
	UBodySetup* ProcMeshBodySetup; // 0x440
	TArray<FProcMeshSection> ProcMeshSections; // 0x448
	TArray<FKConvexElem> CollisionConvexElems; // 0x458
	FBoxSphereBounds LocalBounds; // 0x468
	TArray<UBodySetup*> AsyncBodySetupQueue; // 0x488
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xc0
	FRawDistributionFloat StartRadius; // 0xc8
	FRawDistributionFloat StartHeight; // 0x100
	CylinderHeightAxis HeightAxis; // 0x138
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct ABP_M4M203_M68_UGL_Woodland_Smoke_C : ABP_M4M203_M68_UGL_Woodland_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ASQAudioVolume : AAudioVolume {
	ESQAudioVolumeType SquadAudioVolumeType; // 0x2d8
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int VolumeSizeX; // 0x54
	int VolumeSizeY; // 0x58
	int VolumeSizeZ; // 0x5c
	int SubImagesX; // 0x60
	int SubImagesY; // 0x64
	int FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UParticleModuleSpawnBase : UParticleModule {
	char bProcessSpawnRate : 1; // 0x30
	char bProcessBurstList : 1; // 0x30
};

struct URequestPermissionsAsync : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFailure; // 0x40
};

struct UBP_Attachment_M4M203_LadderSight_Woodland_C : UBP_Attachment_M4M203_LadderSight_C {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct USQLocalAudioPlayer : USQLocalAudioEffectHandler {
	UAudioComponent* PlayingAudioComponent; // 0x28
};

struct ADatasmithAreaLightActor : AActor {
	EDatasmithAreaLightActorType LightType; // 0x248
	EDatasmithAreaLightActorShape LightShape; // 0x249
	FVector2D Dimensions; // 0x24c
	float Intensity; // 0x254
	ELightUnits IntensityUnits; // 0x258
	FLinearColor Color; // 0x25c
	float Temperature; // 0x26c
	UTextureLightProfile* IESTexture; // 0x270
	bool bUseIESBrightness; // 0x278
	float IESBrightnessScale; // 0x27c
	FRotator Rotation; // 0x280
	float SourceRadius; // 0x28c
	float SourceLength; // 0x290
	float AttenuationRadius; // 0x294
	float SpotlightInnerAngle; // 0x298
	float SpotlightOuterAngle; // 0x29c
};

struct UBP_Fragmentation_DamageType_C : USQDamageType {
	bool bCanCauseBleeding; // 0x40
};

struct UMaterialExpressionArcsine : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UBTTask_WaitBlackboardTime : UBTTask_Wait {
	FBlackboardKeySelector BlackboardKey; // 0x78
};

struct UAsyncTask_LoadXRDeviceVisComponent : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnModelLoaded; // 0x30
	FScriptMulticastDelegate OnLoadFailure; // 0x40
	UPrimitiveComponent* SpawnedComponent; // 0x58
};

struct ABP_Projectile_9mm_C : ASQProjectile {
	UStaticMesh* TracerMesh; // 0x490
	UMaterial* TracerMaterial; // 0x498
};

struct UBP_SQAvailability_Vehicle_C : USQAvailability_Vehicle {
	USQVehicleSettings* Setting; // 0x50
};

struct USQCheatManager : UCheatManager {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct ABP_L85A2_4Mags_C : ABP_L85A2_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQShockwaveDirected : USQShockwave {
	bool bFractionalOffsettingForHorizontalSteps; // 0xd0
};

struct USQReplayObject : UObject {
	FScriptMulticastDelegate RequestFullReload; // 0x28
	FScriptMulticastDelegate RequestWidgetReload; // 0x38
	FString ReplayPath; // 0x48
	FString ReplayName; // 0x58
	bool bIsNamedReplay; // 0x68
	FDateTime DateCreated; // 0x70
	int64 SizeInBytes; // 0x78
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct UMaterialExpressionCameraVectorWS : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct USQDeployableChildActorComponent : UChildActorComponent {
	ESQBuildState SpawnBuildState; // 0x249
	ESQBuildState DespawnBuildState; // 0x24a
	bool bShouldUseSpawningTeam; // 0x24b
	char TimesSpawnable; // 0x24c
};

struct UComboBox : UWidget {
	TArray<UObject*> Items; // 0x108
	DelegateProperty OnGenerateWidgetEvent; // 0x118
	bool bIsFocusable; // 0x128
};

struct ASQObjectiveRuleset : ASQGameModeRuleset {
	int NumberOfObjectives; // 0x2a8
	int MaxNumberOfObjectivesShownAtSameTime; // 0x2ac
	int TicketsGainedUponMeetingObjective; // 0x2b0
	int TicketsLostUponLosingObjective; // 0x2b4
	ASQMapMarker* KnownAttackObjectiveMarkerClass; // 0x2b8
	ASQMapMarker* KnownDefendObjectiveMarkerClass; // 0x2c0
	ASQMapMarker* UnknownDefendObjectiveMarkerClass; // 0x2c8
	ASQMapMarker* SatisfiedObjectiveMarkerClass; // 0x2d0
	float MinObjectiveDistance; // 0x2d8
	bool bOnlyCheckMinDistanceAgainstActiveObjectives; // 0x2dc
	bool bRandomlyPickObjectiveIfAllFailDistanceCheck; // 0x2dd
	TArray<ASQMapMarker*> Markers; // 0x2e0
	TArray<FTransform> AllAvailableObjectiveLocations; // 0x2f0
	TArray<FTransform> FilteredObjectiveLocations; // 0x300
	TArray<ASQObjective*> Objectives; // 0x310
	ASQObjective* ObjectiveType; // 0x320
	float TimeSinceLastObjectiveSpawn; // 0x328
	bool bOverrideObjectiveSpawning; // 0x32c
	bool bGenerateMarkersForTeamOneUponObjectiveSpawn; // 0x32d
	bool bGenerateMarkersForTeamTwoUponObjectiveSpawn; // 0x32e
	ESQTeam WinningTeamUponAllObjectivesCompleted; // 0x32f
	ESQTeam WinningTeamUponTimerExpired; // 0x330
	ESQTeam WinningTeamIfTeamOneHasNoTickets; // 0x331
	ESQTeam WinningTeamIfTeamTwoHasNoTickets; // 0x332
};

struct ABP_SVD_Optic_C : ABP_GenericRifle_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UStaticMeshComponent* SVDFront; // 0x7b8
	UStaticMeshComponent* PSOScope; // 0x7c0
	bool HasBUIS; // 0x7c8
};

struct ADebugCameraHUD : AHUD {
	APlayerController* PlayerOwner; // 0x248
	char bLostFocusPaused : 1; // 0x250
	char bShowHUD : 1; // 0x250
	char bShowDebugInfo : 1; // 0x250
	int CurrentTargetIndex; // 0x254
	char bShowHitBoxDebugInfo : 1; // 0x258
	char bShowOverlays : 1; // 0x258
	char bEnableDebugTextShadow : 1; // 0x258
	TArray<AActor*> PostRenderedActors; // 0x260
	TArray<FName> DebugDisplay; // 0x278
	TArray<FName> ToggledDebugCategories; // 0x288
	UCanvas* Canvas; // 0x298
	UCanvas* DebugCanvas; // 0x2a0
	TArray<FDebugTextInfo> DebugTextList; // 0x2a8
	AActor* ShowDebugTargetDesiredClass; // 0x2b8
	AActor* ShowDebugTargetActor; // 0x2c0
};

struct UHorizontalBox : UPanelWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UBP_AK74_StaticInfo_C : UBP_GenericWeapon_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UMaterialExpressionDecalDerivative : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct USplineComponent : UPrimitiveComponent {
	FSplineCurves SplineCurves; // 0x408
	FInterpCurveVector SplineInfo; // 0x470
	FInterpCurveQuat SplineRotInfo; // 0x488
	FInterpCurveVector SplineScaleInfo; // 0x4a0
	FInterpCurveFloat SplineReparamTable; // 0x4b8
	bool bAllowSplineEditingPerInstance; // 0x4d0
	int ReparamStepsPerSegment; // 0x4d4
	float Duration; // 0x4d8
	bool bStationaryEndpoints; // 0x4dc
	bool bSplineHasBeenEdited; // 0x4dd
	bool bModifiedByConstructionScript; // 0x4de
	bool bInputSplinePointsToConstructionScript; // 0x4df
	bool bDrawDebug; // 0x4e0
	bool bClosedLoop; // 0x4e1
	bool bLoopPositionOverride; // 0x4e2
	float LoopPosition; // 0x4e4
	FVector DefaultUpVector; // 0x4e8
};

struct UEditableGeometryCollectionAdapter : UEditableMeshAdapter {
	UGeometryCollection* GeometryCollection; // 0x28
	UGeometryCollection* OriginalGeometryCollection; // 0x30
	int GeometryCollectionLODIndex; // 0x38
};

struct ASQVehicleTurretOpenTop : ASQVehicleTurret {
	USQRotatingMovementComponent* YawMovementComponent; // 0x3c8
	USQRotatingMovementComponent* PitchMovementComponent; // 0x3d0
};

struct UProjectile_SuppressionInfo_C : USQSuppressionInfo {
	float SuppressSwayFactorRelease; // 0x28
	float AddSuppressSway; // 0x2c
	float MinSuppressSwayFactor; // 0x30
	float MaxSuppressSwayFactor; // 0x34
	float LofSuppressRange; // 0x38
	float LofSuppressInterpSpeed; // 0x3c
	float LofSuppressAlphaFactor; // 0x40
	float LofSuppressRotationAlphaRelease; // 0x44
};

struct ABP_Projectile_Green_C : ABP_Projectile_C {
	UParticleSystemComponent* ParticleSystem; // 0x4a0
};

struct USpotLightComponent : UPointLightComponent {
	float InnerConeAngle; // 0x388
	float OuterConeAngle; // 0x38c
	float LightShaftConeAngle; // 0x390
};

struct UInterpTrackFloatBase : UInterpTrack {
	FInterpCurveFloat FloatTrack; // 0x70
	float CurveTension; // 0x88
};

struct UBP_M4_M68_StaticInfo_C : UBP_M4_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USoundNode : UObject {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x68
	FName TrackName; // 0x78
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct ABP_AK74MGP25_1P78_UGL_Desert_Smoke_Blue_C : ABP_AK74MGP25_1P78_UGL_Desert_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQRotorComponent : USQVehicleEngineComponent {
	FScriptMulticastDelegate OnEngineActiveEvent; // 0x590
	USoundCue* EngineStartSound; // 0x5a0
	USoundCue* EngineCompletedStartSound; // 0x5a8
	USoundCue* EngineFailedStartSound; // 0x5b0
	USoundCue* EngineStopSound; // 0x5b8
	USoundCue* EngineRPMSound; // 0x5c0
	USoundCue* EngineExhaustSound; // 0x5c8
	USoundCue* LandingSound; // 0x5d0
	float EngineIdleFadeInAfterEngineStartTime; // 0x5d8
	float EngineIdleFadeOutAfterEngineStopTime; // 0x5dc
	float GearChangingAlphaLerpSpeed; // 0x5e0
	TArray<FSQEngineMovementSoundObject> EngineMovementSounds; // 0x5e8
	UAudioComponent* EngineExhaustStartAC; // 0x5f8
	UAudioComponent* EngineRPMAC; // 0x600
	UAudioComponent* EngineExhaustAC; // 0x608
	UAudioComponent* EngineExhaustStopAC; // 0x610
	UAudioComponent* EngineStartAC; // 0x618
	UAudioComponent* EngineCompletedStartAC; // 0x620
	UAudioComponent* EngineFailedStartAC; // 0x628
	UAudioComponent* EngineStopAC; // 0x630
	UAudioComponent* EngineSpeedAC; // 0x638
	UParticleSystemComponent* ExhaustPSC; // 0x640
	UCameraShake* EngineVibrationCameraShake; // 0x648
	UCurveFloat* RPMToShakeScaleCurve; // 0x650
	bool bIsEngineActive; // 0x658
	bool bIsEngineToggleActive; // 0x659
	float ActivateEngineDelay; // 0x65c
	float DeActivateEngineDelay; // 0x660
	UCameraShake* VibrationCameraShake; // 0x670
	APlayerCameraManager* VibrationCameraManager; // 0x678
};

struct UBP_AK74GP25_Rifle_StaticInfo_C : UBP_AK74_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UInitHighlights : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFailure; // 0x40
};

struct AOnlineBeaconClient : AOnlineBeacon {
	AOnlineBeaconHostObject* BeaconOwner; // 0x278
	UNetConnection* BeaconConnection; // 0x280
	EBeaconConnectionState ConnectionState; // 0x288
};

struct USQLockButtonWidget : USQUserWidget {
	FLinearColor ColorAndOpacity; // 0x110
	DelegateProperty ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	DelegateProperty ForegroundColorDelegate; // 0x158
	FMargin Padding; // 0x168
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x178
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x188
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x198
	UWidgetTree* WidgetTree; // 0x1a8
	int Priority; // 0x1b0
	char bSupportsKeyboardFocus : 1; // 0x1b4
	char bIsFocusable : 1; // 0x1b4
	char bStopAction : 1; // 0x1b4
	char bHasScriptImplementedTick : 1; // 0x1b4
	char bHasScriptImplementedPaint : 1; // 0x1b4
	char bCookedWidgetTree : 1; // 0x1b4
	EWidgetTickFrequency TickFrequency; // 0x1c0
	UInputComponent* InputComponent; // 0x1c8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x1d0
};

struct UHighlightsSummaryAsync : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFailure; // 0x40
};

struct ADatasmithImportedSequencesActor : AActor {
	TArray<ULevelSequence*> ImportedSequences; // 0x248
};

struct USQMapWidgetSpawnPoint : USQMapWidget {
	bool bSpawnOnSingleClick; // 0x2a8
	bool bSpawnOnDoubleClick; // 0x2a9
	char bIsSelected : 1; // 0x2ac
	char bSieged : 1; // 0x2ac
	char bSpawningEnabled : 1; // 0x2ac
	float ActivatedTimeStamp; // 0x2b0
	ESQSpawnPointType SpawnPointType; // 0x2b4
	ASQGameSpawn* OwningGameSpawn; // 0x2b8
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct AController : AActor {
	APlayerState* PlayerState; // 0x250
	FScriptMulticastDelegate OnInstigatedAnyDamage; // 0x260
	FName StateName; // 0x270
	APawn* Pawn; // 0x278
	ACharacter* Character; // 0x288
	USceneComponent* TransformComponent; // 0x290
	FRotator ControlRotation; // 0x2b0
	char bAttachToPawn : 1; // 0x2bc
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x2e8
	USkeleton* TargetSkeleton; // 0x2f8
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x300
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x310
	TArray<FName> SyncGroupNames; // 0x3a0
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x3b0
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x80
	char bAbsolute : 1; // 0xd0
	char bKillInside : 1; // 0xd0
	char bAxisAlignedAndFixedSize : 1; // 0xd0
};

struct ABP_M4M203_M68_UGL_Smoke_Blue_Founders_C : ABP_M4M203_M68_UGL_Smoke_Founders_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UAtmosphericFogComponent : USceneComponent {
	float SunMultiplier; // 0x218
	float FogMultiplier; // 0x21c
	float DensityMultiplier; // 0x220
	float DensityOffset; // 0x224
	float DistanceScale; // 0x228
	float AltitudeScale; // 0x22c
	float DistanceOffset; // 0x230
	float GroundOffset; // 0x234
	float StartDistance; // 0x238
	float SunDiscScale; // 0x23c
	float DefaultBrightness; // 0x240
	FColor DefaultLightColor; // 0x244
	char bDisableSunDisk : 1; // 0x248
	char bAtmosphereAffectsSunIlluminance : 1; // 0x248
	char bDisableGroundScattering : 1; // 0x248
	FAtmospherePrecomputeParameters PrecomputeParams; // 0x24c
	UTexture2D* TransmittanceTexture; // 0x278
	UTexture2D* IrradianceTexture; // 0x280
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb0
	FAIDataProviderIntValue NumberOfPoints; // 0xe0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x110
	FEnvDirection ArcDirection; // 0x118
	FAIDataProviderFloatValue ArcAngle; // 0x138
	float AngleRadians; // 0x168
	UEnvQueryContext* CircleCenter; // 0x170
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x178
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x180
	FEnvTraceData TraceData; // 0x1b0
	char bDefineArc : 1; // 0x1e0
};

struct UGameplayTask_TimeLimitedExecution : UGameplayTask {
	FScriptMulticastDelegate OnFinished; // 0x68
	FScriptMulticastDelegate OnTimeExpired; // 0x78
};

struct ULevelSequenceBurnIn : UUserWidget {
	FLevelSequencePlayerSnapshot FrameInformation; // 0x230
	ALevelSequenceActor* LevelSequenceActor; // 0x2e8
};

struct AReflectionCapture : AActor {
	UReflectionCaptureComponent* CaptureComponent; // 0x248
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x2d8
	FVehicleDifferential4WData DifferentialSetup; // 0x378
	float AckermannAccuracy; // 0x394
	FVehicleTransmissionData TransmissionSetup; // 0x398
	FRuntimeFloatCurve SteeringCurve; // 0x3d8
};

struct UUniformGridSlot : UPanelSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int Row; // 0x3c
	int Column; // 0x40
};

struct UBP_M4_StaticInfo_C : UBP_GenericWeapon_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UBP_MortarShockwave_C : USQShockwave {
	ESQShockwaveEffectType ShockwaveEffectType; // 0x28
	float Strength; // 0x2c
	TArray<FSQShockwaveQualitySetting> ShockwaveQualitySettings; // 0x30
	FSQCameraShake CameraShake; // 0x40
	FSQCameraShake SecondaryCameraShake; // 0x60
	int VerticalSteps; // 0x80
	int HorizontalSteps; // 0x84
	FRotator DefaultRotation; // 0x88
	FVector DefaultLocationOffset; // 0x94
	float Range; // 0xa0
	float PitchRange; // 0xa4
	float YawRange; // 0xa8
	float CullingDistance; // 0xac
	float NearbyExplosionEventRadius; // 0xb0
	int MaxSoundsToSpawn; // 0xb4
	int MaxDecalsToSpawn; // 0xb8
	bool bDebugLines; // 0xbc
	bool bDebugSpheres; // 0xbd
	UParticleSystem* Emitter; // 0xc0
	USQPhysicalMaterialEffects* DefaultEffectsClass; // 0xc8
};

struct UMouseCursorBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct USQSquadStateDataVehicle : USQSquadStateDataVehicleSeat {
	USQVehicleUIStaticDataAsset* StaticUIData; // 0x1a8
	char bHoldsOccupant : 1; // 0x1b0
	char bHoldsSquadLeader : 1; // 0x1b0
	int ClaimingSquadID; // 0x1b4
	FVehicleOccupantsArray VehicleOccupants; // 0x1b8
};

struct UBTTask_RotateToFaceBBEntry : UBTTask_BlackboardBase {
	float Precision; // 0x98
};

struct USQScoreboardTeam : USQUserWidget {
	USQScoreboardTeamScore* ScoreboardTeamScore; // 0x230
	UHorizontalBox* EndOfRoundHorizontalBox; // 0x238
	UVerticalBox* TopVerticalBox; // 0x240
	USpacer* NotEndOfRoundSpacer; // 0x248
	USpacer* EnemyTeamPingAligner; // 0x250
	UHorizontalBox* TeamHorizontalBox; // 0x258
	UGridPanel* SquadsGrid; // 0x260
	UCanvasPanel* NonSquadPlayersCanvasPanel; // 0x268
	UGridPanel* PlayersGrid; // 0x270
	UBorder* ColoredHeaderTabImage; // 0x278
	UImage* RemainingTicketsImage; // 0x280
	UImage* ColoredHeaderBarImage; // 0x288
	UImage* FlagImage; // 0x290
	UTextBlock* PlayerNumberText; // 0x298
	UTextBlock* RemainingTicketsText; // 0x2a0
	UTextBlock* TeamNameText; // 0x2a8
	ASQPlayerController* SQPC; // 0x2b0
	ASQPlayerState* SQPlayerState; // 0x2b8
	ASQTeamState* SQTeamState; // 0x2c0
	ASQGameState* SQGameState; // 0x2c8
	USQScoreboardPlayer* OwnerPlayerWidget; // 0x2d0
	USQScoreboardSquad* OwnerPlayerSquadWidget; // 0x2d8
	int TeamKills; // 0x2e0
	int TeamDeaths; // 0x2e4
	int TeamIncaps; // 0x2e8
	int TeamWounds; // 0x2ec
	int TeamRevives; // 0x2f0
	int TeamHeals; // 0x2f4
	int TeamTeamKills; // 0x2f8
	int TeamTeamwork; // 0x2fc
	int TeamObjective; // 0x300
	int TeamScore; // 0x304
	FLinearColor FriendlyTeamColor; // 0x308
	FLinearColor EnemyTeamColor; // 0x318
	bool bIsFriendlyScoreboard; // 0x328
	bool bShowAllStats; // 0x329
	float EndOfRoundEnemyWidth; // 0x32c
	float DuringRoundEnemyWidth; // 0x330
	FText RemainingTicketsTextString; // 0x338
	FText PlayersText; // 0x350
	TArray<FSquadWidgetPair> DisplayedSquads; // 0x368
	TArray<FPlayerWidgetPair> DisplayedPlayers; // 0x378
	TArray<FSQRemoteTalkerDisplayInfo> FormerTalkers; // 0x388
	USQScoreboardSquad* ScoreboardSquadType; // 0x398
	USQScoreboardPlayer* ScoreboardPlayerType; // 0x3a0
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x340
	char bDelayedStart : 1; // 0x348
	int NumSpectators; // 0x34c
	int NumPlayers; // 0x350
	int NumBots; // 0x354
	float MinRespawnDelay; // 0x358
	int NumTravellingPlayers; // 0x35c
	ULocalMessage* EngineMessageClass; // 0x368
	TArray<APlayerState*> InactivePlayerArray; // 0x370
	float InactivePlayerStateLifeSpan; // 0x380
	int MaxInactivePlayers; // 0x384
	bool bHandleDedicatedServerReplays; // 0x388
};

struct URouteSelectorPredicate2 : URouteSelectorPredicate {
	int NumLinksToChoose; // 0x28
};

struct UPathFollowingComponent : UActorComponent {
	UNavMovementComponent* MovementComp; // 0x110
	ANavigationData* MyNavData; // 0x120
};

struct URadialFalloff : UFieldNodeFloat {
	float Magnitude; // 0xd8
	float MinRange; // 0xdc
	float MaxRange; // 0xe0
	float Default; // 0xe4
	float Radius; // 0xe8
	FVector Position; // 0xec
	EFieldFalloffType Falloff; // 0xf8
};

struct UMultiPackerDataBase : UObject {
	UScriptStruct* RowStruct; // 0x28
	int VTile; // 0x30
	int HTile; // 0x34
	bool Do_SDF; // 0x38
	bool BinPack; // 0x39
	bool Alpha; // 0x3a
	EChannelTextureSave ChannelMethod; // 0x3b
	TArray<UTexture2D*> TextureOutput; // 0x40
	UMaterialParameterCollection* MaterialCollection; // 0x50
	TMap<FName, FTileDatabase> TileMap; // 0x58
	int TileSize; // 0xa8
	FLinearColor layer_bools; // 0xac
	FLinearColor Tiles_Size; // 0xbc
};

struct UMaterialExpressionTextureSampleParameterCube : UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0xe0
	FGuid ExpressionGUID; // 0xe8
	FName Group; // 0xf8
};

struct ABP_L85A2_DarkEarth_Foregrip_Tracer_C : ABP_L85A2_DarkEarth_Foregrip_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UPropertyValueColor : UPropertyValue {
	TArray<UProperty*> properties; // 0x80
	TArray<int> PropertyIndices; // 0x90
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa0
	FString FullDisplayString; // 0xb0
	FName PropertySetterName; // 0xc0
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xc8
	bool bHasRecordedData; // 0x118
	UObject* LeafPropertyClass; // 0x120
	TArray<char> ValueBytes; // 0x128
	EPropertyValueCategory PropCategory; // 0x138
};

struct ABP_AK74MGP25_1P78_UGL_Smoke_Red_C : ABP_AK74MGP25_1P78_UGL_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQMapWidgetBase : UUserWidget {
	UPanelWidget* MapBody; // 0x230
};

struct UMaterialExpressionDecalLifetimeOpacity : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UBP_Attachment_LeupoldScope_Black_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct ABP_L85A2_Classic_C : ABP_L85A2_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UNavigationQueryFilter : UObject {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UOnlineEngineInterfaceImpl : UOnlineEngineInterface {
	FName VoiceSubsystemNameOverride; // 0x28
};

struct UNavModifierComponent : UNavRelevantComponent {
	UNavArea* AreaClass; // 0x108
	FVector FailsafeExtent; // 0x110
	char bIncludeAgentHeight : 1; // 0x11c
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x40
	float PitchMax; // 0x44
	float VolumeMin; // 0x48
	float VolumeMax; // 0x4c
};

struct UParticleSystemComponent : UFXSystemComponent {
	UParticleSystem* Template; // 0x408
	TArray<UMaterialInterface*> EmitterMaterials; // 0x410
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x420
	char bResetOnDetach : 1; // 0x431
	char bUpdateOnDedicatedServer : 1; // 0x431
	char bAllowRecycling : 1; // 0x431
	char bAutoManageAttachment : 1; // 0x431
	char bWarmingUp : 1; // 0x432
	char bOverrideLODMethod : 1; // 0x432
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x432
	ParticleSystemLODMethod LODMethod; // 0x43d
	EParticleSignificanceLevel RequiredSignificance; // 0x43e
	TArray<FParticleSysParam> InstanceParameters; // 0x440
	FScriptMulticastDelegate OnParticleSpawn; // 0x450
	FScriptMulticastDelegate OnParticleBurst; // 0x460
	FScriptMulticastDelegate OnParticleDeath; // 0x470
	FScriptMulticastDelegate OnParticleCollide; // 0x480
	FVector OldPosition; // 0x490
	FVector PartSysVelocity; // 0x49c
	float WarmupTime; // 0x4a8
	float WarmupTickRate; // 0x4ac
	float SecondsBeforeInactive; // 0x4b4
	float MaxTimeBeforeForceUpdateTransform; // 0x4bc
	TArray<UParticleSystemReplay*> ReplayClips; // 0x4e0
	float CustomTimeDilation; // 0x4f8
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x550
	FName AutoAttachSocketName; // 0x558
	EAttachmentRule AutoAttachLocationRule; // 0x560
	EAttachmentRule AutoAttachRotationRule; // 0x561
	EAttachmentRule AutoAttachScaleRule; // 0x562
	FScriptMulticastDelegate OnSystemFinished; // 0x590
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct UBlackboardKeyType_Class : UBlackboardKeyType {
	UObject* BaseClass; // 0x30
};

struct UGameplayEffectCalculation : UObject {
	TArray<FGameplayEffectAttributeCaptureDefinition> RelevantAttributesToCapture; // 0x28
};

struct USQCommanderInputComponent : UActorComponent {
	FScriptMulticastDelegate OnCommanderRevivedEvent; // 0xd8
};

struct USQGameUserSettings : UGameUserSettings {
	FString PlayerNamePrefix; // 0x130
	float NameTagOpacity; // 0x140
	float NameTagScale; // 0x144
	bool bShowNameTagText; // 0x148
	bool bShowNameTagKit; // 0x149
	bool bClientAutoRecord; // 0x14a
	int NumberAutoRecordedGames; // 0x14c
	int DistanceFieldShadows; // 0x150
	bool bInvertedYAxis; // 0x154
	bool bEnableMouseSmoothing; // 0x155
	bool bKeyboardHighlight; // 0x156
	FText ControlsPresetName; // 0x158
	bool bUseMenuToolTips; // 0x170
	bool bUseRadialMenuToolTips; // 0x171
	bool bUseInGameHelp; // 0x172
	int TextureStreamPoolSizeStorage; // 0x174
	float FOV; // 0x178
	float GlobalSensitivity; // 0x17c
	float DoubleKeyPressTime; // 0x180
	ESQToggleType CrouchMode; // 0x188
	ESQToggleType ADSMode; // 0x189
	ESQToggleType LeanMode; // 0x18a
	ESQToggleType FreelookMode; // 0x18b
	ESQToggleType SprintMode; // 0x18c
	float FreelookSensitivitySliderValue; // 0x190
	float FreelookSensitivity; // 0x194
	bool bHelicopterInvertMousePitch; // 0x198
	float HelicopterPitchSensitivitySliderValue; // 0x19c
	float HelicopterPitchSensitivity; // 0x1a0
	float HelicopterRollSensitivitySliderValue; // 0x1a4
	bool bUncapTexturePoolSize; // 0x1a8
	float HelicopterRollSensitivity; // 0x1ac
	bool bUseSensivityScaling; // 0x1b0
	float GlobalSensitivitySliderValue; // 0x1b4
	float SoldierSensitivitySliderValue; // 0x1b8
	float SoldierSensitivity; // 0x1bc
	TMap<float, float> SoldierZoomSensitivitiesSliderValues; // 0x1c0
	TMap<float, float> SoldierZoomSensitivities; // 0x210
	float VehicleSensitivitySliderValue; // 0x260
	float VehicleSensitivity; // 0x264
	float PostFX_BrightnessSliderValue; // 0x268
	float PostFX_Brightness; // 0x26c
	float PostFX_SharpnessSliderValue; // 0x270
	float PostFX_Sharpness; // 0x274
	float PostFX_ContrastSliderValue; // 0x278
	float PostFX_Contrast; // 0x27c
	float PostFX_SaturationSliderValue; // 0x280
	float PostFX_Saturation; // 0x284
	int ContactShadows; // 0x288
	int DisableAAValue; // 0x28c
	int DisableAA; // 0x290
	int TAASampleStorageValue; // 0x294
	int TAASampleStorage; // 0x298
	TMap<float, float> VehicleZoomSensitivitiesSliderValues; // 0x2a0
	TMap<float, float> VehicleZoomSensitivities; // 0x2f0
	bool bFreelookRecentersWeapon; // 0x340
	bool bJumpCausesUnCrouch; // 0x341
	bool bJumpCausesUnProne; // 0x342
	bool bIsDoubleTapWalkingEnabled; // 0x343
	bool bShowDiffVerServers; // 0x344
	bool bShowEmptyServers; // 0x345
	bool bShowQueuesSeparately; // 0x346
	bool bShowReservedSlots; // 0x347
	float MenuFrameRateLimit; // 0x348
	int ToneMapperQualityStorage; // 0x34c
	bool ToneMapperQualityToggle; // 0x350
	int BloomQualityStorage; // 0x354
	bool BloomQualityToggle; // 0x358
	int AmbientOcclusionLevelsStorage; // 0x35c
	bool AmbientOcclusionLevelsToggle; // 0x360
	int ShadowFilterMethod; // 0x364
	int GraphicsQuality; // 0x368
	float ScreenSharpening; // 0x36c
	int ScreenPercentage; // 0x370
	float MotionBlurAmount; // 0x374
	int FogValue; // 0x378
	int AtmosphereValue; // 0x37c
	int LensFlareQuality; // 0x380
	int AutoExposure; // 0x384
	int AntiAliasingMode; // 0x388
	int MaterialQuality; // 0x38c
	int DetailMode; // 0x390
	int Upsampling; // 0x394
	int TemporalAASamples; // 0x398
	float TemporalAACurrentFrameWeight; // 0x39c
	int MaxCSMResolution; // 0x3a0
	int MaxAnisotropy; // 0x3a4
	float MasterVolume; // 0x3a8
	float EffectsVolume; // 0x3ac
	float UIVolume; // 0x3b0
	float MusicVolume; // 0x3b4
	float SquadVoiceVolume; // 0x3b8
	float VoiceSide; // 0x3bc
	bool bApplyVoiceRadioFilter; // 0x3c0
	bool bApplyBiasWhileNonLeader; // 0x3c1
	bool bPlaySquadVOIPSounds; // 0x3c3
	bool bPlayCommandVOIPSounds; // 0x3c4
	float LocalVoIPVolume; // 0x3c8
	float CommandVoIPVolume; // 0x3cc
	float CommandVoIPSide; // 0x3d0
	float LeaderVoipDucking; // 0x3d4
	TMap<ESQJoyStickControls, FSQJoyStickConfig> JoyStickConfigurations; // 0x3d8
	bool bAlwaysFreeLook; // 0x428
	float UnfocusedVolumeMultiplier; // 0x42c
	float MaxImpactEffectDecalLifeSpan; // 0x430
	TArray<FSQOnlineInventorySetting> InventorySettings; // 0x438
	int TextureStreaming; // 0x448
	FScriptMulticastDelegate OnGameUserSettingsChanged; // 0x450
	int StreamerModeMask; // 0x460
	bool bIsLanMatch; // 0x464
	uint32 SquadIncrementalVersion; // 0x468
	uint32 SquadSettingsVersion; // 0x46c
};

struct UMovieSceneSpawnSection : UMovieSceneBoolSection {
	bool DefaultValue; // 0xe0
	FMovieSceneBoolChannel BoolCurve; // 0xe8
};

struct USceneCaptureComponent : USceneComponent {
	ESceneCapturePrimitiveRenderMode PrimitiveRenderMode; // 0x218
	ESceneCaptureSource CaptureSource; // 0x219
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenComponents; // 0x220
	TArray<AActor*> HiddenActors; // 0x230
	TArray<TWeakObjectPtr<UPrimitiveComponent>> ShowOnlyComponents; // 0x240
	TArray<AActor*> ShowOnlyActors; // 0x250
	bool bCaptureEveryFrame; // 0x260
	bool bCaptureOnMovement; // 0x261
	bool bAlwaysPersistRenderingState; // 0x262
	float LODDistanceFactor; // 0x264
	float MaxViewDistanceOverride; // 0x268
	int CaptureSortPriority; // 0x26c
	TArray<FEngineShowFlagsSetting> ShowFlagSettings; // 0x270
	FString ProfilingEventName; // 0x290
};

struct UParticleModuleRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionFloat LifeMultiplier; // 0x30
};

struct UParticleModuleSize_Seeded : UParticleModuleSize {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x248
};

struct ULevelVariantSets : UObject {
	UObject* DirectorClass; // 0x28
	TArray<UVariantSet*> VariantSets; // 0x30
};

struct ABP_AK74M_4Mags_Desert_C : ABP_AK74M_4Mags_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UGameplayModMagnitudeCalculation : UGameplayEffectCalculation {
	bool bAllowNonNetAuthorityDependencyRegistration; // 0x38
};

struct USQEmplacementUIStaticDataAsset : USQVehicleUIStaticDataAsset {
	UTexture2D* MapIcon; // 0x30
	float MapIconRotation; // 0x38
	UTexture2D* SideImage; // 0x40
	UTexture2D* FrontImage; // 0x48
};

struct UMaterialExpressionAtmosphericLightColor : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UParticleModuleOrientationBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2c
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1c0
	AVolume* VolumeClass; // 0x1c8
	char bDoComplexVolumeTest : 1; // 0x1d0
};

struct ASQTournamentModeRuleset : ASQGameRuleSet {
	TArray<FSQSettingsRestriction> Restrictions; // 0x270
};

struct UMovieSceneMarginTrack : UMovieScenePropertyTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct USQPhysicalMaterial : UPhysicalMaterial {
	bool bConsiderForPenetration; // 0x80
	bool bAllowPenetration; // 0x81
	float DamageAbsorbed; // 0x84
	float ArmorDamageMultiplier; // 0x88
	bool bDamageParentActor; // 0x8c
	float WheelDampingRateMultiplier; // 0x90
	int ArmorThicknessMillimeters; // 0x94
};

struct USocialPrivateMessageChannel : USocialChatChannel {
	USocialUser* TargetUser; // 0xe8
};

struct USQTrackedVehicleMovementComponent : UWheeledVehicleMovementComponentTank {
	FVehicleTankEngineData EngineSetup; // 0x2d8
	FVehicleTankTransmissionData TransmissionSetup; // 0x378
	float RawBothTracksThrottleInput; // 0x3b8
	float RawLeftTrackThrottleInput; // 0x3bc
	float RawRightTrackThrottleInput; // 0x3c0
	float BothTracksThrottleInput; // 0x3c4
	float LeftTrackThrottleInput; // 0x3c8
	float RightTrackThrottleInput; // 0x3cc
	TArray<float> WheelSpeeds; // 0x3d0
	TArray<float> WheelAngles; // 0x3e0
	float LeftTrackSpeed; // 0x3f0
	float RightTrackSpeed; // 0x3f4
};

struct UTileView : UListView {
	float EntryHeight; // 0x358
	float EntryWidth; // 0x35c
	EListItemAlignment TileAlignment; // 0x360
	bool bWrapHorizontalNavigation; // 0x361
};

struct UBTDecorator_Loop : UBTDecorator {
	int NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UTextRenderComponent : UPrimitiveComponent {
	FText Text; // 0x408
	UMaterialInterface* TextMaterial; // 0x420
	UFont* Font; // 0x428
	EHorizTextAligment HorizontalAlignment; // 0x430
	EVerticalTextAligment VerticalAlignment; // 0x431
	FColor TextRenderColor; // 0x434
	float XScale; // 0x438
	float YScale; // 0x43c
	float WorldSize; // 0x440
	float InvDefaultSize; // 0x444
	float HorizSpacingAdjust; // 0x448
	float VertSpacingAdjust; // 0x44c
	char bAlwaysRenderAsText : 1; // 0x450
};

struct USQCreateSquadButton : USQBaseButton {
	bool bUsesCustomName; // 0x2e8
	ASQPlayerState* OwnerPlayerState; // 0x2f0
	ASQPlayerController* OwnerPlayerController; // 0x2f8
	UEditableTextBox* SquadNameTextBox; // 0x300
	FScriptMulticastDelegate OnNewSquadCreated; // 0x308
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int LightMapCoordinateIndex; // 0x80
	int LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UWidgetBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	FString EnumName; // 0x30
	UEnum* EnumType; // 0x40
};

struct USQVehicleBurningComponent : USceneComponent {
	FName ParticleAttachBone; // 0x218
	ASQLastingEffect* TemperatureLastingEffect; // 0x220
	bool bIsDebugging; // 0x22a
	float VehicleBurnRatePct; // 0x22c
	float VehicleFlippedBurnRatePct; // 0x230
	float VehicleAbandonedBurnRatePct; // 0x234
	float SoldierBurnRatePct; // 0x238
	float StartBurnHealthPercent; // 0x23c
	FTimerHandle EffectTimerHandle; // 0x240
	FTimerHandle BurnTimerHandle; // 0x248
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct ABP_M4M203_M150_UGL_Smoke_C : ABP_M4M203_M150_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x70
};

struct UMaterialExpressionFunctionInput : UMaterialExpression {
	FExpressionInput Preview; // 0x40
	FName InputName; // 0x54
	FString Description; // 0x60
	FGuid ID; // 0x70
	EFunctionInputType InputType; // 0x80
	FVector4 PreviewValue; // 0x90
	char bUsePreviewValueAsDefault : 1; // 0xa0
	int SortPriority; // 0xa4
	char bCompilingFunctionPreview : 1; // 0xa8
};

struct UHighlightsConfigureAsync : UBlueprintAsyncActionBase {
	FScriptMulticastDelegate OnSuccess; // 0x30
	FScriptMulticastDelegate OnFailure; // 0x40
};

struct ABP_M9_C : ABP_GenericPistol_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQGameCommandComponent : UActorComponent {
	FActorComponentTickFunction PrimaryComponentTick; // 0x30
	TArray<FName> ComponentTags; // 0x88
	TArray<UAssetUserData*> AssetUserData; // 0x98
	char bReplicates : 1; // 0xac
	char bNetAddressable : 1; // 0xac
	char bAutoActivate : 1; // 0xad
	char bIsActive : 1; // 0xae
	char bEditableWhenInherited : 1; // 0xae
	char bCanEverAffectNavigation : 1; // 0xae
	char bIsEditorOnly : 1; // 0xae
	EComponentCreationMethod CreationMethod; // 0xb0
	FScriptMulticastDelegate OnComponentActivated; // 0xb1
	FScriptMulticastDelegate OnComponentDeactivated; // 0xb2
	TArray<FSimpleMemberReference> UCSModifiedProperties; // 0xb8
};

struct ABP_AK74MGP25_1P63_UGL_Parent_C : ABP_AK74GP25_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ALightmassImportanceVolume : AVolume {
	EBrushType BrushType; // 0x248
	FColor BrushColor; // 0x24c
	int PolyFlags; // 0x250
	char bColored : 1; // 0x254
	char bSolidWhenSelected : 1; // 0x254
	char bPlaceableFromClassBrowser : 1; // 0x254
	char bNotForClientOrServer : 1; // 0x254
	UModel* Brush; // 0x258
	UBrushComponent* BrushComponent; // 0x260
	char bInManipulation : 1; // 0x268
	TArray<FGeomSelection> SavedSelections; // 0x270
};

struct AProceduralFoliageVolume : AVolume {
	UProceduralFoliageComponent* ProceduralComponent; // 0x280
};

struct UAnimClassData : UObject {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x30
	USkeleton* TargetSkeleton; // 0x40
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x48
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x58
	TArray<FAnimBlueprintFunction> AnimBlueprintFunctions; // 0xa8
	TArray<UStructProperty*> AnimNodeProperties; // 0xb8
	TArray<UStructProperty*> SubInstanceNodeProperties; // 0xc8
	TArray<UStructProperty*> LayerNodeProperties; // 0xd8
	TArray<FName> SyncGroupNames; // 0xe8
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0xf8
};

struct USkyLightComponent : ULightComponentBase {
	ESkyLightSourceType SourceType; // 0x248
	UTextureCube* Cubemap; // 0x250
	float SourceCubemapAngle; // 0x258
	int CubemapResolution; // 0x25c
	float SkyDistanceThreshold; // 0x260
	bool bCaptureEmissiveOnly; // 0x264
	bool bLowerHemisphereIsBlack; // 0x265
	FLinearColor LowerHemisphereColor; // 0x268
	float OcclusionMaxDistance; // 0x278
	float Contrast; // 0x27c
	float OcclusionExponent; // 0x280
	float MinOcclusion; // 0x284
	FColor OcclusionTint; // 0x288
	EOcclusionCombineMode OcclusionCombineMode; // 0x28c
	UTextureCube* BlendDestinationCubemap; // 0x338
};

struct UMaterialExpressionTangentOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UBrushBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct UBTDecorator_BlueprintBase : UBTDecorator {
	AAIController* AIOwner; // 0x68
	AActor* ActorOwner; // 0x70
	TArray<FName> ObservedKeyNames; // 0x78
	char bShowPropertyDetails : 1; // 0x98
	char bCheckConditionOnlyBlackBoardChanges : 1; // 0x98
	char bIsObservingBB : 1; // 0x98
};

struct UFireShake_Small_C : UCameraShake {
	char bSingleInstance : 1; // 0x28
	float OscillationDuration; // 0x2c
	float OscillationBlendInTime; // 0x30
	float OscillationBlendOutTime; // 0x34
	FROscillator RotOscillation; // 0x38
	FVOscillator LocOscillation; // 0x5c
	FFOscillator FOVOscillation; // 0x80
	float AnimPlayRate; // 0x8c
	float AnimScale; // 0x90
	float AnimBlendInTime; // 0x94
	float AnimBlendOutTime; // 0x98
	float RandomAnimSegmentDuration; // 0x9c
	UCameraAnim* Anim; // 0xa0
	char bRandomAnimSegment : 1; // 0xa8
	APlayerCameraManager* CameraOwner; // 0xc0
	float ShakeScale; // 0x148
	float OscillatorTimeRemaining; // 0x14c
	UCameraAnimInst* AnimInst; // 0x150
};

struct ABP_L85A2AG36_ACOG_UGL_HE_C : ABP_L85A2AG36_ACOG_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ABP_AK74MGP25_Rifle_1P63_C : ABP_AK74MGP25_Rifle_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UAITask_MoveTo : UAITask {
	FScriptMulticastDelegate OnRequestFailed; // 0x70
	FScriptMulticastDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct USQMagazineGroupWidget : USQUserWidget {
	TArray<USQMagazineWidget*> MagazineWidgets; // 0x230
};

struct UMovieSceneSection : UMovieSceneSignedObject {
	FMovieSceneSectionEvalOptions EvalOptions; // 0x50
	FMovieSceneEasingSettings Easing; // 0x58
	FMovieSceneFrameRange SectionRange; // 0x90
	FFrameNumber PreRollFrames; // 0xa0
	FFrameNumber PostRollFrames; // 0xa4
	int RowIndex; // 0xa8
	int OverlapPriority; // 0xac
	char bIsActive : 1; // 0xb0
	char bIsLocked : 1; // 0xb0
	float StartTime; // 0xb4
	float EndTime; // 0xb8
	float PrerollTime; // 0xbc
	float PostrollTime; // 0xc0
	char bIsInfinite : 1; // 0xc4
	bool bSupportsInfiniteRange; // 0xc8
	FOptionalMovieSceneBlendType BlendType; // 0xc9
};

struct UMaterialExpressionShadingModel : UMaterialExpression {
	EMaterialShadingModel ShadingModel; // 0x40
};

struct UMovieScene3DAttachTrack : UMovieScene3DConstraintTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x58
};

struct UProceduralFoliageComponent : UActorComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xd8
	float TileOverlap; // 0xe0
	AVolume* SpawningVolume; // 0xe8
	FGuid ProceduralGuid; // 0xf0
};

struct ULandscapeSettings : UDeveloperSettings {
	int MaxNumberOfLayers; // 0x38
};

struct UGameplayTask_ClaimResource : UGameplayTask {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UMaterialExpressionComment : UMaterialExpression {
	int SizeX; // 0x40
	int SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int FontSize; // 0x68
};

struct UPanelSlot : UVisual {
	UPanelWidget* Parent; // 0x28
	UWidget* Content; // 0x30
};

struct ABP_AK74MGP25_UGL_Smoke_C : ABP_AK74MGP25_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQCountParameter : USQCountParameterBase {
	bool UseCurve; // 0x60
	UCurveFloat* Curve; // 0x68
	float ValueToReach; // 0x70
	int FixedAvailability; // 0x74
};

struct UStreamingSettings : UDeveloperSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UParticleModuleCollisionBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2c
};

struct UBP_Attachment_1p29_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct ULightmappedSurfaceCollection : UObject {
	UModel* SourceModel; // 0x28
	TArray<int> Surfaces; // 0x30
};

struct UM4_Skeleton_AnimBlueprint_C : USQWeaponAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	FAnimNode_Root AnimGraphNode_Root_4136E2114573D91EF6AD3BA1AB5C101C; // 0x2b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_04976B224AB9E867E56882809065D5A8; // 0x2e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_A308368548A80EEC8E7AF5B49CA45883; // 0x3a8
	FAnimNode_Slot AnimGraphNode_Slot_93DA30564D7FC3A0A729498FA0227F0D; // 0x420
	FAnimNode_Slot AnimGraphNode_Slot_5D7FE9164BED39B4B000E8B4CDA1A1BF; // 0x468
	FAnimNode_Slot AnimGraphNode_Slot_4F714EED40D6EF2E742D3893876618FE; // 0x4b0
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_CE504B634E54B3B14B5F30969F1111F7; // 0x4f8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2DA60691488E6DF154FD3788C73994E6; // 0x510
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_75FF0A0F40C67CA270DF58A10E5B3869; // 0x5d0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F037B8134954E52D7FE1E9B7E033561F; // 0x6d8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7703DDA140F04C06466B7B84DB44EEEF; // 0x6f8
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_E075DB674D7B6B554DC33D8651A68456; // 0x740
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D610FA8D4282C3DB890A77AE3050B487; // 0xb80
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_B99C6768407C6F7B2170B39FC1BB764E; // 0xba0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_60FD65CC40A067B70770749F56CD7860; // 0xc60
};

struct USQSquadStateDataRepairStation : USQSquadStateDataDeployable {
	ESQBuildState BuildState; // 0x180
};

struct UPhysicalMaterial : UObject {
	float Friction; // 0x28
	EFrictionCombineMode FrictionCombineMode; // 0x2c
	bool bOverrideFrictionCombineMode; // 0x2d
	float Restitution; // 0x30
	EFrictionCombineMode RestitutionCombineMode; // 0x34
	bool bOverrideRestitutionCombineMode; // 0x35
	float Density; // 0x38
	float RaiseMassToPower; // 0x3c
	float DestructibleDamageThresholdScale; // 0x40
	UPhysicalMaterialPropertyBase* PhysicalMaterialProperty; // 0x48
	EPhysicalSurface SurfaceType; // 0x50
	float TireFrictionScale; // 0x54
	TArray<FTireFrictionScalePair> TireFrictionScales; // 0x58
};

struct USQ_MouseCursor_C : UUserWidget {
	FLinearColor ColorAndOpacity; // 0x110
	DelegateProperty ColorAndOpacityDelegate; // 0x120
	FSlateColor ForegroundColor; // 0x130
	DelegateProperty ForegroundColorDelegate; // 0x158
	FMargin Padding; // 0x168
	TArray<UUMGSequencePlayer*> ActiveSequencePlayers; // 0x178
	TArray<UUMGSequencePlayer*> StoppedSequencePlayers; // 0x188
	TArray<FNamedSlotBinding> NamedSlotBindings; // 0x198
	UWidgetTree* WidgetTree; // 0x1a8
	int Priority; // 0x1b0
	char bSupportsKeyboardFocus : 1; // 0x1b4
	char bIsFocusable : 1; // 0x1b4
	char bStopAction : 1; // 0x1b4
	char bHasScriptImplementedTick : 1; // 0x1b4
	char bHasScriptImplementedPaint : 1; // 0x1b4
	char bCookedWidgetTree : 1; // 0x1b4
	EWidgetTickFrequency TickFrequency; // 0x1c0
	UInputComponent* InputComponent; // 0x1c8
	TArray<FAnimationEventBinding> AnimationCallbacks; // 0x1d0
};

struct UBP_L85A2_SUSAT_Foregrip_StaticInfo_C : UBP_L85A2_Foregrip_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UMaterialExpressionVertexNormalWS : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct ASQDemoSpectator : APlayerController {
	UPlayer* Player; // 0x2c0
	APawn* AcknowledgedPawn; // 0x2c8
	UInterpTrackInstDirector* ControllingDirTrackInst; // 0x2d0
	AHUD* MyHUD; // 0x2d8
	APlayerCameraManager* PlayerCameraManager; // 0x2e0
	APlayerCameraManager* PlayerCameraManagerClass; // 0x2e8
	bool bAutoManageActiveCameraTarget; // 0x2f0
	FRotator TargetViewRotation; // 0x2f4
	float SmoothTargetViewRotationSpeed; // 0x30c
	TArray<AActor*> HiddenActors; // 0x318
	TArray<TWeakObjectPtr<UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x328
	float LastSpectatorStateSynchTime; // 0x33c
	FVector LastSpectatorSyncLocation; // 0x340
	FRotator LastSpectatorSyncRotation; // 0x34c
	int ClientCap; // 0x358
	UCheatManager* CheatManager; // 0x360
	UCheatManager* CheatClass; // 0x368
	UPlayerInput* PlayerInput; // 0x370
	TArray<FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x378
	char bPlayerIsWaiting : 1; // 0x3f8
	char NetPlayerIndex; // 0x3fc
	UNetConnection* PendingSwapConnection; // 0x438
	UNetConnection* NetConnection; // 0x440
	float InputYawScale; // 0x454
	float InputPitchScale; // 0x458
	float InputRollScale; // 0x45c
	char bShowMouseCursor : 1; // 0x460
	char bEnableClickEvents : 1; // 0x460
	char bEnableTouchEvents : 1; // 0x460
	char bEnableMouseOverEvents : 1; // 0x460
	char bEnableTouchOverEvents : 1; // 0x460
	char bForceFeedbackEnabled : 1; // 0x460
	float ForceFeedbackScale; // 0x464
	TArray<FKey> ClickEventKeys; // 0x468
	EMouseCursor DefaultMouseCursor; // 0x478
	EMouseCursor CurrentMouseCursor; // 0x479
	ECollisionChannel DefaultClickTraceChannel; // 0x47a
	ECollisionChannel CurrentClickTraceChannel; // 0x47b
	float HitResultTraceDistance; // 0x47c
	uint16 SeamlessTravelCount; // 0x480
	uint16 LastCompletedSeamlessTravelCount; // 0x482
	UInputComponent* InactiveStateInputComponent; // 0x4f8
	char bShouldPerformFullTickWhenPaused : 1; // 0x500
	UTouchInterface* CurrentTouchInterface; // 0x518
	ASpectatorPawn* SpectatorPawn; // 0x570
	bool bIsLocalPlayerController; // 0x57c
	FVector SpawnLocation; // 0x580
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x248
	FName MatineeControllerName; // 0x250
	float PlayRate; // 0x258
	char bPlayOnLevelLoad : 1; // 0x25c
	char bForceStartPos : 1; // 0x25c
	float ForceStartPosition; // 0x260
	char bLooping : 1; // 0x264
	char bRewindOnPlay : 1; // 0x264
	char bNoResetOnRewind : 1; // 0x264
	char bRewindIfAlreadyPlaying : 1; // 0x264
	char bDisableRadioFilter : 1; // 0x264
	char bClientSideOnly : 1; // 0x264
	char bSkipUpdateIfNotVisible : 1; // 0x264
	char bIsSkippable : 1; // 0x264
	int PreferredSplitScreenNum; // 0x268
	char bDisableMovementInput : 1; // 0x26c
	char bDisableLookAtInput : 1; // 0x26c
	char bHidePlayer : 1; // 0x26c
	char bHideHud : 1; // 0x26c
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x270
	char bShouldShowGore : 1; // 0x280
	TArray<UInterpGroupInst*> GroupInst; // 0x288
	TArray<FCameraCutInfo> CameraCuts; // 0x298
	char bIsPlaying : 1; // 0x2a8
	char bReversePlayback : 1; // 0x2a8
	char bPaused : 1; // 0x2a8
	char bPendingStop : 1; // 0x2a8
	float InterpPosition; // 0x2ac
	char ReplicationForceIsPlaying; // 0x2b4
	FScriptMulticastDelegate OnPlay; // 0x2b8
	FScriptMulticastDelegate OnStop; // 0x2c8
	FScriptMulticastDelegate OnPause; // 0x2d8
};

struct UAnimNotify_PlayMontageNotifyWindow : UAnimNotifyState {
	FName NotifyName; // 0x30
};

struct ACameraRig_Rail : AActor {
	float CurrentPositionOnRail; // 0x248
	bool bLockOrientationToRail; // 0x24c
	USceneComponent* TransformComponent; // 0x250
	USplineComponent* RailSplineComponent; // 0x258
	USceneComponent* RailCameraMount; // 0x260
};

struct UParticleModuleEventReceiverBase : UParticleModuleEventBase {
	EParticleEventType EventGeneratorType; // 0x30
	FName EventName; // 0x34
};

struct ASQVehicleTurretClosedTop : ASQVehicleTurret {
	bool bCanStabilize; // 0x3c8
	USoundBase* StabilizationToggleSound; // 0x3d0
	int GunLineOfSightSeatIndex; // 0x3d8
	USQVehicleViewWidget* TurretOverlay; // 0x3e0
	int CurrentZoom; // 0x3e8
	TArray<float> ZoomLevels; // 0x3f0
	USoundBase* ZoomToggleSound; // 0x400
	float ZoomToggleSoundPitch; // 0x408
};

struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	FName ParameterName; // 0xe0
	FGuid ExpressionGUID; // 0xe8
	FName Group; // 0xf8
};

struct ULandscapeSplinesComponent : UPrimitiveComponent {
	TArray<ULandscapeSplineControlPoint*> ControlPoints; // 0x408
	TArray<ULandscapeSplineSegment*> Segments; // 0x418
	TArray<UMeshComponent*> CookedForeignMeshComponents; // 0x428
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x78
	char bUsePSysLocation : 1; // 0x78
	char bInheritVelocity : 1; // 0x78
	FRawDistributionVector InheritVelocityScale; // 0x80
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xd0
	char bBanPhysicalMaterials : 1; // 0xe0
};

struct USlider : UWidget {
	float Value; // 0x108
	DelegateProperty ValueDelegate; // 0x10c
	float MinValue; // 0x11c
	float MaxValue; // 0x120
	FSliderStyle WidgetStyle; // 0x128
	EOrientation Orientation; // 0x468
	FLinearColor SliderBarColor; // 0x46c
	FLinearColor SliderHandleColor; // 0x47c
	bool IndentHandle; // 0x48c
	bool Locked; // 0x48d
	bool MouseUsesStep; // 0x48e
	bool RequiresControllerLock; // 0x48f
	float StepSize; // 0x490
	bool IsFocusable; // 0x494
	FScriptMulticastDelegate OnMouseCaptureBegin; // 0x498
	FScriptMulticastDelegate OnMouseCaptureEnd; // 0x4a8
	FScriptMulticastDelegate OnControllerCaptureBegin; // 0x4b8
	FScriptMulticastDelegate OnControllerCaptureEnd; // 0x4c8
	FScriptMulticastDelegate OnValueChanged; // 0x4d8
};

struct UPrefabObjectExporterT3D : UPrefabExporter {
	UObject* SupportedClass; // 0x28
	UObject* ExportRootScope; // 0x30
	TArray<FString> FormatExtension; // 0x38
	TArray<FString> FormatDescription; // 0x48
	int PreferredFormatIndex; // 0x58
	int TextIndent; // 0x5c
	char bText : 1; // 0x60
	char bSelectedOnly : 1; // 0x60
	char bForceFileOperations : 1; // 0x60
	UAssetExportTask* ExportTask; // 0x68
};

struct UBP_Attachment_LeupoldScope_Blur_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UBP_AK74M_Reflex_StaticInfo_C : UBP_AK74M_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct AChaosSolverActor : AActor {
	float TimeStepMultiplier; // 0x248
	int CollisionIterations; // 0x24c
	int PushOutIterations; // 0x250
	int PushOutPairIterations; // 0x254
	float ClusterConnectionFactor; // 0x258
	EClusterConnectionTypeEnum ClusterUnionConnectionType; // 0x25c
	bool DoGenerateCollisionData; // 0x25d
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x260
	bool DoGenerateBreakingData; // 0x270
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x274
	bool DoGenerateTrailingData; // 0x284
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x288
	bool bHasFloor; // 0x298
	float FloorHeight; // 0x29c
	float MassScale; // 0x2a0
	FChaosDebugSubstepControl ChaosDebugSubstepControl; // 0x2a4
	UBillboardComponent* SpriteComponent; // 0x2a8
	UChaosGameplayEventDispatcher* GameplayEventDispatcherComponent; // 0x2b0
};

struct ADebugCameraController : APlayerController {
	char bShowSelectedInfo : 1; // 0x598
	char bIsFrozenRendering : 1; // 0x598
	char bIsOrbitingSelectedActor : 1; // 0x598
	char bOrbitPivotUseCenter : 1; // 0x598
	char bEnableBufferVisualization : 1; // 0x598
	char bEnableBufferVisualizationFullMode : 1; // 0x598
	char bIsBufferVisualizationInputSetup : 1; // 0x598
	char bLastDisplayEnabled : 1; // 0x598
	UDrawFrustumComponent* DrawFrustum; // 0x5a0
	AActor* SelectedActor; // 0x5a8
	UPrimitiveComponent* SelectedComponent; // 0x5b0
	FHitResult SelectedHitPoint; // 0x5b8
	APlayerController* OriginalControllerRef; // 0x640
	UPlayer* OriginalPlayer; // 0x648
	float SpeedScale; // 0x650
	float InitialMaxSpeed; // 0x654
	float InitialAccel; // 0x658
	float InitialDecel; // 0x65c
};

struct USQVelocityRotatingMovementComponent : USQMovementComponentPacked {
	float AngularDeltaCombineThreshold; // 0x1e0
	USceneComponent* UpdatedComponent; // 0x1e8
	float AccelerationMultiplier; // 0x1f0
	float NoInputDecelerationMultiplier; // 0x1f4
	float DecelerationMultiplier; // 0x1f8
	bool bEnableStabilization; // 0x1fc
	float StabilizationSpeed; // 0x200
	FSQRotationConstraints RotationConstraints; // 0x204
	UCurveFloat* ParentYawToMinPitch; // 0x220
	UCurveFloat* ParentYawToMaxPitch; // 0x228
	USQVelocityRotatingMovementComponent* HeadingParentComponent; // 0x230
	FSQRotationVelocityRepMovement RotationReplicatedMovement; // 0x280
	bool IsDisabled; // 0x2d0
};

struct UAnimCurveCompressionSettings : UObject {
	UAnimCurveCompressionCodec* Codec; // 0x28
};

struct USQActionSettings : USQSettings {
	bool CreateMapMarker; // 0x58
};

struct UEditableGameplayTagQueryExpression_NoExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UNoiseField : UFieldNodeFloat {
	float MinRange; // 0xd8
	float MaxRange; // 0xdc
	FTransform Transform; // 0xe0
};

struct USoundMix : UObject {
	char bApplyEQ : 1; // 0x28
	float EQPriority; // 0x2c
	FAudioEQEffect EQSettings; // 0x30
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x68
	float InitialDelay; // 0x78
	float FadeInTime; // 0x7c
	float Duration; // 0x80
	float FadeOutTime; // 0x84
};

struct UAbilityTask_ApplyRootMotionJumpForce : UAbilityTask_ApplyRootMotion_Base {
	FScriptMulticastDelegate OnFinish; // 0xb8
	FScriptMulticastDelegate OnLanded; // 0xc8
	FRotator Rotation; // 0xd8
	float distance; // 0xe4
	float Height; // 0xe8
	float Duration; // 0xec
	float MinimumLandedTriggerTime; // 0xf0
	bool bFinishOnLanded; // 0xf4
	UCurveVector* PathOffsetCurve; // 0xf8
	UCurveFloat* TimeMappingCurve; // 0x100
};

struct UBP_AK74MGP25_UGL_Reflex_HE_StaticInfo_C : UBP_AK74MGP25_UGL_Reflex_Parent_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UNetworkSettings : UDeveloperSettings {
	char bVerifyPeer : 1; // 0x38
	char bEnableMultiplayerWorldOriginRebasing : 1; // 0x38
	int MaxRepArraySize; // 0x3c
	int MaxRepArrayMemory; // 0x40
};

struct ABP_L85A2_SUSAT_Foregrip_C : ABP_L85A2_Foregrip_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UStaticMeshComponent* Scope; // 0x7b8
};

struct ABP_L85A2_DarkEarth_SUSAT_Foregrip_C : ABP_L85A2_DarkEarth_Foregrip_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UStaticMeshComponent* Scope; // 0x7b8
};

struct UCameraAnimInst : UObject {
	UCameraAnim* CamAnim; // 0x28
	UInterpGroupInst* InterpGroupInst; // 0x30
	float PlayRate; // 0x50
	UInterpTrackMove* MoveTrack; // 0x68
	UInterpTrackInstMove* MoveInst; // 0x70
	ECameraAnimPlaySpace PlaySpace; // 0x78
};

struct UBP_M4_Optic_StaticInfo_C : UBP_M4_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UCollisionProfile : UDeveloperSettings {
	TArray<FCollisionResponseTemplate> Profiles; // 0x38
	TArray<FCustomChannelSetup> DefaultChannelResponses; // 0x48
	TArray<FCustomProfile> EditProfiles; // 0x58
	TArray<FRedirector> ProfileRedirects; // 0x68
	TArray<FRedirector> CollisionChannelRedirects; // 0x78
};

struct UGridSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
	int Row; // 0x4c
	int RowSpan; // 0x50
	int Column; // 0x54
	int ColumnSpan; // 0x58
	int Layer; // 0x5c
	FVector2D Nudge; // 0x60
};

struct ULegacyLevelSequenceDirectorBlueprint : UBlueprint {
	char bRecompileOnLoad : 1; // 0x50
	UObject* ParentClass; // 0x58
	char bHasBeenRegenerated : 1; // 0x60
	char bIsRegeneratingOnLoad : 1; // 0x60
	USimpleConstructionScript* SimpleConstructionScript; // 0x68
	TArray<UActorComponent*> ComponentTemplates; // 0x70
	TArray<UTimelineTemplate*> Timelines; // 0x80
	UInheritableComponentHandler* InheritableComponentHandler; // 0x90
	EBlueprintType BlueprintType; // 0x98
	int BlueprintSystemVersion; // 0x9c
	bool bNativize; // 0xd0
};

struct ACineCameraActor : ACameraActor {
	FCameraLookatTrackingSettings LookatTrackingSettings; // 0x7b0
};

struct UInterpTrackColorProp : UInterpTrackVectorBase {
	FName PropertyName; // 0x90
};

struct UBP_AK74MGP25_Reflex_Rifle_StaticInfo_C : UBP_AK74MGP25_Rifle_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USQRestriction : USQSettings {
	FName ID; // 0x30
	FDataTableRowHandle Data; // 0x38
	FString ModId; // 0x48
};

struct UBP_Attachment_PSO-1_Blur_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UAbilityTask_NetworkSyncPoint : UAbilityTask {
	FScriptMulticastDelegate OnSync; // 0x80
};

struct ABP_M4M203_M150_UGL_Smoke_Blue_C : ABP_M4M203_M150_UGL_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UGeometryCacheTrack_TransformGroupAnimation : UGeometryCacheTrack {
	float Duration; // 0x28
};

struct UAK74GP25_UGL_Skeleton_AnimBlueprint_C : USQWeaponAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2b0
	FAnimNode_Root AnimGraphNode_Root_2717030B48BA522BE72A1895002E18E4; // 0x2b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_0C1CF6474C909D49F8DCA7B75FCEBA30; // 0x2e8
	FAnimNode_Slot AnimGraphNode_Slot_6A1ADD9D41DEB14EFF829D9C1F9BCE62; // 0x3a8
	FAnimNode_Slot AnimGraphNode_Slot_7A240C39418EA94DA763BFADD147FBB4; // 0x3f0
	FAnimNode_Slot AnimGraphNode_Slot_DFEF34044C4E88CB20FAE4AB7F965846; // 0x438
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_D7E83CB64AF7D3A9E305669818225FE5; // 0x480
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3D4E609C4B8F6B0FCE7C409148CFF6DF; // 0x4f8
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_7A628039422676C64C46CCB4C5C72D52; // 0x5b8
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_EF3D8E94493768E2355645A514D16B5D; // 0x5d0
};

struct ABP_M4_4Mags_Founders_C : ABP_M4_4Mags_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UMaterialExpressionParticleMacroUV : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct ALevelBounds : AActor {
	bool bAutoUpdateBounds; // 0x248
};

struct UReplicationGraphNode_DormancyNode : UReplicationGraphNode_ActorList {
	TArray<UReplicationGraphNode*> AllChildNodes; // 0x28
};

struct UAudioCaptureComponent : USynthComponent {
	int JitterLatencyFrames; // 0x640
};

struct UExponentialHeightFogComponent : USceneComponent {
	float FogDensity; // 0x218
	float FogHeightFalloff; // 0x21c
	FExponentialHeightFogData SecondFogData; // 0x220
	FLinearColor FogInscatteringColor; // 0x22c
	UTextureCube* InscatteringColorCubemap; // 0x240
	float InscatteringColorCubemapAngle; // 0x248
	FLinearColor InscatteringTextureTint; // 0x24c
	float FullyDirectionalInscatteringColorDistance; // 0x25c
	float NonDirectionalInscatteringColorDistance; // 0x260
	float DirectionalInscatteringExponent; // 0x264
	float DirectionalInscatteringStartDistance; // 0x268
	FLinearColor DirectionalInscatteringColor; // 0x26c
	float FogMaxOpacity; // 0x27c
	float StartDistance; // 0x280
	float FogCutoffDistance; // 0x284
	bool bEnableVolumetricFog; // 0x288
	float VolumetricFogScatteringDistribution; // 0x28c
	FColor VolumetricFogAlbedo; // 0x290
	FLinearColor VolumetricFogEmissive; // 0x294
	float VolumetricFogExtinctionScale; // 0x2a4
	float VolumetricFogDistance; // 0x2a8
	float VolumetricFogStaticLightingScatteringIntensity; // 0x2ac
	bool bOverrideLightColorsWithFogInscatteringColors; // 0x2b0
};

struct ASQJoinBeaconHost : AOnlineBeaconHostObject {
	TArray<FSQServerSlot> PublicQueue; // 0x270
	TArray<FSQServerSlot> ReservedQueue; // 0x280
	TArray<FSQServerSlot> JoiningServerSlots; // 0x290
};

struct UParticleModuleAttractorBase : UParticleModule {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2c
};

struct UGeometryCollection : UObject {
	TArray<UMaterialInterface*> Materials; // 0x30
	ECollisionTypeEnum CollisionType; // 0x40
	EImplicitTypeEnum ImplicitType; // 0x41
	int MinLevelSetResolution; // 0x44
	int MaxLevelSetResolution; // 0x48
	int MinClusterLevelSetResolution; // 0x4c
	int MaxClusterLevelSetResolution; // 0x50
	float CollisionObjectReductionPercentage; // 0x54
	bool bMassAsDensity; // 0x58
	float Mass; // 0x5c
	float MinimumMassClamp; // 0x60
	float CollisionParticlesFraction; // 0x64
	int MaximumCollisionParticles; // 0x68
	TArray<FGeometryCollectionSizeSpecificData> SizeSpecificData; // 0x70
	bool EnableRemovePiecesOnFracture; // 0x80
	TArray<UMaterialInterface*> RemoveOnFractureMaterials; // 0x88
	FGuid PersistentGuid; // 0x98
	FGuid StateGuid; // 0xa8
	int BoneSelectedMaterialIndex; // 0xb8
};

struct UAbilityTask_WaitAttributeChangeThreshold : UAbilityTask {
	FScriptMulticastDelegate OnChange; // 0x80
	UAbilitySystemComponent* ExternalOwner; // 0xd0
};

struct AWindDirectionalSource : AInfo {
	UWindDirectionalSourceComponent* Component; // 0x248
};

struct ABP_AK74MGP25_1P78_UGL_Desert_Smoke_C : ABP_AK74MGP25_1P78_UGL_Desert_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x30
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x38
};

struct UBehaviorTreeManager : UObject {
	int MaxDebuggerSteps; // 0x28
	TArray<FBehaviorTreeTemplateInfo> LoadedTemplates; // 0x30
	TArray<UBehaviorTreeComponent*> ActiveComponents; // 0x40
};

struct USQRestriction_ActorsInRange : USQRestriction_Boolean {
	float Range; // 0x58
	AActor* TargetActorClass; // 0x60
	int TargetCount; // 0x68
};

struct USQSquadStateDataMapMarkerSpotted : USQSquadStateDataMapMarkerSelectable {
	USQMapIconComponent* MapIcon; // 0x1a0
};

struct ASQForwardBase : ASQDeployable {
	bool bIsSpawningEnabled; // 0x418
	float TimeToEnableSpawning; // 0x41c
	bool bCreatesFobSpawnPoints; // 0x420
	bool bSuppliesCreateSpawnPoints; // 0x421
	float SpawnPointRadius; // 0x424
	FVector SpawnOffset; // 0x428
	int EnemiesToCapture; // 0x434
	FString Name; // 0x438
	bool UseCaptureTick; // 0x448
	TArray<ASQDeployable*> TrackedDeployables; // 0x450
	FScriptMulticastDelegate OnFOBStateUpdated; // 0x460
	TArray<ASQGameSpawn*> SpawnPoints; // 0x470
	ASQGameSpawn* SpawnPointClass; // 0x480
	bool bSieged; // 0x488
	float ActivatedTime; // 0x48c
	int NumberOfTeammatesNeededToDeploy; // 0x490
	int NumberOfLogisNeededToDeploy; // 0x494
	float PercentToDisableSpawns; // 0x498
	USphereComponent* CaptureZone; // 0x4a0
	USphereComponent* DeploymentRadius; // 0x4a8
	USphereComponent* ConstructionRadius; // 0x4b0
	bool bUseResourceTickRateToUpdateResources; // 0x4b8
	float MaxTicketsPerSecond; // 0x4bc
	float TicketsPerPlayer; // 0x4c0
	int TicketsLostWhenOverrun; // 0x4c4
	int EnemiesToDisableSpawn; // 0x4c8
	float InitialConstructionPoints; // 0x4cc
	float MaxConstructionPoints; // 0x4d0
	float InitialAmmo; // 0x4d4
	float MaxAmmo; // 0x4d8
	float CPPerSecond; // 0x4dc
	float AmmoPerSecond; // 0x4e0
	float ResourceGenerationRate; // 0x4e4
	float CaptureTickRate; // 0x4e8
	float Ammo; // 0x4ec
	float ConstructionPoints; // 0x4f0
	int NearbyEnemies; // 0x4f4
	int SiegedSpawnPoints; // 0x4f8
	USQForwardBaseSettings* FOBSettings; // 0x528
	bool bIsBleeding; // 0x530
	float EnterBleedingHealth; // 0x534
	float ExitBleedingHealth; // 0x538
	float BleedOutTime; // 0x53c
	float EstimatedWorldTimeOfDeath; // 0x540
	AController* BleedStateInstigator; // 0x550
	AActor* BleedStateCauser; // 0x558
};

struct ABP_AK74M_1P78_Tracer_C : ABP_AK74M_1P78_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_AK74MGP25_1P63_UGL_Smoke_C : ABP_AK74MGP25_1P63_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UBP_L85A2AG36_ElcanLDS_StaticInfo_C : UBP_L85A2AG36_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USQPhysicalMaterialVehiclesEffects : UObject {
	TMap<USQPhysicalMaterial*, FSQVehicleEffect> Effects; // 0x28
};

struct ASQRandomizer : AActor {
	USceneComponent* Root; // 0x248
	int RandomSeed; // 0x250
};

struct ASQHealingEquipableItem : ASQEquipableItem {
	float TraceLength; // 0x480
	float TraceSphereRadius; // 0x484
	float MaxDurationForCancel; // 0x488
	FColor ErrorMessageColor; // 0x48c
	float ErrorMessageLifetime; // 0x490
	ASQSoldier* HealedTarget; // 0x498
	UAudioComponent* HealthAudioComponent; // 0x4a0
};

struct UAIResource_Logic : UGameplayTaskResource {
	int ManualResourceID; // 0x28
	uint8 AutoResourceID; // 0x2c
	char bManuallySetID : 1; // 0x30
};

struct UInterpTrack : UObject {
	TArray<UInterpTrack*> SubTracks; // 0x38
	UInterpTrackInst* TrackInstClass; // 0x48
	ETrackActiveCondition ActiveCondition; // 0x50
	FString TrackTitle; // 0x58
	char bOnePerGroup : 1; // 0x68
	char bDirGroupOnly : 1; // 0x68
	char bDisableTrack : 1; // 0x68
	char bIsSelected : 1; // 0x68
	char bIsAnimControlTrack : 1; // 0x68
	char bSubTrackOnly : 1; // 0x68
	char bVisible : 1; // 0x68
	char bIsRecording : 1; // 0x68
};

struct UBrushComponent : UPrimitiveComponent {
	UModel* Brush; // 0x408
	UBodySetup* BrushBodySetup; // 0x410
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput Opacity; // 0x90
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x248
	USceneComponent* SceneComponent; // 0x250
};

struct USQAnimInstanceSoldier3P : USQAnimInstanceSoldier {
	bool bVaulting; // 0x420
	bool bClimbing; // 0x421
	bool bAssetPlayerTimeFromEnd__LTEPtOne__Jump_3P__JumpEnd__rifle_stand_jumpendOrIsProne; // 0x422
	bool bAssetPlayerTimeFromEnd__LTEPtOne__Jump_3P__JumpStart__rifle_stand_jumpstart; // 0x423
	bool bAssetPlayerTime__GTEPtOne__Jump_3P__JumpStart__rifle_stand_jumpstart; // 0x424
	bool bStateWeight__GTEOne__Stand3P__Jog; // 0x4a0
	float StateWeight__Stand3P__Jog; // 0x4a4
	bool bStateWeight__GTEOne__Stand3P__Sprint; // 0x4a8
	float StateWeight__Stand3P__Sprint; // 0x4ac
	float StateWeight__Stand3P__SprintStop; // 0x4b0
	bool bRelevantAnimTimeRemaining__LTEOne__Stand3P__SprintStop; // 0x4b4
	bool bStateWeight__GTEOne__Stand_NeutralStates__Neutral; // 0x52c
	bool bStateWeight__GTEOne__Stand_NeutralStates__TurnLeft_91; // 0x52d
	bool bStateWeight__GTEOne__Stand_NeutralStates__TurnRight_91; // 0x52e
	bool bRelevantAnimTimeRemaining__LTEZero__Stand_NeutralStates__TurnLeft_91; // 0x52f
	bool bRelevantAnimTimeRemaining__LTEZero__Stand_NeutralStates__TurnRight_91; // 0x530
	float StateWeight__Crouch3P__Sprint; // 0x5c4
	float StateWeight__Crouch3P__Walk; // 0x5c8
	bool bStateWeight__GTEOne__Crouch_NeutralStates__Neutral; // 0x606
	bool bStateWeight__GTEOne__Crouch_NeutralStates__TurnLeft_91; // 0x607
	bool bStateWeight__GTEOne__Crouch_NeutralStates__TurnRight_91; // 0x608
	float StateWeight__Prone3P__ProneMove; // 0x680
	bool bStateWeight__GTEOne__Prone_NeutralStates__Neutral; // 0x6a1
	bool bStateWeight__GTEOne__Prone_NeutralStates__TurnLeft_46; // 0x6a2
	bool bStateWeight__GTEOne__Prone_NeutralStates__TurnRight_46; // 0x6a3
	bool bStateWeight__GTEOne__SoldierMovements__Stand; // 0x6fb
	bool bStateWeight__GTEOne__SoldierMovements__Crouch; // 0x6fc
	bool bStateWeight__GTEOne__SoldierMovements__Stand2Crouch; // 0x6fd
	float StateWeight__SoldierMovements__Stand2Prone; // 0x700
	float StateWeight__SoldierMovements__Sprint2Prone; // 0x704
	float StateWeight__SoldierMovements__Prone2Stand; // 0x708
	float StateWeight__SoldierMovements__Crouch2Prone; // 0x70c
	float StateWeight__SoldierMovements__Prone2Crouch; // 0x710
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Stand2Prone__rifle_stand2prone; // 0x714
	bool bAssetPlayerTimeFromEnd__LTEPtTwo__SoldierMovements__Sprint2Prone__rifle_sprint2prone; // 0x715
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Prone2Stand__rifle_prone2stand; // 0x716
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Crouch2Prone__rifle_crouch2prone; // 0x717
	bool bAssetPlayerTimeFromEnd__LTEPtFour__SoldierMovements__Prone2Crouch__rifle_prone2crouch; // 0x718
	bool bAssetPlayerTimeFromEnd__LTEPtOne__SoldierMovements__Stand2Crouch__Stand2Crouch; // 0x719
	bool bAssetPlayerTimeFromEnd__LTEPtOne__SoldierMovements__Crouch2Stand__Crouch2Stand; // 0x71a
	bool bIsSprinting; // 0x8fd
	float CustomNotIsFallingAlpha; // 0x900
	UBlendSpace1D* BS1D_3pStandSprintType; // 0x908
	UAnimSequence* SprintStop3p; // 0x910
	UBlendSpace1D* BS1D_3pCrouchSprintType; // 0x918
	UBlendSpace* BS_3pStandJogType; // 0x920
	UBlendSpace* BS_3pStandWalkType; // 0x928
	UBlendSpace* BS_3pCrouchWalkType; // 0x930
	UBlendSpace1D* BS1D_3pProneCrawlType; // 0x938
	UAnimSequence* StandStopMove; // 0x940
	UAnimSequence* CrouchStopMove; // 0x948
	UAnimSequence* StandLeanLeftShuffle; // 0x950
	UAnimSequence* StandLeanRightShuffle; // 0x958
	UAnimSequence* CrouchLeanLeftShuffle; // 0x960
	UAnimSequence* CrouchLeanRightShuffle; // 0x968
	UBlendSpace1D* AO1D_StandPitch; // 0x970
	UBlendSpace1D* AO1D_CrouchPitch; // 0x978
	UBlendSpace1D* AO1D_PronePitch; // 0x980
	UBlendSpace* AO_BipodStandCrouchPitch; // 0x988
	UAnimSequence* AO1D_StandYawSF; // 0x990
	UAnimSequence* AO1D_CrouchYawSF; // 0x998
	UAnimSequence* AO1D_ProneYawSF; // 0x9a0
	UAnimSequence* StandTurnRight; // 0x9a8
	UAnimSequence* StandTurnLeft; // 0x9b0
	UAnimSequence* CrouchTurnLeft; // 0x9b8
	UAnimSequence* CrouchTurnRight; // 0x9c0
	UAnimSequence* ProneTurnRight; // 0x9c8
	UAnimSequence* ProneTurnLeft; // 0x9d0
	UAnimSequence* SprintToProne3p; // 0x9d8
	UAnimSequence* StandToProne3p; // 0x9e0
	UAnimSequence* ProneToStand3p; // 0x9e8
	UAnimSequence* CrouchToProne3p; // 0x9f0
	UAnimSequence* ProneToCrouch3p; // 0x9f8
	FVector FpvLowerRootBoneOffset; // 0xa00
	float CustomSpeedMin40; // 0xa0c
	float ProneStopMoveAlpha; // 0xa10
	float CrouchStopMoveAlpha; // 0xa14
	bool bFP_HighestClimbAnim; // 0xa18
	bool bFP_T_Jump_3PJumpStartToJumpEnd; // 0xa19
	bool bFP_T_Stand3PSprintStopToJog; // 0xa1a
	bool bFP_T_Stand3PSprintToSprintStop; // 0xa1b
	bool bFP_T_Stand3PJogToSprint; // 0xa1c
	bool bFP_T_Stand_NeutralStatesTurnRight_90ToTurnLeft_91; // 0xa1d
	bool bFP_T_Stand_NeutralStatesTurnLeft_90ToTurnRight_91; // 0xa1e
	bool bFP_T_Stand_NeutralStatesNeutralToTurnLeft_91; // 0xa1f
	bool bFP_T_Stand_NeutralStatesNeutralToTurnRight_91; // 0xa20
	bool bFP_T_Crouch_NeutralStatesTurnRight_90ToNeutral; // 0xa21
	bool bFP_T_Crouch_NeutralStatesTurnRight_90ToTurnLeft_91; // 0xa22
	bool bFP_T_Crouch_NeutralStatesTurnLeft_90ToNeutral; // 0xa23
	bool bFP_T_Crouch_NeutralStatesTurnLeft_90ToTurnRight_91; // 0xa24
	bool bFP_T_Crouch_NeutralStatesNeutralToTurnLeft_91; // 0xa25
	bool bFP_T_Crouch_NeutralStatesNeutralToTurnRight_91; // 0xa26
	bool bFP_T_Prone_NeutralStatesTurnLeft_45ToNeutral; // 0xa27
	bool bFP_T_Prone_NeutralStatesTurnLeft_45ToTurnRight_46; // 0xa28
	bool bFP_T_Prone_NeutralStatesTurnRight_45ToNeutral; // 0xa29
	bool bFP_T_Prone_NeutralStatesTurnRight_45ToTurnLeft_46; // 0xa2a
	bool bFP_T_Prone_NeutralStatesNeutralToTurnLeft_46; // 0xa2b
	bool bFP_T_Prone_NeutralStatesNeutralToTurnRight_46; // 0xa2c
	bool bFP_T_SoldierMovementsCrouch2StandToStand; // 0xa2d
	bool bFP_T_SoldierMovementsStand2CrouchToCrouch2Prone; // 0xa2e
	bool bFP_T_SoldierMovementsStand2CrouchToCrouch; // 0xa2f
	bool bFP_T_SoldierMovementsCrouchToCrouch2Prone; // 0xa30
	bool bFP_T_SoldierMovements_StandToCrouch; // 0xa31
	bool bFP_T_SoldierMovementsStandToStand2Prone; // 0xa32
	bool bFP_T_SoldierMovementsStandToStand2Crouch; // 0xa33
	bool bFP_T_SoldierMovementsStandToSprint2Prone; // 0xa34
	FRotator FP_FloorAlignedRotationRightFoot; // 0xa38
	FRotator FP_FloorAlignedRotationLeftFoot; // 0xa44
	FRotator FP_FloorAlignedRotationFeetRoot; // 0xa50
	FRotator FP_FloorAlignedRotationFeetRootReverse; // 0xa5c
	FVector FP_IKFeetRootTranslation; // 0xa68
	float FP_IsNotFirstPersonVisibilityAlpha; // 0xa74
	float FP_StandIdleAlpha; // 0xa78
	float FP_CrouchProneIdleAlpha; // 0xa7c
	bool bFP_IsStanding; // 0xa80
	bool bFP_IsStandingStill; // 0xa81
	bool bFP_CanCrouchToStandingStill; // 0xa82
	bool bFP_CanCrouchToStandMoving; // 0xa83
	bool bFP_IsCrouchedInPlace; // 0xa84
	float FP_AimOffsetProneYawFrameTime; // 0xa88
	float FP_AimOffsetYawNegative; // 0xa8c
	float FP_AimOffsetProneTurnRightYawFrameTime; // 0xa90
	float FP_AimOffsetTurnRightYawNegative; // 0xa94
	float FP_AimOffsetProneTurnLeftYawFrameTime; // 0xa98
	float FP_AimOffsetTurnLeftYawNegative; // 0xa9c
	float FP_ProneWalkPlayRate; // 0xaa0
	bool bFP_IsMoving; // 0xaa4
	bool bFP_IsNotMoving; // 0xaa5
	FRotator FP_FloorAlignedRotationBody; // 0xaa8
	FRotator FP_FloorAlignedRotationBodyReverse; // 0xab4
	float FP_CustomSpeedMin40NormalizedToRange; // 0xac0
	bool bFP_IsProneAndNotDeployBipod; // 0xac4
	bool bFP_IsClimbingOrVaulting; // 0xac5
	FRotator FP_FreeLook3PHeadRotation; // 0xac8
	float FP_BipodCrouchStanceAlpha; // 0xad4
	float FP_BipodStandCrouchAimPitchAlpha; // 0xad8
	float FP_BipodProneStanceAlpha; // 0xae0
	float FP_BipodAimOffsetAlpha; // 0xae4
	float FP_BipodWeaponPosCoveredPoseAlphaDependingOnSkelMeshOffset; // 0xae8
	float FP_BipodCoveredPoseBlendAlpha; // 0xaec
	FVector FP_BipodHighPitchCoveredPoseWeaponPositionOffset; // 0xaf0
	FVector FP_BipodDynamicBodyOffset; // 0xafc
	float FP_AimOffsetCrouchYawFrameTime; // 0xb08
	float FP_AimOffsetTurnLeftYawPlayRate; // 0xb0c
	float FP_AimOffsetTurnLeftProneYawPlayRate; // 0xb10
	float FP_AimOffsetTurnLeftYawFrameTime; // 0xb14
	float FP_AimOffsetTurnRightYawPlayRate; // 0xb18
	float FP_AimOffsetTurnRightProneYawPlayRate; // 0xb1c
	float FP_AimOffsetTurnRightYawFrameTime; // 0xb20
	float FP_StandStopMoveAlpha; // 0xb24
	float FP_AimYawFrameTime2; // 0xb28
	float FP_CrouchWalkPlayRate; // 0xb2c
	float FP_AimYawJogFrameTime; // 0xb30
	float FP_AimPitchJogAlpha; // 0xb34
	float FP_JogPlayRate; // 0xb38
	float FP_SprintStopAlpha; // 0xb3c
	bool bFP_Stand3PNeutralToJogRule; // 0xb40
	bool bFP_Stand3PJogToNeutralRule; // 0xb41
	bool bFP_Stand3PSprintToNeutralRule; // 0xb42
	float FP_AimOffsetStandYawFrameTime; // 0xb44
	float FP_JumpEndAlpha; // 0xb48
	bool bFP_IsFallingAndNotJumping; // 0xb4c
	float FP_Final3PLeftHandIKOutAlpha; // 0xb50
	bool bFP_AOStandToConduit; // 0xb54
	bool bFP_AOStandSprintJog; // 0xb55
	bool bFP_AOCrouchToConduit; // 0xb56
	bool bFP_AOProneToConduit; // 0xb57
	bool bFP_AOConduitToCrouch; // 0xb58
	float FP_BS_StandSprintSpeed; // 0xb5c
	FRotator FP_SprintHeadDirection; // 0xb60
	float FP_SprintRootDirection; // 0xb6c
	float FP_BS_CrouchSprintSpeed; // 0xb70
	bool bFP_LeanHeadWhenADSAndADS; // 0xb74
	bool bFinal3pLeftHandIkOut; // 0xb75
	float CustomWeapActionsAndIsAds; // 0xb78
	float FP_WalkPlayRate; // 0xb7c
	float FP_IsNotMovingAlpha; // 0xb80
	float FP_LeanYawOffsetFrameTime; // 0xb84
	float FP_AlphaAbsIkFeetRootPitch; // 0xb88
	FRotator RawActorRotation; // 0xb8c
	FRotator SmoothedControlRotation; // 0xb98
	bool bTurnNeutAoDisabled; // 0xba4
	FRotator CachedActorYaw; // 0xba8
	bool bLeftHandIkOut; // 0xbb4
	bool bJumpEndBobbing3P; // 0xbb5
	float CustomIsSprinting; // 0xbb8
	float CustomIsAdsOrBipod; // 0xbbc
	FVector SmoothVelocity; // 0xbc0
	float AccelRateClamp; // 0xbcc
	FRotator SmoothWorldDirection; // 0xbd0
	FRotator AimRotation_3P; // 0xbdc
	FRotator AimRotation2_3P; // 0xbe8
	bool bTurnLeftAnim; // 0xbf4
	bool bFullMoveAnim; // 0xbf5
	bool bTurnRightAnim; // 0xbf6
	bool bTurnLeft; // 0xbf7
	bool bTurnRight; // 0xbf8
	bool bTurnLeftProne; // 0xbf9
	bool bTurnRightProne; // 0xbfa
	FRotator YawOffset; // 0xbfc
	FRotator YawOffsetDuringTurnLeft; // 0xc08
	FRotator YawOffsetDuringTurnRight; // 0xc14
	bool bFullSprintAnim; // 0xc20
	float LastSpeed; // 0xc24
	float SprintStopCachedSpeed; // 0xc28
	bool bCachedIsProne; // 0xc2c
	float StandStopMoveAlpha; // 0xc30
	bool bCachedIsCrouched; // 0xc34
	bool bCachedIsStand; // 0xc35
	bool bProneTransAnim; // 0xc36
	FVector PmCachedCapsuleWorldLoc1; // 0xc38
	FVector EndSprintToProneCapsuleLoc; // 0xc44
	float Alpha; // 0xc50
	float LastKnownHeight; // 0xc54
	float HeightVelocity; // 0xc58
	float LastKnownHeightVelocity; // 0xc5c
	float BipodAimUpLimit3P; // 0xc60
	float BipodAimDownLimit3P; // 0xc64
	float CustomNotVaultingAlpha; // 0xc68
	float CustomNotClimbingAlpha; // 0xc6c
	FVector CurrentFloorNormalBody; // 0xc70
	FVector CurrentFloorNormalFeet; // 0xc7c
	FRotator IkFeetRootRelRot; // 0xc88
	FVector LeftFootFloorNormal; // 0xc94
	FVector RightFootFloorNormal; // 0xca0
	float CustomIsLoweredAndNotProne; // 0xcac
	FRotator MeshRotationOffset; // 0xcb0
	FRotator CachedActorRotationNoLean; // 0xcbc
	float CachedLeanYawOffset; // 0xcc8
	bool bLeanHeadWhenAds; // 0xcd0
};

struct UGridPathFollowingComponent : UPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x280
};

struct USQProjectileRootComponent : USphereComponent {
	float SphereRadius; // 0x420
};

struct UMaterialExpressionStaticSwitchParameter : UMaterialExpressionStaticBoolParameter {
	FExpressionInput A; // 0x60
	FExpressionInput B; // 0x74
};

struct USQAvailability_Vehicle : USQAvailability {
	USQVehicleSettings* Setting; // 0x50
};

struct ULandscapeMaterialInstanceConstant : UMaterialInstanceConstant {
	char bIsLayerThumbnail : 1; // 0x1c8
	char bDisableTessellation : 1; // 0x1c8
	char bMobile : 1; // 0x1c8
	char bEditorToolUsage : 1; // 0x1c8
};

struct UMovieSceneAudioTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AudioSections; // 0x58
};

struct AGameplayAbilityTargetActor_GroundTrace : AGameplayAbilityTargetActor_Trace {
	float CollisionRadius; // 0x370
	float CollisionHeight; // 0x374
};

struct ABP_RPG7_Heat_2Mag_C : ABP_RPG7_Heat_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x7b0
	UParticleSystemComponent* MuzzleFlashRearComponent3P; // 0x7b8
	UChildActorComponent* BackBlastComponent3P; // 0x7c0
	UParticleSystemComponent* MuzzleFlashRearComponent1P; // 0x7c8
	USQBlastComponent* SquadBlast; // 0x7d0
	UChildActorComponent* BackBlastComponent1P; // 0x7d8
	FName BackblastSocket; // 0x7e0
	UParticleSystem* BackblastEffect1P; // 0x7e8
	UParticleSystem* BackblastEffect3P; // 0x7f0
};

struct UBP_Attachment_AKS74_Front_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct ASQTeamStatePrivate : AInfo {
	TArray<ASQSquadStatePrivateToTeam*> IndexedTeamPrivateSquadStates; // 0x250
	TArray<ASQSquadStatePrivateToTeam*> TeamPrivateSquadStates; // 0x260
	int ID; // 0x270
};

struct UBP_HighlightsSubsystem_C : USQBaseGameSubsystem {
	FPointerToUberGraphFrame UberGraphFrame; // 0x40
	bool HighlightsInitialized; // 0x48
	FGfeSDKHighlightOpenGroupParams HighlightOpenGroupParams; // 0x50
	FGfeSDKHighlightSummaryParams HighlightsSummaryParams; // 0xb0
	FGfeSDKHighlightConfigParams HighlightsConfigParams; // 0xc0
	int ActiveGroupId; // 0xe0
	bool DestroyHighlights; // 0xe4
	FHighlightEventStruct VehicleDestroyedEventParams; // 0xe8
	FHighlightEventStruct PlayerKilledEventParams; // 0x110
	FHighlightEventStruct IED_DetonatedEventParams; // 0x138
	EGfeSDKHighlightSignificance EventSignificance; // 0x160
	EGfeSDKHighlightType HighlightType; // 0x161
	int NumberOfHighlights; // 0x164
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x258
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x268
	UNavLinkCustomComponent* SmartLinkComp; // 0x278
	bool bSmartLinkIsRelevant; // 0x280
	FScriptMulticastDelegate OnSmartLinkReached; // 0x288
};

struct UInputAxisDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputAxisDelegateBinding> InputAxisDelegateBindings; // 0x28
};

struct ASQVehicleTurret : ASQVehicleSeat {
	float ADSSpeed; // 0x358
	float PitchLimit; // 0x35c
	float MinPitchLimit; // 0x360
	float YawLimit; // 0x364
	float MinYawLimit; // 0x368
	USQVehicleSeatComponent* ParentSeatComponent; // 0x370
	ESQListenerType ListenerType; // 0x378
	bool bIsCameraInitialized; // 0x379
	bool bShouldSendClientSideCameraUpdate; // 0x37a
	TArray<USQVehicleComponent*> VehicleComponents; // 0x380
	USQVehicleComponent* CachedVehicleEngine; // 0x390
	bool bTurnOut; // 0x398
	USQVehicleInventoryComponent* CachedVehicleInventory; // 0x3a0
	UCameraComponent* CachedCameraComponent; // 0x3a8
	float SeatHealth; // 0x3b0
	USQFreeLookComponent* FreeLookComponent; // 0x3b8
	USQMovementComponentManager* MovementComponentManager; // 0x3c0
};

struct UMovieSceneObjectPropertySection : UMovieSceneSection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe0
};

struct ABP_L85A2AG36_ElcanLDS_UGL_DarkEarth_Smoke_Red_C : ABP_L85A2AG36_ElcanLDS_UGL_DarkEarth_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ASQGameMode_Menu : AGameMode {
	FName MatchState; // 0x340
	char bDelayedStart : 1; // 0x348
	int NumSpectators; // 0x34c
	int NumPlayers; // 0x350
	int NumBots; // 0x354
	float MinRespawnDelay; // 0x358
	int NumTravellingPlayers; // 0x35c
	ULocalMessage* EngineMessageClass; // 0x368
	TArray<APlayerState*> InactivePlayerArray; // 0x370
	float InactivePlayerStateLifeSpan; // 0x380
	int MaxInactivePlayers; // 0x384
	bool bHandleDedicatedServerReplays; // 0x388
};

struct UMaterialExpressionParticleMotionBlurFade : UMaterialExpression {
	UMaterial* Material; // 0x28
	UMaterialFunction* Function; // 0x30
	char bIsParameterExpression : 1; // 0x38
};

struct UMaterialExpressionFresnel : UMaterialExpression {
	FExpressionInput ExponentIn; // 0x40
	float Exponent; // 0x54
	FExpressionInput BaseReflectFractionIn; // 0x58
	float BaseReflectFraction; // 0x6c
	FExpressionInput Normal; // 0x70
};

struct UFloatBinding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct USQVehicleWeaponAnimInstance : UAnimInstance {
	float Pitch; // 0x268
	float Yaw; // 0x26c
	float CurrentMagRemainingRoundsTime; // 0x270
	float CurrentMagRemainingRoundsMultiplier; // 0x274
};

struct ABP_M4M203_M150_UGL_HE_C : ABP_M4M203_M150_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UPlayFabAdminAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x760
	UPlayFabJsonObject* RequestJsonObj; // 0x768
	UPlayFabJsonObject* ResponseJsonObj; // 0x770
};

struct UBP_Attachment_LeupoldScope_C : USQWeaponAttachment_Scope {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UInt32Binding : UPropertyBinding {
	TWeakObjectPtr<UObject> SourceObject; // 0x28
	FDynamicPropertyPath SourcePath; // 0x30
	FName DestinationProperty; // 0x60
};

struct UWrapBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	bool bFillEmptySpace; // 0x48
	float FillSpanWhenLessThan; // 0x4c
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct ASQInfantryWeapon : ASQWeapon {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct USQSoundNodeListenerType : USoundNode {
	bool bLooping; // 0x40
	bool bRestartSoundWaveWhenListenerTypeChanges; // 0x41
	float ListenerTypeCheckFrequency; // 0x44
};

struct ASQSquadRallyPoint : ASQGameRallyPoint {
	ASQSquad* AuthoritySquad; // 0x440
	ASQSquadState* SquadState; // 0x448
};

struct UAISenseConfig_Sight : UAISenseConfig {
	UAISense_Sight* Implementation; // 0x48
	float SightRadius; // 0x50
	float LoseSightRadius; // 0x54
	float PeripheralVisionAngleDegrees; // 0x58
	FAISenseAffiliationFilter DetectionByAffiliation; // 0x5c
	float AutoSuccessRangeFromLastSeenLocation; // 0x60
};

struct UAchievementQueryCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct USQSquadStateDataPlayerState : USQSquadStateData {
	char bIsSquadLeader : 1; // 0x118
	char bIsFireTeamLeader : 1; // 0x118
	int FireTeamIndex; // 0x11c
	int FireTeamPosition; // 0x120
	USQRoleSettings* DeployRole; // 0x128
	USQVehicleUIStaticDataAsset* CurrentVehicleData; // 0x130
	ASQPlayerState* PlayerState; // 0x138
	int PlayerId; // 0x140
	FSQCoreStateId SelectionComponentId; // 0x144
	ESQVoiceChannel VoipChannel; // 0x146
	bool bIsMuted; // 0x147
};

struct USQVehicleClaim : UObject {
	ASQVehicle* VehicleClaimed; // 0x28
	ASQSquad* ClaimingSquad; // 0x30
	TArray<ASQPlayerState*> PlayersPartyToClaim; // 0x38
	ESQVehicleClaimStatus Status; // 0x48
	float TimeOfClaim; // 0x4c
	float TimeOfExpiration; // 0x50
	bool bExpired; // 0x54
	FTimerHandle ExpirationTimerHandle; // 0x58
};

struct ABP_AK74_Recruit_Founders_C : ABP_AK74_Recruit_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UNavigationInvokerComponent : UActorComponent {
	float TileGenerationRadius; // 0xd8
	float TileRemovalRadius; // 0xdc
};

struct UBTTask_PushPawnAction : UBTTask_PawnActionBase {
	UPawnAction* Action; // 0x70
};

struct USQGraphRAASVisualizerComponent : USQGraphAASVisualizerComponent {
	int RouteIndex; // 0xf8
};

struct UAbilityTask_WaitGameplayEvent : UAbilityTask {
	FScriptMulticastDelegate EventReceived; // 0x80
	UAbilitySystemComponent* OptionalExternalTarget; // 0x98
};

struct ASQKillDeathRuleset : ASQGameRuleSet {
	FSQKillDeathSettings TeamOneSettings; // 0x270
	FSQKillDeathSettings TeamTwoSettings; // 0x2b0
	float SpawnDelayPenaltyForSuicide; // 0x2f0
	float SpawnDelayPenaltyForTeamKill; // 0x2f4
	FSQHealSettings TeamOneHealSettings; // 0x2f8
	FSQHealSettings TeamTwoHealSettings; // 0x31c
	int TeamkillsBeforeKick; // 0x340
	float DefaultPointsForVehicleDestroy; // 0x344
	bool bDefaultShouldDelayScoreForVehicleDestroy; // 0x348
	int DefaultTicketsLostForVehicleDestroy; // 0x34c
	bool bTKAutoKickEnabled; // 0x350
};

struct UBP_AK74MGP25_Rifle_StaticInfo_C : UBP_AK74GP25_Rifle_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct ADocumentationActor : AActor {
	FActorTickFunction PrimaryActorTick; // 0x28
	char bHidden : 1; // 0x80
	char bNetTemporary : 1; // 0x80
	char bNetStartup : 1; // 0x80
	char bOnlyRelevantToOwner : 1; // 0x80
	char bAlwaysRelevant : 1; // 0x80
	char bReplicateMovement : 1; // 0x80
	char bTearOff : 1; // 0x80
	char bExchangedRoles : 1; // 0x80
	char bNetLoadOnClient : 1; // 0x81
	char bNetUseOwnerRelevancy : 1; // 0x81
	char bRelevantForNetworkReplays : 1; // 0x81
	char bRelevantForLevelBounds : 1; // 0x81
	char bReplayRewindable : 1; // 0x81
	char bAllowTickBeforeBeginPlay : 1; // 0x81
	char bAutoDestroyWhenFinished : 1; // 0x81
	char bBlockInput : 1; // 0x81
	char bCanBeDamaged : 1; // 0x82
	char bCollideWhenPlacing : 1; // 0x82
	char bFindCameraComponentWhenViewTarget : 1; // 0x82
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x82
	char bIgnoresOriginShifting : 1; // 0x82
	char bEnableAutoLODGeneration : 1; // 0x82
	char bIsEditorOnlyActor : 1; // 0x82
	char bActorSeamlessTraveled : 1; // 0x82
	char bReplicates : 1; // 0x83
	char bCanBeInCluster : 1; // 0x83
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x83
	char bActorEnableCollision : 1; // 0x84
	char bActorIsBeingDestroyed : 1; // 0x84
	ENetRole RemoteRole; // 0x85
	FRepMovement ReplicatedMovement; // 0x88
	float InitialLifeSpan; // 0xbc
	float CustomTimeDilation; // 0xc0
	FRepAttachment AttachmentReplication; // 0xc8
	AActor* Owner; // 0x108
	FName NetDriverName; // 0x110
	ENetRole Role; // 0x118
	ENetDormancy NetDormancy; // 0x119
	ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x11a
	EAutoReceiveInput AutoReceiveInput; // 0x11b
	int InputPriority; // 0x11c
	UInputComponent* InputComponent; // 0x120
	float NetCullDistanceSquared; // 0x128
	int NetTag; // 0x12c
	float NetUpdateFrequency; // 0x130
	float MinNetUpdateFrequency; // 0x134
	char bUseRelativeNetUpdateFrequency : 1; // 0x138
	char bUseOwnerRelativeNetUpdateFrequency : 1; // 0x138
	float MinRelativeNetUpdateEvaluationFrequency; // 0x13c
	float NetPriority; // 0x140
	APawn* Instigator; // 0x148
	TArray<AActor*> Children; // 0x150
	USceneComponent* RootComponent; // 0x160
	TArray<AMatineeActor*> ControllingMatineeActors; // 0x168
	TArray<FName> Layers; // 0x180
	TWeakObjectPtr<UChildActorComponent> ParentComponent; // 0x190
	TArray<FName> Tags; // 0x198
	FScriptMulticastDelegate OnTakeAnyDamage; // 0x1a8
	FScriptMulticastDelegate OnTakePointDamage; // 0x1a9
	FScriptMulticastDelegate OnTakeRadialDamage; // 0x1aa
	FScriptMulticastDelegate OnActorBeginOverlap; // 0x1ab
	FScriptMulticastDelegate OnActorEndOverlap; // 0x1ac
	FScriptMulticastDelegate OnBeginCursorOver; // 0x1ad
	FScriptMulticastDelegate OnEndCursorOver; // 0x1ae
	FScriptMulticastDelegate OnClicked; // 0x1af
	FScriptMulticastDelegate OnReleased; // 0x1b0
	FScriptMulticastDelegate OnInputTouchBegin; // 0x1b1
	FScriptMulticastDelegate OnInputTouchEnd; // 0x1b2
	FScriptMulticastDelegate OnInputTouchEnter; // 0x1b3
	FScriptMulticastDelegate OnInputTouchLeave; // 0x1b4
	FScriptMulticastDelegate OnActorHit; // 0x1b5
	FScriptMulticastDelegate OnDestroyed; // 0x1b6
	FScriptMulticastDelegate OnEndPlay; // 0x1b7
	TArray<UActorComponent*> InstanceComponents; // 0x218
	TArray<UActorComponent*> BlueprintCreatedComponents; // 0x228
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct UAssetManagerSettings : UDeveloperSettings {
	TArray<FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x38
	TArray<FDirectoryPath> DirectoriesToExclude; // 0x48
	TArray<FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x58
	TArray<FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x68
	bool bOnlyCookProductionAssets; // 0x78
	bool bShouldManagerDetermineTypeAndName; // 0x79
	bool bShouldGuessTypeAndNameInEditor; // 0x7a
	bool bShouldAcquireMissingChunksOnLoad; // 0x7b
	TArray<FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x80
	TArray<FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0x90
	TArray<FAssetManagerRedirect> AssetPathRedirects; // 0xa0
	TSet<FName> MetaDataTagsForAssetRegistry; // 0xb0
};

struct UHudSettings : UObject {
	char bShowHUD : 1; // 0x28
	TArray<FName> DebugDisplay; // 0x30
};

struct UPlayFabCloudScriptAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa0
	UPlayFabJsonObject* RequestJsonObj; // 0xa8
	UPlayFabJsonObject* ResponseJsonObj; // 0xb0
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct UBP_SQFaction_C : USQFaction {
	UDataTable* GruntVoiceTable; // 0x80
	UDataTable* SLVoiceTable; // 0x88
	SQEAlliance Alliance; // 0x90
	TSet<SQETheatersOfOperations> TheatersOfOperations; // 0x98
};

struct UMaterialExpressionClearCoatNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UViewport : UContentWidget {
	FLinearColor BackgroundColor; // 0x120
};

struct ABP_M4M203_M150_UGL_Woodland_Smoke_Blue_C : ABP_M4M203_M150_UGL_Woodland_Smoke_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UBP_M4M203_M68_UGL_HE_StaticInfo_C : UBP_M4M203_M68_UGL_Parent_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UMotionControllerComponent : UPrimitiveComponent {
	int PlayerIndex; // 0x408
	EControllerHand Hand; // 0x40c
	FName MotionSource; // 0x410
	char bDisableLowLatencyUpdate : 1; // 0x418
	ETrackingStatus CurrentTrackingStatus; // 0x41c
	bool bDisplayDeviceModel; // 0x41d
	FName DisplayModelSource; // 0x420
	UStaticMesh* CustomDisplayMesh; // 0x428
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x430
	UPrimitiveComponent* DisplayComponent; // 0x4a0
};

struct ABP_AK74MGP25_UGL_Desert_Parent_C : ABP_AK74GP25_UGL_Parent_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ABP_M4A1_M150_Foregrip_Founders_C : ABP_M4A1_M150_Foregrip_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UParticleModuleRotationOverLifetime : UParticleModuleRotationBase {
	FRawDistributionFloat RotationOverLife; // 0x30
	char Scale : 1; // 0x68
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	float ResetFloat; // 0x40
};

struct UVerticalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	FSlateChildSize Size; // 0x48
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct ASQWeapon : ASQEquipableItem {
	USQWeaponStaticInfo* WeaponStaticInfo; // 0x480
	FSQAudioComponentPool FiringAudioComponentPool; // 0x488
	FTimerHandle ZoomFinishAdsTransitionTimerHandle; // 0x580
	bool bWaitingForMagazineLoad; // 0x588
	char bFiring : 1; // 0x58c
	char bReloading : 1; // 0x58c
	FSQWeaponData WeaponConfig; // 0x590
	ESQWeaponState CurrentState; // 0x650
	float ADSMoveSpeedMultiplier; // 0x654
	bool bAimingDownSights; // 0x658
	bool bFireInput; // 0x659
	bool bPendingFire; // 0x65a
	float MaxTimeToLoopSoundsAfterLastFire; // 0x668
	float ModifiedTacticalReloadDuration; // 0x66c
	float ModifiedDryReloadDuration; // 0x670
	int CurrentFireMode; // 0x690
	TArray<FSQMagazineData> Magazines; // 0x6a0
	TArray<USQWeaponAttachment*> AttachmentClasses; // 0x6b0
	TArray<USQWeaponAttachment*> Attachments; // 0x6c0
	UADSPostProcessSettings* ADSPostProcessSettings; // 0x6d0
	bool bUseStopADSPPDrawing; // 0x6d8
	bool bStopADSPPDrawing; // 0x6d9
	FSQDynamicEasingStruct HoldingZoomEasing; // 0x6dc
	float HoldingZoomEasingAlpha; // 0x6f0
	float HoldingZoomRawAlpha; // 0x6f4
	float HoldingZoomIntermediateAlpha; // 0x6f8
	float HoldingZoomTargetAlpha; // 0x6fc
	float CurrentFOV; // 0x700
	float ZoomedFOV; // 0x704
	float FocusZoomTime; // 0x708
	float FocusAdditionalZoom; // 0x70c
	float TimeSinceLastZoomToggle; // 0x710
	float LastZoomProgressAtToggle; // 0x714
	float AdjustAdsSightItemAnimPos; // 0x718
	float CachedAdjustAdsSightItemAnimPos; // 0x71c
	float NewAdjustAdsSightItemAnimPos; // 0x720
	float AdjustAdsSightItemAnimPosAlpha; // 0x724
	int MaxConcurrentSounds; // 0x728
	float MaxConcurrentSoundsFadeOut; // 0x72c
	bool bIs1PUsingSquadSoundNodeLooping; // 0x730
	bool bIs3PUsingSquadSoundNodeLooping; // 0x731
	UAudioComponent* CurrentFiringAC; // 0x738
	TArray<UAudioComponent*> FiringACs; // 0x740
	USoundCue* SemiAutoSound1P; // 0x750
	USoundCue* SemiAutoSound3P; // 0x758
	USoundCue* StartingSound1P; // 0x760
	USoundCue* StartingSound3P; // 0x768
	bool bIsModifyingZeroing; // 0x780
	int AdjustableSightItemPos; // 0x784
	float CachedLastZeroingTime; // 0x788
	float CachedLastZeroingPlayTime; // 0x78c
	int CachedLastZeroingPosition; // 0x790
	bool bCachedIsBipodDeployed; // 0x794
	bool bCachedAimProneBobbing; // 0x795
	bool bFinishedAdsTransition; // 0x796
	bool bLastNewZoom; // 0x797
	bool FireSwaySelector; // 0x798
	bool PreFireSwaySelector; // 0x799
};

struct UMaterialExpressionWorldPosition : UMaterialExpression {
	EWorldPositionIncludedOffsets WorldPositionShaderOffset; // 0x40
};

struct UMovieScene2DTransformSection : UMovieSceneSection {
	FMovieScene2DTransformMask TransformMask; // 0xe0
	FMovieSceneFloatChannel Translation[0x2]; // 0xe8
	FMovieSceneFloatChannel Rotation; // 0x228
	FMovieSceneFloatChannel Scale[0x2]; // 0x2c8
	FMovieSceneFloatChannel Shear[0x2]; // 0x408
};

struct UARSaveWorldAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FScriptMulticastDelegate OnSuccess; // 0x50
	FScriptMulticastDelegate OnFailed; // 0x60
};

struct USQTeamDataCacher : UActorComponent {
	TArray<UObject*> LoadedClasses; // 0xd8
	TArray<UObject*> LoadedCDOs; // 0xe8
};

struct UBP_L85A2_ElcanLDS_Foregrip_StaticInfo_C : UBP_L85A2_Foregrip_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UCreateSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnSuccess; // 0x28
	FScriptMulticastDelegate OnFailure; // 0x38
};

struct UMaterialExpressionTangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UMaterialExpressionRound : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleLifetime_Seeded : UParticleModuleLifetime {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x68
};

struct UBP_SQFactionSetup_C : USQFactionSetup {
	ESQFactionSetupType Type; // 0xd8
	TSet<ESQFactionSetupTag> Tags; // 0xe0
	bool CanUseCommanderActionNearVehicle; // 0x130
	bool HasBuddyRally; // 0x131
	TArray<FSQRoleGroupingStrategy> RoleGroupingStrategies; // 0x138
	TArray<FSQRoleGroupingStrategy> RoleCategories; // 0x148
	TArray<FSQRoleGroupingStrategy> RoleGroupingTags; // 0x158
	TArray<FSQDeployableGroupingStrategy> DeployableGroupingStrategies; // 0x168
	TArray<FSQActionGroupingStrategy> ActionGroupingStrategies; // 0x178
};

struct USQSquadStateDataMapMarker : USQSquadStateMapData {
	UTexture2D* Texture; // 0x180
	FLinearColor Tint; // 0x188
	int FireTeamId; // 0x198
};

struct USQCompassBaseUnit : USQUserWidget {
	UImage* BaseImage; // 0x230
};

struct USQMapWidgetCaptureZone : USQMapWidget {
	FText FlagName; // 0x2a8
	UTexture2D* FlagTexture; // 0x2c0
	UTexture2D* DefaultFlag; // 0x2e8
	char bUncappable : 1; // 0x310
	ESQContestingState ContestingState; // 0x314
	char OwningTeam; // 0x315
	char CapturingTeam; // 0x316
	float CapturePercent; // 0x318
};

struct UFieldSystemMetaDataProcessingResolution : UFieldSystemMetaData {
	EFieldResolutionType ResolutionType; // 0xd8
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x28
};

struct UBTTask_SetTagCooldown : UBTTaskNode {
	FGameplayTag CooldownTag; // 0x70
	bool bAddToExistingDuration; // 0x78
	float CooldownDuration; // 0x7c
};

struct UBlackboardComponent : UActorComponent {
	UBrainComponent* BrainComp; // 0xd8
	UBlackboardData* BlackboardAsset; // 0xe0
	TArray<UBlackboardKeyType*> KeyInstances; // 0x108
};

struct UTextureCube : UTexture {
	FGuid LightingGuid; // 0x48
	int LODBias; // 0x58
	TextureCompressionSettings CompressionSettings; // 0x5c
	TextureFilter Filter; // 0x5d
	ETextureMipLoadOptions MipLoadOptions; // 0x5e
	TextureGroup LODGroup; // 0x5f
	char SRGB : 1; // 0x60
	char bNoTiling : 1; // 0x60
	char VirtualTextureStreaming : 1; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x68
};

struct UBP_AK74MGP25_UGL_Reflex_Parent_StaticInfo_C : UBP_AK74GP25_UGL_Parent_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct UShadowMapTexture2D : UTexture2D {
	EShadowMapFlags ShadowmapFlags; // 0x100
};

struct USQMagazineWidget : USQUserWidget {
	UImage* SelectedImage; // 0x230
	UImage* AmmoImage; // 0x238
};

struct ULevel : UObject {
	UWorld* OwningWorld; // 0xb8
	UModel* Model; // 0xc0
	TArray<UModelComponent*> ModelComponents; // 0xc8
	ULevelActorContainer* ActorCluster; // 0xd8
	int NumTextureStreamingUnbuiltComponents; // 0xe0
	int NumTextureStreamingDirtyResources; // 0xe4
	ALevelScriptActor* LevelScriptActor; // 0xe8
	ANavigationObjectBase* NavListStart; // 0xf0
	ANavigationObjectBase* NavListEnd; // 0xf8
	TArray<UNavigationDataChunk*> NavDataChunks; // 0x100
	float LightmapTotalSize; // 0x110
	float ShadowmapTotalSize; // 0x114
	TArray<FVector> StaticNavigableGeometry; // 0x118
	TArray<FGuid> StreamingTextureGuids; // 0x128
	FGuid LevelBuildDataId; // 0x1d0
	UMapBuildDataRegistry* MapBuildData; // 0x1e0
	FIntVector LightBuildLevelOffset; // 0x1e8
	char bIsLightingScenario : 1; // 0x1f4
	char bTextureStreamingRotationChanged : 1; // 0x1f4
	char bStaticComponentsRegisteredInStreamingManager : 1; // 0x1f4
	char bIsVisible : 1; // 0x1f4
	AWorldSettings* WorldSettings; // 0x240
	TArray<UAssetUserData*> AssetUserData; // 0x250
	TArray<FReplicatedStaticActorDestructionInfo> DestroyedReplicatedStaticActors; // 0x270
};

struct UPlayFabClientAPI : UOnlineBlueprintCallProxyBase {
	FScriptMulticastDelegate OnPlayFabResponse; // 0x28
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xa40
	UPlayFabJsonObject* RequestJsonObj; // 0xa48
	UPlayFabJsonObject* ResponseJsonObj; // 0xa50
};

struct ABP_M110_Optic_C : ABP_GenericRifle_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ASQSquadStatePrivateToTeam : AInfo {
	ASQSquad* AuthoritySquad; // 0x250
	ASQTeamStatePrivate* PrivateTeamState; // 0x258
	ASQSquadState* SquadState; // 0x260
};

struct UMaterialInstanceConstant : UMaterialInstance {
	UPhysicalMaterial* PhysMaterial; // 0x88
	UMaterialInterface* Parent; // 0x90
	char bHasStaticPermutationResource : 1; // 0x9a
	char bOverrideSubsurfaceProfile : 1; // 0x9a
	TArray<FScalarParameterValue> ScalarParameterValues; // 0xa0
	TArray<FVectorParameterValue> VectorParameterValues; // 0xb0
	TArray<FTextureParameterValue> TextureParameterValues; // 0xc0
	TArray<FFontParameterValue> FontParameterValues; // 0xd0
	FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0xe0
	TArray<UObject*> PermutationTextureReferences; // 0xf8
	FStaticParameterSet StaticParameters; // 0x108
};

struct USQMapWidgetPawn : USQMapWidget {
	char bIsOwned : 1; // 0x2a8
	char bIsOwnedBySelf : 1; // 0x2a8
	char bIsInSelfTeam : 1; // 0x2a8
	char bIsInSelfSquad : 1; // 0x2a8
	int FireTeamIndex; // 0x2ac
	float CameraRotationYaw; // 0x2b0
	float IsSelfZOrder; // 0x2b4
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x218
	float Brightness; // 0x228
	float Intensity; // 0x22c
	FColor LightColor; // 0x230
	char bAffectsWorld : 1; // 0x234
	char CastShadows : 1; // 0x234
	char CastStaticShadows : 1; // 0x234
	char CastDynamicShadows : 1; // 0x234
	char bAffectTranslucentLighting : 1; // 0x234
	char bTransmission : 1; // 0x234
	char bCastVolumetricShadow : 1; // 0x234
	char bCastRaytracedShadow : 1; // 0x234
	char bAffectReflection : 1; // 0x235
	char bAffectGlobalIllumination : 1; // 0x235
	float IndirectLightingIntensity; // 0x238
	float VolumetricScatteringIntensity; // 0x23c
	int SamplesPerPixel; // 0x240
};

struct USkeletalBodySetup : UBodySetup {
	bool bSkipScaleFromAnimation; // 0x240
	TArray<FPhysicalAnimationProfile> PhysicalAnimationData; // 0x248
};

struct USoundCue : USoundBase {
	char bOverrideAttenuation : 1; // 0x110
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x110
	USoundNode* FirstNode; // 0x118
	float VolumeMultiplier; // 0x120
	float PitchMultiplier; // 0x124
	FSoundAttenuationSettings AttenuationOverrides; // 0x128
	float SubtitlePriority; // 0x410
	char bHasPlayWhenSilent : 1; // 0x418
};

struct ASQGameModeRuleset : ASQGameRuleSet {
	TArray<FSQInventoryMod> InventoryModifications; // 0x270
	FText PlayerJoinedMessageToPlayer; // 0x280
	TArray<FSQGameModeRules> RulesToBeShownWhenPlayersJoinATeam; // 0x298
};

struct USQCompassMarker : USQCompassBaseUnit {
	FLinearColor MarkerColor; // 0x238
	UCurveFloat* DistanceResolutionCurveInMeters; // 0x248
	ASQMapMarker* MapMarker; // 0x250
	FSQMapMarkerVisualData MapMarkerVisualData; // 0x258
	UTextBlock* DistanceTextBlock; // 0x320
	UTextBlock* MeterTextBlock; // 0x328
};

struct USQRadialButton : USQBaseButton {
	ESQRadialWidgetSizeEnum RadialWidgetSize; // 0x2e8
	float RadialWidgetAngle; // 0x2ec
	USoundCue* MouseEnterSoundCue; // 0x2f0
};

struct USQSquadStateDataAmmoCrate : USQSquadStateDataDeployable {
	ESQBuildState BuildState; // 0x180
};

struct USQFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	UObject* WorldContextObject; // 0x80
};

struct USQVehicleWheel_Front : UVehicleWheel {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float PhysMatDampingRateMultiplier; // 0x50
	float SteerAngle; // 0x54
	bool bAffectedByHandbrake; // 0x58
	UTireType* TireType; // 0x60
	UTireConfig* TireConfig; // 0x68
	float LatStiffMaxLoad; // 0x70
	float LatStiffValue; // 0x74
	float LongStiffValue; // 0x78
	float SuspensionForceOffset; // 0x7c
	float SuspensionMaxRaise; // 0x80
	float SuspensionMaxDrop; // 0x84
	float SuspensionNaturalFrequency; // 0x88
	float SuspensionDampingRatio; // 0x8c
	EWheelSweepType SweepType; // 0x90
	float MaxBrakeTorque; // 0x94
	float MaxHandBrakeTorque; // 0x98
	UWheeledVehicleMovementComponent* VehicleSim; // 0xa0
	int WheelIndex; // 0xa8
	float DebugLongSlip; // 0xac
	float DebugLatSlip; // 0xb0
	float DebugNormalizedTireLoad; // 0xb4
	float DebugWheelTorque; // 0xbc
	float DebugLongForce; // 0xc0
	float DebugLatForce; // 0xc4
	FVector Location; // 0xc8
	FVector OldLocation; // 0xd4
	FVector Velocity; // 0xe0
};

struct ABP_AAS_DefendMarker_C : ASQMapMarker {
	USceneComponent* DefaultSceneRoot; // 0x280
};

struct UMaterialExpressionTextureObjectParameter : UMaterialExpressionTextureSampleParameter {
	FName ParameterName; // 0xe0
	FGuid ExpressionGUID; // 0xe8
	FName Group; // 0xf8
};

struct ASQCommandActor : AActor {
	float distance; // 0x248
	USQGridData_CommandOption* Action; // 0x250
	int Team; // 0x258
	TWeakObjectPtr<AController> DamageInstigatorController; // 0x25c
};

struct UParticleModuleBeamTarget : UParticleModuleBeamBase {
	Beam2SourceTargetMethod TargetMethod; // 0x30
	FName TargetName; // 0x34
	FRawDistributionVector Target; // 0x40
	char bTargetAbsolute : 1; // 0x90
	char bLockTarget : 1; // 0x90
	Beam2SourceTargetTangentMethod TargetTangentMethod; // 0x94
	FRawDistributionVector TargetTangent; // 0x98
	char bLockTargetTangent : 1; // 0xe8
	FRawDistributionFloat TargetStrength; // 0xf0
	char bLockTargetStength : 1; // 0x128
	float LockRadius; // 0x12c
};

struct ASQBoundary : AActor {
	USplineComponent* XYBoundary; // 0x248
	bool bXYBoundaryTangetsInwards; // 0x250
	int BoundaryMaskSizeX; // 0x254
	int BoundaryMaskSizeY; // 0x258
	UTexture2D* BoundaryMask; // 0x260
	float CeilingHeight; // 0x268
	float FloorHeight; // 0x26c
	float CheckDelaySeconds; // 0x270
	bool bDefaultToInside; // 0x274
	bool bComplexCheck; // 0x275
	TMap<USQBoundaryListener*, FSQBoundaryListenerData> ListenerDatas; // 0x278
	TArray<char> BoundaryMaskData; // 0x2f0
};

struct ALandscapeMeshProxyActor : AActor {
	ULandscapeMeshProxyComponent* LandscapeMeshProxyComponent; // 0x248
};

struct UBP_Attachment_M68_NoAds_Founder_C : UBP_Attachment_M68_Founder_C {
	float MeshTransitionPercentage; // 0x4b0
	UStaticMesh* ADSMesh; // 0x4b8
	FTransform ADSMeshTransform; // 0x4c0
	UStaticMesh* NonADSMesh; // 0x4f0
	FTransform NonADSMeshTransform; // 0x500
	TArray<FSQMeshTransitionSettings> InToADSMeshTransitionSettings; // 0x530
	TArray<FSQMeshTransitionSettings> OutFromADSMeshTransitionSettings; // 0x540
};

struct UMaterialExpressionVertexInterpolator : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct USQCoreStateComponent : UActorComponent {
	USQCoreStateData* DataClass; // 0xd8
	USQCoreStateData* DataObject; // 0xe8
	TArray<USQCoreStateConnection*> Connections; // 0xf0
};

struct UBehaviorTree : UObject {
	UBTCompositeNode* RootNode; // 0x28
	UBlackboardData* BlackboardAsset; // 0x30
	TArray<UBTDecorator*> RootDecorators; // 0x38
	TArray<FBTDecoratorLogic> RootDecoratorOps; // 0x48
};

struct UGeometryCacheCodecRaw : UGeometryCacheCodecBase {
	int DummyProperty; // 0x38
};

struct ABP_M4_Recruit_C : ABP_M4A1_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct ALightmassCharacterIndirectDetailVolume : AVolume {
	EBrushType BrushType; // 0x248
	FColor BrushColor; // 0x24c
	int PolyFlags; // 0x250
	char bColored : 1; // 0x254
	char bSolidWhenSelected : 1; // 0x254
	char bPlaceableFromClassBrowser : 1; // 0x254
	char bNotForClientOrServer : 1; // 0x254
	UModel* Brush; // 0x258
	UBrushComponent* BrushComponent; // 0x260
	char bInManipulation : 1; // 0x268
	TArray<FGeomSelection> SavedSelections; // 0x270
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x58
	char bFireEventsWhenBackwards : 1; // 0x58
	EFireEventsAtPosition EventPosition; // 0x5c
	TArray<FMovieSceneObjectBindingID> EventReceivers; // 0x60
	TArray<UMovieSceneSection*> Sections; // 0x70
};

struct UBP_RPG7Parent_StaticInfo_C : UBP_GenericWeapon_StaticInfo_C {
	UAnimMontage* ReloadBipodWeaponMontage; // 0x4f8
	UAnimMontage* ReloadBipod1pMontage; // 0x500
	UAnimMontage* ReloadBipod3pMontage; // 0x508
	UAnimMontage* ReloadDryWeaponMontage; // 0x510
	UAnimMontage* ReloadDry1pMontage; // 0x518
	UAnimMontage* ReloadDry3pMontage; // 0x520
	UAnimMontage* ReloadDryBipodWeaponMontage; // 0x528
	UAnimMontage* ReloadDryBipod1pMontage; // 0x530
	UAnimMontage* ReloadDryBipod3pMontage; // 0x538
	TArray<UAnimMontage*> RandomFire1pMontage; // 0x540
	UAnimMontage* FireAdd3pMontage; // 0x550
	UAnimMontage* FireTriggerWeaponMontage; // 0x558
	UAnimMontage* FireTrigger1pMontage; // 0x560
	UAnimMontage* FireTrigger3pMontage; // 0x568
	UAnimMontage* FireSway1pMontage; // 0x570
	UAnimMontage* FireSway1pBlendInMontage; // 0x578
	UAnimMontage* FireAds1pMontage; // 0x580
	UAnimMontage* FireAds3pMontage; // 0x588
	UAnimMontage* FireBipodWeaponMontage; // 0x590
	UAnimMontage* FireBipod1pMontage; // 0x598
	UAnimMontage* FireBipod3pMontage; // 0x5a0
	UAnimMontage* FireAddBipod1pMontage; // 0x5a8
	UAnimMontage* FireAddBipod3pMontage; // 0x5b0
	FSQMontageSectionNames BipodEndLoopSectionNames; // 0x5b8
	UAnimMontage* BipodWeaponMontage; // 0x5e0
	UAnimMontage* Bipod1pMontage; // 0x5e8
	UAnimMontage* Bipod3pMontage; // 0x5f0
	UAnimMontage* FiremodeBipodMontage; // 0x5f8
	UAnimMontage* FiremodeBipodWeaponMontage; // 0x600
	UAnimMontage* FiremodeMontage; // 0x608
	UAnimMontage* FiremodeWeaponMontage; // 0x610
	UAnimMontage* BobbingAimProneSway1pMontage; // 0x618
	UAnimMontage* BobbingAim1pMontage; // 0x620
	float MuzzleFlashCullDistanceInMeters; // 0x628
	FName MuzzleFlashEffectSocket; // 0x62c
	UParticleSystem* MuzzleFlashEffect1P; // 0x638
	UParticleSystem* MuzzleFlashEffect3P; // 0x640
	float ShellEjectionCullDistanceInMeters; // 0x648
	FName ShellEjectionEffectSocket; // 0x64c
	UParticleSystem* ShellEjectionEffect1p; // 0x658
	UParticleSystem* ShellEjectionEffect3p; // 0x660
	float RecoilCameraOffsetFactor; // 0x668
	float RecoilCameraOffsetInterpSpeed; // 0x66c
	float RecoilLofCameraOffsetLimit; // 0x670
	float RecoilLofAttackInterpSpeed; // 0x674
	float RecoilCanReleaseInterpSpeed; // 0x678
	float RecoilLofReleaseInterpSpeed; // 0x67c
	float RecoilWeaponRelLocFactor; // 0x680
	float RecoilCameraShotInterpSpeed; // 0x684
	float RecoilAdsCameraShotInterpSpeed; // 0x688
	float MoveRecoilFactorRelease; // 0x68c
	float AddMoveRecoil; // 0x690
	float MaxMoveRecoilFactor; // 0x694
	float MinMoveRecoilFactor; // 0x698
	float LowStaminaRecoilFactor; // 0x69c
	float FullStaminaRecoilFactor; // 0x6a0
	FVector ProneAdsRecoilMean; // 0x6a4
	FVector ProneAdsRecoilSigma; // 0x6b0
	FVector ProneRecoilMean; // 0x6bc
	FVector ProneRecoilSigma; // 0x6c8
	FVector CrouchAdsRecoilMean; // 0x6d4
	FVector CrouchAdsRecoilSigma; // 0x6e0
	FVector CrouchRecoilMean; // 0x6ec
	FVector CrouchRecoilSigma; // 0x6f8
	FVector StandAdsRecoilMean; // 0x704
	FVector StandAdsRecoilSigma; // 0x710
	FVector StandRecoilMean; // 0x71c
	FVector StandRecoilSigma; // 0x728
	FVector ProneTransitionRecoilMean; // 0x734
	FVector ProneTransitionRecoilSigma; // 0x740
	FVector BipodAdsRecoilMean; // 0x74c
	FVector BipodAdsRecoilSigma; // 0x758
	FVector BipodRecoilMean; // 0x764
	FVector BipodRecoilSigma; // 0x770
	float DeviationVisuFbInterpSpeed_YZ; // 0x77c
	float DeviationVisuFbInterpSpeed_Final; // 0x780
	float DeviationVisuFbMax; // 0x784
	float MinShotDeviationFactor; // 0x788
	float MaxShotDeviationFactor; // 0x78c
	float AddShotDeviationFactor; // 0x790
	float AddShotDeviationFactorAds; // 0x794
	float ShotDeviationFactorRelease; // 0x798
	float LowStaminaDeviationFactor; // 0x79c
	float FullStaminaDeviationFactor; // 0x7a0
	float MoveDeviationFactorRelease; // 0x7a4
	float AddMoveDeviation; // 0x7a8
	float MaxMoveDeviationFactor; // 0x7ac
	float MinMoveDeviationFactor; // 0x7b0
	float MinBipodAdsDeviation; // 0x7b4
	float MinBipodDeviation; // 0x7b8
	float MinProneAdsDeviation; // 0x7bc
	float MinProneDeviation; // 0x7c0
	float MinCrouchAdsDeviation; // 0x7c4
	float MinCrouchDeviation; // 0x7c8
	float MinStandAdsDeviation; // 0x7cc
	float MinStandDeviation; // 0x7d0
	float MinProneTransitionDeviation; // 0x7d4
	float SwayInterpSpeed_YZ; // 0x7d8
	float SwayInterpSpeed_Final; // 0x7dc
	float HasSway; // 0x7e0
	float MoveSwayFactorRelease; // 0x7e4
	float AddMoveSway; // 0x7e8
	float MinMoveSwayFactor; // 0x7ec
	float MaxMoveSwayFactor; // 0x7f0
	float LowStaminaSwayFactor; // 0x7f4
	float FullStaminaSwayFactor; // 0x7f8
	float HoldingBreathSwayFactor; // 0x7fc
	float ProneAdsSwayMin; // 0x800
	float ProneSwayMin; // 0x804
	float CrouchAdsSwayMin; // 0x808
	float CrouchSwayMin; // 0x80c
	float StandAdsSwayMin; // 0x810
	float StandSwayMin; // 0x814
	float ProneTransitionSwayMin; // 0x818
	bool bHasBipod; // 0x81c
	float BipodLength; // 0x820
	float BipodHeightRaw; // 0x824
	bool bHasAdjustableSight; // 0x828
	bool bLeanHeadWhenAds; // 0x829
	TArray<FSQAdjustableSightMontageSet> AdsSightsAnim; // 0x830
	UAnimMontage* BaseAds1pMontage; // 0x840
	UAnimMontage* AdsTransition1pMontage; // 0x848
	UAnimMontage* FromAdsTransition1pMontage; // 0x850
	UAnimSequence* AdjustableAdsSightItemAnim; // 0x858
	float AdjustableAdsSightItemFrameRate; // 0x860
	bool bHasAdsTransition; // 0x864
	FVector Aim1pWeaponMeshPosition; // 0x868
	FVector Aim1pWeaponMeshRescale; // 0x874
	float Steady1pHipFireDuration; // 0x880
	bool bPlaySoundOnMagEmpty; // 0x884
	int PlaySoundOnEmptyUse; // 0x888
	int PlaySoundOnEmptyAltUse; // 0x88c
	USoundCue* ToggleFiremodeSound1P; // 0x890
	USoundCue* ToggleFiremodeSound3P; // 0x898
	USoundCue* FromAdsSound1p; // 0x8a0
	USoundCue* FromAdsSound3p; // 0x8a8
	USoundCue* ToAdsSound1p; // 0x8b0
	USoundCue* ToAdsSound3p; // 0x8b8
	USoundCue* SightSwitchingSound1p; // 0x8c0
	USoundCue* SightSwitchingSound3p; // 0x8c8
	USoundCue* MagEmptySound1p; // 0x8d0
	USoundCue* MagEmptySound3p; // 0x8d8
	USoundCue* EmptyUseSound1p; // 0x8e0
	USoundCue* EmptyUseSound3p; // 0x8e8
	USoundCue* EmptyAltUseSound1p; // 0x8f0
	USoundCue* EmptyAltUseSound3p; // 0x8f8
	FSQMontageSectionNames BobbingAimEndLoopSectionNames; // 0x900
	FText DefaultZeroingText; // 0x928
	FName AimDirectionSocketName; // 0x940
	bool bShowZeroingInHud; // 0x948
};

struct USQItemAnimInstance : USQAnimInstance {
	bool bPlay1PAnimNotifiesWhenInFirstPerson; // 0x290
	bool bPlay3PAnimNotifiesWhenInFirstPerson; // 0x291
};

struct USQSquadSelection : USQUserWidget {
	ASQPlayerController* OwnerPlayerController; // 0x230
	UCanvasPanel* CreateSquadCanvas; // 0x238
	USQCreateSquadButton* CreateSquadButton; // 0x240
	UEditableTextBox* SquadNameTextBox; // 0x248
	UScrollBox* SquadsList; // 0x250
	FScriptMulticastDelegate OnNewSquadCreated; // 0x258
};

struct UMaterialExpressionConstant : UMaterialExpression {
	float R; // 0x40
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x840
	float CheckpointSaveMaxMSPerFrame; // 0xc44
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xc78
	bool bIsLocalReplay; // 0xc88
	TArray<APlayerController*> SpectatorControllers; // 0xc90
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe0
};

struct ABP_AKS74_C : ABP_AK74_C {
	UMaterialParameterCollection* AdsScopeFovParameterCollection; // 0x7a0
	FName AdsScopeFovParameterName; // 0x7a8
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x40
	char bIsRuntimeLabel : 1; // 0x40
	TArray<UObject*> ExplicitAssets; // 0x48
	TArray<UClass*> ExplicitBlueprints; // 0x58
	FCollectionReference AssetCollection; // 0x68
};

struct UWidgetComponent : UMeshComponent {
	EWidgetSpace Space; // 0x430
	EWidgetTimingPolicy TimingPolicy; // 0x431
	UUserWidget* WidgetClass; // 0x438
	FIntPoint DrawSize; // 0x440
	bool bManuallyRedraw; // 0x448
	bool bRedrawRequested; // 0x449
	float RedrawTime; // 0x44c
	FIntPoint CurrentDrawSize; // 0x458
	bool bDrawAtDesiredSize; // 0x460
	FVector2D Pivot; // 0x464
	bool bReceiveHardwareInput; // 0x46c
	bool bWindowFocusable; // 0x46d
	EWindowVisibility WindowVisibility; // 0x46e
	bool bApplyGammaCorrection; // 0x46f
	ULocalPlayer* OwnerPlayer; // 0x470
	FLinearColor BackgroundColor; // 0x478
	FLinearColor TintColorAndOpacity; // 0x488
	float OpacityFromTexture; // 0x498
	EWidgetBlendMode BlendMode; // 0x49c
	bool bIsTwoSided; // 0x49d
	bool TickWhenOffscreen; // 0x49e
	UUserWidget* Widget; // 0x4a0
	UBodySetup* BodySetup; // 0x4c8
	UMaterialInterface* TranslucentMaterial; // 0x4d0
	UMaterialInterface* TranslucentMaterial_OneSided; // 0x4d8
	UMaterialInterface* OpaqueMaterial; // 0x4e0
	UMaterialInterface* OpaqueMaterial_OneSided; // 0x4e8
	UMaterialInterface* MaskedMaterial; // 0x4f0
	UMaterialInterface* MaskedMaterial_OneSided; // 0x4f8
	UTextureRenderTarget2D* RenderTarget; // 0x500
	UMaterialInstanceDynamic* MaterialInstance; // 0x508
	bool bAddedToScreen; // 0x510
	bool bEditTimeUsable; // 0x511
	FName SharedLayerName; // 0x514
	int LayerZOrder; // 0x51c
	EWidgetGeometryMode GeometryMode; // 0x520
	float CylinderArcAngle; // 0x524
};

struct USQReplicationGraphNode_GridSpatialization2DEx : UReplicationGraphNode_GridSpatialization2D {
	TSet<UNetReplicationGraphConnection*> AvoidCullingConnections; // 0x240
};

struct USQProjectileSpawnerComponent : USceneComponent {
	UClass* ProjectileClass; // 0x218
	UClass* TracerProjectileClass; // 0x240
	float MuzzleVelocity; // 0x268
	float MaxDamageToApply; // 0x26c
	bool bCreatedOnServerForDamage; // 0x270
	float TimeBetweenShots; // 0x274
	int RoundsBetweenTracer; // 0x278
	float ShotDeviation; // 0x27c
	int ShotCounter; // 0x280
	bool bIsFiring; // 0x284
	FScriptMulticastDelegate OnFired; // 0x288
	FScriptMulticastDelegate OnStartFiring; // 0x298
	FScriptMulticastDelegate OnStopFiring; // 0x2a8
};

struct UGridPanel : UPanelWidget {
	TArray<float> ColumnFill; // 0x120
	TArray<float> RowFill; // 0x130
};

struct UInputSettings : UObject {
	TArray<FInputAxisConfigEntry> AxisConfig; // 0x28
	char bAltEnterTogglesFullscreen : 1; // 0x38
