// Created by BlueFire1337
// Updated 2022-01-27
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x738a640;
	constexpr auto GObjects = 0x73a3020;
	constexpr auto GWorld = 0x74ebab0;
	constexpr auto GetDecryptArgFn = 0x29ba150;
	constexpr auto DecryptNameEntryFn = 0x2810e90;
}

struct AWheeledVehicle : APawn {
	USkeletalMeshComponent* Mesh; // 0x398
	UWheeledVehicleMovementComponent* VehicleMovement; // 0x3a0
};

struct UUW-MouseRightClick_C : UUserWidget {
	UWidgetAnimation* Ani_MouseRight; // 0x248
	UImage* Image; // 0x250
	UImage* Image_2; // 0x258
	UImage* Image_292; // 0x260
	UImage* Image_503; // 0x268
};

struct UBravoHotelSceneCaptureComponent2D : USceneCaptureComponent2D {
	float TickRate; // 0x938
};

struct UGamePlayWidget_C : UBravoHotelSettingSubWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	USlotItemWidget_C* AmmoEffect; // 0x2a0
	USlotItemWidget_C* AR; // 0x2a8
	USlotItemWidget_C* AutoLadder; // 0x2b0
	USlotItemWidget_C* autoReload; // 0x2b8
	USlotItemWidget_C* AutoUseMedicalLv1; // 0x2c0
	USlotItemWidget_C* AutoUseMedicalLv2; // 0x2c8
	USlotItemWidget_C* AutoUseMedicalLv3; // 0x2d0
	USlotItemWidget_C* BlueBoostEffect; // 0x2d8
	USlotItemWidget_C* CrossHair; // 0x2e0
	USubTitleSlotWidget_C* CustsomUseItem; // 0x2e8
	USlotItemWidget_C* DMR; // 0x2f0
	USlotItemWidget_C* GreenBoostEffect; // 0x2f8
	USlotItemWidget_C* ImmediateAttachment; // 0x300
	USlotItemWidget_C* InheritAttachment; // 0x308
	USubTitleSlotWidget_C* inventory; // 0x310
	USlotItemWidget_C* InventoryOrder; // 0x318
	USlotItemWidget_C* InventoryScrollSpeed; // 0x320
	USlotItemWidget_C* MedicalLv1Effect; // 0x328
	USlotItemWidget_C* MedicalLv2Effect; // 0x330
	USlotItemWidget_C* MedicalLv3Effect; // 0x338
	USlotItemWidget_C* NetworkDebug; // 0x340
	USlotItemWidget_C* Pistol; // 0x348
	USlotItemWidget_C* RedBoostEffect; // 0x350
	UScrollBox* ScrollBox_55; // 0x358
	USlotItemWidget_C* SearchExpertWeaponMaterialItem; // 0x360
	USlotItemWidget_C* SearchMaterialItem; // 0x368
	USlotItemWidget_C* ShowDamageLog; // 0x370
	USlotItemWidget_C* ShowGuideWidget; // 0x378
	USlotItemWidget_C* ShowPerkSlot; // 0x380
	USlotItemWidget_C* ShowSmartPing; // 0x388
	USlotItemWidget_C* ShowSmartPingLightPole; // 0x390
	USlotItemWidget_C* ShowSmartPingSupplyBox; // 0x398
	USlotItemWidget_C* ShowUseaableItemEffect; // 0x3a0
	USlotItemWidget_C* SMG; // 0x3a8
	USlotItemWidget_C* SR; // 0x3b0
	USlotItemWidget_C* Tutorial; // 0x3b8
	USlotItemWidget_C* Tutorial_RePlay; // 0x3c0
	USlotItemWidget_C* UseItem1; // 0x3c8
	USlotItemWidget_C* UseItem2; // 0x3d0
	USlotItemWidget_C* UseItem3; // 0x3d8
	USlotItemWidget_C* UseItem4; // 0x3e0
	USlotItemWidget_C* UseItem5; // 0x3e8
	USlotItemWidget_C* UseItem6; // 0x3f0
	USlotItemWidget_C* UseItem7; // 0x3f8
	USlotItemWidget_C* UseItem8; // 0x400
	UVerticalBox* VerticalBox_154; // 0x408
	USubTitleSlotWidget_C* z; // 0x410
	USubTitleSlotWidget_C* яд; // 0x418
	USubTitleSlotWidget_C* pt; // 0x420
	FTimerHandle ScrollBarTimer; // 0x428
};

struct ULuminApplicationLifecycleComponent : UApplicationLifecycleComponent {
	FMulticastInlineDelegate DeviceHasReactivatedDelegate; // 0x140
	FMulticastInlineDelegate DeviceWillEnterRealityModeDelegate; // 0x150
	FMulticastInlineDelegate DeviceWillGoInStandbyDelegate; // 0x160
	FMulticastInlineDelegate FocusLostDelegate; // 0x170
	FMulticastInlineDelegate FocusGainedDelegate; // 0x180
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x328
	float CraneYaw; // 0x32c
	float CraneArmLength; // 0x330
	bool bLockMountPitch; // 0x334
	bool bLockMountYaw; // 0x335
	USceneComponent* TransformComponent; // 0x338
	USceneComponent* CraneYawControl; // 0x340
	USceneComponent* CranePitchControl; // 0x348
	USceneComponent* CraneCameraMount; // 0x350
};

struct UInterpGroup : UObject {
	TArray<UInterpTrack*> InterpTracks; // 0x30
	FName GroupName; // 0x40
	FColor GroupColor; // 0x48
	char bCollapsed : 1; // 0x4c
	char bVisible : 1; // 0x4c
	char bIsFolder : 1; // 0x4c
	char bIsParented : 1; // 0x4c
	char bIsSelected : 1; // 0x4c
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct UEnvQueryGenerator_Composite : UEnvQueryGenerator {
	TArray<UEnvQueryGenerator*> Generators; // 0x50
	char bAllowDifferentItemTypes : 1; // 0x60
	char bHasMatchingItemType : 1; // 0x60
	UEnvQueryItemType* ForcedItemType; // 0x68
};

struct URadialFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	float Radius; // 0xc0
	FVector Position; // 0xc4
	EFieldFalloffType Falloff; // 0xd0
};

struct ULandscapeSplineSegment : UObject {
	FLandscapeSplineSegmentConnection Connections[0x2]; // 0x28
	FInterpCurveVector SplineInfo; // 0x58
	TArray<FLandscapeSplineInterpPoint> Points; // 0x70
	FBox Bounds; // 0x80
	TArray<USplineMeshComponent*> LocalMeshComponents; // 0xa0
};

struct AGameNetworkManager : AInfo {
	float BadPacketLossThreshold; // 0x328
	float SeverePacketLossThreshold; // 0x32c
	int32_t BadPingThreshold; // 0x330
	int32_t SeverePingThreshold; // 0x334
	int32_t AdjustedNetSpeed; // 0x338
	float LastNetSpeedUpdateTime; // 0x33c
	int32_t TotalNetBandwidth; // 0x340
	int32_t MinDynamicBandwidth; // 0x344
	int32_t MaxDynamicBandwidth; // 0x348
	char bIsStandbyCheckingEnabled : 1; // 0x34c
	char bHasStandbyCheatTriggered : 1; // 0x34c
	float StandbyRxCheatTime; // 0x350
	float StandbyTxCheatTime; // 0x354
	float PercentMissingForRxStandby; // 0x358
	float PercentMissingForTxStandby; // 0x35c
	float PercentForBadPing; // 0x360
	float JoinInProgressStandbyWaitTime; // 0x364
	float MoveRepSize; // 0x368
	float MAXPOSITIONERRORSQUARED; // 0x36c
	float MAXNEARZEROVELOCITYSQUARED; // 0x370
	float CLIENTADJUSTUPDATECOST; // 0x374
	float MAXCLIENTUPDATEINTERVAL; // 0x378
	float MaxClientForcedUpdateDuration; // 0x37c
	float ServerForcedUpdateHitchThreshold; // 0x380
	float ServerForcedUpdateHitchCooldown; // 0x384
	float MaxMoveDeltaTime; // 0x388
	float MaxClientSmoothingDeltaTime; // 0x38c
	float ClientNetSendMoveDeltaTime; // 0x390
	float ClientNetSendMoveDeltaTimeThrottled; // 0x394
	float ClientNetSendMoveDeltaTimeStationary; // 0x398
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x39c
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x3a0
	bool ClientAuthorativePosition; // 0x3a4
	float ClientErrorUpdateRateLimit; // 0x3a8
	float ClientNetCamUpdateDeltaTime; // 0x3ac
	float ClientNetCamUpdatePositionLimit; // 0x3b0
	bool bMovementTimeDiscrepancyDetection; // 0x3b4
	bool bMovementTimeDiscrepancyResolution; // 0x3b5
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x3b8
	float MovementTimeDiscrepancyMinTimeMargin; // 0x3bc
	float MovementTimeDiscrepancyResolutionRate; // 0x3c0
	float MovementTimeDiscrepancyDriftAllowance; // 0x3c4
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x3c8
	bool bUseDistanceBasedRelevancy; // 0x3c9
};

struct UNiagaraSimulationStageBase : UNiagaraMergeable {
	UNiagaraScript* Script; // 0x28
	FName SimulationStageName; // 0x30
};

struct ULowEntryRawSocketConnectionListenerCode : UObject {
	bool Stopped; // 0x28
	bool RunExec; // 0x29
	bool ConnectionSuccess; // 0x2a
	bool JustConnected; // 0x38
	float WaitingForConnectionTime; // 0x3c
	ULowEntryRawSocketConnection* SocketConnection; // 0x40
	int32_t LatentUUID; // 0x48
};

struct UGameplayTask_WaitDelay : UGameplayTask {
	FMulticastInlineDelegate OnFinish; // 0x68
};

struct UAkAssetData : UObject {
	uint32_t CachedHash; // 0x28
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct UTestMovieSceneSubTrack : UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x68
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x410
};

struct UMaterialExpressionSpriteTextureSampler : UMaterialExpressionTextureSampleParameter2D {
	bool bSampleAdditionalTextures; // 0xf0
	int32_t AdditionalSlotIndex; // 0xf4
	FText SlotDisplayName; // 0xf8
};

struct ANavModifierVolume : AVolume {
	UNavArea* AreaClass; // 0x368
};

struct UUW-MatchEnd_Animation_02_DamagePlayerInfo_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UHorizontalBox* HorizontalBox_Equip; // 0x250
	UOverlay* Overlay_Health; // 0x258
	UProgressBar* ProgressBar_Health; // 0x260
	UTextBlock* T_Class; // 0x268
	UTextBlock* T_ExpertWeapon; // 0x270
	UTextBlock* T_Health; // 0x278
	UTextBlock* T_KilledBy; // 0x280
	UTextBlock* T_Level; // 0x288
	UTextBlock* T_MaxHealth; // 0x290
	UTextBlock* T_Name; // 0x298
	UTextBlock* TextBlock_21; // 0x2a0
	UUW-Inventory_EquippedSlot_C* UW-Inventory_EquippedSlot_Armor; // 0x2a8
	UUW-Inventory_EquippedSlot_C* UW-Inventory_EquippedSlot_Bag; // 0x2b0
	UUW-Inventory_EquippedSlot_C* UW-Inventory_EquippedSlot_Helmet; // 0x2b8
	float TargetHealth; // 0x2c0
	float CurrentHealth; // 0x2c4
	float MaxHealth; // 0x2c8
};

struct UBravoHotelVehicleTireComponent : UStaticMeshComponent {
	TArray<int32_t> ConnectedWheelIndices; // 0x548
	FName OriginalAttachBoneName; // 0x558
	FName SurfaceFxBoneName; // 0x560
	FVector SurfaceFxScale; // 0x568
	float SurfaceFxMaxDrawDistance; // 0x574
	UParticleSystemComponent* SurfaceFxComponent; // 0x578
	UParticleSystem* WreckedEffect; // 0x580
	UAkAudioEvent* WreckedSound; // 0x588
	ABravoHotelVehicle* OwnerVehicle; // 0x598
};

struct UPrefabVariantAsset : UPrefabAsset {
	UPrefabAsset* Parent; // 0xe8
};

struct UParticleModuleKillBox : UParticleModuleKillBase {
	FRawDistributionVector LowerLeftCorner; // 0x30
	FRawDistributionVector UpperRightCorner; // 0x78
	char bAbsolute : 1; // 0xc0
	char bKillInside : 1; // 0xc0
	char bAxisAlignedAndFixedSize : 1; // 0xc0
};

struct UBoxFalloff : UFieldNodeFloat {
	float Magnitude; // 0xb0
	float MinRange; // 0xb4
	float MaxRange; // 0xb8
	float Default; // 0xbc
	FTransform Transform; // 0xc0
	EFieldFalloffType Falloff; // 0xf0
};

struct UGameViewportClient : UScriptViewportClient {
	UConsole* ViewportConsole; // 0x40
	TArray<FDebugDisplayProperty> DebugProperties; // 0x48
	int32_t MaxSplitscreenPlayers; // 0x68
	UWorld* World; // 0x78
	UGameInstance* GameInstance; // 0x80
};

struct ABravoHotelProjectileGrenadeDynamite : ABravoHotelProjectileGrenade {
	UMaterialInterface* ExplosionGroundDecalMaterial; // 0x688
	FVector ExplosionGroundDecalSize; // 0x690
	UDecalComponent* ExplosionGroundDecalComponent; // 0x6a0
};

struct UBravoHotelVoiceComponent : UActorComponent {
	UDataTable* Table; // 0x1a0
};

struct UPrefabToolComponent : UPrimitiveComponent {
	char bConnected : 1; // 0x4b0
	char bLockSelection : 1; // 0x4b0
	UPrefabAsset* Prefab; // 0x4b8
	UBlueprint* GeneratedBlueprint; // 0x4c0
	UStaticMesh* SimplifiedMesh; // 0x4c8
	TMap<FName, AActor*> PrefabInstancesMap; // 0x4d0
	TArray<FPrefabVariantRule> VariantRulesOverwrite; // 0x520
	char bTransient : 1; // 0x530
	AActor* ParentClass; // 0x538
};

struct ULowEntryLatentActionObject : UObject {
	bool Finished; // 0x28
	UObject* Result; // 0x30
	int32_t KeepAliveCount; // 0x38
};

struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x398
	float BaseLookUpRate; // 0x39c
	UPawnMovementComponent* MovementComponent; // 0x3a0
	USphereComponent* CollisionComponent; // 0x3a8
	UStaticMeshComponent* MeshComponent; // 0x3b0
	char bAddDefaultMovementBindings : 1; // 0x3b8
};

struct UAkAssetDataSwitchContainer : UAkAssetDataWithMedia {
	TArray<UAkAssetDataSwitchContainerData*> SwitchContainers; // 0x70
	UAkGroupValue* DefaultGroupValue; // 0x80
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	TSet<FName> Tags; // 0x90
};

struct UBravoHotelSeason : UBravoHotelCoherentObject {
	FMulticastInlineDelegate OnSeasonChangedSubTabDelegate; // 0x30
};

struct UCrowdManager : UCrowdManagerBase {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct UParticleModuleColorOverLife : UParticleModuleColorBase {
	FRawDistributionVector ColorOverLife; // 0x30
	FRawDistributionFloat AlphaOverLife; // 0x78
	char bClampAlpha : 1; // 0xa8
};

struct UDynamicEntryBox : UDynamicEntryBoxBase {
	UUserWidget* EntryWidgetClass; // 0x1c8
};

struct ULowEntryLong : UObject {
	TArray<char> Bytes; // 0x28
};

struct UAkAudioType : UObject {
	uint32_t ShortID; // 0x28
	TArray<UObject*> UserData; // 0x30
};

struct UMaterialExpressionComponentMask : UMaterialExpression {
	FExpressionInput Input; // 0x40
	char R : 1; // 0x54
	char G : 1; // 0x54
	char B : 1; // 0x54
	char A : 1; // 0x54
};

struct UMaterialExpressionFeatureLevelSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Inputs[0x4]; // 0x54
};

struct UUW-ArmoryResultListWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Armory_Repair_M; // 0x250
	UWidgetAnimation* Armory_Strengthen_M; // 0x258
	UWidgetAnimation* Armory_Failed_M; // 0x260
	UWidgetAnimation* Armory_Break_M; // 0x268
	UWidgetAnimation* Armory_Failed_Break_M; // 0x270
	UWidgetAnimation* Armory_Failed_Down_M; // 0x278
	UWidgetAnimation* Armory_Awesome_M; // 0x280
	UWidgetAnimation* Armory_Success_M; // 0x288
	UCanvasPanel* Armory_Awesome; // 0x290
	UCanvasPanel* Armory_Break; // 0x298
	UCanvasPanel* Armory_Failed; // 0x2a0
	UCanvasPanel* Armory_Failed_Break; // 0x2a8
	UCanvasPanel* Armory_Failed_Down; // 0x2b0
	UCanvasPanel* Armory_Repair; // 0x2b8
	UCanvasPanel* Armory_Strengthen; // 0x2c0
	UCanvasPanel* Armory_Success; // 0x2c8
	UTextBlock* Awesome_Damage1; // 0x2d0
	UTextBlock* Awesome_Damage2; // 0x2d8
	UTextBlock* Awesome_ItemName; // 0x2e0
	UTextBlock* Awesome_Level1; // 0x2e8
	UTextBlock* Awesome_Level2; // 0x2f0
	UTextBlock* Awesome_MagSize1; // 0x2f8
	UTextBlock* Awesome_MagSize2; // 0x300
	UTextBlock* Awesome_Spread1; // 0x308
	UTextBlock* Awesome_Spread2; // 0x310
	UTextBlock* Awesome_UpLevel; // 0x318
	UTextBlock* Break_Count; // 0x320
	UTextBlock* Break_ItemName; // 0x328
	UTextBlock* BreakTitle; // 0x330
	UButton* Button_1; // 0x338
	UButton* Button_2; // 0x340
	UButton* Button_228; // 0x348
	UButton* Button_230; // 0x350
	UButton* Button_232; // 0x358
	UButton* Button_233; // 0x360
	UButton* Button_EnchanceCancle; // 0x368
	UButton* Button_Enhance; // 0x370
	UButton* Button_Fatigue; // 0x378
	UCanvasPanel* Empty; // 0x380
	UTextBlock* FB_Damage1; // 0x388
	UTextBlock* FB_Damage2; // 0x390
	UTextBlock* FB_Level1; // 0x398
	UTextBlock* FB_Level2; // 0x3a0
	UTextBlock* FB_MagSize1; // 0x3a8
	UTextBlock* FB_MagSize2; // 0x3b0
	UTextBlock* FB_Spread1; // 0x3b8
	UTextBlock* FB_Spread2; // 0x3c0
	UTextBlock* FD_Damage1; // 0x3c8
	UTextBlock* FD_Damage2; // 0x3d0
	UTextBlock* FD_DownLevel; // 0x3d8
	UTextBlock* FD_Level1; // 0x3e0
	UTextBlock* FD_Level2; // 0x3e8
	UTextBlock* FD_MagSize1; // 0x3f0
	UTextBlock* FD_MagSize2; // 0x3f8
	UTextBlock* FD_Spread1; // 0x400
	UTextBlock* FD_Spread2; // 0x408
	UHorizontalBox* HorizontalBox_Awesome_Damage; // 0x410
	UHorizontalBox* HorizontalBox_Awesome_MagSize; // 0x418
	UHorizontalBox* HorizontalBox_Awesome_Spread; // 0x420
	UHorizontalBox* HorizontalBox_FB_Damage; // 0x428
	UHorizontalBox* HorizontalBox_FB_MagSize; // 0x430
	UHorizontalBox* HorizontalBox_FB_Spread; // 0x438
	UHorizontalBox* HorizontalBox_FD_Damage; // 0x440
	UHorizontalBox* HorizontalBox_FD_MasSize; // 0x448
	UHorizontalBox* HorizontalBox_FD_Spread; // 0x450
	UHorizontalBox* HorizontalBox_Strengthen_Damage; // 0x458
	UHorizontalBox* HorizontalBox_Strengthen_MagSize; // 0x460
	UHorizontalBox* HorizontalBox_Strengthen_Spread; // 0x468
	UHorizontalBox* HorizontalBox_Success_Damage; // 0x470
	UHorizontalBox* HorizontalBox_Success_Durable; // 0x478
	UHorizontalBox* HorizontalBox_Success_Fatigue; // 0x480
	UHorizontalBox* HorizontalBox_Success_MagSize; // 0x488
	UHorizontalBox* HorizontalBox_Success_Spread; // 0x490
	UImage* Image; // 0x498
	UImage* Image_2; // 0x4a0
	UImage* Image_3; // 0x4a8
	UImage* Image_4; // 0x4b0
	UImage* Image_8; // 0x4b8
	UImage* Image_14; // 0x4c0
	UImage* Image_15; // 0x4c8
	UImage* Image_16; // 0x4d0
	UImage* Image_17; // 0x4d8
	UImage* Image_18; // 0x4e0
	UImage* Image_20; // 0x4e8
	UImage* Image_27; // 0x4f0
	UImage* Image_167; // 0x4f8
	UImage* Image_501; // 0x500
	UImage* Image_503; // 0x508
	UImage* Image_817; // 0x510
	UImage* Image_820; // 0x518
	UImage* Image_821; // 0x520
	UImage* Image_822; // 0x528
	UImage* Image_823; // 0x530
	UImage* Image_824; // 0x538
	UImage* Image_825; // 0x540
	UImage* Image_826; // 0x548
	UImage* Image_827; // 0x550
	UImage* Image_828; // 0x558
	UImage* Image_829; // 0x560
	UImage* Image_830; // 0x568
	UImage* Image_831; // 0x570
	UImage* Image_832; // 0x578
	UImage* Image_833; // 0x580
	UImage* Image_834; // 0x588
	UImage* Image_835; // 0x590
	UImage* Image_836; // 0x598
	UImage* Image_837; // 0x5a0
	UImage* Image_838; // 0x5a8
	UImage* Image_839; // 0x5b0
	UImage* Image_840; // 0x5b8
	UImage* Image_841; // 0x5c0
	UImage* Image_842; // 0x5c8
	UImage* Image_843; // 0x5d0
	UImage* Image_845; // 0x5d8
	UImage* Image_846; // 0x5e0
	UImage* Image_847; // 0x5e8
	UImage* Image_848; // 0x5f0
	UImage* Image_849; // 0x5f8
	UImage* Image_850; // 0x600
	UImage* Image_851; // 0x608
	UImage* Image_852; // 0x610
	UImage* Image_853; // 0x618
	UImage* Image_854; // 0x620
	UImage* Image_855; // 0x628
	UImage* Image_856; // 0x630
	UImage* Image_857; // 0x638
	UImage* Image_858; // 0x640
	UImage* Image_859; // 0x648
	UImage* Image_860; // 0x650
	UImage* Image_861; // 0x658
	UImage* Image_862; // 0x660
	UImage* Image_863; // 0x668
	UImage* Image_864; // 0x670
	UImage* Image_865; // 0x678
	UImage* Image_866; // 0x680
	UImage* Image_867; // 0x688
	UImage* Image_868; // 0x690
	UImage* Image_921; // 0x698
	UImage* Image_1264; // 0x6a0
	UImage* Image_1266; // 0x6a8
	UImage* Image_1269; // 0x6b0
	UImage* Image_1270; // 0x6b8
	UImage* Image_1271; // 0x6c0
	UImage* Image_1272; // 0x6c8
	UImage* Image_1273; // 0x6d0
	UImage* Image_1277; // 0x6d8
	UImage* Image_1278; // 0x6e0
	UImage* Image_1279; // 0x6e8
	UImage* Image_1280; // 0x6f0
	UImage* Image_1284; // 0x6f8
	UImage* Image_1285; // 0x700
	UImage* Image_1318; // 0x708
	UImage* Image_1319; // 0x710
	UImage* Image_1320; // 0x718
	UImage* Image_1321; // 0x720
	UImage* Image_1322; // 0x728
	UImage* Image_1323; // 0x730
	UImage* Image_1324; // 0x738
	UImage* Image_1329; // 0x740
	UImage* Image_1330; // 0x748
	UImage* Image_1335; // 0x750
	UImage* Image_1336; // 0x758
	UImage* Image_1341; // 0x760
	UImage* Image_1342; // 0x768
	UImage* Image_1343; // 0x770
	UImage* Image_1344; // 0x778
	UImage* Image_1345; // 0x780
	UImage* Image_1346; // 0x788
	UImage* Image_1347; // 0x790
	UImage* Image_1348; // 0x798
	UImage* Image_1349; // 0x7a0
	UImage* Image_1350; // 0x7a8
	UImage* Image_1351; // 0x7b0
	UImage* Image_1352; // 0x7b8
	UImage* Image_1353; // 0x7c0
	UImage* Image_1354; // 0x7c8
	UImage* Image_1355; // 0x7d0
	UImage* Image_1356; // 0x7d8
	UImage* Image_1358; // 0x7e0
	UImage* Image_1359; // 0x7e8
	UImage* Image_1361; // 0x7f0
	UImage* Image_1362; // 0x7f8
	UImage* Image_1363; // 0x800
	UImage* Image_1364; // 0x808
	UImage* Image_1366; // 0x810
	UImage* Image_1368; // 0x818
	UImage* Image_1369; // 0x820
	UImage* Image_1370; // 0x828
	UImage* Image_1372; // 0x830
	UImage* Image_1374; // 0x838
	UImage* Image_1375; // 0x840
	UImage* Image_1376; // 0x848
	UImage* Image_1378; // 0x850
	UImage* Image_1380; // 0x858
	UImage* Image_1381; // 0x860
	UImage* Image_1382; // 0x868
	UImage* Image_1384; // 0x870
	UImage* Image_1972; // 0x878
	UImage* ImageTX_Complete_Fail; // 0x880
	UOverlay* ItemList; // 0x888
	UOverlay* Overlay_FB_ItemList; // 0x890
	UTextBlock* Strengthen_Cost; // 0x898
	UTextBlock* Strengthen_Count; // 0x8a0
	UTextBlock* Strengthen_CurrentDamageText1; // 0x8a8
	UTextBlock* Strengthen_CurrentDamageText2; // 0x8b0
	UTextBlock* Strengthen_CurrentMagSizeText1; // 0x8b8
	UTextBlock* Strengthen_CurrentMagSizeText2; // 0x8c0
	UTextBlock* Strengthen_CurrentSpreadText1; // 0x8c8
	UTextBlock* Strengthen_CurrentSpreadText2; // 0x8d0
	UImage* Strengthen_Icon; // 0x8d8
	UImage* Strengthen_IconType1; // 0x8e0
	UImage* Strengthen_IconType2; // 0x8e8
	UImage* Strengthen_IconType3; // 0x8f0
	UTextBlock* Strengthen_Level1; // 0x8f8
	UTextBlock* Strengthen_Level2; // 0x900
	UTextBlock* Strengthen_Name; // 0x908
	UTextBlock* Strengthen_TextType1; // 0x910
	UTextBlock* Strengthen_TextType2; // 0x918
	UTextBlock* Strengthen_TextType3; // 0x920
	UTextBlock* Success_Damage1; // 0x928
	UTextBlock* Success_Damage2; // 0x930
	UTextBlock* Success_ItemName; // 0x938
	UTextBlock* Success_ItemName_2; // 0x940
	UTextBlock* Success_Level1; // 0x948
	UTextBlock* Success_Level2; // 0x950
	UTextBlock* Success_MagSize1; // 0x958
	UTextBlock* Success_MagSize2; // 0x960
	UTextBlock* Success_Spread1; // 0x968
	UTextBlock* Success_Spread2; // 0x970
	UTextBlock* Success_UpLevel; // 0x978
	UTextBlock* T_Durability; // 0x980
	UTextBlock* T_Fatigue; // 0x988
	UTextBlock* T_PreFatigue; // 0x990
	UProgressBar* TerrainHeight; // 0x998
	UTextBlock* TextBlock_2089; // 0x9a0
	UTextBlock* TextBlock_FB_ItemCount; // 0x9a8
	UTextBlock* TextBlock_FB_ItemName; // 0x9b0
	UTextBlock* TextBlock_FB_Title; // 0x9b8
	UWidgetSwitcher* WidgetSwitcher_1; // 0x9c0
	FCoh_ResultInfo ResultInfo; // 0x9c8
	float CurrentDurability; // 0xa00
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct UBravoHotelGameInstance : UBravoHotelAppInstance {
	bool CharacterTeleport; // 0x250
	bool EnableChatting; // 0x251
	bool AllowReconnect; // 0x252
	bool bIsInHouseDevBuild; // 0x253
	FString DefaultFontFamilyAsset; // 0x258
	UFont* DefaultFontFamily; // 0x268
	UBravoHotelLoadingWidget* LoadingScreenWidget; // 0x270
	FSelectLoadingScreenData CurLoadingScreenInfo; // 0x278
	bool bWinnerCam; // 0x2b8
	ELoadingScreenType ForceLoadingType; // 0x2b9
	bool bIsPlayingKillCam; // 0x2ba
	int32_t KillerUniquePlayerId; // 0x2c0
	int32_t MyUniquePlayerId; // 0x2c4
	FMulticastInlineDelegate ReplayListChangedCallBack; // 0x2c8
	bool bCheatable; // 0x2d8
	bool bEnableMakeAccount; // 0x2d9
	UBravoHotelGameSettingManager* GameSettingManager; // 0x2e0
	FString LoadingScreenWidgetClass; // 0x2f8
	TArray<FCoherentWidgetInfo> CohWidgetList; // 0x360
	FString PopupWidgetClass; // 0x450
	FMulticastInlineDelegate OnChangedLanguageCallBack; // 0x460
	TMap<FString, FVoiceTalkState> SaveMemberVoiceInfoList; // 0x478
	TArray<FRepInvalidHitInfo> InvalidHitInfos; // 0x530
	UUserWidget* ReconnectWidget; // 0x540
};

struct UCanvas : UObject {
	float OrgX; // 0x28
	float OrgY; // 0x2c
	float ClipX; // 0x30
	float ClipY; // 0x34
	FColor DrawColor; // 0x38
	char bCenterX : 1; // 0x3c
	char bCenterY : 1; // 0x3c
	char bNoSmooth : 1; // 0x3c
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FPlane ColorModulate; // 0x50
	UTexture2D* DefaultTexture; // 0x60
	UTexture2D* GradientTexture0; // 0x68
	UReporterGraph* ReporterGraph; // 0x70
};

struct ULandscapeWeightmapUsage : UObject {
	ULandscapeComponent* ChannelUsage[0x4]; // 0x28
	FGuid LayerGuid; // 0x48
};

struct UFieldSystemMetaDataIteration : UFieldSystemMetaData {
	int32_t Iterations; // 0xb0
};

struct UInterpTrackBoolProp : UInterpTrack {
	TArray<FBoolTrackKey> BoolTrack; // 0x70
	FName PropertyName; // 0x80
};

struct UBP-SpectatorWidget_C : UBravoHotelSpectatorWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x250
	UWidgetAnimation* BackgroundBlurFadeIn; // 0x258
	UWidgetAnimation* Idle; // 0x260
	UBackgroundBlur* BackgroundBlur_1; // 0x268
	UButton* Btn-Exit; // 0x270
	UButton* Btn-NextTarget; // 0x278
	UButton* Btn-PreTarget; // 0x280
	UButton* Btn-Replay; // 0x288
	UCanvasPanel* Canvas_Main; // 0x290
	UHorizontalBox* KillcamBtns; // 0x298
	UHorizontalBox* MemberChangeBox; // 0x2a0
	UTextBlock* TextDepth_Replay; // 0x2a8
	UUW-SpectatingTargetInfo_C* UW-SpectatingTargetInfo; // 0x2b0
	bool bIsKillCam; // 0x2b8
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x58
};

struct UOculusMR_State : UObject {
	FTrackedCamera TrackedCamera; // 0x28
	USceneComponent* TrackingReferenceComponent; // 0x98
	double ScalingFactor; // 0xa0
	bool ChangeCameraStateRequested; // 0xac
	bool BindToTrackedCameraIndexRequested; // 0xad
};

struct ANavigationTestingActor : AActor {
	UCapsuleComponent* CapsuleComponent; // 0x338
	UNavigationInvokerComponent* InvokerComponent; // 0x340
	char bActAsNavigationInvoker : 1; // 0x348
	FNavAgentProperties NavAgentProps; // 0x350
	FVector QueryingExtent; // 0x380
	ANavigationData* MyNavData; // 0x390
	FVector ProjectedLocation; // 0x398
	char bProjectedLocationValid : 1; // 0x3a4
	char bSearchStart : 1; // 0x3a4
	float CostLimitFactor; // 0x3a8
	float MinimumCostLimit; // 0x3ac
	char bBacktracking : 1; // 0x3b0
	char bUseHierarchicalPathfinding : 1; // 0x3b0
	char bGatherDetailedInfo : 1; // 0x3b0
	char bDrawDistanceToWall : 1; // 0x3b0
	char bShowNodePool : 1; // 0x3b0
	char bShowBestPath : 1; // 0x3b0
	char bShowDiffWithPreviousStep : 1; // 0x3b0
	char bShouldBeVisibleInGame : 1; // 0x3b0
	ENavCostDisplay CostDisplayMode; // 0x3b4
	FVector2D TextCanvasOffset; // 0x3b8
	char bPathExist : 1; // 0x3c0
	char bPathIsPartial : 1; // 0x3c0
	char bPathSearchOutOfNodes : 1; // 0x3c0
	float PathfindingTime; // 0x3c4
	float PathCost; // 0x3c8
	int32_t PathfindingSteps; // 0x3cc
	ANavigationTestingActor* OtherActor; // 0x3d0
	UNavigationQueryFilter* FilterClass; // 0x3d8
	int32_t ShowStepIndex; // 0x3e0
	float OffsetFromCornersDistance; // 0x3e4
};

struct UEditableGameplayTagQueryExpression_AllExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UBravoHotelInventoryWidget : UUserWidget {
	float ResetInventoryScrollTime; // 0x250
	FMulticastInlineDelegate WeaponAmmoDelegate; // 0x260
};

struct UUW-CheatReplayListTitleItem_C : UUserWidget {
	UTextBlock* TextBlock_62; // 0x248
};

struct UUW-PopupWidget_C : UBravoHotelPopupWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x268
	UImage* Bg; // 0x270
	UButton* btn_Cancel; // 0x278
	UButton* btn_OK; // 0x280
	UTextBlock* Desc; // 0x288
	UImage* Image_2; // 0x290
	UOverlay* Overlay; // 0x298
	UOverlay* Overlay_1; // 0x2a0
	UOverlay* Overlay_2; // 0x2a8
	URichTextBlock* RichTextBlock_244; // 0x2b0
	UTextBlock* TextBlock_17; // 0x2b8
	UThrobber* Throbber_159; // 0x2c0
	UTextBlock* Title; // 0x2c8
	UWidgetSwitcher* WidgetSwitcher_1; // 0x2d0
	FName MapNameToExit; // 0x2d8
	bool IsExitGame; // 0x2e0
	ABravoHotelPlayerController* ControllerRef; // 0x2e8
	bool IsTutorial; // 0x2f0
	bool IsDeathCam; // 0x2f1
	FMulticastInlineDelegate EventDispatcher_MoveToDeathCam; // 0x2f8
	bool ErrorType; // 0x308
	bool IsPerkDeckSelectMode; // 0x309
	FMulticastInlineDelegate EventDispatcher_TrySelectMode; // 0x310
	bool OkayType; // 0x320
};

struct UAnimNotify_PlayParticleEffect : UAnimNotify {
	UParticleSystem* PSTemplate; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UBravoHotelSettingWidget : UBravoHotelSettingBaseWidget {
	TArray<FBackupSlotData> BackupSlots; // 0x298
	TMap<FName, FString> SettingList; // 0x2b0
	TMap<FName, UBravoHotelSettingSlotWidget*> ChangeSettingList; // 0x300
	TMap<FName, FChangeKeySlotInfo> ChangeSettingKeyList; // 0x350
	TArray<UBravoHotelSettingSubWidget*> SubList; // 0x3a0
	TArray<UBravoHotelSettingSlotWidget*> SlotList; // 0x3b0
	bool ChangingTotalGraphic; // 0x3c0
	bool IsInitState; // 0x3c1
	ESettingBigType SelectedTyp; // 0x3c2
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct UChaosClothConfig : UClothConfigCommon {
	EClothMassMode MassMode; // 0x28
	float UniformMass; // 0x2c
	float TotalMass; // 0x30
	float Density; // 0x34
	float MinPerParticleMass; // 0x38
	float EdgeStiffness; // 0x3c
	float BendingStiffness; // 0x40
	float AreaStiffness; // 0x44
	float VolumeStiffness; // 0x48
	float StrainLimitingStiffness; // 0x4c
	float LimitScale; // 0x50
	bool bUseGeodesicDistance; // 0x54
	float ShapeTargetStiffness; // 0x58
	float CollisionThickness; // 0x5c
	float FrictionCoefficient; // 0x60
	float DampingCoefficient; // 0x64
	float DragCoefficient; // 0x68
	float AnimDriveSpringStiffness; // 0x6c
	bool bUseBendingElements; // 0x70
	bool bUseTetrahedralConstraints; // 0x71
	bool bUseThinShellVolumeConstraints; // 0x72
	bool bUseSelfCollisions; // 0x73
	bool bUseContinuousCollisionDetection; // 0x74
	FVector LinearVelocityScale; // 0x78
	float AngularVelocityScale; // 0x84
};

struct UNavLinkComponent : UPrimitiveComponent {
	TArray<FNavigationLink> LINKS; // 0x4b8
};

struct UParticleModuleLocation_Seeded : UParticleModuleLocation {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UParticleModuleVectorFieldScaleOverLife : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScaleOverLife; // 0x30
	FRawDistributionFloat VectorFieldScaleOverLifeRaw; // 0x38
};

struct UComboBoxText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_43; // 0x250
	UImage* Image_269; // 0x258
	UTextBlock* TextBlock_67; // 0x260
	FText Text; // 0x268
};

struct UMagicLeapLightingTrackingComponent : UActorComponent {
	bool UseGlobalAmbience; // 0xb0
	bool UseColorTemp; // 0xb1
};

struct UBravoHotelArmory : UBravoHotelCoherentObject {
	TMap<FString, ABravoHotelArmoryMeshActor*> ArmoryMeshMap; // 0x30
	FMulticastInlineDelegate ChangeSceneDelegate; // 0x80
	FMulticastInlineDelegate MouseEventDelegate; // 0x90
	FCoh_ResultInfo ResultInfo; // 0xa0
	int32_t CurrentMaterialCount; // 0xd8
	FMulticastInlineDelegate SkipIdentifiedDelegate; // 0xe0
	FMulticastInlineDelegate ArmoryTabDelegate; // 0xf0
};

struct UPlayer : UObject {
	APlayerController* PlayerController; // 0x30
	int32_t CurrentNetSpeed; // 0x38
	int32_t ConfiguredInternetSpeed; // 0x3c
	int32_t ConfiguredLanSpeed; // 0x40
};

struct UProceduralFoliageSpawner : UObject {
	int32_t RandomSeed; // 0x28
	float TileSize; // 0x2c
	int32_t NumUniqueTiles; // 0x30
	float MinimumQuadTreeSize; // 0x34
	TArray<FFoliageTypeObject> FoliageTypes; // 0x40
};

struct UUW-ReplayWorldMapOption_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UCanvasPanel* Canvas_Main; // 0x250
	UCheckBox* CB_DrawDeathPosition; // 0x258
	UCheckBox* CB_DrawFireDirection; // 0x260
	UCheckBox* CB_DrawHitted; // 0x268
	UCheckBox* CB_DrawPersonalSupplyBox; // 0x270
	UCheckBox* CB_TransportDropBox; // 0x278
	ABP-MK3DReplayController_C* ReplayController; // 0x280
	UBravoHotelMainWidget* MainWidget; // 0x288
	ABravoHotelPlayerHUD* PlayerHUD; // 0x290
};

struct USubmixEffectSubmixEQPreset : USoundEffectSubmixPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0x78
};

struct UToIntegerField : UFieldNodeInt {
	UFieldNodeFloat* FloatField; // 0xb0
};

struct UABP-Mannequin-PostProcess_C : UBravoHotelAnimInstancePostprocess {
	FPointerToUberGraphFrame UberGraphFrame; // 0x520
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x528
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x5c8
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_11; // 0x6d0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0x8b0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_10; // 0x9c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0xba0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0xbc0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0xcc8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0xce8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0xda0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0xe58
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0xf60
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0xf80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x1020
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0x10d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x10f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x1120
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x1148
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x1170
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x1210
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0x1238
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x1258
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0x1360
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x1380
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x1488
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x1590
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x1698
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x1750
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0x1778
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x1798
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1838
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x18d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x1900
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x1a08
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0x1aa8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0x1ac8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x1ae8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x1b10
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0x1c18
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0x1c38
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0x1c58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x1c78
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0x1ca0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_13; // 0x1cc0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_12; // 0x2100
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x2540
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0x25f8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x2618
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x2720
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x2828
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x2930
	FAnimNode_LinkedInputPose AnimGraphNode_SubInput; // 0x2950
	FAnimNode_Root AnimGraphNode_Root; // 0x29c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x29f8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x2a20
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_3; // 0x2a48
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9; // 0x2b70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x2d50
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x2d70
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x2d90
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x2e48
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x2ee8
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8; // 0x2fa0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x3180
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x31a0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x31c0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x32c8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x33d0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7; // 0x33f0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x35d0
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting_2; // 0x35f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x3710
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x37b0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x37d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x3800
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x38b8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x39c0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x39e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x3a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x3ad0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x3b48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x3c00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x3c28
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x3c50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3d10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x3d88
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x3e28
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x3ee0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x3f90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x3fb8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x3fe0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x4008
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_11; // 0x4030
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_10; // 0x4470
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_9; // 0x48b0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_8; // 0x4cf0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_7; // 0x5130
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_6; // 0x5570
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_5; // 0x59b0
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x5df0
	FAnimNode_HandIKRetargeting AnimGraphNode_HandIKRetargeting; // 0x5ef8
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6; // 0x6020
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x6200
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x6220
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x6240
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0x6300
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x64e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x6500
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x6520
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x65d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x6600
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x6628
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x66c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x66f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x6790
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x67b8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x67e0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x6800
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x6820
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0x68e0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0x6ac0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x6ca0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x6e80
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x7060
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x7168
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x7270
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x7378
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_4; // 0x7480
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_3; // 0x78c0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_26; // 0x7d00
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_25; // 0x7f50
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_24; // 0x81a0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_23; // 0x83f0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_22; // 0x8640
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_21; // 0x8890
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_20; // 0x8ae0
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_19; // 0x8bf8
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_18; // 0x8d10
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_17; // 0x8e28
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_16; // 0x8f40
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_15; // 0x9058
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_14; // 0x9170
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_13; // 0x9288
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_20; // 0x93a0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_19; // 0x95f0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_18; // 0x9840
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_17; // 0x9a90
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_16; // 0x9ce0
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_12; // 0x9f30
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_11; // 0xa048
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_15; // 0xa160
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_10; // 0xa3b0
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_9; // 0xa4c8
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_8; // 0xa5e0
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_7; // 0xa6f8
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_6; // 0xa810
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_5; // 0xa928
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_4; // 0xaa40
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0xab58
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0xac70
	FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0xad88
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_14; // 0xaea0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_13; // 0xb0f0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_12; // 0xb340
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_11; // 0xb590
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_10; // 0xb7e0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_9; // 0xba30
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_8; // 0xbc80
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_7; // 0xbed0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_6; // 0xc120
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_5; // 0xc370
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_4; // 0xc5c0
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_3; // 0xc810
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics_2; // 0xca60
	FAnimNode_KawaiiPhysics AnimGraphNode_KawaiiPhysics; // 0xccb0
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics_2; // 0xcf00
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0xd340
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xd780
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0xd820
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0xd848
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0xd8e8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0xd910
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xd938
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0xd9d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0xd9f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0xda20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0xdad8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0xdb00
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xdb20
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0xdbc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0xdbe0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xdc08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xdcc0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xdce8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xdd08
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xdda8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xddc8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xddf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0xdea8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xdf48
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0xdf70
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0xdf98
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0xdfb8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xe058
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0xe078
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xe0a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0xe158
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xe180
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xe1a8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0xe248
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xe300
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xe320
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xe340
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xe3e0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0xe408
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xe4c0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xe4e8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xe508
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xe528
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xe5c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xe680
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xe6a8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xe6d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xe6f0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0xe710
};

struct ABravoHotelProjectile : ABravoHotelProjectileBase {
	USphereComponent* SphereCollision; // 0x328
	UStaticMeshComponent* Projectile; // 0x330
	URealisticProjectileComponent* RealisticProjectile; // 0x338
	UParticleSystemComponent* BulletEffect; // 0x340
	UParticleSystemComponent* TrailEffectInWater; // 0x348
	float Damage; // 0x350
	FVector StartLocation; // 0x354
	bool bInWater; // 0x360
	TMap<FString, UParticleSystem*> TrailEffectsList; // 0x380
	TMap<FString, UParticleSystem*> BulletEffectsList; // 0x3d0
	TMap<FString, UParticleSystem*> StopEffectsList; // 0x420
	bool bSpawnTrailEffect; // 0x470
	TArray<FString> TrailNames; // 0x478
	FVector TrailLocation; // 0x488
	FRotator TrailRotation; // 0x494
	bool bChangeBulletEffect; // 0x4a0
	FString BulletEffectName; // 0x4a8
	TArray<FString> StopEffectNames; // 0x4b8
	ABravoHotelPlayerController* AuthorityController; // 0x4c8
};

struct UGameUserSettings : UObject {
	bool bUseVSync; // 0x28
	bool bIsSmoothFrameRate; // 0x29
	bool bUseDynamicResolution; // 0x2a
	uint32_t ResolutionSizeX; // 0x80
	uint32_t ResolutionSizeY; // 0x84
	uint32_t LastUserConfirmedResolutionSizeX; // 0x88
	uint32_t LastUserConfirmedResolutionSizeY; // 0x8c
	int32_t WindowPosX; // 0x90
	int32_t WindowPosY; // 0x94
	int32_t FullscreenMode; // 0x98
	int32_t LastConfirmedFullscreenMode; // 0x9c
	int32_t PreferredFullscreenMode; // 0xa0
	uint32_t Version; // 0xa4
	int32_t AudioQualityLevel; // 0xa8
	int32_t LastConfirmedAudioQualityLevel; // 0xac
	float FrameRateLimit; // 0xb0
	float LobbyFrameRateLimit; // 0xb4
	int32_t DesiredScreenWidth; // 0xbc
	bool bUseDesiredScreenHeight; // 0xc0
	int32_t DesiredScreenHeight; // 0xc4
	int32_t LastUserConfirmedDesiredScreenWidth; // 0xc8
	int32_t LastUserConfirmedDesiredScreenHeight; // 0xcc
	float LastRecommendedScreenWidth; // 0xd0
	float LastRecommendedScreenHeight; // 0xd4
	float LastCPUBenchmarkResult; // 0xd8
	float LastGPUBenchmarkResult; // 0xdc
	TArray<float> LastCPUBenchmarkSteps; // 0xe0
	TArray<float> LastGPUBenchmarkSteps; // 0xf0
	FString LastCPUBrand; // 0x100
	FString LastGPUBrand; // 0x110
	int32_t LastInstallStorageType; // 0x120
	int64_t LastTotalGraphicsMemory; // 0x128
	float LastGPUBenchmarkMultiplier; // 0x130
	bool bUseHDRDisplayOutput; // 0x134
	int32_t HDRDisplayOutputNits; // 0x138
	bool ShowHUD; // 0x13c
	FMulticastInlineDelegate OnGameUserSettingsUINeedsUpdate; // 0x140
};

struct UGeometryCacheCodecRaw : UGeometryCacheCodecBase {
	int32_t DummyProperty; // 0x38
};

struct UDDGIVolumeComponent : USceneComponent {
	EDDGIRaysPerProbe RaysPerProbe; // 0x238
	FIntVector ProbeCounts; // 0x23c
	int32_t LightingPriority; // 0x248
	float UpdatePriority; // 0x24c
	float ProbeMaxRayDistance; // 0x250
	float ProbeHysteresis; // 0x254
	float ViewBias; // 0x258
	float NormalBias; // 0x25c
	FLightingChannels LightingChannels; // 0x260
	float VolumeBlendDistance; // 0x264
	float VolumeBlendDistanceBlack; // 0x268
	bool EnableProbeRelocation; // 0x26c
	bool EnableProbeScrolling; // 0x26d
	bool EnableViewDependentVolumeScrolling; // 0x26e
	float ViewDependentVolumeScrollingOffset; // 0x270
	bool EnableVolume; // 0x274
	bool RuntimeStatic; // 0x275
	float probeDistanceExponent; // 0x278
	float probeIrradianceEncodingGamma; // 0x27c
	float probeChangeThreshold; // 0x280
	float probeBrightnessThreshold; // 0x284
	float ProbeMinFrontfaceDistance; // 0x288
	float ProbeBackfaceThreshold; // 0x28c
	float LightMultiplier; // 0x290
	float EmissiveMultiplier; // 0x294
	float IrradianceScalar; // 0x298
	bool SkyLight; // 0x29c
	FVector LastOrigin; // 0x2a0
	FIntVector ProbeScrollOffset; // 0x2ac
};

struct UVerticalBoxSlot : UPanelSlot {
	FSlateChildSize Size; // 0x38
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct USourceEffectWaveShaperPreset : USoundEffectSourcePreset {
	FSourceEffectWaveShaperSettings Settings; // 0x70
};

struct UUW-PerkLevelUp_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Disappear; // 0x250
	UWidgetAnimation* Finish; // 0x258
	UWidgetAnimation* Spin; // 0x260
	UWidgetAnimation* Idle; // 0x268
	UImage* Image_180; // 0x270
	UImage* ItemImage_bg; // 0x278
	UImage* ItemImage_Dummy1; // 0x280
	UImage* ItemImage_Main; // 0x288
	UTextBlock* TextBlock_1; // 0x290
	UTextBlock* TextBlock_3; // 0x298
	UTextBlock* TextMountablewea; // 0x2a0
	UTextBlock* TextMountableweaLV1; // 0x2a8
	FPerkInfo PerkInfo; // 0x2b0
	FPerkData PerkData; // 0x2d8
	bool bLevelUp; // 0x3b8
	bool bFinishing; // 0x3b9
	float FinishTime; // 0x3bc
	EPerkSlotFlag PerkSlot; // 0x3c0
};

struct UTexture : UStreamableRenderAsset {
	FGuid LightingGuid; // 0x48
	int32_t LODBias; // 0x58
	TextureCompressionSettings CompressionSettings; // 0x5c
	TextureFilter Filter; // 0x5d
	ETextureMipLoadOptions MipLoadOptions; // 0x5e
	TextureGroup LODGroup; // 0x5f
	char SRGB : 1; // 0x60
	char bNoTiling : 1; // 0x60
	char VirtualTextureStreaming : 1; // 0x60
	char CompressionYCoCg : 1; // 0x60
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x60
	TArray<UAssetUserData*> AssetUserData; // 0x68
};

struct UARTrackedGeometry : UObject {
	FGuid UniqueID; // 0x28
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	UMRMeshComponent* UnderlyingMesh; // 0xb0
	EARObjectClassification ObjectClassification; // 0xb8
	int32_t LastUpdateFrameNumber; // 0xd0
	FName DebugName; // 0xe0
};

struct UTemplateSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x348
	TSoftClassPtr<UObject> BoundActorClass; // 0x350
	TSoftObjectPtr<AActor> BoundPreviewActor; // 0x378
	TMap<FGuid, FName> BoundActorComponents; // 0x3a0
};

struct UDistributionVectorUniformCurve : UDistributionVector {
	FInterpCurveTwoVectors ConstantCurve; // 0x38
	char bLockAxes1 : 1; // 0x50
	char bLockAxes2 : 1; // 0x50
	EDistributionVectorLockFlags LockedAxes[0x2]; // 0x54
	EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x56
	char bUseExtremes : 1; // 0x5c
};

struct ASpectatorBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x3e8
	FSpectatorReservation PendingReservation; // 0x3f8
	ESpectatorClientRequestType RequestType; // 0x470
	bool bPendingReservationSent; // 0x471
	bool bCancelReservation; // 0x472
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct UUW-Inventory_ProximitySlot_C : UUW-Inventory_SlotBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1360
	UWidgetAnimation* P_Upgrade_Arrow; // 0x1368
	UWidgetAnimation* C_SlotHover_ItemState_Hide; // 0x1370
	UWidgetAnimation* C_SlotHover_ItemState_Show; // 0x1378
	UWidgetAnimation* Hover_Gold; // 0x1380
	UWidgetAnimation* P_SlotHover; // 0x1388
	UImage* BGImage; // 0x1390
	UImage* BGImage_2; // 0x1398
	UCanvasPanel* CanvasPanel_ITemState; // 0x13a0
	UCanvasPanel* CanvasPanel_Unnecessary; // 0x13a8
	UTextBlock* Count; // 0x13b0
	UImage* Crate_Default; // 0x13b8
	UImage* Crate_Hover; // 0x13c0
	UProgressBar* DurabilityBar; // 0x13c8
	UImage* fill; // 0x13d0
	UHorizontalBox* HorizontalBox_Rarity; // 0x13d8
	UImage* HoverImage; // 0x13e0
	UImage* HoverImage_Gold; // 0x13e8
	UImage* HoverImage_Round; // 0x13f0
	UImage* Image_1; // 0x13f8
	UImage* Image_2; // 0x1400
	UImage* Image_531; // 0x1408
	UImage* Image_539; // 0x1410
	UImage* Image_540; // 0x1418
	UImage* Image_541; // 0x1420
	UImage* Image_542; // 0x1428
	UImage* Image_543; // 0x1430
	UImage* Image_544; // 0x1438
	UImage* Image_Bindable; // 0x1440
	UImage* Image_Supply; // 0x1448
	UImage* ItemImage; // 0x1450
	UTextBlock* ItemNameName; // 0x1458
	UTextBlock* ItemState_Text; // 0x1460
	UImage* KeepedItem_List; // 0x1468
	UImage* KeepedItem_ListHover; // 0x1470
	UImage* LvColor; // 0x1478
	UImage* NeedMaterial; // 0x1480
	USizeBox* SizeBox_1; // 0x1488
	UTextBlock* TextBlock_Range; // 0x1490
	UCanvasPanel* UpgradeItem; // 0x1498
	UImage* UpgradeItem_Arrow01; // 0x14a0
	UImage* UpgradeItem_Arrow02; // 0x14a8
	UImage* UpgradeItem_default; // 0x14b0
	UImage* UpgradeItem_Hover; // 0x14b8
	UTextBlock* weapon__; // 0x14c0
	UImage* WeaponColorBg; // 0x14c8
	UImage* WeaponEquipItem_Default; // 0x14d0
	UImage* WeaponEquipItem_Hover; // 0x14d8
	UImage* WeaponItemImage; // 0x14e0
	UTextBlock* WeaponType; // 0x14e8
	ABravoHotelPickup* PickupRef; // 0x14f0
	FInventoryItemInfo DroppedItemInfo; // 0x14f8
	ABravoHotelDropBoxActor* DropBoxRef; // 0x1590
	bool bGold; // 0x1598
	UImage* SelectedHoverImage; // 0x15a0
	FBravoHotelWeaponInfo WeaponData; // 0x15a8
	FLinearColor MedicalBGColor; // 0x20d8
	int32_t CurCount; // 0x20e8
	FMulticastInlineDelegate SetSlotInfo; // 0x20f0
	AActor* TargetActor; // 0x2100
	ABravoHotelCharacter* StealableCharacter; // 0x2108
	TArray<FName> ShowRarityStar; // 0x2110
	TArray<FName> ShowIconBG; // 0x2120
};

struct UAIPerceptionStimuliSourceComponent : UActorComponent {
	char bAutoRegisterAsSource : 1; // 0xb0
	TArray<UAISense*> RegisterAsSourceForSenses; // 0xb8
};

struct UUW-ListWidget_KillMessage_Item_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Anim_Hide; // 0x250
	UWidgetAnimation* Anim_Down; // 0x258
	UHorizontalBox* HorizontalBox_Killer; // 0x260
	UScaleBox* ScaleBox_KillerIcon; // 0x268
	UImage* T_ClassIcon; // 0x270
	UTextBlock* T_Level; // 0x278
	UTextBlock* T_LV; // 0x280
	UTextBlock* T_Name; // 0x288
	FMulticastInlineDelegate OnTimeOut; // 0x290
	ABravoHotelPlayerState* LocalPlayerState; // 0x2a0
};

struct UAkFolder : UAkAudioType {
	FString UnrealFolderPath; // 0x40
	FString WwiseFolderPath; // 0x50
};

struct UGizmoUniformScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0x58
	float ScaleMultiplier; // 0x68
	FVector2D Parameter; // 0x6c
	FGizmoVec2ParameterChange LastChange; // 0x74
	FVector CurScaleOrigin; // 0x84
	FVector CurScaleNormal; // 0x90
	FVector CurScaleAxisX; // 0x9c
	FVector CurScaleAxisY; // 0xa8
	FTransform InitialTransform; // 0xc0
};

struct UUW-Lobby_Craft_List_Category_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_Category; // 0x250
	UCanvasPanel* CanvasPanel_SlotList; // 0x258
	UImage* Image_New; // 0x260
	UTextBlock* T_CategoryName; // 0x268
	UUW-Lobby_Craft_List_Category_Slot_C* UW-Lobby_RecipeList_Category_Item_4; // 0x270
	UUW-Lobby_Craft_List_Category_Slot_C* UW-Lobby_RecipeList_Category_Item_5; // 0x278
	UUW-Lobby_Craft_List_Category_Slot_C* UW-Lobby_RecipeList_Category_Item_6; // 0x280
	UVerticalBox* VerticalBox_ItemList; // 0x288
	UWidgetSwitcher* WidgetSwitcher_Own; // 0x290
	FString WeaponType; // 0x298
	bool IsPressed; // 0x2a8
	bool IsOwn; // 0x2a9
	bool IsOwnAny; // 0x2aa
	UUW-Lobby_Craft_List_C* ParentWidgetRef; // 0x2b0
	float SlotSize; // 0x2b8
	float CurrentListSize; // 0x2bc
	UPaperSprite* DefaultImage; // 0x2c0
	UPaperSprite* HoverImage; // 0x2c8
	UPaperSprite* PressedDefaultImage; // 0x2d0
	UPaperSprite* PressedHoverImage; // 0x2d8
};

struct UParticleModuleAccelerationBase : UParticleModule {
	char bAlwaysInWorldSpace : 1; // 0x30
};

struct UMaterialExpressionReflectionVectorWS : UMaterialExpression {
	FExpressionInput CustomWorldNormal; // 0x40
	char bNormalizeCustomWorldNormal : 1; // 0x54
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x6d8
};

struct ABravoHotelMK3DReplayController : AMK3DReplayController {
	FVector2D MaxViewportSize; // 0x950
	bool bIsShowingTimelineWidget; // 0x958
	bool bIsShowingPlayerListWidget; // 0x959
	bool bIsShowingItemListWidget; // 0x95a
	FTimerHandle DuplicatedReconnectTimeout_TimerHandle; // 0x960
	UUserWidget* MainWidgetRef; // 0x968
	UUserWidget* ReplayMainWidgetRef; // 0x970
	float KillMessageAdditionalEffectiveTime; // 0x978
	AActor* LastViewTarget; // 0x980
	UUserWidget* GameOverlayWidget; // 0x990
	UUserWidget* GameSettingWidget; // 0x998
	UBravoHotelDebugInfo* DebugInfo; // 0x9a0
	ABravoHotelReplayZone* ReplayZone; // 0x9a8
	AActor* CurrentRecordingPawn; // 0x9b0
	ABravoHotelVehicle* TargetVehicle; // 0xa90
	AHUD* K2_AfterKillcamHUD; // 0xaa0
	ABravoHotelPlayerState* RecordingPlayerState; // 0xaa8
};

struct UVectorFieldComponent : UPrimitiveComponent {
	UVectorField* VectorField; // 0x4b0
	float Intensity; // 0x4b8
	float Tightness; // 0x4bc
	char bPreviewVectorField : 1; // 0x4c0
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct UMaterialExpressionRayTracingQualitySwitch : UMaterialExpression {
	FExpressionInput Normal; // 0x40
	FExpressionInput RayTraced; // 0x54
};

struct ABravoHotelAircraftFlight : ACharacter {
	ABravoHotelAircraftPoint* FixedStartingPoint; // 0x5e8
	bool bScrambled; // 0x5f0
	UAkComponent* AudioEmitter; // 0x5f8
	UAkAudioEvent* StartFlyingEvent; // 0x600
	UAkAudioEvent* StopFlyingEvent; // 0x608
	FAudioPlayingHandle FlyingSoundHandle; // 0x610
	TArray<ABravoHotelAircraft*> Aircrafts; // 0x618
	TArray<int32_t> AircraftOrdersForEvenFormation; // 0x628
	TArray<int32_t> AircraftOrdersForOddFormation; // 0x638
	EAircraftMovementMethod MovementMethod; // 0x648
	float ScramblingDuration; // 0x64c
	float ScramblingSpeed; // 0x650
	float DistanceFromBorder; // 0x654
	float SpeedToChangeAltitude; // 0x658
	float TargetAltitude; // 0x65c
	float AltitudeFromTargetAtFirst; // 0x660
	UCameraComponent* CineCamera; // 0x668
	USceneComponent* AircraftRoot; // 0x670
	UParticleSystemComponent* CineParticle; // 0x678
	USplineComponent* CineCameraSpline; // 0x680
	FVector CineDeltaLocation; // 0x688
	float CineInterpSpeed; // 0x694
	float CineInterpSpeedZ; // 0x698
	ABravoHotelCharacter* CinePawn; // 0x6a0
	APlayerController* CineController; // 0x6a8
	float CineCameraBlendTime; // 0x6b0
	char CineCameraBlendFunction; // 0x6b4
	float CineCameraBlendExp; // 0x6b8
	bool bUseSplineAnimation; // 0x6bc
	float SplineAnimationDelayTime; // 0x6c0
	float SplineAnimationTime; // 0x6c4
	FTimeline Timeline_SplineInterp; // 0x6d0
	UCurveFloat* Curve_SplineInterp; // 0x768
	FMulticastInlineDelegate OnStartCinematic; // 0x770
	FMulticastInlineDelegate OnEndCinematic; // 0x780
	TArray<FAircraftCinematic> CinematicSequenceList; // 0x790
	ALevelSequenceActor* LevelSequenceActor; // 0x7a0
	FVector OriginLocation; // 0x7b0
	FVector TargetLocation; // 0x7bc
	FRotator SavedRotation; // 0x7c8
	FVector2D DescentStartPos; // 0x7d4
	FVector2D DescentEndPos; // 0x7dc
	TArray<ABravoHotelAircraft*> AircraftsToScramble; // 0x7e8
	UBravoHotelWeightMapData* WeightMapInfo; // 0x840
	bool bUseUpdateBloom; // 0x870
	float BloomSpeed; // 0x874
	float TargetBloomIntensity; // 0x878
	bool IsVisibleStartPoint; // 0x87c
	bool IsVisibleEndPoint; // 0x87d
	bool IsVisibleAircraf; // 0x87e
	bool IsVisibleAircraftLine; // 0x87f
	bool bWantsToDestroy; // 0x880
	EAircraftFlightState State; // 0x881
};

struct UBoxComponent : UShapeComponent {
	FVector BoxExtent; // 0x4c8
	float LineThickness; // 0x4d4
};

struct UStandinNearPipeline : USimplygonStandinPipeline {
	FAggregationPipelineSettings Settings; // 0x28
};

struct UModularSynthComponent : USynthComponent {
	int32_t VoiceCount; // 0x710
};

struct UTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	FTextBlockStyle TextBlockStyle; // 0x30
};

struct UUW-CompassWidget_C : UBravoHotelCompassWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x350
	UCanvasPanel* CanvasPanel_3; // 0x358
	UCanvasPanel* CanvasPanel_4; // 0x360
	UCanvasPanel* grid; // 0x368
	UImage* Image; // 0x370
	UImage* Image_1; // 0x378
	UImage* Image_2; // 0x380
	UImage* Image_234; // 0x388
	UImage* Image_582; // 0x390
	UInvalidationBox* InvalidationBox_1; // 0x398
	URetainerBox* RetainerBox_108; // 0x3a0
	UUW-PlayerMarkerWidget_C* SupplyBoxMarker; // 0x3a8
	UCanvasPanel* UnitParent; // 0x3b0
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget; // 0x3b8
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_2; // 0x3c0
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_3; // 0x3c8
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_4; // 0x3d0
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_5; // 0x3d8
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_6; // 0x3e0
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_7; // 0x3e8
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_8; // 0x3f0
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_9; // 0x3f8
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_10; // 0x400
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_11; // 0x408
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_12; // 0x410
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_13; // 0x418
	UUW-CompassUnitWidget_C* UW-CompassUnitWidget_C_14; // 0x420
	UUW-PlayerMarkerWidget_C* UW-PlayerMarkerWidget_C_1; // 0x428
	UTextBlock* ViewAngle; // 0x430
	float ScaleForAngleToDistance; // 0x438
	float PositionCurveOffset; // 0x43c
	UCurveFloat* PositionCurve; // 0x440
	float PositionCurveWeight; // 0x448
	float ScaleCurveWeight; // 0x44c
	float ScaleCurveOffset; // 0x450
	int32_t NormalDirectionFontSize; // 0x454
	int32_t SpecialDirectionFontSize; // 0x458
	TArray<UUW-PlayerMarkerWidget_C*> ArrayPlayerMarkerWidget; // 0x460
	FLinearColor NorthColor; // 0x470
	int32_t Angle0To360; // 0x480
	float TempMarkerPosition; // 0x484
	float ArrangedAngle; // 0x488
};

struct UMaterialExpressionConstant2Vector : UMaterialExpression {
	float R; // 0x40
	float G; // 0x44
};

struct UMovieSceneSkeletalAnimationSection : UMovieSceneSection {
	FMovieSceneSkeletalAnimationParams Params; // 0xe0
	UAnimSequence* AnimSequence; // 0x1b8
	UAnimSequenceBase* Animation; // 0x1c0
	float StartOffset; // 0x1c8
	float EndOffset; // 0x1cc
	float PlayRate; // 0x1d0
	char bReverse : 1; // 0x1d4
	FName SlotName; // 0x1d8
};

struct UUW-ReportUserCompleted_C : UBravoHotelReportUserCompletedWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x250
	UButton* btn_confirm; // 0x258
	UImage* popup-bg; // 0x260
	UTextBlock* txt_description; // 0x268
	UImage* uw-bg; // 0x270
	FText DescriptionText; // 0x278
};

struct UUW-ImageText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWrapBox* WrapBox_Main; // 0x250
	FTextBlockStyle DefaultTextStyle; // 0x258
	FText TextString; // 0x4c0
	UBP_GameSettings_C* Game Settings; // 0x4d8
	EHorizontalAlignment HorizontalAlignment; // 0x4e0
	float KeyImageScale; // 0x4e4
};

struct UUW-Inventory_MaterialIconSlot_C : UUW-Inventory_SlotBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1360
	UWidgetAnimation* Complete_ani; // 0x1368
	UWidgetAnimation* Serching_ani; // 0x1370
	UButton* Button; // 0x1378
	UImage* IconBox; // 0x1380
	UImage* Image; // 0x1388
	UImage* Image_2; // 0x1390
	UImage* Image_3; // 0x1398
	UImage* Image_4; // 0x13a0
	UImage* Image_5; // 0x13a8
	UImage* Image_6; // 0x13b0
	UImage* Image_7; // 0x13b8
	UImage* Image_8; // 0x13c0
	UImage* Image_9; // 0x13c8
	UImage* Image_10; // 0x13d0
	UImage* Image_149; // 0x13d8
	UImage* Image_170; // 0x13e0
	UImage* Image_253; // 0x13e8
	UImage* Image_305; // 0x13f0
	UImage* Image_Full; // 0x13f8
	UImage* IMG_ItemIcon; // 0x1400
	UImage* MaterialIcon; // 0x1408
	USizeBox* MouseHover_2; // 0x1410
	USizeBox* MouseHover_; // 0x1418
	USizeBox* MousePress_2; // 0x1420
	USizeBox* MousePress_; // 0x1428
	USizeBox* Searching_; // 0x1430
	UImage* Stroke; // 0x1438
	UImage* Stroke_2; // 0x1440
	UImage* Stroke_3; // 0x1448
	UImage* Stroke_4; // 0x1450
	UWidget* PreHoveredWidget; // 0x1458
	ItemWidgetDragType PreDragType; // 0x1460
	bool Selected; // 0x1461
	int32_t NeedCount; // 0x1464
	FName ItemKey; // 0x1468
	FSelecteSearchMaterialItemInfo SelectItem; // 0x1470
	bool BindSelectSearch; // 0x1480
	bool EnableSearch; // 0x1481
};

struct ABravoHotelShellCasing : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x328
	EProjectileType ProjectileType; // 0x330
	UAkAudioEvent* HitSurfaceEvent; // 0x338
	int8_t CurrentSoundPlayCount; // 0x340
	int8_t MaxSoundPlayCount; // 0x341
};

struct UScrollBar : UWidget {
	FScrollBarStyle WidgetStyle; // 0x108
	USlateWidgetStyleAsset* Style; // 0x5d8
	bool bAlwaysShowScrollbar; // 0x5e0
	bool bAlwaysShowScrollbarTrack; // 0x5e1
	EOrientation Orientation; // 0x5e2
	FVector2D Thickness; // 0x5e4
	FMargin Padding; // 0x5ec
};

struct UUW-Inventory_Proximity_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWrapBox* DropBoxPanel; // 0x250
	UScrollBox* ScrollBox_2; // 0x258
	UWrapBox* WB-BoxList; // 0x260
	UUW-InventoryWidget_C* InventoryWidget; // 0x268
};

struct UUW-ListWidget_MyKillMessage_C : UUW-ListWidget_ItemBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Anim_KillMessage; // 0x268
	UTextBlock* T_Message; // 0x270
};

struct UInterpTrackVisibility : UInterpTrack {
	TArray<FVisibilityTrackKey> VisibilityTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
};

struct UUW-BasicConversation_C : UBravoHotelConversationWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x258
	UWidgetAnimation* First; // 0x260
	UWidgetAnimation* Hide; // 0x268
	UWidgetAnimation* Show; // 0x270
	UWidgetAnimation* Idle; // 0x278
	UImage* Bg; // 0x280
	UImage* Bg_2; // 0x288
	UImage* Bg_3; // 0x290
	UButton* Button_407; // 0x298
	UImage* Image; // 0x2a0
	UImage* Image_2; // 0x2a8
	UImage* Image_55; // 0x2b0
	UImage* Image_340; // 0x2b8
	UOverlay* Overlay_Base; // 0x2c0
	UTextBlock* TextBlock_Message; // 0x2c8
	UTextBlock* TextBlock_SpeakerName; // 0x2d0
	UUW-ImageText_C* UW-ImageText; // 0x2d8
	UWidgetSwitcher* WidgetSwitcher_Face; // 0x2e0
	FSentenceData SentenceData; // 0x2e8
};

struct UGizmoRectangleComponent : UGizmoBaseComponent {
	FVector DirectionX; // 0x4d0
	FVector DirectionY; // 0x4dc
	float OffsetX; // 0x4e8
	float OffsetY; // 0x4ec
	float LengthX; // 0x4f0
	float LengthY; // 0x4f4
	float Thickness; // 0x4f8
	char SegmentFlags; // 0x4fc
};

struct UNiagaraDataInterfaceSkeletalMesh : UNiagaraDataInterface {
	AActor* Source; // 0x30
	FNiagaraUserParameterBinding MeshUserParameter; // 0x38
	USkeletalMeshComponent* SourceComponent; // 0x60
	ENDISkeletalMesh_SkinningMode SkinningMode; // 0x68
	TArray<FName> SamplingRegions; // 0x70
	int32_t WholeMeshLOD; // 0x80
	TArray<FName> FilteredBones; // 0x88
	TArray<FName> FilteredSockets; // 0x98
	FName ExcludeBoneName; // 0xa8
	char bExcludeBone : 1; // 0xb0
};

struct USingleClickInputBehavior : UAnyButtonInputBehavior {
	bool HitTestOnRelease; // 0xc0
};

struct UUW-Radar_Cursor_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Escape_Cursor_Reset; // 0x250
	UWidgetAnimation* MiniNuke_Cursor_Reset; // 0x258
	UWidgetAnimation* Escape_Cursor; // 0x260
	UWidgetAnimation* MiniNuke_Cursor; // 0x268
	UImage* Image_390; // 0x270
	UImage* Image_519; // 0x278
	UImage* Img_CursorNuclear; // 0x280
	USizeBox* SizeBox_Nuclear; // 0x288
	UWidgetSwitcher* WidgetSwitcher_1; // 0x290
	UWidgetAnimation* Anim_MouseClicked; // 0x298
	UUW-Radar_Cursor_Dummy_C* DummyWidgetRef; // 0x2a0
};

struct UReplicationGraphNode_TearOff_ForConnection : UReplicationGraphNode {
	TArray<FTearOffActorInfo> TearOffActors; // 0x50
};

struct UMaterialExpressionAppendVector : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
};

struct ABravoHotelC4RemoteController : ABravoHotelRemoteController {
	ABravoHotelProjectileGrenadeC4* ThrownC4; // 0x1c08
	float EnableDistance; // 0x1c10
	float UpdateCheckTime; // 0x1c20
	bool bEnableRemoteController; // 0x1c24
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UMaterialExpressionCollectionParameter : UMaterialExpression {
	UMaterialParameterCollection* Collection; // 0x40
	FName ParameterName; // 0x48
	FGuid ParameterId; // 0x50
};

struct UHierarchicalLODSetup : UObject {
	TArray<FHierarchicalSimplification> HierarchicalLODSetup; // 0x28
	TSoftObjectPtr<UMaterialInterface> OverrideBaseMaterial; // 0x38
};

struct UPaperGroupedSpriteComponent : UMeshComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x4e0
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x4f0
};

struct UCoherentRenderingSettings : UObject {
	ECoherentRenderingSettingsSeverity RenderingLogSeverity; // 0x28
	bool ShowWarningsOnScreen; // 0x29
	FString DeveloperOptions; // 0x30
};

struct UGizmoComponentAxisSource : UObject {
	USceneComponent* Component; // 0x30
	int32_t AxisIndex; // 0x38
	bool bLocalAxes; // 0x3c
};

struct UDynamicEntryBoxBase : UWidget {
	EDynamicBoxType EntryBoxType; // 0x108
	FVector2D EntrySpacing; // 0x10c
	TArray<FVector2D> SpacingPattern; // 0x118
	FSlateChildSize EntrySizeRule; // 0x128
	EHorizontalAlignment EntryHorizontalAlignment; // 0x130
	EVerticalAlignment EntryVerticalAlignment; // 0x131
	int32_t MaxElementSize; // 0x134
	FUserWidgetPool EntryWidgetPool; // 0x148
};

struct UAkAudioEvent : UAkAssetBase {
	TMap<FString, TSoftObjectPtr<UAkAssetPlatformData>> LocalizedPlatformAssetDataMap; // 0x50
	UAkAudioBank* RequiredBank; // 0xa0
	UAkAssetPlatformData* CurrentLocalizedPlatformData; // 0xb0
	float MaxAttenuationRadius; // 0xb8
	bool IsInfinite; // 0xbc
	float MinimumDuration; // 0xc0
	float MaximumDuration; // 0xc4
};

struct AVolumetricLightmapDensityVolume : AVolume {
	FInt32Interval AllowedMipLevelRange; // 0x360
};

struct UGizmoConstantAxisSource : UObject {
	FVector Origin; // 0x30
	FVector Direction; // 0x3c
};

struct UUW-Revival_PayPopup_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Bg; // 0x250
	UButton* Button_Cancle; // 0x258
	UButton* Button_OK; // 0x260
	UImage* Image; // 0x268
	UImage* Image_168; // 0x270
	UImage* Image_423; // 0x278
	UImage* Image_853; // 0x280
	UImage* Image_1449; // 0x288
	UImage* Image_1451; // 0x290
	UImage* Image_1452; // 0x298
	UImage* Image_1453; // 0x2a0
	UImage* Image_1454; // 0x2a8
	UImage* Image_1965; // 0x2b0
	UImage* Image_1967; // 0x2b8
	UImage* Image_1968; // 0x2c0
	UImage* Image_1969; // 0x2c8
	UImage* Image_1970; // 0x2d0
	UImage* Image_1971; // 0x2d8
	UImage* Image_1972; // 0x2e0
	UImage* Image_1973; // 0x2e8
	UImage* Image_1974; // 0x2f0
	UImage* Image_1975; // 0x2f8
	UImage* Image_1976; // 0x300
	UImage* Image_1977; // 0x308
	UImage* Image_1978; // 0x310
	UImage* Image_2324; // 0x318
	UTextBlock* TextBlock_CurrentGold; // 0x320
	UTextBlock* TextBlock_Price; // 0x328
	ABravoHotelCharacter* TargetCharacter; // 0x330
};

struct UMovieScenePropertyTrack : UMovieSceneNameableTrack {
	UMovieSceneSection* SectionToKey; // 0x58
	FName PropertyName; // 0x60
	FString PropertyPath; // 0x68
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct ACameraActor : AActor {
	EAutoReceiveInput AutoActivateForPlayer; // 0x328
	UCameraComponent* CameraComponent; // 0x330
	USceneComponent* SceneComponent; // 0x338
	char bConstrainAspectRatio : 1; // 0x348
	float AspectRatio; // 0x34c
	float FOVAngle; // 0x350
	float PostProcessBlendWeight; // 0x354
	FPostProcessSettings PostProcessSettings; // 0x360
};

struct UBlueprintGeneratedClass : UClass {
	int32_t NumReplicatedProperties; // 0x2d0
	char bHasNativizedParent : 1; // 0x2d4
	char bHasCookedComponentInstancingData : 1; // 0x2d4
	TArray<UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x2d8
	TArray<UActorComponent*> ComponentTemplates; // 0x2e8
	TArray<UTimelineTemplate*> Timelines; // 0x2f8
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x308
	USimpleConstructionScript* SimpleConstructionScript; // 0x318
	UInheritableComponentHandler* InheritableComponentHandler; // 0x320
	UStructProperty* UberGraphFramePointerProperty; // 0x328
	UFunction* UberGraphFunction; // 0x338
	TMap<FName, FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x340
};

struct UUW-ReplayEventMarker_Resuscitated_C : UUW-ReplayEventMarkerBasic_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UBorder* VisualBorder; // 0x2a8
};

struct URandomVector : UFieldNodeVector {
	float Magnitude; // 0xb0
};

struct UAITask : UGameplayTask {
	AAIController* OwnerController; // 0x68
};

struct UCustomizedChara_DataAsset_C : UPrimaryDataAsset {
	float CharacterRotationVelocity; // 0x30
	float CameraMoveVelocity; // 0x34
	float CameraTop; // 0x38
	float CameraBottom; // 0x3c
	float CameraZoomVelocity; // 0x40
	float CameraInterpSpeed; // 0x44
	float CharacterRotationInterpSpeed; // 0x48
	UCurveFloat* CameraMove; // 0x50
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x338
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x348
	UNavLinkCustomComponent* SmartLinkComp; // 0x358
	bool bSmartLinkIsRelevant; // 0x360
	FMulticastInlineDelegate OnSmartLinkReached; // 0x368
};

struct UMaterialExpressionRuntimeVirtualTextureSampleParameter : UMaterialExpressionRuntimeVirtualTextureSample {
	FName ParameterName; // 0x90
	FGuid ExpressionGUID; // 0x98
	FName Group; // 0xa8
};

struct UNiagaraRendererProperties : UNiagaraMergeable {
	int32_t SortOrderHint; // 0x28
	bool bIsEnabled; // 0x2c
	bool bMotionBlurEnabled; // 0x2d
};

struct UBorderSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UBravoHotelCameraComponent : UCineCameraComponent {
	float ResetCameraMovementFOVThreshold; // 0x968
};

struct UEditableMesh : UObject {
	TArray<UEditableMeshAdapter*> Adapters; // 0x3b8
	int32_t TextureCoordinateCount; // 0x3d0
	int32_t PendingCompactCounter; // 0x51c
	int32_t SubdivisionCount; // 0x520
};

struct UTcpMessagingSettings : UObject {
	bool EnableTransport; // 0x28
	FString ListenEndpoint; // 0x30
	TArray<FString> ConnectToEndpoints; // 0x40
	int32_t ConnectionRetryDelay; // 0x50
	bool bStopServiceWhenAppDeactivates; // 0x54
};

struct USphereComponent : UShapeComponent {
	float SphereRadius; // 0x4c8
};

struct UDataAsset : UObject {
	UDataAsset* NativeClass; // 0x28
};

struct UMaterialExpressionGIReplace : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput StaticIndirect; // 0x54
	FExpressionInput DynamicIndirect; // 0x68
};

struct ABravoHotelWindow : ABravoHotelDestructibleEx {
	TArray<UBravoHotelHIDestructibleComponent*> HIWindowComponents; // 0x338
	TArray<UBravoHotelDestructibleComponent*> WindowComponents; // 0x348
	bool bCreateAudioPortal; // 0x358
	TArray<UBravoHotelAudioPortalComponent*> SpawnedAudioPortalsOnClient; // 0x360
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UUW-GameBuffSlot_BoostCover_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UUW-GameBuffSlot_Boost_C* UW-GameBuffSlot_Boost; // 0x250
	UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x258
};

struct ABP-SpectatorPC_C : ABravoHotelSpectatorController {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1550
	ABP-SpectatorPawn_C* Observer; // 0x1558
	bool PlayingKillCam; // 0x1560
	UBP-SpectatorWidget_C* AfterGameHUD; // 0x1568
	UBravoHotelGameInstance* GameInstanceRef; // 0x1570
	bool bKillCamFinish; // 0x1578
};

struct UWmfMediaSettings : UObject {
	bool AllowNonStandardCodecs; // 0x28
	bool LowLatency; // 0x29
	bool NativeAudioOut; // 0x2a
	bool HardwareAcceleratedVideoDecoding; // 0x2b
};

struct ANavMeshBoundsVolume : AVolume {
	FNavAgentSelector SupportedAgents; // 0x360
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct AGameMode : AGameModeBase {
	FName MatchState; // 0x3c8
	char bDelayedStart : 1; // 0x3d0
	int32_t NumSpectators; // 0x3d4
	int32_t NumPlayers; // 0x3d8
	int32_t NumBots; // 0x3dc
	float MinRespawnDelay; // 0x3e0
	int32_t NumTravellingPlayers; // 0x3e4
	ULocalMessage* EngineMessageClass; // 0x3e8
	TArray<APlayerState*> InactivePlayerArray; // 0x3f0
	float InactivePlayerStateLifeSpan; // 0x400
	int32_t MaxInactivePlayers; // 0x404
	bool bHandleDedicatedServerReplays; // 0x408
};

struct UUW-Inventory_ItemInfoTooltip_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Image_94; // 0x250
	UImage* Image_224; // 0x258
	URichTextBlock* RichTextBlock_321; // 0x260
	UUW-InventoryWidget_C* InventoryRef; // 0x268
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct UParticleModuleBeamNoise : UParticleModuleBeamBase {
	char bLowFreq_Enabled : 1; // 0x30
	int32_t Frequency; // 0x34
	int32_t Frequency_LowRange; // 0x38
	FRawDistributionVector NoiseRange; // 0x40
	FRawDistributionFloat NoiseRangeScale; // 0x88
	char bNRScaleEmitterTime : 1; // 0xb8
	FRawDistributionVector NoiseSpeed; // 0xc0
	char bSmooth : 1; // 0x108
	float NoiseLockRadius; // 0x10c
	char bNoiseLock : 1; // 0x110
	char bOscillate : 1; // 0x110
	float NoiseLockTime; // 0x114
	float NoiseTension; // 0x118
	char bUseNoiseTangents : 1; // 0x11c
	FRawDistributionFloat NoiseTangentStrength; // 0x120
	int32_t NoiseTessellation; // 0x150
	char bTargetNoise : 1; // 0x154
	float FrequencyDistance; // 0x158
	char bApplyNoiseScale : 1; // 0x15c
	FRawDistributionFloat NoiseScale; // 0x160
};

struct APaperFlipbookActor : AActor {
	UPaperFlipbookComponent* RenderComponent; // 0x328
};

struct USoundMix : UObject {
	char bApplyEQ : 1; // 0x28
	float EQPriority; // 0x2c
	FAudioEQEffect EQSettings; // 0x30
	TArray<FSoundClassAdjuster> SoundClassEffects; // 0x70
	float InitialDelay; // 0x80
	float FadeInTime; // 0x84
	float Duration; // 0x88
	float FadeOutTime; // 0x8c
};

struct UNiagaraDataInterfaceColorCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve RedCurve; // 0x58
	FRichCurve GreenCurve; // 0xd8
	FRichCurve BlueCurve; // 0x158
	FRichCurve AlphaCurve; // 0x1d8
};

struct UMovieSceneAkTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
	char bIsAMasterTrack : 1; // 0x68
};

struct UUW-ReplayPlayerListWidget_C : UBravoHotelReplayPlayerListWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UButton* Bt_ListNext; // 0x2e8
	UButton* BT_ListPrev; // 0x2f0
	UScrollBox* ScrollBox_PlayerItem; // 0x2f8
	UTextBlock* T_SortType; // 0x300
	UVerticalBox* VB_ListMain; // 0x308
};

struct USoundClass : UObject {
	FSoundClassProperties Properties; // 0x28
	TArray<USoundClass*> ChildClasses; // 0x80
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0x90
	FSoundModulation Modulation; // 0xa0
	USoundClass* ParentClass; // 0xb0
};

struct UPaperTileMap : UObject {
	int32_t MapWidth; // 0x28
	int32_t MapHeight; // 0x2c
	int32_t TileWidth; // 0x30
	int32_t TileHeight; // 0x34
	float PixelsPerUnrealUnit; // 0x38
	float SeparationPerTileX; // 0x3c
	float SeparationPerTileY; // 0x40
	float SeparationPerLayer; // 0x44
	TSoftObjectPtr<UPaperTileSet> SelectedTileSet; // 0x48
	UMaterialInterface* Material; // 0x70
	TArray<UPaperTileLayer*> TileLayers; // 0x78
	float CollisionThickness; // 0x88
	ESpriteCollisionMode SpriteCollisionDomain; // 0x8c
	ETileMapProjectionMode ProjectionMode; // 0x8d
	int32_t HexSideLength; // 0x90
	UBodySetup* BodySetup; // 0x98
	int32_t LayerNameIndex; // 0xa0
};

struct USoundNodeGroupControl : USoundNode {
	TArray<int32_t> GroupSizes; // 0x48
};

struct AProceduralFoliageBlockingVolume : AVolume {
	AProceduralFoliageVolume* ProceduralFoliageVolume; // 0x360
};

struct UUW-NitroBoomTargetWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Image_73; // 0x250
	UKeyImageWidget_C* KeyImageWidget; // 0x258
};

struct UUW-MatchEndWidget_C : UBravoHotelGameMatchEndWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3c8
	UUW-MatchEnd_Animation_02_C* UW-MatchEnd_Animation_02; // 0x3d0
	UUW-MatchEnd_Ranking2_C* UW-MatchEnd_Ranking2; // 0x3d8
	UWidgetSwitcher* WidgetSwitcher_Type; // 0x3e0
	UUW-MatchEnd_Animation_C* UW_SimpleResult; // 0x3e8
	UUW-MainWidget_C* MainWidgetRef; // 0x3f0
	ABravoHotelPlayerHUD* PlayerHUDRef; // 0x3f8
	UUW-MatchEnd_Ranking_C* UW_FinalResult; // 0x400
	UUW-MatchEnd_Animation_C* UW_Animation; // 0x408
	ABravoHotelPlayerController* PlayerControllerRef; // 0x410
	bool NewResult; // 0x418
	FMatchEndFinalResult ResultData; // 0x419
	bool IsGiveUp; // 0x41d
	float WinMatchEndResultShowTime; // 0x420
	FMatchEndAnimation ResultMatchEndAnimation; // 0x424
};

struct UAkAudioEventData : UAkAssetDataSwitchContainer {
	float MaxAttenuationRadius; // 0x88
	bool IsInfinite; // 0x8c
	float MinimumDuration; // 0x90
	float MaximumDuration; // 0x94
	TMap<FString, UAkAssetDataSwitchContainer*> LocalizedMedia; // 0x98
	TSet<UAkAudioEvent*> PostedEvents; // 0xe8
	TSet<UAkAuxBus*> UserDefinedSends; // 0x138
	TSet<UAkTrigger*> PostedTriggers; // 0x188
	TSet<UAkGroupValue*> GroupValues; // 0x1d8
};

struct UWBP-AmplifierEffect_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* FadeOut; // 0x250
	UWidgetAnimation* FadeIn; // 0x258
	UImage* Image_Effect; // 0x260
	UUMGSequencePlayer* NewVar_1; // 0x268
	bool IsFadeInOutEvent; // 0x270
	float CurrentFade; // 0x274
};

struct UAkLuminInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0x90
	FAkAdvancedInitializationSettingsWithMultiCoreRendering AdvancedSettings; // 0xb8
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct USourceEffectChorusPreset : USoundEffectSourcePreset {
	FSourceEffectChorusSettings Settings; // 0x80
};

struct ABravoHotelMK3DSpectatorPawn : AMK3DSpectatorPawn {
	ABravoHotelMK3DReplayController* ReplayController; // 0x3c0
	float DefaultSpeed; // 0x3c8
	float CurrentSpeedLevel; // 0x3cc
	float MinSpeedLevel; // 0x3d0
	float MaxSpeedLevel; // 0x3d4
};

struct UUW-MatchEnd_RewardSlot_02_Blank_C : UUserWidget {
	UImage* Image_24; // 0x248
};

struct UAnimInstance : UObject {
	FMulticastInlineDelegate OnMontageBlendingOut; // 0x28
	FMulticastInlineDelegate OnMontageStarted; // 0x38
	FMulticastInlineDelegate OnMontageEnded; // 0x48
	FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x58
	FAnimNotifyQueue NotifyQueue; // 0xf0
	TArray<FAnimNotifyEvent> ActiveAnimNotifyState; // 0x160
	char bUsingCopyPoseFromMesh : 1; // 0x258
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x258
	char bPropagateNotifiesToLinkedInstances : 1; // 0x258
	ERootMotionMode RootMotionMode; // 0x259
	char bUseMultiThreadedAnimationUpdate : 1; // 0x25a
	char bQueueMontageEvents : 1; // 0x25a
	USkeleton* CurrentSkeleton; // 0x260
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UInterpGroupCamera : UInterpGroup {
	UCameraAnim* CameraAnimInst; // 0x50
	float CompressTolerance; // 0x58
};

struct UHapticFeedbackEffect_Buffer : UHapticFeedbackEffect_Base {
	TArray<char> Amplitudes; // 0x28
	int32_t SampleRate; // 0x38
};

struct UConsole : UObject {
	ULocalPlayer* ConsoleTargetPlayer; // 0x38
	UTexture2D* DefaultTexture_Black; // 0x40
	UTexture2D* DefaultTexture_White; // 0x48
	TArray<FString> HistoryBuffer; // 0x68
};

struct UBravoHotelCustomMatchWidget : UUserWidget {
	FBravoHotelBlueZoneInfo Data; // 0x248
	TArray<FBattleRoyalPhaseInfo> PhaseInfo; // 0x3f0
};

struct ABP-TransportDropBox_C : ABravoHotelTransportDropBoxActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4b8
	float OverWater_CV_OverWater_77012AB948B572A268E63583418444D0; // 0x4c0
	ETimelineDirection OverWater__Direction_77012AB948B572A268E63583418444D0; // 0x4c4
	UTimelineComponent* OverWater; // 0x4c8
	float HittingWater_CV_OverWater_7E5F9D2E4D0DDDC70F2F67AD035A6212; // 0x4d0
	ETimelineDirection HittingWater__Direction_7E5F9D2E4D0DDDC70F2F67AD035A6212; // 0x4d4
	UTimelineComponent* HittingWater; // 0x4d8
	float LandingTimer; // 0x4e0
	TArray<FSpawnItemResult> ItemResult; // 0x4e8
	float ParachuteTimer; // 0x4f8
	float LandingDelay; // 0x4fc
	float ForceLandingDelaySeconds; // 0x500
	bool bLandedOnGround; // 0x504
};

struct UUW-VehicleSubInfo_Base_C : UUserWidget {
	FLinearColor MySeatColor; // 0x248
	UCanvasPanel* WheelGroup; // 0x258
	UCanvasPanel* SeatGroup; // 0x260
};

struct UUW-ItemDropPopup_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* BlockMouse; // 0x250
	UButton* Button_Accept; // 0x258
	UButton* Button_Cancel; // 0x260
	UButton* Button_Close; // 0x268
	UButton* Button_Max; // 0x270
	UButton* Button_Min; // 0x278
	UImage* Image_9; // 0x280
	USlider* Slider_137; // 0x288
	UTextBlock* TextBlock_Accept; // 0x290
	UTextBlock* TextBlock_MaxCount; // 0x298
	UTextBlock* TextBlock_MinCount; // 0x2a0
	UTextBlock* TextBlock_Title; // 0x2a8
	UEditableTextBox* TextBox_DropCount; // 0x2b0
	int32_t CurrentCount; // 0x2b8
	int32_t MaxCount; // 0x2bc
	FText LastEnteredText; // 0x2c0
	FInventoryItemInfo ItemInfo; // 0x2d8
	FInventoryItemDetailInfo ItemDetailInfo; // 0x370
	ABravoHotelPickup* PickupRef; // 0x800
	ABravoHotelDropBoxActor* DropBoxRef; // 0x808
	UUW-InventoryWidget_C* InventoryWidget; // 0x810
	bool bClosing; // 0x818
	UUW-Inventory_MaterialSlot_C* MaterialSlot; // 0x820
};

struct UParticleModuleLocationEmitterDirect : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct ABravoHotelTransportDropBoxActor : ABravoHotelDropBoxActor {
	EDropBoxState PrevDropBoxState; // 0x3a8
	EDropBoxState CurrentDropBoxState; // 0x3a9
	bool bLandedOnWater; // 0x3aa
	float LandingSeconds; // 0x3bc
	UStaticMeshComponent* DropBoxMesh; // 0x3d8
	UStaticMeshComponent* ParachuteMesh; // 0x3e0
	UAkComponent* DropBoxAudioComponent; // 0x3e8
	UParticleSystemComponent* BoxSmokeParticleFX; // 0x3f0
	UParticleSystemComponent* WaterParticleFX; // 0x3f8
	UParticleSystem* BoxSmokeParticle; // 0x400
	UParticleSystem* WaterParticle; // 0x408
	TSoftObjectPtr<UAkAudioEvent> SmokeStartSound; // 0x410
	TSoftObjectPtr<UAkAudioEvent> SmokeStopSound; // 0x438
	TSoftObjectPtr<UAkAudioEvent> LandOnGroundSound; // 0x460
	TSoftObjectPtr<UAkAudioEvent> LandOnWaterSound; // 0x488
	float SmokeRemainTime; // 0x4b0
	float SmokeEeffectDuration; // 0x4b4
};

struct ABravoHotelSkillTargetingBombing : ABravoHotelSkillTargetingBase {
	UAkAudioEvent* BombingSound; // 0x348
};

struct UAkWwiseTree : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnItemDragged; // 0x118
};

struct UUW-BlackMarket_C : UUserWidget {
	UImage* Image_3; // 0x248
	UImage* IMG-BG; // 0x250
	UImage* IMG-Close; // 0x258
	UImage* IMG-TitleBG; // 0x260
	UUW-BlackMarket_Main_C* UW-BlackMarket_Main; // 0x268
};

struct UMovementComponent : UActorComponent {
	USceneComponent* UpdatedComponent; // 0xb0
	UPrimitiveComponent* UpdatedPrimitive; // 0xb8
	FVector Velocity; // 0xc4
	FVector PlaneConstraintNormal; // 0xd0
	FVector PlaneConstraintOrigin; // 0xdc
	char bUpdateOnlyIfRendered : 1; // 0xe8
	char bAutoUpdateTickRegistration : 1; // 0xe8
	char bTickBeforeOwner : 1; // 0xe8
	char bAutoRegisterUpdatedComponent : 1; // 0xe8
	char bConstrainToPlane : 1; // 0xe8
	char bSnapToPlaneAtStart : 1; // 0xe8
	char bAutoRegisterPhysicsVolumeUpdates : 1; // 0xe8
	char bComponentShouldUpdatePhysicsVolume : 1; // 0xe8
	EPlaneConstraintAxisSetting PlaneConstraintAxisSetting; // 0xeb
};

struct UNativePlayerListWidget : UUserWidget {
	UTextBlock* SortMethodTextBlock; // 0x248
	UButton* PlayerListPrevButton; // 0x250
	UButton* PlayerListNextButton; // 0x258
	UScrollBox* ScrollBox_PlayerName; // 0x260
};

struct UBTService_BlackboardBase : UBTService {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UBasicOverlays : UOverlays {
	TArray<FOverlayItem> Overlays; // 0x28
};

struct UParticleModuleVectorFieldGlobal : UParticleModuleVectorFieldBase {
	char bOverrideGlobalVectorFieldTightness : 1; // 0x30
	float GlobalVectorFieldScale; // 0x34
	float GlobalVectorFieldTightness; // 0x38
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct UEnvQueryTest_Volume : UEnvQueryTest {
	UEnvQueryContext* VolumeContext; // 0x1f8
	AVolume* VolumeClass; // 0x200
	char bDoComplexVolumeTest : 1; // 0x208
};

struct USourceEffectPhaserPreset : USoundEffectSourcePreset {
	FSourceEffectPhaserSettings Settings; // 0x78
};

struct UUW-Inventory_PerkSlot_FX_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* IMG_PerkLevelUpFx; // 0x250
	EPerkSlotFlag PerkSlot; // 0x258
	UTexture* PerkFxTexture; // 0x260
	bool PlayAnimation_1; // 0x268
	float CurrentAnimationTime; // 0x26c
	float AnimLastTime; // 0x270
	UMaterialInstanceDynamic* PerkFxMaterialInstance; // 0x278
	UTexture* UltimatePerkFxTexture; // 0x280
};

struct UImgMediaSource : UBaseMediaSource {
	FFrameRate FrameRateOverride; // 0x88
	FString ProxyOverride; // 0x90
	FDirectoryPath SequencePath; // 0xa0
};

struct UMaterialExpressionClamp : UMaterialExpression {
	FExpressionInput Input; // 0x40
	FExpressionInput Min; // 0x54
	FExpressionInput MAX; // 0x68
	EClampMode ClampMode; // 0x7c
	float MinDefault; // 0x80
	float MaxDefault; // 0x84
};

struct UAISense_Team : UAISense {
	TArray<FAITeamStimulusEvent> RegisteredEvents; // 0x80
};

struct ALevelStreamingVolume : AVolume {
	TArray<FName> StreamingLevelNames; // 0x360
	char bEditorPreVisOnly : 1; // 0x370
	char bDisabled : 1; // 0x370
	EStreamingVolumeUsage StreamingUsage; // 0x374
};

struct UMaterialExpressionCustom : UMaterialExpression {
	FString Code; // 0x40
	ECustomMaterialOutputType OutputType; // 0x50
	FString Description; // 0x58
	TArray<FCustomInput> Inputs; // 0x68
	TArray<FCustomDefine> AdditionalDefines; // 0x78
	TArray<FString> IncludeFilePaths; // 0x88
};

struct UInDoorVolumeComponent : UBoxComponent {
	char AdjustmentTargets; // 0x4d8
};

struct UMovieSceneMediaTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> MediaSections; // 0x58
};

struct UMovieSceneVectorSection : UMovieSceneSection {
	FMovieSceneFloatChannel Curves[0x4]; // 0xe0
	int32_t ChannelsUsed; // 0x360
};

struct UUW-MainWidget_C : UBravoHotelMainWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x450
	UWidgetAnimation* Anim_HideWidget; // 0x458
	UWidgetAnimation* HideLaserPoint; // 0x460
	UWidgetAnimation* ShowLaserPoint; // 0x468
	UBackgroundBlur* BackgroundBlur_154; // 0x470
	UCanvasPanel* Canvas; // 0x478
	UHorizontalBox* HB_PerkSpin; // 0x480
	UImage* RedCircle; // 0x488
	UTextBlock* TextBlock_Start; // 0x490
	UUW-CompassWidget_C* UW-CompassWidget; // 0x498
	UUW-HUDMessageWidget_C* UW-HUDMessageWidget; // 0x4a0
	UUW-InteractionWidget_C* UW-InteractionWidget; // 0x4a8
	UUW-JetpackWidget_C* UW-JetpackWidget; // 0x4b0
	UUW-MS_C* UW-MS; // 0x4b8
	UUW-PerkLevelUp_02_C* UW-PerkLevelUp_02; // 0x4c0
	UUW-VehicleWidget_C* UW-VehicleWidget; // 0x4c8
	ABravoHotelCharacter* TargetPawn; // 0x4d0
	FDisplayAbility LastDisplayAbility; // 0x4d8
	UUW-Radar_Cursor_C* UW-RaderCursorWidget; // 0x4e8
	UUserWidget* UW-DefaultCursorWidget; // 0x4f0
	FTimerHandle Timer_IsMouseWidgetInMap; // 0x4f8
	UUW-NitroBoomTargetWidget_C* UW-NitroBoomTargetWidget; // 0x500
	bool bIsShow; // 0x508
	float TmpViewportUpAngle; // 0x50c
	float TmpViewportSideAngle; // 0x510
	FVector2D CenterPosition; // 0x514
	UUW-MapImageWidget_C* UW-MapImageRef; // 0x520
	FTimerHandle Timer_AutoPerkDeck; // 0x528
	int32_t LastPlayZoneID; // 0x530
	bool bShowLevelUp; // 0x534
	bool IsPlayingUltimateSound; // 0x535
	bool bIsUnlockUltimateSkill; // 0x536
};

struct ULandscapeMeshProxyComponent : UStaticMeshComponent {
	FGuid LandscapeGuid; // 0x548
	TArray<FIntPoint> ProxyComponentBases; // 0x558
	int8_t ProxyLOD; // 0x568
};

struct UPaperTileMapComponent : UMeshComponent {
	int32_t MapWidth; // 0x4e0
	int32_t MapHeight; // 0x4e4
	int32_t TileWidth; // 0x4e8
	int32_t TileHeight; // 0x4ec
	UPaperTileSet* DefaultLayerTileSet; // 0x4f0
	UMaterialInterface* Material; // 0x4f8
	TArray<UPaperTileLayer*> TileLayers; // 0x500
	FLinearColor TileMapColor; // 0x510
	int32_t UseSingleLayerIndex; // 0x520
	bool bUseSingleLayer; // 0x524
	UPaperTileMap* TileMap; // 0x528
};

struct UCustomizableObjectInstance : UObject {
	UCustomizableObject* CustomizableObject; // 0x28
	USkeletalMesh* SkeletalMesh; // 0x30
	TArray<FCustomizableObjectBoolParameterValue> BoolParameters; // 0x38
	TArray<FCustomizableObjectIntParameterValue> IntParameters; // 0x48
	TArray<FCustomizableObjectFloatParameterValue> FloatParameters; // 0x58
	TArray<FCustomizableObjectTextureParameterValue> TextureParameters; // 0x68
	TArray<FCustomizableObjectVectorParameterValue> VectorParameters; // 0x78
	TArray<FCustomizableObjectProjectorParameterValue> ProjectorParameters; // 0x88
	bool bBuildParameterDecorations; // 0x98
	FMulticastInlineDelegate UpdatedDelegate; // 0xa0
	FString SkeletalMeshStatus; // 0x110
	TArray<FString> MaterialTags; // 0x140
	UCustomizableInstancePrivateData* PrivateData; // 0x1d0
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x38
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x40
};

struct UBP-LoadingScreenWidget_C : UBravoHotelLoadingWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UHorizontalBox* HorizontalBox_1; // 0x2a8
	UImage* Image_bg; // 0x2b0
	URichTextBlock* RichTextBlock; // 0x2b8
	URichTextBlock* RichTextBlock_Title; // 0x2c0
	UThrobber* Throbber_1; // 0x2c8
	UVerticalBox* VerticalBox_2; // 0x2d0
	TArray<UTexture2D*> Textures; // 0x2d8
	UBP_GameSettings_C* Game Settings; // 0x2e8
	FString TempString; // 0x2f0
	bool Key; // 0x300
	int32_t RandomTemp; // 0x304
	int32_t ImageIndex; // 0x308
	int32_t TitleIndex; // 0x30c
};

struct USourceEffectSimpleDelayPreset : USoundEffectSourcePreset {
	FSourceEffectSimpleDelaySettings Settings; // 0x80
};

struct APointLight : ALight {
	UPointLightComponent* PointLightComponent; // 0x338
};

struct UBravoHotelLobbyWidget_Web : UBravoHotelCoherentBaseWidget {
	FVector2D MousePos; // 0x364
	bool CheckPreLoad; // 0x36c
	FMulticastInlineDelegate ExitDelegate; // 0x370
	FMulticastInlineDelegate OptionDelegate; // 0x380
	FMulticastInlineDelegate UIButtonOverSoundDelegate; // 0x390
	FMulticastInlineDelegate UIButtonClickSoundDelegate; // 0x3a0
	FMulticastInlineDelegate StoreDelegate; // 0x3b0
	FMulticastInlineDelegate PartyInfoDelegate; // 0x3c0
	FBravoHotelLobbyMapSetting DefaultMapSetting; // 0x3d0
	FBravoHotelLobbyMapSetting DevMapSetting; // 0x3e0
	FBravoHotelLobbyMapSetting MapSetting; // 0x3f0
	UBravoHotelCustomizedCharacter* CustomizedCharacterComponent; // 0x400
	UBravoHotelSupplyBox* SupplyBoxComponent; // 0x408
	UBravoHotelArmory* ArmoryComponent; // 0x410
	UBravoHotelSeason* SeasonComponent; // 0x418
	FMulticastInlineDelegate TabDelegate; // 0x420
	FMulticastInlineDelegate OnPrefetchingProgress; // 0x430
	UParticleSystem* SupplyBoxSpawnEffect; // 0x440
	UCameraPostProcessPreset* PP_Preset_PickupOutline; // 0x448
	int32_t GamePlayTime_Hours; // 0x450
	int32_t PrefetchingProgressPercentage; // 0x454
	bool bTryMatchingConnected; // 0x459
	TSoftClassPtr<UObject> SoftReplayWidgetClass; // 0x460
	FTimerHandle ReMatchingByDS_TimerHandle; // 0x488
	int32_t Gold; // 0x4a0
	TArray<FResponse_Weapon_List_Data> WeaponList; // 0x4a8
	TArray<FResponse_MaterialList_Data> MaterialList; // 0x4b8
	float MaxServerWaitingTime; // 0x4c8
	bool bCraftServerWaiting; // 0x4cc
};

struct ABravoHotelProjectileGrenadeFragment : ABravoHotelProjectileGrenade {
	UMaterialInterface* ExplosionGroundDecalMaterial; // 0x688
	FVector ExplosionGroundDecalSize; // 0x690
	UDecalComponent* ExplosionGroundDecalComponent; // 0x6a0
	UMaterialInstanceDynamic* GroundDecalDynamicMaterial; // 0x6a8
	UAkAudioEvent* FlybyEvent; // 0x6b8
	FAudioPlayingHandle FlybySoundHandle; // 0x6c0
};

struct UTeamInfoUpdaterComponent : UActorComponent {
	FMulticastInlineDelegate OnTeamPlayerIndexChanged; // 0xb0
	FMulticastInlineDelegate OnWidgetUpdateDelegate; // 0xc0
	int32_t TeamPlayerIndex; // 0xd0
	ABravoHotelPlayerState* OldTargetPlayerState; // 0xd8
};

struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x508
	char bDrawPolyEdges : 1; // 0x508
	char bDrawFilledPolys : 1; // 0x508
	char bDrawNavMeshEdges : 1; // 0x508
	char bDrawTileBounds : 1; // 0x508
	char bDrawPathCollidingGeometry : 1; // 0x508
	char bDrawTileLabels : 1; // 0x508
	char bDrawPolygonLabels : 1; // 0x508
	char bDrawDefaultPolygonCost : 1; // 0x509
	char bDrawLabelsOnPathNodes : 1; // 0x509
	char bDrawNavLinks : 1; // 0x509
	char bDrawFailedNavLinks : 1; // 0x509
	char bDrawClusters : 1; // 0x509
	char bDrawOctree : 1; // 0x509
	char bDrawOctreeDetails : 1; // 0x509
	char bDrawMarkedForbiddenPolys : 1; // 0x509
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x50a
	char bDrawNavMesh : 1; // 0x50a
	float DrawOffset; // 0x50c
	char bFixedTilePoolSize : 1; // 0x510
	int32_t TilePoolSize; // 0x514
	float TileSizeUU; // 0x518
	float CellSize; // 0x51c
	float CellHeight; // 0x520
	float AgentRadius; // 0x524
	float AgentHeight; // 0x528
	float AgentMaxHeight; // 0x52c
	float AgentMaxSlope; // 0x530
	float AgentMaxStepHeight; // 0x534
	float MinRegionArea; // 0x538
	float MergeRegionSize; // 0x53c
	float MaxSimplificationError; // 0x540
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x544
	int32_t TileNumberHardLimit; // 0x548
	int32_t PolyRefTileBits; // 0x54c
	int32_t PolyRefNavPolyBits; // 0x550
	int32_t PolyRefSaltBits; // 0x554
	FVector NavMeshOriginOffset; // 0x558
	float DefaultDrawDistance; // 0x564
	float DefaultMaxSearchNodes; // 0x568
	float DefaultMaxHierarchicalSearchNodes; // 0x56c
	ERecastPartitioning RegionPartitioning; // 0x570
	ERecastPartitioning LayerPartitioning; // 0x571
	int32_t RegionChunkSplits; // 0x574
	int32_t LayerChunkSplits; // 0x578
	char bSortNavigationAreasByCost : 1; // 0x57c
	char bPerformVoxelFiltering : 1; // 0x57c
	char bMarkLowHeightAreas : 1; // 0x57c
	char bFilterLowSpanSequences : 1; // 0x57c
	char bFilterLowSpanFromTileCache : 1; // 0x57c
	char bDoFullyAsyncNavDataGathering : 1; // 0x57c
	char bUseBetterOffsetsFromCorners : 1; // 0x57c
	char bStoreEmptyTileLayers : 1; // 0x57c
	char bUseVirtualFilters : 1; // 0x57d
	char bAllowNavLinkAsPathEnd : 1; // 0x57d
	char bUseVoxelCache : 1; // 0x57d
	float TileSetUpdateInterval; // 0x580
	float HeuristicScale; // 0x584
	float VerticalDeviationFromGroundCompensation; // 0x588
};

struct UMaterialExpressionViewProperty : UMaterialExpression {
	EMaterialExposedViewProperty Property; // 0x40
};

struct UMaterialExpressionTime : UMaterialExpression {
	char bIgnorePause : 1; // 0x40
	char bOverride_Period : 1; // 0x40
	float Period; // 0x44
};

struct UMovieSceneLevelVisibilitySection : UMovieSceneSection {
	ELevelVisibility Visibility; // 0xe0
	TArray<FName> LevelNames; // 0xe8
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct USpacer : UWidget {
	FVector2D Size; // 0x108
};

struct UInAppPurchaseRestoreCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct AOculusMR_CastingCameraActor : ASceneCapture2D {
	UVRNotificationsComponent* VRNotificationComponent; // 0x340
	UTexture2D* CameraColorTexture; // 0x348
	UTexture2D* CameraDepthTexture; // 0x350
	UOculusMR_PlaneMeshComponent* PlaneMeshComponent; // 0x358
	UMaterial* ChromaKeyMaterial; // 0x360
	UMaterial* ChromaKeyLitMaterial; // 0x368
	UMaterial* OpaqueColoredMaterial; // 0x370
	UMaterialInstanceDynamic* ChromaKeyMaterialInstance; // 0x378
	UMaterialInstanceDynamic* ChromaKeyLitMaterialInstance; // 0x380
	UMaterialInstanceDynamic* CameraFrameMaterialInstance; // 0x388
	UMaterialInstanceDynamic* BackdropMaterialInstance; // 0x390
	AOculusMR_BoundaryActor* BoundaryActor; // 0x398
	ASceneCapture2D* BoundarySceneCaptureActor; // 0x3a0
	UTexture2D* DefaultTexture_White; // 0x3a8
	TArray<UTextureRenderTarget2D*> BackgroundRenderTargets; // 0x408
	ASceneCapture2D* ForegroundCaptureActor; // 0x418
	TArray<UTextureRenderTarget2D*> ForegroundRenderTargets; // 0x420
	UOculusMR_Settings* MRSettings; // 0x430
	UOculusMR_State* MRState; // 0x438
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UGizmoAxisIntervalParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoFloatParameterSource> FloatParameterSource; // 0x48
	float MinParameter; // 0x58
	float MaxParameter; // 0x5c
};

struct ABP-InventoryPawn_C : ABravoHotelInventoryCharacter {
	USpotLightComponent* SpotLight1; // 0x3f0
};

struct UBookMark2D : UBookmarkBase {
	float Zoom2D; // 0x28
	FIntPoint Location; // 0x2c
};

struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x370
	float DamagePerSec; // 0x374
	UDamageType* DamageType; // 0x378
	float PainInterval; // 0x380
	char bEntryPain : 1; // 0x384
	char BACKUP_bPainCausing : 1; // 0x384
	AController* DamageInstigator; // 0x388
};

struct UWindowTitleBarAreaSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UNiagaraEffectType : UObject {
	ENiagaraScalabilityUpdateFrequency UpdateFrequency; // 0x28
	ENiagaraCullReaction CullReaction; // 0x2c
	TArray<FNiagaraSystemScalabilitySettings> DetailLevelScalabilitySettings; // 0x30
	FNiagaraSystemScalabilitySettingsArray SystemScalabilitySettings; // 0x40
	FNiagaraEmitterScalabilitySettingsArray EmitterScalabilitySettings; // 0x50
};

struct UMovieScene3DPathSection : UMovieScene3DConstraintSection {
	FMovieSceneFloatChannel TimingCurve; // 0x108
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0x1a8
	MovieScene3DPathSection_Axis UpAxisEnum; // 0x1a9
	char bFollow : 1; // 0x1ac
	char bReverse : 1; // 0x1ac
	char bForceUpright : 1; // 0x1ac
};

struct UUW-SpectatingTargetInfo_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Spectator_Ani; // 0x250
	UButton* Button_Report; // 0x258
	UCanvasPanel* Canvas_Finding; // 0x260
	UCanvasPanel* Canvas_Target; // 0x268
	UImage* Deco; // 0x270
	UImage* Image_351; // 0x278
	UImage* IMG_ClassIcon; // 0x280
	UTextBlock* NickName; // 0x288
	UOverlay* Overlay_Report; // 0x290
	UTextBlock* ReportDescriptionText; // 0x298
	UTextBlock* Text_Report; // 0x2a0
	UTextBlock* TextBlock_3; // 0x2a8
	UTextBlock* TextBlock_208; // 0x2b0
	UVerticalBox* VerticalBox_Report; // 0x2b8
	UWidgetSwitcher* WidgetSwitcher_136; // 0x2c0
	bool IsReportAbleDateTime; // 0x2c8
	ABravoHotelPlayerState* TargetPlayerState; // 0x2d0
};

struct UParticleModuleBeamModifier : UParticleModuleBeamBase {
	BeamModifierType ModifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector Position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UBHBForceField : UBravoHotelBuffBase {
	TArray<UAnimInstance*> AnimInstanceArray; // 0x2b8
};

struct UUW-Inventory_ItemSlotHover_C : UBravoHotelInventoryHoverWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x280
	UWidgetAnimation* UpArrow; // 0x288
	UWidgetAnimation* FadeIn; // 0x290
	UImage* Ammo_Compare; // 0x298
	UTextBlock* Ammo_Value; // 0x2a0
	UImage* AmmoIcon; // 0x2a8
	UTextBlock* AmmoInfo; // 0x2b0
	UImage* Arrow_01; // 0x2b8
	UImage* Arrow_02; // 0x2c0
	UWrapBox* BuffList; // 0x2c8
	UWrapBox* BuffList_2; // 0x2d0
	UImage* EffectiveRange_Compare; // 0x2d8
	UTextBlock* EffectiveRange_Value; // 0x2e0
	UImage* FiringRate_Compare; // 0x2e8
	UTextBlock* FiringRate_Value; // 0x2f0
	UHorizontalBox* HorizontalBox_ItemRarity; // 0x2f8
	UHorizontalBox* HorizontalBox_MaterialRarity; // 0x300
	UHorizontalBox* HorizontalBox_WeaponRarity; // 0x308
	UImage* Image; // 0x310
	UImage* Image_2; // 0x318
	UImage* Image_3; // 0x320
	UImage* Image_8; // 0x328
	UImage* Image_9; // 0x330
	UImage* Image_10; // 0x338
	UImage* Image_11; // 0x340
	UImage* Image_12; // 0x348
	UImage* Image_13; // 0x350
	UImage* Image_14; // 0x358
	UImage* Image_15; // 0x360
	UImage* Image_16; // 0x368
	UImage* Image_20; // 0x370
	UImage* Image_22; // 0x378
	UImage* Image_23; // 0x380
	UImage* Image_24; // 0x388
	UImage* Image_25; // 0x390
	UImage* Image_26; // 0x398
	UImage* Image_27; // 0x3a0
	UImage* Image_28; // 0x3a8
	UImage* Image_29; // 0x3b0
	UImage* Image_30; // 0x3b8
	UImage* Image_31; // 0x3c0
	UImage* Image_32; // 0x3c8
	UImage* Image_310; // 0x3d0
	UImage* Image_557; // 0x3d8
	UImage* Image_WeaponLock; // 0x3e0
	UImage* Img_MaterialBG; // 0x3e8
	UImage* IMG_MaterialIcon; // 0x3f0
	UImage* IMG_Stat; // 0x3f8
	UImage* ItemBg; // 0x400
	UImage* ItemBg_01; // 0x408
	UImage* ItemBg_02; // 0x410
	UImage* ItemSlot-BG; // 0x418
	UTextBlock* ItemSlot-Capacity; // 0x420
	UTextBlock* ItemSlot-Capacity_2; // 0x428
	UTextBlock* ItemSlot-Description; // 0x430
	UTextBlock* ItemSlot-Description_2; // 0x438
	UImage* ItemSlot-ItemImage; // 0x440
	UTextBlock* ItemSlot-ItemName; // 0x448
	UTextBlock* ItemSlot-ItemType; // 0x450
	UImage* ItemSlot-ItemTypeMark; // 0x458
	UCanvasPanel* ItemSlotHover; // 0x460
	UImage* PerkBG; // 0x468
	UImage* PerkImage; // 0x470
	UTextBlock* PerkLevelText; // 0x478
	UTextBlock* PerkName; // 0x480
	UCanvasPanel* PerkSlotHover; // 0x488
	UImage* PopupHover-BG_2; // 0x490
	UImage* Power_Compare; // 0x498
	UTextBlock* Power_Value; // 0x4a0
	USizeBox* SizeBox; // 0x4a8
	USizeBox* SizeBox_7; // 0x4b0
	USizeBox* SizeBox_ComparingText; // 0x4b8
	USizeBox* SizeBox_ItemDivide; // 0x4c0
	UImage* Stability_Compare; // 0x4c8
	UTextBlock* Stability_Value; // 0x4d0
	UCanvasPanel* StatSlotHover; // 0x4d8
	UTextBlock* T_BindPlayerName; // 0x4e0
	UTextBlock* T_Material; // 0x4e8
	UTextBlock* T_MaterialDesc; // 0x4f0
	UTextBlock* T_PerkDescLv1; // 0x4f8
	UTextBlock* T_PerkDescLv2; // 0x500
	UTextBlock* T_PerkDescLv3; // 0x508
	UTextBlock* T_Stat; // 0x510
	UTextBlock* T_StatDesc; // 0x518
	URichTextBlock* T_TooltipDesc; // 0x520
	UTextBlock* T_UltimateDesc; // 0x528
	UTextBlock* T_UnlockUltimateLevel; // 0x530
	UTextBlock* Text_CombineTarget; // 0x538
	UTextBlock* TextBlock_3; // 0x540
	UTextBlock* TextBlock_4; // 0x548
	UTextBlock* TextBlock_5; // 0x550
	UTextBlock* TextBlock_6; // 0x558
	UCanvasPanel* UpArrowAni; // 0x560
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot; // 0x568
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_2; // 0x570
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C; // 0x578
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C_2; // 0x580
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C_3; // 0x588
	UUW-Inventory_ItemSlotHover_WeaponSlot_C* UW-Inventory_ItemSlotHover_WeaponSlot_C_4; // 0x590
	UVerticalBox* VerticalBox_3; // 0x598
	UVerticalBox* VerticalBox_BuffList; // 0x5a0
	UVerticalBox* VerticalBox_BuffList_2; // 0x5a8
	UVerticalBox* VerticalBox_CombineTarget; // 0x5b0
	UVerticalBox* VerticalBox_Divide; // 0x5b8
	UVerticalBox* VerticalBox_ItemDivide; // 0x5c0
	UVerticalBox* VerticalBox_WeaponBindedInfo; // 0x5c8
	UTextBlock* WeaponItemCapacity; // 0x5d0
	UTextBlock* WeaponItemComparingName; // 0x5d8
	UTextBlock* WeaponItemDescription; // 0x5e0
	UImage* WeaponItemImage; // 0x5e8
	UImage* WeaponItemSlot-BG; // 0x5f0
	UCanvasPanel* WeaponItemSlotHover; // 0x5f8
	UTextBlock* WeaponItemType; // 0x600
	UImage* WeaponLockImage; // 0x608
	UTextBlock* WeaponName; // 0x610
	UWidgetSwitcher* WidgetSwitcher; // 0x618
	UWidgetSwitcher* WidgetSwitcher_1; // 0x620
	UWidgetSwitcher* WidgetSwitcher_2; // 0x628
	UWidgetSwitcher* WidgetSwitcher_3; // 0x630
	UWidgetSwitcher* WidgetSwitcher_4; // 0x638
	UWidgetSwitcher* WidgetSwitcher_Main; // 0x640
	UWidgetSwitcher* WidgetSwitcher_PerkUltimate; // 0x648
	FInventoryItemInfo ItemInfo; // 0x650
	FBravoHotelWeaponInfo WeaponInfo; // 0x6e8
	bool bCompare; // 0x1218
	FSlateColor NormalSlateColor; // 0x1220
	FSlateColor UpSlateColor; // 0x1248
	FSlateColor DownSlateColor; // 0x1270
	FLinearColor UpLinearColor; // 0x1298
	FLinearColor DownLinearColor; // 0x12a8
	ABravoHotelWeaponBase* WeaponObjectRef; // 0x12b8
	FInventoryItemDetailInfo ItemDetailInfo; // 0x12c0
	FPerkUIInfo PerkInfo; // 0x1750
	FPerkData PerkData; // 0x1780
	FName Ammo; // 0x1860
	ItemWidgetDragType DragType; // 0x1868
	UWidget* HoveredWidget; // 0x1870
	UUserWidget* CurrentShowingWidgetRef; // 0x1878
	bool IsUltimatePerk; // 0x1880
	FText UltimateName; // 0x1888
	FLinearColor UltimateLinearColor; // 0x18a0
	TSoftObjectPtr<UObject> UltimateImage; // 0x18b0
	FTimerHandle HoverTimerHandle; // 0x18d8
	bool NeedCheckVisibility; // 0x18e0
	bool IsVisualMode; // 0x18e1
	bool IsRandomPerk; // 0x18e2
	TArray<UImage*> ItemRarityImages; // 0x18e8
	TArray<UImage*> WeaponRarityImages; // 0x18f8
};

struct UBTTask_FSM_RemoveState : UBTTask_BlackboardBase {
	UStateMachineComponent* FSM; // 0x98
	FName TargetFSM; // 0xa0
	FName StateName; // 0xa8
	bool Debug; // 0xb0
	bool ForceSuccess; // 0xb1
};

struct UUW-BlackMarket_Main_C : UBravoHotelDevelopmentBlackMarket {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UButton* AllItem; // 0x2f0
	UButton* Button_1004; // 0x2f8
	UCheckBox* CheckBox_1; // 0x300
	UCanvasPanel* CP-Column; // 0x308
	UImage* IMG-Ammo; // 0x310
	UImage* IMG-Attachment; // 0x318
	UImage* IMG-Consumable; // 0x320
	UImage* IMG-Custom; // 0x328
	UImage* IMG-Gear; // 0x330
	UImage* IMG-Perk; // 0x338
	UImage* IMG-Preset; // 0x340
	UImage* IMG-TopBG; // 0x348
	UImage* IMG-Vehicle; // 0x350
	UImage* IMG-Weapon; // 0x358
	UImage* IMG-Wearable; // 0x360
	UTextBlock* Text_culture; // 0x368
	UUW-BlackMarket_Character_C* UW-BlackMarket_Character; // 0x370
	UUW-BlackMarket_SubTab_C* UW-BlackMarket_SubTab; // 0x378
	UWrapBox* WB-ItemList; // 0x380
	UWrapBox* WrapBox_6; // 0x388
	EBlackmarketTabType CurrentTab; // 0x390
	FLinearColor SelectTabColor; // 0x394
	FLinearColor UnSelectTabColor; // 0x3a4
	bool ShowWorkInProcess; // 0x3b4
	TArray<FInventoryItemDetailInfo> ItemList; // 0x3b8
	EWeaponType SelectedWeaponSubTab; // 0x3c8
	EWeaponAttachmentType SelectedAttachmentSubTab; // 0x3c9
	EWearableItemType SelectedWearableSubTab; // 0x3ca
	EWearableItemType SelectedGearSubTab; // 0x3cb
	EWearableItemType SelectedCustomSubTab; // 0x3cc
	TArray<int32_t> SortTypeList; // 0x3d0
	TArray<bool> WeaponAscendList; // 0x3e0
	int32_t CurrentWeaponSortType; // 0x3f0
	TArray<bool> AmmoAscendList; // 0x3f8
	int32_t CurrentAmmoSortType; // 0x408
	TArray<bool> AttachmentAscendList; // 0x410
	int32_t CurrentAttachmentSortType; // 0x420
	int32_t CurrentWearableSortType; // 0x424
	int32_t CurrentConsumableSortType; // 0x428
	int32_t CurrentCustomSortType; // 0x42c
	int32_t CurrentVehicleSortType; // 0x430
	TArray<bool> WearableAscendList; // 0x438
	TArray<bool> ConsumableAscendList; // 0x448
	TArray<bool> CustomAscendList; // 0x458
	TArray<bool> VehicleAscendList; // 0x468
	UBP-BlackmarketSaveGame_C* SaveData; // 0x478
	TArray<bool> GearAscendList; // 0x480
	int32_t CurrentGearSortType; // 0x490
	FString BlackmarketSaveSlotName; // 0x498
	int32_t TestIndex; // 0x4a8
	TArray<bool> PerkAscendList; // 0x4b0
	int32_t CurrentPerkSortType; // 0x4c0
	EPerkSlotFlag SelectedPerkSubTab; // 0x4c4
	int32_t CurrentPresetSortType; // 0x4c8
	TArray<bool> PresetAscendList; // 0x4d0
	FName SelectedPerkClass; // 0x4e0
	EItemType SelectedConsumableSubTab; // 0x4e8
};

struct ABravoHotelPlayerController : APlayerController {
	UBravoHotelConversationComponent* ConversationComponent; // 0x718
	UBravoHotelQuestComponent* QuestComponent; // 0x720
	FMulticastInlineDelegate Delegate_OnFinishMatchEndAnimation; // 0x728
	FMulticastInlineDelegate OnResetTeamPlayersInfo; // 0x738
	FMulticastInlineDelegate DelegateAddLog; // 0x750
	FMulticastInlineDelegate DelegateDataEventCharacte; // 0x8e8
	FMulticastInlineDelegate DelegateDataEventCharacteUidList; // 0x8f8
	FMulticastInlineDelegate DelegateOnKillOtherPlayer; // 0x908
	FMulticastInlineDelegate DelegateOnKnockDownOtherPlayer; // 0x918
	FMulticastInlineDelegate DelegateOnWhoKilledMe; // 0x928
	FTimerHandle DuplicatedReconnectTimeout_TimerHandle; // 0x938
	float RequestResuscitationTimeStamp; // 0x944
	bool bIsResuscitated; // 0x948
	FMulticastInlineDelegate DelegateShowWeightMap; // 0xb98
	FMulticastInlineDelegate DelegateInventoryState; // 0xba8
	float ShowUseBoostItemMenuDelayTime; // 0xbb8
	float FragmentMidExplosionSoundDistance; // 0xbbc
	bool bIgnoreInputCloseUI; // 0xbc0
	ABravoHotelPlayerHUD* SpectatingPlayerHUD; // 0xbd0
	bool bEnableHideGun; // 0xbd8
	ABravoHotelCharacter* TempResuscitatedTarget; // 0xbe0
	float SmartPingMenuDelayTime; // 0xbe8
	bool bInfiniteAmmo; // 0xbf0
	float DeathCamTime; // 0xbf4
	float EquipItemMaterialItemAutorSearchTime; // 0xbf8
	TMap<int32_t, ABHPersonalSupplyBox*> SpawnedSupplyBoxList; // 0xc00
	TArray<FHideObjectInfo> HideObjectStack; // 0xc68
	TArray<ABravoHotelPlayerState*> PlayerStateList; // 0xc78
	FVector SpawnBookLocation; // 0xc8c
	TArray<FRepRadialDamageInfo> RadialDamageInfos; // 0xc98
	float LastEquipItemLifeTime; // 0xca8
	int32_t SelectedPersonalSupplyBoxOwnerID; // 0xcb8
	FTimerHandle TimeHandle_RemoveMaterialPing; // 0xcc0
	UCameraShake* OnDamagedCameraShake; // 0xcc8
	bool bIsTeamSpectator; // 0xcd0
	APawn* PreSpectatorTargetPawn; // 0xcd8
	AActor* DeathCamFocus; // 0xce0
	ABravoHotelCharacter* Resuscitater; // 0xce8
	float MinMaterialItemSearchDistance; // 0xcf0
	bool bHideActorMode; // 0xcf4
	float FragmentCloseExplosionCameraShakeScale; // 0xd08
	FMulticastInlineDelegate DelegateMaterialSearchNoti; // 0xd30
	FRepDiedInfo SavedLastDiedInfo; // 0xdc0
	FName LastEquipItem; // 0xea0
	TMap<FName, FMaterialItemList> SpawnedItemList; // 0xea8
	float AutoNameTooltipSecond; // 0xf48
	float FragmentFarExplosionCameraShakeScale; // 0xf4c
	float SearchDelayTime; // 0xf54
	FTimerHandle TimeHandle_ScreenCapture; // 0xf58
	ABravoHotelCharacter* TempResuscitater; // 0xf68
	TArray<FName> NameTooltips; // 0xf70
	bool bSearchExpertWeaponMaterialItem; // 0xf98
	ABravoHotelCharacter* SavedCharacterPawn; // 0xfa0
	float FragmentMidExplosionDistance; // 0xfac
	float AutoNameTooltipDistance; // 0xfb0
	ABravoHotelPlayerController* SuspectController; // 0xfc0
	ESpectatingMode CurrentSpectatingMode; // 0xfd8
	TSoftClassPtr<UObject> SoftCheatWidgetClass; // 0xfe0
	float ReSearchWaitingTime; // 0x1010
	bool HasSpawnBook; // 0x1014
	ABravoHotelBlueZone* ClientBlueZone; // 0x1018
	AActor* SpawnedDeathCam; // 0x1020
	APawn* LastSpectatorTargetPawn; // 0x1040
	FMulticastInlineDelegate DelegateEnableExpertWeaponMaterialSearch; // 0x1048
	UReplicationPingComponet* PingComponent; // 0x1058
	float FragmentFarExplosionSoundDistance; // 0x1060
	float FragmentCloseExplosionSoundTime; // 0x1064
	float MaterialItemPingLifeTime; // 0x1080
	int32_t MaxChangeDeckCount; // 0x1084
	TArray<FBravoHotelMovePoint> TeleportPointList; // 0x1088
	TArray<AActor*> AuthorizedRigidBodiesOnClient; // 0x10a0
	TArray<FBravoHotelMovePoint> MovePointList; // 0x10b0
	FTimerHandle TimerHandle_SetStateSpectator; // 0x10c0
	FMatchEndSimpleResult MatchEndSimpleResult; // 0x10c8
	float FragmentCloseExplosionSoundDistance; // 0x11d8
	FMulticastInlineDelegate DelegatePayGoldOnChangeDeck; // 0x11e0
	float LoseWidgetShowDelay; // 0x11f0
	FTimerHandle TimeHandle_MaterialSearchDelay; // 0x11f8
	FTimerHandle TimeHandle_CheckLastEquipItemInit; // 0x1208
	UCameraShake* ThrowingWeaponExplosionCameraShake; // 0x1210
	bool bSearchMaterialItem; // 0x1219
	int32_t ChangeDeckBasePrice; // 0x121c
	float ChangeDeckMultiflier; // 0x1220
	FTimerHandle TimeHandle_SearchMaterialPing; // 0x1230
	float RemoveMaterialItemDistance; // 0x123c
	bool bEnableLevelStreamimngDistanceScaleByZ; // 0x1250
	bool ImmediatelyRemovePing; // 0x1251
	AActor* SpawnedFieldViewCam; // 0x1258
	float FragmentMidExplosionSoundTime; // 0x126c
	AHUD* SpectatorHUDClass; // 0x12a0
	TMap<int32_t, FName> UseItemMenuList; // 0x12a8
	FTimerHandle TimeHandle_CheckEquipItemMaterialItemAutorSearch; // 0x12f8
	UCameraShake* RedZoneExplosionCameraShake; // 0x1320
	ABravoHotelPlayerState* CurrentVictimPlayerState; // 0x1330
	AActor* DeathCamClass; // 0x1338
	UUserWidget* NoResponseNetworkClass; // 0x1348
	uint32_t PaidAccountGold; // 0x1350
	UUserWidget* ItemRecipeTreeWidgetClass; // 0x1358
	UCameraShake* OnDamagedADSCameraShake; // 0x1370
	float MaxMaterialItemSearchDistance; // 0x1378
	AActor* SpawnedWinCam; // 0x1380
	TArray<FLevelStreamimgPriorityByZ> LevelStreamingPrioritiesByZ; // 0x1388
	bool ResetTeamPlayersInfo; // 0x13a8
	FMulticastInlineDelegate DelegateSelectSearchMaterialItem; // 0x13b0
	bool bUseLevelStreamimngPriorityByZ; // 0x13c0
	bool IgnoreStartStateSearchMaterial; // 0x13c2
	int32_t MaxChangeDeckListCount; // 0x13d8
	UBravoHotelPerkDeckWidget* PerkDeckPopup; // 0x13e0
	FMulticastInlineDelegate DelegatePayGoldOnChangeDeckList; // 0x13e8
	FMulticastInlineDelegate DelegatePayGoldOnSelectDeck; // 0x1400
	float FragmentMidExplosionCameraShakeScale; // 0x1410
	float FragmentFarExplosionSoundTime; // 0x1414
	FSelecteSearchMaterialItemInfo SelectRecipeItem; // 0x141c
	bool bForceCheckSearchMaterialItems; // 0x1440
	TArray<APlayerController*> WatchingPCs; // 0x14b0
	float MaterialItemSearchShowCount; // 0x14c0
	bool bEnableDestroyGun; // 0x14c4
	FMulticastInlineDelegate DelegateChoosePerkDeck; // 0x14c8
	float FragmentFarExplosionDistance; // 0x14d8
	FMulticastInlineDelegate DelegateEnableMaterialSearch; // 0x14e0
	float FragmentCloseExplosionDistance; // 0x14f4
	uint32_t AccountGold; // 0x14f8
	int32_t SelectDeckPrice; // 0x14fc
	AActor* SpawnedResusciatedCam; // 0x1500
	UUserWidget* CheatWidget; // 0x1510
	UBravoHotelDebugInfo* DebugInfo; // 0x1518
	UCameraPostProcessPreset* PP_BlueZone; // 0x1520
	float FragmentChangeStateDelayTime; // 0x1528
};

struct UInterpTrackMoveAxis : UInterpTrackFloatBase {
	EInterpMoveAxis MoveAxis; // 0x90
	FInterpLookupTrack LookupTrack; // 0x98
};

struct AMK3DUserInterfaceManager : AActor {
	TArray<FUserWidgetInfoForReplay_T> WidgetInfoArray; // 0x328
	TMap<FString, UUserWidget*> ReplayWidgetMap; // 0x338
};

struct UMovieSceneComponentMaterialTrack : UMovieSceneMaterialTrack {
	int32_t MaterialIndex; // 0x68
};

struct UAkIOSInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkAudioSession AudioSession; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa0
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xc8
};

struct UDatasmithAreaLightActorTemplate : UDatasmithObjectTemplate {
	EDatasmithAreaLightActorType LightType; // 0x30
	EDatasmithAreaLightActorShape LightShape; // 0x31
	FVector2D Dimensions; // 0x34
	FLinearColor Color; // 0x3c
	float Intensity; // 0x4c
	ELightUnits IntensityUnits; // 0x50
	float Temperature; // 0x54
	TSoftObjectPtr<UTextureLightProfile> IESTexture; // 0x58
	bool bUseIESBrightness; // 0x80
	float IESBrightnessScale; // 0x84
	FRotator Rotation; // 0x88
	float SourceRadius; // 0x94
	float SourceLength; // 0x98
	float AttenuationRadius; // 0x9c
};

struct UMovieSceneCameraAnimTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> CameraAnimSections; // 0x58
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x328
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x330
};

struct AAkReverbVolume : AVolume {
	char bEnabled : 1; // 0x360
	UAkAuxBus* AuxBus; // 0x368
	FString AuxBusName; // 0x370
	float SendLevel; // 0x380
	float FadeRate; // 0x384
	float Priority; // 0x388
	UAkLateReverbComponent* LateReverbComponent; // 0x390
};

struct UObjectLibrary : UObject {
	UObject* ObjectBaseClass; // 0x28
	bool bHasBlueprintClasses; // 0x30
	TArray<UObject*> Objects; // 0x38
	TArray<TWeakObjectPtr<UObject>> WeakObjects; // 0x48
	bool bUseWeakReferences; // 0x58
	bool bIsFullyLoaded; // 0x59
};

struct AARSharedWorldGameState : AGameState {
	TArray<char> PreviewImageData; // 0x398
	TArray<char> ARWorldData; // 0x3a8
	int32_t PreviewImageBytesTotal; // 0x3b8
	int32_t ARWorldBytesTotal; // 0x3bc
	int32_t PreviewImageBytesDelivered; // 0x3c0
	int32_t ARWorldBytesDelivered; // 0x3c4
};

struct UUW-MatchEnd_ButtonBase_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button; // 0x250
	UTextBlock* Button_Text; // 0x258
	UOverlay* Overlay_Button; // 0x260
	FText ButtonText; // 0x268
	FMulticastInlineDelegate OnClicked; // 0x280
	FMulticastInlineDelegate OnPressed; // 0x290
	FMulticastInlineDelegate OnReleased; // 0x2a0
	FMulticastInlineDelegate OnHovered; // 0x2b0
};

struct UMagicLeapHeadTrackingNotificationsComponent : UVRNotificationsComponent {
	FMulticastInlineDelegate OnHeadTrackingLost; // 0x140
	FMulticastInlineDelegate OnHeadTrackingRecovered; // 0x150
	FMulticastInlineDelegate OnHeadTrackingRecoveryFailed; // 0x160
	FMulticastInlineDelegate OnHeadTrackingNewSessionStarted; // 0x170
};

struct UBTService : UBTAuxiliaryNode {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UDevWidget_C : UBravoHotelSettingSubWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x298
	UButton* ButtonClearStats; // 0x2a0
	UButton* ButtonDebugVehicle; // 0x2a8
	UButton* ButtonEngine; // 0x2b0
	UButton* ButtonFPS; // 0x2b8
	UButton* ButtonGameplayTick; // 0x2c0
	UButton* ButtonMemory; // 0x2c8
	UButton* ButtonNetwork; // 0x2d0
	UButton* ButtonParticles; // 0x2d8
	UButton* ButtonSceneRendering; // 0x2e0
	UButton* ButtonStatSlow; // 0x2e8
	UButton* ButtonUnitGraph; // 0x2f0
	UComboBoxString* ComboBoxViewModes; // 0x2f8
	UComboBoxString* ComboBoxViewModes1; // 0x300
	UButton* DeleteSettingsSaveFile; // 0x308
	USlider* GameSpeed; // 0x310
	UEditableText* GameSpeedEdit; // 0x318
	UHorizontalBox* HorizontalBox_8; // 0x320
	UHorizontalBox* HorizontalBox_9; // 0x328
	UHorizontalBox* HorizontalBox_10; // 0x330
	UHorizontalBox* HorizontalBox_11; // 0x338
	UHorizontalBox* HorizontalBox_12; // 0x340
	UHorizontalBox* HorizontalBox_13; // 0x348
	UCheckBox* PauseGame; // 0x350
	UCheckBox* TemporalAACatmullRomCheck; // 0x358
	UEditableText* TemporalAACurrentFrameWeightEdit; // 0x360
	UEditableText* TemporalAAFilterSizeEdit; // 0x368
	UCheckBox* TemporalAAPauseCorrectChek; // 0x370
	UEditableText* TemporalAASamplesEdit; // 0x378
	UEditableText* TonemapperSharpenEdit; // 0x380
	UHorizontalBox* ToolTip_DeleteSettings; // 0x388
	UHorizontalBox* ToolTip_GameSpeed; // 0x390
	UHorizontalBox* ToolTip_PauseGame; // 0x398
	UVerticalBox* ToolTip_StatCommands; // 0x3a0
	UVerticalBox* ToolTip_ViewModes; // 0x3a8
	UVerticalBox* ToolTip_ViewModes_2; // 0x3b0
	UBP_GameSettings_C* Game Settings; // 0x3b8
	float Time Dilation Value Binding; // 0x3c0
	FText Time Dilation Text Binding; // 0x3c8
	FMulticastInlineDelegate Settings File Deleted; // 0x3e0
	FMulticastInlineDelegate Pause Game When Menu Open; // 0x3f0
	FText TemporalAAFilterSizeTextBinding; // 0x400
	FText TemporalAACurrentFrameWeightTextBinding; // 0x418
	FText TemporalAASamplesTextBinding; // 0x430
	FText TonemapperSharpenTextBinding; // 0x448
	float TemporalAAFilterSizeValue; // 0x460
	float TemporalAACurrentFrameWeightValue; // 0x464
	int32_t TemporalAASamplesValue; // 0x468
	float TonemapperSharpenValue; // 0x46c
	FName TempKey; // 0x470
	TMap<FName, FString> Temp; // 0x478
	ESettingType Type; // 0x4c8
	float TempValue2; // 0x4cc
	bool IsOnDebugVehicle; // 0x4d0
};

struct UHapticFeedbackEffect_SoundWave : UHapticFeedbackEffect_Base {
	USoundWave* SoundWave; // 0x28
};

struct UBHBWeaponUpgradeEffectBase : UBHBUpgradeMaterialEffectBase {
	ABravoHotelWeaponBase* TargetWeapon; // 0x420
};

struct UVectorField : UObject {
	FBox Bounds; // 0x28
	float Intensity; // 0x44
};

struct UBravoHotelReplayPlayerListGroup : UUserWidget {
	ABravoHotelPlayerState* PlayerState; // 0x250
	UVerticalBox* VBPlayerList; // 0x258
};

struct UBTTask_FSM_SetState : UBTTask_BlackboardBase {
	UStateMachineComponent* FSM; // 0x98
	FName TargetFSM; // 0xa0
	FName StateName; // 0xa8
	bool Debug; // 0xb0
	bool ForceSuccess; // 0xb1
};

struct UInterpTrackInstProperty : UInterpTrackInst {
	TFieldPath<FProperty> InterpProperty; // 0x28
	UObject* PropertyOuterObjectInst; // 0x48
};

struct ANiagaraPreviewGrid : AActor {
	UNiagaraSystem* System; // 0x328
	ENiagaraPreviewGridResetMode ResetMode; // 0x330
	UNiagaraPreviewAxis* PreviewAxisX; // 0x338
	UNiagaraPreviewAxis* PreviewAxisY; // 0x340
	ANiagaraPreviewBase* PreviewClass; // 0x348
	float SpacingX; // 0x350
	float SpacingY; // 0x354
	int32_t NumX; // 0x358
	int32_t NumY; // 0x35c
	TArray<UChildActorComponent*> PreviewComponents; // 0x360
};

struct UParkourWindowComponent : USceneComponent {
	TArray<FClimbData> ClimbOverDatas; // 0x230
	TArray<FClimbData> ClimbUpDatas; // 0x240
	TArray<FClimbData> SprintOverDatas; // 0x250
	TArray<FClimbData> SprintUpDatas; // 0x260
	TArray<FClimbData> GroundingDatas; // 0x270
};

struct UInAppPurchaseQueryCallbackProxy2 : UObject {
	FMulticastInlineDelegate OnSuccess; // 0x28
	FMulticastInlineDelegate OnFailure; // 0x38
};

struct USourceEffectStereoDelayPreset : USoundEffectSourcePreset {
	FSourceEffectStereoDelaySettings Settings; // 0x7c
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x68
	FName TrackName; // 0x78
};

struct UNiagaraMeshRendererProperties : UNiagaraRendererProperties {
	UStaticMesh* ParticleMesh; // 0x50
	ENiagaraSortMode SortMode; // 0x58
	char bOverrideMaterials : 1; // 0x5c
	char bSortOnlyWhenTranslucent : 1; // 0x5c
	TArray<FNiagaraMeshMaterialOverride> OverrideMaterials; // 0x60
	FVector2D SubImageSize; // 0x70
	char bSubImageBlend : 1; // 0x78
	ENiagaraMeshFacingMode FacingMode; // 0x7c
	char bLockedAxisEnable : 1; // 0x80
	FVector LockedAxis; // 0x84
	ENiagaraMeshLockedAxisSpace LockedAxisSpace; // 0x90
	FNiagaraVariableAttributeBinding PositionBinding; // 0x98
	FNiagaraVariableAttributeBinding ColorBinding; // 0x110
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x188
	FNiagaraVariableAttributeBinding MeshOrientationBinding; // 0x200
	FNiagaraVariableAttributeBinding ScaleBinding; // 0x278
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x2f0
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x368
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x3e0
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x458
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4d0
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x548
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x5c0
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x638
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x6b0
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UAnimNotify_PlayMontageNotify : UAnimNotify {
	FName NotifyName; // 0x38
};

struct AScenarioGameMode : ABravoHotelGameMode {
	UBravoHotelScenarioComponent* ScenarioComponent; // 0x590
	FName DefaultCharacterDeck; // 0x598
};

struct UDestructibleFractureSettings : UObject {
	int32_t CellSiteCount; // 0x28
	FFractureMaterial FractureMaterialDesc; // 0x2c
	int32_t RandomSeed; // 0x50
	TArray<FVector> VoronoiSites; // 0x58
	int32_t OriginalSubmeshCount; // 0x68
	TArray<UMaterialInterface*> Materials; // 0x70
	TArray<FDestructibleChunkParameters> ChunkParameters; // 0x80
};

struct UMaterialExpressionFrac : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UWB_ToolTipDesign_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	FText My Tool Tip Text; // 0x250
};

struct USynthComponent : USceneComponent {
	char bAutoDestroy : 1; // 0x230
	char bStopWhenOwnerDestroyed : 1; // 0x230
	char bAllowSpatialization : 1; // 0x230
	char bOverrideAttenuation : 1; // 0x230
	char bOutputToBusOnly : 1; // 0x234
	USoundAttenuation* AttenuationSettings; // 0x238
	FSoundAttenuationSettings AttenuationOverrides; // 0x240
	USoundConcurrency* ConcurrencySettings; // 0x5e0
	TSet<USoundConcurrency*> ConcurrencySet; // 0x5e8
	USoundClass* SoundClass; // 0x638
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x640
	USoundSubmixBase* SoundSubmix; // 0x648
	TArray<FSoundSubmixSendInfo> SoundSubmixSends; // 0x650
	TArray<FSoundSourceBusSendInfo> BusSends; // 0x660
	FSoundModulation Modulation; // 0x670
	TArray<FSoundSourceBusSendInfo> PreEffectBusSends; // 0x680
	char bIsUISound : 1; // 0x690
	char bIsPreviewSound : 1; // 0x690
	int32_t EnvelopeFollowerAttackTime; // 0x694
	int32_t EnvelopeFollowerReleaseTime; // 0x698
	FMulticastInlineDelegate OnAudioEnvelopeValue; // 0x6a0
	USynthSound* Synth; // 0x6d0
	UAudioComponent* AudioComponent; // 0x6d8
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2c8
	float FOVAngle; // 0x2cc
	float OrthoWidth; // 0x2d0
	UTextureRenderTarget2D* TextureTarget; // 0x2d8
	ESceneCaptureCompositeMode CompositeMode; // 0x2e0
	FPostProcessSettings PostProcessSettings; // 0x2f0
	float PostProcessBlendWeight; // 0x8b0
	char bOverride_CustomNearClippingPlane : 1; // 0x8b4
	float CustomNearClippingPlane; // 0x8b8
	bool bUseCustomProjectionMatrix; // 0x8bc
	FMatrix CustomProjectionMatrix; // 0x8c0
	bool bEnableClipPlane; // 0x900
	FVector ClipPlaneBase; // 0x904
	FVector ClipPlaneNormal; // 0x910
	char bCameraCutThisFrame : 1; // 0x91c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x91c
	bool bDisableFlipCopyGLES; // 0x920
};

struct UBP_GameSettingsWrapper_C : UObject {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
	UBP_GameSettings_C* Game Settings; // 0x30
};

struct UBP-WidgetDrag_C : UDragDropOperation {
	UUserWidget* WidgetReference; // 0x88
	ItemWidgetDragType InventorySlotWidgetKind; // 0x90
};

struct UCanvasRenderTarget2D : UTextureRenderTarget2D {
	FMulticastInlineDelegate OnCanvasRenderTargetUpdate; // 0xe8
	TWeakObjectPtr<UWorld> World; // 0xf8
	bool bShouldClearRenderTargetOnReceiveUpdate; // 0x100
};

struct UBHReplicatedPlayStat : UActorComponent {
	bool bAlive; // 0xc0
	bool InOuterArea; // 0xc1
	uint16_t kills; // 0xc2
	uint16_t assists; // 0xc4
	uint16_t Deaths; // 0xc6
	uint16_t Revives; // 0xc8
	uint16_t Resuscitates; // 0xca
	int32_t CurrentPerkClassLevel; // 0xcc
};

struct UDatasmithSpotLightComponentTemplate : UDatasmithObjectTemplate {
	float InnerConeAngle; // 0x30
	float OuterConeAngle; // 0x34
};

struct UAIDataProvider_QueryParams : UAIDataProvider {
	FName ParamName; // 0x28
	float FloatValue; // 0x30
	int32_t IntValue; // 0x34
	bool BoolValue; // 0x38
};

struct UMovieSceneAkAudioRTPCSection : UMovieSceneSection {
	UAkRtpc* RTPC; // 0xe0
	FString Name; // 0xe8
	FRichCurve FloatCurve; // 0xf8
	FMovieSceneFloatChannelSerializationHelper FloatChannelSerializationHelper; // 0x178
	FMovieSceneFloatChannel RTPCChannel; // 0x1a8
};

struct UPrimaryAssetLabel : UPrimaryDataAsset {
	FPrimaryAssetRules Rules; // 0x30
	char bLabelAssetsInMyDirectory : 1; // 0x3c
	char bIsRuntimeLabel : 1; // 0x3c
	TArray<TSoftObjectPtr<UObject>> ExplicitAssets; // 0x40
	TArray<TSoftClassPtr<UObject>> ExplicitBlueprints; // 0x50
	FCollectionReference AssetCollection; // 0x60
};

struct UAggregationPipeline : USimplygonPipeline {
	FAggregationPipelineSettings Settings; // 0x28
};

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
	FGuid ObjectGuid; // 0x68
};

struct ABattleRoyaleGameState : ABravoHotelGameState {
	bool IsNewItemSpawnMode; // 0x690
	int32_t TeamSize; // 0x694
	EGameMode GameRule; // 0x698
	EBattleRoyaleState BattleRoyaleState; // 0x699
	int32_t TotalPlayerCount; // 0x69c
	int32_t TotalAIPlayerCount; // 0x6a0
	int32_t CurrentPlayerCount; // 0x6a4
	int32_t CurrentTeamCount; // 0x6a8
	int32_t TotalTeamCount; // 0x6ac
	FMulticastInlineDelegate OnBattleRoyalStateChanged; // 0x6b0
	FMulticastInlineDelegate OnRocketLaunch; // 0x6c0
	FMulticastInlineDelegate OnItemSpawnModeChanged; // 0x6d0
	FMulticastInlineDelegate OnChangeRemainTime; // 0x6e0
	bool bCheckSeaLevelZ; // 0x6f0
	float SeaLevelZ; // 0x6f4
	int32_t GhostPlayerCountForTest; // 0x6fc
	FMulticastInlineDelegate OnRepTeamSize; // 0x700
	TArray<FCharacterDiedInfo> CharacterDiedInfos; // 0x710
	TArray<FTeamEndInfo> TeamEndInfos; // 0x720
	TArray<FAirCraftBoardingPlayerList> AirCraftBoardingInfos; // 0x730
	ABravoHotelRedZone* redzone; // 0x740
	ABravoHotelRedZoneManager* RedZoneManager; // 0x748
	FMulticastInlineDelegate AirCraftDescentPlayerInfoEvent; // 0x7a8
	FMulticastInlineDelegate EndAirCraftBoardingPlayerEvent; // 0x7b8
	ABravoHotelAircraftFlight* AircraftFlightRef; // 0x7c8
	FMulticastInlineDelegate OnRepCurrentPlayerCount; // 0x7d0
	FMulticastInlineDelegate OnRepCurrentTeamCount; // 0x7e0
	FMulticastInlineDelegate OnUpdateClassCount; // 0x7f0
	TArray<UObject*> RestoreList; // 0x800
	FTimerHandle TimerHandle_MoveToLobbyLevel; // 0x818
	TMap<FName, int32_t> CurrentClassCounts; // 0x820
	int32_t AutoBotCount; // 0x870
};

struct UMaterialExpressionPerInstanceCustomData : UMaterialExpression {
	FExpressionInput DefaultValue; // 0x40
	float ConstDefaultValue; // 0x54
	uint32_t DataIndex; // 0x58
};

struct UBTTask_BlackboardBase : UBTTaskNode {
	FBlackboardKeySelector BlackboardKey; // 0x70
};

struct ABP-Projectile_FlameThrowerFireCell_C : ABravoHotelProjectileMolotovFireCell {
	float TextureScale; // 0x3b0
	float BurnArea; // 0x3b4
};

struct UInputComponent : UActorComponent {
	TArray<FCachedKeyToActionInfo> CachedKeyToActionInfo; // 0x120
};

struct ABravoHotelProjectileBullet : ABravoHotelProjectile {
	TArray<FHitResult> BeginOverlapHitResults; // 0x4d8
	TArray<AActor*> HitActors; // 0x4f0
	float ImpulsePowerRate; // 0x500
	UBravoHotelDamageType* ProjectileDamageType; // 0x508
	UAkAudioEvent* FlybyAudioEvent; // 0x510
	FVector BulletSpawnLocation; // 0x518
	AActor* FlybyTargetActor; // 0x528
	bool bStopUpdateFlyby; // 0x530
	FTimerHandle TimerHandle_UpdateFlyby; // 0x538
	ABravoHotelCharacter* TargetPawn; // 0x548
};

struct UMaterialExpressionMapARPassthroughCameraUV : UMaterialExpression {
	FExpressionInput Coordinates; // 0x40
};

struct UWidgetSwitcherSlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct UUW-ReplayPlayerListGroupWidget_C : UBravoHotelReplayPlayerListGroup {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Img_TeamColor; // 0x268
	UTextBlock* T_TeamNum; // 0x270
	UVerticalBox* VB_PlayerList; // 0x278
};

struct UEnvQueryGenerator_ActorsOfClass : UEnvQueryGenerator {
	AActor* SearchedActorClass; // 0x50
	FAIDataProviderBoolValue GenerateOnlyActorsInRadius; // 0x58
	FAIDataProviderFloatValue SearchRadius; // 0x90
	UEnvQueryContext* SearchCenter; // 0xc8
};

struct UAvoidanceManager : UObject {
	float DefaultTimeToLive; // 0x30
	float LockTimeAfterAvoid; // 0x34
	float LockTimeAfterClean; // 0x38
	float DeltaTimeToPredict; // 0x3c
	float ArtificialRadiusExpansion; // 0x40
	float TestHeightDifference; // 0x44
	float HeightCheckMargin; // 0x48
};

struct ABravoHotelMagazineForDrop : AActor {
	UStaticMeshComponent* MagazineMeshComponent; // 0x328
	FTransform SpawnedSocketTransform; // 0x330
	ABravoHotelRangedWeapon* OwnerWeaponRef; // 0x360
};

struct UFSM_SetStateID_ConditionalAsync : UBlueprintAsyncActionBase {
	UStateMachineComponent* Target; // 0x30
	FSM_Transition Conditional; // 0x38
	char StateID; // 0x39
	float Timer; // 0x3c
	bool Repeat; // 0x40
	FTimerHandle TimerHandle; // 0x48
	FMulticastInlineDelegate OnSuccess; // 0x50
	FMulticastInlineDelegate OnAborted; // 0x60
};

struct USubmixEffectDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectDelaySettings Settings; // 0x74
	FSubmixEffectDelaySettings DynamicSettings; // 0x80
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct ARuntimeVirtualTextureVolume : AActor {
	URuntimeVirtualTextureComponent* VirtualTextureComponent; // 0x328
};

struct UInputBehaviorSet : UObject {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct ASpotLight : ALight {
	USpotLightComponent* SpotLightComponent; // 0x338
};

struct UBHBAdditiveCrosshairBase : UBravoHotelBuffBase {
	FName CrosshairTableRow; // 0x2b8
};

struct UUW-Inventory_CarriedSlot_C : UUW-Inventory_SlotBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1360
	UWidgetAnimation* Ani_Tutorial_Glow; // 0x1368
	UWidgetAnimation* C_Slot_Up_Arrow; // 0x1370
	UWidgetAnimation* C_SlotHover_ItemState_Hide; // 0x1378
	UWidgetAnimation* C_SlotHover_ItemState_Show; // 0x1380
	UWidgetAnimation* C_SlotHover; // 0x1388
	UImage* BGImage; // 0x1390
	UImage* BGImage_2; // 0x1398
	UCanvasPanel* CanvasPanel_ITemState; // 0x13a0
	UTextBlock* Count120; // 0x13a8
	UImage* Crate_Default; // 0x13b0
	UImage* Crate_Hover; // 0x13b8
	UImage* Effect_Booster; // 0x13c0
	UImage* Effect_Capsule; // 0x13c8
	UHorizontalBox* HorizontalBox_Rarity; // 0x13d0
	UImage* HoverImage; // 0x13d8
	UImage* HoverImage_Round; // 0x13e0
	UImage* Image_531; // 0x13e8
	UImage* Image_539; // 0x13f0
	UImage* Image_540; // 0x13f8
	UImage* Image_541; // 0x1400
	UImage* Image_542; // 0x1408
	UImage* Image_543; // 0x1410
	UImage* Image_544; // 0x1418
	UImage* Image_Bindable; // 0x1420
	UImage* Image_Supply; // 0x1428
	UImage* ItemImage; // 0x1430
	UTextBlock* ItemState_Text; // 0x1438
	UImage* KeepedItem_List; // 0x1440
	UImage* KeepedItem_ListHover; // 0x1448
	UImage* LvColor; // 0x1450
	UImage* Motion; // 0x1458
	UProgressBar* ProgressBar_309; // 0x1460
	USizeBox* SizeBox_1; // 0x1468
	UTextBlock* TextBlock_3; // 0x1470
	UImage* Tutorial_Glow; // 0x1478
	UUW-MouseRightClick_C* UW-MouseRightClick_Big; // 0x1480
	UUW-MouseRightClick_C* UW-MouseRightClick_Small; // 0x1488
	UImage* WeaponColorBg; // 0x1490
	UImage* WeaponEquipItem_Default; // 0x1498
	UImage* WeaponEquipItem_Hover; // 0x14a0
	UImage* WeaponItemImage; // 0x14a8
	int32_t InventoryItemInfoIndex; // 0x14b0
	FLinearColor MedicalBGColor; // 0x14b4
	int32_t CurCount; // 0x14c4
	FMulticastInlineDelegate SetSlotInfo; // 0x14c8
	bool CanUseCapsule; // 0x14d8
	UImage* SelectedHoverImage; // 0x14e0
	TArray<FName> ShowRarityStar; // 0x14e8
	TArray<FName> ShowIconBG; // 0x14f8
};

struct USignificanceManager : UObject {
	FSoftClassPath SignificanceManagerClassName; // 0x1a8
};

struct UMaterialExpressionVertexInterpolator : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct ULightComponentBase : USceneComponent {
	FGuid LightGuid; // 0x230
	float Brightness; // 0x240
	float Intensity; // 0x244
	FColor LightColor; // 0x248
	char bAffectsWorld : 1; // 0x24c
	char CastShadows : 1; // 0x24c
	char CastStaticShadows : 1; // 0x24c
	char CastDynamicShadows : 1; // 0x24c
	char bAffectTranslucentLighting : 1; // 0x24c
	char bTransmission : 1; // 0x24c
	char bCastVolumetricShadow : 1; // 0x24c
	char bCastDeepShadow : 1; // 0x24c
	char bCastRaytracedShadow : 1; // 0x24d
	char bAffectReflection : 1; // 0x24d
	char bAffectGlobalIllumination : 1; // 0x24d
	float IndirectLightingIntensity; // 0x250
	float VolumetricScatteringIntensity; // 0x254
	float VolumetricAttenuationScale; // 0x258
	float VolumetricSourceRadiusScale; // 0x25c
	int32_t SamplesPerPixel; // 0x260
};

struct ASceneCaptureCube : ASceneCapture {
	USceneCaptureComponentCube* CaptureComponentCube; // 0x338
};

struct UMagicLeapARPinSaveGame : USaveGame {
	FGuid PinnedID; // 0x28
	FTransform ComponentWorldTransform; // 0x40
	FTransform PinTransform; // 0x70
};

struct ABravoHotelInventoryCharacter : AActor {
	UCustomizableSkeletalComponent* MutableComponent; // 0x328
	USkeletalMeshComponent* InventoryCharacterMesh; // 0x330
	UWidgetComponent* BackgroundWidgetComponent; // 0x338
	UPostProcessComponent* PostProcessComponet; // 0x340
	USceneComponent* LightsRootComponent; // 0x348
	USpotLightComponent* SpotLight; // 0x350
	ABravoHotelCharacter* OwnCharacter; // 0x358
	USkeletalMesh* BodyBaseSkeletalMesh; // 0x360
	TArray<USkeletalMesh*> PendingReleaseMutableMesh; // 0x368
	FVector LocationOffset; // 0x378
	FVector DefaultMeshScale; // 0x384
	FVector2D ScreenPosition; // 0x390
	float CharacterFOV; // 0x398
	float MoveScaleModify; // 0x39c
	float RotationInterpSpeed; // 0x3a0
	UUserWidget* DragWidgetClass; // 0x3a8
	UUserWidget* DragWidget; // 0x3b0
	TArray<ABravoHotelWeaponBase*> PreviewWeapons; // 0x3b8
};

struct UAkItemBoolProperties : UWidget {
	FMulticastInlineDelegate OnSelectionChanged; // 0x108
	FMulticastInlineDelegate OnPropertyDragged; // 0x118
};

struct UUW-Lobby_Armory_Recipe_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_Crapting_Btn; // 0x250
	UButton* Button_Crapting_Btn_dis; // 0x258
	UImage* Image_112; // 0x260
	UImage* Img_Gold; // 0x268
	UImage* Img_Gold_Inert; // 0x270
	UImage* Img_Gold_Inert_2; // 0x278
	URichTextBlock* RichTextBlock_578; // 0x280
	UTextBlock* T_GoldCost; // 0x288
	UTextBlock* T_GoldCost_2; // 0x290
	UUW-Lobby_Craft_GuideWidget_C* UW-Lobby_Craft_GuideWidget; // 0x298
	UUW-Lobby_Craft_List_C* UW-Lobby_Craft_List; // 0x2a0
	UUW-Lobby_Craft_Recipe_C* UW-Lobby_Weapon_Recipe; // 0x2a8
	UUW-Lobby_WeaponInfo_C* UW-Lobby_WeaponInfo; // 0x2b0
	UUW-Lobby_WeaponInfo_RandomOption_C* UW-Lobby_WeaponInfo_RandomOption; // 0x2b8
	UWidgetSwitcher* WidgetSwitcher_179; // 0x2c0
	UWidgetSwitcher* WidgetSwitcher_Gold; // 0x2c8
	FItemCrafting CraftingInfo; // 0x2d0
	UUW-Lobby_Craft_List_Category_Slot_C* SelectedButton; // 0x3f8
};

struct UBrushBaseProperties : UInteractiveToolPropertySet {
	float BrushSize; // 0x50
	bool bSpecifyRadius; // 0x54
	float BrushRadius; // 0x58
	float BrushStrength; // 0x5c
	float BrushFalloffAmount; // 0x60
	bool bShowStrength; // 0x64
	bool bShowFalloff; // 0x65
};

struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x38
	float MAX; // 0x3c
};

struct UBTDecorator_IsBBEntryOfClass : UBTDecorator_BlackboardBase {
	UObject* TestClass; // 0x90
};

struct UMaterialExpressionTextureCoordinate : UMaterialExpression {
	int32_t CoordinateIndex; // 0x40
	float UTiling; // 0x44
	float VTiling; // 0x48
	char UnMirrorU : 1; // 0x4c
	char UnMirrorV : 1; // 0x4c
};

struct UDeviceProfile : UTextureLODSettings {
	FString DeviceType; // 0x38
	FString BaseProfileName; // 0x48
	UObject* Parent; // 0x58
	TArray<FString> CVars; // 0x78
};

struct UMediaPlaylist : UObject {
	TArray<UMediaSource*> Items; // 0x28
};

struct UCoherentUIGTLiveView : UActorComponent {
	FString LinkName; // 0xb0
	UTextureRenderTarget2D* Texture; // 0xc0
};

struct UDatasmithImportOptions : UDatasmithOptionsBase {
	EDatasmithImportSearchPackagePolicy SearchPackagePolicy; // 0x28
	EDatasmithImportAssetConflictPolicy MaterialConflictPolicy; // 0x29
	EDatasmithImportAssetConflictPolicy TextureConflictPolicy; // 0x2a
	EDatasmithImportActorPolicy StaticMeshActorImportPolicy; // 0x2b
	EDatasmithImportActorPolicy LightImportPolicy; // 0x2c
	EDatasmithImportActorPolicy CameraImportPolicy; // 0x2d
	EDatasmithImportActorPolicy OtherActorImportPolicy; // 0x2e
	EDatasmithImportMaterialQuality MaterialQuality; // 0x2f
	FDatasmithImportBaseOptions BaseOptions; // 0x34
	FDatasmithReimportOptions ReimportOptions; // 0x48
	FString Filename; // 0x50
	FString FilePath; // 0x60
};

struct UUW-Inventory_Perk_C : UBravoHotelInventoryPerkWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UWidgetAnimation* Anim_Glow; // 0x2f0
	UWidgetAnimation* HideFreeSupply; // 0x2f8
	UWidgetAnimation* ShowFreeSupply; // 0x300
	UWidgetAnimation* LevelUp; // 0x308
	UWidgetAnimation* Ability_Defense; // 0x310
	UWidgetAnimation* Ability_Speed; // 0x318
	UWidgetAnimation* Ability_Power; // 0x320
	UWidgetAnimation* Survive_FadeInOut; // 0x328
	UWidgetAnimation* Anim_LevelUpDefense; // 0x330
	UWidgetAnimation* Anim_LevelUpSpeed; // 0x338
	UWidgetAnimation* Anim_LevelUpPower; // 0x340
	UButton* btn_ItemTree; // 0x348
	UButton* btn_PerkDeckDisabled; // 0x350
	UButton* btn_PerkDeckDisabled_2; // 0x358
	UButton* btn_PerkDeckEnabled; // 0x360
	UButton* btn_PerkDeckEnabled_2; // 0x368
	UCanvasPanel* Canvas_BG; // 0x370
	UCanvasPanel* Canvas_ChangeClass; // 0x378
	UCanvasPanel* Canvas_ChangeDisable; // 0x380
	UCanvasPanel* Canvas_ChangeDisable_2; // 0x388
	UCanvasPanel* Canvas_ChangeEnable; // 0x390
	UCanvasPanel* Canvas_ChangeEnable_2; // 0x398
	UCanvasPanel* Canvas_ChangeSupply; // 0x3a0
	UCanvasPanel* Canvas_LevelupEffect; // 0x3a8
	UCanvasPanel* Canvas_Main; // 0x3b0
	UCanvasPanel* Canvas_Perk; // 0x3b8
	UCanvasPanel* Canvas_SupplyButton; // 0x3c0
	UCanvasPanel* Canvas_UltimateEffect; // 0x3c8
	UCanvasPanel* Canvas_UltimateLightEffect; // 0x3d0
	UHorizontalBox* HorizontalBox_300; // 0x3d8
	UHorizontalBox* HorizontalBox_303; // 0x3e0
	UHorizontalBox* HorizontalBox_Stat; // 0x3e8
	UHorizontalBox* HorizontalBox_UnlockLevel; // 0x3f0
	UImage* Image; // 0x3f8
	UImage* Image_5; // 0x400
	UImage* Image_86; // 0x408
	UImage* Image_126; // 0x410
	UImage* Image_163; // 0x418
	UImage* Image_180; // 0x420
	UImage* Image_200; // 0x428
	UImage* Image_203; // 0x430
	UImage* Image_222; // 0x438
	UImage* Image_384; // 0x440
	UImage* Image_387; // 0x448
	UImage* Image_388; // 0x450
	UImage* Image_389; // 0x458
	UImage* Image_485; // 0x460
	UImage* Image_571; // 0x468
	UImage* Image_1098; // 0x470
	UImage* Image_1100; // 0x478
	UImage* Image_1104; // 0x480
	UImage* Image_Cycle; // 0x488
	UImage* Image_Cycle_2; // 0x490
	UImage* IMG_ClassIcon; // 0x498
	UImage* Img_PerkDeckIcon; // 0x4a0
	UImage* IMG_Supply; // 0x4a8
	UImage* IMG_UltimatedSkill; // 0x4b0
	UInvalidationBox* InvalidationBox_1; // 0x4b8
	UKeyImageWidget_C* KeyImageWidget; // 0x4c0
	UCanvasPanel* NotEnoughGold; // 0x4c8
	UOverlay* Over_Ultimate; // 0x4d0
	UOverlay* Overlay_UltimateKey; // 0x4d8
	USpacer* Spacer_251; // 0x4e0
	UTextBlock* T_ClassName; // 0x4e8
	UTextBlock* T_Defense; // 0x4f0
	UTextBlock* T_DefenseAnim; // 0x4f8
	UTextBlock* T_Power; // 0x500
	UTextBlock* T_PowerAnim; // 0x508
	UTextBlock* T_Speed; // 0x510
	UTextBlock* T_SpeedAnim; // 0x518
	UTextBlock* T_UltimateName; // 0x520
	UTextBlock* T_UnlockLevel; // 0x528
	UTextBlock* T_UnlockLevel2; // 0x530
	UTextBlock* T_WeaponName; // 0x538
	UTextBlock* TextBlock_2; // 0x540
	UTextBlock* TextBlock_3; // 0x548
	UTextBlock* TextBlock_4; // 0x550
	UTextBlock* TextBlock_9; // 0x558
	UTextBlock* TextBlock_ClassLevel; // 0x560
	UTextBlock* TextBlock_Count_Blue; // 0x568
	UTextBlock* TextBlock_Count_Green; // 0x570
	UTextBlock* TextBlock_Count_Red; // 0x578
	UTextBlock* TextBlock_Defense; // 0x580
	UTextBlock* TextBlock_Power; // 0x588
	UTextBlock* TextBlock_Price; // 0x590
	UTextBlock* TextBlock_Price_2; // 0x598
	UTextBlock* TextBlock_Select; // 0x5a0
	UTextBlock* TextBlock_Select_2; // 0x5a8
	UTextBlock* TextBlock_Speed; // 0x5b0
	UTextBlock* TextBlock_SurviveMessage01; // 0x5b8
	UTextBlock* TextBlock_SurviveMessage02; // 0x5c0
	UTextBlock* TextBlock_UltimateDesc; // 0x5c8
	UHorizontalBox* Title; // 0x5d0
	UImage* UltiLight_001; // 0x5d8
	UImage* UltiLight_002; // 0x5e0
	UImage* UltiLight_003; // 0x5e8
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot; // 0x5f0
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_2; // 0x5f8
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_3; // 0x600
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_4; // 0x608
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_5; // 0x610
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_6; // 0x618
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_7; // 0x620
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_8; // 0x628
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_9; // 0x630
	UVerticalBox* VB_Health; // 0x638
	UVerticalBox* VB_Power; // 0x640
	UVerticalBox* VB_Speed; // 0x648
	UVerticalBox* VerticalBox_Blue; // 0x650
	UVerticalBox* VerticalBox_Green; // 0x658
	UVerticalBox* VerticalBox_Red; // 0x660
	UWidgetSwitcher* WidgetSwitcher_ChangeClass; // 0x668
	UWidgetSwitcher* WidgetSwitcher_ChangeSupply; // 0x670
	UWidgetSwitcher* WidgetSwitcher_TreeAndClass; // 0x678
	UWidgetSwitcher* WidgetSwitcher_Ultimate; // 0x680
	FName CurrentPerkDeckName; // 0x688
	TArray<UUW-Inventory_PerkSlot_C*> CurrentPerkInfos; // 0x690
	FName ExpertWeaponKey; // 0x6a0
	TMap<FName, UUW-Inventory_PerkSlot_C*> CurrentPerkCells; // 0x6a8
	int32_t PerkMode; // 0x6f8
	UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x700
	int32_t PowerValue; // 0x708
	FTimerHandle TimerHandle_Power; // 0x710
	int32_t SpeedValue; // 0x718
	FTimerHandle TimerHandle_Speed; // 0x720
	int32_t DefenseValue; // 0x728
	FTimerHandle TimerHandle_Defense; // 0x730
	bool bPlayAbilityCountSoundStart; // 0x738
	bool bPlayAbilityCountSoundEnd; // 0x739
	UAkAudioEvent* LevelUpSound; // 0x740
	bool EnableSupplyBtn; // 0x748
	FTimerHandle FreeSupplyTimer; // 0x750
	FTimerHandle NotEnoughtGoldTimer; // 0x758
	TArray<UUW-ListWidget_GainPerk_C*> GainPerkPopups; // 0x760
	bool IsPlayingUltimateSound; // 0x770
	int32_t LastLevel; // 0x774
	FPerkDeckClassInfo PerkDeckClassInfo; // 0x778
};

struct UUW-ListWidget_ItemBase_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Anim_Remove; // 0x250
	FTimerHandle Timer_StartRemove; // 0x258
};

struct UNiagaraPreviewAxis_InterpParamVector : UNiagaraPreviewAxis_InterpParamBase {
	FVector Min; // 0x38
	FVector MAX; // 0x44
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct UPrefabToolSettings : UObject {
	bool bInitialPivotToWorldOrigin; // 0x28
	bool bReplaceActorsWithCreatedPrefab; // 0x29
	bool bAutoIncludeAttachedActorsWhenCreateNewPrefab; // 0x2a
	bool bNestedPrefabSupport; // 0x2b
	bool bRestorePrefabActorCollapseStatusAfterPIE; // 0x2c
	bool bCollapseAllPrefabActorsAfterMapOpened; // 0x2d
	bool bMoveActorsInWorldAfterSetPrefabPivot; // 0x2e
	bool bDuplicateNoRevertWithOffset; // 0x2f
	FString NewPrefabNamePattern; // 0x30
	EPTUITheme UITheme; // 0x40
	bool bUpdateAllPrefabActorsWhenOpenMap; // 0x44
	bool bCheckPrefabChangeBeforeUpdateAllPrefabActorsWhenOpenMap; // 0x45
	bool bUpdateAllPrefabActorsWhenApply; // 0x46
	bool bApplyToNestedPrefab; // 0x47
	bool bEnableApplyFromDisconnectedPrefabActor; // 0x48
	bool bAutoAddRemoveVariantActorPrefix; // 0x49
	FString VariantActorPrefix; // 0x50
	bool bEnablePrefabComponentVisualizer; // 0x60
	EPrefabVisualizerType PrefabComponentVisualizerType; // 0x61
	bool bDisplayPrefabComponentVisualizerEvenNotSelected; // 0x62
	FColor PrefabViewVisualizerColor; // 0x64
	FColor TargetActorColor; // 0x68
	FColor UnLockedConnectedColor; // 0x6c
	FColor LockedConnectedColor; // 0x70
	FColor UnLockedDisConnectedColor; // 0x74
	FColor LockedDisConnectedColor; // 0x78
	FColor UnLockedNoPrefabAssignedColor; // 0x7c
	FColor LockedNoPrefabAssignedColor; // 0x80
	FSoftObjectPath PrefabMaterialPath; // 0x88
	bool bShadedPrefabViewVisualizer; // 0xc8
	bool bLockPrefabSelectionByDefault; // 0xc9
	bool bDisableLockPrefabSelectionFeature; // 0xca
	bool bSupportGroupWhenPasting; // 0xcb
	bool bForceApplyPerInstanceVertexColor; // 0xcc
	bool bHideChildActorsInPIEIfHiddenInEditor; // 0xcd
	bool bCanToggleChildActorVisibilityInPIE; // 0xce
	bool bIgnoreLayersInPrefab; // 0xd0
	TArray<AActor*> ChangeComponentActor; // 0xd8
	AActor* DefaultActorClass; // 0xe8
	bool bEnabledAutoThumbnail; // 0xf0
	bool bAutoOpenBlueprintEditor; // 0xf1
	AActor* InteriorActorClass; // 0xf8
	AActor* ExteriorActorClass; // 0x100
	AActor* InteriorShowActorClass; // 0x108
	AActor* HouseActorClass; // 0x110
	bool bSupportGenerateBlueprint; // 0x118
	bool bHarvestComponentsWhenGeneratingBlueprint; // 0x119
	bool bUseActorNameAsVariableNameWhenGeneratingBlueprint; // 0x11a
	bool bForceMobilityToMovableWhenGeneratingBlueprint; // 0x11b
	TArray<AActor*> IgnoreActorClassesWhenGeneratingBlueprint; // 0x120
	TArray<FName> IgnoreActorTagsWhenGeneratingBlueprint; // 0x130
	bool bFlashPrefabWindowForTargetPrefabActor; // 0x140
	bool bEnablePrefabTextEditor; // 0x141
	bool bDebugMode; // 0x142
	bool bDisableThumbnailRender; // 0x143
	bool bShowPrefabInstanceTagInPrefabToolWindow; // 0x144
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct UParticleModuleColor_Seeded : UParticleModuleColor {
	FParticleRandomSeedInfo RandomSeedInfo; // 0xb0
};

struct UMovieSceneNiagaraParameterTrack : UMovieSceneNiagaraTrack {
	FNiagaraVariable Parameter; // 0x68
};

struct USkinnedMeshComponent : UMeshComponent {
	USkeletalMesh* SkeletalMesh; // 0x4e0
	TWeakObjectPtr<USkinnedMeshComponent> MasterPoseComponent; // 0x4e8
	TArray<ESkinCacheUsage> SkinCacheUsage; // 0x4f0
	UPhysicsAsset* PhysicsAssetOverride; // 0x5f8
	int32_t ForcedLodModel; // 0x600
	int32_t MinLodModel; // 0x604
	float StreamingDistanceMultiplier; // 0x610
	TArray<FSkelMeshComponentLODInfo> LODInfo; // 0x620
	EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x654
	char bOverrideMinLod : 1; // 0x656
	char bUseBoundsFromMasterPoseComponent : 1; // 0x656
	char bForceWireframe : 1; // 0x656
	char bDisplayBones : 1; // 0x656
	char bDisableMorphTarget : 1; // 0x656
	char bHideSkin : 1; // 0x656
	char bPerBoneMotionBlur : 1; // 0x657
	char bComponentUseFixedSkelBounds : 1; // 0x657
	char bConsiderAllBodiesForBounds : 1; // 0x657
	char bSyncAttachParentLOD : 1; // 0x657
	char bCanHighlightSelectedSections : 1; // 0x657
	char bRecentlyRendered : 1; // 0x657
	char bCastCapsuleDirectShadow : 1; // 0x657
	char bCastCapsuleIndirectShadow : 1; // 0x657
	char bCPUSkinning : 1; // 0x658
	char bEnableUpdateRateOptimizations : 1; // 0x658
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x658
	char bRenderStatic : 1; // 0x658
	char bIgnoreMasterPoseComponentLOD : 1; // 0x658
	char bCachedLocalBoundsUpToDate : 1; // 0x658
	char bForceMeshObjectUpdate : 1; // 0x659
	float CapsuleIndirectShadowMinVisibility; // 0x65c
	FBoxSphereBounds CachedWorldSpaceBounds; // 0x670
	FMatrix CachedWorldToLocalTransform; // 0x690
};

struct UUW-ArmoryInput_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Image_20; // 0x250
	FRotator TargetAccel; // 0x258
	FRotator CurrentAccel; // 0x264
	float TargetScale; // 0x270
	UOutGameArmoryDataType_C* DataAsset; // 0x278
	bool ResetOriginTransform; // 0x280
	bool MouseInputLock; // 0x281
	bool IsUpdatingRotation; // 0x282
	bool IsValidMeshActor; // 0x283
	bool IsPressedLeftMouse; // 0x284
};

struct UCameraModifier : UObject {
	char bDebug : 1; // 0x28
	char bExclusive : 1; // 0x28
	char Priority; // 0x2c
	APlayerCameraManager* CameraOwner; // 0x30
	float AlphaInTime; // 0x38
	float AlphaOutTime; // 0x3c
	float ALPHA; // 0x40
};

struct UNiagaraDataInterfaceAudioSubmix : UNiagaraDataInterface {
	USoundSubmix* Submix; // 0x30
};

struct ABravoHotelFence : ABravoHotelDestructibleEx {
	TMap<UBravoHotelDamageType*, float> DamageCorrectValues; // 0x340
};

struct ABravoHotelMutiplayerPhysicsActor : AActor {
	USceneComponent* RootNode; // 0x328
	APlayerController* SendController; // 0x330
	UStaticMeshComponent* BoxMesh; // 0x370
	bool LoopAction; // 0x378
	bool StartAction; // 0x379
	FTransform RepMoveTransform; // 0x380
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	float OutputVolume; // 0x68
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x70
};

struct ABravoHotelAIPlayerController : AAIController {
	float AutoRotateSpeed; // 0x458
	FName DefaultWeaponName; // 0x45c
	AController* NearPlayerController; // 0x480
	APawn* NearTargetPawn; // 0x488
	APawn* AttackTargetPawn; // 0x490
};

struct UAIPerceptionSystem : UAISubsystem {
	TArray<UAISense*> Senses; // 0x88
	float PerceptionAgingRate; // 0x98
};

struct UBP-SavedInventorySettings_C : USavedInventorySettings {
	bool ShowPerkSlot; // 0x30
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UParticleModuleLocationWorldOffset_Seeded : UParticleModuleLocationWorldOffset {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x80
};

struct UMovieSceneSubTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UCoherentUIGTJSEvent : UObject {
	TArray<UStruct*> StructTypes; // 0xa8
};

struct UBTTask_FSM_CheckState : UBTTask_BlackboardBase {
	UStateMachineComponent* FSM; // 0x98
	FName TargetFSM; // 0xa0
	FName StateName; // 0xa8
	bool Debug; // 0xb0
	bool ForceSuccess; // 0xb1
};

struct UEdGraphNode_Documentation : UEdGraphNode {
	FString Link; // 0x98
	FString Excerpt; // 0xa8
};

struct UBravoHotelAnimNotify_DropMagazine : UAnimNotify {
	FName WeaponSlotNameForSpawn; // 0x38
	ABravoHotelMagazineForDrop* MagazineClass; // 0x40
};

struct UScrollBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct AAmbientSound : AActor {
	UAudioComponent* AudioComponent; // 0x328
};

struct UGameplayTask : UObject {
	FName InstanceName; // 0x30
	ETaskResourceOverlapPolicy ResourceOverlapPolicy; // 0x3a
	UGameplayTask* ChildTask; // 0x60
};

struct UHorizontalBoxSlot : UPanelSlot {
	FMargin Padding; // 0x40
	FSlateChildSize Size; // 0x50
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UMaterialExpressionCeil : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleSystemComponent : UFXSystemComponent {
	UParticleSystem* Template; // 0x4b0
	TArray<UMaterialInterface*> EmitterMaterials; // 0x4b8
	TArray<USkeletalMeshComponent*> SkelMeshComponents; // 0x4c8
	char bResetOnDetach : 1; // 0x4d9
	char bUpdateOnDedicatedServer : 1; // 0x4d9
	char bAllowRecycling : 1; // 0x4d9
	char bAutoManageAttachment : 1; // 0x4d9
	char bAutoAttachWeldSimulatedBodies : 1; // 0x4d9
	char bWarmingUp : 1; // 0x4da
	char bOverrideLODMethod : 1; // 0x4da
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x4da
	ParticleSystemLODMethod LODMethod; // 0x4e5
	EParticleSignificanceLevel RequiredSignificance; // 0x4e6
	TArray<FParticleSysParam> InstanceParameters; // 0x4e8
	FMulticastInlineDelegate OnParticleSpawn; // 0x4f8
	FMulticastInlineDelegate OnParticleBurst; // 0x508
	FMulticastInlineDelegate OnParticleDeath; // 0x518
	FMulticastInlineDelegate OnParticleCollide; // 0x528
	bool bOldPositionValid; // 0x538
	FVector OldPosition; // 0x53c
	FVector PartSysVelocity; // 0x548
	float WarmupTime; // 0x554
	float WarmupTickRate; // 0x558
	float SecondsBeforeInactive; // 0x570
	float MaxTimeBeforeForceUpdateTransform; // 0x578
	TArray<UParticleSystemReplay*> ReplayClips; // 0x598
	float CustomTimeDilation; // 0x5b0
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x608
	FName AutoAttachSocketName; // 0x610
	EAttachmentRule AutoAttachLocationRule; // 0x618
	EAttachmentRule AutoAttachRotationRule; // 0x619
	EAttachmentRule AutoAttachScaleRule; // 0x61a
	FMulticastInlineDelegate OnSystemFinished; // 0x648
};

struct UWB_ClassicComboBoxButton_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* VisualNoninteractButton; // 0x250
	FButtonStyle Original Style; // 0x258
};

struct UPaperFlipbook : UObject {
	float FramesPerSecond; // 0x28
	TArray<FPaperFlipbookKeyFrame> KeyFrames; // 0x30
	UMaterialInterface* DefaultMaterial; // 0x40
	EFlipbookCollisionMode CollisionSource; // 0x48
};

struct UAnimationSharingManager : UObject {
	TArray<UAnimSharingInstance*> PerSkeletonData; // 0x28
	TArray<USkeleton*> Skeletons; // 0x48
};

struct ANiagaraActor : AActor {
	UNiagaraComponent* NiagaraComponent; // 0x328
	char bDestroyOnSystemFinish : 1; // 0x330
};

struct UBHBUltimate_Recon : UBHBActiveBuffBase {
	int32_t CurrentActiveCount; // 0x2c0
	int32_t MaxActiveCount; // 0x2c4
};

struct UMaterialExpressionStaticBoolParameter : UMaterialExpressionParameter {
	char DefaultValue : 1; // 0x58
};

struct UUW-ReportUser_C : UBravoHotelReportUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x278
	UButton* btn_Cancel; // 0x280
	UButton* btn_report; // 0x288
	UOverlay* combobox_button_overlay; // 0x290
	UComboBoxString* combobox_string; // 0x298
	UImage* Image; // 0x2a0
	UImage* Image_2; // 0x2a8
	UImage* Image_545; // 0x2b0
	UButton* NormalArrow; // 0x2b8
	UButton* OpeningArrow; // 0x2c0
	UImage* popup-bg; // 0x2c8
	UTextBlock* txt_description; // 0x2d0
	UTextBlock* txt_nickname; // 0x2d8
	UImage* uw-bg; // 0x2e0
	FText DescriptionText; // 0x2e8
	TArray<FText> ReportIndexText; // 0x300
	FText DefaultComboString; // 0x310
	int32_t CurrentSelectIndex; // 0x328
	int32_t SelectIndexFromProgram; // 0x32c
	bool CheckCloseComboArrow; // 0x330
};

struct ARectLight : ALight {
	URectLightComponent* RectLightComponent; // 0x338
};

struct UUW-Inventory_PopupPerkSlot_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UImage* Image_92; // 0x250
	UImage* Image_253; // 0x258
	UImage* Image_774; // 0x260
	FPerkUIInfo PerkInfo; // 0x268
	FPerkData PerkData; // 0x298
	FSlateBrush IconBrush; // 0x378
	UUW-Inventory_ItemSlotHover_C* Popup; // 0x400
};

struct UBravoHotelHIDestructibleComponent : UHierarchicalInstancedStaticMeshComponent {
	FName MeshClassType; // 0x728
	TArray<UBravoHotelDamageType*> AllowedDamageType; // 0x730
	float ImpulseStrength; // 0x740
	TArray<float> HpList; // 0x748
	TArray<int16_t> CurrentHpList; // 0x758
	UAkAudioEvent* DestructedSound; // 0x768
	UParticleSystem* DestructedEffect; // 0x770
	FVector EffectPositionDelta; // 0x778
	FVector EffectRotationDelta; // 0x784
	bool bOverrideMaterial; // 0x790
	int32_t DestructibleMaterialIndex; // 0x794
	UMaterialInterface* DestructibleMaterial; // 0x798
	bool bIsWindowComponent; // 0x7a0
	ADestructibleActor* DestructibleActorClass; // 0x7a8
	TSoftObjectPtr<UDestructibleMesh> DestructibleMesh; // 0x7b0
	TArray<char> DisableInstanceArray; // 0x840
};

struct UAkDurationCallbackInfo : UAkEventCallbackInfo {
	float Duration; // 0x38
	float EstimatedDuration; // 0x3c
	int32_t AudioNodeID; // 0x40
	int32_t MediaID; // 0x44
	bool bStreaming; // 0x48
};

struct USightInfoData : UDataAsset {
	FVector2D DefaultSightViewRatio; // 0x30
	FVector2D HoloSightViewRatio; // 0x38
	FVector2D ReddotViewRatio; // 0x40
	FVector2D DigitalViewRatio; // 0x48
	FVector2D X2ViewRatio; // 0x50
	FVector2D X4ViewRatio; // 0x58
	FVector2D X8ViewRatio; // 0x60
	FVector2D X15ViewRatio; // 0x68
};

struct USpectatorPawnMovement : UFloatingPawnMovement {
	char bIgnoreTimeDilation : 1; // 0x150
};

struct UDestructibleComponent : USkinnedMeshComponent {
	char bFractureEffectOverride : 1; // 0x6f0
	TArray<FFractureEffect> FractureEffects; // 0x6f8
	bool bEnableHardSleeping; // 0x708
	float LargeChunkThreshold; // 0x70c
	FMulticastInlineDelegate OnComponentFracture; // 0x720
	FMulticastInlineDelegate OnFractureEffectSpawned; // 0x730
};

struct UIpConnection : UNetConnection {
	float SocketErrorDisconnectDelay; // 0x1af0
};

struct UUW-LoadingRichText_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	URichTextBlock* RichTextBlock_52; // 0x250
	FText SetText; // 0x258
};

struct UWidgetAnimationDelegateBinding : UDynamicBlueprintBinding {
	TArray<FBlueprintWidgetAnimationDelegateBinding> WidgetAnimationDelegateBindings; // 0x28
};

struct URestrictedGameplayTagsList : UObject {
	FString ConfigFileName; // 0x28
	TArray<FRestrictedGameplayTagTableRow> RestrictedGameplayTagList; // 0x38
};

struct UUW-DebugCharacterWidget_C : UBravoHotelDebugWidget {
	UTextBlock* TextBlock_DebugString; // 0x258
};

struct ASplineMeshActor : AActor {
	USplineMeshComponent* SplineMeshComponent; // 0x328
};

struct UNiagaraDataInterfaceChaosDestruction : UNiagaraDataInterface {
	TSet<AChaosSolverActor*> ChaosSolverActorSet; // 0x30
	EDataSourceTypeEnum DataSourceType; // 0x80
	int32_t DataProcessFrequency; // 0x84
	int32_t MaxNumberOfDataEntriesToSpawn; // 0x88
	bool DoSpawn; // 0x8c
	FVector2D SpawnMultiplierMinMax; // 0x90
	float SpawnChance; // 0x98
	FVector2D ImpulseToSpawnMinMax; // 0x9c
	FVector2D SpeedToSpawnMinMax; // 0xa4
	FVector2D MassToSpawnMinMax; // 0xac
	FVector2D ExtentMinToSpawnMinMax; // 0xb4
	FVector2D ExtentMaxToSpawnMinMax; // 0xbc
	FVector2D VolumeToSpawnMinMax; // 0xc4
	FVector2D SolverTimeToSpawnMinMax; // 0xcc
	int32_t SurfaceTypeToSpawn; // 0xd4
	ELocationFilteringModeEnum LocationFilteringMode; // 0xd8
	ELocationXToSpawnEnum LocationXToSpawn; // 0xd9
	FVector2D LocationXToSpawnMinMax; // 0xdc
	ELocationYToSpawnEnum LocationYToSpawn; // 0xe4
	FVector2D LocationYToSpawnMinMax; // 0xe8
	ELocationZToSpawnEnum LocationZToSpawn; // 0xf0
	FVector2D LocationZToSpawnMinMax; // 0xf4
	EDataSortTypeEnum DataSortingType; // 0xfc
	bool bGetExternalCollisionData; // 0xfd
	bool DoSpatialHash; // 0xfe
	FVector SpatialHashVolumeMin; // 0x100
	FVector SpatialHashVolumeMax; // 0x10c
	FVector SpatialHashVolumeCellSize; // 0x118
	int32_t MaxDataPerCell; // 0x124
	bool bApplyMaterialsFilter; // 0x128
	TSet<UPhysicalMaterial*> ChaosBreakingMaterialSet; // 0x130
	bool bGetExternalBreakingData; // 0x180
	bool bGetExternalTrailingData; // 0x181
	FVector2D RandomPositionMagnitudeMinMax; // 0x184
	float InheritedVelocityMultiplier; // 0x18c
	ERandomVelocityGenerationTypeEnum RandomVelocityGenerationType; // 0x190
	FVector2D RandomVelocityMagnitudeMinMax; // 0x194
	float SpreadAngleMax; // 0x19c
	FVector VelocityOffsetMin; // 0x1a0
	FVector VelocityOffsetMax; // 0x1ac
	FVector2D FinalVelocityMagnitudeMinMax; // 0x1b8
	float MaxLatency; // 0x1c0
	EDebugTypeEnum DebugType; // 0x1c4
	int32_t LastSpawnedPointID; // 0x1c8
	float LastSpawnTime; // 0x1cc
	float SolverTime; // 0x1e0
	float TimeStampOfLastProcessedData; // 0x1e4
};

struct UUW-ReplayTimelineBasic_C : UBravoHotelReplayTimelineWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x360
	UImage* Bg; // 0x368
	UTimelineBorder* Border_Timeline; // 0x370
	UBorder* Border_TimeToGo; // 0x378
	UButton* BT_FreeCam; // 0x380
	UButton* BT_ReplayPause; // 0x388
	UButton* BT_ReplayResume; // 0x390
	UButton* BT_SpeedDown; // 0x398
	UButton* BT_SpeedUp; // 0x3a0
	UButton* BT_TimelineScaleDown; // 0x3a8
	UButton* BT_TimelineScaleUp; // 0x3b0
	UCanvasPanel* Canvas_EventMarkers; // 0x3b8
	UCheckBox* Chk_ShowKill; // 0x3c0
	UCheckBox* Chk_ShowKnockout; // 0x3c8
	UCheckBox* Chk_ShowMyKill; // 0x3d0
	UCheckBox* Chk_ShowMyKnockout; // 0x3d8
	UCheckBox* Chk_ShowMyResuscitated; // 0x3e0
	UCheckBox* Chk_ShowResuscitated; // 0x3e8
	USlider* ReplayTimelineSlider; // 0x3f0
	UScrollBox* ScrollBox_Timeline; // 0x3f8
	USizeBox* SizeBox_Timeline; // 0x400
	USlider* Slider_TimelineScale; // 0x408
	UTextBlock* T_CameraType; // 0x410
	UTextBlock* T_CurrentTime; // 0x418
	UTextBlock* T_PlaySpeed; // 0x420
	UTextBlock* T_TimeToGo; // 0x428
	UTextBlock* T_TotalTime; // 0x430
	float TimelineSizeBoxOffset; // 0x438
	UUserWidget* Class_EventMarker_Kill; // 0x440
	UUserWidget* Class_EventMarker_Knockout; // 0x448
	float LastViewportSize; // 0x450
	bool IsMouseOnBorder; // 0x454
	UUserWidget* Class_EventMarker_Resuscitated; // 0x458
	UUserWidget* Class_EventMarker_WhenReported; // 0x460
	ECameraType CameraType; // 0x468
	EReplayViewMode ViewMode; // 0x469
};

struct USynthComponentMonoWaveTable : USynthComponent {
	FMulticastInlineDelegate OnTableAltered; // 0x710
	FMulticastInlineDelegate OnNumTablesChanged; // 0x720
	UMonoWaveTableSynthPreset* CurrentPreset; // 0x730
};

struct UMaterialExpressionLandscapeVisibilityMask : UMaterialExpression {
	FGuid ExpressionGUID; // 0x40
};

struct UBravoHotelThrowingWeaponMovementComponent : UProjectileMovementComponent {
	FMulticastInlineDelegate OnProjectilePenetrate; // 0x1d0
	bool bIsFluidFriction; // 0x1e0
	bool bInFluid; // 0x1e1
	float FluidFriction; // 0x1e4
	float BuoyancyZ; // 0x1e8
	bool bEnableGuidedForce; // 0x1ec
	float GuidedForce; // 0x1f0
	FVector GuidedLocation; // 0x1f4
};

struct UAkCallbackInfo : UObject {
	UAkComponent* AkComponent; // 0x28
};

struct UBrushStampIndicator : UInteractiveGizmo {
	float BrushRadius; // 0x38
	float BrushFalloff; // 0x3c
	FVector BrushPosition; // 0x40
	FVector BrushNormal; // 0x4c
	bool bDrawIndicatorLines; // 0x58
	bool bDrawRadiusCircle; // 0x59
	bool bDrawFalloffCircle; // 0x5a
	int32_t SampleStepCount; // 0x5c
	FLinearColor LineColor; // 0x60
	float LineThickness; // 0x70
	bool bDepthTested; // 0x74
	bool bDrawSecondaryLines; // 0x75
	float SecondaryLineThickness; // 0x78
	FLinearColor SecondaryLineColor; // 0x7c
	UPrimitiveComponent* AttachedComponent; // 0x90
};

struct UBravoHotelAnimNotify_PlayConditionedSound : UAnimNotify {
	FConditionedSound ConditionedSound; // 0x38
	bool bFollow; // 0x48
	bool bPlayOnServer; // 0x49
	bool bPlayWhileFalling; // 0x4a
	bool bPlayOnlyForPawnMesh; // 0x4b
	bool bPlayOnlyLocalPlayer; // 0x4c
	bool bForced2D; // 0x4d
	bool bUseConditionProvider; // 0x4e
};

struct ABravoHotelSightAttachment : AActor {
	UStaticMeshComponent* WeaponSight; // 0x328
	bool bUpdateScopeWidgetScaling; // 0x330
	EWeaponAttachmentItem SightType; // 0x331
	UMaterialInterface* LensMaterial_1P; // 0x338
	UMaterialInterface* LensMaterial_3P; // 0x340
	UWidgetComponent* ScopeWidget; // 0x348
	float InitialScopeWidgetDistance; // 0x350
	TArray<UWidgetComponent*> BP_ScopeWidgets; // 0x358
	TArray<UPrimitiveComponent*> ChildPrimitiveComponents; // 0x368
	UUserWidget* WidgetClass; // 0x378
	FVector2D WidgetDrawSize; // 0x380
	FVector DefaultWidgetComponentLocation; // 0x388
	bool bUseHighMagnificationMesh; // 0x394
	TSoftObjectPtr<UStaticMesh> HighMagnificationSightMesh; // 0x398
	TSoftObjectPtr<UStaticMesh> DefaultSightMesh; // 0x3c0
	UStaticMesh* LoadedHighMagnificationSightMesh; // 0x3e8
	UStaticMesh* LoadedDefaultSightMesh; // 0x3f0
	FTimerHandle TimerHandle_ScopeVisible; // 0x3f8
	float VisibleDelayTime; // 0x400
	float ViewportRatioMax; // 0x404
	float ViewportSizeMax; // 0x408
	bool bIsADSMode; // 0x40c
	float ScaleMultiplier_ZoomInOut; // 0x410
	bool bKeepMagnifierIndex; // 0x414
	TArray<float> MagnifierList; // 0x418
	float CurrentMagnifier; // 0x428
	int16_t InitialMagnifierIndex; // 0x42c
	FVector2D ScopeWidgetDefaultSize; // 0x430
};

struct UMovieScenePrimitiveMaterialSection : UMovieSceneSection {
	FMovieSceneObjectPathChannel MaterialChannel; // 0xe0
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
	EMaterialSamplerType SamplerType; // 0x48
	char IsDefaultMeshpaintTexture : 1; // 0x49
};

struct UDistributionFloatUniformCurve : UDistributionFloat {
	FInterpCurveVector2D ConstantCurve; // 0x38
};

struct ULevelSequenceBurnInOptions : UObject {
	bool bUseBurnIn; // 0x28
	FSoftClassPath BurnInClass; // 0x30
	ULevelSequenceBurnInInitSettings* Settings; // 0x48
};

struct UNavigationPath : UObject {
	FMulticastInlineDelegate PathUpdatedNotifier; // 0x28
	TArray<FVector> PathPoints; // 0x38
	ENavigationOptionFlag RecalculateOnInvalidation; // 0x48
};

struct UCoherentUIGTComponent : UCoherentUIGTBaseComponent {
	FString URL; // 0x230
	int32_t Width; // 0x240
	int32_t Height; // 0x244
	bool ManualTexture; // 0x248
	float ClickThroughAlphaThreshold; // 0x24c
	bool Transparent; // 0x250
};

struct UNiagaraPreviewAxis_InterpParamInt32 : UNiagaraPreviewAxis_InterpParamBase {
	int32_t Min; // 0x38
	int32_t MAX; // 0x3c
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x328
	USceneComponent* SceneComponent; // 0x330
};

struct UAnimNotifyState_PlaySound : UAnimNotifyState {
	USoundBase* Sound; // 0x30
	float VolumeMultiplier; // 0x38
	float PitchMultiplier; // 0x3c
	char bFollow : 1; // 0x40
	FName AttachName; // 0x44
};

struct AAkSpotReflector : AActor {
	UAkAuxBus* EarlyReflectionAuxBus; // 0x328
	FString EarlyReflectionAuxBusName; // 0x330
	UAkAcousticTexture* AcousticTexture; // 0x340
	float DistanceScalingFactor; // 0x348
	float Level; // 0x34c
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct UUW-DeathUserWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* EnemySkull; // 0x250
	UImage* Image_436; // 0x258
	AActor* Pawn; // 0x260
};

struct UUW-Inventory_ProximityBoxSlot_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UTextBlock* BoxName; // 0x250
	UWrapBox* WB-ItemList; // 0x258
	bool TitleVisible; // 0x260
	AActor* TargetActor; // 0x268
	UUW-InventoryWidget_C* InventoryWidget; // 0x270
	bool bUsed; // 0x278
};

struct USizeBoxSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x58
	EVerticalAlignment VerticalAlignment; // 0x59
};

struct UUW-AttackDamageWidget_C : UBravoHotelAttackDamageWidget {
	UWidgetAnimation* FadeOut; // 0x3a0
};

struct USoundNodeOscillator : USoundNode {
	char bModulateVolume : 1; // 0x48
	char bModulatePitch : 1; // 0x48
	float AmplitudeMin; // 0x4c
	float AmplitudeMax; // 0x50
	float FrequencyMin; // 0x54
	float FrequencyMax; // 0x58
	float OffsetMin; // 0x5c
	float OffsetMax; // 0x60
	float CenterMin; // 0x64
	float CenterMax; // 0x68
};

struct UMaterialExpressionMaterialFunctionCall : UMaterialExpression {
	UMaterialFunctionInterface* MaterialFunction; // 0x40
	FMaterialParameterInfo FunctionParameterInfo; // 0x48
};

struct UUW-Inventory_FreeSupplyToolTip_C : UUserWidget {
	UImage* Image_362; // 0x248
	UImage* Image_552; // 0x250
	URichTextBlock* RichTextBlock_74; // 0x258
};

struct UMaterialExpressionFontSample : UMaterialExpression {
	UFont* Font; // 0x40
	int32_t FontTexturePage; // 0x48
};

struct UCableComponent : UMeshComponent {
	bool bAttachStart; // 0x4e0
	bool bAttachEnd; // 0x4e1
	FComponentReference AttachEndTo; // 0x4e8
	FName AttachEndToSocketName; // 0x510
	FVector EndLocation; // 0x518
	float CableLength; // 0x524
	int32_t NumSegments; // 0x528
	float SubstepTime; // 0x52c
	int32_t SolverIterations; // 0x530
	bool bEnableStiffness; // 0x534
	bool bEnableCollision; // 0x535
	float CollisionFriction; // 0x538
	FVector CableForce; // 0x53c
	float CableGravityScale; // 0x548
	float CableWidth; // 0x54c
	int32_t NumSides; // 0x550
	float TileMaterial; // 0x554
};

struct UHUDInteractionComponent : UActorComponent {
	UBravoHotelPopupManager* PopupManager; // 0xb0
	bool MoveWorldMapToPlayer; // 0xb8
	TArray<UUserWidget*> SaveIgnoredWidgets; // 0xc0
	TArray<UUserWidget*> IgnoredWidgets; // 0xe0
};

struct UReplicationGraphNode_AlwaysRelevant : UReplicationGraphNode {
	UReplicationGraphNode* ChildNode; // 0x50
};

struct UNiagaraDataInterfaceCurve : UNiagaraDataInterfaceCurveBase {
	FRichCurve Curve; // 0x58
};

struct UMovieSceneObjectPropertySection : UMovieSceneSection {
	FMovieSceneObjectPathChannel ObjectChannel; // 0xe0
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat StartRotation; // 0x30
};

struct UUW-Lobby_WeaponInfo_RandomOption_C : UUserWidget {
	UTextBlock* T_Desc; // 0x248
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff; // 0x250
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_2; // 0x258
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_3; // 0x260
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_4; // 0x268
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_5; // 0x270
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_6; // 0x278
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_7; // 0x280
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_8; // 0x288
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_9; // 0x290
	UUW-Lobby_WeaponInfo_Option_Slot_Icon_C* UW-Lobby_WeaponInfo_Buff_10; // 0x298
	UWrapBox* WrapBox_Options; // 0x2a0
};

struct UUW-MatchEnd_Animation_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Infos_ani; // 0x250
	UWidgetAnimation* SimpleResult_Events; // 0x258
	UWidgetAnimation* Lose_ani; // 0x260
	UWidgetAnimation* Win_ani; // 0x268
	UWidgetAnimation* Lose_Events; // 0x270
	UWidgetAnimation* Win_Events; // 0x278
	UTextBlock* ClassName; // 0x280
	UTextBlock* ClassWeaponName; // 0x288
	UTextBlock* HeadShot; // 0x290
	UHorizontalBox* HorizontalBox_KillerWeaponInfo; // 0x298
	UHorizontalBox* HorizontalBox_Rarity; // 0x2a0
	UImage* Icon_KillerClass; // 0x2a8
	UImage* Image_894; // 0x2b0
	UImage* Image_2002; // 0x2b8
	UTextBlock* Level; // 0x2c0
	UTextBlock* LoseMessage; // 0x2c8
	UOverlay* Overlay_DropItems; // 0x2d0
	UOverlay* Overlay_KillerInfo; // 0x2d8
	UOverlay* Overlay_WeaponLevel; // 0x2e0
	UTextBlock* T_DamageType; // 0x2e8
	UTextBlock* T_WeaponLevel; // 0x2f0
	UTextBlock* TextBlock_ItemCount; // 0x2f8
	UUniformGridPanel* Uniform_ItemList; // 0x300
	UTextBlock* UserName; // 0x308
	UUW-MatchEnd_RewardSlot_C* UW-MatchEnd_RewardSlot_C_1; // 0x310
	UUW-MatchEnd_ButtonBase_C* UW-SkipButton; // 0x318
	UTextBlock* WeaponName; // 0x320
	UWidgetSwitcher* WidgetSwitcher_DamageCauser; // 0x328
	FMatchEndAnimation AnimationData; // 0x330
	UUW-MatchEndWidget_C* MatchEndWidgetRef; // 0x338
	FMatchEndSimpleResult SimpleResult; // 0x340
	bool MatchEnd; // 0x450
};

struct UApplicationLifecycleComponent : UActorComponent {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0xb0
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0xc0
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0xd0
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0xe0
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0xf0
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x100
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x110
	FMulticastInlineDelegate OnTemperatureChangeDelegate; // 0x120
	FMulticastInlineDelegate OnLowPowerModeDelegate; // 0x130
};

struct UMovieSceneParticleParameterTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x58
};

struct UVehicleAnimInstance : UAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0x990
};

struct UDatasmithDeltaGenSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bRemoveInvisibleNodes; // 0x4a
	bool bSimplifyNodeHierarchy; // 0x4b
	bool bImportVar; // 0x4c
	FString VarPath; // 0x50
	bool bImportPos; // 0x60
	FString PosPath; // 0x68
	bool bImportTml; // 0x78
	FString TmlPath; // 0x80
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct ABravoHotelLightPropActor : AActor {
	bool bLightOn; // 0x328
	bool bLightFlicker; // 0x329
	float LightOnIntensity; // 0x32c
	float LightOnTemperture; // 0x330
	float LightOnAttenuationRadius; // 0x334
	UMaterialInterface* LightOnMaterial; // 0x338
	UMaterialInterface* LightOffMaterial; // 0x340
	UMaterialInterface* LightFlickerFunctionMaterial; // 0x348
	USceneComponent* SceneRootComponent; // 0x350
};

struct UBravoHotelAudioListenerComponent : UAkComponent {
	UBravoHotelAudioAmbientMapData* AmbientMapData; // 0x4b8
};

struct UUW-BlackMarket_Slot_Gear_C : UUW-BlackMarket_Slot_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d8
	UButton* BTN-Menu02; // 0x3e0
	UButton* BTN-Menu03; // 0x3e8
	UButton* BTN-Menu04; // 0x3f0
	UButton* BTN-Menu05; // 0x3f8
	UButton* BTN-Menu06; // 0x400
	UCanvasPanel* CP-SlotInfo; // 0x408
	UImage* IMG-BG; // 0x410
	UImage* IMG-BG-Border; // 0x418
	UImage* IMG-Item; // 0x420
	UImage* IMG-Mask; // 0x428
	UImage* IMG-Over; // 0x430
	UImage* IMG-Over-Border; // 0x438
	UOverlay* Menu02; // 0x440
	UOverlay* Menu03; // 0x448
	UOverlay* Menu04; // 0x450
	UOverlay* Menu05; // 0x458
	UOverlay* Menu06; // 0x460
	UOverlay* Overlay_Mask; // 0x468
	UTextBlock* TXT-Armor; // 0x470
	UTextBlock* TXT-Capacity; // 0x478
	UTextBlock* TXT-DecreaseReloadTime; // 0x480
	UTextBlock* TXT-ItemName; // 0x488
	UTextBlock* TXT-Menu01; // 0x490
	UTextBlock* TXT-Menu02; // 0x498
	UTextBlock* TXT-Menu03; // 0x4a0
	UTextBlock* TXT-Menu04; // 0x4a8
	UTextBlock* TXT-Menu05; // 0x4b0
	UTextBlock* TXT-Menu06; // 0x4b8
	UTextBlock* TXT-Type; // 0x4c0
};

struct UAnimNotifyState_TimedNiagaraEffect : UAnimNotifyState {
	UNiagaraSystem* Template; // 0x30
	FName SocketName; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	bool bDestroyAtEnd; // 0x58
};

struct ULowEntryBitDataEntry : UObject {
	char Type; // 0x28
	char ByteValue; // 0x29
	int32_t IntegerValue; // 0x2c
	ULowEntryLong* LongBytesValue; // 0x30
	float FloatValue; // 0x38
	ULowEntryDouble* DoubleBytesValue; // 0x40
	bool BooleanValue; // 0x48
	FString StringUtf8Value; // 0x50
	TArray<char> ByteArrayValue; // 0x60
	TArray<int32_t> IntegerArrayValue; // 0x70
	TArray<ULowEntryLong*> LongBytesArrayValue; // 0x80
	TArray<float> FloatArrayValue; // 0x90
	TArray<ULowEntryDouble*> DoubleBytesArrayValue; // 0xa0
	TArray<bool> BooleanArrayValue; // 0xb0
	TArray<FString> StringUtf8ArrayValue; // 0xc0
};

struct UDatasmithActorTemplate : UDatasmithObjectTemplate {
	TSet<FName> Layers; // 0x30
	TSet<FName> Tags; // 0x80
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UMaterialExpressionBumpOffset : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Height; // 0x54
	FExpressionInput HeightRatioInput; // 0x68
	float HeightRatio; // 0x7c
	float ReferencePlane; // 0x80
	uint32_t ConstCoordinate; // 0x84
};

struct UNavigationSystemConfig : UObject {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	EARWorldAlignment WorldAlignment; // 0x37
	EARSessionType SessionType; // 0x38
	EARPlaneDetectionMode PlaneDetectionMode; // 0x39
	bool bHorizontalPlaneDetection; // 0x3a
	bool bVerticalPlaneDetection; // 0x3b
	bool bEnableAutoFocus; // 0x3c
	EARLightEstimationMode LightEstimationMode; // 0x3d
	EARFrameSyncMode FrameSyncMode; // 0x3e
	bool bEnableAutomaticCameraOverlay; // 0x3f
	bool bEnableAutomaticCameraTracking; // 0x40
	bool bResetCameraTracking; // 0x41
	bool bResetTrackedObjects; // 0x42
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8c
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8d
	TArray<char> SerializedARCandidateImageDatabase; // 0x90
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa0
};

struct UNiagaraDataInterfaceVolumeTexture : UNiagaraDataInterface {
	UVolumeTexture* Texture; // 0x30
};

struct UUW-CompassUnitWidget_C : UBravoHotelCompassUnitWidget {
	UInvalidationBox* InvalidationBox_1; // 0x250
	UInvalidationBox* InvalidationBox_2; // 0x258
	UTextBlock* SpecialText; // 0x260
};

struct ANativeReplayListLevel : ALevelScriptActor {
	UUserWidget* ReplayListWidget; // 0x330
	UUserWidget* ReplayListWidgetClass; // 0x338
};

struct UInterpTrackInstMove : UInterpTrackInst {
	FVector ResetLocation; // 0x28
	FRotator ResetRotation; // 0x34
};

struct UMovieSceneSignedObject : UObject {
	FGuid Signature; // 0x28
};

struct UUW_UserNameTooltip_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* BT_UserName; // 0x250
	UCanvasPanel* CP_Main; // 0x258
	UHorizontalBox* HB_ItemInfo; // 0x260
	UImage* Image_264; // 0x268
	UImage* Image_265; // 0x270
	UImage* Image_1163; // 0x278
	UImage* IMG_Frontbar; // 0x280
	UImage* IMG_Item; // 0x288
	UImage* Img_TeamColor; // 0x290
	UProgressBar* PB_HP; // 0x298
	UProgressBar* PB_ItemCasting; // 0x2a0
	UTextBlock* T_Item; // 0x2a8
	UTextBlock* T_Quantity; // 0x2b0
	UTextBlock* T_TeamNum; // 0x2b8
	UTextBlock* T_UserName; // 0x2c0
	ABravoHotelPlayerState* PlayerState; // 0x2c8
	APlayerController* ReplayController; // 0x2d0
	ABravoHotelCharacter* TargetCharacter; // 0x2d8
	FVector2D MaxViewportSize; // 0x2e0
	FVector2D LocalScreenPosition; // 0x2e8
	bool IsPositionUpdated; // 0x2f0
	float DefaultCharacterZLocation; // 0x2f4
};

struct UAkAuxBus : UAkAssetBase {
	UAkAudioBank* RequiredBank; // 0x50
};

struct UBravoHotelPlayerInfoProgressSlotWidget : UUserWidget {
	USizeBox* SizeBox_main; // 0x248
	UImage* Image_bg; // 0x250
	UProgressBar* MainProgressBar; // 0x258
	UProgressBar* CureLimitProgressBar; // 0x260
	UProgressBar* TargetProgressBar; // 0x268
	UProgressBar* BeforeProgressBar; // 0x270
	UProgressBar* ShortTimeProgressBar; // 0x278
	UWidgetAnimation* DangerHp; // 0x280
	UWidgetAnimation* Anim_Increase; // 0x288
	UWidgetAnimation* Anim_AdditionalHP; // 0x290
	UObject* DefaultSlotSprite; // 0x298
	UObject* FirstSlotSprite; // 0x2a0
	UObject* LastSlotSprite; // 0x2a8
	int32_t MaxHealth; // 0x2b0
	bool bIsKnockOutMode; // 0x2b4
};

struct USpectatorBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	bool bRestrictCrossConsole; // 0x38
	TArray<FSpectatorReservation> Reservations; // 0x40
};

struct UBTTask_MakeNoise : UBTTaskNode {
	float Loudnes; // 0x70
};

struct UMovieSceneCameraCutSection : UMovieSceneSection {
	FGuid CameraGuid; // 0xe0
	FMovieSceneObjectBindingID CameraBindingID; // 0xf0
};

struct UUW-SearchingMaterial_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Anim_LoopHintSpecialWeapon; // 0x250
	UButton* Button_183; // 0x258
	UButton* Button_283; // 0x260
	UCanvasPanel* CanvasPanel; // 0x268
	UCanvasPanel* CanvasPanel_2; // 0x270
	UImage* Image_2; // 0x278
	UImage* Image_3; // 0x280
	UImage* Image_4; // 0x288
	UImage* Image_185; // 0x290
	UImage* Image_186; // 0x298
	UImage* Image_189; // 0x2a0
	UImage* Image_297; // 0x2a8
	UImage* Img_Find; // 0x2b0
	UOverlay* Overlay_2; // 0x2b8
	USizeBox* SizeBox_3; // 0x2c0
	UTextBlock* T_SerchButton; // 0x2c8
	UTextBlock* TextBlock_5; // 0x2d0
	UTextBlock* TextBlock_495; // 0x2d8
	UThrobber* Throbber; // 0x2e0
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot; // 0x2e8
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_2; // 0x2f0
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_3; // 0x2f8
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_4; // 0x300
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_5; // 0x308
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_6; // 0x310
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_7; // 0x318
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_8; // 0x320
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_9; // 0x328
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_10; // 0x330
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_11; // 0x338
	UUW-Inventory_MaterialIconSlot_C* UW-Inventory_MaterialIconSlot_12; // 0x340
	UVerticalBox* VerticalBox_2; // 0x348
	UVerticalBox* VerticalBox_4; // 0x350
	bool ShowButton; // 0x358
	int32_t Index; // 0x35c
	TArray<FName> TempList; // 0x360
	int32_t MaxSlotCount; // 0x370
	bool EnableShowExpertWeapon; // 0x374
};

struct UMaterialExpressionGetMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x40
	TArray<FGuid> AttributeGetTypes; // 0x58
};

struct UPoseAsset : UAnimationAsset {
	FPoseDataContainer PoseContainer; // 0x88
	bool bAdditivePose; // 0x118
	int32_t BasePoseIndex; // 0x11c
	FName RetargetSource; // 0x120
};

struct UUW-Lobby_WeaponInfo_OptionList_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UUW-Lobby_WeaponInfo_Option_Slot_C* UW-Lobby_WeaponInfo_Option_Slot; // 0x250
	UUW-Lobby_WeaponInfo_Option_Slot_C* UW-Lobby_WeaponInfo_Option_Slot_2; // 0x258
	UUW-Lobby_WeaponInfo_Option_Slot_C* UW-Lobby_WeaponInfo_Option_Slot_3; // 0x260
	UUW-Lobby_WeaponInfo_Option_Slot_C* UW-Lobby_WeaponInfo_Option_Slot_4; // 0x268
	UVerticalBox* VerticalBox_OptionList; // 0x270
};

struct AChat_System_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	USceneComponent* DefaultSceneRoot; // 0x330
	TArray<AChat_System_C*> Muted Players; // 0x338
	bool Two-way Mute?; // 0x348
	FString Player Name; // 0x350
	TArray<AChat_System_C*> Players to Message; // 0x360
	UChat_GameInstance_C* Game Instance Blueprint; // 0x370
	TArray<FString> Joined Groups; // 0x378
	TArray<FString> Banned Groups; // 0x388
	TArray<FString> Owned Groups; // 0x398
	UChat_MainWidget_C* Chat Widget; // 0x3a8
	UHUD_Widget_C* HUD Widget; // 0x3b0
};

struct ULowEntryBitDataReader : UObject {
	TArray<char> Bytes; // 0x28
	int32_t Position; // 0x38
	char CurrentByte; // 0x3c
	int32_t CurrentBytePosition; // 0x40
};

struct UUW-ReportUserConfirm_C : UBravoHotelReportUserConfirmWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x258
	UButton* btn_Cancel; // 0x260
	UButton* btn_confirm; // 0x268
	UImage* popup-bg; // 0x270
	UTextBlock* txt_description; // 0x278
	UImage* uw-bg; // 0x280
};

struct UUW-Lobby_CharacterInfo_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_306; // 0x250
	UCanvasPanel* CanvasPanel_Line; // 0x258
	UCanvasPanel* CanvasPanel_Position; // 0x260
	UImage* Image_Leader; // 0x268
	UImage* Image_Rank; // 0x270
	UImage* Img_Cut; // 0x278
	UImage* Img_MS; // 0x280
	UImage* Img_MS_2; // 0x288
	UImage* Img_MS_3; // 0x290
	UImage* Img_PlayerLine; // 0x298
	UImage* Img_PlayerPoint; // 0x2a0
	UImage* Img_Voice; // 0x2a8
	UImage* Img_VoiceElimination; // 0x2b0
	UOverlay* Overlay_OnReady; // 0x2b8
	UOverlay* Overlay_Position; // 0x2c0
	UOverlay* Overlay_TeamOnReady; // 0x2c8
	UTextBlock* T_PlayerName; // 0x2d0
	UTextBlock* T_PlayerName_2; // 0x2d8
	UWidgetSwitcher* WidgetSwitcher_3; // 0x2e0
	UWidgetSwitcher* WidgetSwitcher_IsTeam; // 0x2e8
	UWidgetSwitcher* WidgetSwitcher_State; // 0x2f0
	int32_t LastSeaponTierId; // 0x2f8
	float WidgetHalfSizeX; // 0x2fc
};

struct UBorder : UContentWidget {
	EHorizontalAlignment HorizontalAlignment; // 0x120
	EVerticalAlignment VerticalAlignment; // 0x121
	char bShowEffectWhenDisabled : 1; // 0x122
	FLinearColor ContentColorAndOpacity; // 0x124
	FDelegate ContentColorAndOpacityDelegate; // 0x134
	FMargin Padding; // 0x144
	FSlateBrush Background; // 0x158
	FDelegate BackgroundDelegate; // 0x1e0
	FLinearColor BrushColor; // 0x1f0
	FDelegate BrushColorDelegate; // 0x200
	FVector2D DesiredSizeScale; // 0x210
	bool bFlipForRightToLeftFlowDirection; // 0x218
	FDelegate OnMouseButtonDownEvent; // 0x21c
	FDelegate OnMouseButtonUpEvent; // 0x22c
	FDelegate OnMouseMoveEvent; // 0x23c
	FDelegate OnMouseDoubleClickEvent; // 0x24c
};

struct UParticleModuleEventGenerator : UParticleModuleEventBase {
	TArray<FParticleEvent_GenerateInfo> Events; // 0x30
};

struct UARCandidateImage : UDataAsset {
	UTexture2D* CandidateTexture; // 0x30
	FString FriendlyName; // 0x38
	float Width; // 0x48
	float Height; // 0x4c
	EARCandidateImageOrientation Orientation; // 0x50
};

struct ALight : AActor {
	ULightComponent* LightComponent; // 0x328
	char bEnabled : 1; // 0x330
};

struct UButton : UContentWidget {
	USlateWidgetStyleAsset* Style; // 0x160
	FButtonStyle WidgetStyle; // 0x168
	FLinearColor ColorAndOpacity; // 0x3e0
	FLinearColor BackgroundColor; // 0x3f0
	EButtonClickMethod ClickMethod; // 0x400
	EButtonTouchMethod TouchMethod; // 0x401
	EButtonPressMethod PressMethod; // 0x402
	bool IsFocusable; // 0x403
	FMulticastInlineDelegate OnClicked; // 0x408
	FMulticastInlineDelegate OnPressed; // 0x418
	FMulticastInlineDelegate OnReleased; // 0x428
	FMulticastInlineDelegate OnHovered; // 0x438
	FMulticastInlineDelegate OnUnhovered; // 0x448
};

struct UUW-PerkDeckWidget_C : UBravoHotelPerkDeckWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Msg_open; // 0x250
	UWidgetAnimation* POPUP_OPEN; // 0x258
	UWidgetAnimation* Idle; // 0x260
	UButton* btn_Choose; // 0x268
	UButton* btn_OK; // 0x270
	UButton* btn_OK_6; // 0x278
	UButton* btn_PerkDeck; // 0x280
	UButton* Button_CloseMovie; // 0x288
	UButton* Button_PlayMovie; // 0x290
	UButton* Button_Refresh; // 0x298
	UButton* Button_Reselect; // 0x2a0
	UButton* Button_SelectMode; // 0x2a8
	UCanvasPanel* Canvas_CantSelectMessage; // 0x2b0
	UCanvasPanel* Canvas_MovieScreen; // 0x2b8
	UCanvasPanel* CanvasPanel_ClassList; // 0x2c0
	UCanvasPanel* CanvasPanel_NewbieAdvantage; // 0x2c8
	UCheckBox* CheckBox_PerkDeckNotReOpen; // 0x2d0
	UOverlay* GoldLack; // 0x2d8
	UHorizontalBox* HorizontalBox_ClassList; // 0x2e0
	UHorizontalBox* HorizontalBox_PerkDeckReOpen; // 0x2e8
	UImage* Image_1; // 0x2f0
	UImage* Image_2; // 0x2f8
	UImage* Image_5; // 0x300
	UImage* Image_10; // 0x308
	UImage* Image_11; // 0x310
	UImage* Image_13; // 0x318
	UImage* Image_134; // 0x320
	UImage* Image_213; // 0x328
	UImage* Image_247; // 0x330
	UImage* Image_271; // 0x338
	UImage* Image_276; // 0x340
	UImage* Image_335; // 0x348
	UImage* Image_342; // 0x350
	UImage* Image_484; // 0x358
	UImage* Image_566; // 0x360
	UImage* Image_1200; // 0x368
	UImage* Image_1511; // 0x370
	UImage* Image_Class; // 0x378
	UImage* Image_ClassIcon; // 0x380
	UImage* Image_Cycle; // 0x388
	UImage* Image_Cycle_2; // 0x390
	UImage* Image_Cycle_4; // 0x398
	UImage* Image_Weapon; // 0x3a0
	UImage* Img_Movie; // 0x3a8
	UHorizontalBox* ReseletTextGroup1; // 0x3b0
	UHorizontalBox* ReseletTextGroup1_2; // 0x3b8
	UOverlay* ReseletTextGroup2; // 0x3c0
	UOverlay* ReseletTextGroup2_2; // 0x3c8
	UOverlay* ReseletTextGroup2_4; // 0x3d0
	UScaleBox* ScaleBox_ClassList; // 0x3d8
	UScaleBox* ScaleBox_SelectNotifyMessage; // 0x3e0
	USizeBox* SizeBox_Choose; // 0x3e8
	USizeBox* SizeBox_Ok; // 0x3f0
	USizeBox* SizeBox_Ok2; // 0x3f8
	USizeBox* SizeBox_Random; // 0x400
	USizeBox* SizeBox_Refrest; // 0x408
	USizeBox* SizeBox_Select; // 0x410
	UTextBlock* T_AmmoName; // 0x418
	UTextBlock* T_ClassDeckName; // 0x420
	UTextBlock* T_ClassDesc; // 0x428
	UTextBlock* T_CurrentGold; // 0x430
	UTextBlock* T_WeaponDesc; // 0x438
	UTextBlock* T_WeaponName; // 0x440
	UTextBlock* TextBlock_Close; // 0x448
	UTextBlock* TextBlock_Close_2; // 0x450
	UTextBlock* TextBlock_Close_7; // 0x458
	UTextBlock* TextBlock_MaxReset; // 0x460
	UTextBlock* TextBlock_MaxReset_2; // 0x468
	UTextBlock* TextBlock_Price_ChangeDeckList; // 0x470
	UTextBlock* TextBlock_Price_Random; // 0x478
	UTextBlock* TextBlock_Price_Select; // 0x480
	UTextBlock* TextBlock_RandomRemainCount; // 0x488
	UTextBlock* TextBlock_RefreshRemainCount; // 0x490
	UTextBlock* TextBlock_Reselect; // 0x498
	UTextBlock* TextBlock_Reselect_2; // 0x4a0
	UTextBlock* TextBlock_Reselect_4; // 0x4a8
	UUW-Inventory_Perk_C* UW-Inventory_Perk; // 0x4b0
	UUW-Timer_C* UW-Timer; // 0x4b8
	UWidgetSwitcher* WidgetSwitcher_ChangeDeck; // 0x4c0
	UWidgetSwitcher* WidgetSwitcher_ChangeDeck_2; // 0x4c8
	UWidgetSwitcher* WidgetSwitcher_Reselect; // 0x4d0
	UWidgetSwitcher* WidgetSwitcher_Reselect_2; // 0x4d8
	UWidgetSwitcher* WidgetSwitcher_Reselect_4; // 0x4e0
	UUW-InventoryWidget_C* InventoryWidget; // 0x4e8
	TArray<UUW-Inventory_PopupPerkSlot_C*> Slots; // 0x4f0
	FSlateBrush IconBrush; // 0x500
	UUW-Inventory_ItemSlotHover_C* HoverWidget; // 0x588
	FTimerHandle HoverTimerHandle; // 0x590
	int64_t LocalTemp; // 0x598
	UMediaPlayer* MediaPlayer; // 0x5a0
	TMap<int32_t, UMediaSource*> ClassVideo_Map; // 0x5a8
	bool bBlockButton; // 0x5f8
	bool bButtonEnabled; // 0x5f9
	bool bCanRemainCount; // 0x5fa
	bool bCanCurrentGold; // 0x5fb
	bool bWaitingResponse; // 0x5fc
	int64_t CurrentGold; // 0x600
	int32_t ChangeDeckCount; // 0x608
	int32_t ChangeDeckListCount; // 0x60c
	int32_t PerkDeckID; // 0x610
	int32_t DisableTime; // 0x614
	TMap<FName, UUW-PerkDeckSelectItemWidget_C*> ClassInfoWidgetMap; // 0x618
	FPerkDeckSelectInfo CurrentPerkDeckSelectInfo; // 0x668
	int32_t LocalPerkMode; // 0x680
	float ClassListPadding; // 0x684
	FTimerHandle Handle_PlayMovie; // 0x688
	UMediaSource* CurrentClassVideo; // 0x690
	FTimerHandle Handle_SetPerkInfoByHoverClassButton; // 0x698
	bool LastClassButtonHovered; // 0x6a0
	int32_t LastClassIndex; // 0x6a4
};

struct UUW-ReplayListItemWidget_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UCanvasPanel* AdministratorPanel; // 0x250
	UVerticalBox* Cheat; // 0x258
	UImage* Image_Lock; // 0x260
	UImage* Image_Version; // 0x268
	UButton* ReplayListItemBtn_; // 0x270
	UTextBlock* TextBlock_BattleMode; // 0x278
	UTextBlock* TextBlock_Day; // 0x280
	UTextBlock* TextBlock_FileSize; // 0x288
	UTextBlock* TextBlock_FPP; // 0x290
	UTextBlock* TextBlock_MapName; // 0x298
	UTextBlock* TextBlock_Month; // 0x2a0
	UTextBlock* TextBlock_PlayerRank; // 0x2a8
	UTextBlock* TextBlock_PlayTime; // 0x2b0
	UTextBlock* TextBlock_Time; // 0x2b8
	UTextBlock* TextBlock_TotalCount; // 0x2c0
	UTextBlock* TextBlock_TotalPlayerCount; // 0x2c8
	UTextBlock* TextBlock_Year; // 0x2d0
	FMulticastInlineDelegate Click; // 0x2d8
	FMKReplayListItemInfo ReplayItemInfo; // 0x2e8
	FButtonStyle Style; // 0x410
	UBravoHotelReplayListWidget* ReplayListWidget; // 0x688
};

struct UUW-PerkLevelUp_02_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Level_Up_New; // 0x250
	UWidgetAnimation* VSkill_Motion; // 0x258
	UWidgetAnimation* FinalitySkill_Motion; // 0x260
	UWidgetAnimation* LEVEL_UP; // 0x268
	UCanvasPanel* CanvasPanel_294; // 0x270
	UTextBlock* FSkill_Info; // 0x278
	UTextBlock* FSkill_Title; // 0x280
	UHorizontalBox* HorizontalBox_290; // 0x288
	UImage* Image_1; // 0x290
	UImage* Image_2; // 0x298
	UImage* Image_4; // 0x2a0
	UImage* Image_5; // 0x2a8
	UImage* Image_6; // 0x2b0
	UImage* Image_9; // 0x2b8
	UImage* Image_10; // 0x2c0
	UImage* Image_245; // 0x2c8
	UImage* Image_247; // 0x2d0
	UImage* Image_413; // 0x2d8
	UImage* Image_458; // 0x2e0
	UImage* Image_602; // 0x2e8
	UImage* Image_UltimateGetMat; // 0x2f0
	UImage* IMG_FinalitySkill; // 0x2f8
	UImage* Img_UltimateMaterial; // 0x300
	UImage* Light; // 0x308
	UTextBlock* T_Desc; // 0x310
	UTextBlock* T_Level; // 0x318
	UTextBlock* T_PerkName; // 0x320
	UTextBlock* TextBlock_LevelUpNewText; // 0x328
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_LevelUp; // 0x330
	UUW-Inventory_PerkSlot_C* UW-Inventory_PerkSlot_VSkill; // 0x338
	UTextBlock* VSkill_Info; // 0x340
	UTextBlock* VSkill_Titile; // 0x348
	UImage* VSkillThumbStroke_02; // 0x350
	UWidgetSwitcher* WidgetSwitcher_LevelUpInfo; // 0x358
	FTimerHandle Handle_LevelUpEffect; // 0x360
	float EffectDelay; // 0x368
	TArray<FPerkUIInfo> PerkInfoQue; // 0x370
	FPerkUIInfo CurrentPerkInfo; // 0x380
	TArray<BP-PerkLevelUpInfoEnum> PerkLevelUpInfo; // 0x3b0
	FPerkLevelUpData PerkLevelUpData; // 0x3c0
	FPerkData CurrentPerkData; // 0x538
	int32_t CurrentLevel; // 0x618
	bool IsAlreadyUnlockedUltimate; // 0x61c
	BP-PerkLevelUpInfoEnum CurrentLevelUpInfo; // 0x61d
	TArray<int32_t> CurrentLevelQue; // 0x620
	float CurrentUltimateMaterialValue; // 0x630
	bool UltimateUpdate; // 0x634
	UMaterialInstanceDynamic* UltimateMaterialInstance; // 0x638
	float UltimateAnimTime; // 0x640
	UMaterialInstanceDynamic* UltimateGetMaterialInstance; // 0x648
};

struct UMotionControllerComponent : UPrimitiveComponent {
	int32_t PlayerIndex; // 0x4b0
	EControllerHand Hand; // 0x4b4
	FName MotionSource; // 0x4b8
	char bDisableLowLatencyUpdate : 1; // 0x4c0
	ETrackingStatus CurrentTrackingStatus; // 0x4c4
	bool bDisplayDeviceModel; // 0x4c5
	FName DisplayModelSource; // 0x4c8
	UStaticMesh* CustomDisplayMesh; // 0x4d0
	TArray<UMaterialInterface*> DisplayMeshMaterialOverrides; // 0x4d8
	UPrimitiveComponent* DisplayComponent; // 0x550
};

struct UButtonSlot : UPanelSlot {
	FMargin Padding; // 0x38
	EHorizontalAlignment HorizontalAlignment; // 0x48
	EVerticalAlignment VerticalAlignment; // 0x49
};

struct ULadderComponent : UActorComponent {
	ABravoHotelCharacter* OwnerPawn; // 0xc0
	ELadderState LadderState; // 0xc8
	ABravoHotelLadder* UsingLadder; // 0xd0
	bool IsPawnOnLadder; // 0xd8
	bool IsTopStart; // 0xd9
	float LadderPos; // 0xdc
	ELadderInteractionType LadderInteractionType; // 0xe0
	UAkAudioEvent* LadderSlideLoopEvent; // 0xe8
	UAkAudioEvent* LadderSlideStopEvent; // 0xf0
	float PreMaxFlySpeed; // 0x100
	float PreBrakingDecelerationFlying; // 0x104
	float DefaultMaxFlySpeed; // 0x108
	float SpeedScaleByBuff; // 0x10c
	float WantedBrakingDecelerationFlying; // 0x110
	float SprintingSpeedScale; // 0x114
	float SlidingSpeedScale; // 0x118
	bool IsSnapping; // 0x11c
	bool IsDirectSnap; // 0x11d
	float SnappingSpeed; // 0x120
	float SnappingTime; // 0x124
	float MinSnappingTime; // 0x128
	float CrntSnappingTime; // 0x12c
	FVector OriginLocation; // 0x130
	FVector TargetLocation; // 0x13c
	FRotator OriginRotation; // 0x148
	FRotator TargetRotation; // 0x154
	bool IsMoveInMotion; // 0x160
	float AnimBlendTime; // 0x164
	UAnimMontage* AM_DownIn; // 0x168
	UAnimMontage* AM_UpIn; // 0x170
	UAnimMontage* AM_DownOut; // 0x178
	UAnimMontage* AM_DownOut_R; // 0x180
	UAnimMontage* AM_UpOut; // 0x188
	UAnimMontage* AM_UpOut_R; // 0x190
	UAnimMontage* AM_SlideOut; // 0x198
	UAnimMontage* CrntMontage; // 0x1a0
	UCurveVector* CurveVector_DownIn; // 0x1a8
	UCurveVector* CurveVector_UpIn; // 0x1b0
	UCurveVector* CurveVector_DownOut; // 0x1b8
	UCurveVector* CurveVector_DownOut_R; // 0x1c0
	UCurveVector* CurveVector_UpOut; // 0x1c8
	UCurveVector* CurveVector_UpOut_R; // 0x1d0
	UCurveVector* CurveVector_SlideOut; // 0x1d8
	UCurveVector* CrntCurveVector; // 0x1e0
	UCurveFloat* Curve_CameraIn; // 0x1e8
	UCurveFloat* Curve_CameraInHeight; // 0x1f0
	UCurveFloat* Curve_CameraSecond; // 0x1f8
	UCurveFloat* Curve_CameraSecondHeight; // 0x200
	UCurveFloat* Curve_CameraOut; // 0x208
};

struct ULogoutCallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnSuccess; // 0x30
	FMulticastInlineDelegate OnFailure; // 0x40
};

struct UMaterialExpressionLandscapeLayerSwitch : UMaterialExpression {
	FExpressionInput LayerUsed; // 0x40
	FExpressionInput LayerNotUsed; // 0x54
	FName ParameterName; // 0x68
	char PreviewUsed : 1; // 0x70
	FGuid ExpressionGUID; // 0x74
};

struct UAITask_MoveTo : UAITask {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UMaterialExpressionSkyAtmosphereLightDirection : UMaterialExpression {
	int32_t LightIndex; // 0x40
};

struct UDamageType : UObject {
	char bCausedByWorld : 1; // 0x28
	char bScaleMomentumByMass : 1; // 0x28
	char bRadialDamageVelChange : 1; // 0x28
	float DamageImpulse; // 0x2c
	float DestructibleImpulse; // 0x30
	float DestructibleDamageSpreadScale; // 0x34
	float DamageFalloff; // 0x38
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UCurveFloat : UCurveBase {
	FRichCurve FloatCurve; // 0x30
	bool bIsEventCurve; // 0xb0
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x48
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x48
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0xa8
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xe8
	UEnum* StateEnum; // 0x108
	AActor* SharingActor; // 0x110
};

struct UMagicLeapPlanesComponent : USceneComponent {
	TArray<EMagicLeapPlaneQueryFlags> QueryFlags; // 0x230
	UBoxComponent* SearchVolume; // 0x240
	int32_t MaxResults; // 0x248
	float MinHolePerimeter; // 0x24c
	float MinPlaneArea; // 0x250
	EMagicLeapPlaneQueryType QueryType; // 0x254
	float SimilarityThreshold; // 0x258
	FMulticastInlineDelegate OnPlanesQueryResult; // 0x260
	FMulticastInlineDelegate OnPersistentPlanesQueryResult; // 0x270
};

struct UBravoHotelCreateCharacterWidget : UBravoHotelCoherentBaseWidget {
	UBravoHotelCustomizedCharacter* CustomizedCharacterComponent; // 0x298
};

struct UParticleModuleMeshRotationRate_Seeded : UParticleModuleMeshRotationRate {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x78
};

struct USystemTimeTimecodeProvider : UTimecodeProvider {
	FFrameRate FrameRate; // 0x30
	bool bGenerateFullFrame; // 0x38
	bool bUseHighPerformanceClock; // 0x39
};

struct UArmoryDataAsset : UDataAsset {
	TSoftObjectPtr<UStaticMesh> StaticMesh; // 0x30
	FVector LocationOffset; // 0x58
	FRotator RotationOffset; // 0x64
	FVector ScaleOffset; // 0x70
};

struct UInvalidationBox : UContentWidget {
	bool bCanCache; // 0x120
	bool CacheRelativeTransforms; // 0x121
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x230
	int32_t VirtualUserIndex; // 0x250
	float PointerIndex; // 0x254
	ECollisionChannel TraceChannel; // 0x258
	float InteractionDistance; // 0x25c
	EWidgetInteractionSource InteractionSource; // 0x260
	bool bEnableHitTesting; // 0x261
	bool bShowDebug; // 0x262
	FLinearColor DebugColor; // 0x264
	FHitResult CustomHitResult; // 0x2f0
	FVector2D LocalHitLocation; // 0x378
	FVector2D LastLocalHitLocation; // 0x380
	UWidgetComponent* HoveredWidgetComponent; // 0x388
	FHitResult LastHitResult; // 0x390
	bool bIsHoveredWidgetInteractable; // 0x418
	bool bIsHoveredWidgetFocusable; // 0x419
	bool bIsHoveredWidgetHitTestVisible; // 0x41a
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct ABravoHotelItemSpawnSimulationBox : AActor {
	FSpawnPerkData SpawnPerkData; // 0x330
	FMulticastInlineDelegate OnEndSimulationDelegate; // 0x390
	FVector PreLocation; // 0x3a0
	int32_t CheckCount; // 0x3ac
	int32_t MaxCount; // 0x3b0
	UStaticMeshComponent* Box; // 0x3b8
};

struct UWrapBox : UPanelWidget {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	bool bExplicitWrapWidth; // 0x12c
	EHorizontalAlignment HorizontalAlignment; // 0x12d
};

struct APrefabToolActor : AActor {
	UPrefabToolComponent* PrefabComponent; // 0x328
};

struct UStereoLayerComponent : USceneComponent {
	char bLiveTexture : 1; // 0x230
	char bSupportsDepth : 1; // 0x230
	char bNoAlphaChannel : 1; // 0x230
	UTexture* Texture; // 0x238
	UTexture* LeftTexture; // 0x240
	char bQuadPreserveTextureRatio : 1; // 0x248
	FVector2D QuadSize; // 0x24c
	FBox2D UVRect; // 0x254
	float CylinderRadius; // 0x268
	float CylinderOverlayArc; // 0x26c
	int32_t CylinderHeight; // 0x270
	FEquirectProps EquirectProps; // 0x274
	EStereoLayerType StereoLayerType; // 0x2bc
	EStereoLayerShape StereoLayerShape; // 0x2bd
	UStereoLayerShape* Shape; // 0x2c0
	int32_t Priority; // 0x2c8
};

struct UEditableGameplayTagQueryExpression_NoTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ABravoHotelPickup : AActor {
	UBoxComponent* BoxComponent; // 0x330
	USphereComponent* SphereComponent; // 0x338
	UStaticMeshComponent* WorldStaticMesh; // 0x340
	USkeletalMeshComponent* WorldSkelMesh; // 0x348
	UBravoHotelAudioEmitterComponent* AudioComponent; // 0x358
	FInventoryItemInfo ItemInfo; // 0x360
	FInventoryItemDetailInfo DetailItemInfo; // 0x3f8
	TArray<FInventoryItemInfo> AttachmentItems; // 0x888
	bool bDrawDebugInfo; // 0x898
	TArray<UObject*> LoadedAssets; // 0x8a0
	bool bLoadMesh; // 0x8b9
	bool bPlaceOnTheGround; // 0x8ba
	FMulticastInlineDelegate OnChangeItemInfoDelegate; // 0x8c0
	bool IsSpawnBook; // 0x8d0
	UParticleSystemComponent* BookSpawnEffectComponent; // 0x8d8
	UParticleSystem* BookSpawnEffect; // 0x8e0
	UParticleSystemComponent* RootParticleComponent; // 0x8e8
	UParticleSystemComponent* MeshParticleComponent; // 0x8f0
	TArray<UParticleSystemComponent*> PassiveChildParticleComponents; // 0x8f8
	TArray<UParticleSystemComponent*> ActiveChildParticleComponents; // 0x908
	UParticleSystem* RootParticle; // 0x920
};

struct UNodeMappingContainer : UObject {
	TMap<FName, FNodeItem> SourceItems; // 0x28
	TMap<FName, FNodeItem> TargetItems; // 0x78
	TMap<FName, FName> SourceToTarget; // 0xc8
	TSoftObjectPtr<UObject> SourceAsset; // 0x118
	TSoftObjectPtr<UObject> TargetAsset; // 0x140
};

struct AEmitterCameraLensEffectBase : AEmitter {
	UParticleSystem* PS_CameraEffect; // 0x378
	UParticleSystem* PS_CameraEffectNonExtremeContent; // 0x380
	APlayerCameraManager* BaseCamera; // 0x388
	FTransform RelativeTransform; // 0x390
	float BaseFOV; // 0x3c0
	char bAllowMultipleInstances : 1; // 0x3c4
	char bResetWhenRetriggered : 1; // 0x3c4
	TArray<AEmitterCameraLensEffectBase*> EmittersToTreatAsSame; // 0x3c8
	float DistFromCamera; // 0x3d8
};

struct UUW-Inventory_CharacterDragPanel_C : UUserWidget {
	UImage* Image_91; // 0x248
	ABravoHotelInventoryCharacter* InventoryCharacterRef; // 0x250
	bool Visible; // 0x258
};

struct ABravoHotelBootyBoxActor : ABravoHotelDropBoxActor {
	UParticleSystem* RarityParticle; // 0x3a8
	UParticleSystemComponent* RarityParticleComponent; // 0x3b0
	EItemRarity HighestRarityOfCurrentItems; // 0x3b8
	FTimerHandle TimerHandle_Deactivate; // 0x3c8
};

struct UAkTVOSInitializationSettings : UObject {
	FAkCommonInitializationSettingsWithSampleRate CommonSettings; // 0x28
	FAkAudioSession AudioSession; // 0x90
	FAkCommunicationSettingsWithSystemInitialization CommunicationSettings; // 0xa0
	FAkAdvancedInitializationSettings AdvancedSettings; // 0xc8
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct AStandInMeshActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x328
};

struct ALine_WidgetActor_C : AActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x328
	UWidgetComponent* Widget1; // 0x330
	USceneComponent* DefaultSceneRoot; // 0x338
};

struct UEditableGameplayTagQueryExpression_NoExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UAkSettings : UObject {
	char MaxSimultaneousReverbVolumes; // 0x28
	FFilePath WwiseProjectPath; // 0x30
	FDirectoryPath WwiseSoundDataFolder; // 0x40
	bool bAutoConnectToWAAPI; // 0x50
	ECollisionChannel DefaultOcclusionCollisionChannel; // 0x51
	TMap<TSoftObjectPtr<UPhysicalMaterial>, FAkGeometrySurfacePropertiesToMap> AkGeometryMap; // 0x58
	bool SplitSwitchContainerMedia; // 0xa8
	bool SplitMediaPerFolder; // 0xa9
	bool UseEventBasedPackaging; // 0xaa
	bool EnableAutomaticAssetSynchronization; // 0xab
	TSoftClassPtr<UObject> ComponentClass; // 0xb0
	FString CommandletCommitMessage; // 0xd8
	TMap<FString, FString> UnrealCultureToWwiseCulture; // 0xe8
	bool AskedToUseNewAssetManagement; // 0x138
	bool bEnableMultiCoreRendering; // 0x139
	bool MigratedEnableMultiCoreRendering; // 0x13a
	bool FixupRedirectorsDuringMigration; // 0x13b
	FDirectoryPath WwiseWindowsInstallationPath; // 0x140
	FFilePath WwiseMacInstallationPath; // 0x150
};

struct UArrowBtn_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_68; // 0x250
	UImage* Normal; // 0x258
	UImage* Over; // 0x260
	UOverlay* Overlay_113; // 0x268
	UImage* Press; // 0x270
	FMulticastInlineDelegate CilckBtn; // 0x278
	bool IsLeft; // 0x288
};

struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x30
	char bBakedDataSuccesfully : 1; // 0x30
};

struct UMoviePlayerSettings : UObject {
	bool bWaitForMoviesToComplete; // 0x28
	bool bMoviesAreSkippable; // 0x29
	TArray<FString> StartupMovies; // 0x30
};

struct UMaterialExpressionFunctionInput : UMaterialExpression {
	FExpressionInput Preview; // 0x40
	FName InputName; // 0x54
	FString Description; // 0x60
	FGuid ID; // 0x70
	EFunctionInputType InputType; // 0x80
	FVector4 PreviewValue; // 0x90
	char bUsePreviewValueAsDefault : 1; // 0xa0
	int32_t SortPriority; // 0xa4
	char bCompilingFunctionPreview : 1; // 0xa8
};

struct UParticleModuleCollisionGPU : UParticleModuleCollisionBase {
	FRawDistributionFloat Resilience; // 0x30
	FRawDistributionFloat ResilienceScaleOverLife; // 0x60
	float Friction; // 0x90
	float RandomSpread; // 0x94
	float RandomDistribution; // 0x98
	float RadiusScale; // 0x9c
	float RadiusBias; // 0xa0
	EParticleCollisionResponse Response; // 0xa4
	EParticleCollisionMode CollisionMode; // 0xa5
};

struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x230
	float OrthoWidth; // 0x234
	float OrthoNearClipPlane; // 0x238
	float OrthoFarClipPlane; // 0x23c
	float AspectRatio; // 0x240
	char bConstrainAspectRatio : 1; // 0x244
	char bUseFieldOfViewForLOD : 1; // 0x244
	char bLockToHmd : 1; // 0x24c
	char bUsePawnControlRotation : 1; // 0x24c
	ECameraProjectionMode ProjectionMode; // 0x24d
	float PostProcessBlendWeight; // 0x280
	FPostProcessSettings PostProcessSettings; // 0x2b0
};

struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; // 0x30
};

struct UBravoHotelAbilityComponent : UActorComponent {
	TMap<ECharacterConditionType, FBravoHotelConditionState> ConditionStates; // 0xc0
	TMap<uint16_t, UBuffControlState*> BuffControls; // 0x120
	float LoudnessProneRatio; // 0x170
	float LoudnessTime; // 0x174
	UCurveFloat* MaterialEffectCurve; // 0x178
	TMap<int32_t, FBravoHotelBuffUIInfo> BuffUIInfos; // 0x188
	UBravoHotelDebugWidget* WeaponDebugTextWidget; // 0x280
	float LoudnessCrouchRatio; // 0x288
	FBravoHotelDefaultBalanceData DefaultBalanceData; // 0x290
	TMap<uint16_t, UBravoHotelBuffBase*> CurrentBuffInfos; // 0x308
	TMap<UObject*, FMaterialEffectInfo> MaterialEffectInfos; // 0x358
	AActor* DefaultFireCell; // 0x3a8
	FBuffHandleArray CurrentBuffKeys; // 0x3b0
	TMap<EBuffEventType, FMulticastInlineDelegate> BuffEndEventDelegates; // 0x4c8
	TMap<ECharacterAbilityType, FBravoHotelAbilityState> AbilityStates; // 0x568
	TMap<ECharacterBuffType, FName> CharacterBuffDataKeys; // 0x5b8
	uint64_t ConditionFlags; // 0x610
	TMap<EWeaponBuffEventType, FMulticastInlineDelegate> WeaponBuffEventDelegates; // 0x618
	UUserWidget* DebugWidget; // 0x668
	FBuffHandleArray ControlledInstantBuffKeys; // 0x670
	float Loudness; // 0x788
	float SimulatedTickTime; // 0x78c
	TMap<ECharacterConditionedAbilityType, FBravoHotelConditionedAbilityState> ConditionedAbilityStates; // 0x7d8
	UCurveFloat* MaterialEffectStrCurve; // 0x830
	UUserWidget* DebugWidgetClass; // 0x840
	TArray<UBravoHotelBuffBase*> StackBuffInfos; // 0x848
	TMap<EBuffEventType, FMulticastInlineDelegate> BuffEventDelegates; // 0x898
};

struct ABravoHotelBlueZone : AActor {
	UStaticMeshComponent* BlueZoneMesh; // 0x328
	UBravoHotelPainCausingComponent* PainCausingComponent; // 0x330
	APawn* TransportPawnClass; // 0x338
	int32_t CurrentPhase; // 0x340
	FVector OriginSurvivalCirclePos; // 0x344
	float OriginSurvivalCircleRadius; // 0x350
	FVector TargetSurvivalCirclePos; // 0x354
	float TargetSurvivalCircleRadius; // 0x360
	float TimeToStartShrinking; // 0x364
	float TimeToEndShrinking; // 0x368
	EBluseZoneState eState; // 0x36c
	bool IsVisibleTargetCircle; // 0x36d
	bool IsVisibleBlueZone; // 0x36e
	FVector CurrentSurvivalCirclePos; // 0x380
	float CurrentSurvivalCircleRadius; // 0x38c
	FMulticastInlineDelegate OnBlueZoneStateChanged; // 0x390
	FMulticastInlineDelegate OnSurvivalCirclePhaseChanged; // 0x3a0
	FMulticastInlineDelegate OnBlueZoneEnd; // 0x3b0
	float DefaultRadiusRate; // 0x3c0
	FBravoHotelGameData GameData; // 0x3c8
	bool SetVisibleBlueZone; // 0x6f0
	UBravoHotelWeightMapData* WeightMapInfo; // 0x708
	TArray<ABravoHotelCharacter*> InBlueZoneCharacters; // 0x748
	TArray<ABravoHotelCharacter*> OutBlueZoneCharacters; // 0x758
	FVector2D OuterCirclePos; // 0x7b8
	FName SelectedPlayZoneName; // 0x7c0
	int32_t SelectedPlayZoneInfoIndex; // 0x7c8
	TArray<FBattleRoyalPhaseInfo> ClientPlayZonePhaseList; // 0x7d0
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct ABP-MK3DSpectatorPawn_C : ABravoHotelMK3DSpectatorPawn {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d8
	UCameraComponent* FreeCam; // 0x3e0
	USpringArmComponent* SpringArm; // 0x3e8
	UUW-ReplayMainWidget_C* ReplayMainWidget; // 0x3f0
	EReplayViewMode ViewMode; // 0x3f8
};

struct UBTTask_PlayAnimation : UBTTaskNode {
	UAnimationAsset* AnimationToPlay; // 0x70
	char bLooping : 1; // 0x78
	char bNonBlocking : 1; // 0x78
	UBehaviorTreeComponent* MyOwnerComp; // 0x80
	USkeletalMeshComponent* CachedSkelMesh; // 0x88
};

struct UUW-ItemRecipeTreePopup_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UWidgetAnimation* Hide; // 0x250
	UWidgetAnimation* Show; // 0x258
	UImage* Bg; // 0x260
	UButton* Button_OK; // 0x268
	UImage* Image_168; // 0x270
	UImage* Image_669; // 0x278
	UTextBlock* Message; // 0x280
	UTextBlock* TextBlock_Title; // 0x288
	UUW-ItemRecipeTree_C* UW-ItemRecipeTree; // 0x290
	FTimerHandle Timer; // 0x298
};

struct USoundNodeRandom : USoundNode {
	TArray<float> Weights; // 0x48
	TArray<bool> HasBeenUsed; // 0x58
	int32_t NumRandomUsed; // 0x68
	int32_t PreselectAtLevelLoad; // 0x6c
	char bShouldExcludeFromBranchCulling : 1; // 0x70
	char bSoundCueExcludedFromBranchCulling : 1; // 0x70
	char bRandomizeWithoutReplacement : 1; // 0x70
};

struct UDataTable : UObject {
	UScriptStruct* RowStruct; // 0x28
	char bStripFromClientBuilds : 1; // 0x80
	char bIgnoreExtraFields : 1; // 0x80
	char bIgnoreMissingFields : 1; // 0x80
	FString ImportKeyField; // 0x88
};

struct UCineCameraComponent : UCameraComponent {
	FCameraFilmbackSettings FilmbackSettings; // 0x870
	FCameraFilmbackSettings Filmback; // 0x87c
	FCameraLensSettings LensSettings; // 0x888
	FCameraFocusSettings FocusSettings; // 0x8a0
	float CurrentFocalLength; // 0x8f8
	float CurrentAperture; // 0x8fc
	float CurrentFocusDistance; // 0x900
	TArray<FNamedFilmbackPreset> FilmbackPresets; // 0x910
	TArray<FNamedLensPreset> LensPresets; // 0x920
	FString DefaultFilmbackPresetName; // 0x930
	FString DefaultFilmbackPreset; // 0x940
	FString DefaultLensPresetName; // 0x950
	float DefaultLensFocalLength; // 0x960
	float DefaultLensFStop; // 0x964
};

struct UWeaponAttachmentComponent : UActorComponent {
	ABravoHotelRangedWeapon* OwningWeapon; // 0xb0
	UAsyncStaticMeshComponent* FrontSight; // 0xb8
	UAsyncStaticMeshComponent* Rail; // 0xc0
	UAsyncStaticMeshComponent* grip; // 0xc8
	UAsyncStaticMeshComponent* magazine; // 0xd0
	UAsyncStaticMeshComponent* ButtStock; // 0xd8
	UAsyncStaticMeshComponent* Tactical; // 0xe0
	UAsyncSkeletalMeshComponent* muzzledevice; // 0xe8
	UAsyncSkeletalMeshComponent* Barrel; // 0xf0
	bool bIsInitialized; // 0x258
	EWeaponAttachmentGrip GripType; // 0x259
	EWeaponAttachmentItem MagazineType; // 0x25a
	EWeaponAttachmentItem StockType; // 0x25b
	EWeaponAttachmentItem MuzzleType; // 0x25c
	EWeaponAttachmentItem BarrelType; // 0x25d
	TMap<EWeaponAttachmentItem, ABravoHotelSightAttachment*> FPSK_SightAttachmentList; // 0x2a0
	TMap<EWeaponAttachmentItem, ABravoHotelSightAttachment*> FPSK_SightClassList; // 0x2f0
};

struct UNiagaraDataInterfaceParticleRead : UNiagaraDataInterface {
	FString EmitterName; // 0x30
};

struct UBravoHotelWebSocket : UObject {
	UGameInstance* ParentGameInstance; // 0x28
};

struct UUW-ReplayEventMarker_Knockout_C : UUW-ReplayEventMarkerBasic_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2a0
	UBorder* VisualBorder; // 0x2a8
};

struct USimplygonColorCaster : USimplygonMaterialCaster {
	FColorCasterSettings ColorCasterSettings; // 0x28
};

struct UWeaponReplicatedComponent : UEquippableComponent {
	TArray<uint16_t> AttachmentIndices; // 0x170
};

struct UBravoHotelShellCasingArrowComponent : UClientArrowComponent {
	ABravoHotelShellCasing* ShellCasingClass; // 0x4c0
	float SpawnPowerMin; // 0x4c8
	float SpawnPowerMax; // 0x4cc
	float EjectAngleMin; // 0x4d0
	float EjectAngleMax; // 0x4d4
	float SpinAngleMin; // 0x4d8
	float SpinAngleMax; // 0x4dc
	bool bSpawnLastShotOnly; // 0x4e0
};

struct USubmixEffectReverbFastPreset : USoundEffectSubmixPreset {
	FSubmixEffectReverbFastSettings Settings; // 0xa0
};

struct UAkEventCallbackInfo : UAkCallbackInfo {
	int32_t PlayingID; // 0x30
	int32_t EventID; // 0x34
};

struct UUW-BlackMarket_Slot_Attachment_C : UUW-BlackMarket_Slot_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3d8
	UButton* BTN-Menu02; // 0x3e0
	UButton* BTN-Menu03; // 0x3e8
	UButton* BTN-Menu04; // 0x3f0
	UButton* BTN-Menu05; // 0x3f8
	UButton* BTN-Menu06; // 0x400
	UButton* BTN-Menu07; // 0x408
	UButton* BTN-Menu08; // 0x410
	UButton* BTN-Menu09; // 0x418
	UCanvasPanel* CP-SlotInfo; // 0x420
	UImage* IMG-BG; // 0x428
	UImage* IMG-BG-Border; // 0x430
	UImage* IMG-Item; // 0x438
	UImage* IMG-Mask; // 0x440
	UImage* IMG-Over; // 0x448
	UImage* IMG-Over-Border; // 0x450
	UOverlay* Menu02; // 0x458
	UOverlay* Menu03; // 0x460
	UOverlay* Menu04; // 0x468
	UOverlay* Menu05; // 0x470
	UOverlay* Menu06; // 0x478
	UOverlay* Menu07; // 0x480
	UOverlay* Menu08; // 0x488
	UOverlay* Menu09; // 0x490
	UOverlay* Overlay_Mask; // 0x498
	UTextBlock* TXT-ContinuousSpeed; // 0x4a0
	UTextBlock* TXT-Horizental; // 0x4a8
	UTextBlock* TXT-ItemName; // 0x4b0
	UTextBlock* TXT-Menu01; // 0x4b8
	UTextBlock* TXT-Menu02; // 0x4c0
	UTextBlock* TXT-Menu03; // 0x4c8
	UTextBlock* TXT-Menu04; // 0x4d0
	UTextBlock* TXT-Menu05; // 0x4d8
	UTextBlock* TXT-Menu06; // 0x4e0
	UTextBlock* TXT-Menu07; // 0x4e8
	UTextBlock* TXT-Menu08; // 0x4f0
	UTextBlock* TXT-Menu09; // 0x4f8
	UTextBlock* TXT-MovingSpeed; // 0x500
	UTextBlock* TXT-Reload; // 0x508
	UTextBlock* TXT-Type; // 0x510
	UTextBlock* TXT-Vertical; // 0x518
	UTextBlock* TXT-Weight; // 0x520
};

struct UUW-VoiceTalkSlot_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UButton* Button_1; // 0x250
	UImage* death; // 0x258
	UImage* Image_168; // 0x260
	UImage* Image_216; // 0x268
	UImage* Image_506; // 0x270
	UImage* Image_623; // 0x278
	UImage* Img_LogOut; // 0x280
	UImage* Img_Voice; // 0x288
	UImage* Img_Voice_2; // 0x290
	UOverlay* Overlay_Death; // 0x298
	USlider* Slider_139; // 0x2a0
	UTextBlock* T_PlayerIndex; // 0x2a8
	UTextBlock* T_PlayerName; // 0x2b0
	UTextBlock* TextBlock_209; // 0x2b8
	UVerticalBox* VerticalBox_1; // 0x2c0
	UWidgetSwitcher* WidgetSwitcher; // 0x2c8
	FMulticastInlineDelegate EventDispatcher_ChangeVolumeState; // 0x2d0
	FVoiceTalkState CurVoiceTalkState; // 0x2e0
	UPaperSprite* PingImage; // 0x300
};

struct UExpandableArea : UWidget {
	FExpandableAreaStyle Style; // 0x110
	FSlateBrush BorderBrush; // 0x230
	FSlateColor BorderColor; // 0x2b8
	bool bIsExpanded; // 0x2e0
	float MaxHeight; // 0x2e4
	FMargin HeaderPadding; // 0x2e8
	FMargin AreaPadding; // 0x2f8
	FMulticastInlineDelegate OnExpansionChanged; // 0x308
	UWidget* HeaderContent; // 0x318
	UWidget* BodyContent; // 0x320
};

struct UParticleModuleAttractorLine : UParticleModuleAttractorBase {
	FVector EndPoint0; // 0x30
	FVector EndPoint1; // 0x3c
	FRawDistributionFloat Range; // 0x48
	FRawDistributionFloat Strength; // 0x78
};

struct ABP-VehicleWaterPlane_C : AActor {
	UBoxComponent* Box; // 0x328
};

struct ULightComponent : ULightComponentBase {
	float Temperature; // 0x268
	float MaxDrawDistance; // 0x26c
	float MaxDistanceFadeRange; // 0x270
	char bUseTemperature : 1; // 0x274
	int32_t ShadowMapChannel; // 0x278
	float MinRoughness; // 0x280
	float SpecularScale; // 0x284
	float ShadowResolutionScale; // 0x288
	float ShadowBias; // 0x28c
	float ShadowSlopeBias; // 0x290
	float ShadowSharpen; // 0x294
	float ContactShadowLength; // 0x298
	char ContactShadowLengthInWS : 1; // 0x29c
	float ContactShadowStartDistance; // 0x2a0
	float ContactShadowFadeDistance; // 0x2a4
	float ShadowStrength; // 0x2a8
	float TranslucentShadowDensity; // 0x2ac
	char InverseSquaredFalloff : 1; // 0x2b0
	char CastTranslucentShadows : 1; // 0x2b0
	char bCastShadowsFromCinematicObjectsOnly : 1; // 0x2b0
	char bAffectDynamicIndirectLighting : 1; // 0x2b0
	char bForceCachedShadowsFromMovablePrimitivesAsStatic : 1; // 0x2b0
	char bForceCachedShadowsForMovablePrimitives : 1; // 0x2b0
	FLightingChannels LightingChannels; // 0x2b4
	UMaterialInterface* LightFunctionMaterial; // 0x2b8
	FVector LightFunctionScale; // 0x2c0
	UTextureLightProfile* IESTexture; // 0x2d0
	char bUseIESBrightness : 1; // 0x2d8
	float IESBrightnessScale; // 0x2dc
	float LightFunctionFadeDistance; // 0x2e0
	float DisabledBrightness; // 0x2e4
	char bEnableLightShaftBloom : 1; // 0x2e8
	float BloomScale; // 0x2ec
	float BloomThreshold; // 0x2f0
	float BloomMaxBrightness; // 0x2f4
	FColor BloomTint; // 0x2f8
	bool bUseFoliageLighting; // 0x2fc
	bool bUseRayTracedDistanceFieldShadows; // 0x2fd
	float RayStartOffsetDepthScale; // 0x300
};

struct UEnvQueryTest : UEnvQueryNode {
	int32_t TestOrder; // 0x30
	EEnvTestPurpose TestPurpose; // 0x34
	FString TestComment; // 0x38
	EEnvTestFilterOperator MultipleContextFilterOp; // 0x48
	EEnvTestScoreOperator MultipleContextScoreOp; // 0x49
	EEnvTestFilterType FilterType; // 0x4a
	FAIDataProviderBoolValue BoolValue; // 0x50
	FAIDataProviderFloatValue FloatValueMin; // 0x88
	FAIDataProviderFloatValue FloatValueMax; // 0xc0
	EEnvTestScoreEquation ScoringEquation; // 0xf9
	EEnvQueryTestClamping ClampMinType; // 0xfa
	EEnvQueryTestClamping ClampMaxType; // 0xfb
	EEQSNormalizationType NormalizationType; // 0xfc
	FAIDataProviderFloatValue ScoreClampMin; // 0x100
	FAIDataProviderFloatValue ScoreClampMax; // 0x138
	FAIDataProviderFloatValue ScoringFactor; // 0x170
	FAIDataProviderFloatValue ReferenceValue; // 0x1a8
	bool bDefineReferenceValue; // 0x1e0
	char bWorkOnFloatValues : 1; // 0x1f0
};

struct UWB_ClassicComboBoxItem_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x248
	UTextBlock* TextComboBoxItem; // 0x250
	UWB_ClassicComboBoxButton_C* WB_ClassicComboBoxButton; // 0x258
	FString ItemOption; // 0x260
	FSVideoResolution Resolution; // 0x270
};

struct UABP-DefaultMan_Native_C : UBravoHotelAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0xc70
	FAnimNode_Root AnimGraphNode_Root; // 0xc78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_119; // 0xca8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_118; // 0xcd0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_117; // 0xcf8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_116; // 0xd20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_115; // 0xd48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_114; // 0xd70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_113; // 0xd98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_112; // 0xdc0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_111; // 0xde8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_110; // 0xe10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_109; // 0xe38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_108; // 0xe60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_107; // 0xe88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_106; // 0xeb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105; // 0xed8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104; // 0xf00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103; // 0xf28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102; // 0xf50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101; // 0xf78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100; // 0xfa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99; // 0xfc8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98; // 0xff0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97; // 0x1018
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96; // 0x1040
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95; // 0x1068
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94; // 0x1090
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93; // 0x10b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92; // 0x10e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91; // 0x1108
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90; // 0x1130
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89; // 0x1158
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88; // 0x1180
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87; // 0x11a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86; // 0x11d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85; // 0x11f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84; // 0x1220
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83; // 0x1248
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82; // 0x1270
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_345; // 0x1298
	FAnimNode_StateResult AnimGraphNode_StateResult_61; // 0x1310
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81; // 0x1340
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_344; // 0x1368
	FAnimNode_StateResult AnimGraphNode_StateResult_60; // 0x13e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_343; // 0x1410
	FAnimNode_StateResult AnimGraphNode_StateResult_59; // 0x1488
	FAnimNode_StateMachine AnimGraphNode_StateMachine_19; // 0x14b8
	FAnimNode_StateResult AnimGraphNode_StateResult_58; // 0x1568
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80; // 0x1598
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79; // 0x15c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78; // 0x15e8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77; // 0x1610
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_342; // 0x1638
	FAnimNode_StateResult AnimGraphNode_StateResult_57; // 0x16b0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_116; // 0x16e0
	FAnimNode_StateResult AnimGraphNode_StateResult_56; // 0x17c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_341; // 0x17f0
	FAnimNode_StateResult AnimGraphNode_StateResult_55; // 0x1868
	FAnimNode_StateMachine AnimGraphNode_StateMachine_18; // 0x1898
	FAnimNode_StateResult AnimGraphNode_StateResult_54; // 0x1948
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76; // 0x1978
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75; // 0x19a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_340; // 0x19c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x1a40
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_69; // 0x1ae0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_115; // 0x1b90
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_114; // 0x1c70
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_97; // 0x1d50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_339; // 0x1e10
	FAnimNode_StateResult AnimGraphNode_StateResult_53; // 0x1e88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_338; // 0x1eb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x1f30
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_68; // 0x1fd0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_113; // 0x2080
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_112; // 0x2160
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_96; // 0x2240
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_337; // 0x2300
	FAnimNode_StateResult AnimGraphNode_StateResult_52; // 0x2378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_336; // 0x23a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x2420
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_67; // 0x24c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_111; // 0x2570
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_110; // 0x2650
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_95; // 0x2730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_335; // 0x27f0
	FAnimNode_StateResult AnimGraphNode_StateResult_51; // 0x2868
	FAnimNode_StateMachine AnimGraphNode_StateMachine_17; // 0x2898
	FAnimNode_StateResult AnimGraphNode_StateResult_50; // 0x2948
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74; // 0x2978
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73; // 0x29a0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72; // 0x29c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71; // 0x29f0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70; // 0x2a18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69; // 0x2a40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68; // 0x2a68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67; // 0x2a90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66; // 0x2ab8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x2ae0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_334; // 0x2b80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x2bf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_333; // 0x2c98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_94; // 0x2d10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_332; // 0x2dd0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_66; // 0x2e48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_331; // 0x2ef8
	FAnimNode_StateResult AnimGraphNode_StateResult_49; // 0x2f70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x2fa0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_330; // 0x3040
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_329; // 0x30b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_93; // 0x3130
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x31f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x3290
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_328; // 0x3330
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_327; // 0x33a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_326; // 0x3420
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_65; // 0x3498
	FAnimNode_StateResult AnimGraphNode_StateResult_48; // 0x3548
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_109; // 0x3578
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65; // 0x3658
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64; // 0x3680
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63; // 0x36a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62; // 0x36d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61; // 0x36f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60; // 0x3720
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_325; // 0x3748
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_24; // 0x37c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_324; // 0x3888
	FAnimNode_StateResult AnimGraphNode_StateResult_47; // 0x3900
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_23; // 0x3930
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_323; // 0x39f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_322; // 0x3a70
	FAnimNode_StateResult AnimGraphNode_StateResult_46; // 0x3ae8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_321; // 0x3b18
	FAnimNode_StateResult AnimGraphNode_StateResult_45; // 0x3b90
	FAnimNode_StateMachine AnimGraphNode_StateMachine_16; // 0x3bc0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x3c70
	FAnimNode_StateResult AnimGraphNode_StateResult_44; // 0x3d10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_320; // 0x3d40
	FAnimNode_StateResult AnimGraphNode_StateResult_43; // 0x3db8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_15; // 0x3de8
	FAnimNode_StateResult AnimGraphNode_StateResult_42; // 0x3e98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_319; // 0x3ec8
	FAnimNode_StateResult AnimGraphNode_StateResult_41; // 0x3f40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_318; // 0x3f70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x3fe8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_108; // 0x4088
	FAnimNode_StateResult AnimGraphNode_StateResult_40; // 0x4168
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59; // 0x4198
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_17; // 0x41c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_107; // 0x4288
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_106; // 0x4368
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0x4448
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_105; // 0x44e8
	FAnimNode_StateResult AnimGraphNode_StateResult_39; // 0x45c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58; // 0x45f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57; // 0x4620
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56; // 0x4648
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55; // 0x4670
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_104; // 0x4698
	FAnimNode_StateResult AnimGraphNode_StateResult_38; // 0x4778
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_103; // 0x47a8
	FAnimNode_StateResult AnimGraphNode_StateResult_37; // 0x4888
	FAnimNode_StateMachine AnimGraphNode_StateMachine_14; // 0x48b8
	FAnimNode_StateResult AnimGraphNode_StateResult_36; // 0x4968
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54; // 0x4998
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53; // 0x49c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_317; // 0x49e8
	FAnimNode_StateResult AnimGraphNode_StateResult_35; // 0x4a60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_316; // 0x4a90
	FAnimNode_StateResult AnimGraphNode_StateResult_34; // 0x4b08
	FAnimNode_StateMachine AnimGraphNode_StateMachine_13; // 0x4b38
	FAnimNode_StateResult AnimGraphNode_StateResult_33; // 0x4be8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x4c18
	FAnimNode_StateResult AnimGraphNode_StateResult_32; // 0x4cc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_315; // 0x4cf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_314; // 0x4d70
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_92; // 0x4de8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_313; // 0x4ea8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_312; // 0x4f20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_311; // 0x4f98
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_64; // 0x5010
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_310; // 0x50c0
	FAnimNode_StateResult AnimGraphNode_StateResult_31; // 0x5138
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_309; // 0x5168
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_91; // 0x51e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_308; // 0x52a0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_90; // 0x5318
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_307; // 0x53d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_306; // 0x5450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_305; // 0x54c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_89; // 0x5540
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x5600
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_304; // 0x5648
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_303; // 0x56c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_302; // 0x5738
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_301; // 0x57b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_63; // 0x5828
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_300; // 0x58d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_299; // 0x5950
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_298; // 0x59c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0x5a40
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x5ae0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0x5b28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_297; // 0x5bc8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_88; // 0x5c40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_296; // 0x5d00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_295; // 0x5d78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_294; // 0x5df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_293; // 0x5e68
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_87; // 0x5ee0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0x5fa0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x6040
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x6088
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x60d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_62; // 0x6118
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_292; // 0x61c8
	FAnimNode_Slot AnimGraphNode_Slot_35; // 0x6240
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_291; // 0x6288
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_86; // 0x6300
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0x63c0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_61; // 0x6460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_290; // 0x6510
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0x6588
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_102; // 0x6628
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_16; // 0x6708
	FAnimNode_StateResult AnimGraphNode_StateResult_30; // 0x67d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52; // 0x6800
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_60; // 0x6828
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_59; // 0x68d8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x6988
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x69b0
	FAnimNode_Slot AnimGraphNode_Slot_34; // 0x69c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_85; // 0x6a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_289; // 0x6ad0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0x6b48
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_22; // 0x6be8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_288; // 0x6cb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_287; // 0x6d28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_286; // 0x6da0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_84; // 0x6e18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_285; // 0x6ed8
	FAnimNode_StateResult AnimGraphNode_StateResult_29; // 0x6f50
	FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x6f80
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x7030
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_83; // 0x70e8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_9; // 0x71a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0x7330
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x73d0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x7558
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x7578
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x7598
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x76a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_58; // 0x7828
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0x78d8
	FAnimNode_Slot AnimGraphNode_Slot_33; // 0x7978
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0x79c0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x7a60
	FAnimNode_Slot AnimGraphNode_Slot_32; // 0x7b18
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x7b60
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x7c18
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x7cd0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x7cf8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x7d20
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x7d48
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_82; // 0x7d70
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x7e30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0x7e58
	FAnimNode_Slot AnimGraphNode_Slot_31; // 0x7ef8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x7f40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x7f68
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x7f90
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x8118
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0x8140
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0x81e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_81; // 0x8280
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x8340
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x8368
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x84f0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0x8518
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0x86a0
	FAnimNode_Slot AnimGraphNode_Slot_30; // 0x8740
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_80; // 0x8788
	FAnimNode_Slot AnimGraphNode_Slot_29; // 0x8848
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0x8890
	FAnimNode_Slot AnimGraphNode_Slot_28; // 0x8930
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_79; // 0x8978
	FAnimNode_Slot AnimGraphNode_Slot_27; // 0x8a38
	FAnimNode_Slot AnimGraphNode_Slot_26; // 0x8a80
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x8ac8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_15; // 0x8af0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_284; // 0x8bb8
	FAnimNode_Slot AnimGraphNode_Slot_25; // 0x8c30
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_14; // 0x8c78
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x8d40
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0x8ec8
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x8f68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x90f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_78; // 0x9118
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_77; // 0x91d8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x9298
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x9350
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x9378
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x93a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0x93c8
	FAnimNode_Slot AnimGraphNode_Slot_24; // 0x9468
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_101; // 0x94b0
	FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x9590
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x95d8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x95f8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x9700
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0x9720
	FAnimNode_RefPose AnimGraphNode_IdentityPose_7; // 0x97c0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_76; // 0x97d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_283; // 0x9898
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_75; // 0x9910
	FAnimNode_RefPose AnimGraphNode_IdentityPose_6; // 0x99d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_282; // 0x99e8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_74; // 0x9a60
	FAnimNode_RefPose AnimGraphNode_IdentityPose_5; // 0x9b20
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_57; // 0x9b38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_281; // 0x9be8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_73; // 0x9c60
	FAnimNode_RefPose AnimGraphNode_IdentityPose_4; // 0x9d20
	FAnimNode_StateResult AnimGraphNode_StateResult_28; // 0x9d38
	FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x9d68
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x9e18
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_13; // 0x9ed0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x9f98
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x9fc0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0xa078
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0xa0a0
	FAnimNode_Slot AnimGraphNode_Slot_23; // 0xa140
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_280; // 0xa188
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0xa200
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0xa2a0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_279; // 0xa340
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xa3b8
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xa3d8
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xa4e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0xa500
	FAnimNode_Slot AnimGraphNode_Slot_22; // 0xa5a0
	FAnimNode_Slot AnimGraphNode_Slot_21; // 0xa5e8
	FAnimNode_Slot AnimGraphNode_Slot_20; // 0xa630
	FAnimNode_RefPose AnimGraphNode_IdentityPose_3; // 0xa678
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_278; // 0xa690
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0xa708
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0xa7a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_277; // 0xa848
	FAnimNode_StateResult AnimGraphNode_StateResult_27; // 0xa8c0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0xa8f0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0xa9a0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0xaa58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0xaa80
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0xaaa8
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_21; // 0xab48
	FAnimNode_Slot AnimGraphNode_Slot_19; // 0xac10
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0xac58
	FAnimNode_Slot AnimGraphNode_Slot_18; // 0xacf8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_72; // 0xad40
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0xae00
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0xae28
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0xae50
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0xaf08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0xaf30
	FAnimNode_Slot AnimGraphNode_Slot_17; // 0xaf58
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_71; // 0xafa0
	FAnimNode_Slot AnimGraphNode_Slot_16; // 0xb060
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0xb0a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_276; // 0xb0d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_275; // 0xb148
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_20; // 0xb1c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_274; // 0xb260
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_273; // 0xb2d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_272; // 0xb350
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_19; // 0xb3c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_271; // 0xb468
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_270; // 0xb4e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_269; // 0xb558
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_18; // 0xb5d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_268; // 0xb670
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_267; // 0xb6e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_266; // 0xb760
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_17; // 0xb7d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_265; // 0xb878
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0xb8f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0xb990
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0xba30
	FAnimNode_StateResult AnimGraphNode_StateResult_26; // 0xbad0
	FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0xbb00
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0xbbb0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_12; // 0xbc68
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0xbd30
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0xbd58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_264; // 0xbdf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_263; // 0xbe70
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_262; // 0xbee8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_261; // 0xbf60
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_56; // 0xbfd8
	FAnimNode_StateResult AnimGraphNode_StateResult_25; // 0xc088
	FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0xc0b8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0xc168
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_70; // 0xc220
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0xc2e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0xc308
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0xc3a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_260; // 0xc448
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_259; // 0xc4c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0xc538
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_258; // 0xc5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_257; // 0xc650
	FAnimNode_StateResult AnimGraphNode_StateResult_24; // 0xc6c8
	FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0xc6f8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0xc7a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0xc860
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0xc900
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0xc9a0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0xc9c8
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0xca80
	FAnimNode_Slot AnimGraphNode_Slot_15; // 0xcaa8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_69; // 0xcaf0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0xcbb0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_11; // 0xcbe0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_10; // 0xcdc0
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0xcfa0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0xcfc0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0xcfe0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0xd098
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0xd0c0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9; // 0xd0f0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8; // 0xd2d0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7; // 0xd4b0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6; // 0xd690
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0xd870
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0xd890
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5; // 0xd8b0
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4; // 0xda90
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3; // 0xdc70
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0xde50
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xe030
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xe050
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0xe070
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0xe098
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0xe0c0
	FAnimNode_Slot AnimGraphNode_Slot_14; // 0xe0e8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_55; // 0xe130
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0xe1e0
	FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0xe280
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0xe408
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_256; // 0xe430
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0xe4a8
	FAnimNode_Slot AnimGraphNode_Slot_13; // 0xe548
	FAnimNode_Slot AnimGraphNode_Slot_12; // 0xe590
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0xe5d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_255; // 0xe678
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_254; // 0xe6f0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0xe768
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_68; // 0xe808
	FAnimNode_Slot AnimGraphNode_Slot_11; // 0xe8c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0xe910
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_67; // 0xe9b0
	FAnimNode_Slot AnimGraphNode_Slot_10; // 0xea70
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0xeab8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_11; // 0xeb58
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0xec20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51; // 0xec48
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50; // 0xec70
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49; // 0xec98
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48; // 0xecc0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47; // 0xece8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46; // 0xed10
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45; // 0xed38
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44; // 0xed60
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43; // 0xed88
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42; // 0xedb0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41; // 0xedd8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40; // 0xee00
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39; // 0xee28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38; // 0xee50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37; // 0xee78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36; // 0xeea0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35; // 0xeec8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34; // 0xeef0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33; // 0xef18
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32; // 0xef40
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31; // 0xef68
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30; // 0xef90
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0xefb8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0xefe0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0xf008
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0xf030
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_253; // 0xf058
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_252; // 0xf0d0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_20; // 0xf148
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_66; // 0xf210
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_100; // 0xf2d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_251; // 0xf3b0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_65; // 0xf428
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_99; // 0xf4e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_250; // 0xf5c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_249; // 0xf640
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_248; // 0xf6b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_247; // 0xf730
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_246; // 0xf7a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_245; // 0xf820
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_244; // 0xf898
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_243; // 0xf910
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_19; // 0xf988
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_242; // 0xfa50
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_64; // 0xfac8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_98; // 0xfb88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_241; // 0xfc68
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_63; // 0xfce0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_97; // 0xfda0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0xfe80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_240; // 0xff20
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_18; // 0xff98
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_96; // 0x10060
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_239; // 0x10140
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_17; // 0x101b8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_95; // 0x10280
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_16; // 0x10360
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_238; // 0x10428
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_237; // 0x104a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15; // 0x10518
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_236; // 0x105e0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14; // 0x10658
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_235; // 0x10720
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13; // 0x10798
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_234; // 0x10860
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12; // 0x108d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_233; // 0x109a0
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11; // 0x10a18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_94; // 0x10ae0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_93; // 0x10bc0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_62; // 0x10ca0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_92; // 0x10d60
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_54; // 0x10e40
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_91; // 0x10ef0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_90; // 0x10fd0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_89; // 0x110b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_53; // 0x11190
	FAnimNode_RefPose AnimGraphNode_IdentityPose_2; // 0x11240
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0x11258
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_52; // 0x11320
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_61; // 0x113d0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_51; // 0x11490
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_60; // 0x11540
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_88; // 0x11600
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_50; // 0x116e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_87; // 0x11790
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_86; // 0x11870
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_85; // 0x11950
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_84; // 0x11a30
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_83; // 0x11b10
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0x11bf0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0x11cb8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x11d80
	FAnimNode_StateResult AnimGraphNode_StateResult_23; // 0x11e20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_232; // 0x11e50
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_59; // 0x11ec8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_231; // 0x11f88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_230; // 0x12000
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_229; // 0x12078
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_228; // 0x120f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_58; // 0x12168
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_57; // 0x12228
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_227; // 0x122e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_226; // 0x12360
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_225; // 0x123d8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_49; // 0x12450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_224; // 0x12500
	FAnimNode_StateResult AnimGraphNode_StateResult_22; // 0x12578
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_223; // 0x125a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_222; // 0x12620
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_56; // 0x12698
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_221; // 0x12758
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_55; // 0x127d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_220; // 0x12890
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_219; // 0x12908
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_218; // 0x12980
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_48; // 0x129f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_217; // 0x12aa8
	FAnimNode_StateResult AnimGraphNode_StateResult_21; // 0x12b20
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_216; // 0x12b50
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_54; // 0x12bc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_215; // 0x12c88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_214; // 0x12d00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_213; // 0x12d78
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_53; // 0x12df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_212; // 0x12eb0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_52; // 0x12f28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_211; // 0x12fe8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_210; // 0x13060
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_209; // 0x130d8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_47; // 0x13150
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_208; // 0x13200
	FAnimNode_StateResult AnimGraphNode_StateResult_20; // 0x13278
	FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x132a8
	FAnimNode_StateResult AnimGraphNode_StateResult_19; // 0x13358
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_51; // 0x13388
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_207; // 0x13448
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_206; // 0x134c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_205; // 0x13538
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_204; // 0x135b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_203; // 0x13628
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_50; // 0x136a0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_49; // 0x13760
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_202; // 0x13820
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_201; // 0x13898
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_46; // 0x13910
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_200; // 0x139c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_199; // 0x13a38
	FAnimNode_StateResult AnimGraphNode_StateResult_18; // 0x13ab0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_48; // 0x13ae0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_198; // 0x13ba0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_197; // 0x13c18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_196; // 0x13c90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_195; // 0x13d08
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_47; // 0x13d80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_194; // 0x13e40
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_46; // 0x13eb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_193; // 0x13f78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_192; // 0x13ff0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_45; // 0x14068
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_191; // 0x14118
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_190; // 0x14190
	FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x14208
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_189; // 0x14238
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_45; // 0x142b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_188; // 0x14370
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_187; // 0x143e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_186; // 0x14460
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_185; // 0x144d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_184; // 0x14550
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_183; // 0x145c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_182; // 0x14640
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_181; // 0x146b8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_44; // 0x14730
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_43; // 0x147f0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_44; // 0x148b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_43; // 0x14960
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_180; // 0x14a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_179; // 0x14a88
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_42; // 0x14b00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_178; // 0x14bb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_177; // 0x14c28
	FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x14ca0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_176; // 0x14cd0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_42; // 0x14d48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_175; // 0x14e08
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_41; // 0x14e80
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_174; // 0x14f40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_173; // 0x14fb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_172; // 0x15030
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_171; // 0x150a8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_170; // 0x15120
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_169; // 0x15198
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_168; // 0x15210
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_167; // 0x15288
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_166; // 0x15300
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_40; // 0x15378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_165; // 0x15438
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_39; // 0x154b0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_41; // 0x15570
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_40; // 0x15620
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_38; // 0x156d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_164; // 0x15790
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_163; // 0x15808
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_162; // 0x15880
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_39; // 0x158f8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_161; // 0x159a8
	FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x15a20
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x15a50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x15a78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x15aa0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x15ac8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x15af0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x15b18
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_82; // 0x15bb8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_81; // 0x15c98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_160; // 0x15d78
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_37; // 0x15df0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_159; // 0x15eb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_158; // 0x15f28
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_36; // 0x15fa0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x16060
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_80; // 0x16100
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_79; // 0x161e0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_35; // 0x162c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x16380
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_78; // 0x16420
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_77; // 0x16500
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_38; // 0x165e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x16690
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_76; // 0x16730
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_75; // 0x16810
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x168f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_74; // 0x16990
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_73; // 0x16a70
	FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x16b50
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x16b80
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_72; // 0x16c20
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_71; // 0x16d00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_157; // 0x16de0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_156; // 0x16e58
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_34; // 0x16ed0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_70; // 0x16f90
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_33; // 0x17070
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_69; // 0x17130
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_68; // 0x17210
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_37; // 0x172f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_67; // 0x173a0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_66; // 0x17480
	FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x17560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_155; // 0x17590
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_154; // 0x17608
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_153; // 0x17680
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x176f8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x17718
	FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x17740
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_152; // 0x17920
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_151; // 0x17998
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_32; // 0x17a10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_150; // 0x17ad0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_31; // 0x17b48
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_149; // 0x17c08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_148; // 0x17c80
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_16; // 0x17cf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_147; // 0x17d98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_146; // 0x17e10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_145; // 0x17e88
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_36; // 0x17f00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_144; // 0x17fb0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x18028
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_143; // 0x180c8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x18140
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_142; // 0x181e0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x18258
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_141; // 0x182f8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x18370
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_140; // 0x18410
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_139; // 0x18488
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_138; // 0x18500
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_137; // 0x18578
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_15; // 0x185f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_136; // 0x18690
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_135; // 0x18708
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_14; // 0x18780
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_134; // 0x18820
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_133; // 0x18898
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_13; // 0x18910
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_35; // 0x189b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_132; // 0x18a60
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_131; // 0x18ad8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_130; // 0x18b50
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_34; // 0x18bc8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_129; // 0x18c78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_128; // 0x18cf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x18d68
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_33; // 0x18e08
	FAnimNode_Slot AnimGraphNode_Slot_9; // 0x18eb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_127; // 0x18f00
	FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x18f78
	FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x18fa8
	FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x19058
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x19088
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x190b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x190d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x19100
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x19128
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_126; // 0x19150
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_65; // 0x191c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_64; // 0x192a8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x19388
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_30; // 0x19428
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_125; // 0x194e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_124; // 0x19560
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_123; // 0x195d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_122; // 0x19650
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_121; // 0x196c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_120; // 0x19740
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_119; // 0x197b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_118; // 0x19830
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_29; // 0x198a8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_63; // 0x19968
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_62; // 0x19a48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x19b28
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_32; // 0x19bc8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_31; // 0x19c78
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_28; // 0x19d28
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_30; // 0x19de8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_61; // 0x19e98
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_60; // 0x19f78
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1a058
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_59; // 0x1a0f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_58; // 0x1a1d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x1a2b8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_29; // 0x1a358
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_57; // 0x1a408
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_56; // 0x1a4e8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1a5c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_55; // 0x1a668
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_54; // 0x1a748
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x1a828
	FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1a8c8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_53; // 0x1a8f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_52; // 0x1a9d8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x1aab8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_117; // 0x1ab58
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_27; // 0x1abd0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_51; // 0x1ac90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_116; // 0x1ad70
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x1ade8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_28; // 0x1aea8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_50; // 0x1af58
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_49; // 0x1b038
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_115; // 0x1b118
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_114; // 0x1b190
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_113; // 0x1b208
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_112; // 0x1b280
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_111; // 0x1b2f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_48; // 0x1b370
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1b450
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_110; // 0x1b4f0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x1b568
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_47; // 0x1b628
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_109; // 0x1b708
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x1b780
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_27; // 0x1b840
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_46; // 0x1b8f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_45; // 0x1b9d0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x1bab0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x1bb70
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_26; // 0x1bc30
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_25; // 0x1bce0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_24; // 0x1bd90
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_23; // 0x1be40
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x1bef0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_44; // 0x1bfb0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_43; // 0x1c090
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_42; // 0x1c170
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_22; // 0x1c250
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_41; // 0x1c300
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_21; // 0x1c3e0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_40; // 0x1c490
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_39; // 0x1c570
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_38; // 0x1c650
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37; // 0x1c730
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36; // 0x1c810
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35; // 0x1c8f0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34; // 0x1c9d0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33; // 0x1cab0
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0x1cb90
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0x1cc58
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x1cd20
	FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1cdc0
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0x1cdf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108; // 0x1ce38
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107; // 0x1ceb0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106; // 0x1cf28
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_12; // 0x1cfa0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105; // 0x1d040
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x1d0b8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104; // 0x1d178
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103; // 0x1d1f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102; // 0x1d268
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1d2e0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101; // 0x1d380
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100; // 0x1d3f8
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_11; // 0x1d470
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99; // 0x1d510
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98; // 0x1d588
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x1d600
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97; // 0x1d6c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96; // 0x1d738
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_10; // 0x1d7b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95; // 0x1d850
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x1d8c8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94; // 0x1d988
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93; // 0x1da00
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_20; // 0x1da78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92; // 0x1db28
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91; // 0x1dba0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90; // 0x1dc18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89; // 0x1dc90
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88; // 0x1dd08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87; // 0x1dd80
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_9; // 0x1ddf8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86; // 0x1de98
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85; // 0x1df10
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84; // 0x1df88
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_8; // 0x1e000
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_7; // 0x1e0a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_19; // 0x1e140
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_18; // 0x1e1f0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83; // 0x1e2a0
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0x1e318
	FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1e360
	FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1e390
	FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1e440
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0x1e470
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x1e4b8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x1e4e0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x1e508
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x1e530
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x1e558
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1e580
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1e5a8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1e5d0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x1e5f8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1e620
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1e648
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1e670
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1e698
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1e6c0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1e6e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82; // 0x1e710
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x1e788
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81; // 0x1e848
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80; // 0x1e8c0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1e938
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79; // 0x1e9d8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78; // 0x1ea50
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77; // 0x1eac8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76; // 0x1eb40
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75; // 0x1ebb8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74; // 0x1ec30
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_17; // 0x1eca8
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1ed58
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73; // 0x1ed88
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x1ee00
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x1ee78
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x1eef0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x1ef68
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x1efe0
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1f090
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x1f0c0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x1f138
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1f1f8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32; // 0x1f298
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31; // 0x1f378
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x1f458
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x1f4d0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x1f548
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x1f5c0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x1f638
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x1f6b0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x1f728
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x1f7a0
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x1f818
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x1f8d8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30; // 0x1f978
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29; // 0x1fa58
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x1fb38
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x1fbe8
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x1fc98
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x1fd48
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1fe08
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28; // 0x1fea8
