// Created by BlueFire1337
// Updated 2021-10-25
// Generated 2022-02-02

namespace off {
	constexpr auto GNames = 0x5cc74c0;
	constexpr auto GObjects = 0x5cdfca8;
	constexpr auto GWorld = 0x5e16a80;
}

struct UMovieSceneSpawnTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
	FGuid ObjectGuid; // 0x88
};

struct UFoliageType_Actor : UFoliageType {
	AActor* ActorClass; // 0x3a8
	bool bShouldAttachToBaseComponent; // 0x3b0
};

struct UAISense_Damage : UAISense {
	TArray<FAIDamageEvent> RegisteredEvents; // 0x80
};

struct UMaterialExpressionBentNormalCustomOutput : UMaterialExpressionCustomOutput {
	FExpressionInput Input; // 0x40
};

struct UOpenBugReporterCommand_BP_C : UYNavigationCommand {
	FPointerToUberGraphFrame UberGraphFrame; // 0x28
};

struct UBreakpoint : UObject {
	char bEnabled : 1; // 0x28
	UEdGraphNode* Node; // 0x30
	char bStepOnce : 1; // 0x38
	char bStepOnce_WasPreviouslyDisabled : 1; // 0x38
	char bStepOnce_RemoveAfterHit : 1; // 0x38
};

struct UYWidget_ModalDialogOKCancelItem : UYWidget_ModalDialogOkCancel {
	UYWidget_ItemContainer* m_itemWidget; // 0x338
};

struct UYHealthComponent : UYResourceComponent {
	FMulticastInlineDelegate HealthDataChangedDelegate; // 0xd0
	FMulticastInlineDelegate CurrentHealthChangedDelegate; // 0xe0
	FMulticastInlineDelegate HealthEmptyDelegate; // 0xf0
	FMulticastInlineDelegate DebugDiedInImmortalMode; // 0x100
	bool m_immortalmodeActivated; // 0x110
	FYActorPlateWidgetCreationData m_plateWidgetData; // 0x118
	bool m_canDieByDamageOverTime; // 0x1a8
	FDataTableRowHandle m_healthData; // 0x1b0
	float m_currentHealth; // 0x1c0
	AActor* m_healthChangeInstigator; // 0x1c8
	float m_timstampServerTakenRegenRelevantDamage; // 0x1e8
	UYGameplayAttributesComponent* m_gameplayAttributeComponent; // 0x1f0
};

struct UPaperGroupedSpriteComponent : UMeshComponent {
	TArray<UMaterialInterface*> InstanceMaterials; // 0x468
	TArray<FSpriteInstanceData> PerInstanceSpriteData; // 0x478
};

struct UTimeSynthVolumeGroup : UObject {
	float DefaultVolume; // 0x28
};

struct UPendingNetGame : UObject {
	UNetDriver* NetDriver; // 0x30
	UDemoNetDriver* DemoNetDriver; // 0x38
};

struct UTextRenderComponent : UPrimitiveComponent {
	FText Text; // 0x440
	UMaterialInterface* TextMaterial; // 0x458
	UFont* Font; // 0x460
	EHorizTextAligment HorizontalAlignment; // 0x468
	EVerticalTextAligment VerticalAlignment; // 0x469
	FColor TextRenderColor; // 0x46c
	float XScale; // 0x470
	float YScale; // 0x474
	float WorldSize; // 0x478
	float InvDefaultSize; // 0x47c
	float HorizSpacingAdjust; // 0x480
	float VertSpacingAdjust; // 0x484
	char bAlwaysRenderAsText : 1; // 0x488
};

struct UDLSSSettings : UObject {
	bool bEnableDLSSD3D12; // 0x28
	bool bEnableDLSSD3D11; // 0x29
	bool bEnableDLSSVulkan; // 0x2a
	bool bEnableDLSSInEditorViewports; // 0x2b
	bool bEnableScreenpercentageManipulationInDLSSEditorViewports; // 0x2c
	bool bEnableDLSSInPlayInEditorViewports; // 0x2d
	bool bShowDLSSSDebugOnScreenMessages; // 0x2e
	FString GenericDLSSBinaryPath; // 0x30
	bool bGenericDLSSBinaryExists; // 0x40
	uint32_t NVIDIANGXApplicationId; // 0x44
	FString CustomDLSSBinaryPath; // 0x48
	bool bCustomDLSSBinaryExists; // 0x58
};

struct UYAnalyticsSender : UObject {
	FString m_url; // 0x50
};

struct UCheckGeoTrackingAvailabilityAsyncTaskBlueprintProxy : UARBaseAsyncTaskBlueprintProxy {
	FMulticastInlineDelegate onSuccess; // 0x50
	FMulticastInlineDelegate OnFailed; // 0x60
};

struct AYGameState_Login_BP_C : AYGameState_Station {
	USceneComponent* DefaultSceneRoot; // 0x328
};

struct UParticleModuleSizeMultiplyLife : UParticleModuleSizeBase {
	FRawDistributionVector LifeMultiplier; // 0x30
	char MultiplyX : 1; // 0x78
	char MultiplyY : 1; // 0x78
	char MultiplyZ : 1; // 0x78
};

struct UAnimSequence : UAnimSequenceBase {
	int32_t NumFrames; // 0xa8
	TArray<FTrackToSkeletonMap> TrackToSkeletonMapTable; // 0xb0
	UAnimBoneCompressionSettings* BoneCompressionSettings; // 0xd0
	UAnimCurveCompressionSettings* CurveCompressionSettings; // 0xd8
	EAdditiveAnimationType AdditiveAnimType; // 0x150
	EAdditiveBasePoseType RefPoseType; // 0x151
	UAnimSequence* RefPoseSeq; // 0x158
	int32_t RefFrameIndex; // 0x160
	FName RetargetSource; // 0x164
	EAnimInterpolationType Interpolation; // 0x16c
	bool bEnableRootMotion; // 0x16d
	ERootMotionRootLock RootMotionRootLock; // 0x16e
	bool bForceRootLock; // 0x16f
	bool bUseNormalizedRootMotionScale; // 0x170
	bool bRootMotionSettingsCopiedFromMontage; // 0x171
	TArray<FAnimSyncMarker> AuthoredSyncMarkers; // 0x178
	TArray<FBakedCustomAttributePerBoneData> BakedPerBoneCustomAttributeData; // 0x1a0
};

struct UInterpTrackEvent : UInterpTrack {
	TArray<FEventTrackKey> EventTrack; // 0x70
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	char bFireEventsWhenJumpingForwards : 1; // 0x80
	char bUseCustomEventName : 1; // 0x80
};

struct UAnimSharingAdditiveInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> BaseComponent; // 0x2b8
	TWeakObjectPtr<UAnimSequence> AdditiveAnimation; // 0x2c0
	float Alpha; // 0x2c8
	bool bStateBool; // 0x2cc
};

struct UYTutorialComponent_BP_C : UYPlayerTutorialComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UWBP_Tutorial_Menu_C* TutorialMenu; // 0xb8
	APRO_PlayerController_C* OwningController; // 0xc0
	UYWidgetProvider_Missions* WidgetProvider_Missions; // 0xc8
	int32_t MissionStepID; // 0xd0
	TArray<FDataTableRowHandle> contracts; // 0xd8
	FDataTableRowHandle VOTutorial1; // 0xe8
	FDataTableRowHandle VOTutorial2; // 0xf8
	UYTutorialStepsPlayerComponent_BP_C* TutorialStepsComponent; // 0x108
};

struct UYIdleDetectionComponent_BP_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	FVector WorldLocation_Previous; // 0xb8
	bool IsInStation; // 0xc4
	float matchMaxIdleTime; // 0xc8
	float stationMaxIdleTime; // 0xcc
	int32_t TimesCheckedDuringWarning; // 0xd0
	FTimerHandle TH_ShowKickWarning; // 0xd8
	FMulticastInlineDelegate ShowIdleKickWarning; // 0xe0
	FMulticastInlineDelegate HideIdleKickWarning; // 0xf0
	APRO_PlayerCharacter_C* Character; // 0x100
};

struct UEditableTextBox : UWidget {
	FText Text; // 0x108
	FDelegate TextDelegate; // 0x120
	FEditableTextBoxStyle WidgetStyle; // 0x130
	USlateWidgetStyleAsset* Style; // 0x928
	FText HintText; // 0x930
	FDelegate HintTextDelegate; // 0x948
	FSlateFontInfo Font; // 0x958
	FLinearColor ForegroundColor; // 0x9b0
	FLinearColor BackgroundColor; // 0x9c0
	FLinearColor ReadOnlyForegroundColor; // 0x9d0
	bool IsReadOnly; // 0x9e0
	bool IsPassword; // 0x9e1
	float MinimumDesiredWidth; // 0x9e4
	FMargin Padding; // 0x9e8
	bool IsCaretMovedWhenGainFocus; // 0x9f8
	bool SelectAllTextWhenFocused; // 0x9f9
	bool RevertTextOnEscape; // 0x9fa
	bool ClearKeyboardFocusOnCommit; // 0x9fb
	bool SelectAllTextOnCommit; // 0x9fc
	bool AllowContextMenu; // 0x9fd
	EVirtualKeyboardType KeyboardType; // 0x9fe
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x9ff
	EVirtualKeyboardTrigger VirtualKeyboardTrigger; // 0xa00
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0xa01
	ETextJustify Justification; // 0xa02
	FShapedTextOptions ShapedTextOptions; // 0xa03
	FMulticastInlineDelegate OnTextChanged; // 0xa08
	FMulticastInlineDelegate OnTextCommitted; // 0xa18
};

struct APaperCharacter : ACharacter {
	UPaperFlipbookComponent* Sprite; // 0x4e0
};

struct UMaterialExpressionNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	FExpressionInput FilterWidth; // 0x54
	float Scale; // 0x68
	int32_t Quality; // 0x6c
	ENoiseFunction NoiseFunction; // 0x70
	char bTurbulence : 1; // 0x74
	int32_t Levels; // 0x78
	float OutputMin; // 0x7c
	float OutputMax; // 0x80
	float LevelScale; // 0x84
	char bTiling : 1; // 0x88
	uint32_t RepeatSize; // 0x8c
};

struct UAISenseConfig_Damage : UAISenseConfig {
	UAISense_Damage* Implementation; // 0x48
};

struct UAnimSharingTransitionInstance : UAnimInstance {
	TWeakObjectPtr<USkeletalMeshComponent> FromComponent; // 0x2b8
	TWeakObjectPtr<USkeletalMeshComponent> ToComponent; // 0x2c0
	float BlendTime; // 0x2c8
	bool bBlendBool; // 0x2cc
};

struct UMapMarker_SurveillanceBubble_WBP_C : UYWidget_AreaMapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f8
	UImage* m_offscreenArrow; // 0x300
	UCanvasPanel* WidgetContainer; // 0x308
	float areaWidgetScale; // 0x310
	FVector2D MapWorldBounds; // 0x314
	FVector2D MapPixelSize; // 0x31c
	float SurveillanceRadius; // 0x324
};

struct UMaterialExpressionFloor : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UTestScreen2 : UTestState2 {
	TSoftClassPtr<UObject> m_widgetBp; // 0x58
};

struct UParticleModuleMeshRotationRateOverLife : UParticleModuleRotationRateBase {
	FRawDistributionVector RotRate; // 0x30
	char bScaleRotRate : 1; // 0x78
};

struct UControlRigGizmoLibrary : UObject {
	FControlRigGizmoDefinition DefaultGizmo; // 0x30
	TSoftObjectPtr<UMaterial> DefaultMaterial; // 0x90
	FName MaterialColorParameter; // 0xb8
	TArray<FControlRigGizmoDefinition> Gizmos; // 0xc0
};

struct UPlayFabGroupsAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0x218
	UPlayFabJsonObject* RequestJsonObj; // 0x220
	UPlayFabJsonObject* ResponseJsonObj; // 0x228
};

struct UYWidget_SetItemActiveSetView : UYWidget {
	UYWidget_SetItem* m_pistolSlot; // 0x2c0
	UYWidget_SetItem* m_kitSlot; // 0x2c8
	UYWidget_SetItem* m_weaponOneSlot; // 0x2d0
	UYWidget_SetItem* m_weaponTwoSlot; // 0x2d8
	UYWidget_SetItem* m_toolOneSlot; // 0x2e0
	UYWidget_SetItem* m_toolTwoSlot; // 0x2e8
	UYWidget_SetItem* m_abilityOneSlot; // 0x2f0
	UYWidget_SetItem* m_abilityTwoSlot; // 0x2f8
	UYWidget_SetItem* m_bagSlot; // 0x300
	UYWidget_SetItem* m_helmetSlot; // 0x308
	UYWidget_ItemContainer* m_selectedItem; // 0x310
	FMulticastInlineDelegate OnInventoryItemClickedDelegate; // 0x318
	FMulticastInlineDelegate OnInventoryItemDetailView; // 0x328
	FMulticastInlineDelegate OnInventoryItemHoveredDelegate; // 0x338
	FMulticastInlineDelegate OnInventoryItemUnhoveredDelegate; // 0x348
	FMulticastInlineDelegate OnInventoryItemDraggingItem; // 0x358
	EYPlayerSetType m_slotType; // 0x369
};

struct UBlueprint : UBlueprintCore {
	UObject* ParentClass; // 0x50
	EBlueprintType BlueprintType; // 0x58
	char bRecompileOnLoad : 1; // 0x59
	char bHasBeenRegenerated : 1; // 0x59
	char bIsRegeneratingOnLoad : 1; // 0x59
	int32_t BlueprintSystemVersion; // 0x5c
	USimpleConstructionScript* SimpleConstructionScript; // 0x60
	TArray<UActorComponent*> ComponentTemplates; // 0x68
	TArray<UTimelineTemplate*> Timelines; // 0x78
	TArray<FBPComponentClassOverride> ComponentClassOverrides; // 0x88
	UInheritableComponentHandler* InheritableComponentHandler; // 0x98
};

struct UYWidget_CurrencyOffersOverview : UYWidget {
	FMulticastInlineDelegate OnGoToFounderPacksOffers; // 0x2c0
	UYWidget_OfferListContainer* m_currencyListContainer; // 0x2d0
	TArray<FDataTableRowHandle> m_dummyCurrencyOffers; // 0x2d8
};

struct UYWidget_Inventory_Base : UYWidget {
	FMulticastInlineDelegate OnInventoryScreenOpened; // 0x2c0
	FMulticastInlineDelegate OnInventoryScreenClosed; // 0x2d0
	FMulticastInlineDelegate OnMoveItemToSlotDelegate; // 0x2e0
	bool m_isCustomInitialized; // 0x2f0
};

struct ULevelCapture : UMovieSceneCapture {
	bool bAutoStartCapture; // 0x220
	FGuid PrerequisiteActorId; // 0x22c
};

struct UVehiclePlate_WBP_C : UYWidget_ActorPlate {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3a8
	UCanvasPanel* CanvasPanel_2; // 0x3b0
	UYTextBlock* TextBlock_Name; // 0x3b8
	UWBP_HealthBar_HUD_Item_C* UI_HealthBarWithDelta_WBP; // 0x3c0
};

struct UBTDecorator_DistanceToTarget_C : UBTDecorator_BlueprintBase {
	FBlackboardKeySelector combatTarget; // 0xa0
	float MaxDistance; // 0xc8
};

struct UYVehicleMovementComponent : UCharacterMovementComponent {
	FRotator m_cachedVehicleHeightAlignmentData; // 0xb20
};

struct UShapeComponent : UPrimitiveComponent {
	UBodySetup* ShapeBodySetup; // 0x440
	UNavAreaBase* AreaClass; // 0x448
	FColor ShapeColor; // 0x450
	char bDrawOnlyIfSelected : 1; // 0x454
	char bShouldCollideWhenPlacing : 1; // 0x454
	char bDynamicObstacle : 1; // 0x454
};

struct AYPlayerStart : APlayerStart {
	USkeletalMeshComponent* visualizerMesh; // 0x270
};

struct UNiagaraDataInterfaceLandscape : UNiagaraDataInterface {
	AActor* SourceLandscape; // 0x38
};

struct UMovieSceneEnumSection : UMovieSceneSection {
	FMovieSceneByteChannel EnumCurve; // 0xe8
};

struct ASkeletalMeshActor : AActor {
	char bShouldDoAnimNotifies : 1; // 0x248
	char bWakeOnLevelStart : 1; // 0x248
	USkeletalMeshComponent* SkeletalMeshComponent; // 0x250
	USkeletalMesh* ReplicatedMesh; // 0x258
	UPhysicsAsset* ReplicatedPhysAsset; // 0x260
	UMaterialInterface* ReplicatedMaterial0; // 0x268
	UMaterialInterface* ReplicatedMaterial1; // 0x270
};

struct UClothLODDataCommon_Legacy : UObject {
	UClothPhysicalMeshDataBase_Legacy* PhysicalMeshData; // 0x28
	FClothPhysicalMeshData ClothPhysicalMeshData; // 0x30
	FClothCollisionData CollisionData; // 0x128
};

struct UYRewardsRollManagerComponent : UActorComponent {
	TArray<FYRewardDropTableEntry> m_staticRewards; // 0xb0
	TArray<FYLeadboardPlacementRewardDropTableEntry> m_leaderboardPlacementRewards; // 0xc0
	UDataTable* m_evacuationBonusDataTable; // 0xd0
	UDataTable* m_diedBonusTable; // 0xd8
	UDataTable* m_matchPlayedBonusDataTable; // 0xe0
	UDataTable* m_leaderboardPlacementRewardDataTable; // 0xe8
};

struct UMaterialExpressionReflectionVectorWS : UMaterialExpression {
	FExpressionInput CustomWorldNormal; // 0x40
	char bNormalizeCustomWorldNormal : 1; // 0x54
};

struct UTreeView : UListView {
	FDelegate BP_OnGetItemChildren; // 0x378
	FMulticastInlineDelegate BP_OnItemExpansionChanged; // 0x388
};

struct UInputBehaviorSet : UObject {
	TArray<FBehaviorInfo> Behaviors; // 0x28
};

struct UGizmoTransformProxyTransformSource : UGizmoBaseTransformSource {
	UTransformProxy* Proxy; // 0x48
};

struct UVehicleWheel : UObject {
	UStaticMesh* CollisionMesh; // 0x28
	bool bDontCreateShape; // 0x30
	bool bAutoAdjustCollisionSize; // 0x31
	FVector Offset; // 0x34
	float ShapeRadius; // 0x40
	float ShapeWidth; // 0x44
	float Mass; // 0x48
	float DampingRate; // 0x4c
	float SteerAngle; // 0x50
	bool bAffectedByHandbrake; // 0x54
	UTireType* TireType; // 0x58
	UTireConfig* TireConfig; // 0x60
	float LatStiffMaxLoad; // 0x68
	float LatStiffValue; // 0x6c
	float LongStiffValue; // 0x70
	float SuspensionForceOffset; // 0x74
	float SuspensionMaxRaise; // 0x78
	float SuspensionMaxDrop; // 0x7c
	float SuspensionNaturalFrequency; // 0x80
	float SuspensionDampingRatio; // 0x84
	EWheelSweepType SweepType; // 0x88
	float MaxBrakeTorque; // 0x8c
	float MaxHandBrakeTorque; // 0x90
	UWheeledVehicleMovementComponent* VehicleSim; // 0x98
	int32_t WheelIndex; // 0xa0
	float DebugLongSlip; // 0xa4
	float DebugLatSlip; // 0xa8
	float DebugNormalizedTireLoad; // 0xac
	float DebugWheelTorque; // 0xb4
	float DebugLongForce; // 0xb8
	float DebugLatForce; // 0xbc
	FVector Location; // 0xc0
	FVector OldLocation; // 0xcc
	FVector Velocity; // 0xd8
};

struct UWBP_Notification_Center_HUD_C : UUserWidget {
	UWidgetAnimation* WidgetIn_Anim; // 0x260
	UImage* Gfx_Backer; // 0x268
	URichTextBlock* RichTxt_Headline; // 0x270
};

struct UYEnvQueryTest_TraceMaterial : UEnvQueryTest {
	FEnvTraceData TraceData; // 0x1f8
	FAIDataProviderFloatValue ItemHeightOffset; // 0x228
	UEnvQueryContext* Context; // 0x260
	TArray<EPhysicalSurface> AllowedSurfaceTypes; // 0x268
	FAIDataProviderFloatValue TraceStartOffset; // 0x278
	FAIDataProviderFloatValue TraceEndOffset; // 0x2b0
};

struct UNiagaraDataInterfaceCamera : UNiagaraDataInterface {
	int32_t PlayerControllerIndex; // 0x38
	bool bRequireCurrentFrameData; // 0x3c
};

struct UMovieSceneGeometryCollectionTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct UYWidget_ModSelection : UYWidget {
	FMulticastInlineDelegate OnSelectionClosed; // 0x2c0
	UYWidget_ItemsOverview* m_itemsOverviewWidget; // 0x2d0
	UYWidgetController_ItemsOverviewMods* m_itemsOverviewWidgetController; // 0x2d8
	UYWidget_ItemActionsPanel* m_itemActionsPanel; // 0x2e0
	URichTextBlock* m_headlineText; // 0x2e8
	UYWidget_ItemContainer* m_itemContainerToMod; // 0x2f8
};

struct UMaterialExpressionConstant : UMaterialExpression {
	float R; // 0x40
};

struct UAISense_Hearing : UAISense {
	TArray<FAINoiseEvent> NoiseEvents; // 0x80
	float SpeedOfSoundSq; // 0x90
};

struct UInterpTrackInstFloatAnimBPParam : UInterpTrackInst {
	UAnimInstance* AnimScriptInstance; // 0x28
	float ResetFloat; // 0x30
};

struct UMovieSceneTrack : UMovieSceneSignedObject {
	FMovieSceneTrackEvalOptions EvalOptions; // 0x50
	bool bIsEvalDisabled; // 0x55
	FGuid EvaluationFieldGuid; // 0x58
	FMovieSceneTrackEvaluationField EvaluationField; // 0x68
};

struct UNiagaraComponentSettings : UObject {
	TSet<FName> SuppressActivationList; // 0x28
	TSet<FName> ForceAutoPooolingList; // 0x78
	TSet<FNiagaraEmitterNameSettingsRef> SuppressEmitterList; // 0xc8
};

struct UNiagaraSimulationStageGeneric : UNiagaraSimulationStageBase {
	ENiagaraIterationSource IterationSource; // 0x40
	int32_t Iterations; // 0x44
	char bSpawnOnly : 1; // 0x48
	char bDisablePartialParticleUpdate : 1; // 0x48
	FNiagaraVariableDataInterfaceBinding DataInterface; // 0x50
};

struct UYInputKeySelector : UInputKeySelector {
	FButtonStyle m_conflictingInputButtonStyle; // 0x738
};

struct UYShopManager : UObject {
	FMulticastInlineDelegate PlayfabShopItemPurchaseCompleted; // 0x40
	FMulticastInlineDelegate PlayfabCouponRedeemed; // 0x50
	FMulticastInlineDelegate OnPlayFabStoresFetched; // 0x60
	FMulticastInlineDelegate OnPlayFabCouponRedeemed; // 0x70
	FMulticastInlineDelegate CurrenciesAdded; // 0x80
	FMulticastInlineDelegate CustomItemsUpdated; // 0x90
	TMap<FString, FYPlayfabStoreItemsResult> m_cachedStoresMap; // 0xa0
};

struct UVideoCaptureProtocol : UFrameGrabberProtocol {
	bool bUseCompression; // 0x68
	float CompressionQuality; // 0x6c
};

struct UMapMarker_DebugActivityLocation_WBP_C : UYWidget_MapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UWidgetAnimation* Warning; // 0x2e8
	UCanvasPanel* CanvasPanel_Root; // 0x2f0
	UImage* Image_Circle; // 0x2f8
	UImage* Image_Icon; // 0x300
	UTextBlock* TextBlock_DebugDescription; // 0x308
	AYActivityLocation* ActivityLocationOwner; // 0x310
	UYDebugActivityLocationMapMarkerData_BP_C* DebugLocationData; // 0x318
	float LinkRadiusUUToUISize; // 0x320
};

struct UMaterialExpressionReflectionCapturePassSwitch : UMaterialExpression {
	FExpressionInput Default; // 0x40
	FExpressionInput Reflection; // 0x54
};

struct UYActorPoolingManager : UObject {
	TArray<FYPooledActorEntry> m_pooledActors; // 0x28
};

struct UAnimSharingInstance : UObject {
	TArray<AActor*> RegisteredActors; // 0x28
	UAnimationSharingStateProcessor* StateProcessor; // 0x88
	TArray<UAnimSequence*> UsedAnimationSequences; // 0xc8
	UEnum* StateEnum; // 0xe8
	AActor* SharingActor; // 0xf0
};

struct UYWidget_DamageNumber : UYWidget {
	UTextBlock* m_damageText; // 0x2c0
	UImage* m_damageIcon; // 0x2c8
	FSlateColor m_dbnoColor; // 0x2d0
	FSlateColor m_headshotColor; // 0x2f8
	FSlateColor m_normalColor; // 0x320
	FSlateColor m_shieldDamage; // 0x348
	FSlateColor m_healColor; // 0x370
	FSlateColor m_xpColor; // 0x398
	FVector2D m_damageNumberScale; // 0x3c0
	FVector2D m_headshotDamageNumberScale; // 0x3c8
	float m_duration; // 0x3d0
	float m_xpDuration; // 0x3d4
	float m_distanceLocation; // 0x3d8
	bool m_isHeadshot; // 0x3dc
	FVector2D m_xpScale; // 0x3e0
	UCanvasPanelSlot* m_canvasPanel; // 0x400
	bool m_animateLeft; // 0x408
};

struct UParticleModuleRotationRate : UParticleModuleRotationRateBase {
	FRawDistributionFloat StartRotationRate; // 0x30
};

struct ULandscapeInfo : UObject {
	LazyObjectProperty LandscapeActor; // 0x28
	FGuid LandscapeGuid; // 0x44
	int32_t ComponentSizeQuads; // 0x54
	int32_t SubsectionSizeQuads; // 0x58
	int32_t ComponentNumSubsections; // 0x5c
	FVector DrawScale; // 0x60
	TArray<ALandscapeStreamingProxy*> Proxies; // 0x110
};

struct UNiagaraDataInterfaceGrid3DCollection : UNiagaraDataInterfaceGrid3D {
	int32_t NumAttributes; // 0x100
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0x108
	ENiagaraGpuBufferFormat BufferFormat; // 0x128
};

struct AYAbilityActor : AActor {
	FDataTableRowHandle m_spawnedRowHandle; // 0x248
};

struct UYInventoryManager : UObject {
	TMap<FString, UYBackendInventoryModel*> m_playerModels; // 0x28
	TMap<FString, int32_t> m_pendingCompleteInventoryUpdates; // 0x78
	FMulticastInlineDelegate updatedFactionProgression; // 0xc8
	FMulticastInlineDelegate CurrenciesUpdated; // 0xd8
	FMulticastInlineDelegate OnItemSuccessfullyScrapped; // 0xe8
	FMulticastInlineDelegate OnItemRepaired; // 0xf8
	bool m_rawInventoryDataReceived; // 0x108
	bool m_rawPlayerSetDataReceived; // 0x109
	FYInventory m_rawInventoryData; // 0x110
	FYPlayerSet m_rawPlayerSetData; // 0x170
};

struct UControlPointMeshComponent : UStaticMeshComponent {
	float VirtualTextureMainPassMaxDrawDistance; // 0x4d0
};

struct UWBP_AimAssistDebugUI_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* text_AutoAimAngleCoeff; // 0x268
	UTextBlock* text_AutoAimAngleCoeff_2; // 0x270
	UTextBlock* text_AutoAimAngleCoeff_3; // 0x278
	UTextBlock* text_AutoAimAngleCoeff_4; // 0x280
	UTextBlock* text_AutoAimAngleCoeff_5; // 0x288
	UTextBlock* text_AutoAimAngleCoeff_6; // 0x290
	UTextBlock* text_AutoAimAngleCoeff_7; // 0x298
	UTextBlock* text_AutoAimAngleCoeff_8; // 0x2a0
	UTextBlock* text_AutoAimAngleCoeff_9; // 0x2a8
	UTextBlock* text_AutoAimAngleCoeff_10; // 0x2b0
	UTextBlock* text_AutoAimAngleCoeff_11; // 0x2b8
	UTextBlock* text_AutoAimAngleCoeff_12; // 0x2c0
	UTextBlock* text_AutoAimAngleCoeff_13; // 0x2c8
	UTextBlock* text_AutoAimAngleCoeff_14; // 0x2d0
	UTextBlock* text_AutoAimAngleCoeff_15; // 0x2d8
	UTextBlock* text_AutoAimAngleCoeff_16; // 0x2e0
	UTextBlock* text_AutoAimAngleCoeff_17; // 0x2e8
	UTextBlock* text_AutoAimAngleCoeff_18; // 0x2f0
	UTextBlock* text_AutoAimAngleCoeff_19; // 0x2f8
	UTextBlock* text_AutoAimAngleCoeff_20; // 0x300
	UTextBlock* text_AutoAimAngleCoeff_21; // 0x308
	UTextBlock* text_AutoAimAngleCoeff_22; // 0x310
	UTextBlock* text_AutoAimAngleCoeff_23; // 0x318
	UTextBlock* text_AutoAimAngleCoeff_24; // 0x320
	UTextBlock* TextBlock; // 0x328
	UTextBlock* TextBlock_2; // 0x330
	UTextBlock* TextBlock_3; // 0x338
	UTextBlock* TextBlock_4; // 0x340
	UTextBlock* TextBlock_5; // 0x348
	UTextBlock* TextBlock_6; // 0x350
	UTextBlock* TextBlock_7; // 0x358
	UTextBlock* TextBlock_8; // 0x360
	UTextBlock* TextBlock_12; // 0x368
	UTextBlock* TextBlock_13; // 0x370
	UTextBlock* TextBlock_14; // 0x378
	UTextBlock* TextBlock_377; // 0x380
	UBP_AimAssist_C* AimAssist; // 0x388
};

struct ASpectatorBeaconHost : AOnlineBeaconHostObject {
	USpectatorBeaconState* State; // 0x268
	bool bLogoutOnSessionTimeout; // 0x2d0
	float SessionTimeoutSecs; // 0x2d4
	float TravelSessionTimeoutSecs; // 0x2d8
};

struct UYBTService_EvaluateMeleeAttacks : UBTService {
	FBlackboardKeySelector m_keyCombatTarget; // 0xc0
	FBlackboardKeySelector m_keyMeleeAttack; // 0xe8
	FBlackboardKeySelector m_keyIsInComboWindow; // 0x110
	FBlackboardKeySelector m_keyAttackOutAnimMontage; // 0x138
	UAnimMontage* m_cachedAttackMontage; // 0x160
};

struct UPlayMontageCallbackProxy : UObject {
	FMulticastInlineDelegate OnCompleted; // 0x28
	FMulticastInlineDelegate OnBlendOut; // 0x38
	FMulticastInlineDelegate OnInterrupted; // 0x48
	FMulticastInlineDelegate OnNotifyBegin; // 0x58
	FMulticastInlineDelegate OnNotifyEnd; // 0x68
};

struct UYWidget_Ammo : UYWidget {
	UTextBlock* m_ammoText; // 0x2c0
	UTextBlock* m_activeWeaponText; // 0x2c8
	UTextBlock* m_activeWeaponRow; // 0x2d0
	FText m_ammoString; // 0x2d8
	UYWeaponPlayerControllerRuntimeComponent* m_weaponControllerRuntimeComponent; // 0x2f0
};

struct UMaterialExpressionReroute : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleRequired : UParticleModule {
	UMaterialInterface* Material; // 0x30
	float MinFacingCameraBlendDistance; // 0x38
	float MaxFacingCameraBlendDistance; // 0x3c
	FVector EmitterOrigin; // 0x40
	FRotator EmitterRotation; // 0x4c
	EParticleScreenAlignment ScreenAlignment; // 0x58
	char bUseLocalSpace : 1; // 0x59
	char bKillOnDeactivate : 1; // 0x59
	char bKillOnCompleted : 1; // 0x59
	EParticleSortMode SortMode; // 0x5a
	char bUseLegacyEmitterTime : 1; // 0x5b
	char bRemoveHMDRoll : 1; // 0x5b
	char bEmitterDurationUseRange : 1; // 0x5b
	float EmitterDuration; // 0x5c
	FRawDistributionFloat SpawnRate; // 0x60
	TArray<FParticleBurst> BurstList; // 0x90
	float EmitterDelay; // 0xa0
	float EmitterDelayLow; // 0xa4
	char bDelayFirstLoopOnly : 1; // 0xa8
	EParticleSubUVInterpMethod InterpolationMethod; // 0xa9
	char bScaleUV : 1; // 0xaa
	char bEmitterDelayUseRange : 1; // 0xaa
	EParticleBurstMethod ParticleBurstMethod; // 0xab
	char bOverrideSystemMacroUV : 1; // 0xac
	char bUseMaxDrawCount : 1; // 0xac
	EOpacitySourceMode OpacitySourceMode; // 0xad
	EEmitterNormalsMode EmitterNormalsMode; // 0xae
	char bOrbitModuleAffectsVelocityAlignment : 1; // 0xaf
	int32_t SubImages_Horizontal; // 0xb0
	int32_t SubImages_Vertical; // 0xb4
	float RandomImageTime; // 0xb8
	int32_t RandomImageChanges; // 0xbc
	FVector MacroUVPosition; // 0xc0
	float MacroUVRadius; // 0xcc
	EParticleUVFlipMode UVFlippingMode; // 0xd0
	ESubUVBoundingVertexCount BoundingMode; // 0xd1
	char bDurationRecalcEachLoop : 1; // 0xd2
	FVector NormalsSphereCenter; // 0xd4
	float AlphaThreshold; // 0xe0
	int32_t EmitterLoops; // 0xe4
	UTexture2D* CutoutTexture; // 0xe8
	int32_t MaxDrawCount; // 0xf0
	float EmitterDurationLow; // 0xf4
	FVector NormalsCylinderDirection; // 0xf8
	TArray<FName> NamedMaterialOverrides; // 0x108
};

struct UTextBlock : UTextLayoutWidget {
	FText Text; // 0x128
	FDelegate TextDelegate; // 0x140
	FSlateColor ColorAndOpacity; // 0x150
	FDelegate ColorAndOpacityDelegate; // 0x178
	FSlateFontInfo Font; // 0x188
	FSlateBrush StrikeBrush; // 0x1e0
	FVector2D ShadowOffset; // 0x268
	FLinearColor ShadowColorAndOpacity; // 0x270
	FDelegate ShadowColorAndOpacityDelegate; // 0x280
	float MinDesiredWidth; // 0x290
	bool bWrapWithInvalidationPanel; // 0x294
	bool bAutoWrapText; // 0x295
	ETextTransformPolicy TextTransformPolicy; // 0x296
	bool bSimpleTextMode; // 0x297
};

struct UYWidget_OfferListContainer : UYWidget {
	TArray<TSoftClassPtr<UObject>> m_offerOverviewLayouts; // 0x2d8
	UWidgetSwitcher* m_layoutWidgetSwitcher; // 0x2e8
	UUserWidget* m_currentLayoutUserWidget; // 0x2f8
	TArray<UYWidget_ItemContainer*> m_itemContainers; // 0x300
};

struct UYControllerContractsBoardsDataComponent_BP_C : UYControllerContractsBoardsDataComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0x130
};

struct USettingsMenu_SBP_C : UYScreenBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
};

struct ABrush : AActor {
	EBrushType BrushType; // 0x240
	FColor BrushColor; // 0x244
	int32_t PolyFlags; // 0x248
	char bColored : 1; // 0x24c
	char bSolidWhenSelected : 1; // 0x24c
	char bPlaceableFromClassBrowser : 1; // 0x24c
	char bNotForClientOrServer : 1; // 0x24c
	UModel* Brush; // 0x250
	UBrushComponent* BrushComponent; // 0x258
	char bInManipulation : 1; // 0x260
	TArray<FGeomSelection> SavedSelections; // 0x268
};

struct UYPlayerBIDataComponent : UActorComponent {
	bool m_haveUsedVehicleOnce; // 0xb0
	float m_timeStampLastTimeLevel; // 0xb8
	int32_t m_localCacheMountID; // 0xbc
};

struct UBTDecorator_KeepInCone : UBTDecorator {
	float ConeHalfAngle; // 0x68
	FBlackboardKeySelector ConeOrigin; // 0x70
	FBlackboardKeySelector Observed; // 0x98
	char bUseSelfAsOrigin : 1; // 0xc0
	char bUseSelfAsObserved : 1; // 0xc0
};

struct UYWeaponPlayerControllerRuntimeComponent : UActorComponent {
	int32_t m_ammoInClip; // 0xc0
	int32_t m_ammoConsumptionPendingInPercent; // 0xc4
	FName m_ammoTypeID; // 0xc8
	int32_t m_activeWeaponIndex; // 0xec
	FYStoredRuntimeWeaponInformation m_activeWeaponStoredInformation; // 0x110
	FYStoredModData m_weaponModsData; // 0x1f0
	FVector2D m_recoilToUndo; // 0x260
	bool m_isCameraFollowingRecoil; // 0x269
	FMulticastInlineDelegate OnActiveWeaponChanged; // 0x270
	FMulticastInlineDelegate OnAmmoChanged; // 0x280
	FMulticastInlineDelegate OnHealSelfAvaliable; // 0x290
	FMulticastInlineDelegate OnStoredModsChanged; // 0x2a0
	FMulticastInlineDelegate OnSpinupPercentChanged; // 0x2b0
	FMulticastInlineDelegate OnWeaponFired; // 0x2c0
	FMulticastInlineDelegate OnWeaponCantBeFired; // 0x2d0
	FMulticastInlineDelegate OnWeaponRefireCooldownTimeChanged; // 0x2e0
	FMulticastInlineDelegate OnWeaponRefireCooldownTimeFinished; // 0x2f0
	FMulticastInlineDelegate BP_OnSelectedToolChanged; // 0x300
	FMulticastInlineDelegate BP_OnSelectedConsumableChanged; // 0x310
	FYInventoryItem m_selectedToolItem; // 0x320
	FYInventoryItem m_selectedConsumableItem; // 0x3b8
	int32_t m_weaponTransportHandle; // 0x490
	UYPlayerCharacterStateComponent* m_characterStateComponent; // 0x4b0
	UYPlayerCharacterWeaponComponent* m_characterWeaponComponent; // 0x4b8
	UYPlayerMovementComponent* m_characterMovementComponent; // 0x4c0
	UYControllerStateInputComponent* m_controllerInputStateComponent; // 0x4c8
	UYStaminaComponent* m_characterStaminaComponent; // 0x4d0
	UYMeleeAttackComponent* m_characterMeleeComponent; // 0x4d8
	UYControllerInventoryAbilityComponent* m_controllerAbilityComponent; // 0x4e0
	FMulticastInlineDelegate OnFinishedTargetingDelegate; // 0x4e8
	FMulticastInlineDelegate OnMeleeLightAttackEvent; // 0x4f8
	FMulticastInlineDelegate OnMeleeHeavyAttackEvent; // 0x508
	FHitResult m_aimingAtHitResult; // 0x51c
	FVector m_shootingDirection; // 0x5ac
	UYGameplayAttributesComponent* m_characterGPAComponent; // 0x5c8
	UYPerkComponent* m_characterPerkComponent; // 0x5d0
	UYScriptableWeaponComponent* m_scriptableComponent; // 0x5d8
	bool m_locallyWeaponTransportHandleUsed; // 0x614
	float m_maxFovConsideredAsScoped; // 0x618
	float m_adsSensitivityMultiplierScaling; // 0x61c
	float m_scopedSensitivityMultiplierScaling; // 0x620
	float m_minTimeIntervalAllowedBetweenFireRPCS; // 0x624
	float m_lastTimeWeaponFiredRPCValidation; // 0x628
};

struct UYWidgetView_StationHUD : UYWidgetView {
	UCanvasPanel* m_popUpCanvasPanel; // 0x338
};

struct UARPin : UObject {
	UARTrackedGeometry* TrackedGeometry; // 0x28
	USceneComponent* PinnedComponent; // 0x30
	FTransform LocalToTrackingTransform; // 0x40
	FTransform LocalToAlignedTrackingTransform; // 0x70
	EARTrackingState TrackingState; // 0xa0
	FMulticastInlineDelegate OnARTrackingStateChanged; // 0xc0
	FMulticastInlineDelegate OnARTransformUpdated; // 0xd0
};

struct AYPlayersMapDataManager : AActor {
	TArray<UYControllerPlayerMapMarkerComponent*> m_controllerMarkerComponentsQueue; // 0x240
	TArray<FYSurveillanceNode> m_allSurveillanceActors; // 0x250
	TArray<UYMapMarkerData*> m_replicatedMarkersData; // 0x270
	TArray<UYMapMarkerData*> m_clientMarkersData; // 0x280
};

struct UMapMarker_Escape_WBP_C : UYWidget_MapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UWidgetAnimation* EvacDisabled_Anim; // 0x2e8
	UWidgetAnimation* Warning_Anim; // 0x2f0
	UYTextBlock* CountdownText; // 0x2f8
	UImage* m_iconImage; // 0x300
	UTextBlock* Txt_StormWarning; // 0x308
	EYMapMarkerState IconState; // 0x310
	UBP_EscapeMarkerData_C* MarkerDataEscape; // 0x318
	FName MatchPhase; // 0x320
};

struct UMaterialExpressionMakeMaterialAttributes : UMaterialExpression {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Metallic; // 0x54
	FExpressionInput Specular; // 0x68
	FExpressionInput Roughness; // 0x7c
	FExpressionInput Anisotropy; // 0x90
	FExpressionInput EmissiveColor; // 0xa4
	FExpressionInput Opacity; // 0xb8
	FExpressionInput OpacityMask; // 0xcc
	FExpressionInput Normal; // 0xe0
	FExpressionInput Tangent; // 0xf4
	FExpressionInput WorldPositionOffset; // 0x108
	FExpressionInput WorldDisplacement; // 0x11c
	FExpressionInput TessellationMultiplier; // 0x130
	FExpressionInput SubsurfaceColor; // 0x144
	FExpressionInput ClearCoat; // 0x158
	FExpressionInput ClearCoatRoughness; // 0x16c
	FExpressionInput AmbientOcclusion; // 0x180
	FExpressionInput Refraction; // 0x194
	FExpressionInput CustomizedUVs[0x8]; // 0x1a8
	FExpressionInput PixelDepthOffset; // 0x248
	FExpressionInput ShadingModel; // 0x25c
};

struct UBlackboardData : UDataAsset {
	UBlackboardData* Parent; // 0x30
	TArray<FBlackboardEntry> Keys; // 0x38
	char bHasSynchronizedKeys : 1; // 0x48
};

struct UWBP_Station_HUD_C : UYWidgetView_StationHUD {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWidgetAnimation* ScreenIn_Anim; // 0x348
	UImage* Gfx_Gradient; // 0x350
	UVerticalBox* LeftInfoPanels; // 0x358
	UCanvasPanel* MainCanvas; // 0x360
	UCanvasPanel* MiniMap; // 0x368
	UNotificationsManager_WBP_C* NotificationsManager_WBP; // 0x370
	UUI_RadialStationMinimap_WBP_C* UI_RadialStationMinimap_WBP; // 0x378
	UWBP_Rewards_Popup_C* UI_RewardsPopup_WBP; // 0x380
	UWBP_Chat_C* WBP_Chat; // 0x388
	UWBP_Contracts_Active_C* WBP_Contracts_Active; // 0x390
	UWBP_Currency_Btn_C* WBP_Currency_Btn_Hard; // 0x398
	UWBP_Currency_Btn_C* WBP_Currency_Btn_Soft; // 0x3a0
	UWBP_FPS_Counter_HUD_Panel_C* WBP_FPS_Counter_HUD_Panel; // 0x3a8
	UWBP_Friends_MiniWidget_C* WBP_Friends_MiniWidget; // 0x3b0
	UWBP_InputKeyNavigation_C* WBP_InputKeyNavigation; // 0x3b8
	UWBP_FTUE_NextStep_Widget_C* WBP_MissionMiniWidget; // 0x3c0
	UWBP_Notification_Center_HUD_C* WBP_Notification_Center_HUD; // 0x3c8
	UWBP_Notification_Panel_C* WBP_Notification_Panel; // 0x3d0
	UWBP_PlayerQuartersLevel_C* WBP_PlayerQuartersLevel; // 0x3d8
	UWBP_RadialSelection_Panel_C* WBP_RadialSelection_Panel; // 0x3e0
	UWBP_SocialOverview_C* WBP_SocialOverview; // 0x3e8
	UWBP_Subtitles_C* WBP_Subtitles; // 0x3f0
	bool IsContractWidgetShown; // 0x3f8
	bool ShouldShowContractWidget; // 0x3f9
	bool IsContractWidgetManuallyOpened; // 0x3fa
	float ContractsPanelOnScreenDuration; // 0x3fc
};

struct UPanelWidget : UWidget {
	TArray<UPanelSlot*> Slots; // 0x108
};

struct UWBP_Headline_Panel_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UNamedSlot* TextSlot; // 0x2c8
	FText HeadlineLabel; // 0x2d0
};

struct UMovieSceneIntegerSection : UMovieSceneSection {
	FMovieSceneIntegerChannel IntegerCurve; // 0xe8
};

struct UYEncumbranceEffects_DataAsset : UDataAsset {
	UCurveFloat* m_walkSpeedEffectCurve; // 0x30
	UCurveFloat* m_maxStaminaEffectCurve; // 0x38
	float m_disableSprintThreshold; // 0x40
	float m_disableSprintLedgeGrabThreshold; // 0x44
	float m_disableSprintWallRunThreshold; // 0x48
};

struct USubmixEffectConvolutionReverbPreset : USoundEffectSubmixPreset {
	UAudioImpulseResponse* ImpulseResponse; // 0x68
	FSubmixEffectConvolutionReverbSettings Settings; // 0x70
	ESubmixEffectConvolutionReverbBlockSize BlockSize; // 0x98
	bool bEnableHardwareAcceleration; // 0x99
};

struct AAL_Base_BP_C : AYActivityLocationLinked {
	FPointerToUberGraphFrame UberGraphFrame; // 0x448
	UBillboardComponent* BillboardEditor; // 0x450
	USceneComponent* Scene; // 0x458
};

struct UPlayerBotEvacuateTask_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
};

struct UMaterialExpressionConstant4Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UMaterialExpressionHairColor : UMaterialExpression {
	FExpressionInput Melanin; // 0x40
	FExpressionInput Redness; // 0x54
	FExpressionInput DyeColor; // 0x68
};

struct UBuoyancyComponent : UActorComponent {
	TArray<FSphericalPontoon> Pontoons; // 0xb0
	FMulticastInlineDelegate OnEnteredWaterDelegate; // 0xc0
	FMulticastInlineDelegate OnExitedWaterDelegate; // 0xd0
	FBuoyancyData BuoyancyData; // 0xe0
	TArray<AWaterBody*> CurrentWaterBodies; // 0x130
	UPrimitiveComponent* SimulatingComponent; // 0x140
};

struct UBlackboardKeyType_Enum : UBlackboardKeyType {
	UEnum* EnumType; // 0x30
	FString EnumName; // 0x38
	char bIsEnumNameValid : 1; // 0x48
};

struct UWheeledVehicleMovementComponent : UPawnMovementComponent {
	char bDeprecatedSpringOffsetMode : 1; // 0x140
	char bReverseAsBrake : 1; // 0x140
	char bUseRVOAvoidance : 1; // 0x140
	char bRawHandbrakeInput : 1; // 0x140
	char bRawGearUpInput : 1; // 0x140
	char bRawGearDownInput : 1; // 0x140
	char bWasAvoidanceUpdated : 1; // 0x144
	float Mass; // 0x148
	TArray<FWheelSetup> WheelSetups; // 0x150
	float DragCoefficient; // 0x160
	float ChassisWidth; // 0x164
	float ChassisHeight; // 0x168
	float DragArea; // 0x16c
	float EstimatedMaxEngineSpeed; // 0x170
	float MaxEngineRPM; // 0x174
	float DebugDragMagnitude; // 0x178
	FVector InertiaTensorScale; // 0x17c
	float MinNormalizedTireLoad; // 0x188
	float MinNormalizedTireLoadFiltered; // 0x18c
	float MaxNormalizedTireLoad; // 0x190
	float MaxNormalizedTireLoadFiltered; // 0x194
	float ThresholdLongitudinalSpeed; // 0x198
	int32_t LowForwardSpeedSubStepCount; // 0x19c
	int32_t HighForwardSpeedSubStepCount; // 0x1a0
	TArray<UVehicleWheel*> Wheels; // 0x1a8
	float RVOAvoidanceRadius; // 0x1d0
	float RVOAvoidanceHeight; // 0x1d4
	float AvoidanceConsiderationRadius; // 0x1d8
	float RVOSteeringStep; // 0x1dc
	float RVOThrottleStep; // 0x1e0
	int32_t AvoidanceUID; // 0x1e4
	FNavAvoidanceMask AvoidanceGroup; // 0x1e8
	FNavAvoidanceMask GroupsToAvoid; // 0x1ec
	FNavAvoidanceMask GroupsToIgnore; // 0x1f0
	float AvoidanceWeight; // 0x1f4
	FVector PendingLaunchVelocity; // 0x1f8
	FReplicatedVehicleState ReplicatedState; // 0x204
	float RawSteeringInput; // 0x21c
	float RawThrottleInput; // 0x220
	float RawBrakeInput; // 0x224
	float SteeringInput; // 0x228
	float ThrottleInput; // 0x22c
	float BrakeInput; // 0x230
	float HandbrakeInput; // 0x234
	float IdleBrakeInput; // 0x238
	float StopThreshold; // 0x23c
	float WrongDirectionThreshold; // 0x240
	FVehicleInputRate ThrottleInputRate; // 0x244
	FVehicleInputRate BrakeInputRate; // 0x24c
	FVehicleInputRate HandbrakeInputRate; // 0x254
	FVehicleInputRate SteeringInputRate; // 0x25c
	AController* OverrideController; // 0x288
};

struct UStrider_ABP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Root AnimGraphNode_Root; // 0x2c8
	FAnimNode_PowerIK_Ground AnimGraphNode_PowerIK_Ground; // 0x2f8
	FAnimNode_LookAt AnimGraphNode_LookAt; // 0x690
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x840
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x860
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x880
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x8a8
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x948
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xaa0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0xac8
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0xaf0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xb10
	FAnimNode_Slot AnimGraphNode_Slot; // 0xbb0
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0xbf8
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xd50
	FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0xdf0
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0xe08
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0xe28
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xe50
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0xe78
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0xea0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0xec8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0xef0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xf18
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0xf40
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xfc0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xff0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1070
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x10a0
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x1188
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x1238
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x1320
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1408
	FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1438
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x14e8
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1568
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x15e8
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1618
	FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x16c8
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x16e0
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x17a0
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x17c8
	float Speed; // 0x1868
	float Direction; // 0x186c
	AYAICharacter* CharacterAIOwner; // 0x1870
	UAnimMontage* DeathMontage; // 0x1878
	FDataTableRowHandle TurnAnimationRow; // 0x1880
	char aiState; // 0x1890
	bool LookAtBool; // 0x1891
	FVector LookAtTarget; // 0x1894
	bool Is Dedicated Server; // 0x18a0
	float LookAtDistance; // 0x18a4
	FName PhysBaseBone; // 0x18a8
};

struct UEnvQueryGenerator_PathingGrid : UEnvQueryGenerator_SimpleGrid {
	FAIDataProviderBoolValue PathToItem; // 0xf8
	UNavigationQueryFilter* NavigationFilter; // 0x130
	FAIDataProviderFloatValue ScanRangeMultiplier; // 0x138
};

struct ULoudnessNRTSettings : UAudioSynesthesiaNRTSettings {
	float AnalysisPeriod; // 0x28
	float MinimumFrequency; // 0x2c
	float MaximumFrequency; // 0x30
	ELoudnessNRTCurveTypeEnum CurveType; // 0x34
	float NoiseFloorDb; // 0x38
};

struct UMovieSceneControlRigParameterSection : UMovieSceneParameterSection {
	UControlRig* ControlRig; // 0x148
	TArray<bool> ControlsMask; // 0x150
	FMovieSceneTransformMask TransformMask; // 0x160
	bool bAdditive; // 0x164
	bool bApplyBoneFilter; // 0x165
	FInputBlendPose BoneFilter; // 0x168
	FMovieSceneFloatChannel weight; // 0x178
	TMap<FName, FChannelMapInfo> ControlChannelMap; // 0x218
	TArray<FEnumParameterNameAndCurve> EnumParameterNamesAndCurves; // 0x268
	TArray<FIntegerParameterNameAndCurve> IntegerParameterNamesAndCurves; // 0x278
};

struct UParticleModuleTrailSource : UParticleModuleTrailBase {
	ETrail2SourceMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	FRawDistributionFloat SourceStrength; // 0x40
	char bLockSourceStength : 1; // 0x70
	int32_t SourceOffsetCount; // 0x74
	TArray<FVector> SourceOffsetDefaults; // 0x78
	EParticleSourceSelectionMethod SelectionMethod; // 0x88
	char bInheritRotation : 1; // 0x8c
};

struct UParticleModuleVectorFieldRotation : UParticleModuleVectorFieldBase {
	FVector MinInitialRotation; // 0x30
	FVector MaxInitialRotation; // 0x3c
};

struct UVehicleAnimInstance : UAnimInstance {
	UWheeledVehicleMovementComponent* WheeledVehicleMovementComponent; // 0xa40
};

struct UGraphNodeContextMenuContext : UObject {
	UBlueprint* Blueprint; // 0x28
	UEdGraph* Graph; // 0x30
	UEdGraphNode* Node; // 0x38
	bool bIsDebugging; // 0x48
};

struct UWheeledVehicleMovementComponent4W : UWheeledVehicleMovementComponent {
	FVehicleEngineData EngineSetup; // 0x290
	FVehicleDifferential4WData DifferentialSetup; // 0x330
	float AckermannAccuracy; // 0x34c
	FVehicleTransmissionData TransmissionSetup; // 0x350
	FRuntimeFloatCurve SteeringCurve; // 0x380
};

struct UYGameStateSessionComponent : UActorComponent {
	FMulticastInlineDelegate OnSessionStateChangedDelegate; // 0xb0
	TArray<EYSessionEventType> m_completedStates; // 0xc0
	uint64_t m_startUtcTime; // 0xd0
	uint64_t m_lastTimeUserConnectedUtcTime; // 0xd8
	float m_logSendInterval; // 0xe0
};

struct AGameMode : AGameModeBase {
	FName matchState; // 0x2e0
	char bDelayedStart : 1; // 0x2e8
	int32_t NumSpectators; // 0x2ec
	int32_t numPlayers; // 0x2f0
	int32_t NumBots; // 0x2f4
	float MinRespawnDelay; // 0x2f8
	int32_t NumTravellingPlayers; // 0x2fc
	ULocalMessage* EngineMessageClass; // 0x300
	TArray<APlayerState*> InactivePlayerArray; // 0x308
	float InactivePlayerStateLifeSpan; // 0x318
	int32_t MaxInactivePlayers; // 0x31c
	bool bHandleDedicatedServerReplays; // 0x320
};

struct UYWidget_ItemActionsPanel : UYWidget {
	bool m_chooseEquipSlot; // 0x300
	bool m_equipOnDoubleClick; // 0x301
	bool m_craftOnDoubleClick; // 0x302
	bool m_goToDetailsOnDoubleClick; // 0x303
	bool m_concealSelectedItemName; // 0x304
	TArray<EYItemActionType> m_availableItemActions; // 0x308
	UYWidget_ItemContainer* m_selectedItemWidget; // 0x318
	UYWidget_ItemContainer* m_offerItemWidget; // 0x320
	UWidgetSwitcher* m_informationPanelsWidgetSwitcher; // 0x328
	UWidget* m_emptyWidgetSwitcherElement; // 0x330
	UWidget* m_selectItemWidgetSwitcherElement; // 0x338
	UWidget* m_itemNameWidgetSwitcherElement; // 0x340
	UWidget* m_itemNameAndCraftingPriceWidgetSwitcherElement; // 0x348
	UWidget* m_craftingInProgressWidgetSwitcherElement; // 0x350
	UWidget* m_craftingFinishedWidgetSwitcherElement; // 0x358
	UWidget* m_offerPurchaseWidgetSwitcherElement; // 0x360
	FDataTableRowHandle m_audioEquipItem; // 0x368
	FDataTableRowHandle m_audioSetMod; // 0x378
	FDataTableRowHandle m_audioClearMod; // 0x388
	FDataTableRowHandle m_audioCraftingInProgress; // 0x398
	FDataTableRowHandle m_audioCraftingCanceled; // 0x3a8
	FDataTableRowHandle m_audioCraftingFinished; // 0x3b8
	UAudioComponent* m_audioComponentCraftingInProgress; // 0x3d0
	TMap<EYItemActionType, UYWidget_ItemActionButton*> m_itemActionButtons; // 0x3d8
};

struct UControlRigValidator : UObject {
	TArray<UControlRigValidationPass*> Passes; // 0x28
};

struct UBTTask_HandleResetFailure_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FBlackboardKeySelector KeyHomeLocation; // 0xb0
	UYPathFollowingComponent* PathFollowingComponent; // 0xd8
	APawn* ControlledPawn; // 0xe0
	AAIController* Controller; // 0xe8
	FString SquadString; // 0xf0
	FString MontageString; // 0x100
	bool CanPathfindToHomeLoc; // 0x110
};

struct UWBP_Friends_MiniWidget_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* SquadActive_Anim; // 0x2c8
	UWidgetAnimation* FadeIn; // 0x2d0
	UImage* Gfx_Background; // 0x2d8
	UWBP_SocialToggle_C* OutpostSocialToggle_WBP; // 0x2e0
	UWBP_SquadOverview_C* OutpostSquadToggle_WBP; // 0x2e8
	UOverlay* squad; // 0x2f0
	UOverlay* SquadBacker; // 0x2f8
	UWBP_Dummy_Btn_C* WBP_Dummy_Btn; // 0x300
	UWBP_InputKey_C* WBP_InputKey; // 0x308
	UWBP_SquadStatus_C* WBP_SquadStatus; // 0x310
	FText headline; // 0x318
	FMulticastInlineDelegate WidgetClicked; // 0x330
};

struct UGridPathFollowingComponent : UPathFollowingComponent {
	UNavLocalGridManager* GridManager; // 0x250
};

struct UPrefabricatorConstructionSnapComponent : UBoxComponent {
	EPrefabricatorConstructionSnapType SnapType; // 0x468
	FPCSnapConstraintFloor FloorConstraint; // 0x469
	FPCSnapConstraintWall WallConstraint; // 0x46f
	bool bAlignToGroundSlope; // 0x473
	bool bUseMaxGroundSlopeConstraint; // 0x474
	float MaxGroundPlacementSlope; // 0x478
};

struct UConstructionSystemItemUserData : UAssetUserData {
	int32_t Seed; // 0x28
};

struct UYWidget_CommWheelItem : UYWidget {
	FDataTableRowHandle m_selectionWheelDataTableRowHandle; // 0x2c0
	FMulticastInlineDelegate OnMouseHoverStateChanged; // 0x2d0
	FMulticastInlineDelegate OnIconTexture; // 0x2e0
	int32_t m_wheelEntryID; // 0x2f0
	EYVanityType m_vanityType; // 0x2f4
	TSoftObjectPtr<UTexture2D> m_cachedWheelTexture; // 0x2f8
	bool m_useUpperCaseName; // 0x320
	EYPlayerSetType m_consumableSlot; // 0x321
};

struct UParticleModuleSubUV : UParticleModuleSubUVBase {
	USubUVAnimation* Animation; // 0x30
	FRawDistributionFloat SubImageIndex; // 0x38
	char bUseRealTime : 1; // 0x68
};

struct UNiagaraDataInterfaceVolumeTexture : UNiagaraDataInterface {
	UVolumeTexture* Texture; // 0x38
};

struct UYVivoxComponent : UActorComponent {
	FMulticastInlineDelegate OnMicrophoneInputEnergyChangedDelegate; // 0x100
	FMulticastInlineDelegate OnRefreshCurrentActiveChannels; // 0x110
	int32_t m_reconnectAttemptsCounter; // 0x130
};

struct UGameNetworkManagerSettings : UObject {
	int32_t MinDynamicBandwidth; // 0x28
	int32_t MaxDynamicBandwidth; // 0x2c
	int32_t TotalNetBandwidth; // 0x30
	int32_t BadPingThreshold; // 0x34
	char bIsStandbyCheckingEnabled : 1; // 0x38
	float StandbyRxCheatTime; // 0x3c
	float StandbyTxCheatTime; // 0x40
	float PercentMissingForRxStandby; // 0x44
	float PercentMissingForTxStandby; // 0x48
	float PercentForBadPing; // 0x4c
	float JoinInProgressStandbyWaitTime; // 0x50
};

struct UMaterialExpressionAtmosphericFogColor : UMaterialExpression {
	FExpressionInput WorldPosition; // 0x40
};

struct UYWidget_MenuTestScreen2Widget : UYWidget {
	UButton* m_openScreenButton; // 0x2c0
	UButton* m_closeScreenButton; // 0x2c8
};

struct AYPickup_Ammo_BP_C : AYPickup_Base_BP_C {
	bool IsDisabled; // 0x48c
};

struct UNiagaraSpriteRendererProperties : UNiagaraRendererProperties {
	UMaterialInterface* Material; // 0x80
	ENiagaraRendererSourceDataMode SourceMode; // 0x88
	FNiagaraUserParameterBinding MaterialUserParamBinding; // 0x90
	ENiagaraSpriteAlignment Alignment; // 0xb0
	ENiagaraSpriteFacingMode FacingMode; // 0xb1
	FVector2D PivotInUVSpace; // 0xb4
	ENiagaraSortMode SortMode; // 0xbc
	FVector2D SubImageSize; // 0xc0
	char bSubImageBlend : 1; // 0xc8
	char bRemoveHMDRollInVR : 1; // 0xc8
	char bSortOnlyWhenTranslucent : 1; // 0xc8
	char bGpuLowLatencyTranslucency : 1; // 0xc8
	float MinFacingCameraBlendDistance; // 0xcc
	float MaxFacingCameraBlendDistance; // 0xd0
	char bEnableCameraDistanceCulling : 1; // 0xd4
	float MinCameraDistance; // 0xd8
	float MaxCameraDistance; // 0xdc
	uint32_t RendererVisibility; // 0xe0
	FNiagaraVariableAttributeBinding PositionBinding; // 0xe8
	FNiagaraVariableAttributeBinding ColorBinding; // 0x140
	FNiagaraVariableAttributeBinding VelocityBinding; // 0x198
	FNiagaraVariableAttributeBinding SpriteRotationBinding; // 0x1f0
	FNiagaraVariableAttributeBinding SpriteSizeBinding; // 0x248
	FNiagaraVariableAttributeBinding SpriteFacingBinding; // 0x2a0
	FNiagaraVariableAttributeBinding SpriteAlignmentBinding; // 0x2f8
	FNiagaraVariableAttributeBinding SubImageIndexBinding; // 0x350
	FNiagaraVariableAttributeBinding DynamicMaterialBinding; // 0x3a8
	FNiagaraVariableAttributeBinding DynamicMaterial1Binding; // 0x400
	FNiagaraVariableAttributeBinding DynamicMaterial2Binding; // 0x458
	FNiagaraVariableAttributeBinding DynamicMaterial3Binding; // 0x4b0
	FNiagaraVariableAttributeBinding CameraOffsetBinding; // 0x508
	FNiagaraVariableAttributeBinding UVScaleBinding; // 0x560
	FNiagaraVariableAttributeBinding MaterialRandomBinding; // 0x5b8
	FNiagaraVariableAttributeBinding CustomSortingBinding; // 0x610
	FNiagaraVariableAttributeBinding NormalizedAgeBinding; // 0x668
	FNiagaraVariableAttributeBinding RendererVisibilityTagBinding; // 0x6c0
	TArray<FNiagaraMaterialAttributeBinding> MaterialParameterBindings; // 0x718
};

struct UYObjectCustomizationRotationComponent : UActorComponent {
	TArray<FYRotationObjectEntry> m_sceneComponentsToRotate; // 0xb0
};

struct UYWidget_VanityCategoryListSelection : UYWidget_ItemContainer {
	EYVanityType m_activeCategory; // 0x580
	UPanelWidget* m_panel; // 0x588
	UYWidget_SimpleHeadline* m_headline; // 0x590
	UYWidget_ItemContainer* m_customizationEntryClass; // 0x598
	FMulticastInlineDelegate OnBackButtonClicked; // 0x5a0
	FMulticastInlineDelegate OnVanityItemClicked; // 0x5b0
	FMulticastInlineDelegate OnVanityItemHovered; // 0x5c0
	bool m_containEmptyItem; // 0x5d0
};

struct UUniformScalar : UFieldNodeFloat {
	float Magnitude; // 0xb0
};

struct UAIHitReactionComponent_BP_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	TMap<FName, float> BonePhysBlendTimeMap; // 0xb8
	UCurveFloat* PhysicsBlendOutCurve; // 0x108
	AYAICharacter* OwningChar; // 0x110
	FName Bone Name Hit; // 0x118
	FVector From Direction; // 0x120
	float PhysImpulseMultiplier; // 0x12c
	FVector PhysicsImpulse; // 0x130
	bool Allow Physics; // 0x13c
	TArray<FName> ExcludedBones; // 0x140
	FYDealtDamageData CurrentDamageData; // 0x150
};

struct USoundNodeSoundClass : USoundNode {
	USoundClass* SoundClassOverride; // 0x48
};

struct UEnvQueryGenerator_OnCircle : UEnvQueryGenerator_ProjectedPoints {
	FAIDataProviderFloatValue CircleRadius; // 0x80
	FAIDataProviderFloatValue SpaceBetween; // 0xb8
	FAIDataProviderIntValue NumberOfPoints; // 0xf0
	EPointOnCircleSpacingMethod PointOnCircleSpacingMethod; // 0x128
	FEnvDirection ArcDirection; // 0x130
	FAIDataProviderFloatValue ArcAngle; // 0x150
	float AngleRadians; // 0x188
	UEnvQueryContext* CircleCenter; // 0x190
	bool bIgnoreAnyContextActorsWhenGeneratingCircle; // 0x198
	FAIDataProviderFloatValue CircleCenterZOffset; // 0x1a0
	FEnvTraceData TraceData; // 0x1d8
	char bDefineArc : 1; // 0x208
};

struct UOperatorField : UFieldNodeBase {
	float Magnitude; // 0xb0
	UFieldNodeBase* RightField; // 0xb8
	UFieldNodeBase* LeftField; // 0xc0
	EFieldOperationType Operation; // 0xc8
};

struct UAISense_Sight : UAISense {
	int32_t MaxTracesPerTick; // 0x148
	int32_t MinQueriesPerTimeSliceCheck; // 0x14c
	double MaxTimeSlicePerTick; // 0x150
	float HighImportanceQueryDistanceThreshold; // 0x158
	float MaxQueryImportance; // 0x160
	float SightLimitQueryImportance; // 0x164
};

struct USubmixEffectTapDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectTapDelaySettings Settings; // 0xa8
};

struct UYWidget_ItemComponentDragAndDropable : UYWidget_ItemComponentBase {
	FMulticastInlineDelegate OnMouseButtonClicked; // 0x300
	FMulticastInlineDelegate OnMouseButtonReleased; // 0x310
	UImage* m_image; // 0x320
};

struct UYPlayerInteractionComponent : UActorComponent {
	UYPlayerCharacterStateComponent* m_cachedOwnerStateComponent; // 0xb0
	FMulticastInlineDelegate OnInteractionUpdate; // 0xb8
	FMulticastInlineDelegate OnInteractionDetected; // 0xc8
	FYPlayerInteraction m_currentInteraction; // 0xd8
	FYServerTracingData m_serverTracingData; // 0x110
	APlayerController* m_debugInfiniteInteractionPlayer; // 0x128
};

struct UYEditableTextBox : UEditableTextBox {
	FMulticastInlineDelegate OnTabPressed; // 0xa38
	FMulticastInlineDelegate OnShiftTabPressed; // 0xa48
	FMulticastInlineDelegate OnUpDownArrowPressed; // 0xa58
	bool m_upDownArrowInputEnabled; // 0xa68
	int32_t m_textLimit; // 0xa6c
};

struct ULandscapeLayerInfoObject : UObject {
	FName LayerName; // 0x28
	UPhysicalMaterial* PhysMaterial; // 0x30
	float Hardness; // 0x38
	FLinearColor LayerUsageDebugColor; // 0x3c
};

struct UEnvQueryTest_InsideWaterBody : UEnvQueryTest {
	bool bIncludeWaves; // 0x1f8
	bool bSimpleWaves; // 0x1f9
	bool bIgnoreExclusionVolumes; // 0x1fa
};

struct UYWidget_ItemComponentTextAmount : UYWidget_ItemComponentBase {
	FMulticastInlineDelegate OnComponentTextAmountUpdated; // 0x300
	int32_t m_amount; // 0x310
	bool m_useBackendData; // 0x314
	bool m_useMinThreshold; // 0x315
	int32_t m_minAmountThresholdToShowWidget; // 0x318
};

struct UMaterialExpressionRotateAboutAxis : UMaterialExpression {
	FExpressionInput NormalizedRotationAxis; // 0x40
	FExpressionInput RotationAngle; // 0x54
	FExpressionInput PivotPoint; // 0x68
	FExpressionInput Position; // 0x7c
	float Period; // 0x90
};

struct UMaterialExpressionMaterialAttributeLayers : UMaterialExpression {
	FName ParameterName; // 0x40
	FGuid ExpressionGUID; // 0x48
	FMaterialAttributesInput Input; // 0x58
	FMaterialLayersFunctions DefaultLayers; // 0x70
	TArray<UMaterialExpressionMaterialFunctionCall*> LayerCallers; // 0xb0
	int32_t NumActiveLayerCallers; // 0xc0
	TArray<UMaterialExpressionMaterialFunctionCall*> BlendCallers; // 0xc8
	int32_t NumActiveBlendCallers; // 0xd8
	bool bIsLayerGraphBuilt; // 0xdc
};

struct AAIController : AController {
	char bStartAILogicOnPossess : 1; // 0x310
	char bStopAILogicOnUnposses : 1; // 0x310
	char bLOSflag : 1; // 0x310
	char bSkipExtraLOSChecks : 1; // 0x310
	char bAllowStrafe : 1; // 0x310
	char bWantsPlayerState : 1; // 0x310
	char bSetControlRotationFromPawnOrientation : 1; // 0x310
	UPathFollowingComponent* PathFollowingComponent; // 0x318
	UBrainComponent* BrainComponent; // 0x320
	UAIPerceptionComponent* PerceptionComponent; // 0x328
	UPawnActionsComponent* ActionsComp; // 0x330
	UBlackboardComponent* Blackboard; // 0x338
	UGameplayTasksComponent* CachedGameplayTasksComponent; // 0x340
	UNavigationQueryFilter* DefaultNavigationFilterClass; // 0x348
	FMulticastInlineDelegate ReceiveMoveCompleted; // 0x350
};

struct APaperSpriteActor : AActor {
	UPaperSpriteComponent* RenderComponent; // 0x240
};

struct AYAITurretController : AAIController {
	bool m_canTargetHumanPlayers; // 0x368
	bool m_canTargetOtherTurrets; // 0x369
	FMulticastInlineDelegate BP_OnAimTargetChanged; // 0x370
	FName m_aimAtCharacterSocketName; // 0x380
	FRotator m_initialAimRotation; // 0x388
	AYTurretPawn* m_controlledTurret; // 0x398
	UBehaviorTree* m_behaviorTree; // 0x3a0
	UAISenseConfig_Sight* m_sightConfig; // 0x3a8
	FYAimTargetInfo m_aimTargetInfo; // 0x3b0
	TArray<AActor*> m_seenEnemyActors; // 0x3c8
};

struct UConstructionSystemUIAsset : UDataAsset {
	FText MenuTitle; // 0x30
	TArray<FConstructionSystemUICategory> Categories; // 0x48
};

struct UEditableGameplayTagQuery : UObject {
	FString UserDescription; // 0x28
	UEditableGameplayTagQueryExpression* RootExpression; // 0x48
	FGameplayTagQuery TagQueryExportText_Helper; // 0x50
};

struct UYAIAnalyticsComponent : UActorComponent {
	TMap<FUniqueNetIdRepl, FYKilledAIAnalyticsEvents> m_killedAIEvents; // 0xb0
	TMap<AYAICharacter*, FYAICombatAnalyticsData> m_aiAnalyticsDataEnties; // 0x100
};

struct UInteractiveTool : UObject {
	UInputBehaviorSet* InputBehaviors; // 0x48
	TArray<UObject*> ToolPropertyObjects; // 0x50
};

struct UParticleSystem : UFXSystemAsset {
	bool m_isForcingParticleSystemComponentWorldScaleOfOne; // 0x30
	float UpdateTime_FPS; // 0x34
	float UpdateTime_Delta; // 0x38
	float WarmupTime; // 0x3c
	float WarmupTickRate; // 0x40
	TArray<UParticleEmitter*> Emitters; // 0x48
	UParticleSystemComponent* PreviewComponent; // 0x58
	UInterpCurveEdSetup* CurveEdSetup; // 0x60
	float LODDistanceCheckTime; // 0x68
	float MacroUVRadius; // 0x6c
	TArray<float> LODDistances; // 0x70
	TArray<FParticleSystemLOD> LODSettings; // 0x80
	FBox FixedRelativeBoundingBox; // 0x90
	float SecondsBeforeInactive; // 0xac
	float Delay; // 0xb0
	float DelayLow; // 0xb4
	char bOrientZAxisTowardCamera : 1; // 0xb8
	char bUseFixedRelativeBoundingBox : 1; // 0xb8
	char bShouldResetPeakCounts : 1; // 0xb8
	char bHasPhysics : 1; // 0xb8
	char bUseRealtimeThumbnail : 1; // 0xb8
	char ThumbnailImageOutOfDate : 1; // 0xb8
	char bUseDelayRange : 1; // 0xb9
	char bAllowManagedTicking : 1; // 0xb9
	char bAutoDeactivate : 1; // 0xb9
	char bRegenerateLODDuplicate : 1; // 0xb9
	EParticleSystemUpdateMode SystemUpdateMode; // 0xba
	ParticleSystemLODMethod LODMethod; // 0xbb
	EParticleSystemInsignificanceReaction InsignificantReaction; // 0xbc
	EParticleSystemOcclusionBoundsMethod OcclusionBoundsMethod; // 0xbd
	EParticleSignificanceLevel MaxSignificanceLevel; // 0xbf
	uint32_t MinTimeBetweenTicks; // 0xc0
	float InsignificanceDelay; // 0xc4
	FVector MacroUVPosition; // 0xc8
	FBox CustomOcclusionBounds; // 0xd4
	TArray<FLODSoloTrack> SoloTracking; // 0xf0
	TArray<FNamedEmitterMaterial> NamedMaterialSlots; // 0x100
};

struct UWBP_InteractionPlate_C : UActorPlate_WBP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3b8
	UWidgetAnimation* ScreenOut_Anim; // 0x3c0
	UWidgetAnimation* ScreenIn_Anim; // 0x3c8
	UWidgetAnimation* Label_FadeIn_InteractionPrompt; // 0x3d0
	UWidgetAnimation* Anim_OnInteraction; // 0x3d8
	UWidgetAnimation* Label_FadeIn; // 0x3e0
	UTextBlock* ActionLabel; // 0x3e8
	UImage* Gfx_Backer; // 0x3f0
	UImage* Gfx_Line; // 0x3f8
	UImage* Img_NPCIcon; // 0x400
	UTextBlock* NameLabel; // 0x408
	UCanvasPanel* PlateLayoutCanvas; // 0x410
	UWBP_InputKey_C* WBP_InputKey; // 0x418
	int32_t showButtonPromptThreshold; // 0x420
	bool isLabelVisible; // 0x424
	AController* PlayerController; // 0x428
	bool isInteractionHintVisible; // 0x430
	bool IsWidgetVisible; // 0x431
	UYControllerStationComponent* controllerStationComponent; // 0x438
	bool AlwaysShowLabel; // 0x440
};

struct AWorldSettings : AInfo {
	int32_t VisibilityCellSize; // 0x248
	EVisibilityAggressiveness VisibilityAggressiveness; // 0x24c
	char bPrecomputeVisibility : 1; // 0x24d
	char bPlaceCellsOnlyAlongCameraTracks : 1; // 0x24d
	char bEnableWorldBoundsChecks : 1; // 0x24d
	char bEnableNavigationSystem : 1; // 0x24d
	char bEnableAISystem : 1; // 0x24d
	char bEnableWorldComposition : 1; // 0x24d
	char bUseClientSideLevelStreamingVolumes : 1; // 0x24d
	char bEnableWorldOriginRebasing : 1; // 0x24d
	char bWorldGravitySet : 1; // 0x24e
	char bGlobalGravitySet : 1; // 0x24e
	char bMinimizeBSPSections : 1; // 0x24e
	char bForceNoPrecomputedLighting : 1; // 0x24e
	char bHighPriorityLoading : 1; // 0x24e
	char bHighPriorityLoadingLocal : 1; // 0x24e
	char bOverrideDefaultBroadphaseSettings : 1; // 0x24e
	UNavigationSystemConfig* NavigationSystemConfig; // 0x250
	UNavigationSystemConfig* NavigationSystemConfigOverride; // 0x258
	float WorldToMeters; // 0x260
	float KillZ; // 0x264
	UDamageType* KillZDamageType; // 0x268
	float WorldGravityZ; // 0x270
	float GlobalGravityZ; // 0x274
	ADefaultPhysicsVolume* DefaultPhysicsVolumeClass; // 0x278
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x280
	AGameModeBase* DefaultGameMode; // 0x288
	AGameNetworkManager* GameNetworkManagerClass; // 0x290
	int32_t PackedLightAndShadowMapTextureSize; // 0x298
	FVector DefaultColorScale; // 0x29c
	float DefaultMaxDistanceFieldOcclusionDistance; // 0x2a8
	float GlobalDistanceFieldViewDistance; // 0x2ac
	float DynamicIndirectShadowsSelfShadowingIntensity; // 0x2b0
	FReverbSettings DefaultReverbSettings; // 0x2b8
	FInteriorSettings DefaultAmbientZoneSettings; // 0x2d8
	float MonoCullingDistance; // 0x2fc
	USoundMix* DefaultBaseSoundMix; // 0x300
	float TimeDilation; // 0x308
	float MatineeTimeDilation; // 0x30c
	float DemoPlayTimeDilation; // 0x310
	float MinGlobalTimeDilation; // 0x314
	float MaxGlobalTimeDilation; // 0x318
	float MinUndilatedFrameTime; // 0x31c
	float MaxUndilatedFrameTime; // 0x320
	FBroadphaseSettings BroadphaseSettings; // 0x324
	APlayerState* Pauser; // 0x368
	TArray<FNetViewer> ReplicationViewers; // 0x370
	TArray<UAssetUserData*> AssetUserData; // 0x380
	APlayerState* PauserPlayerState; // 0x390
	int32_t MaxNumberOfBookmarks; // 0x398
	UBookmarkBase* DefaultBookmarkClass; // 0x3a0
	TArray<UBookmarkBase*> BookmarkArray; // 0x3a8
	UBookmarkBase* LastBookmarkClass; // 0x3b8
};

struct AYLootContainer_Base_BP_C : AYLootContainer {
	UMaterialInstanceDynamic* CrateMaterialInstanceDynamic; // 0x470
	UYObjectInteractionComponent* ObjectInteraction; // 0x478
};

struct UYDismissedPopups : UObject {
	TArray<FString> m_dismissedPopups; // 0x28
};

struct UAISenseConfig : UObject {
	FColor DebugColor; // 0x28
	float MaxAge; // 0x2c
	char bStartsEnabled : 1; // 0x30
};

struct ALandscapeProxy : AActor {
	ULandscapeSplinesComponent* SplineComponent; // 0x240
	FGuid LandscapeGuid; // 0x248
	FIntPoint LandscapeSectionOffset; // 0x258
	int32_t MaxLODLevel; // 0x260
	float LODDistanceFactor; // 0x264
	ELandscapeLODFalloff LODFalloff; // 0x268
	float ComponentScreenSizeToUseSubSections; // 0x26c
	float LOD0ScreenSize; // 0x270
	float LOD0DistributionSetting; // 0x274
	float LODDistributionSetting; // 0x278
	float TessellationComponentScreenSize; // 0x27c
	bool UseTessellationComponentScreenSizeFalloff; // 0x280
	float TessellationComponentScreenSizeFalloff; // 0x284
	int32_t OccluderGeometryLOD; // 0x288
	int32_t StaticLightingLOD; // 0x28c
	UPhysicalMaterial* DefaultPhysMaterial; // 0x290
	float StreamingDistanceMultiplier; // 0x298
	UMaterialInterface* LandscapeMaterial; // 0x2a0
	UMaterialInterface* LandscapeHoleMaterial; // 0x2c8
	TArray<FLandscapeProxyMaterialOverride> LandscapeMaterialsOverride; // 0x2d0
	bool bMeshHoles; // 0x2e0
	char MeshHolesMaxLod; // 0x2e1
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x2e8
	int32_t VirtualTextureNumLods; // 0x2f8
	int32_t VirtualTextureLodBias; // 0x2fc
	ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x300
	float NegativeZBoundsExtension; // 0x304
	float PositiveZBoundsExtension; // 0x308
	TArray<ULandscapeComponent*> LandscapeComponents; // 0x310
	TArray<ULandscapeHeightfieldCollisionComponent*> CollisionComponents; // 0x320
	TArray<UHierarchicalInstancedStaticMeshComponent*> FoliageComponents; // 0x330
	bool bHasLandscapeGrass; // 0x3a4
	float StaticLightingResolution; // 0x3a8
	char CastShadow : 1; // 0x3ac
	char bCastDynamicShadow : 1; // 0x3ac
	char bCastStaticShadow : 1; // 0x3ac
	char bCastFarShadow : 1; // 0x3b0
	char bCastHiddenShadow : 1; // 0x3b4
	char bCastShadowAsTwoSided : 1; // 0x3b8
	char bAffectDistanceFieldLighting : 1; // 0x3bc
	FLightingChannels LightingChannels; // 0x3bd
	char bUseMaterialPositionOffsetInStaticLighting : 1; // 0x3c0
	char bRenderCustomDepth : 1; // 0x3c0
	ERendererStencilMask CustomDepthStencilWriteMask; // 0x3c4
	int32_t CustomDepthStencilValue; // 0x3c8
	float LDMaxDrawDistance; // 0x3cc
	FLightmassPrimitiveSettings LightmassSettings; // 0x3d0
	int32_t CollisionMipLevel; // 0x3e8
	int32_t SimpleCollisionMipLevel; // 0x3ec
	float CollisionThickness; // 0x3f0
	FBodyInstance BodyInstance; // 0x3f8
	char bGenerateOverlapEvents : 1; // 0x550
	char bBakeMaterialPositionOffsetIntoCollision : 1; // 0x550
	int32_t ComponentSizeQuads; // 0x554
	int32_t SubsectionSizeQuads; // 0x558
	int32_t NumSubsections; // 0x55c
	char bUsedForNavigation : 1; // 0x560
	char bFillCollisionUnderLandscapeForNavmesh : 1; // 0x560
	bool bUseDynamicMaterialInstance; // 0x564
	ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x565
	bool bUseLandscapeForCullingInvisibleHLODVertices; // 0x566
	bool bHasLayersContent; // 0x567
	TMap<UTexture2D*, ULandscapeWeightmapUsage*> WeightmapUsageMap; // 0x568
};

struct APRO_ProjectileBounce_BP_C : AYProjectile {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	FVector storePlayerActorLocation; // 0x3a0
	FVector storeTargetLocation; // 0x3ac
	FYAbilityActionBlinkData BlinkInitializationData; // 0x3b8
	FDataTableRowHandle LandingSfx; // 0x460
	float minVelocityPlayLandSfx; // 0x470
	float landingSfxCooldown; // 0x474
	float nextLandingSfxPlayTime; // 0x478
};

struct UMovieSceneActorReferenceSection : UMovieSceneSection {
	FMovieSceneActorReferenceData ActorReferenceData; // 0xe8
	FIntegralCurve ActorGuidIndexCurve; // 0x198
	TArray<FString> ActorGuidStrings; // 0x218
};

struct USoundNodeParamCrossFade : USoundNodeDistanceCrossFade {
	FName ParamName; // 0x58
};

struct UYWidget_ActorPlate : UYWidget {
	UCanvasPanel* m_offscreenRotationContainer; // 0x2c8
	FYWidgetActorPlateInitializationData m_widgetPlateData; // 0x2d0
	UYHealthComponent* m_healthComponent; // 0x360
	UYCharacterDBNOComponent* m_dbnoComponent; // 0x368
	UYPerkComponent* m_perkComponent; // 0x370
	AActor* m_associatedActor; // 0x378
	float m_healthRatio; // 0x380
	bool m_isWorldLocationProjectedOnScreen; // 0x384
	float m_offscreenPositionEdgePercent; // 0x388
	FVector2D m_leftAndUpperEdgePercent; // 0x38c
	FVector2D m_rightAndLowerEdgePercent; // 0x394
	float m_distanceToPlayer; // 0x39c
	bool m_recentlyDamaged; // 0x3a0
	bool m_alwaysVisibleEvenOffScreen; // 0x3a1
	bool m_isInTeam; // 0x3a2
	bool m_isNPCActorPlate; // 0x3a3
	bool m_autoCleanUpOnZeroHealth; // 0x3a4
	bool m_hideOnZeroHealth; // 0x3a5
	bool m_forceNonVisibile; // 0x3a6
};

struct UInterpTrackInstVectorProp : UInterpTrackInstProperty {
	FVector ResetVector; // 0x58
};

struct UMovieSceneEventSection : UMovieSceneSection {
	FNameCurve Events; // 0xe8
	FMovieSceneEventSectionData eventData; // 0x160
};

struct UYWidget_PlayerQuickAction : UYWidget {
	FString m_relatedUID; // 0x2c0
	FString m_playerName; // 0x2d0
	EYQuickActionClick m_action; // 0x2e0
};

struct UGeneralProjectSettings : UObject {
	FString CompanyName; // 0x28
	FString CompanyDistinguishedName; // 0x38
	FString CopyrightNotice; // 0x48
	FString Description; // 0x58
	FString Homepage; // 0x68
	FString LicensingTerms; // 0x78
	FString PrivacyPolicy; // 0x88
	FGuid ProjectID; // 0x98
	FString ProjectName; // 0xa8
	FString ProjectVersion; // 0xb8
	FString SupportContact; // 0xc8
	FText ProjectDisplayedTitle; // 0xd8
	FText ProjectDebugTitleInfo; // 0xf0
	bool bShouldWindowPreserveAspectRatio; // 0x108
	bool bUseBorderlessWindow; // 0x109
	bool bStartInVR; // 0x10a
	bool bAllowWindowResize; // 0x10b
	bool bAllowClose; // 0x10c
	bool bAllowMaximize; // 0x10d
	bool bAllowMinimize; // 0x10e
};

struct UMaterialExpressionDepthFade : UMaterialExpression {
	FExpressionInput InOpacity; // 0x40
	FExpressionInput FadeDistance; // 0x54
	float OpacityDefault; // 0x68
	float FadeDistanceDefault; // 0x6c
};

struct UYMenuLevelActorContainer : UYLevelActorContainer {
	AActor* m_mainCameraActor; // 0x28
	TArray<FYMenuCameraCustomizationCategoryAssociation> m_cameraCustomizationCategorySetup; // 0x30
};

struct UBillboardComponent : UPrimitiveComponent {
	UTexture2D* Sprite; // 0x440
	char bIsScreenSizeScaled : 1; // 0x448
	float ScreenSize; // 0x44c
	float U; // 0x450
	float UL; // 0x454
	float V; // 0x458
	float VL; // 0x45c
};

struct ANavModifierVolume : AVolume {
	UNavArea* AreaClass; // 0x280
	bool bMaskFillCollisionUnderneathForNavmesh; // 0x288
};

struct UPhysicsSpringComponent : USceneComponent {
	float SpringStiffness; // 0x1f8
	float SpringDamping; // 0x1fc
	float SpringLengthAtRest; // 0x200
	float SpringRadius; // 0x204
	ECollisionChannel SpringChannel; // 0x208
	bool bIgnoreSelf; // 0x209
	float SpringCompression; // 0x20c
};

struct USoundNodeModulator : USoundNode {
	float PitchMin; // 0x48
	float PitchMax; // 0x4c
	float VolumeMin; // 0x50
	float VolumeMax; // 0x54
};

struct AYWorldSettings : AWorldSettings {
	bool m_mapHaveLobby; // 0x3c0
	EYMapType m_mapTypeOverride; // 0x3c1
	APlayerStart* m_tutorialStart; // 0x3c8
	FString m_infoDebugString; // 0x3d0
};

struct ADP_Base_BP_C : AYPodActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x288
	UYMapMarkerComponent* YMapMarker; // 0x290
	UYSkeletalMeshComponentFOV* DopPodComponentFOV; // 0x298
	USphereComponent* Sphere; // 0x2a0
	UPointLightComponent* PointLight; // 0x2a8
	UPointLightComponent* lightOrange; // 0x2b0
	UDecalComponent* CraterDecal; // 0x2b8
	UStaticMeshComponent* HiddenShadowCaster; // 0x2c0
	UParticleSystemComponent* window_PS; // 0x2c8
	UParticleSystemComponent* retroThruster_PS; // 0x2d0
	USphereComponent* SphereCollision; // 0x2d8
	UParticleSystemComponent* ground_PS; // 0x2e0
	UPointLightComponent* light_green; // 0x2e8
	UPointLightComponent* light_redFlashing; // 0x2f0
	float Timeline_1_HiddenShadowCaster_2AD71DC7452E2068EE6B52B28D961CF2; // 0x2f8
	ETimelineDirection Timeline_1__Direction_2AD71DC7452E2068EE6B52B28D961CF2; // 0x2fc
	UTimelineComponent* Timeline_2; // 0x300
	FVector Timeline_0_location_3668E36A4761944F15CDCB9D1CE453C5; // 0x308
	float Timeline_0_lightRed_3668E36A4761944F15CDCB9D1CE453C5; // 0x314
	float Timeline_0_lightGreen_3668E36A4761944F15CDCB9D1CE453C5; // 0x318
	float Timeline_0_lightRedFlashing_3668E36A4761944F15CDCB9D1CE453C5; // 0x31c
	ETimelineDirection Timeline_0__Direction_3668E36A4761944F15CDCB9D1CE453C5; // 0x320
	UTimelineComponent* Timeline_1; // 0x328
	FVector StartPosition; // 0x330
	AYPlayerCharacter* CachedPlayerCharacter; // 0x340
	FDataTableRowHandle Landing SFX 1; // 0x348
	FDataTableRowHandle Landing SFX 3; // 0x358
	FDataTableRowHandle retroThrusters; // 0x368
	UAnimMontage* PodOpenHatchAnim; // 0x378
	AYPlayerState* RelevantState; // 0x380
	USoundBase* DropPodMusic; // 0x388
};

struct UYPlayerUIAudioTriggerComponent : UActorComponent {
	UAudioComponent* m_audioComponentLocalLowHealth; // 0xb0
};

struct UWebBrowserAssetManager : UObject {
	TSoftObjectPtr<UMaterial> DefaultMaterial; // 0x28
};

struct UHoverBike_ABP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2c8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x310
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x338
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x360
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x388
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x3b0
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x3d8
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x400
	FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x428
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x450
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x470
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x490
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x598
	FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x618
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x648
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x668
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x688
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x790
	FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x810
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x840
	FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x8c0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x8f0
	FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x9d8
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xa08
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xad0
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0xb50
	FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xc38
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xc68
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xd50
	FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xdf0
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0xeb8
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xf38
	FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1020
	FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1050
	FAnimNode_Slot AnimGraphNode_Slot; // 0x1100
	FAnimNode_Root AnimGraphNode_Root; // 0x1148
	float Direction; // 0x1178
	float Speed; // 0x117c
	FRotator DeltaWorldRotation; // 0x1180
	float TurnSpeedYaw; // 0x118c
	float MoveForwardInputFloat; // 0x1190
	bool TRUE; // 0x1194
	bool doBoost; // 0x1195
	AYVehicle* owningVehicle; // 0x1198
	UYCharacterVehicleComponent* OwningCharVehicleComp; // 0x11a0
};

struct UCreateSessionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct USoundNode : UObject {
	TArray<USoundNode*> ChildNodes; // 0x28
};

struct UInterpTrackInstToggle : UInterpTrackInst {
	ETrackToggleAction Action; // 0x28
	float LastUpdatePosition; // 0x2c
	char bSavedActiveState : 1; // 0x30
};

struct UBehaviorTreeComponent : UBrainComponent {
	TArray<UBTNode*> NodeInstances; // 0x128
	UBehaviorTree* DefaultBehaviorTreeAsset; // 0x278
};

struct UPawnAction : UObject {
	UPawnAction* ChildAction; // 0x28
	UPawnAction* ParentAction; // 0x30
	UPawnActionsComponent* OwnerComponent; // 0x38
	UObject* Instigator; // 0x40
	UBrainComponent* BrainComp; // 0x48
	char bAllowNewSameClassInstance : 1; // 0x80
	char bReplaceActiveSameClassInstance : 1; // 0x80
	char bShouldPauseMovement : 1; // 0x80
	char bAlwaysNotifyOnFinished : 1; // 0x80
};

struct UYDefaultKitDataAsset : UDataAsset {
	bool m_useDefaultKit; // 0x30
	FDataTableRowHandle m_DefaultKit; // 0x38
};

struct UPoseWatch : UObject {
	UEdGraphNode* Node; // 0x28
	FColor PoseWatchColour; // 0x30
};

struct UVOIPTalker : UActorComponent {
	FVoiceSettings Settings; // 0xb0
};

struct USoundNodeMixer : USoundNode {
	TArray<float> InputVolume; // 0x48
};

struct USubmixEffectStereoDelayPreset : USoundEffectSubmixPreset {
	FSubmixEffectStereoDelaySettings Settings; // 0xb4
};

struct UMaterialExpressionDDX : UMaterialExpression {
	FExpressionInput Value; // 0x40
};

struct UPawnAction_Move : UPawnAction {
	AActor* GoalActor; // 0x98
	FVector GoalLocation; // 0xa0
	float AcceptableRadius; // 0xac
	UNavigationQueryFilter* FilterClass; // 0xb0
	char bAllowStrafe : 1; // 0xb8
	char bFinishOnOverlap : 1; // 0xb8
	char bUsePathfinding : 1; // 0xb8
	char bAllowPartialPath : 1; // 0xb8
	char bProjectGoalToNavigation : 1; // 0xb8
	char bUpdatePathToGoal : 1; // 0xb8
	char bAbortChildActionOnPathChange : 1; // 0xb8
};

struct UYControllerItemHoverComponent : UActorComponent {
	UYWidget_ItemContainer* m_currentHoveredItemContainer; // 0xb0
};

struct USoundClass : UObject {
	FSoundClassProperties Properties; // 0x28
	TArray<USoundClass*> ChildClasses; // 0xa8
	TArray<FPassiveSoundMixModifier> PassiveSoundMixModifiers; // 0xb8
	USoundClass* ParentClass; // 0xc8
};

struct UBrainComponent : UActorComponent {
	UBlackboardComponent* BlackboardComp; // 0xb8
	AAIController* AIOwner; // 0xc0
};

struct UYFallingDamageComponent : UActorComponent {
	FMulticastInlineDelegate BP_OnLanded; // 0xc0
	FMulticastInlineDelegate BP_OnLandingDamage; // 0xd0
	FMulticastInlineDelegate BP_OnResetFalling; // 0xe0
	FYFallingDamageInfo m_latestFallDamage; // 0xf0
};

struct UYWidget_ItemTooltipEntryImage : UYWidget_ItemTooltipEntryBase {
	UYWidget_ImageBase* m_image; // 0x2c0
};

struct UYHierarchicalStateMachine : UObject {
	TArray<UYHierarchicalStateBase*> m_stateStack; // 0x28
};

struct UYAudioManager : UObject {
	TArray<UObject*> m_referencingAysncLoadedVoiceLines; // 0x28
	float m_multiplierTransientMasterVolumeDucking; // 0x38
	TArray<FSoftObjectPath> m_audioDataTablesToLoadAsync; // 0x40
	TArray<UDataTable*> m_loadedDatatables; // 0x50
	TMap<FString, FDataTableRowHandle> m_cachedVORowHandles; // 0x68
};

struct UYWidget_GeneralGameSettings : UYWidget {
	UYWidget_SettingsToggle* m_minimapRotationToggle; // 0x2c0
};

struct UYProgressDisplayComponent : UActorComponent {
	FMulticastInlineDelegate OnProgressDisplayReqeuest; // 0xb0
	UYProgressComponent* m_currentProgress; // 0xc0
	TArray<UYProgressComponent*> m_progressStack; // 0xc8
};

struct UParticleModuleVelocityBase : UParticleModule {
	char bInWorldSpace : 1; // 0x30
	char bApplyOwnerScale : 1; // 0x30
};

struct AYHUD : AHUD {
	UYWidget* m_loadingIndicatorWBPClass; // 0x330
	UYProgressDisplayComponent* m_progressDisplayComponent; // 0x338
	FMulticastInlineDelegate OnHudBegunPlay; // 0x340
	UYWidgetUpdater* m_widgetUpdater; // 0x350
	UYScreenSystemRoot* m_screenSystemRoot; // 0x358
	UYScreenBase* m_startScreenClass; // 0x360
	UYHierarchicalStateBase* m_escStateClass; // 0x368
	UYWidgetRootContainer* m_mainContainerClass; // 0x370
	UYLevelActorContainer* m_levelActorContainerClass; // 0x378
	UYDialogContainerBase* m_dialogContainerClass; // 0x380
	UYWidget* m_loadingIndicator; // 0x388
	UYWidgetRootContainer* m_mainContainer; // 0x390
	TArray<UYWidgetProvider*> m_widgetProviders; // 0x3a8
};

struct USoundNodeWaveParam : USoundNode {
	FName WaveParameterName; // 0x48
};

struct UParticleModuleBeamModifier : UParticleModuleBeamBase {
	BeamModifierType modifierType; // 0x30
	FBeamModifierOptions PositionOptions; // 0x34
	FRawDistributionVector Position; // 0x38
	FBeamModifierOptions TangentOptions; // 0x80
	FRawDistributionVector Tangent; // 0x88
	char bAbsoluteTangent : 1; // 0xd0
	FBeamModifierOptions StrengthOptions; // 0xd4
	FRawDistributionFloat Strength; // 0xd8
};

struct UEnvQueryOption : UObject {
	UEnvQueryGenerator* Generator; // 0x28
	TArray<UEnvQueryTest*> Tests; // 0x30
};

struct UGeometryCacheComponent : UMeshComponent {
	UGeometryCache* GeometryCache; // 0x468
	bool bRunning; // 0x470
	bool bLooping; // 0x471
	float StartTimeOffset; // 0x474
	float PlaybackSpeed; // 0x478
	int32_t NumTracks; // 0x47c
	float elapsedTime; // 0x480
	float Duration; // 0x4b4
	bool bManualTick; // 0x4b8
};

struct UYWidget_Map : UYWidget {
	UTextureRenderTarget2D* m_levelTextureRender; // 0x2c0
	FVector2D m_maximizedSize; // 0x2c8
	FVector2D m_minimapSize; // 0x2d0
	float m_minimapViewportSize; // 0x2d8
	float m_fogOfWarUncoverSmoothEdge; // 0x2dc
	float m_playersSeeingRadius; // 0x2e0
	bool m_maximizedByDefault; // 0x2e4
	bool m_orientationPictureVisible; // 0x2e5
	bool m_allowUserInput; // 0x2e6
	UMaterialInterface* m_minimapMaterial; // 0x2e8
	UCanvasPanel* m_mapCanvas; // 0x2f0
	UCanvasPanel* m_projectionCanvas; // 0x2f8
	UCanvasPanel* m_fullscreenCanvas; // 0x300
	UImage* m_mapBackground; // 0x308
	UImage* m_imageOrientationIcon; // 0x310
	UYWidget_HeatMap* m_heatMapWidget; // 0x318
	bool m_hideCursor; // 0x320
	bool m_isFogOfWarActive; // 0x321
	float m_cachedRotationAngle; // 0x324
	UTextureRenderTarget2D* m_fogOfWarMaskRenderTarget2D; // 0x328
	UMaterial* m_fogOfWarDrawMaskMaterial; // 0x330
	UMaterialInstanceDynamic* m_fogOfWarDrawMaskMaterialInstance; // 0x338
	UMaterialInstanceDynamic* m_fogOfWarTextureMaterial; // 0x340
	float m_minimizedAutoZoomLevel; // 0x348
	float m_maximizedAutoZoomLevel; // 0x34c
	bool m_isMaximized; // 0x350
	TMap<EYMapMarkerType, UYWidget_MapMarker*> m_widgetTypeToClassMap; // 0x358
	TMap<UYMapMarkerData*, UYWidget_MapMarker*> m_widgetMap; // 0x3a8
	UYWidget_MapMarker* m_defaultMapMarkerType; // 0x3f8
	UYWidgetPool* m_widgetPool; // 0x400
	UTexture* m_levelTexture; // 0x408
	float m_borderIconOffsetFactor; // 0x464
};

struct UMovieSceneBuiltInEasingFunction : UObject {
	EMovieSceneBuiltInEasing Type; // 0x30
};

struct UYWidget_PerformantScroll : UYWidget {
	UYWidget* m_entryWBP; // 0x2c0
	UVerticalBox* m_entriesBox; // 0x2c8
	USpacer* m_frontSpacer; // 0x2d0
	USpacer* m_backSpacer; // 0x2d8
	bool m_dummyMode; // 0x2e0
	bool m_debugMode; // 0x2e1
	int32_t m_debugVisibleEntriesAmount; // 0x2e4
	int32_t m_debugMaxEntriesAmount; // 0x2e8
};

struct UYWidget_TopMenuSubButton : UYWidget {
	UYWidget_TopMenuBarButton* m_topMenuButton; // 0x2d0
	UBorder* m_borderDivider; // 0x2d8
};

struct UOnboarding_03_MatchPickUpAndEscape_C : UMS_Line_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1b0
	FName SceneToInteract; // 0x1b8
	TArray<FTransform> EscapeTerminalTransforms; // 0x1c0
	TArray<EYContractStatus> ContractStatusToCheck; // 0x1d0
	bool hintIndicatorCreated; // 0x1e0
	TArray<FYContractRow> Contract Config Data; // 0x1e8
	TArray<FTransform> ContractActorTransforms; // 0x1f8
	FDataTableRowHandle launchTerminalSceneRowHandle; // 0x208
	FDataTableRowHandle icaNPCRowName; // 0x218
	FDataTableRowHandle korolevNPCRowName; // 0x228
	FDataTableRowHandle osirisNPCRowName; // 0x238
};

struct UARComponent : USceneComponent {
	FGuid NativeID; // 0x1f8
	bool bUseDefaultReplication; // 0x238
	UMaterialInterface* DefaultMeshMaterial; // 0x240
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x248
	UMRMeshComponent* MRMeshComponent; // 0x250
	UARTrackedGeometry* MyTrackedGeometry; // 0x258
};

struct UNiagaraScript : UNiagaraScriptBase {
	ENiagaraScriptUsage Usage; // 0x28
	int32_t UsageIndex; // 0x2c
	FGuid UsageId; // 0x30
	FNiagaraParameterStore RapidIterationParameters; // 0x40
	FNiagaraScriptExecutionParameterStore ScriptExecutionParamStore; // 0xb8
	TArray<FNiagaraBoundParameter> ScriptExecutionBoundParameters; // 0x150
	FNiagaraVMExecutableDataId CachedScriptVMId; // 0x160
	FNiagaraVMExecutableData CachedScriptVM; // 0x1b8
	TArray<UNiagaraParameterCollection*> CachedParameterCollectionReferences; // 0x298
	TArray<FNiagaraScriptDataInterfaceInfo> CachedDefaultDataInterfaces; // 0x2a8
};

struct UPaperTileLayer : UObject {
	FText LayerName; // 0x28
	int32_t LayerWidth; // 0x40
	int32_t LayerHeight; // 0x44
	char bHiddenInGame : 1; // 0x48
	char bLayerCollides : 1; // 0x48
	char bOverrideCollisionThickness : 1; // 0x48
	char bOverrideCollisionOffset : 1; // 0x48
	float CollisionThicknessOverride; // 0x4c
	float CollisionOffsetOverride; // 0x50
	FLinearColor LayerColor; // 0x54
	int32_t AllocatedWidth; // 0x64
	int32_t AllocatedHeight; // 0x68
	TArray<FPaperTileInfo> AllocatedCells; // 0x70
	UPaperTileSet* TileSet; // 0x80
	TArray<int32_t> AllocatedGrid; // 0x88
};

struct UYWidget_MapMarker : UYWidget {
	EYMapLayerIndex m_zOrderIndex; // 0x2c1
	UYMapMarkerData* m_markerInfo; // 0x2c8
	UTextBlock* m_distanceText; // 0x2d0
};

struct UYPowerUpMapMarkerData : UYMapMarkerData {
	int32_t m_powerUpProgress; // 0x148
	int32_t m_powerUpSteps; // 0x14c
	FText m_powerUpText; // 0x150
};

struct UARFaceComponent : UARComponent {
	EARFaceTransformMixing TransformSetting; // 0x278
	bool bUpdateVertexNormal; // 0x279
	bool bFaceOutOfScreen; // 0x27a
	FARFaceUpdatePayload ReplicatedPayload; // 0x280
};

struct UAREnvironmentProbeComponent : UARComponent {
	FAREnvironmentProbeUpdatePayload ReplicatedPayload; // 0x280
};

struct AARSharedWorldGameState : AGameState {
	TArray<char> PreviewImageData; // 0x2b0
	TArray<char> ARWorldData; // 0x2c0
	int32_t PreviewImageBytesTotal; // 0x2d0
	int32_t ARWorldBytesTotal; // 0x2d4
	int32_t PreviewImageBytesDelivered; // 0x2d8
	int32_t ARWorldBytesDelivered; // 0x2dc
};

struct USoundNodeAttenuation : USoundNode {
	USoundAttenuation* AttenuationSettings; // 0x48
	FSoundAttenuationSettings AttenuationOverrides; // 0x50
	char bOverrideAttenuation : 1; // 0x3f0
};

struct UEditableGameplayTagQueryExpression_AllTagsMatch : UEditableGameplayTagQueryExpression {
	FGameplayTagContainer Tags; // 0x28
};

struct ARecastNavMesh : ANavigationData {
	char bDrawTriangleEdges : 1; // 0x448
	char bDrawPolyEdges : 1; // 0x448
	char bDrawFilledPolys : 1; // 0x448
	char bDrawNavMeshEdges : 1; // 0x448
	char bDrawTileBounds : 1; // 0x448
	char bDrawPathCollidingGeometry : 1; // 0x448
	char bDrawTileLabels : 1; // 0x448
	char bDrawPolygonLabels : 1; // 0x448
	char bDrawDefaultPolygonCost : 1; // 0x449
	char bDrawLabelsOnPathNodes : 1; // 0x449
	char bDrawNavLinks : 1; // 0x449
	char bDrawFailedNavLinks : 1; // 0x449
	char bDrawClusters : 1; // 0x449
	char bDrawOctree : 1; // 0x449
	char bDrawOctreeDetails : 1; // 0x449
	char bDrawMarkedForbiddenPolys : 1; // 0x449
	char bDistinctlyDrawTilesBeingBuilt : 1; // 0x44a
	float DrawOffset; // 0x44c
	char bFixedTilePoolSize : 1; // 0x450
	int32_t TilePoolSize; // 0x454
	float TileSizeUU; // 0x458
	float CellSize; // 0x45c
	float CellHeight; // 0x460
	float AgentRadius; // 0x464
	float AgentHeight; // 0x468
	float AgentMaxSlope; // 0x46c
	float AgentMaxStepHeight; // 0x470
	float MinRegionArea; // 0x474
	float MergeRegionSize; // 0x478
	float MaxSimplificationError; // 0x47c
	int32_t MaxSimultaneousTileGenerationJobsCount; // 0x480
	int32_t TileNumberHardLimit; // 0x484
	int32_t PolyRefTileBits; // 0x488
	int32_t PolyRefNavPolyBits; // 0x48c
	int32_t PolyRefSaltBits; // 0x490
	FVector NavMeshOriginOffset; // 0x494
	float DefaultDrawDistance; // 0x4a0
	float DefaultMaxSearchNodes; // 0x4a4
	float DefaultMaxHierarchicalSearchNodes; // 0x4a8
	ERecastPartitioning RegionPartitioning; // 0x4ac
	ERecastPartitioning LayerPartitioning; // 0x4ad
	int32_t RegionChunkSplits; // 0x4b0
	int32_t LayerChunkSplits; // 0x4b4
	char bSortNavigationAreasByCost : 1; // 0x4b8
	char bPerformVoxelFiltering : 1; // 0x4b8
	char bMarkLowHeightAreas : 1; // 0x4b8
	char bUseExtraTopCellWhenMarkingAreas : 1; // 0x4b8
	char bFilterLowSpanSequences : 1; // 0x4b8
	char bFilterLowSpanFromTileCache : 1; // 0x4b8
	char bDoFullyAsyncNavDataGathering : 1; // 0x4b8
	char bUseBetterOffsetsFromCorners : 1; // 0x4b8
	char bStoreEmptyTileLayers : 1; // 0x4b9
	char bUseVirtualFilters : 1; // 0x4b9
	char bAllowNavLinkAsPathEnd : 1; // 0x4b9
	char bUseVoxelCache : 1; // 0x4b9
	float TileSetUpdateInterval; // 0x4bc
	float HeuristicScale; // 0x4c0
	float VerticalDeviationFromGroundCompensation; // 0x4c4
};

struct UYPlayerRenderTargetVfxMovementComponent_BP_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	FVector lastTrailPos; // 0xb8
	FVector ParentPosition; // 0xc4
	float DeltaTime; // 0xd0
	float Size; // 0xd4
	bool isLocalPlayerPawn; // 0xd8
	float OpacityPerStepSize; // 0xdc
	float OpacityPerSecondWhenStanding; // 0xe0
	float frequencyScaling; // 0xe4
	bool isPlayerPawn; // 0xe8
	UYHealthComponent* healthComponent; // 0xf0
	UYUserSettings* userSettings; // 0xf8
	bool isGrassEnabled; // 0x100
	FVector ParentPositionLastTick; // 0x104
	FVector ParentPositionLast2Ticks; // 0x110
	EMovementMode lastMovementState; // 0x11c
	AYPlayerCharacter* Player; // 0x120
	TArray<FVector> parentPositions; // 0x128
	int32_t currentParentPositionIndex; // 0x138
	int32_t rememberParentPositions; // 0x13c
	TArray<FVector> trailPositions; // 0x140
	int32_t currentTrailPositionIndex; // 0x150
	TArray<bool> Landing; // 0x158
	TArray<float> movementDelta; // 0x168
	FVector LastLandingPosition; // 0x178
	float LastUpdate; // 0x184
	FVector CurrentParentPosition; // 0x188
};

struct UWrapBox : UPanelWidget {
	FVector2D InnerSlotPadding; // 0x120
	float WrapWidth; // 0x128
	float WrapSize; // 0x12c
	bool bExplicitWrapWidth; // 0x130
	bool bExplicitWrapSize; // 0x131
	EOrientation Orientation; // 0x132
};

struct UWBP_Notification_Item_C : UUserWidget {
	UWidgetAnimation* WidgetOut_Anim; // 0x260
	UWidgetAnimation* WidgetIn_Anim; // 0x268
	UImage* Gfx_BackerFill; // 0x270
	UImage* Gfx_BackerFillColorA; // 0x278
	UImage* Gfx_BackerFillColorB; // 0x280
	UImage* Gfx_BackerFillGradient; // 0x288
	UImage* Gfx_BackerFillLight; // 0x290
	UImage* Gfx_Chevrons; // 0x298
	UImage* Icn_NotificationType; // 0x2a0
	UImage* Icn_NotificationType_Shadow; // 0x2a8
	URichTextBlock* RichTxt_Headline; // 0x2b0
	URichTextBlock* RichTxt_Subline; // 0x2b8
	UWBP_ProgressBar_C* WBP_ProgressBar; // 0x2c0
};

struct UWBP_DragAndDrop_HighlightArea_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* Anim_Highlight; // 0x2c8
	UWidgetAnimation* ScreenIn_Anim; // 0x2d0
	UImage* Mat_DragDrop; // 0x2d8
};

struct UMaterialExpressionOneMinus : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UYWidget_MatchmakingInfo : UYWidget {
	UYWidget_Timer* m_matchmakingQueuingTimeTimer; // 0x2c0
};

struct ULandscapeMeshProxyComponent : UStaticMeshComponent {
	FGuid LandscapeGuid; // 0x4d0
	TArray<FIntPoint> ProxyComponentBases; // 0x4e0
	int8_t ProxyLOD; // 0x4f0
};

struct UARTextureCameraDepth : UARTexture {
	EARDepthQuality DepthQuality; // 0xf8
	EARDepthAccuracy DepthAccuracy; // 0xf9
	bool bIsTemporallySmoothed; // 0xfa
};

struct UInterpTrackInstFloatParticleParam : UInterpTrackInst {
	float ResetFloat; // 0x28
};

struct UYGlobalAudio : UObject {
	UAudioComponent* m_worldMusicComponent; // 0x28
};

struct UYWidget_InventorySlotItem : UYWidget {
	int32_t m_indexWeaponInventorySlot; // 0x2c0
};

struct UGameplayTasksComponent : UActorComponent {
	char bIsNetDirty : 1; // 0xbc
	TArray<UGameplayTask*> SimulatedTasks; // 0xc0
	TArray<UGameplayTask*> TaskPriorityQueue; // 0xd0
	TArray<UGameplayTask*> TickingTasks; // 0xf0
	TArray<UGameplayTask*> KnownTasks; // 0x100
	FMulticastInlineDelegate OnClaimedResourcesChange; // 0x110
};

struct UYWidget_BinaryOptionToggle : UYWidget {
	UButton* m_leftOptionButton; // 0x2d0
	UButton* m_rightOptionButton; // 0x2d8
	UTextBlock* m_leftOptionTextBlock; // 0x2e0
	UTextBlock* m_leftOptionTextBlockSelected; // 0x2e8
	UTextBlock* m_rightOptionTextBlock; // 0x2f0
	UTextBlock* m_rightOptionTextBlockSelected; // 0x2f8
	FText m_leftOptionText; // 0x300
	FText m_rightOptionText; // 0x318
};

struct UAICharacterPlate_WBP_C : UYWidget_ActorPlate {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3a8
	UWidgetAnimation* FadeOutOnDeath; // 0x3b0
	UWidgetAnimation* FadeIn; // 0x3b8
	UWidgetAnimation* FadeOut; // 0x3c0
	UHorizontalBox* buffs; // 0x3c8
	UCanvasPanel* CanvasPanel_DeathIcon; // 0x3d0
	UCanvasPanel* ContentHolder; // 0x3d8
	UImage* EvacIcon; // 0x3e0
	UImage* HuntIcon; // 0x3e8
	UHorizontalBox* Top; // 0x3f0
	UWBP_HealthBar_HUD_Item_C* UI_HealthBarWithDelta_WBP; // 0x3f8
	FLinearColor Color_Nameplate_Name; // 0x400
	FString PerkString; // 0x410
	TArray<UUI_ImageBase_WBP_C*> PerkIconContainers; // 0x420
	TArray<TSoftObjectPtr<UTexture2D>> activePerkIcons; // 0x430
	TArray<FDataTableRowHandle> AI_RanksToHide; // 0x440
	FText String_Context; // 0x450
	UYUserSettings* userSettings; // 0x468
};

struct UBTDecorator_TagCooldown : UBTDecorator {
	FGameplayTag CooldownTag; // 0x68
	float CooldownDuration; // 0x70
	bool bAddToExistingDuration; // 0x74
	bool bActivatesCooldown; // 0x75
};

struct URendererSettings : UDeveloperSettings {
	char bMobileDisableVertexFog : 1; // 0x38
	int32_t MaxMobileCascades; // 0x3c
	EMobileMSAASampleCount MobileMSAASampleCount; // 0x40
	char bMobileAllowDitheredLODTransition : 1; // 0x44
	char bMobileAllowSoftwareOcclusionCulling : 1; // 0x44
	char bMobileVirtualTextures : 1; // 0x44
	char bDiscardUnusedQualityLevels : 1; // 0x44
	char bOcclusionCulling : 1; // 0x44
	float MinScreenRadiusForLights; // 0x48
	float MinScreenRadiusForEarlyZPass; // 0x4c
	float MinScreenRadiusForCSMdepth; // 0x50
	char bPrecomputedVisibilityWarning : 1; // 0x54
	char bTextureStreaming : 1; // 0x54
	char bUseDXT5NormalMaps : 1; // 0x54
	char bVirtualTextures : 1; // 0x54
	char bVirtualTexturedLightmaps : 1; // 0x54
	uint32_t VirtualTextureTileSize; // 0x58
	uint32_t VirtualTextureTileBorderSize; // 0x5c
	uint32_t VirtualTextureFeedbackFactor; // 0x60
	char bVirtualTextureEnableCompressZlib : 1; // 0x64
	char bVirtualTextureEnableCompressCrunch : 1; // 0x64
	char bClearCoatEnableSecondNormal : 1; // 0x64
	int32_t ReflectionCaptureResolution; // 0x68
	char bReflectionCaptureCompression : 1; // 0x6c
	char ReflectionEnvironmentLightmapMixBasedOnRoughness : 1; // 0x6c
	char bForwardShading : 1; // 0x6c
	char bVertexFoggingForOpaque : 1; // 0x6c
	char bAllowStaticLighting : 1; // 0x6c
	char bUseNormalMapsForStaticLighting : 1; // 0x6c
	char bGenerateMeshDistanceFields : 1; // 0x6c
	char bEightBitMeshDistanceFields : 1; // 0x6c
	char bGenerateLandscapeGIData : 1; // 0x6d
	char bCompressMeshDistanceFields : 1; // 0x6d
	float TessellationAdaptivePixelsPerTriangle; // 0x70
	char bSeparateTranslucency : 1; // 0x74
	ETranslucentSortPolicy TranslucentSortPolicy; // 0x78
	FVector TranslucentSortAxis; // 0x7c
	ECustomDepthStencil CustomDepthStencil; // 0x88
	char bCustomDepthTaaJitter : 1; // 0x8c
	EAlphaChannelMode bEnableAlphaChannelInPostProcessing; // 0x90
	char bDefaultFeatureBloom : 1; // 0x94
	char bDefaultFeatureAmbientOcclusion : 1; // 0x94
	char bDefaultFeatureAmbientOcclusionStaticFraction : 1; // 0x94
	char bDefaultFeatureAutoExposure : 1; // 0x94
	EAutoExposureMethodUI DefaultFeatureAutoExposure; // 0x98
	float DefaultFeatureAutoExposureBias; // 0x9c
	char bExtendDefaultLuminanceRangeInAutoExposureSettings : 1; // 0xa0
	char bUsePreExposure : 1; // 0xa0
	char bEnablePreExposureOnlyInTheEditor : 1; // 0xa0
	char bDefaultFeatureMotionBlur : 1; // 0xa0
	char bDefaultFeatureLensFlare : 1; // 0xa0
	char bTemporalUpsampling : 1; // 0xa0
	char bSSGI : 1; // 0xa0
	EAntiAliasingMethod DefaultFeatureAntiAliasing; // 0xa4
	ELightUnits DefaultLightUnits; // 0xa5
	EDefaultBackBufferPixelFormat DefaultBackBufferPixelFormat; // 0xa6
	char bRenderUnbuiltPreviewShadowsInGame : 1; // 0xa8
	char bStencilForLODDither : 1; // 0xa8
	EEarlyZPass EarlyZPass; // 0xac
	char bEarlyZPassOnlyMaterialMasking : 1; // 0xb0
	char bDBuffer : 1; // 0xb0
	EClearSceneOptions ClearSceneMethod; // 0xb4
	char bBasePassOutputsVelocity : 1; // 0xb8
	char bVertexDeformationOutputsVelocity : 1; // 0xb8
	char bSelectiveBasePassOutputs : 1; // 0xb8
	char bDefaultParticleCutouts : 1; // 0xb8
	int32_t GPUSimulationTextureSizeX; // 0xbc
	int32_t GPUSimulationTextureSizeY; // 0xc0
	char bGlobalClipPlane : 1; // 0xc4
	EGBufferFormat GBufferFormat; // 0xc8
	char bUseGPUMorphTargets : 1; // 0xcc
	char bNvidiaAftermathEnabled : 1; // 0xcc
	bool m_enableRhiThread; // 0xd0
	char bMultiView : 1; // 0xd4
	char bMobilePostProcessing : 1; // 0xd4
	char bMobileMultiView : 1; // 0xd4
	char bMobileUseHWsRGBEncoding : 1; // 0xd4
	char bRoundRobinOcclusion : 1; // 0xd4
	char bODSCapture : 1; // 0xd4
	char bMeshStreaming : 1; // 0xd4
	float WireframeCullThreshold; // 0xd8
	char bEnableRayTracing : 1; // 0xdc
	char bEnableRayTracingTextureLOD : 1; // 0xdc
	char bSupportStationarySkylight : 1; // 0xdc
	char bSupportLowQualityLightmaps : 1; // 0xdc
	char bSupportPointLightWholeSceneShadows : 1; // 0xdc
	char bSupportAtmosphericFog : 1; // 0xdc
	char bSupportSkyAtmosphere : 1; // 0xdc
	char bSupportSkyAtmosphereAffectsHeightFog : 1; // 0xdc
	char bSupportSkinCacheShaders : 1; // 0xdd
	ESkinCacheDefaultBehavior DefaultSkinCacheBehavior; // 0xe0
	float SkinCacheSceneMemoryLimitInMB; // 0xe4
	char bMobileEnableStaticAndCSMShadowReceivers : 1; // 0xe8
	char bMobileEnableMovableLightCSMShaderCulling : 1; // 0xe8
	char bMobileAllowDistanceFieldShadows : 1; // 0xe8
	char bMobileAllowMovableDirectionalLights : 1; // 0xe8
	uint32_t MobileNumDynamicPointLights; // 0xec
	char bMobileDynamicPointLightsUseStaticBranch : 1; // 0xf0
	char bMobileAllowMovableSpotlights : 1; // 0xf0
	char bMobileAllowMovableSpotlightShadows : 1; // 0xf0
	char bSupport16BitBoneIndex : 1; // 0xf0
	char bGPUSkinLimit2BoneInfluences : 1; // 0xf0
	char bSupportDepthOnlyIndexBuffers : 1; // 0xf0
	char bSupportReversedIndexBuffers : 1; // 0xf0
	char bLPV : 1; // 0xf0
	char bMobileAmbientOcclusion : 1; // 0xf1
	char bUseUnlimitedBoneInfluences : 1; // 0xf1
	int32_t UnlimitedBonInfluencesThreshold; // 0xf4
	EMobilePlanarReflectionMode MobilePlanarReflectionMode; // 0xf8
	FPerPlatformBool bStreamSkeletalMeshLODs; // 0xf9
	FPerPlatformBool bDiscardSkeletalMeshOptionalLODs; // 0xfa
	FSoftObjectPath VisualizeCalibrationColorMaterialPath; // 0x100
	FSoftObjectPath VisualizeCalibrationCustomMaterialPath; // 0x118
	FSoftObjectPath VisualizeCalibrationGrayscaleMaterialPath; // 0x130
};

struct UUI_AnnouncementIndicator_WBP_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UImage* Image_Icon; // 0x268
	UObject* AssociatedPlayerState; // 0x270
};

struct UContextMenu_FriendsList_WBP_C : UYWidget_ChatUserMenu {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* FadeIn; // 0x2f8
	UHorizontalBox* addFriendPanel; // 0x300
	UYButton* addFriendYButton; // 0x308
	UYTextBlock* addFriendYTextBlock; // 0x310
	UHorizontalBox* blockUserPanel; // 0x318
	UYButton* blockUserYButton; // 0x320
	UYTextBlock* blockUserYTextBlock; // 0x328
	UHorizontalBox* ChatMutePanel; // 0x330
	UYButton* chatMuteYButton; // 0x338
	UYTextBlock* chatMuteYTextBlock; // 0x340
	UYButton* closeMenuYButton; // 0x348
	UHorizontalBox* inviteToSquadPanel; // 0x350
	UYButton* inviteToSquadYButton; // 0x358
	UYTextBlock* inviteToSquadYTextBlock; // 0x360
	UHorizontalBox* leaveSquadPanel; // 0x368
	UYButton* leaveSquadYButton; // 0x370
	UYTextBlock* leaveSquadYTextBlock; // 0x378
	UYTextBlock* playerNameYTextBlock; // 0x380
	UHorizontalBox* removeFriendPanel; // 0x388
	UYButton* removeFriendYButton; // 0x390
	UYTextBlock* removeFriendYTextBlock; // 0x398
	UHorizontalBox* ReportPanel; // 0x3a0
	UYButton* reportYButton; // 0x3a8
	UYTextBlock* reportYTextBlock; // 0x3b0
	UHorizontalBox* VoiceChatMutePanel; // 0x3b8
	UYButton* voicechatMuteYButton; // 0x3c0
	UYTextBlock* voiceChatMuteYTextBlock; // 0x3c8
	UYTextBlock* YTextBlock_2; // 0x3d0
};

struct UWBP_SettingEntry_Item_C : UYWidgetView_SettingEntry {
	FPointerToUberGraphFrame UberGraphFrame; // 0x348
	UWidgetAnimation* HighlightBracket_Anim; // 0x350
	UButton* ButtonComponent; // 0x358
	UNamedSlot* ButtonSlot; // 0x360
	UImage* Gfx_BackerDisable; // 0x368
	UImage* Gfx_BackerFill_Dark; // 0x370
	UImage* Gfx_BackerFill_Light; // 0x378
	UInvalidationBox* InvalidationBox_1; // 0x380
	UTextBlock* Txt_SettingLabel; // 0x388
	UWBP_SelectionBracket_C* WBP_SelectionBracket; // 0x390
	FText SettingLabel; // 0x398
	bool Disabled; // 0x3b0
};

struct UYPermanentAssetData : UDataAsset {
	TArray<UObject*> m_hardReferencedObjects; // 0x30
};

struct UGeometryCollectionDebugDrawComponent : UActorComponent {
	AGeometryCollectionDebugDrawActor* GeometryCollectionDebugDrawActor; // 0xb0
	AGeometryCollectionRenderLevelSetActor* GeometryCollectionRenderLevelSetActor; // 0xb8
};

struct UObjectLibrary : UObject {
	UObject* ObjectBaseClass; // 0x28
	bool bHasBlueprintClasses; // 0x30
	TArray<UObject*> Objects; // 0x38
	TArray<TWeakObjectPtr<UObject>> WeakObjects; // 0x48
	bool bUseWeakReferences; // 0x58
	bool bIsFullyLoaded; // 0x59
};

struct UWBP_CelebrationBacker_Panel_B_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UCanvasPanel* ArrowAnims; // 0x2c8
	UBackgroundBlur* Bg_Blur; // 0x2d0
	UBorder* BG_ColorTint; // 0x2d8
	UImage* Gfx_BackerDark; // 0x2e0
	UImage* Gfx_BackerTint; // 0x2e8
	UImage* Gfx_BackerTint_2; // 0x2f0
	UImage* Gfx_BackerTint_3; // 0x2f8
	UImage* Gfx_BackerTint_4; // 0x300
	UImage* Gfx_BackerTint_5; // 0x308
	UImage* Gfx_CelebrationBacker; // 0x310
	UImage* Gfx_CelebrationBacker2; // 0x318
	UImage* Gfx_CelebrationBacker3; // 0x320
	UImage* Gfx_CelebrationBacker4; // 0x328
	UImage* M_Pattern; // 0x330
	UImage* M_Pattern_Blurred; // 0x338
	FColor BG_Color; // 0x340
	float BlurOpacity; // 0x344
	float BGTintOpacity; // 0x348
	bool UseArrowAnim; // 0x34c
};

struct UBlendSpace : UBlendSpaceBase {
	EBlendSpaceAxis AxisToScaleAnimation; // 0x148
};

struct UInputRouter : UObject {
	bool bAutoInvalidateOnHover; // 0x28
	bool bAutoInvalidateOnCapture; // 0x29
	UInputBehaviorSet* ActiveInputBehaviors; // 0x38
};

struct UDatasmithSceneComponentTemplate : UDatasmithObjectTemplate {
	FTransform RelativeTransform; // 0x30
	EComponentMobility Mobility; // 0x60
	TSoftObjectPtr<USceneComponent> AttachParent; // 0x68
	bool bVisible; // 0x90
	TSet<FName> Tags; // 0x98
};

struct UYBTTask_PlayAnimation : UBTTask_BlueprintBase {
	AYAICharacter* m_characterAIOwner; // 0xa8
	UAnimInstance* m_animInstance; // 0xb0
	UAnimMontage* m_animationMontage; // 0xb8
	EYAnimTaskFinishCondition m_taskFinishCondition; // 0xc0
	FBlackboardKeySelector m_blackboardValueToObserve; // 0xc8
	bool m_expectedValueAfterChange; // 0xf0
	float m_timeBeforeMontageEnds; // 0xf4
	FName m_montageSectionToPlay; // 0xf8
};

struct UWBP_HealthBar_HUD_Item_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* HitFlash_AI; // 0x268
	UWidgetAnimation* HitFlash; // 0x270
	UProgressBar* HealthBarProgress_Delta; // 0x278
	UProgressBar* HealthProgressBar; // 0x280
	UYCharacterDBNOComponent* dbnoComp; // 0x288
	float HealthTimeLeftUntilProgressDeltaStarts; // 0x290
	float ShieldTimeLeftUntilProgressDeltaStarts; // 0x294
	AYCharacter* Character; // 0x298
	bool UseAIColorScheme; // 0x2a0
	AActor* ActorOwner; // 0x2a8
	float LastTImeDeltaBarTicked; // 0x2b0
	float TimeThresholdSinceLastUpdateToResetDeltaProgression; // 0x2b4
};

struct UMapMarker_NPC_WBP_C : UYWidget_MapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UWidgetAnimation* Warning; // 0x2e8
	UUI_ImageBase_WBP_C* Image; // 0x2f0
	UTextBlock* Title; // 0x2f8
	bool CanGetFinalUpdate; // 0x300
	bool ApplyFinalUpdate; // 0x301
	bool IsOwnedByLocalPlayer; // 0x302
	bool IsOwnedByTeamMateOfLocalPlayer; // 0x303
	bool WasPreviouslyOwnedByLocalPlayer; // 0x304
	bool WasPreviouslyOwnedByTeamMateOfLocalPlayer; // 0x305
	APlayerState* LocalPlayerState; // 0x308
	bool AssignedIcon; // 0x310
};

struct UDeviceProfileManager : UObject {
	TArray<UObject*> Profiles; // 0x28
};

struct UPhononOcclusionSourceSettings : UOcclusionPluginSourceSettingsBase {
	EIplDirectOcclusionMode DirectOcclusionMode; // 0x28
	EIplDirectOcclusionMethod DirectOcclusionMethod; // 0x29
	float DirectOcclusionSourceRadius; // 0x2c
	bool DirectAttenuation; // 0x30
	bool AirAbsorption; // 0x31
};

struct UTimelineComponent : UActorComponent {
	FTimeline TheTimeline; // 0xb0
	char bIgnoreTimeDilation : 1; // 0x148
};

struct UYAIManager : UActorComponent {
	TArray<AYAICharacter*> m_aiCharacters; // 0xb0
	TArray<FYAISpawnRequest> m_spawnRequests; // 0xc0
	TArray<FSoftObjectPath> m_objectsRequestedAsyncLoadFor; // 0xd0
	TArray<UObject*> m_objectsLoaded; // 0xe8
	FMulticastInlineDelegate BP_OnAICharacterAdded; // 0x108
	FMulticastInlineDelegate BP_OnAICharacterRemoved; // 0x118
	FMulticastInlineDelegate BP_OnAISquadDetermineAIsToSpawn; // 0x128
	bool m_shouldSpawnPrototypeAIVersions; // 0x138
	FDataTableRowHandle m_rowHandleForAISpawnCharacters; // 0x140
};

struct UInterpTrackInstFloatMaterialParam : UInterpTrackInst {
	TArray<UMaterialInstanceDynamic*> MaterialInstances; // 0x28
	TArray<float> ResetFloats; // 0x38
	TArray<FPrimitiveMaterialRef> PrimitiveMaterialRefs; // 0x48
	UInterpTrackFloatMaterialParam* InstancedTrack; // 0x58
};

struct ASceneCapture2D : ASceneCapture {
	USceneCaptureComponent2D* CaptureComponent2D; // 0x250
};

struct UEditableStaticMeshAdapter : UEditableMeshAdapter {
	UStaticMesh* StaticMesh; // 0x28
	UStaticMesh* OriginalStaticMesh; // 0x30
	int32_t StaticMeshLODIndex; // 0x38
};

struct UMaterialExpressionInverseLinearInterpolate : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Value; // 0x68
	float ConstA; // 0x7c
	float ConstB; // 0x80
	float ConstValue; // 0x84
	bool bClampResult; // 0x88
};

struct UYWidget_EomRewardsPanel : UYWidget {
	UHorizontalBox* m_mainHorizontalBox; // 0x2c0
	TArray<UYWidget_ItemContainer*> m_rewardEntries; // 0x2c8
	bool m_expandElementsToFullWidth; // 0x2d8
	bool m_displayRarityHeaders; // 0x2d9
};

struct UNavigationSystemConfig : UObject {
	FSoftClassPath NavigationSystemClass; // 0x28
	FNavAgentSelector SupportedAgentsMask; // 0x40
	FName DefaultAgentName; // 0x44
	char bIsOverriden : 1; // 0x4c
};

struct UMovieSceneTrackInstanceSystem : UMovieSceneEntitySystem {
	UMovieSceneTrackInstanceInstantiator* Instantiator; // 0x40
};

struct UYWidget_ItemComponentRarityColor : UYWidget_ItemComponentBase {
	FMulticastInlineDelegate OnItemRarityColorSet; // 0x300
	FSlateColor m_rarityColor; // 0x310
};

struct UBTService_RunEQS : UBTService_BlackboardBase {
	FEQSParametrizedQueryExecutionRequest EQSRequest; // 0x98
};

struct UMaterialInterface : UObject {
	bool m_canBeOverridenWithCloakMaterial; // 0x38
	bool m_validationOfUsedMaterials; // 0x39
	USubsurfaceProfile* SubsurfaceProfile; // 0x40
	FLightmassMaterialInterfaceSettings LightmassSettings; // 0x58
	TArray<FMaterialTextureInfo> TextureStreamingData; // 0x68
	TArray<UAssetUserData*> AssetUserData; // 0x78
};

struct UMovieSceneCameraAnimSection : UMovieSceneSection {
	FMovieSceneCameraAnimSectionData AnimData; // 0xe8
	UCameraAnim* CameraAnim; // 0x108
	float PlayRate; // 0x110
	float PlayScale; // 0x114
	float BlendInTime; // 0x118
	float BlendOutTime; // 0x11c
	bool bLooping; // 0x120
};

struct UConstructionSystemRemoveTool : UConstructionSystemTool {
	float TraceDistance; // 0x30
	TWeakObjectPtr<APrefabActor> FocusedActor; // 0x34
};

struct UPlatformGameInstance : UGameInstance {
	FMulticastInlineDelegate ApplicationWillDeactivateDelegate; // 0x1a8
	FMulticastInlineDelegate ApplicationHasReactivatedDelegate; // 0x1b8
	FMulticastInlineDelegate ApplicationWillEnterBackgroundDelegate; // 0x1c8
	FMulticastInlineDelegate ApplicationHasEnteredForegroundDelegate; // 0x1d8
	FMulticastInlineDelegate ApplicationWillTerminateDelegate; // 0x1e8
	FMulticastInlineDelegate ApplicationShouldUnloadResourcesDelegate; // 0x1f8
	FMulticastInlineDelegate ApplicationReceivedStartupArgumentsDelegate; // 0x208
	FMulticastInlineDelegate ApplicationRegisteredForRemoteNotificationsDelegate; // 0x218
	FMulticastInlineDelegate ApplicationRegisteredForUserNotificationsDelegate; // 0x228
	FMulticastInlineDelegate ApplicationFailedToRegisterForRemoteNotificationsDelegate; // 0x238
	FMulticastInlineDelegate ApplicationReceivedRemoteNotificationDelegate; // 0x248
	FMulticastInlineDelegate ApplicationReceivedLocalNotificationDelegate; // 0x258
	FMulticastInlineDelegate ApplicationReceivedScreenOrientationChangedNotificationDelegate; // 0x268
};

struct UYWidget_ModalDialogScrapItem : UYWidget_ModalDialogOkCancel {
	UYWidget_ValueCompareDisplay* m_materialDisplayClass; // 0x338
};

struct ANavSystemConfigOverride : AActor {
	UNavigationSystemConfig* NavigationSystemConfig; // 0x240
	ENavSystemOverridePolicy OverridePolicy; // 0x248
	char bLoadOnClient : 1; // 0x249
};

struct UInteractionAnimComponent_BP_C : UActorComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	USkeletalMeshComponent* FirstPersonSkeletalMeshComponent; // 0xb8
	AStaticMeshActor* SpawnedPickupMeshVisualActor; // 0xc0
	UAnimMontage* PickUpAnimationMontage; // 0xc8
};

struct UParticleModuleLocationPrimitiveBase : UParticleModuleLocationBase {
	char Positive_X : 1; // 0x30
	char Positive_Y : 1; // 0x30
	char Positive_Z : 1; // 0x30
	char Negative_X : 1; // 0x30
	char Negative_Y : 1; // 0x30
	char Negative_Z : 1; // 0x30
	char SurfaceOnly : 1; // 0x30
	char Velocity : 1; // 0x30
	FRawDistributionFloat VelocityScale; // 0x38
	FRawDistributionVector StartLocation; // 0x68
};

struct UParticleModuleRotationRateMultiplyLife : UParticleModuleRotationRateBase {
	FRawDistributionFloat LifeMultiplier; // 0x30
};

struct UConstantQNRT : UAudioSynesthesiaNRT {
	UConstantQNRTSettings* Settings; // 0x78
};

struct UWBP_RetentionBonusItem_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Claimed_Anim; // 0x268
	UNamedSlot* ContentSlot; // 0x270
	UBorder* Day; // 0x278
	UImage* Gfx_Bg_Gradient; // 0x280
	UImage* Gfx_Bg_Gradient_Anim; // 0x288
	UImage* Gfx_Preview; // 0x290
	UImage* Gfx_Success; // 0x298
	UImage* Gfx_Success_Bg; // 0x2a0
	UImage* Gfx_Success_Stroke; // 0x2a8
	UWBP_Item_Preview_Btn_C* ItemPreview; // 0x2b0
	USizeBox* ItemSize; // 0x2b8
	UTextBlock* Txt_Day; // 0x2c0
	FText SetDay; // 0x2c8
	float SetWidth; // 0x2e0
	float SetHeight; // 0x2e4
	FDataTableRowHandle ClaimedSoundFx; // 0x2e8
};

struct UBrushBaseProperties : UInteractiveToolPropertySet {
	float BrushSize; // 0x60
	bool bSpecifyRadius; // 0x64
	float BrushRadius; // 0x68
	float BrushStrength; // 0x6c
	float BrushFalloffAmount; // 0x70
	bool bShowStrength; // 0x74
	bool bShowFalloff; // 0x75
};

struct UMovieSceneMediaPlayerPropertySection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLoop; // 0xf0
};

struct UWBP_SettingsContent_Video_C : UWBP_SettingsContentBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Antialiasing; // 0x348
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_ColorblindMode; // 0x350
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_DLSSMode; // 0x358
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Foliage; // 0x360
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_FullscreenMode; // 0x368
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Postprocess; // 0x370
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Resolution; // 0x378
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Shadow; // 0x380
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_Texture; // 0x388
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_ViewDistance; // 0x390
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn_VisualEffects; // 0x398
	UWBP_Dropdown_Btn_C* WBP_Dropdown_VideoQuality_Btn; // 0x3a0
	UWBP_Selector_Btn_C* WBP_Selector_Btn_ColorblindIntensity; // 0x3a8
	UWBP_Selector_Btn_C* WBP_Selector_Btn_Fov; // 0x3b0
	UWBP_Selector_Btn_C* WBP_Selector_Btn_Gamma; // 0x3b8
	UWBP_Selector_Btn_C* WBP_Selector_Btn_MaxFps; // 0x3c0
	UWBP_Selector_Btn_C* WBP_Selector_Btn_ResolutionQuality; // 0x3c8
	UWBP_Selector_Btn_C* WBP_Selector_Btn_UIScale; // 0x3d0
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_AntiAliasingQuality; // 0x3d8
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_AutoDetect; // 0x3e0
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ColorblindMode; // 0x3e8
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_CorrectDeficiency; // 0x3f0
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_CrashDebugging; // 0x3f8
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_DLSSMode; // 0x400
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FoilageQuality; // 0x408
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FOV; // 0x410
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_FullscreenMode; // 0x418
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_Gamma; // 0x420
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ImageSharpening; // 0x428
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MaxFPS; // 0x430
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MotionBlur; // 0x438
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_MultiThreadRendering; // 0x440
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_PostProcessQuality; // 0x448
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_Resolution; // 0x450
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ResolutionQuality; // 0x458
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ShadowQuality; // 0x460
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ShowFPS; // 0x468
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_TextureQuality; // 0x470
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_UIScale; // 0x478
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VideoQuality; // 0x480
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_ViewDistanceQuality; // 0x488
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VisualEffectsQuality; // 0x490
	UWBP_SettingEntry_Item_C* WBP_SettingEntry_Item_VSync; // 0x498
	UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_Accessibility; // 0x4a0
	UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_VideoQuality; // 0x4a8
	UWBP_SettingSectionHeader_Item_C* WBP_SettingSectionHeader_VideoQuality_2; // 0x4b0
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_AutoDetect; // 0x4b8
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_GpuCrashDebugging; // 0x4c0
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_ImageSharpening; // 0x4c8
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_MotionBlur; // 0x4d0
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_MultithreadedRendering; // 0x4d8
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_ShowFps; // 0x4e0
	UWBP_ToggleText_Btn_C* WBP_ToggleText_Btn_Vsync; // 0x4e8
	FText Label; // 0x4f0
	TMap<FString, EYGfxQualityPreset> GFXSettings; // 0x508
};

struct UYAbilityAnalyticsComponent : UActorComponent {
	TArray<FYAbilityAnalyticsPerPlayer> m_abilityPerPlayerAnalytics; // 0xb0
};

struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	FName ParameterName; // 0x50
	FVector MinInput; // 0x58
	FVector MaxInput; // 0x64
	FVector MinOutput; // 0x70
	FVector MaxOutput; // 0x7c
	DistributionParamMode ParamModes[0x3]; // 0x88
};

struct UYSoundNodeLocalPlayer : USoundNode {
	bool m_previewPlayForceOutputLocal; // 0x48
};

struct UDistributionFloatConstantCurve : UDistributionFloat {
	FInterpCurveFloat ConstantCurve; // 0x38
};

struct UYWidget_SetItemList : UYWidget {
	FMulticastInlineDelegate OnAllItemsSpawnedEvent; // 0x2c8
	FYPlayerInventory m_cachedStash; // 0x2d8
	bool m_inventoryWidgetsInitialized; // 0x2f0
	TMap<int32_t, FYInventoryItem> m_itemUiData; // 0x2f8
	TMap<FString, int32_t> m_cachedIdToRequestHandle; // 0x348
	TMap<FString, EYItemRarityType> m_cachedRarities; // 0x398
	TMap<FString, int32_t> m_cachedItemAmount; // 0x3e8
};

struct UCullingField : UFieldNodeBase {
	UFieldNodeBase* Culling; // 0xb0
	UFieldNodeBase* Field; // 0xb8
	EFieldCullingOperationType Operation; // 0xc0
};

struct UCrowdManager : UCrowdManagerBase {
	ANavigationData* MyNavData; // 0x28
	TArray<FCrowdAvoidanceConfig> AvoidanceConfig; // 0x30
	TArray<FCrowdAvoidanceSamplingPattern> SamplingPatterns; // 0x40
	int32_t MaxAgents; // 0x50
	float MaxAgentRadius; // 0x54
	int32_t MaxAvoidedAgents; // 0x58
	int32_t MaxAvoidedWalls; // 0x5c
	float NavmeshCheckInterval; // 0x60
	float PathOptimizationInterval; // 0x64
	float SeparationDirClamp; // 0x68
	float PathOffsetRadiusMultiplier; // 0x6c
	char bResolveCollisions : 1; // 0x70
};

struct UBTTask_PlaySpawnAnimation_C : UYBTTask_PlayAnimation {
	FPointerToUberGraphFrame UberGraphFrame; // 0x110
	FBlackboardKeySelector KeySpawnAnimationPlayed; // 0x118
};

struct UEdGraphPin_Deprecated : UObject {
	FString PinName; // 0x28
	FString PinToolTip; // 0x38
	EEdGraphPinDirection Direction; // 0x48
	FEdGraphPinType PinType; // 0x50
	FString DefaultValue; // 0xa8
	FString AutogeneratedDefaultValue; // 0xb8
	UObject* DefaultObject; // 0xc8
	FText DefaultTextValue; // 0xd0
	TArray<UEdGraphPin_Deprecated*> LinkedTo; // 0xe8
	TArray<UEdGraphPin_Deprecated*> SubPins; // 0xf8
	UEdGraphPin_Deprecated* ParentPin; // 0x108
	UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x110
};

struct UWBP_Objective_HUD_Item_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Txt_Objective; // 0x268
	UWBP_Checkbox_C* WBP_Checkbox; // 0x270
	UWBP_DividerHorizontal_VarA_Panel_C* WBP_DividerHorizontal_VarA_Panel; // 0x278
	FText ObjectiveText; // 0x280
	bool ShowDivide; // 0x298
};

struct UMaterialExpressionChannelMaskParameter : UMaterialExpressionVectorParameter {
	EChannelMaskParameterColor MaskChannel; // 0x70
};

struct UMaterialExpressionComment : UMaterialExpression {
	int32_t SizeX; // 0x40
	int32_t SizeY; // 0x44
	FString Text; // 0x48
	FLinearColor CommentColor; // 0x58
	int32_t FontSize; // 0x68
};

struct UYAssetCheckerDataAsset : UDataAsset {
	TMap<UObject*, FYAssetValidatorEntry> m_validationEntries; // 0x30
	TSoftObjectPtr<UDataAsset> m_dataValidatorPath; // 0x80
};

struct UYActorWidgetSimple : UYActorWidget {
	UImage* m_image; // 0x388
	UTextBlock* m_title; // 0x390
	UTextBlock* m_playerName; // 0x398
	UTextBlock* m_distanceText; // 0x3a0
};

struct AGeometryCollectionDebugDrawActor : AActor {
	FGeometryCollectionDebugDrawWarningMessage WarningMessage; // 0x240
	FGeometryCollectionDebugDrawActorSelectedRigidBody SelectedRigidBody; // 0x248
	bool bDebugDrawWholeCollection; // 0x260
	bool bDebugDrawHierarchy; // 0x261
	bool bDebugDrawClustering; // 0x262
	EGeometryCollectionDebugDrawActorHideGeometry HideGeometry; // 0x263
	bool bShowRigidBodyId; // 0x264
	bool bShowRigidBodyCollision; // 0x265
	bool bCollisionAtOrigin; // 0x266
	bool bShowRigidBodyTransform; // 0x267
	bool bShowRigidBodyInertia; // 0x268
	bool bShowRigidBodyVelocity; // 0x269
	bool bShowRigidBodyForce; // 0x26a
	bool bShowRigidBodyInfos; // 0x26b
	bool bShowTransformIndex; // 0x26c
	bool bShowTransform; // 0x26d
	bool bShowParent; // 0x26e
	bool bShowLevel; // 0x26f
	bool bShowConnectivityEdges; // 0x270
	bool bShowGeometryIndex; // 0x271
	bool bShowGeometryTransform; // 0x272
	bool bShowBoundingBox; // 0x273
	bool bShowFaces; // 0x274
	bool bShowFaceIndices; // 0x275
	bool bShowFaceNormals; // 0x276
	bool bShowSingleFace; // 0x277
	int32_t SingleFaceIndex; // 0x278
	bool bShowVertices; // 0x27c
	bool bShowVertexIndices; // 0x27d
	bool bShowVertexNormals; // 0x27e
	bool bUseActiveVisualization; // 0x27f
	float PointThickness; // 0x280
	float LineThickness; // 0x284
	bool bTextShadow; // 0x288
	float TextScale; // 0x28c
	float NormalScale; // 0x290
	float AxisScale; // 0x294
	float ArrowScale; // 0x298
	FColor RigidBodyIdColor; // 0x29c
	float RigidBodyTransformScale; // 0x2a0
	FColor RigidBodyCollisionColor; // 0x2a4
	FColor RigidBodyInertiaColor; // 0x2a8
	FColor RigidBodyVelocityColor; // 0x2ac
	FColor RigidBodyForceColor; // 0x2b0
	FColor RigidBodyInfoColor; // 0x2b4
	FColor TransformIndexColor; // 0x2b8
	float TransformScale; // 0x2bc
	FColor LevelColor; // 0x2c0
	FColor ParentColor; // 0x2c4
	float ConnectivityEdgeThickness; // 0x2c8
	FColor GeometryIndexColor; // 0x2cc
	float GeometryTransformScale; // 0x2d0
	FColor BoundingBoxColor; // 0x2d4
	FColor FaceColor; // 0x2d8
	FColor FaceIndexColor; // 0x2dc
	FColor FaceNormalColor; // 0x2e0
	FColor SingleFaceColor; // 0x2e4
	FColor VertexColor; // 0x2e8
	FColor VertexIndexColor; // 0x2ec
	FColor VertexNormalColor; // 0x2f0
	UBillboardComponent* SpriteComponent; // 0x2f8
};

struct UTransformProxy : UObject {
	bool bRotatePerObject; // 0x70
	bool bSetPivotMode; // 0x71
	FTransform SharedTransform; // 0x90
	FTransform InitialSharedTransform; // 0xc0
};

struct UBTService_AIState_C : UBTService_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0x98
	EYAIState NewAIState; // 0xa0
	FBlackboardKeySelector AIStateKey; // 0xa8
};

struct USlateAccessibleWidgetData : UObject {
	bool bCanChildrenBeAccessible; // 0x28
	ESlateAccessibleBehavior AccessibleBehavior; // 0x29
	ESlateAccessibleBehavior AccessibleSummaryBehavior; // 0x2a
	FText AccessibleText; // 0x30
	FDelegate AccessibleTextDelegate; // 0x48
	FText AccessibleSummaryText; // 0x58
	FDelegate AccessibleSummaryTextDelegate; // 0x70
};

struct AYActivityLocation : AActor {
	EYActivityLocationStatus m_status; // 0x240
	float m_respawnBlockTime; // 0x244
	UYMapMarkerComponent* m_debugMapMarkerComponent; // 0x248
	TArray<EYActivityType> m_compatibleActivities; // 0x250
	EYActivityType m_activityType; // 0x260
	float m_spawnWeight; // 0x264
	FTimerHandle m_timerHandleFreeLocation; // 0x268
	FMulticastInlineDelegate BP_OnStatusChanged; // 0x270
	bool m_isGenericActivityLocation; // 0x280
	float m_spawnRadiusOverride; // 0x284
};

struct UMovieSceneCompiledData : UObject {
	FMovieSceneEvaluationTemplate EvaluationTemplate; // 0x28
	FMovieSceneSequenceHierarchy Hierarchy; // 0x188
	FMovieSceneEntityComponentField EntityComponentField; // 0x2a0
	FMovieSceneEvaluationField TrackTemplateField; // 0x390
	TArray<FFrameTime> DeterminismFences; // 0x3c0
	FGuid CompiledSignature; // 0x3d0
	FGuid CompilerVersion; // 0x3e0
	FMovieSceneSequenceCompilerMaskStruct AccumulatedMask; // 0x3f0
	FMovieSceneSequenceCompilerMaskStruct AllocatedMask; // 0x3f1
	EMovieSceneSequenceFlags AccumulatedFlags; // 0x3f2
};

struct UYWidgetPoolManager : UObject {
	TMap<FSoftObjectPath, int32_t> m_widgetClassToPoolInMenuMap; // 0x28
	TMap<FSoftObjectPath, int32_t> m_widgetClassToPoolInGameMap; // 0x78
	TArray<UUserWidget*> m_pooledWidgets; // 0xc8
};

struct UMovieSceneAudioSection : UMovieSceneSection {
	USoundBase* Sound; // 0xe8
	FFrameNumber StartFrameOffset; // 0xf0
	float StartOffset; // 0xf4
	float AudioStartTime; // 0xf8
	float AudioDilationFactor; // 0xfc
	float AudioVolume; // 0x100
	FMovieSceneFloatChannel SoundVolume; // 0x108
	FMovieSceneFloatChannel PitchMultiplier; // 0x1a8
	FMovieSceneActorReferenceData AttachActorData; // 0x248
	bool bLooping; // 0x2f8
	bool bSuppressSubtitles; // 0x2f9
	bool bOverrideAttenuation; // 0x2fa
	USoundAttenuation* AttenuationSettings; // 0x300
	FDelegate OnQueueSubtitles; // 0x308
	FMulticastInlineDelegate OnAudioFinished; // 0x318
	FMulticastInlineDelegate OnAudioPlaybackPercent; // 0x328
};

struct UGizmoPlaneScaleParameterSource : UGizmoBaseVec2ParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float ScaleMultiplier; // 0xb0
	FVector2D Parameter; // 0xb4
	FGizmoVec2ParameterChange LastChange; // 0xbc
	FVector CurScaleOrigin; // 0xcc
	FVector CurScaleNormal; // 0xd8
	FVector CurScaleAxisX; // 0xe4
	FVector CurScaleAxisY; // 0xf0
	FTransform InitialTransform; // 0x100
};

struct UWBP_ItemTooltip_C : UYWidgetView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UWidgetAnimation* ScreenIn_Anim; // 0x340
	UImage* Gfx_BottomEdge; // 0x348
	UImage* Gfx_BottomEdge_Triangle; // 0x350
	UImage* Gfx_BottomEdge_Triangle_Outer; // 0x358
	UImage* Gfx_Shadow; // 0x360
	UImage* Gfx_TopEdge; // 0x368
	UImage* Gfx_TopEdge_Triangle; // 0x370
	UImage* Gfx_TopEdge_Triangle_Outer; // 0x378
	UImage* m_Gfx_Item_Dynamic_2; // 0x380
	UWBP_BlurBacker_Panel_C* WBP_Deco_BlurPanel; // 0x388
	UWBP_InputKeyNavigation_C* WBP_InputKeyNavigation; // 0x390
	UWBP_ItemDetails_C* WBP_ItemDetails; // 0x398
	UYWidget_ItemContainer* parentItemContainer; // 0x3a0
	FDataTableRowHandle AttachmentScreenRebindableInput; // 0x3a8
	bool bShowAttachmentScreenKey; // 0x3b8
	bool CanBeCleared; // 0x3b9
};

struct UYMetaQuestPlayerInstanceComponent : UActorComponent {
	FMulticastInlineDelegate OnMissionStateUpdated; // 0xb0
	FYMissionRuntimeInitializationData m_runtimeInitializationData; // 0xc0
	FDataTableRowHandle m_rowHandle; // 0xf0
	TMap<int32_t, FYMissionStepProgressEntry> m_stepEntries; // 0x108
	FYMissionReplicatedStateData m_missionReplicatedStateData; // 0x160
};

struct UAISenseEvent_Damage : UAISenseEvent {
	FAIDamageEvent Event; // 0x28
};

struct UOnboarding_01_TalkToBadum_C : UMS_Line_Base_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x1b0
	FName SceneToInteract; // 0x1b8
	TArray<FName> ContractNPCS; // 0x1c0
	TArray<EYContractStatus> ContractStatusToCheck; // 0x1d0
	FDataTableRowHandle missionSceneRowHandle; // 0x1e0
	FDataTableRowHandle contractSceneRowHandle; // 0x1f0
	FName badumId; // 0x200
	FName contractsId; // 0x208
};

struct AGeometryCollectionRenderLevelSetActor : AActor {
	UVolumeTexture* TargetVolumeTexture; // 0x240
	UMaterial* RayMarchMaterial; // 0x248
	float SurfaceTolerance; // 0x250
	float Isovalue; // 0x254
	bool Enabled; // 0x258
	bool RenderVolumeBoundingBox; // 0x259
};

struct UParticleModuleLocationEmitter : UParticleModuleLocationBase {
	FName EmitterName; // 0x30
	ELocationEmitterSelectionMethod SelectionMethod; // 0x38
	char InheritSourceVelocity : 1; // 0x3c
	float InheritSourceVelocityScale; // 0x40
	char bInheritSourceRotation : 1; // 0x44
	float InheritSourceRotationScale; // 0x48
};

struct UAnimationSharingSetup : UObject {
	TArray<FPerSkeletonAnimationSharingSetup> SkeletonSetups; // 0x28
	FAnimationSharingScalability ScalabilitySettings; // 0x38
};

struct UCameraComponent : USceneComponent {
	float FieldOfView; // 0x1f8
	float OrthoWidth; // 0x1fc
	float OrthoNearClipPlane; // 0x200
	float OrthoFarClipPlane; // 0x204
	float AspectRatio; // 0x208
	char bConstrainAspectRatio : 1; // 0x20c
	char bUseFieldOfViewForLOD : 1; // 0x20c
	char bLockToHmd : 1; // 0x20c
	char bUsePawnControlRotation : 1; // 0x20c
	ECameraProjectionMode ProjectionMode; // 0x20d
	float PostProcessBlendWeight; // 0x240
	FPostProcessSettings PostProcessSettings; // 0x270
};

struct UYActivityComponent : UActorComponent {
	bool m_destroySkeletalMeshesOnDedicatedServer; // 0xb0
	bool m_isPlacedInWorld; // 0xb1
	AYActivityActorManager* m_activityActorManager; // 0xb8
	UYActivityRegisterComponent* m_registerComponent; // 0xc0
	AYActivityLocation* m_activityLocation; // 0xc8
	bool m_isMarkedAsDepleted; // 0xd0
	FString m_activitySubType; // 0xd8
	FString m_actorBIName; // 0xe8
	FMulticastInlineDelegate OnActivityActorDepleted; // 0xf8
	FMulticastInlineDelegate OnActivitySetupComplete; // 0x108
	FMulticastInlineDelegate OnActivitySetupCompletePlacedInWorld; // 0x118
};

struct USimpleConstructionScript : UObject {
	TArray<USCS_Node*> RootNodes; // 0x28
	TArray<USCS_Node*> AllNodes; // 0x38
	USCS_Node* DefaultSceneRootNode; // 0x48
};

struct UMaterial : UMaterialInterface {
	UPhysicalMaterial* PhysMaterial; // 0x90
	UPhysicalMaterialMask* PhysMaterialMask; // 0x98
	UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0xa0
	FScalarMaterialInput Metallic; // 0xe0
	FScalarMaterialInput Specular; // 0xf4
	FScalarMaterialInput Anisotropy; // 0x108
	FVectorMaterialInput Normal; // 0x11c
	FVectorMaterialInput Tangent; // 0x130
	FColorMaterialInput EmissiveColor; // 0x144
	EMaterialDomain MaterialDomain; // 0x158
	EBlendMode BlendMode; // 0x159
	EDecalBlendMode DecalBlendMode; // 0x15a
	EMaterialDecalResponse MaterialDecalResponse; // 0x15b
	EMaterialShadingModel ShadingModel; // 0x15c
	char bCastDynamicShadowAsMasked : 1; // 0x15d
	FMaterialShadingModelField ShadingModels; // 0x15e
	float OpacityMaskClipValue; // 0x160
	FVectorMaterialInput WorldPositionOffset; // 0x164
	FScalarMaterialInput Refraction; // 0x178
	FMaterialAttributesInput MaterialAttributes; // 0x18c
	FScalarMaterialInput PixelDepthOffset; // 0x1a4
	FShadingModelMaterialInput ShadingModelFromMaterialExpression; // 0x1b8
	char bEnableSeparateTranslucency : 1; // 0x1cc
	char bEnableResponsiveAA : 1; // 0x1cc
	char bScreenSpaceReflections : 1; // 0x1cc
	char bContactShadows : 1; // 0x1cc
	char TwoSided : 1; // 0x1cc
	char DitheredLODTransition : 1; // 0x1cc
	char DitherOpacityMask : 1; // 0x1cc
	char bAllowNegativeEmissiveColor : 1; // 0x1cc
	ETranslucencyLightingMode TranslucencyLightingMode; // 0x1cd
	char bEnableMobileSeparateTranslucency : 1; // 0x1ce
	int32_t NumCustomizedUVs; // 0x1d0
	float TranslucencyDirectionalLightingIntensity; // 0x1d4
	float TranslucentShadowDensityScale; // 0x1d8
	float TranslucentSelfShadowDensityScale; // 0x1dc
	float TranslucentSelfShadowSecondDensityScale; // 0x1e0
	float TranslucentSelfShadowSecondOpacity; // 0x1e4
	float TranslucentBackscatteringExponent; // 0x1e8
	FLinearColor TranslucentMultipleScatteringExtinction; // 0x1ec
	float TranslucentShadowStartOffset; // 0x1fc
	char bDisableDepthTest : 1; // 0x200
	char bWriteOnlyAlpha : 1; // 0x200
	char bGenerateSphericalParticleNormals : 1; // 0x200
	char bTangentSpaceNormal : 1; // 0x200
	char bUseEmissiveForDynamicAreaLighting : 1; // 0x200
	char bBlockGI : 1; // 0x200
	char bUsedAsSpecialEngineMaterial : 1; // 0x200
	char bUsedWithSkeletalMesh : 1; // 0x200
	char bUsedWithEditorCompositing : 1; // 0x201
	char bUsedWithParticleSprites : 1; // 0x201
	char bUsedWithBeamTrails : 1; // 0x201
	char bUsedWithMeshParticles : 1; // 0x201
	char bUsedWithNiagaraSprites : 1; // 0x201
	char bUsedWithNiagaraRibbons : 1; // 0x201
	char bUsedWithNiagaraMeshParticles : 1; // 0x201
	char bUsedWithGeometryCache : 1; // 0x201
	char bUsedWithStaticLighting : 1; // 0x202
	char bUsedWithMorphTargets : 1; // 0x202
	char bUsedWithSplineMeshes : 1; // 0x202
	char bUsedWithInstancedStaticMeshes : 1; // 0x202
	char bUsedWithGeometryCollections : 1; // 0x202
	char bUsesDistortion : 1; // 0x202
	char bUsedWithClothing : 1; // 0x202
	char bUsedWithWater : 1; // 0x204
	char bUsedWithHairStrands : 1; // 0x204
	char bUsedWithLidarPointCloud : 1; // 0x204
	char bUsedWithVirtualHeightfieldMesh : 1; // 0x204
	char bUsedWithUI : 1; // 0x208
	char bAutomaticallySetUsageInEditor : 1; // 0x208
	char bFullyRough : 1; // 0x208
	char bUseFullPrecision : 1; // 0x208
	char bUseLightmapDirectionality : 1; // 0x208
	char bUseAlphaToCoverage : 1; // 0x208
	char bForwardRenderUsePreintegratedGFForSimpleIBL : 1; // 0x20c
	char bUseHQForwardReflections : 1; // 0x210
	char bUsePlanarForwardReflections : 1; // 0x210
	char bNormalCurvatureToRoughness : 1; // 0x210
	EMaterialTessellationMode D3D11TessellationMode; // 0x211
	char bEnableCrackFreeDisplacement : 1; // 0x212
	char bEnableAdaptiveTessellation : 1; // 0x212
	char AllowTranslucentCustomDepthWrites : 1; // 0x212
	char Wireframe : 1; // 0x212
	EMaterialShadingRate ShadingRate; // 0x213
	char bCanMaskedBeAssumedOpaque : 1; // 0x214
	char bIsMasked : 1; // 0x214
	char bIsPreviewMaterial : 1; // 0x214
	char bIsFunctionPreviewMaterial : 1; // 0x214
	char bUseMaterialAttributes : 1; // 0x214
	char bCastRayTracedShadows : 1; // 0x214
	char bUseTranslucencyVertexFog : 1; // 0x214
	char bApplyCloudFogging : 1; // 0x214
	char bIsSky : 1; // 0x215
	char bComputeFogPerPixel : 1; // 0x215
	char bOutputTranslucentVelocity : 1; // 0x215
	char bAllowDevelopmentShaderCompile : 1; // 0x215
	char bIsMaterialEditorStatsMaterial : 1; // 0x215
	EBlendableLocation BlendableLocation; // 0x216
	char BlendableOutputAlpha : 1; // 0x217
	char bEnableStencilTest : 1; // 0x217
	EMaterialStencilCompare StencilCompare; // 0x218
	char StencilRefValue; // 0x219
	ERefractionMode RefractionMode; // 0x21a
	int32_t BlendablePriority; // 0x21c
	char bIsBlendable : 1; // 0x220
	uint32_t UsageFlagWarnings; // 0x224
	float RefractionDepthBias; // 0x228
	FGuid StateId; // 0x22c
	float MaxDisplacement; // 0x23c
	FMaterialCachedExpressionData CachedExpressionData; // 0x270
};

struct UYWeaponAnalyticsComponent : UActorComponent {
	TMap<FUniqueNetIdRepl, FYWeaponAnalyticsPerPlayer> m_weaponAnalyticsPerPlayer; // 0xb0
};

struct UTestScreen1 : UTestState1 {
	TSoftClassPtr<UObject> m_widgetBp; // 0x58
};

struct UActorSequence : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	FActorSequenceObjectReferenceMap ObjectReferences; // 0x68
};

struct AYAISquad : AActor {
	TArray<AYAICharacter*> m_squadCharacters; // 0x250
	UYPersistentDataAISquad* m_persistentSquadData; // 0x260
};

struct UParticleModuleCameraOffset : UParticleModuleCameraBase {
	FRawDistributionFloat CameraOffset; // 0x30
	char bSpawnTimeOnly : 1; // 0x60
	EParticleCameraOffsetUpdateMethod UpdateMethod; // 0x64
};

struct AYNPCObject : AActor {
	FYSceneSetupData m_sceneSetupData; // 0x240
	UStaticMeshComponent* m_staticMesh; // 0x258
	FDataTableRowHandle m_npcRowHandle; // 0x260
	FViewTargetTransitionParams m_cameraData; // 0x270
	USceneComponent* m_rootComponent; // 0x280
	EYNPCType m_npcType; // 0x288
	bool m_shouldPlayVoiceOverOnInteraction; // 0x289
};

struct UYWidget_EscapeMenuItem : UYWidget {
	UYButton* m_button; // 0x2d0
};

struct UYCharacterVanityDataComponent : UActorComponent {
	FYActiveGlobalRuntimeVanityData m_activeData; // 0xb0
	FDataTableRowHandle m_socialRow; // 0x130
	FMulticastInlineDelegate OnGlobalVanityUpdatedDelegate; // 0x140
	FMulticastInlineDelegate OnAsyncloadingStateChanged; // 0x150
	FMulticastInlineDelegate OnGlobalVanityEntryUpdatedDelegate; // 0x160
	FMulticastInlineDelegate OnSocialRowChanged; // 0x170
	TArray<UObject*> m_hardReferenedAsyncloadData; // 0x188
	bool m_shouldAsyncloadData; // 0x198
	bool m_finishedAsyncloading; // 0x199
};

struct UMaterialExpressionCosine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UProxyLODMeshSimplificationSettings : UDeveloperSettings {
	FName ProxyLODMeshReductionModuleName; // 0x38
};

struct UYWidget_SocialUserEntry : UYWidget {
	FYOutpostFriendInfo m_cachedUserInfo; // 0x2c0
};

struct UWBP_FlashFeedback_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* Flash_Anim; // 0x2c8
	UImage* Gfx_Flash_Angle; // 0x2d0
	UImage* Gfx_InnerGlow; // 0x2d8
	UImage* Gfx_Stroke; // 0x2e0
	FLinearColor SetColor; // 0x2e8
};

struct UParticleModuleOrbitBase : UParticleModule {
	char bUseEmitterTime : 1; // 0x30
};

struct UYProjectileMovementComponent : UProjectileMovementComponent {
	float m_acceleration; // 0x1d0
	float m_accelerationDelay; // 0x1d4
	float m_accelerationAdditionalMaxSpeed; // 0x1d8
	FMulticastInlineDelegate OnImpactStillRetrace; // 0x1e0
	FDataTableRowHandle m_cachedSpawnedTransportRowHandle; // 0x1f0
	UYGameplayAttributesComponent* m_cachedGameplayAttributeComponent; // 0x200
	EYGameplayContextType m_gameplayContextType; // 0x208
};

struct UParticleLODLevel : UObject {
	int32_t Level; // 0x28
	char bEnabled : 1; // 0x2c
	UParticleModuleRequired* RequiredModule; // 0x30
	TArray<UParticleModule*> Modules; // 0x38
	UParticleModuleTypeDataBase* TypeDataModule; // 0x48
	UParticleModuleSpawn* SpawnModule; // 0x50
	UParticleModuleEventGenerator* EventGenerator; // 0x58
	TArray<UParticleModuleSpawnBase*> SpawningModules; // 0x60
	TArray<UParticleModule*> SpawnModules; // 0x70
	TArray<UParticleModule*> UpdateModules; // 0x80
	TArray<UParticleModuleOrbit*> OrbitModules; // 0x90
	TArray<UParticleModuleEventReceiverBase*> EventReceiverModules; // 0xa0
	char ConvertedModules : 1; // 0xb0
	int32_t PeakActiveParticles; // 0xb4
};

struct UBTTask_ClearAllAggroTargets_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	TArray<FBlackboardKeySelector> KeysToClear; // 0xb0
};

struct UAnimNotify_PlayEffort_C : UAnimNotify {
	EN_EffortTypes Effort; // 0x38
	bool NetMulticast; // 0x39
};

struct ULandscapeComponent : UPrimitiveComponent {
	int32_t SectionBaseX; // 0x440
	int32_t SectionBaseY; // 0x444
	int32_t ComponentSizeQuads; // 0x448
	int32_t SubsectionSizeQuads; // 0x44c
	int32_t NumSubsections; // 0x450
	UMaterialInterface* OverrideMaterial; // 0x458
	UMaterialInterface* OverrideHoleMaterial; // 0x460
	TArray<FLandscapeComponentMaterialOverride> OverrideMaterials; // 0x468
	TArray<UMaterialInstanceConstant*> MaterialInstances; // 0x478
	TArray<UMaterialInstanceDynamic*> MaterialInstancesDynamic; // 0x488
	TArray<int8_t> LODIndexToMaterialIndex; // 0x498
	TArray<int8_t> MaterialIndexToDisabledTessellationMaterial; // 0x4a8
	UTexture2D* XYOffsetmapTexture; // 0x4b8
	FVector4 WeightmapScaleBias; // 0x4c0
	float WeightmapSubsectionOffset; // 0x4d0
	FVector4 HeightmapScaleBias; // 0x4e0
	FBox CachedLocalBox; // 0x4f0
	LazyObjectProperty CollisionComponent; // 0x50c
	UTexture2D* HeightmapTexture; // 0x528
	TArray<FWeightmapLayerAllocationInfo> WeightmapLayerAllocations; // 0x530
	TArray<UTexture2D*> WeightmapTextures; // 0x540
	ULandscapeLODStreamingProxy* LODStreamingProxy; // 0x550
	FGuid MapBuildDataId; // 0x558
	TArray<FGuid> IrrelevantLights; // 0x568
	int32_t CollisionMipLevel; // 0x578
	int32_t SimpleCollisionMipLevel; // 0x57c
	float NegativeZBoundsExtension; // 0x580
	float PositiveZBoundsExtension; // 0x584
	float StaticLightingResolution; // 0x588
	int32_t ForcedLOD; // 0x58c
	int32_t LODBias; // 0x590
	FGuid StateId; // 0x594
	FGuid BakedTextureMaterialGuid; // 0x5a4
	UTexture2D* GIBakedBaseColorTexture; // 0x5b8
	char MobileBlendableLayerMask; // 0x5c0
	UMaterialInterface* MobileMaterialInterface; // 0x5c8
	TArray<UMaterialInterface*> MobileMaterialInterfaces; // 0x5d0
	TArray<UTexture2D*> MobileWeightmapTextures; // 0x5e0
};

struct UActorPlate_WBP_C : UYWidget_ActorPlate {
	FPointerToUberGraphFrame UberGraphFrame; // 0x3a8
	UWBP_HealthBar_HUD_Item_C* UI_HealthBarWithDelta_WBP; // 0x3b0
};

struct UWBP_Transition_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* TransitionOut_Anim; // 0x2c8
	UWidgetAnimation* TransitionIn_Anim; // 0x2d0
	UImage* Gfx_Logo; // 0x2d8
	FMulticastInlineDelegate AnimationFinished; // 0x2e0
	int32_t NewVar_1; // 0x2f0
	float DurationBeforeTransition; // 0x2f4
};

struct UModularSynthPresetBank : UObject {
	TArray<FModularSynthPresetBankEntry> Presets; // 0x28
};

struct UNiagaraDataInterfaceVectorField : UNiagaraDataInterface {
	UVectorField* Field; // 0x38
	bool bTileX; // 0x40
	bool bTileY; // 0x41
	bool bTileZ; // 0x42
};

struct UBTTask_Wait : UBTTaskNode {
	float WaitTime; // 0x70
	float RandomDeviation; // 0x74
};

struct UWBP_Bug_Form_Menu_C : UYWidgetView {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UWidgetAnimation* ScreenIn_Anim; // 0x340
	UMultiLineEditableText* EditTxtMulti_PlayerBehaviour; // 0x348
	UMultiLineEditableText* EditTxtMulti_ReproSteps; // 0x350
	UEditableTextBox* EditTxtSingle_BugSummary; // 0x358
	UImage* Gfx_Backer_2; // 0x360
	UImage* Gfx_Backer_3; // 0x368
	UImage* Gfx_BG_DarkColor; // 0x370
	UImage* Gfx_BG_LightColor; // 0x378
	UImage* Gfx_Grid_Helper; // 0x380
	UImage* HACKCLICKBLOCK; // 0x388
	UOverlay* LoadingOverlay; // 0x390
	UWBP_BlurFullScreenBacker_Panel_C* WBP_BlurFullScreenBacker_Panel; // 0x398
	UWBP_Common_Btn_C* WBP_Common_Btn_AttachFile; // 0x3a0
	UWBP_Common_Btn_C* WBP_Common_Btn_Cancel; // 0x3a8
	UWBP_Common_Btn_C* WBP_Common_Btn_Submit; // 0x3b0
	UWBP_DividerHorizontal_Panel_C* WBP_DividerHorizontal_Panel; // 0x3b8
	UWBP_Dropdown_Btn_C* WBP_Dropdown_Btn; // 0x3c0
	UWBP_GenericContent_Panel_C* WBP_GenericContent_Panel; // 0x3c8
	UWBP_Toast_C* WBP_Toast; // 0x3d0
	UWBP_BugReporter_Provider_C* BugReporterProvider; // 0x3d8
	FText FailureAlphanumeric; // 0x3e0
	FText FailureMissingText; // 0x3f8
	float SuccessAnimDelay; // 0x410
};

struct UWidgetAnimationPlayCallbackProxy : UObject {
	FMulticastInlineDelegate Finished; // 0x28
};

struct UWBP_Contract_Active_Entry_C : UYWidget_FactionContract {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UOverlay* ContractExpired; // 0x348
	UVerticalBox* ContractObjectives; // 0x350
	USizeBox* Description; // 0x358
	UImage* Gfx_AlternativeBacker; // 0x360
	UImage* Gfx_Expired_Backer; // 0x368
	UImage* Icn_Faction; // 0x370
	UImage* Icn_Timer; // 0x378
	UImage* Icn_TimerExpired; // 0x380
	USizeBox* InfoIcon; // 0x388
	UHorizontalBox* TimerHolder; // 0x390
	UTextBlock* Txt_ContractName; // 0x398
	UTextBlock* Txt_Expired; // 0x3a0
	UTextBlock* Txt_Timer; // 0x3a8
	UWBP_Headline_Panel_C* WBP_Headline_Panel; // 0x3b0
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue; // 0x3b8
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue_2; // 0x3c0
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue_3; // 0x3c8
	UYTextBlock* YTxt_ContractDescription; // 0x3d0
	bool UseAlternateBacker; // 0x3d8
};

struct UYWidget_ItemComponentTextUpgradePrice : UYWidget_ItemComponentBase {
	UYWidget_PriceGeneric* m_priceWidget; // 0x300
};

struct UNiagaraDataInterfaceTexture : UNiagaraDataInterface {
	UTexture* Texture; // 0x38
};

struct UGeometryCacheTrackStreamable : UGeometryCacheTrack {
	UGeometryCacheCodecBase* Codec; // 0x58
	float StartSampleTime; // 0xc8
};

struct UYKeybindingsModel : UObject {
	FMulticastInlineDelegate OnKeyReassigned; // 0x28
	FMulticastInlineDelegate OnKeySet; // 0x38
	FMulticastInlineDelegate OnKeybindingDataChanged; // 0x48
	EYKeybindingInputDeviceType m_activeInputDevice; // 0x58
	FYKeybindings m_keybindings; // 0x60
	TArray<FYKeybindingData> m_addedBindings; // 0xd8
	TArray<FYKeybindingData> m_removedBindings; // 0xe8
};

struct UAnimCompress_RemoveLinearKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
	float MaxEffectorDiff; // 0x4c
	float MinEffectorDiff; // 0x50
	float EffectorDiffSocket; // 0x54
	float ParentKeyScale; // 0x58
	char bRetarget : 1; // 0x5c
	char bActuallyFilterLinearKeys : 1; // 0x5c
};

struct UWBP_SelectionHighlight_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* Idle_Anim; // 0x268
	UImage* Gfx_HighlightLeft; // 0x270
	UImage* Gfx_HighlightRight; // 0x278
};

struct UBoundsCopyComponent : UActorComponent {
	TSoftObjectPtr<AActor> BoundsSourceActor; // 0xb0
	bool bUseCollidingComponentsForSourceBounds; // 0xd8
	bool bKeepOwnBoundsScale; // 0xd9
	bool bUseCollidingComponentsForOwnBounds; // 0xda
	FTransform PostTransform; // 0xe0
	bool bCopyXBounds; // 0x110
	bool bCopyYBounds; // 0x111
	bool bCopyZBounds; // 0x112
};

struct UYWidget_ItemComponentRecipeModTune : UYWidget_ItemComponentBase {
	TMap<FString, UYWidget_ItemContainer*> m_materialsMap; // 0x300
};

struct UPawnSensingComponent : UActorComponent {
	float HearingThreshold; // 0xb0
	float LOSHearingThreshold; // 0xb4
	float SightRadius; // 0xb8
	float SensingInterval; // 0xbc
	float HearingMaxSoundAge; // 0xc0
	char bEnableSensingUpdates : 1; // 0xc4
	char bOnlySensePlayers : 1; // 0xc4
	char bSeePawns : 1; // 0xc4
	char bHearNoises : 1; // 0xc4
	FMulticastInlineDelegate OnSeePawn; // 0xd0
	FMulticastInlineDelegate OnHearNoise; // 0xe0
	float PeripheralVisionAngle; // 0xf0
	float PeripheralVisionCosine; // 0xf4
};

struct UAsyncTask_LoadXRDeviceVisComponent : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate OnModelLoaded; // 0x30
	FMulticastInlineDelegate OnLoadFailure; // 0x40
	UPrimitiveComponent* SpawnedComponent; // 0x58
};

struct UYAIAnimationComponent : UActorComponent {
	FYAIMontagePlayInfo m_playMontageInfo; // 0xb0
	FYAIMontageStopInfo m_stopMontageInfo; // 0xd0
	FYAIEndLoopInfo m_endLoopInfo; // 0xe0
};

struct UCheckBoxWidgetStyle : USlateWidgetStyleContainerBase {
	FCheckBoxStyle CheckBoxStyle; // 0x30
};

struct UBlueprintCore : UObject {
	UObject* SkeletonGeneratedClass; // 0x28
	UObject* GeneratedClass; // 0x30
	bool bLegacyNeedToPurgeSkelRefs; // 0x38
	FGuid BlueprintGuid; // 0x3c
};

struct AOnlineBeaconHost : AOnlineBeacon {
	int32_t ListenPort; // 0x270
	TArray<AOnlineBeaconClient*> ClientActors; // 0x278
};

struct UYPlayerProximityManagerComponent : UActorComponent {
	TArray<UYLocalPlayerProximityComponent*> m_proximityComponents; // 0xb0
};

struct UYWidget_Composite : UYWidget {
	FName m_registeredName; // 0x2c0
};

struct UYMissionManager : UObject {
	FMulticastInlineDelegate OnMissionRewardsReceived; // 0x28
	FMulticastInlineDelegate OnMissionDataUpdated; // 0x38
	FMulticastInlineDelegate OnCurrenciesUpdate; // 0x48
};

struct UYWidget_FactionShop : UYWidget_WeaponShop {
	UYWidget_ItemDetailOverview* m_itemDetailOverviewWidget; // 0x328
};

struct UMRMeshComponent : UPrimitiveComponent {
	UMaterialInterface* Material; // 0x450
	UMaterialInterface* WireframeMaterial; // 0x458
	bool bCreateMeshProxySections; // 0x460
	bool bUpdateNavMeshOnMeshUpdate; // 0x461
	bool bNeverCreateCollisionMesh; // 0x462
	UBodySetup* CachedBodySetup; // 0x468
	TArray<UBodySetup*> BodySetups; // 0x470
};

struct ADecalActor : AActor {
	UDecalComponent* Decal; // 0x240
};

struct UWBP_SquadOverview_C : UYWidget_OutpostSquadToggle {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UButton* Btn_LeaveSquad; // 0x2f0
};

struct AFieldSystemActor : AActor {
	UFieldSystemComponent* FieldSystemComponent; // 0x240
};

struct UYWidget_ItemComponentTextRarity : UYWidget_ItemComponentBase {
	UTextBlock* m_rarityText; // 0x300
};

struct UMovieSceneFadeSection : UMovieSceneSection {
	FMovieSceneFloatChannel FloatCurve; // 0xe8
	FLinearColor FadeColor; // 0x188
	char bFadeAudio : 1; // 0x198
};

struct UNavLinkDefinition : UObject {
	TArray<FNavigationLink> Links; // 0x28
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x38
};

struct UYWidget_RankedLeaderboardSmall : UYWidget_RankedLeaderboardBase {
	FMulticastInlineDelegate OnClickedExpandRanked; // 0x2c8
};

struct USkeletalMesh : UStreamableRenderAsset {
	USkeleton* Skeleton; // 0x80
	FBoxSphereBounds ImportedBounds; // 0x88
	FBoxSphereBounds ExtendedBounds; // 0xa4
	FVector PositiveBoundsExtension; // 0xc0
	FVector NegativeBoundsExtension; // 0xcc
	TArray<FSkeletalMaterial> Materials; // 0xd8
	TArray<FBoneMirrorInfo> SkelMirrorTable; // 0xe8
	TArray<FSkeletalMeshLODInfo> LODInfo; // 0xf8
	FPerPlatformInt MinLOD; // 0x158
	FPerPlatformBool DisableBelowMinLodStripping; // 0x15c
	EAxis SkelMirrorAxis; // 0x15d
	EAxis SkelMirrorFlipAxis; // 0x15e
	char bUseFullPrecisionUVs : 1; // 0x15f
	char bUseHighPrecisionTangentBasis : 1; // 0x15f
	char bHasBeenSimplified : 1; // 0x15f
	char bHasVertexColors : 1; // 0x15f
	char bEnablePerPolyCollision : 1; // 0x15f
	UBodySetup* BodySetup; // 0x160
	UPhysicsAsset* PhysicsAsset; // 0x168
	UPhysicsAsset* ShadowPhysicsAsset; // 0x170
	TArray<UNodeMappingContainer*> NodeMappingData; // 0x178
	TArray<UMorphTarget*> MorphTargets; // 0x188
	UAnimInstance* PostProcessAnimBlueprint; // 0x310
	TArray<UClothingAssetBase*> MeshClothingAssets; // 0x318
	FSkeletalMeshSamplingInfo SamplingInfo; // 0x328
	TArray<UAssetUserData*> AssetUserData; // 0x358
	TArray<USkeletalMeshSocket*> Sockets; // 0x368
	TArray<FSkinWeightProfileInfo> SkinWeightProfiles; // 0x388
};

struct UNavLinkCustomComponent : UNavRelevantComponent {
	uint32_t NavLinkUserId; // 0xe8
	UNavArea* EnabledAreaClass; // 0xf0
	UNavArea* DisabledAreaClass; // 0xf8
	FNavAgentSelector SupportedAgents; // 0x100
	FVector LinkRelativeStart; // 0x104
	FVector LinkRelativeEnd; // 0x110
	ENavLinkDirection LinkDirection; // 0x11c
	char bLinkEnabled : 1; // 0x120
	char bNotifyWhenEnabled : 1; // 0x120
	char bNotifyWhenDisabled : 1; // 0x120
	char bCreateBoxObstacle : 1; // 0x120
	FVector ObstacleOffset; // 0x124
	FVector ObstacleExtent; // 0x130
	UNavArea* ObstacleAreaClass; // 0x140
	float BroadcastRadius; // 0x148
	float BroadcastInterval; // 0x14c
	ECollisionChannel BroadcastChannel; // 0x150
};

struct AYExtractionActor : AActor {
	UYObjectInteractionComponent* m_interactionComponent; // 0x250
	float m_activationTime; // 0x258
	float m_activationDuration; // 0x25c
	EYExtractionActorState m_state; // 0x260
};

struct UYWidget_PlayerItemsOverview : UYWidget {
	FMulticastInlineDelegate OnItemDroppedOnAreaSignature; // 0x2c8
	TArray<UYWidget_ItemContainer*> m_itemEntries; // 0x2d8
	TMap<int32_t, FYPlayerItemUIData> m_playerItemsData; // 0x2e8
};

struct UYWidget_CurrentRankedSeasonTopPlayers : UYWidget {
	int32_t m_amountofTopPlayersToShow; // 0x2c0
	EYMatchmakeGameModeType m_matchmakeGameModeType; // 0x2c4
	FYPlayersRankedSeasonData m_cachedPlayersRankedSeasonData; // 0x2c8
};

struct UYWidget_Popup_BeforeMatch_Warning : UYWidget {
	bool m_configShouldSkipBeforeMatchWarning; // 0x2c0
};

struct UPhononSpatializationSourceSettings : USpatializationPluginSourceSettingsBase {
	EIplSpatializationMethod SpatializationMethod; // 0x28
	EIplHrtfInterpolationMethod HrtfInterpolationMethod; // 0x29
};

struct UAudioImpulseResponse : UObject {
	TArray<float> ImpulseResponse; // 0x28
	int32_t NumChannels; // 0x38
	int32_t SampleRate; // 0x3c
	float NormalizationVolumeDb; // 0x40
	bool bTrueStereo; // 0x44
	TArray<float> IRData; // 0x48
};

struct UPropertyValue : UObject {
	TArray<TFieldPath<FProperty>> Properties; // 0x88
	TArray<int32_t> PropertyIndices; // 0x98
	TArray<FCapturedPropSegment> CapturedPropSegments; // 0xa8
	FString FullDisplayString; // 0xb8
	FName PropertySetterName; // 0xc8
	TMap<FString, FString> PropertySetterParameterDefaults; // 0xd0
	bool bHasRecordedData; // 0x120
	UObject* LeafPropertyClass; // 0x128
	TArray<char> ValueBytes; // 0x138
	EPropertyValueCategory PropCategory; // 0x148
};

struct UYWidget_LaunchGameModeEntry : UYWidget {
	UYWidget_ImageBase* m_gameModeIcon; // 0x2d8
	UYWidget_ImageBase* m_gameModeImage; // 0x2e0
	UYWidget_ImageBase* m_gameModeBackgroundImage; // 0x2e8
	UYWidget_ImageBase* m_gameModeSelectedBackgroundImage; // 0x2f0
	UYWidget_ImageBase* m_gameModeHoverBackgroundImage; // 0x2f8
	UTextBlock* m_gameModeNameTextBlock; // 0x300
	UTextBlock* m_gameModeDescriptionTextBlock; // 0x308
	UButton* m_gameModeButton; // 0x310
	bool m_isSelected; // 0x318
};

struct UMeshComponent : UPrimitiveComponent {
	TArray<UMaterialInterface*> OverrideMaterials; // 0x440
	char bEnableMaterialParameterCaching : 1; // 0x460
};

struct UAISystem : UAISystemBase {
	FSoftClassPath PerceptionSystemClassName; // 0x58
	FSoftClassPath HotSpotManagerClassName; // 0x70
	float AcceptanceRadius; // 0x88
	float PathfollowingRegularPathPointAcceptanceRadius; // 0x8c
	float PathfollowingNavLinkAcceptanceRadius; // 0x90
	bool bFinishMoveOnGoalOverlap; // 0x94
	bool bAcceptPartialPaths; // 0x95
	bool bAllowStrafing; // 0x96
	bool bEnableBTAITasks; // 0x97
	bool bAllowControllersAsEQSQuerier; // 0x98
	bool bEnableDebuggerPlugin; // 0x99
	bool bForgetStaleActors; // 0x9a
	bool bAddBlackboardSelfKey; // 0x9b
	ECollisionChannel DefaultSightCollisionChannel; // 0x9c
	UBehaviorTreeManager* BehaviorTreeManager; // 0xa0
	UEnvQueryManager* EnvironmentQueryManager; // 0xa8
	UAIPerceptionSystem* PerceptionSystem; // 0xb0
	TArray<UAIAsyncTaskBlueprintProxy*> AllProxyObjects; // 0xb8
	UAIHotSpotManager* HotSpotManager; // 0xc8
	UNavLocalGridManager* NavLocalGrids; // 0xd0
};

struct UMovieSceneMediaSection : UMovieSceneSection {
	UMediaSource* MediaSource; // 0xe8
	bool bLooping; // 0xf0
	FFrameNumber StartFrameOffset; // 0xf4
	UMediaTexture* MediaTexture; // 0xf8
	UMediaSoundComponent* MediaSoundComponent; // 0x100
	bool bUseExternalMediaPlayer; // 0x108
	UMediaPlayer* ExternalMediaPlayer; // 0x110
};

struct ASceneCapture : AActor {
	UStaticMeshComponent* MeshComp; // 0x240
	USceneComponent* SceneComponent; // 0x248
};

struct UAnimNotify_PlayNiagaraEffect : UAnimNotify {
	UNiagaraSystem* Template; // 0x38
	FVector LocationOffset; // 0x40
	FRotator RotationOffset; // 0x4c
	FVector Scale; // 0x58
	bool bAbsoluteScale; // 0x64
	char Attached : 1; // 0x80
	FName SocketName; // 0x84
};

struct UYWidget_OutpostSquadToggle : UYWidget {
	UYWidget_OutpostSquadOverviewEntry* m_memberEntry_Self; // 0x2c0
	UYWidget_OutpostSquadOverviewEntry* m_memberEntry1; // 0x2c8
	UYWidget_OutpostSquadOverviewEntry* m_memberEntry2; // 0x2d0
	FMulticastInlineDelegate OnSquadToggleClicked; // 0x2d8
};

struct UMultiLineEditableText : UTextLayoutWidget {
	FText Text; // 0x128
	FText HintText; // 0x140
	FDelegate HintTextDelegate; // 0x158
	FTextBlockStyle WidgetStyle; // 0x168
	bool bIsReadOnly; // 0x3d8
	FSlateFontInfo Font; // 0x3e0
	bool SelectAllTextWhenFocused; // 0x438
	bool ClearTextSelectionOnFocusLoss; // 0x439
	bool RevertTextOnEscape; // 0x43a
	bool ClearKeyboardFocusOnCommit; // 0x43b
	bool AllowContextMenu; // 0x43c
	FVirtualKeyboardOptions VirtualKeyboardOptions; // 0x43d
	EVirtualKeyboardDismissAction VirtualKeyboardDismissAction; // 0x43e
	FMulticastInlineDelegate OnTextChanged; // 0x440
	FMulticastInlineDelegate OnTextCommitted; // 0x450
};

struct UYTextBlockWidgetStyle : USlateWidgetStyleContainerBase {
	FTextBlockStyle m_textBlockStyle; // 0x30
};

struct UPlatformMediaSource : UMediaSource {
	UMediaSource* MediaSource; // 0x80
};

struct UYServerPerformanceDataComponent : UActorComponent {
	FYServerPerformanceData m_replicatedData; // 0xb0
};

struct UTacticalFlashLightComponent_BP_C : UYTacticalFlashlightComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	USpotLightComponent* FlashLightComponent; // 0xb8
	bool bIsEnabled; // 0xc0
	USoundBase* SFX_TorchButton; // 0xc8
};

struct ACharacter : APawn {
	USkeletalMeshComponent* Mesh; // 0x2a0
	UCharacterMovementComponent* CharacterMovement; // 0x2a8
	UCapsuleComponent* CapsuleComponent; // 0x2b0
	FBasedMovementInfo BasedMovement; // 0x2b8
	FBasedMovementInfo ReplicatedBasedMovement; // 0x2e8
	float AnimRootMotionTranslationScale; // 0x318
	FVector BaseTranslationOffset; // 0x31c
	FQuat BaseRotationOffset; // 0x330
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x340
	float ReplayLastTransformUpdateTimeStamp; // 0x344
	char ReplicatedMovementMode; // 0x348
	bool bInBaseReplication; // 0x349
	float CrouchedEyeHeight; // 0x34c
	char bIsCrouched : 1; // 0x350
	char bProxyIsJumpForceApplied : 1; // 0x350
	char bPressedJump : 1; // 0x350
	char bClientUpdating : 1; // 0x350
	char bClientWasFalling : 1; // 0x350
	char bClientResimulateRootMotion : 1; // 0x350
	char bClientResimulateRootMotionSources : 1; // 0x350
	char bSimGravityDisabled : 1; // 0x350
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x351
	char bServerMoveIgnoreRootMotion : 1; // 0x351
	char bWasJumping : 1; // 0x351
	float JumpKeyHoldTime; // 0x354
	float JumpForceTimeRemaining; // 0x358
	float ProxyJumpForceStartedTime; // 0x35c
	float JumpMaxHoldTime; // 0x360
	int32_t JumpMaxCount; // 0x364
	int32_t JumpCurrentCount; // 0x368
	int32_t JumpCurrentCountPreJump; // 0x36c
	FMulticastInlineDelegate OnReachedJumpApex; // 0x378
	FMulticastInlineDelegate MovementModeChangedDelegate; // 0x398
	FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x3a8
	FRootMotionSourceGroup SavedRootMotion; // 0x3b8
	FRootMotionMovementParams ClientRootMotionParams; // 0x3f0
	TArray<FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x430
	FRepRootMotionMontage RepRootMotion; // 0x440
	float m_rootMotionRotationScale; // 0x4d8
	bool m_isRootMotionRotationScalingEnabled; // 0x4dc
};

struct ABandwidthTestActor : AActor {
	FBandwidthTestGenerator BandwidthGenerator; // 0x240
};

struct UPawnAction_Repeat : UPawnAction {
	UPawnAction* ActionToRepeat; // 0x98
	UPawnAction* RecentActionCopy; // 0xa0
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
};

struct UWBP_DropdownBase_Btn_C : UYWidget_DropDown {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c8
	TArray<FText> DefaultOptions; // 0x2d0
	FMulticastInlineDelegate OnSelectedOptionDelegate; // 0x2e0
};

struct UYFactionsProgressionManager : UObject {
	FMulticastInlineDelegate OnFactionProgressDataReceived; // 0x28
};

struct UYWidget_ItemComponentTextAmountCompare : UYWidget_ItemComponentTextAmount {
	UTextBlock* m_compareValueText; // 0x320
	int32_t m_compareValue; // 0x328
};

struct UYCharacterScopeGlintComponent_BP_C : UYCharacterWeaponGlintComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UParticleSystemComponent* GlintPS; // 0xb8
	UCurveFloat* GlintEffectCurve; // 0xc0
};

struct UPrefabricatorAssetInterface : UObject {
	UPrefabricatorEventListener* EventListener; // 0x28
	bool bReplicates; // 0x30
};

struct USequenceCameraShake : UCameraShakeBase {
	UCameraAnimationSequence* Sequence; // 0x98
	float PlayRate; // 0xa0
	float Scale; // 0xa4
	float BlendInTime; // 0xa8
	float BlendOutTime; // 0xac
	float RandomSegmentDuration; // 0xb0
	bool bRandomSegment; // 0xb4
	USequenceCameraShakeSequencePlayer* Player; // 0xb8
	USequenceCameraShakeCameraStandIn* CameraStandIn; // 0xc0
};

struct UYWidgetProvider_HUDInfo : UYWidgetProvider {
	FMulticastInlineDelegate OnUpdateHUDInfo; // 0x40
	FMulticastInlineDelegate OnUpdateHUDInfoCategory; // 0x50
	FMulticastInlineDelegate OnUpdateHUDProgress; // 0x60
	TArray<FYHUDInfoEntry> m_infoEntries; // 0x70
	TArray<EYHUDInfoPriorityCategory> m_customHandledCategories; // 0x80
};

struct UNiagaraDataInterface2DArrayTexture : UNiagaraDataInterface {
	UTexture2DArray* Texture; // 0x38
};

struct UCurveVector : UCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x30
};

struct USoundCue : USoundBase {
	char bPrimeOnLoad : 1; // 0x1b8
	USoundNode* FirstNode; // 0x1c0
	float VolumeMultiplier; // 0x1c8
	float PitchMultiplier; // 0x1cc
	FSoundAttenuationSettings AttenuationOverrides; // 0x1d0
	float SubtitlePriority; // 0x570
	char bOverrideAttenuation : 1; // 0x578
	char bExcludeFromRandomNodeBranchCulling : 1; // 0x578
	int32_t CookedQualityIndex; // 0x57c
	char bHasPlayWhenSilent : 1; // 0x580
};

struct USubmixEffectSubmixEQPreset : USoundEffectSubmixPreset {
	FSubmixEffectSubmixEQSettings Settings; // 0xa0
};

struct UYWidget_ItemComponentVanity : UYWidget_ItemComponentBase {
	FYExchangeVanityIdContextInfo m_exchangceVanityIdContextInfo; // 0x300
	UTextBlock* m_textHoveredItemInfo; // 0x330
	UCanvasPanel* m_canvasPanelHoveredItemInfo; // 0x338
	EYVanityType m_vanityType; // 0x340
};

struct UYWidget_ItemDetailOverview : UYWidget {
	FMulticastInlineDelegate OnBackButtonClicked; // 0x2c8
	UYWidget_ItemContainer* m_itemDetailWidget; // 0x2d8
	UYWidget_ItemContainer* m_blueprintDetailWidget; // 0x2e0
	UYWidget_VanitySwap* m_vanitySwapWidget; // 0x2e8
	bool m_isRequestingCustomizationModeChanges; // 0x2f0
};

struct UProceduralFoliageComponent : UActorComponent {
	UProceduralFoliageSpawner* FoliageSpawner; // 0xb0
	float TileOverlap; // 0xb8
	AVolume* SpawningVolume; // 0xc0
	FGuid ProceduralGuid; // 0xc8
};

struct UCanvasPanelSlot : UPanelSlot {
	FAnchorData LayoutData; // 0x38
	bool bAutoSize; // 0x60
	int32_t ZOrder; // 0x64
};

struct UAIDataProvider_Random : UAIDataProvider_QueryParams {
	float Min; // 0x40
	float Max; // 0x44
	char bInteger : 1; // 0x48
};

struct ACameraRig_Crane : AActor {
	float CranePitch; // 0x240
	float CraneYaw; // 0x244
	float CraneArmLength; // 0x248
	bool bLockMountPitch; // 0x24c
	bool bLockMountYaw; // 0x24d
	USceneComponent* TransformComponent; // 0x250
	USceneComponent* CraneYawControl; // 0x258
	USceneComponent* CranePitchControl; // 0x260
	USceneComponent* CraneCameraMount; // 0x268
};

struct UNetConnection : UPlayer {
	TArray<UChildConnection*> Children; // 0x48
	UNetDriver* Driver; // 0x58
	UPackageMap* PackageMapClass; // 0x60
	UPackageMap* PackageMap; // 0x68
	TArray<UChannel*> OpenChannels; // 0x70
	TArray<AActor*> SentTemporaries; // 0x80
	AActor* ViewTarget; // 0x90
	AActor* OwningActor; // 0x98
	int32_t MaxPacket; // 0xa0
	char InternalAck : 1; // 0xa4
	FUniqueNetIdRepl PlayerId; // 0x160
	double LastReceiveTime; // 0x1d0
	TArray<UChannel*> ChannelsToTick; // 0x1518
};

struct AWaterBodyRiver : AWaterBody {
	URiverGenerator* RiverGenerator; // 0xe00
	UMaterialInterface* LakeTransitionMaterial; // 0xe08
	UMaterialInstanceDynamic* LakeTransitionMID; // 0xe10
	UMaterialInterface* OceanTransitionMaterial; // 0xe18
	UMaterialInstanceDynamic* OceanTransitionMID; // 0xe20
};

struct UToIntegerField : UFieldNodeInt {
	UFieldNodeFloat* FloatField; // 0xb0
};

struct UAsyncActionLoadPrimaryAsset : UAsyncActionLoadPrimaryAssetBase {
	FMulticastInlineDelegate Completed; // 0x78
};

struct UOverlaySlot : UPanelSlot {
	FMargin Padding; // 0x40
	EHorizontalAlignment HorizontalAlignment; // 0x50
	EVerticalAlignment VerticalAlignment; // 0x51
};

struct USkyLightComponent : ULightComponentBase {
	bool bRealTimeCapture; // 0x228
	ESkyLightSourceType SourceType; // 0x229
	UTextureCube* Cubemap; // 0x230
	float SourceCubemapAngle; // 0x238
	int32_t CubemapResolution; // 0x23c
	float SkyDistanceThreshold; // 0x240
	bool bCaptureEmissiveOnly; // 0x244
	bool bLowerHemisphereIsBlack; // 0x245
	FLinearColor LowerHemisphereColor; // 0x248
	float OcclusionMaxDistance; // 0x258
	float Contrast; // 0x25c
	float OcclusionExponent; // 0x260
	float MinOcclusion; // 0x264
	FColor OcclusionTint; // 0x268
	char bCloudAmbientOcclusion : 1; // 0x26c
	float CloudAmbientOcclusionStrength; // 0x270
	float CloudAmbientOcclusionExtent; // 0x274
	float CloudAmbientOcclusionMapResolutionScale; // 0x278
	float CloudAmbientOcclusionApertureScale; // 0x27c
	EOcclusionCombineMode OcclusionCombineMode; // 0x280
	UTextureCube* BlendDestinationCubemap; // 0x338
};

struct UUserDefinedEnum : UEnum {
	TMap<FName, FText> DisplayNameMap; // 0x60
};

struct UStereoLayerShapeCylinder : UStereoLayerShape {
	float Radius; // 0x28
	float OverlayArc; // 0x2c
	int32_t Height; // 0x30
};

struct ULeaderboardQueryCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct UBTDecorator_Loop : UBTDecorator {
	int32_t NumLoops; // 0x68
	bool bInfiniteLoop; // 0x6c
	float InfiniteLoopTimeoutTime; // 0x70
};

struct UYExcelConverterDataAsset : UDataAsset {
	TMap<EYMetaConverterTypes, FYCSVMetaDataEntry> m_data; // 0x30
	TSoftObjectPtr<UDataAsset> m_excelDataConverterPath; // 0x80
};

struct UTextureRenderTargetVolume : UTextureRenderTarget {
	int32_t SizeX; // 0xe0
	int32_t SizeY; // 0xe4
	int32_t SizeZ; // 0xe8
	FLinearColor ClearColor; // 0xec
	EPixelFormat OverrideFormat; // 0xfc
	char bHDR : 1; // 0xfd
	char bForceLinearGamma : 1; // 0xfd
};

struct UARPoseComponent : UARComponent {
	FARPoseUpdatePayload ReplicatedPayload; // 0x280
};

struct UBTTask_BlueprintBase : UBTTaskNode {
	AAIController* AIOwner; // 0x70
	AActor* ActorOwner; // 0x78
	FIntervalCountdown TickInterval; // 0x80
	char bShowPropertyDetails : 1; // 0xa0
};

struct UYWidget_ItemComponentUpgradeButton : UYWidget_ItemComponentBase {
	FMulticastInlineDelegate OnGotEnoughResourcesForUpgrade; // 0x300
};

struct USceneCaptureComponentCube : USceneCaptureComponent {
	UTextureRenderTargetCube* TextureTarget; // 0x2b0
	bool bCaptureRotation; // 0x2b8
	UTextureRenderTargetCube* TextureTargetLeft; // 0x2c0
	UTextureRenderTargetCube* TextureTargetRight; // 0x2c8
	UTextureRenderTarget2D* TextureTargetODS; // 0x2d0
	float IPD; // 0x2d8
};

struct UMasterAudioSubmixCaptureProtocol : UMovieSceneAudioCaptureProtocolBase {
	FString Filename; // 0x58
};

struct UYLightManagerComponent : UActorComponent {
	TArray<AYLight*> m_lights; // 0xb0
};

struct UWBP_ItemDetails_C : UYWidget_ItemContainer {
	FPointerToUberGraphFrame UberGraphFrame; // 0x580
	UWidgetAnimation* ScreenIn_Anim; // 0x588
	USizeBox* AmmoIconSizeBox; // 0x590
	UHorizontalBox* Amount; // 0x598
	UOverlay* CollapsedComponents; // 0x5a0
	UVerticalBox* CompatibleWeapons; // 0x5a8
	UUniformGridPanel* CompatibleWeaponsUniformGrid; // 0x5b0
	UOverlay* ComponentsContainer; // 0x5b8
	USizeBox* CurrencyHolder; // 0x5c0
	USizeBox* FactionPoints; // 0x5c8
	UImage* Gfx_ArrowNegative; // 0x5d0
	UImage* Gfx_ArrowPositive; // 0x5d8
	UImage* Gfx_DurabilityIcon; // 0x5e0
	UImage* Icn_Faction; // 0x5e8
	USizeBox* IconDurabilitySizeBox; // 0x5f0
	UNamedSlot* ImageHolder_Slot; // 0x5f8
	UItemComponent_Image_WBP_C* ItemComponent_Image_WBP; // 0x600
	UItemComponent_ImageAmmoType_WBP_C* ItemComponent_ImageAmmoType_WBP; // 0x608
	UItemComponent_Mods_WBP_C* ItemComponent_Mods_WBP; // 0x610
	UItemComponent_RarityColor_C* ItemComponent_RarityColor; // 0x618
	UItemComponent_StackAmountText_WBP_C* ItemComponent_StackAmountText_WBP; // 0x620
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_Ammo; // 0x628
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_Armor; // 0x630
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_Bag; // 0x638
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_DPS; // 0x640
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_Durability; // 0x648
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_Penetration; // 0x650
	UItemComponent_StatsEntryText_WBP_C* ItemComponent_StatsEntryText_WBP_C_RateOfFire; // 0x658
	UItemComponent_TextDescription_WBP_C* ItemComponent_TextDescription_WBP; // 0x660
	UItemComponent_TextName_WBP_C* ItemComponent_TextName_WBP; // 0x668
	UItemComponent_Weight_C* ItemComponent_Weight; // 0x670
	USizeBox* ItemImage; // 0x678
	UImage* m_Gfx_AmmoIcon; // 0x680
	UImage* m_Gfx_Item_Dynamic; // 0x688
	UHorizontalBox* Price; // 0x690
	UVerticalBox* StatAttachments; // 0x698
	UVerticalBox* StatPerks; // 0x6a0
	USizeBox* StatsDescription; // 0x6a8
	USizeBox* StatsPrimary; // 0x6b0
	UVerticalBox* StatsSecondary; // 0x6b8
	UYTextBlock* Txt_Attachments; // 0x6c0
	UTextBlock* Txt_Description; // 0x6c8
	UTextBlock* Txt_Durability; // 0x6d0
	UTextBlock* Txt_DurabilityAmount; // 0x6d8
	UTextBlock* Txt_Label; // 0x6e0
	UTextBlock* Txt_Label_2; // 0x6e8
	UTextBlock* Txt_Rarity; // 0x6f0
	UTextBlock* Txt_StackAmount; // 0x6f8
	UWBP_Attachments_List_C* WBP_Attachments_List; // 0x700
	UWBP_CompatibleWeapon_Entry_C* WBP_CompatibleWeapon_Entry; // 0x708
	UWBP_CompatibleWeapon_Entry_C* WBP_CompatibleWeapon_Entry_2; // 0x710
	UWBP_CompatibleWeapon_Entry_C* WBP_CompatibleWeapon_Entry_3; // 0x718
	UWBP_CompatibleWeapon_Entry_C* WBP_CompatibleWeapon_Entry_4; // 0x720
	UWBP_DividerHorizontal_Panel_C* WBP_Deco_Divider_A; // 0x728
	UWBP_DividerHorizontal_Panel_C* WBP_Deco_Divider_B; // 0x730
	UWBP_DividerHorizontal_Panel_C* WBP_Deco_Divider_C; // 0x738
	UWBP_DividerHorizontal_VarA_Panel_C* WBP_DividerHorizontal_Var_A; // 0x740
	UWBP_DividerHorizontal_VarA_Panel_C* WBP_DividerHorizontal_Var_B; // 0x748
	UWBP_ItemStatBonus_Entry_C* WBP_ItemStatBonus; // 0x750
	UWBP_ItemStatBonus_Entry_C* WBP_ItemStatBonus_2; // 0x758
	UWBP_ItemStatPrimary_Entry_C* WBP_ItemStatPrimary; // 0x760
	UWBP_ItemStatPrimary_Entry_C* WBP_ItemStatPrimary_2; // 0x768
	UWBP_ItemStatPrimary_Entry_C* WBP_ItemStatPrimary_3; // 0x770
	UWBP_ItemStatPrimary_Entry_C* WBP_ItemStatPrimary_4; // 0x778
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue; // 0x780
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue_2; // 0x788
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue_3; // 0x790
	UWBP_ProgressBarNameValue_C* WBP_ProgressBarNameValue_4; // 0x798
	UWBP_Common_Btn_C* WBP_UnequipAllMods_Btn; // 0x7a0
	UWBP_Weight_C* WBP_Weight; // 0x7a8
	UYTextBlock* YTxt_ItemName; // 0x7b0
	bool UseStatDescription; // 0x7b8
	bool UseStatPrimary; // 0x7b9
	bool UseStatSecondary; // 0x7ba
	bool UseStatPerks; // 0x7bb
	bool UseStatAttachments; // 0x7bc
	bool UseItemImage; // 0x7bd
	bool UseAmount; // 0x7be
	bool UseCompatibleWeapons; // 0x7bf
	bool UsePrice; // 0x7c0
	TArray<EYItemType> ItemTypesToShowStatsFor; // 0x7c8
	TArray<EYDeviceClass> DeviceClassesToHideStatsFor; // 0x7d8
	bool UseAttachemntsUnequipButton; // 0x7e8
	bool IsToolTipVariant; // 0x7e9
};

struct UYWidget_ChatMessage : UYWidget {
	URichTextBlock* m_richTextBlock; // 0x2d0
	FText m_chatMessageFormattedRichText; // 0x2d8
	TMap<EYChannelType, FString> m_channelTypeStyleMap; // 0x2f0
	FString m_userNameStyle; // 0x340
	FString m_messageStyle; // 0x350
	FString m_cachedPlayerName; // 0x360
};

struct UWBP_TabNavigation_C : UWBP_TabNavigationBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* WidgetIn_Anim; // 0x2f8
	UHorizontalBox* TabHolder_hBox; // 0x300
	UWBP_InputKey_C* WBP_InputKey_TabL; // 0x308
	UWBP_InputKey_C* WBP_InputKey_TabR; // 0x310
	TArray<FStucture_TabData> Tabs; // 0x318
	bool IsInitialized; // 0x328
};

struct UYControllerCustomizationComponent : UActorComponent {
	FMulticastInlineDelegate OnRequestCustomizationPartChange; // 0xb0
	FMulticastInlineDelegate OnSelectedNewCustomizationRowHandle; // 0xc0
	FMulticastInlineDelegate OnTemporaryShowCustomizationEntryUpdateDelegate; // 0xd0
	FMulticastInlineDelegate OnNewCustomizatonData; // 0xe0
	FMulticastInlineDelegate OnResetRequest; // 0xf0
	FMulticastInlineDelegate OnRequestRotationState; // 0x100
	FMulticastInlineDelegate OnRequestWeaponVanityTemporaryVisualization; // 0x110
	FMulticastInlineDelegate OnWeaponCustomizationSetWeapon; // 0x120
	FMulticastInlineDelegate OnGlobalVanityDataChanged; // 0x130
};

struct UWBP_Attachments_List_C : UYWidget_Inventory_Base {
	FPointerToUberGraphFrame UberGraphFrame; // 0x448
	UWBP_FullMessage_C* WBP_FullMessage; // 0x450
	UWBP_Inventory_PlayerSet_DropArea_Attachments_C* WBP_Inventory_PlayerSet_DropArea_Attachments; // 0x458
	UWrapBox* WrapBox_1; // 0x460
	bool IsTooltip; // 0x468
	TMap<EYModificationSlotType, UWBP_Item_Preview_Attachments_Btn_C*> ModificationSlotItemContainers; // 0x470
	FYItemModsInfo CachedModsInfo; // 0x4c0
	FYInventoryItem CachedInventoryItem; // 0x520
	EYInsuranceStatus CachedIsParentWeaponInsured; // 0x5b8
	TMap<int32_t, EYModificationSlotType> ExecutionData; // 0x5c0
};

struct UListViewBase : UWidget {
	UUserWidget* EntryWidgetClass; // 0x108
	float WheelScrollMultiplier; // 0x110
	bool bEnableScrollAnimation; // 0x114
	bool bEnableFixedLineOffset; // 0x115
	float FixedLineScrollOffset; // 0x118
	FMulticastInlineDelegate BP_OnEntryGenerated; // 0x120
	FMulticastInlineDelegate BP_OnEntryReleased; // 0x130
	FUserWidgetPool EntryWidgetPool; // 0x140
};

struct UNiagaraComponent : UFXSystemComponent {
	UNiagaraSystem* Asset; // 0x440
	ENiagaraTickBehavior TickBehavior; // 0x448
	FNiagaraUserRedirectionParameterStore OverrideParameters; // 0x450
	char bForceSolo : 1; // 0x518
	char bEnableGpuComputeDebug : 1; // 0x518
	char bAutoDestroy : 1; // 0x544
	char bRenderingEnabled : 1; // 0x544
	char bAutoManageAttachment : 1; // 0x544
	char bAutoAttachWeldSimulatedBodies : 1; // 0x544
	float MaxTimeBeforeForceUpdateTransform; // 0x548
	TArray<FNiagaraMaterialOverride> EmitterMaterials; // 0x550
	FMulticastInlineDelegate OnSystemFinished; // 0x568
	TWeakObjectPtr<USceneComponent> AutoAttachParent; // 0x578
	FName AutoAttachSocketName; // 0x580
	EAttachmentRule AutoAttachLocationRule; // 0x588
	EAttachmentRule AutoAttachRotationRule; // 0x589
	EAttachmentRule AutoAttachScaleRule; // 0x58a
};

struct ATriggerBase : AActor {
	UShapeComponent* CollisionComponent; // 0x240
};

struct UMaterialExpressionSine : UMaterialExpression {
	FExpressionInput Input; // 0x40
	float Period; // 0x54
};

struct UYUiManager : UObject {
	UUserWidget* m_itemTooltipWidget; // 0x28
};

struct AGeometryCollectionActor : AActor {
	UGeometryCollectionComponent* GeometryCollectionComponent; // 0x240
	UGeometryCollectionDebugDrawComponent* GeometryCollectionDebugDrawComponent; // 0x248
};

struct UInterpTrackFloatMaterialParam : UInterpTrackFloatBase {
	TArray<UMaterialInterface*> TargetMaterials; // 0x90
	FName ParamName; // 0xa0
};

struct UEnvQueryNode : UObject {
	int32_t VerNum; // 0x28
};

struct UYFoliageAudioComponent : UActorComponent {
	FDataTableRowHandle m_defaultWalkingEffect; // 0xb0
	FDataTableRowHandle m_crouchingEffect; // 0xc0
	FDataTableRowHandle m_sprintingEffect; // 0xd0
	float m_minEffectTime; // 0xe0
	float m_fadeOutDuration; // 0xe4
	FYCurrentlyOverlappingFoliage m_currentFoliage; // 0xe8
};

struct UWBP_Footer_A_Panel_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWidgetAnimation* ScreenIn_Anim; // 0x268
	UImage* Gfx_ArrowLarge; // 0x270
	UImage* Gfx_ArrowLarge_2; // 0x278
	UImage* Gfx_ArrowSmall; // 0x280
	UImage* Gfx_FillLeft; // 0x288
	UImage* Gfx_FillRight; // 0x290
	UImage* Gfx_Left; // 0x298
	UImage* Gfx_Right; // 0x2a0
};

struct UNiagaraComponentRendererProperties : UNiagaraRendererProperties {
	USceneComponent* ComponentType; // 0x80
	uint32_t ComponentCountLimit; // 0x88
	FNiagaraVariableAttributeBinding EnabledBinding; // 0x90
	bool bAssignComponentsOnParticleID; // 0xe8
	bool bOnlyCreateComponentsOnParticleSpawn; // 0xe9
	USceneComponent* TemplateComponent; // 0xf0
	TArray<FNiagaraComponentPropertyBinding> PropertyBindings; // 0xf8
};

struct UYWidget_Register : UYWidget {
	FMulticastInlineDelegate OnRegister; // 0x2c0
	FMulticastInlineDelegate OnGoBackRequest; // 0x2d0
	UEditableTextBox* m_passwordTextBox; // 0x2e0
	UEditableTextBox* m_repeatPasswordTextBox; // 0x2e8
	UEditableTextBox* m_usernameTextBox; // 0x2f0
	UButton* m_registerButton; // 0x2f8
	UButton* m_backButton; // 0x300
	UTextBlock* m_errorTextBlock; // 0x308
};

struct UYWidget_NavigationBar : UYWidget {
	FMulticastInlineDelegate OnButtonClickedDelegate; // 0x2c0
	TArray<FNavigationBarOption> m_navigationOptions; // 0x2d0
	UHorizontalBox* m_horizontalButtonContainer; // 0x2e0
	UYWidget_TopMenuSubButton* m_menuButtonBP; // 0x2e8
	TArray<UYWidget_TopMenuSubButton*> m_menuButtons; // 0x2f0
};

struct UVectorFieldAnimated : UVectorField {
	UTexture2D* Texture; // 0x48
	EVectorFieldConstructionOp ConstructionOp; // 0x50
	int32_t VolumeSizeX; // 0x54
	int32_t VolumeSizeY; // 0x58
	int32_t VolumeSizeZ; // 0x5c
	int32_t SubImagesX; // 0x60
	int32_t SubImagesY; // 0x64
	int32_t FrameCount; // 0x68
	float FramesPerSecond; // 0x6c
	char bLoop : 1; // 0x70
	UVectorFieldStatic* NoiseField; // 0x78
	float NoiseScale; // 0x80
	float NoiseMax; // 0x84
};

struct UMovieScenePrimitiveMaterialTrack : UMovieScenePropertyTrack {
	int32_t MaterialIndex; // 0xb0
};

struct UDynamicEntryBoxBase : UWidget {
	EDynamicBoxType EntryBoxType; // 0x108
	FVector2D EntrySpacing; // 0x10c
	TArray<FVector2D> SpacingPattern; // 0x118
	FSlateChildSize EntrySizeRule; // 0x128
	EHorizontalAlignment EntryHorizontalAlignment; // 0x130
	EVerticalAlignment EntryVerticalAlignment; // 0x131
	int32_t MaxElementSize; // 0x134
	FRadialBoxSettings RadialBoxSettings; // 0x138
	FUserWidgetPool EntryWidgetPool; // 0x158
};

struct UAssetManager : UObject {
	TArray<UObject*> ObjectReferenceList; // 0x2c0
	bool bIsGlobalAsyncScanEnvironment; // 0x2d0
	bool bShouldGuessTypeAndName; // 0x2d1
	bool bShouldUseSynchronousLoad; // 0x2d2
	bool bIsLoadingFromPakFiles; // 0x2d3
	bool bShouldAcquireMissingChunksOnLoad; // 0x2d4
	bool bOnlyCookProductionAssets; // 0x2d5
	bool bIsBulkScanning; // 0x2d6
	bool bIsPrimaryAssetDirectoryCurrent; // 0x2d7
	bool bIsManagementDatabaseCurrent; // 0x2d8
	bool bUpdateManagementDatabaseAfterScan; // 0x2d9
	bool bIncludeOnlyOnDiskAssets; // 0x2da
	bool bHasCompletedInitialScan; // 0x2db
	int32_t NumberOfSpawnedNotifications; // 0x2dc
};

struct UAnimSingleNodeInstance : UAnimInstance {
	UAnimationAsset* CurrentAsset; // 0x2b8
	FDelegate PostEvaluateAnimEvent; // 0x2c0
};

struct UWBP_AccountLinking_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UCanvasPanel* CanvasPanel_1; // 0x2c8
	UWidgetSwitcher* ContentSwitcher; // 0x2d0
	UWBP_Common_Btn_C* WBP_Common_Btn_EGS; // 0x2d8
	UWBP_Common_Btn_C* WBP_Common_Btn_Steam; // 0x2e0
	UWBP_Generic_Modal_C* WBP_Generic_Modal_ChooseAccount; // 0x2e8
	UWBP_Generic_Modal_C* WBP_Generic_Modal_ConfirmLink; // 0x2f0
	UWBP_Generic_Modal_C* WBP_Generic_Modal_LinkAccounts; // 0x2f8
	UWBP_Generic_Modal_C* WBP_Generic_Modal_LinkingInProgress; // 0x300
	UWBP_Generic_Modal_C* WBP_Generic_Modal_Result; // 0x308
	UYTextBlock* YTextBlock_ProcessingTime; // 0x310
	FName EGS_Platform_Selected; // 0x318
	FName Steam_Platform_Selected; // 0x320
	FName cachedPlatform; // 0x328
};

struct UYDamageNumberComponent : UActorComponent {
	FMulticastInlineDelegate OnRequestDamageNumber; // 0xb0
};

struct AYTestActorWithMarker : AActor {
	UYMapMarkerComponent* m_markerComponent; // 0x240
};

struct UTimeSynchronizableMediaSource : UBaseMediaSource {
	bool bUseTimeSynchronization; // 0x88
	int32_t FrameDelay; // 0x8c
	double TimeDelay; // 0x90
};

struct AYPlayerCameraManager : APlayerCameraManager {
	UYPlayerCameraFoVComponent* m_fovComponent; // 0x27d0
	AActor* m_currentViewTarget; // 0x27d8
	bool m_runCollisionCheck; // 0x27e0
};

struct UImageSequenceProtocol_EXR : UImageSequenceProtocol {
	bool bCompressed; // 0xd8
	EHDRCaptureGamut CaptureGamut; // 0xd9
};

struct UYTextBlock : UTextBlock {
	USlateWidgetStyleAsset* m_normalTextBlockStyleAsset; // 0x2a8
	USlateWidgetStyleAsset* m_hoveredTextBlockStyleAsset; // 0x2b0
	bool m_overrideColorAndOpacity; // 0x2b8
	char m_isChildOfButton : 1; // 0x2bc
};

struct UYBackendInstance : UObject {
	UYPlayfabInstance* m_playfabInstance; // 0x28
};

struct UParticleModuleEventReceiverSpawn : UParticleModuleEventReceiverBase {
	FRawDistributionFloat SpawnCount; // 0x40
	char bUseParticleTime : 1; // 0x70
	char bUsePSysLocation : 1; // 0x70
	char bInheritVelocity : 1; // 0x70
	FRawDistributionVector InheritVelocityScale; // 0x78
	TArray<UPhysicalMaterial*> PhysicalMaterials; // 0xc0
	char bBanPhysicalMaterials : 1; // 0xd0
};

struct UYWidget_UserEntry : UYWidget {
	FYOutpostFriendInfo m_cachedUserInfo; // 0x2c0
};

struct UWBP_ProgressBarBase_C : UYWidget_ProgressBar {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2d0
	FProgressBarStyle MainStyle; // 0x2d8
	FProgressBarStyle DeltaStyle; // 0x478
	FStructure_HUD_ProgressBars UpdateDataMain; // 0x618
	FStructure_HUD_ProgressBars UpdateDataDelta; // 0x640
	float DelayIncrease; // 0x668
	float DelayDecrease; // 0x66c
	float DelayMain; // 0x670
	float DurationIncrease; // 0x674
	float DurationDecrease; // 0x678
	float DurationMain; // 0x67c
	FLinearColor DeltaColorIncrease; // 0x680
	FLinearColor DeltaColorDecrease; // 0x690
	FLinearColor MainColor; // 0x6a0
	FMulticastInlineDelegate OnAnimationDone; // 0x6b0
	float ProgressMain; // 0x6c0
	float ProgressDelta; // 0x6c4
	float ProgressAbsolute; // 0x6c8
};

struct UGeometryCache : UObject {
	TArray<UMaterialInterface*> Materials; // 0x30
	TArray<UGeometryCacheTrack*> Tracks; // 0x40
	int32_t StartFrame; // 0x60
	int32_t EndFrame; // 0x64
};

struct UAITask_MoveTo : UAITask {
	FMulticastInlineDelegate OnRequestFailed; // 0x70
	FMulticastInlineDelegate OnMoveFinished; // 0x80
	FAIMoveRequest MoveRequest; // 0x90
};

struct UYWidget_ProspectorLevel_Small_WBP_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UBorder* Border_1; // 0x268
	UYTextBlock* prospectorLevelText; // 0x270
};

struct UMaterialExpressionArctangent : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UDatasmithC4DImportOptions : UDatasmithOptionsBase {
	bool bImportEmptyMesh; // 0x28
	bool bOptimizeEmptySingleChildActors; // 0x29
	bool bAlwaysGenerateNormals; // 0x2a
	float ScaleVertices; // 0x2c
};

struct UYAnalytics : UObject {
	UYAnalyticsSender* m_analyticsSender; // 0x28
};

struct UMaterialExpressionSaturate : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UParticleModuleAttractorParticle : UParticleModuleAttractorBase {
	FName EmitterName; // 0x30
	FRawDistributionFloat Range; // 0x38
	char bStrengthByDistance : 1; // 0x68
	FRawDistributionFloat Strength; // 0x70
	char bAffectBaseVelocity : 1; // 0xa0
	EAttractorParticleSelectionMethod SelectionMethod; // 0xa4
	char bRenewSource : 1; // 0xa8
	char bInheritSourceVel : 1; // 0xa8
	int32_t LastSelIndex; // 0xac
};

struct ULocalPlayer : UPlayer {
	UGameViewportClient* ViewportClient; // 0x70
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94
	APlayerController* PendingLevelPlayerControllerClass; // 0x98
	char bSentSplitJoin : 1; // 0xa0
	int32_t ControllerId; // 0xb8
};

struct UParticleModuleTypeDataGpu : UParticleModuleTypeDataBase {
	FGPUSpriteEmitterInfo EmitterInfo; // 0x30
	FGPUSpriteResourceData ResourceData; // 0x2b0
	float CameraMotionBlurAmount; // 0x410
	char bClearExistingParticlesOnInit : 1; // 0x414
};

struct UWBP_Common_Simple_Btn_C : UWBP_ButtonBase_Btn_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	UWidgetAnimation* Release_Anim; // 0x3a0
	UWidgetAnimation* Press_Anim; // 0x3a8
	UWidgetAnimation* HighlightSheen_Anim; // 0x3b0
	UWidgetAnimation* Selected_Anim; // 0x3b8
	UWidgetAnimation* Idle_Anim; // 0x3c0
	UWidgetAnimation* HighlightBracket_Anim; // 0x3c8
	UImage* Gfx_Fill; // 0x3d0
	UImage* Gfx_FillDisabled; // 0x3d8
	UImage* Gfx_Stroke; // 0x3e0
	UImage* Icn_Lock; // 0x3e8
	UOverlay* Layout_ButtonDisabled; // 0x3f0
	UNamedSlot* Layout_ContentSlot; // 0x3f8
	UWBP_SelectionHighlight_C* WBP_Deco_SelectionHighlight; // 0x400
	UWBP_SelectionBracket_C* WBP_SelectionBracket; // 0x408
	FLinearColor ButtonColorPrimary; // 0x410
	bool IsDisabled; // 0x420
};

struct UMovieSceneGeometryCacheTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> AnimationSections; // 0x80
};

struct URigVM : UObject {
	FRigVMMemoryContainer WorkMemoryStorage; // 0x28
	FRigVMMemoryContainer LiteralMemoryStorage; // 0xd0
	FRigVMByteCode ByteCodeStorage; // 0x178
	FRigVMInstructionArray Instructions; // 0x1b0
	FRigVMExecuteContext Context; // 0x1c0
	TArray<FName> FunctionNamesStorage; // 0x218
	TArray<FRigVMParameter> Parameters; // 0x248
	TMap<FName, int32_t> ParametersNameMap; // 0x258
	URigVM* DeferredVMToCopy; // 0x2f0
};

struct UYControllerAnnouncementComponent : UActorComponent {
	UAudioComponent* m_audioAnnouncementComponent; // 0xb8
	FMulticastInlineDelegate BP_OnAnnouncementStarted; // 0xc0
	FMulticastInlineDelegate BP_OnAnnouncementStopped; // 0xd0
	FYAnnouncementPlayEntryData m_currentAnnouncementPlaying; // 0xe0
	TArray<FYAnnouncementPlayEntryData> m_queuedAnnouncements; // 0x128
};

struct UYCharacterRevivingComponent : UActorComponent {
	TArray<FGuid> m_appliedAttributeModifiers; // 0xb0
};

struct UYWidget_FpsCounter : UYWidget {
	TWeakObjectPtr<UYUserSettings> m_userSettings; // 0x2c8
};

struct USoundNodeBranch : USoundNode {
	FName BoolParameterName; // 0x48
};

struct APostProcessVolume : AVolume {
	FPostProcessSettings Settings; // 0x280
	float Priority; // 0x7d0
	float BlendRadius; // 0x7d4
	float BlendWeight; // 0x7d8
	char bEnabled : 1; // 0x7dc
	char bUnbound : 1; // 0x7dc
};

struct UNavigationDataChunk : UObject {
	FName NavigationDataName; // 0x28
};

struct UYAISenseConfig_AllyAlert : UAISenseConfig {
	UYAISense_AllyAlert* m_implementationClass; // 0x48
};

struct UYWidget_OutpostSquadNotificationOverview : UYWidget {
	TMap<int32_t, UYWidget_OutpostSquadNotification*> m_squadNotifications; // 0x2c0
};

struct UWBP_Contract_Tooltip_C : UYWidget_FactionContract {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWidgetAnimation* WidgetIn_Anim; // 0x348
	UImage* Gfx_BottomEdge; // 0x350
	UImage* Gfx_BottomEdge_Triangle; // 0x358
	UImage* Gfx_BottomEdge_Triangle_Outer; // 0x360
	UImage* Gfx_Shadow; // 0x368
	UImage* Gfx_TopEdge; // 0x370
	UImage* Gfx_TopEdge_Triangle; // 0x378
	UImage* Gfx_TopEdge_Triangle_Outer; // 0x380
	UHorizontalBox* RewardList; // 0x388
	UVerticalBox* RewardsList; // 0x390
	UTextBlock* Txt_Rewards; // 0x398
	UTextBlock* Txt_TooltipHeader; // 0x3a0
	UWBP_Common_Btn_C* WBP_Cancel_Btn; // 0x3a8
	UWBP_BlurBacker_Panel_C* WBP_Deco_BlurPanel; // 0x3b0
	UWBP_Cost_Entry_C* WBP_FactionProgression_Entry; // 0x3b8
	UWBP_InputKeyNavigation_C* WBP_InputKeyNavigation; // 0x3c0
	UYTextBlock* YTxt_ContractDescription; // 0x3c8
};

struct UPointLightComponent : ULocalLightComponent {
	char bUseInverseSquaredFalloff : 1; // 0x340
	float LightFalloffExponent; // 0x344
	float SourceRadius; // 0x348
	float SoftSourceRadius; // 0x34c
	float SourceLength; // 0x350
};

struct ASocialActor_BP_C : AYSocialActor {
	USceneComponent* DefaultSceneRoot; // 0x2a8
};

struct UModalDialogConnectionLost_WBP_C : UYWidget_ConnectionLost {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* TimerBlink_anim; // 0x2c8
};

struct UYWidget_Shop : UYWidget {
	UYWidget_CurrencyOffersOverview* m_currencyOffersOverview; // 0x2c0
	UYWidget_SeasonOffersOverview* m_seasonOffersOverview; // 0x2c8
	UYWidget_PackOffersOverview* m_packOffersOverview; // 0x2d0
	UYWidget_OfferDetailOverview* m_offerDetailOverview; // 0x2d8
	UYWidget_ShopCategories* m_shopCategories; // 0x2e0
	UWidgetSwitcher* m_widgetSwitcher; // 0x2e8
	UYWidget_SpecialOffersOverview* m_dailyOffersOverview; // 0x2f0
	UYWidget_SpecialOffersOverview* m_weeklyOffersOverview; // 0x2f8
};

struct UModalDialogExitGame_WBP_C : UYWidget_ModalDialogExitGame {
	FPointerToUberGraphFrame UberGraphFrame; // 0x318
	UWidgetAnimation* animateIn; // 0x320
	UWidgetAnimation* AnimateOut; // 0x328
	UBorder* Border_1; // 0x330
	UImage* Image_66; // 0x338
};

struct UBTTask_MoveDirectlyToward : UBTTask_MoveTo {
	char bDisablePathUpdateOnGoalLocationChange : 1; // 0xb0
	char bProjectVectorGoalToNavigation : 1; // 0xb0
	char bUpdatedDeprecatedProperties : 1; // 0xb0
};

struct URichTextBlockImageDecorator : URichTextBlockDecorator {
	UDataTable* ImageSet; // 0x28
};

struct UYWidget_Chat : UYWidget {
	FYChatWindowStyles m_IsInStationSkin; // 0x2c0
	FYChatWindowStyles m_IsInMatchSkin; // 0x6d0
	bool m_hideChatWhenInactive; // 0xae0
	float m_minDurationToKeepChatVisibleAfterMessageShown; // 0xae4
	float m_timeStampLastAcitivity; // 0xae8
	float m_chatIngameWidth; // 0xaec
	bool m_isInMatch; // 0xaf0
	UTextBlock* m_channelTypeTextBlock; // 0xaf8
	UTextBlock* m_chatNotActiveText; // 0xb00
	UTextBlock* m_chatInputDisabled; // 0xb08
	USizeBox* m_channelTypeContainer; // 0xb10
	UYEditableTextBox* m_inputEditableTextBox; // 0xb18
	UCanvasPanel* m_chatMessagesCanvasPanel; // 0xb20
	UVerticalBox* m_chatMessagesVerticalBox; // 0xb28
	UScrollBox* m_chatMessagesScrollBox; // 0xb30
	USizeBox* m_chatSizeBox; // 0xb38
	USizeBox* m_chatTextSizeBox; // 0xb40
	UYWidget_ChatUserMenu* m_chatUserMenu; // 0xb48
	FVector2D m_chatDimensionsResized; // 0xb50
	UYWidget_ChatMessage* m_chatMessageWBPClass; // 0xb58
	TMap<FString, EYChannelType> m_channelTypeAbbreviationMap; // 0xb60
	TMap<EYChannelType, FSlateColor> m_channelTypeColorMap; // 0xbb0
	int32_t m_editableTextBoxMaxCharacterCount; // 0xc00
	UYPlayerMutelist* m_playerMutelistObj; // 0xc40
};

struct UParticleModuleSubUVMovie : UParticleModuleSubUV {
	char bUseEmitterTime : 1; // 0x70
	FRawDistributionFloat FrameRate; // 0x78
	int32_t StartingFrame; // 0xa8
};

struct USpacer : UWidget {
	FVector2D Size; // 0x108
};

struct USpinBox : UWidget {
	float Value; // 0x108
	FDelegate ValueDelegate; // 0x10c
	FSpinBoxStyle WidgetStyle; // 0x120
	USlateWidgetStyleAsset* Style; // 0x408
	int32_t MinFractionalDigits; // 0x410
	int32_t MaxFractionalDigits; // 0x414
	bool bAlwaysUsesDeltaSnap; // 0x418
	float Delta; // 0x41c
	float SliderExponent; // 0x420
	FSlateFontInfo Font; // 0x428
	ETextJustify Justification; // 0x480
	float MinDesiredWidth; // 0x484
	bool ClearKeyboardFocusOnCommit; // 0x488
	bool SelectAllTextOnCommit; // 0x489
	FSlateColor ForegroundColor; // 0x490
	FMulticastInlineDelegate OnValueChanged; // 0x4b8
	FMulticastInlineDelegate OnValueCommitted; // 0x4c8
	FMulticastInlineDelegate OnBeginSliderMovement; // 0x4d8
	FMulticastInlineDelegate OnEndSliderMovement; // 0x4e8
	char bOverride_MinValue : 1; // 0x4f8
	char bOverride_MaxValue : 1; // 0x4f8
	char bOverride_MinSliderValue : 1; // 0x4f8
	char bOverride_MaxSliderValue : 1; // 0x4f8
	float MinValue; // 0x4fc
	float MaxValue; // 0x500
	float MinSliderValue; // 0x504
	float MaxSliderValue; // 0x508
};

struct UPawnAction_Wait : UPawnAction {
	float TimeToWait; // 0x98
};

struct UMaterialExpressionPanner : UMaterialExpression {
	FExpressionInput Coordinate; // 0x40
	FExpressionInput Time; // 0x54
	FExpressionInput Speed; // 0x68
	float SpeedX; // 0x7c
	float SpeedY; // 0x80
	uint32_t ConstCoordinate; // 0x84
	bool bFractionalPart; // 0x88
};

struct ABanner_BP_C : AYBannerActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x258
	UChildActorComponent* SeasonDetailView; // 0x260
	UChildActorComponent* SeasonFirstView; // 0x268
	UBoxComponent* BoxToTriggerOverlaps; // 0x270
	UTextRenderComponent* SecondPlate; // 0x278
	UParticleSystemComponent* Banner_PS; // 0x280
	USkeletalMeshComponent* Prop_Banner_SK; // 0x288
	UTextRenderComponent* NamePlate; // 0x290
	USceneComponent* DefaultSceneRoot; // 0x298
	APlayerState* PlayerState; // 0x2a0
	float ParticleSize; // 0x2a8
	FVector ParticleOffset; // 0x2ac
	FLinearColor ParticleSystemColor; // 0x2b8
	FDataTableRowHandle BannerDTRow; // 0x2c8
	FYBannerVanityRow BannerVanityRow; // 0x2d8
	FText BannerNameOverride; // 0x6b8
	float LineTraceCeilingDistance; // 0x6d0
	TArray<UObject*> SoundsLoaded; // 0x6d8
};

struct UParticleModuleSpawnPerUnit : UParticleModuleSpawnBase {
	float UnitScalar; // 0x38
	float MovementTolerance; // 0x3c
	FRawDistributionFloat SpawnPerUnit; // 0x40
	float MaxFrameDistance; // 0x70
	char bIgnoreSpawnRateWhenMoving : 1; // 0x74
	char bIgnoreMovementAlongX : 1; // 0x74
	char bIgnoreMovementAlongY : 1; // 0x74
	char bIgnoreMovementAlongZ : 1; // 0x74
};

struct UInterpTrackInstFloatProp : UInterpTrackInstProperty {
	float ResetFloat; // 0x58
};

struct UWBP_ItemStatPrimary_Entry_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* Feedback_Anim; // 0x2c8
	UWidgetAnimation* ScreenIn_Anim; // 0x2d0
	USizeBox* ChangeMaxSize; // 0x2d8
	UImage* Gfx_ArrowNegative; // 0x2e0
	UImage* Gfx_ArrowPositive; // 0x2e8
	UImage* Gfx_Flash; // 0x2f0
	UScaleBox* StatValueChangeScaleBox; // 0x2f8
	UScaleBox* StatValueScaleBox; // 0x300
	UTextBlock* Txt_StatLabel; // 0x308
	UTextBlock* Txt_StatValue; // 0x310
	UTextBlock* Txt_StatValueChange; // 0x318
	UWBP_Divider_Vertical_Panel_C* WBP_Divider_Vertical_Panel; // 0x320
	FText Value; // 0x328
	FText Label; // 0x340
	bool ShowDivide; // 0x358
	bool ShowChange; // 0x359
};

struct UEnvQueryGenerator_CurrentLocation : UEnvQueryGenerator {
	UEnvQueryContext* QueryContext; // 0x50
};

struct UMaterialExpressionSphereMask : UMaterialExpression {
	FExpressionInput A; // 0x40
	FExpressionInput B; // 0x54
	FExpressionInput Radius; // 0x68
	FExpressionInput Hardness; // 0x7c
	float AttenuationRadius; // 0x90
	float HardnessPercent; // 0x94
};

struct UYControllerVehicleComponent : UActorComponent {
	UYPlayerCharacterStateComponent* m_characterStateComponent; // 0xd0
	UYCharacterVehicleComponent* m_vehicleCharacterComponent; // 0xd8
};

struct ACameraShakeSourceActor : AActor {
	UCameraShakeSourceComponent* CameraShakeSourceComponent; // 0x240
};

struct UBTDecorator_Cooldown : UBTDecorator {
	float CoolDownTime; // 0x68
};

struct UDebug_ReplaySlot_WBP_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UButton* DeleteReplayButton; // 0x268
	UButton* PlayButton; // 0x270
	UEditableTextBox* ReplayNameTextBox; // 0x278
	FString ReplayName; // 0x280
	FString ReplayFriendlyName; // 0x290
	FS_ReplayInfo ReplayInfo; // 0x2a0
};

struct UYResourceComponent : UActorComponent {
	FMulticastInlineDelegate BP_OnResourceRegeneratingChanged; // 0xb0
	FMulticastInlineDelegate BP_OnResourceDataChanged; // 0xc0
};

struct UMaterialExpressionConstant3Vector : UMaterialExpression {
	FLinearColor Constant; // 0x40
};

struct UMaterialExpressionVectorParameter : UMaterialExpressionParameter {
	FLinearColor DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x68
	char PrimitiveDataIndex; // 0x69
};

struct APainCausingVolume : APhysicsVolume {
	char bPainCausing : 1; // 0x288
	float DamagePerSec; // 0x28c
	UDamageType* DamageType; // 0x290
	float PainInterval; // 0x298
	char bEntryPain : 1; // 0x29c
	char BACKUP_bPainCausing : 1; // 0x29c
	AController* DamageInstigator; // 0x2a0
};

struct UPlayFabAuthenticationContext : UObject {
	FString ClientSessionTicket; // 0x28
	FString EntityToken; // 0x38
	FString DeveloperSecretKey; // 0x48
	FString PlayFabId; // 0x58
};

struct UMovieSceneMaterialTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct UNiagaraDataInterfaceCurlNoise : UNiagaraDataInterface {
	uint32_t Seed; // 0x38
};

struct UForceFeedbackEffect : UObject {
	TArray<FForceFeedbackChannelDetails> ChannelDetails; // 0x28
	float Duration; // 0x38
};

struct USkeletalMeshLODSettings : UDataAsset {
	FPerPlatformInt MinLOD; // 0x30
	FPerPlatformBool DisableBelowMinLodStripping; // 0x34
	bool bOverrideLODStreamingSettings; // 0x35
	FPerPlatformBool bSupportLODStreaming; // 0x36
	FPerPlatformInt MaxNumStreamedLODs; // 0x38
	FPerPlatformInt MaxNumOptionalLODs; // 0x3c
	TArray<FSkeletalMeshLODGroupSettings> LODGroups; // 0x40
};

struct UWebBrowser : UWidget {
	FMulticastInlineDelegate OnUrlChanged; // 0x108
	FMulticastInlineDelegate OnBeforePopup; // 0x118
	FString InitialURL; // 0x128
	bool bSupportsTransparency; // 0x138
};

struct UAnimationSettings : UDeveloperSettings {
	int32_t CompressCommandletVersion; // 0x38
	TArray<FString> KeyEndEffectorsMatchNameArray; // 0x40
	bool ForceRecompression; // 0x50
	bool bForceBelowThreshold; // 0x51
	bool bFirstRecompressUsingCurrentOrDefault; // 0x52
	bool bRaiseMaxErrorToExisting; // 0x53
	bool bEnablePerformanceLog; // 0x54
	bool bStripAnimationDataOnDedicatedServer; // 0x55
	bool bTickAnimationOnSkeletalMeshInit; // 0x56
	TArray<FCustomAttributeSetting> BoneCustomAttributesNames; // 0x58
	TArray<FString> BoneNamesWithCustomAttributes; // 0x68
	TMap<FName, ECustomAttributeBlendType> AttributeBlendModes; // 0x78
	ECustomAttributeBlendType DefaultAttributeBlendMode; // 0xc8
};

struct AYActivityActorManager : AActor {
	UYActivityRegisterComponent* m_registerComponent; // 0x240
	EYActivityType m_activityType; // 0x248
	UObject* m_defaultActivityActorClass; // 0x250
	FMulticastInlineDelegate BP_OnInitialActorSpawningFinished; // 0x2b0
};

struct AWaterBodyCustom : AWaterBody {
	UCustomMeshGenerator* CustomGenerator; // 0xe00
};

struct UYMapMarkerComponent : UActorComponent {
	EYMapMarkerType m_markerType; // 0xb0
	bool m_autoGenerateMarkerData; // 0xb1
	bool m_markerAlwaysVisible; // 0xb2
	bool m_visibleDuringLobby; // 0xb3
	bool m_onlyRelevantInLobby; // 0xb4
	bool m_onlyRelevantToOwner; // 0xb5
	bool m_onlyRelevantToOwnerTeam; // 0xb6
	bool m_staysRelevantOnceDiscovered; // 0xb7
	bool m_autoRemoveWhenHealthEmpty; // 0xb8
	bool m_canChangeStateDuringEvacuation; // 0xb9
	bool m_shouldFollowActorPosition; // 0xba
	bool m_shouldShowLocalDistanceTowardsPlayer; // 0xbb
	bool m_onlyFollowActorPositionForAlly; // 0xbc
	bool m_isClientOnly; // 0xbd
	bool m_centerMinimapOnThisMarker; // 0xbe
	float m_timeOutDuration; // 0xc0
	float m_timeLeft; // 0xc4
	UYMapMarkerData* m_markerDataClass; // 0xc8
	bool m_overrideMarkerWidgetClass; // 0xd0
	UYWidget_MapMarker* m_markerWidgetClass; // 0xd8
	bool m_hideFromOwner; // 0xe0
	int32_t m_markerVisibilityDistance; // 0xe4
	FText m_markerTitle; // 0xe8
	UYMapMarkerData* m_markerData; // 0x100
};

struct UMaterialExpressionFontSampleParameter : UMaterialExpressionFontSample {
	FName ParameterName; // 0x50
	FGuid ExpressionGUID; // 0x58
	FName Group; // 0x68
};

struct UMovieSceneMarginSection : UMovieSceneSection {
	FMovieSceneFloatChannel TopCurve; // 0xe8
	FMovieSceneFloatChannel LeftCurve; // 0x188
	FMovieSceneFloatChannel RightCurve; // 0x228
	FMovieSceneFloatChannel BottomCurve; // 0x2c8
};

struct UYWidget_ApperenceOverview : UYWidget {
	UYWidget_ApperenceCategories* m_itemCategories; // 0x2c8
	TMap<EYApperenceCategoriesTypes, UYWidget*> m_widgetPerType; // 0x2d0
};

struct UYBossHuntMapMarkerData : UYMapMarkerData {
	float m_stateDuration; // 0x148
};

struct UYButtonWidgetStyle : USlateWidgetStyleContainerBase {
	FButtonStyle m_buttonStyle; // 0x30
	FYButtonAudio m_widgetAudio; // 0x2a8
};

struct UBlackboardKeyType_NativeEnum : UBlackboardKeyType {
	FString EnumName; // 0x30
	UEnum* EnumType; // 0x40
};

struct UYWidget_Inbox : UYWidget {
	UButton* m_closeButton; // 0x2c0
	int32_t m_BITimeWhenInboxShown; // 0x2c8
	int32_t m_BITimeWhenMessageShown; // 0x2cc
	UTextBlock* m_messageSenderText; // 0x2d0
	UTextBlock* m_messageSubjectText; // 0x2d8
	URichTextBlock* m_messageContentText; // 0x2e0
	UYWidget_ImageBase* m_messageBannerImage; // 0x2e8
	TMap<FString, UYWidget_InboxMessageEntry*> m_cachedMessages; // 0x2f0
};

struct UARPlaneGeometry : UARTrackedGeometry {
	EARPlaneOrientation Orientation; // 0xf8
	FVector Center; // 0xfc
	FVector Extent; // 0x108
	TArray<FVector> BoundaryPolygon; // 0x118
	UARPlaneGeometry* SubsumedBy; // 0x128
};

struct UReplicationGraphNode_TearOff_ForConnection : UReplicationGraphNode {
	TArray<FTearOffActorInfo> TearOffActors; // 0x50
};

struct APlayerCustomizationPreview_BP_C : AYCharacterCustomizationPlayerActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x5a0
	USkeletalMeshComponent* DBNO_FoamMesh_SK; // 0x5a8
	FName CurrentArchetype; // 0x5b0
	FName AttachWeaponBoneName; // 0x5b8
	EYCustomizationCategory MontageActiveCategory; // 0x5c0
	bool IsEndOfMatch; // 0x5c1
	UAnimMontage* DeathAnimMontage; // 0x5c8
	UAnimSequence* EmoteAnimSequence; // 0x5d0
};

struct UYControllerPlayerQuarterComponent : UActorComponent {
	FMulticastInlineDelegate OnPlayerQuartersLevelUpdated; // 0xc8
	FMulticastInlineDelegate OnPlayerTechtreeNodesUpdated; // 0xd8
	FMulticastInlineDelegate PlayerQuarterPurchaseFailed; // 0xe8
	FMulticastInlineDelegate OnPlayerQuarterLevelUp; // 0xf8
	bool m_playerLeveledUp; // 0x158
};

struct UAnimBoneCompressionCodec : UObject {
	FString Description; // 0x28
};

struct UParticleModuleOrientationAxisLock : UParticleModuleOrientationBase {
	EParticleAxisLock LockAxisFlags; // 0x30
};

struct UPlayFabMatchmakerAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xd8
	UPlayFabJsonObject* RequestJsonObj; // 0xe0
	UPlayFabJsonObject* ResponseJsonObj; // 0xe8
};

struct UGridPanel : UPanelWidget {
	TArray<float> ColumnFill; // 0x120
	TArray<float> RowFill; // 0x130
};

struct UMapMarker_StaticIcon_WBP_C : UYWidget_MapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e0
	UWidgetAnimation* HighlightAnimation; // 0x2e8
	UTextBlock* m_label; // 0x2f0
	UImage* m_markerIcon; // 0x2f8
	EYMapMarkerType m_markerDataType; // 0x300
	EYMapMarkerState m_markerState; // 0x301
	bool ShowQuestionMarkWhenUnknown; // 0x302
	bool IsMaximized; // 0x303
	EYSeasonalEvent CurrentSeasonalEvent; // 0x304
};

struct UYWidget_ItemTooltipContainer : UYWidget {
	UYWidget_ItemTooltipEntryHeader* m_headerWidget; // 0x2c0
	UYWidget_ItemTooltipEntryDescription* m_descriptionWidget; // 0x2c8
	UYWidget_ItemTooltipEntryDescription* m_flavorTextWidget; // 0x2d0
	UYWidget_ItemTooltipEntryImage* m_imageWidget; // 0x2d8
	UTextBlock* m_incompatibleModTextBlock; // 0x2e0
	EYItemTooltipType m_itemTooltipType; // 0x2e8
};

struct UParticleModuleVectorFieldScale : UParticleModuleVectorFieldBase {
	UDistributionFloat* VectorFieldScale; // 0x30
	FRawDistributionFloat VectorFieldScaleRaw; // 0x38
};

struct USourceEffectDynamicsProcessorPreset : USoundEffectSourcePreset {
	FSourceEffectDynamicsProcessorSettings Settings; // 0xb8
};

struct ARadialForceActor : ARigidBodyBase {
	URadialForceComponent* ForceComponent; // 0x240
};

struct UYWidget_PlayerSupport : UYWidget {
	UComboBoxString* m_comboBox; // 0x2c0
	FTimerHandle m_timerHandleCustomerResponse; // 0x2c8
	FMulticastInlineDelegate OnSubmitSupportData; // 0x2d0
	FMulticastInlineDelegate OnClosePlayerSupportWidget; // 0x2e0
	FYPlayerSupportReportRequestData m_cachedData; // 0x2f0
	FMulticastInlineDelegate OnShowSupportDialogDelegate; // 0x328
};

struct UWBP_Contract_Entry_C : UYWidget_FactionContract {
	FPointerToUberGraphFrame UberGraphFrame; // 0x340
	UWidgetAnimation* ActiveButtonState_Anim; // 0x348
	UWidgetAnimation* InActiveState_Anim; // 0x350
	UWidgetAnimation* Clear_Anim; // 0x358
	UWidgetAnimation* ActiveState_Anim; // 0x360
	UWidgetAnimation* CompletedState_Anim; // 0x368
	UWidgetAnimation* LockedState_Anim; // 0x370
	UWidgetAnimation* ScreenIn_Anim; // 0x378
	UUI_ImageBase_WBP_C* BackgroundImage; // 0x380
	UOverlay* ButtonHolder; // 0x388
	UOverlay* CompletedHighlight; // 0x390
	UOverlay* ContractActiveHighlight; // 0x398
	UHorizontalBox* ContractCostHolder; // 0x3a0
	UHorizontalBox* ContractCostHolder_2; // 0x3a8
	USizeBox* ContractEntrySize; // 0x3b0
	UOverlay* ContractFailed; // 0x3b8
	USizeBox* ContractImageSize; // 0x3c0
	UOverlay* ContractLock_Layout; // 0x3c8
	USizeBox* Description; // 0x3d0
	UImage* Gfx_Completed_L; // 0x3d8
	UImage* Gfx_Completed_R; // 0x3e0
	UImage* Gfx_Contract_Icn; // 0x3e8
	UImage* Gfx_FactionLogo; // 0x3f0
	UImage* Gfx_Fail_Bg; // 0x3f8
	UImage* Gfx_Lock_Bg; // 0x400
	UImage* Gfx_Lock_Bg_Highlight_2; // 0x408
	UImage* Gfx_Notch; // 0x410
	UImage* Gfx_ResourcePlaceholder; // 0x418
	UImage* Gfx_ResourcePlaceholder_2; // 0x420
	UImage* Icn_Info; // 0x428
	UImage* Icn_Info_Pulse; // 0x430
	UImage* Icn_Lock; // 0x438
	UImage* Icn_Swap; // 0x440
	UImage* Icn_Timer; // 0x448
	UImage* Image_26; // 0x450
	USizeBox* InfoButton; // 0x458
	UVerticalBox* ObjectivesList; // 0x460
	UHorizontalBox* RewardList; // 0x468
	UVerticalBox* RewardsList; // 0x470
	USizeBox* RightSide; // 0x478
	USpacer* SwapBtnSpacer; // 0x480
	UHorizontalBox* TimerHolder; // 0x488
	UTextBlock* Txt_BtnLabel; // 0x490
	UTextBlock* Txt_ContractName; // 0x498
	UTextBlock* Txt_ContractUnavailable; // 0x4a0
	UTextBlock* Txt_CostCurrencyLabel; // 0x4a8
	UTextBlock* Txt_CostCurrencyLabel_2; // 0x4b0
	UTextBlock* Txt_Difficulty; // 0x4b8
	UTextBlock* Txt_Failed; // 0x4c0
	UTextBlock* Txt_LockedReason; // 0x4c8
	UTextBlock* Txt_LockedReasonNumber; // 0x4d0
	UTextBlock* Txt_Refresh; // 0x4d8
	UTextBlock* Txt_Rewards; // 0x4e0
	UTextBlock* Txt_Timer; // 0x4e8
	UWBP_BlurBackerSimple_Panel_C* WBP_BlurBackerSimple_Panel; // 0x4f0
	UWBP_Common_Empty_Btn_C* WBP_ContractAction_Btn; // 0x4f8
	UWBP_Common_Empty_Btn_C* WBP_ContractSwap_Btn; // 0x500
	UWBP_DividerHorizontal_VarA_Panel_C* WBP_DividerHorizontal_VarA_Panel; // 0x508
	UWBP_Cost_Entry_C* WBP_FactionProgression_Entry; // 0x510
	UWBP_HeaderComplex_Panel_C* WBP_HeaderComplex_Panel; // 0x518
	UYTextBlock* YTxt_ContractDescription; // 0x520
	FText ContractLabel; // 0x528
	bool ShowButton; // 0x540
	bool ShowInfoButton; // 0x541
	FText DifficultyLabel; // 0x548
	bool is Locked; // 0x560
	FLinearColor ButtonStateColorInactiveOrCompleted; // 0x564
	FLinearColor ButtonStateColorActive; // 0x574
	FLinearColor ButtonStateColorInactiveNotPurchasable; // 0x584
	bool ShowImage; // 0x594
	bool ShowFactionIcon; // 0x595
	bool ShowDescription; // 0x596
	bool ShowRewards; // 0x597
	int32_t ContractCost_Cached; // 0x598
	bool ShowObjectives; // 0x59c
	bool ContractIsLocked; // 0x59d
	FMulticastInlineDelegate PressedClaimButton; // 0x5a0
};

struct UGameplayTagsManager : UObject {
	TArray<FGameplayTagSource> TagSources; // 0xc0
	TArray<UDataTable*> GameplayTagTables; // 0x1b0
};

struct UYGameInstance_BP_C : UYGameInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x4e0
};

struct UNetDriver : UObject {
	FString NetConnectionClassName; // 0x30
	FString ReplicationDriverClassName; // 0x40
	int32_t MaxDownloadSize; // 0x50
	char bClampListenServerTickRate : 1; // 0x54
	int32_t NetServerMaxTickRate; // 0x58
	int32_t MaxNetTickRate; // 0x5c
	int32_t MaxInternetClientRate; // 0x60
	int32_t MaxClientRate; // 0x64
	float ServerTravelPause; // 0x68
	float SpawnPrioritySeconds; // 0x6c
	float RelevantTimeout; // 0x70
	float KeepAliveTime; // 0x74
	float InitialConnectTimeout; // 0x78
	float ConnectionTimeout; // 0x7c
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80
	bool bNoTimeouts; // 0x84
	bool bNeverApplyNetworkEmulationSettings; // 0x85
	UNetConnection* ServerConnection; // 0x88
	TArray<UNetConnection*> ClientConnections; // 0x90
	int32_t RecentlyDisconnectedTrackingTime; // 0x100
	UWorld* World; // 0x140
	UPackage* WorldPackage; // 0x148
	UObject* NetConnectionClass; // 0x170
	UObject* ReplicationDriverClass; // 0x178
	FName NetDriverName; // 0x190
	TArray<FChannelDefinition> ChannelDefinitions; // 0x198
	TMap<FName, FChannelDefinition> ChannelDefinitionMap; // 0x1a8
	TArray<UChannel*> ActorChannelPool; // 0x1f8
	float Time; // 0x210
	UReplicationDriver* ReplicationDriver; // 0x6e8
};

struct UYBugReporterComponent_BP_C : UYBugReportingComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	AYPlayerController* PlayerControllerOwner; // 0xb8
	FGuid perkId; // 0xc0
	FDataTableRowHandle perk; // 0xd0
	bool IsRequestingToeTrap; // 0xe0
	float LastTimeToeTrapReported; // 0xe4
	float ToeTrapCooldown; // 0xe8
	FString ScreenShotPath; // 0xf0
	UWBP_Bug_Form_Menu_C* BugReportForm; // 0x100
};

struct UWidgetNavigation : UObject {
	FWidgetNavigationData Up; // 0x28
	FWidgetNavigationData Down; // 0x4c
	FWidgetNavigationData Left; // 0x70
	FWidgetNavigationData Right; // 0x94
	FWidgetNavigationData Next; // 0xb8
	FWidgetNavigationData Previous; // 0xdc
};

struct UYWidget_ItemComponentTextDescription : UYWidget_ItemComponentBase {
	FMulticastInlineDelegate OnItemComponentTextDescription; // 0x300
	UTextBlock* m_descriptionText; // 0x310
};

struct UDatasmithVREDSceneImportData : UDatasmithFBXSceneImportData {
	bool bMergeNodes; // 0x48
	bool bOptimizeDuplicatedNodes; // 0x49
	bool bImportMats; // 0x4a
	FString MatsPath; // 0x50
	bool bImportVar; // 0x60
	bool bCleanVar; // 0x61
	FString VarPath; // 0x68
	bool bImportLightInfo; // 0x78
	FString LightInfoPath; // 0x80
	bool bImportClipInfo; // 0x90
	FString ClipInfoPath; // 0x98
};

struct ULocalizedOverlays : UOverlays {
	UBasicOverlays* DefaultOverlays; // 0x28
	TMap<FString, UBasicOverlays*> LocaleToOverlaysMap; // 0x30
};

struct UEnvQueryTest_Pathfinding : UEnvQueryTest {
	EEnvTestPathfinding TestMode; // 0x1f8
	UEnvQueryContext* Context; // 0x200
	FAIDataProviderBoolValue PathFromContext; // 0x208
	FAIDataProviderBoolValue SkipUnreachable; // 0x240
	UNavigationQueryFilter* FilterClass; // 0x278
};

struct UNavigationQueryFilter : UObject {
	TArray<FNavigationFilterArea> Areas; // 0x28
	FNavigationFilterFlags IncludeFlags; // 0x38
	FNavigationFilterFlags ExcludeFlags; // 0x3c
};

struct UYVivoxManager : UObject {
	FMulticastInlineDelegate OnInitializedVivox; // 0x28
	TArray<UYVivoxComponent*> m_vivoxComponents; // 0x1c0
};

struct UChat_UserMenu_WBP_C : UYWidget_ChatUserMenu {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
	UWidgetAnimation* FadeIn; // 0x2f8
	UWidgetAnimation* FadeOut; // 0x300
	UHorizontalBox* addFriendPanel; // 0x308
	UYButton* addFriendYButton; // 0x310
	UYTextBlock* addFriendYTextBlock; // 0x318
	UImage* BackgroundImage; // 0x320
	UHorizontalBox* blockUserPanel; // 0x328
	UYButton* blockUserYButton; // 0x330
	UYTextBlock* blockUserYTextBlock; // 0x338
	UImage* chatMutedImage; // 0x340
	UImage* chatMuteImage; // 0x348
	UHorizontalBox* ChatMutePanel; // 0x350
	UYButton* chatMuteYButton; // 0x358
	UYTextBlock* chatMuteYTextBlock; // 0x360
	UYButton* closeMenuYButton; // 0x368
	UHorizontalBox* inviteToSquadPanel; // 0x370
	UCanvasPanel* mainCanvasPanel; // 0x378
	UYTextBlock* playerNameYTextBlock; // 0x380
	UHorizontalBox* removeFriendPanel; // 0x388
	UYButton* removeFriendYButton; // 0x390
	UYTextBlock* removeFriendYTextBlock; // 0x398
	UHorizontalBox* reportBox; // 0x3a0
	UImage* reportImage; // 0x3a8
	UHorizontalBox* ReportPanel; // 0x3b0
	UImage* reportSentImage; // 0x3b8
	UYTextBlock* reportUserYTextBlock; // 0x3c0
	UYButton* reportYButton; // 0x3c8
	UImage* Separator; // 0x3d0
	UImage* Separator_2; // 0x3d8
	UImage* Separator_3; // 0x3e0
	UImage* Separator_4; // 0x3e8
	UHorizontalBox* squadInviteBox; // 0x3f0
	UImage* squadInviteSentImage; // 0x3f8
	UYButton* squadInviteYButton; // 0x400
	UYTextBlock* squadInviteYTextBlock; // 0x408
	UImage* voicechatMutedImage; // 0x410
	UImage* voicechatMuteImage; // 0x418
	UHorizontalBox* VoiceChatMutePanel; // 0x420
	UYButton* voicechatMuteYButton; // 0x428
	UYTextBlock* voiceChatMuteYTextBlock; // 0x430
};

struct ANavLinkProxy : AActor {
	TArray<FNavigationLink> PointLinks; // 0x250
	TArray<FNavigationSegmentLink> SegmentLinks; // 0x260
	UNavLinkCustomComponent* SmartLinkComp; // 0x270
	bool bSmartLinkIsRelevant; // 0x278
	FMulticastInlineDelegate OnSmartLinkReached; // 0x280
};

struct UAppleImageUtilsBaseAsyncTaskBlueprintProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
	FAppleImageUtilsImageConversionResult ConversionResult; // 0x60
};

struct UBookMark : UBookmarkBase {
	FVector Location; // 0x28
	FRotator Rotation; // 0x34
	TArray<FString> HiddenLevels; // 0x40
};

struct ASprayActor_BP_C : AYSprayActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
};

struct UYSkeletalMeshComponentFOV : USkeletalMeshComponent {
	float m_defaultFOV; // 0xed0
	float m_lerpFOVSpeed; // 0xed4
	float m_desiredFOV; // 0xed8
	float m_currentFOV; // 0xee0
	bool m_useCustomFOV; // 0xee4
};

struct UPlatformInterfaceBase : UObject {
	TArray<FDelegateArray> AllDelegates; // 0x28
};

struct UInterpTrackInstAnimControl : UInterpTrackInst {
	float LastUpdatePosition; // 0x28
};

struct UNiagaraDataInterfaceArray : UNiagaraDataInterface {
	int32_t MaxElements; // 0x40
};

struct UNiagaraDataInterfaceGrid2DCollectionReader : UNiagaraDataInterfaceGrid2D {
	FString EmitterName; // 0xf8
	FString DIName; // 0x108
};

struct UNiagaraDataInterfaceFieldSystem : UNiagaraDataInterface {
	UBlueprint* BlueprintSource; // 0x38
	AActor* SourceActor; // 0x40
	FIntVector FieldDimensions; // 0x48
	FVector MinBounds; // 0x54
	FVector MaxBounds; // 0x60
};

struct UYWidget_ItemComponentStatsContainer : UYWidget_ItemComponentBase {
	bool m_buildItemsFromRelatedItemHandleAttributes; // 0x300
	FDataTableRowHandle m_relatedItemDataTableRow; // 0x308
};

struct UYWidget_ItemComponentTextOfferCategory : UYWidget_ItemComponentBase {
	UTextBlock* m_offerCategoryText; // 0x300
};

struct USoundSubmix : USoundSubmixWithParentBase {
	char bMuteWhenBackgrounded : 1; // 0x40
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x48
	USoundfieldEncodingSettingsBase* AmbisonicsPluginSettings; // 0x58
	int32_t EnvelopeFollowerAttackTime; // 0x60
	int32_t EnvelopeFollowerReleaseTime; // 0x64
	EGainParamMode GainMode; // 0x68
	float OutputVolume; // 0x6c
	float WetLevel; // 0x70
	float DryLevel; // 0x74
	FMulticastInlineDelegate OnSubmixRecordedFileDone; // 0x78
};

struct UYWidget_ReleaseNotes : UYWidget {
	UTextBlock* m_outputText; // 0x2c0
};

struct UMaterialExpressionAntialiasedTextureMask : UMaterialExpressionTextureSampleParameter2D {
	float Threshold; // 0x80
	ETextureColorChannel Channel; // 0x84
};

struct ULogoutCallbackProxy : UBlueprintAsyncActionBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct AYProjectile : AActor {
	UProjectileMovementComponent* m_movementComponent; // 0x240
	USphereComponent* m_collisionComp; // 0x248
	UParticleSystemComponent* m_particleComponent; // 0x250
	FYProjectileInititalizationData m_initData; // 0x258
	bool m_destroyOnImpact; // 0x309
	float m_traceBehindDistanceOffset; // 0x30c
	FVector m_groundTraceLocation; // 0x310
	bool m_traceToFindGround; // 0x31c
	bool m_drawTraceResult; // 0x31d
	bool m_isLockedOnHomingTarget; // 0x388
	UYWeaponTransportComponent* m_weaponTransportComponent; // 0x390
};

struct UYKilledEventAnalyticsComponent : UActorComponent {
	TMap<FUniqueNetIdRepl, FYPlayerKilledEvent> m_killedEventInfos; // 0xb0
	FMulticastInlineDelegate BP_OnTrySendingKilledEvent; // 0x100
};

struct UMaterialExpressionCurveAtlasRowParameter : UMaterialExpressionScalarParameter {
	UCurveLinearColor* Curve; // 0x60
	UCurveLinearColorAtlas* Atlas; // 0x68
	FExpressionInput InputTime; // 0x70
};

struct UParticleModuleSizeScale : UParticleModuleSizeBase {
	FRawDistributionVector SizeScale; // 0x30
	char EnableX : 1; // 0x78
	char EnableY : 1; // 0x78
	char EnableZ : 1; // 0x78
};

struct USynthSound : USoundWaveProcedural {
	USynthComponent* OwningSynthComponent; // 0x3c0
};

struct UAssetMappingTable : UObject {
	TArray<FAssetMapping> MappedAssets; // 0x28
};

struct UCrowdFollowingComponent : UPathFollowingComponent {
	FVector CrowdAgentMoveDirection; // 0x268
};

struct UDataTable : UObject {
	UScriptStruct* RowStruct; // 0x28
	TArray<UObject*> References; // 0x30
	char bStripFromClientBuilds : 1; // 0x90
	char bIgnoreExtraFields : 1; // 0x90
	char bIgnoreMissingFields : 1; // 0x90
	FString ImportKeyField; // 0x98
};

struct USubmixEffectMultibandCompressorPreset : USoundEffectSubmixPreset {
	FSubmixEffectMultibandCompressorSettings Settings; // 0xb0
};

struct ADatasmithAreaLightActor : AActor {
	EDatasmithAreaLightActorType LightType; // 0x240
	EDatasmithAreaLightActorShape LightShape; // 0x241
	FVector2D Dimensions; // 0x244
	float Intensity; // 0x24c
	ELightUnits IntensityUnits; // 0x250
	FLinearColor Color; // 0x254
	float Temperature; // 0x264
	UTextureLightProfile* IESTexture; // 0x268
	bool bUseIESBrightness; // 0x270
	float IESBrightnessScale; // 0x274
	FRotator Rotation; // 0x278
	float SourceRadius; // 0x284
	float SourceLength; // 0x288
	float AttenuationRadius; // 0x28c
	float SpotlightInnerAngle; // 0x290
	float SpotlightOuterAngle; // 0x294
};

struct UYMapMarkerData : UObject {
	TArray<APlayerController*> m_discoveredPlayers; // 0x28
	AActor* m_owner; // 0x38
	UYCharacterCloakComponent* m_cloakComponent; // 0x40
	TArray<APlayerController*> m_forcedVisibilityPlayers; // 0x48
	EYMapMarkerType m_markerType; // 0x58
	EYMapMarkerState m_markerState; // 0x59
	FText m_markerTitle; // 0x60
	UYWidget_MapMarker* m_markerWidgetClass; // 0x88
	bool m_onlyRelevantToOwner; // 0x90
	bool m_onlyRelevantToOwnerTeam; // 0x91
	bool m_alwaysVisible; // 0x92
	bool m_visibleDuringLobby; // 0x93
	bool m_onlyRelevantInLobby; // 0x94
	bool m_staysRelevantOnceDiscovered; // 0x95
	bool m_centerMinimapOnThisMarker; // 0x96
	bool m_shouldFollowActorPosition; // 0x97
	bool m_onlyFollowActorPositionForAlly; // 0x98
	bool m_autoRemoveWhenHealthEmpty; // 0x99
	bool m_canChangeStateDuringEvacuation; // 0x9a
	float m_timeLeft; // 0xa0
	float m_timeOutDuration; // 0xa4
	bool m_hideFromOwner; // 0xa8
	bool m_ownerIsDead; // 0xa9
	float m_distanceTowardsLocalPlayer; // 0xac
	bool m_shouldShowLocalDistanceTowardsPlayer; // 0xb0
	int32_t m_visibilityDistance; // 0xb4
	FVector m_initialLocation; // 0xb8
	FVector m_worldLocation; // 0xc4
	FVector m_authorithyLastCachedLocation; // 0xd0
	FRotator m_authorithyLastCachedRotation; // 0xdc
	float m_surveilledActorTimeOutDuration; // 0xe8
	float m_surveilledActorRefreshTime; // 0xec
	int32_t m_localEvaluationHandle; // 0xf0
	FRotator m_worldRotation; // 0x114
};

struct APlayerCameraManager : AActor {
	APlayerController* PCOwner; // 0x240
	USceneComponent* TransformComponent; // 0x248
	float DefaultFOV; // 0x258
	float DefaultOrthoWidth; // 0x260
	float DefaultAspectRatio; // 0x268
	FCameraCacheEntry CameraCache; // 0x2b0
	FCameraCacheEntry LastFrameCameraCache; // 0x8a0
	FTViewTarget ViewTarget; // 0xe90
	FTViewTarget PendingViewTarget; // 0x1490
	FCameraCacheEntry CameraCachePrivate; // 0x1ac0
	FCameraCacheEntry LastFrameCameraCachePrivate; // 0x20b0
	TArray<UCameraModifier*> ModifierList; // 0x26a0
	TArray<UCameraModifier*> DefaultModifiers; // 0x26b0
	float FreeCamDistance; // 0x26c0
	FVector FreeCamOffset; // 0x26c4
	FVector ViewTargetOffset; // 0x26d0
	FMulticastInlineDelegate OnAudioFadeChangeEvent; // 0x26e0
	TArray<AEmitterCameraLensEffectBase*> CameraLensEffects; // 0x2700
	UCameraModifier_CameraShake* CachedCameraShakeMod; // 0x2710
	UCameraAnimInst* AnimInstPool[0x8]; // 0x2718
	TArray<FPostProcessSettings> PostProcessBlendCache; // 0x2758
	TArray<UCameraAnimInst*> ActiveAnims; // 0x2778
	TArray<UCameraAnimInst*> FreeAnims; // 0x2788
	ACameraActor* AnimCameraActor; // 0x2798
	char bIsOrthographic : 1; // 0x27a0
	char bDefaultConstrainAspectRatio : 1; // 0x27a0
	char bClientSimulatingViewTarget : 1; // 0x27a0
	char bUseClientSideCameraUpdates : 1; // 0x27a0
	char bGameCameraCutThisFrame : 1; // 0x27a1
	float ViewPitchMin; // 0x27a4
	float ViewPitchMax; // 0x27a8
	float ViewYawMin; // 0x27ac
	float ViewYawMax; // 0x27b0
	float ViewRollMin; // 0x27b4
	float ViewRollMax; // 0x27b8
	float ServerUpdateCameraTimeout; // 0x27c0
};

struct USoundWave : USoundBase {
	int32_t CompressionQuality; // 0x1b8
	int32_t StreamingPriority; // 0x1bc
	ESoundwaveSampleRateSettings SampleRateQuality; // 0x1c0
	ESoundGroup SoundGroup; // 0x1c2
	char bLooping : 1; // 0x1c3
	char bStreaming : 1; // 0x1c3
	char bSeekableStreaming : 1; // 0x1c3
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x1c4
	char bMature : 1; // 0x1c5
	char bManualWordWrap : 1; // 0x1c5
	char bSingleLine : 1; // 0x1c6
	char bIsAmbisonics : 1; // 0x1c6
	TArray<float> FrequenciesToAnalyze; // 0x1c8
	TArray<FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x1d8
	TArray<FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x1e8
	int32_t InitialChunkSize; // 0x1f8
	FString SpokenText; // 0x240
	float SubtitlePriority; // 0x250
	float Volume; // 0x254
	float Pitch; // 0x258
	int32_t NumChannels; // 0x25c
	int32_t SampleRate; // 0x260
	TArray<FSubtitleCue> Subtitles; // 0x270
	UCurveTable* Curves; // 0x280
	UCurveTable* InternalCurves; // 0x288
};

struct UGerstnerWaterWaves : UWaterWaves {
	UGerstnerWaterWaveGeneratorBase* GerstnerWaveGenerator; // 0x28
	TArray<FGerstnerWave> GerstnerWaves; // 0x30
	float MaxWaveHeight; // 0x40
};

struct UMaterialExpressionDecalMipmapLevel : UMaterialExpression {
	FExpressionInput TextureSize; // 0x40
	float ConstWidth; // 0x54
	float ConstHeight; // 0x58
};

struct UMaterialExpressionBreakMaterialAttributes : UMaterialExpression {
	FMaterialAttributesInput MaterialAttributes; // 0x40
};

struct UPlayFabRuntimeSettings : UObject {
	FString ProductionEnvironmentURL; // 0x28
	FString TitleId; // 0x38
	FString DeveloperSecretKey; // 0x48
};

struct UAnimBlueprintGeneratedClass : UBlueprintGeneratedClass {
	TArray<FBakedAnimationStateMachine> BakedStateMachines; // 0x330
	USkeleton* TargetSkeleton; // 0x340
	TArray<FAnimNotifyEvent> AnimNotifies; // 0x348
	TMap<FName, FCachedPoseIndices> OrderedSavedPoseIndicesMap; // 0x358
	TArray<FName> SyncGroupNames; // 0x428
	TArray<FExposedValueHandler> EvaluateGraphExposedInputs; // 0x438
	TMap<FName, FGraphAssetPlayerInformation> GraphAssetPlayerInformation; // 0x448
	TMap<FName, FAnimGraphBlendOptions> GraphBlendOptions; // 0x498
	FPropertyAccessLibrary PropertyAccessLibrary; // 0x4e8
};

struct UAnimSequenceLevelSequenceLink : UAssetUserData {
	FGuid SkelTrackGuid; // 0x28
	FSoftObjectPath PathToLevelSequence; // 0x38
};

struct UWBP_Inventory_PlayerSet_DropArea_Attachments_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UWBP_Inventory_PlayerSet_DropArea_C* UI_Inventory_PlayerSet_DropArea_WBP; // 0x268
	FString weaponItemId; // 0x270
};

struct AMatineeActor : AActor {
	UInterpData* MatineeData; // 0x240
	FName MatineeControllerName; // 0x248
	float PlayRate; // 0x250
	char bPlayOnLevelLoad : 1; // 0x254
	char bForceStartPos : 1; // 0x254
	float ForceStartPosition; // 0x258
	char bLooping : 1; // 0x25c
	char bRewindOnPlay : 1; // 0x25c
	char bNoResetOnRewind : 1; // 0x25c
	char bRewindIfAlreadyPlaying : 1; // 0x25c
	char bDisableRadioFilter : 1; // 0x25c
	char bClientSideOnly : 1; // 0x25c
	char bSkipUpdateIfNotVisible : 1; // 0x25c
	char bIsSkippable : 1; // 0x25c
	int32_t PreferredSplitScreenNum; // 0x260
	char bDisableMovementInput : 1; // 0x264
	char bDisableLookAtInput : 1; // 0x264
	char bHidePlayer : 1; // 0x264
	char bHideHud : 1; // 0x264
	TArray<FInterpGroupActorInfo> GroupActorInfos; // 0x268
	char bShouldShowGore : 1; // 0x278
	TArray<UInterpGroupInst*> GroupInst; // 0x280
	TArray<FCameraCutInfo> CameraCuts; // 0x290
	char bIsPlaying : 1; // 0x2a0
	char bReversePlayback : 1; // 0x2a0
	char bPaused : 1; // 0x2a0
	char bPendingStop : 1; // 0x2a0
	float InterpPosition; // 0x2a4
	char ReplicationForceIsPlaying; // 0x2ac
	FMulticastInlineDelegate OnPlay; // 0x2b0
	FMulticastInlineDelegate OnStop; // 0x2c0
	FMulticastInlineDelegate OnPause; // 0x2d0
};

struct AYPlayerStateBase : APlayerState {
	FMulticastInlineDelegate OnCanSeeSeasonPopupStateChangedDelegate; // 0x360
	UYPlayerBIDataComponent* m_playerBIComponent; // 0x370
	UYPlatformAnalyticsComponent* m_platformAnalyticsComponent; // 0x378
	UYStateInventoryComponent* m_stateInventoryComponent; // 0x380
	UYStateQuestComponent* m_stateQuestComponent; // 0x388
	UYPlayerEOSStatsComponent* m_playerEOSStatsComponent; // 0x390
	bool m_seeSeasonRewardPopup; // 0x398
};

struct APartyBeaconHost : AOnlineBeaconHostObject {
	UPartyBeaconState* State; // 0x268
	bool bLogoutOnSessionTimeout; // 0x2d0
	float SessionTimeoutSecs; // 0x2d4
	float TravelSessionTimeoutSecs; // 0x2d8
};

struct UYWidget_MatchTimer : UYWidget {
	UTextBlock* m_matchTimerTextBlock; // 0x2c0
	EYMatchState m_exclusiveMatchState; // 0x2c8
	FText m_fallbackTimerText; // 0x2d0
};

struct UAxisAngleGizmo : UInteractiveGizmo {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x48
	TScriptInterface<IGizmoFloatParameterSource> AngleSource; // 0x58
	TScriptInterface<IGizmoClickTarget> HitTarget; // 0x68
	TScriptInterface<IGizmoStateTarget> StateTarget; // 0x78
	bool bInInteraction; // 0x88
	FVector RotationOrigin; // 0x8c
	FVector RotationAxis; // 0x98
	FVector RotationPlaneX; // 0xa4
	FVector RotationPlaneY; // 0xb0
	FVector InteractionStartPoint; // 0xbc
	FVector InteractionCurPoint; // 0xc8
	float InteractionStartAngle; // 0xd4
	float InteractionCurAngle; // 0xd8
};

struct UInputActionDelegateBinding : UInputDelegateBinding {
	TArray<FBlueprintInputActionDelegateBinding> InputActionDelegateBindings; // 0x28
};

struct USourceEffectMidSideSpreaderPreset : USoundEffectSourcePreset {
	FSourceEffectMidSideSpreaderSettings Settings; // 0x98
};

struct ADeposit_Pickup_BP_C : AYPickup_Base_BP_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x490
	USphereComponent* ExtraPickupColl; // 0x498
};

struct UPrefabricatorSettings : UDeveloperSettings {
	EPrefabricatorPivotPosition PivotPosition; // 0x38
	bool bAllowDynamicUpdate; // 0x39
	TSet<UObject*> IgnoreBoundingBoxForObjects; // 0x40
	float DefaultThumbnailPitch; // 0x90
	float DefaultThumbnailYaw; // 0x94
	float DefaultThumbnailZoom; // 0x98
};

struct UWBP_Generic_Modal_C : UYWidget_ConfirmationModal {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UWidgetAnimation* ScreenIn_Anim; // 0x2f0
	UHorizontalBox* ButtonHolder; // 0x2f8
	UCanvasPanel* ConfirmationLayout; // 0x300
	UNamedSlot* CustomContentSlot; // 0x308
	USizeBox* LoadingSpinner; // 0x310
	URichTextBlock* RichTxt_Info; // 0x318
	UWBP_BlurFullScreenBacker_Panel_C* WBP_BlurFullScreenBacker; // 0x320
	UWBP_Common_Btn_C* WBP_Btn_Common_Primary; // 0x328
	UWBP_Common_Btn_C* WBP_Btn_Common_Secondary; // 0x330
	UWBP_Footer_B_Panel_C* WBP_Footer_B_Panel; // 0x338
	UWBP_GenericContent_Panel_C* WBP_GenericContent_Panel_Confirmation; // 0x340
	UWBP_LoadingSpinner_C* WBP_LoadingSpinner; // 0x348
	UYTextBlock* YTxt_FauxHeadline; // 0x350
	UYTextBlock* YTxt_Info_3; // 0x358
	UYTextBlock* YTxt_Timer; // 0x360
	FText HeadlineText; // 0x368
	FText ContentText; // 0x380
	bool ShowLoading; // 0x398
	FText PrimaryButtonText; // 0x3a0
	FText SecondaryButtonText; // 0x3b8
	bool isConfirmationModal; // 0x3d0
	bool isCancelationModal; // 0x3d1
	bool isNoButtonModal; // 0x3d2
	bool CloseOnClick; // 0x3d3
	bool HideBackgroundBlur; // 0x3d4
	FString PrimaryButtonBIName; // 0x3d8
	FString ButtonBILocation; // 0x3e8
	FString SecondaryButtonBIName; // 0x3f8
};

struct USphereReflectionCaptureComponent : UReflectionCaptureComponent {
	float InfluenceRadius; // 0x270
	float CaptureDistanceScale; // 0x274
	UDrawSphereComponent* PreviewInfluenceRadius; // 0x278
};

struct UMaterialExpressionDistanceFieldGradient : UMaterialExpression {
	FExpressionInput Position; // 0x40
};

struct UNiagaraEventReceiverEmitterAction_SpawnParticles : UNiagaraEventReceiverEmitterAction {
	uint32_t NumParticles; // 0x28
};

struct UParticleModule : UObject {
	char bSpawnModule : 1; // 0x28
	char bUpdateModule : 1; // 0x28
	char bFinalUpdateModule : 1; // 0x28
	char bUpdateForGPUEmitter : 1; // 0x28
	char bCurvesAsColor : 1; // 0x28
	char b3DDrawMode : 1; // 0x28
	char bSupported3DDrawMode : 1; // 0x28
	char bEnabled : 1; // 0x28
	char bEditable : 1; // 0x29
	char LODDuplicate : 1; // 0x29
	char bSupportsRandomSeed : 1; // 0x29
	char bRequiresLoopingNotification : 1; // 0x29
	char LODValidity; // 0x2a
};

struct UDatasmithMesh : UObject {
	FString MeshName; // 0x28
	bool bIsCollisionMesh; // 0x38
	TArray<FDatasmithMeshSourceModel> SourceModels; // 0x40
};

struct UStaticMeshSocket : UObject {
	FName SocketName; // 0x28
	FVector RelativeLocation; // 0x30
	FRotator RelativeRotation; // 0x3c
	FVector RelativeScale; // 0x48
	FString Tag; // 0x58
};

struct UParticleModuleVectorFieldGlobal : UParticleModuleVectorFieldBase {
	char bOverrideGlobalVectorFieldTightness : 1; // 0x30
	float GlobalVectorFieldScale; // 0x34
	float GlobalVectorFieldTightness; // 0x38
};

struct URig : UObject {
	TArray<FTransformBase> TransformBases; // 0x30
	TArray<FNode> nodes; // 0x40
};

struct AIntervalGizmoActor : AGizmoActor {
	UGizmoLineHandleComponent* UpIntervalComponent; // 0x240
	UGizmoLineHandleComponent* DownIntervalComponent; // 0x248
	UGizmoLineHandleComponent* ForwardIntervalComponent; // 0x250
};

struct UMovieScene3DConstraintSection : UMovieSceneSection {
	FGuid ConstraintId; // 0xe8
	FMovieSceneObjectBindingID ConstraintBindingID; // 0xf8
};

struct UParticleModuleTypeDataRibbon : UParticleModuleTypeDataBase {
	int32_t MaxTessellationBetweenParticles; // 0x30
	int32_t SheetsPerTrail; // 0x34
	int32_t MaxTrailCount; // 0x38
	int32_t MaxParticleInTrailCount; // 0x3c
	char bDeadTrailsOnDeactivate : 1; // 0x40
	char bDeadTrailsOnSourceLoss : 1; // 0x40
	char bClipSourceSegement : 1; // 0x40
	char bEnablePreviousTangentRecalculation : 1; // 0x40
	char bTangentRecalculationEveryFrame : 1; // 0x40
	char bSpawnInitialParticle : 1; // 0x40
	ETrailsRenderAxisOption RenderAxis; // 0x44
	float TangentSpawningScalar; // 0x48
	char bRenderGeometry : 1; // 0x4c
	char bRenderSpawnPoints : 1; // 0x4c
	char bRenderTangents : 1; // 0x4c
	char bRenderTessellation : 1; // 0x4c
	float TilingDistance; // 0x50
	float DistanceTessellationStepSize; // 0x54
	char bEnableTangentDiffInterpScale : 1; // 0x58
	float TangentTessellationScalar; // 0x5c
};

struct UConnectionCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UWidgetAnimation : UMovieSceneSequence {
	UMovieScene* MovieScene; // 0x60
	TArray<FWidgetAnimationBinding> AnimationBindings; // 0x68
	bool bLegacyFinishOnStop; // 0x78
	FString DisplayLabel; // 0x80
};

struct ALevelVariantSetsActor : AActor {
	FSoftObjectPath LevelVariantSets; // 0x240
};

struct UYWidget_InputKeySelector : UYWidget {
	UTextBlock* m_actionTextBlock; // 0x2c0
	UYInputKeySelector* m_mainBinding; // 0x2c8
	UYInputKeySelector* m_alternateBinding; // 0x2d0
};

struct UBTDecorator_SetSenseTuning_C : UBTDecorator_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa0
	FYAISenseTuningRow SavedSenseTuning; // 0xa8
	FDataTableRowHandle SenseTurningRow; // 0x178
};

struct UDemoNetDriver : UNetDriver {
	TMap<FString, FRollbackNetStartupActorInfo> RollbackNetStartupActors; // 0x840
	float CheckpointSaveMaxMSPerFrame; // 0x9ec
	TArray<FMulticastRecordOptions> MulticastRecordOptions; // 0xa10
	bool bIsLocalReplay; // 0xa20
	TArray<APlayerController*> SpectatorControllers; // 0xa28
};

struct UMovieSceneWidgetMaterialTrack : UMovieSceneMaterialTrack {
	TArray<FName> BrushPropertyNamePath; // 0x90
	FName TrackName; // 0xa0
};

struct UParticleModuleAttractorPointGravity : UParticleModuleAttractorBase {
	FVector Position; // 0x30
	float Radius; // 0x3c
	UDistributionFloat* Strength; // 0x40
	FRawDistributionFloat StrengthRaw; // 0x48
};

struct UYWidget_MenuTestRootWidget : UYWidget {
	UButton* m_openScreenButton; // 0x2c0
	UButton* m_closeScreenButton; // 0x2c8
	UEditableTextBox* m_textBox01; // 0x2d0
	UEditableTextBox* m_textBox02; // 0x2d8
};

struct UPhysicsThrusterComponent : USceneComponent {
	float ThrustStrength; // 0x1f8
};

struct UEngineMessage : ULocalMessage {
	FString FailedPlaceMessage; // 0x28
	FString MaxedOutMessage; // 0x38
	FString EnteredMessage; // 0x48
	FString LeftMessage; // 0x58
	FString GlobalNameChange; // 0x68
	FString SpecEnteredMessage; // 0x78
	FString NewPlayerMessage; // 0x88
	FString NewSpecMessage; // 0x98
};

struct USoundNodeDoppler : USoundNode {
	float DopplerIntensity; // 0x48
	bool bUseSmoothing; // 0x4c
	float SmoothingInterpSpeed; // 0x50
};

struct UARPlaneComponent : UARComponent {
	FARPlaneUpdatePayload ReplicatedPayload; // 0x280
};

struct UMovieSceneEventTrack : UMovieSceneNameableTrack {
	char bFireEventsWhenForwards : 1; // 0x80
	char bFireEventsWhenBackwards : 1; // 0x80
	EFireEventsAtPosition EventPosition; // 0x84
	TArray<UMovieSceneSection*> Sections; // 0x88
};

struct UCheatManager : UObject {
	ADebugCameraController* DebugCameraControllerRef; // 0x28
	ADebugCameraController* DebugCameraControllerClass; // 0x30
};

struct UYInventoryAssociationComponent : UActorComponent {
	FYInventoryItem m_itemHandle; // 0xb0
	FMulticastInlineDelegate OnItemDataChanged; // 0x148
};

struct ALevelBounds : AActor {
	UBoxComponent* BoxComponent; // 0x240
	bool bAutoUpdateBounds; // 0x248
};

struct UYWidget_Lobby : UYWidget {
	UWidgetSwitcher* m_topInfoWidgetSwitcher; // 0x2c0
	UTextBlock* m_matchCountdownTextBlock; // 0x2c8
	UWidget* m_countDownPanel; // 0x2d0
};

struct UYControllerTravelComponent : UActorComponent {
	FYTravelRequestData m_currentTravelRequest; // 0xb0
	EYTravelState m_currentTravelState; // 0xf8
	bool m_requestScreenChangeOnLogin; // 0xfc
	bool m_requestedMatchConnection; // 0xfd
};

struct UGameplayTagsSettings : UGameplayTagsList {
	bool ImportTagsFromConfig; // 0x48
	bool WarnOnInvalidTags; // 0x49
	bool FastReplication; // 0x4a
	FString InvalidTagCharacters; // 0x50
	TArray<FGameplayTagCategoryRemap> CategoryRemapping; // 0x60
	TArray<FSoftObjectPath> GameplayTagTableList; // 0x70
	TArray<FGameplayTagRedirect> GameplayTagRedirects; // 0x80
	TArray<FName> CommonlyReplicatedTags; // 0x90
	int32_t NumBitsForContainerSize; // 0xa0
	int32_t NetIndexFirstBitSegment; // 0xa4
	TArray<FRestrictedConfigInfo> RestrictedConfigFiles; // 0xa8
};

struct UMapMarker_Social_WBP_C : UYWidget_SocialMapMarker {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2e8
	UWidgetAnimation* DropPin; // 0x2f0
	UImage* AcknowledgeWidgetImage; // 0x2f8
	UImage* CloseWidgetImage; // 0x300
	UImage* m_iconImage; // 0x308
	UEditableText* m_markerLabel; // 0x310
	UTextBlock* Name; // 0x318
	bool CalculatedMarkerColor; // 0x320
	bool IsLocalPawn; // 0x321
};

struct ANPC_Object_BP_C : AYNPCObject {
	FPointerToUberGraphFrame UberGraphFrame; // 0x290
	UYObjectInteractionComponent* YObjectInteraction; // 0x298
};

struct UWBP_Item_Preview_Attachments_Btn_C : UWBP_ItemTileBase_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x5d8
	UWidgetAnimation* Release_Anim; // 0x5e0
	UWidgetAnimation* Press_Anim; // 0x5e8
	UWidgetAnimation* HighlightSheen_Anim; // 0x5f0
	UWidgetAnimation* Selected_Anim; // 0x5f8
	UWidgetAnimation* Idle_Anim; // 0x600
	UWidgetAnimation* Highlight_Anim; // 0x608
	USizeBox* AttachmentName; // 0x610
	UOverlay* CollapsedComponents; // 0x618
	UOverlay* ComponentsContainer; // 0x620
	UImage* Gfx_Add; // 0x628
	UImage* Gfx_Edge; // 0x630
	UImage* Gfx_FillEdge; // 0x638
	UImage* Gfx_Gradient; // 0x640
	UImage* Gfx_Stroke; // 0x648
	UImage* Gfx_StrokeSelected; // 0x650
	UImage* Gfx_Triangle; // 0x658
	UScaleBox* Image_Centered; // 0x660
	UInvalidationBox* InvalidationBox_1; // 0x668
	UItemComponent_Highlight_Stash_WBP_C* ItemComponent_Highlight_Stash_WBP_84; // 0x670
	UItemComponent_Image_WBP_C* ItemComponent_Image_WBP; // 0x678
	UItemComponent_RarityColor_C* ItemComponent_RarityColor; // 0x680
	UOverlay* Layout_ButtonArtwork; // 0x688
	UCanvasPanel* Layout_ButtonImageContent; // 0x690
	USizeBox* Layout_ButtonSizeBox; // 0x698
	UOverlay* Layout_EmptySlot; // 0x6a0
	USizeBox* Layout_HighlightsSizeBox; // 0x6a8
	UOverlay* Layout_UnavailableSlot; // 0x6b0
	UButton* m_button; // 0x6b8
	UImage* m_Image_ItemCenter; // 0x6c0
	USizeBox* rarity; // 0x6c8
	UBorder* RarityBorder; // 0x6d0
	UNamedSlot* Slot_AdditionalComponents; // 0x6d8
	UTextBlock* Txt_AttachmentName; // 0x6e0
	UWBP_Item_InsuranceTag_C* WBP_Item_InsuranceTag; // 0x6e8
	UWBP_SelectionBracket_C* WBP_SelectionBracket; // 0x6f0
	UWBP_SelectionHighlight_C* WBP_SelectionHighlight; // 0x6f8
	FText AttachmentLabel; // 0x700
	bool UseTooltipVariant; // 0x718
	bool ShowEmptySlot; // 0x719
	bool ShowUnavailableSlot; // 0x71a
	bool IsDisabled; // 0x71b
	EYPlayerSetType slotType; // 0x71c
	EY_AttachmentItemState VisibilityState; // 0x71d
	EYModificationSlotType modType; // 0x71e
};

struct UFindSessionsCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UParticleModuleRotation : UParticleModuleRotationBase {
	FRawDistributionFloat startRotation; // 0x30
};

struct UNiagaraPreviewAxis_InterpParamVector4 : UNiagaraPreviewAxis_InterpParamBase {
	FVector4 Min; // 0x40
	FVector4 Max; // 0x50
};

struct UWmfMediaSettings : UObject {
	bool AllowNonStandardCodecs; // 0x28
	bool LowLatency; // 0x29
	bool NativeAudioOut; // 0x2a
	bool HardwareAcceleratedVideoDecoding; // 0x2b
};

struct UYProgressBarProspectorLevel_WBP_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* UpdateWhiteRadialProgressBar; // 0x2c8
	UWidgetAnimation* UpdateWhiteProgressBar_Reverse; // 0x2d0
	UWidgetAnimation* DifferencePulse; // 0x2d8
	UWidgetAnimation* UpdateYellowProgressBar; // 0x2e0
	UWidgetAnimation* UpdateWhiteProgressBar; // 0x2e8
	UImage* img_Border; // 0x2f0
	UImage* img_RadialBar_BG; // 0x2f8
	UImage* img_RadialBar_Delta; // 0x300
	UImage* img_RadialBar_Main; // 0x308
	UYProgressBar* RedProgressBar; // 0x310
	UYTextBlock* text_CurrentAddText; // 0x318
	UYTextBlock* text_CurrentXP; // 0x320
	UYTextBlock* text_LevelXP; // 0x328
	UUI_ImageBase_WBP_C* UI_ImageBase_WBP; // 0x330
	UYProgressBar* WhiteProgBar; // 0x338
	UWidgetSwitcher* WidgetSwitcher_BarType; // 0x340
	UHorizontalBox* XP_Display_Container; // 0x348
	UYProgressBar* YellowProgBar; // 0x350
	UYWidget_ProspectorLevel_Small_WBP_C* YWidget_ProspectorLevel_Small_WBP; // 0x358
	float CachedPercentage; // 0x360
	float PendingPercentage; // 0x364
	float AnimDuration; // 0x368
	float PlaybackSpeed; // 0x36c
	UAudioComponent* ProgressBarAnim_SoundComponent; // 0x370
	bool PlaySoundDuringAnimation; // 0x378
	bool ProgressBarAnimationReachedFull; // 0x379
	bool ProgressBarAnimationReachedEmpty; // 0x37a
	int32_t ProgressBar_Type; // 0x37c
	int32_t ProgressBar_ParentValue; // 0x380
	FSlateBrush ProgressBar_IconImg; // 0x388
	int32_t ProgressBar_CurrentValue; // 0x410
	int32_t ProgressBar_MaxValue; // 0x414
	bool ShowDetailedInfo; // 0x418
	UMaterialInterface* RadialBar_Material; // 0x420
	bool ShowParentValue; // 0x428
	bool Show_ImgIcon; // 0x429
	int32_t ProgressBar_DeltaValue; // 0x42c
	bool ShowDetailedInfo_AddText; // 0x430
	FMulticastInlineDelegate OnProgressBarAnimFinished; // 0x438
	FLinearColor ProspectorLevelProgressBarColor; // 0x448
	bool ShowRadialProgressBar; // 0x458
};

struct UMaterialExpressionLandscapeGrassOutput : UMaterialExpressionCustomOutput {
	TArray<FGrassInput> GrassTypes; // 0x40
};

struct UMediaPlayer : UObject {
	FMulticastInlineDelegate OnEndReached; // 0x28
	FMulticastInlineDelegate OnMediaClosed; // 0x38
	FMulticastInlineDelegate OnMediaOpened; // 0x48
	FMulticastInlineDelegate OnMediaOpenFailed; // 0x58
	FMulticastInlineDelegate OnPlaybackResumed; // 0x68
	FMulticastInlineDelegate OnPlaybackSuspended; // 0x78
	FMulticastInlineDelegate OnSeekCompleted; // 0x88
	FMulticastInlineDelegate OnTracksChanged; // 0x98
	FTimespan CacheAhead; // 0xa8
	FTimespan CacheBehind; // 0xb0
	FTimespan CacheBehindGame; // 0xb8
	bool NativeAudioOut; // 0xc0
	bool PlayOnOpen; // 0xc1
	char Shuffle : 1; // 0xc4
	char Loop : 1; // 0xc4
	UMediaPlaylist* Playlist; // 0xc8
	int32_t PlaylistIndex; // 0xd0
	FTimespan TimeDelay; // 0xd8
	float HorizontalFieldOfView; // 0xe0
	float VerticalFieldOfView; // 0xe4
	FRotator ViewRotation; // 0xe8
	FGuid PlayerGuid; // 0x120
};

struct UYWidget_ButtonExitToStation : UYWidget {
	FMulticastInlineDelegate OnButtonClicked; // 0x2c0
	UButton* m_button; // 0x2d0
};

struct UMovieSceneSubSection : UMovieSceneSection {
	FMovieSceneSectionParameters Parameters; // 0xe8
	float StartOffset; // 0x10c
	float TimeScale; // 0x110
	float PrerollTime; // 0x114
	UMovieSceneSequence* SubSequence; // 0x118
	LazyObjectProperty ActorToRecord; // 0x120
	FString TargetSequenceName; // 0x140
	FDirectoryPath TargetPathToRecordTo; // 0x150
};

struct UBTService : UBTAuxiliaryNode {
	float Interval; // 0x60
	float RandomDeviation; // 0x64
	char bCallTickOnSearchStart : 1; // 0x68
	char bRestartTimerOnEachActivation : 1; // 0x68
};

struct UYGameEngine : UGameEngine {
	UYEZProfileManager* m_ezProfile; // 0xe90
	FString m_uploadLLMShare; // 0xe98
};

struct UHelmetGoggleComponent_BP_C : UYHelmetGoggleComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UMaterialInstanceDynamic* GoggleMat; // 0xb8
	bool IsEnabled; // 0xc0
};

struct ULevelStreaming : UObject {
	TSoftObjectPtr<UWorld> WorldAsset; // 0x28
	FName PackageNameToLoad; // 0x50
	TArray<FName> LODPackageNames; // 0x58
	FTransform LevelTransform; // 0x80
	int32_t LevelLODIndex; // 0xb0
	int32_t StreamingPriority; // 0xb4
	char bShouldBeVisible : 1; // 0xba
	char bShouldBeLoaded : 1; // 0xba
	char bLocked : 1; // 0xba
	char bIsStatic : 1; // 0xba
	char bShouldBlockOnLoad : 1; // 0xba
	char bShouldBlockOnUnload : 1; // 0xbb
	char bDisableDistanceStreaming : 1; // 0xbb
	char bDrawOnLevelStatusMap : 1; // 0xbb
	FLinearColor LevelColor; // 0xbc
	TArray<ALevelStreamingVolume*> EditorStreamingVolumes; // 0xd0
	float MinTimeBetweenVolumeUnloadRequests; // 0xe0
	FMulticastInlineDelegate OnLevelLoaded; // 0xe8
	FMulticastInlineDelegate OnLevelUnloaded; // 0xf8
	FMulticastInlineDelegate OnLevelShown; // 0x108
	FMulticastInlineDelegate OnLevelHidden; // 0x118
	ULevel* LoadedLevel; // 0x128
	ULevel* PendingUnloadLevel; // 0x130
};

struct USceneCaptureComponent2D : USceneCaptureComponent {
	ECameraProjectionMode ProjectionType; // 0x2b0
	float FOVAngle; // 0x2b4
	float OrthoWidth; // 0x2b8
	UTextureRenderTarget2D* TextureTarget; // 0x2c0
	ESceneCaptureCompositeMode CompositeMode; // 0x2c8
	FPostProcessSettings PostProcessSettings; // 0x2d0
	float PostProcessBlendWeight; // 0x820
	char bOverride_CustomNearClippingPlane : 1; // 0x824
	float CustomNearClippingPlane; // 0x828
	bool bUseCustomProjectionMatrix; // 0x82c
	FMatrix CustomProjectionMatrix; // 0x830
	bool bEnableClipPlane; // 0x870
	FVector ClipPlaneBase; // 0x874
	FVector ClipPlaneNormal; // 0x880
	char bCameraCutThisFrame : 1; // 0x88c
	char bConsiderUnrenderedOpaquePixelAsFullyTranslucent : 1; // 0x88c
	bool bDisableFlipCopyGLES; // 0x890
};

struct UWBP_SocialToggle_C : UYWidget_OutpostSocialToggle {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* HighlightBracket_Anim; // 0x2c8
	UNotificationNumber_WBP_C* notificationNumber; // 0x2d0
	UYTextBlock* onlineNumberYTextBlock; // 0x2d8
	UYButton* socialYToggleButton; // 0x2e0
	UWBP_Notification_C* WBP_Notification; // 0x2e8
	UWBP_SelectionBracket_C* WBP_SelectionBracket; // 0x2f0
	FMulticastInlineDelegate OnSocialToggleClicked; // 0x2f8
};

struct UMaterialExpressionVirtualTextureFeatureSwitch : UMaterialExpression {
	FExpressionInput No; // 0x40
	FExpressionInput Yes; // 0x54
};

struct UWBP_Contracts_Active_C : UYWidget_ActiveContracts {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* WidgetIn_Anim; // 0x2c8
	UOverlay* Background; // 0x2d0
	UVerticalBox* ContractEntries; // 0x2d8
	UImage* Gfx_Edge; // 0x2e0
	UOverlay* Header; // 0x2e8
	UOverlay* HeaderRightAlign; // 0x2f0
	UVerticalBox* Layout_Panel; // 0x2f8
	UTextBlock* Txt_ContractLimit; // 0x300
	UTextBlock* Txt_ContractLimit_2; // 0x308
	UWBP_BlurBacker_Panel_C* WBP_BlurBacker_Panel; // 0x310
	UWBP_Contract_Active_Entry_C* WBP_Contract_Active_Entry_ICA; // 0x318
	UWBP_Contract_Active_Entry_C* WBP_Contract_Active_Entry_Korolev; // 0x320
	UWBP_Contract_Active_Entry_C* WBP_Contract_Active_Entry_Osiris; // 0x328
	UWBP_Header_Left_Panel_C* WBP_Header_Left_Panel; // 0x330
	UWBP_Header_Panel_C* WBP_Header_Panel; // 0x338
	UYControllerContractsActivesDataComponent* ContractComponent; // 0x340
	bool ShowDescriptions; // 0x348
	bool UseAlternateHeader; // 0x349
	bool HideInfoTooltip; // 0x34a
};

struct AYActivityLocationLinked : AYActivityLocationEQS {
	float m_linkRadius; // 0x2f0
	int32_t m_scoreSpawnThreshold; // 0x2f4
	TMap<EYActivityType, int32_t> m_scorePerType; // 0x2f8
	TMap<EYActivityType, int32_t> m_debugInfoActorsInRadius; // 0x348
	EYLinkType m_linkType; // 0x398
	FYEvaluationResult m_lastEvaluationResult; // 0x3a0
};

struct UTestMovieSceneSubTrack : UMovieSceneSubTrack {
	TArray<UMovieSceneSection*> SectionArray; // 0x88
};

struct UStaticMesh : UStreamableRenderAsset {
	FPerPlatformInt MinLOD; // 0x80
	float LpvBiasMultiplier; // 0x84
	TArray<FStaticMaterial> StaticMaterials; // 0x88
	float LightmapUVDensity; // 0x98
	int32_t LightMapResolution; // 0x9c
	bool m_forceVelocityDrawing; // 0xa0
	int32_t LightMapCoordinateIndex; // 0xa4
	float DistanceFieldSelfShadowBias; // 0xa8
	UBodySetup* BodySetup; // 0xb0
	int32_t LODForCollision; // 0xb8
	char bGenerateMeshDistanceField : 1; // 0xbc
	char bStripComplexCollisionForConsole : 1; // 0xbc
	char bHasNavigationData : 1; // 0xbc
	char bSupportUniformlyDistributedSampling : 1; // 0xbc
	char bSupportPhysicalMaterialMasks : 1; // 0xbc
	char bIsBuiltAtRuntime : 1; // 0xbc
	char bAllowCPUAccess : 1; // 0xbc
	char bSupportGpuUniformlyDistributedSampling : 1; // 0xbd
	TArray<UStaticMeshSocket*> Sockets; // 0xe0
	FVector PositiveBoundsExtension; // 0x100
	FVector NegativeBoundsExtension; // 0x10c
	FBoxSphereBounds ExtendedBounds; // 0x118
	int32_t ElementToIgnoreForTexFactor; // 0x134
	TArray<UAssetUserData*> AssetUserData; // 0x138
	UObject* EditableMesh; // 0x148
	UNavCollisionBase* NavCollision; // 0x150
};

struct UYWidget_LobbyFactionDetail : UYWidget {
	FMulticastInlineDelegate OnFactionSelected; // 0x2c0
	FYFactionsDataTableRow m_factionData; // 0x2d0
	FYFactionProgress m_factionProgress; // 0x458
	int32_t m_pointsForNextLevel; // 0x470
};

struct UParticleModuleLocationPrimitiveCylinder : UParticleModuleLocationPrimitiveBase {
	char RadialVelocity : 1; // 0xb0
	FRawDistributionFloat StartRadius; // 0xb8
	FRawDistributionFloat StartHeight; // 0xe8
	CylinderHeightAxis HeightAxis; // 0x118
};

struct UBTTask_SetAIReactionContext_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	EYAIReactionContext AIReactionState; // 0xb0
};

struct ASkyLight : AInfo {
	USkyLightComponent* LightComponent; // 0x240
	char bEnabled : 1; // 0x248
};

struct UYWidget_ItemComponentCraftingPrice : UYWidget_ItemComponentBase {
	bool m_showCurrencies; // 0x300
	bool m_useBackendData; // 0x301
	TMap<FName, UYWidget_ItemContainer*> m_currenciesMap; // 0x308
	TMap<FString, UYWidget_ItemContainer*> m_materialsMap; // 0x358
};

struct UModalDialogOkCancel_WBP_C : UYWidget_ModalDialogOkCancel {
	FPointerToUberGraphFrame UberGraphFrame; // 0x338
	UWidgetAnimation* animateIn; // 0x340
	UWidgetAnimation* AnimateOut; // 0x348
	UBorder* Border_1; // 0x350
	UCommonBackground_WBP_C* CommonBackround_WBP; // 0x358
	UImage* Image_12; // 0x360
	USpacer* Spacer_1; // 0x368
	USpacer* Spacer_2; // 0x370
};

struct UMaterialExpressionScalarParameter : UMaterialExpressionParameter {
	float DefaultValue; // 0x58
	bool bUseCustomPrimitiveData; // 0x5c
	char PrimitiveDataIndex; // 0x5d
};

struct UNavAreaMeta_SwitchByAgent : UNavAreaMeta {
	UNavArea* Agent0Area; // 0x48
	UNavArea* Agent1Area; // 0x50
	UNavArea* Agent2Area; // 0x58
	UNavArea* Agent3Area; // 0x60
	UNavArea* Agent4Area; // 0x68
	UNavArea* Agent5Area; // 0x70
	UNavArea* Agent6Area; // 0x78
	UNavArea* Agent7Area; // 0x80
	UNavArea* Agent8Area; // 0x88
	UNavArea* Agent9Area; // 0x90
	UNavArea* Agent10Area; // 0x98
	UNavArea* Agent11Area; // 0xa0
	UNavArea* Agent12Area; // 0xa8
	UNavArea* Agent13Area; // 0xb0
	UNavArea* Agent14Area; // 0xb8
	UNavArea* Agent15Area; // 0xc0
};

struct UMovieSceneNiagaraTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> Sections; // 0x78
};

struct ULightmassPortalComponent : USceneComponent {
	UBoxComponent* PreviewBox; // 0x1f8
};

struct UWBP_Common_Btn_C : UWBP_ButtonBase_Btn_C {
	FPointerToUberGraphFrame UberGraphFrame; // 0x398
	UWidgetAnimation* ScreenIn_Anim; // 0x3a0
	UWidgetAnimation* Release_Anim; // 0x3a8
	UWidgetAnimation* Press_Anim; // 0x3b0
	UWidgetAnimation* HighlightSheen_Anim; // 0x3b8
	UWidgetAnimation* Selected_Anim; // 0x3c0
	UWidgetAnimation* Idle_Anim; // 0x3c8
	UWidgetAnimation* HighlightBracket_Anim; // 0x3d0
	UImage* Gfx_BtnBacker; // 0x3d8
	UImage* Gfx_Deco_TR; // 0x3e0
	UImage* Gfx_DecoGradient; // 0x3e8
	UImage* Gfx_Edge; // 0x3f0
	UImage* Gfx_Fill; // 0x3f8
	UImage* Gfx_FillDisabled; // 0x400
	UImage* Gfx_Stroke; // 0x408
	UImage* Icn_Lock; // 0x410
	UImage* Icn_Placeholder; // 0x418
	UOverlay* Layout_ButtonDisabled; // 0x420
	UTextBlock* Txt_Label; // 0x428
	UTextBlock* Txt_Label_Light; // 0x430
	UWBP_SelectionHighlight_C* WBP_Deco_SelectionHighlight; // 0x438
	UWBP_InputKey_C* WBP_InputKey; // 0x440
	UWBP_SelectionBracket_C* WBP_SelectionBracket; // 0x448
	FLinearColor ButtonColorPrimary; // 0x450
	FLinearColor ButtonColorSecondary; // 0x460
	FText BtnLabel; // 0x470
	bool UseKeyBinding; // 0x488
	bool UseIcon; // 0x489
	bool IsDisabled; // 0x48a
	bool UseLightText; // 0x48b
};

struct UPlayerBotAimAtTargetTask_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FName combatTarget; // 0xb0
	FVector2D maxAngleError; // 0xb8
	FVector2D maxAngleLongRange; // 0xc0
	FVector2D maxAngleShortRange; // 0xc8
	FName InteractTarget; // 0xd0
	UObject* targetActor; // 0xd8
	FName TimeStampLastTP; // 0xe0
	UBlackboardComponent* Blackboard; // 0xe8
	FName IsCombatTargetClose; // 0xf0
};

struct UParticleModuleKillHeight : UParticleModuleKillBase {
	FRawDistributionFloat Height; // 0x30
	char bAbsolute : 1; // 0x60
	char bFloor : 1; // 0x60
	char bApplyPSysScale : 1; // 0x60
};

struct UYPlayerEOSStatsDataComponent : UActorComponent {
	FDataTableRowHandle m_eosStatNumberOfMatchesEscapedRowHandle; // 0xb0
	FDataTableRowHandle m_eosStatNumberOfMatchesDiedRowHandle; // 0xc0
	FDataTableRowHandle m_eosStatNumberOfMatchesWonRowHandle; // 0xd0
	FDataTableRowHandle m_eosStatNumberOfMatchesPlayedWithContract; // 0xe0
	FDataTableRowHandle m_eosTotalPlacementRowHandle; // 0xf0
	FDataTableRowHandle m_eosActivityTotalVP; // 0x100
	FDataTableRowHandle m_eosActivityHighestVP; // 0x110
	FDataTableRowHandle m_eosStatNumberOfDeaths; // 0x120
	FDataTableRowHandle m_eosStatNumberOfKills; // 0x130
	FDataTableRowHandle m_eosStatHighestNumberOfKills; // 0x140
	FDataTableRowHandle m_eosStatNumberOfVP; // 0x150
	FDataTableRowHandle m_eosStatHighestNumberOfVP; // 0x160
	FDataTableRowHandle m_eosDailyChallengesCompleted; // 0x170
	FDataTableRowHandle m_eosWeeklyChallengesCompleted; // 0x180
	FDataTableRowHandle m_eosSeasonalChallengesCompleted; // 0x190
};

struct UDatasmithStaticMeshGLTFImportData : UDatasmithStaticMeshImportData {
	FString SourceMeshName; // 0x28
};

struct USoundNodeDistanceCrossFade : USoundNode {
	TArray<FDistanceDatum> CrossFadeInput; // 0x48
};

struct UEndMatchCallbackProxy : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate onSuccess; // 0x30
	FMulticastInlineDelegate onFailure; // 0x40
};

struct UParticleSystemReplay : UObject {
	int32_t ClipIDNumber; // 0x28
};

struct URotatingMovementComponent : UMovementComponent {
	FRotator RotationRate; // 0xf0
	FVector PivotTranslation; // 0xfc
	char bRotationInLocalSpace : 1; // 0x108
};

struct UInAppPurchaseQueryCallbackProxy : UObject {
	FMulticastInlineDelegate onSuccess; // 0x28
	FMulticastInlineDelegate onFailure; // 0x38
};

struct URiverGenerator : UWaterBodyGenerator {
	TArray<USplineMeshComponent*> SplineMeshComponents; // 0x28
};

struct UPhononGeometryComponent : USceneComponent {
	bool ExportAllChildren; // 0x1f8
	uint32_t NumVertices; // 0x1fc
	uint32_t NumTriangles; // 0x200
};

struct UYCustomizationCameraComponent : UActorComponent {
	TArray<FYSceneCameraData> m_cameraData; // 0xb0
	FYSceneCameraDataRuntimeData m_runtimeData; // 0xc0
	FMulticastInlineDelegate OnRuntimeCustomizationCameraStateChangedDelegate; // 0xe0
};

struct UYDefaultInventoryDataAsset : UDataAsset {
	bool m_bOverrideBackendInventoryInPIE; // 0x30
	bool m_bOverrideStationBackendInventoryInPIE; // 0x31
	int32_t m_defaultStashSize; // 0x34
	int32_t m_defaultBagSize; // 0x38
	int32_t m_defaultSafeSize; // 0x3c
	int32_t m_defaultPlayerQuarterLevel; // 0x40
	FDataTableRowHandle m_defaultWeaponOne; // 0x48
	TArray<FDataTableRowHandle> m_defaultWeaponOneMods; // 0x58
	FDataTableRowHandle m_defaultWeaponTwo; // 0x68
	TArray<FDataTableRowHandle> m_defaultWeaponTwoMods; // 0x78
	FDataTableRowHandle m_defaultShield; // 0x88
	FDataTableRowHandle m_defaultHelmet; // 0x98
	FDataTableRowHandle m_defaultBag; // 0xa8
	bool m_addBagItems; // 0xb8
	TArray<FDataTableRowHandle> m_bagItems; // 0xc0
};

struct UConstructionSystemBuildTool : UConstructionSystemTool {
	float TraceDistance; // 0x30
	float CursorRotationStepAngle; // 0x34
	UConstructionSystemCursor* Cursor; // 0x38
	UPrefabricatorAssetInterface* ActivePrefabAsset; // 0x40
};

struct UMaterialExpressionTextureBase : UMaterialExpression {
	UTexture* Texture; // 0x40
};

struct AVectorFieldVolume : AActor {
	UVectorFieldComponent* VectorFieldComponent; // 0x240
};

struct UYControllerPlayerMapMarkerComponent : UActorComponent {
	FMulticastInlineDelegate OnMarkerDataUpdated; // 0xb0
	TArray<UYMapMarkerData*> m_mapMarkerData; // 0xc0
	TArray<UYMapMarkerData*> m_clientMarkersData; // 0xd0
};

struct APhysicsConstraintActor : ARigidBodyBase {
	UPhysicsConstraintComponent* ConstraintComp; // 0x240
	AActor* ConstraintActor1; // 0x248
	AActor* ConstraintActor2; // 0x250
	char bDisableCollision : 1; // 0x258
};

struct UYReplicationGraphNode_AlwaysRelevant_ForConnection : UReplicationGraphNode {
	AActor* LastPawn; // 0x278
	TArray<FAlwaysRelevantActorInfo> PastRelevantActors; // 0x280
};

struct UNiagaraDataInterfaceArrayColor : UNiagaraDataInterfaceArray {
	TArray<FLinearColor> ColorData; // 0x50
};

struct UScrollBarWidgetStyle : USlateWidgetStyleContainerBase {
	FScrollBarStyle ScrollBarStyle; // 0x30
};

struct UCircularThrobber : UWidget {
	int32_t NumberOfPieces; // 0x108
	float Period; // 0x10c
	float Radius; // 0x110
	USlateBrushAsset* PieceImage; // 0x118
	FSlateBrush Image; // 0x120
	bool bEnableRadius; // 0x1a8
};

struct UTimecodeProvider : UObject {
	float FrameDelay; // 0x28
};

struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x2a0
	float BaseLookUpRate; // 0x2a4
	UPawnMovementComponent* MovementComponent; // 0x2a8
	USphereComponent* CollisionComponent; // 0x2b0
	UStaticMeshComponent* MeshComponent; // 0x2b8
	char bAddDefaultMovementBindings : 1; // 0x2c0
};

struct UPhysicsAsset : UObject {
	TArray<int32_t> BoundsBodies; // 0x30
	TArray<USkeletalBodySetup*> SkeletalBodySetups; // 0x40
	TArray<UPhysicsConstraintTemplate*> ConstraintSetup; // 0x50
	FSolverIterations SolverIterations; // 0x60
	char bNotForDedicatedServer : 1; // 0x7c
	UThumbnailInfo* ThumbnailInfo; // 0x120
	TArray<UBodySetup*> BodySetup; // 0x128
};

struct UInterpTrackInstDirector : UInterpTrackInst {
	AActor* OldViewTarget; // 0x28
};

struct UMaterialExpressionRuntimeVirtualTextureOutput : UMaterialExpressionCustomOutput {
	FExpressionInput BaseColor; // 0x40
	FExpressionInput Specular; // 0x54
	FExpressionInput Roughness; // 0x68
	FExpressionInput Normal; // 0x7c
	FExpressionInput WorldHeight; // 0x90
	FExpressionInput Opacity; // 0xa4
	FExpressionInput Mask; // 0xb8
};

struct UReplicationGraphNode_GridCell : UReplicationGraphNode_ActorList {
	UReplicationGraphNode* DynamicNode; // 0x140
	UReplicationGraphNode_DormancyNode* DormancyNode; // 0x148
};

struct USubmixEffectFlexiverbPreset : USoundEffectSubmixPreset {
	FSubmixEffectFlexiverbSettings Settings; // 0xa0
};

struct UBTTask_PlaySound : UBTTaskNode {
	USoundCue* SoundToPlay; // 0x70
};

struct UYFootstepComponent : UActorComponent {
	UYPlayerCharacterStateComponent* m_optionalPlayerCharacterStateComponent; // 0xb0
	float m_traceStartOffsetZ; // 0xb8
	float m_traceStartOffsetZCrouching; // 0xbc
	float m_traceDistance; // 0xc0
	float m_traceDistanceLanded; // 0xc4
	float m_traceDistanceSlide; // 0xc8
	float m_speedMaxAudioParameter; // 0xcc
	float m_fallingDistanceMaxAudioParameter; // 0xd0
	bool m_isTracingAsync; // 0xd4
	bool m_isTracingComplex; // 0xd5
	bool m_playFootstepVFXFromAnimNotifier; // 0xd7
	bool m_playSimplifiedFootsteps; // 0xd8
	float m_traceCooldownPhysMaterial; // 0xdc
	FDataTableRowHandle m_footstepRowWalk; // 0xe0
	FDataTableRowHandle m_footstepRowCrouch; // 0xf0
	FDataTableRowHandle m_footstepRowSprint; // 0x100
	FDataTableRowHandle m_footstepRowSprintDash; // 0x110
	FDataTableRowHandle m_footstepRowSoftLanding; // 0x120
	FDataTableRowHandle m_footstepRowMediumLanding; // 0x130
	FDataTableRowHandle m_footstepRowHardLanding; // 0x140
	FDataTableRowHandle m_footstepRowSlideInto; // 0x150
	FDataTableRowHandle m_footstepRowSlideLoop; // 0x160
	FDataTableRowHandle m_footstepRowSlideOut; // 0x170
	UMatineeCameraShake* m_cameraShakePerFootstepCrouch; // 0x180
	UMatineeCameraShake* m_cameraShakePerFootstepWalk; // 0x188
	UMatineeCameraShake* m_cameraShakePerFootstepSprint; // 0x190
	UMatineeCameraShake* m_cameraShakePerFootstepSprintDash; // 0x198
	TMap<EYFeet, FName> m_socketOrBoneNamePerFeetType; // 0x1a0
	FMulticastInlineDelegate BP_OnPlayFootstep; // 0x1f0
	UPhysicalMaterial* m_physMaterialBeneathActor; // 0x200
};

struct UModularSynthComponent : USynthComponent {
	int32_t VoiceCount; // 0x6c0
};

struct UYWidget_ItemComponentBaseMods : UYWidget_ItemComponentBase {
	TArray<UYWidget_ModEntry*> m_itemModWidgets; // 0x300
};

struct UARImageComponent : UARComponent {
	FARImageUpdatePayload ReplicatedPayload; // 0x280
};

struct UBlendProfile : UObject {
	USkeleton* OwningSkeleton; // 0x30
	TArray<FBlendProfileBoneEntry> ProfileEntries; // 0x38
};

struct UMovieScene3DConstraintTrack : UMovieSceneTrack {
	TArray<UMovieSceneSection*> ConstraintSections; // 0x78
};

struct UChaosDestructionListener : USceneComponent {
	char bIsCollisionEventListeningEnabled : 1; // 0x1f8
	char bIsBreakingEventListeningEnabled : 1; // 0x1f8
	char bIsTrailingEventListeningEnabled : 1; // 0x1f8
	FChaosCollisionEventRequestSettings CollisionEventRequestSettings; // 0x1fc
	FChaosBreakingEventRequestSettings BreakingEventRequestSettings; // 0x214
	FChaosTrailingEventRequestSettings TrailingEventRequestSettings; // 0x22c
	TSet<AChaosSolverActor*> ChaosSolverActors; // 0x248
	TSet<AGeometryCollectionActor*> GeometryCollectionActors; // 0x298
	FMulticastInlineDelegate OnCollisionEvents; // 0x2e8
	FMulticastInlineDelegate OnBreakingEvents; // 0x2f8
	FMulticastInlineDelegate OnTrailingEvents; // 0x308
};

struct UParticleModuleSize : UParticleModuleSizeBase {
	FRawDistributionVector StartSize; // 0x30
};

struct UBasicReplicationGraph : UReplicationGraph {
	UReplicationGraphNode_GridSpatialization2D* GridNode; // 0x498
	UReplicationGraphNode_ActorList* AlwaysRelevantNode; // 0x4a0
	TArray<FConnectionAlwaysRelevantNodePair> AlwaysRelevantForConnectionList; // 0x4a8
	TArray<AActor*> ActorsWithoutNetConnection; // 0x4b8
};

struct UPhysicsSettings : UPhysicsSettingsCore {
	FRigidBodyErrorCorrection PhysicErrorCorrection; // 0xe0
	ESettingsLockedAxis LockedAxis; // 0x114
	ESettingsDOF DefaultDegreesOfFreedom; // 0x115
	bool bSuppressFaceRemapTable; // 0x116
	bool bSupportUVFromHitResults; // 0x117
	bool bDisableActiveActors; // 0x118
	bool bDisableKinematicStaticPairs; // 0x119
	bool bDisableKinematicKinematicPairs; // 0x11a
	bool bDisableCCD; // 0x11b
	bool bEnableEnhancedDeterminism; // 0x11c
	float AnimPhysicsMinDeltaTime; // 0x120
	bool bSimulateAnimPhysicsAfterReset; // 0x124
	float MaxPhysicsDeltaTime; // 0x128
	bool bSubstepping; // 0x12c
	bool bSubsteppingAsync; // 0x12d
	float MaxSubstepDeltaTime; // 0x130
	int32_t MaxSubsteps; // 0x134
	float SyncSceneSmoothingFactor; // 0x138
	float InitialAverageFrameRate; // 0x13c
	int32_t PhysXTreeRebuildRate; // 0x140
	TArray<FPhysicalSurfaceName> PhysicalSurfaces; // 0x148
	FBroadphaseSettings DefaultBroadphaseSettings; // 0x158
	float MinDeltaVelocityForHitEvents; // 0x198
	FChaosPhysicsSettings ChaosSettings; // 0x19c
};

struct ALandscapeStreamingProxy : ALandscapeProxy {
	LazyObjectProperty LandscapeActor; // 0x5b8
};

struct UStreamingSettings : UDeveloperSettings {
	char AsyncLoadingThreadEnabled : 1; // 0x38
	char WarnIfTimeLimitExceeded : 1; // 0x38
	float TimeLimitExceededMultiplier; // 0x3c
	float TimeLimitExceededMinTime; // 0x40
	int32_t MinBulkDataSizeForAsyncLoading; // 0x44
	char UseBackgroundLevelStreaming : 1; // 0x48
	char AsyncLoadingUseFullTimeLimit : 1; // 0x48
	float AsyncLoadingTimeLimit; // 0x4c
	float PriorityAsyncLoadingExtraTime; // 0x50
	float LevelStreamingActorsUpdateTimeLimit; // 0x54
	float PriorityLevelStreamingActorsUpdateExtraTime; // 0x58
	int32_t LevelStreamingComponentsRegistrationGranularity; // 0x5c
	float LevelStreamingUnregisterComponentsTimeLimit; // 0x60
	int32_t LevelStreamingComponentsUnregistrationGranularity; // 0x64
	char FlushStreamingOnExit : 1; // 0x68
	char EventDrivenLoaderEnabled : 1; // 0x68
};

struct AYGameState_Base : AGameStateBase {
	FString m_battleServerId; // 0x290
	bool m_battleServerBeginnerFlag; // 0x2a0
	FName m_gameModeName; // 0x2a4
	bool m_useBackendGearset; // 0x2ac
	bool m_allowsDroppingMoney; // 0x2ad
	TArray<FDataTableRowHandle> m_blockedVoicelineCategories; // 0x2b0
	AYPlayersMapDataManager* m_playersMapDataManager; // 0x2c0
	bool m_haveMinimapManager; // 0x2c8
	bool m_travelPostAuthorization; // 0x2c9
	float m_introDuration; // 0x2cc
	FDataTableRowHandle m_gameModeTuningHandle; // 0x2d0
	FDataTableRowHandle m_performanceHandleOverride; // 0x2e0
	UYSceneManager* m_sceneManager; // 0x2f8
	UYPlayerEOSStatsDataComponent* m_playerEosStatsDataComponent; // 0x300
	UYPlayersStatsComponent* m_playersStatsComponent; // 0x308
	UYGameStateCustomizationComponent* m_customizationStateComponent; // 0x310
	AYPerformanceResourceManager* m_resourceManager; // 0x318
	UYInventoryComponentManager* m_inventoryComponentsManager; // 0x320
};

struct UMaterialShaderQualitySettings : UObject {
	TMap<FName, UShaderPlatformQualitySettings*> ForwardSettingMap; // 0x28
};

struct UNiagaraDataInterfaceStaticMesh : UNiagaraDataInterface {
	ENDIStaticMesh_SourceMode SourceMode; // 0x38
	UStaticMesh* DefaultMesh; // 0x40
	AActor* Source; // 0x48
	UStaticMeshComponent* SourceComponent; // 0x50
	FNDIStaticMeshSectionFilter SectionFilter; // 0x58
	bool bUsePhysicsBodyVelocity; // 0x68
	TArray<FName> FilteredSockets; // 0x70
};

struct UYDestructibleMeshComponent : UDestructibleComponent {
	FMulticastInlineDelegate OnChunkDestroyed; // 0x768
};

struct UWBP_LoadingOverlay_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UCanvasPanel* LoadingOverlay; // 0x268
	UTextBlock* Txt_Message; // 0x270
	UWBP_BlurFullScreenBacker_Panel_C* WBP_BlurFullScreenBacker_Panel; // 0x278
	UWBP_LoadingSpinner_C* WBP_LoadingSpinner; // 0x280
	bool shouldShow; // 0x288
	bool ShowText; // 0x289
	FText Description; // 0x290
};

struct UInterpTrackInstProperty : UInterpTrackInst {
	TFieldPath<FProperty> InterpProperty; // 0x28
	UObject* PropertyOuterObjectInst; // 0x48
};

struct USoundNodeRandom : USoundNode {
	TArray<float> Weights; // 0x48
	TArray<bool> HasBeenUsed; // 0x58
	int32_t NumRandomUsed; // 0x68
	int32_t PreselectAtLevelLoad; // 0x6c
	char bShouldExcludeFromBranchCulling : 1; // 0x70
	char bSoundCueExcludedFromBranchCulling : 1; // 0x70
	char bRandomizeWithoutReplacement : 1; // 0x70
};

struct UAnimationSharingStateProcessor : UObject {
	TSoftObjectPtr<UEnum> AnimationStateEnum; // 0x28
};

struct UOnlineEngineInterfaceImpl : UOnlineEngineInterface {
	FName VoiceSubsystemNameOverride; // 0x28
};

struct UYGameSessionManager : UObject {
	FMulticastInlineDelegate OnPlayedMultiplayerStateChanged; // 0x28
};

struct UYMenuScreenHomeSubScreen : UYScreenBase {
	UYScreenBase* m_entryScreenBP; // 0xb0
};

struct UYPlayerControllerHelperComponent : UActorComponent {
	TMap<EYActivityType, UYActorUIComponent*> m_uiComponents; // 0xb0
};

struct UPlayFabDataAPI : UOnlineBlueprintCallProxyBase {
	FMulticastInlineDelegate OnPlayFabResponse; // 0x30
	UPlayFabAuthenticationContext* CallAuthenticationContext; // 0xf8
	UPlayFabJsonObject* RequestJsonObj; // 0x100
	UPlayFabJsonObject* ResponseJsonObj; // 0x108
};

struct UARSessionConfig : UDataAsset {
	bool bGenerateMeshDataFromTrackedGeometry; // 0x30
	bool bGenerateCollisionForMeshData; // 0x31
	bool bGenerateNavMeshForMeshData; // 0x32
	bool bUseMeshDataForOcclusion; // 0x33
	bool bRenderMeshDataInWireframe; // 0x34
	bool bTrackSceneObjects; // 0x35
	bool bUsePersonSegmentationForOcclusion; // 0x36
	bool bUseSceneDepthForOcclusion; // 0x37
	bool bUseAutomaticImageScaleEstimation; // 0x38
	bool bUseStandardOnboardingUX; // 0x39
	EARWorldAlignment WorldAlignment; // 0x3a
	EARSessionType SessionType; // 0x3b
	EARPlaneDetectionMode PlaneDetectionMode; // 0x3c
	bool bHorizontalPlaneDetection; // 0x3d
	bool bVerticalPlaneDetection; // 0x3e
	bool bEnableAutoFocus; // 0x3f
	EARLightEstimationMode LightEstimationMode; // 0x40
	EARFrameSyncMode FrameSyncMode; // 0x41
	bool bEnableAutomaticCameraOverlay; // 0x42
	bool bEnableAutomaticCameraTracking; // 0x43
	bool bResetCameraTracking; // 0x44
	bool bResetTrackedObjects; // 0x45
	TArray<UARCandidateImage*> CandidateImages; // 0x48
	int32_t MaxNumSimultaneousImagesTracked; // 0x58
	EAREnvironmentCaptureProbeType EnvironmentCaptureProbeType; // 0x5c
	TArray<char> WorldMapData; // 0x60
	TArray<UARCandidateObject*> CandidateObjects; // 0x70
	FARVideoFormat DesiredVideoFormat; // 0x80
	bool bUseOptimalVideoFormat; // 0x8c
	EARFaceTrackingDirection FaceTrackingDirection; // 0x8d
	EARFaceTrackingUpdate FaceTrackingUpdate; // 0x8e
	int32_t MaxNumberOfTrackedFaces; // 0x90
	TArray<char> SerializedARCandidateImageDatabase; // 0x98
	EARSessionTrackingFeature EnabledSessionTrackingFeature; // 0xa8
	EARSceneReconstruction SceneReconstructionMethod; // 0xa9
	UARPlaneComponent* PlaneComponentClass; // 0xb0
	UARPointComponent* PointComponentClass; // 0xb8
	UARFaceComponent* FaceComponentClass; // 0xc0
	UARImageComponent* ImageComponentClass; // 0xc8
	UARQRCodeComponent* QRCodeComponentClass; // 0xd0
	UARPoseComponent* PoseComponentClass; // 0xd8
	UAREnvironmentProbeComponent* EnvironmentProbeComponentClass; // 0xe0
	UARObjectComponent* ObjectComponentClass; // 0xe8
	UARMeshComponent* MeshComponentClass; // 0xf0
	UARGeoAnchorComponent* GeoAnchorComponentClass; // 0xf8
	UMaterialInterface* DefaultMeshMaterial; // 0x100
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x108
};

struct UDatasmithStaticMeshComponentTemplate : UDatasmithObjectTemplate {
	UStaticMesh* StaticMesh; // 0x30
	TArray<UMaterialInterface*> OverrideMaterials; // 0x38
};

struct UTextLayoutWidget : UWidget {
	FShapedTextOptions ShapedTextOptions; // 0x108
	ETextJustify Justification; // 0x10b
	ETextWrappingPolicy WrappingPolicy; // 0x10c
	char AutoWrapText : 1; // 0x10d
	float WrapTextAt; // 0x110
	FMargin Margin; // 0x114
	float LineHeightPercentage; // 0x124
};

struct UParticleModuleOrbit : UParticleModuleOrbitBase {
	EOrbitChainMode ChainMode; // 0x38
	FRawDistributionVector OffsetAmount; // 0x40
	FOrbitOptions OffsetOptions; // 0x88
	FRawDistributionVector RotationAmount; // 0x90
	FOrbitOptions RotationOptions; // 0xd8
	FRawDistributionVector RotationRateAmount; // 0xe0
	FOrbitOptions RotationRateOptions; // 0x128
};

struct UYWidget_QuestInfo : UYWidget {
	UTextBlock* m_questName; // 0x2c0
	UTextBlock* m_questTaskText; // 0x2c8
	UTextBlock* m_questCurrentProgress; // 0x2d0
	UTextBlock* m_questMaxProgress; // 0x2d8
};

struct UGizmoBoxComponent : UGizmoBaseComponent {
	FVector Origin; // 0x460
	FQuat Rotation; // 0x470
	FVector Dimensions; // 0x480
	float LineThickness; // 0x48c
	bool bRemoveHiddenLines; // 0x490
	bool bEnableAxisFlip; // 0x491
};

struct UPlayerBotStopPerformanceCaptureTask_C : UBTTask_BlueprintBase {
	FPointerToUberGraphFrame UberGraphFrame; // 0xa8
	FString playerRotation; // 0xb0
	FString PlayerPosition; // 0xc0
	FString playerGamemode; // 0xd0
	TArray<FString> questsArray; // 0xe0
	FString playerQuests; // 0xf0
};

struct UParticleModuleParameterDynamic_Seeded : UParticleModuleParameterDynamic {
	FParticleRandomSeedInfo RandomSeedInfo; // 0x48
};

struct UPartyBeaconState : UObject {
	FName SessionName; // 0x28
	int32_t NumConsumedReservations; // 0x30
	int32_t MaxReservations; // 0x34
	int32_t NumTeams; // 0x38
	int32_t NumPlayersPerTeam; // 0x3c
	FName TeamAssignmentMethod; // 0x40
	int32_t ReservedHostTeamNum; // 0x48
	int32_t ForceTeamNum; // 0x4c
	bool bRestrictCrossConsole; // 0x50
	bool bEnableRemovalRequests; // 0x51
	TArray<FPartyReservation> Reservations; // 0x58
};

struct UInterpTrackVectorBase : UInterpTrack {
	FInterpCurveVector VectorTrack; // 0x70
	float CurveTension; // 0x88
};

struct AEmitter : AActor {
	UParticleSystemComponent* ParticleSystemComponent; // 0x240
	char bDestroyOnSystemFinish : 1; // 0x248
	char bPostUpdateTickGroup : 1; // 0x248
	char bCurrentlyActive : 1; // 0x248
	FMulticastInlineDelegate OnParticleSpawn; // 0x250
	FMulticastInlineDelegate OnParticleBurst; // 0x260
	FMulticastInlineDelegate OnParticleDeath; // 0x270
	FMulticastInlineDelegate OnParticleCollide; // 0x280
};

struct UDatasmithPointLightComponentTemplate : UDatasmithObjectTemplate {
	ELightUnits IntensityUnits; // 0x30
	float SourceRadius; // 0x34
	float SourceLength; // 0x38
	float AttenuationRadius; // 0x3c
};

struct UEngine : UObject {
	UFont* TinyFont; // 0x30
	FSoftObjectPath TinyFontName; // 0x38
	UFont* SmallFont; // 0x50
	FSoftObjectPath SmallFontName; // 0x58
	UFont* MediumFont; // 0x70
	FSoftObjectPath MediumFontName; // 0x78
	UFont* LargeFont; // 0x90
	FSoftObjectPath LargeFontName; // 0x98
	UFont* SubtitleFont; // 0xb0
	FSoftObjectPath SubtitleFontName; // 0xb8
	TArray<UFont*> AdditionalFonts; // 0xd0
	TArray<FString> AdditionalFontNames; // 0xe0
	UConsole* ConsoleClass; // 0xf0
	FSoftClassPath ConsoleClassName; // 0xf8
	UGameViewportClient* GameViewportClientClass; // 0x110
	FSoftClassPath GameViewportClientClassName; // 0x118
	ULocalPlayer* LocalPlayerClass; // 0x130
	FSoftClassPath LocalPlayerClassName; // 0x138
	AWorldSettings* WorldSettingsClass; // 0x150
	FSoftClassPath WorldSettingsClassName; // 0x158
	FSoftClassPath NavigationSystemClassName; // 0x170
	UNavigationSystemBase* NavigationSystemClass; // 0x188
	FSoftClassPath NavigationSystemConfigClassName; // 0x190
	UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1a8
	FSoftClassPath AvoidanceManagerClassName; // 0x1b0
	UAvoidanceManager* AvoidanceManagerClass; // 0x1c8
	FSoftClassPath AIControllerClassName; // 0x1d0
	UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1e8
	FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1f0
	FSoftClassPath GameUserSettingsClassName; // 0x208
	UGameUserSettings* GameUserSettingsClass; // 0x220
	UGameUserSettings* GameUserSettings; // 0x228
	ALevelScriptActor* LevelScriptActorClass; // 0x230
	FSoftClassPath LevelScriptActorClassName; // 0x238
	FSoftClassPath DefaultBlueprintBaseClassName; // 0x250
	FSoftClassPath GameSingletonClassName; // 0x268
	UObject* GameSingleton; // 0x280
	FSoftClassPath AssetManagerClassName; // 0x288
	UAssetManager* AssetManager; // 0x2a0
	UTexture2D* DefaultTexture; // 0x2a8
	FSoftObjectPath DefaultTextureName; // 0x2b0
	UTexture* DefaultDiffuseTexture; // 0x2c8
	FSoftObjectPath DefaultDiffuseTextureName; // 0x2d0
	UTexture2D* DefaultBSPVertexTexture; // 0x2e8
	FSoftObjectPath DefaultBSPVertexTextureName; // 0x2f0
	UTexture2D* HighFrequencyNoiseTexture; // 0x308
	FSoftObjectPath HighFrequencyNoiseTextureName; // 0x310
	UTexture2D* DefaultBokehTexture; // 0x328
	FSoftObjectPath DefaultBokehTextureName; // 0x330
	UTexture2D* DefaultBloomKernelTexture; // 0x348
	FSoftObjectPath DefaultBloomKernelTextureName; // 0x350
	UMaterial* WireframeMaterial; // 0x368
	FString WireframeMaterialName; // 0x370
	UMaterial* DebugMeshMaterial; // 0x380
	FSoftObjectPath DebugMeshMaterialName; // 0x388
	UMaterial* EmissiveMeshMaterial; // 0x3a0
	FSoftObjectPath EmissiveMeshMaterialName; // 0x3a8
	UMaterial* LevelColorationLitMaterial; // 0x3c0
	FString LevelColorationLitMaterialName; // 0x3c8
	UMaterial* LevelColorationUnlitMaterial; // 0x3d8
	FString LevelColorationUnlitMaterialName; // 0x3e0
	UMaterial* LightingTexelDensityMaterial; // 0x3f0
	FString LightingTexelDensityName; // 0x3f8
	UMaterial* ShadedLevelColorationLitMaterial; // 0x408
	FString ShadedLevelColorationLitMaterialName; // 0x410
	UMaterial* ShadedLevelColorationUnlitMaterial; // 0x420
	FString ShadedLevelColorationUnlitMaterialName; // 0x428
	UMaterial* RemoveSurfaceMaterial; // 0x438
	FSoftObjectPath RemoveSurfaceMaterialName; // 0x440
	UMaterial* VertexColorMaterial; // 0x458
	FString VertexColorMaterialName; // 0x460
	UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x470
	FString VertexColorViewModeMaterialName_ColorOnly; // 0x478
	UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x488
	FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x490
	UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4a0
	FString VertexColorViewModeMaterialName_RedOnly; // 0x4a8
	UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4b8
	FString VertexColorViewModeMaterialName_GreenOnly; // 0x4c0
	UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4d0
	FString VertexColorViewModeMaterialName_BlueOnly; // 0x4d8
	FSoftObjectPath DebugEditorMaterialName; // 0x4e8
	UMaterial* ConstraintLimitMaterial; // 0x500
	UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x508
	UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x510
	UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x518
	UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x520
	UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x528
	UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x530
	UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x538
	UMaterial* InvalidLightmapSettingsMaterial; // 0x540
	FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x548
	UMaterial* PreviewShadowsIndicatorMaterial; // 0x560
	FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x568
	UMaterial* ArrowMaterial; // 0x580
	UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x588
	FSoftObjectPath ArrowMaterialName; // 0x590
	FLinearColor LightingOnlyBrightness; // 0x5a8
	TArray<FLinearColor> ShaderComplexityColors; // 0x5b8
	TArray<FLinearColor> QuadComplexityColors; // 0x5c8
	TArray<FLinearColor> LightComplexityColors; // 0x5d8
	TArray<FLinearColor> StationaryLightOverlapColors; // 0x5e8
	TArray<FLinearColor> LODColorationColors; // 0x5f8
	TArray<FLinearColor> HLODColorationColors; // 0x608
	TArray<FLinearColor> StreamingAccuracyColors; // 0x618
	float MaxPixelShaderAdditiveComplexityCount; // 0x628
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x62c
	float MinLightMapDensity; // 0x630
	float IdealLightMapDensity; // 0x634
	float MaxLightMapDensity; // 0x638
	char bRenderLightMapDensityGrayscale : 1; // 0x63c
	float RenderLightMapDensityGrayscaleScale; // 0x640
	float RenderLightMapDensityColorScale; // 0x644
	FLinearColor LightMapDensityVertexMappedColor; // 0x648
	FLinearColor LightMapDensitySelectedColor; // 0x658
	TArray<FStatColorMapping> StatColorMappings; // 0x668
	UPhysicalMaterial* DefaultPhysMaterial; // 0x678
	FSoftObjectPath DefaultPhysMaterialName; // 0x680
	TArray<FGameNameRedirect> ActiveGameNameRedirects; // 0x698
	TArray<FClassRedirect> ActiveClassRedirects; // 0x6a8
	TArray<FPluginRedirect> ActivePluginRedirects; // 0x6b8
	TArray<FStructRedirect> ActiveStructRedirects; // 0x6c8
	UTexture2D* PreIntegratedSkinBRDFTexture; // 0x6d8
	FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x6e0
	UTexture2D* BlueNoiseTexture; // 0x6f8
	FSoftObjectPath BlueNoiseTextureName; // 0x700
	UTexture2D* MiniFontTexture; // 0x718
	FSoftObjectPath MiniFontTextureName; // 0x720
	UTexture* WeightMapPlaceholderTexture; // 0x738
	FSoftObjectPath WeightMapPlaceholderTextureName; // 0x740
	UTexture2D* LightMapDensityTexture; // 0x758
	FSoftObjectPath LightMapDensityTextureName; // 0x760
	UGameViewportClient* GameViewport; // 0x780
	TArray<FString> DeferredCommands; // 0x788
	float NearClipPlane; // 0x798
	char bSubtitlesEnabled : 1; // 0x79c
	char bSubtitlesForcedOff : 1; // 0x79c
	int32_t MaximumLoopIterationCount; // 0x7a0
	char bCanBlueprintsTickByDefault : 1; // 0x7a4
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7a4
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7a4
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7a4
	char bSmoothFrameRate : 1; // 0x7a4
	char bUseFixedFrameRate : 1; // 0x7a4
	float FixedFrameRate; // 0x7a8
	FFloatRange SmoothedFrameRateRange; // 0x7ac
	UEngineCustomTimeStep* CustomTimeStep; // 0x7c0
	FSoftClassPath CustomTimeStepClassName; // 0x7e8
	UTimecodeProvider* TimecodeProvider; // 0x800
	FSoftClassPath TimecodeProviderClassName; // 0x828
	bool bGenerateDefaultTimecode; // 0x840
	FFrameRate GenerateDefaultTimecodeFrameRate; // 0x844
	float GenerateDefaultTimecodeFrameDelay; // 0x84c
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x850
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x854
	char bShouldGenerateLowQualityLightmaps : 1; // 0x858
	FColor C_WorldBox; // 0x85c
	FColor C_BrushWire; // 0x860
	FColor C_AddWire; // 0x864
	FColor C_SubtractWire; // 0x868
	FColor C_SemiSolidWire; // 0x86c
	FColor C_NonSolidWire; // 0x870
	FColor C_WireBackground; // 0x874
	FColor C_ScaleBoxHi; // 0x878
	FColor C_VolumeCollision; // 0x87c
	FColor C_BSPCollision; // 0x880
	FColor C_OrthoBackground; // 0x884
	FColor C_Volume; // 0x888
	FColor C_BrushShape; // 0x88c
	float StreamingDistanceFactor; // 0x890
	FDirectoryPath GameScreenshotSaveDirectory; // 0x898
	ETransitionType TransitionType; // 0x8a8
	FString TransitionDescription; // 0x8b0
	FString TransitionGameMode; // 0x8c0
	char bAllowMatureLanguage : 1; // 0x8d0
	float CameraRotationThreshold; // 0x8d4
	float CameraTranslationThreshold; // 0x8d8
	float PrimitiveProbablyVisibleTime; // 0x8dc
	float MaxOcclusionPixelsFraction; // 0x8e0
	char bPauseOnLossOfFocus : 1; // 0x8e4
	int32_t MaxParticleResize; // 0x8e8
	int32_t MaxParticleResizeWarn; // 0x8ec
	TArray<FDropNoteInfo> PendingDroppedNotes; // 0x8f0
	float NetClientTicksPerSecond; // 0x900
	float DisplayGamma; // 0x904
	float MinDesiredFrameRate; // 0x908
	FLinearColor DefaultSelectedMaterialColor; // 0x90c
	FLinearColor SelectedMaterialColor; // 0x91c
	FLinearColor SelectionOutlineColor; // 0x92c
	FLinearColor SubduedSelectionOutlineColor; // 0x93c
	FLinearColor SelectedMaterialColorOverride; // 0x94c
	bool bIsOverridingSelectedColor; // 0x95c
	char bEnableOnScreenDebugMessages : 1; // 0x960
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x960
	char bSuppressMapWarnings : 1; // 0x960
	char bDisableAILogging : 1; // 0x960
	uint32_t bEnableVisualLogRecordingOnStart; // 0x964
	int32_t ScreenSaverInhibitorSemaphore; // 0x968
	char bLockReadOnlyLevels : 1; // 0x96c
	FString ParticleEventManagerClassPath; // 0x970
	float SelectionHighlightIntensity; // 0x980
	float BSPSelectionHighlightIntensity; // 0x984
	float SelectionHighlightIntensityBillboards; // 0x988
	TArray<FNetDriverDefinition> NetDriverDefinitions; // 0xbf8
	TArray<FString> ServerActors; // 0xc08
	TArray<FString> RuntimeServerActors; // 0xc18
	float NetErrorLogInterval; // 0xc28
	char bStartedLoadMapMovie : 1; // 0xc2c
	int32_t NextWorldContextHandle; // 0xc48
};

struct UMaterialExpressionVectorNoise : UMaterialExpression {
	FExpressionInput Position; // 0x40
	EVectorNoiseFunction NoiseFunction; // 0x54
	int32_t Quality; // 0x58
	char bTiling : 1; // 0x5c
	uint32_t TileSize; // 0x60
};

struct UAnimCompress : UAnimBoneCompressionCodec {
	char bNeedsSkeleton : 1; // 0x38
	AnimationCompressionFormat TranslationCompressionFormat; // 0x3c
	AnimationCompressionFormat RotationCompressionFormat; // 0x3d
	AnimationCompressionFormat ScaleCompressionFormat; // 0x3e
};

struct UMovieSceneMediaTrack : UMovieSceneNameableTrack {
	TArray<UMovieSceneSection*> MediaSections; // 0x80
};

struct UYUserSettings : UGameUserSettings {
	FMulticastInlineDelegate OnGfxPresetApplied; // 0x140
	FMulticastInlineDelegate OnSettingsAppliedMulticastDelegate; // 0x170
	float m_mouseSensitivity; // 0x180
	float m_baseSensitivity; // 0x184
	float m_adsSensitivity; // 0x188
	float m_scopedSensitivity; // 0x18c
	bool m_usePerScopeSensitivity; // 0x190
	float m_onePointFiveTimesScopeSensitivity; // 0x194
	float m_twoTimesScopeSensitivity; // 0x198
	float m_fourTimesScopeSensitivity; // 0x19c
	float m_eightTimesScopeSensitivity; // 0x1a0
	float m_sixteenTimesScopeSensitivity; // 0x1a4
	float m_minSensitivityGamepad; // 0x1a8
	float m_maxSensitivityGamepad; // 0x1ac
	bool m_enableMouseSmoothing; // 0x1b0
	bool m_enableFovBasedSensitivtyScaling; // 0x1b1
	float m_masterVolume; // 0x1b4
	float m_musicVolume; // 0x1b8
	float m_VOVolume; // 0x1bc
	float m_HitMarkerVolume; // 0x1c0
	float m_sfxVolume; // 0x1c4
	float m_UISoundVolume; // 0x1c8
	FString m_audioDevice; // 0x1d0
	FString m_audioInputDevice; // 0x1e0
	float m_desiredFOV; // 0x1f0
	bool m_applyFOVToScreenYAxis; // 0x1f4
	bool m_allowMovementToChangeFOV; // 0x1f5
	int32_t m_keyboardSettingsVersion; // 0x1f8
	int32_t m_globalSettingsVersion; // 0x1fc
	int32_t m_mouseSensitivityVersion; // 0x200
	FString m_defaultGraphicsRHI; // 0x208
	bool m_haveAppliedAutoGraphicSettings; // 0x218
	bool m_useMotionBlur; // 0x219
	bool m_useImageSharpening; // 0x21a
	bool m_invertX; // 0x21b
	bool m_invertY; // 0x21c
	bool m_isRotatingMinimapEnabled; // 0x21d
	bool m_showSubtitles; // 0x21e
	bool m_isToggleInputModeEnabledForSprint; // 0x21f
	bool m_isToggleInputModeEnabledForCrouch; // 0x220
	bool m_isToggleInputModeEnabledForTargeting; // 0x221
	bool m_isToggleInputModeEnabledForLeaning; // 0x222
	bool m_isQuickBuyEnabled; // 0x223
	bool m_isHideHudShortcutEnabled; // 0x224
	bool m_showDamageNumbersForAI; // 0x225
	bool m_showDamageNumbersForPlayers; // 0x226
	bool m_showCreditsOnKill; // 0x227
	bool m_showKillIndicator; // 0x228
	bool m_showFpsCounter; // 0x229
	bool m_enableGpuCrashDebugging; // 0x22a
	bool m_enableMultiThreadedRendering; // 0x22b
	EYGfxQualityPreset m_gfxQuality; // 0x22c
	UDLSSMode m_dlssQualityMode; // 0x22d
	float m_resolutionQuality; // 0x230
	bool m_voiceChatMuteInput; // 0x234
	bool m_voiceChatMuteOutput; // 0x235
	float m_voiceChatInputVolume; // 0x238
	float m_voiceChatOutputVolume; // 0x23c
	float m_voiceChatMicSensitivity; // 0x240
	bool m_isChatEnabled; // 0x244
	bool m_isInGlobalChannelEN; // 0x245
	bool m_isInGlobalChannelGER; // 0x246
	bool m_isInGlobalChannelRU; // 0x247
	bool m_isInGlobalChannelFR; // 0x248
	bool m_isInGlobalChannelES; // 0x249
	bool m_isInGlobalChannelPTBR; // 0x24a
	bool m_isInGlobalChannelPL; // 0x24b
	bool m_isInGlobalChannelTR; // 0x24c
	bool m_isInGlobalChannelZH; // 0x24d
	bool m_isSocialNotificationsEnabled; // 0x24e
	bool m_initialChatChannelAssignment; // 0x24f
	bool m_voiceChatPushToTalk; // 0x250
	UYPlayerMutelist* m_playerMutelist; // 0x258
	int32_t m_colorVisionDeficiency; // 0x260
	float m_severity; // 0x264
	bool m_correctDeficiency; // 0x268
	bool m_showCorrectionWithDeficiency; // 0x269
	float m_gamma; // 0x26c
};

struct UUserInterfaceSettings : UDeveloperSettings {
	ERenderFocusRule RenderFocusRule; // 0x38
	TMap<EMouseCursor, FHardwareCursorReference> HardwareCursors; // 0x40
	TMap<EMouseCursor, FSoftClassPath> SoftwareCursors; // 0x90
	FSoftClassPath DefaultCursor; // 0xe0
	FSoftClassPath TextEditBeamCursor; // 0xf8
	FSoftClassPath CrosshairsCursor; // 0x110
	FSoftClassPath HandCursor; // 0x128
	FSoftClassPath GrabHandCursor; // 0x140
	FSoftClassPath GrabHandClosedCursor; // 0x158
	FSoftClassPath SlashedCircleCursor; // 0x170
	float ApplicationScale; // 0x188
	EUIScalingRule UIScaleRule; // 0x18c
	FSoftClassPath CustomScalingRuleClass; // 0x190
	FRuntimeFloatCurve UIScaleCurve; // 0x1a8
	bool bAllowHighDPIInGameMode; // 0x230
	FIntPoint DesignScreenSize; // 0x234
	bool bLoadWidgetsOnDedicatedServer; // 0x23c
	TArray<UObject*> CursorClasses; // 0x240
	UObject* CustomScalingRuleClassInstance; // 0x250
	UDPICustomScalingRule* CustomScalingRule; // 0x258
};

struct UNiagaraDataInterfaceSpline : UNiagaraDataInterface {
	AActor* Source; // 0x38
};

struct UWidgetInteractionComponent : USceneComponent {
	FMulticastInlineDelegate OnHoveredWidgetChanged; // 0x1f8
	int32_t VirtualUserIndex; // 0x218
	int32_t PointerIndex; // 0x21c
	ECollisionChannel TraceChannel; // 0x220
	float InteractionDistance; // 0x224
	EWidgetInteractionSource InteractionSource; // 0x228
	bool bEnableHitTesting; // 0x229
	bool bShowDebug; // 0x22a
	float DebugSphereLineThickness; // 0x22c
	float DebugLineThickness; // 0x230
	FLinearColor DebugColor; // 0x234
	FHitResult CustomHitResult; // 0x2c0
	FVector2D LocalHitLocation; // 0x34c
	FVector2D LastLocalHitLocation; // 0x354
	UWidgetComponent* HoveredWidgetComponent; // 0x360
	FHitResult LastHitResult; // 0x368
	bool bIsHoveredWidgetInteractable; // 0x3f4
	bool bIsHoveredWidgetFocusable; // 0x3f5
	bool bIsHoveredWidgetHitTestVisible; // 0x3f6
};

struct USkeletalMeshComponent : USkinnedMeshComponent {
	UObject* AnimBlueprintGeneratedClass; // 0x690
	UAnimInstance* AnimClass; // 0x698
	UAnimInstance* AnimScriptInstance; // 0x6a0
	UAnimInstance* PostProcessAnimInstance; // 0x6a8
	FSingleAnimationPlayData AnimationData; // 0x6b0
	FVector RootBoneTranslation; // 0x6d8
	FVector LineCheckBoundsScale; // 0x6e4
	TArray<UAnimInstance*> LinkedInstances; // 0x720
	TArray<FTransform> CachedBoneSpaceTransforms; // 0x730
	TArray<FTransform> CachedComponentSpaceTransforms; // 0x740
	float GlobalAnimRateScale; // 0x8a0
	EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x8a4
	EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x8a5
	EAnimationMode AnimationMode; // 0x8a7
	char bDisablePostProcessBlueprint : 1; // 0x8a9
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x8a9
	char bHasValidBodies : 1; // 0x8a9
	char bBlendPhysics : 1; // 0x8a9
	char bEnablePhysicsOnDedicatedServer : 1; // 0x8a9
	char bUpdateJointsFromAnimation : 1; // 0x8a9
	char bDisableClothSimulation : 1; // 0x8aa
	char bDisableRigidBodyAnimNode : 1; // 0x8b0
	char bAllowAnimCurveEvaluation : 1; // 0x8b0
	char bDisableAnimCurves : 1; // 0x8b0
	char bCollideWithEnvironment : 1; // 0x8b0
	char bCollideWithAttachedChildren : 1; // 0x8b1
	char bLocalSpaceSimulation : 1; // 0x8b1
	char bResetAfterTeleport : 1; // 0x8b1
	char bDeferKinematicBoneUpdate : 1; // 0x8b1
	char bNoSkeletonUpdate : 1; // 0x8b1
	char bPauseAnims : 1; // 0x8b1
	char bUseRefPoseOnInitAnim : 1; // 0x8b1
	char bEnablePerPolyCollision : 1; // 0x8b2
	char bForceRefpose : 1; // 0x8b2
	char bOnlyAllowAutonomousTickPose : 1; // 0x8b2
	char bIsAutonomousTickPose : 1; // 0x8b2
	char bOldForceRefPose : 1; // 0x8b2
	char bShowPrePhysBones : 1; // 0x8b2
	char bRequiredBonesUpToDate : 1; // 0x8b2
	char bAnimTreeInitialised : 1; // 0x8b2
	char bIncludeComponentLocationIntoBounds : 1; // 0x8b3
	char bEnableLineCheckWithBounds : 1; // 0x8b3
	char bUseBendingElements : 1; // 0x8b3
	char bUseTetrahedralConstraints : 1; // 0x8b3
	char bUseThinShellVolumeConstraints : 1; // 0x8b3
	char bUseSelfCollisions : 1; // 0x8b3
	char bUseContinuousCollisionDetection : 1; // 0x8b3
	char bPropagateCurvesToSlaves : 1; // 0x8b3
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x8b4
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x8b4
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x8b4
	uint16_t CachedAnimCurveUidVersion; // 0x8b6
	EClothMassMode MassMode; // 0x8b8
	float UniformMass; // 0x8bc
	float TotalMass; // 0x8c0
	float Density; // 0x8c4
	float MinPerParticleMass; // 0x8c8
	float ClothBlendWeight; // 0x8cc
	float EdgeStiffness; // 0x8d0
	float BendingStiffness; // 0x8d4
	float AreaStiffness; // 0x8d8
	float VolumeStiffness; // 0x8dc
	float StrainLimitingStiffness; // 0x8e0
	float ShapeTargetStiffness; // 0x8e4
	bool bWaitForParallelClothTask; // 0x8e8
	TArray<FName> DisallowedAnimCurves; // 0x8f0
	UBodySetup* BodySetup; // 0x900
	FMulticastInlineDelegate OnConstraintBroken; // 0x910
	UClothingSimulationFactory* ClothingSimulationFactory; // 0x920
	float TeleportDistanceThreshold; // 0x9f8
	float TeleportRotationThreshold; // 0x9fc
	uint32_t LastPoseTickFrame; // 0xa08
	UClothingSimulationInteractor* ClothingInteractor; // 0xa60
	FMulticastInlineDelegate OnAnimInitialized; // 0xb30
};

struct UInterpTrackInstBoolProp : UInterpTrackInstProperty {
	bool ResetBool; // 0x60
};

struct USoundNodeEnveloper : USoundNode {
	float LoopStart; // 0x48
	float LoopEnd; // 0x4c
	float DurationAfterLoop; // 0x50
	int32_t LoopCount; // 0x54
	char bLoopIndefinitely : 1; // 0x58
	char bLoop : 1; // 0x58
	UDistributionFloatConstantCurve* VolumeInterpCurve; // 0x60
	UDistributionFloatConstantCurve* PitchInterpCurve; // 0x68
	FRuntimeFloatCurve VolumeCurve; // 0x70
	FRuntimeFloatCurve PitchCurve; // 0xf8
	float PitchMin; // 0x180
	float PitchMax; // 0x184
	float VolumeMin; // 0x188
	float VolumeMax; // 0x18c
};

struct UFieldSystemComponent : UPrimitiveComponent {
	UFieldSystem* FieldSystem; // 0x440
	TArray<TSoftObjectPtr<AChaosSolverActor>> SupportedSolvers; // 0x458
};

struct UYWidget_DismissivePopup : UYWidget {
	UCheckBox* m_dontShowAgainCheckbox; // 0x2d8
	int32_t m_BITimeWhenShown; // 0x2e0
	FDataTableRowHandle m_audioAnimateIn; // 0x2e8
	FDataTableRowHandle m_audioAnimateOut; // 0x2f8
};

struct ABP_ImpactMarkerHeavy01_BP_C : AYPlacementActor {
	FPointerToUberGraphFrame UberGraphFrame; // 0x240
	USceneComponent* DefaultSceneRoot; // 0x248
	float decalAnim_anim_opacity_E9D529874D32FD51EFB5B497FD1FC1D0; // 0x250
	ETimelineDirection decalAnim__Direction_E9D529874D32FD51EFB5B497FD1FC1D0; // 0x254
	UTimelineComponent* decalAnim; // 0x258
	UMaterialInstanceDynamic* decalMID; // 0x260
	float markerSize; // 0x268
	UParticleSystemComponent* particle; // 0x270
	UDecalComponent* Decal; // 0x278
};

struct APartyBeaconClient : AOnlineBeaconClient {
	FString DestSessionId; // 0x300
	FPartyReservation PendingReservation; // 0x310
	EClientRequestType RequestType; // 0x360
	bool bPendingReservationSent; // 0x361
	bool bCancelReservation; // 0x362
};

struct UInterpCurveEdSetup : UObject {
	TArray<FCurveEdTab> Tabs; // 0x28
	int32_t ActiveTab; // 0x38
};

struct UMaterialExpressionAbs : UMaterialExpression {
	FExpressionInput Input; // 0x40
};

struct UYWidget_LootNotificationsContainer : UYWidget {
	UVerticalBox* m_notificationsContainer; // 0x2c0
	UYWidget_LootNotification* m_lootNotificationClass; // 0x2c8
	TArray<EYPickupType> m_typesTriggeringNotification; // 0x2d0
	TArray<UYWidget_LootNotification*> m_lootNotificationWidgets; // 0x2e0
};

struct UYScreenManager : UObject {
	TMap<UYScreenBase*, UYScreenBase*> m_activeScreens; // 0x28
};

struct UWBP_Footer_C_Panel_C : UYWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2c0
	UWidgetAnimation* ScreenIn_Anim; // 0x2c8
	UImage* Gfx_LineworkEdge_Left; // 0x2d0
	UImage* Gfx_LineworkEdge_Right; // 0x2d8
};

struct UPlanarReflectionComponent : USceneCaptureComponent {
	UBoxComponent* PreviewBox; // 0x2b0
	float NormalDistortionStrength; // 0x2b8
	float PrefilterRoughness; // 0x2bc
	float PrefilterRoughnessDistance; // 0x2c0
	int32_t ScreenPercentage; // 0x2c4
	float ExtraFOV; // 0x2c8
	float DistanceFromPlaneFadeStart; // 0x2cc
	float DistanceFromPlaneFadeEnd; // 0x2d0
	float DistanceFromPlaneFadeoutStart; // 0x2d4
	float DistanceFromPlaneFadeoutEnd; // 0x2d8
	float AngleFromPlaneFadeStart; // 0x2dc
	float AngleFromPlaneFadeEnd; // 0x2e0
	bool bShowPreviewPlane; // 0x2e4
	bool bRenderSceneTwoSided; // 0x2e5
};

struct UYDamageRecapComponent : UActorComponent {
	bool m_showDamageRecap; // 0xb0
	APawn* m_ownerPawn; // 0xc8
	FYRawDamageEventContainer m_rawTakeDamageEvents; // 0xd0
	FYRawDamageEventContainer m_rawDealDamageEvents; // 0xe8
	TArray<FYCondensedDamageData> m_condensedDamageInfo; // 0x100
	TArray<FYDamageEvent> m_debugUncondensedDamageInfo; // 0x110
	FMulticastInlineDelegate BP_OnCondensedDamageInfoReceived; // 0x120
	FMulticastInlineDelegate BP_OnDebugUncondensedDamageInfoReceived; // 0x130
	FMulticastInlineDelegate BP_OnToggleDamageRecapVisibility; // 0x140
};

struct UDA_Escape : UDataAsset {
	float m_escapeTime; // 0x30
	int32_t m_escapeLocations; // 0x34
	USkeletalMesh* m_escapeShipSK; // 0x38
	UAnimationAsset* m_flyingAnim; // 0x40
	UAnimationAsset* m_hoverAnim; // 0x48
	UAnimationAsset* m_landedAnim; // 0x50
	UAnimationAsset* m_takingOffAnim; // 0x58
	float m_landingPauzeTime; // 0x60
	float m_landingTime; // 0x64
	float m_landedTime; // 0x68
	float m_departureAlarmTime; // 0x6c
	UStaticMesh* m_escapeConsoleSM; // 0x70
	float m_consoleCooldownTime; // 0x78
};

struct UGizmoAxisRotationParameterSource : UGizmoBaseFloatParameterSource {
	TScriptInterface<IGizmoAxisSource> AxisSource; // 0x90
	TScriptInterface<IGizmoTransformSource> TransformSource; // 0xa0
	float Angle; // 0xb0
	FGizmoFloatParameterChange LastChange; // 0xb4
	FVector CurRotationAxis; // 0xbc
	FVector CurRotationOrigin; // 0xc8
	FTransform InitialTransform; // 0xe0
};

struct UYWidget_ShopContainer : UYWidget {
	UYWidget_ShopItemEntry* m_entryWBP; // 0x2c0
};

struct ULoudnessNRT : UAudioSynesthesiaNRT {
	ULoudnessNRTSettings* Settings; // 0x78
};

struct UDatasmithStaticMeshTemplate : UDatasmithObjectTemplate {
	FDatasmithMeshSectionInfoMapTemplate SectionInfoMap; // 0x30
	int32_t LightMapCoordinateIndex; // 0x80
	int32_t LightMapResolution; // 0x84
	TArray<FDatasmithMeshBuildSettingsTemplate> BuildSettings; // 0x88
	TArray<FDatasmithStaticMaterialTemplate> StaticMaterials; // 0x98
};

struct UEdGraph : UObject {
	UEdGraphSchema* Schema; // 0x28
	TArray<UEdGraphNode*> nodes; // 0x30
	char bEditable : 1; // 0x40
	char bAllowDeletion : 1; // 0x40
	char bAllowRenaming : 1; // 0x40
};

struct UHudSettings : UObject {
	char bShowHUD : 1; // 0x28
	TArray<FName> DebugDisplay; // 0x30
};

struct USoundfieldSubmix : USoundSubmixWithParentBase {
	FName SoundfieldEncodingFormat; // 0x40
	USoundfieldEncodingSettingsBase* EncodingSettings; // 0x48
	TArray<USoundfieldEffectBase*> SoundfieldEffectChain; // 0x50
	USoundfieldEncodingSettingsBase* EncodingSettingsClass; // 0x60
};

struct UWBP_LanguageSelection_C : UYWidget_LanguageSelection {
	FPointerToUberGraphFrame UberGraphFrame; // 0x2f0
};

struct UAnimCompress_RemoveTrivialKeys : UAnimCompress {
	float MaxPosDiff; // 0x40
	float MaxAngleDiff; // 0x44
	float MaxScaleDiff; // 0x48
};

struct UWeaponScopeComponent_BP_C : UYWeaponScopeComponent {
	FPointerToUberGraphFrame UberGraphFrame; // 0xb0
	UMaterialInstanceDynamic* ThermalScopeMat; // 0xb8
};

struct UDialogContainer_WBP_C : UYDialogContainer {
	FPointerToUberGraphFrame UberGraphFrame; // 0x320
	UWBP_Form_Menu_C* CustomerSupportForm; // 0x328
	UWBP_Generic_Modal_C* ExitGameConfirmationModal; // 0x330
	UWBP_Generic_Modal_C* ExitGameSurveyConfirmationModal; // 0x338
	UWBP_Generic_Modal_C* OkCancelConfirmationModal; // 0x340
	UWBP_LoadingOverlay_C* WBP_LoadingOverlay; // 0x348
	UWBP_StartupMessagesContainer_C* WBP_StartupMessagesContainer; // 0x350
};

struct UWBP_Credits_Headline_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x260
	UTextBlock* Txt_Headline; // 0x268
	UWBP_DividerHorizontal_Panel_C* WBP_DividerHorizontal_Panel_TextA; // 0x270
	UWBP_DividerHorizontal_Panel_C* WBP_DividerHorizontal_Panel_TextA_2; // 0x278
	FText headline; // 0x280
};

struct UAudioCaptureComponent : USynthComponent {
	int32_t JitterLatencyFrames; // 0x6c0
};

struct UWBP_LegalAgreements_Menu_C : UYWidget_LegalAgreements {
	FPointerToUberGraphFrame UberGraphFrame; // 0x300
	UWidgetAnimation* LegalIn_Anim; // 0x308
	UWidgetAnimation* LegalOut_Anim; // 0x310
	UImage* Gfx_BackgroundFill; // 0x318
	UWBP_LanguageSelection_C* languageSelection; // 0x320
	UOverlay* SelectionAction; // 0x328
	UWBP_Common_Btn_C* WBP_Common_Btn_Accept; // 0x330
	UWBP_Common_Btn_C* WBP_Common_Btn_Cancel; // 0x338
	UWBP_LoadingOverlay_C* WBP_LoadingOverlay; // 0x340
	UWBP_SingleRowScroll_Panel_C* WBP_SingleRowScroll_Panel; // 0x348
	UWBP_Toggle_Btn_C* WBP_Toggle_Btn; // 0x350
};

struct UPacketHandlerProfileConfig : UObject {
	TArray<FString> Components; // 0x28
};

struct UYWidget_SocialOverviewDEPRECATED : UYWidget {
	UButton* m_closeButton; // 0x2c0
	UTextBlock* m_playerName; // 0x2c8
	UYWidget_ChatUserMenu* m_localUserContextMenu; // 0x2d0
};

struct UUniformGridSlot : UPanelSlot {
	EHorizontalAlignment HorizontalAlignment; // 0x38
	EVerticalAlignment VerticalAlignment; // 0x39
	int32_t row; // 0x3c
	int32_t Column; // 0x40
};

struct UYScannableComponent : UActorComponent {
	FMulticastInlineDelegate OnWasScanned; // 0xb0
	FDataTableRowHandle m_dataTableHandle; // 0xc0
	bool m_autoDeactivateOnDeath; // 0xd8
	bool m_isScannable; // 0xda
};

struct ANavigationData : AActor {
	UPrimitiveComponent* RenderingComp; // 0x248
	FNavDataConfig NavDataConfig; // 0x250
	char bEnableDrawing : 1; // 0x2c8
	char bForceRebuildOnLoad : 1; // 0x2c8
	char bAutoDestroyWhenNoNavigation : 1; // 0x2c8
	char bCanBeMainNavData : 1; // 0x2c8
	char bCanSpawnOnRebuild : 1; // 0x2c8
	char bRebuildAtRuntime : 1; // 0x2c8
	ERuntimeGenerationType RuntimeGeneration; // 0x2cc
	float ObservedPathsTickInterval; // 0x2d0
	uint32_t DataVersion; // 0x2d4
	TArray<FSupportedAreaData> SupportedAreas; // 0x3e0
};

struct UParticleModuleBeamSource : UParticleModuleBeamBase {
	Beam2SourceTargetMethod SourceMethod; // 0x30
	FName SourceName; // 0x34
	char bSourceAbsolute : 1; // 0x3c
	FRawDistributionVector Source; // 0x40
	char bLockSource : 1; // 0x88
	Beam2SourceTargetTangentMethod SourceTangentMethod; // 0x8c
	FRawDistributionVector SourceTangent; // 0x90
	char bLockSourceTangent : 1; // 0xd8
	FRawDistributionFloat SourceStrength; // 0xe0
	char bLockSourceStength : 1; // 0x110
};

struct ALODActor : AActor {
	UStaticMeshComponent* StaticMeshComponent; // 0x240
	TMap<UMaterialInterface*, UInstancedStaticMeshComponent*> ImpostersStaticMeshComponents; // 0x248
	UHLODProxy* Proxy; // 0x298
	FName Key; // 0x2a0
	float LODDrawDistance; // 0x2a8
	int32_t LODLevel; // 0x2ac
	TArray<AActor*> SubActors; // 0x2b0
	char CachedNumHLODLevels; // 0x2c0
};

struct AARSharedWorldGameMode : AGameMode {
	int32_t BufferSizePerChunk; // 0x328
};

struct UAudioSettings : UDeveloperSettings {
	FSoftObjectPath DefaultSoundClassName; // 0x38
	FSoftObjectPath DefaultMediaSoundClassName; // 0x50
	FSoftObjectPath DefaultSoundConcurrencyName; // 0x68
	FSoftObjectPath DefaultBaseSoundMix; // 0x80
	FSoftObjectPath VoiPSoundClass; // 0x98
	FSoftObjectPath MasterSubmix; // 0xb0
	FSoftObjectPath ReverbSubmix; // 0xc8
	FSoftObjectPath EQSubmix; // 0xe0
	EVoiceSampleRate VoiPSampleRate; // 0xf8
	float DefaultReverbSendLevel; // 0xfc
	int32_t MaximumConcurrentStreams; // 0x100
	float GlobalMinPitchScale; // 0x104
	float GlobalMaxPitchScale; // 0x108
	TArray<FAudioQualitySettings> QualityLevels; // 0x110
	char bAllowPlayWhenSilent : 1; // 0x120
	char bDisableMasterEQ : 1; // 0x120
	char bAllowCenterChannel3DPanning : 1; // 0x120
	uint32_t NumStoppingSources; // 0x124
	EPanningMethod PanningMethod; // 0x128
	EMonoChannelUpmixMethod MonoChannelUpmixMethod; // 0x129
	FString DialogueFilenameFormat; // 0x130
};

struct UNiagaraDataInterfaceRenderTargetVolume : UNiagaraDataInterfaceRWBase {
	FIntVector Size; // 0xd8
	ETextureRenderTargetFormat OverrideRenderTargetFormat; // 0xe4
	char bOverrideFormat : 1; // 0xe5
	FNiagaraUserParameterBinding RenderTargetUserParameter; // 0xe8
	TMap<uint64_t, UTextureRenderTargetVolume*> ManagedRenderTargets; // 0x108
};

struct UYPlayerBuffsComponent : UActorComponent {
	UCurveFloat* m_playerBuffIntensityCurve; // 0xb0
	TMap<EYBuffTypes, UCurveFloat*> m_buffCurves; // 0xb8
	TMap<EYBuffTypes, float> m_cachedBuffMultipliers; // 0x108
};

struct UMaterialExpressionParticleSubUV : UMaterialExpressionTextureSample {
	char bBlend : 1; // 0x60
};

struct UMovieSceneParticleSection : UMovieSceneSection {
	FMovieSceneParticleChannel ParticleKeys; // 0xe8
};

struct UPawnAction_Sequence : UPawnAction {
	TArray<UPawnAction*> ActionSequence; // 0x98
	EPawnActionFailHandling ChildFailureHandlingMode; // 0xa8
	UPawnAction* RecentActionCopy; // 0xb0
};

struct UYWidget_LootNotification : UYWidget {
	UTextBlock* m_itemNameTextBlock; // 0x2c0
	UTextBlock* m_amountTextBlock; // 0x2c8
	UBorder* m_rarityImageBorders; // 0x2d0
	UImage* m_itemImage; // 0x2d8
	float m_notificationDuration; // 0x2e0
	float m_itemImageSizeY; // 0x2e4
};

struct AYPlayerState : AYPlayerStateBase {
	FMulticastInlineDelegate OnPlayerMatchStateChangedDelegate; // 0x3a0
	FMulticastInlineDelegate OnPlayerCharacterSetDelegate; // 0x3b0
	AYPlayerCharacter* m_playerCharacter; // 0x3d0
	FMulticastInlineDelegate OnFactionSelected; // 0x3f0
	FMulticastInlineDelegate OnUniqueIdSetEvent; // 0x400
	FMulticastInlineDelegate OnFactionProgressUpdated; // 0x410
	FMulticastInlineDelegate OnBeforeFinishedMatch; // 0x420
	FMulticastInlineDelegate OnFinishedMatchResult; // 0x430
	FMulticastInlineDelegate OnAfterFinishedMatchResult; // 0x440
	int32_t m_matchPlayerID; // 0x450
	float m_lastImpactSurveillanceTimestamp; // 0x454
	bool m_hasTrophy; // 0x458
	bool m_hasRedTrophy; // 0x459
	bool m_hasGreenTrophy; // 0x45a
	bool m_isDummyPlayerState; // 0x45b
	bool m_rewardsReceived; // 0x45c
	bool m_leftMatch; // 0x45d
	bool m_leftMatchWithoutFinishing; // 0x45e
	TWeakObjectPtr<AYPlayerState> m_killer; // 0x460
	TArray<TWeakObjectPtr<AYPlayerState>> m_alliesAtDeath; // 0x468
	FYDealtDamageData m_deathData; // 0x478
	FMulticastInlineDelegate OnCosmeticStateChanged; // 0x578
	FYPlayerCosmeticReplicatedData m_replicatedCosmeticData; // 0x588
	float m_timeFinished; // 0x5e0
	UYPlayerBuffsComponent* m_playerBuffsComponent; // 0x5f8
	UYPlayerStatsDeathsComponent* m_playerStatsDeathsComponent; // 0x600
	UYPlayerStatsKillsComponent* m_playerStatsKillsComponent; // 0x608
	UYPlayerStatsChallengesComponent* m_playerStatsChallengesComponent; // 0x610
	EYPlayerMatchState m_playerMatchState; // 0x618
	EYPlayerMatchFinishedResult m_playerMatchFinishedResult; // 0x619
	UYPlayerRewardsComponent* m_playerRewardsComponent; // 0x620
	FName m_factionId; // 0x628
	FYActiveWeaponCharacterInitializationData m_equippedWeaponData; // 0x660
};

struct UYWidget_RankedLeaderboardBase : UYWidget {
	int32_t m_amountOfFriendsToShow; // 0x2c0
};

struct UEditableGameplayTagQueryExpression_AnyExprMatch : UEditableGameplayTagQueryExpression {
	TArray<UEditableGameplayTagQueryExpression*> Expressions; // 0x28
};

struct UGerstnerWaterWaveGeneratorSimple : UGerstnerWaterWaveGeneratorBase {
	int32_t NumWaves; // 0x28
	int32_t Seed; // 0x2c
	float Randomness; // 0x30
	float MinWavelength; // 0x34
	float MaxWavelength; // 0x38
	float WavelengthFalloff; // 0x3c
	float MinAmplitude; // 0x40
	float MaxAmplitude; // 0x44
	float AmplitudeFalloff; // 0x48
