// Created by BlueFire1337
// Updated 2021-10-25
// Generated 2022-01-23

#pragma once

struct FYPlayerSlot {
	FUniqueNetIdRepl m_uniqueId; // 0x0
	FString m_playerName; // 0x28
};

struct FPSCPool {
	TArray<FPSCPoolElem> FreeElements; // 0x0
	TArray<UParticleSystemComponent*> InUseComponents_Auto; // 0x10
	TArray<UParticleSystemComponent*> InUseComponents_Manual; // 0x20
};

struct FRigUnit_SetRelativeTransformForItem : FRigUnitMutable {
	FRigElementKey Child; // 0x68
	FRigElementKey Parent; // 0x74
	bool bParentInitial; // 0x80
	FTransform RelativeTransform; // 0x90
	float weight; // 0xc0
	bool bPropagateToChildren; // 0xc4
	FCachedRigElement CachedChild; // 0xc8
	FCachedRigElement CachedParent; // 0xdc
};

struct FPrimaryAssetRules {
	int32_t Priority; // 0x0
	int32_t chunkID; // 0x4
	bool bApplyRecursively; // 0x8
	EPrimaryAssetCookRule CookRule; // 0x9
};

struct FAdminIncrementPlayerStatisticVersionRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString StatisticName; // 0x10
};

struct FYDebugClearEntitlements {
	FString epicAccountId; // 0x0
};

struct FYUIMissionLineStepInfo {
	FString m_stepId; // 0x0
	FText m_title; // 0x10
	FText m_stepTitle; // 0x28
	FText m_popupDescription; // 0x40
	FText m_missionStepNpcText; // 0x58
	FDataTableRowHandle m_stepEntry; // 0x70
	int32_t m_startProgress; // 0x80
	int32_t m_maxProgress; // 0x84
	UTexture2D* m_stepIcon; // 0x88
	bool shouldShowPopup; // 0x90
	bool m_initialized; // 0x91
	bool m_ismissionCompletedEntry; // 0x92
};

struct FEditorImportExportTestDefinition {
	FFilePath ImportFilePath; // 0x0
	FString ExportFileExtension; // 0x10
	bool bSkipExport; // 0x20
	TArray<FImportFactorySettingValues> FactorySettings; // 0x28
};

struct FMultiplayerListVirtualMachineSummariesResponse : FPlayFabResultCommon {
	int32_t PageSize; // 0x8
	FString SkipToken; // 0x10
	TArray<UPlayFabJsonObject*> VirtualMachines; // 0x20
};

struct FGroupsGetGroupRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Group; // 0x10
	FString GroupName; // 0x18
};

struct FNiagaraParameterScopeInfo {
	ENiagaraParameterScope Scope; // 0x0
	FString NamespaceString; // 0x8
};

struct FClientLoginResult : FPlayFabLoginResultCommon {
	UPlayFabJsonObject* EntityToken; // 0x10
	UPlayFabJsonObject* InfoResultPayload; // 0x18
	FString LastLoginTime; // 0x20
	bool NewlyCreated; // 0x30
	FString PlayFabId; // 0x38
	FString SessionTicket; // 0x48
	UPlayFabJsonObject* SettingsForUser; // 0x58
	UPlayFabJsonObject* TreatmentAssignment; // 0x60
};

struct FYGivePlayerSeasonGamemodeRankRequest {
	FString UserId; // 0x0
	FString GameMode; // 0x10
	int32_t rankIncrement; // 0x20
};

struct FRigUnit_AccumulateQuatMul : FRigUnit_SimBase {
	FQuat Multiplier; // 0x10
	FQuat InitialValue; // 0x20
	bool bFlipOrder; // 0x30
	bool bIntegrateDeltaTime; // 0x31
	FQuat Result; // 0x40
	FQuat AccumulatedValue; // 0x50
};

struct FRigUnit_DeltaFromPreviousVector : FRigUnit_SimBase {
	FVector Value; // 0x8
	FVector Delta; // 0x14
	FVector PreviousValue; // 0x20
	FVector Cache; // 0x2c
};

struct FRigUnit_MathQuaternionEquals : FRigUnit_MathQuaternionBase {
	FQuat A; // 0x10
	FQuat B; // 0x20
	bool Result; // 0x30
};

struct FYPlayerMatchBIStats : FYBaseAnalyticsEvent {
	int32_t shots; // 0xa8
	int32_t hits; // 0xac
	int32_t kills; // 0xb0
	int32_t damage_done_to_AI; // 0xb4
	int32_t damage_received_by_AI; // 0xb8
	int32_t damage_received_by_players; // 0xbc
	int32_t shield_damage_received_by_AI; // 0xc0
	int32_t shield_damage_received_by_players; // 0xc4
	int32_t damage_done_to_players; // 0xc8
	int32_t damage_received_by_storm; // 0xcc
	int32_t AI_kills; // 0xd0
	int32_t match_time_death; // 0xd4
	int32_t match_time_escape; // 0xd8
	int32_t time_since_user_joined; // 0xdc
	bool match_left; // 0xe0
	int32_t spawn_location_x; // 0xe4
	int32_t spawn_location_y; // 0xe8
	FString escape_ship_id; // 0xf0
	float current_bag_weight; // 0x100
	float max_bag_weight; // 0x104
	float max_safe_weight; // 0x108
	float current_safe_weight; // 0x10c
};

struct FYActorUIWidgetData {
	TSoftObjectPtr<UTexture2D> m_uiTexture; // 0x0
	FSlateColor m_color; // 0x28
	FText m_playerName; // 0x50
	FText m_title; // 0x68
	float m_renderDistance; // 0x80
	float m_minRenderDistance; // 0x84
	bool m_playAnimation; // 0x88
	bool m_attachPlayerNameToTitle; // 0x89
	bool m_showArrow; // 0x8a
	bool m_overrideColor; // 0x8b
	bool m_attachAmountToTitle; // 0x8c
	bool m_useOwnerTeamColor; // 0x8d
	bool m_calculateDistanceToPlayer; // 0x8e
	FDataTableRowHandle m_dataTableRowHandleContext; // 0x90
};

struct FScrollBoxStyle : FSlateWidgetStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
	FSlateBrush LeftShadowBrush; // 0x118
	FSlateBrush RightShadowBrush; // 0x1a0
};

struct FServerGetUserDataResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Data; // 0x8
	int32_t DataVersion; // 0x10
	FString PlayFabId; // 0x18
};

struct FNavAgentSelector {
	char bSupportsAgent0 : 1; // 0x0
	char bSupportsAgent1 : 1; // 0x0
	char bSupportsAgent2 : 1; // 0x0
	char bSupportsAgent3 : 1; // 0x0
	char bSupportsAgent4 : 1; // 0x0
	char bSupportsAgent5 : 1; // 0x0
	char bSupportsAgent6 : 1; // 0x0
	char bSupportsAgent7 : 1; // 0x0
	char bSupportsAgent8 : 1; // 0x1
	char bSupportsAgent9 : 1; // 0x1
	char bSupportsAgent10 : 1; // 0x1
	char bSupportsAgent11 : 1; // 0x1
	char bSupportsAgent12 : 1; // 0x1
	char bSupportsAgent13 : 1; // 0x1
	char bSupportsAgent14 : 1; // 0x1
	char bSupportsAgent15 : 1; // 0x1
};

struct FParticleReplayTrackKey {
	float Time; // 0x0
	float Duration; // 0x4
	int32_t ClipIDNumber; // 0x8
};

struct FStructRedirect {
	FName OldStructName; // 0x0
	FName NewStructName; // 0x8
};

struct FYVivoxLoginTokenRequest {
	FString Username; // 0x0
};

struct FLevelSequenceBindingReference {
	FString PackageName; // 0x0
	FSoftObjectPath ExternalObjectPath; // 0x10
	FString ObjectPath; // 0x28
};

struct FYDamageEvent {
	int32_t m_hitsCritical; // 0x0
	int32_t m_hitsTotal; // 0x4
	float m_amountDamage; // 0x8
	float m_timestamp; // 0xc
	float m_distance; // 0x10
	AActor* m_damageCauser; // 0x18
	FYDamageOriginInfo m_damageOriginInfo; // 0x20
	FYDamageCauserInfo m_damageCauserInfo; // 0x48
};

struct FHorizonTweenEventWidgetColorFromToParameters : FHorizonTweenEventLinearColorParameters {
	TWeakObjectPtr<UWidget> TweenTargetWeakPtr; // 0x238
};

struct FPhysicalMaterialInput {
	UPhysicalMaterial* PhysicalMaterial; // 0x0
	FExpressionInput Input; // 0x8
};

struct FChaosPhysicsCollisionInfo {
	UPrimitiveComponent* Component; // 0x0
	UPrimitiveComponent* OtherComponent; // 0x8
	FVector Location; // 0x10
	FVector Normal; // 0x1c
	FVector AccumulatedImpulse; // 0x28
	FVector Velocity; // 0x34
	FVector OtherVelocity; // 0x40
	FVector AngularVelocity; // 0x4c
	FVector OtherAngularVelocity; // 0x58
	float Mass; // 0x64
	float OtherMass; // 0x68
};

struct FMovieSceneCameraShakeSectionData {
	UMatineeCameraShake* ShakeClass; // 0x0
	float PlayScale; // 0x8
	ECameraShakePlaySpace PlaySpace; // 0xc
	FRotator UserDefinedPlaySpace; // 0x10
};

struct FCurveEdTab {
	FString TabName; // 0x0
	TArray<FCurveEdEntry> Curves; // 0x10
	float ViewStartInput; // 0x20
	float ViewEndInput; // 0x24
	float ViewStartOutput; // 0x28
	float ViewEndOutput; // 0x2c
};

struct FMathRBFInterpolateVectorXform_Target {
	FVector Target; // 0x0
	FTransform Value; // 0x10
};

struct FYBaseModRow : FYItemDataTableRowBase {
	int32_t m_shortModId; // 0x310
	EYModificationSlotType m_modType; // 0x314
	TArray<FYGameplayAttributeModifier> m_attributeMods; // 0x318
	TSoftObjectPtr<UObject> m_mesh; // 0x328
	FDataTableRowHandle m_perkRowHandle; // 0x350
	TArray<FYOverridenModInstanceData> m_perHandlePropertyDefinition; // 0x360
};

struct FRigUnit_TimeOffsetVector : FRigUnit_SimBase {
	FVector Value; // 0x8
	float SecondsAgo; // 0x14
	int32_t BufferSize; // 0x18
	float TimeRange; // 0x1c
	FVector Result; // 0x20
	TArray<FVector> Buffer; // 0x30
	TArray<float> DeltaTimes; // 0x40
	int32_t LastInsertIndex; // 0x50
	int32_t UpperBound; // 0x54
};

struct FYSceneCameraDataAssociation {
	TArray<FYSceneCameraDataRuntimeEntry> m_runtimeEntries; // 0x0
};

struct FYSetActiveCharacterArchetypeResponse {
	bool SUCCESS; // 0x0
	FYCharacterVanity returnVanity; // 0x8
};

struct FRigUnit_ModifyBoneTransforms : FRigUnit_HighlevelBaseMutable {
	TArray<FRigUnit_ModifyBoneTransforms_PerBone> BoneToModify; // 0x68
	float weight; // 0x78
	float WeightMinimum; // 0x7c
	float WeightMaximum; // 0x80
	EControlRigModifyBoneMode Mode; // 0x84
	FRigUnit_ModifyBoneTransforms_WorkData WorkData; // 0x88
};

struct FPlayFabLoginResultCommon : FPlayFabResultCommon {
	UPlayFabAuthenticationContext* AuthenticationContext; // 0x8
};

struct FRandomStream {
	int32_t InitialSeed; // 0x0
	int32_t Seed; // 0x4
};

struct FYContractObjective {
	EYContractObjectiveType m_objectiveType; // 0x0
	int32_t m_objectiveMaxProgress; // 0x4
	FText m_objectiveDescription; // 0x8
	FDataTableRowHandle m_deadDropLocation; // 0x20
	FDataTableRowHandle m_deadDropItemRowHandle; // 0x30
	EYKillType m_killTarget; // 0x40
	TArray<EYDeviceCategory> m_allowedWeaponCategories; // 0x48
	TArray<FDataTableRowHandle> m_allowedSpecificWeapons; // 0x58
	EYEnemyType m_specificAIEnemyTypeToKill; // 0x68
	FDataTableRowHandle m_itemToOwnRowHandle; // 0x70
	FYContractObjectiveConditions m_objectiveConditions; // 0x80
};

struct FServerGetUserBansRequest : FPlayFabRequestCommon {
	FString PlayFabId; // 0x8
};

struct FRigUnit_CCDIK_RotationLimit {
	FName Bone; // 0x0
	float Limit; // 0x8
};

struct FYDurabilityAnalyticsEvent : FYBaseAnalyticsEvent {
	FString Status; // 0xa8
	FString item_id; // 0xb8
	FString item_instance_id; // 0xc8
	FString item_name; // 0xd8
	FString item_type; // 0xe8
	FString item_rarity; // 0xf8
	int32_t damage_taken; // 0x108
	int32_t used; // 0x10c
	int32_t current_durability; // 0x110
	int32_t max_durability; // 0x114
};

struct FYCraftedItemModsData {
	TArray<FString> modsIds; // 0x0
	TArray<FString> modsRoll; // 0x10
};

struct FYUserStateChange {
	FString m_userId; // 0x0
	FString m_playfabId; // 0x10
	EYUserStateChangeType m_stateChange; // 0x20
};

struct FWaterBodyHeightmapSettings {
	EWaterBrushBlendType BlendMode; // 0x0
	bool bInvertShape; // 0x1
	FWaterFalloffSettings FalloffSettings; // 0x4
	FWaterBrushEffects Effects; // 0x18
	int32_t Priority; // 0x78
};

struct FYOverridenModInstanceData {
	FDataTableRowHandle m_rowHandle; // 0x0
	TArray<FYModAttachEntry> m_meshAttachments; // 0x10
	TArray<FYGameplayAttributeModifier> m_attributeMods; // 0x20
	FDataTableRowHandle m_fxCategoryHandle; // 0x30
	FDataTableRowHandle m_transportHandle; // 0x40
	UCurveFloat* m_overridenRecoilCurve; // 0x50
	FYFullscreenCrosshairData m_crosshairData; // 0x58
	bool m_shouldOffsetScope; // 0x88
	float m_scopeOffset; // 0x8c
};

struct FTrackInstanceInputComponent {
	UMovieSceneSection* Section; // 0x0
	int32_t OutputIndex; // 0x8
};

struct FYSeasonRow : FYDataTableRowBase {
	FString m_startDateTime; // 0x10
	FString m_endDateTime; // 0x20
	TArray<FYSeasonRewardLevel> m_seasonRewardLevels; // 0x30
	FYSeasonRewardLevel m_infiniteSeasonRewardLevel; // 0x40
	FText m_displayName; // 0x68
	FText m_description; // 0x80
	TSoftObjectPtr<UTexture2D> m_itemLogoAssociation; // 0x98
	TSoftObjectPtr<UTexture2D> m_logo; // 0xc0
	TSoftObjectPtr<UTexture2D> m_image; // 0xe8
	TSoftObjectPtr<UTexture2D> m_imageLarge; // 0x110
};

struct FFilterOptionPerAxis {
	bool bX; // 0x0
	bool bY; // 0x1
	bool bZ; // 0x2
};

struct FAIDamageEvent {
	float Amount; // 0x0
	FVector Location; // 0x4
	FVector HitLocation; // 0x10
	AActor* DamagedActor; // 0x20
	AActor* Instigator; // 0x28
};

struct FAnimNode_SplineIK : FAnimNode_SkeletalControlBase {
	FBoneReference StartBone; // 0xc8
	FBoneReference EndBone; // 0xd8
	ESplineBoneAxis BoneAxis; // 0xe8
	bool bAutoCalculateSpline; // 0xe9
	int32_t PointCount; // 0xec
	TArray<FTransform> ControlPoints; // 0xf0
	float Roll; // 0x100
	float TwistStart; // 0x104
	float TwistEnd; // 0x108
	FAlphaBlend TwistBlend; // 0x110
	float Stretch; // 0x140
	float Offset; // 0x144
};

struct FYGetUserCharacterVisualizationData {
	TArray<FString> UserId; // 0x0
};

struct FCompositionGraphCapturePasses {
	TArray<FString> Value; // 0x0
};

struct FClientValidateAmazonReceiptRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	FString CurrencyCode; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
	int32_t PurchasePrice; // 0x30
	FString ReceiptId; // 0x38
	FString UserId; // 0x48
};

struct FNavLinkCustomInstanceData : FActorComponentInstanceData {
	uint32_t NavLinkUserId; // 0x68
};

struct FYPowerUpActivityStats : FYBaseActivityStats {
	int32_t power_up_step; // 0xb8
	FString power_up_id; // 0xc0
	bool contested; // 0xd0
	bool contested_long; // 0xd1
	bool dealt_damage; // 0xd2
	bool dealt_damage_long; // 0xd3
	int32_t time_since_user_joined; // 0xd4
	int32_t puzzle_variation; // 0xd8
};

struct FAnimNode_PowerIK_Ground : FAnimNode_SkeletalControlBase {
	FName CharacterRoot; // 0xc8
	FPowerIKBodyInertia BodyInertia; // 0xd0
	TArray<FPowerIKGroundFoot> Feet; // 0xe8
	float FeetDeltaSmoothSpeed; // 0xf8
	float RootRotationMultiplier; // 0xfc
	FPowerIKGroundCollision GroundCollision; // 0x100
	FPowerIKGroundSlope GroundSlope; // 0x114
	TArray<FPowerIKBoneBendDirection> BendDirections; // 0x1a8
	TArray<FPowerIKExcludedBone> ExcludedBones; // 0x1b8
	TArray<FPowerIKBoneLimit> JointLimits; // 0x1c8
	int32_t MaxSquashIterations; // 0x1e8
	int32_t MaxStretchIterations; // 0x1ec
	int32_t MaxFinalIterations; // 0x1f0
	bool AllowBoneTranslation; // 0x1f4
	float SolverAlpha; // 0x1f8
	float DebugDrawSize; // 0x1fc
};

struct FFrameNumber {
	int32_t Value; // 0x0
};

struct FColorGradePerRangeSettings {
	FVector4 Saturation; // 0x0
	FVector4 Contrast; // 0x10
	FVector4 Gamma; // 0x20
	FVector4 Gain; // 0x30
	FVector4 Offset; // 0x40
};

struct FAnimationSetup {
	UAnimSequence* AnimSequence; // 0x0
	UAnimSharingStateInstance* AnimBlueprint; // 0x8
	FPerPlatformInt NumRandomizedInstances; // 0x10
	FPerPlatformBool Enabled; // 0x14
};

struct FVertexToCreate {
	FMeshElementAttributeList VertexAttributes; // 0x0
	FVertexID OriginalVertexID; // 0x10
};

struct FSingleAnimationPlayData {
	UAnimationAsset* AnimToPlay; // 0x0
	char bSavedLooping : 1; // 0x8
	char bSavedPlaying : 1; // 0x8
	float SavedPosition; // 0xc
	float SavedPlayRate; // 0x10
};

struct FAnimSegment {
	UAnimSequenceBase* AnimReference; // 0x0
	float StartPos; // 0x8
	float AnimStartTime; // 0xc
	float AnimEndTime; // 0x10
	float AnimPlayRate; // 0x14
	int32_t LoopingCount; // 0x18
};

struct FOnlineProxyStoreOffer {
	FString OfferId; // 0x0
	FText Title; // 0x10
	FText Description; // 0x28
	FText LongDescription; // 0x40
	FText RegularPriceText; // 0x58
	int32_t RegularPrice; // 0x70
	FText PriceText; // 0x78
	int32_t NumericPrice; // 0x90
	FString CurrencyCode; // 0x98
	FDateTime ReleaseDate; // 0xa8
	FDateTime ExpirationDate; // 0xb0
	EOnlineProxyStoreOfferDiscountType DiscountType; // 0xb8
	TMap<FString, FString> DynamicFields; // 0xc0
};

struct FClientGetAccountInfoRequest : FPlayFabRequestCommon {
	FString Email; // 0x8
	FString PlayFabId; // 0x18
	FString TitleDisplayName; // 0x28
	FString Username; // 0x38
};

struct FYBaseAnalyticsEvent {
	FString Event; // 0x8
	FString title_id; // 0x18
	FString room_id; // 0x28
	bool is_valid; // 0x38
	FString squad_id; // 0x40
	FString Timestamp; // 0x50
	FString map_name; // 0x60
	FString Platform; // 0x70
	FString user_id; // 0x80
	FString match_phase_type; // 0x90
	int32_t match_phase_time; // 0xa0
};

struct FPolyglotTextData {
	ELocalizedTextSourceCategory Category; // 0x0
	FString NativeCulture; // 0x8
	FString Namespace; // 0x18
	FString Key; // 0x28
	FString NativeString; // 0x38
	TMap<FString, FString> LocalizedStrings; // 0x48
	bool bIsMinimalPatch; // 0x98
	FText CachedText; // 0xa0
};

struct FAnchorData {
	FMargin Offsets; // 0x0
	FAnchors Anchors; // 0x10
	FVector2D Alignment; // 0x20
};

struct FDockTabStyle : FSlateWidgetStyle {
	FButtonStyle CloseButtonStyle; // 0x8
	FSlateBrush NormalBrush; // 0x280
	FSlateBrush ActiveBrush; // 0x308
	FSlateBrush ColorOverlayTabBrush; // 0x390
	FSlateBrush ColorOverlayIconBrush; // 0x418
	FSlateBrush ForegroundBrush; // 0x4a0
	FSlateBrush HoveredBrush; // 0x528
	FSlateBrush ContentAreaBrush; // 0x5b0
	FSlateBrush TabWellBrush; // 0x638
	FMargin TabPadding; // 0x6c0
	float OverlapWidth; // 0x6d0
	FSlateColor FlashColor; // 0x6d8
};

struct FScalarParameterNameAndCurve {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel ParameterCurve; // 0x8
};

struct FRigUnit_SequenceExecution : FRigUnit {
	FControlRigExecuteContext ExecuteContext; // 0x8
	FControlRigExecuteContext A; // 0x68
	FControlRigExecuteContext B; // 0xc8
	FControlRigExecuteContext C; // 0x128
	FControlRigExecuteContext D; // 0x188
};

struct FRigUnit_AccumulateFloatLerp : FRigUnit_SimBase {
	float TargetValue; // 0x8
	float InitialValue; // 0xc
	float Blend; // 0x10
	bool bIntegrateDeltaTime; // 0x14
	float Result; // 0x18
	float AccumulatedValue; // 0x1c
};

struct FRigUnit_MathIntClamp : FRigUnit_MathIntBase {
	int32_t Value; // 0x8
	int32_t Minimum; // 0xc
	int32_t Maximum; // 0x10
	int32_t Result; // 0x14
};

struct FAREnvironmentProbeUpdatePayload {
	FTransform WorldTransform; // 0x0
};

struct FAnimSequenceTrackContainer {
	TArray<FRawAnimSequenceTrack> AnimationTracks; // 0x0
	TArray<FName> TrackNames; // 0x10
};

struct FConstraintInstance : FConstraintInstanceBase {
	FName JointName; // 0x18
	FName ConstraintBone1; // 0x20
	FName ConstraintBone2; // 0x28
	FVector Pos1; // 0x30
	FVector PriAxis1; // 0x3c
	FVector SecAxis1; // 0x48
	FVector Pos2; // 0x54
	FVector PriAxis2; // 0x60
	FVector SecAxis2; // 0x6c
	FRotator AngularRotationOffset; // 0x78
	char bScaleLinearLimits : 1; // 0x84
	FConstraintProfileProperties ProfileInstance; // 0x8c
};

struct FRigConfiguration {
	URig* Rig; // 0x0
	TArray<FNameMapping> BoneMappingTable; // 0x8
};

struct FVectorRK4SpringInterpolator {
	float StiffnessConstant; // 0x0
	float DampeningRatio; // 0x4
};

struct FYDamageNumberEntry {
	UYWidget_DamageNumber* m_widget; // 0x0
};

struct FAdminGetContentListResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Contents; // 0x8
	int32_t ItemCount; // 0x18
	int32_t TotalSize; // 0x1c
};

struct FInputScaleBias {
	float Scale; // 0x0
	float Bias; // 0x4
};

struct FGeomSelection {
	int32_t Type; // 0x0
	int32_t Index; // 0x4
	int32_t SelectionIndex; // 0x8
};

struct FYDebugActionTowardsUserName {
	FString ownerInternalUserId; // 0x0
	FString friendActionUserName; // 0x10
	int32_t actionRequest; // 0x20
};

struct FYContractFailCondition {
	FText m_failConditionName; // 0x0
};

struct FYAIAudio {
	FYAIBarkAudioInfo m_barkIdle; // 0x0
	FYAIBarkAudioInfo m_barkCombat; // 0x18
	FDataTableRowHandle m_stateEnterIdle; // 0x30
	FDataTableRowHandle m_stateEnterCombat; // 0x40
	FDataTableRowHandle m_death; // 0x50
	FDataTableRowHandle m_deathCritical; // 0x60
	FDataTableRowHandle m_barkCombatAlertBehindPlayer; // 0x70
	FDataTableRowHandle m_attackStartMelee; // 0x80
	FDataTableRowHandle m_attackStartRanged; // 0x90
	FDataTableRowHandle m_attackRangedFired; // 0xa0
	FDataTableRowHandle m_hitReaction; // 0xb0
	FDataTableRowHandle m_buffingStart; // 0xc0
	FDataTableRowHandle m_buffingInterrupt; // 0xd0
	FDataTableRowHandle m_summoningStart; // 0xe0
	FDataTableRowHandle m_summoningInterrupt; // 0xf0
	FDataTableRowHandle m_snipedReaction; // 0x100
	FDataTableRowHandle m_spawning; // 0x110
	FDataTableRowHandle m_spawningProjectile; // 0x120
	FDataTableRowHandle m_flinch; // 0x130
	FDataTableRowHandle m_wingsFlapping; // 0x140
	float m_wingsFlappingFadeIn; // 0x150
	float m_wingsFlappingFadeOut; // 0x154
};

struct FCanvasUVTri {
	FVector2D V0_Pos; // 0x0
	FVector2D V0_UV; // 0x8
	FLinearColor V0_Color; // 0x10
	FVector2D V1_Pos; // 0x20
	FVector2D V1_UV; // 0x28
	FLinearColor V1_Color; // 0x30
	FVector2D V2_Pos; // 0x40
	FVector2D V2_UV; // 0x48
	FLinearColor V2_Color; // 0x50
};

struct FYPlayerAbilitiesAudioData {
	FDataTableRowHandle m_cloakStartSound; // 0x0
	FDataTableRowHandle m_cloakEndSound; // 0x10
};

struct FYPlayerStartCluster {
	TArray<AActor*> m_locations; // 0x0
	FVector m_centroid; // 0x10
};

struct FSlateBrush {
	FVector2D ImageSize; // 0x8
	FMargin Margin; // 0x10
	FSlateColor TintColor; // 0x20
	UObject* ResourceObject; // 0x48
	FName ResourceName; // 0x50
	FBox2D UVRegion; // 0x58
	ESlateBrushDrawType DrawAs; // 0x6c
	ESlateBrushTileType Tiling; // 0x6d
	ESlateBrushMirrorType Mirroring; // 0x6e
	ESlateBrushImageType ImageType; // 0x6f
	char bIsDynamicallyLoaded : 1; // 0x80
	char bHasUObject : 1; // 0x80
};

struct FNiagaraScriptDataInterfaceCompileInfo {
	FName Name; // 0x0
	int32_t UserPtrIdx; // 0x8
	FNiagaraTypeDefinition Type; // 0x10
	FName RegisteredParameterMapRead; // 0x20
	FName RegisteredParameterMapWrite; // 0x28
	bool bIsPlaceholder; // 0x30
};

struct FYInsuredItems {
	FDataTableRowHandle m_handle; // 0x0
	TArray<FString> m_items; // 0x10
};

struct FYMissionReplicatedStateData {
	int32_t m_currentStepIndex; // 0x0
	int32_t m_previousStepIndex; // 0x4
	FString m_missionId; // 0x8
	EYMissionResultType m_resultType; // 0x18
};

struct FYRequestPlayerQuarterUpgradePurchase {
	FString UserId; // 0x0
};

struct FInsightsInsightsGetLimitsResponse : FPlayFabResultCommon {
	int32_t DefaultPerformanceLevel; // 0x8
	int32_t DefaultStorageRetentionDays; // 0xc
	int32_t StorageMaxRetentionDays; // 0x10
	int32_t StorageMinRetentionDays; // 0x14
	TArray<UPlayFabJsonObject*> SubMeters; // 0x18
};

struct FYMutingState {
	bool m_isMuted; // 0x0
	float m_durationMuted; // 0x4
	float m_timeStartedMuted; // 0x8
	int32_t m_amountOfTimeMuted; // 0x18
	EYMuteReason m_reason; // 0x1c
};

struct FDirectLinkMsg_CloseStreamRequest {
	int32_t RecipientStreamPort; // 0x0
};

struct FYLeaveSquadResponse {
	EYSquadActionResult Result; // 0x0
};

struct FYCSVMetaDataEntry {
	FString m_filePath; // 0x0
	int32_t m_settingsRow; // 0x10
	int32_t m_rowDataStart; // 0x14
	int32_t m_rowDataEnd; // 0x18
	int32_t m_widthDataStart; // 0x1c
	int32_t m_widthDataEnd; // 0x20
};

struct FYEzProfileInitializationData {
	FString m_triggerReason; // 0x0
	float m_timeToProfile; // 0x10
	EYEZProfileType m_type; // 0x14
	bool m_forceNewProfile; // 0x15
};

struct FAnimNode_PoseSnapshot : FAnimNode_Base {
	FName SnapshotName; // 0x10
	FPoseSnapshot Snapshot; // 0x18
	ESnapshotSourceMode Mode; // 0x50
};

struct FYFXCategoryMaterialParemeterEntry {
	FVector m_vectorParameter; // 0x0
	FName m_name; // 0xc
};

struct FYCommWheelAudioData {
	FDataTableRowHandle m_onOpenCommWheel; // 0x0
	FDataTableRowHandle m_onOpenSubCommWheel; // 0x10
	FDataTableRowHandle m_onAbortCommWheel; // 0x20
	FDataTableRowHandle m_onHoverOverItem; // 0x30
	FDataTableRowHandle m_onCommandInput; // 0x40
};

struct FServerUnlinkXboxAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
};

struct FNiagaraEmitterNameSettingsRef {
	FName SystemName; // 0x0
	FString EmitterName; // 0x8
};

struct FTestDataStruct {
	uint16_t UInt16Field; // 0x0
	int64_t Int64Field; // 0x8
	int8_t Int8Field; // 0x10
};

struct FAdminSetPublishedRevisionRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t Revision; // 0x10
	int32_t Version; // 0x14
};

struct FYUserFriendList {
	TArray<FYFriendEntry> entries; // 0x0
	FString ownerFriendInternalUserId; // 0x10
};

struct FRigUnit_SetBoneTransform : FRigUnitMutable {
	FName Bone; // 0x68
	FTransform Transform; // 0x70
	FTransform Result; // 0xa0
	EBoneGetterSetterMode Space; // 0xd0
	float weight; // 0xd4
	bool bPropagateToChildren; // 0xd8
	FCachedRigElement CachedBone; // 0xdc
};

struct FYGameTipRow : FYDataTableRowBase {
	FText m_tipText; // 0x10
	float m_sustainDuration; // 0x28
};

struct FYClientUserInfo {
	FString UserId; // 0x0
	EYUserState State; // 0x10
	int32_t squadSize; // 0x14
};

struct FAnimNode_PowerIK_Walk : FAnimNode_SkeletalControlBase {
	FName CharacterRoot; // 0xc8
	float RootRotationMultiplier; // 0xd0
	FPowerIKBodyInertia BodyInertia; // 0xd4
	TArray<FPowerIKWalkingLimb> Limbs; // 0xe8
	float StepMaxReachDistance; // 0x104
	float StepDurationMultiplier; // 0x108
	float StepHeightMultiplier; // 0x10c
	UCurveFloat* StepHeightCurve; // 0x110
	UCurveFloat* StepSpeedCurve; // 0x118
	float TeleportDistance; // 0x120
	bool PrintTeleportWarning; // 0x124
	ECollisionChannel CollisionChannel; // 0x125
	bool TraceComplex; // 0x126
	TArray<FPowerIKBoneBendDirection> BendDirections; // 0x128
	TArray<FPowerIKExcludedBone> ExcludedBones; // 0x138
	TArray<FPowerIKBoneLimit> JointLimits; // 0x148
	int32_t MaxSquashIterations; // 0x158
	int32_t MaxStretchIterations; // 0x15c
	int32_t MaxFinalIterations; // 0x160
	bool AllowBoneTranslation; // 0x164
	float SolverAlpha; // 0x168
	float DebugDrawSize; // 0x16c
};

struct FClientGetPlayFabIDsFromKongregateIDsRequest : FPlayFabRequestCommon {
	FString KongregateIDs; // 0x8
};

struct FYAnnouncement {
	FString Msg; // 0x0
	EYChannelType ChannelType; // 0x10
};

struct FYUIWeaponAmmoData {
	int32_t m_weaponMagazineSize; // 0x0
	int32_t m_totalAmmoCompatibleWithWeaponInBag; // 0x4
};

struct FCollisionResponse {
	FCollisionResponseContainer ResponseToChannels; // 0x0
	TArray<FResponseChannel> ResponseArray; // 0x20
};

struct FYBossEncounterTrackingData {
	FYBossEncounterActivityStats m_stats; // 0x0
	int32_t m_firstInteractionTimeStamp; // 0xc8
	int32_t m_lastInteractionTimeStamp; // 0xcc
};

struct FRigUnit_GetWorldTime : FRigUnit_AnimBase {
	float Year; // 0x8
	float Month; // 0xc
	float Day; // 0x10
	float WeekDay; // 0x14
	float Hours; // 0x18
	float Minutes; // 0x1c
	float Seconds; // 0x20
	float OverallSeconds; // 0x24
};

struct FTransformConstraint {
	FConstraintDescription Operator; // 0x0
	FName SourceNode; // 0x10
	FName TargetNode; // 0x18
	float weight; // 0x20
	bool bMaintainOffset; // 0x24
};

struct FYClaimGeneratorIncomeRequest {
	FString UserId; // 0x0
	FName generatorId; // 0x10
};

struct FYPersistentSessionResetRequest {
	FString desiredRegion; // 0x0
};

struct FLandscapeComponentMaterialOverride {
	FPerPlatformInt LODIndex; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FYSetMissionActive {
	FString UserId; // 0x0
	FString missionArcId; // 0x10
	FString missionId; // 0x20
	bool newState; // 0x30
};

struct FAttributesForEdge {
	FEdgeID EdgeID; // 0x0
	FMeshElementAttributeList EdgeAttributes; // 0x8
};

struct FServerRedeemMatchmakerTicketResult : FPlayFabResultCommon {
	FString Error; // 0x8
	bool TicketIsValid; // 0x18
	UPlayFabJsonObject* UserInfo; // 0x20
};

struct FYShowItems {
	FString UserId; // 0x0
};

struct FYGetQuestsResponse {
	FString UserId; // 0x0
	TArray<FYQuestState> quests; // 0x10
	int32_t playerNumOfRerollTokens; // 0x20
};

struct FFunctionCaller {
	FName FunctionName; // 0x0
};

struct FYSquadInfo {
	TArray<AYPlayerState*> m_members; // 0x0
	FString m_squadId; // 0x10
	int32_t m_size; // 0x20
};

struct FDataGetFilesRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
};

struct FYSquadMemberReadyUpNotification {
	FString UserId; // 0x0
	FYUserMatchmakingSettings matchmakingSettings; // 0x10
};

struct FYActivityLocationArray {
	TArray<AYActivityLocation*> m_locations; // 0x0
};

struct FClientGetLeaderboardResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Leaderboard; // 0x8
	FString NextReset; // 0x18
	int32_t Version; // 0x28
};

struct FAdminUpdatePolicyResponse : FPlayFabResultCommon {
	FString PolicyName; // 0x8
	TArray<UPlayFabJsonObject*> Statements; // 0x18
};

struct FClientGetTitleDataResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Data; // 0x8
};

struct FDataGetObjectsResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	UPlayFabJsonObject* Objects; // 0x10
	int32_t ProfileVersion; // 0x18
};

struct FAdminGetTasksRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Identifier; // 0x8
};

struct FYGetUsersCurrenciesResult {
	EYGetUsersCurrenciesResult Result; // 0x0
	TArray<FYUserCurrenciesItems> currencyItems; // 0x8
};

struct FClientGetLeaderboardRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t MaxResultsCount; // 0x10
	UPlayFabJsonObject* ProfileConstraints; // 0x18
	int32_t StartPosition; // 0x20
	FString StatisticName; // 0x28
	bool UseSpecificVersion; // 0x38
	int32_t Version; // 0x3c
};

struct FMovieSceneEvaluationFieldTrackPtr {
	FMovieSceneSequenceID SequenceID; // 0x0
	FMovieSceneTrackIdentifier TrackIdentifier; // 0x4
};

struct FYContractProgress {
	FString contractId; // 0x0
	TArray<int32_t> objectivesProgress; // 0x10
};

struct FServerAuthenticateSessionTicketResult : FPlayFabResultCommon {
	bool IsSessionTicketExpired; // 0x8
	UPlayFabJsonObject* UserInfo; // 0x10
};

struct FNamedInterface {
	FName InterfaceName; // 0x0
	UObject* InterfaceObject; // 0x8
};

struct FMovieSceneRootEvaluationTemplateInstance {
	TWeakObjectPtr<UMovieSceneSequence> WeakRootSequence; // 0x0
	UMovieSceneCompiledDataManager* CompiledDataManager; // 0x8
	UMovieSceneEntitySystemLinker* EntitySystemLinker; // 0x18
	TMap<FMovieSceneSequenceID, UObject*> DirectorInstances; // 0x90
};

struct FHorizonTweenEventCustomCurve {
	FRuntimeFloatCurve CustomTweenCurve; // 0x0
};

struct FHorizonTweenEventSlateWidgetRotatorFromToParameters : FHorizonTweenEventFloatParameters {
	bool bShortestPath; // 0xb8
};

struct FNiagaraDetailsLevelScaleOverrides {
	float Low; // 0x0
	float Medium; // 0x4
	float High; // 0x8
	float Epic; // 0xc
	float Cine; // 0x10
};

struct FMathRBFInterpolateVectorQuat_Target {
	FVector Target; // 0x0
	FQuat Value; // 0x10
};

struct FStructure_HUD_ProgressBars {
	float StartValue_7_C4C15954450AAA4F616FDE8A91A5AC08; // 0x0
	float DesiredValue_3_2C117D094E4B9F91267EFF82B906EAFE; // 0x4
	float Alpha_5_D86EF2224E857BC7B927459986D8A1C8; // 0x8
	UProgressBar* ProgressBar_10_700A577046AAB0A82FA4BF9177426292; // 0x10
	float Speed_13_7B8385DB490AC27EBC94CAB250DF4EC3; // 0x18
	float Delay_15_34041B7E4CCFD62346ED32B285990076; // 0x1c
	EHorizonTweenLerpMode InterpolationMode_20_41F3AC9E428769FF838307B96C4C0791; // 0x20
	bool IsDone_22_CABD3814486E24C2C224A4BA4916C019; // 0x21
};

struct FYCurrentQueueInfo {
	FString GameMode; // 0x0
	FString Region; // 0x10
	int32_t numPlayers; // 0x20
	int32_t roomSize; // 0x24
};

struct FYLootCountData {
	FDataTableRowHandle m_rowHandle; // 0x0
	int32_t m_rollCount; // 0x10
};

struct FYBaseWheelEntry : FTableRowBase {
	FText m_displayName; // 0x8
	EYWheelType m_wheelItemType; // 0x20
	FDataTableRowHandle m_uniqueRowHandleReference; // 0x28
	TSoftObjectPtr<UTexture2D> m_iconWheelTexture; // 0x38
};

struct FServerGetPlayFabIDsFromGenericIDsRequest : FPlayFabRequestCommon {
	TArray<UPlayFabJsonObject*> GenericIDs; // 0x8
};

struct FInterpCurvePointFloat {
	float InVal; // 0x0
	float OutVal; // 0x4
	float ArriveTangent; // 0x8
	float LeaveTangent; // 0xc
	EInterpCurveMode InterpMode; // 0x10
};

struct FScalarParameterAtlasInstanceData {
	bool bIsUsedAsAtlasPosition; // 0x0
	TSoftObjectPtr<UCurveLinearColor> Curve; // 0x8
	TSoftObjectPtr<UCurveLinearColorAtlas> Atlas; // 0x30
};

struct FRigUnit_MathIntGreater : FRigUnit_MathIntBase {
	int32_t A; // 0x8
	int32_t B; // 0xc
	bool Result; // 0x10
};

struct FServerGrantItemsToUsersResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> ItemGrantResults; // 0x8
};

struct FYKilledAIAnalyticsEvents {
	TMap<FName, FYKilledAIAnalyticsEvent> m_killedAIAnalyticsEventsByName; // 0x0
};

struct FExpressionInput {
	int32_t OutputIndex; // 0x0
	FName ExpressionName; // 0x4
};

struct FYRemoveAllCustomItems {
	FString UserId; // 0x0
};

struct FRigUnit_MathBoolEquals : FRigUnit_MathBoolBase {
	bool A; // 0x8
	bool B; // 0x9
	bool Result; // 0xa
};

struct FBehaviorInfo {
	UInputBehavior* Behavior; // 0x0
};

struct FServerGetPlayerTagsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Namespace; // 0x10
	FString PlayFabId; // 0x20
};

struct FYCharacterCustomizationMaterialPieceEntry {
	TSoftObjectPtr<UMaterialInterface> m_material; // 0x0
	int32_t m_index; // 0x28
};

struct FYStoreItemData {
	int32_t m_priceSoftCurrency; // 0x0
	int32_t m_priceHardCurrency; // 0x4
	int32_t m_priceRealMoney; // 0x8
	FText m_display_name; // 0x10
	FText m_description; // 0x28
	TSoftObjectPtr<UTexture2D> m_image; // 0x40
};

struct FSpriteCategoryInfo {
	FName Category; // 0x0
	FText DisplayName; // 0x8
	FText Description; // 0x20
};

struct FServerLoginWithXboxIdRequest : FPlayFabRequestCommon {
	bool CreateAccount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	UPlayFabJsonObject* InfoRequestParameters; // 0x18
	FString Sandbox; // 0x20
	FString XboxId; // 0x30
};

struct FCloudScriptPostFunctionResultForScheduledTaskRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	UPlayFabJsonObject* FunctionResult; // 0x18
	UPlayFabJsonObject* ScheduledTaskId; // 0x20
};

struct FServerRevokeAllBansForUserRequest : FPlayFabRequestCommon {
	FString PlayFabId; // 0x8
};

struct FClientUnlinkAppleRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FBoneMirrorInfo {
	int32_t SourceIndex; // 0x0
	EAxis BoneFlipAxis; // 0x4
};

struct FMovieSceneTrackInstanceEntry {
	UObject* BoundObject; // 0x0
	UMovieSceneTrackInstance* TrackInstance; // 0x8
};

struct FRadialBoxSettings {
	bool bDistributeItemsEvenly; // 0x0
	float AngleBetweenItems; // 0x4
	float StartingAngle; // 0x8
};

struct FARPoseUpdatePayload {
	FTransform WorldTransform; // 0x0
	TArray<FTransform> JointTransforms; // 0x30
};

struct FRigUnit_AccumulateVectorLerp : FRigUnit_SimBase {
	FVector TargetValue; // 0x8
	FVector InitialValue; // 0x14
	float Blend; // 0x20
	bool bIntegrateDeltaTime; // 0x24
	FVector Result; // 0x28
	FVector AccumulatedValue; // 0x34
};

struct FMeshProxySettings {
	int32_t ScreenSize; // 0x0
	float VoxelSize; // 0x4
	FMaterialProxySettings MaterialSettings; // 0x8
	float MergeDistance; // 0x90
	FColor UnresolvedGeometryColor; // 0x94
	float MaxRayCastDist; // 0x98
	float HardAngleThreshold; // 0x9c
	int32_t LightMapResolution; // 0xa0
	EProxyNormalComputationMethod NormalCalculationMethod; // 0xa4
	ELandscapeCullingPrecision LandscapeCullingPrecision; // 0xa5
	char bCalculateCorrectLODModel : 1; // 0xa6
	char bOverrideVoxelSize : 1; // 0xa6
	char bOverrideTransferDistance : 1; // 0xa6
	char bUseHardAngleThreshold : 1; // 0xa6
	char bComputeLightMapResolution : 1; // 0xa6
	char bRecalculateNormals : 1; // 0xa6
	char bUseLandscapeCulling : 1; // 0xa6
	char bAllowAdjacency : 1; // 0xa6
	char bAllowDistanceField : 1; // 0xa7
	char bReuseMeshLightmapUVs : 1; // 0xa7
	char bCreateCollision : 1; // 0xa7
	char bAllowVertexColors : 1; // 0xa7
	char bGenerateLightmapUVs : 1; // 0xa7
};

struct FYPlayerRankedSeasonGamemodeData {
	FString UserId; // 0x0
	FString GameMode; // 0x10
	int32_t rank; // 0x20
	int32_t highestRank; // 0x24
};

struct FAdminGetPolicyResponse : FPlayFabResultCommon {
	FString PolicyName; // 0x8
	TArray<UPlayFabJsonObject*> Statements; // 0x18
};

struct FYClientConfiguration {
	FString surveyLink; // 0x0
	TArray<FYConfigEntry> dataTablesData; // 0x10
	FString matchmakingExchange; // 0x20
};

struct FProfilesGetEntityProfileResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Profile; // 0x8
};

struct FServerLinkXboxAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool ForceLink; // 0x10
	FString PlayFabId; // 0x18
	FString XboxToken; // 0x28
};

struct FAdminSetTitleDataRequest : FPlayFabRequestCommon {
	FString Key; // 0x8
	FString Value; // 0x18
};

struct FPreviewAttachedObjectPair {
	TSoftObjectPtr<UObject> AttachedObject; // 0x0
	UObject* Object; // 0x28
	FName AttachedTo; // 0x30
};

struct FBasedMovementInfo {
	UPrimitiveComponent* MovementBase; // 0x0
	FName BoneName; // 0x8
	FVector_NetQuantize100 Location; // 0x10
	FRotator Rotation; // 0x1c
	bool bServerHasBaseComponent; // 0x28
	bool bRelativeRotation; // 0x29
	bool bServerHasVelocity; // 0x2a
};

struct FNiagaraDataSetProperties {
	FNiagaraDataSetID ID; // 0x0
	TArray<FNiagaraVariable> Variables; // 0x10
};

struct FYAIStabilityDefinition {
	FName m_name; // 0x0
	float m_cooldown; // 0x8
	float m_stabilityThreshold; // 0xc
	UCurveFloat* m_stabilityMultiplierAfterTrigger; // 0x10
	float m_stabilityDecreasePerSecond; // 0x18
	bool m_isFlinchAnimation; // 0x1c
	TArray<FDataTableRowHandle> m_perksToApply; // 0x20
};

struct FYVanityUsage : FYBaseAnalyticsEvent {
	int32_t vanity_type; // 0xa8
	FString Location; // 0xb0
	FString item_id; // 0xc0
	FString item_name; // 0xd0
	int32_t time_since_match_start; // 0xe0
};

struct FRigUnit_SetTransform : FRigUnitMutable {
	FRigElementKey Item; // 0x68
	EBoneGetterSetterMode Space; // 0x74
	bool bInitial; // 0x75
	FTransform Transform; // 0x80
	float weight; // 0xb0
	bool bPropagateToChildren; // 0xb4
	FCachedRigElement CachedIndex; // 0xb8
};

struct FClientGetFriendLeaderboardRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool IncludeFacebookFriends; // 0x10
	bool IncludeSteamFriends; // 0x11
	int32_t MaxResultsCount; // 0x14
	UPlayFabJsonObject* ProfileConstraints; // 0x18
	int32_t StartPosition; // 0x20
	FString StatisticName; // 0x28
	bool UseSpecificVersion; // 0x38
	int32_t Version; // 0x3c
	FString XboxToken; // 0x40
};

struct FServerNotifyMatchmakerPlayerLeftRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString LobbyId; // 0x10
	FString PlayFabId; // 0x20
};

struct FYUpgradeEntry {
	FString ID; // 0x0
	int32_t desiredLevel; // 0x10
	FYCustomItemInfo desiredItemState; // 0x18
};

struct FFilmStockSettings {
	float Slope; // 0x0
	float Toe; // 0x4
	float Shoulder; // 0x8
	float BlackClip; // 0xc
	float WhiteClip; // 0x10
};

struct FSplineMeshParams {
	FVector StartPos; // 0x0
	FVector StartTangent; // 0xc
	FVector2D StartScale; // 0x18
	float StartRoll; // 0x20
	FVector2D StartOffset; // 0x24
	FVector EndPos; // 0x2c
	FVector2D EndScale; // 0x38
	FVector EndTangent; // 0x40
	float EndRoll; // 0x4c
	FVector2D EndOffset; // 0x50
};

struct FYActiveContractUIData {
	FString contractId; // 0x0
	EYContractStatus contractStatus; // 0x10
};

struct FVector2DParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel XCurve; // 0x8
	FMovieSceneFloatChannel YCurve; // 0xa8
};

struct FRigUnit_AimBone_Target {
	float weight; // 0x0
	FVector Axis; // 0x4
	FVector Target; // 0x10
	EControlRigVectorKind Kind; // 0x1c
	FName Space; // 0x20
};

struct FHyperlinkStyle : FSlateWidgetStyle {
	FButtonStyle UnderlineStyle; // 0x8
	FTextBlockStyle TextStyle; // 0x280
	FMargin Padding; // 0x4f0
};

struct FLandmassBrushEffectsList {
	FBrushEffectBlurring Blurring; // 0x0
	FBrushEffectCurlNoise CurlNoise; // 0x8
	FBrushEffectDisplacement Displacement; // 0x18
	FBrushEffectSmoothBlending SmoothBlending; // 0x40
	FBrushEffectTerracing Terracing; // 0x48
};

struct FRigUnit_MathTransformBinaryOp : FRigUnit_MathTransformBase {
	FTransform A; // 0x10
	FTransform B; // 0x40
	FTransform Result; // 0x70
};

struct FInAppPurchaseProductInfo {
	FString Identifier; // 0x0
	FString TransactionIdentifier; // 0x10
	FString DisplayName; // 0x20
	FString DisplayDescription; // 0x30
	FString DisplayPrice; // 0x40
	float RawPrice; // 0x50
	FString CurrencyCode; // 0x58
	FString CurrencySymbol; // 0x68
	FString DecimalSeparator; // 0x78
	FString GroupingSeparator; // 0x88
	FString ReceiptData; // 0x98
};

struct FGroupsRemoveGroupInvitationRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	UPlayFabJsonObject* Group; // 0x18
};

struct FARVideoFormat {
	int32_t FPS; // 0x0
	int32_t Width; // 0x4
	int32_t Height; // 0x8
};

struct FRigUnit_ItemExists : FRigUnit_ItemBase {
	FRigElementKey Item; // 0x8
	bool Exists; // 0x14
	FCachedRigElement CachedIndex; // 0x18
};

struct FSTR_AimAssistTarget {
	float AngleCOS_13_5D8346FA402979DE03A1E68BD674205F; // 0x0
	float Distance_16_A4030D4F431F92B26824329B80C346DC; // 0x4
	FVector ImpactPoint_5_C197FA754F578D0B7AB35A8CB4867CB7; // 0x8
	AActor* HitActor_8_5DFA8E4E48B6AA2191514D9E68245B1F; // 0x18
	FName HitBoneName_11_28888DC14E898D69B1EA5D90C17C7172; // 0x20
};

struct FClientUpdatePlayerStatisticsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	TArray<UPlayFabJsonObject*> Statistics; // 0x10
};

struct FRigUnit_NoiseVector : FRigUnit_MathBase {
	FVector Position; // 0x8
	FVector Speed; // 0x14
	FVector Frequency; // 0x20
	float Minimum; // 0x2c
	float Maximum; // 0x30
	FVector Result; // 0x34
	FVector Time; // 0x40
};

struct FServerLinkServerCustomIdRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool ForceLink; // 0x10
	FString PlayFabId; // 0x18
	FString ServerCustomId; // 0x28
};

struct FClientGetFriendsListRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool IncludeFacebookFriends; // 0x10
	bool IncludeSteamFriends; // 0x11
	UPlayFabJsonObject* ProfileConstraints; // 0x18
	FString XboxToken; // 0x20
};

struct FAnimNode_ScaleChainLength : FAnimNode_Base {
	FPoseLink InputPose; // 0x10
	float DefaultChainLength; // 0x20
	FBoneReference ChainStartBone; // 0x24
	FBoneReference ChainEndBone; // 0x34
	FVector TargetLocation; // 0x44
	float Alpha; // 0x50
	FInputScaleBias AlphaScaleBias; // 0x58
	EScaleChainInitialLength ChainInitialLength; // 0x60
};

struct FConstraintProfileProperties {
	float ProjectionLinearTolerance; // 0x0
	float ProjectionAngularTolerance; // 0x4
	float ProjectionLinearAlpha; // 0x8
	float ProjectionAngularAlpha; // 0xc
	float LinearBreakThreshold; // 0x10
	float AngularBreakThreshold; // 0x14
	FLinearConstraint LinearLimit; // 0x18
	FConeConstraint ConeLimit; // 0x34
	FTwistConstraint TwistLimit; // 0x54
	FLinearDriveConstraint LinearDrive; // 0x70
	FAngularDriveConstraint AngularDrive; // 0xbc
	char bDisableCollision : 1; // 0x108
	char bParentDominates : 1; // 0x108
	char bEnableProjection : 1; // 0x108
	char bEnableSoftProjection : 1; // 0x108
	char bAngularBreakable : 1; // 0x108
	char bLinearBreakable : 1; // 0x108
};

struct FYDebugFindDropLocationVectorInfo {
	FVector m_locationContextOrigin; // 0x0
	FVector m_location; // 0xc
	FString m_description; // 0x18
	FColor m_color; // 0x28
};

struct FChaosCollisionEventRequestSettings {
	int32_t MaxNumberResults; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc
	float MaxDistance; // 0x10
	EChaosCollisionSortMethod SortMethod; // 0x14
};

struct FMultiplayerListContainerImageTagsResponse : FPlayFabResultCommon {
	FString Tags; // 0x8
};

struct FAdminRevokeAllBansForUserRequest : FPlayFabRequestCommon {
	FString PlayFabId; // 0x8
};

struct FYClaimCompletedActiveContractRewardsRequest {
	FString UserId; // 0x0
	FString contractId; // 0x10
};

struct FYGameModeConfigurationUpdated {
	FYGameModeConfigEntry updatedData; // 0x0
};

struct FClientGetAdPlacementsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> AdPlacements; // 0x8
};

struct FClientGetPlayFabIDsFromXboxLiveIDsRequest : FPlayFabRequestCommon {
	FString Sandbox; // 0x8
	FString XboxLiveAccountIDs; // 0x18
};

struct FMultiplayerUpdateBuildAliasRequest : FPlayFabRequestCommon {
	FString AliasId; // 0x8
	FString AliasName; // 0x18
	TArray<UPlayFabJsonObject*> BuildSelectionCriteria; // 0x28
	UPlayFabJsonObject* CustomTags; // 0x38
};

struct FMovieSceneBytePropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneByteChannel ByteCurve; // 0x38
};

struct FYDebugSetAllCraftingMaterialsAmount {
	FString UserId; // 0x0
	int32_t materialAmount; // 0x10
};

struct FYVanityClearCustomItem {
	FString UserId; // 0x0
	FString custom_id; // 0x10
	int32_t slotId; // 0x20
};

struct FEasingComponentData {
	UMovieSceneSection* Section; // 0x0
};

struct FYDebugSimulateDateTimeShop {
	FString DateTime; // 0x0
};

struct FAnimNode_RotationOffsetBlendSpace : FAnimNode_BlendSpacePlayer {
	FPoseLink BasePose; // 0xe8
	int32_t LODThreshold; // 0xf8
	float Alpha; // 0xfc
	FInputScaleBias AlphaScaleBias; // 0x100
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x108
	FName AlphaCurveName; // 0x150
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x158
	EAnimAlphaInputType AlphaInputType; // 0x18c
	bool bAlphaBoolEnabled; // 0x18d
};

struct FEyeTrackerGazeData {
	FVector GazeOrigin; // 0x0
	FVector GazeDirection; // 0xc
	FVector FixationPoint; // 0x18
	float ConfidenceValue; // 0x24
};

struct FRigUnit_ToRigSpace_Location : FRigUnit {
	FVector Location; // 0x8
	FVector Global; // 0x14
};

struct FPropertyAccessIndirection {
	TFieldPath<FArrayProperty> ArrayProperty; // 0x0
	UFunction* Function; // 0x20
	int32_t ReturnBufferSize; // 0x28
	int32_t ReturnBufferAlignment; // 0x2c
	int32_t ArrayIndex; // 0x30
	uint32_t Offset; // 0x34
	EPropertyAccessObjectType ObjectType; // 0x38
	EPropertyAccessIndirectionType Type; // 0x39
};

struct FClientUpdateSharedGroupDataRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Data; // 0x10
	FString KeysToRemove; // 0x18
	EUserDataPermission Permission; // 0x28
	FString SharedGroupId; // 0x30
};

struct FConstraint {
	FBoneReference TargetBone; // 0x0
	EConstraintOffsetOption OffsetOption; // 0x10
	ETransformConstraintType TransformType; // 0x11
	FFilterOptionPerAxis PerAxis; // 0x12
};

struct FDialogueContextMapping {
	FDialogueContext Context; // 0x0
	USoundWave* SoundWave; // 0x18
	FString LocalizationKeyFormat; // 0x20
	UDialogueSoundWaveProxy* Proxy; // 0x30
};

struct FGroupsApplyToGroupRequest : FPlayFabRequestCommon {
	bool AutoAcceptOutstandingInvite; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	UPlayFabJsonObject* Entity; // 0x18
	UPlayFabJsonObject* Group; // 0x20
};

struct FRigUnit_ConvertTransform : FRigUnit {
	FTransform Input; // 0x10
	FEulerTransform Result; // 0x40
};

struct FServerGetCharacterLeaderboardRequest : FPlayFabRequestCommon {
	FString CharacterType; // 0x8
	int32_t MaxResultsCount; // 0x18
	int32_t StartPosition; // 0x1c
	FString StatisticName; // 0x20
};

struct FEngineServiceAuthGrant {
	FString Username; // 0x0
	FString UserToGrant; // 0x10
};

struct FMultiplayerListServerBackfillTicketsForPlayerResult : FPlayFabResultCommon {
	FString TicketIds; // 0x8
};

struct FYPlayerSetItemsEntry {
	FYPlayerSet SetData; // 0x0
	TArray<FYCustomItemInfo> Items; // 0xa0
};

struct FAnimGraphBlendOptions {
	float BlendInTime; // 0x0
	float BlendOutTime; // 0x4
};

struct FIntegralKey {
	float Time; // 0x0
	int32_t Value; // 0x4
};

struct FBlueprintInputAxisDelegateBinding : FBlueprintInputDelegateBinding {
	FName InputAxisName; // 0x4
	FName FunctionNameToBind; // 0xc
};

struct FRigUnit_MathIntToFloat : FRigUnit_MathIntBase {
	int32_t Value; // 0x8
	float Result; // 0xc
};

struct FRigUnit_ProjectTransformToNewParent : FRigUnit {
	FRigElementKey Child; // 0x8
	bool bChildInitial; // 0x14
	FRigElementKey OldParent; // 0x18
	bool bOldParentInitial; // 0x24
	FRigElementKey NewParent; // 0x28
	bool bNewParentInitial; // 0x34
	FTransform Transform; // 0x40
	FCachedRigElement CachedChild; // 0x70
	FCachedRigElement CachedOldParent; // 0x84
	FCachedRigElement CachedNewParent; // 0x98
};

struct FYEntitlementRow : FTableRowBase {
	FString m_entitlementName; // 0x8
	FDataTableRowHandle m_messageId; // 0x18
	TArray<FDataTableRowHandle> m_grants; // 0x28
};

struct FYClientConfiguratonUpdated {
	FYClientConfiguration config; // 0x0
};

struct FYFXCategoryMaterialFloatParemeterEntry {
	float m_floatParameter; // 0x0
	FName m_name; // 0x4
};

struct FYGetCraftingInProgressDataRequest {
	FString UserId; // 0x0
};

struct FRigUnit_MathFloatSelectBool : FRigUnit_MathFloatBase {
	bool Condition; // 0x8
	float IfTrue; // 0xc
	float IfFalse; // 0x10
	float Result; // 0x14
};

struct FYWeaponAnalyticsPerPlayer {
	TMap<FName, FYWeaponAnalyticsEvent> m_weaponAnalytics; // 0x0
};

struct FUpdateLevelStreamingLevelStatus {
	FName PackageName; // 0x0
	int32_t LODIndex; // 0x8
	char bNewShouldBeLoaded : 1; // 0xc
	char bNewShouldBeVisible : 1; // 0xc
	char bNewShouldBlockOnLoad : 1; // 0xc
};

struct FMovieSceneSequencePlaybackSettings {
	char bAutoPlay : 1; // 0x0
	FMovieSceneSequenceLoopCount LoopCount; // 0x4
	float PlayRate; // 0x8
	float StartTime; // 0xc
	char bRandomStartTime : 1; // 0x10
	char bRestoreState : 1; // 0x10
	char bDisableMovementInput : 1; // 0x10
	char bDisableLookAtInput : 1; // 0x10
	char bHidePlayer : 1; // 0x10
	char bHideHud : 1; // 0x10
	char bDisableCameraCuts : 1; // 0x10
	char bPauseAtEnd : 1; // 0x10
};

struct FRigUnit_MathQuaternionSwingTwist : FRigUnit_MathQuaternionBase {
	FQuat Input; // 0x10
	FVector TwistAxis; // 0x20
	FQuat Swing; // 0x30
	FQuat Twist; // 0x40
};

struct FEnvDirection {
	UEnvQueryContext* LineFrom; // 0x0
	UEnvQueryContext* LineTo; // 0x8
	UEnvQueryContext* Rotation; // 0x10
	EEnvDirection DirMode; // 0x18
};

struct FYAbilityAnalyticsPerPlayer {
	FString m_playerNetID; // 0x0
	AActor* m_relevantPlayerActor; // 0x10
	TArray<FYAbilityAnalyticsEvent> m_abilities; // 0x18
};

struct FAISenseAffiliationFilter {
	char bDetectEnemies : 1; // 0x0
	char bDetectNeutrals : 1; // 0x0
	char bDetectFriendlies : 1; // 0x0
};

struct FClientAddSharedGroupMembersRequest : FPlayFabRequestCommon {
	FString PlayFabIds; // 0x8
	FString SharedGroupId; // 0x18
};

struct FYControlsSettingsChangedEvent : FYBaseAnalyticsEvent {
	float sensitivity; // 0xa8
	float ads_sensitivity; // 0xac
	bool invert_x_axis; // 0xb0
	bool invert_y_axis; // 0xb1
	bool mouse_smoothing; // 0xb2
	bool fov_based_sensitivity_scaling; // 0xb3
	bool sprint_toggle; // 0xb4
	bool crouch_toggle; // 0xb5
	bool targeting_toggle; // 0xb6
	bool leaning_toggle; // 0xb7
};

struct FMultiplayerGetMultiplayerServerDetailsRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString Region; // 0x20
	FString SessionId; // 0x30
};

struct FYPlayfabStoreItemsResult {
	FString StoreId; // 0x0
	FString CatalogVersion; // 0x10
	TArray<FYPlayfabStoreItemEntry> storeItems; // 0x20
};

struct FRigUnit_MathIntGreaterEqual : FRigUnit_MathIntBase {
	int32_t A; // 0x8
	int32_t B; // 0xc
	bool Result; // 0x10
};

struct FRigUnit_MultiFABRIK_EndEffector {
	FName Bone; // 0x0
	FVector Location; // 0x8
};

struct FClientUpdateAvatarUrlRequest : FPlayFabRequestCommon {
	FString ImageUrl; // 0x8
};

struct FIntPoint {
	int32_t X; // 0x0
	int32_t Y; // 0x4
};

struct FRigUnit_SetMultiControlInteger : FRigUnitMutable {
	TArray<FRigUnit_SetMultiControlInteger_Entry> entries; // 0x68
	float weight; // 0x78
	TArray<FCachedRigElement> CachedControlIndices; // 0x80
};

struct FYDataTablePropertyData {
	UDataTable* m_weaponDatatable; // 0x0
	UDataTable* m_meleeWeaponDatatable; // 0x8
	UDataTable* m_abilityDataTable; // 0x10
	UDataTable* m_modDataTable; // 0x18
	UDataTable* m_sceneDataTable; // 0x20
	UDataTable* m_materialsDataTable; // 0x28
	UDataTable* m_keycardsDataTable; // 0x30
	UDataTable* m_currenciesDataTable; // 0x38
	UDataTable* m_ammunitionDataTable; // 0x40
	UDataTable* m_scrapingDataTable; // 0x48
	UDataTable* m_experienceDataTable; // 0x50
	UDataTable* m_loreItemsDataTable; // 0x58
	UDataTable* m_serverPerformanceTuningDataTable; // 0x60
	UDataTable* m_collectiblesTypesDataTable; // 0x68
	UDataTable* m_questItemsTypesDataTable; // 0x70
	UDataTable* m_shieldItemsDataTable; // 0x78
	UDataTable* m_helmetsDataTable; // 0x80
	UDataTable* m_aiArmorDataTable; // 0x88
	UDataTable* m_bagDataTable; // 0x90
	UDataTable* m_prospectorBadgeDataTable; // 0x98
	UDataTable* m_meleeVanityDataTable; // 0xa0
	UDataTable* m_characterCustomizationExplicitDataTable; // 0xa8
	UDataTable* m_characterCustomizationArchetypeDataTable; // 0xb0
	UDataTable* m_keybindingIconsDatatable; // 0xb8
	UDataTable* m_retentionBonusDatatable; // 0xc0
	UDataTable* m_prospectorRankDataTable; // 0xc8
	UDataTable* m_rankedSeasonDataTable; // 0xd0
	UDataTable* m_eosStatsDataTable; // 0xd8
	UDataTable* m_statsCombinationDataTable; // 0xe0
	UDataTable* m_metaDefaultItemsDataTable; // 0xe8
	UDataTable* m_gameSessionDataTable; // 0xf0
	UDataTable* m_impactDataTable; // 0xf8
	UDataTable* m_killImpactEffectsDataTable; // 0x100
	UDataTable* m_shieldBreakImpactEffectsDataTable; // 0x108
	UDataTable* m_fxDataTable; // 0x110
	UDataTable* m_characterCustomizationCategoryDataTable; // 0x118
	UDataTable* m_characterCustomizationDefaultSettingsDataTable; // 0x120
	UDataTable* m_perksDataTable; // 0x128
	UDataTable* m_transportDataTable; // 0x130
	UDataTable* m_lootItemsDataTable; // 0x138
	UDataTable* m_scopeTuningDataTable; // 0x140
	UDataTable* m_notificationDataTable; // 0x148
	UDataTable* m_matchmakingDataTable; // 0x150
	UDataTable* m_factionsDataTable; // 0x158
	UDataTable* m_contractsDataTable; // 0x160
	UDataTable* m_shopOffersDataTable; // 0x168
	UDataTable* m_playFabStoresDataTable; // 0x170
	UDataTable* m_seasonsDataTable; // 0x178
	UDataTable* m_cameraItemDataTable; // 0x180
	UDataTable* m_ammoTypesDataTable; // 0x188
	UDataTable* m_playerQuarterUpgradesDataTable; // 0x190
	UDataTable* m_techTreeNodesDataTable; // 0x198
	UDataTable* m_techTreeCategoriesDataTable; // 0x1a0
	UDataTable* m_passiveGeneratorsCrateRewards0DataTable; // 0x1a8
	UDataTable* m_passiveGeneratorsCrateRewards1DataTable; // 0x1b0
	UDataTable* m_passiveGeneratorsCrateRewards2DataTable; // 0x1b8
	UDataTable* m_passiveGeneratorsCrateRewards3DataTable; // 0x1c0
	UDataTable* m_passiveGeneratorsCrateRewards4DataTable; // 0x1c8
	UDataTable* m_passiveGeneratorsCrateRewards5DataTable; // 0x1d0
	UDataTable* m_passiveGeneratorsCrateRewards6DataTable; // 0x1d8
	UDataTable* m_passiveGeneratorsCrateRewards7DataTable; // 0x1e0
	UDataTable* m_passiveGeneratorsCrateRewards8DataTable; // 0x1e8
	UDataTable* m_passiveGeneratorsCrateRewards9DataTable; // 0x1f0
	UDataTable* m_passiveGeneratorsCrateRewards10DataTable; // 0x1f8
	UDataTable* m_passiveGeneratorsCrateRewardsDataTable; // 0x200
	UDataTable* m_passiveGeneratorsDataTable; // 0x208
	UDataTable* m_activityDataTable; // 0x210
	UDataTable* m_gameModesUIDataTable; // 0x218
	UDataTable* m_inboxMessagesDataTable; // 0x220
	UDataTable* m_grantsDataTable; // 0x228
	UDataTable* m_entitlementsDataTable; // 0x230
	UDataTable* m_weaponVanityDataTable; // 0x238
	TArray<UDataTable*> m_missionDataTables; // 0x240
	UDataTable* m_onboardingDataTable; // 0x250
	UDataTable* m_blockFeatureDueToOnboardingDataTable; // 0x258
	UDataTable* m_vehicleDataTable; // 0x260
	UDataTable* m_rebindableInputActionsDataTable; // 0x268
	UDataTable* m_materialDataTable; // 0x270
	UDataTable* m_materialGameDataTable; // 0x278
	UDataTable* m_metaSettingsDataTable; // 0x280
	UDataTable* m_modSettingsDataTable; // 0x288
	UDataTable* m_promotionsDataTable; // 0x290
	UDataTable* m_globalVanityDefaultsDataTable; // 0x298
	UDataTable* m_bannerDataTable; // 0x2a0
	UDataTable* m_deathEmoteDataTable; // 0x2a8
	UDataTable* m_normalEmotesDataTable; // 0x2b0
	UDataTable* m_defaultConfigurationDataTable; // 0x2b8
	UDataTable* m_popupWidgetsDataTable; // 0x2c0
	UDataTable* m_mapsInfosDataTable; // 0x2c8
	UDataTable* m_vehicleVanityDataTable; // 0x2d0
	UDataTable* m_droppodDataTable; // 0x2d8
	UDataTable* m_defaultFeatureTogglesTable; // 0x2e0
	UDataTable* m_chatSettingsDataTable; // 0x2e8
	UDataTable* m_developerCreditsDataTable; // 0x2f0
	UDataTable* m_awarenessNotificationDataTable; // 0x2f8
	UDataTable* m_playerAwarenessTuningDataTable; // 0x300
	UDataTable* m_statsSettingsDataTable; // 0x308
	UDataTable* m_upgradeDataTable; // 0x310
	UDataTable* m_npcDataTable; // 0x318
	UDataTable* m_npcCharacterArchetypeDatable; // 0x320
	UDataTable* m_npcCharacterArchetypeDatatableSets; // 0x328
	UDataTable* m_npcCharacterArchetypeDatatableItems; // 0x330
	UDataTable* m_socialProfilesDataTable; // 0x338
	UDataTable* m_prospectorLevelProgressionDataTable; // 0x340
	UDataTable* m_prospectorLevelRewardDataTable; // 0x348
	UDataTable* m_sprayVanityDataTable; // 0x350
	UDataTable* m_weaponCharmVanityDataTable; // 0x358
	UDataTable* m_petDataTable; // 0x360
	UDataTable* m_aiTuning; // 0x368
	UDataTable* m_aiSenseTriggerDataTable; // 0x370
	UDataTable* m_statKeysDataTable; // 0x378
	UDataTable* m_playerTuningDataTable; // 0x380
	UDataTable* m_lootTuningDataTable; // 0x388
	UDataTable* m_rarityDataTable; // 0x390
	UDataTable* m_characterCustomizationItemsDataTable; // 0x398
	UDataTable* m_explicitCustomizationDataTable; // 0x3a0
	UDataTable* m_characterCustomizationSetDataTable; // 0x3a8
	UDataTable* m_effortDataTable; // 0x3b0
	UDataTable* m_inventoryInsurancesDataTable; // 0x3b8
	UDataTable* m_bundlesDataTable; // 0x3c0
	UDataTable* m_bundlesPlatformDataTable; // 0x3c8
};

struct FCachedAnimStateArray {
	TArray<FCachedAnimStateData> States; // 0x0
};

struct FPOV {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x18
};

struct FNameCurve : FIndexedCurve {
	TArray<FNameCurveKey> Keys; // 0x68
};

struct FAdminGetTaskInstanceRequest : FPlayFabRequestCommon {
	FString TaskInstanceId; // 0x8
};

struct FClientLinkOpenIdConnectRequest : FPlayFabRequestCommon {
	FString ConnectionId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	bool ForceLink; // 0x20
	FString IdToken; // 0x28
};

struct FRigUnit_GetRelativeBoneTransform : FRigUnit {
	FName Bone; // 0x8
	FName Space; // 0x10
	FTransform Transform; // 0x20
	FCachedRigElement CachedBone; // 0x50
	FCachedRigElement CachedSpace; // 0x64
};

struct FAdminGetAllSegmentsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Segments; // 0x8
};

struct FMovieSceneFadeSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneFloatChannel FadeCurve; // 0x20
	FLinearColor FadeColor; // 0xc0
	char bFadeAudio : 1; // 0xd0
};

struct FMovieSceneSegmentIdentifier {
	int32_t IdentifierIndex; // 0x0
};

struct FHorizonTweenEventSceneComponentMoveSplinePathParameters : FHorizonTweenEventSplinePathParameters {
	TWeakObjectPtr<USceneComponent> TweenTargetWeakPtr; // 0x138
};

struct FYAbilityAnalyticsEvent : FYBaseAnalyticsEvent {
	FName ability_id; // 0xa8
	FString ability_name; // 0xb0
	int32_t ability_pickup_time; // 0xc0
	int32_t ability_pickup_user_time; // 0xc4
	int32_t ability_use_time; // 0xc8
	int32_t ability_use_user_time; // 0xcc
	int32_t location_x; // 0xd0
	int32_t location_y; // 0xd4
	int32_t location_z; // 0xd8
};

struct FYAimTargetInfo {
	AActor* m_targetActor; // 0x0
	FVector m_targetLocation; // 0x8
};

struct FClientOpenTradeResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Trade; // 0x8
};

struct FYModItems {
	TArray<int32_t> M; // 0x0
};

struct FYQuestsUpdatedMessage {
	FString UserId; // 0x0
	TArray<FYQuestState> quests; // 0x10
};

struct FClientLoginWithFacebookRequest : FPlayFabRequestCommon {
	FString AccessToken; // 0x8
	bool CreateAccount; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x20
	FString EncryptedRequest; // 0x28
	UPlayFabJsonObject* InfoRequestParameters; // 0x38
	FString PlayerSecret; // 0x40
};

struct FYAIRangedAttackMontageDefinition {
	FText m_attackName; // 0x0
	TSoftObjectPtr<UAnimMontage> m_animMontageToPlay; // 0x18
};

struct FRigUnit_ChainHarmonics_Reach {
	bool bEnabled; // 0x0
	FVector ReachTarget; // 0x4
	FVector ReachAxis; // 0x10
	float ReachMinimum; // 0x1c
	float ReachMaximum; // 0x20
	EControlRigAnimEasingType ReachEase; // 0x24
};

struct FYCarrouselData {
	TSoftObjectPtr<UTexture2D> m_texture; // 0x0
	FText m_headline; // 0x28
};

struct FWheelSetup {
	UVehicleWheel* WheelClass; // 0x0
	FName BoneName; // 0x8
	FVector AdditionalOffset; // 0x10
	bool bDisableSteering; // 0x1c
};

struct FYResourceSpawnActorRequest {
	TSoftClassPtr<UObject> m_actorClass; // 0x0
	FTransform m_transform; // 0x30
	AActor* m_owner; // 0x60
	FYInventoryItem m_inventoryItem; // 0x68
	TArray<FDataTableRowHandle> m_rowHandles; // 0x100
	UObject* m_specificClass; // 0x110
};

struct FInterpCurveFloat {
	TArray<FInterpCurvePointFloat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FTTVectorTrack : FTTPropertyTrack {
	UCurveVector* CurveVector; // 0x20
};

struct FMovieSceneVector2DKeyStruct : FMovieSceneVectorKeyStructBase {
	FVector2D Vector; // 0x28
};

struct FControlRigDrawContainer {
	TArray<FControlRigDrawInstruction> Instructions; // 0x8
};

struct FYDebugRemoveAllMaterialsFromPlayerResponse {
	FString UserId; // 0x0
	FString Error; // 0x10
	TArray<FYCustomItemInfo> returnedMaterials; // 0x20
};

struct FRigUnit_MathTransformMakeRelative : FRigUnit_MathTransformBase {
	FTransform Global; // 0x10
	FTransform Parent; // 0x40
	FTransform Local; // 0x70
};

struct FNiagaraGraphViewSettings {
	FVector2D Location; // 0x0
	float zoom; // 0x8
	bool bIsValid; // 0xc
};

struct FServerGetTimeResult : FPlayFabResultCommon {
	FString Time; // 0x8
};

struct FDatasmithReimportOptions {
	bool bUpdateActors; // 0x0
	bool bRespawnDeletedActors; // 0x1
};

struct FYCraftedBlueprintInfo {
	FName blueprintName; // 0x0
	FString shopItemBelongsTo; // 0x8
	int32_t itemRarity; // 0x18
	FString itemBackendId; // 0x20
	FString baseItemId; // 0x30
	int32_t purchaseAmount; // 0x40
};

struct FTireConfigMaterialFriction {
	UPhysicalMaterial* PhysicalMaterial; // 0x0
	float FrictionScale; // 0x8
};

struct FSourceEffectStereoDelaySettings {
	EStereoDelaySourceEffect DelayMode; // 0x0
	float DelayTimeMsec; // 0x4
	float Feedback; // 0x8
	float DelayRatio; // 0xc
	float WetLevel; // 0x10
	float DryLevel; // 0x14
	bool bFilterEnabled; // 0x18
	EStereoDelayFiltertype FilterType; // 0x19
	float FilterFrequency; // 0x1c
	float FilterQ; // 0x20
};

struct FYForceStartResponse {
	EYForceStartResult Error; // 0x0
};

struct FYClaimGeneratorIncomeResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	FString generatorId; // 0x20
	int32_t claimedAmount; // 0x30
	TArray<FYCurrencyItem> grantedCurrencies; // 0x38
	TArray<FYCurrencyItem> changedCurrenciesBalances; // 0x48
	TArray<FYCustomItemInfo> changedItems; // 0x58
	TArray<FYCustomItemInfo> changedMaterialsBalances; // 0x68
	TArray<FYCustomItemInfo> GrantedItems; // 0x78
	FYTimestamp lastClaimTime; // 0x88
	EYClaimGeneratorIncomeStatus Status; // 0x90
};

struct FAimTarget {
	float weight; // 0x0
	FTransform Transform; // 0x10
	FVector AlignVector; // 0x40
};

struct FVector4Distribution {
	FDistributionLookupTable Table; // 0x0
};

struct FLastLocationGatherInfo {
	UNetConnection* Connection; // 0x0
	FVector LastLocation; // 0x8
	FVector LastOutOfRangeLocationCheck; // 0x14
};

struct FDestructibleDebrisParameters {
	float DebrisLifetimeMin; // 0x0
	float DebrisLifetimeMax; // 0x4
	float DebrisMaxSeparationMin; // 0x8
	float DebrisMaxSeparationMax; // 0xc
	FBox ValidBounds; // 0x10
};

struct FYUplinkActivityStats : FYBaseActivityStats {
	int32_t time_since_user_joined; // 0xb8
	int32_t last_state; // 0xbc
	FString item_rarity; // 0xc0
	FString uplink_name; // 0xd0
};

struct FRigUnit_TwoBoneIKSimpleVectors : FRigUnit_HighlevelBase {
	FVector Root; // 0x8
	FVector PoleVector; // 0x14
	FVector Effector; // 0x20
	bool bEnableStretch; // 0x2c
	float StretchStartRatio; // 0x30
	float StretchMaximumRatio; // 0x34
	float BoneALength; // 0x38
	float BoneBLength; // 0x3c
	FVector Elbow; // 0x40
};

struct FYDebugResetPlayerRequest {
	FString UserId; // 0x0
};

struct FYStationServerCommandResult {
	EYStationCommandResultType Result; // 0x0
	FString Context; // 0x8
};

struct FRigUnit_DeltaFromPreviousFloat : FRigUnit_SimBase {
	float Value; // 0x8
	float Delta; // 0xc
	float PreviousValue; // 0x10
	float Cache; // 0x14
};

struct FClientGrantCharacterToUserRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	FString CharacterName; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
	FString ItemId; // 0x30
};

struct FInAppPurchaseProductRequest2 {
	FString ProductIdentifier; // 0x0
	bool bIsConsumable; // 0x10
};

struct FHorizonTweenEventWidgetRotatorFromToParameters : FHorizonTweenEventFloatParameters {
	TWeakObjectPtr<UWidget> TweenTargetWeakPtr; // 0xb0
	bool bShortestPath; // 0xb8
};

struct FHipAdjustment {
	FBoneReference Hips; // 0x0
	float AdjustmentRatio; // 0x10
	float MaxRecoveryRate; // 0x14
};

struct FClientValidateIOSReceiptRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	FString CurrencyCode; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
	int32_t PurchasePrice; // 0x30
	FString ReceiptData; // 0x38
};

struct FPrefabricatorPropertyAssetMapping {
	FSoftObjectPath AssetReference; // 0x0
	FString AssetClassName; // 0x18
	FName AssetObjectPath; // 0x28
	bool bUseQuotes; // 0x30
};

struct FYStatsTypeDataEntry {
	EYItemStatsType m_type; // 0x0
	FText m_name; // 0x8
	float m_baseValue; // 0x20
	float m_modifiedValue; // 0x24
	float m_difference; // 0x28
};

struct FMovieSceneVectorKeyStructBase : FMovieSceneKeyStruct {
	FFrameNumber Time; // 0x8
};

struct FYPlayFabSquad {
	FString squadId; // 0x0
	TArray<FYPlayFabSquadMember> Members; // 0x10
};

struct FRichTextStyleRow : FTableRowBase {
	FTextBlockStyle TextStyle; // 0x8
};

struct FSubmixEffectStereoDelaySettings {
	EStereoDelaySourceEffect DelayMode; // 0x0
	float DelayTimeMsec; // 0x4
	float Feedback; // 0x8
	float DelayRatio; // 0xc
	float WetLevel; // 0x10
	float DryLevel; // 0x14
	bool bFilterEnabled; // 0x18
	EStereoDelayFiltertype FilterType; // 0x19
	float FilterFrequency; // 0x1c
	float FilterQ; // 0x20
};

struct FTrackToSkeletonMap {
	int32_t BoneTreeIndex; // 0x0
};

struct FPaperSpriteAtlasSlot {
	TSoftObjectPtr<UPaperSprite> SpriteRef; // 0x0
	int32_t AtlasIndex; // 0x28
	int32_t X; // 0x2c
	int32_t Y; // 0x30
	int32_t Width; // 0x34
	int32_t Height; // 0x38
};

struct FYGetUsersDataByUserIdsRequest {
	TArray<FString> userIds; // 0x0
};

struct FYPlayerRankedGamemodeData {
	FString GameMode; // 0x0
	int32_t rank; // 0x10
	int32_t highestRank; // 0x14
};

struct FNiagaraEventReceiverProperties {
	FName Name; // 0x0
	FName SourceEventGenerator; // 0x8
	FName SourceEmitter; // 0x10
};

struct FMovieSceneActorReferenceData : FMovieSceneChannel {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneActorReferenceKey> KeyValues; // 0x40
};

struct FYBundleDataTableRowBase : FYDataTableRowBase {
	bool m_isEntitlement; // 0x10
	FYStoreItemData m_storeData; // 0x18
	TArray<FYPlatformStoreEntry> m_platformStoresData; // 0x80
	TArray<FYBundleEntry> m_itemCollection; // 0x90
};

struct FYDebugSocialNotification {
	FString UserId; // 0x0
	int32_t Type; // 0x10
};

struct FRigUnit_Clamp_Float : FRigUnit {
	float Value; // 0x8
	float Min; // 0xc
	float Max; // 0x10
	float Result; // 0x14
};

struct FYWhisper {
	FString from; // 0x0
	FString Msg; // 0x10
	FString to; // 0x20
};

struct FAnimNode_AnimDynamics : FAnimNode_SkeletalControlBase {
	float LinearDampingOverride; // 0xc8
	float AngularDampingOverride; // 0xcc
	FBoneReference RelativeSpaceBone; // 0x130
	FBoneReference BoundBone; // 0x140
	FBoneReference ChainEnd; // 0x150
	FVector BoxExtents; // 0x160
	FVector LocalJointOffset; // 0x16c
	float GravityScale; // 0x178
	FVector GravityOverride; // 0x17c
	float LinearSpringConstant; // 0x188
	float AngularSpringConstant; // 0x18c
	float WindScale; // 0x190
	FVector ComponentLinearAccScale; // 0x194
	FVector ComponentLinearVelScale; // 0x1a0
	FVector ComponentAppliedLinearAccClamp; // 0x1ac
	float AngularBiasOverride; // 0x1b8
	int32_t NumSolverIterationsPreUpdate; // 0x1bc
	int32_t NumSolverIterationsPostUpdate; // 0x1c0
	FAnimPhysConstraintSetup ConstraintSetup; // 0x1c4
	TArray<FAnimPhysSphericalLimit> SphericalLimits; // 0x210
	float SphereCollisionRadius; // 0x220
	FVector ExternalForce; // 0x224
	TArray<FAnimPhysPlanarLimit> PlanarLimits; // 0x230
	AnimPhysCollisionType CollisionType; // 0x240
	AnimPhysSimSpaceType SimulationSpace; // 0x241
	char bUseSphericalLimits : 1; // 0x244
	char bUsePlanarLimit : 1; // 0x244
	char bDoUpdate : 1; // 0x244
	char bDoEval : 1; // 0x244
	char bOverrideLinearDamping : 1; // 0x244
	char bOverrideAngularBias : 1; // 0x244
	char bOverrideAngularDamping : 1; // 0x244
	char bEnableWind : 1; // 0x244
	char bUseGravityOverride : 1; // 0x245
	char bLinearSpring : 1; // 0x245
	char bAngularSpring : 1; // 0x245
	char bChain : 1; // 0x245
	FRotationRetargetingInfo RetargetingSettings; // 0x250
};

struct FYTimeInDebugMenus : FYBaseAnalyticsEvent {
	float Time; // 0xa8
};

struct FYStatusEffectRuntimeData {
	float m_damagePerTick; // 0x0
	float m_damageTickFrequency; // 0x4
	FYDamageOriginInfo m_damageOriginInfo; // 0x8
	float m_lastDamageTickTimestamp; // 0x30
	TArray<TWeakObjectPtr<AActor>> m_actors; // 0x38
	TArray<FGuid> m_perkGuids; // 0x48
};

struct FRigVMMemoryStatistics {
	uint32_t RegisterCount; // 0x0
	uint32_t DataBytes; // 0x4
	uint32_t TotalBytes; // 0x8
};

struct FYUpdateCustomItemsRequest {
	FString UserId; // 0x0
	TArray<FYCustomItemInfo> itemsToUpdate; // 0x10
};

struct FYMissionState {
	FString missionId; // 0x0
	FString missionArcId; // 0x10
	int32_t Count; // 0x20
	bool Completed; // 0x24
	bool IsActive; // 0x25
	bool acknowledged; // 0x26
	bool receivedReward; // 0x27
};

struct FRigUnit_MathVectorSelectBool : FRigUnit_MathVectorBase {
	bool Condition; // 0x8
	FVector IfTrue; // 0xc
	FVector IfFalse; // 0x18
	FVector Result; // 0x24
};

struct FRigUnit_SetControlBool : FRigUnitMutable {
	FName Control; // 0x68
	bool BoolValue; // 0x70
	FCachedRigElement CachedControlIndex; // 0x74
};

struct FBoneChain {
	TArray<FBoneChainLink> BoneChain; // 0x0
};

struct FYSendAnnouncement {
	FString Msg; // 0x0
};

struct FClientCurrentGamesRequest : FPlayFabRequestCommon {
	FString BuildVersion; // 0x8
	FString GameMode; // 0x18
	ERegion Region; // 0x28
	FString StatisticName; // 0x30
	UPlayFabJsonObject* TagFilter; // 0x40
};

struct FYAnalyticsHardwareStats : FYBaseAnalyticsEvent {
	FString graphic_device_name; // 0xa8
	FString graphic_device_driver_version; // 0xb8
	FString graphic_device_vendor; // 0xc8
	FString graphic_device_id; // 0xd8
	int32_t graphic_memory_size; // 0xe8
	int32_t graphic_memory_size_dedicated; // 0xec
	int32_t graphic_memory_size_shared; // 0xf0
	FString directx_feature_level; // 0xf8
	FString cpu_name; // 0x108
	int32_t cpu_model; // 0x118
	int32_t map_loading_time; // 0x11c
	int32_t cpu_stepping; // 0x120
	int32_t cpu_processor_frequency; // 0x124
	int32_t cpu_processor_count; // 0x128
	int32_t cpu_processor_real_count; // 0x12c
	int32_t cpu_processor_virtual_count; // 0x130
	int32_t system_memory_size; // 0x134
	FString system_memory_type; // 0x138
	FString os_name; // 0x148
	FString os_version; // 0x158
	FString hard_drive_type; // 0x168
	FString machine_name; // 0x178
};

struct FYContractsBoardsSettingsRow : FYDataTableRowBase {
	int32_t m_refreshHours24Utc; // 0x10
};

struct FCloudScriptRegisterQueuedFunctionRequest : FPlayFabRequestCommon {
	FString ConnectionString; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString FunctionName; // 0x20
	FString QueueName; // 0x30
};

struct FYGetOwnedCharacterArchetypesRequest {
	FString UserId; // 0x0
	TArray<FString> archetypeIds; // 0x10
};

struct FYPollMatchmakingStateResult {
	EYPlayfabMatchmakingState m_state; // 0x0
	FString m_matchmakingTicket; // 0x8
	FString m_matchTicket; // 0x18
};

struct FYFeatureToggles : FYDataTableRowBase {
	bool m_playerReplicationgClientSpawnDependency; // 0x10
	bool m_shouldServerRunClientFireRPCValidation; // 0x11
	bool m_isPactEnabledInRankedMode; // 0x12
	bool m_isPactEnabledInNonRankedMode; // 0x13
	bool m_chatEnabled; // 0x14
	bool m_voiceChatEnabled; // 0x15
	bool m_capsuleHitBoxesEnabled; // 0x16
	bool m_autoRequeueingEnabled; // 0x17
	bool m_useIdleDetection; // 0x18
	bool m_isInternalFriendsSystemEnabled; // 0x19
	bool m_enableSixthSenseWarning; // 0x1a
	bool m_enableSixthSenseWarningInRanked; // 0x1b
	bool m_glickoRatingEnabled; // 0x1c
	bool m_friendHandlingEnabled; // 0x1d
	bool m_enableColorBlindOptions; // 0x1e
	bool m_ledgeClimbingSystemEnabled; // 0x1f
	bool m_playerBuffsEnabled; // 0x20
	bool m_automaticImportPlatformFriends; // 0x21
	bool m_eosStatsEnabled; // 0x22
	bool m_canScrapWeapons; // 0x23
	bool m_canCraftWeapons; // 0x24
	bool m_shouldTraceServerRequests; // 0x25
	bool m_shouldTraceClientRequests; // 0x26
	bool m_isModFunctionalityEnabled; // 0x27
	bool m_useLootRandomSeedingLoot; // 0x28
	bool m_enableBugReporter; // 0x29
	bool m_requireOwnedModCrafting; // 0x2a
	bool m_allowMovingItemToBagOverWeightLimit; // 0x2b
	bool m_isProneEnabled; // 0x2c
	bool m_isLeaningEnabled; // 0x2d
	bool m_isSprintDashEnabled; // 0x2e
	bool m_isAccountLinkingEnabled; // 0x2f
	bool m_isFriendsImportEnabled; // 0x30
	bool m_showMatchMapsSelector; // 0x31
	bool m_newMeleeSystemEnabled; // 0x32
	bool m_enableEffortsComponent; // 0x33
	bool m_squadsEnabled; // 0x34
	bool m_socialEnabled; // 0x35
	bool m_sessionServerShutdownEnabled; // 0x36
	bool m_multiplayerStationEnabled; // 0x37
	bool m_replicationGraphEnabled; // 0x38
	bool m_multiRegionEnabled; // 0x39
	bool m_lootCollisionTraceEnabled; // 0x3a
	bool m_splitSoloAndSquadMatches; // 0x3b
	bool m_enableDeployTravelLoadingIndicator; // 0x3c
	bool m_isOnboardingEnabled; // 0x3d
	bool m_isPremiumShopEnabled; // 0x3e
	bool m_timeSliceWeaponAssetLoading; // 0x3f
	bool m_isTutorialEnabled; // 0x40
	bool m_isBiEnabledOldPipeline; // 0x41
	bool m_isBiEnabledNewPipeline; // 0x42
	bool m_flushLevelStreaming; // 0x43
	bool m_playfabCouponsEnabled; // 0x44
	bool m_useMGetForMatchmakingServerDetails; // 0x45
};

struct FPerBoneInterpolation {
	FBoneReference BoneReference; // 0x0
	float InterpolationSpeedPerSec; // 0x10
};

struct FYActivateContractRequest {
	FString UserId; // 0x0
	FString contractId; // 0x10
};

struct FServerGetLeaderboardAroundCharacterResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Leaderboard; // 0x8
};

struct FHeaderRowStyle : FSlateWidgetStyle {
	FTableColumnHeaderStyle ColumnStyle; // 0x8
	FTableColumnHeaderStyle LastColumnStyle; // 0x4d8
	FSplitterStyle ColumnSplitterStyle; // 0x9a8
	FSlateBrush BackgroundBrush; // 0xac0
	FSlateColor ForegroundColor; // 0xb48
};

struct FYPlayerMeleeData {
	float m_attackDuration; // 0x0
	float m_meleeAttackStrikeTime; // 0x4
	FDataTableRowHandle m_meleeTransportHandle; // 0x8
	EYGameplayContextType m_damageContextType; // 0x18
};

struct FCachedAnimRelevancyData {
	FName StateMachineName; // 0x0
	FName StateName; // 0x8
};

struct FMovieSceneAudioSectionTemplate : FMovieSceneEvalTemplate {
	UMovieSceneAudioSection* AudioSection; // 0x20
};

struct FYAITuningCallReinforcementsRow : FTableRowBase {
	float m_callReinforcementRadius; // 0x8
	FDataTableRowHandle m_callReinforcementDatatableRowName; // 0x10
	int32_t m_callReinforcementOnAllyCount; // 0x20
	float m_callReinforcementInterrupDamage; // 0x24
	float m_callReinforcementInterrupTime; // 0x28
	float m_callReinforcementCooldown; // 0x2c
	int32_t m_callReinforcementMaxCount; // 0x30
	int32_t m_callReinforcementWaves; // 0x34
};

struct FSpriteInstanceData {
	FMatrix Transform; // 0x0
	UPaperSprite* SourceSprite; // 0x40
	FColor VertexColor; // 0x48
	int32_t MaterialIndex; // 0x4c
};

struct FServerGrantItemsToUserResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> ItemGrantResults; // 0x8
};

struct FBoneFilter {
	bool bExcludeSelf; // 0x0
	FName BoneName; // 0x4
};

struct FAnimPhysSphericalLimit {
	FBoneReference DrivingBone; // 0x0
	FVector SphereLocalOffset; // 0x10
	float LimitRadius; // 0x1c
	ESphericalLimitType LimitType; // 0x20
};

struct FYRecentPlayedEntry {
	FYPlatformEntry m_platformEntry; // 0x0
	FYOutpostFriendInfo m_friendInfo; // 0x18
	int64_t m_timeRegistered; // 0x98
	bool m_friendInfoPending; // 0xa0
	bool m_isDebugEntry; // 0xa1
};

struct FYFriendActionUserName {
	FString desiredUserName; // 0x0
	FYFriendAction friendAction; // 0x10
};

struct FYOutpostFriendInfo {
	FString m_userId; // 0x0
	FYPlatformEntry m_platformEntry; // 0x10
	FString m_playerName; // 0x28
	EYFriendOnlineStatus m_onlineStatus; // 0x38
	EYUserState m_memberState; // 0x39
	EYFriendState m_friendState; // 0x3a
	int32_t m_squadSize; // 0x3c
	bool m_isInLocalPlayerSquad; // 0x40
	FDataTableRowHandle m_socialProfileRow; // 0x48
	FYUserMatchmakingSettings m_matchmakingSettings; // 0x58
};

struct FYShopItem {
	FDataTableRowHandle m_blueprintHandle; // 0x0
	EYItemRarityType m_itemRarity; // 0x10
	FString m_shopItemBelongsTo; // 0x18
};

struct FYItemSetUIData {
	FText m_name; // 0x0
	FText m_description; // 0x18
	FText m_flavorDescription; // 0x30
	TSoftObjectPtr<UTexture2D> m_largeIcon; // 0x48
	TSoftObjectPtr<UTexture2D> m_smallIcon; // 0x70
};

struct FBlueprintComponentChangedPropertyInfo {
	FName PropertyName; // 0x0
	int32_t ArrayIndex; // 0x8
	UStruct* PropertyScope; // 0x10
};

struct FYGetGlobalVanity {
	FString UserId; // 0x0
};

struct FYPlayerUIHealthBarDeltaSettingsDetails {
	float m_deltaAdjustmentSpeed; // 0x0
	float m_deltaAdjustmentInitialDelay; // 0x4
	int32_t m_segmentSize; // 0x8
};

struct FMovieSceneFloatChannel : FMovieSceneChannel {
	ERichCurveExtrapolation PreInfinityExtrap; // 0x8
	ERichCurveExtrapolation PostInfinityExtrap; // 0x9
	TArray<FFrameNumber> Times; // 0x10
	TArray<FMovieSceneFloatValue> Values; // 0x20
	float DefaultValue; // 0x30
	bool bHasDefaultValue; // 0x34
	FMovieSceneKeyHandleMap KeyHandles; // 0x38
	FFrameRate TickResolution; // 0x98
};

struct FYGameModeUIData : FYDataTableRowBase {
	EYMatchmakeGameModeType m_matchmakingGameModeType; // 0x10
	bool m_isRanked; // 0x11
	bool m_isTournamentMode; // 0x12
	FText m_gameModeName; // 0x18
	FText m_gameModeDescription; // 0x30
	TSoftObjectPtr<UTexture2D> m_gameModeIcon; // 0x48
	TSoftObjectPtr<UTexture2D> m_gameModeImage; // 0x70
	TSoftObjectPtr<UTexture2D> m_gameModeBackgroundImage; // 0x98
	TSoftObjectPtr<UTexture2D> m_gameModeSelectedBackgroundImageOverride; // 0xc0
	TSoftObjectPtr<UTexture2D> m_gameModeHoverBackgroundImageOverride; // 0xe8
};

struct FRigUnit_ToWorldSpace_Rotation : FRigUnit {
	FQuat Rotation; // 0x10
	FQuat World; // 0x20
};

struct FMovieSceneTrackEvaluationField {
	TArray<FMovieSceneTrackEvaluationFieldEntry> entries; // 0x0
};

struct FYDebugGiveProspectorLevelXP {
	int32_t xpIncrement; // 0x0
};

struct FYWeaponAnimationData {
	UAnimMontage* m_weaponAnimation; // 0x0
	UAnimMontage* m_weaponAnimationThirdPerson; // 0x8
	UAnimMontage* m_playerAnimationFirstPerson; // 0x10
	UAnimMontage* m_playerAnimationThirdPerson; // 0x18
	float m_desiredTuningPlayDuration; // 0x20
	float m_animationRateScaleOverride; // 0x24
};

struct FMediaSoundComponentSpectralData {
	float FrequencyHz; // 0x0
	float Magnitude; // 0x4
};

struct FAnimNode_BlendListByInt : FAnimNode_BlendListBase {
	int32_t ActiveChildIndex; // 0x98
};

struct FServerRegisterGameResponse : FPlayFabResultCommon {
	FString LobbyId; // 0x8
};

struct FControlRigSettingsPerPinBool {
	TMap<FString, bool> Values; // 0x0
};

struct FPointWeightMap {
	TArray<float> Values; // 0x0
};

struct FAdminCreateCloudScriptTaskRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Description; // 0x10
	bool IsActive; // 0x20
	FString Name; // 0x28
	UPlayFabJsonObject* Parameter; // 0x38
	FString Schedule; // 0x40
};

struct FYWeaponFireDelayStateData {
	float m_fireDelay; // 0x0
	EYPlayerStateBlueprint m_playerState; // 0x4
	EYGameplayAttribute m_gameplayAttribute; // 0x5
};

struct FYTotalGainedCurrencyData {
	int32_t m_startAmount; // 0x0
	EYCurrencyType m_currencyType; // 0x4
	int32_t m_endAmount; // 0x8
	TArray<FYRewardEntry> m_perEntryReward; // 0x10
};

struct FAdminGetCatalogItemsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Catalog; // 0x8
};

struct FVMFunctionSpecifier {
	FName Key; // 0x0
	FName Value; // 0x8
};

struct FWaterBrushEffectBlurring {
	bool bBlurShape; // 0x0
	int32_t Radius; // 0x4
};

struct FYAISquadSpawnDefinition {
	FVector m_spawnLocation; // 0x0
	TArray<FTransform> m_subSpawnLocations; // 0x10
	FVector m_roamingLocationOverride; // 0x20
	float m_roamingRadiusOverride; // 0x2c
	FRotator m_spawnRotationOverride; // 0x30
	bool m_purgeSquadOnceNoPlayerClose; // 0x3c
	FString m_spawnContextString; // 0x40
	AActor* m_spawnContextActor; // 0x50
	FGameplayTagContainer m_gameplayTags; // 0x58
};

struct FParticleBurst {
	int32_t Count; // 0x0
	int32_t CountLow; // 0x4
	float Time; // 0x8
};

struct FMaterialLayersFunctions {
	TArray<UMaterialFunctionInterface*> Layers; // 0x0
	TArray<UMaterialFunctionInterface*> Blends; // 0x10
	TArray<bool> LayerStates; // 0x20
	FString KeyString; // 0x30
};

struct FYAddFriendResult {
	FString UserId; // 0x0
	FString OperationId; // 0x10
	EYFriendActionResult Result; // 0x20
};

struct FKSphereElem : FKShapeElem {
	FVector Center; // 0x30
	float Radius; // 0x3c
};

struct FRadialDamageEvent : FDamageEvent {
	FRadialDamageParams Params; // 0x10
	FVector Origin; // 0x24
	TArray<FHitResult> ComponentHits; // 0x30
};

struct FAnimNode_CurveSource : FAnimNode_Base {
	FPoseLink SourcePose; // 0x10
	FName SourceBinding; // 0x20
	float Alpha; // 0x28
	TScriptInterface<ICurveSourceInterface> CurveSource; // 0x30
};

struct FNiagaraVariant {
	UObject* Object; // 0x0
	UNiagaraDataInterface* DataInterface; // 0x8
	TArray<char> Bytes; // 0x10
	ENiagaraVariantMode CurrentMode; // 0x20
};

struct FYDamageCauserInfo {
	FName m_damageCauserId; // 0x0
	FDataTableRowHandle m_damageInfoCauserRowHandle; // 0x8
	bool m_isPlayer; // 0x18
};

struct FAnimNode_PoseHandler : FAnimNode_AssetPlayerBase {
	UPoseAsset* PoseAsset; // 0x38
};

struct FYAbilityDataTableRow : FYWeaponDataTableBase {
	FText m_abilityName; // 0xa48
	FYAbilityActionEntry m_abilityAction; // 0xa60
	bool m_overrideLeftHand; // 0xa78
	TSoftClassPtr<UObject> m_statsWidget; // 0xa80
};

struct FYUpgradeRow : FYBaseModRow {
	TMap<EYItemRarityType, FYRaritySettingsEntry> m_raritySettings; // 0x370
	FYDataTableRowBase m_modTuningDataTableRow; // 0x3c0
};

struct FAnimNode_LinkedAnimGraph : FAnimNode_CustomProperty {
	TArray<FPoseLink> InputPoses; // 0x58
	TArray<FName> InputPoseNames; // 0x68
	UAnimInstance* InstanceClass; // 0x78
	FName Tag; // 0x80
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x9c
	char bPropagateNotifiesToLinkedInstances : 1; // 0x9c
};

struct FYDebugUpdateGlobalVanityData {
	FString UserId; // 0x0
	FString ID; // 0x10
	int32_t variation; // 0x20
};

struct FYInviteToSquad {
	FString fromId; // 0x0
	FString TargetId; // 0x10
};

struct FServerSendEmailFromTemplateRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString EmailTemplateId; // 0x10
	FString PlayFabId; // 0x20
};

struct FRigUnit_GetControlRotator : FRigUnit {
	FName Control; // 0x8
	EBoneGetterSetterMode Space; // 0x10
	FRotator Rotator; // 0x14
	FRotator Minimum; // 0x20
	FRotator Maximum; // 0x2c
	FCachedRigElement CachedControlIndex; // 0x38
};

struct FNiagaraFunctionSignature {
	FName Name; // 0x0
	TArray<FNiagaraVariable> Inputs; // 0x8
	TArray<FNiagaraVariable> Outputs; // 0x18
	FName OwnerName; // 0x28
	char bRequiresContext : 1; // 0x30
	char bRequiresExecPin : 1; // 0x30
	char bMemberFunction : 1; // 0x30
	char bExperimental : 1; // 0x30
	char bSupportsCPU : 1; // 0x30
	char bSupportsGPU : 1; // 0x30
	char bWriteFunction : 1; // 0x30
	char bSoftDeprecatedFunction : 1; // 0x30
	int32_t ModuleUsageBitmask; // 0x34
	int32_t ContextStageMinIndex; // 0x38
	int32_t ContextStageMaxIndex; // 0x3c
	TMap<FName, FName> FunctionSpecifiers; // 0x40
};

struct FAnimNode_TransitionPoseEvaluator : FAnimNode_Base {
	int32_t FramesToCachePose; // 0xe8
	EEvaluatorDataSource DataSource; // 0xf0
	EEvaluatorMode EvaluatorMode; // 0xf1
};

struct FInstancedStaticMeshComponentInstanceData : FSceneComponentInstanceData {
	UStaticMesh* StaticMesh; // 0xb8
	FInstancedStaticMeshLightMapInstanceData CachedStaticLighting; // 0xc0
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x100
	TArray<float> PerInstanceSMCustomData; // 0x110
	int32_t InstancingRandomSeed; // 0x140
};

struct FAITouchEvent {
	AActor* TouchReceiver; // 0x10
	AActor* OtherActor; // 0x18
};

struct FSearchBoxStyle : FSlateWidgetStyle {
	FEditableTextBoxStyle TextBoxStyle; // 0x8
	FSlateFontInfo ActiveFontInfo; // 0x800
	FSlateBrush UpArrowImage; // 0x858
	FSlateBrush DownArrowImage; // 0x8e0
	FSlateBrush GlassImage; // 0x968
	FSlateBrush ClearImage; // 0x9f0
	FMargin ImagePadding; // 0xa78
	bool bLeftAlignButtons; // 0xa88
};

struct FYSetAllowJoinRequest {
	FString SessionId; // 0x0
	bool allowJoin; // 0x10
};

struct FAIRequestID {
	uint32_t RequestID; // 0x0
};

struct FNavCollisionBox {
	FVector Offset; // 0x0
	FVector Extent; // 0xc
};

struct FClientPayForPurchaseResult : FPlayFabResultCommon {
	int32_t CreditApplied; // 0x8
	FString OrderId; // 0x10
	FString ProviderData; // 0x20
	FString ProviderToken; // 0x30
	FString PurchaseConfirmationPageURL; // 0x40
	FString PurchaseCurrency; // 0x50
	int32_t PurchasePrice; // 0x60
	ETransactionStatus Status; // 0x64
	UPlayFabJsonObject* VCAmount; // 0x68
	UPlayFabJsonObject* VirtualCurrency; // 0x70
};

struct FAnimNode_SkeletalControlBase : FAnimNode_Base {
	FComponentSpacePoseLink ComponentPose; // 0x10
	int32_t LODThreshold; // 0x20
	float ActualAlpha; // 0x24
	EAnimAlphaInputType AlphaInputType; // 0x28
	bool bAlphaBoolEnabled; // 0x29
	float Alpha; // 0x2c
	FInputScaleBias AlphaScaleBias; // 0x30
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x38
	FName AlphaCurveName; // 0x80
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x88
};

struct FAdminDeleteContentRequest : FPlayFabRequestCommon {
	FString Key; // 0x8
};

struct FFrameRate {
	int32_t Numerator; // 0x0
	int32_t Denominator; // 0x4
};

struct FProfilesGetEntityProfilesRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool DataAsObject; // 0x10
	TArray<UPlayFabJsonObject*> Entities; // 0x18
};

struct FClientOpenTradeRequest : FPlayFabRequestCommon {
	FString AllowedPlayerIds; // 0x8
	FString OfferedInventoryInstanceIds; // 0x18
	FString RequestedCatalogItemIds; // 0x28
};

struct FRigUnit_ConvertEulerTransform : FRigUnit {
	FEulerTransform Input; // 0x8
	FTransform Result; // 0x30
};

struct FMovieSceneSequenceTransform {
	FMovieSceneTimeTransform LinearTransform; // 0x0
	TArray<FMovieSceneNestedSequenceTransform> NestedTransforms; // 0x10
};

struct FPhysicalAnimationProfile {
	FName ProfileName; // 0x0
	FPhysicalAnimationData PhysicalAnimationData; // 0x8
};

struct FYVanityAmountUpdatedData {
	TArray<FYVanityBackendItemInfo> updatedVanityItems; // 0x0
};

struct FSplineInstanceData : FSceneComponentInstanceData {
	bool bSplineHasBeenEdited; // 0xb8
	FSplineCurves SplineCurves; // 0xc0
	FSplineCurves SplineCurvesPreUCS; // 0x130
};

struct FClientGetPurchaseResult : FPlayFabResultCommon {
	FString OrderId; // 0x8
	FString PaymentProvider; // 0x18
	FString PurchaseDate; // 0x28
	FString TransactionId; // 0x38
	FString TransactionStatus; // 0x48
};

struct FRigUnit_UnaryQuaternionOp : FRigUnit {
	FQuat Argument; // 0x10
	FQuat Result; // 0x20
};

struct FMovieSceneEvaluationGroup {
	TArray<FMovieSceneEvaluationGroupLUTIndex> LUTIndices; // 0x0
	TArray<FMovieSceneFieldEntry_EvaluationTrack> TrackLUT; // 0x10
	TArray<FMovieSceneFieldEntry_ChildTemplate> SectionLUT; // 0x20
};

struct FServerRemovePlayerTagRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
	FString TagName; // 0x20
};

struct FSubmixEffectDelaySettings {
	float MaximumDelayLength; // 0x0
	float InterpolationTime; // 0x4
	float DelayLength; // 0x8
};

struct FAdminResetPasswordRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Password; // 0x10
	FString Token; // 0x20
};

struct FRigUnit_AccumulateVectorRange : FRigUnit_SimBase {
	FVector Value; // 0x8
	FVector Minimum; // 0x14
	FVector Maximum; // 0x20
	FVector AccumulatedMinimum; // 0x2c
	FVector AccumulatedMaximum; // 0x38
};

struct FServerExecuteCloudScriptResult : FPlayFabResultCommon {
	int32_t APIRequestsIssued; // 0x8
	UPlayFabJsonObject* Error; // 0x10
	int32_t ExecutionTimeSeconds; // 0x18
	FString FunctionName; // 0x20
	UPlayFabJsonObject* FunctionResult; // 0x30
	bool FunctionResultTooLarge; // 0x38
	int32_t HttpRequestsIssued; // 0x3c
	TArray<UPlayFabJsonObject*> Logs; // 0x40
	bool LogsTooLarge; // 0x50
	int32_t MemoryConsumedBytes; // 0x54
	int32_t ProcessorTimeSeconds; // 0x58
	int32_t Revision; // 0x5c
};

struct FFontImportOptionsData {
	FString FontName; // 0x0
	float Height; // 0x10
	char bEnableAntialiasing : 1; // 0x14
	char bEnableBold : 1; // 0x14
	char bEnableItalic : 1; // 0x14
	char bEnableUnderline : 1; // 0x14
	char bAlphaOnly : 1; // 0x14
	EFontImportCharacterSet CharacterSet; // 0x18
	FString Chars; // 0x20
	FString UnicodeRange; // 0x30
	FString CharsFilePath; // 0x40
	FString CharsFileWildcard; // 0x50
	char bCreatePrintableOnly : 1; // 0x60
	char bIncludeASCIIRange : 1; // 0x60
	FLinearColor ForegroundColor; // 0x64
	char bEnableDropShadow : 1; // 0x74
	int32_t TexturePageWidth; // 0x78
	int32_t TexturePageMaxHeight; // 0x7c
	int32_t XPadding; // 0x80
	int32_t YPadding; // 0x84
	int32_t ExtendBoxTop; // 0x88
	int32_t ExtendBoxBottom; // 0x8c
	int32_t ExtendBoxRight; // 0x90
	int32_t ExtendBoxLeft; // 0x94
	char bEnableLegacyMode : 1; // 0x98
	int32_t Kerning; // 0x9c
	char bUseDistanceFieldAlpha : 1; // 0xa0
	int32_t DistanceFieldScaleFactor; // 0xa4
	float DistanceFieldScanRadiusScale; // 0xa8
};

struct FGroupsDeleteGroupRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Group; // 0x10
};

struct FEditorImportWorkflowDefinition {
	FFilePath ImportFilePath; // 0x0
	TArray<FImportFactorySettingValues> FactorySettings; // 0x10
};

struct FYActiveVanityCustomizationInitializatonData {
	TSoftObjectPtr<UStaticMesh> m_staticMesh; // 0x0
	TSoftObjectPtr<USkeletalMesh> m_skeletalMesh; // 0x28
	FDataTableRowHandle m_rowHandle; // 0x50
	FYInventoryItem m_desiredInventoryItem; // 0x60
	EYVanityType m_vanityType; // 0xf8
};

struct FYPlayerAutomationData {
	FYAutomationLoadingMetrics m_loadingMetrics; // 0x0
	bool m_finishedInitialization; // 0x50
};

struct FClientUnlinkSteamAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FEQSParametrizedQueryExecutionRequest {
	UEnvQuery* QueryTemplate; // 0x0
	TArray<FAIDynamicParam> QueryConfig; // 0x8
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0x18
	EEnvQueryRunMode RunMode; // 0x40
	char bUseBBKeyForQueryTemplate : 1; // 0x44
};

struct FRigUnit_MathRBFInterpolateVectorBase : FRigUnit_MathRBFInterpolateBase {
	FVector Input; // 0x8
	ERBFVectorDistanceType DistanceFunction; // 0x14
	ERBFKernelType SmoothingFunction; // 0x15
	float SmoothingRadius; // 0x18
	bool bNormalizeOutput; // 0x1c
	FRigUnit_MathRBFInterpolateVectorWorkData WorkData; // 0x20
};

struct FYRepairItemResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	TArray<FYCurrencyItem> changedCurrencies; // 0x20
	TArray<FYCustomItemInfo> changedItems; // 0x30
};

struct FInteriorSettings {
	bool bIsWorldSettings; // 0x0
	float ExteriorVolume; // 0x4
	float ExteriorTime; // 0x8
	float ExteriorLPF; // 0xc
	float ExteriorLPFTime; // 0x10
	float InteriorVolume; // 0x14
	float InteriorTime; // 0x18
	float InteriorLPF; // 0x1c
	float InteriorLPFTime; // 0x20
};

struct FPIELoginSettingsInternal {
	FString ID; // 0x0
	FString Token; // 0x10
	FString Type; // 0x20
	EYLoginAuthType m_overridenAuthType; // 0x30
	TArray<char> TokenBytes; // 0x38
};

struct FChaosSolverConfiguration {
	int32_t Iterations; // 0x0
	int32_t CollisionPairIterations; // 0x4
	int32_t PushOutIterations; // 0x8
	int32_t CollisionPushOutPairIterations; // 0xc
	float CollisionMarginFraction; // 0x10
	float CollisionMarginMax; // 0x14
	float CollisionCullDistance; // 0x18
	int32_t JointPairIterations; // 0x1c
	int32_t JointPushOutPairIterations; // 0x20
	float ClusterConnectionFactor; // 0x24
	EClusterUnionMethod ClusterUnionConnectionType; // 0x28
	bool bGenerateCollisionData; // 0x29
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2c
	bool bGenerateBreakData; // 0x3c
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x40
	bool bGenerateTrailingData; // 0x50
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x54
	bool bGenerateContactGraph; // 0x64
};

struct FRecordedTransformTrack {
	TArray<FRecordedFrame> Records; // 0x0
};

struct FARCameraIntrinsics {
	FIntPoint ImageResolution; // 0x0
	FVector2D FocalLength; // 0x8
	FVector2D PrincipalPoint; // 0x10
};

struct FStructSerializerMapTestStruct {
	TMap<int32_t, FString> IntToStr; // 0x0
	TMap<FString, FString> StrToStr; // 0x50
	TMap<FString, FVector> StrToVec; // 0xa0
	TMap<FString, FStructSerializerBuiltinTestStruct> StrToStruct; // 0xf0
};

struct FARFilter {
	TArray<FName> PackageNames; // 0x0
	TArray<FName> PackagePaths; // 0x10
	TArray<FName> ObjectPaths; // 0x20
	TArray<FName> ClassNames; // 0x30
	TSet<FName> RecursiveClassesExclusionSet; // 0x90
	bool bRecursivePaths; // 0xe0
	bool bRecursiveClasses; // 0xe1
	bool bIncludeOnlyOnDiskAssets; // 0xe2
};

struct FRigUnit_MathFloatIsNearlyZero : FRigUnit_MathFloatBase {
	float Value; // 0x8
	float Tolerance; // 0xc
	bool Result; // 0x10
};

struct FSoundConcurrencySettings {
	int32_t MaxCount; // 0x0
	char bLimitToOwner : 1; // 0x4
	EMaxConcurrentResolutionRule ResolutionRule; // 0x8
	float RetriggerTime; // 0xc
	float VolumeScale; // 0x10
	EConcurrencyVolumeScaleMode VolumeScaleMode; // 0x14
	float VolumeScaleAttackTime; // 0x18
	char bVolumeScaleCanRelease : 1; // 0x1c
	float VolumeScaleReleaseTime; // 0x20
	float VoiceStealReleaseTime; // 0x24
};

struct FMathRBFInterpolateVectorFloat_Target {
	FVector Target; // 0x0
	float Value; // 0xc
};

struct FControlRigComponentMappedElement {
	FComponentReference ComponentReference; // 0x0
	int32_t TransformIndex; // 0x28
	FName TransformName; // 0x2c
	ERigElementType ElementType; // 0x34
	FName ElementName; // 0x38
	EControlRigComponentMapDirection Direction; // 0x40
	FTransform Offset; // 0x50
	float weight; // 0x80
	EControlRigComponentSpace Space; // 0x84
	USceneComponent* SceneComponent; // 0x88
	int32_t ElementIndex; // 0x90
	int32_t SubIndex; // 0x94
};

struct FBranchingPointMarker {
	int32_t NotifyIndex; // 0x0
	float TriggerTime; // 0x4
	EAnimNotifyEventType NotifyEventType; // 0x8
};

struct FComponentKey {
	UObject* OwnerClass; // 0x0
	FName SCSVariableName; // 0x8
	FGuid AssociatedGuid; // 0x10
};

struct FYContractDynamicData {
	FString m_contractId; // 0x0
	TArray<int32_t> m_contractCurrentProgress; // 0x10
	EYContractStatus m_contractStatus; // 0x20
};

struct FYFriendListBI : FYBaseAnalyticsEvent {
	FString target_user_id; // 0xa8
	FString action_name; // 0xb8
	FString screen; // 0xc8
};

struct FServerLoginWithXboxRequest : FPlayFabRequestCommon {
	bool CreateAccount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	UPlayFabJsonObject* InfoRequestParameters; // 0x18
	FString XboxToken; // 0x20
};

struct FMovieSceneCameraShakeSectionTemplate : FMovieSceneAdditiveCameraAnimationTemplate {
	FMovieSceneCameraShakeSectionData SourceData; // 0x20
	FFrameNumber SectionStartTime; // 0x40
};

struct FClientConsumePSNEntitlementsRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	int32_t ServiceLabel; // 0x20
};

struct FTimeSynthClipSound {
	USoundWave* SoundWave; // 0x0
	float RandomWeight; // 0x8
	FVector2D DistanceRange; // 0xc
};

struct FCompressedTrack {
	TArray<char> ByteStream; // 0x0
	TArray<float> Times; // 0x10
	float Mins[0x3]; // 0x20
	float Ranges[0x3]; // 0x2c
};

struct FMovieSceneEventTriggerData {
	FMovieSceneEventPtrs Ptrs; // 0x0
	FGuid ObjectBindingID; // 0x28
};

struct FServerUnlinkServerCustomIdRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
	FString ServerCustomId; // 0x20
};

struct FDirectorTrackCut {
	float Time; // 0x0
	float transitionTime; // 0x4
	FName TargetCamGroup; // 0x8
	int32_t ShotNumber; // 0x10
};

struct FDirectLinkMsg_EndpointLifecycle {
	char LifecycleState; // 0x0
	uint32_t EndpointStateRevision; // 0x4
};

struct FYPlayfabCommonSettings {
	int32_t m_localApiServerTimeout; // 0x0
	int32_t m_normalAzureFunctionTimeout; // 0x4
};

struct FYGlobalVanityData {
	FString UserId; // 0x0
	TArray<FYVanityMaterialItem> bannerItems; // 0x10
	FYVanityMaterialItem deathEmote_item; // 0x20
	TArray<FYVanityMaterialItem> normalEmoteItems; // 0x38
	FYVanityMaterialItem droppod_item; // 0x48
	TArray<FYVanityMaterialItem> sprayItems; // 0x60
	FYVanityMaterialItem pet_item; // 0x70
	int32_t slot_index; // 0x88
};

struct FServerGetPlayerCombinedInfoRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* InfoRequestParameters; // 0x10
	FString PlayFabId; // 0x18
};

struct FYActiveContractsUIData {
	TArray<FYActiveContractUIData> activeContracts; // 0x0
};

struct FGroupsListGroupBlocksRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Group; // 0x10
};

struct FRigUnit_DebugTransformMutable : FRigUnit_DebugBaseMutable {
	FTransform Transform; // 0x70
	ERigUnitDebugTransformMode Mode; // 0xa0
	FLinearColor Color; // 0xa4
	float Thickness; // 0xb4
	float Scale; // 0xb8
	FName Space; // 0xbc
	FTransform WorldOffset; // 0xd0
	bool bEnabled; // 0x100
};

struct FServerRedeemCouponResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> GrantedItems; // 0x8
};

struct FRigUnit_GetControlTransform : FRigUnit {
	FName Control; // 0x8
	EBoneGetterSetterMode Space; // 0x10
	FTransform Transform; // 0x20
	FTransform Minimum; // 0x50
	FTransform Maximum; // 0x80
	FCachedRigElement CachedControlIndex; // 0xb0
};

struct FRigUnit_SetMultiControlBool : FRigUnitMutable {
	TArray<FRigUnit_SetMultiControlBool_Entry> entries; // 0x68
	TArray<FCachedRigElement> CachedControlIndices; // 0x78
};

struct FYCraftingDiscountDataTableReference {
	UDataTable* m_dataTable; // 0x0
	FString m_sourceFileName; // 0x8
};

struct FYAIMontageStopInfo {
	UAnimMontage* m_montage; // 0x0
	float m_serverTimestamp; // 0x8
	float m_blendOutTime; // 0xc
};

struct FYMineralActivityStats : FYBaseActivityStats {
	FString mineral_type; // 0xb8
	FString mineral_id; // 0xc8
	FString used_tool; // 0xd8
	int32_t remaining_segments; // 0xe8
	int32_t total_segment_count; // 0xec
	int32_t time_since_user_joined; // 0xf0
	int32_t time_spent; // 0xf4
	int32_t total_hit_count; // 0xf8
	bool contested; // 0xfc
};

struct FAdminGetPlayedTitleListResult : FPlayFabResultCommon {
	FString TitleIds; // 0x8
};

struct FServerGetPlayersInSegmentResult : FPlayFabResultCommon {
	FString ContinuationToken; // 0x8
	TArray<UPlayFabJsonObject*> PlayerProfiles; // 0x18
	int32_t ProfilesInSegment; // 0x28
};

struct FYActiveInventoryInsurance {
	TArray<FYInsuredItems> m_insured; // 0x0
	TArray<FYInsuredItems> m_pending; // 0x10
};

struct FStatColorMapEntry {
	float In; // 0x0
	FColor Out; // 0x4
};

struct FYInputWidget {
	TWeakObjectPtr<UWidget> m_widget; // 0x0
	FString m_context; // 0x8
	bool m_showCursor; // 0x18
	bool m_uiOnly; // 0x19
	bool m_hideCursorDuringCapture; // 0x1a
};

struct FClientAddOrUpdateContactEmailRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString EmailAddress; // 0x10
};

struct FBlueprintInputTouchDelegateBinding : FBlueprintInputDelegateBinding {
	EInputEvent InputKeyEvent; // 0x4
	FName FunctionNameToBind; // 0x8
};

struct FClientConsumePSNEntitlementsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> ItemsGranted; // 0x8
};

struct FRigUnit_MathVectorUnaryOp : FRigUnit_MathVectorBase {
	FVector Value; // 0x8
	FVector Result; // 0x14
};

struct FCustomChannelSetup {
	ECollisionChannel Channel; // 0x0
	ECollisionResponse DefaultResponse; // 0x1
	bool bTraceType; // 0x2
	bool bStaticObject; // 0x3
	FName Name; // 0x4
};

struct FPropertyAccessSegment {
	FName Name; // 0x0
	UStruct* Struct; // 0x8
	TFieldPath<FProperty> Property; // 0x10
	UFunction* Function; // 0x30
	int32_t ArrayIndex; // 0x38
	uint16_t Flags; // 0x3c
};

struct FYAIHitReactionSetData {
	TMap<EYHitZone, FYAIHitReactionAnimations> m_animationsPerHitZone; // 0x0
};

struct FMovieSceneEventChannel : FMovieSceneChannel {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneEvent> KeyValues; // 0x18
};

struct FRigUnit_MathQuaternionNotEquals : FRigUnit_MathQuaternionBase {
	FQuat A; // 0x10
	FQuat B; // 0x20
	bool Result; // 0x30
};

struct FProfilesSetEntityProfilePolicyRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	TArray<UPlayFabJsonObject*> Statements; // 0x18
};

struct FHorizonTweenEventActorParameters {
	FHorizonTweenEventParameters MoveFromToParam; // 0x0
	FHorizonTweenEventActorMoveFromToParameters MoveFromToParamImpl; // 0x38
	bool bMoveFromTo; // 0x188
	FHorizonTweenEventParameters RotatorFromToParam; // 0x190
	FHorizonTweenEventActorRotatorFromToParameters RotatorFromToParamImpl; // 0x1c8
	bool bRotateFromTo; // 0x328
	FHorizonTweenEventParameters ScaleFromToParam; // 0x330
	FHorizonTweenEventActorScaleFromToParameters ScaleFromToParamImpl; // 0x368
	bool bScaleFromTo; // 0x4b8
	FHorizonTweenEventParameters ColorFromToParam; // 0x4c0
	FHorizonTweenEventActorColorFromToParameters ColorFromToParamImpl; // 0x4f8
	bool bColorFromTo; // 0x738
};

struct FControlRigSequenceObjectReference {
	UControlRig* ControlRigClass; // 0x0
};

struct FNiagaraEmitterCompiledData {
	TArray<FName> SpawnAttributes; // 0x0
	FNiagaraVariable EmitterSpawnIntervalVar; // 0x10
	FNiagaraVariable EmitterInterpSpawnStartDTVar; // 0x30
	FNiagaraVariable EmitterSpawnGroupVar; // 0x50
	FNiagaraVariable EmitterAgeVar; // 0x70
	FNiagaraVariable EmitterRandomSeedVar; // 0x90
	FNiagaraVariable EmitterInstanceSeedVar; // 0xb0
	FNiagaraVariable EmitterTotalSpawnedParticlesVar; // 0xd0
	FNiagaraDataSetCompiledData DataSetCompiledData; // 0xf0
};

struct FClientLoginWithGoogleAccountRequest : FPlayFabRequestCommon {
	bool CreateAccount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString EncryptedRequest; // 0x18
	UPlayFabJsonObject* InfoRequestParameters; // 0x28
	FString PlayerSecret; // 0x30
	FString ServerAuthCode; // 0x40
};

struct FYReplicatedRankData {
	int32_t m_rank; // 0x0
	int32_t m_prevRank; // 0x4
	bool m_unplaced; // 0x8
	bool m_receivedBackendData; // 0x9
};

struct FYMatchmakingResponse {
	EYMatchmakingResult Error; // 0x0
	FString GameMode; // 0x8
	FString Region; // 0x18
	bool isRanked; // 0x28
	int32_t estimatedTimeSeconds; // 0x2c
};

struct FMultiplayerDeleteBuildRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
};

struct FHorizonTweenEventCustomColorCurve {
	FRuntimeCurveLinearColor CustomTweenCurve; // 0x0
};

struct FClientGetUserDataRequest : FPlayFabRequestCommon {
	int32_t IfChangedFromDataVersion; // 0x8
	FString Keys; // 0x10
	FString PlayFabId; // 0x20
};

struct FClientLinkGameCenterAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool ForceLink; // 0x10
	FString GameCenterId; // 0x18
	FString PublicKeyUrl; // 0x28
	FString Salt; // 0x38
	FString Signature; // 0x48
	FString Timestamp; // 0x58
};

struct FRigUnit_DeltaFromPreviousTransform : FRigUnit_SimBase {
	FTransform Value; // 0x10
	FTransform Delta; // 0x40
	FTransform PreviousValue; // 0x70
	FTransform Cache; // 0xa0
};

struct FRigUnit_MathTransformFromSRT : FRigUnit_MathTransformBase {
	FVector Location; // 0x8
	FVector Rotation; // 0x14
	EControlRigRotationOrder RotationOrder; // 0x20
	FVector Scale; // 0x24
	FTransform Transform; // 0x30
	FEulerTransform EulerTransform; // 0x60
};

struct FVectorParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	FLinearColor ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x20
};

struct FYItemStatOldValNewVal {
	int32_t m_itemStatType; // 0x0
	int32_t m_currentVal; // 0x4
	int32_t m_newVal; // 0x8
};

struct FSourceEffectBitCrusherSettings {
	float CrushedSampleRate; // 0x0
	FSoundModulationDestinationSettings SampleRateModulation; // 0x8
	float CrushedBits; // 0x18
	FSoundModulationDestinationSettings BitModulation; // 0x20
};

struct FYSocialNotification {
	FYSocialProfileEntry m_associatedPlayerEntry; // 0x0
	FString m_id; // 0x88
	FText m_overridenMessage; // 0x98
	EYNotifcationType m_type; // 0xb0
	EYNotificationMessageType m_messageType; // 0xb1
	bool m_isPermanent; // 0xb2
};

struct FYConnect {
	FString addr; // 0x0
	FString roomId; // 0x10
};

struct FRigUnit_MathBoolNotEquals : FRigUnit_MathBoolBase {
	bool A; // 0x8
	bool B; // 0x9
	bool Result; // 0xa
};

struct FFindFloorResult {
	char bBlockingHit : 1; // 0x0
	char bWalkableFloor : 1; // 0x0
	char bLineTrace : 1; // 0x0
	float FloorDist; // 0x4
	float LineDist; // 0x8
	FHitResult HitResult; // 0xc
};

struct FInterpCurveVector2D {
	TArray<FInterpCurvePointVector2D> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FSolverCollisionFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc
};

struct FAnimNode_SingleNode : FAnimNode_Base {
	FPoseLink SourcePose; // 0x10
};

struct FExperimentationStopExperimentRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString ExperimentId; // 0x10
};

struct FEnvOverlapData {
	float ExtentX; // 0x0
	float ExtentY; // 0x4
	float ExtentZ; // 0x8
	FVector ShapeOffset; // 0xc
	ECollisionChannel OverlapChannel; // 0x18
	EEnvOverlapShape OverlapShape; // 0x19
	char bOnlyBlockingHits : 1; // 0x1c
	char bOverlapComplex : 1; // 0x1c
	char bSkipOverlapQuerier : 1; // 0x1c
};

struct FNavAvoidanceMask {
	char bGroup0 : 1; // 0x0
	char bGroup1 : 1; // 0x0
	char bGroup2 : 1; // 0x0
	char bGroup3 : 1; // 0x0
	char bGroup4 : 1; // 0x0
	char bGroup5 : 1; // 0x0
	char bGroup6 : 1; // 0x0
	char bGroup7 : 1; // 0x0
	char bGroup8 : 1; // 0x1
	char bGroup9 : 1; // 0x1
	char bGroup10 : 1; // 0x1
	char bGroup11 : 1; // 0x1
	char bGroup12 : 1; // 0x1
	char bGroup13 : 1; // 0x1
	char bGroup14 : 1; // 0x1
	char bGroup15 : 1; // 0x1
	char bGroup16 : 1; // 0x2
	char bGroup17 : 1; // 0x2
	char bGroup18 : 1; // 0x2
	char bGroup19 : 1; // 0x2
	char bGroup20 : 1; // 0x2
	char bGroup21 : 1; // 0x2
	char bGroup22 : 1; // 0x2
	char bGroup23 : 1; // 0x2
	char bGroup24 : 1; // 0x3
	char bGroup25 : 1; // 0x3
	char bGroup26 : 1; // 0x3
	char bGroup27 : 1; // 0x3
	char bGroup28 : 1; // 0x3
	char bGroup29 : 1; // 0x3
	char bGroup30 : 1; // 0x3
	char bGroup31 : 1; // 0x3
};

struct FConstraintDescriptionEx {
	FFilterOptionPerAxis AxesFilterOption; // 0x8
};

struct FBroadphaseSettings {
	bool bUseMBPOnClient; // 0x0
	bool bUseMBPOnServer; // 0x1
	bool bUseMBPOuterBounds; // 0x2
	FBox MBPBounds; // 0x4
	FBox MBPOuterBounds; // 0x20
	uint32_t MBPNumSubdivs; // 0x3c
};

struct FClientGetTimeResult : FPlayFabResultCommon {
	FString Time; // 0x8
};

struct FRigUnit_MathQuaternionRotateVector : FRigUnit_MathQuaternionBase {
	FQuat Quaternion; // 0x10
	FVector Vector; // 0x20
	FVector Result; // 0x2c
};

struct FChildActorAttachedActorInfo {
	TWeakObjectPtr<AActor> Actor; // 0x0
	FName SocketName; // 0x8
	FTransform RelativeTransform; // 0x10
};

struct FAdminAddLocalizedNewsRequest : FPlayFabRequestCommon {
	FString Body; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString Language; // 0x20
	FString NewsId; // 0x30
	FString Title; // 0x40
};

struct FRigUnit_DrawContainerGetInstruction : FRigUnit {
	FName InstructionName; // 0x8
	FLinearColor Color; // 0x10
	FTransform Transform; // 0x20
};

struct FYDOTDamageEntry {
	AActor* m_initiator; // 0x0
	float m_duration; // 0x8
	float m_deltaTime; // 0xc
	float m_damageInterval; // 0x10
	float m_timeStarted; // 0x14
	float m_damagePerInterval; // 0x18
	int32_t m_ticks; // 0x1c
	FYDamageOriginInfo m_dotAppliedFromOriginInfo; // 0x20
};

struct FExponentialHeightFogData {
	float FogDensity; // 0x0
	float FogHeightFalloff; // 0x4
	float FogHeightOffset; // 0x8
};

struct FAdminUpdateCloudScriptRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DeveloperPlayFabId; // 0x10
	TArray<UPlayFabJsonObject*> Files; // 0x20
	bool Publish; // 0x30
};

struct FRigUnit_FitChainToCurve_Rotation {
	FQuat Rotation; // 0x0
	float Ratio; // 0x10
};

struct FYFriendsImportResponse {
	EYFriendsImportResultCode resultCode; // 0x0
	int32_t numOfImportedFriends; // 0x4
};

struct FExperimentationCreateExperimentResult : FPlayFabResultCommon {
	FString ExperimentId; // 0x8
};

struct FYSetUpdated {
	FString UserId; // 0x0
	FYPlayerSetItemsEntry newSet; // 0x10
};

struct FServerGetLeaderboardResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Leaderboard; // 0x8
	FString NextReset; // 0x18
	int32_t Version; // 0x28
};

struct FAnimNode_SaveCachedPose : FAnimNode_Base {
	FPoseLink pose; // 0x10
	FName CachePoseName; // 0x20
};

struct FCustomAttribute {
	FName Name; // 0x0
	int32_t VariantType; // 0x8
	TArray<float> Times; // 0x10
};

struct FYAssetValidatorEntry {
	TArray<FYAssetTagCheckEntry> m_prefixes; // 0x0
	TArray<FYAssetTagCheckEntry> m_suffixes; // 0x10
	bool m_enabled; // 0x20
};

struct FYLootNotificationAudioData {
	EYItemRarityType m_rarity; // 0x0
	FDataTableRowHandle m_lootNotification; // 0x8
};

struct FCaptureResolution {
	int32_t ResX; // 0x0
	int32_t ResY; // 0x4
};

struct FYEnterMatch {
	FString m_matchTicket; // 0x0
};

struct FExposedValueCopyRecord {
	int32_t CopyIndex; // 0x0
	EPostCopyOperation PostCopyOperation; // 0x4
};

struct FYUnlockedShopItem {
	FDataTableRowHandle m_blueprintHandle; // 0x0
	EYItemRarityType m_itemRarity; // 0x10
};

struct FAnimTickRecord {
	UAnimationAsset* SourceAsset; // 0x0
};

struct FRigUnit_MathTransformTransformVector : FRigUnit_MathTransformBase {
	FTransform Transform; // 0x10
	FVector Location; // 0x40
	FVector Result; // 0x4c
};

struct FClientGetPlayerProfileResult : FPlayFabResultCommon {
	UPlayFabJsonObject* PlayerProfile; // 0x8
};

struct FYAISquadDifficultyDefinitionTableRow : FTableRowBase {
	TArray<FYPossibleSquadDefinitions> m_squadsPerDifficulty; // 0x8
};

struct FDatasmithStaticParameterSetTemplate {
	TMap<FName, bool> StaticSwitchParameters; // 0x0
};

struct FPackedRGBA16N {
	int32_t XY; // 0x0
	int32_t ZW; // 0x4
};

struct FInterpCurveQuat {
	TArray<FInterpCurvePointQuat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FSubdivisionLimitData {
	TArray<FVector> VertexPositions; // 0x0
	TArray<FSubdivisionLimitSection> Sections; // 0x10
	TArray<FSubdividedWireEdge> SubdividedWireEdges; // 0x20
};

struct FSkeletalMeshOptimizationSettings {
	SkeletalMeshTerminationCriterion TerminationCriterion; // 0x0
	float NumOfTrianglesPercentage; // 0x4
	float NumOfVertPercentage; // 0x8
	uint32_t MaxNumOfTriangles; // 0xc
	uint32_t MaxNumOfVerts; // 0x10
	float MaxDeviationPercentage; // 0x14
	SkeletalMeshOptimizationType ReductionMethod; // 0x18
	SkeletalMeshOptimizationImportance SilhouetteImportance; // 0x19
	SkeletalMeshOptimizationImportance TextureImportance; // 0x1a
	SkeletalMeshOptimizationImportance ShadingImportance; // 0x1b
	SkeletalMeshOptimizationImportance SkinningImportance; // 0x1c
	char bRemapMorphTargets : 1; // 0x1d
	char bRecalcNormals : 1; // 0x1d
	float WeldingThreshold; // 0x20
	float NormalsThreshold; // 0x24
	int32_t MaxBonesPerVertex; // 0x28
	char bEnforceBoneBoundaries : 1; // 0x2c
	float VolumeImportance; // 0x30
	char bLockEdges : 1; // 0x34
	char bLockColorBounaries : 1; // 0x34
	int32_t BaseLOD; // 0x38
};

struct FYTransportRuntimeInitializationData {
	FYDamageOriginInfo m_damageOriginInfo; // 0x0
	FVector m_startLocation; // 0x28
	FVector m_direction; // 0x34
	FDataTableRowHandle m_transportDataTableRow; // 0x40
	FDataTableRowHandle m_impactDataTableRow; // 0x50
	FDataTableRowHandle m_fxCategoryDataTableRow; // 0x60
	FDataTableRowHandle m_dataTableRowHandleContext; // 0x70
	AActor* m_owner; // 0x80
	int32_t m_transportHandle; // 0x88
	float m_overrideGravity; // 0x8c
	float m_overrideLaunchVelocity; // 0x90
	USceneComponent* m_homingToComponet; // 0x98
	ECollisionChannel m_collisionChannelTrace; // 0xa0
	FYChainReactionDataEntry m_chainReactionData; // 0xa4
	TArray<AActor*> m_actorsToIgnore; // 0xb0
	bool m_replicateSkipAutonomous; // 0xc0
	bool m_skipFindClosestBoneCheck; // 0xc1
	bool m_clientSideProjectile; // 0xc2
	bool m_isTargeting; // 0xc3
	bool m_normalizeDirectionVector; // 0xc4
	int32_t m_randomSeed; // 0xc8
	FVector m_visualOriginTrailLocation; // 0xcc
	FGuid m_shotGuid; // 0xd8
};

struct FAdminCheckLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	FString ItemId; // 0x18
};

struct FDepthFieldGlowInfo {
	char bEnableGlow : 1; // 0x0
	FLinearColor GlowColor; // 0x4
	FVector2D GlowOuterRadius; // 0x14
	FVector2D GlowInnerRadius; // 0x1c
};

struct FRigUnit_MathFloatClamp : FRigUnit_MathFloatBase {
	float Value; // 0x8
	float Minimum; // 0xc
	float Maximum; // 0x10
	float Result; // 0x14
};

struct FEditableTextStyle : FSlateWidgetStyle {
	FSlateFontInfo Font; // 0x8
	FSlateColor ColorAndOpacity; // 0x60
	FSlateBrush BackgroundImageSelected; // 0x88
	FSlateBrush BackgroundImageComposing; // 0x110
	FSlateBrush CaretImage; // 0x198
};

struct FServerGetPlayFabIDsFromFacebookIDsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Data; // 0x8
};

struct FYInviteToSquadByName {
	FString targetName; // 0x0
};

struct FCRSimLinearSpring {
	int32_t SubjectA; // 0x0
	int32_t SubjectB; // 0x4
	float Coefficient; // 0x8
	float Equilibrium; // 0xc
};

struct FAIDataProviderTypedValue : FAIDataProviderValue {
	UObject* PropertyType; // 0x20
};

struct FS_ReplayInfo {
	FString ReplayName; // 0x0
	FString FriendlyName; // 0x10
	FDateTime Timestamp; // 0x20
	int32_t LengthInMS; // 0x28
	bool bIsValid; // 0x2c
};

struct FInputScaleBiasClamp {
	bool bMapRange; // 0x0
	bool bClampResult; // 0x1
	bool bInterpResult; // 0x2
	FInputRange InRange; // 0x4
	FInputRange OutRange; // 0xc
	float Scale; // 0x14
	float Bias; // 0x18
	float ClampMin; // 0x1c
	float ClampMax; // 0x20
	float InterpSpeedIncreasing; // 0x24
	float InterpSpeedDecreasing; // 0x28
};

struct FNiagaraDeviceProfileStateEntry {
	FName ProfileName; // 0x0
	uint32_t QualityLevelMask; // 0x8
	uint32_t SetQualityLevelMask; // 0xc
};

struct FYUpdateFactionProgressionLocal {
	FString m_faction; // 0x0
	int32_t m_factionProgression; // 0x10
};

struct FAdminGetCloudScriptTaskInstanceResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Parameter; // 0x8
	UPlayFabJsonObject* Summary; // 0x10
};

struct FClientGetCatalogItemsRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
};

struct FGroupsInviteToGroupRequest : FPlayFabRequestCommon {
	bool AutoAcceptOutstandingApplication; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	UPlayFabJsonObject* Entity; // 0x18
	UPlayFabJsonObject* Group; // 0x20
	FString RoleId; // 0x28
};

struct FServerMoveItemToCharacterFromCharacterRequest : FPlayFabRequestCommon {
	FString GivingCharacterId; // 0x8
	FString ItemInstanceId; // 0x18
	FString PlayFabId; // 0x28
	FString ReceivingCharacterId; // 0x38
};

struct FServerSendPushNotificationFromTemplateRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PushNotificationTemplateId; // 0x10
	FString Recipient; // 0x20
};

struct FMovieSceneNestedSequenceTransform {
	FMovieSceneTimeTransform LinearTransform; // 0x0
	FMovieSceneTimeWarping Warping; // 0xc
};

struct FResponseChannel {
	FName Channel; // 0x0
	ECollisionResponse response; // 0x8
};

struct FGroupsAddMembersRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Group; // 0x10
	TArray<UPlayFabJsonObject*> Members; // 0x18
	FString RoleId; // 0x28
};

struct FYVehicleRowBase : FYItemDataTableRowBase {
	FDataTableRowHandle m_healthRow; // 0x310
	float m_lifetimeAfterDeath; // 0x320
	float m_MovementSpeedBackwardsMovement; // 0x324
	float m_vehicleSideDirectionFrictionDirection; // 0x328
	float m_vehicleBackwardFrictionDirection; // 0x32c
	float m_vehicleBackwardSpeedMultiplierAccel; // 0x330
	float m_angularAccelerationMultiplierLeft; // 0x334
	float m_vehicleSideMovementSpeedMultiplierAccel; // 0x338
	float m_vehicleTurnSpeedMultiplier; // 0x33c
	float m_vehicleAdditionalMovementSpeedBank; // 0x340
	float m_MovementSpeedSideMovement; // 0x344
	float m_vehicleRotationMaxSpeed; // 0x348
	float m_vehicleGlobalAccelerationModifier; // 0x34c
	float m_vehicleFriction; // 0x350
	float m_vehicleBreaking; // 0x354
	float m_vehicleRotationIncrementSpeed; // 0x358
	float m_vehicleDecrementRotationRate; // 0x35c
	float m_vehicleDeltaPitchRollRotationRate; // 0x360
	float m_vehicleMovementSpeedBackwardsMovement; // 0x364
	float m_vehicleMovementSpeedSideMovement; // 0x368
	float m_vehicleMovementSpeedAccelerationBackwardsMovement; // 0x36c
	float m_vehicleMovementSpeedAccelerationSideMovement; // 0x370
	float m_vehicleMovementSpeed; // 0x374
	float m_vehicleBoostMovementSpeed; // 0x378
	float m_vehicleStandaloneBackwardsFriction; // 0x37c
	float m_vehicleStandaloneMaxSpeed; // 0x380
	float m_vehicleStandaloneJumpOffVelocityMultiplier; // 0x384
	float m_vehicleDamageAtDestruction; // 0x388
	float m_vehicleRadiusDamageAtDestruction; // 0x38c
	float m_vehicleRadiusDamageFallofStartRange; // 0x390
	float m_vehicleRadiusDamageFalloffMultiplier; // 0x394
	float m_vehicleOwnedInteractionTimeMultiplier; // 0x398
	float m_vehicleNotOwnedInteractionTimeMultiplier; // 0x39c
	FVector m_vehicleIdleBaseLocationOffset; // 0x3a0
	FVector m_vehiclePossedLocationOffset; // 0x3ac
	FName m_vehicleAttachSocketName; // 0x3b8
	FDataTableRowHandle m_vehicleImpactRow; // 0x3c0
	float m_minVelocityMaxSpeedInterpDealDamage; // 0x3d0
	float m_damageVelocityStartInterpolate; // 0x3d4
	float m_damageVelocityMaxInterpolate; // 0x3d8
	float m_minimumPerDamageIntervalTime; // 0x3dc
	float m_vehicleTurnBoostSpeedModifier; // 0x3e0
	float m_vehicleJumpVelocity; // 0x3e4
	FDataTableRowHandle m_movementAudioSoundQueue; // 0x3e8
	FDataTableRowHandle m_boostAudioSoundQueue; // 0x3f8
};

struct FServerSubtractUserVirtualCurrencyRequest : FPlayFabRequestCommon {
	int32_t Amount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString PlayFabId; // 0x18
	FString VirtualCurrency; // 0x28
};

struct FYActivateContractResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	TArray<FYCurrencyItem> changedCurrencies; // 0x20
	FYActiveContractPlayerData activatedContract; // 0x30
	EYActivateContractRequestStatus Status; // 0x50
};

struct FYDebugGivePlayerGamemodeRankRequest {
	int32_t rankIncrement; // 0x0
	FString GameMode; // 0x8
};

struct FGroupsUnblockEntityRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	UPlayFabJsonObject* Group; // 0x18
};

struct FBlueprintWidgetAnimationDelegateBinding {
	EWidgetAnimationEvent Action; // 0x0
	FName AnimationToBind; // 0x4
	FName FunctionNameToBind; // 0xc
	FName UserTag; // 0x14
};

struct FYRepairItemRequest {
	FString instanceId; // 0x0
	FString UserId; // 0x10
};

struct FAdminCreatePlayerSharedSecretRequest : FPlayFabRequestCommon {
	FString FriendlyName; // 0x8
};

struct FServerGetUserAccountInfoResult : FPlayFabResultCommon {
	UPlayFabJsonObject* UserInfo; // 0x8
};

struct FYDebugRemoveAllMaterialsFromPlayerRequest {
	FString UserId; // 0x0
};

struct FClientSetFriendTagsRequest : FPlayFabRequestCommon {
	FString FriendPlayFabId; // 0x8
	FString Tags; // 0x18
};

struct FDelegateRuntimeBinding {
	FString ObjectName; // 0x0
	FName PropertyName; // 0x10
	FName FunctionName; // 0x18
	FDynamicPropertyPath SourcePath; // 0x20
	EBindingKind Kind; // 0x48
};

struct FNiagaraDataSetID {
	FName Name; // 0x0
	ENiagaraDataSetType Type; // 0x8
};

struct FYCurrencyRow : FYItemDataTableRowBase {
	EYCurrencyType m_currencyType; // 0x310
	TSoftObjectPtr<UTexture2D> m_hudIconBig; // 0x318
	TSoftObjectPtr<UObject> m_mesh; // 0x340
	FRotator m_relativeMeshRotation; // 0x368
	FVector m_relativeMeshLocation; // 0x374
	FVector m_scale; // 0x380
	bool m_shouldUseMaterialRepresentation; // 0x38c
	int32_t m_upperCap; // 0x390
};

struct FFontOutlineSettings {
	int32_t OutlineSize; // 0x0
	bool bSeparateFillAlpha; // 0x4
	bool bApplyOutlineToDropShadows; // 0x5
	UObject* OutlineMaterial; // 0x8
	FLinearColor OutlineColor; // 0x10
};

struct FAnimMontageInstance {
	UAnimMontage* Montage; // 0x0
	bool bPlaying; // 0x28
	float DefaultBlendTimeMultiplier; // 0x2c
	TArray<int32_t> NextSections; // 0xe8
	TArray<int32_t> PrevSections; // 0xf8
	TArray<FAnimNotifyEvent> ActiveStateBranchingPoints; // 0x118
	float Position; // 0x128
	float PlayRate; // 0x12c
	FAlphaBlend Blend; // 0x130
	int32_t DisableRootMotionCount; // 0x18c
};

struct FClientGetPlayFabIDsFromNintendoSwitchDeviceIdsRequest : FPlayFabRequestCommon {
	FString NintendoSwitchDeviceIds; // 0x8
};

struct FMultiplayerCreateRemoteUserResponse : FPlayFabResultCommon {
	FString ExpirationTime; // 0x8
	FString Password; // 0x18
	FString Username; // 0x28
};

struct FProgressUIData {
	FText m_description; // 0x0
	UTexture2D* m_icon; // 0x18
	FLinearColor m_progressColorTheme; // 0x20
};

struct FYGetCompetitorsDataRequest {
	int32_t playersAbove; // 0x0
	int32_t playersBelow; // 0x4
};

struct FYFPSMatchSummaryServerEvent : FYBaseAnalyticsEvent {
	int32_t time_seconds; // 0xa8
	float frametime_average; // 0xac
	float frametime_quantile_26; // 0xb0
	float frametime_quantile_51; // 0xb4
	float frametime_quantile_76; // 0xb8
	float frametime_max; // 0xbc
	float frametime_min; // 0xc0
	int32_t fps_limit; // 0xc4
	uint32_t physical_memory_max; // 0xc8
	uint32_t virtual_memory_max; // 0xcc
	int32_t players_max; // 0xd0
	float players_avg; // 0xd4
	int32_t ai_max; // 0xd8
	float ai_avg; // 0xdc
	float gc_time_avg; // 0xe0
	float gc_time_max; // 0xe4
	float gc_time_min; // 0xe8
	float gc_time_percent_over_budget; // 0xec
};

struct FUVMapSettings {
	FVector Size; // 0x0
	FVector2D UVTile; // 0xc
	FVector Position; // 0x14
	FRotator Rotation; // 0x20
	FVector Scale; // 0x2c
};

struct FHorizonTweenEventWidgetVector2DParameters : FHorizonTweenEventTweenListImplementParameters {
	TArray<FVector2D> TweenStartList; // 0x8
	TArray<FVector2D> TweenEndList; // 0x18
	EHorizonTweenVector2DConstraints ConstraintType; // 0x28
	EHorizonTweenCoordinateSpace CoordinateSpaceType; // 0x29
	FHorizonTweenEventCustomCurve CustomTweenCurve; // 0x30
};

struct FConstraintTarget {
	FTransform Transform; // 0x0
	float weight; // 0x30
	bool bMaintainOffset; // 0x34
	FTransformFilter Filter; // 0x35
};

struct FYPlayerStateChangeData {
	AActor* m_relevantActor; // 0x0
	FYPlayerRuntimeScoreStateData m_newData; // 0x8
	FYPlayerRuntimeScoreStateData m_oldData; // 0x14
	EYPlayerGameDataStateType m_relevantState; // 0x20
};

struct FYNotificiationDataRequest {
	FText m_message; // 0x0
	float m_duration; // 0x18
	FSlateColor m_color; // 0x20
	EYNotificationType m_type; // 0x48
	EYNotificationPlacement m_placement; // 0x49
};

struct FYStaminaMeleeMontageData {
	UAnimMontage* m_weakenedMeleeMissMontageTPP; // 0x0
	UAnimMontage* m_weakenedMeleeMissMontageFPP; // 0x8
	UAnimMontage* m_weakenedMeleeImpactMontageTPP; // 0x10
	UAnimMontage* m_weakenedMeleeImpactMontageFPP; // 0x18
};

struct FGuid {
	int32_t A; // 0x0
	int32_t B; // 0x4
	int32_t C; // 0x8
	int32_t D; // 0xc
};

struct FYWeaponParticleSystemSelector {
	UParticleSystem* m_defaultPS; // 0x0
	TArray<FYWeaponParticleSystemOverrideByWeaponType> m_overridePsByWeaponType; // 0x8
	TArray<FYWeaponParticleSystemOverrideByDataRowHandle> m_overridePsByDataRowHandle; // 0x18
};

struct FBrushEffectCurlNoise {
	float Curl1Amount; // 0x0
	float Curl2Amount; // 0x4
	float Curl1Tiling; // 0x8
	float Curl2Tiling; // 0xc
};

struct FDatasmithMeshBuildSettingsTemplate {
	char bUseMikkTSpace : 1; // 0x0
	char bRecomputeNormals : 1; // 0x0
	char bRecomputeTangents : 1; // 0x0
	char bRemoveDegenerates : 1; // 0x0
	char bBuildAdjacencyBuffer : 1; // 0x0
	char bUseHighPrecisionTangentBasis : 1; // 0x0
	char bUseFullPrecisionUVs : 1; // 0x0
	char bGenerateLightmapUVs : 1; // 0x0
	int32_t MinLightmapResolution; // 0x4
	int32_t SrcLightmapIndex; // 0x8
	int32_t DstLightmapIndex; // 0xc
};

struct FYDailyCrateGeneratorInfo {
	FYGeneratorInfo m_generatorInfo; // 0x0
	int32_t m_crateLevel; // 0x10
	TArray<FYRewardDataTableRow> m_crateItems; // 0x18
};

struct FGroupsChangeMemberRoleRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DestinationRoleId; // 0x10
	UPlayFabJsonObject* Group; // 0x20
	TArray<UPlayFabJsonObject*> Members; // 0x28
	FString OriginRoleId; // 0x38
};

struct FRigUnit_ModifyBoneTransforms_PerBone {
	FName Bone; // 0x0
	FTransform Transform; // 0x10
};

struct FYTimestamp {
	int64_t Seconds; // 0x0
};

struct FRigUnit_AnimEasing : FRigUnit_AnimBase {
	float Value; // 0x8
	EControlRigAnimEasingType Type; // 0xc
	float SourceMinimum; // 0x10
	float SourceMaximum; // 0x14
	float TargetMinimum; // 0x18
	float TargetMaximum; // 0x1c
	float Result; // 0x20
};

struct FYCharacterCustomizationSelected : FYBaseAnalyticsEvent {
	bool gender; // 0xa8
	FString head_id; // 0xb0
	int32_t head_color_index; // 0xc0
	FString boots_id; // 0xc8
	int32_t boots_color_index; // 0xd8
	FString chest_id; // 0xe0
	int32_t chest_color_index; // 0xf0
	FString gloves_id; // 0xf8
	int32_t gloves_color_index; // 0x108
	FString base_suit_id; // 0x110
	int32_t base_suit_color_index; // 0x120
	FString archetype_id; // 0x128
	int32_t slot_id; // 0x138
};

struct FRigUnit_DebugTransformArrayMutable_WorkData {
	TArray<FTransform> DrawTransforms; // 0x0
};

struct FYLocallyAcceptedLegalAgreements {
	FString m_userIdPlatform; // 0x0
	int32_t m_NDAVersion; // 0x10
	int32_t m_EULAVersion; // 0x14
	bool m_hasAcceptedNDA; // 0x18
	bool m_hasAcceptedEULA; // 0x19
};

struct FComponentSync {
	FName Name; // 0x0
	ESyncOption SyncOption; // 0x8
};

struct FGPUSpriteResourceData {
	TArray<FColor> QuantizedColorSamples; // 0x0
	TArray<FColor> QuantizedMiscSamples; // 0x10
	TArray<FColor> QuantizedSimulationAttrSamples; // 0x20
	FVector4 ColorScale; // 0x30
	FVector4 ColorBias; // 0x40
	FVector4 MiscScale; // 0x50
	FVector4 MiscBias; // 0x60
	FVector4 SimulationAttrCurveScale; // 0x70
	FVector4 SimulationAttrCurveBias; // 0x80
	FVector4 SubImageSize; // 0x90
	FVector4 SizeBySpeed; // 0xa0
	FVector ConstantAcceleration; // 0xb0
	FVector OrbitOffsetBase; // 0xbc
	FVector OrbitOffsetRange; // 0xc8
	FVector OrbitFrequencyBase; // 0xd4
	FVector OrbitFrequencyRange; // 0xe0
	FVector OrbitPhaseBase; // 0xec
	FVector OrbitPhaseRange; // 0xf8
	float GlobalVectorFieldScale; // 0x104
	float GlobalVectorFieldTightness; // 0x108
	float PerParticleVectorFieldScale; // 0x10c
	float PerParticleVectorFieldBias; // 0x110
	float DragCoefficientScale; // 0x114
	float DragCoefficientBias; // 0x118
	float ResilienceScale; // 0x11c
	float ResilienceBias; // 0x120
	float CollisionRadiusScale; // 0x124
	float CollisionRadiusBias; // 0x128
	float CollisionTimeBias; // 0x12c
	float CollisionRandomSpread; // 0x130
	float CollisionRandomDistribution; // 0x134
	float OneMinusFriction; // 0x138
	float RotationRateScale; // 0x13c
	float CameraMotionBlurAmount; // 0x140
	EParticleScreenAlignment ScreenAlignment; // 0x144
	EParticleAxisLock LockAxisFlag; // 0x145
	FVector2D PivotOffset; // 0x148
	char bRemoveHMDRoll : 1; // 0x150
	float MinFacingCameraBlendDistance; // 0x154
	float MaxFacingCameraBlendDistance; // 0x158
};

struct FRigUnit_ConvertRotation : FRigUnit {
	FRotator Input; // 0x8
	FQuat Result; // 0x20
};

struct FYWeaponAnimations {
	TMap<EYWeaponPlayState, FYWeaponAnimationStaticData> m_weaponAnimationAssociation; // 0x0
};

struct FSolverBreakingData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	FVector AngularVelocity; // 0x18
	float Mass; // 0x24
	int32_t ParticleIndex; // 0x28
	int32_t ParticleIndexMesh; // 0x2c
};

struct FNiagaraVariableAttributeBinding {
	FNiagaraVariableBase ParamMapVariable; // 0x0
	FNiagaraVariable DataSetVariable; // 0x10
	FNiagaraVariable RootVariable; // 0x30
	ENiagaraBindingSource BindingSourceMode; // 0x50
	char bBindingExistsOnSource : 1; // 0x54
	char bIsCachedParticleValue : 1; // 0x54
};

struct FAnimNotifyQueue {
	TArray<FAnimNotifyEventReference> AnimNotifies; // 0x10
	TMap<FName, FAnimNotifyArray> UnfilteredMontageAnimNotifies; // 0x20
};

struct FCachedAnimAssetPlayerData {
	FName StateMachineName; // 0x0
	FName StateName; // 0x8
};

struct FYLiveEventModifier {
	FString ID; // 0x0
	FString Value; // 0x10
};

struct FLandscapeLayerStruct {
	ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
};

struct FNiagaraScriptDataUsageInfo {
	bool bReadsAttributeData; // 0x0
};

struct FYPlayfabRedeemCouponResult {
	FString UserId; // 0x0
	bool SUCCESS; // 0x10
	TArray<FYCustomItemInfo> GrantedItems; // 0x18
};

struct FYStabilityData {
	float m_currentStabilityValue; // 0x0
	float m_lastTimeTriggered; // 0x4
	float m_lastTimeValueIncreased; // 0x8
	float m_lastTimeValueDecreased; // 0xc
};

struct FRootMotionMovementParams {
	bool bHasRootMotion; // 0x0
	float BlendWeight; // 0x4
	FTransform RootMotionTransform; // 0x10
};

struct FServerRevokeAllBansForUserResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BanData; // 0x8
};

struct FAttributesForVertexInstance {
	FVertexInstanceID VertexInstanceID; // 0x0
	FMeshElementAttributeList VertexInstanceAttributes; // 0x8
};

struct FYFactionsContractsData {
	TArray<FYFactionContractsData> boards; // 0x0
	FYTimestamp lastBoardRefreshTimeUtc; // 0x10
};

struct FRigUnit_ToWorldSpace_Location : FRigUnit {
	FVector Location; // 0x8
	FVector World; // 0x14
};

struct FAIDataProviderValue {
	UAIDataProvider* DataBinding; // 0x10
	FName DataField; // 0x18
};

struct FClientGetTitlePublicKeyRequest : FPlayFabRequestCommon {
	FString TitleSharedSecret; // 0x8
};

struct FYClimbingCosmeticDataPerState {
	UMatineeCameraShake* m_cameraShakeStateStarted; // 0x0
};

struct FClientGetPlayFabIDsFromGameCenterIDsRequest : FPlayFabRequestCommon {
	FString GameCenterIDs; // 0x8
};

struct FBuildPromotionTestSettings {
	FFilePath DefaultStaticMeshAsset; // 0x0
	FBuildPromotionImportWorkflowSettings ImportWorkflow; // 0x10
	FBuildPromotionOpenAssetSettings OpenAssets; // 0x160
	FBuildPromotionNewProjectSettings NewProjectSettings; // 0x1c0
	FFilePath SourceControlMaterial; // 0x1e0
};

struct FYUiHofData {
	EYMatchmakeGameModeType m_gameModeToShow; // 0x0
	TMap<FString, FYRankEntries> m_gameModeTopPlayersPerSeasons; // 0x8
};

struct FGPUSpriteEmitterInfo {
	UParticleModuleRequired* RequiredModule; // 0x0
	UParticleModuleSpawn* SpawnModule; // 0x8
	UParticleModuleSpawnPerUnit* SpawnPerUnitModule; // 0x10
	TArray<UParticleModule*> SpawnModules; // 0x18
	FGPUSpriteLocalVectorFieldInfo LocalVectorField; // 0x30
	FFloatDistribution VectorFieldScale; // 0xa0
	FFloatDistribution DragCoefficient; // 0xc0
	FFloatDistribution PointAttractorStrength; // 0xe0
	FFloatDistribution Resilience; // 0x100
	FVector ConstantAcceleration; // 0x120
	FVector PointAttractorPosition; // 0x12c
	float PointAttractorRadiusSq; // 0x138
	FVector OrbitOffsetBase; // 0x13c
	FVector OrbitOffsetRange; // 0x148
	FVector2D InvMaxSize; // 0x154
	float InvRotationRateScale; // 0x15c
	float MaxLifetime; // 0x160
	int32_t MaxParticleCount; // 0x164
	EParticleScreenAlignment ScreenAlignment; // 0x168
	EParticleAxisLock LockAxisFlag; // 0x169
	char bEnableCollision : 1; // 0x16c
	EParticleCollisionMode CollisionMode; // 0x170
	char bRemoveHMDRoll : 1; // 0x174
	float MinFacingCameraBlendDistance; // 0x178
	float MaxFacingCameraBlendDistance; // 0x17c
	FRawDistributionVector DynamicColor; // 0x180
	FRawDistributionFloat DynamicAlpha; // 0x1c8
	FRawDistributionVector DynamicColorScale; // 0x1f8
	FRawDistributionFloat DynamicAlphaScale; // 0x240
};

struct FAdminGetPlayerIdFromAuthTokenResult : FPlayFabResultCommon {
	FString PlayFabId; // 0x8
};

struct FYPlayFabStoreRowBase : FTableRowBase {
	bool m_isEnabled; // 0x8
	FString m_storeId; // 0x10
	FString m_catalogVersion; // 0x20
	FText m_displayName; // 0x30
	EYGamePlatform m_platform; // 0x48
};

struct FNamedCurveValue {
	FName Name; // 0x0
	float Value; // 0x8
};

struct FMovieSceneEntitySystemGraphNode {
	UMovieSceneEntitySystem* System; // 0x20
};

struct FMovieSceneEvaluationField {
	TArray<FMovieSceneFrameRange> Ranges; // 0x0
	TArray<FMovieSceneEvaluationGroup> Groups; // 0x10
	TArray<FMovieSceneEvaluationMetaData> MetaData; // 0x20
};

struct FTViewTarget {
	AActor* Target; // 0x0
	FMinimalViewInfo POV; // 0x10
	APlayerState* PlayerState; // 0x5f0
};

struct FYCancelActiveContractResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	FString contractId; // 0x20
};

struct FOverlapResult {
	TWeakObjectPtr<AActor> Actor; // 0x0
	TWeakObjectPtr<UPrimitiveComponent> Component; // 0x8
	char bBlockingHit : 1; // 0x14
};

struct FRigUnit_ToWorldSpace_Transform : FRigUnit {
	FTransform Transform; // 0x10
	FTransform World; // 0x40
};

struct FYRequestUpgradeItemsRequest {
	FString UserId; // 0x0
	TArray<FYUpgradeEntry> upgradeEntries; // 0x10
};

struct FYArmorDataTableRow : FYItemDataTableRowBase {
	int32_t m_armorAmount; // 0x310
	TArray<FDataTableRowHandle> m_armoredHitZones; // 0x318
	TSoftObjectPtr<UObject> m_mesh; // 0x328
	TArray<FYGameplayAttributeModifier> m_attributeModifiers; // 0x350
	TArray<FDataTableRowHandle> m_perks; // 0x360
};

struct FClientAddFriendRequest : FPlayFabRequestCommon {
	FString FriendEmail; // 0x8
	FString FriendPlayFabId; // 0x18
	FString FriendTitleDisplayName; // 0x28
	FString FriendUsername; // 0x38
};

struct FBlackboardKeySelector {
	TArray<UBlackboardKeyType*> AllowedTypes; // 0x0
	FName SelectedKeyName; // 0x10
	UBlackboardKeyType* SelectedKeyType; // 0x18
	char SelectedKeyID; // 0x20
	char bNoneIsAllowedValue : 1; // 0x24
};

struct FRigUnit_ToRigSpace_Transform : FRigUnit {
	FTransform Transform; // 0x10
	FTransform Global; // 0x40
};

struct FYRarityVisualizationData {
	TSoftObjectPtr<UTexture2D> m_texture; // 0x0
	FSlateColor m_color; // 0x28
};

struct FInterpEdSelKey {
	UInterpGroup* Group; // 0x0
	UInterpTrack* Track; // 0x8
	int32_t KeyIndex; // 0x10
	float UnsnappedPosition; // 0x14
};

struct FYAICombatAnalyticsEvent : FYAIBaseAnalyticsEvent {
	int32_t time_started_when_ai_attacks; // 0xd8
	int32_t ai_damage_dealt; // 0xdc
	int32_t Status; // 0xe0
	FString player_id; // 0xe8
	int32_t shot_by_ai; // 0xf8
	int32_t hits_by_ai; // 0xfc
	int32_t weakspots_hits_by_ai; // 0x100
	int32_t location_x_player; // 0x104
	int32_t location_y_player; // 0x108
	int32_t location_z_player; // 0x10c
	FString type_of_aggro; // 0x110
};

struct FRigUnit_SetMultiControlBool_Entry {
	FName Control; // 0x0
	bool BoolValue; // 0x8
};

struct FYMatchmakingRegionSetupEntry {
	FString Region; // 0x0
	EYMatchmakingRegionOverrideOptions Option; // 0x10
};

struct FBlendTarget {
	FTransform Transform; // 0x0
	float weight; // 0x30
};

struct FYStoredModData {
	TArray<FYModEntry> m_allMods; // 0x0
};

struct FYMapRotationData {
	TArray<FYMapData> maps; // 0x0
};

struct FPoseDriverTarget {
	TArray<FPoseDriverTransform> BoneTransforms; // 0x0
	FRotator TargetRotation; // 0x10
	float TargetScale; // 0x1c
	ERBFDistanceMethod DistanceMethod; // 0x20
	ERBFFunctionType FunctionType; // 0x21
	bool bApplyCustomCurve; // 0x22
	FRichCurve CustomCurve; // 0x28
	FName DrivenName; // 0xa8
	bool bIsHidden; // 0xb8
};

struct FDestructibleSpecialHierarchyDepths {
	int32_t SupportDepth; // 0x0
	int32_t MinimumFractureDepth; // 0x4
	bool bEnableDebris; // 0x8
	int32_t DebrisDepth; // 0xc
	int32_t EssentialDepth; // 0x10
};

struct FYButtonAudio {
	FDataTableRowHandle m_pressedDTSound; // 0x0
	FDataTableRowHandle m_releasedDTSound; // 0x10
	FDataTableRowHandle m_hoveredDTSound; // 0x20
	FDataTableRowHandle m_unhoveredDTSound; // 0x30
};

struct FAdminGetContentUploadUrlResult : FPlayFabResultCommon {
	FString URL; // 0x8
};

struct FAnimNode_Slot : FAnimNode_Base {
	FPoseLink Source; // 0x10
	FName SlotName; // 0x20
	bool bAlwaysUpdateSourcePose; // 0x28
};

struct FYContractsInteractionAnalyticsEvent : FYBaseAnalyticsEvent {
	FString faction_name; // 0xa8
	FString contract1; // 0xb8
	FString contract2; // 0xc8
	FString contract3; // 0xd8
	int32_t Action; // 0xe8
};

struct FYKeyPlatformData : FYDataTableRowBase {
	FKey Key; // 0x10
	TMap<EYKeybindingInputDeviceType, TSoftObjectPtr<UTexture2D>> Icons; // 0x28
};

struct FCloudScriptListFunctionsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FYLevelMapRuntimeData {
	FVector2D m_mapBoundsCenter; // 0x0
	FVector2D m_levelSize; // 0x8
	FVector2D m_mapTextureSize; // 0x10
	bool m_initializedLevelData; // 0x18
	float m_zoom; // 0x1c
	int32_t m_handle; // 0x20
};

struct FMultiplayerCreateServerBackfillTicketResult : FPlayFabResultCommon {
	FString TicketId; // 0x8
};

struct FWrappedStringElement {
	FString Value; // 0x0
	FVector2D LineExtent; // 0x10
};

struct FHLODISMComponentDesc {
	UStaticMesh* StaticMesh; // 0x0
	UMaterialInterface* Material; // 0x8
	TArray<FTransform> Instances; // 0x10
};

struct FEngineServicePong {
	FString CurrentLevel; // 0x0
	int32_t EngineVersion; // 0x10
	bool HasBegunPlay; // 0x14
	FGuid instanceId; // 0x18
	FString InstanceType; // 0x28
	FGuid SessionId; // 0x38
	float WorldTimeSeconds; // 0x48
};

struct FRigUnit_CollectionNameSearch : FRigUnit_CollectionBase {
	FName PartialName; // 0x8
	ERigElementType TypeToSearch; // 0x10
	FRigElementKeyCollection Collection; // 0x18
	FRigElementKeyCollection CachedCollection; // 0x28
	int32_t CachedHierarchyHash; // 0x38
};

struct FAdminGetPlayerIdFromAuthTokenRequest : FPlayFabRequestCommon {
	FString Token; // 0x8
	EAuthTokenType TokenType; // 0x18
};

struct FServerGrantItemsToUsersRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	TArray<UPlayFabJsonObject*> ItemGrants; // 0x20
};

struct FYGetCharacterVanityResponse {
	bool SUCCESS; // 0x0
	FYCharacterVanity returnVanity; // 0x8
};

struct FFrameNumberRangeBound {
	ERangeBoundTypes Type; // 0x0
	FFrameNumber Value; // 0x4
};

struct FDatasmithStaticMeshImportOptions {
	EDatasmithImportLightmapMin MinLightmapResolution; // 0x0
	EDatasmithImportLightmapMax MaxLightmapResolution; // 0x1
	bool bGenerateLightmapUVs; // 0x2
	bool bRemoveDegenerates; // 0x3
};

struct FMultiplayerGetMatchResult : FPlayFabResultCommon {
	FString MatchID; // 0x8
	TArray<UPlayFabJsonObject*> Members; // 0x18
	FString RegionPreferences; // 0x28
	UPlayFabJsonObject* ServerDetails; // 0x38
};

struct FRigUnit_MathRBFInterpolateQuatColor : FRigUnit_MathRBFInterpolateQuatBase {
	TArray<FMathRBFInterpolateQuatColor_Target> Targets; // 0xd0
	FLinearColor Output; // 0xe0
};

struct FRigUnit_SetControlFloat : FRigUnitMutable {
	FName Control; // 0x68
	float weight; // 0x70
	float FloatValue; // 0x74
	FCachedRigElement CachedControlIndex; // 0x78
};

struct FYSetMissionAcknowledged {
	FString missionArcId; // 0x0
	FString missionId; // 0x10
};

struct FYEOSStatData : FYDataTableRowBase {
	FText m_translateStatName; // 0x10
	EYStatValueDisplayMethod m_displayMethod; // 0x28
	EYStatValueComparison m_comparisonMethod; // 0x29
};

struct FEnumParameterNameAndCurve {
	FName ParameterName; // 0x0
	FMovieSceneByteChannel ParameterCurve; // 0x8
};

struct FAdminGetTitleDataResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Data; // 0x8
};

struct FST_EffortData {
	FDataTableRowHandle VO_2_DACCD7C64AEC65EC53F9B7952C5B9399; // 0x0
	bool OnlyPlayOnAutonomousProxy_12_491168E947DFFD7794F07FBE4A0D03AD; // 0x10
};

struct FYSquadInviteExpired {
	FString ID; // 0x0
	FString TargetId; // 0x10
};

struct FServerRevokeBansResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BanData; // 0x8
};

struct FServerGetCharacterInventoryResult : FPlayFabResultCommon {
	FString CharacterId; // 0x8
	TArray<UPlayFabJsonObject*> Inventory; // 0x18
	FString PlayFabId; // 0x28
	UPlayFabJsonObject* VirtualCurrency; // 0x38
	UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x40
};

struct FAdminUpdateUserDataResult : FPlayFabResultCommon {
	int32_t DataVersion; // 0x8
};

struct FNegotiationTransport {
	FString Transport; // 0x0
	TArray<FString> TransferFormats; // 0x10
};

struct FMaterialParameterInfo {
	FName Name; // 0x0
	EMaterialParameterAssociation Association; // 0x8
	int32_t Index; // 0xc
};

struct FServerGetLeaderboardAroundCharacterRequest : FPlayFabRequestCommon {
	FString CharacterId; // 0x8
	FString CharacterType; // 0x18
	int32_t MaxResultsCount; // 0x28
	FString PlayFabId; // 0x30
	FString StatisticName; // 0x40
};

struct FMultiplayerJoinMatchmakingTicketRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Member; // 0x10
	FString QueueName; // 0x18
	FString TicketId; // 0x28
};

struct FSourceEffectWaveShaperSettings {
	float Amount; // 0x0
	float OutputGainDb; // 0x4
};

struct FRigBone : FRigElement {
	FName ParentName; // 0x18
	int32_t ParentIndex; // 0x20
	FTransform InitialTransform; // 0x30
	FTransform GlobalTransform; // 0x60
	FTransform LocalTransform; // 0x90
	TArray<int32_t> Dependents; // 0xc0
	ERigBoneType Type; // 0xd0
};

struct FServerRedeemMatchmakerTicketRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString LobbyId; // 0x10
	FString Ticket; // 0x20
};

struct FAdminUpdateOpenIdConnectionRequest : FPlayFabRequestCommon {
	FString ClientId; // 0x8
	FString ClientSecret; // 0x18
	FString ConnectionId; // 0x28
	FString IssuerDiscoveryUrl; // 0x38
	UPlayFabJsonObject* IssuerInformation; // 0x48
};

struct FYBIHook_GetPvpDamage : FYBaseAnalyticsEvent {
	int32_t location_x; // 0xa8
	int32_t location_y; // 0xac
	int32_t location_z; // 0xb0
	int32_t location_x_attacker; // 0xb4
	int32_t location_y_attacker; // 0xb8
	int32_t location_z_attacker; // 0xbc
	int32_t time_since_match_start; // 0xc0
	int32_t time_since_user_joined; // 0xc4
	FString equipped_weapon; // 0xc8
	int32_t health_when_attacked; // 0xd8
	int32_t attacker_damage; // 0xdc
	FString attacker_weapon_id; // 0xe0
	FString attacker_user_id; // 0xf0
};

struct FYHoursAndMinutes {
	int32_t hours24; // 0x0
	int32_t Minutes; // 0x4
};

struct FGroupsUpdateGroupRequest : FPlayFabRequestCommon {
	FString AdminRoleId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	int32_t ExpectedProfileVersion; // 0x20
	UPlayFabJsonObject* Group; // 0x28
	FString GroupName; // 0x30
	FString MemberRoleId; // 0x40
};

struct FYPlayFabBaseSquadRequest {
	FString squadId; // 0x0
};

struct FYTestBIEventData {
	int32_t IntegerField; // 0x0
	float FloatField; // 0x4
	bool BooleanField; // 0x8
	FString StringField; // 0x10
	TArray<FString> StringArray; // 0x20
	TArray<uint32_t> Blob; // 0x30
	FTestBIDataStruct DataStruct; // 0x40
	TArray<FTestBIStructForArray> ArrayOfStructs; // 0x58
};

struct FInputActionSpeechMapping {
	FName ActionName; // 0x0
	FName SpeechKeyword; // 0x8
};

struct FAdminModifyUserVirtualCurrencyResult : FPlayFabResultCommon {
	int32_t Balance; // 0x8
	int32_t BalanceChange; // 0xc
	FString PlayFabId; // 0x10
	FString VirtualCurrency; // 0x20
};

struct FYGeneratorCrateLevelToRewardsDataTableRow : FYDataTableRowBase {
	FText m_rewardsPackageName; // 0x10
	int32_t m_level; // 0x28
	TSoftObjectPtr<UDataTable> m_rewardsDropTablePath; // 0x30
	TArray<FYRewardsPoolGrantTupleRow> m_rewardsGrants; // 0x58
};

struct FFunctionExpressionOutput {
	UMaterialExpressionFunctionOutput* ExpressionOutput; // 0x0
	FGuid ExpressionOutputId; // 0x8
	FExpressionOutput Output; // 0x18
};

struct FYPickupItem {
	FText m_name; // 0x0
	int32_t m_amount; // 0x18
	FYInventoryItem m_inventoryItem; // 0x20
	TArray<FDataTableRowHandle> m_itemUpgrades; // 0xb8
	ACharacter* m_instigatedBy; // 0xc8
	UObject* m_instigatorObject; // 0xd0
	bool m_canBeSharedWithTeam; // 0xd8
	bool m_isPickUpByPlayerDrop; // 0xd9
	UYWidget_PickupPlate_Base* m_pickupWidgetOverride; // 0xe0
};

struct FYSquadInvite {
	FString ID; // 0x0
	FString fromId; // 0x10
	FString requesterDisplayName; // 0x20
	FString TargetId; // 0x30
	FString squadId; // 0x40
};

struct FRigUnit_DebugLineStrip : FRigUnit_DebugBaseMutable {
	TArray<FVector> Points; // 0x68
	FLinearColor Color; // 0x78
	float Thickness; // 0x88
	FName Space; // 0x8c
	FTransform WorldOffset; // 0xa0
	bool bEnabled; // 0xd0
};

struct FMultiplayerGetBuildResponse : FPlayFabResultCommon {
	bool AreAssetsReadonly; // 0x8
	FString BuildId; // 0x10
	FString BuildName; // 0x20
	FString BuildStatus; // 0x30
	EContainerFlavor ContainerFlavor; // 0x40
	FString ContainerRunCommand; // 0x48
	FString CreationTime; // 0x58
	UPlayFabJsonObject* CustomGameContainerImage; // 0x68
	TArray<UPlayFabJsonObject*> GameAssetReferences; // 0x70
	TArray<UPlayFabJsonObject*> GameCertificateReferences; // 0x80
	UPlayFabJsonObject* InstrumentationConfiguration; // 0x90
	UPlayFabJsonObject* MetaData; // 0x98
	int32_t MultiplayerServerCountPerVm; // 0xa0
	FString OsPlatform; // 0xa8
	TArray<UPlayFabJsonObject*> Ports; // 0xb8
	TArray<UPlayFabJsonObject*> RegionConfigurations; // 0xc8
	FString ServerType; // 0xd8
	FString StartMultiplayerServerCommand; // 0xe8
	bool UseStreamingForAssetDownloads; // 0xf8
	EAzureVmSize VmSize; // 0xf9
};

struct FClientRefreshPSNAuthTokenRequest : FPlayFabRequestCommon {
	FString AuthCode; // 0x8
	int32_t IssuerId; // 0x18
	FString RedirectUri; // 0x20
};

struct FRigUnit_GetJointTransform : FRigUnitMutable {
	FName Joint; // 0x68
	ETransformGetterType Type; // 0x70
	ETransformSpaceMode TransformSpace; // 0x71
	FTransform BaseTransform; // 0x80
	FName BaseJoint; // 0xb0
	FTransform Output; // 0xc0
};

struct FLandscapeSplineSegmentConnection {
	ULandscapeSplineControlPoint* ControlPoint; // 0x0
	float TangentLen; // 0x8
	FName SocketName; // 0xc
};

struct FPowerIKExcludedBone {
	FName BoneName; // 0x0
};

struct FExternalToolDefinition {
	FString ToolName; // 0x0
	FFilePath ExecutablePath; // 0x10
	FString CommandLineOptions; // 0x20
	FDirectoryPath WorkingDirectory; // 0x30
	FString ScriptExtension; // 0x40
	FDirectoryPath ScriptDirectory; // 0x50
};

struct FAdminRunTaskResult : FPlayFabResultCommon {
	FString TaskInstanceId; // 0x8
};

struct FYMetaDataTableRowSettings : FYDataTableRowBase {
	int32_t m_maximumGenericAwaredSoftCurrency; // 0x10
	FDataTableRowHandle m_defaultScrappingRow; // 0x18
	float m_softCurrencyRerollCost; // 0x28
};

struct FBlueprintInputAxisKeyDelegateBinding : FBlueprintInputDelegateBinding {
	FKey AxisKey; // 0x8
	FName FunctionNameToBind; // 0x20
};

struct FRigVMRegisterOffset {
	TArray<int32_t> Segments; // 0x0
	ERigVMRegisterType Type; // 0x10
	FName CPPType; // 0x14
	UScriptStruct* ScriptStruct; // 0x20
	UScriptStruct* ParentScriptStruct; // 0x28
	int32_t ArrayIndex; // 0x30
	uint16_t ElementSize; // 0x34
	FString CachedSegmentPath; // 0x38
};

struct FYNPCAnimationAssetDataRow : FYDataTableRowBase {
	bool m_randomizeEmoteAnimation; // 0x10
	TArray<FSingleAnimationPlayData> m_animationPlayData; // 0x18
};

struct FVirtualKeyboardOptions {
	bool bEnableAutocorrect; // 0x0
};

struct FAnimNode_PowerIK : FAnimNode_SkeletalControlBase {
	FName CharacterRoot; // 0xc8
	float RootRotationMultiplier; // 0xd0
	FPowerIKBodyInertia BodyInertia; // 0xd4
	TArray<FPowerIKBoneBendDirection> BendDirections; // 0xe8
	TArray<FPowerIKExcludedBone> ExcludedBones; // 0xf8
	TArray<FPowerIKBoneLimit> JointLimits; // 0x108
	TArray<FPowerIKEffector> Effectors; // 0x118
	float SmoothingMaxSpeedMultiplier; // 0x128
	float SmoothingMaxDistanceMultiplier; // 0x12c
	FPowerIKCenterOfGravity CenterOfGravityConstraint; // 0x130
	int32_t MaxSquashIterations; // 0x140
	int32_t MaxStretchIterations; // 0x144
	int32_t MaxFinalIterations; // 0x148
	bool AllowBoneTranslation; // 0x14c
	float SolverAlpha; // 0x150
	float DebugDrawSize; // 0x154
};

struct FYCurrencyItem {
	FString currencyName; // 0x0
	int32_t Amount; // 0x10
};

struct FInputAxisConfigEntry {
	FName AxisKeyName; // 0x0
	FInputAxisProperties AxisProperties; // 0x8
};

struct FYMissionProgressionUpdated {
	FString m_userId; // 0x0
	FString m_currentMissionID; // 0x10
	int32_t m_progress; // 0x20
	TArray<FYCustomItemInfo> m_rewards; // 0x28
	TArray<FYCurrencyItem> m_updatedCurrencies; // 0x38
	bool m_shouldShowPopup; // 0x48
};

struct FRigUnit_CollectionItems : FRigUnit_CollectionBase {
	TArray<FRigElementKey> Items; // 0x8
	FRigElementKeyCollection Collection; // 0x18
};

struct FYAnnouncementRequestAysncLoadData {
	FDataTableRowHandle m_rowHandle; // 0x0
	FYAnnouncementPlaybackOptions m_playbackOptions; // 0x10
};

struct FYGetBatchedRankedSeasonsRequest {
	int32_t numTopPlayers; // 0x0
};

struct FSessionServiceLog {
	FName Category; // 0x0
	FString Data; // 0x8
	FGuid instanceId; // 0x18
	double TimeSeconds; // 0x28
	char Verbosity; // 0x30
};

struct FSpriteGeometryCollection {
	TArray<FSpriteGeometryShape> Shapes; // 0x0
	ESpritePolygonMode GeometryType; // 0x10
	int32_t PixelsPerSubdivisionX; // 0x14
	int32_t PixelsPerSubdivisionY; // 0x18
	bool bAvoidVertexMerging; // 0x1c
	float AlphaThreshold; // 0x20
	float DetailAmount; // 0x24
	float SimplifyEpsilon; // 0x28
};

struct FClientLoginWithPlayFabRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* InfoRequestParameters; // 0x10
	FString Password; // 0x18
	FString Username; // 0x28
};

struct FServerWriteTitleEventRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Body; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString EventName; // 0x18
	FString Timestamp; // 0x28
};

struct FPaperTileInfo {
	UPaperTileSet* TileSet; // 0x0
	int32_t PackedTileIndex; // 0x8
};

struct FFloatCurve : FAnimCurveBase {
	FRichCurve FloatCurve; // 0x18
};

struct FServerGetLeaderboardRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t MaxResultsCount; // 0x10
	UPlayFabJsonObject* ProfileConstraints; // 0x18
	int32_t StartPosition; // 0x20
	FString StatisticName; // 0x28
	bool UseSpecificVersion; // 0x38
	int32_t Version; // 0x3c
};

struct FRigUnit_VisualDebugTransformItemSpace : FRigUnit_DebugBase {
	FTransform Value; // 0x10
	bool bEnabled; // 0x40
	float Thickness; // 0x44
	float Scale; // 0x48
	FRigElementKey Space; // 0x4c
};

struct FInterpLookupPoint {
	FName GroupName; // 0x0
	float Time; // 0x8
};

struct FYExecuteFriendStateChangeUserName {
	FString internalUserId; // 0x0
	FString Username; // 0x10
	EYFriendState stateToChangeTo; // 0x20
};

struct FBoneReductionSetting {
	TArray<FName> BonesToRemove; // 0x0
};

struct FServerGetPlayerStatisticsResult : FPlayFabResultCommon {
	FString PlayFabId; // 0x8
	TArray<UPlayFabJsonObject*> Statistics; // 0x18
};

struct FServerGetPlayFabIDsFromFacebookInstantGamesIdsRequest : FPlayFabRequestCommon {
	FString FacebookInstantGamesIds; // 0x8
};

struct FClientMatchmakeResult : FPlayFabResultCommon {
	FString Expires; // 0x8
	FString LobbyId; // 0x18
	int32_t PollWaitTimeMS; // 0x28
	FString ServerIPV4Address; // 0x30
	FString ServerIPV6Address; // 0x40
	int32_t ServerPort; // 0x50
	FString ServerPublicDNSName; // 0x58
	EMatchmakeStatus Status; // 0x68
	FString Ticket; // 0x70
};

struct FClientLinkIOSDeviceIDRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DeviceID; // 0x10
	FString DeviceModel; // 0x20
	bool ForceLink; // 0x30
	FString OS; // 0x38
};

struct FBakedDataInfo {
	FName Name; // 0x0
	int32_t Size; // 0x8
};

struct FYOverridenModData {
	UCurveFloat* m_overridenRecoilCurve; // 0x0
	FDataTableRowHandle m_transportHandle; // 0x8
	FDataTableRowHandle m_fxCategory; // 0x18
	FYFullscreenCrosshairData m_crosshairData; // 0x28
};

struct FServerGetPlayFabIDsFromFacebookIDsRequest : FPlayFabRequestCommon {
	FString FacebookIDs; // 0x8
};

struct FCustomInput {
	FName InputName; // 0x0
	FExpressionInput Input; // 0x8
};

struct FAnimNode_BlendListBase : FAnimNode_Base {
	TArray<FPoseLink> BlendPose; // 0x10
	TArray<float> BlendTime; // 0x20
	EBlendListTransitionType TransitionType; // 0x30
	EAlphaBlendOption BlendType; // 0x31
	bool bResetChildOnActivation; // 0x32
	UCurveFloat* CustomBlendCurve; // 0x38
	UBlendProfile* BlendProfile; // 0x40
};

struct FYBIHook_TutorialTnc : FYBaseAnalyticsEvent {
	int32_t step; // 0xa8
	FString Action; // 0xb0
};

struct FRigVMMemoryContainer {
	bool bUseNameMap; // 0x0
	ERigVMMemoryType MemoryType; // 0x1
	TArray<FRigVMRegister> Registers; // 0x8
	TArray<FRigVMRegisterOffset> RegisterOffsets; // 0x18
	TArray<char> Data; // 0x28
	TArray<UScriptStruct*> ScriptStructs; // 0x38
	TMap<FName, int32_t> NameMap; // 0x48
	bool bEncounteredErrorDuringLoad; // 0x98
};

struct FClothingAssetData_Legacy {
	FName AssetName; // 0x0
	FString ApexFileName; // 0x8
	bool bClothPropertiesChanged; // 0x18
	FClothPhysicsProperties_Legacy PhysicsProperties; // 0x1c
};

struct FClientStartGameRequest : FPlayFabRequestCommon {
	FString BuildVersion; // 0x8
	FString CharacterId; // 0x18
	FString CustomCommandLineData; // 0x28
	UPlayFabJsonObject* CustomTags; // 0x38
	FString GameMode; // 0x40
	ERegion Region; // 0x50
	FString StatisticName; // 0x58
};

struct FMultiplayerCreateMatchmakingTicketResult : FPlayFabResultCommon {
	FString TicketId; // 0x8
};

struct FRigUnit_AimBone : FRigUnit_HighlevelBaseMutable {
	FName Bone; // 0x68
	FRigUnit_AimBone_Target primary; // 0x70
	FRigUnit_AimBone_Target secondary; // 0x98
	float weight; // 0xc0
	bool bPropagateToChildren; // 0xc4
	FRigUnit_AimBone_DebugSettings DebugSettings; // 0xd0
	FCachedRigElement CachedBoneIndex; // 0x110
	FCachedRigElement PrimaryCachedSpace; // 0x124
	FCachedRigElement SecondaryCachedSpace; // 0x138
};

struct FInputAlphaBoolBlend {
	float BlendInTime; // 0x0
	float BlendOutTime; // 0x4
	EAlphaBlendOption BlendOption; // 0x8
	bool bInitialized; // 0x9
	UCurveFloat* CustomCurve; // 0x10
	FAlphaBlend AlphaBlend; // 0x18
};

struct FServerGetPlayerSegmentsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Segments; // 0x8
};

struct FSourceEffectEQSettings {
	TArray<FSourceEffectEQBand> EQBands; // 0x0
};

struct FMyPluginStruct {
	FString TestString; // 0x0
};

struct FCRSimSoftCollision {
	FTransform Transform; // 0x0
	ECRSimSoftCollisionType ShapeType; // 0x30
	float MinimumDistance; // 0x34
	float MaximumDistance; // 0x38
	EControlRigAnimEasingType FalloffType; // 0x3c
	float Coefficient; // 0x40
	bool bInverted; // 0x44
};

struct FRigUnit_MathVectorMakeBezierFourPoint : FRigUnit_MathVectorBase {
	FCRFourPointBezier Bezier; // 0x8
};

struct FEventGraphFastCallPair {
	UFunction* FunctionToPatch; // 0x0
	int32_t EventGraphCallOffset; // 0x8
};

struct FRigUnit_MathFloatBinaryOp : FRigUnit_MathFloatBase {
	float A; // 0x8
	float B; // 0xc
	float Result; // 0x10
};

struct FYItemRecipe {
	TArray<FYItemRecipeIngredient> m_itemRecipeIngredients; // 0x0
	int32_t m_upgradeTimeMinutes; // 0x10
	FYCostEntryRow m_skipCraftingMaxCost; // 0x18
};

struct FSlotEvaluationPose {
	EAdditiveAnimationType AdditiveType; // 0x0
	float weight; // 0x4
};

struct FSubmixEffectSubmixEQSettings {
	TArray<FSubmixEffectEQBand> EQBands; // 0x0
};

struct FServerListUsersCharactersRequest : FPlayFabRequestCommon {
	FString PlayFabId; // 0x8
};

struct FYSeasonRewardLevel {
	int32_t m_unlockXP; // 0x0
	TArray<FDataTableRowHandle> m_basicRewards; // 0x8
	TArray<FDataTableRowHandle> m_paidRewards; // 0x18
};

struct FScrollBorderStyle : FSlateWidgetStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
};

struct FYRequestUserChangeStation {
	FString Context; // 0x0
	FYStationConnect connectData; // 0x10
};

struct FYFindActivityLocationsRequestData {
	int32_t m_amount; // 0x0
	EYActivityType m_type; // 0x4
	float m_minimumDistanceToPlayers; // 0x8
	AYActivityLocationLinked* m_areaLinkedLocationFilter; // 0x10
};

struct FRootMotionSourceGroup {
	char bHasAdditiveSources : 1; // 0x28
	char bHasOverrideSources : 1; // 0x28
	char bHasOverrideSourcesWithIgnoreZAccumulate : 1; // 0x28
	char bIsAdditiveVelocityApplied : 1; // 0x28
	FRootMotionSourceSettings LastAccumulatedSettings; // 0x29
	FVector_NetQuantize10 LastPreAdditiveVelocity; // 0x2c
};

struct FYContractsProgress {
	TArray<FYContractProgress> activeContractsProgressClamp; // 0x0
};

struct FYSortingRequest {
	TArray<FDataTableRowHandle> m_items; // 0x0
	FString m_userId; // 0x10
	EYSortingRequestType m_type; // 0x20
	bool m_sortAlphabetical; // 0x21
};

struct FInlineTextImageStyle : FSlateWidgetStyle {
	FSlateBrush Image; // 0x8
	int16_t Baseline; // 0x90
};

struct FControlRigSequenceObjectReferenceMap {
	TArray<FGuid> BindingIds; // 0x0
	TArray<FControlRigSequenceObjectReferences> References; // 0x10
};

struct FYInventoryItem {
	FString m_customItemID; // 0x0
	FDataTableRowHandle m_item; // 0x10
	EYItemRarityType m_rarityType; // 0x20
	int32_t m_amount; // 0x24
	int32_t m_durability; // 0x28
	float m_weight; // 0x2c
	FYStoredModData m_mods; // 0x30
	TArray<FDataTableRowHandle> m_vanityEntries; // 0x40
	FYProspectorBadgeData m_prospectorBadgeData; // 0x50
	FDataTableRowHandle m_insurance; // 0x88
};

struct FYPlayerInventory {
	int32_t m_permutationIndex; // 0x0
	int32_t m_inventoryComponentId; // 0x4
	TArray<FYInventoryItem> m_replicatedItems; // 0x8
};

struct FYAIAggroTuning {
	float m_weightDistance; // 0x0
	float m_weightToken; // 0x4
	float m_weightNotInDBNO; // 0x8
	float m_weightTypeBonus; // 0xc
	float m_weightDamageReceived; // 0x10
	float m_weightVisibility; // 0x14
	float m_weightTimeSinceLastSeen; // 0x18
	float m_weightTimeTargetAcquired; // 0x1c
	float m_lastSeenTimeout; // 0x20
	float m_lastSharedSenseTimeout; // 0x24
	float m_lastHeardTimeout; // 0x28
	float m_distanceReference; // 0x2c
	float m_minDistanceToBeInvisibleInsideHideableFoliage; // 0x30
	float m_distancePanicThresholdForPlayer; // 0x34
	float m_distancePanicPlayerMultiplier; // 0x38
	float m_targetTypePlayerBonus; // 0x3c
	float m_acquireTimeMax; // 0x40
	float m_acquireTimeMin; // 0x44
	float m_damageReceivedDecayPerSecond; // 0x48
	float m_damageReceivedMax; // 0x4c
};

struct FYPlayerCharacterStateDelegateBinding {
	FMulticastInlineDelegate OnStateDeActivated; // 0x0
	FMulticastInlineDelegate OnStateActivated; // 0x10
	TArray<FDelegate> m_activationDelegates; // 0x20
	TArray<FDelegate> m_deactivationDelegates; // 0x30
};

struct FClientCreateSharedGroupRequest : FPlayFabRequestCommon {
	FString SharedGroupId; // 0x8
};

struct FYActiveWeaponCharacterInitializationData {
	FString m_customItemID; // 0x0
	FDataTableRowHandle m_rowHandle; // 0x10
	FYStoredModData m_mods; // 0x20
	TArray<FDataTableRowHandle> m_gearStoreUpgrades; // 0x30
	TArray<FDataTableRowHandle> m_vanityEntries; // 0x40
};

struct FRigUnit_DebugRectangleItemSpace : FRigUnit_DebugBaseMutable {
	FTransform Transform; // 0x70
	FLinearColor Color; // 0xa0
	float Scale; // 0xb0
	float Thickness; // 0xb4
	FRigElementKey Space; // 0xb8
	FTransform WorldOffset; // 0xd0
	bool bEnabled; // 0x100
};

struct FMultiplayerListPartyQosServersResponse : FPlayFabResultCommon {
	int32_t PageSize; // 0x8
	TArray<UPlayFabJsonObject*> QosServers; // 0x10
	FString SkipToken; // 0x20
};

struct FYMulticastHitscanReplicationData {
	TArray<FYHitscanTraceEntry> m_traceEntries; // 0x0
	FDataTableRowHandle m_transportDataTableRow; // 0x10
	FDataTableRowHandle m_impactDataTableRow; // 0x20
	FDataTableRowHandle m_damageOriginTableRow; // 0x30
	AActor* m_owner; // 0x40
};

struct FServerUnlockContainerItemResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> GrantedItems; // 0x8
	FString UnlockedItemInstanceId; // 0x18
	FString UnlockedWithItemInstanceId; // 0x28
	UPlayFabJsonObject* VirtualCurrency; // 0x38
};

struct FClientRegisterPlayFabUserResult : FPlayFabResultCommon {
	UPlayFabJsonObject* EntityToken; // 0x8
	FString PlayFabId; // 0x10
	FString SessionTicket; // 0x20
	UPlayFabJsonObject* SettingsForUser; // 0x30
	FString Username; // 0x38
};

struct FClientGetTitleDataRequest : FPlayFabRequestCommon {
	FString Keys; // 0x8
	FString OverrideLabel; // 0x18
};

struct FYUpdatePlayerActiveContractsRequest {
	FString UserId; // 0x0
	TArray<FYContractProgressData> contractsProgress; // 0x10
};

struct FAnimSlotInfo {
	FName SlotName; // 0x0
	TArray<float> ChannelWeights; // 0x8
};

struct FYMute {
	FString UserId; // 0x0
	int32_t durationSeconds; // 0x10
	EYMuteReason Reason; // 0x14
};

struct FMovieSceneEventSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneEventSectionData eventData; // 0x20
	char bFireEventsWhenForwards : 1; // 0xa8
	char bFireEventsWhenBackwards : 1; // 0xa8
};

struct FHierarchicalSimplification {
	float TransitionScreenSize; // 0x0
	float OverrideDrawDistance; // 0x4
	char bUseOverrideDrawDistance : 1; // 0x8
	char bAllowSpecificExclusion : 1; // 0x8
	char bSimplifyMesh : 1; // 0x8
	char bOnlyGenerateClustersForVolumes : 1; // 0x8
	char bReusePreviousLevelClusters : 1; // 0x8
	FMeshProxySettings ProxySetting; // 0xc
	FMeshMergingSettings MergeSetting; // 0xb4
	float DesiredBoundRadius; // 0x154
	float DesiredFillingPercentage; // 0x158
	int32_t MinNumberOfActorsToBuild; // 0x15c
};

struct FAnimNode_Fabrik : FAnimNode_SkeletalControlBase {
	FTransform EffectorTransform; // 0xd0
	FBoneSocketTarget EffectorTarget; // 0x100
	FBoneReference TipBone; // 0x160
	FBoneReference RootBone; // 0x170
	float Precision; // 0x180
	int32_t MaxIterations; // 0x184
	EBoneControlSpace EffectorTransformSpace; // 0x188
	EBoneRotationSource EffectorRotationSource; // 0x189
};

struct FVehicleTransmissionData {
	bool bUseGearAutoBox; // 0x0
	float GearSwitchTime; // 0x4
	float GearAutoBoxLatency; // 0x8
	float FinalRatio; // 0xc
	TArray<FVehicleGearData> ForwardGears; // 0x10
	float ReverseGearRatio; // 0x20
	float NeutralGearUpRatio; // 0x24
	float ClutchStrength; // 0x28
};

struct FSpinBoxStyle : FSlateWidgetStyle {
	FSlateBrush BackgroundBrush; // 0x8
	FSlateBrush HoveredBackgroundBrush; // 0x90
	FSlateBrush ActiveFillBrush; // 0x118
	FSlateBrush InactiveFillBrush; // 0x1a0
	FSlateBrush ArrowsImage; // 0x228
	FSlateColor ForegroundColor; // 0x2b0
	FMargin TextPadding; // 0x2d8
};

struct FMultiplayerListQosServersForTitleRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool IncludeAllRegions; // 0x10
};

struct FYModifyCustomItemResult {
	FString UserId; // 0x0
	bool SUCCESS; // 0x10
	TArray<FYCustomItemInfo> itemsUpdated; // 0x18
	TArray<FString> itemsRemoved; // 0x28
};

struct FRigUnit_DebugArcItemSpace : FRigUnit_DebugBaseMutable {
	FTransform Transform; // 0x70
	FLinearColor Color; // 0xa0
	float Radius; // 0xb0
	float MinimumDegrees; // 0xb4
	float MaximumDegrees; // 0xb8
	float Thickness; // 0xbc
	int32_t Detail; // 0xc0
	FRigElementKey Space; // 0xc4
	FTransform WorldOffset; // 0xd0
	bool bEnabled; // 0x100
};

struct FServerRefreshGameServerInstanceHeartbeatRequest : FPlayFabRequestCommon {
	FString LobbyId; // 0x8
};

struct FAdminDeleteMasterPlayerAccountResult : FPlayFabResultCommon {
	FString JobReceiptId; // 0x8
	FString TitleIds; // 0x18
};

struct FMovieSceneTransformMask {
	uint32_t Mask; // 0x0
};

struct FClientLinkGoogleAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool ForceLink; // 0x10
	FString ServerAuthCode; // 0x18
};

struct FMovieSceneGeometryCacheSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneGeometryCacheSectionTemplateParameters Params; // 0x20
};

struct FRigUnit_GetControlInteger : FRigUnit {
	FName Control; // 0x8
	int32_t IntegerValue; // 0x10
	int32_t Minimum; // 0x14
	int32_t Maximum; // 0x18
	FCachedRigElement CachedControlIndex; // 0x1c
};

struct FYUpdateReadStateResponse {
	EYUpdateReadStateResult returnResult; // 0x0
	FString messageId; // 0x8
	bool hasRead; // 0x18
};

struct FAdminGetPlayerSegmentsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Segments; // 0x8
};

struct FExperimentationGetExperimentsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Experiments; // 0x8
};

struct FTransformParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel Translation[0x3]; // 0x8
	FMovieSceneFloatChannel Rotation[0x3]; // 0x1e8
	FMovieSceneFloatChannel Scale[0x3]; // 0x3c8
};

struct FYPersistentMatchReset {
	FString UserId; // 0x0
};

struct FRigUnit_AlphaInterp : FRigUnit_SimBase {
	float Value; // 0x8
	float Scale; // 0xc
	float Bias; // 0x10
	bool bMapRange; // 0x14
	FInputRange InRange; // 0x18
	FInputRange OutRange; // 0x20
	bool bClampResult; // 0x28
	float ClampMin; // 0x2c
	float ClampMax; // 0x30
	bool bInterpResult; // 0x34
	float InterpSpeedIncreasing; // 0x38
	float InterpSpeedDecreasing; // 0x3c
	float Result; // 0x40
	FInputScaleBiasClamp ScaleBiasClamp; // 0x44
};

struct FYVPToRewarsdDataTableRow : FYDataTableRowBase {
	FText m_rewardsPackageName; // 0x10
	int32_t m_vpThreshold; // 0x28
	TSoftObjectPtr<UDataTable> m_rewardsDropTablePath; // 0x30
};

struct FAnimNode_ModifyCurve : FAnimNode_Base {
	FPoseLink SourcePose; // 0x10
	TArray<float> CurveValues; // 0x20
	TArray<FName> CurveNames; // 0x30
	float Alpha; // 0x50
	EModifyCurveApplyMode ApplyMode; // 0x54
};

struct FNegotiationResponse {
	int32_t NegotiateVersion; // 0x0
	FString ConnectionId; // 0x8
	FString ConnectionToken; // 0x18
	FString URL; // 0x28
	FString AccessToken; // 0x38
	FString Error; // 0x48
	TArray<FNegotiationTransport> AvailableTransports; // 0x58
};

struct FYAbilityActionSurveillanceData : FYAbilityActionDataTableRow {
	float m_radius; // 0x78
};

struct FStructure_DeveloperCredits {
	FText Department_9_0EA9FE534C653A4FD65C78B8B079FD73; // 0x0
	FText Role_10_2FF3DD614F25ED22B8737CA8063EA90C; // 0x18
	FText Name_8_BC4B8E2E41DD181723F964A585391D2D; // 0x30
};

struct FYAIMeleeAttackDefinition {
	FGameplayTag m_requiredComboTag; // 0x0
	bool m_predictProjectilePath; // 0x8
	FPredictProjectilePathParams m_predictProjectilePathParameters; // 0x10
	float m_minDistanceToPredictedHitToAllowAttack; // 0x70
	float m_meleeAttackRangeMin; // 0x74
	float m_meleeAttackRangeMax; // 0x78
	float m_velocityOwnerMin; // 0x7c
	float m_blockTime; // 0x80
	float m_meleeAttackDot2D; // 0x84
	float m_meleeAttackMaxVelocityPredicition; // 0x88
	float m_meleeDamageCheckDistanceOffset; // 0x8c
	FDataTableRowHandle m_meleeAttack; // 0x90
	TArray<TSoftObjectPtr<UAnimMontage>> m_meleeAttackMontages; // 0xa0
};

struct FSynthKnobStyle : FSlateWidgetStyle {
	FSlateBrush LargeKnob; // 0x8
	FSlateBrush LargeKnobOverlay; // 0x90
	FSlateBrush MediumKnob; // 0x118
	FSlateBrush MediumKnobOverlay; // 0x1a0
	float MinValueAngle; // 0x228
	float MaxValueAngle; // 0x22c
	ESynthKnobSize KnobSize; // 0x230
};

struct FYSessionUserData {
	FString activeSessionId; // 0x0
	uint64_t utcLastTimeChanged; // 0x10
	int32_t matchState; // 0x18
};

struct FVehicleGearData {
	float Ratio; // 0x0
	float DownRatio; // 0x4
	float UpRatio; // 0x8
};

struct FYLeaderBoardEntryData {
	FString m_playerName; // 0x0
	int32_t m_playerRank; // 0x10
	int32_t m_playerPlacement; // 0x14
	bool m_isPlaced; // 0x18
	bool m_isLocalPlayer; // 0x19
};

struct FNiagaraTypeDefinition {
	UObject* ClassStructOrEnum; // 0x0
	uint16_t UnderlyingType; // 0x8
};

struct FNiagaraMeshMaterialOverride {
	UMaterialInterface* ExplicitMat; // 0x0
	FNiagaraUserParameterBinding UserParamBinding; // 0x8
};

struct FPlayFabBaseModel {
	FPlayFabError responseError; // 0x0
	UPlayFabJsonObject* responseData; // 0x38
};

struct FYPooledActorEntry {
	AActor* m_actor; // 0x0
	char m_isInUse : 1; // 0x8
};

struct FYGetBatchedRankedSeasonsResponse {
	FYRankSeasonsData hofData; // 0x0
	FYPlayersRankedSeasonData topNPlayersActiveRankedSeason; // 0x10
	FYPlayerRankedSeasonData localPlayerRankedSeasonData; // 0x20
};

struct FRigUnit_MapRange_Float : FRigUnit {
	float Value; // 0x8
	float MinIn; // 0xc
	float MaxIn; // 0x10
	float MinOut; // 0x14
	float MaxOut; // 0x18
	float Result; // 0x1c
};

struct FYCharacterCustomizationSlotRow : FYDataTableRowBase {
	FText m_name; // 0x10
	TSoftObjectPtr<UTexture2D> m_icon; // 0x28
	EYCustomizationCategory m_category; // 0x50
	FName m_defaultSocketAttachmentName; // 0x54
	bool m_containColorSelection; // 0x5c
	bool m_visualizedOnlyAtCustomizationItemPreview; // 0x5d
};

struct FYLootItemDataTableRow : FYItemDataTableRowBase {
	EYPickupType m_type; // 0x310
	TSoftClassPtr<UObject> m_pickupActorClass; // 0x318
	FDataTableRowHandle m_additionalRowHandle; // 0x340
	bool m_disableAfterInteractionCompleted; // 0x350
	TArray<TSoftObjectPtr<UObject>> m_meshes; // 0x358
	bool m_showInteractionWidget; // 0x368
	bool m_showNotificationMessage; // 0x369
	bool m_displayItemAmount; // 0x36a
	bool m_showActorUIComponent; // 0x36b
	TSoftClassPtr<UObject> m_widgetClass; // 0x370
	FYActorUIWidgetData m_uiWidgetData; // 0x398
	bool m_blockMovementWhileInteracting; // 0x438
	FDataTableRowHandle m_pickUpSoundRowHandle; // 0x440
};

struct FRigUnit_MathTransformSelectBool : FRigUnit_MathTransformBase {
	bool Condition; // 0x8
	FTransform IfTrue; // 0x10
	FTransform IfFalse; // 0x40
	FTransform Result; // 0x70
};

struct FMultiplayerDeleteCertificateRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Name; // 0x10
};

struct FYWeaponTransportPhysicActorData {
	AActor* m_actorClass; // 0x0
	float m_initialActorSpeed; // 0x8
	float m_initialActorOffset; // 0xc
};

struct FServerGrantCharacterToUserResult : FPlayFabResultCommon {
	FString CharacterId; // 0x8
};

struct FClientAddGenericIDRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* GenericId; // 0x8
};

struct FPerSkeletonAnimationSharingSetup {
	USkeleton* Skeleton; // 0x0
	USkeletalMesh* SkeletalMesh; // 0x8
	UAnimSharingTransitionInstance* BlendAnimBlueprint; // 0x10
	UAnimSharingAdditiveInstance* AdditiveAnimBlueprint; // 0x18
	UAnimationSharingStateProcessor* StateProcessorClass; // 0x20
	TArray<FAnimationStateEntry> AnimationStates; // 0x28
};

struct FYWeaponSuitableModsCombination {
	TArray<FName> m_modCombinations; // 0x0
};

struct FYShopRelevantDataUpdated {
	FYCurrency Currency; // 0x0
	TArray<FYShopPromotion> shopPromotions; // 0x8
	TArray<FYShopOffer> shopOffers; // 0x18
};

struct FYSetUserDataRequest {
	TMap<FString, FString> m_keysValues; // 0x0
	FString m_playfabId; // 0x50
	bool m_readOnly; // 0x60
};

struct FRigUnit_MathQuaternionRotationOrder : FRigUnit_MathBase {
	EControlRigRotationOrder RotationOrder; // 0x8
};

struct FYCollectibleLootBucketRow : FYDataTableRowBase {
	TArray<FDataTableRowHandle> m_bucketItems; // 0x10
};

struct FYAttachment {
	FString ID; // 0x0
	EYAttachmentType attachmentType; // 0x10
	FString attachmentTypeId; // 0x18
};

struct FProfilesSetGlobalPolicyRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	TArray<UPlayFabJsonObject*> Permissions; // 0x10
};

struct FLevelSequenceCameraSettings {
	bool bOverrideAspectRatioAxisConstraint; // 0x0
	EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x1
};

struct FYAISquadDefinition {
	float m_spawnWeight; // 0x0
	TArray<FYSpawnTypeInfo> m_ais; // 0x8
};

struct FYCharacterCustomizationRowBase : FYVanityItemRowBase {
	TSoftObjectPtr<USkeletalMesh> m_skelMesh1stP; // 0x378
	UAnimMontage* m_animationToPlayWhenActivated; // 0x3a0
	UAnimSequence* m_animationSequence; // 0x3a8
	TSoftObjectPtr<USkeletalMesh> m_skelMesh3rdP; // 0x3b0
	TArray<FYCharacterCustomizationPieceCollection> m_materialCollections; // 0x3d8
	FName m_socketOverrideAttachName; // 0x3e8
	int32_t m_materialIndexOverride; // 0x3f0
	EYCustomizationBodyType m_bodyType; // 0x3f4
	EYCustomizationCategory m_customizationCategoryType; // 0x3f5
	bool m_shouldMerge; // 0x3f6
	bool m_shouldShowIngame; // 0x3f7
	bool m_ignoreForAutomationTests; // 0x3f8
	bool m_applyRefPoseOverride; // 0x3f9
	float m_duration; // 0x3fc
};

struct FChaosPhysicsSettings {
	EChaosThreadingMode DefaultThreadingModel; // 0x0
	EChaosSolverTickMode DedicatedThreadTickMode; // 0x1
	EChaosBufferMode DedicatedThreadBufferMode; // 0x2
};

struct FRigUnit_SetSpaceInitialTransform : FRigUnitMutable {
	FName SpaceName; // 0x68
	FTransform Transform; // 0x70
	FTransform Result; // 0xa0
	EBoneGetterSetterMode Space; // 0xd0
	FCachedRigElement CachedSpaceIndex; // 0xd4
};

struct FMovieSceneFieldEntry_ChildTemplate {
	uint16_t ChildIndex; // 0x0
	ESectionEvaluationFlags Flags; // 0x2
	FFrameNumber ForcedTime; // 0x4
};

struct FRigUnit_CCDIKPerItem : FRigUnit_HighlevelBaseMutable {
	FRigElementKeyCollection Items; // 0x68
	FTransform EffectorTransform; // 0x80
	float Precision; // 0xb0
	float weight; // 0xb4
	int32_t MaxIterations; // 0xb8
	bool bStartFromTail; // 0xbc
	float BaseRotationLimit; // 0xc0
	TArray<FRigUnit_CCDIK_RotationLimitPerItem> RotationLimits; // 0xc8
	bool bPropagateToChildren; // 0xd8
	FRigUnit_CCDIK_WorkData WorkData; // 0xe0
};

struct FYProspectorRankRow : FYDataTableRowBase {
	FText m_rankAsText; // 0x10
	int32_t m_startRank; // 0x28
};

struct FRigUnit_BinaryTransformOp : FRigUnit {
	FTransform Argument0; // 0x10
	FTransform Argument1; // 0x40
	FTransform Result; // 0x70
};

struct FBakedCustomAttributePerBoneData {
	int32_t BoneTreeIndex; // 0x0
	TArray<FBakedStringCustomAttribute> StringAttributes; // 0x8
	TArray<FBakedIntegerCustomAttribute> IntAttributes; // 0x18
	TArray<FBakedFloatCustomAttribute> FloatAttributes; // 0x28
};

struct FSubmixEffectEQBand {
	float Frequency; // 0x0
	float Bandwidth; // 0x4
	float GainDb; // 0x8
	char bEnabled : 1; // 0xc
};

struct FYPendingSquadInvites {
	TArray<FYSquadInvite> invites; // 0x0
};

struct FDataInitiateFileUploadsResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	int32_t ProfileVersion; // 0x10
	TArray<UPlayFabJsonObject*> UploadDetails; // 0x18
};

struct FClientUpdateUserDataRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Data; // 0x10
	FString KeysToRemove; // 0x18
	EUserDataPermission Permission; // 0x28
};

struct FYRemoveFriendRequestResult {
	FString UserId; // 0x0
	FString OperationId; // 0x10
	EYFriendActionResult Result; // 0x20
};

struct FNiagaraSystemCompiledData {
	FNiagaraParameterStore InstanceParamStore; // 0x0
	FNiagaraDataSetCompiledData DataSetCompiledData; // 0x78
	FNiagaraDataSetCompiledData SpawnInstanceParamsDataSetCompiledData; // 0xb8
	FNiagaraDataSetCompiledData UpdateInstanceParamsDataSetCompiledData; // 0xf8
	FNiagaraParameterDataSetBindingCollection SpawnInstanceGlobalBinding; // 0x138
	FNiagaraParameterDataSetBindingCollection SpawnInstanceSystemBinding; // 0x158
	FNiagaraParameterDataSetBindingCollection SpawnInstanceOwnerBinding; // 0x178
	TArray<FNiagaraParameterDataSetBindingCollection> SpawnInstanceEmitterBindings; // 0x198
	FNiagaraParameterDataSetBindingCollection UpdateInstanceGlobalBinding; // 0x1a8
	FNiagaraParameterDataSetBindingCollection UpdateInstanceSystemBinding; // 0x1c8
	FNiagaraParameterDataSetBindingCollection UpdateInstanceOwnerBinding; // 0x1e8
	TArray<FNiagaraParameterDataSetBindingCollection> UpdateInstanceEmitterBindings; // 0x208
};

struct FPlane : FVector {
	float W; // 0xc
};

struct FLandscapeLayer {
	FGuid Guid; // 0x0
	FName Name; // 0x10
	bool bVisible; // 0x18
	bool bLocked; // 0x19
	float HeightmapAlpha; // 0x1c
	float WeightmapAlpha; // 0x20
	ELandscapeBlendMode BlendMode; // 0x24
	TArray<FLandscapeLayerBrush> Brushes; // 0x28
	TMap<ULandscapeLayerInfoObject*, bool> WeightmapLayerAllocationBlend; // 0x38
};

struct FBakedStringCustomAttribute {
	FName AttributeName; // 0x0
	FStringCurve StringCurve; // 0x8
};

struct FYGetUserDataRequest {
	TArray<FString> m_keys; // 0x0
	FString m_playfabId; // 0x10
	bool m_readOnly; // 0x20
};

struct FConstraintData {
	FConstraintDescriptor Constraint; // 0x0
	float weight; // 0x10
	bool bMaintainOffset; // 0x14
	FTransform Offset; // 0x20
	FTransform CurrentTransform; // 0x50
};

struct FRigUnit_NoiseFloat : FRigUnit_MathBase {
	float Value; // 0x8
	float Speed; // 0xc
	float Frequency; // 0x10
	float Minimum; // 0x14
	float Maximum; // 0x18
	float Result; // 0x1c
	float Time; // 0x20
};

struct FAdminUpdatePlayerSharedSecretRequest : FPlayFabRequestCommon {
	bool Disabled; // 0x8
	FString FriendlyName; // 0x10
	FString SecretKey; // 0x20
};

struct FAdminDeleteMasterPlayerAccountRequest : FPlayFabRequestCommon {
	FString MetaData; // 0x8
	FString PlayFabId; // 0x18
};

struct FClientAttributeInstallRequest : FPlayFabRequestCommon {
	FString Adid; // 0x8
	FString Idfa; // 0x18
};

struct FSpriteGeometryShape {
	ESpriteShapeType ShapeType; // 0x0
	TArray<FVector2D> Vertices; // 0x8
	FVector2D BoxSize; // 0x18
	FVector2D BoxPosition; // 0x20
	float Rotation; // 0x28
	bool bNegativeWinding; // 0x2c
};

struct FYClientSkillUpdated {
	int32_t skill; // 0x0
	int32_t deviation; // 0x4
};

struct FYMovementCosmeticDataPerState {
	UMatineeCameraShake* m_cameraShakeStateActivated; // 0x0
	UMatineeCameraShake* m_cameraShakeStateDeactivated; // 0x8
};

struct FYRequestServerMapResult {
	FYGameInfo GameInfo; // 0x0
};

struct FYVanityBackendItemInfo {
	FString vanity_id; // 0x0
	int32_t Amount; // 0x10
};

struct FWidgetAnimationBinding {
	FName WidgetName; // 0x0
	FName SlotWidgetName; // 0x8
	FGuid AnimationGuid; // 0x10
	bool bIsRootWidget; // 0x20
};

struct FRigUnit_KalmanTransform : FRigUnit_SimBase {
	FTransform Value; // 0x10
	int32_t BufferSize; // 0x40
	FTransform Result; // 0x50
	TArray<FTransform> Buffer; // 0x80
	int32_t LastInsertIndex; // 0x90
};

struct FYResourceSessionRequestData {
	FYSessionResourceUserEntry m_sessionUserEntry; // 0x0
	bool m_clearResources; // 0x20
	bool m_forceRefreshEvaluateState; // 0x21
};

struct FControlRigComponentMappedCurve {
	FName Source; // 0x0
	FName Target; // 0x8
};

struct FLightmassPrimitiveSettings {
	char bUseTwoSidedLighting : 1; // 0x0
	char bShadowIndirectOnly : 1; // 0x0
	char bUseEmissiveForStaticLighting : 1; // 0x0
	char bUseVertexNormalForHemisphereGather : 1; // 0x0
	float EmissiveLightFalloffExponent; // 0x4
	float EmissiveLightExplicitInfluenceRadius; // 0x8
	float EmissiveBoost; // 0xc
	float DiffuseBoost; // 0x10
	float FullyOccludedSamplesFraction; // 0x14
};

struct FWaterCurveSettings {
	bool bUseCurveChannel; // 0x0
	UCurveFloat* ElevationCurveAsset; // 0x8
	float ChannelEdgeOffset; // 0x10
	float ChannelDepth; // 0x14
	float CurveRampWidth; // 0x18
};

struct FClientWriteClientCharacterEventRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Body; // 0x8
	FString CharacterId; // 0x10
	UPlayFabJsonObject* CustomTags; // 0x20
	FString EventName; // 0x28
	FString Timestamp; // 0x38
};

struct FSoundClassAdjuster {
	USoundClass* SoundClassObject; // 0x0
	float VolumeAdjuster; // 0x8
	float PitchAdjuster; // 0xc
	float LowPassFilterFrequency; // 0x10
	char bApplyToChildren : 1; // 0x14
	float VoiceCenterChannelVolumeAdjuster; // 0x18
};

struct FRootMotionSource_RadialForce : FRootMotionSource {
	FVector Location; // 0x98
	AActor* LocationActor; // 0xa8
	float Radius; // 0xb0
	float Strength; // 0xb4
	bool bIsPush; // 0xb8
	bool bNoZForce; // 0xb9
	UCurveFloat* StrengthDistanceFalloff; // 0xc0
	UCurveFloat* StrengthOverTime; // 0xc8
	bool bUseFixedWorldDirection; // 0xd0
	FRotator FixedWorldDirection; // 0xd4
};

struct FYPlayerAwarenessTuningDataTableRow : FYDataTableRowBase {
	int32_t m_maxNotificationDistance; // 0x10
	int32_t m_targetingMaxNotificationDistance; // 0x14
	float m_dotProduct; // 0x18
	float m_dotScalingDistancePerMeterMultiplier; // 0x1c
	float m_dotMaxmimumThreshold; // 0x20
	float m_requiredAimAtDuration; // 0x24
	float m_requiredAimAtDurationTargeting; // 0x28
};

struct FPurchaseInfo {
	FString Identifier; // 0x0
	FString DisplayName; // 0x10
	FString DisplayDescription; // 0x20
	FString DisplayPrice; // 0x30
};

struct FMediaCaptureDevice {
	FText DisplayName; // 0x0
	FString URL; // 0x18
};

struct FYInviteToSquadByNameResponse {
	EYSquadInviteResult Result; // 0x0
};

struct FYConnectionLatencyData {
	int32_t m_totalSamplesNetSaturated; // 0x0
	TArray<float> m_ue4ExactPing; // 0x8
	TArray<float> m_latencySamples; // 0x18
};

struct FMovieSceneCameraAnimSectionData {
	UCameraAnim* CameraAnim; // 0x0
	float PlayRate; // 0x8
	float PlayScale; // 0xc
	float BlendInTime; // 0x10
	float BlendOutTime; // 0x14
	bool bLooping; // 0x18
};

struct FYRaritySettingsEntry {
	float m_seedChance; // 0x0
	TArray<FYRarityItemRoll> m_rarityItemRolls; // 0x8
};

struct FYCurrentlyOverlappingFoliage {
	EPhysicalSurface m_surface; // 0x0
	UAudioComponent* m_audioComponent; // 0x8
	FDataTableRowHandle m_effect; // 0x10
	float m_timeElapsed; // 0x20
};

struct FRigUnit_MathRBFInterpolateQuatBase : FRigUnit_MathRBFInterpolateBase {
	FQuat Input; // 0x10
	ERBFQuatDistanceType DistanceFunction; // 0x20
	ERBFKernelType SmoothingFunction; // 0x21
	float SmoothingAngle; // 0x24
	bool bNormalizeOutput; // 0x28
	FVector TwistAxis; // 0x2c
	FRigUnit_MathRBFInterpolateQuatWorkData WorkData; // 0x40
};

struct FBlueprintInputActionDelegateBinding : FBlueprintInputDelegateBinding {
	FName inputActionName; // 0x4
	EInputEvent InputKeyEvent; // 0xc
	FName FunctionNameToBind; // 0x10
};

struct FServerLinkPSNAccountRequest : FPlayFabRequestCommon {
	FString AuthCode; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	bool ForceLink; // 0x20
	int32_t IssuerId; // 0x24
	FString PlayFabId; // 0x28
	FString RedirectUri; // 0x38
};

struct FNamedTransform {
	FTransform Value; // 0x0
	FName Name; // 0x30
};

struct FYButtonClickedEvent : FYBaseAnalyticsEvent {
	FString button_name; // 0xa8
	FString parent_name; // 0xb8
};

struct FAnimBlueprintFunction {
	FName Name; // 0x0
	FName Group; // 0x8
	int32_t OutputPoseNodeIndex; // 0x10
	TArray<FName> InputPoseNames; // 0x18
	TArray<int32_t> InputPoseNodeIndices; // 0x28
	bool bImplemented; // 0x60
};

struct FYGetFactionsProgressionResult {
	TArray<FYPlayerFactionProgressData> factions; // 0x0
};

struct FYRankSeasonData {
	FString seasonId; // 0x0
	TArray<FYPlayerRankedSeasonGamemodeData> playersRankedSeasonData; // 0x10
};

struct FYGetPlayerGlobalVanity {
	FString UserId; // 0x0
};

struct FClientGetCharacterDataResult : FPlayFabResultCommon {
	FString CharacterId; // 0x8
	UPlayFabJsonObject* Data; // 0x18
	int32_t DataVersion; // 0x20
};

struct FServerGetPlayFabIDsFromSteamIDsRequest : FPlayFabRequestCommon {
	FString SteamStringIDs; // 0x8
};

struct FServerMoveItemToUserFromCharacterRequest : FPlayFabRequestCommon {
	FString CharacterId; // 0x8
	FString ItemInstanceId; // 0x18
	FString PlayFabId; // 0x28
};

struct FRigUnit_DistributeRotation_WorkData {
	TArray<FCachedRigElement> CachedItems; // 0x0
	TArray<int32_t> ItemRotationA; // 0x10
	TArray<int32_t> ItemRotationB; // 0x20
	TArray<float> ItemRotationT; // 0x30
	TArray<FTransform> ItemLocalTransforms; // 0x40
};

struct FRigUnit_SlideChain : FRigUnit_HighlevelBaseMutable {
	FName StartBone; // 0x68
	FName EndBone; // 0x70
	float SlideAmount; // 0x78
	bool bPropagateToChildren; // 0x7c
	FRigUnit_SlideChain_WorkData WorkData; // 0x80
};

struct FRigUnit_MathColorBinaryOp : FRigUnit_MathColorBase {
	FLinearColor A; // 0x8
	FLinearColor B; // 0x18
	FLinearColor Result; // 0x28
};

struct FYUserStatisticsEntry {
	FString Name; // 0x0
	int32_t Value; // 0x10
};

struct FMovieSceneMaterialParameterCollectionTemplate : FMovieSceneParameterSectionTemplate {
	UMaterialParameterCollection* MPC; // 0x80
};

struct FPrimaryAssetRulesCustomOverride {
	FPrimaryAssetType PrimaryAssetType; // 0x0
	FDirectoryPath FilterDirectory; // 0x8
	FString FilterString; // 0x18
	FPrimaryAssetRules Rules; // 0x28
};

struct FYRequestMaintenanceModeStateResult {
	bool Enabled; // 0x0
};

struct FClientLinkAndroidDeviceIDRequest : FPlayFabRequestCommon {
	FString AndroidDevice; // 0x8
	FString AndroidDeviceId; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
	bool ForceLink; // 0x30
	FString OS; // 0x38
};

struct FPowerIKSmoothing {
	bool SmoothPositionOverTime; // 0x0
	float MaxPositionSpeed; // 0x4
	float MaxPositionDistance; // 0x8
	bool SmoothRotationOverTime; // 0xc
	float MaxDegreesSpeed; // 0x10
	float MaxDegreesDistance; // 0x14
};

struct FRigUnit_MathFloatGreater : FRigUnit_MathFloatBase {
	float A; // 0x8
	float B; // 0xc
	bool Result; // 0x10
};

struct FYCompositeQuestProgress {
	FString parentQuestId; // 0x0
	FString compositeName; // 0x10
	int32_t Count; // 0x20
	bool Completed; // 0x24
};

struct FRigPoseElement {
	FCachedRigElement Index; // 0x0
	FTransform GlobalTransform; // 0x20
	FTransform LocalTransform; // 0x50
	float CurveValue; // 0x80
};

struct FAdminRefundPurchaseRequest : FPlayFabRequestCommon {
	FString OrderId; // 0x8
	FString PlayFabId; // 0x18
	FString Reason; // 0x28
};

struct FYRegionEndpoints {
	TArray<FYMatchmakingRegionEndpointEntry> entries; // 0x0
};

struct FYNotificationItemDataTableRow : FYDataTableRowBase {
	EYNotificationMessageType m_messageType; // 0x10
	float m_duration; // 0x14
	TSoftObjectPtr<UTexture2D> m_textureToShow; // 0x18
	FText m_message; // 0x40
};

struct FCompositeSection : FAnimLinkableElement {
	FName SectionName; // 0x30
	float StartTime; // 0x38
	FName NextSectionName; // 0x3c
	TArray<UAnimMetaData*> MetaData; // 0x48
};

struct FRigUnit_DistributeRotation : FRigUnit_HighlevelBaseMutable {
	FName StartBone; // 0x68
	FName EndBone; // 0x70
	TArray<FRigUnit_DistributeRotation_Rotation> Rotations; // 0x78
	EControlRigAnimEasingType RotationEaseType; // 0x88
	float weight; // 0x8c
	bool bPropagateToChildren; // 0x90
	FRigUnit_DistributeRotation_WorkData WorkData; // 0x98
};

struct FYSpawnTypeInfo {
	EYEnemyType m_type; // 0x0
	int32_t m_amount; // 0x4
	FGameplayTagContainer m_tags; // 0x8
};

struct FNamedLensPreset {
	FString Name; // 0x0
	FCameraLensSettings LensSettings; // 0x10
};

struct FCloudScriptExecuteCloudScriptResult : FPlayFabResultCommon {
	int32_t APIRequestsIssued; // 0x8
	UPlayFabJsonObject* Error; // 0x10
	int32_t ExecutionTimeSeconds; // 0x18
	FString FunctionName; // 0x20
	UPlayFabJsonObject* FunctionResult; // 0x30
	bool FunctionResultTooLarge; // 0x38
	int32_t HttpRequestsIssued; // 0x3c
	TArray<UPlayFabJsonObject*> Logs; // 0x40
	bool LogsTooLarge; // 0x50
	int32_t MemoryConsumedBytes; // 0x54
	int32_t ProcessorTimeSeconds; // 0x58
	int32_t Revision; // 0x5c
};

struct FAnimNode_ControlRig : FAnimNode_ControlRigBase {
	UControlRig* ControlRigClass; // 0x170
	UControlRig* ControlRig; // 0x178
	float Alpha; // 0x180
	EAnimAlphaInputType AlphaInputType; // 0x184
	char bAlphaBoolEnabled : 1; // 0x185
	char bSetRefPoseFromSkeleton : 1; // 0x185
	FInputScaleBias AlphaScaleBias; // 0x188
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x190
	FName AlphaCurveName; // 0x1d8
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x1e0
	TMap<FName, FName> InputMapping; // 0x210
	TMap<FName, FName> OutputMapping; // 0x260
	int32_t LODThreshold; // 0x360
};

struct FYItemsRemoved {
	FString UserId; // 0x0
	TArray<FString> removedItems; // 0x10
};

struct FYMissionUpdateResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	FString currentMissionID; // 0x20
	TArray<FYCustomItemInfo> rewards; // 0x30
	bool shouldShowPopup; // 0x40
	int32_t progress; // 0x44
};

struct FGameplayTagSource {
	FName SourceName; // 0x0
	EGameplayTagSourceType SourceType; // 0x8
	UGameplayTagsList* SourceTagList; // 0x10
	URestrictedGameplayTagsList* SourceRestrictedTagList; // 0x18
};

struct FYRequestShowTemporaryNewSelectionData {
	bool m_shouldShow; // 0x0
	FDataTableRowHandle m_requestedRowHandle; // 0x8
	int32_t m_materialIndex; // 0x18
	EYCharacterItemColumnType m_updateType; // 0x1c
};

struct FYUserData {
	FString epicId; // 0x0
	FString UserId; // 0x10
	FString Username; // 0x20
};

struct FYPlayerInfoUserDataEntry {
	int32_t inventoryStashLimit; // 0x0
	int32_t inventoryBagLimit; // 0x4
	int32_t inventorySafeLimit; // 0x8
};

struct FYPlayerHealthAudioData {
	float m_playLowHealthAlarmAtPercent; // 0x0
	FDataTableRowHandle m_lowHealthAlarmStart; // 0x8
	FDataTableRowHandle m_lowHealthAlarmStop; // 0x18
	FDataTableRowHandle m_lowHealthAlarmStopDBNO; // 0x28
	FDataTableRowHandle m_fallingDamageEvent; // 0x38
};

struct FSkeletalMeshLODInfo {
	FPerPlatformFloat ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	TArray<int32_t> LODMaterialMap; // 0x8
	FSkeletalMeshBuildSettings BuildSettings; // 0x18
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x2c
	TArray<FBoneReference> BonesToRemove; // 0x68
	TArray<FBoneReference> BonesToPrioritize; // 0x78
	float WeightOfPrioritization; // 0x88
	UAnimSequence* BakePose; // 0x90
	UAnimSequence* BakePoseOverride; // 0x98
	FString SourceImportFilename; // 0xa0
	ESkinCacheUsage SkinCacheUsage; // 0xb0
	char bHasBeenSimplified : 1; // 0xb1
	char bHasPerLODVertexColors : 1; // 0xb1
	char bAllowCPUAccess : 1; // 0xb1
	char bSupportUniformlyDistributedSampling : 1; // 0xb1
};

struct FAdminUpdateUserTitleDisplayNameRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DisplayName; // 0x10
	FString PlayFabId; // 0x20
};

struct FServerCreateSharedGroupResult : FPlayFabResultCommon {
	FString SharedGroupId; // 0x8
};

struct FMovieSceneMediaPlayerPropertySectionTemplate : FMovieScenePropertySectionTemplate {
	UMediaSource* MediaSource; // 0x38
	FFrameNumber SectionStartFrame; // 0x40
	bool bLoop; // 0x44
};

struct FNiagaraEventGeneratorProperties {
	int32_t MaxEventsPerFrame; // 0x0
	FName ID; // 0x4
	FNiagaraDataSetCompiledData DataSetCompiledData; // 0x10
};

struct FYPlayerReportResponseData {
	FString m_response; // 0x0
	EYPlayerSupportResult m_result; // 0x10
};

struct FMovieSceneSkeletalAnimationSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneSkeletalAnimationSectionTemplateParameters Params; // 0x20
};

struct FYSkipTechTreeNodeUpgradeRequest {
	FString UserId; // 0x0
	FName nodeId; // 0x10
};

struct FAdminUpdatePolicyRequest : FPlayFabRequestCommon {
	bool OverwritePolicy; // 0x8
	FString PolicyName; // 0x10
	TArray<UPlayFabJsonObject*> Statements; // 0x20
};

struct FTimelineVectorTrack {
	UCurveVector* VectorCurve; // 0x0
	FDelegate InterpFunc; // 0x8
	FName TrackName; // 0x18
	FName VectorPropertyName; // 0x20
};

struct FServerAddSharedGroupMembersRequest : FPlayFabRequestCommon {
	FString PlayFabIds; // 0x8
	FString SharedGroupId; // 0x18
};

struct FRigUnit_MathColorLerp : FRigUnit_MathColorBase {
	FLinearColor A; // 0x8
	FLinearColor B; // 0x18
	float T; // 0x28
	FLinearColor Result; // 0x2c
};

struct FYSocialProfileUpdated {
	FYPlayerProfile Entry; // 0x0
};

struct FSoundSubmixSendInfo {
	ESendLevelControlMethod SendLevelControlMethod; // 0x0
	ESubmixSendStage SendStage; // 0x1
	USoundSubmixBase* SoundSubmix; // 0x8
	float SendLevel; // 0x10
	float MinSendLevel; // 0x14
	float MaxSendLevel; // 0x18
	float MinSendDistance; // 0x1c
	float MaxSendDistance; // 0x20
	FRuntimeFloatCurve CustomSendLevelCurve; // 0x28
};

struct FCollectionVectorParameter : FCollectionParameterBase {
	FLinearColor DefaultValue; // 0x18
};

struct FRigUnit_MathQuaternionToEuler : FRigUnit_MathQuaternionBase {
	FQuat Value; // 0x10
	EControlRigRotationOrder RotationOrder; // 0x20
	FVector Result; // 0x24
};

struct FYServerTracingData {
	AActor* m_expectedActor; // 0x0
};

struct FYMatchmakingBeginnerFlagSetup {
	bool Enabled; // 0x0
	int32_t matchesPlayedThreshold; // 0x4
	int32_t evacsThreshold; // 0x8
	int32_t consecutiveDeathsThreshold; // 0xc
};

struct FAnimNotifyTrack {
	FName TrackName; // 0x0
	FLinearColor TrackColor; // 0x8
};

struct FYPopUpEvent : FYBaseAnalyticsEvent {
	FString pop_up_name; // 0xa8
	FString action_type; // 0xb8
	FString player_action; // 0xc8
	FString Content; // 0xd8
	int32_t time_to_action; // 0xe8
	int32_t dont_show_again; // 0xec
};

struct FAutoCompleteCommand {
	FString Command; // 0x0
	FString Desc; // 0x10
};

struct FYStateChangedData {
	int64_t m_state; // 0x0
	int64_t m_eventCounter; // 0x8
};

struct FAdminCreateTaskResult : FPlayFabResultCommon {
	FString TaskId; // 0x8
};

struct FPaperSpriteSocket {
	FTransform LocalTransform; // 0x0
	FName SocketName; // 0x30
};

struct FMultiplayerDeleteAssetRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Filename; // 0x10
};

struct FMovieSceneVectorKeyStruct : FMovieSceneVectorKeyStructBase {
	FVector Vector; // 0x28
};

struct FCachedKeyToActionInfo {
	UPlayerInput* PlayerInput; // 0x0
};

struct FStaticMeshOptimizationSettings {
	EOptimizationType ReductionMethod; // 0x0
	float NumOfTrianglesPercentage; // 0x4
	float MaxDeviationPercentage; // 0x8
	float WeldingThreshold; // 0xc
	bool bRecalcNormals; // 0x10
	float NormalsThreshold; // 0x14
	char SilhouetteImportance; // 0x18
	char TextureImportance; // 0x19
	char ShadingImportance; // 0x1a
};

struct FYProspectorBadgeData {
	FString ownerID; // 0x0
	FString killedBy; // 0x10
	FString killedHow; // 0x20
	int32_t rank; // 0x30
};

struct FSimpleCurveKey {
	float Time; // 0x0
	float Value; // 0x4
};

struct FAtmospherePrecomputeParameters {
	float DensityHeight; // 0x0
	float DecayHeight; // 0x4
	int32_t MaxScatteringOrder; // 0x8
	int32_t TransmittanceTexWidth; // 0xc
	int32_t TransmittanceTexHeight; // 0x10
	int32_t IrradianceTexWidth; // 0x14
	int32_t IrradianceTexHeight; // 0x18
	int32_t InscatterAltitudeSampleNum; // 0x1c
	int32_t InscatterMuNum; // 0x20
	int32_t InscatterMuSNum; // 0x24
	int32_t InscatterNuNum; // 0x28
};

struct FDirectLinkMsg_DeltaMessage {
	int32_t DestinationStreamPort; // 0x0
	int8_t BatchCode; // 0x4
	int32_t MessageCode; // 0x8
	char Kind; // 0xc
	bool CompressedPayload; // 0xd
	TArray<char> Payload; // 0x10
};

struct FInputAxisKeyMapping {
	FName AxisName; // 0x0
	float Scale; // 0x8
	FKey Key; // 0x10
	int32_t R; // 0x28
	int32_t G; // 0x2c
	int32_t B; // 0x30
};

struct FYSetViewTargetData {
	TWeakObjectPtr<AActor> m_newViewTarget; // 0x0
	FViewTargetTransitionParams m_newTargetTransitionParams; // 0x8
	float m_lockTime; // 0x18
};

struct FTextSizingParameters {
	float DrawX; // 0x0
	float DrawY; // 0x4
	float DrawXL; // 0x8
	float DrawYL; // 0xc
	FVector2D Scaling; // 0x10
	UFont* DrawFont; // 0x18
	FVector2D SpacingAdjust; // 0x20
};

struct FMovieSceneTangentData {
	float ArriveTangent; // 0x0
	float LeaveTangent; // 0x4
	float ArriveTangentWeight; // 0x8
	float LeaveTangentWeight; // 0xc
	ERichCurveTangentWeightMode TangentWeightMode; // 0x10
};

struct FDatasmithAssetImportOptions {
	FName PackagePath; // 0x0
};

struct FAdminGetPlayerStatisticDefinitionsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Statistics; // 0x8
};

struct FInsightsInsightsGetOperationStatusRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString OperationId; // 0x10
};

struct FMultiplayerListMultiplayerServersRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	int32_t PageSize; // 0x20
	FString Region; // 0x28
	FString SkipToken; // 0x38
};

struct FMovieSceneSubSectionData {
	TWeakObjectPtr<UMovieSceneSubSection> Section; // 0x0
	FGuid ObjectBindingID; // 0x8
	ESectionEvaluationFlags Flags; // 0x18
};

struct FNiagaraVariableMetaData {
	FText Description; // 0x0
	FText CategoryName; // 0x18
	bool bAdvancedDisplay; // 0x30
	int32_t EditorSortPriority; // 0x34
	bool bInlineEditConditionToggle; // 0x38
	FNiagaraInputConditionMetadata EditCondition; // 0x40
	FNiagaraInputConditionMetadata VisibleCondition; // 0x58
	TMap<FName, FString> PropertyMetaData; // 0x70
	FName ParentAttribute; // 0xc0
	FName ScopeName; // 0xc8
	ENiagaraScriptParameterUsage Usage; // 0xd0
	bool bIsStaticSwitch; // 0xd4
	int32_t StaticSwitchDefaultValue; // 0xd8
	bool bAddedToNodeGraphDeepCopy; // 0xdc
	bool bOutputIsPersistent; // 0xdd
	FName CachedNamespacelessVariableName; // 0xe0
	bool bCreatedInSystemEditor; // 0xe8
	bool bUseLegacyNameString; // 0xe9
};

struct FYBoardContractsInitData {
	EYFaction boardFaction; // 0x0
	TArray<FYBoardContractInitData> playerBoardContractsIncludingActiveOnes; // 0x8
};

struct FAnimNode_CopyPoseFromMesh : FAnimNode_Base {
	TWeakObjectPtr<USkeletalMeshComponent> SourceMeshComponent; // 0x10
	char bUseAttachedParent : 1; // 0x18
	char bCopyCurves : 1; // 0x18
	bool bCopyCustomAttributes; // 0x19
	char bUseMeshPose : 1; // 0x1a
	FName RootBoneToCopy; // 0x1c
};

struct FAdminRemovePlayerTagRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
	FString TagName; // 0x20
};

struct FKTaperedCapsuleElem : FKShapeElem {
	FVector Center; // 0x30
	FRotator Rotation; // 0x3c
	float Radius0; // 0x48
	float Radius1; // 0x4c
	float Length; // 0x50
};

struct FYDebugAddCustomItem {
	FString UserId; // 0x0
	FString baseItemId; // 0x10
};

struct FMultiplayerListBuildAliasesForTitleResponse : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BuildAliases; // 0x8
};

struct FYCountPerMap : FYDataTableRowBase {
	int32_t m_count; // 0x10
	TMap<EYMapType, int32_t> m_mapOverride; // 0x18
};

struct FTransformNoScale {
	FVector Location; // 0x0
	FQuat Rotation; // 0x10
};

struct FWaterBrushEffectTerracing {
	float TerraceAlpha; // 0x0
	float TerraceSpacing; // 0x4
	float TerraceSmoothness; // 0x8
	float MaskLength; // 0xc
	float MaskStartOffset; // 0x10
};

struct FYPassiveGeneratorType : FYDataTableRowBase {
	FName m_generatorId; // 0x10
	FText m_generatorName; // 0x18
	EYPassiveGeneratorRewardType m_generatorType; // 0x30
	int32_t m_baseGenIntervalMinutes; // 0x34
	int32_t m_baseGenRate; // 0x38
	int32_t m_baseCap; // 0x3c
	EYTechTreeNodePerkType m_capPerkEffector; // 0x40
	EYTechTreeNodePerkType m_genRatePerkEffector; // 0x41
};

struct FHorizonTweenEventWidgetMoveFromToParameters : FHorizonTweenEventWidgetVector2DParameters {
	TWeakObjectPtr<UWidget> TweenTargetWeakPtr; // 0xb8
};

struct FYPainTrainActivityStats : FYBaseActivityStats {
	EYPainTrainStatus Status; // 0xb8
	int32_t pain_train_id; // 0xbc
};

struct FYFXCategoryRow : FYBaseFXCategoryRow {
	FName m_trailTargetParameter; // 0xd0
	UParticleSystem* m_trailFX; // 0xd8
	bool m_playTrailVFXEmitterForProjectiles; // 0xe0
	FYWeaponParticleSystemSelector m_trailVFXEmitter; // 0xe8
	UParticleSystem* m_defaultBeamFX; // 0x110
	UParticleSystem* m_defaultSpinupFx; // 0x118
	UParticleSystem* m_projectileParticleSystem; // 0x120
	FYWeaponParticleSystemSelector m_projectileVFXEmitter; // 0x128
	FName m_muzzleSocketName; // 0x150
	FYWeaponParticleSystemSelector m_muzzleVFXEmitter; // 0x158
	FYWeaponParticleSystemSelector m_muzzleVFXEmitter3rdPerson; // 0x180
	FName m_shellEjectSocketName; // 0x1a8
	FYWeaponParticleSystemSelector m_shellEjectVFXEmitter; // 0x1b0
	FName m_beamEndPointParameter; // 0x1d8
	bool m_playImpactEffectOnAutonomous; // 0x1e0
	bool m_fireFxIsLooping; // 0x1e1
	bool m_fireFxIsBeamEndPoint; // 0x1e2
	UCameraShakeBase* m_impactCameraShake; // 0x1e8
	float m_impactShakeInnerRadius; // 0x1f0
	float m_impactShakeOuterRadius; // 0x1f4
};

struct FAimConstraintDescription : FConstraintDescriptionEx {
	FAxis LookAt_Axis; // 0x10
	FAxis LookUp_Axis; // 0x20
	bool bUseLookUp; // 0x30
	FVector LookUpTarget; // 0x34
};

struct FRigUnit_AccumulateFloatAdd : FRigUnit_SimBase {
	float Increment; // 0x8
	float InitialValue; // 0xc
	bool bIntegrateDeltaTime; // 0x10
	float Result; // 0x14
	float AccumulatedValue; // 0x18
};

struct FCameraFilmbackSettings {
	float SensorWidth; // 0x0
	float SensorHeight; // 0x4
	float SensorAspectRatio; // 0x8
};

struct FAnimNode_CustomProperty : FAnimNode_Base {
	TArray<FName> SourcePropertyNames; // 0x10
	TArray<FName> DestPropertyNames; // 0x20
	UObject* TargetInstance; // 0x30
};

struct FFrameNumberRange {
	FFrameNumberRangeBound LowerBound; // 0x0
	FFrameNumberRangeBound UpperBound; // 0x8
};

struct FRigUnit_CollectionItemAtIndex : FRigUnit_CollectionBase {
	FRigElementKeyCollection Collection; // 0x8
	int32_t Index; // 0x18
	FRigElementKey Item; // 0x1c
};

struct FRigUnit_DebugLineItemSpace : FRigUnit_DebugBaseMutable {
	FVector A; // 0x68
	FVector B; // 0x74
	FLinearColor Color; // 0x80
	float Thickness; // 0x90
	FRigElementKey Space; // 0x94
	FTransform WorldOffset; // 0xa0
	bool bEnabled; // 0xd0
};

struct FMultiplayerEnableMultiplayerServersForTitleResponse : FPlayFabResultCommon {
	ETitleMultiplayerServerEnabledStatus Status; // 0x8
};

struct FYRankedSeasonData {
	FString m_rankedSeasonName; // 0x0
	FDateTime m_endDateTime; // 0x10
	FTimespan m_remainingTime; // 0x18
	bool m_isValidData; // 0x20
	FName m_rowName; // 0x24
};

struct FStreamingTextureBuildInfo {
	uint32_t PackedRelativeBox; // 0x0
	int32_t TextureLevelIndex; // 0x4
	float TexelFactor; // 0x8
};

struct FMovieSceneActorReferenceSectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x20
	FMovieSceneActorReferenceData ActorReferenceData; // 0x38
};

struct FClientLoginWithNintendoServiceAccountRequest : FPlayFabRequestCommon {
	bool CreateAccount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString EncryptedRequest; // 0x18
	FString IdentityToken; // 0x28
	UPlayFabJsonObject* InfoRequestParameters; // 0x38
	FString PlayerSecret; // 0x40
};

struct FControlRigComponentMappedComponent {
	USceneComponent* Component; // 0x0
	FName ElementName; // 0x8
	ERigElementType ElementType; // 0x10
	EControlRigComponentMapDirection Direction; // 0x11
};

struct FClientLinkCustomIDRequest : FPlayFabRequestCommon {
	FString CustomId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	bool ForceLink; // 0x20
};

struct FNodeChain {
	TArray<FName> nodes; // 0x0
};

struct FExperimentationGetTreatmentAssignmentResult : FPlayFabResultCommon {
	UPlayFabJsonObject* TreatmentAssignment; // 0x8
};

struct FServerGetPlayerTagsResult : FPlayFabResultCommon {
	FString PlayFabId; // 0x8
	FString Tags; // 0x18
};

struct FYDebugSetPlayerGamemodeRankRequest {
	int32_t rank; // 0x0
	FString GameMode; // 0x8
};

struct FAnimNode_MakeDynamicAdditive : FAnimNode_Base {
	FPoseLink Base; // 0x10
	FPoseLink Additive; // 0x20
	bool bMeshSpaceAdditive; // 0x30
};

struct FRigUnit_FitChainToCurvePerItem : FRigUnit_HighlevelBaseMutable {
	FRigElementKeyCollection Items; // 0x68
	FCRFourPointBezier Bezier; // 0x78
	EControlRigCurveAlignment Alignment; // 0xa8
	float Minimum; // 0xac
	float Maximum; // 0xb0
	int32_t SamplingPrecision; // 0xb4
	FVector PrimaryAxis; // 0xb8
	FVector SecondaryAxis; // 0xc4
	FVector PoleVectorPosition; // 0xd0
	TArray<FRigUnit_FitChainToCurve_Rotation> Rotations; // 0xe0
	EControlRigAnimEasingType RotationEaseType; // 0xf0
	float weight; // 0xf4
	bool bPropagateToChildren; // 0xf8
	FRigUnit_FitChainToCurve_DebugSettings DebugSettings; // 0x100
	FRigUnit_FitChainToCurve_WorkData WorkData; // 0x160
};

struct FAdminGetRandomResultTablesResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Tables; // 0x8
};

struct FYClaimCompletedActiveContractRewardsResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	FString claimedContractId; // 0x20
	FString newContractId; // 0x30
	TArray<FYCurrencyItem> changedCurrencies; // 0x40
	TArray<FYCustomItemInfo> ItemsGranted; // 0x50
	TArray<FYCustomItemInfo> itemsUpdatedOrRemoved; // 0x60
	FYPlayerFactionProgressData playerFactionProgressData; // 0x70
	EYClaimContractRewardsStatus Status; // 0x88
};

struct FGroupsListMembershipOpportunitiesRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
};

struct FClientReportPlayerClientRequest : FPlayFabRequestCommon {
	FString Comment; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString ReporteeId; // 0x20
};

struct FYAINavMeshInfo {
	TArray<EYEnemyType> m_supportedEnemyTypes; // 0x0
};

struct FPlatformInterfaceData {
	FName DataName; // 0x0
	EPlatformInterfaceDataType Type; // 0x8
	int32_t IntValue; // 0xc
	float FloatValue; // 0x10
	FString StringValue; // 0x18
	UObject* ObjectValue; // 0x28
};

struct FYBoardsContractsInitData {
	TArray<FYBoardContractsInitData> playerContractsBoards; // 0x0
	FYTimestamp lastBoardRefreshTimeUtc; // 0x10
};

struct FTagAndValue {
	FName Tag; // 0x0
	FString Value; // 0x8
};

struct FSoundWaveEnvelopeTimeData {
	float Amplitude; // 0x0
	float TimeSec; // 0x4
};

struct FRigUnit_TimeOffsetTransform : FRigUnit_SimBase {
	FTransform Value; // 0x10
	float SecondsAgo; // 0x40
	int32_t BufferSize; // 0x44
	float TimeRange; // 0x48
	FTransform Result; // 0x50
	TArray<FTransform> Buffer; // 0x80
	TArray<float> DeltaTimes; // 0x90
	int32_t LastInsertIndex; // 0xa0
	int32_t UpperBound; // 0xa4
};

struct FYPlayerCosmeticReplicatedData {
	FYActiveWeaponCharacterInitializationData m_initData; // 0x0
	int32_t m_selectedWeaponSlot; // 0x50
	bool m_isActive; // 0x54
};

struct FMovieScene3DTransformTemplateData {
	FMovieSceneFloatChannel TranslationCurve[0x3]; // 0x0
	FMovieSceneFloatChannel RotationCurve[0x3]; // 0x1e0
	FMovieSceneFloatChannel ScaleCurve[0x3]; // 0x3c0
	FMovieSceneFloatChannel ManualWeight; // 0x5a0
	EMovieSceneBlendType BlendType; // 0x640
	FMovieSceneTransformMask Mask; // 0x644
	bool bUseQuaternionInterpolation; // 0x648
};

struct FClientAcceptTradeResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Trade; // 0x8
};

struct FNiagaraVariableLayoutInfo {
	uint32_t FloatComponentStart; // 0x0
	uint32_t Int32ComponentStart; // 0x4
	uint32_t HalfComponentStart; // 0x8
	FNiagaraTypeLayoutInfo LayoutInfo; // 0x10
};

struct FClientGetCharacterStatisticsResult : FPlayFabResultCommon {
	UPlayFabJsonObject* CharacterStatistics; // 0x8
};

struct FRigUnit_FABRIK : FRigUnit_HighlevelBaseMutable {
	FName StartBone; // 0x68
	FName EffectorBone; // 0x70
	FTransform EffectorTransform; // 0x80
	float Precision; // 0xb0
	float weight; // 0xb4
	bool bPropagateToChildren; // 0xb8
	int32_t MaxIterations; // 0xbc
	FRigUnit_FABRIK_WorkData WorkData; // 0xc0
};

struct FEngineServiceTerminate {
	FString Username; // 0x0
};

struct FPreviewMeshCollectionEntry {
	TSoftObjectPtr<USkeletalMesh> SkeletalMesh; // 0x0
};

struct FTextureFormatSettings {
	TextureCompressionSettings CompressionSettings; // 0x0
	char CompressionNoAlpha : 1; // 0x1
	char CompressionNone : 1; // 0x1
	char CompressionYCoCg : 1; // 0x1
	char SRGB : 1; // 0x1
};

struct FYMatchPhaseData {
	FDataTableRowHandle m_matchFlowRowHandle; // 0x0
	FDataTableRowHandle m_matchPhaseDefinitionRowHandle; // 0x10
	bool m_shouldForcePhaseTransition; // 0x20
};

struct FRigUnit_TwoBoneIKSimple : FRigUnit_HighlevelBaseMutable {
	FName BoneA; // 0x68
	FName BoneB; // 0x70
	FName EffectorBone; // 0x78
	FTransform Effector; // 0x80
	FVector PrimaryAxis; // 0xb0
	FVector SecondaryAxis; // 0xbc
	float SecondaryAxisWeight; // 0xc8
	FVector PoleVector; // 0xcc
	EControlRigVectorKind PoleVectorKind; // 0xd8
	FName PoleVectorSpace; // 0xdc
	bool bEnableStretch; // 0xe4
	float StretchStartRatio; // 0xe8
	float StretchMaximumRatio; // 0xec
	float weight; // 0xf0
	float BoneALength; // 0xf4
	float BoneBLength; // 0xf8
	bool bPropagateToChildren; // 0xfc
	FRigUnit_TwoBoneIKSimple_DebugSettings DebugSettings; // 0x100
	FCachedRigElement CachedBoneAIndex; // 0x140
	FCachedRigElement CachedBoneBIndex; // 0x154
	FCachedRigElement CachedEffectorBoneIndex; // 0x168
	FCachedRigElement CachedPoleVectorSpaceIndex; // 0x17c
};

struct FYPassiveGeneratorCrateResultsReceived {
	FYPassiveGenerator Source; // 0x0
	TArray<FYCurrencyItem> currencies; // 0x18
	TArray<FYCustomItemInfo> customItems; // 0x28
};

struct FKAggregateGeom {
	TArray<FKSphereElem> SphereElems; // 0x0
	TArray<FKBoxElem> BoxElems; // 0x10
	TArray<FKSphylElem> SphylElems; // 0x20
	TArray<FKConvexElem> ConvexElems; // 0x30
	TArray<FKTaperedCapsuleElem> TaperedCapsuleElems; // 0x40
};

struct FNiagaraEmitterScalabilityOverrides {
	TArray<FNiagaraEmitterScalabilityOverride> Overrides; // 0x0
};

struct FYPlayerContractsInitData {
	FString UserId; // 0x0
	FYBoardsContractsInitData playerBoardsContractsIncludingActiveOnes; // 0x10
};

struct FExposureSettings {
	float FixedEV100; // 0x0
	bool bFixed; // 0x4
};

struct FClientLinkNintendoSwitchDeviceIdRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool ForceLink; // 0x10
	FString NintendoSwitchDeviceId; // 0x18
};

struct FClientUnlinkGameCenterAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FRigUnit_MathFloatLerp : FRigUnit_MathFloatBase {
	float A; // 0x8
	float B; // 0xc
	float T; // 0x10
	float Result; // 0x14
};

struct FAnimNode_ControlRigInputPose : FAnimNode_Base {
	FPoseLink InputPose; // 0x10
};

struct FAuthenticationValidateEntityTokenRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString EntityToken; // 0x10
};

struct FYEnterMatchResult {
	bool m_succeeded; // 0x0
	FString m_matchTicket; // 0x8
	FString m_ip; // 0x18
	FString m_region; // 0x28
	int32_t m_port; // 0x38
};

struct FYRawStatEntry {
	FString m_statName; // 0x0
	float m_statValue; // 0x10
	float m_oldStatValue; // 0x14
	EYMatchmakeGameModeType m_gameMode; // 0x18
	EYActivityType m_activityType; // 0x19
	FYEOSStatData m_dtStatData; // 0x20
	bool m_isCustomStat; // 0x50
	bool m_hasUpdated; // 0x51
};

struct FYActiveContractAndCorrespondingFaction {
	FString contractId; // 0x0
	FString factionId; // 0x10
};

struct FMultiplayerCreateServerMatchmakingTicketRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t GiveUpAfterSeconds; // 0x10
	TArray<UPlayFabJsonObject*> Members; // 0x18
	FString QueueName; // 0x28
};

struct FYWeaponAnimationStaticData {
	TArray<UAnimMontage*> m_weaponAnimationVariations; // 0x0
	TArray<UAnimMontage*> m_playerAnimationThirdPersonVariations; // 0x10
	TArray<UAnimMontage*> m_playerAnimationFirstPersonVariations; // 0x20
	TArray<UAnimMontage*> m_weaponThirdPersonPlayerAnimationVariations; // 0x30
	TArray<UAnimMontage*> m_playerAnimationFirstPersonLowStaminaVariations; // 0x40
	TArray<UAnimMontage*> m_playerAnimationThirdPersonLowStaminaVariations; // 0x50
	float m_desiredTuningPlayDuration; // 0x60
	float m_animationRateScaleOverride; // 0x64
};

struct FYGrantEntry {
	EYGrantType m_grantType; // 0x0
	FDataTableRowHandle m_grantTypeRowHandle; // 0x8
	int32_t m_amount; // 0x18
};

struct FAdminAddServerBuildRequest : FPlayFabRequestCommon {
	FString ActiveRegions; // 0x8
	FString BuildId; // 0x18
	FString CommandLineTemplate; // 0x28
	FString Comment; // 0x38
	UPlayFabJsonObject* CustomTags; // 0x48
	FString ExecutablePath; // 0x50
	int32_t MaxGamesPerHost; // 0x60
	int32_t MinFreeGameSlots; // 0x64
};

struct FCloudScriptPostFunctionResultForFunctionExecutionRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	UPlayFabJsonObject* FunctionResult; // 0x18
};

struct FRigUnit_MathRBFInterpolateVectorColor : FRigUnit_MathRBFInterpolateVectorBase {
	TArray<FMathRBFInterpolateVectorColor_Target> Targets; // 0xb0
	FLinearColor Output; // 0xc0
};

struct FRigUnit_MathRBFInterpolateVectorFloat : FRigUnit_MathRBFInterpolateVectorBase {
	TArray<FMathRBFInterpolateVectorFloat_Target> Targets; // 0xb0
	float Output; // 0xc0
};

struct FRigUnit_TwistBonesPerItem : FRigUnit_HighlevelBaseMutable {
	FRigElementKeyCollection Items; // 0x68
	FVector TwistAxis; // 0x78
	FVector PoleAxis; // 0x84
	EControlRigAnimEasingType TwistEaseType; // 0x90
	float weight; // 0x94
	bool bPropagateToChildren; // 0x98
	FRigUnit_TwistBones_WorkData WorkData; // 0xa0
};

struct FAnimNode_CopyBoneDelta : FAnimNode_SkeletalControlBase {
	FBoneReference SourceBone; // 0xc8
	FBoneReference TargetBone; // 0xd8
	bool bCopyTranslation; // 0xe8
	bool bCopyRotation; // 0xe9
	bool bCopyScale; // 0xea
	CopyBoneDeltaMode CopyMode; // 0xeb
	float TranslationMultiplier; // 0xec
	float RotationMultiplier; // 0xf0
	float ScaleMultiplier; // 0xf4
};

struct FScreenMessageString {
	uint64_t Key; // 0x0
	FString ScreenMessage; // 0x8
	FColor DisplayColor; // 0x18
	float TimeToDisplay; // 0x1c
	float CurrentTimeDisplayed; // 0x20
	FVector2D TextScale; // 0x24
};

struct FYMissionStepEntry : FYDataTableRowBase {
	FYMissionInitializationData m_missionInitData; // 0x10
};

struct FYContractRewardUIData {
	bool showDivider; // 0x0
	FYContractReward contractReward; // 0x8
};

struct FYItemDetailOverviewData {
	bool m_isItemBlueprint; // 0x0
	FDataTableRowHandle m_itemRowHandle; // 0x8
	EYItemRarityType m_itemRarity; // 0x18
	FString m_shopItemBelongsTo; // 0x20
};

struct FYModAttachEntry {
	TSoftObjectPtr<USkeletalMesh> m_mesh; // 0x0
	FName m_socketAttachmentName; // 0x28
};

struct FDataInitiateFileUploadsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	FString FileNames; // 0x18
	int32_t ProfileVersion; // 0x28
};

struct FYDamageOriginInfo {
	FDataTableRowHandle m_damageOriginTableRowHandle; // 0x0
	FDataTableRowHandle m_damageInfoApplyRowHandle; // 0x10
	EYGameplayContextType m_damageContext; // 0x20
};

struct FRigUnit_BinaryQuaternionOp : FRigUnit {
	FQuat Argument0; // 0x10
	FQuat Argument1; // 0x20
	FQuat Result; // 0x30
};

struct FCompositeSubFont : FCompositeFallbackFont {
	TArray<FInt32Range> CharacterRanges; // 0x18
	FString Cultures; // 0x28
};

struct FYStartItemCraftingRequest {
	FString UserId; // 0x0
	FString blueprintName; // 0x10
	int32_t blueprintRarity; // 0x20
	int32_t purchaseAmount; // 0x24
	FString baseItemId; // 0x28
};

struct FClientGetPlayerSegmentsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Segments; // 0x8
};

struct FStatColorMapping {
	FString StatName; // 0x0
	TArray<FStatColorMapEntry> ColorMap; // 0x10
	char DisableBlend : 1; // 0x20
};

struct FServerGetContentDownloadUrlResult : FPlayFabResultCommon {
	FString URL; // 0x8
};

struct FMovieSceneWidgetMaterialSectionTemplate : FMovieSceneParameterSectionTemplate {
	TArray<FName> BrushPropertyNamePath; // 0x80
};

struct FRigUnit_TwoBoneIKFK : FRigUnitMutable {
	FName StartJoint; // 0x68
	FName EndJoint; // 0x70
	FVector PoleTarget; // 0x78
	float Spin; // 0x84
	FTransform EndEffector; // 0x90
	float IKBlend; // 0xc0
	FTransform StartJointFKTransform; // 0xd0
	FTransform MidJointFKTransform; // 0x100
	FTransform EndJointFKTransform; // 0x130
	float PreviousFKIKBlend; // 0x160
	FTransform StartJointIKTransform; // 0x170
	FTransform MidJointIKTransform; // 0x1a0
	FTransform EndJointIKTransform; // 0x1d0
	int32_t StartJointIndex; // 0x200
	int32_t MidJointIndex; // 0x204
	int32_t EndJointIndex; // 0x208
	float UpperLimbLength; // 0x20c
	float LowerLimbLength; // 0x210
};

struct FYPossibleSquadDefinitions {
	TArray<FYSquadDefinition> m_squads; // 0x0
};

struct FClientGetPlayFabIDsFromPSNAccountIDsRequest : FPlayFabRequestCommon {
	int32_t IssuerId; // 0x8
	FString PSNAccountIDs; // 0x10
};

struct FRigUnit_MathTransformClampSpatially : FRigUnit_MathTransformBase {
	FTransform Value; // 0x10
	EAxis Axis; // 0x40
	EControlRigClampSpatialMode Type; // 0x41
	float Minimum; // 0x44
	float Maximum; // 0x48
	FTransform Space; // 0x50
	bool bDrawDebug; // 0x80
	FLinearColor DebugColor; // 0x84
	float DebugThickness; // 0x94
	FTransform Result; // 0xa0
};

struct FClientStartPurchaseRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	TArray<UPlayFabJsonObject*> Items; // 0x20
	FString StoreId; // 0x30
};

struct FEnvNamedValue {
	FName ParamName; // 0x0
	EAIParamType ParamType; // 0x8
	float Value; // 0xc
};

struct FYShardData {
	AActor* m_actor; // 0x0
	int32_t m_shardIndex; // 0x8
	bool m_onlyRelevantToSelf; // 0xc
};

struct FRigUnit_SpringIK_WorkData {
	TArray<FCachedRigElement> BoneIndices; // 0x0
	FCachedRigElement CachedPoleVector; // 0x10
	TArray<FTransform> Transforms; // 0x28
	FCRSimPointContainer Simulation; // 0x38
};

struct FARMeshUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	EARObjectClassification ObjectClassification; // 0x50
};

struct FClassRedirect {
	FName ObjectName; // 0x0
	FName OldClassName; // 0x8
	FName NewClassName; // 0x10
	FName OldSubobjName; // 0x18
	FName NewSubobjName; // 0x20
	FName NewClassClass; // 0x28
	FName NewClassPackage; // 0x30
	bool InstanceOnly; // 0x38
};

struct FYPlayerActionHistoryData {
	TMap<FString, int32_t> m_timeSameActionTowardsUser; // 0x0
	int32_t m_currentTimeMuted; // 0x50
	int32_t m_amountOfTimesMuted; // 0x54
	bool m_currentlyMuted; // 0x58
	float m_lastTimeTracked; // 0x5c
};

struct FEpicSynth1Patch {
	ESynth1PatchSource PatchSource; // 0x0
	TArray<FSynth1PatchCable> PatchCables; // 0x8
};

struct FYAITuningBuffAlliesTuning : FTableRowBase {
	TArray<FDataTableRowHandle> m_perks; // 0x8
	float m_buffCooldown; // 0x18
	float m_buffRadius; // 0x1c
	AActor* m_buffClasses; // 0x20
	bool m_buffExcludeSelf; // 0x28
	float m_buffInterrupDamage; // 0x2c
	float m_buffInterrupTime; // 0x30
};

struct FYCloakDataRow : FYDataTableRowBase {
	UMaterialInterface* m_cloakMaterial; // 0x10
	FName m_midOptionalParameter; // 0x18
};

struct FYGivePlayerSeasonGamemodeRankResponse {
	bool SUCCESS; // 0x0
};

struct FServerRevokeInventoryItemRequest : FPlayFabRequestCommon {
	FString CharacterId; // 0x8
	FString ItemInstanceId; // 0x18
	FString PlayFabId; // 0x28
};

struct FAutomationEvent {
	EAutomationEventType Type; // 0x0
	FString Message; // 0x8
	FString Context; // 0x18
	FGuid Artifact; // 0x28
};

struct FMatchmakerAuthUserRequest : FPlayFabRequestCommon {
	FString AuthorizationTicket; // 0x8
};

struct FYStationInteractionEvent : FYBaseAnalyticsEvent {
	FString station_id; // 0xa8
	FString station_name; // 0xb8
};

struct FYRewardDataTableRow : FYDataTableRowBase {
	EYRewardType m_rewardType; // 0x10
	FName m_rewardId; // 0x14
	int32_t m_amount; // 0x1c
	float m_weight; // 0x20
};

struct FYDeathAnimMontageInfo {
	EYDeathType m_deathType; // 0x0
	UAnimMontage* m_montage; // 0x8
	bool m_deathToRagdoll; // 0x10
	float m_serverTimestamp; // 0x14
	FYDealtDamageData m_lastTimeDamagedData; // 0x18
	FGameplayTagContainer m_deathAnimationGameplayTags; // 0x118
};

struct FEnvQueryInstanceCache {
	UEnvQuery* Template; // 0x0
};

struct FRigUnit_SetControlVector : FRigUnitMutable {
	FName Control; // 0x68
	float weight; // 0x70
	FVector Vector; // 0x74
	EBoneGetterSetterMode Space; // 0x80
	FCachedRigElement CachedControlIndex; // 0x84
};

struct FYRetentionProgress {
	int32_t daysClaimed; // 0x0
	FYTimestamp lastClaimTime; // 0x8
};

struct FYPersistentMatch {
	FString ServerId; // 0x0
	FString SessionId; // 0x10
	FString State; // 0x20
	bool isMatch; // 0x30
	FString mapName; // 0x38
	FString Region; // 0x48
	int64_t transitionTime; // 0x58
	TArray<FString> userIds; // 0x60
	TArray<FString> userNames; // 0x70
};

struct FActorPerceptionBlueprintInfo {
	AActor* Target; // 0x0
	TArray<FAIStimulus> LastSensedStimuli; // 0x8
	char bIsHostile : 1; // 0x18
};

struct FYActiveArmorData {
	FString m_id; // 0x0
	FDataTableRowHandle m_rowHandle; // 0x10
	int32_t m_durability; // 0x20
};

struct FBrushEffectDisplacement {
	float DisplacementHeight; // 0x0
	float DisplacementTiling; // 0x4
	UTexture2D* Texture; // 0x8
	float Midpoint; // 0x10
	FLinearColor Channel; // 0x14
	float WeightmapInfluence; // 0x24
};

struct FServerAddPlayerTagRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
	FString TagName; // 0x20
};

struct FSplinePoint {
	float InputKey; // 0x0
	FVector Position; // 0x4
	FVector ArriveTangent; // 0x10
	FVector LeaveTangent; // 0x1c
	FRotator Rotation; // 0x28
	FVector Scale; // 0x34
	ESplinePointType Type; // 0x40
};

struct FYRequestStationConnect {
	FString UserId; // 0x0
	bool isDevelopment; // 0x10
	TArray<FYStationUserPings> userPings; // 0x18
	bool isMatch; // 0x28
};

struct FMultiplayerListBuildSummariesRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t PageSize; // 0x10
	FString SkipToken; // 0x18
};

struct FPaperFlipbookKeyFrame {
	UPaperSprite* Sprite; // 0x0
	int32_t FrameRun; // 0x8
};

struct FYVanitySetCustomItemResultData {
	EYVanityUpdateResult return_result; // 0x0
	FString UserId; // 0x8
	TArray<FYCustomItemInfo> updated_items; // 0x18
	TArray<FYVanityBackendItemInfo> updated_vanity_items; // 0x28
};

struct FYFilterCategoriesDataEntry {
	TArray<EYCustomizationCategory> m_customizationCategories; // 0x0
	TArray<EYItemType> m_itemTypes; // 0x10
	TArray<EYModificationSlotType> m_modSlotTypes; // 0x20
	bool m_filterForTools; // 0x30
};

struct FAnimationTransitionBetweenStates : FAnimationStateBase {
	int32_t PreviousState; // 0x8
	int32_t NextState; // 0xc
	float CrossfadeDuration; // 0x10
	int32_t StartNotify; // 0x14
	int32_t EndNotify; // 0x18
	int32_t InterruptNotify; // 0x1c
	EAlphaBlendOption BlendMode; // 0x20
	UCurveFloat* CustomCurve; // 0x28
	UBlendProfile* BlendProfile; // 0x30
	ETransitionLogicType LogicType; // 0x38
};

struct FInAppPurchaseReceiptInfo2 {
	FString ItemName; // 0x0
	FString ItemId; // 0x10
	FString ValidationInfo; // 0x20
};

struct FNDIStaticMeshSectionFilter {
	TArray<int32_t> AllowedMaterialSlots; // 0x0
};

struct FYPlayerStartScoreRule {
	float m_radius; // 0x0
	int32_t m_scorePerPlayerInRadius; // 0x4
};

struct FNiagaraSpawnInfo {
	int32_t Count; // 0x0
	float InterpStartDt; // 0x4
	float IntervalDt; // 0x8
	int32_t SpawnGroup; // 0xc
};

struct FMultiplayerListContainerImagesResponse : FPlayFabResultCommon {
	FString Images; // 0x8
	int32_t PageSize; // 0x18
	FString SkipToken; // 0x20
};

struct FServerWriteServerCharacterEventRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Body; // 0x8
	FString CharacterId; // 0x10
	UPlayFabJsonObject* CustomTags; // 0x20
	FString EventName; // 0x28
	FString PlayFabId; // 0x38
	FString Timestamp; // 0x48
};

struct FTransform {
	FQuat Rotation; // 0x0
	FVector Translation; // 0x10
	FVector Scale3D; // 0x20
};

struct FYStationMessage : FYBaseAnalyticsEvent {
	FString message_id; // 0xa8
	FString message_name; // 0xb8
	bool Status; // 0xc8
};

struct FYVanityMaterialItem {
	FString ID; // 0x0
	int32_t material_index; // 0x10
};

struct FYStopItemCraftingResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	TArray<FYCustomItemInfo> itemsGrantedOrUpdated; // 0x20
	FString blueprintName; // 0x30
	int32_t itemRarity; // 0x40
	int32_t purchaseAmount; // 0x44
};

struct FClientUnlockContainerItemResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> GrantedItems; // 0x8
	FString UnlockedItemInstanceId; // 0x18
	FString UnlockedWithItemInstanceId; // 0x28
	UPlayFabJsonObject* VirtualCurrency; // 0x38
};

struct FGraphReference {
	UEdGraph* MacroGraph; // 0x0
	UBlueprint* GraphBlueprint; // 0x8
	FGuid GraphGuid; // 0x10
};

struct FYPendingPlayfabMessage {
	FYPlayfabMessage m_message; // 0x0
	bool m_isServer; // 0x40
};

struct FYRewardProgression {
	FString UserId; // 0x0
	TArray<FYPlayerReward> factionProgressionRewards; // 0x10
	int32_t seasonXP; // 0x20
	int32_t prospectorLevelXP; // 0x24
};

struct FRigUnit_AimItem : FRigUnit_HighlevelBaseMutable {
	FRigElementKey Item; // 0x68
	FRigUnit_AimItem_Target primary; // 0x74
	FRigUnit_AimItem_Target secondary; // 0xa0
	float weight; // 0xcc
	FRigUnit_AimBone_DebugSettings DebugSettings; // 0xd0
	FCachedRigElement CachedItem; // 0x110
	FCachedRigElement PrimaryCachedSpace; // 0x124
	FCachedRigElement SecondaryCachedSpace; // 0x138
};

struct FYScrapItem {
	TArray<FString> ids; // 0x0
	FString UserId; // 0x10
	FString factionId; // 0x20
	FYSellInventoryUpdate inventoryUpdateData; // 0x30
};

struct FYStashLimitUpdated {
	FString UserId; // 0x0
	int32_t stashLimit; // 0x10
};

struct FMeshElementAttributeData {
	FName AttributeName; // 0x0
	int32_t AttributeIndex; // 0x8
	FMeshElementAttributeValue AttributeValue; // 0x10
};

struct FClientGetPublisherDataRequest : FPlayFabRequestCommon {
	FString Keys; // 0x8
};

struct FVertexInstancesForPolygonHole {
	TArray<FVertexIndexAndInstanceID> VertexIndicesAndInstanceIDs; // 0x0
};

struct FRigUnit_MathFloatLess : FRigUnit_MathFloatBase {
	float A; // 0x8
	float B; // 0xc
	bool Result; // 0x10
};

struct FRigUnit_SetMultiControlFloat : FRigUnitMutable {
	TArray<FRigUnit_SetMultiControlFloat_Entry> entries; // 0x68
	float weight; // 0x78
	TArray<FCachedRigElement> CachedControlIndices; // 0x80
};

struct FServerMoveItemToCharacterFromUserRequest : FPlayFabRequestCommon {
	FString CharacterId; // 0x8
	FString ItemInstanceId; // 0x18
	FString PlayFabId; // 0x28
};

struct FYPlayerQuarterUpgradeType : FYDataTableRowBase {
	FText m_name; // 0x10
	FText m_description; // 0x28
	int32_t m_level; // 0x40
	int32_t m_nodeUpgradesRequired; // 0x44
	TArray<FYTechTreeCostEntryRow> m_costs; // 0x48
	int32_t m_upgradeTimeMinutes; // 0x58
	TArray<FYTechTreeCostEntryRow> m_initialRushCosts; // 0x60
};

struct FServerGetUserDataRequest : FPlayFabRequestCommon {
	int32_t IfChangedFromDataVersion; // 0x8
	FString Keys; // 0x10
	FString PlayFabId; // 0x20
};

struct FCRSimPointConstraint {
	ECRSimConstraintType Type; // 0x0
	int32_t SubjectA; // 0x4
	int32_t SubjectB; // 0x8
	FVector DataA; // 0xc
	FVector DataB; // 0x18
};

struct FClientUnlinkKongregateAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FAnimPhysConstraintSetup {
	AnimPhysLinearConstraintType LinearXLimitType; // 0x0
	AnimPhysLinearConstraintType LinearYLimitType; // 0x1
	AnimPhysLinearConstraintType LinearZLimitType; // 0x2
	FVector LinearAxesMin; // 0x4
	FVector LinearAxesMax; // 0x10
	AnimPhysAngularConstraintType AngularConstraintType; // 0x1c
	AnimPhysTwistAxis TwistAxis; // 0x1d
	AnimPhysTwistAxis AngularTargetAxis; // 0x1e
	float ConeAngle; // 0x20
	FVector AngularLimitsMin; // 0x24
	FVector AngularLimitsMax; // 0x30
	FVector AngularTarget; // 0x3c
};

struct FYGetCraftingInProgressDataResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	FYItemCurrentlyBeingCrafted itemCurrentlyBeingCrafted; // 0x20
};

struct FSynthSlateStyle : FSlateWidgetStyle {
	ESynthSlateSizeType SizeType; // 0x8
	ESynthSlateColorStyle ColorStyle; // 0x9
};

struct FYPlayerCommWheelUse : FYBaseAnalyticsEvent {
	int32_t time_since_match_start; // 0xa8
	FString command_name; // 0xb0
	int32_t player_location_x; // 0xc0
	int32_t player_location_y; // 0xc4
	int32_t player_location_z; // 0xc8
};

struct FYDamageHelper {
	bool m_isLoggingEnabled; // 0x0
	float m_baseDamage; // 0x4
	float m_multiplierRawAccumulated; // 0x8
};

struct FNiagaraParameterStore {
	UObject* Owner; // 0x8
	TArray<FNiagaraVariableWithOffset> SortedParameterOffsets; // 0x10
	TArray<char> ParameterData; // 0x20
	TArray<UNiagaraDataInterface*> DataInterfaces; // 0x30
	TArray<UObject*> UObjects; // 0x40
};

struct FRigUnit_Control_StaticMesh : FRigUnit_Control {
	FTransform MeshTransform; // 0xd0
};

struct FYUpdatePlayerSetResult {
	FString Error; // 0x0
	FString UserId; // 0x10
};

struct FClientGetPlayFabIDsFromGoogleIDsRequest : FPlayFabRequestCommon {
	FString GoogleIDs; // 0x8
};

struct FClientWriteEventResponse : FPlayFabResultCommon {
	FString EventId; // 0x8
};

struct FYPerkActivationData {
	FVector m_contextLocation; // 0x0
	UYGameplayAttributesComponent* m_gpaComponent; // 0x10
	AActor* m_contextActor; // 0x18
	AActor* m_instigator; // 0x20
	EYGameplayContextType m_contextType; // 0x28
};

struct FFloatRangeBound {
	ERangeBoundTypes Type; // 0x0
	float Value; // 0x4
};

struct FRigSpaceHierarchy {
	TArray<FRigSpace> Spaces; // 0x20
	TMap<FName, int32_t> NameToIndexMapping; // 0x30
	TArray<FName> Selection; // 0x80
};

struct FEntityDistanceAndMovementComponent {
	float Distance_4_0883B7A645B6339E19BDA09D82D06C33; // 0x0
	UYPlayerRenderTargetVfxMovementComponent_BP_C* RenderTargetMovementComponent_6_08E54D1B4963FEF770269899C40958C9; // 0x8
};

struct FYInboxMessageRow : FTableRowBase {
	EYInboxMessageType m_messageType; // 0x8
	bool m_autoOpen; // 0x9
	TSoftObjectPtr<UTexture2D> m_bannerImage; // 0x10
	FText m_sender; // 0x38
	FText m_subject; // 0x50
	FText m_message; // 0x68
};

struct FComponentReference {
	AActor* OtherActor; // 0x0
	FName ComponentProperty; // 0x8
	FString PathToComponent; // 0x10
};

struct FYUpdateReadState {
	FString messageId; // 0x0
	bool hasRead; // 0x10
};

struct FYExecuteFriendStateChangeReturnData {
	EYGetFriendListResult Result; // 0x0
	FString internalUserId; // 0x8
	TArray<FYFriendEntry> updatedFriends; // 0x18
};

struct FPhysicalSurfaceName {
	EPhysicalSurface Type; // 0x0
	FName Name; // 0x4
};

struct FYDurabilityAnalyticsPerPlayer {
	TMap<FString, FYDurabilityAnalyticsEvent> m_itemAnalytics; // 0x0
};

struct FYMockAIWorldWrapper {
	UWorld* m_world; // 0x0
};

struct FYLeadboardPlacementRewardDropTableEntry {
	FText m_rewardsPackageName; // 0x0
	int32_t m_leaderboardRank; // 0x18
	UDataTable* m_rewardsDT; // 0x20
	UDataTable* m_prospectorLevelVPRewardsDT; // 0x28
};

struct FServerUpdateCharacterDataResult : FPlayFabResultCommon {
	int32_t DataVersion; // 0x8
};

struct FRigUnit_ModifyTransforms_PerItem {
	FRigElementKey Item; // 0x0
	FTransform Transform; // 0x10
};

struct FPowerIKGroundCollision {
	ECollisionChannel CollisionChannel; // 0x0
	bool TraceComplex; // 0x1
	float RayCastUp; // 0x4
	float RayCastDown; // 0x8
	bool EnableWallCollision; // 0xc
	float WallOffset; // 0x10
};

struct FYWeaponImpactDataTableRow : FYImpactDataTableRow {
	EYImpactActorRotation m_actorSpawnRotation; // 0x20
	FDataTableRowHandle m_tuningDataTableRow; // 0x28
	FDataTableRowHandle m_spawnedActorAssociatedRow; // 0x38
	TSoftClassPtr<UObject> m_replicatedActorToSpawn; // 0x48
	AActor* m_nonReplicatedActorToSpawn; // 0x70
	TArray<FYGameplayAttributeModifier> m_gameplayAttributesToAddOnImpact; // 0x78
	bool m_shouldHaveFxCategory; // 0x88
	FDataTableRowHandle m_aiSenseTriggerRowHandle; // 0x90
};

struct FAnimSyncMarker {
	FName MarkerName; // 0x0
	float Time; // 0x8
};

struct FYPlayerUIHealthBarDeltaSettings {
	FYPlayerUIHealthBarDeltaSettingsDetails m_healthOwn; // 0x0
	FYPlayerUIHealthBarDeltaSettingsDetails m_shieldOwn; // 0xc
	FYPlayerUIHealthBarDeltaSettingsDetails m_healthOnCharacterPlates; // 0x18
	FYPlayerUIHealthBarDeltaSettingsDetails m_shieldOnCharacterPlates; // 0x24
};

struct FPrefabricatorAssetCollectionItem {
	TSoftObjectPtr<UPrefabricatorAsset> PrefabAsset; // 0x0
	float weight; // 0x28
};

struct FYRequestUserStateUpdateBroadcastToFriends {
	TArray<FString> Friends; // 0x0
};

struct FYCachedFactionLevel {
	TArray<FYUnlockedShopItem> m_unlockedShopItems; // 0x0
	TArray<FDataTableRowHandle> m_unlockedContracts; // 0x10
};

struct FRigUnit_MathTransformRotateVector : FRigUnit_MathTransformBase {
	FTransform Transform; // 0x10
	FVector Direction; // 0x40
	FVector Result; // 0x4c
};

struct FYFetchEntitlements {
	FString epicAccountId; // 0x0
	FString epicAccessToken; // 0x10
};

struct FTwistConstraint : FConstraintBaseParams {
	float TwistLimitDegrees; // 0x14
	EAngularConstraintMotion TwistMotion; // 0x18
};

struct FClientWriteClientPlayerEventRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Body; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString EventName; // 0x18
	FString Timestamp; // 0x28
};

struct FNiagaraSystemScalabilitySettingsArray {
	TArray<FNiagaraSystemScalabilitySettings> Settings; // 0x0
};

struct FPhysicalAnimationData {
	FName BodyName; // 0x0
	char bIsLocalSimulation : 1; // 0x8
	float OrientationStrength; // 0xc
	float AngularVelocityStrength; // 0x10
	float PositionStrength; // 0x14
	float VelocityStrength; // 0x18
	float MaxLinearForce; // 0x1c
	float MaxAngularForce; // 0x20
};

struct FServerAddCharacterVirtualCurrencyRequest : FPlayFabRequestCommon {
	int32_t Amount; // 0x8
	FString CharacterId; // 0x10
	UPlayFabJsonObject* CustomTags; // 0x20
	FString PlayFabId; // 0x28
	FString VirtualCurrency; // 0x38
};

struct FYNetPlayerInventoryUpdate {
	TArray<FYInventoryItem> m_itemsToAdd; // 0x0
	TArray<FYInventoryItem> m_itemsToUpdate; // 0x10
	TArray<FString> m_itemsToRemove; // 0x20
};

struct FYCharacterCustomizationSetRow : FYVanityItemRowBase {
	EYCustomizationCategory m_customizationCategoryType; // 0x378
	TArray<TSoftObjectPtr<UTexture2D>> m_colorVariationIcons; // 0x380
	TArray<FYCharacterCustomizationSetItem> m_items; // 0x390
};

struct FYSetQuestCompleted {
	FString UserId; // 0x0
	TArray<FYQuestUpdateDataEntry> entries; // 0x10
};

struct FClientGetUserInventoryRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FYActorArray {
	TArray<AActor*> m_actors; // 0x0
};

struct FVehicleInputRate {
	float RiseRate; // 0x0
	float FallRate; // 0x4
};

struct FQuartzTimeSignature {
	int32_t NumBeats; // 0x0
	EQuartzTimeSignatureQuantization BeatType; // 0x4
	TArray<FQuartzPulseOverrideStep> OptionalPulseOverride; // 0x8
};

struct FYMatchmakingListDebugUserInfoResult {
	FString UserId; // 0x0
	int32_t userNVR; // 0x10
	TArray<FYUserStatisticsEntry> Statistics; // 0x18
	bool isBeginner; // 0x28
	TArray<FYMatchmakingDebugSessionUserInfo> matchmakingSessionsUserInfo; // 0x30
	int32_t dataTableDeathCooldownMinutes; // 0x40
	bool dataTableBeginnerFlagEnabled; // 0x44
	bool featureToggleSplitSoloAndSquadMatchesEnabled; // 0x45
};

struct FNiagaraCollisionEventPayload {
	FVector CollisionPos; // 0x0
	FVector CollisionNormal; // 0xc
	FVector CollisionVelocity; // 0x18
	int32_t ParticleIndex; // 0x24
	int32_t PhysicalMaterialIndex; // 0x28
};

struct FRigUnit_ChainHarmonics : FRigUnit_HighlevelBaseMutable {
	FName ChainRoot; // 0x68
	FVector Speed; // 0x70
	FRigUnit_ChainHarmonics_Reach Reach; // 0x7c
	FRigUnit_ChainHarmonics_Wave Wave; // 0xa4
	FRuntimeFloatCurve WaveCurve; // 0xe8
	FRigUnit_ChainHarmonics_Pendulum Pendulum; // 0x170
	bool bDrawDebug; // 0x1ac
	FTransform DrawWorldOffset; // 0x1b0
	FRigUnit_ChainHarmonics_WorkData WorkData; // 0x1e0
};

struct FYStationConnect {
	FString addr; // 0x0
	FString roomId; // 0x10
	bool connectSinglePlayer; // 0x20
	int32_t shardIndex; // 0x24
	bool isMatch; // 0x28
};

struct FServerRemoveSharedGroupMembersRequest : FPlayFabRequestCommon {
	FString PlayFabIds; // 0x8
	FString SharedGroupId; // 0x18
};

struct FCameraPreviewInfo {
	APawn* PawnClass; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	FVector Location; // 0x10
	FRotator Rotation; // 0x1c
	APawn* PawnInst; // 0x28
};

struct FMovieSceneParameterSectionTemplate : FMovieSceneEvalTemplate {
	TArray<FScalarParameterNameAndCurve> Scalars; // 0x20
	TArray<FBoolParameterNameAndCurve> Bools; // 0x30
	TArray<FVector2DParameterNameAndCurves> Vector2Ds; // 0x40
	TArray<FVectorParameterNameAndCurves> Vectors; // 0x50
	TArray<FColorParameterNameAndCurves> Colors; // 0x60
	TArray<FTransformParameterNameAndCurves> Transforms; // 0x70
};

struct FYAbilityActionHealWardData : FYAbilityActionDataTableRow {
	float m_healPerSecond; // 0x78
	float m_healWardFinalRadius; // 0x7c
	bool m_attachToOwner; // 0x80
	bool m_isDestructable; // 0x81
	UMaterialInstance* m_healwardMaterial; // 0x88
	EYDamageApplication m_application; // 0x90
};

struct FMaterialQualityOverrides {
	bool bDiscardQualityDuringCook; // 0x0
	bool bEnableOverride; // 0x1
	bool bForceFullyRough; // 0x2
	bool bForceNonMetal; // 0x3
	bool bForceDisableLMDirectionality; // 0x4
	bool bForceLQReflections; // 0x5
	bool bForceDisablePreintegratedGF; // 0x6
	bool bDisableMaterialNormalCalculation; // 0x7
	EMobileShadowQuality MobileShadowQuality; // 0x8
};

struct FYDEPRECATED_PullUpData {
	FVector m_relativePullUpLocation; // 0x0
	bool m_isActive; // 0xc
};

struct FYUserInfosUpdated {
	TArray<FYClientUserInfo> clientUserInfos; // 0x0
};

struct FYRequestUpgradeItemResult {
	bool SUCCESS; // 0x0
	FString UserId; // 0x8
	TArray<FYCustomItemInfo> resultEntries; // 0x18
	TArray<FYInstanceUpdateAmount> instanceUpdate; // 0x28
};

struct FRigUnit_VisualDebugVector : FRigUnit_DebugBase {
	FVector Value; // 0x8
	bool bEnabled; // 0x14
	ERigUnitVisualDebugPointMode Mode; // 0x15
	FLinearColor Color; // 0x18
	float Thickness; // 0x28
	float Scale; // 0x2c
	FName BoneSpace; // 0x30
};

struct FYGetPlayersActiveRankedSeasonClientRequest {
	TArray<FString> otherPlayersIds; // 0x0
};

struct FMovieSceneGeometryCacheParams {
	UGeometryCache* GeometryCacheAsset; // 0x0
	FFrameNumber FirstLoopStartFrameOffset; // 0x8
	FFrameNumber StartFrameOffset; // 0xc
	FFrameNumber EndFrameOffset; // 0x10
	float PlayRate; // 0x14
	char bReverse : 1; // 0x18
	float StartOffset; // 0x1c
	float EndOffset; // 0x20
	FSoftObjectPath GeometryCache; // 0x28
};

struct FTimeSynthFilterSettings {
	ETimeSynthFilterType FilterType; // 0x0
	float CutoffFrequency; // 0x4
	float FilterQ; // 0x8
};

struct FYFetchEGSEntitlementsRequest {
	FString epicAccessToken; // 0x0
};

struct FKBoxElem : FKShapeElem {
	FVector Center; // 0x30
	FRotator Rotation; // 0x3c
	float X; // 0x48
	float Y; // 0x4c
	float Z; // 0x50
};

struct FOverlayItem {
	FTimespan StartTime; // 0x0
	FTimespan EndTime; // 0x8
	FString Text; // 0x10
	FVector2D Position; // 0x20
};

struct FAdminIncrementLimitedEditionItemAvailabilityRequest : FPlayFabRequestCommon {
	int32_t Amount; // 0x8
	FString CatalogVersion; // 0x10
	UPlayFabJsonObject* CustomTags; // 0x20
	FString ItemId; // 0x28
};

struct FClientLinkFacebookAccountRequest : FPlayFabRequestCommon {
	FString AccessToken; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	bool ForceLink; // 0x20
};

struct FServerAwardSteamAchievementResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> AchievementResults; // 0x8
};

struct FFloatDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FYMissionCompletedResult {
	FString UserId; // 0x0
	FString currentMissionID; // 0x10
	TArray<FYCustomItemInfo> rewards; // 0x20
	TArray<FYCurrencyItem> updatedCurrencies; // 0x30
	int32_t progress; // 0x40
	bool shouldShowPopup; // 0x44
};

struct FBandwidthTestGenerator {
	TArray<FBandwidthTestItem> ReplicatedBuffers; // 0x0
};

struct FColorGradingSettings {
	FColorGradePerRangeSettings Global; // 0x0
	FColorGradePerRangeSettings Shadows; // 0x50
	FColorGradePerRangeSettings Midtones; // 0xa0
	FColorGradePerRangeSettings Highlights; // 0xf0
	float ShadowsMax; // 0x140
	float HighlightsMin; // 0x144
};

struct FYRoomPlayer {
	FString UserId; // 0x0
	FString Name; // 0x10
};

struct FInstancedStaticMeshLightMapInstanceData {
	FTransform Transform; // 0x0
	TArray<FGuid> MapBuildDataIds; // 0x30
};

struct FGerstnerWaveOctave {
	int32_t NumWaves; // 0x0
	float AmplitudeScale; // 0x4
	float MainDirection; // 0x8
	float SpreadAngle; // 0xc
	bool bUniformSpread; // 0x10
};

struct FScalarParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	float ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x14
};

struct FHorizonTweenEventTransformParam {
	bool bSweep; // 0x0
	bool bTeleport; // 0x1
	bool bCollideAndFinishEvent; // 0x2
	bool bCollideAndFinishEventTweenToEnd; // 0x3
	EHorizonTweenCoordinateSpace CoordinateSpaceType; // 0x4
	FHitResult SweepHitResult; // 0x8
};

struct FAlphaBlend {
	UCurveFloat* CustomCurve; // 0x0
	float BlendTime; // 0x8
	EAlphaBlendOption BlendOption; // 0x24
};

struct FRigUnit_MathIntLess : FRigUnit_MathIntBase {
	int32_t A; // 0x8
	int32_t B; // 0xc
	bool Result; // 0x10
};

struct FYRewardsPoolGrantTupleRow : FTableRowBase {
	EYRewardType m_rewardType; // 0x8
	int32_t m_grantAmount; // 0xc
};

struct FAdminGetServerBuildUploadURLRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
};

struct FYRuntimeInventoryWeightInfo {
	float m_maxBagContainerWeight; // 0x0
	float m_currentBagContainerWeight; // 0x4
	float m_maxSafeContainerWeight; // 0x8
	float m_currentSafeContainerWeight; // 0xc
};

struct FYUpdatePlayerSet {
	FString UserId; // 0x0
	FYPlayerSet newSet; // 0x10
};

struct FMovieSceneEvalTemplate : FMovieSceneEvalTemplateBase {
	EMovieSceneCompletionMode CompletionMode; // 0x10
	TWeakObjectPtr<UMovieSceneSection> SourceSectionPtr; // 0x14
};

struct FAdminUpdatePlayerStatisticDefinitionResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Statistic; // 0x8
};

struct FNiagaraEmitterScalabilitySettings {
	FNiagaraPlatformSet Platforms; // 0x0
	char bScaleSpawnCount : 1; // 0x30
	float SpawnCountScale; // 0x34
};

struct FConstraintNodeData {
	FTransform RelativeParent; // 0x0
	FConstraintOffset ConstraintOffset; // 0x30
	FName LinkedNode; // 0x90
	TArray<FTransformConstraint> Constraints; // 0x98
};

struct FBatchedPoint {
	FVector Position; // 0x0
	FLinearColor Color; // 0xc
	float PointSize; // 0x1c
	float RemainingLifeTime; // 0x20
	char DepthPriority; // 0x24
};

struct FBlueprintInputKeyDelegateBinding : FBlueprintInputDelegateBinding {
	FInputChord InputChord; // 0x8
	EInputEvent InputKeyEvent; // 0x28
	FName FunctionNameToBind; // 0x2c
};

struct FRigUnit_BlendTransform : FRigUnit {
	FTransform Source; // 0x10
	TArray<FBlendTarget> Targets; // 0x40
	FTransform Result; // 0x50
};

struct FYUpdateVanityData {
	FDataTableRowHandle m_rowHandle; // 0x0
	int32_t m_materialIndex; // 0x10
};

struct FBoxSphereBounds {
	FVector Origin; // 0x0
	FVector BoxExtent; // 0xc
	float SphereRadius; // 0x18
};

struct FAxis {
	FVector Axis; // 0x0
	bool bInLocalSpace; // 0xc
};

struct FYModifyPlayerSkillsResult {
	bool succeeded; // 0x0
	TArray<FYPlayerSkillData> entries; // 0x8
};

struct FPowerIKCenterOfGravity {
	float Alpha; // 0x0
	float HorizAmount; // 0x4
	float VertAmount; // 0x8
	float PullBodyAmount; // 0xc
};

struct FYTransitionRuntimeData {
	FYTransitionRequestData m_initData; // 0x0
};

struct FVolumeControlStyle : FSlateWidgetStyle {
	FSliderStyle SliderStyle; // 0x8
	FSlateBrush HighVolumeImage; // 0x348
	FSlateBrush MidVolumeImage; // 0x3d0
	FSlateBrush LowVolumeImage; // 0x458
	FSlateBrush NoVolumeImage; // 0x4e0
	FSlateBrush MutedImage; // 0x568
};

struct FRichCurveKey {
	ERichCurveInterpMode InterpMode; // 0x0
	ERichCurveTangentMode TangentMode; // 0x1
	ERichCurveTangentWeightMode TangentWeightMode; // 0x2
	float Time; // 0x4
	float Value; // 0x8
	float ArriveTangent; // 0xc
	float ArriveTangentWeight; // 0x10
	float LeaveTangent; // 0x14
	float LeaveTangentWeight; // 0x18
};

struct FAdminGetTaskInstancesResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Summaries; // 0x8
};

struct FInsightsInsightsGetPendingOperationsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString OperationType; // 0x10
};

struct FQuat {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
	float W; // 0xc
};

struct FPoseDataContainer {
	TArray<FSmartName> PoseNames; // 0x0
	TArray<FName> Tracks; // 0x10
	TMap<FName, int32_t> TrackMap; // 0x20
	TArray<FPoseData> Poses; // 0x70
	TArray<FAnimCurveBase> Curves; // 0x80
};

struct FYDebugAddRandomFriendsResult {
	EYSocialRequestResult Result; // 0x0
};

struct FAdminCreateOpenIdConnectionRequest : FPlayFabRequestCommon {
	FString ClientId; // 0x8
	FString ClientSecret; // 0x18
	FString ConnectionId; // 0x28
	FString IssuerDiscoveryUrl; // 0x38
	UPlayFabJsonObject* IssuerInformation; // 0x48
};

struct FYGetPlayerContractsResult {
	FString UserId; // 0x0
	FString Error; // 0x10
	TArray<FYActiveContractPlayerData> activeContracts; // 0x20
	FYFactionsContractsData factionsContracts; // 0x30
	int32_t refreshHours24UtcFromBackend; // 0x48
};

struct FYContractObjectiveConditions {
	TArray<FDataTableRowHandle> m_locationConditions; // 0x0
};

struct FInsightsInsightsSetPerformanceRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	int32_t PerformanceLevel; // 0x10
};

struct FYHUDInfoEntry {
	TWeakObjectPtr<UObject> Object; // 0x0
	EYHUDInfoPriorityCategory Category; // 0x8
	EYHUDInfoMessageState messageState; // 0x9
	FText Text; // 0x10
	int32_t Priority; // 0x28
};

struct FYLoreItemsAdded {
	TArray<FYLoreBackendItemInfo> loreItems; // 0x0
};

struct FARSessionStatus {
	FString AdditionalInfo; // 0x0
	EARSessionStatus Status; // 0x10
};

struct FSkeletalMeshBuildSettings {
	char bRecomputeNormals : 1; // 0x0
	char bRecomputeTangents : 1; // 0x0
	char bUseMikkTSpace : 1; // 0x0
	char bComputeWeightedNormals : 1; // 0x0
	char bRemoveDegenerates : 1; // 0x0
	char bUseHighPrecisionTangentBasis : 1; // 0x0
	char bUseFullPrecisionUVs : 1; // 0x0
	char bBuildAdjacencyBuffer : 1; // 0x0
	float ThresholdPosition; // 0x4
	float ThresholdTangentNormal; // 0x8
	float ThresholdUV; // 0xc
	float MorphThresholdPosition; // 0x10
};

struct FNiagaraScriptHighlight {
	FLinearColor Color; // 0x0
	FText DisplayName; // 0x10
};

struct FSubdivisionLimitSection {
	TArray<FSubdividedQuad> SubdividedQuads; // 0x0
};

struct FSourceEffectFoldbackDistortionSettings {
	float InputGainDb; // 0x0
	float ThresholdDb; // 0x4
	float OutputGainDb; // 0x8
};

struct FMultiplayerGetMultiplayerServerLogsResponse : FPlayFabResultCommon {
	FString LogDownloadUrl; // 0x8
};

struct FRigidBodyContactInfo {
	FVector ContactPosition; // 0x0
	FVector ContactNormal; // 0xc
	float ContactPenetration; // 0x18
	UPhysicalMaterial* PhysMaterial[0x2]; // 0x20
};

struct FRigUnit_EndProfilingTimer : FRigUnit_DebugBaseMutable {
	int32_t NumberOfMeasurements; // 0x68
	FString Prefix; // 0x70
	float AccumulatedTime; // 0x80
	int32_t MeasurementsLeft; // 0x84
};

struct FRigUnit_QuaternionToAngle : FRigUnit {
	FVector Axis; // 0x8
	FQuat Argument; // 0x20
	float Angle; // 0x30
};

struct FPrecomputedLightInstanceData : FSceneComponentInstanceData {
	FTransform Transform; // 0xc0
	FGuid LightGuid; // 0xf0
	int32_t PreviewShadowMapChannel; // 0x100
};

struct FAssetMapping {
	UAnimationAsset* SourceAsset; // 0x0
	UAnimationAsset* TargetAsset; // 0x8
};

struct FClientGameServerRegionsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Regions; // 0x8
};

struct FYPurchaseInventoryInsuranceRequest {
	FString m_insuranceId; // 0x0
	TArray<FString> m_itemIds; // 0x10
};

struct FInsightsInsightsGetDetailsResponse : FPlayFabResultCommon {
	int32_t DataUsageMb; // 0x8
	FString ErrorMessage; // 0x10
	UPlayFabJsonObject* Limits; // 0x20
	TArray<UPlayFabJsonObject*> PendingOperations; // 0x28
	int32_t PerformanceLevel; // 0x38
	int32_t RetentionDays; // 0x3c
};

struct FDataAbortFileUploadsResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	int32_t ProfileVersion; // 0x10
};

struct FNiagaraScriptDataInterfaceInfo {
	UNiagaraDataInterface* DataInterface; // 0x0
	FName Name; // 0x8
	int32_t UserPtrIdx; // 0x10
	FNiagaraTypeDefinition Type; // 0x18
	FName RegisteredParameterMapRead; // 0x28
	FName RegisteredParameterMapWrite; // 0x30
};

struct FYDebugRemoveAllActiveContractsRequest {
	FString UserId; // 0x0
};

struct FYDebugClearSpecificCompletedContractResult {
	FString UserId; // 0x0
	FString Error; // 0x10
};

struct FClothCollisionPrim_Convex {
	TArray<FPlane> Planes; // 0x0
	TArray<FVector> SurfacePoints; // 0x10
	int32_t BoneIndex; // 0x20
};

struct FYPlayFabFriendWithState {
	FYPlayFabFriend PlayerInfo; // 0x0
	EYSocialGameStateType PlayerOnlineState; // 0x28
};

struct FVertexAttributesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FMeshElementAttributeList> PerimeterVertexAttributeLists; // 0x8
	TArray<FVertexAttributesForPolygonHole> VertexAttributeListsForEachHole; // 0x18
};

struct FRigUnit_OffsetTransformForItem : FRigUnitMutable {
	FRigElementKey Item; // 0x68
	FTransform OffsetTransform; // 0x80
	float weight; // 0xb0
	bool bPropagateToChildren; // 0xb4
	FCachedRigElement CachedIndex; // 0xb8
};

struct FClientRegisterWithWindowsHelloRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DeviceName; // 0x10
	FString EncryptedRequest; // 0x20
	UPlayFabJsonObject* InfoRequestParameters; // 0x30
	FString PlayerSecret; // 0x38
	FString PublicKey; // 0x48
	FString Username; // 0x58
};

struct FMovieSceneNiagaraVectorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	FMovieSceneFloatChannel VectorChannels[0x4]; // 0x40
	int32_t ChannelsUsed; // 0x2c0
};

struct FCachedAnimTransitionData {
	FName StateMachineName; // 0x0
	FName FromStateName; // 0x8
	FName ToStateName; // 0x10
};

struct FExperimentationGetLatestScorecardResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Scorecard; // 0x8
};

struct FMultiplayerGetTitleEnabledForMultiplayerServersStatusRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
};

struct FNiagaraTypeLayoutInfo {
	TArray<uint32_t> FloatComponentByteOffsets; // 0x0
	TArray<uint32_t> FloatComponentRegisterOffsets; // 0x10
	TArray<uint32_t> Int32ComponentByteOffsets; // 0x20
	TArray<uint32_t> Int32ComponentRegisterOffsets; // 0x30
	TArray<uint32_t> HalfComponentByteOffsets; // 0x40
	TArray<uint32_t> HalfComponentRegisterOffsets; // 0x50
};

struct FYStopItemCraftingRequest {
	FString UserId; // 0x0
	FString blueprintName; // 0x10
	int32_t blueprintRarity; // 0x20
	int32_t purchaseAmount; // 0x24
};

struct FNavDataConfig : FNavAgentProperties {
	FName Name; // 0x30
	FColor Color; // 0x38
	FVector DefaultQueryExtent; // 0x3c
	AActor* NavigationDataClass; // 0x48
	TSoftClassPtr<UObject> NavDataClass; // 0x50
};

struct FYActiveContractPlayerData {
	FString contractId; // 0x0
	TArray<int32_t> progress; // 0x10
};

struct FFastArraySerializer {
	int32_t ArrayReplicationKey; // 0x54
	EFastArraySerializerDeltaFlags DeltaFlags; // 0x100
};

struct FMulticastRecordOptions {
	FString FuncPathName; // 0x0
	bool bServerSkip; // 0x10
	bool bClientSkip; // 0x11
};

struct FAnimSlotDesc {
	FName SlotName; // 0x0
	int32_t NumChannels; // 0x8
};

struct FViewTargetTransitionParams {
	float BlendTime; // 0x0
	EViewTargetBlendFunction BlendFunction; // 0x4
	float BlendExp; // 0x8
	char bLockOutgoing : 1; // 0xc
};

struct FYGlobalVanityUpdateResultData {
	EYUpdateGlobalVanityResult returnResult; // 0x0
	FYGlobalVanityData globalVanity; // 0x8
};

struct FYSquadMatchmakingReady {
	FString squadId; // 0x0
	FYUserMatchmakingSettings matchmakingSettings; // 0x10
};

struct FYPlayerFactionProgressData {
	FString factionId; // 0x0
	int32_t currentProgression; // 0x10
};

struct FLatentActionInfo {
	int32_t Linkage; // 0x0
	int32_t UUID; // 0x4
	FName ExecutionFunction; // 0x8
	UObject* CallbackTarget; // 0x10
};

struct FYBossEncounterActivityStats : FYBaseActivityStats {
	int32_t boss_damage_done; // 0xb8
	int32_t boss_damage_taken; // 0xbc
	int32_t encounter_duration; // 0xc0
};

struct FAIDataProviderIntValue : FAIDataProviderTypedValue {
	int32_t DefaultValue; // 0x30
};

struct FBox2D {
	FVector2D Min; // 0x0
	FVector2D Max; // 0x8
	char bIsValid; // 0x10
};

struct FVertexPair {
	FVertexID VertexID0; // 0x0
	FVertexID VertexID1; // 0x4
};

struct FCameraCutInfo {
	FVector Location; // 0x0
	float Timestamp; // 0xc
};

struct FAdminCheckLimitedEditionItemAvailabilityResult : FPlayFabResultCommon {
	int32_t Amount; // 0x8
};

struct FMovieSceneSectionParameters {
	FFrameNumber StartFrameOffset; // 0x0
	bool bCanLoop; // 0x4
	FFrameNumber EndFrameOffset; // 0x8
	FFrameNumber FirstLoopStartFrameOffset; // 0xc
	float TimeScale; // 0x10
	int32_t HierarchicalBias; // 0x14
	float StartOffset; // 0x18
	float PrerollTime; // 0x1c
	float PostrollTime; // 0x20
};

struct FAuthenticationGetEntityTokenResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	FString EntityToken; // 0x10
	FString TokenExpiration; // 0x20
};

struct FYCompleteQuestState {
	FYQuestState questState; // 0x0
};

struct FSubmixEffectFilterSettings {
	ESubmixFilterType FilterType; // 0x0
	ESubmixFilterAlgorithm FilterAlgorithm; // 0x1
	float FilterFrequency; // 0x4
	float FilterQ; // 0x8
};

struct FYShopPromotionRow : FTableRowBase {
	EYPromotionType m_promotionType; // 0x8
	FString m_startDateTime; // 0x10
	int64_t m_utcStartDateTime; // 0x20
	int32_t m_layoutIdx; // 0x28
	TArray<FDataTableRowHandle> m_shopOffers; // 0x30
};

struct FClientLinkWindowsHelloAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString DeviceName; // 0x10
	bool ForceLink; // 0x20
	FString PublicKey; // 0x28
	FString Username; // 0x38
};

struct FDataFinalizeFileUploadsResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	UPlayFabJsonObject* MetaData; // 0x10
	int32_t ProfileVersion; // 0x18
};

struct FMultiplayerBuildAliasDetailsResponse : FPlayFabResultCommon {
	FString AliasId; // 0x8
	FString AliasName; // 0x18
	TArray<UPlayFabJsonObject*> BuildSelectionCriteria; // 0x28
	int32_t PageSize; // 0x38
	FString SkipToken; // 0x40
};

struct FYUserRawStatsData {
	FString m_productUserId; // 0x0
	TArray<FYRawStatEntry> m_statEntries; // 0x10
};

struct FMultiplayerCancelAllServerBackfillTicketsForPlayerRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	FString QueueName; // 0x18
};

struct FYGamePingEntry {
	UPingIP* m_pinger; // 0x20
};

struct FServerBanUsersResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BanData; // 0x8
};

struct FAdminRevokeInventoryItemsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Errors; // 0x8
};

struct FClientGetPhotonAuthenticationTokenRequest : FPlayFabRequestCommon {
	FString PhotonApplicationId; // 0x8
};

struct FPowerIKPoleVector {
	EPoleVectorModeEnum Mode; // 0x0
	FVector Position; // 0x4
	FName BoneName; // 0x10
	float AngleOffset; // 0x1c
};

struct FYDebugAddRandomFriends {
	FString UserId; // 0x0
	int32_t Amount; // 0x10
};

struct FHorizonTweenEventActorColorFromToParameters : FHorizonTweenEventLinearColorParameters {
	TWeakObjectPtr<AActor> TweenTargetWeakPtr; // 0x238
};

struct FYPlayerAnnouncementAudioData {
	FDataTableRowHandle m_gearStoreSuccessfulPurchase; // 0x0
	FDataTableRowHandle m_gearStoreSuccessfulUpgrade; // 0x10
	FDataTableRowHandle m_levelUp; // 0x20
	FDataTableRowHandle m_maxLevel; // 0x30
	FDataTableRowHandle m_pactInviteIssued; // 0x40
	FDataTableRowHandle m_pactInviteReceived; // 0x50
	FDataTableRowHandle m_pactAccepted; // 0x60
	FDataTableRowHandle m_pactDeclined; // 0x70
	FDataTableRowHandle m_pactStartCancellation; // 0x80
	FDataTableRowHandle m_pactEnded; // 0x90
	FDataTableRowHandle m_pactMateRevived; // 0xa0
	FDataTableRowHandle m_suitPactmateDied; // 0xb0
	FDataTableRowHandle m_suitHealthWarningStart; // 0xc0
	FDataTableRowHandle m_BFCEscapeSuccess; // 0xd0
	FDataTableRowHandle m_BFCEscapeFailure; // 0xe0
	FDataTableRowHandle m_BFCPlayerDiedbyMonster; // 0xf0
	FDataTableRowHandle m_BFCPlayedDiedbyPlayer; // 0x100
	FDataTableRowHandle m_BFCYouKilledaPlayer; // 0x110
	FDataTableRowHandle m_SuitPlayerEnterDBNO; // 0x120
	FDataTableRowHandle m_SuitPlayerRevived; // 0x130
	FDataTableRowHandle m_suitStartExecuting; // 0x140
	FDataTableRowHandle m_suitStartReviving; // 0x150
	FDataTableRowHandle m_bountyAnnounced; // 0x160
	FDataTableRowHandle m_localPlayerGottenBounty; // 0x170
	FDataTableRowHandle m_bountyCollected; // 0x180
	FDataTableRowHandle m_localPlayerBountyTaken; // 0x190
	FDataTableRowHandle m_bountyTimedOut; // 0x1a0
	FDataTableRowHandle m_localPlayerBountyTimedOut; // 0x1b0
};

struct FClientCancelTradeResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Trade; // 0x8
};

struct FRigUnit_DrawContainerSetTransform : FRigUnitMutable {
	FName InstructionName; // 0x68
	FTransform Transform; // 0x70
};

struct FServerGetPlayerProfileRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
	UPlayFabJsonObject* ProfileConstraints; // 0x20
};

struct FServerUpdateUserInventoryItemDataRequest : FPlayFabRequestCommon {
	FString CharacterId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	UPlayFabJsonObject* Data; // 0x20
	FString ItemInstanceId; // 0x28
	FString KeysToRemove; // 0x38
	FString PlayFabId; // 0x48
};

struct FRigUnit_MathTransformFromEulerTransform : FRigUnit_MathTransformBase {
	FEulerTransform EulerTransform; // 0x8
	FTransform Result; // 0x30
};

struct FRigUnit_VerletIntegrateVector : FRigUnit_SimBase {
	FVector Target; // 0x8
	float Strength; // 0x14
	float Damp; // 0x18
	float Blend; // 0x1c
	FVector Position; // 0x20
	FVector Velocity; // 0x2c
	FVector Acceleration; // 0x38
	FCRSimPoint Point; // 0x44
	bool bInitialized; // 0x6c
};

struct FSolverCollisionData {
	FVector Location; // 0x0
	FVector AccumulatedImpulse; // 0xc
	FVector Normal; // 0x18
	FVector Velocity1; // 0x24
	FVector Velocity2; // 0x30
	FVector AngularVelocity1; // 0x3c
	FVector AngularVelocity2; // 0x48
	float Mass1; // 0x54
	float Mass2; // 0x58
	int32_t ParticleIndex; // 0x5c
	int32_t LevelsetIndex; // 0x60
	int32_t ParticleIndexMesh; // 0x64
	int32_t LevelsetIndexMesh; // 0x68
};

struct FYDebugSetTechTreeNodeLevel {
	FString UserId; // 0x0
	FString nodeId; // 0x10
	int32_t Level; // 0x20
};

struct FAnimNode_RotateRootBone : FAnimNode_Base {
	FPoseLink BasePose; // 0x10
	float Pitch; // 0x20
	float Yaw; // 0x24
	FInputScaleBiasClamp PitchScaleBiasClamp; // 0x28
	FInputScaleBiasClamp YawScaleBiasClamp; // 0x58
	FRotator MeshToComponent; // 0x88
};

struct FYSocialActionRequestEntry {
	bool m_useLocalUID; // 0x0
	FString m_overwriteUID; // 0x8
	TArray<FYFriendAction> m_actions; // 0x18
};

struct FServerListUsersCharactersResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Characters; // 0x8
};

struct FEditedDocumentInfo {
	FSoftObjectPath EditedObjectPath; // 0x0
	FVector2D SavedViewOffset; // 0x18
	float SavedZoomAmount; // 0x20
	UObject* EditedObject; // 0x28
};

struct FComponentOverrideRecord {
	UObject* ComponentClass; // 0x0
	UActorComponent* ComponentTemplate; // 0x8
	FComponentKey ComponentKey; // 0x10
	FBlueprintCookedComponentInstancingData CookedComponentInstancingData; // 0x30
};

struct FCapturedPixelsID {
	TMap<FName, FName> Identifiers; // 0x0
};

struct FServerUnlinkPSNAccountRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString PlayFabId; // 0x10
};

struct FPredictProjectilePathResult {
	TArray<FPredictProjectilePathPointData> PathData; // 0x0
	FPredictProjectilePathPointData LastTraceDestination; // 0x10
	FHitResult HitResult; // 0x2c
};

struct FServerSendCustomAccountRecoveryEmailRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString Email; // 0x10
	FString EmailTemplateId; // 0x20
	FString Username; // 0x30
};

struct FYGetPassiveGenerators {
	FString UserId; // 0x0
};

struct FClientGetPlayFabIDsFromFacebookInstantGamesIdsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Data; // 0x8
};

struct FAdminRevokeBansResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BanData; // 0x8
};

struct FYDefaultDirectXVersion {
	FText m_label; // 0x0
	FString m_defaultDirectXVersion; // 0x18
};

struct FYActiveCustomizationData {
	FName m_archetypeID; // 0x0
	int32_t m_slotIndex; // 0x8
	EYCustomizationBodyType m_bodyType; // 0xc
	TArray<FYCharacterCustomizationBodyPart> m_bodyParts; // 0x10
};

struct FYCharacterVanityUpdateBodyPart {
	FString UserId; // 0x0
	FString ID; // 0x10
	int32_t material_index; // 0x20
	FString archetypeId; // 0x28
};

struct FRootMotionSourceSettings {
	char Flags; // 0x0
};

struct FYOnboardingBlockedFeaturesDataTableRow : FYDataTableRowBase {
	FText m_featureName; // 0x10
	FText m_headerText; // 0x28
	FText m_bodyText; // 0x40
	FDataTableRowHandle m_relatedScene; // 0x58
	FDataTableRowHandle m_sceneToShow; // 0x68
};

struct FRigInfluenceEntry {
	FRigElementKey Source; // 0x0
	TArray<FRigElementKey> AffectedList; // 0x10
};

struct FRigUnit_FABRIKPerItem : FRigUnit_HighlevelBaseMutable {
	FRigElementKeyCollection Items; // 0x68
	FTransform EffectorTransform; // 0x80
	float Precision; // 0xb0
	float weight; // 0xb4
	bool bPropagateToChildren; // 0xb8
	int32_t MaxIterations; // 0xbc
	FRigUnit_FABRIK_WorkData WorkData; // 0xc0
};

struct FClientAndroidDevicePushNotificationRegistrationRequest : FPlayFabRequestCommon {
	FString ConfirmationMessage; // 0x8
	FString DeviceToken; // 0x18
	bool SendPushNotificationConfirmation; // 0x28
};

struct FServerGetUserInventoryResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Inventory; // 0x8
	FString PlayFabId; // 0x18
	UPlayFabJsonObject* VirtualCurrency; // 0x28
	UPlayFabJsonObject* VirtualCurrencyRechargeTimes; // 0x30
};

struct FServerGetTitleNewsRequest : FPlayFabRequestCommon {
	int32_t Count; // 0x8
};

struct FControlRigDrawInstruction {
	FName Name; // 0x0
	EControlRigDrawSettings PrimitiveType; // 0x8
	TArray<FVector> Positions; // 0x10
	FLinearColor Color; // 0x20
	float Thickness; // 0x30
	FTransform Transform; // 0x40
};

struct FVectorDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FClientGetLeaderboardForUsersCharactersRequest : FPlayFabRequestCommon {
	int32_t MaxResultsCount; // 0x8
	FString StatisticName; // 0x10
};

struct FActiveHapticFeedbackEffect {
	UHapticFeedbackEffect_Base* HapticEffect; // 0x0
};

struct FAdminDeleteTitleDataOverrideRequest : FPlayFabRequestCommon {
	FString OverrideLabel; // 0x8
};

struct FServerGetStoreItemsServerRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString PlayFabId; // 0x20
	FString StoreId; // 0x30
};

struct FYRewardDropTableEntry {
	FText m_rewardsPackageName; // 0x0
	int32_t m_vpThreshold; // 0x18
	UDataTable* m_rewardsDT; // 0x20
};

struct FMultiplayerCreateBuildWithCustomContainerRequest : FPlayFabRequestCommon {
	bool AreAssetsReadonly; // 0x8
	FString BuildName; // 0x10
	EContainerFlavor ContainerFlavor; // 0x20
	UPlayFabJsonObject* ContainerImageReference; // 0x28
	FString ContainerRunCommand; // 0x30
	UPlayFabJsonObject* CustomTags; // 0x40
	TArray<UPlayFabJsonObject*> GameAssetReferences; // 0x48
	TArray<UPlayFabJsonObject*> GameCertificateReferences; // 0x58
	UPlayFabJsonObject* LinuxInstrumentationConfiguration; // 0x68
	UPlayFabJsonObject* MetaData; // 0x70
	int32_t MultiplayerServerCountPerVm; // 0x78
	TArray<UPlayFabJsonObject*> Ports; // 0x80
	TArray<UPlayFabJsonObject*> RegionConfigurations; // 0x90
	bool UseStreamingForAssetDownloads; // 0xa0
	EAzureVmSize VmSize; // 0xa1
};

struct FRigUnit_MathVectorScale : FRigUnit_MathVectorBase {
	FVector Value; // 0x8
	float Factor; // 0x14
	FVector Result; // 0x18
};

struct FMeshSectionInfoMap {
	TMap<uint32_t, FMeshSectionInfo> Map; // 0x0
};

struct FPlayFabResultCommon {
	UPlayFabJsonObject* Request; // 0x0
};

struct FYEquippedPlayerLoadout {
	FDataTableRowHandle m_weapon; // 0x0
	TArray<FDataTableRowHandle> m_abilities; // 0x10
};

struct FNamedInterfaceDef {
	FName InterfaceName; // 0x0
	FString InterfaceClassName; // 0x8
};

struct FStaticMeshComponentInstanceData : FPrimitiveComponentInstanceData {
	UStaticMesh* StaticMesh; // 0x100
	TArray<FStaticMeshVertexColorLODData> VertexColorLODs; // 0x108
	TArray<FGuid> CachedStaticLighting; // 0x118
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x128
};

struct FFoliageTypeObject {
	UObject* FoliageTypeObject; // 0x0
	UFoliageType* TypeInstance; // 0x8
	bool bIsAsset; // 0x10
	UFoliageType_InstancedStaticMesh* Type; // 0x18
};

struct FAdaptorPolygon {
	FPolygonGroupID PolygonGroupID; // 0x0
	TArray<FAdaptorTriangleID> TriangulatedPolygonTriangleIndices; // 0x8
};

struct FARSharedWorldReplicationState {
	int32_t PreviewImageOffset; // 0x0
	int32_t ARWorldOffset; // 0x4
};

struct FCheckBoxStyle : FSlateWidgetStyle {
	ESlateCheckBoxType CheckBoxType; // 0x8
	FSlateBrush UncheckedImage; // 0x10
	FSlateBrush UncheckedHoveredImage; // 0x98
	FSlateBrush UncheckedPressedImage; // 0x120
	FSlateBrush CheckedImage; // 0x1a8
	FSlateBrush CheckedHoveredImage; // 0x230
	FSlateBrush CheckedPressedImage; // 0x2b8
	FSlateBrush UndeterminedImage; // 0x340
	FSlateBrush UndeterminedHoveredImage; // 0x3c8
	FSlateBrush UndeterminedPressedImage; // 0x450
	FMargin Padding; // 0x4d8
	FSlateColor ForegroundColor; // 0x4e8
	FSlateColor BorderBackgroundColor; // 0x510
	FSlateSound CheckedSlateSound; // 0x538
	FSlateSound UncheckedSlateSound; // 0x550
	FSlateSound HoveredSlateSound; // 0x568
};

struct FURL {
	FString Protocol; // 0x0
	FString Host; // 0x10
	int32_t Port; // 0x20
	int32_t Valid; // 0x24
	FString Map; // 0x28
	FString RedirectURL; // 0x38
	TArray<FString> Op; // 0x48
	FString Portal; // 0x58
};

struct FPackedRGB10A2N {
	int32_t Packed; // 0x0
};

struct FLensSettings {
	FLensBloomSettings Bloom; // 0x0
	FLensImperfectionSettings Imperfections; // 0xb8
	float ChromaticAberration; // 0xd8
};

struct FAdminGetUserDataRequest : FPlayFabRequestCommon {
	int32_t IfChangedFromDataVersion; // 0x8
	FString Keys; // 0x10
	FString PlayFabId; // 0x20
};

struct FNiagaraSystemUpdateContext {
	TArray<UNiagaraComponent*> ComponentsToReset; // 0x0
	TArray<UNiagaraComponent*> ComponentsToReInit; // 0x10
	TArray<UNiagaraComponent*> ComponentsToNotifySimDestroy; // 0x20
	TArray<UNiagaraSystem*> SystemSimsToDestroy; // 0x30
};

struct FYLatencySummaryEvent : FYBaseAnalyticsEvent {
	int32_t latency_average; // 0xa8
	int32_t latency_quantile_26; // 0xac
	int32_t latency_quantile_51; // 0xb0
	int32_t latency_quantile_76; // 0xb4
	int32_t latency_quantile_91; // 0xb8
	int32_t latency_quantile_96; // 0xbc
	int32_t latency_maximum; // 0xc0
	int32_t ue4_ping_average; // 0xc4
	int32_t ue4_ping_quantile_26; // 0xc8
	int32_t ue4_ping_quantile_51; // 0xcc
	int32_t ue4_ping_quantile_76; // 0xd0
	int32_t ue4_ping_quantile_91; // 0xd4
	int32_t ue4_ping_quantile_96; // 0xd8
	int32_t ue4_ping_maximum; // 0xdc
	float inPacketsLost; // 0xe0
	float outPacketsLost; // 0xe4
	int32_t InRate; // 0xe8
	int32_t OutRate; // 0xec
	float NetSaturated; // 0xf0
	FString server; // 0xf8
};

struct FClientSetPlayerSecretRequest : FPlayFabRequestCommon {
	FString EncryptedRequest; // 0x8
	FString PlayerSecret; // 0x18
};

struct FProfilesGetEntityProfilesResponse : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Profiles; // 0x8
};

struct FAdminGetTaskInstancesRequest : FPlayFabRequestCommon {
	FString StartedAtRangeFrom; // 0x8
	FString StartedAtRangeTo; // 0x18
	ETaskInstanceStatus StatusFilter; // 0x28
	UPlayFabJsonObject* TaskIdentifier; // 0x30
};

struct FClientGetPlayFabIDsFromSteamIDsRequest : FPlayFabRequestCommon {
	FString SteamStringIDs; // 0x8
};

struct FChangeVertexInstancesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FVertexIndexAndInstanceID> PerimeterVertexIndicesAndInstanceIDs; // 0x8
	TArray<FVertexInstancesForPolygonHole> VertexIndicesAndInstanceIDsForEachHole; // 0x18
};

struct FCollectionParameterBase {
	FName ParameterName; // 0x0
	FGuid ID; // 0x8
};

struct FTTEventTrack : FTTTrackBase {
	FName FunctionName; // 0x18
	UCurveFloat* CurveKeys; // 0x20
};

struct FNetworkEmulationProfileDescription {
	FString ProfileName; // 0x0
	FString Tooltip; // 0x10
};

struct FMultiplayerListContainerImageTagsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString ImageName; // 0x10
};

struct FYMissionDataTableRow : FYDataTableRowBase {
	UYMetaQuestPlayerInstanceComponent* m_missionObject; // 0x10
	FText m_missionName; // 0x18
	TArray<FYMissionRuntimeData> m_missionStepEntriesData; // 0x30
	FDataTableRowHandle m_rewards; // 0x40
	FDataTableRowHandle m_nextMissionRow; // 0x50
};

struct FTransformCurve : FAnimCurveBase {
	FVectorCurve TranslationCurve; // 0x18
	FVectorCurve RotationCurve; // 0x1b0
	FVectorCurve ScaleCurve; // 0x348
};

struct FRigUnit_Item : FRigUnit {
	FRigElementKey Item; // 0x8
};

struct FClientLinkTwitchAccountRequest : FPlayFabRequestCommon {
	FString AccessToken; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	bool ForceLink; // 0x20
};

struct FWorldContext {
	FURL LastURL; // 0xd0
	FURL LastRemoteURL; // 0x138
	UPendingNetGame* PendingNetGame; // 0x1a0
	TArray<FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0x1a8
	TArray<ULevel*> LoadedLevelsForPendingMapChange; // 0x1c8
	TArray<UObjectReferencer*> ObjectReferencers; // 0x1f0
	TArray<FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0x200
	UGameViewportClient* GameViewport; // 0x210
	UGameInstance* OwningGameInstance; // 0x218
	TArray<FNamedNetDriver> ActiveNetDrivers; // 0x220
};

struct FYTestResponseData {
	int32_t IntegerField; // 0x0
	float FloatField; // 0x4
	bool BooleanField; // 0x8
	FString StringField; // 0x10
	TArray<FString> StringArray; // 0x20
	TArray<uint32_t> SGD; // 0x30
	FTestDataStruct DataStruct; // 0x40
	TArray<FTestStructForArray> ArrayOfStructs; // 0x58
};

struct FAssetBundleEntry {
	FPrimaryAssetId BundleScope; // 0x0
	FName BundleName; // 0x10
	TArray<FSoftObjectPath> BundleAssets; // 0x18
};

struct FNameCurveKey {
	float Time; // 0x0
	FName Value; // 0x4
};

struct FBoneMirrorExport {
	FName BoneName; // 0x0
	FName SourceBoneName; // 0x8
	EAxis BoneFlipAxis; // 0x10
};

struct FServerGetCharacterDataResult : FPlayFabResultCommon {
	FString CharacterId; // 0x8
	UPlayFabJsonObject* Data; // 0x18
	int32_t DataVersion; // 0x20
	FString PlayFabId; // 0x28
};

struct FMeshElementAttributeList {
	TArray<FMeshElementAttributeData> Attributes; // 0x0
};

struct FAnimationGroupReference {
	FName GroupName; // 0x0
	EAnimGroupRole GroupRole; // 0x8
	EAnimSyncGroupScope GroupScope; // 0x9
};

struct FGameplayTagQuery {
	int32_t TokenStreamVersion; // 0x0
	TArray<FGameplayTag> TagDictionary; // 0x8
	TArray<char> QueryTokenStream; // 0x18
	FString UserDescription; // 0x28
	FString AutoDescription; // 0x38
};

struct FYWeaponParticleSystemOverrideByDataRowHandle {
	FDataTableRowHandle m_weaponDataTableRowHandle; // 0x0
	UParticleSystem* m_particleSystem; // 0x10
};

struct FOrbitOptions {
	char bProcessDuringSpawn : 1; // 0x0
	char bProcessDuringUpdate : 1; // 0x0
	char bUseEmitterTime : 1; // 0x0
};

struct FDatasmithTessellationOptions {
	float ChordTolerance; // 0x0
	float MaxEdgeLength; // 0x4
	float NormalTolerance; // 0x8
	EDatasmithCADStitchingTechnique StitchingTechnique; // 0xc
};

struct FBranchFilter {
	FName BoneName; // 0x0
	int32_t BlendDepth; // 0x8
};

struct FTransformConstraintDescription : FConstraintDescriptionEx {
	ETransformConstraintType TransformType; // 0x10
};

struct FYMapData {
	FString Name; // 0x0
	int32_t weight; // 0x10
};

struct FHorizonTweenEventFloatParameters : FHorizonTweenEventTweenListImplementParameters {
	TArray<float> TweenStartList; // 0x8
	TArray<float> TweenEndList; // 0x18
	FHorizonTweenEventCustomCurve CustomTweenCurve; // 0x28
};

struct FMovieSceneTrackEvalOptions {
	char bCanEvaluateNearestSection : 1; // 0x0
	char bEvalNearestSection : 1; // 0x0
	char bEvaluateInPreroll : 1; // 0x0
	char bEvaluateInPostroll : 1; // 0x0
	char bEvaluateNearestSection : 1; // 0x0
};

struct FNiagaraPlatformSetCVarCondition {
	FName CVarName; // 0x0
	bool Value; // 0x8
	int32_t MinInt; // 0xc
	int32_t MaxInt; // 0x10
	float MinFloat; // 0x14
	float MaxFloat; // 0x18
	char bUseMinInt : 1; // 0x1c
	char bUseMaxInt : 1; // 0x1c
	char bUseMinFloat : 1; // 0x1c
	char bUseMaxFloat : 1; // 0x1c
};

struct FYImpactEffectReceiverData {
	TArray<FYFXCategoryMaterialParemeterEntry> m_fxVectorParameters; // 0x0
	TArray<FYFXCategoryMaterialFloatParemeterEntry> m_fxFloatParameters; // 0x10
};

struct FST_EffortDataTableRow {
	TMap<EN_EffortTypes, FST_EffortData> Efforts_8_70D960094B9CBF7FE719299E4CCEDE62; // 0x0
};

struct FYAISpawnCharacterInfo {
	TSoftClassPtr<UObject> m_aiCharacter; // 0x0
	TSoftClassPtr<UObject> m_aiCharacterPrototypeVersion; // 0x28
};

struct FExposedValueHandler {
	FName BoundFunction; // 0x0
	TArray<FExposedValueCopyRecord> CopyRecords; // 0x8
	UFunction* Function; // 0x18
	TFieldPath<FStructProperty> ValueHandlerNodeProperty; // 0x20
};

struct FRigUnit_MathTransformLerp : FRigUnit_MathTransformBase {
	FTransform A; // 0x10
	FTransform B; // 0x40
	float T; // 0x70
	FTransform Result; // 0x80
};

struct FSlateFontInfo {
	UObject* FontObject; // 0x0
	UObject* FontMaterial; // 0x8
	FFontOutlineSettings OutlineSettings; // 0x10
	FName TypefaceFontName; // 0x40
	int32_t Size; // 0x48
	int32_t LetterSpacing; // 0x4c
};

struct FRigUnit_DebugBezierItemSpace : FRigUnit_DebugBaseMutable {
	FCRFourPointBezier Bezier; // 0x68
	float MinimumU; // 0x98
	float MaximumU; // 0x9c
	FLinearColor Color; // 0xa0
	float Thickness; // 0xb0
	int32_t Detail; // 0xb4
	FRigElementKey Space; // 0xb8
	FTransform WorldOffset; // 0xd0
	bool bEnabled; // 0x100
};

struct FForceFeedbackChannelDetails {
	char bAffectsLeftLarge : 1; // 0x0
	char bAffectsLeftSmall : 1; // 0x0
	char bAffectsRightLarge : 1; // 0x0
	char bAffectsRightSmall : 1; // 0x0
	FRuntimeFloatCurve Curve; // 0x8
};

struct FYTravelRequestData {
	FString m_context; // 0x0
	FString m_mapName; // 0x10
	EYTravelInstanceType m_instanceType; // 0x20
	bool m_loadMapDirectly; // 0x21
	bool m_generatedRequest; // 0x22
	bool m_evaluateSessionState; // 0x23
	bool m_cancelExistingTravel; // 0x24
	bool m_waitForResources; // 0x25
	EYMatchmakingDebugOption m_debugMatchmakingOption; // 0x26
};

struct FRigUnit_AimBone_DebugSettings {
	bool bEnabled; // 0x0
	float Scale; // 0x4
	FTransform WorldOffset; // 0x10
};

struct FYPlayerSeasonGrant {
	int32_t Level; // 0x0
	FString grantRowId; // 0x8
	FString grantId; // 0x18
	FString seasonRowId; // 0x28
};

struct FEventTrackKey {
	float Time; // 0x0
	FName EventName; // 0x4
};

struct FMathRBFInterpolateQuatColor_Target {
	FQuat Target; // 0x0
	FLinearColor Value; // 0x10
};

struct FYWeaponSuitableMods {
	TArray<FName> m_modNames; // 0x0
	EYModificationSlotType m_modificationSlotType; // 0x10
};

struct FAnimNode_HandIKRetargeting : FAnimNode_SkeletalControlBase {
	FBoneReference RightHandFK; // 0xc8
	FBoneReference LeftHandFK; // 0xd8
	FBoneReference RightHandIK; // 0xe8
	FBoneReference LeftHandIK; // 0xf8
	TArray<FBoneReference> IKBonesToMove; // 0x108
	float HandFKWeight; // 0x118
};

struct FYSelectedEmote {
	int32_t m_activeEmoteIndex; // 0x0
	int32_t m_selectedEmoteTimeStamp; // 0x4
};

struct FYGameModeConfigEntry {
	FString Name; // 0x0
	int32_t ranked; // 0x10
	FString jsonData; // 0x18
	FYMapRotationData mapRotationData; // 0x28
};

struct FTimeStretchCurveInstance {
	bool bHasValidData; // 0x0
};

struct FVector {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
};

struct FClientRedeemCouponResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> GrantedItems; // 0x8
};

struct FCameraCacheEntry {
	float Timestamp; // 0x0
	FMinimalViewInfo POV; // 0x10
};

struct FServerAwardSteamAchievementRequest : FPlayFabRequestCommon {
	TArray<UPlayFabJsonObject*> Achievements; // 0x8
};

struct FYGetAllPlayfabUserData {
	FString UserId; // 0x0
};

struct FNiagaraEmitterScriptProperties {
	UNiagaraScript* Script; // 0x0
	TArray<FNiagaraEventReceiverProperties> EventReceivers; // 0x8
	TArray<FNiagaraEventGeneratorProperties> EventGenerators; // 0x18
};

struct FFunctionExpressionInput {
	UMaterialExpressionFunctionInput* ExpressionInput; // 0x0
	FGuid ExpressionInputId; // 0x8
	FExpressionInput Input; // 0x18
};

struct FRootMotionExtractionStep {
	UAnimSequence* AnimSequence; // 0x0
	float StartPosition; // 0x8
	float EndPosition; // 0xc
};

struct FClientGetWindowsHelloChallengeRequest : FPlayFabRequestCommon {
	FString PublicKeyHint; // 0x8
};

struct FYGrantGrantsRequest {
	FString UserId; // 0x0
	TArray<FYGrantEntry> grantsToGive; // 0x10
};

struct FBoolParameterNameAndCurve {
	FName ParameterName; // 0x0
	FMovieSceneBoolChannel ParameterCurve; // 0x8
};

struct FDatasmithCameraFocusSettingsTemplate {
	ECameraFocusMethod FocusMethod; // 0x0
	float ManualFocusDistance; // 0x4
};

struct FClientRestoreIOSPurchasesRequest : FPlayFabRequestCommon {
	FString CatalogVersion; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString ReceiptData; // 0x20
};

struct FControlRigGizmoDefinition {
	FName GizmoName; // 0x0
	TSoftObjectPtr<UStaticMesh> StaticMesh; // 0x8
	FTransform Transform; // 0x30
};

struct FClientLoginWithFacebookInstantGamesIdRequest : FPlayFabRequestCommon {
	bool CreateAccount; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x10
	FString EncryptedRequest; // 0x18
	FString FacebookInstantGamesSignature; // 0x28
	UPlayFabJsonObject* InfoRequestParameters; // 0x38
	FString PlayerSecret; // 0x40
};

struct FRigUnit_DrawContainerSetColor : FRigUnitMutable {
	FName InstructionName; // 0x68
	FLinearColor Color; // 0x70
};

struct FHorizonTweenEventActorScaleFromToParameters : FHorizonTweenEventVectorParameters {
	TWeakObjectPtr<AActor> TweenTargetWeakPtr; // 0x148
};

struct FYDebugClearSpecificCompletedContractRequest {
	FString UserId; // 0x0
	FString contractId; // 0x10
};

struct FAnimNode_AssetPlayerBase : FAnimNode_Base {
	FName GroupName; // 0x10
	EAnimGroupRole GroupRole; // 0x18
	EAnimSyncGroupScope GroupScope; // 0x19
	bool bIgnoreForRelevancyTest; // 0x1a
	float BlendWeight; // 0x1c
	float InternalTimeAccumulator; // 0x20
};

struct FYDebugSetPlayerQuartersLevelResult {
	FString UserId; // 0x0
	int32_t Level; // 0x10
	EYCheatResult Status; // 0x14
};

struct FYSceneCameraData {
	TArray<FDataTableRowHandle> m_sceneRowHandles; // 0x0
	FString m_cameraPrefix; // 0x10
	bool m_ignoreSceneState; // 0x20
};

struct FServerSendPushNotificationRequest : FPlayFabRequestCommon {
	TArray<UPlayFabJsonObject*> AdvancedPlatformDelivery; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString Message; // 0x20
	UPlayFabJsonObject* Package; // 0x30
	FString Recipient; // 0x38
	FString Subject; // 0x48
	FString TargetPlatforms; // 0x58
};

struct FNodeItem {
	FName ParentName; // 0x0
	FTransform Transform; // 0x10
};

struct FServerGetCharacterLeaderboardResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Leaderboard; // 0x8
};

struct FRigUnit_SetRelativeBoneTransform : FRigUnitMutable {
	FName Bone; // 0x68
	FName Space; // 0x70
	FTransform Transform; // 0x80
	float weight; // 0xb0
	bool bPropagateToChildren; // 0xb4
	FCachedRigElement CachedBone; // 0xb8
	FCachedRigElement CachedSpaceIndex; // 0xcc
};

struct FYSetActiveCharacterArchetypeRequest {
	FString UserId; // 0x0
	FString archetypeId; // 0x10
};

struct FMovieSceneColorSectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneFloatChannel Curves[0x4]; // 0x38
	EMovieSceneBlendType BlendType; // 0x2b8
};

struct FClientGameServerRegionsRequest : FPlayFabRequestCommon {
	FString BuildVersion; // 0x8
};

struct FRigUnit_MathVectorMirror : FRigUnit_MathVectorBase {
	FVector Value; // 0x8
	FVector Normal; // 0x14
	FVector Result; // 0x20
};

struct FMovieSceneEntitySystemGraph {
	FMovieSceneEntitySystemGraphNodes nodes; // 0x80
};

struct FAdminGetServerBuildInfoResult : FPlayFabResultCommon {
	FString ActiveRegions; // 0x8
	FString BuildId; // 0x18
	FString Comment; // 0x28
	FString ErrorMessage; // 0x38
	int32_t MaxGamesPerHost; // 0x48
	int32_t MinFreeGameSlots; // 0x4c
	EGameBuildStatus Status; // 0x50
	FString Timestamp; // 0x58
	FString TitleId; // 0x68
};

struct FParticleEvent_GenerateInfo {
	EParticleEventType Type; // 0x0
	int32_t Frequency; // 0x4
	int32_t ParticleFrequency; // 0x8
	char FirstTimeOnly : 1; // 0xc
	char LastTimeOnly : 1; // 0xc
	char UseReflectedImpactVector : 1; // 0xc
	char bUseOrbitOffset : 1; // 0xc
	FName CustomName; // 0x10
	TArray<UParticleModuleEventSendToGame*> ParticleModuleEventsToSendToGame; // 0x18
};

struct FAnimNode_BlendSpacePlayer : FAnimNode_AssetPlayerBase {
	float X; // 0x38
	float Y; // 0x3c
	float Z; // 0x40
	float PlayRate; // 0x44
	bool bLoop; // 0x48
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x49
	float StartPosition; // 0x4c
	UBlendSpaceBase* BlendSpace; // 0x50
	UBlendSpaceBase* PreviousBlendSpace; // 0xe0
};

struct FNiagaraCompileHashVisitorDebugInfo {
	FString Object; // 0x0
	TArray<FString> PropertyKeys; // 0x10
	TArray<FString> PropertyValues; // 0x20
};

struct FNiagaraRandInfo {
	int32_t Seed1; // 0x0
	int32_t Seed2; // 0x4
	int32_t Seed3; // 0x8
};

struct FYGameDebugState {
	bool m_infiniteAmmo; // 0x0
	bool m_hitboxDebug; // 0x1
	bool m_hitscanDebug; // 0x2
	bool m_infiniteAbilityActive; // 0x3
	bool m_haveGodmodeEnabled; // 0x4
	bool m_haveInfiniteClipEnabled; // 0x5
};

struct FYLootTuningRow : FYDataTableRowBase {
	TMap<EYLootSourceType, FYDespawnPickUpInfo> m_pickUpTypesToDestroyWhenNoPlayerIsClose; // 0x10
	float m_serverPickUpDestructionSafeTime; // 0x60
	float m_pickUpInteractionTimeDefault; // 0x64
	float m_pickUpInteractionTimeWeapon; // 0x68
	float m_pickUpInteractionTimeAbility; // 0x6c
	TMap<EYLootSourceType, float> m_exclusivePickUpTimes; // 0x70
	int32_t m_autoPickupRadius; // 0xc0
	FDataTableRowHandle m_moneyDropRow; // 0xc8
	TMap<EYPickupType, UParticleSystem*> m_highlightParticles; // 0xd8
	TMap<EYPickupType, UParticleSystem*> m_legendaryHighlightParticles; // 0x128
	TMap<EYPickupType, FDataTableRowHandle> m_scannableRows; // 0x178
	TSoftObjectPtr<UStaticMesh> m_defaultAbilityLootMesh; // 0x1c8
	TSoftClassPtr<UObject> m_widgetClass; // 0x1f0
	int32_t m_navMeshRandomPointInRadiusForLootDrops; // 0x218
	TMap<EYLootVelocityType, FYRarityLootVelocitySettings> m_lootVelocitySettings; // 0x220
};

struct FPreviewAssetAttachContainer {
	TArray<FPreviewAttachedObjectPair> AttachedObjects; // 0x0
};

struct FMultiplayerListMatchmakingTicketsForPlayerResult : FPlayFabResultCommon {
	FString TicketIds; // 0x8
};

struct FAbility_Action_GasGrenade {
	FDataTableRowHandle Audio_23_FABA0C5543E0FA95F7E37BA2306A398E; // 0x0
	float DurationAudio_22_8E352E014F8A0DC8A08A19B47534F3B3; // 0x10
	float FadeOutDuration_7_D0758DD34263AD91F9AE839FCA0EFFED; // 0x14
	float Damage_15_58F19B994E4E771D4A6195BE9FA72B0E; // 0x18
	float Radius_21_45B1D3B944793EB7D55B389C3F7ADC03; // 0x1c
	float Interval_32_A6DABB044F11F6F78F09F7A340D2BA02; // 0x20
};

struct FClientGetPlayFabIDsFromGenericIDsRequest : FPlayFabRequestCommon {
	TArray<UPlayFabJsonObject*> GenericIDs; // 0x8
};

struct FYHitSphereTraceEntry {
	FVector_NetQuantize m_hitLocation; // 0x0
	FVector_NetQuantizeNormal m_direction; // 0xc
	FVector_NetQuantizeNormal m_impactNormal; // 0x18
	USceneComponent* m_hitComponent; // 0x28
	AActor* m_hitActor; // 0x30
	char m_surfaceType; // 0x38
};

struct FControlRigSequenceObjectReferences {
	TArray<FControlRigSequenceObjectReference> Array; // 0x0
};

struct FJsonObjectWrapper {
	FString JsonString; // 0x0
};

struct FMovieSceneComponentMaterialSectionTemplate : FMovieSceneParameterSectionTemplate {
	int32_t MaterialIndex; // 0x80
};

struct FMovieSceneEvaluationKey {
	FMovieSceneSequenceID SequenceID; // 0x0
	FMovieSceneTrackIdentifier TrackIdentifier; // 0x4
	uint32_t SectionIndex; // 0x8
};

struct FYUIInventoryData {
	int32_t m_componentId; // 0x0
	FYPlayerInventory m_bagInventoryItems; // 0x8
	FYPlayerInventory m_safeContainerInventoryItems; // 0x20
	FYPlayerInventory m_stashInventoryItems; // 0x38
	FYInventoryItem m_bagItem; // 0x50
	TMap<EYPlayerSetType, FYInventoryItem> m_individualInventoryItems; // 0xe8
	TArray<FString> m_removedItemIds; // 0x138
};

struct FYActivityDataTableRow : FYDataTableRowBase {
	EYActivityType m_activityType; // 0x10
	FYCountPerMap m_desiredActivityActorCountPerMap; // 0x18
	TMap<FSoftObjectPath, float> m_perMapMultiplier; // 0x80
	int32_t m_desiredNumActorsToBeAlive; // 0xd0
	float m_multiplierActorsAtMatchStart; // 0xd4
	float m_respawnCheckInterval; // 0xd8
	int32_t m_maxActorsToSpawnPerCheck; // 0xdc
	float m_minimumDistanceToPlayers; // 0xe0
	TSoftClassPtr<UObject> m_activityActorManagerClass; // 0xe8
	TSoftClassPtr<UObject> m_activityActorClass; // 0x110
	TSoftObjectPtr<UTexture2D> m_activityIcon; // 0x138
};

struct FMovieSceneControlRigParameterTemplate : FMovieSceneParameterSectionTemplate {
	TArray<FEnumParameterNameAndCurve> Enums; // 0x80
	TArray<FIntegerParameterNameAndCurve> Integers; // 0x90
};

struct FYSquadInviteAdded {
	FYSquadInvite invite; // 0x0
};

struct FNiagaraStatScope {
	FName FullName; // 0x0
	FName FriendlyName; // 0x8
};

struct FRigUnit_DebugTransformArrayMutable : FRigUnit_DebugBaseMutable {
	TArray<FTransform> Transforms; // 0x68
	ERigUnitDebugTransformMode Mode; // 0x78
	FLinearColor Color; // 0x7c
	float Thickness; // 0x8c
	float Scale; // 0x90
	FName Space; // 0x94
	FTransform WorldOffset; // 0xa0
	bool bEnabled; // 0xd0
	FRigUnit_DebugTransformArrayMutable_WorkData WorkData; // 0xd8
};

struct FAdminGetDataReportResult : FPlayFabResultCommon {
	FString DownloadUrl; // 0x8
};

struct FSolverBreakingFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinVolume; // 0xc
};

struct FMovieSceneSkeletalAnimationParams {
	UAnimSequenceBase* Animation; // 0x0
	FFrameNumber FirstLoopStartFrameOffset; // 0x8
	FFrameNumber StartFrameOffset; // 0xc
	FFrameNumber EndFrameOffset; // 0x10
	float PlayRate; // 0x14
	char bReverse : 1; // 0x18
	FName SlotName; // 0x1c
	FMovieSceneFloatChannel weight; // 0x28
	bool bSkipAnimNotifiers; // 0xc8
	bool bForceCustomMode; // 0xc9
	float StartOffset; // 0xcc
	float EndOffset; // 0xd0
};

struct FServerCreateSharedGroupRequest : FPlayFabRequestCommon {
	FString SharedGroupId; // 0x8
};

struct FMovieSceneMediaSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneMediaSectionParams Params; // 0x20
};

struct FMultiplayerGetQueueStatisticsRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString QueueName; // 0x10
};

struct FPaperTileSetTerrain {
	FString TerrainName; // 0x0
	int32_t CenterTileIndex; // 0x10
};

struct FYDebugResetAllGeneratorsResult {
	FString UserId; // 0x0
	EYCheatResult Status; // 0x10
};

struct FYAIStaggerTriggerHealthPercentage {
	float m_healthPercentage; // 0x0
	float m_time; // 0x4
	FName m_staggerName; // 0x8
};

struct FClientGetPlayFabIDsFromPSNAccountIDsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Data; // 0x8
};

struct FStaticParameterBase {
	FMaterialParameterInfo ParameterInfo; // 0x0
	bool bOverride; // 0x10
	FGuid ExpressionGUID; // 0x14
};

struct FYMuteResult {
	EYMuteResult Result; // 0x0
};

struct FAINoiseEvent {
	FVector NoiseLocation; // 0x4
	float Loudness; // 0x10
	float MaxRange; // 0x14
	AActor* Instigator; // 0x18
	FName Tag; // 0x20
};

struct FNiagaraParameterDataSetBinding {
	int32_t ParameterOffset; // 0x0
	int32_t DataSetComponentOffset; // 0x4
};

struct FRigHierarchyContainer {
	FRigBoneHierarchy BoneHierarchy; // 0x0
	FRigSpaceHierarchy SpaceHierarchy; // 0x98
	FRigControlHierarchy ControlHierarchy; // 0x128
	FRigCurveContainer CurveContainer; // 0x230
	int32_t Version; // 0x2c8
};

struct FYInboxMessageRemoved {
	FString ID; // 0x0
};

struct FAnimNode_ConvertComponentToLocalSpace : FAnimNode_Base {
	FComponentSpacePoseLink ComponentPose; // 0x10
};

struct FYRegisteredStackInput {
	TArray<FYInputStackRuntimeContext> m_runtimeMinorStack; // 0x0
	EYInputUIStackType m_stackType; // 0x10
	bool m_isActive; // 0x11
};

struct FARQRCodeUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	FVector Extents; // 0x50
	FString QRCode; // 0x60
};

struct FMultiplayerGetAssetUploadUrlResponse : FPlayFabResultCommon {
	FString AssetUploadUrl; // 0x8
	FString Filename; // 0x18
};

struct FSolverIterations {
	float FixedTimeStep; // 0x0
	int32_t SolverIterations; // 0x4
	int32_t JointIterations; // 0x8
	int32_t CollisionIterations; // 0xc
	int32_t SolverPushOutIterations; // 0x10
	int32_t JointPushOutIterations; // 0x14
	int32_t CollisionPushOutIterations; // 0x18
};

struct FARPose3D {
	FARSkeletonDefinition SkeletonDefinition; // 0x0
	TArray<FTransform> JointTransforms; // 0x28
	TArray<bool> IsJointTracked; // 0x38
	EARJointTransformSpace JointTransformSpace; // 0x48
};

struct FYPlayerSeasonGrants {
	FString seasonRowId; // 0x0
	TArray<FYPlayerSeasonGrant> grants; // 0x10
};

struct FTimeSynthEnvelopeFollowerSettings {
	float AttackTime; // 0x0
	float ReleaseTime; // 0x4
	ETimeSynthEnvelopeFollowerPeakMode PeakMode; // 0x8
	bool bIsAnalogMode; // 0x9
};

struct FFrameTime {
	FFrameNumber FrameNumber; // 0x0
	float SubFrame; // 0x4
};

struct FFloatRK4SpringInterpolator {
	float StiffnessConstant; // 0x0
	float DampeningRatio; // 0x4
};

struct FYDebugForceRotate {
	EYPromotionType rotationType; // 0x0
};

struct FGroupsApplyToGroupResponse : FPlayFabResultCommon {
	UPlayFabJsonObject* Entity; // 0x8
	FString Expires; // 0x10
	UPlayFabJsonObject* Group; // 0x20
};

struct FLightingChannels {
	char bChannel0 : 1; // 0x0
	char bChannel1 : 1; // 0x0
	char bChannel2 : 1; // 0x0
};

struct FNiagaraID {
	int32_t Index; // 0x0
	int32_t AcquireTag; // 0x4
};

struct FWidgetTransform {
	FVector2D Translation; // 0x0
	FVector2D Scale; // 0x8
	FVector2D Shear; // 0x10
	float Angle; // 0x18
};

struct FUserWidgetPool {
	TArray<UUserWidget*> ActiveWidgets; // 0x0
	TArray<UUserWidget*> InactiveWidgets; // 0x10
};

struct FYVanityMaterialEntry {
	TSoftObjectPtr<UMaterialInterface> m_material; // 0x0
	int32_t m_index; // 0x28
};

struct FYItemTooltipData {
	EYItemTooltipType m_itemTooltipType; // 0x0
	FName m_baseItemId; // 0x4
	FText m_itemName; // 0x10
	FText m_itemType; // 0x28
	FText m_itemSubType; // 0x40
	FText m_itemDescription; // 0x58
	FText m_itemFlavorText; // 0x70
	TSoftObjectPtr<UTexture2D> m_itemImage; // 0x88
	TSoftObjectPtr<UTexture2D> m_itemImageBig; // 0xb0
	int32_t m_itemPrice; // 0xd8
	int32_t m_itemAmount; // 0xdc
	FYStoredModData m_mods; // 0xe0
	TArray<EYModificationSlotType> m_modSlots; // 0xf0
	FYWeaponTooltipData m_weaponTooltipData; // 0x100
	bool m_isCompatibleMod; // 0x118
};

struct FYPlayerQuartersLevelUpdated {
	FString UserId; // 0x0
	int32_t Level; // 0x10
	FYTimestamp upgradeStartedTime; // 0x18
};

struct FSessionServicePong {
	bool Authorized; // 0x0
	FString BuildDate; // 0x8
	FString DeviceName; // 0x18
	FGuid instanceId; // 0x28
	FString InstanceName; // 0x38
	FString PlatformName; // 0x48
	FGuid SessionId; // 0x58
	FString SessionName; // 0x68
	FString SessionOwner; // 0x78
	bool Standalone; // 0x88
};

struct FServerGetCharacterStatisticsResult : FPlayFabResultCommon {
	FString CharacterId; // 0x8
	UPlayFabJsonObject* CharacterStatistics; // 0x18
	FString PlayFabId; // 0x20
};

struct FYResetCharacterArchetypeRequest {
	FString UserId; // 0x0
	FString archetypeId; // 0x10
};

struct FGroupsListGroupBlocksResponse : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> BlockedEntities; // 0x8
};

struct FMultiplayerRequestMultiplayerServerRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* BuildAliasParams; // 0x8
	FString BuildId; // 0x10
	UPlayFabJsonObject* CustomTags; // 0x20
	FString InitialPlayers; // 0x28
	FString PreferredRegions; // 0x38
	FString SessionCookie; // 0x48
	FString SessionId; // 0x58
};

struct FYPlayerAwarenessNotificationData {
	bool m_isAuthorityTriggered; // 0x0
	bool m_shouldPlayVo; // 0x1
	bool m_shouldPlaySound; // 0x2
	EYPlayerAwarenessNotificationType m_notficationType; // 0x3
	TWeakObjectPtr<AYPlayerCharacter> m_playerCharacterContext; // 0x4
};

struct FYDebugSetActiveContractProgressRequest {
	FString UserId; // 0x0
	FString contractId; // 0x10
	int32_t objectiveIndex; // 0x20
	int32_t newProgress; // 0x24
};

struct FYMissionRuntimeData {
	int32_t m_stepIndex; // 0x0
	FText m_missionName; // 0x8
	FText m_missionStepDescription; // 0x20
	FText m_missionStepNpcText; // 0x38
	bool m_useVoiceOver; // 0x50
	FDataTableRowHandle m_missionStartVoiceOver; // 0x58
	TArray<FDataTableRowHandle> m_featureToUnlock; // 0x68
};

struct FNiagaraTypeDefinitionHandle {
	int32_t RegisteredTypeIndex; // 0x0
};

struct FMultiplayerGetMatchmakingTicketResult : FPlayFabResultCommon {
	FString CancellationReasonString; // 0x8
	FString Created; // 0x18
	UPlayFabJsonObject* Creator; // 0x28
	int32_t GiveUpAfterSeconds; // 0x30
	FString MatchID; // 0x38
	TArray<UPlayFabJsonObject*> Members; // 0x48
	TArray<UPlayFabJsonObject*> MembersToMatchWith; // 0x58
	FString QueueName; // 0x68
	FString Status; // 0x78
	FString TicketId; // 0x88
};

struct FMovieScene3DScaleKeyStruct : FMovieSceneKeyStruct {
	FVector Scale; // 0x8
	FFrameNumber Time; // 0x14
};

struct FClothVertBoneData {
	int32_t NumInfluences; // 0x0
	uint16_t BoneIndices[0xc]; // 0x4
	float BoneWeights[0xc]; // 0x1c
};

struct FYPlayerSeasonGrantsChanged {
	FString seasonRowId; // 0x0
	TArray<FYPlayerSeasonGrant> grants; // 0x10
};

struct FServerAddFriendRequest : FPlayFabRequestCommon {
	FString FriendEmail; // 0x8
	FString FriendPlayFabId; // 0x18
	FString FriendTitleDisplayName; // 0x28
	FString FriendUsername; // 0x38
	FString PlayFabId; // 0x48
};

struct FNavCollisionCylinder {
	FVector Offset; // 0x0
	float Radius; // 0xc
	float Height; // 0x10
};

struct FAnimNode_Inertialization : FAnimNode_Base {
	FPoseLink Source; // 0x10
};

struct FYQuestState {
	FString questId; // 0x0
	bool Completed; // 0x10
	int32_t Count; // 0x14
	EYMetaMissionType Type; // 0x18
	FYTimestamp updated; // 0x20
	FString backendId; // 0x28
	int32_t remainingUnits; // 0x38
};

struct FRigUnit_ModifyTransforms_WorkData {
	TArray<FCachedRigElement> CachedItems; // 0x0
};

struct FRigidBodyState {
	FVector_NetQuantize100 Position; // 0x0
	FQuat Quaternion; // 0x10
	FVector_NetQuantize100 LinVel; // 0x20
	FVector_NetQuantize100 AngVel; // 0x2c
	char Flags; // 0x38
};

struct FTextureParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	UTexture* ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x18
};

struct FYWeaponDecalData {
	UMaterialInterface* m_impactMaterial; // 0x0
	float m_decalSize; // 0x8
	float m_lifeSpan; // 0xc
	float m_startDelay; // 0x10
	float m_fadeOutDuration; // 0x14
	float m_fadeScreenSize; // 0x18
};

struct FSkeletalMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	FName MaterialSlotName; // 0x8
	FMeshUVChannelInfo UVChannelData; // 0x10
};

struct FYCustomizationExplicitActorInitializationData {
	FYActiveCustomizationData m_customizationData; // 0x0
	FYActiveGlobalRuntimeVanityData m_globalVanityData; // 0x20
	FYCharacterVisualizationRuntimeData m_visualizationData; // 0xa0
	FYInventoryItem m_overrideWeaponHandle; // 0xa8
};

struct FA2CSPose : FA2Pose {
	TArray<char> ComponentSpaceFlags; // 0x18
};

struct FClientDeviceInfoRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* Info; // 0x8
};

struct FARPose2D {
	FARSkeletonDefinition SkeletonDefinition; // 0x0
	TArray<FVector2D> JointLocations; // 0x28
	TArray<bool> IsJointTracked; // 0x38
};

struct FClientGetPlayFabIDsFromKongregateIDsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Data; // 0x8
};

struct FMultiplayerUpdateBuildRegionsRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
	TArray<UPlayFabJsonObject*> BuildRegions; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
};

struct FYCraftSuccessfulPopupText {
	FText m_itemName; // 0x0
	FText m_deviceTypeText; // 0x18
};

struct FYAITargetInfo {
	bool m_isVisible; // 0x0
	bool m_isCurrentCombatAggroTarget; // 0x1
	bool m_isPlayer; // 0x2
	bool m_isDBNO; // 0x3
	float m_currentDistance; // 0x4
	float m_damagedReceivedFromTarget; // 0x8
	int32_t m_registeredTokens; // 0xc
	int32_t m_maxTokens; // 0x10
	float m_timeTargetAcquired; // 0x14
	float m_aggroValue; // 0x18
	EYAISenseType m_highestSenseType; // 0x1c
	EYAISenseType m_lastPeceivedSenseType; // 0x1d
	FVector m_lastPerceivedSenseLocation; // 0x20
	TMap<EYAISenseType, float> m_lastTimeTargetWasPerceivedMap; // 0x30
	FYAITargetDetailedAggroInfo m_detailedAggroInfo; // 0x80
};

struct FVOscillator {
	FFOscillator X; // 0x0
	FFOscillator Y; // 0xc
	FFOscillator Z; // 0x18
};

struct FAdminDeleteOpenIdConnectionRequest : FPlayFabRequestCommon {
	FString ConnectionId; // 0x8
};

struct FYDebugAIStats {
	TMap<FString, int32_t> m_aiCountPerType; // 0x0
};

struct FHorizonTweenEventImplementParameters {
	bool bUseCustomCurve; // 0x0
};

struct FClientGetCatalogItemsResult : FPlayFabResultCommon {
	TArray<UPlayFabJsonObject*> Catalog; // 0x8
};

struct FMultiplayerCreateBuildWithManagedContainerResponse : FPlayFabResultCommon {
	bool AreAssetsReadonly; // 0x8
	FString BuildId; // 0x10
	FString BuildName; // 0x20
	EContainerFlavor ContainerFlavor; // 0x30
	FString CreationTime; // 0x38
	TArray<UPlayFabJsonObject*> GameAssetReferences; // 0x48
	TArray<UPlayFabJsonObject*> GameCertificateReferences; // 0x58
	FString GameWorkingDirectory; // 0x68
	UPlayFabJsonObject* InstrumentationConfiguration; // 0x78
	UPlayFabJsonObject* MetaData; // 0x80
	int32_t MultiplayerServerCountPerVm; // 0x88
	FString OsPlatform; // 0x90
	TArray<UPlayFabJsonObject*> Ports; // 0xa0
	TArray<UPlayFabJsonObject*> RegionConfigurations; // 0xb0
	FString ServerType; // 0xc0
	FString StartMultiplayerServerCommand; // 0xd0
	bool UseStreamingForAssetDownloads; // 0xe0
	EAzureVmSize VmSize; // 0xe1
};

struct FTimelineEventEntry {
	float Time; // 0x0
	FDelegate EventFunc; // 0x4
};

struct FMultiplayerShutdownMultiplayerServerRequest : FPlayFabRequestCommon {
	FString BuildId; // 0x8
	UPlayFabJsonObject* CustomTags; // 0x18
	FString Region; // 0x20
	FString SessionId; // 0x30
};

struct FClientConfirmPurchaseRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	FString OrderId; // 0x10
};

struct FMovieSceneVectorPropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneFloatChannel ComponentCurves[0x4]; // 0x38
	int32_t NumChannelsUsed; // 0x2b8
	EMovieSceneBlendType BlendType; // 0x2bc
};

struct FRigUnit_TwoBoneIKSimple_DebugSettings {
	bool bEnabled; // 0x0
	float Scale; // 0x4
	FTransform WorldOffset; // 0x10
};

struct FYRequestItemReroll {
	FString UserId; // 0x0
	FString ID; // 0x10
	FYCustomItemInfo desiredState; // 0x20
	int32_t itemStatType; // 0x90
	int32_t currentVal; // 0x94
	int32_t newVal; // 0x98
};

struct FShapedTextOptions {
	char bOverride_TextShapingMethod : 1; // 0x0
	char bOverride_TextFlowDirection : 1; // 0x0
	ETextShapingMethod TextShapingMethod; // 0x1
	ETextFlowDirection TextFlowDirection; // 0x2
};

struct FSlotAnimationTrack {
	FName SlotName; // 0x0
	FAnimTrack AnimTrack; // 0x8
};

struct FCloudScriptExecuteFunctionRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	UPlayFabJsonObject* Entity; // 0x10
	FString FunctionName; // 0x18
	UPlayFabJsonObject* FunctionParameter; // 0x28
	bool GeneratePlayStreamEvent; // 0x30
};

struct FIntVector {
	int32_t X; // 0x0
	int32_t Y; // 0x4
	int32_t Z; // 0x8
};

struct FExpressionOutput {
	FName OutputName; // 0x0
};

struct FAdminGetPublisherDataResult : FPlayFabResultCommon {
	UPlayFabJsonObject* Data; // 0x8
};

struct FEdGraphPinType {
	FName PinCategory; // 0x0
	FName PinSubCategory; // 0x8
	TWeakObjectPtr<UObject> PinSubCategoryObject; // 0x10
	FSimpleMemberReference PinSubCategoryMemberReference; // 0x18
	FEdGraphTerminalType PinValueType; // 0x38
	EPinContainerType ContainerType; // 0x54
	char bIsArray : 1; // 0x55
	char bIsReference : 1; // 0x55
	char bIsConst : 1; // 0x55
	char bIsWeakPointer : 1; // 0x55
	char bIsUObjectWrapper : 1; // 0x55
};

struct FYInstanceUpdateAmount {
	FString ID; // 0x0
	int32_t Amount; // 0x10
};

struct FInsightsInsightsGetOperationStatusResponse : FPlayFabResultCommon {
	FString Message; // 0x8
	FString OperationCompletedTime; // 0x18
	FString OperationId; // 0x28
	FString OperationLastUpdated; // 0x38
	FString OperationStartedTime; // 0x48
	FString OperationType; // 0x58
	int32_t OperationValue; // 0x68
	FString Status; // 0x70
};

struct FServerGrantCharacterToUserRequest : FPlayFabRequestCommon {
	FString CharacterName; // 0x8
	FString CharacterType; // 0x18
	UPlayFabJsonObject* CustomTags; // 0x28
	FString PlayFabId; // 0x30
};

struct FProfilesGetEntityProfileRequest : FPlayFabRequestCommon {
	UPlayFabJsonObject* CustomTags; // 0x8
	bool DataAsObject; // 0x10
	UPlayFabJsonObject* Entity; // 0x18
};

struct FYUiPopupItemSuccessfulActionPreviewData {
	FDataTableRowHandle m_blueprintHandle; // 0x0
	EYItemRarityType m_itemRarity; // 0x10
	FString m_itemBackendId; // 0x18
	FString m_baseItemId; // 0x28
	FString m_shopItemBelongsTo; // 0x38
	int32_t m_repeatTimes; // 0x48
};

struct FYContractRow : FYDataTableRowBase {
	bool m_isEnabled; // 0x10
	FText m_name; // 0x18
	TSoftObjectPtr<UTexture2D> m_backgroundImage; // 0x30
	TSoftObjectPtr<UTexture2D> m_contractTypeIcon; // 0x58
	FText m_contractDescription; // 0x80
