#pragma once

struct FGameplayTagSource {
	FName SourceName; // 0x0
	EGameplayTagSourceType SourceType; // 0x8
	UGameplayTagsList* SourceTagList; // 0x10
	URestrictedGameplayTagsList* SourceRestrictedTagList; // 0x18
};

struct FPerBoneBlendWeight {
	int32_t SourceIndex; // 0x0
	float BlendWeight; // 0x4
};

struct FMovieSceneEnumPropertySectionTemplate {
	FMovieSceneByteChannel EnumCurve; // 0x38
};

struct FBoneFilter {
	bool bExcludeSelf; // 0x0
	FName BoneName; // 0x4
};

struct FDebugCameraControllerSettingsViewModeIndex {
	EViewModeIndex ViewModeIndex; // 0x8
};

struct FClientSideProjectileData {
	int32_t Index; // 0x0
	FVector EndLocation; // 0x4
};

struct FLevelVisibilityComponentData {
	UMovieSceneLevelVisibilitySection* Section; // 0x0
};

struct FTagResourceRequestCloudWatch {
	FString ResourceARN; // 0x0
	TArray<FTagCloudWatch> Tags; // 0x10
};

struct FMulticastRecordOptions {
	FString FuncPathName; // 0x0
	bool bServerSkip; // 0x10
	bool bClientSkip; // 0x11
};

struct FDatasmithStaticMaterialTemplate {
	FName MaterialSlotName; // 0x0
	UMaterialInterface* MaterialInterface; // 0x8
};

struct FAnimNode_BonesLookAt {
	FBoneReference BoneToModify; // 0xc8
	USkeletalMeshComponent* SelfSkeletal; // 0xd8
	TMap<FName, float> AffectBones; // 0xe0
	TArray<FBoneReference> BoneModifies; // 0x130
	FBoneSocketTarget LookAtTarget; // 0x140
	FVector LookAtLocation; // 0x1a0
	FAxis LookAt_Axis; // 0x1ac
	bool bUseLookUpAxis; // 0x1bc
	EInterpolationBlend InterpolationType; // 0x1bd
	FAxis LookUp_Axis; // 0x1c0
	float LookAtClamp; // 0x1d0
	float InterpolationTime; // 0x1d4
	float InterpolationTriggerThreashold; // 0x1d8
};

struct FDummySequenceBase {
	EDummySequenceState DummyState; // 0x0
};

struct FInterpControlPoint {
	FVector PositionControlPoint; // 0x0
	bool bPositionIsRelative; // 0xc
};

struct FLocalizedIconInfos {
	TArray<FLocalizedIconInfo> IconData; // 0x0
};

struct FNiagaraVariableInfo {
	FNiagaraVariable Variable; // 0x0
	FText Definition; // 0x20
	UNiagaraDataInterface* DataInterface; // 0x38
};

struct FMagicLeapResult {
	bool bSuccess; // 0x0
	FString AdditionalInfo; // 0x8
};

struct FDirectoryPath {
	FString Path; // 0x0
};

struct FMediaSoundComponentSpectralData {
	float FrequencyHz; // 0x0
	float Magnitude; // 0x4
};

struct FIntPoint {
	int32_t X; // 0x0
	int32_t Y; // 0x4
};

struct FVector2DParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel XCurve; // 0x8
	FMovieSceneFloatChannel YCurve; // 0xa8
};

struct FNiagaraEventReceiverProperties {
	FName Name; // 0x0
	FName SourceEventGenerator; // 0x8
	FName SourceEmitter; // 0x10
};

struct FDescribeExportTasksResult {
	TArray<FExportTask> ExportTasks; // 0x0
	FString NextToken; // 0x10
};

struct FAnimNode_DragonFabrikSolver {
	FBoneReference StartSplineBone; // 0xc8
	FBoneReference EndSplineBone; // 0xd8
	float Precision; // 0xe8
	float MaxIterations; // 0xec
	FTransform Target_Transform; // 0xf0
};

struct FClothCollisionPrim_Convex {
	TArray<FPlane> Planes; // 0x0
	TArray<FVector> SurfacePoints; // 0x10
	int32_t BoneIndex; // 0x20
};

struct FAnimNode_RotationMultiplier {
	FBoneReference TargetBone; // 0xc8
	FBoneReference SourceBone; // 0xd8
	float Multiplier; // 0xe8
	EBoneAxis RotationAxisToRefer; // 0xec
	bool bIsAdditive; // 0xed
};

struct FPSCPool {
	TArray<FPSCPoolElem> FreeElements; // 0x0
	TArray<UParticleSystemComponent*> InUseComponents_Auto; // 0x10
	TArray<UParticleSystemComponent*> InUseComponents_Manual; // 0x20
};

struct FS_FootStepDataSurfaceMap {
	TMap<EPhysicalSurface, FS_FootStepData> Jog_5_39A96E4240A3A64F0E37DE8C9A1945DF; // 0x0
	TMap<EPhysicalSurface, FS_FootStepData> Sprint_8_9369B0B144435B1CED70BB86D0928C02; // 0x50
	TMap<EPhysicalSurface, FS_FootStepData> Crouch_13_DF86942F4537C8CF86129EAD8E225001; // 0xa0
	TMap<EPhysicalSurface, FS_FootStepData> Jump_22_FFA028AC4BF6BDD0D8E85CAE4791D1F7; // 0xf0
	TMap<EPhysicalSurface, UMaterial*> FootprintMaterial_27_F7FCC2B54107386448270E8F7F149496; // 0x140
};

struct FScrollBarStyle {
	FSlateBrush HorizontalBackgroundImage; // 0x8
	FSlateBrush VerticalBackgroundImage; // 0x90
	FSlateBrush VerticalTopSlotImage; // 0x118
	FSlateBrush HorizontalTopSlotImage; // 0x1a0
	FSlateBrush VerticalBottomSlotImage; // 0x228
	FSlateBrush HorizontalBottomSlotImage; // 0x2b0
	FSlateBrush NormalThumbImage; // 0x338
	FSlateBrush HoveredThumbImage; // 0x3c0
	FSlateBrush DraggedThumbImage; // 0x448
};

struct FInterpCurvePointVector2D {
	float InVal; // 0x0
	FVector2D OutVal; // 0x4
	FVector2D ArriveTangent; // 0xc
	FVector2D LeaveTangent; // 0x14
	EInterpCurveMode InterpMode; // 0x1c
};

struct FCustomizableObjectExportOptions {
	bool bTextureCompression; // 0x0
	FString TargetPlatform; // 0x8
};

struct FMovieSceneSubSequenceData {
	FSoftObjectPath Sequence; // 0x0
	FMovieSceneSequenceTransform RootToSequenceTransform; // 0x18
	FFrameRate TickResolution; // 0x38
	FMovieSceneSequenceID DeterministicSequenceID; // 0x40
	FMovieSceneFrameRange PlayRange; // 0x44
	FMovieSceneFrameRange FullPlayRange; // 0x54
	FMovieSceneFrameRange UnwarpedPlayRange; // 0x64
	FMovieSceneFrameRange PreRollRange; // 0x74
	FMovieSceneFrameRange PostRollRange; // 0x84
	int16_t HierarchicalBias; // 0x94
	bool bHasHierarchicalEasing; // 0x96
	FMovieSceneSequenceInstanceDataPtr InstanceData; // 0x98
	FGuid SubSectionSignature; // 0xb8
	FMovieSceneSequenceTransform OuterToInnerTransform; // 0xc8
};

struct FMovieSceneTimeWarping {
	FFrameNumber Start; // 0x0
	FFrameNumber End; // 0x4
};

struct FTypeface {
	TArray<FTypefaceEntry> Fonts; // 0x0
};

struct FFrameMetrics {
	float TotalElapsedTime; // 0x0
	float FrameDelta; // 0x4
	int32_t FrameNumber; // 0x8
	int32_t NumDroppedFrames; // 0xc
};

struct FAnomalyDetectorConfiguration {
	TArray<FRange> ExcludedTimeRanges; // 0x0
	FString MetricTimezone; // 0x10
};

struct FCustomAttributePerBoneData {
	int32_t BoneTreeIndex; // 0x0
	TArray<FCustomAttribute> Attributes; // 0x8
};

struct FAnimNode_BlendListByInt {
	int32_t ActiveChildIndex; // 0x98
};

struct FRBFParams {
	int32_t TargetDimensions; // 0x0
	ERBFSolverType SolverType; // 0x4
	float Radius; // 0x8
	bool bAutomaticRadius; // 0xc
	ERBFFunctionType Function; // 0xd
	ERBFDistanceMethod DistanceMethod; // 0xe
	EBoneAxis TwistAxis; // 0xf
	float WeightThreshold; // 0x10
	ERBFNormalizeMethod NormalizeMethod; // 0x14
	FVector MedianReference; // 0x18
	float MedianMin; // 0x24
	float MedianMax; // 0x28
};

struct FAudioVolumeSubmixOverrideSettings {
	USoundSubmix* Submix; // 0x0
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x8
	float CrossfadeTime; // 0x18
};

struct FMovieSceneSequencePlaybackParams {
	FFrameTime Frame; // 0x0
	float Time; // 0x8
	FString MarkedFrame; // 0x10
	EMovieScenePositionType PositionType; // 0x20
	EUpdatePositionMethod UpdateMethod; // 0x21
};

struct FS_FootStepData {
	TArray<USoundCue*> SoundList_3_3663C7284BC3B1CC032630BCA0372984; // 0x0
	TArray<UParticleSystem*> ParticleList_6_6AC5B16F4481527BA58B65B5DFD82A34; // 0x10
	USoundCue* JumpSound_13_4443BD644B48FE9AB3F4FE9EF7012565; // 0x20
	USoundCue* LandSound_12_A458D592433FD557C67737B924C672A0; // 0x28
	UParticleSystem* JumpParticle_16_EFBC44D74076D0FCC88D4D8FCF50B15B; // 0x30
	UParticleSystem* LandParticle_18_BD74A2FA40EE16B2B13C8995002D6B33; // 0x38
};

struct FActiveCameraShakeInfo {
	UCameraShakeBase* ShakeInstance; // 0x0
	TWeakObjectPtr<UCameraShakeSourceComponent> ShakeSource; // 0x8
};

struct FDestructibleAdvancedParameters {
	float DamageCap; // 0x0
	float ImpactVelocityThreshold; // 0x4
	float MaxChunkSpeed; // 0x8
	float FractureImpulseScale; // 0xc
};

struct FBranchingPoint {
	FName EventName; // 0x30
	float DisplayTime; // 0x38
	float TriggerTimeOffset; // 0x3c
};

struct FCameraShakeInfo {
	FCameraShakeDuration Duration; // 0x0
	float BlendIn; // 0x8
	float BlendOut; // 0xc
};

struct FSQSListDeadLetterSourceQueuesResult {
	TArray<FString> QueueUrls; // 0x0
	FString NextToken; // 0x10
	FSQSResponseMetadata ResponseMetadata; // 0x20
};

struct FARPose3D {
	FARSkeletonDefinition SkeletonDefinition; // 0x0
	TArray<FTransform> JointTransforms; // 0x28
	TArray<bool> IsJointTracked; // 0x38
	EARJointTransformSpace JointTransformSpace; // 0x48
};

struct FPerPlatformBool {
	bool Default; // 0x0
};

struct FFrameTime {
	FFrameNumber FrameNumber; // 0x0
	float SubFrame; // 0x4
};

struct FChangeMessageVisibilityBatchResultEntry {
	FString ID; // 0x0
};

struct FMovieSceneNiagaraFloatParameterSectionTemplate {
	FMovieSceneFloatChannel FloatChannel; // 0x40
};

struct FMeshElementAttributeData {
	FName AttributeName; // 0x0
	int32_t AttributeIndex; // 0x8
	FMeshElementAttributeValue AttributeValue; // 0x10
};

struct FDisableInsightRulesRequest {
	TArray<FString> RuleNames; // 0x0
};

struct FAnimNode_BlendSpacePlayer {
	float X; // 0x38
	float Y; // 0x3c
	float Z; // 0x40
	float PlayRate; // 0x44
	bool bLoop; // 0x48
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x49
	float StartPosition; // 0x4c
	UBlendSpaceBase* BlendSpace; // 0x50
	UBlendSpaceBase* PreviousBlendSpace; // 0xe0
};

struct FAnimNode_CCDIK {
	FVector EffectorLocation; // 0xc8
	EBoneControlSpace EffectorLocationSpace; // 0xd4
	FBoneSocketTarget EffectorTarget; // 0xe0
	FBoneReference TipBone; // 0x140
	FBoneReference RootBone; // 0x150
	float Precision; // 0x160
	int32_t MaxIterations; // 0x164
	bool bStartFromTail; // 0x168
	bool bEnableRotationLimit; // 0x169
	TArray<float> RotationLimitPerJoints; // 0x170
};

struct FLensBloomSettings {
	FGaussianSumBloomSettings GaussianSum; // 0x0
	FConvolutionBloomSettings Convolution; // 0x88
	EBloomMethod Method; // 0xb0
};

struct FFoam_Generator {
	FLinearColor DirectionOfNormalsScroll_61_4D07E26B418E2200A6F8F8B3828E51EE; // 0x0
	float FoamGeneratorScroll_63_C9338C334DDA5868BD2EC9B6FC1E07EF; // 0x10
	float FoamIntensityScroll_62_1F0826E04FA290A077DE7C8B1081B5DC; // 0x14
	FLinearColor DirectionOfNormalsDDXDDY_60_349FBF6044E6E0752780FB97F7E5A6CD; // 0x18
	float FoamGeneratorDDXDDY_64_AE172943406B54FBA3455FB564595209; // 0x28
	float FoamIntensityDDXDDY_67_5CA2C94141DEFD94032060BFDE6EB72B; // 0x2c
	float MaskPower_71_84B433B84797C91A55296584D5E852BC; // 0x30
	float Mask_73_5272BD3F497A2258FD58ED9D9554DDBE; // 0x34
	float Variant_75_C2A04B424CCCB8D2F22F4D96D16F53C8; // 0x38
	float TimeMask_77_83196AA846FB16C657E610A2657F5433; // 0x3c
	UTexture2D* Foam_80_FD2567B14E84C80B9839189F5AC7A7E0; // 0x40
	float MeasureHeightFoam_87_DEDAFD794E376A5784EA5EA289BFAE8C; // 0x48
	float InvestedFoam_88_3C14234147CB274902FA10BB86DEA00E; // 0x4c
	float SeaFoam_91_F1060C564572B4F2F8927DB48F4826D9; // 0x50
	FLinearColor FoamScattering_94_3C4CC6D84205ACD37BBB7BA6F06F59EE; // 0x54
	float UVTile_97_F23671B4437E809F10CF93AFE1C10C9F; // 0x64
};

struct FAnimNode_ObserveBone {
	FBoneReference BoneToObserve; // 0xc8
	EBoneControlSpace DisplaySpace; // 0xd8
	bool bRelativeToRefPose; // 0xd9
	FVector Translation; // 0xdc
	FRotator Rotation; // 0xe8
	FVector Scale; // 0xf4
};

struct FLevelSequencePlayerSnapshot {
	FString MasterName; // 0x0
	FQualifiedFrameTime MasterTime; // 0x10
	FQualifiedFrameTime SourceTime; // 0x20
	FString CurrentShotName; // 0x30
	FQualifiedFrameTime CurrentShotLocalTime; // 0x40
	FQualifiedFrameTime CurrentShotSourceTime; // 0x50
	FString SourceTimecode; // 0x60
	TSoftObjectPtr<UCameraComponent> CameraComponent; // 0x70
	FLevelSequenceSnapshotSettings Settings; // 0x98
	ULevelSequence* ActiveShot; // 0xa8
	FMovieSceneSequenceID ShotID; // 0xb0
};

struct FAnimGraphBlendOptions {
	float BlendInTime; // 0x0
	float BlendOutTime; // 0x4
};

struct FCameraFocusSettings {
	ECameraFocusMethod FocusMethod; // 0x0
	float ManualFocusDistance; // 0x4
	FCameraTrackingFocusSettings TrackingFocusSettings; // 0x8
	char bDrawDebugFocusPlane : 1; // 0x40
	FColor DebugFocusPlaneColor; // 0x44
	char bSmoothFocusChanges : 1; // 0x48
	float FocusSmoothingInterpSpeed; // 0x4c
	float FocusOffset; // 0x50
};

struct FChaosCollisionEventData {
	FVector Location; // 0x0
	FVector Normal; // 0xc
	FVector Velocity1; // 0x18
	FVector Velocity2; // 0x24
	float Mass1; // 0x30
	float Mass2; // 0x34
	FVector Impulse; // 0x38
};

struct FSubmixEffectReverbSettings {
	bool bBypassEarlyReflections; // 0x0
	float ReflectionsDelay; // 0x4
	float GainHF; // 0x8
	float ReflectionsGain; // 0xc
	bool bBypassLateReflections; // 0x10
	float LateDelay; // 0x14
	float DecayTime; // 0x18
	float Density; // 0x1c
	float Diffusion; // 0x20
	float AirAbsorptionGainHF; // 0x24
	float DecayHFRatio; // 0x28
	float LateGain; // 0x2c
	float Gain; // 0x30
	float WetLevel; // 0x34
	float DryLevel; // 0x38
	bool bBypass; // 0x3c
};

struct FDelegateRuntimeBinding {
	FString ObjectName; // 0x0
	FName PropertyName; // 0x10
	FName FunctionName; // 0x18
	FDynamicPropertyPath SourcePath; // 0x20
	EBindingKind Kind; // 0x48
};

struct FSlateChildSize {
	float Value; // 0x0
	ESlateSizeRule SizeRule; // 0x4
};

struct FPolygonToSplit {
	FPolygonID PolygonID; // 0x0
	TArray<FVertexPair> VertexPairsToSplitAt; // 0x8
};

struct FStructSerializerBuiltinTestStruct {
	FGuid Guid; // 0x0
	FName Name; // 0x10
	FString String; // 0x18
	FText Text; // 0x28
	FVector Vector; // 0x40
	FVector4 Vector4; // 0x50
	FRotator Rotator; // 0x60
	FQuat Quat; // 0x70
	FColor Color; // 0x80
};

struct FSubsurfaceProfileStruct {
	FLinearColor SurfaceAlbedo; // 0x0
	FLinearColor MeanFreePathColor; // 0x10
	float MeanFreePathDistance; // 0x20
	float WorldUnitScale; // 0x24
	bool bEnableBurley; // 0x28
	float ScatterRadius; // 0x2c
	FLinearColor SubsurfaceColor; // 0x30
	FLinearColor FalloffColor; // 0x40
	FLinearColor BoundaryColorBleed; // 0x50
	float ExtinctionScale; // 0x60
	float NormalScale; // 0x64
	float ScatteringDistribution; // 0x68
	float IOR; // 0x6c
	float Roughness0; // 0x70
	float Roughness1; // 0x74
	float LobeMix; // 0x78
	FLinearColor TransmissionTintColor; // 0x7c
};

struct FLocalizedIconInfo {
	FString LanguageCode; // 0x0
	FDirectoryPath IconModelPath; // 0x10
	FDirectoryPath IconPortalPath; // 0x20
};

struct FConvolutionBloomSettings {
	UTexture2D* Texture; // 0x0
	float Size; // 0x8
	FVector2D CenterUV; // 0xc
	float PreFilterMin; // 0x14
	float PreFilterMax; // 0x18
	float PreFilterMult; // 0x1c
	float BufferScale; // 0x20
};

struct FMovieSceneCameraAnimSectionTemplate {
	FMovieSceneCameraAnimSectionData SourceData; // 0x20
	FFrameNumber SectionStartTime; // 0x40
};

struct FItemCodeValueArray {
	TArray<FItemCodeValue> ItemList; // 0x8
};

struct FAkGeometrySurfacePropertiesToMap {
	TSoftObjectPtr<UAkAcousticTexture> AcousticTexture; // 0x0
	float OcclusionValue; // 0x28
};

struct FMagicLeapPlaneBoundaries {
	FGuid ID; // 0x0
	TArray<FMagicLeapPlaneBoundary> Boundaries; // 0x10
};

struct FTemplateSequenceBindingOverrideData {
	TWeakObjectPtr<UObject> Object; // 0x0
	bool bOverridesDefault; // 0x8
};

struct FBP_Struct_CharacterHitCapsule {
	float HitTime_29_4D24C21F4E11AD0D66514A9AD955CC03; // 0x0
	FVector Location_27_3EA05C5240DD0AC97E7359813222A549; // 0x4
	float CapsuleRadius_14_E8E291DA43EC2DD9C98503A713A58CFF; // 0x10
	float CapsuleHalfHeight_16_1568F1CC4124A92123FA728B2E9925E5; // 0x14
};

struct FListMetricsResult {
	TArray<FMetric> Metrics; // 0x0
	FString NextToken; // 0x10
	FResponseMetadata ResponseMetadata; // 0x20
};

struct FBakedCustomAttributePerBoneData {
	int32_t BoneTreeIndex; // 0x0
	TArray<FBakedStringCustomAttribute> StringAttributes; // 0x8
	TArray<FBakedIntegerCustomAttribute> IntAttributes; // 0x18
	TArray<FBakedFloatCustomAttribute> FloatAttributes; // 0x28
};

struct FMovieSceneIntegerChannel {
	TArray<FFrameNumber> Times; // 0x8
	int32_t DefaultValue; // 0x18
	bool bHasDefaultValue; // 0x1c
	TArray<int32_t> Values; // 0x20
};

struct FInputAlphaBoolBlend {
	float BlendInTime; // 0x0
	float BlendOutTime; // 0x4
	EAlphaBlendOption BlendOption; // 0x8
	bool bInitialized; // 0x9
	UCurveFloat* CustomCurve; // 0x10
	FAlphaBlend AlphaBlend; // 0x18
};

struct FAnimLegIKDefinition {
	FBoneReference IKFootBone; // 0x0
	FBoneReference FKFootBone; // 0x10
	int32_t NumBonesInLimb; // 0x20
	float MinRotationAngle; // 0x24
	EAxis FootBoneForwardAxis; // 0x28
	EAxis HingeRotationAxis; // 0x29
	bool bEnableRotationLimit; // 0x2a
	bool bEnableKneeTwistCorrection; // 0x2b
};

struct FMovieSceneSequenceCompilerMaskStruct {
	char bHierarchy : 1; // 0x0
	char bEvaluationTemplate : 1; // 0x0
	char bEvaluationTemplateField : 1; // 0x0
	char bEntityComponentField : 1; // 0x0
};

struct FTransformConstraintDescription {
	ETransformConstraintType TransformType; // 0x10
};

struct FAudioComponentParam {
	FName ParamName; // 0x0
	float FloatParam; // 0x8
	bool BoolParam; // 0xc
	int32_t IntParam; // 0x10
	USoundWave* SoundWaveParam; // 0x18
};

struct FS_TutorialData {
	FText TutorialTitle_23_328C6EBA4202436D45F470B30C9C5F8D; // 0x0
	UTexture2D* TutorialIcon_26_68F32BF84FC7A0F2BEC8D08A9B06EF52; // 0x18
	TArray<FS_TutorialGoalData> TutorialGoal_30_5C6EDADD4C914BA4E6CE2DA7AA3B4667; // 0x20
	FName StartDialog_18_CC92688A47BC13AAD5C8C1B671FAFAE6; // 0x30
	TArray<FArchiveItemInfo> SupplyItem_34_8167805F4BDB4738C023F685E5912F15; // 0x38
	TArray<FS_TutorialShowingRadiogram> ReplicaRadiogram_38_BA23084542C81CE003AD77807408790E; // 0x48
};

struct FMovieSceneBindingOverrideData {
	FMovieSceneObjectBindingID ObjectBindingId; // 0x0
	TWeakObjectPtr<UObject> Object; // 0x18
	bool bOverridesDefault; // 0x20
};

struct FNiagaraSystemCompiledData {
	FNiagaraParameterStore InstanceParamStore; // 0x0
	FNiagaraDataSetCompiledData DataSetCompiledData; // 0x78
	FNiagaraDataSetCompiledData SpawnInstanceParamsDataSetCompiledData; // 0xb8
	FNiagaraDataSetCompiledData UpdateInstanceParamsDataSetCompiledData; // 0xf8
	FNiagaraParameterDataSetBindingCollection SpawnInstanceGlobalBinding; // 0x138
	FNiagaraParameterDataSetBindingCollection SpawnInstanceSystemBinding; // 0x158
	FNiagaraParameterDataSetBindingCollection SpawnInstanceOwnerBinding; // 0x178
	TArray<FNiagaraParameterDataSetBindingCollection> SpawnInstanceEmitterBindings; // 0x198
	FNiagaraParameterDataSetBindingCollection UpdateInstanceGlobalBinding; // 0x1a8
	FNiagaraParameterDataSetBindingCollection UpdateInstanceSystemBinding; // 0x1c8
	FNiagaraParameterDataSetBindingCollection UpdateInstanceOwnerBinding; // 0x1e8
	TArray<FNiagaraParameterDataSetBindingCollection> UpdateInstanceEmitterBindings; // 0x208
};

struct FChaosDestructionEvent {
	FVector Position; // 0x0
	FVector Normal; // 0xc
	FVector Velocity; // 0x18
	FVector AngularVelocity; // 0x24
	float ExtentMin; // 0x30
	float ExtentMax; // 0x34
	int32_t ParticleID; // 0x38
	float Time; // 0x3c
	int32_t Type; // 0x40
};

struct FLandscapeSplineMeshEntry {
	UStaticMesh* Mesh; // 0x0
	TArray<UMaterialInterface*> MaterialOverrides; // 0x8
	char bCenterH : 1; // 0x18
	FVector2D CenterAdjust; // 0x1c
	char bScaleToWidth : 1; // 0x24
	FVector Scale; // 0x28
	LandscapeSplineMeshOrientation Orientation; // 0x34
	ESplineMeshAxis ForwardAxis; // 0x35
	ESplineMeshAxis UpAxis; // 0x36
};

struct FSourceEffectFoldbackDistortionSettings {
	float InputGainDb; // 0x0
	float ThresholdDb; // 0x4
	float OutputGainDb; // 0x8
};

struct FJsonObjectWrapper {
	FString JsonString; // 0x0
};

struct FAssetBundleEntry {
	FPrimaryAssetId BundleScope; // 0x0
	FName BundleName; // 0x10
	TArray<FSoftObjectPath> BundleAssets; // 0x18
};

struct FParameterChannelNames {
	FText R; // 0x0
	FText G; // 0x18
	FText B; // 0x30
	FText A; // 0x48
};

struct FSQSDeleteMessageRequest {
	FString QueueUrl; // 0x0
	FString ReceiptHandle; // 0x10
};

struct FS_ConvertData {
	FName Name_50_F65463494967F20A32554A835515CEF2; // 0x0
	TMap<E_ConvertType, FConvertItem> Type_54_C33864BB425E76FE4A3F48947A506DA3; // 0x8
};

struct FMovieSceneWidgetMaterialSectionTemplate {
	TArray<FName> BrushPropertyNamePath; // 0x80
};

struct FAnimNode_CopyPoseFromMesh {
	TWeakObjectPtr<USkeletalMeshComponent> SourceMeshComponent; // 0x10
	char bUseAttachedParent : 1; // 0x18
	char bCopyCurves : 1; // 0x18
	bool bCopyCustomAttributes; // 0x19
	char bUseMeshPose : 1; // 0x1a
	FName RootBoneToCopy; // 0x1c
};

struct FPropertyAccessCopy {
	int32_t AccessIndex; // 0x0
	int32_t DestAccessStartIndex; // 0x4
	int32_t DestAccessEndIndex; // 0x8
	EPropertyAccessCopyType Type; // 0xc
};

struct FPaperSpriteAtlasSlot {
	TSoftObjectPtr<UPaperSprite> SpriteRef; // 0x0
	int32_t AtlasIndex; // 0x28
	int32_t X; // 0x2c
	int32_t Y; // 0x30
	int32_t Width; // 0x34
	int32_t Height; // 0x38
};

struct FNiagaraVariableDataInterfaceBinding {
	FNiagaraVariable BoundVariable; // 0x0
};

struct FFunctionCaller {
	FName FunctionName; // 0x0
};

struct FNiagaraDeviceProfileStateEntry {
	FName ProfileName; // 0x0
	uint32_t QualityLevelMask; // 0x8
	uint32_t SetQualityLevelMask; // 0xc
};

struct FVehicleTransmissionData {
	bool bUseGearAutoBox; // 0x0
	float GearSwitchTime; // 0x4
	float GearAutoBoxLatency; // 0x8
	float FinalRatio; // 0xc
	TArray<FVehicleGearData> ForwardGears; // 0x10
	float ReverseGearRatio; // 0x20
	float NeutralGearUpRatio; // 0x24
	float ClutchStrength; // 0x28
};

struct FInt32Interval {
	int32_t Min; // 0x0
	int32_t Max; // 0x4
};

struct FHardwareCursorReference {
	FName CursorPath; // 0x0
	FVector2D HotSpot; // 0x8
};

struct FSteamUGCQueryHandle {
	FUInt64 handle; // 0x0
};

struct FLinearDriveConstraint {
	FVector PositionTarget; // 0x0
	FVector VelocityTarget; // 0xc
	FConstraintDrive XDrive; // 0x18
	FConstraintDrive YDrive; // 0x28
	FConstraintDrive ZDrive; // 0x38
	char bEnablePositionDrive : 1; // 0x48
};

struct FAnimationGroupReference {
	FName GroupName; // 0x0
	EAnimGroupRole GroupRole; // 0x8
	EAnimSyncGroupScope GroupScope; // 0x9
};

struct FListDashboardsRequest {
	FString DashboardNamePrefix; // 0x0
	FString NextToken; // 0x10
};

struct FS_WeaponRecoil {
	float RandomYawMin_27_1BC6DFFA403A0D5CA2AA388B351A820F; // 0x0
	float RandomYawMax_28_9411A1244A650D8DDD1471B5D5D11689; // 0x4
	float RandomPitchMin_29_33C12C0B409C825E8E446CA8D11590EA; // 0x8
	float RandomPitchMax_30_27DF23974D1A662E52091BB6720DDE2F; // 0xc
	UCurveVector* RecoilCurve_14_539E3A874643670835C868958A315ED0; // 0x10
	UCurveFloat* RecoilForceCurve_20_C6C2E10142F774FCBB16F7A4345B061F; // 0x18
	float CoolDownRate_21_AE733F4042FA58F6FD8072B7077F37EE; // 0x20
	bool NeedRecoil_38_88B5483943C7F2B6FA9D7DB1E741C964; // 0x24
	UCurveFloat* RecoveryForceCurve_36_03A1968D45EDC59AE929D298A95545CB; // 0x28
	float RecoveryForce_25_EA8C02ED40F5E405E62277A6FF1EFA7A; // 0x30
	float RecoveryCooltime_33_FAA04CAE45FBB9338ADBDC929F12DDD7; // 0x34
};

struct FCompositeSubFont {
	TArray<FInt32Range> CharacterRanges; // 0x18
	FString Cultures; // 0x28
};

struct FDeleteDashboardsResult {
	FResponseMetadata ResponseMetadata; // 0x0
};

struct FLiveLinkSourceDebugInfo {
	FLiveLinkSubjectName SubjectName; // 0x0
	int32_t SnapshotIndex; // 0x8
	int32_t NumberOfBufferAtSnapshot; // 0xc
};

struct FNiagaraGraphViewSettings {
	FVector2D Location; // 0x0
	float Zoom; // 0x8
	bool bIsValid; // 0xc
};

struct FProfileParameterDat {
	FString ProfileName; // 0x0
	TArray<FCustomizableObjectBoolParameterValue> BoolParameters; // 0x10
	TArray<FCustomizableObjectIntParameterValue> IntParameters; // 0x20
	TArray<FCustomizableObjectFloatParameterValue> FloatParameters; // 0x30
	TArray<FCustomizableObjectTextureParameterValue> TextureParameters; // 0x40
	TArray<FCustomizableObjectVectorParameterValue> VectorParameters; // 0x50
	TArray<FCustomizableObjectProjectorParameterValue> ProjectorParameters; // 0x60
};

struct FDescribeLogGroupsResult {
	TArray<FLogGroup> LogGroups; // 0x0
	FString NextToken; // 0x10
};

struct FParticleBurst {
	int32_t Count; // 0x0
	int32_t CountLow; // 0x4
	float Time; // 0x8
};

struct FNPCSpec {
	ASurvivalAICharacterBase* CharacterClass; // 0x8
	FText Name; // 0x10
	float MaxHealth; // 0x28
	float TimeAfterDeath; // 0x2c
	bool UseCorpseFarmingDialog; // 0x30
	TArray<FItemCodeValue> RandomDropItemTables; // 0x38
	UBehaviorTree* BehaviorTree; // 0x48
	TArray<FNPCMeleeAttackInfo> MeleeAttackType; // 0x50
	TArray<FNPCRangeAttackInfo> RangeAttackType; // 0x60
	TArray<UAnimMontage*> HitAnimations; // 0x70
	TMap<FName, float> MultiplyDamageByBone; // 0x80
	float DamageMultiplyStartCriticalAnimation; // 0xd0
	TMap<UDamageType*, float> ResistanceByType; // 0xd8
	FNPCWeaponInfo WeaponInfo; // 0x128
	FNPCShieldInfo ShieldInfo; // 0x138
	float StunCoolTime; // 0x178
	float StunDuration; // 0x17c
	float HitForce; // 0x180
};

struct FLightPropagationVolumeSettings {
	char bOverride_LPVIntensity : 1; // 0x0
	char bOverride_LPVDirectionalOcclusionIntensity : 1; // 0x0
	char bOverride_LPVDirectionalOcclusionRadius : 1; // 0x0
	char bOverride_LPVDiffuseOcclusionExponent : 1; // 0x0
	char bOverride_LPVSpecularOcclusionExponent : 1; // 0x0
	char bOverride_LPVDiffuseOcclusionIntensity : 1; // 0x0
	char bOverride_LPVSpecularOcclusionIntensity : 1; // 0x0
	char bOverride_LPVSize : 1; // 0x0
	char bOverride_LPVSecondaryOcclusionIntensity : 1; // 0x1
	char bOverride_LPVSecondaryBounceIntensity : 1; // 0x1
	char bOverride_LPVGeometryVolumeBias : 1; // 0x1
	char bOverride_LPVVplInjectionBias : 1; // 0x1
	char bOverride_LPVEmissiveInjectionIntensity : 1; // 0x1
	float LPVIntensity; // 0x4
	float LPVVplInjectionBias; // 0x8
	float LPVSize; // 0xc
	float LPVSecondaryOcclusionIntensity; // 0x10
	float LPVSecondaryBounceIntensity; // 0x14
	float LPVGeometryVolumeBias; // 0x18
	float LPVEmissiveInjectionIntensity; // 0x1c
	float LPVDirectionalOcclusionIntensity; // 0x20
	float LPVDirectionalOcclusionRadius; // 0x24
	float LPVDiffuseOcclusionExponent; // 0x28
	float LPVSpecularOcclusionExponent; // 0x2c
	float LPVDiffuseOcclusionIntensity; // 0x30
	float LPVSpecularOcclusionIntensity; // 0x34
	float LPVFadeRange; // 0x38
	float LPVDirectionalOcclusionFadeRange; // 0x3c
};

struct FAutoCompleteCommand {
	FString Command; // 0x0
	FString Desc; // 0x10
};

struct FSynthKnobStyle {
	FSlateBrush LargeKnob; // 0x8
	FSlateBrush LargeKnobOverlay; // 0x90
	FSlateBrush MediumKnob; // 0x118
	FSlateBrush MediumKnobOverlay; // 0x1a0
	float MinValueAngle; // 0x228
	float MaxValueAngle; // 0x22c
	ESynthKnobSize KnobSize; // 0x230
};

struct FTagAndValue {
	FName Tag; // 0x0
	FString Value; // 0x8
};

struct FS_Dialogue {
	FSlateBrush Portrait_3_D34F99BD488E870B5EFBD18662BB207F; // 0x0
	FText Dialogue_7_25B4F45B4F0256876E71629CD93294D7; // 0x88
	float AppearTime_10_165950C44EC8FEE0D09CC1BE4E85D310; // 0xa0
};

struct FMagicLeapPlanesQuery {
	TArray<EMagicLeapPlaneQueryFlags> Flags; // 0x0
	UBoxComponent* SearchVolume; // 0x10
	int32_t MaxResults; // 0x18
	float MinHoleLength; // 0x1c
	float MinPlaneArea; // 0x20
	FVector SearchVolumePosition; // 0x24
	FQuat SearchVolumeOrientation; // 0x30
	FVector SearchVolumeExtents; // 0x40
	float SimilarityThreshold; // 0x4c
	bool bSearchVolumeTrackingSpace; // 0x50
	bool bResultTrackingSpace; // 0x51
};

struct FAnimNode_SpringBone {
	FBoneReference SpringBone; // 0xc8
	float MaxDisplacement; // 0xd8
	float SpringStiffness; // 0xdc
	float SpringDamping; // 0xe0
	float ErrorResetThresh; // 0xe4
	char bLimitDisplacement : 1; // 0x124
	char bTranslateX : 1; // 0x124
	char bTranslateY : 1; // 0x124
	char bTranslateZ : 1; // 0x124
	char bRotateX : 1; // 0x124
	char bRotateY : 1; // 0x124
	char bRotateZ : 1; // 0x124
};

struct FUntagResourceResult {
	FResponseMetadata ResponseMetadata; // 0x0
};

struct FInterpCurvePointLinearColor {
	float InVal; // 0x0
	FLinearColor OutVal; // 0x4
	FLinearColor ArriveTangent; // 0x14
	FLinearColor LeaveTangent; // 0x24
	EInterpCurveMode InterpMode; // 0x34
};

struct FS_FieldNPCInfo {
	TMap<FName, FS_FieldNPC_OneSpawnInfoArray> SpawnInfo_18_1235B50E4F1FBEF8100B248FD6299283; // 0x0
	float PlayerCheckDistanceOffset_13_A98DF85C409E3B42E3E45CB305608E78; // 0x50
	FName PatrolAreaComponentTag_12_287EF74746D0DE9BB7FF5EA2F651DF6C; // 0x54
	float NPCRespawnDelaySecAfterKilled_22_2201A82B42AC97CA00EA0A8C8B31EF78; // 0x5c
	TArray<UObject*> SpawnBottomClasses_27_1826CD034C20231620E73F90515B05A3; // 0x60
	FName SpawnBottomTag_30_1AC28C124230DBCED395C391DA9A800B; // 0x70
};

struct FSourceEffectEnvelopeFollowerSettings {
	float AttackTime; // 0x0
	float ReleaseTime; // 0x4
	EEnvelopeFollowerPeakMode PeakMode; // 0x8
	bool bIsAnalogMode; // 0x9
};

struct FDatasmithRetessellationOptions {
	EDatasmithCADRetessellationRule RetessellationRule; // 0x10
};

struct FSkeletalMeshBuildSettings {
	char bRecomputeNormals : 1; // 0x0
	char bRecomputeTangents : 1; // 0x0
	char bUseMikkTSpace : 1; // 0x0
	char bComputeWeightedNormals : 1; // 0x0
	char bRemoveDegenerates : 1; // 0x0
	char bUseHighPrecisionTangentBasis : 1; // 0x0
	char bUseFullPrecisionUVs : 1; // 0x0
	char bBuildAdjacencyBuffer : 1; // 0x0
	float ThresholdPosition; // 0x4
	float ThresholdTangentNormal; // 0x8
	float ThresholdUV; // 0xc
	float MorphThresholdPosition; // 0x10
};

struct FNiagaraVMExecutableDataId {
	FGuid CompilerVersionID; // 0x0
	ENiagaraScriptUsage ScriptUsageType; // 0x10
	FGuid ScriptUsageTypeID; // 0x14
	char bUsesRapidIterationParams : 1; // 0x24
	char bInterpolatedSpawn : 1; // 0x24
	char bRequiresPersistentIDs : 1; // 0x24
	FGuid BaseScriptID; // 0x28
	FNiagaraCompileHash BaseScriptCompileHash; // 0x38
};

struct FMagicLeapSharedWorldPinData {
	FGuid PinId; // 0x0
	FMagicLeapARPinState PinState; // 0x10
};

struct FAnimNode_LegIK {
	float ReachPrecision; // 0xc8
	int32_t MaxIterations; // 0xcc
	TArray<FAnimLegIKDefinition> LegsDefinition; // 0xd0
};

struct FScaleTrack {
	TArray<FVector> ScaleKeys; // 0x0
	TArray<float> Times; // 0x10
};

struct FAutomationEvent {
	EAutomationEventType Type; // 0x0
	FString Message; // 0x8
	FString Context; // 0x18
	FGuid Artifact; // 0x28
};

struct FMovieSceneSkeletalAnimationParams {
	UAnimSequenceBase* Animation; // 0x0
	FFrameNumber FirstLoopStartFrameOffset; // 0x8
	FFrameNumber StartFrameOffset; // 0xc
	FFrameNumber EndFrameOffset; // 0x10
	float PlayRate; // 0x14
	char bReverse : 1; // 0x18
	FName SlotName; // 0x1c
	FMovieSceneFloatChannel Weight; // 0x28
	bool bSkipAnimNotifiers; // 0xc8
	bool bForceCustomMode; // 0xc9
	float StartOffset; // 0xcc
	float EndOffset; // 0xd0
};

struct FPrecomputedSkyLightInstanceData {
	FGuid LightGuid; // 0xb8
	float AverageBrightness; // 0xc8
};

struct FS_BuildPartInfo {
	FText Name_200_17328985467CE1655527AFAD4498AA29; // 0x0
	UTexture2D* Icon_123_FE3E66B04EB50C76F52B9A897E43A5D5; // 0x18
	FText Description_169_261663CF417D93614DA936920B60101B; // 0x20
	int32_t Health_61_90968A724E63E582E36A3BB8A7464581; // 0x38
	bool TakeDamage_91_7B9FB8BB47D8DD56D64D1CAA75476A61; // 0x3c
	bool RotationEnabled_29_15ACBF1945857C0B2BC47A864BC65115; // 0x3d
	float RotationIncrements_77_A6AC2550417D71D92CB3FD87FD3754AD; // 0x40
	FDataTableRowHandle UpgradeBuildPart_79_27B2F48B4235E15DD3ED31BEE4BFDC59; // 0x48
	TArray<FItemCodeValue> RepairItem_217_F0F40EDB45929CC12C5244A30E55E235; // 0x58
	ABP_BuildPartBase_C* BlueprintClass_163_639ED7414D4AB512F1BECCB9B7E57B93; // 0x68
	TArray<UStaticMesh*> StaticMesh_124_B4724319453E69FBB292B388EEDCA228; // 0x70
	TArray<UDestructibleMesh*> DestructibleMesh_125_4F8797AA4A13A416AB00A38BF749C987; // 0x80
	TArray<FItemCodeValue> BuildingCost_218_D2F4F28D40A1B7DC445C8EBEF524C71F; // 0x90
	float PlacementAngle>_103_FEA8A07A4E7145BBF410F897F49E643E; // 0xa0
	float PlacementAngle<_106_D456798E461898D3D3B8BDBB1C728FBF; // 0xa4
	bool RequireNameInput_108_7FBC1FA44FADED739B01088470D638CC; // 0xa8
	bool bUseDecaySystem_128_448A466C417063A39700A89D1C66C6E5; // 0xa9
	float EnergyValueForDecayPreventPerTime_135_48DAF7A74E0FBE9D31D091922AD6FA3A; // 0xac
	float FirstDecayProtectTime_133_BB843EB24C86E75869B972B040090CD6; // 0xb0
	float DecayDamage_139_8C8CEFD04CE2EBF94CB0ABAB356909B9; // 0xb4
	float DecayInterval_166_F16F198E43FD61B24D53D6ABC745480A; // 0xb8
	bool bBuildSystemVisible_148_00A5AA984F32E0327BE8DAB2EA64F298; // 0xbc
	int32_t SortOrder_151_7DB3ADA84A1DED12A294598CD2D70430; // 0xc0
	bool ConsiderSlopeDegree_154_61A800E743B3D12D1C3DFAA6121335C4; // 0xc4
	float DefaultPreivewDistance_157_CA02023E4754456DE1AEE89A23A5B622; // 0xc8
	TArray<EBuildLayoutType> BuildLayoutList_161_70B2C1784C8FBE5E4035CF9003D8B734; // 0xd0
	bool bCanPickup_168_494F7D4D4537E153B18AEF8C85B37A61; // 0xe0
	bool bAddToOwner_172_913D06AB4B508FB1A75613A667C3CF94; // 0xe1
	TSoftObjectPtr<UAkSwitchValue> ConstructionSound_206_D64E44B640789E0F51E19AB171D607CD; // 0xe8
	TSoftObjectPtr<UAkSwitchValue> DestroySound_208_B971203D4C4EC94CA304D58CDEA43356; // 0x110
	TSoftObjectPtr<UAkSwitchValue> RepairSound_209_E2D6EE4D4EA59902D04EF7A9137BC3FA; // 0x138
	TSoftObjectPtr<UAkSwitchValue> UpgradeSound_210_1E6AB2BD4CB6C3FF3BE2D6B5FFA9A442; // 0x160
	bool bAllowRepair_190_4BFC5B934CCFAFE995F3EE87EE7C1A05; // 0x188
	bool bIsDependencyJointBuild_193_8C5940BC40F6EE8D761FB48A51F30200; // 0x189
	TArray<FIntPair> UpgradeConditionByUnlockedRadiogram_219_086F1B504DF9C9ED8B4A0B94589DA81C; // 0x190
	bool bIgnoreTerracoreAuth_202_AED4C63040D26CA3F491BA9750477D84; // 0x1a0
	bool ReverseEnabled_204_B9238EDF4223194E4DB9A0B49FE76028; // 0x1a1
	float RepairCooltime_213_3C66F7F34E20CA1F0C99F6A7745658B7; // 0x1a4
	float RepairAmount_216_F0E9D39D4C142D9A6E89D7BB72416A1E; // 0x1a8
	TMap<UMasterDamageType_C*, float> ReduceDamageMultiplierByDamageType_224_83349BA44FC1764CD89C858B044C6816; // 0x1b0
};

struct FGeneratedMaterial {
	TArray<FGeneratedTexture> Textures; // 0x0
};

struct FRootMotionMovementParams {
	bool bHasRootMotion; // 0x0
	float BlendWeight; // 0x4
	FTransform RootMotionTransform; // 0x10
};

struct FConstraintDescriptionEx {
	FFilterOptionPerAxis AxesFilterOption; // 0x8
};

struct FInstancedStaticMeshLightMapInstanceData {
	FTransform Transform; // 0x0
	TArray<FGuid> MapBuildDataIds; // 0x30
};

struct FAddRemoveItemDependencyResult {
	FSteamUGCItemId dependendItemId; // 0x10
	bool bAddDependency; // 0x18
};

struct FTouchInputControl {
	UTexture2D* Image1; // 0x0
	UTexture2D* Image2; // 0x8
	FVector2D Center; // 0x10
	FVector2D VisualSize; // 0x18
	FVector2D ThumbSize; // 0x20
	FVector2D InteractionSize; // 0x28
	FVector2D InputScale; // 0x30
	FKey MainInputKey; // 0x38
	FKey AltInputKey; // 0x50
};

struct FMovieSceneAkAudioEventTemplate {
	UMovieSceneAkAudioEventSection* Section; // 0x20
};

struct FModularSynthPresetBankEntry {
	FString PresetName; // 0x0
	FModularSynthPreset Preset; // 0x10
};

struct FNamedSlotBinding {
	FName Name; // 0x0
	UWidget* Content; // 0x8
};

struct FS_RangeWeaponInfo {
	FDamageStruct ProjectileDamageStruct_109_DC2718EC491AFE06FD7A08B9090646D1; // 0x0
	int32_t AmmoMax_100_28617DFC48E434B2F2B8CEA44AD62EDA; // 0x38
	FDataTableRowHandle AmmoItem_90_248511AF41B8DB19FBA390ABF28F08DA; // 0x40
	float ReloadTime_8_D2BB5CA64DBB1A930EF663BEB4450F62; // 0x50
	FS_WeaponRecoil PerShotRecoil_82_D0D32E9247786DBD734A68A8DCBC2D1D; // 0x58
	FS_WeaponRecoil ZoomPerShotRecoil_86_C9FA07DD4D303AC44A7B3DAA209F87D8; // 0x90
	FS_WeaponRecoil CrouchPerShotRecoil_87_7798A6164C17154C90448498D8AE39C6; // 0xc8
	int32_t MultiShotCount_101_C46F6A704EB71D6ADBC89BBBB4F99653; // 0x100
	TSet<EFireMode> FireMode_46_ED9AB46847F0D037BE6577876C378B37; // 0x108
	int32_t BurstFireCount_54_7A849B0649D5D33E9F76C48471B2ADDF; // 0x158
	float BurstFireDelay_53_19665AB14E99118FF02D819FB4F5447F; // 0x15c
	float Cooltime_58_1E5C7E8349BF98D73E42588A2F6FFD2E; // 0x160
	float BurstCoolTime_108_6F30B6DF4523804CD72FA9B81124D49B; // 0x164
	TMap<EPlayerMoveState, float> MovementSpeed_63_8E72061B409598EBD388658E79DE5760; // 0x168
	TMap<EPlayerMoveState, float> MinSpread_67_51C87652404EF49975F30AB7266868AE; // 0x1b8
	TMap<EPlayerMoveState, float> MaxSpread_69_B1DCE588497EDCE3F4491B8DFEFA0260; // 0x208
	float SpreadIncreasePerShot_94_37A3CCB144EAA2FC480FE0A315067129; // 0x258
	float SpreadReductionRate_99_3A0CCB9B4569E9D1092C84B9AABD4BF1; // 0x25c
	float AgainReduceSpreadTime_98_6003B9724437FCEAC0684EA998F9B9CB; // 0x260
	float ADSFOV_73_B560DB8A441BBC80A26374BE3226930C; // 0x264
	float ADSSpeed_75_0D88FBDF43BFACD5A752CF9E61B4B199; // 0x268
	UCurveFloat* DropRateCurve_79_DFBAA1B74398511177B8009FFE3B6E1E; // 0x270
	UCurveFloat* MultifleDamageCurve_81_1B4068F04BDEBBC1DDBB45A2CA92A4DC; // 0x278
	TArray<EAttachmentType> AvailableAttachments_115_1A2A47014425694300B196867D381EDE; // 0x280
	EFireMode DefaultFireMode_118_FC071F4F4DAECB0CC2E86293DF72B0F8; // 0x290
};

struct FNamedEmitterMaterial {
	FName Name; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FParameterGroupData {
	FString GroupName; // 0x0
	int32_t GroupSortPriority; // 0x10
};

struct FTimeStretchCurve {
	float SamplingRate; // 0x0
	float CurveValueMinPrecision; // 0x4
	TArray<FTimeStretchCurveMarker> Markers; // 0x8
	float Sum_dT_i_by_C_i[0x3]; // 0x18
};

struct FUserTerraPointInfo {
	float DailyRecvTime; // 0x0
	int32_t TerraPoint; // 0x4
	TArray<FTerraShopMerchandise> DailyMerchandise; // 0x8
	TArray<FTerraShopMerchandise> SessionMerchandise; // 0x18
};

struct FLiveLinkAnimationFrameData {
	TArray<FTransform> Transforms; // 0xa0
};

struct FMovieSceneEvaluationGroup {
	TArray<FMovieSceneEvaluationGroupLUTIndex> LUTIndices; // 0x0
	TArray<FMovieSceneFieldEntry_EvaluationTrack> TrackLUT; // 0x10
	TArray<FMovieSceneFieldEntry_ChildTemplate> SectionLUT; // 0x20
};

struct FMovieSceneEvaluationFieldEntityMetaData {
	FFrameNumber ForcedTime; // 0x0
	ESectionEvaluationFlags Flags; // 0x8
	char bEvaluateInSequencePreRoll : 1; // 0x9
	char bEvaluateInSequencePostRoll : 1; // 0x9
};

struct FMailData {
	FText Sender; // 0x0
	FString SenderUID; // 0x18
	FString RecieverUID; // 0x28
	FText title; // 0x38
	FText Contents; // 0x50
	float MailSendTime; // 0x68
	float MailArriveTime; // 0x6c
	float MailValidityTime; // 0x70
	bool bRead; // 0x74
	TArray<FArchiveItemInfo> ItemList; // 0x78
};

struct FKey {
	FName KeyName; // 0x0
};

struct FS_FistAttachmentTraceInfo {
	float Distance_2_C1FEFBFD46525AF680279ABA0A685745; // 0x0
	float Range_4_C40900AA49B11D30DACEC8A66787BFEC; // 0x4
};

struct FSQSListQueueTagsRequest {
	FString QueueUrl; // 0x0
};

struct FInputAxisConfigEntry {
	FName AxisKeyName; // 0x0
	FInputAxisProperties AxisProperties; // 0x8
};

struct FPBUF_sv_NameRes {
	FString Name; // 0x0
};

struct FAnimParentNodeAssetOverride {
	UAnimationAsset* NewAsset; // 0x0
	FGuid ParentNodeGuid; // 0x8
};

struct FDatasmithMeshSectionInfoTemplate {
	int32_t MaterialIndex; // 0x0
};

struct FCurveTableRowHandle {
	UCurveTable* CurveTable; // 0x0
	FName RowName; // 0x8
};

struct FTwoVectors {
	FVector v1; // 0x0
	FVector v2; // 0xc
};

struct FMovieSceneCameraAnimSectionData {
	UCameraAnim* CameraAnim; // 0x0
	float PlayRate; // 0x8
	float PlayScale; // 0xc
	float BlendInTime; // 0x10
	float BlendOutTime; // 0x14
	bool bLooping; // 0x18
};

struct FChaosBreakEvent {
	UPrimitiveComponent* Component; // 0x0
	FVector Location; // 0x8
	FVector Velocity; // 0x14
	FVector AngularVelocity; // 0x20
	float Mass; // 0x2c
};

struct FS_RadiogramInfo {
	FText RadioGramGroupName_2_B0CA6B10461FFF5896B885960D16AAA5; // 0x0
	FText FromText_17_0551E65A41C5A2D922B88F8D75528403; // 0x18
	E_RadiogramHologramType HologramType_7_B9BD799F475F61CBF0BEA0B648F5CF13; // 0x30
	TArray<FS_RadiogramGuide> ObjectiveList_24_9BDFABDA4E3CDDE8C2F152AC4DCD753F; // 0x38
	FLinearColor GroupColor_23_928D950D474DFB486C89578CC61925AB; // 0x48
	bool PreOpen_26_B2BFEC784F2518F1C27A10A1BC491D23; // 0x58
	bool ShowObjective_28_FE122434479EA44D881C6FA6EA35F5E8; // 0x59
};

struct FNiagaraID {
	int32_t Index; // 0x0
	int32_t AcquireTag; // 0x4
};

struct FOptionalMovieSceneBlendType {
	EMovieSceneBlendType BlendType; // 0x0
	bool bIsValid; // 0x1
};

struct FPhysicalAnimationProfile {
	FName ProfileName; // 0x0
	FPhysicalAnimationData PhysicalAnimationData; // 0x8
};

struct FLandscapeComponentMaterialOverride {
	FPerPlatformInt LODIndex; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FPBUF_sv_Location {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
};

struct FDimensionFilter {
	FString Name; // 0x0
	FString Value; // 0x10
};

struct FDeleteLogGroupRequest {
	FString LogGroupName; // 0x0
};

struct FClothParameterMask_Legacy {
	FName MaskName; // 0x0
	EWeightMapTargetCommon CurrentTarget; // 0x8
	float MaxValue; // 0xc
	float MinValue; // 0x10
	TArray<float> Values; // 0x18
	bool bEnabled; // 0x28
};

struct FSourceEffectPannerSettings {
	float Spread; // 0x0
	float Pan; // 0x4
};

struct FS_ResourceBoxInfo {
	FString ItemGenerate_2_85B3FCD444BD73CE71A447AB8E12236E; // 0x0
};

struct FSessionServiceLog {
	FName Category; // 0x0
	FString Data; // 0x8
	FGuid InstanceId; // 0x18
	double TimeSeconds; // 0x28
	char Verbosity; // 0x30
};

struct FScrollBoxStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
	FSlateBrush LeftShadowBrush; // 0x118
	FSlateBrush RightShadowBrush; // 0x1a0
};

struct FAkXboxOneAdvancedInitializationSettings {
	uint16_t MaximumNumberOfXMAVoices; // 0x30
	bool UseHardwareCodecLowLatencyMode; // 0x32
};

struct FInterpCurvePointQuat {
	float InVal; // 0x0
	FQuat OutVal; // 0x10
	FQuat ArriveTangent; // 0x20
	FQuat LeaveTangent; // 0x30
	EInterpCurveMode InterpMode; // 0x40
};

struct FMutableModelImageProperties {
	FString TextureParameterName; // 0x0
	TextureFilter Filter; // 0x10
	char SRGB : 1; // 0x14
	int32_t LODBias; // 0x18
};

struct FNiagaraSystemUpdateContext {
	TArray<UNiagaraComponent*> ComponentsToReset; // 0x0
	TArray<UNiagaraComponent*> ComponentsToReInit; // 0x10
	TArray<UNiagaraComponent*> ComponentsToNotifySimDestroy; // 0x20
	TArray<UNiagaraSystem*> SystemSimsToDestroy; // 0x30
};

struct FFrameNumberRangeBound {
	ERangeBoundTypes Type; // 0x0
	FFrameNumber Value; // 0x4
};

struct FMovieSceneStringPropertySectionTemplate {
	FMovieSceneStringChannel StringCurve; // 0x38
};

struct FPropertyAccessIndirectionChain {
	TFieldPath<FProperty> Property; // 0x0
	int32_t IndirectionStartIndex; // 0x20
	int32_t IndirectionEndIndex; // 0x24
	int32_t EventId; // 0x28
};

struct FStatColorMapEntry {
	float In; // 0x0
	FColor Out; // 0x4
};

struct FMovieSceneTemplateGenerationLedger {
	FMovieSceneTrackIdentifier LastTrackIdentifier; // 0x0
	TMap<FGuid, FMovieSceneTrackIdentifier> TrackSignatureToTrackIdentifier; // 0x8
	TMap<FGuid, FMovieSceneFrameRange> SubSectionRanges; // 0x58
};

struct FRotationTrack {
	TArray<FQuat> RotKeys; // 0x0
	TArray<float> Times; // 0x10
};

struct FLandmassTerrainCarvingSettings {
	EBrushBlendType BlendMode; // 0x0
	bool bInvertShape; // 0x1
	FLandmassFalloffSettings FalloffSettings; // 0x4
	FLandmassBrushEffectsList Effects; // 0x18
	int32_t Priority; // 0x78
};

struct FMovieSceneFieldEntry_EvaluationTrack {
	FMovieSceneEvaluationFieldTrackPtr TrackPtr; // 0x0
	uint16_t numChildren; // 0x8
};

struct FPrimaryAssetRulesCustomOverride {
	FPrimaryAssetType PrimaryAssetType; // 0x0
	FDirectoryPath FilterDirectory; // 0x8
	FString FilterString; // 0x18
	FPrimaryAssetRules Rules; // 0x28
};

struct FS_FieldNPC_OneSpawnInfoArray {
	TArray<FS_FieldNPC_OneSpawnInfo> NPCInfos_3_4E7CC564419C840C7ABB1CA892B0AA93; // 0x0
};

struct FPredictProjectilePathResult {
	TArray<FPredictProjectilePathPointData> PathData; // 0x0
	FPredictProjectilePathPointData LastTraceDestination; // 0x10
	FHitResult HitResult; // 0x2c
};

struct FAnimNode_TransitionPoseEvaluator {
	int32_t FramesToCachePose; // 0xe8
	EEvaluatorDataSource DataSource; // 0xf0
	EEvaluatorMode EvaluatorMode; // 0xf1
};

struct FPaperTileSetTerrain {
	FString TerrainName; // 0x0
	int32_t CenterTileIndex; // 0x10
};

struct FSourceEffectWaveShaperSettings {
	float Amount; // 0x0
	float OutputGainDb; // 0x4
};

struct FDestructibleDepthParameters {
	EImpactDamageOverride ImpactDamageOverride; // 0x0
};

struct FNiagaraPlatformSet {
	int32_t QualityLevelMask; // 0x0
	TArray<FNiagaraDeviceProfileStateEntry> DeviceProfileStates; // 0x8
	TArray<FNiagaraPlatformSetCVarCondition> CVarConditions; // 0x18
};

struct FAIDataProviderValue {
	UAIDataProvider* DataBinding; // 0x10
	FName DataField; // 0x18
};

struct FAudioCaptureDeviceInfo {
	FName DeviceName; // 0x0
	int32_t NumInputChannels; // 0x8
	int32_t SampleRate; // 0xc
};

struct FCollectionVectorParameter {
	FLinearColor DefaultValue; // 0x18
};

struct FTextBlockStyle {
	FSlateFontInfo Font; // 0x8
	FSlateColor ColorAndOpacity; // 0x60
	FVector2D ShadowOffset; // 0x88
	FLinearColor ShadowColorAndOpacity; // 0x90
	FSlateColor SelectedBackgroundColor; // 0xa0
	FLinearColor HighlightColor; // 0xc8
	FSlateBrush HighlightShape; // 0xd8
	FSlateBrush StrikeBrush; // 0x160
	FSlateBrush UnderlineBrush; // 0x1e8
};

struct FEditedDocumentInfo {
	FSoftObjectPath EditedObjectPath; // 0x0
	FVector2D SavedViewOffset; // 0x18
	float SavedZoomAmount; // 0x20
	UObject* EditedObject; // 0x28
};

struct FTeamVoiceInfo {
	ASurvivalPlayerState* Member_PS; // 0x0
	FString Member_ID; // 0x8
	float Volume; // 0x18
	bool bIsMute; // 0x1c
};

struct FFilePath {
	FString FilePath; // 0x0
};

struct FSwarmDebugOptions {
	char bDistributionEnabled : 1; // 0x0
	char bForceContentExport : 1; // 0x0
	char bInitialized : 1; // 0x0
};

struct FRMRemoteStructBase {
	FString Command; // 0x0
};

struct FStopQueryResult {
	bool bSuccess; // 0x0
};

struct FRMRemoteStructError {
	int32_t ResponseCode; // 0x0
	FString Error; // 0x8
};

struct FDragonData_FootData {
	FName Feet_Bone_Name; // 0x0
	FName Knee_Bone_Name; // 0x8
	FName Thigh_Bone_Name; // 0x10
	FRotator Feet_Rotation_Offset; // 0x18
	bool Fixed_Pole; // 0x24
	FVector Knee_Direction_Offset; // 0x28
	FVector Feet_Trace_Offset; // 0x34
	float Front_Trace_Point_Spacing; // 0x40
	float Side_Traces_Spacing; // 0x44
	float Feet_Rotation_Limit; // 0x48
	bool Fixed_Foot_Height; // 0x4c
	float Feet_Heights; // 0x50
	float Feet_Alpha; // 0x54
	float Min_Feet_Extension; // 0x58
	float Max_Feet_Extension; // 0x5c
	TArray<FDragonData_FingerData> Finger_Array; // 0x68
};

struct FSteamUGCQueryParameterUser {
	FString filenameFilter; // 0x50
	EUserUGCListBP list; // 0x60
	EUGCMatchingUGCTypeBP Type; // 0x61
	EUserUGCListSortOrderBP sortOrder; // 0x62
};

struct FInterpCurveVector {
	TArray<FInterpCurvePointVector> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FListDashboardsResult {
	TArray<FDashboardEntry> DashboardEntries; // 0x0
	FString NextToken; // 0x10
	FResponseMetadata ResponseMetadata; // 0x20
};

struct FAnimNode_ModifyCurve {
	FPoseLink SourcePose; // 0x10
	TArray<float> CurveValues; // 0x20
	TArray<FName> CurveNames; // 0x30
	float Alpha; // 0x50
	EModifyCurveApplyMode ApplyMode; // 0x54
};

struct FAnimNode_MultiWayBlend {
	TArray<FPoseLink> Poses; // 0x10
	TArray<float> DesiredAlphas; // 0x20
	FInputScaleBias AlphaScaleBias; // 0x40
	bool bAdditiveNode; // 0x48
	bool bNormalizeAlpha; // 0x49
};

struct FAnimNode_TwoWayBlend {
	FPoseLink A; // 0x10
	FPoseLink B; // 0x20
	EAnimAlphaInputType AlphaInputType; // 0x30
	char bAlphaBoolEnabled : 1; // 0x31
	char bResetChildOnActivation : 1; // 0x31
	float Alpha; // 0x34
	FInputScaleBias AlphaScaleBias; // 0x38
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
	FName AlphaCurveName; // 0x88
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x90
};

struct FRichCurve {
	TArray<FRichCurveKey> Keys; // 0x70
};

struct FQuartzQuantizationBoundary {
	EQuartzCommandQuantization Quantization; // 0x0
	float Multiplier; // 0x4
	EQuarztQuantizationReference CountingReferencePoint; // 0x8
};

struct FMovieSceneSequenceTransform {
	FMovieSceneTimeTransform LinearTransform; // 0x0
	TArray<FMovieSceneNestedSequenceTransform> NestedTransforms; // 0x10
};

struct FLightmassDirectionalLightSettings {
	float LightSourceAngle; // 0xc
};

struct FFloatRange {
	FFloatRangeBound LowerBound; // 0x0
	FFloatRangeBound UpperBound; // 0x8
};

struct FGlobal_Displacement {
	float SIZEM_15_AC647E804AD8FF66DC479DBEE451B83D; // 0x0
	float OverallLength_16_312D7DB140157D72C96AFF8CF5729D66; // 0x4
	float GlobalAmplitude_17_D915AA5E48130D8B0506EFA66AF77424; // 0x8
	float GlobalSpeed_18_E256D8704B7E9B43D81E2D87CBD65755; // 0xc
	float Choppiness_19_527457804880B58848E3D984BC092996; // 0x10
};

struct FARSessionPayload {
	int32_t ConfigFlags; // 0x0
	UMaterialInterface* DefaultMeshMaterial; // 0x8
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x10
};

struct FStructSerializerArrayTestStruct {
	TArray<int32_t> Int32Array; // 0x0
	TArray<char> ByteArray; // 0x10
	int32_t StaticSingleElement; // 0x20
	int32_t StaticInt32Array[0x3]; // 0x24
	float StaticFloatArray[0x3]; // 0x30
	TArray<FVector> VectorArray; // 0x40
	TArray<FStructSerializerBuiltinTestStruct> StructArray; // 0x50
};

struct FDummySequenceAction {
	int32_t UID; // 0x4
	EDummySequenceAction Action; // 0x8
};

struct FTTTrackId {
	int32_t TrackType; // 0x0
	int32_t TrackIndex; // 0x4
};

struct FSoundWaveSpectralDataEntry {
	float Magnitude; // 0x0
	float NormalizedMagnitude; // 0x4
};

struct FHLODProxyMesh {
	LazyObjectProperty LODActor; // 0x0
	UStaticMesh* StaticMesh; // 0x20
	FName Key; // 0x28
};

struct FUpdateLevelStreamingLevelStatus {
	FName PackageName; // 0x0
	int32_t LODIndex; // 0x8
	char bNewShouldBeLoaded : 1; // 0xc
	char bNewShouldBeVisible : 1; // 0xc
	char bNewShouldBlockOnLoad : 1; // 0xc
};

struct FMetricStat {
	FMetric Metric; // 0x0
	int32_t Period; // 0x30
	FString Stat; // 0x38
	EStandardUnit Unit; // 0x48
};

struct FS_VehicleRepairInfo {
	float VehiclePartItemConsumptionPercent_20_04D0917C44FD9EBDC20DA7BC1452009A; // 0x0
	float VehiclePartMinReduceConditionPercent_13_76DB8975405BC5E3543889BDF7810345; // 0x4
	float VehiclePartMaxReduceConditionPercent_14_3C83B1004839F2F8F9273CAC54383115; // 0x8
	FItemCodeValueArray VehiclePartRepairItem_15_C50AC3A14C7F8F1479CD138EBF44802A; // 0x10
};

struct FS_PlayerSpawnPointInfo {
	FTransform SpawnTransform_3_D3DE3B924C150301F8B2F2A904F5CAA5; // 0x0
	FTransform PODSpawnTransform_5_400BF54A4A1A4D2EA4765581CFF2BF11; // 0x30
};

struct FDebugFloatHistory {
	TArray<float> Samples; // 0x0
	float MaxSamples; // 0x10
	float MinValue; // 0x14
	float MaxValue; // 0x18
	bool bAutoAdjustMinMax; // 0x1c
};

struct FAkAcousticTextureParams {
	FVector4 AbsorptionValues; // 0x0
};

struct FS_EquipmentSlot {
	E_EquipmentCategorys SlotType_2_2D0D817E40287E50E38EE7B14ECDE95C; // 0x0
	FItemInventory EquiptedItem_10_6D9EFF3D4DB598081D034888A775F948; // 0x8
};

struct FS_ItemFloat {
	FDataTableRowHandle Item_7_F0DD473447A366DBB3231CACF3526C7E; // 0x0
	float float_9_863C23A54882FB51047F118EF91DCB8D; // 0x10
};

struct FRenderingPolygonGroup {
	uint32_t RenderingSectionIndex; // 0x0
	int32_t MaterialIndex; // 0x4
	int32_t MaxTriangles; // 0x8
};

struct FAnimCurveBase {
	FName LastObservedName; // 0x0
	FSmartName Name; // 0x8
	int32_t CurveTypeFlags; // 0x14
};

struct FFullyLoadedPackagesInfo {
	EFullyLoadPackageType FullyLoadType; // 0x0
	FString Tag; // 0x8
	TArray<FName> PackagesToLoad; // 0x18
	TArray<UObject*> LoadedObjects; // 0x28
};

struct FAnimNode_SequencePlayer {
	UAnimSequenceBase* Sequence; // 0x38
	float PlayRateBasis; // 0x40
	float PlayRate; // 0x44
	FInputScaleBiasClamp PlayRateScaleBiasClamp; // 0x48
	float StartPosition; // 0x78
	bool bLoopAnimation; // 0x7c
};

struct FMeshSectionInfoMap {
	TMap<uint32_t, FMeshSectionInfo> Map; // 0x0
};

struct FLODSoloTrack {
	TArray<char> SoloEnableSetting; // 0x0
};

struct FAISenseAffiliationFilter {
	char bDetectEnemies : 1; // 0x0
	char bDetectNeutrals : 1; // 0x0
	char bDetectFriendlies : 1; // 0x0
};

struct FRootMotionSourceSettings {
	char Flags; // 0x0
};

struct FPrimaryAssetType {
	FName Name; // 0x0
};

struct FBPInterfaceDescription {
	UInterface* Interface; // 0x0
	TArray<UEdGraph*> Graphs; // 0x8
};

struct FEdGraphPinReference {
	TWeakObjectPtr<UEdGraphNode> OwningNode; // 0x0
	FGuid PinId; // 0x8
};

struct FTimeline {
	ETimelineLengthMode LengthMode; // 0x0
	char bLooping : 1; // 0x1
	char bReversePlayback : 1; // 0x1
	char bPlaying : 1; // 0x1
	float Length; // 0x4
	float PlayRate; // 0x8
	float Position; // 0xc
	TArray<FTimelineEventEntry> Events; // 0x10
	TArray<FTimelineVectorTrack> InterpVectors; // 0x20
	TArray<FTimelineFloatTrack> InterpFloats; // 0x30
	TArray<FTimelineLinearColorTrack> InterpLinearColors; // 0x40
	FDelegate TimelinePostUpdateFunc; // 0x50
	FDelegate TimelineFinishedFunc; // 0x60
	TWeakObjectPtr<UObject> PropertySetObject; // 0x70
	FName DirectionPropertyName; // 0x78
};

struct FMovieSceneObjectPropertyTemplate {
	FMovieSceneObjectPathChannel ObjectChannel; // 0x38
};

struct FBoneMirrorInfo {
	int32_t SourceIndex; // 0x0
	EAxis BoneFlipAxis; // 0x4
};

struct FStartQueryResult {
	FString QueryID; // 0x0
};

struct FMovieSceneFloatValueSerializationHelper {
	float Value; // 0x0
	ERichCurveInterpMode InterpMode; // 0x4
	ERichCurveTangentMode TangentMode; // 0x5
	FMovieSceneTangentDataSerializationHelper Tangent; // 0x8
};

struct FSubjectMetadata {
	TMap<FName, FString> StringMetadata; // 0x0
	FTimecode SceneTimecode; // 0x50
	FFrameRate SceneFramerate; // 0x64
};

struct FCustomOutput {
	FName OutputName; // 0x0
	ECustomMaterialOutputType OutputType; // 0x8
};

struct FVertexAttributesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FMeshElementAttributeList> PerimeterVertexAttributeLists; // 0x8
	TArray<FVertexAttributesForPolygonHole> VertexAttributeListsForEachHole; // 0x18
};

struct FGetLogRecordResult {
	TMap<FString, FString> LogRecord; // 0x0
};

struct FWeaponHitSetting {
	UPhysicalMaterial* PhysMaterial; // 0x0
	UParticleSystem* HitFx; // 0x8
	AHitHapticEffectBase* HitHapticEffectClass; // 0x10
	USoundBase* HitSound; // 0x18
	UMaterialInterface* DecalMaterial; // 0x20
	float DecalSize; // 0x28
	float DecalLifeSpan; // 0x2c
};

struct FMovieSceneSequencePlaybackSettings {
	char bAutoPlay : 1; // 0x0
	FMovieSceneSequenceLoopCount LoopCount; // 0x4
	float PlayRate; // 0x8
	float StartTime; // 0xc
	char bRandomStartTime : 1; // 0x10
	char bRestoreState : 1; // 0x10
	char bDisableMovementInput : 1; // 0x10
	char bDisableLookAtInput : 1; // 0x10
	char bHidePlayer : 1; // 0x10
	char bHideHud : 1; // 0x10
	char bDisableCameraCuts : 1; // 0x10
	char bPauseAtEnd : 1; // 0x10
};

struct FSynth2DSliderStyle {
	FSlateBrush NormalThumbImage; // 0x8
	FSlateBrush DisabledThumbImage; // 0x90
	FSlateBrush NormalBarImage; // 0x118
	FSlateBrush DisabledBarImage; // 0x1a0
	FSlateBrush BackgroundImage; // 0x228
	float BarThickness; // 0x2b0
};

struct FNiagaraBoundParameter {
	FNiagaraVariable Parameter; // 0x0
	int32_t SrcOffset; // 0x20
	int32_t DestOffset; // 0x24
};

struct FMeshUVChannelInfo {
	bool bInitialized; // 0x0
	bool bOverrideDensities; // 0x1
	float LocalUVDensities[0x4]; // 0x4
};

struct FInterpCurveFloat {
	TArray<FInterpCurvePointFloat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FInputRange {
	float Min; // 0x0
	float Max; // 0x4
};

struct FChangeVertexInstancesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FVertexIndexAndInstanceID> PerimeterVertexIndicesAndInstanceIDs; // 0x8
	TArray<FVertexInstancesForPolygonHole> VertexIndicesAndInstanceIDsForEachHole; // 0x18
};

struct FAkChannelMask {
	int32_t ChannelMask; // 0x0
};

struct FAnimNode_DragonAimSolver {
	FBoneReference EndSplineBone; // 0xc8
	FBoneReference StartSplineBone; // 0xd8
	FTransform LookAtLocation; // 0xf0
	FDragonData_MultiInput dragon_input_data; // 0x120
	TArray<FDragonData_ArmsData> Aiming_Hand_Limbs; // 0x1c8
	FDragonData_Overrided_Location_Data Arm_TargetLocation_Overrides; // 0x1d8
	bool Use_Separate_Targets; // 0x1e8
	bool Override_Hand_Rotation; // 0x1e9
	bool reach_instead; // 0x1ea
	bool Aggregate_Hand_Body; // 0x1eb
	int32_t Main_Arm_Index; // 0x1ec
	float Lookat_Radius; // 0x280
	float Lookat_Clamp; // 0x284
	float Limbs_Clamp; // 0x288
	float Downward_Dip_Multiplier; // 0x28c
	float Side_Move_Multiplier; // 0x290
	float Side_Down_Multiplier; // 0x294
	float Up_Rot_Clamp; // 0x298
	FVector2D Verticle_Range_Angles; // 0x29c
	FVector2D Horizontal_Range_Angles; // 0x2a4
	FRuntimeFloatCurve Look_Bending_Curve; // 0x2b0
	FRuntimeFloatCurve Look_Multiplier_Curve; // 0x338
	bool Lock_Legs; // 0x3c0
	bool ignore_elbow_modification; // 0x3c1
	bool ignore_separate_hand_solving; // 0x3c2
	bool Use_Natural_Method; // 0x3c3
	bool Head_Use_Separate_Clamp; // 0x3c4
	bool automatic_leg_make; // 0x3c5
	bool enable_solver; // 0x3c7
	bool Work_Outside_PIE; // 0x3c8
	EInterpoLocation_Type_Plugin loc_interp_type; // 0x3c9
	float Interpolation_Speed; // 0x3cc
	float Toggle_Interpolation_Speed; // 0x3d0
	FVector LookAt_Axis; // 0x428
	FVector TargetOffset; // 0x470
	FTransform Debug_LookAtLocation; // 0x500
};

struct FSKeyConflict {
	UBP_KeyCombination_C* ConflictingCombination_12_3DB110B5406338347E3A6897032E00F8; // 0x0
	EKeyConflict ConflictType_7_4EB561DE4E1187B4D868FAB6B58BCAE3; // 0x8
};

struct FRawCurveTracks {
	TArray<FFloatCurve> FloatCurves; // 0x0
};

struct FPutDashboardRequest {
	FString DashboardName; // 0x0
	FString DashboardBody; // 0x10
};

struct FDatasmithAssetImportOptions {
	FName PackagePath; // 0x0
};

struct FNiagaraVariableLayoutInfo {
	uint32_t FloatComponentStart; // 0x0
	uint32_t Int32ComponentStart; // 0x4
	uint32_t HalfComponentStart; // 0x8
	FNiagaraTypeLayoutInfo LayoutInfo; // 0x10
};

struct FMailDataArray {
	TArray<FMailData> MailDataArray; // 0x0
};

struct FDatasmithCameraLensSettingsTemplate {
	float MaxFStop; // 0x0
};

struct FRootMotionFinishVelocitySettings {
	ERootMotionFinishVelocityMode Mode; // 0x0
	FVector SetVelocity; // 0x4
	float ClampVelocity; // 0x10
};

struct FNiagaraScriptExecutionParameterStore {
	int32_t ParameterSize; // 0x78
	uint32_t PaddedParameterSize; // 0x7c
	TArray<FNiagaraScriptExecutionPaddingInfo> PaddingInfo; // 0x80
	char bInitialized : 1; // 0x90
};

struct FInputAxisStruct {
	FString AxisName; // 0x0
	FString KeyAsString; // 0x10
	FKey Key; // 0x20
	float Scale; // 0x38
};

struct FMeshElementAttributeList {
	TArray<FMeshElementAttributeData> Attributes; // 0x0
};

struct FNiagaraMaterialOverride {
	UMaterialInterface* Material; // 0x0
	uint32_t MaterialSubIndex; // 0x8
	UNiagaraRendererProperties* EmitterRendererProperty; // 0x10
};

struct FCanvasIcon {
	UTexture* Texture; // 0x0
	float U; // 0x8
	float V; // 0xc
	float UL; // 0x10
	float VL; // 0x14
};

struct FItemPreviewDetails {
	FString urlOrVideoId; // 0x0
	FString originalFileName; // 0x10
	EItemPreviewTypeBP itemType; // 0x20
};

struct FResponseChannel {
	FName Channel; // 0x0
	ECollisionResponse Response; // 0x8
};

struct FMagicLeapLightEstimationAmbientGlobalState {
	TArray<float> AmbientIntensityNits; // 0x0
	FTimespan Timestamp; // 0x10
};

struct FRootMotionSource_MoveToDynamicForce {
	FVector StartLocation; // 0x98
	FVector InitialTargetLocation; // 0xa4
	FVector TargetLocation; // 0xb0
	bool bRestrictSpeedToExpected; // 0xbc
	UCurveVector* PathOffsetCurve; // 0xc0
	UCurveFloat* TimeMappingCurve; // 0xc8
};

struct FClothConstraintSetupNv {
	float Stiffness; // 0x0
	float StiffnessMultiplier; // 0x4
	float StretchLimit; // 0x8
	float CompressionLimit; // 0xc
};

struct FAINoiseEvent {
	FVector NoiseLocation; // 0x4
	float Loudness; // 0x10
	float MaxRange; // 0x14
	AActor* Instigator; // 0x18
	FName Tag; // 0x20
};

struct FSupplyDropInfo {
	FVector StartLocation; // 0x0
	FVector DropLocation; // 0xc
	float DropTime; // 0x18
};

struct FVertexPair {
	FVertexID VertexID0; // 0x0
	FVertexID VertexID1; // 0x4
};

struct FDestructibleParametersFlag {
	char bAccumulateDamage : 1; // 0x0
	char bAssetDefinedSupport : 1; // 0x0
	char bWorldSupport : 1; // 0x0
	char bDebrisTimeout : 1; // 0x0
	char bDebrisMaxSeparation : 1; // 0x0
	char bCrumbleSmallestChunks : 1; // 0x0
	char bAccurateRaycasts : 1; // 0x0
	char bUseValidBounds : 1; // 0x0
	char bFormExtendedStructures : 1; // 0x1
};

struct FPreviewMeshCollectionEntry {
	TSoftObjectPtr<USkeletalMesh> SkeletalMesh; // 0x0
};

struct FS_BuildSpawingMaterialData {
	FString ObjectName_2_8C374AC64F1F3504882515A8D1C3A767; // 0x0
	TArray<UMaterialInstance*> Materials_8_C55EE82C4894DB5BC37483AD349794F2; // 0x10
	float PlayTime_13_73C3A7F5475B4FC3654195971A7CFF89; // 0x20
	UCurveFloat* AmountCurve_16_314A5A72476A2D149C3D008707554413; // 0x28
};

struct FAnimNode_PoseDriver {
	FPoseLink SourcePose; // 0x80
	TArray<FBoneReference> SourceBones; // 0x90
	TArray<FBoneReference> OnlyDriveBones; // 0xa0
	TArray<FPoseDriverTarget> PoseTargets; // 0xb0
	FBoneReference EvalSpaceBone; // 0xf0
	FRBFParams RBFParams; // 0x100
	EPoseDriverSource DriveSource; // 0x12c
	EPoseDriverOutput DriveOutput; // 0x12d
	char bOnlyDriveSelectedBones : 1; // 0x12e
	int32_t LODThreshold; // 0x130
};

struct FBrushEffectSmoothBlending {
	float InnerSmoothDistance; // 0x0
	float OuterSmoothDistance; // 0x4
};

struct FDialogueContextMapping {
	FDialogueContext Context; // 0x0
	USoundWave* SoundWave; // 0x18
	FString LocalizationKeyFormat; // 0x20
	UDialogueSoundWaveProxy* Proxy; // 0x30
};

struct FBasedPosition {
	AActor* Base; // 0x0
	FVector Position; // 0x8
	FVector CachedBaseLocation; // 0x14
	FRotator CachedBaseRotation; // 0x20
	FVector CachedTransPosition; // 0x2c
};

struct FAngularDriveConstraint {
	FConstraintDrive TwistDrive; // 0x0
	FConstraintDrive SwingDrive; // 0x10
	FConstraintDrive SlerpDrive; // 0x20
	FRotator OrientationTarget; // 0x30
	FVector AngularVelocityTarget; // 0x3c
	EAngularDriveMode AngularDriveMode; // 0x48
};

struct FBlueprintInputDelegateBinding {
	char bConsumeInput : 1; // 0x0
	char bExecuteWhenPaused : 1; // 0x0
	char bOverrideParentBinding : 1; // 0x0
};

struct FDashboardEntry {
	FString DashboardName; // 0x0
	FString DashboardArn; // 0x10
	FDateTime LastModified; // 0x20
	float Size; // 0x28
};

struct FMagicLeapTouchpadGesture {
	EControllerHand hand; // 0x0
	FName MotionSource; // 0x4
	EMagicLeapTouchpadGestureType Type; // 0xc
	EMagicLeapTouchpadGestureDirection Direction; // 0xd
	FVector PositionAndForce; // 0x10
	float Speed; // 0x1c
	float Distance; // 0x20
	float FingerGap; // 0x24
	float Radius; // 0x28
	float Angle; // 0x2c
};

struct FChunkPartData {
	FGuid Guid; // 0x0
	uint32_t Offset; // 0x10
	uint32_t Size; // 0x14
};

struct FDistance_Field {
	float ModifiedHeight_39_AC647E804AD8FF66DC479DBEE451B83D; // 0x0
	float MeasureHeight_40_312D7DB140157D72C96AFF8CF5729D66; // 0x4
	float Invested_41_D915AA5E48130D8B0506EFA66AF77424; // 0x8
	float WaveTime_44_4D07E26B418E2200A6F8F8B3828E51EE; // 0xc
};

struct FVariantDependency {
	TSoftObjectPtr<UVariantSet> VariantSet; // 0x0
	TSoftObjectPtr<UVariant> Variant; // 0x28
	bool bEnabled; // 0x50
};

struct FSoundWaveSpectralTimeData {
	TArray<FSoundWaveSpectralDataEntry> Data; // 0x0
	float TimeSec; // 0x10
};

struct FLightmassPrimitiveSettings {
	char bUseTwoSidedLighting : 1; // 0x0
	char bShadowIndirectOnly : 1; // 0x0
	char bUseEmissiveForStaticLighting : 1; // 0x0
	char bUseVertexNormalForHemisphereGather : 1; // 0x0
	float EmissiveLightFalloffExponent; // 0x4
	float EmissiveLightExplicitInfluenceRadius; // 0x8
	float EmissiveBoost; // 0xc
	float DiffuseBoost; // 0x10
	float FullyOccludedSamplesFraction; // 0x14
};

struct FActorPerceptionUpdateInfo {
	int32_t TargetId; // 0x0
	TWeakObjectPtr<AActor> Target; // 0x4
	FAIStimulus Stimulus; // 0xc
};

struct FEnvDirection {
	UEnvQueryContext* LineFrom; // 0x0
	UEnvQueryContext* LineTo; // 0x8
	UEnvQueryContext* Rotation; // 0x10
	EEnvDirection DirMode; // 0x18
};

struct FGetUserVoteOnWorkshopItemResult {
	EVoteType userVoteType; // 0x10
};

struct FNamedCurveValue {
	FName Name; // 0x0
	float Value; // 0x8
};

struct FInputAxisProperties {
	float DeadZone; // 0x0
	float Sensitivity; // 0x4
	float Exponent; // 0x8
	char bInvert : 1; // 0xc
};

struct FAudioEQEffect {
	float FrequencyCenter0; // 0x10
	float Gain0; // 0x14
	float Bandwidth0; // 0x18
	float FrequencyCenter1; // 0x1c
	float Gain1; // 0x20
	float Bandwidth1; // 0x24
	float FrequencyCenter2; // 0x28
	float Gain2; // 0x2c
	float Bandwidth2; // 0x30
	float FrequencyCenter3; // 0x34
	float Gain3; // 0x38
	float Bandwidth3; // 0x3c
};

struct FNiagaraVariableAttributeBinding {
	FNiagaraVariableBase ParamMapVariable; // 0x0
	FNiagaraVariable DataSetVariable; // 0x10
	FNiagaraVariable RootVariable; // 0x30
	ENiagaraBindingSource BindingSourceMode; // 0x50
	char bBindingExistsOnSource : 1; // 0x54
	char bIsCachedParticleValue : 1; // 0x54
};

struct FCollisionResponseTemplate {
	FName Name; // 0x0
	ECollisionEnabled CollisionEnabled; // 0x8
	bool bCanModify; // 0xa
	FName ObjectTypeName; // 0x2c
	TArray<FResponseChannel> CustomResponses; // 0x38
};

struct FBakedStringCustomAttribute {
	FName AttributeName; // 0x0
	FStringCurve StringCurve; // 0x8
};

struct FSubmixEffectDynamicProcessorFilterSettings {
	char bEnabled : 1; // 0x0
	float Cutoff; // 0x4
	float GainDb; // 0x8
};

struct FGeneratedTexture {
	int32_t ID; // 0x0
	FString Name; // 0x8
	UTexture2D* Texture; // 0x18
};

struct FBatchResultErrorEntry {
	FString ID; // 0x0
	bool bSenderFault; // 0x10
	FString Code; // 0x18
	FString Message; // 0x28
};

struct FGetLogEventsResult {
	TArray<FOutputLogEvent> Events; // 0x0
	FString NextForwardToken; // 0x10
	FString NextBackwardToken; // 0x20
};

struct FBPVariableDescription {
	FName VarName; // 0x0
	FGuid VarGuid; // 0x8
	FEdGraphPinType VarType; // 0x18
	FString FriendlyName; // 0x70
	FText Category; // 0x80
	uint64_t PropertyFlags; // 0x98
	FName RepNotifyFunc; // 0xa0
	ELifetimeCondition ReplicationCondition; // 0xa8
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xb0
	FString DefaultValue; // 0xc0
};

struct FPOV {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x18
};

struct FAkHololensAdvancedInitializationSettings {
	bool UseHeadMountedDisplayAudioDevice; // 0x30
};

struct FJoiningTeamInfo {
	ASurvivalPlayerState* Applicant_PS; // 0x0
	FString JoiningTeam_ID; // 0x8
};

struct FBehaviorTreeTemplateInfo {
	UBehaviorTree* Asset; // 0x0
	UBTCompositeNode* Template; // 0x8
};

struct FStructSerializerTestStruct {
	FStructSerializerNumericTestStruct Numerics; // 0x0
	FStructSerializerBooleanTestStruct Booleans; // 0x30
	FStructSerializerObjectTestStruct Objects; // 0x38
	FStructSerializerBuiltinTestStruct Builtins; // 0xe0
	FStructSerializerArrayTestStruct Arrays; // 0x170
	FStructSerializerMapTestStruct Maps; // 0x1d0
	FStructSerializerSetTestStruct Sets; // 0x310
};

struct FSpriteGeometryCollection {
	TArray<FSpriteGeometryShape> Shapes; // 0x0
	ESpritePolygonMode GeometryType; // 0x10
	int32_t PixelsPerSubdivisionX; // 0x14
	int32_t PixelsPerSubdivisionY; // 0x18
	bool bAvoidVertexMerging; // 0x1c
	float AlphaThreshold; // 0x20
	float DetailAmount; // 0x24
	float SimplifyEpsilon; // 0x28
};

struct FS_ConditionParam {
	TArray<AActor*> ActorClassParam_11_4FB02E8B4D1AAC67D233D0B5F73992A0; // 0x0
	TArray<int32_t> IntParam_12_416B48EF46D072253CDC2D9FBD7D2E5F; // 0x10
	TArray<float> FloatParam_13_2522662E44714ED4C246909B749C15D2; // 0x20
	TArray<bool> BoolParam_14_F9B560B548ED0C387A4CCAA929988730; // 0x30
	TArray<FString> StringParam_15_C82B245944B676C6DBE18098D18B1068; // 0x40
	TArray<UAnimMontage*> AnimParam_19_5371009E40D92D4B707ED194FBB49156; // 0x50
	TArray<FVector> VectorParam_23_A4416A944F08E7F1C14523B854B47385; // 0x60
};

struct FGameplayTagContainer {
	TArray<FGameplayTag> GameplayTags; // 0x0
	TArray<FGameplayTag> ParentTags; // 0x10
};

struct FLoadingWidgetSettings {
	ELoadingIconType LoadingIconType; // 0x0
	ELoadingWidgetType LoadingWidgetType; // 0x1
	FVector2D TransformTranslation; // 0x4
	FVector2D TransformScale; // 0xc
	FVector2D TransformPivot; // 0x14
	FText LoadingText; // 0x20
	bool bLoadingTextRightPosition; // 0x38
	bool bLoadingTextTopPosition; // 0x39
	FTextAppearance Appearance; // 0x40
	FThrobberSettings ThrobberSettings; // 0xe0
	FCircularThrobberSettings CircularThrobberSettings; // 0x170
	FImageSequenceSettings ImageSequenceSettings; // 0x208
	FWidgetAlignment TextAlignment; // 0x228
	FWidgetAlignment LoadingIconAlignment; // 0x22a
	float Space; // 0x22c
	bool bHideLoadingWidgetWhenCompletes; // 0x230
};

struct FMaterialEditorPromotionSettings {
	FFilePath DefaultMaterialAsset; // 0x0
	FFilePath DefaultDiffuseTexture; // 0x10
	FFilePath DefaultNormalTexture; // 0x20
};

struct FNiagaraTypeDefinition {
	UObject* ClassStructOrEnum; // 0x0
	uint16_t UnderlyingType; // 0x8
};

struct FConstraintOffset {
	FVector Translation; // 0x0
	FQuat Rotation; // 0x10
	FVector Scale; // 0x20
	FTransform Parent; // 0x30
};

struct FMovieSceneEvaluationTemplate {
	TMap<FMovieSceneTrackIdentifier, FMovieSceneEvaluationTrack> Tracks; // 0x0
	FGuid SequenceSignature; // 0xa0
	FMovieSceneEvaluationTemplateSerialNumber TemplateSerialNumber; // 0xb0
	FMovieSceneTemplateGenerationLedger TemplateLedger; // 0xb8
};

struct FDatasmithMeshBuildSettingsTemplate {
	char bUseMikkTSpace : 1; // 0x0
	char bRecomputeNormals : 1; // 0x0
	char bRecomputeTangents : 1; // 0x0
	char bRemoveDegenerates : 1; // 0x0
	char bBuildAdjacencyBuffer : 1; // 0x0
	char bUseHighPrecisionTangentBasis : 1; // 0x0
	char bUseFullPrecisionUVs : 1; // 0x0
	char bGenerateLightmapUVs : 1; // 0x0
	int32_t MinLightmapResolution; // 0x4
	int32_t SrcLightmapIndex; // 0x8
	int32_t DstLightmapIndex; // 0xc
};

struct FAnimControlTrackKey {
	float StartTime; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	float AnimStartOffset; // 0x10
	float AnimEndOffset; // 0x14
	float AnimPlayRate; // 0x18
	char bLooping : 1; // 0x1c
	char bReverse : 1; // 0x1c
};

struct FSimulationStageMetaData {
	FName SimulationStageName; // 0x0
	FName IterationSource; // 0x8
	char bSpawnOnly : 1; // 0x10
	char bWritesParticles : 1; // 0x10
	char bPartialParticleUpdate : 1; // 0x10
	TArray<FName> OutputDestinations; // 0x18
	int32_t MinStage; // 0x28
	int32_t MaxStage; // 0x2c
};

struct FDescribeLogGroupsRequest {
	FString LogGroupNamePrefix; // 0x0
	FString NextToken; // 0x10
	int32_t Limit; // 0x20
};

struct FPaperTileMetadata {
	FName UserDataName; // 0x0
	FSpriteGeometryCollection CollisionData; // 0x8
	char TerrainMembership[0x4]; // 0x38
};

struct FMovieSceneSequenceHierarchyNode {
	FMovieSceneSequenceID ParentID; // 0x0
	TArray<FMovieSceneSequenceID> Children; // 0x8
};

struct FPutDashboardResult {
	TArray<FDashboardValidationMessage> DashboardValidationMessages; // 0x0
	FResponseMetadata ResponseMetadata; // 0x10
};

struct FAnimationEventBinding {
	UWidgetAnimation* Animation; // 0x0
	FDelegate Delegate; // 0x8
	EWidgetAnimationEvent AnimationEvent; // 0x18
	FName UserTag; // 0x1c
};

struct FBaseOffset {
	float  mplitude__8_AC647E804AD8FF66DC479DBEE451B83; // 0x0
	float  teepness__4_312D7DB140157D72C96AFF8CF5729D6; // 0x4
	float  peed__6_D915AA5E48130D8B0506EFA66AF7742; // 0x8
	float  avelength__2_E256D8704B7E9B43D81E2D87CBD6575; // 0xc
	float  irection__10_527457804880B58848E3D984BC09299; // 0x10
	float  irection_Offset__12_613597B0430EAC9C51B086ACB9E783B; // 0x14
	float  irection_Offset_2_14_ABE7C3F84BAF097CD7A607A660323B3; // 0x18
};

struct FS_SaveWeaponInvs {
	int32_t Index_7_3101E7784A015FF148022B8E5D3C56FF; // 0x0
	int32_t Ammo_8_446265654D491697A53F1B88C44FE418; // 0x4
	TArray<FAttachmentSlot> AttachmentsIDS_18_73AD89B4445A9723BF0744ACC232C5CA; // 0x8
};

struct FClothCollisionPrim_SphereConnection {
	int32_t SphereIndices[0x2]; // 0x0
};

struct FChaosSolverConfiguration {
	int32_t Iterations; // 0x0
	int32_t CollisionPairIterations; // 0x4
	int32_t PushOutIterations; // 0x8
	int32_t CollisionPushOutPairIterations; // 0xc
	float CollisionMarginFraction; // 0x10
	float CollisionMarginMax; // 0x14
	float CollisionCullDistance; // 0x18
	int32_t JointPairIterations; // 0x1c
	int32_t JointPushOutPairIterations; // 0x20
	float ClusterConnectionFactor; // 0x24
	EClusterUnionMethod ClusterUnionConnectionType; // 0x28
	bool bGenerateCollisionData; // 0x29
	FSolverCollisionFilterSettings CollisionFilterSettings; // 0x2c
	bool bGenerateBreakData; // 0x3c
	FSolverBreakingFilterSettings BreakingFilterSettings; // 0x40
	bool bGenerateTrailingData; // 0x50
	FSolverTrailingFilterSettings TrailingFilterSettings; // 0x54
	bool bGenerateContactGraph; // 0x64
};

struct FBlendSample {
	UAnimSequence* Animation; // 0x0
	FVector SampleValue; // 0x8
	float RateScale; // 0x14
};

struct FGPUSpriteLocalVectorFieldInfo {
	UVectorField* Field; // 0x0
	FTransform Transform; // 0x10
	FRotator MinInitialRotation; // 0x40
	FRotator MaxInitialRotation; // 0x4c
	FRotator RotationRate; // 0x58
	float Intensity; // 0x64
	float Tightness; // 0x68
	char bIgnoreComponentTransform : 1; // 0x6c
	char bTileX : 1; // 0x6c
	char bTileY : 1; // 0x6c
	char bTileZ : 1; // 0x6c
	char bUseFixDT : 1; // 0x6c
};

struct FSoundWaveEnvelopeTimeData {
	float Amplitude; // 0x0
	float TimeSec; // 0x4
};

struct FLightingChannels {
	char bChannel0 : 1; // 0x0
	char bChannel1 : 1; // 0x0
	char bChannel2 : 1; // 0x0
};

struct FLensSettings {
	FLensBloomSettings Bloom; // 0x0
	FLensImperfectionSettings Imperfections; // 0xb8
	float ChromaticAberration; // 0xd8
};

struct FNiagaraCompileHash {
	TArray<char> DataHash; // 0x0
};

struct FSteamUGCQueryParameterDetails {
	FSteamUGCQueryParameterTagsAllUserDetails tagParameter; // 0x18
	TArray<FSteamUGCItemId> workshopItemIds; // 0x28
};

struct FMovieSceneNiagaraIntegerParameterSectionTemplate {
	FMovieSceneIntegerChannel IntegerChannel; // 0x40
};

struct FFilmStockSettings {
	float Slope; // 0x0
	float Toe; // 0x4
	float Shoulder; // 0x8
	float BlackClip; // 0xc
	float WhiteClip; // 0x10
};

struct FDescribeQueryDefinitionsRequest {
	FString QueryDefinitionNamePrefix; // 0x0
	int32_t MaxResults; // 0x10
	FString NextToken; // 0x18
};

struct FUntagResourceRequestCloudWatch {
	FString ResourceARN; // 0x0
	TArray<FString> TagKeys; // 0x10
};

struct FRadialBoxSettings {
	bool bDistributeItemsEvenly; // 0x0
	float AngleBetweenItems; // 0x4
	float StartingAngle; // 0x8
};

struct FSlateMeshVertex {
	FVector2D Position; // 0x0
	FColor Color; // 0x8
	FVector2D UV0; // 0xc
	FVector2D UV1; // 0x14
	FVector2D UV2; // 0x1c
	FVector2D UV3; // 0x24
	FVector2D UV4; // 0x2c
	FVector2D UV5; // 0x34
};

struct FCharacterDamageSetting {
	float MinDamage; // 0x0
	USoundBase* DamageSound; // 0x8
};

struct FGatherLogCachedData {
	TMap<int32_t, int32_t> ObtainItem; // 0x0
	FString UserNickname; // 0x50
};

struct FColorParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel RedCurve; // 0x8
	FMovieSceneFloatChannel GreenCurve; // 0xa8
	FMovieSceneFloatChannel BlueCurve; // 0x148
	FMovieSceneFloatChannel AlphaCurve; // 0x1e8
};

struct FMediaCaptureDevice {
	FText DisplayName; // 0x0
	FString URL; // 0x18
};

struct FDeleteAnomalyDetectorResult {
	FResponseMetadata ResponseMetadata; // 0x0
};

struct FNiagaraPlatformSetCVarCondition {
	FName CVarName; // 0x0
	bool Value; // 0x8
	int32_t MinInt; // 0xc
	int32_t MaxInt; // 0x10
	float MinFloat; // 0x14
	float MaxFloat; // 0x18
	char bUseMinInt : 1; // 0x1c
	char bUseMaxInt : 1; // 0x1c
	char bUseMinFloat : 1; // 0x1c
	char bUseMaxFloat : 1; // 0x1c
};

struct FMovieSceneEventSectionTemplate {
	FMovieSceneEventSectionData EventData; // 0x20
	char bFireEventsWhenForwards : 1; // 0xa8
	char bFireEventsWhenBackwards : 1; // 0xa8
};

struct FRichTextStyleRow {
	FTextBlockStyle TextStyle; // 0x8
};

struct FAnimNode_ModifyBone {
	FBoneReference BoneToModify; // 0xc8
	FVector Translation; // 0xd8
	FRotator Rotation; // 0xe4
	FVector Scale; // 0xf0
	EBoneModificationMode TranslationMode; // 0xfc
	EBoneModificationMode RotationMode; // 0xfd
	EBoneModificationMode ScaleMode; // 0xfe
	EBoneControlSpace TranslationSpace; // 0xff
	EBoneControlSpace RotationSpace; // 0x100
	EBoneControlSpace ScaleSpace; // 0x101
};

struct FParticleEvent_GenerateInfo {
	EParticleEventType Type; // 0x0
	int32_t Frequency; // 0x4
	int32_t ParticleFrequency; // 0x8
	char FirstTimeOnly : 1; // 0xc
	char LastTimeOnly : 1; // 0xc
	char UseReflectedImpactVector : 1; // 0xc
	char bUseOrbitOffset : 1; // 0xc
	FName CustomName; // 0x10
	TArray<UParticleModuleEventSendToGame*> ParticleModuleEventsToSendToGame; // 0x18
};

struct FS_IndicatorInfos {
	TMap<UBP_WidgetIndicatorComponent_C*, bool> Indicators_15_D4B17CCA47D9A445F669F78E84989D2F; // 0x0
};

struct FNiagaraEmitterHandle {
	FGuid ID; // 0x0
	FName IdName; // 0x10
	bool bIsEnabled; // 0x18
	FName Name; // 0x1c
	UNiagaraEmitter* Instance; // 0x28
};

struct FMutableModelParameterValue {
	FString Name; // 0x0
	int32_t Value; // 0x10
};

struct FDeleteInsightRulesRequest {
	TArray<FString> RuleNames; // 0x0
};

struct FUInt64 {
	uint64_t Value; // 0x0
};

struct FBPVariableMetaDataEntry {
	FName DataKey; // 0x0
	FString DataValue; // 0x8
};

struct FMovieSceneSequenceReplProperties {
	FFrameTime LastKnownPosition; // 0x0
	EMovieScenePlayerStatus LastKnownStatus; // 0x8
	int32_t LastKnownNumLoops; // 0xc
};

struct FBuildPromotionImportWorkflowSettings {
	FEditorImportWorkflowDefinition Diffuse; // 0x0
	FEditorImportWorkflowDefinition Normal; // 0x20
	FEditorImportWorkflowDefinition StaticMesh; // 0x40
	FEditorImportWorkflowDefinition ReimportStaticMesh; // 0x60
	FEditorImportWorkflowDefinition BlendShapeMesh; // 0x80
	FEditorImportWorkflowDefinition MorphMesh; // 0xa0
	FEditorImportWorkflowDefinition SkeletalMesh; // 0xc0
	FEditorImportWorkflowDefinition Animation; // 0xe0
	FEditorImportWorkflowDefinition Sound; // 0x100
	FEditorImportWorkflowDefinition SurroundSound; // 0x120
	TArray<FEditorImportWorkflowDefinition> OtherAssetsToImport; // 0x140
};

struct FStructRedirect {
	FName OldStructName; // 0x0
	FName NewStructName; // 0x8
};

struct FBPFriendPresenceInfo {
	bool bIsOnline; // 0x0
	bool bIsPlaying; // 0x1
	bool bIsPlayingThisGame; // 0x2
	bool bIsJoinable; // 0x3
	bool bHasVoiceSupport; // 0x4
	EBPOnlinePresenceState PresenceState; // 0x5
	FString StatusString; // 0x8
};

struct FDedicateServerTerminate {
	FString reason; // 0x0
	FString SenderIP; // 0x10
};

struct FRigidBodyContactInfo {
	FVector ContactPosition; // 0x0
	FVector ContactNormal; // 0xc
	float ContactPenetration; // 0x18
	UPhysicalMaterial* PhysMaterial[0x2]; // 0x20
};

struct FAnimBlueprintFunction {
	FName Name; // 0x0
	FName Group; // 0x8
	int32_t OutputPoseNodeIndex; // 0x10
	TArray<FName> InputPoseNames; // 0x18
	TArray<int32_t> InputPoseNodeIndices; // 0x28
	bool bImplemented; // 0x60
};

struct FNavCollisionCylinder {
	FVector Offset; // 0x0
	float Radius; // 0xc
	float Height; // 0x10
};

struct FSplineIKCachedBoneData {
	FBoneReference Bone; // 0x0
	int32_t RefSkeletonIndex; // 0x10
};

struct FAnimNode_RandomPlayer {
	TArray<FRandomPlayerSequenceEntry> Entries; // 0x10
	bool bShuffleMode; // 0x70
};

struct FPolygonGroupForPolygon {
	FPolygonID PolygonID; // 0x0
	FPolygonGroupID PolygonGroupID; // 0x4
};

struct FComponentKey {
	UObject* OwnerClass; // 0x0
	FName SCSVariableName; // 0x8
	FGuid AssociatedGuid; // 0x10
};

struct FAnimNode_BlendListByBool {
	bool bActiveValue; // 0x98
};

struct FDescribeAlarmsForMetricRequest {
	FString MetricName; // 0x0
	FString Namespace; // 0x10
	EStatistic Statistic; // 0x20
	FString ExtendedStatistic; // 0x28
	TArray<FDimension> Dimensions; // 0x38
	int32_t Period; // 0x48
	EStandardUnit Unit; // 0x4c
};

struct FLocationServicesData {
	float Timestamp; // 0x0
	float Longitude; // 0x4
	float Latitude; // 0x8
	float HorizontalAccuracy; // 0xc
	float VerticalAccuracy; // 0x10
	float Altitude; // 0x14
};

struct FSubmixEffectEQBand {
	float Frequency; // 0x0
	float Bandwidth; // 0x4
	float GainDb; // 0x8
	char bEnabled : 1; // 0xc
};

struct FRotator {
	float Pitch; // 0x0
	float Yaw; // 0x4
	float Roll; // 0x8
};

struct FNiagaraVMExecutableData {
	TArray<char> ByteCode; // 0x0
	TArray<char> OptimizedByteCode; // 0x10
	int32_t NumTempRegisters; // 0x20
	int32_t NumUserPtrs; // 0x24
	TArray<char> ScriptLiterals; // 0x28
	TArray<FNiagaraVariable> Attributes; // 0x38
	FNiagaraScriptDataUsageInfo DataUsage; // 0x48
	TArray<FNiagaraScriptDataInterfaceCompileInfo> DataInterfaceInfo; // 0x50
	TArray<FVMExternalFunctionBindingInfo> CalledVMExternalFunctions; // 0x60
	TArray<FNiagaraDataSetID> ReadDataSets; // 0x80
	TArray<FNiagaraDataSetProperties> WriteDataSets; // 0x90
	TArray<FNiagaraStatScope> StatScopes; // 0xa0
	TArray<FNiagaraDataInterfaceGPUParamInfo> DIParamInfo; // 0xb0
	ENiagaraScriptCompileStatus LastCompileStatus; // 0xc0
	TArray<FSimulationStageMetaData> SimulationStageMetaData; // 0xc8
	char bReadsSignificanceIndex : 1; // 0xd8
};

struct FMetricFilter {
	FString FilterName; // 0x0
	FString FilterPattern; // 0x10
	TArray<FMetricTransformation> MetricTransformations; // 0x20
	FString CreationTime; // 0x30
	FString LogGroupName; // 0x40
};

struct FPerPlatformFloat {
	float Default; // 0x0
};

struct FProcMeshSection {
	TArray<FProcMeshVertex> ProcVertexBuffer; // 0x0
	TArray<uint32_t> ProcIndexBuffer; // 0x10
	FBox SectionLocalBox; // 0x20
	bool bEnableCollision; // 0x3c
	bool bSectionVisible; // 0x3d
};

struct FCenterLayoutSettings {
	bool bIsTipAtBottom; // 0x0
	FWidgetAlignment TipAlignment; // 0x1
	EHorizontalAlignment BorderHorizontalAlignment; // 0x3
	float BorderVerticalOffset; // 0x4
	FMargin BorderPadding; // 0x8
	FSlateBrush BorderBackground; // 0x18
};

struct FAnimNode_TwoBoneIK {
	FBoneReference IKBone; // 0xc8
	float StartStretchRatio; // 0xd8
	float MaxStretchScale; // 0xdc
	FVector EffectorLocation; // 0xe0
	FBoneSocketTarget EffectorTarget; // 0xf0
	FVector JointTargetLocation; // 0x150
	FBoneSocketTarget JointTarget; // 0x160
	FAxis TwistAxis; // 0x1c0
	EBoneControlSpace EffectorLocationSpace; // 0x1d0
	EBoneControlSpace JointTargetLocationSpace; // 0x1d1
	char bAllowStretching : 1; // 0x1d2
	char bTakeRotationFromEffectorSpace : 1; // 0x1d2
	char bMaintainEffectorRelRot : 1; // 0x1d2
	char bAllowTwist : 1; // 0x1d2
};

struct FMetricFilterMatchRecord {
	FString EventNumber; // 0x0
	FString EventMessage; // 0x10
	TMap<FString, FString> ExtractedValues; // 0x20
};

struct FForceFeedbackParameters {
	FName Tag; // 0x0
	bool bLooping; // 0x8
	bool bIgnoreTimeDilation; // 0x9
	bool bPlayWhilePaused; // 0xa
};

struct FPoseSnapshot {
	TArray<FTransform> LocalTransforms; // 0x0
	TArray<FName> BoneNames; // 0x10
	FName SkeletalMeshName; // 0x20
	FName SnapshotName; // 0x28
	bool bIsValid; // 0x30
};

struct FAnimLinkableElement {
	UAnimMontage* LinkedMontage; // 0x8
	int32_t SlotIndex; // 0x10
	int32_t SegmentIndex; // 0x14
	EAnimLinkMethod LinkMethod; // 0x18
	EAnimLinkMethod CachedLinkMethod; // 0x19
	float SegmentBeginTime; // 0x1c
	float SegmentLength; // 0x20
	float LinkValue; // 0x24
	UAnimSequenceBase* LinkedSequence; // 0x28
};

struct FAnimNode_UseCachedPose {
	FPoseLink LinkToCachingNode; // 0x10
	FName CachePoseName; // 0x20
};

struct FNiagaraInt32 {
	int32_t Value; // 0x0
};

struct FSubdivisionLimitSection {
	TArray<FSubdividedQuad> SubdividedQuads; // 0x0
};

struct FConstraintBaseParams {
	float Stiffness; // 0x0
	float Damping; // 0x4
	float Restitution; // 0x8
	float ContactDistance; // 0xc
	char bSoftConstraint : 1; // 0x10
};

struct FNiagaraTypeDefinitionHandle {
	int32_t RegisteredTypeIndex; // 0x0
};

struct FBodyInstanceCore {
	char bSimulatePhysics : 1; // 0x10
	char bOverrideMass : 1; // 0x10
	char bEnableGravity : 1; // 0x10
	char bAutoWeld : 1; // 0x10
	char bStartAwake : 1; // 0x10
	char bGenerateWakeEvents : 1; // 0x10
	char bUpdateMassWhenScaleChanges : 1; // 0x10
};

struct FS_RefineOffset {
	int32_t ExclusiveMin_16_A773F548404649A95CF58FA3F50C1BBF; // 0x0
	int32_t InclusiveMax_15_14E81C254F4F6CA6C47D0989B4E54C27; // 0x4
	float TransMultply_12_9083C0D642FF3BDC732FDE88A0363E5C; // 0x8
};

struct FARMeshUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	EARObjectClassification ObjectClassification; // 0x50
};

struct FInterpCurvePointTwoVectors {
	float InVal; // 0x0
	FTwoVectors OutVal; // 0x4
	FTwoVectors ArriveTangent; // 0x1c
	FTwoVectors LeaveTangent; // 0x34
	EInterpCurveMode InterpMode; // 0x4c
};

struct FNavigationLink {
	FVector Left; // 0x30
	FVector Right; // 0x3c
};

struct FMovieSceneSequenceID {
	uint32_t Value; // 0x0
};

struct FTagResourceResult {
	FResponseMetadata ResponseMetadata; // 0x0
};

struct FImageWriteOptions {
	EDesiredImageFormat Format; // 0x0
	FDelegate OnComplete; // 0x4
	int32_t CompressionQuality; // 0x14
	bool bOverwriteFile; // 0x18
	bool bAsync; // 0x19
};

struct FValueFromDataTableBase {
	FName Name; // 0x8
	FString Description; // 0x10
};

struct FBakedFloatCustomAttribute {
	FName AttributeName; // 0x0
	FSimpleCurve FloatCurve; // 0x8
};

struct FAkMidiEventBase {
	EAkMidiEventType Type; // 0x0
	char Chan; // 0x1
};

struct FMovieSceneActorReferenceData {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneActorReferenceKey> KeyValues; // 0x40
};

struct FConstrainComponentPropName {
	FName ComponentName; // 0x0
};

struct FNiagaraVariableBase {
	FName Name; // 0x0
	FNiagaraTypeDefinitionHandle TypeDefHandle; // 0x8
};

struct FMovieSceneNiagaraVectorParameterSectionTemplate {
	FMovieSceneFloatChannel VectorChannels[0x4]; // 0x40
	int32_t ChannelsUsed; // 0x2c0
};

struct FAnimNode_DragonFeetSolver {
	FDragonData_MultiInput dragon_input_data; // 0xc8
	EIK_Type_Plugin ik_type; // 0x160
	EIKTrace_Type_Plugin trace_type; // 0x161
	float Trace_Radius; // 0x164
	EInterpoLocation_Type_Plugin loc_interp_type; // 0x168
	EInterpoRotation_Type_Plugin rot_interp_type; // 0x170
	float virtual_scale; // 0x174
	bool automatic_leg_make; // 0x178
	bool Use_OptionalRef_Feet_As_Ref; // 0x179
	bool enable_solver; // 0x17a
	FComponentSpacePoseLink OptionalRefPose; // 0x180
	float shift_speed; // 0x190
	bool ignore_shift_speed; // 0x194
	bool interpolate_only_z; // 0x195
	float Location_Lerp_Speed; // 0x198
	float feet_rotation_speed; // 0x19c
	FRuntimeFloatCurve Interpolation_Velocity_Curve; // 0x1a0
	bool Enable_Complex_Rotation_Method; // 0x228
	FRuntimeFloatCurve ComplexSimpleFoot_Velocity_Curve; // 0x230
	ETraceTypeQuery Trace_Channel; // 0x2e8
	ETraceTypeQuery Anti_Trace_Channel; // 0x2e9
	float FPS_Lerp_Treshold; // 0x2ec
	float line_trace_upper_height; // 0x454
	float line_trace_down_height; // 0x458
	FRuntimeFloatCurve Trace_Down_Multiplier_Curve; // 0x460
	bool Use_Anti_Channel; // 0x4e8
	bool Ignore_Lerping; // 0x4e9
	bool Ignore_Location_Lerping; // 0x4ea
	bool Should_Rotate_Feet; // 0x4eb
	bool show_trace_in_game; // 0x4ed
	bool Enable_Pitch; // 0x508
	bool Enable_Roll; // 0x509
	FVector character_direction_vector_CS; // 0x50c
	FVector character_forward_direction_vector_CS; // 0x518
	bool Use_Four_Point_Feets; // 0x524
	bool Enable_Foot_Lift_Limit; // 0x525
	bool Affect_Toes_Always; // 0x526
	float Max_Limb_Radius; // 0x528
	float Foot_01_Height_Offset; // 0x638
	float Foot_02_Height_Offset; // 0x63c
	float Foot_03_Height_Offset; // 0x640
	float Foot_04_Height_Offset; // 0x644
};

struct FSQSSendMessageBatchResult {
	TArray<FSendMessageBatchResultEntry> Successful; // 0x0
	TArray<FBatchResultErrorEntry> Failed; // 0x10
	FSQSResponseMetadata ResponseMetadata; // 0x20
};

struct FSurvivalWorldSettings {
	FText WorldName; // 0x0
	FText WorldInfo; // 0x18
	FText Password; // 0x30
	FString GameMode; // 0x48
	int32_t MaxPlayers; // 0x58
	bool bAllAdmins; // 0x5c
	bool bAllowWorldVoiceChat; // 0x5d
	TArray<FString> AdminUsers; // 0x60
	USpotEventsAsset* SpotEvents; // 0x70
	TArray<FOverriddenValue> ValueOverridesParsed; // 0x78
};

struct FMovieSceneSpawnable {
	FTransform SpawnTransform; // 0x0
	TArray<FName> Tags; // 0x30
	bool bContinuouslyRespawn; // 0x40
	bool bEvaluateTracksWhenNotSpawned; // 0x41
	FGuid Guid; // 0x44
	FString Name; // 0x58
	UObject* ObjectTemplate; // 0x68
	TArray<FGuid> ChildPossessables; // 0x70
	ESpawnOwnership Ownership; // 0x80
	FName LevelName; // 0x84
};

struct FAkSpatialAudioSettings {
	uint32_t MaxSoundPropagationDepth; // 0x0
	float MovementThreshold; // 0x4
	uint32_t NumberOfPrimaryRays; // 0x8
	uint32_t ReflectionOrder; // 0xc
	float MaximumPathLength; // 0x10
	float CPULimitPercentage; // 0x14
	bool EnableDiffractionOnReflections; // 0x18
	bool EnableGeometricDiffractionAndTransmission; // 0x19
	bool CalcEmitterVirtualPosition; // 0x1a
	bool UseObstruction; // 0x1b
	bool UseOcclusion; // 0x1c
};

struct FLiveLinkRefSkeleton {
	TArray<FName> BoneNames; // 0x0
	TArray<int32_t> BoneParents; // 0x10
};

struct FInsightRuleContributorDatapoint {
	FDateTime Timestamp; // 0x0
	float ApproximateValue; // 0x8
};

struct FRepAttachment {
	AActor* AttachParent; // 0x0
	FVector_NetQuantize100 LocationOffset; // 0x8
	FVector_NetQuantize100 RelativeScale3D; // 0x14
	FRotator RotationOffset; // 0x20
	FName AttachSocket; // 0x2c
	USceneComponent* AttachComponent; // 0x38
};

struct FMagicLeapRaycastQueryParams {
	FVector Position; // 0x0
	FVector Direction; // 0xc
	FVector UpVector; // 0x18
	int32_t Width; // 0x24
	int32_t Height; // 0x28
	float HorizontalFovDegrees; // 0x2c
	bool CollideWithUnobserved; // 0x30
	int32_t UserData; // 0x34
};

struct FRootMotionSource_JumpForce {
	FRotator Rotation; // 0x98
	float Distance; // 0xa4
	float Height; // 0xa8
	bool bDisableTimeout; // 0xac
	UCurveVector* PathOffsetCurve; // 0xb0
	UCurveFloat* TimeMappingCurve; // 0xb8
};

struct FTransformCurve {
	FVectorCurve TranslationCurve; // 0x18
	FVectorCurve RotationCurve; // 0x1b0
	FVectorCurve ScaleCurve; // 0x348
};

struct FEngineShowFlagsSetting {
	FString ShowFlagName; // 0x0
	bool Enabled; // 0x10
};

struct FQueryInfo {
	FString QueryID; // 0x0
	FString QueryString; // 0x10
	EQueryStatus Status; // 0x20
	FString CreateTime; // 0x28
	FString LogGroupName; // 0x38
};

struct FAnimNode_CurveSource {
	FPoseLink SourcePose; // 0x10
	FName SourceBinding; // 0x20
	float Alpha; // 0x28
	TScriptInterface<ICurveSourceInterface> CurveSource; // 0x30
};

struct FS_MachineArmSlotArray {
	TArray<E_MachineArmSlot> SlotArray_3_187FBE964C38055E5BCA38BB7EFFC076; // 0x0
};

struct FBroadphaseSettings {
	bool bUseMBPOnClient; // 0x0
	bool bUseMBPOnServer; // 0x1
	bool bUseMBPOuterBounds; // 0x2
	FBox MBPBounds; // 0x4
	FBox MBPOuterBounds; // 0x20
	uint32_t MBPNumSubdivs; // 0x3c
};

struct FGameModeName {
	FString Name; // 0x0
	FSoftClassPath GameMode; // 0x10
};

struct FSourceEffectChorusBaseSettings {
	float Depth; // 0x0
	float Frequency; // 0x4
	float Feedback; // 0x8
	float WetLevel; // 0xc
	float DryLevel; // 0x10
	float Spread; // 0x14
};

struct FWorkshopItemDownloadInfo {
	FUInt64 bytesCurrent; // 0x0
	FUInt64 bytesTotal; // 0x8
	int32_t megaBytesCurrent; // 0x10
	int32_t megaBytesTotal; // 0x14
	float percentageFinished; // 0x18
};

struct FS_ResourceSpawnInfo {
	AActor* SpawnClass_3_E28062D64C399C6D31FA88BBE5922201; // 0x0
	int32_t AtLeastCount_7_535E53374B305142FDC1F9A4C0738424; // 0x8
	int32_t MaximumCount_9_C5F3225B4351D359B20CE9A73CABE0BC; // 0xc
	float SpawnProbability_13_00672568475C45B7CB4D7881692BD79C; // 0x10
	FVector CheckVolume_16_92993C9247FC79DAF776009CF5B24861; // 0x14
	FS_ConditionParam AdditiveParameter_20_440531F84DDBE70A4E77D4B11C2DDD50; // 0x20
};

struct FSplineMeshInstanceData {
	FVector StartPos; // 0xb8
	FVector EndPos; // 0xc4
	FVector StartTangent; // 0xd0
	FVector EndTangent; // 0xdc
};

struct FDialogueTable {
	int32_t Order; // 0x8
	FText Situation; // 0x10
	TArray<FDialogueText> Dialogues; // 0x28
	USoundBase* DisappearSound; // 0x38
};

struct FSQSCreateQueueResult {
	FString QueueUrl; // 0x0
	FSQSResponseMetadata ResponseMetadata; // 0x10
};

struct FGizmoVec2ParameterChange {
	FVector2D InitialValue; // 0x0
	FVector2D CurrentValue; // 0x8
};

struct FS_ItemSpawner {
	FDataTableRowHandle Item_17_7863565647E9A34E17B902B3B80A5B73; // 0x0
	int32_t AmountMin_18_45E8CE2A4C7167791C10B29330DDCB09; // 0x10
	int32_t AmountMax_19_D013B5684F7F9B38B151EBB322C6A624; // 0x14
	float SpawnChance_20_D34AB7334657AFFF5781EFA7DDFD475E; // 0x18
	TSet<E_LootType> SpawnerType_24_1DA4607842FC82182F2DAEBC44DD0BE0; // 0x20
};

struct FMovieSceneColorKeyStruct {
	FLinearColor Color; // 0x8
	FFrameNumber Time; // 0x18
};

struct FMagicLeapPolygon {
	TArray<FVector> Vertices; // 0x0
};

struct FGraphReference {
	UEdGraph* MacroGraph; // 0x0
	UBlueprint* GraphBlueprint; // 0x8
	FGuid GraphGuid; // 0x10
};

struct FMovieScenePrimitiveMaterialTemplate {
	int32_t MaterialIndex; // 0x20
	FMovieSceneObjectPathChannel MaterialChannel; // 0x28
};

struct FMovieSceneActorReferenceKey {
	FMovieSceneObjectBindingID Object; // 0x0
	FName ComponentName; // 0x18
	FName SocketName; // 0x20
};

struct FStatColorMapping {
	FString StatName; // 0x0
	TArray<FStatColorMapEntry> ColorMap; // 0x10
	char DisableBlend : 1; // 0x20
};

struct FFilteredLogEvent {
	FString LogStreamName; // 0x0
	FString Timestamp; // 0x10
	FString Message; // 0x20
	FString IngestionTime; // 0x30
	FString EventId; // 0x40
};

struct FDescribeDestinationsRequest {
	FString DestinationNamePrefix; // 0x0
	FString NextToken; // 0x10
	int32_t Limit; // 0x20
};

struct FSoundAttenuationSettings {
	char bAttenuate : 1; // 0xb0
	char bSpatialize : 1; // 0xb0
	char bAttenuateWithLPF : 1; // 0xb0
	char bEnableListenerFocus : 1; // 0xb0
	char bEnableFocusInterpolation : 1; // 0xb0
	char bEnableOcclusion : 1; // 0xb0
	char bUseComplexCollisionForOcclusion : 1; // 0xb0
	char bEnableReverbSend : 1; // 0xb0
	char bEnablePriorityAttenuation : 1; // 0xb1
	char bApplyNormalizationToStereoSounds : 1; // 0xb1
	char bEnableLogFrequencyScaling : 1; // 0xb1
	char bEnableSubmixSends : 1; // 0xb1
	ESoundSpatializationAlgorithm SpatializationAlgorithm; // 0xb2
	float BinauralRadius; // 0xb4
	EAirAbsorptionMethod AbsorptionMethod; // 0xb8
	ECollisionChannel OcclusionTraceChannel; // 0xb9
	EReverbSendMethod ReverbSendMethod; // 0xba
	EPriorityAttenuationMethod PriorityAttenuationMethod; // 0xbb
	float OmniRadius; // 0xbc
	float StereoSpread; // 0xc0
	float LPFRadiusMin; // 0xc4
	float LPFRadiusMax; // 0xc8
	FRuntimeFloatCurve CustomLowpassAirAbsorptionCurve; // 0xd0
	FRuntimeFloatCurve CustomHighpassAirAbsorptionCurve; // 0x158
	float LPFFrequencyAtMin; // 0x1e0
	float LPFFrequencyAtMax; // 0x1e4
	float HPFFrequencyAtMin; // 0x1e8
	float HPFFrequencyAtMax; // 0x1ec
	float FocusAzimuth; // 0x1f0
	float NonFocusAzimuth; // 0x1f4
	float FocusDistanceScale; // 0x1f8
	float NonFocusDistanceScale; // 0x1fc
	float FocusPriorityScale; // 0x200
	float NonFocusPriorityScale; // 0x204
	float FocusVolumeAttenuation; // 0x208
	float NonFocusVolumeAttenuation; // 0x20c
	float FocusAttackInterpSpeed; // 0x210
	float FocusReleaseInterpSpeed; // 0x214
	float OcclusionLowPassFilterFrequency; // 0x218
	float OcclusionVolumeAttenuation; // 0x21c
	float OcclusionInterpolationTime; // 0x220
	float ReverbWetLevelMin; // 0x224
	float ReverbWetLevelMax; // 0x228
	float ReverbDistanceMin; // 0x22c
	float ReverbDistanceMax; // 0x230
	float ManualReverbSendLevel; // 0x234
	FRuntimeFloatCurve CustomReverbSendCurve; // 0x238
	TArray<FAttenuationSubmixSendSettings> SubmixSendSettings; // 0x2c0
	float PriorityAttenuationMin; // 0x2d0
	float PriorityAttenuationMax; // 0x2d4
	float PriorityAttenuationDistanceMin; // 0x2d8
	float PriorityAttenuationDistanceMax; // 0x2dc
	float ManualPriorityAttenuation; // 0x2e0
	FRuntimeFloatCurve CustomPriorityAttenuationCurve; // 0x2e8
	FSoundAttenuationPluginSettings PluginSettings; // 0x370
};

struct FNiagaraSystemScalabilitySettingsArray {
	TArray<FNiagaraSystemScalabilitySettings> Settings; // 0x0
};

struct FNiagaraEmitterScriptProperties {
	UNiagaraScript* Script; // 0x0
	TArray<FNiagaraEventReceiverProperties> EventReceivers; // 0x8
	TArray<FNiagaraEventGeneratorProperties> EventGenerators; // 0x18
};

struct FNamedFloat {
	float Value; // 0x0
	FName Name; // 0x4
};

struct FPBUF_sv_VoiceTalkTokenRes {
	FString token; // 0x0
};

struct FDebugTextInfo {
	AActor* SrcActor; // 0x0
	FVector SrcActorOffset; // 0x8
	FVector SrcActorDesiredOffset; // 0x14
	FString DebugText; // 0x20
	float TimeRemaining; // 0x30
	float Duration; // 0x34
	FColor TextColor; // 0x38
	char bAbsoluteLocation : 1; // 0x3c
	char bKeepAttachedToActor : 1; // 0x3c
	char bDrawShadow : 1; // 0x3c
	FVector OrigActorLocation; // 0x40
	UFont* Font; // 0x50
	float FontScale; // 0x58
};

struct FResourcePolicy {
	FString PolicyName; // 0x0
	FString PolicyDocument; // 0x10
	FString LastUpdatedTime; // 0x20
};

struct FDescribeLogStreamsRequest {
	FString LogGroupName; // 0x0
	FString LogStreamNamePrefix; // 0x10
	EOrderBy OrderBy; // 0x20
	bool bDescending; // 0x21
	FString NextToken; // 0x28
	int32_t Limit; // 0x38
};

struct FNavAgentProperties {
	float AgentRadius; // 0x4
	float AgentHeight; // 0x8
	float AgentStepHeight; // 0xc
	float NavWalkingSearchHeightScale; // 0x10
	FSoftClassPath PreferredNavData; // 0x18
};

struct FMeshSectionBulkTextureData {
	int32_t Section; // 0x0
	int32_t TextureSizeX; // 0x4
	int32_t TextureSizeY; // 0x8
	TArray<char> BulkData; // 0x10
};

struct FParticleEditorPromotionSettings {
	FFilePath DefaultParticleAsset; // 0x0
};

struct FJoinabilitySettings {
	FName SessionName; // 0x0
	bool bPublicSearchable; // 0x8
	bool bAllowInvites; // 0x9
	bool bJoinViaPresence; // 0xa
	bool bJoinViaPresenceFriendsOnly; // 0xb
	int32_t MaxPlayers; // 0xc
	int32_t MaxPartySize; // 0x10
};

struct FScrollBorderStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
};

struct FAnimNode_PoseBlendNode {
	FPoseLink SourcePose; // 0x80
	EAlphaBlendOption BlendOption; // 0x90
	UCurveFloat* CustomCurve; // 0x98
};

struct FLiveLinkFrameData {
	TArray<FTransform> Transforms; // 0x0
	TArray<FLiveLinkCurveElement> CurveElements; // 0x10
	FLiveLinkWorldTime WorldTime; // 0x20
	FLiveLinkMetaData MetaData; // 0x30
};

struct FConstraint {
	FBoneReference TargetBone; // 0x0
	EConstraintOffsetOption OffsetOption; // 0x10
	ETransformConstraintType TransformType; // 0x11
	FFilterOptionPerAxis PerAxis; // 0x12
};

struct FAnimCurveParam {
	FName Name; // 0x0
};

struct FAkSegmentInfo {
	int32_t CurrentPosition; // 0x0
	int32_t PreEntryDuration; // 0x4
	int32_t ActiveDuration; // 0x8
	int32_t PostExitDuration; // 0xc
	int32_t RemainingLookAheadTime; // 0x10
	float BeatDuration; // 0x14
	float BarDuration; // 0x18
	float GridDuration; // 0x1c
	float GridOffset; // 0x20
};

struct FRepRootMotionMontage {
	bool bIsActive; // 0x0
	UAnimMontage* AnimMontage; // 0x8
	float Position; // 0x10
	FVector_NetQuantize100 Location; // 0x14
	FRotator Rotation; // 0x20
	UPrimitiveComponent* MovementBase; // 0x30
	FName MovementBaseBoneName; // 0x38
	bool bRelativePosition; // 0x40
	bool bRelativeRotation; // 0x41
	FRootMotionSourceGroup AuthoritativeRootMotion; // 0x48
	FVector_NetQuantize10 Acceleration; // 0x80
	FVector_NetQuantize10 LinearVelocity; // 0x8c
};

struct FNPCMeleeAttackInfo {
	UAnimMontage* MeleeAttackAnim; // 0x8
	int32_t AttackWeight; // 0x10
	float Damage; // 0x14
	float MoveRange; // 0x18
	UDamageType* DamageType; // 0x20
	float SpeedMultiplier; // 0x28
	FName TargetActiveCollisionTagName; // 0x2c
	bool DisableTurning; // 0x34
	bool NeedLookAtTarget; // 0x35
	UAKData* HitWeaponAKSwitch; // 0x38
	bool IsDefender; // 0x40
};

struct FSlateBrush {
	FVector2D ImageSize; // 0x8
	FMargin Margin; // 0x10
	FSlateColor TintColor; // 0x20
	UObject* ResourceObject; // 0x48
	FName ResourceName; // 0x50
	FBox2D UVRegion; // 0x58
	ESlateBrushDrawType DrawAs; // 0x6c
	ESlateBrushTileType Tiling; // 0x6d
	ESlateBrushMirrorType Mirroring; // 0x6e
	ESlateBrushImageType ImageType; // 0x6f
	char bIsDynamicallyLoaded : 1; // 0x80
	char bHasUObject : 1; // 0x80
};

struct FPolyglotTextData {
	ELocalizedTextSourceCategory Category; // 0x0
	FString NativeCulture; // 0x8
	FString Namespace; // 0x18
	FString Key; // 0x28
	FString NativeString; // 0x38
	TMap<FString, FString> LocalizedStrings; // 0x48
	bool bIsMinimalPatch; // 0x98
	FText CachedText; // 0xa0
};

struct FVectorParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	FLinearColor ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x20
};

struct FNiagaraParameterDataSetBinding {
	int32_t ParameterOffset; // 0x0
	int32_t DataSetComponentOffset; // 0x4
};

struct FSteamUGCQueryParameterTagsAllUserDetails {
	TArray<FSteamKeyValuePair> requiredKeyValueTags; // 0x0
};

struct FAkCommunicationSettings {
	uint32_t PoolSize; // 0x0
	uint16_t DiscoveryBroadcastPort; // 0x4
	uint16_t CommandPort; // 0x6
	uint16_t NotificationPort; // 0x8
	FString NetworkName; // 0x10
};

struct FLinearColor {
	float R; // 0x0
	float G; // 0x4
	float B; // 0x8
	float A; // 0xc
};

struct FDeleteLogStreamRequest {
	FString LogGroupName; // 0x0
	FString LogStreamName; // 0x10
};

struct FGeneratedMesh {
	int32_t ID; // 0x0
	UStaticMesh* Mesh; // 0x8
};

struct FMovieSceneVectorKeyStructBase {
	FFrameNumber Time; // 0x8
};

struct FARSessionStatus {
	FString AdditionalInfo; // 0x0
	EARSessionStatus Status; // 0x10
};

struct FValueInDataTable {
	FString Value; // 0x8
	FText Description; // 0x18
};

struct FChaosCollisionEventRequestSettings {
	int32_t MaxNumberResults; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc
	float MaxDistance; // 0x10
	EChaosCollisionSortMethod SortMethod; // 0x14
};

struct FSceneComponentInstanceData {
	TMap<USceneComponent*, FTransform> AttachedInstanceComponents; // 0x68
};

struct FMovieSceneStringChannel {
	TArray<FFrameNumber> Times; // 0x8
	TArray<FString> Values; // 0x18
	FString DefaultValue; // 0x28
	bool bHasDefaultValue; // 0x38
};

struct FMovieSceneActorReferenceSectionTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x20
	FMovieSceneActorReferenceData ActorReferenceData; // 0x38
};

struct FMagicLeapImageTargetState {
	EMagicLeapImageTargetStatus TrackingStatus; // 0x0
	FVector Location; // 0x4
	FRotator Rotation; // 0x10
};

struct FS_HoldableGeneralInfo {
	E_HoldableType HoldableType_14_B21C4F784EC238AD597ADF9F34E03120; // 0x0
	AHoldableBase* Class_2_339D7E0A492B420AAD904CBAB9023D26; // 0x8
	UAnimMontage* FP_Equip_5_924F237649A23662E5DAEDA27BAFC8B1; // 0x10
	UAnimMontage* TP_Equip_7_838CFD9A4617E5A6C1B33B9D35A70951; // 0x18
	UAnimMontage* FP_Unequip_9_F50F3BD341C03C42E26C7E8468FDDED8; // 0x20
	UAnimMontage* TP_Unequip_11_EA31347347C674B8440738BC55CE9D12; // 0x28
	float EquipPlayTime_17_DD20F56A4D94BAE4A7F4908C4781BE21; // 0x30
	float UnequipPlayTime_19_546055A14B93C101BA3AF2BD0B516296; // 0x34
	TSoftObjectPtr<UAkSwitchValue> BringUpSoundSwitch_26_BC6E189F4B9B0D53A5AF97BAEC1203A6; // 0x38
	bool bHoldableWhenConditionZero_29_3CA977B545D12F87BB4B008BB9494776; // 0x60
	bool CanLean_31_5ED908A04A5D019AE6D4788D64CAF95C; // 0x61
	FEditableObjectPrototype ThrownItemPrototype_35_6E2348F94848AA3CC3C910B8E9D70855; // 0x68
	UWBP_HoldableGuideUIBase_C* HoldableGuideUIClass_39_E68CF6DE44A6A9E0FEB895993DC604C2; // 0x78
};

struct FGameplayTag {
	FName TagName; // 0x0
};

struct FWebsocketDedicatedServerConnectionInfo {
	FString OwningId; // 0x0
	FString title; // 0x10
	FString Guid; // 0x20
	FString branch; // 0x30
	int32_t BuildNumber; // 0x40
	bool ready; // 0x44
	int32_t UserCount; // 0x48
};

struct FS_CraftingRecipe {
	E_CraftingCatergoryType Category_16_4D455EE844667226ED5837B716C6250D; // 0x0
	int32_t TotalSortOrder_23_B59D871940F009F747899C928C826F34; // 0x4
	int32_t SortOrder_15_6367F36549DCDD9C25F99290F6A03FFF; // 0x8
	TArray<FS_CraftingRecipeData> Recipe_9_37C6D28A48F311D6FC2048A26F1E4FAC; // 0x10
	bool IsHiddenRecipe_17_87D1E1C04657FA73366C76B6813B1146; // 0x20
	FString Desc_20_3C834AA545FAEEDD758244BD9982A4A0; // 0x28
	int32_t UnlockCondtionByRadiogramCount_26_60F888DF41E820970F62A5A978E17F7A; // 0x38
	TArray<FIntPair> UnlockConditionByRadiogram_38_9EE41E1D4EFB8283366D7DA9D228F4D0; // 0x40
	bool UnlockCheckTypeOR_37_5AE958F94DD7CD1F192F329F80C933B3; // 0x50
};

struct FWeaponAttachmentAbility {
	EAttachmentType AttachmentType; // 0x0
	TArray<AWeaponBase*> AvailableWeapons; // 0x8
	TMap<int32_t, USkeletalMesh*> AttachmentMeshByUID; // 0x18
	TMap<int32_t, FName> AttachCharacterSocketNameByUID; // 0x68
};

struct FGrassVariety {
	UStaticMesh* GrassMesh; // 0x0
	TArray<UMaterialInterface*> OverrideMaterials; // 0x8
	FPerPlatformFloat GrassDensity; // 0x18
	bool bUseGrid; // 0x1c
	float PlacementJitter; // 0x20
	FPerPlatformInt StartCullDistance; // 0x24
	FPerPlatformInt EndCullDistance; // 0x28
	int32_t MinLOD; // 0x2c
	EGrassScaling Scaling; // 0x30
	FFloatInterval ScaleX; // 0x34
	FFloatInterval ScaleY; // 0x3c
	FFloatInterval ScaleZ; // 0x44
	bool RandomRotation; // 0x4c
	bool AlignToSurface; // 0x4d
	bool bUseLandscapeLightmap; // 0x4e
	FLightingChannels LightingChannels; // 0x4f
	bool bReceivesDecals; // 0x50
	bool bCastDynamicShadow; // 0x51
	bool bKeepInstanceBufferCPUCopy; // 0x52
};

struct FMovieSceneTimeTransform {
	float TimeScale; // 0x0
	FFrameTime Offset; // 0x4
};

struct FEngineServiceNotification {
	FString Text; // 0x0
	double TimeSeconds; // 0x10
};

struct FVisibilityTrackKey {
	float Time; // 0x0
	EVisibilityTrackAction Action; // 0x4
	EVisibilityTrackCondition ActiveCondition; // 0x5
};

struct FPlayerReservation {
	FUniqueNetIdRepl UniqueId; // 0x0
	FString ValidationStr; // 0x28
	FString Platform; // 0x38
	bool bAllowCrossplay; // 0x48
	float ElapsedTime; // 0x4c
};

struct FWebsocketClientConnectionInfo {
	FString AuthSessionTicket; // 0x0
	FString appId; // 0x10
	FString branch; // 0x20
};

struct FSoundTrackKey {
	float Time; // 0x0
	float Volume; // 0x4
	float Pitch; // 0x8
	USoundBase* Sound; // 0x10
};

struct FStaticParameterBase {
	FMaterialParameterInfo ParameterInfo; // 0x0
	bool bOverride; // 0x10
	FGuid ExpressionGUID; // 0x14
};

struct FMeshSectionInfo {
	int32_t MaterialIndex; // 0x0
	bool bEnableCollision; // 0x4
	bool bCastShadow; // 0x5
	bool bVisibleInRayTracing; // 0x6
	bool bForceOpaque; // 0x7
};

struct FCachedAnimStateArray {
	TArray<FCachedAnimStateData> States; // 0x0
};

struct FTTLinearColorTrack {
	UCurveLinearColor* CurveLinearColor; // 0x20
};

struct FMediaPlayerTrackOptions {
	int32_t Audio; // 0x0
	int32_t Caption; // 0x4
	int32_t MetaData; // 0x8
	int32_t Script; // 0xc
	int32_t Subtitle; // 0x10
	int32_t Text; // 0x14
	int32_t Video; // 0x18
};

struct FRollbackNetStartupActorInfo {
	UObject* Archetype; // 0x8
	ULevel* Level; // 0x38
	TArray<UObject*> ObjReferences; // 0xa0
};

struct FNiagaraSystemScalabilityOverrides {
	TArray<FNiagaraSystemScalabilityOverride> Overrides; // 0x0
};

struct FAIDataProviderTypedValue {
	UObject* PropertyType; // 0x20
};

struct FBasicParticleData {
	FVector Position; // 0x0
	float Size; // 0xc
	FVector Velocity; // 0x10
};

struct FSQSPurgeQueueRequest {
	FString QueueUrl; // 0x0
};

struct FAIDamageEvent {
	float Amount; // 0x0
	FVector Location; // 0x4
	FVector HitLocation; // 0x10
	AActor* DamagedActor; // 0x20
	AActor* Instigator; // 0x28
};

struct FActorPerceptionBlueprintInfo {
	AActor* Target; // 0x0
	TArray<FAIStimulus> LastSensedStimuli; // 0x8
	char bIsHostile : 1; // 0x18
};

struct FNiagaraEmitterScalabilitySettings {
	FNiagaraPlatformSet Platforms; // 0x0
	char bScaleSpawnCount : 1; // 0x30
	float SpawnCountScale; // 0x34
};

struct FSQSChangeMessageVisibilityRequest {
	FString QueueUrl; // 0x0
	FString ReceiptHandle; // 0x10
	int32_t VisibilityTimeout; // 0x20
};

struct FDestinationCloud {
	FString DestinationName; // 0x0
	FString TargetArn; // 0x10
	FString RoleArn; // 0x20
	FString AccessPolicy; // 0x30
	FString Arn; // 0x40
	FString CreationTime; // 0x50
};

struct FPacketSimulationSettings {
	int32_t PktLoss; // 0x0
	int32_t PktLossMaxSize; // 0x4
	int32_t PktLossMinSize; // 0x8
	int32_t PktOrder; // 0xc
	int32_t PktDup; // 0x10
	int32_t PktLag; // 0x14
	int32_t PktLagVariance; // 0x18
	int32_t PktLagMin; // 0x1c
	int32_t PktLagMax; // 0x20
	int32_t PktIncomingLagMin; // 0x24
	int32_t PktIncomingLagMax; // 0x28
	int32_t PktIncomingLoss; // 0x2c
	int32_t PktJitter; // 0x30
};

struct FMagicLeapGraphicsClientPerformanceInfo {
	float FrameStartCPUCompAcquireCPUTimeMs; // 0x0
	float FrameStartCPUFrameEndGPUTimeMs; // 0x4
	float FrameStartCPUFrameStartCPUTimeMs; // 0x8
	float FrameDurationCPUTimeMs; // 0xc
	float FrameDurationGPUTimeMs; // 0x10
	float FrameInternalDurationCPUTimeMs; // 0x14
	float FrameInternalDurationGPUTimeMs; // 0x18
};

struct FColor {
	char B; // 0x0
	char G; // 0x1
	char R; // 0x2
	char A; // 0x3
};

struct FPackedNormal {
	char X; // 0x0
	char Y; // 0x1
	char Z; // 0x2
	char W; // 0x3
};

struct FDatasmithStaticParameterSetTemplate {
	TMap<FName, bool> StaticSwitchParameters; // 0x0
};

struct FDescribeAlarmHistoryRequest {
	FString AlarmName; // 0x0
	TArray<EAlarmType> AlarmTypes; // 0x10
	EHistoryItemType HistoryItemType; // 0x20
	FDateTime StartDate; // 0x28
	FDateTime EndDate; // 0x30
	int32_t MaxRecords; // 0x38
	FString NextToken; // 0x40
	EScanBy ScanBy; // 0x50
};

struct FBlackboardKeySelector {
	TArray<UBlackboardKeyType*> AllowedTypes; // 0x0
	FName SelectedKeyName; // 0x10
	UBlackboardKeyType* SelectedKeyType; // 0x18
	char SelectedKeyID; // 0x20
	char bNoneIsAllowedValue : 1; // 0x24
};

struct FSVideoResolution {
	int32_t X_2_B2EB3ED14C87FB595290E6B07B273BAE; // 0x0
	int32_t Y_5_EBC461F945CA941644341489CB1BA22F; // 0x4
};

struct FBoneReductionSetting {
	TArray<FName> BonesToRemove; // 0x0
};

struct FCompositeSection {
	FName SectionName; // 0x30
	float StartTime; // 0x38
	FName NextSectionName; // 0x3c
	TArray<UAnimMetaData*> MetaData; // 0x48
};

struct FStaticMeshComponentInstanceData {
	UStaticMesh* StaticMesh; // 0x100
	TArray<FStaticMeshVertexColorLODData> VertexColorLODs; // 0x108
	TArray<FGuid> CachedStaticLighting; // 0x118
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x128
};

struct FCustomizableObjectIdPair {
	FString CustomizableObjectGroupName; // 0x0
	FString CustomizableObjectName; // 0x10
};

struct FSQSListDeadLetterSourceQueuesRequest {
	FString QueueUrl; // 0x0
	FString NextToken; // 0x10
	int32_t MaxResults; // 0x20
};

struct FBPSteamWorkshopItemDetails {
	FBPSteamResult ResultOfRequest; // 0x0
	FBPWorkshopFileType fileType; // 0x1
	int32_t CreatorAppID; // 0x4
	int32_t ConsumerAppID; // 0x8
	FString title; // 0x10
	FString Description; // 0x20
	FString ItemUrl; // 0x30
	int32_t votesUp; // 0x40
	int32_t votesDown; // 0x44
	float CalculatedScore; // 0x48
	bool bBanned; // 0x4c
	bool bAcceptedForUse; // 0x4d
	bool bTagsTruncated; // 0x4e
	FString CreatorSteamID; // 0x50
};

struct FSoundSubmixSpectralAnalysisBandSettings {
	float BandFrequency; // 0x0
	int32_t AttackTimeMsec; // 0x4
	int32_t ReleaseTimeMsec; // 0x8
	float QFactor; // 0xc
};

struct FSolverCollisionFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc
};

struct FBPOnlineRecentPlayer {
	FString LastSeen; // 0x40
};

struct FDeleteMessageBatchRequestEntry {
	FString ID; // 0x0
	FString ReceiptHandle; // 0x10
};

struct FPredictProjectilePathPointData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	float Time; // 0x18
};

struct FNetViewer {
	UNetConnection* Connection; // 0x0
	AActor* InViewer; // 0x8
	AActor* ViewTarget; // 0x10
	FVector ViewLocation; // 0x18
	FVector ViewDir; // 0x24
};

struct FCameraShakeDuration {
	float Duration; // 0x0
	ECameraShakeDurationType Type; // 0x4
};

struct FNiagaraCompileEvent {
	FNiagaraCompileEventSeverity Severity; // 0x0
	FString Message; // 0x8
	FGuid NodeGuid; // 0x18
	FGuid PinGuid; // 0x28
	TArray<FGuid> StackGuids; // 0x38
};

struct FMaterialCachedParameterEntry {
	TArray<uint64_t> NameHashes; // 0x0
	TArray<FMaterialParameterInfo> ParameterInfos; // 0x10
	TArray<FGuid> ExpressionGuids; // 0x20
	TArray<bool> Overrides; // 0x30
};

struct FCollisionProfileName {
	FName Name; // 0x0
};

struct FNiagaraPlatformSetConflictInfo {
	int32_t SetAIndex; // 0x0
	int32_t SetBIndex; // 0x4
	TArray<FNiagaraPlatformSetConflictEntry> Conflicts; // 0x8
};

struct FFindFloorResult {
	char bBlockingHit : 1; // 0x0
	char bWalkableFloor : 1; // 0x0
	char bLineTrace : 1; // 0x0
	float FloorDist; // 0x4
	float LineDist; // 0x8
	FHitResult HitResult; // 0xc
};

struct FInAppPurchaseReceiptInfo {
	FString ItemName; // 0x0
	FString ItemId; // 0x10
	FString ValidationInfo; // 0x20
};

struct FLiveLinkTimeSynchronizationSettings {
	FFrameRate FrameRate; // 0x0
	FFrameNumber FrameOffset; // 0x8
};

struct FSourceEffectChainEntry {
	USoundEffectSourcePreset* Preset; // 0x0
	char bBypass : 1; // 0x8
};

struct FEventPayload {
	FName EventName; // 0x0
	FMovieSceneEventParameters Parameters; // 0x8
};

struct FDeleteDestinationRequest {
	FString DestinationName; // 0x0
};

struct FSolverTrailingFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinVolume; // 0xc
};

struct FCameraPreviewInfo {
	APawn* PawnClass; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	FVector Location; // 0x10
	FRotator Rotation; // 0x1c
	APawn* PawnInst; // 0x28
};

struct FBoolParameterNameAndCurve {
	FName ParameterName; // 0x0
	FMovieSceneBoolChannel ParameterCurve; // 0x8
};

struct FXRHMDData {
	bool bValid; // 0x0
	FName DeviceName; // 0x4
	FGuid ApplicationInstanceID; // 0xc
	ETrackingStatus TrackingStatus; // 0x1c
	FVector Position; // 0x20
	FQuat Rotation; // 0x30
};

struct FOverlapResult {
	TWeakObjectPtr<AActor> Actor; // 0x0
	TWeakObjectPtr<UPrimitiveComponent> Component; // 0x8
	char bBlockingHit : 1; // 0x14
};

struct FS_ItemInventory {
	FString ID_24_9DF34B624AB0F3F6510E998638C6FAE4; // 0x0
	int32_t Count_25_304B2BAD4874CCFCBEAD549D1C3E10E5; // 0x10
	int32_t Index_26_A946B01D4378BF29CCEE45A0C45172A5; // 0x14
	float Condition_32_1E82A51D4778B91CE7F54EB66F8E9764; // 0x18
	Udelete2_C* Inventory_28_0FD0341546F6B136787D9A863530A2D9; // 0x20
	float ExpiredTime_36_E16237704DBB19A4F0E6B683AED57BA5; // 0x28
};

struct FClusterNode {
	FVector BoundMin; // 0x0
	int32_t FirstChild; // 0xc
	FVector BoundMax; // 0x10
	int32_t LastChild; // 0x1c
	int32_t FirstInstance; // 0x20
	int32_t LastInstance; // 0x24
	FVector MinInstanceScale; // 0x28
	FVector MaxInstanceScale; // 0x34
};

struct FS_SaveTeamInfo {
	FString TeamID_5_5C9BE1314D78E32FF472F19137173140; // 0x0
	FString TeamName_7_0E4206C344EF7122DAEF60B8B36891CB; // 0x10
	FLinearColor TeamColor_11_AEE2B40F4038B8E74AE92091833D33E3; // 0x20
	TArray<FTeamMemberInfo> TeamMemberInfo_15_D8EDE35C481D58A42A21B199E5F303B6; // 0x30
};

struct FLevelCollection {
	AGameStateBase* GameState; // 0x8
	UNetDriver* NetDriver; // 0x10
	UDemoNetDriver* DemoNetDriver; // 0x18
	ULevel* PersistentLevel; // 0x20
	TSet<ULevel*> Levels; // 0x28
};

struct FTestMetricFilterResult {
	TArray<FMetricFilterMatchRecord> Matches; // 0x0
};

struct FDatapoint {
	FDateTime Timestamp; // 0x0
	float SampleCount; // 0x8
	float Average; // 0xc
	float Sum; // 0x10
	float Minimum; // 0x14
	float Maximum; // 0x18
	EStandardUnit Unit; // 0x1c
	TMap<FString, float> ExtendedStatistics; // 0x20
};

struct FNiagaraVariableMetaData {
	FText Description; // 0x0
	FText CategoryName; // 0x18
	bool bAdvancedDisplay; // 0x30
	int32_t EditorSortPriority; // 0x34
	bool bInlineEditConditionToggle; // 0x38
	FNiagaraInputConditionMetadata EditCondition; // 0x40
	FNiagaraInputConditionMetadata VisibleCondition; // 0x58
	TMap<FName, FString> PropertyMetaData; // 0x70
	FName ParentAttribute; // 0xc0
	FName ScopeName; // 0xc8
	ENiagaraScriptParameterUsage Usage; // 0xd0
	bool bIsStaticSwitch; // 0xd4
	int32_t StaticSwitchDefaultValue; // 0xd8
	bool bAddedToNodeGraphDeepCopy; // 0xdc
	bool bOutputIsPersistent; // 0xdd
	FName CachedNamespacelessVariableName; // 0xe0
	bool bCreatedInSystemEditor; // 0xe8
	bool bUseLegacyNameString; // 0xe9
};

struct FDisableAlarmActionsRequest {
	TArray<FString> AlarmNames; // 0x0
};

struct FLiveLinkBaseFrameData {
	FLiveLinkWorldTime WorldTime; // 0x0
	FLiveLinkMetaData MetaData; // 0x10
	TArray<float> PropertyValues; // 0x70
};

struct FVMFunctionSpecifier {
	FName Key; // 0x0
	FName Value; // 0x8
};

struct FPhysicalMaterialInput {
	UPhysicalMaterial* PhysicalMaterial; // 0x0
	FExpressionInput Input; // 0x8
};

struct FMovieSceneEventTriggerData {
	FMovieSceneEventPtrs Ptrs; // 0x0
	FGuid ObjectBindingId; // 0x28
};

struct FChildActorAttachedActorInfo {
	TWeakObjectPtr<AActor> Actor; // 0x0
	FName SocketName; // 0x8
	FTransform RelativeTransform; // 0x10
};

struct FAssetBundleData {
	TArray<FAssetBundleEntry> Bundles; // 0x0
};

struct FDialogueContext {
	UDialogueVoice* Speaker; // 0x0
	TArray<UDialogueVoice*> Targets; // 0x8
};

struct FNavLinkCustomInstanceData {
	uint32_t NavLinkUserId; // 0x68
};

struct FTagCloudWatch {
	FString Key; // 0x0
	FString Value; // 0x10
};

struct FCustomPrimitiveData {
	TArray<float> Data; // 0x0
};

struct FDownloadItemResult {
	FUInt32 appId; // 0x10
};

struct FARTraceResult {
	float DistanceFromCamera; // 0x0
	EARLineTraceChannels TraceChannel; // 0x4
	FTransform LocalTransform; // 0x10
	UARTrackedGeometry* TrackedGeometry; // 0x40
};

struct FRandomPlayerSequenceEntry {
	UAnimSequence* Sequence; // 0x0
	float ChanceToPlay; // 0x8
	int32_t MinLoopCount; // 0xc
	int32_t MaxLoopCount; // 0x10
	float MinPlayRate; // 0x14
	float MaxPlayRate; // 0x18
	FAlphaBlend BlendIn; // 0x20
};

struct FPawnActionEvent {
	UPawnAction* Action; // 0x0
};

struct FGetQueryResultsRequest {
	FString QueryID; // 0x0
};

struct FBoneReference {
	FName BoneName; // 0x0
};

struct FAnimNode_HandIKRetargeting {
	FBoneReference RightHandFK; // 0xc8
	FBoneReference LeftHandFK; // 0xd8
	FBoneReference RightHandIK; // 0xe8
	FBoneReference LeftHandIK; // 0xf8
	TArray<FBoneReference> IKBonesToMove; // 0x108
	float HandFKWeight; // 0x118
};

struct FDescribeResourcePoliciesRequest {
	FString NextToken; // 0x0
	int32_t Limit; // 0x10
};

struct FMaterialInput {
	int32_t OutputIndex; // 0x0
	FName ExpressionName; // 0x4
};

struct FMovieSceneCameraShakeSourceTriggerSectionTemplate {
	TArray<FFrameNumber> TriggerTimes; // 0x20
	TArray<FMovieSceneCameraShakeSourceTrigger> TriggerValues; // 0x30
};

struct FCompilerNativizationOptions {
	FName PlatformName; // 0x0
	bool ServerOnlyPlatform; // 0x8
	bool ClientOnlyPlatform; // 0x9
	bool bExcludeMonolithicHeaders; // 0xa
	TArray<FName> ExcludedModules; // 0x10
	TSet<FSoftObjectPath> ExcludedAssets; // 0x20
	TArray<FString> ExcludedFolderPaths; // 0x70
};

struct FEdGraphPinType {
	FName PinCategory; // 0x0
	FName PinSubCategory; // 0x8
	TWeakObjectPtr<UObject> PinSubCategoryObject; // 0x10
	FSimpleMemberReference PinSubCategoryMemberReference; // 0x18
	FEdGraphTerminalType PinValueType; // 0x38
	EPinContainerType ContainerType; // 0x54
	char bIsArray : 1; // 0x55
	char bIsReference : 1; // 0x55
	char bIsConst : 1; // 0x55
	char bIsWeakPointer : 1; // 0x55
	char bIsUObjectWrapper : 1; // 0x55
};

struct FMovieSceneCameraShakeSourceShakeSectionTemplate {
	FMovieSceneCameraShakeSectionData SourceData; // 0x20
	FFrameNumber SectionStartTime; // 0x40
	FFrameNumber SectionEndTime; // 0x44
};

struct FInt32Range {
	FInt32RangeBound LowerBound; // 0x0
	FInt32RangeBound UpperBound; // 0x8
};

struct FSurvivalReplicationGraph_GridSpatialization2DConfiguration {
	float CellSize; // 0x0
	float SpatialBiasX; // 0x4
	float SpatialBiasY; // 0x8
	bool DisableSpatialRebuilds; // 0xc
};

struct FMovieSceneKeyTimeStruct {
	FFrameNumber Time; // 0x8
};

struct FBatchedLine {
	FVector Start; // 0x0
	FVector End; // 0xc
	FLinearColor Color; // 0x18
	float Thickness; // 0x28
	float RemainingLifeTime; // 0x2c
	char DepthPriority; // 0x30
};

struct FAkAdvancedInitializationSettings {
	uint32_t IO_MemorySize; // 0x0
	uint32_t IO_Granularity; // 0x4
	float TargetAutoStreamBufferLength; // 0x8
	bool UseStreamCache; // 0xc
	uint32_t MaximumPinnedBytesInCache; // 0x10
	bool EnableGameSyncPreparation; // 0x14
	uint32_t ContinuousPlaybackLookAhead; // 0x18
	uint32_t MonitorQueuePoolSize; // 0x1c
	uint32_t MaximumHardwareTimeoutMs; // 0x20
	bool DebugOutOfRangeCheckEnabled; // 0x24
	float DebugOutOfRangeLimit; // 0x28
};

struct FAnimNode_AnimDynamics {
	float LinearDampingOverride; // 0xc8
	float AngularDampingOverride; // 0xcc
	FBoneReference RelativeSpaceBone; // 0x130
	FBoneReference BoundBone; // 0x140
	FBoneReference ChainEnd; // 0x150
	FVector BoxExtents; // 0x160
	FVector LocalJointOffset; // 0x16c
	float GravityScale; // 0x178
	FVector GravityOverride; // 0x17c
	float LinearSpringConstant; // 0x188
	float AngularSpringConstant; // 0x18c
	float WindScale; // 0x190
	FVector ComponentLinearAccScale; // 0x194
	FVector ComponentLinearVelScale; // 0x1a0
	FVector ComponentAppliedLinearAccClamp; // 0x1ac
	float AngularBiasOverride; // 0x1b8
	int32_t NumSolverIterationsPreUpdate; // 0x1bc
	int32_t NumSolverIterationsPostUpdate; // 0x1c0
	FAnimPhysConstraintSetup ConstraintSetup; // 0x1c4
	TArray<FAnimPhysSphericalLimit> SphericalLimits; // 0x210
	float SphereCollisionRadius; // 0x220
	FVector ExternalForce; // 0x224
	TArray<FAnimPhysPlanarLimit> PlanarLimits; // 0x230
	AnimPhysCollisionType CollisionType; // 0x240
	AnimPhysSimSpaceType SimulationSpace; // 0x241
	char bUseSphericalLimits : 1; // 0x244
	char bUsePlanarLimit : 1; // 0x244
	char bDoUpdate : 1; // 0x244
	char bDoEval : 1; // 0x244
	char bOverrideLinearDamping : 1; // 0x244
	char bOverrideAngularBias : 1; // 0x244
	char bOverrideAngularDamping : 1; // 0x244
	char bEnableWind : 1; // 0x244
	char bUseGravityOverride : 1; // 0x245
	char bLinearSpring : 1; // 0x245
	char bAngularSpring : 1; // 0x245
	char bChain : 1; // 0x245
	FRotationRetargetingInfo RetargetingSettings; // 0x250
};

struct FPutSubscriptionFilterRequest {
	FString LogGroupName; // 0x0
	FString FilterName; // 0x10
	FString FilterPattern; // 0x20
	FString DestinationArn; // 0x30
	FString RoleArn; // 0x40
	EDistribution Distribution; // 0x50
};

struct FAnimNode_AssetPlayerBase {
	FName GroupName; // 0x10
	EAnimGroupRole GroupRole; // 0x18
	EAnimSyncGroupScope GroupScope; // 0x19
	bool bIgnoreForRelevancyTest; // 0x1a
	float BlendWeight; // 0x1c
	float InternalTimeAccumulator; // 0x20
};

struct FMovieSceneOrderedEvaluationKey {
	FMovieSceneEvaluationKey Key; // 0x0
	uint16_t SetupIndex; // 0xc
	uint16_t TearDownIndex; // 0xe
};

struct FDatasmithCameraFilmbackSettingsTemplate {
	float SensorWidth; // 0x0
	float SensorHeight; // 0x4
};

struct FInsightRule {
	FString Name; // 0x0
	FString State; // 0x10
	FString Schema; // 0x20
	FString Definition; // 0x30
};

struct FPropertyAccessPath {
	int32_t PathSegmentStartIndex; // 0x0
	int32_t PathSegmentCount; // 0x4
	char bHasEvents : 1; // 0x8
};

struct FPrimitiveMaterialRef {
	UPrimitiveComponent* Primitive; // 0x0
	UDecalComponent* Decal; // 0x8
	int32_t ElementIndex; // 0x10
};

struct FStaticMeshVertexColorLODData {
	TArray<FPaintedVertex> PaintedVertices; // 0x0
	TArray<FColor> VertexBufferColors; // 0x10
	uint32_t LODIndex; // 0x20
};

struct FSynthSlateStyle {
	ESynthSlateSizeType SizeType; // 0x8
	ESynthSlateColorStyle ColorStyle; // 0x9
};

struct FSearchBoxStyle {
	FEditableTextBoxStyle TextBoxStyle; // 0x8
	FSlateFontInfo ActiveFontInfo; // 0x800
	FSlateBrush UpArrowImage; // 0x858
	FSlateBrush DownArrowImage; // 0x8e0
	FSlateBrush GlassImage; // 0x968
	FSlateBrush ClearImage; // 0x9f0
	FMargin ImagePadding; // 0xa78
	bool bLeftAlignButtons; // 0xa88
};

struct FClothVertBoneData {
	int32_t NumInfluences; // 0x0
	uint16_t BoneIndices[0xc]; // 0x4
	float BoneWeights[0xc]; // 0x1c
};

struct FMovieSceneSectionEvalOptions {
	bool bCanEditCompletionMode; // 0x0
	EMovieSceneCompletionMode CompletionMode; // 0x1
};

struct FAkAndroidAdvancedInitializationSettings {
	uint32_t AudioAPI; // 0x30
	bool RoundFrameSizeToHardwareSize; // 0x34
};

struct FNamedNetDriver {
	UNetDriver* NetDriver; // 0x0
};

struct FS_ConvertSourceData {
	E_ConvertType ConvertType_2_24318F1D4E7271C19248C5AE3248386E; // 0x0
	float ConvertValuePerTime_5_497E9F6A4E57213E81C8BA8F592D6535; // 0x4
	float ConvertInterval_7_86C2545C4B38BCFD78E2DAB219AC3891; // 0x8
	int32_t SlotCount_10_74E5A9F64B04381B254A7A9DB8C298C2; // 0xc
};

struct FCameraExposureSettings {
	EAutoExposureMethod Method; // 0x0
	float LowPercent; // 0x4
	float HighPercent; // 0x8
	float MinBrightness; // 0xc
	float MaxBrightness; // 0x10
	float SpeedUp; // 0x14
	float SpeedDown; // 0x18
	float Bias; // 0x1c
	UCurveFloat* BiasCurve; // 0x20
	UTexture* MeterMask; // 0x28
	float HistogramLogMin; // 0x30
	float HistogramLogMax; // 0x34
	float CalibrationConstant; // 0x38
	char ApplyPhysicalCameraExposure : 1; // 0x3c
};

struct FMovieSceneCameraShakeSourceTrigger {
	UCameraShakeBase* ShakeClass; // 0x0
	float PlayScale; // 0x8
	ECameraShakePlaySpace PlaySpace; // 0xc
	FRotator UserDefinedPlaySpace; // 0x10
};

struct FLiveLinkSubjectName {
	FName Name; // 0x0
};

struct FSteamUGCHandle {
	FUInt64 handle; // 0x0
};

struct FNiagaraFunctionSignature {
	FName Name; // 0x0
	TArray<FNiagaraVariable> Inputs; // 0x8
	TArray<FNiagaraVariable> Outputs; // 0x18
	FName OwnerName; // 0x28
	char bRequiresContext : 1; // 0x30
	char bRequiresExecPin : 1; // 0x30
	char bMemberFunction : 1; // 0x30
	char bExperimental : 1; // 0x30
	char bSupportsCPU : 1; // 0x30
	char bSupportsGPU : 1; // 0x30
	char bWriteFunction : 1; // 0x30
	char bSoftDeprecatedFunction : 1; // 0x30
	int32_t ModuleUsageBitmask; // 0x34
	int32_t ContextStageMinIndex; // 0x38
	int32_t ContextStageMaxIndex; // 0x3c
	TMap<FName, FName> FunctionSpecifiers; // 0x40
};

struct FCustomInput {
	FName InputName; // 0x0
	FExpressionInput Input; // 0x8
};

struct FKBoxElem {
	FVector Center; // 0x30
	FRotator Rotation; // 0x3c
	float X; // 0x48
	float Y; // 0x4c
	float Z; // 0x50
};

struct FBoolTrackKey {
	float Time; // 0x0
	char Value : 1; // 0x4
};

struct FDestructibleDebrisParameters {
	float DebrisLifetimeMin; // 0x0
	float DebrisLifetimeMax; // 0x4
	float DebrisMaxSeparationMin; // 0x8
	float DebrisMaxSeparationMax; // 0xc
	FBox ValidBounds; // 0x10
};

struct FSidebarLayoutSettings {
	bool bIsWidgetAtRight; // 0x0
	bool bIsLoadingWidgetAtTop; // 0x1
	float Space; // 0x4
	EVerticalAlignment VerticalAlignment; // 0x8
	FWidgetAlignment LoadingWidgetAlignment; // 0x9
	FWidgetAlignment TipAlignment; // 0xb
	EVerticalAlignment BorderVerticalAlignment; // 0xd
	float BorderHorizontalOffset; // 0x10
	FMargin BorderPadding; // 0x14
	FSlateBrush BorderBackground; // 0x28
};

struct Fs_RadioGramSave {
	TMap<int32_t, int32_t> ProgressSave_5_10A9A21F4051E99116FC7B81AF179C80; // 0x0
};

struct FMaterialAttributesInput {
	int32_t PropertyConnectedBitmask; // 0xc
};

struct FLightmassWorldInfoSettings {
	float StaticLightingLevelScale; // 0x0
	int32_t NumIndirectLightingBounces; // 0x4
	int32_t NumSkyLightingBounces; // 0x8
	float IndirectLightingQuality; // 0xc
	float IndirectLightingSmoothness; // 0x10
	FColor EnvironmentColor; // 0x14
	float EnvironmentIntensity; // 0x18
	float EmissiveBoost; // 0x1c
	float DiffuseBoost; // 0x20
	EVolumeLightingMethod VolumeLightingMethod; // 0x24
	char bUseAmbientOcclusion : 1; // 0x25
	char bGenerateAmbientOcclusionMaterialMask : 1; // 0x25
	char bVisualizeMaterialDiffuse : 1; // 0x25
	char bVisualizeAmbientOcclusion : 1; // 0x25
	char bCompressLightmaps : 1; // 0x25
	float VolumetricLightmapDetailCellSize; // 0x28
	float VolumetricLightmapMaximumBrickMemoryMb; // 0x2c
	float VolumetricLightmapSphericalHarmonicSmoothing; // 0x30
	float VolumeLightSamplePlacementScale; // 0x34
	float DirectIlluminationOcclusionFraction; // 0x38
	float IndirectIlluminationOcclusionFraction; // 0x3c
	float OcclusionExponent; // 0x40
	float FullyOccludedSamplesFraction; // 0x44
	float MaxOcclusionDistance; // 0x48
};

struct FDatasmithStaticMeshImportOptions {
	EDatasmithImportLightmapMin MinLightmapResolution; // 0x0
	EDatasmithImportLightmapMax MaxLightmapResolution; // 0x1
	bool bGenerateLightmapUVs; // 0x2
	bool bRemoveDegenerates; // 0x3
};

struct FLandscapeLayerStruct {
	ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
};

struct FBandwidthTestItem {
	TArray<char> Kilobyte; // 0x0
};

struct FNameCurve {
	TArray<FNameCurveKey> Keys; // 0x68
};

struct FPutRetentionPolicyRequest {
	FString LogGroupName; // 0x0
	int32_t RetentionInDays; // 0x10
};

struct FImageSequenceSettings {
	TArray<UTexture2D*> Images; // 0x0
	FVector2D Scale; // 0x10
	float Interval; // 0x18
	bool bPlayReverse; // 0x1c
};

struct FEnvQueryInstanceCache {
	UEnvQuery* Template; // 0x0
};

struct FAnimNode_RotateRootBone {
	FPoseLink BasePose; // 0x10
	float Pitch; // 0x20
	float Yaw; // 0x24
	FInputScaleBiasClamp PitchScaleBiasClamp; // 0x28
	FInputScaleBiasClamp YawScaleBiasClamp; // 0x58
	FRotator MeshToComponent; // 0x88
};

struct FVoiceSettings {
	USceneComponent* ComponentToAttachTo; // 0x0
	USoundAttenuation* AttenuationSettings; // 0x8
	USoundEffectSourcePresetChain* SourceEffectChain; // 0x10
};

struct FClothingAssetData_Legacy {
	FName AssetName; // 0x0
	FString ApexFileName; // 0x8
	bool bClothPropertiesChanged; // 0x18
	FClothPhysicsProperties_Legacy PhysicsProperties; // 0x1c
};

struct FTransformFilter {
	FFilterOptionPerAxis TranslationFilter; // 0x0
	FFilterOptionPerAxis RotationFilter; // 0x3
	FFilterOptionPerAxis ScaleFilter; // 0x6
};

struct FFunctionExpressionInput {
	UMaterialExpressionFunctionInput* ExpressionInput; // 0x0
	FGuid ExpressionInputId; // 0x8
	FExpressionInput Input; // 0x18
};

struct FMovieSceneEvaluationFieldTrackPtr {
	FMovieSceneSequenceID SequenceID; // 0x0
	FMovieSceneTrackIdentifier TrackIdentifier; // 0x4
};

struct FCustomizableObjectBoolParameterValue {
	FString ParameterName; // 0x0
	bool ParameterValue; // 0x10
	FString UID; // 0x18
};

struct FAnimNode_SplineIK {
	FBoneReference StartBone; // 0xc8
	FBoneReference EndBone; // 0xd8
	ESplineBoneAxis BoneAxis; // 0xe8
	bool bAutoCalculateSpline; // 0xe9
	int32_t PointCount; // 0xec
	TArray<FTransform> ControlPoints; // 0xf0
	float Roll; // 0x100
	float TwistStart; // 0x104
	float TwistEnd; // 0x108
	FAlphaBlend TwistBlend; // 0x110
	float Stretch; // 0x140
	float Offset; // 0x144
};

struct FSkeletalMeshSamplingRegionBoneFilter {
	FName BoneName; // 0x0
	char bIncludeOrExclude : 1; // 0x8
	char bApplyToChildren : 1; // 0x8
};

struct FGetMetricDataResult {
	TArray<FMetricDataResult> MetricDataResults; // 0x0
	FString NextToken; // 0x10
	TArray<FMessageDataCloudWatch> Messages; // 0x20
	FResponseMetadata ResponseMetadata; // 0x30
};

struct FRichCurveKey {
	ERichCurveInterpMode InterpMode; // 0x0
	ERichCurveTangentMode TangentMode; // 0x1
	ERichCurveTangentWeightMode TangentWeightMode; // 0x2
	float Time; // 0x4
	float Value; // 0x8
	float ArriveTangent; // 0xc
	float ArriveTangentWeight; // 0x10
	float LeaveTangent; // 0x14
	float LeaveTangentWeight; // 0x18
};

struct FNiagaraDataSetProperties {
	FNiagaraDataSetID ID; // 0x0
	TArray<FNiagaraVariable> Variables; // 0x10
};

struct FSteamUGCQueryParameterAllUserDetails {
	int32_t pageId; // 0x0
	ESteamSupportedLanguages Language; // 0x4
	int32_t allowedCacheResponseTime; // 0x8
	int32_t numDaysPlaytime; // 0xc
	char bReturnPreviewUrl : 1; // 0x10
	char bReturnKeyValueTags : 1; // 0x10
	char bReturnFullDescription : 1; // 0x10
	char bReturnMetaData : 1; // 0x10
	char bReturnChildIds : 1; // 0x10
	char bReturnAdditionalPreviews : 1; // 0x10
};

struct FNiagaraEventGeneratorProperties {
	int32_t MaxEventsPerFrame; // 0x0
	FName ID; // 0x4
	FNiagaraDataSetCompiledData DataSetCompiledData; // 0x10
};

struct FSkeletonToMeshLinkup {
	TArray<int32_t> SkeletonToMeshTable; // 0x0
	TArray<int32_t> MeshToSkeletonTable; // 0x10
};

struct FGetInsightRuleReportRequest {
	FString RuleName; // 0x0
	FDateTime StartTime; // 0x10
	FDateTime EndTime; // 0x18
	int32_t Period; // 0x20
	int32_t MaxContributorCount; // 0x24
	TArray<FString> Metrics; // 0x28
	FString OrderBy; // 0x38
};

struct FRawAnimSequenceTrack {
	TArray<FVector> PosKeys; // 0x0
	TArray<FQuat> RotKeys; // 0x10
	TArray<FVector> ScaleKeys; // 0x20
};

struct FAwsCloudWatchCredentials {
	FString AccessKeyId; // 0x0
	FString SecretKey; // 0x10
	FString SessionToken; // 0x20
	FDateTime Expiration; // 0x30
};

struct FQuat {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
	float W; // 0xc
};

struct FPlane {
	float W; // 0xc
};

struct FQueryWorkshopForItemsResult {
	FSteamUGCQueryHandle queryHandle; // 0x8
	FUInt32 numResultsReturned; // 0x10
	FUInt32 numMatchingResults; // 0x14
	bool bHasMorePages; // 0x18
	bool bRetrievedDataWasCached; // 0x19
	TArray<FSteamWorkshopItemDetails> items; // 0x20
};

struct FVertexIndexAndInstanceID {
	int32_t ContourIndex; // 0x0
	FVertexInstanceID VertexInstanceID; // 0x4
};

struct FAnimNode_RotationOffsetBlendSpace {
	FPoseLink BasePose; // 0xe8
	int32_t LODThreshold; // 0xf8
	float Alpha; // 0xfc
	FInputScaleBias AlphaScaleBias; // 0x100
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x108
	FName AlphaCurveName; // 0x150
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x158
	EAnimAlphaInputType AlphaInputType; // 0x18c
	bool bAlphaBoolEnabled; // 0x18d
};

struct FDimension {
	FString Name; // 0x0
	FString Value; // 0x10
};

struct FFontData {
	FString FontFilename; // 0x0
	EFontHinting Hinting; // 0x10
	EFontLoadingPolicy LoadingPolicy; // 0x11
	int32_t SubFaceIndex; // 0x14
	UObject* FontFaceAsset; // 0x18
};

struct FNodeObject {
	FName Name; // 0x0
	FName ParentName; // 0x8
};

struct FHLODISMComponentDesc {
	UStaticMesh* StaticMesh; // 0x0
	UMaterialInterface* Material; // 0x8
	TArray<FTransform> Instances; // 0x10
};

struct FSubdividedQuad {
	FSubdividedQuadVertex QuadVertex0; // 0x0
	FSubdividedQuadVertex QuadVertex1; // 0x34
	FSubdividedQuadVertex QuadVertex2; // 0x68
	FSubdividedQuadVertex QuadVertex3; // 0x9c
};

struct FS_ResourceGroup {
	int32_t ManageResourceCount_2_B7A2EEFA466BDE6FC6A95697B858B351; // 0x0
	float ResourceRegenerateTime_5_45004F8E4A63C49CE06F21A31E49AFF6; // 0x4
	TArray<FS_ResourceSpawnInfo> SpawnClassInfo_9_7269D2C04631494236B3129AF58E3BD9; // 0x8
	UTexture2D* Icon_16_E34C19634948C77456198AAA8CEE3E00; // 0x18
	float SpotWorkableInterval_19_FCC35B074FAA91129871D78D75FB181D; // 0x20
	int32_t AtLeastResourceCount_22_64B271C7450BB7EC9A2CC78575D9BD4D; // 0x24
};

struct FSoundClassAdjuster {
	USoundClass* SoundClassObject; // 0x0
	float VolumeAdjuster; // 0x8
	float PitchAdjuster; // 0xc
	float LowPassFilterFrequency; // 0x10
	char bApplyToChildren : 1; // 0x14
	float VoiceCenterChannelVolumeAdjuster; // 0x18
};

struct FNiagaraVariableWithOffset {
	int32_t Offset; // 0xc
};

struct FSteamResult {
	EResultBP Result; // 0x0
};

struct FLevelStreamingStatus {
	FName PackageName; // 0x0
	char bShouldBeLoaded : 1; // 0x8
	char bShouldBeVisible : 1; // 0x8
	uint32_t LODIndex; // 0xc
};

struct FConvertInventory {
	int32_t Index; // 0x0
	float Current; // 0x4
	float Total; // 0x8
	UInventoryComponentBase* ArchivedInventory; // 0x10
};

struct FMovieSceneGeometryCollectionParams {
	FSoftObjectPath GeometryCollectionCache; // 0x8
	FFrameNumber StartFrameOffset; // 0x20
	FFrameNumber EndFrameOffset; // 0x24
	float PlayRate; // 0x28
};

struct FActorComponentInstanceData {
	UObject* SourceComponentTemplate; // 0x8
	EComponentCreationMethod SourceComponentCreationMethod; // 0x10
	int32_t SourceComponentTypeSerializedIndex; // 0x14
	TArray<char> SavedProperties; // 0x18
	FActorComponentDuplicatedObjectData UniqueTransientPackage; // 0x28
	TArray<FActorComponentDuplicatedObjectData> DuplicatedObjects; // 0x38
	TArray<UObject*> ReferencedObjects; // 0x48
	TArray<FName> ReferencedNames; // 0x58
};

struct FCustomAttribute {
	FName Name; // 0x0
	int32_t VariantType; // 0x8
	TArray<float> Times; // 0x10
};

struct FSQSRemovePermissionRequest {
	FString QueueUrl; // 0x0
	FString Label; // 0x10
};

struct FPerPlatformInt {
	int32_t Default; // 0x0
};

struct FSteamUGCQueryParameterTagsAllUser {
	TArray<FString> requiredTags; // 0x10
	TArray<FString> excludedTags; // 0x20
};

struct FMovieSceneNiagaraSystemTrackImplementation {
	FFrameNumber SpawnSectionStartFrame; // 0x10
	FFrameNumber SpawnSectionEndFrame; // 0x14
	ENiagaraSystemSpawnSectionStartBehavior SpawnSectionStartBehavior; // 0x18
	ENiagaraSystemSpawnSectionEvaluateBehavior SpawnSectionEvaluateBehavior; // 0x1c
	ENiagaraSystemSpawnSectionEndBehavior SpawnSectionEndBehavior; // 0x20
	ENiagaraAgeUpdateMode AgeUpdateMode; // 0x24
};

struct FBuilderPoly {
	TArray<int32_t> VertexIndices; // 0x0
	int32_t Direction; // 0x10
	FName ItemName; // 0x14
	int32_t PolyFlags; // 0x1c
};

struct FMovieSceneEvaluationOperand {
	FGuid ObjectBindingId; // 0x0
	FMovieSceneSequenceID SequenceID; // 0x10
};

struct FNiagaraPlatformSetConflictEntry {
	FName ProfileName; // 0x0
	int32_t QualityLevelMask; // 0x8
};

struct FAIDataProviderFloatValue {
	float DefaultValue; // 0x30
};

struct FMovieSceneCameraShakeSectionData {
	UMatineeCameraShake* ShakeClass; // 0x0
	float PlayScale; // 0x8
	ECameraShakePlaySpace PlaySpace; // 0xc
	FRotator UserDefinedPlaySpace; // 0x10
};

struct FLandmarkEffectInfo {
	FText Name; // 0x0
	FText Discription; // 0x18
	FSlateBrush Icon; // 0x30
	FVector CenterLocation; // 0xb8
	bool ShowRange; // 0xc4
	float Radius; // 0xc8
	bool IsNegative; // 0xcc
	float WaitTime; // 0xd0
	float EndTime; // 0xd4
};

struct FInterpGroupActorInfo {
	FName ObjectName; // 0x0
	TArray<AActor*> Actors; // 0x8
};

struct FS_FloatRange {
	float Min_5_D0CC400D49FFCA5ECE2260B6B9CCDC08; // 0x0
	float Max_6_E2F7C97C41ED79A543E25BAC90267B16; // 0x4
};

struct FSourceEffectBitCrusherSettings {
	float CrushedSampleRate; // 0x0
	FSoundModulationDestinationSettings SampleRateModulation; // 0x8
	float CrushedBits; // 0x18
	FSoundModulationDestinationSettings BitModulation; // 0x20
};

struct FAnimNotifyEventReference {
	UObject* NotifySource; // 0x8
};

struct FCustomFieldData {
	FString Key; // 0x0
	FString Value; // 0x10
};

struct FS_MemoryCardInfo {
	int32_t Type_2_7BEE5537445984EF1B782C838E769A3C; // 0x0
	TMap<E_MemoryCardAbilityType, float> Ability_8_6C254C1D4A2456B98C317ABD2DD53207; // 0x8
	int32_t SkillGrade_11_EC7A76D64055316021987BB0D1403C3D; // 0x58
};

struct FAnimNotifyEvent {
	float DisplayTime; // 0x30
	float TriggerTimeOffset; // 0x34
	float EndTriggerTimeOffset; // 0x38
	float TriggerWeightThreshold; // 0x3c
	FName NotifyName; // 0x40
	UAnimNotify* Notify; // 0x48
	UAnimNotifyState* NotifyStateClass; // 0x50
	float Duration; // 0x58
	FAnimLinkableElement EndLink; // 0x60
	bool bConvertedFromBranchingPoint; // 0x90
	EMontageNotifyTickType MontageTickType; // 0x91
	float NotifyTriggerChance; // 0x94
	ENotifyFilterType NotifyFilterType; // 0x98
	int32_t NotifyFilterLOD; // 0x9c
	bool bTriggerOnDedicatedServer; // 0xa0
	bool bTriggerOnFollower; // 0xa1
	int32_t TrackIndex; // 0xa4
};

struct FPropertyAccessSegment {
	FName Name; // 0x0
	UStruct* Struct; // 0x8
	TFieldPath<FProperty> Property; // 0x10
	UFunction* Function; // 0x30
	int32_t ArrayIndex; // 0x38
	uint16_t Flags; // 0x3c
};

struct FS_GridSave {
	FTransform GridTransform_2_571A666C4C810DA6F9ABE6AFE21639E2; // 0x0
	E_BuildTypes GridType_5_BA8599D248184736DC274EA228D94DB9; // 0x30
	FVector GridSize_8_7635BEE04364CFAA11345B96E87D526E; // 0x34
	int32_t GridHashID_12_B4CBF7DE400BC2B8EF40FCAF33E97E69; // 0x40
};

struct FDescribeAlarmHistoryResult {
	TArray<FAlarmHistoryItem> AlarmHistoryItems; // 0x0
	FString NextToken; // 0x10
	FResponseMetadata ResponseMetadata; // 0x20
};

struct FDescribeResourcePoliciesResult {
	TArray<FResourcePolicy> ResourcePolicies; // 0x0
	FString NextToken; // 0x10
};

struct FTextureFormatSettings {
	TextureCompressionSettings CompressionSettings; // 0x0
	char CompressionNoAlpha : 1; // 0x1
	char CompressionNone : 1; // 0x1
	char CompressionYCoCg : 1; // 0x1
	char SRGB : 1; // 0x1
};

struct FGenericStruct {
	int32_t Data; // 0x0
};

struct FGetQueryResultsResult {
	TArray<FResultField> Results; // 0x0
	FQueryStatistics Statistics; // 0x10
	EQueryStatus Status; // 0x40
};

struct FS_MachineArmAbilitySave {
	TMap<int32_t, Fs_RadioGramSave> MachineArmAbilitySave_5_C4C2038048488819F6A4ACAADD739453; // 0x0
};

struct FLightmassDebugOptions {
	char bDebugMode : 1; // 0x0
	char bStatsEnabled : 1; // 0x0
	char bGatherBSPSurfacesAcrossComponents : 1; // 0x0
	float CoplanarTolerance; // 0x4
	char bUseImmediateImport : 1; // 0x8
	char bImmediateProcessMappings : 1; // 0x8
	char bSortMappings : 1; // 0x8
	char bDumpBinaryFiles : 1; // 0x8
	char bDebugMaterials : 1; // 0x8
	char bPadMappings : 1; // 0x8
	char bDebugPaddings : 1; // 0x8
	char bOnlyCalcDebugTexelMappings : 1; // 0x8
	char bUseRandomColors : 1; // 0x9
	char bColorBordersGreen : 1; // 0x9
	char bColorByExecutionTime : 1; // 0x9
	float ExecutionTimeDivisor; // 0xc
};

struct FMachinArmAbilityMain {
	FText MainCategoryName; // 0x8
	int32_t sortOrder; // 0x20
	TArray<FMachinArmAbilitySub> AbilityList; // 0x28
};

struct FListTagsForResourceResultCloudWatch {
	TArray<FCloudWatchTag> Tags; // 0x0
	FResponseMetadata ResponseMetadata; // 0x10
};

struct FAlarmHistoryItem {
	FString AlarmName; // 0x0
	EAlarmType AlarmType; // 0x10
	FDateTime Timestamp; // 0x18
	EHistoryItemType HistoryItemType; // 0x20
	FString HistorySummary; // 0x28
	FString HistoryData; // 0x38
};

struct FPBUF_sv_NameReq {
	FString Name; // 0x0
};

struct FLiveLinkSourceBufferManagementSettings {
	bool bValidEngineTimeEnabled; // 0x0
	float ValidEngineTime; // 0x4
	float EngineTimeOffset; // 0x8
	double EngineTimeClockOffset; // 0x10
	bool bGenerateSubFrame; // 0x18
	FFrameRate DetectedFrameRate; // 0x1c
	bool bUseTimecodeSmoothLatest; // 0x24
	FFrameRate SourceTimecodeFrameRate; // 0x28
	bool bValidTimecodeFrameEnabled; // 0x30
	int32_t ValidTimecodeFrame; // 0x34
	float TimecodeFrameOffset; // 0x38
	double TimecodeClockOffset; // 0x40
	int32_t LatestOffset; // 0x48
	int32_t MaxNumberOfFrameToBuffered; // 0x4c
	bool bKeepAtLeastOneFrame; // 0x50
};

struct FARPlaneUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	FVector Center; // 0x50
	FVector Extents; // 0x5c
	TArray<FVector> BoundaryVertices; // 0x68
	EARObjectClassification ObjectClassification; // 0x78
};

struct FActiveHapticFeedbackEffect {
	UHapticFeedbackEffect_Base* HapticEffect; // 0x0
};

struct FSlateColor {
	FLinearColor SpecifiedColor; // 0x0
	ESlateColorStylingMode ColorUseRule; // 0x10
};

struct FS_MeleeWeaponInfo {
	FDamageStruct DamageStruct_14_D56A143F497BD84F2057F682A88E581C; // 0x0
	float CoolTime_6_A3ABA3924ACDB2A1CF8989AFA1D1DED1; // 0x38
	float Distance_11_5CDDAB724CCB4E2149759E900153E770; // 0x3c
	float Range_13_BB7B12024D6F70442AB9B79D00CF0065; // 0x40
};

struct FTimelineFloatTrack {
	UCurveFloat* FloatCurve; // 0x0
	FDelegate InterpFunc; // 0x8
	FName TrackName; // 0x18
	FName FloatPropertyName; // 0x20
};

struct FIntegralCurve {
	TArray<FIntegralKey> Keys; // 0x68
	int32_t DefaultValue; // 0x78
	bool bUseDefaultValueBeforeFirstKey; // 0x7c
};

struct FS_BuildingSave {
	int32_t UID_43_17B6C7A44A03CC3E3231BB8DCA5A38D5; // 0x0
	FTransform BuildPartTransform_2_92F5576D4245B10D5459A4B0C911ED49; // 0x10
	float CurrentHealth_40_F5572F244A68776F018DFC9A74E87FBE; // 0x40
	TArray<FString> Owners_37_CB0EF97744CCD75DAA63C896B482C466; // 0x48
	FString OriginalOwner_38_96FB0C414512B82FC34BB8AA4E601DCB; // 0x58
	FText BuildPartName_27_B93959C540878D1E4656A48E39878272; // 0x68
	int32_t MeshIdx_30_854BF1014A5963BA52DAB89144F304F1; // 0x80
	FS_FunctionalitySave FunctionalitySave_33_7FE65D7340D4D9DC4F8C14853B16BE01; // 0x88
	FString Password_46_CD5689A441A0D9C989DC3CA02F462966; // 0x178
	E_SecurityType SecurityMode_49_98313AF443C5726414B17C89528F422C; // 0x188
	float DecayProtectReleaseTime_52_ECA5D57D440A39A8830E158CC4165253; // 0x18c
	TArray<FString> RegisterUIDArray_59_54FFFB534FC22284D3DC7AAD65CA379A; // 0x190
};

struct FARCameraIntrinsics {
	FIntPoint ImageResolution; // 0x0
	FVector2D FocalLength; // 0x8
	FVector2D PrincipalPoint; // 0x10
};

struct FFoliageTypeObject {
	UObject* FoliageTypeObject; // 0x0
	UFoliageType* TypeInstance; // 0x8
	bool bIsAsset; // 0x10
	UFoliageType_InstancedStaticMesh* Type; // 0x18
};

struct FDamageStruct {
	UDamageType* DamageType; // 0x0
	float Damage; // 0x8
	float Penetrate; // 0xc
	float KnockbackPower; // 0x10
	bool IsExplosion; // 0x14
	float ExplosionMinimumDamage; // 0x18
	float ExplosionInnerRadius; // 0x1c
	float ExplosionOuterRadius; // 0x20
	float ExplosionDamageFalloff; // 0x24
	TArray<AActor*> ExplosionIgnoreActors; // 0x28
};

struct FIntegralKey {
	float Time; // 0x0
	int32_t Value; // 0x4
};

struct FAkWwiseObjectDetails {
	FString ItemName; // 0x0
	FString ItemPath; // 0x10
	FString ItemId; // 0x20
};

struct FReferenceBoneFrame {
	FBoneReference Bone; // 0x0
	FAxis Axis; // 0x10
};

struct FAnimationActiveTransitionEntry {
	UBlendProfile* BlendProfile; // 0xb8
};

struct FLobbyMapInfo {
	FString RawMapName; // 0x0
	FText MapName; // 0x10
	UTexture2D* MapImage; // 0x28
};

struct FTextureLODGroup {
	TextureGroup Group; // 0x0
	int32_t LODBias; // 0xc
	int32_t LODBias_Smaller; // 0x10
	int32_t LODBias_Smallest; // 0x14
	int32_t NumStreamedMips; // 0x1c
	TextureMipGenSettings MipGenSettings; // 0x20
	int32_t MinLODSize; // 0x24
	int32_t MaxLODSize; // 0x28
	int32_t MaxLODSize_Smaller; // 0x2c
	int32_t MaxLODSize_Smallest; // 0x30
	int32_t OptionalLODBias; // 0x34
	int32_t OptionalMaxLODSize; // 0x38
	FName MinMagFilter; // 0x40
	FName MipFilter; // 0x48
	ETextureMipLoadOptions MipLoadOptions; // 0x50
	bool DuplicateNonOptionalMips; // 0x51
	float Downscale; // 0x54
	ETextureDownscaleOptions DownscaleOptions; // 0x58
	int32_t VirtualTextureTileCountBias; // 0x5c
	int32_t VirtualTextureTileSizeBias; // 0x60
};

struct FLevelSequenceBindingReference {
	FString PackageName; // 0x0
	FSoftObjectPath ExternalObjectPath; // 0x10
	FString ObjectPath; // 0x28
};

struct FCustomizedToolMenuSection {
	ECustomizedToolMenuVisibility Visibility; // 0x0
};

struct FMovieSceneEvaluationTemplateSerialNumber {
	uint32_t Value; // 0x0
};

struct FSQSDeleteMessageBatchResult {
	TArray<FDeleteMessageBatchResultEntry> Successful; // 0x0
	TArray<FBatchResultErrorEntry> Failed; // 0x10
	FSQSResponseMetadata ResponseMetadata; // 0x20
};

struct FPropertyPathSegment {
	FName Name; // 0x0
	int32_t ArrayIndex; // 0x8
	UStruct* Struct; // 0x10
};

struct FAkWindowsAdvancedInitializationSettings {
	bool UseHeadMountedDisplayAudioDevice; // 0x30
	uint32_t MaxSystemAudioObjects; // 0x34
};

struct FLiveLinkBaseStaticData {
	TArray<FName> PropertyNames; // 0x0
};

struct FAnimNode_LinkedAnimLayer {
	UAnimLayerInterface* Interface; // 0xa0
	FName Layer; // 0xa8
};

struct FColorGradePerRangeSettings {
	FVector4 Saturation; // 0x0
	FVector4 Contrast; // 0x10
	FVector4 Gamma; // 0x20
	FVector4 Gain; // 0x30
	FVector4 Offset; // 0x40
};

struct FCheckBoxStyle {
	ESlateCheckBoxType CheckBoxType; // 0x8
	FSlateBrush UncheckedImage; // 0x10
	FSlateBrush UncheckedHoveredImage; // 0x98
	FSlateBrush UncheckedPressedImage; // 0x120
	FSlateBrush CheckedImage; // 0x1a8
	FSlateBrush CheckedHoveredImage; // 0x230
	FSlateBrush CheckedPressedImage; // 0x2b8
	FSlateBrush UndeterminedImage; // 0x340
	FSlateBrush UndeterminedHoveredImage; // 0x3c8
	FSlateBrush UndeterminedPressedImage; // 0x450
	FMargin Padding; // 0x4d8
	FSlateColor ForegroundColor; // 0x4e8
	FSlateColor BorderBackgroundColor; // 0x510
	FSlateSound CheckedSlateSound; // 0x538
	FSlateSound UncheckedSlateSound; // 0x550
	FSlateSound HoveredSlateSound; // 0x568
};

struct FClassicLayoutSettings {
	bool bIsWidgetAtBottom; // 0x0
	bool bIsLoadingWidgetAtLeft; // 0x1
	float Space; // 0x4
	FWidgetAlignment TipAlignment; // 0x8
	EHorizontalAlignment BorderHorizontalAlignment; // 0xa
	FMargin BorderPadding; // 0xc
	FSlateBrush BorderBackground; // 0x20
};

struct FEditorElement {
	int32_t Indices[0x3]; // 0x0
	float Weights[0x3]; // 0xc
};

struct FPhysicalSurfaceName {
	EPhysicalSurface Type; // 0x0
	FName Name; // 0x4
};

struct FStaticSwitchParameter {
	bool Value; // 0x24
};

struct FTViewTarget {
	AActor* Target; // 0x0
	FMinimalViewInfo POV; // 0x10
	APlayerState* PlayerState; // 0x5f0
};

struct FAkAdvancedInitializationSettingsWithMultiCoreRendering {
	bool EnableMultiCoreRendering; // 0x2c
};

struct FNiagaraDataInterfaceGPUParamInfo {
	FString DataInterfaceHLSLSymbol; // 0x0
	FString DIClassName; // 0x10
	TArray<FNiagaraDataInterfaceGeneratedFunction> GeneratedFunctions; // 0x20
};

struct FSolverCollisionData {
	FVector Location; // 0x0
	FVector AccumulatedImpulse; // 0xc
	FVector Normal; // 0x18
	FVector Velocity1; // 0x24
	FVector Velocity2; // 0x30
	FVector AngularVelocity1; // 0x3c
	FVector AngularVelocity2; // 0x48
	float Mass1; // 0x54
	float Mass2; // 0x58
	int32_t ParticleIndex; // 0x5c
	int32_t LevelsetIndex; // 0x60
	int32_t ParticleIndexMesh; // 0x64
	int32_t LevelsetIndexMesh; // 0x68
};

struct FChaosPhysicsCollisionInfo {
	UPrimitiveComponent* Component; // 0x0
	UPrimitiveComponent* OtherComponent; // 0x8
	FVector Location; // 0x10
	FVector Normal; // 0x1c
	FVector AccumulatedImpulse; // 0x28
	FVector Velocity; // 0x34
	FVector OtherVelocity; // 0x40
	FVector AngularVelocity; // 0x4c
	FVector OtherAngularVelocity; // 0x58
	float Mass; // 0x64
	float OtherMass; // 0x68
};

struct FPutLogEventsRequest {
	FString LogGroupName; // 0x0
	FString LogStreamName; // 0x10
	TArray<FInputLogEvent> LogEvents; // 0x20
	FString SequenceToken; // 0x30
};

struct FOutputLogEvent {
	FString Timestamp; // 0x0
	FString Message; // 0x10
	FString IngestionTime; // 0x20
};

struct FEnvQueryRequest {
	UEnvQuery* QueryTemplate; // 0x0
	UObject* Owner; // 0x8
	UWorld* World; // 0x10
};

struct FAnimSlotDesc {
	FName SlotName; // 0x0
	int32_t NumChannels; // 0x8
};

struct FFrameNumberRange {
	FFrameNumberRangeBound LowerBound; // 0x0
	FFrameNumberRangeBound UpperBound; // 0x8
};

struct FMovieSceneAudioSectionTemplate {
	UMovieSceneAudioSection* AudioSection; // 0x20
};

struct FQueuedDrawDebugItem {
	EDrawDebugItemType itemType; // 0x0
	FVector StartLoc; // 0x4
	FVector EndLoc; // 0x10
	FVector Center; // 0x1c
	FRotator Rotation; // 0x28
	float Radius; // 0x34
	float Size; // 0x38
	int32_t Segments; // 0x3c
	FColor Color; // 0x40
	bool bPersistentLines; // 0x44
	float LifeTime; // 0x48
	float Thickness; // 0x4c
	FString Message; // 0x50
	FVector2D TextScale; // 0x60
};

struct FCullDistanceSizePair {
	float Size; // 0x0
	float CullDistance; // 0x4
};

struct FTTTrackBase {
	FName TrackName; // 0x8
	bool bIsExternalCurve; // 0x10
};

struct FExternalToolDefinition {
	FString ToolName; // 0x0
	FFilePath ExecutablePath; // 0x10
	FString CommandLineOptions; // 0x20
	FDirectoryPath WorkingDirectory; // 0x30
	FString ScriptExtension; // 0x40
	FDirectoryPath ScriptDirectory; // 0x50
};

struct FVectorParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel XCurve; // 0x8
	FMovieSceneFloatChannel YCurve; // 0xa8
	FMovieSceneFloatChannel ZCurve; // 0x148
};

struct FMachinArmAbilityItem {
	FText ItemName; // 0x8
	UTexture2D* Icon; // 0x20
	TArray<FItemCodeValue> UnlockCost; // 0x28
	FEditableObjectPrototype Ability; // 0x38
};

struct FAnimNode_CopyBone {
	FBoneReference SourceBone; // 0xc8
	FBoneReference TargetBone; // 0xd8
	bool bCopyTranslation; // 0xe8
	bool bCopyRotation; // 0xe9
	bool bCopyScale; // 0xea
	EBoneControlSpace ControlSpace; // 0xeb
};

struct FPooledCameraShakes {
	TArray<UCameraShakeBase*> PooledShakes; // 0x0
};

struct FInAppPurchaseProductInfo2 {
	FString Identifier; // 0x0
	FString TransactionIdentifier; // 0x10
	FString DisplayName; // 0x20
	FString DisplayDescription; // 0x30
	FString DisplayPrice; // 0x40
	float RawPrice; // 0x50
	FString CurrencyCode; // 0x58
	FString CurrencySymbol; // 0x68
	FString DecimalSeparator; // 0x78
	FString GroupingSeparator; // 0x88
	FString ReceiptData; // 0x98
	TMap<FString, FString> DynamicFields; // 0xa8
};

struct FClassReplicationInfo {
	float DistancePriorityScale; // 0x0
	float StarvationPriorityScale; // 0x4
	float AccumulatedNetPriorityBias; // 0x8
	uint16_t ReplicationPeriodFrame; // 0xc
	uint16_t FastPath_ReplicationPeriodFrame; // 0xe
	uint16_t ActorChannelFrameTimeout; // 0x10
	float CullDistance; // 0x68
	float CullDistanceSquared; // 0x6c
};

struct FElementID {
	int32_t IDValue; // 0x0
};

struct FNPCSpawnInfoLandmarkStatus {
	ELMStatus Status; // 0x8
	int32_t Phase; // 0xc
	TMap<FName, int32_t> SpawnMonsters; // 0x10
};

struct FConvertItem {
	float Total; // 0x8
	TArray<FItemCodeValue> Ouput; // 0x10
};

struct FWorldContext {
	FURL LastURL; // 0xd0
	FURL LastRemoteURL; // 0x138
	UPendingNetGame* PendingNetGame; // 0x1a0
	TArray<FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0x1a8
	TArray<ULevel*> LoadedLevelsForPendingMapChange; // 0x1c8
	TArray<UObjectReferencer*> ObjectReferencers; // 0x1f0
	TArray<FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0x200
	UGameViewportClient* GameViewport; // 0x210
	UGameInstance* OwningGameInstance; // 0x218
	TArray<FNamedNetDriver> ActiveNetDrivers; // 0x220
};

struct FKConvexElem {
	TArray<FVector> VertexData; // 0x30
	TArray<int32_t> IndexData; // 0x40
	FBox ElemBox; // 0x50
	FTransform Transform; // 0x70
};

struct FAnimationRecordingSettings {
	bool bRecordInWorldSpace; // 0x0
	bool bRemoveRootAnimation; // 0x1
	bool bAutoSaveAsset; // 0x2
	float SampleRate; // 0x4
	float Length; // 0x8
	ERichCurveInterpMode InterpMode; // 0xc
	ERichCurveTangentMode TangentMode; // 0xd
	bool bRecordTransforms; // 0xf
	bool bRecordCurves; // 0x10
};

struct FNCPool {
	TArray<FNCPoolElement> FreeElements; // 0x0
	TArray<UNiagaraComponent*> InUseComponents_Auto; // 0x10
	TArray<UNiagaraComponent*> InUseComponents_Manual; // 0x20
};

struct FClothCollisionPrim_Box {
	FVector LocalPosition; // 0x0
	FQuat LocalRotation; // 0x10
	FVector HalfExtents; // 0x20
	int32_t BoneIndex; // 0x2c
};

struct FSliderStyle {
	FSlateBrush NormalBarImage; // 0x8
	FSlateBrush HoveredBarImage; // 0x90
	FSlateBrush DisabledBarImage; // 0x118
	FSlateBrush NormalThumbImage; // 0x1a0
	FSlateBrush HoveredThumbImage; // 0x228
	FSlateBrush DisabledThumbImage; // 0x2b0
	float BarThickness; // 0x338
};

struct FVOscillator {
	FFOscillator X; // 0x0
	FFOscillator Y; // 0xc
	FFOscillator Z; // 0x18
};

struct FDragonData_FingerData {
	FName Finger_Bone_Name; // 0x0
	float Trace_Scale; // 0x8
	FVector Trace_Offset; // 0xc
	bool Is_Finger_Backward; // 0x18
};

struct FMovieSceneSectionGroup {
	TArray<TWeakObjectPtr<UMovieSceneSection>> Sections; // 0x0
};

struct FEyeTrackerStereoGazeData {
	FVector LeftEyeOrigin; // 0x0
	FVector LeftEyeDirection; // 0xc
	FVector RightEyeOrigin; // 0x18
	FVector RightEyeDirection; // 0x24
	FVector FixationPoint; // 0x30
	float ConfidenceValue; // 0x3c
};

struct FS_SaveStorage {
	FString StorageName_13_5699D3204887CBC0B07539B35E8FFF0F; // 0x0
	TArray<FS_SaveInv> StorageInventory_14_03F981B0456B09CDF99FEAA31905E0B8; // 0x10
	float StorageWaight_15_2A8DF0324EEE55CFA3DCA7AD3CB8FF83; // 0x20
	int32_t StorageSlots_16_FAD9C23F4CE444C380E35ABDE0333026; // 0x24
	TArray<FS_SaveWeaponInvs> StorageWepInventory_17_ABB275864AE94F8FCEDBFE86240E6FCB; // 0x28
	FTransform StorageLocation_20_A4FF99D54EFC3266560378B2ECA08B71; // 0x40
};

struct FSetAlarmStateRequest {
	FString AlarmName; // 0x0
	EStateValue StateValue; // 0x10
	FString StateReason; // 0x18
	FString StateReasonData; // 0x28
};

struct FDonNavigationDynamicCollisionNotifyee {
	FDelegate Listener; // 0x0
};

struct FMovieSceneEventPtrs {
	UFunction* Function; // 0x0
	TFieldPath<FProperty> BoundObjectProperty; // 0x8
};

struct FEdGraphSchemaAction_NewNode {
	UEdGraphNode* NodeTemplate; // 0x100
};

struct FS_OccupyBoxReplicate {
	bool IsOccupyed_1_C107056A4AADC978260B0EA0C83FF92B; // 0x0
	UBP_PlayerInventoryComponent_C* BoxOwner_11_7FFAE8214F4ABEF778B7D78212A6F4F3; // 0x8
	bool IsIn_14_28352AC840C099FCCC126CAA12B4A1C8; // 0x10
	int32_t CurrentOccupyTime_4_1805C0A74E06A635555ADFAD8361070D; // 0x14
	float ResetOccupyTime_7_759C285D4F18497639B2D38E89FF4013; // 0x18
	bool IsOpen_16_339EDCDA4B36721380AD76A3723D8252; // 0x1c
	bool Conflict_18_7DFA3289403EF83CFC7B5899B99E02E1; // 0x1d
};

struct FMaterialSpriteElement {
	UMaterialInterface* Material; // 0x0
	UCurveFloat* DistanceToOpacityCurve; // 0x8
	char bSizeIsInScreenSpace : 1; // 0x10
	float BaseSizeX; // 0x14
	float BaseSizeY; // 0x18
	UCurveFloat* DistanceToSizeCurve; // 0x20
};

struct FDisableInsightRulesResult {
	TArray<FPartialFailure> Failures; // 0x0
	FResponseMetadata ResponseMetadata; // 0x10
};

struct FOnlineProxyStoreOffer {
	FString OfferId; // 0x0
	FText title; // 0x10
	FText Description; // 0x28
	FText LongDescription; // 0x40
	FText RegularPriceText; // 0x58
	int32_t RegularPrice; // 0x70
	FText PriceText; // 0x78
	int32_t NumericPrice; // 0x90
	FString CurrencyCode; // 0x98
	FDateTime ReleaseDate; // 0xa8
	FDateTime ExpirationDate; // 0xb0
	EOnlineProxyStoreOfferDiscountType DiscountType; // 0xb8
	TMap<FString, FString> DynamicFields; // 0xc0
};

struct FBrushEffectCurlNoise {
	float Curl1Amount; // 0x0
	float Curl2Amount; // 0x4
	float Curl1Tiling; // 0x8
	float Curl2Tiling; // 0xc
};

struct FCustomAttributeSetting {
	FString Name; // 0x0
	FString Meaning; // 0x10
};

struct FLevelSequenceSnapshotSettings {
	char ZeroPadAmount; // 0x0
	FFrameRate FrameRate; // 0x4
};

struct FAITouchEvent {
	AActor* TouchReceiver; // 0x10
	AActor* OtherActor; // 0x18
};

struct FBPSteamGroupOfficer {
	FBPUniqueNetId OfficerUniqueNetID; // 0x0
	bool bIsOwner; // 0x20
};

struct FDescribeAnomalyDetectorsRequest {
	FString NextToken; // 0x0
	int32_t MaxResults; // 0x10
	FString Namespace; // 0x18
	FString MetricName; // 0x28
	TArray<FDimension> Dimensions; // 0x38
};

struct FNiagaraParameters {
	TArray<FNiagaraVariable> Parameters; // 0x0
};

struct FFilterLogEventsResult {
	TArray<FFilteredLogEvent> Events; // 0x0
	TArray<FSearchedLogStream> SearchedLogStreams; // 0x10
	FString NextToken; // 0x20
};

struct FCustomizableObjectFloatParameterValue {
	FString ParameterName; // 0x0
	float ParameterValue; // 0x10
	FString UID; // 0x18
	TArray<float> ParameterRangeValues; // 0x28
};

struct FConstraintInstance {
	FName JointName; // 0x18
	FName ConstraintBone1; // 0x20
	FName ConstraintBone2; // 0x28
	FVector Pos1; // 0x30
	FVector PriAxis1; // 0x3c
	FVector SecAxis1; // 0x48
	FVector Pos2; // 0x54
	FVector PriAxis2; // 0x60
	FVector SecAxis2; // 0x6c
	FRotator AngularRotationOffset; // 0x78
	char bScaleLinearLimits : 1; // 0x84
	FConstraintProfileProperties ProfileInstance; // 0x8c
};

struct FGrainTableEntry {
	int32_t SampleIndex; // 0x0
	float RPM; // 0x4
};

struct FMagicLeapMeshBlockInfo {
	FGuid BlockID; // 0x0
	FVector BlockPosition; // 0x10
	FRotator BlockOrientation; // 0x1c
	FVector BlockDimensions; // 0x28
	FTimespan Timestamp; // 0x38
	EMagicLeapMeshState BlockState; // 0x40
};

struct FOrientedBox {
	FVector Center; // 0x0
	FVector AxisX; // 0xc
	FVector AxisY; // 0x18
	FVector AxisZ; // 0x24
	float ExtentX; // 0x30
	float ExtentY; // 0x34
	float ExtentZ; // 0x38
};

struct FPurchaseConfirmation {
	FString PackageName; // 0x10
	PurchaseType Type; // 0x48
};

struct FS_MinMax {
	int32_t Min_2_EF76217548185B18FAC7A8A5D2D0D414; // 0x0
	int32_t Max_4_022044F04C25056D313917B68E8CF5B6; // 0x4
};

struct FLiveLinkWorldTime {
	double Time; // 0x0
	double Offset; // 0x8
};

struct FCustomizableObjectTextureParameterValue {
	FString ParameterName; // 0x0
	uint64_t ParameterValue; // 0x10
	FString UID; // 0x18
};

struct FInsightRuleContributor {
	TArray<FString> Keys; // 0x0
	float ApproximateAggregateValue; // 0x10
	TArray<FInsightRuleContributorDatapoint> Datapoints; // 0x18
};

struct FLiveLinkInterpolationSettings {
	bool bUseInterpolation; // 0x0
	float InterpolationOffset; // 0x4
};

struct FSQSGetQueueUrlRequest {
	FString QueueName; // 0x0
	FString QueueOwnerAWSAccountId; // 0x10
};

struct FS_VehicleSpawner {
	TArray<FS_SaveVehicle> Vehicles_12_B67962BA4B308F1CEE6266971D21C5ED; // 0x0
};

struct FSkeletalMeshLODInfo {
	FPerPlatformFloat ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	TArray<int32_t> LODMaterialMap; // 0x8
	FSkeletalMeshBuildSettings BuildSettings; // 0x18
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x2c
	TArray<FBoneReference> BonesToRemove; // 0x68
	TArray<FBoneReference> BonesToPrioritize; // 0x78
	float WeightOfPrioritization; // 0x88
	UAnimSequence* BakePose; // 0x90
	UAnimSequence* BakePoseOverride; // 0x98
	FString SourceImportFilename; // 0xa0
	ESkinCacheUsage SkinCacheUsage; // 0xb0
	char bHasBeenSimplified : 1; // 0xb1
	char bHasPerLODVertexColors : 1; // 0xb1
	char bAllowCPUAccess : 1; // 0xb1
	char bSupportUniformlyDistributedSampling : 1; // 0xb1
};

struct FMovieSceneCameraShakeSourceTriggerChannel {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneCameraShakeSourceTrigger> KeyValues; // 0x18
};

struct FAnimNode_ApplyMeshSpaceAdditive {
	FPoseLink Base; // 0x10
	FPoseLink Additive; // 0x20
	EAnimAlphaInputType AlphaInputType; // 0x30
	float Alpha; // 0x34
	char bAlphaBoolEnabled : 1; // 0x38
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
	FName AlphaCurveName; // 0x88
	FInputScaleBias AlphaScaleBias; // 0x90
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x98
	int32_t LODThreshold; // 0xc8
};

struct FS_SaveEquipment {
	E_EquipmentCategorys EquipmentSlot_4_8DB9C1994352A4CC87ACE68FA3098C36; // 0x0
	FS_SaveInv EquipmentItem_5_5B04D1BE4FCB21346FEBF4948F3B076C; // 0x8
};

struct FRefraction {
	float CriticalAngleDot_46_AC647E804AD8FF66DC479DBEE451B83D; // 0x0
	float CriticalAngleWidth_47_312D7DB140157D72C96AFF8CF5729D66; // 0x4
	float CriticalAngleBendWidth_48_D915AA5E48130D8B0506EFA66AF77424; // 0x8
	float RefractionBottomAmount_49_4D07E26B418E2200A6F8F8B3828E51EE; // 0xc
	float LipRefraction_53_DE882A664AA5A2C72A36E3A4975B120A; // 0x10
};

struct FMemberReference {
	UObject* MemberParent; // 0x0
	FString MemberScope; // 0x8
	FName MemberName; // 0x18
	FGuid MemberGuid; // 0x20
	bool bSelfContext; // 0x30
	bool bWasDeprecated; // 0x31
};

struct FTransformConstraint {
	FConstraintDescription Operator; // 0x0
	FName SourceNode; // 0x10
	FName TargetNode; // 0x18
	float Weight; // 0x20
	bool bMaintainOffset; // 0x24
};

struct FArchiveItemInfo {
	FItemInventory ItemInfo; // 0x0
	FWeaponInventory WeaponInfo; // 0x38
	bool bReceived; // 0x60
};

struct FAwsSQSCredentials {
	FString AccessKeyId; // 0x0
	FString SecretKey; // 0x10
	FString SessionToken; // 0x20
	FDateTime Expiration; // 0x30
};

struct FTransformBaseConstraint {
	TArray<FRigTransformConstraint> TransformConstraints; // 0x0
};

struct FInputChord {
	FKey Key; // 0x0
	char bShift : 1; // 0x18
	char bCtrl : 1; // 0x18
	char bAlt : 1; // 0x18
	char bCmd : 1; // 0x18
};

struct FAnimPhysSphericalLimit {
	FBoneReference DrivingBone; // 0x0
	FVector SphereLocalOffset; // 0x10
	float LimitRadius; // 0x1c
	ESphericalLimitType LimitType; // 0x20
};

struct FNiagaraSystemScalabilitySettings {
	FNiagaraPlatformSet Platforms; // 0x0
	char bCullByDistance : 1; // 0x30
	char bCullMaxInstanceCount : 1; // 0x30
	char bCullPerSystemMaxInstanceCount : 1; // 0x30
	char bCullByMaxTimeWithoutRender : 1; // 0x30
	float MaxDistance; // 0x34
	int32_t MaxInstances; // 0x38
	int32_t MaxSystemInstances; // 0x3c
	float MaxTimeWithoutRender; // 0x40
};

struct FGaussianSumBloomSettings {
	float Intensity; // 0x0
	float Threshold; // 0x4
	float SizeScale; // 0x8
	float Filter1Size; // 0xc
	float Filter2Size; // 0x10
	float Filter3Size; // 0x14
	float Filter4Size; // 0x18
	float Filter5Size; // 0x1c
	float Filter6Size; // 0x20
	FLinearColor Filter1Tint; // 0x24
	FLinearColor Filter2Tint; // 0x34
	FLinearColor Filter3Tint; // 0x44
	FLinearColor Filter4Tint; // 0x54
	FLinearColor Filter5Tint; // 0x64
	FLinearColor Filter6Tint; // 0x74
};

struct FAnimationSetup {
	UAnimSequence* AnimSequence; // 0x0
	UAnimSharingStateInstance* AnimBlueprint; // 0x8
	FPerPlatformInt NumRandomizedInstances; // 0x10
	FPerPlatformBool Enabled; // 0x14
};

struct FCloudWatchTag {
	FString Key; // 0x0
	FString Value; // 0x10
};

struct FDescribeAlarmsRequest {
	TArray<FString> AlarmNames; // 0x0
	FString AlarmNamePrefix; // 0x10
	TArray<EAlarmType> AlarmTypes; // 0x20
	FString ChildrenOfAlarmName; // 0x30
	FString ParentsOfAlarmName; // 0x40
	EStateValue StateValue; // 0x50
	FString ActionPrefix; // 0x58
	int32_t MaxRecords; // 0x68
	FString NextToken; // 0x70
};

struct FSlotAnimationTrack {
	FName SlotName; // 0x0
	FAnimTrack AnimTrack; // 0x8
};

struct FAnimNode_CopyBoneDelta {
	FBoneReference SourceBone; // 0xc8
	FBoneReference TargetBone; // 0xd8
	bool bCopyTranslation; // 0xe8
	bool bCopyRotation; // 0xe9
	bool bCopyScale; // 0xea
	CopyBoneDeltaMode CopyMode; // 0xeb
	float TranslationMultiplier; // 0xec
	float RotationMultiplier; // 0xf0
	float ScaleMultiplier; // 0xf4
};

struct FS_NPCSpawnCmd {
	APawn* SpawnedClass_2_53D6ECC748A62F38A8B177AE1F7576EA; // 0x0
	float RealSpawnTime_11_03B73A0742FDC97D575C3C80C6AF88F2; // 0x8
};

struct FCustomizableObjectIdentifier {
	FString CustomizableObjectGroupName; // 0x0
	FString CustomizableObjectName; // 0x10
	FString Guid; // 0x20
};

struct FChildActorComponentInstanceData {
	AActor* ChildActorClass; // 0xb8
	FName ChildActorName; // 0xc0
	TArray<FChildActorAttachedActorInfo> AttachedActors; // 0xc8
};

struct FOutgameCoordinatorUrl {
	FString kakao_main; // 0x0
	FString rm_main; // 0x10
	FString rm_develop; // 0x20
	FString kakaodev_alpha; // 0x30
	FString kakaodev_beta; // 0x40
	FString kakaodev_live; // 0x50
	FString rmdev_alpha; // 0x60
	FString rmdev_beta; // 0x70
	FString rmdev_live; // 0x80
};

struct FPlayerMuteList {
	bool bHasVoiceHandshakeCompleted; // 0x30
	int32_t VoiceChannelIdx; // 0x34
};

struct FProceduralFoliageInstance {
	FQuat Rotation; // 0x0
	FVector Location; // 0x10
	float Age; // 0x1c
	FVector Normal; // 0x20
	float Scale; // 0x2c
	UFoliageType* Type; // 0x30
};

struct FLevelSequenceBindingReferences {
	TMap<FGuid, FLevelSequenceBindingReferenceArray> BindingIdToReferences; // 0x0
	TSet<FGuid> AnimSequenceInstances; // 0x50
};

struct FKeyBind {
	FKey Key; // 0x0
	FString Command; // 0x18
	char Control : 1; // 0x28
	char Shift : 1; // 0x28
	char Alt : 1; // 0x28
	char Cmd : 1; // 0x28
	char bIgnoreCtrl : 1; // 0x28
	char bIgnoreShift : 1; // 0x28
	char bIgnoreAlt : 1; // 0x28
	char bIgnoreCmd : 1; // 0x28
	char bDisabled : 1; // 0x29
};

struct FAIDataProviderBoolValue {
	bool DefaultValue; // 0x30
};

struct FLandmarkMonsterSpawnInfo {
	ELMStatus Status; // 0x8
	int32_t Phase; // 0xc
	TMap<FName, int32_t> SpawnInfo; // 0x10
};

struct FChaosTrailingEventData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	FVector AngularVelocity; // 0x18
	float Mass; // 0x24
	int32_t ParticleIndex; // 0x28
};

struct FFontImportOptionsData {
	FString FontName; // 0x0
	float Height; // 0x10
	char bEnableAntialiasing : 1; // 0x14
	char bEnableBold : 1; // 0x14
	char bEnableItalic : 1; // 0x14
	char bEnableUnderline : 1; // 0x14
	char bAlphaOnly : 1; // 0x14
	EFontImportCharacterSet CharacterSet; // 0x18
	FString Chars; // 0x20
	FString UnicodeRange; // 0x30
	FString CharsFilePath; // 0x40
	FString CharsFileWildcard; // 0x50
	char bCreatePrintableOnly : 1; // 0x60
	char bIncludeASCIIRange : 1; // 0x60
	FLinearColor ForegroundColor; // 0x64
	char bEnableDropShadow : 1; // 0x74
	int32_t TexturePageWidth; // 0x78
	int32_t TexturePageMaxHeight; // 0x7c
	int32_t XPadding; // 0x80
	int32_t YPadding; // 0x84
	int32_t ExtendBoxTop; // 0x88
	int32_t ExtendBoxBottom; // 0x8c
	int32_t ExtendBoxRight; // 0x90
	int32_t ExtendBoxLeft; // 0x94
	char bEnableLegacyMode : 1; // 0x98
	int32_t Kerning; // 0x9c
	char bUseDistanceFieldAlpha : 1; // 0xa0
	int32_t DistanceFieldScaleFactor; // 0xa4
	float DistanceFieldScanRadiusScale; // 0xa8
};

struct FSourceEffectMidSideSpreaderSettings {
	float SpreadAmount; // 0x0
	EStereoChannelMode InputMode; // 0x4
	EStereoChannelMode OutputMode; // 0x5
	bool bEqualPower; // 0x6
};

struct FBlueprintComponentDelegateBinding {
	FName ComponentPropertyName; // 0x0
	FName DelegatePropertyName; // 0x8
	FName FunctionNameToBind; // 0x10
};

struct FBPFriendInfo {
	FString DisplayName; // 0x0
	FString RealName; // 0x10
	EBPOnlinePresenceState OnlineState; // 0x20
	FBPUniqueNetId UniqueNetId; // 0x28
	bool bIsPlayingSameGame; // 0x48
	FBPFriendPresenceInfo PresenceInfo; // 0x50
};

struct FEdGraphTerminalType {
	FName TerminalCategory; // 0x0
	FName TerminalSubCategory; // 0x8
	TWeakObjectPtr<UObject> TerminalSubCategoryObject; // 0x10
	bool bTerminalIsConst; // 0x18
	bool bTerminalIsWeakPointer; // 0x19
	bool bTerminalIsUObjectWrapper; // 0x1a
};

struct FSubtitleCue {
	FText Text; // 0x0
	float Time; // 0x18
};

struct FS_ForbiddenKeyword {
	FString Keyword_2_98CDDDDC42305B04BDD1DDA72E3F9637; // 0x0
};

struct FAIDynamicParam {
	FName ParamName; // 0x0
	EAIParamType ParamType; // 0x8
	float Value; // 0xc
	FBlackboardKeySelector BBKey; // 0x10
};

struct FStreamingTextureBuildInfo {
	uint32_t PackedRelativeBox; // 0x0
	int32_t TextureLevelIndex; // 0x4
	float TexelFactor; // 0x8
};

struct FPutCompositeAlarmRequest {
	bool bActionsEnabled; // 0x0
	TArray<FString> AlarmActions; // 0x8
	FString AlarmDescription; // 0x18
	FString AlarmName; // 0x28
	FString AlarmRule; // 0x38
	TArray<FString> InsufficientDataActions; // 0x48
	TArray<FString> OKActions; // 0x58
	TArray<FTagCloudWatch> Tags; // 0x68
};

struct FSplineCurves {
	FInterpCurveVector Position; // 0x0
	FInterpCurveQuat Rotation; // 0x18
	FInterpCurveVector Scale; // 0x30
	FInterpCurveFloat ReparamTable; // 0x48
	USplineMetadata* MetaData; // 0x60
	uint32_t Version; // 0x68
};

struct FS_ResourceVisibleComponents {
	float ResourcesRatio_16_513067664FAF0C83A2D5EDBA69774E56; // 0x0
	TArray<FName> VisibleComponentNames_13_BDCD49E740531B0A6AC1C7B61ABDC428; // 0x8
	TArray<UPrimitiveComponent*> VisibleComponents_14_EB25EE99403986686F8CF092293D3AB5; // 0x18
};

struct FS_MachineArmCustomizationInfo {
	TArray<TSoftObjectPtr<UMaterialInterface>> ChestMachineArmOverrideMaterials_22_0F81BE2643F881AF48191E9ED4C7791E; // 0x0
	TSoftObjectPtr<UMaterialInterface> MachineArmMeshOverrideMaterial_29_8817140B448C25B35EEA6292305B50EE; // 0x10
};

struct FIntValueFromDataTable {
	int32_t Value; // 0x20
};

struct FSlotEvaluationPose {
	EAdditiveAnimationType AdditiveType; // 0x0
	float Weight; // 0x4
};

struct FEventTrackKey {
	float Time; // 0x0
	FName EventName; // 0x4
};

struct FWeightmapLayerAllocationInfo {
	ULandscapeLayerInfoObject* LayerInfo; // 0x0
	char WeightmapTextureIndex; // 0x8
	char WeightmapTextureChannel; // 0x9
};

struct FMovieSceneSequenceLoopCount {
	int32_t Value; // 0x0
};

struct FStopQueryRequest {
	FString QueryID; // 0x0
};

struct FGeomSelection {
	int32_t Type; // 0x0
	int32_t Index; // 0x4
	int32_t SelectionIndex; // 0x8
};

struct FAkAcousticSurface {
	uint32_t Texture; // 0x0
	float Occlusion; // 0x4
	FString Name; // 0x8
};

struct FDragonData_ArmsData {
	FBoneReference Shoulder_Bone_Name; // 0x0
	FBoneReference Elbow_Bone_Name; // 0x10
	FBoneReference Hand_Bone_Name; // 0x20
	FVector Local_Direction_Axis; // 0x30
	FVector Arm_Aiming_Offset; // 0x3c
	bool accurate_hand_rotation; // 0x48
	bool relative_axis; // 0x49
	float Maximum_Extension; // 0x4c
	float Minimum_Extension; // 0x50
	FVector Elbow_Pole_Offset; // 0x54
	bool override_limits; // 0x60
	FVector2D Max_Arm_H_Angle; // 0x64
	FVector2D Max_Arm_V_Angle; // 0x6c
};

struct FKSphylElem {
	FVector Center; // 0x30
	FRotator Rotation; // 0x3c
	float Radius; // 0x48
	float Length; // 0x4c
};

struct FDeleteResourcePolicyRequestLogs {
	FString PolicyName; // 0x0
};

struct FGetMetricStatisticsResult {
	FString Label; // 0x0
	TArray<FDatapoint> Datapoints; // 0x10
	FResponseMetadata ResponseMetadata; // 0x20
};

struct FBackgroundSettings {
	TArray<FSoftObjectPath> Images; // 0x0
	EStretch ImageStretch; // 0x10
	FMargin Padding; // 0x14
	FLinearColor BackgroundColor; // 0x24
	bool bSetDisplayBackgroundManually; // 0x34
};

struct FMovieSceneNiagaraBoolParameterSectionTemplate {
	FMovieSceneBoolChannel BoolChannel; // 0x40
};

struct FStructSerializerNumericTestStruct {
	int8_t Int8; // 0x0
	int16_t Int16; // 0x2
	int32_t Int32; // 0x4
	int64_t Int64; // 0x8
	char UInt8; // 0x10
	uint16_t UInt16; // 0x12
	uint32_t UInt32; // 0x14
	uint64_t UInt64; // 0x18
	float Float; // 0x20
	double Double; // 0x28
};

struct FGetLogRecordRequest {
	FString LogRecordPointer; // 0x0
};

struct FLandmarkDialogueByStatus {
	ELMStatus Situation; // 0x8
	TArray<FDialogueTable> Dialogues; // 0x10
};

struct FRuntimeVirtualTextureParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	URuntimeVirtualTexture* ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x18
};

struct FInterpCurveVector2D {
	TArray<FInterpCurvePointVector2D> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FLiveLinkTransformBlueprintData {
	FLiveLinkTransformStaticData StaticData; // 0x8
	FLiveLinkTransformFrameData FrameData; // 0x20
};

struct FPutAnomalyDetectorResult {
	FResponseMetadata ResponseMetadata; // 0x0
};

struct FLobbyParams {
	FString LobbyName; // 0x0
	FString HostSID; // 0x10
	float CT; // 0x20
	int32_t MaxPlayers; // 0x24
	int32_t StageIdx; // 0x28
	EIFOGameType IFOGameType; // 0x2c
};

struct FDescribeAlarmsResult {
	TArray<FCompositeAlarm> CompositeAlarms; // 0x0
	TArray<FMetricAlarm> MetricAlarms; // 0x10
	FString NextToken; // 0x20
	FResponseMetadata ResponseMetadata; // 0x30
};

struct FPutMetricFilterRequest {
	FString LogGroupName; // 0x0
	FString FilterName; // 0x10
	FString FilterPattern; // 0x20
	TArray<FMetricTransformation> MetricTransformations; // 0x30
};

struct FMTDResult {
	FVector Direction; // 0x0
	float Distance; // 0xc
};

struct FMirrorBone {
	FName BoneName; // 0x0
	EAxis MirrorAxis; // 0x8
	EAxis FlipAxis; // 0x9
	FRotator RotationOffset; // 0xc
	bool IsTwinBone; // 0x18
	FName TwinBoneName; // 0x1c
	bool MirrorTranslation; // 0x24
};

struct FSendMessageBatchRequestEntry {
	FString ID; // 0x0
	FString MessageBody; // 0x10
	int32_t DelaySeconds; // 0x20
	TMap<FString, FMessageAttributeValue> MessageAttributes; // 0x28
	TMap<EMessageSystemAttributeNameForSends, FMessageSystemAttributeValue> MessageSystemAttributes; // 0x78
	FString MessageDeduplicationId; // 0xc8
	FString MessageGroupId; // 0xd8
};

struct FActorSequenceObjectReferences {
	TArray<FActorSequenceObjectReference> Array; // 0x0
};

struct FS_DeadPlayerSave {
	FString PlayerUID_96_B504DED64EB9E452F10E27BB0A4844B9; // 0x0
	FString DeadReason_87_4B05F877445AF205CADF1F8A7851F29A; // 0x10
	FVector DeadPoint_92_51AC937F4553D938850445B33F286F2B; // 0x20
	float AliveTime_95_96BB899E468CD04C3F2E9687D23F2781; // 0x2c
	TArray<FS_HealthChangeSummary> DeathRecap_102_737040F842809D6DCC11BDA4925BE45F; // 0x30
	FS_PlayerInfoSummary KillerInfosummary_106_77D275E54218661F33CE8886A0651A54; // 0x40
};

struct FIntPair {
	int32_t int1; // 0x0
	int32_t int2; // 0x4
};

struct FUpdateWorkshopItemResult {
	bool bUserNeedsToAcceptWorkshopLegalAgreement; // 0x10
};

struct FS_VehicleInfo {
	FName Name_8_B7EB7CA74FF86B01941389A6D558AEBD; // 0x0
	TMap<E_VehicleInteractionType, FS_VehicleRepairInfo> VehicleRepairItem_26_D500CC6E4D1D871BCBE56BB577686CA8; // 0x8
	FItemCodeValueArray VehicleChargeItem_33_9472BD144174D0EDAC9204BD18ADAF76; // 0x58
	int32_t VehicleChargeAmount_36_06631C404D61584633668498DC8953C4; // 0x70
};

struct FCustomizedToolMenu {
	FName Name; // 0x0
	TMap<FName, FCustomizedToolMenuEntry> Entries; // 0x8
	TMap<FName, FCustomizedToolMenuSection> Sections; // 0x58
	TMap<FName, FCustomizedToolMenuNameArray> EntryOrder; // 0xa8
	TArray<FName> SectionOrder; // 0xf8
};

struct FUserFavoriteItemChangedResult {
	bool bWasAddRequest; // 0x10
};

struct FNiagaraHalfVector4 {
	uint16_t X; // 0x0
	uint16_t Y; // 0x2
	uint16_t Z; // 0x4
	uint16_t W; // 0x6
};

struct FPBUF_sv_SetDedicatedServerReadyRes {
	FString State; // 0x0
};

struct FParticleCurvePair {
	FString CurveName; // 0x0
	UObject* CurveObject; // 0x10
};

struct FQuartzPulseOverrideStep {
	int32_t NumberOfPulses; // 0x0
	EQuartzCommandQuantization PulseDuration; // 0x4
};

struct FMovieSceneEventChannel {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneEvent> KeyValues; // 0x18
};

struct FNavGraphNode {
	UObject* Owner; // 0x0
};

struct FPerBoneInterpolation {
	FBoneReference BoneReference; // 0x0
	float InterpolationSpeedPerSec; // 0x10
};

struct FAnomalyDetector {
	FString Namespace; // 0x0
	FString MetricName; // 0x10
	TArray<FDimension> Dimensions; // 0x20
	FString Stat; // 0x30
	FAnomalyDetectorConfiguration Configuration; // 0x40
	EAnomalyDetectorStateValue StateValue; // 0x60
};

struct FDynamicTextureInstance {
	UTexture2D* Texture; // 0x28
	bool bAttached; // 0x30
	float OriginalRadius; // 0x34
};

struct FInAppPurchaseRestoreInfo2 {
	FString ItemName; // 0x0
	FString ItemId; // 0x10
	FString ValidationInfo; // 0x20
};

struct FActorLayer {
	FName Name; // 0x0
};

struct FLandscapeLayer {
	FGuid Guid; // 0x0
	FName Name; // 0x10
	bool bVisible; // 0x18
	bool bLocked; // 0x19
	float HeightmapAlpha; // 0x1c
	float WeightmapAlpha; // 0x20
	ELandscapeBlendMode BlendMode; // 0x24
	TArray<FLandscapeLayerBrush> Brushes; // 0x28
	TMap<ULandscapeLayerInfoObject*, bool> WeightmapLayerAllocationBlend; // 0x38
};

struct FGeometryCollectionSource {
	FSoftObjectPath SourceGeometryObject; // 0x0
	FTransform LocalTransform; // 0x20
	TArray<UMaterialInterface*> SourceMaterial; // 0x50
};

struct FLiveLinkCurveConversionSettings {
	TMap<FString, FSoftObjectPath> CurveConversionAssetMap; // 0x0
};

struct FSQSListQueueTagsResult {
	TMap<FString, FString> Tags; // 0x0
	FSQSResponseMetadata ResponseMetadata; // 0x50
};

struct FBox {
	FVector Min; // 0x0
	FVector Max; // 0xc
	char IsValid; // 0x18
};

struct FSQSDeleteQueueRequest {
	FString QueueUrl; // 0x0
};

struct FVectorCurve {
	FRichCurve FloatCurves[0x3]; // 0x18
};

struct FRBFTarget {
	float ScaleFactor; // 0x10
	bool bApplyCustomCurve; // 0x14
	FRichCurve CustomCurve; // 0x18
	ERBFDistanceMethod DistanceMethod; // 0x98
	ERBFFunctionType FunctionType; // 0x99
};

struct FNiagaraSystemCompileRequest {
	TArray<UObject*> RootObjects; // 0x8
};

struct FEventGraphFastCallPair {
	UFunction* FunctionToPatch; // 0x0
	int32_t EventGraphCallOffset; // 0x8
};

struct FMyPluginStruct {
	FString TestString; // 0x0
};

struct FDatasmithCameraFocusSettingsTemplate {
	ECameraFocusMethod FocusMethod; // 0x0
	float ManualFocusDistance; // 0x4
};

struct FS_WeaponAttachements {
	BP_MasterAttachment_C* Sight_13_0940373F4B22E35E1C18AEAF674BE387; // 0x0
	BP_MasterAttachment_C* FrontGrip_15_251084014195C8680FAF5287FC3B93A1; // 0x8
	BP_MasterAttachment_C* Magazine_17_C279D24C4CBCB0C4931A4F9813C56C4A; // 0x10
	BP_MasterAttachment_C* Stock_19_7E46B922491EC99ABA9AA5A802E01F36; // 0x18
	BP_MasterAttachment_C* Trigger_21_469EC1CF4CC16DCB35A46DAFEC913DAD; // 0x20
	BP_MasterAttachment_C* Handguard_24_95DD9D9742EEBDF376AFD8A99E046DB0; // 0x28
	BP_MasterAttachment_C* Underbarrel_26_BD52E86743DCE3AE2F7BE4B988AD45D1; // 0x30
	BP_MasterAttachment_C* Muzzle_28_FE72C8374C69E763AE76D49A1EA5519A; // 0x38
	BP_MasterAttachment_C* Warp_30_43C7657B4591F34E27894192AF2E7B83; // 0x40
};

struct FBPItemAmountPair {
	FString ItemUid; // 0x0
	int32_t ItemCount; // 0x10
};

struct FFloatDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FAkPluginInfo {
	FString Name; // 0x0
	uint32_t PluginID; // 0x10
	FString dll; // 0x18
};

struct FLiveLinkSubjectKey {
	FGuid Source; // 0x0
	FLiveLinkSubjectName SubjectName; // 0x10
};

struct FNodeHierarchyData {
	TArray<FNodeObject> Nodes; // 0x0
	TArray<FTransform> Transforms; // 0x10
	TMap<FName, int32_t> NodeNameToIndexMapping; // 0x20
};

struct FPurchaseInfo {
	FString Identifier; // 0x0
	FString DisplayName; // 0x10
	FString DisplayDescription; // 0x20
	FString DisplayPrice; // 0x30
};

struct FNiagaraMatrix {
	FVector4 Row0; // 0x0
	FVector4 Row1; // 0x10
	FVector4 Row2; // 0x20
	FVector4 Row3; // 0x30
};

struct FSQSDeleteMessageBatchRequest {
	FString QueueUrl; // 0x0
	TArray<FDeleteMessageBatchRequestEntry> Entries; // 0x10
};

struct FRestrictedGameplayTagTableRow {
	bool bAllowNonRestrictedChildren; // 0x20
};

struct FSectionEvaluationData {
	int32_t ImplIndex; // 0x0
	FFrameNumber ForcedTime; // 0x4
	ESectionEvaluationFlags Flags; // 0x8
};

struct FSkinWeightProfileInfo {
	FName Name; // 0x0
	FPerPlatformBool DefaultProfile; // 0x8
	FPerPlatformInt DefaultProfileFromLODIndex; // 0xc
};

struct FNavigationFilterFlags {
	char bNavFlag0 : 1; // 0x0
	char bNavFlag1 : 1; // 0x0
	char bNavFlag2 : 1; // 0x0
	char bNavFlag3 : 1; // 0x0
	char bNavFlag4 : 1; // 0x0
	char bNavFlag5 : 1; // 0x0
	char bNavFlag6 : 1; // 0x0
	char bNavFlag7 : 1; // 0x0
	char bNavFlag8 : 1; // 0x1
	char bNavFlag9 : 1; // 0x1
	char bNavFlag10 : 1; // 0x1
	char bNavFlag11 : 1; // 0x1
	char bNavFlag12 : 1; // 0x1
	char bNavFlag13 : 1; // 0x1
	char bNavFlag14 : 1; // 0x1
	char bNavFlag15 : 1; // 0x1
};

struct FConstraintDescriptor {
	EConstraintType Type; // 0x0
};

struct FCustomizableObjectProjector {
	FVector Position; // 0x0
	FVector Direction; // 0xc
	FVector Up; // 0x18
	FVector Scale; // 0x24
	ECustomizableObjectProjectorType ProjectionType; // 0x30
	float Angle; // 0x34
};

struct FGetLogGroupFieldsRequest {
	FString LogGroupName; // 0x0
	FString Time; // 0x10
};

struct FBlueprintInputAxisDelegateBinding {
	FName InputAxisName; // 0x4
	FName FunctionNameToBind; // 0xc
};

struct FTextureParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	UTexture* ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x18
};

struct FMaskOutTexture {
	int32_t SizeX; // 0x0
	int32_t SizeY; // 0x4
	TArray<uint32_t> Data; // 0x8
};

struct FSpinBoxStyle {
	FSlateBrush BackgroundBrush; // 0x8
	FSlateBrush HoveredBackgroundBrush; // 0x90
	FSlateBrush ActiveFillBrush; // 0x118
	FSlateBrush InactiveFillBrush; // 0x1a0
	FSlateBrush ArrowsImage; // 0x228
	FSlateColor ForegroundColor; // 0x2b0
	FMargin TextPadding; // 0x2d8
};

struct FModulatorContinuousParams {
	FName ParameterName; // 0x0
	float Default; // 0x8
	float MinInput; // 0xc
	float MaxInput; // 0x10
	float MinOutput; // 0x14
	float MaxOutput; // 0x18
	ModulationParamMode ParamMode; // 0x1c
};

struct FAkCommonInitializationSettings {
	uint32_t MaximumNumberOfMemoryPools; // 0x0
	uint32_t MaximumNumberOfPositioningPaths; // 0x4
	uint32_t CommandQueueSize; // 0x8
	uint32_t SamplesPerFrame; // 0xc
	FAkMainOutputSettings MainOutputSettings; // 0x10
	float StreamingLookAheadRatio; // 0x38
	uint16_t NumberOfRefillsInVoice; // 0x3c
	FAkSpatialAudioSettings SpatialAudioSettings; // 0x40
};

struct FDestructibleParameters {
	FDestructibleDamageParameters DamageParameters; // 0x0
	FDestructibleDebrisParameters DebrisParameters; // 0x1c
	FDestructibleAdvancedParameters AdvancedParameters; // 0x48
	FDestructibleSpecialHierarchyDepths SpecialHierarchyDepths; // 0x58
	TArray<FDestructibleDepthParameters> DepthParameters; // 0x70
	FDestructibleParametersFlag Flags; // 0x80
};

struct FPaintedVertex {
	FVector Position; // 0x0
	FColor Color; // 0xc
	FVector4 Normal; // 0x10
};

struct FBP_TransformOfInstancedFoliageActors {
	UHierarchicalInstancedStaticMeshComponent* InstancedStaticMeshComponent_7_7E2C14C94B5975EC86D0FB9B43FEBEDF; // 0x0
	TArray<FTransform> TransformArray_3_BF11884045408CDC6B3D1BB84BFDCBAF; // 0x8
};

struct FSkeletalMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	FName MaterialSlotName; // 0x8
	FMeshUVChannelInfo UVChannelData; // 0x10
};

struct FAISightEvent {
	AActor* SeenActor; // 0x8
	AActor* Observer; // 0x10
};

struct FInputScaleBiasClamp {
	bool bMapRange; // 0x0
	bool bClampResult; // 0x1
	bool bInterpResult; // 0x2
	FInputRange InRange; // 0x4
	FInputRange OutRange; // 0xc
	float Scale; // 0x14
	float Bias; // 0x18
	float ClampMin; // 0x1c
	float ClampMax; // 0x20
	float InterpSpeedIncreasing; // 0x24
	float InterpSpeedDecreasing; // 0x28
};

struct FUInt32 {
	uint32_t Value; // 0x0
};

struct FAssetRegistryDependencyOptions {
	bool bIncludeSoftPackageReferences; // 0x0
	bool bIncludeHardPackageReferences; // 0x1
	bool bIncludeSearchableNames; // 0x2
	bool bIncludeSoftManagementReferences; // 0x3
	bool bIncludeHardManagementReferences; // 0x4
};

struct FImportanceTexture {
	FIntPoint Size; // 0x0
	int32_t NumMips; // 0x8
	TArray<float> MarginalCDF; // 0x10
	TArray<float> ConditionalCDF; // 0x20
	TArray<FColor> TextureData; // 0x30
	TWeakObjectPtr<UTexture2D> Texture; // 0x40
	EImportanceWeight Weighting; // 0x48
};

struct FInsightRuleMetricDatapoint {
	FDateTime Timestamp; // 0x0
	float UniqueContributors; // 0x8
	float MaxContributorValue; // 0xc
	float SampleCount; // 0x10
	float Average; // 0x14
	float Sum; // 0x18
	float Minimum; // 0x1c
	float Maximum; // 0x20
};

struct FStatisticSet {
	float SampleCount; // 0x0
	float Sum; // 0x4
	float Minimum; // 0x8
	float Maximum; // 0xc
};

struct FOverlayItem {
	FTimespan StartTime; // 0x0
	FTimespan EndTime; // 0x8
	FString Text; // 0x10
	FVector2D Position; // 0x20
};

struct FPBUF_sv_StatusUpdateUserCountReq {
	FString Guid; // 0x0
	int32_t user_count; // 0x10
	FString instance_id; // 0x18
	FString region; // 0x28
	FString endtimestr; // 0x38
	int32_t max_user_count; // 0x48
};

struct FMaterialInstanceBasePropertyOverrides {
	char bOverride_OpacityMaskClipValue : 1; // 0x0
	char bOverride_BlendMode : 1; // 0x0
	char bOverride_ShadingModel : 1; // 0x0
	char bOverride_DitheredLODTransition : 1; // 0x0
	char bOverride_CastDynamicShadowAsMasked : 1; // 0x0
	char bOverride_TwoSided : 1; // 0x0
	char TwoSided : 1; // 0x0
	char DitheredLODTransition : 1; // 0x0
	char bCastDynamicShadowAsMasked : 1; // 0x1
	EBlendMode BlendMode; // 0x2
	EMaterialShadingModel ShadingModel; // 0x3
	float OpacityMaskClipValue; // 0x4
};

struct FPassiveSoundMixModifier {
	USoundMix* SoundMix; // 0x0
	float MinVolumeThreshold; // 0x8
	float MaxVolumeThreshold; // 0xc
};

struct FCompilationOptions {
	bool bTextureCompression; // 0x0
	int32_t OptimizationLevel; // 0x4
	bool bUseParallelCompilation; // 0x8
	bool bUseDiskCompilation; // 0x9
};

struct FStructSerializerByteArray {
	int32_t Dummy1; // 0x0
	TArray<char> ByteArray; // 0x8
	int32_t Dummy2; // 0x18
	TArray<int8_t> Int8Array; // 0x20
	int32_t Dummy3; // 0x30
};

struct FCapturedPropSegment {
	FString PropertyName; // 0x0
	int32_t PropertyIndex; // 0x10
	FString ComponentName; // 0x18
};

struct FDialogueText {
	FSlateBrush Portrait; // 0x0
	FText Dialogue; // 0x88
	float Duration; // 0xa0
	USoundBase* AppearSound; // 0xa8
	USoundBase* VoiceSound; // 0xb0
};

struct FAnimNode_BlendSpaceEvaluator {
	float NormalizedTime; // 0xe8
};

struct FAudioQualitySettings {
	FText DisplayName; // 0x0
	int32_t MaxChannels; // 0x18
};

struct FMaterialTextureInfo {
	float SamplingScale; // 0x0
	int32_t UVChannelIndex; // 0x4
	FName TextureName; // 0x8
};

struct FInterpLookupTrack {
	TArray<FInterpLookupPoint> Points; // 0x0
};

struct FSubdividedQuadVertex {
	int32_t VertexPositionIndex; // 0x0
	FVector2D TextureCoordinate0; // 0x4
	FVector2D TextureCoordinate1; // 0xc
	FColor VertexColor; // 0x14
	FVector VertexNormal; // 0x18
	FVector VertexTangent; // 0x24
	float VertexBinormalSign; // 0x30
};

struct FMagicLeapARPinQuery {
	TSet<EMagicLeapARPinType> Types; // 0x0
	int32_t MaxResults; // 0x50
	FVector TargetPoint; // 0x54
	float Radius; // 0x60
	bool bSorted; // 0x64
};

struct FAlwaysRelevantActorInfo {
	UNetConnection* Connection; // 0x0
	AActor* LastViewer; // 0x8
	AActor* LastViewTarget; // 0x10
};

struct FQueryDefinition {
	FString QueryDefinitionId; // 0x0
	FString Name; // 0x10
	FString QueryString; // 0x20
	FString LastModified; // 0x30
	TArray<FString> LogGroupNames; // 0x40
};

struct FBakedIntegerCustomAttribute {
	FName AttributeName; // 0x0
	FIntegralCurve IntCurve; // 0x8
};

struct FMutableParamUIMetadata {
	FString ObjectFriendlyName; // 0x0
	FString UISectionName; // 0x10
	int32_t UIOrder; // 0x20
	TSoftObjectPtr<UTexture2D> UIThumbnail; // 0x28
	TMap<FString, FString> ExtraInformation; // 0x50
	TMap<FString, TSoftObjectPtr<UObject>> ExtraAssets; // 0xa0
};

struct FGizmoFloatParameterChange {
	float InitialValue; // 0x0
	float CurrentValue; // 0x4
};

struct FAnimNode_Mirror {
	FPoseLink BasePose; // 0x10
	UMirrorTable* MirrorTable; // 0x20
};

struct FSQSSendMessageResult {
	FString MD5OfMessageBody; // 0x0
	FString MD5OfMessageAttributes; // 0x10
	FString MD5OfMessageSystemAttributes; // 0x20
	FString MessageId; // 0x30
	FString SequenceNumber; // 0x40
	FSQSResponseMetadata ResponseMetadata; // 0x50
};

struct FSourceEffectEQBand {
	float Frequency; // 0x0
	float Bandwidth; // 0x4
	float GainDb; // 0x8
	char bEnabled : 1; // 0xc
};

struct FPutDestinationPolicyRequest {
	FString DestinationName; // 0x0
	FString AccessPolicy; // 0x10
};

struct FSimulatedRootMotionReplicatedMove {
	float Time; // 0x0
	FRepRootMotionMontage RootMotion; // 0x8
};

struct FMovieScenePropertySectionTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x20
};

struct FSubdivisionLimitData {
	TArray<FVector> VertexPositions; // 0x0
	TArray<FSubdivisionLimitSection> Sections; // 0x10
	TArray<FSubdividedWireEdge> SubdividedWireEdges; // 0x20
};

struct FAnimBlueprintFunctionData {
	TFieldPath<FStructProperty> OutputPoseNodeProperty; // 0x0
	TArray<TFieldPath<FStructProperty>> InputPoseNodeProperties; // 0x20
	TArray<TFieldPath<FProperty>> InputProperties; // 0x30
};

struct FVector {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
};

struct FFOscillator {
	float Amplitude; // 0x0
	float Frequency; // 0x4
	EInitialOscillatorOffset InitialOffset; // 0x8
	EOscillatorWaveform Waveform; // 0x9
};

struct FMovieSceneByteChannel {
	TArray<FFrameNumber> Times; // 0x8
	char DefaultValue; // 0x18
	bool bHasDefaultValue; // 0x19
	TArray<char> Values; // 0x20
	UEnum* Enum; // 0x30
};

struct FTrackInstanceInputComponent {
	UMovieSceneSection* Section; // 0x0
	int32_t OutputIndex; // 0x8
};

struct FClothCollisionPrim_Sphere {
	int32_t BoneIndex; // 0x0
	float Radius; // 0x4
	FVector LocalPosition; // 0x8
};

struct FButtonStyle {
	FSlateBrush Normal; // 0x8
	FSlateBrush Hovered; // 0x90
	FSlateBrush Pressed; // 0x118
	FSlateBrush Disabled; // 0x1a0
	FMargin NormalPadding; // 0x228
	FMargin PressedPadding; // 0x238
	FSlateSound PressedSlateSound; // 0x248
	FSlateSound HoveredSlateSound; // 0x260
};

struct FStaticMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	FName MaterialSlotName; // 0x8
	FName ImportedMaterialSlotName; // 0x10
	FMeshUVChannelInfo UVChannelData; // 0x18
};

struct FS_TutorialShowingRadiogram {
	E_RadiogramDetailType Type_5_3BEE790740298FD9162DDCADF12714AE; // 0x0
	int32_t UID_4_9AE9DBAB41434A858DC7358D5F1AB6F6; // 0x4
};

struct FSessionServicePing {
	FString Username; // 0x0
};

struct FRepMovement {
	FVector LinearVelocity; // 0x0
	FVector AngularVelocity; // 0xc
	FVector Location; // 0x18
	FRotator Rotation; // 0x24
	char bSimulatedPhysicSleep : 1; // 0x30
	char bRepPhysics : 1; // 0x30
	EVectorQuantization LocationQuantizationLevel; // 0x31
	EVectorQuantization VelocityQuantizationLevel; // 0x32
	ERotatorQuantization RotationQuantizationLevel; // 0x33
};

struct FMovieSceneTrackIdentifier {
	uint32_t Value; // 0x0
};

struct FMovieSceneNiagaraColorParameterSectionTemplate {
	FMovieSceneFloatChannel RedChannel; // 0x40
	FMovieSceneFloatChannel GreenChannel; // 0xe0
	FMovieSceneFloatChannel BlueChannel; // 0x180
	FMovieSceneFloatChannel AlphaChannel; // 0x220
};

struct FEpicSynth1Patch {
	ESynth1PatchSource PatchSource; // 0x0
	TArray<FSynth1PatchCable> PatchCables; // 0x8
};

struct FBPSteamGroupInfo {
	FBPUniqueNetId GroupID; // 0x0
	FString GroupName; // 0x20
	FString GroupTag; // 0x30
	int32_t numOnline; // 0x40
	int32_t numInGame; // 0x44
	int32_t numChatting; // 0x48
};

struct FSourceEffectSimpleDelaySettings {
	float SpeedOfSound; // 0x0
	float DelayAmount; // 0x4
	float DryAmount; // 0x8
	float WetAmount; // 0xc
	float Feedback; // 0x10
	char bDelayBasedOnDistance : 1; // 0x14
};

struct FSlateFontInfo {
	UObject* FontObject; // 0x0
	UObject* FontMaterial; // 0x8
	FFontOutlineSettings OutlineSettings; // 0x10
	FName TypefaceFontName; // 0x40
	int32_t Size; // 0x48
	int32_t LetterSpacing; // 0x4c
};

struct FPoseDriverTarget {
	TArray<FPoseDriverTransform> BoneTransforms; // 0x0
	FRotator TargetRotation; // 0x10
	float TargetScale; // 0x1c
	ERBFDistanceMethod DistanceMethod; // 0x20
	ERBFFunctionType FunctionType; // 0x21
	bool bApplyCustomCurve; // 0x22
	FRichCurve CustomCurve; // 0x28
	FName DrivenName; // 0xa8
	bool bIsHidden; // 0xb8
};

struct FPBUF_sv_DediListInfosRes {
	TArray<FPBUF_sv_DediInfo> dedi_infos; // 0x0
};

struct FTestMetricFilterRequest {
	FString FilterPattern; // 0x0
	TArray<FString> LogEventMessages; // 0x10
};

struct FConstraintData {
	FConstraintDescriptor Constraint; // 0x0
	float Weight; // 0x10
	bool bMaintainOffset; // 0x14
	FTransform Offset; // 0x20
	FTransform CurrentTransform; // 0x50
};

struct FSteamUGCQueryParameterAll {
	FString searchText; // 0x50
	int32_t rankedByTrendDays; // 0x60
	bool bMatchAnyTag; // 0x64
	EUGCQueryBP queryType; // 0x65
	EUGCMatchingUGCTypeBP fileType; // 0x66
};

struct FFunctionExpressionOutput {
	UMaterialExpressionFunctionOutput* ExpressionOutput; // 0x0
	FGuid ExpressionOutputId; // 0x8
	FExpressionOutput Output; // 0x18
};

struct FMaterialFunctionInfo {
	FGuid StateId; // 0x0
	UMaterialFunctionInterface* Function; // 0x10
};

struct FSessionServicePong {
	bool Authorized; // 0x0
	FString BuildDate; // 0x8
	FString DeviceName; // 0x18
	FGuid InstanceId; // 0x28
	FString InstanceName; // 0x38
	FString PlatformName; // 0x48
	FGuid SessionId; // 0x58
	FString SessionName; // 0x68
	FString SessionOwner; // 0x78
	bool Standalone; // 0x88
};

struct FTrackToSkeletonMap {
	int32_t BoneTreeIndex; // 0x0
};

struct FAkOutputSettings {
	FString AudioDeviceSharesetName; // 0x0
	int32_t IdDevice; // 0x10
	PanningRule PanRule; // 0x14
	AkChannelConfiguration ChannelConfig; // 0x15
};

struct FNiagaraScriptDataInterfaceInfo {
	UNiagaraDataInterface* DataInterface; // 0x0
	FName Name; // 0x8
	int32_t UserPtrIdx; // 0x10
	FNiagaraTypeDefinition Type; // 0x18
	FName RegisteredParameterMapRead; // 0x28
	FName RegisteredParameterMapWrite; // 0x30
};

struct FHitEffectInfo {
	EPhysicalSurface SurfaceType; // 0x0
	UParticleSystem* HitEmmiter; // 0x8
	UMaterialInterface* HitDecal; // 0x10
	FVector DecalSize; // 0x18
	float DecalLifeTime; // 0x24
	USoundBase* HitSound; // 0x28
	UAkSwitchValue* HitAKSwitchValue; // 0x30
};

struct FSQSSendMessageBatchRequest {
	FString QueueUrl; // 0x0
	TArray<FSendMessageBatchRequestEntry> Entries; // 0x10
};

struct FAttributesForEdge {
	FEdgeID EdgeID; // 0x0
	FMeshElementAttributeList EdgeAttributes; // 0x8
};

struct FS_HealthChangeSummary {
	UDamageType* DamageType_5_CD5E781A4319CF90D36C9B94DF532828; // 0x0
	FName Instigator_15_611AC5554022C8DCA7A0A99AB9BC932D; // 0x8
	int32_t CauserUID_22_AA3FC4404E043A15F2F66C940948DB0D; // 0x10
	float ChangeValue_26_C258EC2B450B1D4024367090DFDB7A51; // 0x14
	float LastHitTime_13_22E9599346EA4848A3167AB61CFD92FB; // 0x18
	E_HitboxType HitBox_20_CC2E47FF43E2CB1D541896950F5D3FB7; // 0x1c
	float Health_25_E3DACEDB4D76BFB27AE10FB9DCF1720F; // 0x20
	bool ByPlayer_29_CA06F497455D387D5C45819FA6550128; // 0x24
};

struct FMovieSceneObjectBindingID {
	int32_t SequenceID; // 0x0
	EMovieSceneObjectBindingSpace Space; // 0x4
	FGuid Guid; // 0x8
};

struct FVirtualTextureSpacePoolConfig {
	int32_t MinTileSize; // 0x0
	int32_t MaxTileSize; // 0x4
	TArray<EPixelFormat> Formats; // 0x8
	int32_t SizeInMegabyte; // 0x18
	bool bAllowSizeScale; // 0x1c
	uint32_t ScalabilityGroup; // 0x20
};

struct FClothConstraintSetup_Legacy {
	float Stiffness; // 0x0
	float StiffnessMultiplier; // 0x4
	float StretchLimit; // 0x8
	float CompressionLimit; // 0xc
};

struct FSHAHashData {
	char Hash[0x14]; // 0x0
};

struct FNiagaraHalfVector3 {
	uint16_t X; // 0x0
	uint16_t Y; // 0x2
	uint16_t Z; // 0x4
};

struct FPackedRGB10A2N {
	int32_t Packed; // 0x0
};

struct FMeshMergingSettings {
	int32_t TargetLightMapResolution; // 0x0
	EUVOutput OutputUVs[0x8]; // 0x4
	FMaterialProxySettings MaterialSettings; // 0xc
	int32_t GutterSize; // 0x94
	int32_t SpecificLOD; // 0x98
	EMeshLODSelectionType LODSelectionType; // 0x9c
	char bGenerateLightMapUV : 1; // 0x9d
	char bComputedLightMapResolution : 1; // 0x9d
	char bPivotPointAtZero : 1; // 0x9d
	char bMergePhysicsData : 1; // 0x9d
	char bMergeMaterials : 1; // 0x9d
	char bCreateMergedMaterial : 1; // 0x9d
	char bBakeVertexDataToMesh : 1; // 0x9d
	char bUseVertexDataForBakingMaterial : 1; // 0x9d
	char bUseTextureBinning : 1; // 0x9e
	char bReuseMeshLightmapUVs : 1; // 0x9e
	char bMergeEquivalentMaterials : 1; // 0x9e
	char bUseLandscapeCulling : 1; // 0x9e
	char bIncludeImposters : 1; // 0x9e
	char bAllowDistanceField : 1; // 0x9e
};

struct FCollectionParameterBase {
	FName ParameterName; // 0x0
	FGuid ID; // 0x8
};

struct FExportTaskExecutionInfo {
	FString CreationTime; // 0x0
	FString CompletionTime; // 0x10
};

struct FCurveEdEntry {
	UObject* CurveObject; // 0x0
	FColor CurveColor; // 0x8
	FString CurveName; // 0x10
	int32_t bHideCurve; // 0x20
	int32_t bColorCurve; // 0x24
	int32_t bFloatingPointColorCurve; // 0x28
	int32_t bClamp; // 0x2c
	float ClampLow; // 0x30
	float ClampHigh; // 0x34
};

struct FLevelViewportInfo {
	FVector CamPosition; // 0x0
	FRotator CamRotation; // 0xc
	float CamOrthoZoom; // 0x18
	bool CamUpdated; // 0x1c
};

struct FClothPhysicalMeshData {
	TArray<FVector> Vertices; // 0x0
	TArray<FVector> Normals; // 0x10
	TArray<uint32_t> Indices; // 0x20
	TMap<uint32_t, FPointWeightMap> WeightMaps; // 0x30
	TArray<float> InverseMasses; // 0x80
	TArray<FClothVertBoneData> BoneData; // 0x90
	int32_t MaxBoneWeights; // 0xa0
	int32_t NumFixedVerts; // 0xa4
	TArray<uint32_t> SelfCollisionIndices; // 0xa8
	TArray<float> MaxDistances; // 0xb8
	TArray<float> BackstopDistances; // 0xc8
	TArray<float> BackstopRadiuses; // 0xd8
	TArray<float> AnimDriveMultipliers; // 0xe8
};

struct FDeleteDashboardsRequest {
	TArray<FString> DashboardNames; // 0x0
};

struct FChunkInfoData {
	FGuid Guid; // 0x0
	uint64_t Hash; // 0x10
	FSHAHashData ShaHash; // 0x18
	int64_t FileSize; // 0x30
	char GroupNumber; // 0x38
};

struct FRootMotionSourceGroup {
	char bHasAdditiveSources : 1; // 0x28
	char bHasOverrideSources : 1; // 0x28
	char bHasOverrideSourcesWithIgnoreZAccumulate : 1; // 0x28
	char bIsAdditiveVelocityApplied : 1; // 0x28
	FRootMotionSourceSettings LastAccumulatedSettings; // 0x29
	FVector_NetQuantize10 LastPreAdditiveVelocity; // 0x2c
};

struct FSoundSourceBusSendInfo {
	ESourceBusSendLevelControlMethod SourceBusSendLevelControlMethod; // 0x0
	USoundSourceBus* SoundSourceBus; // 0x8
	UAudioBus* AudioBus; // 0x10
	float SendLevel; // 0x18
	float MinSendLevel; // 0x1c
	float MaxSendLevel; // 0x20
	float MinSendDistance; // 0x24
	float MaxSendDistance; // 0x28
	FRuntimeFloatCurve CustomSendLevelCurve; // 0x30
};

struct FBTDecoratorLogic {
	EBTDecoratorLogic Operation; // 0x0
	uint16_t Number; // 0x2
};

struct FLayerBlendInput {
	FName LayerName; // 0x0
	ELandscapeLayerBlendType BlendType; // 0x8
	FExpressionInput LayerInput; // 0xc
	FExpressionInput HeightInput; // 0x20
	float PreviewWeight; // 0x34
	FVector ConstLayerInput; // 0x38
	float ConstHeightInput; // 0x44
};

struct FS_RangeWeaponAnims {
	UAnimMontage* FPADSFire_41_EF3702324FE0A5BA3318F1B546D8CB3C; // 0x0
	UAnimSequenceBase* FPADSIdle_3_4C97FD2B43EACB1AD544359BD83B3696; // 0x8
	UBlendSpaceBase* FPADSJogBlendSpace_6_D1FFF0E6467AAA213DAE51BCAFA72CEB; // 0x10
	UAnimMontage* FPADSCrouchFire_47_A9CED9F6409BE6147D1A7F9AF1FC1CFB; // 0x18
	UAnimMontage* FPCrouchFire_51_F7FF8A9347E684FEEB2C0DA66C87E171; // 0x20
	UAnimSequenceBase* FPADSCrouchIdle_10_020CC93349F310169F569FA2918CD8E9; // 0x28
	UBlendSpaceBase* FPADSCrouchBlendSpace_32_9D1AAFA74C7358237AC240B9A21FE3F7; // 0x30
	UAnimMontage* TPADSFire_43_EA44AB0E4C02DBE577ADABBCEB66466F; // 0x38
	UAnimSequenceBase* TPADSIdle_16_C5A1BAA24B965BDA01E437AD96091BBA; // 0x40
	UBlendSpaceBase* TPADSJogBlendSpace_31_EF204F654321BA93E6BFFB8E8B658847; // 0x48
	UAnimMontage* TPCrounchFire_53_6E04AEE246E65B76B8C558B45FFC3584; // 0x50
	UAnimMontage* TPADSCrouchFire_49_FB25334D4E2556F19123E6A0E158CB76; // 0x58
	UAnimSequenceBase* TPADSCrouchIdle_20_293A249B4903C0A86CA580A36F973560; // 0x60
	UBlendSpaceBase* TPADSCrouchBlendSpace_30_13813383434E578AC958408C513DF466; // 0x68
	UBlendSpaceBase* ADSAimOffset_29_56058D0441A6611A2B53BC91D49AC7A6; // 0x70
	UBlendSpace1D* FP_NearWallHandsUp_60_44F6F5C1449211208B7C54ABC4132951; // 0x78
	UBlendSpace1D* TP_NearWallHandsUp_62_C9E13CBF4F9251A2DE0042B688A33A20; // 0x80
};

struct FCustomizableObjectProjectorParameterValue {
	FString ParameterName; // 0x0
	FCustomizableObjectProjector Value; // 0x10
	FString UID; // 0x48
	TArray<FCustomizableObjectProjector> RangeValues; // 0x58
};

struct FS_RetrieveSystemInfo {
	int32_t MaxSlotCount_2_8669C7334C788EBF265C8388F06C73CF; // 0x0
	TArray<int32_t> RegisterItemArray_6_FCED4DEC479CF36B76F1A58824893E3E; // 0x8
};

struct FAnimSequenceTrackContainer {
	TArray<FRawAnimSequenceTrack> AnimationTracks; // 0x0
	TArray<FName> TrackNames; // 0x10
};

struct FS_AttachmentAnimationInfo {
	UAnimMontage* AnimMontage_2_54A8CBBA412938CD76D06CB83C23EB05; // 0x0
	float PlayTime_5_59BE1F984B640AA61CA579BA4CED6A20; // 0x8
};

struct FLiveLinkLightStaticData {
	bool bIsTemperatureSupported; // 0x10
	bool bIsIntensitySupported; // 0x11
	bool bIsLightColorSupported; // 0x12
	bool bIsInnerConeAngleSupported; // 0x13
	bool bIsOuterConeAngleSupported; // 0x14
	bool bIsAttenuationRadiusSupported; // 0x15
	bool bIsSourceLenghtSupported; // 0x16
	bool bIsSourceRadiusSupported; // 0x17
	bool bIsSoftSourceRadiusSupported; // 0x18
};

struct FFrameNumber {
	int32_t Value; // 0x0
};

struct FVirtualKeyboardOptions {
	bool bEnableAutocorrect; // 0x0
};

struct FComboButtonStyle {
	FButtonStyle ButtonStyle; // 0x8
	FSlateBrush DownArrowImage; // 0x280
	FVector2D ShadowOffset; // 0x308
	FLinearColor ShadowColorAndOpacity; // 0x310
	FSlateBrush MenuBorderBrush; // 0x320
	FMargin MenuBorderPadding; // 0x3a8
};

struct FSQSUntagQueueRequest {
	FString QueueUrl; // 0x0
	TArray<FString> TagKeys; // 0x10
};

struct FAdaptorPolygon2Group {
	uint32_t RenderingSectionIndex; // 0x0
	int32_t MaterialIndex; // 0x4
	int32_t MaxTriangles; // 0x8
};

struct FCompressedTrack {
	TArray<char> ByteStream; // 0x0
	TArray<float> Times; // 0x10
	float Mins[0x3]; // 0x20
	float Ranges[0x3]; // 0x2c
};

struct FWidgetAlignment {
	EHorizontalAlignment HorizontalAlignment; // 0x0
	EVerticalAlignment VerticalAlignment; // 0x1
};

struct FAnimNode_ApplyAdditive {
	FPoseLink Base; // 0x10
	FPoseLink Additive; // 0x20
	float Alpha; // 0x30
	FInputScaleBias AlphaScaleBias; // 0x34
	int32_t LODThreshold; // 0x3c
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
	FName AlphaCurveName; // 0x88
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x90
	EAnimAlphaInputType AlphaInputType; // 0xc4
	bool bAlphaBoolEnabled; // 0xc5
};

struct FVertexOffsetUsage {
	int32_t Usage; // 0x0
};

struct FS_FieldNPC_OneSpawnInfo {
	int32_t UID_13_6DA85820402C493116B7DB88EA41F347; // 0x0
	int32_t SpawnNum_11_D795DE464776F1FC01160BBB0F5E19C4; // 0x4
};

struct FPlayerScore {
	int32_t PlayerId; // 0x0
	FString PlayerName; // 0x8
	int32_t score; // 0x18
};

struct FMovieSceneWarpCounter {
	TArray<uint32_t> WarpCounts; // 0x0
};

struct FCompositeFont {
	FTypeface DefaultTypeface; // 0x0
	FCompositeFallbackFont FallbackTypeface; // 0x10
	TArray<FCompositeSubFont> SubTypefaces; // 0x28
};

struct FMovieSceneTrackEvalOptions {
	char bCanEvaluateNearestSection : 1; // 0x0
	char bEvalNearestSection : 1; // 0x0
	char bEvaluateInPreroll : 1; // 0x0
	char bEvaluateInPostroll : 1; // 0x0
	char bEvaluateNearestSection : 1; // 0x0
};

struct FCanvasUVTri {
	FVector2D V0_Pos; // 0x0
	FVector2D V0_UV; // 0x8
	FLinearColor V0_Color; // 0x10
	FVector2D V1_Pos; // 0x20
	FVector2D V1_UV; // 0x28
	FLinearColor V1_Color; // 0x30
	FVector2D V2_Pos; // 0x40
	FVector2D V2_UV; // 0x48
	FLinearColor V2_Color; // 0x50
};

struct FRigTransformConstraint {
	EConstraintTransform TranformType; // 0x0
	FName ParentSpace; // 0x4
	float Weight; // 0xc
};

struct FMovieSceneEvaluationGroupLUTIndex {
	int32_t NumInitPtrs; // 0x0
	int32_t NumEvalPtrs; // 0x4
};

struct FEdGraphSchemaAction {
	FText MenuDescription; // 0x8
	FText TooltipDescription; // 0x20
	FText Category; // 0x38
	FText Keywords; // 0x50
	int32_t Grouping; // 0x68
	int32_t SectionID; // 0x6c
	TArray<FString> MenuDescriptionArray; // 0x70
	TArray<FString> FullSearchTitlesArray; // 0x80
	TArray<FString> FullSearchKeywordsArray; // 0x90
	TArray<FString> FullSearchCategoryArray; // 0xa0
	TArray<FString> LocalizedMenuDescriptionArray; // 0xb0
	TArray<FString> LocalizedFullSearchTitlesArray; // 0xc0
	TArray<FString> LocalizedFullSearchKeywordsArray; // 0xd0
	TArray<FString> LocalizedFullSearchCategoryArray; // 0xe0
	FString searchText; // 0xf0
};

struct FAITeamStimulusEvent {
	AActor* Broadcaster; // 0x28
	AActor* Enemy; // 0x30
};

struct FMovieSceneEvent {
	FMovieSceneEventPtrs Ptrs; // 0x0
};

struct FMessageAttributeValue {
	FString StringValue; // 0x0
	TArray<FString> StringListValues; // 0x10
	FString DataType; // 0x20
};

struct FObjectRankData {
	FString Debug_Description; // 0x8
	TMap<EObjectRankPointType, FIntPair> ObjectActionRankScoreInfo; // 0x18
};

struct FPutMetricDataRequest {
	FString Namespace; // 0x0
	TArray<FMetricDatum> MetricData; // 0x10
};

struct FMagicLeapIdentityAttribute {
	EMagicLeapIdentityKey Attribute; // 0x0
	FString Value; // 0x8
};

struct FDescribeMetricFiltersResult {
	TArray<FMetricFilter> MetricFilters; // 0x0
	FString NextToken; // 0x10
};

struct FLensImperfectionSettings {
	UTexture* DirtMask; // 0x0
	float DirtMaskIntensity; // 0x8
	FLinearColor DirtMaskTint; // 0xc
};

struct FFastArraySerializer {
	int32_t ArrayReplicationKey; // 0x54
	EFastArraySerializerDeltaFlags DeltaFlags; // 0x100
};

struct FRuntimeCurveLinearColor {
	FRichCurve ColorCurves[0x4]; // 0x0
	UCurveLinearColor* ExternalCurve; // 0x200
};

struct FS_LandmarkDialogueByState {
	E_LandmarkState State_9_79A5C7984D4BD5D6E23F1B98AB9CBD16; // 0x0
	TArray<FS_Dialogue> Dialogue_13_14D366C9481AE486775E9CB4C8CFEA06; // 0x8
	USoundBase* Sound_8_A537D699448D071222829FB978C4DB8E; // 0x18
	float Pitch_6_DBA9E8FD45A9C9200BF536ADD6608A41; // 0x20
};

struct FIntegerParameterUIData {
	FString Name; // 0x0
	FMutableParamUIMetadata ParamUIMetadata; // 0x10
};

struct FMovieSceneBinding {
	FGuid ObjectGuid; // 0x0
	FString BindingName; // 0x10
	TArray<UMovieSceneTrack*> Tracks; // 0x20
};

struct FNiagaraCollisionEventPayload {
	FVector CollisionPos; // 0x0
	FVector CollisionNormal; // 0xc
	FVector CollisionVelocity; // 0x18
	int32_t ParticleIndex; // 0x24
	int32_t PhysicalMaterialIndex; // 0x28
};

struct FAnimSlotGroup {
	FName GroupName; // 0x0
	TArray<FName> SlotNames; // 0x8
};

struct FShapedTextOptions {
	char bOverride_TextShapingMethod : 1; // 0x0
	char bOverride_TextFlowDirection : 1; // 0x0
	ETextShapingMethod TextShapingMethod; // 0x1
	ETextFlowDirection TextFlowDirection; // 0x2
};

struct FDeleteAlarmsRequest {
	TArray<FString> AlarmNames; // 0x0
};

struct FAnimNode_MirrorCS {
	EAxis MirrorAxis; // 0xc8
	bool CompletlySymmetrical; // 0xc9
	FString Substring_A; // 0xd0
	FString Substring_B; // 0xe0
};

struct FAkCommonInitializationSettingsWithSampleRate {
	uint32_t SampleRate; // 0x60
};

struct FARSkeletonDefinition {
	int32_t NumJoints; // 0x0
	TArray<FName> JointNames; // 0x8
	TArray<int32_t> ParentIndices; // 0x18
};

struct FLiveLinkTimeCode_Base_DEPRECATED {
	int32_t Seconds; // 0x0
	int32_t Frames; // 0x4
	FLiveLinkFrameRate FrameRate; // 0x8
};

struct FInvitedTeamInfo {
	ASurvivalPlayerState* TeamLeader_PS; // 0x0
	FString InvitedTeam_ID; // 0x8
};

struct FRandomItemGenerate {
	TArray<FItemCodeValue> GuaranteedGenerateItem; // 0x8
	int32_t RandomlyGenerateMinCount; // 0x18
	int32_t RandomlyGenerateMaxCount; // 0x1c
	TArray<FItemWeight> RandomlyGenerateItem; // 0x20
	bool AffectResourceMultiply; // 0x30
};

struct FSpriteCategoryInfo {
	FName Category; // 0x0
	FText DisplayName; // 0x8
	FText Description; // 0x20
};

struct FS_BuildPartArray {
	TArray<ABP_BuildPartBase_C*> BuildPart_4_5BC73E8B4489151E6D02758F728A1539; // 0x0
};

struct FS_IntFloatMap {
	TMap<int32_t, float> NotifyInterval_6_FCE81D214157BCDF5CBDE4ACEBA8F2A0; // 0x0
};

struct FGameplayTagTableRow {
	FName Tag; // 0x8
	FString DevComment; // 0x10
};

struct FSplinePoint {
	float InputKey; // 0x0
	FVector Position; // 0x4
	FVector ArriveTangent; // 0x10
	FVector LeaveTangent; // 0x1c
	FRotator Rotation; // 0x28
	FVector Scale; // 0x34
	ESplinePointType Type; // 0x40
};

struct FHeaderRowStyle {
	FTableColumnHeaderStyle ColumnStyle; // 0x8
	FTableColumnHeaderStyle LastColumnStyle; // 0x4d8
	FSplitterStyle ColumnSplitterStyle; // 0x9a8
	FSlateBrush BackgroundBrush; // 0xac0
	FSlateColor ForegroundColor; // 0xb48
};

struct FThrobberSettings {
	int32_t NumberOfPieces; // 0x0
	bool bAnimateHorizontally; // 0x4
	bool bAnimateVertically; // 0x5
	bool bAnimateOpacity; // 0x6
	FSlateBrush Image; // 0x8
};

struct FSubdividedWireEdge {
	int32_t EdgeVertex0PositionIndex; // 0x0
	int32_t EdgeVertex1PositionIndex; // 0x4
};

struct FLowEntryRegexMatch {
	int32_t MatchNumber; // 0x0
	int32_t BeginIndex; // 0x4
	int32_t EndIndex; // 0x8
	FString Match; // 0x10
	TArray<FLowEntryRegexCaptureGroup> CaptureGroups; // 0x20
};

struct FLightmassLightSettings {
	float IndirectLightingSaturation; // 0x0
	float ShadowExponent; // 0x4
	bool bUseAreaShadowsForStationaryLight; // 0x8
};

struct FMovieSceneExpansionState {
	bool bExpanded; // 0x0
};

struct FMaterialCachedParameters {
	FMaterialCachedParameterEntry RuntimeEntries[0x5]; // 0x0
	TArray<float> ScalarValues; // 0x140
	TArray<FLinearColor> VectorValues; // 0x150
	TArray<UTexture*> TextureValues; // 0x160
	TArray<UFont*> FontValues; // 0x170
	TArray<int32_t> FontPageValues; // 0x180
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextureValues; // 0x190
};

struct FTeamMemberInfo {
	ASurvivalPlayerState* Member_PS; // 0x0
	FString Member_ID; // 0x8
	bool bIsLeader; // 0x18
};

struct FScalarParameterAtlasInstanceData {
	bool bIsUsedAsAtlasPosition; // 0x0
	TSoftObjectPtr<UCurveLinearColor> Curve; // 0x8
	TSoftObjectPtr<UCurveLinearColorAtlas> Atlas; // 0x30
};

struct FMachinArmAbilitySub {
	FText SubcategoryName; // 0x8
	UTexture2D* BackgroundImage; // 0x20
	int32_t sortOrder; // 0x28
	TArray<FMachinArmAbilityItem> AbilityList; // 0x30
};

struct FUserSessionInfo {
	FString UserID; // 0x0
	FString LastNickname; // 0x10
	float AliveTime; // 0x20
	FVector LastDeadLocation; // 0x24
	TArray<FIntPair> UnlockedRadiogram; // 0x30
	TArray<FQuickSlotInfo> QuickSlotInof_Preset1; // 0x40
	TArray<FQuickSlotInfo> QuickSlotInof_Preset2; // 0x50
	TMap<char, FIntPairArray> UserActionHistory; // 0x60
	float AccumulatedSurvivalTime; // 0xb0
	int32_t TerraPoint; // 0xb4
	bool bIsUnlockedEscapeCode; // 0xb8
};

struct FEngineServiceAuthGrant {
	FString Username; // 0x0
	FString UserToGrant; // 0x10
};

struct FNPCShieldInfo {
	UStaticMesh* Shield; // 0x8
	UParticleSystem* BrokenEffect; // 0x10
	float ShieldDurability; // 0x18
	TArray<UObject*> MultiplyDamageWeapon; // 0x20
	TArray<float> MultiplyDamageToShield; // 0x30
};

struct FS_FieldNPC_SpawnQueueInfo {
	int32_t UID_15_6DA85820402C493116B7DB88EA41F347; // 0x0
	float SpawnTime_13_D795DE464776F1FC01160BBB0F5E19C4; // 0x4
};

struct FMovementProperties {
	char bCanCrouch : 1; // 0x0
	char bCanJump : 1; // 0x0
	char bCanWalk : 1; // 0x0
	char bCanSwim : 1; // 0x0
	char bCanFly : 1; // 0x0
};

struct FDirectorTrackCut {
	float Time; // 0x0
	float TransitionTime; // 0x4
	FName TargetCamGroup; // 0x8
	int32_t ShotNumber; // 0x10
};

struct FKAggregateGeom {
	TArray<FKSphereElem> SphereElems; // 0x0
	TArray<FKBoxElem> BoxElems; // 0x10
	TArray<FKSphylElem> SphylElems; // 0x20
	TArray<FKConvexElem> ConvexElems; // 0x30
	TArray<FKTaperedCapsuleElem> TaperedCapsuleElems; // 0x40
	float WireThickness; // 0x50
};

struct FA2CSPose {
	TArray<char> ComponentSpaceFlags; // 0x18
};

struct FVirtualTextureBuildSettings {
	int32_t TileSize; // 0x0
	int32_t TileBorderSize; // 0x4
	bool bEnableCompressCrunch; // 0x8
	bool bEnableCompressZlib; // 0x9
};

struct FBaseAttenuationSettings {
	EAttenuationDistanceModel DistanceAlgorithm; // 0x8
	EAttenuationShape AttenuationShape; // 0x9
	float dBAttenuationAtMax; // 0xc
	ENaturalSoundFalloffMode FalloffMode; // 0x10
	FVector AttenuationShapeExtents; // 0x14
	float ConeOffset; // 0x20
	float FalloffDistance; // 0x24
	FRuntimeFloatCurve CustomAttenuationCurve; // 0x28
};

struct FRigidBodyErrorCorrection {
	float PingExtrapolation; // 0x0
	float PingLimit; // 0x4
	float ErrorPerLinearDifference; // 0x8
	float ErrorPerAngularDifference; // 0xc
	float MaxRestoredStateError; // 0x10
	float MaxLinearHardSnapDistance; // 0x14
	float PositionLerp; // 0x18
	float AngleLerp; // 0x1c
	float LinearVelocityCoefficient; // 0x20
	float AngularVelocityCoefficient; // 0x24
	float ErrorAccumulationSeconds; // 0x28
	float ErrorAccumulationDistanceSq; // 0x2c
	float ErrorAccumulationSimilarity; // 0x30
};

struct FDoNNavigationQueryParams {
	float QueryTimeout; // 0x0
	bool bFlexibleOriginGoal; // 0x4
	bool bSkipOptimizationPass; // 0x5
	int32_t MaxOptimizerSweepAttemptsPerNode; // 0x8
	bool bPreciseDynamicCollisionRepathing; // 0xc
	bool bIgnoreDynamicCollisionRepathingForDirectGoals; // 0xd
	float CollisionShapeInflation; // 0x10
	bool bForceRescheduleQuery; // 0x14
};

struct FDeleteAnomalyDetectorRequest {
	FString Namespace; // 0x0
	FString MetricName; // 0x10
	TArray<FDimension> Dimensions; // 0x20
	FString Stat; // 0x30
};

struct FS_RadiogramUnlockCondition {
	E_UserActionType ActionType_8_650872D44972CEFB8376C4BC0E98C8EF; // 0x0
	int32_t TargetUID_9_993B63A44454AC00A5E634AF37AD2B94; // 0x4
	int32_t Count_10_191085054AC4230B99995F90E48B1C51; // 0x8
};

struct FMetricDatum {
	FString MetricName; // 0x0
	TArray<FDimension> Dimensions; // 0x10
	FDateTime Timestamp; // 0x20
	float Value; // 0x28
	FStatisticSet StatisticValues; // 0x2c
	TArray<float> Values; // 0x40
	TArray<float> Counts; // 0x50
	EStandardUnit Unit; // 0x60
	int32_t StorageResolution; // 0x64
};

struct FEnableInsightRulesResult {
	TArray<FPartialFailure> Failures; // 0x0
	FResponseMetadata ResponseMetadata; // 0x10
};

struct FPrecomputedLightInstanceData {
	FTransform Transform; // 0xc0
	FGuid LightGuid; // 0xf0
	int32_t PreviewShadowMapChannel; // 0x100
};

struct FPreviewAttachedObjectPair {
	TSoftObjectPtr<UObject> AttachedObject; // 0x0
	UObject* Object; // 0x28
	FName AttachedTo; // 0x30
};

struct FSplineMeshParams {
	FVector StartPos; // 0x0
	FVector StartTangent; // 0xc
	FVector2D StartScale; // 0x18
	float StartRoll; // 0x20
	FVector2D StartOffset; // 0x24
	FVector EndPos; // 0x2c
	FVector2D EndScale; // 0x38
	FVector EndTangent; // 0x40
	float EndRoll; // 0x4c
	FVector2D EndOffset; // 0x50
};

struct FNamedInterface {
	FName InterfaceName; // 0x0
	UObject* InterfaceObject; // 0x8
};

struct FConeConstraint {
	float Swing1LimitDegrees; // 0x14
	float Swing2LimitDegrees; // 0x18
	EAngularConstraintMotion Swing1Motion; // 0x1c
	EAngularConstraintMotion Swing2Motion; // 0x1d
};

struct FMeeleAttackType {
	float Damage; // 0x0
	TArray<FName> CheckBoneArray; // 0x8
	float CheckRange; // 0x18
	float DamageCoolTime; // 0x1c
};

struct FSourceEffectFilterSettings {
	ESourceEffectFilterCircuit FilterCircuit; // 0x0
	ESourceEffectFilterType FilterType; // 0x1
	float CutoffFrequency; // 0x4
	float FilterQ; // 0x8
	TArray<FSourceEffectFilterAudioBusModulationSettings> AudioBusModulation; // 0x10
};

struct FNiagaraUserRedirectionParameterStore {
	TMap<FNiagaraVariable, FNiagaraVariable> UserParameterRedirects; // 0x78
};

struct FWave_4 {
	float  mplitude_3_26_AC647E804AD8FF66DC479DBEE451B83; // 0x0
	float  teepness_3_27_312D7DB140157D72C96AFF8CF5729D6; // 0x4
	float  peed_3_28_D915AA5E48130D8B0506EFA66AF7742; // 0x8
	float  avelength_3_29_E256D8704B7E9B43D81E2D87CBD6575; // 0xc
	float  irection_3_30_527457804880B58848E3D984BC09299; // 0x10
};

struct FMovieSceneColorSectionTemplate {
	FMovieSceneFloatChannel Curves[0x4]; // 0x38
	EMovieSceneBlendType BlendType; // 0x2b8
};

struct FAssetData {
	FName ObjectPath; // 0x0
	FName PackageName; // 0x8
	FName PackagePath; // 0x10
	FName AssetName; // 0x18
	FName AssetClass; // 0x20
};

struct FSkeletalMeshLODGroupSettings {
	FPerPlatformFloat ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	EBoneFilterActionOption BoneFilterActionOption; // 0x8
	TArray<FBoneFilter> BoneList; // 0x10
	TArray<FName> BonesToPrioritize; // 0x20
	float WeightOfPrioritization; // 0x30
	UAnimSequence* BakePose; // 0x38
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x40
};

struct FMovieSceneTransformMask {
	uint32_t Mask; // 0x0
};

struct FMovieSceneEvaluationField {
	TArray<FMovieSceneFrameRange> Ranges; // 0x0
	TArray<FMovieSceneEvaluationGroup> Groups; // 0x10
	TArray<FMovieSceneEvaluationMetaData> MetaData; // 0x20
};

struct FVehicleDifferential4WData {
	EVehicleDifferential4W DifferentialType; // 0x0
	float FrontRearSplit; // 0x4
	float FrontLeftRightSplit; // 0x8
	float RearLeftRightSplit; // 0xc
	float CentreBias; // 0x10
	float FrontBias; // 0x14
	float RearBias; // 0x18
};

struct FBoneNode {
	FName Name; // 0x0
	int32_t ParentIndex; // 0x8
	EBoneTranslationRetargetingMode TranslationRetargetingMode; // 0xc
};

struct FTextAppearance {
	FSlateColor ColorAndOpacity; // 0x0
	FSlateFontInfo Font; // 0x28
	FVector2D ShadowOffset; // 0x80
	FLinearColor ShadowColorAndOpacity; // 0x88
	ETextJustify Justification; // 0x98
};

struct FSubmixEffectFilterSettings {
	ESubmixFilterType FilterType; // 0x0
	ESubmixFilterAlgorithm FilterAlgorithm; // 0x1
	float FilterFrequency; // 0x4
	float FilterQ; // 0x8
};

struct FBlueprintInputActionDelegateBinding {
	FName InputActionName; // 0x4
	EInputEvent InputKeyEvent; // 0xc
	FName FunctionNameToBind; // 0x10
};

struct FLevelSimplificationDetails {
	bool bCreatePackagePerAsset; // 0x0
	float DetailsPercentage; // 0x4
	FMaterialProxySettings StaticMeshMaterialSettings; // 0x8
	bool bOverrideLandscapeExportLOD; // 0x90
	int32_t LandscapeExportLOD; // 0x94
	FMaterialProxySettings LandscapeMaterialSettings; // 0x98
	bool bBakeFoliageToLandscape; // 0x120
	bool bBakeGrassToLandscape; // 0x121
	bool bGenerateMeshNormalMap; // 0x122
	bool bGenerateMeshMetallicMap; // 0x123
	bool bGenerateMeshRoughnessMap; // 0x124
	bool bGenerateMeshSpecularMap; // 0x125
	bool bGenerateLandscapeNormalMap; // 0x126
	bool bGenerateLandscapeMetallicMap; // 0x127
	bool bGenerateLandscapeRoughnessMap; // 0x128
	bool bGenerateLandscapeSpecularMap; // 0x129
};

struct FCameraLookatTrackingSettings {
	char bEnableLookAtTracking : 1; // 0x0
	char bDrawDebugLookAtTrackingPosition : 1; // 0x0
	float LookAtTrackingInterpSpeed; // 0x4
	TSoftObjectPtr<AActor> ActorToTrack; // 0x18
	FVector RelativeOffset; // 0x40
	char bAllowRoll : 1; // 0x4c
};

struct FLetterboxLayoutSettings {
	bool bIsLoadingWidgetAtTop; // 0x0
	FWidgetAlignment TipAlignment; // 0x1
	FWidgetAlignment LoadingWidgetAlignment; // 0x3
	EHorizontalAlignment TopBorderHorizontalAlignment; // 0x5
	EHorizontalAlignment BottomBorderHorizontalAlignment; // 0x6
	FMargin TopBorderPadding; // 0x8
	FMargin BottomBorderPadding; // 0x18
	FSlateBrush TopBorderBackground; // 0x28
	FSlateBrush BottomBorderBackground; // 0xb0
};

struct FMovieSceneSectionParameters {
	FFrameNumber StartFrameOffset; // 0x0
	bool bCanLoop; // 0x4
	FFrameNumber EndFrameOffset; // 0x8
	FFrameNumber FirstLoopStartFrameOffset; // 0xc
	float TimeScale; // 0x10
	int32_t HierarchicalBias; // 0x14
	float StartOffset; // 0x18
	float PrerollTime; // 0x1c
	float PostrollTime; // 0x20
};

struct FLandscapeInfoLayerSettings {
	ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
	FName LayerName; // 0x8
};

struct FNiagaraCompileHashVisitorDebugInfo {
	FString Object; // 0x0
	TArray<FString> PropertyKeys; // 0x10
	TArray<FString> PropertyValues; // 0x20
};

struct FBP_TimeOfDaySettings {
	FTimecode Time_3_5DBEF663412E8EC4122CA4895A6F6EA3; // 0x0
	TArray<AActor*> Actors_10_425ABEB44D93B790B529CDA83D7675CE; // 0x18
	FFloatValueFromDataTable Temperature_15_ADB25DCF49C6C4893F88079B3345F39E; // 0x28
};

struct FBPComponentClassOverride {
	FName ComponentName; // 0x0
	UObject* ComponentClass; // 0x8
};

struct FCameraLensSettings {
	float MinFocalLength; // 0x0
	float MaxFocalLength; // 0x4
	float MinFStop; // 0x8
	float MaxFStop; // 0xc
	float MinimumFocusDistance; // 0x10
	int32_t DiaphragmBladeCount; // 0x14
};

struct FPositionHistory {
	TArray<FVector> Positions; // 0x0
	float Range; // 0x10
};

struct FCustomizedMaterialTexture2D {
	FName Name; // 0x0
	UTexture2D* Texture; // 0x8
};

struct FMovieSceneParameterSectionTemplate {
	TArray<FScalarParameterNameAndCurve> Scalars; // 0x20
	TArray<FBoolParameterNameAndCurve> Bools; // 0x30
	TArray<FVector2DParameterNameAndCurves> Vector2Ds; // 0x40
	TArray<FVectorParameterNameAndCurves> Vectors; // 0x50
	TArray<FColorParameterNameAndCurves> Colors; // 0x60
	TArray<FTransformParameterNameAndCurves> Transforms; // 0x70
};

struct FNodeHierarchyWithUserData {
	FNodeHierarchyData Hierarchy; // 0x8
};

struct FBakedAnimationState {
	FName StateName; // 0x0
	TArray<FBakedStateExitTransition> Transitions; // 0x8
	int32_t StateRootNodeIndex; // 0x18
	int32_t StartNotify; // 0x1c
	int32_t EndNotify; // 0x20
	int32_t FullyBlendedNotify; // 0x24
	bool bIsAConduit; // 0x28
	int32_t EntryRuleNodeIndex; // 0x2c
	TArray<int32_t> PlayerNodeIndices; // 0x30
	TArray<int32_t> LayerNodeIndices; // 0x40
	bool bAlwaysResetOnEntry; // 0x50
};

struct FScreenMessageString {
	uint64_t Key; // 0x0
	FString ScreenMessage; // 0x8
	FColor DisplayColor; // 0x18
	float TimeToDisplay; // 0x1c
	float CurrentTimeDisplayed; // 0x20
	FVector2D TextScale; // 0x24
};

struct FMovieSceneEntityComponentField {
	FMovieSceneEvaluationFieldEntityTree PersistentEntityTree; // 0x0
	FMovieSceneEvaluationFieldEntityTree OneShotEntityTree; // 0x60
	TArray<FMovieSceneEvaluationFieldEntity> Entities; // 0xc0
	TArray<FMovieSceneEvaluationFieldEntityMetaData> EntityMetaData; // 0xd0
	TArray<FMovieSceneEvaluationFieldSharedEntityMetaData> SharedMetaData; // 0xe0
};

struct FEmitterDynamicParameter {
	FName ParamName; // 0x0
	char bUseEmitterTime : 1; // 0x8
	char bSpawnTimeOnly : 1; // 0x8
	EEmitterDynamicParameterValue ValueMethod; // 0xc
	char bScaleVelocityByParamValue : 1; // 0x10
	FRawDistributionFloat ParamValue; // 0x18
};

struct FLightmassMaterialInterfaceSettings {
	float EmissiveBoost; // 0x0
	float DiffuseBoost; // 0x4
	float ExportResolutionScale; // 0x8
	char bCastShadowAsMasked : 1; // 0xc
	char bOverrideCastShadowAsMasked : 1; // 0xc
	char bOverrideEmissiveBoost : 1; // 0xc
	char bOverrideDiffuseBoost : 1; // 0xc
	char bOverrideExportResolutionScale : 1; // 0xc
};

struct FSoundGroup {
	ESoundGroup SoundGroup; // 0x0
	FString DisplayName; // 0x8
	char bAlwaysDecompressOnLoad : 1; // 0x18
	float DecompressedDuration; // 0x1c
};

struct FTrackedGeometryGroup {
	AARActor* ARActor; // 0x0
	UARComponent* ARComponent; // 0x8
	UARTrackedGeometry* TrackedGeometry; // 0x10
};

struct FMovieSceneSkeletalAnimationSectionTemplate {
	FMovieSceneSkeletalAnimationSectionTemplateParameters Params; // 0x20
};

struct FMovieSceneAkAudioRTPCTemplate {
	UMovieSceneAkAudioRTPCSection* Section; // 0x20
};

struct FAnimTrack {
	TArray<FAnimSegment> AnimSegments; // 0x0
};

struct FSourceEffectChorusSettings {
	float Depth; // 0x0
	float Frequency; // 0x4
	float Feedback; // 0x8
	float WetLevel; // 0xc
	float DryLevel; // 0x10
	float Spread; // 0x14
	FSoundModulationDestinationSettings DepthModulation; // 0x18
	FSoundModulationDestinationSettings FrequencyModulation; // 0x28
	FSoundModulationDestinationSettings FeedbackModulation; // 0x38
	FSoundModulationDestinationSettings WetModulation; // 0x48
	FSoundModulationDestinationSettings DryModulation; // 0x58
	FSoundModulationDestinationSettings SpreadModulation; // 0x68
};

struct FS_ConvertSlot {
	FString ID_2_7E76D2E741A2D7EDE00569A40E4FEE24; // 0x0
	float Current_15_0FF22EFE4E98B40133D29BAFB7E36CEB; // 0x10
	float Total_12_0726084A4E88424CBDA2F4850805F067; // 0x14
	int32_t Count_9_3F77FA3B41BE63A1D1F8708FD1BB6A30; // 0x18
	int32_t Index_11_04BAA7D340B683955785AFB5E91BE6BD; // 0x1c
};

struct FIndexedCurve {
	FKeyHandleMap KeyHandlesToIndices; // 0x8
};

struct FSubTrackGroup {
	FString GroupName; // 0x0
	TArray<int32_t> TrackIndices; // 0x10
	char bIsCollapsed : 1; // 0x20
	char bIsSelected : 1; // 0x20
};

struct FTimeStretchCurveInstance {
	bool bHasValidData; // 0x0
};

struct FWeaponAttachmentForeGrip {
	FWeaponAttachmentAbility BaseAbility; // 0x8
	float RecoilMultiply; // 0xc0
	float ADSSpeedMultiply; // 0xc4
	UAnimSequenceBase* GripAnim; // 0xc8
};

struct FS_FunctionalitySave {
	FS_InventorySave Fuel_45_5948430341D4061BD7AEC089864B2071; // 0x0
	FS_InventorySave Convert_46_777CB50647C4B75E2BDEF5B17A514129; // 0x40
	FS_InventorySave Output_47_B753EACB4AD02BC1980F95891E95ADDC; // 0x80
	bool SwitchedOn_25_D5AA204948BE36B005A3E2A4A360925B; // 0xc0
	float ChargedEnergy_34_D5EC4272420285E926443ABA1A15F1C3; // 0xc4
	TArray<FS_CraftingSlot> CraftingListing_52_2687E1964246675530B271A50808FE35; // 0xc8
	float EMPReleaseTime_55_75A6A0FF4466C26B4F984DAD9B1A1698; // 0xd8
	TArray<bool> BoolSaveParameter_58_8BEE8F924AF22D078442D394813A54AB; // 0xe0
};

struct FSoundConcurrencySettings {
	int32_t MaxCount; // 0x0
	char bLimitToOwner : 1; // 0x4
	EMaxConcurrentResolutionRule ResolutionRule; // 0x8
	float RetriggerTime; // 0xc
	float VolumeScale; // 0x10
	EConcurrencyVolumeScaleMode VolumeScaleMode; // 0x14
	float VolumeScaleAttackTime; // 0x18
	char bVolumeScaleCanRelease : 1; // 0x1c
	float VolumeScaleReleaseTime; // 0x20
	float VoiceStealReleaseTime; // 0x24
};

struct FWeightedBlendables {
	TArray<FWeightedBlendable> Array; // 0x0
};

struct FDropNoteInfo {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	FString Comment; // 0x18
};

struct FMaterialQualityOverrides {
	bool bDiscardQualityDuringCook; // 0x0
	bool bEnableOverride; // 0x1
	bool bForceFullyRough; // 0x2
	bool bForceNonMetal; // 0x3
	bool bForceDisableLMDirectionality; // 0x4
	bool bForceLQReflections; // 0x5
	bool bForceDisablePreintegratedGF; // 0x6
	bool bDisableMaterialNormalCalculation; // 0x7
	EMobileShadowQuality MobileShadowQuality; // 0x8
};

struct FDialogueWaveParameter {
	UDialogueWave* DialogueWave; // 0x0
	FDialogueContext Context; // 0x8
};

struct FDedicateServerHeartBeat {
	FString SenderIP; // 0x0
};

struct FBoxSphereBounds {
	FVector Origin; // 0x0
	FVector BoxExtent; // 0xc
	float SphereRadius; // 0x18
};

struct FAutoCompleteNode {
	int32_t IndexChar; // 0x0
	TArray<int32_t> AutoCompleteListIndices; // 0x8
};

struct FAutomationExecutionEntry {
	FAutomationEvent Event; // 0x0
	FString Filename; // 0x38
	int32_t LineNumber; // 0x48
	FDateTime Timestamp; // 0x50
};

struct FMovieSceneTrackEvaluationFieldEntry {
	UMovieSceneSection* Section; // 0x0
	FFrameNumberRange Range; // 0x8
	FFrameNumber ForcedTime; // 0x18
	ESectionEvaluationFlags Flags; // 0x1c
	int16_t LegacySortOrder; // 0x1e
};

struct FGameplayTagQuery {
	int32_t TokenStreamVersion; // 0x0
	TArray<FGameplayTag> TagDictionary; // 0x8
	TArray<char> QueryTokenStream; // 0x18
	FString UserDescription; // 0x28
	FString AutoDescription; // 0x38
};

struct FAnimSegment {
	UAnimSequenceBase* AnimReference; // 0x0
	float StartPos; // 0x8
	float AnimStartTime; // 0xc
	float AnimEndTime; // 0x10
	float AnimPlayRate; // 0x14
	int32_t LoopingCount; // 0x18
};

struct FQuartzTimeSignature {
	int32_t NumBeats; // 0x0
	EQuartzTimeSignatureQuantization BeatType; // 0x4
	TArray<FQuartzPulseOverrideStep> OptionalPulseOverride; // 0x8
};

struct FReferencePose {
	FName PoseName; // 0x0
	TArray<FTransform> ReferencePose; // 0x8
};

struct FEnvOverlapData {
	float ExtentX; // 0x0
	float ExtentY; // 0x4
	float ExtentZ; // 0x8
	FVector ShapeOffset; // 0xc
	ECollisionChannel OverlapChannel; // 0x18
	EEnvOverlapShape OverlapShape; // 0x19
	char bOnlyBlockingHits : 1; // 0x1c
	char bOverlapComplex : 1; // 0x1c
	char bSkipOverlapQuerier : 1; // 0x1c
};

struct FBrushEffectCurves {
	bool bUseCurveChannel; // 0x0
	UCurveFloat* ElevationCurveAsset; // 0x8
	float ChannelEdgeOffset; // 0x10
	float ChannelDepth; // 0x14
	float CurveRampWidth; // 0x18
};

struct FSkeletalMeshSamplingBuiltData {
	TArray<FSkeletalMeshSamplingLODBuiltData> WholeMeshBuiltData; // 0x0
	TArray<FSkeletalMeshSamplingRegionBuiltData> RegionBuiltData; // 0x10
};

struct FItemWeight {
	int32_t Weight; // 0x0
	FItemCodeValue Item; // 0x8
};

struct FBeamModifierOptions {
	char bModify : 1; // 0x0
	char bScale : 1; // 0x0
	char bLock : 1; // 0x0
};

struct FTimelineVectorTrack {
	UCurveVector* VectorCurve; // 0x0
	FDelegate InterpFunc; // 0x8
	FName TrackName; // 0x18
	FName VectorPropertyName; // 0x20
};

struct FNiagaraBool {
	int32_t Value; // 0x0
};

struct FNiagaraParameterScopeInfo {
	ENiagaraParameterScope Scope; // 0x0
	FString NamespaceString; // 0x8
};

struct FRadialDamageEvent {
	FRadialDamageParams Params; // 0x10
	FVector Origin; // 0x24
	TArray<FHitResult> ComponentHits; // 0x30
};

struct FMetOccupyInfo {
	EMetSign Sign; // 0x0
	bool Occupyed; // 0x1
	float ServerPrograss; // 0x4
	bool FailOccupy; // 0x8
	float FailTime; // 0xc
};

struct FAimConstraintDescription {
	FAxis LookAt_Axis; // 0x10
	FAxis LookUp_Axis; // 0x20
	bool bUseLookUp; // 0x30
	FVector LookUpTarget; // 0x34
};

struct FInstancedStaticMeshInstanceData {
	FMatrix Transform; // 0x0
};

struct FBlackboardEntry {
	FName EntryName; // 0x0
	UBlackboardKeyType* KeyType; // 0x8
	char bInstanceSynced : 1; // 0x10
};

struct FLogStream {
	FString LogStreamName; // 0x0
	float CreationTime; // 0x10
	float FirstEventTimestamp; // 0x14
	float LastEventTimestamp; // 0x18
	float LastIngestionTime; // 0x1c
	FString UploadSequenceToken; // 0x20
	FString Arn; // 0x30
};

struct FMarkerSyncAnimPosition {
	FName PreviousMarkerName; // 0x0
	FName NextMarkerName; // 0x8
	float PositionBetweenMarkers; // 0x10
};

struct FTimelineLinearColorTrack {
	UCurveLinearColor* LinearColorCurve; // 0x0
	FDelegate InterpFunc; // 0x8
	FName TrackName; // 0x18
	FName LinearColorPropertyName; // 0x20
};

struct FParticleSysParam {
	FName Name; // 0x0
	EParticleSysParamType ParamType; // 0x8
	float Scalar; // 0xc
	float Scalar_Low; // 0x10
	FVector Vector; // 0x14
	FVector Vector_Low; // 0x20
	FColor Color; // 0x2c
	AActor* Actor; // 0x30
	UMaterialInterface* Material; // 0x38
};

struct FMetric {
	FString Namespace; // 0x0
	FString MetricName; // 0x10
	TArray<FDimension> Dimensions; // 0x20
};

struct FCustomDefine {
	FString DefineName; // 0x0
	FString DefineValue; // 0x10
};

struct FVector2D {
	float X; // 0x0
	float Y; // 0x4
};

struct FPropertyAccessIndirection {
	TFieldPath<FArrayProperty> ArrayProperty; // 0x0
	UFunction* Function; // 0x20
	int32_t ReturnBufferSize; // 0x28
	int32_t ReturnBufferAlignment; // 0x2c
	int32_t ArrayIndex; // 0x30
	uint32_t Offset; // 0x34
	EPropertyAccessObjectType ObjectType; // 0x38
	EPropertyAccessIndirectionType Type; // 0x39
};

struct FSQSListQueuesRequest {
	FString QueueNamePrefix; // 0x0
	FString NextToken; // 0x10
	int32_t MaxResults; // 0x20
};

struct FMovieSceneGeometryCacheParams {
	UGeometryCache* GeometryCacheAsset; // 0x0
	FFrameNumber FirstLoopStartFrameOffset; // 0x8
	FFrameNumber StartFrameOffset; // 0xc
	FFrameNumber EndFrameOffset; // 0x10
	float PlayRate; // 0x14
	char bReverse : 1; // 0x18
	float StartOffset; // 0x1c
	float EndOffset; // 0x20
	FSoftObjectPath GeometryCache; // 0x28
};

struct FVolumeControlStyle {
	FSliderStyle SliderStyle; // 0x8
	FSlateBrush HighVolumeImage; // 0x348
	FSlateBrush MidVolumeImage; // 0x3d0
	FSlateBrush LowVolumeImage; // 0x458
	FSlateBrush NoVolumeImage; // 0x4e0
	FSlateBrush MutedImage; // 0x568
};

struct FUVMapSettings {
	FVector Size; // 0x0
	FVector2D UVTile; // 0xc
	FVector Position; // 0x14
	FRotator Rotation; // 0x20
	FVector Scale; // 0x2c
};

struct FBlendSampleData {
	int32_t SampleDataIndex; // 0x0
	UAnimSequence* Animation; // 0x8
	float TotalWeight; // 0x10
	float Time; // 0x14
	float PreviousTime; // 0x18
	float SamplePlayRate; // 0x1c
};

struct FDescribeQueryDefinitionsResult {
	TArray<FQueryDefinition> QueryDefinitions; // 0x0
	FString NextToken; // 0x10
};

struct FMovieSceneEvaluationMetaData {
	TArray<FMovieSceneSequenceID> ActiveSequences; // 0x0
	TArray<FMovieSceneOrderedEvaluationKey> ActiveEntities; // 0x10
};

struct FTimerHandle {
	uint64_t handle; // 0x0
};

struct FMovieSceneGeometryCollectionSectionTemplateParameters {
	FFrameNumber SectionStartTime; // 0x30
	FFrameNumber SectionEndTime; // 0x34
};

struct FWorkshopItemUpdateInfo {
	EItemUpdateStatusBP Status; // 0x20
};

struct FItemCodeValue {
	FDataTableRowHandle Item; // 0x0
	int32_t Count; // 0x10
};

struct FBakedDataInfo {
	FName Name; // 0x0
	int32_t Size; // 0x8
};

struct FCurveEdTab {
	FString TabName; // 0x0
	TArray<FCurveEdEntry> Curves; // 0x10
	float ViewStartInput; // 0x20
	float ViewEndInput; // 0x24
	float ViewStartOutput; // 0x28
	float ViewEndOutput; // 0x2c
};

struct FVMExternalFunctionBindingInfo {
	FName Name; // 0x0
	FName OwnerName; // 0x8
	TArray<bool> InputParamLocations; // 0x10
	int32_t NumOutputs; // 0x20
	TArray<FVMFunctionSpecifier> FunctionSpecifiers; // 0x28
};

struct FActorSequenceObjectReferenceMap {
	TArray<FGuid> BindingIds; // 0x0
	TArray<FActorSequenceObjectReferences> References; // 0x10
};

struct FVertexInstancesForPolygonHole {
	TArray<FVertexIndexAndInstanceID> VertexIndicesAndInstanceIDs; // 0x0
};

struct FPropertyAccessCopyBatch {
	TArray<FPropertyAccessCopy> Copies; // 0x0
};

struct FSoundSubmixSendInfo {
	ESendLevelControlMethod SendLevelControlMethod; // 0x0
	ESubmixSendStage SendStage; // 0x1
	USoundSubmixBase* SoundSubmix; // 0x8
	float SendLevel; // 0x10
	float MinSendLevel; // 0x14
	float MaxSendLevel; // 0x18
	float MinSendDistance; // 0x1c
	float MaxSendDistance; // 0x20
	FRuntimeFloatCurve CustomSendLevelCurve; // 0x28
};

struct FFloatInterval {
	float Min; // 0x0
	float Max; // 0x4
};

struct FBlueprintCookedComponentInstancingData {
	TArray<FBlueprintComponentChangedPropertyInfo> ChangedPropertyList; // 0x0
	bool bHasValidCookedData; // 0x21
};

struct FMovieSceneEasingSettings {
	int32_t AutoEaseInDuration; // 0x0
	int32_t AutoEaseOutDuration; // 0x4
	TScriptInterface<IMovieSceneEasingFunction> EaseIn; // 0x8
	bool bManualEaseIn; // 0x18
	int32_t ManualEaseInDuration; // 0x1c
	TScriptInterface<IMovieSceneEasingFunction> EaseOut; // 0x20
	bool bManualEaseOut; // 0x30
	int32_t ManualEaseOutDuration; // 0x34
};

struct FMovieSceneFloatChannel {
	ERichCurveExtrapolation PreInfinityExtrap; // 0x8
	ERichCurveExtrapolation PostInfinityExtrap; // 0x9
	TArray<FFrameNumber> Times; // 0x10
	TArray<FMovieSceneFloatValue> Values; // 0x20
	float DefaultValue; // 0x30
	bool bHasDefaultValue; // 0x34
	FMovieSceneKeyHandleMap KeyHandles; // 0x38
	FFrameRate TickResolution; // 0x98
};

struct FFontOutlineSettings {
	int32_t OutlineSize; // 0x0
	bool bSeparateFillAlpha; // 0x4
	bool bApplyOutlineToDropShadows; // 0x5
	UObject* OutlineMaterial; // 0x8
	FLinearColor OutlineColor; // 0x10
};

struct FPrimaryAssetId {
	FPrimaryAssetType PrimaryAssetType; // 0x0
	FName PrimaryAssetName; // 0x8
};

struct FSupportedSubTrackInfo {
	UInterpTrack* SupportedClass; // 0x0
	FString SubTrackName; // 0x8
	int32_t GroupIndex; // 0x18
};

struct FTagLogGroupRequest {
	FString LogGroupName; // 0x0
	TMap<FString, FString> Tags; // 0x10
};

struct FSlateSound {
	UObject* ResourceObject; // 0x0
};

struct FCustomizableObjectVectorParameterValue {
	FString ParameterName; // 0x0
	FLinearColor ParameterValue; // 0x10
	FString UID; // 0x20
};

struct FStringCurveKey {
	float Time; // 0x0
	FString Value; // 0x8
};

struct FMovieSceneSegmentIdentifier {
	int32_t IdentifierIndex; // 0x0
};

struct FBrushEffectDisplacement {
	float DisplacementHeight; // 0x0
	float DisplacementTiling; // 0x4
	UTexture2D* Texture; // 0x8
	float Midpoint; // 0x10
	FLinearColor Channel; // 0x14
	float WeightmapInfluence; // 0x24
};

struct FDonNavVoxelXYZ {
	TArray<FDonNavVoxelX> X; // 0x0
};

struct FS_UserCustomizeInfo {
	FName Face_12_02FE2ACB4B460582F94D8E93D37C5085; // 0x0
	FName Hair_9_E47DDA1743EE6E5B2BEB448CFD8E2E5F; // 0x8
	FLinearColor SkinColor_7_1AA73A6044E477F253853295E3DA34A8; // 0x10
	FLinearColor HairColor_8_8C68ABCC4928B4862C840B8249AD0051; // 0x20
	FName MachineArm_15_21A74EB04E07F94769E6809638ACB725; // 0x30
};

struct FLaunchOnTestSettings {
	FFilePath LaunchOnTestmap; // 0x0
	FString DeviceID; // 0x10
};

struct FMovieScene3DRotationKeyStruct {
	FRotator Rotation; // 0x8
	FFrameNumber Time; // 0x14
};

struct FAnimNotifyInfo {
	FName NotifyName; // 0x0
	float TriggerTime; // 0x8
	USVAnimNotify* AnimNotify; // 0x10
	bool IsTriggerd; // 0x18
};

struct FAnimationStateBase {
	FName StateName; // 0x0
};

struct FInputActionKeyMapping {
	FName ActionName; // 0x0
	char bShift : 1; // 0x8
	char bCtrl : 1; // 0x8
	char bAlt : 1; // 0x8
	char bCmd : 1; // 0x8
	FKey Key; // 0x10
};

struct FS_SaveVehicle {
	int32_t HP_6_A0149FDB4B3E1FB0028D5695F2FECC26; // 0x0
	FTransform Location_2_B8B64608462B9E4B0ED34AB56AD113FC; // 0x10
	int32_t Battery_10_172FB7D647304183E50AC98EDB998412; // 0x40
	int32_t VariableMaxHealth_13_A56BC7E54349EDBEFB743DADFD2B4993; // 0x44
	bool IsActivateVehicle_15_F5E4C07A4081BFCDA28FB6984881CCC2; // 0x48
};

struct FDatasmithTessellationOptions {
	float ChordTolerance; // 0x0
	float MaxEdgeLength; // 0x4
	float NormalTolerance; // 0x8
	EDatasmithCADStitchingTechnique StitchingTechnique; // 0xc
};

struct FStaticTerrainLayerWeightParameter {
	int32_t WeightmapIndex; // 0x24
	bool bWeightBasedBlend; // 0x28
};

struct FFloatValueFromDataTable {
	float Value; // 0x20
};

struct FMorphTargetVertexIndex {
	int32_t MorphIndex; // 0x0
	int32_t VertexIndex; // 0x4
};

struct FSubmixEffectDelaySettings {
	float MaximumDelayLength; // 0x0
	float InterpolationTime; // 0x4
	float DelayLength; // 0x8
};

struct FSkeletalMeshOptimizationSettings {
	SkeletalMeshTerminationCriterion TerminationCriterion; // 0x0
	float NumOfTrianglesPercentage; // 0x4
	float NumOfVertPercentage; // 0x8
	uint32_t MaxNumOfTriangles; // 0xc
	uint32_t MaxNumOfVerts; // 0x10
	float MaxDeviationPercentage; // 0x14
	SkeletalMeshOptimizationType ReductionMethod; // 0x18
	SkeletalMeshOptimizationImportance SilhouetteImportance; // 0x19
	SkeletalMeshOptimizationImportance TextureImportance; // 0x1a
	SkeletalMeshOptimizationImportance ShadingImportance; // 0x1b
	SkeletalMeshOptimizationImportance SkinningImportance; // 0x1c
	char bRemapMorphTargets : 1; // 0x1d
	char bRecalcNormals : 1; // 0x1d
	float WeldingThreshold; // 0x20
	float NormalsThreshold; // 0x24
	int32_t MaxBonesPerVertex; // 0x28
	char bEnforceBoneBoundaries : 1; // 0x2c
	float VolumeImportance; // 0x30
	char bLockEdges : 1; // 0x34
	char bLockColorBounaries : 1; // 0x34
	int32_t BaseLOD; // 0x38
};

struct FNiagaraScriptHighlight {
	FLinearColor Color; // 0x0
	FText DisplayName; // 0x10
};

struct FPurchaseItemDetails {
	FString Price; // 0x10
	FString Name; // 0x20
	PurchaseType Type; // 0x30
};

struct FSolverBreakingData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	FVector AngularVelocity; // 0x18
	float Mass; // 0x24
	int32_t ParticleIndex; // 0x28
	int32_t ParticleIndexMesh; // 0x2c
};

struct FS_MachineArmAbilityInfo {
	FText MainAbilityCategoryName_13_A415773F4E5B089225D5619D0D3D3DB6; // 0x0
	TArray<FMachinArmAbilitySub> SubAbilityCategory_12_0D551AF34CBD60C535205E966BC9B024; // 0x18
	int32_t SortOrder_10_9A1AF4A8449DB395194C77A33C00CB76; // 0x28
};

struct FBlendProfileBoneEntry {
	FBoneReference BoneReference; // 0x0
	float BlendScale; // 0x10
};

struct FAkCommunicationSettingsWithCommSelection {
	EAkCommSystem CommunicationSystem; // 0x20
};

struct FDisassociateKmsKeyRequest {
	FString LogGroupName; // 0x0
};

struct FEasingComponentData {
	UMovieSceneSection* Section; // 0x0
};

struct FS_SaveItem {
	FS_SaveInv ItemID_8_45ED17B64A514C45F34DCF933D53BC49; // 0x0
	FTransform ItemLocation_9_0FB12F7F47B2FE330B605488B032F71C; // 0x30
	FString ItemName_10_E6FA40FF492AA3CFCC67B8914882C0EE; // 0x60
	FS_SaveWeaponInvs ItemWeapon_16_3D0455574002389C8933CE964036E3B9; // 0x70
};

struct FPrimaryAssetTypeInfo {
	FName PrimaryAssetType; // 0x0
	TSoftClassPtr<UObject> AssetBaseClass; // 0x8
	UObject* AssetBaseClassLoaded; // 0x30
	bool bHasBlueprintClasses; // 0x38
	bool bIsEditorOnly; // 0x39
	TArray<FDirectoryPath> Directories; // 0x40
	TArray<FSoftObjectPath> SpecificAssets; // 0x50
	FPrimaryAssetRules Rules; // 0x60
	TArray<FString> AssetScanPaths; // 0x70
	bool bIsDynamicAsset; // 0x80
	int32_t NumberOfAssets; // 0x84
};

struct FColorGradingSettings {
	FColorGradePerRangeSettings Global; // 0x0
	FColorGradePerRangeSettings Shadows; // 0x50
	FColorGradePerRangeSettings Midtones; // 0xa0
	FColorGradePerRangeSettings Highlights; // 0xf0
	float ShadowsMax; // 0x140
	float HighlightsMin; // 0x144
};

struct FBT_FlyToTarget_DebugParams {
	bool bVisualizePawnAsVoxels; // 0xc
};

struct FTipSettings {
	TArray<FText> TipText; // 0x0
	FTextAppearance Appearance; // 0x10
	float TipWrapAt; // 0xb0
	bool bSetDisplayTipTextManually; // 0xb4
	float UpdateTime; // 0xb8
};

struct FMovieSceneFloatChannelSerializationHelper {
	ERichCurveExtrapolation PreInfinityExtrap; // 0x0
	ERichCurveExtrapolation PostInfinityExtrap; // 0x1
	TArray<int32_t> Times; // 0x8
	TArray<FMovieSceneFloatValueSerializationHelper> Values; // 0x18
	float DefaultValue; // 0x28
	bool bHasDefaultValue; // 0x2c
};

struct FPlatformInterfaceData {
	FName DataName; // 0x0
	EPlatformInterfaceDataType Type; // 0x8
	int32_t IntValue; // 0xc
	float FloatValue; // 0x10
	FString StringValue; // 0x18
	UObject* ObjectValue; // 0x28
};

struct FTickFunction {
	ETickingGroup TickGroup; // 0x8
	ETickingGroup EndTickGroup; // 0x9
	char bTickEvenWhenPaused : 1; // 0xa
	char bCanEverTick : 1; // 0xa
	char bStartWithTickEnabled : 1; // 0xa
	char bAllowTickOnDedicatedServer : 1; // 0xa
	float TickInterval; // 0xc
};

struct FKShapeElem {
	float RestOffset; // 0x8
	FName Name; // 0xc
	char bContributeToMass : 1; // 0x18
	ECollisionEnabled CollisionEnabled; // 0x19
};

struct FStreamingRenderAssetPrimitiveInfo {
	UStreamableRenderAsset* RenderAsset; // 0x0
	FBoxSphereBounds Bounds; // 0x8
	float TexelFactor; // 0x24
	uint32_t PackedRelativeBox; // 0x28
	char bAllowInvalidTexelFactorWhenUnregistered : 1; // 0x2c
};

struct FPaperTerrainMaterialRule {
	UPaperSprite* StartCap; // 0x0
	TArray<UPaperSprite*> Body; // 0x8
	UPaperSprite* EndCap; // 0x18
	float MinimumAngle; // 0x20
	float MaximumAngle; // 0x24
	bool bEnableCollision; // 0x28
	float CollisionOffset; // 0x2c
	int32_t DrawOrder; // 0x30
};

struct FS_UserUIDWithNick {
	FString Nickname_3_B44C8ED8422952B5074470A9F3B7E90F; // 0x0
	FString UID_4_FA16B80247D98D693424B690EF855B51; // 0x10
};

struct FMovieScene3DLocationKeyStruct {
	FVector Location; // 0x8
	FFrameNumber Time; // 0x14
};

struct FSAudioUpdateStruct {
	UAudioComponent* AudioEmittor_5_EC37367D413769EBC8347085400A4A09; // 0x0
	EAudioType AudioType_4_3CDAA07D4BB9A7FC4028B7A4994A497E; // 0x8
	float OriginalVolumeMultiplier_11_352BE51B46F8B38B523630B64B21A772; // 0xc
};

struct FComboBoxStyle {
	FComboButtonStyle ComboButtonStyle; // 0x8
	FSlateSound PressedSlateSound; // 0x3c0
	FSlateSound SelectionChangeSlateSound; // 0x3d8
};

struct FNiagaraRibbonUVSettings {
	ENiagaraRibbonUVEdgeMode LeadingEdgeMode; // 0x0
	ENiagaraRibbonUVEdgeMode TrailingEdgeMode; // 0x4
	ENiagaraRibbonUVDistributionMode DistributionMode; // 0x8
	float TilingLength; // 0xc
	FVector2D Offset; // 0x10
	FVector2D Scale; // 0x18
	bool bEnablePerParticleUOverride; // 0x20
	bool bEnablePerParticleVRangeOverride; // 0x21
};

struct FUdpMockMessage {
	TArray<char> Data; // 0x0
};

struct FTerraShopDataInfo {
	ETerraShopMerchandiseType MechandiseType; // 0x8
	FItemCodeValue Item; // 0x10
	int32_t PurchaseCost; // 0x28
	int32_t PurchasableCount; // 0x2c
	float Weight; // 0x30
};

struct FEMPTowerInfo {
	int32_t TowerUID; // 0x0
	FVector Location; // 0x4
	bool IsActivate; // 0x10
	bool IsForward; // 0x11
	float ExtendedServerTime; // 0x14
};

struct FSearchedLogStream {
	FString LogStreamName; // 0x0
	bool bSearchedCompletely; // 0x10
};

struct FPrimaryAssetRulesOverride {
	FPrimaryAssetId PrimaryAssetId; // 0x0
	FPrimaryAssetRules Rules; // 0x10
};

struct FRawDistributionFloat {
	float MinValue; // 0x20
	float MaxValue; // 0x24
	UDistributionFloat* Distribution; // 0x28
};

struct FDestructibleDamageParameters {
	float DamageThreshold; // 0x0
	float DamageSpread; // 0x4
	bool bEnableImpactDamage; // 0x8
	float ImpactDamage; // 0xc
	int32_t DefaultImpactDamageDepth; // 0x10
	bool bCustomImpactResistance; // 0x14
	float ImpactResistance; // 0x18
};

struct FNickNameTable {
	FString NickName; // 0x8
};

struct FInAppPurchaseRestoreInfo {
	FString Identifier; // 0x0
	FString ReceiptData; // 0x10
	FString TransactionIdentifier; // 0x20
};

struct FOverriddenValue {
	FString Name; // 0x0
	FString Value; // 0x10
};

struct FLinearConstraint {
	float Limit; // 0x14
	ELinearConstraintMotion XMotion; // 0x18
	ELinearConstraintMotion YMotion; // 0x19
	ELinearConstraintMotion ZMotion; // 0x1a
};

struct FPerBoneBlendWeights {
	TArray<FPerBoneBlendWeight> BoneBlendWeights; // 0x0
};

struct FStreamingLevelsToConsider {
	TArray<ULevelStreaming*> StreamingLevels; // 0x0
};

struct FRestrictedConfigInfo {
	FString RestrictedConfigName; // 0x0
	TArray<FString> Owners; // 0x10
};

struct FTimelineEventEntry {
	float Time; // 0x0
	FDelegate EventFunc; // 0x4
};

struct FWidgetAnimationBinding {
	FName WidgetName; // 0x0
	FName SlotWidgetName; // 0x8
	FGuid AnimationGuid; // 0x10
	bool bIsRootWidget; // 0x20
};

struct FLiveLinkCameraStaticData {
	bool bIsFieldOfViewSupported; // 0x10
	bool bIsAspectRatioSupported; // 0x11
	bool bIsFocalLengthSupported; // 0x12
	bool bIsProjectionModeSupported; // 0x13
	float FilmBackWidth; // 0x14
	float FilmBackHeight; // 0x18
	bool bIsApertureSupported; // 0x1c
	bool bIsFocusDistanceSupported; // 0x1d
};

struct FChangeMessageVisibilityBatchRequestEntry {
	FString ID; // 0x0
	FString ReceiptHandle; // 0x10
	int32_t VisibilityTimeout; // 0x20
};

struct FPerSkeletonAnimationSharingSetup {
	USkeleton* Skeleton; // 0x0
	USkeletalMesh* SkeletalMesh; // 0x8
	UAnimSharingTransitionInstance* BlendAnimBlueprint; // 0x10
	UAnimSharingAdditiveInstance* AdditiveAnimBlueprint; // 0x18
	UAnimationSharingStateProcessor* StateProcessorClass; // 0x20
	TArray<FAnimationStateEntry> AnimationStates; // 0x28
};

struct FAkXboxOneApuHeapInitializationSettings {
	uint32_t CachedSize; // 0x0
	uint32_t NonCachedSize; // 0x4
};

struct FDashboardValidationMessage {
	FString DataPath; // 0x0
	FString Message; // 0x10
};

struct FPoseData {
	TArray<FTransform> LocalSpacePose; // 0x0
	TMap<int32_t, int32_t> TrackToBufferIndex; // 0x10
	TArray<float> CurveData; // 0x60
};

struct FTransformBase {
	FName Node; // 0x0
	FTransformBaseConstraint Constraints[0x2]; // 0x8
};

struct FNode {
	FName Name; // 0x0
	FName ParentName; // 0x8
	FTransform Transform; // 0x10
	FString DisplayName; // 0x40
	bool bAdvanced; // 0x50
};

struct FNiagaraSpawnInfo {
	int32_t Count; // 0x0
	float InterpStartDt; // 0x4
	float IntervalDt; // 0x8
	int32_t SpawnGroup; // 0xc
};

struct FS_SkillStruct {
	TArray<FS_SkillActivationCondition> ActivationCondition_18_EF59131F494FB090638A178166A3A7B1; // 0x0
	TArray<FS_SkillTask> SkillTask_19_4534578841B283E5D651F7BD4CADFBEC; // 0x10
	float CoolTime_14_276B78054EF6A583699B8696A6D938E5; // 0x20
	E_SkillType SkillType_23_277CB71E48149DD220C45496272AEE31; // 0x24
	int32_t SkillGrade_28_BDBACB574B8E77B527F63FB077D831EA; // 0x28
};

struct FReplicatedVehicleState {
	float SteeringInput; // 0x0
	float ThrottleInput; // 0x4
	float BrakeInput; // 0x8
	float HandbrakeInput; // 0xc
	int32_t CurrentGear; // 0x10
};

struct FCollisionResponse {
	FCollisionResponseContainer ResponseToChannels; // 0x0
	TArray<FResponseChannel> ResponseArray; // 0x20
};

struct FInputActionSpeechMapping {
	FName ActionName; // 0x0
	FName SpeechKeyword; // 0x8
};

struct FSendMessageBatchResultEntry {
	FString ID; // 0x0
	FString MessageId; // 0x10
	FString MD5OfMessageBody; // 0x20
	FString MD5OfMessageAttributes; // 0x30
	FString MD5OfMessageSystemAttributes; // 0x40
	FString SequenceNumber; // 0x50
};

struct FAdaptorPolygon {
	FPolygonGroupID PolygonGroupID; // 0x0
	TArray<FAdaptorTriangleID> TriangulatedPolygonTriangleIndices; // 0x8
};

struct FVertexAndAttributes {
	FVertexInstanceID VertexInstanceID; // 0x0
	FVertexID VertexID; // 0x4
	FMeshElementAttributeList PolygonVertexAttributes; // 0x8
};

struct FCreateLogStreamRequest {
	FString LogGroupName; // 0x0
	FString LogStreamName; // 0x10
};

struct FAnimationTransitionBetweenStates {
	int32_t PreviousState; // 0x8
	int32_t NextState; // 0xc
	float CrossfadeDuration; // 0x10
	int32_t StartNotify; // 0x14
	int32_t EndNotify; // 0x18
	int32_t InterruptNotify; // 0x1c
	EAlphaBlendOption BlendMode; // 0x20
	UCurveFloat* CustomCurve; // 0x28
	UBlendProfile* BlendProfile; // 0x30
	ETransitionLogicType LogicType; // 0x38
};

struct FPBUF_sv_AuthGetSessionKeyRes {
	FString session_key; // 0x0
};

struct FCustomChannelSetup {
	ECollisionChannel Channel; // 0x0
	ECollisionResponse DefaultResponse; // 0x1
	bool bTraceType; // 0x2
	bool bStaticObject; // 0x3
	FName Name; // 0x4
};

struct FMovieSceneObjectPathChannel {
	UObject* PropertyClass; // 0x8
	TArray<FFrameNumber> Times; // 0x10
	TArray<FMovieSceneObjectPathChannelKeyValue> Values; // 0x20
	FMovieSceneObjectPathChannelKeyValue DefaultValue; // 0x30
};

struct FAkMidiCc {
	EAkMidiCcValues Cc; // 0x2
	char Value; // 0x3
};

struct FSimSpaceSettings {
	float MasterAlpha; // 0x0
	float VelocityScaleZ; // 0x4
	float MaxLinearVelocity; // 0x8
	float MaxAngularVelocity; // 0xc
	float MaxLinearAcceleration; // 0x10
	float MaxAngularAcceleration; // 0x14
	float ExternalLinearDrag; // 0x18
	FVector ExternalLinearDragV; // 0x1c
	FVector ExternalLinearVelocity; // 0x28
	FVector ExternalAngularVelocity; // 0x34
};

struct FDescribeDestinationsResult {
	TArray<FDestinationCloud> Destinations; // 0x0
	FString NextToken; // 0x10
};

struct FURL {
	FString Protocol; // 0x0
	FString Host; // 0x10
	int32_t Port; // 0x20
	int32_t Valid; // 0x24
	FString Map; // 0x28
	FString RedirectURL; // 0x38
	TArray<FString> Op; // 0x48
	FString Portal; // 0x58
};

struct FAkTriangle {
	uint16_t Point0; // 0x0
	uint16_t Point1; // 0x2
	uint16_t Point2; // 0x4
	uint16_t Surface; // 0x6
};

struct FAkBoolPropertyToControl {
	FString ItemProperty; // 0x0
};

struct FAkMidiChannelAftertouch {
	char Value; // 0x2
};

struct FSpotEventData {
	bool bEnabled; // 0x0
	FText Name; // 0x8
	FText Description; // 0x20
	bool ShowInMinimap; // 0x38
	UEventActivationCondition* Condition; // 0x40
	USpotEventLocation* Location; // 0x48
	USpotEventTypeData* EventTypeData; // 0x50
	float LastEvaluationTime; // 0x58
	ASpotEventBase* ActiveSpotEvent; // 0x60
};

struct FDataTableRowHandle {
	UDataTable* DataTable; // 0x0
	FName RowName; // 0x8
};

struct FLocalizedAppName {
	FString LanguageCode; // 0x0
	FString AppName; // 0x10
};

struct FS_TerraPointTransformData {
	int32_t Point_2_842507674383ACC58A9A49989D1351EC; // 0x0
};

struct FQueryStatistics {
	FString RecordsMatched; // 0x0
	FString RecordsScanned; // 0x10
	FString BytesScanned; // 0x20
};

struct FMagicLeapSharedWorldLocalData {
	TArray<FMagicLeapSharedWorldPinData> LocalPins; // 0x0
};

struct FNamedInterfaceDef {
	FName InterfaceName; // 0x0
	FString InterfaceClassName; // 0x8
};

struct FDragonData_MultiInput {
	FName Start_Spine; // 0x0
	FName Pelvis; // 0x8
	TArray<FDragonData_FootData> FeetBones; // 0x10
};

struct FAnimNode_StateMachine {
	int32_t StateMachineIndexInClass; // 0x10
	int32_t MaxTransitionsPerFrame; // 0x14
	bool bSkipFirstUpdateTransition; // 0x18
	bool bReinitializeOnBecomingRelevant; // 0x19
};

struct FSingleAnimationPlayData {
	UAnimationAsset* AnimToPlay; // 0x0
	char bSavedLooping : 1; // 0x8
	char bSavedPlaying : 1; // 0x8
	float SavedPosition; // 0xc
	float SavedPlayRate; // 0x10
};

struct FSocketDragonReference {
	FName SocketName; // 0x30
};

struct FCircularThrobberSettings {
	int32_t NumberOfPieces; // 0x0
	float Period; // 0x4
	float Radius; // 0x8
	FSlateBrush Image; // 0x10
};

struct FNiagaraScriptVariableBinding {
	FName Name; // 0x0
};

struct FWave_5 {
	float  mplitude_4_31_AC647E804AD8FF66DC479DBEE451B83; // 0x0
	float  teepness_4_32_312D7DB140157D72C96AFF8CF5729D6; // 0x4
	float  peed_4_33_D915AA5E48130D8B0506EFA66AF7742; // 0x8
	float  avelength_4_34_E256D8704B7E9B43D81E2D87CBD6575; // 0xc
	float  irection_4_35_527457804880B58848E3D984BC09299; // 0x10
};

struct FMovieSceneTrackInstanceComponent {
	UMovieSceneSection* Owner; // 0x0
	UMovieSceneTrackInstance* TrackInstanceClass; // 0x8
};

struct FLiveLinkSubjectPreset {
	FLiveLinkSubjectKey Key; // 0x0
	ULiveLinkRole* Role; // 0x18
	ULiveLinkSubjectSettings* Settings; // 0x20
	ULiveLinkVirtualSubject* VirtualSubject; // 0x28
	bool bEnabled; // 0x30
};

struct FCompositeFallbackFont {
	FTypeface Typeface; // 0x0
	float ScalingFactor; // 0x10
};

struct FSetUserVoteOnWorkshopItemResult {
	bool bVoteUp; // 0x10
};

struct FStartQueryRequest {
	FString LogGroupName; // 0x0
	TArray<FString> LogGroupNames; // 0x10
	FString StartTime; // 0x20
	FString EndTime; // 0x30
	FString QueryString; // 0x40
	int32_t Limit; // 0x50
};

struct FRMRemoteResponse_GetIngameNotice {
	FString Result; // 0x10
	TArray<FString> notice; // 0x20
	TArray<float> CycleSec; // 0x30
};

struct FScalarParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	float ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x14
};

struct FPBUF_sv_VoiceTalkTokenReq {
	FString sub; // 0x0
	FString F; // 0x10
	FString iss; // 0x20
	FString vxa; // 0x30
	FString T; // 0x40
	int32_t Exp; // 0x50
};

struct FS_ResourceBreakablePart {
	float ResourcesRatio_8_3C4929804552DFEBED47FA94E990087F; // 0x0
	FName Bone_6_80A6B95049EB2A16CDEE29A6C3AC795C; // 0x4
};

struct FMeshInstancingSettings {
	AActor* ActorClassToUse; // 0x0
	int32_t InstanceReplacementThreshold; // 0x8
	EMeshInstancingReplacementMethod MeshReplacementMethod; // 0xc
	bool bSkipMeshesWithVertexColors; // 0xd
	bool bUseHLODVolumes; // 0xe
	UInstancedStaticMeshComponent* ISMComponentToUse; // 0x10
};

struct FGeomComponentCacheParameters {
	EGeometryCollectionCacheType CacheMode; // 0x0
	UGeometryCollectionCache* TargetCache; // 0x8
	float ReverseCacheBeginTime; // 0x10
	bool SaveCollisionData; // 0x14
	bool DoGenerateCollisionData; // 0x15
	int32_t CollisionDataSizeMax; // 0x18
	bool DoCollisionDataSpatialHash; // 0x1c
	float CollisionDataSpatialHashRadius; // 0x20
	int32_t MaxCollisionPerCell; // 0x24
	bool SaveBreakingData; // 0x28
	bool DoGenerateBreakingData; // 0x29
	int32_t BreakingDataSizeMax; // 0x2c
	bool DoBreakingDataSpatialHash; // 0x30
	float BreakingDataSpatialHashRadius; // 0x34
	int32_t MaxBreakingPerCell; // 0x38
	bool SaveTrailingData; // 0x3c
	bool DoGenerateTrailingData; // 0x3d
	int32_t TrailingDataSizeMax; // 0x40
	float TrailingMinSpeedThreshold; // 0x44
	float TrailingMinVolumeThreshold; // 0x48
};

struct FChaosDebugSubstepControl {
	bool bPause; // 0x0
	bool bSubstep; // 0x1
	bool bStep; // 0x2
};

struct FClientReceiveData {
	APlayerController* LocalPC; // 0x0
	FName MessageType; // 0x8
	int32_t MessageIndex; // 0x10
	FString MessageString; // 0x18
	APlayerState* RelatedPlayerState_2; // 0x28
	APlayerState* RelatedPlayerState_3; // 0x30
	UObject* OptionalObject; // 0x38
};

struct FVertexAttributesForPolygonHole {
	TArray<FMeshElementAttributeList> VertexAttributeList; // 0x0
};

struct FARFilter {
	TArray<FName> PackageNames; // 0x0
	TArray<FName> PackagePaths; // 0x10
	TArray<FName> ObjectPaths; // 0x20
	TArray<FName> ClassNames; // 0x30
	TSet<FName> RecursiveClassesExclusionSet; // 0x90
	bool bRecursivePaths; // 0xe0
	bool bRecursiveClasses; // 0xe1
	bool bIncludeOnlyOnDiskAssets; // 0xe2
};

struct FWave_3 {
	float  mplitude_2_21_AC647E804AD8FF66DC479DBEE451B83; // 0x0
	float  teepness_2_22_312D7DB140157D72C96AFF8CF5729D6; // 0x4
	float  peed_2_23_D915AA5E48130D8B0506EFA66AF7742; // 0x8
	float  avelength_2_24_E256D8704B7E9B43D81E2D87CBD6575; // 0xc
	float  irection_2_25_527457804880B58848E3D984BC09299; // 0x10
};

struct FComponentSync {
	FName Name; // 0x0
	ESyncOption SyncOption; // 0x8
};

struct FNiagaraVariant {
	UObject* Object; // 0x0
	UNiagaraDataInterface* DataInterface; // 0x8
	TArray<char> Bytes; // 0x10
	ENiagaraVariantMode CurrentMode; // 0x20
};

struct FGameplayTagRedirect {
	FName OldTagName; // 0x0
	FName NewTagName; // 0x8
};

struct FDeleteMetricFilterRequest {
	FString LogGroupName; // 0x0
	FString FilterName; // 0x10
};

struct FCachedAnimAssetPlayerData {
	FName StateMachineName; // 0x0
	FName StateName; // 0x8
};

struct FGrassInput {
	FName Name; // 0x0
	ULandscapeGrassType* GrassType; // 0x8
	FExpressionInput Input; // 0x10
};

struct FSkeletalMeshSamplingRegion {
	FName Name; // 0x0
	int32_t LODIndex; // 0x8
	char bSupportUniformlyDistributedSampling : 1; // 0xc
	TArray<FSkeletalMeshSamplingRegionMaterialFilter> MaterialFilters; // 0x10
	TArray<FSkeletalMeshSamplingRegionBoneFilter> BoneFilters; // 0x20
};

struct FStaticComponentMaskValue {
	bool R; // 0x0
	bool G; // 0x1
	bool B; // 0x2
	bool A; // 0x3
};

struct FLastLocationGatherInfo {
	UNetConnection* Connection; // 0x0
	FVector LastLocation; // 0x8
	FVector LastOutOfRangeLocationCheck; // 0x14
};

struct FVertexToMove {
	FVertexID VertexID; // 0x0
	FVector NewVertexPosition; // 0x4
};

struct FMovieSceneGeometryCacheSectionTemplate {
	FMovieSceneGeometryCacheSectionTemplateParameters Params; // 0x20
};

struct FS_ConditionInfo {
	UBP_ConditionBase_C* CondtionClass_5_1D53EA884E9DFE8B726AB7A293390DA9; // 0x0
	float Finishtime_4_336D85164983DE3E2AB3569C2CB0DC8E; // 0x8
};

struct FResourceInfo {
	FString Name; // 0x8
	int32_t Resources; // 0x18
	TMap<int32_t, FHarverstResource> HarvestInfo; // 0x20
	bool ImmediatleyHarvest; // 0x70
	EResourceGroupType ResourceGroup; // 0x71
};

struct FBuildPromotionOpenAssetSettings {
	FFilePath BlueprintAsset; // 0x0
	FFilePath MaterialAsset; // 0x10
	FFilePath ParticleSystemAsset; // 0x20
	FFilePath SkeletalMeshAsset; // 0x30
	FFilePath StaticMeshAsset; // 0x40
	FFilePath TextureAsset; // 0x50
};

struct FInterpCurveQuat {
	TArray<FInterpCurvePointQuat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FMinimalViewInfo {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x18
	float DesiredFOV; // 0x1c
	float OrthoWidth; // 0x20
	float OrthoNearClipPlane; // 0x24
	float OrthoFarClipPlane; // 0x28
	float AspectRatio; // 0x2c
	char bConstrainAspectRatio : 1; // 0x30
	char bUseFieldOfViewForLOD : 1; // 0x30
	ECameraProjectionMode ProjectionMode; // 0x34
	float PostProcessBlendWeight; // 0x38
	FPostProcessSettings PostProcessSettings; // 0x40
	FVector2D OffCenterProjectionOffset; // 0x590
};

struct FAIDataProviderIntValue {
	int32_t DefaultValue; // 0x30
};

struct FMagicLeapSharedWorldSharedData {
	TArray<FGuid> PinIDs; // 0x0
};

struct FResponseMetadata {
	FString RequestId; // 0x0
};

struct FMovieScene3DScaleKeyStruct {
	FVector Scale; // 0x8
	FFrameNumber Time; // 0x14
};

struct FMovieSceneMaterialParameterCollectionTemplate {
	UMaterialParameterCollection* MPC; // 0x80
};

struct FTireConfigMaterialFriction {
	UPhysicalMaterial* PhysicalMaterial; // 0x0
	float FrictionScale; // 0x8
};

struct FTwistConstraint {
	float TwistLimitDegrees; // 0x14
	EAngularConstraintMotion TwistMotion; // 0x18
};

struct FHeightmapData {
	UTexture2D* Texture; // 0x0
};

struct FCapturedPixelsID {
	TMap<FName, FName> Identifiers; // 0x0
};

struct FCachedPoseIndices {
	TArray<int32_t> OrderedSavedPoseNodeIndices; // 0x0
};

struct FSQSAddPermissionRequest {
	FString QueueUrl; // 0x0
	FString Label; // 0x10
	TArray<FString> AWSAccountIds; // 0x20
	TArray<FString> Actions; // 0x30
};

struct FCompositeAlarm {
	bool bActionsEnabled; // 0x0
	TArray<FString> AlarmActions; // 0x8
	FString AlarmArn; // 0x18
	FDateTime AlarmConfigurationUpdatedTimestamp; // 0x28
	FString AlarmDescription; // 0x30
	FString AlarmName; // 0x40
	FString AlarmRule; // 0x50
	TArray<FString> InsufficientDataActions; // 0x60
	TArray<FString> OKActions; // 0x70
	FString StateReason; // 0x80
	FString StateReasonData; // 0x90
	FDateTime StateUpdatedTimestamp; // 0xa0
	EStateValue StateValue; // 0xa8
};

struct FSourceEffectEQSettings {
	TArray<FSourceEffectEQBand> EQBands; // 0x0
};

struct FDebugDisplayProperty {
	UObject* Obj; // 0x0
	UObject* WithinClass; // 0x8
};

struct FMovieSceneTimecodeSource {
	FTimecode Timecode; // 0x0
	FFrameNumber DeltaFrame; // 0x14
};

struct FSpectatorReservation {
	FUniqueNetIdRepl SpectatorId; // 0x0
	FPlayerReservation Spectator; // 0x28
};

struct FDamageEvent {
	UDamageType* DamageTypeClass; // 0x8
};

struct FItemScalableFloat {
	float Value; // 0x0
	FCurveTableRowHandle Curve; // 0x10
};

struct FAnimationTransitionRule {
	FName RuleToExecute; // 0x0
	bool TransitionReturnVal; // 0x8
	int32_t TransitionIndex; // 0xc
};

struct FRawDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FTearOffActorInfo {
	AActor* Actor; // 0x8
};

struct FRandomStream {
	int32_t InitialSeed; // 0x0
	int32_t Seed; // 0x4
};

struct FMovieScenePropertySectionData {
	FName PropertyName; // 0x0
	FString PropertyPath; // 0x8
};

struct FMovieSceneBoolPropertySectionTemplate {
	FMovieSceneBoolChannel BoolCurve; // 0x38
};

struct FRawDistributionVector {
	float MinValue; // 0x20
	float MaxValue; // 0x24
	FVector MinValueVec; // 0x28
	FVector MaxValueVec; // 0x34
	UDistributionVector* Distribution; // 0x40
};

struct FBandwidthTestGenerator {
	TArray<FBandwidthTestItem> ReplicatedBuffers; // 0x0
};

struct FMovieSceneBoolChannel {
	TArray<FFrameNumber> Times; // 0x8
	bool DefaultValue; // 0x18
	bool bHasDefaultValue; // 0x19
	TArray<bool> Values; // 0x20
};

struct FAlphaBlend {
	UCurveFloat* CustomCurve; // 0x0
	float BlendTime; // 0x8
	EAlphaBlendOption BlendOption; // 0x24
};

struct FPolygonToCreate {
	FPolygonGroupID PolygonGroupID; // 0x0
	TArray<FVertexAndAttributes> PerimeterVertices; // 0x8
	FPolygonID OriginalPolygonID; // 0x18
	EPolygonEdgeHardness PolygonEdgeHardness; // 0x1c
};

struct FFontParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	UFont* FontValue; // 0x10
	int32_t FontPage; // 0x18
	FGuid ExpressionGUID; // 0x1c
};

struct FSpriteInstanceData {
	FMatrix Transform; // 0x0
	UPaperSprite* SourceSprite; // 0x40
	FColor VertexColor; // 0x48
	int32_t MaterialIndex; // 0x4c
};

struct FAnimNode_LookAt {
	FBoneReference BoneToModify; // 0xc8
	FBoneSocketTarget LookAtTarget; // 0xe0
	FVector LookAtLocation; // 0x140
	FAxis LookAt_Axis; // 0x14c
	bool bUseLookUpAxis; // 0x15c
	EInterpolationBlend InterpolationType; // 0x15d
	FAxis LookUp_Axis; // 0x160
	float LookAtClamp; // 0x170
	float InterpolationTime; // 0x174
	float InterpolationTriggerThreashold; // 0x178
};

struct FRBFEntry {
	TArray<float> Values; // 0x0
};

struct FSQSGetQueueAttributesRequest {
	FString QueueUrl; // 0x0
	TArray<EQueueAttributeName> AttributeNames; // 0x10
};

struct FPutResourcePolicyResultLogs {
	FResourcePolicy ResourcePolicy; // 0x0
};

struct FResourceBatchGroupData {
	FString GroupName; // 0x0
	int32_t Distance; // 0x10
	FString SpawnResourceActorPath; // 0x18
	AActor* SpawnResourceActor; // 0x28
	TArray<bool> BatchClipingArea; // 0x30
	TArray<AActor*> ExclusiveActors; // 0x40
	EBatchOverlapOption BatchOverlapOption; // 0x50
	FBoxSphereBounds Bound; // 0x54
};

struct FLandmassFalloffSettings {
	EBrushFalloffMode FalloffMode; // 0x0
	float FalloffAngle; // 0x4
	float FalloffWidth; // 0x8
	float EdgeOffset; // 0xc
	float ZOffset; // 0x10
};

struct FNameMapping {
	FName NodeName; // 0x0
	FName BoneName; // 0x8
};

struct FLobbyPlayerStateInfo {
	bool bIsReady; // 0x0
	int32_t Ping; // 0x4
	int32_t NetID; // 0x8
};

struct FCameraFilmbackSettings {
	float SensorWidth; // 0x0
	float SensorHeight; // 0x4
	float SensorAspectRatio; // 0x8
};

struct FQuartzClockSettings {
	FQuartzTimeSignature TimeSignature; // 0x0
	bool bIgnoreLevelChange; // 0x18
};

struct FMovieSceneEventPayloadVariable {
	FString Value; // 0x0
};

struct FGenericTeamId {
	char TeamID; // 0x0
};

struct FS_ItemDetails {
	FString Name_13_E2702B14484C4D698BC681BA68F49728; // 0x0
	FString Description_17_602B846C4FB89498AF5E7AB6328BFB66; // 0x10
	float Weight_71_80D59337480616F43CE22392BA591952; // 0x20
	E_ItemCategorys Catagory_68_6E3096244E096D0DE8ABA4B7A76BDC9E; // 0x24
	E_EquipmentCategorys EquipmentSlot_96_19FFD6504B3E4D99B5DD2B8905F2145E; // 0x25
	bool Holdable_99_ABF13FC043BC20602F866AAD5D7CA0D7; // 0x26
	AHoldableBase* HoldableClass_187_13D858EE42AAE5DB650B6ABF93BFEA7C; // 0x28
	BP_MasterAttachment_C* AttachmentClass_119_2376753C44B41959460098A6FB10B476; // 0x30
	UAnimMontage* TPEquipMontage_106_279D7B92465D07D8FCD056A1B8D3E065; // 0x38
	UAnimMontage* FPEquipMontage_109_7058C72645A95C081979369861E89467; // 0x40
	bool Droppable_61_0C5A35E14536E675A317B3873F952931; // 0x48
	bool Stackable_63_3013B4F945860F8ED5B586BD66FA9E2D; // 0x49
	int32_t MaxStack_62_49B71A03426D3A2BFFB1F88F4C313DA9; // 0x4c
	int32_t InventorySlots_67_79D1EAB84E86CA9C920054BAAA8C5714; // 0x50
	FString UseText_91_AB6B623340C685081FC06AADCB290476; // 0x58
	float FuelTime_142_20C69CAD440423F87384F1B32B235DA6; // 0x68
	UTexture2D* Icon_60_7648EF894DE5DC05893A6A92E3DE8D28; // 0x70
	UStaticMesh* WorldMesh_59_7444C39B45931133AB5875A654072A5A; // 0x78
	USkeletalMesh* EquippedMesh_92_18E57AC5491B8222B0CEE6AC4E6AC9A0; // 0x80
	USkeletalMesh* FP_EquippedMesh_156_5E718198498D8BA8190B6D845959A569; // 0x88
	FTransform MeshWorldOffset_122_C7831601440D7EC62305E8A0A25DF967; // 0x90
	TArray<FItemCodeValue> Contains_188_11E14AB54E292C2E71D7A2B3CC4D2E06; // 0xc0
	TMap<E_ItemAction, USoundBase*> Sounds_138_392D1F434D9A8246A7B7A594CEE29902; // 0xd0
	float PickUpTime_146_A4405DC54967F650D060CFBCC6618430; // 0x120
	float MaxWeightAddition_149_20D1F36B4DBC40E1A5AC6D973C5AD462; // 0x124
	FS_ConsumeInfo ConsumeInfo_170_714B7F914D80D996197D78B085E99C32; // 0x128
	bool bAddQuickSlot_153_CF55D6FC4371828F54BFC09DCB0D02D3; // 0x1a8
	bool bAbilityItem_158_B1D2CBF147926989DF6F9D9E6936C9B7; // 0x1a9
	E_ItemCategory_Display Category_Display_161_B5157F13425384EBDB3371A8941B2DD5; // 0x1aa
	bool IsDestroable_176_4BC596AB487E0CF8D8B094BEAD9EA9FF; // 0x1ab
	float EnergyTransformValue_179_FB4CC5D74F82846BEB2D3A9F5F28E2E5; // 0x1ac
};

struct FEngineServicePong {
	FString CurrentLevel; // 0x0
	int32_t EngineVersion; // 0x10
	bool HasBegunPlay; // 0x14
	FGuid InstanceId; // 0x18
	FString InstanceType; // 0x28
	FGuid SessionId; // 0x38
	float WorldTimeSeconds; // 0x48
};

struct FInAppPurchaseProductRequest {
	FString ProductIdentifier; // 0x0
	bool bIsConsumable; // 0x10
};

struct FAssetMapping {
	UAnimationAsset* SourceAsset; // 0x0
	UAnimationAsset* TargetAsset; // 0x8
};

struct FGetLogEventsRequest {
	FString LogGroupName; // 0x0
	FString LogStreamName; // 0x10
	FString StartTime; // 0x20
	FString EndTime; // 0x30
	FString NextToken; // 0x40
	int32_t Limit; // 0x50
	bool bStartFromHead; // 0x54
};

struct FInputStruct {
	FString ActionName; // 0x0
	FKey Key; // 0x10
	FString KeyAsString; // 0x28
	char bShift : 1; // 0x38
	char bCtrl : 1; // 0x38
	char bAlt : 1; // 0x38
	char bCmd : 1; // 0x38
};

struct FSQSMessage {
	FString MessageId; // 0x0
	FString ReceiptHandle; // 0x10
	FString MD5OfBody; // 0x20
	FString Body; // 0x30
	TMap<EMessageSystemAttributeName, FString> Attributes; // 0x40
	FString MD5OfMessageAttributes; // 0x90
	TMap<FString, FMessageAttributeValue> MessageAttributes; // 0xa0
};

struct FStructSerializerObjectTestStruct {
	UObject* Class; // 0x0
	UMetaData* SubClass; // 0x8
	TSoftClassPtr<UObject> SoftClass; // 0x10
	UObject* Object; // 0x38
	TWeakObjectPtr<UMetaData> WeakObject; // 0x40
	TSoftObjectPtr<UMetaData> SoftObject; // 0x48
	FSoftClassPath ClassPath; // 0x70
	FSoftObjectPath ObjectPath; // 0x88
};

struct FMovieSceneEvaluationFieldEntity {
	FMovieSceneEvaluationFieldEntityKey Key; // 0x0
	int32_t SharedMetaDataIndex; // 0xc
};

struct FQueryWorkshopForUserItemsResult {
	FSteamUGCQueryParameterUser queryParams; // 0x30
};

struct FRange {
	FDateTime StartTime; // 0x0
	FDateTime EndTime; // 0x8
};

struct FNiagaraVariable {
	TArray<char> VarData; // 0x10
};

struct FAnimNode_BlendListByEnum {
	TArray<int32_t> EnumToPoseIndex; // 0x98
	char ActiveEnumValue; // 0xa8
};

struct FS_NPCSpawnInfoLandmarkStatus {
	ELMStatus Status_12_25CF6761451DD4C2AEF94AB521E9561C; // 0x0
	int32_t Phase_13_2127A2164AFE0316498B26B68885FDC3; // 0x4
	TMap<FName, int32_t> SpawnMonsters_14_4EAF7F044823441C32B24A995A7A150B; // 0x8
};

struct FVertexInstanceToCreate {
	FVertexID VertexID; // 0x0
	FMeshElementAttributeList VertexInstanceAttributes; // 0x8
	FVertexInstanceID OriginalVertexInstanceID; // 0x18
};

struct FRealCurve {
	float DefaultValue; // 0x68
	ERichCurveExtrapolation PreInfinityExtrap; // 0x6c
	ERichCurveExtrapolation PostInfinityExtrap; // 0x6d
};

struct FDescribeSubscriptionFiltersResult {
	TArray<FSubscriptionFilter> SubscriptionFilters; // 0x0
	FString NextToken; // 0x10
};

struct FNPCWeaponInfo {
	UStaticMesh* Weapon; // 0x8
};

struct FHyperlinkStyle {
	FButtonStyle UnderlineStyle; // 0x8
	FTextBlockStyle TextStyle; // 0x280
	FMargin Padding; // 0x4f0
};

struct FMovieSceneEvaluationFieldSharedEntityMetaData {
	FGuid ObjectBindingId; // 0x0
};

struct FNiagaraTypeLayoutInfo {
	TArray<uint32_t> FloatComponentByteOffsets; // 0x0
	TArray<uint32_t> FloatComponentRegisterOffsets; // 0x10
	TArray<uint32_t> Int32ComponentByteOffsets; // 0x20
	TArray<uint32_t> Int32ComponentRegisterOffsets; // 0x30
	TArray<uint32_t> HalfComponentByteOffsets; // 0x40
	TArray<uint32_t> HalfComponentRegisterOffsets; // 0x50
};

struct FPoseLinkBase {
	int32_t LinkID; // 0x0
};

struct FARGeoAnchorUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	float Longitude; // 0x50
	float Latitude; // 0x54
	float AltitudeMeters; // 0x58
	EARAltitudeSource AltitudeSource; // 0x5c
	FString AnchorName; // 0x60
};

struct FInAppPurchaseProductRequest2 {
	FString ProductIdentifier; // 0x0
	bool bIsConsumable; // 0x10
};

struct FSubmixEffectStereoDelaySettings {
	EStereoDelaySourceEffect DelayMode; // 0x0
	float DelayTimeMsec; // 0x4
	float Feedback; // 0x8
	float DelayRatio; // 0xc
	float WetLevel; // 0x10
	float DryLevel; // 0x14
	bool bFilterEnabled; // 0x18
	EStereoDelayFiltertype FilterType; // 0x19
	float FilterFrequency; // 0x1c
	float FilterQ; // 0x20
};

struct FAnimNode_TwistCorrectiveNode {
	FReferenceBoneFrame BaseFrame; // 0xc8
	FReferenceBoneFrame TwistFrame; // 0xe8
	FAxis TwistPlaneNormalAxis; // 0x108
	float RangeMax; // 0x118
	float RemappedMin; // 0x11c
	float RemappedMax; // 0x120
	FAnimCurveParam Curve; // 0x124
};

struct FSkeletalMeshSamplingRegionMaterialFilter {
	FName MaterialName; // 0x0
};

struct FCreateLogGroupRequest {
	FString LogGroupName; // 0x0
	FString KmsKeyId; // 0x10
	TMap<FString, FString> Tags; // 0x20
};

struct FAnimNode_PoseSnapshot {
	FName SnapshotName; // 0x10
	FPoseSnapshot Snapshot; // 0x18
	ESnapshotSourceMode Mode; // 0x50
};

struct FPropertyAccessLibrary {
	TArray<FPropertyAccessSegment> PathSegments; // 0x0
	TArray<FPropertyAccessPath> SrcPaths; // 0x10
	TArray<FPropertyAccessPath> DestPaths; // 0x20
	FPropertyAccessCopyBatch CopyBatches[0x4]; // 0x30
	TArray<FPropertyAccessIndirectionChain> SrcAccesses; // 0x70
	TArray<FPropertyAccessIndirectionChain> DestAccesses; // 0x80
	TArray<FPropertyAccessIndirection> Indirections; // 0x90
	TArray<int32_t> EventAccessIndices; // 0xa0
};

struct FStaticMaterialLayersParameter {
	FMaterialLayersFunctions Value; // 0x28
};

struct FDescribeLogStreamsResult {
	TArray<FLogStream> LogStreams; // 0x0
	FString NextToken; // 0x10
};

struct FDeleteSubscriptionFilterRequest {
	FString LogGroupName; // 0x0
	FString FilterName; // 0x10
};

struct FPlatformRuntimeAudioCompressionOverrides {
	bool bOverrideCompressionTimes; // 0x0
	float DurationThreshold; // 0x4
	int32_t MaxNumRandomBranches; // 0x8
	int32_t SoundCueQualityIndex; // 0xc
};

struct FRootMotionSourceStatus {
	char Flags; // 0x0
};

struct FLocationBoneSocketInfo {
	FName BoneSocketName; // 0x0
	FVector Offset; // 0x8
};

struct FSQSGetQueueUrlResult {
	FString QueueUrl; // 0x0
	FSQSResponseMetadata ResponseMetadata; // 0x10
};

struct FPointDamageEvent {
	float Damage; // 0x10
	FVector_NetQuantizeNormal ShotDirection; // 0x14
	FHitResult HitInfo; // 0x20
};

struct FAnimNode_CustomProperty {
	TArray<FName> SourcePropertyNames; // 0x10
	TArray<FName> DestPropertyNames; // 0x20
	UObject* TargetInstance; // 0x30
};

struct FAnimNode_ConvertComponentToLocalSpace {
	FComponentSpacePoseLink ComponentPose; // 0x10
};

struct FStaticComponentMaskParameter {
	bool R; // 0x24
	bool G; // 0x25
	bool B; // 0x26
	bool A; // 0x27
};

struct FAkAudioEventTrackKey {
	float Time; // 0x0
	UAkAudioEvent* AkAudioEvent; // 0x8
	FString EventName; // 0x10
};

struct FDistributionLookupTable {
	float TimeScale; // 0x0
	float TimeBias; // 0x4
	TArray<float> Values; // 0x8
	char Op; // 0x18
	char EntryCount; // 0x19
	char EntryStride; // 0x1a
	char SubEntryStride; // 0x1b
	char LockFlag; // 0x1c
};

struct FAnimPhysConstraintSetup {
	AnimPhysLinearConstraintType LinearXLimitType; // 0x0
	AnimPhysLinearConstraintType LinearYLimitType; // 0x1
	AnimPhysLinearConstraintType LinearZLimitType; // 0x2
	FVector LinearAxesMin; // 0x4
	FVector LinearAxesMax; // 0x10
	AnimPhysAngularConstraintType AngularConstraintType; // 0x1c
	AnimPhysTwistAxis TwistAxis; // 0x1d
	AnimPhysTwistAxis AngularTargetAxis; // 0x1e
	float ConeAngle; // 0x20
	FVector AngularLimitsMin; // 0x24
	FVector AngularLimitsMax; // 0x30
	FVector AngularTarget; // 0x3c
};

struct FDragonData_Overrided_Location_Data {
	TArray<FDragonData_SingleArmElement> Arm_TargetLocation_Overrides; // 0x0
};

struct FGridBlendSample {
	FEditorElement GridElement; // 0x0
	float BlendWeight; // 0x18
};

struct FPartyReservation {
	int32_t TeamNum; // 0x0
	FUniqueNetIdRepl PartyLeader; // 0x8
	TArray<FPlayerReservation> PartyMembers; // 0x30
	TArray<FPlayerReservation> RemovedPartyMembers; // 0x40
};

struct FCaptureResolution {
	int32_t ResX; // 0x0
	int32_t ResY; // 0x4
};

struct FAnimationStateEntry {
	char State; // 0x0
	TArray<FAnimationSetup> AnimationSetups; // 0x8
	bool bOnDemand; // 0x18
	bool bAdditive; // 0x19
	float BlendTime; // 0x1c
	bool bReturnToPreviousState; // 0x20
	bool bSetNextState; // 0x21
	char NextState; // 0x22
	FPerPlatformInt MaximumNumberOfConcurrentInstances; // 0x24
	float WiggleTimePercentage; // 0x28
	bool bRequiresCurves; // 0x2c
};

struct FMovieScene3DTransformTemplateData {
	FMovieSceneFloatChannel TranslationCurve[0x3]; // 0x0
	FMovieSceneFloatChannel RotationCurve[0x3]; // 0x1e0
	FMovieSceneFloatChannel ScaleCurve[0x3]; // 0x3c0
	FMovieSceneFloatChannel ManualWeight; // 0x5a0
	EMovieSceneBlendType BlendType; // 0x640
	FMovieSceneTransformMask Mask; // 0x644
	bool bUseQuaternionInterpolation; // 0x648
};

struct FTerraShopMerchandise {
	FTerraShopDataInfo Merchandise; // 0x0
	int32_t PurchaseCount; // 0x38
};

struct FVehicleInputRate {
	float RiseRate; // 0x0
	float FallRate; // 0x4
};

struct FPrimaryAssetRules {
	int32_t Priority; // 0x0
	int32_t ChunkId; // 0x4
	bool bApplyRecursively; // 0x8
	EPrimaryAssetCookRule CookRule; // 0x9
};

struct FDatasmithPostProcessSettingsTemplate {
	char bOverride_WhiteTemp : 1; // 0x0
	char bOverride_ColorSaturation : 1; // 0x0
	char bOverride_VignetteIntensity : 1; // 0x0
	char bOverride_FilmWhitePoint : 1; // 0x0
	char bOverride_AutoExposureMethod : 1; // 0x0
	char bOverride_CameraISO : 1; // 0x0
	char bOverride_CameraShutterSpeed : 1; // 0x0
	char bOverride_DepthOfFieldFstop : 1; // 0x4
	float WhiteTemp; // 0x8
	float VignetteIntensity; // 0xc
	FLinearColor FilmWhitePoint; // 0x10
	FVector4 ColorSaturation; // 0x20
	EAutoExposureMethod AutoExposureMethod; // 0x30
	float CameraISO; // 0x34
	float CameraShutterSpeed; // 0x38
	float DepthOfFieldFstop; // 0x3c
};

struct FInputLogEvent {
	FString Timestamp; // 0x0
	FString Message; // 0x10
};

struct FAppleImageUtilsImageConversionResult {
	FString Error; // 0x0
	TArray<char> ImageData; // 0x10
};

struct FAkMidiNoteOnOff {
	char Note; // 0x2
	char Velocity; // 0x3
};

struct FAnimSyncMarker {
	FName MarkerName; // 0x0
	float Time; // 0x8
};

struct FTransformParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel Translation[0x3]; // 0x8
	FMovieSceneFloatChannel Rotation[0x3]; // 0x1e8
	FMovieSceneFloatChannel Scale[0x3]; // 0x3c8
};

struct FAngularRangeLimit {
	FVector LimitMin; // 0x0
	FVector LimitMax; // 0xc
	FBoneReference Bone; // 0x18
};

struct FInputBlendPose {
	TArray<FBranchFilter> BranchFilters; // 0x0
};

struct FSynth1PatchCable {
	float Depth; // 0x0
	ESynth1PatchDestination Destination; // 0x4
};

struct FFrameRate {
	int32_t Numerator; // 0x0
	int32_t Denominator; // 0x4
};

struct FAttributesForVertexInstance {
	FVertexInstanceID VertexInstanceID; // 0x0
	FMeshElementAttributeList VertexInstanceAttributes; // 0x8
};

struct FNamedLensPreset {
	FString Name; // 0x0
	FCameraLensSettings LensSettings; // 0x10
};

struct FSolverBreakingFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinVolume; // 0xc
};

struct FLogGroup {
	FString LogGroupName; // 0x0
	float CreationTime; // 0x10
	int32_t RetentionInDays; // 0x14
	int32_t MetricFilterCount; // 0x18
	FString Arn; // 0x20
	float StoredBytes; // 0x30
	FString KmsKeyId; // 0x38
};

struct FAwsCloudWatchClientConfiguration {
	FString UserAgent; // 0x0
	ECloudWatchScheme Sceheme; // 0x10
	FString region; // 0x18
	bool bUseDualStack; // 0x28
	int32_t MaxConnections; // 0x2c
	int32_t HTTP_RequestTimeoutMs; // 0x30
	int32_t RequestTimeoutMs; // 0x34
	int32_t ConnectTimeoutMs; // 0x38
	bool bEnableTcpKeepAlive; // 0x3c
	int32_t TcpKeepAliveIntervalMs; // 0x40
	int32_t LowSpeedLimit; // 0x44
	FString EndPointOverride; // 0x48
	ECloudWatchScheme ProxyScheme; // 0x58
	FString ProxyHost; // 0x60
	int32_t ProxyPort; // 0x70
	FString ProxyUsername; // 0x78
	FString ProxyPassword; // 0x88
	FString ProxySSL_CertPath; // 0x98
	FString ProxySSL_CertType; // 0xa8
	FString ProxySSL_KeyPath; // 0xb8
	FString ProxySSL_KeyType; // 0xc8
	FString ProxySSL_KeyPassword; // 0xd8
	bool bVerifySSL; // 0xe8
	FString CaPath; // 0xf0
	FString CaFile; // 0x100
	ECloudWatchFollowRedirectsPolicy FollowRedirects; // 0x110
	bool bDisableExpectHeader; // 0x111
	bool bEnableClockSkewAdjustment; // 0x112
	bool bEnableHostPrefixInjection; // 0x113
	bool bEnableEndpointDiscovery; // 0x114
	FString ProfileName; // 0x118
};

struct FLiveLinkCameraFrameData {
	float FieldOfView; // 0xd0
	float AspectRatio; // 0xd4
	float FocalLength; // 0xd8
	float Aperture; // 0xdc
	float FocusDistance; // 0xe0
	ELiveLinkCameraProjectionMode ProjectionMode; // 0xe4
};

struct FGraphAssetPlayerInformation {
	TArray<int32_t> PlayerNodeIndices; // 0x0
};

struct FNiagaraScriptDataUsageInfo {
	bool bReadsAttributeData; // 0x0
};

struct FS_WeaponInventory {
	int32_t Index_2_00D34E2C4CD71B7ABE912C978BF34BF5; // 0x0
	int32_t Ammo_4_7983625A43CD6FB73945EFA6D1469999; // 0x4
	FS_WeaponAttachements Attachments_16_B02306C84E96756239FADF801CED8C81; // 0x8
	Udelete2_C* Inventory_19_A5D72F70404D78F4D8C7F1A3E07CC601; // 0x50
};

struct FAnimNode_Inertialization {
	FPoseLink Source; // 0x10
};

struct FTTPropertyTrack {
	FName PropertyName; // 0x18
};

struct FAttributesForVertex {
	FVertexID VertexID; // 0x0
	FMeshElementAttributeList VertexAttributes; // 0x8
};

struct FGetMetricStatisticsRequest {
	FString Namespace; // 0x0
	FString MetricName; // 0x10
	TArray<FDimension> Dimensions; // 0x20
	FDateTime StartTime; // 0x30
	FDateTime EndTime; // 0x38
	int32_t Period; // 0x40
	TArray<EStatistic> Statistics; // 0x48
	TArray<FString> ExtendedStatistics; // 0x58
	EStandardUnit Unit; // 0x68
};

struct FS_SkillActivationCondition {
	UBP_SkillAcitvationConditionBase_C* Condition_3_4AA95F1B487B791543E4C7B42980B5F7; // 0x0
	FS_ConditionParam Param_22_E12C73B64C52E7B86DFCB8A396EC21D0; // 0x8
};

struct FLogGroupField {
	FString Name; // 0x0
	int32_t Percent; // 0x10
};

struct FS_RadiogramGuide {
	FText Title_11_52588AD84EAB8B71356C3AB965DCE868; // 0x0
	UUserWidget* GuideWidget_33_B6A25A4D463945B0E3F74E8D0A77FEA2; // 0x18
	TArray<FS_RadiogramUnlockCondition> UnlockingCondition_31_13EB0FA04B75FFFFC7CACE84EC3C5487; // 0x20
	bool IsCheckTypeOR_35_6B25C0F54AFA15AA9BC0F88E07B9239C; // 0x30
	FText Description_25_B10621674094474473DA27A43E87AFF9; // 0x38
	FText MainCategoryName_55_2F4C38CA400AB2F1B23649B57D512BBC; // 0x50
	FString MainCategoryKey_51_9B772DD64AF96E9977A17BBBC09BBC34; // 0x68
	FText SubCategoryName_54_60ADB37B49F735906214B7A27BAA77BA; // 0x78
	FString SubCategoryKey_53_FA843C714F90DB5FEBD285BD7D8757BC; // 0x90
	FText UnlockHint_45_063A629249B3992A3CB8009CDC7CC725; // 0xa0
	UTexture2D* Thumbnail_48_A8E4C20740EC6241EC0AA0AD60E83AB0; // 0xb8
	bool IsSideQuest_59_85ED634D4007FAB3DD0BFAB959B6C597; // 0xc0
	FString ClearDialogName_64_071C7D894BD59B5E55E574ABE72003EB; // 0xc8
	E_RadiogramDetailType RadiogramType_79_020F7A3D4B3F6B0672B3FE88999F2608; // 0xd8
	int32_t UID_78_729301914D4F125B7FB85093B575DCEB; // 0xdc
};

struct FToggleTrackKey {
	float Time; // 0x0
	ETrackToggleAction ToggleAction; // 0x4
};

struct FXRMotionControllerData {
	bool bValid; // 0x0
	FName DeviceName; // 0x4
	FGuid ApplicationInstanceID; // 0xc
	EXRVisualType DeviceVisualType; // 0x1c
	EControllerHand HandIndex; // 0x1d
	ETrackingStatus TrackingStatus; // 0x1e
	FVector GripPosition; // 0x20
	FQuat GripRotation; // 0x30
	FVector AimPosition; // 0x40
	FQuat AimRotation; // 0x50
	TArray<FVector> HandKeyPositions; // 0x60
	TArray<FQuat> HandKeyRotations; // 0x70
	TArray<float> HandKeyRadii; // 0x80
	bool bIsGrasped; // 0x90
};

struct FNiagaraSystemScalabilityOverride {
	char bOverrideDistanceSettings : 1; // 0x48
	char bOverrideInstanceCountSettings : 1; // 0x48
	char bOverridePerSystemInstanceCountSettings : 1; // 0x48
	char bOverrideTimeSinceRendererSettings : 1; // 0x48
};

struct FAnimNode_DragonControlBase {
	FComponentSpacePoseLink ComponentPose; // 0x10
	int32_t LODThreshold; // 0x20
	float ActualAlpha; // 0x24
	EAnimAlphaInputType AlphaInputType; // 0x28
	float Alpha; // 0x2c
	FInputScaleBias AlphaScaleBias; // 0x30
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x38
	FName AlphaCurveName; // 0x80
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x88
};

struct FPutInsightRuleRequest {
	FString RuleName; // 0x0
	FString RuleState; // 0x10
	FString RuleDefinition; // 0x20
	TArray<FTagCloudWatch> Tags; // 0x30
};

struct FPhysicalAnimationData {
	FName BodyName; // 0x0
	char bIsLocalSimulation : 1; // 0x8
	float OrientationStrength; // 0xc
	float AngularVelocityStrength; // 0x10
	float PositionStrength; // 0x14
	float VelocityStrength; // 0x18
	float MaxLinearForce; // 0x1c
	float MaxAngularForce; // 0x20
};

struct FSkeletalMeshClothBuildParams {
	TWeakObjectPtr<UClothingAssetBase> TargetAsset; // 0x0
	int32_t TargetLod; // 0x8
	bool bRemapParameters; // 0xc
	FString AssetName; // 0x10
	int32_t LODIndex; // 0x20
	int32_t SourceSection; // 0x24
	bool bRemoveFromMesh; // 0x28
	TSoftObjectPtr<UPhysicsAsset> PhysicsAsset; // 0x30
};

struct FSoundClassProperties {
	float Volume; // 0x0
	float Pitch; // 0x4
	float LowPassFilterFrequency; // 0x8
	float AttenuationDistanceScale; // 0xc
	float StereoBleed; // 0x10
	float LFEBleed; // 0x14
	float VoiceCenterChannelVolume; // 0x18
	float RadioFilterVolume; // 0x1c
	float RadioFilterVolumeThreshold; // 0x20
	char bApplyEffects : 1; // 0x24
	char bAlwaysPlay : 1; // 0x24
	char bIsUISound : 1; // 0x24
	char bIsMusic : 1; // 0x24
	char bCenterChannelOnly : 1; // 0x24
	char bApplyAmbientVolumes : 1; // 0x24
	char bReverb : 1; // 0x24
	float Default2DReverbSendAmount; // 0x28
	FSoundModulationDefaultSettings ModulationSettings; // 0x30
	EAudioOutputTarget OutputTarget; // 0x70
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x71
	USoundSubmix* DefaultSubmix; // 0x78
};

struct FAkWaapiFieldNames {
	FString FieldName; // 0x0
};

struct FSmartName {
	FName DisplayName; // 0x0
};

struct FPaperTileInfo {
	UPaperTileSet* TileSet; // 0x0
	int32_t PackedTileIndex; // 0x8
};

struct FInterpolationParameter {
	float InterpolationTime; // 0x0
	EFilterInterpolationType InterpolationType; // 0x4
};

struct FReplicatedStaticActorDestructionInfo {
	UObject* ObjClass; // 0x30
};

struct FMaterialRemapIndex {
	uint32_t ImportVersionKey; // 0x0
	TArray<int32_t> MaterialRemap; // 0x8
};

struct FMeshReductionSettings {
	float PercentTriangles; // 0x0
	float PercentVertices; // 0x4
	float MaxDeviation; // 0x8
	float PixelError; // 0xc
	float WeldingThreshold; // 0x10
	float HardAngleThreshold; // 0x14
	int32_t BaseLODModel; // 0x18
	EMeshFeatureImportance SilhouetteImportance; // 0x1c
	EMeshFeatureImportance TextureImportance; // 0x1d
	EMeshFeatureImportance ShadingImportance; // 0x1e
	char bRecalculateNormals : 1; // 0x1f
	char bGenerateUniqueLightmapUVs : 1; // 0x1f
	char bKeepSymmetry : 1; // 0x1f
	char bVisibilityAided : 1; // 0x1f
	char bCullOccluded : 1; // 0x1f
	EStaticMeshReductionTerimationCriterion TerminationCriterion; // 0x20
	EMeshFeatureImportance VisibilityAggressiveness; // 0x21
	EMeshFeatureImportance VertexColorImportance; // 0x22
};

struct FTagCloudWatchResourceRequest {
	FString ResourceARN; // 0x0
	TArray<FTagCloudWatch> Tags; // 0x10
};

struct FConnectionAlwaysRelevantNodePair {
	UNetConnection* NetConnection; // 0x0
	UReplicationGraphNode_AlwaysRelevant_ForConnection* Node; // 0x8
};

struct FMovieSceneObjectPathChannelKeyValue {
	TSoftObjectPtr<UObject> SoftPtr; // 0x0
	UObject* HardPtr; // 0x28
};

struct FAnimNotifyQueue {
	TArray<FAnimNotifyEventReference> AnimNotifies; // 0x10
	TMap<FName, FAnimNotifyArray> UnfilteredMontageAnimNotifies; // 0x20
};

struct FLiveLinkLightBlueprintData {
	FLiveLinkLightStaticData StaticData; // 0x8
	FLiveLinkLightFrameData FrameData; // 0x30
};

struct FBTCompositeChild {
	UBTCompositeNode* ChildComposite; // 0x0
	UBTTaskNode* ChildTask; // 0x8
	TArray<UBTDecorator*> Decorators; // 0x10
	TArray<FBTDecoratorLogic> DecoratorOps; // 0x20
};

struct FPaperFlipbookKeyFrame {
	UPaperSprite* Sprite; // 0x0
	int32_t FrameRun; // 0x8
};

struct FBakedStateExitTransition {
	int32_t CanTakeDelegateIndex; // 0x0
	int32_t CustomResultNodeIndex; // 0x4
	int32_t TransitionIndex; // 0x8
	bool bDesiredTransitionReturnValue; // 0xc
	bool bAutomaticRemainingTimeRule; // 0xd
	TArray<int32_t> PoseEvaluatorLinks; // 0x10
};

struct FCustomProfile {
	FName Name; // 0x0
	TArray<FResponseChannel> CustomResponses; // 0x8
};

struct FNiagaraUserParameterBinding {
	FNiagaraVariable Parameter; // 0x0
};

struct FNiagaraStatScope {
	FName FullName; // 0x0
	FName FriendlyName; // 0x8
};

struct FS_PlayerInfoSummary {
	TArray<int32_t> MemoryChip_16_FA7BDA2948F9B5A56A60C5AC0BE4E2B5; // 0x0
	TArray<int32_t> Protocol_13_493F1011400C611A6697A5B0928E981A; // 0x10
	int32_t Head_25_81676C81436032E28D5795880375BB45; // 0x20
	int32_t Chest_26_EFEA715045656866733763B7AC2B3A95; // 0x24
	int32_t Leg_27_E5292E864A0B8BCEC330E5A812AFB043; // 0x28
	int32_t Feet_28_675952E74C1BB8D9555337AFA43808C4; // 0x2c
	int32_t SurvivalDay_32_56792581421B13BE4FBED69C04EB0BD3; // 0x30
	FString Name_35_CA2445674702F68D89A13F9029832AA4; // 0x38
	FS_UserCustomizeInfo CustomizeInfo_38_CE0BA9EC4F8309DE968114BB074D67B9; // 0x48
};

struct FMagicLeapPlaneResult {
	FVector PlanePosition; // 0x0
	FRotator PlaneOrientation; // 0xc
	FRotator ContentOrientation; // 0x18
	FVector2D PlaneDimensions; // 0x24
	TArray<EMagicLeapPlaneQueryFlags> PlaneFlags; // 0x30
	FGuid ID; // 0x40
	FGuid InnerID; // 0x50
};

struct FQueryWorkshopForItemDetailsResult {
	FSteamUGCQueryParameterDetails queryParams; // 0x30
};

struct FGetMetricWidgetImageResult {
	FResponseMetadata ResponseMetadata; // 0x0
	UTexture2D* Texture; // 0x10
};

struct FSubmixEffectFlexiverbSettings {
	float PreDelay; // 0x0
	float DecayTime; // 0x4
	float RoomDampening; // 0x8
	int32_t Complexity; // 0xc
};

struct FAnimNode_Root {
	FPoseLink Result; // 0x10
	FName Name; // 0x20
	FName Group; // 0x28
};

struct FCollisionResponseContainer {
	ECollisionResponse WorldStatic; // 0x0
	ECollisionResponse WorldDynamic; // 0x1
	ECollisionResponse Pawn; // 0x2
	ECollisionResponse Visibility; // 0x3
	ECollisionResponse Camera; // 0x4
	ECollisionResponse PhysicsBody; // 0x5
	ECollisionResponse Vehicle; // 0x6
	ECollisionResponse Destructible; // 0x7
	ECollisionResponse EngineTraceChannel1; // 0x8
	ECollisionResponse EngineTraceChannel2; // 0x9
	ECollisionResponse EngineTraceChannel3; // 0xa
	ECollisionResponse EngineTraceChannel4; // 0xb
	ECollisionResponse EngineTraceChannel5; // 0xc
	ECollisionResponse EngineTraceChannel6; // 0xd
	ECollisionResponse GameTraceChannel1; // 0xe
	ECollisionResponse GameTraceChannel2; // 0xf
	ECollisionResponse GameTraceChannel3; // 0x10
	ECollisionResponse GameTraceChannel4; // 0x11
	ECollisionResponse GameTraceChannel5; // 0x12
	ECollisionResponse GameTraceChannel6; // 0x13
	ECollisionResponse GameTraceChannel7; // 0x14
	ECollisionResponse GameTraceChannel8; // 0x15
	ECollisionResponse GameTraceChannel9; // 0x16
	ECollisionResponse GameTraceChannel10; // 0x17
	ECollisionResponse GameTraceChannel11; // 0x18
	ECollisionResponse GameTraceChannel12; // 0x19
	ECollisionResponse GameTraceChannel13; // 0x1a
	ECollisionResponse GameTraceChannel14; // 0x1b
	ECollisionResponse GameTraceChannel15; // 0x1c
	ECollisionResponse GameTraceChannel16; // 0x1d
	ECollisionResponse GameTraceChannel17; // 0x1e
	ECollisionResponse GameTraceChannel18; // 0x1f
};

struct FTTVectorTrack {
	UCurveVector* CurveVector; // 0x20
};

struct FMagicLeapARPinState {
	float Confidence; // 0x0
	float ValidRadius; // 0x4
	float RotationError; // 0x8
	float TranslationError; // 0xc
	EMagicLeapARPinType PinType; // 0x10
};

struct FNiagaraEmitterScalabilityOverrides {
	TArray<FNiagaraEmitterScalabilityOverride> Overrides; // 0x0
};

struct FSupportedAreaData {
	FString AreaClassName; // 0x0
	int32_t AreaID; // 0x10
	UObject* AreaClass; // 0x18
};

struct FFileManifestData {
	FString Filename; // 0x0
	FSHAHashData FileHash; // 0x10
	TArray<FChunkPartData> FileChunkParts; // 0x28
	TArray<FString> InstallTags; // 0x38
	bool bIsUnixExecutable; // 0x48
	FString SymlinkTarget; // 0x50
	bool bIsReadOnly; // 0x60
	bool bIsCompressed; // 0x61
};

struct FGetAppdependencyResult {
	TArray<FSteamAppId> dependencyApps; // 0x10
	bool bAllAppDependenciesReturned; // 0x20
};

struct FMovieSceneMarginSectionTemplate {
	FMovieSceneFloatChannel TopCurve; // 0x38
	FMovieSceneFloatChannel LeftCurve; // 0xd8
	FMovieSceneFloatChannel RightCurve; // 0x178
	FMovieSceneFloatChannel BottomCurve; // 0x218
	EMovieSceneBlendType BlendType; // 0x2b8
};

struct FSourceEffectPhaserSettings {
	float WetLevel; // 0x0
	float Frequency; // 0x4
	float Feedback; // 0x8
	EPhaserLFOType LFOType; // 0xc
	bool UseQuadraturePhase; // 0xd
};

struct FXRDeviceId {
	FName SystemName; // 0x0
	int32_t DeviceID; // 0x8
};

struct FLandmarkSetupInfo {
	int32_t UID; // 0x8
	FText Name; // 0x10
	FText Discription; // 0x28
	FSlateBrush Icon; // 0x40
	FDataTableRowHandle ActiveTicket; // 0xc8
	ELandmarkEffectActionType ActionType; // 0xd8
	ALandmarkEffectBase* UpEffect; // 0xe0
	ALandmarkEffectBase* DownEffect; // 0xe8
	float ExpireTime; // 0xf0
	TArray<int32_t> ImportantDropList; // 0xf8
};

struct FExpandableAreaStyle {
	FSlateBrush CollapsedImage; // 0x8
	FSlateBrush ExpandedImage; // 0x90
	float RolloutAnimationSeconds; // 0x118
};

struct FParticleRandomSeedInfo {
	FName ParameterName; // 0x0
	char bGetSeedFromInstance : 1; // 0x8
	char bInstanceSeedIsIndex : 1; // 0x8
	char bResetSeedOnEmitterLooping : 1; // 0x8
	char bRandomlySelectSeedArray : 1; // 0x8
	TArray<int32_t> RandomSeeds; // 0x10
};

struct FAIMoveRequest {
	AActor* GoalActor; // 0x0
};

struct FPutDestinationRequest {
	FString DestinationName; // 0x0
	FString TargetArn; // 0x10
	FString RoleArn; // 0x20
};

struct FPlayerSteamProfile {
	FString Username; // 0x0
	FString SteamID; // 0x10
	UTexture2D* ProfilePicture; // 0x20
	bool bIsHost; // 0x28
};

struct FMovieSceneEntitySystemGraph {
	FMovieSceneEntitySystemGraphNodes Nodes; // 0x80
};

struct FTransform {
	FQuat Rotation; // 0x0
	FVector Translation; // 0x10
	FVector Scale3D; // 0x20
};

struct FMetricDataQuery {
	FString ID; // 0x0
	FMetricStat MetricStat; // 0x10
	FString Expression; // 0x60
	FString Label; // 0x70
	bool bReturnData; // 0x80
	int32_t Period; // 0x84
};

struct FClothPhysicsProperties_Legacy {
	float VerticalResistance; // 0x0
	float HorizontalResistance; // 0x4
	float BendResistance; // 0x8
	float ShearResistance; // 0xc
	float Friction; // 0x10
	float Damping; // 0x14
	float TetherStiffness; // 0x18
	float TetherLimit; // 0x1c
	float Drag; // 0x20
	float StiffnessFrequency; // 0x24
	float GravityScale; // 0x28
	float MassScale; // 0x2c
	float InertiaBlend; // 0x30
	float SelfCollisionThickness; // 0x34
	float SelfCollisionSquashScale; // 0x38
	float SelfCollisionStiffness; // 0x3c
	float SolverFrequency; // 0x40
	float FiberCompression; // 0x44
	float FiberExpansion; // 0x48
	float FiberResistance; // 0x4c
};

struct FPreviewAssetAttachContainer {
	TArray<FPreviewAttachedObjectPair> AttachedObjects; // 0x0
};

struct FBuildPromotionTestSettings {
	FFilePath DefaultStaticMeshAsset; // 0x0
	FBuildPromotionImportWorkflowSettings ImportWorkflow; // 0x10
	FBuildPromotionOpenAssetSettings OpenAssets; // 0x160
	FBuildPromotionNewProjectSettings NewProjectSettings; // 0x1c0
	FFilePath SourceControlMaterial; // 0x1e0
};

struct FListTagsLogGroupRequest {
	FString LogGroupName; // 0x0
};

struct FRigConfiguration {
	URig* Rig; // 0x0
	TArray<FNameMapping> BoneMappingTable; // 0x8
};

struct FQueryWorkshopForAllItemsResult {
	FSteamUGCQueryParameterAll queryParams; // 0x30
};

struct FMagicLeapARPinObjectIdList {
	TSet<FString> ObjectIdList; // 0x0
};

struct FEnvTraceData {
	int32_t VersionNum; // 0x0
	UNavigationQueryFilter* NavigationFilter; // 0x8
	float ProjectDown; // 0x10
	float ProjectUp; // 0x14
	float ExtentX; // 0x18
	float ExtentY; // 0x1c
	float ExtentZ; // 0x20
	float PostProjectionVerticalOffset; // 0x24
	ETraceTypeQuery TraceChannel; // 0x28
	ECollisionChannel SerializedChannel; // 0x29
	EEnvTraceShape TraceShape; // 0x2a
	EEnvQueryTrace TraceMode; // 0x2b
	char bTraceComplex : 1; // 0x2c
	char bOnlyBlockingHits : 1; // 0x2c
	char bCanTraceOnNavMesh : 1; // 0x2c
	char bCanTraceOnGeometry : 1; // 0x2c
	char bCanDisableTrace : 1; // 0x2c
	char bCanProjectDown : 1; // 0x2c
};

struct FEngineServiceTerminate {
	FString Username; // 0x0
};

struct FItemGeneralInfo {
	FText Name; // 0x8
	EItemGrade Tier; // 0x20
	EItemCategoryType Type; // 0x21
	TMap<EItemActionType, USoundBase*> ActionSound; // 0x28
	FText DisplayCategory; // 0x78
	FText Desc; // 0x90
	bool bDropable; // 0xa8
	bool bStackable; // 0xa9
	int32_t MaxStack; // 0xac
	float CreateCondition; // 0xb0
	float MaxCondition; // 0xb4
	UTexture2D* Icon; // 0xb8
	UStaticMesh* WorldMesh; // 0xc0
	FTransform WorldMeshTransform; // 0xd0
	float DestroyTime; // 0x100
	float EnergyTransformValue; // 0x104
	char RadiogramOption; // 0x108
	FText MainGroupName; // 0x110
	FText SubGroupName; // 0x128
	int32_t RadiogramSortOrder; // 0x140
};

struct FAnimNode_BlendBoneByChannel {
	FPoseLink A; // 0x10
	FPoseLink B; // 0x20
	TArray<FBlendBoneByChannelEntry> BoneDefinitions; // 0x30
	float Alpha; // 0x50
	FInputScaleBias AlphaScaleBias; // 0x58
	EBoneControlSpace TransformsSpace; // 0x60
};

struct FCreateExportTaskResult {
	FString TaskId; // 0x0
};

struct FPendingReleaseSkeletalMeshInfo {
	USkeletalMesh* SkeletalMesh; // 0x0
	double Timestamp; // 0x8
};

struct FRenderingPolygon {
	FPolygonGroupID PolygonGroupID; // 0x0
	TArray<FTriangleID> TriangulatedPolygonTriangleIndices; // 0x8
};

struct FPBUF_sv_GameLogReq {
	FString Json; // 0x0
};

struct FAnimationSharingScalability {
	FPerPlatformBool UseBlendTransitions; // 0x0
	FPerPlatformFloat BlendSignificanceValue; // 0x4
	FPerPlatformInt MaximumNumberConcurrentBlends; // 0x8
	FPerPlatformFloat TickSignificanceValue; // 0xc
};

struct FS_TutorialGoalDataArray {
	TArray<FS_TutorialGoalData> TutorialGoalDataArray_3_A4B9A2CE443DF0D1BA1EDC88204394DD; // 0x0
};

struct FWidgetNavigationData {
	EUINavigationRule Rule; // 0x0
	FName WidgetToFocus; // 0x4
	TWeakObjectPtr<UWidget> Widget; // 0xc
	FDelegate CustomDelegate; // 0x14
};

struct FDonNavVoxelY {
	TArray<FDonNavigationVoxel> Z; // 0x0
};

struct FAnimNode_PoseByName {
	FName PoseName; // 0x80
	float PoseWeight; // 0x88
};

struct FDoNNavigationQueryData {
	TWeakObjectPtr<AActor> Actor; // 0x0
	TWeakObjectPtr<UPrimitiveComponent> CollisionComponent; // 0x8
	FVector Origin; // 0x10
	FVector Destination; // 0x1c
	FDoNNavigationQueryParams queryParams; // 0x28
	TArray<FVector> PathSolutionOptimized; // 0x270
	EDonNavigationQueryStatus QueryStatus; // 0x280
};

struct FTextSizingParameters {
	float DrawX; // 0x0
	float DrawY; // 0x4
	float DrawXL; // 0x8
	float DrawYL; // 0xc
	FVector2D Scaling; // 0x10
	UFont* DrawFont; // 0x18
	FVector2D SpacingAdjust; // 0x20
};

struct FLandscapeSplineInterpPoint {
	FVector Center; // 0x0
	FVector Left; // 0xc
	FVector Right; // 0x18
	FVector FalloffLeft; // 0x24
	FVector FalloffRight; // 0x30
	FVector LayerLeft; // 0x3c
	FVector LayerRight; // 0x48
	FVector LayerFalloffLeft; // 0x54
	FVector LayerFalloffRight; // 0x60
	float StartEndFalloff; // 0x6c
};

struct FAnimNode_BlendListBase {
	TArray<FPoseLink> BlendPose; // 0x10
	TArray<float> BlendTime; // 0x20
	EBlendListTransitionType TransitionType; // 0x30
	EAlphaBlendOption BlendType; // 0x31
	bool bResetChildOnActivation; // 0x32
	UCurveFloat* CustomBlendCurve; // 0x38
	UBlendProfile* BlendProfile; // 0x40
};

struct FGameplayTagCategoryRemap {
	FString BaseCategory; // 0x0
	TArray<FString> RemapCategories; // 0x10
};

struct FAnimNode_TransitionResult {
	bool bCanEnterTransition; // 0x10
};

struct FSolverIterations {
	float FixedTimeStep; // 0x0
	int32_t SolverIterations; // 0x4
	int32_t JointIterations; // 0x8
	int32_t CollisionIterations; // 0xc
	int32_t SolverPushOutIterations; // 0x10
	int32_t JointPushOutIterations; // 0x14
	int32_t CollisionPushOutIterations; // 0x18
};

struct FAnimNode_Trail {
	FBoneReference TrailBone; // 0x100
	int32_t ChainLength; // 0x110
	EAxis ChainBoneAxis; // 0x114
	char bInvertChainBoneAxis : 1; // 0x115
	char bLimitStretch : 1; // 0x115
	char bLimitRotation : 1; // 0x115
	char bUsePlanarLimit : 1; // 0x115
	char bActorSpaceFakeVel : 1; // 0x115
	char bReorientParentToChild : 1; // 0x115
	float MaxDeltaTime; // 0x118
	float RelaxationSpeedScale; // 0x11c
	FRuntimeFloatCurve TrailRelaxationSpeed; // 0x120
	FInputScaleBiasClamp RelaxationSpeedScaleInputProcessor; // 0x1a8
	TArray<FRotationLimit> RotationLimits; // 0x1d8
	TArray<FVector> RotationOffsets; // 0x1e8
	TArray<FAnimPhysPlanarLimit> PlanarLimits; // 0x1f8
	float StretchLimit; // 0x208
	FVector FakeVelocity; // 0x20c
	FBoneReference BaseJoint; // 0x218
	float LastBoneRotationAnimAlphaBlend; // 0x228
};

struct FTranslationTrack {
	TArray<FVector> PosKeys; // 0x0
	TArray<float> Times; // 0x10
};

struct FFractureEffect {
	UParticleSystem* ParticleSystem; // 0x0
	USoundBase* Sound; // 0x8
};

struct FTakeHitInfo {
	float ActualDamage; // 0x0
	float HitTime; // 0x4
	UObject* DamageTypeClass; // 0x8
