// Created by BlueFire1337
// Updated 2022-01-21
// Generated 2022-01-23

#pragma once

struct FMovieSceneEventPayloadVariable {
	FString Value; // 0x0
};

struct FInAppPurchaseReceiptInfo2 {
	FString ItemName; // 0x0
	FString ItemId; // 0x10
	FString ValidationInfo; // 0x20
};

struct FGenericStruct {
	int32_t Data; // 0x0
};

struct FMovieSceneActorReferenceKey {
	FMovieSceneObjectBindingID Object; // 0x0
	FName ComponentName; // 0x18
	FName SocketName; // 0x20
};

struct FAnimalsAnimInstanceConfig {
	UAimOffsetBlendSpace* AO; // 0x0
	UAnimSequence* BasePose; // 0x8
	UBlendSpaceBase* BaseAnimBS; // 0x10
	UBlendSpaceBase* LeanBS; // 0x18
	UAnimSequence* Idle_V1_AdditiveAnim; // 0x20
	UAnimSequence* Idle_V2_AdditiveAnim; // 0x28
	UBlendSpace* Moving_F; // 0x30
	UBlendSpace* Moving_BkPd; // 0x38
	UBlendSpace* Moving_F_Arch; // 0x40
	UAnimSequence* JumpStart; // 0x48
	UAnimSequence* JumpFlail; // 0x50
	UAnimSequence* JumpFalling; // 0x58
	UAnimSequence* JumpLand; // 0x60
	UAnimMontage* JumpAdditiveLandMontage; // 0x68
	UAnimMontage* JumpAdditiveMovingLandMontage; // 0x70
	UBlendSpace* JumpLeanBS; // 0x78
};

struct FSceneComponentInstanceData : FActorComponentInstanceData {
	TMap<USceneComponent*, FTransform> AttachedInstanceComponents; // 0x68
};

struct FAlwaysRelevantActorInfo {
	UNetConnection* Connection; // 0x0
	AActor* LastViewer; // 0x8
	AActor* LastViewTarget; // 0x10
};

struct FMovieSceneNiagaraIntegerParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	FMovieSceneIntegerChannel IntegerChannel; // 0x40
};

struct FNodeHierarchyData {
	TArray<FNodeObject> Nodes; // 0x0
	TArray<FTransform> Transforms; // 0x10
	TMap<FName, int32_t> NodeNameToIndexMapping; // 0x20
};

struct FSourceEffectSimpleDelaySettings {
	float SpeedOfSound; // 0x0
	float DelayAmount; // 0x4
	float DryAmount; // 0x8
	float WetAmount; // 0xc
	float Feedback; // 0x10
	char bDelayBasedOnDistance : 1; // 0x14
};

struct FAnimGraphBlendOptions {
	float BlendInTime; // 0x0
	float BlendOutTime; // 0x4
};

struct FPlayerReservation {
	FUniqueNetIdRepl UniqueId; // 0x0
	FString ValidationStr; // 0x28
	FString PlatForm; // 0x38
	bool bAllowCrossplay; // 0x48
	float ElapsedTime; // 0x4c
};

struct FARImageUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	UARCandidateImage* DetectedImage; // 0x50
	FVector2D EstimatedSize; // 0x58
};

struct FAnimNode_CCDIK : FAnimNode_SkeletalControlBase {
	FVector EffectorLocation; // 0xc8
	EBoneControlSpace EffectorLocationSpace; // 0xd4
	FBoneSocketTarget EffectorTarget; // 0xe0
	FBoneReference TipBone; // 0x140
	FBoneReference RootBone; // 0x150
	float Precision; // 0x160
	int32_t MaxIterations; // 0x164
	bool bStartFromTail; // 0x168
	bool bEnableRotationLimit; // 0x169
	TArray<float> RotationLimitPerJoints; // 0x170
};

struct FFilterOptionPerAxis {
	bool bX; // 0x0
	bool bY; // 0x1
	bool bZ; // 0x2
};

struct FSkeletalMeshSamplingBuiltData {
	TArray<FSkeletalMeshSamplingLODBuiltData> WholeMeshBuiltData; // 0x0
	TArray<FSkeletalMeshSamplingRegionBuiltData> RegionBuiltData; // 0x10
};

struct FLiveLinkSubjectName {
	FName Name; // 0x0
};

struct FSoundWaveSpectralData {
	float FrequencyHz; // 0x0
	float Magnitude; // 0x4
	float NormalizedMagnitude; // 0x8
};

struct FSubsurfaceProfileStruct {
	FLinearColor SurfaceAlbedo; // 0x0
	FLinearColor MeanFreePathColor; // 0x10
	float MeanFreePathDistance; // 0x20
	float WorldUnitScale; // 0x24
	bool bEnableBurley; // 0x28
	float ScatterRadius; // 0x2c
	FLinearColor SubsurfaceColor; // 0x30
	FLinearColor FalloffColor; // 0x40
	FLinearColor BoundaryColorBleed; // 0x50
	float ExtinctionScale; // 0x60
	float NormalScale; // 0x64
	float ScatteringDistribution; // 0x68
	float IOR; // 0x6c
	float Roughness0; // 0x70
	float Roughness1; // 0x74
	float LobeMix; // 0x78
	FLinearColor TransmissionTintColor; // 0x7c
};

struct FGateData : FTableRowBase {
	FString GateName; // 0x8
	FVector2D GatePosition; // 0x18
	FName OccupiedGuildID; // 0x20
};

struct FWorship {
	float MulAdd; // 0x0
	EWorshipType WorshipType; // 0x4
	FDateTime EndTime; // 0x8
	int64_t EndTimeTicks; // 0x10
	int32_t ServerId; // 0x18
};

struct FBlendSampleData {
	int32_t SampleDataIndex; // 0x0
	UAnimSequence* Animation; // 0x8
	float TotalWeight; // 0x10
	float Time; // 0x14
	float PreviousTime; // 0x18
	float SamplePlayRate; // 0x1c
};

struct FBuildPromotionOpenAssetSettings {
	FFilePath BlueprintAsset; // 0x0
	FFilePath MaterialAsset; // 0x10
	FFilePath ParticleSystemAsset; // 0x20
	FFilePath SkeletalMeshAsset; // 0x30
	FFilePath StaticMeshAsset; // 0x40
	FFilePath TextureAsset; // 0x50
};

struct FSkillAddExpAction {
	float OneHandWeaponAttack; // 0x0
	float OneHandWeaponBlock; // 0x4
	float OneHandWeaponHangUp; // 0x8
	float TwoHandWeaponAttack; // 0xc
	float TwoHandWeaponBlock; // 0x10
	float TwoHandWeaponHangUp; // 0x14
	float ShieldBlock; // 0x18
	float ShieldBlockArrow; // 0x1c
	float ShieldAttack; // 0x20
	float ShieldHandUp; // 0x24
	float PolearmsAttack; // 0x28
	float PolearmsBlock; // 0x2c
	float PolearmsHangUp; // 0x30
	float HeavyArmorBePointAttack; // 0x34
	float HeavyArmorBeAOEAttack; // 0x38
	float HeavyArmorSpendSP; // 0x3c
	float HeavyArmorHangUp; // 0x40
	float ThrowEmpty; // 0x44
	float ThrowAttack; // 0x48
	float ThrowAOEAttack; // 0x4c
	float ThrowHangUp; // 0x50
	float ArcheryEmpty; // 0x54
	float ArcheryAttack; // 0x58
	float ArcheryAOEAttack; // 0x5c
	float ArcheryHangUp; // 0x60
	float CrossbowsEmpty; // 0x64
	float CrossbowsAttack; // 0x68
	float CrossbowsAOEAttack; // 0x6c
	float CrossbowsHangUp; // 0x70
	float RiderMove; // 0x74
	float RiderHangUp; // 0x78
	float LightArmorBePointAttack; // 0x7c
	float LightArmorBeAOEAttack; // 0x80
	float LightArmorSpendSP; // 0x84
	float LightArmorHangUp; // 0x88
	float PhysiqueBeAttack; // 0x8c
	float PhysiqueBeAOEAttack; // 0x90
	float PhysiqueSpendSP; // 0x94
	float PhysiqueHangUp; // 0x98
	float MiningEmpty; // 0x9c
	float MiningTool; // 0xa0
	float MiningHangUp; // 0xa4
	float LumberingEmpty; // 0xa8
	float LumberingTool; // 0xac
	float LumberingHangUp; // 0xb0
	float HuntingEmpty; // 0xb4
	float HuntingTool; // 0xb8
	float HuntingHangUp; // 0xbc
	float PlantingSow; // 0xc0
	float PlantingFertilizer; // 0xc4
	float PlantingHoeing; // 0xc8
	float PlantingHarvest; // 0xcc
	float PlantingHangUp; // 0xd0
	float SiegeCraft; // 0xd4
	float SiegeFire; // 0xd8
	float SiegeHitSuccess; // 0xdc
	float SiegeHangUp; // 0xe0
	float BuildingCraft; // 0xe4
	float BuildingPlace; // 0xe8
	float BuildingFrameStepSkillExp; // 0xec
	float BuildingRepair; // 0xf0
	float BuildingHangUp; // 0xf4
	float HandMakingCraftWeapon; // 0xf8
	float HandMakingRepair; // 0xfc
	float HandMakingForge; // 0x100
	float HandMakingHangUp; // 0x104
	float ArmorCraftArmor; // 0x108
	float ArmorRepair; // 0x10c
	float ArmorForge; // 0x110
	float ArmorHangUp; // 0x114
	float HerbCraftHerb; // 0x118
	float HerbCraftFood; // 0x11c
	float HerbUseHerb; // 0x120
	float HerbUseFood; // 0x124
	float HerbHangUp; // 0x128
	float LeaderShipMakeDamage; // 0x12c
	float LeaderShipAddLevelExp; // 0x130
	float LeaderHangUp; // 0x134
	float TameToRecruitDefaultValue; // 0x138
	float TameToRecruitRatio; // 0x13c
	float RecruitPeace; // 0x140
	float RecruitHangUp; // 0x144
	float GeneralAddExpToTraning; // 0x148
	float TraningHangUp; // 0x14c
	float TameHorse; // 0x150
	float TameHangUp; // 0x154
	float RenownRunBusiness; // 0x158
	float RenownAchievement; // 0x15c
	float RenownJoinXianChengBattle; // 0x160
	float RenownWinXianChengBattle; // 0x164
	float RenownLoseXianChengBattle; // 0x168
	float RenownPutYueDanPingItem; // 0x16c
	float RenownBannerStructure; // 0x170
	float RenownHangUp; // 0x174
	float RenownJoinTaiShouBattle; // 0x178
	float RenownWinTaiShouBattle; // 0x17c
	float RenownLoseTaiShouBattle; // 0x180
	float RenownJoinGuanAiBattle; // 0x184
	float RenownWinGuanAiBattle; // 0x188
	float RenownLoseGuanAiBattle; // 0x18c
	float HuntingFish; // 0x190
	float SEHunting; // 0x194
};

struct FBlueprintInputDelegateBinding {
	char bConsumeInput : 1; // 0x0
	char bExecuteWhenPaused : 1; // 0x0
	char bOverrideParentBinding : 1; // 0x0
};

struct FAttributeMetaData : FTableRowBase {
	float BaseValue; // 0x8
	float MinValue; // 0xc
	float MaxValue; // 0x10
	FString DerivedAttributeInfo; // 0x18
	bool bCanStack; // 0x28
};

struct FDatasmithMeshSectionInfoMapTemplate {
	TMap<uint32_t, FDatasmithMeshSectionInfoTemplate> Map; // 0x0
};

struct FBuffNetData {
	USGBuff* BuffClass; // 0x0
	FVector position; // 0x8
	float LifeTime; // 0x14
	EBuffFormType FromType; // 0x18
};

struct FGuildSkillSingleRequire {
	ESkillType RequireSkill; // 0x0
	int32_t RequireLevel; // 0x4
};

struct FSourceEffectMidSideSpreaderSettings {
	float SpreadAmount; // 0x0
	EStereoChannelMode InputMode; // 0x4
	EStereoChannelMode OutputMode; // 0x5
	bool bEqualPower; // 0x6
};

struct FPostProcessSettings {
	char bOverride_WhiteTemp : 1; // 0x0
	char bOverride_WhiteTint : 1; // 0x0
	char bOverride_ColorSaturation : 1; // 0x0
	char bOverride_ColorContrast : 1; // 0x0
	char bOverride_ColorGamma : 1; // 0x0
	char bOverride_ColorGain : 1; // 0x0
	char bOverride_ColorOffset : 1; // 0x0
	char bOverride_ColorSaturationShadows : 1; // 0x0
	char bOverride_ColorContrastShadows : 1; // 0x1
	char bOverride_ColorGammaShadows : 1; // 0x1
	char bOverride_ColorGainShadows : 1; // 0x1
	char bOverride_ColorOffsetShadows : 1; // 0x1
	char bOverride_ColorSaturationMidtones : 1; // 0x1
	char bOverride_ColorContrastMidtones : 1; // 0x1
	char bOverride_ColorGammaMidtones : 1; // 0x1
	char bOverride_ColorGainMidtones : 1; // 0x1
	char bOverride_ColorOffsetMidtones : 1; // 0x2
	char bOverride_ColorSaturationHighlights : 1; // 0x2
	char bOverride_ColorContrastHighlights : 1; // 0x2
	char bOverride_ColorGammaHighlights : 1; // 0x2
	char bOverride_ColorGainHighlights : 1; // 0x2
	char bOverride_ColorOffsetHighlights : 1; // 0x2
	char bOverride_ColorCorrectionShadowsMax : 1; // 0x2
	char bOverride_ColorCorrectionHighlightsMin : 1; // 0x2
	char bOverride_BlueCorrection : 1; // 0x3
	char bOverride_ExpandGamut : 1; // 0x3
	char bOverride_ToneCurveAmount : 1; // 0x3
	char bOverride_FilmWhitePoint : 1; // 0x3
	char bOverride_FilmSaturation : 1; // 0x3
	char bOverride_FilmChannelMixerRed : 1; // 0x3
	char bOverride_FilmChannelMixerGreen : 1; // 0x3
	char bOverride_FilmChannelMixerBlue : 1; // 0x3
	char bOverride_FilmContrast : 1; // 0x4
	char bOverride_FilmDynamicRange : 1; // 0x4
	char bOverride_FilmHealAmount : 1; // 0x4
	char bOverride_FilmToeAmount : 1; // 0x4
	char bOverride_FilmShadowTint : 1; // 0x4
	char bOverride_FilmShadowTintBlend : 1; // 0x4
	char bOverride_FilmShadowTintAmount : 1; // 0x4
	char bOverride_FilmSlope : 1; // 0x4
	char bOverride_FilmToe : 1; // 0x5
	char bOverride_FilmShoulder : 1; // 0x5
	char bOverride_FilmBlackClip : 1; // 0x5
	char bOverride_FilmWhiteClip : 1; // 0x5
	char bOverride_SceneColorTint : 1; // 0x5
	char bOverride_SceneFringeIntensity : 1; // 0x5
	char bOverride_ChromaticAberrationStartOffset : 1; // 0x5
	char bOverride_AmbientCubemapTint : 1; // 0x5
	char bOverride_AmbientCubemapIntensity : 1; // 0x6
	char bOverride_BloomMethod : 1; // 0x6
	char bOverride_BloomIntensity : 1; // 0x6
	char bOverride_BloomThreshold : 1; // 0x6
	char bOverride_Bloom1Tint : 1; // 0x6
	char bOverride_Bloom1Size : 1; // 0x6
	char bOverride_Bloom2Size : 1; // 0x6
	char bOverride_Bloom2Tint : 1; // 0x6
	char bOverride_Bloom3Tint : 1; // 0x7
	char bOverride_Bloom3Size : 1; // 0x7
	char bOverride_Bloom4Tint : 1; // 0x7
	char bOverride_Bloom4Size : 1; // 0x7
	char bOverride_Bloom5Tint : 1; // 0x7
	char bOverride_Bloom5Size : 1; // 0x7
	char bOverride_Bloom6Tint : 1; // 0x7
	char bOverride_Bloom6Size : 1; // 0x7
	char bOverride_BloomSizeScale : 1; // 0x8
	char bOverride_BloomConvolutionTexture : 1; // 0x8
	char bOverride_BloomConvolutionSize : 1; // 0x8
	char bOverride_BloomConvolutionCenterUV : 1; // 0x8
	char bOverride_BloomConvolutionPreFilter : 1; // 0x8
	char bOverride_BloomConvolutionPreFilterMin : 1; // 0x8
	char bOverride_BloomConvolutionPreFilterMax : 1; // 0x8
	char bOverride_BloomConvolutionPreFilterMult : 1; // 0x8
	char bOverride_BloomConvolutionBufferScale : 1; // 0x9
	char bOverride_BloomDirtMaskIntensity : 1; // 0x9
	char bOverride_BloomDirtMaskTint : 1; // 0x9
	char bOverride_BloomDirtMask : 1; // 0x9
	char bOverride_CameraShutterSpeed : 1; // 0x9
	char bOverride_CameraISO : 1; // 0x9
	char bOverride_AutoExposureMethod : 1; // 0x9
	char bOverride_AutoExposureLowPercent : 1; // 0x9
	char bOverride_AutoExposureHighPercent : 1; // 0xa
	char bOverride_AutoExposureMinBrightness : 1; // 0xa
	char bOverride_AutoExposureMaxBrightness : 1; // 0xa
	char bOverride_AutoExposureCalibrationConstant : 1; // 0xa
	char bOverride_AutoExposureSpeedUp : 1; // 0xa
	char bOverride_AutoExposureSpeedDown : 1; // 0xa
	char bOverride_AutoExposureBias : 1; // 0xa
	char bOverride_AutoExposureBiasCurve : 1; // 0xa
	char bOverride_AutoExposureMeterMask : 1; // 0xb
	char bOverride_AutoExposureApplyPhysicalCameraExposure : 1; // 0xb
	char bOverride_HistogramLogMin : 1; // 0xb
	char bOverride_HistogramLogMax : 1; // 0xb
	char bOverride_LensFlareIntensity : 1; // 0xb
	char bOverride_LensFlareTint : 1; // 0xb
	char bOverride_LensFlareTints : 1; // 0xb
	char bOverride_LensFlareBokehSize : 1; // 0xb
	char bOverride_LensFlareBokehShape : 1; // 0xc
	char bOverride_LensFlareThreshold : 1; // 0xc
	char bOverride_VignetteIntensity : 1; // 0xc
	char bOverride_GrainIntensity : 1; // 0xc
	char bOverride_GrainJitter : 1; // 0xc
	char bOverride_AmbientOcclusionIntensity : 1; // 0xc
	char bOverride_AmbientOcclusionStaticFraction : 1; // 0xc
	char bOverride_AmbientOcclusionRadius : 1; // 0xc
	char bOverride_AmbientOcclusionFadeDistance : 1; // 0xd
	char bOverride_AmbientOcclusionFadeRadius : 1; // 0xd
	char bOverride_AmbientOcclusionDistance : 1; // 0xd
	char bOverride_AmbientOcclusionRadiusInWS : 1; // 0xd
	char bOverride_AmbientOcclusionPower : 1; // 0xd
	char bOverride_AmbientOcclusionBias : 1; // 0xd
	char bOverride_AmbientOcclusionQuality : 1; // 0xd
	char bOverride_AmbientOcclusionMipBlend : 1; // 0xd
	char bOverride_AmbientOcclusionMipScale : 1; // 0xe
	char bOverride_AmbientOcclusionMipThreshold : 1; // 0xe
	char bOverride_AmbientOcclusionTemporalBlendWeight : 1; // 0xe
	char bOverride_RayTracingAO : 1; // 0x10
	char bOverride_RayTracingAOSamplesPerPixel : 1; // 0x10
	char bOverride_RayTracingAOIntensity : 1; // 0x10
	char bOverride_RayTracingAORadius : 1; // 0x10
	char bOverride_LPVIntensity : 1; // 0x14
	char bOverride_LPVDirectionalOcclusionIntensity : 1; // 0x14
	char bOverride_LPVDirectionalOcclusionRadius : 1; // 0x14
	char bOverride_LPVDiffuseOcclusionExponent : 1; // 0x14
	char bOverride_LPVSpecularOcclusionExponent : 1; // 0x14
	char bOverride_LPVDiffuseOcclusionIntensity : 1; // 0x14
	char bOverride_LPVSpecularOcclusionIntensity : 1; // 0x14
	char bOverride_LPVSize : 1; // 0x14
	char bOverride_LPVSecondaryOcclusionIntensity : 1; // 0x15
	char bOverride_LPVSecondaryBounceIntensity : 1; // 0x15
	char bOverride_LPVGeometryVolumeBias : 1; // 0x15
	char bOverride_LPVVplInjectionBias : 1; // 0x15
	char bOverride_LPVEmissiveInjectionIntensity : 1; // 0x15
	char bOverride_LPVFadeRange : 1; // 0x15
	char bOverride_LPVDirectionalOcclusionFadeRange : 1; // 0x15
	char bOverride_IndirectLightingColor : 1; // 0x15
	char bOverride_IndirectLightingIntensity : 1; // 0x16
	char bOverride_ColorGradingIntensity : 1; // 0x16
	char bOverride_ColorGradingLUT : 1; // 0x16
	char bOverride_DepthOfFieldFocalDistance : 1; // 0x16
	char bOverride_DepthOfFieldFstop : 1; // 0x16
	char bOverride_DepthOfFieldMinFstop : 1; // 0x16
	char bOverride_DepthOfFieldBladeCount : 1; // 0x16
	char bOverride_DepthOfFieldSensorWidth : 1; // 0x16
	char bOverride_DepthOfFieldDepthBlurRadius : 1; // 0x17
	char bOverride_DepthOfFieldDepthBlurAmount : 1; // 0x17
	char bOverride_DepthOfFieldFocalRegion : 1; // 0x17
	char bOverride_DepthOfFieldNearTransitionRegion : 1; // 0x17
	char bOverride_DepthOfFieldFarTransitionRegion : 1; // 0x17
	char bOverride_DepthOfFieldScale : 1; // 0x17
	char bOverride_DepthOfFieldNearBlurSize : 1; // 0x17
	char bOverride_DepthOfFieldFarBlurSize : 1; // 0x17
	char bOverride_MobileHQGaussian : 1; // 0x18
	char bOverride_DepthOfFieldOcclusion : 1; // 0x18
	char bOverride_DepthOfFieldSkyFocusDistance : 1; // 0x18
	char bOverride_DepthOfFieldVignetteSize : 1; // 0x18
	char bOverride_EnableFSR : 1; // 0x1c
	char EnableFSRUpscale : 1; // 0x1c
	EFSRUpscaleQuality FSRUpscaleQuality; // 0x20
	char EnableFSRSharpening : 1; // 0x24
	float FSRSoftness; // 0x28
	char bOverride_MotionBlurAmount : 1; // 0x2c
	char bOverride_MotionBlurMax : 1; // 0x2c
	char bOverride_MotionBlurTargetFPS : 1; // 0x2c
	char bOverride_MotionBlurPerObjectSize : 1; // 0x2c
	char bOverride_ScreenPercentage : 1; // 0x2c
	char bOverride_ScreenSpaceReflectionIntensity : 1; // 0x2c
	char bOverride_ScreenSpaceReflectionQuality : 1; // 0x2c
	char bOverride_ScreenSpaceReflectionMaxRoughness : 1; // 0x2c
	char bOverride_ScreenSpaceReflectionRoughnessScale : 1; // 0x2d
	char bOverride_ReflectionsType : 1; // 0x30
	char bOverride_RayTracingReflectionsMaxRoughness : 1; // 0x30
	char bOverride_RayTracingReflectionsMaxBounces : 1; // 0x30
	char bOverride_RayTracingReflectionsSamplesPerPixel : 1; // 0x30
	char bOverride_RayTracingReflectionsShadows : 1; // 0x30
	char bOverride_RayTracingReflectionsTranslucency : 1; // 0x30
	char bOverride_TranslucencyType : 1; // 0x30
	char bOverride_RayTracingTranslucencyMaxRoughness : 1; // 0x30
	char bOverride_RayTracingTranslucencyRefractionRays : 1; // 0x31
	char bOverride_RayTracingTranslucencySamplesPerPixel : 1; // 0x31
	char bOverride_RayTracingTranslucencyShadows : 1; // 0x31
	char bOverride_RayTracingTranslucencyRefraction : 1; // 0x31
	char bOverride_RayTracingGI : 1; // 0x31
	char bOverride_RayTracingGIMaxBounces : 1; // 0x31
	char bOverride_RayTracingGISamplesPerPixel : 1; // 0x31
	char bOverride_PathTracingMaxBounces : 1; // 0x31
	char bOverride_PathTracingSamplesPerPixel : 1; // 0x32
	char bMobileHQGaussian : 1; // 0x34
	EBloomMethod BloomMethod; // 0x35
	EAutoExposureMethod AutoExposureMethod; // 0x36
	float WhiteTemp; // 0x38
	float WhiteTint; // 0x3c
	FVector4 ColorSaturation; // 0x40
	FVector4 ColorContrast; // 0x50
	FVector4 ColorGamma; // 0x60
	FVector4 ColorGain; // 0x70
	FVector4 ColorOffset; // 0x80
	FVector4 ColorSaturationShadows; // 0x90
	FVector4 ColorContrastShadows; // 0xa0
	FVector4 ColorGammaShadows; // 0xb0
	FVector4 ColorGainShadows; // 0xc0
	FVector4 ColorOffsetShadows; // 0xd0
	FVector4 ColorSaturationMidtones; // 0xe0
	FVector4 ColorContrastMidtones; // 0xf0
	FVector4 ColorGammaMidtones; // 0x100
	FVector4 ColorGainMidtones; // 0x110
	FVector4 ColorOffsetMidtones; // 0x120
	FVector4 ColorSaturationHighlights; // 0x130
	FVector4 ColorContrastHighlights; // 0x140
	FVector4 ColorGammaHighlights; // 0x150
	FVector4 ColorGainHighlights; // 0x160
	FVector4 ColorOffsetHighlights; // 0x170
	float ColorCorrectionHighlightsMin; // 0x180
	float ColorCorrectionShadowsMax; // 0x184
	float BlueCorrection; // 0x188
	float ExpandGamut; // 0x18c
	float ToneCurveAmount; // 0x190
	float FilmSlope; // 0x194
	float FilmToe; // 0x198
	float FilmShoulder; // 0x19c
	float FilmBlackClip; // 0x1a0
	float FilmWhiteClip; // 0x1a4
	FLinearColor FilmWhitePoint; // 0x1a8
	FLinearColor FilmShadowTint; // 0x1b8
	float FilmShadowTintBlend; // 0x1c8
	float FilmShadowTintAmount; // 0x1cc
	float FilmSaturation; // 0x1d0
	FLinearColor FilmChannelMixerRed; // 0x1d4
	FLinearColor FilmChannelMixerGreen; // 0x1e4
	FLinearColor FilmChannelMixerBlue; // 0x1f4
	float FilmContrast; // 0x204
	float FilmToeAmount; // 0x208
	float FilmHealAmount; // 0x20c
	float FilmDynamicRange; // 0x210
	FLinearColor SceneColorTint; // 0x214
	float SceneFringeIntensity; // 0x224
	float ChromaticAberrationStartOffset; // 0x228
	float BloomIntensity; // 0x22c
	float BloomThreshold; // 0x230
	float BloomSizeScale; // 0x234
	float Bloom1Size; // 0x238
	float Bloom2Size; // 0x23c
	float Bloom3Size; // 0x240
	float Bloom4Size; // 0x244
	float Bloom5Size; // 0x248
	float Bloom6Size; // 0x24c
	FLinearColor Bloom1Tint; // 0x250
	FLinearColor Bloom2Tint; // 0x260
	FLinearColor Bloom3Tint; // 0x270
	FLinearColor Bloom4Tint; // 0x280
	FLinearColor Bloom5Tint; // 0x290
	FLinearColor Bloom6Tint; // 0x2a0
	float BloomConvolutionSize; // 0x2b0
	UTexture2D* BloomConvolutionTexture; // 0x2b8
	FVector2D BloomConvolutionCenterUV; // 0x2c0
	float BloomConvolutionPreFilterMin; // 0x2c8
	float BloomConvolutionPreFilterMax; // 0x2cc
	float BloomConvolutionPreFilterMult; // 0x2d0
	float BloomConvolutionBufferScale; // 0x2d4
	UTexture* BloomDirtMask; // 0x2d8
	float BloomDirtMaskIntensity; // 0x2e0
	FLinearColor BloomDirtMaskTint; // 0x2e4
	FLinearColor AmbientCubemapTint; // 0x2f4
	float AmbientCubemapIntensity; // 0x304
	UTextureCube* AmbientCubemap; // 0x308
	float CameraShutterSpeed; // 0x310
	float CameraISO; // 0x314
	float DepthOfFieldFstop; // 0x318
	float DepthOfFieldMinFstop; // 0x31c
	int32_t DepthOfFieldBladeCount; // 0x320
	float AutoExposureBias; // 0x324
	float AutoExposureBiasBackup; // 0x328
	char bOverride_AutoExposureBiasBackup : 1; // 0x32c
	char AutoExposureApplyPhysicalCameraExposure : 1; // 0x330
	UCurveFloat* AutoExposureBiasCurve; // 0x338
	UTexture* AutoExposureMeterMask; // 0x340
	float AutoExposureLowPercent; // 0x348
	float AutoExposureHighPercent; // 0x34c
	float AutoExposureMinBrightness; // 0x350
	float AutoExposureMaxBrightness; // 0x354
	float AutoExposureSpeedUp; // 0x358
	float AutoExposureSpeedDown; // 0x35c
	float HistogramLogMin; // 0x360
	float HistogramLogMax; // 0x364
	float AutoExposureCalibrationConstant; // 0x368
	float LensFlareIntensity; // 0x36c
	FLinearColor LensFlareTint; // 0x370
	float LensFlareBokehSize; // 0x380
	float LensFlareThreshold; // 0x384
	UTexture* LensFlareBokehShape; // 0x388
	FLinearColor LensFlareTints[0x8]; // 0x390
	float VignetteIntensity; // 0x410
	float GrainJitter; // 0x414
	float GrainIntensity; // 0x418
	float AmbientOcclusionIntensity; // 0x41c
	float AmbientOcclusionStaticFraction; // 0x420
	float AmbientOcclusionRadius; // 0x424
	char AmbientOcclusionRadiusInWS : 1; // 0x428
	float AmbientOcclusionFadeDistance; // 0x42c
	float AmbientOcclusionFadeRadius; // 0x430
	float AmbientOcclusionDistance; // 0x434
	float AmbientOcclusionPower; // 0x438
	float AmbientOcclusionBias; // 0x43c
	float AmbientOcclusionQuality; // 0x440
	float AmbientOcclusionMipBlend; // 0x444
	float AmbientOcclusionMipScale; // 0x448
	float AmbientOcclusionMipThreshold; // 0x44c
	float AmbientOcclusionTemporalBlendWeight; // 0x450
	char RayTracingAO : 1; // 0x454
	int32_t RayTracingAOSamplesPerPixel; // 0x458
	float RayTracingAOIntensity; // 0x45c
	float RayTracingAORadius; // 0x460
	FLinearColor IndirectLightingColor; // 0x464
	float IndirectLightingIntensity; // 0x474
	ERayTracingGlobalIlluminationType RayTracingGIType; // 0x478
	int32_t RayTracingGIMaxBounces; // 0x47c
	int32_t RayTracingGISamplesPerPixel; // 0x480
	float ColorGradingIntensity; // 0x484
	UTexture* ColorGradingLUT; // 0x488
	float DepthOfFieldSensorWidth; // 0x490
	float DepthOfFieldFocalDistance; // 0x494
	float DepthOfFieldDepthBlurAmount; // 0x498
	float DepthOfFieldDepthBlurRadius; // 0x49c
	float DepthOfFieldFocalRegion; // 0x4a0
	float DepthOfFieldNearTransitionRegion; // 0x4a4
	float DepthOfFieldFarTransitionRegion; // 0x4a8
	float DepthOfFieldScale; // 0x4ac
	float DepthOfFieldNearBlurSize; // 0x4b0
	float DepthOfFieldFarBlurSize; // 0x4b4
	float DepthOfFieldOcclusion; // 0x4b8
	float DepthOfFieldSkyFocusDistance; // 0x4bc
	float DepthOfFieldVignetteSize; // 0x4c0
	float MotionBlurAmount; // 0x4c4
	float MotionBlurMax; // 0x4c8
	int32_t MotionBlurTargetFPS; // 0x4cc
	float MotionBlurPerObjectSize; // 0x4d0
	float LPVIntensity; // 0x4d4
	float LPVVplInjectionBias; // 0x4d8
	float LPVSize; // 0x4dc
	float LPVSecondaryOcclusionIntensity; // 0x4e0
	float LPVSecondaryBounceIntensity; // 0x4e4
	float LPVGeometryVolumeBias; // 0x4e8
	float LPVEmissiveInjectionIntensity; // 0x4ec
	float LPVDirectionalOcclusionIntensity; // 0x4f0
	float LPVDirectionalOcclusionRadius; // 0x4f4
	float LPVDiffuseOcclusionExponent; // 0x4f8
	float LPVSpecularOcclusionExponent; // 0x4fc
	float LPVDiffuseOcclusionIntensity; // 0x500
	float LPVSpecularOcclusionIntensity; // 0x504
	EReflectionsType ReflectionsType; // 0x508
	float ScreenSpaceReflectionIntensity; // 0x50c
	float ScreenSpaceReflectionQuality; // 0x510
	float ScreenSpaceReflectionMaxRoughness; // 0x514
	float RayTracingReflectionsMaxRoughness; // 0x518
	int32_t RayTracingReflectionsMaxBounces; // 0x51c
	int32_t RayTracingReflectionsSamplesPerPixel; // 0x520
	EReflectedAndRefractedRayTracedShadows RayTracingReflectionsShadows; // 0x524
	char RayTracingReflectionsTranslucency : 1; // 0x525
	ETranslucencyType TranslucencyType; // 0x526
	float RayTracingTranslucencyMaxRoughness; // 0x528
	int32_t RayTracingTranslucencyRefractionRays; // 0x52c
	int32_t RayTracingTranslucencySamplesPerPixel; // 0x530
	EReflectedAndRefractedRayTracedShadows RayTracingTranslucencyShadows; // 0x534
	char RayTracingTranslucencyRefraction : 1; // 0x535
	int32_t PathTracingMaxBounces; // 0x538
	int32_t PathTracingSamplesPerPixel; // 0x53c
	float LPVFadeRange; // 0x540
	float LPVDirectionalOcclusionFadeRange; // 0x544
	float ScreenPercentage; // 0x548
	FWeightedBlendables WeightedBlendables; // 0x550
};

struct FPaperTileSetTerrain {
	FString TerrainName; // 0x0
	int32_t CenterTileIndex; // 0x10
};

struct FMovieSceneVectorKeyStruct : FMovieSceneVectorKeyStructBase {
	FVector Vector; // 0x28
};

struct FInAppPurchaseProductRequest {
	FString ProductIdentifier; // 0x0
	bool bIsConsumable; // 0x10
};

struct FHumanVoiceSetting : FTableRowBase {
	FCustomSoundSettingArray SoundSetting[0x2]; // 0x8
};

struct FVirtualPropData {
	FName VirtualPropName; // 0x0
	FName VirtualPropBindSocket; // 0x8
	UStaticMesh* VirtualPropStaticMesh; // 0x10
	USkeletalMesh* VirtualPropSkeletalMesh; // 0x18
	bool ForbidOthersSpawn; // 0x20
	bool CanSpawnMultiProps; // 0x21
};

struct FMontageCustomCurve {
	TMap<FName, FBoneLocalTransform> BoneTransformMap; // 0x0
};

struct FBasePlayerDataDeadInfo {
	char bIsDead : 1; // 0x0
	FTransform LastSavedTransform; // 0x10
};

struct FMinimalViewInfo {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x18
	float DesiredFOV; // 0x1c
	float OrthoWidth; // 0x20
	float OrthoNearClipPlane; // 0x24
	float OrthoFarClipPlane; // 0x28
	float AspectRatio; // 0x2c
	char bConstrainAspectRatio : 1; // 0x30
	char bUseFieldOfViewForLOD : 1; // 0x30
	ECameraProjectionMode ProjectionMode; // 0x34
	float PostProcessBlendWeight; // 0x38
	FPostProcessSettings PostProcessSettings; // 0x40
	FVector2D OffCenterProjectionOffset; // 0x5a0
};

struct FInterpLookupPoint {
	FName GroupName; // 0x0
	float Time; // 0x8
};

struct FEnvDirection {
	UEnvQueryContext* LineFrom; // 0x0
	UEnvQueryContext* LineTo; // 0x8
	UEnvQueryContext* Rotation; // 0x10
	EEnvDirection DirMode; // 0x18
};

struct FRideTameRequireItemData {
	TArray<FRideTameRequireItemConfig> RideTameRequireItems; // 0x0
};

struct FRewardItemList {
	int32_t MinIndex; // 0x0
	int32_t MaxIndex; // 0x4
	TArray<FRewardItem> RewardItems; // 0x8
};

struct FAnimalsStopAnims {
	TMap<EAnimalsMovingGaitType, UAnimMontage*> TMap_FwdStop; // 0x0
};

struct FPassiveSoundMixModifier {
	USoundMix* SoundMix; // 0x0
	float MinVolumeThreshold; // 0x8
	float MaxVolumeThreshold; // 0xc
};

struct FGeneralLoyaltyModify {
	float MinLoyalty; // 0x0
	float DamageMultiAdd; // 0x4
	float DefenseMultiAdd; // 0x8
	float SkillEffectMultiAdd; // 0xc
};

struct FFunctionCaller {
	FName FunctionName; // 0x0
};

struct FMovieScene3DPathSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneObjectBindingID PathBindingID; // 0x20
	FMovieSceneFloatChannel TimingCurve; // 0x38
	MovieScene3DPathSection_Axis FrontAxisEnum; // 0xd8
	MovieScene3DPathSection_Axis UpAxisEnum; // 0xd9
	char bFollow : 1; // 0xdc
	char bReverse : 1; // 0xdc
	char bForceUpright : 1; // 0xdc
};

struct FAnimParentNodeAssetOverride {
	UAnimationAsset* NewAsset; // 0x0
	FGuid ParentNodeGuid; // 0x8
};

struct FSkeletalMeshOptimizationSettings {
	SkeletalMeshTerminationCriterion TerminationCriterion; // 0x0
	float NumOfTrianglesPercentage; // 0x4
	float NumOfVertPercentage; // 0x8
	uint32_t MaxNumOfTriangles; // 0xc
	uint32_t MaxNumOfVerts; // 0x10
	float MaxDeviationPercentage; // 0x14
	SkeletalMeshOptimizationType ReductionMethod; // 0x18
	SkeletalMeshOptimizationImportance SilhouetteImportance; // 0x19
	SkeletalMeshOptimizationImportance TextureImportance; // 0x1a
	SkeletalMeshOptimizationImportance ShadingImportance; // 0x1b
	SkeletalMeshOptimizationImportance SkinningImportance; // 0x1c
	char bRemapMorphTargets : 1; // 0x1d
	char bRecalcNormals : 1; // 0x1d
	float WeldingThreshold; // 0x20
	float NormalsThreshold; // 0x24
	int32_t MaxBonesPerVertex; // 0x28
	char bEnforceBoneBoundaries : 1; // 0x2c
	float VolumeImportance; // 0x30
	char bLockEdges : 1; // 0x34
	char bLockColorBounaries : 1; // 0x34
	int32_t BaseLOD; // 0x38
};

struct FNavigationFilterArea {
	UNavArea* AreaClass; // 0x0
	float TravelCostOverride; // 0x8
	float EnteringCostOverride; // 0xc
	char bIsExcluded : 1; // 0x10
	char bOverrideTravelCost : 1; // 0x10
	char bOverrideEnteringCost : 1; // 0x10
};

struct FKongmingLanternDropData {
	ASGKongmingLantern* DropClass; // 0x0
	float DropWrapperWeight; // 0x8
};

struct FPolyglotTextData {
	ELocalizedTextSourceCategory Category; // 0x0
	FString NativeCulture; // 0x8
	FString Namespace; // 0x18
	FString Key; // 0x28
	FString NativeString; // 0x38
	TMap<FString, FString> LocalizedStrings; // 0x48
	bool bIsMinimalPatch; // 0x98
	FText CachedText; // 0xa0
};

struct FAllianceBriefData {
	FGuid AllianceUid; // 0x0
	FString AllianceName; // 0x10
	FGuid HeadAllianceUid; // 0x20
	FGuid ParentAllianceUid; // 0x30
	FString OuterBillboard; // 0x40
	FAllianceGuildMember GuildMemberOwner; // 0x50
	TArray<FAllianceGuildMember> GuildMembers; // 0x60
	TArray<FAllianceAllianceMember> AllianceMembers; // 0x70
	char bCanApplyJoin : 1; // 0x80
	int32_t ServerId; // 0x84
};

struct FScrollBorderStyle : FSlateWidgetStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
};

struct FStableTrainerData : FTableRowBase {
	float TrainerAddRebornMul; // 0x8
	float TrainerAddTameMul; // 0xc
	float TrainerReduceTrainRewardIntervalMul; // 0x10
	float TrainerAddPerkChanceMul; // 0x14
	float TrainerAddExpMul; // 0x18
	float TrainerCapital; // 0x1c
	ECapitalType TrainerCapitalType; // 0x20
	EAnimalQualityType VehicleQualityType; // 0x21
};

struct FGameplayTagSource {
	FName SourceName; // 0x0
	EGameplayTagSourceType SourceType; // 0x8
	UGameplayTagsList* SourceTagList; // 0x10
	URestrictedGameplayTagsList* SourceRestrictedTagList; // 0x18
};

struct FHairAdvancedRenderingSettings {
	bool bUseStableRasterization; // 0x0
	bool bScatterSceneLighting; // 0x1
};

struct FSourceEffectChainEntry {
	USoundEffectSourcePreset* Preset; // 0x0
	char bBypass : 1; // 0x8
};

struct FExpressionOutput {
	FName OutputName; // 0x0
};

struct FSkeletalMeshLODInfo {
	FPerPlatformFloat ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	TArray<int32_t> LODMaterialMap; // 0x8
	FSkeletalMeshBuildSettings BuildSettings; // 0x18
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x2c
	TArray<FBoneReference> BonesToRemove; // 0x68
	TArray<FBoneReference> BonesToPrioritize; // 0x78
	float WeightOfPrioritization; // 0x88
	UAnimSequence* BakePose; // 0x90
	UAnimSequence* BakePoseOverride; // 0x98
	FString SourceImportFilename; // 0xa0
	ESkinCacheUsage SkinCacheUsage; // 0xb0
	char bHasBeenSimplified : 1; // 0xb1
	char bHasPerLODVertexColors : 1; // 0xb1
	char bAllowCPUAccess : 1; // 0xb1
	char bSupportUniformlyDistributedSampling : 1; // 0xb1
};

struct FPhysicsSphereData {
	float Radius; // 0x0
	FTransform Transform; // 0x10
	FKShapeElem Element; // 0x40
};

struct FStreamingTextureBuildInfo {
	uint32_t PackedRelativeBox; // 0x0
	int32_t TextureLevelIndex; // 0x4
	float TexelFactor; // 0x8
};

struct FWaterBrushEffectBlurring {
	bool bBlurShape; // 0x0
	int32_t Radius; // 0x4
};

struct FSeasonWeekQuestDefine {
	int32_t WeekIndex; // 0x0
	FDateTime StartTime; // 0x8
	FDateTime EndTime; // 0x10
	TArray<int32_t> WeekQuestsIndexArray; // 0x18
};

struct FLightmassDebugOptions {
	char bDebugMode : 1; // 0x0
	char bStatsEnabled : 1; // 0x0
	char bGatherBSPSurfacesAcrossComponents : 1; // 0x0
	float CoplanarTolerance; // 0x4
	char bUseImmediateImport : 1; // 0x8
	char bImmediateProcessMappings : 1; // 0x8
	char bSortMappings : 1; // 0x8
	char bDumpBinaryFiles : 1; // 0x8
	char bDebugMaterials : 1; // 0x8
	char bPadMappings : 1; // 0x8
	char bDebugPaddings : 1; // 0x8
	char bOnlyCalcDebugTexelMappings : 1; // 0x8
	char bUseRandomColors : 1; // 0x9
	char bColorBordersGreen : 1; // 0x9
	char bColorByExecutionTime : 1; // 0x9
	float ExecutionTimeDivisor; // 0xc
};

struct FSplinePoint {
	float InputKey; // 0x0
	FVector position; // 0x4
	FVector ArriveTangent; // 0x10
	FVector LeaveTangent; // 0x1c
	FRotator Rotation; // 0x28
	FVector Scale; // 0x34
	ESplinePointType Type; // 0x40
};

struct FPreviewAttachedObjectPair {
	TSoftObjectPtr<UObject> AttachedObject; // 0x0
	UObject* Object; // 0x28
	FName AttachedTo; // 0x30
};

struct FXRHMDData {
	bool bValid; // 0x0
	FName DeviceName; // 0x4
	FGuid ApplicationInstanceID; // 0xc
	ETrackingStatus TrackingStatus; // 0x1c
	FVector position; // 0x20
	FQuat Rotation; // 0x30
};

struct FGameplayAttribute {
	FString AttributeName; // 0x0
	TFieldPath<FProperty> Attribute; // 0x10
	UStruct* AttributeOwner; // 0x30
};

struct FNiagaraEventScriptProperties : FNiagaraEmitterScriptProperties {
	EScriptExecutionMode ExecutionMode; // 0x28
	uint32_t SpawnNumber; // 0x2c
	uint32_t MaxEventsPerFrame; // 0x30
	FGuid SourceEmitterID; // 0x34
	FName SourceEventName; // 0x44
	bool bRandomSpawnNumber; // 0x4c
	uint32_t MinSpawnNumber; // 0x50
};

struct FStaticComponentMaskValue {
	bool R; // 0x0
	bool G; // 0x1
	bool B; // 0x2
	bool A; // 0x3
};

struct FSlateColor {
	FLinearColor SpecifiedColor; // 0x0
	ESlateColorStylingMode ColorUseRule; // 0x10
};

struct FGaussianSumBloomSettings {
	float Intensity; // 0x0
	float Threshold; // 0x4
	float SizeScale; // 0x8
	float Filter1Size; // 0xc
	float Filter2Size; // 0x10
	float Filter3Size; // 0x14
	float Filter4Size; // 0x18
	float Filter5Size; // 0x1c
	float Filter6Size; // 0x20
	FLinearColor Filter1Tint; // 0x24
	FLinearColor Filter2Tint; // 0x34
	FLinearColor Filter3Tint; // 0x44
	FLinearColor Filter4Tint; // 0x54
	FLinearColor Filter5Tint; // 0x64
	FLinearColor Filter6Tint; // 0x74
};

struct FVertexToMove {
	FVertexID VertexID; // 0x0
	FVector NewVertexPosition; // 0x4
};

struct FAudioVolumeSubmixSendSettings {
	EAudioVolumeLocationState ListenerLocationState; // 0x0
	EAudioVolumeLocationState SourceLocationState; // 0x1
	TArray<FSoundSubmixSendInfo> SubmixSends; // 0x8
};

struct FEquipPlatformCheckBox {
	FVector Origin; // 0x0
	FVector BoxExtent; // 0xc
	char bShowDebug : 1; // 0x18
};

struct FKey {
	FName KeyName; // 0x0
};

struct FCropRipePhaseData {
	float NextTime; // 0x0
	float Percentage; // 0x4
	UStaticMesh* StageStaticMeshHasFruit; // 0x8
};

struct FCustomFieldData {
	FString Key; // 0x0
	FString Value; // 0x10
};

struct FMovieSceneSequenceHierarchyNode {
	FMovieSceneSequenceID ParentID; // 0x0
	TArray<FMovieSceneSequenceID> Children; // 0x8
};

struct FVectorCurve : FAnimCurveBase {
	FRichCurve FloatCurves[0x3]; // 0x18
};

struct FPoseData {
	TArray<FTransform> LocalSpacePose; // 0x0
	TMap<int32_t, int32_t> TrackToBufferIndex; // 0x10
	TArray<float> CurveData; // 0x60
};

struct FAIRequestID {
	uint32_t RequestID; // 0x0
};

struct FGameplayAbilitySpecDef {
	UGameplayAbility* Ability; // 0x0
	FScalableFloat LevelScalableFloat; // 0x8
	int32_t InputID; // 0x28
	EGameplayEffectGrantedAbilityRemovePolicy RemovalPolicy; // 0x2c
	UObject* SourceObject; // 0x30
	FGameplayAbilitySpecHandle AssignedHandle; // 0x88
};

struct FAIPredictionEvent {
	AActor* Requestor; // 0x0
	AActor* PredictedActor; // 0x8
};

struct FNotifyDisplayInfoRowBase : FTableRowBase {
	FNotifyDisplayInfo DisplayInfo; // 0x8
};

struct FMsgClientAppearanceData : FMessageBase {
	int32_t Result; // 0x8
	bool bInBattle; // 0xc
	bool bGuildOwner; // 0xd
	int32_t DistrictId; // 0x10
	int32_t ServerId; // 0x14
	FGuid RoleUid; // 0x18
	FGuid BattleGuid; // 0x28
	FString PlayerCharacterName; // 0x38
	FPreviewAppearanceData AppearanceData; // 0x48
	FChatServerInfo ChatAddressInfo; // 0x220
	int32_t ServerIDForLog; // 0x248
	int32_t ServerClusterID; // 0x24c
	int64_t NextCrossServerTime; // 0x250
};

struct FAnimNode_BlendListByBool : FAnimNode_BlendListBase {
	bool bActiveValue; // 0x98
};

struct FItemOptionLogInfo {
	FString PlayerName; // 0x0
	FString GuildName; // 0x10
	int32_t ItemIndex; // 0x20
	int32_t ItemNum; // 0x24
	EItemOptionType ItemOptionType; // 0x28
	FDateTime UTCTime; // 0x30
	ECapitalType FullWalletCapitalType; // 0x38
	int32_t FullWalletCapitalNum; // 0x3c
};

struct FInterpCurvePointVector {
	float InVal; // 0x0
	FVector OutVal; // 0x4
	FVector ArriveTangent; // 0x10
	FVector LeaveTangent; // 0x1c
	EInterpCurveMode InterpMode; // 0x28
};

struct FVehiclePreviewWidgetOverride {
	char bEnableOverride : 1; // 0x0
	float OverrideCameraDistance; // 0x4
	FVector OverrideMeshLocation; // 0x8
	FVector OverrideMeshLocationOffset; // 0x14
	FRotator OverrideMeshRotation; // 0x20
	FVector OverrideCameraLocationOffset; // 0x2c
	FRotator OverrideCameraRotation; // 0x38
	UAnimMontage* OverrideDefaultAnim; // 0x48
};

struct FAnimNode_ApplyLimits : FAnimNode_SkeletalControlBase {
	TArray<FAngularRangeLimit> AngularRangeLimits; // 0xc8
	TArray<FVector> AngularOffsets; // 0xd8
};

struct FNews_StructureSmart : FNewsBase {
	FVector StructureLocation; // 0x18
};

struct FGizmoVec2ParameterChange {
	FVector2D InitialValue; // 0x0
	FVector2D CurrentValue; // 0x8
};

struct FARPose3D {
	FARSkeletonDefinition SkeletonDefinition; // 0x0
	TArray<FTransform> JointTransforms; // 0x28
	TArray<bool> IsJointTracked; // 0x38
	EARJointTransformSpace JointTransformSpace; // 0x48
};

struct FGuildStructureSetting {
	int32_t GuildLevel; // 0x0
	int32_t GuildStructureMaxNum; // 0x4
};

struct FFileManifestData {
	FString Filename; // 0x0
	FSHAHashData FileHash; // 0x10
	TArray<FChunkPartData> FileChunkParts; // 0x28
	TArray<FString> InstallTags; // 0x38
	bool bIsUnixExecutable; // 0x48
	FString SymlinkTarget; // 0x50
	bool bIsReadOnly; // 0x60
	bool bIsCompressed; // 0x61
};

struct FEditPivotTarget {
	UTransformProxy* TransformProxy; // 0x0
	UTransformGizmo* TransformGizmo; // 0x8
};

struct FBlackboardKeySelector {
	TArray<UBlackboardKeyType*> AllowedTypes; // 0x0
	FName SelectedKeyName; // 0x10
	UBlackboardKeyType* SelectedKeyType; // 0x18
	char SelectedKeyID; // 0x20
	char bNoneIsAllowedValue : 1; // 0x24
};

struct FDestructibleDamageParameters {
	float DamageThreshold; // 0x0
	float DamageSpread; // 0x4
	bool bEnableImpactDamage; // 0x8
	float ImpactDamage; // 0xc
	int32_t DefaultImpactDamageDepth; // 0x10
	bool bCustomImpactResistance; // 0x14
	float ImpactResistance; // 0x18
};

struct FMeshElementAttributeData {
	FName AttributeName; // 0x0
	int32_t AttributeIndex; // 0x8
	FMeshElementAttributeValue AttributeValue; // 0x10
};

struct FBlockAnims {
	FBlockInfo LU; // 0x0
	FBlockInfo U; // 0x10
	FBlockInfo RU; // 0x20
	FBlockInfo L; // 0x30
	FBlockInfo C; // 0x40
	FBlockInfo R; // 0x50
	FBlockInfo LD; // 0x60
	FBlockInfo D; // 0x70
	FBlockInfo RD; // 0x80
};

struct FLandscapeSplineInterpPoint {
	FVector Center; // 0x0
	FVector Left; // 0xc
	FVector Right; // 0x18
	FVector FalloffLeft; // 0x24
	FVector FalloffRight; // 0x30
	FVector LayerLeft; // 0x3c
	FVector LayerRight; // 0x48
	FVector LayerFalloffLeft; // 0x54
	FVector LayerFalloffRight; // 0x60
	float StartEndFalloff; // 0x6c
};

struct FRootMotionMovementParams {
	bool bHasRootMotion; // 0x0
	float BlendWeight; // 0x4
	FTransform RootMotionTransform; // 0x10
};

struct FPerkEatItemArray {
	TArray<USGItem*> PerkEatItemTemplate; // 0x0
};

struct FWeaponTraceInfo {
	FName Socket_Start; // 0x0
	FName Socket_End; // 0x8
	FVector BoxSize; // 0x10
	FVector RiderBoxSizeMulti; // 0x1c
	char IsOverrideDamage : 1; // 0x28
	float OverrideDamage; // 0x2c
	EDamageType OverrideAttackDamageType; // 0x30
	USGDamageType* OverrideDamageType; // 0x38
};

struct FMagicLeapImageTargetState {
	EMagicLeapImageTargetStatus TrackingStatus; // 0x0
	FVector Location; // 0x4
	FRotator Rotation; // 0x10
};

struct FHelpKeyButton {
	TArray<FText> KeyText; // 0x0
	char bAddLeftMouse : 1; // 0x10
	char bAddMiddleMouse : 1; // 0x10
	char bAddRightMouse : 1; // 0x10
};

struct FBPVariableDescription {
	FName VarName; // 0x0
	FGuid VarGuid; // 0x8
	FEdGraphPinType VarType; // 0x18
	FString FriendlyName; // 0x70
	FText Category; // 0x80
	uint64_t PropertyFlags; // 0x98
	FName RepNotifyFunc; // 0xa0
	ELifetimeCondition ReplicationCondition; // 0xa8
	TArray<FBPVariableMetaDataEntry> MetaDataArray; // 0xb0
	FString DefaultValue; // 0xc0
};

struct FPatchId {
	int32_t ID; // 0x0
};

struct FSpawnLocationInfo {
	ESpawnLocationType SpawnLocationType; // 0x0
	int32_t RespawnLocationId; // 0x4
	FString RespawnLocationName; // 0x8
	FString RespawnLocationNameLocalized; // 0x18
	FVector SpawnLocation; // 0x28
	float SpawnYaw; // 0x34
	float LeftCoolDownTime; // 0x38
	float RegionRadius; // 0x3c
};

struct FGameplayTagRedirect {
	FName OldTagName; // 0x0
	FName NewTagName; // 0x8
};

struct FSkillLocalData {
	float Value; // 0x0
	int32_t AddPoints; // 0x4
	int32_t AddPointsIncrease; // 0x8
	float Config; // 0xc
	int32_t Random; // 0x10
	int32_t Add; // 0x14
	double Exp; // 0x18
	double ExpIncrease; // 0x20
	double LevelUpExp; // 0x28
	int32_t Mastery; // 0x30
};

struct FBuildPromotionTestSettings {
	FFilePath DefaultStaticMeshAsset; // 0x0
	FBuildPromotionImportWorkflowSettings ImportWorkflow; // 0x10
	FBuildPromotionOpenAssetSettings OpenAssets; // 0x160
	FBuildPromotionNewProjectSettings NewProjectSettings; // 0x1c0
	FFilePath SourceControlMaterial; // 0x1e0
};

struct FDockTabStyle : FSlateWidgetStyle {
	FButtonStyle CloseButtonStyle; // 0x8
	FSlateBrush NormalBrush; // 0x280
	FSlateBrush ActiveBrush; // 0x308
	FSlateBrush ColorOverlayTabBrush; // 0x390
	FSlateBrush ColorOverlayIconBrush; // 0x418
	FSlateBrush ForegroundBrush; // 0x4a0
	FSlateBrush HoveredBrush; // 0x528
	FSlateBrush ContentAreaBrush; // 0x5b0
	FSlateBrush TabWellBrush; // 0x638
	FMargin TabPadding; // 0x6c0
	float OverlapWidth; // 0x6d0
	FSlateColor FlashColor; // 0x6d8
};

struct FMovieSceneFloatChannel : FMovieSceneChannel {
	ERichCurveExtrapolation PreInfinityExtrap; // 0x8
	ERichCurveExtrapolation PostInfinityExtrap; // 0x9
	TArray<FFrameNumber> Times; // 0x10
	TArray<FMovieSceneFloatValue> Values; // 0x20
	float DefaultValue; // 0x30
	bool bHasDefaultValue; // 0x34
	FMovieSceneKeyHandleMap KeyHandles; // 0x38
	FFrameRate TickResolution; // 0x98
};

struct FRenderableTriangleVertex {
	FVector position; // 0x0
	FVector2D UV; // 0xc
	FVector Normal; // 0x14
	FColor Color; // 0x20
};

struct FBattleGuildRelation1D {
	EBattleGroupType BattleGroupType; // 0x0
	FGuid GuildId; // 0x4
	FString GuildName; // 0x18
	TArray<char> BattleGuildRelationInfo1D; // 0x28
};

struct FRenderingPolygonGroup {
	uint32_t RenderingSectionIndex; // 0x0
	int32_t MaterialIndex; // 0x4
	int32_t MaxTriangles; // 0x8
};

struct FAnimationTransitionBetweenStates : FAnimationStateBase {
	int32_t PreviousState; // 0x8
	int32_t NextState; // 0xc
	float CrossfadeDuration; // 0x10
	int32_t StartNotify; // 0x14
	int32_t EndNotify; // 0x18
	int32_t InterruptNotify; // 0x1c
	EAlphaBlendOption BlendMode; // 0x20
	UCurveFloat* CustomCurve; // 0x28
	UBlendProfile* BlendProfile; // 0x30
	ETransitionLogicType LogicType; // 0x38
};

struct FNiagaraVariableInfo {
	FNiagaraVariable Variable; // 0x0
	FText Definition; // 0x20
	UNiagaraDataInterface* DataInterface; // 0x38
};

struct FWaterSplineCurveDefaults {
	float DefaultDepth; // 0x0
	float DefaultWidth; // 0x4
	float DefaultVelocity; // 0x8
	float DefaultAudioIntensity; // 0xc
};

struct FNews_HorseDead : FNewsBase {
	FString HorseName; // 0x18
	AActor* HorseTemplate; // 0x28
};

struct FAnimationGroupReference {
	FName GroupName; // 0x0
	EAnimGroupRole GroupRole; // 0x8
	EAnimSyncGroupScope GroupScope; // 0x9
};

struct FMaterialCachedParameterEntry {
	TArray<uint64_t> NameHashes; // 0x0
	TArray<FMaterialParameterInfo> ParameterInfos; // 0x10
	TArray<FGuid> ExpressionGuids; // 0x20
	TArray<bool> Overrides; // 0x30
};

struct FGlobalMapLevelVisibilityConfig {
	FString LevelName; // 0x0
	EValueConditionType ConditionType; // 0x10
	float MapCameraDistance; // 0x14
};

struct FRTX_PostProcess_Settings {
	FPostProcessSettings RTXPostProcessSettings_2_F5F7708F4E83FAC705A16388FF06FB09; // 0x0
	float PostProcessWeight_5_1188286A49AC49349A20F8AA6289C4A3; // 0x560
	float RTXPostProcessPriority_11_2871BEF94A8E61F2640AA297CA1481AE; // 0x564
	bool Unbound_7_7B0858BA4548AD147D2D9083D9CB5FF7; // 0x568
};

struct FSpawnParticle {
	UParticleSystem* ParticleSystem; // 0x0
	FName SoundID; // 0x8
	FVector LocationOffset; // 0x10
	FRotator RotationOffset; // 0x1c
	FVector Scale; // 0x28
	char bAttachToHitActor : 1; // 0x34
	EProjectileParticleHitType ProjectileParticleHitType; // 0x35
	char bFollowNormalParticleForwardUpChange : 1; // 0x36
};

struct FTypeface {
	TArray<FTypefaceEntry> Fonts; // 0x0
};

struct FBakLevelStates {
	FString BakLevelMapName; // 0x0
	bool bIsLevelLoaded; // 0x10
	bool bIsLevelVisible; // 0x11
};

struct FGuildEventModifyConflictEntry {
	EGuildEventModifyType GuildEventModifyType; // 0x0
	float ModifyConflictValue; // 0x4
	FText Title; // 0x8
	FText Text; // 0x20
	FText TooTipText; // 0x38
	TSoftObjectPtr<UTexture2D> Texture; // 0x50
	int32_t BGMIndex; // 0x78
	FName SoundID; // 0x7c
};

struct FARGeoAnchorUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	float Longitude; // 0x50
	float Latitude; // 0x54
	float AltitudeMeters; // 0x58
	EARAltitudeSource AltitudeSource; // 0x5c
	FString AnchorName; // 0x60
};

struct FNiagaraSystemUpdateContext {
	TArray<UNiagaraComponent*> ComponentsToReset; // 0x0
	TArray<UNiagaraComponent*> ComponentsToReInit; // 0x10
	TArray<UNiagaraComponent*> ComponentsToNotifySimDestroy; // 0x20
	TArray<UNiagaraSystem*> SystemSimsToDestroy; // 0x30
};

struct FIntVector {
	int32_t X; // 0x0
	int32_t Y; // 0x4
	int32_t Z; // 0x8
};

struct FEditableTextBoxStyle : FSlateWidgetStyle {
	FSlateBrush BackgroundImageNormal; // 0x8
	FSlateBrush BackgroundImageHovered; // 0x90
	FSlateBrush BackgroundImageFocused; // 0x118
	FSlateBrush BackgroundImageReadOnly; // 0x1a0
	FMargin Padding; // 0x228
	FSlateFontInfo Font; // 0x238
	FSlateColor ForegroundColor; // 0x290
	FSlateColor BackgroundColor; // 0x2b8
	FSlateColor ReadOnlyForegroundColor; // 0x2e0
	FMargin HScrollBarPadding; // 0x308
	FMargin VScrollBarPadding; // 0x318
	FScrollBarStyle ScrollBarStyle; // 0x328
};

struct FMovieSceneTrackEvaluationField {
	TArray<FMovieSceneTrackEvaluationFieldEntry> Entries; // 0x0
};

struct FDeathExploitConifg {
	int32_t MinLevel; // 0x0
	int32_t MaxLevel; // 0x4
	USGExploitComponent* DeathExploitComponentTemplate; // 0x8
};

struct FCustomCalculationBasedFloat {
	UGameplayModMagnitudeCalculation* CalculationClassMagnitude; // 0x0
	FScalableFloat Coefficient; // 0x8
	FScalableFloat PreMultiplyAdditiveValue; // 0x28
	FScalableFloat PostMultiplyAdditiveValue; // 0x48
	FCurveTableRowHandle FinalLookupCurve; // 0x68
};

struct FSGSoundLevelVolumeData {
	float FadeInVolume; // 0x0
	float FadeInDuration; // 0x4
	float FadeOutVolume; // 0x8
	float FadeOutDuration; // 0xc
	float VolumeMultiplier; // 0x10
	ESGSoundLevelVolumeState State; // 0x14
};

struct FHitResult {
	char bBlockingHit : 1; // 0x0
	char bStartPenetrating : 1; // 0x0
	int32_t FaceIndex; // 0x4
	float Time; // 0x8
	float Distance; // 0xc
	FVector_NetQuantize Location; // 0x10
	FVector_NetQuantize ImpactPoint; // 0x1c
	FVector_NetQuantizeNormal Normal; // 0x28
	FVector_NetQuantizeNormal ImpactNormal; // 0x34
	FVector_NetQuantize TraceStart; // 0x40
	FVector_NetQuantize TraceEnd; // 0x4c
	float PenetrationDepth; // 0x58
	int32_t Item; // 0x5c
	char ElementIndex; // 0x60
	TWeakObjectPtr<UPhysicalMaterial> PhysMaterial; // 0x64
	TWeakObjectPtr<AActor> Actor; // 0x6c
	TWeakObjectPtr<UPrimitiveComponent> Component; // 0x74
	FName BoneName; // 0x7c
	FName MyBoneName; // 0x84
};

struct FInputChord {
	FKey Key; // 0x0
	char bShift : 1; // 0x18
	char bCtrl : 1; // 0x18
	char bAlt : 1; // 0x18
	char bCmd : 1; // 0x18
};

struct FAnimNode_BoneDrivenController : FAnimNode_SkeletalControlBase {
	FBoneReference SourceBone; // 0xc8
	UCurveFloat* DrivingCurve; // 0xd8
	float Multiplier; // 0xe0
	float RangeMin; // 0xe4
	float RangeMax; // 0xe8
	float RemappedMin; // 0xec
	float RemappedMax; // 0xf0
	FName ParameterName; // 0xf4
	FBoneReference TargetBone; // 0xfc
	EDrivenDestinationMode DestinationMode; // 0x10c
	EDrivenBoneModificationMode ModificationMode; // 0x10d
	EComponentType SourceComponent; // 0x10e
	char bUseRange : 1; // 0x10f
	char bAffectTargetTranslationX : 1; // 0x10f
	char bAffectTargetTranslationY : 1; // 0x10f
	char bAffectTargetTranslationZ : 1; // 0x10f
	char bAffectTargetRotationX : 1; // 0x10f
	char bAffectTargetRotationY : 1; // 0x10f
	char bAffectTargetRotationZ : 1; // 0x10f
	char bAffectTargetScaleX : 1; // 0x10f
	char bAffectTargetScaleY : 1; // 0x110
	char bAffectTargetScaleZ : 1; // 0x110
};

struct FAnimNode_CopyBone : FAnimNode_SkeletalControlBase {
	FBoneReference SourceBone; // 0xc8
	FBoneReference TargetBone; // 0xd8
	bool bCopyTranslation; // 0xe8
	bool bCopyRotation; // 0xe9
	bool bCopyScale; // 0xea
	EBoneControlSpace ControlSpace; // 0xeb
};

struct FAudioVolumeSubmixOverrideSettings {
	USoundSubmix* Submix; // 0x0
	TArray<USoundEffectSubmixPreset*> SubmixEffectChain; // 0x8
	float CrossfadeTime; // 0x18
};

struct FNiagaraDataSetProperties {
	FNiagaraDataSetID ID; // 0x0
	TArray<FNiagaraVariable> Variables; // 0x10
};

struct FNiagaraVMExecutableData {
	TArray<char> ByteCode; // 0x0
	TArray<char> OptimizedByteCode; // 0x10
	int32_t NumTempRegisters; // 0x20
	int32_t NumUserPtrs; // 0x24
	TArray<char> ScriptLiterals; // 0x28
	TArray<FNiagaraVariable> Attributes; // 0x38
	FNiagaraScriptDataUsageInfo DataUsage; // 0x48
	TArray<FNiagaraScriptDataInterfaceCompileInfo> DataInterfaceInfo; // 0x50
	TArray<FVMExternalFunctionBindingInfo> CalledVMExternalFunctions; // 0x60
	TArray<FNiagaraDataSetID> ReadDataSets; // 0x80
	TArray<FNiagaraDataSetProperties> WriteDataSets; // 0x90
	TArray<FNiagaraStatScope> StatScopes; // 0xa0
	TArray<FNiagaraDataInterfaceGPUParamInfo> DIParamInfo; // 0xb0
	ENiagaraScriptCompileStatus LastCompileStatus; // 0xc0
	TArray<FSimulationStageMetaData> SimulationStageMetaData; // 0xc8
	char bReadsSignificanceIndex : 1; // 0xd8
};

struct FChaosCollisionEventData {
	FVector Location; // 0x0
	FVector Normal; // 0xc
	FVector Velocity1; // 0x18
	FVector Velocity2; // 0x24
	float Mass1; // 0x30
	float Mass2; // 0x34
	FVector Impulse; // 0x38
};

struct FARTraceResult {
	float DistanceFromCamera; // 0x0
	EARLineTraceChannels TraceChannel; // 0x4
	FTransform LocalTransform; // 0x10
	UARTrackedGeometry* TrackedGeometry; // 0x40
};

struct FPerPlatformFloat {
	float Default; // 0x0
};

struct FAINoiseEvent {
	FVector NoiseLocation; // 0x4
	float Loudness; // 0x10
	float MaxRange; // 0x14
	AActor* Instigator; // 0x18
	FName Tag; // 0x20
};

struct FAttachVolumeCylinder {
	FVector Axis; // 0x0
	float Height; // 0xc
	float Radius; // 0x10
};

struct FVectorRK4SpringInterpolator {
	float StiffnessConstant; // 0x0
	float DampeningRatio; // 0x4
};

struct FMagicLeapLightEstimationAmbientGlobalState {
	TArray<float> AmbientIntensityNits; // 0x0
	FTimespan Timestamp; // 0x10
};

struct FBodyPartBox {
	FName BoneName; // 0x0
	FTransform LocalTransform; // 0x10
	FVector BoxExtent; // 0x40
};

struct FPhysicalAnimationProfile {
	FName ProfileName; // 0x0
	FPhysicalAnimationData PhysicalAnimationData; // 0x8
};

struct FNavCollisionBox {
	FVector Offset; // 0x0
	FVector Extent; // 0xc
};

struct FBoxSphereBounds {
	FVector Origin; // 0x0
	FVector BoxExtent; // 0xc
	float SphereRadius; // 0x18
};

struct FMovieScenePropertySectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x20
};

struct FBuoyancyData {
	TArray<FSphericalPontoon> Pontoons; // 0x0
	float BuoyancyCoefficient; // 0x10
	float BuoyancyDamp; // 0x14
	float BuoyancyDamp2; // 0x18
	float BuoyancyRampMinVelocity; // 0x1c
	float BuoyancyRampMaxVelocity; // 0x20
	float BuoyancyRampMax; // 0x24
	float MaxBuoyantForce; // 0x28
	float WaterShorePushFactor; // 0x2c
	float WaterVelocityStrength; // 0x30
	float MaxWaterForce; // 0x34
	float DragCoefficient; // 0x38
	float DragCoefficient2; // 0x3c
	float AngularDragCoefficient; // 0x40
	float MaxDragSpeed; // 0x44
	bool bApplyDragForcesInWater; // 0x48
};

struct FNiagaraMaterialOverride {
	UMaterialInterface* Material; // 0x0
	uint32_t MaterialSubIndex; // 0x8
	UNiagaraRendererProperties* EmitterRendererProperty; // 0x10
};

struct FAnimBoneData {
	int32_t BoneIndex; // 0x0
	FName BoneName; // 0x4
	TArray<FTransform> BoneTransform; // 0x10
};

struct FSoundModulationDefaultRoutingSettings : FSoundModulationDefaultSettings {
	EModulationRouting VolumeRouting; // 0x40
	EModulationRouting PitchRouting; // 0x41
	EModulationRouting HighpassRouting; // 0x42
	EModulationRouting LowpassRouting; // 0x43
};

struct FMovieSceneVector4KeyStruct : FMovieSceneVectorKeyStructBase {
	FVector4 Vector; // 0x30
};

struct FRestrictedGameplayTagTableRow : FGameplayTagTableRow {
	bool bAllowNonRestrictedChildren; // 0x20
};

struct FVectorParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel XCurve; // 0x8
	FMovieSceneFloatChannel YCurve; // 0xa8
	FMovieSceneFloatChannel ZCurve; // 0x148
};

struct FAttributeDefaults {
	UAttributeSet* Attributes; // 0x0
	UDataTable* DefaultStartingTable; // 0x8
};

struct FHairGroupInfo {
	int32_t GroupID; // 0x0
	int32_t NumCurves; // 0x4
	int32_t NumGuides; // 0x8
	int32_t NumCurveVertices; // 0xc
	int32_t NumGuideVertices; // 0x10
};

struct FStructureMiniMapPOIStyle : FTableRowBase {
	TSoftObjectPtr<UTexture2D> InMiniMapTexture; // 0x8
	FLinearColor InMiniMapColor; // 0x30
	char bShowOutOfMiniMap : 1; // 0x40
	TSoftObjectPtr<UTexture2D> OutOfMiniMapTexture; // 0x48
	FLinearColor OutOfMiniMapColor; // 0x70
};

struct FCharacterMovingSpeedConfig {
	TMap<EInputDirection, float> Stand_WalkSpeed; // 0x0
	TMap<EInputDirection, float> Stand_JogSpeed; // 0x50
	TMap<EInputDirection, float> Stand_RunSpeed; // 0xa0
	TMap<EInputDirection, float> Crouch_WalkSpeed; // 0xf0
	TMap<EInputDirection, float> Crouch_JogSpeed; // 0x140
	TMap<EInputDirection, float> Crouch_RunSpeed; // 0x190
	TMap<EInputDirection, float> Swim_WalkSpeed; // 0x1e0
	TMap<EInputDirection, float> Swim_JogSpeed; // 0x230
	TMap<EInputDirection, float> Swim_RunSpeed; // 0x280
};

struct FMapConfig : FTableRowBase {
	FText MapName; // 0x8
};

struct FWaveConfigData {
	EWaveShape WaveShape; // 0x0
	FName SocketName; // 0x4
	float WaveStrength; // 0xc
	float WaveSizePercent; // 0x10
	FVector2D WaveExtent; // 0x14
};

struct FCharacterJumpZConfig {
	float UnarmJumpZ; // 0x0
	float MainHandWeaponJumpZ; // 0x4
};

struct FCapsuleLimitData : FCollisionLimitDataBase {
	float Radius; // 0x50
	float Length; // 0x54
};

struct FAnimalFarmDropConifg {
	int32_t MinLevel; // 0x0
	int32_t MaxLevel; // 0x4
	int32_t DropWrapperId; // 0x8
	int32_t DeathDropWrapperId; // 0xc
};

struct FLayerBlendInput {
	FName LayerName; // 0x0
	ELandscapeLayerBlendType BlendType; // 0x8
	FExpressionInput LayerInput; // 0xc
	FExpressionInput HeightInput; // 0x20
	float PreviewWeight; // 0x34
	FVector ConstLayerInput; // 0x38
	float ConstHeightInput; // 0x44
};

struct FCachedPropertyPath {
	TArray<FPropertyPathSegment> Segments; // 0x0
	UFunction* CachedFunction; // 0x18
};

struct FGmExecuteMsg {
	EGmMsgType MsgType; // 0x0
	FGuid GuildId; // 0x4
	bool IsExecuting; // 0x14
};

struct FInterpCurveVector2D {
	TArray<FInterpCurvePointVector2D> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FTransformBaseConstraint {
	TArray<FRigTransformConstraint> TransformConstraints; // 0x0
};

struct FPoseDriverTarget {
	TArray<FPoseDriverTransform> BoneTransforms; // 0x0
	FRotator TargetRotation; // 0x10
	float TargetScale; // 0x1c
	ERBFDistanceMethod DistanceMethod; // 0x20
	ERBFFunctionType FunctionType; // 0x21
	bool bApplyCustomCurve; // 0x22
	FRichCurve CustomCurve; // 0x28
	FName DrivenName; // 0xa8
	bool bIsHidden; // 0xb8
};

struct FSGRadialDamageEvent : FDamageEvent {
	FRadialDamageParams Params; // 0x10
	FVector Origin; // 0x24
	TArray<FHitResult> ComponentHits; // 0x30
	EDamageType Enum_DamageType; // 0x40
	float CollectionDamage; // 0x44
	float CollectionDamageMin; // 0x48
};

struct FAnimNode_BlendSpacePlayer : FAnimNode_AssetPlayerBase {
	float X; // 0x38
	float Y; // 0x3c
	float Z; // 0x40
	float PlayRate; // 0x44
	bool bLoop; // 0x48
	bool bResetPlayTimeWhenBlendSpaceChanges; // 0x49
	float StartPosition; // 0x4c
	UBlendSpaceBase* BlendSpace; // 0x50
	UBlendSpaceBase* PreviousBlendSpace; // 0xe0
};

struct FXRGestureConfig {
	bool bTap; // 0x0
	bool bHold; // 0x1
	ESpatialInputGestureAxis AxisGesture; // 0x2
	bool bNavigationAxisX; // 0x3
	bool bNavigationAxisY; // 0x4
	bool bNavigationAxisZ; // 0x5
};

struct FSpriteInstanceData {
	FMatrix Transform; // 0x0
	UPaperSprite* SourceSprite; // 0x40
	FColor VertexColor; // 0x48
	int32_t MaterialIndex; // 0x4c
};

struct FCurveTableRowHandle {
	UCurveTable* CurveTable; // 0x0
	FName RowName; // 0x8
};

struct FOrientedBox {
	FVector Center; // 0x0
	FVector AxisX; // 0xc
	FVector AxisY; // 0x18
	FVector AxisZ; // 0x24
	float ExtentX; // 0x30
	float ExtentY; // 0x34
	float ExtentZ; // 0x38
};

struct FAnimNotifyEvent : FAnimLinkableElement {
	float DisplayTime; // 0x30
	float TriggerTimeOffset; // 0x34
	float EndTriggerTimeOffset; // 0x38
	float TriggerWeightThreshold; // 0x3c
	FName NotifyName; // 0x40
	UAnimNotify* Notify; // 0x48
	UAnimNotifyState* NotifyStateClass; // 0x50
	float Duration; // 0x58
	FAnimLinkableElement EndLink; // 0x60
	bool bConvertedFromBranchingPoint; // 0x90
	EMontageNotifyTickType MontageTickType; // 0x91
	float NotifyTriggerChance; // 0x94
	ENotifyFilterType NotifyFilterType; // 0x98
	int32_t NotifyFilterLOD; // 0x9c
	bool bTriggerOnDedicatedServer; // 0xa0
	bool bTriggerOnFollower; // 0xa1
	int32_t TrackIndex; // 0xa4
};

struct FGuildStructureNum {
	int32_t GuildStructureUniqueId; // 0x0
	int32_t GuildStructureNum; // 0x4
	FDateTime CreateTime; // 0x8
};

struct FNiagaraScriptExecutionParameterStore : FNiagaraParameterStore {
	int32_t ParameterSize; // 0x78
	uint32_t PaddedParameterSize; // 0x7c
	TArray<FNiagaraScriptExecutionPaddingInfo> PaddingInfo; // 0x80
	char bInitialized : 1; // 0x90
};

struct FPerkEntries {
	TArray<USGPerk*> PerkEntries; // 0x0
};

struct FPackedRGBA16N {
	int32_t XY; // 0x0
	int32_t ZW; // 0x4
};

struct FCurrentOreInfoData {
	ENaturalResType OreType; // 0x0
	float CurrentOreDensityValue; // 0x4
};

struct FChaosHandlerSet {
	TSet<UObject*> ChaosHandlers; // 0x8
};

struct FXianchengSignInfo {
	FInnerBattleInfo BattleInfo; // 0x0
	int64_t LeftSignTimeTicks; // 0x48
};

struct FDeathAnims {
	TArray<UAnimMontage*> DeathForward; // 0x0
	TArray<UAnimMontage*> DeathBackward; // 0x10
	TArray<UAnimMontage*> DeathLeft; // 0x20
	TArray<UAnimMontage*> DeathRight; // 0x30
};

struct FNews_AuctionShop : FNewsBase {
	FString State; // 0x18
};

struct FMagicLeapTrackingMeshInfo {
	FTimespan Timestamp; // 0x0
	TArray<FMagicLeapMeshBlockInfo> BlockData; // 0x8
};

struct FARSharedWorldReplicationState {
	int32_t PreviewImageOffset; // 0x0
	int32_t ARWorldOffset; // 0x4
};

struct FSubmixEffectConvolutionReverbSettings {
	float NormalizationVolumeDb; // 0x0
	bool bBypass; // 0x4
	bool bMixInputChannelFormatToImpulseResponseFormat; // 0x5
	bool bMixReverbOutputToOutputChannelFormat; // 0x6
	float SurroundRearChannelBleedDb; // 0x8
	bool bInvertRearChannelBleedPhase; // 0xc
	bool bSurroundRearChannelFlip; // 0xd
	float SurroundRearChannelBleedAmount; // 0x10
	UAudioImpulseResponse* ImpulseResponse; // 0x18
	bool AllowHArdwareAcceleration; // 0x20
};

struct FHuangLiEffectNameDetail : FTableRowBase {
	EHuangLiEffectName EffectNameType; // 0x8
	FText EffectName; // 0x10
	FText EffectDesc; // 0x28
};

struct FRigConfiguration {
	URig* Rig; // 0x0
	TArray<FNameMapping> BoneMappingTable; // 0x8
};

struct FMovieSceneNestedSequenceTransform {
	FMovieSceneTimeTransform LinearTransform; // 0x0
	FMovieSceneTimeWarping Warping; // 0xc
};

struct FGuildStructureInfoData {
	TArray<FStructureBannerLocData> BannerDatas; // 0x0
	TArray<FOccupyStructureRPC> SeachStructureDatas; // 0x10
};

struct FAlphaBlend {
	UCurveFloat* CustomCurve; // 0x0
	float BlendTime; // 0x8
	EAlphaBlendOption BlendOption; // 0x24
};

struct FMagicLeapRaycastHitResult {
	EMagicLeapRaycastResultState HitState; // 0x0
	FVector HitPoint; // 0x4
	FVector Normal; // 0x10
	float Confidence; // 0x1c
	int32_t UserData; // 0x20
};

struct FMeshReductionSettings {
	float PercentTriangles; // 0x0
	float PercentVertices; // 0x4
	float MaxDeviation; // 0x8
	float PixelError; // 0xc
	float WeldingThreshold; // 0x10
	float HardAngleThreshold; // 0x14
	int32_t BaseLODModel; // 0x18
	EMeshFeatureImportance SilhouetteImportance; // 0x1c
	EMeshFeatureImportance TextureImportance; // 0x1d
	EMeshFeatureImportance ShadingImportance; // 0x1e
	char bRecalculateNormals : 1; // 0x1f
	char bGenerateUniqueLightmapUVs : 1; // 0x1f
	char bKeepSymmetry : 1; // 0x1f
	char bVisibilityAided : 1; // 0x1f
	char bCullOccluded : 1; // 0x1f
	EStaticMeshReductionTerimationCriterion TerminationCriterion; // 0x20
	EMeshFeatureImportance VisibilityAggressiveness; // 0x21
	EMeshFeatureImportance VertexColorImportance; // 0x22
};

struct FParticleReplayTrackKey {
	float Time; // 0x0
	float Duration; // 0x4
	int32_t ClipIDNumber; // 0x8
};

struct FHairGroupsInterpolation {
	FHairDecimationSettings DecimationSettings; // 0x0
	FHairInterpolationSettings InterpolationSettings; // 0x8
};

struct FSEInstance {
	int32_t InstanceIndex; // 0x0
	TWeakObjectPtr<AActor> SEActor; // 0x4
};

struct FWorldPSCPool {
	TMap<UParticleSystem*, FPSCPool> WorldParticleSystemPools; // 0x0
};

struct FCompositeFallbackFont {
	FTypeface Typeface; // 0x0
	float ScalingFactor; // 0x10
};

struct FSourceEffectEnvelopeFollowerSettings {
	float AttackTime; // 0x0
	float ReleaseTime; // 0x4
	EEnvelopeFollowerPeakMode PeakMode; // 0x8
	bool bIsAnalogMode; // 0x9
};

struct FMovieSceneObjectBindingID {
	int32_t SequenceID; // 0x0
	EMovieSceneObjectBindingSpace Space; // 0x4
	FGuid Guid; // 0x8
};

struct FMsgRecord_StructureBannerEffectOther : FMsgRecordBase {
	FString OtherGuildName; // 0x10
	int32_t EffectPrestigeValue; // 0x20
};

struct FVertexAttributesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FMeshElementAttributeList> PerimeterVertexAttributeLists; // 0x8
	TArray<FVertexAttributesForPolygonHole> VertexAttributeListsForEachHole; // 0x18
};

struct FGameplayTagReponsePair {
	FGameplayTag Tag; // 0x0
	UGameplayEffect* ResponseGameplayEffect; // 0x8
	TArray<UGameplayEffect*> ResponseGameplayEffects; // 0x10
	int32_t SoftCountCap; // 0x20
};

struct FSphericalLimit : FCollisionLimitBase {
	float Radius; // 0x50
	ESphericalLimitType LimitType; // 0x54
};

struct FMsgRecordData {
	FDateTime RecordTime; // 0x0
	FString RecordContent; // 0x8
};

struct FNews_OccupyProtectSetting : FNewsBase {
	int32_t OccupyServerKey; // 0x18
};

struct FGeneralPeaceTameItem {
	int32_t ItemIndex; // 0x0
	int32_t ItemAmount; // 0x4
	float TotalAddTame; // 0x8
};

struct FXingXiuEffect : FTableRowBase {
	EXingXiuType XingXiuType; // 0x8
	FText XingXiuName; // 0x10
	FText XingXiuDesc; // 0x28
	TArray<FHuangLiEffect> HuangLiEffects; // 0x40
};

struct FAchievementDamageMultiplyData : FTableRowBase {
	TSoftObjectPtr<UTexture2D> IconTexture; // 0x8
	FText DamageMultiplyName; // 0x30
};

struct FAnimPhysSphericalLimit {
	FBoneReference DrivingBone; // 0x0
	FVector SphereLocalOffset; // 0x10
	float LimitRadius; // 0x1c
	ESphericalLimitType LimitType; // 0x20
};

struct FInterpCurveVector {
	TArray<FInterpCurvePointVector> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FIntPoint {
	int32_t X; // 0x0
	int32_t Y; // 0x4
};

struct FLevelSequenceBindingReferenceArray {
	TArray<FLevelSequenceBindingReference> References; // 0x0
};

struct FQuat {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
	float W; // 0xc
};

struct FCaptureResolution {
	int32_t ResX; // 0x0
	int32_t ResY; // 0x4
};

struct FAnimalDebugInfo {
	char bIsDrawDebugInfos : 1; // 0x0
	TWeakObjectPtr<ASG_AnimalsCharacter> AnimalCharacter; // 0x4
	FString LastBTTaskDebugName; // 0x10
	FString BTTaskDebugName; // 0x20
	FString BTTaskDebugInfos; // 0x30
	float LastUpdateTaskDebugInfoTime; // 0x40
	FString AIStatusDebugInfos; // 0x48
	FString AnimationDebugInfos; // 0x58
	FString GaitDebugInfos; // 0x68
	float LastUpdateDebugInfoTime; // 0x78
};

struct FMsgRecord_LeaveServer : FMsgRecordBase {
	FString CharacterName; // 0x10
};

struct FAIFleeConfigAnimal : FAIFleeConfigBase {
	float FleeMaxYaw; // 0x20
	float FleeWaitEnemyInterval; // 0x24
	float FleeWaitEnemyChance; // 0x28
	float FleeLimitFixedTime; // 0x2c
};

struct FMoveSeatAnimalPullerInfo {
	ABaseCharacter* PullerClass; // 0x0
	float BaseDisFromPuller; // 0x8
	float LinkedMoveAdjustDiffDist; // 0xc
	float LinkedMoveAdjustDiffDistSelf; // 0x10
	float LinkedSwimAdjustDiffDistSelf; // 0x14
	float WeightMultiplyForPuller; // 0x18
	float MaxWeightMultiplyForPuller; // 0x1c
	float RotationSpeedMultiply[0x8]; // 0x20
	float RotationInterpSpeedMultiply[0x8]; // 0x40
	float RotationLimitYawAngle; // 0x60
	float SpeedMulAdd; // 0x64
	float SwimSpeedMulAdd; // 0x68
};

struct FXianLingHuKouAwardInfo {
	FDateTime BeginDate; // 0x0
	FDateTime EndDate; // 0x8
	bool IsGained; // 0x10
};

struct FMovieSceneEvaluationFieldTrackPtr {
	FMovieSceneSequenceID SequenceID; // 0x0
	FMovieSceneTrackIdentifier TrackIdentifier; // 0x4
};

struct FGeneralShooterConfig {
	char bUseForceBodyBone : 1; // 0x0
	EBodyBone Enum_ForceBodyBone; // 0x1
	FVector2D RandomLookingBoneTime; // 0x4
	float KnockbackDistance; // 0xc
	float KnockbackCoolingTime; // 0x10
	float AttackPercentage; // 0x14
	FVector2D AttackHoldTimeRange; // 0x1c
	float AttackUpDistance; // 0x24
	float AttackKnockBackDistanceMultiForLying; // 0x28
	float MinArcDistance; // 0x2c
	float ScatteringPercentage; // 0x30
	float KeepInPlaceDistanceTolerance; // 0x34
	float EquipMeleeWeaponDistance; // 0x38
	FVector2D EquipMeleeWeaponCoolingTime; // 0x3c
};

struct FMovieSceneObjectPathChannelKeyValue {
	TSoftObjectPtr<UObject> SoftPtr; // 0x0
	UObject* HardPtr; // 0x28
};

struct FEarsData {
	float EarAngle; // 0x0
	float EarAngleTop; // 0x4
	float EarContour; // 0x8
	float EarDepth; // 0xc
	float EarHeight; // 0x10
	float EarlobeDefine; // 0x14
	float EarScale; // 0x18
	float EarScaleHeight; // 0x1c
};

struct FPerBoneBlendWeight {
	int32_t SourceIndex; // 0x0
	float BlendWeight; // 0x4
};

struct FMovieScene3DTransformKeyStruct : FMovieSceneKeyStruct {
	FVector Location; // 0x8
	FRotator Rotation; // 0x14
	FVector Scale; // 0x20
	FFrameNumber Time; // 0x2c
};

struct FNotifyDisplayInfo {
	EMsgType PosType; // 0x0
	ENotifyTextColor ColorType; // 0x1
	float DisplayTime; // 0x4
	float DisplayScale; // 0x8
};

struct FPointData {
	TArray<UAnimMontage*> RelaxedMontages; // 0x0
	TArray<FBehaviorPointTimeWeight> TimeWeight; // 0x10
	FTransform Transform; // 0x20
	FString DisplayString; // 0x50
	FColor DisplayColor; // 0x60
	int32_t HasNPCIndex; // 0x64
	ANpcSpawnVolume* BindSpawnVolume; // 0x68
};

struct FStopAnims {
	UBlendSpace* Stop; // 0x0
};

struct FMovieSceneTimecodeSource {
	FTimecode Timecode; // 0x0
	FFrameNumber DeltaFrame; // 0x14
};

struct FTTVectorTrack : FTTPropertyTrack {
	UCurveVector* CurveVector; // 0x20
};

struct FCameraShakeDuration {
	float Duration; // 0x0
	ECameraShakeDurationType Type; // 0x4
};

struct FMaterialRemapIndex {
	uint32_t ImportVersionKey; // 0x0
	TArray<int32_t> MaterialRemap; // 0x8
};

struct FHairGroupsPhysics {
	FHairSolverSettings SolverSettings; // 0x0
	FHairExternalForces ExternalForces; // 0x38
	FHairMaterialConstraints MaterialConstraints; // 0x58
	FHairStrandsParameters StrandsParameters; // 0x230
};

struct FNiagaraParameterDataSetBinding {
	int32_t ParameterOffset; // 0x0
	int32_t DataSetComponentOffset; // 0x4
};

struct FLiveLinkSourceBufferManagementSettings {
	bool bValidEngineTimeEnabled; // 0x0
	float ValidEngineTime; // 0x4
	float EngineTimeOffset; // 0x8
	double EngineTimeClockOffset; // 0x10
	bool bGenerateSubFrame; // 0x18
	FFrameRate DetectedFrameRate; // 0x1c
	bool bUseTimecodeSmoothLatest; // 0x24
	FFrameRate SourceTimecodeFrameRate; // 0x28
	bool bValidTimecodeFrameEnabled; // 0x30
	int32_t ValidTimecodeFrame; // 0x34
	float TimecodeFrameOffset; // 0x38
	double TimecodeClockOffset; // 0x40
	int32_t LatestOffset; // 0x48
	int32_t MaxNumberOfFrameToBuffered; // 0x4c
	bool bKeepAtLeastOneFrame; // 0x50
};

struct FPlayerMuteList {
	bool bHasVoiceHandshakeCompleted; // 0x30
	int32_t VoiceChannelIdx; // 0x34
};

struct FMagicLeapHeadTrackingState {
	EMagicLeapHeadTrackingMode Mode; // 0x0
	EMagicLeapHeadTrackingError Error; // 0x1
	float Confidence; // 0x4
};

struct FNiagaraRandInfo {
	int32_t Seed1; // 0x0
	int32_t Seed2; // 0x4
	int32_t Seed3; // 0x8
};

struct FWithFoliageInfo {
	UFoliageType* FoliageWith; // 0x0
	float Probability; // 0x8
	FName SkoctToPlace; // 0xc
	FVector PlaceOffset; // 0x14
};

struct FExternalToolDefinition {
	FString ToolName; // 0x0
	FFilePath ExecutablePath; // 0x10
	FString CommandLineOptions; // 0x20
	FDirectoryPath WorkingDirectory; // 0x30
	FString ScriptExtension; // 0x40
	FDirectoryPath ScriptDirectory; // 0x50
};

struct FMovieSceneRootEvaluationTemplateInstance {
	TWeakObjectPtr<UMovieSceneSequence> WeakRootSequence; // 0x0
	UMovieSceneCompiledDataManager* CompiledDataManager; // 0x8
	UMovieSceneEntitySystemLinker* EntitySystemLinker; // 0x18
	TMap<FMovieSceneSequenceID, UObject*> DirectorInstances; // 0x90
};

struct FAnimalRealNameData : FTableRowBase {
	EAnimalQualityType QualityType; // 0x8
	TMap<EAttributeCorrectionType, int32_t> AttributeCorrectionCount; // 0x10
	EAnimalFurColorType FurColorType; // 0x60
	FText FurColorString; // 0x68
	int32_t WildLevel; // 0x80
	int32_t TameLevel; // 0x84
	FText PreString; // 0x88
	float ThinMorph; // 0xa0
	float StrongMorph; // 0xa4
};

struct FAnimNode_RandomPlayer : FAnimNode_Base {
	TArray<FRandomPlayerSequenceEntry> Entries; // 0x10
	bool bShuffleMode; // 0x70
};

struct FTimelineEventEntry {
	float Time; // 0x0
	FDelegate EventFunc; // 0x4
};

struct FChaosTrailingEventData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	FVector AngularVelocity; // 0x18
	float Mass; // 0x24
	int32_t ParticleIndex; // 0x28
};

struct FFishBaitRowBase : FTableRowBase {
	USGItem* FishBait; // 0x8
	TArray<FFishBaitData> FishBaitData; // 0x10
};

struct FClothPhysicsProperties_Legacy {
	float VerticalResistance; // 0x0
	float HorizontalResistance; // 0x4
	float BendResistance; // 0x8
	float ShearResistance; // 0xc
	float Friction; // 0x10
	float Damping; // 0x14
	float TetherStiffness; // 0x18
	float TetherLimit; // 0x1c
	float Drag; // 0x20
	float StiffnessFrequency; // 0x24
	float GravityScale; // 0x28
	float MassScale; // 0x2c
	float InertiaBlend; // 0x30
	float SelfCollisionThickness; // 0x34
	float SelfCollisionSquashScale; // 0x38
	float SelfCollisionStiffness; // 0x3c
	float SolverFrequency; // 0x40
	float FiberCompression; // 0x44
	float FiberExpansion; // 0x48
	float FiberResistance; // 0x4c
};

struct FAnimNotifyQueue {
	TArray<FAnimNotifyEventReference> AnimNotifies; // 0x10
	TMap<FName, FAnimNotifyArray> UnfilteredMontageAnimNotifies; // 0x20
};

struct FSGAnimNode_SpineSolver : FAnimNode_Base {
	FAnimNodeData_MultiInput AnimNode_InputData; // 0x10
	float Precision; // 0x80
	float MaximumPitch; // 0x84
	float MinimumPitch; // 0x88
	float MaximumRoll; // 0x8c
	float MinimumRoll; // 0x90
	int32_t MaxIterations; // 0x94
	FComponentSpacePoseLink ComponentPose; // 0x98
	float ActualAlpha; // 0xac
	EAnimAlphaInputType AlphaInputType; // 0xb0
	bool bAlphaBoolEnabled; // 0xb1
	float Alpha; // 0xb4
	FInputScaleBias AlphaScaleBias; // 0xb8
	FInputAlphaBoolBlend AlphaBoolBlend; // 0xc0
	FName AlphaCurveName; // 0x108
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x110
	float ShiftSpeed; // 0x140
	ETraceTypeQuery TraceChannel; // 0x144
	EIKTraceType TraceType; // 0x145
	float TraceRadius; // 0x148
	int32_t LODThreshold; // 0x14c
	float DipMultiplier; // 0x150
	bool RotateAroundTranslate; // 0x154
	bool IgnoreLerping; // 0x155
	float LineTraceDownwardHeight; // 0x168
	float line_trace_upper_height; // 0x16c
	float Slanted_Height_Up_Offset; // 0x170
	float Slanted_Height_Down_Offset; // 0x178
	bool reverse_fabrik; // 0x17c
	bool Calculation_To_RefPose; // 0x184
	float Chest_Slanted_Height_Up_Offset; // 0x188
	float Chest_Slanted_Height_Down_Offset; // 0x18c
	float Chest_Base_Offset; // 0x190
	float Pelvis_Base_Offset; // 0x194
	float virtual_leg_width; // 0x198
	float Maximum_Dip_Height; // 0x19c
	float Maximum_Dip_Height_Chest; // 0x1a0
	float rotation_power_between; // 0x1b0
	bool Use_Automatic_Fabrik_Selection; // 0x1b4
	float Location_Lerp_Speed; // 0x1b8
	float Rotation_Lerp_Speed; // 0x1bc
	float Chest_Influence_Alpha; // 0x1c0
	float Pelvis_ForwardRotation_Intensity; // 0x1c4
	float Body_Rotation_Intensity; // 0x1c8
	float Chest_ForwardRotation_Intensity; // 0x1cc
	float Chest_SidewardRotation_Intensity; // 0x1d0
	bool Enable_Solver; // 0x210
	bool Use_Fake_Chest_Rotations; // 0x211
	bool Use_Fake_Pelvis_Rotations; // 0x212
	bool Force_Activation; // 0x218
	bool accurate_feet_placement; // 0x219
	bool use_crosshair_trace_also_for_fail_distance; // 0x21a
	bool Only_Root_Solve; // 0x21b
	FVector Overall_PostSolved_Offset; // 0x224
	FVector character_direction_vector_CS; // 0x230
	FVector Forward_Direction_Vector; // 0x23c
	bool flip_forward_and_right; // 0x248
	ERefPosePluginEnum SolverReferencePose; // 0x258
	bool Spine_Feet_Connect; // 0x259
	float Snake_Joint_Speed; // 0x544
	bool is_snake; // 0x548
	float Maximum_Feet_Distance; // 0x54c
	float Minimum_Feet_Distance; // 0x550
	bool DisplayLineTrace; // 0x554
};

struct FRegionRespawnPointConfig : FTableRowBase {
	FText RegionRespawnPointName; // 0x8
};

struct FDebugCameraControllerSettingsViewModeIndex {
	EViewModeIndex ViewModeIndex; // 0x8
};

struct FAnimNode_ScaleChainLength : FAnimNode_Base {
	FPoseLink InputPose; // 0x10
	float DefaultChainLength; // 0x20
	FBoneReference ChainStartBone; // 0x24
	FBoneReference ChainEndBone; // 0x34
	FVector TargetLocation; // 0x44
	float Alpha; // 0x50
	FInputScaleBias AlphaScaleBias; // 0x58
	EScaleChainInitialLength ChainInitialLength; // 0x60
};

struct FFOscillator {
	float Amplitude; // 0x0
	float Frequency; // 0x4
	EInitialOscillatorOffset InitialOffset; // 0x8
	EOscillatorWaveform Waveform; // 0x9
};

struct FTrafficGoodsSellerInfo {
	int32_t CapitalAmount; // 0x0
	TMap<int32_t, FGoodsSaveInfo> SellGoodsIndexToSaveMap; // 0x8
	TMap<int32_t, FGoodsSaveInfo> RecycleGoodsIndexToPriceMap; // 0x58
};

struct FBindPointInfo {
	FName BindPointDes; // 0x0
	FVector BindPointLocOffset; // 0x8
	FRotator BindPointRotOffset; // 0x14
	int32_t CanBindType; // 0x20
	int32_t CanBindTypeGroup; // 0x24
	int32_t ExcludeBindType; // 0x28
	char bBindPointTo : 1; // 0x2c
	char bBindPointFrom : 1; // 0x2c
	char bBestBindPoint : 1; // 0x2c
	char bChangeFoundation : 1; // 0x2c
	char bIgnoreCheckObject : 1; // 0x2c
	char bIgnoreCreateOnGroundWhenBinded : 1; // 0x2c
};

struct FGeneralInfo {
	TWeakObjectPtr<ASGGeneralCharacter> GeneralWeakPtr; // 0x0
	FVector Location; // 0x8
};

struct FEnvironmentEatItemArray {
	TArray<USGItem*> EnvironmentItemTemplate; // 0x0
};

struct FClientDecalPool {
	TWeakObjectPtr<UDecalComponent> DecalComponent; // 0x0
	int32_t HitResultItem; // 0x8
};

struct FHuangLiEffect : FTableRowBase {
	EHuangLiEffectType ExtraEffectType; // 0x8
	FText EffectDesc; // 0x10
	float ExtraMultiplier; // 0x28
	EHuangLiCheckType CkeckType; // 0x2c
	EHuangLiUnlockType UnlockType; // 0x2d
	int32_t UnlockValue; // 0x30
};

struct FMsgRecord_StructureBannerCreate : FMsgRecordBase {
	FString GuildName; // 0x10
	FString CharacterName; // 0x20
};

struct FEyesData {
	float EyesColor; // 0x0
	float EyeScale; // 0x4
	float EyeAngle; // 0x8
	float EyeballScale; // 0xc
	float EyeDepth; // 0x10
	float EyeHeight; // 0x14
	float EyeWidth; // 0x18
};

struct FCraftResourceRequirement {
	int32_t BaseResourceRequirement; // 0x0
	TArray<USGItem*> ResourceItemType; // 0x8
	char bConsumesDurable : 1; // 0x18
};

struct FModifierSpec {
	float EvaluatedMagnitude; // 0x0
};

struct FPredictProjectilePathParams {
	FVector StartLocation; // 0x0
	FVector LaunchVelocity; // 0xc
	bool bTraceWithCollision; // 0x18
	float ProjectileRadius; // 0x1c
	float MaxSimTime; // 0x20
	bool bTraceWithChannel; // 0x24
	ECollisionChannel TraceChannel; // 0x25
	TArray<EObjectTypeQuery> ObjectTypes; // 0x28
	TArray<AActor*> ActorsToIgnore; // 0x38
	float SimFrequency; // 0x48
	float OverrideGravityZ; // 0x4c
	EDrawDebugTrace DrawDebugType; // 0x50
	float DrawDebugTime; // 0x54
	bool bTraceComplex; // 0x58
};

struct FBehaviorPointTimeWeight {
	FString StartTime; // 0x0
	FString EndTime; // 0x10
	float Weight; // 0x20
};

struct FPrimitiveMaterialRef {
	UPrimitiveComponent* Primitive; // 0x0
	UDecalComponent* Decal; // 0x8
	int32_t ElementIndex; // 0x10
};

struct FPlanarLimitData : FCollisionLimitDataBase {
	FPlane Plane; // 0x50
};

struct FCustomMontageData {
	UAnimMontage* PlayMontage; // 0x0
	float MontagePlayRate; // 0x8
	float MontageStartPosition; // 0xc
	float MontagePreventPosition; // 0x10
};

struct FCustomizedToolMenuEntry {
	ECustomizedToolMenuVisibility Visibility; // 0x0
};

struct FDebugTextInfo {
	AActor* SrcActor; // 0x0
	FVector SrcActorOffset; // 0x8
	FVector SrcActorDesiredOffset; // 0x14
	FString DebugText; // 0x20
	float TimeRemaining; // 0x30
	float Duration; // 0x34
	FColor TextColor; // 0x38
	char bAbsoluteLocation : 1; // 0x3c
	char bKeepAttachedToActor : 1; // 0x3c
	char bDrawShadow : 1; // 0x3c
	FVector OrigActorLocation; // 0x40
	UFont* Font; // 0x50
	float FontScale; // 0x58
};

struct FCollectionVectorParameter : FCollectionParameterBase {
	FLinearColor DefaultValue; // 0x18
};

struct FBuffSimpleInfo {
	USGBuff* BuffClass; // 0x0
	FVector position; // 0x8
};

struct FPurchaseItemDetails {
	FString Price; // 0x10
	FString Name; // 0x20
	PurchaseType Type; // 0x30
};

struct FMsgClientDeleteRoleResult : FMessageBase {
	int32_t Result; // 0x8
	int32_t DeleteIntervalTime; // 0xc
};

struct FMsgClientVersion : FMessageBase {
	FString Welcome; // 0x8
	uint32_t Version; // 0x18
};

struct FSkeletalMeshClothBuildParams {
	TWeakObjectPtr<UClothingAssetBase> TargetAsset; // 0x0
	int32_t TargetLod; // 0x8
	bool bRemapParameters; // 0xc
	FString AssetName; // 0x10
	int32_t LODIndex; // 0x20
	int32_t SourceSection; // 0x24
	bool bRemoveFromMesh; // 0x28
	TSoftObjectPtr<UPhysicsAsset> PhysicsAsset; // 0x30
};

struct FInterpCurveFloat {
	TArray<FInterpCurvePointFloat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FBigMapGuanAiInfo : FTableRowBase {
	FText GuanAiName; // 0x8
	TArray<int32_t> Citys; // 0x20
	int32_t OpenDayOfWeek; // 0x30
	int32_t OpenHour; // 0x34
	int32_t OpenCoolDays; // 0x38
	int32_t SignUpTime; // 0x3c
	int32_t MaxProgress; // 0x40
};

struct FSolverIterations {
	float FixedTimeStep; // 0x0
	int32_t SolverIterations; // 0x4
	int32_t JointIterations; // 0x8
	int32_t CollisionIterations; // 0xc
	int32_t SolverPushOutIterations; // 0x10
	int32_t JointPushOutIterations; // 0x14
	int32_t CollisionPushOutIterations; // 0x18
};

struct FBlockHitAnims {
	UAnimMontage* LU; // 0x0
	UAnimMontage* U; // 0x8
	UAnimMontage* RU; // 0x10
	UAnimMontage* L; // 0x18
	UAnimMontage* C; // 0x20
	UAnimMontage* R; // 0x28
	UAnimMontage* LD; // 0x30
	UAnimMontage* D; // 0x38
	UAnimMontage* RD; // 0x40
};

struct FGizmoFloatParameterChange {
	float InitialValue; // 0x0
	float CurrentValue; // 0x4
};

struct FApplyingJoinAllianceInfo {
	FGuid ApplyUid; // 0x0
	FString ApplyName; // 0x10
	int32_t ApplyLevel; // 0x20
	FDateTime ApplyTime; // 0x28
	char bGuild : 1; // 0x30
	FString VerifyInfo; // 0x38
};

struct FSessionServiceLog {
	FName Category; // 0x0
	FString Data; // 0x8
	FGuid InstanceId; // 0x18
	double TimeSeconds; // 0x28
	char Verbosity; // 0x30
};

struct FAttributesForVertexInstance {
	FVertexInstanceID VertexInstanceID; // 0x0
	FMeshElementAttributeList VertexInstanceAttributes; // 0x8
};

struct FMTDResult {
	FVector Direction; // 0x0
	float Distance; // 0xc
};

struct FMovieSceneObjectPropertyTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneObjectPathChannel ObjectChannel; // 0x38
};

struct FDialogueContextMapping {
	FDialogueContext Context; // 0x0
	USoundWave* SoundWave; // 0x18
	FString LocalizationKeyFormat; // 0x20
	UDialogueSoundWaveProxy* Proxy; // 0x30
};

struct FSGGeneralPerkNetInfo {
	TArray<int32_t> CanLearnPerks; // 0x0
	TArray<int32_t> MCanLearnPerks; // 0x10
	TArray<int32_t> HCanLearnPerks; // 0x20
	TArray<int32_t> CanCertainLearnPerks; // 0x30
	TArray<int32_t> AngryPerks; // 0x40
	TArray<int32_t> WeakPerks; // 0x50
};

struct FAnimNodeData_MultiInput {
	FName Start_Spine; // 0x0
	FName pelvis; // 0x8
	TArray<FAnimNodeData_FootData> FeetBones; // 0x10
};

struct FCachedKeyToActionInfo {
	UPlayerInput* PlayerInput; // 0x0
};

struct FDatasmithMeshBuildSettingsTemplate {
	char bUseMikkTSpace : 1; // 0x0
	char bRecomputeNormals : 1; // 0x0
	char bRecomputeTangents : 1; // 0x0
	char bRemoveDegenerates : 1; // 0x0
	char bBuildAdjacencyBuffer : 1; // 0x0
	char bUseHighPrecisionTangentBasis : 1; // 0x0
	char bUseFullPrecisionUVs : 1; // 0x0
	char bGenerateLightmapUVs : 1; // 0x0
	int32_t MinLightmapResolution; // 0x4
	int32_t SrcLightmapIndex; // 0x8
	int32_t DstLightmapIndex; // 0xc
};

struct FTrafficGoodsTable : FTableRowBase {
	int32_t GoodsIndex; // 0x8
	FText GoodsName; // 0x10
	TSoftObjectPtr<UTexture2D> GoodsIcon; // 0x28
	int32_t SellerLVLimit; // 0x50
	TrafficGoodsType GoodsType; // 0x54
	EItemQuality QualityLevel; // 0x55
	float Weight; // 0x58
	int32_t OnShelfRandomWeight; // 0x5c
	float SellExp; // 0x60
	float RecycleExp; // 0x64
	float RenownReward; // 0x68
	int32_t BasePrice; // 0x6c
	float BasePriceRandomRatio; // 0x70
	int32_t ShelfMinNum; // 0x74
	int32_t ShelfMaxNum; // 0x78
	float RecycleMinPrice; // 0x7c
	float RecycleMaxPrice; // 0x80
	float PriceFluctuationPerDeal; // 0x84
	FText GoodsDescription; // 0x88
	TMap<GoodsSellerType, FVector2D> RecycleBasePriceRatioMap; // 0xa0
};

struct FLiveLinkBaseFrameData {
	FLiveLinkWorldTime WorldTime; // 0x0
	FLiveLinkMetaData MetaData; // 0x10
	TArray<float> PropertyValues; // 0x70
};

struct FMiniMapMarkDataArray {
	TArray<FMiniMapMarkData> MiniMapMarks; // 0x0
};

struct FPlayerQuestData {
	TArray<FQuestProgress> OnGoingQuests; // 0x0
	TArray<FQuestProgress> HiddenQuests; // 0x10
	TArray<int32_t> CompleteQuestIDs; // 0x20
	TArray<int32_t> FinishedQuestIDs; // 0x30
	TArray<int32_t> InvalidQuestIDs; // 0x40
	TArray<int32_t> FinishedDailyQuestIDs; // 0x50
	TArray<FFinishedWeeklyQuest> FinishedWeeklyQuests; // 0x60
	TArray<int32_t> ShowTraceQuests; // 0x70
	int32_t QuestRewardPerkPoint; // 0x80
	int32_t QuestRewardSkillPoint; // 0x84
	FObjectForQuestsArray ObjectForQuestsArray[0x41]; // 0x88
	char DailyQuestNums; // 0x498
	int32_t TotalGuildQuestNums; // 0x49c
	int32_t DailyQuestDay; // 0x4a0
	int32_t WeeklyQuestWeek; // 0x4a4
};

struct FPOV {
	FVector Location; // 0x0
	FRotator Rotation; // 0xc
	float FOV; // 0x18
};

struct FJueWeiPropShow {
	TSoftObjectPtr<UTexture2D> IconTexture; // 0x0
	FText PropText; // 0x28
	FLinearColor PropColor; // 0x40
};

struct FAnimNotifyEventReference {
	UObject* NotifySource; // 0x8
};

struct FPacketSimulationSettings {
	int32_t PktLoss; // 0x0
	int32_t PktLossMaxSize; // 0x4
	int32_t PktLossMinSize; // 0x8
	int32_t PktOrder; // 0xc
	int32_t PktDup; // 0x10
	int32_t PktLag; // 0x14
	int32_t PktLagVariance; // 0x18
	int32_t PktLagMin; // 0x1c
	int32_t PktLagMax; // 0x20
	int32_t PktIncomingLagMin; // 0x24
	int32_t PktIncomingLagMax; // 0x28
	int32_t PktIncomingLoss; // 0x2c
	int32_t PktJitter; // 0x30
};

struct FMsgRecord_TameSuccess : FMsgRecordBase {
	ABaseCharacter* TameCharacterTemplate; // 0x10
	int32_t RealNameIndex; // 0x18
};

struct FAnimControlTrackKey {
	float StartTime; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	float AnimStartOffset; // 0x10
	float AnimEndOffset; // 0x14
	float AnimPlayRate; // 0x18
	char bLooping : 1; // 0x1c
	char bReverse : 1; // 0x1c
};

struct FVehiclePerkRowBase : FTableRowBase {
	int32_t VehiclePerkID; // 0x8
	USGVehiclePerk* PerkClass; // 0x10
};

struct FTrapTypeEntry {
	AActor* TrapTypeClass; // 0x0
	float TrapTypeDamagePercent; // 0x8
};

struct FModifyTextInitParam {
	FText TitleText; // 0x0
	char bShowTitleText : 1; // 0x18
	FText HintText; // 0x20
	char bShowHintText : 1; // 0x38
	FText ContentText; // 0x40
	FText AlertText; // 0x58
	int32_t ContentMaxLen; // 0x70
	char bForceNeedCheck : 1; // 0x74
	UUI_ModifyText* OverrideModifyUIClass; // 0x78
};

struct FExpandableAreaStyle : FSlateWidgetStyle {
	FSlateBrush CollapsedImage; // 0x8
	FSlateBrush ExpandedImage; // 0x90
	float RolloutAnimationSeconds; // 0x118
};

struct FMovieSceneFieldEntry_EvaluationTrack {
	FMovieSceneEvaluationFieldTrackPtr TrackPtr; // 0x0
	uint16_t NumChildren; // 0x8
};

struct FFontData {
	FString FontFilename; // 0x0
	EFontHinting Hinting; // 0x10
	EFontLoadingPolicy LoadingPolicy; // 0x11
	int32_t SubFaceIndex; // 0x14
	UObject* FontFaceAsset; // 0x18
};

struct FLevelSequenceAnimSequenceLinkItem {
	FGuid SkelTrackGuid; // 0x0
	FSoftObjectPath PathToAnimSequence; // 0x10
	bool bExportTransforms; // 0x28
	bool bExportCurves; // 0x29
	bool bRecordInWorldSpace; // 0x2a
};

struct FAssetBundleData {
	TArray<FAssetBundleEntry> Bundles; // 0x0
};

struct FClothCollisionPrim_Sphere {
	int32_t BoneIndex; // 0x0
	float Radius; // 0x4
	FVector LocalPosition; // 0x8
};

struct FAnimationRecordingSettings {
	bool bRecordInWorldSpace; // 0x0
	bool bRemoveRootAnimation; // 0x1
	bool bAutoSaveAsset; // 0x2
	float SampleRate; // 0x4
	float Length; // 0x8
	ERichCurveInterpMode InterpMode; // 0xc
	ERichCurveTangentMode TangentMode; // 0xd
	bool bRecordTransforms; // 0xf
	bool bRecordCurves; // 0x10
};

struct FA2CSPose : FA2Pose {
	TArray<char> ComponentSpaceFlags; // 0x18
};

struct FSkeletonToMeshLinkup {
	TArray<int32_t> SkeletonToMeshTable; // 0x0
	TArray<int32_t> MeshToSkeletonTable; // 0x10
};

struct FHairGroupDesc {
	int32_t HairCount; // 0x0
	int32_t GuideCount; // 0x4
	float HairLength; // 0x8
	float HairWidth; // 0xc
	bool HairWidth_Override; // 0x10
	float HairRootScale; // 0x14
	bool HairRootScale_Override; // 0x18
	float HairTipScale; // 0x1c
	bool HairTipScale_Override; // 0x20
	float HairClipLength; // 0x24
	bool HairClipLength_Override; // 0x28
	float HairShadowDensity; // 0x2c
	bool HairShadowDensity_Override; // 0x30
	float HairRaytracingRadiusScale; // 0x34
	bool HairRaytracingRadiusScale_Override; // 0x38
	bool bUseHairRaytracingGeometry; // 0x39
	bool bUseHairRaytracingGeometry_Override; // 0x3a
	float LODBias; // 0x3c
	bool bUseStableRasterization; // 0x40
	bool bUseStableRasterization_Override; // 0x41
	bool bScatterSceneLighting; // 0x42
	bool bScatterSceneLighting_Override; // 0x43
	bool bSupportVoxelization; // 0x44
	bool bSupportVoxelization_Override; // 0x45
	int32_t LODForcedIndex; // 0x48
};

struct FAllianceDetailData {
	FGuid AllianceUid; // 0x0
	FString InnerBillboard; // 0x10
	TArray<FApplyingJoinAllianceInfo> ApplyJoinInfos; // 0x20
	FString AllianceChannel; // 0x30
	FDateTime LastChangeNameTime; // 0x40
};

struct FBoolParameterNameAndCurve {
	FName ParameterName; // 0x0
	FMovieSceneBoolChannel ParameterCurve; // 0x8
};

struct FImageFilterMaterialParam {
	EImageFilterParamType ParamType; // 0x0
	FName MaterialParamName; // 0x4
	float FloatParam; // 0xc
	UTexture2D* TextureParam; // 0x10
};

struct FCharacterSPConfig {
	float SPState_CostValue; // 0x0
	float SPEvent_CostValue; // 0x4
	FBattleSPConfig SPState_IdleConfig; // 0x8
	FBattleSPConfig SPState_WalkConfig; // 0x30
	FBattleSPConfig SPState_JogConfig; // 0x58
	FBattleSPConfig SPState_RunConfig; // 0x80
	FBattleSPConfig SPState_SwimConfig; // 0xa8
	float SPEvent_JumpCostMul; // 0xd0
	float SPState_JumpRecoverMul; // 0xd4
};

struct FLightmassPrimitiveSettings {
	char bUseTwoSidedLighting : 1; // 0x0
	char bShadowIndirectOnly : 1; // 0x0
	char bUseEmissiveForStaticLighting : 1; // 0x0
	char bUseVertexNormalForHemisphereGather : 1; // 0x0
	float EmissiveLightFalloffExponent; // 0x4
	float EmissiveLightExplicitInfluenceRadius; // 0x8
	float EmissiveBoost; // 0xc
	float DiffuseBoost; // 0x10
	float FullyOccludedSamplesFraction; // 0x14
};

struct FLightmassLightSettings {
	float IndirectLightingSaturation; // 0x0
	float ShadowExponent; // 0x4
	bool bUseAreaShadowsForStationaryLight; // 0x8
};

struct FExploitCompComfigs : FTableRowBase {
	FSoftClassPath ExploitCompClass; // 0x8
	float RecoverTimeMultilier; // 0x20
	FText ExploitCompText; // 0x28
	FString ExploitCompStr; // 0x40
};

struct FExtraAddSkill {
	ESkillType SkillType; // 0x0
	float ExtraSkillExpMulti; // 0x4
};

struct FDatasmithCameraLensSettingsTemplate {
	float MaxFStop; // 0x0
};

struct FMsgServerSystem : FMessageBase {
	FString StrSystem; // 0x8
};

struct FVectorDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FSolverCollisionData {
	FVector Location; // 0x0
	FVector AccumulatedImpulse; // 0xc
	FVector Normal; // 0x18
	FVector Velocity1; // 0x24
	FVector Velocity2; // 0x30
	FVector AngularVelocity1; // 0x3c
	FVector AngularVelocity2; // 0x48
	float Mass1; // 0x54
	float Mass2; // 0x58
	int32_t ParticleIndex; // 0x5c
	int32_t LevelsetIndex; // 0x60
	int32_t ParticleIndexMesh; // 0x64
	int32_t LevelsetIndexMesh; // 0x68
};

struct FAnimationActiveTransitionEntry {
	UBlendProfile* BlendProfile; // 0xb8
};

struct FInputAxisKeyMapping {
	FName AxisName; // 0x0
	float Scale; // 0x8
	FKey Key; // 0x10
};

struct FSGTitleData : FTableRowBase {
	FText Name; // 0x8
	FString Description; // 0x20
	TSoftObjectPtr<UTexture2D> BackgroundTexture; // 0x30
	FSlateColor TitleColor; // 0x58
	FSlateFontInfo FontInfo; // 0x80
	FVector2D ShadowOffset; // 0xd8
	FLinearColor ShadowColor; // 0xe0
};

struct FPointWeightMap {
	TArray<float> Values; // 0x0
};

struct FWeatherLightningEvent {
	ALightningEffect* OwnEffect; // 0x20
};

struct FRenderableTriangle {
	UMaterialInterface* Material; // 0x0
	FRenderableTriangleVertex Vertex0; // 0x8
	FRenderableTriangleVertex Vertex1; // 0x2c
	FRenderableTriangleVertex Vertex2; // 0x50
};

struct FWaterBrushEffectSmoothBlending {
	float InnerSmoothDistance; // 0x0
	float OuterSmoothDistance; // 0x4
};

struct FSHAHashData {
	char Hash[0x14]; // 0x0
};

struct FVariationChanceConfig {
	float VariationChance; // 0x0
	float HarmfulVariationChance; // 0x4
	float UsefulVariationChance; // 0x8
};

struct FLiveLinkTimeSynchronizationSettings {
	FFrameRate FrameRate; // 0x0
	FFrameNumber FrameOffset; // 0x8
};

struct FCustomizedToolMenuNameArray {
	TArray<FName> Names; // 0x0
};

struct FRoadPathConfig {
	ERoadPathType Enum_RoadPathType; // 0x0
	float WaitTime; // 0x4
	FName RoadPathName; // 0x8
	ASG_RoadPath* RoadPathActor; // 0x10
	TArray<FVector> RoadPathPoints; // 0x18
	FString DisplayString; // 0x28
	FColor DisplayColor; // 0x38
	TArray<float> RoadPathWaitTimes; // 0x40
};

struct FChargeDamageTypeData {
	float CharageImpulse; // 0x0
	float FalldownDuration; // 0x4
};

struct FPaperSpriteAtlasSlot {
	TSoftObjectPtr<UPaperSprite> SpriteRef; // 0x0
	int32_t AtlasIndex; // 0x28
	int32_t X; // 0x2c
	int32_t Y; // 0x30
	int32_t Width; // 0x34
	int32_t Height; // 0x38
};

struct FNiagaraModuleDependency {
	FName ID; // 0x0
	ENiagaraModuleDependencyType Type; // 0x8
	ENiagaraModuleDependencyScriptConstraint ScriptConstraint; // 0x9
	FText Description; // 0x10
};

struct FInterpCurvePointLinearColor {
	float InVal; // 0x0
	FLinearColor OutVal; // 0x4
	FLinearColor ArriveTangent; // 0x14
	FLinearColor LeaveTangent; // 0x24
	EInterpCurveMode InterpMode; // 0x34
};

struct FMsgServerLogin : FMessageBase {
	uint32_t MsgVersion; // 0x8
	FString AccountID; // 0x10
	FString OnlinePlatformName; // 0x20
	FString AuthoToken; // 0x30
	FString LoginOptions; // 0x40
	int32_t MajorVersion; // 0x50
	int32_t MinorVersion; // 0x54
	FString GameInfo; // 0x58
	FString DeviceID; // 0x68
};

struct FDatasmithAssetImportOptions {
	FName PackagePath; // 0x0
};

struct FCustomSoundSettingArray {
	TArray<FCustomSoundSetting> SoundSettingArray; // 0x0
};

struct FRadarChartValueLayer {
	FRadarChartColorOverwrite ColorOverwrite; // 0x0
	TArray<float> Values; // 0x18
	char bDrawOutline : 1; // 0x28
	float OutlineThickness; // 0x2c
	FLinearColor OutlineColor; // 0x30
};

struct FPerSkeletonAnimationSharingSetup {
	USkeleton* Skeleton; // 0x0
	USkeletalMesh* SkeletalMesh; // 0x8
	UAnimSharingTransitionInstance* BlendAnimBlueprint; // 0x10
	UAnimSharingAdditiveInstance* AdditiveAnimBlueprint; // 0x18
	UAnimationSharingStateProcessor* StateProcessorClass; // 0x20
	TArray<FAnimationStateEntry> AnimationStates; // 0x28
};

struct FPointConfig {
	EPointType PointType; // 0x0
	FString Description; // 0x8
	TArray<FPointData> PointData; // 0x18
};

struct FGuildStoreItemPriceData {
	FGuid UniqueId; // 0x0
	int32_t Price; // 0x10
};

struct FProcMeshSection {
	TArray<FProcMeshVertex> ProcVertexBuffer; // 0x0
	TArray<uint32_t> ProcIndexBuffer; // 0x10
	FBox SectionLocalBox; // 0x20
	bool bEnableCollision; // 0x3c
	bool bSectionVisible; // 0x3d
};

struct FAnimNode_AnimDynamics : FAnimNode_SkeletalControlBase {
	float LinearDampingOverride; // 0xc8
	float AngularDampingOverride; // 0xcc
	FBoneReference RelativeSpaceBone; // 0x130
	FBoneReference BoundBone; // 0x140
	FBoneReference ChainEnd; // 0x150
	FVector BoxExtents; // 0x160
	FVector LocalJointOffset; // 0x16c
	float GravityScale; // 0x178
	FVector GravityOverride; // 0x17c
	float LinearSpringConstant; // 0x188
	float AngularSpringConstant; // 0x18c
	float WindScale; // 0x190
	FVector ComponentLinearAccScale; // 0x194
	FVector ComponentLinearVelScale; // 0x1a0
	FVector ComponentAppliedLinearAccClamp; // 0x1ac
	float AngularBiasOverride; // 0x1b8
	int32_t NumSolverIterationsPreUpdate; // 0x1bc
	int32_t NumSolverIterationsPostUpdate; // 0x1c0
	FAnimPhysConstraintSetup ConstraintSetup; // 0x1c4
	TArray<FAnimPhysSphericalLimit> SphericalLimits; // 0x210
	float SphereCollisionRadius; // 0x220
	FVector ExternalForce; // 0x224
	TArray<FAnimPhysPlanarLimit> PlanarLimits; // 0x230
	AnimPhysCollisionType CollisionType; // 0x240
	AnimPhysSimSpaceType SimulationSpace; // 0x241
	char bUseSphericalLimits : 1; // 0x244
	char bUsePlanarLimit : 1; // 0x244
	char bDoUpdate : 1; // 0x244
	char bDoEval : 1; // 0x244
	char bOverrideLinearDamping : 1; // 0x244
	char bOverrideAngularBias : 1; // 0x244
	char bOverrideAngularDamping : 1; // 0x244
	char bEnableWind : 1; // 0x244
	char bUseGravityOverride : 1; // 0x245
	char bLinearSpring : 1; // 0x245
	char bAngularSpring : 1; // 0x245
	char bChain : 1; // 0x245
	FRotationRetargetingInfo RetargetingSettings; // 0x250
};

struct FParticleEditorPromotionSettings {
	FFilePath DefaultParticleAsset; // 0x0
};

struct FTTTrackBase {
	FName TrackName; // 0x8
	bool bIsExternalCurve; // 0x10
};

struct FAnimNode_CustomProperty : FAnimNode_Base {
	TArray<FName> SourcePropertyNames; // 0x10
	TArray<FName> DestPropertyNames; // 0x20
	UObject* TargetInstance; // 0x30
};

struct FImportanceTexture {
	FIntPoint Size; // 0x0
	int32_t NumMips; // 0x8
	TArray<float> MarginalCDF; // 0x10
	TArray<float> ConditionalCDF; // 0x20
	TArray<FColor> TextureData; // 0x30
	TWeakObjectPtr<UTexture2D> Texture; // 0x40
	EImportanceWeight Weighting; // 0x48
};

struct FMiniMapData {
	FString MapName; // 0x0
	FVector Location; // 0x10
	float Zoom; // 0x1c
};

struct FMovieSceneTimeTransform {
	float TimeScale; // 0x0
	FFrameTime Offset; // 0x4
};

struct FTransformConstraint {
	FConstraintDescription Operator; // 0x0
	FName SourceNode; // 0x10
	FName TargetNode; // 0x18
	float Weight; // 0x20
	bool bMaintainOffset; // 0x24
};

struct FDestructibleParametersFlag {
	char bAccumulateDamage : 1; // 0x0
	char bAssetDefinedSupport : 1; // 0x0
	char bWorldSupport : 1; // 0x0
	char bDebrisTimeout : 1; // 0x0
	char bDebrisMaxSeparation : 1; // 0x0
	char bCrumbleSmallestChunks : 1; // 0x0
	char bAccurateRaycasts : 1; // 0x0
	char bUseValidBounds : 1; // 0x0
	char bFormExtendedStructures : 1; // 0x1
};

struct FCachedAnimStateArray {
	TArray<FCachedAnimStateData> States; // 0x0
};

struct FAnimNode_StateMachine : FAnimNode_Base {
	int32_t StateMachineIndexInClass; // 0x10
	int32_t MaxTransitionsPerFrame; // 0x14
	bool bSkipFirstUpdateTransition; // 0x18
	bool bReinitializeOnBecomingRelevant; // 0x19
};

struct FGameplayEffectContext {
	TWeakObjectPtr<AActor> Instigator; // 0x8
	TWeakObjectPtr<AActor> EffectCauser; // 0x10
	TWeakObjectPtr<UGameplayAbility> AbilityCDO; // 0x18
	TWeakObjectPtr<UGameplayAbility> AbilityInstanceNotReplicated; // 0x20
	int32_t AbilityLevel; // 0x28
	TWeakObjectPtr<UObject> SourceObject; // 0x2c
	TWeakObjectPtr<UAbilitySystemComponent> InstigatorAbilitySystemComponent; // 0x34
	TArray<TWeakObjectPtr<AActor>> Actors; // 0x40
	FVector WorldOrigin; // 0x60
	char bHasWorldOrigin : 1; // 0x6c
	char bReplicateSourceObject : 1; // 0x6c
};

struct FNiagaraCompileHash {
	TArray<char> DataHash; // 0x0
};

struct FMaterialQualityOverrides {
	bool bDiscardQualityDuringCook; // 0x0
	bool bEnableOverride; // 0x1
	bool bForceFullyRough; // 0x2
	bool bForceNonMetal; // 0x3
	bool bForceDisableLMDirectionality; // 0x4
	bool bForceLQReflections; // 0x5
	bool bForceDisablePreintegratedGF; // 0x6
	bool bDisableMaterialNormalCalculation; // 0x7
	EMobileShadowQuality MobileShadowQuality; // 0x8
};

struct FAutoCompleteCommand {
	FString Command; // 0x0
	FString Desc; // 0x10
};

struct FHairGeometrySettings {
	float HairWidth; // 0x0
	float HairRootScale; // 0x4
	float HairTipScale; // 0x8
	float HairClipScale; // 0xc
};

struct FAnimalFurRelationConfig {
	EAnimalFurColorType Enum_FurColorType; // 0x0
	TMap<EAnimalFurColorType, EAnimalFurColorType> TMap_AnimalFurRelationConfig; // 0x8
};

struct FNiagaraCompileEvent {
	FNiagaraCompileEventSeverity Severity; // 0x0
	FString Message; // 0x8
	FGuid NodeGuid; // 0x18
	FGuid PinGuid; // 0x28
	TArray<FGuid> StackGuids; // 0x38
};

struct FNavCollisionCylinder {
	FVector Offset; // 0x0
	float Radius; // 0xc
	float Height; // 0x10
};

struct FAITouchEvent {
	AActor* TouchReceiver; // 0x10
	AActor* OtherActor; // 0x18
};

struct FSkelMeshMergeSectionMapping_BP {
	TArray<int32_t> SectionIDs; // 0x0
};

struct FBlueprintInputAxisDelegateBinding : FBlueprintInputDelegateBinding {
	FName InputAxisName; // 0x4
	FName FunctionNameToBind; // 0xc
};

struct FPropertyAccessSegment {
	FName Name; // 0x0
	UStruct* Struct; // 0x8
	TFieldPath<FProperty> Property; // 0x10
	UFunction* Function; // 0x30
	int32_t ArrayIndex; // 0x38
	uint16_t Flags; // 0x3c
};

struct FBoughtGuildItemData {
	int32_t LastBoughtDay; // 0x0
	int32_t SohpItemIndex; // 0x4
	int32_t BoughtGroupNum; // 0x8
};

struct FScalabilitySettingsValue {
	EScalabilityDetailValueType ValueType; // 0x0
	FVector2D ValueRange; // 0x4
	TArray<int32_t> Options; // 0x10
	int32_t MinimumIntegralDigits; // 0x20
	int32_t MaximumIntegralDigits; // 0x24
	int32_t MinimumFractionalDigits; // 0x28
	int32_t MaximumFractionalDigits; // 0x2c
};

struct FLensImperfectionSettings {
	UTexture* DirtMask; // 0x0
	float DirtMaskIntensity; // 0x8
	FLinearColor DirtMaskTint; // 0xc
};

struct FNodeHierarchyWithUserData {
	FNodeHierarchyData Hierarchy; // 0x8
};

struct FCharacterAppearanceTemplate : FTableRowBase {
	FString Description; // 0x8
	ECharacterSex Sex; // 0x18
	FAppearanceData AppearanceData; // 0x20
};

struct FCameraSettings_Stance {
	FCameraSettings_Gait Stand; // 0x0
	FCameraSettings_Gait Crouch; // 0x3c
};

struct FNDIStaticMeshSectionFilter {
	TArray<int32_t> AllowedMaterialSlots; // 0x0
};

struct FPackedRGB10A2N {
	int32_t Packed; // 0x0
};

struct FAnimNode_TwoBoneIK : FAnimNode_SkeletalControlBase {
	FBoneReference IKBone; // 0xc8
	float StartStretchRatio; // 0xd8
	float MaxStretchScale; // 0xdc
	FVector EffectorLocation; // 0xe0
	FBoneSocketTarget EffectorTarget; // 0xf0
	FVector JointTargetLocation; // 0x150
	FBoneSocketTarget JointTarget; // 0x160
	FAxis TwistAxis; // 0x1c0
	EBoneControlSpace EffectorLocationSpace; // 0x1d0
	EBoneControlSpace JointTargetLocationSpace; // 0x1d1
	char bAllowStretching : 1; // 0x1d2
	char bTakeRotationFromEffectorSpace : 1; // 0x1d2
	char bMaintainEffectorRelRot : 1; // 0x1d2
	char bAllowTwist : 1; // 0x1d2
};

struct FCollisionResponseContainer {
	ECollisionResponse WorldStatic; // 0x0
	ECollisionResponse WorldDynamic; // 0x1
	ECollisionResponse Pawn; // 0x2
	ECollisionResponse Visibility; // 0x3
	ECollisionResponse Camera; // 0x4
	ECollisionResponse PhysicsBody; // 0x5
	ECollisionResponse Vehicle; // 0x6
	ECollisionResponse Destructible; // 0x7
	ECollisionResponse EngineTraceChannel1; // 0x8
	ECollisionResponse EngineTraceChannel2; // 0x9
	ECollisionResponse EngineTraceChannel3; // 0xa
	ECollisionResponse EngineTraceChannel4; // 0xb
	ECollisionResponse EngineTraceChannel5; // 0xc
	ECollisionResponse EngineTraceChannel6; // 0xd
	ECollisionResponse GameTraceChannel1; // 0xe
	ECollisionResponse GameTraceChannel2; // 0xf
	ECollisionResponse GameTraceChannel3; // 0x10
	ECollisionResponse GameTraceChannel4; // 0x11
	ECollisionResponse GameTraceChannel5; // 0x12
	ECollisionResponse GameTraceChannel6; // 0x13
	ECollisionResponse GameTraceChannel7; // 0x14
	ECollisionResponse GameTraceChannel8; // 0x15
	ECollisionResponse GameTraceChannel9; // 0x16
	ECollisionResponse GameTraceChannel10; // 0x17
	ECollisionResponse GameTraceChannel11; // 0x18
	ECollisionResponse GameTraceChannel12; // 0x19
	ECollisionResponse GameTraceChannel13; // 0x1a
	ECollisionResponse GameTraceChannel14; // 0x1b
	ECollisionResponse GameTraceChannel15; // 0x1c
	ECollisionResponse GameTraceChannel16; // 0x1d
	ECollisionResponse GameTraceChannel17; // 0x1e
	ECollisionResponse GameTraceChannel18; // 0x1f
};

struct FARPose2D {
	FARSkeletonDefinition SkeletonDefinition; // 0x0
	TArray<FVector2D> JointLocations; // 0x28
	TArray<bool> IsJointTracked; // 0x38
};

struct FMovieSceneEventPtrs {
	UFunction* Function; // 0x0
	TFieldPath<FProperty> BoundObjectProperty; // 0x8
};

struct FItemAuctionSellRowBase : FTableRowBase {
	USGItem* ItemClass; // 0x8
	int32_t ItemIndex; // 0x10
	bool CanSell; // 0x14
};

struct FPartyReservation {
	int32_t TeamNum; // 0x0
	FUniqueNetIdRepl PartyLeader; // 0x8
	TArray<FPlayerReservation> PartyMembers; // 0x30
	TArray<FPlayerReservation> RemovedPartyMembers; // 0x40
};

struct FAIDataProviderIntValue : FAIDataProviderTypedValue {
	int32_t DefaultValue; // 0x30
};

struct FBlueprintInputKeyDelegateBinding : FBlueprintInputDelegateBinding {
	FInputChord InputChord; // 0x8
	EInputEvent InputKeyEvent; // 0x28
	FName FunctionNameToBind; // 0x2c
};

struct FGuildEventSpawnData {
	TArray<FGuildEventSpawnEntry> SpawnEntries; // 0x0
};

struct FBattleOpenTimeRuleInfo {
	ESGDayOfWeek DayofWeek; // 0x0
	int32_t Hour; // 0x4
	int32_t JinXianTime; // 0x8
	int32_t BeiZhanTime; // 0xc
};

struct FMovieSceneSkeletalAnimationSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneSkeletalAnimationSectionTemplateParameters Params; // 0x20
};

struct FEyeTrackerStereoGazeData {
	FVector LeftEyeOrigin; // 0x0
	FVector LeftEyeDirection; // 0xc
	FVector RightEyeOrigin; // 0x18
	FVector RightEyeDirection; // 0x24
	FVector FixationPoint; // 0x30
	float ConfidenceValue; // 0x3c
};

struct FMaterialInstanceBasePropertyOverrides {
	char bOverride_OpacityMaskClipValue : 1; // 0x0
	char bOverride_BlendMode : 1; // 0x0
	char bOverride_ShadingModel : 1; // 0x0
	char bOverride_DitheredLODTransition : 1; // 0x0
	char bOverride_CastDynamicShadowAsMasked : 1; // 0x0
	char bOverride_TwoSided : 1; // 0x0
	char TwoSided : 1; // 0x0
	char DitheredLODTransition : 1; // 0x0
	char bCastDynamicShadowAsMasked : 1; // 0x1
	EBlendMode BlendMode; // 0x2
	EMaterialShadingModel ShadingModel; // 0x3
	float OpacityMaskClipValue; // 0x4
};

struct FGameplayEffectCue {
	FGameplayAttribute MagnitudeAttribute; // 0x0
	float MinLevel; // 0x38
	float MaxLevel; // 0x3c
	FGameplayTagContainer GameplayCueTags; // 0x40
};

struct FTransformNoScale {
	FVector Location; // 0x0
	FQuat Rotation; // 0x10
};

struct FDatasmithStaticMeshImportOptions {
	EDatasmithImportLightmapMin MinLightmapResolution; // 0x0
	EDatasmithImportLightmapMax MaxLightmapResolution; // 0x1
	bool bGenerateLightmapUVs; // 0x2
	bool bRemoveDegenerates; // 0x3
};

struct FCardinalDirectionSpeedConfig {
	TMap<EInputDirection, float> TMap_CardinalSpeedConfig; // 0x0
	TMap<EInputDirection, float> TMap_AnimCardinalSpeedConfig; // 0x50
	float CustomAcceleration; // 0xa0
	float CustomGroundFriction; // 0xa4
	float CustomBrakingFriction; // 0xa8
	float CustomBrakingDecelerationWalking; // 0xac
	float CustomRotationMultiply; // 0xb0
	float CustomRotationMultiplyInterpSpeed; // 0xb4
	float CustomPlatformRotationMultiply; // 0xb8
	float CustomBrakingDistance; // 0xbc
	float CutomAutoBrakingDistance; // 0xc0
	float CostSPPerSecond; // 0xc4
	float SPRecoverMul; // 0xc8
};

struct FAnimalsAnimsStanceConfig {
	FAnimalsStanceAIConfig AnimalsStanceAIConfig; // 0x0
	FAnimalsAnimInstanceConfig AnimInstanceAnims; // 0x30
	FAnimalsTurnAnims TurnAnims; // 0xb0
	FAnimalsStartAnims StartAnims; // 0xf0
	FAnimalsStopAnims StopAnims; // 0x140
	FAnimalsTransitions TransitionAnims; // 0x190
	FAnimalsHitAnims HitAnims; // 0x2c8
	FAnimalsDeathAnims DeathAnims; // 0x308
	FAnimalsAttackAnims InPlaceAttackAnims; // 0x358
	FAnimalsAttackAnims MovingAttackAnims; // 0x3a8
};

struct FTeamAttitude {
	ECustomTeamAttitude Enum_TeamAttitude; // 0x0
	ECustomTeamAttitudeBehavior Enum_TeamAttitudeBehavior; // 0x1
};

struct FOccupyTaxBuyItemNum {
	int32_t ProtectID; // 0x0
	char bAdditional : 1; // 0x4
	int32_t CapitalNum; // 0x8
	TArray<FOccupyBuyItemNum> TaxBuyItems; // 0x10
};

struct FNetSerializeScriptStructCache {
	TArray<UScriptStruct*> ScriptStructs; // 0x0
};

struct FRepAttachment {
	AActor* AttachParent; // 0x0
	FVector_NetQuantize100 LocationOffset; // 0x8
	FVector_NetQuantize100 RelativeScale3D; // 0x14
	FRotator RotationOffset; // 0x20
	FName AttachSocket; // 0x2c
	USceneComponent* AttachComponent; // 0x38
};

struct FLevelPerk {
	USGCraftPerk* LevelCraftPerk; // 0x0
	USGBuff* LevelBuff; // 0x8
	int32_t LevelUpExp; // 0x10
	FText Description; // 0x18
	FString Param1; // 0x30
	FString Param2; // 0x40
	FString Param3; // 0x50
	FString Param4; // 0x60
	FString Param5; // 0x70
};

struct FSeasonDataInfo {
	int32_t SeasonLevel; // 0x0
	float CurrentSeasonExp; // 0x4
	float SeasonLevelUpExp; // 0x8
	bool HasSeasonPassport; // 0xc
	FDateTime SeasonPassportExpireTime; // 0x10
	TArray<FSeasonRewardItemState> CanReceiveRewardArray; // 0x18
};

struct FInterpolationParameter {
	float InterpolationTime; // 0x0
	EFilterInterpolationType InterpolationType; // 0x4
};

struct FClothVertBoneData {
	int32_t NumInfluences; // 0x0
	uint16_t BoneIndices[0xc]; // 0x4
	float BoneWeights[0xc]; // 0x1c
};

struct FMovieScene3DTransformTemplateData {
	FMovieSceneFloatChannel TranslationCurve[0x3]; // 0x0
	FMovieSceneFloatChannel RotationCurve[0x3]; // 0x1e0
	FMovieSceneFloatChannel ScaleCurve[0x3]; // 0x3c0
	FMovieSceneFloatChannel ManualWeight; // 0x5a0
	EMovieSceneBlendType BlendType; // 0x640
	FMovieSceneTransformMask Mask; // 0x644
	bool bUseQuaternionInterpolation; // 0x648
};

struct FProceduralFoliageSpawnersPerLevelInfo {
	FString LevelName; // 0x0
	TArray<AProceduralFoliageVolume*> ProceduralFoliageSpawnSeuqnces; // 0x10
};

struct FRandomWeightMontage {
	UAnimMontage* WeightMontage; // 0x0
	float RandomWeight; // 0x8
};

struct FLiveLinkAnimationFrameData : FLiveLinkBaseFrameData {
	TArray<FTransform> Transforms; // 0xa0
};

struct FGameplayModifierInfo {
	FGameplayAttribute Attribute; // 0x0
	EGameplayModOp ModifierOp; // 0x38
	FScalableFloat Magnitude; // 0x40
	FGameplayEffectModifierMagnitude ModifierMagnitude; // 0x60
	FGameplayModEvaluationChannelSettings EvaluationChannelSettings; // 0x208
	FGameplayTagRequirements SourceTags; // 0x210
	FGameplayTagRequirements TargetTags; // 0x250
};

struct FTrainPerkRewardData {
	int32_t VehiclePerkIndex; // 0x0
	TArray<EVehiclePerkSlotType> VehiclePerkSlotType; // 0x8
	char bAllowPlacePerk : 1; // 0x18
	char bIsAddPerk : 1; // 0x18
};

struct FHelpTipsSlotSetting {
	EHelpTipInstructions HelpTipsType; // 0x0
	float AxisScale; // 0x4
	FText HelpTipsText; // 0x8
	FText ActiveTipsText; // 0x20
	FText RiderBattleText; // 0x38
	FText ActiveRiderBattleText; // 0x50
	char bOnlyRiderBattleShow : 1; // 0x68
};

struct FAnimNode_Slot : FAnimNode_Base {
	FPoseLink Source; // 0x10
	FName SlotName; // 0x20
	bool bAlwaysUpdateSourcePose; // 0x28
};

struct FHuKouItemAward {
	EGainHuKouItemWay GainWay; // 0x0
	USGItem* AwardItem; // 0x8
	int32_t nAwardNum; // 0x10
};

struct FPerlinLayerProperties {
	float Frequency; // 0x0
	float Intensity; // 0x4
};

struct FFloatInterval {
	float Min; // 0x0
	float Max; // 0x4
};

struct FMovieSceneColorKeyStruct : FMovieSceneKeyStruct {
	FLinearColor Color; // 0x8
	FFrameNumber Time; // 0x18
};

struct FWalkableSlopeOverride {
	EWalkableSlopeBehavior WalkableSlopeBehavior; // 0x0
	float WalkableSlopeAngle; // 0x4
};

struct FCareerEquip : FTableRowBase {
	int32_t MinLevel; // 0x8
	int32_t MaxLevel; // 0xc
	TArray<FCareerDefaultInventoryItems> RandomDefaultInventoryItems; // 0x10
};

struct FInlineTextImageStyle : FSlateWidgetStyle {
	FSlateBrush Image; // 0x8
	int16_t Baseline; // 0x90
};

struct FAttributeBasedFloat {
	FScalableFloat Coefficient; // 0x0
	FScalableFloat PreMultiplyAdditiveValue; // 0x20
	FScalableFloat PostMultiplyAdditiveValue; // 0x40
	FGameplayEffectAttributeCaptureDefinition BackingAttribute; // 0x60
	FCurveTableRowHandle AttributeCurve; // 0xa0
	EAttributeBasedFloatCalculationType AttributeCalculationType; // 0xb0
	EGameplayModEvaluationChannel FinalChannel; // 0xb1
	FGameplayTagContainer SourceTagFilter; // 0xb8
	FGameplayTagContainer TargetTagFilter; // 0xd8
};

struct FMovieSceneCameraShakeSourceShakeSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneCameraShakeSectionData SourceData; // 0x20
	FFrameNumber SectionStartTime; // 0x40
	FFrameNumber SectionEndTime; // 0x44
};

struct FSeatWeaponMontage {
	TMap<EWeaponSkillType, UAnimMontage*> WeaponMontage; // 0x0
};

struct FCameraSettings {
	float TargetArmLength; // 0x0
	float CameraLagSpeed; // 0x4
	FVector SocketOffset; // 0x8
};

struct FClassRedirect {
	FName ObjectName; // 0x0
	FName OldClassName; // 0x8
	FName NewClassName; // 0x10
	FName OldSubobjName; // 0x18
	FName NewSubobjName; // 0x20
	FName NewClassClass; // 0x28
	FName NewClassPackage; // 0x30
	bool InstanceOnly; // 0x38
};

struct FRigidBodyErrorCorrection {
	float PingExtrapolation; // 0x0
	float PingLimit; // 0x4
	float ErrorPerLinearDifference; // 0x8
	float ErrorPerAngularDifference; // 0xc
	float MaxRestoredStateError; // 0x10
	float MaxLinearHardSnapDistance; // 0x14
	float PositionLerp; // 0x18
	float AngleLerp; // 0x1c
	float LinearVelocityCoefficient; // 0x20
	float AngularVelocityCoefficient; // 0x24
	float ErrorAccumulationSeconds; // 0x28
	float ErrorAccumulationDistanceSq; // 0x2c
	float ErrorAccumulationSimilarity; // 0x30
};

struct FTTFloatTrack : FTTPropertyTrack {
	UCurveFloat* CurveFloat; // 0x20
};

struct FSGAnimNode_FeetSolver : FAnimNode_Base {
	FAnimNodeData_MultiInput AnimNode_InputData; // 0x10
	EIK_Type IK_Type; // 0x88
	EIKTraceType TraceType; // 0x89
	float TraceRadius; // 0x8c
	EInterpoLocation_Type LocInterpType; // 0x90
	EInterpoRotation_Type RotInterpType; // 0x91
	FComponentSpacePoseLink ComponentPose; // 0x98
	float ActualAlpha; // 0xa8
	EAnimAlphaInputType AlphaInputType; // 0xac
	bool bAlphaBoolEnabled; // 0xad
	float Alpha; // 0xb0
	FInputScaleBias AlphaScaleBias; // 0xb4
	FInputAlphaBoolBlend AlphaBoolBlend; // 0xc0
	FName AlphaCurveName; // 0x108
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x110
	bool AutomaticLegMake; // 0x140
	bool EnableSolver; // 0x141
	float ShiftSpeed; // 0x144
	float FeetRotationSpeed; // 0x148
	ETraceTypeQuery TraceChannel; // 0x170
	int32_t LODThreshold; // 0x174
	float LineTraceDownHeight; // 0x2c4
	float LineTraceUpperHeight; // 0x2c8
	bool IgnoreLerping; // 0x2cc
	bool IgnoreLocationLerping; // 0x2cd
	bool ShouldRotateFeet; // 0x2ce
	bool ShowTraceInGame; // 0x2d0
	float LocationLerpSpeed; // 0x2d4
	bool EnablePitch; // 0x2d9
	bool EnableRoll; // 0x2da
	FVector character_direction_vector_CS; // 0x2dc
};

struct FAttenuationSubmixSendSettings {
	USoundSubmixBase* Submix; // 0x0
	ESubmixSendMethod SubmixSendMethod; // 0x8
	float SubmixSendLevelMin; // 0xc
	float SubmixSendLevelMax; // 0x10
	float SubmixSendDistanceMin; // 0x14
	float SubmixSendDistanceMax; // 0x18
	float ManualSubmixSendLevel; // 0x1c
	FRuntimeFloatCurve CustomSubmixSendCurve; // 0x20
};

struct FBranchingPointMarker {
	int32_t NotifyIndex; // 0x0
	float TriggerTime; // 0x4
	EAnimNotifyEventType NotifyEventType; // 0x8
};

struct FNetDriverDefinition {
	FName DefName; // 0x0
	FName DriverClassName; // 0x8
	FName DriverClassNameFallback; // 0x10
};

struct FCharacterMeshLODDynamicMaterialData {
	UMaterialInstanceDynamic* MeshMaterials[0x3]; // 0x0
};

struct FWeatherLinearColorTrack : FWeatherTrack {
	FRuntimeCurveLinearColor Curve; // 0x10
};

struct FNiagaraEmitterScriptProperties {
	UNiagaraScript* Script; // 0x0
	TArray<FNiagaraEventReceiverProperties> EventReceivers; // 0x8
	TArray<FNiagaraEventGeneratorProperties> EventGenerators; // 0x18
};

struct FAnimalSpeciesItemTable : FTableRowBase {
	ASG_AnimalsCharacter* AnimalTemplate; // 0x8
	TArray<FAnimalSpeciesConfig> AnimalSpeciesConfigs; // 0x10
};

struct FColorGradePerRangeSettings {
	FVector4 Saturation; // 0x0
	FVector4 Contrast; // 0x10
	FVector4 Gamma; // 0x20
	FVector4 Gain; // 0x30
	FVector4 Offset; // 0x40
};

struct FConditionRewardMap {
	TMap<FString, USGConditionReward*> ConditionRewardMap; // 0x0
};

struct FCreateStructureInfo {
	FVector Expectedlocation; // 0x0
	FRotator ExpectedRotation; // 0xc
	char bHasBinded : 1; // 0x18
	ASGStructure* ParentStructure; // 0x20
	ASGStructure* ReplaceStructure; // 0x28
	ASGStructure* PreventStructure; // 0x30
	ASGStructureCheckVolume* PreventCheckVolume; // 0x38
	ASGStructure* CreateOnStructure; // 0x40
	ABaseCharacter* PlatformCharacter; // 0x48
	FName AttachBoneName; // 0x50
	char bIgnoreCheckObject : 1; // 0x58
};

struct FOccupyStructureSettings {
	int32_t InnerRadius; // 0x0
	int32_t OuterRadius; // 0x4
	int32_t InnerRadiusPVE; // 0x8
	int32_t OuterRadiusPVE; // 0xc
	TArray<FCraftResourceRequirement> UpdateResourceRequirements; // 0x10
	float MaxHPMultiplier; // 0x20
	int32_t InventoryItemMaxAmount; // 0x24
	float OverrideReductionRate[0x4]; // 0x28
	UStaticMesh* UpdateStaticMesh; // 0x38
	FVector UpdateStaticMeshScale; // 0x40
	FVector MeshCreateCheckBox; // 0x4c
	FVector MeshCreateCheckBoxOffset; // 0x58
	FRotator MeshCreateCheckBoxRotOffset; // 0x64
	FVector MeshCreateCheckBoxScale; // 0x70
};

struct FNodeObject {
	FName Name; // 0x0
	FName ParentName; // 0x8
};

struct FHLODProxyMesh {
	LazyObjectProperty LODActor; // 0x0
	UStaticMesh* StaticMesh; // 0x20
	FName Key; // 0x28
};

struct FMovieSceneCameraShakeSectionTemplate : FMovieSceneAdditiveCameraAnimationTemplate {
	FMovieSceneCameraShakeSectionData SourceData; // 0x20
	FFrameNumber SectionStartTime; // 0x40
};

struct FGeomSelection {
	int32_t Type; // 0x0
	int32_t Index; // 0x4
	int32_t SelectionIndex; // 0x8
};

struct FGameUserSettingConfigMap {
	TMap<FString, FGameUserSettingConfig> SettingConfigMap; // 0x0
};

struct FBakedAnimationStateMachine {
	FName MachineName; // 0x0
	int32_t InitialState; // 0x8
	TArray<FBakedAnimationState> States; // 0x10
	TArray<FAnimationTransitionBetweenStates> Transitions; // 0x20
};

struct FXianChengJinXian {
	FGuid GuildId; // 0x0
	int32_t Num; // 0x10
	FDateTime LastTime; // 0x18
};

struct FSGPathfindingStatusData {
	char bIsDrawDebugPath : 1; // 0x18
	float DrawLifeTime; // 0x1c
	float DrawThickness; // 0x20
	char bUseHierarchicalPathfinding : 1; // 0x24
	char bPathExist : 1; // 0x24
	char bPathIsShort : 1; // 0x24
	char bPathIsPartial : 1; // 0x24
	char bPathSearchOutOfNodes : 1; // 0x24
	float ClosestWallDistance; // 0x28
	UNavigationQueryFilter* FilterClass; // 0x30
	FVector ClosestWallLocation; // 0x38
	FVector ClosestWallNormal; // 0x44
	float PathfindingTime; // 0x50
	float PathCost; // 0x54
	float InvalidPathDistance; // 0x58
	int32_t PathfindingID; // 0x5c
	int32_t PathfindingSteps; // 0x60
	float OffsetFromCornersDistance; // 0x64
	int32_t PathfindingIndex; // 0x68
	int32_t MaxPathfindingIndex; // 0x6c
	FVector SearchStartLocation; // 0x70
	FVector SearchEndLocation; // 0x7c
	FVector PathStartLocation; // 0x88
	FVector PathEndLocation; // 0x94
	TArray<FVector> PathfindingPoints; // 0xa0
	TArray<FVector> PathfindingWallPoints; // 0xb0
	TArray<FVector2D> PathfindingWallNormals; // 0xc0
	TArray<float> PathfindingDeltaWallDists; // 0xd0
	float TetherTime; // 0xe0
	float TetherDistance; // 0xe4
};

struct FNewsNetData {
	FGuid ID; // 0x0
	char NewsType; // 0x10
};

struct FMovieSceneMediaSectionParams {
	UMediaSoundComponent* MediaSoundComponent; // 0x0
	UMediaSource* MediaSource; // 0x8
	UMediaTexture* MediaTexture; // 0x10
	UMediaPlayer* MediaPlayer; // 0x18
	FFrameNumber SectionStartFrame; // 0x20
	FFrameNumber SectionEndFrame; // 0x24
	bool bLooping; // 0x28
	FFrameNumber StartFrameOffset; // 0x2c
};

struct FBrushEffectTerracing {
	float TerraceAlpha; // 0x0
	float TerraceSpacing; // 0x4
	float TerraceSmoothness; // 0x8
	float MaskLength; // 0xc
	float MaskStartOffset; // 0x10
};

struct FMovieSceneMarginSectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneFloatChannel TopCurve; // 0x38
	FMovieSceneFloatChannel LeftCurve; // 0xd8
	FMovieSceneFloatChannel RightCurve; // 0x178
	FMovieSceneFloatChannel BottomCurve; // 0x218
	EMovieSceneBlendType BlendType; // 0x2b8
};

struct FOccupyBuffInfo {
	int32_t BuffIndex; // 0x0
	int32_t BuyDayOfYear; // 0x4
};

struct FFormationData : FTableRowBase {
	FText FormationText; // 0x8
	TArray<FVector2D> FormationVectors; // 0x20
};

struct FTagAndValue {
	FName Tag; // 0x0
	FString Value; // 0x8
};

struct FActorPerceptionUpdateInfo {
	int32_t TargetId; // 0x0
	TWeakObjectPtr<AActor> Target; // 0x4
	FAIStimulus Stimulus; // 0xc
};

struct FNiagaraEmitterScalabilityOverride : FNiagaraEmitterScalabilitySettings {
	char bOverrideSpawnCountScale : 1; // 0x38
};

struct FStructureFrameMesh {
	UStaticMesh* FrameStaticMesh; // 0x0
	FVector MeshLocation; // 0x8
	FRotator MeshRotaion; // 0x14
	FVector MeshScale; // 0x20
};

struct FImageWriteOptions {
	EDesiredImageFormat Format; // 0x0
	FDelegate OnComplete; // 0x4
	int32_t CompressionQuality; // 0x14
	bool bOverwriteFile; // 0x18
	bool bAsync; // 0x19
};

struct FUserActivity {
	FString ActionName; // 0x0
};

struct FPrimaryAssetRulesCustomOverride {
	FPrimaryAssetType PrimaryAssetType; // 0x0
	FDirectoryPath FilterDirectory; // 0x8
	FString FilterString; // 0x18
	FPrimaryAssetRules Rules; // 0x28
};

struct FPreallocationInfo {
	TArray<AGameplayCueNotify_Actor*> ClassesNeedingPreallocation; // 0x50
};

struct FEpicSynth1Patch {
	ESynth1PatchSource PatchSource; // 0x0
	TArray<FSynth1PatchCable> PatchCables; // 0x8
};

struct FGameplayCueTranslatorNode {
	TArray<FGameplayCueTranslationLink> Links; // 0x0
	FGameplayCueTranslatorNodeIndex CachedIndex; // 0x10
	FGameplayTag CachedGameplayTag; // 0x14
	FName CachedGameplayTagName; // 0x1c
};

struct FRootMotionSource_MoveToDynamicForce : FRootMotionSource {
	FVector StartLocation; // 0x98
	FVector InitialTargetLocation; // 0xa4
	FVector TargetLocation; // 0xb0
	bool bRestrictSpeedToExpected; // 0xbc
	UCurveVector* PathOffsetCurve; // 0xc0
	UCurveFloat* TimeMappingCurve; // 0xc8
};

struct FAnimalFarmDataEntry {
	FGuid AnimalGuid; // 0x0
	ECharacterSex AnimalSex; // 0x10
	char bIsAnimalBaby : 1; // 0x11
	int32_t AnimalSpecies; // 0x14
	float AnimalAdulthoodTime; // 0x18
};

struct FVehicleInputRate {
	float RiseRate; // 0x0
	float FallRate; // 0x4
};

struct FTagContainerAggregator {
	FGameplayTagContainer CapturedActorTags; // 0x0
	FGameplayTagContainer CapturedSpecTags; // 0x20
	FGameplayTagContainer ScopedTags; // 0x40
};

struct FSkelMeshMergeUVTransform {
	TArray<FTransform> UVTransforms; // 0x0
};

struct FTattooDataGroup {
	TArray<FTattooData> TattooDatas; // 0x0
};

struct FExploitTypes {
	TArray<EExploitSubType> ExploitSubTypes; // 0x0
};

struct FSkeletalMeshMergeParams {
	TArray<FSkelMeshMergeSectionMapping_BP> MeshSectionMappings; // 0x0
	TArray<FSkelMeshMergeUVTransformMapping> UVTransformsPerMesh; // 0x10
	TArray<USkeletalMesh*> MeshesToMerge; // 0x20
	int32_t StripTopLODS; // 0x30
	char bNeedsCpuAccess : 1; // 0x34
	char bSkeletonBefore : 1; // 0x34
	USkeleton* Skeleton; // 0x38
};

struct FDestructibleChunkParameters {
	bool bIsSupportChunk; // 0x0
	bool bDoNotFracture; // 0x1
	bool bDoNotDamage; // 0x2
	bool bDoNotCrumble; // 0x3
	int32_t CustomChunkIndex; // 0x4
	FVector CustomExplodeDirection; // 0x8
	char IsStaticChunk : 1; // 0x14
};

struct FVertexAndAttributes {
	FVertexInstanceID VertexInstanceID; // 0x0
	FVertexID VertexID; // 0x4
	FMeshElementAttributeList PolygonVertexAttributes; // 0x8
};

struct FAnimalsBehavior {
	UAnimMontage* BehaviorMontage; // 0x0
	float ExtraBrakingDistance; // 0x8
};

struct FBrushEffectCurlNoise {
	float Curl1Amount; // 0x0
	float Curl2Amount; // 0x4
	float Curl1Tiling; // 0x8
	float Curl2Tiling; // 0xc
};

struct FGeneralSmallSkillConditionEntry {
	EGeneralsSkillStatusType OrSmallType; // 0x0
	int32_t GeneralRequiredSmallSkillLevel; // 0x4
};

struct FNiagaraVariableMetaData {
	FText Description; // 0x0
	FText CategoryName; // 0x18
	bool bAdvancedDisplay; // 0x30
	int32_t EditorSortPriority; // 0x34
	bool bInlineEditConditionToggle; // 0x38
	FNiagaraInputConditionMetadata EditCondition; // 0x40
	FNiagaraInputConditionMetadata VisibleCondition; // 0x58
	TMap<FName, FString> PropertyMetaData; // 0x70
	FName ParentAttribute; // 0xc0
	FName ScopeName; // 0xc8
	ENiagaraScriptParameterUsage Usage; // 0xd0
	bool bIsStaticSwitch; // 0xd4
	int32_t StaticSwitchDefaultValue; // 0xd8
	bool bAddedToNodeGraphDeepCopy; // 0xdc
	bool bOutputIsPersistent; // 0xdd
	FName CachedNamespacelessVariableName; // 0xe0
	bool bCreatedInSystemEditor; // 0xe8
	bool bUseLegacyNameString; // 0xe9
};

struct FScrollBoxStyle : FSlateWidgetStyle {
	FSlateBrush TopShadowBrush; // 0x8
	FSlateBrush BottomShadowBrush; // 0x90
	FSlateBrush LeftShadowBrush; // 0x118
	FSlateBrush RightShadowBrush; // 0x1a0
};

struct FHorizonDialogueSegmentInfoStyle {
	FName StyleName; // 0x0
	TArray<FString> Text; // 0x8
	TArray<FSlateColor> ColorAndOpacity; // 0x18
	TArray<FSlateFontInfo> Font; // 0x28
	TArray<int32_t> FontSize; // 0x38
	TArray<FName> TypefaceFontName; // 0x48
	TArray<FVector2D> ShadowOffset; // 0x58
	TArray<FSlateColor> ShadowColorAndOpacity; // 0x68
	TArray<float> DialogueMsgSpeed; // 0x78
	TArray<float> DialogueMsgWait; // 0x88
	TArray<FMargin> PaddingMargin; // 0x98
	TArray<FString> HypertextReference; // 0xa8
	TArray<FSlateColor> HypertextHoveredColor; // 0xb8
	TArray<FSlateColor> HypertextVisitedColor; // 0xc8
	TArray<UHorizonButton*> BackgroundButtonClass; // 0xd8
	TSoftObjectPtr<UTexture2D> Texture2D; // 0xe8
	TSoftObjectPtr<UMaterial> Material; // 0x110
	TSoftObjectPtr<UPaperSprite> PaperSprite; // 0x138
	TSoftObjectPtr<USoundBase> DialogueSound; // 0x160
	TArray<float> DialogueSoundVolumeMultiplier; // 0x188
	TArray<float> DialogueSoundPitchMultiplier; // 0x198
	TArray<float> DialogueSoundStartTime; // 0x1a8
	TSoftObjectPtr<UPaperFlipbook> PaperFlipbook; // 0x1b8
	TArray<FVector2D> ImageSize; // 0x1e0
	FHorizonDialogueSegmentInfoRubyTextStyle RubyTextStyleInfo; // 0x1f0
};

struct FAnimSlotDesc {
	FName SlotName; // 0x0
	int32_t NumChannels; // 0x8
};

struct FVaultingHeightParams {
	float VaultingDesiredHeight; // 0x0
	FVaultingParams ClimbVaultingParams; // 0x10
	FVaultingParams JumpVaultingParams; // 0x160
	FVaultingParams SlideVaultingParams; // 0x2b0
	FVaultingParams NarrowVaultingParams; // 0x400
};

struct FLandscapeComponentMaterialOverride {
	FPerPlatformInt LODIndex; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FMovieSceneEvaluationTemplate {
	TMap<FMovieSceneTrackIdentifier, FMovieSceneEvaluationTrack> Tracks; // 0x0
	FGuid SequenceSignature; // 0xa0
	FMovieSceneEvaluationTemplateSerialNumber TemplateSerialNumber; // 0xb0
	FMovieSceneTemplateGenerationLedger TemplateLedger; // 0xb8
};

struct FAnimalsAttackAnims {
	TMap<EAimDirection, FAnimalsCustomAttackInfoes> TMap_AttackMontages; // 0x0
};

struct FAnimalInfo {
	TWeakObjectPtr<ASG_AnimalsCharacter> AnimalWeakPtr; // 0x0
	FVector Location; // 0x8
};

struct FMovieSceneEventChannel : FMovieSceneChannel {
	TArray<FFrameNumber> KeyTimes; // 0x8
	TArray<FMovieSceneEvent> KeyValues; // 0x18
};

struct FItemStrengthenProperty : FTableRowBase {
	int32_t Level; // 0x8
	float SlashingDamage; // 0xc
	float PiercingDamage; // 0x10
	float CrushingDamage; // 0x14
	float SiegeDamage; // 0x18
	int32_t Tenacity; // 0x1c
	float SlashingArmor; // 0x20
	float PiercingArmor; // 0x24
	float CrushingArmor; // 0x28
	float SiegeArmor; // 0x2c
	float CollectionDamage; // 0x30
};

struct FGuildImageColor : FTableRowBase {
	int32_t ColorIndex; // 0x8
	USGItem* UnlockItem; // 0x10
	FLinearColor Color; // 0x18
	USGItem* ColorItemClass; // 0x28
};

struct FAnimNode_CopyPoseFromMesh : FAnimNode_Base {
	TWeakObjectPtr<USkeletalMeshComponent> SourceMeshComponent; // 0x10
	char bUseAttachedParent : 1; // 0x18
	char bCopyCurves : 1; // 0x18
	bool bCopyCustomAttributes; // 0x19
	char bUseMeshPose : 1; // 0x1a
	FName RootBoneToCopy; // 0x1c
};

struct FBattleInfo {
	FGuid BattleUid; // 0x0
	EBattleType BattleType; // 0x10
	int32_t BattleKey; // 0x14
	int32_t BattleGamePlayIndex; // 0x18
	int32_t nBattleRoundIndex; // 0x1c
	int32_t BattleSocre; // 0x20
	int32_t BattleHpMin; // 0x24
	int32_t BattleHpMax; // 0x28
	EGameServerState ServerState; // 0x2c
	int32_t ServerId; // 0x30
	FGuid DefenseUid; // 0x34
	FString DefenseGuildOwnerName; // 0x48
	FGuid AttackUid; // 0x58
	FString AttackGuildOwnerName; // 0x68
	float SignUpTime; // 0x78
	float OpenTime; // 0x7c
	float OverTime; // 0x80
};

struct FUpdateLevelVisibilityLevelInfo {
	FName PackageName; // 0x0
	FName Filename; // 0x8
	char bIsVisible : 1; // 0x10
};

struct FMagicLeapEyeBlinkState {
	bool LeftEyeBlinked; // 0x0
	bool RightEyeBlinked; // 0x1
};

struct FOptionalMovieSceneBlendType {
	EMovieSceneBlendType BlendType; // 0x0
	bool bIsValid; // 0x1
};

struct FLocationServicesData {
	float Timestamp; // 0x0
	float Longitude; // 0x4
	float Latitude; // 0x8
	float HorizontalAccuracy; // 0xc
	float VerticalAccuracy; // 0x10
	float Altitude; // 0x14
};

struct FHardwareCursorReference {
	FName CursorPath; // 0x0
	FVector2D HotSpot; // 0x8
};

struct FPIELoginSettingsInternal {
	FString ID; // 0x0
	FString Token; // 0x10
	FString Type; // 0x20
	TArray<char> TokenBytes; // 0x30
};

struct FShopProps : FTableRowBase {
	int32_t ShopPropsIndex; // 0x8
	FText ItemName; // 0x10
	FText ItemIntro; // 0x28
	int32_t Priority; // 0x40
	EShopPropState PropsState; // 0x44
	FItemNumMap ItemPackageConfig; // 0x48
	EShopUIMainIndex ShelfIndex; // 0x98
	TSoftObjectPtr<UTexture2D> MainBrush; // 0xa0
	ENShopPropsActivity ActivityType; // 0xc8
	float Discount; // 0xcc
	ECapitalType PriceType; // 0xd0
	int32_t Price; // 0xd4
};

struct FMsgServerCancelPlayerQueue : FMessageBase {
	int32_t ServerType; // 0x8
};

struct FMesh_Caustics_Parameters {
	FString EnableMeshCaustics_11_EF17A54E4000730673FD55AFA7851310; // 0x0
	FString MeshCausticsResolution_12_8CBAF5AD40511B86FFECDBBE10551070; // 0x10
	FString MeshCausticsBufferScale_13_82AC6AEE4DE3DABA0E6EF8AFC173099A; // 0x20
	FString MeshCausticsTemporalStrength_14_53019FA5437B781E8F3DCDA3EAA12347; // 0x30
	FString MeshCausticsJitter_15_A7EFA23F493F73491A338F833DD71740; // 0x40
	FString MeshCausticsEnableDispersion_16_D1059E664DB569A0DCD2868ED0E410C0; // 0x50
	FString MeshCausticsTranslucentReflectionMode_57_234A3311428BB4FD6186D485A258D216; // 0x60
	FString MeshCausticsMaxTraceDepth_18_E5DFC534448262757F618C984430031B; // 0x70
	FString MeshCausticsAdaptivePhotonSize_19_75A570FD45DDB1FFB198EAB522F1327C; // 0x80
	FString MeshCausticsEnableTemporalFilter_20_B10DF55042CC5EB4BBBD3C9029E72D25; // 0x90
	FString MeshCausticsAdaptiveSmooth_26_B237A3464D57ACD60A63CEB0E381F8AF; // 0xa0
	FString MeshCausticsAdaptiveUpdateSpeed_27_EBAA130A425D904E6219BC847C5D4E7E; // 0xb0
	FString MeshCausticsAdaptiveVarianceGain_28_D612A8F64E9A6BB74AD5D0A9FC85241B; // 0xc0
	FString MeshCausticsFixedLight_29_9C6912304FA41791E112799EF9B09B26; // 0xd0
	FString MeshCausticsMaxIntensity_30_0571085B49EBB70A2506CC898A54B72E; // 0xe0
	FString MeshCausticsSoftCausticsSample_34_23B75C3A4673EC4C06FB7380A1AFC77B; // 0xf0
	FString MeshCausticsEnableAdvancedSoftCaustics_40_EF539D7E4B254D3FF7354499EA1ADA17; // 0x100
	FString MeshCausticsMidCullColorThreshold_46_603884CE4A61EB477D7D2C82EFE3E844; // 0x110
	FString MeshCausticsFinalCullColorThreshold_47_ADE4A81B4FC53161666873B6CE1C1E16; // 0x120
	FString MeshCausticsIntensity_50_8E96F81D40BC087613695CBE1946AD28; // 0x130
	FString MeshCausticsMaxRayDistance_53_7A78E57D4BA078EDB6381A846432F21C; // 0x140
	FString MeshCausticsTemporalColorTolerance_56_C9E20A13401A4696C5D960922F2ED319; // 0x150
};

struct FPolygonGroupForPolygon {
	FPolygonID PolygonID; // 0x0
	FPolygonGroupID PolygonGroupID; // 0x4
};

struct FProtectionRequirement {
	int32_t ProtectIndex; // 0x0
	FName ProtectDesc; // 0x4
	FText ProtectTitle; // 0x10
	int32_t ProtectTime; // 0x28
	TArray<FCraftResourceRequirement> ProtectionResourceRequirements; // 0x30
	TArray<FCapitalResourceRequirement> ProtectionCapitalResourceRequirements; // 0x40
};

struct FDrawToRenderTargetContext {
	UTextureRenderTarget2D* RenderTarget; // 0x0
};

struct FRuntimeFloatCurve {
	FRichCurve EditorCurveData; // 0x0
	UCurveFloat* ExternalCurve; // 0x80
};

struct FPluginRedirect {
	FString OldPluginName; // 0x0
	FString NewPluginName; // 0x10
};

struct FMovieSceneEvaluationTrack {
	FGuid ObjectBindingId; // 0x0
	uint16_t EvaluationPriority; // 0x10
	EEvaluationMethod EvaluationMethod; // 0x12
	TWeakObjectPtr<UMovieSceneTrack> SourceTrack; // 0x14
	TArray<FMovieSceneEvalTemplatePtr> ChildTemplates; // 0x20
	FMovieSceneTrackImplementationPtr TrackTemplate; // 0x30
	FName EvaluationGroup; // 0x68
	char bEvaluateInPreroll : 1; // 0x70
	char bEvaluateInPostroll : 1; // 0x70
	char bTearDownPriority : 1; // 0x70
};

struct FVertexToCreate {
	FMeshElementAttributeList VertexAttributes; // 0x0
	FVertexID OriginalVertexID; // 0x10
};

struct FMessageBase {
	char nMsgType; // 0x0
	int32_t nResult; // 0x4
};

struct FTipsTypes {
	TArray<FTipsType> ToolTipsItemList; // 0x0
};

struct FAllianceGuildMember {
	FGuid GuildUid; // 0x0
};

struct FQuestRewardOverride {
	int32_t PlayerMinLevel; // 0x0
	int32_t PlayerMaxLevel; // 0x4
	TArray<FQuestReward> QuestRewards; // 0x8
};

struct FRadialDamageParams {
	float BaseDamage; // 0x0
	float MinimumDamage; // 0x4
	float InnerRadius; // 0x8
	float OuterRadius; // 0xc
	float DamageFalloff; // 0x10
};

struct FInterpGroupActorInfo {
	FName ObjectName; // 0x0
	TArray<AActor*> Actors; // 0x8
};

struct FNavLinkCustomInstanceData : FActorComponentInstanceData {
	uint32_t NavLinkUserId; // 0x68
};

struct FGameplayTag {
	FName TagName; // 0x0
};

struct FAnimMontageInstance {
	UAnimMontage* Montage; // 0x0
	bool bPlaying; // 0x28
	float DefaultBlendTimeMultiplier; // 0x2c
	TArray<int32_t> NextSections; // 0xe8
	TArray<int32_t> PrevSections; // 0xf8
	TArray<FAnimNotifyEvent> ActiveStateBranchingPoints; // 0x118
	float position; // 0x128
	float PlayRate; // 0x12c
	FAlphaBlend Blend; // 0x130
	int32_t DisableRootMotionCount; // 0x18c
};

struct FGameplayEffectSpec {
	UGameplayEffect* Def; // 0x0
	TArray<FGameplayEffectModifiedAttribute> ModifiedAttributes; // 0x8
	FGameplayEffectAttributeCaptureSpecContainer CapturedRelevantAttributes; // 0x18
	float Duration; // 0x50
	float Period; // 0x54
	float ChanceToApplyToTarget; // 0x58
	FTagContainerAggregator CapturedSourceTags; // 0x60
	FTagContainerAggregator CapturedTargetTags; // 0xe8
	FGameplayTagContainer DynamicGrantedTags; // 0x170
	FGameplayTagContainer DynamicAssetTags; // 0x190
	TArray<FModifierSpec> Modifiers; // 0x1b0
	int32_t StackCount; // 0x1c0
	char bCompletedSourceAttributeCapture : 1; // 0x1c4
	char bCompletedTargetAttributeCapture : 1; // 0x1c4
	char bDurationLocked : 1; // 0x1c4
	TArray<FGameplayAbilitySpecDef> GrantedAbilitySpecs; // 0x1c8
	FGameplayEffectContextHandle EffectContext; // 0x278
	float Level; // 0x290
};

struct FGameplayCueNotifyData {
	FGameplayTag GameplayCueTag; // 0x0
	FSoftObjectPath GameplayCueNotifyObj; // 0x8
	UObject* LoadedGameplayCueClass; // 0x20
};

struct FNiagaraMeshMaterialOverride {
	UMaterialInterface* ExplicitMat; // 0x0
	FNiagaraUserParameterBinding UserParamBinding; // 0x8
};

struct FWeightedBlendables {
	TArray<FWeightedBlendable> Array; // 0x0
};

struct FSGAnimNode_LayeredBoneBlend : FAnimNode_Base {
	FPoseLink BasePose; // 0x10
	TArray<FPoseLink> BlendPoses; // 0x20
	FSGInputBlendPose SGInputBlendPose; // 0x30
	TArray<float> BlendWeights; // 0x40
	bool bMeshSpaceRotationBlend; // 0x50
	bool bMeshSpaceScaleBlend; // 0x51
	ECurveBlendOption CurveBlendOption; // 0x52
	bool bBlendRootMotionBasedOnRootBone; // 0x53
	int32_t LODThreshold; // 0x58
	TArray<FPerBoneBlendWeight> PerBoneBlendWeights; // 0x60
	FGuid SkeletonGuid; // 0x70
	FGuid VirtualBoneGuid; // 0x80
};

struct FCloudChunkData {
	TArray<char> DataBytes; // 0x0
	TWeakObjectPtr<AActor> ChunkActor; // 0x10
};

struct FTemplateSequenceBindingOverrideData {
	TWeakObjectPtr<UObject> Object; // 0x0
	bool bOverridesDefault; // 0x8
};

struct FScalarParameterAtlasInstanceData {
	bool bIsUsedAsAtlasPosition; // 0x0
	TSoftObjectPtr<UCurveLinearColor> Curve; // 0x8
	TSoftObjectPtr<UCurveLinearColorAtlas> Atlas; // 0x30
};

struct FHorizonDialogueBlockInfo {
	FString MsgText; // 0x0
	FString RubyText; // 0x20
	int32_t CurrentCharIndex; // 0x38
	int32_t SegmentReferenceIndex; // 0x3c
	FName Name; // 0x40
	FVector2D BlockSize; // 0x48
	FVector2D RubyTextBlockSize; // 0x50
};

struct FApplyingJoinGuildInfo {
	FGuid ApplyPlayerUid; // 0x0
	FString ApplyPlayerName; // 0x10
	int32_t ApplyPlayerLevel; // 0x20
	FDateTime ApplyTime; // 0x28
	FGuid GuildUid; // 0x30
	FString VerifyInfo; // 0x40
};

struct FShopSquareItem : FTableRowBase {
	int32_t ItemIndex; // 0x8
	FSlateBrush ItemBrush; // 0x10
	char bIsHotSale : 1; // 0x98
	FSlateBrush HotSaleBrush; // 0xa0
	float Discount; // 0x128
};

struct FRootMotionFinishVelocitySettings {
	ERootMotionFinishVelocityMode Mode; // 0x0
	FVector SetVelocity; // 0x4
	float ClampVelocity; // 0x10
};

struct FVaultingTraceSettings {
	FName CollisionProfileName; // 0x0
	FVector2D VaultingHeightRange; // 0x8
	float ForwardReachDistance; // 0x10
	float ClimbCapsuleRadiusTolerance; // 0x14
	float TraceForDurationTime; // 0x20
	TArray<FHitResult> ForwardHitResults; // 0x28
	TArray<FHitResult> ClimbUpHitResults; // 0x38
	TArray<FHitResult> ClimbDownHitResults; // 0x50
	FHitResult LandHitResult; // 0x60
	FHitResult AirLandHitResult; // 0xec
	TArray<AActor*> IgnoreActors; // 0x178
};

struct FSphericalLimitData : FCollisionLimitDataBase {
	float Radius; // 0x50
	ESphericalLimitType LimitType; // 0x54
};

struct FMagicLeapARPinState {
	float Confidence; // 0x0
	float ValidRadius; // 0x4
	float RotationError; // 0x8
	float TranslationError; // 0xc
	EMagicLeapARPinType PinType; // 0x10
};

struct FMiniMapMarkConfig : FTableRowBase {
	EMiniMapMarkType MarkType; // 0x8
	TSoftObjectPtr<UTexture2D> InMapMarkTexture; // 0x10
	TSoftObjectPtr<UTexture2D> OutOfMapMarkTexture; // 0x38
	FLinearColor NormalMarkColor; // 0x60
	FLinearColor GuildMarkColor; // 0x70
	UTexture2D* AdvancedHitTexture; // 0x80
	AMiniMapMarkActor* MarkActorClass; // 0x88
	char bViewDistanceLimit : 1; // 0x90
	float MinViewDistance; // 0x94
};

struct FChangeEquipStateMaterialSetting {
	int32_t MaterialNum; // 0x0
	FName MaterialName; // 0x4
	float MinSpeedToNum; // 0xc
	float MaxSpeed; // 0x10
	float MaxSpeedToNum; // 0x14
	float DeltaChangeNum; // 0x18
};

struct FBlueprintEditorPromotionSettings {
	FFilePath FirstMeshPath; // 0x0
	FFilePath SecondMeshPath; // 0x10
	FFilePath DefaultParticleAsset; // 0x20
};

struct FNavGraphNode {
	UObject* Owner; // 0x0
};

struct FGameplayEffectCustomExecutionOutput {
	TArray<FGameplayModifierEvaluatedData> OutputModifiers; // 0x0
	char bTriggerConditionalGameplayEffects : 1; // 0x10
	char bHandledStackCountManually : 1; // 0x10
	char bHandledGameplayCuesManually : 1; // 0x10
};

struct FElementsMaskStruct {
	TArray<uint32_t> ElementsMasks; // 0x0
};

struct FComboButtonStyle : FSlateWidgetStyle {
	FButtonStyle ButtonStyle; // 0x8
	FSlateBrush DownArrowImage; // 0x280
	FVector2D ShadowOffset; // 0x308
	FLinearColor ShadowColorAndOpacity; // 0x310
	FSlateBrush MenuBorderBrush; // 0x320
	FMargin MenuBorderPadding; // 0x3a8
};

struct FAIDamageEvent {
	float Amount; // 0x0
	FVector Location; // 0x4
	FVector HitLocation; // 0x10
	AActor* DamagedActor; // 0x20
	AActor* Instigator; // 0x28
};

struct FMaterialFunctionInfo {
	FGuid StateId; // 0x0
	UMaterialFunctionInterface* Function; // 0x10
};

struct FMiniMapMarkData {
	FGuid MarkGuid; // 0x0
	FString MarkID; // 0x10
	int32_t MarkType; // 0x20
	FString MarkName; // 0x28
	char bIsGuild : 1; // 0x38
	FVector Location; // 0x3c
};

struct FAllianceAllianceMember {
	FGuid AllianceUid; // 0x0
};

struct FMovieSceneStringChannel : FMovieSceneChannel {
	TArray<FFrameNumber> Times; // 0x8
	TArray<FString> Values; // 0x18
	FString DefaultValue; // 0x28
	bool bHasDefaultValue; // 0x38
};

struct FLiveLinkLightStaticData : FLiveLinkTransformStaticData {
	bool bIsTemperatureSupported; // 0x10
	bool bIsIntensitySupported; // 0x11
	bool bIsLightColorSupported; // 0x12
	bool bIsInnerConeAngleSupported; // 0x13
	bool bIsOuterConeAngleSupported; // 0x14
	bool bIsAttenuationRadiusSupported; // 0x15
	bool bIsSourceLenghtSupported; // 0x16
	bool bIsSourceRadiusSupported; // 0x17
	bool bIsSoftSourceRadiusSupported; // 0x18
};

struct FHairGroupsMaterial {
	UMaterialInterface* Material; // 0x0
	FName SlotName; // 0x8
};

struct FSliderStyle : FSlateWidgetStyle {
	FSlateBrush NormalBarImage; // 0x8
	FSlateBrush HoveredBarImage; // 0x90
	FSlateBrush DisabledBarImage; // 0x118
	FSlateBrush NormalThumbImage; // 0x1a0
	FSlateBrush HoveredThumbImage; // 0x228
	FSlateBrush DisabledThumbImage; // 0x2b0
	float BarThickness; // 0x338
};

struct FAssetManagerRedirect {
	FString Old; // 0x0
	FString New; // 0x10
};

struct FTTEventTrack : FTTTrackBase {
	FName FunctionName; // 0x18
	UCurveFloat* CurveKeys; // 0x20
};

struct FGameplayAbilityActivationInfo {
	EGameplayAbilityActivationMode ActivationMode; // 0x0
	char bCanBeEndedByOtherInstance : 1; // 0x1
	FPredictionKey PredictionKeyWhenActivated; // 0x8
};

struct FBattleInfoTickTime {
	float SignUpTime; // 0x0
	float OpenTime; // 0x4
	float OverTime; // 0x8
};

struct FGuanAiBattleParam {
	int32_t OpenDayOfWeek; // 0x0
	int32_t OpenHour; // 0x4
	int32_t OpenCoolDays; // 0x8
	int32_t SignUpTime; // 0xc
};

struct FCanvasUVTri {
	FVector2D V0_Pos; // 0x0
	FVector2D V0_UV; // 0x8
	FLinearColor V0_Color; // 0x10
	FVector2D V1_Pos; // 0x20
	FVector2D V1_UV; // 0x28
	FLinearColor V1_Color; // 0x30
	FVector2D V2_Pos; // 0x40
	FVector2D V2_UV; // 0x48
	FLinearColor V2_Color; // 0x50
};

struct FBoneMirrorExport {
	FName BoneName; // 0x0
	FName SourceBoneName; // 0x8
	EAxis BoneFlipAxis; // 0x10
};

struct FNews_GetRankReward_Activity : FNewsBase {
	FString ShowName; // 0x18
	FString RankID; // 0x28
	int32_t Rankings; // 0x38
};

struct FAllianceGuildInfo {
	FAllianceGuildMember GuildMember; // 0x0
	TArray<FAllianceSubMember> SubMembers; // 0x10
	FGuid AllianceUid; // 0x20
};

struct FSphericalPontoon {
	FName CenterSocket; // 0x0
	FVector RelativeLocation; // 0x8
	float Radius; // 0x14
	FVector LocalForce; // 0x18
	FVector CenterLocation; // 0x24
	FQuat SocketRotation; // 0x30
	FVector Offset; // 0x40
	float WaterHeight; // 0x50
	float WaterDepth; // 0x54
	float ImmersionDepth; // 0x58
	FVector WaterPlaneLocation; // 0x5c
	FVector WaterPlaneNormal; // 0x68
	FVector WaterSurfacePosition; // 0x74
	FVector WaterVelocity; // 0x80
	int32_t WaterBodyIndex; // 0x8c
	AWaterBody* CurrentWaterBody; // 0x138
};

struct FMovieSceneEvaluationMetaData {
	TArray<FMovieSceneSequenceID> ActiveSequences; // 0x0
	TArray<FMovieSceneOrderedEvaluationKey> ActiveEntities; // 0x10
};

struct FConnectionAlwaysRelevantNodePair {
	UNetConnection* NetConnection; // 0x0
	UReplicationGraphNode_AlwaysRelevant_ForConnection* Node; // 0x8
};

struct FA2Pose {
	TArray<FTransform> Bones; // 0x0
};

struct FSynthKnobStyle : FSlateWidgetStyle {
	FSlateBrush LargeKnob; // 0x8
	FSlateBrush LargeKnobOverlay; // 0x90
	FSlateBrush MediumKnob; // 0x118
	FSlateBrush MediumKnobOverlay; // 0x1a0
	float MinValueAngle; // 0x228
	float MaxValueAngle; // 0x22c
	ESynthKnobSize KnobSize; // 0x230
};

struct FStatusAudio {
	int32_t Index; // 0x0
	TWeakObjectPtr<USGAudioComponent> AudioComponent; // 0x4
};

struct FCollectionScalarParameter : FCollectionParameterBase {
	float DefaultValue; // 0x18
};

struct FChaosTrailingEventRequestSettings {
	int32_t MaxNumberOfResults; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinAngularSpeed; // 0xc
	float MaxDistance; // 0x10
	EChaosTrailingSortMethod SortMethod; // 0x14
};

struct FBrushEffectSmoothBlending {
	float InnerSmoothDistance; // 0x0
	float OuterSmoothDistance; // 0x4
};

struct FVirtualSkeletalMeshData {
	UAnimMontage* PlayMontage; // 0x0
	USkeletalMeshComponent* VirtualPropSkeletalMeshComponent; // 0x8
};

struct FRecordedFrame {
	TArray<FTransform> Transforms; // 0x0
	TArray<int32_t> TransformIndices; // 0x10
	TArray<int32_t> PreviousTransformIndices; // 0x20
	TArray<bool> DisabledFlags; // 0x30
	TArray<FSolverCollisionData> Collisions; // 0x40
	TArray<FSolverBreakingData> Breakings; // 0x50
	TSet<FSolverTrailingData> Trailings; // 0x60
	float Timestamp; // 0xb0
};

struct FLightPropagationVolumeSettings {
	char bOverride_LPVIntensity : 1; // 0x0
	char bOverride_LPVDirectionalOcclusionIntensity : 1; // 0x0
	char bOverride_LPVDirectionalOcclusionRadius : 1; // 0x0
	char bOverride_LPVDiffuseOcclusionExponent : 1; // 0x0
	char bOverride_LPVSpecularOcclusionExponent : 1; // 0x0
	char bOverride_LPVDiffuseOcclusionIntensity : 1; // 0x0
	char bOverride_LPVSpecularOcclusionIntensity : 1; // 0x0
	char bOverride_LPVSize : 1; // 0x0
	char bOverride_LPVSecondaryOcclusionIntensity : 1; // 0x1
	char bOverride_LPVSecondaryBounceIntensity : 1; // 0x1
	char bOverride_LPVGeometryVolumeBias : 1; // 0x1
	char bOverride_LPVVplInjectionBias : 1; // 0x1
	char bOverride_LPVEmissiveInjectionIntensity : 1; // 0x1
	float LPVIntensity; // 0x4
	float LPVVplInjectionBias; // 0x8
	float LPVSize; // 0xc
	float LPVSecondaryOcclusionIntensity; // 0x10
	float LPVSecondaryBounceIntensity; // 0x14
	float LPVGeometryVolumeBias; // 0x18
	float LPVEmissiveInjectionIntensity; // 0x1c
	float LPVDirectionalOcclusionIntensity; // 0x20
	float LPVDirectionalOcclusionRadius; // 0x24
	float LPVDiffuseOcclusionExponent; // 0x28
	float LPVSpecularOcclusionExponent; // 0x2c
	float LPVDiffuseOcclusionIntensity; // 0x30
	float LPVSpecularOcclusionIntensity; // 0x34
	float LPVFadeRange; // 0x38
	float LPVDirectionalOcclusionFadeRange; // 0x3c
};

struct FChangeVertexInstancesForPolygon {
	FPolygonID PolygonID; // 0x0
	TArray<FVertexIndexAndInstanceID> PerimeterVertexIndicesAndInstanceIDs; // 0x8
	TArray<FVertexInstancesForPolygonHole> VertexIndicesAndInstanceIDsForEachHole; // 0x18
};

struct FLiveLinkLightFrameData : FLiveLinkTransformFrameData {
	float Temperature; // 0xd0
	float Intensity; // 0xd4
	FColor LightColor; // 0xd8
	float InnerConeAngle; // 0xdc
	float OuterConeAngle; // 0xe0
	float AttenuationRadius; // 0xe4
	float SourceRadius; // 0xe8
	float SoftSourceRadius; // 0xec
	float SourceLength; // 0xf0
};

struct FTextSizingParameters {
	float DrawX; // 0x0
	float DrawY; // 0x4
	float DrawXL; // 0x8
	float DrawYL; // 0xc
	FVector2D Scaling; // 0x10
	UFont* DrawFont; // 0x18
	FVector2D SpacingAdjust; // 0x20
};

struct FNavDataConfig : FNavAgentProperties {
	FName Name; // 0x30
	FColor Color; // 0x38
	FVector DefaultQueryExtent; // 0x3c
	AActor* NavigationDataClass; // 0x48
	TSoftClassPtr<UObject> NavDataClass; // 0x50
};

struct FStaticMaterialLayersParameter : FStaticParameterBase {
	FMaterialLayersFunctions Value; // 0x28
};

struct FPropertyAccessCopyBatch {
	TArray<FPropertyAccessCopy> Copies; // 0x0
};

struct FAnimalsBoneDamageAdjusterConfig {
	FName BoneName; // 0x0
	float ShooterDamageMultiplier; // 0x8
	float MeleeDamageMultiplier; // 0xc
};

struct FCustomSoundSettingGroup : FTableRowBase {
	FCustomSoundSettingArray SoundSetting[0x2]; // 0x8
};

struct FEdGraphPinType {
	FName PinCategory; // 0x0
	FName PinSubCategory; // 0x8
	TWeakObjectPtr<UObject> PinSubCategoryObject; // 0x10
	FSimpleMemberReference PinSubCategoryMemberReference; // 0x18
	FEdGraphTerminalType PinValueType; // 0x38
	EPinContainerType ContainerType; // 0x54
	char bIsArray : 1; // 0x55
	char bIsReference : 1; // 0x55
	char bIsConst : 1; // 0x55
	char bIsWeakPointer : 1; // 0x55
	char bIsUObjectWrapper : 1; // 0x55
};

struct FQuartzTimeSignature {
	int32_t NumBeats; // 0x0
	EQuartzTimeSignatureQuantization BeatType; // 0x4
	TArray<FQuartzPulseOverrideStep> OptionalPulseOverride; // 0x8
};

struct FBigMapCityInfo : FTableRowBase {
	FText CityName; // 0x8
	FVector2D CityPostion; // 0x20
	FVector ActorLocation; // 0x28
};

struct FVoiceData {
	int32_t VoiceId; // 0x0
	float PitchSemiTones; // 0x4
};

struct FSolverCollisionFilterSettings {
	bool FilterEnabled; // 0x0
	float MinMass; // 0x4
	float MinSpeed; // 0x8
	float MinImpulse; // 0xc
};

struct FEventTrackKey {
	float Time; // 0x0
	FName EventName; // 0x4
};

struct FEnergyStructureGearConfig {
	float Speed; // 0x0
	float GearValue; // 0x4
};

struct FSourceEffectFilterSettings {
	ESourceEffectFilterCircuit FilterCircuit; // 0x0
	ESourceEffectFilterType FilterType; // 0x1
	float CutoffFrequency; // 0x4
	float FilterQ; // 0x8
	TArray<FSourceEffectFilterAudioBusModulationSettings> AudioBusModulation; // 0x10
};

struct FGuildEventSpawnDetail {
	float RandomWeight; // 0x0
	FGuildEventSpawnConfig SpawnConfig; // 0x8
};

struct FMagicLeapARPinObjectIdList {
	TSet<FString> ObjectIdList; // 0x0
};

struct FRadialDamageEvent : FDamageEvent {
	FRadialDamageParams Params; // 0x10
	FVector Origin; // 0x24
	TArray<FHitResult> ComponentHits; // 0x30
};

struct FElementID {
	int32_t IDValue; // 0x0
};

struct FNiagaraBool {
	int32_t Value; // 0x0
};

struct FMsgClientServerPassportMessage : FMessageBase {
	bool bHasPassport; // 0x8
	TArray<int32_t> ServerList; // 0x10
};

struct FGuildSingleServerData {
	TMap<FGuid, FGuildKPILog> MemberKPILogs; // 0x0
};

struct FSkillUIInfo : FTableRowBase {
	TSoftObjectPtr<UTexture2D> IconTexture; // 0x8
	FText TipsContent; // 0x30
	FText GuildTipsContent; // 0x48
	FText SkillName; // 0x60
	FText GuildSkillName; // 0x78
	TMap<FName, FText> SkillMultipy; // 0x90
	TMap<FName, bool> PercentageValue; // 0xe0
	FText SkillTypeName; // 0x130
	FText GetSkillExpType; // 0x148
};

struct FFunctionExpressionInput {
	UMaterialExpressionFunctionInput* ExpressionInput; // 0x0
	FGuid ExpressionInputId; // 0x8
	FExpressionInput Input; // 0x18
};

struct FSkeletalMeshLODGroupSettings {
	FPerPlatformFloat ScreenSize; // 0x0
	float LODHysteresis; // 0x4
	EBoneFilterActionOption BoneFilterActionOption; // 0x8
	TArray<FBoneFilter> BoneList; // 0x10
	TArray<FName> BonesToPrioritize; // 0x20
	float WeightOfPrioritization; // 0x30
	UAnimSequence* BakePose; // 0x38
	FSkeletalMeshOptimizationSettings ReductionSettings; // 0x40
};

struct FAnimNode_ConvertComponentToLocalSpace : FAnimNode_Base {
	FComponentSpacePoseLink ComponentPose; // 0x10
};

struct FGameplayCueObjectLibrary {
	TArray<FString> Paths; // 0x0
	UObjectLibrary* ActorObjectLibrary; // 0x30
	UObjectLibrary* StaticObjectLibrary; // 0x38
	UGameplayCueSet* CueSet; // 0x40
	bool bShouldSyncScan; // 0x4c
	bool bShouldAsyncLoad; // 0x4d
	bool bShouldSyncLoad; // 0x4e
	bool bHasBeenInitialized; // 0x4f
};

struct FRawDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FKShapeElem {
	float RestOffset; // 0x8
	FName Name; // 0xc
	char bContributeToMass : 1; // 0x18
	ECollisionEnabled CollisionEnabled; // 0x19
	UPhysicalMaterial* Material; // 0x30
};

struct FCustomMeshTriangle {
	FVector Vertex0; // 0x0
	FVector Vertex1; // 0xc
	FVector Vertex2; // 0x18
};

struct FGeneralConfig {
	char bUseRandomMoving : 1; // 0x0
	float FollowerSpeedLimit; // 0x4
	float FollowDeltaAngle; // 0x8
	float FollowDeltaDistance; // 0xc
	float FollowDeltaDistanceForSpawner; // 0x10
	float FormationDeltaStopDistance; // 0x14
	float RiderDistance; // 0x18
	TArray<UAnimMontage*> RelaxedMontages; // 0x20
};

struct FGraphReference {
	UEdGraph* MacroGraph; // 0x0
	UBlueprint* GraphBlueprint; // 0x8
	FGuid GraphGuid; // 0x10
};

struct FRandomWeightAnim {
	UAnimSequence* BehaviorAnim; // 0x0
	float RandomWeight; // 0x8
};

struct FMovieSceneEvaluationFieldEntityKey {
	TWeakObjectPtr<UObject> EntityOwner; // 0x0
	uint32_t EntityID; // 0x8
};

struct FIntervalCountdown {
	float Interval; // 0x0
};

struct FWeightmapData {
	TArray<UTexture2D*> Textures; // 0x0
	TArray<FWeightmapLayerAllocationInfo> LayerAllocations; // 0x10
	TArray<ULandscapeWeightmapUsage*> TextureUsages; // 0x20
};

struct FPoseLinkBase {
	int32_t LinkID; // 0x0
};

struct FInputRange {
	float Min; // 0x0
	float Max; // 0x4
};

struct FSpriteDrawCallRecord {
	FVector Destination; // 0x0
	UTexture* BaseTexture; // 0x10
	FColor Color; // 0x48
};

struct FNiagaraVariable : FNiagaraVariableBase {
	TArray<char> VarData; // 0x10
};

struct FAimConstraintDescription : FConstraintDescriptionEx {
	FAxis LookAt_Axis; // 0x10
	FAxis LookUp_Axis; // 0x20
	bool bUseLookUp; // 0x30
	FVector LookUpTarget; // 0x34
};

struct FLODMappingData {
	TArray<int32_t> Mapping; // 0x0
	TArray<int32_t> InverseMapping; // 0x10
};

struct FAITeamStimulusEvent {
	AActor* Broadcaster; // 0x28
	AActor* Enemy; // 0x30
};

struct FPreviewSlot {
	TWeakObjectPtr<AActor> PreviewActor; // 0x0
	TWeakObjectPtr<UActorComponent> PreviewComponent; // 0x8
	FBox BoundBox; // 0x10
	char ShowBlurs : 1; // 0x2c
	float KeepDistanceRatio; // 0x30
	FRotator KeepRotator; // 0x34
};

struct FInterpCurvePointVector2D {
	float InVal; // 0x0
	FVector2D OutVal; // 0x4
	FVector2D ArriveTangent; // 0xc
	FVector2D LeaveTangent; // 0x14
	EInterpCurveMode InterpMode; // 0x1c
};

struct FAnimUpdateRateParameters {
	EUpdateRateShiftBucket ShiftBucket; // 0x1
	char bInterpolateSkippedFrames : 1; // 0x2
	char bShouldUseLodMap : 1; // 0x2
	char bShouldUseMinLod : 1; // 0x2
	char bSkipUpdate : 1; // 0x2
	char bSkipEvaluation : 1; // 0x2
	int32_t UpdateRate; // 0x4
	int32_t EvaluationRate; // 0x8
	float TickedPoseOffestTime; // 0xc
	float AdditionalTime; // 0x10
	int32_t BaseNonRenderedUpdateRate; // 0x18
	int32_t MaxEvalRateForInterpolation; // 0x1c
	TArray<float> BaseVisibleDistanceFactorThesholds; // 0x20
	TMap<int32_t, int32_t> LODToFrameSkipMap; // 0x30
	int32_t SkippedUpdateFrames; // 0x80
	int32_t SkippedEvalFrames; // 0x84
};

struct FReplicatedPredictionKeyMap : FFastArraySerializer {
	TArray<FReplicatedPredictionKeyItem> PredictionKeys; // 0x108
};

struct FCameraLensSettings {
	float MinFocalLength; // 0x0
	float MaxFocalLength; // 0x4
	float MinFStop; // 0x8
	float MaxFStop; // 0xc
	float MinimumFocusDistance; // 0x10
	int32_t DiaphragmBladeCount; // 0x14
};

struct FItemCraftQueueEntry {
	USGItem* ItemTemplate; // 0x0
	FGuid UniqueId; // 0x8
	int32_t Quantity; // 0x18
	float RemaingCraftTime; // 0x1c
	float TotalRemainingCraftTime; // 0x20
	char bIsRepair : 1; // 0x24
	EItemQuality UseRemoveItemQuality; // 0x25
};

struct FARQRCodeUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	FVector Extents; // 0x50
	FString QRCode; // 0x60
};

struct FAnimalsAI_Config {
	char bAlwaysSetRotation : 1; // 0x0
	char bUseTurnInPlaceCurve : 1; // 0x0
	char bUseMovingTurnMontage : 1; // 0x0
	char bUseCustomBrakingDistance : 1; // 0x0
	float BrakingArchDirectionAngle; // 0x4
	FVector2D BrakingRotationAngle; // 0x8
	float BrakingAgainSpeed; // 0x10
	char bUseInPlaceAttackByMoving : 1; // 0x14
	float AttackRotationSpeed; // 0x18
	EAnimalsMovingGaitType Enum_DesertGaitType; // 0x1c
	EAnimalsMovingGaitType Enum_WanderGaitType; // 0x1d
	EAnimalsMovingGaitType Enum_FeedGaitType; // 0x1e
	EAnimalsMovingGaitType Enum_GotoSleepGaitType; // 0x1f
	EAnimalsMovingGaitType Enum_FleeGaitType; // 0x20
	EAnimalsMovingGaitType Enum_AttackGaitType; // 0x21
	EAnimalsMovingGaitType Enum_ChargeGaitType; // 0x22
	EAnimalsMovingGaitType Enum_FollowGaitType; // 0x23
	EAnimalsMovingGaitType Enum_MoveToDestLocStateType; // 0x24
	char bUseSwimGaitType : 1; // 0x25
	EAnimalsMovingGaitType Enum_SwimGaitType; // 0x26
	ECustomAiMovingStateType Enum_MovingStateType; // 0x27
};

struct FFilmStockSettings {
	float Slope; // 0x0
	float Toe; // 0x4
	float Shoulder; // 0x8
	float BlackClip; // 0xc
	float WhiteClip; // 0x10
};

struct FLiveLinkSourcePreset {
	FGuid Guid; // 0x0
	ULiveLinkSourceSettings* Settings; // 0x10
	FText SourceType; // 0x18
};

struct FAnimalsDeathAnims {
	TMap<EInputDirection, FAnimalsCustomDeathAnims> TMap_DeathMontages; // 0x0
};

struct FOreInfoData {
	ENaturalResType OreType; // 0x0
	FText OreDensityText; // 0x8
	int32_t OreDensityMin; // 0x20
	int32_t OreDensityMax; // 0x24
	float OreMapDensityMin; // 0x28
	float OreMapDensityMax; // 0x2c
};

struct FNiagaraDataInterfaceGPUParamInfo {
	FString DataInterfaceHLSLSymbol; // 0x0
	FString DIClassName; // 0x10
	TArray<FNiagaraDataInterfaceGeneratedFunction> GeneratedFunctions; // 0x20
};

struct FDestructibleAdvancedParameters {
	float DamageCap; // 0x0
	float ImpactVelocityThreshold; // 0x4
	float MaxChunkSpeed; // 0x8
	float FractureImpulseScale; // 0xc
};

struct FPurchaseConfirmation {
	FString PackageName; // 0x10
	PurchaseType Type; // 0x48
};

struct FVMFunctionSpecifier {
	FName Key; // 0x0
	FName Value; // 0x8
};

struct FEditorImportExportTestDefinition {
	FFilePath ImportFilePath; // 0x0
	FString ExportFileExtension; // 0x10
	bool bSkipExport; // 0x20
	TArray<FImportFactorySettingValues> FactorySettings; // 0x28
};

struct FMouthData {
	float MouthLipThin; // 0x0
	float MouthDepth; // 0x4
	float MouthHeight; // 0x8
	float MouthScale; // 0xc
	float MouthWidth; // 0x10
	float MouthLipLowerCurve; // 0x14
	float MouthLipSeamHeight; // 0x18
	float MouthLipUpperCurve; // 0x1c
	float MouthComerDepth; // 0x20
	float MouthLipCurve; // 0x24
	float MouthLipLowerScale; // 0x28
	float MouthLipUpperScale; // 0x2c
	float MouthPhitrumTone; // 0x30
};

struct FPrimaryAssetTypeInfo {
	FName PrimaryAssetType; // 0x0
	TSoftClassPtr<UObject> AssetBaseClass; // 0x8
	UObject* AssetBaseClassLoaded; // 0x30
	bool bHasBlueprintClasses; // 0x38
	bool bIsEditorOnly; // 0x39
	TArray<FDirectoryPath> Directories; // 0x40
	TArray<FSoftObjectPath> SpecificAssets; // 0x50
	FPrimaryAssetRules Rules; // 0x60
	TArray<FString> AssetScanPaths; // 0x70
	bool bIsDynamicAsset; // 0x80
	int32_t NumberOfAssets; // 0x84
};

struct FMaterialCachedParameters {
	FMaterialCachedParameterEntry RuntimeEntries[0x5]; // 0x0
	TArray<float> ScalarValues; // 0x140
	TArray<FLinearColor> VectorValues; // 0x150
	TArray<UTexture*> TextureValues; // 0x160
	TArray<UFont*> FontValues; // 0x170
	TArray<int32_t> FontPageValues; // 0x180
	TArray<URuntimeVirtualTexture*> RuntimeVirtualTextureValues; // 0x190
};

struct FNiagaraEventReceiverProperties {
	FName Name; // 0x0
	FName SourceEventGenerator; // 0x8
	FName SourceEmitter; // 0x10
};

struct FNiagaraPlatformSetConflictInfo {
	int32_t SetAIndex; // 0x0
	int32_t SetBIndex; // 0x4
	TArray<FNiagaraPlatformSetConflictEntry> Conflicts; // 0x8
};

struct FAIDynamicParam {
	FName ParamName; // 0x0
	EAIParamType ParamType; // 0x8
	float Value; // 0xc
	FBlackboardKeySelector BBKey; // 0x10
};

struct FColorParameterNameAndCurves {
	FName ParameterName; // 0x0
	FMovieSceneFloatChannel RedCurve; // 0x8
	FMovieSceneFloatChannel GreenCurve; // 0xa8
	FMovieSceneFloatChannel BlueCurve; // 0x148
	FMovieSceneFloatChannel AlphaCurve; // 0x1e8
};

struct FStructureCheckVolumeLocalizationRowBase : FTableRowBase {
	FString StructureCheckVolumeTag; // 0x8
	FText StructureCheckVolumeName; // 0x18
};

struct FNiagaraVariableAttributeBinding {
	FNiagaraVariableBase ParamMapVariable; // 0x0
	FNiagaraVariable DataSetVariable; // 0x10
	FNiagaraVariable RootVariable; // 0x30
	ENiagaraBindingSource BindingSourceMode; // 0x50
	char bBindingExistsOnSource : 1; // 0x54
	char bIsCachedParticleValue : 1; // 0x54
};

struct FLoadingScreenParams : FTableRowBase {
	FString BgImagePath; // 0x8
	FString FrontImagePath; // 0x18
	FText TipsContent; // 0x28
};

struct FBakedAnimationState {
	FName StateName; // 0x0
	TArray<FBakedStateExitTransition> Transitions; // 0x8
	int32_t StateRootNodeIndex; // 0x18
	int32_t StartNotify; // 0x1c
	int32_t EndNotify; // 0x20
	int32_t FullyBlendedNotify; // 0x24
	bool bIsAConduit; // 0x28
	int32_t EntryRuleNodeIndex; // 0x2c
	TArray<int32_t> PlayerNodeIndices; // 0x30
	TArray<int32_t> LayerNodeIndices; // 0x40
	bool bAlwaysResetOnEntry; // 0x50
};

struct FChaosPhysicsSettings {
	EChaosThreadingMode DefaultThreadingModel; // 0x0
	EChaosSolverTickMode DedicatedThreadTickMode; // 0x1
	EChaosBufferMode DedicatedThreadBufferMode; // 0x2
};

struct FMovieSceneColorSectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneFloatChannel Curves[0x4]; // 0x38
	EMovieSceneBlendType BlendType; // 0x2b8
};

struct FLandscapeLayerComponentData {
	FHeightmapData HeightmapData; // 0x0
	FWeightmapData WeightmapData; // 0x8
};

struct FChunkDataObjectInfo {
	TArray<char> ChunkBytes; // 0x0
};

struct FFrameTime {
	FFrameNumber FrameNumber; // 0x0
	float SubFrame; // 0x4
};

struct FSubmixEffectEQBand {
	float Frequency; // 0x0
	float Bandwidth; // 0x4
	float GainDb; // 0x8
	char bEnabled : 1; // 0xc
};

struct FMultiDestroyedMesh {
	FName DestroyedMeshName; // 0x0
	FSoftObjectPath DestructibleMesh; // 0x8
};

struct FNiagaraGraphViewSettings {
	FVector2D Location; // 0x0
	float Zoom; // 0x8
	bool bIsValid; // 0xc
};

struct FNiagaraHalfVector4 {
	uint16_t X; // 0x0
	uint16_t Y; // 0x2
	uint16_t Z; // 0x4
	uint16_t W; // 0x6
};

struct FHorizonDialogueLineInfo {
	int32_t CurrentDialogueBlockIndex; // 0x0
	int32_t MaxLineHeight; // 0x4
	int32_t LineWidth; // 0x8
	TArray<FHorizonDialogueBlockInfo> DialogueBlockInfoList; // 0x10
	FVector2D position; // 0x20
	bool bNewPage; // 0x28
};

struct FLiveLinkTimeCode_Base_DEPRECATED {
	int32_t Seconds; // 0x0
	int32_t Frames; // 0x4
	FLiveLinkFrameRate FrameRate; // 0x8
};

struct FGuildLevelConfig {
	int32_t MaxMemeberCount; // 0x0
	int32_t MaxManagerCount; // 0x4
	int32_t MaxViceCaptainCount; // 0x8
	int32_t UpgradePoint; // 0xc
	int32_t MaxOccupyLimitTotalNum; // 0x10
	int32_t MaxOccupyLimitTotalPrice; // 0x14
};

struct FQuartzPulseOverrideStep {
	int32_t NumberOfPulses; // 0x0
	EQuartzCommandQuantization PulseDuration; // 0x4
};

struct FMeshProxySettings {
	int32_t ScreenSize; // 0x0
	float VoxelSize; // 0x4
	FMaterialProxySettings MaterialSettings; // 0x8
	float MergeDistance; // 0x90
	FColor UnresolvedGeometryColor; // 0x94
	float MaxRayCastDist; // 0x98
	float HardAngleThreshold; // 0x9c
	int32_t LightMapResolution; // 0xa0
	EProxyNormalComputationMethod NormalCalculationMethod; // 0xa4
	ELandscapeCullingPrecision LandscapeCullingPrecision; // 0xa5
	char bCalculateCorrectLODModel : 1; // 0xa6
	char bOverrideVoxelSize : 1; // 0xa6
	char bOverrideTransferDistance : 1; // 0xa6
	char bUseHardAngleThreshold : 1; // 0xa6
	char bComputeLightMapResolution : 1; // 0xa6
	char bRecalculateNormals : 1; // 0xa6
	char bUseLandscapeCulling : 1; // 0xa6
	char bAllowAdjacency : 1; // 0xa6
	char bAllowDistanceField : 1; // 0xa7
	char bReuseMeshLightmapUVs : 1; // 0xa7
	char bCreateCollision : 1; // 0xa7
	char bAllowVertexColors : 1; // 0xa7
	char bGenerateLightmapUVs : 1; // 0xa7
};

struct FSeasonRewardItemState {
	int32_t SeasonLevel; // 0x0
	ESeasonRewardState SeasonPassportReward1State; // 0x4
	ESeasonRewardState SeasonPassportReward2State; // 0x5
	ESeasonRewardState SeasonRewardState; // 0x6
};

struct FAnimNode_SkeletalControlBase : FAnimNode_Base {
	FComponentSpacePoseLink ComponentPose; // 0x10
	int32_t LODThreshold; // 0x20
	float ActualAlpha; // 0x24
	EAnimAlphaInputType AlphaInputType; // 0x28
	bool bAlphaBoolEnabled; // 0x29
	float Alpha; // 0x2c
	FInputScaleBias AlphaScaleBias; // 0x30
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x38
	FName AlphaCurveName; // 0x80
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x88
};

struct FARMeshUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	EARObjectClassification ObjectClassification; // 0x50
};

struct FNiagaraEmitterHandle {
	FGuid ID; // 0x0
	FName IdName; // 0x10
	bool bIsEnabled; // 0x18
	FName Name; // 0x1c
	UNiagaraEmitter* Instance; // 0x28
};

struct FARFilter {
	TArray<FName> PackageNames; // 0x0
	TArray<FName> PackagePaths; // 0x10
	TArray<FName> ObjectPaths; // 0x20
	TArray<FName> ClassNames; // 0x30
	TSet<FName> RecursiveClassesExclusionSet; // 0x90
	bool bRecursivePaths; // 0xe0
	bool bRecursiveClasses; // 0xe1
	bool bIncludeOnlyOnDiskAssets; // 0xe2
};

struct FARPlaneUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FTransform WorldTransform; // 0x20
	FVector Center; // 0x50
	FVector Extents; // 0x5c
	TArray<FVector> BoundaryVertices; // 0x68
	EARObjectClassification ObjectClassification; // 0x78
};

struct FMoveSeatingCharSeatInfo {
	EMoveSeatingCharSeatType SeatType; // 0x0
	int32_t PowerSeatIndex; // 0x4
	int32_t NormalSeatIndex; // 0x8
	int32_t PowerInfoIndex; // 0xc
};

struct FLevelSequenceBindingReferences {
	TMap<FGuid, FLevelSequenceBindingReferenceArray> BindingIdToReferences; // 0x0
	TSet<FGuid> AnimSequenceInstances; // 0x50
};

struct FActiveGameplayEffectsContainer : FFastArraySerializer {
	TArray<FActiveGameplayEffect> GameplayEffects_Internal; // 0x130
	TArray<UGameplayEffect*> ApplicationImmunityQueryEffects; // 0x450
};

struct FMovieSceneTrackInstanceInput {
	UMovieSceneSection* Section; // 0x0
};

struct FPlanarLimit : FCollisionLimitBase {
	FPlane Plane; // 0x50
};

struct FHairStretchConstraint {
	bool SolveStretch; // 0x0
	bool ProjectStretch; // 0x1
	float StretchDamping; // 0x4
	float StretchStiffness; // 0x8
	FRuntimeFloatCurve StretchScale; // 0x10
};

struct FSubdivisionLimitData {
	TArray<FVector> VertexPositions; // 0x0
	TArray<FSubdivisionLimitSection> Sections; // 0x10
	TArray<FSubdividedWireEdge> SubdividedWireEdges; // 0x20
};

struct FAnimalAppearanceStruct {
	TArray<UMaterialInterface*> SkinMaterials; // 0x0
	TArray<int32_t> SkinHuaSeBaseTextureIndexs; // 0x10
	TArray<int32_t> SkinHuaSeMaskTextureIndexs; // 0x20
	float SkinRoughness; // 0x30
	EAnimalFurColorType SkinColorType; // 0x34
	float FurRoughness; // 0x38
	FLinearColor FurRootColorMin; // 0x3c
	FLinearColor FurRootColorMax; // 0x4c
	char bEnableFurTipColor : 1; // 0x5c
	FLinearColor FurTipColorMin; // 0x60
	FLinearColor FurTipColorMax; // 0x70
	char bEnableFurDyeColor : 1; // 0x80
	FLinearColor FurDyeColorMin; // 0x84
	FLinearColor FurDyeColorMax; // 0x94
	float GroomMelaninVariationFine; // 0xa4
	float GroomFurRoughness; // 0xa8
};

struct FSupportedAreaData {
	FString AreaClassName; // 0x0
	int32_t AreaID; // 0x10
	UObject* AreaClass; // 0x18
};

struct FSocketReference {
	FName SocketName; // 0x30
};

struct FRigTransformConstraint {
	EConstraintTransform TranformType; // 0x0
	FName ParentSpace; // 0x4
	float Weight; // 0xc
};

struct FLaunchOnTestSettings {
	FFilePath LaunchOnTestmap; // 0x0
	FString DeviceID; // 0x10
};

struct FNiagaraEmitterScalabilitySettingsArray {
	TArray<FNiagaraEmitterScalabilitySettings> Settings; // 0x0
};

struct FOverlayItem {
	FTimespan StartTime; // 0x0
	FTimespan EndTime; // 0x8
	FString Text; // 0x10
	FVector2D position; // 0x20
};

struct FBatchedLine {
	FVector Start; // 0x0
	FVector End; // 0xc
	FLinearColor Color; // 0x18
	float Thickness; // 0x28
	float RemainingLifeTime; // 0x2c
	char DepthPriority; // 0x30
};

struct FNiagaraVariant {
	UObject* Object; // 0x0
	UNiagaraDataInterface* DataInterface; // 0x8
	TArray<char> Bytes; // 0x10
	ENiagaraVariantMode CurrentMode; // 0x20
};

struct FSkelMeshMergeUVTransformMapping {
	TArray<FSkelMeshMergeUVTransform> UVTransformsPerMesh; // 0x0
};

struct FAREnvironmentProbeUpdatePayload {
	FTransform WorldTransform; // 0x0
};

struct FDropRuleInfo {
	float Weight; // 0x0
	float FinalWeight; // 0x4
	USGItem* ItemClass; // 0x8
	int32_t MinNum; // 0x10
	int32_t MaxNum; // 0x14
	EItemQuality Quality; // 0x18
};

struct FTattooMaterialDataGroup {
	TArray<FTattooMaterialData> TattooMaterialDatas; // 0x0
	int32_t TattoTimes; // 0x10
	int32_t TattoLeftTimes; // 0x14
	int32_t TattoRightTimes; // 0x18
};

struct FSkelMeshSkinWeightInfo {
	int32_t Bones[0xc]; // 0x0
	char Weights[0xc]; // 0x30
};

struct FMovieSceneBindingOverrideData {
	FMovieSceneObjectBindingID ObjectBindingId; // 0x0
	TWeakObjectPtr<UObject> Object; // 0x18
	bool bOverridesDefault; // 0x20
};

struct FBakedIntegerCustomAttribute {
	FName AttributeName; // 0x0
	FIntegralCurve IntCurve; // 0x8
};

struct FInAppPurchaseProductInfo {
	FString Identifier; // 0x0
	FString TransactionIdentifier; // 0x10
	FString DisplayName; // 0x20
	FString DisplayDescription; // 0x30
	FString DisplayPrice; // 0x40
	float RawPrice; // 0x50
	FString CurrencyCode; // 0x58
	FString CurrencySymbol; // 0x68
	FString DecimalSeparator; // 0x78
	FString GroupingSeparator; // 0x88
	FString ReceiptData; // 0x98
};

struct FBoneMirrorInfo {
	int32_t SourceIndex; // 0x0
	EAxis BoneFlipAxis; // 0x4
};

struct FMaterialProxySettings {
	FIntPoint TextureSize; // 0x0
	float GutterSpace; // 0x8
	float MetallicConstant; // 0xc
	float RoughnessConstant; // 0x10
	float AnisotropyConstant; // 0x14
	float SpecularConstant; // 0x18
	float OpacityConstant; // 0x1c
	float OpacityMaskConstant; // 0x20
	float AmbientOcclusionConstant; // 0x24
	ETextureSizingType TextureSizingType; // 0x28
	EMaterialMergeType MaterialMergeType; // 0x29
	EBlendMode BlendMode; // 0x2a
	char bAllowTwoSidedMaterial : 1; // 0x2b
	char bNormalMap : 1; // 0x2b
	char bTangentMap : 1; // 0x2b
	char bMetallicMap : 1; // 0x2b
	char bRoughnessMap : 1; // 0x2b
	char bAnisotropyMap : 1; // 0x2b
	char bSpecularMap : 1; // 0x2b
	char bEmissiveMap : 1; // 0x2b
	char bOpacityMap : 1; // 0x2c
	char bOpacityMaskMap : 1; // 0x2c
	char bAmbientOcclusionMap : 1; // 0x2c
	FIntPoint DiffuseTextureSize; // 0x30
	FIntPoint NormalTextureSize; // 0x38
	FIntPoint TangentTextureSize; // 0x40
	FIntPoint MetallicTextureSize; // 0x48
	FIntPoint RoughnessTextureSize; // 0x50
	FIntPoint AnisotropyTextureSize; // 0x58
	FIntPoint SpecularTextureSize; // 0x60
	FIntPoint EmissiveTextureSize; // 0x68
	FIntPoint OpacityTextureSize; // 0x70
	FIntPoint OpacityMaskTextureSize; // 0x78
	FIntPoint AmbientOcclusionTextureSize; // 0x80
};

struct FSubmixEffectDynamicsProcessorSettings {
	ESubmixEffectDynamicsProcessorType DynamicsProcessorType; // 0x0
	ESubmixEffectDynamicsPeakMode PeakMode; // 0x1
	ESubmixEffectDynamicsChannelLinkMode LinkMode; // 0x2
	float InputGainDb; // 0x4
	float ThresholdDb; // 0x8
	float Ratio; // 0xc
	float KneeBandwidthDb; // 0x10
	float LookAheadMsec; // 0x14
	float AttackTimeMsec; // 0x18
	float ReleaseTimeMsec; // 0x1c
	USoundSubmix* ExternalSubmix; // 0x20
	char bChannelLinked : 1; // 0x28
	char bAnalogMode : 1; // 0x28
	char bKeyAudition : 1; // 0x28
	float KeyGainDb; // 0x2c
	float OutputGainDb; // 0x30
	FSubmixEffectDynamicProcessorFilterSettings KeyHighshelf; // 0x34
	FSubmixEffectDynamicProcessorFilterSettings KeyLowshelf; // 0x40
};

struct FNews_GiveMoney : FNewsBase {
	int32_t State; // 0x18
	FString CharacterName; // 0x20
	int32_t GiveMoneyAmount; // 0x30
};

struct FGuildStructureShowData : FTableRowBase {
	ASGStructure* StructureClass; // 0x8
};

struct FHyperlinkStyle : FSlateWidgetStyle {
	FButtonStyle UnderlineStyle; // 0x8
	FTextBlockStyle TextStyle; // 0x280
	FMargin Padding; // 0x4f0
};

struct FInstrumentAnimType {
	UAnimMontage* BeatLMontage; // 0x0
	UAnimMontage* BeatRMontage; // 0x8
	UAnimSequence* IdleAnim; // 0x10
};

struct FSoundClassAdjuster {
	USoundClass* SoundClassObject; // 0x0
	float VolumeAdjuster; // 0x8
	float PitchAdjuster; // 0xc
	float LowPassFilterFrequency; // 0x10
	char bApplyToChildren : 1; // 0x14
	float VoiceCenterChannelVolumeAdjuster; // 0x18
};

struct FMagicLeapARPinQuery {
	TSet<EMagicLeapARPinType> Types; // 0x0
	int32_t MaxResults; // 0x50
	FVector TargetPoint; // 0x54
	float Radius; // 0x60
	bool bSorted; // 0x64
};

struct FMsgRecord_GetXianChengOwner : FMsgRecordBase {
	FString OwnerName; // 0x10
	int32_t XianChengKey; // 0x20
};

struct FBoolTrackKey {
	float Time; // 0x0
	char Value : 1; // 0x4
};

struct FModularSynthPreset : FTableRowBase {
	char bEnablePolyphony : 1; // 0x8
	ESynth1OscType Osc1Type; // 0xc
	float Osc1Gain; // 0x10
	float Osc1Octave; // 0x14
	float Osc1Semitones; // 0x18
	float Osc1Cents; // 0x1c
	float Osc1PulseWidth; // 0x20
	ESynth1OscType Osc2Type; // 0x24
	float Osc2Gain; // 0x28
	float Osc2Octave; // 0x2c
	float Osc2Semitones; // 0x30
	float Osc2Cents; // 0x34
	float Osc2PulseWidth; // 0x38
	float Portamento; // 0x3c
	char bEnableUnison : 1; // 0x40
	char bEnableOscillatorSync : 1; // 0x40
	float Spread; // 0x44
	float Pan; // 0x48
	float LFO1Frequency; // 0x4c
	float LFO1Gain; // 0x50
	ESynthLFOType LFO1Type; // 0x54
	ESynthLFOMode LFO1Mode; // 0x55
	ESynthLFOPatchType LFO1PatchType; // 0x56
	float LFO2Frequency; // 0x58
	float LFO2Gain; // 0x5c
	ESynthLFOType LFO2Type; // 0x60
	ESynthLFOMode LFO2Mode; // 0x61
	ESynthLFOPatchType LFO2PatchType; // 0x62
	float GainDb; // 0x64
	float AttackTime; // 0x68
	float DecayTime; // 0x6c
	float SustainGain; // 0x70
	float ReleaseTime; // 0x74
	ESynthModEnvPatch ModEnvPatchType; // 0x78
	ESynthModEnvBiasPatch ModEnvBiasPatchType; // 0x79
	char bInvertModulationEnvelope : 1; // 0x7c
	char bInvertModulationEnvelopeBias : 1; // 0x7c
	float ModulationEnvelopeDepth; // 0x80
	float ModulationEnvelopeAttackTime; // 0x84
	float ModulationEnvelopeDecayTime; // 0x88
	float ModulationEnvelopeSustainGain; // 0x8c
	float ModulationEnvelopeReleaseTime; // 0x90
	char bLegato : 1; // 0x94
	char bRetrigger : 1; // 0x94
	float FilterFrequency; // 0x98
	float FilterQ; // 0x9c
	ESynthFilterType FilterType; // 0xa0
	ESynthFilterAlgorithm FilterAlgorithm; // 0xa1
	char bStereoDelayEnabled : 1; // 0xa4
	ESynthStereoDelayMode StereoDelayMode; // 0xa8
	float StereoDelayTime; // 0xac
	float StereoDelayFeedback; // 0xb0
	float StereoDelayWetlevel; // 0xb4
	float StereoDelayRatio; // 0xb8
	char bChorusEnabled : 1; // 0xbc
	float ChorusDepth; // 0xc0
	float ChorusFeedback; // 0xc4
	float ChorusFrequency; // 0xc8
	TArray<FEpicSynth1Patch> Patches; // 0xd0
};

struct FAnimalTameCageConfig {
	ASG_AnimalsCharacter* AnimalTemplate; // 0x0
	float AddTameMul; // 0x8
};

struct FMovieScenePropertySectionData {
	FName PropertyName; // 0x0
	FString PropertyPath; // 0x8
};

struct FActorSequenceObjectReferenceMap {
	TArray<FGuid> BindingIds; // 0x0
	TArray<FActorSequenceObjectReferences> References; // 0x10
};

struct FBlendBoneByChannelEntry {
	FBoneReference SourceBone; // 0x0
	FBoneReference TargetBone; // 0x10
	bool bBlendTranslation; // 0x20
	bool bBlendRotation; // 0x21
	bool bBlendScale; // 0x22
};

struct FAnimNode_AssetPlayerBase : FAnimNode_Base {
	FName GroupName; // 0x10
	EAnimGroupRole GroupRole; // 0x18
	EAnimSyncGroupScope GroupScope; // 0x19
	bool bIgnoreForRelevancyTest; // 0x1a
	float BlendWeight; // 0x1c
	float InternalTimeAccumulator; // 0x20
};

struct FMinimalGameplayCueReplicationProxy {
	UAbilitySystemComponent* Owner; // 0x1b0
};

struct FIgnoreActorData {
	char bIgnore : 1; // 0x0
	TWeakObjectPtr<AActor> BehaviorActor; // 0x4
};

struct FDirectionMontage {
	TArray<UAnimMontage*> ForwardMontages; // 0x0
	TArray<UAnimMontage*> BackwardMontages; // 0x10
	TArray<UAnimMontage*> LeftMontages; // 0x20
	TArray<UAnimMontage*> RightMontages; // 0x30
};

struct FAudioComponentParam {
	FName ParamName; // 0x0
	float FloatParam; // 0x8
	bool BoolParam; // 0xc
	int32_t IntParam; // 0x10
	USoundWave* SoundWaveParam; // 0x18
};

struct FSourceEffectBitCrusherBaseSettings {
	float SampleRate; // 0x0
	float BitDepth; // 0x4
};

struct FGerstnerWave {
	float WaveLength; // 0x0
	float Amplitude; // 0x4
	float Steepness; // 0x8
	FVector Direction; // 0xc
	FVector2D WaveVector; // 0x18
	float WaveSpeed; // 0x20
	float WKA; // 0x24
	float Q; // 0x28
	float PhaseOffset; // 0x2c
};

struct FEngineServiceAuthDeny {
	FString UserName; // 0x0
	FString UserToDeny; // 0x10
};

struct FWidgetNavigationData {
	EUINavigationRule Rule; // 0x0
	FName WidgetToFocus; // 0x4
	TWeakObjectPtr<UWidget> Widget; // 0xc
	FDelegate CustomDelegate; // 0x14
};

struct FAnimationNotifyTask {
	EAnimationNotifyType NotifyType; // 0x0
	TArray<FGenericParam> NotifyParam; // 0x8
};

struct FVehicleGearData {
	float Ratio; // 0x0
	float DownRatio; // 0x4
	float UpRatio; // 0x8
};

struct FSplineSoundAttenuationSettings {
	float SplineRangeX; // 0x0
	float SplineRangeY; // 0x4
	FSoundAttenuationSettings SplineAttenuationSettings; // 0x8
};

struct FMsgRecord_Drop : FMsgRecordBase {
	FString PlayerName; // 0x10
	FVector Location; // 0x20
};

struct FArtofWarItem {
	int32_t PerkIndex; // 0x0
	float LearnPercent; // 0x4
	int32_t LearnExp; // 0x8
};

struct FPlane : FVector {
	float W; // 0xc
};

struct FProtectTimeRange {
	FDateTime ProtectHeadDate; // 0x0
	FDateTime StartHour; // 0x8
	FDateTime EndHour; // 0x10
	FDateTime OtherStartHour; // 0x18
	FDateTime OtherEndHour; // 0x20
};

struct FMovieSceneNiagaraParameterSectionTemplate : FMovieSceneEvalTemplate {
	FNiagaraVariable Parameter; // 0x20
};

struct FHairMaterialConstraints {
	FHairBendConstraint BendConstraint; // 0x0
	FHairStretchConstraint StretchConstraint; // 0x98
	FHairCollisionConstraint CollisionConstraint; // 0x130
};

struct FCameraFocusSettings {
	ECameraFocusMethod FocusMethod; // 0x0
	float ManualFocusDistance; // 0x4
	FCameraTrackingFocusSettings TrackingFocusSettings; // 0x8
	char bDrawDebugFocusPlane : 1; // 0x40
	FColor DebugFocusPlaneColor; // 0x44
	char bSmoothFocusChanges : 1; // 0x48
	float FocusSmoothingInterpSpeed; // 0x4c
	float FocusOffset; // 0x50
};

struct FWaterBodyWeightmapSettings {
	float FalloffWidth; // 0x0
	float EdgeOffset; // 0x4
	UTexture2D* ModulationTexture; // 0x8
	float TextureTiling; // 0x10
	float TextureInfluence; // 0x14
	float Midpoint; // 0x18
	float FinalOpacity; // 0x1c
};

struct FTimecode {
	int32_t Hours; // 0x0
	int32_t Minutes; // 0x4
	int32_t Seconds; // 0x8
	int32_t Frames; // 0xc
	bool bDropFrameFormat; // 0x10
};

struct FLightingChannels {
	char bChannel0 : 1; // 0x0
	char bChannel1 : 1; // 0x0
	char bChannel2 : 1; // 0x0
};

struct FPrecomputedLightInstanceData : FSceneComponentInstanceData {
	FTransform Transform; // 0xc0
	FGuid LightGuid; // 0xf0
	int32_t PreviewShadowMapChannel; // 0x100
};

struct FDeathDropItemData {
	int32_t DropWrapperId; // 0x0
	float DropWrapperFactor; // 0x4
	float DropWrapperWeight; // 0x8
};

struct FTwistConstraint : FConstraintBaseParams {
	float TwistLimitDegrees; // 0x14
	EAngularConstraintMotion TwistMotion; // 0x18
};

struct FShapedTextOptions {
	char bOverride_TextShapingMethod : 1; // 0x0
	char bOverride_TextFlowDirection : 1; // 0x0
	ETextShapingMethod TextShapingMethod; // 0x1
	ETextFlowDirection TextFlowDirection; // 0x2
};

struct FLiveLinkInterpolationSettings {
	bool bUseInterpolation; // 0x0
	float InterpolationOffset; // 0x4
};

struct FDamageExploitEntry {
	int32_t DropWrapperId; // 0x0
	float DropWrapperFactor; // 0x4
	float DamageMultilier; // 0x8
	float ExploitQuantityMultilier; // 0xc
	UDamageType* DamageTypeParent; // 0x10
};

struct FMaterialTextureInfo {
	float SamplingScale; // 0x0
	int32_t UVChannelIndex; // 0x4
	FName TextureName; // 0x8
};

struct FScalableFloat {
	float Value; // 0x0
	FCurveTableRowHandle Curve; // 0x8
};

struct FMovieSceneEvaluationFieldSharedEntityMetaData {
	FGuid ObjectBindingId; // 0x0
};

struct FEquirectProps {
	FBox2D LeftUVRect; // 0x0
	FBox2D RightUVRect; // 0x14
	FVector2D LeftScale; // 0x28
	FVector2D RightScale; // 0x30
	FVector2D LeftBias; // 0x38
	FVector2D RightBias; // 0x40
};

struct FChaosPhysicsCollisionInfo {
	UPrimitiveComponent* Component; // 0x0
	UPrimitiveComponent* OtherComponent; // 0x8
	FVector Location; // 0x10
	FVector Normal; // 0x1c
	FVector AccumulatedImpulse; // 0x28
	FVector Velocity; // 0x34
	FVector OtherVelocity; // 0x40
	FVector AngularVelocity; // 0x4c
	FVector OtherAngularVelocity; // 0x58
	float Mass; // 0x64
	float OtherMass; // 0x68
};

struct FInterpCurveLinearColor {
	TArray<FInterpCurvePointLinearColor> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FInputActionKeyMapping {
	FName ActionName; // 0x0
	char bShift : 1; // 0x8
	char bCtrl : 1; // 0x8
	char bAlt : 1; // 0x8
	char bCmd : 1; // 0x8
	FKey Key; // 0x10
};

struct FStructureMusicInfo {
	FName ComponentTagName; // 0x0
	FName SoundID; // 0x8
	FName AnotherSoundID; // 0x10
};

struct FAO_Parameters {
	FString EnableAO_4_402B20584E745E3C12F1B7AF7AA87854; // 0x0
	FString AOEnableMaterial_5_CC7E87EA478E0E374391B688FD73F056; // 0x10
	FString AOEnableTwoSideGeometry_6_C6D7C81641885C9241D31F8F7FDB1BFD; // 0x20
	FString AOSPP_10_2666C0F2490AC980438465B1B37CDDDC; // 0x30
	FString AODenoiserHistoryConvolutionSampleCount_13_50EF88A94EC31AFC5F939FA82C735B40; // 0x40
};

struct FLightningPattern {
	TArray<FVector> Points; // 0x0
	float Length; // 0x20
	FLightningSparkData SparkData; // 0x28
};

struct FBasicParticleData {
	FVector position; // 0x0
	float Size; // 0xc
	FVector Velocity; // 0x10
};

struct FSubmixEffectFilterSettings {
	ESubmixFilterType FilterType; // 0x0
	ESubmixFilterAlgorithm FilterAlgorithm; // 0x1
	float FilterFrequency; // 0x4
	float FilterQ; // 0x8
};

struct FCachedPoseIndices {
	TArray<int32_t> OrderedSavedPoseNodeIndices; // 0x0
};

struct FMagicLeapPlaneResult {
	FVector PlanePosition; // 0x0
	FRotator PlaneOrientation; // 0xc
	FRotator ContentOrientation; // 0x18
	FVector2D PlaneDimensions; // 0x24
	TArray<EMagicLeapPlaneQueryFlags> PlaneFlags; // 0x30
	FGuid ID; // 0x40
	FGuid InnerID; // 0x50
};

struct FNiagaraUserParameterBinding {
	FNiagaraVariable Parameter; // 0x0
};

struct FMsgRecord_LoseXianChengOwner : FMsgRecordBase {
	int32_t XianChengKey; // 0x10
};

struct FPaperTileMetadata {
	FName UserDataName; // 0x0
	FSpriteGeometryCollection CollisionData; // 0x8
	char TerrainMembership[0x4]; // 0x38
};

struct FMovieSceneCameraShakeSectionData {
	UMatineeCameraShake* ShakeClass; // 0x0
	float PlayScale; // 0x8
	ECameraShakePlaySpace PlaySpace; // 0xc
	FRotator UserDefinedPlaySpace; // 0x10
};

struct FAnimalsIdleAnims {
	UAimOffsetBlendSpace* AO; // 0x0
	FAnimalsIdlePoseAnims IdlePoseAnims; // 0x8
};

struct FVolumeControlStyle : FSlateWidgetStyle {
	FSliderStyle SliderStyle; // 0x8
	FSlateBrush HighVolumeImage; // 0x348
	FSlateBrush MidVolumeImage; // 0x3d0
	FSlateBrush LowVolumeImage; // 0x458
	FSlateBrush NoVolumeImage; // 0x4e0
	FSlateBrush MutedImage; // 0x568
};

struct FSSGI_Parameters {
	FString EnableSSGI_4_C294043E4CB2B46CA45BF99212AA105C; // 0x0
	FString HalfResSSGI_5_5FA2CB274DBF837A03F3C9A50E1ADC99; // 0x10
	FString SSGIQuality_6_B72077DC4A7D2BAEA26241A31589324F; // 0x20
};

struct FGroomComponentInstance {
	UGroomComponent* GroomComponent; // 0x0
	FName SocketToAttachTo; // 0x8
	FVector LocationOffset; // 0x10
	FRotator RotatorOffset; // 0x1c
	TMap<FName, FMaterialParamGroup> ApplyRootMaterialParams; // 0x28
};

struct FDisable {
	FAO_Parameters AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7; // 0x0
	FDebug_Parameters Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698; // 0x50
	FGI_Parameters GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C; // 0x168
	FLandscapeAndFoliage_Parameter LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x378
	FReflection_Parameters Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x458
	FShadow_Parameters Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684; // 0x588
	FSkyLight_Parameters SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC; // 0x6a8
	FSSGI_Parameters SSGI_Parameters_305_9CC406044A818EB967A668A89E2BCB07; // 0x748
	FTranslucency_Parameters Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x778
	FWater_Caustics_Parameters WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x8b8
	FMesh_Caustics_Parameters MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0xa68
	FDLSS_Parameters DLSSParameters_310_D94EF156432B307677D00680EBDF73B8; // 0xbc8
	FDistanceField_Parameters DistanceFields_313_D6D0FFFF4CE6CCAFADA97E8F86AF1866; // 0xc80
	FRTX_PostProcess_Settings RTXPostProcessSettings_316_96E0621447558B5C83E4DE968475A475; // 0xcc0
	FDataType_Support DataTypeSupport_319_ED1531394D2DB4B27AA1D6ACE79150FD; // 0x1230
};

struct FGameRecordData {
	FString DataName; // 0x0
	char bShouldShowGameRecordData : 1; // 0x10
	FColor ShowColor; // 0x14
};

struct FWaterBrushEffectDisplacement {
	float DisplacementHeight; // 0x0
	float DisplacementTiling; // 0x4
	UTexture2D* Texture; // 0x8
	float Midpoint; // 0x10
	FLinearColor Channel; // 0x14
	float WeightmapInfluence; // 0x24
};

struct FPreviewCharacterStruct {
	TWeakObjectPtr<ACharacter> PreviewCharacter; // 0x0
	TWeakObjectPtr<AActor> PreviewActor; // 0x8
	TWeakObjectPtr<USkeletalMeshComponent> PreviewMesh; // 0x10
	TArray<TWeakObjectPtr<USceneComponent>> PreviewComponents; // 0x18
	TArray<TWeakObjectPtr<AActor>> PreviewSubActors; // 0x28
	TWeakObjectPtr<ASceneCapture2D> PreviewSceneCapture2D; // 0x38
};

struct FPropertyPathSegment {
	FName Name; // 0x0
	int32_t ArrayIndex; // 0x8
	UStruct* Struct; // 0x10
};

struct FGameplayCueTranslationManager {
	TArray<FGameplayCueTranslatorNode> TranslationLUT; // 0x0
	TMap<FName, FGameplayCueTranslatorNodeIndex> TranslationNameToIndexMap; // 0x10
	UGameplayTagsManager* TagManager; // 0x60
};

struct FAchievementDamageMultiply {
	FString DamageMultiplyName; // 0x0
	float DamageMultiply; // 0x10
};

struct FFrameNumber {
	int32_t Value; // 0x0
};

struct FRecastNavMeshGenerationProperties {
	int32_t TilePoolSize; // 0x0
	float TileSizeUU; // 0x4
	float CellSize; // 0x8
	float CellHeight; // 0xc
	float AgentRadius; // 0x10
	float AgentHeight; // 0x14
	float AgentMaxSlope; // 0x18
	float AgentMaxStepHeight; // 0x1c
	float MinRegionArea; // 0x20
	float MergeRegionSize; // 0x24
	float MaxSimplificationError; // 0x28
	int32_t TileNumberHardLimit; // 0x2c
	ERecastPartitioning RegionPartitioning; // 0x30
	ERecastPartitioning LayerPartitioning; // 0x31
	int32_t RegionChunkSplits; // 0x34
	int32_t LayerChunkSplits; // 0x38
	char bSortNavigationAreasByCost : 1; // 0x3c
	char bPerformVoxelFiltering : 1; // 0x3c
	char bMarkLowHeightAreas : 1; // 0x3c
	char bUseExtraTopCellWhenMarkingAreas : 1; // 0x3c
	char bFilterLowSpanSequences : 1; // 0x3c
	char bFilterLowSpanFromTileCache : 1; // 0x3c
	char bFixedTilePoolSize : 1; // 0x3c
};

struct FLatentActionInfo {
	int32_t Linkage; // 0x0
	int32_t UUID; // 0x4
	FName ExecutionFunction; // 0x8
	UObject* CallbackTarget; // 0x10
};

struct FAnimNode_Trail : FAnimNode_SkeletalControlBase {
	FBoneReference TrailBone; // 0x100
	int32_t ChainLength; // 0x110
	EAxis ChainBoneAxis; // 0x114
	char bInvertChainBoneAxis : 1; // 0x115
	char bLimitStretch : 1; // 0x115
	char bLimitRotation : 1; // 0x115
	char bUsePlanarLimit : 1; // 0x115
	char bActorSpaceFakeVel : 1; // 0x115
	char bReorientParentToChild : 1; // 0x115
	float MaxDeltaTime; // 0x118
	float RelaxationSpeedScale; // 0x11c
	FRuntimeFloatCurve TrailRelaxationSpeed; // 0x120
	FInputScaleBiasClamp RelaxationSpeedScaleInputProcessor; // 0x1a8
	TArray<FRotationLimit> RotationLimits; // 0x1d8
	TArray<FVector> RotationOffsets; // 0x1e8
	TArray<FAnimPhysPlanarLimit> PlanarLimits; // 0x1f8
	float StretchLimit; // 0x208
	FVector FakeVelocity; // 0x20c
	FBoneReference BaseJoint; // 0x218
	float LastBoneRotationAnimAlphaBlend; // 0x228
};

struct FSoundGroup {
	ESoundGroup SoundGroup; // 0x0
	FString DisplayName; // 0x8
	char bAlwaysDecompressOnLoad : 1; // 0x18
	float DecompressedDuration; // 0x1c
};

struct FNiagaraMatrix {
	FVector4 Row0; // 0x0
	FVector4 Row1; // 0x10
	FVector4 Row2; // 0x20
	FVector4 Row3; // 0x30
};

struct FComponentSync {
	FName Name; // 0x0
	ESyncOption SyncOption; // 0x8
};

struct FKeyBind {
	FKey Key; // 0x0
	FString Command; // 0x18
	char Control : 1; // 0x28
	char Shift : 1; // 0x28
	char Alt : 1; // 0x28
	char Cmd : 1; // 0x28
	char bIgnoreCtrl : 1; // 0x28
	char bIgnoreShift : 1; // 0x28
	char bIgnoreAlt : 1; // 0x28
	char bIgnoreCmd : 1; // 0x28
	char bDisabled : 1; // 0x29
};

struct FInstancedStaticMeshComponentInstanceData : FSceneComponentInstanceData {
	UStaticMesh* StaticMesh; // 0xb8
	FInstancedStaticMeshLightMapInstanceData CachedStaticLighting; // 0xc0
	TArray<FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x100
	TArray<float> PerInstanceSMCustomData; // 0x110
	int32_t InstancingRandomSeed; // 0x140
};

struct FNiagaraPlatformSet {
	int32_t QualityLevelMask; // 0x0
	TArray<FNiagaraDeviceProfileStateEntry> DeviceProfileStates; // 0x8
	TArray<FNiagaraPlatformSetCVarCondition> CVarConditions; // 0x18
};

struct FPoseDriverTransform {
	FVector TargetTranslation; // 0x0
	FRotator TargetRotation; // 0xc
};

struct FCurveTrack {
	FName CurveName; // 0x0
	TArray<float> CurveWeights; // 0x8
};

struct FNiagaraParameters {
	TArray<FNiagaraVariable> Parameters; // 0x0
};

struct FEditedDocumentInfo {
	FSoftObjectPath EditedObjectPath; // 0x0
	FVector2D SavedViewOffset; // 0x18
	float SavedZoomAmount; // 0x20
	UObject* EditedObject; // 0x28
};

struct FPropertyAccessCopy {
	int32_t AccessIndex; // 0x0
	int32_t DestAccessStartIndex; // 0x4
	int32_t DestAccessEndIndex; // 0x8
	EPropertyAccessCopyType Type; // 0xc
};

struct FJsonObjectWrapper {
	FString JsonString; // 0x0
};

struct FBox2D {
	FVector2D Min; // 0x0
	FVector2D Max; // 0x8
	char bIsValid; // 0x10
};

struct FMagicLeapRaycastQueryParams {
	FVector position; // 0x0
	FVector Direction; // 0xc
	FVector UpVector; // 0x18
	int32_t Width; // 0x24
	int32_t Height; // 0x28
	float HorizontalFovDegrees; // 0x2c
	bool CollideWithUnobserved; // 0x30
	int32_t UserData; // 0x34
};

struct FFloatCurve : FAnimCurveBase {
	FRichCurve FloatCurve; // 0x18
};

struct FMovieSceneKeyTimeStruct : FMovieSceneKeyStruct {
	FFrameNumber Time; // 0x8
};

struct FGlobalMapActorMap {
	TMap<int32_t, AGlobalMapActor*> GlobalMapActorMap; // 0x0
};

struct FTransformBase {
	FName Node; // 0x0
	FTransformBaseConstraint Constraints[0x2]; // 0x8
};

struct FWorldRankConfig : FTableRowBase {
	EWorldRankType RankType; // 0x8
	char bEnable : 1; // 0x9
	FString RankName; // 0x10
	FText ShowName; // 0x20
	ERankSettlementType SettlementType; // 0x38
	int32_t SettlementDay; // 0x3c
	int32_t SettlementHour; // 0x40
	char bGlobalRank : 1; // 0x44
	UUserWidget* HeaderWidgetClass; // 0x48
	UWorldRankItemSlot* RankItemSlotClass; // 0x50
	TArray<FRewardItemList> RankRewards; // 0x58
};

struct FNiagaraSystemScalabilityOverrides {
	TArray<FNiagaraSystemScalabilityOverride> Overrides; // 0x0
};

struct FBGMData {
	FBGMDetailData BGM[0xa]; // 0x0
};

struct FWeaponWorldTraceInfo {
	FVector TraceStart; // 0x0
	FVector TraceEnd; // 0xc
	FVector BoxSize; // 0x18
};

struct FMagicLeapPolygon {
	TArray<FVector> Vertices; // 0x0
};

struct FFrameNumberRange {
	FFrameNumberRangeBound LowerBound; // 0x0
	FFrameNumberRangeBound UpperBound; // 0x8
};

struct FAnimPose {
	TArray<FAnimBoneData> AdditivePose; // 0x10
};

struct FUIWSGerstnerWaveOctave {
	int32_t NumWaves; // 0x0
	float AmplitudeScale; // 0x4
	float MainDirection; // 0x8
	float SpreadAngle; // 0xc
	bool bUniformSpread; // 0x10
};

struct FLevelVisibilityComponentData {
	UMovieSceneLevelVisibilitySection* Section; // 0x0
};

struct FCharacterMeshData {
	TArray<FCharacterFeatureMorphTargetData> DefaultMorphTarget; // 0x0
	FCharacterMeshLODMaterialConfig MeshMaterials[0x3]; // 0x10
};

struct FMargin {
	float Left; // 0x0
	float Top; // 0x4
	float Right; // 0x8
	float Bottom; // 0xc
};

struct FSubdivisionLimitSection {
	TArray<FSubdividedQuad> SubdividedQuads; // 0x0
};

struct FMovieScenePrimitiveMaterialTemplate : FMovieSceneEvalTemplate {
	int32_t MaterialIndex; // 0x20
	FMovieSceneObjectPathChannel MaterialChannel; // 0x28
};

struct FFloatDistribution {
	FDistributionLookupTable Table; // 0x0
};

struct FRigidBodyContactInfo {
	FVector ContactPosition; // 0x0
	FVector ContactNormal; // 0xc
	float ContactPenetration; // 0x18
	UPhysicalMaterial* PhysMaterial[0x2]; // 0x20
};

struct FSoundModulationDestinationSettings {
	float Value; // 0x0
	USoundModulatorBase* Modulator; // 0x8
};

struct FMagicLeapHandMeshBlock {
	int32_t IndexCount; // 0x0
	int32_t vertexcount; // 0x4
	TArray<FVector> Vertex; // 0x8
	TArray<int32_t> Index; // 0x18
};

struct FClientReceiveData {
	APlayerController* LocalPC; // 0x0
	FName MessageType; // 0x8
	int32_t MessageIndex; // 0x10
	FString MessageString; // 0x18
	APlayerState* RelatedPlayerState_2; // 0x28
	APlayerState* RelatedPlayerState_3; // 0x30
	UObject* OptionalObject; // 0x38
};

struct FGameplayAbilityBindInfo {
	EGameplayAbilityInputBinds Command; // 0x0
	UGameplayAbility* GameplayAbilityClass; // 0x8
};

struct FLevelSequenceSnapshotSettings {
	char ZeroPadAmount; // 0x0
	FFrameRate FrameRate; // 0x4
};

struct FStructureMiniMapData {
	FString POIStyleID; // 0x0
	FVector Location; // 0x10
};

struct FRedirector {
	FName OldName; // 0x0
	FName NewName; // 0x8
};

struct FMovieSceneTimeWarping {
	FFrameNumber Start; // 0x0
	FFrameNumber End; // 0x4
};

struct FOnStuRecallBuyGoods {
	int32_t res; // 0x0
};

struct FCropRowBase : FTableRowBase {
	int32_t CropID; // 0x8
	ASGStructure* CropClass; // 0x10
};

struct FEnvironmentMaterialData {
	FName ChangedName; // 0x0
	float FromMinNum; // 0x8
	float ToMaxNum; // 0xc
};

struct FNamedCurveValue {
	FName Name; // 0x0
	float Value; // 0x8
};

struct FGameplayTagResponseTableEntry {
	FGameplayTagReponsePair Positive; // 0x0
	FGameplayTagReponsePair Negative; // 0x28
};

struct FVirtualKeyboardOptions {
	bool bEnableAutocorrect; // 0x0
};

struct FLensSettings {
	FLensBloomSettings Bloom; // 0x0
	FLensImperfectionSettings Imperfections; // 0xb8
	float ChromaticAberration; // 0xd8
};

struct FPreAttackConfig {
	UAnimMontage* PreAttackMontage; // 0x0
	float PreAttackDistance; // 0x8
	float PreStopAttackDistance; // 0xc
	float PreAttackCoolingTime; // 0x10
};

struct FTimeStretchCurveInstance {
	bool bHasValidData; // 0x0
};

struct FMovieSceneEnumPropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneByteChannel EnumCurve; // 0x38
};

struct FSGAISenseConfig_Hearing {
	float HearingRange; // 0x0
	FColor DebugColor; // 0x4
};

struct FCullDistanceSizePair {
	float Size; // 0x0
	float CullDistance; // 0x4
};

struct FAnimalsTurnAnims {
	UAnimMontage* TurnInPlace_L_Anim; // 0x0
	UAnimMontage* TurnInPlace_R_Anim; // 0x8
	UAnimMontage* Turn_L90_Anim; // 0x10
	UAnimMontage* Turn_R90_Anim; // 0x18
	UAnimMontage* Turn_L180_Anim; // 0x20
	UAnimMontage* Turn_R180_Anim; // 0x28
	UAnimMontage* AttackTurn_L180Anim; // 0x30
	UAnimMontage* AttackTurn_R180Anim; // 0x38
};

struct FStructureTrapCharacters {
	ASG_AnimalsCharacter* TrapCharacterTemplate; // 0x0
	USGItem* GiveItem; // 0x8
};

struct FLevelSequenceObject {
	LazyObjectProperty ObjectOrOwner; // 0x0
	FString ComponentName; // 0x20
	TWeakObjectPtr<UObject> CachedComponent; // 0x30
};

struct FAbilityTriggerData {
	FGameplayTag TriggerTag; // 0x0
	EGameplayAbilityTriggerSource TriggerSource; // 0x8
};

struct FBehaviorTreeTemplateInfo {
	UBehaviorTree* Asset; // 0x0
	UBTCompositeNode* Template; // 0x8
};

struct FLevelViewportInfo {
	FVector CamPosition; // 0x0
	FRotator CamRotation; // 0xc
	float CamOrthoZoom; // 0x18
	bool CamUpdated; // 0x1c
};

struct FMovieSceneEvaluationGroupLUTIndex {
	int32_t NumInitPtrs; // 0x0
	int32_t NumEvalPtrs; // 0x4
};

struct FProgressBarStyle : FSlateWidgetStyle {
	FSlateBrush BackgroundImage; // 0x8
	FSlateBrush FillImage; // 0x90
	FSlateBrush MarqueeImage; // 0x118
};

struct FAnimCurveBase {
	FName LastObservedName; // 0x0
	FSmartName Name; // 0x8
	int32_t CurveTypeFlags; // 0x14
};

struct FGlobalMapActorArray {
	TArray<AGlobalMapActor*> GlobalMapActorArray; // 0x0
};

struct FTimelineLinearColorTrack {
	UCurveLinearColor* LinearColorCurve; // 0x0
	FDelegate InterpFunc; // 0x8
	FName TrackName; // 0x18
	FName LinearColorPropertyName; // 0x20
};

struct FAnimalsIdlePoseAnims {
	UAnimSequence* IdleAnim; // 0x0
	UBlendSpaceBase* IdleBS; // 0x8
};

struct FVertexOffsetUsage {
	int32_t Usage; // 0x0
};

struct FMovieSceneTransformMask {
	uint32_t Mask; // 0x0
};

struct FDiKuaiOccupyInfo {
	int32_t DiKuaiId; // 0x0
	TMap<int32_t, bool> GuanAiMap; // 0x8
	TMap<int32_t, FAllianceGuanAiInfo> AllianceGuanAiMap; // 0x58
	char bOccupy : 1; // 0xa8
	FGuid OccupyGuildUid; // 0xac
};

struct FHuangLiEffectUnlock {
	char UnlockFlag; // 0x0
	TArray<FHuangLiUnlockInfo> UnlockInfoArray; // 0x8
};

struct FSkeletalMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	FName MaterialSlotName; // 0x8
	FMeshUVChannelInfo UVChannelData; // 0x10
};

struct FNiagaraID {
	int32_t Index; // 0x0
	int32_t AcquireTag; // 0x4
};

struct FCrowdAvoidanceSamplingPattern {
	TArray<float> Angles; // 0x0
	TArray<float> Radii; // 0x10
};

struct FRawAnimSequenceTrack {
	TArray<FVector> PosKeys; // 0x0
	TArray<FQuat> RotKeys; // 0x10
	TArray<FVector> ScaleKeys; // 0x20
};

struct FTimeStretchCurveMarker {
	float Time[0x3]; // 0x0
	float Alpha; // 0xc
};

struct FSoundWaveSpectralDataPerSound {
	TArray<FSoundWaveSpectralData> SpectralData; // 0x0
	float PlaybackTime; // 0x10
	USoundWave* SoundWave; // 0x18
};

struct FReferencePose {
	FName PoseName; // 0x0
	TArray<FTransform> ReferencePose; // 0x8
};

struct FKSphylElem : FKShapeElem {
	FVector Center; // 0x38
	FRotator Rotation; // 0x44
	float Radius; // 0x50
	float Length; // 0x54
};

struct FHairConfigData {
	TSoftObjectPtr<UTexture2D> IconTexture; // 0x0
	USGItem* HairItem; // 0x28
};

struct FNews_GeneralHungry : FNewsBase {
	FString GeneralName; // 0x18
	AActor* GeneralTemplate; // 0x28
	FGuid ChunkId; // 0x30
};

struct FAnimTickRecord {
	UAnimationAsset* SourceAsset; // 0x0
};

struct FBlendProfileBoneEntry {
	FBoneReference BoneReference; // 0x0
	float BlendScale; // 0x10
};

struct FBTDecoratorLogic {
	EBTDecoratorLogic Operation; // 0x0
	uint16_t Number; // 0x2
};

struct FMaterialLayersFunctions {
	TArray<UMaterialFunctionInterface*> Layers; // 0x0
	TArray<UMaterialFunctionInterface*> Blends; // 0x10
	TArray<bool> LayerStates; // 0x20
	FString KeyString; // 0x30
};

struct FForceFeedbackParameters {
	FName Tag; // 0x0
	bool bLooping; // 0x8
	bool bIgnoreTimeDilation; // 0x9
	bool bPlayWhilePaused; // 0xa
};

struct FActiveGameplayCue : FFastArraySerializerItem {
	FGameplayTag GameplayCueTag; // 0xc
	FPredictionKey PredictionKey; // 0x18
	FGameplayCueParameters Parameters; // 0x28
	bool bPredictivelyRemoved; // 0xe0
};

struct FInputActionKeyMappingConfig {
	EKeyMappingButtonType ButtonType; // 0x0
	FInputActionKeyMapping ActionKeyMapping; // 0x8
};

struct FDelegateArray {
	TArray<FDelegate> Delegates; // 0x0
};

struct FBrushEffectCurves {
	bool bUseCurveChannel; // 0x0
	UCurveFloat* ElevationCurveAsset; // 0x8
	float ChannelEdgeOffset; // 0x10
	float ChannelDepth; // 0x14
	float CurveRampWidth; // 0x18
};

struct FParticleBurst {
	int32_t Count; // 0x0
	int32_t CountLow; // 0x4
	float Time; // 0x8
};

struct FAIFavoriteFood : FTableRowBase {
	USGItem* ItemClass; // 0x8
	TArray<EVehicleType> VehicleTypes; // 0x10
	EAnimalQualityType FoodQualityType; // 0x20
	float AddHungerValue; // 0x24
	float AddHPValue; // 0x28
	float AddStunValue; // 0x2c
	float AddHealthValue; // 0x30
	float SplitHealthRatioPregnancy; // 0x34
	float AddTameValue; // 0x38
	float AddExpValue; // 0x3c
	float SplitExpRatioPregnancy; // 0x40
};

struct FGeneralStructureSeat {
	char bIsSeat : 1; // 0x0
	char bIsSpawnInClient : 1; // 0x0
	FGuid ChunkUid; // 0x4
	FString CharacterName; // 0x18
	FCreateInfo CreateInfo; // 0x28
	int32_t EquipItem[0x4]; // 0x1a8
	TArray<int32_t> CraftItem; // 0x1b8
	float HandMakingTimeMul; // 0x1c8
	float SkillMul; // 0x1cc
	float CurrentHunger; // 0x1d0
	FDateTime StartSeatTime; // 0x1d8
};

struct FSlotAnimationTrack {
	FName SlotName; // 0x0
	FAnimTrack AnimTrack; // 0x8
};

struct FBoneNode {
	FName Name; // 0x0
	int32_t ParentIndex; // 0x8
	EBoneTranslationRetargetingMode TranslationRetargetingMode; // 0xc
};

struct FChunkInfoData {
	FGuid Guid; // 0x0
	uint64_t Hash; // 0x10
	FSHAHashData ShaHash; // 0x18
	int64_t FileSize; // 0x30
	char GroupNumber; // 0x38
};

struct FMovieSceneEvaluationTemplateSerialNumber {
	uint32_t Value; // 0x0
};

struct FNamedTransform {
	FTransform Value; // 0x0
	FName Name; // 0x30
};

struct FSubmixEffectStereoDelaySettings {
	EStereoDelaySourceEffect DelayMode; // 0x0
	float DelayTimeMsec; // 0x4
	float Feedback; // 0x8
	float DelayRatio; // 0xc
	float WetLevel; // 0x10
	float DryLevel; // 0x14
	bool bFilterEnabled; // 0x18
	EStereoDelayFiltertype FilterType; // 0x19
	float FilterFrequency; // 0x1c
	float FilterQ; // 0x20
};

struct FPassengerAnimsConfig {
	UAnimSequence* DefaultAnim; // 0x0
	UBlendSpace* DefaultMoveBS; // 0x8
};

struct FCraftEntries {
	TArray<USGPerk*> PerkEntries; // 0x0
	TArray<USGCraftPerkGroup*> CraftEntries; // 0x10
};

struct FGuid {
	int32_t A; // 0x0
	int32_t B; // 0x4
	int32_t C; // 0x8
	int32_t D; // 0xc
};

struct FNiagaraHalfVector3 {
	uint16_t X; // 0x0
	uint16_t Y; // 0x2
	uint16_t Z; // 0x4
};

struct FTattooConfigDataMap {
	TMap<FName, FTattooConfigData> TattooConfigMap; // 0x0
};

struct FAbilityTaskDebugMessage {
	UGameplayTask* FromTask; // 0x0
	FString Message; // 0x8
};

struct FWaterBodyHeightmapSettings {
	EWaterBrushBlendType BlendMode; // 0x0
	bool bInvertShape; // 0x1
	FWaterFalloffSettings FalloffSettings; // 0x4
	FWaterBrushEffects Effects; // 0x18
	int32_t Priority; // 0x78
};

struct FSellerRefreshTimeInfo {
	FDateTime NextCapitalRefreshTime; // 0x0
	FDateTime NextGoodsRefreshTime; // 0x8
	int32_t CapitalHoursInterval; // 0x10
	int32_t GoodsHoursInterval; // 0x14
};

struct FAnimNode_LegIK : FAnimNode_SkeletalControlBase {
	float ReachPrecision; // 0xc8
	int32_t MaxIterations; // 0xcc
	TArray<FAnimLegIKDefinition> LegsDefinition; // 0xd0
};

struct FActivateRequireData {
	USGItem* FuelItem; // 0x0
	float ConsumeInterval; // 0x8
	USGItem* ConsumedGiveItem; // 0x10
};

struct FLadderParams {
	char Index; // 0x0
	char bEnable : 1; // 0x1
	char bIsExit : 1; // 0x1
	UAnimSequence* LadderAsset; // 0x8
	UAnimMontage* LadderMontage; // 0x10
	FVector AnimatedStartOffset; // 0x18
	FVector AnimatedDesiredOffset; // 0x24
	FRotator AnimatedDesiredRotation; // 0x30
	char bIsLooping : 1; // 0x3c
	TArray<FName> MontageSlotsName; // 0x40
	FVector2D InitPlayPositionRateData; // 0x50
	FAlphaBlend BlendIn; // 0x58
	FAlphaBlend BlendOut; // 0x88
	FVector2D InitBlendOutData; // 0xb8
	FVector2D InitBlendTriggerData; // 0xc0
	TArray<FVector2D> RightFootPositions; // 0xc8
	TArray<FVector2D> AllowStopPositions; // 0xd8
	FVector2D AdaptiveLocationRange; // 0xe8
	FVector2D AdaptiveRotationRange; // 0xf0
	FTransform AnimationInitialTransform; // 0x100
	TMap<EAnimCurve, FRuntimeFloatCurve> SimulateRuntimeFloatCurves; // 0x130
};

struct FFunctionResourceArray {
	TArray<FFunctionResourceEntry> FunctionResourceArray; // 0x0
};

struct FAnimNode_Inertialization : FAnimNode_Base {
	FPoseLink Source; // 0x10
};

struct FOfficalSealInfo {
	int32_t Type; // 0x0
	int32_t ID; // 0x4
	FGuid GuildUid; // 0x8
	FString GuildName; // 0x18
	FGuid AllianceUid; // 0x28
	FString AllianceName; // 0x38
	int32_t JunId; // 0x48
};

struct FNetTaxRevInfo {
	int32_t ServerId; // 0x0
	int32_t CityId; // 0x4
	int32_t OfficalJobTaxType; // 0x8
	int32_t TaxGold; // 0xc
};

struct FTViewTarget {
	AActor* Target; // 0x0
	FMinimalViewInfo POV; // 0x10
	APlayerState* PlayerState; // 0x600
};

struct FMovieSceneBoolPropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneBoolChannel BoolCurve; // 0x38
};

struct FNodeItem {
	FName ParentName; // 0x0
	FTransform Transform; // 0x10
};

struct FSkeletalMeshSamplingRegion {
	FName Name; // 0x0
	int32_t LODIndex; // 0x8
	char bSupportUniformlyDistributedSampling : 1; // 0xc
	TArray<FSkeletalMeshSamplingRegionMaterialFilter> MaterialFilters; // 0x10
	TArray<FSkeletalMeshSamplingRegionBoneFilter> BoneFilters; // 0x20
};

struct FNamedNetDriver {
	UNetDriver* NetDriver; // 0x0
};

struct FCreateRoleCameraLevelData {
	float Distance; // 0x0
	TMap<FName, FCreateRoleCameraData> CameraDatas; // 0x8
};

struct FGameplayEffectAttributeCaptureSpec {
	FGameplayEffectAttributeCaptureDefinition BackingDefinition; // 0x0
};

struct FLandscapeSplineSegmentConnection {
	ULandscapeSplineControlPoint* ControlPoint; // 0x0
	float TangentLen; // 0x8
	FName SocketName; // 0xc
};

struct FBrushEffectBlurring {
	bool bBlurShape; // 0x0
	int32_t Radius; // 0x4
};

struct FRotator {
	float Pitch; // 0x0
	float Yaw; // 0x4
	float Roll; // 0x8
};

struct FOccupySellInfo {
	int32_t OccupyTotalSellNum; // 0x0
	float OccupyTotalSellPrice; // 0x4
	int32_t OccupyTotalSellDay; // 0x8
};

struct FAnimalSpeciesConfig {
	ASG_AnimalsCharacter* AnimalTemplate; // 0x0
	ASG_AnimalsCharacter* AnimalTemplate_Female; // 0x8
	TArray<UMaterialInstance*> OverrideAnimalMaterials; // 0x10
};

struct FGameplayEffectModifiedAttribute {
	FGameplayAttribute Attribute; // 0x0
	float TotalMagnitude; // 0x38
};

struct FLinearColor {
	float R; // 0x0
	float G; // 0x4
	float B; // 0x8
	float A; // 0xc
};

struct FWorshipConfig {
	float MulAdd; // 0x0
	EWorshipType WorshipType; // 0x4
	int32_t OneDayCost; // 0x8
	int32_t ThreeDayCost; // 0xc
	int32_t FiveDayCost; // 0x10
	int32_t SevenDayCost; // 0x14
	FText Info; // 0x18
	TSoftObjectPtr<UTexture2D> icon; // 0x30
};

struct FImageFilterParamConfig {
	FImageFilterMaterialParam Param[0x2]; // 0x0
};

struct FAutomationEvent {
	EAutomationEventType Type; // 0x0
	FString Message; // 0x8
	FString Context; // 0x18
	FGuid Artifact; // 0x28
};

struct FLandscapeMaterialTextureStreamingInfo {
	FName TextureName; // 0x0
	float TexelFactor; // 0x8
};

struct FStructSerializerBooleanTestStruct {
	bool BoolFalse; // 0x0
	bool BoolTrue; // 0x1
	char Bitfield0 : 1; // 0x2
	char Bitfield1 : 1; // 0x2
	char Bitfield2Set : 1; // 0x2
	char Bitfield3 : 1; // 0x2
	char Bitfield4Set : 1; // 0x2
	char Bitfield5Set : 1; // 0x2
	char Bitfield6 : 1; // 0x2
	char Bitfield7Set : 1; // 0x2
};

struct FMovieScenePossessable {
	TArray<FName> Tags; // 0x0
	FGuid Guid; // 0x10
	FString Name; // 0x20
	UObject* PossessedObjectClass; // 0x30
	FGuid ParentGuid; // 0x38
};

struct FGuildEventModifyConflictReplicated {
	EEventGuildType EventGuildType; // 0x0
	float ConflictValue; // 0x4
	float ConflictModifyValue; // 0x8
	int32_t OccupyModifyConflictCount; // 0xc
	float DelayRemainTime; // 0x10
	char bShouldNotify : 1; // 0x14
};

struct FPredictProjectilePathResult {
	TArray<FPredictProjectilePathPointData> PathData; // 0x0
	FPredictProjectilePathPointData LastTraceDestination; // 0x10
	FHitResult HitResult; // 0x2c
};

struct FGameplayEventData {
	FGameplayTag EventTag; // 0x0
	AActor* Instigator; // 0x8
	AActor* Target; // 0x10
	UObject* OptionalObject; // 0x18
	UObject* OptionalObject2; // 0x20
	FGameplayEffectContextHandle ContextHandle; // 0x28
	FGameplayTagContainer InstigatorTags; // 0x40
	FGameplayTagContainer TargetTags; // 0x60
	float EventMagnitude; // 0x80
	FGameplayAbilityTargetDataHandle TargetData; // 0x88
};

struct FParameterChannelNames {
	FText R; // 0x0
	FText G; // 0x18
	FText B; // 0x30
	FText A; // 0x48
};

struct FServerAbilityRPCBatch {
	FGameplayAbilitySpecHandle AbilitySpecHandle; // 0x0
	FPredictionKey PredictionKey; // 0x8
	FGameplayAbilityTargetDataHandle TargetData; // 0x18
	bool InputPressed; // 0x40
	bool Ended; // 0x41
	bool Started; // 0x42
};

struct FMsgClientGetOfficialSealInfos : FMessageBase {
	TArray<FOfficalSealInfo> OfficalSealInfos; // 0x8
};

struct FInviteJoinAllianceInfo {
	FGuid InviteAllianceUid; // 0x0
	FString InviteAllianceName; // 0x10
	FString InvitePlayerName; // 0x20
	FString InviteInfo; // 0x30
};

struct FMovieSceneParticleSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneParticleChannel ParticleKeys; // 0x20
};

struct FInAppPurchaseProductInfo2 {
	FString Identifier; // 0x0
	FString TransactionIdentifier; // 0x10
	FString DisplayName; // 0x20
	FString DisplayDescription; // 0x30
	FString DisplayPrice; // 0x40
	float RawPrice; // 0x50
	FString CurrencyCode; // 0x58
	FString CurrencySymbol; // 0x68
	FString DecimalSeparator; // 0x78
	FString GroupingSeparator; // 0x88
	FString ReceiptData; // 0x98
	TMap<FString, FString> DynamicFields; // 0xa8
};

struct FGuildOnlineAwardData {
	int32_t AwardTime; // 0x0
	TArray<FGuildAwardItem> Items; // 0x8
};

struct FMarkerSyncAnimPosition {
	FName PreviousMarkerName; // 0x0
	FName NextMarkerName; // 0x8
	float PositionBetweenMarkers; // 0x10
};

struct FRequestOccupyDetailInfo {
	FGuid GuildId; // 0x0
	FGuid AllianceId; // 0x10
	char bAllianceOwnerGuild : 1; // 0x20
	int32_t ServerId; // 0x24
};

struct FWaterBrushEffectTerracing {
	float TerraceAlpha; // 0x0
	float TerraceSpacing; // 0x4
	float TerraceSmoothness; // 0x8
	float MaskLength; // 0xc
	float MaskStartOffset; // 0x10
};

struct FSourceEffectWaveShaperSettings {
	float Amount; // 0x0
	float OutputGainDb; // 0x4
};

struct FBuildPromotionImportWorkflowSettings {
	FEditorImportWorkflowDefinition Diffuse; // 0x0
	FEditorImportWorkflowDefinition Normal; // 0x20
	FEditorImportWorkflowDefinition StaticMesh; // 0x40
	FEditorImportWorkflowDefinition ReimportStaticMesh; // 0x60
	FEditorImportWorkflowDefinition BlendShapeMesh; // 0x80
	FEditorImportWorkflowDefinition MorphMesh; // 0xa0
	FEditorImportWorkflowDefinition SkeletalMesh; // 0xc0
	FEditorImportWorkflowDefinition Animation; // 0xe0
	FEditorImportWorkflowDefinition Sound; // 0x100
	FEditorImportWorkflowDefinition SurroundSound; // 0x120
	TArray<FEditorImportWorkflowDefinition> OtherAssetsToImport; // 0x140
};

struct FTTPropertyTrack : FTTTrackBase {
	FName PropertyName; // 0x18
};

struct FGameplayEffectExecutionDefinition {
	UGameplayEffectExecutionCalculation* CalculationClass; // 0x0
	FGameplayTagContainer PassedInTags; // 0x8
	TArray<FGameplayEffectExecutionScopedModifierInfo> CalculationModifiers; // 0x28
	TArray<UGameplayEffect*> ConditionalGameplayEffectClasses; // 0x38
	TArray<FConditionalGameplayEffect> ConditionalGameplayEffects; // 0x48
};

struct FMovieSceneSequenceHierarchy {
	FMovieSceneSequenceHierarchyNode RootNode; // 0x0
	FMovieSceneSubSequenceTree Tree; // 0x18
	TMap<FMovieSceneSequenceID, FMovieSceneSubSequenceData> SubSequences; // 0x78
	TMap<FMovieSceneSequenceID, FMovieSceneSequenceHierarchyNode> Hierarchy; // 0xc8
};

struct FPawnActionStack {
	UPawnAction* TopAction; // 0x0
};

struct FPredictProjectilePathPointData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	float Time; // 0x18
};

struct FLODSoloTrack {
	TArray<char> SoloEnableSetting; // 0x0
};

struct FMovieSceneByteChannel : FMovieSceneChannel {
	TArray<FFrameNumber> Times; // 0x8
	char DefaultValue; // 0x18
	bool bHasDefaultValue; // 0x19
	TArray<char> Values; // 0x20
	UEnum* Enum; // 0x30
};

struct FCameraTargets {
	FCameraSettings_Stance VelocityDirection; // 0x0
	FCameraSettings_Stance LookingDirection; // 0x78
	FCameraSettings_Stance Aiming; // 0xf0
	FCameraSettings Ragdoll; // 0x168
	FCameraSettings Climb; // 0x17c
};

struct FJianChuEffect : FTableRowBase {
	EJianChuType JianChuType; // 0x8
	FText JianChuName; // 0x10
	FText JianChuDesc; // 0x28
	TArray<FHuangLiEffect> HuangLiEffects; // 0x40
};

struct FWeatherRepInfo {
	EWeatherType ReplicateWeatherType; // 0x0
	float CurrentWeatherTotalDuration; // 0x4
	float CurrentWeatherTime; // 0x8
	char bFromCheat : 1; // 0xc
};

struct FInAppPurchaseProductRequest2 {
	FString ProductIdentifier; // 0x0
	bool bIsConsumable; // 0x10
};

struct FAnimationTransitionRule {
	FName RuleToExecute; // 0x0
	bool TransitionReturnVal; // 0x8
	int32_t TransitionIndex; // 0xc
};

struct FAnimalBabyInheritData {
	int32_t GenerationCount; // 0x0
	int32_t InheritLevel; // 0x4
	float InheritBaseQualityCorrection; // 0x8
	TArray<float> InheritAttributeCorrectionMul; // 0x10
	int32_t AttributeCorrectionRandomCount; // 0x20
	TArray<int32_t> InheritForbidPlacePerkIndexes; // 0x28
	TArray<int32_t> InheritRecessivePerkIndexes; // 0x38
	int32_t InheritVariationCount; // 0x48
	EAnimalFurColorType SkinColorType; // 0x4c
	int32_t InheritSkinHuaSeBaseIndex[0x2]; // 0x50
	int32_t InheritSkinHuaSeMaskIndex[0x2]; // 0x58
	float InheritStrongMorph; // 0x60
	float InheritThinMorph; // 0x64
	TArray<FAnimalGenealogyData> InheritGenealogyDatas; // 0x68
	FGuid InheritFatherChunkUid; // 0x78
	FGuid InheritMotherChunkUid; // 0x88
};

struct FDebug_Parameters {
	FString UseTextureLOD_14_736F43694CE688E814BF119F04BC733B; // 0x0
	FString NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF; // 0x10
	FString DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2; // 0x20
	FString DebugForceFullBuild_17_6FDE0EFC4C1DDE4558BFADAFC250953A; // 0x30
	FString DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6; // 0x40
	FString DebugForceBuildMode_19_AB2BFAEB44E7BB8A8D5CCA99F330B428; // 0x50
	FString EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977; // 0x60
	FString EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354; // 0x70
	FString EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC; // 0x80
	FString ReflectionEnableMaterials_23_49932A5A461504BB59F75CB217B2162E; // 0x90
	FString EnableShaderCache_24_91CAA4D2402AA03FE3367E863E697898; // 0xa0
	FString PSOCacheSize_25_571245E8420E18F1C3A1D6B9173D8898; // 0xb0
	FString RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572; // 0xc0
	float UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D; // 0xd0
	FString ParallelMeshBatchSize_66_DD9B821743F54A691D43C8A24A9BE556; // 0xd8
	FString BuildRayTracingMeshForCaustics_68_BDEEC918403656B6270A94A80C0DE5DB; // 0xe8
	FString ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD; // 0xf8
	FString BatchMaterials_57_ED68CBEF4934516852BC45B44504F0C1; // 0x108
};

struct FConstraintProfileProperties {
	float ProjectionLinearTolerance; // 0x0
	float ProjectionAngularTolerance; // 0x4
	float ProjectionLinearAlpha; // 0x8
	float ProjectionAngularAlpha; // 0xc
	float LinearBreakThreshold; // 0x10
	float AngularBreakThreshold; // 0x14
	FLinearConstraint LinearLimit; // 0x18
	FConeConstraint ConeLimit; // 0x34
	FTwistConstraint TwistLimit; // 0x54
	FLinearDriveConstraint LinearDrive; // 0x70
	FAngularDriveConstraint AngularDrive; // 0xbc
	char bDisableCollision : 1; // 0x108
	char bParentDominates : 1; // 0x108
	char bEnableProjection : 1; // 0x108
	char bEnableSoftProjection : 1; // 0x108
	char bAngularBreakable : 1; // 0x108
	char bLinearBreakable : 1; // 0x108
};

struct FAnimNode_PoseBlendNode : FAnimNode_PoseHandler {
	FPoseLink SourcePose; // 0x80
	EAlphaBlendOption BlendOption; // 0x90
	UCurveFloat* CustomCurve; // 0x98
};

struct FMsgRecord_EnterServer : FMsgRecordBase {
	FString CharacterName; // 0x10
};

struct FChildActorAttachedActorInfo {
	TWeakObjectPtr<AActor> Actor; // 0x0
	FName SocketName; // 0x8
	FTransform RelativeTransform; // 0x10
};

struct FComponentKey {
	UObject* OwnerClass; // 0x0
	FName SCSVariableName; // 0x8
	FGuid AssociatedGuid; // 0x10
};

struct FParticleEvent_GenerateInfo {
	EParticleEventType Type; // 0x0
	int32_t Frequency; // 0x4
	int32_t ParticleFrequency; // 0x8
	char FirstTimeOnly : 1; // 0xc
	char LastTimeOnly : 1; // 0xc
	char UseReflectedImpactVector : 1; // 0xc
	char bUseOrbitOffset : 1; // 0xc
	FName CustomName; // 0x10
	TArray<UParticleModuleEventSendToGame*> ParticleModuleEventsToSendToGame; // 0x18
};

struct FWorldRankContentBase {
	FString PlayerName; // 0x0
	int32_t PlayerLevel; // 0x10
};

struct FEyebrowData {
	float BrowAngle; // 0x0
	float BrowDepth; // 0x4
	float BrowHeight; // 0x8
	float BrowWidth; // 0xc
};

struct FMarketSellGoodsInfo {
	int32_t OrderID; // 0x0
	FDateTime SellTime; // 0x8
	EAuctionShopGoodsType GoodsType; // 0x10
	FString GoodsID; // 0x18
};

struct FSGFoodBoxInfo {
	int32_t FoodItemIndex; // 0x0
	EItemQuality ItemQuality; // 0x4
};

struct FActivityRankRule {
	int32_t RuleDay; // 0x0
	int32_t RuleHour; // 0x4
	int64_t BeginTimeTicks; // 0x8
	int64_t EndTimeTicks; // 0x10
	FString CurRankName; // 0x18
	int64_t LastBeginTimeTicks; // 0x28
	int64_t LastEndTimeTicks; // 0x30
	FString LastRankName; // 0x38
};

struct FGenericConfirmationParam {
	FString TitleText; // 0x0
	FString MessageText; // 0x10
	FString AcceptButtonText; // 0x20
	FString CancelButtonText; // 0x30
	float AutoKillTime; // 0x40
	float TickTimer; // 0x44
	char bShowAllBg : 1; // 0x48
	char bCheckItem : 1; // 0x48
	TArray<FRequireItems> CheckItems; // 0x50
	TWeakObjectPtr<USGInventoryComponent> CheckInventory; // 0x60
	char bEnterAccept : 1; // 0x68
	char bConfirmCheck : 1; // 0x68
	FString ConfirmCheckText; // 0x70
};

struct FCustomOutput {
	FName OutputName; // 0x0
	ECustomMaterialOutputType OutputType; // 0x8
};

struct FBattleAwardItem {
	USGItem* ItemClass; // 0x0
	int32_t DropNum; // 0x8
	EItemQuality Quality; // 0xc
	char NeedKillOrAssistKill : 1; // 0xd
};

struct FHeightmapData {
	UTexture2D* Texture; // 0x0
};

struct FSourceEffectPhaserSettings {
	float WetLevel; // 0x0
	float Frequency; // 0x4
	float Feedback; // 0x8
	EPhaserLFOType LFOType; // 0xc
	bool UseQuadraturePhase; // 0xd
};

struct FIntMargin {
	int32_t Left; // 0x0
	int32_t Top; // 0x4
	int32_t Right; // 0x8
	int32_t Bottom; // 0xc
};

struct FMorphTargetSliderData {
	FVector2D SliderLimit; // 0x0
	FVector2D MorphTargetLimit; // 0x8
};

struct FTrafficGoodsSellerLvInfo {
	float Exp; // 0x0
	int32_t Level; // 0x4
};

struct FSpriteCategoryInfo {
	FName Category; // 0x0
	FText DisplayName; // 0x8
	FText Description; // 0x20
};

struct FLocationBoneSocketInfo {
	FName BoneSocketName; // 0x0
	FVector Offset; // 0x8
};

struct FGameplayModifierEvaluatedData {
	FGameplayAttribute Attribute; // 0x0
	EGameplayModOp ModifierOp; // 0x38
	float Magnitude; // 0x3c
	FActiveGameplayEffectHandle Handle; // 0x40
	bool IsValid; // 0x48
};

struct FClothCollisionPrim_Box {
	FVector LocalPosition; // 0x0
	FQuat LocalRotation; // 0x10
	FVector HalfExtents; // 0x20
	int32_t BoneIndex; // 0x2c
};

struct FVGOptionConfig {
	TSoftObjectPtr<UTexture2D> IconOption; // 0x0
	FText OptionText; // 0x28
	TArray<FVGOptionProp> PropConfigArray; // 0x40
};

struct FURL {
	FString Protocol; // 0x0
	FString Host; // 0x10
	int32_t Port; // 0x20
	int32_t Valid; // 0x24
	FString Map; // 0x28
	FString RedirectURL; // 0x38
	TArray<FString> Op; // 0x48
	FString Portal; // 0x58
};

struct FToolTipsItemTypeTable : FTableRowBase {
	FText TitleText; // 0x8
};

struct FPerBoneBlendWeights {
	TArray<FPerBoneBlendWeight> BoneBlendWeights; // 0x0
};

struct FWeaponScatteringData {
	char bUseCrosshairs : 1; // 0x0
	char bUseCalculateScattering : 1; // 0x0
	float InterpSpeed; // 0x4
	float RiderInterpSpeed; // 0x8
	float RotationInterpSpeed; // 0xc
	float RiderRotationInterpSpeed; // 0x10
	float MinScatteringAngle; // 0x14
	float MaxScatteringAngle; // 0x18
	float MovingMaxScatteringAngleAdd; // 0x1c
	FVector2D RotationScatteringAngleRange; // 0x20
	float RiderMinScatteringAngle; // 0x28
	float RiderMaxScatteringAngle; // 0x2c
	float RiderMovingMaxScatteringAngleAdd; // 0x30
	FVector2D RiderRotationScatteringAngleRange; // 0x34
};

struct FMovieSceneSubSequenceData {
	FSoftObjectPath Sequence; // 0x0
	FMovieSceneSequenceTransform RootToSequenceTransform; // 0x18
	FFrameRate TickResolution; // 0x38
	FMovieSceneSequenceID DeterministicSequenceID; // 0x40
	FMovieSceneFrameRange PlayRange; // 0x44
	FMovieSceneFrameRange FullPlayRange; // 0x54
	FMovieSceneFrameRange UnwarpedPlayRange; // 0x64
	FMovieSceneFrameRange PreRollRange; // 0x74
	FMovieSceneFrameRange PostRollRange; // 0x84
	int16_t HierarchicalBias; // 0x94
	bool bHasHierarchicalEasing; // 0x96
	FMovieSceneSequenceInstanceDataPtr InstanceData; // 0x98
	FGuid SubSectionSignature; // 0xb8
	FMovieSceneSequenceTransform OuterToInnerTransform; // 0xc8
};

struct FROscillator {
	FFOscillator Pitch; // 0x0
	FFOscillator Yaw; // 0xc
	FFOscillator Roll; // 0x18
};

struct FRichImageRow : FTableRowBase {
	FSlateBrush Brush; // 0x8
};

struct FCapturedPropSegment {
	FString PropertyName; // 0x0
	int32_t PropertyIndex; // 0x10
	FString ComponentName; // 0x18
};

struct FBoneSocketTarget {
	bool bUseSocket; // 0x0
	FBoneReference BoneReference; // 0x4
	FSocketReference SocketReference; // 0x20
};

struct FVirtualBone {
	FName SourceBoneName; // 0x0
	FName TargetBoneName; // 0x8
	FName VirtualBoneName; // 0x10
};

struct FCollectionParameterBase {
	FName ParameterName; // 0x0
	FGuid ID; // 0x8
};

struct FOccupyStructureGuildLevelSettings {
	TArray<FCraftResourceRequirement> PreventDecayRequirements; // 0x0
	int32_t PreventDecayGuildActivityPoint; // 0x10
	int32_t PreventDecayGAPImageIndex; // 0x14
	TArray<FProtectionRequirement> ProtectionRequirements; // 0x18
	int32_t ProtectionGuildActivityPoint; // 0x28
	int32_t ProtectionGAPImageIndex; // 0x2c
	TArray<FOccupyBuffRequirement> BuffRequirements; // 0x30
};

struct FAnimNode_RefPose : FAnimNode_Base {
	ERefPoseType RefPoseType; // 0x10
};

struct FExploitScaleConfig {
	FFloatInterval ScaleRange; // 0x0
	float HealthMultiler; // 0x8
	float RecoverTimeMultiler; // 0xc
};

struct FMagicLeapPlaneBoundary {
	FMagicLeapPolygon Polygon; // 0x0
	TArray<FMagicLeapPolygon> Holes; // 0x10
};

struct FFormatArgumentData {
	FString ArgumentName; // 0x0
	EFormatArgumentType ArgumentValueType; // 0x10
	FText ArgumentValue; // 0x18
	int32_t ArgumentValueInt; // 0x30
	float ArgumentValueFloat; // 0x34
	ETextGender ArgumentValueGender; // 0x38
};

struct FPreviewMeshCollectionEntry {
	TSoftObjectPtr<USkeletalMesh> SkeletalMesh; // 0x0
};

struct FVertexIndexAndInstanceID {
	int32_t ContourIndex; // 0x0
	FVertexInstanceID VertexInstanceID; // 0x4
};

struct FMaterialParamGroup {
	UMaterialInterface* Material; // 0x0
	TMap<FName, UTexture*> TextureParams; // 0x8
};

struct FServerToServerToken {
	FString AccountID; // 0x0
	FString NikeName; // 0x10
	int64_t UTCDateTime; // 0x20
};

struct FWindowStyle : FSlateWidgetStyle {
	FButtonStyle MinimizeButtonStyle; // 0x8
	FButtonStyle MaximizeButtonStyle; // 0x280
	FButtonStyle RestoreButtonStyle; // 0x4f8
	FButtonStyle CloseButtonStyle; // 0x770
	FTextBlockStyle TitleTextStyle; // 0x9e8
	FSlateBrush ActiveTitleBrush; // 0xc58
	FSlateBrush InactiveTitleBrush; // 0xce0
	FSlateBrush FlashTitleBrush; // 0xd68
	FSlateColor BackgroundColor; // 0xdf0
	FSlateBrush OutlineBrush; // 0xe18
	FSlateColor OutlineColor; // 0xea0
	FSlateBrush BorderBrush; // 0xec8
	FSlateBrush BackgroundBrush; // 0xf50
	FSlateBrush ChildBackgroundBrush; // 0xfd8
};

struct FAnimalFarmConfig {
	ASG_AnimalsCharacter* AnimalTemplate; // 0x0
	USGItem* AnimalItemTemplate; // 0x8
	USkeletalMesh* OverrideAnimalMeshMale; // 0x10
	USkeletalMesh* OverrideAnimalMeshFemale; // 0x18
	TArray<UAnimMontage*> AnimalMontages; // 0x20
	UAnimMontage* DeathAnimalMontage; // 0x30
	UNiagaraSystem* MaleNiagaraAsset; // 0x38
	UNiagaraSystem* FemaleNiagaraAsset; // 0x40
	float AnimalBirthTime; // 0x48
	float AnimalDeathTime; // 0x4c
	float AnimalGrowTime; // 0x50
	float AnimalConsumeFoodInterval; // 0x54
	float AnimalConsumeFood; // 0x58
	float AnimalInitMood; // 0x5c
	float AnimalConsumeMoodInterval; // 0x60
	float AnimalConsumeMood; // 0x64
	float AnimalConsumeMoodFoodStarvation; // 0x68
	float AnimalConsumeMoodEnvironmentBad; // 0x6c
	float AnimalConsumeMoodTooMuch; // 0x70
	float AnimalBaseBirth; // 0x74
	float AnimalBaseDeath; // 0x78
	float AnimalDeathByHealthMul; // 0x7c
	TMap<float, float> AnimalDeathByMoodMul; // 0x80
	float AnimalHealthInterval; // 0xd0
	float AnimalInitHealth; // 0xd4
	float AnimalMaxHealth; // 0xd8
	float AnimalNormalHealth; // 0xdc
	float AnimalBaseHealth; // 0xe0
	float AnimalHealthMul; // 0xe4
	float AnimalHealthSecondMul; // 0xe8
	float AnimalHealthMulAddEnvironmentFine; // 0xec
	float AnimalDropInterval; // 0xf0
	float AnimalBaseDropCount; // 0xf4
	float AnimalDropMul; // 0xf8
	float AnimalDropMulByLevel; // 0xfc
	int32_t AnimalDeathDropCount; // 0x100
	TArray<FAnimalFarmDropConifg> DropConifgs; // 0x108
	float AnimalDropCountMulEnvironmentBad; // 0x118
	char bEnableDeathDropCountByMood : 1; // 0x11c
	TMap<float, float> AnimalDropCountMulByMood; // 0x120
	TArray<USGItem*> LikeFoodTemplates; // 0x170
};

struct FAnimalWatchDataEntry {
	int32_t AnimalLifeTime; // 0x0
	int32_t AnimalLevel; // 0x4
	FString AnimalName; // 0x8
	ECharacterSex AnimalSex; // 0x18
	char bIsSpawn : 1; // 0x19
	TWeakObjectPtr<ASG_AnimalsCharacter> WatchCharacter; // 0x1c
};

struct FMapAmbientSoundData : FTableRowBase {
	FString AmbientSoundID; // 0x8
	TArray<FString> AdditiveAmbientSoundID; // 0x18
};

struct FMeshUVChannelInfo {
	bool bInitialized; // 0x0
	bool bOverrideDensities; // 0x1
	float LocalUVDensities[0x4]; // 0x4
};

struct FMsgRecord_StructureBannerEffectOwner : FMsgRecordBase {
	FString OtherGuildName; // 0x10
	int32_t EffectPrestigeValue; // 0x20
};

struct FStaticMaterial {
	UMaterialInterface* MaterialInterface; // 0x0
	FName MaterialSlotName; // 0x8
	FName ImportedMaterialSlotName; // 0x10
	FMeshUVChannelInfo UVChannelData; // 0x18
};

struct FNameCurve : FIndexedCurve {
	TArray<FNameCurveKey> Keys; // 0x68
};

struct FProcMeshVertex {
	FVector position; // 0x0
	FVector Normal; // 0xc
	FProcMeshTangent Tangent; // 0x18
	FColor Color; // 0x28
	FVector2D UV0; // 0x2c
	FVector2D UV1; // 0x34
	FVector2D UV2; // 0x3c
	FVector2D UV3; // 0x44
};

struct FMovieSceneNiagaraBoolParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	FMovieSceneBoolChannel BoolChannel; // 0x40
};

struct FClothMaskTextureArray {
	TArray<UTexture2D*> Textures; // 0x0
};

struct FFilm {
	FAO_Parameters AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7; // 0x0
	FDebug_Parameters Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698; // 0x50
	FGI_Parameters GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C; // 0x168
	FLandscapeAndFoliage_Parameter LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x378
	FReflection_Parameters Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x458
	FShadow_Parameters Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684; // 0x588
	FSkyLight_Parameters SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC; // 0x6a8
	FSSGI_Parameters SSGI_Parameters_305_9CC406044A818EB967A668A89E2BCB07; // 0x748
	FTranslucency_Parameters Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x778
	FWater_Caustics_Parameters WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x8b8
	FMesh_Caustics_Parameters MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0xa68
	FDLSS_Parameters DLSSParameters_310_1FF18AE34628A2E7E3B9D1A3B90943A2; // 0xbc8
	FDistanceField_Parameters DistanceFields_313_5A2B981B4143CD453F43BABB3D5202F6; // 0xc80
	FRTX_PostProcess_Settings RTXPostProcessSettings_316_87CE5EF04E423A2573F0718792B9B575; // 0xcc0
	FDataType_Support DataTypeSupport_319_6F9BCE734E712BCA043CC89EFAC55DE2; // 0x1230
};

struct FClothConstraintSetup_Legacy {
	float Stiffness; // 0x0
	float StiffnessMultiplier; // 0x4
	float StretchLimit; // 0x8
	float CompressionLimit; // 0xc
};

struct FRawDistributionVector : FRawDistribution {
	float MinValue; // 0x20
	float MaxValue; // 0x24
	FVector MinValueVec; // 0x28
	FVector MaxValueVec; // 0x34
	UDistributionVector* Distribution; // 0x40
};

struct FTimeStateSetting {
	FName SoundID; // 0x0
	FVector2D TimeStateRange; // 0x8
};

struct FSimulatedRootMotionReplicatedMove {
	double Time; // 0x0
	FRepRootMotionMontage RootMotion; // 0x8
};

struct FBPEditorBookmarkNode {
	FGuid NodeGuid; // 0x0
	FGuid ParentGuid; // 0x10
	FText DisplayName; // 0x20
};

struct FAssetEditorOrbitCameraPosition {
	bool bIsSet; // 0x0
	FVector CamOrbitPoint; // 0x4
	FVector CamOrbitZoom; // 0x10
	FRotator CamOrbitRotation; // 0x1c
};

struct FVirtualTextureBuildSettings {
	int32_t TileSize; // 0x0
	int32_t TileBorderSize; // 0x4
	bool bEnableCompressCrunch; // 0x8
	bool bEnableCompressZlib; // 0x9
};

struct FLevelCollection {
	AGameStateBase* GameState; // 0x8
	UNetDriver* NetDriver; // 0x10
	UDemoNetDriver* DemoNetDriver; // 0x18
	ULevel* PersistentLevel; // 0x20
	TSet<ULevel*> Levels; // 0x28
};

struct FARSessionPayload {
	int32_t ConfigFlags; // 0x0
	UMaterialInterface* DefaultMeshMaterial; // 0x8
	UMaterialInterface* DefaultWireframeMeshMaterial; // 0x10
};

struct FSubtitleCue {
	FText Text; // 0x0
	float Time; // 0x18
};

struct FSplineMeshParams {
	FVector StartPos; // 0x0
	FVector StartTangent; // 0xc
	FVector2D StartScale; // 0x18
	float StartRoll; // 0x20
	FVector2D StartOffset; // 0x24
	FVector EndPos; // 0x2c
	FVector2D EndScale; // 0x38
	FVector EndTangent; // 0x40
	float EndRoll; // 0x4c
	FVector2D EndOffset; // 0x50
};

struct FMovieSceneCameraShakeSourceTriggerSectionTemplate : FMovieSceneEvalTemplate {
	TArray<FFrameNumber> TriggerTimes; // 0x20
	TArray<FMovieSceneCameraShakeSourceTrigger> TriggerValues; // 0x30
};

struct FStatusPostProcess {
	int32_t Index; // 0x0
};

struct FHairData {
	FName HairName; // 0x0
	FLinearColor HairColor; // 0x8
};

struct FAnimNode_Fabrik : FAnimNode_SkeletalControlBase {
	FTransform EffectorTransform; // 0xd0
	FBoneSocketTarget EffectorTarget; // 0x100
	FBoneReference TipBone; // 0x160
	FBoneReference RootBone; // 0x170
	float Precision; // 0x180
	int32_t MaxIterations; // 0x184
	EBoneControlSpace EffectorTransformSpace; // 0x188
	EBoneRotationSource EffectorRotationSource; // 0x189
};

struct FNetAnalyticsDataConfig {
	FName DataName; // 0x0
	bool bEnabled; // 0x8
};

struct FLandscapeAndFoliage_Parameter {
	FString EnableLandscapeDetectTextureStreaming_8_34CD37624CF32D930CE49B8AE1EDF932; // 0x0
	FString EnableLandscapeLODUpdateEveryFrame_9_5FA37320403A8777FE4A8FA2225C2F81; // 0x10
	FString EnableInstancedStaticMesh_10_F759681E42E05A6B2AC9FEA6EE2E717F; // 0x20
	FString EnableInstancedStaticMeshesCulling_11_DB7739364F5EED0508F78483F32D333D; // 0x30
	FString InstancedStaticMeshesCullingRadius_12_790EF6C34AB6F7B443A365B703D17049; // 0x40
	FString EnableLandscapeInRT_13_EB1398FC4CE59D76E6A49B9D289BA6A2; // 0x50
	FString InstancedStaticMeshesCullingAngle_16_6EB44C0E474474F85AD359B7B8A0B9BC; // 0x60
	FString InstancedStaticMeshesEvaluateWPO_22_3E0D1EF54BCDB5B2D1E1A48429415469; // 0x70
	FString InstancedStaticMeshesSimulationCount_23_3F44BC814B40CF9EB483F2A9D063BB0A; // 0x80
	FString ShadowUseBiasForSkipWPOEval_24_EE03629D4D672D9F32340FBB0ED1F0A9; // 0x90
	FString ShadowMaxBiasForInexactGeometry_25_50FA131B48D2AEE0BE24A1AAEBCC1205; // 0xa0
	FString AutoInstance_29_703C2F464F835FBA52AF74ABDEE8DC9D; // 0xb0
	FString AOUseBiasForSkipWPOEval_33_2006F3134F1344D7F76F8FAA1D641BBB; // 0xc0
	FString AOMaxBiasForInexactGeometry_34_C821B15B4E6AADD30289B4BBC8CE3C09; // 0xd0
};

struct FLandscapeInfoLayerSettings {
	ULandscapeLayerInfoObject* LayerInfoObj; // 0x0
	FName LayerName; // 0x8
};

struct FArtofWar {
	int32_t PerkIndex; // 0x0
	int32_t AWLevel; // 0x4
	int32_t AWExp; // 0x8
};

struct FXbox {
	FAO_Parameters AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7; // 0x0
	FDebug_Parameters Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698; // 0x50
	FGI_Parameters GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C; // 0x168
	FLandscapeAndFoliage_Parameter LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x378
	FReflection_Parameters Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x458
	FShadow_Parameters Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684; // 0x588
	FSkyLight_Parameters SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC; // 0x6a8
	FSSGI_Parameters SSGI_Parameters_305_9CC406044A818EB967A668A89E2BCB07; // 0x748
	FTranslucency_Parameters Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x778
	FWater_Caustics_Parameters WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x8b8
	FMesh_Caustics_Parameters MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0xa68
	FDLSS_Parameters DLSSParameters_310_7E4DC0424931B31C9DF0779DC71B119B; // 0xbc8
	FDistanceField_Parameters DistanceFields_313_E040C93F4DA73BF710F794BF29AA50B6; // 0xc80
	FRTX_PostProcess_Settings RTXPostProcessSettings_316_79EC232848BAB964A67DDB9C114B7FDA; // 0xcc0
	FDataType_Support DataTypeSupport_319_494E11E145D7CB4FE9D0638B520247FA; // 0x1230
};

struct FComboBoxStyle : FSlateWidgetStyle {
	FComboButtonStyle ComboButtonStyle; // 0x8
	FSlateSound PressedSlateSound; // 0x3c0
	FSlateSound SelectionChangeSlateSound; // 0x3d8
};

struct FPrimaryAssetRules {
	int32_t Priority; // 0x0
	int32_t ChunkId; // 0x4
	bool bApplyRecursively; // 0x8
	EPrimaryAssetCookRule CookRule; // 0x9
};

struct FStaticMeshSourceModel {
	FMeshBuildSettings BuildSettings; // 0x0
	FMeshReductionSettings ReductionSettings; // 0x30
	float LODDistance; // 0x54
	FPerPlatformFloat ScreenSize; // 0x58
	FString SourceImportFilename; // 0x60
};

struct FLiveLinkSourceDebugInfo {
	FLiveLinkSubjectName SubjectName; // 0x0
	int32_t SnapshotIndex; // 0x8
	int32_t NumberOfBufferAtSnapshot; // 0xc
};

struct FSetPlayerTaskInfo {
	TWeakObjectPtr<ASGPlayerCharacter> Player; // 0x0
	ESetPlayerTaskInfoStep SetPlayerTaskInfoStep; // 0x8
	int32_t SoliderType; // 0xc
	int32_t PerkIndex; // 0x10
};

struct FSessionNameLocalization : FTableRowBase {
	FText SessionName; // 0x8
};

struct FTextureLODGroup {
	TextureGroup Group; // 0x0
	int32_t LODBias; // 0xc
	int32_t LODBias_Smaller; // 0x10
	int32_t LODBias_Smallest; // 0x14
	int32_t NumStreamedMips; // 0x1c
	TextureMipGenSettings MipGenSettings; // 0x20
	int32_t MinLODSize; // 0x24
	int32_t MaxLODSize; // 0x28
	int32_t MaxLODSize_Smaller; // 0x2c
	int32_t MaxLODSize_Smallest; // 0x30
	int32_t OptionalLODBias; // 0x34
	int32_t OptionalMaxLODSize; // 0x38
	FName MinMagFilter; // 0x40
	FName MipFilter; // 0x48
	ETextureMipLoadOptions MipLoadOptions; // 0x50
	bool DuplicateNonOptionalMips; // 0x51
	float Downscale; // 0x54
	ETextureDownscaleOptions DownscaleOptions; // 0x58
	int32_t VirtualTextureTileCountBias; // 0x5c
	int32_t VirtualTextureTileSizeBias; // 0x60
};

struct FEditorImportWorkflowDefinition {
	FFilePath ImportFilePath; // 0x0
	TArray<FImportFactorySettingValues> FactorySettings; // 0x10
};

struct FGameplayAbilityActorInfo {
	TWeakObjectPtr<AActor> OwnerActor; // 0x8
	TWeakObjectPtr<AActor> AvatarActor; // 0x10
	TWeakObjectPtr<APlayerController> PlayerController; // 0x18
	TWeakObjectPtr<UAbilitySystemComponent> AbilitySystemComponent; // 0x20
	TWeakObjectPtr<USkeletalMeshComponent> SkeletalMeshComponent; // 0x28
	TWeakObjectPtr<UAnimInstance> AnimInstance; // 0x30
	TWeakObjectPtr<UMovementComponent> MovementComponent; // 0x38
	FName AffectedAnimInstanceTag; // 0x40
};

struct FFollicleMaskOptions {
	UGroomAsset* Groom; // 0x0
	EFollicleMaskChannel Channel; // 0x8
};

struct FPurchaseInfo {
	FString Identifier; // 0x0
	FString DisplayName; // 0x10
	FString DisplayDescription; // 0x20
	FString DisplayPrice; // 0x30
};

struct FAnimalsTransitions {
	TMap<EAnimalsStanceType, UAnimMontage*> TMap_StanceTransitionMontages; // 0x0
	TMap<EAnimalsStanceType, UAnimMontage*> TMap_StanceQuickTransitionMontages; // 0x50
	TMap<EAnimalsBehaviorType, FAnimalsCustomBehavior> TMap_BehaviorTransitionMontages; // 0xa0
	UAnimMontage* GetUpFromFront; // 0xf0
	UAnimMontage* GetUpFromBack; // 0xf8
	UAnimMontage* Neigh; // 0x100
	FCustomMontageData GaitDownData; // 0x108
	FCustomMontageData GaitUpData; // 0x120
};

struct FGameplayEffectSpecForRPC {
	UGameplayEffect* Def; // 0x0
	TArray<FGameplayEffectModifiedAttribute> ModifiedAttributes; // 0x8
	FGameplayEffectContextHandle EffectContext; // 0x18
	FGameplayTagContainer AggregatedSourceTags; // 0x30
	FGameplayTagContainer AggregatedTargetTags; // 0x50
	float Level; // 0x70
	float AbilityLevel; // 0x74
};

struct FNiagaraSpawnInfo {
	int32_t Count; // 0x0
	float InterpStartDt; // 0x4
	float IntervalDt; // 0x8
	int32_t SpawnGroup; // 0xc
};

struct FMovieSceneEvaluationFieldSegmentPtr : FMovieSceneEvaluationFieldTrackPtr {
	FMovieSceneSegmentIdentifier SegmentID; // 0x8
};

struct FAnimNotifyArray {
	TArray<FAnimNotifyEventReference> Notifies; // 0x0
};

struct FCharacterStatisticsInfo {
	int32_t CollectBarkNum; // 0x0
	int32_t CollectBranchesNum; // 0x4
	int32_t CollectHardwoodNum; // 0x8
	int32_t CollectIntactwoodNum; // 0xc
	int32_t CollectRarewoodNum; // 0x10
	int32_t CollectGravelNum; // 0x14
	int32_t CollectStoneNum; // 0x18
	int32_t CollectIntactstoneNum; // 0x1c
	int32_t CollectRarestoneNum; // 0x20
	int32_t CollectSandNum; // 0x24
	int32_t CollectClayNum; // 0x28
	int32_t CollectKaolinNum; // 0x2c
	int32_t CollectThatchNum; // 0x30
	int32_t CollectLocustNum; // 0x34
	int32_t CollectChrysanthemumNum; // 0x38
	int32_t CollectAconitumNum; // 0x3c
	int32_t CollectMeatNum; // 0x40
	int32_t CollectRoughhideNum; // 0x44
	int32_t CollectExquisitehideNum; // 0x48
	int32_t CollectPerfecthideNum; // 0x4c
	int32_t CollectRarehideNum; // 0x50
	int32_t CollectBeastBonesNum; // 0x54
	int32_t CollectBeastTendonNum; // 0x58
	int32_t CollectBeastHornsNum; // 0x5c
	int32_t CollectBeastHairNum; // 0x60
	int32_t CollectFangsNum; // 0x64
	int32_t CollectCopperNum; // 0x68
	int32_t CollectIconNum; // 0x6c
	int32_t CollectDarksteelNum; // 0x70
	int32_t CollectSideriteNum; // 0x74
	int32_t CollectSaltNum; // 0x78
	int32_t CollectRealgarNum; // 0x7c
	int32_t CollectCoalNum; // 0x80
	int32_t CollectSulfurNum; // 0x84
	int32_t CollectSaltpeterNum; // 0x88
	int32_t CollectLowcropsNum; // 0x8c
	int32_t CollectCommoncropsNum; // 0x90
	int32_t CollectHighcropsNum; // 0x94
	int32_t CollectPremiumcropsNum; // 0x98
	int32_t MultiKillNum; // 0x9c
	int32_t KillNotLowSelfLv5WolfNum; // 0xa0
	int32_t KillNotLowSelfLv5BearNum; // 0xa4
	int32_t KillNotLowSelfLv5RhinocerosNum; // 0xa8
	int32_t KillNotLowSelfLv5TigerNum; // 0xac
	int32_t KillNotLowSelfLv5ElephantNum; // 0xb0
	int32_t KillNotLowSelfLv5CrocodileNum; // 0xb4
	int32_t KillNotLowSelfLv5CheetahNum; // 0xb8
	int32_t KillNotLowSelfLv5PigNum; // 0xbc
	int32_t KillNotLowSelfLv5FoxNum; // 0xc0
	int32_t TameHorseNum; // 0xc4
	int32_t TameGeneralNum; // 0xc8
	int32_t MaxLevelGeneralNum; // 0xcc
	int32_t CreateStructureItemNum; // 0xd0
	int32_t CraftThirtyWeaponNum; // 0xd4
	int32_t CraftFiftyWeaponNum; // 0xd8
	int32_t CraftSeventyWeaponNum; // 0xdc
	int32_t CraftHundredWeaponNum; // 0xe0
	int32_t CraftThirtyArmorNum; // 0xe4
	int32_t CraftFiftyArmorNum; // 0xe8
	int32_t CraftSeventyArmorNum; // 0xec
	int32_t CraftHundredArmorNum; // 0xf0
	int32_t UnlockHuangLiNum; // 0xf4
	int32_t GuildLevel; // 0xf8
	bool bGuildLeader; // 0xfc
	int32_t ResourceCentresNum; // 0x100
	int32_t DeathNum; // 0x104
	int32_t FallDeathNum; // 0x108
	int32_t DeathByOppositeSexNum; // 0x10c
	int32_t PerkNum; // 0x110
	int32_t KillEnemyNum; // 0x114
	int32_t TroubleKillNum; // 0x118
	int32_t FourKillNum; // 0x11c
	int32_t FiveKillNum; // 0x120
	int32_t SixKillNum; // 0x124
	int32_t TenKillNum; // 0x128
	int32_t KillByFistNum; // 0x12c
	int32_t KillByFootNum; // 0x130
	int32_t RevengeNum; // 0x134
	float PutPoisonValue; // 0x138
	int32_t SameTimeBreakStructureNum; // 0x13c
	int32_t BreakStructureItemBySiegeNum; // 0x140
	int32_t KillEnemyBySiegeNum; // 0x144
	int32_t BreakSiegeNum; // 0x148
	int32_t BowHitFromHundredNum; // 0x14c
	int32_t BowSerialHitNum; // 0x150
	int32_t CrossBowHitFromHundredNum; // 0x154
	int32_t CrossBowSerialHitNum; // 0x158
	int32_t ShootWeaponHitHeadNum; // 0x15c
	int32_t ShootWeaponSerialHitHeadNum; // 0x160
	int32_t ShootWeaponHitKneeNum; // 0x164
	int32_t ShootWeaponKillBackNum; // 0x168
	int32_t ShootWeaponKillFrontNum; // 0x16c
	int32_t ProjectileKillAfterDeadNum; // 0x170
	int32_t ShieldSerialBlockNum; // 0x174
	int32_t BackShieldBlockArrowNum; // 0x178
	int32_t ShieldKillEnemyNum; // 0x17c
	int32_t MeleeWeaponSerialHitNum; // 0x180
	int32_t MeleeWeaponSerialBlockNum; // 0x184
	int32_t MeleeWeaponSingleHitEnemyNum; // 0x188
	int32_t MeleeWeaponKillHeadEnemyNum; // 0x18c
	int32_t MeleeWeaponBreakArmorNum; // 0x190
	int32_t MeleeWeaponFakerNum; // 0x194
	int32_t SingleKnockedDownEnemyNum; // 0x198
	int32_t KilledEnemyNumByCollision; // 0x19c
	int32_t MeleeWeaponHitTumblingEnemyWhenRiding; // 0x1a0
	int32_t BackKillEnemyNumWhenRiding; // 0x1a4
	int32_t ShooterWeaponKillEnemyNumWhenRiding; // 0x1a8
	int32_t KillRefugeesNum; // 0x1ac
	int32_t HitHeadKillNotLowSelfLv5HuangJinJunNum; // 0x1b0
	int32_t HitChestKillNotLowSelfLv5HuangJinJunNum; // 0x1b4
	int32_t HitLegKillNotLowSelfLv5HuangJinJunNum; // 0x1b8
	int32_t HitHeadKillNotLowSelfLv5ShuiZeiNum; // 0x1bc
	int32_t HitChestKillNotLowSelfLv5ShuiZeiNum; // 0x1c0
	int32_t HitLegKillNotLowSelfLv5ShuiZeiNum; // 0x1c4
	int32_t HitHeadKillNotLowSelfLv5HanJunNum; // 0x1c8
	int32_t HitChestKillNotLowSelfLv5HanJunNum; // 0x1cc
	int32_t HitLegKillNotLowSelfLv5HanJunNum; // 0x1d0
	int32_t HitHeadKillNotLowSelfLv5RobberNum; // 0x1d4
	int32_t HitChestKillNotLowSelfLv5RobberNum; // 0x1d8
	int32_t HitLegKillNotLowSelfLv5RobberNum; // 0x1dc
	int32_t HitHeadKillNotLowSelfLv5LieHuNum; // 0x1e0
	int32_t HitChestKillNotLowSelfLv5LieHuNum; // 0x1e4
	int32_t HitLegKillNotLowSelfLv5LieHuNum; // 0x1e8
	int32_t KillNotLowSelfLv5EliteNum; // 0x1ec
	int32_t KillNotLowSelfLv5BossNum; // 0x1f0
	int32_t JoinXianChengBattleCount; // 0x1f4
	int32_t JoinTaiShouBattleCount; // 0x1f8
	int32_t CookingFoodNum; // 0x1fc
};

struct FMovieSceneTrackEvalOptions {
	char bCanEvaluateNearestSection : 1; // 0x0
	char bEvalNearestSection : 1; // 0x0
	char bEvaluateInPreroll : 1; // 0x0
	char bEvaluateInPostroll : 1; // 0x0
	char bEvaluateNearestSection : 1; // 0x0
};

struct FGoodsSellerTimeHanle {
	FTimerHandle RefreshGoodsTimeHandle; // 0x0
	FTimerHandle RefreshCapitalTimeHandle; // 0x8
};

struct FGuildEventRegionData {
	FVector2D RegionMin; // 0x0
	FVector2D RegionMax; // 0x8
	char bCheckOccupyRange : 1; // 0x10
	char bDrawRegionData : 1; // 0x10
	FLinearColor DrawColor; // 0x14
};

struct FRBFTarget : FRBFEntry {
	float ScaleFactor; // 0x10
	bool bApplyCustomCurve; // 0x14
	FRichCurve CustomCurve; // 0x18
	ERBFDistanceMethod DistanceMethod; // 0x98
	ERBFFunctionType FunctionType; // 0x99
};

struct FGameplayEffectAttributeCaptureDefinition {
	FGameplayAttribute AttributeToCapture; // 0x0
	EGameplayEffectAttributeCaptureSource AttributeSource; // 0x38
	bool bSnapshot; // 0x39
};

struct FHairInterpolationSettings {
	bool bOverrideGuides; // 0x0
	float HairToGuideDensity; // 0x4
	EHairInterpolationQuality InterpolationQuality; // 0x8
	EHairInterpolationWeight InterpolationDistance; // 0x9
	bool bRandomizeGuide; // 0xa
	bool bUseUniqueGuide; // 0xb
};

struct FIndexedCurve {
	FKeyHandleMap KeyHandlesToIndices; // 0x8
};

struct FWeightedBlendable {
	float Weight; // 0x0
	UObject* Object; // 0x8
};

struct FBlockInfo {
	UAnimMontage* BlockAnim; // 0x0
	float SPEvent_StartBlockMul; // 0x8
	float SPEvent_BlockHitMul; // 0xc
};

struct FCachedAnimStateData {
	FName StateMachineName; // 0x0
	FName StateName; // 0x8
};

struct FConstraintDescriptionEx {
	FFilterOptionPerAxis AxesFilterOption; // 0x8
};

struct FHairLODSettings {
	float CurveDecimation; // 0x0
	float VertexDecimation; // 0x4
	float AngularThreshold; // 0x8
	float ScreenSize; // 0xc
	float ThicknessScale; // 0x10
	bool bVisible; // 0x14
	EGroomGeometryType GeometryType; // 0x15
};

struct FProceduralFoliageInstance {
	FQuat Rotation; // 0x0
	FVector Location; // 0x10
	float Age; // 0x1c
	FVector Normal; // 0x20
	float Scale; // 0x2c
	UFoliageType* Type; // 0x30
};

struct FInterpCurveQuat {
	TArray<FInterpCurvePointQuat> Points; // 0x0
	bool bIsLooped; // 0x10
	float LoopKeyOffset; // 0x14
};

struct FKeySettingConfig : FTableRowBase {
	EKeySettingType KeyType; // 0x8
	FText KeyName; // 0x10
	EKeyPressType PressType; // 0x28
	char bCanDuplicateKey : 1; // 0x29
	char bCanSetMouseButton : 1; // 0x29
};

struct FBattleGuildInfo {
	FGuid GuildUid; // 0x0
	FString GuildName; // 0x10
};

struct FPrimaryAssetType {
	FName Name; // 0x0
};

struct FSGInputBlendPose {
	TArray<FInputBlendPose> LayerSetup; // 0x0
};

struct FCustomProfile {
	FName Name; // 0x0
	TArray<FResponseChannel> CustomResponses; // 0x8
};

struct FBroadphaseSettings {
	bool bUseMBPOnClient; // 0x0
	bool bUseMBPOnServer; // 0x1
	bool bUseMBPOuterBounds; // 0x2
	FBox MBPBounds; // 0x4
	FBox MBPOuterBounds; // 0x20
	uint32_t MBPNumSubdivs; // 0x3c
};

struct FMovieSceneGeometryCollectionSectionTemplateParameters : FMovieSceneGeometryCollectionParams {
	FFrameNumber SectionStartTime; // 0x30
	FFrameNumber SectionEndTime; // 0x34
};

struct FBeamModifierOptions {
	char bModify : 1; // 0x0
	char bScale : 1; // 0x0
	char bLock : 1; // 0x0
};

struct FGPUSpriteResourceData {
	TArray<FColor> QuantizedColorSamples; // 0x0
	TArray<FColor> QuantizedMiscSamples; // 0x10
	TArray<FColor> QuantizedSimulationAttrSamples; // 0x20
	FVector4 ColorScale; // 0x30
	FVector4 ColorBias; // 0x40
	FVector4 MiscScale; // 0x50
	FVector4 MiscBias; // 0x60
	FVector4 SimulationAttrCurveScale; // 0x70
	FVector4 SimulationAttrCurveBias; // 0x80
	FVector4 SubImageSize; // 0x90
	FVector4 SizeBySpeed; // 0xa0
	FVector ConstantAcceleration; // 0xb0
	FVector OrbitOffsetBase; // 0xbc
	FVector OrbitOffsetRange; // 0xc8
	FVector OrbitFrequencyBase; // 0xd4
	FVector OrbitFrequencyRange; // 0xe0
	FVector OrbitPhaseBase; // 0xec
	FVector OrbitPhaseRange; // 0xf8
	float GlobalVectorFieldScale; // 0x104
	float GlobalVectorFieldTightness; // 0x108
	float PerParticleVectorFieldScale; // 0x10c
	float PerParticleVectorFieldBias; // 0x110
	float DragCoefficientScale; // 0x114
	float DragCoefficientBias; // 0x118
	float ResilienceScale; // 0x11c
	float ResilienceBias; // 0x120
	float CollisionRadiusScale; // 0x124
	float CollisionRadiusBias; // 0x128
	float CollisionTimeBias; // 0x12c
	float CollisionRandomSpread; // 0x130
	float CollisionRandomDistribution; // 0x134
	float OneMinusFriction; // 0x138
	float RotationRateScale; // 0x13c
	float CameraMotionBlurAmount; // 0x140
	EParticleScreenAlignment ScreenAlignment; // 0x144
	EParticleAxisLock LockAxisFlag; // 0x145
	FVector2D PivotOffset; // 0x148
	char bRemoveHMDRoll : 1; // 0x150
	float MinFacingCameraBlendDistance; // 0x154
	float MaxFacingCameraBlendDistance; // 0x158
};

struct FExponentialHeightFogData {
	float FogDensity; // 0x0
	float FogHeightFalloff; // 0x4
	float FogHeightOffset; // 0x8
};

struct FMsgClientSystem : FMessageBase {
	FString SystemString; // 0x8
};

struct FLightningAttachment {
	EAttachType Type; // 0x0
	FVector Location; // 0x4
	FActorAttachParams ActorAttachParams; // 0x10
	FVector Direction; // 0x28
	EAttachVolumeType AttachVolumeType; // 0x34
	FAttachVolumeBox AttachVolumeBox; // 0x38
	FAttachVolumeCylinder AttachVolumeCylinder; // 0x44
	FAttachVolumeSphere AttachVolumeSphere; // 0x58
};

struct FAIAttackInfo {
	float AttackWeight; // 0x0
	float AttackCDTime; // 0x4
	float AttackDurationTime; // 0x8
	float MinAttackRange; // 0xc
	float MaxAttackRange; // 0x10
	float AttackHalfAngle; // 0x14
	float AttackTurnAroundRange; // 0x18
	float BaseDamageAmountMin; // 0x1c
	float BaseDamageAmountMax; // 0x20
	float BaseCollectionDamageAmountMin; // 0x24
	float BaseCollectionDamageAmountMax; // 0x28
	char bIsUseForCorpse : 1; // 0x2c
	char bIsSwimmingAttack : 1; // 0x2c
	char bIsRiderControlAttack : 1; // 0x2c
	float RiderControlAttackCostSP; // 0x30
	char bCanBeAbort : 1; // 0x34
	char bShouldCalcBrakingDistance : 1; // 0x34
	float AttackFailureTime; // 0x38
	TArray<FRandomWeightMontage> AttackAnims; // 0x40
	UBaseAIAttackState* AttackStateClass; // 0x50
	double LastEndAttackTime; // 0x58
};

struct FFontImportOptionsData {
	FString FontName; // 0x0
	float Height; // 0x10
	char bEnableAntialiasing : 1; // 0x14
	char bEnableBold : 1; // 0x14
	char bEnableItalic : 1; // 0x14
	char bEnableUnderline : 1; // 0x14
	char bAlphaOnly : 1; // 0x14
	EFontImportCharacterSet CharacterSet; // 0x18
	FString Chars; // 0x20
	FString UnicodeRange; // 0x30
	FString CharsFilePath; // 0x40
	FString CharsFileWildcard; // 0x50
	char bCreatePrintableOnly : 1; // 0x60
	char bIncludeASCIIRange : 1; // 0x60
	FLinearColor ForegroundColor; // 0x64
	char bEnableDropShadow : 1; // 0x74
	int32_t TexturePageWidth; // 0x78
	int32_t TexturePageMaxHeight; // 0x7c
	int32_t XPadding; // 0x80
	int32_t YPadding; // 0x84
	int32_t ExtendBoxTop; // 0x88
	int32_t ExtendBoxBottom; // 0x8c
	int32_t ExtendBoxRight; // 0x90
	int32_t ExtendBoxLeft; // 0x94
	char bEnableLegacyMode : 1; // 0x98
	int32_t Kerning; // 0x9c
	char bUseDistanceFieldAlpha : 1; // 0xa0
	int32_t DistanceFieldScaleFactor; // 0xa4
	float DistanceFieldScanRadiusScale; // 0xa8
};

struct FBandwidthTestItem {
	TArray<char> Kilobyte; // 0x0
};

struct FDirectoryPath {
	FString Path; // 0x0
};

struct FPoseDataContainer {
	TArray<FSmartName> PoseNames; // 0x0
	TArray<FName> Tracks; // 0x10
	TMap<FName, int32_t> TrackMap; // 0x20
	TArray<FPoseData> Poses; // 0x70
	TArray<FAnimCurveBase> Curves; // 0x80
};

struct FRootMotionSource_JumpForce : FRootMotionSource {
	FRotator Rotation; // 0x98
	float Distance; // 0xa4
	float Height; // 0xa8
	bool bDisableTimeout; // 0xac
	UCurveVector* PathOffsetCurve; // 0xb0
	UCurveFloat* TimeMappingCurve; // 0xb8
};

struct FClothConfig_Legacy {
	EClothingWindMethod_Legacy WindMethod; // 0x0
	FClothConstraintSetup_Legacy VerticalConstraintConfig; // 0x4
	FClothConstraintSetup_Legacy HorizontalConstraintConfig; // 0x14
	FClothConstraintSetup_Legacy BendConstraintConfig; // 0x24
	FClothConstraintSetup_Legacy ShearConstraintConfig; // 0x34
	float SelfCollisionRadius; // 0x44
	float SelfCollisionStiffness; // 0x48
	float SelfCollisionCullScale; // 0x4c
	FVector Damping; // 0x50
	float Friction; // 0x5c
	float WindDragCoefficient; // 0x60
	float WindLiftCoefficient; // 0x64
	FVector LinearDrag; // 0x68
	FVector AngularDrag; // 0x74
	FVector LinearInertiaScale; // 0x80
	FVector AngularInertiaScale; // 0x8c
	FVector CentrifugalInertiaScale; // 0x98
	float SolverFrequency; // 0xa4
	float StiffnessFrequency; // 0xa8
	float GravityScale; // 0xac
	FVector GravityOverride; // 0xb0
	bool bUseGravityOverride; // 0xbc
	float TetherStiffness; // 0xc0
	float TetherLimit; // 0xc4
	float CollisionThickness; // 0xc8
	float AnimDriveSpringStiffness; // 0xcc
	float AnimDriveDamperStiffness; // 0xd0
};

struct FAnimalsModifyBoneData {
	FString AnimalTypeString; // 0x0
	TArray<FAnimalsModifyBoneSettings> AnimalsModifyBoneSettings; // 0x10
};

struct FMovieSceneNiagaraVectorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	FMovieSceneFloatChannel VectorChannels[0x4]; // 0x40
	int32_t ChannelsUsed; // 0x2c0
};

struct FLegendGeneralDataInfo {
	int32_t LegendId; // 0x0
	char bActived : 1; // 0x4
	char ItemsActivedStates; // 0x5
	FDateTime ExpiredTime; // 0x8
	FGuid AssignedGeneralGuid; // 0x10
};

struct FRootMotionSourceStatus {
	char Flags; // 0x0
};

struct FFontCharacter {
	int32_t StartU; // 0x0
	int32_t StartV; // 0x4
	int32_t USize; // 0x8
	int32_t VSize; // 0xc
	char TextureIndex; // 0x10
	int32_t VerticalOffset; // 0x14
};

struct FBlueprintInputActionDelegateBinding : FBlueprintInputDelegateBinding {
	FName InputActionName; // 0x4
	EInputEvent InputKeyEvent; // 0xc
	FName FunctionNameToBind; // 0x10
};

struct FKawaiiPhysicsModifyBone {
	FBoneReference BoneRef; // 0x0
	int32_t ParentIndex; // 0x10
	TArray<int32_t> ChildIndexs; // 0x18
	FKawaiiPhysicsSettings PhysicsSettings; // 0x28
	FVector Location; // 0x44
	FVector PrevLocation; // 0x50
	FQuat PrevRotation; // 0x60
	FVector PoseLocation; // 0x70
	FQuat PoseRotation; // 0x80
	FVector PoseScale; // 0x90
	float LengthFromRoot; // 0x9c
	bool bDummy; // 0xa0
};

struct FDestructibleSpecialHierarchyDepths {
	int32_t SupportDepth; // 0x0
	int32_t MinimumFractureDepth; // 0x4
	bool bEnableDebris; // 0x8
	int32_t DebrisDepth; // 0xc
	int32_t EssentialDepth; // 0x10
};

struct FClothCollisionPrim_SphereConnection {
	int32_t SphereIndices[0x2]; // 0x0
};

struct FActorLayer {
	FName Name; // 0x0
};

struct FNavAvoidanceMask {
	char bGroup0 : 1; // 0x0
	char bGroup1 : 1; // 0x0
	char bGroup2 : 1; // 0x0
	char bGroup3 : 1; // 0x0
	char bGroup4 : 1; // 0x0
	char bGroup5 : 1; // 0x0
	char bGroup6 : 1; // 0x0
	char bGroup7 : 1; // 0x0
	char bGroup8 : 1; // 0x1
	char bGroup9 : 1; // 0x1
	char bGroup10 : 1; // 0x1
	char bGroup11 : 1; // 0x1
	char bGroup12 : 1; // 0x1
	char bGroup13 : 1; // 0x1
	char bGroup14 : 1; // 0x1
	char bGroup15 : 1; // 0x1
	char bGroup16 : 1; // 0x2
	char bGroup17 : 1; // 0x2
	char bGroup18 : 1; // 0x2
	char bGroup19 : 1; // 0x2
	char bGroup20 : 1; // 0x2
	char bGroup21 : 1; // 0x2
	char bGroup22 : 1; // 0x2
	char bGroup23 : 1; // 0x2
	char bGroup24 : 1; // 0x3
	char bGroup25 : 1; // 0x3
	char bGroup26 : 1; // 0x3
	char bGroup27 : 1; // 0x3
	char bGroup28 : 1; // 0x3
	char bGroup29 : 1; // 0x3
	char bGroup30 : 1; // 0x3
	char bGroup31 : 1; // 0x3
};

struct FHorizonDialogueSegmentInfoRubyTextStyle {
	TArray<FString> Text; // 0x0
	TArray<FSlateColor> ColorAndOpacity; // 0x10
	TArray<FSlateFontInfo> Font; // 0x20
	TArray<FVector2D> ShadowOffset; // 0x30
	TArray<FSlateColor> ShadowColorAndOpacity; // 0x40
	TArray<FMargin> PaddingMargin; // 0x50
};

struct FBakedFloatCustomAttribute {
	FName AttributeName; // 0x0
	FSimpleCurve FloatCurve; // 0x8
};

struct FOccupyDetailInfo {
	FGuid AllianceId; // 0x0
	FString AllianceName; // 0x10
	FString AllianceOwnerName; // 0x20
	char bAllianceOwnerGuild : 1; // 0x30
	FGuid GuildId; // 0x34
	FString GuildName; // 0x48
	FString GuildOwnerName; // 0x58
	int32_t GuildOwnerJob; // 0x68
	FString ImageJson; // 0x70
	int32_t GuildLevel; // 0x80
	int32_t GuildMemberCount; // 0x84
	int32_t OccupyGuanAiNum; // 0x88
	int32_t OccupyCityNum; // 0x8c
	int32_t OccupyXianChengNum; // 0x90
	TArray<float> TaxRate; // 0x98
	TArray<FWorship> Worships; // 0xa8
	int32_t ServerId; // 0xb8
};

struct FSourceEffectEQSettings {
	TArray<FSourceEffectEQBand> EQBands; // 0x0
};

struct FStrengthTextureInfo {
	int32_t Level; // 0x0
	TSoftObjectPtr<UTexture2D> Texture2D; // 0x8
};

struct FRootMotionSourceGroup {
	char bHasAdditiveSources : 1; // 0x28
	char bHasOverrideSources : 1; // 0x28
	char bHasOverrideSourcesWithIgnoreZAccumulate : 1; // 0x28
	char bIsAdditiveVelocityApplied : 1; // 0x28
	FRootMotionSourceSettings LastAccumulatedSettings; // 0x29
	FVector_NetQuantize10 LastPreAdditiveVelocity; // 0x2c
};

struct FAnimalsMovingAnims {
	UBlendSpace* Moving_F_Arch; // 0x0
	UBlendSpace* Moving_Fkpd; // 0x8
	UBlendSpace* Moving_BkPd; // 0x10
};

struct FMediaPlayerTrackOptions {
	int32_t Audio; // 0x0
	int32_t Caption; // 0x4
	int32_t MetaData; // 0x8
	int32_t Script; // 0xc
	int32_t Subtitle; // 0x10
	int32_t Text; // 0x14
	int32_t Video; // 0x18
};

struct FMagicLeapMeshBlockInfo {
	FGuid BlockID; // 0x0
	FVector BlockPosition; // 0x10
	FRotator BlockOrientation; // 0x1c
	FVector BlockDimensions; // 0x28
	FTimespan Timestamp; // 0x38
	EMagicLeapMeshState BlockState; // 0x40
};

struct FKBoxElem : FKShapeElem {
	FVector Center; // 0x38
	FRotator Rotation; // 0x44
	float X; // 0x50
	float Y; // 0x54
	float Z; // 0x58
};

struct FOfficalTaxInfo {
	int32_t ServerId; // 0x0
	int32_t CityId; // 0x4
	int32_t OfficalJobTaxType; // 0x8
	float TaxRate; // 0xc
	int64_t TotalTax; // 0x10
};

struct FNamedEmitterMaterial {
	FName Name; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FCrateItemSet {
	USGItem* Item; // 0x0
	float Percent; // 0x8
	float bBlueprintPercent; // 0xc
	int32_t MinAmount; // 0x10
	int32_t MaxAmount; // 0x14
};

struct FNCPoolElement {
	UNiagaraComponent* Component; // 0x0
};

struct FClothLODDataCommon {
	FClothPhysicalMeshData PhysicalMeshData; // 0x0
	FClothCollisionData CollisionData; // 0xf8
	bool bUseMultipleInfluences; // 0x138
	float SkinningKernelRadius; // 0x13c
	TArray<uint32_t> OriginalIndexes; // 0x140
	int32_t LODIndex; // 0x150
	int32_t SourceSection; // 0x154
};

struct FWeightmapLayerAllocationInfo {
	ULandscapeLayerInfoObject* LayerInfo; // 0x0
	char WeightmapTextureIndex; // 0x8
	char WeightmapTextureChannel; // 0x9
};

struct FBattleKillEventInfo {
	int32_t BeKilledType; // 0x0
	int32_t RealKillerType; // 0x4
	int32_t KillerGroupType; // 0x8
	FString KillerCharName; // 0x10
	int32_t BeKillerGroupType; // 0x20
	FString BeKillerCharName; // 0x28
	int32_t DamageIconIndex; // 0x38
	char IsDeadEvent : 1; // 0x3c
	char IsSuicide : 1; // 0x3c
};

struct FTimeline {
	ETimelineLengthMode LengthMode; // 0x0
	char bLooping : 1; // 0x1
	char bReversePlayback : 1; // 0x1
	char bPlaying : 1; // 0x1
	float Length; // 0x4
	float PlayRate; // 0x8
	float position; // 0xc
	TArray<FTimelineEventEntry> Events; // 0x10
	TArray<FTimelineVectorTrack> InterpVectors; // 0x20
	TArray<FTimelineFloatTrack> InterpFloats; // 0x30
	TArray<FTimelineLinearColorTrack> InterpLinearColors; // 0x40
	FDelegate TimelinePostUpdateFunc; // 0x50
	FDelegate TimelineFinishedFunc; // 0x60
	TWeakObjectPtr<UObject> PropertySetObject; // 0x70
	FName DirectionPropertyName; // 0x78
};

struct FBuilderPoly {
	TArray<int32_t> VertexIndices; // 0x0
	int32_t Direction; // 0x10
	FName ItemName; // 0x14
	int32_t PolyFlags; // 0x1c
};

struct FPrecomputedSkyLightInstanceData : FSceneComponentInstanceData {
	FGuid LightGuid; // 0xb8
	float AverageBrightness; // 0xc8
};

struct FToggleTrackKey {
	float Time; // 0x0
	ETrackToggleAction ToggleAction; // 0x4
};

struct FMovieSceneBytePropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneByteChannel ByteCurve; // 0x38
};

struct FEngineServiceNotification {
	FString Text; // 0x0
	double TimeSeconds; // 0x10
};

struct FQuestReward {
	EQuestRewardType RewardType; // 0x0
	USGItem* RewardItem; // 0x8
	float RewardValue; // 0x10
};

struct FExposureSettings {
	float FixedEV100; // 0x0
	bool bFixed; // 0x4
};

struct FAIMoveRequest {
	AActor* GoalActor; // 0x0
};

struct FSourceEffectEQBand {
	float Frequency; // 0x0
	float Bandwidth; // 0x4
	float GainDb; // 0x8
	char bEnabled : 1; // 0xc
};

struct FActorComponentInstanceData {
	UObject* SourceComponentTemplate; // 0x8
	EComponentCreationMethod SourceComponentCreationMethod; // 0x10
	int32_t SourceComponentTypeSerializedIndex; // 0x14
	TArray<char> SavedProperties; // 0x18
	FActorComponentDuplicatedObjectData UniqueTransientPackage; // 0x28
	TArray<FActorComponentDuplicatedObjectData> DuplicatedObjects; // 0x38
	TArray<UObject*> ReferencedObjects; // 0x48
	TArray<FName> ReferencedNames; // 0x58
};

struct FPrimaryAssetId {
	FPrimaryAssetType PrimaryAssetType; // 0x0
	FName PrimaryAssetName; // 0x8
};

struct FCreateRoleCameraData {
	FVector RelativeLocation; // 0x0
	FVector2D FreeLocationHLimit; // 0xc
	FVector2D FreeLocationVLimit; // 0x14
	float FOV; // 0x1c
};

struct FMsgClientSetCheatAdminLevel : FMessageBase {
	int32_t AdminLevel; // 0x8
};

struct FARPoseUpdatePayload {
	FTransform WorldTransform; // 0x0
	TArray<FTransform> JointTransforms; // 0x30
};

struct FMorphTargetSliderDataMap {
	TMap<FName, FMorphTargetSliderData> MorphTargetSliderDataMap; // 0x0
};

struct FMaterialEditorPromotionSettings {
	FFilePath DefaultMaterialAsset; // 0x0
	FFilePath DefaultDiffuseTexture; // 0x10
	FFilePath DefaultNormalTexture; // 0x20
};

struct FActiveGameplayCueContainer : FFastArraySerializer {
	TArray<FActiveGameplayCue> GameplayCues; // 0x108
	UAbilitySystemComponent* Owner; // 0x120
};

struct FBattleGuildRelation2D {
	TArray<FBattleGuildRelation1D> BattleGuildRelationData; // 0x0
};

struct FAttachVolumeSphere {
	float Radius; // 0x0
};

struct FPatrolBehaviorPointData {
	FString DataTag; // 0x0
	TArray<FBehaviorPointTimeWeight> TimeWeight; // 0x10
	FRoadPathConfig RoadPathConfig; // 0x20
	FFormationSpawnData FormationConfig; // 0x70
	TArray<int32_t> HasNPCIndexs; // 0xa0
};

struct FMovieSceneEvaluationFieldEntityMetaData {
	FFrameNumber ForcedTime; // 0x0
	ESectionEvaluationFlags Flags; // 0x8
	char bEvaluateInSequencePreRoll : 1; // 0x9
	char bEvaluateInSequencePostRoll : 1; // 0x9
};

struct FSoundTrackKey {
	float Time; // 0x0
	float Volume; // 0x4
	float Pitch; // 0x8
	USoundBase* Sound; // 0x10
};

struct FCameraCacheEntry {
	double Timestamp; // 0x0
	FMinimalViewInfo POV; // 0x10
};

struct FMsgClientGetOccupyDetailInfo : FMessageBase {
	TArray<FOccupyDetailInfo> OccupyDetailInfos; // 0x8
};

struct FMsgClientServerToken : FMessageBase {
	FString Token; // 0x8
	FString ServerToken; // 0x18
};

struct FAnimNode_HandIKRetargeting : FAnimNode_SkeletalControlBase {
	FBoneReference RightHandFK; // 0xc8
	FBoneReference LeftHandFK; // 0xd8
	FBoneReference RightHandIK; // 0xe8
	FBoneReference LeftHandIK; // 0xf8
	TArray<FBoneReference> IKBonesToMove; // 0x108
	float HandFKWeight; // 0x118
};

struct FAIFleeConfigBase {
	int32_t MinLevel; // 0x0
	int32_t MaxLevel; // 0x4
	char bCanForceFlee : 1; // 0x8
	float StartForceFleeHPPercentage; // 0xc
	float EndForceFleeHPPercentage; // 0x10
	float FleeFixedDistance; // 0x14
	float FleeRandomDistance; // 0x18
	float EndFleeHPPercentage; // 0x1c
};

struct FHLODISMComponentDesc {
	UStaticMesh* StaticMesh; // 0x0
	UMaterialInterface* Material; // 0x8
	TArray<FTransform> Instances; // 0x10
};

struct FSpriteGeometryShape {
	ESpriteShapeType ShapeType; // 0x0
	TArray<FVector2D> Vertices; // 0x8
	FVector2D BoxSize; // 0x18
	FVector2D BoxPosition; // 0x20
	float Rotation; // 0x28
	bool bNegativeWinding; // 0x2c
};

struct FGameplayEffectExecutionScopedModifierInfo {
	FGameplayEffectAttributeCaptureDefinition CapturedAttribute; // 0x0
	FGameplayTag TransientAggregatorIdentifier; // 0x40
	EGameplayEffectScopedModifierAggregatorType AggregatorType; // 0x48
	EGameplayModOp ModifierOp; // 0x49
	FGameplayEffectModifierMagnitude ModifierMagnitude; // 0x50
	FGameplayModEvaluationChannelSettings EvaluationChannelSettings; // 0x1f8
	FGameplayTagRequirements SourceTags; // 0x200
	FGameplayTagRequirements TargetTags; // 0x240
};

struct FSwarmDebugOptions {
	char bDistributionEnabled : 1; // 0x0
	char bForceContentExport : 1; // 0x0
	char bInitialized : 1; // 0x0
};

struct FGameplayAbilityTargetingLocationInfo {
	EGameplayAbilityTargetingLocationType LocationType; // 0x10
	FTransform LiteralTransform; // 0x20
	AActor* SourceActor; // 0x50
	UMeshComponent* SourceComponent; // 0x58
	UGameplayAbility* SourceAbility; // 0x60
	FName SourceSocketName; // 0x68
};

struct FStartAnims {
	UAnimMontage* WalkFwdStart; // 0x0
	UAnimMontage* WalkBwdStart; // 0x8
	UAnimMontage* WalkLeftStart; // 0x10
	UAnimMontage* WalkRightStart; // 0x18
};

struct FSourceEffectChorusBaseSettings {
	float Depth; // 0x0
	float Frequency; // 0x4
	float Feedback; // 0x8
	float WetLevel; // 0xc
	float DryLevel; // 0x10
	float Spread; // 0x14
};

struct FAppearanceData {
	int32_t Feature; // 0x0
	FBodyData Body; // 0x4
	FHairData Hair; // 0x1c
	FMoustacheData Moustache; // 0x34
	TArray<FTattooDataGroup> Tattoo; // 0x50
	FEyebrowData Eyebrow; // 0x60
	FEyesData Eyes; // 0x70
	FNoseData Nose; // 0x8c
	FMouthData Mouth; // 0xb4
	FEarsData Ears; // 0xe8
	FCheekData Cheek; // 0x108
	FChinData Chin; // 0x128
	FNeckData Neck; // 0x150
};

struct FNamedColor {
	FColor Value; // 0x0
	FName Name; // 0x4
};

struct FAppearanceFloatWeightData {
	FVector2D RandomRange; // 0x0
	float Weight; // 0x8
};

struct FPlayerShowData {
	FText ShowName; // 0x0
	UAnimMontage* ShowMontage; // 0x18
	TSoftObjectPtr<UTexture2D> SelectedAnimIcon; // 0x20
	TSoftObjectPtr<UTexture2D> UnSelectedAnimIcon; // 0x48
	int32_t DataIndex; // 0x70
	FText Description; // 0x78
	char bNeedUnlock : 1; // 0x90
	TArray<FPlayerShowUnlockDetail> UnLockDatas; // 0x98
};

struct FAnimalFurComponentConfig {
	TArray<FAnimalFurComponentEntry> FurComponentEntries; // 0x0
	float RandomWeight; // 0x10
};

struct FWaterFalloffSettings {
	EWaterBrushFalloffMode FalloffMode; // 0x0
	float FalloffAngle; // 0x4
	float FalloffWidth; // 0x8
	float EdgeOffset; // 0xc
	float ZOffset; // 0x10
};

struct FExposedValueCopyRecord {
	int32_t CopyIndex; // 0x0
	EPostCopyOperation PostCopyOperation; // 0x4
};

struct FMovieSceneTrackInstanceEntry {
	UObject* BoundObject; // 0x0
	UMovieSceneTrackInstance* TrackInstance; // 0x8
};

struct FNiagaraInputConditionMetadata {
	FName InputName; // 0x0
	TArray<FString> TargetValues; // 0x8
};

struct FSourceEffectFilterAudioBusModulationSettings {
	UAudioBus* AudioBus; // 0x0
	int32_t EnvelopeFollowerAttackTimeMsec; // 0x8
	int32_t EnvelopeFollowerReleaseTimeMsec; // 0xc
	float EnvelopeGainMultiplier; // 0x10
	ESourceEffectFilterParam FilterParam; // 0x14
	float MinFrequencyModulation; // 0x18
	float MaxFrequencyModulation; // 0x1c
	float MinResonanceModulation; // 0x20
	float MaxResonanceModulation; // 0x24
};

struct FPicLinkConfig {
	TSoftObjectPtr<UTexture2D> PicTexture; // 0x0
	FString PicLinkUrl; // 0x28
	char bShowAtMainLand : 1; // 0x38
};

struct FBasePlayerDataInfo {
	FString UniqueId; // 0x0
	FString SavedNetworkAddress; // 0x10
	uint32_t CharacterDataVersion; // 0x20
	FString SaveTime; // 0x28
	FString PlayerCharacterName; // 0x38
	FGuid PlayerDataGuid; // 0x48
	FGuid GuildOwnerGuid; // 0x58
	FGuid AllianceOwnerGuid; // 0x68
	int32_t OfficialJob; // 0x78
};

struct FActorSequenceObjectReference {
	EActorSequenceObjectReferenceType Type; // 0x0
	FGuid ActorId; // 0x4
	FString PathToComponent; // 0x18
};

struct FBuffReduceDamagePara {
	float Damage; // 0x0
	float DamageDivisionAdd; // 0x4
};

struct FARFaceUpdatePayload {
	FARSessionPayload SessionPayload; // 0x0
	FVector LeftEyePosition; // 0x18
	FVector RightEyePosition; // 0x24
	FVector LookAtTarget; // 0x30
};

struct FAnimNode_LayeredBoneBlend : FAnimNode_Base {
	FPoseLink BasePose; // 0x10
	TArray<FPoseLink> BlendPoses; // 0x20
	TArray<FInputBlendPose> LayerSetup; // 0x30
	TArray<float> BlendWeights; // 0x40
	bool bMeshSpaceRotationBlend; // 0x50
	bool bMeshSpaceScaleBlend; // 0x51
	ECurveBlendOption CurveBlendOption; // 0x52
	bool bBlendRootMotionBasedOnRootBone; // 0x53
	int32_t LODThreshold; // 0x58
	TArray<FPerBoneBlendWeight> PerBoneBlendWeights; // 0x60
	FGuid SkeletonGuid; // 0x70
	FGuid VirtualBoneGuid; // 0x80
};

struct FStructSerializerSetTestStruct {
	TSet<FString> StrSet; // 0x0
	TSet<int32_t> IntSet; // 0x50
	TSet<FName> NameSet; // 0xa0
	TSet<FStructSerializerBuiltinTestStruct> StructSet; // 0xf0
};

struct FMovieSceneAudioSectionTemplate : FMovieSceneEvalTemplate {
	UMovieSceneAudioSection* AudioSection; // 0x20
};

struct FFunctionResourceEntry {
	USGItem* ItemTemplate; // 0x0
	int32_t Amount; // 0x8
};

struct FGuildEventToolTipData {
	char bIsVaild : 1; // 0x0
	EEventGuildType EventGuildType; // 0x1
	EGuildEventModifyType EventGuildModifyType; // 0x2
	int32_t EventGuildModifyIndex; // 0x4
	float ModifyConflictValue; // 0x8
	float DelayRemainTime; // 0xc
};

struct FCameraCutInfo {
	FVector Location; // 0x0
	float Timestamp; // 0xc
};

struct FGameplayCueTranslationLink {
	UGameplayCueTranslator* RulesCDO; // 0x0
};

struct FDestructibleDepthParameters {
	EImpactDamageOverride ImpactDamageOverride; // 0x0
};

struct FNPCSpawnData {
	FString SpawnDataName; // 0x0
	TArray<ABaseCharacter*> NpcTemplateClasses; // 0x10
	TArray<int32_t> NpcSpawnGroupMinNum; // 0x20
	TArray<int32_t> NpcSpawnGroupMaxNum; // 0x30
	float NpcSpawnGroupDistance; // 0x40
	TArray<float> NpcSpawnWeight; // 0x48
	TArray<float> NpcMinLevelOffset; // 0x58
	TArray<float> NpcMaxLevelOffset; // 0x68
	TArray<char> NpcOverrideLevel; // 0x78
	TArray<float> NpcMinQualityCorrection; // 0x88
	TArray<float> NpcMaxQualityCorrection; // 0x98
	TArray<float> MinDistanceToPlayer; // 0xa8
	TArray<float> MaxDistanceToPlayer; // 0xb8
	TArray<float> NpcSenseSightRadiusMulAdd; // 0xc8
	TArray<char> NpcOverrideAllowSleep; // 0xd8
	TArray<FString> NpcStartSleepTime; // 0xe8
	TArray<FString> NpcEndSleepTime; // 0xf8
	float Weight; // 0x108
	char bRandomNPCAppearance : 1; // 0x10c
	UCharacterRandomAppearanceWeight* RandomAppearanceWeightOverride; // 0x110
	char bRandomNPCAppearanceTemplate : 1; // 0x118
	TArray<FName> NPCAppearanceTemplatesOverride; // 0x120
};

struct FHorizonMultiToggleButtonState {
	FText Text; // 0x0
	FLinearColor TextColor; // 0x18
	FSlateBrush Brush; // 0x28
};

struct FSubdividedQuadVertex {
	int32_t VertexPositionIndex; // 0x0
	FVector2D TextureCoordinate0; // 0x4
	FVector2D TextureCoordinate1; // 0xc
	FColor VertexColor; // 0x14
	FVector VertexNormal; // 0x18
	FVector VertexTangent; // 0x24
	float VertexBinormalSign; // 0x30
};

struct FLiveLinkWorldTime {
	double Time; // 0x0
	double Offset; // 0x8
};

struct FRewardConditionConfigArray {
	TArray<URewardCondition*> ConditionConfigArray; // 0x0
};

struct FNPCSpawnLimit {
	ABaseCharacter* NPCTemplateClass; // 0x0
	float Percentage; // 0x8
};

struct FRotationLimit {
	FVector LimitMin; // 0x0
	FVector LimitMax; // 0xc
};

struct FNodeChain {
	TArray<FName> Nodes; // 0x0
};

struct FBranchingPoint : FAnimLinkableElement {
	FName EventName; // 0x30
	float DisplayTime; // 0x38
	float TriggerTimeOffset; // 0x3c
};

struct FReplicatedStaticActorDestructionInfo {
	UObject* ObjClass; // 0x30
};

struct FCameraPreviewInfo {
	APawn* PawnClass; // 0x0
	UAnimSequence* AnimSeq; // 0x8
	FVector Location; // 0x10
	FRotator Rotation; // 0x1c
	APawn* PawnInst; // 0x28
};

struct FSoundTriggerStateData {
	ESoundTriggerState TriggerState; // 0x0
	int32_t Priority; // 0x4
	TArray<FSoundIntParam> IntParams; // 0x8
	int32_t Level; // 0x18
};

struct FDefaultNotifyText : FTableRowBase {
	FText DefaultText; // 0x8
};

struct FConstructAttachMeshParticle {
	UParticleSystem* ParticleSystem; // 0x0
	FVector RelativeLocation; // 0x8
	FRotator RelativeRotation; // 0x14
	FVector RelativeScale; // 0x20
	FName AttachSocketName; // 0x2c
	char bVisible : 1; // 0x34
	char bSpawnActive : 1; // 0x34
};

struct FAnimalsCustomAttackInfo {
	UAnimMontage* AttackMontage; // 0x0
	float AttackDistance; // 0x8
	float StopAttackDistanceByAdd; // 0xc
};

struct FMovieSceneIntegerPropertySectionTemplate : FMovieScenePropertySectionTemplate {
	FMovieSceneIntegerChannel IntegerCurve; // 0x38
	EMovieSceneBlendType BlendType; // 0xc8
};

struct FOptimizationAnimsConfig {
	char bUseMainHandLayer : 1; // 0x0
	char bRiderUseMainHandLayer : 1; // 0x0
	float MainHandLayerBlendWeight; // 0x4
	char bUseOffHandLayer : 1; // 0x8
	char bRiderUseOffHandLayer : 1; // 0x8
	float OffHandLayerBlendWeight; // 0xc
	UAnimSequence* IdlePoseAnim; // 0x10
	UAnimSequence* IdleLayerPoseAnim; // 0x18
	UAnimSequence* RiderIdlePoseAnim; // 0x20
	UAnimSequence* RiderIdleLayerPoseAnim; // 0x28
	UAnimSequence* IdleAdditiveAnim; // 0x30
	UAimOffsetBlendSpace* BaseAO; // 0x38
	UAimOffsetBlendSpace* OffHandAO; // 0x40
	UBlendSpace* Moving; // 0x48
	UBlendSpace* MovingFkd; // 0x50
	UBlendSpace* MovingBkd; // 0x58
	UAimOffsetBlendSpace* RiderAO; // 0x60
	UAimOffsetBlendSpace* RiderOffHandAO; // 0x68
	UAimOffsetBlendSpace* RiderAttackAO_U; // 0x70
	UAimOffsetBlendSpace* RiderAttackAO_D; // 0x78
	UAimOffsetBlendSpace* RiderAttackAO_L; // 0x80
	UAimOffsetBlendSpace* RiderAttackAO_R; // 0x88
	UAnimSequence* JumpStart; // 0x90
	UAnimSequence* JumpFlail; // 0x98
	UAnimSequence* JumpFalling; // 0xa0
	UAnimSequence* JumpLand; // 0xa8
	UBlendSpace* JumpLeanBS; // 0xb0
};

struct FGlobalMapActorTipsDataArray {
	TArray<FGlobalMapActorTipData> TipsDatas; // 0x0
};

struct FActiveGameplayEffect : FFastArraySerializerItem {
	FGameplayEffectSpec Spec; // 0x18
	FPredictionKey PredictionKey; // 0x2b0
	double StartServerWorldTime; // 0x2c0
	double CachedStartServerWorldTime; // 0x2c8
	double StartWorldTime; // 0x2d0
	bool bIsInhibited; // 0x2d8
};

struct FCurveEdEntry {
	UObject* CurveObject; // 0x0
	FColor CurveColor; // 0x8
	FString CurveName; // 0x10
	int32_t bHideCurve; // 0x20
	int32_t bColorCurve; // 0x24
	int32_t bFloatingPointColorCurve; // 0x28
	int32_t bClamp; // 0x2c
	float ClampLow; // 0x30
	float ClampHigh; // 0x34
};

struct FScalabilitySettingsConfig : FTableRowBase {
	FText ConsoleVariableName; // 0x8
	bool bAsPercent; // 0x20
};

struct FAnimNode_BlendListByInt : FAnimNode_BlendListBase {
	int32_t ActiveChildIndex; // 0x98
};

struct FRootMotionSource_RadialForce : FRootMotionSource {
	FVector Location; // 0x98
	AActor* LocationActor; // 0xa8
	float Radius; // 0xb0
	float Strength; // 0xb4
	bool bIsPush; // 0xb8
	bool bNoZForce; // 0xb9
	UCurveFloat* StrengthDistanceFalloff; // 0xc0
	UCurveFloat* StrengthOverTime; // 0xc8
	bool bUseFixedWorldDirection; // 0xd0
	FRotator FixedWorldDirection; // 0xd4
};

struct FFindFloorResult {
	char bBlockingHit : 1; // 0x0
	char bWalkableFloor : 1; // 0x0
	char bLineTrace : 1; // 0x0
	float FloorDist; // 0x4
	float LineDist; // 0x8
	FHitResult HitResult; // 0xc
};

struct FAnimSlotGroup {
	FName GroupName; // 0x0
	TArray<FName> SlotNames; // 0x8
};

struct FAnimTrack {
	TArray<FAnimSegment> AnimSegments; // 0x0
};

struct FSubmixEffectMultibandCompressorSettings {
	ESubmixEffectDynamicsProcessorType DynamicsProcessorType; // 0x0
	ESubmixEffectDynamicsPeakMode PeakMode; // 0x1
	float LookAheadMsec; // 0x4
	bool bLinkChannels; // 0x8
	bool bAnalogMode; // 0x9
	bool bFourPole; // 0xa
	TArray<FDynamicsBandSettings> Bands; // 0x10
};

struct FReplicatedPredictionKeyItem : FFastArraySerializerItem {
	FPredictionKey PredictionKey; // 0x10
};

struct FSolverBreakingData {
	FVector Location; // 0x0
	FVector Velocity; // 0xc
	FVector AngularVelocity; // 0x18
	float Mass; // 0x24
	int32_t ParticleIndex; // 0x28
	int32_t ParticleIndexMesh; // 0x2c
};

struct FMovieSceneEditorData {
	TMap<FString, FMovieSceneExpansionState> ExpansionStates; // 0x0
	TArray<FString> PinnedNodes; // 0x50
	double ViewStart; // 0x60
	double ViewEnd; // 0x68
	double WorkStart; // 0x70
	double WorkEnd; // 0x78
	TSet<FFrameNumber> MarkedFrames; // 0x80
	FFloatRange WorkingRange; // 0xd0
	FFloatRange ViewRange; // 0xe0
};

struct FShooterWeaponData {
	char bUseAutoReload : 1; // 0x0
	char bUseShooterPull : 1; // 0x0
	char bUseShooterShake : 1; // 0x0
	float StartAimTime; // 0x4
	float StartPullTime; // 0x8
	float PullHoldTime; // 0xc
	float PullHoldBreathTime; // 0x10
	float PullShakeTime; // 0x14
	float CancelAttackTime; // 0x18
	float RlxReloadTime; // 0x1c
	float AimReloadTime; // 0x20
	float ContinuousReloadTime; // 0x24
	float RangeAddSpeed; // 0x28
	float ProjectileRange; // 0x2c
	float ChangedGravityProjectileRangeMulti; // 0x30
	TArray<ECustomMovementMode> IgnoreReloadMovementModes; // 0x38
};

struct FAnimalsNeighConfig {
	char bUseAgainPressedBackward : 1; // 0x0
	char bIsNeighing : 1; // 0x0
	char bUsePlayNeigh : 1; // 0x0
	char bUseComplexTrace : 1; // 0x0
	float NeighMaxStepHeight; // 0x4
	float NeighSpeedLimit; // 0x8
	float HandbrakeSpeedLimit; // 0xc
	FName CapsuleHeadSocket; // 0x10
	FName CapsulePelvisSocket; // 0x18
	FName CapsuleSpine1Socket; // 0x20
	FName CapsuleSpine2Socket; // 0x28
	FName NeighProfileName; // 0x30
	ETraceTypeQuery TraceChannel; // 0x38
	char bShowCapsuleTrace : 1; // 0x39
	char bEnableRiderNeighRagdoll : 1; // 0x39
	char bIsRiderNehighing : 1; // 0x39
	char bShowForwardTrace : 1; // 0x39
	char bIsForwardBlocking : 1; // 0x39
	char bIsForwardBlockingMovement : 1; // 0x39
	float ForwardCapsuleRadius; // 0x3c
	float ForwardCapsuleHeight; // 0x40
	FVector2D ForwardCapsuleStopDistance; // 0x44
	char bShowBackwardTrace : 1; // 0x4c
	char bIsBackwardBlocking : 1; // 0x4c
	float BackwardCapsuleRadius; // 0x50
	float BackwardCapsuleHeight; // 0x54
};

struct FBlueprintInputTouchDelegateBinding : FBlueprintInputDelegateBinding {
	EInputEvent InputKeyEvent; // 0x4
	FName FunctionNameToBind; // 0x8
};

struct FNiagaraVariableWithOffset : FNiagaraVariableBase {
	int32_t Offset; // 0xc
};

struct FClusterNode {
	FVector BoundMin; // 0x0
	int32_t FirstChild; // 0xc
	FVector BoundMax; // 0x10
	int32_t LastChild; // 0x1c
	int32_t FirstInstance; // 0x20
	int32_t LastInstance; // 0x24
	FVector MinInstanceScale; // 0x28
	FVector MaxInstanceScale; // 0x34
};

struct FNiagaraPlatformSetCVarCondition {
	FName CVarName; // 0x0
	bool Value; // 0x8
	int32_t MinInt; // 0xc
	int32_t MaxInt; // 0x10
	float MinFloat; // 0x14
	float MaxFloat; // 0x18
	char bUseMinInt : 1; // 0x1c
	char bUseMaxInt : 1; // 0x1c
	char bUseMinFloat : 1; // 0x1c
	char bUseMaxFloat : 1; // 0x1c
};

struct FGerstnerWaveOctave {
	int32_t NumWaves; // 0x0
	float AmplitudeScale; // 0x4
	float MainDirection; // 0x8
	float SpreadAngle; // 0xc
	bool bUniformSpread; // 0x10
};

struct FGovernmentData : FTableRowBase {
	FString GovernmentName; // 0x8
	FVector2D GovernmentPosition; // 0x18
	FName OccupiedGuildID; // 0x20
};

struct FPooledCameraShakes {
	TArray<UCameraShakeBase*> PooledShakes; // 0x0
};

struct FHairCardsTextureSettings {
	int32_t AtlasMaxResolution; // 0x0
	int32_t PixelPerCentimeters; // 0x4
	int32_t LengthTextureCount; // 0x8
	int32_t DensityTextureCount; // 0xc
};

struct FEQSParametrizedQueryExecutionRequest {
	UEnvQuery* QueryTemplate; // 0x0
	TArray<FAIDynamicParam> QueryConfig; // 0x8
	FBlackboardKeySelector EQSQueryBlackboardKey; // 0x18
	EEnvQueryRunMode RunMode; // 0x40
	char bUseBBKeyForQueryTemplate : 1; // 0x44
};

struct FSceneActorChangeLocRot {
	AActor* SceneActor; // 0x0
	FVector SceneActorLoc; // 0x8
	FRotator SceneActorRot; // 0x14
};

struct FStaticMeshComponentInstanceData : FPrimitiveComponentInstanceData {
	UStaticMesh* StaticMesh; // 0x100
	TArray<FStaticMeshVertexColorLODData> VertexColorLODs; // 0x108
	TArray<FGuid> CachedStaticLighting; // 0x118
	TArray<FStreamingTextureBuildInfo> StreamingTextureData; // 0x128
};

struct FRewardItem {
	int32_t ItemIndex; // 0x0
	int32_t ItemNum; // 0x4
	EItemQuality iQuality; // 0x8
};

struct FVector4 {
	float X; // 0x0
	float Y; // 0x4
	float Z; // 0x8
	float W; // 0xc
};

struct FMovieSceneActorReferenceSectionTemplate : FMovieSceneEvalTemplate {
	FMovieScenePropertySectionData PropertyData; // 0x20
	FMovieSceneActorReferenceData ActorReferenceData; // 0x38
};

struct FMovieSceneTangentData {
	float ArriveTangent; // 0x0
	float LeaveTangent; // 0x4
	float ArriveTangentWeight; // 0x8
	float LeaveTangentWeight; // 0xc
	ERichCurveTangentWeightMode TangentWeightMode; // 0x10
};

struct FNpcSpawnVolumeData {
	ANpcSpawnVolume* NpcSpawnVolume; // 0x0
	TArray<AActor*> SpawnVolumeFloors; // 0x8
	TArray<FName> SpawnVolumeFloorTags; // 0x18
	float Weight; // 0x28
};

struct FSoundClassProperties {
	float Volume; // 0x0
	float Pitch; // 0x4
	float LowPassFilterFrequency; // 0x8
	float AttenuationDistanceScale; // 0xc
	float StereoBleed; // 0x10
	float LFEBleed; // 0x14
	float VoiceCenterChannelVolume; // 0x18
	float RadioFilterVolume; // 0x1c
	float RadioFilterVolumeThreshold; // 0x20
	char bApplyEffects : 1; // 0x24
	char bAlwaysPlay : 1; // 0x24
	char bIsUISound : 1; // 0x24
	char bIsMusic : 1; // 0x24
	char bCenterChannelOnly : 1; // 0x24
	char bApplyAmbientVolumes : 1; // 0x24
	char bReverb : 1; // 0x24
	float Default2DReverbSendAmount; // 0x28
	FSoundModulationDefaultSettings ModulationSettings; // 0x30
	EAudioOutputTarget OutputTarget; // 0x70
	ESoundWaveLoadingBehavior LoadingBehavior; // 0x71
	USoundSubmix* DefaultSubmix; // 0x78
};

struct FQuartzQuantizationBoundary {
	EQuartzCommandQuantization Quantization; // 0x0
	float Multiplier; // 0x4
	EQuarztQuantizationReference CountingReferencePoint; // 0x8
};

struct FEditorElement {
	int32_t Indices[0x3]; // 0x0
	float Weights[0x3]; // 0xc
};

struct FEventPayload {
	FName EventName; // 0x0
	FMovieSceneEventParameters Parameters; // 0x8
};

struct FAnimalsStartAnims {
	TMap<EAnimalsMovingGaitType, UAnimMontage*> TMap_FwdStart; // 0x0
};

struct FInteriorSettings {
	bool bIsWorldSettings; // 0x0
	float ExteriorVolume; // 0x4
	float ExteriorTime; // 0x8
	float ExteriorLPF; // 0xc
	float ExteriorLPFTime; // 0x10
	float InteriorVolume; // 0x14
	float InteriorTime; // 0x18
	float InteriorLPF; // 0x1c
	float InteriorLPFTime; // 0x20
};

struct FDatasmithCameraFilmbackSettingsTemplate {
	float SensorWidth; // 0x0
	float SensorHeight; // 0x4
};

struct FCachedAnimRelevancyData {
	FName StateMachineName; // 0x0
	FName StateName; // 0x8
};

struct FNiagaraScriptDataUsageInfo {
	bool bReadsAttributeData; // 0x0
};

struct FStableLinkAnimalNetData {
	char bEnable : 1; // 0x0
	char bIsMating : 1; // 0x0
	float MatePercent; // 0x4
	float MateRemainTime; // 0x8
	float NextMateRemainTime; // 0xc
	char bIsPregnancy : 1; // 0x10
	float PregnancyPercent; // 0x14
	float PregnancyRemainTime; // 0x18
	float HPPercent; // 0x1c
	float TamePercent; // 0x20
	float TameRemainTime; // 0x24
	float HungerPercent; // 0x28
};

struct FAngularRangeLimit {
	FVector LimitMin; // 0x0
	FVector LimitMax; // 0xc
	FBoneReference Bone; // 0x18
};

struct FKeyMappingConfig {
	EKeyPressType PressType; // 0x0
	FName KeyName; // 0x4
	char bShift : 1; // 0xc
	char bCtrl : 1; // 0xc
	char bAlt : 1; // 0xc
	char bCmd : 1; // 0xc
	FKey Key; // 0x10
	float AxisScale; // 0x28
};

struct FCheckBoxStyle : FSlateWidgetStyle {
	ESlateCheckBoxType CheckBoxType; // 0x8
	FSlateBrush UncheckedImage; // 0x10
	FSlateBrush UncheckedHoveredImage; // 0x98
	FSlateBrush UncheckedPressedImage; // 0x120
	FSlateBrush CheckedImage; // 0x1a8
	FSlateBrush CheckedHoveredImage; // 0x230
	FSlateBrush CheckedPressedImage; // 0x2b8
	FSlateBrush UndeterminedImage; // 0x340
	FSlateBrush UndeterminedHoveredImage; // 0x3c8
	FSlateBrush UndeterminedPressedImage; // 0x450
	FMargin Padding; // 0x4d8
	FSlateColor ForegroundColor; // 0x4e8
	FSlateColor BorderBackgroundColor; // 0x510
	FSlateSound CheckedSlateSound; // 0x538
	FSlateSound UncheckedSlateSound; // 0x550
	FSlateSound HoveredSlateSound; // 0x568
};

struct FAnimNode_CurveSource : FAnimNode_Base {
	FPoseLink SourcePose; // 0x10
	FName SourceBinding; // 0x20
	float Alpha; // 0x28
	TScriptInterface<ICurveSourceInterface> CurveSource; // 0x30
};

struct FMovieSceneSequencePlaybackSettings {
	char bAutoPlay : 1; // 0x0
	FMovieSceneSequenceLoopCount LoopCount; // 0x4
	float PlayRate; // 0x8
	float StartTime; // 0xc
	char bRandomStartTime : 1; // 0x10
	char bRestoreState : 1; // 0x10
	char bDisableMovementInput : 1; // 0x10
	char bDisableLookAtInput : 1; // 0x10
	char bHidePlayer : 1; // 0x10
	char bHideHud : 1; // 0x10
	char bDisableCameraCuts : 1; // 0x10
	char bPauseAtEnd : 1; // 0x10
};

struct FAnimNode_MakeDynamicAdditive : FAnimNode_Base {
	FPoseLink Base; // 0x10
	FPoseLink Additive; // 0x20
	bool bMeshSpaceAdditive; // 0x30
};

struct FDelegateRuntimeBinding {
	FString ObjectName; // 0x0
	FName PropertyName; // 0x10
	FName FunctionName; // 0x18
	FDynamicPropertyPath SourcePath; // 0x20
	EBindingKind Kind; // 0x48
};

struct FSGAchievementMap {
	TMap<FString, USGAchievement*> Achievements; // 0x0
};

struct FChaosDestructionEvent {
	FVector position; // 0x0
	FVector Normal; // 0xc
	FVector Velocity; // 0x18
	FVector AngularVelocity; // 0x24
	float ExtentMin; // 0x30
	float ExtentMax; // 0x34
	int32_t ParticleID; // 0x38
	float Time; // 0x3c
	int32_t Type; // 0x40
};

struct FSmartName {
	FName DisplayName; // 0x0
};

struct FConstraintOffset {
	FVector Translation; // 0x0
	FQuat Rotation; // 0x10
	FVector Scale; // 0x20
	FTransform Parent; // 0x30
};

struct FAnimalAppearanceData {
	char bHasRandomMorph : 1; // 0x0
	float StrongMorph; // 0x4
	float ThinMorph; // 0x8
	int32_t CurAppearanceIndex; // 0xc
	int32_t SkinHuaSeBaseIndex; // 0x10
	int32_t SkinHuaSeMaskIndex; // 0x14
	EAnimalFurColorType CurSkinColorType; // 0x18
	int32_t CurFurCompIndex; // 0x1c
	FLinearColor FurRootColor; // 0x20
	FLinearColor FurTipColor; // 0x30
	FLinearColor FurDyeColor; // 0x40
};

struct FAnimNode_ApplyAdditive : FAnimNode_Base {
	FPoseLink Base; // 0x10
	FPoseLink Additive; // 0x20
	float Alpha; // 0x30
	FInputScaleBias AlphaScaleBias; // 0x34
	int32_t LODThreshold; // 0x3c
	FInputAlphaBoolBlend AlphaBoolBlend; // 0x40
	FName AlphaCurveName; // 0x88
	FInputScaleBiasClamp AlphaScaleBiasClamp; // 0x90
	EAnimAlphaInputType AlphaInputType; // 0xc4
	bool bAlphaBoolEnabled; // 0xc5
};

struct FDistanceField_Parameters {
	FString DIstanceFieldAO_5_489710834AC340F42FDA2BB345A2B8EB; // 0x0
	FString DistanceFieldGI_6_FBCD8D6D4D0552D45A13EEADA59DAB84; // 0x10
	FString DistanceFieldShadow_7_CF6075F14A97CA9A3F6C45A84943932B; // 0x20
	FString DistanceFields_8_44767784480786A8F7821DA8DEB01CB1; // 0x30
};

struct FGuanAiSignInfo {
	int32_t GuanAiId; // 0x0
	FInnerBattleInfo BattleInfo; // 0x8
	int64_t LeftSignTimeTicks; // 0x50
	FGuanAiStateInfo StateInfo; // 0x58
};

struct FActiveGameplayEffectHandle {
	int32_t Handle; // 0x0
	bool bPassedFiltersAndWasExecuted; // 0x4
};

struct FWorldContext {
	FURL LastURL; // 0xd0
	FURL LastRemoteURL; // 0x138
	UPendingNetGame* PendingNetGame; // 0x1a0
	TArray<FFullyLoadedPackagesInfo> PackagesToFullyLoad; // 0x1a8
	TArray<ULevel*> LoadedLevelsForPendingMapChange; // 0x1c8
	TArray<UObjectReferencer*> ObjectReferencers; // 0x1f0
	TArray<FLevelStreamingStatus> PendingLevelStreamingStatusUpdates; // 0x200
	UGameViewportClient* GameViewport; // 0x210
	UGameInstance* OwningGameInstance; // 0x218
	TArray<FNamedNetDriver> ActiveNetDrivers; // 0x220
};

struct FStatColorMapEntry {
	float In; // 0x0
	FColor Out; // 0x4
};

struct FStaticComponentMaskParameter : FStaticParameterBase {
	bool R; // 0x24
	bool G; // 0x25
	bool B; // 0x26
	bool A; // 0x27
};

struct FGeneralChunkInfoHighFrequency {
	float HP; // 0x0
	float MaxHP; // 0x4
	float WoundMaxHPMulAdd; // 0x8
	float SP; // 0xc
	float MaxSP; // 0x10
	float WoundMaxSPMulAdd; // 0x14
	float Hunger; // 0x18
	float MaxHunger; // 0x1c
	FGuid ChunkGuid; // 0x20
	EEnvironmentVolumeType CurrentEVType; // 0x30
	float CurrentEVResistance; // 0x34
};

struct FCharacterClimbLadderConfig {
	char bClimbUseRootMotion : 1; // 0x0
	float ClimbLadderMovementSpeed; // 0x4
	float ClimbLadderStepHeight; // 0x8
	float ClimbLadderExitHeight; // 0xc
	float ClimbBlendInTime; // 0x10
	float ClimbBlendOutTime; // 0x14
	UAnimMontage* AnimMontage_EnterLadderBottom; // 0x18
	UAnimMontage* AnimMontage_EnterLadderTop; // 0x20
	UAnimMontage* AnimMontage_LadderLeftUp; // 0x28
	UAnimMontage* AnimMontage_LadderRightUp; // 0x30
	UAnimMontage* AnimMontage_LadderLeftDown; // 0x38
	UAnimMontage* AnimMontage_LadderRightDown; // 0x40
	UAnimMontage* AnimMontage_ExitLadderBottom; // 0x48
	UAnimMontage* AnimMontage_ExitLadderTop; // 0x50
};

struct FMovieScenePropertyBinding {
	FName PropertyName; // 0x0
	FName PropertyPath; // 0x8
	bool bCanUseClassLookup; // 0x10
};

struct FMedium {
	FAO_Parameters AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7; // 0x0
	FDebug_Parameters Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698; // 0x50
	FGI_Parameters GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C; // 0x168
	FLandscapeAndFoliage_Parameter LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x378
	FReflection_Parameters Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x458
	FShadow_Parameters Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684; // 0x588
	FSkyLight_Parameters SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC; // 0x6a8
	FSSGI_Parameters SSGI_Parameters_305_9CC406044A818EB967A668A89E2BCB07; // 0x748
	FTranslucency_Parameters Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x778
	FWater_Caustics_Parameters WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x8b8
	FMesh_Caustics_Parameters MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0xa68
	FDLSS_Parameters DLSSParameters_310_3A6775704CF641DFEEC2478C297B7D69; // 0xbc8
	FDistanceField_Parameters DistanceFields_313_B40CF12D489E0F07F5A52AAB72C39461; // 0xc80
	FRTX_PostProcess_Settings RTXPostProcessSettings_316_268786DF438462588539E5BAF602ED34; // 0xcc0
	FDataType_Support DataTypeSupport_319_F3DA97704E7BA941885A888135560397; // 0x1230
};

struct FMovieSceneFieldEntry_ChildTemplate {
	uint16_t ChildIndex; // 0x0
	ESectionEvaluationFlags Flags; // 0x2
	FFrameNumber ForcedTime; // 0x4
};

struct FDropFixInfo : FTableRowBase {
	USGItem* ItemClass; // 0x8
	float Weight; // 0x10
};

struct FScalarParameterValue {
	FMaterialParameterInfo ParameterInfo; // 0x0
	float ParameterValue; // 0x10
	FGuid ExpressionGUID; // 0x14
};

struct FSGAnimNode_ModifyBone : FAnimNode_SkeletalControlBase {
	FAnimalsModifyBoneSettings BoneModifier; // 0xc8
	char bAllowEvaluateInactiveWorld : 1; // 0xe0
};

struct FDeathCharacterInfo {
	TWeakObjectPtr<ASGStructureItemContainer> DeathItemContainer; // 0x0
	FVector LastDeathLocation; // 0x8
	FGuid ActorOwnerId; // 0x14
	int64_t LastDeathTimeTick; // 0x28
	ASGPlayerController* ViewController; // 0x30
};

struct FJoinabilitySettings {
	FName SessionName; // 0x0
	bool bPublicSearchable; // 0x8
	bool bAllowInvites; // 0x9
	bool bJoinViaPresence; // 0xa
	bool bJoinViaPresenceFriendsOnly; // 0xb
	int32_t MaxPlayers; // 0xc
	int32_t MaxPartySize; // 0x10
};

struct FBaseGeneralChunkData {
	int32_t ServerId; // 0x0
	int32_t XianChengId; // 0x4
	int32_t TransportXianChengKey; // 0x8
	FGuid TransportMachineGuid; // 0xc
	char bSavedToPlayer : 1; // 0x1c
	int64_t TransportTick; // 0x20
	EGameServerPVPType TransportPVPType; // 0x28
	FString Name; // 0x30
	EGeneralsQualityType GeneralQuality; // 0x40
	EGeneralsSpecialType GeneralSpecialType; // 0x41
	int32_t Level; // 0x44
	float RandomLevel; // 0x48
	EChunkDataStateType ChunkDataStateType; // 0x4c
	ETransportType TransportType; // 0x4d
	EWarType WarType; // 0x4e
	FGuid ChunkGuid; // 0x50
	char bIsReborning : 1; // 0x60
	FDateTime FinalRebornTime; // 0x68
	int32_t LifeCount; // 0x70
	float loyalty; // 0x74
	int32_t Wages; // 0x78
	FDateTime LastGiveWagesTime; // 0x80
	FVector DepositLocation; // 0x88
	int32_t legendGeneralId; // 0x94
	char bIsDeadReborn : 1; // 0x98
	FDateTime RebornDeathDeathTime; // 0xa0
	FDateTime DeathTime; // 0xa8
	int32_t DeathThroughMinutes; // 0xb0
	char bIsKilled : 1; // 0xb4
	TArray<char> ChunkBytes; // 0xb8
	TWeakObjectPtr<ASGGeneralCharacter> GeneralWeakPtr; // 0xc8
	TWeakObjectPtr<ASGGeneralCharacter> PreviewDataGeneralWeakPtr; // 0xd0
	FDateTime LockTime; // 0xd8
	float CapsuleHalfHeight; // 0xe0
};

struct FBaoZangPositionRowBase : FTableRowBase {
	EBaoZangType BaoZangType; // 0x8
	int32_t BaoZangID; // 0xc
	FVector BaoZangPosition; // 0x10
	int32_t MaxPlayerNum; // 0x1c
};

struct FLandscapeProxyMaterialOverride {
	FPerPlatformInt LODIndex; // 0x0
	UMaterialInterface* Material; // 0x8
};

struct FIdleBehaviorInfo {
	float RandomWeight; // 0x0
	float TriggerChance; // 0x4
	EAnimalIdleBehaviorType IdleBehaviorType; // 0x8
	TArray<ESGPhysMaterialType> RequirePhysMaterialTypes; // 0x10
	TArray<FRandomWeightAnim> BehaviorAnims; // 0x20
	int32_t RandomMinCount; // 0x30
	int32_t RandomMaxCount; // 0x34
	char bUseDurationTimeOverride : 1; // 0x38
	float DurationTimeOverrideMin; // 0x3c
	float DurationTimeOverrideMax; // 0x40
	float ToggleToDefaultIdleBehaviorTime; // 0x44
};

struct FAlliancePowerGroupConfig {
	UAlliancePowerGroupSlot* GroupSlotClass; // 0x0
	TSoftObjectPtr<UTexture2D> OfficialSealImageTexture; // 0x8
};

struct FHairCollisionConstraint {
	bool SolveCollision; // 0x0
	bool ProjectCollision; // 0x1
	float StaticFriction; // 0x4
	float KineticFriction; // 0x8
	float StrandsViscosity; // 0xc
	FIntVector GridDimension; // 0x10
	float CollisionRadius; // 0x1c
	FRuntimeFloatCurve RadiusScale; // 0x20
};

struct FBattleGroupDynamicInfo {
	FGuid GuildId; // 0x0
	int32_t GroupScore; // 0x10
	EBattleResultType BattleResult; // 0x14
};

struct FBattleOpenTimeRule {
	TArray<FBattleOpenTimeRuleInfo> OpenTimeRuleInfo; // 0x0
	int32_t NextBattleIndex; // 0x10
	int64_t NextOpenTimeTicks; // 0x18
	int64_t JinXianBeginTimeTicks; // 0x20
	int64_t BeiZhanBeginTimeTicks; // 0x28
	EXianChengBattleStage BattleStage; // 0x30
};

struct FStructureSeatLinkChunkInfo {
	FGuid ChunkUid; // 0x0
	float CurrentHunger; // 0x10
};

struct FResonanceAudioReverbPluginSettings {
	bool bEnableRoomEffects; // 0x0
	bool bGetTransformFromAudioVolume; // 0x1
	FVector RoomPosition; // 0x4
	FQuat RoomRotation; // 0x10
	FVector RoomDimensions; // 0x20
	ERaMaterialName LeftWallMaterial; // 0x2c
	ERaMaterialName RightWallMaterial; // 0x2d
	ERaMaterialName FloorMaterial; // 0x2e
	ERaMaterialName CeilingMaterial; // 0x2f
	ERaMaterialName FrontWallMaterial; // 0x30
	ERaMaterialName BackWallMaterial; // 0x31
	float ReflectionScalar; // 0x34
	float ReverbGain; // 0x38
	float ReverbTimeModifier; // 0x3c
	float ReverbBrightness; // 0x40
};

struct FFloatRange {
	FFloatRangeBound LowerBound; // 0x0
	FFloatRangeBound UpperBound; // 0x8
};

struct FBehaviorPointConfig {
	EBehaviorPointType BehaviorPointType; // 0x0
	FString Description; // 0x8
	TArray<FBehaviorPointData> BehaviorPointData; // 0x18
	TArray<FPatrolBehaviorPointData> PatrolBehaviorPointData; // 0x28
	TArray<ABehaviorPointActor*> BehaviorPointActors; // 0x38
};

struct FCapsuleLimit : FCollisionLimitBase {
	float Radius; // 0x50
	float Length; // 0x54
};

struct FAdaptorPolygon2Group {
	uint32_t RenderingSectionIndex; // 0x0
	int32_t MaterialIndex; // 0x4
	int32_t MaxTriangles; // 0x8
};

struct FMovieSceneNiagaraColorParameterSectionTemplate : FMovieSceneNiagaraParameterSectionTemplate {
	FMovieSceneFloatChannel RedChannel; // 0x40
	FMovieSceneFloatChannel GreenChannel; // 0xe0
	FMovieSceneFloatChannel BlueChannel; // 0x180
	FMovieSceneFloatChannel AlphaChannel; // 0x220
};

struct FInAppPurchaseRestoreInfo2 {
	FString ItemName; // 0x0
	FString ItemId; // 0x10
	FString ValidationInfo; // 0x20
};

struct FClothParameterMask_Legacy {
	FName MaskName; // 0x0
	EWeightMapTargetCommon CurrentTarget; // 0x8
	float MaxValue; // 0xc
	float MinValue; // 0x10
	TArray<float> Values; // 0x18
	bool bEnabled; // 0x28
};

struct FHairBendConstraint {
	bool SolveBend; // 0x0
	bool ProjectBend; // 0x1
	float BendDamping; // 0x4
	float BendStiffness; // 0x8
	FRuntimeFloatCurve BendScale; // 0x10
};

struct FGameServerInfoArray {
	TArray<int32_t> GameServerInfoArray; // 0x0
};

struct FNetworkEmulationProfileDescription {
	FString ProfileName; // 0x0
	FString ToolTip; // 0x10
};

struct FPointDamageEvent : FDamageEvent {
	float Damage; // 0x10
	FVector_NetQuantizeNormal ShotDirection; // 0x14
	FHitResult HitInfo; // 0x20
};

struct FForgeDurableCombination {
	int32_t DurableMin; // 0x0
	int32_t DurableMax; // 0x4
};

struct FKongmingLanternInfo {
	ASGKongmingLantern* KongmingLanternClass; // 0x0
	int32_t Amount; // 0x8
};

struct FSoundWaveSpectralDataEntry {
	float Magnitude; // 0x0
	float NormalizedMagnitude; // 0x4
};

struct FInterpControlPoint {
	FVector PositionControlPoint; // 0x0
	bool bPositionIsRelative; // 0xc
};

struct FGuildEventConfigDetail {
	char bIsEnableEvent : 1; // 0x0
	char bIsGuidEvent : 1; // 0x0
	AActor* TargetClass; // 0x8
	TArray<FGuildEventRegionData> RegionDatas; // 0x10
	int32_t LevelMin; // 0x20
	int32_t LevelMax; // 0x24
	int32_t GuildMemberAverageLevelMin; // 0x28
	int32_t GuildMemberAverageLevelMax; // 0x2c
	float ConflictValueMin; // 0x30
	float ConflictValueMax; // 0x34
	FString GameTimeMin; // 0x38
	FString GameTimeMax; // 0x48
	FString UtcTimeMin; // 0x58
	FString UtcTimeMax; // 0x68
	float Chance; // 0x78
	float Interval; // 0x7c
	char bCheckOccupyProtectTime : 1; // 0x80
	float cd; // 0x84
	float Timeout; // 0x88
	float DelayTime; // 0x8c
	float WarnIntervalTime; // 0x90
	ECapitalType RansomCapitalType; // 0x94
	float RansomCount; // 0x98
	TArray<FGuildEventSpawnDetail> SpawnDetails; // 0xa0
	TArray<FGuildEventModifyConflictEntry> ModifyConflictEntries; // 0xb0
};

struct FActiveHapticFeedbackEffect {
	UHapticFeedbackEffect_Base* HapticEffect; // 0x0
};

struct FNoseData {
	float NoseDepth; // 0x0
	float NoseHeight; // 0x4
	float NoseRidgeCurve; // 0x8
	float NoseRidgeUpperDepth; // 0xc
	float NoseScale; // 0x10
	float NoseTipDepth; // 0x14
	float NoseTipHeight; // 0x18
	float NoseTipWidth; // 0x1c
	float NoseWidth; // 0x20
	float NosePhiltrumWidth; // 0x24
};

struct FTeamAttitudeConfig : FTableRowBase {
	TMap<char, FTeamAttitude> TMap_TeamAttitudeConfig; // 0x8
};

struct FSectionEvaluationData {
	int32_t ImplIndex; // 0x0
	FFrameNumber ForcedTime; // 0x4
	ESectionEvaluationFlags Flags; // 0x8
};

struct FInterpCurvePointQuat {
	float InVal; // 0x0
	FQuat OutVal; // 0x10
	FQuat ArriveTangent; // 0x20
	FQuat LeaveTangent; // 0x30
	EInterpCurveMode InterpMode; // 0x40
};

struct FMovieSceneEasingSettings {
	int32_t AutoEaseInDuration; // 0x0
	int32_t AutoEaseOutDuration; // 0x4
	TScriptInterface<IMovieSceneEasingFunction> EaseIn; // 0x8
	bool bManualEaseIn; // 0x18
	int32_t ManualEaseInDuration; // 0x1c
	TScriptInterface<IMovieSceneEasingFunction> EaseOut; // 0x20
	bool bManualEaseOut; // 0x30
	int32_t ManualEaseOutDuration; // 0x34
};

struct FPaintedVertex {
	FVector position; // 0x0
	FColor Color; // 0xc
	FVector4 Normal; // 0x10
};

struct FActorPerceptionBlueprintInfo {
	AActor* Target; // 0x0
	TArray<FAIStimulus> LastSensedStimuli; // 0x8
	char bIsHostile : 1; // 0x18
};

struct FMovieSceneEventTriggerData {
	FMovieSceneEventPtrs Ptrs; // 0x0
	FGuid ObjectBindingId; // 0x28
};

struct FHumanFootStepData : FTableRowBase {
	FCustomSoundSetting SurfaceFootSoundSetting[0x10]; // 0x8
	UMaterialInterface* SurfaceFootDecal[0x10]; // 0xa88
	FVector SurfaceFootDecalScale; // 0xb08
	UParticleSystem* SurfaceFootParticle[0x10]; // 0xb18
	FVector SurfaceFootParticleScale; // 0xb98
};

struct FAISenseAffiliationFilter {
	char bDetectEnemies : 1; // 0x0
	char bDetectNeutrals : 1; // 0x0
	char bDetectFriendlies : 1; // 0x0
};

struct FFoliageTypeExtraInfo {
	TMap<FSoftObjectPath, FSoftObjectPath> DestructableMeshPathMap; // 0x0
};

struct FRigidBodyState {
	FVector_NetQuantize100 position; // 0x0
	FQuat Quaternion; // 0x10
	FVector_NetQuantize100 LinVel; // 0x20
	FVector_NetQuantize100 AngVel; // 0x2c
	char Flags; // 0x38
};

struct FPaperSpriteSocket {
	FTransform LocalTransform; // 0x0
	FName SocketName; // 0x30
};

struct FConstraintData {
	FConstraintDescriptor Constraint; // 0x0
	float Weight; // 0x10
	bool bMaintainOffset; // 0x14
	FTransform Offset; // 0x20
	FTransform CurrentTransform; // 0x50
};

struct FVertexInstancesForPolygonHole {
	TArray<FVertexIndexAndInstanceID> VertexIndicesAndInstanceIDs; // 0x0
};

struct FGeneralPeaceTameRequireItem {
	USGItem* RequireItem; // 0x0
	int32_t MinAmount; // 0x8
	int32_t MaxAmount; // 0xc
	float Weight; // 0x10
	float PerAmountAddTame; // 0x14
};

struct FAnimLegIKDefinition {
	FBoneReference IKFootBone; // 0x0
	FBoneReference FKFootBone; // 0x10
	int32_t NumBonesInLimb; // 0x20
	float MinRotationAngle; // 0x24
	EAxis FootBoneForwardAxis; // 0x28
	EAxis HingeRotationAxis; // 0x29
	bool bEnableRotationLimit; // 0x2a
	bool bEnableKneeTwistCorrection; // 0x2b
};

struct FLevelSequenceBindingReference {
	FString PackageName; // 0x0
	FSoftObjectPath ExternalObjectPath; // 0x10
	FString ObjectPath; // 0x28
};

struct FMovieSceneGeometryCollectionParams {
	FSoftObjectPath GeometryCollectionCache; // 0x8
	FFrameNumber StartFrameOffset; // 0x20
	FFrameNumber EndFrameOffset; // 0x24
	float PlayRate; // 0x28
};

struct FSynth1PatchCable {
	float Depth; // 0x0
	ESynth1PatchDestination Destination; // 0x4
};

struct FMovieSceneObjectPathChannel : FMovieSceneChannel {
	UObject* PropertyClass; // 0x8
	TArray<FFrameNumber> Times; // 0x10
	TArray<FMovieSceneObjectPathChannelKeyValue> Values; // 0x20
	FMovieSceneObjectPathChannelKeyValue DefaultValue; // 0x30
};

struct FActivityRankRewardMsgStu {
	EWorldRankType RankType; // 0x0
	FString RankName; // 0x8
	char BeginIndex; // 0x18
	char EndIndex; // 0x19
	char RewardIndex; // 0x1a
};

struct FMovieSceneSlomoSectionTemplate : FMovieSceneEvalTemplate {
	FMovieSceneFloatChannel SlomoCurve; // 0x20
};

struct FNotifyText : FTableRowBase {
	FText Text; // 0x8
};

struct FTaishouBattleTeamUI {
	UTaishouTeamInfoSlot* TeamInfoSlot; // 0x0
	UImage* Image_GuildNameBg; // 0x8
	UImage* Image_WinLine; // 0x10
	UTextBlock* CoutryGuildName; // 0x18
};

struct FAnimBlueprintFunctionData {
	TFieldPath<FStructProperty> OutputPoseNodeProperty; // 0x0
	TArray<TFieldPath<FStructProperty>> InputPoseNodeProperties; // 0x20
	TArray<TFieldPath<FProperty>> InputProperties; // 0x30
};

struct FAnimNode_ModifyCurve : FAnimNode_Base {
	FPoseLink SourcePose; // 0x10
	TArray<float> CurveValues; // 0x20
	TArray<FName> CurveNames; // 0x30
	float Alpha; // 0x50
	EModifyCurveApplyMode ApplyMode; // 0x54
};

struct FNiagaraDetailsLevelScaleOverrides {
	float Low; // 0x0
	float Medium; // 0x4
	float High; // 0x8
	float Epic; // 0xc
	float Cine; // 0x10
};

struct FStructRedirect {
	FName OldStructName; // 0x0
	FName NewStructName; // 0x8
};

struct FAdaptorPolygon {
	FPolygonGroupID PolygonGroupID; // 0x0
	TArray<FAdaptorTriangleID> TriangulatedPolygonTriangleIndices; // 0x8
};

struct FConstraintDescription {
	bool bTranslation; // 0x0
	bool bRotation; // 0x1
	bool bScale; // 0x2
	bool bParent; // 0x3
	FFilterOptionPerAxis TranslationAxes; // 0x4
	FFilterOptionPerAxis RotationAxes; // 0x7
	FFilterOptionPerAxis ScaleAxes; // 0xa
};

struct FLightningParams {
	FLinearColor Color; // 0x0
	UCurveFloat* RootParticlesWidth; // 0x10
	UCurveFloat* BranchParticlesWidth; // 0x18
	float ParticlesWidthScale; // 0x20
	float EffectDamagePlayInnerRadius; // 0x24
	float EffectDamagePlayOuterRadius; // 0x28
	bool bInstant; // 0x2c
	bool bWantsAffectWorldLighting; // 0x2d
	FFloatRange SparkVelocityRange; // 0x30
	FFloatRange SparkVelocityFading; // 0x40
	FFloatRange SparkDelayRange; // 0x50
	float NoiseMult; // 0x60
	float SparkStep; // 0x64
	UCurveFloat* FlashingCurve; // 0x68
	FFloatRange FlashingRate; // 0x70
	FFloatRange FlashingForce; // 0x80
	float SparkIntensity; // 0x90
